{"word":"AA","summary":{"en":"AA most commonly means Alcoholics Anonymous or the AA battery size, depending on context.","zh":"AA 最常见的意思是“匿名戒酒会”或“AA（5号）电池型号”，具体含义取决于语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Alcoholics Anonymous: an international support group for people who want to stop drinking alcohol.","zh":"匿名戒酒会：一个国际性的互助组织，帮助想停止饮酒的人戒酒。"},"examples":[{"en":"He started going to AA meetings after he decided to quit drinking.","zh":"他决定戒酒后开始参加 AA 的聚会。"},{"en":"AA offers peer support and a structured program to help members stay sober.","zh":"AA 提供同伴支持和结构化的项目，帮助成员保持戒酒状态。"}]},{"partOfSpeech":"n.","definition":{"en":"A battery size: a small cylindrical battery commonly used in remote controls and toys.","zh":"电池型号：一种常见的小型圆柱电池，常用于遥控器和玩具。"},"examples":[{"en":"This remote needs two AA batteries.","zh":"这个遥控器需要两节 AA 电池。"},{"en":"Do you have any AA batteries at home?","zh":"你家里有 AA 电池吗？"}]},{"partOfSpeech":"n.","definition":{"en":"A grade (less common): a mark meaning ‘excellent’ or ‘top level’ in some grading systems.","zh":"成绩等级（较少见）：在某些评分体系中表示“优秀/最高等级”的成绩。"},"examples":[{"en":"She received an AA rating for her performance in that program.","zh":"她在那个项目中的表现获得了 AA 评级。"}]}],"synonyms":["Alcoholics Anonymous","AA battery"],"phonetic":"/ˌeɪˈeɪ/","extraExplanation":["“AA”在不同语境里意思差别很大：在健康/互助语境最常指 Alcoholics Anonymous；在日常生活里常指“5号电池”（AA size）。看到句子时，可以通过上下文（meeting/quit drinking vs. remote/control/toy）来判断。","关于 Alcoholics Anonymous：这是一个以互助与匿名为核心的组织，常提到“AA meeting（AA 聚会）”“12-step program（十二步项目）”。谈论成瘾与康复属于敏感话题，表达时通常用尊重、非评判的语气。"]}
{"word":"aa","summary":{"en":"“AA” is most commonly an abbreviation for Alcoholics Anonymous, a standard battery size, or an Associate of Arts degree—meaning depends on context.","zh":"“AA”最常见是缩写：可指匿名戒酒会、AA（五号）电池，或文学副学士学位，需根据语境判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Alcoholics Anonymous; a support group for people who want to stop drinking alcohol (often written “AA”).","zh":"匿名戒酒会；帮助人们戒酒的互助团体（常写作“AA”）。"},"examples":[{"en":"He started going to AA meetings to get support for staying sober.","zh":"他开始参加AA聚会，获得保持戒酒的支持。"},{"en":"AA is based on peer support and sharing personal experiences.","zh":"AA以同伴互助和分享个人经历为基础。"}]},{"partOfSpeech":"n.","definition":{"en":"A standard battery size, smaller than AAA and often used in small devices (written “AA”).","zh":"一种标准电池型号（AA电池，五号电池），常用于小型设备。"},"examples":[{"en":"This remote control takes two AA batteries.","zh":"这个遥控器需要两节AA电池。"},{"en":"Do you have any spare AAs at home?","zh":"你家里有多余的AA电池吗？"}]},{"partOfSpeech":"n.","definition":{"en":"Associate of Arts; a two-year college degree (written “AA”).","zh":"文学副学士；两年制大学学位（常写作“AA”）。"},"examples":[{"en":"She earned an AA at a community college before transferring to a university.","zh":"她先在社区学院读完AA学位，再转到大学。"}]}],"synonyms":["Alcoholics Anonymous","double A (battery)","Associate of Arts"],"phonetic":"/ˌeɪˈeɪ/","extraExplanation":["“AA/aa”在英文里最常见是缩写，所以具体意思很依赖语境：如果在健康/成瘾话题里，多半指 Alcoholics Anonymous；在电子产品或购物清单里，多半指 AA 电池；在教育背景/简历里，多半指 AA 学位。","在口语里也有人把“AA batteries”简化说成“double A (batteries)”。"]}
{"word":"AAA","summary":{"en":"AAA most commonly refers to the American Automobile Association, but it can also mean the highest credit rating, a small battery size, or a big-budget “AAA” game/movie.","zh":"AAA 最常指美国汽车协会（道路救援等），也可指最高信用评级、AAA 号电池，或游戏/影视行业的“3A大制作”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for the American Automobile Association, a U.S. membership organization that provides roadside assistance, travel services, and insurance-related services","zh":"美国汽车协会（American Automobile Association）的缩写；提供道路救援、旅行服务及相关保险服务等的会员组织"},"examples":[{"en":"If your car won’t start, you can call AAA for roadside assistance.","zh":"如果车打不着，你可以打电话给 AAA 叫道路救援。"},{"en":"We booked our hotel through AAA to get a discount.","zh":"我们通过 AAA 订酒店拿到了折扣。"}]},{"partOfSpeech":"adj.","definition":{"en":"the highest credit rating, meaning extremely strong ability to pay back debt (used for governments, companies, and financial products)","zh":"最高信用评级，表示偿债能力极强（用于国家、公司或金融产品）"},"examples":[{"en":"The country has a AAA credit rating.","zh":"这个国家的信用评级是 AAA。"},{"en":"A AAA-rated bond is considered very low risk, though not risk-free.","zh":"AAA 评级的债券通常被认为风险很低，但并非完全没有风险。"}]},{"partOfSpeech":"n.","definition":{"en":"a battery size (smaller than AA), common in remote controls and small electronics","zh":"AAA 号电池（比 AA 更小），常用于遥控器和小型电子设备"},"examples":[{"en":"This TV remote uses two AAA batteries.","zh":"这个电视遥控器用两节 AAA 电池。"},{"en":"Do you have any spare AAA batteries?","zh":"你有多余的 AAA 电池吗？"}]},{"partOfSpeech":"adj.","definition":{"en":"in gaming and entertainment, “AAA” describes a big-budget, major-studio product","zh":"在游戏与娱乐行业里，“AAA”指大制作、高预算的主流厂牌作品（3A）"},"examples":[{"en":"That studio is known for AAA games with huge budgets.","zh":"那家工作室以高预算的 AAA（3A）游戏闻名。"},{"en":"Indie games can be great even without AAA funding.","zh":"独立游戏即使没有 AAA（3A）资金也能很好玩。"}]}],"synonyms":["triple-A"],"phonetic":"/ˌtrɪpəl ˈeɪ/","extraExplanation":["读法通常是“triple A”（三个A）。写作时常见全大写“AAA”。不同语境含义差很多：在美国日常生活里最常指道路救援的那个 AAA；在财经新闻里常指最高信用评级；在购物清单里可能就是电池型号；在游戏圈里是“3A大作”。"]}
{"word":"aaa","summary":{"en":"AAA most often means “triple-A”: the highest rating/quality level, a big-budget video game, or the American Automobile Association.","zh":"AAA通常读作“triple-A（3A）”：可指最高评级/最高质量等级，也可指高预算的3A游戏，或指美国汽车协会。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a top rating or the highest quality level (especially in finance or products).","zh":"最高等级；顶级评级（尤指金融信用或产品质量）。"},"examples":[{"en":"The company has an AAA credit rating, so it can borrow money at lower interest rates.","zh":"这家公司拥有AAA信用评级，因此可以以更低的利率借款。"},{"en":"Only AAA eggs are used for this product.","zh":"这款产品只使用AAA级鸡蛋。"}]},{"partOfSpeech":"n.","definition":{"en":"(in video games) a big-budget, high-profile game made by a large studio; “triple-A.”","zh":"（电子游戏）3A大作；由大型工作室制作、预算高、宣传强的游戏。"},"examples":[{"en":"Many AAA games take years to develop.","zh":"很多3A游戏需要多年开发。"},{"en":"I prefer indie games to AAA titles.","zh":"比起3A大作，我更喜欢独立游戏。"}]},{"partOfSpeech":"n.","definition":{"en":"the American Automobile Association, a U.S. organization that provides roadside assistance, travel services, and member benefits.","zh":"美国汽车协会（AAA）；提供道路救援、旅行服务及会员福利的美国组织。"},"examples":[{"en":"If your car breaks down, call AAA for roadside assistance.","zh":"如果车抛锚了，可以打电话给AAA求助道路救援。"},{"en":"AAA members can get discounts on hotels.","zh":"AAA会员在酒店常常能享受折扣。"}]}],"synonyms":["triple-A","top-rated","highest-rated"],"phonetic":"/ˌtrɪpəlˈeɪ/","extraExplanation":["“AAA”通常读作“triple-A”（三A），在不同语境下含义差别很大：金融里多指最高信用评级；游戏圈里指“3A大作”；在美国日常生活中也常指“American Automobile Association（美国汽车协会）”。阅读时要靠上下文判断。"]}
{"word":"AAAA","summary":{"en":"AAAA most commonly refers to the AAAA battery size; in other contexts it can simply mean “four A’s” as a label with context-specific meaning.","zh":"AAAA最常见指AAAA型号电池；在其他语境中也可能只是表示“四个A”的标签，含义因场景而异。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very small standard battery size, used in some pens, styluses, and small electronics.","zh":"一种非常小的标准电池型号（四号电池），常见于部分电子笔、触控笔和小型电子设备中。"},"examples":[{"en":"This stylus takes an AAAA battery.","zh":"这支触控笔需要一节AAAA电池。"},{"en":"I couldn’t find AAAA batteries at the corner store.","zh":"我在街角的小店找不到AAAA电池。"}]},{"partOfSpeech":"other","definition":{"en":"Used as a label meaning “four A’s,” often in names or informal ratings; meaning depends on context.","zh":"作为标签表示“四个A”，常见于名称或非正式评级中；具体含义取决于语境。"},"examples":[{"en":"The hotel advertises itself as “AAAA,” but there’s no universal standard for that label.","zh":"这家酒店自称“AAAA”，但这种标签并没有统一标准。"},{"en":"In some contexts, AAAA is just a placeholder name made from repeated letters.","zh":"在某些情况下，AAAA只是由重复字母组成的占位名称。"}]}],"synonyms":["quad-A (battery)"],"phonetic":"/ˌkwɑːdˈeɪ/","extraExplanation":["“AAAA”最常见的实际含义是电池型号（比AAA更细更短）。在购物或说明书里看到“uses an AAAA battery”通常就是指电池尺寸，而不是某种“等级”。","如果你是在计算机或网络里看到“AAAA record”，那是另一个专门含义（IPv6 的DNS记录类型）。需要的话我也可以单独解释。"]}
{"word":"AAAAAA","summary":{"en":"“AAAAAA” is an online way to write a long “Aaa!” sound to show intense emotion (screaming/excitement/fear/frustration).","zh":"“AAAAAA” 是网络上把“啊——！”拉长的写法，用来表达强烈情绪（尖叫、兴奋、害怕、崩溃等）。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"A written representation of a long “Aaa!” sound, used online to show a scream, strong excitement, fear, frustration, or being overwhelmed (often joking or dramatic).","zh":"一种把“啊——！”的长音写出来的网络表达，用来表示尖叫、强烈兴奋、害怕、崩溃/烦躁或被情绪淹没（常带夸张或搞笑语气）。"},"examples":[{"en":"AAAAAA I can’t believe I forgot my password again!","zh":"AAAAAA 我又忘记密码了，太崩溃了！"},{"en":"AAAAAA that jump scare got me!","zh":"AAAAAA 那个突脸吓到我了！"},{"en":"AAAAAA I got the job!!","zh":"AAAAAA 我拿到工作了！！"}]}],"synonyms":["Aaaah!","Ah!","Aah!","Noooo!","OMG"],"phonetic":"/ɑː/","extraExplanation":["在英文网络语境里，用重复字母来拉长声音（如 “soooo”, “noooo”）。因此 “AAAAAA” 常被理解为 “Aaaa!”（类似中文的“啊啊啊啊啊”），具体情绪要看上下文：可能是兴奋，也可能是崩溃或受惊。","正式写作中通常不用这种写法；更常见的标准拼写是 “Aah!”, “Ah!”, “Aaaah!”。"]}
{"word":"AAAL","summary":{"en":"AAAL most commonly refers to the American Association for Applied Linguistics.","zh":"AAAL 最常见指美国应用语言学协会。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"American Association for Applied Linguistics (a professional organization for people who study and work in applied linguistics, such as language teaching, testing, bilingualism, and translation).","zh":"美国应用语言学协会（一个面向应用语言学研究与从业者的专业组织，领域包括语言教学、语言测评、双语研究与翻译等）。"},"examples":[{"en":"She presented her research on second-language learning at AAAL.","zh":"她在 AAAL 上报告了关于第二语言习得的研究。"},{"en":"AAAL holds an annual conference for applied linguists.","zh":"AAAL 每年都会举办应用语言学领域的年度会议。"}]}],"synonyms":["American Association for Applied Linguistics"],"phonetic":"/ˌeɪ.eɪ.eɪˈɛl/","extraExplanation":["“AAAL”通常作为字母缩写逐个读出（A-A-A-L），在学术语境中最常见的指代是“American Association for Applied Linguistics”。如果你是在其他场景看到 AAAL（例如公司名、项目名或其他协会），也可能代表不同机构，需要结合上下文确认。"]}
{"word":"AAAS","summary":{"en":"AAAS is short for the American Association for the Advancement of Science.","zh":"AAAS 是“美国科学促进会”的缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The American Association for the Advancement of Science, a major nonprofit scientific organization in the U.S. that promotes science, supports researchers, and publishes the journal Science.","zh":"美国科学促进会（American Association for the Advancement of Science），美国重要的非营利科学组织，致力于推动科学发展、支持科研人员，并出版《Science（科学）》期刊。"},"examples":[{"en":"She presented her research at the AAAS annual meeting.","zh":"她在 AAAS 年会上展示了自己的研究。"},{"en":"The AAAS publishes the journal Science.","zh":"AAAS 出版《Science（科学）》期刊。"},{"en":"AAAS programs often focus on science education and policy.","zh":"AAAS 的项目常常关注科学教育与科学政策。"}]}],"synonyms":["American Association for the Advancement of Science","the AAAS"],"phonetic":"/ˌeɪ.eɪ.eɪˈes/","extraExplanation":["AAAS 常出现在新闻与学术语境中，尤其与《Science》期刊、年度大会（annual meeting）、以及“科学与公共政策/科普教育”等议题相关。","写作中首次出现通常会先写全称 American Association for the Advancement of Science (AAAS)，之后再用缩写。"]}
{"word":"AAB","summary":{"en":"AAB most commonly refers to a blues lyric pattern where line A repeats and then line B changes; it can also be an ambiguous abbreviation in other contexts.","zh":"AAB 常指布鲁斯歌词的 AAB 结构（A 重复一次，再用 B 变化）；也可能是其他领域的缩略词，需看语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lyric or phrase pattern in which the first line (A) is repeated, then followed by a contrasting line (B); common in blues songs.","zh":"一种歌词/句式结构：第一句（A）重复一次，再接一句不同的（B）；常见于布鲁斯歌曲。"},"examples":[{"en":"Many classic blues verses follow an AAB pattern: the first line repeats, then the third line answers it.","zh":"很多经典布鲁斯歌词采用 AAB 结构：第一句重复，第三句作回应或变化。"},{"en":"The singer uses AAB to build tension and then release it in the last line.","zh":"歌手用 AAB 先铺垫张力，再在最后一句释放。"}]},{"partOfSpeech":"other","definition":{"en":"an initialism that can mean different things in different fields; the exact meaning depends on context.","zh":"一个首字母缩略词，在不同领域含义不同；具体意思取决于语境。"},"examples":[{"en":"In this report, AAB refers to a specific program name, not the music form.","zh":"在这份报告里，AAB 指的是某个项目名称，而不是音乐结构。"},{"en":"If you tell me the context (music, business, science), I can identify what AAB means there.","zh":"如果你告诉我语境（音乐、商业、科学等），我就能判断 AAB 在那里指什么。"}]}],"synonyms":["AAB pattern","AAB form","blues verse form"],"phonetic":"eɪ eɪ biː","extraExplanation":["在音乐里，AAB 尤其常见于“12 小节布鲁斯”（12-bar blues）的歌词写法：A 句唱两遍，第三句 B 常用来补充解释、反问或转折，从而形成“重复—变化”的效果。"]}
{"word":"AaBb","summary":{"en":"AaBb is a genetics genotype meaning heterozygous at two gene loci (Aa and Bb).","zh":"AaBb 是遗传学基因型，表示两个基因位点均为杂合（Aa 和 Bb）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"In genetics, a genotype showing two gene pairs where each pair has one dominant allele (uppercase) and one recessive allele (lowercase): Aa and Bb (a “dihybrid” heterozygote).","zh":"（遗传学）一种基因型写法，表示两个基因位点各含一个显性等位基因（大写）和一个隐性等位基因（小写）：Aa 和 Bb（常称“双杂合/双杂合子”）。"},"examples":[{"en":"The parent with genotype AaBb is heterozygous for both traits.","zh":"基因型为 AaBb 的亲本在两种性状上都是杂合的。"},{"en":"If you cross AaBb × AaBb, you can predict offspring ratios with a Punnett square.","zh":"如果进行 AaBb × AaBb 的杂交，可以用潘尼特方格预测后代比例。"},{"en":"In this lab, AaBb represents one dominant and one recessive allele at each gene.","zh":"在这个实验中，AaBb 表示每个基因位点各有一个显性和一个隐性等位基因。"}]}],"synonyms":["double heterozygote","dihybrid genotype"],"phonetic":"/ˌeɪˌeɪˈbiːˌbiː/","extraExplanation":["在遗传学里，大写字母通常表示“显性”等位基因，小写字母表示“隐性”等位基因。Aa 表示该位点为杂合（一个显性一个隐性），Bb 也同理。","AaBb 常见于“二因子杂交（dihybrid cross）”的教学与题目中，例如用潘尼特方格（Punnett square）推算基因型/表现型比例。"]}
{"word":"Aaberg","summary":{"en":"Aaberg is most commonly a Scandinavian (often Norwegian) surname, and it can also be used as a place name.","zh":"Aaberg 最常见为斯堪的纳维亚（多为挪威）姓氏，也可用作地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), most often of Norwegian/Scandinavian origin.","zh":"（姓氏）阿伯格；常见于挪威/斯堪的纳维亚语系背景的姓。"},"examples":[{"en":"Ms. Aaberg will lead the meeting today.","zh":"阿伯格女士今天将主持会议。"},{"en":"My neighbor’s last name is Aaberg.","zh":"我邻居的姓是阿伯格。"}]},{"partOfSpeech":"n.","definition":{"en":"(also used as a place name) the name of some locations, especially in areas with Scandinavian heritage.","zh":"（亦可作地名）在一些具有斯堪的纳维亚移民背景的地区，可能用作地名。"},"examples":[{"en":"We drove through Aaberg on our way north.","zh":"我们往北走时开车经过了阿伯格。"}]}],"synonyms":["(no true synonyms; it is a proper name)"],"phonetic":"/ˈɑːbɝɡ/","extraExplanation":["“Aaberg”常被认为来自挪威语拼写传统：早期移民在英语环境中有时用“aa”来表示挪威语字母“å”的音（大致类似英语里较偏“aw”的音色）。因此它多见于有北欧移民历史的家庭姓氏，也偶尔出现在地名中。","在英文语境里它通常按姓氏使用：首字母大写，不加冠词（不说 *the Aaberg*，除非指“阿伯格一家人/家族”）。"]}
{"word":"Aachen","summary":{"en":"Aachen is a historic city in western Germany, best known for its hot springs and its famous cathedral.","zh":"Aachen（亚琛）是德国西部的一座历史名城，以温泉和著名的亚琛大教堂最为人所知。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in western Germany (near the borders with Belgium and the Netherlands), known for its hot springs and its historic cathedral.","zh":"亚琛（德国西部城市，靠近比利时和荷兰边境），以温泉和历史悠久的大教堂闻名。"},"examples":[{"en":"Aachen is famous for its cathedral, a UNESCO World Heritage site.","zh":"亚琛以它的大教堂闻名，那是联合国教科文组织的世界遗产。"},{"en":"We took a day trip to Aachen from Cologne by train.","zh":"我们从科隆坐火车去亚琛一日游。"}]},{"partOfSpeech":"n.","definition":{"en":"the Aachen Cathedral (Aachener Dom), an important medieval church in Aachen.","zh":"亚琛大教堂（Aachener Dom），位于亚琛的重要中世纪教堂。"},"examples":[{"en":"The coronation history of Aachen Cathedral attracts many visitors.","zh":"亚琛大教堂的加冕历史吸引了许多游客。"},{"en":"Inside Aachen Cathedral, you can see remarkable medieval art.","zh":"在亚琛大教堂内部，你能看到引人注目的中世纪艺术。"}]}],"synonyms":["Aix-la-Chapelle"],"phonetic":"/ˈɑkən/","extraExplanation":["“Aachen”在德语中通常读作“AH-khen”（其中“ch”是较硬的擦音），但在英语里常被读作/ˈɑkən/，更接近“AH-kən”。","亚琛与查理曼大帝（Charlemagne）关系密切：他把这里作为重要的政治与宗教中心，亚琛大教堂也因此在欧洲中世纪史上地位特殊。"]}
{"word":"aachoo","summary":{"en":"“Aachoo” is an onomatopoeia for a sneeze, used as an exclamation or (in writing) as a noun.","zh":"「aachoo」是表示打噴嚏聲的擬聲詞，可作感嘆詞，也可（在文字中）當名詞使用。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"Used to represent the sound of a sneeze; often said after sneezing.","zh":"（擬聲詞）表示打噴嚏的聲音；也常在打噴嚏後說出。"},"examples":[{"en":"Aachoo! Sorry—I think I’m allergic to the dust.","zh":"啊啾！抱歉——我可能對灰塵過敏。"},{"en":"When she opened the old book, she went, “Aachoo!”","zh":"她一打開那本舊書，就「啊啾！」地打了個噴嚏。"}]},{"partOfSpeech":"n.","definition":{"en":"The sound of a sneeze (used as a noun, especially in writing).","zh":"（名詞，用於書寫）打噴嚏的聲音。"},"examples":[{"en":"We heard an “aachoo” from the next room.","zh":"我們聽到隔壁房間傳來一聲「啊啾」。"}]}],"synonyms":["achoo","atchoo"],"phonetic":"/əˈtʃuː/","extraExplanation":["「aachoo」也常拼作「achoo」，是一種英語擬聲詞，常見於漫畫、兒童讀物、對話字幕等。不同語言對打噴嚏的擬聲不一樣：中文常寫「啊嚏／哈啾」，日文常見「ハクション」。"]}
{"word":"AAE","summary":{"en":"AAE most commonly means African American English, a recognized variety of American English.","zh":"AAE 最常指“非裔美国人英语”，是一种被语言学认可的美式英语变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"African American English: a variety (dialect) of American English strongly associated with many African American communities, with its own pronunciation, vocabulary, and grammar patterns.","zh":"非裔美国人英语：一种与许多非裔美国人社群密切相关的美式英语变体（方言），具有独特的发音、词汇和语法特点。"},"examples":[{"en":"In her paper, she analyzed AAE features in hip-hop lyrics.","zh":"在论文中，她分析了嘻哈歌词中的 AAE 特征。"},{"en":"Some teachers learn about AAE so they can support students without treating their home language as “wrong.”","zh":"一些教师学习 AAE，是为了在不把学生的家庭语言当作“错误”的前提下更好地支持他们。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to African American English.","zh":"与非裔美国人英语相关的；属于 AAE 的。"},"examples":[{"en":"The speaker used an AAE pronunciation in the recording.","zh":"录音里说话者使用了 AAE 的一种发音方式。"}]}],"synonyms":["AAVE","African American Vernacular English","Black English"],"phonetic":"/ˌeɪ.eɪˈiː/","extraExplanation":["AAE 常被称为 AAVE（African American Vernacular English）。在语言学里，它被视为“规则完整的语言变体”，并非“错误英语”。","一些常被讨论的语法现象包括：be 的习惯体用法（habitual be，如 He be working 表示“他经常在工作/他通常在工作”）以及连系动词省略（copula absence，如 She nice 在特定语境下可出现）。这些都有系统的使用条件，并不是随意省略。","在文化与身份层面，AAE 常与音乐（如嘻哈、R&B）、口语幽默与社群表达方式相关；在正式写作或职场沟通中，人们也可能进行语体转换（code-switching），在不同场合使用不同表达。"]}
{"word":"AAEE","summary":{"en":"AAEE is not a standard English word; it is usually an initialism whose meaning depends on context.","zh":"AAEE 不是标准英文单词；通常是缩写，含义取决于上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An uncommon initialism (a set of letters) with no widely agreed standard meaning in general English. Its meaning depends on the specific field (school, business, science, etc.) where it is used.","zh":"一个不常见的英文首字母缩写（由字母组成），在一般英语里没有公认的固定含义。具体意思取决于它出现的领域（学校、商业、科学等）。"},"examples":[{"en":"I saw “AAEE” in the email—what does AAEE stand for here?","zh":"我在邮件里看到“AAEE”——这里的 AAEE 是什么意思/代表什么？"},{"en":"Without context, AAEE is hard to interpret because it could refer to different organizations or programs.","zh":"没有上下文很难判断 AAEE，因为它可能指不同的机构或项目。"}]}],"phonetic":"/ˌeɪˌeɪˈiː/","extraExplanation":["“AAEE”并不是英语里很常见、固定的缩写（不像“USA”“UN”那样）。你能告诉我它出现的句子/领域吗？例如：学校课程、公司部门、学术论文、社交媒体标签等。我就能更准确地解释它可能代表什么。"]}
{"word":"AAF","summary":{"en":"AAF is an abbreviation most commonly meaning the U.S. Army Air Forces (WWII era), and in informal texting it can mean “as a friend.”","zh":"AAF 是缩写：最常见指二战时期的“美国陆军航空军”；在非正式聊天中也可表示“as a friend（只是朋友）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) United States Army Air Forces (the air force branch of the U.S. Army during World War II, before the U.S. Air Force became a separate service).","zh":"（缩写）美国陆军航空军（第二次世界大战期间隶属美国陆军的航空力量；美国空军独立建军前的名称）。"},"examples":[{"en":"My grandfather served in the AAF during World War II.","zh":"我祖父在二战期间曾在美国陆军航空军（AAF）服役。"},{"en":"Many WWII aircraft were designed for the AAF.","zh":"许多二战飞机都是为美国陆军航空军（AAF）设计的。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev., informal texting) “as a friend,” used to clarify that you mean something in a friendly, not romantic, way.","zh":"（缩写，网络/短信）“as a friend”的简写，表示“以朋友的身份/只是朋友”，用来强调不是暧昧或恋爱含义。"},"examples":[{"en":"I like you—AAF.","zh":"我喜欢你——只是朋友那种（AAF）。"},{"en":"Can we hang out this weekend, AAF?","zh":"这周末我们能一起出去玩吗？只是朋友（AAF）？"}]}],"synonyms":["USAAF (for the WWII meaning)"],"phonetic":"/ˌeɪ eɪ ˈɛf/","extraExplanation":["AAF 是缩写，不同领域含义可能不同。若你是在某篇文章、学校/公司文件、聊天记录里看到的 AAF，把原句发我，我可以根据上下文帮你确认最准确的意思。","历史上 AAF（美国陆军航空军）在 1941–1947 年使用；1947 年美国空军（U.S. Air Force）独立建军后，这个名称不再作为现役军种名称使用。"]}
{"word":"AAG","summary":{"en":"AAG is an acronym with several common meanings, especially “Assistant Attorney General” (law) and “acute angle-closure glaucoma” (medicine).","zh":"AAG 是一个多义缩写，常见含义包括法律领域的“Assistant Attorney General（助理司法部长/助理检察长）”与医学领域的“acute angle-closure glaucoma（急性闭角型青光眼）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for Assistant Attorney General (a senior lawyer who helps lead a government justice department, especially in the U.S.).","zh":"Assistant Attorney General 的缩写，意为“助理司法部长/助理检察长”（在美国等司法体系中，协助领导司法部门的高级法律官员）。"},"examples":[{"en":"The AAG spoke at the press conference about the new policy.","zh":"这位 AAG 在新闻发布会上谈到了新政策。"},{"en":"She worked as an AAG in the state’s Department of Justice.","zh":"她在该州司法部担任 AAG（助理司法部长/助理检察长）。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for acute angle-closure glaucoma (a sudden, serious eye condition that needs urgent treatment).","zh":"acute angle-closure glaucoma 的缩写，意为“急性闭角型青光眼”（一种突发且严重、需要紧急治疗的眼科疾病）。"},"examples":[{"en":"The doctor ruled out AAG after checking his eye pressure.","zh":"医生检查眼压后排除了 AAG（急性闭角型青光眼）的可能。"},{"en":"Severe eye pain and blurred vision can be warning signs of AAG.","zh":"剧烈眼痛和视力模糊可能是 AAG（急性闭角型青光眼）的警示信号。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation used in some organizations for Army/Air National Guard or similar terms, depending on the country and context.","zh":"在部分机构中作缩写，可能指陆军/空军国民警卫队等相关称呼，具体含义取决于国家与语境。"},"examples":[{"en":"He said he served in the AAG before starting college.","zh":"他说上大学前在 AAG 服过役（具体指哪个组织要看语境）。"},{"en":"The form asks whether you are affiliated with the AAG.","zh":"表格询问你是否与 AAG 有隶属关系（需结合上下文理解）。"}]}],"synonyms":["abbrev.","initialism"],"phonetic":"ˌeɪˌeɪˈdʒiː","extraExplanation":["“AAG”最常见的特点是：它不是一个固定词义的单词，而是缩写（initialism）。因此在阅读邮件、论文、病历或新闻时，必须结合领域（法律/医学/军队/公司内部）来判断具体含义。","发音通常按字母读：A-A-G。如果你告诉我它出现在哪句话、哪个领域（例如法律文件、眼科报告、学校/公司通知），我可以帮你锁定最准确的释义。"]}
{"word":"aah","summary":{"en":"“Aah” is an interjection used to express sudden feelings (like understanding, pleasure, surprise, or relief) or to show a long “ah” sound in writing.","zh":"“aah”是感叹词，用于表达突然的情绪（如明白了、愉快、惊讶、松口气），也可在书写中表示拉长的“啊”音。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"Used to show a sudden feeling such as pleasure, understanding, surprise, or relief (often said when you realize something or feel comfortable).","zh":"用于表达突然的感受，如愉快、明白了、惊讶或松了一口气（常在恍然大悟或感到舒服时说）。"},"examples":[{"en":"Aah, now I understand what you mean.","zh":"啊，原来我明白你的意思了。"},{"en":"Aah, this coffee is so good.","zh":"啊，这咖啡真好喝。"}]},{"partOfSpeech":"other","definition":{"en":"A written way to represent a long “ah” sound (for example, in dialogue or comics), showing a voice that is relaxed or continuing.","zh":"书写中用来表示拉长的“啊”音（如对话或漫画里），表达声音延长、放松或持续。"},"examples":[{"en":"“Aah…” she sighed and leaned back in her chair.","zh":"“啊……”她叹了口气，靠在椅背上。"},{"en":"The cartoon character said, “Aaaah!” as the massage started.","zh":"按摩开始时，漫画人物说：“啊——！”"}]}],"synonyms":["ah","oh","aha"],"phonetic":"/ɑː/","extraExplanation":["“aah”多用于非正式书写，常见于对话、聊天、小说或漫画，用来更生动地写出口语声音。拼写会变化（如“ah / aah / aaah”），一般来说字母越多表示声音越长或情绪更强。","和中文的“啊/呀/哦”类似，具体情绪要看上下文与标点：例如“Aah.”常显得恍然大悟或满意；“Aah!”更像惊讶或兴奋；“Aah…”常带放松、舒服或叹息的感觉。"]}
{"word":"aahed","summary":{"en":"“Aahed” means “said ‘aah’,” expressing feelings like surprise, delight, or relief.","zh":"“aahed”表示“发出‘啊/aah’的一声”，常用来表达惊讶、喜悦或松了一口气。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"said “aah” (a sound showing surprise, relief, pleasure, or understanding).","zh":"发出“aah/啊”的声音（表示惊讶、松了一口气、愉悦或明白了）。"},"examples":[{"en":"When she opened the gift, she aahed with delight.","zh":"她打开礼物时，开心地“啊”了一声。"},{"en":"The audience aahed at the beautiful sunset scene.","zh":"观众看到美丽的日落画面时发出赞叹的“啊”声。"},{"en":"He aahed in relief when the test was over.","zh":"考试结束时，他如释重负地“啊”了一声。"}]}],"synonyms":["exclaimed","gasped","sighed","marveled"],"phonetic":"/ɑːd/","extraExplanation":["“aahed”是动词“aah”的过去式/过去分词，也常写作“aahed/aahed”对应“aah/ah”。“aah”本身是拟声词（interjection）转作动词，表示“发出啊的一声”。在正式写作中更常见的拼写是“ah/aahed”。"]}
{"word":"aahing","summary":{"en":"“Aahing” means making or saying a long “aah” sound to show admiration, pleasure, surprise, or relief.","zh":"“aahing”指发出或说出拉长的“啊——（aah）”声，用来表示赞叹、愉悦、惊讶或如释重负。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"making a long “aah” sound to show pleasure, admiration, surprise, or relief (often heard in “oohing and aahing”).","zh":"发出拉长的“啊（aah）”的声音，用来表达愉悦、赞叹、惊讶或松一口气（常见于短语“oohing and aahing”）。"},"examples":[{"en":"Everyone was aahing at the fireworks.","zh":"大家都在对烟花赞叹地“啊——”个不停。"},{"en":"He leaned back, aahing with relief after the exam ended.","zh":"考试结束后他往后一靠，如释重负地“啊——”了一声。"},{"en":"The crowd kept oohing and aahing over the new robot.","zh":"人群对这个新机器人不停地“喔——”和“啊——”地惊叹。"}]},{"partOfSpeech":"v.","definition":{"en":"saying “aah” aloud (a written way to show the sound in dialogue).","zh":"把“aah（啊——）”说出口（在对话里用文字写出来表示这种声音）。"},"examples":[{"en":"“Aah, I get it now,” she said.","zh":"“啊——我懂了。”她说。"},{"en":"He opened the box and went, “Aah!”","zh":"他打开盒子，发出一声“啊！”"}]}],"synonyms":["exclaiming","gasping","sighing","oohing (in the phrase “oohing and aahing”)"],"phonetic":"/ˈɑːɪŋ/","extraExplanation":["“aahing”来自感叹词“aah”的动词化形式，表示发出拉长的“啊——”的声音。写法有时也会见到“ahhing / ahh-ing”，都在模仿同一种声音。","“oohing and aahing”是很常见的固定搭配，形容人们对某物（如风景、表演、科技产品）不断发出赞叹声。"]}
{"word":"aahs","summary":{"en":"“Aahs” means multiple “aah” sounds—expressions of admiration, pleasure, relief, or sudden understanding.","zh":"“aahs”指多次或多人发出的“aah（啊——）”感叹声，用来表达赞叹、愉悦、松一口气或恍然大悟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “aah”: sounds people make to show pleasure, relief, admiration, or understanding.","zh":"“aah”的复数：人们发出的声音，用来表示愉悦、松一口气、赞叹或明白了。"},"examples":[{"en":"As the fireworks began, the crowd let out aahs of admiration.","zh":"烟花一开始，人群就发出一阵阵赞叹的“啊——”。"},{"en":"There were aahs and applause when the singer hit the high note.","zh":"歌手唱到高音时，大家发出“啊——”的惊叹并鼓掌。"}]},{"partOfSpeech":"other","definition":{"en":"(informal) a plural label for the interjection “aah,” used in writing to represent several such sounds.","zh":"（非正式）在书面语中用来表示多次/多人发出“aah（啊——）”这种感叹声的写法。"},"examples":[{"en":"The article described the audience’s “aahs” during the magic show.","zh":"文章描写了观众在魔术表演中发出的“aahs（啊——声）”。"},{"en":"In the script, the stage direction reads: “Aahs from the audience.”","zh":"剧本里舞台提示写着：“观众发出一片‘啊——’声。”"}]}],"synonyms":["exclamations","cries of admiration","expressions of delight","oohs (in “oohs and aahs”)"],"phonetic":"/ɑː/","extraExplanation":["“aah”常用于表达惊喜、赞叹、舒服或恍然大悟；复数 aahs 多见于描述“许多人/多次”的反应。","固定搭配：oohs and aahs，意思是“（因新奇或惊艳而）连连惊叹”，常用于形容观众对表演、豪宅、风景等的赞美反应。"]}
{"word":"AAII","summary":{"en":"AAII most commonly refers to the American Association of Individual Investors, and it can also mean the AAII Investor Sentiment Survey used to gauge retail investor mood.","zh":"AAII 通常指“美国个人投资者协会”，也常用来指其“投资者情绪调查”，用于观察散户情绪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the American Association of Individual Investors, a U.S. nonprofit organization that provides education, research, and tools for individual (retail) investors","zh":"美国个人投资者协会（AAII），一个美国非营利组织，为个人（散户）投资者提供投资教育、研究与工具"},"examples":[{"en":"I read an AAII article to learn the basics of dividend investing.","zh":"我读了一篇 AAII 的文章来学习股息投资的基础。"},{"en":"AAII’s resources are aimed at individual investors, not professional fund managers.","zh":"AAII 的资源主要面向个人投资者，而不是专业基金经理。"}]},{"partOfSpeech":"n.","definition":{"en":"a widely cited weekly measure of U.S. retail investor mood, often referring to the AAII Investor Sentiment Survey","zh":"一个常被引用的每周美国散户情绪指标，常指“AAII 投资者情绪调查”"},"examples":[{"en":"AAII sentiment turned more bearish this week.","zh":"本周 AAII 情绪变得更看空。"},{"en":"Some traders watch AAII as a contrarian indicator during extreme readings.","zh":"一些交易者会在极端读数时把 AAII 当作反向指标来参考。"}]}],"synonyms":["American Association of Individual Investors","AAII Investor Sentiment Survey"],"phonetic":"/ˌeɪˌeɪˌaɪˌaɪ/","extraExplanation":["AAII 常出现在财经新闻与研报里，尤其是“AAII Investor Sentiment Survey（投资者情绪调查）”。它通常让受访者选择自己对未来股市的看法：看多（bullish）、看空（bearish）、中性（neutral）。","在市场解读中，有人会把极端的情绪读数当作“反向指标”（contrarian indicator）的一种参考，但它并不是对市场涨跌的保证，只是反映一部分散户的态度。"]}
{"word":"aal","summary":{"en":"AAL is an acronym read as “A-A-L”; its meaning depends on context (often Ambient Assisted Living or the stock ticker for American Airlines).","zh":"AAL是按字母读作“A-A-L”的缩写；含义依语境而定（常见为“环境辅助生活”或美国航空的股票代码）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for a few different things; most commonly used as an acronym read as the letters “A-A-L.” The exact meaning depends on the context (technology, aviation, medicine, etc.).","zh":"“AAL”是一个缩写，通常按字母读作“A-A-L”。具体含义取决于语境（科技、航空、医学等）。"},"examples":[{"en":"In this report, AAL stands for “Ambient Assisted Living,” technology that helps older adults live more safely at home.","zh":"在这份报告里，AAL代表“Ambient Assisted Living（环境辅助生活）”，指帮助老年人更安全居家生活的技术。"},{"en":"AAL is also the stock ticker symbol for American Airlines Group on the NASDAQ.","zh":"AAL也是美国航空集团在纳斯达克的股票代码。"}]}],"synonyms":["initialism","abbreviation","acronym"],"phonetic":"ˌeɪ.eɪˈɛl","extraExplanation":["“AAL”不是一个固定只有单一意思的英语单词，更常见是首字母缩略词（acronym/initialism）。阅读或写作时要看同一段文字里是否给出全称（例如第一次出现时写作：AAL (Ambient Assisted Living)）。","常见用法示例（不同领域含义不同）：\n- 科技/照护：Ambient Assisted Living（用于智慧居家、养老照护）\n- 金融/航空：American Airlines Group 的股票代码 AAL\n- 网络/通信：ATM Adaptation Layer（异步传输模式的适配层，较偏技术）"]}
{"word":"Aalborg","summary":{"en":"Aalborg is a city in northern Denmark.","zh":"Aalborg（奥尔堡）是丹麦北部的一座城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in northern Denmark, located in the region of North Jutland; known for its university, waterfront, and cultural events.","zh":"丹麦北部的一座城市，位于北日德兰地区；以大学、海滨港口与文化活动闻名。"},"examples":[{"en":"I studied abroad in Aalborg for one semester.","zh":"我在奥尔堡交换学习了一个学期。"},{"en":"Aalborg is in northern Denmark, near the Limfjord.","zh":"奥尔堡在丹麦北部，靠近利姆峡湾。"}]}],"phonetic":"/ˈɔl.bɔrɡ/","extraExplanation":["Aalborg 是丹麦语地名；英文里常见读法接近 “AWL-borg”。丹麦语实际发音与英语略不同，末尾的 -g 往往很轻或接近不发音。","这座城市常与 Aalborg University（奥尔堡大学）联系在一起，在工程、计算机与城市研究等领域较有名。"]}
{"word":"Aalesund","summary":{"en":"Alesund is a coastal town in western Norway, well known for Art Nouveau architecture and scenic fjord-area landscapes.","zh":"Alesund（奥勒松）是挪威西部的海滨城市，以新艺术风格建筑与峡湾地区的自然风光闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A coastal town in western Norway, known for its Art Nouveau (Jugendstil) architecture, islands, and nearby fjords.","zh":"挪威西部的一座海滨城市，以新艺术风格（Jugendstil）建筑、群岛景观与邻近峡湾而闻名。"},"examples":[{"en":"Alesund is famous for its Art Nouveau buildings rebuilt after a major fire in 1904.","zh":"奥勒松以其在1904年大火后重建的新艺术风格建筑而著名。"},{"en":"We used Alesund as a base to explore the fjords in western Norway.","zh":"我们以奥勒松为据点，探索挪威西部的峡湾。"}]}],"phonetic":"/ˈoʊləˌsuːnd/","extraExplanation":["该地名常见写法是 **Ålesund**（首字母是挪威语字母 Å），英语里也常写作 **Alesund** 以方便输入。","Å 在挪威语里大致接近英语的“oh”音，因此读起来不像“AA-”，更接近“OH-luh-soond”一类的感觉。","奥勒松在旅游语境中常与“新艺术风格（Art Nouveau/Jugendstil）”“群岛”“峡湾（fjords）”一起出现；附近观景点如 Aksla 观景台很有名。"]}
{"word":"aalii","summary":{"en":"Aalii is a Hawaiian native shrub or small tree (Dodonaea viscosa).","zh":"aalii 指夏威夷原生的一种灌木或小乔木（Dodonaea viscosa）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a native Hawaiian shrub or small tree (Dodonaea viscosa), often found in dry, windy areas; also called ʻAʻaliʻi.","zh":"夏威夷原生的灌木或小乔木（学名 Dodonaea viscosa），常生长在干燥、多风的环境中；也写作 ʻAʻaliʻi。"},"examples":[{"en":"We saw aalii growing along the dry ridge trail.","zh":"我们在干燥的山脊步道旁看到 aalii 生长。"},{"en":"The aalii is a hardy plant that can handle strong winds.","zh":"aalii 是一种很耐风的植物。"},{"en":"In Hawaii, aalii is sometimes used in traditional crafts.","zh":"在夏威夷，aalii 有时会用于传统手工艺。"}]}],"synonyms":["ʻAʻaliʻi","Dodonaea viscosa","hopbush"],"phonetic":"ɑːˈɑːliː","extraExplanation":["“aalii”来自夏威夷语写法“ʻAʻaliʻi”，在英文里常见于夏威夷的自然、植物与生态相关语境。","这种植物在英文里也常被称为“hopbush”（跳草/啤酒花灌木），但“aalii/ʻAʻaliʻi”更能指向夏威夷本地的文化与地理背景。"]}
{"word":"aaliis","summary":{"en":"An alias is another name someone uses, or a way to say “also known as.”","zh":"alias 指“化名/别名”，也可表示“又名/也称为”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a different name that a person uses, often to hide their real identity or for a special purpose","zh":"化名；别名（人使用的另一个名字，常用于隐藏真实身份或特定用途）"},"examples":[{"en":"The writer published the book under an alias.","zh":"这位作家用化名出版了这本书。"},{"en":"He used an alias when he checked into the hotel.","zh":"他登记入住酒店时用了化名。"}]},{"partOfSpeech":"prep.","definition":{"en":"also known as; used to introduce another name for the same person or thing","zh":"又名；也称为（用于引出同一人或事物的另一个名字）"},"examples":[{"en":"Samuel Clemens, alias Mark Twain, became a famous American author.","zh":"塞缪尔·克莱门斯，又名马克·吐温，成为著名的美国作家。"},{"en":"This plant, alias poison ivy, can cause a rash.","zh":"这种植物，又称毒葛，会引起皮疹。"}]}],"synonyms":["pseudonym","assumed name","nickname","a.k.a."],"phonetic":"/ˈeɪliəs/","extraExplanation":["你输入的“aaliis”很可能是“alias”的拼写错误。","“alias”常见于法律、侦探/犯罪题材、网络账号等语境，强调“另一个名字/身份”。日常口语里更常用 a.k.a.（also known as）来表达“又名”。","词源来自拉丁语，意思接近“在另一种方式下/换句话说”，后来发展为“别名、又名”。"]}
{"word":"Aaliyah","summary":{"en":"Aaliyah is a female given name of Arabic origin meaning “high/exalted,” and it is also the name of a famous American R&B singer and actress (1979–2001).","zh":"Aaliyah 是一个源自阿拉伯语的女性名字，常被解释为“崇高/高贵”；它也指一位著名的美国 R&B 歌手兼演员（1979–2001）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A female given name, commonly used in English-speaking countries; it comes from Arabic and is often interpreted as “high, exalted, noble.”","zh":"女性名字，在英语国家较常见；源自阿拉伯语，常被理解为“高贵的、崇高的、尊贵的”。"},"examples":[{"en":"Aaliyah is starting kindergarten this fall.","zh":"Aaliyah 今年秋天要上幼儿园了。"},{"en":"We named our daughter Aaliyah because we liked its meaning and sound.","zh":"我们给女儿取名 Aaliyah，因为喜欢它的含义和读音。"}]},{"partOfSpeech":"other","definition":{"en":"Aaliyah (Aaliyah Dana Haughton, 1979–2001): an influential American singer, actress, and R&B/pop artist often called the “Princess of R&B.”","zh":"Aaliyah（Aaliyah Dana Haughton，1979–2001）：美国有影响力的歌手、演员，R&B/流行音乐人，常被称为“R&B 公主”。"},"examples":[{"en":"Aaliyah’s music helped shape modern R&B.","zh":"Aaliyah 的音乐影响了现代 R&B 的风格。"},{"en":"My favorite Aaliyah song is “Try Again.”","zh":"我最喜欢的 Aaliyah 歌曲是《Try Again》。"}]}],"phonetic":"/ɑːˈliːə/","extraExplanation":["“Aaliyah”常见发音接近“ah-LEE-uh”。拼写里双写的“aa”在英语里主要是保留了转写形式，不一定表示更长的元音。","这个名字与阿拉伯语词根有关，常见解释是“崇高/高贵”。不同地区也可能见到拼写变体，如 Aliyah、Aalia 等；其中“Aliyah”在犹太文化语境里还可能指“移居以色列/上升”的概念（与人名有时会被混淆）。","在流行文化中，提到“Aaliyah”很多时候特指这位歌手；如果在句子里需要更明确，可说“the singer Aaliyah”。"]}
{"word":"aals","summary":{"en":"“AALS” most commonly refers to the Association of American Law Schools; lowercase “aals” can also be the plural of Dutch “aal” (eel).","zh":"“AALS”最常指“美国法学院协会”；小写“aals”也可能是荷兰语“aal（鳗鱼）”的复数。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Association of American Law Schools (an organization of U.S. law schools).","zh":"美国法学院协会（美国法学院的组织/联盟）。"},"examples":[{"en":"She presented her research at the AALS annual meeting.","zh":"她在AALS年会上展示了她的研究。"},{"en":"Many U.S. law schools follow AALS guidelines for faculty hiring.","zh":"许多美国法学院在教师招聘方面会参考AALS的指导原则。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “aal” (a word for an eel, mainly used in Dutch/Afrikaans contexts rather than standard English).","zh":"“aal”的复数（指“鳗鱼”，多见于荷兰语/南非荷兰语语境，非标准英语常用词）。"},"examples":[{"en":"In Dutch, “aal” means eel; “aals” is the plural form.","zh":"在荷兰语中，“aal”意为鳗鱼；“aals”是其复数形式。"}]}],"synonyms":["Association of American Law Schools"],"phonetic":"/ˌeɪ.eɪ.ˈɛl.ɛs/","extraExplanation":["在英语里你更常看到“大写 AALS”作为缩写，读作每个字母的名称（A-A-L-S）。如果你想查的是别的含义（例如某个学校/机构简称、游戏ID或拼写相近的单词），可以告诉我上下文或完整句子，我可以更准确判断。"]}
{"word":"Aalst","summary":{"en":"Aalst is a place name, most commonly a city in Belgium; it can also refer to a village in the Netherlands.","zh":"Aalst 是地名，最常指比利时的一座城市；也可指荷兰的一个村庄。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city and municipality in East Flanders, Belgium, northwest of Brussels.","zh":"比利时东弗兰德省的一座城市与市镇，位于布鲁塞尔西北方向。"},"examples":[{"en":"Aalst is known for its lively annual Carnival celebrations.","zh":"阿尔斯特以热闹的年度狂欢节庆祝活动而闻名。"},{"en":"We took a train from Brussels to Aalst in under an hour.","zh":"我们从布鲁塞尔坐火车到阿尔斯特，不到一小时。"}]},{"partOfSpeech":"n.","definition":{"en":"A village in the Netherlands (North Brabant), near Eindhoven.","zh":"荷兰北布拉班特省的一个村庄，靠近埃因霍温。"},"examples":[{"en":"She grew up in Aalst near Eindhoven before moving abroad.","zh":"她在埃因霍温附近的阿尔斯特长大，后来去了国外。"}]}],"synonyms":["Alost (older/alternative name for the Belgian city)"],"phonetic":"/ɑlst/","extraExplanation":["“Aalst”在英语里通常作为专有名词使用（地名），写作首字母大写。","比利时的Aalst以“Aalst Carnival（阿尔斯特狂欢节）”最为国际知名；该活动也曾因部分争议性内容引发国际讨论。若写作中需要更中性表述，可用“the Aalst Carnival festival”并避免把争议当作定论。"]}
{"word":"Aalto","summary":{"en":"Aalto is a Finnish name, most commonly referring to the architect/designer Alvar Aalto, and it can also refer to Aalto University in Finland.","zh":"Aalto 是芬兰名字，最常指建筑师/设计师阿尔瓦·阿尔托，也可指芬兰的阿尔托大学。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Finnish surname, most famously referring to Alvar Aalto (1898–1976), a major modernist architect and designer.","zh":"芬兰姓氏；最常指阿尔瓦·阿尔托（Alvar Aalto，1898–1976），重要的现代主义建筑师与设计师。"},"examples":[{"en":"The museum added a chair designed by Alvar Aalto to its collection.","zh":"博物馆把一把由阿尔瓦·阿尔托设计的椅子收藏起来了。"},{"en":"Our architecture class studied Aalto’s use of light and natural materials.","zh":"我们的建筑课研究了阿尔托对光线与天然材料的运用。"}]},{"partOfSpeech":"n.","definition":{"en":"(often in Finland) Aalto University, a large university in the Helsinki area.","zh":"（常指芬兰）阿尔托大学：位于赫尔辛基地区的大型大学。"},"examples":[{"en":"She got her master’s degree at Aalto University.","zh":"她在阿尔托大学拿到了硕士学位。"},{"en":"Aalto is known for programs in design, technology, and business.","zh":"阿尔托大学以设计、科技与商科项目闻名。"}]}],"phonetic":"/ˈɑːltoʊ/","extraExplanation":["“Aalto”在芬兰语里本义是“波浪”。因此你会在一些设计与建筑解读中看到“波浪感/流动感”与阿尔托作品联系在一起。","英语里常按拼写读作 /ˈɑːltoʊ/（类似“AL-toe”）。芬兰语原音更接近“长音aa + lto”，但日常英语交流用美式读法即可。","如果写作中第一次提到建筑师，常见格式是“Alvar Aalto”或“the Finnish architect Alvar Aalto”；之后再用“Aalto”单独指代即可。"]}
{"word":"AAM","summary":{"en":"AAM is an abbreviation with multiple meanings; commonly it means “Author Accepted Manuscript” in academic publishing or relates to additive/advanced manufacturing.","zh":"AAM 是多义缩写；常见含义包括学术出版中的“作者接受稿（AAM）”或与增材/先进制造相关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation used for several different phrases; its meaning depends on the field and context (e.g., publishing, engineering, museums).","zh":"一个缩写，在不同领域可代表不同含义；具体意思要看语境（如出版、工程、博物馆等）。"},"examples":[{"en":"In the journal’s policy, authors may share the AAM on a personal website after an embargo period.","zh":"在该期刊政策中，作者在禁运期结束后可以在个人网站分享 AAM。"},{"en":"The lab is researching AAM methods to improve 3D printing quality.","zh":"实验室正在研究 AAM 方法来提升 3D 打印质量。"}]},{"partOfSpeech":"other","definition":{"en":"(publishing) Author Accepted Manuscript: the version of a paper after peer review and revisions, accepted by the journal, but before the final formatted publication.","zh":"（出版）作者接受稿：论文经过同行评审和修改、被期刊接收后的版本，但尚未排版成最终发表版本。"},"examples":[{"en":"The repository allows you to upload the AAM, not the final published PDF.","zh":"该机构库允许你上传 AAM，而不是最终发表的 PDF。"},{"en":"Please cite the published article, even if you read the AAM.","zh":"即使你读的是 AAM，也请引用已发表的正式文章。"}]},{"partOfSpeech":"other","definition":{"en":"(engineering/manufacturing) Additive and Advanced Manufacturing (sometimes used to include 3D printing and related technologies).","zh":"（工程/制造）增材与先进制造（有时用于涵盖 3D 打印及相关技术）。"},"examples":[{"en":"AAM can reduce material waste by building parts layer by layer.","zh":"AAM 可以通过逐层制造零件来减少材料浪费。"},{"en":"She took an AAM course focused on metal 3D printing.","zh":"她上了一门以金属 3D 打印为重点的 AAM 课程。"}]},{"partOfSpeech":"other","definition":{"en":"(museums, US) Association of Art Museum Directors (often abbreviated as AAMD, but sometimes confused with AAM in conversation).","zh":"（美国博物馆界）艺术博物馆馆长协会（常写作 AAMD，但口头或非正式场合有时会被误称为 AAM）。"},"examples":[{"en":"Their policy follows guidance from the AAM/AAMD community.","zh":"他们的政策参考了 AAM/AAMD 社群的指导。"}]}],"synonyms":["initialism","abbreviation"],"phonetic":"/eɪ eɪ ɛm/","extraExplanation":["“AAM”是字母缩写（initialism），通常逐字母读作 /eɪ eɪ ɛm/。阅读时要特别看上下文：出现“journal, peer review, embargo”等词，多半是出版领域的 Author Accepted Manuscript；出现“3D printing, manufacturing”等词，多半与增材/先进制造有关。","如果你告诉我你看到“AAM”的句子或所在领域（例如论文投稿、工程、医疗等），我可以帮你确定最合适的释义并给出更贴切的例句。"]}
{"word":"aam","summary":{"en":"“aam” most commonly means “mango” in South Asian English; it can also be an abbreviation whose meaning depends on context.","zh":"“aam”最常见的意思是南亚英语中的“芒果”；也可能是缩写，具体含义需看语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English; from Hindi/Urdu) a mango.","zh":"（南亚英语；源自印地语/乌尔都语）芒果。"},"examples":[{"en":"In summer, many families buy aam from the market.","zh":"夏天，很多家庭会去市场买 aam（芒果）。"},{"en":"This drink is made with ripe aam and milk.","zh":"这杯饮料是用熟 aam（芒果）和牛奶做的。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for various organizations or terms (meaning depends on context).","zh":"若干组织或术语的缩写（具体含义取决于语境）。"},"examples":[{"en":"AAM may refer to a professional association, depending on the field.","zh":"在不同领域里，AAM 可能指某个专业协会。"},{"en":"Please spell out AAM the first time you use it in a report.","zh":"在报告中第一次使用 AAM 时，请先写出全称。"}]}],"synonyms":["mango"],"phonetic":"/ɑːm/","extraExplanation":["“aam（芒果）”在印度、巴基斯坦等地的英语语境里很常见，尤其是谈到食物时（如 aam juice、aam shake、aam chutney）。在更通用的国际英语里，人们通常直接说 “mango”。","如果你是想问某个特定的缩写 AAM 的意思，请告诉我你看到它的句子或领域（例如医学、工程、学校、公司文件等），我可以帮你确定最可能的全称。"]}
{"word":"AAMSI","summary":{"en":"“AAMSI” is an initialism; its meaning depends on context.","zh":"“AAMSI”是字母缩写；具体含义需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An acronym/initialism that is not a standard English dictionary word. Its meaning depends on the specific organization, program, or document where you saw it (it can stand for different things in different fields).","zh":"一个首字母缩略词/字母缩写，并不是通用英语词典词汇。它的含义取决于你在哪个组织、项目或文件中看到（在不同领域可能代表不同内容）。"},"examples":[{"en":"I saw “AAMSI” in the email, but without context I can’t tell what it stands for.","zh":"我在邮件里看到了“AAMSI”，但没有上下文我无法判断它代表什么。"},{"en":"Could you share the full sentence or the document title where AAMSI appears?","zh":"你能把AAMSI出现的完整句子或文件标题发我吗？"}]}],"synonyms":["initialism","acronym (general term)"],"phonetic":"/ˌeɪ eɪ ˌɛm ˌɛs ˈaɪ/","extraExplanation":["“AAMSI”很可能是某个机构/项目名称的缩写（initialism）。常见读法是逐个字母读：A-A-M-S-I。","由于缩写在不同国家、行业（教育、医疗、工程、公司名称等）里可能完全不同，我需要你提供出现的语境（例如一整句话、文件/网站链接、行业领域或国家）才能给出准确释义。","你可以告诉我：1）它出现在哪个场景（简历、论文、学校、公司、合同等）；2）前后一句话；3）是否是某个组织名或课程名。我就能帮你锁定最可能的全称并解释用法。"]}
{"word":"Aandahl","summary":{"en":"Aandahl is mainly used as a Scandinavian (often Norwegian) surname in English.","zh":"Aandahl 主要作为斯堪的纳维亚（常见为挪威）姓氏在英语中使用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A Scandinavian (especially Norwegian) family name (surname).","zh":"一个斯堪的纳维亚（尤其挪威）姓氏。"},"examples":[{"en":"Ms. Aandahl will join the meeting at 2 p.m.","zh":"Aandahl 女士将于下午两点参加会议。"},{"en":"I saw the name Aandahl on the class list.","zh":"我在班级名单上看到了 Aandahl 这个名字。"}]},{"partOfSpeech":"other","definition":{"en":"A personal or family name used in English contexts; its exact meaning depends on the specific family’s history.","zh":"在英语语境中使用的人名/姓氏；具体含义取决于该家族的历史来源。"},"examples":[{"en":"How do you pronounce Aandahl?","zh":"Aandahl 怎么读？"},{"en":"The Aandahl family moved to the U.S. generations ago.","zh":"Aandahl 家族几代人以前搬到了美国。"}]}],"phonetic":"/ˈɑnˌdɑl/","extraExplanation":["“Aandahl”常见于挪威背景的姓氏。传统挪威语里有字母“Å”，早期在一些移民家庭或旧式拼写中可能用“aa”来替代，因此你会看到以“Aa-”开头的姓氏。","它看起来有时会被误读或误写成“Amdahl”（如并行计算里的 Amdahl’s law 相关姓氏），但两者不一定有关联。"]}
{"word":"Aani","summary":{"en":"Aani is most commonly used as a personal name; its meaning depends on cultural/language background.","zh":"Aani 通常用作人名；具体含义取决于语言与文化背景。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (personal name), used for people; meaning varies by language and culture.","zh":"人名（名字）；在不同语言与文化中含义不同。"},"examples":[{"en":"Aani is my classmate.","zh":"Aani 是我的同学。"},{"en":"Please ask Aani to join the meeting.","zh":"请叫 Aani 参加会议。"},{"en":"Aani wrote her name on the form.","zh":"Aani 在表格上写下了她的名字。"}]}],"synonyms":["Annie","Aani (variant spelling)","Ani"],"phonetic":"/ˈɑːni/","extraExplanation":["“Aani”在英语里更常见于音译/拼写形式的人名，而不是常用词汇，所以不会像普通英语单词那样有固定词义。","不同地区可能把“Aani”当作不同名字的变体或昵称（例如与“Annie / Aani / Anee”等拼写相近的名字混用）。如果你告诉我它来自哪种语言/国家或你想表达的意思，我可以更准确地给出含义、用法和相关词。"]}
{"word":"aani","summary":{"en":"“Aani” is usually a name; it can also be a context-dependent acronym or an online transliteration (e.g., Finnish “ääni” = sound/voice).","zh":"“Aani”通常是人名；也可能是依语境而定的缩写，或网络上的转写（如芬兰语 “ääni”＝声音/嗓音）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A personal name (given name or surname).","zh":"人名（可作名字或姓氏）。"},"examples":[{"en":"Aani moved to Chicago last year.","zh":"Aani 去年搬到了芝加哥。"},{"en":"I met Dr. Aani at the conference.","zh":"我在会议上见到了 Aani 博士。"}]},{"partOfSpeech":"other","definition":{"en":"A nonstandard spelling/transliteration seen online for Finnish “ääni,” meaning “sound” or “voice.”","zh":"网络上偶见的非标准拼写/转写，指芬兰语 “ääni”，意思是“声音/嗓音”。"},"examples":[{"en":"In Finnish, “ääni” means “voice,” sometimes typed as “aani” when people can’t use ä.","zh":"在芬兰语里，“ääni” 意为“声音/嗓音”；当无法输入 ä 时，有时会打成 “aani”。"}]},{"partOfSpeech":"other","definition":{"en":"An acronym that may refer to different organizations depending on context (not a fixed English word).","zh":"可能代表不同机构名称的缩写（并非固定的英语词）。"},"examples":[{"en":"What does AANI stand for in this article?","zh":"在这篇文章里，AANI 代表什么？"}]}],"synonyms":["(name)","(acronym)","(transliteration)"],"phonetic":"/ˈɑːni/","extraExplanation":["“aani”并不是常见的英语单词，更常见的是作为人名，或在无法输入变音符号（如 ä）时用来代替外语词（例如芬兰语 ääni）。如果你告诉我你看到它的句子或语境（比如某篇文章/聊天内容），我可以更准确地解释它的含义。"]}
{"word":"AAO","summary":{"en":"AAO is an abbreviation; most commonly it means the American Association of Orthodontists, but it can also mean Area of Operations depending on context.","zh":"AAO 是缩写；最常见指“美国正畸医师协会”，也可能在特定语境下指“行动/作业区域”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) American Association of Orthodontists (a professional organization for orthodontists in the U.S.).","zh":"（缩写）美国正畸医师协会（美国正畸专业人士的行业组织）。"},"examples":[{"en":"My orthodontist is a member of the AAO.","zh":"我的正畸医生是 AAO 的会员。"},{"en":"The clinic follows AAO guidelines for patient care.","zh":"这家诊所遵循 AAO 的患者护理指南。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Area of Operations (the place/region where an organization, team, or military unit is working).","zh":"（缩写）行动/作业区域（某个组织、团队或军队开展工作的地区）。"},"examples":[{"en":"Please report incidents that happen in your AAO.","zh":"请报告发生在你负责的行动区域（AAO）内的事件。"},{"en":"The team expanded its AAO to cover three neighborhoods.","zh":"团队把作业范围（AAO）扩大到覆盖三个社区。"}]}],"synonyms":["(for Area of Operations) AO","(for Area of Operations) operating area"],"phonetic":"/ˌeɪ eɪ ˈoʊ/","extraExplanation":["“AAO”是缩写，在不同领域意思差异很大。医疗领域里最常见的是 American Association of Orthodontists（美国正畸医师协会）；在军事/安保/项目管理语境中也可能指 Area of Operations（行动区域）。","如果你能告诉我你看到“AAO”的场景（例如：牙科诊所、军队文件、公司邮件、社交媒体等），我可以给出最准确的释义与更贴近的例句。"]}
{"word":"AAP","summary":{"en":"AAP is an initialism most commonly meaning the American Academy of Pediatrics; it can also mean Australian Associated Press or Affirmative Action Plan depending on context.","zh":"AAP是一个首字母缩写，最常见指“美国儿科学会”，也可能在不同语境中指“澳大利亚联合通讯社”或“平权行动计划”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbreviation) American Academy of Pediatrics: a major U.S. professional organization of children’s doctors (pediatricians).","zh":"（缩写）美国儿科学会：美国重要的儿童科医生（儿科医生）专业组织。"},"examples":[{"en":"The AAP recommends that babies sleep on their backs.","zh":"AAP（美国儿科学会）建议婴儿仰睡。"},{"en":"Many pediatricians follow AAP guidelines on vaccines.","zh":"许多儿科医生会遵循AAP关于疫苗的指南。"}]},{"partOfSpeech":"other","definition":{"en":"(abbreviation, Australia) Australian Associated Press: a news agency in Australia (often seen in older articles or media contexts).","zh":"（缩写，澳大利亚）澳大利亚联合通讯社：澳大利亚的一家新闻通讯社（常见于较早的报道或媒体语境）。"},"examples":[{"en":"The story was first reported by AAP.","zh":"这条新闻最早由AAP报道。"},{"en":"Some newspapers used AAP for national coverage.","zh":"一些报纸曾使用AAP提供全国新闻报道。"}]},{"partOfSpeech":"other","definition":{"en":"(abbreviation, workplaces) Affirmative Action Plan: a written plan some organizations use to support equal employment opportunity.","zh":"（缩写，职场）平权行动计划：一些机构用于促进平等就业机会的书面计划。"},"examples":[{"en":"The company updated its AAP to improve hiring fairness.","zh":"公司更新了AAP，以提升招聘公平性。"},{"en":"HR asked managers to follow the AAP guidelines.","zh":"人力资源部门要求管理者遵循AAP的指导原则。"}]}],"phonetic":"/ˌeɪ.eɪˈpiː/","extraExplanation":["“AAP”是首字母缩写（initialism），通常逐个字母读作“A-A-P”。它本身没有固定唯一含义，必须看领域与上下文：医疗健康里多指American Academy of Pediatrics；澳大利亚新闻语境里可能指Australian Associated Press；职场与合规文件里也可能指Affirmative Action Plan。","在正式写作中，第一次出现常会写全称并在括号中标注缩写，例如：American Academy of Pediatrics (AAP)。之后才单独用“AAP”。"]}
{"word":"AAPI","summary":{"en":"AAPI means “Asian American and Pacific Islander,” used in the U.S. as a collective term and as an adjective for related communities, culture, and issues.","zh":"AAPI 指“亚裔美国人及太平洋岛裔”，在美国常作统称，也可作形容词描述相关社群、文化与议题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Asian American and Pacific Islander; a collective term for people in the U.S. with roots in Asia and/or the Pacific Islands, and often used to describe communities, culture, or issues affecting them.","zh":"亚裔美国人及太平洋岛裔；在美国常用的统称，指具有亚洲和/或太平洋岛屿血统背景的人群，也常用于描述相关社群、文化或议题。"},"examples":[{"en":"May is Asian American and Pacific Islander Heritage Month, celebrating AAPI communities.","zh":"五月是亚裔美国人及太平洋岛裔传统月，用来庆祝 AAPI 社群。"},{"en":"The school started an AAPI student group to support cultural exchange.","zh":"学校成立了一个 AAPI 学生社团来支持文化交流。"},{"en":"She writes about AAPI history in the United States.","zh":"她写作主题是美国的 AAPI 历史。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing something related to Asian American and Pacific Islander people or communities.","zh":"（作定语）与亚裔美国人及太平洋岛裔人群或社群相关的。"},"examples":[{"en":"They hosted an AAPI film festival.","zh":"他们举办了一个 AAPI 电影节。"},{"en":"The museum opened an AAPI art exhibit.","zh":"博物馆开设了一个 AAPI 艺术展。"}]}],"synonyms":["Asian American and Pacific Islander","Asian American","Pacific Islander","AANHPI (Asian American, Native Hawaiian, and Pacific Islander)"],"phonetic":"ˌeɪ.eɪ.piːˈaɪ","extraExplanation":["AAPI 通常在美国语境中使用，强调亚裔美国人与太平洋岛裔在社会与政治层面的“共同发声”。不过它也常被讨论是否会“把差异很大的族群放在同一个标签下”。在更具体的场合，人们会用更精确的称呼（如 Chinese American、Filipino American、Native Hawaiian、Samoan 等）。","发音上它是字母缩写（initialism），通常逐个字母读：A-A-P-I。写作中也常见 AAPI、AA and PI、或在不同机构中用法略有差异。"]}
{"word":"AAPSS","summary":{"en":"AAPSS is an acronym; its meaning is context-specific and needs more information to define accurately.","zh":"AAPSS 是一个缩写词；含义取决于语境，需要更多信息才能准确释义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An acronym whose meaning depends on context; it is not a widely standardized word in general English.","zh":"一个缩写词，具体含义取决于使用语境；在通用英语中并不是广泛固定的词。"},"examples":[{"en":"What does AAPSS stand for in this document?","zh":"在这份文件里，AAPSS 代表什么？"},{"en":"AAPSS can mean different things, so please share the full name or the field (school, medicine, government, etc.).","zh":"AAPSS 可能有不同含义，请提供全称或所属领域（学校、医学、政府等）。"}]}],"synonyms":["acronym","initialism","abbreviation"],"phonetic":"ˌeɪˌeɪˌpiːˌɛsˈɛs","extraExplanation":["“AAPSS”看起来像机构/项目名称的缩写，但在缺少上下文时很难给出唯一释义。请告诉我：1）你在哪里看到它（课表、论文、网站、证书等）；2）它属于哪个国家/地区或领域；3）是否有全称或同一句里的其他线索。我就能给出准确释义与例句。"]}
{"word":"Aaqbiye","summary":{"en":"Not a standard English word; likely a proper name or a non-English term—meaning depends on language and context.","zh":"不是标准英语词；更可能是专有名词（姓名等）或非英语词，含义取决于语言与语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Aaqbiye is not a standard English word. It is most likely a personal name or a word from another language (often seen as a Somali/East African name or spelling), so its meaning depends on the original language and context.","zh":"Aaqbiye 不是标准英语单词。它更可能是人名或来自其他语言的词（常见于索马里语/东非语境中的姓名或拼写），具体含义需要看原语言与使用场景。"},"examples":[{"en":"I’m not sure what “Aaqbiye” means in English—could you tell me which language it’s from?","zh":"我不确定 “Aaqbiye” 用英语是什么意思——你能告诉我它来自哪种语言吗？"},{"en":"Aaqbiye is written like a name rather than an English vocabulary word.","zh":"Aaqbiye 的写法更像姓名，而不是英语词汇。"}]}],"phonetic":"/ɑːkˈbiːjeɪ/","extraExplanation":["为了更准确地解释，我需要一点上下文：你是在什么地方看到 “Aaqbiye” 的（例如：人名、地名、社交媒体用户名、歌词/句子里）？如果你能提供一句包含它的原句，或告诉我它可能属于哪种语言（如 Somali/Arabic/Amharic 等），我可以帮你更可靠地判断读音与含义。"]}
{"word":"Aar","summary":{"en":"“Aar” most commonly refers to a Swiss river; “AAR” can also mean “after-action review,” a post-event debrief.","zh":"“Aar”最常指瑞士的阿勒河；“AAR”也可指“after-action review”，即事后复盘/行动后回顾。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a river in Switzerland (and a tributary of the Rhine); also used as a place/name element in Swiss geography.","zh":"（专有名词）阿勒河：瑞士的一条河流（为莱茵河支流）；也常作为瑞士地名/地理名称的一部分。"},"examples":[{"en":"Bern sits on a bend of the Aar River.","zh":"伯尔尼坐落在阿勒河的一个河湾处。"},{"en":"We followed the Aar downstream toward the Rhine.","zh":"我们沿着阿勒河顺流而下，朝莱茵河方向走。"}]},{"partOfSpeech":"n.","definition":{"en":"AAR: an abbreviation for “after-action review,” a meeting to discuss what happened, what went well, and what to improve after an event or task.","zh":"AAR： “after-action review”的缩写，指事后复盘/行动后回顾会议，用来总结发生了什么、哪些做得好、哪些需要改进。"},"examples":[{"en":"After the drill, the team held an AAR to capture lessons learned.","zh":"演练结束后，团队进行了AAR复盘，记录经验教训。"},{"en":"Let’s schedule an AAR after the product launch.","zh":"产品上线后我们安排一次AAR复盘吧。"}]}],"synonyms":["(AAR) debrief","(AAR) post-mortem (informal, in business)","(AAR) retrospective"],"phonetic":"/ɑr/","extraExplanation":["“Aar”作为河名主要出现在瑞士语境中；英语里通常会说“Aar River”。","“AAR（after-action review）”常见于军队、应急管理、项目管理与企业培训语境，意思接近中文的“复盘”。"]}
{"word":"Aara","summary":{"en":"Aara is most commonly used as a personal name in English contexts.","zh":"Aara 在英语语境中最常见的用法是作为人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (used for people of any gender, depending on culture); a variant spelling of names like Ara, Aarah, or Aara.","zh":"人名（在不同文化中可用于不同性别）；也常被看作 Ara、Aarah、Aara 等名字的变体拼写。"},"examples":[{"en":"Aara moved to Chicago for a new job.","zh":"Aara 为了新工作搬到了芝加哥。"},{"en":"How do you spell your name—Aara or Ara?","zh":"你的名字怎么拼——Aara 还是 Ara？"}]}],"synonyms":["Ara","Aarah"],"phonetic":"/ˈɑrə/","extraExplanation":["“Aara”更常见于人名而不是普通词汇，因此在词典里未必像常用英语单词那样有固定词义。它可能出现在不同语言/地区的命名传统中，含义会随来源而变化。","如果你是在特定语境里看到“Aara”（例如地名、品牌名、缩写、小说角色名），给我一句原句或说明来源，我可以更准确地解释。"]}
{"word":"Aarah","summary":{"en":"Aarah is typically used as a personal name; its exact meaning varies by cultural/linguistic background.","zh":"Aarah 通常是人名；具体含义会因文化与语言背景而异。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (usually feminine) used in several cultures; spelling varies (e.g., Aara, Ara, Arah). Meanings depend on language and family tradition.","zh":"人名（多为女性名），在多种文化中使用；拼写有多种变体（如 Aara、Ara、Arah）。具体含义会因语言与家族取名传统而不同。"},"examples":[{"en":"Aarah is new in our class this semester.","zh":"Aarah 这学期刚转到我们班。"},{"en":"How do you spell your name—Aarah or Ara?","zh":"你的名字怎么拼——Aarah 还是 Ara？"},{"en":"Aarah’s parents chose the name because it sounded gentle and bright.","zh":"Aarah 的父母选这个名字，因为听起来温柔又明亮。"}]}],"synonyms":["Aara","Ara","Arah"],"phonetic":"/ˈɑːrə/","extraExplanation":["“Aarah”更常见为专有名词（名字），在英语语境里通常不当作普通词汇使用，因此词典里可能没有统一、确定的词义。","不同地区/家族可能赋予不同含义；如果你是在特定语言（如阿拉伯语、希伯来语、印地语等）背景下看到这个名字，最好提供来源或上下文，我可以再更准确地解释可能的含义与文化背景。","在英文中谈到名字时，常用表达：“My name is …”“It’s spelled …”“It’s pronounced …”（尤其当拼写较少见时很实用）。"]}
{"word":"Aarau","summary":{"en":"Aarau is a city in northern Switzerland and the capital of the canton of Aargau.","zh":"Aarau（阿劳）是瑞士北部的一座城市，也是阿尔高州的首府。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in northern Switzerland, the capital of the canton of Aargau.","zh":"瑞士北部城市，阿尔高州（Aargau）的首府。"},"examples":[{"en":"Aarau is about an hour from Zurich by train.","zh":"从苏黎世坐火车到阿劳大约一小时。"},{"en":"She moved to Aarau for a new job.","zh":"她为了新工作搬到了阿劳。"}]}],"phonetic":"/ˈɑːraʊ/","extraExplanation":["“Aarau”是德语地名，英文中也常用同一拼写。当地更接近德语读音（大致类似“AH-rau”）。","阿劳位于阿勒河（Aare）附近，历史上在18世纪末曾短暂成为瑞士的政治中心之一（与赫尔维蒂共和国时期相关）。","学习地名时可以注意：英语里地名通常当作专有名词使用，前面多用介词“in/near/from”，一般不加冠词（如：in Aarau）。"]}
{"word":"AARC","summary":{"en":"AARC most commonly stands for the American Association for Respiratory Care (a U.S. professional organization).","zh":"AARC最常见的含义是“美国呼吸护理协会”（美国的呼吸护理专业组织）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(acronym) American Association for Respiratory Care: a U.S. professional organization for respiratory therapists and other respiratory-care professionals.","zh":"（缩写）美国呼吸护理协会：美国的专业组织，服务于呼吸治疗师及其他呼吸护理相关人员。"},"examples":[{"en":"The hospital’s respiratory therapy team follows AARC clinical practice guidelines.","zh":"医院的呼吸治疗团队遵循AARC的临床实践指南。"},{"en":"She became an AARC member while studying to be a respiratory therapist.","zh":"她在学习成为呼吸治疗师期间加入了AARC。"}]}],"synonyms":["American Association for Respiratory Care","AARC guidelines","respiratory care association"],"phonetic":"/ˌeɪ.ɑːrˈsiː/","extraExplanation":["AARC通常读作字母音“A-A-R-C”。在医疗语境里，它最常见指美国呼吸护理协会，该机构会发布行业指南、提供继续教育、支持职业发展等。","在不同地区或行业里，AARC也可能代表其他机构名称；如果你是在某篇文章/学校/公司文件中看到的，给我上下文一句话，我可以帮你确认具体指哪一个。"]}
{"word":"aardvark","summary":{"en":"An aardvark is a nocturnal African mammal that eats ants and termites.","zh":"aardvark 指土豚：非洲夜行性哺乳动物，主要吃蚂蚁和白蚁。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a nocturnal African mammal with a long snout, strong claws, and a tongue used to eat ants and termites","zh":"土豚（非洲夜行性哺乳动物，长鼻、利爪，用长舌吃蚂蚁和白蚁）"},"examples":[{"en":"An aardvark uses its long tongue to lick up termites.","zh":"土豚用长舌头舔食白蚁。"},{"en":"We learned about the aardvark in a wildlife documentary.","zh":"我们在一部野生动物纪录片里了解了土豚。"}]}],"synonyms":["antbear (informal)","Cape antbear (less common)"],"phonetic":"/ˈɑrdˌvɑrk/","extraExplanation":["“aardvark”来自南非荷兰语（Afrikaans）的“earth pig”（直译“土猪”），因为它会挖洞、住在地洞里，而且鼻口部形状让人联想到猪，但它和猪没有近亲关系。","在英语里它常出现在儿童读物、字母书或词典示例中，因为以“双a”开头，排序很靠前。"]}
{"word":"aardvarks","summary":{"en":"Aardvarks are nocturnal African mammals that dig and eat ants/termites.","zh":"土豚是非洲夜行性哺乳动物，会挖洞并以蚂蚁和白蚁为食。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Aardvarks: medium-sized nocturnal mammals from southern Africa that eat ants and termites, known for a long snout, strong claws, and digging burrows.","zh":"土豚（复数）：产于非洲南部的中型夜行哺乳动物，以蚂蚁和白蚁为食，以长嘴、强壮的爪子和会挖洞穴而闻名。"},"examples":[{"en":"Aardvarks use their strong claws to dig into termite mounds.","zh":"土豚用强壮的爪子挖开白蚁丘。"},{"en":"Because aardvarks are nocturnal, people rarely see them during the day.","zh":"因为土豚是夜行性动物，人们白天很少见到它们。"}]}],"synonyms":["ant-eating mammal"],"phonetic":"/ˈɑrdˌvɑrk/","extraExplanation":["“aardvark”一词来自南非荷兰语（Afrikaans），字面意思是“earth pig”（土猪），形容它们会挖洞、身体粗壮。虽然名字里有“猪”，但土豚并不是猪科动物。","容易混淆：土豚（aardvark）不是食蚁兽（anteater）。两者都吃蚂蚁、都有长嘴和长舌头，但生活在不同地区，属于不同的动物类群。"]}
{"word":"aardwolf","summary":{"en":"An aardwolf is a striped, nocturnal African animal related to hyenas that mainly eats termites.","zh":"aardwolf 指一种非洲条纹夜行动物，鬣狗科近亲，主要吃白蚁。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A nocturnal African mammal related to hyenas, known for eating termites and having a striped coat.","zh":"土狼（非洲夜行性哺乳动物，属鬣狗科近亲；身上有条纹，主要以白蚁为食）。"},"examples":[{"en":"The aardwolf comes out at night to feed on termites.","zh":"土狼会在夜间出来吃白蚁。"},{"en":"Unlike most hyenas, an aardwolf mainly eats insects.","zh":"与大多数鬣狗不同，土狼主要吃昆虫。"}]}],"synonyms":["proteles"],"phonetic":"/ˈɑrdˌwʊlf/","extraExplanation":["“aardwolf”一词来自南非荷兰语/南非语：aard（地、土）+ wolf（狼），字面是“土狼”。它其实不是狼，而是鬣狗科的一种，因此中文常译为“土狼”。","它常被误以为会像鬣狗一样捕食大型动物，但它主要用长而黏的舌头舔食白蚁。"]}
{"word":"aardwolves","summary":{"en":"Aardwolves are African, hyena-like mammals that mostly eat termites.","zh":"aardwolves 是非洲的鬣狗近亲，主要吃白蚁。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Aardwolves (plural of aardwolf) are small, hyena-like mammals from eastern and southern Africa that mainly eat termites.","zh":"aardwolves（aardwolf 的复数）是一种生活在非洲东部和南部、外形像鬣狗但体型较小的哺乳动物，主要以白蚁为食。"},"examples":[{"en":"Aardwolves come out at night to feed on termites.","zh":"土狼（aardwolves）在夜间出来觅食白蚁。"},{"en":"Unlike true hyenas, aardwolves have weak jaws and don’t hunt large animals.","zh":"与真正的鬣狗不同，土狼（aardwolves）的下颚较弱，不会捕猎大型动物。"},{"en":"The documentary showed an aardwolf licking termites with its long, sticky tongue.","zh":"纪录片里展示了一只土狼用又长又黏的舌头舔食白蚁。"}]}],"synonyms":["aardwolf","Proteles cristata"],"phonetic":"/ˈɑrdˌwʊlvz/","extraExplanation":["“aardwolf”来自南非荷兰语/阿非利堪斯语：aard（“土、地”）+ wolf（“狼”），字面意思是“土狼/地狼”。虽然名字里有“wolf”，但它不是狼；它属于鬣狗科（Hyaenidae），和鬣狗是近亲。","aardwolf 的学名是 *Proteles cristata*。它们最有名的特征是几乎以白蚁为主食，常在夜间活动，用长舌头快速舔食昆虫。"]}
{"word":"Aaren","summary":{"en":"Aaren is a given name, most often used as an alternate spelling of Aaron.","zh":"Aaren 是一个人名，最常见用法是作为 Aaron 的变体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (usually male); an alternate spelling of “Aaron.”","zh":"人名（通常为男性名）；“Aaron”的另一种拼写。"},"examples":[{"en":"Aaren is a common alternate spelling of Aaron in some English-speaking countries.","zh":"Aaren 在一些英语国家里是 Aaron 的常见变体拼写。"},{"en":"Aaren spelled his name with two a’s so people wouldn’t confuse it with Aaron.","zh":"Aaren 把名字写成两个 a，是为了不让别人和 Aaron 混淆。"}]}],"synonyms":["Aaron","Aaryn","Arren"],"phonetic":"/ˈɛrən/","extraExplanation":["“Aaren”通常被视为《圣经》名字“ Aaron ”的拼写变体。Aaron（亚伦）在《出埃及记》中是摩西的哥哥，因此在英语文化里较常见。","Aaron 源自希伯来语姓名“Aharon”，常见的中文释义有“崇高的、强壮的”等，但学界对其最早词源并非完全一致。","作为名字时，发音在美式英语里常接近 /ˈɛrən/（类似“AIR-ən”）。不同家庭也可能按个人偏好读成更接近“AH/AA-”的音。"]}
{"word":"Aargau","summary":{"en":"Aargau is a canton in northern Switzerland (capital: Aarau).","zh":"Aargau 指瑞士北部的一个州（阿尔高州），首府为阿劳。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A canton (state) in northern Switzerland, with its capital in Aarau.","zh":"瑞士北部的一个州（阿尔高州），首府是阿劳（Aarau）。"},"examples":[{"en":"She lives in Aargau and commutes to Zurich for work.","zh":"她住在阿尔高州，每天通勤去苏黎世工作。"},{"en":"Aargau is known for its rivers and historic castles.","zh":"阿尔高州以河流与历史城堡闻名。"}]}],"synonyms":["Argovia (historical/Latin)"],"phonetic":"/ˈɑrˌɡaʊ/","extraExplanation":["“Aargau”是德语地名，读写上对英语学习者不太直观；其中“gau”在古德语/中古德语里常指“地区、郡、区域”（类似“region”），而“Aar”与当地的阿勒河（Aare River）相关。","阿尔高州位于瑞士德语区为主的地带，因此日常生活中常见德语（Swiss German/High German）；在英文语境里它通常作为专有名词直接使用。","历史上拉丁语名“Argovia”有时会在历史或文学/旅游介绍中出现，可视为较书面、较少见的别称。"]}
{"word":"Aargauer","summary":{"en":"Aargauer means a person from Aargau, Switzerland, or something related to Aargau.","zh":"Aargauer 指瑞士阿尔高州的人，或与阿尔高州相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Aargau (a canton in northern Switzerland).","zh":"（瑞士北部）阿尔高州的人；阿尔高人。"},"examples":[{"en":"She’s an Aargauer who grew up near Aarau.","zh":"她是阿尔高人，在阿劳附近长大。"},{"en":"Many Aargauer commute to Zürich for work.","zh":"许多阿尔高人通勤到苏黎世工作。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Aargau or its people.","zh":"与阿尔高州或阿尔高人有关的；阿尔高的。"},"examples":[{"en":"We tried a local Aargauer specialty at the market.","zh":"我们在集市上尝了当地的阿尔高特色美食。"},{"en":"He speaks with an Aargauer accent in Swiss German.","zh":"他说瑞士德语时带有阿尔高口音。"}]}],"synonyms":["Aargau resident","person from Aargau","Aargau native"],"phonetic":"/ˈɑːrˌɡaʊ.ər/","extraExplanation":["“Aargauer”是德语词（也常写作复数同形：die Aargauer），来自“Aargau（阿尔高）+ -er（表示某地的人）”。英语里更常见的表达是“from Aargau”或“an Aargau native”。","阿尔高州的首府是Aarau（阿劳）。在英语语境中，这个词多出现在关于瑞士地区、方言、历史或地方文化的写作里。"]}
{"word":"aargh","summary":{"en":"An exclamation showing strong frustration, anger, or pain.","zh":"表示强烈挫败、愤怒或疼痛的感叹词。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"Used to show strong feelings such as anger, frustration, pain, or annoyance (like a loud groan).","zh":"用于表达强烈情绪，如愤怒、沮丧、疼痛或烦恼（类似大声的呻吟/哀号）。"},"examples":[{"en":"Aargh! I deleted the file by accident.","zh":"啊啊！我不小心把文件删掉了。"},{"en":"Aargh, my head hurts.","zh":"啊啊，我头好痛。"},{"en":"Aargh! This traffic is terrible.","zh":"啊啊！这交通也太糟了。"}]}],"synonyms":["argh","ugh","gah","oh no","ow"],"phonetic":"/ɑːrɡ/","extraExplanation":["“aargh”常见于口语、网络聊天、漫画和影视字幕，用来把情绪“写出来”。拼写有很多变体（如“argh / aargh / aaargh”），通常字母越多，表示情绪越强。","它相当于更中性的“ugh/oh no”，但语气更爆炸、更戏剧化；在正式写作中一般不用。"]}
{"word":"Aarhus","summary":{"en":"Aarhus: a major city in Denmark, especially known for culture and education.","zh":"Aarhus：丹麦的重要城市，以文化与教育闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in Denmark on the east coast of the Jutland peninsula; Denmark’s second-largest city, known for its university, culture, and museums.","zh":"丹麦城市，位于日德兰半岛东海岸；为丹麦第二大城市，以大学、文化活动与博物馆闻名。"},"examples":[{"en":"Aarhus is Denmark’s second-largest city after Copenhagen.","zh":"奥胡斯是丹麦仅次于哥本哈根的第二大城市。"},{"en":"We spent a weekend in Aarhus visiting the ARoS art museum.","zh":"我们在奥胡斯度过了一个周末，参观了 ARoS 艺术博物馆。"},{"en":"She moved to Aarhus to study at Aarhus University.","zh":"她搬到奥胡斯，在奥胡斯大学读书。"}]}],"synonyms":["Århus"],"phonetic":"/ˈɔrhuːs/","extraExplanation":["“Aarhus”在丹麦语中常见拼写为“Århus”（旧式/传统拼写），现代官方写法多用“Aarhus”。","英语里常听到近似“OR-hoos”的读法；丹麦语实际发音更接近“OH-hoos”，开头元音较圆唇。","奥胡斯是重要的港口与教育中心，奥胡斯大学（Aarhus University）在国际上较有知名度。"]}
{"word":"Aarika","summary":{"en":"Aarika is most commonly used as a feminine given name (a proper noun), often as a modern or variant spelling.","zh":"Aarika 通常用作女性名字（专有名词），多为现代或变体拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a feminine given name (proper noun); a modern spelling that may be used as a variant of names like Erica/Arika in English-speaking contexts","zh":"（专有名词）女性名字；在英语语境中常见作现代拼写，也可能被视为 Erica/Arika 等名字的变体"},"examples":[{"en":"Aarika starts college this fall.","zh":"Aarika 今年秋天要开始上大学。"},{"en":"Please ask Aarika if she can join the meeting at 3 p.m.","zh":"请问问 Aarika 她能不能下午三点参加会议。"}]}],"synonyms":["Erica","Arika","Eryka"],"phonetic":"/ɑːˈriːkə/","extraExplanation":["“Aarika”更像是人名而不是常规词汇，因此通常没有一个所有人都公认的固定词义。很多英语人名会出现创意拼写（为了独特、好看或更贴近某种发音）。","常见读法之一是把“aa”读得更长一些，类似“ah-REE-kuh”。不同家庭/地区可能会有自己的读音；最稳妥的方式是直接询问本人偏好的发音。","如果你是在取名或写作中使用，注意在人名场景里它一般不需要冠词（不说“the Aarika”），首字母要大写。"]}
{"word":"Aaron","summary":{"en":"Aaron is a common male given name; it also refers to a major biblical figure, Moses’ brother and the first high priest.","zh":"Aaron 是常见的男性英文名；也指圣经中重要人物——摩西的哥哥、第一位大祭司。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a common male given name in English, used for boys and men.","zh":"（常见）男性英文名字，用于男孩或男性。"},"examples":[{"en":"Aaron is my classmate; he sits next to me.","zh":"Aaron 是我的同学，他坐在我旁边。"},{"en":"I’m meeting Aaron after work.","zh":"我下班后要去见 Aaron。"}]},{"partOfSpeech":"n.","definition":{"en":"in the Bible (Old Testament), Moses’ older brother and the first high priest of the Israelites; an important religious figure in Judaism, Christianity, and Islam.","zh":"《圣经》（旧约）中摩西的哥哥、以色列人的第一位大祭司；在犹太教、基督教和伊斯兰传统中都很重要的人物。"},"examples":[{"en":"In the Bible story, Aaron helps Moses speak to Pharaoh.","zh":"在圣经故事里，Aaron 帮助摩西向法老说话。"},{"en":"Aaron is described as the first high priest of Israel.","zh":"Aaron 被描述为以色列的第一位大祭司。"}]}],"phonetic":"/ˈɛrən/","extraExplanation":["“Aaron”源自希伯来语名字“Aharon”。常见释义包括“崇高的、被高举的”，也有人认为其词源并不完全确定。","英语里“Aaron”通常重读第一音节：AA-ron。书面语中这是专有名词，首字母要大写。","发音上“Aaron”在部分地区可能与“Erin”（常见女性名）接近甚至同音，因此在口语交流中必要时可拼读或说明。"]}
{"word":"aaron","summary":{"en":"Aaron is a common male first name and also the name of a major Biblical figure (Moses’ brother).","zh":"Aaron 是常见的男性名字，也指《圣经》中重要人物亚伦（摩西的哥哥）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name).","zh":"男性名字（名）。"},"examples":[{"en":"Aaron is my classmate.","zh":"Aaron 是我的同学。"},{"en":"We named our son Aaron.","zh":"我们给儿子取名叫 Aaron。"}]},{"partOfSpeech":"n.","definition":{"en":"(in the Bible) Moses’ older brother, a leader of the Israelites and the first high priest in Jewish tradition.","zh":"（《圣经》中）摩西的哥哥亚伦：以色列人的领袖之一，在犹太传统中被视为第一位大祭司。"},"examples":[{"en":"In the story, Aaron speaks to the people with Moses.","zh":"在故事里，Aaron 和 Moses 一起对民众讲话。"},{"en":"Aaron is an important figure in the book of Exodus.","zh":"Aaron 是《出埃及记》中的重要人物。"}]}],"phonetic":"/ˈɛrən/","extraExplanation":["“Aaron”在英语中常读作 /ˈɛrən/，听起来接近“艾伦/埃伦”。不同地区可能会有轻微差异，但日常交流中这个读音最常见。","这个名字来自希伯来语（常被解释为“崇高的、被高举的”等含义），因《圣经》人物而广为人知，所以在英语国家很常见。","相关词：Aaronic /əˈrɑːnɪk/（亚伦的；与亚伦或其祭司体系有关的），例如 “Aaronic priesthood”（亚伦祭司职）。"]}
{"word":"Aaron's-beard","summary":{"en":"Aaron’s-beard is a traditional plant name, most often referring to St. John’s wort (Hypericum calycinum), but it can mean other beard-like plants in some regions.","zh":"Aaron’s-beard（亚伦之须）是传统植物俗名，多指大萼金丝桃/圣约翰草（Hypericum calycinum），在某些地区也可能指其他“须状”植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant name used in English for a few different plants (depending on region), especially St. John’s wort (Hypericum calycinum), grown as a groundcover with large yellow flowers","zh":"（旧称/俗名）“亚伦之须”：英语里对某些植物的俗称（因地区而异），常指金丝桃/圣约翰草的一种（Hypericum calycinum），常作地被植物，开大朵黄色花"},"examples":[{"en":"The sunny border was covered with Aaron’s-beard, and bright yellow flowers appeared all summer.","zh":"向阳的花坛边种满了“亚伦之须”，整个夏天都开着鲜亮的黄花。"},{"en":"Some gardeners call Hypericum calycinum “Aaron’s-beard.”","zh":"有些园艺爱好者把大萼金丝桃（Hypericum calycinum）叫作“亚伦之须”。"}]},{"partOfSpeech":"n.","definition":{"en":"in some older or regional usage, another plant with long, beard-like flower parts (for example goat’s-beard)","zh":"（较旧或地区性用法）也可指其他花部像“胡须”一样细长的植物（例如婆罗门参/山羊胡子花 goat’s-beard）"},"examples":[{"en":"In older country guides, Aaron’s-beard may refer to goat’s-beard rather than St. John’s wort.","zh":"在一些较老的乡村植物百科里，“亚伦之须”可能指的是goat’s-beard，而不是金丝桃。"}]}],"synonyms":["St. John’s wort","Hypericum calycinum","goat’s-beard"],"phonetic":"/ˈɛrənz ˌbɪrd/","extraExplanation":["这个名字里的 Aaron 通常被理解为《圣经》中的亚伦（摩西的兄长），beard（胡须）用来形容植株花或叶的“须状”外观。由于民间俗名常随地区变化，同一个俗名可能对应不同植物；在阅读园艺书或古籍时，最好结合拉丁学名（如 Hypericum calycinum）来确认。"]}
{"word":"Aaronic","summary":{"en":"Aaronic = relating to Aaron or to the priesthood associated with him.","zh":"Aaronic 指“与亚伦有关的；与亚伦系祭司职分/祭司制度有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Aaron (the brother of Moses in the Hebrew Bible) or to the priesthood descended from him, especially the Israelite/Jewish priesthood.","zh":"与亚伦（希伯来《圣经》中摩西的兄长）有关的；或指源自亚伦家系的祭司制度，尤指以色列/犹太的祭司职分。"},"examples":[{"en":"The temple service was carried out by Aaronic priests according to tradition.","zh":"按传统，圣殿礼仪由亚伦系祭司执行。"},{"en":"Some texts contrast Aaronic priesthood with other forms of religious leadership.","zh":"一些文献会把亚伦系祭司职分与其他宗教领导形式作对比。"}]}],"synonyms":["priestly","Levitical","clerical"],"phonetic":"əˈrɑnɪk","extraExplanation":["“Aaronic”来自“Aaron（亚伦）+ -ic（表示‘……的’）”。在犹太-基督教语境中，亚伦被视为以色列祭司（Kohanim）的祖先，因此“Aaronic”常与“priestly（祭司的）”“Levitical（利未支派的）”一起出现，但含义更具体：强调“亚伦家系/祭司谱系”。","在一些现代宗教传统中（例如耶稣基督后期圣徒教会/摩门教语境），也常见“Aaronic Priesthood（亚伦圣职）”这一固定说法，指较初阶的圣职体系。阅读时可根据上下文判断属于圣经历史讨论还是特定宗派术语。"]}
{"word":"aaronic","summary":{"en":"Aaronic means “related to Aaron” or “connected with the priesthood traditionally associated with him.”","zh":"Aaronic 指“与亚伦有关的”或“与传统上归于亚伦的祭司体系相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Aaron (the brother of Moses in the Bible) or to the priestly line traditionally traced to him; priestly.","zh":"与《圣经》中亚伦（摩西的兄弟）有关的；或指传统上追溯到亚伦的祭司世系的；祭司的。"},"examples":[{"en":"The text discusses the Aaronic priesthood in ancient Israel.","zh":"这篇文章讨论了古代以色列的亚伦祭司体系。"},{"en":"In some traditions, an Aaronic blessing is recited in worship services.","zh":"在一些传统中，礼拜仪式上会诵读“亚伦的祝福”。"},{"en":"He studied Aaronic laws and rituals as part of his theology course.","zh":"他在神学课程中学习了与亚伦祭司相关的律法与仪式。"}]}],"synonyms":["priestly","Levitical (related, but not always identical)"],"phonetic":"/əˈrɑːnɪk/","extraExplanation":["“Aaronic”来自“Aaron（亚伦）+ -ic（……的）”。常见于宗教、历史与神学语境，尤其是谈到“the Aaronic priesthood（亚伦祭司职）”，即《旧约》中以亚伦家族为代表的祭司制度。","常见搭配：Aaronic priesthood（亚伦祭司职/祭司体系）、Aaronic blessing（亚伦的祝福，常指《民数记》6:24–26 的祝福语）。","在一些基督教派别或学术写作中，“Aaronic”也可用来泛指“祭司式的/与祭司相关的”概念，但核心含义仍与亚伦及其祭司传统相连。"]}
{"word":"Aaronical","summary":{"en":"Aaronical means “related to Aaron” and, more commonly, “priestly, linked to the priesthood traditionally descended from Aaron.”","zh":"Aaronical意为“与亚伦有关的”，更常用来指“与传统上追溯至亚伦的祭司体系相关的、祭司的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Aaron (the brother of Moses in the Bible) or to the hereditary Jewish priesthood traditionally traced to Aaron; priestly.","zh":"与《圣经》中摩西之兄亚伦有关的；或指传统上追溯至亚伦的犹太世袭祭司制度的；祭司的。"},"examples":[{"en":"Some texts describe the high priest as an Aaronical priest.","zh":"一些文献把大祭司称为“亚伦系（Aaronical）的祭司”。"},{"en":"The ritual rules are sometimes called Aaronical laws in older writings.","zh":"在较旧的著作中，这些仪式规定有时被称为“亚伦系律例”。"}]}],"synonyms":["Aaronic","priestly","Levitical (related, but not identical)"],"phonetic":"ˌerəˈnɪkəl","extraExplanation":["“Aaronical”主要见于宗教研究、神学、圣经注释或较旧的英语文献中，日常英语里很少用。更常见的近义形式是“Aaronic”。","在《旧约》传统中，亚伦（Aaron）的后裔被视为以色列的祭司家族（Aaronic/Aaronical priesthood）。因此这个词常带有“祭司身份/权柄/仪式传统”的含义。"]}
{"word":"aaronical","summary":{"en":"Aaronical means “related to Aaron or to the Aaron-based priesthood,” mainly used in religious or historical writing.","zh":"Aaronical 意为“与亚伦或亚伦系祭司制度有关的”，主要用于宗教或历史类书面语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Aaron (the brother of Moses in the Hebrew Bible) or to the priesthood traditionally associated with Aaron and his descendants.","zh":"与亚伦（《希伯来圣经》中摩西的兄长）有关的；或与传统上归于亚伦及其后裔的祭司制度/祭司职分有关的。"},"examples":[{"en":"Some traditions describe the ancient Israelite priesthood as Aaronical.","zh":"有些传统把古代以色列的祭司制度称为“亚伦系的”（Aaronical）。"},{"en":"He studied the Aaronical laws in the Old Testament.","zh":"他研读《旧约》中与亚伦祭司相关的律法。"}]},{"partOfSpeech":"adj.","definition":{"en":"(In some Christian contexts) relating to the “Aaronic Priesthood,” often contrasted with the “Melchizedek Priesthood.”","zh":"（在某些基督教语境中）与“亚伦圣职/亚伦祭司职”（Aaronic Priesthood）有关，常与“麦基洗德圣职/麦基洗德祭司职”对比。"},"examples":[{"en":"In Latter-day Saint usage, Aaronical may refer to duties of the Aaronic Priesthood.","zh":"在后期圣徒（LDS）的用法中，Aaronical 可能指“亚伦圣职”的职责与事务。"},{"en":"The text contrasts Aaronical service with a higher priesthood.","zh":"该文本将亚伦系的事奉与更高层级的圣职作对比。"}]}],"synonyms":["Aaronic","priestly","Levitical (related but not identical)"],"phonetic":"/ˌærəˈnɪkəl/","extraExplanation":["“Aaronical”来自专有名词 Aaron（亚伦）+ 形容词后缀 -ical，表示“与……有关的”。","在犹太—基督教传统里，“亚伦系祭司”（Aaronic/Aaronical priesthood）通常指以献祭与圣所礼仪为核心的祭司职分，常与“利未人”（Levites）相关联。","这是较正式、书面、宗教色彩很强的词；日常英语更常见的是 Aaronic（同义但更常用）。"]}
{"word":"Aaronite","summary":{"en":"An Aaronite is a descendant of Aaron, or something connected to Aaron’s priestly family line.","zh":"Aaronite 指亚伦的后裔，或与亚伦祭司家族世系有关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a descendant of Aaron (the brother of Moses), especially a member of the priestly family in ancient Israel","zh":"亚伦的后裔（摩西之兄亚伦的子孙），尤指古代以色列的祭司家族成员"},"examples":[{"en":"Only Aaronites were permitted to serve as priests in the Temple according to some biblical traditions.","zh":"根据一些《圣经》传统，只有亚伦的后裔才被允许在圣殿中担任祭司。"},{"en":"The text distinguishes Levites in general from Aaronites in particular.","zh":"这段文本把一般的利未人和特别的亚伦后裔区分开来。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Aaron or to the priestly line descended from him","zh":"与亚伦或其祭司世系（亚伦后裔）有关的"},"examples":[{"en":"He studied the Aaronite priesthood described in the Hebrew Bible.","zh":"他研究了《希伯来圣经》中记载的亚伦系祭司制度。"},{"en":"Aaronite laws in the narrative focus on ritual duties.","zh":"叙事中的亚伦系律例主要强调礼仪职责。"}]}],"synonyms":["descendant of Aaron","priestly descendant","Levitical priest (context-dependent)"],"phonetic":"/ˈɛrənˌaɪt/","extraExplanation":["“Aaronite”来自人名 Aaron（亚伦）+ 后缀 -ite（表示“某人的后裔/追随者/所属群体”，如 Israelite 以色列人）。在犹太—基督教传统中，亚伦被视为以色列第一位大祭司，因此 “Aaronites” 常与祭司职分、献祭与礼仪职责相关。"]}
{"word":"aaronite","summary":{"en":"An Aaronite is a descendant of Aaron, especially from the biblical priestly line; it can also mean “related to Aaron’s priesthood.”","zh":"Aaronite 指亚伦的后裔，尤指圣经中的祭司血统；也可作形容词表示“与亚伦祭司体系有关”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a descendant of Aaron (the brother of Moses), especially a member of the priestly family line in ancient Israel.","zh":"亚伦的后裔（摩西的兄长），尤指古代以色列祭司家族（祭司谱系）中的成员。"},"examples":[{"en":"In the Hebrew Bible, only an Aaronite could serve as a priest at the altar.","zh":"在《希伯来圣经》中，只有亚伦后裔才可以在祭坛前担任祭司。"},{"en":"The text describes disputes about who was truly an Aaronite.","zh":"文本描述了关于谁才是真正亚伦后裔的争议。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Aaron or to the Aaronite priesthood; priestly in the biblical sense.","zh":"与亚伦或亚伦祭司体系有关的；（圣经意义上）祭司的。"},"examples":[{"en":"He studied Aaronite traditions of worship and sacrifice.","zh":"他研究与亚伦祭司相关的敬拜与献祭传统。"},{"en":"Some laws were considered Aaronite regulations for priests.","zh":"有些律法被认为是为祭司制定的亚伦体系规定。"}]}],"synonyms":["priestly (adj., general)","descendant of Aaron","Levitical (related term, broader)"],"phonetic":"/ˈɛrənˌaɪt/","extraExplanation":["“Aaronite”来自圣经人物 Aaron（亚伦）。在犹太—基督教传统中，亚伦被视为首位大祭司，因此“Aaronite”常指祭司血统（与更广义的“Levite/利未人”不同：利未人是利未支派成员，而亚伦后裔是其中特定的祭司家族）。这个词多见于宗教研究、圣经译注与历史讨论。"]}
{"word":"Aaronitic","summary":{"en":"Aaronitic means “related to Aaron,” especially the Aaronic (hereditary) priesthood in the Hebrew Bible.","zh":"Aaronitic 指“与亚伦有关的”，尤指《希伯来圣经》中追溯到亚伦的（世袭）祭司职分。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Aaron (the biblical brother of Moses), especially to the hereditary Jewish priesthood traditionally traced through Aaron (the Aaronic/Aaronitic priesthood).","zh":"与《圣经》中摩西的兄长亚伦（Aaron）有关的；尤指传统上追溯到亚伦家族的世袭犹太祭司制度（亚伦系/亚伦的祭司职分）。"},"examples":[{"en":"In the Hebrew Bible, the Aaronitic priests serve in the Tabernacle and later the Temple.","zh":"在《希伯来圣经》中，亚伦系祭司在会幕中（后来在圣殿中）事奉。"},{"en":"The text distinguishes between the Aaronitic priesthood and the wider group of Levites.","zh":"该文本区分了亚伦系祭司职分与更广泛的利未人群体。"},{"en":"Scholars debate how Aaronitic authority developed in ancient Israel.","zh":"学者们讨论古代以色列中亚伦系权威是如何形成的。"}]}],"synonyms":["Aaronic","priestly (context-dependent)"],"phonetic":"/ˌerəˈnɪtɪk/","extraExplanation":["“Aaronitic”在学术与宗教语境中更常见；日常英语里多用更常见的拼写“Aaronic”。两者意思基本相同。","常见搭配包括：Aaronitic/Aaronic priesthood（亚伦系祭司职分）、Aaronitic blessing（亚伦的祝福；见《民数记》6:24–26，常用于犹太与基督教礼仪）。","这是一个专门词，通常出现在圣经研究、宗教学、历史或礼仪相关的文章中；一般对话中很少用到。"]}
{"word":"aaronitic","summary":{"en":"Aaronitic means “related to Aaron,” especially to the Aaronic (Aaronitic) priesthood and related traditions in the Bible.","zh":"aaronitic 指“与亚伦有关的”，尤指《圣经》传统中的亚伦祭司职及相关用语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Aaron (the brother of Moses in the Bible), especially to the priesthood traditionally connected with him (the Aaronic priesthood).","zh":"与《圣经》中摩西之兄亚伦（Aaron）有关的；尤指传统上与他相关的祭司职分（亚伦祭司职）。"},"examples":[{"en":"The blessing uses an Aaronitic formula found in the Old Testament.","zh":"这段祝福采用了《旧约》中一种亚伦式（Aaronitic）的祝福格式。"},{"en":"The text discusses Aaronitic priestly duties in ancient Israel.","zh":"这篇文章讨论了古代以色列亚伦系祭司的职责。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A person belonging to the line or group associated with Aaron; an Aaronite.","zh":"（罕见）亚伦后裔或与亚伦祭司群体相关的人；亚伦族人（Aaronite）。"},"examples":[{"en":"In older writings, some authors refer to an Aaronitic serving at the temple.","zh":"在较早的著作中，有作者称某位在圣殿服事的人为“亚伦系的人”。"}]}],"synonyms":["Aaronic","Aaronite (noun form)"],"phonetic":"/ˌɛr.əˈnɪt.ɪk/","extraExplanation":["“Aaronitic”来自人名 Aaron（亚伦）+ 形容词后缀 -itic，意思是“属于/与……有关的”。现代英语更常见的同义词是 “Aaronic”。","在基督教语境里常见搭配包括 “Aaronitic/Aaronic blessing”（亚伦祝福，见《民数记》6:24–26）与 “Aaronitic/Aaronic priesthood”（亚伦祭司职）。在耶稣基督后期圣徒教会（LDS）等传统中也常谈到 “Aaronic Priesthood”。"]}
{"word":"Aaronsburg","summary":{"en":"Aaronsburg is primarily the name of a small community in Centre County, Pennsylvania.","zh":"Aaronsburg 主要指美国宾夕法尼亚州森特县的一个小社区（地名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small community (unincorporated village) in Centre County, Pennsylvania, USA.","zh":"美国宾夕法尼亚州中部（森特县）的一个小社区/村落（非建制地区）。"},"examples":[{"en":"Aaronsburg is a quiet village in Centre County, Pennsylvania.","zh":"Aaronsburg 是宾夕法尼亚州森特县一个安静的小村落。"},{"en":"We drove through Aaronsburg on our way to State College.","zh":"我们去州学院市（State College）的路上开车经过了 Aaronsburg。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a surname or place-based name connected to the community called Aaronsburg.","zh":"（较少见）一个姓氏或源自地名的名字，与名为 Aaronsburg 的地方有关。"},"examples":[{"en":"Her family name is Aaronsburg, likely linked to the place name.","zh":"她的姓是 Aaronsburg，可能与这个地名有关。"}]}],"phonetic":"/ˈɛrənzˌbɝɡ/","extraExplanation":["这是一个专有名词（地名），通常不加冠词：说 “in Aaronsburg / near Aaronsburg”，而不是 “in the Aaronsburg”。","地名里的 “-burg” 常见于美国地名，源自德语，意思接近 “城镇/堡镇”（类似 Pittsburg(h), Harrisburg）。"]}
{"word":"Aaronson","summary":{"en":"Aaronson is a surname meaning “son of Aaron.”","zh":"Aaronson 是一个姓氏，字面意思是“亚伦之子”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname); a patronymic name meaning “son of Aaron.”","zh":"姓氏（家族姓）；源自父名的姓，字面意思是“亚伦之子”。"},"examples":[{"en":"Dr. Aaronson will speak at the conference tomorrow.","zh":"Aaronson 博士将于明天在会议上发言。"},{"en":"My teacher’s last name is Aaronson.","zh":"我老师的姓是 Aaronson。"}]}],"phonetic":"/ˈærən.sən/","extraExplanation":["“Aaronson”常见于英语国家（尤其是美国）的人名中，多为犹太/希伯来文化背景的姓氏之一。它属于“父名姓（patronymic）”，结构类似于 Johnson（约翰之子）、Davidson（大卫之子）。","词源上与名字“Aaron（亚伦）”相关；Aaron在《圣经》中是摩西的兄长，也是重要宗教人物，因此该名字在西方文化中较为常见。"]}
{"word":"AARP","summary":{"en":"AARP is a U.S. nonprofit known for supporting and offering benefits to people age 50+.","zh":"AARP是美国著名的非营利组织，主要支持并为50岁以上人群提供福利与服务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a U.S. nonprofit organization (formerly called the American Association of Retired Persons) that provides information, advocacy, and member benefits—especially for people age 50 and older.","zh":"美国的一个非营利组织（原名“美国退休人员协会”），主要为50岁及以上人群提供资讯、权益倡导与会员福利。"},"examples":[{"en":"My mom joined AARP when she turned 50 to get travel discounts and health information.","zh":"我妈妈50岁时加入了AARP，用来享受旅行折扣并获取健康资讯。"},{"en":"AARP often speaks out on issues like Social Security and Medicare.","zh":"AARP经常就社会保障（Social Security）和联邦医保（Medicare）等议题发声。"}]}],"synonyms":["the American Association of Retired Persons (former name)"],"phonetic":"/ˈeɪ ɑːr ɑːr ˈpiː/","extraExplanation":["AARP现在通常不再把缩写当作全称来使用：它保留“AARP”这个名称作为品牌，但历史上确实来自“American Association of Retired Persons”。","在美国文化里，AARP常和“50岁以上”“老年人权益”“会员折扣（如保险、旅行、餐饮）”联系在一起；你也可能在信箱里收到它的入会邀请。"]}
{"word":"aarrgh","summary":{"en":"“Aarrgh!” is an informal exclamation for strong frustration, anger, or pain, often written with extra letters for emphasis.","zh":"“Aarrgh!” 是非正式感叹词，用来表达强烈的沮丧、愤怒或疼痛，常用加长字母来加强语气。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"An exclamation showing strong frustration, anger, annoyance, or pain (a stretched/spelled-out form of “argh!”).","zh":"（感叹词）表示强烈的沮丧、愤怒、烦躁或疼痛（“argh!” 的拉长/夸张拼写）。"},"examples":[{"en":"Aarrgh! I forgot my keys again.","zh":"Aarrgh！我又忘带钥匙了。"},{"en":"Aarrgh—this paper cut hurts.","zh":"Aarrgh——这纸割得好疼。"},{"en":"Aarrgh, the website crashed right before I paid.","zh":"Aarrgh，我正要付款网站就崩了。"}]},{"partOfSpeech":"int.","definition":{"en":"A playful, dramatic sound used in jokes (often with a “pirate” feel) to show irritation or mock anger.","zh":"（感叹词）带玩笑/夸张效果的声音（常带“海盗腔”感觉），用来表示不爽或假装生气。"},"examples":[{"en":"Aarrgh, matey—who took the last cookie?","zh":"Aarrgh，伙计——谁把最后一块饼干吃了？"},{"en":"He typed “aarrgh” just to be funny, not because he was truly upset.","zh":"他打了个 “aarrgh” 只是搞笑，并不是真的很生气。"}]}],"synonyms":["argh","ugh","ow","darn","gah"],"phonetic":"/ɑrɡ/","extraExplanation":["“aarrgh / argh / aargh”多见于网络、聊天和漫画，用重复字母来表现声音更长、更强烈；并不是正式拼写。","常见写法还有“ARGH!”（全大写更强调情绪），中文里接近“啊啊啊/气死了/哎呀”。"]}
{"word":"aarrghh","summary":{"en":"An exclamation showing strong frustration, anger, or pain.","zh":"表示强烈沮丧、愤怒或疼痛的感叹词。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"An exclamation used to show strong frustration, anger, pain, or annoyance (like a loud groan or yell).","zh":"（感叹词）用来表达强烈的沮丧、愤怒、疼痛或烦躁（类似大声的哼叫或喊叫）。"},"examples":[{"en":"Aarrghh! I deleted the file by accident.","zh":"啊啊啊！我不小心把文件删了。"},{"en":"Aarrghh—my finger hurts!","zh":"啊啊啊——我手指好痛！"},{"en":"Aarrghh, why is the Wi‑Fi so slow today?","zh":"啊啊啊，今天怎么网这么慢？"}]}],"synonyms":["argh","ugh","ow","damn"],"phonetic":"ɑrɡ","extraExplanation":["“aarrghh / argh / aargh”主要是网络和漫画里常见的拟声感叹词，拼写不固定：字母越多通常表示情绪越强或拖长音。正式写作里较少用，更常见于对话、短信、社交媒体。"]}
{"word":"aarti","summary":{"en":"Aarti is a Hindu lamp-lighting ritual of devotion performed before a deity, often with prayers or songs.","zh":"Aarti 是印度教向神明献灯火的虔敬仪式，常伴随祈祷或颂歌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Hindu ritual of offering light (usually from a small lamp or candles) to a deity, while prayers or devotional songs are sung.","zh":"（印度教）阿尔蒂/阿拉蒂：一种向神明献灯火的仪式（常用小油灯或蜡烛），并伴随祈祷或颂歌。"},"examples":[{"en":"We attended the evening aarti at the temple.","zh":"我们参加了寺庙的晚间阿尔蒂仪式。"},{"en":"During aarti, the priest circles a lamp in front of the statue.","zh":"在阿尔蒂仪式中，祭司会在神像前绕圈挥动灯火。"},{"en":"The aarti song filled the room with a calm, devotional mood.","zh":"阿尔蒂颂歌让房间充满宁静、虔敬的氛围。"}]}],"synonyms":["ārati","arati","Hindu lamp ceremony"],"phonetic":"/ˈɑrti/","extraExplanation":["“Aarti”常见拼写也有“ārati / arati”，来自梵语，核心意象是“以光致敬”。在仪式中，人们会把点燃的灯在神像前转动，象征把光明与敬意奉献给神明，并祈求祝福。","在跨文化交流中使用该词时，通常作为可数名词（an aarti / the aarti）或固定搭配（do/perform aarti, evening aarti）。在宗教语境里谈论时保持尊重，会更符合场合。"]}
{"word":"Aaru","summary":{"en":"Aaru is the Egyptian “Field of Reeds,” a paradise in the afterlife.","zh":"Aaru指古埃及来世中的“芦苇之原”，类似天堂的乐土。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Egyptian religion) A paradise-like part of the afterlife, often described as the “Field of Reeds,” where the blessed dead live in peace and abundance.","zh":"（古埃及宗教）死后世界中类似天堂的地方，常被称为“芦苇之原/芦苇原野”，亡者在此安宁富足地生活。"},"examples":[{"en":"In some Egyptian myths, the righteous hope to enter Aaru after death.","zh":"在一些埃及神话中，正义之人死后希望进入Aaru。"},{"en":"The novel describes Aaru as a bright farmland beyond the Nile, like an eternal harvest.","zh":"小说把Aaru描写成尼罗河彼岸明亮的田野，如同永恒的丰收。"}]}],"synonyms":["Field of Reeds","Egyptian paradise"],"phonetic":"/ˈɑːruː/","extraExplanation":["Aaru常见拼写也有“Aaru/Field of Reeds”。它不是日常英语词汇，更常出现在关于古埃及宗教、神话与来世观念的书籍、纪录片或文学作品中。","在古埃及观念里，能否进入Aaru与“心脏称重”等审判想象有关：通过考验者得以在理想化的埃及田园中继续生活。"]}
{"word":"aaru","summary":{"en":"Aaru is the ancient Egyptian paradise after death, often called the “Field of Reeds.”","zh":"Aaru 指古埃及的来世乐土，常译作“芦苇原”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In ancient Egyptian religion, the paradise or ideal afterlife—often described as the “Field of Reeds,” a peaceful, fertile place where the blessed live after death.","zh":"在古埃及宗教中指“天堂/理想来世”，常被称为“芦苇原”（Field of Reeds），是死后蒙福者居住的宁静丰饶之地。"},"examples":[{"en":"In some Egyptian texts, the dead hope to reach Aaru after judgment.","zh":"在一些埃及文献中，亡者希望在审判后到达阿鲁（Aaru）。"},{"en":"Aaru is sometimes pictured as farmland with canals, like an ideal Egypt.","zh":"阿鲁有时被描绘成有运河的农田，就像理想化的埃及。"}]}],"synonyms":["Field of Reeds","Sekhet-Aaru"],"phonetic":"/ˈɑːruː/","extraExplanation":["Aaru（也写作 Aḥaru / Sekhet-Aaru）与“芦苇原”（Field of Reeds）相关：在奥西里斯（Osiris）的审判之后，心脏通过衡量（与“玛阿特之羽”象征的真理/正义相关）的人，被认为可进入此地继续一种更完美的日常生活（耕作、家人、和平）。","在英语写作里，Aaru 常被拿来与希腊神话的 Elysium（极乐世界）类比，但两者来自不同文化传统，细节与象征体系并不相同。"]}
{"word":"Aaryn","summary":{"en":"Aaryn is a given name and a modern variant spelling often associated with Aaron or Erin.","zh":"Aaryn 是一个人名，常作为现代变体拼写，与 Aaron 或 Erin 相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (first name), a less common modern spelling used for people of any gender; it is often treated as a variant of Aaron or Erin.","zh":"人名（名字/名），一种较少见的现代拼写，可用于任何性别；常被视为 Aaron 或 Erin 的变体拼写。"},"examples":[{"en":"Aaryn introduced herself at the meeting.","zh":"Aaryn 在会议上做了自我介绍。"},{"en":"I met someone named Aaryn in my English class.","zh":"我在英语课上认识了一个叫 Aaryn 的人。"},{"en":"How do you spell your name—Aaryn or Erin?","zh":"你的名字怎么拼——Aaryn 还是 Erin？"}]}],"synonyms":["Aaron","Erin"],"phonetic":"/ˈerɪn/","extraExplanation":["“Aaryn”多见于英语国家作为个性化拼写（creative spelling）。实际读音常随个人偏好而定，最常见会接近“Erin/Aaron”的读法。","相关来源：Aaron 源自希伯来语传统人名；Erin 与爱尔兰（Éire）相关，常被理解为“爱尔兰”的诗意称呼。拼写变体不一定严格对应某一种来源。","写作中人名通常首字母大写；如果不确定读音或拼写，礼貌做法是直接询问对方：“How do you pronounce your name?”（你的名字怎么读？）"]}
{"word":"AAS","summary":{"en":"AAS most commonly means an Associate of Applied Science degree; it can also mean the American Astronomical Society depending on context.","zh":"AAS最常见指“应用科学副学士（AAS）”学位；也可能指“美国天文学会”，需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for Associate of Applied Science, a two-year college degree focused on practical job skills","zh":"“Associate of Applied Science”的缩写，指“应用科学副学士学位”（通常为两年制、偏职业技能与实践）"},"examples":[{"en":"She earned an AAS in nursing and started working at a clinic.","zh":"她拿到了护理专业的AAS学位，然后开始在诊所工作。"},{"en":"This program offers an AAS degree in automotive technology.","zh":"这个项目提供汽车技术方向的AAS学位。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for American Astronomical Society, a major professional organization for astronomers in the U.S.","zh":"“American Astronomical Society”的缩写，指“美国天文学会”（美国重要的天文学专业组织）"},"examples":[{"en":"He presented his research at the AAS meeting.","zh":"他在AAS年会上展示了自己的研究。"},{"en":"The paper was discussed by astronomers at an AAS conference.","zh":"这篇论文在AAS会议上被天文学家讨论。"}]}],"synonyms":["Associate of Applied Science","American Astronomical Society"],"phonetic":"/ˌeɪ.eɪˈɛs/","extraExplanation":["在日常英语里，“AAS”几乎总是作为缩写出现，读作字母音（A-A-S），常见于简历、学校招生信息（指学位）或学术会议/新闻（指美国天文学会）。具体含义需要看上下文：出现在教育背景里多半是学位；出现在天文研究或会议报道里多半是学会名称。"]}
{"word":"aas","summary":{"en":"AAS most commonly means the Associate of Applied Science degree; it can also refer to the American Astronomical Society or other context-specific abbreviations.","zh":"AAS最常见指“应用科学副学士”学位；也可能指“美国天文学会”或其他需依语境判断的缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Associate of Applied Science: a college degree (usually a 2-year program) focused on practical, job-related skills.","zh":"应用科学副学士：一种以就业与实用技能为导向的大学学位（通常为两年制）。"},"examples":[{"en":"She earned an AAS in nursing and started working at a hospital right away.","zh":"她获得了护理专业的AAS学位，随后马上到医院工作。"},{"en":"An AAS is often offered by community colleges and technical schools.","zh":"AAS学位常由社区学院和技术学校提供。"}]},{"partOfSpeech":"n.","definition":{"en":"American Astronomical Society: a major professional organization for astronomers in the United States.","zh":"美国天文学会：美国天文学家重要的专业学术组织。"},"examples":[{"en":"He presented his research at the AAS meeting.","zh":"他在AAS会议上展示了自己的研究成果。"}]},{"partOfSpeech":"other","definition":{"en":"A written abbreviation for several other terms; the exact meaning depends on context (school, work, science, etc.).","zh":"多种词语的缩写；具体含义取决于语境（学校、工作、科学等）。"},"examples":[{"en":"In this document, AAS refers to the degree program, not the scientific society.","zh":"在这份文件里，AAS指的是学位项目，而不是学会。"}]}],"synonyms":["Associate of Applied Science","A.A.S.","American Astronomical Society"],"phonetic":"/ˌeɪ.eɪˈɛs/","extraExplanation":["“AAS”在日常学习/求职语境里最常见的是“Associate of Applied Science（应用科学副学士）”。它通常更偏向职业技能训练（例如护理、信息技术、工程技术等），与更偏通识/转学导向的“AA（Associate of Arts）/AS（Associate of Science）”常被一起比较。","作为缩写时，最好通过上下文判断：如果出现在简历/学历栏，多半是学位；如果在天文会议、期刊或学术新闻中出现，则可能是“American Astronomical Society”。"]}
{"word":"Aasia","summary":{"en":"“Aasia” is usually a variant spelling of “Asia,” and it can also be a given name.","zh":"“Aasia”通常是“Asia（亚洲）”的变体拼写，也可用作人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a less common spelling of “Asia” (the continent); sometimes used for stylistic reasons or to reflect pronunciation in some languages.","zh":"“Asia（亚洲）”的一种较少见的拼写；有时为风格化写法，或为了更贴近某些语言中的发音。"},"examples":[{"en":"She wrote “Aasia” on the poster to match the spelling used in her community.","zh":"她在海报上写“Aasia”，以符合她所在社群常用的拼法。"},{"en":"In this document, “Aasia” refers to the continent of Asia.","zh":"在这份文件中，“Aasia”指的是亚洲这块大陆。"}]},{"partOfSpeech":"n.","definition":{"en":"a personal name (given name) used in some cultures; meaning and usage depend on language and family tradition.","zh":"一个人名（名字）；在不同文化中会使用，含义与用法取决于具体语言和家族传统。"},"examples":[{"en":"Aasia is my friend’s first name.","zh":"Aasia是我朋友的名字。"},{"en":"Aasia introduced herself at the meeting.","zh":"Aasia在会上做了自我介绍。"}]}],"synonyms":["Asia"],"phonetic":"/ˈɑːsiə/","extraExplanation":["“Aasia”在英语里最常见的理解是“Asia”的变体拼写，但在正式英文写作中通常仍写作“Asia”。如果你是在填写证件、学术写作或新闻语境，建议用标准拼写“Asia”；如果是姓名或品牌名，则应尊重原拼写“Aasia”。","发音方面：作为“Asia”的变体时，不同地区可能会更接近“AH-see-uh”（类似/ˈɑːsiə/）或“AY-zhuh”（更接近美式对Asia的常见读法）。若是人名，通常以本人/家庭偏好的读法为准。"]}
{"word":"aasvogel","summary":{"en":"aasvogel means a vulture (especially in South African English) and, figuratively, a person who preys on others’ misfortune.","zh":"aasvogel 指“秃鹫”（尤见于南非英语），也可比喻“趁人之危的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South African English) A vulture; a large bird that feeds on dead animals (carrion).","zh":"（南非英语）秃鹫；以动物尸体（腐肉）为食的大型鸟类。"},"examples":[{"en":"An aasvogel circled above the roadkill, waiting to land.","zh":"一只秃鹫在路边的动物尸体上空盘旋，等着降落。"},{"en":"In the dry season, you may see aasvogels near watering holes.","zh":"在旱季，你可能会在水坑附近看到秃鹫。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) A person who takes advantage of others when they are weak or in trouble; a scavenger-like person.","zh":"（比喻）趁人之危、从他人困境中捞好处的人；像“食腐者”一样的人。"},"examples":[{"en":"Some reporters felt like aasvogels, crowding around a family’s grief.","zh":"有些记者挤在一家人的悲痛周围，让人感觉像“秃鹫”一样。"},{"en":"Don’t be an aasvogel—help people instead of profiting from their bad luck.","zh":"别当“秃鹫”——与其从别人的倒霉中获利，不如去帮助他们。"}]}],"synonyms":["vulture","scavenger","opportunist"],"phonetic":"/ˈɑːsˌfoʊɡəl/","extraExplanation":["这个词来自南非荷兰语（Afrikaans）：aas（腐肉）+ vogel（鸟）。在南非英语里偶尔会用来指“秃鹫”，也常用作贬义比喻，类似英语里说 someone is a “vulture”。","发音上，英语使用者常把它读成接近“AHSS-foh-guhl”。在正式英语写作中，更常见的对应词是 vulture；aasvogel 带有明显的南非地域色彩。"]}
{"word":"aasvogels","summary":{"en":"A Dutch/Afrikaans word meaning carrion-eating birds (like vultures), sometimes used metaphorically for exploiters.","zh":"荷兰语/南非语词，指食腐鸟（如秃鹫），也可比喻趁机掠夺、唯利是图的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Dutch/Afrikaans) carrion birds; scavenging birds such as vultures that feed on dead animals.","zh":"（源自荷兰语/南非语）食腐鸟；以动物尸体为食的食腐鸟类（如秃鹫）。"},"examples":[{"en":"In the novel, the battlefield is described as silent except for the aasvogels circling above.","zh":"小说里写到战场一片寂静，只有食腐鸟在上空盘旋。"},{"en":"After the drought, aasvogels gathered near the farms to look for carcasses.","zh":"干旱之后，食腐鸟聚集在农场附近寻找动物尸体。"}]}],"synonyms":["vultures","scavenger birds","carrion birds"],"phonetic":"/ˈɑːsˌvoʊɡəlz/","extraExplanation":["“aasvogels”常见于南非英语语境或翻译作品中，带有强烈的意象色彩：不仅指真实的“秃鹫/食腐鸟”，也常被比喻为“趁火打劫的人、唯利是图的掠夺者”（英文里对应常用比喻是 vultures）。","词形拆解：aas（腐肉、尸体）+ vogels（鸟，复数）。单数形式常见为“aasvoël”（南非语）。"]}
{"word":"AAT","summary":{"en":"AAT is a context-dependent abbreviation (often read “A-A-T”). Common meanings include Australia’s Administrative Appeals Tribunal and the UK accounting body Association of Accounting Technicians.","zh":"AAT 是一个需看语境的缩写（常读作 A-A-T）。常见含义包括澳大利亚的“行政上诉法庭”以及英国的会计机构“会计技师协会”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation used for different organizations or terms; the exact meaning depends on the context (field, country, document).","zh":"一个可代表不同机构或术语的缩写；具体含义取决于语境（领域、国家或文件）。"},"examples":[{"en":"In this report, AAT stands for the Administrative Appeals Tribunal.","zh":"在这份报告里，AAT 指的是“行政上诉法庭”。"},{"en":"Please tell me what AAT means in your class notes.","zh":"请告诉我 AAT 在你的课堂笔记里是什么意思。"}]},{"partOfSpeech":"other","definition":{"en":"Administrative Appeals Tribunal (Australia): a body that reviews decisions made by Australian government agencies.","zh":"（澳大利亚）Administrative Appeals Tribunal：负责复核澳大利亚政府机构决定的机构。"},"examples":[{"en":"She applied to the AAT to have the decision reviewed.","zh":"她向 AAT 申请复核该决定。"},{"en":"The AAT can review certain government decisions.","zh":"AAT 可以复核某些政府决定。"}]},{"partOfSpeech":"other","definition":{"en":"AAT (Accountancy/Accounting) qualification: often refers to the Association of Accounting Technicians, a UK-based professional accounting body and its certifications.","zh":"（会计）AAT 资格：常指英国的 Association of Accounting Technicians（会计技师协会）及其认证。"},"examples":[{"en":"He is studying for an AAT accounting qualification.","zh":"他正在备考 AAT 会计资格证。"},{"en":"Many entry-level accounting jobs accept AAT training.","zh":"许多入门级会计工作认可 AAT 培训。"}]}],"synonyms":["initialism","abbreviation"],"phonetic":"/ˌeɪˌeɪˈtiː/","extraExplanation":["“AAT”是典型的缩写词（acronym/initialism），常读作字母：A-A-T。它在不同国家/行业含义差异很大（如澳洲法律、英国会计等）。如果你把它出现的句子或图片发我，我可以帮你锁定最准确的含义。"]}
{"word":"AAU","summary":{"en":"AAU most commonly means either the U.S. youth sports organization (Amateur Athletic Union) or the research-university group (Association of American Universities), depending on context.","zh":"AAU 最常见指美国青少年体育组织（业余体育联合会）或研究型大学联盟（美国大学协会），具体含义取决于语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Amateur Athletic Union) A U.S. nonprofit sports organization best known for youth amateur competitions (especially basketball and track).","zh":"（业余体育联合会）美国的非营利体育组织，以青少年业余赛事最为出名（尤其是篮球、田径）。"},"examples":[{"en":"He played AAU basketball every summer in high school.","zh":"他高中时每年夏天都打 AAU 青少年篮球联赛。"},{"en":"AAU meets can be a big step for young track athletes.","zh":"AAU 田径赛对年轻运动员来说可能是重要的一步。"}]},{"partOfSpeech":"n.","definition":{"en":"(Association of American Universities) An invitation-only group of leading research universities in the U.S. and Canada.","zh":"（美国大学协会）由美国和加拿大顶尖研究型大学组成的邀请制联盟。"},"examples":[{"en":"The school is applying for AAU membership.","zh":"这所学校正在申请加入 AAU（美国大学协会）。"},{"en":"AAU universities often receive large research funding.","zh":"AAU 成员大学通常获得大量科研经费。"}]},{"partOfSpeech":"n.","definition":{"en":"A common abbreviation for several universities (e.g., Aalborg University), depending on context.","zh":"在特定语境中也可指某些大学的缩写（如丹麦奥尔堡大学），需结合上下文判断。"},"examples":[{"en":"I’m studying engineering at AAU in Denmark.","zh":"我在丹麦的 AAU（奥尔堡大学）读工程。"}]}],"synonyms":["abbrev.","initialism"],"phonetic":"/ˌeɪ eɪ ˈjuː/","extraExplanation":["“AAU”在英语里最常见的两个含义是：青少年体育圈里的 Amateur Athletic Union（尤其常说“AAU basketball”），以及高等教育领域的 Association of American Universities（研究型名校联盟）。看到“AAU”时，最好根据对话主题（体育/大学/国家地区）来判断。"]}
{"word":"AAUP","summary":{"en":"AAUP is the American Association of University Professors, a U.S. faculty organization known for work on academic freedom and tenure standards.","zh":"AAUP 指“美国大学教授协会”，以推动学术自由与终身教职等高校标准而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"American Association of University Professors: a U.S. organization of faculty members that promotes academic freedom, shared governance, fair working conditions, and standards for higher education.","zh":"美国大学教授协会：美国的教师组织，致力于维护学术自由、共同治理（共享治理）、公平的工作条件以及高等教育的专业标准。"},"examples":[{"en":"The AAUP issued a statement defending academic freedom on campus.","zh":"AAUP 发表声明，为校园内的学术自由辩护。"},{"en":"Our faculty senate used AAUP guidelines when revising the tenure policy.","zh":"我们教务委员会在修订终身教职政策时参考了 AAUP 的指导原则。"}]}],"synonyms":["American Association of University Professors"],"phonetic":"/ˌeɪ eɪ juː ˈpiː/","extraExplanation":["AAUP 常出现在美国高校语境中，尤其与“学术自由（academic freedom）”“终身教职（tenure）”“共享治理（shared governance）”等话题相关。","该组织的报告和“原则声明”在高校制定或评估教师聘任、解聘与学术权利保障时常被引用。"]}
{"word":"AAUW","summary":{"en":"AAUW is the American Association of University Women, a U.S. nonprofit focused on education and gender equity for women and girls.","zh":"AAUW 指“美国大学妇女协会”，是关注女性与女孩教育与性别平等的美国非营利组织。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(American Association of University Women) A U.S. nonprofit organization that supports women and girls in education and promotes gender equity through research, advocacy, and programs (such as scholarships and fellowships).","zh":"（美国大学妇女协会）美国的非营利组织，致力于支持女性与女孩的教育发展，并通过研究、倡议与项目（如奖学金、研究资助等）推动性别平等。"},"examples":[{"en":"AAUW offers scholarships and fellowships to support women in graduate study and research.","zh":"AAUW 提供奖学金与研究资助，支持女性进行研究生学习与科研。"},{"en":"Our campus AAUW chapter hosted a talk on pay equity and women’s leadership.","zh":"我们学校的 AAUW 分会举办了一场关于同工同酬与女性领导力的讲座。"},{"en":"She volunteered with AAUW to advocate for better opportunities for girls in STEM.","zh":"她在 AAUW 做志愿者，倡导为女孩在 STEM（科学、技术、工程、数学）领域提供更好的机会。"}]}],"synonyms":["American Association of University Women"],"phonetic":"/ˌeɪ eɪ ˌjuː ˈdʌbəl.juː/","extraExplanation":["AAUW 通常按字母逐个读：A-A-U-W。写作时多用于组织名称、分会（chapter）或报告（如研究报告）语境。","AAUW 成立于 1881 年，历史上与推动女性进入高等教育、职业发展与平等权利相关；在美国语境中，它常与教育公平、职场性别差距、奖助学金项目等话题一起出现。"]}
{"word":"AAV","summary":{"en":"AAV most commonly means adeno-associated virus (a gene-therapy delivery vector). Less commonly, it can refer to African American Vernacular English (often written AAVE).","zh":"AAV 最常见指腺相关病毒（基因治疗的递送载体）；较少见时也可指非裔美国人日常英语（更常写作 AAVE）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(biology/medicine) Adeno-associated virus: a small virus widely used as a vector (carrier) in gene therapy to deliver genetic material into cells.","zh":"（生物/医学）腺相关病毒：一种小型病毒，常被用作基因治疗中的“载体”（运输工具），把遗传物质送入细胞。"},"examples":[{"en":"Many gene therapies use AAV to deliver a healthy copy of a gene.","zh":"许多基因治疗会用 AAV 来递送某个基因的健康版本。"},{"en":"The researchers tested an AAV vector in mice before starting human trials.","zh":"研究人员先在小鼠中测试 AAV 载体，然后才开始人体试验。"}]},{"partOfSpeech":"n.","definition":{"en":"(linguistics, less common) African American Vernacular (English): a common abbreviation sometimes used for African American Vernacular English (AAVE).","zh":"（语言学，较少见）非裔美国人日常英语：有时用 AAV 来指 African American Vernacular English（更常见缩写为 AAVE）。"},"examples":[{"en":"In this paper, we discuss features of AAV (often written as AAVE).","zh":"在这篇论文里，我们讨论 AAV（更常写作 AAVE）的一些特征。"},{"en":"Some teachers learn about AAV/AAVE to better understand students’ language backgrounds.","zh":"有些老师会学习 AAV/AAVE，以更好理解学生的语言背景。"}]}],"synonyms":["Adeno-associated virus (full form)","AAV vector","AAVE (more common for the language term)"],"phonetic":"/ˌeɪ.eɪˈviː/","extraExplanation":["AAV 作为缩写有多种含义，具体要看语境：在生物医药里最常指“腺相关病毒”（基因治疗常见递送载体）；在语言学里若看到 AAV，常是指 AAVE（African American Vernacular English）的一种不太常见写法。","读缩写时常按字母读：A-A-V；正式写作中第一次出现通常会先写全称，再括号写 AAV。"]}
{"word":"AAVE","summary":{"en":"AAVE is the abbreviation for African American Vernacular English, a recognized dialect of American English with its own rules.","zh":"AAVE是“African American Vernacular English（非裔美国人白话英语）”的缩写，是一种有自身规则的英语方言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"African American Vernacular English: a variety (dialect) of English historically associated with many African American communities in the United States, with its own consistent grammar, pronunciation, and vocabulary.","zh":"非裔美国人白话英语：一种与美国许多非裔社群历史相关的英语变体（方言），有其稳定的语法、发音与词汇体系。"},"examples":[{"en":"In linguistics class, we studied AAVE as a rule-governed dialect, not “bad English.”","zh":"在语言学课上，我们把AAVE当作有规则的方言来研究，而不是“糟糕的英语”。"},{"en":"Some speakers use AAVE at home and switch to Standard American English at work.","zh":"有些人会在家使用AAVE，在工作场合则切换到标准美式英语。"},{"en":"The movie’s dialogue includes features of AAVE to reflect the characters’ community.","zh":"这部电影的对白包含AAVE的特征，用来呈现角色所属的社群。"}]}],"synonyms":["African American English (AAE)","African American Vernacular English","Black English (often considered dated)"],"phonetic":"/ˌeɪˌeɪˌviːˈiː/","extraExplanation":["AAVE常被误解为“俚语”或“网络用语”，但它是完整的语言变体，有系统性的语法与语音规则（例如有些语境会省略be，或使用特定的时体表达）。","使用这个词时通常是中性、学术性的称呼；更口语的“Black English”在某些语境下可能显得过时或不够尊重，建议优先用AAVE或“African American English (AAE)”。","在美国文化中，AAVE对音乐（如嘻哈）、喜剧与流行文化影响很大；同时也涉及身份、刻板印象与语言歧视等议题。了解这些背景有助于更敏感地理解与使用相关表达。"]}
{"word":"AAVSO","summary":{"en":"AAVSO is the American Association of Variable Star Observers, a global organization for collecting and sharing variable-star observation data.","zh":"AAVSO 指美国变星观测者协会，是一个汇集并共享变星观测数据的全球性组织。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"American Association of Variable Star Observers: an international nonprofit organization that coordinates and archives observations of variable stars, encouraging both amateur and professional astronomers to contribute data for scientific research.","zh":"美国变星观测者协会：一个国际性的非营利组织，协调并保存变星观测数据，鼓励业余与专业天文学家共同为科研提供观测资料。"},"examples":[{"en":"She submits her variable-star brightness measurements to the AAVSO every week.","zh":"她每周都会把变星亮度测量数据提交给 AAVSO。"},{"en":"The paper used AAVSO data to study long-term changes in the star’s brightness.","zh":"这篇论文使用了 AAVSO 的数据来研究该恒星亮度的长期变化。"},{"en":"Our astronomy club joined an AAVSO observing campaign during the eclipse season.","zh":"我们的天文社团在食季参加了 AAVSO 的观测活动。"}]}],"synonyms":["American Association of Variable Star Observers"],"phonetic":"/ˌeɪ.eɪ.viː.ɛsˈoʊ/","extraExplanation":["AAVSO 通常按字母逐个读作 “A-A-V-S-O”。","AAVSO 以“公民科学”著称：很多观测来自业余天文爱好者，但经过规范化流程汇总后，能为专业研究（如变星光变曲线、爆发事件、长期演化）提供可靠数据。","“variable star（变星）”指亮度会随时间变化的恒星；观测者常记录其亮度（星等）与时间，用于绘制光变曲线（light curve）。"]}
{"word":"AAX","summary":{"en":"AAX is usually an initialism meaning either an Audible “.aax” audiobook file, the IATA code for Araxá Airport (Brazil), or a brand name depending on context.","zh":"AAX 通常是首字母缩写：可能指 Audible 的“.aax”有声书文件、巴西阿拉沙机场的 IATA 代码，或在不同语境中作为品牌名称使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An Audible audiobook file format/extension (written as “.aax”).","zh":"Audible 有声书的文件格式/扩展名（写作“.aax”）。"},"examples":[{"en":"I downloaded the audiobook as an .aax file from Audible.","zh":"我从 Audible 下载了这本有声书，文件是 .aax 格式。"},{"en":"Some players can’t open AAX files unless you convert them first.","zh":"有些播放器打不开 AAX 文件，除非你先把它转换成其他格式。"}]},{"partOfSpeech":"n.","definition":{"en":"The IATA airport code for Araxá Airport in Minas Gerais, Brazil.","zh":"巴西米纳斯吉拉斯州阿拉沙（Araxá）机场的 IATA 机场代码。"},"examples":[{"en":"My ticket shows AAX as the destination airport code.","zh":"我的机票上目的地机场代码写的是 AAX。"},{"en":"Flights to AAX may connect through larger Brazilian airports.","zh":"飞往 AAX 的航班可能需要在巴西更大的机场中转。"}]},{"partOfSpeech":"other","definition":{"en":"A name used by some organizations/brands (e.g., “AAX” as a company or platform name). Meaning depends on context.","zh":"一些机构/品牌使用的名称（例如某些公司或平台名叫“AAX”）。具体含义取决于语境。"},"examples":[{"en":"In this article, AAX refers to a trading platform, not a file type.","zh":"在这篇文章里，AAX 指的是一个交易平台，而不是文件格式。"},{"en":"Always check the context when you see “AAX,” because it’s an initialism.","zh":"看到“AAX”时要看上下文，因为它是首字母缩写。"}]}],"synonyms":["initialism","code","abbreviation"],"phonetic":"/eɪ eɪ ɛks/","extraExplanation":["“AAX”通常读作三个字母的字母读法（A-A-X），属于“首字母缩写/代码”一类的写法。实际含义高度依赖使用场景：科技语境里常见为 Audible 的 .aax 文件；旅行语境里可能是机场三字码。"]}

