{"word":"ACGI","summary":{"en":"ACGI (more commonly ACGIH) refers to the American Conference of Governmental Industrial Hygienists, known for workplace exposure guidelines like TLVs.","zh":"ACGI（更常见写法为 ACGIH）指美国政府工业卫生学家会议，以 TLV 等职业暴露指南著称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation (usually written as ACGIH) for the American Conference of Governmental Industrial Hygienists, a professional organization known for publishing workplace exposure guidelines such as TLVs (Threshold Limit Values).","zh":"（缩写；更常写作 ACGIH）指“美国政府工业卫生学家会议”，一个专业组织，以发布工作场所暴露指南（如 TLV：阈值限值）而闻名。"},"examples":[{"en":"Our lab follows ACGIH guidelines for chemical exposure limits.","zh":"我们的实验室遵循 ACGIH 关于化学品暴露限值的指南。"},{"en":"The safety report cites ACGIH TLVs for airborne contaminants.","zh":"安全报告引用了 ACGIH 对空气中污染物的 TLV 标准。"}]}],"synonyms":["ACGIH"],"phonetic":"/ˌeɪ siː dʒiː aɪ/","extraExplanation":["在实际写法中，你更常看到 **ACGIH**（多一个 H），全称仍是同一个组织。很多人口语或文档里会把它简写/写错成 ACGI。","ACGIH 的 TLV（Threshold Limit Value，阈值限值）常用于职业健康与工业卫生领域，用来评估工人长期或短期接触某些化学物质、粉尘或噪声等的风险。"]}
{"word":"ACGIH","summary":{"en":"ACGIH is a U.S. professional organization known for publishing widely used workplace exposure and health guidance.","zh":"ACGIH 是美国的专业组织，以发布常用的工作场所暴露限值与职业健康指南而闻名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"American Conference of Governmental Industrial Hygienists (a professional organization in the U.S. that publishes workplace health guidance, especially exposure limit recommendations).","zh":"美国政府工业卫生学家会议（ACGIH；美国的专业组织，发布工作场所健康与工业卫生相关指南，尤其是暴露限值建议）。"},"examples":[{"en":"Our safety team checked the ACGIH recommendations before updating the chemical handling procedure.","zh":"我们的安全团队在更新化学品操作流程前，先查看了 ACGIH 的建议。"},{"en":"The report compares measured noise levels with ACGIH guidance.","zh":"报告将实测噪声水平与 ACGIH 指南进行了对比。"}]}],"synonyms":["American Conference of Governmental Industrial Hygienists"],"phonetic":"/ˌeɪ siː dʒiː aɪ eɪtʃ/","extraExplanation":["ACGIH 常见于职业健康/工业卫生领域文献中；它发布的 TLVs（Threshold Limit Values，阈限值）和 BEIs（Biological Exposure Indices，生物暴露指标）被广泛参考，但通常不具有法律强制力。实际合规要求往往以 OSHA（美国职业安全与健康管理局）或各国/各地区法规为准。","在写作中第一次出现通常写全称并在括号中注明缩写：American Conference of Governmental Industrial Hygienists (ACGIH)。之后可直接用 ACGIH。","读音在口语里多按字母逐个读（A-C-G-I-H），而不是当作一个单词来读。"]}

