{"word":"aci-nitro","summary":{"en":"A chemistry term for the acidic (nitronic-acid-like) tautomer of a nitro compound.","zh":"化学术语：指硝基化合物的酸性（类似“硝酸肟/硝基醇酸”）互变异构形式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"the less common tautomeric form of a nitro compound, where the group behaves like an acidic form (often written as a nitronic acid, R–C(=NOOH)–R′ or related forms).","zh":"“硝基化合物”的一种较少见的互变异构形式，在这种形式中该基团表现出酸性特征（常写作“硝酸肟/硝基醇酸”式，即类似 R–C(=NOOH)–R′ 的结构或相关形式）。"},"examples":[{"en":"Under strongly basic conditions, some nitro compounds can form the aci-nitro tautomer.","zh":"在强碱条件下，一些硝基化合物可能形成 aci-nitro 互变异构体。"},{"en":"The reaction proceeds through an aci-nitro intermediate before returning to the nitro form.","zh":"该反应会先经过一个 aci-nitro 中间体，然后再回到硝基形式。"}]},{"partOfSpeech":"n.","definition":{"en":"the aci-nitro form itself; an aci-nitro tautomer (a nitronic-acid-type structure).","zh":"aci-nitro 这种形式本身；指一个 aci-nitro 互变异构体（类似“硝酸肟/硝基醇酸”结构）。"},"examples":[{"en":"Spectroscopy suggested a small amount of the aci-nitro in equilibrium with the nitro compound.","zh":"光谱结果表明，在与硝基化合物的平衡中存在少量 aci-nitro 形式。"}]}],"synonyms":["nitronic acid (form)","aci form","aci-nitro tautomer"],"phonetic":"/ˌæsiˈnaɪtroʊ/","extraExplanation":["“aci-”来自拉丁语，意思与“酸/酸性”有关，用来强调这种硝基互变体具有可失去质子（更“像酸”）的特征，因此常与“nitronic acid（硝酸肟/硝基醇酸）”一起出现。","在有机化学语境里，你更常看到写法是“aci-nitro tautomer / aci form / nitronic acid form”。它通常只是平衡中的少量成分，但在某些反应机理中会作为关键中间体被提到。"]}
{"word":"acichlorid","summary":{"en":"An acyl chloride is a very reactive organic compound derived from a carboxylic acid (R–COCl), widely used in making other compounds.","zh":"酰氯（酸氯）是一类由羧酸衍生、反应性很强的有机化合物（R–COCl），常用于合成其他化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a reactive chemical compound (R–COCl) made from a carboxylic acid, often used to make esters, amides, and other organic compounds","zh":"（化学）酰氯/酸氯：由羧酸衍生的一类活泼化合物（R–COCl），常用于制备酯、酰胺等有机化合物"},"examples":[{"en":"Acyl chlorides react quickly with water, so they are usually handled under dry conditions.","zh":"酰氯与水反应很快，所以通常要在干燥条件下操作。"},{"en":"In the lab, acetyl chloride is a common acyl chloride used to introduce an acetyl group.","zh":"在实验室里，乙酰氯是常见的酰氯，用来引入乙酰基。"}]}],"synonyms":["acid chloride","acyl halide"],"phonetic":"/ˈeɪsɪl ˈklɔraɪd/","extraExplanation":["你输入的“acichlorid”更像是拼写错误；英语里最常见的对应词是 **acyl chloride**（酰氯/酸氯），也常写作 **acid chloride**。","酰氯的通式是 **R–COCl**，属于“羧酸衍生物”之一；它们通常比相应的羧酸更活泼，容易发生亲核取代反应（例如与醇生成酯、与胺生成酰胺）。","安全与日常语境提示：酰氯通常具有刺激性，并且遇水会放出氯化氢（HCl）气体；这类词多出现在化学学习与实验操作语境中。"]}
{"word":"acichloride","summary":{"en":"An acyl chloride is a reactive carboxylic-acid derivative (R–COCl) used to make esters and amides.","zh":"酰氯是一类反应性很强的羧酸衍生物（R–COCl），常用于合成酯和酰胺。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (R–COCl) made from a carboxylic acid, used to form esters and amides; also called an acyl chloride.","zh":"一种有机化合物（R–COCl），由羧酸衍生而来，常用于制备酯和酰胺；也叫“酰氯/酰基氯化物”。"},"examples":[{"en":"Acyl chlorides react quickly with water, so they are usually handled under dry conditions.","zh":"酰氯与水反应很快，所以通常需要在无水条件下操作。"},{"en":"The chemist used an acyl chloride to make an amide from an amine.","zh":"化学家用酰氯与胺反应制备酰胺。"}]}],"synonyms":["acyl chloride","acid chloride","alkanoyl chloride"],"phonetic":"/ˈeɪsaɪl ˈklɔːraɪd/","extraExplanation":["“acichloride”不是最常见的标准拼写；在化学英语里更常见、也更规范的写法是 **acyl chloride**（酰氯）。","酰氯通常具有强刺激性、易与水放热反应并产生氯化氢气体（HCl），实验室中常需在通风橱与干燥环境中操作。"]}
{"word":"acicula","summary":{"en":"Acicula means a small needle or needle-like structure, especially a needle-like leaf in botany or a tiny supporting needle/rod in zoology.","zh":"Acicula 指“小针”或“针状结构”，常用于植物学（针叶）或动物学（微小针状支撑结构）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small needle or needle-like part; a sharp, slender structure in plants or animals","zh":"小针；针状结构；（植物或动物体内的）针状小部件"},"examples":[{"en":"Under the microscope, each acicula looked like a tiny, transparent needle.","zh":"在显微镜下，每一根小针状体看起来都像细小透明的针。"},{"en":"Some marine animals have acicula that help support or stiffen their bodies.","zh":"一些海洋动物体内有针状支撑体，能帮助支撑或使身体更坚挺。"}]},{"partOfSpeech":"n.","definition":{"en":"(botany) a needle-like leaf or spine, especially in conifers","zh":"（植物）针叶；针状叶（尤指针叶树的叶）"},"examples":[{"en":"Pines have acicula adapted to reduce water loss in cold or dry climates.","zh":"松树的针叶有助于在寒冷或干燥气候中减少水分流失。"}]},{"partOfSpeech":"n.","definition":{"en":"(zoology) a small supporting rod or needle-like element, such as in some sponges or worms","zh":"（动物）针状支撑小骨针/小杆状结构（如某些海绵或蠕虫体内）"},"examples":[{"en":"The sponge’s skeleton can include many tiny acicula.","zh":"海绵的骨架可能由许多细小的针状骨针组成。"}]}],"synonyms":["needle","spine","needle-like structure","bristle"],"phonetic":"əˈsɪkjələ","extraExplanation":["词源：来自拉丁语 acicula，意为“细针/小针”，是 acus（针）的指小形式，因此常用来描述“又细又尖、像针一样”的结构。","复数形式常见为 aciculae（读作类似“uh-SIK-yuh-lee”），在生物学或植物学论文中更常见。","这是偏专业的学术词：日常英语里通常会用 needle-like structure（针状结构）或 spine（刺）来替代。"]}
{"word":"aciculae","summary":{"en":"Aciculae are small needle-like supporting structures (plural of acicula), used especially in zoology.","zh":"aciculae 指细小的针状支撑结构（acicula 的复数），多用于动物学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"small, needle-like structures (the plural of acicula), especially the internal supporting rods/bristles found in some animals such as polychaete worms and certain sponges","zh":"（acicula 的复数）细小的针状结构，常指某些动物（如多毛类沙蚕、部分海绵）体内起支撑作用的针状骨针/刚毛"},"examples":[{"en":"Under the microscope, the polychaete’s aciculae help support each parapodium during movement.","zh":"在显微镜下，可以看到多毛类的 aciculae 在运动时帮助支撑每个疣足。"},{"en":"The researcher compared the shape of aciculae across different species to aid identification.","zh":"研究人员比较不同物种的 aciculae 形态，以帮助鉴定。"}]}],"synonyms":["needle-like rods","supporting spicules","bristles (general)"],"phonetic":"/əˈsɪkjəˌliː/","extraExplanation":["“aciculae”是拉丁语复数形式（-ae 结尾常见于拉丁语第一变格名词的复数）。在英文科学写作中常保留这种复数拼写，用于动物学/无脊椎动物学等语境；单数是“acicula”。","不要与更常见的“setae（刚毛）”混为一谈：aciculae 通常指更硬、更像内部支架的针状结构，而 setae 往往泛指表面的毛状/刚毛结构。"]}
{"word":"acicular","summary":{"en":"Acicular describes something that is needle-shaped, especially in scientific contexts.","zh":"Acicular 用来形容“针状的”，多见于植物学、地质学等科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Needle-shaped; long, thin, and pointed (often used in scientific descriptions, especially botany and geology).","zh":"针状的；细长而尖的（常用于科学描述，尤指植物学与地质学）。"},"examples":[{"en":"The pine tree has acicular leaves that help reduce water loss.","zh":"松树有针状的叶子，有助于减少水分流失。"},{"en":"Under the microscope, the mineral formed acicular crystals.","zh":"在显微镜下，这种矿物形成了针状晶体。"}]}],"synonyms":["needle-shaped","spiky","pointed","filiform"],"phonetic":"/əˈsɪkjələr/","extraExplanation":["词源来自拉丁语 *acicula*（“小针”），与 *acer*（“尖的”）有关，因此它常出现在需要“形状精确”的学术语境中。","在植物学里，*acicular leaves* 通常指松针这类叶；在矿物学/地质学里，*acicular crystals* 指细长如针的晶体形态。"]}
{"word":"acicularity","summary":{"en":"Acicularity means the needle-like shape or the degree to which something is needle-shaped.","zh":"acicularity 指“针状性”，即某物呈针形或具有针状特征的程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being needle-shaped; a needle-like form or structure","zh":"针状性；呈针形的性质或状态"},"examples":[{"en":"Under the microscope, the crystals showed strong acicularity.","zh":"在显微镜下，这些晶体呈现出明显的针状性。"},{"en":"The plant’s leaves have acicularity, helping reduce water loss in dry climates.","zh":"这种植物的叶片具有针状性，有助于在干燥气候中减少水分流失。"}]}],"synonyms":["needle-like form","needle-shapedness","acicular form"],"phonetic":"/əˌsɪkjəˈlærɪti/","extraExplanation":["“acicularity”来自形容词“acicular”（针状的），源自拉丁语 *acus*（针）。这个词多见于植物学、矿物学与材料科学，用来描述叶片、晶体或纤维等的“针状外形”。"]}
{"word":"acicularly","summary":{"en":"“Acicularly” means “in a needle-like, sharply pointed way,” mainly in scientific descriptions.","zh":"“acicularly”意为“呈针状、尖锐细长地”，主要用于科学描述。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a needle-like way; with a slender, sharply pointed shape (often used in scientific writing).","zh":"以针状的方式；呈细长、尖锐的形态（常用于科学语境）。"},"examples":[{"en":"The crystals grew acicularly, forming thin, needle-like bundles.","zh":"这些晶体呈针状生长，形成细长的针束。"},{"en":"Under the microscope, the spores appeared acicularly pointed at one end.","zh":"在显微镜下，孢子一端看起来呈针状尖端。"}]}],"synonyms":["needle-like","in a needle-shaped manner","sharply","pointedly"],"phonetic":"/əˈsɪkjələrli/","extraExplanation":["“acicularly”来自形容词“acicular”（针状的），常见于植物学、矿物学、材料科学等描述形态的学术写作中；日常英语里很少用。","相关词族：acicular（adj. 针状的），acicula（n. 小针/针状结构，较少见）。"]}
{"word":"aciculas","summary":{"en":"Aciculas are small needle-like structures (plural of acicula), often referring to pine needles or similar shapes in biology.","zh":"aciculas 指细小的针状结构（acicula 的复数），常指松针等针形叶或生物学中的针状结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of acicula) small needle-like structures, especially the needle-shaped leaves of some plants (such as pines) or needle-like parts seen in biology.","zh":"（acicula 的复数）细小的针状结构，尤指某些植物（如松树）的针形叶，或生物学中看到的针状部位。"},"examples":[{"en":"Pine trees have aciculas that reduce water loss in cold or dry climates.","zh":"松树有针叶（aciculas），能在寒冷或干燥的环境中减少水分流失。"},{"en":"Under the microscope, the sample showed tiny aciculas along the surface.","zh":"在显微镜下，样本表面可以看到细小的针状结构（aciculas）。"}]}],"synonyms":["needles","needle-like structures","spicules"],"phonetic":"/əˈsɪkjələz/","extraExplanation":["“acicula”来自拉丁语，意思是“细针/小针”。在英语里更常见的复数形式是拉丁式的“aciculae”，但在一些科学写作中也会看到英语化复数“aciculas”。","在植物学里，它常用来指针叶树（如松、云杉）的针状叶；在显微/解剖语境中，也可泛指“针状的微小结构”。"]}
{"word":"aciculate","summary":{"en":"Aciculate means needle-shaped, especially in scientific descriptions.","zh":"Aciculate 指“针状的”，多用于科学/植物学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"needle-shaped; having long, narrow, pointed form (often used in botany to describe leaves, spines, or crystals).","zh":"针状的；细长而尖的（常用于植物学，描述叶子、刺或晶体的形状）。"},"examples":[{"en":"The pine has aciculate leaves that stay green through winter.","zh":"松树有针状的叶子，冬天也保持常绿。"},{"en":"Under the microscope, we saw aciculate crystals forming along the edge.","zh":"在显微镜下，我们看到边缘形成了针状晶体。"}]}],"synonyms":["needle-shaped","needlelike","acicular"],"phonetic":"əˈsɪkjələt","extraExplanation":["“Aciculate”多见于科学写作（尤其是植物学、地质/矿物学），日常英语里更常用的同义表达是“needle-shaped”或“needlelike”。","词源来自拉丁语“acus”（针），与常见近义词“acicular（针状的）”同源。"]}
{"word":"aciculated","summary":{"en":"Aciculated means needle-like in shape, commonly used in scientific descriptions.","zh":"aciculated 指“针状的”，多用于科学或形态描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially in botany or zoology) Having a needle-like shape; slender, pointed, and often stiff.","zh":"（尤用于植物学或动物学）针状的；细长尖锐、常较硬挺的。"},"examples":[{"en":"The cactus has aciculated spines that protect it from animals.","zh":"这种仙人掌长着针状的刺，用来保护它免受动物啃食。"},{"en":"Under the microscope, the mineral showed aciculated crystals.","zh":"在显微镜下，这种矿物呈现出针状晶体。"},{"en":"Some conifers have aciculated leaves that reduce water loss.","zh":"一些针叶树有针状叶，有助于减少水分流失。"}]}],"synonyms":["needle-like","aciculate","spine-like","pointed"],"phonetic":"əˈsɪkjəˌleɪtɪd","extraExplanation":["“aciculated”较少见，更常见的形式是“aciculate”（针状的）。两者都源自拉丁语 acicula（“小针”），常用于科学描写，如植物叶片、刺或矿物晶体的形状。","在日常英语里，人们通常会说“needle-like”来表达同样意思。"]}
{"word":"aciculum","summary":{"en":"Aciculum means a tiny needle-like structure, used mainly in biology and zoology.","zh":"Aciculum 指细小的针状结构，主要用于生物学与动物学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small needle-like structure, especially in biology (for example, a tiny spine or bristle).","zh":"（尤指生物学中）细小的针状结构，例如微小的刺、刚毛。"},"examples":[{"en":"Under the microscope, the larva has tiny acicula along its body.","zh":"在显微镜下，这种幼体的身体上有细小的针状结构（acicula）。"},{"en":"Some organisms use acicula for support or protection.","zh":"一些生物用细小的针状结构来支撑身体或起到保护作用。"}]},{"partOfSpeech":"n.","definition":{"en":"(zoology) a small supporting rod, often calcareous (made of calcium carbonate), found in some invertebrates.","zh":"（动物学）某些无脊椎动物体内的微小支撑杆，常为钙质（碳酸钙构成）。"},"examples":[{"en":"The researcher described the aciculum as a rigid internal support.","zh":"研究者将这种 aciculum 描述为坚硬的内部支撑结构。"}]}],"synonyms":["needle-like structure","spine","bristle","spicule"],"phonetic":"/əˈsɪkjələm/","extraExplanation":["词源提示：aciculum 来自拉丁语 acicula（意为“细针、小针”），是 acus（“针”）的指小形式。这个词多见于学术写作（生物学、动物学、植物学）而非日常英语。","用法提示：复数通常写作 acicula。不同学科对它指代的具体结构可能不同，但核心意象都是“很小、像针一样的支撑或刺状物”。"]}
{"word":"aciculums","summary":{"en":"Aciculum means a tiny needle-like structure found in certain animals, plants, or fungi; plural is often acicula (also aciculums).","zh":"Aciculum 指动植物或真菌中的针状微小结构；复数常用 acicula（也可用 aciculums）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small needle-like structure, especially a tiny spine or bristle in animals (such as a worm’s supporting bristles) or a needle-shaped part in plants or fungi.","zh":"针状的小结构；尤指动物（如多毛类蠕虫的支撑刚毛/刺）或植物、真菌中的针形部位。"},"examples":[{"en":"Under the microscope, the worm’s aciculum looks like a tiny needle that helps support its bristles.","zh":"在显微镜下，这条蠕虫的 aciculum 看起来像一根小针，用来支撑它的刚毛。"},{"en":"The researcher compared the acicula of several marine species to identify them.","zh":"研究人员比较了几种海洋物种的 acicula（针状结构）来进行鉴定。"}]}],"synonyms":["needle-like spine","bristle support (context-dependent)","spicule (related in some contexts)"],"phonetic":"əˈsɪkjələm","extraExplanation":["“aciculums”通常是“aciculum”的复数形式之一，但更常见、更“学术”的拉丁复数是“acicula”。在科学写作里常见用法：one aciculum / many acicula。","词源来自拉丁语“acicula”（小针），因此在生物学、植物学、真菌学、动物学等领域更常见，日常英语里不太常用。"]}
{"word":"Acid","summary":{"en":"Acid is most commonly a chemical substance (pH below 7) that can be corrosive; it can also mean “sour/sharp” as an adjective, and informally it can refer to LSD.","zh":"Acid最常指化学上的“酸”（pH小于7，可能有腐蚀性）；也可作形容词表示“酸的/刺鼻的”；口语中还可指LSD致幻剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A chemical substance with a sour taste that can react with metals and some materials; in science, a substance that donates hydrogen ions (H+) in water or has a pH below 7.","zh":"酸；一种带酸味、能与金属等发生反应的化学物质；在科学中指在水中能释放氢离子（H+）或 pH 值低于7的物质。"},"examples":[{"en":"Lemon juice contains citric acid.","zh":"柠檬汁含有柠檬酸。"},{"en":"Be careful—battery acid can burn your skin.","zh":"小心——电池酸会灼伤皮肤。"},{"en":"In the lab, we tested whether the liquid was an acid or a base.","zh":"在实验室里，我们测试这种液体是酸还是碱。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a sour or sharp taste or smell.","zh":"（味道或气味）酸的；尖锐刺鼻的。"},"examples":[{"en":"The yogurt tastes a little acid.","zh":"这酸奶尝起来有点酸。"},{"en":"An acid smell filled the room.","zh":"房间里弥漫着一股刺鼻的酸味。"}]},{"partOfSpeech":"n.","definition":{"en":"LSD (lysergic acid diethylamide), a strong illegal hallucinogenic drug.","zh":"“Acid”：指LSD（麦角酸二乙胺），一种强效、通常非法的致幻药。"},"examples":[{"en":"The movie shows a character who takes acid and sees vivid colors.","zh":"电影里有个角色服用LSD（acid）后看见鲜艳的幻觉色彩。"},{"en":"In many countries, possessing acid (LSD) is illegal.","zh":"在许多国家，持有LSD（acid）是违法的。"}]}],"synonyms":["(chemical) acid","(taste) sour","(drug slang) LSD"],"phonetic":"/ˈæsɪd/","extraExplanation":["在日常英语里，**acid**最常见是“酸（化学物质）”。作为形容词时，表示“酸的/刺鼻的”，但更常用的是 **sour**（酸味的，口感），而 **acid** 更偏“尖锐、刺激、化学感”。","“acid”指LSD属于口语/俚语用法，语境上多与毒品、派对文化或60年代反主流文化相关；在正式或教育场合需要谨慎使用。","常见搭配：**acid rain**（酸雨）、**acid test**（关键考验/试金石）、**acid reflux**（胃酸逆流/反酸）、**citric acid**（柠檬酸）、**acetic acid**（醋酸）。"]}
{"word":"acid","summary":{"en":"Acid most commonly means a sour, reactive chemical substance; it can also describe sharp, sarcastic speech or tone, and informally it can mean LSD.","zh":"acid 最常见指“酸（化学物质）”；也可指“尖刻、讽刺的言语/语气”，在非正式用法中还可指迷幻药 LSD。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical substance that usually has a sour taste, can burn or react with materials, and turns some indicators (like litmus) red; in everyday life, acids are found in things like lemon juice and vinegar","zh":"酸；一种化学物质，通常味道酸，可能具有腐蚀性或与其他物质发生反应，并能使某些指示剂（如石蕊）变红；日常生活中柠檬汁、醋等都含酸"},"examples":[{"en":"Lemon juice contains a natural acid.","zh":"柠檬汁里含有天然的酸。"},{"en":"Be careful—this acid can damage your skin.","zh":"小心——这种酸可能会伤害皮肤。"}]},{"partOfSpeech":"n.","definition":{"en":"a bitter, sharp, or sarcastic way of speaking or writing","zh":"尖刻；刻薄；讽刺（的言语或写作风格）"},"examples":[{"en":"There was acid in his voice when he replied.","zh":"他回答时语气里带着尖刻。"},{"en":"The review is full of acid comments.","zh":"这篇评论充满了尖酸的评语。"}]},{"partOfSpeech":"adj.","definition":{"en":"sour, sharp, or harsh in taste, smell, or tone","zh":"酸的；刺鼻的；（语气）尖刻的"},"examples":[{"en":"The milk has an acid smell.","zh":"牛奶有一股酸味（发酸的气味）。"},{"en":"She gave me an acid look.","zh":"她给了我一个很不友善、带点尖刻的眼神。"}]},{"partOfSpeech":"n.","definition":{"en":"informal: LSD, a powerful hallucinogenic drug","zh":"（非正式）迷幻药 LSD（麦角酸二乙胺）"},"examples":[{"en":"He said he took acid in college. (informal)","zh":"他说他大学时吸过“酸”（LSD）。（非正式）"}]}],"synonyms":["sour","caustic","biting","sarcastic","acerbic"],"phonetic":"/ˈæsɪd/","extraExplanation":["在科学语境里，acid 常指“酸性物质”。在更进阶的化学定义中，酸可以被理解为“提供氢离子（H+）的物质”（Arrhenius/Brønsted–Lowry 等理论），但日常英语里更常用“sour/caustic/reactive”来描述。","在文学或新闻评论中，acid 常用作比喻，表示“像酸一样刺痛、腐蚀”的语言风格（acid remark / acid wit），强调尖刻和伤人。","“acid”指 LSD 的用法带有强烈文化与健康风险含义，属于俚语；在正式写作或教学中通常会明确标注为 informal/slang。"]}
{"word":"acid anhydride","summary":{"en":"a water-free derivative of an acid that forms the acid again when water is added","zh":"由酸脱水形成、遇水可生成相应酸的化合物（酸酐）"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A chemical compound derived from an acid by removing water; it reacts with water (hydrolyzes) to form the corresponding acid(s).","zh":"（化学）由酸脱去水而形成的化合物；遇水会水解生成相应的酸。"},"examples":[{"en":"Acetic anhydride reacts with water to produce acetic acid.","zh":"乙酸酐遇水反应会生成乙酸。"},{"en":"Many acid anhydrides must be stored in dry conditions because they hydrolyze easily.","zh":"许多酸酐需要在干燥条件下保存，因为它们很容易水解。"}]},{"partOfSpeech":"phrase","definition":{"en":"More specifically, an anhydride formed from carboxylic acids, widely used as an acylating agent in organic synthesis.","zh":"（更具体）由羧酸形成的酸酐，常用于有机合成中的酰化试剂。"},"examples":[{"en":"The lab used acetic anhydride to acetylate the alcohol.","zh":"实验室用乙酸酐对醇进行乙酰化。"},{"en":"Carboxylic acid anhydrides are common reagents in making esters and amides.","zh":"羧酸酸酐是制备酯和酰胺的常见试剂。"}]}],"synonyms":["anhydride","carboxylic anhydride","acidic oxide"],"phonetic":"/ˈæsɪd ænˈhaɪdraɪd/","extraExplanation":["易混点：acid anhydride 指“酸的无水物/酸酐”，不是“酸性酐（acidic anhydride）”这种笼统说法。","常见例子：乙酸酐（acetic anhydride）属于“羧酸酸酐”；而 SO3、P2O5 这类有时也被称作“酸酐/酸性氧化物”，加水生成酸（如 SO3 + H2O → H2SO4），不同教材分类口径可能略有差异。"],"etymology":"词源：acid（酸）+ anhydride（“无水物”）。anhydride 来自希腊语 an-（不、无）+ hydor（水），原意是“没有水的”。化学上指“由酸脱水得到、遇水又能生成酸的物质”。","mnemonic":["记忆法：anhydride = an-（无）+ hydr-（水），联想“无水的酸 → 酸酐”。","把“酐”记成“干”：酸酐喜欢“干燥”，一遇水就变回酸。"]}
{"word":"acid dye","summary":{"en":"A dye used in acidic solutions, especially for wool, silk, and nylon.","zh":"在酸性条件下使用的染料，常用于羊毛、丝绸、尼龙等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A dye that is applied in an acidic solution and bonds well to fibers such as wool, silk, nylon, and some modified acrylics.","zh":"一种在酸性溶液中使用的染料，常用于羊毛、丝绸、尼龙及部分改性腈纶等纤维，具有较好的上染与结合效果。"},"examples":[{"en":"Wool usually takes acid dye well when the bath is kept slightly acidic.","zh":"羊毛在染浴保持微酸性时，通常很容易吃上酸性染料。"},{"en":"The factory uses acid dyes to produce bright, wash-resistant colors on nylon fabric.","zh":"工厂使用酸性染料在尼龙面料上做出鲜艳且耐洗的颜色。"}]}],"synonyms":["anionic dye","acid colorant","textile dye"],"phonetic":"/ˈæsɪd daɪ/","extraExplanation":["理解要点：这里的“acid”主要指“在酸性染浴中使用/发挥作用”，并不表示染料本身一定“像强酸一样腐蚀”。","常见搭配：acid dye bath（酸性染浴）、acid dyeing（酸性染色）、leveling acid dye（匀染型酸性染料）、milling acid dye（耐湿处理/耐缩绒型酸性染料）、metal-complex acid dye（金属络合酸性染料）。"],"etymology":"“acid dye”由“acid（酸的）+ dye（染料）”构成，是按染色条件与染料在酸性介质中的表现来命名的类别术语；早期染色工艺中常用酸来调节染浴的pH，以促进染料与纤维（尤其是蛋白质纤维如羊毛、丝绸）结合，因此形成这一叫法。","mnemonic":["把它记成“酸里染（酸=酸性环境，dye=染）”：在“酸”的染浴里用的“染料”。","联想“羊毛/丝绸喜欢酸”：蛋白质纤维在微酸环境更容易上染酸性染料。"]}
{"word":"acid fog","summary":{"en":"Polluted fog with acidic chemicals that can harm health and the environment.","zh":"含酸性污染物、可能危害健康与环境的污染雾。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fog made more harmful by acidic pollutants in the air, which can irritate the lungs and eyes and damage plants and buildings.","zh":"因空气中的酸性污染物而更具危害性的雾；可刺激呼吸道和眼睛，并破坏植物与建筑。"},"examples":[{"en":"The weather report warned of acid fog in industrial areas early in the morning.","zh":"天气预报提醒工业区清晨可能出现酸雾。"},{"en":"People with asthma should avoid going outside during acid fog.","zh":"哮喘患者在酸雾期间应避免外出。"}]}],"synonyms":["polluted fog","industrial fog","smog"],"phonetic":"ˈæsɪd fɑɡ","extraExplanation":["acid fog 不等同于 acid rain（酸雨）：酸雾发生在近地面、能见度低、对呼吸道刺激更直接；酸雨强调降水把酸性物质带到地表。","在新闻与科普中，acid fog 常与 smog（烟雾/雾霾）、air pollution（空气污染）、industrial emissions（工业排放）一起出现。"],"etymology":"由 acid（酸的）+ fog（雾）构成的环境科学复合词；常用于描述含硫氧化物、氮氧化物等污染物与水汽形成、酸度较高且刺激性更强的雾霾/雾现象。","mnemonic":["把它当作“酸 + 雾”：雾里混了“酸性污染”，闻起来更呛、对身体更刺激。","联想中文固定说法“酸雾”，和“酸雨”成对记：雾在空气里，雨落到地上。"]}
{"word":"Acid Jazz","summary":{"en":"a jazz-based fusion genre linked to funk, soul, hip-hop, and club culture","zh":"以爵士为底、融合放克/灵魂/嘻哈并与夜店文化相关的音乐风格"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A style of music (especially popular in the late 1980s–1990s) that mixes jazz with funk, soul, hip-hop, and electronic dance music, often linked to club culture and DJ sampling.","zh":"一种音乐风格（多流行于20世纪80年代末至90年代），把爵士与放克、灵魂乐、嘻哈与电子舞曲等融合在一起，常与夜店文化和DJ采样有关。"},"examples":[{"en":"The playlist blends acid jazz with classic funk and modern soul.","zh":"这份歌单把酸爵士、经典放克和现代灵魂乐混在一起。"},{"en":"They discovered acid jazz through 1990s club compilations.","zh":"他们是通过90年代的夜店合辑认识酸爵士的。"},{"en":"Jam sessions became dance-floor tracks in the acid jazz scene.","zh":"在酸爵士圈里，即兴合奏常被做成适合舞池的曲目。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to or characteristic of that music style.","zh":"与酸爵士这种风格有关的；带有酸爵士特点的。"},"examples":[{"en":"The band has an acid jazz groove with tight bass lines.","zh":"这支乐队有一种酸爵士的律动，贝斯线条很紧凑。"},{"en":"She DJs an acid jazz set on weekends.","zh":"她周末会DJ一套酸爵士的歌单。"}]}],"synonyms":["jazz-funk","jazz fusion","funk jazz","club jazz","neo-soul"],"phonetic":"ˌæsɪd ˈdʒæz","extraExplanation":["“Acid”在这里通常不是指“酸味/酸性”，而是借用俱乐部音乐语境里的“acid”意象（偏迷幻、实验、夜店氛围）。","常被提到的相关艺人/团体包括 Jamiroquai、Brand New Heavies 等（也因地区与唱片厂牌而有所差异）。","写法上常见大写作 Acid Jazz（指流派名称），也可小写 acid jazz（泛指风格）。"],"etymology":"词组在20世纪80年代末英国兴起：acid（当时流行文化里常用来指“迷幻/俱乐部取向”的风格，如 acid house）+ jazz，用来给融合爵士与舞曲/放克等元素的新潮音乐贴标签。","mnemonic":["把它记成“夜店里的爵士”：acid（俱乐部/迷幻氛围）+ jazz（爵士）→ 更适合跳舞、更融合的爵士。","联想中文“酸”=“有味道/有劲儿（很潮）”的网络说法：酸爵士=很潮的融合爵士。"]}
{"word":"acid mist","summary":{"en":"airborne acidic droplets (an irritating, corrosive aerosol)","zh":"空气中含酸的雾状液滴（刺激性、腐蚀性的气溶胶）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cloud of tiny liquid droplets containing acid (often sulfuric or nitric acid) floating in the air, which can irritate the eyes and lungs and damage materials.","zh":"含酸的细小液滴在空气中形成的雾状气溶胶（常见为硫酸或硝酸），会刺激眼睛和呼吸道，并可能腐蚀材料。"},"examples":[{"en":"Workers wore respirators because acid mist can harm the lungs.","zh":"工人戴着呼吸器，因为酸雾会伤害肺部。"},{"en":"The factory installed scrubbers to reduce acid mist emissions.","zh":"工厂安装了洗涤塔来减少酸雾排放。"},{"en":"Acid mist can corrode metal surfaces over time.","zh":"酸雾会随着时间推移腐蚀金属表面。"}]}],"synonyms":["acid fog","acidic aerosol","sulfuric acid mist","acid aerosol"],"phonetic":"/ˈæsɪd mɪst/","extraExplanation":["常见来源包括电镀、酸洗、冶炼、化工生产及燃烧排放等过程产生的酸性气溶胶。","与 acid rain（酸雨）不同：acid mist 是空气中的“雾/气溶胶”，更偏向吸入暴露与近距离刺激；酸雨强调降水沉降对环境的影响。","在职业卫生与环境法规文件里常见搭配：acid mist exposure（酸雾暴露）、acid mist emissions（酸雾排放）、sulfuric acid mist（硫酸雾）。"],"etymology":"由“acid（酸）+ mist（薄雾）”直接组合而成的名词短语，用来描述“含酸的雾状气溶胶”。在环保与职业健康语境中常见。","mnemonic":["把它拆开记：acid=酸，mist=雾 → “酸雾”。看到两个词就能直译出核心意思。","联想场景：化工厂里像“白雾”一样的气体，但带酸性，会“呛/刺眼”→ acid mist。"]}
{"word":"acid rain","summary":{"en":"pollution-caused unusually acidic precipitation","zh":"由污染造成、酸度异常的降水"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"rain (or other wet deposition like snow or fog) that is unusually acidic because air pollution forms acids in the atmosphere, which can damage lakes, forests, buildings, and health","zh":"酸雨：由于空气污染物在大气中形成酸性物质，使雨（也包括雪、雾等湿沉降）酸度异常升高，可能破坏湖泊、森林、建筑并影响健康"},"examples":[{"en":"Acid rain can make some lakes too acidic for fish to survive.","zh":"酸雨会让一些湖泊酸度过高，导致鱼类无法生存。"},{"en":"The monument’s stone surface was slowly worn away by acid rain.","zh":"这座纪念碑的石质表面被酸雨逐渐腐蚀。"},{"en":"Reducing sulfur dioxide emissions helps cut acid rain.","zh":"减少二氧化硫排放有助于降低酸雨。"}]}],"synonyms":["acid deposition"],"phonetic":"/ˈæsɪd reɪn/","extraExplanation":["酸雨常与燃烧煤、石油有关：排放的二氧化硫（SO₂）和氮氧化物（NOₓ）在空气中反应生成硫酸、硝酸，随雨雪降落。","日常学习中可把它理解为一种“环境问题名词”，常见搭配：acid rain damages…, acid rain pollution, acid rain levels, prevent/reduce acid rain。"],"etymology":"由“acid（酸的）+ rain（雨）”构成的复合名词；20世纪随着工业污染研究与环保议题普及而广泛使用，用来描述被污染后“酸性增强”的降水。","mnemonic":["直译记忆：acid=酸，rain=雨，合起来就是“酸的雨”。","联想画面：雨滴像“醋”一样把石头慢慢“咬”掉——帮助记住它会腐蚀建筑、伤害环境。"]}
{"word":"acid salt","summary":{"en":"a partially neutralized salt that can still act acidic in water","zh":"多元酸部分中和後形成、仍含可電離氫而呈酸性的鹽"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a salt that still contains replaceable hydrogen (H+) from a polyprotic acid and can make an aqueous solution acidic (often called a hydrogen salt).","zh":"（化學）酸式鹽：由多元酸部分中和形成、仍保留可電離的氫（H+）的鹽；溶於水後常呈酸性（也常稱「氫鹽」）。"},"examples":[{"en":"Sodium bisulfate (NaHSO4) is an acid salt used in pool maintenance.","zh":"酸式硫酸鈉（NaHSO4）是一種常用於泳池維護的酸式鹽。"},{"en":"An acid salt forms when only one of the acid’s hydrogens is replaced by a metal ion.","zh":"當酸的氫只有一部分被金屬離子取代時，就會形成酸式鹽。"},{"en":"Potassium hydrogen tartrate is an acid salt that can taste sour.","zh":"酒石酸氫鉀是一種酸式鹽，嚐起來可能帶酸味。"}]}],"synonyms":["hydrogen salt","acidic salt","bisalt"],"phonetic":"/ˈæsɪd sɔlt/","extraExplanation":["不要把 acid salt 與「酸性的鹽（acidic salt）」或「含酸的鹽」混為一談：acid salt 特指「仍保留氫、可進一步中和」的那一類鹽。常見命名線索：英文名裡常出現 hydrogen 或 bi-（如 bicarbonate, bisulfate）。"],"etymology":"「acid salt」是化學描述性用語：acid（酸）+ salt（鹽）。在酸鹼中和反應中，如果多元酸（如H2SO4、H2CO3）只被部分中和，生成物仍帶有可再反應的氫，因此稱為「酸式鹽／氫鹽」。","mnemonic":["記「酸式鹽＝酸還沒中和完」：多元酸的 H 沒被全換掉，鹽裡還「留著一點酸」。","看到 hydrogen / bi-（bicarbonate, bisulfate）就聯想到「還有一個H」，多半是 acid salt。"]}
{"word":"acid soluble","summary":{"en":"able to dissolve in acid","zh":"可溶于酸；酸溶性的"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"able to dissolve in acid (a substance that reacts with and breaks it down into a solution)","zh":"可溶于酸的；能在酸中溶解的（指物质遇酸后可被溶解形成溶液）"},"examples":[{"en":"This mineral is acid soluble, so it dissolves quickly in hydrochloric acid.","zh":"这种矿物可溶于酸，所以在盐酸中会很快溶解。"},{"en":"The lab separated the acid-soluble fraction from the acid-insoluble residue.","zh":"实验室把“酸溶部分”和“酸不溶残渣”分离开了。"},{"en":"Carbonate rocks are often acid soluble and may fizz when acid is added.","zh":"碳酸盐岩通常可溶于酸，加酸时可能会起泡。"}]}],"synonyms":["acid-dissolvable","dissolvable in acid","acid-soluble"],"phonetic":"/ˈæsɪd ˈsɑljəbəl/","extraExplanation":["常见搭配：acid-soluble（作定语时常加连字符，如 acid-soluble salts “酸溶性盐”）。与之相对的是 acid-insoluble（酸不溶）。","在论文/报告里常见的结构：acid-soluble fraction（酸溶组分）、acid-soluble nutrients（酸溶性养分）、acid-soluble proteins（酸溶性蛋白）。"],"etymology":"这是一个科技英语里的组合表达：acid（酸）+ soluble（可溶的）。soluble 源自拉丁语 solvere（“松开、溶解”），在化学语境中指“能被某种溶剂溶解”。","mnemonic":["soluble 看起来像 “so + lube（润滑）”：被酸“润开/化开”，就能溶解。","记成中文结构“酸 + 可溶”：看到 acid 就联想到“酸性环境”，soluble 就是“能溶”。"]}
{"word":"acid-base","summary":{"en":"“Acid-base” describes or refers to acids and bases, especially their reactions or pH balance in chemistry and medicine.","zh":"“acid-base”表示与酸和碱有关，尤指化学中的反应或医学中的 pH 酸碱平衡。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to acids and bases, especially their properties, reactions, or balance (as in chemistry or biology).","zh":"与酸和碱有关的，尤指它们的性质、反应或平衡（常用于化学或生物学）。"},"examples":[{"en":"The lab focuses on acid-base reactions in water.","zh":"这个实验室主要研究水中的酸碱反应。"},{"en":"Doctors monitor a patient’s acid-base balance through blood tests.","zh":"医生会通过验血来监测病人的酸碱平衡。"}]},{"partOfSpeech":"n.","definition":{"en":"A system or concept involving acids and bases, often referring to acidity/alkalinity (pH) in a solution or the body.","zh":"酸碱体系或概念，常指溶液或人体的酸度/碱度（pH）。"},"examples":[{"en":"This chapter introduces the acid-base system used to explain pH.","zh":"本章介绍用于解释 pH 的酸碱体系。"},{"en":"The body has several acid-base systems that help keep pH stable.","zh":"人体有多种酸碱系统，帮助维持 pH 稳定。"}]}],"synonyms":["acid–alkali","pH-related","acidic-alkaline"],"phonetic":"/ˈæsɪd ˈbeɪs/","extraExplanation":["写法提示：在学术写作中常见作形容词（acid-base balance/reaction/chemistry）。有时也写作 acid–base（用短横线或长破折号）。","语境提示：在医学里，acid-base balance（酸碱平衡）常与 blood pH、respiratory（呼吸性）和 metabolic（代谢性）一起出现。"]}
{"word":"acid-base neutralization titration","summary":{"en":"a titration method based on an acid–base neutralization reaction to find concentration","zh":"利用酸碱中和反应进行滴定以测定浓度的方法"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a lab method that uses a carefully measured acid and base reaction to find an unknown concentration by adding one solution until the neutralization point is reached","zh":"一种实验方法：利用酸和碱的中和反应，通过逐步加入已知浓度的溶液，直到达到中和点/当量点，从而测定未知溶液的浓度"},"examples":[{"en":"In acid-base neutralization titration, you add the titrant drop by drop while swirling the flask.","zh":"在酸碱中和滴定中，你一滴一滴加入滴定剂，同时摇匀锥形瓶。"},{"en":"The color change of phenolphthalein helps indicate the endpoint in many acid-base titrations.","zh":"酚酞的颜色变化常用来指示许多酸碱滴定的终点。"},{"en":"We used acid-base neutralization titration to determine the concentration of vinegar (acetic acid).","zh":"我们用酸碱中和滴定来测定食醋（乙酸）的浓度。"}]}],"synonyms":["acid-base titration","neutralization titration"],"phonetic":"/ˌæsɪd beɪs ˌnuːtrələˈzeɪʃən taɪˈtreɪʃən/","extraExplanation":["核心概念：当量点（equivalence point）是酸和碱在化学计量上“刚好反应完”的点；终点（endpoint）是你在实验中“看见/测到”的信号点（如指示剂变色），两者通常接近但不一定完全相同。","常见搭配：titrant（滴定剂，已知浓度）、analyte（被测物，未知浓度）、burette（滴定管）、indicator（指示剂）、standard solution（标准溶液）。"],"etymology":"这是由三个常见化学术语组合而成的短语：acid（酸）+ base（碱）+ neutralization（中和，来自“neutral”意为“中性”）+ titration（滴定，来自拉丁语 titulus/titrare，后来在化学中专指“用标准溶液逐滴测定浓度”的方法）。","mnemonic":["把它拆开记：acid + base → neutralization（变“中性”）+ titration（“滴”出来的测量）。看到“滴定”就联想到“滴滴加、算浓度”。","中和=“中+和”：酸碱反应后更接近“中性”；滴定=“一滴一滴定出答案”。"]}
{"word":"acid-etch","summary":{"en":"Acid-etch means to use acid to carve a design into a surface, or the carved design itself.","zh":"acid-etch 指用酸在表面腐蚀刻出图案，或指这种酸蚀刻形成的图案本身。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to cut or mark a design into a surface (such as metal, glass, or stone) by using acid","zh":"用酸（酸液）在表面（如金属、玻璃或石材）上腐蚀刻出图案或痕迹"},"examples":[{"en":"The artist acid-etched a pattern onto a copper plate for printmaking.","zh":"艺术家在铜版上用酸蚀刻出图案，用来制作版画。"},{"en":"The company acid-etched the logo on the glass door so it would last longer.","zh":"公司把标志用酸蚀刻在玻璃门上，这样更耐久。"}]},{"partOfSpeech":"n.","definition":{"en":"an image, pattern, or mark made by etching with acid","zh":"酸蚀刻形成的图案、图像或痕迹"},"examples":[{"en":"The acid-etch on the metal looks sharp and detailed.","zh":"金属上的酸蚀刻图案清晰、细节丰富。"},{"en":"You can feel the acid-etch with your fingertips.","zh":"你可以用指尖摸到酸蚀刻的纹理。"}]}],"synonyms":["etch","acid etch","engrave (broader)","corrode (technical/broader)"],"phonetic":"/ˈæsɪd ˌɛtʃ/","extraExplanation":["“Etch”本意是“蚀刻、刻蚀”。在艺术领域，acid etching（酸蚀刻）常见于铜版/锌版版画：先用防酸材料涂覆金属板，刮出线条，再用酸腐蚀出凹槽，最后上墨印刷。","在日常语境里，玻璃的“磨砂效果”有时也会说成 etched glass；其中一部分工艺确实可能使用酸蚀刻，但也可能是喷砂等方式。"]}
{"word":"acid-fast","summary":{"en":"resistant to acid decolorization after staining","zh":"染色后不易被酸性脱色的（抗酸性）"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of bacteria or cells) resistant to being decolorized (washed out) by acid alcohol after being stained, so it keeps its dye color in certain lab tests.","zh":"（指细菌或细胞）在被染色后，即使用酸酒精脱色也不易褪色，因此在特定实验中仍能保持染色颜色。"},"examples":[{"en":"Mycobacterium tuberculosis is acid-fast, so it stays red in a Ziehl–Neelsen stain.","zh":"结核分枝杆菌具有抗酸性，因此在齐尔-尼尔森（Ziehl–Neelsen）染色中会保持红色。"},{"en":"The lab reported acid-fast bacilli in the sputum sample.","zh":"实验室报告痰标本中发现抗酸杆菌。"}]}],"synonyms":["acid-resistant","nondecolorizable"],"phonetic":"/ˈæsɪd fæst/","extraExplanation":["这是医学/检验领域的专业形容词，常见搭配：acid-fast bacilli（AFB，抗酸杆菌）、acid-fast stain（抗酸染色）。","“fast”在这里不是“快”，而是“牢固、固定、耐……的”（类似 waterproof、colorfast）。理解这一点能避免误读。"],"etymology":"由 acid（酸）+ fast（“牢固的、褪不掉的”，如 colorfast “不褪色的”）组成；在微生物学里指“染色后不易被酸性脱色剂洗掉”。","mnemonic":["把它联想成 colorfast（不褪色的）：acid-fast = “遇到酸也不褪色/不掉色”。","fast 在这里=“牢”（像“牢固”），所以 acid-fast≈“酸也弄不掉的颜色”。"]}
{"word":"acid-forming","summary":{"en":"Acid-forming means producing acid or making something more acidic; in nutrition it often refers to foods thought to increase the body’s acid load after metabolism.","zh":"acid-forming 指“产酸的/使更酸的”；在营养学语境中常指被认为会增加人体代谢后“酸负荷”的食物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry/health) Producing acid, or causing something (such as soil, urine, or the body’s chemical balance) to become more acidic.","zh":"（化学/健康）产酸的；会产生酸或使（如土壤、尿液或人体的化学平衡）变得更酸的。"},"examples":[{"en":"Some fertilizers are acid-forming and can lower the soil’s pH over time.","zh":"有些肥料是产酸的，时间久了会降低土壤的 pH 值。"},{"en":"The doctor explained that certain medications can have an acid-forming effect in the body.","zh":"医生解释说，某些药物在体内可能有产酸的作用。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Nutrition, common but simplified) Describing foods believed to increase the body’s “acid load” after digestion and metabolism.","zh":"（营养学中常见但较简化的说法）指某些食物被认为在消化与代谢后会增加人体的“酸负荷”。"},"examples":[{"en":"Some diet plans label meat and many cheeses as acid-forming foods.","zh":"一些饮食方案把肉类和许多奶酪标为“产酸性食物”。"},{"en":"She tries to balance acid-forming foods with plenty of vegetables.","zh":"她会用大量蔬菜来平衡所谓的产酸性食物。"}]}],"synonyms":["acid-producing","acidifying"],"phonetic":"ˈæsɪd ˌfɔrmɪŋ","extraExplanation":["“acid-forming（产酸）”在科学语境里通常与“pH 下降/酸度增加”有关（例如土壤化学、尿液酸碱度等）。","在饮食语境里，“acid-forming foods（产酸性食物）”常见于“酸碱体质/碱性饮食”等说法，更多指食物代谢后对体内酸负荷（常用 PRAL 等概念估算）的影响；这不等同于食物本身尝起来酸，也不意味着人体血液 pH 会被轻易改变（人体有严格的调节机制）。"]}
{"word":"acid-free","summary":{"en":"Acid-free describes materials (especially paper) made without acid so they last longer and don’t yellow or damage items over time.","zh":"Acid-free 指（尤其是纸类等）无酸材料，更耐久，不易发黄，也较不易长期损坏接触的物品。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made without acids (or with acids removed) so it will not easily yellow, become brittle, or damage what it touches over time; commonly used for paper, boxes, folders, and adhesives for storage and archiving.","zh":"无酸的；（不含酸或已去酸）因此不易随时间发黄、变脆，或长期接触时损坏物品；常用于纸张、收纳盒、文件夹与黏合材料，便于保存与档案管理。"},"examples":[{"en":"Store old photos in acid-free paper and boxes to keep them from yellowing.","zh":"把老照片放在无酸纸和无酸收纳盒里，能减少发黄。"},{"en":"The museum uses acid-free folders for documents that must last for decades.","zh":"博物馆用无酸文件夹来保存需要维持数十年的文件。"},{"en":"Look for “acid-free” on the label if you are scrapbooking important memories.","zh":"如果你在做纪念相册，想长期保存重要回忆，标签上最好找“acid-free（无酸）”。"}]}],"synonyms":["archival","pH-neutral","non-acidic"],"phonetic":"/ˌæsɪd ˈfriː/","extraExplanation":["“acid-free”多见于保存与修复领域（archival/archiving）。普通纸常含酸，时间久了会因酸性导致纤维分解，从而发黄、变脆；无酸材料能显著减缓这一过程。","标签上有时还会写“pH neutral（中性）”或“lignin-free（无木质素）”；对长期保存照片、书信、证书等更有帮助。"]}
{"word":"acid-leached","summary":{"en":"Treated or affected by acid that washes out dissolved substances.","zh":"指经过酸的淋洗/浸洗，使可溶成分被溶出或去除。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having had minerals or other substances washed out (removed) by an acid solution.","zh":"（被）酸浸的；经酸溶液淋洗/浸洗而使矿物质或其他成分被溶出、去除的。"},"examples":[{"en":"The researchers analyzed acid-leached soil to see which nutrients were missing.","zh":"研究人员分析了酸浸土壤，看看缺少哪些养分。"},{"en":"Acid-leached rock often looks lighter because some metals have been removed.","zh":"酸浸过的岩石常常看起来更浅色，因为部分金属被溶出了。"},{"en":"We prepared an acid-leached sample before measuring trace elements.","zh":"在测量微量元素之前，我们先制备了酸浸样品。"}]}],"synonyms":["acid-washed","acid-extracted","acid-treated"],"phonetic":"/ˌæsɪd ˈlitʃt/","extraExplanation":["“leach”常指液体渗透并把可溶物质带走；加上“acid-”说明“带走/溶出”的介质是酸。该词多见于地质与土壤学（酸性水或酸雨导致的淋洗）、材料与化学分析（用酸处理样品去除杂质或溶出目标成分）等语境。","常见搭配：acid-leached soil/rock/sample（酸浸土壤/岩石/样品）。写作中也会用被动表达：the sample was acid-leached before analysis（样品在分析前进行了酸浸处理）。"]}
{"word":"acid-like","summary":{"en":"“Acid-like” means having acid characteristics (sour/corrosive/acidic), or figuratively, having a sharp, bitter tone.","zh":"“acid-like”指具有酸的特性（酸味/腐蚀性/酸性）；也可比喻语气尖刻、刻薄。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having qualities similar to an acid, such as being sour, corrosive, or chemically acidic.","zh":"像酸的；具有酸的特性（如酸味、腐蚀性或呈酸性）。"},"examples":[{"en":"The sauce had an acid-like tang that made it taste sharp.","zh":"这个酱汁有一种酸一样的刺激酸味，让味道很尖锐。"},{"en":"Wear gloves when handling the acid-like liquid because it can damage skin.","zh":"处理这种类似酸的液体时要戴手套，因为它可能伤害皮肤。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Bitter, cutting, or harsh in tone—like an “acid” remark.","zh":"（比喻）尖刻的、刻薄的、辛辣的（像“酸性”的评论）。"},"examples":[{"en":"His acid-like comments made the meeting uncomfortable.","zh":"他尖刻的评论让会议气氛很尴尬。"},{"en":"Try to give feedback without that acid-like edge.","zh":"尽量在给反馈时不要带那种尖酸的语气。"}]}],"synonyms":["acidic","sour","corrosive","caustic","biting"],"phonetic":"/ˈæsɪd.laɪk/","extraExplanation":["“acid-like”是由 acid + like 构成的复合形容词，常用连字符（hyphen）来表示它作为一个整体修饰名词：an acid-like smell / an acid-like solution。","在科学语境里，它常描述“酸性特征”（酸味、腐蚀性、低 pH 等）；在日常写作里也常用作比喻，表示言语“刻薄、刺人”。"]}
{"word":"acid-loving","summary":{"en":"Acid-loving describes plants that prefer acidic (low-pH) soil.","zh":"acid-loving指“喜酸的”，多形容偏爱酸性（低pH）土壤的植物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a plant) growing best in acidic soil (low pH), and often doing poorly in neutral or alkaline soil.","zh":"（植物）喜酸的；在酸性土壤（pH较低）中生长最好，在中性或碱性土壤中常表现较差。"},"examples":[{"en":"Blueberries are acid-loving plants, so they need soil with a low pH.","zh":"蓝莓是喜酸植物，所以需要pH较低的土壤。"},{"en":"If your garden soil is alkaline, choose acid-loving shrubs like azaleas.","zh":"如果你的花园土壤偏碱，可以选择杜鹃这类喜酸灌木。"},{"en":"The leaves may turn yellow when an acid-loving plant is planted in the wrong soil.","zh":"喜酸植物如果种在不合适的土壤里，叶子可能会发黄。"}]}],"synonyms":["acidophilic","lime-hating"],"phonetic":"/ˈæsɪd ˌlʌvɪŋ/","extraExplanation":["“acid-loving”多用于园艺与植物学语境，通常与“acidic soil（酸性土壤）”“soil pH（土壤酸碱度）”一起出现。常见的喜酸植物包括蓝莓（blueberry）、杜鹃/映山红（azalea）、山茶（camellia）、栀子（gardenia）、石南（heather）等。","园艺中常把这类植物称为“ericaceous plants（杜鹃花科/石南类喜酸植物）”。如果土壤偏碱，园丁可能会用松针、泥炭藓（peat moss）或硫（sulfur）等材料来帮助降低pH，但具体做法要结合当地土壤与植物需求。"]}
{"word":"acid-producing","summary":{"en":"“Acid-producing” means producing acid or causing acid to form.","zh":"“acid-producing”表示“产酸的；会生成酸的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of food, bacteria, or processes) producing acid; causing acid to be formed.","zh":"（指食物、细菌或过程）产酸的；会生成酸的。"},"examples":[{"en":"Some bacteria in the mouth are acid-producing and can contribute to tooth decay.","zh":"口腔里有些细菌是产酸的，可能会导致蛀牙。"},{"en":"The report calls the fermentation step acid-producing, which lowers the pH.","zh":"报告称发酵这一步是产酸的，会降低 pH 值。"},{"en":"The diet plan recommends limiting highly acid-producing foods if you have frequent heartburn.","zh":"如果你经常胃灼热，这个饮食计划建议减少高产酸食物。"}]}],"synonyms":["acid-forming","acid-generating"],"phonetic":"/ˈæsɪd prəˈdusɪŋ/","extraExplanation":["这个词常见于医学、牙科与营养学语境：例如“acid-producing bacteria（产酸菌）”“acid-producing foods（产酸食物）”。在营养学里，有时会讨论食物对体内“酸/碱负荷（acid/alkaline load）”的影响，但不同体系的说法和证据强弱不一；学习时可先把它理解为“会产生酸”的中性描述。","构词法：acid（酸）+ producing（产生……的）。类似结构还有：“heat-producing（产热的）”“gas-producing（产气的）”。"]}
{"word":"acid-proteolytic","summary":{"en":"Acid-proteolytic means able to break down proteins in acidic conditions.","zh":"acid-proteolytic 指“在酸性条件下能分解蛋白质的；酸性蛋白水解的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Technical) Describing something that breaks down proteins (proteolytic) under acidic conditions or in an acidic environment.","zh":"（专业）形容在酸性条件下/酸性环境中具有分解蛋白质能力的；酸性蛋白水解的。"},"examples":[{"en":"Pepsin is an acid-proteolytic enzyme found in the stomach.","zh":"胃蛋白酶是一种存在于胃中的酸性蛋白水解酶。"},{"en":"The researchers measured acid-proteolytic activity at pH 2 to mimic stomach conditions.","zh":"研究人员在 pH 2 下测量酸性蛋白水解活性，以模拟胃内环境。"}]}],"synonyms":["acidic proteolytic","acid protease-related","protein-digesting (in acid)"],"phonetic":"/ˌæsɪd ˌproʊtiəˈlɪtɪk/","extraExplanation":["这个词多见于生物化学、食品科学与医学语境，用来强调“蛋白水解（proteolytic）发生在酸性条件下”。常见对比说法是“alkaline-proteolytic（碱性蛋白水解的）”。","在实验或产品说明里，acid-proteolytic 常与 pH 值、酶活性（activity）、消化过程（digestion）等一起出现。"]}
{"word":"acid-rain","summary":{"en":"Harmful precipitation made acidic by air pollution.","zh":"由空气污染导致呈酸性的有害降水。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Rain (or other precipitation) made harmful because it contains acids formed when air pollution (especially sulfur dioxide and nitrogen oxides) reacts with water in the atmosphere.","zh":"酸雨；因空气污染物（尤其二氧化硫、氮氧化物）在大气中与水反应生成酸性物质而导致的有害降水。"},"examples":[{"en":"Acid rain can damage forests and make lakes too acidic for fish.","zh":"酸雨会破坏森林，并使湖泊酸性过强而不利于鱼类生存。"},{"en":"Factories reduced emissions to help prevent acid rain.","zh":"工厂减少排放以帮助防止酸雨。"}]}],"synonyms":["acid precipitation","acid deposition"],"phonetic":"/ˈæsɪd reɪn/","extraExplanation":["酸雨不一定“摸起来很酸”，它更多是用 pH 值来衡量（pH 越低越酸）。","常见来源是燃煤电厂、工业和汽车排放的 SO₂ 与 NOₓ，它们在空气中转化为硫酸/硝酸，随雨雪、雾或干沉降落到地面。","相关搭配：acid rain damage（酸雨危害）、acid deposition（酸性沉降）、emissions controls（排放控制）。"],"etymology":"由 acid（酸的）+ rain（雨）构成的复合词；作为环境科学术语在20世纪逐渐普及，用来描述由工业排放引起的酸性降水现象。","mnemonic":["把它拆开记：acid=酸，rain=雨，合起来就是“酸的雨”。","联想中文“酸雨”两字：看到 acid 就想到“酸”，rain 就想到“雨”，一一对应。"]}
{"word":"acid-resistant","summary":{"en":"Acid-resistant describes something that can withstand acid without being damaged.","zh":"acid-resistant 指“耐酸的”，能在酸的作用下不易受损或被腐蚀。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to resist damage, corrosion, or chemical reaction caused by acid.","zh":"耐酸的；能抵抗酸造成的腐蚀或化学反应的。"},"examples":[{"en":"The lab uses acid-resistant gloves when handling strong acids.","zh":"实验室在处理强酸时会使用耐酸手套。"},{"en":"Choose an acid-resistant container for storing vinegar or other acidic liquids.","zh":"存放醋或其他酸性液体时，要选择耐酸容器。"},{"en":"The pipes are made of acid-resistant steel to prevent corrosion.","zh":"这些管道用耐酸钢制造，以防止腐蚀。"}]}],"synonyms":["acidproof","corrosion-resistant (to acids)","chemical-resistant (to acids)"],"phonetic":"/ˌæsɪd rɪˈzɪstənt/","extraExplanation":["“acid- + resistant”是常见的复合形容词结构，用来说明材料或物品能“抵抗某种东西”的影响：如 heat-resistant（耐热的）、water-resistant（防水/耐水的）、shock-resistant（抗震的）。","注意区分：water-resistant 通常表示“能在一定程度上防水”，不等于完全 waterproof（完全防水）。同理，acid-resistant 也常表示“在特定浓度/条件下耐酸”，不一定对所有强酸或所有条件都安全。实际使用要看产品说明（例如可耐受的酸种类、浓度、温度与时间）。"]}
{"word":"acid-secreting","summary":{"en":"“Acid-secreting” describes something (especially cells or glands) that produces and releases acid.","zh":"“acid-secreting”指（尤指细胞或腺体）能够产生并分泌酸的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Producing and releasing acid (usually used to describe glands, cells, or tissues in the body).","zh":"分泌酸的；产生并释放酸性物质的（常用于描述人体的腺体、细胞或组织）。"},"examples":[{"en":"The stomach has acid-secreting cells that help digest food.","zh":"胃里有分泌胃酸的细胞，帮助消化食物。"},{"en":"Acid-secreting glands protect the body by breaking down harmful microbes.","zh":"分泌酸的腺体能通过分解有害微生物来保护身体。"}]}],"synonyms":["acid-producing","acid-releasing","acid-forming"],"phonetic":"/ˈæsɪd səˈkriːtɪŋ/","extraExplanation":["“acid-secreting”是由“acid + secreting”组成的复合形容词，常见于生物学与医学写作，通常用连字符来修饰名词（如 acid-secreting cells/glands）。在更正式的学术表达中，也可写作“acid secreting”（不加连字符），但放在名词前作定语时加连字符更清晰。"]}
{"word":"acid-stable","summary":{"en":"“Acid-stable” means resistant to acids and able to remain unchanged in acidic conditions.","zh":"“acid-stable”表示“耐酸的”，能在酸性环境中保持稳定、不易被破坏。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to resist damage or change when exposed to acid; not easily broken down by acidic conditions.","zh":"耐酸的；在酸性环境中不易被腐蚀、破坏或分解的。"},"examples":[{"en":"These gloves are acid-stable and safe for handling diluted sulfuric acid.","zh":"这副手套耐酸，适合处理稀释的硫酸。"},{"en":"Researchers designed an acid-stable coating to protect the metal surface.","zh":"研究人员设计了一种耐酸涂层来保护金属表面。"},{"en":"The tablet uses an acid-stable layer so the medicine can pass through the stomach.","zh":"这片药有耐酸层，能通过胃部而不被胃酸分解。"}]}],"synonyms":["acid-resistant","acidproof","acid-tolerant","corrosion-resistant (in acidic conditions)"],"phonetic":"/ˈæsɪd ˌsteɪbəl/","extraExplanation":["“acid-stable”常见于化学、材料科学、生物化学与制药语境：例如酸稳定（acid-stable）的酶、聚合物涂层、耐酸容器或“肠溶/耐胃酸”药物外层。","拼写上常用连字符（acid-stable）作定语：an acid-stable enzyme / acid-stable materials；作表语也可用：The coating is acid-stable。"]}
{"word":"acid-tolerant","summary":{"en":"“Acid-tolerant” means able to survive or function well in acidic (low pH) conditions.","zh":"“acid-tolerant”指能在酸性（低 pH）环境中仍能存活或正常发挥作用的（耐酸的）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to survive, grow, or work normally in acidic conditions (low pH).","zh":"（生物/材料等）耐酸的；能在酸性环境（低 pH）下存活、生长或正常发挥作用的。"},"examples":[{"en":"Some crops are acid-tolerant and can grow in soils with low pH.","zh":"有些作物耐酸，能在低 pH 的土壤中生长。"},{"en":"Researchers looked for acid-tolerant bacteria to help clean polluted water.","zh":"研究人员寻找耐酸细菌来帮助净化受污染的水。"},{"en":"This coating makes the metal more acid-tolerant.","zh":"这种涂层让金属更耐酸。"}]}],"synonyms":["acid-resistant","acid-hardy","low-pH tolerant"],"phonetic":"/ˌæsɪd ˈtɑlɚənt/","extraExplanation":["这是由形容词“acid（酸）”+“tolerant（能忍受/耐受）”组合而成的复合形容词，常见于生物学、农业、环境科学与材料领域。","常与具体对象搭配：acid-tolerant plants（耐酸植物）、acid-tolerant microbes/bacteria（耐酸微生物/细菌）、acid-tolerant materials/coatings（耐酸材料/涂层）。也常与“acid-sensitive（对酸敏感的）”形成对比。","在科学写作里，“acid-tolerant”通常指在较低 pH 条件下仍能维持生理功能或稳定性；并不一定表示“完全不受酸影响”，而是“相对更能适应/耐受”。"]}
{"word":"acid-tongued","summary":{"en":"Acid-tongued means speaking in a harsh, cutting, often sarcastic way that can hurt others.","zh":"acid-tongued 指说话尖刻刻薄，常带讽刺，容易伤人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a person or their comments) harsh, cutting, or sarcastic in a way that is meant to criticize or hurt.","zh":"（形容人或其言语）尖刻的、刻薄的、带讽刺伤人的。"},"examples":[{"en":"The journalist is known for her acid-tongued reviews of bad movies.","zh":"那位记者以对烂片的尖刻影评而出名。"},{"en":"His acid-tongued remark embarrassed her in front of everyone.","zh":"他那句刻薄的话让她在众人面前很难堪。"},{"en":"Try not to be acid-tongued when giving feedback—be specific and kind.","zh":"给反馈时尽量别刻薄——要具体，也要友善。"}]}],"synonyms":["sharp-tongued","cutting","biting","caustic","acerbic"],"phonetic":"/ˌæsɪd ˈtʌŋd/","extraExplanation":["“acid-”在这里不是指化学里的“酸”，而是比喻“像酸一样会腐蚀/灼伤”，强调语言的伤害性和攻击性。","这个词常用于描写人物性格或说话风格（如评论家、同事、亲戚之间的对话），语气往往带有批评、嘲讽或轻蔑。","近义表达有“sharp-tongued / cutting / biting / caustic”。其中“caustic”更偏正式；“acid-tongued”更形象、文学描写中也常见。"]}
{"word":"acid-treated","summary":{"en":"“Acid-treated” describes something that has been processed with acid to clean, change, or preserve it.","zh":"“acid-treated”指“经过酸处理的”，用于说明某物被酸加工/处理以清洁、改变性质或保鲜等。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"processed with acid (a chemical treatment) to clean, etch, dissolve impurities, or change the surface/structure of a material.","zh":"经过酸处理的（用酸进行化学处理，以清洁、蚀刻、去除杂质或改变材料表面/结构）。"},"examples":[{"en":"Acid-treated steel often has a cleaner surface for painting.","zh":"酸处理过的钢材通常表面更干净，更适合上漆。"},{"en":"The lab compared untreated fabric with acid-treated fabric to see how the color changed.","zh":"实验室比较了未处理的布料和酸处理过的布料，看看颜色如何变化。"}]},{"partOfSpeech":"adj.","definition":{"en":"(In some contexts) food or agricultural products treated with acid to adjust acidity, preserve, or prepare them for further processing.","zh":"（某些语境中）用酸处理过的食品或农产品（用于调节酸度、保鲜或为后续加工做准备）。"},"examples":[{"en":"The company uses acid-treated juice to keep the pH stable.","zh":"公司使用酸处理过的果汁来保持 pH 稳定。"},{"en":"Some acid-treated ingredients must be labeled clearly for safety.","zh":"某些酸处理配料出于安全原因必须清楚标示。"}]}],"synonyms":["acid-processed","acid-washed","acid-etched","acid-pickled (metal)","acidified (food/liquid)"],"phonetic":"/ˈæsɪd ˌtriːtɪd/","extraExplanation":["“acid-treated”是由“acid + treated”构成的复合形容词，常用连字符修饰名词（acid-treated surface / acid-treated water）。放在名词后作表语时也可不加连字符：The surface is acid treated（但带连字符更常见、更清晰）。","具体用的是哪种酸（如盐酸、硫酸、柠檬酸等）以及处理目的，通常需要在专业文本中进一步说明；在安全或法规语境中也可能涉及标识与防护要求。"]}
{"word":"acid-washed","summary":{"en":"“Acid-washed” describes clothing (often denim) that has been chemically washed to look faded and mottled, creating a retro, worn-in style.","zh":"“acid-washed”指（多为牛仔）衣物经过化学洗涤处理而呈现褪色斑驳的做旧效果，常带复古风格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Especially of clothing, usually denim) treated with acid or bleach to create a faded, mottled, “washed-out” look.","zh":"（尤指衣物，常见于牛仔布）用酸或漂白剂处理，使颜色褪淡、呈斑驳“洗旧/做旧”的效果。"},"examples":[{"en":"She wore acid-washed jeans with a simple white T-shirt.","zh":"她穿着酸洗牛仔裤，搭配一件简单的白T恤。"},{"en":"Acid-washed denim was especially popular in the 1980s.","zh":"酸洗牛仔布在20世纪80年代特别流行。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made to look worn, older, or distressed through a chemical washing process (often describing a style).","zh":"通过化学洗涤工艺制造出“旧旧的/磨损感”的风格（常用来描述一种款式或审美）。"},"examples":[{"en":"The brand sells acid-washed jackets for a retro streetwear vibe.","zh":"这个品牌卖酸洗夹克，营造复古街头风。"},{"en":"He prefers acid-washed finishes because they look more casual.","zh":"他更喜欢酸洗效果，因为看起来更休闲。"}]}],"synonyms":["stonewashed","bleached","faded","distressed"],"phonetic":"/ˈæsɪd wɑʃt/","extraExplanation":["“acid-washed”最常和denim（牛仔布）连用，写法通常带连字符：acid-washed jeans/jacket。口语里也常说acid wash（名词）或acid-wash（形容词/作定语）。","这种工艺并不一定真的用强酸；很多时候是用漂白剂（如氯漂）或类似化学处理来达到“褪色斑驳”的视觉效果。时尚语境里常带有“80年代/复古”的文化联想。"]}
{"word":"acidaemia","summary":{"en":"Acidaemia is a medical term meaning too much acid in the blood.","zh":"Acidaemia（酸血症）是医学术语，指血液中酸性物质过多。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abnormally high level of acid in the blood (a medical condition).","zh":"血液中酸性物质异常增高（医学状况）。"},"examples":[{"en":"The lab results suggested mild acidaemia, so the doctor ordered more tests.","zh":"化验结果提示轻度酸血症，因此医生安排了进一步检查。"},{"en":"Severe acidaemia can affect the heart and breathing.","zh":"严重的酸血症会影响心脏和呼吸。"}]}],"synonyms":["acidemia","blood acidosis (general)","acidosis (related term)"],"phonetic":"/ˌæsɪˈdiːmiə/","extraExplanation":["“acidaemia”是英式拼写；美式更常写作“acidemia”。两者意思相同，都是指血液酸度过高（pH下降）。","在临床语境里常与“acidosis（酸中毒/酸中毒状态）”一起出现：acidaemia更偏向描述“血液检查显示酸增加”的结果；acidosis更强调“由酸碱失衡导致的一组生理状态/过程”。"]}
{"word":"Acidalian","summary":{"en":"A poetic word meaning “of Venus” or “of love,” and sometimes a poetic name for Venus herself.","zh":"一个诗歌/文学用词，意为“与维纳斯或爱情有关”，有时也用作维纳斯本人的诗意别称。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(poetic, literary) Relating to Venus (Aphrodite) or to love and desire.","zh":"（诗歌/文学用语）与维纳斯（阿佛洛狄忒）有关的；与爱情、情欲有关的。"},"examples":[{"en":"In the poem, the Acidalian goddess blesses the lovers’ meeting.","zh":"在诗中，“Acidalian 女神”祝福恋人的相会。"},{"en":"He writes of Acidalian charms and roses, a classic image of Venus.","zh":"他写到“Acidalian 的魅力与玫瑰”，这是维纳斯的经典意象。"}]},{"partOfSpeech":"n.","definition":{"en":"(poetic, rare) Venus herself; an epithet (poetic name) for the goddess of love.","zh":"（诗歌用语，少见）指维纳斯本人；爱神的一个诗意别称。"},"examples":[{"en":"The poet invokes Acidalian to soften the hearts of men.","zh":"诗人祈求 Acidalian 使人心柔软。"}]}],"synonyms":["Venusian","Venerean","Aphrodisian","amorous"],"phonetic":"ˌæsɪˈdeɪliən","extraExplanation":["“Acidalian”源自古典神话地名 Acidalia（阿西达利亚），常被认为是与维纳斯/阿佛洛狄忒有关的泉水或地点（如“Acidalian fountain”）。因此它在英语里多出现在诗歌、古典题材或华丽文风中，用来指“与维纳斯、爱情、欲望有关”。","阅读时可把它当作“Venus-related / love-related”的文学化形容词；在现代日常英语中几乎不用。"]}
{"word":"Acidalium","summary":{"en":"“Acidalium” is a rare poetic term meaning “Acidalian,” often used as a mythological epithet for Venus.","zh":"“Acidalium”是罕见的诗体词，意为“阿西达利亚的/维纳斯式的”，常作维纳斯的神话性别称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a rare, poetic word meaning “Acidalian,” especially used as an epithet for Venus (the goddess of love), referring to the spring or region called Acidalia in Greek mythology.","zh":"罕见的诗体用词，意为“阿西达利亚的/与阿西达利亚有关的”，尤指作为爱神维纳斯（Venus）的称号之一，源自希腊神话中的阿西达利亚泉或地区。"},"examples":[{"en":"In older poetry, “Acidalium” can appear as a decorative name for Venus.","zh":"在较早的诗歌里，“Acidalium”有时会作为维纳斯的华丽别称出现。"},{"en":"The poet calls her “Acidalium” to suggest love, beauty, and charm.","zh":"诗人用“Acidalium”称呼她，以暗示爱情、美与魅力。"}]}],"synonyms":["Acidalian","(epithet) Venus"],"phonetic":"/ˌæsɪˈdeɪliəm/","extraExplanation":["“Acidalium”常被理解为拉丁化/诗体变体，和更常见的“Acidalian”同源。它来自“Acidalia”，古典传统里与维纳斯相关：传说中维纳斯与美惠三女神（Graces）在阿西达利亚泉沐浴，因此“Acidalian/Acidalium”就带上了“爱情、迷人、维纳斯气质”的文学联想。","因为非常少见，在现代英语里通常不会用来日常表达；如果你是在文学或古典文本里看到它，多半是在借古典神话做意象。更常见的相关词/写法包括：Acidalia, Acidalian, Venus (the Acidalian goddess)."]}
{"word":"Acidanthera","summary":{"en":"Acidanthera is a fragrant, white-flowered plant often sold as “Abyssinian gladiolus,” now usually classified under the genus Gladiolus.","zh":"Acidanthera常指带香味、白色花的“阿比西尼亚剑兰”，现代多归入剑兰属（Gladiolus）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flowering plant (a genus name formerly used for a type of gladiolus) known for its sweet fragrance and star-shaped white flowers; often sold as “Abyssinian gladiolus.”","zh":"一种开花植物（旧属名），常指“香雪兰剑兰/阿比西尼亚剑兰”，以香味浓、白色星形花著称。"},"examples":[{"en":"I planted acidanthera bulbs in spring, and they bloomed in late summer.","zh":"我在春天种了Acidanthera的球茎，到了夏末就开花了。"},{"en":"Acidanthera is popular in gardens because it smells sweet at night.","zh":"Acidanthera在花园里很受欢迎，因为它在夜晚会散发甜香。"}]}],"synonyms":["Abyssinian gladiolus","Gladiolus murielae"],"phonetic":"/ˌæsɪdænˈθɪrə/","extraExplanation":["在园艺与花市里，“acidanthera”常作为俗名使用，最常指过去叫 Acidanthera 的那种剑兰；现代植物分类里多归入 Gladiolus（剑兰属），常见商品名为 Gladiolus murielae。","词源上来自希腊语：acid-（尖、锐）+ anthera（花药），与其花部结构有关。"]}
{"word":"acidanthera","summary":{"en":"Acidanthera is a fragrant flowering plant commonly sold as a type of gladiolus (Abyssinian gladiolus).","zh":"Acidanthera指一种芳香开花植物，园艺上常作为剑兰的一种出售（阿比西尼亚剑兰/芳香剑兰）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fragrant flowering plant (now usually classified as a type of gladiolus), traditionally known as Acidanthera; often called the Abyssinian gladiolus.","zh":"一种芳香的开花植物（如今多归为剑兰属的一种），传统上称为Acidanthera；常见名为“阿比西尼亚剑兰/芳香剑兰”。"},"examples":[{"en":"I planted acidanthera bulbs in spring for late-summer blooms.","zh":"我在春天种下acidanthera的球茎，期待夏末开花。"},{"en":"Acidanthera is prized for its white flowers and sweet scent.","zh":"acidanthera因洁白的花朵和甜香而受人喜爱。"}]}],"synonyms":["Abyssinian gladiolus","fragrant gladiolus","Gladiolus murielae","Acidanthera bicolor"],"phonetic":"/ˌæsɪˈdænθərə/","extraExplanation":["在园艺和植物学资料里，Acidanthera常被视为旧属名；你可能更常见到它以Gladiolus murielae或Acidanthera bicolor的形式出现（同一种或非常接近的分类）。","词源上常解释为来自希腊语成分：acid-（“尖、锐”之意）+ anther（“花药”），指其花部结构特征。"]}
{"word":"Acidaspis","summary":{"en":"Acidaspis is a spiny genus of extinct trilobites, often mentioned in fossils and paleontology.","zh":"Acidaspis 指一种带刺的已灭绝三叶虫属，常见于化石与古生物学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of extinct trilobites (marine arthropods) known for prominent spines; often used to refer to these spiny trilobite fossils in general.","zh":"一种已灭绝的三叶虫属（海洋节肢动物），以明显的尖刺著称；也常用来泛指这类“带刺三叶虫”的化石。"},"examples":[{"en":"The museum displayed an Acidaspis fossil with long spines along its body.","zh":"博物馆展出了一块 Acidaspis（三叶虫属）化石，身体两侧有很长的尖刺。"},{"en":"Collectors value Acidaspis specimens because their spiny shapes are dramatic and easy to recognize.","zh":"收藏者很重视 Acidaspis 标本，因为它们带刺的形态很醒目，也容易辨认。"}]}],"synonyms":["trilobite (general term)"],"phonetic":"/ˌæsɪˈdæspɪs/","extraExplanation":["词源：来自希腊语成分 acida-（可理解为“尖/刺”）+ aspis（“盾”）。因此这个名字大致有“带刺的盾”的感觉，和它们突出的防御性棘刺外形相呼应。","使用场景：该词主要出现在古生物学、地质学、化石收藏与博物馆说明文字中；日常英语里非常少见。","写法提示：属名按生物学命名习惯首字母大写（Acidaspis）；若用作更宽泛的普通名词指“这类化石”，在非严格学术语境中也可能见到小写 acidaspis。"]}
{"word":"acidaspis","summary":{"en":"Acidaspis is the name of an extinct genus of spiny trilobites known from Paleozoic fossils.","zh":"Acidaspis 指一种已灭绝的、带刺的三叶虫属名，常见于古生代化石记录中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of extinct, spiny trilobites (marine arthropods) known from Paleozoic fossils.","zh":"（古生物）刺状的三叶虫属名；一种已灭绝的海生节肢动物，见于古生代化石。"},"examples":[{"en":"The museum displayed an Acidaspis fossil with long defensive spines.","zh":"博物馆展出了一块带有长防御刺的 Acidaspis（三叶虫）化石。"},{"en":"Acidaspis lived on the seafloor hundreds of millions of years ago.","zh":"Acidaspis 在数亿年前生活在海底。"}]}],"synonyms":["(no common everyday synonyms; sometimes described as) spiny trilobite"],"phonetic":"ˌæsɪˈdæspɪs","extraExplanation":["“Acidaspis”是拉丁化的属名，常见于古生物学与地质学写作中；在英文里通常作为专有名词使用，首字母大写（Acidaspis）。","这类三叶虫以身体两侧和背部显著的“刺”而著名，常被解释为防御捕食者或适应海底环境的特征。","学习时可把它当作“某一种/某一属三叶虫的名字”，用法类似于恐龙属名如 Tyrannosaurus。"]}
{"word":"acidemia","summary":{"en":"Acidemia is an abnormally acidic condition of the blood (low blood pH).","zh":"Acidemia 指血液异常偏酸（血液 pH 过低）的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical condition in which the blood becomes too acidic (has a lower-than-normal pH).","zh":"（医学）酸血症：血液酸度过高（pH 低于正常）的状态。"},"examples":[{"en":"The lab results suggested acidemia, so the doctor checked the patient’s blood pH immediately.","zh":"化验结果提示可能有酸血症，所以医生立刻检查了患者的血液 pH。"},{"en":"Severe acidemia can affect breathing and heart function.","zh":"严重的酸血症可能影响呼吸和心脏功能。"}]}],"synonyms":["low blood pH","increased blood acidity"],"phonetic":"/ˌæsəˈdiːmiə/","extraExplanation":["“acidemia”由“acid（酸）+ -emia（血液状态）”构成，常用在医学语境中。","它描述的是“血液变酸”的结果；常见相关概念有“acidosis（酸中毒/酸中毒状态）”，后者更强调导致酸血症的代谢或呼吸过程。"]}
{"word":"acidemias","summary":{"en":"“Acidemias” means cases/types of acidemia—blood that is abnormally acidic (low pH).","zh":"“Acidemias”指酸血症的多种情况/类型，即血液 pH 异常偏低、酸性过高。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of acidemia) a medical condition in which the blood is too acidic (has a low pH).","zh":"（acidemia 的复数）酸血症：指血液酸性过高（pH 值偏低）的一种医学状况。"},"examples":[{"en":"The lab results suggested acidemias related to severe respiratory failure.","zh":"化验结果提示这些酸血症与严重的呼吸衰竭有关。"},{"en":"Doctors treated the patient’s acidemias by addressing the underlying cause, not just the pH.","zh":"医生通过处理根本原因而不仅仅是纠正 pH 来治疗患者的酸血症。"}]}],"synonyms":["low blood pH","acidemia (singular)","acidosis (related term)"],"phonetic":"/ˌæsəˈdiːmiə/","extraExplanation":["“acidemia”常与“acidosis（酸中毒/酸中毒状态）”一起出现：acidemia更强调“血液中的pH确实偏低（检测结果）”，acidosis更强调“导致血液变酸的生理过程/机制”。","临床上常见类型包括：metabolic acidemia（代谢性酸血症）与 respiratory acidemia（呼吸性酸血症）。日常英语里更常说“acidemia”（单数）来指一种情况；“acidemias”多见于医学论文或教材，用来泛指多种酸血症情况。"]}
{"word":"acider","summary":{"en":"“Acider” is a rare comparative form meaning “more acidic.” Prefer “more acidic” or “acidier.”","zh":"“acider”表示“更酸/更具酸性”，但不常用；更推荐“more acidic”或“acidier”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative form meaning “more acidic” (having a sharper, sour taste or stronger acid quality). In standard English, this is usually written as “more acidic” or “acidier.”","zh":"比较级，表示“更酸 / 更具酸性”。在标准英语中通常写作“more acidic”或“acidier”，“acider”较少见。"},"examples":[{"en":"This sauce tastes more acidic than the one we had yesterday.","zh":"这款酱汁尝起来比我们昨天吃的更酸。"},{"en":"Lemon juice is acidier (more acidic) than orange juice.","zh":"柠檬汁比橙汁更酸（更具酸性）。"}]}],"synonyms":["more acidic","acidier","sourer (taste)"],"phonetic":"ˈæsɪdər","extraExplanation":["“acider”在实际写作中不常用，很多读者会觉得不自然或像拼写错误。更推荐用“more acidic”（更正式、常见）或“acidier”（更口语、强调味道的酸）。","注意区分：acetic（醋酸的）是另一种词；acidic（酸性的）是最常用的形容词。"]}
{"word":"acidhead","summary":{"en":"“Acidhead” is a slang noun for someone who uses LSD or is linked to psychedelic drug culture.","zh":"“Acidhead”是俚语名词，指使用LSD的人，或与迷幻药文化相关的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang) A person who frequently uses LSD (“acid”) or is strongly associated with psychedelic drug culture.","zh":"（俚语）经常使用迷幻剂LSD（俗称“acid”）的人；或与迷幻药文化密切相关的人。"},"examples":[{"en":"In the 1960s, some people called him an acidhead because he was always talking about LSD trips.","zh":"在20世纪60年代，有些人叫他“acidhead”，因为他总是在谈LSD的“旅行”（trip）。"},{"en":"The film shows a group of acidheads at a psychedelic music festival.","zh":"这部电影展示了一群在迷幻音乐节上的“acidhead”。"}]}],"synonyms":["LSD user","psychedelic user","drug user (broader)"],"phonetic":"ˈæsɪdˌhɛd","extraExplanation":["“Acid”在这里指LSD（麦角酸二乙胺），而不是日常所说的“酸/酸性物质”。“Acidhead”多见于20世纪60—70年代的美国反主流文化语境，带有强烈的时代与亚文化色彩。","语气通常偏口语、带评价色彩：可能是调侃、贬义，也可能是圈内自嘲/自称。正式写作中更常用“LSD user”或更中性的表述。"]}
{"word":"acidheads","summary":{"en":"“Acidheads” is a slang term for people who use LSD or are linked to psychedelic drug culture.","zh":"“acidheads”是指使用 LSD 或与迷幻药文化相关的人（俚语，常带标签化色彩）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, often informal or dated) People who use LSD (“acid”), or who are strongly associated with psychedelic drug culture.","zh":"（俚语，常为非正式或较旧用法）使用 LSD（“acid/迷幻酸”）的人；或与迷幻药文化密切相关的人。"},"examples":[{"en":"In the 1960s, some newspapers used “acidheads” to describe young people experimenting with LSD.","zh":"在20世纪60年代，一些报纸用“acidheads”来形容尝试 LSD 的年轻人。"},{"en":"The film portrays a group of acidheads traveling to a music festival.","zh":"这部电影描绘了一群“acidheads”去音乐节旅行。"}]}],"synonyms":["LSD users","psychedelic users","trippers (informal)"],"phonetic":"/ˈæsɪdˌhɛdz/","extraExplanation":["“acidhead(s)”由“acid”（指 LSD 的俚语）+“head”（口语中表示“沉迷/热衷于……的人”，如“pothead”“deadhead”）构成。","这个词带有标签化甚至贬义色彩，常见于媒体报道或回忆性的语境；更中性的说法可用“people who use LSD / LSD users”。","涉及毒品话题在不同文化与场合可能敏感；在正式写作中建议避免使用该词或注明其俚语性质。"]}
{"word":"acidic","summary":{"en":"Acidic means sour or having acid-like properties; it can also describe a sharp, cutting tone in speech.","zh":"acidic 表示“酸性的/酸的”，也可形容说话“尖刻、刻薄”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the properties of an acid; sour in taste or able to react like an acid (e.g., lemon juice, vinegar).","zh":"酸性的；具有酸的性质（如味道酸，或在化学反应中表现为酸，例如柠檬汁、醋）。"},"examples":[{"en":"Lemon juice is very acidic.","zh":"柠檬汁非常酸。"},{"en":"Acidic foods can bother some people’s stomachs.","zh":"酸性食物可能会让一些人胃不舒服。"}]},{"partOfSpeech":"adj.","definition":{"en":"Harsh, bitter, or cutting in tone; unfriendly in the way someone speaks or writes.","zh":"（语气/言辞）尖刻的；刻薄的；不友善的。"},"examples":[{"en":"He made an acidic comment about her work.","zh":"他对她的工作发表了尖刻的评论。"},{"en":"Her reply sounded acidic, even though she said she was fine.","zh":"她的回复听起来很刻薄，尽管她说自己没事。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to a body condition with too much acid, such as acid reflux or an acidic environment (e.g., soil or water).","zh":"与酸过多的状态有关（如胃酸反流）；或指环境呈酸性（如酸性土壤/水体）。"},"examples":[{"en":"He avoids coffee because it can worsen his acid reflux and make his stomach feel acidic.","zh":"他避免喝咖啡，因为这会加重胃酸反流，让胃里更“酸”。"},{"en":"Blueberries often grow well in acidic soil.","zh":"蓝莓常常在酸性土壤中长得很好。"}]}],"synonyms":["sour","sharp","biting","caustic","tart"],"phonetic":"/əˈsɪdɪk/","extraExplanation":["“acidic”最常见的字面意思是“酸的/酸性的”（味觉或化学性质）。用于形容“语气”时，带有比“rude（粗鲁）”更“刺、刻薄、带嘲讽”的感觉，常见搭配：acidic remark/comment/tone（尖刻的言辞/评论/语气）。","注意区分：acid（名词/形容词：酸；酸的） vs. acidic（形容词：酸性的，更偏“具有酸的性质”）。比如：an acid taste（酸味）/ an acidic drink（酸性饮料）。"]}
{"word":"acidic juices from the stomach","summary":{"en":"acid-containing stomach fluid used for digestion","zh":"用于消化的含酸胃液"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"the acid-containing liquid produced in the stomach that helps digest food","zh":"胃里分泌、含酸的液体，用来帮助消化食物"},"examples":[{"en":"Acidic juices from the stomach help break down protein.","zh":"胃里的酸性胃液有助于分解蛋白质。"},{"en":"When acidic juices from the stomach move up into the throat, it can cause heartburn.","zh":"当胃里的酸性液体反流到喉咙时，可能会引起胃灼热（烧心）。"}]}],"synonyms":["stomach acid","gastric juice","gastric acid"],"phonetic":"/ˈæsɪdɪk ˈdʒusɪz frəm ðə ˈstʌmək/","extraExplanation":["在日常英语中，医生或科普文章更常写：stomach acid（更口语，强调“酸”）/ gastric juice（更偏医学，强调“胃液”整体成分）。","和“acid reflux（胃酸反流）”“heartburn（烧心）”常一起出现：acidic stomach contents（胃内容物，含酸）往上返流会刺激食管。"],"etymology":"这是一个描述性短语：acidic（“酸性的”）+ juices（“液体/汁液”，医学语境可指“分泌液”）+ from the stomach（“来自胃”）。在医学表达里更常用的单词是 gastric juice（胃液）或 stomach acid（胃酸）。","mnemonic":["把它拆开记：acid（酸）+ -ic（…的）→ acidic（酸性的）；juice 不只是“果汁”，也可理解为“体液/分泌液”。","联想中文：胃里“酸酸的液体”= 胃酸/胃液；看到 from the stomach 就锁定“来自胃”的分泌物。"]}
{"word":"acidic oxide","summary":{"en":"an oxide that forms an acid in water or reacts like an acid","zh":"与水生成酸或呈酸性反应特征的氧化物"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"An oxide (a compound of oxygen with another element) that forms an acid when it reacts with water, or that shows acidic behavior in reactions (for example, reacting with bases to form salts).","zh":"酸性氧化物：一种氧化物（氧与其他元素形成的化合物），与水反应会生成酸，或在反应中表现出酸性（如与碱反应生成盐）。"},"examples":[{"en":"Carbon dioxide is an acidic oxide because it forms carbonic acid in water.","zh":"二氧化碳是酸性氧化物，因为它在水中会生成碳酸。"},{"en":"Sulfur dioxide, an acidic oxide, can contribute to acid rain after reacting in the atmosphere.","zh":"二氧化硫是一种酸性氧化物，在大气中发生反应后可能导致酸雨。"},{"en":"Acidic oxides often react with bases to produce salts and water.","zh":"酸性氧化物常与碱反应生成盐和水。"}]}],"synonyms":["acid anhydride","nonmetal oxide"],"phonetic":"/əˈsɪdɪk ˈɑkˌsaɪd/","extraExplanation":["常见例子多为非金属氧化物：CO₂、SO₂、SO₃、P₄O₁₀、N₂O₅ 等。它们与水反应往往生成相应含氧酸，例如 SO₃ + H₂O → H₂SO₄。","并非所有非金属氧化物都明显“酸性”（如 CO、NO 较中性），而一些金属氧化物可能呈两性（如 Al₂O₃、ZnO），所以判断时看反应性质更可靠。","在较高级的化学语境里，“acidic oxide”常与“acid anhydride（酸酐）”相近，但两者不总是完全等同；学习阶段可先把它理解为“能生成酸/表现酸性”的氧化物。"],"etymology":"源自 chemistry 术语：acidic（“呈酸性的”）+ oxide（“氧化物”）。该搭配用来按“酸碱性行为”给氧化物分类，常与 basic oxide（碱性氧化物）、amphoteric oxide（两性氧化物）对照使用。","mnemonic":["把它拆开记：acid-（酸）+ -ic（…的）→ acidic（酸性的）；oxide（氧化物）→ “酸性的氧化物”。","联想“加水变酸”：酸性氧化物 + 水 → 酸（比如 CO₂ + H₂O → H₂CO₃）。"]}
{"word":"acidier","summary":{"en":"“Acidier” means more sour in taste (or, less commonly, more biting in tone).","zh":"“acidier”表示更酸（较少见：语气更尖刻）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a more sour or sharp taste; more like acid than before (comparative form of “acidy”).","zh":"（比较级）更酸的；更有酸味/尖锐酸感的（“acidy”的比较级）。"},"examples":[{"en":"This lemonade is acidier than yesterday’s batch, so add a little more sugar.","zh":"这杯柠檬水比昨天那一批更酸，所以再加一点糖。"},{"en":"The sauce turned acidier after it sat in the fridge overnight.","zh":"这酱汁在冰箱里放了一夜后变得更酸了。"}]},{"partOfSpeech":"adj.","definition":{"en":"More sharp or biting in tone; more likely to sound critical or harsh (less common).","zh":"（语气）更尖刻的；更刻薄/更带刺的（较不常用）。"},"examples":[{"en":"Her comments grew acidier as the meeting dragged on.","zh":"会议拖得越久，她的评论就越尖刻。"},{"en":"Try to disagree without becoming acidier or personal.","zh":"尽量在不同意时不要变得更刻薄或人身攻击。"}]}],"synonyms":["more sour","tarter","more acidic","sharper","more biting"],"phonetic":"/əˈsɪdiər/","extraExplanation":["“acidier”来自形容词“acidy”（有酸味的、带酸感的），按英语拼写规则：以辅音字母+y结尾时，比较级常把y变成i再加-er（acidy → acidier）。","日常写作中更常见的是用“more acidic”（更酸/更具酸性的）来描述食物或化学性质；“acidy/acidier”更偏口语，强调“尝起来酸”。","用来形容语气时，“acidic/acidier”常带“尖刻、讽刺”的含义，注意语境以免显得过于强烈。"]}
{"word":"acidiferous","summary":{"en":"Acidiferous means “acid-producing or acid-containing,” used mostly in scientific writing.","zh":"acidiferous 指“产酸的或含酸的”，主要用于科学/学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Producing, containing, or yielding acid; acid-forming.","zh":"产酸的；含酸的；能生成酸的。"},"examples":[{"en":"Some bacteria are acidiferous, turning sugars into acids during fermentation.","zh":"有些细菌是产酸的，会在发酵过程中把糖转化成酸。"},{"en":"The report noted acidiferous compounds that could lower the pH of the solution.","zh":"报告指出，这些含酸（或能生成酸）的化合物可能会降低溶液的 pH 值。"}]}],"synonyms":["acid-producing","acid-forming","acidic"],"phonetic":"/ˌæsɪˈdɪfərəs/","extraExplanation":["“acidiferous”较为罕见，多见于化学、地质、生物等学术语境。词源可拆为 acid（酸）+ -ferous（“带有/产生”，源自拉丁语 ferre“携带、产生”），因此整体意思就是“带酸的/产酸的”。日常英语里更常用 acid-producing 或 acidic 来表达类似含义。"]}
{"word":"acidifiable","summary":{"en":"“Acidifiable” means able to be made acidic, especially in scientific contexts.","zh":"“acidifiable”指“可被酸化的”，多用于科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Capable of being made acidic (having acid added or pH lowered).","zh":"可被酸化的；能够变酸（可通过加入酸或降低 pH 变得更酸）。"},"examples":[{"en":"Some soils are easily acidifiable after repeated use of ammonium fertilizers.","zh":"一些土壤在反复使用铵态肥料后很容易被酸化。"},{"en":"The solution is acidifiable, so add the reagent slowly and monitor the pH.","zh":"该溶液可被酸化，因此要缓慢加入试剂并监测 pH。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Able to behave as or form an acid under certain conditions (e.g., by donating a proton).","zh":"（化学）在特定条件下能表现为酸或形成酸性物质（例如可供给质子）。"},"examples":[{"en":"In water, the compound shows acidifiable behavior at high concentrations.","zh":"在水中，该化合物在高浓度下表现出可形成酸性的特征。"},{"en":"Researchers tested whether the group was acidifiable in different solvents.","zh":"研究人员测试了该基团在不同溶剂中是否可呈酸性。"}]}],"synonyms":["acidifiable (formal)","able to be acidified","pH-lowerable (technical)"],"phonetic":"/əˈsɪdɪˌfaɪəbl/","extraExplanation":["“acidifiable”由“acidify（使酸化）+ -able（可……的）”构成，多见于化学、环境科学与农业土壤学等语境。","日常英语里更常说“can be acidified（可以被酸化）”，而“acidifiable”显得更学术、更书面。"]}
{"word":"acidifiant","summary":{"en":"Acidifiant means an acidifying substance (or something that makes things more acidic), often in food or chemistry.","zh":"Acidifiant 指酸化剂（或具有酸化作用的东西），常见于食品或化学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(food/chemistry) A substance added to make something more acidic; an acidifying agent.","zh":"（食品/化学）使某物酸度增加的物质；酸化剂。"},"examples":[{"en":"Citric acid is used as an acidifiant in many soft drinks.","zh":"柠檬酸常作为酸化剂用于许多汽水中。"},{"en":"The recipe calls for an acidifiant to balance the sweetness.","zh":"这个配方需要加入酸化剂来平衡甜味。"}]},{"partOfSpeech":"adj.","definition":{"en":"Causing something to become more acidic; acidifying.","zh":"使变酸的；酸化的。"},"examples":[{"en":"An acidifiant effect can slow the growth of some bacteria.","zh":"酸化作用可以减缓某些细菌的生长。"},{"en":"They tested the acidifiant properties of the additive.","zh":"他们测试了该添加剂的酸化特性。"}]}],"synonyms":["acidifying agent","acidulant","acidifier"],"phonetic":"/əˈsɪdɪˌfaɪ.ənt/","extraExplanation":["“acidifiant”在英语里不算常用词，更常见的说法是“acidifying agent”（酸化剂）或直接说“acidulant”（食用酸味剂/酸度调节剂）。在食品标签或技术文件中偶尔能看到“acidifiant”，多受法语影响。"]}
{"word":"acidific","summary":{"en":"Acidific means “acidifying”—making something more acidic.","zh":"acidific 表示“酸化的”，指使某物酸性增强。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Making something more acidic; having the effect of adding acid or increasing acidity.","zh":"使（某物）酸性增强的；有酸化作用的。"},"examples":[{"en":"Carbon dioxide can have an acidific effect on seawater.","zh":"二氧化碳会对海水产生酸化作用。"},{"en":"The lab used an acidific solution to lower the pH.","zh":"实验室使用酸化溶液来降低 pH 值。"}]}],"synonyms":["acidifying","acid-forming"],"phonetic":"/ˌæsɪˈdɪfɪk/","extraExplanation":["“acidific”在现代英语中相对少见，更常见的对应形式是动词“acidify（使酸化）”和名词“acidification（酸化）”。在科学写作（尤其是环境、化学语境）里，有时会看到“acidific effect/agent（酸化作用/酸化剂）”这样的搭配。","词源上与拉丁语 acidus（酸的）相关；后缀“-fic/-fic(ation)”带有“造成、使成为”的含义，因此整体表达“使变酸/使酸化”。"]}
{"word":"acidification","summary":{"en":"Acidification is the process of becoming more acidic or making something more acidic, often discussed in environmental science (e.g., ocean acidification).","zh":"Acidification 指（使）变得更酸、pH 值降低的过程，常用于环境科学语境（如海洋酸化）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of becoming more acidic (having a lower pH), or of making something more acidic","zh":"酸化；（使）变得更酸的过程（pH 值降低）"},"examples":[{"en":"Ocean acidification happens when seawater absorbs extra carbon dioxide from the air.","zh":"海洋酸化发生在海水从空气中吸收额外二氧化碳时。"},{"en":"Acidification of the soil can make it harder for some plants to grow.","zh":"土壤酸化会让某些植物更难生长。"},{"en":"The study measured acidification in lakes near industrial areas.","zh":"这项研究测量了工业区附近湖泊的酸化情况。"}]}],"synonyms":["acidifying","acidification process","increasing acidity"],"phonetic":"/əˌsɪdəfɪˈkeɪʃən/","extraExplanation":["“acidification”常见于环境与化学语境，尤其是“ocean acidification（海洋酸化）”。它通常指 pH 值下降，但不一定意味着液体真的变成“酸（acid）”，而是“更酸（more acidic）”。","常见搭配：acidification of the ocean/soil/lakes（海洋/土壤/湖泊的酸化）；cause/drive acidification（导致/推动酸化）；reduce/slow acidification（减少/减缓酸化）。"]}
{"word":"acidified","summary":{"en":"Acidified means “made more acidic,” often by adding an acid (like vinegar or lemon juice).","zh":"Acidified 意为“被酸化的/酸度增加的”，通常指加入酸（如醋或柠檬汁）使 pH 降低。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"made more acidic; having acid added so the pH becomes lower","zh":"被酸化的；加入酸使酸度增加（pH降低）的"},"examples":[{"en":"Acidified milk is used to make some cheeses and yogurt-style products.","zh":"酸化牛奶常用来制作某些奶酪和酸奶类产品。"},{"en":"The lab prepared an acidified solution before adding the metal sample.","zh":"实验室在加入金属样品前先配制了酸化溶液。"}]},{"partOfSpeech":"v.","definition":{"en":"past form of “acidify”: to make something more acidic","zh":"“acidify”的过去式/过去分词：使……酸化；使酸度增加"},"examples":[{"en":"They acidified the water slightly to prevent bacterial growth.","zh":"他们把水稍微酸化，以抑制细菌生长。"},{"en":"The mixture was acidified with vinegar before cooking.","zh":"烹饪前用醋把混合物酸化了。"}]}],"synonyms":["acidic (often weaker/less precise)","soured (food-related, not always by adding acid)","treated with acid"],"phonetic":"/əˈsɪdəˌfaɪd/","extraExplanation":["在食品与烹饪中，acidified 常指“通过加入酸（如醋、柠檬汁或乳酸）来降低 pH”。这常用于改善风味、帮助凝固（如奶酪制作）、或提高保存性与食品安全（抑制部分微生物）。","在科学语境里，acidified solution/acidified water 常表示“用酸调到某个酸度范围”的溶液，常见搭配有 acidified with hydrochloric acid（用盐酸酸化）、acidified to pH 2（酸化到 pH 2）。"]}
{"word":"acidifier","summary":{"en":"An acidifier is something that makes a material more acidic (lowers pH).","zh":"acidifier 指使某物更酸、降低pH值的装置或物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device or substance that makes something more acidic (lowers its pH), especially water, air, or soil","zh":"酸化器；酸化剂（使某物更酸、降低pH值的装置或物质，常用于水、空气或土壤）"},"examples":[{"en":"The humidifier has an acidifier to prevent bacteria from growing.","zh":"这台加湿器带有酸化装置，用来抑制细菌滋生。"},{"en":"Farmers may use an acidifier to adjust soil pH for certain crops.","zh":"农民可能会使用酸化剂来调节土壤酸碱度，以适应某些作物。"}]}],"synonyms":["acidifying agent","acidulant","pH adjuster"],"phonetic":"/əˈsɪdɪˌfaɪɚ/","extraExplanation":["“acidifier”多见于技术/产品语境（如水处理、加湿器、农业、食品加工）。词形结构是 acid（酸）+ -ify（使……化）+ -er（……的人/物），字面意思就是“使变酸的东西”。","在食品领域里，acidifier 常指“酸味剂/酸度调节剂”（如柠檬酸等），用于调味或抑菌；在环境与工业领域里，则更常指调节pH的化学品或设备。实际含义要看上下文。"]}
{"word":"acidifiers","summary":{"en":"Acidifiers are substances or products used to make something more acidic (lower pH), commonly in foods, gardening, and water/industrial processes.","zh":"acidifiers 指酸化剂/酸度调节剂，用来降低 pH、让某物更酸，常见于食品、园艺以及水处理或工业过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A substance (often a food additive) used to make something more acidic (to lower its pH).","zh":"酸化剂；用于让某物更酸、降低 pH 值的物质（常见于食品添加剂）。"},"examples":[{"en":"Citric acid and lactic acid are common acidifiers in drinks and candy.","zh":"柠檬酸和乳酸是饮料和糖果里常见的酸化剂。"},{"en":"Manufacturers add acidifiers to balance flavor and improve shelf life.","zh":"生产商会加入酸化剂来平衡风味并延长保质期。"}]},{"partOfSpeech":"n.","definition":{"en":"A product used to acidify soil, water, or industrial solutions.","zh":"（用于土壤、水或工业溶液的）酸化产品；使其更酸的制剂。"},"examples":[{"en":"The gardener used soil acidifiers to help blueberries grow better.","zh":"园丁使用土壤酸化剂来帮助蓝莓生长得更好。"},{"en":"In water treatment, acidifiers can adjust pH to a target range.","zh":"在水处理过程中，酸化剂可以把 pH 调整到目标范围。"}]}],"synonyms":["acidifying agents","acidulants (food)","pH reducers"],"phonetic":"/əˈsɪdɪˌfaɪɚz/","extraExplanation":["在食品语境中，acidifiers 常指“食品酸度调节剂/酸味剂”，既影响酸味口感，也会影响微生物生长与保存性。常见例子有 citric acid（柠檬酸）、malic acid（苹果酸）、phosphoric acid（磷酸，常见于可乐类饮料）。"]}
{"word":"acidifies","summary":{"en":"“Acidifies” means “makes something more acidic” or “becomes more acidic.”","zh":"“acidifies”表示“使……更酸/酸化”或“变得更酸/酸化”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make something more acidic (to lower its pH), or to become more acidic","zh":"使……酸化（降低pH 值）；（自身）变得更酸"},"examples":[{"en":"Pollution can acidify lakes and harm fish.","zh":"污染会使湖泊酸化，并伤害鱼类。"},{"en":"Carbon dioxide dissolving in seawater acidifies the ocean.","zh":"二氧化碳溶解在海水中会使海洋酸化。"}]},{"partOfSpeech":"v.","definition":{"en":"(chemistry) to add acid to a substance so it reacts or changes","zh":"（化学）向某物加入酸，使其发生反应或改变"},"examples":[{"en":"The technician acidifies the solution before testing it.","zh":"技术员在检测前先把溶液酸化。"},{"en":"Acidifying the mixture helps separate the compounds.","zh":"将混合物酸化有助于分离化合物。"}]}],"synonyms":["makes more acidic","lowers the pH (of)","sours"],"phonetic":"/əˈsɪdɪˌfaɪz/","extraExplanation":["“acidifies”是动词“acidify”的第三人称单数现在时（he/she/it acidifies）。常见搭配：acidify the soil（土壤酸化）、acidify the ocean（海洋酸化）、acidify a solution（使溶液酸化）。","在环境语境中常见的名词形式是“ocean acidification（海洋酸化）”，多指海水吸收过量二氧化碳后pH下降的现象。"]}
{"word":"acidify","summary":{"en":"Acidify means to make something more acidic, or to become more acidic.","zh":"acidify 指“使……酸化”或“变得更酸（酸度上升、pH 降低）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To make something more acidic (to lower its pH), often by adding an acid or increasing acid levels.","zh":"使（某物）酸化；提高酸度（降低 pH），常指加入酸或增加酸性物质。"},"examples":[{"en":"Add a little lemon juice to acidify the sauce.","zh":"加一点柠檬汁把酱汁酸化。"},{"en":"Some bacteria can acidify milk during fermentation.","zh":"有些细菌会在发酵过程中使牛奶酸化。"},{"en":"Pollution can acidify lakes and harm fish.","zh":"污染会使湖泊酸化并伤害鱼类。"}]},{"partOfSpeech":"vi.","definition":{"en":"To become more acidic.","zh":"变得更酸；酸度上升（pH 降低）。"},"examples":[{"en":"As carbon dioxide dissolves in seawater, the water acidifies.","zh":"当二氧化碳溶解到海水中时，海水会酸化。"},{"en":"Over time, the soil can acidify if too much ammonium fertilizer is used.","zh":"如果铵态肥用得过多，土壤久而久之会酸化。"}]}],"synonyms":["make acidic","increase acidity","sour (in some contexts)","acidulate"],"phonetic":"/əˈsɪdəˌfaɪ/","extraExplanation":["在环境议题中常见搭配：ocean acidification（海洋酸化）、soil acidification（土壤酸化）。注意这里的“酸化”是化学意义上的 pH 降低，不一定表示“变酸味”。","词形关联：acid（酸；酸性的）→ acidic（酸性的）→ acidify（使……酸化）→ acidification（酸化过程/现象）。"]}
{"word":"acidifying","summary":{"en":"“Acidifying” means becoming acidic or making something more acidic (lowering pH).","zh":"“acidifying”表示正在变酸或使某物酸化（降低 pH）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"becoming more acidic; making something more acidic (having a lower pH)","zh":"正在变酸的；使……酸化的（pH 降低）"},"examples":[{"en":"Acidifying rain can damage forests and lakes.","zh":"酸化的雨水会破坏森林和湖泊。"},{"en":"The acidifying process changed the flavor of the mixture.","zh":"酸化过程改变了混合物的味道。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of making something more acidic; present participle of “acidify”","zh":"使……酸化的行为或过程；“acidify”的现在分词"},"examples":[{"en":"Scientists are studying the acidifying of the oceans.","zh":"科学家正在研究海洋的酸化。"},{"en":"Adding vinegar is acidifying the sauce.","zh":"加入醋正在使酱汁变酸。"}]}],"synonyms":["acidic","acidifying (process)","souring","acidulation"],"phonetic":"əˈsɪdəˌfaɪɪŋ","extraExplanation":["“acidifying/acidification（酸化）”在环境话题中很常见，尤其是“ocean acidification（海洋酸化）”：大气中的二氧化碳溶入海水后会形成碳酸，使海水 pH 下降，从而影响珊瑚和贝类等生物。","在烹饪与食品加工中，acidifying 常指用柠檬汁、醋等让食物更酸，以帮助调味、抑菌或改变质地。"]}
{"word":"acidimeter","summary":{"en":"An acidimeter is a device for measuring how acidic a liquid is, often by measuring acid concentration.","zh":"acidimeter 指测量液体酸度的仪器，常用于测定酸的浓度（如滴定酸）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An instrument used to measure the acidity of a liquid, usually by testing acid concentration (often with a titration method).","zh":"酸度计；测酸仪：用于测量液体酸度的仪器，通常通过测定酸的浓度（常用滴定法）。"},"examples":[{"en":"The lab technician used an acidimeter to check the acidity of the vinegar.","zh":"实验室技术员用酸度计来检测醋的酸度。"},{"en":"In wine making, an acidimeter can help monitor acid levels during fermentation.","zh":"在酿酒过程中，测酸仪可以帮助监测发酵期间的酸含量。"}]}],"synonyms":["acidity meter","acid tester","titrator (in some lab contexts)"],"phonetic":"/ˌæsɪˈdɪmɪtɚ/","extraExplanation":["这个词多见于化学、食品与饮料（如葡萄酒、醋）或工业检测语境。现代日常更常见的相关工具是 pH meter（pH 计），但 acidimeter 往往强调“测酸含量/酸度（尤其是可滴定酸）”，而不只是测 pH 值。"]}
{"word":"acidimetric","summary":{"en":"“Acidimetric” means “related to measuring acidity,” especially by titration in chemistry.","zh":"“acidimetric”指“与酸度测定有关的”，尤其是在化学中用滴定法测量酸的浓度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to acidimetry—the measurement of acidity (acid concentration), often by titration.","zh":"与酸度测定（acidimetry）有关的；指测量酸度（酸的浓度），常用滴定法进行。"},"examples":[{"en":"The lab report describes an acidimetric titration using sodium hydroxide.","zh":"实验报告描述了一次使用氢氧化钠的酸量滴定（酸度测定滴定）。"},{"en":"Acidimetric methods are common in basic analytical chemistry courses.","zh":"酸度测定方法在基础分析化学课程中很常见。"}]}],"synonyms":["acidimetric (titration)","acidimetric analysis","acidity-measuring"],"phonetic":"/ˌæsɪdɪˈmɛtrɪk/","extraExplanation":["“acidimetric”多见于化学与实验室语境，日常英语很少用。它通常修饰名词，如 acidimetric titration（酸量滴定）/ acidimetric analysis（酸度测定分析）。","词源结构：acid（酸）+ -i- + metric（测量的）。与之对应的相关词有 alkalimetric（碱量滴定，测量碱的浓度）。"]}
{"word":"acidimetrical","summary":{"en":"“Acidimetrical” means related to measuring acids or acidity, especially using titration.","zh":"“acidimetrical”表示与测量酸或酸度有关（尤指滴定法），属化学用语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to acidimetry (the measurement of acidity, especially by titration).","zh":"与酸量测定（acidimetry，尤指用滴定法测量酸度或酸含量）有关的；酸量测定的。"},"examples":[{"en":"The lab report included an acidimetrical titration to determine the concentration of hydrochloric acid.","zh":"实验报告包含一次酸量滴定，用来测定盐酸的浓度。"},{"en":"Acidimetrical methods are common in quality control for food and pharmaceuticals.","zh":"酸量测定方法在食品和制药的质量控制中很常见。"}]}],"synonyms":["acidimetric","acidimetric (titration-related)","analytical (chemistry, broad)"],"phonetic":"/ˌæsɪdɪˈmɛtrɪkəl/","extraExplanation":["“acidimetrical”是较少见的形容词，更多时候会看到“acidimetric”（更常用）来表达同样的意思。","词源结构：acid-（酸）+ -metric/-metrical（测量的）。在化学语境中常与“titration（滴定）”“endpoint（终点）”“indicator（指示剂）”等词搭配出现。"]}
{"word":"acidimetrically","summary":{"en":"“Acidimetrically” means “by acidimetry,” i.e., using a method (often titration) to measure how much acid is present.","zh":"“acidimetrically”意为“用酸量法（常为滴定法）来测定酸的含量/浓度地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to acidimetry (measuring the amount or concentration of an acid, usually by titration).","zh":"以酸量法（酸度测定法）的方式；与酸量测定（通常用滴定法测定酸的含量或浓度）有关地。"},"examples":[{"en":"The sample was analyzed acidimetrically to determine its acid concentration.","zh":"该样品用酸量法进行分析，以确定其酸的浓度。"},{"en":"Acidimetrically measured results were recorded after each titration.","zh":"每次滴定后都记录用酸量法测得的结果。"}]}],"synonyms":["by acidimetry","via acidimetric titration","acidimetry-based"],"phonetic":"/ˌæsɪdɪˈmɛtrɪkli/","extraExplanation":["“acidimetrically”多见于化学/分析化学的学术写作与实验报告中，日常英语几乎不用。","acidimetry（酸量法）常指用标准碱溶液滴定未知酸溶液来计算酸的浓度；与之相对的是 alkalimetry（碱量法），用标准酸滴定未知碱。","构词：acid + -metric（测量的）+ -ally（以……方式）。理解后缀 -metr-（measure）有助于记忆相关词，如 “volumetrically（以容量分析法地）”。"]}
{"word":"acidimetry","summary":{"en":"Acidimetry means measuring how much acid is in a solution, typically using a titration method.","zh":"acidimetry 指测量溶液中酸的含量（酸度），通常用滴定法进行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The measurement of the amount (concentration) of acid in a solution, usually by titration with a standard base.","zh":"酸度测定；测量溶液中酸的含量（浓度），通常通过用标准碱进行滴定来完成。"},"examples":[{"en":"In the lab, students learned acidimetry by titrating hydrochloric acid with a standard sodium hydroxide solution.","zh":"在实验室里，学生通过用标准氢氧化钠溶液滴定盐酸来学习酸度测定。"},{"en":"Acidimetry is commonly used to check the acidity of industrial samples before processing.","zh":"酸度测定常用于在加工前检查工业样品的酸性程度。"}]}],"synonyms":["acid titration","acid assay","determination of acidity"],"phonetic":"/ˌæsəˈdɪmətri/","extraExplanation":["acidimetry 常见于分析化学与质量控制（如制药、食品、化工）。典型方法是“酸碱滴定”：用已知浓度的碱滴定未知酸，通过指示剂变色或 pH 计判断终点，从而计算酸的浓度。","相关对称概念是 alkalimetry（碱度测定）：测量溶液中碱的含量，通常用标准酸来滴定。"]}
{"word":"acidimetry-based","summary":{"en":"“Acidimetry-based” means based on acidimetry—methods that measure acidity or acid amount, often by titration.","zh":"“Acidimetry-based”指“以酸度测定法为基础的”，即用（常见为滴定等）方法测量酸度或酸含量。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Using, relying on, or designed around acidimetry (measuring acidity or the amount of acid, often by titration).","zh":"以酸度测定法（acidimetry，常用滴定来测量酸度或酸的含量）为基础的；依赖酸度测定的。"},"examples":[{"en":"The lab developed an acidimetry-based method to measure the acid content in vinegar.","zh":"实验室开发了一种基于酸度测定法的方法来测量醋中的酸含量。"},{"en":"Acidimetry-based testing is common in quality control for food and pharmaceuticals.","zh":"在食品和制药的质量控制中，基于酸度测定法的检测很常见。"}]}],"synonyms":["titration-based","acid titration-based","acidimetric","acid determination-based"],"phonetic":"/ˌæsɪˈdɪmɪtri beɪst/","extraExplanation":["“Acidimetry”通常指用标准碱溶液滴定来测定酸的含量（与“alkalimetry”相对，后者用标准酸滴定来测定碱）。因此“acidimetry-based”多见于分析化学/检测方法学写作，强调“该方法的核心原理是酸碱滴定或酸度定量”。","写作中它常作定语放在名词前：acidimetry-based assay/method/approach/test（基于酸度测定的测定/方法/方案/测试）。也可改写为“based on acidimetry”以更口语、更易读。"]}
{"word":"acidite","summary":{"en":"“Acidite” is usually a misspelling; the common English word is “acidity,” meaning the level of acid or a sour/bright taste.","zh":"“acidite”多半是拼写误写；常见英文是“acidity”，表示酸度/酸性程度，或食物饮品中清爽（或偏酸）的酸味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the amount or level of acid in something; how acidic it is (in chemistry, food/drink, soil, etc.)","zh":"酸度；酸性强弱（指某物中酸的含量或酸性程度，如化学、食物饮料、土壤等）"},"examples":[{"en":"The acidity of the coffee was too high for her, so she added milk.","zh":"这杯咖啡的酸度对她来说太高了，所以她加了牛奶。"},{"en":"Scientists measured the lake’s acidity after the chemical spill.","zh":"化学品泄漏后，科学家测量了湖水的酸度。"},{"en":"Soil acidity can affect how well crops grow.","zh":"土壤酸度会影响农作物的生长情况。"}]},{"partOfSpeech":"n.","definition":{"en":"a sour taste or sharp “bite” in food and drink (especially wine, fruit, coffee, etc.)","zh":"（食物或饮品的）酸味；尖锐的“酸劲儿”（常用于葡萄酒、水果、咖啡等）"},"examples":[{"en":"The wine has bright acidity and a clean finish.","zh":"这款葡萄酒酸度明亮，收口干净。"},{"en":"Lemon juice adds acidity that balances the richness of the sauce.","zh":"柠檬汁带来酸味，能平衡酱汁的浓郁。"}]}],"synonyms":["acidity","sourness","tartness","sharpness"],"phonetic":"/əˈsɪdəti/","extraExplanation":["“acidite”在英语里不常见；你更可能想写的是“acidity”。“Acidité”是法语“酸度/酸性”的拼写。","在科学里酸度常用 pH 来表示：pH 越低，酸性越强（酸度越高）。在日常品鉴（咖啡/葡萄酒）中，“acidity”通常是偏正面的描述，指清爽、明亮的酸感，不等同于“sour（酸得难喝）”。"]}
{"word":"acidities","summary":{"en":"“Acidities” is the plural of “acidity,” meaning different kinds or levels of acidity; it can also refer to sour/low-pH quality or, figuratively, a sharp tone.","zh":"“acidities”是“acidity”的复数，指不同种类或不同程度的酸度；也可泛指酸性/酸味，或比喻语气尖刻。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being acidic (having a sour taste or a low pH)","zh":"酸性；酸度（指味道发酸或 pH 值较低的性质）"},"examples":[{"en":"Lemon juice has a high acidity.","zh":"柠檬汁的酸度很高。"},{"en":"The doctor asked about stomach acidity after meals.","zh":"医生询问了饭后胃酸（胃酸度）的情况。"}]},{"partOfSpeech":"n.","definition":{"en":"different kinds or degrees of acidity in something (used especially in food, wine, soil, or water contexts)","zh":"（复数）不同类型或不同程度的酸度（常用于食物、葡萄酒、土壤或水质等语境）"},"examples":[{"en":"Winemakers monitor acidities during fermentation to keep flavors balanced.","zh":"酿酒师会在发酵过程中监测不同的酸度，以保持风味平衡。"},{"en":"The report compared the acidities of several lakes over ten years.","zh":"报告比较了多个湖泊在十年间的酸度变化。"}]},{"partOfSpeech":"n.","definition":{"en":"a sharp, biting quality in someone’s tone or writing (figurative)","zh":"（比喻）尖刻；刻薄（指语气或文字带刺）"},"examples":[{"en":"There was acidity in his comments, even when he tried to be polite.","zh":"即使他努力保持礼貌，他的话里仍带着几分尖刻。"},{"en":"The review’s acidity made the author feel attacked.","zh":"那篇评论的尖刻语气让作者感到被攻击。"}]}],"synonyms":["sourness","tartness","sharpness","bitterness","acidity level"],"phonetic":"əˈsɪdəti","extraExplanation":["“acidities”是“acidity”的复数形式，常见于更专业的语境（如葡萄酒品鉴、食品科学、土壤/水质检测），强调“多种酸”或“不同酸度水平”（例如酒中的酒石酸、苹果酸等带来的不同口感）。","在日常口语里，人们更常用单数“acidity”来泛指“酸度/酸性”；复数“acidities”更像是在做比较、分类或数据分析。"]}
{"word":"acidity","summary":{"en":"Acidity most commonly means the level of acid (sourness/low pH), and it can also refer to stomach acid discomfort or a sharp, biting tone.","zh":"Acidity最常指酸性程度（酸味/低pH），也可指胃酸不适，或比喻尖刻刻薄的语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or level of being acidic (having a sour taste or a low pH)","zh":"酸性；酸度（指酸味或酸碱度低，即 pH 值低的性质/程度）"},"examples":[{"en":"The acidity of lemon juice makes it taste sharp and sour.","zh":"柠檬汁的酸度让它尝起来又尖锐又酸。"},{"en":"Winemakers measure acidity to balance the flavor of the wine.","zh":"酿酒师会测量酸度来平衡葡萄酒的风味。"}]},{"partOfSpeech":"n.","definition":{"en":"a medical condition involving too much acid in the stomach or body (often causing burning discomfort)","zh":"（医学）胃酸过多；胃酸（过高）引起的不适（常见为烧灼感）"},"examples":[{"en":"Spicy food sometimes gives me acidity at night.","zh":"辛辣食物有时会让我晚上胃酸不适。"},{"en":"If you have frequent acidity, talk to a doctor.","zh":"如果你经常胃酸不适，建议咨询医生。"}]},{"partOfSpeech":"n.","definition":{"en":"a harsh, bitter, or critical tone in speech or writing","zh":"（语气/文字）尖刻；刻薄；讽刺味"},"examples":[{"en":"There was a hint of acidity in his reply.","zh":"他的回复里带着一丝尖刻。"},{"en":"She criticized the plan without acidity, focusing on facts.","zh":"她批评这个计划时并不刻薄，而是着重事实。"}]}],"synonyms":["sourness","acid level","acidness","sharpness (tone)","bitterness (tone)"],"phonetic":"/əˈsɪdəti/","extraExplanation":["“acidity”在饮食语境中常指“酸度/酸味的强弱”，在化学语境中更偏向“pH值相关的酸性程度”。","在一些英语地区的日常口语里，人们也会用“acidity”说“胃酸/胃酸反流带来的不适”，但在更标准或医学场景也常见“acid reflux / heartburn”等表达。","比喻用法里的“acidity”指说话“带刺、刻薄”，类似中文的“酸”“尖酸刻薄”，但更偏“讥讽、苛刻的语气”。"]}
{"word":"acidity-measuring","summary":{"en":"Acidity-measuring describes tools or methods used to measure acidity (pH).","zh":"acidity-measuring 指用于测量酸度（pH）的工具或方法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Used to describe something that measures how acidic a substance is (often by testing pH).","zh":"用于描述“测量酸度/酸性程度”的（常通过检测 pH）。"},"examples":[{"en":"The lab uses an acidity-measuring device to check the pH of soil samples.","zh":"实验室使用酸度测量装置来检测土壤样本的 pH。"},{"en":"She bought acidity-measuring strips for her aquarium water.","zh":"她买了酸度测试试纸来测量鱼缸水的酸性。"}]}],"synonyms":["pH-measuring","pH-testing","acid-measuring"],"phonetic":"/əˈsɪdəti ˈmɛʒɚɪŋ/","extraExplanation":["“acidity-measuring”是带连字符的复合形容词，常出现在科技/说明书语境中，用来修饰名词（如 acidity-measuring device/strip/meter）。更口语、更常见的表达通常是 “pH-measuring” 或 “pH-testing”。","相关背景：酸度通常用 pH 值表示；pH 越低表示越酸。常见的测量工具包括 pH 计（pH meter）、pH 试纸（test strips / litmus paper）。"]}
{"word":"acidize","summary":{"en":"Acidize means to make something acidic or to treat it with acid, mainly in technical contexts.","zh":"Acidize 指使某物酸化或用酸处理，主要用于技术语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something acidic; to increase the acidity of something","zh":"使……酸化；增加……的酸度"},"examples":[{"en":"Factories must not acidize the river with untreated waste.","zh":"工厂不得用未经处理的废弃物使河流酸化。"},{"en":"The chemist acidized the solution to help the reaction proceed.","zh":"化学家把溶液酸化以帮助反应进行。"}]},{"partOfSpeech":"vt.","definition":{"en":"(technical) to treat something with acid, especially during an industrial or chemical process","zh":"（技术用语）用酸处理（尤指工业或化学过程中的处理）"},"examples":[{"en":"The metal surface is acidized before it is painted.","zh":"金属表面在喷漆前会先进行酸处理。"},{"en":"Some papers are acidized during manufacturing, which can make them yellow over time.","zh":"有些纸张在制造过程中会被酸处理，久了可能会变黄。"}]}],"synonyms":["acidify","make acidic","treat with acid"],"phonetic":"/ˈæsəˌdaɪz/","extraExplanation":["“acidize”多见于化学、工业与环境领域的技术语境，日常英语里更常用“acidify”（使酸化）。","词尾“-ize”表示“使成为……/使具有……性质”（如 modernize 使现代化、sterilize 使无菌）。因此 acidize 字面意思就是“使变酸/用酸处理”。"]}
{"word":"acidized","summary":{"en":"“Acidized” means treated with acid or made more acidic.","zh":"“acidized”指“经过酸处理的；被酸化的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"treated with acid (chemically changed or processed by adding acid), often to clean, etch, or adjust a material","zh":"经酸处理的；被加酸加工过的（常用于清洗、蚀刻或改变材料性质）"},"examples":[{"en":"The metal surface was acidized to remove rust before painting.","zh":"金属表面先进行了酸处理以去除锈迹，然后再上漆。"},{"en":"Acidized water can be corrosive, so it must be handled carefully.","zh":"酸化的水可能具有腐蚀性，所以必须小心处理。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “acidize”: to treat something with acid","zh":"acidize 的过去式/过去分词：用酸处理；使酸化"},"examples":[{"en":"They acidized the solution to reach the correct pH.","zh":"他们把溶液酸化，使其达到合适的 pH 值。"}]}],"synonyms":["acidified","acid-treated","acid-washed","pickled (metal)"],"phonetic":"/ˈæsəˌdaɪzd/","extraExplanation":["“acidized”在日常英语里不如“acidified”（酸化的）或“pickled”（酸洗的）常见，更偏工业/技术语境。不同领域会用不同常用词：例如化学里常说acidified，金属加工里常说acid-cleaned/acid-etched或pickled。","拼写上，“acidize”是美式更常见的动词形式之一（与acidise为英式拼写对应）。"]}
{"word":"acidizing","summary":{"en":"Acidizing is an oil-and-gas well treatment where acid is pumped into a well to dissolve material and improve flow.","zh":"Acidizing 指油气井的酸化处理：向井内注入酸液溶解堵塞物/岩石，以改善流动并提高产能。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of pumping acid into an oil or gas well to dissolve rock or damage near the wellbore and improve flow","zh":"（油气工程）酸化作业：向油井/气井注入酸液，溶解岩石或近井地带堵塞物，从而提高渗透性与产能的过程"},"examples":[{"en":"The operator scheduled acidizing to increase the well’s production rate.","zh":"运营方安排了酸化作业以提高油井的产量。"},{"en":"Acidizing can remove scale and other blockages near the wellbore.","zh":"酸化可以清除井筒附近的结垢和其他堵塞物。"}]},{"partOfSpeech":"v.","definition":{"en":"the act of treating a well or formation with acid (used as a gerund/present participle of “acidize”)","zh":"（作为动名词/现在分词）对井筒或地层进行酸处理（源自动词 acidize）"},"examples":[{"en":"They are acidizing the formation to restore permeability.","zh":"他们正在对地层进行酸化以恢复渗透性。"}]}],"synonyms":["acid treatment","well acid treatment","matrix acidizing","acid stimulation"],"phonetic":"/ˈæsəˌdaɪzɪŋ/","extraExplanation":["“Acidizing”多见于石油与天然气行业文件与现场沟通中，属于一种井刺激（well stimulation）方法。常见酸液包括盐酸（HCl），在碳酸盐岩地层中用于溶蚀形成更通畅的流动通道。","语境上常与“matrix acidizing（基质酸化）”和“acid fracturing（酸压裂/酸化压裂）”搭配；前者通常在不压裂或轻微压裂条件下改善近井地带，后者则在压裂过程中利用酸液刻蚀裂缝面以提高导流能力。","该词是行业术语，不同于日常语境中的“acidify（使酸化）”。在一般化学或环境话题中更常用 acidify，而在油气井处理里常用 acidize/acidizing。"]}
{"word":"acidly","summary":{"en":"Acidly most often means “in a sharp, sarcastic, or bitter way,” and less commonly means “with an acidic quality.”","zh":"acidly最常见表示“尖刻、讽刺、刻薄地”，较少见表示“带酸性特质地/呈酸味地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a sharp, bitter, or sarcastic way (showing criticism or hostility).","zh":"以尖刻、刻薄或讽刺的方式（带有批评或敌意）。"},"examples":[{"en":"“Oh, great,” she said acidly, “another meeting.”","zh":"“哦，太好了，”她刻薄地说，“又开会。”"},{"en":"He smiled, then added acidly that the plan would never work.","zh":"他笑了笑，随后讽刺地补了一句，说这个计划根本行不通。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to acid; with an acidic quality (often about taste, smell, or chemistry).","zh":"以与酸有关的方式；带有酸性特质（常用于味道、气味或化学语境）。"},"examples":[{"en":"The sauce tasted acidly because it had too much vinegar.","zh":"这酱吃起来酸得明显，因为醋放太多了。"},{"en":"The solution reacted acidly in the test.","zh":"这种溶液在测试中呈酸性反应。"}]}],"synonyms":["sarcastically","bitterly","sharply","cuttingly"],"phonetic":"/ˈæsɪdli/","extraExplanation":["“acidly”有两条常见路径：一条是“像酸一样刺人”→引申为“尖刻/讽刺的语气”（更常见于写作与对话描写）；另一条才是字面意义的“带酸味/呈酸性”。读到人物对话描写时，通常优先理解为“刻薄地/讽刺地”。","常见搭配：say/speak/remark/comment acidly（尖刻地说/评论）；smile acidly（冷笑、带刺地笑）。近义词在语气义上可对比：sarcastically（讽刺地，更强调反话）、bitterly（怨愤地，更强调情绪）。"]}
{"word":"acidness","summary":{"en":"Acidness means “acidity”: a sour taste or the degree of being acidic; more rarely, it can mean a harsh, biting tone.","zh":"acidness 指“酸性/酸度”：酸味或酸的程度；较少情况下也可指“尖刻、刻薄的语气”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being acidic; a sour, sharp taste or chemical property (often measured as pH or “acidity”).","zh":"酸性；酸味；（化学）酸度（常用 pH 或“酸度”衡量）。"},"examples":[{"en":"The acidness of the lemon made my mouth water.","zh":"柠檬的酸味让我直流口水。"},{"en":"Winemakers carefully control the acidness of the wine to balance flavor.","zh":"酿酒师会仔细控制葡萄酒的酸度来平衡风味。"},{"en":"If the soil’s acidness is too high, some plants won’t grow well.","zh":"如果土壤酸度太高，有些植物就长不好。"}]},{"partOfSpeech":"n.","definition":{"en":"A feeling or tone that is harsh, biting, or critical (less common).","zh":"（较少用）尖刻、刻薄的语气或感觉。"},"examples":[{"en":"There was acidness in his reply, as if he felt insulted.","zh":"他的回答带着尖刻，仿佛觉得受到了侮辱。"},{"en":"Try to express your disagreement without acidness.","zh":"尽量在表达不同意见时不要带刺。"}]}],"synonyms":["acidity","sourness","tartness","sharpness"],"phonetic":"/ˈæsɪdnəs/","extraExplanation":["“acidness”在现代英语里不如“acidity”常见：在化学、食品、葡萄酒、土壤等语境中更常用“acidity”。日常谈味道时也更常说“sourness / tartness”。","比喻义（“尖刻、刻薄”）来自“acid”表示“辛辣、尖锐”的引申用法，但写作里更常见“acid remark / acidic tone”而不是“acidness”。"]}
{"word":"acidnesses","summary":{"en":"“Acidnesses” is the plural of “acidness,” meaning kinds/instances of acidity or sour sharpness, and sometimes figurative bitterness in tone.","zh":"acidnesses 是 acidness 的复数，指多种/多次出现的酸性、酸味；也可比喻言语态度的尖酸刻薄。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being acidic; sourness or a sharp, biting taste (often in food or drinks)","zh":"酸性；酸味；（常指食物、饮料的）酸涩、刺激的味道"},"examples":[{"en":"The wine’s acidnesses were noticeable, giving it a crisp finish.","zh":"这款葡萄酒的几种酸感很明显，让收尾更清爽。"},{"en":"Too much lemon can add harsh acidnesses to the sauce.","zh":"柠檬放太多会让酱汁出现几种刺口的酸味。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) sharpness or bitterness in tone, words, or attitude","zh":"（比喻）言语或态度的尖刻；刻薄；酸意"},"examples":[{"en":"There were acidnesses in his comments that made the room go quiet.","zh":"他的话里带着尖酸，让房间一下子安静了。"},{"en":"Try to remove the acidnesses from your email and sound more neutral.","zh":"尽量把邮件里的尖刻语气去掉，写得更中性一些。"}]}],"synonyms":["acidity","sourness","tartness","sharpness","bitterness"],"phonetic":"/ˈæsɪdnəsɪz/","extraExplanation":["“acidnesses”是“acidness”的复数形式，但在日常英语里更常用不可数名词“acidity”（酸度、酸性）来表达整体的酸度。例如：the acidity of the wine。使用“acidnesses”时，通常是在强调“不同类型/不同来源的酸感”或在较少见的写法中区分多种“酸味/尖酸”。","在化学或食品科学语境里，“acidity”常与pH值相关：pH越低通常酸性越强。"]}
{"word":"acidogenic","summary":{"en":"Acidogenic means “acid-producing” or “related to producing acid,” often describing bacteria or biological processes.","zh":"acidogenic 意为“产酸的/与产酸相关的”，常用于描述细菌或生物过程。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"producing acid, or causing acid to be formed (especially by bacteria or metabolic processes).","zh":"产酸的；能产生酸的（尤指由细菌或代谢过程产生酸）。"},"examples":[{"en":"Acidogenic bacteria in dental plaque produce acids that can damage tooth enamel.","zh":"牙菌斑中的产酸细菌会产生酸，可能损伤牙釉质。"},{"en":"A high-sugar diet can increase acidogenic activity in the mouth.","zh":"高糖饮食会增加口腔中的产酸活动。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to acid production in a biological or chemical process (often used in scientific writing).","zh":"与某种生物或化学过程中的产酸有关的（常见于科研写作）。"},"examples":[{"en":"The researchers measured acidogenic fermentation under low-oxygen conditions.","zh":"研究人员测量了低氧条件下的产酸发酵。"},{"en":"Acidogenic pathways are important in the early stages of anaerobic digestion.","zh":"产酸途径在厌氧消化的早期阶段很重要。"}]}],"synonyms":["acid-producing","acid-forming"],"phonetic":"/ˌæsədoʊˈdʒɛnɪk/","extraExplanation":["“acidogenic”常见于牙科与微生物学语境，尤其和龋齿有关：当细菌分解糖类时会产酸，酸会降低口腔pH，增加牙釉质脱矿风险。","词形提示：acid（酸）+ -genic（“产生……的”）。类似构词还有“pathogenic（致病的）”“carcinogenic（致癌的）”。"]}
{"word":"acidoid","summary":{"en":"“Acidoid” means acid-like or slightly acidic, mainly in technical contexts.","zh":"“acidoid”意为“类酸的/略带酸性的”，主要用于技术或学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling an acid; slightly acidic or acid-like (often used in chemistry or biology).","zh":"像酸的；略带酸性或具有酸样特征的（多用于化学或生物学语境）。"},"examples":[{"en":"Some acidoid compounds can irritate the skin, so wear gloves when handling them.","zh":"有些类酸化合物可能刺激皮肤，因此处理时要戴手套。"},{"en":"The solution has an acidoid taste, not as sharp as vinegar but still sour.","zh":"这种溶液带有类酸的味道，没有醋那么刺鼻，但仍然发酸。"}]}],"synonyms":["acidic","acid-like","sour","tart"],"phonetic":"/ˈæsɪˌdɔɪd/","extraExplanation":["“acidoid”由 acid（酸）+ -oid（“……样的/类似……的”后缀）构成，常用于较正式或学术写作中，表示“具有酸的特征但不一定是真正的强酸”。在日常英语里更常见的说法是 “acidic”（酸性的）或 “acid-like”（像酸的）。"]}
{"word":"acidology","summary":{"en":"“Acidology” means the scientific study of acids, but it is a rare term in modern English.","zh":"“Acidology”指对酸的科学研究，但在现代英语中很少使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the scientific study of acids and acid-related processes (chemistry); the branch of chemistry dealing with acids","zh":"酸学；研究酸及其相关过程的科学（化学分支）"},"examples":[{"en":"Acidology focuses on how acids react with bases and metals.","zh":"酸学关注酸如何与碱和金属发生反应。"},{"en":"In older texts, acidology was used as a term for the study of acids in chemistry.","zh":"在较早的文献中，acidology 用来指化学中对酸的研究。"}]}],"synonyms":["acid chemistry","acid-base chemistry","the study of acids"],"phonetic":"/ˌæsɪˈdɑlədʒi/","extraExplanation":["“acidology”在现代英语里非常少见，通常化学语境更常用“acid chemistry（酸化学）”“acid-base chemistry（酸碱化学）”“acid-base theory（酸碱理论）”等表达。","构词法：acid（酸）+ -ology（……学；……的研究）。和“biology（生物学）”“geology（地质学）”同一类后缀。","如果你在学术写作中想表达“酸学/酸的研究”，更自然的写法通常是：the study of acids / acid chemistry，而不是 acidology。"]}
{"word":"acidolysis","summary":{"en":"Acidolysis is the breaking of a chemical bond or compound by an acid.","zh":"Acidolysis 指由酸引发或促进的化学键断裂/分解反应（酸解）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A chemical reaction in which a compound is broken (cleaved) by an acid, often producing new molecules such as an ester, salt, or smaller fragments.","zh":"酸解（反应）：一种由酸引发的化学反应，使化合物发生断裂（裂解），常生成新的分子，如酯、盐或更小的片段。"},"examples":[{"en":"In the lab, we used acidolysis to cleave the polymer into smaller chains.","zh":"在实验室里，我们用酸解把聚合物裂解成更短的链段。"},{"en":"Acidolysis of the ester produced a different product mixture than hydrolysis.","zh":"该酯的酸解生成的产物混合物与水解不同。"}]}],"synonyms":["acid cleavage","acid-catalyzed cleavage","acid degradation"],"phonetic":"ˌæsɪˈdɑlɪsɪs","extraExplanation":["“Acidolysis”多见于有机化学与高分子化学文献，常用来描述“酸促进的键断裂”，尤其在聚酯/生物质（如木质素）处理、酯交换或降解研究中出现。","词形来源：acid（酸）+ -lysis（裂解/分解）。与“hydrolysis（水解）”不同，水解强调“用水把键断开”；酸解强调“由酸参与或促进断裂”，不一定以水为主要反应物。"]}
{"word":"acidometer","summary":{"en":"An acidometer is a device used to measure the acidity of a liquid.","zh":"acidometer 指用于测量液体酸度（含酸量）的仪器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An instrument used to measure the acidity of a liquid (how much acid it contains), often in chemistry, food production, or industry.","zh":"酸度计；用于测量液体酸度（含酸量）的仪器，常见于化学、食品生产或工业领域。"},"examples":[{"en":"The lab technician checked the vinegar with an acidometer before bottling it.","zh":"装瓶前，实验室技术员用酸度计检测了醋的酸度。"},{"en":"An acidometer helps producers keep the acidity of wine consistent from batch to batch.","zh":"酸度计能帮助生产者让葡萄酒不同批次的酸度保持一致。"}]}],"synonyms":["pH meter","acidity meter","acidity tester"],"phonetic":"/ˌæsəˈdɑmɪtɚ/","extraExplanation":["acidometer 由 acid（酸）+ -meter（测量器）构成，字面意思就是“测酸的仪器”。","在现代语境里，人们更常说 pH meter（pH 计）或 acidity tester；acidometer 在一些传统或特定行业（如酿造、乳制品、醋的生产）中仍可能出现。","它测的“酸度”有时指 pH（酸碱度），有时指“可滴定酸度”（titratable acidity，TA），也就是通过滴定得到的总酸含量；具体含义取决于使用场景与标准。"]}
{"word":"acidometry","summary":{"en":"Acidometry means measuring acidity, often using lab methods like titration.","zh":"Acidometry 指测量酸度，常用滴定等实验方法完成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the measurement of acidity (how much acid is present), especially by chemical analysis such as titration","zh":"酸度测定；测量酸性（酸的含量/强度），尤指用化学分析方法（如滴定）来测定"},"examples":[{"en":"In the lab, students practiced acidometry to determine the acidity of vinegar.","zh":"在实验室里，学生练习用酸度测定法来测定食醋的酸度。"},{"en":"Acidometry is commonly used in quality control for foods and beverages.","zh":"酸度测定常用于食品和饮料的质量控制。"}]}],"synonyms":["acidity measurement","acid determination","acidimetric analysis"],"phonetic":"/ˌæsɪˈdɑmɪtri/","extraExplanation":["词根提示：acido- 表示“酸”，-metry 表示“测量”。因此 acidometry 直译就是“酸的测量”。","常见对比：acidometry（测酸）与 alkalimetry（测碱/碱度测定）常成对出现。实际操作中多用滴定法，通过标准溶液计算酸的浓度或酸度。"]}
{"word":"acidophil","summary":{"en":"An acidophil is an organism that thrives in acidic environments, or (in biology) a cell/tissue that stains well with acidic dyes.","zh":"acidophil 指能在酸性环境中良好生长的生物（嗜酸生物），也可指在生物学中易被酸性染料染色的细胞/组织（嗜酸性）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an organism (especially a microbe) that grows best in acidic conditions (low pH)","zh":"嗜酸生物；喜酸生物（尤其指在酸性环境、低 pH 条件下生长最好的微生物）"},"examples":[{"en":"Some acidophils live in acidic hot springs where most life cannot survive.","zh":"一些嗜酸生物生活在酸性温泉中，大多数生物无法在那样的环境里生存。"},{"en":"The mine drainage is very acidic, so researchers look for acidophils that can help clean it up.","zh":"矿山排水非常酸，因此研究人员会寻找能帮助净化的嗜酸生物。"}]},{"partOfSpeech":"n.","definition":{"en":"a cell that stains readily with acidic dyes (e.g., eosin), often describing certain tissues or cells in biology","zh":"嗜酸性细胞（容易被酸性染料如伊红染色的细胞/组织特征）"},"examples":[{"en":"Under the microscope, the cytoplasm appeared acidophil and took up the pink stain strongly.","zh":"在显微镜下，细胞质呈嗜酸性，明显吸收粉红色染料。"},{"en":"In basic histology, students learn to distinguish acidophil from basophil staining patterns.","zh":"在基础组织学中，学生会学习区分嗜酸性与嗜碱性的染色模式。"}]}],"synonyms":["acidophile","acid-loving organism","acidophilic cell"],"phonetic":"/əˈsɪdəˌfɪl/","extraExplanation":["“acidophil”由 acid（酸）+ -phil（喜爱/偏好）构成，常见于生物学与微生物学语境；相关词有 acidophile（更常见拼写）、acidophilic（形容词：嗜酸性的）。","在组织学里，“acidophil/acidophilic”通常与染色方法有关：能与酸性染料（如伊红 eosin）结合的结构会呈现粉红/红色；与之相对的是 basophil/basophilic（嗜碱性）。"]}
{"word":"acidophile","summary":{"en":"An acidophile is an organism that grows best in acidic, low‑pH environments.","zh":"acidophile 指能在酸性、低 pH 环境中最适生长的生物（常为微生物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An organism (especially a microbe) that thrives in acidic environments (low pH).","zh":"嗜酸生物；喜酸生物（尤其指能在酸性、低 pH 环境中生长良好的微生物）。"},"examples":[{"en":"Some acidophiles live in hot, acidic springs where most life cannot survive.","zh":"有些嗜酸生物生活在高温酸性温泉里，那种环境下大多数生物无法生存。"},{"en":"Scientists study acidophiles to understand how cells protect themselves from acid damage.","zh":"科学家研究嗜酸生物，以了解细胞如何保护自己免受酸性环境的伤害。"},{"en":"The mine’s acidic runoff created conditions where only acidophiles could grow well.","zh":"矿区的酸性径流造成了只有嗜酸生物才能良好生长的环境。"}]}],"synonyms":["acid-loving organism","acid-loving microbe"],"phonetic":"/ˌæsɪˈdoʊfaɪl/","extraExplanation":["词源：acid（酸）+ -phile（爱好者/喜爱……的人或生物）。因此 acidophile 字面意思是“喜欢酸的（生物）”。","常见搭配与对比：acidic environment（酸性环境）、low pH（低 pH）；对比 alkaliphile（嗜碱生物，喜欢碱性环境）、thermophile（嗜热生物，喜欢高温环境）。","使用场景：多见于生物学、微生物学、环境科学、地质/矿山污染研究等学术语境，日常英语中较少用。"]}
{"word":"acidophilic","summary":{"en":"Acidophilic means preferring or thriving in acidic (low-pH) conditions, especially used for microbes or enzymes.","zh":"acidophilic 指“嗜酸的”，即偏好或最适于酸性（低 pH）环境，常用于微生物或酶等科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology, chemistry) Preferring or thriving in acidic conditions (low pH).","zh":"（生物学、化学）嗜酸的；在酸性环境（低 pH）中更容易生长或表现更活跃的。"},"examples":[{"en":"Acidophilic bacteria can live in environments where the pH is too low for most organisms.","zh":"嗜酸菌能在 pH 低到大多数生物无法生存的环境中生活。"},{"en":"This enzyme is acidophilic, so it works best in the acidic conditions of the stomach.","zh":"这种酶是嗜酸性的，因此在胃部的酸性环境中作用最好。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Microbiology) Describing a microorganism that grows best at low pH.","zh":"（微生物学）形容在低 pH 条件下生长最好的微生物。"},"examples":[{"en":"Many acidophilic archaea are found near volcanic springs.","zh":"许多嗜酸古菌分布在火山温泉附近。"},{"en":"Researchers isolated an acidophilic fungus from acidic soil.","zh":"研究人员从酸性土壤中分离出一种嗜酸真菌。"}]}],"synonyms":["acid-loving","acidophilous","acid-tolerant (related, not identical)"],"phonetic":"/ˌæsɪdoʊˈfɪlɪk/","extraExplanation":["词源拆解：acido-（酸）+ -philic（喜爱、偏好）。因此它常用于“酸性环境适应性”的科学描述。","相关概念对比：acidophilic（嗜酸的）强调“偏好/最适”；acid-tolerant（耐酸的）强调“能忍受但未必最适”。"]}
{"word":"acidophilous","summary":{"en":"Acidophilous describes organisms or plants that prefer or thrive in acidic environments.","zh":"acidophilous 指偏好或能在酸性环境中生长良好的（嗜酸性）生物或植物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an organism or plant) Living in or preferring acidic conditions, such as acidic soil or water.","zh":"（指生物或植物）生活在或偏好酸性环境的，如酸性土壤或酸性水体。"},"examples":[{"en":"Some mosses are acidophilous and grow best on acidic ground.","zh":"一些苔藓是嗜酸性的，在酸性土壤上长得最好。"},{"en":"Researchers found acidophilous bacteria in an acidic hot spring.","zh":"研究人员在酸性温泉中发现了嗜酸性细菌。"},{"en":"Blueberries are often described as acidophilous plants because they prefer acidic soil.","zh":"蓝莓常被称为嗜酸性植物，因为它们更喜欢酸性土壤。"}]}],"synonyms":["acid-loving","acidophilic"],"phonetic":"/ˌæsɪˈdɑfələs/","extraExplanation":["词源上可拆为 acid（酸）+ -philous（喜爱的、偏好的），整体意思就是“喜欢酸性环境的”。","常用于生态学、植物学、微生物学等语境，描述“适合在低 pH 条件生长”的物种；日常英语中不常见，更常见的近义词是 acid-loving。"]}
{"word":"acidophilus","summary":{"en":"Acidophilus is a beneficial probiotic bacterium often found in yogurt and supplements for digestive health.","zh":"Acidophilus（嗜酸乳杆菌）是一种有益的益生菌，常见于酸奶和保健品中，用于支持消化健康。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of beneficial bacteria often found in the gut and in fermented foods; commonly taken as a probiotic to support digestion","zh":"一种有益菌，常见于肠道和发酵食品中；常作为益生菌补充剂，用来支持消化健康"},"examples":[{"en":"I started taking acidophilus to help with my digestion.","zh":"我开始补充嗜酸乳杆菌来帮助消化。"},{"en":"Some yogurts contain acidophilus and other live cultures.","zh":"有些酸奶含有嗜酸乳杆菌和其他活性菌种。"},{"en":"After antibiotics, my doctor suggested a probiotic like acidophilus.","zh":"用完抗生素后，医生建议我补充像嗜酸乳杆菌这样的益生菌。"}]}],"synonyms":["Lactobacillus acidophilus","probiotic","live cultures"],"phonetic":"/ˌæsɪˈdɑːfɪləs/","extraExplanation":["“Acidophilus”常指一种乳酸菌（更完整名称常见为 *Lactobacillus acidophilus*）。在保健品标签上也可能泛指含这种菌的益生菌产品；不同菌株作用可能不同，阅读标签时可留意菌株编号与活菌数量（如CFU）。","词源上与“acid（酸）”有关，因为它能在较酸的环境中生存；中文常译为“嗜酸乳杆菌”。"]}
{"word":"acidophytic","summary":{"en":"Acidophytic describes plants that thrive in acidic (low-pH) soil.","zh":"acidophytic 指“喜酸的”，形容在酸性（低 pH）土壤中生长良好的植物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a plant) growing best in acidic soil or in an environment with a low pH.","zh":"（指植物）喜酸的；在酸性土壤或低 pH 环境中生长得最好。"},"examples":[{"en":"Blueberries are acidophytic plants that prefer soil with a low pH.","zh":"蓝莓是喜酸植物，偏好低 pH 的土壤。"},{"en":"Gardeners often add sulfur to make the soil more suitable for acidophytic species like rhododendrons.","zh":"园艺者常用硫来降低土壤 pH，使其更适合杜鹃等喜酸物种。"}]}],"synonyms":["acid-loving","acid-tolerant","ericaceous (in gardening contexts)"],"phonetic":"/ˌæsɪdoʊˈfaɪtɪk/","extraExplanation":["“acidophytic”来自 acid（酸）+ -phyte（植物，源自希腊语 *phyton*）+ -ic（形容词后缀），字面意思是“酸环境中的植物”。","日常英语里更常见的说法是 **acid-loving**（喜酸的）或 **ericaceous plants**（杜鹃花科/石南科喜酸植物，园艺语境常用）。","“酸性土壤”通常指 pH 低于 7 的土壤；不少喜酸植物在 pH 约 4.5–6.0 的范围里更容易吸收某些养分。"]}
{"word":"acidoproteolytic","summary":{"en":"Acidoproteolytic describes something (especially microbes or enzymes) that produces acid and breaks down proteins, typically in acidic conditions.","zh":"acidoproteolytic 指（尤其是微生物或酶）能产酸并分解蛋白质的，通常强调在酸性条件下的蛋白水解能力。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology/Microbiology) Producing acid and breaking down (digesting) proteins; capable of proteolysis in an acidic environment.","zh":"（生物/微生物）产酸并分解（消化）蛋白质的；能在酸性环境中进行蛋白水解的。"},"examples":[{"en":"Some bacteria are acidoproteolytic, meaning they can acidify their surroundings and digest proteins.","zh":"有些细菌具有酸蛋白水解性，意思是它们能让环境变酸并消化蛋白质。"},{"en":"Researchers measured acidoproteolytic activity to see how quickly the culture degraded milk proteins.","zh":"研究人员测量酸蛋白水解活性，以了解培养物分解牛奶蛋白的速度。"}]}],"synonyms":["acid-proteolytic","acidic proteolytic","acid-producing and proteolytic"],"phonetic":"ˌæsɪdoʊˌproʊtiəˈlɪtɪk","extraExplanation":["这个词由 acid/o（酸）+ proteolytic（蛋白水解的）组合而成，常见于食品发酵、微生物学与酶学文献，用来描述“既产酸又能分解蛋白”的微生物或酶活性（例如某些发酵菌或在低 pH 条件下仍能分解蛋白的酶）。","在实际阅读中，你也可能看到更常用的表达：proteolytic under acidic conditions（在酸性条件下具有蛋白水解性）或 acid-producing and proteolytic（产酸且蛋白水解）。"]}
{"word":"acidoses","summary":{"en":"Acidoses means multiple cases or types of acidosis—conditions where the body becomes too acidic.","zh":"Acidoses 指多种/多例酸中毒（酸中毒症），即身体酸性过强的状况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of acidosis: medical conditions in which the blood or body fluids become too acidic (pH is too low).","zh":"acidosis（酸中毒/酸中毒症）的复数：指血液或体液酸性过强（pH过低）的一类医学状况。"},"examples":[{"en":"The doctor explained that different acidoses can have different causes.","zh":"医生解释说，不同类型的酸中毒可能有不同原因。"},{"en":"In the ICU, clinicians monitor for acidoses using blood tests.","zh":"在重症监护室，临床医生会用血液检查来监测是否出现酸中毒。"}]}],"synonyms":["types of acidosis","forms of acidosis"],"phonetic":"/ˌæsɪˈdoʊsiz/","extraExplanation":["“Acidoses”是较少见的复数形式，更常见的说法是“types/forms of acidosis”（酸中毒的类型/形式）。","常见相关分类包括“metabolic acidosis（代谢性酸中毒）”和“respiratory acidosis（呼吸性酸中毒）”。不同类型对应不同机制：例如肾功能问题、糖尿病酮症酸中毒、呼吸通气不足等。该词通常用于医学/护理/生理学语境。"]}
{"word":"acidosis","summary":{"en":"Acidosis is a medical condition where body fluids, especially blood, become too acidic.","zh":"Acidosis 指体液（尤其血液）酸度过高（pH过低）的一种医学状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical condition in which the blood or body fluids become too acidic (pH is too low)","zh":"（医学）酸中毒；指血液或体液变得过酸（pH过低）的状态"},"examples":[{"en":"The doctor said the patient had acidosis caused by kidney failure.","zh":"医生说患者因肾功能衰竭出现了酸中毒。"},{"en":"Severe dehydration can sometimes lead to metabolic acidosis.","zh":"严重脱水有时会导致代谢性酸中毒。"}]}],"synonyms":["acid-base imbalance","metabolic acidosis","respiratory acidosis"],"phonetic":"/ˌæsəˈdoʊsɪs/","extraExplanation":["词源提示：acidosis = acid（酸）+ -osis（表示“疾病/异常状态”的后缀）。因此它字面意思就是“酸性异常的病理状态”。","常见搭配：metabolic acidosis（代谢性酸中毒）、respiratory acidosis（呼吸性酸中毒）。前者多与代谢/肾功能/糖尿病酮症等有关，后者多与通气不足、二氧化碳潴留有关。","使用语境：这是医学术语，日常生活中一般不会用；在科普文章或病历说明里更常见。"]}
{"word":"acidosteophyte","summary":{"en":"A rare technical term meaning an osteophyte (bone spur) discussed in relation to acidity/acid-related processes.","zh":"一个罕见的专业词，指在“酸性/与酸有关的过程”语境下描述的骨赘（骨刺）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/technical) A bone spur (osteophyte) described as being associated with an acidic environment or acid-related processes.","zh":"（罕见/专业用语）骨赘（osteophyte，骨刺）的一种描述方式，强调其与“酸性环境”或“与酸有关的过程”相关。"},"examples":[{"en":"The paper mentions an “acidosteophyte,” apparently referring to an osteophyte discussed in the context of local acidity.","zh":"论文中提到“acidosteophyte”，显然是指在局部酸性环境的语境下讨论的一种骨赘。"},{"en":"Clinicians would usually just say “osteophyte” or “bone spur” rather than “acidosteophyte.”","zh":"临床上通常会说“osteophyte（骨赘）”或“bone spur（骨刺）”，而不会用“acidosteophyte”。"}]}],"synonyms":["osteophyte","bone spur"],"phonetic":"ˌæsɪdoʊˈɑstəˌfaɪt","extraExplanation":["这个词在常见医学词典与临床语境中并不常见，更像是由词根组合而成的“构词式术语”。可拆解为：acido-（与酸、酸性有关）+ osteophyte（骨赘/骨刺）。如果你是在某篇论文、报告或病理描述里看到它，建议回到原文查看作者是否在讨论“酸性微环境（例如炎症、代谢变化）与骨赘形成/变化”的关系。","学习建议：遇到这种不常见复合词时，先抓住核心词（osteophyte=骨赘/骨刺），再把前缀（acido-）理解为“与酸相关的修饰信息”，通常就能把握大意。"]}
{"word":"acidotic","summary":{"en":"“Acidotic” means having or relating to acidosis—too much acid in the body’s fluids.","zh":"“acidotic”指“酸中毒的/与酸中毒有关的”，即体液（如血液）酸度过高。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or showing acidosis (an abnormal increase of acid in the blood or other body fluids).","zh":"与酸中毒（血液或其他体液中酸度异常升高的状态）有关的；呈酸中毒状态的。"},"examples":[{"en":"The lab results suggested the patient was becoming acidotic.","zh":"化验结果提示病人正在出现酸中毒倾向。"},{"en":"Severe dehydration can make a child acidotic.","zh":"严重脱水可能会让儿童出现酸中毒。"}]}],"synonyms":["acidotic (medical)","acidotic state","in acidosis","acid-base imbalanced (broader)"],"phonetic":"/ˌæsɪˈdɑtɪk/","extraExplanation":["“acidotic”是医学用语，常见于病历、化验报告或急诊/重症监护语境中，通常与“metabolic acidosis（代谢性酸中毒）”或“respiratory acidosis（呼吸性酸中毒）”一起出现。","日常英语中很少用它来形容食物或味道；描述味道更常用“acidic（酸的）”。"]}
{"word":"acidproof","summary":{"en":"“Acidproof” means resistant to damage from acid.","zh":"“acidproof”表示“耐酸的、能防酸腐蚀的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resistant to damage or corrosion caused by acid.","zh":"耐酸的；防酸腐蚀的。"},"examples":[{"en":"The lab uses acidproof gloves when handling sulfuric acid.","zh":"实验室在处理硫酸时会使用耐酸手套。"},{"en":"Choose an acidproof container so the liquid won’t eat through the plastic.","zh":"选择耐酸容器，这样液体就不会把塑料腐蚀穿。"}]}],"synonyms":["acid-resistant","corrosion-resistant (to acids)","chemical-resistant"],"phonetic":"/ˈæsɪdˌpruːf/","extraExplanation":["“acidproof”也常写作“acid-proof”，在产品说明、实验室安全、工业材料（如涂层、衬里、管道）语境中更常见。它强调“能抵抗酸造成的腐蚀/破坏”，但并不一定表示对所有种类、所有浓度的酸都安全；实际使用需查看材料兼容性说明。"]}
{"word":"acids","summary":{"en":"“Acids” is the plural of “acid,” most commonly meaning acidic substances in chemistry; informally it can also mean LSD.","zh":"“acids”是“acid”的复数，最常见指化学中的酸类物质；非正式用法也可指LSD等致幻剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Substances (often liquids) with a sour taste that can react with metals and bases; in chemistry, acids donate hydrogen ions (H+) in water (or donate protons).","zh":"酸；常带酸味、能与金属或碱反应的物质；化学上通常指在水中释放氢离子（H+）或提供质子（proton）的物质。"},"examples":[{"en":"Lemon juice and vinegar are common household acids.","zh":"柠檬汁和醋是常见的家用酸性物质。"},{"en":"Acids can burn skin, so wear gloves and goggles in the lab.","zh":"酸可能灼伤皮肤，所以在实验室要戴手套和护目镜。"},{"en":"In digestion, stomach acid helps break down food.","zh":"在消化过程中，胃酸帮助分解食物。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) LSD or similar hallucinogenic drugs.","zh":"（非正式）迷幻药LSD（或类似致幻剂）。"},"examples":[{"en":"In the 1960s, “acid” became a slang term connected with LSD.","zh":"在20世纪60年代，“acid”成为与LSD相关的俚语。"},{"en":"That usage is informal and often appears in music or subculture contexts.","zh":"这种用法较口语，常见于音乐或亚文化语境。"}]}],"synonyms":["acids (chemical)","acidic substances","(slang) LSD"],"phonetic":"ˈæsɪdz","extraExplanation":["“Acids”是“acid”的复数形式。日常语境中常指“酸性物质/酸类”（如 citric acid 柠檬酸、sulfuric acid 硫酸）。在化学课上，你也会看到“strong acids（强酸）/weak acids（弱酸）”和“acidic（酸性的）/acidity（酸度）”。","俚语“acid=LSD”带有特定时代与文化背景（尤其与嬉皮士、迷幻摇滚相关）。在正式写作或学术场合通常避免这样用，以免产生误解。"]}
{"word":"acidulant","summary":{"en":"An acidulant is an additive that makes a product more acidic, especially in foods and drinks.","zh":"acidulant 指“酸味剂/酸度调节剂”，常用于食品饮料中以增加酸度与酸味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance added to food, drinks, or medicines to make them more acidic (often to improve flavor, preservation, or texture).","zh":"（酸味剂）添加到食品、饮料或药品中，用来增加酸度的物质（常用于改善风味、保藏或口感）。"},"examples":[{"en":"Citric acid is a common acidulant in soft drinks.","zh":"柠檬酸是软饮料中常见的酸味剂。"},{"en":"The label lists an acidulant to balance sweetness and add a tangy taste.","zh":"标签上写有酸味剂，用来平衡甜味并增加酸爽口感。"}]}],"synonyms":["acidifier","souring agent","pH adjuster"],"phonetic":"/əˈsɪdʒələnt/","extraExplanation":["在食品配料表里，acidulant 常与具体物质一起出现，如 citric acid（柠檬酸）、malic acid（苹果酸）、lactic acid（乳酸）、phosphoric acid（磷酸）。它们既能提供“酸味”，也能调节 pH，从而影响保存期与质地。","与 acidifier（酸化剂）意义接近，但 acidulant 更常用于食品工业语境，强调“带来酸味/酸感”的功能。"]}
{"word":"acidulants","summary":{"en":"“Acidulants” are substances—often food additives—used to make foods or drinks more acidic and pleasantly sour.","zh":"“Acidulants” 指酸味剂/酸度调节剂，常见于食品添加剂，用来增加酸度并带来酸味口感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sour-tasting substance (often a food additive) used to make food or drinks more acidic and to add a tangy flavor.","zh":"酸味剂；酸度调节剂（常见为食品添加剂），用于提高食品或饮料的酸度并增加酸味/清爽口感。"},"examples":[{"en":"Citric acid and malic acid are common acidulants in candies and soft drinks.","zh":"柠檬酸和苹果酸是糖果和汽水中常见的酸味剂。"},{"en":"The label lists acidulants to control the product’s pH and flavor.","zh":"标签上标明使用了酸味剂来控制产品的酸碱度（pH）和风味。"}]}],"synonyms":["acidifying agents","souring agents","pH adjusters"],"phonetic":"/əˈsɪdʒələnts/","extraExplanation":["在食品工业里，acidulant 常见于配料表，功能不只是“变酸”，还包括：调节 pH（影响保存与微生物生长）、平衡甜味、增强果味或清爽感等。常见例子有 citric acid（柠檬酸）、lactic acid（乳酸）、phosphoric acid（磷酸，用于可乐类饮料）、malic acid（苹果酸）。","词形：acidulants 是 acidulant 的复数。发音中重音通常在第一个音节。","相关词：acid（酸）、acidic（酸性的）、acidity（酸度）、pH（酸碱度）。"]}
{"word":"acidulate","summary":{"en":"Acidulate means to make something slightly acidic (often by adding lemon juice or vinegar), or to become slightly acidic.","zh":"acidulate 指使……略带酸性（常通过加入柠檬汁或醋等），也可指（物质）变得略带酸性。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something slightly acidic by adding a small amount of acid; to give a pleasantly sour/tangy taste","zh":"使……略带酸性；（加少量酸）使……带有微酸/酸爽的味道"},"examples":[{"en":"A squeeze of lemon juice can acidulate the sauce and brighten the flavor.","zh":"挤一点柠檬汁可以让酱汁略微酸化，使味道更清爽。"},{"en":"The chef acidulated the salad dressing with vinegar.","zh":"厨师用醋让沙拉酱略微酸化。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become slightly acidic","zh":"（物质）变得略带酸性"},"examples":[{"en":"Over time, the solution may acidulate if exposed to certain gases.","zh":"随着时间推移，如果接触到某些气体，这种溶液可能会变得略带酸性。"}]}],"synonyms":["acidify","sour","sharpen","tart up (flavor)"],"phonetic":"/əˈsɪdʒəˌleɪt/","extraExplanation":["“acidulate”在日常口语中不算常见，更常见的表达是“make it more acidic / add lemon (or vinegar)”。它在烹饪、食品饮料（如鸡尾酒、糖浆）以及化学/实验语境中更常出现。","词形提示：形容词常用“acidulated”（如 acidulated water 指“加酸的水/略酸的水”）。"]}
{"word":"acidulated","summary":{"en":"Acidulated means “made slightly acidic” or “having a mildly sour/tangy taste,” often used in cooking and formal writing.","zh":"acidulated 指“被轻微酸化的”或“带微酸/酸爽味的”，常用于烹饪与较正式的表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made slightly acidic by adding an acid (such as lemon juice, vinegar, or citric acid).","zh":"（通过加入酸如柠檬汁、醋或柠檬酸等）使其带有轻微酸性；酸化的。"},"examples":[{"en":"Serve the oysters with an acidulated mignonette sauce.","zh":"用酸化的红葱醋汁（mignonette）搭配生蚝一起上桌。"},{"en":"Add a little lemon juice to make an acidulated rinse for the vegetables.","zh":"加一点柠檬汁，做成酸化的清洗液来冲洗蔬菜。"}]},{"partOfSpeech":"adj.","definition":{"en":"Slightly sour or tangy in taste.","zh":"味道微酸的；带酸味的。"},"examples":[{"en":"The soup had an acidulated flavor that brightened the whole dish.","zh":"这道汤带着微酸的风味，让整道菜更清爽开胃。"},{"en":"He prefers acidulated drinks over very sweet soda.","zh":"他更喜欢带酸味的饮料，而不是很甜的汽水。"}]}],"synonyms":["slightly acidic","tangy","sourish","acidic"],"phonetic":"/əˈsɪdʒəˌleɪtɪd/","extraExplanation":["这个词常见于烹饪/食品写作（菜单、食谱、品鉴笔记），比 everyday 的“sour / tangy / acidic”更正式、更书面。","词源上与 acid（酸）同源；acidulate 表示“使变酸、使酸化”，acidulated 是其过去分词作形容词，强调“被（轻微）酸化过”。","常见搭配：acidulated water（酸化水，常加柠檬汁/醋，用于防止某些食材变色，如苹果、洋蓟）、acidulated dressing（酸化调味汁）。"]}
{"word":"acidulates","summary":{"en":"“Acidulates” means “makes something slightly acidic,” often in cooking; it can also mean “makes something sound sharper” in a figurative sense.","zh":"“acidulates”意为“使（某物）略带酸性”（常见于烹饪等语境）；也可比喻“使语气更尖刻”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something slightly acidic, especially by adding a small amount of acid; to sour a little","zh":"使（某物）略带酸性；（尤指）加入少量酸使其微酸"},"examples":[{"en":"Lemon juice acidulates the sauce and makes the flavors brighter.","zh":"柠檬汁让酱汁微酸，使味道更清爽、突出。"},{"en":"In some recipes, vinegar acidulates the mixture so it keeps longer.","zh":"在一些食谱中，醋会让混合物略带酸性，从而更耐保存。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) to give a tone a sharp, biting quality","zh":"（比喻）使语气或氛围带有尖锐、刺人的感觉"},"examples":[{"en":"His sarcasm acidulates an otherwise calm conversation.","zh":"他的讽刺让原本平静的谈话变得尖刻。"}]}],"synonyms":["acidify","sour","tart","sharpen"],"phonetic":"/əˈsɪdʒəˌleɪts/","extraExplanation":["“acidulates”是动词“acidulate”的第三人称单数现在时（he/she/it acidulates）。常见于烹饪、饮料与食品科学语境，强调“轻微酸化”（不是强烈腐蚀那种“acidify”）。"]}
{"word":"acidulating","summary":{"en":"“Acidulating” means making something slightly acidic or tart, often in cooking or food preparation.","zh":"“acidulating”指让某物略带酸味/轻微酸化，常用于烹饪与食品处理语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"making something slightly acidic or tart (often to improve flavor or preservation)","zh":"使某物略带酸味的；轻微酸化的（常用于提升风味或帮助保存）"},"examples":[{"en":"Lemon juice is a simple acidulating ingredient in many sauces.","zh":"柠檬汁在许多酱汁中都是一种简单的酸化（增酸）材料。"},{"en":"The recipe calls for an acidulating splash of vinegar to brighten the soup.","zh":"这道食谱要求加一点醋来增酸提味，让汤更清爽。"}]},{"partOfSpeech":"v.","definition":{"en":"(present participle of “acidulate”) making something slightly acidic","zh":"（acidulate 的现在分词）使……轻微酸化；让……带一点酸味"},"examples":[{"en":"He is acidulating the marinade with a little citrus.","zh":"他在腌料里加了一点柑橘来轻微增酸。"},{"en":"Acidulating the mixture helps prevent browning in some fruits.","zh":"把混合物轻微酸化有助于防止某些水果变褐。"}]}],"synonyms":["acidifying","tartening","souring (slightly)","adding acidity"],"phonetic":"/əˈsɪdʒəˌleɪtɪŋ/","extraExplanation":["“acidulating”较少在日常口语中单独出现，更常见于烹饪、食品加工、饮品调配或较正式的写作中。日常表达里，人们更常说“make it more acidic / add a bit of lemon/vinegar（加点柠檬/醋）”。","在风味描述里，“acidulating”强调“适度增加酸度以提亮口感”，通常不是强烈的酸；类似思路也常见于调酒与沙拉酱（用柠檬汁、醋等平衡甜/油腻）。"]}
{"word":"acidulation","summary":{"en":"Acidulation means making something more acidic, or (less commonly) the resulting sour taste.","zh":"acidulation 指“酸化/调酸”的过程；较少见时也指由此产生的酸味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making something more acidic (adding acid or increasing acidity)","zh":"酸化；使某物变得更酸的过程（加入酸或提高酸度）"},"examples":[{"en":"In food science, acidulation can help preserve jams by lowering the pH.","zh":"在食品科学中，酸化可以通过降低 pH 来帮助保存果酱。"},{"en":"The recipe calls for a little lemon juice for gentle acidulation.","zh":"这个食谱要求加一点柠檬汁来轻微酸化。"}]},{"partOfSpeech":"n.","definition":{"en":"a sour or acidic quality; sharpness of taste (less common)","zh":"酸味；酸涩感（较少见）"},"examples":[{"en":"The wine’s acidulation gives it a crisp, refreshing finish.","zh":"这款酒的酸味让收尾清爽利落。"}]}],"synonyms":["acidification","souring","acidifying"],"phonetic":"/əˌsɪdʒəˈleɪʃən/","extraExplanation":["“acidulation”常见于食品科学、化学与酿酒语境，强调“提高酸度/调酸”的动作或结果。与更日常的“acidity（酸度）”相比，它更像一个工艺或处理步骤。","在酿酒中，acidulation（也常说 acidification）指通过加入酒石酸等来调整葡萄酒的酸度，以改善口感平衡与稳定性；具体做法受不同产区法规与风格影响。"]}
{"word":"acidulent","summary":{"en":"Acidulent means mildly acidic or pleasantly tart.","zh":"acidulent 指“微酸的、略带酸味的（常带清爽之感）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Slightly acidic; having a mildly sour or tart taste or quality.","zh":"微酸的；带一点酸味/涩酸味的。"},"examples":[{"en":"The lemonade had an acidulent tang that made it extra refreshing.","zh":"这杯柠檬水带着微酸的口感，让人觉得格外清爽。"},{"en":"She preferred an acidulent dressing with vinegar and citrus.","zh":"她更喜欢带醋和柑橘的微酸沙拉酱。"},{"en":"The critic described the wine’s acidulent finish as bright and clean.","zh":"评论家形容这款葡萄酒的余味微酸，清爽明亮。"}]}],"synonyms":["tart","tangy","sharp","acidic","sourish"],"phonetic":"/ˌæsɪˈduːlənt/","extraExplanation":["“acidulent”在现代英语中比较少见，常见于较书面或文学化的描写（尤其是食物、饮品、气味或语气的“微酸感”）。","词源可追溯到拉丁语 acidus（酸的）加上表示“具有……性质”的后缀 -ulent（常见于如 opulent 等词）。"]}
{"word":"acidulous","summary":{"en":"Acidulous means either slightly sour in taste/smell, or (more often in writing) sharp and bitter in tone.","zh":"acidulous 可指味道/气味略酸而刺鼻，也可（更常见于书面语）指语气尖刻、刻薄、带刺的讽刺。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a sharp, slightly unpleasant sour taste or smell.","zh":"（味道或气味）酸而刺鼻的；带尖锐酸味的。"},"examples":[{"en":"The coffee tasted acidulous, so she added milk.","zh":"咖啡味道有点酸涩，所以她加了牛奶。"},{"en":"An acidulous smell rose from the old wine.","zh":"旧酒散发出一股刺鼻的酸味。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of speech, writing, or a person) sharp, bitter, or cutting in tone; sarcastic in a mean way.","zh":"（言语、文章或人）尖刻的；刻薄的；带讽刺挖苦意味的。"},"examples":[{"en":"He made an acidulous comment about her mistake.","zh":"他对她的失误说了一句刻薄的评论。"},{"en":"Her acidulous wit often made meetings uncomfortable.","zh":"她尖刻的机智常常让会议气氛变得尴尬。"}]}],"synonyms":["tart","sour","acerbic","biting","caustic"],"phonetic":"/ˌæsɪˈduːləs/","extraExplanation":["词源上与“acid（酸）”同源，原义偏向“带酸味”，后来引申到“酸刻、尖酸”的语气（就像酸味让人皱眉一样）。","语体风格：acidulous 比 sour/acidic 更书面、更文学；描述语气时常带“冷冷的、带刺的讽刺”这一层感觉。"]}
{"word":"acidulously","summary":{"en":"Acidulously means “slightly sour” or, more often, “sharply/bitingly sarcastic” in tone.","zh":"acidulously 表示“带微酸地”，也常引申为“语气尖刻、带讽刺地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a slightly sour or acidic way (about taste, smell, or other sensations).","zh":"以微酸、带酸味的方式（多形容味道、气味或感觉）。"},"examples":[{"en":"The lemonade tasted acidulously fresh on a hot day.","zh":"炎热的天气里，这杯柠檬水带着微酸的清爽。"},{"en":"The sauce was acidulously sharp because of the vinegar.","zh":"这酱汁因为加了醋而带着微酸的刺激感。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a sharp, biting, or slightly sarcastic way (about comments, tone, or humor).","zh":"以尖刻、刻薄或略带讽刺的方式（形容言语、语气或幽默）。"},"examples":[{"en":"She smiled acidulously and said, “How convenient for you.”","zh":"她带着略显尖刻的微笑说：“对你可真方便。”"},{"en":"He replied acidulously to the criticism, but then changed the topic.","zh":"他对批评尖酸地回了一句，然后就转移了话题。"},{"en":"The reviewer wrote acidulously about the film’s weak ending.","zh":"影评人用尖酸的语气写到了这部电影薄弱的结尾。"}]}],"synonyms":["sourly","tartly","sharply","bitingly","sarcastically","acerbically"],"phonetic":"/əˈsɪdʒələsli/","extraExplanation":["“acidulously”来自“acidulous”（微酸的、略尖刻的）。词根 acid- 表示“酸”，后缀 -ous（…的）+ -ly（副词）。因此它既可指“味觉上的微酸”，也常引申为“言语上的尖酸刻薄”。","语体上偏正式，写作中更常见；日常口语里表达“尖刻”更常用“sharply / sarcastically / bitterly”。"]}
{"word":"acidulousness","summary":{"en":"Acidulousness means a mildly sour quality, or a sharp, slightly bitter/sarcastic tone.","zh":"acidulousness 指“微酸”的性质，也可指语气或态度上尖刻、略带苦涩/挖苦的感觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sharp, sour, or biting quality in taste, smell, tone, or mood; often used for a person’s sarcastic or slightly bitter manner.","zh":"酸涩或尖刻的特质；可指味道/气味的酸，也常指语气、态度上的刻薄、挖苦或微苦的感觉。"},"examples":[{"en":"The lemonade had a pleasant acidulousness that made it refreshing.","zh":"这杯柠檬水带着怡人的微酸感，让人觉得清爽。"},{"en":"There was acidulousness in her reply, as if she were tired of being questioned.","zh":"她的回答带着几分尖酸，像是厌倦了被追问。"},{"en":"The critic’s review was full of acidulousness, praising the film but with sharp little jabs.","zh":"那位评论家的影评充满尖刻的味道：一边夸电影，一边夹带着几句犀利的挖苦。"}]}],"synonyms":["sourness","tartness","bitterness","acerbity"],"phonetic":"/ˌæsɪˈduːləsnəs/","extraExplanation":["“acidulousness”来自形容词“acidulous”（略酸的；尖刻的），其词根与“acid”（酸）相关。这个名词既可描写味觉上的“微酸”，也常用于描写语言风格或情绪上的“尖酸/刻薄”。","语体上偏正式、书面语，比“sourness”更文学、更细腻：不是单纯“酸”，而是“带点酸味、又有点刺”的感觉。","近义词辨析：\n- sourness：更常用、直白，可指变酸或令人不快的“酸”。\n- tartness：多用于食物“酸爽/带劲”的口感。\n- bitterness：更偏“苦涩/怨气”。\n- sarcasm：更明确指“讽刺”，不一定有“酸味”的意象。"]}
{"word":"aciduria","summary":{"en":"Aciduria means urine that is unusually acidic (low pH).","zh":"aciduria 指尿液异常偏酸（pH偏低）的情况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical condition in which the urine is abnormally acidic (has a low pH).","zh":"（医学）酸尿；指尿液异常偏酸（pH偏低）的情况。"},"examples":[{"en":"The urinalysis showed aciduria, so the doctor looked for possible causes such as dehydration or ketosis.","zh":"尿检显示酸尿，因此医生会进一步查找可能原因，如脱水或酮症。"},{"en":"Aciduria can be a temporary finding after fasting or a high-protein diet.","zh":"禁食后或高蛋白饮食后，酸尿可能是暂时性的检验结果。"}]}],"synonyms":["acidic urine","low urine pH","hyperaciduria"],"phonetic":"/ˌæsɪˈdʒʊriə/","extraExplanation":["“aciduria”由 acid（酸）+ -uria（尿液/尿中……的状态）构成，属于医学检验与代谢相关术语。","临床上常通过尿液pH评估酸碱度：pH越低越“酸”。酸尿可能与饮食结构、脱水、代谢状态（如酮体增多）等因素相关；若伴随不适或持续异常，应由专业医生结合其他检查判断。"]}
{"word":"acidurias","summary":{"en":"“Acidurias” is the plural of “aciduria,” meaning abnormal acids in the urine, often discussed in metabolic disorders.","zh":"“acidurias”是“aciduria”的复数，指尿中出现异常的酸（常见于代谢性疾病的讨论）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the presence of an abnormal amount or type of acid(s) in the urine; often used for metabolic disorders where specific organic acids build up and are found in urine","zh":"尿中出现异常数量或异常种类的酸；常用于指代代谢性疾病（某些有机酸在体内堆积并在尿中检出）"},"examples":[{"en":"Some inherited metabolic diseases are described as acidurias because unusual organic acids appear in the urine.","zh":"一些遗传性代谢病会被称为“酸尿症”，因为尿液中会出现异常的有机酸。"},{"en":"The lab reported elevated organic acids, raising concern for an aciduria.","zh":"化验显示有机酸升高，引发对酸尿症的担忧。"}]},{"partOfSpeech":"n.","definition":{"en":"the plural form of aciduria (more than one case or type of aciduria)","zh":"aciduria 的复数形式（指多种酸尿症或多个病例）"},"examples":[{"en":"The textbook reviews several organic acidurias and how they are diagnosed.","zh":"教材综述了多种有机酸尿症及其诊断方法。"}]}],"synonyms":["organic acidurias","aciduria (singular)","abnormal urinary acids"],"phonetic":"/ˌæsɪˈdjʊriəz/","extraExplanation":["“acidurias”来自“aciduria”的复数：acid（酸）+ -uria（与尿有关的医学后缀）。在临床上更常见的具体词是“organic aciduria（有机酸尿症）”，通常指代一类遗传代谢缺陷（如某些酶缺陷）导致特定有机酸在体内堆积并从尿中排出。","在非专业语境里，人们有时会用“acidic urine（尿液偏酸）”来表达尿液酸度高；但“aciduria/acidurias”更偏医学用语，通常强调“异常的酸（种类/含量）”而不仅是pH偏低。"]}
{"word":"aciduric","summary":{"en":"“Aciduric” means acid-tolerant—able to live or grow in acidic (low-pH) conditions.","zh":"“Aciduric”指“耐酸的”——能在酸性（低 pH）环境中存活或生长。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology/Microbiology) able to survive or grow in acidic conditions (low pH); acid-tolerant.","zh":"（生物/微生物）能在酸性环境（低 pH）中存活或生长的；耐酸的。"},"examples":[{"en":"Some oral bacteria are aciduric, which helps them survive after people eat sugary foods.","zh":"一些口腔细菌具有耐酸性（aciduric），这让它们在人们吃了含糖食物后仍能存活。"},{"en":"Researchers tested whether the strain was aciduric by growing it at pH 4.5.","zh":"研究人员通过在 pH 4.5 条件下培养，来测试这种菌株是否耐酸。"},{"en":"Aciduric microbes can remain active even when the environment becomes more acidic over time.","zh":"随着环境逐渐变酸，耐酸微生物仍可能保持活性。"}]}],"synonyms":["acid-tolerant","acid-resistant","acid-stable"],"phonetic":"ˌæsɪˈdʒʊrɪk","extraExplanation":["“Aciduric”多用于学术或医学语境（如微生物学、牙科、发酵研究），日常英语里不常见。","与“acidophilic（嗜酸的）”容易混淆：acidophilic强调“偏好/最适合”酸性环境；aciduric强调“能耐受/能在酸中活下去”，不一定最喜欢酸。"]}
{"word":"acidus","summary":{"en":"Acidus is a rare Latin-based word meaning “slightly acidic/sour,” seen mostly in older or scientific contexts.","zh":"Acidus 是一个源自拉丁语的罕用词，意为“微酸的/带酸味的”，多见于较早文献或科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Slightly acidic; sour-tasting.","zh":"（罕用）微酸的；带酸味的。"},"examples":[{"en":"The drink had an acidus aftertaste, like diluted lemon.","zh":"这饮料有种微酸的余味，像稀释的柠檬汁。"},{"en":"Some older medical texts describe an acidus smell from fermentation.","zh":"一些较早的医学文本会用 acidus 来描述发酵产生的酸味气味。"}]},{"partOfSpeech":"other","definition":{"en":"(Latin, mainly in scientific names) A Latin form meaning “acidic/sour,” used as a descriptive element.","zh":"（拉丁语，多见于学名/科学命名）意为“酸的/带酸味的”，用作描述性成分。"},"examples":[{"en":"In Latin-based naming, acidus can function like an adjective describing a trait.","zh":"在拉丁化命名中，acidus 可像形容词一样用来描述某种特征。"}]}],"synonyms":["acidic","sour","tart"],"phonetic":"/ˈæsɪdəs/","extraExplanation":["acidus 是拉丁语形容词，字面意思是“酸的、带酸味的”。它不是现代英语里的常用词；在英语中若出现，往往带有“学术/古典/医学史料”的语感。","更常见的现代英语表达是 acidic（酸性的）、sour（酸的）。如果你是在化学语境里写作，通常应选用 acidic；如果强调味觉，sour 更自然。"]}
{"word":"acidy","summary":{"en":"Acidy means sour/acid-like in taste or smell, or (informally) sharp and biting in tone.","zh":"Acidy 指（非正式）味道或气味带酸、刺鼻；也可指（非正式）言语语气尖刻、刻薄。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Having a sharp, sour taste or smell, like acid.","zh":"（非正式）带有酸的、刺鼻的味道或气味。"},"examples":[{"en":"The sauce is a bit acidy—add a little sugar to balance it.","zh":"这个酱有点酸刺味——加一点糖来平衡口感。"},{"en":"There was an acidy smell in the air after the spill.","zh":"泄漏后空气里有一股刺鼻的酸味。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) Harsh, cutting, or sarcastic in tone; biting.","zh":"（非正式）语气尖刻的、刻薄的；带讽刺性的。"},"examples":[{"en":"She made an acidy comment about his mistake.","zh":"她对他的错误说了句尖刻的评论。"},{"en":"His reply sounded acidy, even if he didn’t mean it that way.","zh":"他的回复听起来有点刻薄，尽管他可能并非那个意思。"}]}],"synonyms":["acidic","sour","tart","sharp","biting","caustic"],"phonetic":"/ˈæsɪdi/","extraExplanation":["“acidy”多用于口语或非正式写作；更常见、更中性的表达是“acidic”。","在描述食物时，“acidy”通常强调“酸得有点冲/刺”，而“acidic”更偏客观描述（含酸、酸性较强）。"]}
{"word":"acidyl","summary":{"en":"Acidyl is a rare chemistry term meaning an acyl group derived from an acid.","zh":"acidyl 是较少见的化学术语，指由酸衍生的酰基（acyl group）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) An acyl group derived from an acid; the part of a carboxylic acid molecule that remains after the hydroxyl (–OH) is removed (often written as R–C(=O)–).","zh":"（化学）酰基；由酸衍生的基团，通常指羧酸去掉羟基（–OH）后剩下的部分（常写作 R–C(=O)–）。"},"examples":[{"en":"In many reactions, an acidyl (acyl) group is transferred from one molecule to another.","zh":"在许多反应中，酸酰基（酰基）会从一个分子转移到另一个分子。"},{"en":"Acidyl chlorides are highly reactive because the acidyl group is activated by the chlorine.","zh":"酰氯反应性很强，因为酸酰基在氯的作用下被活化。"}]}],"synonyms":["acyl","acyl group"],"phonetic":"/ˈæsɪdɪl/","extraExplanation":["“acidyl”是较旧或较少见的用词，现代教材与科研写作更常用“acyl（酰基）”。在有机化学里，常见的酰基有：乙酰基（acetyl, CH3CO–）、苯甲酰基（benzoyl, C6H5CO–）。","不要把“acidyl”与“acidic（酸性的）”混淆：acidic是形容词，表示“呈酸性”；acidyl/acyl是名词，表示“某种结构片段/基团”。"]}
{"word":"Acie","summary":{"en":"Acie is mainly used as a personal name or nickname, often related to “Ace.”","zh":"Acie 主要用作人名或昵称，常与“Ace”有关联。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name or nickname (usually masculine) in English-speaking contexts; often a variant of “Ace” or a short form of names beginning with A- (e.g., Acen, Acie as a family nickname).","zh":"英语语境中的名字或昵称（通常偏男性）；常被视为“Ace”的变体，或作为以 A 开头名字的昵称/简写。"},"examples":[{"en":"His name is Acie, but his friends call him Ace.","zh":"他叫 Acie，但朋友们叫他 Ace。"},{"en":"Acie moved to Texas when he was a child.","zh":"Acie 小时候搬到了德州。"}]}],"synonyms":["Ace (nickname)","A.C. (initials as a nickname)"],"phonetic":"/ˈeɪsi/","extraExplanation":["“Acie”更常见于人名（专有名词），不算常用词汇；在小说、家族谱系或美国南部/乡村语境中偶尔能看到。","在发音与感觉上，“Acie”常被当作“Ace-y”（像把 Ace 变成两音节的名字）来读，因此也常与“Ace（王牌/高手）”的积极含义联想在一起。"]}
{"word":"acier","summary":{"en":"“Acier” is a French word meaning “steel.” In English, you usually say “steel.”","zh":"“acier”是法语，意思是“钢”；英语里通常用“steel”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(French word) steel; a hard, strong metal made mostly from iron and carbon.","zh":"（法语词）钢；主要由铁和碳组成的坚硬、结实的金属。"},"examples":[{"en":"In French, “acier” means “steel.”","zh":"在法语里，“acier”意思是“钢”。"},{"en":"The sign says “acier inoxydable,” which means “stainless steel.”","zh":"牌子上写着“acier inoxydable”，意思是“不锈钢”。"}]}],"synonyms":["steel"],"phonetic":"/ˌæsiˈeɪr/","extraExplanation":["“Acier”主要是法语日常词汇；英语里通常直接说“steel”。如果你在产品说明、建筑材料、刀具或厨房用品上看到“acier”，多半是法语标注。","常见搭配：acier inoxydable（不锈钢），acier trempé（淬火钢/硬化钢），acier carbone（碳钢）。","词源上来自拉丁语，和英语“steel”不是同源词；因此拼写相近不代表英语里常用。"]}
{"word":"acierage","summary":{"en":"Acierage means steelmaking, or the steelmaking section of a plant.","zh":"acierage 指“炼钢”，也可指工厂中的“炼钢车间/炼钢区”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the making or production of steel; steelmaking","zh":"炼钢；钢的制造（炼钢过程）"},"examples":[{"en":"The company invested in new technology to improve its acierage process.","zh":"这家公司投资新技术来改进炼钢工艺。"},{"en":"During the industrial boom, local employment grew as acierage expanded.","zh":"在工业繁荣时期，随着炼钢业扩张，当地就业增加了。"}]},{"partOfSpeech":"n.","definition":{"en":"a place or section of a plant where steel is made; a steelworks/steelmaking shop","zh":"炼钢车间；钢厂的炼钢区（炼钢部门）"},"examples":[{"en":"Safety rules are strict in the acierage because of heat and molten metal.","zh":"由于高温和熔融金属，炼钢车间的安全规定非常严格。"},{"en":"He worked nights in the acierage at the old mill.","zh":"他在那家老钢厂的炼钢区上夜班。"}]}],"synonyms":["steelmaking","steel production","steelworks","steel plant"],"phonetic":"/ˌæsɪˈrɑːʒ/","extraExplanation":["“Acierage”是从法语 *acier*（钢）衍生来的词，在英语里相当少见，多见于冶金、工业史或较正式/技术性的文本中。日常英语更常用 *steelmaking*（炼钢）或 *steelworks*（钢厂）。"]}
{"word":"Acieral","summary":{"en":"“Acieral” is not a standard English word; it is most likely a misspelling of “aerial” (in the air) or “aerial” (antenna).","zh":"“Acieral” 不是标准英语词；它很可能是 “aerial”（空中的/与空中有关）或名词 “aerial”（天线）的拼写错误。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Likely a misspelling of “aerial”: relating to the air; happening in the air.","zh":"很可能是 “aerial” 的拼写错误：与空气/空中有关的；在空中发生的。"},"examples":[{"en":"The photographer used an aerial shot to show the whole city.","zh":"摄影师用了一张航拍照片来展示整座城市。"},{"en":"Rescue teams searched the area with aerial support from a helicopter.","zh":"救援队在直升机的空中支援下搜索该区域。"}]},{"partOfSpeech":"n.","definition":{"en":"A device used to receive radio or television signals; an antenna.","zh":"接收广播或电视信号的装置；天线。"},"examples":[{"en":"We need a better aerial to get clear TV reception.","zh":"我们需要更好的天线才能清晰收看电视。"}]}],"synonyms":["airborne","from above","antenna"],"phonetic":"/ˈeriəl/","extraExplanation":["“Aerial” 常见搭配：aerial view（鸟瞰/航拍视角）, aerial photography（航拍摄影）, aerial attack（空袭）, aerial cable（架空电缆）。","如果你想表达“酸性的（aceral）/钢的（acier-，法语里 acier=钢）”等含义，请告诉我你看到这个词的句子或来源，我可以帮你确认真正的拼写和意思。"]}
{"word":"acieral","summary":{"en":"**acieral (acerial)** means “related to maple trees.”","zh":"**acieral（常作 acerial）**指“与枫树有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Often spelled **acerial**.) Relating to or coming from a **maple tree** (genus *Acer*).","zh":"（常见拼写为 **acerial**。）与**枫树**（*Acer* 属）有关的；来自枫树的。"},"examples":[{"en":"The forest has strong **acerial** influence, with maples dominating the understory.","zh":"这片森林带有明显的**枫树特征**，下层植被以枫树为主。"},{"en":"They studied **acerial** leaves to compare different maple species.","zh":"他们研究**枫树叶**来比较不同的枫树物种。"}]}],"synonyms":["maple","acerine","related to maple"],"phonetic":"/əˈsɪriəl/","extraExplanation":["“acieral”在现代英语里很少见，多数情况下是把 **acerial** 拼错了。**acerial** 来自拉丁语词根 **Acer**（枫树属名）。在植物学、林学或自然写作中可能出现，但日常英语更常直接说 **maple**（枫树的）或 **maple-leaf / maple tree**。"]}
{"word":"acierate","summary":{"en":"A rare, old-fashioned verb meaning “to sharpen; to make pointed.”","zh":"一个罕见的古语动词，意思是“使变尖/变锐；使锋利”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare/archaic) To make sharp or pointed; to sharpen (often like a needle).","zh":"（罕见/古语）使变尖、变锐；使锋利（常指像针一样尖）。"},"examples":[{"en":"The smith used a fine file to acierate the tip of the tool.","zh":"铁匠用细锉把工具的尖端磨得更尖。"},{"en":"Some older texts describe acids that can acierate metal surfaces.","zh":"一些较早的文本会描述酸能让金属表面变得更锋利、尖锐。"}]}],"synonyms":["sharpen","point","hone","whet","make pointed"],"phonetic":"/əˈsɪriˌeɪt/","extraExplanation":["“acierate”在现代英语中非常少见，更多见于旧书或技术/文学性较强的语境。日常表达通常用“sharpen”“make pointed”。","词源上与拉丁语“acies”（刃、锋利的边缘）有关，也与“acid/acute”等词的“尖锐”概念有亲缘关系。"]}
{"word":"acierated","summary":{"en":"“Acierated” is a rare word meaning “made into steel” or “steel-like and hardened.”","zh":"“acierated”是个较罕见的词，意为“炼成钢的”或“呈钢质、像钢一样坚硬的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Made into steel; made steel-like or hardened like steel.","zh":"（罕见）被炼成钢的；呈钢质的；像钢一样坚硬的。"},"examples":[{"en":"The blade was heat-treated until it became acierated and held a sharp edge.","zh":"刀刃经过热处理后变得acierated（呈钢质/像钢一样坚硬），能保持锋利。"},{"en":"In older technical writing, iron was described as ‘acierated’ after adding carbon.","zh":"在较早的技术写作中，铁在加入碳之后会被描述为“acierated（炼成钢）”。"}]},{"partOfSpeech":"v.","definition":{"en":"Past form of the rare verb “acierate”: to convert into steel or make steel-like (especially by adding carbon or by heat treatment).","zh":"罕见动词“acierate”的过去式：使成钢；使钢化；使像钢一样坚硬（尤指加碳或热处理）。"},"examples":[{"en":"The smith acierated the metal through repeated heating and cooling.","zh":"铁匠通过反复加热和冷却把金属acierated（钢化/使成钢）。"},{"en":"They claimed the process acierated soft iron into a stronger material.","zh":"他们声称这种工艺能把软铁acierated（炼成更坚固的材料）。"}]}],"synonyms":["steel-like","hardened","steeled","carburized","case-hardened"],"phonetic":"/ˈæs.i.əˌreɪ.tɪd/","extraExplanation":["这个词在现代英语里非常少见，多见于旧式冶金/材料学语境。词根来自法语 acier（钢）。","学习中更常用的表达是：steel / steel-like / hardened / case-hardened / carburized（渗碳的）。","注意容易与 acerated（针状的、尖细的；多用于植物学/形态描述）混淆：acierated 关联“钢”，acerated 关联“尖/针形”。"]}
{"word":"acierates","summary":{"en":"“acierates” means “hardens/steels; makes stronger like steel” (rare, literary).","zh":"“acierates”意为“使如钢般坚硬/坚强”，较罕用、偏文学表达。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare) to make something like steel; to harden or strengthen (often used in literary writing).","zh":"（罕用）使……如钢一般；使坚硬、使坚强（常见于文学语境）。"},"examples":[{"en":"Hardship acierates the will, but kindness keeps it human.","zh":"苦难会使意志如钢般坚硬，但善意让它仍有人性。"},{"en":"The soldier’s years of training acierated his resolve.","zh":"士兵多年的训练使他的决心变得坚如钢铁。"}]}],"synonyms":["hardens","steels","toughens","strengthens"],"phonetic":"/əˈsiəreɪts/","extraExplanation":["“acierates”通常是动词“acierate”的第三人称单数（he/she/it acierates）。这个词在现代英语中非常少见，更常用的表达是“harden”“steel”“toughen”（如：steel one’s nerves 让自己镇定/更坚强）。","词源上与法语“acier”（钢）有关，因此常带“像钢一样坚硬/坚强”的比喻色彩，在较文学化的句子中更可能出现。"]}
{"word":"acierating","summary":{"en":"“Accelerating” means increasing speed or becoming faster, or the process of making something faster.","zh":"“Accelerating”表示（速度或发展）加快，或指“加速/促使加快”的过程。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"increasing in speed, rate, or activity; happening faster and faster","zh":"（速度、增长率或活动）加快的；越来越快的"},"examples":[{"en":"The accelerating train made it hard to stand up.","zh":"火车加速时，很难站稳。"},{"en":"We are seeing accelerating changes in technology.","zh":"我们正在看到科技变化加速。"}]},{"partOfSpeech":"v.","definition":{"en":"the act of increasing speed or making something happen faster (present participle of “accelerate”)","zh":"加速；促使更快发生（“accelerate”的现在分词）"},"examples":[{"en":"The company is accelerating production to meet demand.","zh":"公司正在加快生产以满足需求。"},{"en":"He is accelerating toward the finish line.","zh":"他正在向终点加速冲刺。"}]}],"synonyms":["speeding up","quickening","gaining speed","ramping up"],"phonetic":"/əkˈsɛləˌreɪtɪŋ/","extraExplanation":["你输入的“acierating”很可能是拼写错误；英语里更常见、正确的词是“accelerating”（来自 accelerate + -ing）。","accelerate 常用于三类语境：交通/运动（车、跑步加速）、经济/数据（增长率加快）、变化趋势（变化进程加速）。"]}
{"word":"acieration","summary":{"en":"“Acieration” is not a standard English word; it’s usually a misspelling of “aeration” or “acceleration.”","zh":"“acieration” 不是标准英语词，通常是 “aeration”（通气/充气）或 “acceleration”（加速）的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or incorrect spelling; in most contexts people mean “aeration” (adding air) or “acceleration” (speeding up).","zh":"非标准或错误拼写；多数语境下人们通常想写的是 “aeration”（通气/充气）或 “acceleration”（加速）。"},"examples":[{"en":"I couldn’t find “acieration” in a dictionary—did you mean “aeration”?","zh":"我在词典里找不到 “acieration”，你是不是想写 “aeration”（通气）？"},{"en":"If you mean “speeding up,” the correct word is “acceleration,” not “acieration.”","zh":"如果你想表达“加快速度”，正确的词是 “acceleration”，不是 “acieration”。"}]}],"synonyms":["aeration","acceleration"],"phonetic":"/ˌæsəˌreɪʃən/","extraExplanation":["“acieration”不是常见英语词，通常是拼写混淆导致的：\n- aeration：/ˌerˈeɪʃən/，常用于土壤、草坪、葡萄酒“醒酒/通气”等语境。\n- acceleration：/əkˌseləˈreɪʃən/，常用于物理、车辆、学习进度等“加速/加快”。\n如果你提供一句原句（上下文），我可以帮你判断到底应该用哪一个。"]}
{"word":"acies","summary":{"en":"“Acies” is the plural of the rare noun “acies,” meaning either sharp edges (of blades) or battle lines (military formations).","zh":"“acies”是罕见名词“acies”的复数，可指刀刃等“刃口”，也可指军队的“战线/列阵”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of acies: a sharp edge or cutting point (especially of a sword or blade).","zh":"acies 的复数：锋利的刃口或切割边（尤指刀剑等利器的刃）。"},"examples":[{"en":"The historian described the acies of the Roman swords as razor-sharp.","zh":"那位历史学家形容罗马剑的刃口（acies）锋利如剃刀。"},{"en":"Light flashed along the acies of the knives on the table.","zh":"光在桌上刀具的刃口（acies）上闪过。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of acies: a battle line; an arranged line or rank of soldiers.","zh":"acies 的复数：战阵；军队排列成的战斗队形或战线。"},"examples":[{"en":"The general formed two acies before advancing.","zh":"将军在推进前布成两道战线（acies）。"},{"en":"In the epic, the acies held firm despite the charge.","zh":"在史诗中，战阵（acies）面对冲锋仍岿然不动。"}]}],"synonyms":["edges","blades","battle lines","battle formations","ranks"],"phonetic":"/ˈeɪʃiz/","extraExplanation":["“acies”源自拉丁语，原意与“尖锐、锋利”相关，因此既可指“刃口”，也可引申为军队“列阵”的“锋线”。","在现代英语里它非常少见，多出现在古典学、历史写作或学术场景；日常表达通常用“edge / blade / battle line / battle formation”。"]}
{"word":"aciform","summary":{"en":"Aciform means needle-shaped, especially describing leaves in botany.","zh":"aciform 指“针形的、针状的”，尤其用于植物学中形容叶子。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"needle-shaped; having a long, narrow, pointed form (often used in botany to describe leaves).","zh":"针形的；针状的（常用于植物学，形容叶子细长而尖）。"},"examples":[{"en":"Pine trees have aciform leaves that help reduce water loss.","zh":"松树的叶子呈针形，有助于减少水分流失。"},{"en":"The botanist described the plant as having aciform needles in tight clusters.","zh":"植物学家描述这种植物的针形叶成簇紧密生长。"}]}],"synonyms":["needle-shaped","acerose","spine-like"],"phonetic":"/ˈæsɪˌfɔrm/","extraExplanation":["词源：来自拉丁语 *acus*（针）+ *-form*（形状），字面意思就是“针的形状”。在科学写作里常见于植物形态描述（如松、云杉等针叶树）。"]}
{"word":"acil","summary":{"en":"“Acil” is Turkish for “urgent/emergency,” commonly used on signs like emergency departments or emergency exits.","zh":"“Acil”是土耳其语，表示“紧急/急诊”，常用于急诊科或紧急出口等标识。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"A Turkish word meaning “urgent” or “emergency,” often seen on signs (e.g., hospitals, emergency exits).","zh":"土耳其语，意思是“紧急的 / 急救的 / 急件的”，常见于标识（如医院、紧急出口）。"},"examples":[{"en":"The sign says “Acil,” so this is the emergency department.","zh":"标牌上写着“Acil”，所以这里是急诊科。"},{"en":"“Acil çıkış” means “emergency exit” in Turkish.","zh":"土耳其语里的“Acil çıkış”意思是“紧急出口”。"}]},{"partOfSpeech":"other","definition":{"en":"A label used in Turkish contexts to mark something as urgent (e.g., an urgent request or message).","zh":"在土耳其语语境中用作“加急/紧急”的标记（如加急请求、紧急消息）。"},"examples":[{"en":"He marked the email as “acil” to show it needed immediate attention.","zh":"他把邮件标为“acil”，表示需要立刻处理。"}]}],"synonyms":["urgent","emergency","critical"],"phonetic":"/ɑːˈdʒil/","extraExplanation":["“acil”在土耳其语里非常常用，尤其在公共场所标识上：例如医院急诊常写“ACİL”，紧急出口是“acil çıkış”。如果你是在英文语境中看到它，通常表示该文本或地点与土耳其语有关。"]}
{"word":"Acilia","summary":{"en":"Acilia is mainly used as a feminine name and as the name of an ancient Roman family group (gens Acilia).","zh":"Acilia 主要用作女性名字，也指古罗马的一个氏族（Acilia 氏族 / gens Acilia）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a feminine name (given name) used in some cultures; it is often associated with ancient Roman roots.","zh":"（女性）名字；在一些文化中使用，常与古罗马渊源有关。"},"examples":[{"en":"Acilia is a rare name, but it sounds elegant and classical.","zh":"Acilia 是个比较少见的名字，但听起来很优雅、很古典。"},{"en":"They named their daughter Acilia because they liked Roman history.","zh":"他们给女儿取名叫 Acilia，因为他们喜欢罗马历史。"}]},{"partOfSpeech":"other","definition":{"en":"in Ancient Rome, the name of a Roman family group (the gens Acilia), known from historical records and inscriptions.","zh":"古罗马的一个家族氏族名（Acilia 氏族 / gens Acilia），见于历史记载与碑铭。"},"examples":[{"en":"The gens Acilia appears in texts about Roman politics and public life.","zh":"Acilia 氏族会出现在关于罗马政治与公共生活的文本中。"},{"en":"In a museum, we saw an inscription mentioning the Acilii (members of the gens Acilia).","zh":"在博物馆里，我们看到一块碑铭提到 Acilii（Acilia 氏族成员的复数形式）。"}]}],"synonyms":["gens Acilia","Acilius (related form)","Acilii (plural, family members)"],"phonetic":"/əˈsɪliə/","extraExplanation":["Acilia 是拉丁语家族名体系中的一部分：罗马人常用“氏族名（gens）+个人名”等来标识家族与身份。Acilia 对应的氏族名常写作 gens Acilia；其成员的复数形式常见为 Acilii。","在英语语境里，Acilia 多作为专有名词出现（人名或罗马氏族名），通常不译为普通词义。读历史类文章时，看到 Acilia/Acilius/Acilii 往往是在说同一姓族系统的不同形式。"]}
{"word":"aciliate","summary":{"en":"Facilitate means “make something easier” or “help a process happen smoothly.”","zh":"Facilitate 指“使某事更容易/更顺利”，也可表示“促进、促成”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something easier or more likely to happen; to help a process go smoothly","zh":"使（某事）更容易；促进；协助使过程更顺利"},"examples":[{"en":"The new app will facilitate communication between teachers and parents.","zh":"这个新应用将促进老师和家长之间的沟通。"},{"en":"Good lighting can facilitate reading and reduce eye strain.","zh":"良好的照明能让阅读更轻松，并减少眼睛疲劳。"},{"en":"The moderator’s job is to facilitate the discussion, not dominate it.","zh":"主持人的工作是推动讨论顺利进行，而不是主导一切。"}]},{"partOfSpeech":"vt.","definition":{"en":"(formal) to provide conditions or support that help something develop or succeed","zh":"（较正式）为（发展/成功）提供条件或支持；促成"},"examples":[{"en":"The program facilitates job training for new immigrants.","zh":"该项目为新移民提供就业培训支持。"},{"en":"Clear rules facilitate teamwork in a busy workplace.","zh":"明确的规则能促成繁忙职场中的团队协作。"}]}],"synonyms":["help","make easier","enable","promote","assist"],"phonetic":"/fəˈsɪləˌteɪt/","extraExplanation":["“aciliate” 不是常见英语单词；你很可能想写的是 **facilitate**（常见拼写错误：*faciliate*）。如果你原本想问的是其他词（如 *affiliate* / *acclimate*），告诉我语境句子，我可以帮你确认。"]}
{"word":"aciliated","summary":{"en":"“aciliated” is not standard; it usually means “affiliated” (officially connected/linked).","zh":"“aciliated”不是标准用法；通常是想写“affiliated”，表示“隶属/关联/有正式联系”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Common misspelling) Not a standard English word; it is most often intended to mean “affiliated.”","zh":"（常见拼写错误）这不是标准英语单词；通常想表达的是“affiliated（隶属/关联）”。"},"examples":[{"en":"I couldn’t find “aciliated” in a dictionary—did you mean “affiliated”?","zh":"我在词典里找不到“aciliated”——你是不是想写“affiliated”？"}]},{"partOfSpeech":"adj.","definition":{"en":"Connected with or officially linked to an organization, group, or institution.","zh":"与某个组织/团体/机构有关联或正式隶属的。"},"examples":[{"en":"She works at a hospital affiliated with the university.","zh":"她在一家隶属于那所大学的医院工作。"},{"en":"Only affiliated members can use this service.","zh":"只有关联/隶属成员才能使用这项服务。"}]},{"partOfSpeech":"vt.","definition":{"en":"To connect (someone or something) with an organization or group.","zh":"使（某人/某事）与某组织或团体建立联系；使隶属。"},"examples":[{"en":"The clinic is affiliated with a larger medical network.","zh":"这家诊所隶属于一个更大的医疗网络。"},{"en":"He affiliated himself with the local art community.","zh":"他加入并与本地艺术圈建立了联系。"}]}],"synonyms":["connected","associated","linked","attached"],"phonetic":"əˈfɪliˌeɪtɪd","extraExplanation":["“aciliated”最常见是把 **affiliated** 拼错了：注意是 **aff-** 开头（双写 f），中间有 **-ili-**，结尾常见 **-ated / -ated** 变化（affiliate / affiliated）。","如果你原本想表达“适应环境/习惯于”，你可能想写的是 **acclimated / acclimatized**；如果你想说“加了酸/略酸的”，可能是 **acidulated**。你可以告诉我你的句子，我能帮你确认最合适的词。"]}
{"word":"Acilius","summary":{"en":"Acilius is a Roman clan (gens) name used as a family name in ancient Roman personal names.","zh":"Acilius 是古罗马的氏族名（家族名），常作为罗马人全名中的一部分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Roman family name (nomen) meaning someone belonging to the gens (clan) Acilia; used in ancient Rome as part of a person’s full name.","zh":"罗马的氏族（gens）名称之一：Acilia（阿基利亚氏族）的家族名（nomen）；在古罗马作为人名的一部分使用。"},"examples":[{"en":"Gaius Acilius was a Roman statesman mentioned in historical accounts.","zh":"历史记载中提到过一位罗马政治人物盖乌斯·阿基利乌斯（Gaius Acilius）。"},{"en":"In Roman names, “Acilius” usually shows the person’s clan or family group.","zh":"在罗马人名中，“Acilius”通常表示这个人所属的氏族或家族群体。"}]}],"synonyms":["Acilia (gens)"],"phonetic":"/əˈsɪliəs/","extraExplanation":["“Acilius”是拉丁语的罗马氏族名（gens 名称），常见于三段式罗马姓名：praenomen（名）+ nomen（氏族名）+ cognomen（支系/绰号）。例如：Gaius（名）+ Acilius（氏族名）+ Glabrio（支系名）。","英语文本里它多作为专有名词出现（人名/家族名），不常作为普通词汇使用；读史书、古典文学或铭文时更容易遇到。"]}
{"word":"acilius","summary":{"en":"Acilius is an ancient Roman family/clan name found in Latin and historical texts.","zh":"Acilius 是古罗马的氏族姓/家族名，常见于拉丁文与历史文献中的人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Latin/Roman family name (a nomen), referring to someone from the ancient Roman gens (clan) Acilia; used in historical names such as Manius Acilius Glabrio.","zh":"拉丁/古罗马的氏族姓（nomen），指古罗马“阿基利亚氏族（gens Acilia）”的人；常见于历史人名中，如 Manius Acilius Glabrio（马尼乌斯·阿基利乌斯·格拉布里奥）。"},"examples":[{"en":"Manius Acilius Glabrio was a Roman consul mentioned in historical accounts.","zh":"历史记载中提到马尼乌斯·阿基利乌斯·格拉布里奥是一位罗马执政官。"},{"en":"In Latin inscriptions, “Acilius” can appear as part of a person’s formal name.","zh":"在拉丁碑铭里，“Acilius”可能作为一个人正式姓名的一部分出现。"}]}],"synonyms":["gens Acilia","Acilia (feminine form)"],"phonetic":"/əˈsɪliəs/","extraExplanation":["“Acilius”通常不是现代英语里的普通词汇，而是出现在古罗马史、拉丁文碑铭或古典学研究中的专有名词。","古罗马男性姓名常由三部分组成：praenomen（名）+ nomen（氏族姓）+ cognomen（支系/绰号）。其中“Acilius”属于nomen，表示其隶属Acilia氏族。","不同资料中对古典姓名的英语读法可能略有差异；课堂或纪录片里也可能听到更“拉丁化”或更“英语化”的发音。"]}
{"word":"Acima","summary":{"en":"“Acima” is Portuguese for “above / over / upward,” often seen in phrases like “acima de …” (“more than / above …”).","zh":"“Acima”是葡萄牙语，表示“在上面／超过／向上”，常见于“acima de …”（高于／超过……）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(from Portuguese) “above; on top of; over; upward.” Often used in signs, brand names, or Portuguese-language text.","zh":"（葡萄牙语）“在上面；在顶部；在……之上；向上”。常见于葡语语境、标识或品牌名称中。"},"examples":[{"en":"In Portuguese, “acima” usually means “above,” as in “acima de 10” (above 10).","zh":"在葡萄牙语中，“acima”通常表示“在……之上”，如“acima de 10”（大于10／超过10）。"},{"en":"The caption says “acima,” telling you to look up or look at the part above.","zh":"说明文字写着“acima”，是在提示你看上方或上面的部分。"}]},{"partOfSpeech":"phrase","definition":{"en":"As a fixed phrase in Portuguese: “acima de …” = “above / more than …” (numbers, limits, temperatures, ages, etc.).","zh":"作为葡语固定搭配：“acima de …”＝“高于／超过……”，常用于数字、限度、温度、年龄等。"},"examples":[{"en":"“Acima de 18” means “over 18.”","zh":"“Acima de 18”意思是“18岁以上”。"},{"en":"“Acima de tudo” means “above all / most importantly.”","zh":"“Acima de tudo”意思是“最重要的是／尤其是”。"}]}],"synonyms":["above","over","upwards","on top"],"phonetic":"/əˈsiːmə/","extraExplanation":["“Acima”是葡萄牙语常用词，在巴西葡语和欧洲葡语里都很常见。单独出现时多表示“在上方/向上”，与“de”连用（acima de）时更像英语的“above/more than”。","如果你是在英文语境里看到“Acima”，它也可能是店名、品牌名或人名/地名的一部分，这种情况下通常不翻译，按名称理解即可。"]}
{"word":"acinaceous","summary":{"en":"Acinaceous means “grape-like,” describing clusters of small rounded units (common in biology/medicine).","zh":"Acinaceous 意为“像葡萄串一样的（腺泡状）”，常用于生物学/医学描述由许多小圆单位成簇组成的结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany/Anatomy) Grape-like; made up of small rounded parts clustered together, like a bunch of grapes.","zh":"（植物学/解剖学）似葡萄的；由许多小而圆的单位成簇组成的（像一串葡萄）。"},"examples":[{"en":"The pancreas contains acinaceous glands that secrete digestive enzymes.","zh":"胰腺含有腺泡状（acinaceous）的腺体，用来分泌消化酶。"},{"en":"Under the microscope, the acinaceous clusters looked like tiny grapes.","zh":"在显微镜下，这些腺泡状的簇看起来像一小串小葡萄。"}]}],"synonyms":["acinar","acinous","clustered","grape-like"],"phonetic":"/ˌæsɪˈneɪʃəs/","extraExplanation":["该词较常见于医学与生物学语境，如“acinaceous gland / acinar (acinous) gland（腺泡/腺泡状腺）”。它来自拉丁语 acinus，意为“葡萄的一粒/葡萄串中的小颗粒”，因此常用来描述“像葡萄串一样成簇的结构”。在现代英文中，更常用的近义专业词是 acinar 或 acinous。"]}
{"word":"acinaces","summary":{"en":"An acinaces is an ancient Persian short sword or dagger, a rare literary/historical term in English.","zh":"acinaces 指古波斯的短剑或匕首，在英语里多属罕见的古典/历史用词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short Persian sword or dagger (often slightly curved), used in ancient Persia and sometimes mentioned in classical or historical writing.","zh":"（古波斯的）短剑；匕首（常略带弯曲），多见于古代波斯，也常出现在古典或历史文献中。"},"examples":[{"en":"The museum display included an acinaces with an ornate gold hilt.","zh":"博物馆展柜里有一把 acinaces，配着华丽的金色剑柄。"},{"en":"In some classical texts, soldiers are described as carrying an acinaces at the belt.","zh":"在一些古典文献中，士兵被描写为腰间佩带 acinaces。"}]}],"synonyms":["dagger","short sword","blade"],"phonetic":"/ˌæsəˈneɪsiːz/","extraExplanation":["“acinaces”来自拉丁语 acinaces（源头与古波斯相关），在英语里多见于考古、古典学、历史写作中，属于比较“书面/学术”的词。日常英语更常用 sword（剑）、dagger（匕首）或 short sword（短剑）。","这个词在一些关于波斯帝国（如阿契美尼德王朝）或希腊—波斯战争背景的英文材料里更容易遇到，用来营造“古代武器/异域风格”的历史氛围。"]}
{"word":"acinacifoliate","summary":{"en":"Acinacifoliate describes plants with scimitar- or sword-shaped leaves.","zh":"acinacifoliate 用来形容叶片呈弯刀状或剑状的植物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having scimitar- or sword-shaped leaves (long, curved, and tapering).","zh":"（植物学）具有弯刀状/剑状叶的；叶片细长、弯曲并逐渐变尖。"},"examples":[{"en":"Some succulents have acinacifoliate leaves that curve outward like a blade.","zh":"一些多肉植物的叶子呈弯刀状，向外弯曲像刀刃一样。"},{"en":"The field guide notes an acinacifoliate leaf shape as a key identification feature.","zh":"野外图鉴把弯刀状叶形列为重要的鉴别特征。"}]}],"synonyms":["sword-leaved","scimitar-shaped","falcate","ensiform"],"phonetic":"/əˌsɪnəˈsɪfəliˌeɪt/","extraExplanation":["词源上可拆为拉丁语/希腊化词根：acinac- 与“弯刀（scimitar）”相关，-foliate 表示“有……叶/叶状”。因此它字面意思就是“弯刀状的叶”。","这是一个非常偏专业的植物形态学词汇，日常英语中更常用的表达包括 sword-shaped leaves（剑形叶）、scimitar-shaped leaves（弯刀形叶）、falcate leaves（镰刀形叶，亦常见于植物学）。"]}
{"word":"acinacifolious","summary":{"en":"A rare botanical adjective meaning “having scimitar-shaped (curved sword-like) leaves.”","zh":"一个罕见的植物学形容词，意为“叶片呈弯刀状（弧形剑状）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having leaves shaped like a scimitar (a curved sword); sword‑shaped and often slightly curved.","zh":"（植物）叶片呈弯刀状（弧形剑状）；通常细长、略弯。"},"examples":[{"en":"The shrub is described as acinacifolious, with narrow, curved leaves.","zh":"这种灌木被描述为 acinacifolious，叶片狭长并略微弯曲。"},{"en":"In the field guide, acinacifolious foliage helps distinguish the species from similar plants.","zh":"在野外图鉴中，acinacifolious 的叶形特征有助于把该物种与相似植物区分开来。"}]}],"synonyms":["scimitar-shaped","sword-leaved","ensiform","sabre-shaped"],"phonetic":"/ˌæsɪˌnæsɪˈfoʊliəs/","extraExplanation":["这是一个非常罕见、偏学术的植物学形容词，常见于物种描述、分类文献或较正式的植物描写中。","词源上可拆为 acinac-（来自拉丁语 *acinaces*，意为“弯刀/短剑”）+ -folious（“有……叶的/叶形的”）。因此字面意思就是“弯刀形叶”。","更常用、更容易懂的近义表达包括：*sword-leaved*（剑叶的）、*scimitar-shaped*（弯刀状的）；在植物学里也常见 *ensiform*（剑形的）。"]}
{"word":"acinaciform","summary":{"en":"Acinaciform means “scimitar-shaped,” especially used to describe curved, tapering leaves in botany.","zh":"acinaciform 意为“弯刀形的”，尤常用于植物学描述弯曲并渐尖的叶片。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shaped like a short curved sword (a scimitar); curved and tapering—often used in botany to describe leaves.","zh":"（形状）像短弯刀（弯曲并渐尖）的；常用于植物学形容叶片形状。"},"examples":[{"en":"The plant has acinaciform leaves that curve outward like small blades.","zh":"这种植物的叶子呈弯刀形，像小刀片一样向外弯曲。"},{"en":"Botanists described the succulent’s acinaciform foliage as a key identifying feature.","zh":"植物学家把这种多肉植物的弯刀形叶片描述为重要的识别特征。"}]}],"synonyms":["scimitar-shaped","sword-shaped","blade-shaped","curved","falcate"],"phonetic":"/ˌæsɪˈnæsɪˌfɔrm/","extraExplanation":["词源：来自拉丁语 *acinaces*（一种波斯弯刀）+ 英语形容词后缀 *-form*（“……形的”）。因此它多见于科学写作（尤其是植物学/生物学）而不常用于日常口语。","用法提示：它强调“弯曲像刀、逐渐变尖”的外形；在植物描述中常与“leaf/leaves, blade, foliage”等词搭配。"]}
{"word":"acinacious","summary":{"en":"Acinaceous describes something that looks like a cluster of grapes or small berries, often used in biology/medicine.","zh":"Acinaceous 指“葡萄状/成簇如葡萄”的外观，常用于生物学或医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Shaped like or related to a cluster of small berries or grapes (a bunch).","zh":"（植物学）葡萄状的；像一串小浆果/葡萄那样成簇的。"},"examples":[{"en":"Under the microscope, the cells formed an acinaceous pattern, like tiny grapes.","zh":"在显微镜下，这些细胞呈现葡萄状的排列，就像一串串小葡萄。"},{"en":"Some glands have an acinaceous structure, made up of many small sac-like units.","zh":"有些腺体具有葡萄状结构，由许多小囊状单位组成。"}]}],"synonyms":["grapelike","clustered","botryoid","aciniform"],"phonetic":"ˌæsɪˈneɪʃəs","extraExplanation":["这个词很少用于日常英语，更多见于植物学、解剖学或医学写作，用来描述“像葡萄串一样成簇”的外观。","词源来自拉丁语 acinus，意思是“葡萄（果）/葡萄串上的小颗粒”。因此它常用来形容腺泡（acinus）或葡萄状的细胞排列。","你输入的 acinacious 可能是拼写误差；常见标准拼写是 acinaceous。"]}
{"word":"acinacity","summary":{"en":"“Acinacity” is not standard English; it is probably a misspelling of “tenacity” or “audacity.”","zh":"“acinacity”不是标准英语；很可能是“tenacity”或“audacity”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard/unknown spelling. It is not a recognized English word in most dictionaries; it is likely a misspelling of “tenacity” (persistence) or “audacity” (boldness).","zh":"非标准/不常见拼写。它通常不被主流英语词典收录；很可能是把 “tenacity”（坚韧不拔）或 “audacity”（大胆、鲁莽）拼错了。"},"examples":[{"en":"I couldn’t find “acinacity” in a dictionary—did you mean “tenacity”?","zh":"我在词典里找不到 “acinacity”——你是不是想写 “tenacity”？"},{"en":"If you mean persistence, the correct word is “tenacity.”","zh":"如果你想表达“坚持不懈”，正确的词是 “tenacity”。"}]}],"synonyms":["tenacity","audacity","persistence","boldness"],"phonetic":"/ˈtɛnəsəti/","extraExplanation":["“acinacity”看起来像把 “tenacity” 误写成了以 a- 开头，或把 “audacity/tenacity” 的拼写混在一起。你可以告诉我句子原文（上下文），我能更准确判断你想表达的是“坚持”还是“大胆/鲁莽”。"]}
{"word":"acinar","summary":{"en":"Acinar means “related to an acinus,” a tiny sac-like unit in glands or organs.","zh":"Acinar 指“与腺泡有关的”，腺泡是腺体或器官中微小的囊状基本单位。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy/Biology) Relating to an acinus—any small, sac-like unit in a gland or organ (such as the pancreas, salivary glands, or lungs) where secretion or gas exchange happens.","zh":"（解剖/生物）腺泡的；与“腺泡（acinus）”有关的——指腺体或器官中小而囊状的基本单位（如胰腺、唾液腺或肺），常是分泌或气体交换发生的部位。"},"examples":[{"en":"The pancreas contains acinar cells that produce digestive enzymes.","zh":"胰腺含有腺泡细胞，用来产生消化酶。"},{"en":"Doctors may describe a tumor as having an acinar pattern under the microscope.","zh":"医生可能会在显微镜下把某种肿瘤描述为“腺泡样（acinar）结构”。"}]}],"synonyms":["acinous","alveolar (in some contexts)"],"phonetic":"ˈæsɪnɚ","extraExplanation":["“Acinar”来自拉丁语 acinus，原意与“浆果/葡萄串的颗粒”有关，所以在医学里常用来形容“像一串小囊泡/小果粒一样的结构”。","在医学写作中，acinar 常与细胞或结构搭配：acinar cells（腺泡细胞）、acinar glands（腺泡状腺体）、acinar pattern（腺泡样结构）。"]}
{"word":"acinarious","summary":{"en":"A rare technical adjective meaning “acinar; made of or resembling small sac-like units (acini), often grape-like in clusters.”","zh":"一个较少见的术语形容词，意思是“腺泡状的；由腺泡构成的；外观像葡萄串一簇簇的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(technical) Having the form of, relating to, or made up of small sac-like units called acini (often describing glands), or clustered like a bunch of grapes.","zh":"（术语）呈腺泡状的；与腺泡（acini）有关的；由许多小囊状腺泡组成的（常形容腺体），也可指“像葡萄串一样成簇”的。"},"examples":[{"en":"The pancreas contains acinar cells that produce digestive enzymes.","zh":"胰腺含有腺泡细胞，会分泌消化酶。"},{"en":"Under the microscope, the tissue shows an acinarious (grape-like) pattern.","zh":"在显微镜下，这种组织呈现腺泡状（类似葡萄串）的结构。"}]}],"synonyms":["acinar","acinous","grape-like","clustered"],"phonetic":"/əˈsaɪnəriəs/","extraExplanation":["“acinarious”在现代英语里非常少见，更常见的写法是 **acinar** 或 **acinous**，意思基本相同：指由许多腺泡（小囊状结构）构成的腺体组织，或外观像葡萄串一簇簇的结构。","词源来自拉丁语 **acinus**，意为“葡萄/浆果”。医学与生物学中常把腺泡结构比喻为“葡萄串”，帮助理解其形态。"]}
{"word":"acinary","summary":{"en":"Acinary means “related to an acinus,” a small sac-like or grape-like unit in glandular tissue.","zh":"Acinary 指“与腺泡（acinus）有关的”，即腺体中小囊状或葡萄状的基本结构单位。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an acinus (a small, berry-like cluster or sac), especially in glands such as the pancreas, salivary glands, or lungs.","zh":"与“腺泡/腺泡体（acinus）”有关的；尤指与胰腺、唾液腺或肺等器官中的小囊状/葡萄状结构有关的。"},"examples":[{"en":"The pancreas has acinary cells that produce digestive enzymes.","zh":"胰腺含有腺泡细胞（acinary cells），负责分泌消化酶。"},{"en":"Inflammation can damage acinary tissue and reduce enzyme secretion.","zh":"炎症可能损伤腺泡组织，从而降低酶的分泌。"}]}],"synonyms":["acinar","acinous","glandular"],"phonetic":"/ˈæsɪnəri/","extraExplanation":["“acinary”主要用于医学与生物学语境，来自“acinus（腺泡）”，常见搭配有：acinary cells（腺泡细胞）、acinary tissue（腺泡组织）、acinary structure（腺泡结构）。","在一些领域里也会见到更常用的同义形容词“acinar”（如：acinar cells）。两者意思接近，但具体用法常随学科或作者习惯而定。"]}
{"word":"acinebacter","summary":{"en":"A (commonly misspelled) scientific term referring to Acinetobacter, a genus of bacteria; some types can cause hospital infections.","zh":"一个（常被拼错的）科学术语，通常指不动杆菌属；其中一些类型会导致医院感染。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled “Acinetobacter”) a genus of bacteria, some species of which can cause hospital-acquired infections.","zh":"（通常拼作“Acinetobacter”）不动杆菌属；其中一些菌种可引起医院获得性感染。"},"examples":[{"en":"Acinetobacter can survive on surfaces for a long time in hospitals.","zh":"不动杆菌在医院环境的物体表面上可能存活很久。"},{"en":"The lab report identified Acinetobacter as the cause of the infection.","zh":"化验报告确认不动杆菌是感染的原因。"}]}],"synonyms":["Acinetobacter (standard spelling)"],"phonetic":"/ˌæsɪˌniːtoʊbækˈtɪr/","extraExplanation":["“acinebacter”不是常见的标准拼写；最常见、医学与微生物学上通用的写法是 **Acinetobacter**（不动杆菌）。如果你是在报告、论文或检验单上看到这个词，建议核对原文是否为拼写错误。","词源提示：Acinetobacter 来自希腊语，含义接近“不能移动的”（a- 表示“无/不”，kinesis 表示“运动”），因为早期观察认为它们不具运动性。","学习与使用场景：这个词多见于医疗与公共卫生语境，常与“hospital-acquired infection（医院获得性感染）”“antibiotic resistance（耐药性）”等搭配出现。"]}
{"word":"Acineta","summary":{"en":"Acineta is a scientific name used for a genus of orchids, and also for a genus of microscopic suctorian ciliates (context decides which).","zh":"Acineta 是一个学名：既可指兰科的阿西涅塔属，也可指显微生物中的阿西涅塔属（具体看语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical American orchids known for hanging flower clusters and pollination by male euglossine (orchid) bees.","zh":"（植物）阿西涅塔属：一类原产热带美洲的兰科植物，以下垂的花序与依靠雄性香蜂（兰蜂）传粉而闻名。"},"examples":[{"en":"Acineta orchids often grow as epiphytes on tree branches in humid forests.","zh":"阿西涅塔属兰花常以附生植物的形式生长在潮湿森林的树枝上。"},{"en":"In some Acineta species, the flower’s shape helps guide orchid bees during pollination.","zh":"在一些阿西涅塔属物种中，花的形态会在传粉过程中引导兰蜂。"}]},{"partOfSpeech":"n.","definition":{"en":"a genus of suctorian ciliates (microscopic protozoa) that attach to surfaces and feed using tentacle-like structures.","zh":"（动物/微生物）阿西涅塔属：一类吸管虫（纤毛虫的一类）微生物，常附着在表面，用触手状结构取食。"},"examples":[{"en":"Under the microscope, an Acineta may be seen attached to aquatic plants or other organisms.","zh":"在显微镜下，可能看到阿西涅塔属生物附着在水生植物或其他生物表面。"},{"en":"Some Acineta species are studied to understand how suctorian ciliates capture prey.","zh":"一些阿西涅塔属物种用于研究吸管虫如何捕食。"}]}],"synonyms":["(as a scientific genus name)"],"phonetic":"ˌæsɪˈniːtə","extraExplanation":["“Acineta”在英文中通常作为拉丁化的学名使用（首字母大写，斜体书写：*Acineta*）。具体指哪一类生物，要看上下文：植物学语境多指兰科的阿西涅塔属；原生生物/显微生物学语境则可能指吸管虫的阿西涅塔属。"]}
{"word":"acineta","summary":{"en":"Acineta is a scientific name for a genus of tropical orchids.","zh":"Acineta 是热带兰花的一个属名（学名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical orchids known for large, often fragrant flowers and unusual, bucket-like shapes that can help attract pollinators (especially euglossine bees).","zh":"（植物）阿西内塔兰属：一种热带兰花属，以花朵大、常带香味、形态奇特（有时呈“桶状/兜状”）而闻名，常吸引特定传粉昆虫（如香蜂）。"},"examples":[{"en":"Acineta orchids are sometimes grown by collectors because their flowers look dramatic and sculptural.","zh":"阿西内塔兰常被兰花收藏者栽培，因为它们的花看起来很夸张、有雕塑感。"},{"en":"The greenhouse label read “Acineta,” so she searched for its light and humidity needs.","zh":"温室标签写着“Acineta”，于是她去查这种兰花需要的光照和湿度。"}]}],"synonyms":["(no common everyday synonyms; scientific genus name)"],"phonetic":"/ˌæsɪˈniːtə/","extraExplanation":["“Acineta”是一个学名（拉丁化的属名），在日常英语里不算常见，主要出现在园艺、植物学或兰花爱好者的语境中。","如果你是想查别的词：常见的相近拼写有“Acinetobacter”（鲍曼不动杆菌属，医学/微生物学术语）或“acetate”（醋酸盐/醋酸酯）。你可以确认一下拼写与语境，我也可以帮你查对应的词。"]}
{"word":"Acineta-like","summary":{"en":"“Acineta-like” means resembling the ciliate genus *Acineta*, especially in microscopic form or behavior.","zh":"“Acineta-like”指在显微形态或行为上类似纤毛虫属 *Acineta* 的特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling or related to *Acineta* (a genus of suctorian ciliates), especially in shape, structure, or behavior.","zh":"类似于或与 *Acineta*（一种吸管虫类纤毛虫的属）有关的；尤指在形态、结构或行为上相似。"},"examples":[{"en":"Under the microscope, the organism showed an Acineta-like body with stalked attachment.","zh":"在显微镜下，这种生物呈现出类似 Acineta 的体形，并通过柄状结构附着。"},{"en":"Researchers reported Acineta-like predators living on the surface of aquatic insects.","zh":"研究人员报告称，在水生昆虫体表生活着类似 Acineta 的捕食者。"}]}],"synonyms":["Acineta-like","acineta-shaped","acineta-type","acineta-related"],"phonetic":"/ˌæsɪˈniːtə laɪk/","extraExplanation":["“Acineta-like”多见于生物学/微生物学论文，用来做“形态学上的类比”：表示某个生物或结构“看起来像 Acineta”，但不一定真的属于 *Acineta* 这个属。","*Acineta* 属常被归入“吸管虫（suctorian ciliates）”一类，这类原生生物通常用触手样结构捕食；因此文献里说“Acineta-like”时，可能暗示其有类似的附着方式（如有柄）或捕食结构（触手样突起）。"]}
{"word":"Acinetae","summary":{"en":"Acinetae are suctorian ciliates (or the plural of *Acineta*), tiny single-celled organisms that often attach to surfaces and feed using tentacle-like structures.","zh":"Acinetae 指吸管虫类/吸管纤毛虫（或 *Acineta* 的复数），常固着生活，并用触手状结构摄食。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a taxonomic group (or plural of the genus name *Acineta*) referring to suctorian ciliates—single-celled protozoans that often live attached to surfaces and feed by sucking in other microorganisms through tentacle-like structures.","zh":"（分类学名）指“吸管虫类/吸管纤毛虫”（或属名 *Acineta* 的复数形式）：一类常附着在表面生活的单细胞原生生物，常用触手状结构“吸食”其他微生物。"},"examples":[{"en":"Under the microscope, Acinetae can be seen attached to aquatic plants or small crustaceans.","zh":"在显微镜下，可以看到 Acinetae 附着在水生植物或小型甲壳类动物上。"},{"en":"Some Acinetae feed by capturing other protozoa with their tentacles.","zh":"有些 Acinetae 会用触手捕捉并摄食其他原生动物。"}]}],"synonyms":["suctorian ciliates","Suctoria"],"phonetic":"/ˌæsɪˈniːtiː/","extraExplanation":["“Acinetae”多见于生物学/原生动物学文献，属于较少在日常英语出现的科学用语。不同教材或年代的分类系统可能把它当作某个分类群名（如某类群/科群），也可能直接作为属名 *Acineta* 的拉丁化复数来用。","词源上常被解释为来自希腊语词根，含“无运动/不移动”之意，用来描述这类生物常以固着方式生活（并非像一些其他纤毛虫那样自由游动）。"]}
{"word":"acinetae","summary":{"en":"Acinetae refers to Acineta (or a group of related organisms): stalked suctorian ciliates that attach to surfaces and feed by sucking in prey.","zh":"Acinetae 指 Acineta（或相关类群）：一种具柄、固着的吸管类纤毛虫，附着在表面并以“吸食”方式捕食。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(biology, protozoology) A taxonomic group (or plural) referring to Acineta—stalked, “suctorian” ciliates that attach to surfaces and feed by sucking in other microorganisms.","zh":"（生物学／原生动物学）指 Acineta（或其类群/复数）——一种具柄、固着生活的“吸管虫”（吸管类纤毛虫），会附着在表面并通过吸食方式捕食其他微生物。"},"examples":[{"en":"Under the microscope, the Acinetae are often seen attached to aquatic plants or small crustaceans.","zh":"在显微镜下，acinetae 常被看到附着在水生植物或小型甲壳动物上。"},{"en":"Some Acinetae capture prey using tentacle-like structures rather than swimming to hunt.","zh":"有些 acinetae 会用触手状结构捕捉猎物，而不是游动追捕。"}]}],"synonyms":["Acineta","suctorian ciliates","Suctoria"],"phonetic":"ˌæsɪˈniːtiː","extraExplanation":["“Acinetae”多见于较旧或较专业的分类写法，来源于拉丁/新拉丁命名传统；现代文献中更常直接使用属名“Acineta”，或用更常见的上位类群名称“suctorian ciliates（吸管类纤毛虫）”。","这个词很容易与“acinetes（休眠细胞）”混淆：acinetes 是某些蓝藻（cyanobacteria）形成的厚壁休眠细胞，含义与 Acinetae 完全不同。"]}
{"word":"acinetan","summary":{"en":"An uncommon biology term for a suctorian ciliate, especially one in the genus *Acineta*, or relating to such organisms.","zh":"一个较少见的生物学术语，指吸管虫类纤毛虫（尤其是 *Acineta* 属），或表示“与其相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(biology) A suctorian ciliate (a kind of single-celled protozoan) in the genus *Acineta*; sometimes used more broadly for an organism of the acinetans (suctorians).","zh":"（生物）吸管虫类纤毛虫（单细胞原生生物）的一种，指 *Acineta* 属的个体；有时也更广义指“acinetans/吸管虫类（Suctoria）”成员。"},"examples":[{"en":"Under the microscope, the acinetan sits attached to a surface and feeds with tentacle-like structures.","zh":"在显微镜下，这种 acinetan 常附着在表面上，并用触手状结构取食。"},{"en":"Researchers recorded several acinetans living on the shells of small crustaceans.","zh":"研究人员记录到有几种 acinetans 生活在小型甲壳动物的壳表面。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to or characteristic of acinetans (suctorian ciliates).","zh":"（形容）与吸管虫类（acinetans / suctorian ciliates）有关的；具有其特征的。"},"examples":[{"en":"The paper discusses acinetan morphology and feeding behavior.","zh":"这篇论文讨论了吸管虫类的形态与取食行为。"}]}],"synonyms":["suctorian","suctorian ciliate"],"phonetic":"/ˌæsɪˈniːtən/","extraExplanation":["这是一个非常少见的生物学术语，多出现在原生生物学/微生物学的文章里。","词源常被解释为来自希腊语 *akinetos*（意为“静止的、不移动的”），因为这类生物常以附着方式生活。"]}
{"word":"Acinetaria","summary":{"en":"A Latinized scientific taxonomic name, used mainly in biology.","zh":"一种拉丁化的科学分类名称，主要用于生物学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Acinetaria: a scientific (Latinized) taxonomic name used in biology; it refers to a particular group in classification (the exact rank and meaning depend on the field and source), and it is not a common everyday English word.","zh":"Acinetaria：一种生物学中使用的拉丁化分类学名称，指代分类系统中的某一类群（具体属于哪个分类等级与含义需视领域与资料而定），并非日常英语常用词。"},"examples":[{"en":"Acinetaria is mainly seen in scientific texts rather than general English.","zh":"Acinetaria主要出现在科学文献中，而不是一般英语中。"},{"en":"The paper lists Acinetaria as a taxonomic name in its classification section.","zh":"这篇论文在分类部分把Acinetaria列为一个分类学名称。"}]}],"phonetic":"/ˌæsɪnɪˈtɛriə/","extraExplanation":["这是典型的“拉丁化学名/分类名”用法：在英文里通常保留拉丁拼写与大小写规则，常见于论文的分类（taxonomy）或系统学（systematics）语境。","如果你是在医学/微生物语境里看到这个词，也可能是把更常见的 **Acinetobacter**（鲍曼不动杆菌属等）拼错或看错了；你可以把原句或截图发来，我可以帮你确认具体指什么。"]}
{"word":"acinetaria","summary":{"en":"Acinetaria is a biology term for suctorian ciliates—protozoans that often attach to surfaces and feed by sucking out other microorganisms.","zh":"Acinetaria 是生物学术语，指吸管纤毛虫类原生动物，常附着生活并通过“吸取”其他微生物取食。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) A group (subclass) of protozoans known as suctorian ciliates, which often live attached to surfaces and feed by sucking the contents of other microorganisms.","zh":"（生物）一类原生动物（吸管虫类／吸管纤毛虫），常附着在基质上生活，通过“吸取”其他微生物的内容物来取食。"},"examples":[{"en":"In freshwater samples, acinetaria may be found attached to aquatic plants or debris.","zh":"在淡水样本中，acinetaria 可能会附着在水草或碎屑上。"},{"en":"Some acinetaria capture prey with tentacle-like structures and then suck out the cell contents.","zh":"一些 acinetaria 会用触手状结构捕捉猎物，然后吸出细胞内容物。"}]}],"synonyms":["suctorians","suctorian ciliates","Suctoria"],"phonetic":"/ˌæsɪnəˈtɛriə/","extraExplanation":["这是一个较少见的专业术语，多出现在原生生物学与分类学语境中；日常英语里几乎不会用到。","词源上常被解释为与希腊语表示“无运动/不游动”（a- + kinesis）有关，用来强调这类生物在某些生命周期阶段不像其他纤毛虫那样主动游动，而更常附着取食。","在现代分类中，这类群的命名与层级可能因教材与研究传统而略有差异；阅读文献时可同时留意 “suctorian ciliates / Suctoria” 等相关写法。"]}
{"word":"acinetarian","summary":{"en":"An acinetarian is a (rare, old-fashioned) word for someone who does not eat meat or fish.","zh":"acinetarian 是一个少见、较旧式的词，指不吃肉或鱼的人（严格素食者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who does not eat animal flesh (meat or fish); a strict vegetarian (an uncommon, old-fashioned word).","zh":"不吃动物肉（肉或鱼）的人；严格素食者（较少见、偏旧式用法）。"},"examples":[{"en":"In the 19th century, some writers used “acinetarian” to describe people who refused to eat meat or fish.","zh":"在19世纪，一些作者用“acinetarian”来形容拒绝吃肉或鱼的人。"},{"en":"She became an acinetarian for ethical reasons, choosing vegetables, grains, and fruit instead of meat.","zh":"她出于伦理原因成为严格素食者，选择蔬菜、谷物和水果来代替肉类。"}]}],"synonyms":["vegetarian","non-meat-eater","pescetarian (contrast)","vegan (related)"],"phonetic":"/ˌæsənaɪˈtɛriən/","extraExplanation":["这是一个非常少见的词，现代英语里更常用 vegetarian（素食者）或 vegan（纯素者，不吃任何动物来源食物，如蛋奶也不吃）。acinetarian 通常强调“不吃肉/鱼”，但不一定等同于 vegan。","词源可追溯到希腊语否定前缀 a-（不、无）与 sitos（食物、谷物）相关的构词传统，因此带有“禁食/不吃某类食物”的含义色彩。"]}
{"word":"acinetic","summary":{"en":"A medical adjective meaning “without movement; unable to move normally.”","zh":"医学形容词，表示“无运动的；运动能力缺失或显著降低的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Without movement; unable to move normally; relating to akinesia (loss or great reduction of voluntary movement).","zh":"（医学）无运动的；（自发）运动能力缺失或显著减少的；与“运动不能/运动缺失（akinesia）”有关的。"},"examples":[{"en":"After the stroke, the patient became almost akinetic and needed help to stand and walk.","zh":"中风后，病人几乎出现无运动状态，需要他人协助才能站立和行走。"},{"en":"Doctors described his condition as an akinetic state rather than simple tiredness.","zh":"医生将他的情况描述为“无运动状态”，而不是单纯的疲劳。"}]}],"synonyms":["akinetic","immobile","motionless","still"],"phonetic":"/ˌeɪkɪˈnɛtɪk/","extraExplanation":["“acinetic”在英语中较少见，很多情况下是“akinetic”的变体拼写或误拼；医学文献与临床用语里更常用“akinetic”。","常见搭配：akinetic mutism（无动性缄默：清醒但几乎不动也不说话）、akinetic-rigid syndrome（无动-强直综合征，常见于帕金森相关表现）。"]}
{"word":"acinetiform","summary":{"en":"Acinetiform means “Acineta-like in form,” used mainly in scientific descriptions of microscopic organisms.","zh":"Acinetiform 指“形态类似吸管虫（Acineta）的”，主要用于描述显微生物的科学用语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having the form or appearance of an Acineta (a type of suctorian ciliate); Acineta-like.","zh":"呈现“吸管虫（Acineta，一类吸管纤毛虫）”形态的；类似吸管虫的。"},"examples":[{"en":"Under the microscope, the organism showed an acinetiform stage attached to the glass slide.","zh":"在显微镜下，这种生物出现了一个类似吸管虫的阶段，附着在玻片上。"},{"en":"The paper describes a transition from a free-swimming cell to an acinetiform form with tentacle-like structures.","zh":"论文描述了该细胞从自由游动状态转变为具有触手状结构的吸管虫样形态。"}]}],"synonyms":["Acineta-like","suctorian-like"],"phonetic":"/əˈsɪnɪtəˌfɔrm/","extraExplanation":["“acinetiform”由专名 Acineta（吸管纤毛虫的一属/类群名称）+ 后缀 -form（“……形状的”）构成，常见于原生生物学与显微观察的学术语境。日常英语中几乎不用。"]}
{"word":"acinetin","summary":{"en":"“Acinetin” is a rare term mainly used as a chemical compound name in scientific writing.","zh":"“acinetin”多见于科研写作中，通常作为某种化学化合物的名称，日常不常用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare scientific term used as a chemical name (a compound name) in some research contexts; it is not a common everyday English word.","zh":"一个较少见的科学用词，常作为化学物质（化合物）的名称出现在部分研究语境中；日常英语中几乎不用。"},"examples":[{"en":"The paper reports the isolation of acinetin from a plant extract.","zh":"该论文报告从植物提取物中分离得到了 acinetin。"},{"en":"Acinetin was measured using chromatography.","zh":"研究使用色谱法测定了 acinetin。"}]}],"phonetic":"/ˌæsɪˈniːtɪn/","extraExplanation":["“acinetin”并不是常见的通用词条，更像是特定论文或数据库里使用的化学命名/别名。不同学科或不同来源可能指向不同化合物或出现拼写差异。","如果你是在生物/医学语境里看到它，也可能与细菌属名“Acinetobacter（不动杆菌属）”的词形相近而混淆；建议提供出处句子或相关领域（植物化学、药理、微生物等），我可以帮你更准确核对含义与对应中文名。"]}
{"word":"Acinetina","summary":{"en":"*Acinetina* is a Latin scientific taxonomic name seen in biology, not a common everyday English word.","zh":"*Acinetina* 是生物学中出现的拉丁学名（分类名称），并非日常英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A scientific (Latin) taxonomic name used in biology; it refers to a group classified under the name *Acinetina* in some scientific sources (not a common everyday English word).","zh":"生物学中的拉丁学名（分类名称）；在一些科学资料中用 *Acinetina* 指代某个分类群，但不是日常英语词汇。"},"examples":[{"en":"The paper mentions *Acinetina* as a taxonomic group and compares it with related genera.","zh":"论文将 *Acinetina* 作为一个分类群提到，并与相关属进行比较。"},{"en":"In scientific writing, names like *Acinetina* are usually italicized.","zh":"在科学写作中，像 *Acinetina* 这样的名称通常要用斜体。"}]}],"synonyms":["(no common English synonyms; use the exact taxonomic name)"],"phonetic":"/ˌæsɪnəˈtiːnə/","extraExplanation":["这是典型的“拉丁学名/分类名”，常见于微生物学、动植物分类学等领域。具体指向哪个类群会随不同数据库或分类系统而变化；如果你能提供它出现的句子、学科（细菌/昆虫/植物等）或链接，我可以帮你确认它对应的确切分类地位。","词源上常可与希腊语 *kinesis*（运动）相关联；类似的名称如 *Acinetobacter*，其命名含义常被解释为“（看起来）不运动的”。","书写习惯：属名/更高阶分类群等拉丁名在英文论文中通常使用斜体；首字母是否大写取决于分类等级与原始命名规则。"]}
{"word":"acinetina","summary":{"en":"Acinetina is a rare scientific term, usually referring to a flavone (often the same as acinetin).","zh":"Acinetina 是较少见的科研用词，通常指一种黄酮类化合物（常与 acinetin 同指）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical name used in some sources for a plant compound (a flavone), often treated as the same as acinetin; mainly seen in scientific or supplement contexts, not in everyday English.","zh":"一种化学名称，在一些资料中指植物成分（黄酮/黄酮类化合物中的黄酮 flavone），常被当作与 acinetin 同指；主要用于科研或保健品语境，日常英语中很少见。"},"examples":[{"en":"In the paper, acinetina was listed among flavones isolated from the plant extract.","zh":"在论文中，acinetina 被列为从植物提取物中分离出的黄酮之一。"},{"en":"The label mentions acinetina, but you may also see it written as acinetin in other references.","zh":"标签上写的是 acinetina，但在其他资料中你也可能看到写作 acinetin。"}]}],"synonyms":["acinetin","flavone (general category)"],"phonetic":"/ˌæsɪnɪˈtiːnə/","extraExplanation":["“acinetina”不是常见英语词汇，更像是化学/生物学文献中的用名，可能来自其他语言或不同的命名习惯；如果你是在成分表或论文里看到它，建议同时检索拼写变体（如 acinetin）以及该物质的结构式或 CAS 号来确认具体指代。","不要与细菌属名“Acinetobacter（不动杆菌属）”混淆：两者拼写相似，但一个是化合物名（或其变体），一个是微生物分类名称。"]}
{"word":"acinetinan","summary":{"en":"“Acinetinan” is not a common English word; it’s likely a misspelling or a specialized/proper term.","zh":"“acinetinan”不是常见英语词；更可能是拼写错误或非常专业/专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is likely a misspelling, a specialized scientific term, or a proper name (e.g., a product/brand or a biological/chemical name).","zh":"不是常见英语词典里的标准词；更可能是拼写错误、非常专业的科学术语，或专有名词（如产品/品牌名、生物/化学名称）。"},"examples":[{"en":"I can’t find “acinetinan” in a standard dictionary—did you mean “Acinetobacter” or “acinetin”?","zh":"我在常见词典里找不到“acinetinan”——你是想写“Acinetobacter（不动杆菌属）”还是“acinetin”吗？"},{"en":"Could you share the sentence where you saw “acinetinan” so I can infer the correct word from context?","zh":"你能把你看到“acinetinan”的原句发我吗？我可以根据上下文推断正确的词。"}]}],"phonetic":"/ˌæsɪˈniːtɪnæn/","extraExplanation":["“acinetinan”看起来像是由拉丁/希腊词根构成的科学名词拼写（或OCR识别错误）。常见的相近词包括：\n- **Acinetobacter**：医学/微生物学里常见的细菌属名。\n- **acinetin**：可能出现在植物化学/黄酮类相关资料中。\n如果你告诉我它来自哪里（论文、药品说明、图片、字幕等）或提供上下文，我可以更准确地帮你确认真实拼写与含义。"]}
{"word":"Acinetobacter","summary":{"en":"Acinetobacter is a genus of bacteria; some types can cause hard-to-treat hospital infections.","zh":"Acinetobacter（不动杆菌属）是一类细菌；其中一些类型可引起较难治疗的医院感染。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of Gram-negative bacteria found in soil and water; some species (especially in hospitals) can cause infections in humans.","zh":"不动杆菌属：一种革兰氏阴性细菌，常见于土壤和水中；其中一些种（尤其在医院环境中）可引起人类感染。"},"examples":[{"en":"Acinetobacter can survive on surfaces for a long time in hospital settings.","zh":"在医院环境中，不动杆菌可能在物体表面存活很长时间。"},{"en":"Doctors suspected an Acinetobacter infection after the patient developed pneumonia in the ICU.","zh":"病人在重症监护室出现肺炎后，医生怀疑是不动杆菌感染。"}]}],"synonyms":["Acinetobacter baumannii (a notable species)","Gram-negative bacterium"],"phonetic":"/ˌæsɪˌniːtoʊbækˈtɪriəm/","extraExplanation":["“Acinetobacter”在临床上最常被提到的是“鲍曼不动杆菌（Acinetobacter baumannii）”，它与呼吸机相关肺炎、血流感染、伤口感染等有关，且可能出现多重耐药（MDR）。","词源提示：A-（无、不）+ kinetic（运动的），名字暗示这类细菌通常“没有运动性/不太会动”。在学习资料里你也可能看到它被描述为“non-motile（无鞭毛、不运动）”。","发音与拼写：词较长，常见分段记忆法为 A-ci-ne-to-bac-ter；医学写作中通常作为专有名词首字母大写。"]}
{"word":"acinetobacter","summary":{"en":"Acinetobacter is a genus of bacteria; some types can cause difficult-to-treat hospital infections.","zh":"Acinetobacter 指不动杆菌属；其中一些类型可导致较难治疗的医院感染。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of bacteria, some species of which can cause infections in hospitals (especially in people with weakened immune systems)","zh":"不动杆菌属（细菌的一属；其中一些种可在医院环境中引起感染，尤其在免疫力较弱的人群中）"},"examples":[{"en":"The ICU reported an increase in Acinetobacter infections this month.","zh":"重症监护室报告本月不动杆菌感染有所增加。"},{"en":"Doctors chose antibiotics carefully because the Acinetobacter strain was drug-resistant.","zh":"由于该不动杆菌菌株具有耐药性，医生在选择抗生素时非常谨慎。"}]}],"synonyms":["Acinetobacter baumannii (specific species)"],"phonetic":"/ˌæsɪˌniːtoʊˈbæk.tɚ/","extraExplanation":["“Acinetobacter”常见于医学与公共卫生语境，尤其指医院获得性感染（hospital-acquired infection）。其中最常被提到的是“A. baumannii（鲍曼不动杆菌）”，因其在部分地区对多种抗生素耐药而受到关注。","在英语里该词通常作为不可数的学名使用；若强调“某一种/某一株”，常说“an Acinetobacter species/strain（某种/某株不动杆菌）”。"]}
{"word":"acing","summary":{"en":"Acing means doing extremely well (especially on a test), and in tennis it also means making aces with unreturnable serves.","zh":"acing 指表现非常出色（尤其考试）；在网球中也指发出ACE球，用对手无法接回的发球得分。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Present participle of ace) Doing something extremely well; getting the best result, especially on a test or task.","zh":"（ace 的现在分词）把某事做得非常好；取得最优秀的结果，尤指考试或任务表现出色。"},"examples":[{"en":"She’s acing her math class this semester.","zh":"这学期她的数学课成绩非常好。"},{"en":"He was nervous, but he ended up acing the interview.","zh":"他本来很紧张，但最后面试表现非常出色。"}]},{"partOfSpeech":"v.","definition":{"en":"In tennis (and similar sports), scoring points by serving or hitting an ace; making unreturnable serves.","zh":"（网球等）发出或打出“ACE球”（对手无法接回的球）；用ACE得分。"},"examples":[{"en":"She kept acing her opponent with wide serves.","zh":"她不断用外角发球打出ACE，让对手接不到。"},{"en":"He won the set by acing twice in a row.","zh":"他连发两个ACE，赢下了这一盘。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or result of making an ace in tennis (an unreturnable serve).","zh":"（网球）发出ACE球的行为；一次ACE得分。"},"examples":[{"en":"His acing at the end of the match sealed the win.","zh":"他在比赛末段的ACE得分锁定了胜利。"},{"en":"Three acings in one game put huge pressure on the returner.","zh":"一局里三个ACE给接发球的人很大压力。"}]}],"synonyms":["excelling","nailing it","crushing it","doing great","dominating"],"phonetic":"/ˈeɪsɪŋ/","extraExplanation":["“ace”最早来自纸牌里的“A（A牌）”，常被看作最强的一张牌之一，因此在口语里引申为“高手”“做得极好”。在美式英语里，说“ace a test/interview”很常见，意思是“考得特别好/面试表现很强”。"]}
{"word":"acini","summary":{"en":"*Acini* usually means the small sac-like units of a gland (plural of *acinus*). In cooking, it often refers to the tiny pasta in *acini di pepe*.","zh":"*acini* 通常指腺体中的小囊状单位（*acinus* 的复数）；在烹饪中常指 *acini di pepe* 这种很小的圆粒意面。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy) Small sac-like units in glands (the plural of *acinus*), where secretions are produced or stored.","zh":"（解剖）腺体中“小囊/腺泡”样的基本单位（*acinus* 的复数），用来分泌或储存分泌物。"},"examples":[{"en":"The pancreas contains many acini that produce digestive enzymes.","zh":"胰腺里有许多腺泡（acini），用来产生消化酶。"},{"en":"In some diseases, the lung’s acini can be damaged.","zh":"在一些疾病中，肺的腺泡（acini）可能会受损。"}]},{"partOfSpeech":"n.","definition":{"en":"(Cooking, in the phrase *acini di pepe*) Very small, bead-like pasta often used in soups or pasta salads.","zh":"（烹饪，常见于短语 *acini di pepe*）一种非常小、像小珠子一样的意面，常用于汤或意面沙拉。"},"examples":[{"en":"She made chicken soup with acini di pepe.","zh":"她用 acini di pepe 做了鸡汤。"},{"en":"Acini di pepe works well in cold pasta salads because the pieces are tiny.","zh":"acini di pepe 很适合做冷意面沙拉，因为颗粒很小。"}]}],"synonyms":["acinus (singular)","glandular sacs","acini di pepe (pasta)"],"phonetic":"/ˈæsɪnaɪ/","extraExplanation":["“acini”在英语里常被当作名词复数使用：医学/生物语境中它来自拉丁语，是 *acinus* 的复数（读法也偏拉丁化）；而在美食语境里，人们更常见到意大利语短语 *acini di pepe*（字面意思是“胡椒粒”），用来形容这种小圆粒意面的外形。"]}
{"word":"acinic","summary":{"en":"Acinic means “related to glandular acini,” small sac-like secretory units in organs such as the salivary glands or pancreas.","zh":"acinic 指“与腺泡有关的”，腺泡是唾液腺、胰腺等器官中的小囊状分泌单位。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an acinus (a small sac-like unit in a gland or organ), especially the secretory parts of glands such as salivary glands or the pancreas.","zh":"腺泡的；与腺泡（腺体或器官中小囊状的基本单位）有关的，尤指唾液腺、胰腺等分泌部位。"},"examples":[{"en":"The biopsy showed acinic cells typical of salivary gland tissue.","zh":"活检显示出典型的唾液腺组织中的腺泡细胞。"},{"en":"Doctors discussed whether the tumor had acinic features under the microscope.","zh":"医生讨论了该肿瘤在显微镜下是否具有腺泡样特征。"}]}],"synonyms":["acinar","glandular (general)"],"phonetic":"/əˈsɪnɪk/","extraExplanation":["“acinic”多见于医学/生物学语境（组织学、病理学）。它来自拉丁语 acinus，原意与“葡萄串/小颗粒”有关，用来形容腺体中像一串小囊泡一样排列的分泌单位。","常见相关词：acinus（腺泡，名词），acinar（腺泡的，形容词；在临床和科研中比 acinic 更常见），acinic cell carcinoma（腺泡细胞癌，多指唾液腺的肿瘤）。"]}
{"word":"aciniform","summary":{"en":"Aciniform means “grape-like” in shape, often used in medical or biological descriptions of clustered structures.","zh":"Aciniform 指“葡萄状”的形态，常用于医学/生物学中描述成簇的结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a cluster of grapes; made up of many small, round units grouped together.","zh":"葡萄状的；由许多小而圆的单位聚集成串状（像葡萄一串）。"},"examples":[{"en":"The biopsy report described an aciniform pattern of gland cells.","zh":"活检报告描述了腺细胞呈葡萄状排列。"},{"en":"Under the microscope, the tissue formed aciniform clusters.","zh":"在显微镜下，这种组织形成了葡萄状的细胞簇。"}]}],"synonyms":["grape-like","clustered","acinous"],"phonetic":"/əˈsɪnəˌfɔrm/","extraExplanation":["词源提示：来自拉丁语 acinus（意为“葡萄/浆果的一粒”）+ -form（“形状”）。因此 aciniform 常用于医学与生物学，描述腺泡（acinus）或细胞/结构像“葡萄串”那样成簇排列。","常见搭配（多见于病理或解剖语境）：aciniform glands（腺泡状腺体）、aciniform architecture/pattern（腺泡样结构/模式）、aciniform cluster（葡萄状簇）。与之近义但更常见的描述词有 grape-like（像葡萄的）、clustered（成簇的）。"]}
{"word":"acinose","summary":{"en":"Acinose describes something that looks like a cluster of grapes, especially in anatomy (glandular tissue).","zh":"Acinose 指“葡萄串状”的结构，尤常用于解剖学中描述腺体组织。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"shaped like a cluster of grapes (made of many small rounded units).","zh":"葡萄串状的；由许多小圆形小单位聚集而成的。"},"examples":[{"en":"The salivary gland has an acinose structure.","zh":"唾液腺具有葡萄串状的结构。"},{"en":"Under the microscope, the tissue looks acinose, with many tiny sacs grouped together.","zh":"在显微镜下，这种组织呈葡萄串状，许多微小的囊泡聚在一起。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Botany) bearing or arranged in small berry-like clusters.","zh":"（植物学）结成或排列成小浆果状簇的。"},"examples":[{"en":"Some plants produce acinose fruit clusters.","zh":"有些植物会结出葡萄串状的果簇。"}]}],"synonyms":["acinar","grapelike","clustered"],"phonetic":"/ˈæsɪˌnoʊs/","extraExplanation":["“acinose”常见于解剖学与组织学描述，来源于拉丁语“acinus”（意为“葡萄/浆果的一粒”）。因此它常用来形容腺体的“腺泡（acinus）”排列方式：许多小囊状单位聚成一团，看起来像一串葡萄。"]}
{"word":"acinotubular","summary":{"en":"Acinotubular means “having both acinar and tubular gland structures.”","zh":"acinotubular 指“同时具有腺泡状与管状结构的（腺体）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy/biology) Describing a gland that has both acinar (rounded, sac-like) and tubular (tube-like) secretory parts.","zh":"（解剖/生物）形容一种腺体同时具有腺泡状（囊状、圆形）与管状（管形）分泌结构。"},"examples":[{"en":"Many salivary glands are described as acinotubular in structure.","zh":"许多唾液腺在结构上被描述为腺泡—管状（acinotubular）。"},{"en":"Under the microscope, the tissue showed an acinotubular arrangement of secretory units.","zh":"在显微镜下，该组织显示出分泌单位呈腺泡—管状的排列。"}]}],"synonyms":["tubuloacinar","tubuloacinar glandular"],"phonetic":"/ˌæsɪnoʊˈtjuːbjələr/","extraExplanation":["这是一个组织学/解剖学术语，常用于描述外分泌腺（例如部分唾液腺、胰腺某些描述中）分泌部的形态：既有“腺泡（acinus）”那种像小葡萄串一样的囊状末端，也有“管状（tubular）”的管形结构。","临床或科研写作里更常见的同义表达是 **tubuloacinar**（管泡状/管腺泡状）；不同教材可能偏好不同术语，但指向的结构概念相近。"]}
{"word":"acinous","summary":{"en":"“Acinous” describes a berry-like, clustered structure—especially the acinus units in glands or lung tissue.","zh":"acinous 指“腺泡样/浆果状成串”的结构，常用于描述腺体或肺组织中的腺泡单位。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy/medicine) Shaped like a small berry or cluster; relating to an acinus (a tiny sac-like unit in glands or lungs).","zh":"（解剖/医学）呈小浆果状或成串状；与腺泡（腺体或肺等组织中的微小囊状结构）有关的。"},"examples":[{"en":"The pancreas has an acinous structure that produces digestive enzymes.","zh":"胰腺有腺泡状（acinous）的结构，用来产生消化酶。"},{"en":"Under the microscope, the pathologist noted acinous cells arranged in small clusters.","zh":"在显微镜下，病理学家观察到腺泡样细胞以小簇状排列。"}]}],"synonyms":["acinar","glandular (contextual)","clustered (general)"],"phonetic":"/ˈæsɪnəs/","extraExplanation":["acinous 来自 acinus（拉丁语，意为“葡萄/浆果”），因为这些微小单位在显微镜下常呈“成串的葡萄”样外观。常见搭配有 acinous gland（腺泡状腺体）、acinous tissue（腺泡样组织）、acinous cell（腺泡细胞）。","学习提示：日常英语里很少用到 acinous，主要出现在医学、组织学、病理学等专业语境；更常见的相关名词是 acinus（腺泡）。"]}
{"word":"acinuni","summary":{"en":"“acinuni” is not a recognized English word; it’s likely a misspelling or a name. Provide context for an accurate lookup.","zh":"“acinuni”不是可识别的英语单词，可能是拼写错误或专有名词。请提供语境以便准确查询。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a proper name, or a term from another language.","zh":"不是标准英语单词，可能是拼写错误、专有名词，或来自其他语言的词。"},"examples":[{"en":"I can’t find “acinuni” in standard English dictionaries—could you check the spelling or share the sentence it appears in?","zh":"我在常见英语词典里找不到“acinuni”，你能否确认拼写或提供它出现的句子？"},{"en":"If you meant a different word (for example, “acinus” in biology), tell me the context and I’ll help you find the right meaning.","zh":"如果你想查的是另一个词（例如生物学里的“acinus”），告诉我语境，我可以帮你定位正确含义。"}]}],"extraExplanation":["“acinuni”看起来不像英语常用词。常见可能性：\n1) 拼写输入错误（多一个/少一个字母）；\n2) 人名、品牌名、地名；\n3) 其他语言的词（例如拉丁语/罗马尼亚语等）被当作英语来用。\n\n请你发：a) 它所在的完整句子；b) 你想表达的中文意思；或 c) 你看到它的来源（书/论文/网站）。我就能更准确地判断。"]}
{"word":"acinus","summary":{"en":"An acinus is a tiny cluster of sac-like cells in glands (and sometimes in the lungs) that functions as a basic secretory/functional unit.","zh":"acinus 指腺体中囊状细胞成团的“腺泡”（有时也用于肺部的功能小单位），是基本的分泌/功能单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, sac-like cluster of cells in a gland or organ that secretes a substance (such as enzymes, saliva, or mucus).","zh":"（腺体或器官中的）腺泡；由分泌细胞组成的小囊状细胞团，用来分泌物质（如酶、唾液或黏液）。"},"examples":[{"en":"The pancreas is made up of many acini that produce digestive enzymes.","zh":"胰腺由许多腺泡组成，它们会产生消化酶。"},{"en":"Inflammation can damage the acini and reduce normal secretion.","zh":"炎症可能损伤腺泡并降低正常分泌功能。"}]},{"partOfSpeech":"n.","definition":{"en":"In the lungs, a small functional unit near the ends of the airways where gas exchange occurs (often used more broadly in medical writing).","zh":"（肺部）呼吸小单位；位于细支气管末端附近、与气体交换相关的结构（医学文献中有时较宽泛地使用）。"},"examples":[{"en":"Certain diseases affect the lung acinus and make breathing less efficient.","zh":"某些疾病会影响肺腺泡，使呼吸效率下降。"},{"en":"Doctors may examine changes in the acini on imaging tests.","zh":"医生可能会在影像检查中观察腺泡的变化。"}]}],"synonyms":["acini (plural form)","secretory unit","alveolar cluster","acinus (glandular unit)"],"phonetic":"/ˈæsɪnəs/","extraExplanation":["词源来自拉丁语 acinus，原意是“葡萄/浆果”。因为腺泡常呈一串小囊状、外观像葡萄串，所以医学和生物学借用该词。","复数通常写作 acini（读作 /əˈsaɪnaɪ/），学术文章里很常见。","常见搭配：pancreatic acini（胰腺腺泡）、salivary acini（唾液腺腺泡）、pulmonary acinus（肺腺泡）。"]}
{"word":"acion","summary":{"en":"“Action” most commonly means doing something to achieve a result; it can also mean exciting events (in films/sports) or a legal lawsuit.","zh":"“Action”最常见意思是“采取行动/做事以达成结果”；也可指电影或体育中的“精彩场面”，以及法律上的“诉讼”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Something you do; the process of doing things (especially to achieve a goal).","zh":"行动；做某事的过程（常指为达成目标而采取的行动）。"},"examples":[{"en":"We need action, not just promises.","zh":"我们需要行动，而不只是承诺。"},{"en":"Taking quick action can prevent bigger problems.","zh":"迅速采取行动可以防止问题扩大。"}]},{"partOfSpeech":"n.","definition":{"en":"Activity and events that create excitement, especially in movies, sports, or stories.","zh":"（电影、体育或故事中的）精彩场面；刺激的活动与情节。"},"examples":[{"en":"That movie has a lot of action.","zh":"那部电影有很多动作场面。"},{"en":"The second half of the game was full of action.","zh":"比赛下半场精彩不断。"}]},{"partOfSpeech":"n.","definition":{"en":"A legal process, especially a lawsuit brought to court.","zh":"（法律）诉讼；法律程序（尤指向法院提起的案件）。"},"examples":[{"en":"They may take legal action against the company.","zh":"他们可能对该公司采取法律行动。"}]},{"partOfSpeech":"n.","definition":{"en":"The way something works or operates (often used in technical contexts).","zh":"（技术/机制）作用；运作方式。"},"examples":[{"en":"This medicine has a fast action.","zh":"这种药起效很快。"}]}],"synonyms":["act","activity","step","move","deed","lawsuit"],"phonetic":"/ˈækʃən/","extraExplanation":["你输入的 “acion” 很可能是拼写错误，常见目标词是 **action**（行动）。英语里 **-tion** 结尾的名词很多（nation, information, situation），其中 **-tion** 通常读作 /ʃən/（像“shən”）。","如果你其实想输入西班牙语后缀 **-ación**（如 información），它通常对应英语的 **-ation**（information）。不同语言看起来相似，但重音位置和拼写规则不一样。"]}
{"word":"acious","summary":{"en":"-acious is a suffix that forms adjectives meaning “having” or “full of” a quality (e.g., audacious, capacious, loquacious).","zh":"-acious 是构成形容词的后缀，表示“具有/充满某种性质或倾向”（如 audacious, capacious, loquacious）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a suffix used to form adjectives meaning “having the quality of,” “full of,” or “inclined to,” often with a sense of being noticeably or strongly so","zh":"后缀，用来构成形容词，表示“具有……性质/倾向”“充满……”或“很……”，常带“明显/程度较强”的语感"},"examples":[{"en":"Audacious means “bold in a daring way.”","zh":"audacious 的意思是“大胆而敢作敢为的”。"},{"en":"Capacious means “having a lot of space inside.”","zh":"capacious 的意思是“容量大、内部空间很大”。"},{"en":"Loquacious means “talkative.”","zh":"loquacious 的意思是“健谈的”。"}]}],"synonyms":["-some","-ful","-ive"],"phonetic":"/ˈeɪʃəs/","extraExplanation":["“-acious”在现代英语中通常不作为独立单词使用，而是出现在许多拉丁来源的形容词里（尤其常见于书面语/正式语体）。","拼写相近但含义不同的后缀有：-aceous（多用于表示“……的/像……的”，常见于科学词汇，如 herbaceous“草本的”）、-al/-ive（也能构成形容词，但语感不完全相同）。"]}
{"word":"Acipenser","summary":{"en":"Acipenser is the scientific genus name for several sturgeon species.","zh":"Acipenser 是“鲟属”的科学属名，指一类鲟鱼物种。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific genus name for several kinds of sturgeon (large ancient-looking fish), including species known for producing caviar","zh":"（生物学）鲟属：一类鲟鱼的科学属名（体型大、外形古老的鱼类），其中一些物种以鱼子酱闻名"},"examples":[{"en":"Acipenser is a genus that includes several sturgeon species found in rivers and coastal waters.","zh":"Acipenser（鲟属）包含多种生活在河流和近海水域的鲟鱼。"},{"en":"Some Acipenser species are protected because overfishing reduced their populations.","zh":"一些鲟属物种受到保护，因为过度捕捞使其数量下降。"}]}],"synonyms":["sturgeon (common name)"],"phonetic":"/ˌæsɪˈpɛnsər/","extraExplanation":["“Acipenser”是拉丁化的学名，常见于生物课本、博物馆说明牌、科研文章中；日常英语里更常直接说“sturgeon（鲟鱼）”。","相关背景：鲟鱼常与“caviar（鱼子酱）”联系在一起，尤其是某些鲟属物种的鱼卵被用来制作高价值鱼子酱，因此也涉及保护与可持续捕捞的话题。"]}
{"word":"acipenser","summary":{"en":"Acipenser is the scientific genus name for many sturgeon species.","zh":"Acipenser 是许多鲟鱼物种所属的科学属名（鲟属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus (group) of sturgeons—large, ancient-looking fish that live in rivers and seas and are famous for producing caviar.","zh":"鲟属（一个分类群），属于鲟鱼的一类大型古老鱼类，生活在江河与海洋中，以产鱼子酱而闻名。"},"examples":[{"en":"The beluga sturgeon was historically classified in the genus Acipenser in some older sources.","zh":"在一些较旧的资料中，白鲟（beluga sturgeon）曾被归入鲟属（Acipenser）。"},{"en":"Scientists studied Acipenser species to understand how sturgeons migrate between rivers and the sea.","zh":"科学家研究鲟属（Acipenser）的物种，以了解鲟鱼如何在江河与海洋之间迁徙。"}]}],"synonyms":["sturgeon (general term)","genus Acipenser"],"phonetic":"ˌæsɪˈpɛnsər","extraExplanation":["“Acipenser”是拉丁化的生物学属名（genus），常出现在科普文章、渔业与保护生物学中；日常英语更常说“sturgeon（鲟鱼）”。","鲟鱼因鱼卵可制成“caviar（鱼子酱）”而知名，但许多鲟鱼物种数量下降、受保护；在阅读英文新闻或纪录片时，可能会看到“Acipenser + 物种名”的写法。"]}
{"word":"Acipenseres","summary":{"en":"Acipenseres is a Latin scientific name used in some systems for sturgeons and related fishes.","zh":"Acipenseres 是拉丁学名，在某些分类体系中用来指鲟鱼及其近缘鱼类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific (Latin) taxonomic name referring to sturgeons and their close relatives (used in some classification systems).","zh":"（拉丁学名）指鲟鱼及其近缘类群的分类名称（在某些分类体系中使用）。"},"examples":[{"en":"In older biology books, Acipenseres may include sturgeons and paddlefishes.","zh":"在一些较早的生物学书籍中，Acipenseres 可能包括鲟鱼和匙吻鲟（paddlefishes）。"},{"en":"Researchers sometimes mention Acipenseres when discussing the evolution of ancient ray-finned fishes.","zh":"研究者在讨论古老辐鳍鱼的演化时，有时会提到 Acipenseres。"}]}],"synonyms":["sturgeons","Acipenseriformes","paddlefishes"],"phonetic":"/ˌæsɪˈpɛnsəˌriːz/","extraExplanation":["Acipenseres 是拉丁化的分类名，词根与鲟鱼属名 Acipenser 有关。不同年代/学派的分类体系可能把这组动物放在不同层级（如“目”“超目”等），所以你在文献里看到的用法可能不完全一致。","日常英语中更常用的说法是 sturgeon(s)（鲟鱼）以及 paddlefish(es)（匙吻鲟/白鲟类）；Acipenseres 主要出现在学术或科普文本中。"]}
{"word":"acipenseres","summary":{"en":"Acipenseres is an older scientific name for the fish order that includes sturgeons and paddlefish.","zh":"Acipenseres 是一个较旧的科学分类名，指包括鲟鱼和匙吻鲟等在内的鱼类“目”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology) A former scientific order of fishes that includes sturgeons and paddlefish; in many modern classifications, this group is treated as the order Acipenseriformes.","zh":"（动物学）一种较旧的鱼类分类“目”，包括鲟鱼和匙吻鲟（鸭嘴鱼）等；在许多现代分类中通常改称为“鲟形目（Acipenseriformes）”。"},"examples":[{"en":"Sturgeons were traditionally placed in the order Acipenseres.","zh":"鲟鱼传统上被归入“鲟目（Acipenseres）”。"},{"en":"In modern textbooks, Acipenseres is often replaced by the name Acipenseriformes.","zh":"在现代教材里，“Acipenseres”常被“Acipenseriformes（鲟形目）”所取代。"}]}],"synonyms":["Acipenseriformes","sturgeon order","order of sturgeons and paddlefish"],"phonetic":"/ˌæsɪˈpɛnsəˌriz/","extraExplanation":["“Acipenseres”来自拉丁语属名 Acipenser（鲟鱼属）。它在较早的分类体系中常用作“目”的名称，但随着系统分类学的发展，很多资料改用更常见的“Acipenseriformes”。因此你在阅读不同年代的生物学/自然史文献时，可能会看到两种名称交替出现。","作为一个分类学术语，它通常出现在科普书、博物馆说明牌、学术论文或旧版百科全书中；日常英语里很少使用。"]}
{"word":"acipenserid","summary":{"en":"An acipenserid is a member of the sturgeon family (Acipenseridae).","zh":"acipenserid 指鲟科（Acipenseridae）的成员，即鲟鱼类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fish of the sturgeon family (Acipenseridae), including sturgeons and paddlefish.","zh":"鲟形目鲟科（Acipenseridae）的鱼类个体，包括鲟鱼和匙吻鲟等。"},"examples":[{"en":"Several acipenserids are endangered because of overfishing and habitat loss.","zh":"由于过度捕捞和栖息地丧失，许多鲟科鱼类正处于濒危状态。"},{"en":"Scientists tagged juvenile acipenserids to track their migration in the river.","zh":"科学家给幼年鲟科鱼类做了标记，以追踪它们在河流中的洄游。"}]}],"synonyms":["sturgeon (common term)","member of the sturgeon family"],"phonetic":"/ˌæsɪˈpɛn.sə.rɪd/","extraExplanation":["“acipenserid”是生物学/渔业领域的专业词，来自拉丁学名属名 *Acipenser*（鲟属）+ “-id”（表示“某类/某科的成员”）。日常英语里更常说 *sturgeon*（鲟鱼）。","鲟科鱼类常与“鱼子酱（caviar）”相关：传统高端鱼子酱多来自鲟鱼卵，因此历史上对鲟鱼资源造成很大压力；现在许多国家对野生鲟鱼及其制品有严格保护与贸易管制（如CITES相关规定）。"]}
{"word":"Acipenseridae","summary":{"en":"Acipenseridae is the scientific family name for sturgeons.","zh":"Acipenseridae 是“鲟科”的科学名称（鲟鱼所属的鱼类科）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the fish family that includes sturgeons (large, ancient-looking freshwater and sea fish), many of which are valued for caviar","zh":"鲟科（包括各种鲟鱼的鱼类“科”，多为大型、外形原始的淡水或洄游鱼，因鱼子酱而著名）"},"examples":[{"en":"Many Acipenseridae species are threatened because of overfishing and habitat loss.","zh":"许多鲟科物种因过度捕捞和栖息地丧失而受到威胁。"},{"en":"Caviar traditionally comes from certain Acipenseridae, especially sturgeons from the Caspian region.","zh":"传统鱼子酱常来自某些鲟科鱼类，尤其是里海地区的鲟鱼。"}]}],"synonyms":["sturgeon family"],"phonetic":"/ˌæsɪˈpɛnsəˌraɪdiː/","extraExplanation":["“Acipenseridae”是拉丁化的生物分类名称：Acipenser（鲟属）+ -idae（动物“科”的后缀），因此它指的是“鲟科”，属于正式的科学用语。","鲟科鱼类常被视为“活化石”类群之一，因其形态特征较为古老；同时也与“caviar（鱼子酱）”在文化与饮食上密切相关。","在一般英语语境里，人们更常说“sturgeons（鲟鱼）”；只有在科研、环保、渔业管理或博物馆/水族馆文字说明中才常见“Acipenseridae”。"]}
{"word":"acipenseridae","summary":{"en":"Acipenseridae is the scientific family name for sturgeons.","zh":"Acipenseridae 是“鲟科”的科学名称（鲟鱼所属的科）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of large, long-lived fish (sturgeons) that often live in rivers and coastal waters and are known for bony plates on their bodies; some species produce caviar.","zh":"鲟科（鲟鱼的一个科）：体型较大、寿命较长，常见于河流与近海水域，身体有骨板；部分物种可产鱼子酱。"},"examples":[{"en":"Sturgeons belong to the family Acipenseridae.","zh":"鲟鱼属于鲟科（Acipenseridae）。"},{"en":"Several Acipenseridae species are endangered because of overfishing for caviar.","zh":"由于为获取鱼子酱而过度捕捞，鲟科的多个物种正处于濒危状态。"}]}],"synonyms":["sturgeon family"],"phonetic":"/ˌæsɪˌpɛnˈsɛrɪdiː/","extraExplanation":["“Acipenseridae”是拉丁化的科学分类名称，常用于生物学与渔业/保护领域写作；日常英语里更常说“sturgeon(s)”（鲟鱼）。","词源上与拉丁语“acipenser”（鲟鱼）有关；在正式文本中常以斜体出现（Acipenseridae），但在一般英文排版里也常见非斜体。","相关词：sturgeon（鲟鱼，常用名）；caviar（鱼子酱）；endangered species（濒危物种）。"]}
{"word":"Acipenseriformes","summary":{"en":"Acipenseriformes is the scientific order that includes sturgeons and paddlefishes.","zh":"Acipenseriformes 指“鲟形目”，是包含鲟鱼和匙吻鲟等在内的一个科学分类“目”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific order of ancient ray-finned fishes that includes sturgeons and paddlefishes.","zh":"（生物分类）鲟形目：一类古老的辐鳍鱼类的“目”，包括鲟鱼和匙吻鲟（如白鲟、匙吻鲟等）。"},"examples":[{"en":"Sturgeons belong to the order Acipenseriformes.","zh":"鲟鱼属于鲟形目（Acipenseriformes）。"},{"en":"Many Acipenseriformes are endangered because of overfishing and habitat loss.","zh":"由于过度捕捞和栖息地丧失，许多鲟形目鱼类处于濒危状态。"},{"en":"In class, we compared Acipenseriformes with other ray-finned fish orders.","zh":"在课堂上，我们把鲟形目与其他辐鳍鱼类的目做了比较。"}]}],"synonyms":["the sturgeon order","order Acipenseriformes"],"phonetic":"/ˌæsəˌpɛn.sɚˈɪfɔɹˌmiːz/","extraExplanation":["“Acipenseriformes”是拉丁化的科学名称，常见于生物学、动物学与保护学文献中；日常英语里更常说“sturgeons and paddlefishes（鲟鱼和匙吻鲟）”。","词根来自拉丁语：acipenser（鲟鱼）+ -iformes（……形的/……类的），表示“鲟鱼这一类的”。","作为分类学单位，它对应“目（order）”，上一级通常是“纲（class）”，下一级是“科（family）”。"]}
{"word":"acipenserine","summary":{"en":"“Acipenserine” means “related to sturgeons,” especially the genus *Acipenser*.","zh":"“acipenserine”表示“与鲟鱼有关的”，尤指鲟鱼属（*Acipenser*）及其相关类群。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to sturgeons (fish of the genus *Acipenser* and related genera).","zh":"与鲟鱼有关的；鲟鱼属（*Acipenser*）及其近缘类群的。"},"examples":[{"en":"Acipenserine fishes are often studied because many species are threatened.","zh":"鲟鱼类（acipenserine）常被研究，因为许多物种正受到威胁。"},{"en":"The museum has an exhibit on acipenserine anatomy and evolution.","zh":"博物馆有一个关于鲟鱼解剖结构与演化的展区。"}]}],"synonyms":["sturgeon-related","sturgeonlike"],"phonetic":"/ˌæsɪˈpɛnsəˌraɪn/","extraExplanation":["“acipenserine”来自拉丁学名 *Acipenser*（鲟鱼属）+ 形容词后缀 -ine，常见于生物学/动物学文献中，用来表示“属于/与……相关”。","日常英语里很少用这个词；一般会说 “sturgeon” 或 “sturgeon-related”。在谈到鱼子酱（caviar）、保育与分类学时更可能见到它。"]}
{"word":"acipenseroid","summary":{"en":"“Acipenseroid” means “related to sturgeons (and close relatives like paddlefish).”","zh":"acipenseroid 指“与鲟鱼（及匙吻鲟等近缘类群）相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to sturgeons and their close relatives (the group that includes sturgeons and paddlefish) in fish classification","zh":"（鱼类分类中）与鲟鱼及其近缘类群相关的；鲟形（亚目/类群）的"},"examples":[{"en":"Researchers compared acipenseroid DNA with that of other ancient fish groups.","zh":"研究人员把鲟形类群的DNA与其他古老鱼类类群的DNA进行了比较。"},{"en":"The museum has an acipenseroid specimen, including a well-preserved sturgeon skeleton.","zh":"博物馆收藏有鲟形类群标本，其中包括一具保存良好的鲟鱼骨骼。"}]}],"synonyms":["sturgeon-related","sturgeon-like","acipenserine (less common)"],"phonetic":"/əˌsɪpɛnˈsɛrɔɪd/","extraExplanation":["“acipenseroid”来自拉丁语属名 Acipenser（鲟属），加上后缀 -oid（表示“……样的/与……有关的”）。在科普或学术写作里，它常用来概括“鲟鱼+匙吻鲟（paddlefish）等近缘类群”。日常英语中更常直接说 sturgeon（鲟鱼）或 sturgeon-like（像鲟鱼的）。"]}
{"word":"Acipenseroidei","summary":{"en":"Acipenseroidei is the scientific name for a suborder that includes sturgeons and close relatives.","zh":"Acipenseroidei 是包含鲟鱼及其近缘类群的一个亚目学名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific taxonomic name for a suborder of fishes that includes sturgeons and their close relatives (order Acipenseriformes)","zh":"（生物分类学）鲟形目中的一个亚目名称，包含鲟鱼及其近缘类群"},"examples":[{"en":"Scientists study Acipenseroidei to understand the evolution of ancient fish lineages.","zh":"科学家研究 Acipenseroidei（鲟亚目）以了解古老鱼类谱系的进化。"},{"en":"Many species in Acipenseroidei are threatened because of overfishing and habitat loss.","zh":"Acipenseroidei（鲟亚目）中的许多物种因过度捕捞和栖息地丧失而濒危。"}]}],"synonyms":["sturgeon suborder","Acipenseriform suborder (context-dependent)"],"phonetic":"/ˌæsɪˌpɛnsəˈrɔɪdi.aɪ/","extraExplanation":["这是拉丁化的学名，日常英语中很少使用，更多出现在论文、鱼类学（ichthyology）资料和博物馆标本标签里。","词根提示：Acipenser 是“鲟属/鲟”的拉丁学名来源之一；后缀 -oidei 常见于动物分类，表示“……类/……亚目（或类似群）”。","保护语境中常与 sturgeon（鲟鱼）、caviar（鱼子酱）、endangered species（濒危物种）、habitat degradation（栖息地退化）等词一起出现。"]}
{"word":"acipenseroidei","summary":{"en":"Acipenseroidei is a scientific taxonomic name for the group that includes sturgeons and paddlefishes.","zh":"Acipenseroidei 是一个科学分类名称，指包含鲟鱼和匙吻鲟等的类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific taxonomic group (a suborder in some classifications) within Acipenseriformes that includes sturgeons and paddlefishes.","zh":"（生物分类学）鲟形目中的一个分类群（在一些分类体系中为“亚目”），包括鲟鱼和匙吻鲟（俗称“白鲟/匙吻鲟”等）。"},"examples":[{"en":"Sturgeons are often classified within Acipenseroidei.","zh":"鲟鱼常被归入 Acipenseroidei 这一分类群。"},{"en":"Researchers compare the skeletal features of Acipenseroidei to understand early fish evolution.","zh":"研究人员比较 Acipenseroidei 的骨骼特征，以理解早期鱼类的演化。"}]}],"synonyms":["Acipenseriformes (broader order)","sturgeons and paddlefishes (common-language description)"],"phonetic":"/ˌæsɪˌpɛnsəˈrɔɪdi.aɪ/","extraExplanation":["这是拉丁化的科学名称，多用于学术论文、物种数据库和分类讨论，日常英语中几乎不用。","词根提示：Acipenser- 来自拉丁语，意为“鲟”。后缀 -oidei 常用于动物分类名，表示某一类群。","不同资料对其分类等级可能略有差异（例如作为“亚目/下目/类群”使用），具体以所采用的分类系统为准。"]}
{"word":"Acis","summary":{"en":"Acis is a mythological shepherd loved by Galatea and later turned into a river.","zh":"Acis 是神话中的牧羊人，爱人是加拉忒亚，死后被化为河流。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A figure in Greek and Roman mythology: a Sicilian shepherd loved by the sea nymph Galatea, who was killed by the Cyclops Polyphemus and later turned into a river (the River Acis).","zh":"（专有名词）希腊—罗马神话人物：西西里的牧羊人阿喀斯（Acis），与海中仙女加拉忒亚（Galatea）相爱，被独眼巨人波吕斐摩斯（Polyphemus）杀死，后来被化为河流（阿喀斯河/Acis 河）。"},"examples":[{"en":"In the myth, Acis is transformed into a river after his death.","zh":"在神话里，阿喀斯死后被化作一条河。"},{"en":"The story of Acis and Galatea appears in Ovid’s writings.","zh":"阿喀斯与加拉忒亚的故事出现在奥维德的作品中。"}]}],"phonetic":"/ˈeɪsɪs/","extraExplanation":["“Acis”常见于文学、歌剧与艺术作品中，最有名的来源之一是罗马诗人奥维德（Ovid）的《变形记》（Metamorphoses）。","在英语里它通常作为人名或地名使用（如 River Acis），不太会像普通词汇那样在日常对话中出现。","读音在英语中多读作类似“AY-sis”，首音节重读。"]}
{"word":"acis","summary":{"en":"“ACIS” is usually an acronym (often pronounced like “aces”), and it can also be the proper name Acis from Greek myth (“Acis and Galatea”).","zh":"“ACIS”通常是缩写（常读作类似“aces”），也可以指希腊神话人物 Acis（“Acis 与 Galatea”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Acronym) Automated Commercial Information Service: a U.S. Customs service (historically) that provided trade and tariff information.","zh":"（缩写）Automated Commercial Information Service：美国海关（历史上使用的）一个提供贸易与关税信息的服务系统。"},"examples":[{"en":"The broker checked ACIS for the latest tariff classification guidance.","zh":"报关代理在 ACIS 上查询最新的关税归类指导。"}]},{"partOfSpeech":"other","definition":{"en":"(Proper name) Acis: a shepherd in Greek mythology, best known from the story of “Acis and Galatea,” also used as a character name in music and literature.","zh":"（专有名词）Acis：希腊神话中的牧羊人，因“Acis 与 Galatea（伽拉忒亚）”的故事而闻名，也常作为音乐与文学作品中的人物名。"},"examples":[{"en":"Handel’s pastoral opera features Acis and Galatea as the central lovers.","zh":"亨德尔的田园歌剧以 Acis 与 Galatea 这对恋人为主角。"},{"en":"In the myth, Acis is transformed into a river after a tragic death.","zh":"在神话中，Acis 在悲剧性死亡后化作一条河流。"}]}],"synonyms":["(acronym) depends on the organization/system","(myth name) —"],"phonetic":"/ˈeɪsɪs/","extraExplanation":["“ACIS”在不同领域可能指不同机构或系统名称；如果你是在特定场景（如移民、IT、教育、政府机构）看到它，请告诉我上下文，我可以给出更准确的释义。","作为人名的 Acis 常见于古典文化语境：其故事在奥维德《变形记》中有著名版本，后来影响了绘画、诗歌与歌剧等艺术形式。"]}
{"word":"acitate","summary":{"en":"A rare chemistry verb meaning to treat with acetic acid or convert into an acetate.","zh":"一个较少见的化学动词，指用乙酸处理或使其转化为乙酸盐/乙酸酯。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Chemistry) to treat a substance with acetic acid or to convert it into an acetate (a salt or ester of acetic acid).","zh":"（化学）用乙酸处理某物；或把某物转化为乙酸盐/乙酸酯。"},"examples":[{"en":"The lab procedure acitates the cellulose to improve its solubility.","zh":"这个实验步骤会对纤维素进行“乙酸化处理”，以提高其溶解性。"},{"en":"Under these conditions, the metal surface can be acitated and form an acetate layer.","zh":"在这些条件下，金属表面可能会被乙酸处理，并形成一层乙酸盐膜。"}]}],"synonyms":["acetylate","convert to an acetate","treat with acetic acid"],"phonetic":"/ˈæsɪteɪt/","extraExplanation":["“acitate”在现代英语中非常少见，主要出现在较旧或较专业的化学语境里；很多时候更常用的表达是“acetylate（乙酰化）”“convert to an acetate（转化为乙酸盐）”或“treat with acetic acid（用乙酸处理）”。","词形上它来自“acetic acid（乙酸）/ acetate（乙酸盐、乙酸酯）”。不同学科里“acetylate”和“acitate”可能被混用，但严格说“acetylate”更常见也更规范。"]}
{"word":"acity","summary":{"en":"Audacity means boldness—often the kind that feels shocking or rude.","zh":"Audacity 指“大胆”，但常带“让人震惊或无礼的放肆/厚脸皮”的意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Boldness and confidence, often shown by doing or saying something that seems shocking or daring.","zh":"大胆与自信（常指做或说出让人震惊或很敢的事）。"},"examples":[{"en":"She had the audacity to criticize her boss in public.","zh":"她竟敢当众批评她的老板。"},{"en":"I can’t believe the audacity of that driver cutting in line.","zh":"我真不敢相信那个司机竟然敢插队。"}]},{"partOfSpeech":"n.","definition":{"en":"(Uncountable) Rude or disrespectful boldness; nerve.","zh":"（不可数）无礼的胆大；放肆；厚脸皮。"},"examples":[{"en":"He apologized for his audacity after making the rude comment.","zh":"他说了那句无礼的话后，为自己的放肆道歉。"},{"en":"It takes audacity to demand a refund without a receipt.","zh":"没有小票还要求退款，真是够大胆（也有点厚脸皮）。"}]}],"synonyms":["boldness","nerve","cheek","impudence","brashness"],"phonetic":"/ɔˈdæsəti/","extraExplanation":["“audacity”常带有负面评价：不仅是“勇敢”，还暗含“太过分、没礼貌的胆量”。如果想表达更中性或正面的“勇气/胆识”，常用“courage”“boldness”“bravery”。","词源上来自拉丁语“audax”（大胆的）。在现代英语里更常用于描述“令人吃惊的胆子/厚颜无耻”。"]}
{"word":"aciurgy","summary":{"en":"Aciurgy is a rare, old term for medical treatment using needles, especially acupuncture.","zh":"Aciurgy 是一个罕见的旧词，指用针进行的医疗治疗，尤指针刺/针灸。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/old-fashioned) Treatment or minor surgery done with a needle; especially what we now call acupuncture (therapeutic needling).","zh":"（罕见/旧用）用针进行的治疗或小型操作；尤指今天所说的针刺疗法（针灸/针刺）。"},"examples":[{"en":"In some older medical writings, acupuncture was described as aciurgy.","zh":"在一些较早的医学著作中，acupuncture（针刺疗法）会被称为 aciurgy。"},{"en":"The physician mentioned aciurgy—using fine needles to relieve pain.","zh":"那位医生提到 aciurgy——用细针来缓解疼痛。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare) The art or practice of puncturing with a needle for medical purposes.","zh":"（极罕见）为医疗目的进行针刺/穿刺的技艺或做法。"},"examples":[{"en":"The book contrasts aciurgy with herbal remedies.","zh":"这本书把 aciurgy 与草药疗法作对比。"}]}],"synonyms":["acupuncture","needling","needle therapy"],"phonetic":"ˈæsɪˌɝːdʒi","extraExplanation":["这个词在现代英语里几乎不用，更多见于较早的医学英语或词典中。现在一般直接说 acupuncture（针灸/针刺）。","词源上可理解为与“针（acus/acu-）+ 操作/技艺（-urgy）”相关，含义接近“以针进行的医疗操作”。"]}

