{"word":"ACL","summary":{"en":"ACL most commonly means the anterior cruciate ligament in the knee; in tech it can mean access control list; in U.S. contexts it can mean the American Civil Liberties Union.","zh":"ACL 最常见指膝盖的前交叉韧带；在科技领域可指访问控制列表；在美国语境也可能指美国公民自由联盟（ACLU）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Anterior cruciate ligament: a strong band of tissue in the knee that helps stabilize the joint; often injured in sports.","zh":"前交叉韧带：膝关节内一条重要的韧带，用来稳定膝盖；在运动中很常见受伤。"},"examples":[{"en":"She tore her ACL during a soccer match and needed surgery.","zh":"她在一场足球比赛中撕裂了前交叉韧带（ACL），需要手术。"},{"en":"ACL injuries often require months of physical therapy.","zh":"ACL 受伤通常需要数月的物理治疗/复健。"}]},{"partOfSpeech":"other","definition":{"en":"Access control list: in computing, a list of rules that decides who can access a system, file, or network resource.","zh":"访问控制列表：在计算机领域，用来规定“谁可以访问什么资源（文件/系统/网络）”的一组权限规则。"},"examples":[{"en":"Update the ACL so only admins can edit the folder.","zh":"更新 ACL，让只有管理员可以编辑该文件夹。"},{"en":"The firewall uses an ACL to allow or block certain traffic.","zh":"防火墙使用 ACL 来允许或阻止特定的网络流量。"}]},{"partOfSpeech":"other","definition":{"en":"American Civil Liberties Union: a U.S. nonprofit organization that works to defend civil rights and freedoms.","zh":"美国公民自由联盟：美国的非营利组织，致力于捍卫公民权利与自由。"},"examples":[{"en":"The ACLU filed a lawsuit challenging the new policy.","zh":"ACLU 提起诉讼，质疑这项新政策。"},{"en":"She donated to the ACLU to support free speech protections.","zh":"她向 ACLU 捐款，以支持言论自由的保障。"}]}],"synonyms":["anterior cruciate ligament (full form)","access control list (full form)","ACLU (related abbreviation)"],"phonetic":"/ˌeɪ siː ˈɛl/","extraExplanation":["ACL 在英文里通常读作字母缩写 “A-C-L”。不同领域含义差很多：体育/医学里最常见指膝盖的前交叉韧带；IT/网络安全里常指 access control list（权限规则）；美国新闻语境里也可能指 ACLU（美国公民自由联盟）。","看到 ACL 时，可以靠上下文判断：出现 knee / surgery / tear 多半是韧带；出现 firewall / permissions / network 多半是访问控制列表；出现 lawsuit / civil rights 多半是美国公民自由联盟。"]}
{"word":"acle","summary":{"en":"“ACL” most commonly means the knee ligament (anterior cruciate ligament); in computing, it can mean “Access Control List.”","zh":"“ACL”最常见指膝盖的前十字韧带；在计算机领域也可指“访问控制列表”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the anterior cruciate ligament: a strong ligament inside the knee that helps keep the knee stable (often injured in sports).","zh":"（膝盖）前十字韧带：位于膝关节内部、帮助稳定膝盖的强韧带（运动中常见受伤）。"},"examples":[{"en":"He tore his ACL during a soccer match and needed surgery.","zh":"他在一场足球比赛中撕裂了前十字韧带（ACL），需要手术。"},{"en":"ACL injuries often require months of rehabilitation.","zh":"ACL 受伤通常需要数月的康复训练。"}]},{"partOfSpeech":"n.","definition":{"en":"Access Control List: a list of rules that decides who can access a computer system, file, or network resource.","zh":"访问控制列表：一组规则清单，用来决定谁能访问某个计算机系统、文件或网络资源。"},"examples":[{"en":"The administrator updated the ACL to block unknown users.","zh":"管理员更新了访问控制列表（ACL），以阻止未知用户。"},{"en":"Check the folder’s ACL if you can’t open the file.","zh":"如果你打不开文件，检查一下该文件夹的 ACL 权限设置。"}]}],"synonyms":["anterior cruciate ligament","access permissions (computing)","permissions list (computing)"],"phonetic":"/ˌeɪ.siːˈɛl/","extraExplanation":["你输入的“acle”在英语里通常不是一个常见单词；更常见的是缩写“ACL”。如果你本来想查的是“ankle（脚踝）”，告诉我我可以再为你做“ankle”的词条与例句。","在医学语境里通常写作“ACL”，口语中常说“an ACL injury”（ACL 受伤）。在计算机语境里也常写作“ACL”，读作字母 A-C-L。"]}
{"word":"acleidian","summary":{"en":"“acleidian” isn’t recognized as a common English word; it’s likely a misspelling or a proper name.","zh":"“acleidian”不是常见英语词，可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name (proper noun), or a very rare/technical term.","zh":"不是标准英语单词。可能是拼写错误、专有名词（人名/地名/作品名），或非常少见的专业术语。"},"examples":[{"en":"I couldn’t find “acleidian” in major English dictionaries—could you share the sentence where you saw it?","zh":"我在主要英语词典里找不到“acleidian”，你能提供你看到它的句子吗？"},{"en":"If you meant “Alcidean,” it relates to Heracles in Greek mythology.","zh":"如果你想写的是“Alcidean”，它与希腊神话中的赫拉克勒斯（Heracles）有关。"}]}],"phonetic":"/ˌækliˈdiən/","extraExplanation":["“acleidian”很可能是拼写误差。常见的接近拼写包括：\n- Alcidean（/ælˈsaɪdiən/，与赫拉克勒斯相关的文学/神话用词）\n- Akkadian（阿卡德语/阿卡德人的，历史语言学用语）\n- aceldama / Akeldama（宗教/地名用语，较少见）\n\n如果你把它出现的上下文（整句、来源领域：游戏/小说/学术/地名等）发来，我可以更准确判断你想查的词。"]}
{"word":"acleistocardia","summary":{"en":"A rare congenital condition where the chest wall doesn’t close properly and the heart is not fully inside the chest.","zh":"一种罕见先天异常：胸壁未正常闭合，导致心脏未完全位于胸腔内。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare congenital condition in which the heart is not fully enclosed within the chest (the chest wall fails to close properly), leaving the heart partially or completely outside the thoracic cavity","zh":"一种罕见的先天性异常：由于胸壁未能正常闭合，心脏未被完全包在胸腔内，可能部分或完全位于胸腔外"},"examples":[{"en":"Acleistocardia is an extremely rare birth defect usually diagnosed by prenatal ultrasound or at birth.","zh":"Acleistocardia 是一种极其罕见的先天缺陷，通常可在产前超声或出生时被诊断出来。"},{"en":"Because the heart is not protected by the chest wall, babies with acleistocardia need urgent specialized care.","zh":"由于心脏缺少胸壁保护，患有 acleistocardia 的婴儿通常需要紧急的专科救治。"}]}],"synonyms":["ectopia cordis","congenital thoracic wall defect"],"phonetic":"/əˌkliːstəˈkɑrdiə/","extraExplanation":["该词多见于医学/胚胎学语境，属于非常少用的术语。词源可拆为 a-（表示“无/不”）+ kleistos（希腊语“关闭的”）+ kardia（“心脏”），字面含义接近“心脏未被关闭/包裹”。在现代临床写作中，更常见的相关术语是 ectopia cordis（心脏异位/心脏外露），但两者并不一定在所有文献中完全等同，具体以文章对畸形范围的界定为准。"]}
{"word":"acleistous","summary":{"en":"Acleistous means “not closed; remaining open,” especially in botanical descriptions.","zh":"acleistous 意为“不闭合、保持开放”，尤用于植物学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany, rare) Not closed; staying open rather than shutting (for example, a flower that does not close).","zh":"（植物学，少见）不闭合的；保持开放而不是合拢的（如花不合拢）。"},"examples":[{"en":"Some desert plants have acleistous flowers that remain open during the cool morning hours.","zh":"一些沙漠植物的花是acleistous的，会在凉爽的清晨保持开放。"},{"en":"The botanist described the species as acleistous because its petals did not close at night.","zh":"植物学家把这种植物描述为acleistous，因为它的花瓣在夜里不会合拢。"}]}],"synonyms":["open","unclosed","not closed","non-cleistogamous"],"phonetic":"/ˌeɪˈklaɪstəs/","extraExplanation":["这个词非常罕见，多见于植物学描述。词源可理解为希腊语前缀 a-（“不、无”）+ kleistos（“关闭的”），字面意思就是“未关闭的”。在实际阅读中，你更常见到的相关词是 **cleistogamous**（闭花受精的）/ **non-cleistogamous**（非闭花受精的）或直接用 **open** 来描述花“开放”。"]}
{"word":"Aclemon","summary":{"en":"“Aclemon” isn’t a standard English word; it’s likely a misspelling or a name.","zh":"“Aclemon”不是标准英语词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most likely a misspelling or a proper name (e.g., a username, brand, or surname).","zh":"不是标准英文单词；更可能是拼写错误或专有名词（如用户名、品牌名或姓氏）。"},"examples":[{"en":"I couldn’t find “Aclemon” in a standard English dictionary; could you share the sentence you saw it in?","zh":"我在常见英语词典里找不到 “Aclemon”；你能把它出现的句子发我吗？"},{"en":"If you meant “acumen,” it describes sharp judgment and insight.","zh":"如果你想写的是 “acumen”，它表示“敏锐的判断力与洞察力”。"}]}],"phonetic":"/ˈæk.lə.mən/","extraExplanation":["“Aclemon”在英语里没有公认的常用词条。最常见的情况是拼写想写成以下之一：\n1) acumen（洞察力/精明）\n2) clement（仁慈的；气候温和的）\n3) a lemon（口语：劣质品/买到的“坑货”；也可直译“一颗柠檬”）\n把你看到它的上下文（完整句子或图片）发来，我可以帮你准确判断并给出对应释义与用法。"]}
{"word":"aclemon","summary":{"en":"“aclemon” is not a standard English dictionary word; it’s likely a name/username or a misspelling (possibly related to “lemon”).","zh":"“aclemon”不是标准英语词条；更可能是名字/用户名或拼写错误（可能与“lemon”有关）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling, a username, or a proper name (e.g., a brand or surname).","zh":"不是标准英语单词，更可能是拼写错误、用户名，或专有名词（如品牌/姓氏）。"},"examples":[{"en":"I couldn’t find “aclemon” in an English dictionary—did you mean “a lemon” or “lemon”?","zh":"我在英语词典里找不到“aclemon”——你是想写“a lemon”还是“lemon”吗？"},{"en":"“aclemon” looks like a username rather than a common English word.","zh":"“aclemon”看起来更像用户名，而不是常见英语词。"}]}],"synonyms":["(none—nonstandard term)"],"phonetic":"/ˈeɪklɛmən/","extraExplanation":["如果你想查的是“lemon /ˈlɛmən/”（柠檬），或短语“a lemon”（口语：不靠谱/有毛病的东西，常指买到的车或产品），告诉我你原本想表达的意思或给我一个句子，我可以按正确词条为你整理：发音、词性、常用搭配、例句等。","如果这是人名/品牌名/网名，也可以告诉我它出现的场景（例如在哪篇文章、哪里看到的），我可以帮你判断可能的来源与含义。"]}
{"word":"aclidian","summary":{"en":"“Aclidian” is usually a misspelling of “Euclidean,” meaning related to Euclid or classical geometry on flat space.","zh":"“aclidian”通常是“Euclidean”的拼写错误，指与欧几里得或经典的平面（欧氏）几何有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Euclid or to the traditional geometry based on straight lines, flat planes, and familiar rules (like the angles of a triangle adding up to 180°).","zh":"与欧几里得有关的；指基于直线与平面等“传统几何”规则的（如三角形内角和为180°）。"},"examples":[{"en":"In Euclidean geometry, parallel lines never meet.","zh":"在欧几里得几何中，平行线永不相交。"},{"en":"The shortest path in a Euclidean plane is a straight line.","zh":"在欧几里得平面中，最短路径是一条直线。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who studies or follows Euclid’s geometry (less common).","zh":"研究或遵循欧几里得几何的人（较少见）。"},"examples":[{"en":"The textbook was written for beginners, not just for Euclideans.","zh":"这本教材是写给初学者的，不只是写给欧几里得几何的研究者。"}]}],"synonyms":["classical (geometry)","plane (geometry)","Euclid-based"],"phonetic":"/juːˈklɪdiən/","extraExplanation":["“aclidian”通常被认为是拼写错误，更常见的正确拼写是“Euclidean”。它来自古希腊数学家欧几里得（Euclid），他的著作《几何原本》（Elements）奠定了经典几何体系。","在日常英语里，“Euclidean”最常出现在数学、物理、计算机图形学与机器学习中，例如“Euclidean distance（欧几里得距离）”。"]}
{"word":"aclinal","summary":{"en":"Aclinal means not sloping; nearly horizontal, especially describing rock layers.","zh":"aclinal 指不倾斜、近乎水平的（尤用于描述岩层）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not inclined; having little or no slope (often used in geology for layers that are essentially horizontal)","zh":"不倾斜的；几乎没有坡度的（地质学中常指地层基本水平）"},"examples":[{"en":"In this region, the rock layers are mostly aclinal, so they appear nearly flat.","zh":"在这个地区，岩层大多是不倾斜的，所以看起来几乎是平的。"},{"en":"An aclinal surface can make drainage patterns look very different from those on a steep slope.","zh":"不倾斜的地表会让排水（径流）形态看起来和陡坡上的很不一样。"}]}],"synonyms":["level","flat","horizontal","noninclined"],"phonetic":"/ˌeɪˈklaɪnəl/","extraExplanation":["词源提示：a- 常表示“无、非”（如 asymmetrical 不对称），cline 来自“倾斜/坡度”的概念；aclinal 就是“无倾斜”。","用法提示：aclinal 多见于地质学或地形描述，日常英语更常用 flat（平的）、level（水平的）、horizontal（水平的）来表达。"]}
{"word":"aclinic","summary":{"en":"Aclinic means having zero magnetic dip (inclination), especially near the magnetic equator.","zh":"aclinic 指“无磁倾角（磁倾为零）的”，常用于描述靠近磁赤道的地磁现象。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Geomagnetism) Having zero magnetic inclination (dip); the Earth’s magnetic field is horizontal at that location.","zh":"（地球磁学）无磁倾角（磁倾为零）的；在该处地磁场方向与地面平行。"},"examples":[{"en":"The compass needle has no dip on the aclinic line near the magnetic equator.","zh":"在靠近磁赤道的无倾线附近，罗盘指针不会出现下倾。"},{"en":"Scientists mapped aclinic regions to understand changes in Earth’s magnetic field.","zh":"科学家绘制无倾区域图，以了解地球磁场的变化。"}]}],"synonyms":["non-dipping","zero-inclination"],"phonetic":"/eɪˈklɪnɪk/","extraExplanation":["“aclinic”常见于地球物理/航海/测量语境，和“magnetic inclination（磁倾角）/dip（磁倾）”一起出现。磁倾角为0的地方常称为“aclinic line（无倾线）”，大致接近“magnetic equator（磁赤道）”，但二者不一定完全重合。","词源上：a-（无、不）+ -clinic（倾斜/斜躺之意的词根），整体表达“没有倾斜”。"]}
{"word":"acloud","summary":{"en":"“A cloud” can mean a cloud in the sky, or (figuratively) a feeling of worry or sadness over someone/something.","zh":"“a cloud”既可指天空中的云，也可比喻笼罩在某人/某事上的忧虑或阴影。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a visible mass of very small water drops or ice crystals in the sky","zh":"（天空中的）云"},"examples":[{"en":"Look—there’s a dark cloud above the mountain.","zh":"看——山上方有一朵乌云。"},{"en":"A cloud covered the sun for a moment.","zh":"一朵云一度遮住了太阳。"}]},{"partOfSpeech":"phrase","definition":{"en":"(figurative) something that brings worry, sadness, or uncertainty; a bad feeling hanging over a person or situation","zh":"（比喻）阴影；忧虑/不安；笼罩在心头的困扰"},"examples":[{"en":"There was a cloud over the celebration after the bad news.","zh":"坏消息传来后，庆祝活动上笼罩着阴影。"},{"en":"Her face clouded with worry when she heard the result.","zh":"听到结果时，她的脸上露出忧虑的神情。"}]}],"synonyms":["a mass of cloud","a dark cloud (figurative)","a shadow (figurative)","gloom (figurative)"],"phonetic":"/ə klaʊd/","extraExplanation":["你输入的“acloud”通常写作“a cloud”（两个词）。如果你想查的是科技里的“cloud（云端/云计算）”，也可以告诉我，我可以给出那个词的词条。"]}
{"word":"ACLS","summary":{"en":"ACLS is Advanced Cardiovascular Life Support—emergency guidelines and training for life-threatening heart-related situations.","zh":"ACLS指“高级心血管生命支持”，用于处理危及生命的心脏相关紧急情况的指南与培训。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Advanced Cardiovascular Life Support: a set of emergency medical guidelines and training for treating life-threatening heart and circulation problems (such as cardiac arrest).","zh":"高级心血管生命支持：一套用于处理危及生命的心脏与循环系统紧急情况（如心脏骤停）的急救指南与培训体系。"},"examples":[{"en":"The hospital requires nurses in the ICU to have ACLS certification.","zh":"医院要求重症监护室（ICU）的护士具备ACLS认证。"},{"en":"The paramedic followed the ACLS algorithm during the resuscitation.","zh":"在复苏过程中，急救员按照ACLS流程（算法）进行处理。"}]},{"partOfSpeech":"n.","definition":{"en":"An ACLS course or certification (informal usage).","zh":"（口语）ACLS课程或认证。"},"examples":[{"en":"I’m renewing my ACLS this weekend.","zh":"我这周末要续证ACLS。"},{"en":"She passed ACLS and can now lead a code team.","zh":"她通过了ACLS，现在可以带领抢救团队（code team）。"}]}],"synonyms":["Advanced Cardiovascular Life Support","Advanced Cardiac Life Support","ACLS certification","ACLS course"],"phonetic":"/ˌeɪ siː ɛl ˈɛs/","extraExplanation":["ACLS常见于美国心脏协会（AHA）的培训体系中，通常面向医护人员（如医生、护士、急救员）。内容包括心肺复苏（CPR）、电除颤、用药、心律失常识别，以及按“算法/流程（algorithm）”进行团队协作抢救。","在英语里ACLS多按字母读作“A-C-L-S”，而不是当作一个完整单词发音。","有时你会看到较旧或口语化的说法“Advanced Cardiac Life Support”，含义基本相同，但现代更常用“Cardiovascular”。"]}
{"word":"ACLU","summary":{"en":"ACLU = American Civil Liberties Union, a U.S. group that defends civil rights and liberties, often in court.","zh":"ACLU 指“美国公民自由联盟”，美国捍卫公民权利与自由的组织，常通过诉讼维权。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"American Civil Liberties Union: a U.S. nonprofit organization that defends civil rights and civil liberties (such as free speech, privacy, due process, and equal protection), often through court cases and public advocacy.","zh":"美国公民自由联盟：美国的非营利组织，致力于捍卫公民权利与自由（如言论自由、隐私权、正当法律程序、平等保护等），常通过诉讼与公共倡议来推动。"},"examples":[{"en":"The ACLU filed a lawsuit claiming the law violates free speech.","zh":"美国公民自由联盟（ACLU）提起诉讼，称该法律侵犯言论自由。"},{"en":"She donated to the ACLU because she cares about privacy rights.","zh":"她向ACLU捐款，因为她关心隐私权。"},{"en":"The ACLU often takes cases that are politically controversial.","zh":"ACLU经常接手在政治上有争议的案件。"}]}],"synonyms":["American Civil Liberties Union","civil liberties group"],"phonetic":"/ˌeɪ.siː.ɛlˈjuː/","extraExplanation":["ACLU 是缩写，读作字母：A-C-L-U。写作 ACLU（全大写），正式场合第一次出现时常写全称 American Civil Liberties Union，后面再用 ACLU。","该组织成立于 1920 年，总部在纽约；主要通过提起或支持诉讼（litigation）来“测试”或挑战法律与政策是否违宪。","ACLU 的特点是：不一定只为“自己认同的人”辩护，而是强调宪法权利适用于所有人，因此有时会为社会上不受欢迎的群体或观点提供法律支持，这也使它常成为公共争论的焦点。","常见搭配：ACLU lawyer（ACLU 律师）、ACLU lawsuit（ACLU 诉讼）、ACLU chapter/affiliate（ACLU 州分会/地方机构）。"]}
{"word":"aclu","summary":{"en":"ACLU = American Civil Liberties Union, a U.S. group that protects civil rights and freedoms, often through lawsuits.","zh":"ACLU 指美国公民自由联盟，常通过诉讼与倡导来维护公民权利与自由。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the American Civil Liberties Union, a U.S. nonprofit organization that defends civil rights and civil liberties through advocacy and legal action","zh":"美国公民自由联盟（ACLU），一家美国非营利组织，通过倡导与诉讼来捍卫公民权利与公民自由"},"examples":[{"en":"The ACLU filed a lawsuit challenging the new law.","zh":"ACLU 提起诉讼，质疑这项新法律。"},{"en":"She supports the ACLU because of its work on free speech and privacy.","zh":"她支持 ACLU，因为它在言论自由与隐私方面的工作。"},{"en":"The case drew national attention after the ACLU got involved.","zh":"ACLU 介入后，这个案件引起了全国关注。"}]}],"synonyms":["American Civil Liberties Union","ACLU (initialism)"],"phonetic":"/ˌeɪ.siːˈɛl.juː/","extraExplanation":["ACLU 通常读作字母缩写（A-C-L-U），全称是 American Civil Liberties Union。","它成立于 1920 年，在美国公共讨论中常与“言论自由、宗教自由、隐私权、正当程序、反歧视”等议题联系在一起。","在新闻语境里，你会看到类似表达：the ACLU sued…（ACLU 起诉……）、the ACLU argued…（ACLU 主张/辩称……）。"]}
{"word":"aclydes","summary":{"en":"“aclydes” isn’t a standard word; it likely means “Clydes” (Clydesdales) or “Clyde’s.”","zh":"“aclydes”不是标准词；多半是“Clydes”（指Clydesdales挽马）或“Clyde’s”（Clyde的所有格）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a misspelling or a shortened form of “Clydes” (informal short for “Clydesdales,” the breed of large draft horses), or it may be intended as “Clyde’s” (the possessive form of the name Clyde).","zh":"不是标准英语单词；更可能是拼写错误，或是“Clydes”的缩写用法（常口语指“Clydesdales”，一种大型挽马/驮马），也可能想写成“Clyde’s”（人名Clyde的所有格）。"},"examples":[{"en":"I think you meant “Clydes,” short for “Clydesdales.”","zh":"我觉得你想写的是“Clydes”，是“Clydesdales”的简称。"},{"en":"Is this “Clyde’s” bike or yours?","zh":"这是Clyde的自行车还是你的？"}]}],"synonyms":["Clydes","Clydesdales","Clyde’s"],"phonetic":"/klaɪdz/","extraExplanation":["“Clydesdale”原本指苏格兰的克莱兹代尔地区（Clydesdale），后来成为该地区培育出的挽马品种名称；在美国文化里，Budweiser广告里的Clydesdales（百威挽马）也很有名，所以有人会口语说“the Clydes”。","如果你是在写人名或店名，通常需要大写：Clydes / Clyde’s。若你能提供一句包含“aclydes”的原句，我可以更准确判断你想表达的意思。"]}
{"word":"aclys","summary":{"en":"“aclys” is not a standard English word; it’s likely a misspelling or a name/abbreviation.","zh":"“aclys”不是标准英语单词；更可能是拼写错误或名字/缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name/abbreviation.","zh":"不是标准英语单词，可能是拼写错误，或是名字/缩写。"},"examples":[{"en":"I can’t find “aclys” in an English dictionary—did you mean “acolytes” or “acres”?","zh":"我在英语词典里查不到“aclys”——你是不是想写“acolytes（追随者/助手）”或“acres（英亩）”？"}]}],"extraExplanation":["“aclys”看起来更像打字或拼写误差。最接近的常见词之一是 **acolyte**（复数 **acolytes**），意思是“助手、侍从；（尤指）追随者/门徒”。如果你能提供它出现的句子或上下文（例如：一整句、文章主题、你想表达的中文意思），我可以更准确判断你想查的词。"]}

