{"word":"ACM","summary":{"en":"ACM most commonly means the Association for Computing Machinery, a major global professional organization for computing.","zh":"ACM 最常见的含义是“美国计算机协会”，是全球重要的计算领域专业组织。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(acronym) Association for Computing Machinery: the world’s largest and one of the most influential professional organizations for computing (computer science, software, and related fields).","zh":"（缩写）美国计算机协会：全球规模最大、影响力最强的计算领域专业学术组织之一（涵盖计算机科学、软件工程等）。"},"examples":[{"en":"She published her first paper in an ACM conference.","zh":"她的第一篇论文发表在 ACM 的会议上。"},{"en":"You can find the article on the ACM Digital Library.","zh":"你可以在 ACM 数字图书馆里找到这篇文章。"},{"en":"He joined ACM to connect with other computer science students.","zh":"他加入 ACM 是为了和其他计算机专业学生交流。"}]},{"partOfSpeech":"other","definition":{"en":"(acronym, less common in general English) A short label used by some groups to name a computing club or contest team (for example, a university “ACM” programming team).","zh":"（缩写，一般英语中较少单独这样用）一些学校/社团用来指代编程社团或竞赛队（例如大学里的“ACM”程序设计队）。"},"examples":[{"en":"Our school’s ACM team trains for programming contests every weekend.","zh":"我们学校的 ACM 队每周末训练参加程序设计竞赛。"},{"en":"She is the captain of the ACM programming club.","zh":"她是 ACM 编程社团的队长。"}]}],"synonyms":["Association for Computing Machinery","ACM (professional society)","ACM Digital Library","ACM SIG"],"phonetic":"ˌeɪ siː ˈɛm","extraExplanation":["在计算机领域里，“ACM”通常读作字母音（A-C-M），常见搭配包括：ACM conference（ACM 会议）、ACM journal（ACM 期刊）、ACM Digital Library（ACM 数字图书馆）。","ACM 还组织许多专业分会（SIG，如 SIGGRAPH、SIGCOMM），并与编程竞赛文化关联紧密，例如 ICPC（国际大学生程序设计竞赛）常被口语上与“ACM 竞赛/ACM 题”联系起来。"]}
{"word":"Acmaea","summary":{"en":"Acmaea is an older scientific genus name used for certain limpets (marine snails).","zh":"Acmaea 是一个较旧的科学属名，曾用于指某些帽贝（海洋腹足类）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific genus name formerly used for certain limpets (small sea snails with a cone-shaped shell) found on rocks along seashores.","zh":"（生物分类）曾用于某些帽贝/石鳖类（海边岩石上常见的锥形壳小海螺）的一属名。"},"examples":[{"en":"In older biology books, some limpets were classified under the genus Acmaea.","zh":"在较早的生物学书籍里，一些帽贝曾被归入 Acmaea 这一属。"},{"en":"The label says “Acmaea,” but many modern sources use a different genus name for the same kind of limpet.","zh":"标签上写着“Acmaea”，但很多现代资料会用不同的属名来指同一类帽贝。"}]}],"synonyms":["limpet (common name, not the same as the genus)"],"phonetic":"/ækˈmiːə/","extraExplanation":["“Acmaea”是拉丁化的学名用法，常见于旧版分类系统；在较新的分类研究中，其中一些物种可能被重新归入其他属（因此你在现代资料里可能不常见这个属名）。","作为学名，首字母大写、斜体书写（Acmaea）；单复数在科学写作中通常按拉丁学名规则处理，但日常英语里更常直接说 limpet（帽贝/海贝）。"]}
{"word":"acmaea","summary":{"en":"Acmaea is an older scientific genus name for some limpets; modern sources often reclassify them under other genera (e.g., Lottia).","zh":"Acmaea 是一些帽贝的旧科学属名；现代资料中多已改归到其他属（如 Lottia）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus name formerly used for certain limpets (marine snails with a cone-shaped shell), now largely treated as a synonym of other genera such as Lottia in modern taxonomy.","zh":"（旧属名）Acmaea：曾用于指某些帽贝（生活在海里的圆锥形壳的海螺/海蜗牛）的一类属名；在现代分类中多被视为其他属（如 Lottia）的同物异名。"},"examples":[{"en":"In older field guides, some limpets were listed under the genus Acmaea.","zh":"在较老的野外图鉴中，一些帽贝曾被归在 Acmaea 属下。"},{"en":"The specimen was labeled “Acmaea,” but the museum updated it to Lottia.","zh":"这份标本原先标注为“Acmaea”，但博物馆后来将其更新为 Lottia。"}]}],"synonyms":["limpet","Lottia (related modern genus)"],"phonetic":"/ækˈmiːə/","extraExplanation":["这是一个偏生物分类学/贝类学（malacology）领域的词：在旧文献中常见，但在新分类系统里很多物种已改归到 Lottia 等属，因此你可能在学术文章、标本标签或老图鉴中更容易遇到它。","词源上常被认为与希腊语 akmē（意为“顶点、尖端、极点”）有关，可能与帽贝外形的“尖顶”相呼应，但具体命名背景需以原始命名文献为准。"]}
{"word":"Acmaeidae","summary":{"en":"Acmaeidae is an older scientific family name for certain marine limpets.","zh":"Acmaeidae 是某些海洋帽贝的旧科名（见于较老分类）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former scientific family name for certain marine limpets (small sea snails with cone-shaped shells) that live on rocks along seashores.","zh":"（旧分类）某些海洋帽贝（贴附在海岸岩石上的小型海螺，壳呈圆锥状）的科名。"},"examples":[{"en":"Some older field guides list these limpets under the family Acmaeidae.","zh":"一些较早的野外图鉴会把这些帽贝归在 Acmaeidae（帽贝科）下。"},{"en":"Researchers may mention Acmaeidae when discussing historical classifications of limpets.","zh":"研究者在讨论帽贝的历史分类时，可能会提到 Acmaeidae。"}]}],"synonyms":["limpet family (historical use)"],"phonetic":"/ækˈmiːədiː/","extraExplanation":["这是一个动物分类学术语，常见于较老的文献或旧版图鉴。现代分类中，许多原先归入 Acmaeidae 的物种常被并入或改归到其他科（例如 Lottiidae 等），具体取决于采用的分类系统与分子证据。","词形来自拉丁化的学名结构：科名通常以 “-idae” 结尾，表示“……科”。发音上重音通常落在词干部分（Acmae-）。"]}
{"word":"acmaeidae","summary":{"en":"Acmaeidae is a former scientific family name for certain limpets; many modern sources treat it as part of Lottiidae.","zh":"Acmaeidae 是某些帽贝类的旧科名；许多现代资料将其并入（或视作同义于）Lottiidae。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former scientific family name for certain true limpets (marine snails) in taxonomy; now often treated as part of the family Lottiidae in many modern classifications","zh":"（旧）海洋“真帽贝/笠螺”（一种海螺）的一个科名；在许多现代分类中常被并入 Lottiidae（笠螺科）"},"examples":[{"en":"In older marine biology books, Acmaeidae is used for several common limpet species.","zh":"在较旧的海洋生物学书籍中，Acmaeidae 常用来指若干常见的帽贝类物种。"},{"en":"Some databases list the family Acmaeidae as a historical synonym of Lottiidae.","zh":"一些数据库会把科名 Acmaeidae 标注为 Lottiidae 的历史同义名。"}]}],"synonyms":["Lottiidae (in many modern classifications)","limpet family (general meaning)"],"phonetic":"/ˌækmiˈiːdiˌiː/","extraExplanation":["这是一个“分类学名称”（taxonomic name），多见于学术语境而不用于日常英语。","分类名会随着研究变化而调整：过去一些“帽贝”被归入 Acmaeidae，但在不少较新的系统中常改归/合并到 Lottiidae 等类群；不同资料可能会因采用的分类体系不同而出现差异。","词形上：-idae 是动物“科”的常见拉丁化后缀（如 Felidae 猫科）。"]}
{"word":"acmaesthesia","summary":{"en":"Acmaesthesia means reduced or absent sensation (often touch), i.e., numbness.","zh":"acmaesthesia 指感觉（常为触觉）减退或消失，即麻木。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical term for reduced or lost sensation (especially the sense of touch); numbness.","zh":"（医学）感觉减退或感觉消失（尤指触觉）；麻木。"},"examples":[{"en":"After the nerve injury, she reported acmaesthesia in two fingers.","zh":"神经受伤后，她说两根手指出现了触觉减退（麻木）。"},{"en":"The doctor tested for acmaesthesia by lightly touching different areas of the skin.","zh":"医生通过轻触皮肤不同部位来检查是否存在感觉减退。"}]}],"synonyms":["hypoesthesia","anesthesia","numbness","loss of sensation"],"phonetic":"/ˌækmiˈiːsθiə/","extraExplanation":["这是一个非常少见、较偏旧式的医学用词；现代临床上更常用 hypoesthesia（感觉减退）、anesthesia（感觉消失/麻醉）或 numbness（麻木）来表达。","词源与 anesthesia 等词同源，来自希腊语 aisthēsis（感觉）。不同资料中可能也会见到拼写变体（如 acmesthesia）；遇到时可根据上下文理解为“感觉（尤其触觉）减弱或消失”。"]}
{"word":"acmatic","summary":{"en":"A formal word meaning “at the peak” (especially the peak stage of an illness or fever).","zh":"较正式用词，意为“处于巅峰/全盛期”（尤指疾病或发热的高峰期）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"at the highest point; in full strength, maturity, or intensity","zh":"处于最高点的；全盛的；达到巅峰强度的"},"examples":[{"en":"The athlete’s performance was acmatic in her late twenties.","zh":"这位运动员在二十多岁后期的表现处于巅峰。"},{"en":"In an acmatic phase of the crisis, small mistakes can have big consequences.","zh":"在危机的高峰阶段，小错误也可能带来严重后果。"}]},{"partOfSpeech":"adj.","definition":{"en":"(medicine, more formal) relating to the peak stage of a fever or disease—when symptoms are strongest","zh":"（医学，较正式）指发热或疾病的高峰期——症状最强烈的阶段"},"examples":[{"en":"The doctor noted the illness had reached its acmatic stage.","zh":"医生记录该疾病已进入高峰期。"},{"en":"Treatment focused on stabilizing the patient during the acmatic period.","zh":"治疗重点是在高峰期稳定病人状况。"}]}],"synonyms":["peak","culminating","at its height","apex","full-blown"],"phonetic":"/ækˈmætɪk/","extraExplanation":["“acmatic”源自希腊语 akmē（意为“顶点、巅峰、最盛期”）。它在现代英语中比较少见，更多见于较正式的写作或医学语境。","学习时注意别和“acousmatic”（指“只闻其声不见其人/物”的声音体验，常见于音乐与声音艺术）混淆；两者词形相近但意义无关。"]}
{"word":"acme","summary":{"en":"Acme means the highest point or peak of something; it’s also widely used as a sample or fictional company/brand name.","zh":"Acme指某事物的最高点/顶峰；也常被用作示例或虚构的公司/品牌名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the highest point or best/most successful stage of something; a peak","zh":"（某事物的）最高点；顶峰；全盛时期"},"examples":[{"en":"Her career reached its acme when she won the national award.","zh":"她获得全国大奖时，事业达到了顶峰。"},{"en":"The restaurant was at the acme of popularity in the 1990s.","zh":"这家餐厅在20世纪90年代红极一时。"},{"en":"They worked for years to bring the project to its acme.","zh":"他们努力了多年，才把项目做到最理想的巅峰状态。"}]},{"partOfSpeech":"n.","definition":{"en":"(often capitalized) a name used for a company or brand, sometimes as a generic placeholder meaning “any company”","zh":"（常大写）公司/品牌名称；有时用作泛指的“某家公司/任何公司”"},"examples":[{"en":"Acme Corp. appears as a sample company name in many textbooks.","zh":"“Acme Corp.”常作为教材里的示例公司名出现。"},{"en":"The contract template lists Acme as the buyer and ExampleCo as the seller.","zh":"合同模板里把Acme写成买方，把ExampleCo写成卖方。"}]}],"synonyms":["peak","pinnacle","high point","culmination","zenith"],"phonetic":"/ˈækmi/","extraExplanation":["“acme”源自希腊语，原意与“顶点、最高处”有关，因此在正式写作中常用来表达“巅峰/极致”。","在北美流行文化里，“ACME”常出现在动画《乐一通》（Looney Tunes）中，作为一种虚构品牌（例如各种夸张的道具），所以也常被用来做示例或占位的公司名。"]}
{"word":"acmes","summary":{"en":"“Acmes” means multiple highest points or peak stages; it can also refer to the cartoon-style brand name “Acme.”","zh":"“acmes”指多个“顶点/巅峰”；也可指动画等流行文化中的虚构品牌名“Acme”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the highest points or best stages of something (plural of “acme”)","zh":"顶点；巅峰；最佳阶段（“acme”的复数）"},"examples":[{"en":"These athletes are at the acmes of their careers.","zh":"这些运动员正处在他们职业生涯的巅峰。"},{"en":"The novel shows a family’s life at its acmes and its lowest moments.","zh":"这部小说展现了一个家庭生活的高峰与低谷。"},{"en":"In the 1960s, the band reached new acmes of popularity.","zh":"在20世纪60年代，这支乐队的人气达到了新的巅峰。"}]},{"partOfSpeech":"n.","definition":{"en":"(in pop culture) products or companies named “Acme,” often used as a generic brand name, especially in cartoons","zh":"（流行文化）名为“Acme”的产品/公司；常作为“万能品牌名”，尤其在动画片里"},"examples":[{"en":"In cartoons, characters often buy gadgets from Acme.","zh":"在动画片里，角色常常购买来自 Acme 的小玩意。"},{"en":"The joke uses “Acme” as a fake brand name anyone will recognize.","zh":"这个笑点用“Acme”当作大家都懂的虚构品牌名。"}]}],"synonyms":["peaks","zeniths","pinnacles","high points","apogees"],"phonetic":"ˈækmiz","extraExplanation":["“acme”源自希腊语 akmē，原意与“顶点、最高点”有关，所以“acmes”就是“多个顶点/巅峰”。","在英语文化里，“Acme”因经典动画（如《Wile E. Coyote and the Road Runner》）而出名：Acme 常被用来代表“随处可见的普通品牌/夸张的万能供应商”，带有幽默和讽刺效果。"]}
{"word":"acmesthesia","summary":{"en":"A rare term for extreme, peak-level sensitivity or sensation.","zh":"指感觉/敏感度达到“顶点”的极度敏感（罕见术语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An unusual or rare term meaning the highest (peak) degree of sensation or sensitivity; extreme sensitivity.","zh":"（罕见术语）指感觉/敏感度达到最高点；极度敏感。"},"examples":[{"en":"During the migraine, she described a kind of acmesthesia—every sound and light felt painfully intense.","zh":"偏头痛发作时，她形容那是一种“感觉达到顶点”的状态——每一点声音和光线都痛得厉害。"},{"en":"The clinician noted episodes of acmesthesia, though the report used the more common term hyperesthesia.","zh":"临床医生记录了几次“感觉极度敏锐”的发作，不过报告里更常用的词是 hyperesthesia（感觉过敏）。"}]}],"synonyms":["hyperesthesia","hypersensitivity","heightened sensitivity"],"phonetic":"/ˌækmiˈsθiʒə/","extraExplanation":["这个词很少见，多出现在较旧或非常专业的医学/神经学语境中。更常用、更容易在现代资料里查到的近义词是 hyperesthesia（感觉过敏、感觉异常敏锐）。","词源可拆解理解：acme 表“顶点/巅峰”，-esthesia 表“感觉/知觉”（同根于 anesthesia 麻醉、aesthetic 美学/审美）。把两部分合起来，就是“感觉达到顶点”。"]}
{"word":"Acmet","summary":{"en":"Acme means the highest point or the most perfect example of something.","zh":"Acme 指某事物的最高点（巅峰）或最完美的典范。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the highest point or peak of something (success, power, quality, etc.)","zh":"顶点；巅峰（指成功、权力、质量等达到最高点）"},"examples":[{"en":"She reached the acme of her career in her early forties.","zh":"她在四十出头时达到了事业的巅峰。"},{"en":"This painting is considered the acme of his artistic style.","zh":"这幅画被认为是他艺术风格的巅峰之作。"}]},{"partOfSpeech":"n.","definition":{"en":"the best or most perfect example of a particular type of thing","zh":"典范；最佳例子（某类事物中最完美/最出色的代表）"},"examples":[{"en":"For many people, that small café is the acme of comfort.","zh":"对很多人来说，那家小咖啡馆是“舒适”的典范。"},{"en":"Her calm response was the acme of professionalism.","zh":"她冷静的回应体现了最专业的水准。"}]}],"synonyms":["peak","pinnacle","summit","zenith","apex"],"phonetic":"/ˈækmi/","extraExplanation":["“Acmet”在英语里不是常见标准词形；你可能想查的是 **acme**。","**acme** 来自希腊语 *akmē*，原意与“尖端、最高点、成熟期”有关，因此现代英语里常用来表示“巅峰/顶点”。","常见搭配：**the acme of + 名词**（……的巅峰/典范），如 *the acme of success*（成功的巅峰）。","文化小提示：美国动画/影视里常出现虚构品牌 **ACME**（常被用作“万能公司名”），但那是专有名词用法，不等同于普通名词 *acme* 的“巅峰”意思。"]}
{"word":"acmic","summary":{"en":"“Acmic” means “at or relating to the peak,” especially the peak stage of a fever or illness.","zh":"“acmic”表示“处于/与顶峰有关”，尤指发热或疾病的高峰阶段。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the highest point or peak (especially the peak stage of an illness, fever, or a process).","zh":"与最高点/顶点有关的；（尤指疾病、发热或某过程的）高峰期的。"},"examples":[{"en":"The patient entered the acmic phase of the fever during the night.","zh":"病人在夜间进入了发热的高峰期。"},{"en":"Doctors monitored her closely when symptoms were acmic.","zh":"当症状处于高峰时，医生对她进行了密切监测。"},{"en":"After the acmic point, his temperature slowly began to drop.","zh":"过了高峰点后，他的体温开始缓慢下降。"}]}],"synonyms":["peak","climactic","pinnacle (more general)"],"phonetic":"/ˈækmɪk/","extraExplanation":["“acmic”来自“acme”（顶点、极点），词源可追溯到希腊语，原意与“最高点”相关。","在现代英语里，“acmic”多见于医学或较正式的写作，常搭配：acmic phase（高峰期）、acmic stage（顶峰阶段）。日常表达里更常说 “peak” 或 “at its highest point”。"]}
{"word":"Acmispon","summary":{"en":"Acmispon is a botanical genus name for certain pea-family plants, mainly in western North America.","zh":"Acmispon 是一个植物学属名，指豆科的一类植物，主要分布在北美西部。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants in the pea family (Fabaceae), mostly native to western North America; many species were formerly classified in the genus Lotus","zh":"紫云英科（豆科 Fabaceae）的一属开花植物，多原产于北美西部；其中许多物种过去曾被归入“百脉根属（Lotus）”"},"examples":[{"en":"Acmispon species are common in California grasslands and coastal scrub.","zh":"Acmispon 属的物种在加州的草原和海岸灌丛中很常见。"},{"en":"The field guide lists this plant as Acmispon, but older books may call it Lotus.","zh":"这本野外图鉴把这种植物列为 Acmispon，但较旧的书可能仍称它为 Lotus。"}]}],"synonyms":["Lotus (former classification for many species)"],"phonetic":"/ækˈmɪsɑːn/","extraExplanation":["这是一个拉丁化的学名（属名），在英文里通常首字母大写并用斜体（Acmispon）。日常对话中，人们更常用具体物种名或俗名（common name）。","分类学上，Acmispon 与 Lotus 的界线经历过调整；你在论文、植物志或数据库里可能会看到“同物异名/旧名（synonym）”的标注。"]}
{"word":"acmispon","summary":{"en":"“acmispon” is not recognized as a standard English word; it’s likely a typo, name, or brand term.","zh":"“acmispon”不是标准英语词汇，可能是拼写错误、人名/网名或品牌用语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a made-up/brand name, so it does not have an accepted dictionary meaning.","zh":"不是标准英语单词。更可能是拼写错误、造词或品牌名，因此没有公认的词典释义。"},"examples":[{"en":"I couldn’t find “acmispon” in an English dictionary—could it be a typo?","zh":"我在英语词典里找不到“acmispon”——它会不会是拼写错误？"},{"en":"Did you mean “acme” (the highest point) or something similar?","zh":"你是不是想写“acme”（顶点、最高点）或类似的词？"}]}],"phonetic":"/ˈækmiˌspɑn/","extraExplanation":["“acmispon”在常见英语词典与语料中几乎没有记录，比较像：\n1）把某个词拼错了；\n2）人名/网名/游戏ID；\n3）公司或产品名。\n如果你告诉我它出现的句子、截图或上下文（例如在哪本书/网站/游戏里看到的），我可以更准确判断它可能原本是什么词。","常见的相近猜测：\n- acme：意为“顶点、巅峰”（常见搭配：reach an acme）。\n- acronym：意为“首字母缩略词”。\n- admission / commission 等：如果是手写体或OCR识别，可能会误读成类似形状。"]}
{"word":"acmite","summary":{"en":"Acmite is a rare technical word meaning a dark green-to-black mineral (a pyroxene), also called aegirine.","zh":"acmite 是较少见的专业词，指一种深绿到黑色的辉石类矿物，也叫 aegirine（霓石）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a dark green to black mineral (a type of pyroxene) found in some igneous rocks; also called aegirine","zh":"一种深绿到黑色的矿物（辉石类），常见于某些火成岩中；也称为“aegirine（霓石）”"},"examples":[{"en":"Acmite crystals can form in alkaline igneous rocks.","zh":"Acmite 晶体可能形成于碱性火成岩中。"},{"en":"The sample was identified as acmite (aegirine) under the microscope.","zh":"在显微镜下，这个样品被鉴定为 acmite（aegirine/霓石）。"}]}],"synonyms":["aegirine"],"phonetic":"/ˈækmaɪt/","extraExplanation":["“acmite”在日常英语中很少见，更多出现在地质学、矿物学语境里。","词源与希腊语有关，常被解释为与“尖、峰、顶点”的概念相关（类似 acme），暗示其晶体形态或“尖端/顶端”的特征。","学习上容易与常用词“acme（顶点/巅峰）”混淆；两者拼写相近但含义完全不同：acme 是常用词，acmite 是矿物名。"]}
{"word":"Acmon","summary":{"en":"“Acmon” is not a standard English word; it likely refers to “acumen” (sharp judgment/insight).","zh":"“Acmon” 不是标准英语词；很可能是 “acumen”（敏锐的判断力/洞察力）的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “acumen,” meaning the ability to make good judgments and quick, accurate decisions (often in business or problem-solving).","zh":"不是标准英语单词。很可能是拼写错误，想写的是 “acumen”，意思是“敏锐的判断力、洞察力（常用于商业或解决问题的语境）”。"},"examples":[{"en":"“Acmon” isn’t a common English word—did you mean “acumen”?","zh":"“Acmon” 不是常见英文单词——你是不是想写 “acumen”？"},{"en":"She has strong business acumen.","zh":"她有很强的商业洞察力/商业判断力。"},{"en":"Good leaders need acumen and empathy.","zh":"优秀的领导者需要洞察力，也需要同理心。"}]}],"synonyms":["acumen (intended word)","insight","shrewdness","astuteness"],"phonetic":"əˈkjuːmən","extraExplanation":["“Acumen” 常见搭配：business acumen（商业洞察力）、political acumen（政治敏感度/洞察力）、financial acumen（财务判断力）。","如果 “Acmon” 是人名、品牌名或游戏/小说里的专有名词，请告诉我具体语境（句子或出处），我可以按正确含义解释。"]}

