{"word":"ACO","summary":{"en":"“ACO” is an abbreviation most commonly meaning Accountable Care Organization (healthcare) or Ant Colony Optimization (computer science), and sometimes Assistant Commanding Officer (military).","zh":"“ACO”是缩写，最常见指责任医疗组织（医疗领域）或蚁群优化算法（计算机领域），有时也指副指挥官/助理指挥官（军队）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Accountable Care Organization: a group of doctors, hospitals, and other healthcare providers that work together to improve care quality and reduce costs (especially in the U.S.).","zh":"责任医疗组织：由医生、医院等医疗服务者组成的协作团体，旨在提高医疗质量并控制成本（尤指美国医疗体系）。"},"examples":[{"en":"The hospital joined an ACO to coordinate care for patients with chronic diseases.","zh":"这家医院加入了一个ACO，以协调慢性病患者的医疗照护。"},{"en":"Under the ACO model, providers share responsibility for both quality and spending.","zh":"在ACO模式下，医疗提供者共同承担医疗质量与支出的责任。"}]},{"partOfSpeech":"other","definition":{"en":"Ant Colony Optimization: a computer-science method inspired by how ants find paths, used to solve optimization problems (like finding the best route).","zh":"蚁群优化算法：受蚂蚁觅路行为启发的一种计算机优化方法，用于解决“找最优解/最优路径”等问题。"},"examples":[{"en":"We used ACO to find a near-optimal route for the delivery trucks.","zh":"我们用ACO为配送卡车寻找接近最优的路线。"},{"en":"ACO is often taught in courses on algorithms and artificial intelligence.","zh":"ACO常在算法与人工智能课程中讲授。"}]},{"partOfSpeech":"other","definition":{"en":"Assistant Commanding Officer: a military title for an officer who assists the commanding officer (varies by country/unit).","zh":"副指挥官/助理指挥官：在军队中协助指挥官的军官头衔（不同国家与单位用法可能不同）。"},"examples":[{"en":"The ACO briefed the team before the operation.","zh":"行动前，ACO向团队做了简报。"},{"en":"Report to the ACO if the commanding officer is unavailable.","zh":"如果指挥官不在，请向ACO汇报。"}]}],"synonyms":["Accountable Care Organization","Ant Colony Optimization","Assistant Commanding Officer"],"phonetic":"/ˌeɪ siː ˈoʊ/","extraExplanation":["“ACO”是缩写，用法高度依赖领域：在美国医疗语境里最常见的是Accountable Care Organization；在计算机/算法语境里常指Ant Colony Optimization。阅读时可以通过上下文（医院、医保、患者 vs. 算法、路径、优化）来判断。"]}
{"word":"AcO","summary":{"en":"AcO is mainly a chemistry abbreviation for the acetate group/ion (AcO− or OAc) or an acetoxy group (—OAc).","zh":"AcO 主要是化学缩写，表示乙酸根/乙酸酯基团（AcO− 或 OAc）或乙酰氧基（—OAc）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(chemistry) An abbreviation for the acetate group or acetate ion, often written as AcO− or OAc, especially in organic chemistry and reaction schemes.","zh":"（化学）乙酸根（或乙酸酯基团）的缩写，常写作 AcO− 或 OAc，常见于有机化学反应式与结构式中。"},"examples":[{"en":"In many reaction schemes, AcO− is used to represent the acetate ion.","zh":"在许多反应示意图中，AcO− 用来表示乙酸根离子。"},{"en":"The leaving group can be written as OAc (same meaning as AcO).","zh":"离去基团可以写作 OAc（与 AcO 含义相同）。"}]},{"partOfSpeech":"other","definition":{"en":"(chemistry) A shorthand for an acetoxy substituent (—OAc), meaning an oxygen connected to an acetyl group (from acetic acid).","zh":"（化学）“乙酰氧基/乙酸酯基”的简写（—OAc），表示“氧—乙酰基”的连接形式（源自乙酸）。"},"examples":[{"en":"The molecule has an —OAc group on the aromatic ring.","zh":"该分子在芳环上带有一个 —OAc（乙酰氧基）基团。"},{"en":"Acetylation can introduce an OAc group under the right conditions.","zh":"在合适条件下，乙酰化反应可引入 OAc 基团。"}]}],"synonyms":["OAc","acetate (in context)"],"phonetic":"/ˌeɪ siː ˈoʊ/","extraExplanation":["在有机化学里，“Ac”常用来表示 acetyl（乙酰基，CH3CO—）。当写成 “OAc/AcO” 时，强调的是“通过氧连接的乙酰基”或“乙酸根”这一部分。","书写习惯上更常见的是 “OAc”（比如 NaOAc、KOAc），但在一些机理或配位化学语境中也会看到 “AcO−”。两者通常可互换，具体看作者或教材的写法。"]}
{"word":"acoasm","summary":{"en":"“acoasm” isn’t an English word; you likely mean “chasm” (“a chasm”).","zh":"“acoasm”不是英语单词；你可能想写“chasm”（或“a chasm”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling of “chasm” or the phrase “a chasm.”","zh":"不是标准英语单词；很可能是拼写错误，想写的是“chasm（裂隙/鸿沟）”或短语“a chasm（一道裂隙/一道鸿沟）”。"},"examples":[{"en":"I can’t find “acoasm” in a dictionary—did you mean “a chasm”?","zh":"我在词典里找不到“acoasm”——你是不是想写“a chasm”？"},{"en":"There is a chasm between what he promises and what he does.","zh":"他承诺的和他做的之间有一道鸿沟。"}]}],"synonyms":["chasm","gap","divide"],"phonetic":"/əˈkɔzəm/","extraExplanation":["“chasm”常见意思有两类：① 具体的“深裂缝/峡谷”；② 抽象的“差距/分歧（鸿沟）”，比如 a chasm between generations（代沟）。","如果你是想表达“穿过”，可能是拼成了“across”（例如: walk across the bridge）。你可以告诉我你想表达的中文意思或给我一句完整英文句子，我可以帮你确定正确单词。"]}
{"word":"acoasma","summary":{"en":"Acoasma means an auditory hallucination—hearing sounds that aren’t actually present.","zh":"acoasma 指“听幻觉”，即在没有外界真实声音时听到声音。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) An auditory hallucination: hearing a sound (like voices, music, or noises) when no real external sound is present.","zh":"（医学）听幻觉：在没有真实外界声音的情况下听到声音（如人声、音乐或噪音）。"},"examples":[{"en":"The patient reported an acoasma—he heard someone calling his name, but the room was empty.","zh":"患者报告出现听幻觉——他听到有人叫他的名字，但房间里并没有人。"},{"en":"In the clinical notes, the doctor asked whether the acoasma sounded like voices or like ringing.","zh":"在临床记录中，医生询问这种听幻觉更像“人声”还是“耳鸣样的响声”。"}]}],"synonyms":["auditory hallucination","phantom sound perception"],"phonetic":"/ˌeɪkoʊˈæzmə/","extraExplanation":["“acoasma”是较少见、偏医学/精神病学语境的词，常见表达更可能是“auditory hallucination（听幻觉）”。","词源来自希腊语与“hearing（听见）”相关的词根。","易与“tinnitus（耳鸣）”混淆：耳鸣通常指嗡嗡声/铃声等感觉，常与耳部或神经问题相关；而听幻觉更强调“像真实声音一样被听到”（例如人声、对话、命令等），需要结合具体症状由专业人士评估。"]}
{"word":"Acocanthera","summary":{"en":"Acokanthera (often misspelled “Acocanthera”) is a genus of African plants known for very strong toxins.","zh":"Acokanthera（常被误拼为 Acocanthera）是非洲植物的一属，以强烈毒性成分闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of African shrubs or small trees (in the dogbane family) known for producing very poisonous compounds; some species were traditionally used to make arrow poison.","zh":"钩吻属（夹竹桃科的一属非洲灌木或小乔木），以含有剧毒成分而闻名；部分物种传统上被用于制作箭毒。"},"examples":[{"en":"The researcher studied Acokanthera to understand how its toxins affect the heart.","zh":"研究人员研究钩吻属植物，以了解其毒素如何影响心脏。"},{"en":"In some historical accounts, extracts from Acokanthera were used as arrow poison.","zh":"在一些历史记载中，钩吻属植物的提取物被用作箭毒。"}]}],"synonyms":["Acokanthera","poison arrow tree (common name for some species)"],"phonetic":"/ˌækoʊkænˈθɪrə/","extraExplanation":["你写的 **Acocanthera** 常见于误拼；更常见、较标准的拼法是 **Acokanthera**（属名）。如果你是在阅读植物学/药理学资料，建议核对原文拼写。","该属中一些物种（如 *Acokanthera oppositifolia*）含强心苷类毒素（例如 ouabain/ouabaïn 一类），对心脏影响很强，现实生活中不要接触、尝试或用于任何用途。"]}
{"word":"acocanthera","summary":{"en":"Acokanthera is an African genus of evergreen shrubs/small trees with fragrant flowers and highly poisonous sap.","zh":"Acokanthera 是原产非洲的一属常绿灌木/小乔木，花香但汁液剧毒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of evergreen shrubs or small trees (dogbane family) native to Africa and parts of the Arabian Peninsula, known for fragrant flowers and very poisonous sap.","zh":"马利筋科（夹竹桃科）的一属常绿灌木或小乔木，原产非洲及阿拉伯半岛部分地区，以芳香花朵与高度毒性的汁液而闻名。"},"examples":[{"en":"Acokanthera is often grown as an ornamental shrub, but all parts of the plant are poisonous.","zh":"Acokanthera 常被当作观赏灌木栽培，但植株各部分都有毒。"},{"en":"Some traditional arrow poisons were made from Acokanthera because its toxins can affect the heart.","zh":"一些传统的箭毒曾用 Acokanthera 制作，因为其毒素会影响心脏。"}]}],"synonyms":["poison arrow plant (common-name usage for some species)"],"phonetic":"/ˌækoʊkənˈθɛrə/","extraExplanation":["该属在英语里有时会被提到与“箭毒（arrow poison）”相关，因为某些种含有强心苷类毒素（如 ouabain/ouabaioid 类物质），少量即可致命。阅读植物园或园艺资料时，常会看到安全提示：避免误食、避免汁液接触伤口，并远离儿童与宠物。","词源上常被解释为来自希腊语成分，意指“尖（或锐）的花药/花药状结构”，属于植物学拉丁化命名。普通日常英语中较少出现，多见于园艺、植物学、毒理学语境。"]}
{"word":"acocantherin","summary":{"en":"Acocantherin is a rare scientific term for a toxic heart-affecting plant glycoside, historically linked to arrow poisons.","zh":"Acocantherin 是一个较少见的科学术语，指一种会影响心脏的有毒植物强心苷，历史上与箭毒有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a toxic cardiac glycoside (plant poison) found in some Acokanthera plants, historically used in arrow poisons; it can strongly affect the heart.","zh":"一种有毒的强心苷（植物毒素），存在于某些夹竹桃科阿科坎瑟拉属（Acokanthera）植物中；历史上曾用于箭毒，会强烈影响心脏功能。"},"examples":[{"en":"Acocantherin is a potent toxin that can interfere with normal heart rhythm.","zh":"Acocantherin 是一种强效毒素，可能干扰正常的心律。"},{"en":"Some traditional arrow poisons were made from plants containing cardiac glycosides like acocantherin.","zh":"一些传统箭毒来源于含强心苷的植物，例如含有 acocantherin 的植物。"}]}],"synonyms":["cardiac glycoside","plant toxin"],"phonetic":"/ˌækoʊkænˈθɛrɪn/","extraExplanation":["这个词在日常英语中非常罕见，多见于植物化学、毒理学或药理学语境。","Acokanthera 属植物（与夹竹桃科相关）在非洲部分地区有“箭毒植物”的历史记载；其中的强心苷类物质与临床上研究的某些“强心苷”作用机制相似，但 acocantherin 本身属于高毒天然产物，绝不能自行接触或使用。","拼写上常见相近词：Acokanthera（植物属名）、acocantherin（其成分之一）；阅读文献时注意大小写与词尾 -in（常用于命名某些化合物/成分）。"]}
{"word":"acock","summary":{"en":"“acock” is an archaic word meaning “upright/raised or tilted,” often used in phrases like “hat acock.”","zh":"“acock”是一个较古老的词，意思是“竖起/翘起/倾斜”，常见于“hat acock（帽子歪戴）”等表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic) Positioned upright or raised; standing on end (often used after a noun, like “hat acock”).","zh":"（古语）竖起的；翘起的；直立的（常放在名词后，如“hat acock”表示“帽子翘着/歪戴着”）。"},"examples":[{"en":"He wore his cap acock, trying to look confident.","zh":"他把帽子歪歪地翘着戴，想显得自信。"},{"en":"The feather sat acock on his hat.","zh":"那根羽毛在他帽子上翘翘地竖着。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Archaic, of an object) To set or make (something) stand upright or at an angle; to cock.","zh":"（古语，指物）把（某物）竖起/翘起；使呈倾斜或竖立状态；等同于 cock。"},"examples":[{"en":"She acocked the mirror slightly toward the window.","zh":"她把镜子稍微朝窗户那边斜着摆。"},{"en":"He acocked his head as if listening carefully.","zh":"他把头微微一歪，好像在认真听。"}]}],"synonyms":["cocked","tilted","raised","upright"],"phonetic":"/əˈkɑk/","extraExplanation":["“acock”多见于较早的英语（尤其是文学或历史语境），现代英语更常用“cocked / tilted / raised”。","常见搭配：hat/cap acock（帽子歪戴、翘戴），feather acock（羽毛竖起）。","词形上可理解为 a-（古英语中表示“处于某种状态”）+ cock（竖起、翘起）。"]}
{"word":"acockbill","summary":{"en":"A-cockbill means tilted upward at one end or set askew; it can also be a nautical term for something on a ship set at an angle.","zh":"acockbill（也写作 a-cockbill）指“一端上翘/歪斜”；在航海语境中也可指船上部件斜置。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of something long and narrow) tilted upward at one end; angled up like a rooster’s beak.","zh":"（指细长物体）一端上翘；像公鸡的喙一样向上翘起、倾斜。"},"examples":[{"en":"He wore his hat a little a-cockbill, giving him a playful look.","zh":"他把帽子斜戴着（微微上翘），看起来很俏皮。"},{"en":"The picture frame hung a-cockbill on the wall.","zh":"那幅画框在墙上挂歪了（一端翘起）。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a tilted or askew way; with one end raised.","zh":"以一端上翘、歪斜的方式。"},"examples":[{"en":"The cap sat a-cockbill on her head.","zh":"帽子在她头上歪歪地戴着（一端翘起）。"},{"en":"After the bump, the sign stood a-cockbill.","zh":"被撞了一下后，牌子歪斜地立着。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Nautical) describing a yard, spar, or similar part of a ship set at an angle rather than straight across.","zh":"（航海）指船的横桁/桅杆等未横平而是斜置的。"},"examples":[{"en":"In the strong wind, the yard looked almost a-cockbill.","zh":"在大风中，那根横桁看起来几乎是斜着的。"}]}],"synonyms":["askew","tilted","lopsided","aslant","crooked"],"phonetic":"/əˈkɑkˌbɪl/","extraExplanation":["“a-cockbill / a cockbill”是较老的用法，带一点文学或叙述风格；现代口语里更常用的近义表达是“tilted / askew / lopsided”。","词源上可理解为“像公鸡的喙（bill）那样翘起”，因此常用来描写帽子、招牌、画框等“一端高一端低”的样子。","在航海语境中，它也可用来形容船上某些横向构件没有摆正、呈斜角（多见于旧航海记述或文学文本）。"]}
{"word":"acocotl","summary":{"en":"Acocotl is a traditional gourd tool used to draw agave sap (aguamiel), especially for making pulque in Mexico.","zh":"Acocotl 指一种传统葫芦工具，用来取龙舌兰甜汁（aguamiel），常见于墨西哥制作普尔克酒的场景。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long, narrow gourd (or gourd tool) traditionally used in Mexico to draw and transfer aguamiel (sweet agave sap), especially in making pulque.","zh":"（墨西哥传统用具）一种细长的葫芦（或葫芦制成的工具），用来舀取、吸取并转移龙舌兰甜汁（aguamiel），常用于制作普尔克酒（pulque）。"},"examples":[{"en":"The pulque maker used an acocotl to pull fresh aguamiel from the agave.","zh":"制普尔克酒的人用 acocotl 从龙舌兰里取出新鲜的甜汁（aguamiel）。"},{"en":"In the museum display, an acocotl was shown beside photos of traditional pulque production.","zh":"在博物馆展柜里，acocotl 和传统普尔克酒制作的照片一起展出。"}]}],"synonyms":["gourd dipper","aguamiel gourd","sap scoop (contextual)"],"phonetic":"/ˌɑːkoʊˈkoʊtəl/","extraExplanation":["acocotl 是从纳瓦特尔语（Nahuatl）进入西班牙语与英语的借词，和墨西哥中部的传统龙舌兰文化密切相关。","它常见于“pulque（普尔克酒）”相关的语境：采集 aguamiel（龙舌兰甜汁）后发酵成酒。这个词在日常英语中很少见，更常出现在人类学、饮食文化、历史或博物馆说明文字里。"]}
{"word":"Acoela","summary":{"en":"Acoela are tiny, simple marine flatworms that do not have a true body cavity.","zh":"Acoela 指一类微小、结构简单、没有真正体腔的海洋扁形动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group (order) of very small, simple marine flatworms that lack a true body cavity (coelom); often called acoel flatworms","zh":"无体腔目：一类非常小、结构简单的海洋扁形动物，没有真正的体腔；常称为“无体腔扁形动物/无体腔涡虫”"},"examples":[{"en":"Scientists study Acoela to understand early animal evolution.","zh":"科学家研究无体腔目，以了解动物早期的演化。"},{"en":"Many Acoela live in sand or on the sea floor.","zh":"许多无体腔目动物生活在沙子里或海底表面。"}]}],"synonyms":["acoels","acoel flatworms"],"phonetic":"/əˈsiːlə/","extraExplanation":["“Acoela”来自希腊语词根：a-（无、缺少）+ koilos（空腔），字面意思是“没有体腔”。","在现代分类中，Acoela通常与近缘类群一起被放入“无体腔动物门（Acoelomorpha）”相关框架中；不同教材/论文的层级（目、纲等）可能略有差异。"]}
{"word":"acoela","summary":{"en":"Acoela is a scientific term for a group of tiny, simple marine flatworms.","zh":"Acoela 是学术用语，指一类微小、结构简单的海生扁形动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group (order) of very small, simple flatworms, usually marine, often studied in biology because they lack a true gut cavity.","zh":"一种非常小、结构简单的扁形动物类群（目），多为海生；常用于生物学研究，因为它们没有真正的肠腔（消化道腔）。"},"examples":[{"en":"Scientists study Acoela to understand early animal evolution.","zh":"科学家研究 Acoela 以了解动物早期演化。"},{"en":"Many acoelans live between grains of sand in shallow seas.","zh":"许多 Acoela（无腔类扁虫）生活在浅海沙粒之间。"}]}],"synonyms":["acoelans","acoel flatworms"],"phonetic":"/əˈsiːlə/","extraExplanation":["Acoela 是生物分类学里的名称，常见于学术文章；日常英语中不常用。","词源上可拆成 a-（无）+ coel-（腔、体腔），强调“没有（明显的）体腔/消化腔”的特征。","在现代分类里，Acoela 有时被放在更大的类群 Acoelomorpha（无腔形动物）中；不同教材可能写法或归类略有差异。"]}
{"word":"acoelans","summary":{"en":"Acoelans are tiny simple marine worms (Acoela) often used in evolution research.","zh":"Acoelans 指无腔目动物：小型、结构简单的海洋蠕虫，常用于进化研究。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small, very simple marine worms (members of Acoela) that look like tiny flatworms and lack a typical gut cavity; often studied in evolution and developmental biology.","zh":"无腔目动物（Acoela）的成员：体型很小、结构很简单的海洋蠕虫，外形像微型扁形动物，通常没有典型的消化腔；常用于进化与发育生物学研究。"},"examples":[{"en":"Researchers collected acoelans from shallow sand to study early animal evolution.","zh":"研究人员从浅海沙地采集无腔目动物，用来研究早期动物的进化。"},{"en":"Under the microscope, some acoelans appear as tiny, flat, translucent worms.","zh":"在显微镜下，一些无腔目动物看起来像扁平、半透明的微小蠕虫。"}]}],"synonyms":["acoels","members of Acoela"],"phonetic":"/eɪˈsiːlənz/","extraExplanation":["“Acoelans”是复数名词，单数常写作“acoelan”。在学术写作中也常见“acoels”作为更简短的称呼。","词源来自希腊语：a-（无）+ koilos（腔），强调它们缺乏典型“体腔/腔室”的结构特征。","它们常被拿来讨论动物谱系关系（例如是否属于扁形动物附近的早期分支）。不同教材或论文对其系统分类可能有更新或争议，阅读时可留意作者采用的分类框架。"]}
{"word":"Acoelomata","summary":{"en":"Acoelomata: animals (in older classifications) that lack a true coelom (body cavity).","zh":"Acoelomata：指（较旧分类中）缺乏真正体腔的动物类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"animals (in some older biology classifications) that do not have a true body cavity (a coelom) between the gut and the body wall","zh":"（一些较旧的生物学分类中）指没有真正体腔（coelom，位于消化道与体壁之间的体腔）的动物类群"},"examples":[{"en":"In older textbooks, flatworms were often placed in the Acoelomata because they lack a true coelom.","zh":"在较旧的教材里，扁形动物常被归入 Acoelomata，因为它们没有真正的体腔。"},{"en":"The term Acoelomata is mainly used for historical comparison with newer animal classifications.","zh":"Acoelomata 这个术语主要用于与更新的动物分类做历史性的对照。"}]}],"synonyms":["acoelomates","animals without a coelom"],"phonetic":"/ˌeɪsiːləˈmɑːtə/","extraExplanation":["“Acoelomata”来自前缀 a-（表示“无/缺少”）+ coelom（体腔）+ -ata（拉丁化复数/类群后缀），整体意思就是“无体腔的动物”。","在现代系统分类学中，“Acoelomata”作为正式类群的使用减少，因为“有没有体腔”不一定反映真实的亲缘关系；现在更常见的说法是用形容词“acoelomate（无体腔的）”来描述某些动物的体腔类型。","相关对比概念：pseudocoelomate（假体腔动物，如某些线虫类）与 coelomate（真体腔动物，如环节动物、软体动物、脊椎动物等）。"]}
{"word":"acoelomata","summary":{"en":"A zoological term for animals that have no true body cavity (coelom).","zh":"动物学术语，指没有真正体腔（coelom，体腔）的动物类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology) A group of animals that lack a true body cavity (a coelom), such as flatworms; the term is often used in older or more traditional classifications.","zh":"（动物学）无体腔动物：指没有真正体腔（coelom，体腔）的动物类群，例如扁形动物；该术语常见于较旧或较传统的分类中。"},"examples":[{"en":"Flatworms were once commonly placed among the Acoelomata because they lack a true body cavity.","zh":"扁形动物过去常被归入无体腔动物（Acoelomata），因为它们没有真正的体腔。"},{"en":"In some textbooks, Acoelomata is contrasted with pseudocoelomates and coelomates.","zh":"在一些教材中，“无体腔动物（Acoelomata）”常与“假体腔动物”和“真体腔动物”作对比。"}]}],"synonyms":["acoelomates","animals without a coelom"],"phonetic":"/ˌeɪsiːləˈmɑːtə/","extraExplanation":["“Acoelomata”来自前缀 a-（表示“无”）+ coelom（体腔）+ -ata（表示一类事物/群体）。","现代系统发育分类更强调共同祖先与演化关系，因此“Acoelomata”作为正式类群的使用减少；但在基础动物学学习中，它仍常用于帮助理解“体腔”这一结构概念与三胚层动物的身体构型差异。"]}
{"word":"acoelomate","summary":{"en":"An acoelomate is an animal (or body plan) that lacks a true body cavity (coelom).","zh":"acoelomate 指无体腔的动物（或无体腔的身体结构），即缺少真正的体腔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an animal (especially an invertebrate) that lacks a coelom, meaning it has no fluid-filled body cavity between the digestive tract and the body wall","zh":"（尤指无脊椎动物）无体腔动物：缺少体腔（coelom），即消化道与体壁之间没有充满液体的体腔"},"examples":[{"en":"Flatworms are often described as acoelomates in basic biology courses.","zh":"在基础生物课上，扁形动物常被描述为无体腔动物。"},{"en":"Because it is an acoelomate, its organs are embedded in solid tissue rather than suspended in a cavity.","zh":"由于它是无体腔动物，它的器官嵌在实质组织中，而不是悬浮在体腔里。"}]},{"partOfSpeech":"adj.","definition":{"en":"having no coelom; lacking a true body cavity","zh":"无体腔的；缺少真正体腔的"},"examples":[{"en":"An acoelomate body plan is common in simple, soft-bodied animals.","zh":"无体腔的身体结构常见于一些结构较简单、身体柔软的动物。"},{"en":"Many textbooks contrast acoelomate, pseudocoelomate, and coelomate animals.","zh":"许多教材会对比无体腔、假体腔和真体腔动物。"}]}],"synonyms":["coelom-less (informal)","without a coelom"],"phonetic":"/ˌeɪ.siˈloʊ.mət/","extraExplanation":["这个词由前缀 a-（表示“无、缺少”）+ coelom（体腔）+ -ate 构成，常见于动物学与进化/解剖相关的分类讨论。","学习时可以顺带记三组对比：acoelomate（无体腔）/ pseudocoelomate（假体腔）/ coelomate（真体腔）。它们描述的是身体内部空间与中胚层组织的结构差异。"]}
{"word":"acoelomates","summary":{"en":"Acoelomates are animals that lack a true body cavity (coelom).","zh":"Acoelomates 指缺乏真体腔（coelom）的动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Animals that do not have a coelom (a fluid-filled body cavity) between the gut and the body wall.","zh":"无体腔动物：指消化道与体壁之间没有充满液体的体腔（真体腔 coelom）的动物。"},"examples":[{"en":"Flatworms are often described as acoelomates in basic biology textbooks.","zh":"在基础生物学教材中，扁形动物常被描述为无体腔动物。"},{"en":"When comparing body plans, students may group animals into acoelomates, pseudocoelomates, and coelomates.","zh":"比较动物体制时，学生常把动物分为无体腔动物、假体腔动物和真体腔动物。"}]}],"synonyms":["acoelomate animals","animals without a coelom"],"phonetic":"/ˌeɪsiˈliəˌmeɪts/","extraExplanation":["词源：a- 表示“无、缺乏”，coelom 来自希腊语 koiloma（“空腔”）。所以 acoelomate 字面意思就是“没有体腔的”。","学习提示：在很多现代分类与发育生物学中，“无体腔/假体腔/真体腔”的分法主要用于理解结构差异，但并不总是严格对应进化亲缘关系。","相关词：acoelomate（单数）；pseudocoelomate（假体腔动物）；coelomate（真体腔动物）；coelom（体腔）。"]}
{"word":"acoelomatous","summary":{"en":"Acoelomatous describes animals that lack a true body cavity (coelom).","zh":"acoelomatous 指“无体腔的”，描述缺乏真正体腔的动物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(In biology) having no coelom—no fluid-filled body cavity between the digestive tract and the body wall.","zh":"（生物学）无体腔的；没有位于消化道与体壁之间的充满液体的体腔。"},"examples":[{"en":"Flatworms are acoelomatous animals.","zh":"扁形动物是无体腔动物。"},{"en":"An acoelomatous body plan lacks a true coelom.","zh":"无体腔的身体结构缺乏真正的体腔。"}]}],"synonyms":["without a coelom","lacking a body cavity"],"phonetic":"/ˌeɪ.siːˈloʊ.mə.təs/","extraExplanation":["词源提示：a- 表示“无、缺乏”，coelom（体腔）来自希腊语 koilōma，意为“空腔”。因此 acoelomatous 字面意思就是“没有体腔的”。","常见对比：acoelomatous（无体腔） vs. pseudocoelomate（假体腔动物） vs. coelomate（真体腔动物）。这三个术语常出现在动物分类与演化、胚胎学（尤其是中胚层形成）相关内容中。","用法提示：该词主要用于课本、论文等学术语境，日常英语中很少出现。"]}
{"word":"Acoelomi","summary":{"en":"An acoelomate is an animal that has no body cavity (coelom) between the gut and the body wall.","zh":"acoelomate 指无体腔动物：肠道与体壁之间没有体腔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an animal that lacks a coelom (a fluid-filled body cavity between the gut and the body wall)","zh":"无体腔动物（指缺少体腔：肠道与体壁之间没有充满液体的体腔的动物）"},"examples":[{"en":"Flatworms are often taught as classic examples of acoelomates in basic biology.","zh":"在基础生物课里，扁形动物常被当作无体腔动物的典型例子。"},{"en":"The term “acoelomate” describes a body plan, not a specific species.","zh":"“无体腔”描述的是一种身体结构类型，而不是某一个特定物种。"}]}],"synonyms":["acoelomate animal","animal without a coelom"],"phonetic":"/ˌeɪ.siˈloʊ.mət/","extraExplanation":["你输入的 **“Acoelomi”** 很可能是拼写不完整或误拼；常见的标准词是 **acoelomate**（无体腔动物）或 **acoelom**（无体腔/无体腔状态）。在动物体腔分类里常见三类：**acoelomate（无体腔）**、**pseudocoelomate（假体腔）**、**coelomate（真体腔）**。"]}
{"word":"acoelomi","summary":{"en":"Acoelomi is an older zoological term for animals that lack a true coelom (body cavity).","zh":"Acoelomi 是较旧的动物学术语，指没有真正体腔（体内充液体腔）的动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology) Animals that lack a true coelom (a fluid-filled body cavity); essentially the plural/group term for acoelomates.","zh":"（动物学）没有真正体腔（充满液体的体腔）的动物；基本上相当于“无体腔动物（acoelomates）”的群体/复数说法。"},"examples":[{"en":"In some older biology texts, flatworms are discussed as Acoelomi because they do not have a true coelom.","zh":"在一些较早的生物学教材中，扁形动物会被归入 Acoelomi，因为它们没有真正的体腔。"},{"en":"The term Acoelomi contrasts with Coelomata, which have a well-developed body cavity.","zh":"Acoelomi 这个术语与 Coelomata（有发达体腔的动物）形成对比。"}]}],"synonyms":["acoelomates","coelomless animals","animals without a true coelom"],"phonetic":"/ˌeɪsiˈloʊmaɪ/","extraExplanation":["“Acoelomi”在现代教材与分类学中不如“acoelomate（无体腔的）/ acoelomates（无体腔动物）”常见，很多时候会被当作较旧的分组用语。","“coelom（体腔）”是中胚层形成的、充满液体的腔体；有体腔通常与器官的独立运动、缓冲保护等结构优势相关。","常见被举例为“无体腔”的类群包括扁形动物（flatworms），但不同教材对一些边界类群的表述可能略有差异。"]}
{"word":"Acoelomorpha","summary":{"en":"Acoelomorpha: a taxonomic group of tiny, simple flatworm‑like animals studied in early animal evolution.","zh":"Acoelomorpha：一类微小、结构简单、类似扁形动物的分类群，常用于研究动物早期演化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small group (phylum) of very simple, tiny flatworm‑like animals, often used in biology to study early animal evolution","zh":"一类（一个门）非常简单、微小、外形类似扁形动物的无体腔动物群，常用于研究动物早期演化"},"examples":[{"en":"Acoelomorpha are often discussed in courses on animal evolution.","zh":"在动物演化课程中，经常会提到 Acoelomorpha（无体腔动物门）。"},{"en":"Some researchers compare Acoelomorpha with flatworms to understand how simple body plans work.","zh":"有些研究者会把 Acoelomorpha 与扁形动物作比较，以理解简单的身体结构如何运作。"}]},{"partOfSpeech":"n.","definition":{"en":"an individual animal that belongs to Acoelomorpha (an acoelomorph)","zh":"无体腔动物门中的一个个体（无体腔动物，acoelomorph）"},"examples":[{"en":"This specimen is an acoelomorph from the group Acoelomorpha.","zh":"这个标本是一种来自 Acoelomorpha 的无体腔动物。"}]}],"synonyms":["acoelomorphs","acoels (informal in biology)"],"phonetic":"/ˌeɪsiːləˈmɔːrfə/","extraExplanation":["“Acoelomorpha”是分类学名称，常见于学术语境；日常英语里更常说“acoelomorph(s)”来指代这一类动物。","词源提示：前缀 a- 表示“无/缺乏”，coelom 指“体腔”，因此名称大意是“没有体腔的形态类群”。","它们通常体型很小、结构简单，多生活在海洋环境中；在进化生物学讨论中，有时会被用来探讨两侧对称动物早期分化的问题。"]}
{"word":"acoelomous","summary":{"en":"Acoelomous describes animals that lack a true body cavity (coelom).","zh":"Acoelomous 指“无体腔的”，描述缺乏真正体腔（coelom）的动物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of an animal, especially a worm) having no coelom—no fluid-filled body cavity between the gut and the body wall.","zh":"（动物，尤指蠕虫）无体腔的；即肠道与体壁之间没有充满液体的体腔。"},"examples":[{"en":"Flatworms are often described as acoelomous animals in basic biology.","zh":"在基础生物学中，扁形动物常被描述为无体腔动物。"},{"en":"An acoelomous body plan lacks the space that a coelom provides for organ movement.","zh":"无体腔的身体结构缺少体腔所提供的、便于器官活动的空间。"}]}],"synonyms":["without a coelom","lacking a coelom"],"phonetic":"/ˌeɪsiˈloʊməs/","extraExplanation":["词源可拆解理解：前缀 a- 表示“无/缺乏”，coelom（体腔）来自希腊语，-ous 表示“……的”。因此 acoelomous 直译就是“没有体腔的”。","常见对比术语：coelomate（有体腔的）与 pseudocoelomate（假体腔的）。在动物学分类与比较解剖中，这组词常用来描述不同“体腔类型”的身体结构差异。"]}
{"word":"acoelous","summary":{"en":"Acoelous means “without a coelom,” describing animals that lack a true body cavity.","zh":"acoelous 指“无体腔的”，用来描述缺乏真正体腔的动物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Zoology) Lacking a coelom (a fluid-filled body cavity); not having a true body cavity between the gut and the body wall.","zh":"（动物学）无体腔的；缺乏体腔（即消化道与体壁之间充满液体的体腔）。"},"examples":[{"en":"Flatworms are often described as acoelous animals because they do not have a true coelom.","zh":"扁形动物常被描述为无体腔动物，因为它们没有真正的体腔。"},{"en":"In basic biology, you may compare acoelous, pseudocoelous, and coelous body plans.","zh":"在基础生物学中，你可能会比较无体腔、假体腔和真体腔这三种身体结构。"}]}],"synonyms":["acoelomate","without a coelom","noncoelomate"],"phonetic":"/eɪˈsiːləs/","extraExplanation":["“acoelous”在现代教材里相对少见，更常用的同义术语是“acoelomate（无体腔动物）”。","词源上可分为 a-（无、缺乏）+ coel-（来自希腊语 *koilos*，意为“空的、凹陷的”）+ -ous（形容词后缀）。","这是偏专业的分类描述，用于比较动物体制：无体腔（如多数扁形动物）与真体腔动物（如环节动物、脊索动物）在器官容纳与运动方式上常被拿来对比。"]}
{"word":"acoels","summary":{"en":"“acoels” isn’t a standard English word; it likely refers to “solace” (comfort or relief).","zh":"“acoels”不是标准英语单词；很可能是想表达“solace”（安慰、慰藉、宽慰）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended word) a feeling of comfort or relief when you are sad, worried, or in pain; something that gives that comfort.","zh":"（可能想查的词）安慰；慰藉；（使人）宽慰、解脱的事物。"},"examples":[{"en":"Music was a solace to her after the loss.","zh":"失去亲人后，音乐成了她的慰藉。"},{"en":"He found solace in talking with close friends.","zh":"他从与亲密朋友交谈中获得安慰。"}]},{"partOfSpeech":"vt.","definition":{"en":"to comfort someone who is sad or upset; to give relief.","zh":"安慰；抚慰；使（痛苦、忧虑）减轻。"},"examples":[{"en":"She tried to solace her child after the nightmare.","zh":"孩子做了噩梦后，她试着安慰他。"},{"en":"Nothing could solace him in that moment.","zh":"那一刻，什么也无法安慰他。"}]}],"synonyms":["comfort","consolation","relief","reassurance"],"phonetic":"/ˈsɑlɪs/","extraExplanation":["“acoels”不是常见的英语单词，可能是把“solace”（安慰/慰藉）拼错或打乱了字母（anagram）。如果你原本想查的不是“solace”，请告诉我它出现的句子或上下文，我可以帮你锁定正确的词。"]}
{"word":"Acoemetae","summary":{"en":"Acoemetae: Byzantine monks called “the Sleepless,” known for nonstop rotating prayer.","zh":"Acoemetae：被称为“不眠者”的拜占庭修士团体，以轮班祈祷、礼拜不间断著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of early Eastern Christian (Byzantine) monks known as “the Sleepless,” famous for keeping continuous worship by praying and chanting in rotating shifts.","zh":"早期东基督教（拜占庭）的一支修道团体，称为“无眠者/不眠者”，以轮班祈祷、诵唱，从而保持礼拜不停歇而闻名。"},"examples":[{"en":"The Acoemetae organized their monastery so that prayer continued day and night.","zh":"阿科伊梅泰修士团安排修院制度，使祈祷昼夜不断。"},{"en":"In histories of Byzantium, the Acoemetae are often mentioned for their strict discipline and constant liturgy.","zh":"在拜占庭史著中，阿科伊梅泰常因严谨戒律与持续礼拜而被提及。"}]}],"synonyms":["the Sleepless"],"phonetic":"/ˌækoʊˈɛmɪtiː/","extraExplanation":["“Acoemetae”来自希腊语 ἀκοίμητοι（意为“不会睡的人/不眠者”），英语里常译作 **the Sleepless**。","他们活跃于公元5世纪左右的君士坦丁堡一带，以“轮班制”维持不间断的祈祷与圣咏；这种做法在当时的修道传统中很有代表性。","该词多见于宗教史、拜占庭史或学术写作中；日常英语里非常少用，通常作为专名出现。"]}
{"word":"acoemetae","summary":{"en":"Acoemetae = the “Sleepless Ones,” a Byzantine monastic group known for continuous, round-the-clock worship.","zh":"Acoemetae 指“无眠者/不眠者”，拜占庭时期以轮班维持昼夜不断礼拜的修道团体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historical order of Byzantine Christian monks called “the Sleepless Ones,” known for keeping continuous (day-and-night) worship by taking turns in relays","zh":"拜占庭基督教历史上的一支修道团体，称为“无眠者/不眠者”，以轮班接力的方式维持昼夜不断的祈祷与礼拜而闻名"},"examples":[{"en":"In the fifth century, the Acoemetae became famous in Constantinople for their round-the-clock chanting.","zh":"在五世纪，“无眠者”（Acoemetae）因在君士坦丁堡昼夜不停的诵唱而闻名。"},{"en":"The historian mentions the Acoemetae when describing early monastic life in the Byzantine Empire.","zh":"那位历史学家在描述拜占庭帝国早期修道生活时提到了Acoemetae。"}]}],"synonyms":["Sleepless Ones","Akoimetoi"],"phonetic":"/ˌækoʊɪˈmiːtaɪ/","extraExplanation":["词源来自希腊语 *akoímētoi*（意为“睡不着的人/不眠者”）。这个团体以“持续祈祷”（continuous prayer）的修道实践著称：修士分组轮班，使礼拜与诵经不中断。","在英文资料中，Acoemetae 常被当作复数名词使用；也常见另一种转写形式 **Akoimetoi**。"]}
{"word":"Acoemeti","summary":{"en":"Acoemeti refers to the Byzantine “Sleepless” monks who practiced continuous prayer in shifts.","zh":"Acoemeti 指拜占庭时期以轮班实现“昼夜不间断祈祷”的“不眠者”修会/修士。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Byzantine monastic group (and its members) known as the “Sleepless Ones,” famous for maintaining continuous, round-the-clock prayer and worship.","zh":"（拜占庭时期的）“不眠者修会/不眠者”（及其成员），以轮班进行昼夜不停的祈祷与礼拜而闻名。"},"examples":[{"en":"The Acoemeti were known for keeping worship going day and night in shifts.","zh":"Acoemeti 以轮班方式维持昼夜不断的礼拜而闻名。"},{"en":"Some historians describe the Acoemeti as an influential community in early Byzantine monastic life.","zh":"一些历史学者认为 Acoemeti 是早期拜占庭修道生活中颇具影响力的团体。"}]}],"synonyms":["Akoimetoi","the Sleepless Ones","Sleepless monks"],"phonetic":"/ˌækoʊˈɛmɪtaɪ/","extraExplanation":["Acoemeti 来自希腊语 ἀκοίμητοι（常见转写：Akoimetoi），字面意思是“不会睡着的人/不眠的人”。它通常指一种修道传统：通过多人轮班，让公共祈祷“永不间断”。","在英语史学写作中，你也可能看到拼写变体：Akoimetai / Akoimetoi / Acoemetae 等；这些多是从希腊语到拉丁语、再到英语的不同转写方式。"]}
{"word":"acoemeti","summary":{"en":"Acoemeti are Byzantine-era monks called the “Sleepless Ones,” known for continuous prayer in shifts.","zh":"Acoemeti 指拜占庭时期被称为“不眠者”的修士团，以轮班持续祈祷而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group/order of early Christian monks in the Byzantine world known as the “Sleepless Ones,” who kept continuous (day-and-night) prayer by taking turns in shifts","zh":"（拜占庭早期基督教）“不眠者”修士团／修道团：以轮班方式昼夜不断祈祷、礼拜而闻名的一群修士"},"examples":[{"en":"In Byzantine history, the Acoemeti were famous for maintaining continuous prayer in shifts.","zh":"在拜占庭史中，Acoemeti 以轮班方式维持不间断祈祷而著名。"},{"en":"The text mentions the Acoemeti alongside other monastic communities in Constantinople.","zh":"这篇文献把 Acoemeti 与君士坦丁堡的其他修道团体并列提到。"}]}],"synonyms":["Akoimetoi","the Sleepless Ones"],"phonetic":"/ˌækoʊˈɛmɪti/","extraExplanation":["Acoemeti 常见于历史/宗教研究语境，也常见拼写为 Akoimetoi（源自希腊语，意为“不睡的人/不眠者”）。","读到该词时，可以把它理解为一种“制度化的轮班礼拜”：不是每个人都不睡，而是整个团体通过轮班来实现“持续不断”的祈祷。","该词在日常英语中极少使用，更像是专有名词；写作时常与 Byzantine（拜占庭的）、monastic（修道的）、Constantinople（君士坦丁堡）等词共现。"]}
{"word":"Acoemetic","summary":{"en":"Acoemetic means “sleepless,” and can also mean “related to the Acoemetae (‘Sleepless Ones’),” a monastic group known for continuous prayer.","zh":"acoemetic 意为“不眠的”，也可指“与‘无眠者’（Acoemetae）修道团体相关的”，该团体以轮班持续祈祷著称。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Sleepless; staying awake (often used in literary or formal writing).","zh":"不眠的；彻夜清醒的（常见于文学或较正式语境）。"},"examples":[{"en":"After the shocking news, she spent an acoemetic night staring at the ceiling.","zh":"听到那条令人震惊的消息后，她度过了一个不眠之夜，盯着天花板发呆。"},{"en":"The poem describes an acoemetic city that never truly rests.","zh":"这首诗描写了一座从未真正休息的不眠之城。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to the Acoemetae (“the Sleepless Ones”), an early Christian monastic group known for continuous prayer.","zh":"与“阿科伊梅泰”（意为“无眠者”）有关的；指早期基督教修道群体，以轮班持续祈祷闻名。"},"examples":[{"en":"The historian mentioned an acoemetic community that kept prayer going day and night.","zh":"历史学者提到一个“无眠者”修道团体，他们昼夜不息地祈祷。"}]}],"synonyms":["sleepless","wakeful","insomniac","restless"],"phonetic":"ˌeɪkoʊˈmɛtɪk","extraExplanation":["词源来自希腊语 a-（不）+ koimētikos（睡眠的），字面意思就是“不能睡/不睡的”。","Acoemetae（阿科伊梅泰，“无眠者”）是5世纪前后在东罗马/拜占庭世界较知名的一支修道传统：修士分班祈祷，使祷告“不断绝”。因此 acoemetic 既可泛指“不眠的”，也可专指与这一传统相关。","这个词在现代英语里非常罕见，多出现在宗教史、古典/文学写作中；日常表达通常用 sleepless 或 awake。"]}
{"word":"acoemetic","summary":{"en":"Acoemetic means sleepless and vigilant; it can also describe the early Christian “Acoemetae” monks who kept continuous prayer in shifts.","zh":"acoemetic 意为“不眠、警醒守望的”；也可指早期基督教以轮班祈祷维持“不断祷告”的“不眠修士团（Acoemetae）”相关事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Sleepless; staying awake and alert (often in order to keep watch or maintain continuous activity).","zh":"不眠的；警醒守望的（常指为了值守或保持持续运作而一直清醒）。"},"examples":[{"en":"The lighthouse needed an acoemetic crew during storm season, ready to respond at any hour.","zh":"暴风季节灯塔需要一支不眠警戒的值守队伍，随时准备应对突发情况。"},{"en":"She kept an acoemetic vigil beside her father’s hospital bed.","zh":"她在父亲的病床旁守夜不眠。"}]},{"partOfSpeech":"adj.","definition":{"en":"Of or relating to the Acoemetae, a group of early Christian monks known for maintaining perpetual prayer in shifts.","zh":"（与）“不眠修士团”（Acoemetae）有关的；指早期基督教修士以轮班方式进行持续祈祷的传统。"},"examples":[{"en":"The article mentioned acoemetic practices—prayer continuing day and night in rotating groups.","zh":"文章提到“不眠修士团”的做法——以轮班方式让祈祷日夜不断。"}]}],"synonyms":["sleepless","wakeful","vigilant","watchful","unremitting"],"phonetic":"ˌeɪkoʊˈɛmɪtɪk","extraExplanation":["词源来自希腊语：a-（否定，“不”）+ koimētikos（与睡眠有关），字面意思就是“不会睡的”。","历史上“Acoemetae（不眠者）”是拜占庭时期的修士群体，以轮班祈祷维持“不断祷告”的传统；现代英语里该词多用于书面或学术语境，强调“持续守望/彻夜不眠”的意象。"]}
{"word":"acoenaesthesia","summary":{"en":"A medical term for a vague, abnormal internal bodily sensation without a clear physical cause.","zh":"医学术语：无明确生理原因的模糊、异常的身体内部感觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An abnormal, often unpleasant awareness or sensation of one’s own body (for example, feeling “strange” inside) without a clear physical cause; used mainly in medical/psychiatric writing.","zh":"（医学/精神病学）一种对自身身体内部状态的异常感受或不适感（如“身体里怪怪的”），往往缺乏明确的生理原因。"},"examples":[{"en":"The clinician noted acoenaesthesia—an unsettling feeling in the abdomen—with no abnormal findings on tests.","zh":"临床医生记录到患者有 acoenaesthesia：腹部一种令人不安的感觉，但检查并无异常发现。"},{"en":"Some patients describe acoenaesthesia as a vague sense that their body is “not quite right.”","zh":"有些患者把 acoenaesthesia 形容为一种模糊的感觉：身体“好像不太对劲”。"}]}],"synonyms":["cenesthopathy","abnormal bodily sensation","unexplained bodily sensation"],"phonetic":"/ˌækoʊˌniːsˈθiːʒə/","extraExplanation":["该词较少见，多见于精神病学与身心医学文献，用来描述“本体感/内感受”的异常体验，常与躯体化、焦虑障碍或某些精神病性体验的评估相关。","词源上与希腊语 *aisthesis*（感觉）有关；在一些文献中可与 **cenesthopathy**（“内感异常/体感幻觉样体验”）并列或近义，但具体用法会因作者与学派而异。","由于属于专业术语，日常英语中更常用的说法是：*strange bodily sensations*, *unexplained body feelings*, *a vague internal discomfort* 等。"]}
{"word":"ACOF","summary":{"en":"ACOF is an acronym with field-dependent meanings; it often relates to a company’s (adjusted) cost of funds in finance contexts.","zh":"ACOF 是一个含义取决于领域的缩写；在金融语境中常与（调整后）资金成本相关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation that can stand for different things depending on the field (most commonly used in finance or internal business documents).","zh":"一个缩写，在不同领域可能代表不同含义（最常见于金融或公司内部文件）。"},"examples":[{"en":"In this report, ACOF refers to the company’s cost of funding.","zh":"在这份报告里，ACOF 指公司的融资成本。"},{"en":"Please define ACOF the first time you use it in the document.","zh":"请在文件中第一次使用 ACOF 时先写出它的全称。"}]},{"partOfSpeech":"other","definition":{"en":"(finance, less common) Adjusted Cost of Funds: a metric describing the effective/adjusted cost a company pays to obtain money (e.g., through debt or other financing).","zh":"（金融，较不常见）Adjusted Cost of Funds（调整后资金成本）：指企业获取资金（如借款等融资方式）的“实际/调整后”成本指标。"},"examples":[{"en":"Rising interest rates pushed our ACOF higher this quarter.","zh":"利率上升导致我们本季度的 ACOF 上升。"},{"en":"They compared ACOF across lenders before choosing a loan.","zh":"他们在选择贷款前比较了不同放贷方的 ACOF。"}]}],"synonyms":["acronym","abbreviation"],"phonetic":"/ˌeɪ.siː.oʊˈɛf/","extraExplanation":["ACOF 不是一个像 “NASA” 那样广泛固定的通用缩写；在不同公司、行业、课程或文件里可能有不同全称。最稳妥的做法是查看上下文（例如金融、供应链、医疗、教育等）或直接询问对方 “ACOF stands for what here?”。","如果你能提供一句包含 ACOF 的原文（邮件/报告/句子），我可以根据上下文帮你判断最可能的全称和中文对应。"]}
{"word":"acoin","summary":{"en":"“acoin” is usually written as “a coin,” meaning one piece of metal money.","zh":"“acoin”通常应写作“a coin”，意思是一枚硬币。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Usually written as “a coin”) one piece of metal money used as currency.","zh":"（通常写作“a coin”）一枚硬币；金属货币的一种。"},"examples":[{"en":"I found a coin on the sidewalk.","zh":"我在人行道上捡到一枚硬币。"},{"en":"Do you have a coin for the vending machine?","zh":"你有投自动售货机的硬币吗？"},{"en":"He flipped a coin to decide who goes first.","zh":"他用抛硬币来决定谁先开始。"}]},{"partOfSpeech":"other","definition":{"en":"(Less common; seen in names or informal writing) “acoin” as one word is usually a typo or stylized spelling of “a coin.”","zh":"（较少见；多出现在名称或随意写法中）“acoin”连写通常是拼写错误或刻意风格化写法，实际指“a coin”。"},"examples":[{"en":"In normal English writing, you would write: “a coin,” not “acoin.”","zh":"在正常英文写作中，应写作“a coin”，而不是“acoin”。"},{"en":"The brand name Acoin uses a stylized spelling.","zh":"品牌名 Acoin 使用了风格化拼写。"}]}],"synonyms":["piece","coin","change (money)","metal money"],"phonetic":"/ə kɔɪn/","extraExplanation":["“a”是冠词，通常要和名词分开写：a coin / an apple。把它连写成“acoin”一般不属于标准拼写，除非是专有名词（如品牌、用户名、项目名）。","发音上，“a coin”在句子中常读成弱读 /ə kɔɪn/（“a”读成/ə/）。"]}
{"word":"acoine","summary":{"en":"“Acoine” is a rare, archaic adverb meaning “in a corner; tucked away.”","zh":"“acoine”是罕见古语，作副词，意思是“在角落里；藏在一边”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Archaic/rare) In a corner; tucked away or set to one side.","zh":"（古语/罕见）在角落里；藏在一边、放在一旁。"},"examples":[{"en":"He sat acoine, listening quietly to the conversation.","zh":"他坐在角落里，安静地听着大家聊天。"},{"en":"The old books were stored acoine in a dark room.","zh":"那些旧书被藏在昏暗房间的角落里。"}]}],"synonyms":["in the corner","tucked away","aside","off to one side"],"phonetic":"/əˈkɔɪn/","extraExplanation":["“acoine”在现代英语里几乎不用，更多会看到拼写“acoin”或直接用更常见的表达：in the corner, tucked away, off to one side。","词源上常被认为与表示“角落”的词有关（如法语 coin = corner），因此含义偏“在角落/在一旁”。如果你原本想查的是更常用的词（例如 a coin / acorn / acquire），可以告诉我语境，我可以帮你确认。"]}
{"word":"acointen","summary":{"en":"“Acquaint” means to introduce someone or make someone familiar with something; it’s often used in formal contexts.","zh":"“Acquaint”表示“介绍（使认识）”或“使熟悉/了解”，常用于较正式的表达。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone familiar with a person, place, or thing; to introduce or inform","zh":"使某人熟悉（某人/某地/某事）；使了解；介绍"},"examples":[{"en":"Let me acquaint you with the new rules.","zh":"让我让你了解一下新规定。"},{"en":"I’ll acquaint you with our team members after the meeting.","zh":"会议结束后我会把你介绍给我们的团队成员。"}]},{"partOfSpeech":"v.","definition":{"en":"to become familiar (often used with “with”)","zh":"（常与 with 连用）变得熟悉；了解"},"examples":[{"en":"Please acquaint yourself with the safety instructions.","zh":"请先熟悉安全说明。"}]}],"synonyms":["introduce","inform","familiarize","make aware","brief"],"phonetic":"/əˈkweɪnt/","extraExplanation":["你输入的“acointen”不是标准拼写。最可能是想写 **acquaint**（动词：使熟悉/介绍）或 **acquaintance**（名词：熟人/相识）。如果你想查的是名词“熟人”，告诉我我可以再给你“acquaintance”的词条。","**acquaint + someone + with + something** 很常见：acquaint me with the plan（让我了解计划）。","固定搭配 **acquaint yourself with...** 常用于说明/规定/手册里，意思是“请先熟悉……”。"]}
{"word":"acointier","summary":{"en":"“acointier” is not a standard modern spelling; it most likely refers to the verb “acquaint,” meaning to make known or become familiar with.","zh":"“acointier” 不是现代英语标准拼写；它很可能指动词 “acquaint”，意思是“使了解/认识；熟悉”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"Archaic or misspelled form of **acquaint**: to make someone know something or someone; to become familiar with.","zh":"（古写法或拼写误写）**acquaint** 的变体：使某人了解/认识（某事或某人）；（自己）熟悉起来。"},"examples":[{"en":"Please acquaint me with the rules of this club.","zh":"请让我了解一下这个俱乐部的规则。"},{"en":"I’m not well acquainted with the city yet.","zh":"我还不太熟悉这座城市。"}]},{"partOfSpeech":"phrase","definition":{"en":"(In the phrase **acquaint oneself with**) to learn about something so you understand it better.","zh":"（用于短语 **acquaint oneself with**）使自己熟悉/了解某事，以便更好理解。"},"examples":[{"en":"Before the interview, acquaint yourself with the company’s website.","zh":"面试前，先熟悉一下公司网站。"}]}],"synonyms":["inform","introduce","familiarize","make known"],"phonetic":"/əˈkweɪnt/","extraExplanation":["你输入的 **acointier** 不是现代英语的标准拼写，更像是中古英语/早期拼写的 **acointier/acqueynt**，对应现代英语 **acquaint**。","现代用法里常见搭配是 **acquaint someone with something**（让某人了解某事）和 **be acquainted with**（熟悉/认识）。","区分：**acquaintance**（熟人/相识）是名词；**acquaint** 是动词。"]}
{"word":"Acokanthera","summary":{"en":"Acokanthera is a genus of African plants known for powerful poison, historically used for arrow poison.","zh":"Acokanthera 是一属非洲植物，以强烈毒性闻名，历史上曾用于制作箭毒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of African shrubs or small trees (dogbane family) known for producing a very strong poison; some species have been used historically for arrow poison.","zh":"夹竹桃科的一属非洲灌木或小乔木，以含有强烈毒素而闻名；某些物种历史上曾被用来制作箭毒。"},"examples":[{"en":"Acokanthera is famous for its potent toxins, so it should never be eaten or handled carelessly.","zh":"Acokanthera 以强烈毒素著称，因此绝不可食用，也不要随意触碰。"},{"en":"In some historical accounts, extracts from Acokanthera were used to poison hunting arrows.","zh":"在一些历史记载中，人们用 Acokanthera 的提取物给狩猎箭下毒。"}]}],"synonyms":["arrow poison tree","poison bush"],"phonetic":"/ˌækoʊkænˈθɪrə/","extraExplanation":["“Acokanthera”常见于植物百科、园艺说明和非洲民族志/历史资料中。它与“箭毒”文化语境相关，但在现代语境里更强调其高毒性与安全警示。","词源提示：名称来自希腊语词根，含“尖/刺”和“花药（anther）”的意思，用来描述植物形态特征。"]}
{"word":"Acol","summary":{"en":"Acol is a British contract-bridge bidding system.","zh":"Acol 是一种英式定约桥牌叫牌体系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bidding system in contract bridge, originally developed in the U.K., known for using a natural style (bids generally show the suit you have) and commonly using four-card major suits.","zh":"（桥牌）Acol 叫牌体系：起源于英国的一种定约桥牌叫牌方法，特点是偏“自然叫牌”（通常叫你所持的花色），并常见“四张高花”体系。"},"examples":[{"en":"They play Acol, so a 1♥ opening can promise only four hearts.","zh":"他们打的是 Acol，所以 1♥ 开叫可能只保证四张红心。"},{"en":"In Acol, the partnership agrees on specific conventions before the game.","zh":"在 Acol 体系里，搭档通常会在赛前约定好具体的约定叫。"}]}],"synonyms":["Standard American (related)","2/1 Game Force (related)","bridge bidding system"],"phonetic":"/ˈeɪkɑl/","extraExplanation":["Acol 是专有名词，来自伦敦的 Acol Road（早期一群桥牌玩家在附近聚会并发展出这套体系）。","在北美更常见的体系是 Standard American（或 2/1 Game Force），所以你在英式桥牌资料里更容易看到 Acol。"]}
{"word":"Acolapissa","summary":{"en":"“Acolapissa” is not a recognized English vocabulary word; it’s likely a proper name whose meaning depends on context.","zh":"“Acolapissa”不是常见英语词汇；更可能是专名，含义需要结合上下文判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most likely a proper name (e.g., a surname, username, fictional name, or a place name). Meaning depends on the source where it appears.","zh":"不是标准英语词；更可能是专有名词（如姓氏、用户名、虚构名称或地名）。具体含义取决于它出现的来源。"},"examples":[{"en":"I couldn’t find “Acolapissa” in standard English dictionaries—where did you see it?","zh":"我在标准英语词典里找不到 “Acolapissa”——你是在哪里看到它的？"},{"en":"In the novel, Acolapissa is the name of a character.","zh":"在这部小说里，Acolapissa 是一个角色名。"}]}],"phonetic":"/ˌækoʊləˈpisə/","extraExplanation":["“Acolapissa”看起来像是外来语或自造词（例如奇幻作品中的人名/地名），也可能是拼写误差或转写差异。若你能提供上下文（句子、语言、作品/网站链接、是否为人名或地名），我可以更准确判断含义、词源与发音。","如果你原本想查的是类似拼写的词（例如以 -pissa 结尾的姓氏/地名，或某个品牌名/学名），把最接近的拼写也发来，我可以帮你对照可能的正确词。"]}
{"word":"acolapissa","summary":{"en":"Acolapissa is a scientific genus name for a type of sweat bee, used mainly in taxonomy/entomology.","zh":"Acolapissa 是一个蜂类（汗蜂）的属名，主要用于分类学/昆虫学语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A scientific genus name (used in entomology) for a type of sweat bee; it is mainly seen in academic or taxonomy writing rather than everyday English.","zh":"（昆虫学/分类学）一个蜂类（汗蜂）的属名；主要出现在学术或分类文献中，不是日常英语词汇。"},"examples":[{"en":"The paper describes a fossil species placed in the genus Acolapissa.","zh":"这篇论文描述了一种被归入 Acolapissa 属的化石物种。"},{"en":"Acolapissa is cited in the taxonomy section, not in general dictionaries.","zh":"Acolapissa 出现在分类学部分，而不是普通词典里。"}]}],"phonetic":"/ˌækoʊləˈpɪsə/","extraExplanation":["通常写作首字母大写 Acolapissa（属名按生物命名规则大写，斜体常见于正式排版）。","如果你是在找日常英语词，可能是拼写误差；你可以告诉我上下文（句子/来源/语言），我可以帮你确认你真正想查的词。"]}
{"word":"acold","summary":{"en":"“a cold” means a common illness (the common cold).","zh":"“a cold”指“（一场）感冒”，即常见的上呼吸道感染。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a common viral illness that causes a runny or stuffy nose, sneezing, sore throat, and sometimes a cough","zh":"（一场）感冒：一种常见的病毒性感染，会引起流鼻涕或鼻塞、打喷嚏、喉咙痛，有时还会咳嗽"},"examples":[{"en":"I think I’m getting a cold—I keep sneezing.","zh":"我觉得我要感冒了——一直在打喷嚏。"},{"en":"She stayed home because she had a bad cold.","zh":"她因为重感冒而待在家里。"},{"en":"Take some rest and drink water when you have a cold.","zh":"感冒的时候要多休息、多喝水。"}]}],"synonyms":["common cold","head cold","cold (illness)"],"phonetic":"/ə koʊld/","extraExplanation":["“acold”通常是把“a cold”（一场感冒）连在一起写了。正确写法一般是分开：a cold。","注意区分：cold（adj.）表示“冷的”；a cold（n./短语）表示“感冒”。例如：It’s cold today.（今天很冷。） vs. I have a cold.（我感冒了。）","在口语里也常说：catch a cold（着凉/得感冒）、have a cold（感冒了）、get over a cold（从感冒中恢复）。"]}
{"word":"Acolhua","summary":{"en":"Acolhua refers to a Nahua people of central Mexico (notably linked to Texcoco) and, more broadly, anything related to them.","zh":"Acolhua 指中部墨西哥的纳瓦族一支（尤与特斯科科相关），也可作形容词表示“阿科尔瓦人的/其文化相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Nahua (Indigenous) people of central Mexico, especially associated with the city-state of Texcoco in the pre-Columbian era","zh":"（中部墨西哥的）阿科尔瓦人：纳瓦族（原住民）的一支，前哥伦布时期尤与特斯科科（Texcoco）城邦相关"},"examples":[{"en":"The Acolhua were important allies within the Aztec Triple Alliance.","zh":"阿科尔瓦人在阿兹特克三方同盟中是重要的盟友。"},{"en":"Many historical sources link Acolhua elites with the city of Texcoco.","zh":"许多史料将阿科尔瓦人的上层阶层与特斯科科城联系起来。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Acolhua people or their culture","zh":"阿科尔瓦人的；与阿科尔瓦文化相关的"},"examples":[{"en":"The museum displayed Acolhua-style ceramics from the Basin of Mexico.","zh":"博物馆展出了来自墨西哥谷地的阿科尔瓦风格陶器。"},{"en":"Researchers study Acolhua history alongside other Nahua groups.","zh":"研究者会把阿科尔瓦的历史与其他纳瓦群体的历史一起研究。"}]}],"synonyms":["Acolhua people","Acolhuas","Nahua (broader term)"],"phonetic":"/əˈkoʊlwɑː/","extraExplanation":["“Acolhua”常见于历史与人类学语境，指阿兹特克时期墨西哥谷地（Basin of Mexico）的一支纳瓦族群。其政治文化中心与特斯科科（Texcoco）关系密切。","在英语写作中它有时会与更宽泛的“Aztec（阿兹特克）/Nahua（纳瓦）”并列出现：Aztec多指政治联盟或帝国框架，Nahua更偏语言与族群大类，Acolhua则更具体到其中一支。"]}
{"word":"acolhua","summary":{"en":"Acolhua refers to a Nahua people of central Mexico, especially linked to Texcoco; it can also refer to their regional variety of Nahuatl.","zh":"Acolhua 指墨西哥中部的纳瓦族群（尤与特斯科科相关）；也可指其地区性的纳瓦特尔语变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Nahua people of central Mexico, especially associated with Texcoco in the Basin of Mexico during the late Postclassic period (before and during early Spanish contact).","zh":"阿科尔瓦人：墨西哥中部的纳瓦族群之一，尤以墨西哥谷地的特斯科科（Texcoco）为中心，活跃于后古典时期并延续到西班牙征服初期。"},"examples":[{"en":"The Acolhua were closely linked with the city-state of Texcoco.","zh":"阿科尔瓦人与特斯科科城邦关系密切。"},{"en":"Some histories describe Acolhua nobles as important patrons of learning and poetry.","zh":"一些史料记载阿科尔瓦贵族是学术与诗歌的重要赞助者。"}]},{"partOfSpeech":"n.","definition":{"en":"the variety of Nahuatl associated with the Acolhua region (sometimes called Acolhua Nahuatl in academic contexts).","zh":"（学术语境）与阿科尔瓦地区相关的纳瓦特尔语变体（有时称为“阿科尔瓦纳瓦特尔语”）。"},"examples":[{"en":"The manuscript includes terms that scholars classify as Acolhua Nahuatl.","zh":"这份手稿包含一些学者归类为阿科尔瓦纳瓦特尔语的词汇。"}]}],"synonyms":["Acolhua people","Acolhuas","Acolhua Nahuatl (context-specific)"],"phonetic":"/əˈkoʊlwə/","extraExplanation":["“Acolhua”常见于中美洲史与人类学研究中，尤其与特斯科科（Texcoco）及其统治者传统相关。在一些叙述里，阿科尔瓦与墨西加人（Mexica，常被称为“阿兹特克”）一起出现在“同盟/联盟”政治结构的讨论中。","英语写作里它多作为专名使用，首字母常大写：Acolhua。也可见作形容用法（较少见），如 “Acolhua ruler / Acolhua tradition”。"]}
{"word":"Acolhuan","summary":{"en":"Acolhuan means “Acolhua person” or “related to the Acolhua,” a Nahua people historically centered around Texcoco in central Mexico.","zh":"Acolhuan 指“阿科尔瓦人”或“与阿科尔瓦人有关的”，阿科尔瓦人是历史上以墨西哥中部特斯科科为中心的纳瓦族群之一。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person belonging to the Acolhua, a Nahua people historically centered around Texcoco in the Valley of Mexico; also, the language or culture associated with them.","zh":"阿科尔瓦人（Acolhua）的一员：历史上以墨西哥谷地特斯科科（Texcoco）为中心的纳瓦人（Nahua）族群；也可指其语言或文化。"},"examples":[{"en":"Some sources describe Texcoco as an important Acolhuan center before the Spanish conquest.","zh":"一些资料把特斯科科描述为西班牙征服前的重要阿科尔瓦中心。"},{"en":"The museum exhibit includes Acolhuan art and poetry traditions.","zh":"博物馆展览包含阿科尔瓦的艺术与诗歌传统。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Acolhua people, their society, or their cultural traditions.","zh":"与阿科尔瓦人及其社会、文化传统有关的；阿科尔瓦的。"},"examples":[{"en":"Researchers compare Acolhuan legal practices with those of neighboring city-states.","zh":"研究者比较阿科尔瓦的法律实践与邻近城邦的做法。"},{"en":"An Acolhuan ruler of Texcoco was known as a patron of learning.","zh":"特斯科科的一位阿科尔瓦统治者以赞助学术闻名。"}]}],"synonyms":["Acolhua","Nahua (broader category)"],"phonetic":"/ˌɑːkoʊˈwɑːn/","extraExplanation":["Acolhuan 常见于历史与人类学语境，尤其与墨西哥谷地的“特斯科科（Texcoco）”相关。阿科尔瓦人通常被视为纳瓦（Nahua）族群的一支，与阿兹特克世界的政治与文化网络有密切联系。","拼写上也常见 Acolhua / Acolhuan：Acolhua 多指族群名称，Acolhuan 更常作形容词或“某族人”的名词用法。不同作者的拼写与用法可能略有差异。"]}
{"word":"acolhuan","summary":{"en":"Acolhuan refers to the Acolhua people of central Mexico (especially around Texcoco) or anything related to their culture and history.","zh":"Acolhuan 指中墨西哥特斯科科一带的阿科尔瓦人，或与其文化与历史相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from the Acolhua (Acolhuas), a Nahua people of central Mexico, especially around Texcoco, important in the Aztec (Triple Alliance) period","zh":"阿科尔瓦人（Acolhua/Acolhuas）之一：中墨西哥的纳瓦族群之一，主要在特斯科科（Texcoco）一带，在阿兹特克“三方同盟”时期很重要"},"examples":[{"en":"The Acolhuan nobility in Texcoco was known for supporting scholarship and the arts.","zh":"特斯科科的阿科尔瓦贵族以支持学术与艺术闻名。"},{"en":"Some sources describe an Acolhuan ruler as an ally within the Triple Alliance.","zh":"一些资料把某位阿科尔瓦统治者描述为“三方同盟”中的盟友。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Acolhua people, their culture, or their historical region","zh":"阿科尔瓦人的；与阿科尔瓦文化或其历史区域相关的"},"examples":[{"en":"Researchers study Acolhuan legal traditions recorded in early colonial documents.","zh":"研究者会研究早期殖民文献中记录的阿科尔瓦法律传统。"},{"en":"The museum has a small exhibit of Acolhuan ceramics from the Basin of Mexico.","zh":"博物馆有一个小展区，展出墨西哥盆地出土的阿科尔瓦陶器。"}]}],"synonyms":["Acolhua","Acolhuas","Texcocan (context-dependent)"],"phonetic":"/ˌɑːkoʊˈwɑːn/","extraExplanation":["“Acolhuan”常见于历史与人类学写作中，也常拼作“Acolhua / Acolhuas”。他们属于纳瓦（Nahua）文化圈，与阿兹特克相关但并不等同于“Mexica（墨西加人）”。","发音在英文里有不同读法；学术文本中更常用作形容词（Acolhuan culture）或作名词指该族群成员（an Acolhuan）。"]}
{"word":"Acolhuas","summary":{"en":"Acolhuas are a Nahua people of central Mexico, especially linked to Texcoco and the Aztec-era region of Acolhuacan.","zh":"Acolhuas 指墨西哥中部的纳瓦族群之一，尤与特斯科科及阿兹特克时期的阿科尔瓦坎地区相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Nahua (Aztec-related) people of central Mexico, especially the inhabitants of the Acolhuacan region and the city-state of Texcoco in the pre-Columbian era","zh":"墨西哥中部的纳瓦人（与阿兹特克相关的族群）之一，尤指前哥伦布时期阿科尔瓦坎地区与特斯科科城邦的居民"},"examples":[{"en":"The Acolhuas of Texcoco were important allies in the Aztec Triple Alliance.","zh":"特斯科科的阿科尔瓦人是阿兹特克三方同盟的重要盟友。"},{"en":"Some historical sources describe the Acolhuas as skilled administrators and patrons of learning.","zh":"一些史料描述阿科尔瓦人擅长治理，也支持学术与文化。"}]},{"partOfSpeech":"n.","definition":{"en":"the language or cultural traditions associated with the Acolhua people (less common usage)","zh":"阿科尔瓦人的语言或相关文化传统（较少见用法）"},"examples":[{"en":"Researchers compare Acolhua traditions with those of neighboring Nahua groups.","zh":"研究者会把阿科尔瓦传统与邻近的纳瓦族群进行比较。"}]}],"synonyms":["Acolhua people","Acolhua"],"phonetic":"əˈkoʊlwɑːz","extraExplanation":["“Acolhuas”是复数形式，单数常写作“Acolhua”。在历史语境中，它常与“Texcoco（特斯科科）”一起出现，因为特斯科科是阿科尔瓦人的重要政治与文化中心。","它们常被放在“Aztec Triple Alliance（三方同盟：特诺奇蒂特兰、特斯科科、特拉科潘）”的框架下理解；因此阅读历史文本时，看到Acolhuas往往是在谈这一地区的政治结构、贡赋体系或文化成就。","拼写与音译在不同资料中可能略有差异；遇到“Acolhua/Acolhuacan”通常是同一历史文化圈的相关词。"]}
{"word":"acologic","summary":{"en":"“Acologic” is a rare/nonstandard adjective meaning “illogical,” often treated as a misspelling.","zh":"“acologic”很罕见且不太规范，通常被当作“illogical（不合逻辑的）”的误拼。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard/rare) Not logical; lacking clear reasoning. Often a mistaken form of “alogical” or “illogical.”","zh":"（非标准/罕见）不合逻辑的；缺乏清晰推理的。常见于把“alogical / illogical”误写成“acologic”。"},"examples":[{"en":"His argument sounded acologic, with no clear connection between the facts and the conclusion.","zh":"他的论证听起来不合逻辑，事实与结论之间没有清晰关联。"},{"en":"Teachers usually correct “acologic” to “illogical” in formal writing.","zh":"在正式写作中，老师通常会把“acologic”纠正为“illogical”。"}]}],"synonyms":["illogical","irrational","unreasonable","alogical (rare)"],"phonetic":"/ˌeɪˈkɑːlədʒɪk/","extraExplanation":["“acologic”在主流英语词典中通常查不到，实际使用里多半是拼写错误或非常少见的变体。更自然、更常用的表达是：illogical（不合逻辑的）、irrational（不理性的）、unreasonable（不合理的）。","如果你原本想表达“生态的”，正确拼写是 ecological / ecologic（生态的）。如果你想表达“没有逻辑/不按逻辑推理”，更合适的是 alogical（较少见）或 illogical（最常用）。"]}
{"word":"acology","summary":{"en":"Acology is a rare/old word meaning the study of remedies or medicinal substances.","zh":"Acology 是一个少见/较古旧的词，意思是“对治疗药物或疗法的研究”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study of remedies or medicinal substances; an old or rare term close in meaning to pharmacology or materia medica","zh":"药物学；治疗药物/药剂的研究（较古旧或少见的用语，含义接近 pharmacology 或 materia medica）"},"examples":[{"en":"In older medical writing, acology referred to the study of remedies used to treat disease.","zh":"在较早的医学著作中，acology 指对用于治疗疾病的药物/疗法的研究。"},{"en":"She found the word “acology” in a nineteenth-century text, used much like “materia medica.”","zh":"她在一本文十九世纪的书里看到 “acology” 这个词，用法很像 “materia medica（药物学/本草学）”。"}]}],"synonyms":["pharmacology","materia medica"],"phonetic":"/əˈkɑlədʒi/","extraExplanation":["这个词非常少见，现代英语里通常不用。更常见的对应词是 pharmacology（药理学）或 materia medica（传统意义上的“药物学/本草学”）。","词源一般解释为来自希腊语 akos（“疗法、药物”）+ -logy（“……的学科/研究”）。在现代医学语境中，建议优先使用 pharmacology。"]}
{"word":"acolous","summary":{"en":"“acolous” is not a standard English word; it is likely a misspelling (often of “aqueous” or “acolyte”).","zh":"“acolous”不是标准英语词；很可能是拼写错误（常见为“aqueous”或“acolyte”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in modern dictionaries; it is most likely a misspelling of another word (commonly “aqueous” or “acolyte”), depending on your context.","zh":"现代英语词典中一般没有“acolous”这个词；它很可能是别的单词的拼写错误（常见候选是“aqueous”或“acolyte”），具体取决于语境。"},"examples":[{"en":"If you mean something “water-based,” the usual word is “aqueous,” as in “an aqueous solution.”","zh":"如果你想表达“以水为基础/含水的”，通常用“aqueous”，例如“an aqueous solution（水溶液）”。"},{"en":"If you mean “a helper/follower in a religious setting,” the word is “acolyte,” as in “an acolyte assisted the priest.”","zh":"如果你想表达“宗教仪式中的助手/随从”，用“acolyte”，例如“an acolyte assisted the priest（侍从协助牧师）”。"}]}],"extraExplanation":["这个拼写不像常见英语词形，可能是：\n1）把“aqueous”（化学/生物里很常见：水性的、水溶液的）拼错了；\n2）把“acolyte”（宗教仪式中的侍从；也可引申为某人的追随者）拼错了。\n\n如果你把包含“acolous”的原句发我，我可以根据语境帮你锁定正确单词并解释用法。"]}
{"word":"acolumnar","summary":{"en":"Acolumnar means “not columnar”—not arranged in columns or lacking a column-like structure, often in scientific descriptions.","zh":"acolumnar 指“非柱状/不成列的；缺乏柱状结构的”，多用于科学或学术描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of something that is usually columnar) not arranged in columns; lacking a column-like structure.","zh":"（原本通常呈柱状/成列的事物）不呈柱状或不成列的；缺乏“柱状/成列”结构的。"},"examples":[{"en":"The tissue showed an acolumnar pattern under the microscope.","zh":"在显微镜下，这种组织呈现出非柱状（acolumnar）的形态。"},{"en":"Some descriptions compare columnar and acolumnar organization in the cortex.","zh":"一些描述会对比大脑皮层的柱状组织与非柱状（acolumnar）组织。"}]}],"synonyms":["noncolumnar","non-columnar","without columns","uncolumned"],"phonetic":"əˈkɑləmnɚ","extraExplanation":["“a-”在这里是表示“无、缺少”的前缀（类似于 amoral=无道德的、atypical=非典型的）。因此 acolumnar 字面意思就是“没有 columnar（柱状/成列的）特征”。","这个词较少用于日常英语，更常见于解剖学、神经科学、组织学、植物学等学术语境，用来描述结构“不是按柱状/成列方式组织”的情况。"]}
{"word":"acoluthic","summary":{"en":"Acoluthic means incoherent or not logically connected, especially of speech or thought.","zh":"Acoluthic 指（尤其是言语或思维）不连贯、缺乏逻辑。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of speech, writing, or thinking) not logically connected; incoherent or hard to follow.","zh":"（指言语、写作或思维）前后不连贯的；缺乏逻辑的；难以理解的。"},"examples":[{"en":"His explanation was so acoluthic that no one could tell what caused the problem.","zh":"他的解释太不连贯了，没人能听出问题到底因何而起。"},{"en":"The witness gave an acoluthic account, jumping from one detail to another.","zh":"证人叙述前后跳跃、缺乏逻辑。"},{"en":"In the essay, a few acoluthic sentences made the main idea unclear.","zh":"文章里有几句不连贯的话，让中心意思变得不清楚。"}]}],"synonyms":["incoherent","illogical","disjointed","rambling","unconnected"],"phonetic":"/ˌækəˈluːθɪk/","extraExplanation":["“acoluthic”较为少见，常见于学术或医学语境，用来形容语言或思维“缺乏连贯性”。","词源可追溯到希腊语，核心含义与“跟随、连贯（logical sequence）”有关；加上否定含义后，表示“不按顺序、不连贯”。写作中更常用的替代词有：incoherent, illogical, disjointed。"]}
{"word":"acolyctine","summary":{"en":"“Acolyctine” isn’t a standard English word; it’s probably “acolyte,” meaning a ceremonial assistant or a devoted follower.","zh":"“acolyctine” 不是标准英语词；很可能是 “acolyte”，意为仪式侍从或忠实追随者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Likely a misspelling of “acolyte”: a person who helps a religious leader in a ceremony, or more generally a devoted follower/assistant.","zh":"很可能是 “acolyte” 的拼写错误：指在宗教仪式中协助神职人员的人；也可泛指某人的忠实追随者或助手。"},"examples":[{"en":"The acolyte carried candles during the church service.","zh":"侍从在教堂礼拜时手持蜡烛。"},{"en":"She became an acolyte of the famous chef and learned in his kitchen for years.","zh":"她成了那位名厨的得力助手，在他的厨房里学习了很多年。"}]}],"synonyms":["assistant","attendant","follower","disciple"],"phonetic":"ˈækəlaɪt","extraExplanation":["“acolyctine” 不是常见英语单词，词典中通常查不到。你可能想写的是 **acolyte**（常见拼写），意思是“（宗教仪式的）侍从/辅祭”或“追随者、助手”。","词源提示：*acolyte* 来自希腊语，原意与“跟随”有关，所以引申出“追随者/助手”的意思。"]}
{"word":"acolyte","summary":{"en":"An acolyte is either a devoted follower/assistant of a leader or, in church settings, a person who assists a priest during services.","zh":"acolyte 指某位领袖的追随者/助手，也可指教会礼拜中协助神职人员的“辅祭/侍从”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who helps or follows a more important leader or teacher, often learning from them.","zh":"助手；追随者；门徒（常跟随更有影响力的领袖或老师学习、做事）"},"examples":[{"en":"She was a young acolyte of the famous chef, learning every technique in the kitchen.","zh":"她是那位名厨的年轻门徒，在厨房里学习每一种技巧。"},{"en":"The director’s acolytes repeated his ideas in every meeting.","zh":"那位导演的追随者在每次会议上都重复他的观点。"}]},{"partOfSpeech":"n.","definition":{"en":"In some Christian churches, a person who assists the priest during religious services.","zh":"（某些基督教教会中）辅祭；侍从（在礼拜中协助神职人员的人）"},"examples":[{"en":"Two acolytes carried candles to the front of the church.","zh":"两名辅祭手持蜡烛走到教堂前方。"},{"en":"He served as an acolyte on Sundays.","zh":"他在周日担任辅祭。"}]}],"synonyms":["follower","disciple","assistant","attendant","adherent"],"phonetic":"/ˈækəlaɪt/","extraExplanation":["“acolyte”源自希腊语，原意与“跟随”有关，所以在现代英语里既可指宗教场合的“辅祭”，也常被引申为“某位权威人物的追随者/门徒”。","语气提示：在普通语境里说某人是某人的“acolyte”有时带一点贬义，暗示对方盲目追随或缺乏独立思考；但在宗教语境中通常是中性、正式的职位称呼。"]}
{"word":"acolytes","summary":{"en":"Acolytes are devoted followers or assistants; in church settings, they are helpers during services.","zh":"acolytes 指忠实的追随者/助手；在教会语境中指礼拜时协助神职人员的辅祭员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who follows, supports, or helps a leader, teacher, or powerful figure; a devoted assistant or disciple.","zh":"（某位领袖/导师/权威人物的）追随者、拥护者；助手；门徒"},"examples":[{"en":"The scientist’s acolytes repeated his ideas in every lecture.","zh":"那位科学家的追随者在每一堂课上都重复他的观点。"},{"en":"She built a team of acolytes who carried out her plans without question.","zh":"她组建了一支忠实的助手团队，毫不质疑地执行她的计划。"},{"en":"In the novel, the villain is surrounded by acolytes who do his dirty work.","zh":"在小说里，反派身边围着一群喽啰，替他干见不得人的事。"}]},{"partOfSpeech":"n.","definition":{"en":"In some Christian churches, a person who assists the priest or minister during services (often helping with candles, books, or other duties).","zh":"（某些基督教教会中的）辅祭员、侍从（在礼拜中协助神职人员）"},"examples":[{"en":"Two acolytes walked down the aisle carrying candles.","zh":"两名辅祭员手持蜡烛沿着过道走下去。"},{"en":"He served as an acolyte on Sundays before becoming a priest.","zh":"他在成为神父之前，星期天常担任辅祭员。"}]}],"synonyms":["followers","disciples","devotees","adherents","assistants","attendants"],"phonetic":"/ˈækəˌlaɪts/","extraExplanation":["“acolyte”源自希腊语，原意与“跟随”有关，所以在现代英语里常带有“紧随某人、忠心支持”的意味。","在新闻和文学中，acolytes有时带贬义，暗示“盲从的追随者/马仔”；但在宗教语境中通常是中性、正式的职务名称。"]}
{"word":"acolyth","summary":{"en":"An acolyte is a devoted assistant or follower, especially of an important person; in churches, it can mean someone who helps during services.","zh":"acolyte 指（重要人物的）助手/追随者；在教会语境中也指礼拜中的辅祭员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who helps a leader or important figure, often learning from them; a devoted follower or assistant.","zh":"（重要人物的）助手、追随者；常指在旁学习、支持的人。"},"examples":[{"en":"She started as an acolyte of a famous chef, learning in the kitchen every day.","zh":"她一开始是那位名厨的助手，每天在厨房里学习。"},{"en":"The speaker arrived with a group of acolytes who handled the details.","zh":"演讲者带着一群随行助手到场，负责各种细节。"}]},{"partOfSpeech":"n.","definition":{"en":"In some Christian churches, a person who assists in religious services, for example by carrying candles or helping the clergy.","zh":"（某些基督教会中）辅祭员；在礼拜中协助神职人员的人（如持烛等）。"},"examples":[{"en":"An acolyte carried the candle down the aisle.","zh":"一位辅祭员手持蜡烛沿着过道走下去。"},{"en":"He served as an acolyte on Sundays.","zh":"他在周日担任辅祭员。"}]}],"synonyms":["assistant","aide","follower","disciple","attendant"],"phonetic":"/ˈækəˌlaɪt/","extraExplanation":["你输入的“acolyth”更常见的正确拼写是 **acolyte**。","词源上来自希腊语，原意与“跟随、陪伴”有关，所以现代英语里也常引申为“追随者、门徒、得力助手”。","在新闻和书评中，**acolyte** 有时带一点“盲目拥护者/小跟班”的语气，取决于上下文。"]}
{"word":"acolythate","summary":{"en":"An acolyte is a helper or follower—especially someone who supports a leader; in church, it can mean a person who assists during services.","zh":"acolyte 指（1）某位领袖/老师的助手或追随者；（2）教会礼拜中协助神职人员的侍童/辅祭人员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who helps or follows a leader, teacher, or organization, often learning from them and supporting their work.","zh":"（常指追随某位领袖/老师/组织的）助手、门徒、追随者；常带有学习与支持的意味。"},"examples":[{"en":"She started as an acolyte of a famous chef and learned the basics in his kitchen.","zh":"她最初是那位名厨的门徒，在他的厨房里学会了基础。"},{"en":"The senator’s acolytes repeated his talking points on TV.","zh":"那位参议员的追随者在电视上重复他的论点。"}]},{"partOfSpeech":"n.","definition":{"en":"In some Christian churches, a person who assists the priest in a service, for example by carrying candles or helping at the altar.","zh":"（某些基督教教会中）侍童、辅祭人员；在礼拜中协助神职人员（如持烛、协助圣坛事务）。"},"examples":[{"en":"Two acolytes carried candles at the beginning of the ceremony.","zh":"仪式开始时，两名侍童手持蜡烛入场。"},{"en":"He volunteered as an acolyte on Sundays.","zh":"他周日自愿担任辅祭人员。"}]}],"synonyms":["follower","disciple","assistant","adherent","protégé"],"phonetic":"/ˈækəˌlaɪt/","extraExplanation":["你输入的“acolythate”很可能是拼写错误；常见正确拼写是 **acolyte**。","词源提示：acolyte 来自希腊语，原意接近“跟随者”。现代英语里既可指宗教场合的“侍童/辅祭”，也可泛指某个强势人物或团体的“追随者/门徒”，有时会带一点批评色彩（暗示盲从）。"]}
{"word":"acolytus","summary":{"en":"A rare Latin form of “acolyte,” meaning a helper in religious services; also used more broadly for a devoted follower or assistant.","zh":"“acolyte”的罕见拉丁语形式：指宗教仪式中的协助者；也可泛指某人的忠实追随者或助手。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A Latin form of “acolyte”: a person who assists in religious services, especially in a Christian church.","zh":"（罕见）“acolyte”（教会侍从/辅祭员）的拉丁语形式：在宗教仪式中协助的人员，尤指基督教礼仪中的助手。"},"examples":[{"en":"In medieval records, an acolytus is listed among the church’s minor ministers.","zh":"在中世纪的文献记录中，acolytus 常被列为教会的低阶事奉人员之一。"},{"en":"The manuscript uses the word acolytus where modern English would say acolyte.","zh":"该手稿使用 acolytus 一词，而现代英语通常会写 acolyte。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension) A devoted follower or assistant of an important person or leader.","zh":"（引申）某位重要人物或领袖的忠实追随者/助手。"},"examples":[{"en":"The politician was surrounded by loyal acolytus who repeated his talking points.","zh":"那位政治人物身边围着一群忠实追随者，不断重复他的论点。"},{"en":"She built a circle of acolytus who handled the daily work for her.","zh":"她培养了一圈得力助手，替她处理日常事务。"}]}],"synonyms":["acolyte","altar server","assistant","attendant","disciple","follower"],"phonetic":"ˈækəˌlaɪt","extraExplanation":["“Acolytus”主要见于拉丁语或拉丁化的教会文献写法；现代英语更常用拼写是 **acolyte**。","在基督教传统中，acolyte（辅祭员/侍从）常与点蜡烛、协助圣礼与礼仪流程等职责相关；不同教派与地区的具体职责可能略有差异。","在非宗教语境里，它也常带一点语气色彩：强调“追随”“拥护”，有时暗示盲从或小圈子。"]}
{"word":"Acoma","summary":{"en":"Acoma refers mainly to the Acoma Pueblo community/people in New Mexico (famous for “Sky City” and pottery), and sometimes to the Acoma variety of the Keres language.","zh":"Acoma 主要指美国新墨西哥州的阿科马普韦布洛社区/族群（以“天空之城”和陶艺闻名），有时也指克雷斯语的阿科马方言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Native American pueblo community and people in west-central New Mexico, known especially for “Acoma Pueblo” (often called “Sky City”) and for traditional pottery.","zh":"美国新墨西哥州中西部的美洲原住民普韦布洛（pueblo）社区与族群，常指“阿科马普韦布洛（Acoma Pueblo）”（又称“天空之城”），也以传统陶艺闻名。"},"examples":[{"en":"Acoma Pueblo is famous for its dramatic mesa-top setting.","zh":"阿科马普韦布洛因坐落在高耸的台地之上而闻名。"},{"en":"She bought a hand-painted bowl inspired by Acoma pottery.","zh":"她买了一个受阿科马陶器风格启发的手绘碗。"}]},{"partOfSpeech":"n.","definition":{"en":"the Acoma variety of the Keres language, traditionally spoken by the Acoma people.","zh":"克雷斯语（Keres）的一种方言/变体，传统上由阿科马人使用。"},"examples":[{"en":"Some cultural programs teach Acoma to younger community members.","zh":"一些文化项目会教授阿科马语给更年轻的社区成员。"}]}],"phonetic":"əˈkoʊmə","extraExplanation":["“Acoma”常作为专有名词出现；写作时常见搭配有 Acoma Pueblo（阿科马普韦布洛）、Acoma people（阿科马人）、Acoma pottery（阿科马陶器）。","Acoma Pueblo 因建在高台地（mesa）上而得名“Sky City（天空之城）”，是美国西南地区历史最悠久、持续有人居住的社区之一（常被这样介绍）。","在旅游与艺术语境中，“Acoma pottery”通常指阿科马传统的薄胎陶器与几何纹样风格；购买或介绍时，注意尊重其文化来源与当代工艺者。"]}
{"word":"acoma","summary":{"en":"Acoma refers to the Acoma Pueblo in New Mexico and the Acoma people/culture associated with it.","zh":"Acoma 指美国新墨西哥州的阿科马普韦布洛，也可指阿科马族群及其相关文化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Native American pueblo (community) in western New Mexico, USA, famous for its long history and its hilltop village often called “Sky City.”","zh":"美国新墨西哥州西部的阿科马普韦布洛（原住民聚落/社区），历史悠久，以建在高台上的村落著称，常被称为“天空之城”。"},"examples":[{"en":"Many visitors come to Acoma to learn about Pueblo history and culture.","zh":"许多游客来到阿科马，了解普韦布洛的历史与文化。"},{"en":"Acoma is known for its dramatic mesa-top settlement.","zh":"阿科马以建在台地顶端的聚落景观闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"The Acoma people (a Pueblo nation) and, more broadly, things related to them (for example, Acoma traditions or Acoma pottery).","zh":"阿科马人（普韦布洛民族之一）；也可泛指与其相关的事物（如阿科马传统、阿科马陶器）。"},"examples":[{"en":"Acoma pottery is admired for its fine lines and geometric designs.","zh":"阿科马陶器因细致的线条与几何图案而备受赞赏。"},{"en":"She studied Acoma oral traditions in a cultural history course.","zh":"她在文化史课程中研究了阿科马的口述传统。"}]}],"synonyms":["Acoma Pueblo","Sky City (nickname)","Pueblo of Acoma"],"phonetic":"əˈkoʊmə","extraExplanation":["“Acoma”常指“Acoma Pueblo”（阿科马普韦布洛）以及其族群。英语里也常见全称“Acoma Pueblo”或称其高台村落为“Sky City”。","谈到阿科马文化（如陶器、传统）时，英文里常用“Acoma + 名词”作定语：Acoma pottery / Acoma traditions。","这是专有名词，写作要大写：Acoma。若不确定指地点还是族群，可用更明确的说法：the Acoma Pueblo (the community) / the Acoma people (the nation)."]}
{"word":"acome","summary":{"en":"“Acome” is a rare, nonstandard/archaic form meaning “coming/arriving.” In modern writing, use “coming,” “arriving,” or “come.”","zh":"“acome”是罕见的方言/古语形式，意思接近“正在来/到来”。现代写作通常用“coming/arriving/come”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard/archaic) coming; arriving; on the way.","zh":"（非标准/古语）正在来；到来；在路上。"},"examples":[{"en":"Help is acome, so try to stay calm.","zh":"救援快到了，所以尽量保持冷静。"},{"en":"Winter is acome early this year.","zh":"今年冬天来得早。"}]},{"partOfSpeech":"v.","definition":{"en":"(Very rare) to come; to arrive.","zh":"（很少见）来；到达。"},"examples":[{"en":"They said they would acome before nightfall.","zh":"他们说会在天黑前到。"}]}],"synonyms":["coming","arriving","on the way"],"phonetic":"/əˈkʌm/","extraExplanation":["“acome”在现代标准英语里几乎不用，多见于方言或旧文学风格。它常被理解为“a- + come”，其中前缀 a- 是早期英语里表示“处于某种状态/正在进行”的用法（类似于 awash, asleep）。","如果你想写现代英语，通常直接用 coming / on the way / arriving，或用动词 come。也可能是拼写想写 acorn（橡子）或 acme（顶点），如果你告诉我语境我可以帮你确认。"]}
{"word":"acomia","summary":{"en":"A rare medical term meaning absence or loss of hair (similar to alopecia).","zh":"一个较少见的医学词，指毛发缺失或脱落（类似脱发症/秃发）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) The absence or loss of hair; baldness, especially when described as a condition (similar to alopecia).","zh":"（医学）无毛症；毛发缺失或脱落（类似于“alopecia / 脱发症”）。"},"examples":[{"en":"The dermatologist noted signs consistent with acomia and recommended further tests.","zh":"皮肤科医生记录了与无毛症相符的迹象，并建议做进一步检查。"},{"en":"In some rare cases, acomia can be present from birth.","zh":"在一些罕见情况下，无毛症可能从出生就存在。"}]}],"synonyms":["alopecia","baldness","hair loss"],"phonetic":"əˈkoʊmiə","extraExplanation":["“acomia”是非常少见的医学用词，更多情况下医生或科普文章会使用更常见的“alopecia（脱发/秃发）”来表达类似概念。","词源上可理解为希腊语构词：a-（无、缺乏）+ kome（头发），字面意思接近“没有头发”。"]}
{"word":"acomous","summary":{"en":"A rare botanical adjective meaning “without a coma (tuft of hairs) on a seed or fruit.”","zh":"一个少见的植物学形容词，表示“种子或果实无冠毛/毛束”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having no coma (a tuft of silky hairs or bristles on a seed or fruit).","zh":"（植物学）无冠毛的；（种子或果实）没有顶端绒毛/毛束的。"},"examples":[{"en":"Milkweed seeds are usually comose, but some species have achenes that are acomous.","zh":"马利筋的种子通常有冠毛，但有些物种的瘦果是无冠毛的。"},{"en":"The description notes the fruit is acomous, which helps distinguish it from related plants.","zh":"描述中提到果实“无冠毛”，这有助于把它和近缘植物区分开。"}]}],"synonyms":["noncomose","without coma"],"phonetic":"/əˈkoʊməs/","extraExplanation":["“acomous”是非常少见的科学用词，多见于植物分类/形态学描述。词源可理解为 a-（表示“无、非”）+ comose/coma（“冠毛、毛束”）。在植物学里，coma 指种子或果实顶端像绒毛一样的毛束（例如有助于风力传播）。"]}
{"word":"acomplisshen","summary":{"en":"“Accomplish” means to successfully complete something or achieve a result.","zh":"“accomplish”表示成功完成某事或达成某种结果。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To succeed in doing or finishing something that you planned or tried to do.","zh":"成功做到或完成（计划或努力要做的事）。"},"examples":[{"en":"She accomplished her goal of running a marathon.","zh":"她实现了跑完马拉松的目标。"},{"en":"We finally accomplished the task before the deadline.","zh":"我们终于在截止日期前完成了任务。"}]},{"partOfSpeech":"vt.","definition":{"en":"To achieve a particular result or effect.","zh":"达到某种结果；产生某种效果。"},"examples":[{"en":"A short meeting can accomplish a lot if everyone is prepared.","zh":"如果大家都准备充分，一次短会也能达成很多事情。"}]}],"synonyms":["achieve","complete","finish","carry out","attain"],"phonetic":"/əˈkɑmplɪʃ/","extraExplanation":["你输入的“acomplisshen”不是标准拼写。最接近、最常用的词是 accomplish（动词）。常见拼写点：a c c o m p l i s h（中间有两个 c，结尾是 -ish）。","常见搭配：accomplish a goal/task/mission（实现目标/完成任务/完成使命）；be accomplished（很有造诣、很熟练，较正式：an accomplished pianist 一位技艺高超的钢琴家）。"]}
{"word":"aconative","summary":{"en":"“Aconative” means lacking will or motivation to initiate and pursue goals (a formal psychology term).","zh":"“aconative”指缺乏意志与动机、难以主动启动并追求目标（偏心理学的正式用语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(psychology, formal) Lacking conation—showing little or no will, motivation, or purposeful striving.","zh":"（心理学，正式）缺乏“意志/动机”（conation）的；缺少主动追求与目标导向的。"},"examples":[{"en":"The report described an aconative state in which the patient showed no drive to start tasks.","zh":"报告描述了一种“无意志”的状态：患者缺乏启动任务的动力。"},{"en":"In an aconative mood, even simple goals can feel impossible to pursue.","zh":"在缺乏动机的情绪状态下，即使是简单目标也会让人觉得难以去追求。"}]}],"synonyms":["unmotivated","lacking initiative","apathetic","listless","without drive"],"phonetic":"ˌeɪkəˈneɪtɪv","extraExplanation":["“Aconative”来自前缀 a-（表示“无、缺乏”）+ conative（与“意志/动机、主动努力”有关）。在一些心理学/精神病学语境中，conation 常与 cognition（认知）和 emotion/affect（情绪）并列，用来讨论人的“想去做、愿意做并付诸行动”的能力。","该词较少用于日常英语。更常见、口语一些的替代表达包括：unmotivated（没动力的）、lacking initiative（缺乏主动性）、apathetic（冷漠/无兴趣的）。","注意区分：aconative 强调“意志行动层面”的缺失；apathetic 更偏“兴趣/情感淡漠”；depressed 主要是“情绪低落”，但也可能伴随动力下降。"]}
{"word":"Aconcagua","summary":{"en":"Aconcagua is the highest mountain in South America, in the Andes of Argentina.","zh":"Aconcagua（阿空加瓜峰）是南美洲最高的山峰，位于阿根廷的安第斯山脉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the highest mountain in South America, located in the Andes of western Argentina","zh":"南美洲最高的山峰，位于阿根廷西部的安第斯山脉"},"examples":[{"en":"Aconcagua is a popular destination for climbers training for very high peaks.","zh":"阿空加瓜峰是许多登山者为攀登更高山峰而训练的热门目的地。"},{"en":"They traveled to Mendoza Province to see Aconcagua in the Andes.","zh":"他们前往门多萨省，在安第斯山脉观赏阿空加瓜峰。"}]}],"synonyms":["Mount Aconcagua"],"phonetic":"/ˌɑː.kɑːnˈkɑː.ɡwɑː/","extraExplanation":["阿空加瓜峰（Aconcagua）海拔约 6,961 米（22,838 英尺），常被列为“七大洲最高峰（Seven Summits）”之一。虽然技术难度相对一些高峰不算最高，但由于海拔极高、天气多变，仍需要充分的高海拔适应与安全准备。","名称“Aconcagua”常被认为源自南美原住民语言（如克丘亚语 Quechua 等）的地名。英文中通常大写，指这座山本身；也常说“Mount Aconcagua”。"]}
{"word":"acondylar","summary":{"en":"Acondylar means “without a condyle,” describing a bone or structure that lacks the usual rounded joint surface.","zh":"Acondylar 意为“无髁的”，用于描述骨或结构缺少通常的髁状关节面。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy/medicine) Lacking a condyle; not having the rounded joint surface (condyle) that a bone usually has.","zh":"（解剖/医学）无髁的；缺少髁状关节面（骨端用于形成关节的圆形突起） 的。"},"examples":[{"en":"In some descriptions, an acondylar mandible refers to a lower jaw that lacks a distinct condylar process.","zh":"在一些描述中，acondylar mandible 指缺少明显髁突的下颌骨。"},{"en":"The report noted an acondylar appearance of the bone end, which affected joint movement.","zh":"报告指出骨端呈现无髁样外观，这会影响关节活动。"}]}],"synonyms":["noncondylar","without a condyle"],"phonetic":"/eɪˈkɑndəlɚ/","extraExplanation":["“a-”常表示“无、缺少”（如 atypical=非典型），而“condylar”来自“condyle（髁）”。因此 acondylar 直观含义就是“没有髁的”。","该词多见于解剖学、影像学或临床病例描述中，用来形容骨骼末端关节结构缺失或不明显（例如下颌髁突区域的异常），属于较专业的医学用语。"]}
{"word":"acondylia","summary":{"en":"Acondylia means the absence of a condyle, often referring to the missing mandibular condyle in the jaw.","zh":"Acondylia 指“髁缺失”，常用于描述下颌髁突缺失等医学情况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical condition in which a condyle (a rounded joint surface at the end of a bone) is absent, especially referring to the mandibular condyle in the jaw.","zh":"一种医学状况，指骨骼末端用于形成关节的“髁”（圆形关节面）缺失；常见用法尤其指下颌骨髁突（颞下颌关节的关节头）缺失。"},"examples":[{"en":"The surgeon reviewed imaging to confirm acondylia of the mandibular condyle.","zh":"外科医生查看影像资料以确认患者存在下颌髁突缺失（acondylia）。"},{"en":"In severe cases of acondylia, jaw movement and facial symmetry can be affected.","zh":"在严重的髁缺失病例中，张口运动与面部对称性可能会受到影响。"}]}],"synonyms":["absence of a condyle","condylar agenesis"],"phonetic":"ˌeɪkɑnˈdɪliə","extraExplanation":["词源拆解：a- 表示“无、缺乏”；condyl- 来自“condyle（髁）”；-ia 常见于医学名词，表示“某种状态/疾病”。","常见语境：多见于口腔颌面外科、颞下颌关节（TMJ）相关的先天畸形或发育异常讨论中，临床上可能与咬合问题、下颌发育不足、面部不对称等一起出现。","学习提示：这属于较少见的专业医学词汇，日常英语中几乎不用；读文献时可把它理解为“某个关节的髁缺失”。"]}
{"word":"acondylose","summary":{"en":"A rare medical term meaning absence or severe underdevelopment of a condyle (a joint-forming bony knob).","zh":"一种少见医学用语，指关节形成的骨性突起“髁”缺失或严重发育不全。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical, rare) A condition in which a bone lacks a condyle (the rounded “knob” at the end of a bone that forms part of a joint), often referring to congenital absence or severe underdevelopment of a condyle (for example, the mandibular condyle in the jaw).","zh":"（医学，少见）指骨头缺少髁（骨末端形成关节的圆形突起），常用于描述先天性缺失或严重发育不全的髁（例如下颌髁）。"},"examples":[{"en":"The CT report suggested acondylose of the mandibular condyle, which can affect jaw growth.","zh":"CT报告提示下颌髁“acondylose”（髁缺失/严重发育不全），这可能影响下颌生长。"},{"en":"In rare craniofacial cases, acondylose may lead to difficulty opening the mouth normally.","zh":"在少见的颅颌面病例中，acondylose 可能导致张口困难。"}]}],"synonyms":["acondylosis","acondylia","absence of a condyle"],"phonetic":"/əˈkɑn.dəˌloʊs/","extraExplanation":["“acondylose”不是常见的标准英语词形，更常见的英语对应词是 **acondylosis**（以 -osis 结尾的“病变/状态”名词）或形容词 **acondylous**（“无髁的”）。如果你是在法语或其他语言的医学资料里看到“acondylose”，在英文写作/检索时建议改用 **acondylosis**。","词根提示：**condyle**（髁）来自希腊语 *kondylos*（“关节的突起/指节”）；前缀 **a-** 表示“无、缺少”。"]}
{"word":"acondylosis","summary":{"en":"A rare medical term meaning the absence or underdevelopment of a bone condyle (often the jaw condyle).","zh":"较少见的医学词，指骨髁（常为下颌髁突）缺失或发育不全。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) The absence or failure of development of a condyle (a rounded knob of bone that forms part of a joint), especially the mandibular (jaw) condyle.","zh":"（医学）髁突（关节处的圆形骨突）缺如或发育不全，常指下颌髁突缺如/发育不良。"},"examples":[{"en":"The CT scan suggested acondylosis of the mandibular condyle on the left side.","zh":"CT 扫描提示左侧下颌髁突缺如/发育不全（acondylosis）。"},{"en":"In severe acondylosis, the jaw joint may function poorly and affect chewing.","zh":"在严重的髁突缺如/发育不全中，颞下颌关节可能功能较差，从而影响咀嚼。"}]}],"synonyms":["condylar aplasia","condylar agenesis","absence of the condyle"],"phonetic":"/ˌeɪkɑːn.dɪˈloʊ.sɪs/","extraExplanation":["词源上可拆成 a-（无、缺乏）+ condyl-（髁、髁突）+ -osis（……状态/病变）。","这是较少见的医学术语，多出现在口腔颌面外科、放射影像或骨科语境；日常英语中几乎不用。临床写作里也可能改用更常见的表述，如 condylar aplasia/agenesis（髁突发育缺如/缺失）。"]}
{"word":"acondylous","summary":{"en":"Acondylous means “without condyles,” used in anatomy or zoology to describe bones or structures that lack rounded joint surfaces.","zh":"acondylous 意为“无髁的”，多用于解剖学或动物学，描述缺少用于关节连接的圆形骨突起的骨或结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy/Zoology) Lacking condyles (rounded joint surfaces at the end of a bone).","zh":"（解剖/动物学）无髁的；缺少髁（骨端用于关节连接的圆形突起）。"},"examples":[{"en":"In some anatomical descriptions, the lower jaw may be described as acondylous.","zh":"在一些解剖描述中，下颌骨可能会被描述为“无髁的”。"},{"en":"The fossil was noted as acondylous, suggesting a different type of jaw articulation.","zh":"这块化石被标注为“无髁的”，暗示其颌部关节方式不同。"}]}],"synonyms":["acondylar","lacking condyles"],"phonetic":"/ˌeɪˈkɑːn.dɪ.ləs/","extraExplanation":["“condyle（髁）”指骨头末端用于形成关节的圆形突起（如股骨髁、枕骨髁）。因此“acondylous”常见于解剖学、比较动物学与古生物学的专业描述，用来强调某结构“没有髁”。","词首 a- 表示“无/缺乏”（如 asymmetrical 不对称的），-ous 表示“……的”，整体字面意思就是“没有髁的”。","该词较为少见，写作中也可能看到近义形容词“acondylar”，含义相近，依学科与作者习惯选择。"]}
{"word":"acone","summary":{"en":"“acone” isn’t standard English; it’s usually a typo for “a cone” (one cone-shaped object) or sometimes “alone.”","zh":"“acone”不是标准英语；通常是把 “a cone”（一个锥形物）连写的拼写错误，有时也可能是 “alone” 的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling or run-together form of “a cone” (meaning one cone-shaped object).","zh":"不是标准英语单词；最常见是把 “a cone”（一个圆锥体/锥形物）写在一起的拼写错误。"},"examples":[{"en":"I think you meant “a cone,” like an ice cream cone.","zh":"我猜你想写的是 “a cone”，比如“一个冰淇淋蛋筒”。"},{"en":"Draw a cone and label its height.","zh":"画一个圆锥体，并标出它的高度。"}]},{"partOfSpeech":"other","definition":{"en":"Sometimes used by learners as a misspelling of “alone” (by oneself; without other people).","zh":"有时学习者会把它当作 “alone”（独自；没有其他人）的拼写错误。"},"examples":[{"en":"If you mean “alone,” you can say: I stayed home alone.","zh":"如果你想表达 “alone”，可以说：I stayed home alone.（我一个人待在家。）"},{"en":"She felt alone in the new city.","zh":"她在新城市里感到很孤单。"}]}],"synonyms":["a cone","alone"],"phonetic":"ə koʊn","extraExplanation":["“acone”在常见词典里一般查不到。更自然的写法通常是分开写成 “a cone”。","如果你原本想表达“独自/孤单”，正确拼写是 “alone”。","你可以告诉我你看到“acone”的句子原文，我能帮你判断到底是 “a cone” 还是 “alone”。"]}
{"word":"aconelline","summary":{"en":"“Aconelline” is a very uncommon technical noun for an alkaloid name, often discussed in older or specialized Aconitum (monkshood) chemistry contexts.","zh":"“Aconelline”是一个非常少见的技术性名词，通常指与乌头属（monkshood）相关的某种生物碱名称，多见于较早或较专业的化学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare name for a chemical substance (an alkaloid) reported in some sources as coming from Aconitum (monkshood) plants; used mainly in technical or historical contexts and not common in modern English","zh":"一种较少见的化学物质名称（生物碱），据部分资料记载与乌头属（monkshood）植物有关；多见于技术或历史语境，在现代英语中并不常用"},"examples":[{"en":"In older botanical chemistry notes, aconelline is listed among alkaloids found in Aconitum species.","zh":"在较早期的植物化学笔记中，aconelline 被列为乌头属植物中的生物碱之一。"},{"en":"Because the term is uncommon, many writers use the better-known name aconitine instead.","zh":"由于这个词不常见，许多作者会改用更常见的名称 aconitine。"}]}],"synonyms":["aconitine (often used instead in many texts)"],"phonetic":"/əˈkɑnəˌliːn/","extraExplanation":["这个词在现代常用词典里很少见，拼写也可能与 aconitine（乌头碱）等词混淆；如果你是在论文、药理/植物化学资料里看到它，建议你提供原句或来源，我可以帮你核对具体指的是哪一种成分、是否为旧称或误拼。","乌头属植物相关生物碱常具有较强毒性；在阅读或翻译相关资料时，要注意它们在不同文献中的异名（synonyms）和拼写差异。"]}
{"word":"aconic","summary":{"en":"Aconic means “not conic”—not cone-shaped or not a conic section; in botany it can mean “without cones.”","zh":"aconic 指“非圆锥的”（不呈圆锥形或非圆锥曲线）；在植物学中也可指“无球果的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not conic; not having the shape or properties of a cone or a conic section.","zh":"非圆锥的；不具有圆锥形或圆锥曲线特征的。"},"examples":[{"en":"The roof design is acyclic rather than conical; it’s aconic and flat.","zh":"这个屋顶的设计不是圆锥形的；它是非圆锥的，而且很平。"},{"en":"In geometry, an aconic curve is one that is not a conic section.","zh":"在几何学里，“aconic curve”指的不是圆锥曲线的曲线。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Botany, specialized) Not bearing cones; without cones.","zh":"（植物学，较少见）无球果的；不结球果的。"},"examples":[{"en":"Ferns are aconic plants because they reproduce by spores, not cones.","zh":"蕨类植物是无球果植物，因为它们靠孢子繁殖，而不是靠球果。"}]}],"synonyms":["nonconic","non-conical","without cones"],"phonetic":"/əˈkɑːnɪk/","extraExplanation":["“a-”常见作否定前缀，表示“无、非、不”，如 atypical（非典型的）。因此 aconic 可理解为“非 conic（圆锥/圆锥曲线）的”。该词在日常英语中很少见，更常出现在数学、几何或植物学等语境。"]}
{"word":"aconin","summary":{"en":"“aconin” isn’t a common English word; it’s probably “aconite” (a highly poisonous plant).","zh":"“aconin”不是常见英语词；很可能是“aconite”（一种剧毒植物，乌头/狼毒草）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“aconin” is not a standard English word in common dictionaries. It is most likely a misspelling of “aconite,” a poisonous plant (also called wolfsbane or monkshood).","zh":"“aconin”不是常见标准英语单词，多半是“aconite”的拼写错误；“aconite”指一种有剧毒的植物（又称狼毒草/乌头、monkshood）。"},"examples":[{"en":"I couldn’t find “aconin” in the dictionary—did you mean “aconite”?","zh":"我在词典里找不到“aconin”——你是不是想写“aconite”？"},{"en":"Aconite is extremely poisonous, so it should never be eaten.","zh":"乌头（aconite）剧毒，绝对不能食用。"}]}],"synonyms":["aconite","wolfsbane","monkshood"],"phonetic":"/ˈækəˌnaɪt/","extraExplanation":["如果你想查的是别的词，请告诉我：你看到它的句子/上下文，或者你想表达的中文意思（例如“乌头/狼毒草/毒药/坚果/橡子”等）。我可以据此帮你确定正确拼写并给出准确释义。"]}
{"word":"aconine","summary":{"en":"Aconine is an alkaloid related to aconitine, found in or derived from aconite plants (Aconitum).","zh":"Aconine 是一种与乌头碱相关的生物碱，存在于或可由乌头属（Aconitum）植物中的成分分解生成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical alkaloid related to aconitine, found in aconite (Aconitum) plants and produced when aconitine breaks down (for example, by hydrolysis).","zh":"乌头类植物（Aconitum，乌头属）中的一种生物碱，与乌头碱（aconitine）相关，也可由乌头碱分解（如水解）生成。"},"examples":[{"en":"In some chemical texts, aconine is described as a breakdown product of aconitine.","zh":"在一些化学文献中，aconine 被描述为乌头碱（aconitine）的分解产物。"},{"en":"Researchers isolated several alkaloids from Aconitum species, including aconine.","zh":"研究人员从乌头属植物中分离出多种生物碱，其中包括 aconine。"}]}],"synonyms":["(technical) alkaloid"],"phonetic":"/ˈækənaɪn/","extraExplanation":["“Aconine”多见于药物化学、天然产物化学或毒理学语境。乌头属植物含多种强心脏与神经毒性成分，历史上既用于传统药用也与中毒事件相关；涉及此类物质的内容应仅作学术了解，切勿自行采集、炮制或服用乌头类植物。"]}
{"word":"aconital","summary":{"en":"Aconital means “connected with aconite (wolfsbane), especially its poisonous compounds.”","zh":"aconital 指“与乌头（狼毒草）有关的，尤指其有毒成分”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to or made from aconite (a plant also called wolfsbane), especially its poisonous substances.","zh":"与乌头（又称“狼毒草”）有关的；由乌头制成的，尤指其含有的有毒成分。"},"examples":[{"en":"Aconital alkaloids can be extremely dangerous if ingested.","zh":"乌头相关的生物碱如果被摄入会非常危险。"},{"en":"The report warned about aconital toxins in improperly prepared herbal products.","zh":"报告警告了不当加工的草药制品中可能含有乌头类毒素。"}]}],"synonyms":["aconitic (less common, different nuance)","related to aconite","of aconite"],"phonetic":"/ˌækəˈnaɪtəl/","extraExplanation":["“aconital”在现代英语里比较少见，更常见的相关词有：\n- “aconite”（n. 乌头；乌头制剂）\n- “aconitine”（n. 乌头碱，一种强毒性生物碱）\n在阅读医学、毒理学或植物学资料时更可能遇到。","乌头（wolfsbane/aconite）在西方文学与民间传说中常与“毒药、巫术、暗杀”意象相连，但现实中它确实是强毒植物；涉及草药使用时应以正规医疗建议为准。"]}
{"word":"aconitase","summary":{"en":"Aconitase is an enzyme in the citric acid cycle that helps cells make energy by converting citrate to isocitrate.","zh":"aconitase（乌头酸酶）是柠檬酸循环中的一种酶，通过把柠檬酸转为异柠檬酸来帮助细胞产生能量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An enzyme that helps convert citrate into isocitrate in the citric acid (Krebs) cycle, helping cells produce energy.","zh":"一种酶，在柠檬酸循环（克雷布斯循环）中催化柠檬酸转变为异柠檬酸，帮助细胞产生能量。"},"examples":[{"en":"Aconitase is an important enzyme in the citric acid cycle.","zh":"乌头酸酶是柠檬酸循环中的重要酶。"},{"en":"When aconitase activity drops, cells may produce less energy.","zh":"当乌头酸酶活性下降时，细胞可能产生更少的能量。"},{"en":"Researchers measured aconitase to study how oxidative stress affects mitochondria.","zh":"研究人员测量乌头酸酶，以研究氧化应激如何影响线粒体。"}]}],"synonyms":["citrate hydratase"],"phonetic":"/əˈkoʊnɪˌteɪs/","extraExplanation":["“Aconitase”这个名字来自它与“aconitic acid（乌头酸）”相关的反应中间体；在柠檬酸循环里，它通过“脱水/再水合”的方式实现柠檬酸与异柠檬酸之间的异构化。","乌头酸酶通常含有铁-硫簇（iron–sulfur cluster），因此对氧化应激较敏感；这一点也使它在生物化学与疾病研究（如线粒体功能、氧化损伤）中常被用作指标。"]}
{"word":"aconitate-related","summary":{"en":"Aconitate-related means “connected with aconitate,” usually in biochemical contexts like the Krebs cycle.","zh":"aconitate-related 指“与乌头酸盐有关的”，多用于生物化学语境（如克雷布斯循环）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with or involving aconitate (a salt or ester of aconitic acid), especially in biochemistry (e.g., the citric acid/Krebs cycle).","zh":"与乌头酸盐（aconitate，乌头酸的盐或酯）有关的；尤指生物化学中（如柠檬酸循环/克雷布斯循环）涉及乌头酸盐的。"},"examples":[{"en":"Researchers measured aconitate-related metabolites during mitochondrial stress.","zh":"研究人员在粒线体压力条件下测量了与乌头酸盐相关的代谢物。"},{"en":"The paper discusses aconitate-related steps in the Krebs cycle.","zh":"这篇论文讨论了克雷布斯循环中与乌头酸盐相关的步骤。"}]}],"synonyms":["aconitate-associated","aconitate-linked","aconitate-dependent"],"phonetic":"/əˈkɑːnɪˌteɪt rɪˈleɪtɪd/","extraExplanation":["“aconitate”常出现在生物化学语境里，尤其与柠檬酸循环有关：柠檬酸（citrate）可转化为顺乌头酸（cis-aconitate），再变为异柠檬酸（isocitrate）；这一段通常与酶“aconitase（顺乌头酸酶）”相关。","词形上，“-related”表示“与……相关的/有关联的”，常用于科研写作中的复合形容词（如 inflammation-related, stress-related）。写作时也可用更具体的表达：“aconitate-associated / aconitate-dependent”。"]}
{"word":"aconite","summary":{"en":"Aconite is a very poisonous flowering plant (monkshood/wolfsbane).","zh":"aconite 指剧毒的开花植物乌头（monkshood / wolfsbane）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very poisonous plant (monkshood, genus Aconitum) with tall spikes of blue or purple flowers; also used in small, carefully controlled amounts in traditional medicine","zh":"乌头属植物（又称“乌头/附子/头巾花”，Aconitum属）；含剧毒，开蓝紫色穗状花；在一些传统医学中曾被极小剂量、严格处理后使用"},"examples":[{"en":"Aconite is beautiful, but it is one of the most poisonous plants in many gardens.","zh":"乌头很漂亮，但它是许多花园里最毒的植物之一。"},{"en":"The label warned visitors not to touch the aconite flowers.","zh":"告示提醒游客不要触碰乌头的花。"}]}],"synonyms":["monkshood","wolfsbane","Aconitum"],"phonetic":"/ˈækəˌnaɪt/","extraExplanation":["“Aconite”在英文里常见别名是“monkshood”（因花形像修士的兜帽）或“wolfsbane”（源于欧洲民间传说与毒杀狼的故事）。","文学与文化中，乌头常被用作“致命毒药”的意象（例如侦探小说、哥特文学里常出现），因此在阅读中看到它往往暗示危险或阴谋。","注意：现实中乌头全株有毒，误食或皮肤接触都可能危险；这里是词汇解释，不是医疗建议。"]}
{"word":"aconites","summary":{"en":"Aconites are poisonous flowering plants (plural of aconite).","zh":"aconites 指“乌头”等有毒开花植物（aconite 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of aconite: a group of poisonous flowering plants (also called monkshood or wolfsbane).","zh":"aconite 的复数：乌头属的有毒开花植物（也叫 monkshood/狼毒草 wolfsbane）。"},"examples":[{"en":"The garden guide warned that aconites are highly toxic if eaten.","zh":"园艺指南警告说，乌头植物一旦误食毒性很强。"},{"en":"In the old story, the villain used aconites as a hidden poison.","zh":"在那个老故事里，反派把乌头当作暗藏的毒药。"}]}],"synonyms":["monkshood","wolfsbane"],"phonetic":"/ˈækəˌnaɪt/","extraExplanation":["“aconite/乌头”在西方文学与民间传说中常与“剧毒”“巫术/解毒”等意象相连，因此在小说或诗歌里出现时，往往用来营造危险、阴暗或神秘的氛围。","别名提示：monkshood（因花形像僧帽而得名），wolfsbane（传统传说中被认为可用来对付狼或狼人）。"]}
{"word":"aconitia","summary":{"en":"Aconitia is an old/less common word for a highly poisonous chemical from aconite (monkshood) plants.","zh":"aconitia 指乌头（舟形乌头/附子）植物中的一种剧毒成分，是较旧、较少见的说法（更常见 aconitine）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very poisonous alkaloid (toxic chemical) found in aconite (monkshood) plants; used historically in medicine but dangerous in even tiny amounts","zh":"乌头（舟形乌头/附子）植物中的一种剧毒生物碱（毒性化学物质）；历史上曾用于医药，但极少量即可致命"},"examples":[{"en":"Aconitia can cause severe heart problems if swallowed.","zh":"误食乌头碱可能导致严重的心脏问题。"},{"en":"The lab label warned that aconitia is lethal in small doses.","zh":"实验室标签警告：乌头碱小剂量即可致命。"}]}],"synonyms":["aconitine","aconite alkaloid"],"phonetic":"/ˌækəˈnɪʃiə/","extraExplanation":["“aconitia”在英语里较少见，更常见的词是“aconitine”。在一些旧的医学或化学资料中会出现“aconitia”，指乌头类植物中的剧毒成分。","乌头类（monkshood/aconite）在西方文学与民间传说中常被写作“毒药植物”，因此相关词汇带有强烈的危险与阴暗色彩。"]}
{"word":"aconitic","summary":{"en":"Aconitic means ‘related to aconitic acid,’ used mainly in chemistry and biochemistry.","zh":"aconitic 指“与乌头酸有关的”，主要用于化学与生物化学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to or containing aconitic acid (a chemical found in plants, especially in the aconite family, and used in chemistry/biochemistry contexts).","zh":"与乌头酸（aconitic acid）有关的；含有乌头酸的（常见于植物/化学与生物化学语境）。"},"examples":[{"en":"Researchers measured aconitic compounds in the plant extract and discussed their possible biological roles.","zh":"研究人员测量了该植物提取物中的乌头酸相关化合物，并讨论了它们可能的生物作用。"},{"en":"The paper describes an aconitic intermediate in the metabolic pathway.","zh":"论文描述了代谢通路中的一个乌头酸相关中间体。"}]}],"synonyms":["aconitate-related","of aconitic acid"],"phonetic":"/ˌæ.kəˈnɪt.ɪk/","extraExplanation":["“aconitic”是非常专业的形容词，多出现在化学/生物化学论文中；日常英语里几乎不用。","词根关联：来自“aconite（乌头，一类植物）”+ 形容词后缀“-ic（……的）”。乌头植物在文化上常被提及为有毒植物，因此在阅读时不要把“aconitic”误解为“有毒的”，它更准确地指“与乌头酸有关”。","在生物化学里，你可能会看到“cis-aconitic acid / trans-aconitic acid（顺/反乌头酸）”“aconitate（乌头酸盐/乌头酸根）”等相关术语。"]}
{"word":"aconitin","summary":{"en":"Aconitin (more commonly spelled aconitine) is a very poisonous chemical from aconite (monkshood) plants.","zh":"aconitin（更常见拼写为 aconitine）指来自乌头属（僧帽花）植物的剧毒化学物质——乌头碱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a highly poisonous alkaloid found in plants of the aconite (monkshood) family, formerly used in very small doses in medicine but now mainly known as a dangerous toxin","zh":"一种剧毒生物碱，存在于乌头属（又称“僧帽花/乌头”）植物中；过去曾在极小剂量下用于医药，但如今主要被认为是危险毒物"},"examples":[{"en":"Aconitine is extremely toxic, even in very small amounts.","zh":"乌头碱毒性极强，即使剂量很小也可能致命。"},{"en":"The lab report detected aconitine in the plant extract.","zh":"实验室报告在植物提取物中检测到了乌头碱。"}]}],"synonyms":["aconitine","monkshood toxin","aconite alkaloid"],"phonetic":"/əˈkɑnəˌtin/","extraExplanation":["“aconitin”常见为“aconitine”的另一种拼写或简写形式；中文常译作“乌头碱”。它主要来源于乌头属植物（如 monkshood / wolfsbane），在文学与民间传说中常被描写为致命毒药，但现实中接触或误食同样非常危险。"]}
{"word":"aconitine","summary":{"en":"Aconitine is a highly poisonous alkaloid from aconite (monkshood) plants.","zh":"aconitine 指乌头属（兜帽草）植物中的剧毒生物碱“乌头碱”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very poisonous chemical (an alkaloid) found in the aconite/monkshood plant, especially Aconitum species; it affects the nerves and heart and can be fatal if swallowed or absorbed.","zh":"乌头碱；一种存在于乌头属（如附子、乌头/兜帽草）植物中的剧毒生物碱，会影响神经与心脏，误食或经皮吸收都可能致命。"},"examples":[{"en":"Aconitine is one of the main toxins in monkshood.","zh":"乌头碱是兜帽草（乌头属）中的主要毒素之一。"},{"en":"Even tiny amounts of aconitine can cause numbness and dangerous heart rhythms.","zh":"即使极微量的乌头碱也可能引起麻木和危险的心律失常。"},{"en":"The report suspected aconitine poisoning after the patient drank a homemade herbal brew.","zh":"报告在患者饮用自制草药汤后，怀疑为乌头碱中毒。"}]}],"synonyms":["aconite toxin","monkshood toxin","Aconitum alkaloid"],"phonetic":"/əˈkɑːnɪˌtiːn/","extraExplanation":["“Aconitine”常出现在医学与法医学语境中，用于描述乌头类植物中毒。乌头在部分传统药材中会经过炮制以降低毒性，但自行采集、浸泡或随意加量非常危险。","日常英语里更常见的相关词是“aconite”或“monkshood”（植物名）；“aconitine”更偏向“具体毒性成分/化学物质”的说法。"]}
{"word":"Aconitum","summary":{"en":"Aconitum refers to a highly poisonous flowering plant (monkshood/wolfsbane) or, less commonly, the toxic extract made from it.","zh":"Aconitum 指毒性极强的乌头属开花植物（兜帽草/狼毒草），较少情况下也指由其制成的有毒提取物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants (also called monkshood or wolfsbane), known for hood-shaped purple/blue flowers and extreme toxicity","zh":"乌头属植物（又称“兜帽草/修士帽”、或“狼毒草”），以兜帽状的紫蓝色花朵著称，但具有极强毒性"},"examples":[{"en":"Aconitum is beautiful, but it is one of the most poisonous garden plants.","zh":"乌头属植物很美，但它是花园里毒性最强的植物之一。"},{"en":"The label warned: do not touch aconitum without gloves.","zh":"标签警告：不要在不戴手套的情况下接触乌头属植物。"}]},{"partOfSpeech":"n.","definition":{"en":"a toxic drug or extract made from these plants (aconite), historically used in small doses but dangerous and not used casually","zh":"由乌头属植物制成的有毒药物或提取物（乌头碱类/“aconite”），历史上曾在极小剂量下入药，但危险性高，不可随意使用"},"examples":[{"en":"In older texts, aconitum appears as a risky remedy for pain.","zh":"在较早的文献中，Aconitum 常被提到是一种风险很高的止痛“药方”。"},{"en":"Modern medicine treats aconitum poisoning as a medical emergency.","zh":"现代医学将乌头类中毒视为医疗急症。"}]}],"synonyms":["monkshood","wolfsbane","aconite"],"phonetic":"/əˈkɑːnɪtəm/","extraExplanation":["词源与文化：Aconitum 来自拉丁语，进一步可追溯到希腊语 akóniton。西方文学与民间传说里常把它和“毒药”联系在一起，常见别名 wolfsbane（传说可毒杀或驱赶狼）与 monkshood（花形像修士的兜帽）。","安全提示：乌头属植物的根、叶、花都可能含强烈神经与心脏毒性成分；即使皮肤接触也可能有风险。园艺或野外辨认时，避免触摸与误食，尤其要远离儿童与宠物。"]}
{"word":"aconitum","summary":{"en":"Aconitum is a genus of very poisonous flowering plants (monkshood/wolfsbane), and it can also refer to a poison made from them.","zh":"aconitum 指剧毒的乌头属开花植物（monkshood/wolfsbane），也可指由其制成的毒物/药物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a poisonous flowering plant (a genus) with hood-shaped purple or blue flowers; also called monkshood or wolfsbane","zh":"乌头属植物（有毒的开花植物），花多为紫蓝色、像兜帽；也叫“附子花 / 狼毒草 / 修士兜帽花”"},"examples":[{"en":"The garden guide warned that aconitum is beautiful but highly poisonous.","zh":"园艺指南提醒说，乌头很漂亮，但毒性很强。"},{"en":"In late summer, aconitum often blooms with deep purple flowers.","zh":"夏末时节，乌头常开出深紫色的花。"}]},{"partOfSpeech":"n.","definition":{"en":"a poison or drug made from aconitum (also called aconite), historically used in medicine but dangerous if misused","zh":"由乌头制成的毒物或药物（也称 aconite，乌头碱相关制剂）；历史上用于药用，但误用极其危险"},"examples":[{"en":"In old texts, aconitum appears as a risky remedy for pain.","zh":"在一些古老文献中，乌头被写作止痛的高风险药物。"},{"en":"Modern medicine treats aconitum as a dangerous toxin rather than a home remedy.","zh":"现代医学更把乌头视为危险毒素，而非居家用药。"}]}],"synonyms":["monkshood","wolfsbane","aconite"],"phonetic":"ˌækəˈnaɪtəm","extraExplanation":["“Aconitum”常出现在文学或哥特式叙事中，作为“美丽却致命”的象征（花形像兜帽，外观优雅但全株含剧毒）。","园艺语境里它是观赏植物，但因对人和宠物都有危险，英语资料常建议戴手套、避免误食，并远离儿童与动物。","相关常见别名：monkshood（修士兜帽花）来自花形像修士的头巾；wolfsbane（狼毒草）源于民间传说与狩猎用毒的联想。"]}
{"word":"aconitums","summary":{"en":"Aconitums are very poisonous plants (plural of aconitum).","zh":"aconitums 指乌头属的多株植物（aconitum 的复数），毒性很强。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of aconitum: a type of very poisonous flowering plant (also called monkshood or wolfsbane).","zh":"aconitum 的复数：一种毒性很强的开花植物（也叫“乌头/附子”“monkshood（僧帽花）”或“wolfsbane（狼毒）”）。"},"examples":[{"en":"The garden guide warns that aconitums are highly toxic if touched or eaten.","zh":"园艺指南警告说，乌头（aconitums）如果接触或误食会有很强毒性。"},{"en":"She avoided planting aconitums where children or pets might play.","zh":"她避免把乌头种在孩子或宠物可能玩耍的地方。"}]}],"synonyms":["monkshoods","wolfsbanes"],"phonetic":"/əˈkɑnɪtəmz/","extraExplanation":["“Aconitum（乌头属）”在西方文化中常与“毒药”意象相关，古希腊与中世纪传说里常被写成制作毒药或致命药剂的材料；英语别名“wolfsbane（狼毒）”也带有民间传说色彩。园艺语境中常见，但现实中应强调其强毒性与安全处理（戴手套、远离儿童宠物等）。"]}
{"word":"acontia","summary":{"en":"Acontia are the stinging defensive threads released by some sea anemones.","zh":"Acontia 指某些海葵会释放的带刺细胞的丝状防御结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In sea anemones, long threadlike defensive organs filled with stinging cells, expelled to protect the animal or capture prey.","zh":"（海葵等刺胞动物的）刺丝／触手丝状防御器官，含有刺细胞，可喷出用来防御或捕食。"},"examples":[{"en":"When the sea anemone was disturbed, it released acontia for defense.","zh":"海葵受到惊扰时，会释放刺丝（acontia）来自我防御。"},{"en":"Researchers observed acontia extending from the anemone’s body during an attack.","zh":"研究人员观察到海葵在攻击时从身体伸出刺丝（acontia）。"}]}],"synonyms":["stinging filaments","defensive threads"],"phonetic":"/əˈkɑntiə/","extraExplanation":["“Acontia”常见于海洋生物学语境，指海葵体内的丝状结构，表面或内部带有大量刺细胞（cnidocytes），可发射刺丝囊（nematocysts）产生刺痛与黏附效果，用于驱赶捕食者或压制猎物。","词源来自希腊语，原意与“投掷的飞镖/箭”相关，用来比喻这种能“射出”的防御结构。"]}
{"word":"Acontias","summary":{"en":"Acontias is the scientific genus name for mostly limbless skinks native to southern Africa.","zh":"Acontias 是非洲南部常见的、以无肢或肢体退化为特征的石龙子属（学名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of mostly limbless or very small‑limbed skinks (lizards) found mainly in southern Africa","zh":"（蜥蜴）石龙子科的一属，多为无肢或四肢极度退化的“蛇形蜥蜴”，主要分布在非洲南部"},"examples":[{"en":"Acontias species often look like small snakes because their legs are reduced or absent.","zh":"Acontias 属的物种常常看起来像小蛇，因为它们的四肢退化或消失。"},{"en":"Researchers recorded an Acontias skink moving through loose sand and leaf litter.","zh":"研究人员记录到一只 Acontias 石龙子在松散的沙土和落叶层中穿行。"}]}],"synonyms":["acontias skink","skink (general term)"],"phonetic":"/əˈkɑːntiəs/","extraExplanation":["“Acontias”是拉丁化的学名（属名），写作首字母大写并用斜体（Acontias）。它在分类学中常用于指代这一整属的石龙子，而日常英语里更常说“skink（石龙子）”或更具体的物种名。","词源常被认为与希腊语词根有关，含义与“无刺/无尖”（a- 表否定）及“矛/尖端”等概念相关；不过对学习者而言，更实用的是把它当作“某属蛇形石龙子”的学名来记忆。"]}
{"word":"acontias","summary":{"en":"Acontias most commonly refers to a nearly legless burrowing skink (genus *Acontias*); in older literary use, it can mean a javelin or dart.","zh":"Acontias 最常指蠕蜥属（Acontias）近乎无足、穴居的石龙子类蜥蜴；在较古老的文学用法中也可指标枪或飞矛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, burrowing, nearly or completely legless lizard (a skink) of the genus *Acontias*, found mainly in southern Africa.","zh":"（南部非洲常见的）蠕蜥属（Acontias）小型穴居蜥蜴，身体细长，四肢极短或几乎没有。"},"examples":[{"en":"Scientists recorded an *Acontias* species living in sandy soil and leaf litter.","zh":"科学家记录到一种蠕蜥属（Acontias）动物生活在沙土和落叶层中。"},{"en":"Because it is legless, an acontias is sometimes mistaken for a snake.","zh":"因为几乎没有四肢，acontias 有时会被误认为是蛇。"}]},{"partOfSpeech":"n.","definition":{"en":"(literary/archaic) a javelin; a light spear or dart.","zh":"（文学/古用）标枪；轻矛；投掷用短矛。"},"examples":[{"en":"In old-style writing, warriors may be described as throwing an acontias.","zh":"在较古典的写法里，战士可能会被描写为投掷 acontias（标枪）。"},{"en":"The poem compares sharp words to an acontias aimed at the heart.","zh":"诗歌把尖刻的话比作瞄准心口的 acontias（飞矛）。"}]}],"synonyms":["legless skink","skink","legless lizard","javelin","dart","spear"],"phonetic":"/əˈkɑːntiəs/","extraExplanation":["词源上与古希腊语 *akontion*（投枪、飞矛）相关，所以它既可指“标枪/飞矛”（较古老的文学用法），也被用作动物学上的属名 *Acontias*（蠕蜥属）。","动物学语境里常写作首字母大写 *Acontias*（属名）；日常英文更常直接说 “legless skink”（无足石龙子/无足蜥蜴）或用具体物种名。"]}
{"word":"acontium","summary":{"en":"A rare noun meaning either a light javelin (old/literary) or a sea anemone’s stinging defensive filament (zoology).","zh":"一个罕见名词：可指（旧/文学）轻矛、标枪；也可指（动物学）海葵的刺细胞防御丝（常见复数 acontia）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Literary/old use) A light javelin or dart.","zh":"（文学/旧用法）轻矛；标枪；飞镖。"},"examples":[{"en":"In the epic, the warrior hurled an acontium across the field.","zh":"在史诗里，战士把一支轻矛掷过战场。"},{"en":"The hunter carried a short spear—an acontium—for quick throws.","zh":"猎人带着一支短矛（轻矛）用来快速投掷。"}]},{"partOfSpeech":"n.","definition":{"en":"(Zoology) A threadlike defensive filament in some sea anemones, loaded with stinging cells (often seen in the plural: acontia).","zh":"（动物学）某些海葵体内可外翻的丝状防御结构，带有刺细胞（常用复数 acontia）。"},"examples":[{"en":"When threatened, the sea anemone expelled acontia (acontium in the singular).","zh":"受到威胁时，这只海葵喷出了防御丝（单数可说 acontium，常见复数 acontia）。"},{"en":"The lab notes described an acontium containing many stinging cells.","zh":"实验记录描述了一条含有大量刺细胞的防御丝。"}]}],"synonyms":["dart","javelin","spear (light)","acontia (plural, zoology)"],"phonetic":"/əˈkɑn.ti.əm/","extraExplanation":["这个词非常少见，常见的其实是复数形式 **acontia**（海葵的防御丝）。","词源可追溯到希腊语 *akontion*，意为“标枪/短矛”，因此在文学或古风语境里也会用来指“轻矛”。"]}
{"word":"Acontius","summary":{"en":"Acontius is a figure from Greek mythology known for binding Cydippe to marry him through a cleverly spoken written vow.","zh":"Acontius（阿孔提俄斯）是希腊神话人物，以用巧妙的书面誓言让西狄佩被约束并最终与他成婚而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, a young man who cleverly wins the promise of marriage from Cydippe by having her read a written vow aloud to Artemis.","zh":"（希腊神话中）阿孔提俄斯：一位青年，巧妙地让西狄佩在阿耳忒弥斯神前朗读写好的誓言，从而使她被誓言约束并最终与他成婚。"},"examples":[{"en":"Acontius appears in Ovid’s writings as a lover who relies on a written oath rather than force.","zh":"在奥维德的作品中，阿孔提俄斯是一个依靠“书面誓言”而不是武力的恋人。"},{"en":"The story of Acontius and Cydippe is often discussed as an early example of love, language, and persuasion.","zh":"“阿孔提俄斯与西狄佩”的故事常被用来讨论爱情、语言与劝诱之间的关系。"}]}],"phonetic":"əˈkɑːntiəs","extraExplanation":["发音提示：重音通常在第二个音节（-con-）附近，读起来接近“uh-KON-tee-us”。","文化与文学背景：这个故事最有名的版本见于古罗马诗人奥维德（Ovid）的相关作品（常被提到与《女杰书信集 Heroides》传统有关），主题涉及“誓言的力量”、宗教语境中的承诺、以及语言/文字如何影响命运。","相关人物：Cydippe（西狄佩）是故事中的女主角；Artemis（阿耳忒弥斯）是誓言发生的神祇背景。"]}
{"word":"acontius","summary":{"en":"Acontius is a figure in Greek myth who wins Cydippe by having her unknowingly speak a marriage vow written on an apple.","zh":"Acontius（阿孔提俄斯）是希腊神话人物，他通过让克狄珀无意间念出写在苹果上的婚誓而赢得她。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A young man in Greek myth who cleverly won the love of Cydippe by writing a vow on an apple, leading her to marry him.","zh":"希腊神话中的青年男子：他把誓言写在苹果上，巧妙地让克狄珀（Cydippe）当众念出并因此立誓，最终与他成婚。"},"examples":[{"en":"In Greek mythology, Acontius tricks Cydippe into making a vow by reading words written on an apple.","zh":"在希腊神话中，阿孔提俄斯用写在苹果上的话诱使克狄珀念出誓言，从而让她立誓。"},{"en":"The story of Acontius and Cydippe appears in ancient Greek poetry.","zh":"阿孔提俄斯与克狄珀的故事见于古希腊诗歌。"}]}],"synonyms":["Akonios"],"phonetic":"/əˈkɑːntiəs/","extraExplanation":["“Acontius（阿孔提俄斯）与 Cydippe（克狄珀）”的故事最著名的版本常与希腊诗人卡利马科斯（Callimachus）相关：阿孔提俄斯在苹果上写下誓词，让克狄珀在神庙中不知情地朗读，从而在神明面前“说出口就算数”。","这个故事常被用来讨论：语言的力量、誓言的约束力，以及爱情故事里“机智/计谋”与“同意”之间的张力。"]}
{"word":"aconuresis","summary":{"en":"A rare medical term meaning (near) total absence of urination.","zh":"一个较少见的医学词，表示（几乎）完全无尿/不能排尿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical, rare) A complete or nearly complete absence of urination; failure to pass urine.","zh":"（医学用语，较少见）无尿/几乎无尿；不能排尿。"},"examples":[{"en":"After the surgery, the nurse monitored the patient closely for signs of aconuresis.","zh":"手术后，护士密切观察病人是否出现无尿（aconuresis）的迹象。"},{"en":"Severe dehydration can lead to aconuresis if it is not treated promptly.","zh":"严重脱水如果不及时治疗，可能导致无尿（aconuresis）。"}]}],"synonyms":["anuria","suppression of urine","urinary suppression"],"phonetic":"/ˌækəˈnʊrəsɪs/","extraExplanation":["这个词非常少见，临床上更常用的是 anuria（无尿）或 urinary retention（尿潴留，尿在膀胱里但排不出来）。aconuresis 通常被当作“无尿/不排尿”的旧式或罕见表达。","注意不要和 enuresis（遗尿、尿床）混淆：enuresis 是“不该尿的时候尿了”，而 aconuresis/anuria 是“该排尿却几乎没有尿”。"]}
{"word":"acool","summary":{"en":"“Cool” commonly means “nice/impressive” (informal), “not warm,” “calm,” or “to become/make less hot.” “acool” is likely a misspelling of “a cool …” or “cool.”","zh":"“cool”常见意思包括：很棒/很酷（非正式）、凉爽/不热、冷静，以及（使）冷却。“acool”多半是把 “a cool …” 连写或把 “cool” 拼错了。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended) “cool”: good, nice, or impressive (informal).","zh":"（可能想写）cool：很棒的、不错的、很酷的（非正式）"},"examples":[{"en":"That’s a cool idea.","zh":"那是个很棒的主意。"},{"en":"Your jacket looks cool.","zh":"你的夹克看起来很酷。"}]},{"partOfSpeech":"v.","definition":{"en":"“cool”: to become less hot; to make something less hot.","zh":"cool：（使）变凉；（使）冷却"},"examples":[{"en":"Let the soup cool for a few minutes.","zh":"让汤放几分钟变凉。"},{"en":"Open the window to cool the room.","zh":"开窗让房间凉快些。"}]},{"partOfSpeech":"adj.","definition":{"en":"“cool”: calm and not showing strong emotion.","zh":"cool：冷静的，不轻易表露情绪的"},"examples":[{"en":"She stayed cool under pressure.","zh":"在压力下她仍保持冷静。"}]},{"partOfSpeech":"adj.","definition":{"en":"“cool”: slightly cold; not warm.","zh":"cool：凉爽的；微冷的"},"examples":[{"en":"It’s cool outside tonight.","zh":"今晚外面有点凉。"}]}],"synonyms":["nice","awesome","great","chill","calm","cold"],"phonetic":"/kuːl/","extraExplanation":["“acool”本身不是常见英文单词，很多时候是把 “a cool …” 连在一起写（比如打字或网名）。更自然的写法是分开写：a cool + 名词（a cool movie / a cool place）。如果你想表达“行/好啊”，常用的是单独的 “Cool.” 或 “Sounds cool.”"]}
{"word":"acop","summary":{"en":"“a cop” means a police officer (informal).","zh":"“a cop”表示“警察/警官”（非正式说法）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Usually written as “a cop”) a police officer (informal).","zh":"（通常写作“a cop”）警察；警官（非正式）"},"examples":[{"en":"There’s a cop outside the station directing traffic.","zh":"车站外有一名警察在指挥交通。"},{"en":"If you’re lost, ask a cop for help.","zh":"如果你迷路了，可以向警察求助。"},{"en":"In the movie, the cop questions the suspect.","zh":"在电影里，警察审问嫌疑人。"}]}],"synonyms":["police officer","officer","policeman","policewoman"],"phonetic":"ə ˈkɑp","extraExplanation":["“acop”本身不是常见英文单词；更常见的是你想输入“a cop”（中间有空格）。其中 cop 是“police officer”的口语说法，语气较随意；正式写作更推荐用 “police officer / officer”。","大写“ACOP”有时会作为缩写出现在特定机构/职位名称里（不同国家或行业含义不同），例如某些地方可能指“Assistant Chief of Police（助理警察局长）”等；需要结合上下文才能确定。"]}
{"word":"acopic","summary":{"en":"Acopic means “pain-relieving” (a rare medical word).","zh":"Acopic 的意思是“止痛的”（较少见的医学词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical, uncommon) Relieving pain; painkilling; having an analgesic effect.","zh":"（医学用语，较少见）止痛的；具有镇痛作用的。"},"examples":[{"en":"The doctor prescribed an acopic drug to reduce the patient’s postoperative pain.","zh":"医生开了止痛药来减轻患者术后疼痛。"},{"en":"Some herbs were traditionally believed to have acopic properties.","zh":"一些草药在传统上被认为具有止痛作用。"}]}],"synonyms":["analgesic","pain-relieving","painkilling"],"phonetic":"/əˈkɑpɪk/","extraExplanation":["“acopic”在现代日常英语中非常罕见，更常用的词是“analgesic”（镇痛的/止痛药）或“pain-relieving”。在医学写作里偶尔会出现，但不算常见标准术语。","词源上一般解释为来自希腊语构词：前缀 a-（不、无）+（与痛苦/受苦相关的词根），整体含义指“使疼痛减轻/不痛的”。"]}
{"word":"acopon","summary":{"en":"“acopon” isn’t an English word; it likely means “coupon” (a discount ticket/code).","zh":"“acopon”不是英语单词；很可能是“coupon（优惠券/优惠码）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “coupon” (or the spoken phrase “a coupon”).","zh":"不是标准英语单词。很可能是 “coupon”（或口语里的 “a coupon”）的拼写错误。"},"examples":[{"en":"I think you meant “coupon”—do you have a coupon code?","zh":"我猜你想写的是 “coupon”——你有优惠码吗？"},{"en":"With a coupon, you can get a discount at checkout.","zh":"使用优惠券，你在结账时可以打折。"}]},{"partOfSpeech":"n.","definition":{"en":"coupon: a ticket or code that gives you a discount when you buy something.","zh":"coupon：优惠券；用于购买时享受折扣的票券或代码。"},"examples":[{"en":"This store accepts digital coupons.","zh":"这家店接受电子优惠券。"},{"en":"She used a coupon to save five dollars.","zh":"她用了一张优惠券省了五美元。"},{"en":"Enter the coupon code before you pay.","zh":"付款前输入优惠码。"}]}],"synonyms":["voucher","discount code","promo code"],"phonetic":"/ˈkuːpɑn/","extraExplanation":["“coupon”在美式英语中常见读音是 /ˈkuːpɑn/（也有人读作 /ˈkjuːpɑn/）。你写的“acopon”很像口语里连读的 “a coupon”。如果你告诉我使用场景（例如购物、游戏、名字等），我也可以帮你确认是否是别的词。"]}
{"word":"acopyrin","summary":{"en":"A brand name for aspirin (a pain-reliever/fever reducer).","zh":"阿司匹林的商品名（止痛、退烧）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Acopyrin (capitalized) is a brand name for aspirin (acetylsalicylic acid), a medicine used to reduce pain, fever, and inflammation.","zh":"Acopyrin（常大写）是阿司匹林（乙酰水杨酸）的商品名，用于缓解疼痛、退烧并减轻炎症。"},"examples":[{"en":"She took Acopyrin for a headache.","zh":"她头痛时吃了 Acopyrin（阿司匹林）。"},{"en":"The pharmacist said Acopyrin contains aspirin, so he shouldn’t take it with certain blood thinners.","zh":"药剂师说 Acopyrin 含阿司匹林，所以他不应与某些抗凝药同服。"}]}],"synonyms":["aspirin","acetylsalicylic acid","ASA"],"phonetic":"/ˌækəˈpaɪrɪn/","extraExplanation":["Acopyrin 多见于中欧/东欧一些国家作为“阿司匹林”的商品名；在美国更常见的说法是 aspirin。","阿司匹林可能刺激胃、增加出血风险；对阿司匹林过敏、胃溃疡或正在服用抗凝药的人应先咨询医生/药师。"]}
{"word":"acopyrine","summary":{"en":"Acopyrine is a brand-name painkiller/fever reducer, often referring to aspirin in some places.","zh":"Acopyrine 是一种止痛退烧药的商品名，在一些地方常指阿司匹林。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand name for a pain reliever and fever reducer, often referring to aspirin (acetylsalicylic acid) in some countries","zh":"一种止痛退烧药的商品名；在一些国家常用来指阿司匹林（乙酰水杨酸）"},"examples":[{"en":"She took Acopyrine for a headache.","zh":"她头痛时吃了 Acopyrine。"},{"en":"The pharmacist explained that Acopyrine is similar to aspirin.","zh":"药剂师解释说 Acopyrine 和阿司匹林类似。"}]}],"synonyms":["aspirin","acetylsalicylic acid"],"phonetic":"/ˌækoʊˈpaɪrin/","extraExplanation":["“Acopyrine”通常是药品商品名，不同国家/时期的配方可能不同（有时可能与阿司匹林或类似的水杨酸类止痛药相关）。如果你是在看说明书或旧文本，最好对照其成分（active ingredient）确认。","此类药物可能有禁忌与副作用（例如对阿司匹林过敏、胃溃疡、正在服用抗凝药等人群需谨慎）。如需用药建议，应咨询医生或药师。"]}
{"word":"acor","summary":{"en":"“acor” is usually a typo for “acorn,” the nut (seed) of an oak tree.","zh":"“acor”通常是把“acorn（橡子）”拼错了，指橡树的果实/种子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Often a misspelling) an acorn: the nut (seed) of an oak tree.","zh":"（常见拼写错误）acorn：橡树的果实/种子（橡子）。"},"examples":[{"en":"Squirrels collect acorns to store for winter.","zh":"松鼠会收集橡子储存过冬。"},{"en":"An oak tree grows from a small acorn.","zh":"一棵橡树从一颗小小的橡子长成。"}]}],"synonyms":["oak nut","seed (of an oak)"],"phonetic":"/ˈeɪkɔrn/","extraExplanation":["“acor”在英语里通常不是标准单词；最常见情况是把“acorn（橡子）”少写了字母 n。","如果你是在某个特定领域（例如公司名、项目名、缩写）里看到 ACOR/acor，请告诉我上下文句子，我可以按缩写或专有名词再解释。"]}
{"word":"acorden","summary":{"en":"“acorden” is most likely a misspelling of “accordion,” a bellows-driven musical instrument.","zh":"“acorden”很可能是“accordion（手风琴）”的拼写错误。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A portable musical instrument with a keyboard or buttons and a bellows, played by squeezing and expanding it.","zh":"一种便携式乐器（手风琴），有键盘或按钮和风箱，通过拉伸与挤压风箱来演奏。"},"examples":[{"en":"My grandfather played the accordion at family parties.","zh":"我爷爷在家庭聚会上会拉手风琴。"},{"en":"The street musician’s accordion filled the square with lively music.","zh":"街头音乐家的手风琴让广场充满了欢快的旋律。"}]}],"synonyms":["squeeze box","button accordion","piano accordion"],"phonetic":"/əˈkɔrdiən/","extraExplanation":["“acorden”不是常见的标准英语拼写，最可能是把“accordion（手风琴）”拼错了。","也有人会把“according（根据……；按照……）”误拼成类似形式；如果你想查的是“according to”，可以告诉我我再为你整理。"]}
{"word":"acorder","summary":{"en":"“Acorder” is not a standard English word; you may mean “recorder,” which can be a recording device, a musical instrument (the recorder), or a person who records information.","zh":"“acorder”不是标准英文单词；你可能想写的是“recorder”，可指录音/录像设备、竖笛，或负责记录的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device or machine that records sound, video, or information","zh":"录音/录像/记录设备；记录仪"},"examples":[{"en":"The journalist used a recorder to capture the interview.","zh":"记者用录音设备记录采访内容。"},{"en":"The car’s flight recorder stored key data before the crash.","zh":"车辆的“黑匣子”在事故前保存了关键数据。"}]},{"partOfSpeech":"n.","definition":{"en":"a simple woodwind musical instrument often used in school music classes","zh":"竖笛（常见于学校音乐课的一种木管乐器）"},"examples":[{"en":"She learned to play the recorder in fourth grade.","zh":"她在四年级学会了吹竖笛。"},{"en":"The melody sounds clear on the recorder.","zh":"这段旋律用竖笛吹起来很清亮。"}]},{"partOfSpeech":"n.","definition":{"en":"a person whose job is to write down official decisions, results, or events","zh":"记录员；书记员"},"examples":[{"en":"The meeting recorder noted every decision and action item.","zh":"会议记录员记下了每一项决定和待办事项。"}]}],"synonyms":["recording device","voice recorder","tape recorder","scribe","note-taker"],"phonetic":"/rɪˈkɔrdɚ/","extraExplanation":["“acorder”本身不是常见的标准英文拼写。你可能想写的是 recorder（录音设备/竖笛/记录员）。如果你想表达手风琴，正确拼写是 accordion；如果你想表达“记录”这个动词，则是 record（名词/动词都可）。"]}
{"word":"acorea","summary":{"en":"“acorea” is not a common English word; it’s likely a typo or a proper name.","zh":"“acorea”不是常见英语词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is most often a misspelling or a proper name (e.g., a brand, username, or place name).","zh":"不是常见英语词典里的标准词；更常见的是拼写错误或专有名词（如品牌名、用户名、地名等）。"},"examples":[{"en":"I couldn’t find a definition for “acorea” in an English dictionary—did you mean “Korea” or “acquire”?","zh":"我在英语词典里查不到“acorea”的释义——你是不是想写“Korea（韩国/朝鲜）”或“acquire（获得）”？"},{"en":"“Acorea” might be a proper name, so its meaning depends on the specific context.","zh":"“Acorea”可能是专有名词，所以它的含义要看具体语境。"}]}],"phonetic":"/əˈkɔriə/","extraExplanation":["“acorea”很可能是拼写误差。你可以告诉我：\n1）它出现在哪个句子/段落里；\n2）你想表达的语言（英语/西语/葡语等）；\n3）是否可能是“Korea / acorn / acquire / area / core”等词的误拼。\n我就能给出准确释义与用法。"]}
{"word":"acoria","summary":{"en":"Acoria is a rare medical term meaning an inability to feel full after eating.","zh":"Acoria 是较少见的医学词，指吃东西后无法产生饱腹感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical, rare) The inability to feel full after eating; a lack of satiety.","zh":"（医学用语，较少见）进食后无法产生饱腹感；缺乏饱足感。"},"examples":[{"en":"The doctor noted signs of acoria, so they checked for hormonal and metabolic causes.","zh":"医生记录了可能的进食不饱（acoria）表现，因此检查了激素和代谢方面的原因。"},{"en":"Even after a large meal, she still felt hungry—an experience sometimes described as acoria in medical writing.","zh":"即使吃了很多，她仍然觉得饿——在医学写作中这种体验有时会被称为 acoria（缺乏饱腹感）。"}]}],"synonyms":["insatiability","lack of satiety","persistent hunger"],"phonetic":"/əˈkɔriə/","extraExplanation":["acoria 主要出现在医学或学术语境中，日常英语更常说：“never feel full / can’t feel full / always hungry”。","词源来自希腊语：a-（“无、不”）+ koros（“满足、饱足”），整体意思就是“没有饱足感”。","容易与专有名词（例如公司名、产品名或人名）混淆；如果你是在特定文本里看到 Acoria（首字母大写），也可能并非这个医学词。"]}
{"word":"acorn","summary":{"en":"An acorn is the nut of an oak tree.","zh":"acorn 指“橡子”，也就是橡树的果实（坚果）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the nut (seed) of an oak tree, usually with a hard shell and a cap; eaten by some animals and sometimes used as food by people after processing","zh":"橡子；橡树的果实（种子），外壳坚硬，常带“帽状”的壳斗；常被动物食用，人类也可在处理后食用"},"examples":[{"en":"A squirrel carried an acorn up the oak tree.","zh":"一只松鼠把一颗橡子叼上了橡树。"},{"en":"In autumn, the ground was covered with fallen acorns.","zh":"秋天时，地上铺满了掉落的橡子。"}]}],"synonyms":["oak nut"],"phonetic":"/ˈeɪ.kɔrn/","extraExplanation":["在英美文化里，acorn 常象征“潜力与成长”：一颗小小的橡子能长成参天橡树，因此常用于比喻“从微小起点发展成大成就”。","词源上，acorn 来自古英语，原意与“橡树的果实”相关；现代英语中也常出现在童话、自然描写和环保主题的文章里。"]}
{"word":"acorn-bearing","summary":{"en":"Acorn-bearing describes an oak or branch that produces or carries acorns.","zh":"acorn-bearing 指（橡树或树枝）结橡实的、长橡实的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Producing or carrying acorns (the nuts of an oak tree).","zh":"结橡实的；长（或带）橡实的（橡树的果实）。"},"examples":[{"en":"In autumn, the acorn-bearing oaks attract many squirrels.","zh":"秋天，结橡实的橡树会吸引很多松鼠。"},{"en":"The acorn-bearing branches were heavy after a good growing season.","zh":"在生长季很好的一年后，结橡实的树枝显得很沉。"}]}],"synonyms":["acorn-producing","acorn-laden","fruit-bearing (broader)"],"phonetic":"/ˈeɪ.kɔrn ˌbɛrɪŋ/","extraExplanation":["“acorn-bearing”是由名词 acorn（橡实）+ bearing（承载/生长……的）构成的复合形容词，常用于自然描写、园艺与生态语境。","在文学或描写性写作中，它常用来营造季节感（尤其是秋季）和生态画面，例如与 squirrels（松鼠）、deer（鹿）、woodland（林地）等词搭配。","类似结构的形容词还有 fruit-bearing（结果的）、seed-bearing（结籽的）、flower-bearing（开花的）。"]}
{"word":"acorn-laden","summary":{"en":"“Acorn-laden” describes something that is full of acorns, especially trees or ground in autumn.","zh":"“acorn-laden”指“橡子很多、挂满或遍布橡子”，常用于描写秋天的自然景象。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Full of acorns; carrying or covered with many acorns (often describing branches, trees, or the ground).","zh":"长满橡子/挂满橡子的；遍布橡子的（常形容树枝、橡树或地面）。"},"examples":[{"en":"In autumn, the oak branches became acorn-laden and bent under their own weight.","zh":"到了秋天，橡树枝挂满橡子，重得都弯了下去。"},{"en":"Squirrels raced across the acorn-laden ground, storing food for winter.","zh":"松鼠在遍布橡子的地面上飞奔，为冬天储存食物。"},{"en":"We followed a quiet trail through an acorn-laden grove.","zh":"我们沿着一条安静的小径穿过一片橡子遍地的小树林。"}]}],"synonyms":["acorn-covered","acorn-filled","laden with acorns","thick with acorns"],"phonetic":"/ˈeɪ.kɔrn ˌleɪ.dən/","extraExplanation":["这是一个复合形容词：acorn（橡子）+ laden（装满的、满载的）。在文学或描写性写作里很常见，用来营造季节感（尤其是秋天）和自然景象。","laden 比 full 更有“负重、沉甸甸”的画面感，因此 acorn-laden 往往暗示“多到压弯枝条/铺满地面”。","类似结构：flower-laden（花满枝头）、snow-laden（积雪覆盖的）、fruit-laden（果实累累）。"]}
{"word":"acorn-producing","summary":{"en":"“Acorn-producing” means producing acorns, usually describing oak trees or related species.","zh":"“acorn-producing”指“结橡子的”，常用来形容橡树或相关树种。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Describing a tree or plant) producing acorns (the nuts of oak trees).","zh":"（形容树或植物）结橡子的；产橡子的。"},"examples":[{"en":"Acorn-producing oak trees are important food sources for wildlife.","zh":"结橡子的橡树是野生动物重要的食物来源。"},{"en":"The park protects several acorn-producing species that support local birds.","zh":"这个公园保护了几种结橡子的树种，为当地鸟类提供食物。"}]}],"synonyms":["acorn-bearing","mast-producing"],"phonetic":"/ˈeɪkɔrn prəˈdusɪŋ/","extraExplanation":["“acorn-producing”通常是复合形容词（acorn + producing），多见于生态学、林业或自然写作中，用来强调一种树“会结果（橡子）”，常与“oak（橡树）”“tree species（树种）”“mast years（大年/丰年，指坚果等大量结实的年份）”等词一起出现。"]}
{"word":"acorn-shaped","summary":{"en":"Acorn-shaped means shaped like an acorn (rounded with a slightly pointed or narrower end).","zh":"acorn-shaped 指“橡子形的”，外形像橡子（通常一端圆、另一端略尖或更窄）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape of an acorn (the nut of an oak tree): rounded at one end and often narrowing toward the other.","zh":"橡子形的；形状像橡子（橡树的果实）的：一端圆钝、另一端常逐渐变窄。"},"examples":[{"en":"The handle has an acorn-shaped knob for a better grip.","zh":"把手上有一个橡子形的旋钮，握起来更稳。"},{"en":"She wore acorn-shaped earrings made of silver.","zh":"她戴着一对银制的橡子形耳环。"},{"en":"An acorn-shaped cap covers the top of the bottle.","zh":"瓶口上有一个橡子形的盖子。"}]}],"synonyms":["acornlike","oval (often, depending on shape)","egg-shaped (sometimes)"],"phonetic":"/ˈeɪkɔrn ʃeɪpt/","extraExplanation":["“acorn-shaped”是由名词acorn（橡子）+ shaped（……形的）组成的复合形容词，常用于描述物体外观（如装饰、把手、帽盖、灯罩等）。","橡子在英美文化中常象征“成长潜力/从小到大”（小小橡子长成大橡树），因此“acorn-shaped”的物件有时也带一点自然、复古或乡村风格的联想。"]}
{"word":"acorn-worm","summary":{"en":"An acorn-worm is a small marine worm-like animal that lives in sand or mud and has an acorn-shaped front part.","zh":"acorn-worm 指生活在沙泥中的海生橡实蠕虫，前端形状有点像橡子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small marine animal (a type of worm) that lives in sand or mud and is related to starfish; it has a front part shaped a bit like an acorn.","zh":"橡实蠕虫（海生小动物的一类，生活在沙泥中，与海星等棘皮动物有亲缘关系；身体前端有点像橡子）。"},"examples":[{"en":"Scientists found acorn-worms burrowing under the sand near the reef.","zh":"科学家在珊瑚礁附近的沙下发现了会钻洞的橡实蠕虫。"},{"en":"An acorn-worm uses its proboscis to move through mud and collect food.","zh":"橡实蠕虫用它的吻部在泥里移动并收集食物。"}]}],"synonyms":["acorn worm","enteropneust"],"phonetic":"/ˈeɪkɔrn wɝm/","extraExplanation":["“acorn-worm”也常写作“acorn worm”。中文里常译为“橡实蠕虫”。","它属于半索动物门（Hemichordata），很多入门材料会提到它在研究动物进化（尤其是脊索动物起源相关问题）时很有参考价值。","不要把它和“earthworm（蚯蚓）”混淆：橡实蠕虫是海生动物，生活环境、身体结构和分类都不同。"]}
{"word":"acorned","summary":{"en":"Acorned means “having acorns” (especially of oak trees/branches), and can also mean “decorated with acorns” in literary or design contexts.","zh":"acorned 意为“结着橡果的”（多指橡树/树枝），也可指“以橡果作装饰或带橡果图案的”（文学或设计语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an oak tree or oak branch) bearing acorns; having acorns.","zh":"（指橡树或橡树枝）结着橡果的；有橡果的。"},"examples":[{"en":"In early autumn, the acorned oak trees attract squirrels and birds.","zh":"初秋时，结着橡果的橡树会吸引松鼠和鸟类。"},{"en":"They gathered fallen leaves beneath an acorned branch.","zh":"他们在一根结着橡果的树枝下捡落叶。"}]},{"partOfSpeech":"adj.","definition":{"en":"(heraldry/literary) decorated with or featuring acorns (as a symbol or design).","zh":"（纹章/文学用法）以橡果作装饰的；带有橡果图案的（常作象征）。"},"examples":[{"en":"The gate was topped with acorned finials.","zh":"大门顶部装有橡果形的尖饰。"},{"en":"In the novel, the old staff is described as acorned, a sign of forest authority.","zh":"小说里那根老手杖被描写为带橡果饰，象征森林般的权威。"}]}],"synonyms":["acorn-bearing","acorn-laden","oak-fruited","ornamented with acorns"],"phonetic":"/ˈeɪkɔrnd/","extraExplanation":["“acorned”来自名词“acorn（橡果）”，加上形容词后缀“-ed”，表示“带有/长着/装饰着……的”。常见于描写自然景物（橡树结实）或装饰元素（橡果形饰件）。","橡果在英语文化里常象征“潜力、成长与坚韧”（小小的种子能长成大树），因此文学或装饰中出现“acorned”有时带一点象征意味。"]}
{"word":"acorns","summary":{"en":"Acorns are the nuts (seeds) of oak trees.","zh":"Acorns 指橡树的果实（橡子）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the small nut (seed) of an oak tree, usually with a cap; it can grow into a new oak tree","zh":"橡子；橡树的果实（种子），通常带有“帽状”的壳斗；可发芽长成新的橡树"},"examples":[{"en":"Squirrels collect acorns in the fall and hide them for winter.","zh":"松鼠会在秋天收集橡子，并把它们藏起来留到冬天吃。"},{"en":"The ground was covered with acorns after the storm.","zh":"暴风雨过后，地上满是橡子。"}]}],"synonyms":["oak nut"],"phonetic":"/ˈeɪkɔrn/","extraExplanation":["“acorn”通常作可数名词；单数是 acorn，复数是 acorns。","在文化与文学里，acorn 常象征“从小到大/潜力/成长”（常见表达：Mighty oaks from little acorns grow. 意为“参天橡树也始于小小橡子”，类似中文“千里之行，始于足下”。）","acorn 也可以指“橡子形状”的东西（如 acorn squash 橡子南瓜；acorn-shaped 灯泡等）。"]}
{"word":"Acorus","summary":{"en":"Acorus is a genus of wetland plants (sweet flag) known for sword-like leaves and sometimes aromatic rhizomes.","zh":"Acorus 指菖蒲属湿地植物（如甜菖蒲/香菖蒲），以剑形叶与部分种类芳香根茎而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of wetland plants (e.g., sweet flag) with long, sword-shaped leaves, often growing in marshes or along water edges; some species have aromatic roots used in traditional medicine or perfumery","zh":"菖蒲属（水生或湿地植物属，如“菖蒲/香蒲根菖蒲”），叶片细长如剑，常生于沼泽或水边；部分种类的根茎带香气，传统上用于药用或香料"},"examples":[{"en":"Acorus often grows along riverbanks and in shallow marshes.","zh":"菖蒲属植物常生长在河岸和浅沼泽里。"},{"en":"In some traditions, the aromatic rhizome of Acorus is used to make herbal preparations.","zh":"在一些传统中，菖蒲属植物带香气的根茎会用来制作草药制剂。"},{"en":"The garden pond is bordered with Acorus for its tall, grassy leaves.","zh":"花园池塘边种了菖蒲属植物，因其高而像草的叶子很有观赏性。"}]}],"synonyms":["sweet flag","calamus"],"phonetic":"/ˈækərəs/","extraExplanation":["“Acorus”是拉丁化的植物学属名，常见英文俗名包括 sweet flag（甜菖蒲/香菖蒲）与 calamus（菖蒲；也可指“菖蒲根茎”的香料或药材）。","在英语文章中它多出现在园艺、生态（湿地植物）、或药用植物语境中；如果写作要更具体，可用“the genus Acorus”或直接指某个物种（如 Acorus calamus）。","注意：不同地区对“菖蒲/菖蒲根茎”的传统用法与安全规范可能不同；阅读资料时可留意其是否指观赏栽培、香料用途或药用研究。"]}
{"word":"acosmic","summary":{"en":"Acosmic means “not cosmic” or, in some philosophical/religious contexts, “beyond the cosmos.”","zh":"acosmic 指“非宇宙的”，在某些哲学/宗教语境中也可指“超越宇宙的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not related to the universe (the cosmos); not cosmic.","zh":"与宇宙（cosmos）无关的；非宇宙性的。"},"examples":[{"en":"The essay focuses on human ethics in an almost acosmic way, without discussing our place in the universe.","zh":"这篇文章几乎以一种“非宇宙性”的方式讨论人类伦理，没有谈到我们在宇宙中的位置。"},{"en":"Her paintings feel intentionally acosmic—no stars, no galaxies, just everyday rooms.","zh":"她的画作刻意呈现出“非宇宙性”：没有星星、没有银河，只有日常的房间。"}]},{"partOfSpeech":"adj.","definition":{"en":"In philosophy or religion: transcending the physical universe, or treating the cosmos as ultimately unimportant compared with a higher reality.","zh":"（哲学/宗教）超越物质宇宙的；认为宇宙本身并非终极重要、相对于更高实在而次要的。"},"examples":[{"en":"Some mystical traditions describe an acosmic view in which the world is secondary to the absolute.","zh":"一些神秘主义传统描述一种“超宇宙/非宇宙”的观点：世界相对于“绝对者”是次要的。"},{"en":"The philosopher argued for a more acosmic understanding of ultimate truth.","zh":"这位哲学家主张以更“超越宇宙”的方式来理解终极真理。"}]}],"synonyms":["noncosmic","unworldly","otherworldly","transcendent"],"phonetic":"/eɪˈkɑːzmɪk/","extraExplanation":["“a-”是否定前缀，表示“无/非”；“cosmic”指“宇宙的”。因此 acosmic 字面意思就是“非宇宙的”。","这个词较少用于日常英语，更常见于哲学、宗教学、神秘主义或文学评论中，用来描述一种把“宇宙/世界”降为次要、强调“绝对/超越者”的立场或语气。"]}
{"word":"acosmism","summary":{"en":"Acosmism is the view that the world is not ultimately real, especially compared with God or an Absolute reality.","zh":"唯宇宙否定论指认为世界不具最终真实，尤其是与上帝或“绝对实在”相比时。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A philosophical view that denies the ultimate reality of the world (the cosmos), treating it as illusory, dependent, or insignificant compared with an absolute (often God or the Absolute).","zh":"一种哲学观点：否认世界（宇宙）具有最终的真实存在，认为世界是幻象、依附性的，或与“绝对者”（常指上帝或绝对精神）相比并不真实/不重要。"},"examples":[{"en":"In some readings of idealism, acosmism suggests that only the Absolute is truly real.","zh":"在某些对唯心主义的解读中，唯宇宙否定论认为只有“绝对者”才是真正实在的。"},{"en":"The essay compares pantheism and acosmism in discussions of God and the world.","zh":"这篇文章在谈论上帝与世界时，对比了泛神论与唯宇宙否定论。"},{"en":"Critics argued that his metaphysics sounded like acosmism because it downgraded the reality of nature.","zh":"批评者认为他的形而上学听起来像唯宇宙否定论，因为它降低了自然界的真实地位。"}]}],"synonyms":["illusionism (in metaphysical contexts)","absolute idealism (related)","monism (related)"],"phonetic":"/ˌeɪˈkɑːz.mɪz.əm/","extraExplanation":["“acosmism”由 a-（否定）+ cosmos（宇宙、世界）+ -ism（主义）构成，字面含义接近“否认宇宙/世界的实在性”。","它常出现在西方哲学史关于斯宾诺莎（Spinoza）与黑格尔（Hegel）等思想的争论中：有些批评者用“acosmism”指责某些体系把世界看成只是神/绝对者的“表象”或“派生物”，从而让世界不再具有独立真实。","注意区分：acosmism 通常不是简单的“宇宙不存在”，而是强调“相对的世界不具最终实在性”；在宗教或形而上学语境里，常与“绝对一元论”或某些神秘主义式的世界观有关。"]}
{"word":"acosmist","summary":{"en":"An acosmist is someone who believes the cosmos is not ultimately real, often because only an absolute reality is truly real.","zh":"acosmist 指认为宇宙/世界在终极意义上并不真实的人，常见于强调只有“绝对实在”才真正存在的哲学观点中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who holds the philosophical view that the universe (the cosmos) is not ultimately real, or that only the absolute (such as God or ultimate reality) is truly real.","zh":"“否定宇宙真实存在者”；指持一种哲学观点的人，认为宇宙（万物/世界）在终极意义上并不真实，或认为只有“绝对者”（如上帝/终极实在）才是真实的。"},"examples":[{"en":"Some critics called him an acosmist because he treated the world as a mere appearance of the absolute.","zh":"一些批评者称他为“否定宇宙真实存在者”，因为他把世界看作绝对者的表象。"},{"en":"In a seminar on metaphysics, the professor contrasted the realist with the acosmist.","zh":"在一场形而上学研讨课上，教授把实在论者与“否定宇宙真实存在者”作了对比。"}]}],"synonyms":["acosmism adherent","idealist (in some contexts)","non-realist (philosophical)"],"phonetic":"/əˈkɑzmɪst/","extraExplanation":["“Acosmist”来自“acosmism（否定宇宙/世界的终极实在性）”。它通常不是日常用词，而多见于哲学史或宗教哲学讨论中。","它并不一定等同于“无神论者（atheist）”。相反，某些“acosmist”会强调只有“上帝/绝对者/梵（Brahman）”才是真实的，而经验世界只是幻象或次级真实。","在西方语境里，该词有时与对斯宾诺莎（Spinoza）或黑格尔（Hegel）体系的解读有关：把有限世界看作依赖于唯一实体或绝对精神的“非独立实在”。在印度哲学的某些解读中，也可与“世界如幻（maya）”的观念作类比，但两者并非完全等同。"]}
{"word":"acosmistic","summary":{"en":"Acosmistic means believing or suggesting that the universe has no independent reality (often seen as a manifestation of an absolute like God or mind).","zh":"acosmistic 指一种认为宇宙/世界不具独立实在性（常被视为绝对者如上帝或心灵的显现）的哲学观点。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Philosophy) Relating to or expressing the view that the world/universe (the “cosmos”) does not have independent reality, often seen as ultimately unreal or only a manifestation of something absolute (such as God or mind).","zh":"（哲学）指“否认宇宙/世界（cosmos）具有独立实在性”的观点；常认为世界最终并非真实存在，或只是某种绝对者（如上帝、心灵）的显现。"},"examples":[{"en":"Some scholars describe certain mystical traditions as acosmistic because they treat the visible world as less real than the divine.","zh":"一些学者把某些神秘主义传统称为“acosmistic（否认世界独立实在）”，因为它们认为可见世界不如神圣者真实。"},{"en":"In an acosmistic reading of Spinoza, the universe is not separate from God but a mode of God’s substance.","zh":"在对斯宾诺莎的一种“acosmistic”解读中，宇宙并不独立于上帝，而是上帝实体的一个样态。"},{"en":"The essay contrasts acosmistic philosophy with ordinary realism about the physical world.","zh":"这篇文章把“acosmistic”的哲学立场与关于物质世界的日常实在论作对比。"}]}],"synonyms":["acosmic","world-denying","nonrealist (about the world)"],"phonetic":"ˌeɪkɑzˈmɪstɪk","extraExplanation":["词源上，a- 表示“否定/无”，cosmos 表示“宇宙/世界”，-istic 表示“……的”。因此它字面意思接近“否宇宙的/否世界的”。","它常出现在宗教哲学与形而上学讨论中，尤其与“acosmism（否世界论）”相关；有些研究者用它来讨论斯宾诺莎或某些唯心/神秘传统中“世界并非最终实在”的看法。日常英语里很少用，多见于学术写作。"]}
{"word":"acost","summary":{"en":"“Acost” is an uncommon/old word meaning “alongside,” and it is sometimes a rare spelling/variant of “accost.”","zh":"“acost”是少见的旧用法，常指“并排/在旁边”，有时也被当作“accost”的罕见变体写法。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Archaic, nautical) alongside; side by side; close beside.","zh":"（古义/航海用语）在旁边；并排；靠近在……旁。"},"examples":[{"en":"The smaller boat came acost with the ship.","zh":"那艘小船靠到大船旁边并排前进。"},{"en":"In the old logbook, it says the vessels sailed acost at dawn.","zh":"在旧航海日志里写着，两艘船在黎明时并排行驶。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare) to approach and speak to someone, especially in a challenging or sudden way (a less common form of “accost”).","zh":"（罕见）上前搭话（尤指突然或带有质问意味地）；相当于“accost”的少见写法。"},"examples":[{"en":"He was acosted by a stranger on the street.","zh":"他在街上被一个陌生人突然上前搭话。"}]}],"synonyms":["alongside","beside","abreast","near"],"phonetic":"/əˈkɔst/","extraExplanation":["“acost”在现代英语里非常少见，更多见于旧文本或航海语境，表示“并排/靠在旁边”。日常写作中通常用“alongside / beside”。","很多学习者想查的其实是“accost”（上前搭话/拦住质问）或短语“at a cost”（以某种代价）。可以根据你的句子语境判断需要哪一个。"]}
{"word":"Acosta","summary":{"en":"Acosta is most commonly a surname of Spanish/Portuguese origin; it can also be a place name.","zh":"Acosta 最常见是西/葡语来源的姓氏；也可用作地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Spanish- or Portuguese-origin family name (surname).","zh":"（常见于西班牙语或葡萄牙语地区的）姓氏“Acosta”。"},"examples":[{"en":"My coworker’s last name is Acosta.","zh":"我同事的姓是 Acosta。"},{"en":"In the interview, Ms. Acosta explained her research clearly.","zh":"在采访中，Acosta 女士把她的研究讲得很清楚。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name (used for some towns/communities), especially in the United States.","zh":"地名（用于一些城镇/社区名称），尤其在美国。"},"examples":[{"en":"They drove through Acosta on their way to the mountains.","zh":"他们去山区的路上开车经过了 Acosta。"},{"en":"Acosta appears on the map as a small community.","zh":"地图上标着 Acosta 是一个小社区。"}]}],"synonyms":["(surname) Costa","(surname) Da Costa"],"phonetic":"/əˈkɔstə/","extraExplanation":["“Acosta”通常被认为与西班牙语/葡萄牙语中的“costa（海岸）”有关，历史上常见的来源是“da Costa / de la costa”（意为“来自海岸/靠海的人”），后来在英语语境中常直接写作 Acosta，读音也更英文化。","在英语新闻语境里，你可能会见到记者 Jim Acosta（CNN）等公众人物的姓氏；作为姓氏时一般不翻译，只音译或直接保留拼写。"]}
{"word":"acotyledon","summary":{"en":"An acotyledon is a plant with no cotyledons (seed leaves); the word is also used adjectivally to mean “without cotyledons.”","zh":"acotyledon 指“无子叶植物”，也可作形容词表示“无子叶的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant that has no cotyledons (seed leaves), especially in older botanical classification referring to non-seed plants like ferns and mosses.","zh":"无子叶植物；没有子叶（种子叶）的植物。在较旧的植物分类中常指蕨类、苔藓等非种子植物。"},"examples":[{"en":"In older textbooks, ferns were sometimes grouped as acotyledons because they do not produce seeds with cotyledons.","zh":"在一些较旧的教材里，蕨类有时被归为无子叶植物，因为它们不产生带子叶的种子。"},{"en":"Mosses are often discussed with other acotyledons when comparing plant reproduction.","zh":"在比较植物繁殖方式时，苔藓常与其他无子叶植物一起讨论。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective use) having no cotyledons (seed leaves).","zh":"（形容词用法）无子叶的；没有子叶（种子叶）的。"},"examples":[{"en":"The term was used to describe acotyledon plants in historical classification systems.","zh":"在历史上的分类体系中，这个词被用来描述无子叶的植物。"}]}],"synonyms":["acotyledonous","non-seed plant","cryptogam (older/technical)"],"phonetic":"/ˌeɪkoʊkaɪˈliːd(ə)n/","extraExplanation":["“acotyledon”由前缀 a-（表示“无、缺少”）+ cotyledon（子叶）构成。现代植物学更常用“acotyledonous（无子叶的）”作形容词，也更倾向用“non-seed plants（非种子植物）”“cryptogams（隐花植物）”等更符合当代分类与进化关系的说法。"]}
{"word":"acotyledonous","summary":{"en":"Acotyledonous means “without cotyledons (seed leaves),” often used in botany for plants that don’t form seed leaves.","zh":"acotyledonous 意为“无子叶的（没有种子叶）”，常用于植物学中指不形成子叶的植物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having no cotyledons (seed leaves) in the embryo; not producing seed leaves.","zh":"（植物学）无子叶的；胚中没有子叶（种子叶），不产生子叶。"},"examples":[{"en":"Many ferns are described as acotyledonous because they reproduce by spores rather than seeds.","zh":"许多蕨类常被描述为无子叶的，因为它们通过孢子而不是种子繁殖。"},{"en":"In older textbooks, acotyledonous plants were contrasted with monocotyledonous and dicotyledonous plants.","zh":"在较旧的教材里，无子叶植物常与单子叶植物和双子叶植物作对比。"}]}],"synonyms":["without cotyledons","seedless (context-dependent)"],"phonetic":"/ˌeɪkɑːtəˈlɪdənəs/","extraExplanation":["“cotyledon”指“子叶/胚叶”，是种子胚中最早的叶状结构，用来储存或吸收营养并在幼苗早期提供能量；“a-”是否定前缀，表示“没有”。","“acotyledonous”多见于较传统或历史性的植物分类语境（如把植物分为无子叶、单子叶、双子叶）；现代分类更常用“seedless plants（无种子植物）/spore-bearing plants（孢子植物）”等表述，视语境而定。"]}
{"word":"acouasm","summary":{"en":"Acousma means hearing a sound when there is no real external sound source (an auditory hallucination).","zh":"Acousma 指在没有真实外界声源时听到声音，即听觉幻觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sound heard when no external sound is actually present; an auditory hallucination (sometimes used loosely for “phantom sounds”).","zh":"在没有外界声源时却听到的声音；听觉幻觉（有时也被宽泛地用来指“幻听/虚幻的声音”）。"},"examples":[{"en":"Some people with severe stress report acousma, such as hearing their name called when no one is there.","zh":"有些人在压力很大时会出现 acousma，比如明明没人却听到有人叫自己的名字。"},{"en":"The doctor asked whether the patient’s ringing was tinnitus or acousma related to medication.","zh":"医生询问病人的耳鸣是单纯的 tinnitus（耳鸣），还是与药物有关的 acousma（幻听）。"}]}],"synonyms":["auditory hallucination","phantom sound"],"phonetic":"/əˈkuːzmə/","extraExplanation":["你输入的 **acouasm** 并不是常见英文单词；最接近、在词典中能查到的形式通常是 **acousma**（名词）。","相关词：**acousmatic**（形容词）指“只听到声音、看不到声源的”，常用于音乐与电影声音设计语境（例如“屏幕外的声音/不可见声源”）。","注意区分：**tinnitus（耳鸣）** 往往指持续的嗡鸣/铃声等感觉，常与耳部生理因素相关；**acousma** 更偏向“听到并不存在的声音”（也可能与心理、药物、神经因素有关）。如涉及健康问题，应咨询专业医生。"]}
{"word":"acouchi","summary":{"en":"An acouchi is a small South American rodent related to the agouti.","zh":"acouchi 指一种南美洲的小型啮齿动物，与刺豚鼠（agouti）近缘。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small South American rodent (genus Myoprocta), related to the agouti, with a slender body and short tail; sometimes kept in zoos or studied in ecology.","zh":"（南美洲的）刺豚鼠属小型啮齿动物（Myoprocta），与刺豚鼠（agouti）近缘，体型较瘦、尾巴短；有时在动物园或生态研究中出现。"},"examples":[{"en":"The zoo’s acouchi stayed near the ground, darting between rocks and leaves.","zh":"动物园里的 acouchi 总在地面活动，在岩石和落叶间快速穿梭。"},{"en":"Researchers observed an acouchi carrying fruit seeds into the forest understory.","zh":"研究人员观察到一只 acouchi 把果实的种子带到森林下层。"}]}],"synonyms":["acouchy","(related) agouti"],"phonetic":"/əˈkuːtʃi/","extraExplanation":["“acouchi”是比较少见的动物名称，主要用于自然纪录片、动物园说明牌或学术语境。","它常被拿来和更常见的“agouti（刺豚鼠）”比较：两者都是南美啮齿动物，外形相近，但acouchi通常更小、更纤细。","词源常被认为来自南美原住民语言（如图皮-瓜拉尼语族）对当地动物的称呼，后来进入欧洲语言与英语。"]}
{"word":"acouchy","summary":{"en":"“acouchy” isn’t a standard English word; it’s probably meant to be “cushy” (comfortable, easy, or well-paid/advantageous).","zh":"“acouchy”不是标准英语单词；很可能想表达的是“cushy”（舒适的、轻松的，或待遇优厚/有优势的）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Likely a misspelling of “cushy”: comfortable and easy; requiring little effort.","zh":"很可能是“cushy”的拼写错误：舒适的；轻松的、不费力的。"},"examples":[{"en":"After years of hard work, she finally got a cushy office job.","zh":"辛苦工作多年后，她终于找到了一个轻松的办公室工作。"},{"en":"The hotel bed was so cushy that I fell asleep right away.","zh":"酒店的床很柔软舒服，我马上就睡着了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Likely a misspelling of “cushy”: (of a job or situation) offering good benefits or advantages.","zh":"很可能是“cushy”的拼写错误：（工作或处境）待遇好、有很多好处的。"},"examples":[{"en":"He landed a cushy position with great pay and flexible hours.","zh":"他找到了一份待遇很好、工时灵活的职位。"},{"en":"They live a cushy life compared with most people.","zh":"和大多数人相比，他们的生活很优渥。"}]}],"synonyms":["comfortable","easy","soft","plush","well-paid"],"phonetic":"/ˈkʊʃi/","extraExplanation":["“acouchy”并不是常见的英语单词。在口语或聊天中，人们最可能想写的是“cushy”（舒服的/轻松的）。","“cushy”常用来形容“轻松的工作”（a cushy job），有时带一点点“太安逸、令人羡慕甚至不太公平”的语气，具体取决于上下文。"]}
{"word":"acoumeter","summary":{"en":"An acoumeter is an instrument for measuring hearing (often an older term for an audiometer).","zh":"acoumeter 指测量听力的仪器，属于较旧用法，常用 audiometer（测听仪）替代。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device used to measure hearing ability or sound intensity (an older or less common term; often replaced by “audiometer”).","zh":"测听仪；测量听力或声音强度的仪器（较旧或不常用的说法，常用 a​udiometer 代替）。"},"examples":[{"en":"The clinic used an acoumeter to check whether the patient could hear soft tones.","zh":"诊所用测听仪检查病人是否能听到很轻的音。"},{"en":"In older medical texts, “acoumeter” appears as a tool for testing hearing.","zh":"在较早的医学文献中，“acoumeter”常被写作用于测量听力的工具。"}]}],"synonyms":["audiometer","hearing meter"],"phonetic":"/əˈkuːmɪtɚ/","extraExplanation":["“acoumeter”由表示“听觉/声音”的词根 acou-（同 acoustic）和表示“测量”的 -meter 组成。现代英语里更常见、更标准的术语是 “audiometer”（测听仪/听力计）。如果你在学习医学或听力学材料，建议优先记 “audiometer”，并把 “acoumeter”当作历史或旧用法来认识。"]}
{"word":"acoumetry","summary":{"en":"Acoumetry means measuring how well someone can hear, usually in a medical setting.","zh":"Acoumetry 指在医学语境中对听力（听觉敏锐度）进行测量/评估。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the measurement of hearing ability (hearing acuity), especially by clinical tests or instruments such as an audiometer/acuometer","zh":"（尤指通过临床测试或仪器）对听力能力/听觉敏锐度的测量；听力测定"},"examples":[{"en":"The ENT specialist used acoumetry to compare hearing sensitivity in the patient’s two ears.","zh":"耳鼻喉科医生用听力测定来比较患者左右耳的听觉敏感度。"},{"en":"Basic bedside acoumetry can include simple voice and tuning-fork tests before formal audiometry.","zh":"在进行正式听力计检查之前，基础的床旁听力测定可能包括简单的语音测试和音叉测试。"}]}],"synonyms":["audiometry","hearing test","hearing assessment"],"phonetic":"/əˈkuːmətri/","extraExplanation":["“acoumetry”较少见，更常见的相关词是“audiometry”（听力计测定）。“acoumetry”通常偏向早期/较传统的说法，指用简单方法或仪器评估听力。","词源上与希腊语“akouein”（听见）相关，常用于医学语境（ENT/听力学）。"]}
{"word":"acounter","summary":{"en":"“acounter” is rare/nonstandard; it usually means “accountant,” but most people write and say “accountant.”","zh":"“acounter”较罕见/不规范；通常指“会计”，但日常更常用更标准的是“accountant”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A person who keeps or checks financial accounts; an accountant.","zh":"（罕用）记账或核对账目的人；会计。"},"examples":[{"en":"In older texts, an accounter was responsible for keeping the company’s books.","zh":"在较早的文本中，accounter 负责记录公司的账簿。"},{"en":"Today we usually say “accountant,” not “accounter.”","zh":"如今通常说“accountant”，而不是“accounter”。"}]}],"synonyms":["accountant","bookkeeper"],"phonetic":"/əˈkaʊntər/","extraExplanation":["“acounter”通常被视为拼写错误或不常见写法；更常见、标准的词是 **accountant**（会计）。","如果你想表达“柜台/计数器/反驳者”，标准拼写是 **counter**；而“a counter”表示“一个柜台/一个计数器”等。你可以告诉我你想表达哪个意思，我可以给对应的释义和例句。"]}
{"word":"acouometer","summary":{"en":"A rare word for a device used to test hearing; today, “audiometer” is more common.","zh":"一个较少见的词，指测听力的仪器；现代更常用 a u d i o m e t e r（听力计）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) An instrument used to test or measure hearing ability (hearing acuity).","zh":"（罕见）测听力/测听觉敏锐度的仪器。"},"examples":[{"en":"The clinic used an acuometer to check basic hearing acuity before a full audiogram.","zh":"诊所先用测听力仪做基础听力敏锐度检查，然后再做完整的听力图检查。"},{"en":"Early researchers compared different acuometers to standardize hearing tests.","zh":"早期研究者比较了不同的测听力仪，以便让听力测试更标准化。"}]}],"synonyms":["acuometer","audiometer","hearing meter"],"phonetic":"/ˌækjuˈɑːmɪtər/","extraExplanation":["“acouometer”多被视为“acuometer”的少见拼写变体；现代医学与听力学里更常用的词是“audiometer（听力计）”。","词源上与拉丁语“acuo-（使敏锐）”和“-meter（测量器）”有关，强调“测量听觉敏锐度”。"]}
{"word":"acouophobia","summary":{"en":"Acouophobia is a strong fear of loud sounds or hearing, especially sudden noises.","zh":"Acouophobia 指对巨响或听到声音（尤其突然噪音）的强烈恐惧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An intense, persistent fear of loud sounds or of hearing (especially sudden noises).","zh":"对巨响或“听到声音”（尤其是突然的噪音）的强烈且持续的恐惧。"},"examples":[{"en":"After the accident, she developed acouophobia and avoided fireworks.","zh":"事故之后，她出现了惧声症，开始躲避烟花爆竹。"},{"en":"His acouophobia made crowded, noisy places feel unsafe.","zh":"他的惧声症让人多嘈杂的地方显得不安全。"}]}],"synonyms":["fear of loud noises","phonophobia"],"phonetic":"/ˌækuːəˈfoʊbiə/","extraExplanation":["这个词在日常英语中不算常见，更常见的说法是“fear of loud noises”（害怕巨响）。在较正式或医学/心理语境中可能会看到 acouophobia。","词源上由希腊语构词：akou-（听、听觉）+ -phobia（恐惧）。","它与“hyperacusis（听觉过敏/对声音异常敏感，偏生理）”不同：acouophobia 偏向心理上的恐惧反应，但两者有时可能同时出现。"]}
{"word":"acouophonia","summary":{"en":"A rare term for extreme sensitivity or intolerance to sound.","zh":"一个罕见词，指对声音极度敏感或难以忍受。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) Abnormal sensitivity or intolerance to sound; hearing that feels painfully loud or overwhelming (often used similarly to “hyperacusis” or sometimes “phonophobia”).","zh":"（罕见用语）对声音异常敏感或难以忍受；声音听起来过于响、甚至会引起不适或疼痛（常近似于 hyperacusis“听觉过敏”，有时也会被混用为 phonophobia“恐声症”）。"},"examples":[{"en":"Because of acouophonia, everyday noises like dishes clinking felt unbearable.","zh":"由于 acouophonia，像碗碟碰撞这种日常声音都让他难以忍受。"},{"en":"She wore earplugs in busy places to manage her acouophonia.","zh":"她在人多嘈杂的地方戴耳塞来应对 acouophonia。"}]}],"synonyms":["hyperacusis","phonophobia","acouophobia"],"phonetic":"/ˌækuoʊˈfoʊniə/","extraExplanation":["这个词在现代英语中非常少见，很多词典不收录；你可能想写的是 **acouophobia/phonophobia**（对声音或噪音的恐惧）或 **hyperacusis**（医学上更常用：对声音过度敏感）。如果你告诉我你看到它的语境（文章/医学报告/社媒），我可以帮你判断更准确的含义。"]}
{"word":"acoup","summary":{"en":"“Coup” most commonly means a sudden takeover of government power; it can also mean an impressive success or masterstroke.","zh":"“coup”最常指“政变”；也可指“漂亮的一手/重大成功”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sudden, often illegal action to take control of a government (short for “coup d’état”)","zh":"（通常指）突然、往往非法的夺取政权行动；政变（“coup d’état”的简称）"},"examples":[{"en":"The military carried out a coup and took control of the capital.","zh":"军方发动政变并控制了首都。"},{"en":"After the coup, many people were afraid to speak openly.","zh":"政变后，很多人不敢公开讲话。"}]},{"partOfSpeech":"n.","definition":{"en":"a very successful or impressive action or achievement","zh":"妙招；漂亮的一手；重大成功（指令人印象深刻的行动或成就）"},"examples":[{"en":"Hiring her was a real coup for the company.","zh":"聘用她对公司来说是一步漂亮的棋。"},{"en":"It was a coup to get tickets for the sold-out show.","zh":"能买到那场售罄演出的票真是大成功。"}]}],"synonyms":["overthrow","takeover","putsch","masterstroke","triumph"],"phonetic":"/ku/","extraExplanation":["“coup”来自法语，字面有“打击/一击”的意思，所以既可指政治上的“一击夺权”，也可引申为“漂亮的一招”。","发音里字母 p 不发音：/ku/。常见搭配：a military coup（军事政变）；stage/carry out a coup（发动政变）。","更正式的说法是 coup d’état（法语：国家政变）。英语新闻里常直接用 coup。"]}
{"word":"acoupa","summary":{"en":"Acoupa usually refers to a South American edible fish (the acoupa weakfish); in some regions it can also be a local name for a tropical tree.","zh":"Acoupa 通常指南美洲一种可食用的海鱼（阿库帕石首鱼／弱石首鱼）；在部分地区也可作某些热带树的俗称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large edible marine fish found along the Atlantic coast of tropical South America, especially the acoupa weakfish (Cynoscion acoupa).","zh":"一种可食用的大型海鱼，分布于南美洲热带大西洋沿岸，尤指“阿库帕石首鱼／阿库帕弱石首鱼”（Cynoscion acoupa）。"},"examples":[{"en":"Acoupa is often sold fresh in coastal markets in northern Brazil.","zh":"在巴西北部沿海市场里，acoupa 常以鲜鱼出售。"},{"en":"The restaurant served grilled acoupa with lime and herbs.","zh":"这家餐厅端上了柠檬香草烤 acoupa。"}]},{"partOfSpeech":"n.","definition":{"en":"(regional) a tropical tree name used in parts of northern South America and the Caribbean; usage varies by country and may refer to different local species.","zh":"（地区用法）在南美北部与加勒比部分地区对某些热带树的俗称；各国用法不同，可能指代不同的本地树种。"},"examples":[{"en":"In some places, the name acoupa is used for a local hardwood tree.","zh":"在一些地区，人们把一种本地硬木树称为 acoupa。"}]}],"synonyms":["acoupa weakfish","weakfish","croaker"],"phonetic":"/əˈkuːpə/","extraExplanation":["“Acoupa”在英语里较少见，多出现在渔业、菜谱或拉丁美洲地区语境中；作为鱼名时通常特指学名 Cynoscion acoupa（石首鱼科），不同地区也可能把相近的石首鱼类混称为 acoupa。","作树名时更偏向地方俗名：如果你是在特定国家/岛屿看到这个词，最好结合当地语境或拉丁学名确认具体是哪一种树。"]}
{"word":"acoupe","summary":{"en":"“Coupe” most commonly means a two-door car; it can also mean a shallow stemmed champagne/cocktail glass, and in ballet it means a bent-knee position.","zh":"“coupe”最常见指“双门轿跑车”；也可指“浅口有脚的香槟/鸡尾酒杯”，在芭蕾中还可指“屈膝姿势”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Most likely) a two-door car, often styled as sporty or elegant.","zh":"（最常见用法）双门轿跑车；通常外形更运动或更优雅的两门汽车。"},"examples":[{"en":"She drives a red coupe to work.","zh":"她开一辆红色的双门轿跑车去上班。"},{"en":"They rented a small coupe for the weekend trip.","zh":"他们周末旅行租了一辆小型双门车。"}]},{"partOfSpeech":"n.","definition":{"en":"A shallow, stemmed glass used for champagne or cocktails (a “coupe glass”).","zh":"（杯具）浅口有脚的酒杯；常用于香槟或鸡尾酒（“香槟碟/浅口香槟杯”）。"},"examples":[{"en":"The bartender served the drink in a coupe glass.","zh":"调酒师用浅口香槟杯端上了这杯酒。"},{"en":"Classic cocktails are often poured into a coupe.","zh":"经典鸡尾酒常常会倒在这种浅口杯里。"}]},{"partOfSpeech":"n.","definition":{"en":"(Ballet) a position where the legs are bent by bending the knees.","zh":"（芭蕾）屈膝的姿势；通过弯曲膝盖让腿部下沉的动作。"},"examples":[{"en":"She moved smoothly into a deep coupé.","zh":"她流畅地进入了一个深屈膝动作。"}]}],"synonyms":["two-door (car)","sports coupe","coupe glass"],"phonetic":"/kuːp/","extraExplanation":["你输入的“acoupe”在英语里不算常见的单词拼写，更可能是把“a coupe”（一辆双门轿跑车）写在一起，或想查的是“coupe”。","“coupe”来自法语，英语中最常见的是“轿跑车”的意思；其次也常指香槟用的浅口有脚酒杯。"]}
{"word":"acousma","summary":{"en":"An acousma is a sound you can hear but can’t see the source of.","zh":"acousma 指“听得到但看不到声源”的声音。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sound that is heard but whose source is not seen or cannot be identified (often used in film, music, and philosophy).","zh":"一种“听得到但看不到来源”的声音；声音来源不可见或难以辨认（常用于电影、音乐与哲学语境）。"},"examples":[{"en":"In the dark hallway, the acousma of footsteps made everyone nervous.","zh":"在昏暗的走廊里，脚步声这种“无源可见”的声音让大家都紧张起来。"},{"en":"The director used an acousma—an off-screen scream—to build suspense.","zh":"导演用了一种“屏幕外的尖叫声”（acousma）来制造悬念。"}]}],"synonyms":["acousmatic sound","off-screen sound","disembodied sound","unseen-source sound"],"phonetic":"/əˈkuːzmə/","extraExplanation":["该词源自希腊语 akousma（“听到的东西/听觉对象”）。在电影与声音研究里，常与 acousmatic（“声源不可见的”）一起出现，指观众听到声音但看不到发声者或物体，从而产生神秘、紧张或想象空间。","在哲学与宗教史中，它也可指“口传的教诲/格言”（尤其与毕达哥拉斯学派相关），但现代英语里更常用的是“无可见声源的声音”这一义。"]}
{"word":"acousmas","summary":{"en":"“Acousma” means a sound you hear without seeing its source, often discussed in film and sound studies.","zh":"“Acousma”指听得到却看不到声源的声音，常用于电影与声音研究语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sound that is heard when you cannot see what is causing it (the source is hidden or off-screen)","zh":"只能听到、却看不到声源的声音（声源被遮挡或在画面外）"},"examples":[{"en":"In the dark hallway, every acousma made her nervous.","zh":"在昏暗的走廊里，每一个“无形之声”都让她紧张。"},{"en":"Film directors often use acousmas—like footsteps off-screen—to build suspense.","zh":"电影导演常用“画外音式的无形之声”（比如画面外的脚步声）来制造悬念。"},{"en":"The acousma of a distant siren told us something was happening downtown.","zh":"远处警笛的“无形之声”让我们知道市中心可能出事了。"}]}],"synonyms":["acousmatic sound","off-screen sound","unseen sound","disembodied sound"],"phonetic":"əˈkuːzmə","extraExplanation":["“acousma”常见于声音研究、电影理论与音乐（尤其是电子音乐）语境，强调“听得到但看不到来源”的听觉体验。","它与“acousmatic（听觉脱离声源可见性）”相关：常被用来讨论电影中“画外音/画外声”（off-screen sound）如何影响观众想象与情绪。","词源可追溯到希腊语相关词根，学术写作里有时会提到毕达哥拉斯学派传说：学生隔着帘子听老师讲课，只闻其声不见其人，以突出“声音与可见来源分离”的概念。","你输入的“acousmas”通常可理解为复数：acousmas = 多个看不见声源的声音。"]}
{"word":"acousmata","summary":{"en":"Acousmata are (1) sounds heard without seeing their source, and (2) in ancient philosophy, oral sayings learned by listening.","zh":"Acousmata 可指（1）看不见声源却听到的声音；也可指（2）古代哲学中通过聆听传授的格言/训诫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Sounds you hear without seeing their source; mysterious or “disembodied” sounds.","zh":"看不见声源却听到的声音；带有“脱离来源/神秘感”的声音。"},"examples":[{"en":"In the dark hallway, the footsteps became acousmata—sounds without a visible source.","zh":"在昏暗的走廊里，脚步声成了 acousmata——听得到却看不见来源的声音。"},{"en":"Some electronic music uses acousmata to make listeners imagine what is producing the sound.","zh":"有些电子音乐会利用 acousmata，让听众去想象声音是由什么产生的。"}]},{"partOfSpeech":"n.","definition":{"en":"In ancient Greek philosophy (especially the Pythagorean tradition), oral sayings or rules meant to be learned by listening rather than reading.","zh":"在古希腊哲学（尤其是毕达哥拉斯学派）中，指通过“聆听”传授的格言、训诫或规则。"},"examples":[{"en":"The students memorized the acousmata as practical rules for daily life.","zh":"学生们把这些 acousmata 当作日常生活的实践准则来背诵。"},{"en":"Some writers compare modern slogans to the acousmata of early philosophical schools.","zh":"有些作者把现代口号类比为早期哲学学派的 acousmata。"}]}],"synonyms":["acousmatic sounds","unseen-source sounds","disembodied sounds","oral teachings"],"phonetic":"/ˌaʊˈkuzmətə/","extraExplanation":["acousmata 是单数 acousma 的复数，源自希腊语 akousma（“被听到的东西”）。英语里多用于学术语境。","在音乐与声音研究中，常见相关词 acousmatic（“声源不可见的/与声源分离的”），法国作曲家皮埃尔·舍费尔（Pierre Schaeffer）在具体音乐（musique concrète）讨论中推广了这一概念。","在毕达哥拉斯学派传说中，学生有时只能在帘幕后听老师讲授，因此“以听为主”的训诫被称为 acousmata。"]}
{"word":"acousmatic","summary":{"en":"Acousmatic describes hearing a sound without seeing its source, especially in film, music, and sound art.","zh":"Acousmatic 指“听得到但看不到声源的声音/聆听方式”，常用于电影、音乐与声音艺术。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Describing a sound that is heard without seeing its source (so the listener cannot identify where or what it comes from just by looking).","zh":"（声音）指听得到但看不到声源的；只能听见、看不见来源的。"},"examples":[{"en":"In the dark hallway, the footsteps felt acousmatic and unsettling.","zh":"在昏暗的走廊里，脚步声成了“听得到却看不到来源”的声音，让人不安。"},{"en":"The film uses acousmatic voices before the speaker appears on screen.","zh":"这部电影在角色出镜前先用“不可见声源”的声音来制造悬念。"}]},{"partOfSpeech":"adj.","definition":{"en":"In music and sound art, referring to listening to recorded or electronic sound through speakers without seeing the performer or sound-making objects.","zh":"（音乐/声音艺术）指通过扬声器聆听录音或电子声音、而看不到演奏者或发声物体的（“纯听觉”式聆听）。"},"examples":[{"en":"Acousmatic music is often performed in a concert hall with loudspeakers instead of live instruments on stage.","zh":"“纯听觉音乐”（acousmatic music）常在音乐厅用扬声器播放，而不是舞台上有现场乐器演奏。"},{"en":"The composer created an acousmatic piece from everyday sounds like doors and trains.","zh":"作曲家用门声、火车声等日常声音创作了一首纯听觉作品。"}]}],"synonyms":["source-unseen","offscreen (voice/sound)","unseen-source","disembodied (voice)"],"phonetic":"/ˌækuːzˈmætɪk/","extraExplanation":["“acousmatic”常用于声音研究与电影叙事：当你听见声音却看不见声源时，注意力会更集中在音色、空间感与情绪暗示上，因而常被用来营造悬疑或压迫感。","词源与背景：来自希腊语概念（与“听觉教导”有关）。在20世纪的具体音乐（musique concrète）与声音艺术语境中，常与法国作曲家/理论家 Pierre Schaeffer 的“只听其声、不见其物”的聆听方式联系在一起。"]}
{"word":"acoustic","summary":{"en":"Acoustic means related to sound, or (especially in music) produced without electricity.","zh":"Acoustic 表示“与声音/声学有关的”，也常指（音乐中）“原声的、不插电的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to sound or to the way sound is heard, produced, or carried.","zh":"与声音有关的；关于声音的听觉、产生或传播方式的。"},"examples":[{"en":"The acoustic quality of the concert hall is excellent.","zh":"这座音乐厅的声学效果非常好。"},{"en":"We added curtains to improve the room’s acoustics.","zh":"我们加了窗帘来改善房间的声学效果。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made to produce sound without electricity, especially of musical instruments (for example, an acoustic guitar).","zh":"（乐器等）不用电发声的；原声的（例如原声吉他）。"},"examples":[{"en":"She prefers acoustic music to electronic beats.","zh":"她更喜欢原声音乐，而不是电子节拍。"},{"en":"He bought an acoustic guitar for traveling.","zh":"他买了一把原声吉他方便旅行携带。"}]}],"synonyms":["auditory","sound","unplugged"],"phonetic":"/əˈkuːstɪk/","extraExplanation":["“acoustic”来自“acoustics（声学）”。日常里常见两种用法：①讲“声学/声音效果”（acoustic quality/acoustic design）；②讲“原声、不插电”（acoustic guitar/acoustic set）。","注意搭配：说“声学效果”更常用名词“acoustics”（The acoustics are bad. 这儿的音响/声学效果不好），而“acoustic”多作形容词（acoustic treatment 声学处理）。"]}
{"word":"acoustic emission monitoring system","summary":{"en":"a sensor-based system for real-time detection of material damage via acoustic emission signals","zh":"通过声发射信号实时检测材料损伤的传感器监测系统"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A system that uses sensors to detect and analyze high-frequency stress waves (“acoustic emissions”) released by materials as they crack, deform, or experience damage, so the condition of a structure or machine can be monitored in real time.","zh":"一种利用传感器检测并分析材料在开裂、变形或受损时释放的高频应力波（“声发射”）的系统，用于对结构或设备进行实时状态监测。"},"examples":[{"en":"The bridge was equipped with an acoustic emission monitoring system to detect early signs of fatigue cracking.","zh":"这座桥安装了声发射监测系统，用于发现疲劳裂纹的早期迹象。"},{"en":"Engineers used an acoustic emission monitoring system during the pressure test to locate active leaks and crack growth.","zh":"工程师在压力测试期间使用声发射监测系统，以定位正在发生的泄漏和裂纹扩展。"},{"en":"Compared with periodic inspections, an acoustic emission monitoring system can provide continuous, event-based warnings.","zh":"与定期检查相比，声发射监测系统能提供连续的、基于事件的预警。"}]}],"synonyms":["acoustic emission system","AE monitoring system","acoustic emission testing","structural health monitoring system","condition monitoring system","nondestructive testing system"],"phonetic":"/əˈkuːstɪk ɪˈmɪʃən ˈmɑnətərɪŋ ˈsɪstəm/","extraExplanation":["“声发射（AE）”不是外部敲击产生的声音，而是材料内部微裂纹扩展、纤维断裂、摩擦滑移等过程释放的弹性波信号。","典型系统构成：AE传感器（多为压电）、前置放大器、数据采集/分析软件、定位算法（通过多个传感器到达时间差定位源）、报警与记录模块。","常见应用：压力容器与储罐、管道泄漏与腐蚀、桥梁/风机叶片/复合材料结构、焊缝与疲劳裂纹在线监测。"],"etymology":"由技术术语组合而成：acoustic（与声音/声学有关）+ emission（发射/释放）在材料学中指“声发射”（材料内部能量突然释放产生的弹性波）；monitoring（监测）+ system（系统）。整体用于无损检测与结构健康监测领域。","mnemonic":["拆开记：acoustic=“声学/声音的”，emission=“发射/释放”→“声的释放”=声发射；monitoring system=监测系统。","联想中文：看到“AE监测”，把AE记成“Acoustic Emission”的首字母缩写。"]}
{"word":"acoustic faculty","summary":{"en":"the ability to hear","zh":"听觉能力；听力"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"the ability or power to hear; auditory ability (a somewhat formal phrase)","zh":"听觉能力；听力（较正式的说法）"},"examples":[{"en":"With age, his acoustic faculty has weakened, so he uses hearing aids.","zh":"随着年龄增长，他的听觉能力变弱了，所以用助听器。"},{"en":"The test measures students’ acoustic faculty by asking them to repeat spoken sentences.","zh":"这个测试通过让学生复述口头句子来衡量他们的听觉能力。"},{"en":"Musicians often train their acoustic faculty to notice tiny differences in pitch.","zh":"音乐人常训练听觉能力，以察觉音高的细微差别。"}]}],"synonyms":["hearing","sense of hearing","auditory ability","auditory faculty"],"phonetic":"əˈkuːstɪk ˈfækəlti","extraExplanation":["“acoustic”常见于 acoustic guitar（原声吉他）、acoustic engineering（声学工程）、acoustic noise（声学噪声）等；“acoustic faculty”不是特别高频，更常说 hearing 或 sense of hearing。","“faculty”除了“能力/机能”，还常指大学的“（全体）教职员工/院系”（the faculty），注意不要混淆。"],"etymology":"由 acoustic（“声音的、听觉的”）+ faculty（“能力、机能”）组成。faculty 在较正式语境里可表示人体或心智的“机能/能力”（如 mental faculties）。","mnemonic":["把 faculty 记成“法（发）力”→“能力/机能”；acoustic + faculty = “声音相关的能力”→ 听觉能力。","联想 acoustic = “靠耳朵听（audio）”，所以 acoustic faculty ≈ hearing。"]}
{"word":"acoustic guitar","summary":{"en":"A non-electric guitar that makes sound naturally through its hollow body.","zh":"主要靠共鸣箱自然发声的非电吉他。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A guitar that produces sound naturally through the vibration of its strings and hollow body (not mainly through electronic amplification).","zh":"原声吉他／木吉他：主要靠琴弦振动与中空共鸣箱自然发声（不以电子放大为主）。"},"examples":[{"en":"She learned her first chords on an acoustic guitar.","zh":"她在木吉他上学会了最初的和弦。"},{"en":"An acoustic guitar sounds warm and natural in a small room.","zh":"木吉他在小房间里听起来温暖自然。"},{"en":"He brought an acoustic guitar to the campfire sing-along.","zh":"他带了一把木吉他去参加篝火合唱。"}]}],"synonyms":["wooden guitar","steel-string guitar","classical guitar","nylon-string guitar"],"phonetic":"/əˈkuːstɪk ɡɪˈtɑːr/","extraExplanation":["在日常英语里，acoustic guitar 常简称为 “acoustic”。例如：“I play acoustic.”（我弹木吉他。）","常见类型包括 steel-string acoustic（钢弦民谣吉他）与 classical guitar / nylon-string guitar（古典／尼龙弦吉他）。后者严格来说也是 acoustic guitar 的一种。","有些“acoustic-electric guitar（电箱吉他）”既能自然发声，也能接音箱放大；但它仍通常被归在 acoustic 的范围里。"],"etymology":"acoustic 来自希腊语 akoustikos（“与听觉有关的”）；guitar 经由西班牙语 guitarra 传入英语，最终可追溯到更早的地中海地区弦乐器名称。acoustic guitar 作为词组常用来区分 electric guitar（电吉他）。","mnemonic":["acoustic ≈ “靠听觉/自然声” → 联想到“原声”；acoustic guitar 就是“原声吉他”。","把 acoustic 拆记：a-coustic，联想“靠共鸣箱(cavity)发声”——没有插电也能响。"]}
{"word":"acoustic insulation","summary":{"en":"Sound-blocking material or construction that reduces noise transmission.","zh":"减少声音传播、阻隔噪音的隔音材料或做法。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Materials or building methods that reduce how much sound passes through walls, floors, ceilings, or other surfaces.","zh":"用于减少声音穿透墙体、地板、天花板等结构的材料或施工方法；隔音（声学）措施。"},"examples":[{"en":"We added acoustic insulation to the bedroom wall to block traffic noise.","zh":"我们在卧室墙里加了隔音材料来挡住车流噪音。"},{"en":"Good acoustic insulation makes an apartment feel quieter and more private.","zh":"良好的隔音让公寓更安静，也更有私密感。"},{"en":"The studio needs acoustic insulation to prevent sound leakage.","zh":"录音棚需要做隔音，避免声音外泄。"}]}],"synonyms":["soundproofing","sound insulation","noise insulation","acoustic soundproofing","noiseproofing"],"phonetic":"/əˈkuːstɪk ˌɪnsəˈleɪʃən/","extraExplanation":["常见搭配：soundproofing（更口语，常指“隔音处理/做隔音”）、noise insulation（更强调“噪音隔离”）。","在建筑语境里，acoustic insulation 往往不仅指“材料”（如矿棉、玻璃棉、隔音棉），也可指“系统/做法”（如双层石膏板、弹性龙骨、密封条、浮筑地面等）。","注意：acoustic insulation 主要讲“阻隔传播”（隔音）；而 acoustic treatment 更偏“改善室内混响/音质”（吸音、扩散），不完全等同。"],"etymology":"“acoustic”来自希腊语 akoustikos（与“听”有关），经由法语进入英语；“insulation”来自拉丁语 insulare（使之成“岛”一样被隔开），在英语里引申为“隔绝/隔离”。合在一起就是“把声音隔开”的意思。","mnemonic":["把 acoustic 联想成“audio（音频）”，insulation 联想成“隔热/绝缘材料”，合起来就是“给声音做绝缘”→隔音。","“隔音=把噪音关在‘岛’外”：insulation 的词源有“变成岛、隔开”的感觉，帮助记忆“隔离声音”。"]}
{"word":"acoustic material","summary":{"en":"sound-controlling building material","zh":"用于控制声音的建筑/室内材料"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A material designed to control sound in a space—usually by absorbing, blocking, or diffusing noise to improve acoustics.","zh":"用于控制空间声音的材料——通常通过吸音、隔音或扩散声音来减少噪声、改善声学效果。"},"examples":[{"en":"They installed acoustic material on the walls to reduce echo in the classroom.","zh":"他们在教室墙上安装了声学材料来减少回声。"},{"en":"Acoustic material can make open offices quieter and easier to work in.","zh":"声学材料可以让开放式办公室更安静、更适合工作。"},{"en":"The studio uses thick acoustic material to keep outside noise from getting into recordings.","zh":"录音棚用较厚的声学材料来防止外部噪声进入录音。"}]}],"synonyms":["acoustical material","sound-absorbing material","acoustic insulation","soundproofing material","acoustic paneling","noise-reduction material"],"phonetic":"/əˈkuːstɪk məˈtɪriəl/","extraExplanation":["常见类型：吸音（acoustic panels、foam、矿棉板）、隔音/阻隔（mass-loaded vinyl、隔音棉等）、扩散（diffusers）。日常说“acoustic material”多偏“吸音材料”，若强调“隔音”更常说 soundproofing material。","相关指标常见有 NRC（Noise Reduction Coefficient，降噪系数，越高通常吸音越好）与 STC（Sound Transmission Class，隔声等级，越高通常越不易透声）。"],"etymology":"“acoustic”源自希腊语 akoustikos（与“听”有关）；“material”源自拉丁语 materia（物质、材料）。合起来指“用于声音控制的材料”，多用于建筑、室内设计与录音环境。","mnemonic":["把 acoustic 联想成“听觉/音响（音）”，material 联想成“材料（料）”，合起来就是“管声音的材料”。","记忆对比：acoustic（改善室内声场/减少回声）≈“吸音”；soundproofing（阻止声音穿透）≈“隔音”。"]}
{"word":"acoustic music","summary":{"en":"music played with natural instruments, with little or no electronic amplification","zh":"以自然乐器为主、少或不用电子扩音的原声音乐"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Music performed with natural, non‑electric instruments (or with little/no electronic amplification), often emphasizing a warm, “unplugged” sound.","zh":"主要用自然、不插电的乐器演奏（或几乎不用电子扩音）的音乐，常强调温暖、清爽的“原声/不插电”质感。"},"examples":[{"en":"I prefer acoustic music because the vocals and guitar sound more natural.","zh":"我更喜欢原声音乐，因为人声和吉他听起来更自然。"},{"en":"They released an acoustic music version of their hit song.","zh":"他们发布了那首热门歌曲的原声版本。"},{"en":"The café hosts acoustic music on Friday nights.","zh":"那家咖啡馆每周五晚上都有原声音乐演出。"}]}],"synonyms":["unplugged music","unamplified music","folk music"],"phonetic":"/əˈkuːstɪk ˈmjuːzɪk/","extraExplanation":["日常里“acoustic music”常指以木吉他、钢琴、小提琴等为主的“原声/不插电”风格；但也可广义指任何以自然发声为主、电子效果较少的演奏。","常见相关说法：acoustic set（原声小专场/一段原声表演）、acoustic version（原声版）、unplugged（不插电；也常指类似 MTV Unplugged 的原声演出形式）。"],"etymology":"“acoustic”源自希腊语 akoustikos（与“听觉”有关），与动词 akouein（听）相关；在音乐语境里，后来引申为“非电子合成/少电声处理的原声”。“acoustic music”作为搭配用法，常与“electric/plugged-in”对比。","mnemonic":["把 acoustic 联想成“靠耳朵听到的自然声音”（与希腊词根 akou- ‘听’有关），所以 acoustic music = 不靠电来“造声”的音乐。","记忆对比：acoustic（原声） ↔ electric（电声）。"]}
{"word":"acoustic neuroma","summary":{"en":"a usually benign tumor on the balance/hearing nerve from the inner ear","zh":"发生在内耳通向大脑的前庭/听觉相关神经上的通常良性肿瘤"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A usually noncancerous tumor that grows on the vestibular (balance) nerve leading from the inner ear to the brain; it can cause hearing loss, ringing in the ear, dizziness, or balance problems.","zh":"一种通常为良性的肿瘤，生长在从内耳通向大脑的前庭（平衡）神经上；可能引起听力下降、耳鸣、头晕或平衡问题。"},"examples":[{"en":"The doctor ordered an MRI to check for an acoustic neuroma after the patient reported one-sided hearing loss.","zh":"病人出现单侧听力下降后，医生安排做核磁共振（MRI）以排查听神经瘤。"},{"en":"Common symptoms include tinnitus, dizziness, and gradual hearing loss.","zh":"常见症状包括耳鸣、头晕以及逐渐加重的听力下降。"},{"en":"Treatment options may include monitoring, surgery, or targeted radiation.","zh":"治疗选择可能包括定期观察、手术或定向放射治疗。"}]}],"synonyms":["vestibular schwannoma","acoustic schwannoma"],"phonetic":"/əˈkuːstɪk nuːˈroʊmə/","extraExplanation":["学习提示：虽然中文常译为“听神经瘤”，但它多数发生在“前庭神经”（管平衡），因此症状除了听力问题，也常见眩晕、走路不稳。","词汇区分：neuroma在日常英语里多指“神经相关的肿块/肿瘤”，但在不同医学语境下含义可更具体；这里指一种特定的颅内良性肿瘤。"],"etymology":"“acoustic”原指“与听觉/声音有关”；“neuroma”来自“neuro-（神经）+ -oma（肿瘤）”。这个名称较早用于描述与听觉相关的神经肿瘤，但现代医学中更准确的名称常用“vestibular schwannoma（前庭神经鞘瘤）”，因为它通常起源于施万细胞并主要影响平衡神经。","mnemonic":["拆词记忆：acoustic（听觉的）+ neuro（神经）+ -oma（肿瘤）=“听觉相关的神经肿瘤”。","联想中文：把它记成“听（acoustic）+ 神经（neuro）+ 瘤（-oma）”。"]}
{"word":"acoustic signal","summary":{"en":"sound-based information-carrying wave","zh":"以声音形式承载信息的信号"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A sound wave (or pattern of sound) used to carry information, such as speech, music, or sonar pulses.","zh":"用于传递信息的声音波（或声音模式），例如语音、音乐或声呐脉冲。"},"examples":[{"en":"In a phone call, your voice is converted into an acoustic signal and then into digital data.","zh":"在电话通话中，你的声音会先转换成声学信号，再转换成数字数据。"},{"en":"Bats navigate by sending out acoustic signals and listening for echoes.","zh":"蝙蝠通过发出声学信号并聆听回声来导航。"},{"en":"The noise made it hard for the microphone to pick up a clean acoustic signal.","zh":"噪声使麦克风难以拾取清晰的声学信号。"}]}],"synonyms":["sound signal","audio signal","acoustic waveform","sound wave"],"phonetic":"/əˈkuːstɪk ˈsɪɡnəl/","extraExplanation":["常见于语音处理/音频工程：acoustic signal 通常指空气中的真实声波；与之相对，digital signal（数字信号）是把声音采样量化后的数据。","在语音识别里，acoustic signal（声学信号）会先被转成声谱图等特征，再用于识别。"],"etymology":"“acoustic”来自希腊语 akoustikos（与“听觉/聆听”有关），经法语进入英语；“signal”来自拉丁语 signum（标记、符号）。合起来在工程与语言科学中指“以声音形式承载信息的信号”。","mnemonic":["acoustic≈“听的”(a-cous-tic 联想 cousin 在旁边“听”你说话)；signal=信号，合起来就是“用声音传信息的信号”。","把它记成“声学(acoustic)+信号(signal)=声波信息载体”。"]}
{"word":"acoustic songs","summary":{"en":"Songs with an unplugged, natural sound, usually using non-electric instruments.","zh":"以原声/不插电方式呈现、主要使用非电声乐器的歌曲。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Songs performed mainly with non-electric (“acoustic”) instruments (especially acoustic guitar), usually with a natural, unplugged sound.","zh":"以非电声（原声）乐器为主演奏的歌曲（常见为木吉他伴奏），整体听感更自然、偏“不开电”。"},"examples":[{"en":"I love acoustic songs because the lyrics feel more personal.","zh":"我喜欢原声歌曲，因为歌词听起来更真诚、更贴近人。"},{"en":"She posted acoustic songs on YouTube with just her guitar.","zh":"她在 YouTube 上上传了只用吉他伴奏的原声歌曲。"},{"en":"The band played a few acoustic songs in the middle of the concert.","zh":"乐队在演唱会中段演了几首原声歌曲。"}]},{"partOfSpeech":"phrase","definition":{"en":"A common label for “unplugged” or stripped-down versions of songs (fewer instruments, softer sound), even if the original is pop/rock.","zh":"常用来指“Unplugged/精简编制”的版本：配器更少、声音更柔和；即使原曲是流行/摇滚也可这样改编。"},"examples":[{"en":"Their acoustic songs are calmer than their studio versions.","zh":"他们的原声版本比录音室版本更安静、更柔和。"},{"en":"This track has an acoustic song version and a remix version.","zh":"这首歌有原声版和混音版。"}]}],"synonyms":["unplugged songs","acoustic tracks","stripped-down versions","acoustic versions"],"phonetic":"əˈkuːstɪk sɔŋz","extraExplanation":["在流行音乐里，acoustic songs 常让人联想到更“亲密”的现场感：人声更突出、配器更简单（常见：木吉他、钢琴、手鼓）。","和“electric songs”不是固定对立说法；更常见的对比是 acoustic（原声/不插电） vs. electric/plugged-in（电声/插电）、或 studio version（录音室版） vs. acoustic version（原声版）。","常见相关词：acoustic set（原声小段演出/曲目组合）、unplugged（不插电演出/版本）。"],"etymology":"“acoustic”源自希腊语 akoustikos（与“听觉/听见”有关），英语里先指“声音/声学的”，后来在音乐语境中常指“不插电、原声的”。“song”源自古英语 sang（歌）。合在一起就成了“原声歌曲/不插电歌曲”的常用说法。","mnemonic":["把 acoustic 记成“a-cousti(c)”≈“靠耳朵听”的感觉：强调自然声音、不靠电音效果。","“原声”=“原本的声音”，所以 acoustic songs 就是“更接近原本声音的歌”。"]}
{"word":"acoustic-electrical","summary":{"en":"Connected with both sound and electricity, especially sound-to-electric (or electric-to-sound) conversion.","zh":"与声学与电学两者相关，尤指声电（或电声）转换。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or involving both sound (acoustic) signals and electrical signals, especially the conversion between them (as in microphones, speakers, or audio engineering).","zh":"与声音（声学）信号和电信号都有关的；尤指二者之间的转换（如麦克风、扬声器或音频工程中的转换）。"},"examples":[{"en":"A microphone is an acoustic-electrical transducer: it turns sound waves into an electrical signal.","zh":"麦克风是一种声学—电学换能器：它把声波转换成电信号。"},{"en":"The lab tested acoustic-electrical performance by measuring distortion and noise.","zh":"实验室通过测量失真和噪声来测试声学—电学性能。"}]}],"synonyms":["electroacoustic","electro-acoustic","audio-electrical"],"phonetic":"/əˈkuːstɪk ɪˈlɛktrɪkəl/","extraExplanation":["“acoustic-electrical”多见于工程/科研语境，是由两个形容词通过连字符组合而成，用来强调“跨两种域（声学与电学）”或“声电转换”的性质。","常见相关搭配：acoustic-electrical transducer（声电换能器，如麦克风）、acoustic-electrical conversion（声电转换）、acoustic-electrical coupling（声电耦合）。在更口语或通用的写法中，也常用“electroacoustic / electro-acoustic（电声的）”来表达类似意思。"]}
{"word":"acoustic-lateral","summary":{"en":"“Acoustic-lateral” describes things connected with both hearing and the lateral-line sensing system (mainly in fish/amphibians).","zh":"“acoustic-lateral”指与“听觉”和“侧线感觉系统”两者都相关的（多见于鱼类/两栖类的生物学语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to both hearing (acoustic) and the lateral-line sense system, especially in fish and amphibians.","zh":"（多用于鱼类/两栖类生物学）与“听觉（acoustic）”和“侧线感觉系统（lateral line）”两者相关的；听觉-侧线的。"},"examples":[{"en":"Many fish use the acoustic-lateral system to detect vibrations and movement in the water.","zh":"许多鱼类会利用听觉-侧线系统来感知水中的振动与运动。"},{"en":"The study focused on acoustic-lateral organs that help animals sense pressure changes.","zh":"这项研究聚焦于帮助动物感知压力变化的听觉-侧线器官。"}]}],"synonyms":["acousticolateralis","acoustico-lateral"],"phonetic":"/əˈkuːstɪk ˈlætərəl/","extraExplanation":["“acoustic-lateral”常见于生物学与神经科学语境，尤其指“听觉 + 侧线系统”共同构成的感觉通路（也常写作 acousticolateralis / acoustico-lateral）。侧线系统是鱼类体表的一套感觉结构，能探测水流、低频振动与附近物体的运动。","使用上它通常出现在更长的术语里，例如：acoustic-lateral system（听觉-侧线系统）、acoustic-lateral organs（听觉-侧线器官）。在日常英语中较少单独使用。"]}
{"word":"acoustic-refraction-related","summary":{"en":"“Acoustic-refraction-related” means connected to sound bending (refraction) caused by changes in the medium (air/water).","zh":"“acoustic-refraction-related”指与声波因介质条件变化而发生折射（弯曲）的现象或研究相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to acoustic refraction—the bending of sound waves as they pass through air or water layers with different temperatures, densities, or wind speeds.","zh":"与“声折射”有关的——指声波在不同温度、密度或风速的空气/水层中传播时发生弯曲的现象及其相关内容。"},"examples":[{"en":"The team used an acoustic-refraction-related model to predict how sirens would carry on a foggy morning.","zh":"团队使用了一个与声折射相关的模型来预测在有雾的早晨警笛声会传播多远。"},{"en":"Acoustic-refraction-related effects can make distant noises seem louder at night.","zh":"与声折射相关的效应会让远处的声音在夜晚听起来更响。"}]}],"synonyms":["refraction-related (in acoustics)","sound-refraction-related","acoustic refraction (as a modifier)"],"phonetic":"/əˈkuːstɪk rɪˈfrækʃən rɪˈleɪtɪd/","extraExplanation":["“声折射”常见于大气声学与海洋声学：当声速随高度/深度变化（例如夜间近地面降温形成逆温层，或海水温盐随深度变化）时，声线会向声速较低的一侧弯曲，从而出现“声音绕行、远距离更清晰/更响、出现声影区”等现象。","这个词形更像临时组合（hyphenated compound），多用于技术写作中作定语；更常见的替代表达包括 acoustic refraction, refraction-related acoustics, or sound-refraction effects。"]}
{"word":"acoustic-to-electric","summary":{"en":"Acoustic-to-electric means converting natural acoustic sound into an electrical signal, especially in music and audio equipment.","zh":"acoustic-to-electric 指把自然的声学声音转换为电信号，常用于音乐与音频设备语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Describing something (usually a musical instrument, performance, or signal) that is converted from natural acoustic sound into an electrical signal, often using a pickup or microphone.","zh":"（多用于乐器、演奏或信号）指把自然的“原声/声学声音”转换成“电信号”，通常通过拾音器或麦克风来实现。"},"examples":[{"en":"This guitar is set up for acoustic-to-electric recording with an onboard pickup.","zh":"这把吉他装了内置拾音器，适合做从原声到电信号的录音。"},{"en":"An acoustic-to-electric converter helps the instrument work with amplifiers and pedals.","zh":"原声转电信号的转换装置能让乐器连接音箱和效果器。"}]}],"synonyms":["acoustic-electric","acoustic-to-electrical","sound-to-electric (signal)","acoustic signal conversion"],"phonetic":"/əˈkuːstɪk tə ɪˈlɛktrɪk/","extraExplanation":["在音乐语境里，acoustic-to-electric 常与 pickup（拾音器）、preamp（前级放大器）、DI box（直插盒）一起出现：流程通常是“琴体振动/空气声波 → 拾音器或麦克风 → 电信号 → 音箱/调音台/录音设备”。","它不是一个非常固定的“词典词”，更像技术性复合形容词（compound adjective），写作时常加连字符：acoustic-to-electric signal / conversion / system。"]}
{"word":"acoustic-visual","summary":{"en":"Acoustic-visual describes something involving both sound and sight, often used for combined audio-and-visual cues or materials.","zh":"Acoustic-visual 表示同时涉及听觉与视觉的事物，常用于指结合声音与画面/视觉线索的材料或信息。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both sound (acoustic) and sight (visual); using hearing and seeing together.","zh":"与声音（听觉）和视觉都有关的；同时运用听觉与视觉的。"},"examples":[{"en":"The course uses acoustic-visual materials, including recordings and diagrams.","zh":"这门课程使用听觉-视觉材料，包括录音和图示。"},{"en":"Acoustic-visual cues help learners understand pronunciation and mouth shape at the same time.","zh":"听觉-视觉线索能帮助学习者同时理解发音和口型。"}]}],"synonyms":["audiovisual","audio-visual","multisensory"],"phonetic":"/əˌkuːstɪk ˈvɪʒuəl/","extraExplanation":["“acoustic-visual”在日常英语里不如“audiovisual（视听的）”常见；很多场合用“audiovisual”更自然。","在语言学习、心理学或人机交互等语境中，“acoustic-visual”有时会强调“声音信号 + 视觉信号”的结合（例如语音与唇读/口型信息一起使用）。","写作时常见搭配：acoustic-visual cues/signals/integration；更通用的搭配：audiovisual materials/media/presentation。"]}
{"word":"acoustical","summary":{"en":"Acoustical means “related to sound,” and is a more formal/technical variant of acoustic.","zh":"acoustical 指“与声音/声学有关”，是 acoustic 的更正式、偏技术的说法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to sound or hearing, especially in terms of how sound is produced, transmitted, or controlled.","zh":"与声音或听觉有关的；尤指声音如何产生、传播或被控制。"},"examples":[{"en":"The acoustical design of the concert hall helps every seat hear the music clearly.","zh":"音乐厅的声学设计让每个座位都能清楚听到音乐。"},{"en":"They tested the acoustical properties of the wall panels to reduce echo.","zh":"他们测试了墙板的声学特性以减少回声。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used in more technical or formal contexts to mean “acoustic”; often seen in phrases like “acoustical engineering” or “acoustical measurement.”","zh":"（较技术/正式用法）相当于 acoustic；常见于“acoustical engineering（声学工程）”“acoustical measurement（声学测量）”等搭配中。"},"examples":[{"en":"She works in acoustical engineering, improving noise control in buildings.","zh":"她从事声学工程，改进建筑物的噪声控制。"},{"en":"The report includes acoustical measurements of traffic noise near the school.","zh":"报告包含学校附近交通噪声的声学测量数据。"}]}],"synonyms":["acoustic","sonic","auditory"],"phonetic":"/əˈkus.tɪ.kəl/","extraExplanation":["“acoustical”和“acoustic”在现代英语里意思几乎相同；日常更常用“acoustic”。“acoustical”更常出现在较正式或技术性的书面语中，尤其是谈测量、工程、性能（properties）时。","常见搭配：acoustical design（声学设计）、acoustical properties（声学特性）、acoustical treatment（声学处理/吸音处理）、acoustical engineer（声学工程师）。"]}
{"word":"acoustical quality","summary":{"en":"How good or clear sound is, especially as shaped by a room or space.","zh":"尤其由空间环境决定的声音清晰度与整体听感好坏。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"The characteristics of a sound or of a space (like a room or hall) that affect how sound is heard—such as clarity, loudness, echo, warmth, and balance.","zh":"声音或空间（如房间、音乐厅）的“听感特性”，会影响人们听到的效果，如清晰度、响度、回声、温暖感与均衡度等。"},"examples":[{"en":"The acoustical quality of the concert hall is excellent, so even soft notes sound clear.","zh":"这座音乐厅的声学质量非常好，所以连很轻的音符也很清晰。"},{"en":"We improved the classroom’s acoustical quality by adding carpets and acoustic panels.","zh":"我们通过铺地毯和加装吸音板来提升教室的声学效果。"},{"en":"Poor acoustical quality can make online meetings tiring because voices become muddy.","zh":"声学效果差会让线上会议很累，因为人声会变得含混不清。"}]}],"synonyms":["acoustic quality","acoustics","sound quality","sonic quality","audio quality"],"phonetic":"/əˈkuːstɪkəl ˈkwɑːləti/","extraExplanation":["常见搭配：acoustical quality of a room/hall/studio（某空间的声学效果）；good/excellent/poor acoustical quality（声学效果好/极好/差）。","在工程或建筑语境中，它常与 acoustics（声学）、soundproofing（隔音）、reverberation（混响/回响）、echo（回声）、clarity（清晰度）等一起出现。","注意区分：sound quality 多指录音/设备的音质；acoustical quality 更强调“空间与声音传播”带来的听感。"],"etymology":"“acoustical”来自 acoustic（声学的），其词根源自希腊语 akoustikos（与听觉有关），再追溯到 akouein（听）。这里的 “quality” 表示“品质/特性”，合起来就是“声学上的品质或特性”。","mnemonic":["记忆法：acoustical ≈ acoustic（声学/听觉）+ -al（……的）→“声学的”；quality=“品质/质量”。合起来就是“声学质量/听感效果”。","联想：走进“空（acou-像‘靠’）旷的大厅”，听到回声与清晰度的差别，就是在感受 acoustical quality。"]}
{"word":"acoustically","summary":{"en":"“Acoustically” means “in terms of sound or hearing.”","zh":"“acoustically”表示“在声音/听觉方面；从声学角度”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to sound or hearing, especially how sound is produced, carried, or perceived.","zh":"在声音或听觉方面；尤指声音如何产生、传播或被听到。"},"examples":[{"en":"This room is acoustically treated to reduce echo.","zh":"这个房间做了声学处理来减少回声。"},{"en":"The guitar sounds acoustically brighter in a smaller space.","zh":"在较小的空间里，这把吉他在声学上听起来更明亮。"}]}],"synonyms":["sonically","in terms of sound","sound-wise"],"phonetic":"/əˈkuːstɪkli/","extraExplanation":["“acoustically”常见于音乐、录音、建筑（声学设计）等语境，比如 acoustic treatment（声学处理）、acoustically insulated（隔音的）、acoustically live/dead room（混响多/混响少的房间）。","它来自“acoustic”（声学的、原声的），进一步来自希腊语 akoustikos，意为“关于听觉的”。日常口语里更常说 “in terms of sound / sound-wise”。"]}
{"word":"acoustician","summary":{"en":"An acoustician is a sound specialist who studies and manages how sound behaves, often improving acoustics or controlling noise.","zh":"acoustician 指声学方面的专业人士，研究并管理声音如何传播与被听见，常用于改善空间声学或控制噪声。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who specializes in acoustics (the science of sound), especially someone who designs or evaluates how sound behaves in rooms, buildings, or products.","zh":"声学专家；研究声学（声音科学）的人，尤指负责设计或评估房间、建筑或产品中声音效果的人。"},"examples":[{"en":"The acoustician tested the concert hall to make sure every seat had clear sound.","zh":"声学专家检测了音乐厅，确保每个座位都能听到清晰的声音。"},{"en":"We hired an acoustician to reduce echo in the classroom.","zh":"我们请了一位声学专家来减少教室里的回声。"}]},{"partOfSpeech":"n.","definition":{"en":"A professional who advises on noise control, sound insulation, and audio-related measurements in workplaces or public spaces.","zh":"噪声控制与隔音顾问；在工作场所或公共空间进行与声音相关测量并提供建议的专业人士。"},"examples":[{"en":"An acoustician measured the factory noise and suggested protective changes.","zh":"声学专家测量了工厂噪声，并建议采取防护改进。"},{"en":"The acoustician recommended thicker panels for better sound insulation.","zh":"声学专家建议使用更厚的板材来提升隔音效果。"}]}],"synonyms":["acoustics specialist","sound consultant","acoustic engineer"],"phonetic":"/ˌækuˈstɪʃən/","extraExplanation":["词源提示：acoustician 来自 acoustics（声学），而 acoustics 源于希腊语 akoustikos，意思是“与听觉有关的”。因此 acoustician 通常指“以声音/听觉为专业的人”。","易混词：acoustician（声学专家，偏科学/工程/测量与设计）≠ musician（音乐家）≠ audio engineer（录音/音响工程师，偏设备与制作）。在建筑或场馆里改善“声音听起来如何”，更常用 acoustician。"]}
{"word":"acoustico","summary":{"en":"“Acoustico” is a nonstandard/borrowed way to say “acoustic,” often used to mean an unplugged, natural-sounding music style or something related to sound.","zh":"“acoustico”多为非标准/外来用法，通常等同于“acoustic”，常指不插电的原声音乐风格或与声音（声学）相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard/borrowed form) Acoustic; relating to sound or the way sound is heard in a space, or (in music) played without electric amplification.","zh":"（非标准/外来用法）“声学的”；与声音或空间的听觉效果有关；（音乐中）指不使用电声放大、以原声演奏的。"},"examples":[{"en":"This cafe has good acoustico vibes for live music—small room, warm sound.","zh":"这家咖啡馆很适合原声演出——空间不大，声音听起来很温暖。"},{"en":"They released an acoustico version of the song with just guitar and voice.","zh":"他们发布了这首歌的原声版本，只用吉他和人声。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) An acoustic/unplugged version or style of a song or performance.","zh":"（少见）歌曲或表演的原声（不插电）版本/风格。"},"examples":[{"en":"I prefer the acoustico—it feels more intimate.","zh":"我更喜欢原声版本——感觉更亲密。"}]}],"synonyms":["acoustic","unplugged","unamplified","sound-related"],"phonetic":"/əˈkuːstɪkoʊ/","extraExplanation":["“acoustico”不是常见的标准英语词形，更常见的英语是 **acoustic**（声学的/原声的）或 **unplugged**（不插电的）。在一些乐队宣传、歌单标题、或受西班牙语/葡萄牙语（*acústico*）影响的语境里，可能会看到“acoustico”作为风格标签使用。","如果你是在歌词、曲目名或品牌里看到它，通常可以把它理解为“原声版/声学版”。正式写作或考试中建议用 **acoustic**。"]}
{"word":"acoustico-lateral","summary":{"en":"A technical adjective meaning “related to hearing and the lateral-line senses in aquatic animals.”","zh":"一个专业形容词，表示“与水生动物的听觉以及侧线感觉系统有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to hearing (“acoustic”) and the lateral-line sensory system (a set of sense organs along the sides of many fish and aquatic amphibians that detect water movement and vibration).","zh":"（尤用于动物学）与“听觉（acoustic）”以及“侧线感觉系统（lateral line）”（许多鱼类和部分水生两栖类身体两侧的感觉器官，用来感知水流、振动）有关的。"},"examples":[{"en":"Many fish rely on the acoustico-lateral system to detect predators in dark water.","zh":"许多鱼类依靠听觉—侧线系统在昏暗水域中察觉捕食者。"},{"en":"Researchers recorded how acoustico-lateral cues guide schooling behavior.","zh":"研究人员记录了听觉—侧线线索如何引导鱼群的集群（结群）行为。"}]}],"synonyms":["acoustic-lateral","acousticolateral"],"phonetic":"/əˌkuːstɪkoʊ ˈlætərəl/","extraExplanation":["这是一个较专业的复合形容词，常见于动物学/神经生物学文献，用来把“听觉系统”和“侧线系统”合在一起讨论，因为两者都与“对振动/波动的感知”密切相关。","拼写上也可能见到 acoustic-lateral 或 acousticolateral；含义基本相同。"]}
{"word":"acousticolateral","summary":{"en":"Acousticolateral describes sensory structures in many aquatic animals that combine hearing-related functions and the lateral line vibration-detection system.","zh":"Acousticolateral 指许多水生动物中与听觉及侧线（感知水中振动/水流）有关的感觉结构或系统。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to hearing (acoustic) and the lateral line system (a sensory organ in many fish and aquatic amphibians).","zh":"与听觉（声学）以及侧线系统（许多鱼类与水生两栖类的感觉器官）有关的。"},"examples":[{"en":"Sharks use an acousticolateral system to detect vibrations and movement in the water.","zh":"鲨鱼会利用声侧（acousticolateral）系统来感知水中的震动与运动。"},{"en":"The paper discusses acousticolateral organs and how they help fish navigate.","zh":"这篇论文讨论了声侧器官以及它们如何帮助鱼类导航。"}]}],"synonyms":["acoustic-lateral","acoustico-lateral","(related) acousticolateralis"],"phonetic":"/əˌkuːstɪkoʊˈlætərəl/","extraExplanation":["“acousticolateral”常见于生物学/神经科学文献，尤其谈到鱼类与水生两栖类的“声侧（acousticolateralis）系统”，它把听觉相关结构与侧线感觉（感受水流、压力变化、低频振动）放在同一类感觉系统中。","词形上是 acoustic（声的/听觉的）+ lateral（侧的），有时也写作 acoustic-lateral 或 acoustico-lateral；在学术语境里更常见相关名词 acousticolateralis（声侧系统）。"]}
{"word":"Acousticon","summary":{"en":"Acousticon is a historical brand name for an early electric hearing aid, sometimes used to refer to early hearing aids in general.","zh":"Acousticon 是早期电助听器的一个历史品牌名，有时也用来指代早期助听器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand name for an early electric hearing aid; by extension, an early type of hearing aid used to help people hear better.","zh":"（商标名）早期的电助听器；也可泛指早期的一类助听器，用来帮助听力受损者更清楚地听见。"},"examples":[{"en":"The museum displayed an Acousticon from the early 1900s.","zh":"博物馆展出了一台20世纪初的 Acousticon 助听器。"},{"en":"She read a letter describing how an Acousticon helped someone follow conversations.","zh":"她读到一封信，信里描述 Acousticon 如何帮助某人跟上对话。"}]}],"synonyms":["hearing aid","assistive listening device","auditory amplifier"],"phonetic":"/əˈkuːstɪkɑːn/","extraExplanation":["Acousticon 最早与20世纪初的助听器发展史有关，常被认为是较早期的“电动/电子化助听器”之一（与早期的听筒、喇叭形“耳号/听筒”相比更先进）。在历史或博物馆语境中更常见。","拼写通常大写（Acousticon），因为它本来是商标/产品名；在一些历史文本里也可能被当作普通名词来使用。"]}
{"word":"acousticon","summary":{"en":"“Acousticon” means an early hearing aid or sound-amplifying device used to help someone hear better.","zh":"“acousticon”指一种早期的助听器/集音扩音装置，用来帮助人更清楚地听见声音。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device that helps a person hear better; an early type of hearing aid (often a small horn or tube used to amplify sound)","zh":"助听器；（尤指早期的）集音器/扩音听器（常为小喇叭或管状装置，用来放大声音）"},"examples":[{"en":"He used an acousticon to hear the teacher more clearly in class.","zh":"他用一个acousticon来更清楚地听见老师在课堂上讲课。"},{"en":"In old photographs, you can sometimes see an acousticon held to the ear.","zh":"在一些老照片里，你有时会看到有人把acousticon举到耳边。"}]}],"synonyms":["hearing aid","ear trumpet","listening tube"],"phonetic":"/əˈkuːstɪkɑn/","extraExplanation":["“Acousticon”常见于19世纪末到20世纪初的语境，属于较早期的助听设备名称；现代英语更常用hearing aid（助听器）。","该词有时也被用作某些早期助听器品牌/产品名（专有名词用法），具体取决于历史资料或文本上下文。"]}
{"word":"acousticophobia","summary":{"en":"Acousticophobia means a strong fear of sounds or noise.","zh":"Acousticophobia 指对声音或噪音的强烈恐惧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An intense fear of sounds or noise, often strong enough to cause anxiety or avoidance.","zh":"对声音或噪音的强烈恐惧，常会引发焦虑或回避行为。"},"examples":[{"en":"After the accident, she developed acousticophobia and avoided crowded, noisy places.","zh":"事故之后，她出现了声恐惧症，开始避开拥挤嘈杂的地方。"},{"en":"His acousticophobia made fire alarms and sudden loud sounds especially frightening.","zh":"他的声恐惧症让火警警报和突如其来的巨响尤其可怕。"}]}],"synonyms":["phonophobia","fear of loud noises","fear of sounds"],"phonetic":"/əˌkuːstɪkəˈfoʊbiə/","extraExplanation":["词源上可拆为 acoustic（声音的）+ -phobia（恐惧症）。它属于较少见的医学/心理学用语，日常表达中更常说 “a fear of loud noises / a fear of sounds”。","注意区分：acousticophobia 是“对声音的恐惧”；而 misophonia 通常指“对某些特定声音（如咀嚼声）产生强烈厌恶或愤怒”，不一定是恐惧；hyperacusis 则是“对声音异常敏感/觉得太响”的听觉问题。"]}
{"word":"acoustics","summary":{"en":"Acoustics means the science of sound, or the sound quality of a space.","zh":"Acoustics 指“声学（声音的科学）”，也指“某个空间的音响效果/声学条件”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the scientific study of sound—how it is made, how it travels, and how it is heard","zh":"声学：研究声音如何产生、传播以及被听见的科学"},"examples":[{"en":"She studied acoustics to learn how sound waves move through air and water.","zh":"她学习声学，以了解声波如何在空气和水中传播。"},{"en":"Acoustics is important in designing microphones and headphones.","zh":"声学在设计麦克风和耳机时很重要。"}]},{"partOfSpeech":"n.","definition":{"en":"the sound quality of a room, hall, or space (how sound behaves there)","zh":"（房间/礼堂等空间的）音响效果、声学条件（声音在其中的表现）"},"examples":[{"en":"The acoustics in the concert hall are excellent.","zh":"这座音乐厅的音响效果非常好。"},{"en":"The classroom has bad acoustics, so students can’t hear clearly.","zh":"这间教室的声学条件不好，所以学生听不清。"}]}],"synonyms":["sound science","sound quality","room sound"],"phonetic":"/əˈkuːstɪks/","extraExplanation":["“Acoustics”常以复数形式出现（-s），但通常当作不可数名词使用：study acoustics（学习声学）。表示“某个空间的音效”时也常说the acoustics are…（这里用复数动词很常见）。","相关常用搭配：acoustic engineering（声学工程）、acoustic treatment（声学处理/吸音处理）、acoustic panel（吸音板）、room acoustics（室内声学）。","文化语境中，音乐评论里常用acoustics指“空间是否适合演出”，例如教堂常被认为有“rich acoustics（丰富的混响）”。"]}
{"word":"acoustics technology","summary":{"en":"Sound-related methods and engineering used to measure, design, and improve audio and acoustic environments.","zh":"用于测量、设计与改善声音及声环境的工程方法与技术。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Technology and methods used to study, measure, design, control, or improve sound (how it is produced, transmitted, and heard), especially in rooms, buildings, and audio systems.","zh":"声学技术：用于研究、测量、设计、控制或改善声音（产生、传播与听觉效果）的一类技术与方法，常用于建筑空间与音频系统。"},"examples":[{"en":"The theater invested in acoustics technology to reduce echo and make speech clearer.","zh":"剧院投入声学技术来减少回声，让对白更清晰。"},{"en":"Modern acoustics technology helps engineers design quieter cars and better headphones.","zh":"现代声学技术帮助工程师设计更安静的汽车和更好的耳机。"},{"en":"They used acoustics technology to test how sound travels through different materials.","zh":"他们用声学技术测试声音在不同材料中的传播情况。"}]}],"synonyms":["acoustic engineering","sound technology","audio engineering","acoustic design","noise-control technology"],"phonetic":"/əˈkuːstɪks tɛkˈnɑːlədʒi/","extraExplanation":["常见应用场景：建筑声学（音乐厅、教室、办公室降噪）、电声学（麦克风/扬声器/耳机）、噪声控制（交通与工业降噪）、语音与音频处理（会议系统、回声消除）。","近义表达里，acoustic engineering 更偏“工程学科/职业”，acoustic design 更偏“设计工作本身”，sound technology 更口语、更广泛（不一定强调“声学”这一学科）。"],"etymology":"“acoustics”源自希腊语 akoustikos，意为“与听觉有关的”，与动词 akouein（听）相关；后来在英语中发展为“声学（作为学科）”。“technology”来自希腊语 techne（技艺）+ -logia（学问）。组合成短语后，常指“应用于声学问题的工程与技术手段”。","mnemonic":["记忆法：acoustic 里有 “audio/听觉”的感觉——把它联想到“听(acu-)”→声音；technology 就是“技术”，合起来就是“声音相关的技术”。","联想中文：声学=“声音的科学”，声学技术=“把这门科学用在实际里的工具和方法”。"]}
{"word":"acoustoelectric","summary":{"en":"Acoustoelectric means involving the coupling or conversion between sound waves and electrical signals, often in materials/devices.","zh":"acoustoelectric 指“声电的”，涉及声波与电信号之间的耦合或转换，常用于材料与器件领域。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the interaction between sound (acoustic waves) and electricity—especially the conversion between acoustic energy and electrical signals in materials or devices.","zh":"声电的；与声音（声波）与电（电信号）之间的相互作用有关的，尤指在材料或器件中实现声能与电信号相互转换。"},"examples":[{"en":"Acoustoelectric sensors can detect tiny vibrations by turning sound waves into electrical signals.","zh":"声电传感器可以把声波转成电信号，从而检测到非常微小的振动。"},{"en":"The team studied an acoustoelectric device that couples surface acoustic waves with a semiconductor.","zh":"团队研究了一种声电器件，它把表面声波与半导体耦合在一起。"}]},{"partOfSpeech":"adj.","definition":{"en":"Connected to the acoustoelectric effect: changes in electrical properties caused by acoustic waves (or vice versa) in a material.","zh":"与声电效应有关的：指声波导致材料电学性质变化（或电作用影响声学行为）的现象。"},"examples":[{"en":"The paper reports acoustoelectric attenuation in a thin film at low temperatures.","zh":"论文报告了低温下薄膜中的声电衰减现象。"},{"en":"Acoustoelectric measurements helped them estimate the charge carrier mobility.","zh":"声电测量帮助他们估算了载流子迁移率。"}]}],"synonyms":["acoustic-electrical","electroacoustic","acoustic-to-electric","sound-to-electric"],"phonetic":"/əˌkuːstoʊɪˈlɛktrɪk/","extraExplanation":["“acoustoelectric”常见于物理与工程语境（如压电材料、表面声波SAW器件、半导体薄膜）。它通常修饰effect（效应）、device（器件）、sensor（传感器）、coupling（耦合）、interaction（相互作用）等名词。","构词上可拆为 acoustic（声学的）+ electro/electric（电的）。相关更常见的词还包括“piezoelectric（压电的）”，但二者不完全等同：压电强调机械应力与电极化的转换；acoustoelectric更强调“声波—电学响应”的耦合与测量。"]}

