{"word":"ACW","summary":{"en":"ACW most commonly means the American Civil War, and it can also mean anti-clockwise (reverse clock direction).","zh":"ACW 最常见指 American Civil War（美国内战），也可指 anti-clockwise（逆时针）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"abbreviation for the American Civil War (1861–1865), fought between the Union (North) and the Confederacy (South).","zh":"American Civil War（美国内战，1861–1865）的缩写；北方联邦与南方邦联之间的战争。"},"examples":[{"en":"Many historians study the ACW to understand how modern America was shaped.","zh":"许多历史学者研究 ACW，以理解现代美国是如何形成的。"},{"en":"Letters written during the ACW give a personal view of life in the 1860s.","zh":"ACW 时期写下的书信能让人从个人视角了解19世纪60年代的生活。"}]},{"partOfSpeech":"other","definition":{"en":"abbreviation meaning “anti-clockwise”; moving in the opposite direction of a clock’s hands (more common in British English; American English often uses CCW for “counterclockwise”).","zh":"“anti-clockwise（逆时针）”的缩写；方向与钟表指针相反（英式英语更常见；美式英语常用 CCW 表示“counterclockwise”）。"},"examples":[{"en":"Turn the knob ACW to loosen it.","zh":"把旋钮向 ACW（逆时针）方向转动来拧松。"},{"en":"The arrow shows the ACW direction of rotation.","zh":"箭头显示旋转的 ACW（逆时针）方向。"}]}],"synonyms":["American Civil War","anti-clockwise","counterclockwise (CCW)"],"phonetic":"/ˌeɪ siː ˈdʌbəl.juː/","extraExplanation":["ACW 属于“缩写”（abbreviation），在不同领域含义可能不同；常见用法主要是“American Civil War（美国内战）”和“anti-clockwise（逆时针）”。阅读时可通过上下文判断：如果出现历史、林肯、南北战争等话题，多半指美国内战；如果出现旋转、方向、螺丝等，多半指逆时针。"]}
{"word":"ACWA","summary":{"en":"ACWA is an acronym most commonly referring to a water-agency association; its exact meaning depends on the region (e.g., California or Arab countries).","zh":"ACWA 是一个缩写，常指与水务机构相关的协会；具体含义取决于地区（如加州或阿拉伯国家）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(US) Association of California Water Agencies; an organization that represents and supports public water agencies in California.","zh":"（美国）加州水务机构协会；代表并支持加州公共供水机构的组织。"},"examples":[{"en":"ACWA testified in Sacramento about drought planning.","zh":"ACWA 在萨克拉门托就干旱规划作证。"},{"en":"Many local water districts are members of ACWA.","zh":"许多地方水务局都是 ACWA 的成员。"}]},{"partOfSpeech":"other","definition":{"en":"(International) Arab Countries Water Utilities Association; a regional network for water and wastewater utilities in Arab countries.","zh":"（国际）阿拉伯国家水务公用事业协会；阿拉伯国家供水与污水处理机构的区域性网络组织。"},"examples":[{"en":"ACWA organized a training workshop on reducing water loss.","zh":"ACWA 组织了关于降低漏损的培训研讨会。"},{"en":"The utility joined ACWA to share best practices with other cities.","zh":"该公用事业单位加入 ACWA，与其他城市分享最佳实践。"}]}],"synonyms":["acronym","initialism"],"phonetic":"/ˈæk.wə/","extraExplanation":["“ACWA”最常见是组织名称的缩写，不同地区可能指不同机构。写作时通常第一次出现要写全称（full name），后面再用缩写（ACWA），以免读者误解。"]}
{"word":"Acworth","summary":{"en":"Acworth is most commonly a city name (especially Acworth, Georgia).","zh":"Acworth最常见用法是地名（尤其指美国乔治亚州的阿克沃思市）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun), most commonly referring to Acworth, a city in Georgia, USA (near Atlanta). It can also refer to other towns with the same name (e.g., in New Hampshire) or to a family name (surname).","zh":"地名（专有名词），最常指美国乔治亚州的阿克沃思市（靠近亚特兰大）。也可指同名的其他城镇（如新罕布什尔州）或用作姓氏。"},"examples":[{"en":"We stopped in Acworth on our way to Atlanta.","zh":"我们去亚特兰大的路上在阿克沃思停了一下。"},{"en":"She grew up in Acworth, Georgia, before moving out of state.","zh":"她在乔治亚州的阿克沃思长大，后来搬去了外州。"},{"en":"Acworth is a quiet town, but it gets busy during weekend events.","zh":"阿克沃思是个安静的小镇，但周末活动时会热闹起来。"}]}],"synonyms":["(no direct synonyms; it is a proper name)"],"phonetic":"/ˈæk.wɝθ/","extraExplanation":["“Acworth”通常作为专有名词使用，所以写作时要首字母大写。","在不同国家或州可能有多个同名地点；遇到“Acworth”时，可通过上下文（州名、附近大城市、邮编等）确认指的是哪一个。"]}
{"word":"ACWP","summary":{"en":"ACWP is a context-dependent abbreviation, typically pronounced by saying each letter.","zh":"ACWP是一个需要结合语境才能确定含义的缩写，通常按字母逐个读。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An initialism/abbreviation whose exact meaning depends on the field or document; it is usually read as the letters “A-C-W-P.”","zh":"一个首字母缩略词/缩写，具体含义取决于使用领域或文件；通常按字母读作“A-C-W-P”。"},"examples":[{"en":"In this memo, ACWP isn’t defined—can you tell me what ACWP stands for?","zh":"这份备忘录里没有解释ACWP——你能告诉我ACWP代表什么吗？"},{"en":"Different teams use ACWP differently, so we should spell it out the first time.","zh":"不同团队对ACWP的用法不一样，所以第一次出现时应该把全称写出来。"}]}],"synonyms":["initialism","abbreviation","acronym"],"phonetic":"/ˌeɪ siː ˌdʌbəl.juː ˈpiː/","extraExplanation":["ACWP不是一个通用、固定含义的英语单词，更像是某个行业或机构内部用的缩写。在英语写作里，缩写第一次出现通常需要写出全称（例如：Full Term (ACWP)）。如果你告诉我它出现的场景（比如项目管理、军队、医疗、软件、财务等）或给我一句原文，我可以帮你推断最可能的全称和含义。"]}

