{"word":"AH","summary":{"en":"“Ah” is a common interjection used to show realization, emotion (like pleasure or relief), or a thinking pause.","zh":"“Ah”是常见感叹词，可表示恍然大悟、各种情绪（如愉快/松口气），也可作思考时的停顿音。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"Used to show you suddenly understand or realize something (often after confusion).","zh":"（感叹词）表示突然明白、领悟（常用于从困惑到理解的瞬间）。"},"examples":[{"en":"Ah, I see what you mean now.","zh":"啊，我现在明白你的意思了。"},{"en":"Ah—so that’s why the bus is late.","zh":"啊——所以公交车才会晚点。"}]},{"partOfSpeech":"int.","definition":{"en":"Used to express a feeling such as pleasure, relief, surprise, or disappointment.","zh":"（感叹词）表示愉快、松一口气、惊讶或失望等情绪。"},"examples":[{"en":"Ah, this coffee is really good.","zh":"啊，这咖啡真好喝。"},{"en":"Ah, finally we’re home.","zh":"啊，终于到家了。"}]},{"partOfSpeech":"int.","definition":{"en":"Used as a pause sound when thinking, hesitating, or starting to speak.","zh":"（感叹词）用作停顿音，表示思考、犹豫或开口前的停顿。"},"examples":[{"en":"Ah… I’m not sure how to answer that.","zh":"啊……我不太确定该怎么回答。"},{"en":"Ah, let me check the schedule.","zh":"啊，我查一下时间表。"}]},{"partOfSpeech":"n.","definition":{"en":"The sound or written form of this interjection.","zh":"（名词）“ah”这一声/这个词本身（作为声音或书写形式）。"},"examples":[{"en":"He let out a long ah before speaking.","zh":"他说话前长长地“啊”了一声。"}]}],"synonyms":["oh","aha","well","hmm"],"phonetic":"/ɑ/","extraExplanation":["“Ah”在英语里非常常见，语气会随语境变化：拉长（aaah）常表示享受或放松；短促的“Ah!”更像“哦！”表示突然想起或明白。","写作中常用破折号或省略号表现停顿：Ah— / Ah… 。"]}
{"word":"Ah","summary":{"en":"“Ah” is an interjection used to show understanding/recognition, express feelings (pleasure or relief), or react with surprise or mild protest.","zh":"“Ah”是感叹词，可表示恍然大悟/认出，表达愉快或松一口气等情绪，也可用来表达惊讶或轻微抗议。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"Used to show you suddenly understand, recognize, or remember something.","zh":"（感叹词）表示突然明白、认出或想起某事。"},"examples":[{"en":"Ah, now I understand what you mean.","zh":"啊，我现在明白你的意思了。"},{"en":"Ah, you’re the new student! Nice to meet you.","zh":"啊，你就是新来的学生！很高兴认识你。"}]},{"partOfSpeech":"int.","definition":{"en":"Used to express a feeling such as pleasure, relief, satisfaction, or admiration.","zh":"（感叹词）表示愉快、松一口气、满足或赞叹等情绪。"},"examples":[{"en":"Ah, this tea is so relaxing.","zh":"啊，这茶真让人放松。"},{"en":"Ah, it feels good to sit down after a long walk.","zh":"啊，走了很久终于坐下来了，真舒服。"}]},{"partOfSpeech":"int.","definition":{"en":"Used to express surprise, disappointment, or a mild protest, depending on the tone.","zh":"（感叹词）根据语气可表示惊讶、失望或轻微的抗议。"},"examples":[{"en":"Ah! I didn’t expect to see you here.","zh":"啊！我没想到会在这里见到你。"},{"en":"Ah, come on—that’s not fair.","zh":"哎，别这样——这不公平。"}]}],"synonyms":["oh","aha","hey","wow"],"phonetic":"/ɑː/","extraExplanation":["“Ah”很依赖语气与场景：拉长音（Aah…）常表示放松/享受；短促（Ah!）更像惊讶或突然想起。","写作里常用“Ah,”来引出一种“顿悟/意识到”的语气；口语里也常和“oh”相近，但“ah”更偏“明白了/注意到了”的感觉。"]}
{"word":"ah","summary":{"en":"“Ah” is an interjection used to show understanding/realization, pleasure/relief, or hesitation while thinking.","zh":"“ah”是感叹词，可表示明白/恍然大悟、满意/松一口气，或犹豫思考。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"Used to show you understand, realize, or remember something.","zh":"（感叹词）用于表示“明白了 / 想起来了 / 恍然大悟”。"},"examples":[{"en":"Ah, now I understand what you mean.","zh":"啊，我现在明白你的意思了。"},{"en":"Ah, that’s where I left my keys!","zh":"啊，原来我把钥匙放在那儿了！"}]},{"partOfSpeech":"int.","definition":{"en":"Used to express pleasure, relief, or satisfaction.","zh":"（感叹词）用于表达“舒服、满意、松一口气”。"},"examples":[{"en":"Ah, this tea is perfect.","zh":"啊，这茶太棒了。"},{"en":"Ah, finally—we’re home.","zh":"啊，终于到家了。"}]},{"partOfSpeech":"int.","definition":{"en":"Used to show hesitation, uncertainty, or that you are thinking about what to say.","zh":"（感叹词）用于表示犹豫、不确定，或在想怎么说。"},"examples":[{"en":"Ah… I’m not sure that’s a good idea.","zh":"啊……我不太确定这是个好主意。"},{"en":"Ah, let me think for a second.","zh":"啊，让我想一下。"}]}],"synonyms":["oh","aha","eh"],"phonetic":"/ɑ/","extraExplanation":["“ah”很看语气：上扬常像“想起来了/明白了”，拉长（ahhh）常表示“舒服/放松”，停顿（ah…）常表示“犹豫/在想”。","和“aha”不同：“aha”更强调“抓到关键点/发现真相”的那种‘顿悟’，语气更强。"]}
{"word":"AHA","summary":{"en":"“Aha” expresses sudden understanding or discovery; it can also mean an “aha moment” (a flash of insight).","zh":"“aha”用于表示突然明白或发现了什么；也可作名词表示“顿悟/灵光一现”的时刻。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"Used to show that you suddenly understand or discover something (an “I get it!” moment).","zh":"（感叹词）表示突然明白或发现了某事，相当于“啊哈！我懂了！”"},"examples":[{"en":"Aha! Now I understand how this puzzle works.","zh":"啊哈！我现在明白这个谜题怎么玩了。"},{"en":"Aha—so that’s why the door was open.","zh":"啊哈——所以门开着就是这个原因。"}]},{"partOfSpeech":"n.","definition":{"en":"A sudden feeling or moment of understanding or insight.","zh":"（名词）顿悟；灵光一现；“啊哈时刻”。"},"examples":[{"en":"I had an aha moment when I reread the last paragraph.","zh":"我重读最后一段时突然顿悟了。"},{"en":"Good teachers create lots of aha moments for students.","zh":"好的老师会为学生创造很多“啊哈时刻”。"}]}],"synonyms":["I see","Now I get it","That’s it","Oh!","Eureka"],"phonetic":"/əˈhɑː/","extraExplanation":["“Aha”在英语里很口语、很形象，常用来表达“抓到重点了/发现真相了”。语气可以是积极的领悟，也可能带一点“我早就知道了”的得意或质疑，具体看上下文和语调。","写作中常见拼法有“aha”或“ah-ha”。如果想更正式，可以用“I see.” “Now I get it.” “That makes sense.” 来替换。"]}
{"word":"aha","summary":{"en":"“Aha” is an exclamation meaning “I suddenly understand/recognize something,” or “I’ve noticed something.”","zh":"“Aha”是表示“突然明白/认出来了”或“我注意到了”的感叹词。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"an exclamation used to show sudden understanding, recognition, or discovery (like “Oh, I see!”)","zh":"（感叹词）表示突然明白、认出或发现（相当于“哦，我懂了！”）"},"examples":[{"en":"Aha, now I understand what you mean.","zh":"啊哈，我现在明白你的意思了。"},{"en":"Aha! So you were the one who took my pen.","zh":"啊哈！所以拿走我笔的人是你。"}]},{"partOfSpeech":"int.","definition":{"en":"a short sound used to show you have noticed something interesting, surprising, or (sometimes) suspicious","zh":"（感叹词）表示注意到某件有趣、令人惊讶或（有时）可疑的事"},"examples":[{"en":"Aha—there’s the missing key!","zh":"啊哈——丢的钥匙在这儿！"},{"en":"Aha, that explanation doesn’t sound right.","zh":"啊哈，这个解释听起来不太对。"}]}],"synonyms":["oh","I see","got it","now I understand"],"phonetic":"/ɑˈhɑ/","extraExplanation":["“aha”在口语里很常见，语气取决于上下文：可以是友好的“我懂了”，也可能带一点“抓到了”的意味。写作时常用“Aha!”加感叹号来强调突然的发现或顿悟。","常见搭配：aha moment（顿悟时刻/灵光一现）。例如：I had an aha moment while studying English.（我学英语时突然开窍了。）"]}
{"word":"ahaaina","summary":{"en":"ʻAhaʻāina (often written “ahaaina”) is a Hawaiian word for a feast or celebratory gathering, especially one connected to ceremony and community.","zh":"ʻAhaʻāina（常写作 ahaaina）是夏威夷语，指宴会或庆祝聚会，常与仪式和社群凝聚有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Hawaiian) a feast or celebration, often held after a religious ceremony or important event.","zh":"（夏威夷语）宴会；庆典聚餐，常在宗教仪式或重要事件后举行。"},"examples":[{"en":"After the ceremony, the family hosted an ʻahaʻāina with food, music, and hula.","zh":"仪式结束后，家人举行了 ʻahaʻāina，用美食、音乐和草裙舞来庆祝。"},{"en":"The community prepared an ʻahaʻāina to honor the new canoe launch.","zh":"社区准备了一场 ʻahaʻāina 来庆祝新独木舟下水。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension) a gathering centered on sharing food and strengthening community ties.","zh":"（引申）以共享食物、凝聚社群关系为核心的聚会。"},"examples":[{"en":"The school organized an ʻahaʻāina to welcome new students and families.","zh":"学校组织了一场 ʻahaʻāina，欢迎新生和他们的家庭。"}]}],"synonyms":["feast","banquet","celebration","community gathering"],"phonetic":"/ˌɑːhəˈaɪnə/","extraExplanation":["“ʻahaʻāina”来自夏威夷语：ʻaha 可指“聚集/会议”，ʻāina 指“土地、家园”。这个词常与传统礼仪和款待文化有关，强调人与人、人与土地之间的连结。","你写的“ahaaina”通常是把夏威夷语中的 ʻokina（ʻ，喉塞音符号）省略后的拼写；在正式场合更常见写作“ʻahaʻāina”。"]}
{"word":"Ahab","summary":{"en":"Ahab is a name known from the Bible (a king of Israel) and from literature as Captain Ahab in *Moby-Dick*, symbolizing obsession and destructive pursuit.","zh":"Ahab 是一个名字，主要联想到《圣经》中的以色列国王亚哈，以及《白鲸记》里的亚哈船长，常象征执念与具有毁灭性的追逐。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A male name best known from the Bible: Ahab was a king of ancient Israel, often remembered as a wicked ruler in biblical stories.","zh":"一个男性名字，最出名的来源是《圣经》：亚哈（Ahab）是古代以色列的一位国王，在《圣经》叙事中常被记为邪恶的统治者。"},"examples":[{"en":"In the Bible, Ahab is criticized for idolatry and injustice.","zh":"在《圣经》中，亚哈因崇拜偶像和不公正而受到批评。"},{"en":"The story of Ahab is often taught as a warning about abuse of power.","zh":"亚哈的故事常被用来警示人们不要滥用权力。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literature) Captain Ahab, the obsessed whaling captain in Herman Melville’s novel *Moby-Dick*, famous for his relentless pursuit of a white whale.","zh":"（文学）《白鲸记》（*Moby-Dick*）中的亚哈船长：赫尔曼·梅尔维尔小说里痴迷复仇的捕鲸船长，以不顾一切追逐白鲸而闻名。"},"examples":[{"en":"Captain Ahab’s obsession drives the plot of *Moby-Dick*.","zh":"亚哈船长的执念推动了《白鲸记》的情节发展。"},{"en":"People sometimes call a single-minded leader “an Ahab.”","zh":"人们有时会把一意孤行、被目标“吞噬”的领导者称作“亚哈式人物”。"}]}],"synonyms":["Captain Ahab"],"phonetic":"/ˈeɪ.hæb/","extraExplanation":["“Ahab”在英语文化中常带有强烈联想：一方面是《圣经》里“邪恶君王”的形象；另一方面是《白鲸记》中“被执念驱使、走向毁灭”的象征。因此在写作或评论里，提到“Ahab”常用于暗示权力的腐化或痴迷的危险。","文学引用：梅尔维尔的《白鲸记》（1851）让“Captain Ahab”成为英语世界里非常经典的人物原型。你在影评、书评里看到“an Ahab-like obsession（亚哈式的执念）”通常就是指这种极端执着。"]}
{"word":"ahab","summary":{"en":"Ahab is a name best known as (1) a biblical king of Israel and (2) Captain Ahab in Moby-Dick; by extension, it can mean someone dangerously obsessed with a goal.","zh":"Ahab（亚哈）最常指（1）《圣经》中以色列王亚哈，以及（2）《白鲸记》中的亚哈船长；引申可指对目标有危险执念的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Bible) A king of ancient Israel (9th century BCE), often remembered for his marriage to Jezebel and for stories involving the prophet Elijah.","zh":"（《圣经》）古以色列的一位国王（公元前9世纪），常因迎娶耶洗别以及与先知以利亚相关的故事而为人所知。"},"examples":[{"en":"In the Bible, Ahab is criticized for allowing idol worship in Israel.","zh":"在《圣经》中，亚哈常因纵容以色列的偶像崇拜而受到批评。"},{"en":"The story of Elijah and Ahab is often read as a warning about power and wrongdoing.","zh":"以利亚与亚哈的故事常被解读为对权力与作恶的警示。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literature) Captain Ahab, the obsessed whaling captain in Herman Melville’s novel Moby-Dick, who hunts a white whale at any cost.","zh":"（文学）《白鲸记》（Moby-Dick）中执念极深的捕鲸船长亚哈，为追猎白鲸不惜一切代价。"},"examples":[{"en":"Captain Ahab’s obsession drives the plot of Moby-Dick.","zh":"亚哈船长的执念推动了《白鲸记》的剧情发展。"},{"en":"Some readers see Ahab as a symbol of self-destructive ambition.","zh":"一些读者认为亚哈象征着自我毁灭式的野心。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who obsessively pursues a goal, often in a way that becomes harmful or extreme (a figurative use based on Moby-Dick).","zh":"（引申义）指对目标执念追逐的人，常带有走向极端或造成伤害的意味（源自《白鲸记》中的形象）。"},"examples":[{"en":"He became an Ahab in his search for the truth, ignoring his health and family.","zh":"他在追寻真相时变成了“亚哈式的人”，忽视了健康与家庭。"},{"en":"Don’t turn into Ahab—take breaks and keep your goals realistic.","zh":"别变成“亚哈”那样的人——适当休息，把目标设得更现实些。"}]}],"synonyms":["obsessive pursuer","monomaniac (literary)","revenge-driven person"],"phonetic":"/ˈeɪhæb/","extraExplanation":["“Ahab”既是《圣经》人物名，也是英语文化中很常见的文学典故名。英语里把某人称作“an Ahab”，通常不是中性称呼，而是强调“执念/复仇心过重、为目标不惜代价”的危险倾向。","发音在英语中常见重音在第一音节（AY-hab）。在写作里若用作比喻，通常前面会加不定冠词：“an Ahab”。"]}
{"word":"Ahab-like","summary":{"en":"Ahab-like means obsessively determined, often to a dangerous or self-destructive degree—like Captain Ahab in *Moby-Dick*.","zh":"Ahab-like 指像《白鲸记》亚哈船长那样带有强烈执念、近乎偏执的追求，常伴随危险或自我毁灭的倾向。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having an obsessive, driven, and often self-destructive determination—especially a fixation on revenge or on pursuing a single goal at any cost (from Captain Ahab in *Moby-Dick*).","zh":"像《白鲸记》中亚哈船长那样的：执念强烈、近乎偏执，常带有复仇心或为达单一目标不惜代价（甚至自我毁灭）的。"},"examples":[{"en":"His Ahab-like pursuit of the thief cost him his job and his family.","zh":"他像亚哈一样执着地追捕那个小偷，最终丢了工作也失去了家庭。"},{"en":"The novel portrays an Ahab-like leader who cannot let go of a past defeat.","zh":"这部小说刻画了一位“亚哈式”的领导者，始终放不下一次过去的失败。"}]}],"synonyms":["obsessive","monomaniacal","single-minded","fanatical","vengeful"],"phonetic":"/ˈeɪˌhæb laɪk/","extraExplanation":["“Ahab-like”源自赫尔曼·梅尔维尔（Herman Melville）的小说《白鲸记》（*Moby-Dick*）。亚哈船长因对白鲸的复仇与追猎而陷入“单一目标支配一切”的状态，因此这个形容词常带有负面含义：执念、偏执、失去理性与代价意识。","在写作中它常用来评价人物动机或叙事主题（如“复仇”“执念”“自我毁灭”），多用于较正式或文学化的语境。"]}
{"word":"ahamkara","summary":{"en":"Ahamkara is a Sanskrit term meaning the ego or “I-maker,” the sense of “I/me” that claims experiences as “mine.”","zh":"Ahamkara 是梵语词，指自我/我执（“造我者”）：把经验认作“我/我的”的那种自我感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Indian philosophy, especially Sāṃkhya and Yoga) the sense of “I” or ego—the mental function that identifies experiences as “mine” and builds a personal identity.","zh":"（印度哲学，尤指数论与瑜伽中）“我”的意识或自我/小我（ego）——把经验认作“属于我”的心理作用，用来建立个人身份认同。"},"examples":[{"en":"Meditation practices often aim to observe ahamkara without letting it control your actions.","zh":"冥想练习常常旨在观察 ahamkara，而不让它主导你的行为。"},{"en":"In Yoga philosophy, ahamkara is the “I-maker” that turns thoughts and sensations into a story about “me.”","zh":"在瑜伽哲学里，ahamkara 被称为“造我者”，它把念头与感受编织成关于“我”的故事。"}]}],"synonyms":["ego","I-ness","self-sense","ego identity"],"phonetic":"əˈhʌm.kə.rə","extraExplanation":["“Ahamkara”来自梵语：aham（我）+ kāra（制造/造成），常被译为“我执”“自我感”“我慢”。在英文语境中，它通常指“身份化的自我”（the egoic sense of self），不一定等同于日常说的自信（confidence）。","在数论/瑜伽体系里，ahamkara常与manas（意/心的处理）、buddhi（觉知/辨别力）等一起讨论；它的作用是把经验贴上“我/我的”标签，因此在修行语境中常被视为痛苦与执著的来源之一。"]}
{"word":"ahankara","summary":{"en":"Ahankara is a Sanskrit-derived term meaning the ego or “I-sense,” especially in Hindu/yogic philosophy; it can also mean excessive pride in spiritual writing.","zh":"Ahankara 源自梵语，主要指“我执/自我意识”（哲学语境），在一些灵性写作中也可指“自大/自我中心”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Hindu and yogic philosophy) the sense of “I” or ego—the feeling that experiences, thoughts, and actions belong to a separate self.","zh":"（印度教与瑜伽哲学中）“我执/我慢/自我意识”：把经验、想法与行为都归属于一个独立自我的感觉。"},"examples":[{"en":"In yoga philosophy, ahankara is the “I-maker” that turns experience into “my” experience.","zh":"在瑜伽哲学里，ahankara 被称为“造我者”，把经验变成“我的”经验。"},{"en":"Meditation practice may help you notice ahankara without letting it control your choices.","zh":"冥想练习可能帮助你看见 ahankara，但不让它控制你的选择。"},{"en":"The teacher described ahankara as a useful tool for daily life, but a problem when it becomes rigid.","zh":"老师把 ahankara 描述为日常生活中有用的工具，但当它变得僵化时就会带来问题。"}]},{"partOfSpeech":"n.","definition":{"en":"In everyday English use (often in spiritual writing), excessive pride or self-importance; egoism.","zh":"（日常英语用法，常见于灵性写作）自大、自我重要感过强；利己的“自我中心”。"},"examples":[{"en":"His ahankara wouldn’t let him admit he was wrong.","zh":"他的 ahankara 让他不肯承认自己错了。"},{"en":"She tried to speak kindly, without ahankara.","zh":"她尽量不带着自我优越感（ahankara）去说话。"}]}],"synonyms":["ego","I-sense","self-importance","pride","egoism"],"phonetic":"/ˌɑːhʌnˈkɑːrə/","extraExplanation":["词源与拼写：来自梵语 ahaṅkāra（常写作 ahamkāra/ahaṃkāra），由 aham（“我”）+ kāra（“制造/造成”）构成，因此常被解释为“造我者（I-maker）”。","思想背景（简要）：在数论派（Sāṃkhya）与瑜伽体系里，ahankara 是心识运作的一部分，负责把“觉知到的内容”贴上“我/我的”的标签；它不一定是“坏的”，但若过度执着，会带来痛苦与分别。","使用提醒：英语里它多出现在瑜伽、冥想、印度哲学相关语境；一般日常对话更常说 ego。","相关词：ego（自我/自我中心）、self-concept（自我概念）、pride（骄傲）、self-importance（自我重要感）。"]}
{"word":"Ahantchuyuk","summary":{"en":"“Ahantchuyuk” is not a standard English word; it is likely a proper name or a transliteration from another language.","zh":"“Ahantchuyuk”不是标准英语词汇；更可能是专名或来自其他语言的音译/转写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A name or transliterated term that is not recognized as a standard English word; it may be a proper noun (such as a person’s name, a place name, or a word from another language).","zh":"一个不属于标准英语词汇的名字或音译词；可能是专有名词（如人名、地名）或来自其他语言的词。"},"examples":[{"en":"I saw the name “Ahantchuyuk” in a document, but it wasn’t explained.","zh":"我在一份文件里看到“Ahantchuyuk”这个名字，但没有解释。"},{"en":"Can you tell me where “Ahantchuyuk” comes from—what language or culture?","zh":"你能告诉我“Ahantchuyuk”来自哪里吗——属于哪种语言或文化？"}]}],"phonetic":"/ɑːˈhɑːntʃuːjʊk/","extraExplanation":["“Ahantchuyuk”看起来更像音译/拼写转写的专名，而不是英语常见词条。仅凭这个拼写，很难可靠地判断它的来源语言、含义或正确读音。","如果你能提供它出现的语境（例如：哪本书/哪份地图/哪个地区、是否是人名或地名、原文拼写或相关句子），我可以更准确地帮你查含义、背景与更接近原语的发音。"]}
{"word":"ahantchuyuk","summary":{"en":"“ahantchuyuk” is not recognized as a standard English word; it may be a misspelling or a non-English term.","zh":"“ahantchuyuk”不被识别为标准英语单词；可能是拼写错误或非英语词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling, username, or a word from another language written in Latin letters.","zh":"不是标准英语单词；可能是拼写错误、用户名/昵称，或是其他语言用拉丁字母写出来的词。"},"examples":[{"en":"I can’t find “ahantchuyuk” in an English dictionary—could you tell me where you saw it?","zh":"我在英语词典里找不到“ahantchuyuk”——你能告诉我你是在哪里看到的吗？"},{"en":"If you meant a different spelling, please type it again or share the full sentence.","zh":"如果你想写的是另一个拼法，请再输入一次或把完整句子发我。"}]}],"extraExplanation":["“ahantchuyuk”看起来不像常见英语词汇，也不像常见的英语构词（前后缀）组合。为了帮你准确查词，请你补充：1）它出现的完整句子/上下文；2）是哪种语言或哪本书/网站看到的；3）你是否想输入类似的英文词（例如拼写接近的单词）。我拿到上下文后可以判断它是否是专有名词、音译词，或帮你找到最可能的正确拼写与含义。"]}
{"word":"Aharon","summary":{"en":"Aharon is a Hebrew male given name; it’s the Hebrew form of Aaron.","zh":"Aharon 是希伯来语男性名字，相当于英文名 Aaron（亚伦）的希伯来语形式。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A male given name (Hebrew: אַהֲרֹן), commonly used in Jewish and Israeli contexts; the Hebrew form of the name Aaron.","zh":"男性名字（希伯来语：אַהֲרֹן），常见于犹太/以色列语境；相当于英文名 Aaron 的希伯来语形式。"},"examples":[{"en":"Aharon is a common first name in Israel.","zh":"Aharon 是以色列很常见的名字。"},{"en":"In the Bible, Aharon (Aaron) is Moses’s brother.","zh":"在《圣经》中，Aharon（Aaron）是摩西的兄弟。"}]}],"synonyms":["Aaron"],"phonetic":"/ˈɑːhəˌrɑːn/","extraExplanation":["Aharon 是希伯来语名字，英语里最常见的对应拼写是 Aaron（亚伦）。在《希伯来圣经/旧约》中，亚伦是摩西的哥哥（或兄弟）并担任以色列人的首任大祭司，因此这个名字在犹太文化中很有分量。","跨语言常见变体：英语 Aaron；现代希伯来语 Aharon；阿拉伯语中常见对应名为 Hārūn/Harun（哈伦）。不同拼写通常反映不同语言与音译习惯。"]}
{"word":"ahartalav","summary":{"en":"“ahartalav” is not a recognized English word; it may be a misspelling or a proper name. Provide context and I can identify it.","zh":"“ahartalav”不是常见英语词，可能是拼写错误或专有名词。给我上下文我就能帮你确认。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a proper name, or a word from another language.","zh":"不是标准英语单词。可能是拼写错误、专有名词（人名/地名/品牌），或来自其他语言的词。"},"examples":[{"en":"I can’t find “ahartalav” in an English dictionary—could you check the spelling or tell me the context?","zh":"我在英语词典里找不到“ahartalav”——你能确认拼写或提供使用语境吗？"},{"en":"If you meant “hartal,” it refers to a strike or shutdown in South Asia.","zh":"如果你想写的是“hartal”，它在南亚语境中指“罢市/停工/大规模停摆”。"}]}],"extraExplanation":["“ahartalav”看起来不像英语构词模式，比较像：\n1）把两个词连在一起（如 a + hartal + …）；\n2）从其他语言（尤其是南亚语言的转写）来的词；\n3）人名/地名/账号名。\n如果你能提供：出现在哪（文章/歌曲/游戏/对话）、前后一句、或你想表达的意思（中文也可以），我可以更准确地判断并给出对应释义。","关于你可能想找的相近词：\n- hartal（n.）：南亚常见用语，指号召商店关门、交通停运等形式的集体“罢市/停摆”，常与政治抗议有关。\n- heart / heartfelt：如果你的拼写本来想表达“心、真诚的”，也可能误键。"]}
{"word":"Ahasuerus","summary":{"en":"Ahasuerus is (1) the Persian king in the Book of Esther and (2) a later legendary name for the “Wandering Jew.”","zh":"Ahasuerus（亚哈随鲁）既指《以斯帖记》中的波斯王，也可指后世传说中的“流浪的犹太人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A king of Persia in the Hebrew Bible (especially in the Book of Esther), often identified with Xerxes I.","zh":"《希伯来圣经》（尤其《以斯帖记》）中的波斯王，常被认为对应历史上的薛西斯一世（Xerxes I）。"},"examples":[{"en":"In the Book of Esther, Queen Esther is married to King Ahasuerus.","zh":"在《以斯帖记》中，以斯帖王后嫁给了亚哈随鲁王。"},{"en":"Some historians link Ahasuerus to the Persian ruler Xerxes I.","zh":"一些历史学者把“亚哈随鲁”与波斯统治者薛西斯一世联系起来。"}]},{"partOfSpeech":"n.","definition":{"en":"In European legend, another name for the “Wandering Jew,” a figure condemned to wander endlessly.","zh":"在欧洲传说中，“流浪的犹太人”（Wandering Jew）的别名之一，指被诅咒而永远漂泊的人物。"},"examples":[{"en":"In later literature, Ahasuerus appears as a symbol of endless wandering and guilt.","zh":"在后来的文学里，“亚哈随鲁”常被用作无尽漂泊与罪责感的象征。"},{"en":"The poem portrays Ahasuerus as a restless traveler who can never settle down.","zh":"这首诗把亚哈随鲁描写成一个永远无法安定下来的漂泊者。"}]}],"synonyms":["Xerxes (often identified)","the Wandering Jew (legendary figure)"],"phonetic":"/əˌhæʒuˈɪrəs/","extraExplanation":["“Ahasuerus”是一个跨语言的名字形式：它通过希伯来语/拉丁语传统进入英语，用来指代《以斯帖记》里的波斯王。不同译本中文常译作“亚哈随鲁”。","“流浪的犹太人”传说主要流行于中世纪到近代欧洲文学与民间故事中，把“Ahasuerus”当作角色名并非源自《圣经》原故事，而是后世文化再创造；在文学中常象征流亡、惩罚或永恒的时间。"]}
{"word":"ahaunch","summary":{"en":"“Haunch” means the hip/buttock area (or a cut of meat from the upper leg), and it can also mean to crouch on the back legs.","zh":"“Haunch”指臀髋/后腿根部（也可指该部位的肉），也可作动词表示蹲坐在后腿上。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the hip and buttock area of a person or animal; the upper part of the leg where it joins the body","zh":"（人或动物的）臀部与髋部；大腿与身体连接的部位"},"examples":[{"en":"The dog sat back on its haunches and waited.","zh":"那只狗坐在后腿上，等待着。"},{"en":"He slipped on the ice and landed on his haunch.","zh":"他在冰上滑倒，摔在臀部上。"}]},{"partOfSpeech":"n.","definition":{"en":"a cut of meat from the upper leg/hip of an animal (often a deer or sheep)","zh":"（常指鹿、羊等的）后腿肉；臀腿部位的肉"},"examples":[{"en":"They roasted a haunch of lamb for dinner.","zh":"他们晚餐烤了一条羊腿。"},{"en":"A haunch of venison was served with herbs.","zh":"端上来一份香草鹿腿肉。"}]},{"partOfSpeech":"v.","definition":{"en":"to crouch or sit on the back legs, with knees bent (usually of an animal, sometimes a person)","zh":"（使）蹲坐在后腿上；屈膝蹲下（多指动物，有时也指人）"},"examples":[{"en":"The cat haunched down, ready to pounce.","zh":"那只猫蹲伏下来，准备扑过去。"},{"en":"He haunched beside the fire to warm his hands.","zh":"他在火边蹲下取暖。"}]}],"synonyms":["hip","buttock","hindquarter","thigh","crouch"],"phonetic":"/hɔntʃ/","extraExplanation":["你输入的“ahaunch”更常见的写法是分开的“a haunch”（一个臀部/一条腿肉）。单独写成“ahaunch”通常被当作拼写错误或非常少见的变体。","常见搭配：sit on your haunches（蹲着/坐在后腿上）、a haunch of lamb/venison（羊腿/鹿腿肉）。在英美文化中，haunch of venison 常出现在描写狩猎或宴席的文学与历史场景里。"]}
{"word":"Ahaz","summary":{"en":"Ahaz is best known as the biblical King of Judah; it is also used as a rare male given name.","zh":"Ahaz 最常指《圣经》中的犹大王亚哈斯，也可作较少见的男性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A king of Judah (in the Hebrew Bible/Old Testament), traditionally dated to the 8th century BCE and known for political alliances with Assyria.","zh":"（《希伯来圣经》/《旧约》中的）犹大王亚哈斯，传统上在公元前8世纪在位，以与亚述结盟等政治举措而知名。"},"examples":[{"en":"Ahaz is mentioned in the Bible as a king of Judah during a time of regional conflict.","zh":"《圣经》中提到亚哈斯是犹大的一位君王，当时地区冲突不断。"},{"en":"In some history or religion classes, students read about Ahaz and his alliance with Assyria.","zh":"在一些历史或宗教课程中，学生会读到亚哈斯以及他与亚述的结盟。"}]},{"partOfSpeech":"n.","definition":{"en":"A male given name, usually used in religious or historical contexts (from the biblical figure).","zh":"男性名字，多见于宗教或历史语境（源自《圣经》人物）。"},"examples":[{"en":"His parents chose the name Ahaz because of its biblical origin.","zh":"他的父母因为这个名字有《圣经》渊源而取名为 Ahaz。"},{"en":"Ahaz is uncommon as a modern first name but still appears in some communities.","zh":"Ahaz 作为现代名字并不常见，但在一些社群中仍会出现。"}]}],"synonyms":["King Ahaz","Ahaz of Judah"],"phonetic":"/ˈeɪhæz/","extraExplanation":["“Ahaz”常见于《列王纪下》（2 Kings）和《历代志下》（2 Chronicles），也出现在《以赛亚书》（Isaiah）的相关背景中。阅读宗教/历史文本时看到该名字，多半指这位犹大王。","英语里读作 /ˈeɪhæz/，重音在第一音节；中文常译作“亚哈斯”。不同译本或学术写作中偶见拼写或译名差异，但指代通常一致。"]}
{"word":"Ahaziah","summary":{"en":"Ahaziah is a biblical proper name, especially the name of two Old Testament kings.","zh":"Ahaziah 是一个《圣经》中的专有名词，尤指《旧约》里两位国王的名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name from the Bible, borne by two kings (one of Israel and one of Judah) in the Old Testament.","zh":"一个源自《圣经》的男性名字；《旧约》中有两位国王使用此名（以色列王与犹大王各一位）。"},"examples":[{"en":"Ahaziah is mentioned in the Old Testament as a king who ruled for a short time.","zh":"《旧约》中提到亚哈谢为一位在位时间很短的国王。"},{"en":"In Bible study, students sometimes confuse Ahaziah with Ahaz because the names look similar.","zh":"在圣经学习中，学生有时会把 Ahaziah 和 Ahaz 混淆，因为名字看起来很像。"}]}],"phonetic":"/ˌæhəˈzaɪə/","extraExplanation":["“Ahaziah”来自希伯来语名字（常被解释为“耶和华已经扶持/持守”之类的含义）。不同译本可能出现不同拼写或音译（如中文常译作“亚哈谢”）。","这是专有名词，通常大写；在阅读宗教或历史文本时，理解其所指人物（以色列王或犹大王）要结合上下文与家谱/年代线。"]}
{"word":"ahchoo","summary":{"en":"“Ahchoo” is an exclamation or written sound effect that represents a sneeze.","zh":"“ahchoo”是表示打喷嚏声音的感叹词或文字音效写法。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"An exclamation used to represent the sound of a sneeze (often written when someone sneezes).","zh":"（拟声词）表示打喷嚏的声音；常用来写出或模仿喷嚏声。"},"examples":[{"en":"Achoo! I think I'm allergic to cats.","zh":"阿嚏！我可能对猫过敏。"},{"en":"He sneezed—“ahchoo!”—and reached for a tissue.","zh":"他打了个喷嚏——“阿嚏！”——然后去拿纸巾。"}]},{"partOfSpeech":"other","definition":{"en":"A written sound effect for a sneeze, especially in comics, captions, or informal writing.","zh":"（文字音效）尤其在漫画、字幕或非正式写作中表示“喷嚏”的音效写法。"},"examples":[{"en":"In the comic strip, the bubble says “AHCHOO!” in big letters.","zh":"在那条漫画里，气泡里用大字写着“AHCHOO!”。"},{"en":"Her message was: “ahchoo… sorry, dust everywhere.”","zh":"她发的消息是：“ahchoo……抱歉，到处都是灰尘。”"}]}],"synonyms":["achoo","a-choo","atchoo","ka-choo"],"phonetic":"/əˈtʃuː/","extraExplanation":["“ahchoo / achoo”是英语里常见的拟声写法，不算正式词汇；拼写有很多变体：achoo, a-choo, atchoo, ka-choo 等，用来表达不同人的喷嚏声感觉。","在英语文化中，有人打喷嚏时旁人常说 “Bless you.”（祝福你/保佑你），打喷嚏的人可能回 “Thank you.”。"]}
{"word":"Ahders","summary":{"en":"“Others” means “other people” or “the remaining ones.”","zh":"“Others” 表示“其他人”或“其余的那些”。"},"definitions":[{"partOfSpeech":"pron.","definition":{"en":"people besides the ones already mentioned; the rest of the people","zh":"除已提到的人以外的其他人；别人"},"examples":[{"en":"Some people like coffee; others prefer tea.","zh":"有些人喜欢咖啡；其他人更喜欢茶。"},{"en":"Think about how your words affect others.","zh":"想想你的话会怎样影响别人。"}]},{"partOfSpeech":"pron.","definition":{"en":"other things or the remaining ones","zh":"其他事物；剩下的那些"},"examples":[{"en":"I’ll take this book and look at the others later.","zh":"我先拿这本书，其他的以后再看。"},{"en":"Two answers are correct; the others are wrong.","zh":"两个答案是对的；其他的是错的。"}]}],"synonyms":["the rest","the remaining ones","other people"],"phonetic":"/ˈʌðərz/","extraExplanation":["“Ahders” 不是常见的英语拼写。我推测你想查的是 “others”（others = other 的复数/代词用法）。如果你原本想输入人名（如 Anders）或别的词，请告诉我上下文句子，我可以更准确地解释。"]}
{"word":"AHE","summary":{"en":"AHE can be an archaic interjection used to urge a horse, or an acronym whose meaning depends on context.","zh":"AHE 既可指古用的催马喊声，也常作为缩写使用，具体含义需看语境。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"An old-fashioned cry used to urge a horse (similar to “giddy-up”).","zh":"（古用）吆喝马前进的喊声，类似“驾！”"},"examples":[{"en":"Ahe! The rider called, and the horse moved forward.","zh":"“Ahe！”骑手喊道，马就向前走了。"},{"en":"In old stories, you may see “ahe” used to urge a horse on.","zh":"在一些老故事里，你可能会看到用“ahe”来催马前进。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation/acronym used for different organizations or phrases; the exact meaning depends on context.","zh":"缩写/首字母缩略词；具体含义取决于语境。"},"examples":[{"en":"What does AHE stand for in this document?","zh":"在这份文件里，AHE 代表什么？"},{"en":"Please define AHE the first time you use it in a report.","zh":"在报告中第一次使用 AHE 时请先写出全称。"}]}],"synonyms":["giddy-up","get up","hup"],"phonetic":"/ɑːˈheɪ/","extraExplanation":["“ahe”作为催马的喊声在现代英语中很少见，更常出现在古典文学、民间故事或仿古风格的文本里。","如果你看到全大写“AHE”，通常更可能是缩写。常见做法是查看上下文（例如教育、医疗、工程、学术机构名称等），或在文档中寻找第一次出现时给出的全称。"]}
{"word":"ahead","summary":{"en":"Ahead means “in front,” “in the future,” “leading,” or “in advance,” depending on context.","zh":"Ahead 可表示“在前面/向前”“将来/接下来”“领先”“提前/预先”，具体看语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in or toward the front; in the direction you are facing.","zh":"在前面；向前；朝着你面对的方向。"},"examples":[{"en":"Walk straight ahead for two blocks.","zh":"一直往前走两个街区。"},{"en":"The road ahead is closed.","zh":"前面的路封了。"}]},{"partOfSpeech":"adv.","definition":{"en":"in the future; at a later time.","zh":"将来；以后；之后。"},"examples":[{"en":"We have a busy week ahead.","zh":"我们接下来会有一个忙碌的一周。"},{"en":"Looking ahead, we need to save more money.","zh":"展望未来，我们需要多存点钱。"}]},{"partOfSpeech":"adj.","definition":{"en":"leading or in a better position than others; winning or more advanced.","zh":"领先的；占优势的；更先进的。"},"examples":[{"en":"Our team is three points ahead.","zh":"我们队领先三分。"},{"en":"She’s ahead of schedule.","zh":"她比计划进度更快。"}]},{"partOfSpeech":"adv.","definition":{"en":"in advance; before a particular time or event.","zh":"提前；预先。"},"examples":[{"en":"Please call ahead to make a reservation.","zh":"请提前打电话预订。"},{"en":"I sent the documents ahead of the meeting.","zh":"我在会议前把文件先发过去了。"}]}],"synonyms":["forward","in front","in advance","beforehand","in the lead","leading"],"phonetic":"/əˈhɛd/","extraExplanation":["“ahead”常和固定搭配一起出现：\n1) ahead of（在……前面/领先/早于）：ahead of me（在我前面）、ahead of schedule（提前）、ahead of its time（超前）。\n2) go ahead（继续/请便/可以开始）：Go ahead, ask your question.（你问吧。）\n3) look ahead（向前看/展望未来）：Look ahead to next year.（展望明年。）\n语感提示：表示空间方向时多译“往前/前面”；表示时间或计划时多译“接下来/提前”；表示比较时多译“领先”。"]}
{"word":"ahead-of-time","summary":{"en":"“Ahead of time” means before the expected time, or prepared in advance.","zh":"“ahead of time”表示“提前”或“事先准备好”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Before the expected time; earlier than planned or required.","zh":"提前；在预定时间之前。"},"examples":[{"en":"Please submit the report ahead of time so I can review it.","zh":"请提前提交报告，这样我可以先审核。"},{"en":"We arrived at the airport ahead of time to avoid stress.","zh":"我们提前到达机场，以免紧张。"},{"en":"Let me know ahead of time if you can’t make it.","zh":"如果你来不了，请提前告诉我。"}]},{"partOfSpeech":"phrase","definition":{"en":"Prepared in advance; done earlier so it is ready when needed.","zh":"事先准备好；预先完成以便需要时可用。"},"examples":[{"en":"Cooking some meals ahead of time saves money and time during the week.","zh":"提前做一些饭菜能在工作日省钱省时间。"},{"en":"She planned her questions ahead of time for the interview.","zh":"她为了面试事先准备了问题。"}]}],"synonyms":["in advance","early","beforehand","prior to","preemptively"],"phonetic":"/əˌhɛd əv ˈtaɪm/","extraExplanation":["“ahead of time”常作副词短语，放在句首或句末都自然：Ahead of time, … / … ahead of time。","连字符“ahead-of-time”多用于作定语时（放在名词前）以避免歧义：ahead-of-time planning（事先的规划）。日常写作中，不作定语时通常写作不带连字符的“ahead of time”。","语气通常中性偏积极，常用于工作沟通、出行安排、礼貌提醒（提前告知/提前准备）。"]}
{"word":"ahead-of-trip","summary":{"en":"“Ahead of the trip” means “before the trip,” often when talking about planning or preparation.","zh":"“Ahead of the trip”表示“在旅行之前”，常用于描述出发前的计划或准备。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"before a trip; in the time leading up to a trip (often used when planning or preparing).","zh":"在旅行之前；在出发前的一段时间（常用于计划或准备时）。"},"examples":[{"en":"I like to pack ahead of the trip so I don’t feel rushed.","zh":"我喜欢在旅行前就把行李打包好，这样就不会很匆忙。"},{"en":"Ahead of the trip, we checked the weather and booked a hotel.","zh":"在旅行之前，我们查看了天气并预订了酒店。"},{"en":"She renewed her passport ahead of the trip to Japan.","zh":"她在去日本旅行前更新了护照。"}]}],"synonyms":["before the trip","prior to the trip","in advance of the trip","pre-trip"],"phonetic":"əˈhɛd əv trɪp","extraExplanation":["更自然的写法通常是不加连字符：ahead of the trip。连字符（ahead-of-trip）多见于把它当作“定语”放在名词前时，但英语里这种结构并不常见，通常会改写为：pre-trip（旅行前的）或 before the trip（在旅行之前）。例如：pre-trip checklist（出发前清单）比 ahead-of-trip checklist 更地道。","表达“提前”时也常用 in advance（提前）或 beforehand（事先）。例如：Book tickets in advance（提前订票）。"]}
{"word":"aheap","summary":{"en":"“aheap” means “in a heap; piled together,” and is a more old-fashioned/literary spelling of “a heap.”","zh":"“aheap”意为“成堆地；堆在一起”，是较旧/文学化的写法，现代更常写作“a heap”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Usually written as “a heap”) In a pile; piled up together.","zh":"（常写作 a heap）成堆地；堆在一起。"},"examples":[{"en":"After the storm, the leaves lay aheap in the corner of the yard.","zh":"暴风雨过后，树叶成堆地堆在院子角落里。"},{"en":"The books were thrown aheap on the floor.","zh":"书被扔得满地成堆。"}]}],"synonyms":["in a heap","in piles","piled up","heaped up","in a pile"],"phonetic":"/əˈhip/","extraExplanation":["“aheap”带有较旧/文学化的味道，现代英语更常写成两词“a heap”，也常直接用形容词/副词如“in a heap”“in piles”“piled up”。","它常出现在叙述性文字里，用来营造画面感：东西“乱成一堆”“堆在一起”，语气比普通的“in a pile”更有文学色彩。"]}
{"word":"Ahearn","summary":{"en":"Ahearn is a surname, commonly associated with Irish heritage.","zh":"Ahearn 是一个姓氏，常与爱尔兰血统相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A family name (surname), most often of Irish origin; used to refer to a person with this last name.","zh":"一个姓氏（家族姓），多见于爱尔兰来源；用于指代姓为 Ahearn 的人。"},"examples":[{"en":"Ms. Ahearn will lead today’s meeting.","zh":"Ahearn 女士将主持今天的会议。"},{"en":"I emailed Dr. Ahearn about the assignment.","zh":"我给 Ahearn 博士发了邮件询问作业。"},{"en":"Ahearn is a common Irish surname in some communities.","zh":"在一些社区里，Ahearn 是较常见的爱尔兰姓氏。"}]}],"phonetic":"əˈhɝn","extraExplanation":["Ahearn 通常被认为是爱尔兰姓氏的英语拼写形式之一，常见于爱尔兰移民后裔群体中。作为姓氏使用时，一般首字母大写（Ahearn）。在正式场合可与头衔连用，如 Ms./Mr./Dr. Ahearn。"]}
{"word":"aheight","summary":{"en":"“Aheight” is an archaic adverb meaning “upright; to full height.”","zh":"“aheight”是古用副词，意为“直立地；达到全高”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Archaic) At full height; standing upright.","zh":"（古用）达到全高；直立地。"},"examples":[{"en":"The child stood aheight to see over the crowd.","zh":"孩子直立起来，好越过人群看清楚。"},{"en":"He sprang aheight and waved his hand.","zh":"他猛地站直，挥了挥手。"}]}],"synonyms":["upright","to full height","standing straight"],"phonetic":"/əˈhaɪt/","extraExplanation":["“aheight”常见于较早期英语文本中，也可写作“a-height”。这里的前缀 a- 是古英语/中古英语里表示“在……状态中/到……位置”的用法（类似“afloat, asleep, aboard”）。现代英语里更常用 “upright”, “standing straight”, “to full height”。","在当代写作中，“aheight”比较少见，除非你在读古典文学、仿古风格写作，或刻意营造诗意/历史感。"]}
{"word":"ahem","summary":{"en":"A polite throat-clearing sound used to get attention or signal you’re about to speak, sometimes showing mild disapproval or embarrassment.","zh":"表示清嗓子或引起注意的礼貌拟声词，也可暗示轻微不满或尴尬。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"Used to clear your throat or get someone’s attention, often before speaking; it can also show mild embarrassment or disapproval.","zh":"（拟声）用于清嗓子或引起注意，常在说话前发出；也可表示轻微的尴尬或不满。"},"examples":[{"en":"Ahem, could I ask a question?","zh":"咳嗯，我可以问个问题吗？"},{"en":"Ahem! The meeting has started.","zh":"咳嗯！会议已经开始了。"},{"en":"He said, “ahem,” and changed the subject.","zh":"他“咳嗯”了一声，然后换了话题。"}]}],"synonyms":["hem","a-hem","cough (sound)","excuse me (similar function)"],"phonetic":"/əˈhɛm/","extraExplanation":["“ahem”是英语里模仿清嗓子的声音（类似中文的“咳咳”），常用来礼貌地提醒别人注意或为开口说话做铺垫。","在书面语/小说对白中，“ahem”常带一点情绪：比如想打断、提醒礼仪、或对某事表示微妙的不赞同。语气强弱通常靠标点和上下文体现（如“Ahem.”更克制，“Ahem!”更强硬）。"]}
{"word":"ahems","summary":{"en":"“ahems” is the plural of “ahem”: throat-clearing sounds used in speech or writing to get attention or signal mild disapproval/awkwardness.","zh":"“ahems”是“ahem”的复数：表示清嗓子的声音，用于吸引注意或表达轻微不满/尴尬。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of “ahem”) the written or spoken sound of clearing your throat, often used to get attention or show mild disapproval/awkwardness.","zh":"（“ahem”的复数）清嗓子的声音；常用于吸引注意、表达轻微不满或尴尬（多见于文字表达）。"},"examples":[{"en":"There were a few loud ahems from the audience when the speaker went off-topic.","zh":"当演讲者开始跑题时，观众席传来几声响亮的“咳嗯”（清嗓声）。"},{"en":"In the script, the stage direction reads: “Several ahems, then silence.”","zh":"剧本里的舞台提示写着：“几声清嗓子，然后安静。”}],"},{"en":"Used to represent the act of clearing your throat to politely get someone’s attention or to hint that something is inappropriate.","zh":"用于表示“清嗓子”这一动作，以礼貌地提醒对方注意，或暗示某事不太合适。"}]},{"partOfSpeech":"int.","definition":{"en":"(informal writing) a way to interrupt gently or pointedly, like “Excuse me,” often with a humorous or sarcastic tone.","zh":"（非正式写作）一种“插话/提醒”的方式，类似“打扰一下/咳咳”，常带幽默或讽刺语气。"},"examples":[{"en":"Ahems—could we get back to the main issue?","zh":"咳咳——我们能回到正题吗？"},{"en":"Ahems, everyone. The meeting started five minutes ago.","zh":"咳咳，各位。会议五分钟前就开始了。"}]}],"synonyms":["throat-clearing","cough (light)","excuse me (implied)","hem and haw (related idea)"],"phonetic":"əˈhɛm","extraExplanation":["“ahem”常见于对话、小说、剧本或网络文字，用来“写出声音/语气”。写作中常用斜体 ahem 或用破折号、逗号隔开（如：Ahem—）。","“ahems”是复数形式，通常用在“several ahems / a few ahems”这类结构里，表示不止一次清嗓或多人发出清嗓声。"]}
{"word":"Ahepatokla","summary":{"en":"Not a standard English word; likely a name or non-English term. Meaning needs context to confirm.","zh":"不是标准英语词；更可能是名字或非英语词。需要语境才能确认含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Ahepatokla (unclear): It appears to be a proper noun (a name/username) or a word from a specific language, but it is not a standard English word and its meaning cannot be confirmed without context.","zh":"Ahepatokla（意义不明）：看起来像专有名词（人名/网名）或来自某种特定语言的词，但它不是常见英语词汇；在缺少语境时无法确认含义。"},"examples":[{"en":"Ahepatokla is the name shown on the account.","zh":"Ahepatokla 是账号上显示的名字。"},{"en":"I saw “Ahepatokla” in a comment, but I’m not sure what it means.","zh":"我在评论里看到 “Ahepatokla”，但不确定它是什么意思。"}]}],"phonetic":"/ˌɑːhəˌpɑːtoʊˈklɑː/","extraExplanation":["这个词不太像英语构词（在常见词典里也很少见）。可能是：①人名/地名/角色名；②某种语言的音译或拼写变体；③你想输入的英文单词拼错了。","如果你能提供它出现的句子、来源（书/游戏/歌曲/社交平台）、或你想表达的意思/近似拼写，我可以更准确地判断，并给出对应的释义与用法。"]}
{"word":"ahepatokla","summary":{"en":"“ahepatokla” does not appear to be a standard English word; it’s likely a misspelling or a proper name. Share the context and I can help identify it.","zh":"“ahepatokla”看起来不是标准英语词；更可能是拼写错误或专有名词。提供上下文我可以帮你确认它是什么。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it may be a misspelling, a made-up term, or a proper name (e.g., a username, place, or character).","zh":"不是标准英语单词；可能是拼写错误、造词，或专有名词（如用户名、地名、人物名）。"},"examples":[{"en":"I can’t find “ahepatokla” in major English dictionaries—could you share the sentence where you saw it?","zh":"我在主要英语词典里查不到“ahepatokla”——你能把它出现的句子发给我吗？"},{"en":"If it’s a name, the meaning may depend on the specific source (book, game, or community).","zh":"如果它是一个名字，含义可能取决于具体来源（书、游戏或某个社群）。"}]}],"phonetic":"/ˌeɪhəˌpætəˈkloʊlə/","extraExplanation":["从拼写上看，它可能包含“hepato-”（与肝脏有关的医学前缀，源自希腊语 hēpar/肝）。但“ahepatokla”整体并不像常见医学术语（例如 hepatology 肝脏学、hepatitis 肝炎、hepatocyte 肝细胞）。","也可能是你想输入的词被打错了。你可以告诉我：它来自哪里（网页/书/游戏/字幕）、大概语境、或你想表达的意思；我就能更准确地推测原词并给出释义与例句。"]}
{"word":"Ahern","summary":{"en":"Ahern is most commonly an Irish surname.","zh":"Ahern 最常见的用法是一个爱尔兰姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an Irish family name (surname); also used as a place-related name in Ireland","zh":"一个爱尔兰姓氏（家族姓）；也可与爱尔兰的地名渊源相关"},"examples":[{"en":"Edna O’Brien and Cecelia Ahern are Irish writers.","zh":"埃德娜·奥布莱恩和塞西莉亚·埃亨都是爱尔兰作家。"},{"en":"My coworker’s last name is Ahern.","zh":"我同事的姓是 Ahern。"}]}],"phonetic":"əˈhɝn","extraExplanation":["Ahern 常见于爱尔兰语姓氏传统中，一般被认为源自爱尔兰盖尔语姓氏（例如 Ó hEathirn / Ó hEachthighearna 等的英语化拼写，具体源头在不同家族支系可能有差异）。","在英语语境里它通常读作“uh-HERN”，作为姓氏使用最普遍；看到首字母大写 Ahern 时，多半是在指人名或家族姓。"]}
{"word":"Ahet","summary":{"en":"“Ahet” is not a common modern English word; it’s likely a typo or a proper name.","zh":"“Ahet”不是现代英语常见词，更可能是拼写错误或专有名词（如人名）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in modern dictionaries; it is most likely a misspelling or a name (proper noun). If you share the sentence where you saw it, I can identify the intended word.","zh":"“ahet”不是现代英语词典中的常见词；更可能是拼写错误，或是人名/地名等专有名词。请提供它出现的句子，我可以帮你判断原本想表达的词。"},"examples":[{"en":"I can’t find “ahet” in a standard dictionary—did you mean “ahead”?","zh":"我在常见词典里查不到“ahet”——你是不是想写“ahead（在前面/向前）”？"},{"en":"If “Ahet” is a person’s name, it may not have an English dictionary definition.","zh":"如果“Ahet”是人名，它可能没有英语词典里的固定释义。"}]}],"phonetic":"/əˈhɛt/","extraExplanation":["你可能想查的是以下更常见的词（取决于语境）：\n1) ahead /əˈhɛd/：在前面；向前；提前（如 go ahead, ahead of schedule）\n2) ahem /əˈhɛm/：清嗓声（表示提醒、引起注意或轻微尴尬）\n3) athlete /ˈæθlit/：运动员（有时打字会误输）\n如果你把原句贴出来（哪怕只有前后各3~5个词），我可以更准确地帮你定位。"]}
{"word":"ahet","summary":{"en":"A rare nautical word meaning “abreast/alongside; at the beam,” i.e., level with the middle of a ship.","zh":"一个少见的航海词，表示“并列/在正横处”，也就是与船中部（beam）大致齐平的位置。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(nautical, rare) Abreast of; alongside; in a position roughly level with the middle (beam) of a ship.","zh":"（航海用语，少见）与……并列；在船舷中部（横梁/船梁，beam）附近相对齐的位置；大致在“正横”处。"},"examples":[{"en":"The lighthouse was ahet of our beam, so we held our course.","zh":"灯塔在我们正横附近，所以我们保持航向。"},{"en":"A small boat came up ahet and then fell behind.","zh":"一条小船从并列位置靠近，然后又落在后面。"}]},{"partOfSpeech":"adv.","definition":{"en":"(rare) Directly opposite; facing across from something at the same level.","zh":"（少见）正对面；在同一高度/位置上相对。"},"examples":[{"en":"The pier sat ahet the channel entrance.","zh":"码头正对着航道入口。"}]}],"synonyms":["abeam","alongside","abreast"],"phonetic":"/əˈhɛt/","extraExplanation":["“ahet”主要出现在较旧的航海英语里，现代更常用的说法是“abeam”（在正横处）或用更清楚的描述如“alongside / level with the beam”。","容易和“ahead”（在前方）混淆：两者拼写相近，但含义不同。如果你本来想问的是“ahead”，我也可以给你“ahead”的词条。"]}
{"word":"ahey","summary":{"en":"“Ahey” is a rare old-fashioned way to call out to someone, like “hey!”","zh":"“ahey”是很少见的古用招呼语，相当于“嘿/喂”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(Rare/archaic) An interjection used to call out to someone; similar to “hey!” or “ahoy!”","zh":"（罕见/古用）感叹词，用来招呼或呼喊别人；相当于“嘿！”或“喂！”"},"examples":[{"en":"Ahey! Wait for me!","zh":"喂！等等我！"},{"en":"The sailor shouted, “Ahey!” across the deck.","zh":"水手在甲板上喊道：“喂！”"}]}],"synonyms":["hey","ahoy","halloo"],"phonetic":"/əˈheɪ/","extraExplanation":["“ahey”在现代英语里几乎不用，多见于旧文本或方言式写法。有时人们把它当作“ahoy”（航海中常用的招呼语）或“hey”的变体/误拼。日常交流中建议用“hey”或“ahoy”。"]}
{"word":"AHG","summary":{"en":"AHG most commonly means Ancient High German in linguistics, but it can also be a context-dependent abbreviation for other terms.","zh":"AHG在语言学中最常指“古高地德语”，但也可能是其他含义取决于语境的缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ancient High German: an early form of the German language spoken mainly in parts of Central Europe roughly from about AD 500 to 1050, important for studying the history of German and other Germanic languages.","zh":"古高地德语：约公元500—1050年在中欧部分地区使用的早期德语形式；对研究德语及其他日耳曼语族语言的历史很重要。"},"examples":[{"en":"This manuscript is written in AHG, so the vocabulary looks quite different from modern German.","zh":"这份手稿用的是AHG（古高地德语），所以词汇看起来和现代德语差异很大。"},{"en":"In historical linguistics, AHG texts help explain how German spelling and sounds changed over time.","zh":"在历史语言学中，AHG文献有助于解释德语拼写和语音如何随着时间演变。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation used in different fields for various organizations or technical terms (meaning depends on context).","zh":"一个在不同领域中代表不同机构或技术术语的缩写（具体含义取决于语境）。"},"examples":[{"en":"In this report, AHG refers to the company name, not a language term.","zh":"在这份报告里，AHG指的是公司名称，而不是语言学术语。"},{"en":"Could you clarify what AHG stands for in your context?","zh":"你能说明一下在你的语境中AHG代表什么吗？"}]}],"synonyms":["Ancient High German","Old High German (close/related term)"],"phonetic":"/eɪ eɪtʃ dʒiː/","extraExplanation":["“AHG”最常见的学术含义是 Ancient High German（古高地德语），在语言学/词源学资料里经常出现。","但在日常生活与不同专业领域中，AHG也可能指机构名称或技术缩写（例如某些组织/公司名等）。如果你告诉我你看到“AHG”的句子或领域（语言学、商业、军事、社团等），我可以给出更精确的释义与对应例句。"]}
{"word":"Ahgwahching","summary":{"en":"“Ahgwahching” is not recognized as a standard English word; it likely needs context to identify the intended meaning or correct spelling.","zh":"“Ahgwahching”不是标准英语词；需要上下文才能判断它真正想表达的含义或正确拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It looks like a phonetic spelling, a personal/name spelling, or a misspelling of a different word or phrase.","zh":"不是标准英语单词。看起来更像是按读音拼写、名字/专有名词的写法，或某个词/短语的拼写错误。"},"examples":[{"en":"I saw the word “Ahgwahching,” but I’m not sure what it refers to—can you share the sentence it appears in?","zh":"我看到了“Ahgwahching”这个词，但不确定它指什么——你能把它出现的句子发我吗？"},{"en":"Is “Ahgwahching” a place name, a person’s name, or a word from another language?","zh":"“Ahgwahching”是地名、人名，还是另一种语言里的词？"}]}],"phonetic":"ˌɑːɡwɑːˈtʃɪŋ","extraExplanation":["“Ahgwahching”不像常见英语词汇，因此很难给出可靠释义。很多这类拼写可能来自：① 人名/地名；② 原住民语言或其他语言的音译；③ 网络昵称；④ 听写/转写造成的拼写变化。","如果你把它的来源（书名/歌曲/影片/网站）、上下文句子、或你听到的大致读音（重音在哪、像哪个英文单词的声音）发来，我可以帮你：1) 判断是否为某个已知词的误拼；2) 给出最可能的对应词和含义；3) 提供正确拼写与用法。"]}
{"word":"Ahh","summary":{"en":"Ahh is an interjection used to express understanding, comfort/relief, or mild surprise/pain depending on context.","zh":"Ahh 是感叹词，常用来表达“明白了”、舒服/放松，或轻微的惊讶/疼痛等情绪，具体含义取决于语境。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"Used to show you suddenly understand, remember, or realize something.","zh":"用来表示你突然明白、想起或意识到某事。"},"examples":[{"en":"Ahh, now I understand what you mean.","zh":"啊，我现在明白你的意思了。"},{"en":"Ahh—I remember her name now.","zh":"啊——我现在想起她的名字了。"}]},{"partOfSpeech":"int.","definition":{"en":"Used to show satisfaction, relief, or comfort (often after something pleasant).","zh":"用来表示满足、放松或舒服（常在享受某事之后）。"},"examples":[{"en":"Ahh, this tea is so warm.","zh":"啊，这杯茶好暖。"},{"en":"Ahh, it feels good to sit down after walking all day.","zh":"啊，走了一天终于坐下真舒服。"}]},{"partOfSpeech":"int.","definition":{"en":"Used to show mild surprise, pain, or disappointment.","zh":"用来表示轻微的惊讶、疼痛或失望。"},"examples":[{"en":"Ahh! That coffee is too hot.","zh":"啊！这咖啡太烫了。"},{"en":"Ahh, I missed the bus again.","zh":"唉，我又错过公交了。"}]}],"synonyms":["ah","oh","aha","ugh","ow"],"phonetic":"/ɑː/","extraExplanation":["“Ahh”通常是“ah”的拉长写法，用来表达更强一点的情绪（更放松、更惊讶、更明白等）。在短信/聊天里，字母越多通常表示情绪越强或停顿更长。","不同语境里，“Ahh”可能接近中文的“啊/哦/唉”。例如：明白时像“哦～”；舒服时像“啊～”；失望时有时更像“唉”。"]}
{"word":"ahh","summary":{"en":"“Ahh” is an interjection used to express relief/comfort, sudden understanding, or admiration.","zh":"“ahh”是感叹词，常用来表示放松舒服、恍然大悟，或赞叹欣赏等情绪。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"Used to show a long sound of relief, relaxation, or comfort.","zh":"（感叹词）表示松 一口气、放松、舒服的“啊——”。"},"examples":[{"en":"Ahh, that hot shower feels amazing.","zh":"啊——热水澡太舒服了。"},{"en":"Ahh… I finally get to sit down.","zh":"啊……我终于能坐下了。"}]},{"partOfSpeech":"int.","definition":{"en":"Used to show sudden understanding or remembering something (“Now I understand”).","zh":"（感叹词）表示突然明白/想起来了：“啊，我懂了/我想起来了”。"},"examples":[{"en":"Ahh, so that’s why you were late.","zh":"啊，原来这就是你迟到的原因。"},{"en":"Ahh—I remember where I put my keys now.","zh":"啊——我想起来钥匙放哪儿了。"}]},{"partOfSpeech":"int.","definition":{"en":"Used to show pleasure, admiration, or appreciation.","zh":"（感叹词）表示喜欢、赞叹、欣赏：“啊，真棒/真美”。"},"examples":[{"en":"Ahh, what a beautiful view.","zh":"啊，风景真美。"},{"en":"Ahh, I love this song.","zh":"啊，我太喜欢这首歌了。"}]}],"synonyms":["ah","oh","aha","wow","phew"],"phonetic":"/ɑː/","extraExplanation":["“ahh”通常是把“ah”写得更长，用来强调语气（更放松/更满足/更感慨）。在聊天里也常见“ahh…”表示拖长、情绪更浓。","在正式写作中较少用“ahh”，更常见于对话、小说台词、社交媒体；要更正式可改用完整句子表达（如“I’m relieved.”）。"]}
{"word":"Ahhiyawa","summary":{"en":"Ahhiyawa is an ancient Hittite term, commonly linked to the Mycenaean Greek (Achaean) world.","zh":"Ahhiyawa 是赫梯文献中的古代称呼，通常被认为与迈锡尼希腊（阿开亚）世界有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a name used in ancient Hittite records (Late Bronze Age) that many scholars connect with the Mycenaean Greek world, often linked to “Achaea” (the land of the Achaeans).","zh":"古代赫梯文献（青铜时代晚期）中出现的地名/政体名，许多学者认为它与迈锡尼希腊世界有关，常被认为与“Achaea（阿开亚/阿开人之地）”相关。"},"examples":[{"en":"Some historians think Ahhiyawa refers to Mycenaean Greeks mentioned in Hittite diplomatic letters.","zh":"一些历史学者认为，Ahhiyawa 指的是赫梯外交书信中提到的迈锡尼希腊人。"},{"en":"In discussions of the Trojan War era, Ahhiyawa is often compared with Homer’s “Achaeans.”","zh":"在讨论特洛伊战争时代时，Ahhiyawa 常被拿来与荷马史诗中的“阿开亚人（Achaeans）”对照。"}]}],"synonyms":["Achaea","Achaeans","Mycenaean Greece"],"phonetic":"/ˌɑːhiːˈjɑːwə/","extraExplanation":["Ahhiyawa 主要见于赫梯楔形文字文献（约公元前14–13世纪），多出现在外交往来与势力范围的语境中。它更像是一个“外部称呼”（赫梯人对对方的叫法），并不是希腊人自称的拼写。","学界常将 Ahhiyawa 与希腊语 Akhaioi（Achaeans，阿开亚人）联系起来，但“具体指哪一片区域/哪一个政权中心”（例如是否与迈锡尼、或更广泛的爱琴世界有关）仍有讨论。","拼写上常见变体包括 Ahhiya(wa)、Ahhiyawa；中文资料有时音译作“阿希亚瓦/阿希雅瓦”等。"]}
{"word":"ahi","summary":{"en":"Ahi is a Hawaiian-origin word in English that usually means yellowfin tuna (sometimes bigeye), often served raw or seared.","zh":"Ahi 是源自夏威夷语的英文借词，通常指黄鳍金枪鱼（有时指大目金枪鱼），常见做法是生食或表面炙烤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of tuna used in food, especially yellowfin tuna (and sometimes bigeye tuna), often served raw or seared in Hawaiian-style dishes.","zh":"（食用）一种金枪鱼，尤指黄鳍金枪鱼（有时也指大目金枪鱼）；常见于夏威夷料理，可生食或表面炙烤。"},"examples":[{"en":"I ordered an ahi tuna poke bowl for lunch.","zh":"我午餐点了一份黄鳍金枪鱼（ahi）波奇饭碗。"},{"en":"The restaurant serves seared ahi with sesame crust.","zh":"那家餐厅提供外层芝麻裹衣的炙烤金枪鱼（ahi）。"}]},{"partOfSpeech":"adj.","definition":{"en":"made with or containing ahi tuna.","zh":"含有或由金枪鱼（ahi）制作的。"},"examples":[{"en":"Try the ahi burger if you like seafood.","zh":"如果你喜欢海鲜，可以试试金枪鱼（ahi）汉堡。"},{"en":"They have an ahi salad on the menu.","zh":"菜单上有一道金枪鱼（ahi）沙拉。"}]}],"synonyms":["yellowfin tuna","bigeye tuna","tuna"],"phonetic":"/ˈɑːhi/","extraExplanation":["“Ahi”来自夏威夷语；在夏威夷饮食文化里常与“poke（波奇，拌生鱼）”一起出现。英文菜单上写“ahi”通常指适合生食或轻微炙烤的金枪鱼（常见是黄鳍或大目），点餐时若在意生熟程度可以询问是yellowfin还是bigeye、是否为sushi-grade（可生食级别）。"]}
{"word":"Ahidjo","summary":{"en":"Ahidjo most commonly refers to Ahmadou Ahidjo, Cameroon’s first president, or to his era of rule.","zh":"Ahidjo通常指喀麦隆首任总统阿马杜·阿希乔，或指其执政时期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ahmadou Ahidjo (1924–1989), the first President of Cameroon (in office 1960–1982). The name “Ahidjo” is often used to refer to him or to his period of rule.","zh":"阿马杜·阿希乔（1924–1989），喀麦隆首任总统（任期1960–1982）。“Ahidjo”常用来指这位人物本人或其执政时期。"},"examples":[{"en":"Ahidjo served as Cameroon’s first president after independence.","zh":"阿希乔在喀麦隆独立后担任首任总统。"},{"en":"Some historians describe the early state-building period as the Ahidjo era.","zh":"一些历史学者把早期国家建设阶段称为“阿希乔时代”。"}]}],"phonetic":"/ˌɑːˈhidʒoʊ/","extraExplanation":["“Ahidjo”在英语文章里多作为专有名词出现：既可单指人名，也可作引申用法指其执政时期的政治体制与政策（如国家统一、政党与行政集权等讨论）。","在阅读中常见搭配包括：the Ahidjo era（阿希乔时代）、Ahidjo’s government/regime（阿希乔政府/政权）、post-Ahidjo（后阿希乔时期）。"]}
{"word":"Ahiezer","summary":{"en":"Ahiezer is a biblical Hebrew male name meaning “my brother is help / brother of help.”","zh":"Ahiezer 是源自《圣经》的希伯来男性名字，常解释为“我的兄弟是帮助 / 帮助之兄弟”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name from the Hebrew Bible, meaning “my brother is help / brother of help.”","zh":"男性名字，源自《希伯来圣经》（旧约传统），常被解释为“我的兄弟是帮助 / 帮助之兄弟”。"},"examples":[{"en":"Ahiezer is a biblical Hebrew name that appears in genealogies and tribal lists.","zh":"Ahiezer 是一个出现在圣经家谱与支派名录中的希伯来名字。"},{"en":"Some parents choose the name Ahiezer to reflect a faith tradition or a meaning connected to help and support.","zh":"有些父母选择 Ahiezer 这个名字，是为了体现信仰传统，或表达“帮助、支持”的含义。"}]}],"synonyms":["Achi-ezer (variant transliteration)"],"phonetic":"/ˌɑːhiˈeɪzər/","extraExplanation":["在英语语境里，Ahiezer 通常被当作专有名词（人名）使用，不像普通词汇那样有“同义词”。","该名来自希伯来语构词：Ahi- 常与“兄弟”相关，-ezer 与“帮助”（如名字 Eliezer 中的 -ezer）相关。不同资料对细微翻译可能略有差异，但核心含义多与“帮助/援助”有关。","在《民数记》等经文的英译本中可见 Ahiezer；不同译本在拼写上通常一致，但在中文译名上可能出现不同音译。"]}
{"word":"Ahimaaz","summary":{"en":"Ahimaaz is a biblical male name, best known as a messenger in King David’s story.","zh":"Ahimaaz（亚希玛斯）是一个圣经中的男性人名，最常见的是大卫王故事里的信使。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A male personal name from the Hebrew Bible (Old Testament), referring to several people, especially a messenger in the story of King David (notably in 2 Samuel).","zh":"一个出自《希伯来圣经》（《旧约》）的男性人名，指多位人物，尤以大卫王故事中的信使最常见（尤其见《撒母耳记下》）。"},"examples":[{"en":"In 2 Samuel, Ahimaaz runs to deliver news to King David.","zh":"在《撒母耳记下》中，亚希玛斯奔跑去向大卫王传递消息。"},{"en":"Ahimaaz is a biblical name you may see in religious studies or literature.","zh":"“Ahimaaz”是一个圣经人名，你可能会在宗教研究或文学中见到。"}]}],"synonyms":["biblical name","Hebrew name"],"phonetic":"/əˈhaɪməˌæz/","extraExplanation":["“Ahimaaz”源自希伯来语，常被解释为与“我的弟兄/兄弟”和“怒气/愤怒”等意象相关（不同资料的词源拆解与释义略有差异）。","在英语语境中它主要作为专有名词出现：多见于圣经文本、神学/宗教学写作，或以圣经典故为背景的文学作品中；日常英语里很少用作普通词汇。","阅读时注意大小写：通常首字母大写（Ahimaaz），因为它是人名。"]}
{"word":"Ahimelech","summary":{"en":"Ahimelech is a biblical name, best known as a priest who helped David and was later killed by Saul.","zh":"Ahimelech（亚希米勒）是《圣经》中的人名，最常指一位曾帮助大卫、后来被扫罗处死的祭司。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A male name in the Hebrew Bible, especially the name of a priest associated with the sanctuary at Nob who helped David; he is later killed by King Saul (often linked with the story in 1 Samuel).","zh":"《希伯来圣经/旧约》中的男性名字，尤指与挪伯（Nob）圣所相关的一位祭司，他曾帮助大卫；后来被扫罗王处死（常与《撒母耳记上》的故事相关）。"},"examples":[{"en":"In 1 Samuel, Ahimelech gives David bread and the sword of Goliath.","zh":"在《撒母耳记上》中，亚希米勒给了大卫饼和歌利亚的刀。"},{"en":"The name Ahimelech appears in discussions of biblical priests and kingship.","zh":"“亚希米勒”这个名字常出现在关于圣经祭司制度与王权的讨论中。"}]}],"phonetic":"/əˈhɪməˌlɛk/","extraExplanation":["这是一个专有名词（人名），常见中文译名有“亚希米勒/亚希米力”（不同译本略有差异）。","读经或文学语境里提到 Ahimelech，通常是在讲“大卫逃亡时期得到祭司帮助”以及“扫罗的残暴与政治恐惧”等主题。","与他相关的地点 Nob（挪伯）和人物 David（大卫）、Saul（扫罗）常一起出现，有助于你快速定位故事背景。"]}
{"word":"ahimsa","summary":{"en":"Ahimsa means the principle of nonviolence—avoiding harm to living beings.","zh":"Ahimsa 指“非暴力/不害”的原则：避免伤害一切生命。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the principle of nonviolence—avoiding harm to living beings in thought, speech, and action (especially in Hinduism, Jainism, and Buddhism)","zh":"“不害”（非暴力）原则——在思想、言语和行为上避免伤害众生（尤见于印度教、耆那教与佛教）"},"examples":[{"en":"Ahimsa teaches people to avoid harming any living being whenever possible.","zh":"“不害”教导人们尽可能避免伤害任何生命。"},{"en":"Many Jains practice strict ahimsa, including careful attention to insects and small animals.","zh":"许多耆那教徒严格践行“不害”，甚至会小心避免伤及昆虫等小动物。"},{"en":"Gandhi promoted ahimsa as a moral foundation for peaceful social change.","zh":"甘地将“不害”作为和平社会变革的道德基础。"}]}],"synonyms":["nonviolence","non-violence","peacefulness","harmlessness"],"phonetic":"/əˈhɪmsə/","extraExplanation":["“Ahimsa”源自梵语：a-（不、非）+ himsa（伤害、暴力），字面义为“无伤害”。它不仅指“不使用暴力”，也常包含慈悲、克制与尊重生命的生活方式。","在不同传统中侧重点略有差异：耆那教通常最为严格（强调对一切生命的不伤害）；印度教与佛教也强调不害，但在戒律与实践层面可能更具情境性。","英语语境里它多用于宗教、哲学与政治伦理讨论；日常口语中更常用的对应词是 “nonviolence” 或 “non-violence”。"]}
{"word":"ahimsas","summary":{"en":"Ahimsas is the plural of ahimsa, meaning the principle or practice of nonviolence and avoiding harm, especially in Indian religious and ethical traditions.","zh":"Ahimsas 是 ahimsa 的复数，指“不害/非暴力”的原则或实践，尤指印度宗教与伦理传统中的“避免伤害众生”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of ahimsa) The principle or practice of nonviolence—avoiding harm to living beings—especially in Indian religions such as Jainism, Hinduism, and Buddhism.","zh":"（ahimsa 的复数）“不害/非暴力”原则或实践——避免伤害一切众生，尤见于耆那教、印度教与佛教等印度宗教传统。"},"examples":[{"en":"Many students first learn about ahimsas when studying Gandhi and nonviolent protest.","zh":"许多学生在学习甘地与非暴力抗争时，第一次接触到“ahimsas（不害/非暴力）”的概念。"},{"en":"Different traditions describe ahimsas in slightly different ways, but the core idea is to avoid causing harm.","zh":"不同传统对“ahimsas”的表述略有差异，但核心都是避免造成伤害。"}]},{"partOfSpeech":"n.","definition":{"en":"Different forms or interpretations of nonviolence (for example, personal, social, or political approaches).","zh":"非暴力的不同形式或诠释（例如个人层面、社会层面或政治层面的做法）。"},"examples":[{"en":"The author compares several ahimsas: inner self-control, compassionate speech, and peaceful activism.","zh":"作者比较了几种“ahimsas”：内在自律、慈悲的言语，以及和平的社会行动。"}]}],"synonyms":["nonviolence","non-harming","peacefulness"],"phonetic":"əˈhɪmsə","extraExplanation":["“Ahimsa”一词源自梵语 a-（否定）+ himsa（伤害），字面意思是“不伤害”。在耆那教中它是最核心的戒律之一，因此常与素食、谨慎行走以避免伤生等实践联系在一起。","在现代英语语境里，ahimsa/ahimsas 常因甘地（Gandhi）的非暴力思想而被更广泛地引用，用来谈论社会运动、抗议与伦理选择。","英语里更常见单数形式 ahimsa；复数 ahimsas 多用于学术讨论，强调“多种版本/路径”的非暴力。"]}
{"word":"ahind","summary":{"en":"“Ahind” is an archaic form meaning “behind.”","zh":"“ahind”是“behind”的古用形式，意思是“在后面/在背后”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Archaic) behind; at the back; following after.","zh":"（古用）在后面；在背后；随后。"},"examples":[{"en":"The riders came ahind the main troop.","zh":"骑手们跟在主队伍后面。"},{"en":"Leave the past ahind and move forward.","zh":"把过去抛在身后，向前走。"}]}],"synonyms":["behind","after","at the back"],"phonetic":"/əˈhaɪnd/","extraExplanation":["“ahind”是中古/早期英语里“behind”的变体拼写之一，现在基本不用于日常英语，更多出现在旧文学、方言记录或仿古写作中。现代英语通常用“behind”。"]}
{"word":"ahint","summary":{"en":"A hint is a small suggestion or piece of information that helps you understand or guess something; it can also mean to suggest something indirectly.","zh":"hint 指“提示/暗示”，是帮助理解或猜测的一点信息；也可作动词，表示“委婉地暗示”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small piece of information or a suggestion that helps you guess or understand something","zh":"暗示；提示（帮助你猜到或理解某事的一点信息或建议）"},"examples":[{"en":"Can you give me a hint about the answer?","zh":"你能给我一点答案的提示吗？"},{"en":"Her smile was a hint that she knew the secret.","zh":"她的微笑暗示她知道这个秘密。"}]},{"partOfSpeech":"v.","definition":{"en":"to give a small suggestion or sign that helps someone guess or understand something","zh":"暗示；提示（用小小的建议或迹象帮助别人猜到或理解某事）"},"examples":[{"en":"He hinted that he might leave the company soon.","zh":"他暗示自己可能很快会离开公司。"},{"en":"The teacher hinted at the solution without saying it directly.","zh":"老师没有直接说出答案，而是暗示了解法。"}]}],"synonyms":["clue","tip","suggestion","indication"],"phonetic":"/hɪnt/","extraExplanation":["“hint”常用于“不要说得太直接”的场景，语气比“clue（线索）”更轻、更委婉；“clue”更像侦探/解谜时的关键线索。","常见搭配：give (someone) a hint（给某人提示）；take a hint（领会暗示、识趣点）；hint at（暗示、提到但不明说）。"]}
{"word":"Ahir","summary":{"en":"Ahir usually refers to a South Asian community (often linked with cattle-herding and the Yadav group), and it can also be a personal name.","zh":"Ahir 通常指南亚的一个族群/社群（传统上与牧牛有关，常与 Yadav 群体相关），也可作人名或姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Ahir community in South Asia (often associated with traditional cattle-herding and linked in many regions with the Yadav group).","zh":"（南亚）阿希尔人；阿希尔族群成员（传统上与牧牛有关，许多地区与“亚达夫 Yadav”群体有关联）。"},"examples":[{"en":"In the census records, some families identified as Ahir or Yadav depending on the region.","zh":"在人口普查记录里，一些家庭会因地区不同而自称阿希尔人（Ahir）或亚达夫（Yadav）。"},{"en":"The village history mentions Ahir herders who moved seasonally with their cattle.","zh":"村史里提到一些阿希尔牧民会随牛群季节性迁徙。"}]},{"partOfSpeech":"other","definition":{"en":"a surname or given name used by some people, especially in South Asia.","zh":"人名/姓氏（部分人使用，尤其在南亚地区较常见）。"},"examples":[{"en":"Ahir is his family name.","zh":"Ahir 是他的姓。"}]}],"synonyms":["Yadav (in some regional usages)"],"phonetic":"/əˈhɪr/","extraExplanation":["在英语语境中，Ahir 多出现在历史、人类学、社会学或南亚相关报道里，属于族群/社群名称，而不是常见的日常英语词汇。","不同地区对 Ahir 与 Yadav 的关系认定不完全一致：有些地方把 Ahir 视为 Yadav 的分支或同义称呼，有些地方则区分更明确。写作时可根据当地用法或当事人自称来选择称呼。"]}
{"word":"ahir","summary":{"en":"“ahir” is not standard English; it’s usually a typo for “air” or “a hair.”","zh":"“ahir” 不是标准英语；通常是 “air” 或 “a hair” 的拼写/输入错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most often a misspelling or mistyping of “air” or the phrase “a hair.”","zh":"不是标准英语单词。最常见是把 “air”（空气）或短语 “a hair”（一根头发）拼错/打错。"},"examples":[{"en":"I think you meant “air”: The room needs more air.","zh":"我猜你想写的是 “air”：这个房间需要更多空气。"},{"en":"I think you meant “a hair”: There’s a hair in my soup.","zh":"我猜你想写的是 “a hair”：我的汤里有一根头发。"}]}],"phonetic":"/əˈhɪr/","extraExplanation":["“ahir” 这种拼法在英文里不常见，常见原因是：键盘输入错误、拼写时把元音顺序弄乱，或把两个词连在一起（a + hair）。如果你能给我一句包含 “ahir” 的原句，我可以更准确判断你想表达哪个词。"]}
{"word":"Ahira","summary":{"en":"Ahira is a rare proper name best known from the Bible (Numbers), referring to a leader of the tribe of Naphtali.","zh":"Ahira 是一个较少见的专有名，主要因《圣经·民数记》而为人所知，指拿弗他利支派的一位首领。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a male given name that appears in the Bible (Hebrew origin), referring to a leader of the tribe of Naphtali during the Israelites’ time in the wilderness.","zh":"（专有名词）一个出现在《圣经》中的男性名字（源自希伯来语），指以色列人在旷野时期拿弗他利支派的一位首领。"},"examples":[{"en":"In the Book of Numbers, Ahira is named as a leader from the tribe of Naphtali.","zh":"在《民数记》中，Ahira 被记为拿弗他利支派的一位首领。"},{"en":"Ahira son of Enan is mentioned in biblical genealogies.","zh":"“以难的儿子 Ahira”在《圣经》的家谱/名单中被提到。"}]}],"phonetic":"/əˈhaɪrə/","extraExplanation":["Ahira 属于《圣经》人名，常见于《民数记》（Numbers）中的名单与记载；日常英语里并不常用，一般只在宗教、历史或文学语境中出现。","作为专名，发音在不同社群中可能略有差异；英语中常按拼写读作 /əˈhaɪrə/（类似“uh-HIGH-ruh”）。"]}
{"word":"Ahisar","summary":{"en":"Ahisar is a place name, most often referring to Akhisar, a town/district in western Turkey.","zh":"Ahisar是一个地名，最常指土耳其西部的Akhisar（城镇/行政区）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a place name (proper noun), most commonly referring to a town and district in Manisa Province, western Turkey (often spelled “Akhisar” in English and Turkish).","zh":"地名（专有名词），最常指土耳其西部马尼萨省的一个城镇与区（英文与土耳其语中更常见拼写为“Akhisar”）。"},"examples":[{"en":"Akhisar (sometimes written as Ahisar) is in Manisa Province in western Turkey.","zh":"Akhisar（有时也写作Ahisar）位于土耳其西部的马尼萨省。"},{"en":"We stopped in Ahisar to eat before continuing our drive.","zh":"我们在Ahisar停下来吃点东西，然后继续开车。"}]}],"synonyms":["Akhisar"],"phonetic":"/ˌɑːhiːˈsɑːr/","extraExplanation":["“Akhisar/ Ahisar”常被解释为源自土耳其语词根：ak（白色）+ hisar（城堡/要塞），可理解为“白色的要塞”。","该地在古代也与希腊罗马时期的城市“Thyatira（提亚提喇）”相关联；在历史与考古语境中，你可能会看到这种对应名称。","如果你是在特定国家/地区的地址或姓氏里看到“Ahisar”，也可能是其他地名的拼写变体；提供上下文（国家、附近城市、句子）我可以帮你更精确确认。"]}
{"word":"Ahishar","summary":{"en":"Ahishar is a biblical name, known as a palace official serving King Solomon.","zh":"Ahishar（亚希沙）是圣经人名，指所罗门王的一位负责王宫内务的官员。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a male personal name in the Hebrew Bible; an official in King Solomon’s court, often described as being in charge of the palace/household (1 Kings 4:6).","zh":"《希伯来圣经》（《旧约》）中的男性人名；所罗门王朝廷的一位官员，常被描述为负责王宫/王室内务的人（《列王纪上》4:6）。"},"examples":[{"en":"In 1 Kings 4:6, Ahishar is listed among Solomon’s key officials.","zh":"在《列王纪上》4:6中，亚希沙被列为所罗门的重要官员之一。"},{"en":"The text suggests Ahishar managed the royal household, similar to a palace administrator.","zh":"经文暗示亚希沙管理王室内务，类似“王宫总管/内务大臣”。"}]}],"synonyms":["(proper name) Ahishar"],"phonetic":"/ˌɑːhiˈʃɑːr/","extraExplanation":["“Ahishar”通常按希伯来语人名音译为“亚希沙/亚希珊”等，不同译本拼写可能略有差异。","圣经学者常把他对应到古代近东宫廷中的“家宰/总管”一类职位：负责宫廷日常运作、后勤与内务管理。"]}
{"word":"ahistoric","summary":{"en":"Ahistoric means “not viewed in historical context,” and it is relatively uncommon (often replaced by ahistorical).","zh":"ahistoric 指“缺乏历史语境/不从历史角度看”，用法较少见，常被 ahistorical 替代。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not concerned with history; not placed in a historical context (often used in academic writing)","zh":"非历史的；不考虑历史背景的；不放在历史语境中讨论的（常见于学术语境）"},"examples":[{"en":"The article gives an ahistoric account of the conflict, focusing only on recent events.","zh":"这篇文章对冲突的叙述缺乏历史背景，只关注近期事件。"},{"en":"Some critics say the film is ahistoric because it ignores the social conditions of the time.","zh":"一些评论者认为这部电影“不具历史性”，因为它忽视了当时的社会条件。"}]},{"partOfSpeech":"adj.","definition":{"en":"outside or beyond recorded history; not belonging to any particular historical period (rare)","zh":"超出（有记载的）历史范围的；不属于任何特定历史时期的（较少见）"},"examples":[{"en":"The novel imagines an ahistoric world with no written records of the past.","zh":"这部小说想象了一个“无史可考”的世界，没有任何关于过去的文字记录。"}]}],"synonyms":["ahistorical","unhistorical","context-free"],"phonetic":"/ˌeɪhɪˈstɔrɪk/","extraExplanation":["“ahistoric”在英语里相对少见，更常见的是“ahistorical”。两者在很多语境下意思接近：都指“缺乏历史视角/不放在历史脉络中”。如果你在写论文或正式文章，通常用“ahistorical”更自然。","注意不要和“historic / historical”混淆：historic=“具有历史意义的”（a historic event 历史性事件）；historical=“与历史相关的/历史上的”（historical records 历史记录）。"]}
{"word":"ahistorical","summary":{"en":"Ahistorical means either (1) ignoring historical context, or (2) not tied to a specific historical time (timeless).","zh":"Ahistorical 指（1）不考虑历史背景/缺乏历史视角，或（2）不属于特定历史时期、带有“超越历史”的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not interested in or not considering history; treating something as if its historical background does not matter.","zh":"非历史性的；不考虑（或不重视）历史背景的；把事物当作与历史无关来看待的。"},"examples":[{"en":"The article gives an ahistorical view of the conflict, ignoring decades of earlier events.","zh":"这篇文章对冲突的看法很“非历史性”，忽略了此前几十年的事件。"},{"en":"It’s hard to understand this tradition in an ahistorical way, because its meaning comes from the past.","zh":"很难用“非历史性”的方式理解这个传统，因为它的意义来自过去。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not belonging to any specific time in history; timeless or outside a historical period.","zh":"不属于任何特定历史时期的；超越历史时间的；“无时间感”的。"},"examples":[{"en":"The painting has an ahistorical, dreamlike quality.","zh":"这幅画有一种超越历史的、梦境般的气质。"},{"en":"The costumes were intentionally ahistorical to make the story feel universal.","zh":"服装刻意不按历史来设计，让故事更具普遍性。"}]}],"synonyms":["nonhistorical","timeless","context-free","without historical context"],"phonetic":"/ˌeɪhɪˈstɔrɪkəl/","extraExplanation":["“a-”是否定前缀，表示“非、不”。“historical”是“历史的”。因此“ahistorical”字面意思就是“非历史的”。","在学术写作里，“ahistorical”常带一点批评意味：指观点或解释没有把历史条件（时代、背景、演变）考虑进去。","与“unhistorical”相比：两者有时可互换，但“unhistorical”更常表示“与历史事实不符/不真实”，而“ahistorical”更强调“忽略历史背景/缺乏历史视角”。"]}
{"word":"ahistorically","summary":{"en":"“Ahistorically” means “without considering historical context,” and sometimes “not historically accurate.”","zh":"“ahistorically”指“忽略历史背景地”，有时也指“缺乏历史准确性地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that ignores or removes historical context; treating something as if history does not matter.","zh":"以不考虑历史背景的方式；把事物当作与历史无关来对待。"},"examples":[{"en":"The film presents the event ahistorically, focusing on modern values instead of the period’s realities.","zh":"这部电影以不顾历史背景的方式呈现该事件，更强调现代价值观而不是当时的现实。"},{"en":"Reading the novel ahistorically can make some characters seem unrealistic.","zh":"以忽略历史语境的方式阅读这部小说，会让一些人物显得不真实。"}]},{"partOfSpeech":"adv.","definition":{"en":"Not in accordance with historical evidence; not historically accurate (less common).","zh":"不符合历史证据；不具历史准确性（较少见）。"},"examples":[{"en":"The claim is ahistorically framed and doesn’t match the records we have.","zh":"这个说法的表述缺乏历史依据，与现有记录不符。"}]}],"synonyms":["without historical context","out of historical context","anachronistically","nonhistorically"],"phonetic":"/ˌeɪhɪˈstɔrɪkli/","extraExplanation":["“a-”在这里是否定前缀，表示“非、无”（类似于 amoral=不道德的）。因此 ahistorical/ahistorically 常用于学术或评论语境，批评某种观点“脱离历史语境”。","注意区分：ahistorically（忽略历史语境）不等于 historically incorrect（历史错误）。前者强调“方法/角度不看历史”，后者强调“事实不对”。"]}
{"word":"ahistoricity","summary":{"en":"Ahistoricity means a lack of historical context or an approach that treats things as timeless rather than shaped by history.","zh":"Ahistoricity 指缺乏历史语境/历史意识，或用“非历史化”的方式把事物当作超越时代、不受历史塑造。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of not being related to history, historical context, or historical development; a lack of historical awareness or accuracy","zh":"非历史性；脱离历史语境或历史发展的性质；缺乏历史意识或历史准确性"},"examples":[{"en":"Critics argued that the film’s portrayal of ancient life showed a strong sense of ahistoricity.","zh":"批评者认为这部电影对古代生活的呈现非常“非历史化”，缺乏真实的历史语境。"},{"en":"Teaching literature without context can lead to ahistoricity—students may miss why the text mattered in its own time.","zh":"不讲语境地教文学可能会导致“非历史性”——学生会错过作品在当时为何重要。"}]},{"partOfSpeech":"n.","definition":{"en":"(in academic writing) a view or approach that deliberately treats ideas, texts, or values as timeless rather than shaped by a particular period","zh":"（学术语境）非历史化的观点/方法：刻意把思想、文本或价值当作“永恒不变”，而不是由特定时代塑造"},"examples":[{"en":"The author challenges the ahistoricity of the argument by showing how the concept changed over centuries.","zh":"作者通过展示该概念在数百年间的变化，来反驳这一论证的“非历史化”。"},{"en":"Some moral theories are criticized for ahistoricity because they ignore social and cultural change.","zh":"一些道德理论因忽视社会与文化变迁而被批评为“非历史性”。"}]}],"synonyms":["ahistoricalness","lack of historical context","timelessness (sometimes, depending on tone)"],"phonetic":"/ˌeɪhɪstəˈrɪsɪti/","extraExplanation":["“ahistoricity”常见于人文学科与社会科学（如历史学、文学研究、哲学、政治理论）。它往往带有批评意味：指出某种说法把历史条件（时代、阶级、制度、文化语境）当作不重要，从而产生偏差。","常见相关词：historicize（使之置于历史语境中/历史化）、ahistorical（非历史的，形容词）。注意：ahistoricity ≠ “history（历史）不存在”，而是指分析或表达“没有把历史因素算进去”。"]}
{"word":"ahistoricize","summary":{"en":"“Ahistoricize” means to remove or ignore historical context, treating something as timeless or not shaped by history.","zh":"“ahistoricize”指使某事物去历史化：忽视其历史背景，把它当作不受历史条件影响或具有“永恒普遍性”的东西。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove or ignore the historical context of something; to treat it as if history (time, place, development) does not matter","zh":"使（某事物）去历史化；忽视其历史背景，把它当作与历史发展无关"},"examples":[{"en":"The essay ahistoricizes the novel by discussing its themes without mentioning the period it was written in.","zh":"这篇文章在讨论小说主题时完全不提创作时代，从而把小说去历史化了。"},{"en":"When we ahistoricize a tradition, we may miss why it began and how it changed.","zh":"当我们把一种传统去历史化时，可能会忽略它为何产生以及如何变化。"}]},{"partOfSpeech":"vt.","definition":{"en":"to describe or interpret something in a way that makes it seem timeless or universal, rather than shaped by specific historical conditions","zh":"以“永恒/普遍”的方式解释（某事），使其看起来不受特定历史条件影响"},"examples":[{"en":"Some advertisements ahistoricize social problems by presenting them as personal choices only.","zh":"一些广告把社会问题说成只是个人选择，从而将其去历史化。"},{"en":"The film ahistoricizes the conflict, turning a complex history into a simple moral lesson.","zh":"这部电影把冲突去历史化，把复杂的历史变成了简单的道德寓言。"}]}],"synonyms":["dehistoricize","detach from context","abstract","uncontextualize"],"phonetic":"ˌeɪhɪˈstɔrɪsaɪz","extraExplanation":["“ahistoricize”多见于人文社科写作（文学批评、历史学、社会学等），常用来批评某种解读“脱离历史语境”。在学术语境中更常见的近义词是“dehistoricize（去历史化）”。","常见搭配：ahistoricize a text/issue/event（把文本/议题/事件去历史化）；an ahistoricized reading（去历史化的解读）。"]}
{"word":"Ahithophel","summary":{"en":"Ahithophel is a biblical counselor to King David who became a famous symbol of betrayal; by extension it can mean a treacherous adviser.","zh":"Ahithophel 是《圣经》中背叛大卫王的谋士之名，常象征背叛；引申也可指“背主的谋士/奸臣”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A wise counselor to King David in the Bible who later betrayed David by supporting Absalom’s rebellion; his name is often associated with treachery and political betrayal.","zh":"《圣经》中大卫王的谋士，后来倒戈支持押沙龙叛乱而背叛大卫；其名字常被用来象征政治背叛与奸计。"},"examples":[{"en":"In the Bible, Ahithophel was famed for his advice, but he ultimately turned against David.","zh":"在《圣经》中，亚希多弗以谋略著称，但最终背叛了大卫。"},{"en":"The minister was compared to Ahithophel for abandoning his leader at a critical moment.","zh":"那位部长在关键时刻弃主而去，被人比作“亚希多弗”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, literary) A traitorous adviser or schemer, especially one who betrays a leader from inside their circle.","zh":"（文学/比喻）背主的谋士、内鬼式的策士；尤指身居核心圈却出卖领袖的人。"},"examples":[{"en":"The novel’s Ahithophel figure whispers strategies, then sells them to the enemy.","zh":"小说里那个“亚希多弗式人物”一边献策，一边把情报卖给敌人。"},{"en":"People feared he would play Ahithophel again and switch sides for power.","zh":"人们担心他会再当一次“亚希多弗”，为权势而倒戈。"}]}],"synonyms":["traitor","turncoat","schemer","double-crosser"],"phonetic":"/əˈhɪθəˌfɛl/","extraExplanation":["“Ahithophel”出自《旧约·撒母耳记下》。他原是大卫的重要谋士，后转而辅佐押沙龙夺位；政变失败后自缢身亡，因此名字常带有“智谋很高但结局悲剧、背叛主君”的含义。","在英语文学中，这个形象常被用来影射现实政治人物。英国诗人约翰·德莱顿（John Dryden）的讽刺诗《Absalom and Achitophel》中，用拼写变体“Achitophel”来指代一位“煽动与阴谋”的政治人物。阅读时遇到 Achitophel 多半与 Ahithophel 指同一典故。"]}
{"word":"AHL","summary":{"en":"AHL most commonly means the American Hockey League, a major developmental pro ice hockey league in North America.","zh":"AHL最常见的意思是“美国冰球联盟”，是北美重要的职业冰球发展联赛。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"American Hockey League: a professional ice hockey league in North America, widely known as the main “minor league” where players develop before moving up to the NHL.","zh":"美国冰球联盟（AHL）：北美的职业冰球联赛，通常被认为是NHL（国家冰球联盟）的主要“发展联盟/次级联赛”，许多球员会先在这里历练再升上NHL。"},"examples":[{"en":"He was called up from the AHL to play his first NHL game.","zh":"他从AHL被召上去，打了自己第一场NHL比赛。"},{"en":"Many young goalies spend a season or two in the AHL to gain experience.","zh":"很多年轻守门员会在AHL待上一两季来积累经验。"},{"en":"The team’s affiliate in the AHL helps develop future NHL players.","zh":"这支球队在AHL的附属队伍负责培养未来的NHL球员。"}]}],"synonyms":["American Hockey League"],"phonetic":"/ˌeɪ eɪtʃ ˈɛl/","extraExplanation":["AHL在北美体育新闻里很常见，尤其在冰球语境中。它经常和“call up（升上大联盟）/send down（下放到发展联盟）/affiliate（附属队）”一起出现。","读法通常是按字母读：A-H-L。"]}
{"word":"ahlan","summary":{"en":"“Ahlan” is a friendly Arabic way to say “hello” or “welcome.”","zh":"“Ahlan”是阿拉伯语里友好的“你好/欢迎”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"A casual Arabic greeting meaning “hello,” used to welcome someone (common in the Middle East and North Africa).","zh":"阿拉伯语里的随口问候语，意思是“你好”，也常用于欢迎别人（在中东和北非很常见）。"},"examples":[{"en":"Ahlan! How are you today?","zh":"Ahlan！你今天怎么样？"},{"en":"When I arrived in Beirut, the shopkeeper said, “Ahlan.”","zh":"我到贝鲁特时，店主对我说：“Ahlan。”"}]}],"synonyms":["marhaban","hello","hi"],"phonetic":"/ˈɑːlɑːn/","extraExplanation":["“Ahlan”源自阿拉伯语“أهلاً”（ahlan），语气友好、日常，常用于见面时打招呼或表示欢迎。","你也可能会看到更完整的欢迎说法“ahlan wa sahlan”（أهلاً وسهلاً），大意是“欢迎欢迎 / 别客气，尽管来”。","使用场景上，它比较口语；更正式时也可能听到“marḥaban”（مرحبا，marhaban）等问候。"]}
{"word":"Ahlgren","summary":{"en":"Ahlgren is a Swedish/Scandinavian surname used as a family name.","zh":"Ahlgren 是一个常见于瑞典/北欧语境的姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name), most often of Swedish/Scandinavian origin.","zh":"一个姓氏（家族姓），多见于瑞典/北欧语境。"},"examples":[{"en":"Dr. Ahlgren will speak at the conference today.","zh":"Ahlgren 博士今天将在会议上发言。"},{"en":"Her last name is Ahlgren, spelled A-H-L-G-R-E-N.","zh":"她的姓是 Ahlgren，拼作 A-H-L-G-R-E-N。"},{"en":"In the reference list, the author appears as Ahlgren, J.","zh":"在参考文献中，这位作者写作 Ahlgren, J.。"}]}],"phonetic":"/ˈɑlɡrɛn/","extraExplanation":["Ahlgren 常被认为是瑞典式“装饰性姓氏”（ornamental surname）的一种：不少北欧姓氏由自然意象组合而成。词尾 -gren 在瑞典语里常见，字面有“树枝/枝条”的含义，因此很多以 -gren 结尾的姓（如 Lindgren）都带有自然意象。","Ahl- 这一部分在不同家族来源中可能与瑞典语中表示树木（如“桤木/赤杨”一类）或地形词源有关；作为姓氏使用时通常不需要逐字翻译，更多是身份标识。","英语语境里它通常作为专有名词使用：首字母大写，不加冠词（不说 “an Ahlgren” 来指“一个人”，除非是在非常特定的语境，如“the Ahlgrens” 指“Ahlgren一家”。）"]}
{"word":"ahluwalia","summary":{"en":"Ahluwalia is most commonly a Punjabi (often Sikh) surname and a proper name used by people or brands.","zh":"Ahluwalia 最常见是旁遮普地区（常见于锡克族）的姓氏，也可作为人名或品牌等专有名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Punjabi (often Sikh) surname, common in India and in the global South Asian diaspora; also used as the name of people, families, or brands (e.g., a fashion label).","zh":"一个旁遮普语系（常见于锡克族）的姓氏，在印度及全球南亚侨民中较常见；也可作为个人、家族或品牌名称（例如某些时尚品牌）。"},"examples":[{"en":"Her last name is Ahluwalia, and her family is from Punjab.","zh":"她的姓是 Ahluwalia，她的家人来自旁遮普。"},{"en":"I saw the name Ahluwalia on a designer label.","zh":"我在一个设计师品牌标签上看到了 Ahluwalia 这个名字。"}]}],"phonetic":"/ˌɑːluːˈwɑːliə/","extraExplanation":["“Ahluwalia”常被解释为与“Ahluwal/Alhuwal（一个地名或社群称呼）”有关，属于旁遮普地区的家族姓氏之一；在英语语境里通常作为专有名词使用，首字母大写。","在英文里遇到该词，多半是在“姓名（full name）/姓氏（surname, last name）/品牌名（brand name）”中出现；因为是专名，一般不翻译，只做音译或保留原拼写。"]}
{"word":"Ahmad","summary":{"en":"Ahmad is a common Arabic-origin male name (also used as a surname), a variant of Ahmed.","zh":"Ahmad 是常见的阿拉伯语来源男性名字（也可作姓氏），是 Ahmed 的同源变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name of Arabic origin (also used as a family name), commonly spelled Ahmad; it is a variant of Ahmed and is widely used in Muslim communities worldwide.","zh":"一个阿拉伯语来源的男性名字（也可作姓氏），常写作 Ahmad；与 Ahmed 属于同源变体，在世界各地穆斯林社群中很常见。"},"examples":[{"en":"Ahmad moved to Chicago for college.","zh":"Ahmad 去芝加哥上大学了。"},{"en":"Our new classmate is named Ahmad.","zh":"我们新来的同学叫 Ahmad。"},{"en":"I met Ahmad’s sister at the library.","zh":"我在图书馆遇到了 Ahmad 的姐姐。"}]}],"synonyms":["Ahmed"],"phonetic":"/ɑːˈmɑːd/","extraExplanation":["“Ahmad / Ahmed”源自阿拉伯语词根 ḥ-m-d（与“赞美”有关），常被解释为“更值得称赞的 / 最受赞美的”。","拼写差异多与地区转写习惯有关：Ahmad、Ahmed 在英语里都常见；读音也会因说话者语言背景略有不同。","在正式书写中，名字首字母通常大写：Ahmad。若需要更礼貌地称呼，可用 Mr. Ahmad（作为姓）或用全名。"]}
{"word":"Ahmadabad","summary":{"en":"Ahmadabad is an alternative spelling of Ahmedabad, a major city in Gujarat, India.","zh":"Ahmadabad 是 Ahmedabad 的一种拼写变体，指印度古吉拉特邦的重要城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a less common spelling of Ahmedabad, a large city in the Indian state of Gujarat.","zh":"艾哈迈达巴德（Ahmedabad）的较少见拼写形式：印度古吉拉特邦的一座大城市。"},"examples":[{"en":"My flight connects through Ahmadabad (Ahmedabad) before going to Mumbai.","zh":"我去孟买的航班会先在 Ahmadabad（Ahmedabad）中转。"},{"en":"The conference is in Ahmadabad, so I’m learning a few Gujarati greetings.","zh":"会议在 Ahmadabad 举行，所以我在学几句古吉拉特语的问候语。"}]}],"synonyms":["Ahmedabad","Amdavad"],"phonetic":"/ˈɑːmədəˌbɑːd/","extraExplanation":["“Ahmadabad”通常是把地名“Ahmedabad”按不同的转写规则写出来的变体；在英文新闻、地图、机场信息中更常见的标准拼写是“Ahmedabad”。","当地口语中你也可能看到/听到“Amdavad（阿姆达瓦德）”，这是古吉拉特语对该城市的常见称呼。"]}
{"word":"Ahmadi","summary":{"en":"Ahmadi usually means a member of (or relating to) the Ahmadiyya Muslim Community; it can also be a surname.","zh":"Ahmadi 通常指艾哈迈底亚穆斯林社群的成员或与其有关；也可作姓氏。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Ahmadiyya Muslim Community, a movement within Islam; or a member of this community.","zh":"与艾哈迈底亚穆斯林社群（伊斯兰教内的一个运动/团体）有关的；或该社群的成员。"},"examples":[{"en":"She is an Ahmadi Muslim and attends the local community center.","zh":"她是一位艾哈迈底亚穆斯林，会去当地的社群中心参加活动。"},{"en":"The Ahmadiyya community has built mosques in many countries.","zh":"艾哈迈底亚社群在许多国家建造了清真寺。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who belongs to the Ahmadiyya Muslim Community.","zh":"艾哈迈底亚穆斯林社群的成员（个人）。"},"examples":[{"en":"Several Ahmadis in the city organized a charity food drive.","zh":"城里的几位艾哈迈底亚成员组织了一次慈善食品募捐活动。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname), especially in communities with South Asian or Middle Eastern heritage.","zh":"姓氏（常见于南亚或中东背景的社群中）。"},"examples":[{"en":"Mr. Ahmadi will speak at the meeting tomorrow.","zh":"Ahmadi 先生将于明天在会议上发言。"}]}],"synonyms":["Ahmadiyya (related term)","Ahmadi Muslim (related term)"],"phonetic":"/ɑːˈmɑːdi/","extraExplanation":["“Ahmadi”常作为“Ahmadi Muslim / Ahmadiyya”相关用语出现：前者指个人身份，后者更常指整个社群或运动。","该词也可能只是姓氏，与宗教身份不一定有关；需要结合上下文判断。"]}
{"word":"ahmadi","summary":{"en":"Ahmadi most commonly means a member of the Ahmadiyya Muslim Community; it can also be a surname.","zh":"Ahmadi 最常指阿赫迈迪派（艾哈迈底耶）穆斯林团体成员；也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Ahmadiyya Muslim Community (also called an Ahmadiyya Muslim); sometimes used as an adjective meaning “related to the Ahmadiyya movement.”","zh":"阿赫迈迪派（艾哈迈底耶）穆斯林团体的成员；也可作形容词，表示“与阿赫迈迪派有关的”。"},"examples":[{"en":"He identifies as an Ahmadi Muslim and attends an Ahmadiyya mosque.","zh":"他认同自己是阿赫迈迪派穆斯林，并在阿赫迈迪派清真寺礼拜。"},{"en":"Ahmadi communities exist in many countries and often emphasize education and service.","zh":"阿赫迈迪派社群分布在许多国家，并常强调教育与社会服务。"}]},{"partOfSpeech":"n.","definition":{"en":"a surname (family name) found in several cultures, often derived from the name Ahmad.","zh":"姓氏（家族名）；在多种文化中可见，常源自名字 Ahmad（艾哈迈德）。"},"examples":[{"en":"Dr. Ahmadi will speak at the conference tomorrow.","zh":"Ahmadi 博士将于明天在会议上发言。"},{"en":"I met Ms. Ahmadi through a mutual friend.","zh":"我通过一位共同的朋友认识了 Ahmadi 女士。"}]}],"synonyms":["Ahmadi Muslim","Ahmadis","Ahmadiyya (adj./n.)"],"phonetic":"ɑˈmɑːdi","extraExplanation":["“Ahmadi”常与19世纪末印度旁遮普地区兴起的“Ahmadiyya（艾哈迈底耶）”宗教运动相关。由于不同穆斯林社群对其教义看法不一，在某些国家与语境中可能涉及身份与法律争议；写作或交流时适合使用中性、尊重的称呼，如“Ahmadi Muslim / Ahmadiyya Muslim”。"]}
{"word":"Ahmadis","summary":{"en":"“Ahmadis” are people who belong to the Ahmadiyya Muslim Community; “Ahmadi” can also describe things related to this community.","zh":"“Ahmadis”指阿赫马迪亚穆斯林团体的成员；“Ahmadi”也可作形容词，表示与该社群相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"members of the Ahmadiyya Muslim Community, a reform movement within Islam founded in British India in the late 1800s; the singular is “Ahmadi.”","zh":"阿赫马迪亚穆斯林团体（伊斯兰教内的改革运动）成员；单数为“Ahmadi”（阿赫马迪派信徒）。"},"examples":[{"en":"Many Ahmadis live in South Asia, Europe, and North America.","zh":"许多阿赫马迪派信徒生活在南亚、欧洲和北美。"},{"en":"The documentary interviewed Ahmadis about their community and beliefs.","zh":"这部纪录片采访了阿赫马迪派信徒，了解他们的社群与信仰。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Ahmadiyya Muslim Community (often written “Ahmadi” as an adjective).","zh":"与阿赫马迪亚穆斯林团体有关的（作形容词时常用“Ahmadi”）。"},"examples":[{"en":"They attended an Ahmadi community event.","zh":"他们参加了一场阿赫马迪派的社群活动。"},{"en":"He read about Ahmadi history in South Asia.","zh":"他阅读了有关南亚阿赫马迪派历史的资料。"}]}],"synonyms":["Ahmadiyya Muslims","members of the Ahmadiyya Muslim Community"],"phonetic":"/ɑːmɑːdiz/","extraExplanation":["“Ahmadi/ Ahmadis”来自“Ahmadiyya（阿赫马迪亚）”。在不同国家与语境中，这个称呼可能带有敏感性：一些穆斯林群体将其视为伊斯兰教内的独立宗派或边缘派别，而阿赫马迪派自身通常认为自己是穆斯林。写作或交流时，使用中性表述（如“Ahmadiyya Muslim Community members”）更稳妥。","专有名词大小写：一般写作“Ahmadi”（单数/形容词），“Ahmadis”（复数名词）；也常见“Ahmadiyya”指该社群或运动本身。"]}
{"word":"Ahmadiya","summary":{"en":"Ahmadiya (more commonly Ahmadiyya) is an Islamic movement; its followers are called Ahmadis.","zh":"Ahmadiya（更常见作 Ahmadiyya）指伊斯兰中的一支宗教运动，其信徒称为艾哈迈底。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Muslim religious movement founded in India in the late 1800s by Mirza Ghulam Ahmad; its followers are called Ahmadis (also spelled “Ahmadiyya”).","zh":"艾哈迈底亚（亦作 Ahmadiyya）：19世纪末在印度兴起的伊斯兰宗教运动，由米尔扎·古拉姆·艾哈迈德创立；其信徒称为艾哈迈底（Ahmadis）。"},"examples":[{"en":"She is doing a research project on the Ahmadiyya community in South Asia.","zh":"她正在研究南亚的艾哈迈底亚社群。"},{"en":"Some Ahmadis emphasize peaceful preaching and community service.","zh":"一些艾哈迈底信徒强调和平传教与社区服务。"}]}],"synonyms":["Ahmadiyya","Ahmadiyya Movement in Islam","Ahmadi Muslims","Ahmadis"],"phonetic":"/ˌɑːməˈdiːjə/","extraExplanation":["“Ahmadiya”更常见的英语拼写是“Ahmadiyya”（也见“Aḥmadiyya”），源自创立者名字 Ahmad（艾哈迈德）。日常写作中两种拼写常被混用，但学术或新闻报道里“Ahmadiyya”更标准。","该运动在不同国家的宗教与法律地位不一：在部分地区，艾哈迈底人可能面临社会争议或法律限制。写作或讨论时，使用中性表述（如“a Muslim movement / community”）更尊重也更准确。"]}
{"word":"ahmadiya","summary":{"en":"Ahmadiyya is an Islamic movement and community; it can also describe things related to that community.","zh":"Ahmadiyya 指艾哈迈迪亚这一伊斯兰教运动与团体，也可作形容词表示“与该团体相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an Islamic movement (the Ahmadiyya Muslim Community), founded in British India in the late 1800s by Mirza Ghulam Ahmad, with a strong focus on missionary work, education, and community service","zh":"一种伊斯兰教运动（艾哈迈迪亚穆斯林团体），19世纪末由米尔扎·古拉姆·艾哈迈德在英属印度创立，强调传教、教育与社区服务"},"examples":[{"en":"The Ahmadiyya community has built schools and hospitals in several countries.","zh":"艾哈迈迪亚团体在多个国家兴建了学校和医院。"},{"en":"She attended an Ahmadiyya mosque with her neighbors.","zh":"她和邻居一起去了一座艾哈迈迪亚清真寺。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to the Ahmadiyya movement or its members","zh":"与艾哈迈迪亚运动或其成员有关的"},"examples":[{"en":"He grew up in an Ahmadiyya family.","zh":"他在一个艾哈迈迪亚家庭中长大。"},{"en":"They organized an Ahmadiyya charity event in the city center.","zh":"他们在市中心组织了一场艾哈迈迪亚慈善活动。"}]}],"synonyms":["Ahmadiyya Muslim Community","Ahmadiyya movement","Ahmadis (members)"],"phonetic":"ˌɑməˈdiːjə","extraExplanation":["“Ahmadiyya”常译作“艾哈迈迪亚”。其成员常自称为穆斯林，但在一些国家与部分穆斯林群体中是否被视为正统伊斯兰存在争议；在谈论时建议使用中性、尊重的表述，例如“Ahmadiyya Muslim Community（艾哈迈迪亚穆斯林团体）”。","拼写提示：Ahmadiyya 末尾的 -iyya 在英文里常见于宗教/思想流派名称（类似于 Sufiyya / Salafiyya 等的构词方式），表示“某某派/某某主义/某某团体”。"]}
{"word":"Ahmadiyya","summary":{"en":"Ahmadiyya is a Muslim reform movement; its followers are called Ahmadis (Ahmadi Muslims).","zh":"Ahmadiyya 指一个伊斯兰改革运动；其追随者称为艾哈迈底派（Ahmadis/艾哈迈底派穆斯林）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Muslim reform movement founded in India in the late 1800s; its followers are called Ahmadi Muslims (Ahmadis).","zh":"艾哈迈底亚（也称艾哈迈底派）：19世纪末在印度兴起的伊斯兰改革运动；其追随者称为艾哈迈底派穆斯林（Ahmadis）。"},"examples":[{"en":"Ahmadiyya communities often emphasize education and charitable work.","zh":"艾哈迈底亚社群常常强调教育与慈善工作。"},{"en":"He learned about Ahmadiyya while studying different Muslim movements in South Asia.","zh":"他在研究南亚不同的伊斯兰运动时了解了艾哈迈底亚。"}]}],"synonyms":["Ahmadiyya Movement","Ahmadi (member term)","Ahmadi Islam (common label)"],"phonetic":"/ˌɑːməˈdiːjə/","extraExplanation":["“Ahmadiyya”在现实语境中常涉及宗教身份与社会争议：在一些穆斯林群体中，艾哈迈底派的宗教地位存在分歧，部分国家对其宗教实践有法律或社会限制。写作或讨论时，使用中性描述、尊重当事人自我认同会更稳妥。","词形提示：名词可说“Ahmadiyya (movement)”，成员常用“Ahmadi”或“Ahmadi Muslim”；形容词也常见“Ahmadi”。"]}
{"word":"Ahmadnagar","summary":{"en":"Ahmadnagar is a city in Maharashtra, India, and can also refer to the surrounding district; it’s often spelled Ahmednagar.","zh":"Ahmadnagar 是印度马哈拉施特拉邦的一座城市，也可指其周边的行政区（县）；常见拼写为 Ahmednagar。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in the Indian state of Maharashtra (also commonly spelled **Ahmednagar**).","zh":"印度马哈拉施特拉邦的一座城市（也常拼作 **Ahmednagar/艾哈迈德讷格尔**）。"},"examples":[{"en":"Ahmadnagar is in western India, not far from Pune.","zh":"Ahmadnagar 位于印度西部，离浦那不远。"},{"en":"She traveled to Ahmadnagar for work.","zh":"她因工作去了 Ahmadnagar。"}]},{"partOfSpeech":"n.","definition":{"en":"The district/region centered around the city of Ahmadnagar in Maharashtra.","zh":"以 Ahmadnagar 市为中心的行政区/地区（艾哈迈德讷格尔县）。"},"examples":[{"en":"Many villages in the Ahmadnagar district depend on agriculture.","zh":"Ahmadnagar 县的许多村庄依靠农业为生。"},{"en":"The project covers several towns across Ahmadnagar.","zh":"该项目覆盖 Ahmadnagar 地区的几个城镇。"}]}],"synonyms":["Ahmednagar"],"phonetic":"/ˌɑːmədˈnɑːɡɑːr/","extraExplanation":["“Ahmadnagar”和“Ahmednagar”常被视为同一地名的不同英文拼写；在地图、新闻与官方文件中更常见的是 **Ahmednagar**。","这是一个专有名词（地名），通常不加冠词；但在谈到行政区划时可说 “the Ahmadnagar district”。"]}
{"word":"Ahmadou","summary":{"en":"Ahmadou is a male given name, a variant of Ahmad, especially common in West Africa.","zh":"Ahmadou 是男性名字，是 Ahmad 的一种变体，尤其常见于西非地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a masculine given name (a variant of “Ahmad”), common in parts of West Africa; it is also used as a family name in some contexts.","zh":"男性名字（“Ahmad/艾哈迈德”的一种变体），在西非一些地区较常见；在某些语境下也可作姓氏。"},"examples":[{"en":"Ahmadou is my classmate from Senegal.","zh":"Ahmadou 是我来自塞内加尔的同学。"},{"en":"I met Ahmadou at the community center.","zh":"我在社区中心认识了 Ahmadou。"},{"en":"Ahmadou Diallo is the name on the document.","zh":"文件上的名字是 Ahmadou Diallo。"}]}],"synonyms":["Amadou","Ahmad","Ahmed"],"phonetic":"/ˌɑːməˈduː/","extraExplanation":["“Ahmadou”常见于法语影响较深的西非国家（如塞内加尔、马里、几内亚等）。在这些地区，名字拼写会受到法语拼写习惯影响，因此你也可能看到相近写法，如 Ahmadou、Amadou。","在英语里它通常被当作专有名词使用：首字母大写；称呼本人时可直接用 Ahmadou，也可用 Mr./Ms. + 姓氏（更正式）。"]}
{"word":"Ahmadpur","summary":{"en":"Ahmadpur is a South Asian place name used for multiple towns/villages, especially in Pakistan and India.","zh":"Ahmadpur 是南亚常见地名，用于多个城镇/村庄名称，尤其在巴基斯坦和印度常见。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A place name (proper noun). “Ahmadpur” refers to several towns/villages in South Asia, especially in Pakistan and India (for example, Ahmadpur East in Punjab, Pakistan).","zh":"地名（专有名词）。“Ahmadpur”指南亚多个城镇/村庄名称，主要见于巴基斯坦和印度（例如：巴基斯坦旁遮普省的 Ahmadpur East）。"},"examples":[{"en":"My friend’s family is from Ahmadpur East in Punjab, Pakistan.","zh":"我朋友的家人在巴基斯坦旁遮普省的 Ahmadpur East。"},{"en":"The bus route passes through Ahmadpur before reaching Bahawalpur.","zh":"这条巴士线路在到达 Bahawalpur 之前会经过 Ahmadpur。"}]}],"synonyms":["(no direct synonyms; it is a proper place name)"],"phonetic":"ˈɑːmɑːdˌpʊr","extraExplanation":["“Ahmadpur”常见于南亚地名：Ahmad/Ahmad（艾哈迈德，常见人名，源自阿拉伯语）+ -pur（常见地名后缀，来自梵语/波斯化用法，意思接近“城镇、聚落”）。因此 Ahmadpur 往往可理解为“艾哈迈德之城/艾哈迈德的聚落”。","因为同名地点很多，写作或旅行时通常会加地区或方向来区分，例如 Ahmadpur East（艾哈迈德布尔东镇）或加上省/邦名。"]}
{"word":"Ahmar","summary":{"en":"Ahmar is most commonly a personal name; in Arabic it also means “red,” but that sense is less common in everyday English.","zh":"Ahmar 最常见的用法是人名；在阿拉伯语中它也有“红色”的意思，但在日常英语里较少直接这样使用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper name) A given name used in Arabic- and South Asian–influenced communities; often associated with the Arabic root meaning “red,” and sometimes interpreted as “reddish” or “brownish.”","zh":"（专有名词）人名，常见于阿拉伯语及受南亚文化影响的社群；与阿拉伯语中表示“红色”的词根相关，有时被理解为“偏红的 / 红褐色的”。"},"examples":[{"en":"Ahmar is my classmate; his family speaks Urdu at home.","zh":"Ahmar 是我的同学；他家里说乌尔都语。"},{"en":"In some families, the name Ahmar is chosen because it connects to the idea of “red.”","zh":"在一些家庭里，会因为“红色”的含义而选择 Ahmar 这个名字。"}]},{"partOfSpeech":"adj.","definition":{"en":"(From Arabic, less common in English) “Red” or “reddish,” used mainly in Arabic contexts or in transliteration.","zh":"（源自阿拉伯语，英语中较少见）“红的 / 偏红的”，多出现在阿拉伯语语境或音译文本中。"},"examples":[{"en":"The Arabic word ahmar means “red,” as in “al-bahr al-ahmar” (the Red Sea).","zh":"阿拉伯语里 ahmar 的意思是“红色”，例如 “al-bahr al-ahmar”（红海）。"},{"en":"In a transliterated phrase, you might see ahmar to describe a red color.","zh":"在音译的短语里，你可能会看到 ahmar 用来描述红色。"}]}],"synonyms":["(name)","(Arabic color word) red"],"phonetic":"/ˈɑːmɑːr/","extraExplanation":["“Ahmar/ahmar”常见于从阿拉伯字母转写（transliteration）的文本里：同一个词可能出现不同拼写（如 ahmar, aḥmar），取决于转写系统。","作为人名时，它的具体含义会因家庭语言与文化解释而不同；如果你是在护照、学校名册或社交媒体上看到它，通常应当把它当作专有名词（名字）来理解与使用。"]}
{"word":"Ahmed","summary":{"en":"Ahmed is a common male name of Arabic origin; it can also be a surname.","zh":"Ahmed 是源自阿拉伯语的常见男性名字；也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name), common in many Muslim communities; from Arabic, often explained as “most praised” or “highly commendable.”","zh":"男性名字（名），在许多穆斯林社群中很常见；源自阿拉伯语，常被解释为“最受赞美的 / 非常值得称赞的”。"},"examples":[{"en":"Ahmed is my classmate from Egypt.","zh":"Ahmed 是我来自埃及的同学。"},{"en":"My neighbor Ahmed helped me carry the groceries.","zh":"我的邻居 Ahmed 帮我提了杂货。"},{"en":"Ahmed and Sara are working on the project together.","zh":"Ahmed 和 Sara 正在一起做这个项目。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname) used by some people.","zh":"姓氏（一些人使用的家族姓）。"},"examples":[{"en":"Dr. Ahmed will see you now.","zh":"Ahmed 医生现在要为你看诊。"},{"en":"The article was written by Nadia Ahmed.","zh":"这篇文章是 Nadia Ahmed 写的。"}]}],"synonyms":["Ahmad"],"phonetic":"/ɑːˈmɛd/","extraExplanation":["“Ahmed”常见发音为 /ɑːˈmɛd/（美式近似“ah-MED”）。也常见拼写变体如 “Ahmad”。","从文化上看，这是在阿拉伯语及穆斯林文化圈很常见的名字之一，与名字 “Muhammad” 同源（都来自表示“赞美”的词根），但在英语语境中通常只当作人名使用，无需翻译其字面含义。"]}
{"word":"ahmed","summary":{"en":"Ahmed is a common Arabic-origin male name meaning “most praised.”","zh":"Ahmed 是一个常见的阿拉伯语来源男性名字，意思是“最受赞美的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a common masculine given name of Arabic origin, meaning “most praised” or “most commendable.”","zh":"一个常见的阿拉伯语来源的男性名字，含义为“最受赞美的 / 最值得称赞的”。"},"examples":[{"en":"Ahmed is my classmate; he moved here from Cairo.","zh":"Ahmed 是我的同学；他从开罗搬到这里来。"},{"en":"Can I speak with Ahmed, please?","zh":"我可以和 Ahmed 说话吗？"},{"en":"Ahmed wrote his name clearly on the form.","zh":"Ahmed 在表格上把自己的名字写得很清楚。"}]}],"synonyms":["Ahmad"],"phonetic":"/ɑːˈmɛd/","extraExplanation":["“Ahmed”（也常拼作 Ahmad）来自阿拉伯语词根 ḥ-m-d（与“赞美”相关）。它与 Muhammad / Mohammed（穆罕默德）同源，因此在许多穆斯林文化圈非常常见。不同国家/地区的拼写和读法可能略有差异。"]}
{"word":"Ahmedabad","summary":{"en":"Ahmedabad is a major city in Gujarat, India.","zh":"Ahmedabad（艾哈迈达巴德）是印度古吉拉特邦的一座重要城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large city in the state of Gujarat, western India, known as a major center for business, textiles, education, and historic architecture.","zh":"印度西部古吉拉特邦的一座大城市，以商业、纺织业、教育以及历史建筑闻名。"},"examples":[{"en":"Ahmedabad is one of the largest cities in Gujarat.","zh":"艾哈迈达巴德是古吉拉特邦最大的城市之一。"},{"en":"She traveled to Ahmedabad for a conference.","zh":"她去艾哈迈达巴德参加会议。"},{"en":"The old city of Ahmedabad has many historic buildings.","zh":"艾哈迈达巴德老城区有许多历史建筑。"}]}],"synonyms":["Amdavad"],"phonetic":"/ˈɑːmədəbæd/","extraExplanation":["“Ahmedabad”常见读音为 /ˈɑːmədəbæd/（美式 IPA）。在印度本地语言（如古吉拉特语）中，这座城市也常被称为 “Amdavad”。","名称一般被认为与古吉拉特苏丹艾哈迈德·沙阿（Ahmed Shah）有关；城市以其多元宗教与文化遗产、以及与纺织业相关的工业历史而著名。","写作中常见搭配：Ahmedabad city / Ahmedabad district（行政区）/ old city of Ahmedabad（老城）/ Ahmedabad airport（机场）等。"]}
{"word":"ahmedi","summary":{"en":"Ahmedi is usually a personal name or surname related to Ahmad/Ahmed.","zh":"Ahmedi 通常是与 Ahmad/Ahmed（艾哈迈德）相关的姓名或姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname or given name (often Middle Eastern, Turkish, Albanian, or South Asian), meaning “related to Ahmad/Ahmed” or “descendant of Ahmad/Ahmed.”","zh":"一个姓氏或名字（常见于中东、土耳其、阿尔巴尼亚或南亚等地区），含义多为“与 Ahmad/Ahmed（艾哈迈德）有关”或“艾哈迈德的后裔/家族成员”。"},"examples":[{"en":"Mr. Ahmedi will speak at the meeting today.","zh":"Ahmedi 先生今天会在会议上发言。"},{"en":"I met a classmate named Ahmedi in college.","zh":"我在大学认识了一位名叫 Ahmedi 的同学。"}]}],"synonyms":["Ahmadi","Ahmed","Ahmad"],"phonetic":"/ɑːˈmɛdi/","extraExplanation":["“Ahmedi”通常是专名（姓名/姓氏），在英语里一般不翻译，更多是音译或保持原拼写。","它常与名字“Ahmad/Ahmed（意为‘更受称赞的’）”相关，因此在不同语言/地区会出现拼写变体，如 Ahmadi、Ahmedi 等。","发音会因来源语言不同而变化：英语语境中常按拼写读作 /ɑːˈmɛdi/；在土耳其语或巴尔干地区可能更接近“ah-MEH-dee”。"]}
{"word":"Ahmednagar","summary":{"en":"Ahmednagar: a city in Maharashtra, India; also spelled Ahmadnagar.","zh":"Ahmednagar：印度马哈拉施特拉邦的一座城市；也写作 Ahmadnagar。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in the state of Maharashtra, western India (also spelled “Ahmadnagar”), known for its historical fort and as a regional administrative center.","zh":"印度西部马哈拉施特拉邦的一座城市（也拼作“Ahmadnagar/艾哈迈德讷格尔”），以历史悠久的城堡和地区行政中心而闻名。"},"examples":[{"en":"Ahmednagar is a district headquarters in Maharashtra.","zh":"Ahmednagar 是马哈拉施特拉邦的一个地区行政中心。"},{"en":"The Ahmednagar Fort is an important historical site.","zh":"Ahmednagar 堡垒是一处重要的历史遗址。"},{"en":"She traveled from Pune to Ahmednagar by bus.","zh":"她坐公交从浦那去 Ahmednagar。"}]}],"synonyms":["Ahmadnagar"],"phonetic":"/ˈɑːmədˌnʌɡər/","extraExplanation":["“Ahmednagar”与“Ahmadnagar”是同一个地名的两种常见英语拼写：前者更常见于近现代拼写习惯，后者更接近音译。“Ahmed/Ahmad”来自阿拉伯语人名（意为“更值得称赞的”），“-nagar”在多种印度语言中常见，意思是“城/城市”。","在历史与文化语境中，Ahmednagar 常与德干地区的中世纪历史、艾哈迈德讷格尔苏丹国（Nizam Shahi dynasty）以及“Ahmednagar Fort（城堡）”等关键词一起出现。"]}
{"word":"Ahmeek","summary":{"en":"Ahmeek is mainly a place name in Michigan; it also comes from an Ojibwe word meaning “beaver.”","zh":"Ahmeek 主要是密歇根州的地名；它也源自奥吉布韦语，意思是“海狸”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A small village in Michigan’s Upper Peninsula (Keweenaw Peninsula), historically connected to copper mining.","zh":"（专有名词）美国密歇根州上半岛（基威诺半岛）的一座小村庄，历史上与铜矿开采有关。"},"examples":[{"en":"Ahmeek is a tiny village on Michigan’s Keweenaw Peninsula.","zh":"Ahmeek 是密歇根州基威诺半岛上的一个小村庄。"},{"en":"Some travelers visit Ahmeek to learn about the region’s copper-mining history.","zh":"一些旅行者会去 Ahmeek 了解当地的铜矿历史。"}]},{"partOfSpeech":"n.","definition":{"en":"(From Ojibwe) “Beaver”; used in some place names and historical references.","zh":"（源自奥吉布韦语）“海狸”；常见于一些地名或历史语境中。"},"examples":[{"en":"The name Ahmeek comes from an Ojibwe word meaning “beaver.”","zh":"Ahmeek 这个名字源自奥吉布韦语，意思是“海狸”。"},{"en":"You may see “Ahmeek” in older documents about the Great Lakes region.","zh":"你可能会在关于五大湖地区的较老文献中看到 “Ahmeek”。"}]}],"synonyms":["(place) —","beaver"],"phonetic":"/əˈmiːk/","extraExplanation":["“Ahmeek”在英语中通常作为地名出现（尤其指密歇根州的小镇）。在美国地名里，使用原住民语言（如 Ojibwe）的词根很常见，往往与当地动物、地形或资源有关。","发音在英语中常读作三音节弱起：uh-MEEK（重音在第二部分），因此美式音标常写作 /əˈmiːk/。"]}
{"word":"ahmet","summary":{"en":"Ahmet is a common Turkish male first name used as a proper noun in English.","zh":"Ahmet 是常见的土耳其男性名字，在英语中作为专有名词使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name), common in Turkey and among Turkish-speaking communities; English speakers may treat it as a proper noun.","zh":"男性名字（名），在土耳其及土耳其语社群中很常见；英语中通常作为专有名词使用。"},"examples":[{"en":"Ahmet is my classmate from Istanbul.","zh":"Ahmet 是我来自伊斯坦布尔的同学。"},{"en":"I met Ahmet at the conference last year.","zh":"我去年在会议上认识了 Ahmet。"}]}],"synonyms":["Ahmed","Ahmad"],"phonetic":"/ɑːˈmɛt/","extraExplanation":["“Ahmet”是土耳其语中非常常见的男性名，来源于阿拉伯语名字“Ahmad/Ahmed”的变体，含义与“受赞美的”相关。","英语里人名一般不翻译，通常保留原拼写；在正式写作中首字母大写。","不同地区/个人的读音可能略有差异；如果你在介绍自己，直接说“Hi, I’m Ahmet.”最自然。"]}
{"word":"Ahnfeltia","summary":{"en":"Ahnfeltia is a genus of red seaweed, sometimes used for gel-forming extracts.","zh":"Ahnfeltia 指一种红藻属海藻，有时用于提取可凝胶的成分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of red seaweed (red algae) found in cold marine waters, some species of which are used to produce agar-like substances.","zh":"一种生长在寒冷海域的红藻属（海藻的一类）；其中一些种类可用于提取类似琼脂的物质。"},"examples":[{"en":"Researchers collected Ahnfeltia from the rocky shore to study its cell walls.","zh":"研究人员从岩石海岸采集了 Ahnfeltia，用来研究它的细胞壁。"},{"en":"In some regions, Ahnfeltia has been harvested as a source of gelling compounds.","zh":"在一些地区，人们会采收 Ahnfeltia 作为凝胶物质的来源。"}]}],"synonyms":["red algae","red seaweed"],"phonetic":"/ˌɑnˈfɛltiə/","extraExplanation":["“Ahnfeltia”是拉丁学名（属名），在英文写作中通常首字母大写并用斜体：Ahnfeltia。日常口语里更常用的泛称是“red algae / red seaweed（红藻/红海藻）”。","该属名称来自19世纪的分类命名传统，许多属名会纪念早期植物学家或博物学家；因此它常见于生物学、海洋学与食品/材料相关文献，而不太出现在普通生活对话中。"]}
{"word":"ahnfeltia","summary":{"en":"Ahnfeltia is a scientific name for a genus of red seaweeds, some used to produce agar.","zh":"Ahnfeltia 是红藻的一属学名，其中一些种类可用于生产琼脂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of red seaweeds (red algae) found in cold oceans, some species of which are harvested to make agar (a jelly-like substance used in food and laboratories).","zh":"（红藻的一属）多生于寒冷海域的红色海藻；其中一些种类可用来提取琼脂（用于食品与实验室的凝胶物质）。"},"examples":[{"en":"Ahnfeltia plicata is a red alga that has been used as a source of agar.","zh":"Ahnfeltia plicata（褶皱阿氏藻）是一种红藻，曾被用作提取琼脂的来源。"},{"en":"In cold coastal waters, Ahnfeltia can form dense patches on rocks.","zh":"在寒冷的沿海水域，Ahnfeltia 可能会在岩石上形成成片的密集群落。"}]}],"synonyms":["red algae","seaweed","Ahnfeltia plicata"],"phonetic":"/ɑnˈfɛltiə/","extraExplanation":["“Ahnfeltia”是拉丁化的学名，用于生物分类（属名），日常英语里不常见，更多出现在海洋生物学、藻类学或食品/实验材料（琼脂）相关语境中。","该属名来自人名（常见于生物命名传统）：以瑞典植物学家/自然学者 Nils Johan Andersson Ahnfelt（常被简称为 Ahnfelt）命名。"]}
{"word":"aho","summary":{"en":"“aho” is a Japanese-derived slang word meaning “idiot/fool,” sometimes used as an insult or jokingly in anime-style contexts.","zh":"“aho”是源自日语的俚语，意思是“笨蛋/傻瓜”，常见于动漫或日语文化语境中，可作玩笑也可能带侮辱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, from Japanese) A foolish or stupid person; “idiot,” “fool.”","zh":"（俚语，源自日语）笨蛋；傻瓜。"},"examples":[{"en":"He called his friend “aho” as a joke, but it can sound rude to some people.","zh":"他开玩笑叫朋友“aho”，但对有些人来说听起来会很没礼貌。"},{"en":"In some anime, you may hear characters shout “Aho!” when they’re angry.","zh":"在一些动漫里，你可能会听到角色生气时喊“Aho!”。"}]},{"partOfSpeech":"int.","definition":{"en":"(interjection, from Japanese) An insult meaning “Idiot!” or “You fool!”","zh":"（感叹词，源自日语）骂人的话：笨蛋！傻瓜！"},"examples":[{"en":"“Aho!” she shouted, then walked away.","zh":"“Aho！”她喊了一句就走开了。"}]}],"synonyms":["idiot","fool","dummy","moron"],"phonetic":"/ˈɑːhoʊ/","extraExplanation":["“Aho（アホ／阿呆）”在日语里常见于关西方言环境；语气强弱取决于场景、关系和语调。和英语里的“idiot”类似，可能是玩笑，也可能是冒犯。","在英语日常交流中，“aho”并不是常用词，多出现在动漫、游戏、网络语境或讨论日语文化时。正式场合不建议使用。"]}
{"word":"Ahola","summary":{"en":"Ahola is most commonly a Finnish surname; it can also appear as a Finnish place name.","zh":"Ahola 最常见是芬兰姓氏；也可能作为芬兰地名出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Finnish surname (family name).","zh":"一个芬兰姓氏（家族姓）。"},"examples":[{"en":"My colleague, Mr. Ahola, is from Finland.","zh":"我的同事 Ahola 先生来自芬兰。"},{"en":"Ahola is a common last name in some parts of Finland.","zh":"Ahola 在芬兰的一些地区是比较常见的姓氏。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used in Finland (less common in everyday English).","zh":"芬兰的地名（在日常英语中较少见）。"},"examples":[{"en":"They visited a farm called Ahola during their trip.","zh":"他们旅行时参观了一个叫 Ahola 的农场。"}]}],"phonetic":"/əˈhoʊlə/","extraExplanation":["你输入的“Ahola”常被当作专有名词（尤其是芬兰姓氏/地名）。如果你其实想写的是夏威夷语 “aloha”（常见问候语，意为“你好/再见/爱与和平的精神”），拼写是 a-l-o-h-a。需要的话我也可以给你“aloha”的完整词条与用法对比。"]}
{"word":"Aholah","summary":{"en":"Aholah is a biblical symbolic name in Ezekiel 23, commonly interpreted as representing Samaria (the northern kingdom of Israel).","zh":"Aholah 是《以西结书》23章中的象征性名字，通常被解释为指代撒马利亚（以色列北国）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A symbolic female name in the Bible (Ezekiel 23) that represents Samaria, the capital of the northern kingdom of Israel, in a story criticizing idolatry and unfaithfulness.","zh":"《圣经》中一个象征性的女性名字（《以西结书》23章），用来指代以色列北国的首都撒马利亚，在寓言中批评偶像崇拜与不忠。"},"examples":[{"en":"In Ezekiel 23, Aholah and her sister Aholibah are used as symbols in a prophetic allegory.","zh":"在《以西结书》23章中，Aholah 和她的妹妹 Aholibah 被用作先知式寓言中的象征人物。"},{"en":"Some study notes explain that Aholah stands for Samaria, while Aholibah stands for Jerusalem.","zh":"一些研读注释指出，Aholah 象征撒马利亚，而 Aholibah 象征耶路撒冷。"}]}],"phonetic":"/əˈhoʊlə/","extraExplanation":["Aholah 是希伯来语名字的音译，出自《以西结书》23章。该章用两位“姐妹”来象征两个政治与宗教实体：Aholah 通常被理解为撒马利亚（北国以色列），Aholibah 通常被理解为耶路撒冷（南国犹大）。","这个名字多见于宗教文本、圣经研究与文学/文化讨论中；日常英语里几乎不会把它当作普通词使用。"]}
{"word":"ahold","summary":{"en":"Ahold means “in your grip,” and in “get ahold of” it means to contact someone or obtain something (informal).","zh":"“ahold”表示“抓住/握住”；在短语“get ahold of”中表示“联系到某人”或“弄到某物”（偏口语、非正式）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"holding or grasping something; in one’s grip.","zh":"抓住；握住（某物）。"},"examples":[{"en":"Hold on tight—you’ve got ahold of the rope now.","zh":"抓紧点——你现在已经抓住绳子了。"},{"en":"She got ahold of his arm to stop him from walking away.","zh":"她抓住他的胳膊，阻止他走开。"}]},{"partOfSpeech":"phrase","definition":{"en":"(In the phrase “get ahold of”) to contact someone or obtain something, often after some effort.","zh":"（常用于短语“get ahold of”）联系到某人；弄到/拿到某物（常带“费了一番劲”的感觉）。"},"examples":[{"en":"I finally got ahold of my teacher by email.","zh":"我终于通过邮件联系上了老师。"},{"en":"Can you get ahold of the report before the meeting?","zh":"你能在开会前把报告弄到吗？"},{"en":"I tried to get ahold of you all day.","zh":"我一整天都在试着联系你。"}]}],"synonyms":["hold","grip","grab","reach (someone)","contact","get in touch with"],"phonetic":"/əˈhoʊld/","extraExplanation":["“ahold”主要见于美式口语/非正式写作；更正式的表达常用“a hold”（名词短语）或直接用“hold / contact / reach”。例如：正式场合可说“I finally reached her.”（我终于联系上她了）。","拼写提醒：在“get ahold of”里常写作一个词“ahold”，但也有人写成“a hold”。两种都能见到；如果写正式邮件，优先用“get a hold of / reach / contact”。"]}
{"word":"aholds","summary":{"en":"“Ahold” means a grip or control, and it’s most commonly used in the informal phrases “get/take ahold of” (grasp; contact).","zh":"“ahold”指“抓住/把握；掌控”，最常见于非正式短语“get/take ahold of”（抓住；联系上）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a grip or a way of holding something; control over something","zh":"抓住（的动作/方式）；（对某事的）控制、掌握"},"examples":[{"en":"She got a firm ahold of the railing before stepping down.","zh":"她下台阶前先牢牢抓住了栏杆。"},{"en":"The company is trying to get ahold of the market again.","zh":"这家公司正努力重新掌控市场。"}]},{"partOfSpeech":"phrase","definition":{"en":"used in the phrases “get ahold of” or “take ahold of,” meaning to grasp something or to contact someone (common in spoken American English, somewhat informal)","zh":"用于短语“get/take ahold of”，表示“抓住；联系上（某人）”（美式口语较常见，略非正式）"},"examples":[{"en":"Can you get ahold of your brother and tell him dinner is ready?","zh":"你能联系上你弟弟，告诉他晚饭好了么？"},{"en":"Take ahold of the handle and pull gently.","zh":"抓住把手，轻轻拉。"},{"en":"I couldn’t get ahold of her all day.","zh":"我一整天都联系不上她。"}]}],"synonyms":["grip","hold","grasp","control (context)","get in touch with (for contact meaning)"],"phonetic":"/əˈhoʊld/","extraExplanation":["“ahold”常被认为是非正式/口语用法，尤其在美式英语中很自然。更正式或更书面时，常用“hold”（抓住）或“get in touch with / contact”（联系）。","你输入的“aholds”不太常见：有时可能是把短语里“a hold(s)”连写了，或把“ahold”误加了-s。通常写作“ahold”，例如“get ahold of someone / something”。"]}
{"word":"Aholla","summary":{"en":"“Aholla” isn’t a standard word; it’s usually a misspelling of “holla” or confusion with “aloha.”","zh":"“Aholla”不是标准用词；通常是把“holla”拼错，或与“aloha”混淆。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as a misspelling or playful spelling of “holla” (slang for “hey!” or “shout”).","zh":"不是标准英语单词；多见于把俚语“holla”（表示“嗨！”或“喊叫”）拼错或玩笑式拼写的情况。"},"examples":[{"en":"I’ve only seen “aholla” online—people usually mean “holla.”","zh":"我只在网上见过“aholla”，大家通常是想写“holla”。"},{"en":"Text me when you get there—holla if you need help.","zh":"你到了就给我发消息——需要帮忙就喊我一声。"}]},{"partOfSpeech":"other","definition":{"en":"Sometimes confused with “aloha,” a Hawaiian word used for “hello,” “goodbye,” and “love/affection.”","zh":"有时也会被误写成“aloha”（夏威夷语），可表示“你好”“再见”，也可表示“爱/关怀”。"},"examples":[{"en":"They greeted us with “Aloha!” when we arrived in Hawaii.","zh":"我们到夏威夷时，他们用“Aloha!”向我们问好。"}]}],"synonyms":["holla","hey","hi","aloha (different word)"],"phonetic":"/əˈhɑlə/","extraExplanation":["“holla”源自“holler（大声喊叫）”，在美式口语/嘻哈文化中常用作打招呼或表示“联系我/告诉我”。在正式写作中不建议使用。","如果你本来想输入的是西班牙语“hola（你好）”，英语里通常直接写“hola”，而不是“aholla”。"]}
{"word":"aholt","summary":{"en":"Aholt is usually a surname (and sometimes a place name), not a common English vocabulary word.","zh":"Aholt 通常是姓氏（有时也作地名），不是常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Aholt (proper noun) is most commonly a family name (surname). It may also appear as a place name in some German-speaking regions.","zh":"Aholt（专有名词）最常见作姓氏使用；在部分德语地区也可能作为地名出现。"},"examples":[{"en":"Ms. Aholt will lead the meeting today.","zh":"Aholt 女士今天将主持会议。"},{"en":"I found the name Aholt in an old family record.","zh":"我在一份旧的家族记录里发现了 Aholt 这个名字。"}]}],"phonetic":"/ˈeɪhoʊlt/","extraExplanation":["“Aholt”并不是常见的英语词汇，更像是姓名或地名，因此在英文句子里通常不翻译，直接保留拼写。","如果你想查的是公司名“Ahold”（荷兰零售集团，常见于“Ahold Delhaize”），或者你其实想输入的是短语“a holt”（古英语/古义里 holt 可指“小树林、林地”），告诉我上下文我可以帮你对照正确词与用法。"]}
{"word":"Ahom","summary":{"en":"Ahom refers to a people from Assam, India, their culture/history, and also their historical Tai-Ahom language.","zh":"Ahom 指印度阿萨姆的阿洪民族及其文化历史，也可指他们的历史语言（阿洪语/泰—阿洪语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a people from Assam (northeastern India), historically founders and rulers of the Ahom Kingdom (c. 13th–19th centuries).","zh":"阿洪人（印度东北部阿萨姆的民族），历史上建立并统治阿洪王国（约13—19世纪）。"},"examples":[{"en":"The Ahom ruled much of Assam for several centuries.","zh":"阿洪人统治了阿萨姆的许多地区数百年。"},{"en":"Many Assamese traditions reflect Ahom influence.","zh":"许多阿萨姆的传统都带有阿洪人的影响。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Ahom people, their history, or culture.","zh":"阿洪人的；与阿洪历史或文化有关的。"},"examples":[{"en":"They visited an Ahom-era temple site.","zh":"他们参观了一处阿洪时期的寺庙遗址。"},{"en":"The museum has an Ahom cultural section.","zh":"博物馆里有一个阿洪文化展区。"}]},{"partOfSpeech":"n.","definition":{"en":"the Tai-Ahom language, historically spoken by the Ahom; today it is mostly used in study, rituals, and revitalization efforts.","zh":"阿洪语（泰语支的一种；历史上由阿洪人使用，如今多用于研究、仪式及复兴活动）。"},"examples":[{"en":"Some scholars study Ahom manuscripts to understand Assam’s history.","zh":"一些学者研究阿洪语手稿，以了解阿萨姆的历史。"},{"en":"Community groups are working to revive Ahom.","zh":"一些社区团体正在推动阿洪语复兴。"}]}],"synonyms":["Tai-Ahom","Ahom people"],"phonetic":"/əˈhɑːm/","extraExplanation":["“Ahom”常与“Ahom Kingdom（阿洪王国）”一起出现：13世纪阿洪人从东南亚一带迁入阿萨姆，建立政权，并在与莫卧儿帝国的冲突中长期保持影响力。","语言背景：阿洪语属于台语系（Tai），与泰语、老挝语等同属更大的语系谱系；许多现存资料来自棕榈叶或纸质手稿。","文化语境中也会见到“Tai-Ahom（泰—阿洪）”这一说法，用来更明确地指出其台语系渊源。"]}
{"word":"ahom","summary":{"en":"Ahom refers to a Tai-origin people who ruled Assam, something related to them, or their historic (now mostly extinct) language.","zh":"Ahom 指起源于泰语族并曾统治阿萨姆的阿霍姆人，也可指与其相关的事物，或其历史上使用、现多已不再通用的阿霍姆语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a people of Tai origin who founded and ruled the Ahom Kingdom in Assam (northeast India) for centuries; also a member of this group","zh":"阿霍姆人（泰语族起源的族群，曾在印度东北阿萨姆建立并统治阿霍姆王国数百年）；也指该族群的成员"},"examples":[{"en":"The Ahom ruled much of Assam for a long period in medieval history.","zh":"在中世纪历史中，阿霍姆人长期统治了阿萨姆的大部分地区。"},{"en":"Some families in Assam trace their ancestry to the Ahom.","zh":"阿萨姆的一些家庭会追溯自己的祖先到阿霍姆人。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Ahom people, their history, or their culture","zh":"与阿霍姆人及其历史或文化有关的；阿霍姆的"},"examples":[{"en":"Researchers study Ahom inscriptions to understand the region’s past.","zh":"研究人员通过阿霍姆铭文来了解该地区的过去。"},{"en":"An Ahom cultural festival was held in the town center.","zh":"镇中心举办了阿霍姆文化节。"}]},{"partOfSpeech":"n.","definition":{"en":"the (largely extinct) Ahom language, a Tai language once used in the Ahom Kingdom, especially in historical documents and rituals","zh":"阿霍姆语（基本已不再日常使用的泰语族语言；过去用于阿霍姆王国，尤其见于历史文献与仪式用语）"},"examples":[{"en":"Many old chronicles were written in Ahom and later translated into Assamese.","zh":"许多古代编年史用阿霍姆语写成，后来被译成阿萨姆语。"},{"en":"A few specialists are learning Ahom to read original manuscripts.","zh":"一些专家正在学习阿霍姆语以阅读原始手稿。"}]}],"synonyms":["Tai-Ahom","Ahom people","Ahom language"],"phonetic":"/ɑˈhɑːm/","extraExplanation":["“Ahom”常见于历史、民族学与语言学语境。阿霍姆王国（约13世纪至19世纪）在阿萨姆历史上影响深远，尤其以与莫卧儿势力的对抗（如萨拉伊哈特战役）而闻名。","书写与文献方面，阿霍姆语常出现在传统编年史（如 *Buranji*）及宗教/仪式文本中；现代阿萨姆地区也有文化复兴与学术整理的努力。"]}
{"word":"ahong","summary":{"en":"“Ahong” is most commonly used as a friendly personal nickname (A- + Hong), especially in Chinese-speaking contexts.","zh":"“Ahong”最常见用法是亲昵的人名昵称（A- + Hong），多见于华语语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a personal name or nickname (often used in Chinese-speaking communities), typically formed with the friendly prefix “A-” + the given name “Hong.”","zh":"人名或昵称（常见于华语社群），通常由亲昵称呼前缀“A-”加上名字“Hong（宏/红/洪等）”构成。"},"examples":[{"en":"Ahong will pick us up after class.","zh":"阿宏下课后会来接我们。"},{"en":"Everyone calls him Ahong, but his full name is Hongwei.","zh":"大家都叫他阿宏，但他的全名是宏伟。"}]}],"synonyms":["A-Hong","Hong (given name)"],"phonetic":"/ɑˈhɔŋ/","extraExplanation":["“A-（阿）”在中文口语里常用来表示亲近、熟悉的称呼方式，常加在名字前：如 A-Ming（阿明）、A-Hua（阿华）。\n“Hong”对应的汉字可能不同（宏/红/洪等），含义也会随汉字变化；如果你能告诉我你想表达的语言/地区或对应汉字，我可以给出更准确的解释与发音建议。"]}
{"word":"ahorse","summary":{"en":"Horse usually means the animal you can ride; it can also be a verb in set phrases like “horse around.”","zh":"Horse 通常指“马”；也可作动词，常见于固定搭配如“horse around（胡闹）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, strong animal that people ride, use for work, or keep for sport","zh":"马；一种大型有力的动物，人们用来骑乘、劳动或运动竞技"},"examples":[{"en":"She learned to ride a horse when she was eight.","zh":"她八岁时开始学骑马。"},{"en":"The farmer used a horse to pull the cart.","zh":"农夫用马来拉车。"},{"en":"They watched the horses race at the track.","zh":"他们在赛马场看赛马比赛。"}]},{"partOfSpeech":"v.","definition":{"en":"to provide a horse for riding or transport; to travel on horseback (often used in set phrases)","zh":"使骑马；提供马匹（用于骑乘或运输）；（常用于固定搭配）骑马出行"},"examples":[{"en":"In the old days, messengers horsed from town to town.","zh":"过去，信使骑马往返于各个城镇之间。"},{"en":"The film shows soldiers horsing across the plains.","zh":"电影里展示了士兵们骑马穿越平原。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal) to fool around or behave in a silly, rough way (usually in: “horse around”)","zh":"（非正式）胡闹；瞎闹（常用于：horse around）"},"examples":[{"en":"Stop horsing around and finish your homework.","zh":"别胡闹了，快把作业写完。"},{"en":"The kids were horsing around in the yard.","zh":"孩子们在院子里打闹。"}]}],"synonyms":["equine","stallion","mare","pony"],"phonetic":"/hɔrs/","extraExplanation":["你输入的“ahorse”更像是把冠词 a 和名词 horse 连在一起写了：a horse = “一匹马”。英语里冠词通常与名词分开写（a horse, the horse）。","horse 也常见于习语：\n- hold your horses = “别急/冷静点”\n- get off your high horse = “别摆架子/别高高在上”\n- straight from the horse’s mouth = “第一手消息/权威来源”"]}
{"word":"ahorseback","summary":{"en":"“Ahorseback” is a rare, old-fashioned word meaning “on horseback; riding a horse.” In modern English, people usually say “on horseback.”","zh":"“ahorseback”是较少见、偏旧的表达，意思是“骑在马背上/骑马”。现代英语更常用“on horseback”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(rare/old-fashioned) Riding a horse; mounted on a horse.","zh":"（罕见/较旧用法）骑在马背上；骑马的。"},"examples":[{"en":"In the old stories, the messenger arrived ahorseback before dawn.","zh":"在老故事里，信使天亮前骑马赶到。"},{"en":"The prince rode ahorseback across the valley.","zh":"王子骑马穿过山谷。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare/old-fashioned) Related to riding horses; done on horseback.","zh":"（罕见/较旧用法）与骑马有关的；在马背上进行的。"},"examples":[{"en":"They trained for ahorseback travel through the mountains.","zh":"他们训练骑马穿越群山。"},{"en":"An ahorseback pursuit began after the thief escaped.","zh":"小偷逃跑后，一场骑马追捕开始了。"}]}],"synonyms":["on horseback","mounted","riding (a horse)"],"phonetic":"/əˈhɔrsˌbæk/","extraExplanation":["这个词在现代英语里非常少见，更多时候会写成两个词：on horseback（骑在马背上）。例如：She came on horseback.（她骑马来的。）","拼写上你输入的“ahorseback”常见于旧文学或仿古写法；在日常写作中用 on horseback 更自然、更标准。"]}
{"word":"Ahoskie","summary":{"en":"Ahoskie is the name of a town in northeastern North Carolina, USA.","zh":"Ahoskie 是美国北卡罗来纳州东北部一座城镇的名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a town in northeastern North Carolina, U.S., in Hertford County.","zh":"（美国）阿霍斯基：美国北卡罗来纳州东北部赫特福德县的一座小镇。"},"examples":[{"en":"Ahoskie is about an hour from the Outer Banks by car.","zh":"开车从阿霍斯基到外滩群岛大约一小时左右。"},{"en":"She grew up in Ahoskie, North Carolina.","zh":"她在北卡罗来纳州的阿霍斯基长大。"}]}],"phonetic":"/əˈhɑːski/","extraExplanation":["“Ahoskie”是专有名词（地名），通常不用复数形式，也不加冠词（一般说“in Ahoskie”，而不是“in the Ahoskie”。）","发音在当地也可能略有差异；在较标准的美式英语中常读作“uh-HOSS-kee”（重音在第二音节）。"]}
{"word":"Ahoufe","summary":{"en":"“Ahoufe” isn’t a standard English word; it’s likely a misspelling of “a house.”","zh":"“Ahoufe”不是标准英语词；很可能是“a house”的拼写错误。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Likely a misspelling) “Ahoufe” is not a standard English word. It may be intended to mean “a house” (a building where people live).","zh":"（可能是拼写错误）“Ahoufe”不是标准英语单词。它很可能想表达“a house”（房子、住宅建筑）。"},"examples":[{"en":"They bought a house near the river.","zh":"他们在河边买了一套房子。"},{"en":"She lives in a small house with a garden.","zh":"她住在一栋带花园的小房子里。"},{"en":"We stayed in a house, not a hotel.","zh":"我们住的是房子，不是酒店。"}]}],"synonyms":["a home","a residence","a dwelling"],"phonetic":"/ə ˈhaʊs/","extraExplanation":["“a house”通常指“建筑物本身（房子）”；“a home”更强调“家、家的感觉”。例如：This is my house.（这是我的房子。） / This is my home.（这是我的家。）","如果你原本想查的是别的词，请告诉我你想表达的中文意思或提供一个例句，我可以帮你确认正确拼写。"]}
{"word":"Ahouh","summary":{"en":"“Ahouh” is a nonstandard online exclamation, used like “ah/aah/uh-oh” to show a sudden feeling or reaction.","zh":"“Ahouh”是不规范的网络感叹写法，类似“ah/aah/uh-oh”，用来表达突然的情绪或反应。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"A nonstandard written exclamation (not a dictionary word), often used online to show a sudden reaction such as surprise, realization, confusion, or a small groan/sigh—similar to “ah,” “aah,” “uh-oh,” or “oh.”","zh":"一种不规范的书写感叹（一般不算标准英语词典词），常见于网络聊天，用来表达突然的反应，如惊讶、恍然大悟、困惑，或轻微的叹气/哼声——类似于“ah / aah / uh-oh / oh”。"},"examples":[{"en":"Ahouh… I just realized I sent it to the wrong person.","zh":"Ahouh……我刚意识到我发错人了。"},{"en":"Ahouh! That scared me.","zh":"Ahouh！吓我一跳。"},{"en":"Ahouh, this is harder than I thought.","zh":"Ahouh，这比我想的更难。"}]}],"synonyms":["ah","aah","ahh","oh","uh-oh","ugh"],"phonetic":"/əˈhaʊ/","extraExplanation":["“Ahouh”没有固定拼写和固定读音，更多是把情绪写出来的“拟声/感叹”。不同人会用它来替代“ah / ahh / aah / uh-oh”等。","如果你是在某个句子或对话里看到的，把原句发给我，我可以根据上下文判断它更接近哪一种意思（惊讶、恍然大悟、懊恼、叹气等），并给出更自然的英文表达。"]}
{"word":"Ahousaht","summary":{"en":"Ahousaht is the name of a First Nation community and the Ahousaht First Nation on the west coast of Vancouver Island, British Columbia.","zh":"Ahousaht 指加拿大卑诗省温哥华岛西岸的一个第一民族社区，也指阿胡萨特第一民族。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Nuu-chah-nulth First Nation community and reserve located on Flores Island on the west coast of Vancouver Island, British Columbia, Canada; the name is also used for the Ahousaht First Nation (the people/government).","zh":"加拿大不列颠哥伦比亚省温哥华岛西岸弗洛雷斯岛上的努查努尔特（Nuu-chah-nulth）原住民族社区与保留地；该名称也常指阿胡萨特第一民族（其人民/部族政府）。"},"examples":[{"en":"Ahousaht is a remote coastal community on Flores Island, west of Vancouver Island.","zh":"阿胡萨特是弗洛雷斯岛上的一个偏远海岸社区，位于温哥华岛以西。"},{"en":"She works with the Ahousaht First Nation on marine stewardship projects.","zh":"她与阿胡萨特第一民族合作开展海洋守护项目。"}]}],"synonyms":["Ahousaht First Nation"],"phonetic":"/əˈhaʊsɑːt/","extraExplanation":["“Ahousaht”常见于加拿大原住民与地理语境中，尤其与努查努尔特（Nuu-chah-nulth）诸民族及其沿海文化（渔业、独木舟、与海洋相关的传统知识）有关。","在英文写作里，它既可以指“地点/社区”，也可以指“部族政府/民族整体”。为避免歧义，可写作“Ahousaht (community)”或“Ahousaht First Nation”。","拼写固定大写首字母；作为专有名词一般不加冠词（不说 *the Ahousaht*），但说组织时会用定冠词：the Ahousaht First Nation."]}
{"word":"ahousaht","summary":{"en":"Ahousaht refers to a Nuu-chah-nulth First Nation and its main coastal community in British Columbia, Canada.","zh":"Ahousaht 指加拿大卑诗省的努查努尔特阿豪萨特第一民族及其主要海岸聚居地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Nuu-chah-nulth First Nation (Indigenous people) on the west coast of Vancouver Island in British Columbia, Canada.","zh":"阿豪萨特第一民族（加拿大卑诗省温哥华岛西海岸的努查努尔特族群之一）。"},"examples":[{"en":"Ahousaht is one of the Nuu-chah-nulth Nations on the west coast of Vancouver Island.","zh":"阿豪萨特是温哥华岛西海岸努查努尔特诸民族之一。"},{"en":"The Ahousaht First Nation works to protect local land and ocean resources.","zh":"阿豪萨特第一民族致力于保护当地的陆地与海洋资源。"}]},{"partOfSpeech":"n.","definition":{"en":"the main community/settlement of the Ahousaht people, located around Flores Island near Tofino in British Columbia.","zh":"阿豪萨特人的主要聚居地（位于卑诗省托菲诺附近的弗洛雷斯岛一带）。"},"examples":[{"en":"We took a boat to Ahousaht from Tofino.","zh":"我们从托菲诺搭船前往阿豪萨特。"},{"en":"Ahousaht is accessible mainly by water, so travel plans often depend on weather.","zh":"阿豪萨特主要靠水路抵达，所以行程常受天气影响。"}]}],"synonyms":["Ahousaht First Nation"],"phonetic":"/əˈhuːsɑːt/","extraExplanation":["“Ahousaht”是专有名词，常见写法包括“Ahousaht First Nation”。在书写或谈论时，使用“Nation/First Nation”通常更尊重其主权与身份。","它与“努查努尔特（Nuu-chah-nulth）”文化圈有关；该地区以海洋生活方式、独木舟传统与与海共生的文化闻名。"]}
{"word":"ahoy","summary":{"en":"“Ahoy” is a nautical greeting or call, now often used playfully to sound like a sailor or pirate.","zh":"“Ahoy”是航海用的招呼/呼喊语，如今也常被用来开玩笑，模仿水手或海盗的口吻。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"A greeting used by sailors, especially when calling to someone on a ship or boat.","zh":"（尤指水手用语）喂！你好！用于在船上或海上向人打招呼或呼喊。"},"examples":[{"en":"Ahoy, captain! We’re ready to leave the harbor.","zh":"喂，船长！我们准备离港了。"},{"en":"The crew shouted, “Ahoy!” to the people on the dock.","zh":"船员对码头上的人喊：“喂！”"}]},{"partOfSpeech":"int.","definition":{"en":"A playful or old-fashioned way to say “hello,” often used to sound nautical.","zh":"（带玩笑或复古语气）你好！常用来营造“航海/海盗风”的感觉。"},"examples":[{"en":"Ahoy there! Welcome to our pirate-themed party.","zh":"嗨！欢迎来到我们的海盗主题派对。"},{"en":"He answered the phone jokingly: “Ahoy!”","zh":"他开玩笑地接起电话：“喂！”"}]}],"synonyms":["hello","hey","hail"],"phonetic":"/əˈhɔɪ/","extraExplanation":["“Ahoy”最早是海上呼喊用语，用来引起注意，类似中文的“喂”。现代英语里不算日常问候语，更常见于航海场景、海盗题材作品或开玩笑的口吻。","在流行文化里，“Ahoy”常让人联想到航海时代；例如美国海绵宝宝里会用“Ahoy”来制造海洋氛围。"]}
{"word":"ahoys","summary":{"en":"“Ahoys” most commonly refers to multiple shouted greetings of “ahoy,” a nautical way to say hello or get attention.","zh":"“ahoys”通常指多次喊出的“ahoy”（航海用语），用于打招呼或引起注意。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"used as a sailor’s greeting or to call someone’s attention, especially on a boat","zh":"（尤指在船上）“喂！”“你好！”：水手的招呼语，也用于引起注意"},"examples":[{"en":"Ahoy, matey! Is anyone on deck?","zh":"喂，伙计！甲板上有人吗？"},{"en":"The captain shouted, “Ahoy!” toward the small boat.","zh":"船长朝小船喊了一声：“喂！”"}]},{"partOfSpeech":"n.","definition":{"en":"plural form of “ahoy” (the shouted greeting); repeated calls of “ahoy”","zh":"“ahoy”的复数：多次/多人喊出的“喂！”“你好！”（航海招呼声）"},"examples":[{"en":"We heard ahoys from across the harbor.","zh":"我们听到港湾对面传来一阵阵“喂！”的呼喊声。"},{"en":"The scene was full of waves and friendly ahoys.","zh":"那一幕里满是挥手和友好的招呼声。"}]}],"synonyms":["hello","hey","hail","yo (informal)"],"phonetic":"/əˈhɔɪ/","extraExplanation":["“ahoy”常被认为来自早期航海用语，和“hoy”（一种小船名）等词有历史联系；现代英语里它带有明显的“海上/海盗/航海”风格，因此在日常生活中使用会显得俏皮或戏仿。","在文学和流行文化中（如海盗题材故事），常见搭配是“Ahoy, matey!”；但在正式或普通场合，更自然的问候通常是“Hi/Hello/Excuse me”。"]}
{"word":"AHQ","summary":{"en":"AHQ is an abbreviation most often used in military contexts, meaning either Army Headquarters (main command office) or Advanced Headquarters (a forward command post).","zh":"AHQ 是军事语境中常见的缩写，通常指“陆军总部（Army Headquarters）”或“前进总部／前进指挥所（Advanced Headquarters）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Army Headquarters; the main command office of an army or large military unit.","zh":"（缩写）陆军司令部／陆军总部；指陆军或大型部队的主要指挥机构。"},"examples":[{"en":"He was assigned to AHQ in the capital for planning work.","zh":"他被调到首都的陆军总部（AHQ）负责规划工作。"},{"en":"The report was sent from the front line to AHQ for approval.","zh":"这份报告从前线送到陆军总部（AHQ）审批。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Advanced Headquarters; a forward command post set up closer to the front to manage operations.","zh":"（缩写）前进指挥所／前进总部；在更靠近前线处设立的指挥机构，用于指挥行动。"},"examples":[{"en":"The general moved to the AHQ to coordinate the next operation.","zh":"将军转到前进总部（AHQ）协调下一步行动。"},{"en":"Supplies were routed through the AHQ before reaching the units.","zh":"补给先通过前进总部（AHQ）再送到各部队。"}]}],"synonyms":["HQ","headquarters","command center"],"phonetic":"/eɪ eɪtʃ kjuː/","extraExplanation":["“AHQ”最常见于军事或历史语境，通常写作大写，并在首次出现时写出全称（如 Army Headquarters / Advanced Headquarters），以免读者只看到 “HQ（总部）”时产生歧义。","不同国家、不同组织对“AHQ”的具体指代可能不同；阅读文件或论文时，最好根据上下文（是否在前线、是否谈战略规划等）来判断是哪一种含义。"]}
{"word":"Ahrendahronon","summary":{"en":"Ahrendahronon is a historical name for an Indigenous group linked to the Huron-Wendat confederacy in present-day Ontario, Canada, often appearing in variant spellings.","zh":"Ahrendahronon 是一个历史上的原住民族/部族名称，常与今加拿大安大略地区的休伦-温达特联盟相关；在资料中常见不同变体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historical Indigenous people/nation associated with the Huron-Wendat (Wyandot) confederacy in what is now Ontario, Canada; the name is a variant spelling of Arendarhonon/Arendahronon","zh":"（历史）与休伦-温达特（Wyandot）联盟相关的原住民族/部族名称，活动范围大致在今加拿大安大略一带；此拼写常被视为 Arendarhonon/Arendahronon 的变体"},"examples":[{"en":"Some early French records mention the Ahrendahronon as part of the Huron-Wendat world.","zh":"一些早期法国文献把 Ahrendahronon 记作休伦-温达特世界的一部分。"},{"en":"In different sources, you may see the name spelled Ahrendahronon, Arendarhonon, or Arendahronon.","zh":"在不同资料里，这个名称可能写作 Ahrendahronon、Arendarhonon 或 Arendahronon。"}]}],"synonyms":["Arendarhonon","Arendahronon","Huron-Wendat"],"phonetic":"ˌɑːrɛnˈdɑːrənɑːn","extraExplanation":["这是一个出现在历史文献中的专名，英文拼写往往因记录者语言背景（法语/英语）、转写习惯不同而变化；因此遇到不同拼法通常指向同一群体或近似称呼。","若你是在某本小说、地图或历史资料中看到该词，提供出处（书名/段落/地区）可以更准确判断它指的具体群体与时代背景。"]}
{"word":"ahrendahronon","summary":{"en":"“ahrendahronon” doesn’t match a known English word; please provide context or check spelling.","zh":"“ahrendahronon”不像已知英语词；请提供上下文或核对拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Unknown term (not found as a standard English word or common phrase). It may be a misspelling, a name, or a word from another language.","zh":"未知词（不是标准英语单词或常见短语）。可能是拼写错误、人名，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “ahrendahronon” in an English dictionary—could you share where you saw it?","zh":"我在英文词典里查不到“ahrendahronon”——你能说一下你在哪里看到的吗？"},{"en":"If you meant a similar word, please provide the sentence so I can help identify it.","zh":"如果你想查的是相近的词，请把完整句子发我，我可以帮你判断。"}]}],"extraExplanation":["目前这个拼写不像常见英语词汇。为了更准确地帮你：\n1）请确认是否大小写正确、是否漏了空格或连字符；\n2）把它出现的原句/截图发来；\n3）告诉我它来自哪里（书、歌曲、游戏、社交媒体、某种语言等）。\n有了上下文我通常可以推测你想要的真实单词或短语。"]}
{"word":"Ahrendt","summary":{"en":"“Ahrendt” is mainly a surname, often a variant of “Arendt,” and may sometimes be used as a misspelling related to Hannah Arendt in academic contexts.","zh":"“Ahrendt”主要是姓氏，常见为“Arendt”的变体；在学术语境中有时是对汉娜·阿伦特（Hannah Arendt）的拼写差异或误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname (family name), most commonly a variant spelling of “Arendt.” It is used as a proper name for a person.","zh":"姓氏（家族名），常见为“Arendt”的变体拼写，用作人名（专有名词）。"},"examples":[{"en":"Ms. Ahrendt will speak at the conference tomorrow.","zh":"Ahrendt 女士明天将在会议上发言。"},{"en":"The article cites Dr. Ahrendt’s research on education policy.","zh":"这篇文章引用了 Ahrendt 博士关于教育政策的研究。"}]},{"partOfSpeech":"other","definition":{"en":"(often in academic/cultural contexts) a spelling variant that may refer to Hannah Arendt (1906–1975), a German-born political theorist, when “Ahrendt” is used or mistaken as her surname.","zh":"（常见于学术/文化语境）可能被用作或被误写为政治思想家汉娜·阿伦特（Hannah Arendt，1906–1975）的姓氏拼写。"},"examples":[{"en":"Some sources misspell Arendt as “Ahrendt,” but the standard spelling is Arendt.","zh":"有些资料把 Arendt 误写成“Ahrendt”，但标准拼写是 Arendt。"},{"en":"In her work, Arendt discusses totalitarianism and the nature of power.","zh":"在她的著作中，阿伦特讨论了极权主义与权力的本质。"}]}],"synonyms":["Arendt"],"phonetic":"/ˈɑrɛnt/","extraExplanation":["“Ahrendt/Arendt”多见于德语背景的姓氏。作为专有名词，它本身没有固定“词义”，主要用于指代某个人或家族。","如果你是在阅读哲学、政治学或历史文本时遇到“Ahrendt”，很可能是对“Hannah Arendt（汉娜·阿伦特）”的拼写差异或误拼。检索文献时可同时用 Arendt 与 Ahrendt 作为关键词，以免漏掉信息。"]}
{"word":"Ahrens","summary":{"en":"Ahrens is a surname, often associated with German-speaking backgrounds.","zh":"Ahrens 是一个姓氏，常与德语背景相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), most commonly of German origin; used to refer to a person or family called Ahrens","zh":"姓氏（家族名），多见于德语背景；用于指姓 Ahrens 的人或家族"},"examples":[{"en":"Dr. Ahrens will lead today’s meeting.","zh":"Ahrens 博士将主持今天的会议。"},{"en":"I emailed Ms. Ahrens about the schedule change.","zh":"我给 Ahrens 女士发邮件说明日程变更。"}]}],"synonyms":["family name","surname","last name"],"phonetic":"/ˈɑrənz/","extraExplanation":["Ahrens 通常是德语姓氏，在英语语境中多作为专有名词使用（首字母大写）。在正式写作里，第一次出现常用全名（如 “Michael Ahrens”），之后可用姓氏（“Ahrens”）指代。","发音在不同家庭/地区可能略有差异；在美式英语里常见读法接近 “AH-renz”。"]}
{"word":"Ahriman","summary":{"en":"Ahriman is the evil or destructive spirit in Zoroastrianism, often used more broadly as a symbol of evil in literature and fantasy.","zh":"Ahriman 是祆教/琐罗亚斯德教中的恶灵或破坏之力，也常被文学与奇幻作品借用来象征邪恶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Zoroastrianism (an ancient Persian religion), the destructive spirit or evil force that opposes Ahura Mazda (the good, wise creator). Also called Angra Mainyu.","zh":"在祆教/琐罗亚斯德教（古代波斯宗教）中，与善神阿胡拉·马兹达对立的“毁灭之灵/恶之力”。亦称“安格拉·曼纽”（Angra Mainyu）。"},"examples":[{"en":"In Zoroastrian stories, Ahriman tries to corrupt the world and fight against truth.","zh":"在祆教故事中，Ahriman 试图腐化世界并与真理作战。"},{"en":"The novel uses Ahriman as a symbol of chaos and moral darkness.","zh":"这部小说把 Ahriman 用作混乱与道德黑暗的象征。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension, in literature or fantasy) a powerful demon-like figure representing evil.","zh":"（引申义，在文学或奇幻作品中）象征邪恶的强大“恶魔式”人物。"},"examples":[{"en":"The villain is described as an Ahriman, tempting people with easy power.","zh":"反派被描写成“像 Ahriman 一样”的存在，用轻易得来的力量诱惑人们。"},{"en":"Some games borrow the name Ahriman for dark sorcerers or end-bosses.","zh":"一些游戏会借用 Ahriman 这个名字来命名黑暗法师或终极头目。"}]}],"synonyms":["Angra Mainyu","the destructive spirit","evil principle"],"phonetic":"/ˈɑːrɪmən/","extraExplanation":["“Ahriman”常见于英语书写中，但在宗教学术语里也常用原名“Angra Mainyu”（意为“破坏性的心灵/精神”）。两者通常指同一概念。","发音在英语里有不同变体；学习时重点把它当作专有名词使用即可。","文化上它常被类比为“邪恶原则”，但它并不等同于基督教语境中的“撒旦”，两者来自不同宗教体系与宇宙观。"]}
{"word":"ahriman","summary":{"en":"Ahriman is the Zoroastrian name for the spirit of evil, opposed to Ahura Mazda.","zh":"Ahriman（阿里曼）是琐罗亚斯德教中代表邪恶的灵，与阿胡拉·马兹达对立。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Zoroastrianism, the spirit of evil and destruction; the chief opponent of Ahura Mazda (the force of good). Also called Angra Mainyu.","zh":"（琐罗亚斯德教/拜火教中）邪恶与毁灭之灵；与善神阿胡拉·马兹达对立的主要恶神/恶灵。亦称 Angra Mainyu（安格拉·曼纽）。"},"examples":[{"en":"In the myth, Ahriman tries to corrupt the world created by Ahura Mazda.","zh":"在神话中，阿里曼试图腐化阿胡拉·马兹达所创造的世界。"},{"en":"Some fantasy novels borrow the name Ahriman to represent a powerful force of darkness.","zh":"一些奇幻小说借用“阿里曼”这个名字来象征强大的黑暗势力。"},{"en":"The text describes a struggle between light and darkness, often linked with Ahura Mazda and Ahriman.","zh":"文本描述了光明与黑暗的斗争，常与阿胡拉·马兹达和阿里曼相联系。"}]}],"synonyms":["Angra Mainyu"],"phonetic":"ˈɑrɪmən","extraExplanation":["“Ahriman”源自中古波斯语，对应更古老的阿维斯陀语“Angra Mainyu”（意为“破坏性的灵/邪恶的心灵”）。在琐罗亚斯德教里，这是典型的“善恶对立”框架：Ahura Mazda象征秩序与真理，Ahriman象征混乱与谎言。","在英语写作中，它常作为文化/文学典故出现，用来指代“终极邪恶”或“黑暗势力”。在奇幻与游戏作品里也经常被借用为角色名或反派势力名。"]}
{"word":"Ahrimanian","summary":{"en":"An adjective meaning “connected with Ahriman,” the evil/destructive spirit in Zoroastrianism, or (figuratively) intensely evil or destructive.","zh":"形容词，意为“与阿里曼有关”（琐罗亚斯德教中的邪恶/破坏之灵），或引申为“极端邪恶、毁灭性的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Ahriman (Angra Mainyu), the destructive or evil spirit in Zoroastrian tradition; by extension, extremely evil or destructive in a mythic/religious sense","zh":"与阿里曼（Ahriman/安格拉·曼纽 Angra Mainyu，琐罗亚斯德教中的破坏性/邪恶之灵）有关的；引申为带有神话/宗教意味的极端邪恶或毁灭性的"},"examples":[{"en":"Some writers describe war as an Ahrimanian force that destroys trust and community.","zh":"一些作家把战争形容为一种“阿里曼式”的力量，会摧毁信任与共同体。"},{"en":"In Zoroastrian stories, Ahrimanian impulses oppose truth and order.","zh":"在琐罗亚斯德教的故事中，“阿里曼式”的冲动与真理和秩序相对立。"}]}],"synonyms":["Ahrimanic","demonic","satanic","malevolent"],"phonetic":"/ɑːˈriːməniən/","extraExplanation":["“Ahrimanian”来自“Ahriman”（阿里曼），与琐罗亚斯德教（Zoroastrianism）中的善恶二元对立有关：通常以阿胡拉·马兹达（Ahura Mazda）代表善与秩序，对立面是阿里曼/安格拉·曼纽代表破坏与邪恶。","在英语里它多见于宗教学、神话学或带有象征意味的文学评论中；日常英语更常用的泛化表达是“evil / demonic / satanic”，但这些词的宗教背景不同，使用时要注意语境。"]}
{"word":"ahrimanian","summary":{"en":"“Ahrimanian” means “connected with Ahriman,” often used to describe evil or destructive forces in a Zoroastrian or symbolic literary sense.","zh":"“Ahrimanian”指“与阿里曼有关的”，常用于表示祆教背景下或文学象征中的邪恶、破坏性力量。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Ahriman (Angra Mainyu), the destructive/evil spirit in Zoroastrian tradition; suggesting a force of darkness or harm.","zh":"与阿里曼（Ahriman，又称安格拉·曼纽 Angra Mainyu，祆教/琐罗亚斯德教中的破坏性或邪恶之灵）有关的；暗示黑暗或伤害力量的。"},"examples":[{"en":"In the novel, the villain is described as an Ahrimanian force working against all life.","zh":"在小说里，反派被描写成一种阿里曼式的力量，与一切生命为敌。"},{"en":"Some writers use “Ahrimanian” imagery to symbolize chaos and moral corruption.","zh":"一些作家用“阿里曼式”的意象来象征混乱与道德败坏。"}]}],"synonyms":["Ahrimanic","diabolic","malevolent"],"phonetic":"/əˌhɪrəˈmɑːniən/","extraExplanation":["“Ahrimanian”来自“Ahriman”（阿里曼），对应祆教/琐罗亚斯德教中的恶灵“Angra Mainyu”。在该传统里，Ahriman常与善神Ahura Mazda（阿胡拉·马兹达）形成善恶对立的框架。英语写作中，这个词多见于宗教研究、神话学、文学评论，常带有“象征性”的用法，不一定指现实宗教信仰。","相关词：Ahriman（名词，阿里曼）；Ahrimanic（形容词，较常见的同义形式）。"]}
{"word":"Ahrimanic","summary":{"en":"Ahrimanic means connected to Ahriman (a destructive spirit in Zoroastrianism), or more generally “dark/corrupting” in a religious or literary sense.","zh":"Ahrimanic 指与阿里曼（祆教中的毁灭性邪灵）相关；也可引申为宗教或文学语境中的“阴暗、腐化的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Ahriman (Angra Mainyu), the destructive spirit in Zoroastrian tradition; by extension, describing forces seen as dark, corrupting, or aggressively materialistic.","zh":"与阿里曼（Ahriman/Angra Mainyu，祆教/琐罗亚斯德教中的毁灭性邪灵）有关的；引申为形容被视为阴暗、腐化或极端物质化的力量。"},"examples":[{"en":"Some scholars describe the demon as an Ahrimanic figure in the story, opposing truth and order.","zh":"一些学者把故事中的恶魔描述为“阿里曼式”的人物，用来对抗真理与秩序。"},{"en":"In that novel, the city’s greed is portrayed as an Ahrimanic influence that drains people’s compassion.","zh":"在那部小说里，城市的贪婪被描写成一种“阿里曼式”的影响力，消磨人们的同情心。"}]}],"synonyms":["diabolical","demonic","satanic","malign"],"phonetic":"/ˌɑːrɪˈmɑːnɪk/","extraExplanation":["“Ahrimanic”来自 Ahriman（阿里曼），对应祆教/琐罗亚斯德教中的 Angra Mainyu，常被理解为与光明、秩序相对的破坏性精神。","现代语境中（尤其在人智学 Anthroposophy 等思想体系里），“Ahrimanic”有时用来指“冷酷理性、技术控制、极端物质主义”的倾向；但这种用法带有特定思想背景，并非所有宗教学者都会采用。","书面语里它多见于宗教研究、哲学/神秘主义讨论或文学批评；日常英语中很少使用。"]}
{"word":"Ahron","summary":{"en":"Ahron is a male given name, most often a less common spelling/transliteration of Aaron (Hebrew: Aharon).","zh":"Ahron是男性名字，通常是Aaron（希伯来语Aharon）的较少见拼写/音译形式。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A masculine given name; a less common spelling of “Aaron.”","zh":"男性名字；“Aaron”的一种不太常见的拼写形式。"},"examples":[{"en":"Ahron is my classmate; his name is spelled with an “h.”","zh":"Ahron是我的同学；他的名字拼写里有一个“h”。"},{"en":"In some families, Ahron is chosen to reflect Hebrew spelling traditions.","zh":"在一些家庭中，会用Ahron这个拼写来呼应希伯来语的拼写传统。"}]},{"partOfSpeech":"other","definition":{"en":"In Jewish/Hebrew contexts, a transliteration of the Hebrew name אַהֲרֹן (Aharon), known in English as Aaron (a key figure in the Hebrew Bible).","zh":"在犹太/希伯来语语境中，是希伯来名字 אַהֲרֹן（Aharon）的音译；英语中通常写作Aaron（《希伯来圣经/旧约》中的重要人物）。"},"examples":[{"en":"Some English translations refer to Moses and Ahron (Aaron).","zh":"一些英文译法会写到摩西和Ahron（即Aaron）。"},{"en":"The name Ahron appears in community records as a traditional form.","zh":"在社区记录中，Ahron常作为一种传统写法出现。"}]}],"synonyms":["Aaron","Aharon"],"phonetic":"/ˈerən/","extraExplanation":["“Ahron”并不是英语里最常见的写法，更常见的是“Aaron”。你可能会在犹太社区、以色列相关语境，或为了更贴近希伯来语音译时看到“Ahron/Aharon”。","圣经文化背景：Aaron/Aharon在《出埃及记》等文本中是摩西的哥哥，也是以色列祭司体系的重要人物；因此这个名字在犹太和基督教文化中都很有辨识度。","拼写与读音小提示：英语中“Aaron”常读作/ˈerən/（不同地区也可能有变化）；而更接近希伯来语的“Aharon”有时会被读得更接近“ah-HAH-ron”。"]}
{"word":"ahs","summary":{"en":"“ahs” usually means multiple “ah” sounds in writing; “AHS” can also be an acronym whose meaning depends on context.","zh":"“ahs”通常表示书面语中的多个“啊/哦”等感叹声；“AHS”也可能是缩写，具体含义取决于语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “ah”: written to represent several people (or repeated moments) saying “ah” (a sound of surprise, understanding, pleasure, etc.).","zh":"“ah”的复数：在书面语中表示多人或多次发出“啊/哦/呀”等感叹声（惊讶、恍然大悟、满足等）。"},"examples":[{"en":"There were a few surprised ahs in the crowd when the lights went out.","zh":"灯突然熄灭时，人群里传来几声惊讶的“啊”。"},{"en":"Ahs and oohs filled the room as the singer walked on stage.","zh":"歌手走上舞台时，房间里响起一片“啊”和“哦”。"}]},{"partOfSpeech":"other","definition":{"en":"Acronym: “AHS” can stand for different things depending on context (for example, American Horror Story).","zh":"首字母缩略词：AHS在不同语境中可代表不同含义（例如美剧《American Horror Story》）。"},"examples":[{"en":"I started watching AHS last weekend.","zh":"我上周末开始看《AHS》（《美国恐怖故事》）。"},{"en":"What does AHS stand for in this document?","zh":"这份文件里AHS代表什么？"}]}],"synonyms":["ah sounds","exclamations","oohs and ahs"],"phonetic":"ɑz","extraExplanation":["“ahs”作为“ah”的复数，常见于叙述性写作（小说、新闻描写）来表现群体反应；口语里通常直接说“people said ‘ah’”。","如果你指的是某个具体领域的“AHS”（学校名、机构名、医学/科技缩写等），告诉我上下文，我可以帮你确定最可能的全称与含义。"]}
{"word":"AHSA","summary":{"en":"AHSA is an acronym with multiple possible meanings; commonly it refers to the American Horse Shows Association in equestrian contexts.","zh":"AHSA 是一个可能有多种含义的缩写；在马术语境中常指 American Horse Shows Association。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation/initialism used for different organizations; the meaning depends on context.","zh":"一个缩写/首字母缩略词；具体含义取决于上下文。"},"examples":[{"en":"In this document, AHSA refers to the American Horse Shows Association.","zh":"在这份文件中，AHSA 指 American Horse Shows Association（美国马术表演协会）。"},{"en":"I saw “AHSA” on the form, but it didn’t explain what it stood for.","zh":"我在表格上看到 “AHSA”，但没有说明它代表什么。"}]},{"partOfSpeech":"other","definition":{"en":"(Often) American Horse Shows Association (a former name/organization related to U.S. equestrian competitions; later connected with the U.S. Equestrian Federation).","zh":"（常见含义）American Horse Shows Association：与美国马术赛事相关的机构名称（历史名称，后来与美国马术联合会体系相关）。"},"examples":[{"en":"Her competition record lists AHSA-rated shows.","zh":"她的参赛记录里列着 AHSA 评级的比赛。"}]}],"synonyms":["initialism","acronym","abbreviation"],"phonetic":"/ˌeɪtʃ eɪ ɛs ˈeɪ/","extraExplanation":["“AHSA”不是一个在日常英语里非常固定的词，更像是“首字母缩略词”。在不同领域它可能代表不同机构（例如马术、医疗、教育等）。如果你告诉我它出现的场景（比如马术比赛规则、学校文件、公司名称、医疗表格），我可以给出最准确的释义和相关用法。"]}
{"word":"Ahsahka","summary":{"en":"Ahsahka is most likely a proper name rather than an English vocabulary word.","zh":"Ahsahka 更可能是专有名词（名字等），而不是英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Ahsahka is not a standard English word. It is most likely a proper name (a personal name, place name, or a creative spelling) used in specific communities or contexts.","zh":"Ahsahka 不是标准英语词汇，更可能是专有名词（人名、地名或创意拼写），用于特定社群或语境中。"},"examples":[{"en":"I met someone named Ahsahka at the conference.","zh":"我在会议上认识了一个叫 Ahsahka 的人。"},{"en":"How do you spell Ahsahka correctly for the invitation?","zh":"请柬上 Ahsahka 的拼写要怎么写才正确？"}]}],"synonyms":["(no direct synonyms; proper name)"],"phonetic":"ɑːˈsɑːkə","extraExplanation":["它看起来像是音译/创意拼写的名字；如果你告诉我它来自哪里（例如某种语言、游戏角色、地名、社交媒体用户名），我可以更准确地给出含义、来源和更自然的英文用法。","有时会与近似拼写混淆（例如 Alaska、Ashaka、Asaka 等）。如果你本来想查其中一个，请发正确拼写，我可以按词典格式详细解释。"]}
{"word":"ahsan","summary":{"en":"Ahsan is commonly a male name; it comes from Arabic and can mean “better/best; most excellent.”","zh":"Ahsan 常用作男性名字；源自阿拉伯语，可表达“更好/最好；最优秀”的含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name used in South Asia and the Middle East (also spelled Ahsan).","zh":"一个男性名字，常见于南亚和中东（也可拼作 Ahsan）。"},"examples":[{"en":"Ahsan is my classmate in English class.","zh":"Ahsan 是我英语课的同学。"},{"en":"I met Ahsan at a conference in Karachi.","zh":"我在卡拉奇的一场会议上认识了 Ahsan。"}]},{"partOfSpeech":"adj.","definition":{"en":"(from Arabic أَحْسَن, used in names and religious/literary contexts) “better/best; most excellent; most beautiful.”","zh":"（源自阿拉伯语 أَحْسَن，常用于人名及宗教/文学语境）“更好/最好；最优秀；最美”。"},"examples":[{"en":"In Arabic, Ahsan can carry the sense of “the best.”","zh":"在阿拉伯语里，Ahsan 可以带有“最好的”意思。"},{"en":"Some parents choose the name Ahsan because it suggests excellence and goodness.","zh":"有些父母给孩子取名 Ahsan，是因为它寓意优秀与美善。"}]}],"synonyms":["best","better","excellent"],"phonetic":"/ˈɑːsɑːn/","extraExplanation":["“Ahsan/أَحْسَن”来自阿拉伯语词根 ح-س-ن（与“美、善”相关），同一词根还常见于名字如 Hasan（哈桑）。","在宗教文本中，“Ahsan”有时出现在固定搭配里表达“以更好的方式/最好的形式”（例如 *ahsanu* 作为比较级/最高级的用法）。"]}
{"word":"Aht","summary":{"en":"“Aht” isn’t a standard English word; it’s usually a typo or informal spelling and needs context.","zh":"“Aht”不是标准英语词，通常是打错或随意拼写，需要结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. In many messages, “Aht” is likely a typo or informal spelling of “ah” (an interjection showing realization) or “at.”","zh":"不是标准英语单词。在聊天中，“Aht”常见于打错字或随意拼写，可能原本想写“ah”（表示恍然大悟的感叹词）或“at”。"},"examples":[{"en":"Aht—sorry, I meant “ah,” I get it now.","zh":"Aht——抱歉，我是想写“ah”，我现在懂了。"},{"en":"He typed “Aht the store” but meant “At the store.”","zh":"他打成“Aht the store”，但其实是想写“At the store（在商店）”。"}]}],"synonyms":["ah","at (possible typo)"],"phonetic":"/ɑt/","extraExplanation":["如果你是在短信/社交媒体里看到“Aht”，它的真实含义高度依赖上下文：\n1) 可能是手滑的拼写错误（ah / at / art 等）。\n2) 也可能是某个缩写（AHT）或人名/地名。\n把原句贴出来（前后各一两句）我可以更准确判断。"]}
{"word":"aht","summary":{"en":"“AHT” is most commonly an initialism meaning Average Handle Time in customer service; lowercase “aht” is usually nonstandard and may be a typo or a playful way to write a sound like “ah!”","zh":"“AHT”最常见是客服领域的缩写，表示平均处理时长；小写“aht”通常不规范，常见于打字错误或用来写出类似“啊！”的语气/声音。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(initialism) Average Handle Time: the average amount of time an agent spends handling one customer interaction (talk/chat time plus related follow‑up work).","zh":"（缩写）平均处理时长：客服人员处理一次客户互动的平均耗时（通话/聊天时间加上相关后续处理时间）。"},"examples":[{"en":"Our AHT dropped from 8 minutes to 6 minutes after we improved the knowledge base.","zh":"我们完善了知识库后，AHT 从 8 分钟降到 6 分钟。"},{"en":"Try to reduce AHT without rushing customers.","zh":"尽量降低 AHT，但不要催促客户。"}]},{"partOfSpeech":"other","definition":{"en":"(informal/nonstandard) A spelling sometimes used online to represent a sound like “ah!” or a quick exhale; often appears as a typo or playful writing rather than a standard word.","zh":"（非标准/口语网络用法）有时在网上用来表示类似 “ah!” 的声音或短促的呼气；更多见于打字错误或戏谑写法，并非规范词。"},"examples":[{"en":"Aht—now I get it.","zh":"啊——我懂了。"}]}],"synonyms":["average handle time","handling time"],"phonetic":"eɪ eɪtʃ tiː","extraExplanation":["“AHT”更常见为大写的行业缩写（尤其客服/呼叫中心）。如果你本来想查的是 “ah”（感叹词）或 “at”（介词），告诉我上下文我可以按正确词条解释。"]}
{"word":"ahte","summary":{"en":"“Hate” means a strong dislike; it can be a verb (to hate) or a noun (hate).","zh":"“hate”表示强烈的“不喜欢/憎恨”，既可作动词也可作名词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to strongly dislike someone or something","zh":"憎恨；厌恶（某人或某事）"},"examples":[{"en":"I hate waiting in long lines.","zh":"我讨厌排很长的队。"},{"en":"She hates being interrupted when she’s working.","zh":"她工作时讨厌被打断。"}]},{"partOfSpeech":"n.","definition":{"en":"a very strong feeling of dislike","zh":"憎恨；强烈的厌恶感"},"examples":[{"en":"His comments were filled with hate.","zh":"他的评论充满了仇恨。"},{"en":"We should not respond to hate with hate.","zh":"我们不应该用仇恨回应仇恨。"}]}],"synonyms":["dislike","detest","loathe","despise"],"phonetic":"/heɪt/","extraExplanation":["你输入的“ahte”很可能是拼写错误，常见目标词是“hate”。正确拼写：h-a-t-e。","“hate”语气很强，在日常表达里，如果只是“不喜欢”，更常用：don’t like / dislike（更礼貌、强度更低）。"]}
{"word":"Ahtena","summary":{"en":"Athena is the Greek goddess of wisdom and strategy, and it’s also used as a female name.","zh":"Athena 指希腊神话中的智慧与战略女神雅典娜，也可作女性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Athena: the ancient Greek goddess of wisdom, strategy in war, and crafts; the patron goddess of the city of Athens.","zh":"雅典娜：古希腊神话中的女神，掌管智慧、战争策略与手工技艺；也是雅典城的守护神。"},"examples":[{"en":"In Greek myths, Athena is known for wisdom and calm strategy rather than brute force.","zh":"在希腊神话中，雅典娜以智慧和冷静的策略著称，而不是靠蛮力。"},{"en":"The Parthenon in Athens was built to honor Athena.","zh":"雅典的帕特农神庙是为纪念雅典娜而建。"}]},{"partOfSpeech":"n.","definition":{"en":"Athena: a female given name, often chosen to suggest wisdom, strength, or independence.","zh":"Athena：女性名字，常带有“智慧、力量、独立”的寓意。"},"examples":[{"en":"They named their daughter Athena because they admired the goddess’s symbolism.","zh":"他们给女儿取名Athena，因为很欣赏这位女神所象征的意义。"}]}],"synonyms":["Pallas Athena","the goddess of wisdom"],"phonetic":"/əˈθiːnə/","extraExplanation":["你输入的“Ahtena”常见是把“Athena”拼错了：正确拼法是 A-t-h-e-n-a。","文化联想：雅典娜常与“猫头鹰（owl）”和“橄榄树（olive tree）”联系在一起，分别象征智慧与和平/繁荣。她也常被称为“Pallas Athena（帕拉斯·雅典娜）”。","文学与文化中，“Athena”常作为“理性、清醒的判断、战略思维”的象征出现在作品里（如《奥德赛》中她帮助奥德修斯）。"]}
{"word":"ahtena","summary":{"en":"Athena is the Greek goddess of wisdom and strategy, and it is also used as a female name.","zh":"Athena 指希腊神话中的智慧与谋略女神“雅典娜”，也可作女性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Athena: the ancient Greek goddess of wisdom, strategy in war, and crafts; often shown with an owl and a shield.","zh":"雅典娜：古希腊神话中的智慧女神、战争谋略之神，也是手工艺与技艺的守护神；常与猫头鹰和盾牌等形象一起出现。"},"examples":[{"en":"In Greek myths, Athena is known for her intelligence and calm judgment.","zh":"在希腊神话中，雅典娜以聪明和冷静的判断力著称。"},{"en":"The statue of Athena stood at the center of the ancient temple.","zh":"雅典娜的雕像矗立在那座古老神庙的中心。"}]},{"partOfSpeech":"n.","definition":{"en":"Athena: a female given name.","zh":"Athena：女性名字。"},"examples":[{"en":"Athena moved to Chicago for her new job.","zh":"Athena 为了新工作搬去了芝加哥。"}]}],"synonyms":["Minerva (Roman equivalent)"],"phonetic":"əˈθiːnə","extraExplanation":["“Athena”常被当作“智慧与理性”的文化象征：英语里谈到聪明、有策略、冷静的领导力时，有时会用“an Athena-like figure（像雅典娜一样的人物）”来形容。","罗马神话中与雅典娜对应的女神是“Minerva（密涅瓦）”，在艺术与文学作品里两者常被拿来对照。","你输入的“ahtena”很可能是拼写顺序打乱了；正确拼写通常是“Athena”。"]}
{"word":"ahu","summary":{"en":"Ahu is a Polynesian word most often used in English for the stone ceremonial platforms on Rapa Nui (Easter Island), often connected to moai statues.","zh":"Ahu 是波利尼西亚语词，在英语中最常指复活节岛（拉帕努伊）的石造仪式台基，常与摩艾石像相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a stone ceremonial platform (often for statues) on Rapa Nui (Easter Island).","zh":"（复活节岛/拉帕努伊）用于宗教或仪式的石造台基（常用于安放摩艾石像）。"},"examples":[{"en":"Tourists visited the ahu where several moai statues stand.","zh":"游客参观了那座安放着几尊摩艾石像的仪式台基（ahu）。"},{"en":"The guide explained how each ahu was built with carefully fitted stones.","zh":"导游解释了每座 ahu 如何用精心拼接的石块建成。"}]},{"partOfSpeech":"n.","definition":{"en":"in Hawaiian and some Polynesian contexts, a heap of stones or a small altar/shrine, sometimes used to mark a place.","zh":"（夏威夷语及部分波利尼西亚语境）一堆石头；小型祭坛/神龛，有时用来标记地点。"},"examples":[{"en":"They left a stone on the ahu to show respect.","zh":"他们在石堆/小祭坛（ahu）上放了一块石头以示敬意。"}]}],"synonyms":["ceremonial platform","stone platform","shrine","altar"],"phonetic":"/ˈɑː.huː/","extraExplanation":["“ahu”最常见于介绍复活节岛文化的英文资料里，通常与“moai（摩艾）”一起出现：moai 是石像，ahu 是石像所在的仪式台基/平台。","这是来自波利尼西亚语言的借词；英语里多用于人类学、考古、旅行介绍等语境，日常英语对话中不算常见。","大写“AHU”有时会被当作缩写（不同领域含义不同），但这不属于固定的词义；如果你指的是某个缩写，请告诉我上下文。"]}
{"word":"ahuaca","summary":{"en":"Ahuaca is mainly a proper name (often a place name) rather than a common English word.","zh":"Ahuaca 主要是专有名词（常作地名），不是常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Ahuaca: a proper name (usually a place name) used for locations in parts of Latin America (e.g., hills, towns, or archaeological sites). It is not a common standard English vocabulary word.","zh":"Ahuaca：专有名词（多为地名），可指拉丁美洲部分地区的地点（如山丘、城镇或考古遗址）。它不是常见的标准英语词汇。"},"examples":[{"en":"The guide said Ahuaca is a local name for the hill we were hiking.","zh":"导游说 Ahuaca 是我们正在徒步的那座山丘的当地名字。"},{"en":"Some travelers visit Ahuaca to learn about the area’s history and culture.","zh":"一些旅行者会去 Ahuaca 了解当地的历史与文化。"}]}],"synonyms":["(no direct synonyms; proper name)"],"phonetic":"ɑˈwɑːkə","extraExplanation":["“Ahuaca”更像是西班牙语语境中的地名/专名，在英语里通常不作为普通词汇使用。英语写作中若出现，多半是旅游、地理、历史或考古相关文本。","如果你其实想查的是类似发音的词，比如西班牙语的“aguacate”（牛油果）或英语“avocado”，告诉我你想表达的意思/使用场景，我可以给出正确词条与用法。"]}
{"word":"ahuatle","summary":{"en":"Ahuautle is a traditional Mexican food made from dried aquatic insect eggs, sometimes called “Mexican caviar.”","zh":"Ahuautle 是一种墨西哥传统食材，由水生昆虫卵制成，常被称为“墨西哥鱼子酱”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Mexican food made from the tiny eggs (or egg masses) of aquatic insects, often compared to “Mexican caviar,” usually dried or toasted and used as a topping or filling.","zh":"一种墨西哥传统食材，由水生昆虫（常见为半翅目昆虫）产下的细小虫卵（或卵团）制成，常被称为“墨西哥鱼子酱”，通常晒干或烘烤后作为配料或馅料使用。"},"examples":[{"en":"The taco was topped with ahuatle for a salty, umami flavor.","zh":"这份墨西哥卷饼上撒了 ahuatle，带来咸鲜的旨味。"},{"en":"In some markets, ahuatle is sold dried and ready to cook.","zh":"在一些市场里，ahuatle 以干货形式出售，买回去就能烹调。"},{"en":"The chef folded ahuatle into an omelet as a local specialty.","zh":"主厨把 ahuatle 加进煎蛋里，做成当地特色菜。"}]}],"synonyms":["Mexican caviar","insect roe"],"phonetic":"/ˌɑːwəˈtliː/","extraExplanation":["Ahuautle 源自纳瓦特尔语（Nahuatl），在墨西哥中部具有悠久历史，常与阿兹特克时期的饮食传统联系在一起。","它通常来自“axayácatl”（常被称为水蝽/水生昆虫的一类）所产的卵；因为采集与水域生态、季节有关，在一些地区被视为较珍贵或较少见的食材。","在饮食文化中，ahuautle 常被用来增强“鲜味（umami）”，做法包括与鸡蛋、玉米饼、酱料或炖菜搭配；英文里有时会用绰号“Mexican caviar”来帮助理解其口感与用途。"]}
{"word":"ahuehuete","summary":{"en":"Ahuehuete is a large, long-lived Mexican cypress tree, Mexico’s national tree.","zh":"Ahuehuete 指一种寿命极长、体型巨大的墨西哥柏树，也是墨西哥国树。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very large Mexican cypress tree (Taxodium mucronatum), often found near rivers and famous for its great age and thick trunk; it is Mexico’s national tree.","zh":"一种体型巨大的墨西哥柏树（学名 Taxodium mucronatum），常见于河岸，以树龄极长、树干粗壮而闻名；也是墨西哥的国树。"},"examples":[{"en":"The ahuehuete by the river is said to be hundreds of years old.","zh":"河边那棵阿韦韦特树据说有几百年树龄。"},{"en":"Visitors in Oaxaca come to see the famous ahuehuete with its enormous trunk.","zh":"到瓦哈卡的游客会去看那棵以巨大树干闻名的阿韦韦特树。"},{"en":"In Mexican history and poetry, the ahuehuete often symbolizes endurance and memory.","zh":"在墨西哥的历史与诗歌中，阿韦韦特树常象征坚韧与记忆。"}]}],"synonyms":["Mexican cypress","Montezuma cypress","Taxodium mucronatum"],"phonetic":"/ˌɑ.weɪˈweɪ.teɪ/","extraExplanation":["“Ahuehuete”来自纳瓦特尔语（Nahuatl），常被解释为“水边的老树/水之老人”，因为这种树常生长在河流、泉水附近。","发音提示：它是西班牙语借词，英语里读法会有差异；在西语中更接近 a-we-WE-te。","文化补充：墨西哥城查普尔特佩克公园（Bosque de Chapultepec）里有许多阿韦韦特；瓦哈卡的“图莱之树”（El Árbol del Tule）通常被称为著名的 ahuehuete（也常被标注为同属近缘的柏科树），以异常粗大的树干闻名。"]}
{"word":"ahull","summary":{"en":"“Ahull (a-hull)” is a nautical word meaning a ship has its sails taken in and is drifting or lying still, often facing into the wind.","zh":"“ahull（也写作 a-hull）”是航海用语，指船把帆收起，在海上漂流或基本不前进，常船头迎风。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(nautical) With a ship’s sails taken in; drifting or lying still at sea, often with the bow turned into the wind.","zh":"（航海用语）帆都收起；船在海上漂流或停住不怎么前进，常常船头迎风。"},"examples":[{"en":"After the storm hit, the crew kept the boat ahull until the waves calmed down.","zh":"暴风雨来袭后，船员让船保持在 ahull 的状态，直到海浪平息。"},{"en":"The old novel describes a ship left ahull all night in rough water.","zh":"那本老小说描写了一艘船在恶劣海况中整夜处于 ahull 的状态。"}]}],"synonyms":["adrift","hove-to","lying-to"],"phonetic":"/əˈhʌl/","extraExplanation":["“ahull”常写作“a-hull”（也可见作“ahull”），属于较偏航海/文学的用词，日常英语里不常用。","“a-”在一些较老的英语里可表示“处于……状态”（如 asleep, afloat），所以 a-hull 大致就是“处于hull（船体/船）的状态”，引申为“船只不张帆、随风浪漂着/停着”。"]}
{"word":"ahum","summary":{"en":"“Ahum” (more commonly “ahem”) is an interjection used to clear the throat or politely draw attention, sometimes hinting at mild disapproval or awkwardness.","zh":"“ahum”（更常见写作 “ahem”）是感叹词，用来表示清嗓或礼貌地引起注意，有时暗示轻微不满或尴尬。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"Used to clear your throat or to get someone’s attention, often suggesting a polite reminder, mild disapproval, or awkwardness (spelling variant of “ahem”).","zh":"（多写作 ahem 的变体）用来表示清嗓子或引起注意，常带有礼貌提醒、轻微不满或尴尬的语气。"},"examples":[{"en":"Ahum—could we get back to the main point?","zh":"Ahum——我们能回到重点吗？"},{"en":"He said, “ahum,” before speaking, as if to signal everyone to listen.","zh":"他在开口前说了声“ahum”，像是在示意大家注意听。"}]}],"synonyms":["ahem","hem","excuse me"],"phonetic":"/əˈhɛm/","extraExplanation":["“ahum”不是最常见的拼写；更标准、更常见的是“ahem”。在书面语里常用来表示说话者“清嗓”或用一种含蓄方式提醒别人，语气可以从礼貌到略带讽刺，具体看上下文。"]}
{"word":"ahungered","summary":{"en":"“a-hungered/ahungered” is an archaic, literary way to say “hungry,” and sometimes figuratively means “eager/craving.”","zh":"“a-hungered/ahungered”是“hungry（饥饿的）”的古体/文学表达，也可比喻为“渴望、迫切想要”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic or literary) hungry; feeling a strong need for food.","zh":"（古体/文学用语）饥饿的；很想吃东西的。"},"examples":[{"en":"After two days on the road, they were a-hungered and exhausted.","zh":"在路上走了两天之后，他们又饿又累。"},{"en":"The traveler, a-hungered and cold, knocked on the cottage door.","zh":"那位旅人又饿又冷，敲响了小屋的门。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative, archaic or poetic) strongly desiring something; craving.","zh":"（比喻，古体/诗歌用语）渴望某事；强烈想要。"},"examples":[{"en":"She was a-hungered for news from home.","zh":"她迫切渴望家里的消息。"},{"en":"He grew a-hungered for a chance to prove himself.","zh":"他越来越渴望一个证明自己的机会。"}]}],"synonyms":["hungry","starving","famished","eager","craving"],"phonetic":"/əˈhʌŋɡɚd/","extraExplanation":["“a-hungered”也常写作“ahungered”。这里的 a- 是古英语/方言里常见的前缀，用在分词或形容词前（如 a-going, a-coming），有“处于……状态/正在……”的感觉。现代英语里更常用普通形式 hungry 或 starving。","这种写法常见于较旧的文学、民谣或圣经式/古风叙述中，用来营造古朴或口语方言的氛围。"]}
{"word":"ahungry","summary":{"en":"“Hungry” means needing food, or strongly wanting something.","zh":"“hungry”表示“饿的”，也可表示“对某事强烈渴望的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not having eaten enough; feeling that you want food.","zh":"没吃饱的；感到饿、想吃东西的。"},"examples":[{"en":"I’m hungry—let’s eat something.","zh":"我饿了——我们吃点东西吧。"},{"en":"She felt hungry after the long walk.","zh":"走了很久以后，她觉得很饿。"}]},{"partOfSpeech":"adj.","definition":{"en":"Wanting something strongly; eager for something (often used with “for”).","zh":"（对某事）强烈渴望的；非常想要的（常与 for 连用）。"},"examples":[{"en":"He’s hungry for success.","zh":"他非常渴望成功。"},{"en":"They’re hungry for new ideas.","zh":"他们渴望新的想法。"}]}],"synonyms":["starving","famished","eager","craving"],"phonetic":"/ˈhʌŋɡri/","extraExplanation":["你输入的“ahungry”更常见的标准拼写是 **hungry**。在一些方言或较旧/文学化的表达中也会看到 **a-hungry**（相当于“hungry”），其中前缀 **a-** 是旧式用法，现代日常英语里不常用。","常见搭配：**feel hungry**（觉得饿）、**get hungry**（开始饿）、**make sb hungry**（让某人饿/馋）、**hungry for + 名词**（渴望……）。"]}
{"word":"ahunt","summary":{"en":"A-hunt means “hunting” or “searching for something,” often informal or old-fashioned in style.","zh":"a-hunt 指“在打猎”或“在寻找……”，语气较口语或略带旧式/文学色彩。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(informal, often written “a-hunt”) hunting; out looking for something or someone.","zh":"（非正式，常写作 a-hunt）在打猎；（比喻）在寻找某人或某物。"},"examples":[{"en":"They went a-hunt for deer early in the morning.","zh":"他们一大早去打鹿了。"},{"en":"I’m a-hunt for my keys—have you seen them?","zh":"我在找我的钥匙——你看见了吗？"},{"en":"The journalist was a-hunt for the truth behind the rumor.","zh":"那位记者在追查谣言背后的真相。"}]}],"synonyms":["on the hunt","hunting","looking for","in search of"],"phonetic":"/əˈhʌnt/","extraExplanation":["“a-” 这种前缀在现代英语里比较少见，多见于较口语或带点文学/方言色彩的表达（如 a-going, a-coming）。它源自更早期的结构，带有“在……之中/正在……”的感觉。现代更常说 on the hunt (for), hunting, looking for。"]}
{"word":"ahura","summary":{"en":"Ahura is a religious title in ancient Persian tradition meaning a lord or divine being, most famously in “Ahura Mazda.”","zh":"Ahura 是古波斯宗教中的宗教称号，意为“主/神明”，最著名用法见于“Ahura Mazda（阿胡拉·马兹达）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In ancient Persian religion, especially Zoroastrianism) a lord or divine being; often seen in the title “Ahura Mazda,” the supreme god.","zh":"（古代波斯宗教，尤指祆教/琐罗亚斯德教中）“主”“神明”的称号；常见于“Ahura Mazda（阿胡拉·马兹达）”，指至高神。"},"examples":[{"en":"In Zoroastrianism, Ahura Mazda is the wise lord and the creator.","zh":"在琐罗亚斯德教中，阿胡拉·马兹达被视为智慧之主与创造者。"},{"en":"The word “Ahura” appears in the name Ahura Mazda.","zh":"“Ahura”这个词出现在“Ahura Mazda（阿胡拉·马兹达）”这个名字中。"},{"en":"Some history books describe Ahura as a title meaning “lord.”","zh":"一些历史书把 Ahura 解释为意为“主”的称号。"}]}],"synonyms":["lord","deity","divine being"],"phonetic":"/əˈhʊrə/","extraExplanation":["“Ahura”来自古伊朗语系，常被理解为“主/尊者”的宗教称号。最常见的搭配是“Ahura Mazda（阿胡拉·马兹达）”，其中“Mazda”与“智慧”相关，因此整体常译作“智慧之主”。","在英文语境里单独写“Ahura”通常是在讨论祆教或古伊朗历史时，用作宗教术语；日常英语中并不常见。"]}
{"word":"Ahura-mazda","summary":{"en":"Ahura-mazda (Ahura Mazda) is the supreme creator god in Zoroastrianism, linked with wisdom, goodness, and light.","zh":"Ahura-mazda（Ahura Mazda，阿胡拉·马自达）是琐罗亚斯德教的至高创造神，象征智慧、善与光明。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Zoroastrianism, the supreme god and creator, associated with wisdom, goodness, and light; often written as “Ahura Mazda.”","zh":"（琐罗亚斯德教中）至高神与创造者，象征智慧、善与光；常写作“Ahura Mazda（阿胡拉·马自达）”。"},"examples":[{"en":"Ahura Mazda is the central deity in Zoroastrian belief.","zh":"阿胡拉·马自达是琐罗亚斯德教信仰的核心神祇。"},{"en":"In some texts, Ahura Mazda represents truth and moral order.","zh":"在一些文献中，阿胡拉·马自达象征真理与道德秩序。"}]}],"synonyms":["Ahura Mazda","Ormazd","Hormazd"],"phonetic":"/əˌhʊrə ˈmɑːzdə/","extraExplanation":["“Ahura”可理解为“主、尊者”，“Mazda”与“智慧”相关，因此这个名字常被解释为“智慧之主”。","琐罗亚斯德教起源于古伊朗地区，对后来的宗教与哲学观念（如善恶对立、末世审判等主题）有一定影响；不过不同传统与学者对其影响范围的说法不完全一致。","拼写变体常见：Ahura Mazda（更常用）、Ahura-mazda；中古波斯语里也可见 Ormazd / Hormazd 等形式。"]}
{"word":"ahurewa","summary":{"en":"Āhurewa is a Māori word meaning “sacred/holy,” and it can also refer to a sacred place or shrine.","zh":"Āhurewa 是毛利语词，意为“神圣的／圣洁的”，也可指“圣地／神龛”等神圣场所。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Te Reo Māori) sacred; holy; set apart because of spiritual significance.","zh":"（毛利语）神圣的；圣洁的；因灵性意义而被特别区隔的。"},"examples":[{"en":"In the story, the mountain is considered āhurewa by the local iwi.","zh":"在故事里，这座山被当地部族（iwi）视为 āhurewa（神圣的）。"},{"en":"They asked visitors to behave respectfully because the site is āhurewa.","zh":"他们请访客保持尊重，因为这个地点是 āhurewa（神圣之地）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Te Reo Māori) a sacred place, shrine, or consecrated space used for spiritual purposes.","zh":"（毛利语）圣地；神龛；用于宗教／灵性用途的祝圣场所。"},"examples":[{"en":"The community gathered at the āhurewa for a ceremony.","zh":"社区成员聚集在 āhurewa（圣地）举行仪式。"},{"en":"Please don’t touch the objects in the āhurewa.","zh":"请不要触碰 āhurewa（圣所）里的物品。"}]}],"synonyms":["sacred","holy","consecrated","tapu (related Māori concept)"],"phonetic":"/ˌɑhuˈrɛwə/","extraExplanation":["“āhurewa”来自新西兰毛利语（Te Reo Māori）。在语境上常与“tapu”（禁忌／神圣、不可随意冒犯）等概念相关，通常用于描述地点、物件或传统活动的神圣性。","拼写上有时会写作“āhurewa”（带长音符号 macron）以标示元音拉长；不带长音也可能见到，但在正式书写中带长音更常见。使用时建议保持尊重，因为它涉及毛利文化与精神传统。"]}
{"word":"ahush","summary":{"en":"Hush means “silence/quiet” (noun) or “to become/make quiet” (verb).","zh":"hush 表示“寂静/安静”（名词），或“安静下来/使安静”（动词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(noun) a sudden quiet or stillness; a calm silence.","zh":"（名词）突然的安静；寂静；无声的状态。"},"examples":[{"en":"A hush fell over the crowd when the music stopped.","zh":"当音乐停止时，人群突然安静了下来。"},{"en":"There was a hush in the room as the teacher began speaking.","zh":"老师开始讲话时，教室里一片安静。"}]},{"partOfSpeech":"vi.","definition":{"en":"(verb, intransitive) to become quiet; to stop making noise.","zh":"（不及物动词）安静下来；停止发出声音。"},"examples":[{"en":"The children finally hushed when the lights went out.","zh":"灯一关，孩子们终于安静下来了。"},{"en":"Everyone hushed as the announcement began.","zh":"通知开始时，大家都安静了下来。"}]},{"partOfSpeech":"vt.","definition":{"en":"(verb, transitive) to make someone quiet, often gently or firmly.","zh":"（及物动词）使（某人）安静，常带有温和或坚定的意味。"},"examples":[{"en":"She hushed the baby by singing softly.","zh":"她轻声唱歌让宝宝安静下来。"},{"en":"The librarian hushed the noisy students.","zh":"图书管理员让吵闹的学生安静下来。"}]}],"synonyms":["silence","quiet","shush","stillness"],"phonetic":"/hʌʃ/","extraExplanation":["“ahush”本身不是常见英文单词。你可能想输入的是：\n1) “hush”（动词/名词）：安静、使安静；\n2) “a hush”（名词短语）：一阵安静（例如：A hush fell over the room.）。\n如果你告诉我你看到“ahush”的句子原文，我也可以帮你判断它到底是哪一种。"]}
{"word":"ahuula","summary":{"en":"“ahuula” is not a standard English word; it likely needs context or correction.","zh":"“ahuula”不是标准英语单词；很可能需要语境或是拼写需要更正。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name, or a word from another language.","zh":"不是标准英语单词，可能是拼写错误、人名/网名，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “ahuula” in an English dictionary—did you mean a different word?","zh":"我在英语词典里找不到“ahuula”——你是不是想写别的词？"},{"en":"If “Ahuula” is a username or a name, please share the context so I can help.","zh":"如果“Ahuula”是用户名或名字，请提供语境，我就能更准确地帮你。"}]}],"phonetic":"əˈhuːlə","extraExplanation":["“ahuula”看起来不像常见英语词汇，比较可能是：①拼写输入时多打/少打了字母；②专有名词（人名、品牌、ID）；③其他语言的音译/拼写。","你可以告诉我它出现的场景（一句话、哪个网站/游戏/歌曲里、你想表达的意思），我可以帮你确认最可能的词。","如果你本来想写的是 **hula**（草裙舞/呼啦圈相关），或 **ululate**（高声颤音欢呼/哀号），也可以回复我确认，我再给你完整词条。"]}
{"word":"Ahuzzath","summary":{"en":"A biblical proper name: an adviser/companion of King Abimelech in Genesis 26:26.","zh":"圣经人名：在《创世记》26:26中随非利士王亚比米勒出行的谋士/随从之一。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ahuzzath: a male personal name in the Bible, known as a companion/adviser of Abimelech, the Philistine king, who visits Isaac to make a peace agreement (Genesis 26:26).","zh":"Ahuzzath：圣经中的男性人名；他是非利士王亚比米勒的随从/谋士之一，与亚比米勒一同去见以撒并立约求和（《创世记》26:26）。"},"examples":[{"en":"In Genesis 26:26, Ahuzzath accompanies Abimelech to meet Isaac.","zh":"在《创世记》26:26中，Ahuzzath 随亚比米勒去见以撒。"},{"en":"The name Ahuzzath appears mainly as a brief historical detail rather than a main character.","zh":"Ahuzzath 这个名字主要作为简短的史实细节出现，并非主要人物。"}]}],"phonetic":"əˈhʌzəθ","extraExplanation":["这是一个专有名词（人名），通常不用于日常英语对话；多见于圣经阅读、宗教研究或文学引用中。","不同英文译本中拼写与译名可能略有差异；若你在读的是中文圣经，可能会看到与之对应的音译版本。"]}
{"word":"Ahvaz","summary":{"en":"Ahvaz: a major city in southwestern Iran and the capital of Khuzestan Province.","zh":"Ahvaz：伊朗西南部的重要城市，胡齐斯坦省省会。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in southwestern Iran, the capital of Khuzestan Province, known for its hot climate and its location on the Karun River.","zh":"伊朗西南部的一座城市，胡齐斯坦省（Khuzestan）的首府，以炎热气候和位于卡伦河（Karun River）沿岸而闻名。"},"examples":[{"en":"Ahvaz is one of the hottest major cities in Iran during summer.","zh":"阿瓦士（Ahvaz）在夏季是伊朗最炎热的大城市之一。"},{"en":"She moved to Ahvaz for work in the energy industry.","zh":"她为了能源行业的工作搬到了阿瓦士。"}]}],"synonyms":["Ahwaz"],"phonetic":"ɑːˈvɑːz","extraExplanation":["“Ahvaz”是该城市英文常见拼写；中文里常译作“阿瓦士”。它位于伊朗重要的石油与工业区域胡齐斯坦省，历史上也与古代埃兰（Elam）文化和后来的多元族群（如阿拉伯人、波斯人等）有关。"]}
{"word":"Ahvenanmaa","summary":{"en":"Ahvenanmaa is the Finnish name for the Åland Islands, an autonomous Swedish-speaking region of Finland.","zh":"Ahvenanmaa 是奥兰群岛的芬兰语名称：芬兰的一个以瑞典语为主、享有自治的群岛地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Finnish name for the Åland Islands, an autonomous, Swedish-speaking archipelago belonging to Finland in the Baltic Sea","zh":"奥兰群岛（Åland Islands）的芬兰语名称：位于波罗的海、隶属芬兰但高度自治、以瑞典语为主的群岛"},"examples":[{"en":"Ahvenanmaa is known in Swedish as Åland.","zh":"Ahvenanmaa 的瑞典语名称是 Åland（奥兰）。"},{"en":"Many tourists visit Ahvenanmaa in summer for cycling and island ferries.","zh":"许多游客夏天会去 Ahvenanmaa 骑行、乘坐岛际渡轮。"},{"en":"Ahvenanmaa has its own local government within Finland.","zh":"Ahvenanmaa 在芬兰境内拥有自己的地方自治政府。"}]}],"synonyms":["Åland","the Åland Islands","Aaland Islands"],"phonetic":"/ˈɑh.ve.nɑːn.mɑː/","extraExplanation":["“Ahvenanmaa”是芬兰语地名，其中“ahven”意为“鲈鱼”，“maa”意为“土地/地方”，字面可理解为“鲈鱼之地”。","奥兰群岛的官方语言是瑞典语，因此在国际语境与英语里更常见“Åland”或“The Åland Islands”；在芬兰语语境（如芬兰媒体、地图）常用“Ahvenanmaa”。","该地区因历史与地缘政治原因享有高度自治，并实行非军事化安排；这也是它在北欧政治与文化讨论中常被提及的背景。"]}
{"word":"Ahwahnee","summary":{"en":"Ahwahnee is a proper name connected to Yosemite Valley and also the well-known Ahwahnee Hotel in Yosemite National Park.","zh":"Ahwahnee 是与优胜美地山谷相关的专名，也指优胜美地国家公园内著名的 Ahwahnee 酒店。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper noun) A historic Native American name associated with Yosemite Valley in California; often used to refer to the valley area and its cultural history.","zh":"（专有名词）与美国加州优胜美地山谷（Yosemite Valley）相关的美洲原住民旧称；常用来指代该山谷及其文化历史背景。"},"examples":[{"en":"Some sources say Yosemite Valley was traditionally called Ahwahnee by local Native people.","zh":"一些资料指出，当地原住民传统上称优胜美地山谷为 Ahwahnee。"},{"en":"The park program discussed the Ahwahneechee people and their connection to the valley.","zh":"公园的讲解活动介绍了 Ahwahneechee 族群以及他们与山谷的联系。"}]},{"partOfSpeech":"other","definition":{"en":"(Proper noun) The Ahwahnee Hotel, a famous historic hotel in Yosemite National Park.","zh":"（专有名词）Ahwahnee 酒店：优胜美地国家公园内著名的历史酒店。"},"examples":[{"en":"We had afternoon tea at the Ahwahnee after hiking all day.","zh":"我们徒步了一整天后，在 Ahwahnee 酒店喝了下午茶。"},{"en":"The Ahwahnee is known for its grand hall and stone-and-wood design.","zh":"Ahwahnee 酒店以宏伟的大厅以及石材与木材结合的建筑风格而闻名。"}]}],"synonyms":["Yosemite Valley (related)","The Ahwahnee Hotel (related)","Ahwahneechee (related)"],"phonetic":"/ɑːˈwɑːni/","extraExplanation":["“Ahwahnee”常被解释为源自南塞拉米沃克语（Southern Sierra Miwok）等原住民语言的地名，常见释义与“像嘴一样张开/开口处（gaping mouth）”相关，用来形容山谷地形的开阔入口感。不同资料对拼写与精确释义可能略有差异。","在书写与讲述时，建议将其视为与原住民历史相关的专名：可同时提到 Ahwahneechee（与山谷相关的族群称呼）与 Yosemite 这一更广为人知的现代地名，以示尊重与清晰。","文学与旅行写作中常把 “Ahwahnee” 用作带有历史感与地方色彩的称呼，尤其在描述优胜美地的自然景观与文化叙事时。"]}
{"word":"Ahwahneechee","summary":{"en":"Ahwahneechee refers to the Native people historically connected to Yosemite Valley (Ahwahnee) in California.","zh":"Ahwahneechee 指历史上与加州优胜美地山谷（Ahwahnee）有关的原住民族群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Native American people historically associated with Yosemite Valley (Ahwahnee) in California; often described as a local group connected to Southern Sierra Miwok and nearby Paiute communities.","zh":"历史上与加州优胜美地山谷（Ahwahnee）有关的原住民族群；常被描述为与南部山麓米沃克（Southern Sierra Miwok）及邻近派尤特（Paiute）社群有关联的地方性群体。"},"examples":[{"en":"The Ahwahneechee lived in and around Yosemite Valley long before the national park was created.","zh":"在国家公园建立之前，Ahwahneechee 就长期生活在优胜美地山谷及其周边。"},{"en":"Some books mention the Ahwahneechee when discussing early Yosemite history and culture.","zh":"一些书在谈到优胜美地早期历史与文化时会提到 Ahwahneechee。"}]}],"synonyms":["Ahwahneechee people","people of Ahwahnee"],"phonetic":"ˌɑːwɑːˈniːtʃiː","extraExplanation":["“Ahwahneechee”来自“Ahwahnee”（优胜美地山谷的原住民称呼，常被解释为“巨大之口/大口”的意象）加上表示“……的人”的后缀含义，可理解为“Ahwahnee 的人”。","在历史资料与现代研究中，这个名称有时会被不同作者以不同方式使用：既可能指山谷内的特定地方群体，也可能被更宽泛地当作与米沃克/派尤特相关的山谷居民统称。阅读时可留意作者的定义与语境。","在优胜美地相关的英文资料（游客中心介绍、历史书、解说牌）中常见该词；作为族名/专名，通常首字母大写。"]}
{"word":"ahwal","summary":{"en":"Ahwal means “conditions/circumstances,” and in religious or poetic contexts it can mean inner (emotional or spiritual) states.","zh":"Ahwal 指“状况/处境”，在宗教或诗歌语境中也可指内在（情绪或灵性）状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"conditions or circumstances; a person’s situation or state of affairs (used mainly in Arabic/Urdu contexts).","zh":"状况；情形；处境（主要用于阿拉伯语/乌尔都语语境）。"},"examples":[{"en":"He wrote about the ahwal of refugees living near the border.","zh":"他写到了住在边境附近难民的处境。"},{"en":"Given the current ahwal, the meeting was postponed.","zh":"鉴于目前的情况，会议被推迟了。"}]},{"partOfSpeech":"n.","definition":{"en":"states or inner conditions (often emotional or spiritual), especially in religious or poetic writing.","zh":"状态；内在境况（常指情绪或精神/灵性状态，尤见于宗教或诗歌写作）。"},"examples":[{"en":"The poet described changing ahwal of the heart.","zh":"诗人描写了内心不断变化的状态。"}]}],"synonyms":["conditions","circumstances","situation","state of affairs","states"],"phonetic":"/ɑːˈwɑːl/","extraExplanation":["“ahwal”常被视为阿拉伯语“aḥwāl”（أحوال）的转写，通常是“ḥāl（حال）”的复数，意思接近“情形/境况/状态”。在英文里它不算常用词，多出现在新闻报道、学术写作或翻译文本中，用来保留原语的文化语感。","在一些宗教与文学语境（尤其苏菲传统的英文译写）中，“ahwal”可更偏向“心灵/灵性状态”的含义，因此语气会比普通的“conditions”更带有内在体验色彩。"]}
{"word":"Ahwaz","summary":{"en":"Ahwaz: a city in southwestern Iran (also spelled Ahvaz).","zh":"Ahwaz：伊朗西南部城市（也拼作 Ahvaz，中文常译“阿瓦士”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A major city in southwestern Iran, the capital of Khuzestan Province; often spelled “Ahvaz.”","zh":"伊朗西南部的重要城市，胡齐斯坦省省会；常见拼写为“Ahvaz（阿瓦士）”。"},"examples":[{"en":"Ahwaz is one of the largest cities in southwestern Iran.","zh":"阿瓦士（Ahwaz）是伊朗西南部最大的城市之一。"},{"en":"She traveled from Tehran to Ahwaz for work.","zh":"她因工作从德黑兰前往阿瓦士。"},{"en":"The Karun River runs through Ahwaz.","zh":"卡伦河流经阿瓦士。"}]}],"synonyms":["Ahvaz"],"phonetic":"/ɑːˈwɑːz/","extraExplanation":["“Ahwaz”是英语中更常见的拼写，“Ahwaz/Ahvaz”两种写法都指同一座城市，中文常译作“阿瓦士”。","阿瓦士位于胡齐斯坦省（Khuzestan），靠近伊朗重要的油气产区；当地夏季常非常炎热。"]}
{"word":"ahypnia","summary":{"en":"Ahypnia is an uncommon medical word meaning insomnia or the inability to sleep.","zh":"Ahypnia 是一个较少见的医学词，意思是失眠/无法入睡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical, uncommon) A condition of not being able to sleep; insomnia.","zh":"（医学用语，较少见）无法入睡的状态；失眠。"},"examples":[{"en":"After several nights of ahypnia, she felt exhausted and unfocused at work.","zh":"连续几晚失眠（ahypnia）后，她在工作中感到精疲力竭、难以集中注意力。"},{"en":"The doctor asked about stress, caffeine, and other possible causes of ahypnia.","zh":"医生询问了压力、咖啡因等可能导致失眠（ahypnia）的原因。"}]}],"synonyms":["insomnia","sleeplessness","wakefulness"],"phonetic":"/eɪˈhɪpniə/","extraExplanation":["“ahypnia”较为少用，日常英语里通常用“insomnia”或“sleeplessness”。","词源结构可理解为 a-（否定/无）+ hypnia（与睡眠相关），含义直观：没有睡眠。"]}

