{"word":"AJ","summary":{"en":"AJ is most commonly used as a person’s initials (A.J.) as a nickname, and it can also refer to Al Jazeera in news contexts.","zh":"AJ最常见是作为人名首字母（A.J.）的昵称；在新闻语境中也可指半岛电视台（Al Jazeera）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"the initials “A.J.” used as a name or nickname (often for someone whose first and middle names start with A and J).","zh":"用作姓名或昵称的首字母缩写“A.J.”（常指名字的第一个和中间名分别以A、J开头的人）。"},"examples":[{"en":"Everyone calls him AJ, but his full name is Andrew James.","zh":"大家都叫他AJ，但他的全名是Andrew James。"},{"en":"AJ will be presenting the report today.","zh":"今天由AJ来做报告。"}]},{"partOfSpeech":"other","definition":{"en":"a short form for Al Jazeera, a major international news network.","zh":"Al Jazeera（半岛电视台）的简称，一家重要的国际新闻媒体。"},"examples":[{"en":"I saw the interview on AJ last night.","zh":"我昨晚在AJ上看到了那段采访。"},{"en":"The story was first reported by AJ English.","zh":"这则新闻最早由AJ English报道。"}]}],"synonyms":["A.J. (variant spelling)","initials (as a nickname)"],"phonetic":"/ˌeɪ ˈdʒeɪ/","extraExplanation":["在英语里，用“两个首字母”当昵称很常见，书写时既可写作“AJ”，也可写作“A.J.”；正式文件里通常会写全名，口语或熟人间更常用首字母称呼。","“AJ”指半岛电视台时，多出现在新闻语境；如果需要更明确，可以说“Al Jazeera”或“Al Jazeera English”。"]}
{"word":"AJA","summary":{"en":"AJA is an abbreviation; it most often refers to the American Journal of Archaeology or the Asian Journal of Andrology, but it can also be a context-specific organization name.","zh":"AJA 是缩写；最常见指《美国考古学杂志》或《亚洲男科学杂志》，也可能是某个组织的特定简称，需看语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) American Journal of Archaeology (an academic journal about archaeology and ancient history).","zh":"（缩写）《美国考古学杂志》（研究考古学与古代史的学术期刊）。"},"examples":[{"en":"She published her article in AJA last year.","zh":"她去年在 AJA 上发表了文章。"},{"en":"In AJA, the author discusses new findings from Pompeii.","zh":"在 AJA 中，作者讨论了庞贝的新发现。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Asian Journal of Andrology (an academic journal about male reproductive health and related medicine).","zh":"（缩写）《亚洲男科学杂志》（关注男性生殖健康与相关医学的学术期刊）。"},"examples":[{"en":"The study first appeared in AJA as a brief report.","zh":"这项研究最初以简报形式发表在 AJA 上。"},{"en":"According to AJA, lifestyle factors can affect fertility.","zh":"据 AJA 报道，生活方式因素会影响生育力。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Used in some organizations as a short name (for example, a company, school club, or association). The exact meaning depends on the context.","zh":"（缩写）在一些组织中用作简称（例如公司、学校社团或协会）。具体含义取决于语境。"},"examples":[{"en":"I’m meeting the AJA team at 3 p.m.","zh":"我下午三点要和 AJA 团队见面。"},{"en":"AJA announced a new policy on its website.","zh":"AJA 在官网发布了一项新政策。"}]}],"synonyms":["abbreviation","acronym"],"phonetic":"/ˌeɪ dʒeɪ ˈeɪ/","extraExplanation":["“AJA”不是一个固定单词，最常见是期刊名的缩写。要准确判断含义，通常需要你看到它的完整句子、行业领域（考古/医学/公司名等），或第一次出现时是否有全称（full name）说明。","如果你把出现“AJA”的原句发我，我可以帮你判断在那段语境里最可能指哪一个全称。"]}
{"word":"Ajaccio","summary":{"en":"Ajaccio is a city in Corsica, France, and the island’s capital, famous as Napoleon’s birthplace.","zh":"Ajaccio（阿雅克肖）是法国科西嘉岛的城市与首府，以拿破仑的出生地闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city on the island of Corsica (France), and the capital of Corsica; known as the birthplace of Napoleon Bonaparte.","zh":"阿雅克肖（Ajaccio）：法国科西嘉岛上的城市、科西嘉的首府；以拿破仑·波拿巴的出生地闻名。"},"examples":[{"en":"Ajaccio is the capital of Corsica, a French island in the Mediterranean Sea.","zh":"阿雅克肖是科西嘉岛的首府；科西嘉是法国在地中海的一座岛。"},{"en":"Many tourists visit Ajaccio to learn about Napoleon’s early life.","zh":"许多游客去阿雅克肖了解拿破仑的早年生活。"}]}],"synonyms":["Corsica (related place)"],"phonetic":"/aɪˈjɑːtʃi.oʊ/","extraExplanation":["“Ajaccio”是法语地名，在法语里读音更接近“啊-雅-克-修”（大致 [aʒaksjo]），而英语里常见的读法会更“英语化”。","阿雅克肖位于科西嘉岛西岸。科西嘉在文化与历史上常被视为兼具法意影响的地区。","拿破仑1769年出生于阿雅克肖；城市里有与拿破仑家族相关的博物馆与纪念地点。"]}
{"word":"Ajaja","summary":{"en":"“Ajaja / Aja aja” is an informal Korean-style cheer meaning “Let’s go!” or “You can do it!”","zh":"“Ajaja / Aja aja”是韩式口号，意思是“加油 / 你可以的！”"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(Korean loanword, informal) A cheer meaning “Let’s go!” “You can do it!” used to encourage someone.","zh":"（韩语借词，非正式）加油、打起精神、你可以的！用来鼓励别人。"},"examples":[{"en":"Aja aja! You’re almost finished with your exam.","zh":"Ajaja！你考试快写完了。"},{"en":"Before the game, the fans shouted, “Aja aja!”","zh":"比赛前，粉丝们喊着“Ajaja！”"},{"en":"I was nervous, and my friend texted me: “Aja aja!”","zh":"我很紧张，朋友发短信给我：“Ajaja！”"}]},{"partOfSpeech":"other","definition":{"en":"A romanized spelling of Korean “아자 아자 (aja aja)”; also seen as “ajaja,” “aja aja,” or “fighting!” in K-culture contexts.","zh":"韩语“아자 아자（aja aja）”的罗马字拼写；在韩流语境中也常写作“ajaja / aja aja”，或对应表达“fighting!”（加油）。"},"examples":[{"en":"In K-pop comments, you might see “ajaja” under a trainee’s video.","zh":"在K-pop评论区里，你可能会在练习生视频下看到“ajaja”。"},{"en":"She wrote “aja aja” on the sticky note to motivate herself.","zh":"她在便利贴上写“aja aja”来给自己打气。"}]}],"synonyms":["You got this!","Let’s go!","Keep it up!","Cheer up!","Fighting! (Korean-style)"],"phonetic":"/ˈɑːdʒɑ ˈɑːdʒɑ/","extraExplanation":["“아자 아자(aja aja)”是韩语里很常见的打气口号，语气积极、亲切，常对朋友、同学、队友使用。","在英语语境中常与“Korean-style cheering”关联；如果对不熟悉韩流的人使用，最好加一句解释（如“Let’s go / You got this”）。","有时你也会看到“화이팅(hwaiting/fighting)”，意思相近，但“fighting”在英文里本义是“打架/战斗”，属于韩式英语用法。"]}
{"word":"ajaja","summary":{"en":"“ajaja” means “hahaha,” mainly in Spanish-language online chat.","zh":"“ajaja”表示“哈哈哈”，主要见于西语网络聊天。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"A written representation of laughter, commonly used in Spanish-language texting; similar to “hahaha” in English.","zh":"（网络/短信）表示笑声的写法，常见于西语语境；相当于英语的“hahaha”。"},"examples":[{"en":"A: I fell off my chair.  B: ajaja, are you okay?","zh":"A：我从椅子上摔下来了。B：ajaja，你没事吧？"},{"en":"She replied “ajaja” to show she thought it was funny.","zh":"她回了“ajaja”表示觉得很好笑。"}]}],"synonyms":["hahaha","haha","lol"],"phonetic":"/ɑˈhɑˌhɑ/","extraExplanation":["“j”在西班牙语里常发类似英语/h/的音，所以“ajaja”大致读作“ah-ha-ha”。在英语聊天里也有人用它来表现“西语式”的笑，带一点轻松、玩笑的语气。"]}
{"word":"ajangle","summary":{"en":"Ajangle is a rare literary word meaning “jingling noisily” or “in a confused, unsettled state.”","zh":"Ajangle 是较罕见的文学用词，表示“叮当作响”，也可比喻“混乱不安、心神不宁”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare, literary) Making a harsh, repeated ringing or clashing sound; in a jangle.","zh":"（罕见/文学用语）发出刺耳的叮当声、碰撞声；叮当作响。"},"examples":[{"en":"The keys in his pocket were ajangle as he ran.","zh":"他跑起来时，口袋里的钥匙叮当作响。"},{"en":"The old bells were ajangle in the wind.","zh":"老钟铃在风里叮当作响。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare, figurative) In a state of nervous excitement or confusion; unsettled.","zh":"（罕见/比喻）心神不宁、混乱不安；烦躁的。"},"examples":[{"en":"After the argument, her thoughts were ajangle.","zh":"争吵过后，她思绪一团乱。"},{"en":"With deadlines piling up, the whole office felt ajangle.","zh":"截止日期一堆，整个办公室都变得焦躁不安。"}]}],"synonyms":["jingling","clattering","in a jangle","unsettled","frazzled"],"phonetic":"/əˈdʒæŋɡəl/","extraExplanation":["“ajangle”很少见，带有诗歌/文学色彩。它通常可理解为“in a jangle（叮当作响/混乱）”。","词首的 a- 在一些较旧的英语里有“处于……状态/在……”的意思（类似 alive, asleep），因此 ajangle ≈ “处于 jangle 的状态”。","日常英语更常用：jingling（叮当作响）、clattering（哐啷作响）、in a muddle / in turmoil（混乱不安）。"]}
{"word":"Ajani","summary":{"en":"Ajani is a personal name; it is also known as a character name in some pop culture contexts.","zh":"Ajani 是人名；在某些流行文化语境中也作为角色名而为人所知。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a personal name (given name), often used for boys; it is also used as a fictional character name in popular culture.","zh":"人名（名字），常用于男孩；也常被用作流行文化中的虚构角色名。"},"examples":[{"en":"Ajani introduced himself and shook my hand.","zh":"Ajani 做了自我介绍，并和我握手。"},{"en":"In the story, Ajani is the one who protects the village.","zh":"在故事里，Ajani 是保护村庄的人。"},{"en":"My friend named her cat Ajani after a character she likes.","zh":"我朋友把她的猫取名 Ajani，是因为她喜欢一个同名角色。"}]}],"synonyms":["(proper name)"],"phonetic":"/əˈdʒɑːni/","extraExplanation":["“Ajani”在现实中常见于西非背景的姓名（尤其与约鲁巴语名字传统有关），不同家族/地区对名字含义的解释可能略有差异。","在流行文化中，“Ajani”也常让人联想到《万智牌》（Magic: The Gathering）中的角色 Ajani Goldmane，因此在玩家社群里识别度较高。"]}
{"word":"Ajanta","summary":{"en":"Ajanta usually refers to the Ajanta Caves—ancient Buddhist rock-cut caves in India famous for murals and sculpture; it can also be a nearby place name.","zh":"Ajanta 通常指印度著名的阿旃陀佛教石窟群（以壁画与雕塑闻名）；也可指石窟附近的地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ajanta (often referring to the Ajanta Caves): a famous group of ancient Buddhist rock-cut caves in Maharashtra, India, known for their murals (wall paintings) and sculptures.","zh":"阿旃陀（常指阿旃陀石窟）：印度马哈拉施特拉邦一处著名的古代佛教石窟群，以壁画和雕塑闻名。"},"examples":[{"en":"The Ajanta Caves are celebrated for some of the finest Buddhist murals in the world.","zh":"阿旃陀石窟以拥有世界上最精美的佛教壁画之一而著称。"},{"en":"We studied Ajanta in art history to understand early Indian painting techniques.","zh":"我们在艺术史课上学习阿旃陀，用来了解早期印度绘画技法。"}]},{"partOfSpeech":"n.","definition":{"en":"Ajanta: a place name for a village/town near the caves in Maharashtra, India.","zh":"阿旃陀：印度马哈拉施特拉邦石窟附近的村镇地名。"},"examples":[{"en":"From Ajanta village, visitors can travel to the caves by bus or car.","zh":"从阿旃陀村镇出发，游客可以乘公交或开车前往石窟。"}]}],"synonyms":["Ajanta Caves","Ajanta rock-cut caves","Ajanta site"],"phonetic":"/əˈdʒʌn.tə/","extraExplanation":["“Ajanta Caves（阿旃陀石窟）”多建于公元前2世纪至公元5世纪之间，主要与佛教传统相关，壁画常描绘佛陀本生故事（Jataka tales）。","阿旃陀石窟与“Ellora Caves（埃洛拉石窟）”常被一起提及；阿旃陀以绘画壁画特别出名，而埃洛拉以多宗教石窟并存（佛教、印度教、耆那教）更具代表性。"]}
{"word":"ajar","summary":{"en":"Ajar means slightly open, not fully closed.","zh":"ajar 表示“半开着、微微打开”，强调“没有关严”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Slightly open (not fully closed), usually used for a door, window, lid, or mouth.","zh":"（门、窗、盖子、嘴等）半开着的；微开着的（未完全关上）。"},"examples":[{"en":"The door was left ajar, so the cat slipped inside.","zh":"门被半掩着，所以猫溜了进去。"},{"en":"She opened the window ajar to let in some fresh air.","zh":"她把窗户微微打开，让新鲜空气进来。"},{"en":"He spoke with his mouth ajar, surprised by the news.","zh":"听到这个消息他惊得嘴半张着说不出话来。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a slightly open position.","zh":"以半开着的状态；微微打开地。"},"examples":[{"en":"Leave the door ajar for me, please.","zh":"请给我把门留一条缝。"},{"en":"The lid sat ajar and the soup cooled quickly.","zh":"锅盖半开着，汤很快就凉了。"}]}],"synonyms":["slightly open","partly open","not fully closed","cracked (open)"],"phonetic":"/əˈdʒɑr/","extraExplanation":["“ajar”常用于固定搭配：leave/keep the door ajar（把门留条缝）。语气比“open”更强调“没有关严”。","词源上，“ajar”里的“jar”与“玻璃罐 jar（名词）”无关，更接近古义“转动/偏离”的意思，所以整体表示“稍微偏开”。"]}
{"word":"ajari","summary":{"en":"“Ajari” is an Indonesian/Malay verb meaning “to teach someone.”","zh":"“ajari”是印尼语/马来语动词，意思是“教某人”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Indonesian/Malay) to teach someone; to instruct; to show someone how to do something.","zh":"（印尼语/马来语）教（某人）；指导；教会某人做某事。"},"examples":[{"en":"Please ajari me how to use this app.","zh":"请教我怎么用这个应用。"},{"en":"My father ajari me to ride a bicycle.","zh":"我爸爸教我骑自行车。"}]}],"synonyms":["teach","instruct","coach","show"],"phonetic":"/ɑˈdʒɑri/","extraExplanation":["“ajari”不是常见英语词，更多见于印尼语/马来语口语或夹杂在英语对话中使用。","它来自词根“ajar”（学习/教），加后缀“-i”，常表示“对某人做这个动作”，所以“ajari (seseorang)”=“教某人”。","在纯英语表达中通常用 teach / instruct / show (someone) how to ... 来替换。"]}
{"word":"Ajatasatru","summary":{"en":"Ajatasatru is an ancient Indian king of Magadha, famous in historical and Buddhist/Jain traditions.","zh":"阿阇世是古印度摩揭陀国国王，在历史与佛教/耆那教传统中都很著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ajatasatru (also spelled Ajatashatru): a king of Magadha in ancient India (around the 5th century BCE), known in Indian history and Buddhist/Jain traditions for expanding Magadha’s power and for his complex relationship with the Buddha and his father, King Bimbisara.","zh":"阿阇世（又拼作 Ajatashatru）：古印度摩揭陀国（约公元前5世纪）的国王，在印度历史以及佛教、耆那教传统中很有名；以扩张摩揭陀势力、以及与佛陀和其父王频婆娑罗之间复杂的故事而著称。"},"examples":[{"en":"Ajatasatru is remembered as an important ruler in early Indian history.","zh":"阿阇世被视为早期印度历史中重要的统治者。"},{"en":"In Buddhist texts, Ajatasatru later shows remorse and seeks guidance from the Buddha.","zh":"在一些佛教经典中，阿阇世后来生起悔意，并向佛陀寻求教导。"},{"en":"Some accounts say Ajatasatru seized the throne after imprisoning his father, Bimbisara.","zh":"一些记载说，阿阇世囚禁其父频婆娑罗后夺取王位。"}]}],"synonyms":["Ajatashatru","Ajātaśatru"],"phonetic":"/əˌdʒɑːtəˈʃʌtruː/","extraExplanation":["“Ajatasatru/阿阇世”常见于佛教史、印度古代史与相关文学叙事中。不同传统对他的评价不一：有的强调其弑父夺位的“恶业”与后来的忏悔，有的更突出他在政治与战争上的作为。阅读英文资料时也会遇到拼写差异，如 Ajatasatru 与 Ajatashatru，一般指同一人物。"]}
{"word":"ajatasatru","summary":{"en":"Ajatashatru is the name of an ancient Indian king of Magadha, famous in Buddhist and Jain history and stories.","zh":"Ajatashatru 指古印度摩揭陀国的阿阇世王，在佛教与耆那教历史与故事中很有名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a king of Magadha in ancient India (c. 5th century BCE), known in Buddhist and Jain traditions for his political power, his conflict with his father Bimbisara, and his role in early Buddhist history.","zh":"阿阇世王（古印度摩揭陀国国王，约公元前5世纪），在佛教与耆那教传统中以强大的政治势力、与父王频婆娑罗的冲突，以及与早期佛教历史的关联而闻名。"},"examples":[{"en":"Ajatashatru is often mentioned in stories about the early Buddhist community.","zh":"阿阇世王常出现在关于早期僧团的故事中。"},{"en":"Many textbooks describe Ajatashatru as a powerful ruler of Magadha.","zh":"许多教材把阿阇世王描述为摩揭陀国的强势君主。"}]}],"synonyms":["Ajātaśatru","Ajaatashatru"],"phonetic":"/əˌdʒɑːtəˈʃætruː/","extraExplanation":["“Ajatashatru”常见拼写也包括“Ajātaśatru / Ajatashatru / Ajaatashatru”，源自梵语，常被解释为“未生之敌”（意指“敌人尚未出生”或“天生无敌”一类的称号/名字）。","他与父亲频婆娑罗（Bimbisara）的关系在佛教与耆那教叙事里都很重要：一些版本写到他在政治斗争中弑父或导致父亲死亡，这类情节常用来讨论业报、悔恨与伦理。","在佛教传统中，他常与“第一次结集”（佛陀涅槃后经典结集的传说背景）相关；在耆那教传统中，他也与摩揭陀地区的政治与宗教发展相关。阅读时要注意：不同传统与史料对细节记载可能不一致。"]}
{"word":"ajava","summary":{"en":"Java most commonly means the Indonesian island, coffee (informal), or the programming language.","zh":"Java 最常见的意思是印度尼西亚的爪哇岛、（口语）咖啡，或 Java 编程语言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Java: a large Indonesian island; also a major coffee-producing region.","zh":"Java（爪哇岛）：印度尼西亚的一座大岛；也指重要的咖啡产区。"},"examples":[{"en":"My friend traveled to Java to visit Borobudur.","zh":"我朋友去爪哇岛旅行，参观了婆罗浮屠。"},{"en":"Coffee from Java is known worldwide.","zh":"来自爪哇的咖啡在世界各地都很有名。"}]},{"partOfSpeech":"n.","definition":{"en":"java (informal): coffee.","zh":"java（非正式）：咖啡。"},"examples":[{"en":"I need a cup of java before work.","zh":"上班前我需要来一杯咖啡。"},{"en":"Let’s grab some java and talk.","zh":"我们去买点咖啡聊聊吧。"}]},{"partOfSpeech":"n.","definition":{"en":"Java: a popular programming language used to build apps and websites.","zh":"Java：一种常见的编程语言，用来开发应用程序和网站等。"},"examples":[{"en":"She is learning Java to build Android apps.","zh":"她正在学习 Java 来开发安卓应用。"},{"en":"This website’s backend is written in Java.","zh":"这个网站的后端是用 Java 写的。"}]}],"synonyms":["coffee","joe","programming language"],"phonetic":"/ˈdʒɑːvə/","extraExplanation":["“ajava”本身不是常见英语单词；很多时候是把“a Java”（一个 Java 程序/一杯咖啡等）连在一起写了，或是想输入“Java”。如果你是在特定语境（比如用户名、缩写、品牌）里看到“ajava”，告诉我句子，我可以帮你判断具体含义。","“java=咖啡”的用法来自爪哇岛早期的咖啡贸易史，所以在口语里用地名代指咖啡，类似用“mocha”指一种咖啡口味。"]}
{"word":"Ajax","summary":{"en":"Ajax can mean a Greek myth hero, a web development technique (AJAX), or a cleaning brand.","zh":"Ajax 可以指希腊神话英雄、网页开发技术（AJAX），或一种清洁品牌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hero in Greek mythology (often called Ajax the Great), a powerful warrior in the Trojan War.","zh":"希腊神话中的英雄（常指“大埃阿斯”Ajax the Great），特洛伊战争中的强大战士。"},"examples":[{"en":"In Greek myth, Ajax is known for his strength and pride.","zh":"在希腊神话中，Ajax 以力量和自尊闻名。"},{"en":"Some students read about Ajax in stories of the Trojan War.","zh":"一些学生会在特洛伊战争的故事中读到 Ajax。"}]},{"partOfSpeech":"n.","definition":{"en":"(Computing) A technique for updating part of a web page without reloading the whole page; short for “Asynchronous JavaScript and XML.”","zh":"（计算机）一种无需刷新整页就能更新网页局部内容的技术；是 “Asynchronous JavaScript and XML” 的缩写。"},"examples":[{"en":"This search box uses AJAX to show results instantly.","zh":"这个搜索框使用 AJAX 来即时显示结果。"},{"en":"AJAX helped make web apps feel faster and more interactive.","zh":"AJAX 让网页应用感觉更快、更有交互性。"}]},{"partOfSpeech":"n.","definition":{"en":"A brand name used for some cleaning products (such as household cleanser).","zh":"某些清洁用品的品牌名（例如家用清洁剂）。"},"examples":[{"en":"She bought Ajax cleanser to scrub the sink.","zh":"她买了 Ajax 清洁剂来刷洗水槽。"},{"en":"Ajax is a common cleaning brand in some countries.","zh":"在一些国家，Ajax 是常见的清洁品牌。"}]}],"synonyms":["(myth) Ajax the Great","(computing) asynchronous web requests","(computing) partial page update"],"phonetic":"/ˈeɪdʒæks/","extraExplanation":["“Ajax” 在希腊神话里通常指两位英雄：更著名的是 Ajax the Great（大埃阿斯），另一个是 Ajax the Lesser（小埃阿斯）。英语里如果不特别说明，多数情况下默认指“大埃阿斯”。","计算机里的 AJAX 原本强调“异步 + 局部更新”，不一定真的使用 XML；现代开发常用 JSON，但人们仍习惯说 AJAX。"]}
{"word":"ajax","summary":{"en":"Ajax can refer to a Greek myth hero, a web technique (AJAX) for updating pages without reloading, or a name used by clubs/brands.","zh":"Ajax 可指希腊神话英雄、网页异步更新技术（AJAX），也可作俱乐部或品牌名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hero in Greek mythology, famous in the Trojan War for great strength and bravery (often called “Ajax the Great”).","zh":"希腊神话中的英雄，因在特洛伊战争中的力量与勇敢而闻名（常称为“大埃阿斯”）。"},"examples":[{"en":"In Greek myths, Ajax is one of the strongest Greek warriors at Troy.","zh":"在希腊神话中，Ajax 是特洛伊战场上最强壮的希腊战士之一。"},{"en":"The tragedy of Ajax shows how pride and honor can lead to disaster.","zh":"《Ajax》的悲剧展示了傲慢与荣誉如何导致灾难。"}]},{"partOfSpeech":"n.","definition":{"en":"A web-development technique that lets a webpage send and receive data in the background without reloading the whole page (often written as AJAX).","zh":"一种网页开发技术，使网页在不整体刷新页面的情况下在后台发送与接收数据（常写作 AJAX）。"},"examples":[{"en":"This search box uses AJAX to show suggestions as you type.","zh":"这个搜索框使用 AJAX，在你输入时即时显示建议。"},{"en":"With AJAX, the page can update a small section instead of reloading everything.","zh":"借助 AJAX，页面可以只更新一小块内容，而不必全部重新加载。"}]},{"partOfSpeech":"n.","definition":{"en":"A name used for various organizations or products, such as AFC Ajax (a Dutch football club) and Ajax (a cleaning brand in some countries).","zh":"用于多种组织或产品的名称，例如阿贾克斯足球俱乐部（荷兰）以及某些国家的 Ajax 清洁用品品牌。"},"examples":[{"en":"AFC Ajax is well known for developing young football talent.","zh":"阿贾克斯俱乐部以培养年轻足球人才而闻名。"},{"en":"In some places, Ajax is a brand name for household cleaner.","zh":"在一些地区，Ajax 是家用清洁剂的品牌名。"}]}],"synonyms":["Aias (mythology)","AJAX (web)"],"phonetic":"/ˈeɪdʒæks/","extraExplanation":["“Ajax”源自古希腊语名字 Aias（拉丁化为 Ajax）。在文学中，最著名的相关作品之一是古希腊悲剧诗人索福克勒斯的《Ajax》，讲述英雄在荣誉受损后的心理崩溃与结局。","技术领域的 “AJAX” 原本常被解释为 “Asynchronous JavaScript and XML”（异步 JavaScript 与 XML）。如今即使数据常用 JSON 而不是 XML，人们仍习惯把这种“异步更新页面”的做法叫 AJAX。"]}
{"word":"Ajay","summary":{"en":"Ajay is a common male first name, especially in South Asia.","zh":"Ajay 是常见的男性名字，尤其在南亚地区常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name), common in South Asia and used internationally.","zh":"男性名字（名），在南亚很常见，也在国际上使用。"},"examples":[{"en":"Ajay is my classmate; he’s from India.","zh":"Ajay 是我的同学；他来自印度。"},{"en":"Please ask Ajay to call me when he’s free.","zh":"请让 Ajay 有空的时候给我打电话。"}]}],"phonetic":"/əˈdʒeɪ/","extraExplanation":["“Ajay”常见于印度等南亚地区，来源与梵语相关，常被解释为“不可战胜的、未被征服的”。作为人名使用时，一般不翻译含义，只音译或直接写作 Ajay。"]}
{"word":"AJC","summary":{"en":"AJC is an abbreviation most commonly meaning the Atlanta Journal-Constitution (a U.S. newspaper) or the American Jewish Committee (a U.S. advocacy organization).","zh":"AJC 是一个缩写，最常见指《亚特兰大宪政报》（美国报纸）或美国犹太人委员会（美国倡议组织）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) The Atlanta Journal-Constitution, a major daily newspaper in Atlanta, Georgia (U.S.).","zh":"（缩写）《亚特兰大宪政报》（Atlanta Journal-Constitution），美国佐治亚州亚特兰大的一家主要日报。"},"examples":[{"en":"I read about it in the AJC this morning.","zh":"我今天早上在《亚特兰大宪政报》（AJC）上看到这条消息。"},{"en":"The AJC published an investigation into local government spending.","zh":"《亚特兰大宪政报》（AJC）发表了一篇关于地方政府开支的调查报道。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) American Jewish Committee, an organization that advocates for Jewish communities and works on civil rights and public policy (U.S.).","zh":"（缩写）美国犹太人委员会（American Jewish Committee），一个关注犹太社群、并参与公民权利与公共政策倡议的组织（美国）。"},"examples":[{"en":"The AJC released a statement on the issue.","zh":"美国犹太人委员会（AJC）就此事发布了声明。"},{"en":"She attended an AJC event on interfaith dialogue.","zh":"她参加了一场由美国犹太人委员会（AJC）举办的跨宗教对话活动。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Can also refer to other organizations or terms depending on context (for example, a local club, a company name, or a program).","zh":"（缩写）也可能因语境不同指代其他机构或名称（例如本地俱乐部、公司名或项目名）。"},"examples":[{"en":"In this email, “AJC” refers to the project team, not the newspaper.","zh":"在这封邮件里，“AJC”指的是项目组，不是报纸。"}]}],"synonyms":["the Atlanta Journal-Constitution","American Jewish Committee"],"phonetic":"/ˌeɪ dʒeɪ ˈsiː/","extraExplanation":["“AJC”是首字母缩略语，最常见的两种指代是美国亚特兰大的《Atlanta Journal-Constitution》以及“American Jewish Committee”。判断含义时，优先看语境：新闻报道/亚特兰大本地话题多半指报纸；公共政策、反歧视、宗教社群相关内容更可能指该组织。"]}
{"word":"ajee","summary":{"en":"Ajee is a polite South Asian expression used to call someone’s attention or respond “yes?/excuse me?” and sometimes as “sir/ma’am.”","zh":"Ajee 是南亚常用的礼貌表达，可用于招呼对方或回应“怎么了/请问/是吗？”，有时也作“先生/女士”一类称呼。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(South Asian English, Hindi/Urdu influence) A polite call or response meaning “yes?” or used to get someone’s attention, similar to “excuse me?” or “yes, sir/ma’am?”","zh":"（受印地语/乌尔都语影响的南亚英语用法）礼貌的呼唤或回应，意思类似“怎么了？”“请问？”或“是的，先生/女士？”"},"examples":[{"en":"Ajee, could you help me with this form?","zh":"Ajee，你能帮我填这张表吗？"},{"en":"“Ajee?” he answered when his mother called him.","zh":"妈妈叫他时，他回答：“Ajee？”（怎么了？）"}]},{"partOfSpeech":"other","definition":{"en":"A respectful way to address someone, roughly like “sir” or “madam,” especially in older or more traditional speech.","zh":"一种尊称用法，大致相当于“先生/女士”，多见于较传统或较旧式的表达。"},"examples":[{"en":"Ajee, please have a seat.","zh":"先生/女士，请坐。"}]}],"synonyms":["excuse me","yes?","sir","ma’am"],"phonetic":"/əˈdʒiː/","extraExplanation":["“ajee / aji”常见于印度、巴基斯坦等地的日常口语与影视对白中，带有礼貌、缓和语气或引起注意的功能。","它和南亚语言里的敬语“ji（जी）”有关；在翻译成自然英语时，常根据语境译为“excuse me?”“yes?”“sir/ma’am?”等。"]}
{"word":"ajenjo","summary":{"en":"“Ajenjo” is Spanish for “wormwood,” a very bitter herb used in herbal traditions and to flavor absinthe.","zh":"“Ajenjo”是西班牙语，意思是“苦艾草”，一种非常苦的草本植物，用于草药传统，也用于苦艾酒调味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) wormwood: a very bitter herb (Artemisia absinthium), traditionally used in herbal medicine and to flavor the spirit absinthe.","zh":"（西语）苦艾／苦艾草：一种非常苦的草本植物（Artemisia absinthium），传统上用于草药疗法，也用来给苦艾酒（absinthe）调味。"},"examples":[{"en":"In Spanish, “ajenjo” usually refers to wormwood, a famously bitter herb.","zh":"在西语里，“ajenjo”通常指“苦艾草”，以味道极苦而出名。"},{"en":"Some traditional recipes use wormwood (ajenjo) in tiny amounts for flavor.","zh":"一些传统配方会加入极少量的苦艾草（ajenjo）来增添风味。"}]}],"synonyms":["wormwood","Artemisia absinthium","absinthe (plant)"],"phonetic":"/ˈwɝːmˌwʊd/","extraExplanation":["“Ajenjo/苦艾草”在西方文化里常和“苦、艰难”这类意象联系在一起；英文里 wormwood 也常被用作比喻，表示“痛苦的经历/苦果”（例如：a taste of wormwood）。","苦艾酒（absinthe）因历史上被认为会导致幻觉而带有传奇色彩；现代正规蒸馏酒中的“侧柏酮(thujone)”含量受到严格限制，因此与早期传闻有很大差别。"]}
{"word":"ajhar","summary":{"en":"Ajhar is typically used as a name, not a common English word, and may be a variant spelling of Azhar.","zh":"Ajhar 通常作为人名使用，不是常见英语词，可能是 Azhar 的变体拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Ajhar is not a standard English vocabulary word; it is most commonly seen as a personal name (a variant spelling of Azhar in some communities).","zh":"Ajhar 不是标准英语词汇；它最常见的用法是人名，在一些地区/社群中可被视为 Azhar 的变体拼写。"},"examples":[{"en":"Ajhar Khan is speaking at the conference today.","zh":"Ajhar Khan 今天将在会议上发言。"},{"en":"I’m not sure how to pronounce Ajhar—could you say it for me?","zh":"我不确定 Ajhar 怎么读——你能读给我听吗？"}]}],"phonetic":"/ˈɑːzhɑːr/","extraExplanation":["在英语语境里，你更常见到的是 Azhar 这个拼写（源自阿拉伯语，常被解释为“更明亮的/最灿烂的、盛开的”之意），也可能让人联想到埃及的爱资哈尔（Al-Azhar，如爱资哈尔大学）。Ajhar 往往是地区性/个人偏好的拼写差异，并非英语词典里的常规词条。","如果你原本想查的是 ajar（“半开着的”），那是一个常用英语词：The door was ajar.（门半开着。）你可以告诉我你想表达的句子，我可以帮你确认正确拼写。"]}
{"word":"ajimez","summary":{"en":"“ajimez” is not recognized as a standard English word; it likely needs context or is a misspelling/name.","zh":"“ajimez”不是常见英语词；可能需要上下文，或是拼写错误/人名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username, a brand name, or a word from another language.","zh":"不是标准英语单词；可能是拼写错误、用户名、品牌名，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “ajimez” in an English dictionary—can you share the sentence where you saw it?","zh":"我在英语词典里找不到“ajimez”——你能把它出现的句子发我吗？"},{"en":"“Ajimez” might be a name rather than an English vocabulary word.","zh":"“Ajimez”可能是一个名字，而不是英语词汇。"}]}],"phonetic":"ɑːdʒiːmɛz","extraExplanation":["“ajimez”看起来更像拼写或输入法导致的变体。你可以告诉我：1）它出现的上下文句子；2）你想表达的意思（比如“开始/启动”“保护/庇护”“惊讶”等）；3）是否来自游戏、社交媒体、品牌或人名。","如果你是想查相近的英文词，我也可以根据发音或拼写帮你猜测（例如：aj- 开头或 -mez 结尾的词/名字）。"]}
{"word":"Ajit","summary":{"en":"Ajit is a South Asian male given name meaning “unconquered; invincible.”","zh":"Ajit 是南亚常见的男性名字，意为“不可征服的；无敌的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (common in South Asia), from Sanskrit meaning “unconquered; invincible.”","zh":"男性名字（南亚常见），源自梵语，意思是“不可征服的；无敌的”。"},"examples":[{"en":"Ajit is a common name in India and Nepal.","zh":"Ajit 是印度和尼泊尔很常见的名字。"},{"en":"Ajit introduced himself at the start of the meeting.","zh":"Ajit 在会议开始时做了自我介绍。"},{"en":"I received an email from Ajit about the project timeline.","zh":"我收到了 Ajit 发来的关于项目时间表的邮件。"}]}],"synonyms":["Ajeet","Ajith"],"phonetic":"/əˈdʒit/","extraExplanation":["“Ajit”常见音译有 Ajit / Ajeet / Ajith（不同地区与语言拼写不同）。在印度语境中，它多为男性名，也可能出现在姓氏或复合名中。","词源上来自梵语 a-（不）+ jit（被征服/被战胜），整体表达“未被战胜的人”。在部分宗教与文化语境里，这类名字常用于表达勇气与坚韧的祝愿。"]}
{"word":"ajitter","summary":{"en":"Jitter means nervous shakiness (often “the jitters”) or small quick shaking/movement.","zh":"jitter 指紧张导致的发抖/不安（常说 the jitters），也指小而快速的抖动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually plural: jitters) a feeling of nervousness, anxiety, or slight shaking, especially before an important event.","zh":"（常用复数：jitters）紧张、焦虑或轻微发抖的感觉，常发生在重要事情之前。"},"examples":[{"en":"I always get the jitters before a job interview.","zh":"我在面试前总会紧张得发抖。"},{"en":"She had the jitters on the first day of school.","zh":"她在开学第一天很紧张。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make someone feel nervous or uneasy; to cause slight shaking.","zh":"使人紧张不安；引起轻微颤抖。"},"examples":[{"en":"Too much coffee can jitter your hands.","zh":"咖啡喝太多会让你的手发抖。"},{"en":"Loud noises at night jitter me.","zh":"夜里的巨响会让我心里发慌。"}]},{"partOfSpeech":"vi.","definition":{"en":"to move or shake with small, quick movements (often because of nervousness or vibration).","zh":"（因紧张或震动等）快速小幅度地抖动。"},"examples":[{"en":"The camera jitters when the wind is strong.","zh":"风大时相机会抖动。"},{"en":"His knee jittered under the table.","zh":"他的膝盖在桌下抖个不停。"}]}],"synonyms":["nervousness","anxiety","shakiness","tremor","quiver"],"phonetic":"/ˈdʒɪtɚ/","extraExplanation":["“ajitter”通常不是标准写法，更常见的是写成 “a jitter” 或直接用 “the jitters”。例如：I have the jitters.（我很紧张。）","“the jitters”在口语中非常常见，语气比“anxiety”更日常、更轻一些。也常用于演出、考试、约会、面试前的紧张情绪。"]}
{"word":"ajiva","summary":{"en":"Ajiva is a Jain philosophical term meaning “non-living substances,” contrasted with jiva (the living soul).","zh":"Ajiva 是耆那教哲学术语，指“非生命/无魂之物”，与 jiva（有情/灵魂）相对。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Jain philosophy) non-living substances—the things in the universe that do not have a soul or consciousness, such as matter, space, time, motion, and rest.","zh":"（耆那教哲学）非生命/无魂之物：宇宙中没有灵魂或意识的存在，如物质、空间、时间、运动与静止等。"},"examples":[{"en":"In Jainism, reality is often explained through jiva (living soul) and ajiva (non-living substances).","zh":"在耆那教中，实相常用“jiva（有情/灵魂）”与“ajiva（无情/非生命）”来说明。"},{"en":"Karma is treated as a kind of ajiva because it is described as subtle material particles.","zh":"业（karma）常被视为一种 ajiva，因为它被描述为极其微细的物质粒子。"}]}],"synonyms":["the non-living","the inanimate (in this context)"],"phonetic":"əˈdʒiːvə","extraExplanation":["ajiva 源自梵语 a-（否定前缀）+ jīva（生命、灵魂），字面意思是“非 jiva”。在耆那教的体系里，世界分为两大类：jiva（有灵、能觉知）与 ajiva（无灵、不可觉知）。","在常见的耆那教分类中，ajiva 往往包含五类：物质（pudgala）、空间（ākāśa）、运动原理/媒介（dharma）、静止原理/媒介（adharma）、时间（kāla）。不同传统对细分可能略有差异。"]}
{"word":"ajivas","summary":{"en":"Ajivikas: members of an ancient Indian ascetic movement associated with determinism.","zh":"Ajivikas：古代印度苦行宗派阿耆毗迦派的成员，常与宿命/决定论思想相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Ājīvika (Ajivika) movement—an ancient Indian religious/philosophical group known for strict ascetic practices and a strong belief in fate (determinism).","zh":"阿耆毗迦派（Ājīvika / Ajivika）的成员——古代印度的宗教/哲学团体，以严厉的苦行实践与强调“宿命/决定论”的思想著称。"},"examples":[{"en":"Some early Buddhist and Jain texts mention the Ajivikas as rivals in religious debate.","zh":"一些早期佛教与耆那教文献把阿耆毗迦派提到为宗教辩论中的对手。"},{"en":"An Ajivikas ascetic might live with very few possessions to practice self-discipline.","zh":"阿耆毗迦派的苦行者可能几乎不携带财物，以修习自律。"}]}],"synonyms":["Ajivika","Ājīvika","Ajivika sect"],"phonetic":"ɑˈdʒiːvɪkəz","extraExplanation":["“ajivas”更常见的拼写是 **Ajivikas**（复数，指“阿耆毗迦派的人”）或 **Ajivika**（单数/作形容该派）。也常见带长音标注的梵文转写：**Ājīvika**。","阿耆毗迦派在公元前数世纪较为活跃，但其自身经典多已散佚，现代人对其了解主要来自佛教、耆那教等文献的记载与少量碑铭材料。","核心观念常被概括为 **niyati（宿命/决定）**：认为人生遭遇在某种“必然法则”下展开，因此与强调业力选择的观点常形成对比。"]}
{"word":"Ajivika","summary":{"en":"Ajivika refers to an ancient Indian ascetic sect—and to a member of that sect—often associated with strict determinism (fate).","zh":"Ajivika 指古印度的一个苦行宗派及其成员，常与强调宿命/决定论的思想相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Ājīvika (Ajivika) sect, an ancient Indian movement of wandering ascetics known especially for teaching strict fate/determinism","zh":"阿耆毗迦派（Ajivika/Ājīvika）的成员；古印度的游方苦行宗派，以强调严格的宿命论/决定论而闻名"},"examples":[{"en":"Some early Buddhist texts mention the Ajivikas as a rival group of ascetics.","zh":"一些早期佛教文献把阿耆毗迦派提到为一支竞争性的苦行团体。"},{"en":"The Ajivikas were often described as believing that everything is fixed by fate.","zh":"阿耆毗迦派常被描述为相信万事皆由命运预定。"}]},{"partOfSpeech":"n.","definition":{"en":"the Ajivika sect or its teachings as a historical religious/philosophical tradition","zh":"阿耆毗迦派；或指其学说（作为一种历史上的宗教/哲学传统）"},"examples":[{"en":"Ajivika is studied today mainly through references in Buddhist and Jain writings.","zh":"今天对阿耆毗迦派的研究主要依靠佛教和耆那教文献中的引用与记载。"},{"en":"Researchers debate how Ajivika ideas influenced other Indian traditions.","zh":"研究者讨论阿耆毗迦派思想如何影响其他印度传统。"}]}],"synonyms":["Ājīvika","ancient Indian ascetic sect","determinist ascetics (contextual)"],"phonetic":"/ˌɑːdʒɪˈviːkə/","extraExplanation":["“Ajivika”常见于英文历史与宗教研究写作，也写作“Ājīvika”。它并非现代常用词，更多是学术语境中的专名。","阿耆毗迦派大约活跃于公元前一千纪的印度，与早期佛教、耆那教同时期；因为原典保存很少，后世主要从他教文献的记载来重建其观点。","学习时可把它理解为“一个古印度苦行宗派的名称”，用法类似：a Buddhist（佛教徒）、a Jain（耆那教徒）→ an Ajivika（阿耆毗迦派成员）。"]}
{"word":"ajivika","summary":{"en":"Ajivika: a follower of an ancient Indian ascetic movement often associated with determinism.","zh":"Ajivika：古代印度苦行教团阿耆毗迦派的成员，常与宿命论/决定论相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Ājīvika (Ajivika) movement—an ancient Indian ascetic group known for strict self-discipline and a belief in fate/determinism.","zh":"阿耆毗迦（Ājīvika/Ajivika）教团的成员——古代印度的苦行团体，以严格自律著称，并常与“宿命论/决定论”的思想相关。"},"examples":[{"en":"Some early Buddhist and Jain texts mention Ajivikas as rival ascetics.","zh":"一些早期的佛教与耆那教文献会提到阿耆毗迦派，作为竞争的苦行团体。"},{"en":"An Ajivika might travel, beg for food, and live a highly austere life.","zh":"一位阿耆毗迦派苦行者可能四处游行、托钵乞食，并过着极其清苦的生活。"}]}],"synonyms":["Ājīvika (alternate spelling)"],"phonetic":"/ˌɑːdʒɪˈviːkə/","extraExplanation":["“Ajivika/Ājīvika”常见于英文历史、宗教学与印度古代思想研究中；它主要通过佛教与耆那教的记载以及少量铭文被后世了解，因为该派自身的经典多已失传。","读音与拼写：英文中可见 Ajivika、Ājīvika 等写法；带长音符号（ā, ī）的是学术转写，用来提示原语言中的长元音。","文化语境：在古印度，“苦行者/出家修行者”并不只限于佛教或耆那教，阿耆毗迦派也是当时重要的修行传统之一。"]}
{"word":"Ajmer","summary":{"en":"Ajmer is a city in Rajasthan, India, well known for the Ajmer Sharif Dargah and its historical importance.","zh":"Ajmer 是印度拉贾斯坦邦的一座城市，以阿杰梅尔圣陵和历史地位而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in the state of Rajasthan in northwestern India, known for the Ajmer Sharif Dargah (a major Sufi shrine) and as a gateway to nearby Pushkar.","zh":"印度西北部拉贾斯坦邦的一座城市，以阿杰梅尔圣陵（Ajmer Sharif Dargah，重要的苏菲圣地）闻名，也常被视为前往邻近普什卡尔（Pushkar）的门户。"},"examples":[{"en":"We stopped in Ajmer on our way to Pushkar.","zh":"我们在去普什卡尔的路上在阿杰梅尔停留。"},{"en":"Ajmer is famous for the Ajmer Sharif Dargah, which many pilgrims visit every year.","zh":"阿杰梅尔以阿杰梅尔圣陵闻名，每年都有许多朝圣者前来。"},{"en":"Ajmer has long been an important city in the history of Rajasthan.","zh":"阿杰梅尔在拉贾斯坦的历史中长期占有重要地位。"}]}],"synonyms":["(no direct synonyms; it is a proper place name)"],"phonetic":"ˈɑːdʒmɛr","extraExplanation":["“Ajmer”常见于旅行与历史语境。它与“Pushkar（普什卡尔）”常被一起提到：Ajmer更偏城市与朝圣中心，Pushkar以圣湖与骆驼集市等闻名。","拼写注意：英文中常写作 Ajmer；相关地名还有 Ajmer Sharif（阿杰梅尔圣陵）和 Ajmer District（阿杰梅尔县/地区）。"]}
{"word":"Ajo","summary":{"en":"Ajo means “garlic,” commonly seen in Spanish or Spanish-style cooking contexts.","zh":"Ajo 意为“大蒜”，多见于西班牙语或西式/拉美料理语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"garlic (the plant or the clove), especially as referred to in Spanish or in Spanish-language cooking.","zh":"大蒜；蒜头（西班牙语用法，常见于西班牙语或西语料理语境）"},"examples":[{"en":"This recipe calls for two cloves of ajo.","zh":"这道菜需要两瓣大蒜（ajo）。"},{"en":"Add the ajo and sauté until fragrant.","zh":"加入大蒜炒到出香味。"}]}],"synonyms":["garlic"],"phonetic":"/ˈɑːhoʊ/","extraExplanation":["“ajo”是西班牙语里的“蒜”。在英文食谱或餐厅里，有时会直接借用这个词，尤其在墨西哥、拉美或西班牙菜的语境中。","西班牙语的字母“j”常发类似喉音/ x /（英文里没有完全对应的音），所以英语里常被读得更像/h/，听起来接近“AH-ho”。"]}
{"word":"Ajodhya","summary":{"en":"Ajodhya is a spelling variant of Ayodhya, a historic city in Uttar Pradesh, India, famous in Hindu tradition as Rama’s birthplace.","zh":"Ajodhya 是 Ayodhya 的拼写变体，指印度北方邦的历史名城，在印度教传统中以罗摩的诞生地闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ayodhya (also spelled Ajodhya): a historic city in the Indian state of Uttar Pradesh, widely known in Hindu tradition as the birthplace of Rama.","zh":"阿约提亚（也拼作 Ajodhya）：印度北方邦的一座历史名城，在印度教传统中常被视为罗摩（Rama）的诞生地。"},"examples":[{"en":"Ayodhya (Ajodhya) is an important pilgrimage site for many Hindus.","zh":"阿约提亚（Ajodhya）对许多印度教徒来说是重要的朝圣地。"},{"en":"The book mentions Ajodhya as a city on the Sarayu River.","zh":"书中提到 Ajodhya 位于萨拉尤河（Sarayu River）畔。"}]}],"synonyms":["Ayodhya","Oudh (historical/related region name)"],"phonetic":"/əˈjoʊd(j)ə/","extraExplanation":["“Ajodhya”是“Ayodhya”的一种较少见的英语拼写变体，常见于较早的转写或不同地区的拼写习惯；现代新闻与学术写作里更常用“Ayodhya”。","Ayodhya在印度史与宗教文化中很有分量，尤其与史诗《罗摩衍那》（Ramayana）相关：传统上认为英雄罗摩出生于此，因此常出现在文学、神话与朝圣语境中。"]}
{"word":"ajog","summary":{"en":"Ajog means slightly out of line or not straight; it can describe something that is a bit crooked or misaligned.","zh":"Ajog 表示“稍微歪斜/不对齐”，可形容东西有点歪或没摆正。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of something long or straight) slightly out of line; not properly aligned; askew.","zh":"（常指细长或直的东西）稍微歪斜的；不对齐的；歪着的。"},"examples":[{"en":"His tie was ajog after the rush to catch the bus.","zh":"他赶着去追公交后，领带有点歪了。"},{"en":"The picture frame hung ajog on the wall.","zh":"相框在墙上挂得有点歪。"},{"en":"The bookshelf looked ajog, so we adjusted it to make it level.","zh":"书架看起来有点歪，所以我们把它调整到水平。"}]},{"partOfSpeech":"adv.","definition":{"en":"in a slightly crooked or uneven way; out of alignment.","zh":"以略微歪斜、不齐的方式；歪着。"},"examples":[{"en":"The door sat ajog in its frame.","zh":"门在门框里有点歪。"},{"en":"She placed the label ajog, then peeled it off and tried again.","zh":"她把标签贴歪了，又撕下来重新贴。"}]}],"synonyms":["askew","crooked","off-center","misaligned","out of line"],"phonetic":"/əˈdʒɔɡ/","extraExplanation":["“ajog”在现代英语里比较少见，更多时候人们会说“askew / crooked / not straight”。但在文学或较正式的描写中，仍可能看到“ajog”用来表达“稍微歪一点、没对齐”。","注意别和短语“a jog”（慢跑一下）混淆：例如“I went for a jog.”（我去慢跑了。）两者拼写相同但分词不同：a jog 是“a + 名词”，ajog 是一个形容词/副词。"]}
{"word":"ajoint","summary":{"en":"Adjoint means ‘attached/connected’; it can also mean an assistant (title), and in math it refers to a related ‘partner’ form such as an adjoint matrix.","zh":"adjoint 表示“附接的/连接的”；也可指“助理/副职”（称谓中），在数学里还指如“伴随矩阵”等与之对应的相关形式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected or joined to something; attached (often used formally or in technical contexts).","zh":"连接在一起的；附接的（常用于正式或技术语境）。"},"examples":[{"en":"The report includes an adjoint appendix with extra data.","zh":"报告附有一个附接的附录，包含额外数据。"},{"en":"The museum has an adjoint building used for workshops.","zh":"博物馆有一栋附属建筑用于工作坊。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who helps or is appointed to assist someone in authority; an assistant or deputy (often in titles).","zh":"（职位称谓中）助理；副手；副职人员。"},"examples":[{"en":"She served as the adjoint to the director during the transition.","zh":"在交接期间，她担任主任的助理。"},{"en":"He met with the adjoint for public affairs.","zh":"他与公共事务副职会面。"}]},{"partOfSpeech":"n.","definition":{"en":"in mathematics and engineering: the related or ‘partner’ form of something (such as an operator or matrix), defined by a specific rule.","zh":"（数/工）伴随的；共轭的（如算子或矩阵的伴随形式，由特定规则定义）。"},"examples":[{"en":"In linear algebra, we often compute the adjoint of a matrix.","zh":"在线性代数中，我们常计算矩阵的伴随。"},{"en":"The control model uses an adjoint equation to optimize the system.","zh":"该控制模型使用伴随方程来优化系统。"}]}],"synonyms":["attached","connected","associated","auxiliary","deputy"],"phonetic":"/əˈdʒɔɪnt/","extraExplanation":["你输入的“ajoint”很可能是拼写错误：常见的是 **adjoint**（一个正式/技术词）。如果你本来想写的是 **a joint**（两个词），意思通常是“一个关节/接缝”，也可以指“（纸卷的）大麻烟”或“（非正式）小店/酒吧”。如果你告诉我你的句子语境，我可以帮你确认是哪一个。","词源提示：**adjoint** 来自拉丁语 *ad-*（向、到）+ *jungere*（连接），所以核心概念就是“连接在一起/附接”。"]}
{"word":"ajonjoli","summary":{"en":"Ajonjolí means sesame (sesame seeds), especially in Latin American Spanish contexts.","zh":"Ajonjolí 指“芝麻/芝麻籽”，常见于拉美西班牙语语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(mainly in Latin American & Caribbean Spanish) sesame; a sesame seed used as food or seasoning.","zh":"（主要见于拉美与加勒比地区的西班牙语）芝麻；芝麻籽（用作食材或调味）。"},"examples":[{"en":"This bread is topped with ajonjolí (sesame seeds).","zh":"这款面包上撒了ajonjolí（芝麻）。"},{"en":"In some countries, people say ajonjolí instead of sésamo.","zh":"在一些国家，人们会说ajonjolí，而不是sésamo（芝麻）。"}]}],"synonyms":["sesame","sesame seed","sésamo"],"phonetic":"/ɑˌhoʊnhoʊˈli/","extraExplanation":["“ajonjolí”是西班牙语词，在英语语境中多出现在双语菜单、食谱或文化介绍里，意思相当于“sesame / sesame seed（芝麻/芝麻籽）”。","在拉美与加勒比地区很常见，例如用于面包表面撒料、糖果（芝麻糖）、酱料与炖菜等。英语里如果不想用外来词，通常直接说“sesame seeds”。"]}
{"word":"ajoure","summary":{"en":"“ajoure” is not standard English; it’s most likely a misspelling of “adjourn,” meaning to end a meeting temporarily or postpone it to a later time.","zh":"“ajoure”不是标准英语拼写；更可能是“adjourn”的误拼，意思是暂时休会或把会议/事项延期到以后。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Likely intended word) to end a meeting or official session for a period of time; to postpone until later.","zh":"（很可能是想写的单词）暂时休会；把会议/审理等延期到以后。"},"examples":[{"en":"The judge adjourned the court until Monday.","zh":"法官宣布法庭休庭，延期到周一再开庭。"},{"en":"Let’s adjourn for lunch and continue at 2 p.m.","zh":"我们先休会去吃午饭，下午两点再继续。"}]},{"partOfSpeech":"v.","definition":{"en":"(Formal) to move to another place after finishing an event, often for food or a more casual conversation.","zh":"（正式用法）活动结束后转移到别处（常去吃饭或更轻松地聊天）。"},"examples":[{"en":"After the ceremony, the guests adjourned to the garden for tea.","zh":"仪式结束后，客人们移步到花园喝茶。"}]}],"synonyms":["postpone","suspend","recess","delay","defer"],"phonetic":"/əˈdʒɝn/","extraExplanation":["“ajoure”不是常见英语单词，更常见的正确拼写可能是 **adjourn**（休会/延期）。如果你原本想写的是法语 **ajouré**（意为“镂空的、透空花纹的”），请告诉我使用场景，我可以再按那个意思解释。"]}
{"word":"ajourise","summary":{"en":"“Ajourise” is not standard English; you probably mean “adjourn,” meaning to pause/end a meeting and continue later (or, formally, move to another place).","zh":"“ajourise”不是标准英语；你很可能想写的是“adjourn”，意思是休会/延期（正式用法也可指转移到别处）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Likely intended word) to stop a meeting or activity for a period of time and continue it later; to postpone.","zh":"（很可能是你想写的词）暂时停止会议或活动，稍后再继续；休会；延期。"},"examples":[{"en":"The judge adjourned the court until Monday.","zh":"法官宣布法庭休庭至周一。"},{"en":"Let’s adjourn for lunch and come back at 2 p.m.","zh":"我们先休会去吃午饭，下午两点再回来继续。"}]},{"partOfSpeech":"v.","definition":{"en":"(Less common, formal) to move to another place after finishing something, especially a meeting or meal.","zh":"（较少见，正式）结束某事（尤指会议或用餐）后转移到另一个地方。"},"examples":[{"en":"After the meeting, we adjourned to the lounge for coffee.","zh":"会议结束后，我们转到休息室喝咖啡。"}]}],"synonyms":["postpone","delay","suspend","recess","put off"],"phonetic":"/əˈdʒɝːn/","extraExplanation":["“ajourise”不是常见英语单词，最接近、最常用的可能是 **adjourn**（休会/延期）。拼写上常见错误包括 *ajourn*, *adjoun*, *adjournise* 等。","**adjourn** 常用于法律、议会、正式会议语境：*The meeting is adjourned.* 表示“会议到此结束（可改日再开）”。如果是把时间改到未来某个日期，更常见也可用 **postpone**（推迟）。"]}
{"word":"ajowan","summary":{"en":"Ajowan is a strong, thyme-like spice seed used in South Asian cooking (also called ajwain or carom seeds).","zh":"Ajowan 是一种味道浓烈、带百里香气息的香料籽，常用于南亚料理（也叫 ajwain 或 carom seeds）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A spice made from the small, ridged seeds of an herb (also called ajwain or carom), used especially in South Asian and Middle Eastern cooking; it has a strong, thyme-like flavor.","zh":"一种香料，由草本植物的细小带棱种子制成（也叫 ajwain/“阿魏籽、藏茴香”、carom seeds），常用于南亚和中东料理；气味浓烈，带有类似百里香的风味。"},"examples":[{"en":"Add a pinch of ajowan to the dough to give flatbread a warm, aromatic taste.","zh":"在面团里加一小撮 ajowan，可以让薄饼带出温暖的香气。"},{"en":"Ajowan is often used with lentils and potatoes because its flavor is bold.","zh":"ajowan 常和扁豆、土豆一起用，因为它的味道很浓。"},{"en":"The recipe calls for ajowan seeds, but you may also see it labeled as ajwain.","zh":"这道菜谱写的是 ajowan seeds，但你也可能看到它标成 ajwain。"}]}],"synonyms":["ajwain","carom seeds"],"phonetic":"/ˈædʒəwɑːn/","extraExplanation":["ajowan 常见于印度、巴基斯坦等南亚地区的家常菜与面点（如 paratha、pakora 等），也会用于豆类菜肴以增加香气。","英文里它的拼写有多种：ajowan、ajwain；在香料罐上也常写 carom seeds。购买时认这些名称更容易找到。"]}
{"word":"ajowans","summary":{"en":"Ajowan (often spelled ajwain) is a strong, thyme-like spice used in South Asian cooking; “ajowans” is its plural form.","zh":"Ajowan（更常拼作 ajwain）是一种带百里香风味的辛香料，常见于南亚料理；“ajowans”是其复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a spice made from the small, seed-like fruits of the ajowan plant, used especially in South Asian and Middle Eastern cooking; it has a strong thyme-like flavor","zh":"（香料）阿魏/阿耶万籽（常写作 ajwain），一种类似百里香味的强烈香料，常用于南亚和中东料理"},"examples":[{"en":"The recipe calls for a pinch of ajowan to flavor the lentils.","zh":"这道食谱要加一小撮 ajowan 来给扁豆增香。"},{"en":"Ajowan is often toasted briefly to bring out its aroma.","zh":"ajowan 常会先稍微干炒一下，以激发香气。"}]},{"partOfSpeech":"n.","definition":{"en":"the herb (plant) that produces ajowan, in the parsley family","zh":"（植物）产 ajowan 籽的草本植物，属于伞形科（芹菜科）"},"examples":[{"en":"Ajowan grows well in dry, warm climates.","zh":"ajowan 适合在干燥温暖的气候中生长。"}]}],"synonyms":["ajwain","carom seed","bishop's weed"],"phonetic":"/ˈædʒəwɑn/","extraExplanation":["“ajowans”通常是“ajowan”的复数，但在英语里更常见的拼写是“ajwain”。如果你在菜谱或香料罐上看到 ajwain / ajowan，它们多半指同一种香料。","在印度家常菜里，ajwain 常用于面饼（如 paratha）、豆类、腌菜等；味道辛香偏“百里香+胡椒”的感觉，用量通常不大。"]}
{"word":"Ajuga","summary":{"en":"Ajuga is a low, spreading flowering plant often grown as garden ground cover.","zh":"Ajuga 指一种贴地蔓生、常用作园艺地被的开花植物（筋骨草属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a low-growing flowering plant (genus Ajuga), often used as a ground cover in gardens; also called bugleweed or carpet bugle.","zh":"筋骨草属植物（Ajuga），一种贴地生长、会开花的植物，常用于园艺作地被；也常称为“bugleweed（筋骨草/地被筋骨草）”或“carpet bugle（地毯筋骨草）”。"},"examples":[{"en":"We planted ajuga under the trees as a ground cover.","zh":"我们在树下种了筋骨草（ajuga）当作地被植物。"},{"en":"Ajuga spreads quickly, so it can fill empty spots in a garden bed.","zh":"筋骨草（ajuga）蔓延很快，所以能把花坛里的空地很快铺满。"}]}],"synonyms":["bugleweed","carpet bugle","Ajuga reptans"],"phonetic":"əˈdʒuːɡə","extraExplanation":["“Ajuga”是植物学上的属名，来自拉丁语传统命名方式；在园艺语境中，英语里常直接用属名ajuga来称呼常见种（尤其是Ajuga reptans）。","园艺提示：ajuga通常耐阴、适合作地被，但在潮湿环境可能出现病害或蔓延过快；购买时也常见不同叶色的栽培品种（如紫叶、斑叶）。"]}
{"word":"ajuga","summary":{"en":"Ajuga is a low-growing flowering plant often used as groundcover, also known as bugleweed.","zh":"Ajuga 指筋骨草属的低矮开花植物，常作地被植物，也常被叫作 bugleweed。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a low-growing flowering plant (genus Ajuga), often used as groundcover; also called bugleweed.","zh":"筋骨草属植物（Ajuga），常用作地被植物；也称“bugleweed（筋骨草/假荨麻类的俗名）”。"},"examples":[{"en":"We planted ajuga under the trees because it spreads well and tolerates shade.","zh":"我们在树下种了筋骨草（ajuga），因为它蔓延性强，也耐阴。"},{"en":"The ajuga’s purple flower spikes attracted bees in spring.","zh":"筋骨草的紫色花穗在春天吸引了蜜蜂。"}]}],"synonyms":["bugleweed","carpet bugle"],"phonetic":"/əˈdʒuːɡə/","extraExplanation":["“Ajuga”是拉丁化的植物属名，园艺中最常见的种之一是“Ajuga reptans（匍匐筋骨草）”，常被用作地被（groundcover）来压草、覆盖裸土。","英语里“bugleweed”有时也用来指其他不同属的植物（例如Lycopus），所以在购买或查资料时，用学名“Ajuga”通常更准确。"]}
{"word":"ajugas","summary":{"en":"Ajugas are low-growing flowering plants often used as garden groundcover.","zh":"Ajugas 指一种常用作园艺地被的低矮开花植物（筋骨草属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a kind of low-growing flowering plant (genus *Ajuga*), often used as groundcover in gardens; also called bugleweed or carpet bugle","zh":"一种低矮开花植物（筋骨草属 *Ajuga*），常用于园艺作地被植物；也叫“bugleweed / carpet bugle”（筋骨草/匍匐筋骨草等）"},"examples":[{"en":"Ajugas spread quickly and can cover bare soil under trees.","zh":"Ajugas 蔓延很快，可以覆盖树下的裸土。"},{"en":"She planted ajugas along the shady walkway for purple spring flowers.","zh":"她在阴凉的小路旁种了 ajugas，春天会开紫色的花。"}]}],"synonyms":["ajuga","bugleweed","carpet bugle"],"phonetic":"/əˈdʒuːɡə/","extraExplanation":["“Ajuga”来自拉丁化的植物学命名，日常英语里通常读作 /əˈdʒuːɡə/；“ajugas”是复数形式。","园艺语境中，ajuga 常指“匍匐筋骨草”（*Ajuga reptans*），优点是耐阴、易铺开；但在某些地区也可能长得过快，需要适度控制。","如果你在药草或传统用法里看到“筋骨草”，不同地区可能指不同植物；英语里“ajuga/bugleweed”通常特指筋骨草属（*Ajuga*）植物。"]}
{"word":"ajustement","summary":{"en":"“Ajustement” is usually the French form; in English you likely want “adjustment,” meaning a small change, an adaptation to a new situation, or a numerical/accounting correction.","zh":"“ajustement”通常是法语形式；英语里你多半想写“adjustment”，表示微调、对新情况的适应，或（数字/账目）调整。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common English spelling: “adjustment”) A small change made to improve how something works, fits, or looks.","zh":"（常见英文拼写：adjustment）为让某物运作更好、更合适或更好看而做的微调。"},"examples":[{"en":"I made a small adjustment to the chair so it felt more comfortable.","zh":"我把椅子稍微调了一下，让它更舒服。"},{"en":"After a few adjustments, the picture frame was straight.","zh":"调整了几下之后，相框摆正了。"}]},{"partOfSpeech":"n.","definition":{"en":"A change in behavior or lifestyle when you get used to a new situation.","zh":"对新情况的适应与调整（行为或生活方式的改变）。"},"examples":[{"en":"Moving to a new country takes time and adjustment.","zh":"搬到一个新国家需要时间去适应和调整。"},{"en":"The first week at the new job was a big adjustment for her.","zh":"新工作的第一周对她来说是一次很大的适应期。"}]},{"partOfSpeech":"n.","definition":{"en":"A correction or change to numbers, costs, or accounts (often in business).","zh":"（常用于商业）对数字、费用或账目的调整/更正。"},"examples":[{"en":"There was an adjustment to the final bill.","zh":"最终账单做了调整。"},{"en":"Please check if any price adjustment is needed.","zh":"请确认是否需要进行价格调整。"}]},{"partOfSpeech":"other","definition":{"en":"“Ajustement” is also a French word meaning “adjustment,” but it is not standard English spelling.","zh":"“ajustement”也是法语词，意思是“调整/适应”，但它不是标准英文拼写。"},"examples":[{"en":"In French, “ajustement” means “adjustment.”","zh":"在法语里，“ajustement”表示“调整”。"}]}],"synonyms":["change","modification","tweak","correction","adaptation"],"phonetic":"əˈdʒʌstmənt","extraExplanation":["你输入的“ajustement”多半是法语拼写，或是把英文“adjustment”拼错了。英文里最常用的是 adjustment（名词）；动词是 adjust（调整/适应）。","如果你是在写英语论文/邮件，建议用 adjustment；只有在法语语境（法文句子、法语资料引用）才保留 ajustement。"]}
{"word":"ajuster","summary":{"en":"An adjuster is usually an insurance claims examiner, or more generally a person or device that makes adjustments.","zh":"adjuster 通常指保险理赔/定损人员，也可泛指进行调整的人或用于调节的装置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person whose job is to examine a problem or claim and decide what should be done, especially in insurance (a claims adjuster).","zh":"（尤指保险）理赔员；查勘定损员（负责调查并决定赔付或处理方式的人）。"},"examples":[{"en":"The insurance adjuster inspected the car and estimated the repair cost.","zh":"理赔员检查了汽车，并估算了维修费用。"},{"en":"After the storm, an adjuster visited our home to assess the damage.","zh":"暴风雨过后，定损员到我们家评估损失。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who changes or fine-tunes something so it works better; someone who makes adjustments.","zh":"调整者；调节者（负责把事物调到更合适状态的人）。"},"examples":[{"en":"He’s a quick adjuster who can fix the machine in minutes.","zh":"他很会调试，几分钟就能把机器修好。"},{"en":"Good managers are great adjusters when plans suddenly change.","zh":"好的管理者在计划突然变化时很会应变和调整。"}]},{"partOfSpeech":"n.","definition":{"en":"a small part or device used to change a setting (for example, on a tool, machine, or piece of clothing).","zh":"调节器；调节部件（用于改变设置的小装置/零件）。"},"examples":[{"en":"Turn the adjuster to tighten the strap.","zh":"转动调节扣把带子收紧。"},{"en":"The seat adjuster is stuck, so the chair won’t move forward.","zh":"座椅调节器卡住了，所以椅子无法前移。"}]}],"synonyms":["claims adjuster","insurance adjuster","assessor","examiner","tuner","regulator"],"phonetic":"əˈdʒʌstər","extraExplanation":["“ajuster”本身是法语动词，意思是“调整、校准”。英语里最常见的对应词是 **adjust**（动词）和 **adjuster**（名词）。如果你想查的是英语 *adjust* 或 *adjustment*，也可以告诉我具体语境。","词源上，英语 *adjust* 来自法语，核心含义是“使更合适/更对齐（to make fit or right）”。在北美语境里，*adjuster* 很常见于保险行业（claims adjuster）。"]}
{"word":"ajutment","summary":{"en":"An abutment is a supporting structure at the end of a bridge or arch (and in dentistry, a support tooth/implant).","zh":"abutment 指桥或拱端部的支撑结构（桥台/支座）；在牙科中也指支撑牙桥的基牙/种植体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Architecture/engineering) A solid support at the end of a bridge, arch, or dam that holds the structure in place and resists sideways pressure.","zh":"（建筑/工程）桥、拱或坝端部的坚固支座/桥台，用来支撑结构并抵抗侧向推力。"},"examples":[{"en":"The bridge’s abutments were reinforced after the flood.","zh":"洪水过后，桥的桥台（支座）被加固了。"},{"en":"Cracks appeared near the abutment where the arch pushes outward.","zh":"拱向外推的地方，靠近桥台的位置出现了裂缝。"}]},{"partOfSpeech":"n.","definition":{"en":"(Dentistry) A tooth or implant that supports a dental bridge or similar restoration.","zh":"（牙科）用来支撑牙桥等修复体的基牙或种植体。"},"examples":[{"en":"The dentist checked the abutment before placing the crown.","zh":"牙医在安装牙冠前检查了基台/基牙。"},{"en":"An implant abutment connects the implant to the visible tooth.","zh":"种植体基台把种植体与可见的牙齿部分连接起来。"}]}],"synonyms":["support","bridge support","pier (related)","foundation (related)","buttress (related)"],"phonetic":"/əˈbʌtmənt/","extraExplanation":["你输入的 **ajutment** 通常是拼写错误；正确拼写更常见的是 **abutment**（桥台/支座）。","词源提示：**abutment** 来自 *abut*（紧靠、顶住），因此它强调“结构端部顶住并承担推力的支撑”。"]}
