{"word":"AL","summary":{"en":"“Al / AL” most commonly means a male name (short for longer names), the chemical symbol for aluminum, or the abbreviation for Alabama.","zh":"“Al / AL”常见意思包括：男性名字简称、铝的化学符号，以及美国阿拉巴马州的缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name, often a short form of Albert, Alfred, Alan, etc.","zh":"男性名字；常用作 Albert、Alfred、Alan 等名字的简称"},"examples":[{"en":"Al is coming to dinner tonight.","zh":"Al 今晚来吃晚饭。"},{"en":"Her uncle Al works at the hospital.","zh":"她的叔叔 Al 在医院工作。"}]},{"partOfSpeech":"n.","definition":{"en":"the chemical symbol for aluminum.","zh":"（化学）铝的元素符号"},"examples":[{"en":"Cans are often made from Al (aluminum).","zh":"易拉罐常常由 Al（铝）制成。"},{"en":"Al is a lightweight metal.","zh":"铝是一种轻金属。"}]},{"partOfSpeech":"n.","definition":{"en":"abbreviation for the U.S. state of Alabama.","zh":"（美国）阿拉巴马州的缩写"},"examples":[{"en":"She lives in Birmingham, AL.","zh":"她住在阿拉巴马州的伯明翰。"},{"en":"Mail it to Mobile, AL 36602.","zh":"把它寄到阿拉巴马州莫比尔市，邮编 36602。"}]}],"synonyms":["Alabama (AL)","aluminum (Al)"],"phonetic":"æl","extraExplanation":["“Al / AL”常见于三种场景：人名（Al）、化学符号（Al）、美国州缩写（AL）。州缩写通常全大写（AL），人名首字母大写（Al），化学符号固定写作 Al（首字母大写、第二个小写）。"]}
{"word":"Al","summary":{"en":"“Al” most commonly means a male nickname, and it can also mean the chemical symbol for aluminum or an abbreviation for Alabama (AL).","zh":"“Al”最常见是男性昵称；也可表示化学符号“铝”（Al）或阿拉巴马州缩写（AL）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name, often a short form of names like Albert, Alfred, Alan, or Allen.","zh":"男性名字，常作 Albert、Alfred、Alan、Allen 等名字的简称。"},"examples":[{"en":"Everyone calls Albert “Al” at work.","zh":"在工作中，大家都叫 Albert“Al”。"},{"en":"Al said he would pick us up after class.","zh":"Al 说他会在下课后来接我们。"}]},{"partOfSpeech":"n.","definition":{"en":"the chemical symbol for aluminum (a light, silvery metal).","zh":"化学元素“铝”的符号。"},"examples":[{"en":"The soda can is made of Al (aluminum).","zh":"这个汽水罐是用 Al（铝）做的。"},{"en":"In chemistry class, we learned that Al is a metal.","zh":"在化学课上，我们学到 Al 是一种金属。"}]},{"partOfSpeech":"other","definition":{"en":"a common abbreviation for the U.S. state of Alabama (postal abbreviation: AL).","zh":"美国阿拉巴马州的常见缩写（邮政缩写：AL）。"},"examples":[{"en":"She moved from GA to AL last year.","zh":"她去年从乔治亚州（GA）搬到了阿拉巴马州（AL）。"},{"en":"The address ends with “Birmingham, AL.”","zh":"地址以“Birmingham, AL”结尾。"}]}],"synonyms":["(name) Albert (full form)","(chemistry) aluminum","(place) Alabama (AL)"],"phonetic":"/æl/","extraExplanation":["“Al”最常见的是人名昵称（读作 /æl/）。","表示州名时，正式邮政写法通常全大写“AL”；写成“Al”可能让人以为是人名。","化学里元素符号写作“Al”（A 大写、l 小写），不要写成全大写“AL”。"]}
{"word":"al","summary":{"en":"“Al” is most commonly a male name or a short form of longer names; “AL” is also the abbreviation for Alabama, and “al-” is an Arabic prefix meaning “the.”","zh":"“Al”最常见是男性名字或长名字的简称；“AL”也可指阿拉巴马州缩写；“al-”还可作阿拉伯语前缀，意为“the（这/该）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (short for Albert, Alfred, Alan, etc.)","zh":"男性名字（常作 Albert、Alfred、Alan 等的简称）"},"examples":[{"en":"Al is short for Albert.","zh":"Al 是 Albert 的简称。"},{"en":"I met Al at the library after class.","zh":"下课后我在图书馆遇到了 Al。"}]},{"partOfSpeech":"other","definition":{"en":"Alabama (U.S. state abbreviation: AL)","zh":"美国阿拉巴马州（州缩写：AL）"},"examples":[{"en":"She moved to AL for work.","zh":"她为了工作搬去了阿拉巴马州（AL）。"},{"en":"AL is in the southeastern United States.","zh":"AL 在美国东南部。"}]},{"partOfSpeech":"other","definition":{"en":"(in Arabic words) “al-”, meaning “the,” used in many names and loanwords","zh":"（用于阿拉伯语词中）“al-”，意为“the（这/该）”，常见于人名与外来词"},"examples":[{"en":"Al Jazeera is a news network.","zh":"半岛电视台（Al Jazeera）是一家新闻媒体。"},{"en":"“al-” in “algebra” comes from Arabic.","zh":"“algebra（代数）”里的“al-”源自阿拉伯语。"}]}],"synonyms":["Albert (as a full name)","AL (state abbreviation)","al- (Arabic prefix)"],"phonetic":"/æl/","extraExplanation":["“Al-” 作为阿拉伯语定冠词（相当于英语 the）时，出现在很多音译人名或地名里。英语中有时写作“al-”，有时合写为“al”，也可能因转写体系不同而出现大小写差异（如 Al、al-）。"]}
{"word":"al fresco","summary":{"en":"outdoors, especially for dining or events","zh":"在户外（尤指露天用餐或活动）"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"outdoors; in the open air (often used about eating, dining, or events)","zh":"在户外；在露天（常用于指露天用餐或活动）"},"examples":[{"en":"We had an al fresco dinner on the patio.","zh":"我们在露台上吃了一顿露天晚餐。"},{"en":"The café offers al fresco seating in summer.","zh":"这家咖啡馆夏天提供户外座位。"},{"en":"They hosted an al fresco concert in the park.","zh":"他们在公园举办了一场露天音乐会。"}]}],"synonyms":["outdoors","outside","open-air","in the open air","out of doors"],"phonetic":"/æl ˈfrɛskoʊ/","extraExplanation":["常见搭配：al fresco dining（露天用餐）、al fresco seating（户外座位）、eat al fresco（在户外吃）。","使用提醒：在英语里几乎总是正面、悠闲的语境（度假、好天气、咖啡馆氛围）。另外在意大利语里它也可能有“在牢房里/坐牢”的俚语含义，但英语通常不这么用。"],"etymology":"源自意大利语 al fresco，字面意思是“在凉爽/清新的空气中”。英语里主要用来形容“户外（尤其是用餐）”。","mnemonic":["把 fresco 联想到“fresh（新鲜）”：al fresco ≈ in fresh air（在新鲜空气里）→ 户外。","记成“alfresco=外面吃”：al（在）+ fresco（清新）→ 在清新空气中用餐。"]}
{"word":"al Qaeda","summary":{"en":"a militant group associated with terrorism","zh":"与恐怖主义相关的武装组织"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a militant Islamist organization founded in the late 20th century, known internationally for carrying out and inspiring terrorist attacks","zh":"一个成立于20世纪末的伊斯兰主义武装组织，在国际上因实施和煽动恐怖袭击而广为人知"},"examples":[{"en":"After the 2001 attacks, many countries increased efforts to track and disrupt al-Qaeda networks.","zh":"2001年袭击事件后，许多国家加大了追踪并瓦解“基地”组织网络的力度。"},{"en":"The report discussed how al-Qaeda’s influence changed over time.","zh":"该报告讨论了“基地”组织的影响力如何随时间变化。"}]}],"synonyms":["al-Qaida","the Base"],"phonetic":"/ˌæl ˈkaɪdə/","extraExplanation":["写法与大小写：英语新闻与学术写作中常见 al-Qaeda、al Qaida、Al Qaeda 等不同拼写；中文常译作“基地组织”。","语境提示：这是与恐怖主义相关的专有名词，使用时通常出现在新闻、历史、国际关系或安全议题中。表达观点时可尽量保持客观、避免把相关群体与普通宗教或族群简单等同。"],"etymology":"源自阿拉伯语 al-qāʿidah（القاعدة），本义是“基地、根基（the base）”。在特定历史语境中被用作组织名称，英语里常见拼写有 al-Qaeda / al-Qaida 等。","mnemonic":["把阿拉伯语含义记成“base（基地）”：al-Qaeda ≈ “the base（基地）”，对应中文常译“基地组织”。"]}
{"word":"Al-Abbasi","summary":{"en":"Al‑Abbasi is a proper name (often a surname) of Arabic origin linked to al‑ʿAbbās or the Abbasid line/era.","zh":"Al‑Abbasi 是一个阿拉伯语来源的专有名称（常作姓氏），与阿拔斯（ʿAbbās）或阿拔斯王朝的家系/时代有关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname or name element of Arabic origin meaning “(of) al-ʿAbbās / the Abbasid line,” often associated with families claiming descent from al-ʿAbbās (the Prophet Muhammad’s uncle) or with the historical Abbasid era.","zh":"一个源自阿拉伯语的姓氏或姓名成分，意为“属于阿巴斯（ʿAbbās）/阿拔斯王朝（Abbasid）”，常与自称出自阿巴斯家系或与阿拔斯时代相关的家族、人物有关。"},"examples":[{"en":"His last name, Al‑Abbasi, suggests an Arabic family background.","zh":"他的姓 Al‑Abbasi 暗示他有阿拉伯家族背景。"},{"en":"In some records, the name appears as Abbasi without “Al-.”","zh":"在一些记录里，这个名字会写成 Abbasi，而不带 “Al-”。"}]}],"synonyms":["Abbasi","al-Abbāsī","Abbasid (related adjective)"],"phonetic":"ˌæl əˈbɑːsi","extraExplanation":["“Al-”（الـ）在阿拉伯语中常被理解为定冠词“the”，也常见于姓氏/称谓中，表示“某某家族/某某支系”。实际书写与拼写会因地区、转写系统与移民登记而变化（如 Al‑Abbasi / Al Abbasi / Abbasi）。","“Abbasi/Al‑Abbasi”也可能作为“尼斯白（nisba）”式的关系形容词，表达“与阿拔斯（ʿAbbās）有关/出自其后裔/隶属其群体”的身份来源。","如果你指的是具体人物、家族、公司或地名（例如某位作家、运动员或组织名），请给我一句上下文或所在国家/语言，我可以帮你确认更精确的含义与常见写法。"]}
{"word":"Al-Abbasiyya","summary":{"en":"Al-Abbasiyya is most commonly the name of a well-known district in Cairo, Egypt, though similar place names can exist elsewhere in Arabic-speaking regions.","zh":"Al-Abbasiyya 最常见指埃及开罗的一个知名城区/街区，但在其他阿拉伯语地区也可能出现同名或近似地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a district/neighborhood in Cairo, Egypt, known for major institutions (e.g., Ain Shams University faculties and Al-Abbassia Psychiatric Hospital) and as a well-known urban area in modern Cairo.","zh":"（埃及）开罗的一个城区/街区名称，以多所重要机构（如艾因夏姆斯大学部分校区、阿巴西亚精神病院等）而闻名，是现代开罗较知名的城市区域之一。"},"examples":[{"en":"She lives in Al-Abbasiyya, not far from downtown Cairo.","zh":"她住在阿巴西亚，离开罗市中心不远。"},{"en":"The taxi driver knew exactly where Al-Abbasiyya Square was.","zh":"出租车司机很清楚阿巴西亚广场在哪里。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used in several Arabic-speaking regions; it can refer to locations named after al-‘Abbās (a respected historical figure), so the exact meaning depends on the country and context.","zh":"（更广义）阿拉伯语地区常见的地名形式之一；可能指以“阿拔斯（al-‘Abbās）”命名的地点，具体所指需结合国家与语境判断。"},"examples":[{"en":"In this article, “Al-Abbasiyya” refers to a neighborhood in Cairo, not another town with a similar name.","zh":"在这篇文章里，“Al-Abbasiyya”指的是开罗的一个街区，而不是同名的其他城镇。"},{"en":"The report mentioned Al-Abbasiyya, but the country wasn’t specified.","zh":"报告提到了“Al-Abbasiyya”，但没有说明是哪个国家。"}]}],"synonyms":["Abbasiyya","Abbassia","El-Abbassia","Al-‘Abbāsiyya"],"phonetic":"/ˌæl əˌbɑːˈsiːjə/","extraExplanation":["“al-”是阿拉伯语定冠词，相当于英语的“the”。“Abbās/‘Abbās”（阿拔斯）是人名词根，历史上常与先知穆罕默德的叔父阿拔斯（al-‘Abbās ibn ‘Abd al-Muṭṭalib）相关，因此不少地名会用“Al-Abbasiyya/Abbassia/Abbasiyah”等拼写形式。","英语里这一类阿拉伯地名常见多种罗马字转写（如 Abbasiyya / Abbassia / El-Abbassia），新闻、地图或个人文件上拼写不同并不罕见。"]}
{"word":"al-Ansari","summary":{"en":"Al-Ansari is an Arabic-derived name meaning “the Ansari,” often a surname or honorific indicating association with the Anṣār (“Helpers”) of Medina.","zh":"al-Ansari 源自阿拉伯语，意为“安萨里/援助者之人”，常作姓氏或称号，表示与麦地那的 Anṣār（辅士/援助者）有关联。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name or honorific (Arabic nisba) meaning “the Ansari,” referring to someone associated with the Anṣār (“the Helpers”) of Medina in early Islamic history, or descended from/linked to that group.","zh":"一个姓氏或称号（阿拉伯语的“关系形容词/门第名”nisba），意思是“安萨里”（Ansari），指与早期伊斯兰历史中麦地那的“援助者”（Anṣār，“辅士/援助者”）有关联的人，或自称其后裔/归属者。"},"examples":[{"en":"His last name is al-Ansari, a common surname in several Muslim communities.","zh":"他的姓是 al-Ansari，这是一些穆斯林社群中常见的姓氏。"},{"en":"In a historical text, “al-Ansari” can signal a person’s claimed connection to the Anṣār of Medina.","zh":"在历史文献里，“al-Ansari”可能用来标示某人自称与麦地那的 Anṣār（援助者）有关联。"}]},{"partOfSpeech":"other","definition":{"en":"(by extension) used in names of scholars, writers, or public figures as a label of origin/affiliation, similar to “the Medinan Helper” in historical naming traditions.","zh":"（引申）用在学者、作者或公众人物的名字中，作为来源或归属的标识；在传统命名中近似于“来自（或归属）麦地那辅士/援助者的人”。"},"examples":[{"en":"Some historical figures include “al-Ansari” in their name to show lineage or scholarly identity.","zh":"一些历史人物在姓名中带有 “al-Ansari”，用来表明家族渊源或身份标识。"},{"en":"When reading biographies, treat “al-Ansari” as part of the name, not as a separate English word.","zh":"阅读传记时，把 “al-Ansari”当作姓名的一部分，而不是一个独立的英语单词来理解。"}]}],"synonyms":["Ansari","al-Ansārī"],"phonetic":"/ˌæl ɑnˈsɑri/","extraExplanation":["“al-”是阿拉伯语定冠词，类似英语的 “the”。在拉丁字母拼写中常见连字符：al-Ansari。实际发音可能因地区口音而略有差异。","“Anṣār”（辅士/援助者）是伊斯兰早期历史中的重要群体：麦地那当地支持并接纳先知穆罕默德及迁徙者（Muhājirūn）的居民。因而“Ansari/ al-Ansari”在文化上带有历史与宗教身份的联想。","英文资料里也常见不同转写：Ansari, al-Ansari, al-Ansārī（带长音符号）。转写差异通常不改变核心含义。"]}
{"word":"al-Assad","summary":{"en":"Al-Assad is a Syrian surname and political family name, often referring to Syria’s president Bashar al-Assad or his father Hafez al-Assad in English-language contexts.","zh":"al-Assad 是叙利亚的姓氏与政治家族名，在英语语境中常指叙利亚总统巴沙尔·阿萨德或其父、前总统哈菲兹·阿萨德。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name and political surname in Syria; in English news it often refers to Bashar al-Assad (born 1965), the president of Syria, or to his father Hafez al-Assad (1930–2000), a former president.","zh":"叙利亚的姓氏与政治家族名；在英语新闻中常指叙利亚总统巴沙尔·阿萨德（Bashar al-Assad），或其父、前总统哈菲兹·阿萨德（Hafez al-Assad）。"},"examples":[{"en":"Many news reports discuss the al-Assad government in Syria.","zh":"许多新闻报道会讨论叙利亚的阿萨德政府。"},{"en":"Bashar al-Assad became president after his father, Hafez al-Assad.","zh":"巴沙尔·阿萨德在其父哈菲兹·阿萨德之后成为总统。"}]}],"synonyms":["Assad","Bashar al-Assad","Hafez al-Assad"],"phonetic":"/ˌæl əˈsɑːd/","extraExplanation":["“al-”是阿拉伯语定冠词，意思接近英语的“the”。在姓名中，“al- + 姓”常表示“某某家族/某地的人”，所以 al-Assad 直译可理解为“（被称作）阿萨德的家族/一支”。","英语媒体中常见不同拼写与大小写：al-Assad / Al-Assad / Assad；连字符有时也会省略。写作时通常遵循当事人或主流媒体的拼写。","“Assad/Asad”（阿萨德）在阿拉伯语里常被解释为“狮子”。在正式语境中，它主要被当作专有名词使用，而不是普通词汇。"]}
{"word":"Al-Basra","summary":{"en":"Al-Basra (Basra): a major port city in southern Iraq near the Persian Gulf.","zh":"Al-Basra（巴士拉）：伊拉克南部靠近波斯湾的重要港口城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A major port city in southern Iraq, near the Shatt al-Arab waterway and close to the Persian Gulf; known historically as an important center of trade, culture, and early Islamic learning.","zh":"伊拉克南部的重要港口城市，位于阿拉伯河（Shatt al-Arab）附近、接近波斯湾；历史上以贸易、文化与早期伊斯兰学术中心而闻名。"},"examples":[{"en":"Basra (Al-Basra) is one of Iraq’s key ports.","zh":"巴士拉（Al-Basra）是伊拉克的重要港口之一。"},{"en":"The ship traveled through the Shatt al-Arab toward Al-Basra.","zh":"船只沿着阿拉伯河驶向巴士拉。"},{"en":"Merchants once connected Al-Basra with India and East Africa through sea trade.","zh":"过去商人通过海上贸易把巴士拉与印度、东非连接起来。"}]}],"synonyms":["Basra"],"phonetic":"/æl ˈbɑːsrə/","extraExplanation":["“Al-”是阿拉伯语定冠词，相当于英语的“the”。因此“Al-Basra”直译可理解为“（这座）巴士拉”。英语里常见两种写法：Basra 与 Al-Basra；新闻与地图上多用 Basra。","巴士拉在历史上常被提及为海湾地区的重要贸易节点，也与阿拉伯航海与旅行叙事传统有关（例如一些中世纪地理与游记作品会提到此地）。"]}
{"word":"al-Battani","summary":{"en":"Al-Battani was a major medieval astronomer and mathematician whose observations and calculations influenced later science.","zh":"al-Battani 是重要的中世纪天文学家与数学家，其观测与计算影响了后世科学发展。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medieval Muslim astronomer and mathematician (c. 858–929) from the Islamic Golden Age, famous for improving astronomical measurements and influencing later European astronomy.","zh":"中世纪伊斯兰黄金时代的穆斯林天文学家与数学家（约公元858–929年），以改进天文观测与计算著称，并对后来的欧洲天文学产生影响。"},"examples":[{"en":"Al-Battani calculated the length of the solar year with impressive accuracy for his time.","zh":"al-Battani 在当时以很高的精度计算了太阳年的长度。"},{"en":"Many historians note that Al-Battani’s work influenced later European astronomers.","zh":"许多历史学者指出，al-Battani 的著作影响了后来的欧洲天文学家。"},{"en":"In a report on the history of science, Al-Battani is often mentioned alongside other major scholars of the Islamic Golden Age.","zh":"在科学史的介绍中，al-Battani 常与伊斯兰黄金时代的其他重要学者并列提及。"}]}],"synonyms":["Albategnius"],"phonetic":"ˌæl bəˈtɑːni","extraExplanation":["“al-”是阿拉伯语定冠词，相当于英语的“the”。“al-Battani”是拉丁化/英语化写法之一，他也常以拉丁名“Albategnius”出现在欧洲文献中。","他的重要贡献之一是通过更精细的观测改进了若干天文常数（例如岁差相关的估计），并发展与三角学相关的计算方法；这些成果为后来的天文学与数学传统提供了参考。"]}
{"word":"Al-Bayda","summary":{"en":"Al-Bayda is a proper name for several places in Arabic-speaking countries; it comes from Arabic meaning “the white (place).”","zh":"Al-Bayda 是多个阿拉伯国家地区/城镇的专有地名，源自阿拉伯语，意为“白色之地/白色的（地方）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name used for several towns/regions in the Arab world (for example, Al Bayda in Libya or Al Bayda Governorate in Yemen).","zh":"“Al-Bayda”是阿拉伯世界中多个城镇/地区的地名（例如利比亚的拜达市、也门的拜达省）。"},"examples":[{"en":"Al-Bayda is a city in eastern Libya, not far from Benghazi.","zh":"Al-Bayda 是利比亚东部的一座城市，离班加西不远。"},{"en":"News reports mentioned fighting in Al-Bayda Governorate in Yemen.","zh":"新闻报道提到也门拜达省发生冲突。"}]},{"partOfSpeech":"n.","definition":{"en":"(from Arabic) “the white (one)”—a descriptive name often used for places, sometimes referring to pale-colored land, white buildings, or a symbolic meaning of “bright/pure.”","zh":"（源自阿拉伯语）“白色的（女性形式）/白色之地”——常用于地名，有时指浅色地貌、白色建筑，或象征“明亮/纯净”。"},"examples":[{"en":"In Arabic, al- means “the,” so Al-Bayda can be understood as “the white (place).”","zh":"在阿拉伯语里，al- 表示“这/该（the）”，所以 Al-Bayda 可理解为“白色之地”。"}]}],"synonyms":["Al Bayda","Al-Bayḍāʾ","El Beida","Al Baida"],"phonetic":"/ˌæl ˈbaɪdə/","extraExplanation":["这是一个阿拉伯语地名的常见构词：al-（الـ）是定冠词“the”，bayḍāʾ（البيضاء）与“白色”有关。因为很多地方都可能用“白色/明亮”来命名，所以同名地点不少，实际指哪一个要看国家或上下文。","英文里拼写常见变体包括 Al Bayda、Al-Bayda、El Beida 等；不同转写系统会导致连字符与元音拼法不一致。"]}
{"word":"al-Bitruji","summary":{"en":"Al-Bitruji was a 12th-century Andalusian astronomer (Latin: Alpetragius) known for proposing a concentric-sphere alternative to Ptolemaic astronomy.","zh":"al-Bitruji 是12世纪安达卢斯天文学家（拉丁名 Alpetragius），以提出同心天球的托勒密体系替代方案而知名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A 12th-century Andalusian (Islamic Spain) astronomer who proposed a non-Ptolemaic model of planetary motion using concentric spheres; known in Latin as Alpetragius.","zh":"12世纪安达卢斯（伊斯兰西班牙）的天文学家，提出以同心天球解释行星运动、不同于托勒密体系的模型；拉丁文名常作 Alpetragius（阿尔佩特拉吉乌斯）。"},"examples":[{"en":"Al-Bitruji criticized parts of the Ptolemaic system and tried to explain planetary motion with concentric spheres.","zh":"al-Bitruji 批评了托勒密体系的部分观点，并尝试用同心天球来解释行星运动。"},{"en":"In a history of astronomy class, we compared Ptolemy, al-Bitruji, and later Copernicus.","zh":"在天文学史课上，我们比较了托勒密、al-Bitruji，以及后来的哥白尼。"}]}],"synonyms":["Alpetragius"],"phonetic":"/ˌæl bɪˈtruːdʒi/","extraExplanation":["“al-”是阿拉伯语定冠词，相当于英语的 “the”。因此很多阿拉伯姓名在英语里会以 al- 开头。","al-Bitruji 的学术影响主要体现在他对“天球同心模型”的坚持：他希望用更符合当时自然哲学的方式解释天象，虽然预测精度不如托勒密体系，但在思想史上具有意义。","你可能会在英文资料中看到他被称为 “Alpetragius”，这是中世纪拉丁化后的写法。"]}
{"word":"al-Buraq","summary":{"en":"Al-Buraq is a miraculous creature in Islamic tradition, famous as the mount used in the Night Journey and Ascension.","zh":"al-Buraq（布拉克）是伊斯兰传统中的神奇坐骑，最著名于“夜行登霄”故事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Islam) a miraculous, heavenly creature that carried the Prophet Muhammad during the Night Journey and Ascension (Isra and Mi‘raj).","zh":"（伊斯兰传统中）一种神奇的天界坐骑，据说在“夜行登霄”（Isra 与 Mi‘raj）中载着先知穆罕默德旅行与升天。"},"examples":[{"en":"In many retellings of the Isra and Mi‘raj, Muhammad travels on al-Buraq.","zh":"在许多关于“夜行登霄”的叙述中，穆罕默德骑乘布拉克旅行。"},{"en":"Artists sometimes depict al-Buraq as a white creature associated with great speed.","zh":"一些艺术作品会把布拉克描绘成与极速相关的白色神兽。"}]}],"synonyms":["Buraq","al-Burāq"],"phonetic":"/ˌæl bʊˈrɑːk/","extraExplanation":["“al-”是阿拉伯语定冠词，相当于英语的“the”。“Buraq”（البُراق）常被解释为来自阿拉伯语“barq”（برق，意为“闪电”），因此常带有“快如闪电”的联想。","在不同地区的伊斯兰艺术与民间叙事中，布拉克的外形描写不尽相同；有的形象带翼，有的更接近马或骡的体态。这些多为文化表达与艺术传统，并非所有穆斯林都会以同一种方式理解。"]}
{"word":"Al-Cool","summary":{"en":"“Al-Cool” is a playful spelling of “alcohol,” meaning alcoholic drinks or ethanol; in science it can also mean a class of -OH compounds.","zh":"“Al-Cool”是“alcohol”的趣味拼写，指含酒精饮品或乙醇；在科学语境中也可指含 -OH 的醇类化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a drink that contains ethanol (such as beer, wine, or spirits); also, the substance in these drinks that can make people feel relaxed or drunk","zh":"含乙醇的饮料（如啤酒、葡萄酒、烈酒）；也指这些饮料中的乙醇成分，会让人放松或醉酒"},"examples":[{"en":"Some medicines should not be taken with alcohol.","zh":"有些药不能和酒精一起服用。"},{"en":"He stopped drinking alcohol for health reasons.","zh":"出于健康原因，他戒酒了。"},{"en":"The restaurant doesn’t serve alcohol.","zh":"这家餐厅不提供含酒精饮品。"}]},{"partOfSpeech":"n.","definition":{"en":"in chemistry, a type of organic compound (like ethanol or methanol) that contains a hydroxyl group (-OH)","zh":"（化学）一类含羟基（-OH）的有机化合物（如乙醇、甲醇）"},"examples":[{"en":"Ethanol is an alcohol commonly found in drinks.","zh":"乙醇是一种常见于酒类中的醇。"},{"en":"Methanol is a toxic alcohol and should never be consumed.","zh":"甲醇是一种有毒的醇，绝不能饮用。"}]}],"synonyms":["liquor","booze","spirits","beer","wine","ethanol"],"phonetic":"/ˈæl.kə.hɑːl/","extraExplanation":["“Al-Cool”常见于网络上的趣味拼写/谐音写法，模仿 alcohol 的读音（像“Al + cool”），带有俏皮或调侃“喝酒很酷”的感觉；正式写法是 alcohol。","词源小知识：alcohol 来自阿拉伯语 al-kuḥl（原指一种细粉/眼线粉），后来在欧洲炼金术语境中引申为“提纯出来的精华/蒸馏物”，再发展为今天的“酒精”。"]}
{"word":"Al-Farabi","summary":{"en":"Al-Farabi was a major medieval Muslim philosopher and scholar, known for logic and political philosophy, often called “the Second Teacher.”","zh":"阿尔·法拉比是中世纪重要的穆斯林哲学家与学者，以逻辑与政治哲学著称，常被称为“第二导师”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A major medieval Muslim philosopher and scholar (c. 872–950), known in Latin tradition as “Alpharabius,” famous for works on logic, political philosophy, and music theory; often called “the Second Teacher” (after Aristotle).","zh":"阿尔·法拉比（约872—950），中世纪重要的穆斯林哲学家与学者（拉丁传统称“Alpharabius”），以逻辑学、政治哲学与音乐理论著作著称；常被称为“第二导师”（仅次于亚里士多德）。"},"examples":[{"en":"Al-Farabi wrote influential commentaries on Aristotle’s logic.","zh":"阿尔·法拉比撰写了对亚里士多德逻辑学很有影响力的注释。"},{"en":"In many histories of philosophy, Al-Farabi is presented as a bridge between Greek philosophy and later Islamic thinkers.","zh":"在许多哲学史里，阿尔·法拉比被视为连接希腊哲学与后来的伊斯兰思想家的桥梁。"}]}],"synonyms":["Abu Nasr al-Farabi","Alpharabius","Farabi"],"phonetic":"/ˌɑl fəˈrɑːbi/","extraExplanation":["“Al-”在阿拉伯语中常相当于英语的“the”，很多阿拉伯姓名在英语里会保留这个前缀。","阿尔·法拉比的阿拉伯全名常写作Abu Nasr al-Farabi；他与伊本·西那（Avicenna）等思想家一起，推动了古希腊哲学在伊斯兰世界的整理与发展。","“第二导师（Second Teacher）”这一称号强调他在理解、讲授与系统化亚里士多德哲学方面的地位。"]}
{"word":"Al-Fatiha","summary":{"en":"Al-Fatiha is the first chapter of the Qur’an (“The Opening”), widely recited in Muslim prayer and sometimes used as a short blessing or opening recitation.","zh":"Al-Fatiha（《开端章》）是《古兰经》第一章（意为“开端/开篇”），在穆斯林礼拜中常诵读，也常在一些场合用作简短的祝福或开场诵读。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The first chapter (surah) of the Qur’an, known as “The Opening,” often recited in daily Muslim prayers.","zh":"《古兰经》的第一章（苏拉），意为“开端”，常在穆斯林每日礼拜中诵读。"},"examples":[{"en":"Muslims recite Al-Fatiha in each unit of the daily prayer.","zh":"穆斯林在每日礼拜的每一拜（单元）中都会诵读《开端章》（Al-Fatiha）。"},{"en":"At the beginning of the ceremony, he quietly read Al-Fatiha.","zh":"仪式开始时，他轻声诵读了《开端章》。"}]},{"partOfSpeech":"n.","definition":{"en":"A short recitation of Al-Fatiha used as a blessing or opening in some Muslim communities (for example, before a meeting or at a condolence gathering).","zh":"在一些穆斯林社群中，用来祝福或开场的《开端章》诵读（例如开会前或吊唁场合）。"},"examples":[{"en":"They began the gathering with Al-Fatiha for peace and guidance.","zh":"他们以诵读《开端章》开始聚会，祈求平安与指引。"},{"en":"In his culture, people may read Al-Fatiha for the deceased.","zh":"在他的文化里，人们可能会为逝者诵读《开端章》。"}]}],"synonyms":["Surah Al-Fatihah","The Opening","the Fatiha"],"phonetic":"ˌæl fəˈtiːhə","extraExplanation":["“Al-”是阿拉伯语定冠词，意为“这/那”。“Fatiha/ Fatihah”来自阿拉伯语词根，含“开启、开端”之意，所以常译为“The Opening”（开端、开篇）。","英语里也常见拼写差异：Al-Fatiha、Al-Fatihah、Al-Fateha 等，都是同一章名的不同转写。正式场合可用“Surah Al-Fatihah”（《开端章》）更准确。","在伊斯兰礼拜（ṣalāh）中，《开端章》具有核心地位；但在不同地区的习俗中，把它用作开场祈祷或悼念祝祷的频率可能不同。"]}
{"word":"Al-Fatihah","summary":{"en":"Al-Fatihah is the first chapter of the Qur’an, known as “The Opening,” and it is frequently recited in Muslim prayer.","zh":"Al-Fatihah（《开端章》）是《古兰经》第一章，常被称为“开端”，在穆斯林礼拜中经常诵读。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the first chapter (surah) of the Qur’an, often called “The Opening,” widely recited in Muslim prayer","zh":"《古兰经》的第一章（苏拉），常被称为“开端章”，在穆斯林礼拜中广泛诵读"},"examples":[{"en":"Many Muslims recite Al-Fatihah in every unit of the daily prayers.","zh":"许多穆斯林在每日礼拜的每一拜（每个礼拜单位）中都会诵读《开端章》（Al-Fatihah）。"},{"en":"At the ceremony, someone began by reading Al-Fatihah.","zh":"在仪式上，有人以诵读《开端章》（Al-Fatihah）开始。"}]},{"partOfSpeech":"n.","definition":{"en":"a short recitation of Al-Fatihah said as a prayer or blessing in some Muslim communities, especially at important moments","zh":"在一些穆斯林社群中，于重要时刻诵读《开端章》作为祈祷或祝福的一段简短诵念"},"examples":[{"en":"They said Al-Fatihah for the sick person and asked for healing.","zh":"他们为病人诵读《开端章》（Al-Fatihah），并祈求康复。"},{"en":"Before the meal, the family quietly said Al-Fatihah together.","zh":"用餐前，这家人一起安静地诵读《开端章》（Al-Fatihah）。"}]}],"synonyms":["The Opening","Al-Fatiha","Surah Al-Fatihah","Fatiha"],"phonetic":"ˌæl fəˈtiːhə","extraExplanation":["“Al-”是阿拉伯语定冠词，相当于英语的 “the”。“Fātiḥah / فاتحة”大意是“开端、开启”。因此 Al-Fatihah 常译为 “The Opening”。","英语里也常见不同拼写：Al-Fatiha / Al-Fatihah / Al-Fateha 等，主要是音译差异。用于书写或口语提及宗教文本时，通常以尊重、正式的语气为宜。","在文学或报道中，它常作为伊斯兰礼拜与宗教生活的象征性元素出现；如果在非宗教语境引用，建议简单说明其是《古兰经》第一章，避免造成误解。"]}
{"word":"Al-Gazal","summary":{"en":"Al-Gazal is an Arabic-origin name meaning “the gazelle,” used as a surname or nickname.","zh":"Al-Gazal 是阿拉伯语来源的名字，意为“羚羊”，可作姓氏或绰号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a name (Arabic-origin surname or nickname) meaning “the gazelle,” used as a family name or as part of a longer Arabic name.","zh":"一个名字（阿拉伯语来源的姓氏或绰号），意思是“羚羊”，可用作家族姓氏，或作为较长阿拉伯姓名的一部分。"},"examples":[{"en":"Dr. Al-Gazal will speak at the conference tomorrow.","zh":"Al-Gazal 医生明天将在会议上发言。"},{"en":"Her last name is Al-Gazal, a name linked to the Arabic word for “gazelle.”","zh":"她的姓是 Al-Gazal，这个名字与阿拉伯语中“羚羊”一词有关。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical use) a byname meaning “the Gazelle,” used for some Arabic-speaking writers or figures (e.g., as a poetic nickname).","zh":"（历史用法）意为“羚羊”的别号，用于一些阿拉伯语文化圈的作家或人物（如诗意化的绰号）。"},"examples":[{"en":"In some historical texts, “al-Gazal” appears as a descriptive nickname rather than a family surname.","zh":"在一些历史文本中，“al-Gazal”更像是描述性的绰号，而不一定是家族姓氏。"}]}],"synonyms":["Al Ghazal","al-Ghazal","El-Gazal"],"phonetic":"/ˌæl ɡəˈzɑːl/","extraExplanation":["“Al-”是阿拉伯语定冠词，常相当于英语的“the”。因此 Al-Gazal 字面意思是“那只/那种羚羊”。","拼写与转写可能不同：Al-Gazal / Al Ghazal / al-Ghazal 等都可能指同一来源。","不要与更常见的“al-Ghazālī”（一位著名学者的姓/称号）混淆；两者拼写与来源词根可能不同。"]}
{"word":"Al-Gazel","summary":{"en":"Al-Gazel is usually a transliteration of an Arabic name meaning “the gazelle,” used as a nickname/surname, and sometimes as a modern title or brand name.","zh":"Al-Gazel 通常是阿拉伯语名称的转写，意为“瞪羚/羚羊”，可作绰号/姓氏，也常被现代用作名称或品牌名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a historical Arabic nickname or surname meaning “the gazelle,” used by some people in the Islamic world (often written as Al-Ghazal / Al-Gazal).","zh":"一个源自阿拉伯语、意为“瞪羚/羚羊”的绰号或姓氏，在伊斯兰文化圈中被一些人物使用（常见拼写为 Al-Ghazal / Al-Gazal）。"},"examples":[{"en":"In some historical sources, he is called Al-Gazel, meaning “the gazelle.”","zh":"在一些历史资料中，他被称为 Al-Gazel，意思是“瞪羚/羚羊”。"},{"en":"The diplomat-poet was known by the nickname Al-Ghazal (also spelled Al-Gazel in older texts).","zh":"这位外交官兼诗人以 Al-Ghazal（旧文献也拼作 Al-Gazel）这一绰号闻名。"}]},{"partOfSpeech":"other","definition":{"en":"(by extension) a name or title for something (e.g., a project, shop, or brand) chosen to suggest grace, speed, or elegance, like a gazelle.","zh":"（引申）用于项目、店名或品牌等的名称/称号，借“瞪羚”联想到优雅、敏捷或速度。"},"examples":[{"en":"They named their café Al-Gazel to give it an elegant, lively image.","zh":"他们把咖啡馆取名为 Al-Gazel，以营造优雅灵动的形象。"},{"en":"Al-Gazel became the label’s signature name in the local market.","zh":"Al-Gazel 成了该品牌在本地市场的招牌名称。"}]}],"synonyms":["Al-Ghazal","Al-Gazal","gazelle"],"phonetic":"/ˌæl ɡəˈzɛl/","extraExplanation":["“Al-”在阿拉伯语里常见作定冠词，相当于英语的“the”。因此类似 Al-Gazel / Al-Ghazal 这类形式，往往可以理解为“那只/那个‘瞪羚’”。","转写（拼写）差异很常见：阿拉伯语音在不同语言和年代的拉丁字母拼写会变化，比如 gh / g、z / zh 等，所以你可能会看到 Al-Ghazal、Al-Gazal、Al-Gazel 等多种写法。","如果你指的是特定人物（例如安达卢斯时期的诗人兼外交官 Yahya ibn al-Hakam，绰号“Al-Ghazal”），也可以告诉我上下文（国家、年代、文本来源），我可以帮你对准是哪一位。"]}
{"word":"Al-Ghazal","summary":{"en":"Al-Ghazal is an Arabic-derived name meaning “the gazelle,” used as a surname/nickname and also known as the epithet of a 9th‑century Andalusi poet-diplomat.","zh":"Al-Ghazal 源自阿拉伯语，意为“（那）瞪羚/羚羊”，可作姓氏或绰号；也可指9世纪安达卢斯的一位诗人兼外交官的别称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A name or title from Arabic meaning “the gazelle,” used as a surname/nickname and sometimes as part of place or business names.","zh":"源自阿拉伯语的名字或称号，意思是“瞪羚/羚羊”，可作为姓氏/绰号使用，也常见于地名或商号名称的一部分。"},"examples":[{"en":"His family name is Al-Ghazal, which comes from the Arabic word for “gazelle.”","zh":"他的姓是 Al-Ghazal，来自阿拉伯语中“瞪羚/羚羊”的词。"},{"en":"The café called Al-Ghazal chose the name to suggest elegance and speed.","zh":"那家名为 Al-Ghazal 的咖啡馆用这个名字来传达“优雅、敏捷”的意象。"}]},{"partOfSpeech":"other","definition":{"en":"A historical nickname for Yaḥyā ibn al-Ḥakam (9th century), an Andalusi Arab poet and diplomat known as al-Ghazal.","zh":"历史人物的别称：9世纪安达卢斯的阿拉伯诗人兼外交官 Yaḥyā ibn al-Ḥakam，绰号为 al-Ghazal。"},"examples":[{"en":"In some histories of al-Andalus, al-Ghazal appears as both a poet and an envoy.","zh":"在一些关于安达卢斯的史书中，al-Ghazal 既以诗人身份出现，也以使节身份出现。"}]}],"synonyms":["gazelle (meaning)"],"phonetic":"ˌæl ɡəˈzɑːl","extraExplanation":["“Al-”是阿拉伯语定冠词，相当于英语的 “the”。因此 Al-Ghazal 字面可理解为 “the gazelle（那只/那种羚羊）”。","英语里这种阿拉伯语姓名常有不同拼写（如 Al Ghazal / Al-Ghazal），取决于转写习惯。","注意不要与更常见的 “al-Ghazali（阿尔-加扎里）”混淆；后者通常指著名的伊斯兰思想家 Abu Hamid al-Ghazali。"]}
{"word":"al-Hajj","summary":{"en":"al-Hajj: the Islamic pilgrimage to Mecca (also the name of a Qur’an chapter).","zh":"al-Hajj：伊斯兰教前往麦加的朝觐（也指《古兰经》中的“朝觐章”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Islamic pilgrimage to Mecca in Saudi Arabia, which Muslims who are able are expected to perform at least once in their lifetime (often written as Hajj).","zh":"（伊斯兰教）朝觐：指穆斯林在条件允许的情况下，一生中至少应前往沙特阿拉伯麦加完成一次的宗教朝圣（常写作 Hajj）。"},"examples":[{"en":"Millions of Muslims travel to Saudi Arabia each year to perform al-Hajj.","zh":"每年都有数以百万计的穆斯林前往沙特阿拉伯完成朝觐（al-Hajj）。"},{"en":"During al-Hajj, pilgrims follow specific rituals at holy sites around Mecca.","zh":"在朝觐期间，朝觐者会在麦加周边的圣地完成特定的仪式。"}]},{"partOfSpeech":"n.","definition":{"en":"(also Al-Hajj) the title of the 22nd chapter (surah) of the Qur’an.","zh":"（也作 Al-Hajj）《古兰经》第22章（苏拉）的名称。"},"examples":[{"en":"We read passages from Al-Hajj in our study group.","zh":"我们在学习小组里诵读了《古兰经·朝觐章》（Al-Hajj）的片段。"}]}],"synonyms":["Hajj","the pilgrimage to Mecca"],"phonetic":"/æl ˈhɑːdʒ/","extraExplanation":["“al-”是阿拉伯语定冠词，相当于英语的 “the”。因此 al-Hajj 字面意思是“这一次朝觐/这项朝觐”。在英文里更常见的写法是 Hajj（有时也写 Haj）。","朝觐通常发生在伊斯兰历的特定月份，包含绕行克尔白（Kaaba）、在阿拉法特（Arafat）停驻等仪式。对穆斯林而言，这是重要的宗教实践与群体经验。","在英语新闻与旅行语境中，常见搭配有: Hajj pilgrimage, Hajj season, Hajj pilgrims。另一个常被提到的朝圣是 Umrah（副朝），时间更灵活，但宗教义务性质不同。"]}
{"word":"al-hajj","summary":{"en":"Al-Hajj is the major annual Islamic pilgrimage to Mecca, a key religious duty for Muslims who are able.","zh":"Al-Hajj 指穆斯林在条件允许时应履行的年度重大朝觐，前往麦加，是重要宗教义务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the major Islamic pilgrimage to Mecca (Makkah), required once in a lifetime for Muslims who are physically and financially able; it takes place at a specific time each year in the Islamic lunar calendar","zh":"（伊斯兰教）朝觐：穆斯林在身体与经济条件允许时，一生至少一次前往麦加的重大宗教朝圣；在伊斯兰阴历每年固定时段举行"},"examples":[{"en":"Millions of Muslims travel to Saudi Arabia each year to perform al-Hajj.","zh":"每年都有数百万穆斯林前往沙特阿拉伯履行朝觐（al-Hajj）。"},{"en":"She saved money for years so her parents could go on al-Hajj.","zh":"她存了很多年钱，好让父母去参加朝觐（al-Hajj）。"},{"en":"During al-Hajj, pilgrims wear simple clothing to show equality and humility.","zh":"在朝觐（al-Hajj）期间，朝觐者穿着朴素，以表达平等与谦卑。"}]}],"synonyms":["Hajj","the Hajj","pilgrimage to Mecca"],"phonetic":"/æl ˈhɑːdʒ/","extraExplanation":["“Hajj / al-Hajj”来自阿拉伯语，意为“朝圣/前往（圣地）”。“al-”是阿拉伯语定冠词，类似英语的“the”。在英文里常见写法有 Hajj、al-Hajj、the Hajj。","朝觐是伊斯兰教“五功”（Five Pillars of Islam）之一；通常在伊斯兰历的都尔黑哲月（Dhu al-Hijjah）进行，因此不像一般旅行可随时出发。","注意区分：Hajj（朝觐）有固定时间、仪式更完整；Umrah（小朝觐）可在一年中多数时间进行，规模与要求通常不同。","新闻或文学/纪实写作中常见表达：“pilgrims on the Hajj（参加朝觐的朝觐者）”、“the Hajj pilgrimage（朝觐之旅）”。"]}
{"word":"Al-Halawi","summary":{"en":"Al-Halawi is an Arabic-origin surname, often associated with “sweetness” and sometimes understood as “confectioner / sweet-maker.”","zh":"Al-Halawi 是阿拉伯语来源的姓氏，常与“甜/甜食”相关，有时可理解为“做甜点的人/糖果师”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A surname or family name of Arabic origin, often meaning “the sweet-maker / confectioner” or “from (a place known for) sweets,” based on the root related to sweetness (ḥalāwā / ḥulw).","zh":"一个阿拉伯语来源的姓氏/家族名，常被理解为“做甜点的人/糖果师”，或“与甜食（闻名的地方）有关的人”，词根与“甜（ḥalāwā / ḥulw）”相关。"},"examples":[{"en":"Dr. Al-Halawi will present the research findings today.","zh":"Al-Halawi 博士今天将展示研究结果。"},{"en":"In the interview, Ms. Al-Halawi talked about her family’s roots in the region.","zh":"在采访中，Al-Halawi 女士谈到了她家族在该地区的渊源。"}]}],"synonyms":["Al Halawi","El-Halawy","Al-Helawi"],"phonetic":"/ˌæl hɑːˈlɑːwi/","extraExplanation":["“Al-” 是阿拉伯语定冠词，意思类似英语的 “the”。在姓名里常表示家族/称号的一部分（例如指职业、出身地或特征）。","“Halawi / Ḥalāwī” 常与“甜、甜食、甜点（halawa）”相关，因此在一些语境里可被理解为与甜点制作行业有关的姓氏或绰号。具体含义会因家族历史与地区而异。","拼写可能有多种转写形式：Al-Halawi, Al Halawi, El-Halawy, Al-Helawi 等；发音也会因地区口音与转写习惯略有不同。"]}
{"word":"al-henna","summary":{"en":"Al-henna (more commonly written “henna”) refers to a natural dye—and also the plant it comes from—used for temporary body art and coloring hair or nails.","zh":"Al-henna（英语中更常写作 henna）指一种天然染料，也可指其来源的指甲花植物；常用于临时皮肤绘纹以及染发、染指甲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a reddish-brown dye made from the leaves of the henna plant, used to color hair, skin (temporary body art), and nails","zh":"指甲花（海娜）染料：由指甲花叶制成的红棕色染料，用于染发、在皮肤上作临时纹样以及染指甲"},"examples":[{"en":"She decorated her hands with henna for the wedding.","zh":"她为婚礼用海娜在手上画了纹样。"},{"en":"Henna can stain the skin for one to three weeks.","zh":"海娜在皮肤上的颜色通常可保持一到三周。"}]},{"partOfSpeech":"n.","definition":{"en":"the henna plant (Lawsonia inermis), whose leaves are used to make the dye","zh":"指甲花植物（Lawsonia inermis），其叶子可制成染料"},"examples":[{"en":"Henna grows well in hot, dry climates.","zh":"指甲花适合在炎热干燥的气候中生长。"}]}],"synonyms":["henna","mehndi (esp. the body-art practice)"],"phonetic":"/ˈhɛnə/","extraExplanation":["“al-henna”里的“al-”常见于阿拉伯语，意思相当于英语的“the”（“这/那个”）。在一些转写或旧译里会保留“al-”，但英语里更常写作“henna”。","海娜纹样在中东、北非和南亚等地区的婚礼与节庆中很常见，既是装饰也带有祝福、避邪等文化含义；在不同地区图案风格差异很大。","学习时可留意拼写变体：henna（最常见）、mehndi（更常指“海娜纹身/绘纹”这一做法，尤其在南亚语境中）。"]}
{"word":"Al-Iskandariyah","summary":{"en":"Al-Iskandariyah is the Arabic name for Alexandria, Egypt.","zh":"Al-Iskandariyah 是埃及“亚历山大港”（Alexandria）的阿拉伯语名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper name) The Arabic name for Alexandria, a major port city in northern Egypt on the Mediterranean Sea.","zh":"（专有名词）亚历山大港的阿拉伯语名称；埃及北部地中海沿岸的重要港口城市。"},"examples":[{"en":"I’ll be in Al-Iskandariyah for a conference next week.","zh":"我下周要去亚历山大港（Al-Iskandariyah）参加会议。"},{"en":"Al-Iskandariyah is known for its seaside views and long history.","zh":"亚历山大港以海滨景色和悠久历史而闻名。"}]}],"synonyms":["Alexandria","Iskandariyah","Alessandria (less common, Italian spelling)"],"phonetic":"/ˌæl ɪsˌkæn dəˈriːə/","extraExplanation":["“Al-”是阿拉伯语的定冠词，相当于英文的“the”。因此“Al‑Iskandariyah”直译可理解为“（那座）伊斯坎达里亚”。","英文里更常写作“Alexandria”。在新闻、旅行或历史语境中，你可能会看到两种写法并用：Alexandria (Al‑Iskandariyah)。","这个地名与亚历山大大帝（Alexander the Great）有关：城市传统上被认为由他建立，因此在不同语言中都保留了“Alexander/Iskandar（伊斯坎达尔）”这一来源。"]}
{"word":"al-Jabiyah","summary":{"en":"al-Jabiyah: a historical place in southern Syria, noted in early Islamic (especially Umayyad-era) accounts as a gathering/administrative site.","zh":"al-Jabiyah：叙利亚南部的历史地名，早期伊斯兰（尤指倭马亚时期）记载中常作为集会与行政活动地点出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A historical place-name in southern Syria (near the Golan Heights), known in early Islamic history as a meeting and administrative site, especially during the early Umayyad period.","zh":"al-Jabiyah（又拼作 al-Jabiya）是叙利亚南部（靠近戈兰高地）的一处历史地名，在早期伊斯兰史中以集会与行政活动地点而闻名，尤其与早期倭马亚时期相关。"},"examples":[{"en":"Some historical sources mention al-Jabiyah as a place where leaders gathered to discuss governance.","zh":"一些史料提到，al-Jabiyah 曾是领袖们聚集商议政务的地点。"},{"en":"The text describes a route that passes near al-Jabiyah in southern Syria.","zh":"文本描述了一条经过叙利亚南部 al-Jabiyah 附近的路线。"}]}],"synonyms":["al-Jabiya","al-Jābiya"],"phonetic":"/ˌæl dʒəˈbiːjə/","extraExplanation":["这是一个专名（地名），在英文资料中常见不同转写：al-Jabiyah / al-Jabiya / al-Jābiya。阿拉伯语中的 “al-” 是定冠词，相当于英语的 “the”，在引用或按字母排序时有时会被忽略（例如按 “J” 而不是按 “A”）。","在早期伊斯兰史中，al-Jabiyah 常与“舒拉/拥立”（政治协商）以及叙利亚地区的军事—行政组织背景一起出现；不同史书对其具体位置与事件细节的描述可能略有差异。"]}
{"word":"al-Kaaba","summary":{"en":"al-Kaaba (the Kaaba): Islam’s most sacred shrine in Mecca, which Muslims face during prayer.","zh":"al-Kaaba（克尔白/天房）：位于麦加、伊斯兰教最神圣的圣所，穆斯林礼拜时面向它。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Kaaba; the cube-shaped building at the center of the Grand Mosque in Mecca, the most sacred site in Islam (Muslims face it during prayer).","zh":"克尔白（天房）；位于麦加禁寺中心的立方体建筑，是伊斯兰教最神圣的地点（穆斯林礼拜时面向它）。"},"examples":[{"en":"Millions of Muslims hope to visit the Kaaba during Hajj.","zh":"数以百万计的穆斯林希望在朝觐期间前往克尔白。"},{"en":"Muslims around the world face the Kaaba when they pray.","zh":"世界各地的穆斯林礼拜时都面向克尔白。"}]}],"synonyms":["the Kaaba","Kaaba","Ka‘bah"],"phonetic":"/kɑːˈɑːbə/","extraExplanation":["“al-”是阿拉伯语定冠词，相当于英语的“the”。因此“al-Kaaba”直译为“那座克尔白/天房”。英语里更常写作“the Kaaba”（首字母大写）。","在很多英文文本中也会见到拼写变体：Kaaba / Ka‘bah / Kabah。","注意文化与宗教敏感性：克尔白对穆斯林极其神圣，描述时常用尊重、客观的语气。非穆斯林进入麦加在沙特法律与宗教规定下通常受限制。"]}
{"word":"Al-Khafaji","summary":{"en":"Al-Khafaji is an Arabic-origin surname; it can also suggest historical connection to the Khafajah/Khafaji lineage or tribe.","zh":"Al-Khafaji 是一个阿拉伯语来源的姓氏；也可能暗示与 Khafajah/Khafaji 家族谱系或部族的历史关联。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname (family name) of Arabic origin, often written as Al-Khafaji or al-Khafaji.","zh":"一个阿拉伯语来源的姓氏（家族姓），常写作 Al-Khafaji 或 al-Khafaji。"},"examples":[{"en":"Dr. Al-Khafaji will speak at the conference tomorrow.","zh":"Al-Khafaji 博士明天将在会议上发言。"},{"en":"My classmate’s last name is Al-Khafaji.","zh":"我同学的姓是 Al-Khafaji。"}]},{"partOfSpeech":"other","definition":{"en":"a descriptive family name (nisba) that historically points to connection with the Khafajah (or Khafaji) tribe/lineage in Arabic-speaking contexts.","zh":"一种“来源/归属”式家族称谓（nisba），历史上常用来表示与阿拉伯语语境中的 Khafajah（或 Khafaji）部族/血统有关。"},"examples":[{"en":"In some biographies, the name Al-Khafaji indicates ancestral ties to a particular tribe.","zh":"在一些传记中，Al-Khafaji 这个姓可能暗示祖先与某个部族有关。"},{"en":"You may see Al-Khafaji spelled in different ways in English.","zh":"你可能会在英文里看到 Al-Khafaji 有不同拼写方式。"}]}],"phonetic":"/ˌæl kəˈfɑːdʒi/","extraExplanation":["“Al- / al-”在阿拉伯姓名中常见，类似定冠词“the”，用于姓氏或称号前。英文转写时大小写与连字符不完全统一：Al-Khafaji / al-Khafaji / Al Khafaji 都可能出现。","这类姓氏常带有“nisba（归属名）”色彩，用来表示家族来源、部族关系或祖籍关联；具体含义需结合个人/家族背景，不能仅凭姓氏断定国籍或宗教身份。"]}
{"word":"Al-Madinah","summary":{"en":"Al-Madinah is Medina, a major city in Saudi Arabia and one of the most important places in Islam; in Arabic it literally means “the city.”","zh":"Al-Madinah 指麦地那：沙特的重要城市，也是伊斯兰最重要的圣地之一；其阿拉伯语字面意思是“这座城市”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in western Saudi Arabia, famous in Islam as the place the Prophet Muhammad migrated to (the Hijrah) and where the Prophet’s Mosque is located; often called “the Prophet’s City.”","zh":"沙特阿拉伯西部的一座城市；在伊斯兰传统中极其重要，被视为先知穆罕默德迁徙（希吉拉）的目的地，也是先知清真寺所在地；常被称为“先知之城”。"},"examples":[{"en":"Millions of Muslims visit Al-Madinah each year, especially for prayer at the Prophet’s Mosque.","zh":"每年有数以百万计的穆斯林前往麦地那，尤其去先知清真寺礼拜。"},{"en":"After performing Hajj, some pilgrims travel to Al-Madinah to visit important historical sites.","zh":"完成朝觐后，一些朝圣者会前往麦地那参访重要的历史遗址。"}]},{"partOfSpeech":"n.","definition":{"en":"In Arabic, a name meaning “the city,” commonly used (especially in religious contexts) to refer specifically to Medina (Al-Madinah al-Munawwarah).","zh":"阿拉伯语中意为“城市”的名称；在宗教语境里常特指麦地那（光辉的麦地那）。"},"examples":[{"en":"In many Islamic texts, “Al-Madinah” refers to Medina without needing further explanation.","zh":"在许多伊斯兰文献中，“Al-Madinah”无需额外说明就指麦地那。"},{"en":"Some speakers say “Al-Madinah” as a respectful, traditional way to name the city.","zh":"有些人会用“Al-Madinah”作为一种尊称、传统的称呼来指这座城市。"}]}],"synonyms":["Medina","Al-Madinah al-Munawwarah","Al Madinah"],"phonetic":"ˌɑl məˈdiːnə","extraExplanation":["“Al-”(الـ) 是阿拉伯语定冠词，相当于英语的 “the”。因此 Al-Madinah 字面意思是 “the city（这座城）”。","常见英文拼写还有 Medina（更常见的英语形式）、Al Madinah、Al-Madinah al-Munawwarah / Al Madinah al Munawwarah（意为“光辉的麦地那”，更具宗教敬意的全称）。","在写作中它是专有名词，通常需要大写；在新闻或旅游语境里常用 “Medina”，在宗教或历史语境里更常见 “Al-Madinah”。"]}
{"word":"Al-Mawsil","summary":{"en":"Al-Mawsil is the Arabic name for the Iraqi city of Mosul.","zh":"Al-Mawsil 是伊拉克城市“摩苏尔（Mosul）”的阿拉伯语名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper noun) The Arabic name for Mosul, a major city in northern Iraq on the Tigris River.","zh":"（专有名词）摩苏尔（Mosul）的阿拉伯语名称；伊拉克北部底格里斯河畔的重要城市。"},"examples":[{"en":"Many Arabic-language sources refer to the city as Al-Mawsil rather than Mosul.","zh":"许多阿拉伯语资料会用 Al-Mawsil 而不是 Mosul 来称呼这座城市。"},{"en":"The museum’s artifacts were recovered near Al-Mawsil.","zh":"这些博物馆文物是在 Al-Mawsil 附近找回的。"}]}],"synonyms":["Mosul","Al Mawṣil","al-Mawsil"],"phonetic":"/ɑl ˈmɔsɪl/","extraExplanation":["“Al-” 是阿拉伯语定冠词，相当于英语的 “the”。因此在某些语境里，Al-Mawsil 可理解为“（那座）摩苏尔”。","Al-Mawsil 常见于阿拉伯语新闻、历史著作与地图标注；英语中更常用的对应写法是 “Mosul”。","该地名在不同语言与转写系统中可能出现不同拼写（如 Al Mawṣil / al-Mawsil），属于从阿拉伯字母到拉丁字母的音译差异。"]}
{"word":"al-Murabitun","summary":{"en":"Al-Murabitun is the Arabic name for the Almoravid dynasty/movement in 11th–12th century North Africa and al-Andalus.","zh":"al-Murabitun 是阿拉伯语名称，指11—12世纪活跃于北非与安达卢斯的穆拉比特王朝/运动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Almoravids: a Berber Muslim dynasty and reform movement that rose in the 11th century in North Africa and later ruled parts of Morocco, Western Sahara, and al-Andalus (Islamic Spain).","zh":"穆拉比特王朝／阿尔穆拉比通：11世纪兴起于北非的柏柏尔人伊斯兰改革运动与王朝，后来统治过摩洛哥、西撒哈拉一带，并进入统治过安达卢斯（伊斯兰西班牙）的部分地区。"},"examples":[{"en":"Al-Murabitun expanded their rule into al-Andalus after being invited to help against Christian kingdoms.","zh":"阿尔穆拉比通在受邀协助对抗基督教诸王国后，将势力扩展到安达卢斯。"},{"en":"Many history books call al-Murabitun the Almoravids in English.","zh":"许多历史书在英文中把 al-Murabitun 称作 Almoravids（穆拉比特王朝）。"}]}],"synonyms":["Almoravids","al-Murābiṭūn"],"phonetic":"/ˌæl məˈræbɪtuːn/","extraExplanation":["“al-”是阿拉伯语定冠词，意思相当于英语的“the”。因此 al-Murabitun 常可理解为“那些……的人/团体”。","该名称常见多种拼写：al-Murabitun / al-Murābiṭūn（更接近阿语转写）/ Almoravids（英语中更常用的历史称呼）。","词源上与阿拉伯语 *ribat*（边防要塞/修道式据点）相关，因而常被解释为“驻守要塞的虔修者/战士”。"]}
{"word":"al-Muwahhidun","summary":{"en":"Al-Muwahhidun is the Arabic name for the Almohads, a major Muslim movement and dynasty in North Africa and medieval Spain.","zh":"al-Muwahhidun 是“阿尔摩哈德王朝／穆瓦希德派”的阿拉伯语名称，指中世纪北非与西班牙的重要穆斯林运动与王朝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) The Almohads: a Berber Muslim reform movement and dynasty that ruled large parts of North Africa and Islamic Spain (al-Andalus) in the 12th–13th centuries.","zh":"（历史）穆瓦希德派／穆瓦希德王朝（即“阿尔摩哈德王朝”）：一个柏柏尔人主导的穆斯林改革运动与王朝，12—13世纪统治北非大片地区及伊比利亚半岛的伊斯兰西班牙（安达卢斯）。"},"examples":[{"en":"Al-Muwahhidun replaced the Almoravids and built a powerful empire across Morocco and Spain.","zh":"穆瓦希德派取代了阿尔摩拉维德王朝，并在摩洛哥与西班牙建立起强大的帝国。"},{"en":"Many histories of al-Andalus discuss the cultural changes under al-Muwahhidun rule.","zh":"许多关于安达卢斯的历史都会讨论穆瓦希德派统治时期的文化变化。"}]}],"synonyms":["Almohads","al-Muwaḥḥidūn","Muwaḥḥidūn"],"phonetic":"/ˌæl mʊˈwɑːhɪˌduːn/","extraExplanation":["“al-Muwahhidun”（الموحدون）字面意思是“主张独一真主的人／一神论者”，常译作“统一论者”。在英语史学里更常见的对应名称是 **Almohads**（阿尔摩哈德王朝）。","该政权以宗教改革与严格的一神论教义著称，并在政治与军事上影响了北非与伊比利亚半岛的格局；重要事件常包括与基督教王国的对抗以及伊比利亚局势的变化。","拼写提示：也常见写法 **al-Muwahhidūn / al-Muwaḥḥidūn**（带长音或点号的学术转写）；大小写与连字符在不同书籍中可能不一致。"]}
{"word":"Al-Nashar","summary":{"en":"Al‑Nashar is an Arabic-origin surname; it is often understood as relating to “the publisher” or “the spreader/distributor” in Arabic meaning.","zh":"Al‑Nashar 是源自阿拉伯语的姓氏；其词义常被理解为与“出版者”或“传播/散布者”相关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An Arabic-origin family name (surname), written in English as a transliteration (a spelling that represents the original Arabic sounds).","zh":"一个源自阿拉伯语的姓氏（家族名），英语中通常以音译方式拼写（用字母表示阿拉伯语发音）。"},"examples":[{"en":"Dr. Al‑Nashar will present the research findings today.","zh":"Al‑Nashar 博士今天将介绍研究结果。"},{"en":"My classmate’s last name is Al‑Nashar.","zh":"我同学的姓是 Al‑Nashar。"}]},{"partOfSpeech":"other","definition":{"en":"In Arabic meaning, it is commonly linked to the idea of “the publisher” or “the one who spreads/distributes (news, information),” and appears as a surname in some families.","zh":"从阿拉伯语词义上看，它常与“出版者 / 传播者（消息、信息的人）”相关，并在一些家族中作为姓氏使用。"},"examples":[{"en":"The author, Al‑Nashar, spoke about publishing and media.","zh":"作者 Al‑Nashar 谈到了出版与媒体。"},{"en":"Some Arabic surnames like Al‑Nashar connect to traditional occupations or roles.","zh":"一些阿拉伯姓氏（如 Al‑Nashar）与传统职业或社会角色有关。"}]}],"synonyms":["(surname; no direct English synonym)"],"phonetic":"/ˌɑl nəˈʃɑr/","extraExplanation":["“Al- / al-（الـ）”是阿拉伯语里的定冠词，意思是“这个/这些、该……”，常见于姓氏与地名（如 Al‑Fulan）。在英语里有时会写成 Al, el, Al‑ 等不同形式。","“Nashar / Nāshir”常与阿拉伯语词根 n‑sh‑r（ن‑ش‑ر）有关，含义可延伸到“发布、传播、散布”。因此作为姓氏时，可能与出版、传播或相关社会身份有关（具体家族含义仍可能不同）。"]}
{"word":"al-Qaeda","summary":{"en":"a militant Islamist group known internationally for terrorism","zh":"一个以恐怖主义活动闻名的激进伊斯兰主义组织"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a militant Islamist organization founded in the late 1980s, internationally known for planning and carrying out terrorist attacks","zh":"一个成立于20世纪80年代末的激进伊斯兰主义武装组织，因策划并实施恐怖袭击而在国际上广为人知"},"examples":[{"en":"After the 9/11 attacks, many countries increased security efforts against al-Qaeda.","zh":"9·11袭击后，许多国家加强了针对该组织的安全行动。"},{"en":"News reports said the group’s leadership had moved across borders several times.","zh":"新闻报道说，该组织的领导层曾多次跨境转移。"}]}],"synonyms":["al-Qaida","AQ"],"phonetic":"/ˌæl ˈkaɪdə/","extraExplanation":["这是一个专有名词，常出现在新闻与国际政治语境中。讨论相关话题时，注意区分“宗教/文化群体”与“极端组织”，避免把极端主义等同于任何普通信仰者或民族。"],"etymology":"源自阿拉伯语 al-qāʿida，字面意思是“基地/基础（the base）”。英文里常见多种拼写（如 al-Qaeda / al-Qaida），属于音译差异。","mnemonic":["把它记成“基地”：阿拉伯语本义就是“基地/根据地”，中文媒体也常译作“基地组织”。"]}
{"word":"al-Quran","summary":{"en":"The Qur’an (al-Quran) is the holy book of Islam.","zh":"《古兰经》（al-Quran/Qur’an）是伊斯兰教的经典。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The holy book of Islam, believed by Muslims to be the word of God (Allah) revealed to the Prophet Muhammad; also written “Qur’an.”","zh":"《古兰经》（亦作 Qur’an），伊斯兰教的经典；穆斯林相信它是真主（安拉）启示给先知穆罕默德的言辞。"},"examples":[{"en":"Muslims recite passages from the Qur’an in daily prayers.","zh":"穆斯林在日常礼拜中诵读《古兰经》经文。"},{"en":"She is studying the Qur’an in Arabic and in translation.","zh":"她正在学习阿拉伯语原文和译文的《古兰经》。"},{"en":"The museum displayed manuscripts of the Qur’an from different centuries.","zh":"博物馆展出了不同时代的《古兰经》手抄本。"}]}],"synonyms":["Qur’an","Koran"],"phonetic":"/ˌæl kʊˈrɑːn/","extraExplanation":["“al-”在阿拉伯语里常相当于英语的“the”，所以“al-Qur’an”字面上可理解为“那部《诵读之书》”。英语中更常见的拼写是“Qur’an”；“Koran”是较旧的拼写变体。","在英语写作中，它通常被当作专有名词使用，常见搭配有：recite the Qur’an（诵读《古兰经》）、Qur’anic verses（古兰经经文）、Qur’anic Arabic（古兰经阿拉伯语）。在宗教语境里，谈到它的内容时常用“verses（经文）”“chapters/surahs（章/苏拉）”等词。"]}
{"word":"al-Sudan","summary":{"en":"al-Sudan usually means Sudan; in older historical Arabic contexts it can refer more broadly to lands south of the Sahara (Bilad al-Sudan).","zh":"al-Sudan 通常指“苏丹”；在较旧的历史阿拉伯语语境中也可能泛指撒哈拉以南的“黑人之地/地区”（Bilad al-Sudan）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Sudan (the country in Northeast Africa). “Al-” is the Arabic word for “the,” sometimes shown in older spellings.","zh":"苏丹（东北非国家）。“al-”是阿拉伯语里的“the（定冠词）”，在一些较旧的拼写中会被保留下来。"},"examples":[{"en":"Sudan (sometimes written as al-Sudan in older sources) lies along the Nile River.","zh":"苏丹（一些较旧资料里也写作 al-Sudan）位于尼罗河沿岸。"},{"en":"News reports discussed flooding in Sudan after heavy rains.","zh":"新闻报道讨论了强降雨后苏丹的洪水情况。"}]},{"partOfSpeech":"n.","definition":{"en":"A historical Arabic term referring broadly to the “land(s) of the blacks,” used for parts of sub-Saharan Africa in medieval geography (often in the phrase Bilad al-Sudan).","zh":"历史上的阿拉伯语用法，泛指“黑人之地/黑人的国度”，在中世纪地理语境中指撒哈拉以南非洲的一些地区（常见于短语 Bilad al-Sudan）。"},"examples":[{"en":"Medieval writers used the phrase Bilad al-Sudan to describe regions south of the Sahara.","zh":"中世纪作者用 Bilad al-Sudan 来描述撒哈拉以南的地区。"},{"en":"In historical texts, al-Sudan doesn’t always mean the modern country of Sudan.","zh":"在历史文本里，al-Sudan 不一定指今天的苏丹这个国家。"}]}],"synonyms":["Sudan","the Republic of the Sudan"],"phonetic":"/suˈdɑn/","extraExplanation":["“السودان”(as-sūdān / al-sūdān) 源自阿拉伯语词根，意思与“黑色的（人）”相关；早期阿拉伯地理学中常用来概括撒哈拉以南的广大地区，所以在阅读旧文献时要注意它可能是“地区概念”，不等同于现代国名。","关于拼写：阿拉伯语定冠词是 al-，但在某些音变规则下常写作 as-（例如 s 开头的词），因此你可能会看到 as-Sudan / al-Sudan 等不同转写形式。"]}
{"word":"al-Sufi","summary":{"en":"Al‑Sufi most commonly refers to a famous 10th‑century Persian astronomer known for The Book of Fixed Stars; it can also be the name of a Moon crater.","zh":"Al‑Sufi 通常指10世纪著名的波斯天文学家（《恒星之书》作者）；也可指以他命名的月球撞击坑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A 10th‑century Persian astronomer (ʿAbd al‑Raḥmān al‑Ṣūfī) famous for carefully describing stars and constellations and for an early written description of the Andromeda Galaxy.","zh":"（专有名词）10世纪的波斯天文学家阿卜杜勒·拉赫曼·苏菲（ʿAbd al‑Raḥmān al‑Ṣūfī），以对恒星与星座的细致记载闻名，并留下对仙女座星系的早期文字描述。"},"examples":[{"en":"Al‑Sufi wrote The Book of Fixed Stars, which improved star positions and brightness estimates.","zh":"苏菲撰写了《恒星之书》，改进了恒星位置与亮度的记录。"},{"en":"Some historians credit al‑Sufi with one of the earliest descriptions of the “little cloud” we now call the Andromeda Galaxy.","zh":"一些历史学者认为苏菲对“微小的云团”（即今天的仙女座星系）做出了最早的描述之一。"},{"en":"In class, we discussed how al‑Sufi’s work helped bridge Greek astronomy and later Islamic and European science.","zh":"课堂上我们讨论了苏菲的工作如何连接希腊天文学，并影响后来的伊斯兰与欧洲科学。"}]},{"partOfSpeech":"n.","definition":{"en":"(Astronomy) A lunar impact crater named after the astronomer al‑Sufi.","zh":"（天文学）月球上一座以天文学家苏菲命名的撞击坑。"},"examples":[{"en":"The map labels a crater near the Moon’s southern highlands as Al‑Sufi.","zh":"地图将月球南部高地区附近的一个撞击坑标注为 Al‑Sufi（苏菲坑）。"}]}],"synonyms":["ʿAbd al‑Raḥmān al‑Ṣūfī","Abd al-Rahman al-Sufi","Azophi"],"phonetic":"/ˌæl suːˈfiː/","extraExplanation":["“al-”是阿拉伯语定冠词，相当于英语的“the”，常出现在阿拉伯姓名或称号中。","al‑Sufi 的主要著作常译为《恒星之书》（Book of Fixed Stars，964年左右完成），它在托勒密《天文学大成》的基础上，加入了更细致的星等（亮度）描述与星图传统。","在英语资料中也常见写法：Al Sufi、al Sufi、Abd al‑Rahman al‑Sufi（不同学术转写系统会导致拼写差异）。"]}
{"word":"Al-Tawil","summary":{"en":"Al-Tawil is an Arabic-origin name meaning “the tall/long,” and it can also refer to a famous classical Arabic poetic meter called al-ṭawīl.","zh":"Al-Tawil 是阿拉伯语来源的姓名/姓氏，意为“高的/长的”；它也可指阿拉伯古典诗歌中著名的格律 al-ṭawīl。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A name or surname of Arabic origin meaning “the tall/long,” often used as a family name (Al-Tawil / Al Tawil / al-Ṭawīl).","zh":"一个阿拉伯语来源的人名或姓氏，意思是“高的/长的”，常用作家族姓氏（Al-Tawil / Al Tawil / al-Ṭawīl）。"},"examples":[{"en":"Dr. Al-Tawil will speak at the conference tomorrow.","zh":"Al-Tawil 医生明天将在会议上发言。"},{"en":"In the article, Al Tawil is cited as the lead author.","zh":"在文章中，Al Tawil 被引用为第一作者。"}]},{"partOfSpeech":"n.","definition":{"en":"In Arabic literature, al-ṭawīl: a classical Arabic poetic meter (a traditional rhythm pattern) used in many famous poems.","zh":"在阿拉伯文学中，al-ṭawīl：一种古典阿拉伯诗歌格律（传统的节奏模式），常见于许多著名诗作。"},"examples":[{"en":"The poem is written in al-ṭawīl, a meter known for its long rhythmic line.","zh":"这首诗使用 al-ṭawīl 格律，以节奏线条较长而著称。"},{"en":"Students of classical Arabic poetry often learn al-ṭawīl early.","zh":"学习古典阿拉伯诗歌的学生往往较早接触 al-ṭawīl。"}]}],"synonyms":["al-Ṭawīl","Al Tawil","al-Tawil"],"phonetic":"/ˌɑːl tɑːˈwiːl/","extraExplanation":["“Al- / al-”是阿拉伯语定冠词，意思相当于英语的“the”。因此 Al‑Tawil 字面可理解为“那个高的/长的”。在不同国家与不同拉丁字母转写体系中，你可能会看到 Al-Tawil、Al Tawil、al-Tawil、al-Ṭawīl 等多种拼写。","作为格律名的 al‑ṭawīl 在英文学术写作中常被直接音译使用（italic 或小写），指阿拉伯古典诗歌中非常重要的一种韵律模式。"]}
{"word":"Al-Tweel","summary":{"en":"Al-Tweel is an Arabic-origin surname; it can carry the meaning “the tall/long.”","zh":"Al-Tweel 是阿拉伯语来源的姓氏，也可带有“高的/长的”的含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a personal or family name (Arabic-origin surname), often written in Latin letters as Al-Tweel/Al-Tawil/Al-Tweil.","zh":"人名或姓氏（阿拉伯语来源的姓），常见拉丁字母拼写有 Al-Tweel / Al-Tawil / Al-Tweil 等。"},"examples":[{"en":"Ms. Al-Tweel will lead the workshop on Monday.","zh":"Al-Tweel 女士将于周一主持这场工作坊。"},{"en":"His last name is Al-Tweel, and it’s sometimes spelled Al-Tawil in English documents.","zh":"他的姓是 Al-Tweel，在英文文件里有时也拼作 Al-Tawil。"}]},{"partOfSpeech":"other","definition":{"en":"(from Arabic) “the tall” or “the long,” used as a descriptive name.","zh":"（源自阿拉伯语）意为“高的/长的”，可作为带描述含义的姓或称呼。"},"examples":[{"en":"In Arabic, the name Al-Tweel can suggest “the tall.”","zh":"在阿拉伯语里，Al-Tweel 这个姓可能带有“高个子”的含义。"},{"en":"Families sometimes keep descriptive surnames like Al-Tweel for many generations.","zh":"有些家族会把像 Al-Tweel 这种“描述型姓氏”沿用很多代。"}]}],"synonyms":["Al-Tawil","Al-Tweil"],"phonetic":"/ˌɑl tɑːˈwiːl/","extraExplanation":["“Al-”在阿拉伯语里常是定冠词，类似英语的“the”。后面的词来自“ṭawīl（长的/高的）”。因为从阿拉伯语转写到英语没有唯一标准，所以你会看到 Tweel / Tawil / Tweil 等不同拼法。","如果这是具体某个人或家族的拼写（例如护照/证件上的拼法），通常应以其本人或官方文件为准。"]}

