{"word":"ALC","summary":{"en":"ALC is an abbreviation that most commonly means “alcohol,” and can also mean “automatic level control” in audio or (sometimes) “Associate in Liberal Arts” in education.","zh":"ALC是缩写，最常见指“酒精/酒”，在音频领域也可指“自动电平控制”，在教育语境中有时指“文科副学士”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation for “alcohol,” especially on labels, forms, or in medical notes.","zh":"“alcohol（酒精/酒）”的缩写，常见于标签、表格或医疗记录中。"},"examples":[{"en":"This sanitizer is 70% ALC.","zh":"这款消毒液含有70%的酒精（ALC）。"},{"en":"Patient reports no ALC use.","zh":"患者表示不饮酒/不使用酒精（ALC）。"}]},{"partOfSpeech":"other","definition":{"en":"In audio/electronics, “automatic level control”: a system that keeps volume or signal level steady.","zh":"在音频/电子领域指“automatic level control（自动电平控制）”：用于让音量或信号强度保持稳定的系统。"},"examples":[{"en":"Turn on ALC to reduce sudden loud peaks.","zh":"打开ALC来减少突然出现的音量峰值。"},{"en":"The radio’s ALC helps keep the signal from clipping.","zh":"收音机的ALC有助于防止信号过载失真。"}]},{"partOfSpeech":"other","definition":{"en":"In education (U.S.), sometimes “Associate in Liberal Arts”: a two-year college degree (usage varies by school).","zh":"在美国教育语境中，有时指“Associate in Liberal Arts（文科副学士）”：两年制学位（各校用法可能不同）。"},"examples":[{"en":"She earned an ALC before transferring to a university.","zh":"她先拿到ALC（文科副学士）再转学到大学。"}]}],"synonyms":["alcohol (when meaning ALC)","automatic level control (when meaning ALC)"],"phonetic":"/ˌeɪ ɛl ˈsiː/","extraExplanation":["ALC是缩写，含义非常依赖语境：在日常生活/医疗记录里更常指“酒精”；在音频设备说明书里更常指“自动电平控制”。如果你告诉我你在哪里看到ALC（比如药瓶标签、收音机菜单、学校课程表），我可以帮你锁定最准确的意思。"]}
{"word":"alc","summary":{"en":"“alc/ALC” most commonly means “alcohol,” and in medical contexts it can mean “absolute lymphocyte count.”","zh":"“alc/ALC”最常指“酒精/饮酒”，在医学语境中也可能指“绝对淋巴细胞计数”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) alcohol; used in labels or medical notes to mean alcoholic drinks or alcohol content.","zh":"（缩写）酒精／含酒精饮品；常见于标签或医疗记录中，表示酒类或酒精含量。"},"examples":[{"en":"This hand sanitizer is 70% alc.","zh":"这款免洗洗手液含 70% 酒精。"},{"en":"Patient reports no alc use.","zh":"患者报告不饮酒（无酒精摄入）。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., medicine) absolute lymphocyte count; a blood-test value showing the number of lymphocytes.","zh":"（缩写，医学）绝对淋巴细胞计数；血液检查指标，表示淋巴细胞的数量。"},"examples":[{"en":"Her ALC is low, so the doctor ordered more tests.","zh":"她的 ALC 偏低，所以医生安排了进一步检查。"},{"en":"The report lists WBC, ANC, and ALC.","zh":"报告中列出了 WBC（白细胞）、ANC（绝对中性粒细胞计数）和 ALC。"}]}],"synonyms":["alcohol (abbr.)","EtOH (medical shorthand for alcohol)"],"phonetic":"/ˌeɪˌɛlˈsiː/","extraExplanation":["“alc/ALC”是缩写，具体含义非常依赖语境：食品/日用品标签、聊天里多指 alcohol；在化验单或病历里大写 ALC 更常指 absolute lymphocyte count（绝对淋巴细胞计数）。","如果你能提供完整句子或出处（例如聊天、配料表、体检报告），我可以帮你确定最准确的意思。"]}
{"word":"Alca","summary":{"en":"Alca is mainly a scientific genus name for an auk seabird (especially the razorbill). It can also be an acronym depending on context.","zh":"Alca 主要是海雀类海鸟的属名（尤其指剃刀海雀所属属）。它也可能是缩写，含义需看上下文。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus name in biology for certain seabirds in the auk family (Alcidae), especially the razorbill (Alca torda).","zh":"（生物学）海鸟“海雀科”（Alcidae）中某些鸟类的属名，尤指“刀嘴海雀/剃刀海雀”（razorbill，学名 Alca torda）所属的“海雀属”（Alca）。"},"examples":[{"en":"The razorbill’s scientific name is Alca torda.","zh":"剃刀海雀的学名是 Alca torda。"},{"en":"In older field guides, you may see the genus Alca used for certain auks.","zh":"在一些较早的野外鸟类图鉴里，你可能会看到用 Alca 这个属名来指某些海雀。"}]},{"partOfSpeech":"n.","definition":{"en":"a name that can also appear as an acronym (ALCA) in different fields; its meaning depends on context.","zh":"也可能作为缩写（ALCA）出现在不同领域；具体含义取决于上下文。"},"examples":[{"en":"In this document, ALCA refers to a regional trade proposal, not a bird.","zh":"在这份文件里，ALCA 指的是一项区域贸易提案，而不是鸟类。"}]}],"synonyms":["razorbill","auk"],"phonetic":"/ˈælkə/","extraExplanation":["作为生物分类名时，Alca 来自拉丁语/新拉丁语传统命名。日常英语里更常用的是普通名 razorbill（剃刀海雀）或更广义的 auk（海雀）。","如果你是在特定文章或学科里看到“ALCA”，建议提供一句原文或上下文，我可以帮你确定它是哪一种缩写。"]}
{"word":"alca","summary":{"en":"Alca is a scientific genus name for certain seabirds (auks), especially the razorbill.","zh":"Alca 是某些海雀类海鸟的科学属名，尤其指刀嘴海雀所属的属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) A genus of seabirds in the auk family, especially known for the razorbill (Alca torda).","zh":"（生物）海雀科的一属海鸟，最知名的是刀嘴海雀（Alca torda）。"},"examples":[{"en":"The razorbill belongs to the genus Alca.","zh":"刀嘴海雀属于 Alca（海雀属）。"},{"en":"In older field guides, you may see Alca used in scientific names for auks.","zh":"在较早的鸟类图鉴里，你可能会看到 Alca 用在海雀类的学名中。"}]}],"synonyms":["auk","razorbill (for Alca torda)"],"phonetic":"/ˈælkə/","extraExplanation":["“Alca”是拉丁化的科学属名，常见于鸟类学（ornithology）和分类学（taxonomy）语境中。日常英语里更常说“razorbill（刀嘴海雀）”或“auk（海雀）”，而不是直接说“Alca”。"]}
{"word":"Alcaaba","summary":{"en":"Alcaaba is an uncommon spelling that usually refers to the Kaaba in Mecca, Islam’s most sacred site.","zh":"Alcaaba 是不常见的拼写，通常指麦加的克尔白（伊斯兰最神圣的地点之一）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A less common spelling/romanization referring to the Kaaba (al-Kaaba), the cube-shaped sacred building at the center of the Great Mosque in Mecca, Saudi Arabia.","zh":"一种较少见的拼写/拉丁转写形式，指“克尔白”（al-Kaaba/Kaaba）——位于沙特阿拉伯麦加禁寺中心的立方体圣殿。"},"examples":[{"en":"Many Muslims face the Kaaba during daily prayer.","zh":"许多穆斯林在日常礼拜时面向克尔白。"},{"en":"Pilgrims walk around the Kaaba during Hajj.","zh":"朝觐者在朝觐期间绕行克尔白。"}]}],"synonyms":["Kaaba","al-Kaaba"],"phonetic":"æl ˈkɑːbə","extraExplanation":["“Alcaaba”并不是现代英语里最常见的写法；更常见的是 Kaaba 或 al-Kaaba（阿拉伯语里 al- 表示“这/该”，相当于定冠词“the”）。不同语言与时代的转写方式会导致拼写差异。","文化语境提示：克尔白对伊斯兰信仰具有极高神圣性。使用时建议保持尊重，避免把它当作普通旅游景点随意调侃。"]}
{"word":"alcaaba","summary":{"en":"“alcaaba” is most likely a spelling of Kaaba (al-Kaaba), the sacred shrine in Mecca.","zh":"“alcaaba” 多半是 Kaaba（al-Kaaba）的拼写，指麦加的圣殿克尔白。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often written Kaaba or al-Kaaba) the cube-shaped shrine in Mecca, Saudi Arabia, which Muslims face during prayer and visit during the Hajj pilgrimage.","zh":"（常写作 Kaaba 或 al-Kaaba）位于沙特阿拉伯麦加的立方体圣殿；穆斯林礼拜时面向的方向（朝向），并在朝觐（Hajj）时前往的重要圣地。"},"examples":[{"en":"Muslims around the world pray facing the Kaaba.","zh":"世界各地的穆斯林礼拜时都面向克尔白（Kaaba）。"},{"en":"During Hajj, pilgrims gather around the Kaaba.","zh":"在朝觐期间，朝觐者会聚集在克尔白周围。"}]}],"synonyms":["Kaaba","al-Kaaba","Ka‘bah"],"phonetic":"/ˈkɑːbə/","extraExplanation":["“alcaaba” 不是英语里最常见的拼写；你可能想写的是 **Kaaba** 或 **al-Kaaba**（其中 **al-** 是阿拉伯语定冠词，相当于英语 the）。","在英语新闻与宗教/历史写作中更常见的拼写有 **Kaaba, al-Kaaba, Ka‘bah** 等；中文常译为“克尔白”或“卡巴”。","这是一个宗教敏感词汇；在跨文化交流中，使用中性、尊重的表达（如 the Kaaba / the Kaaba in Mecca）通常更合适。"]}
{"word":"alcabala","summary":{"en":"Alcabala is a historical Spanish/colonial sales tax on goods transactions.","zh":"Alcabala 指西班牙及其殖民地历史上的一种商品交易税/销售税。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A historical sales tax in Spain and the Spanish Empire, especially used in colonial Latin America, charged on the sale or transfer of goods (and sometimes property).","zh":"（历史）阿尔卡瓦拉税：西班牙及其帝国（尤指拉丁美洲殖民地）对商品买卖或转让（有时也包括财产转移）征收的一种营业/交易税。"},"examples":[{"en":"In colonial Mexico, the alcabala increased the cost of everyday goods.","zh":"在殖民时期的墨西哥，阿尔卡瓦拉税抬高了日常商品的价格。"},{"en":"Merchants often complained that the alcabala hurt local trade.","zh":"商人常抱怨阿尔卡瓦拉税损害了本地贸易。"}]}],"synonyms":["sales tax","transaction tax","excise tax"],"phonetic":"ˌɑlkəˈbɑlə","extraExplanation":["“alcabala”源自西班牙语，进一步可追溯到阿拉伯语词源，反映了伊比利亚半岛历史上阿拉伯文化的影响。","在西属美洲，alcabala 通常由殖民政府征收，是重要财政来源之一，也常被视为对商业活动的负担，因而在社会与经济史叙述中经常出现。","阅读历史文本时可将其理解为一种“交易税/销售税”，但它的征收范围、税率与执行方式会因时代与地区而不同。"]}
{"word":"alcade","summary":{"en":"Alcade (usually spelled alcalde) means a mayor or chief local official in Spanish-speaking places.","zh":"alcade（通常写作 alcalde）指西班牙语地区的市长或主要地方官员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in Spanish-speaking countries or communities) a mayor or a chief local government official.","zh":"（尤指西班牙语国家或社区的）市长；地方行政长官。"},"examples":[{"en":"The alcalde met with residents to discuss public safety.","zh":"市长与居民会面讨论公共安全问题。"},{"en":"In some towns, the alcalde is the main local authority.","zh":"在一些城镇里，市长是主要的地方行政官员。"}]}],"synonyms":["mayor","local chief","town mayor"],"phonetic":"/ælˈkɑːldi/","extraExplanation":["“alcade”通常是拼写错误，更常见、标准的形式是 **alcalde**（西语借词）。","词源来自西班牙语 *alcalde*，再往前与阿拉伯语的“法官/裁判”相关；因此在历史语境里它有时也可指地方行政与司法权力兼具的官员。","在英语材料中，这个词多见于关于西班牙、拉丁美洲或美国西南部历史/文化的文章与小说中，用来保留当地制度与文化色彩。"]}
{"word":"alcades","summary":{"en":"Alcalde means a mayor or local magistrate in Spanish-speaking regions (plural: alcaldes).","zh":"Alcalde 指西语地区的“市长/地方行政长官”（复数：alcaldes）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Spain, parts of Latin America, and historically in Portugal) a mayor or local magistrate.","zh":"（在西班牙、部分拉丁美洲；历史上也用于葡萄牙）市长；地方行政长官（或地方法官）。"},"examples":[{"en":"The town elected a new alcalde after the old one retired.","zh":"这座小镇在老市长退休后选出了新的市长（alcalde）。"},{"en":"She met with the alcalde to discuss public safety and street lighting.","zh":"她与市长（alcalde）会面，讨论公共安全和路灯问题。"}]}],"synonyms":["mayor","magistrate","local official"],"phonetic":"/ælˈkɑːldi/","extraExplanation":["“alcades”更常见是拼写错误，标准拼写通常是 **alcaldes**（复数）或 **alcalde**（单数）。","该词来自西班牙语 **alcalde**，词源可追溯到阿拉伯语 **al-qāḍī**，原意与“法官”相关，因此在历史语境中也可能带有“地方法官/行政司法官”的含义。","英语里使用该词多见于新闻报道、历史写作或涉及西班牙语国家政治制度的语境；如果只是泛指“市长”，用 **mayor** 更常见。"]}
{"word":"Alcae","summary":{"en":"Alcae is a rare, mostly scientific term used in older taxonomy for a group of auks (Alcidae), sometimes linked to the genus *Alca*.","zh":"Alcae 是较少见、主要用于旧式生物分类的术语，指海雀科（Alcidae）中的一组海鸟，有时与海雀属（*Alca*）相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology, taxonomy) A former scientific grouping (a tribe/subfamily) of seabirds in the auk family (Alcidae), sometimes including the genus *Alca* (e.g., razorbills and related auks).","zh":"（动物学／分类学）海雀科（Alcidae）中曾使用过的一种分类群（如“族／亚科”等），有时包括海雀属（*Alca*，如剃刀海雀等）及其近缘种。"},"examples":[{"en":"In older bird guides, you may see Alcae used for a group of auks within the family Alcidae.","zh":"在较早的鸟类图鉴里，你可能会看到 Alcae 用来指海雀科中的一组海鸟。"},{"en":"Modern classifications often avoid Alcae and use updated ranks and names instead.","zh":"现代分类法往往不再使用 Alcae，而改用更新的等级与名称。"}]},{"partOfSpeech":"n.","definition":{"en":"A Latin-style plural form sometimes used for members of the genus *Alca* (auks), though this is uncommon in everyday English.","zh":"一种拉丁式复数写法，有时用来指海雀属（*Alca*）的成员，但在日常英语中并不常见。"},"examples":[{"en":"The text lists *Alca* and related birds; occasionally you might see the plural written as Alcae in older sources.","zh":"文献会列出 *Alca* 及相关鸟类；在较老的资料中偶尔会把复数写成 Alcae。"}]}],"synonyms":["auks","Alcidae"],"phonetic":"/ˈæl.si/","extraExplanation":["这个词更多出现在生物分类或旧式学术写作中，不是常见的通用词汇。不同年代、不同学者对海雀科内部的细分方式不一样，所以你会看到像 Alcae 这类“旧分类名”在现代资料中被更常用、更新的分类方案取代。","如果你是在阅读某篇论文或图鉴里遇到 Alcae，建议同时查看该书的分类系统说明（taxonomy/classification section），以确认作者具体把哪些鸟类归入其中。"]}
{"word":"alcae","summary":{"en":"Algae are plant-like organisms, often in water, ranging from tiny cells to seaweed.","zh":"藻类是常见于水中的类植物生物，从微小单细胞到大型海藻都有。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"simple plants (often found in water) that can range from tiny single-celled organisms to large seaweeds; they use sunlight to make food","zh":"藻类（多生活在水中）的总称，大小从微小的单细胞生物到大型海藻不等；通过阳光进行光合作用制造养分"},"examples":[{"en":"Algae grew on the rocks along the river.","zh":"河边的岩石上长了藻类。"},{"en":"The pond turned green because of too much algae.","zh":"池塘因为藻类过多而变绿了。"},{"en":"Some algae are used to make food products like seaweed snacks.","zh":"有些藻类会被用来制作食品，比如海苔零食。"}]}],"synonyms":["seaweed","pond scum (informal)","kelp (a type of seaweed)"],"phonetic":"/ˈæl.dʒiː/","extraExplanation":["你输入的“alcae”很可能是拼写错误，常见正确拼写是“algae”（藻类）。英语里它是复数形式，但在日常用法中也常被当作不可数名词来用（例如：There is algae in the pool）。","词源来自拉丁语“alga”（海藻）。在科学语境里，algae 指很多不同类型的光合生物；日常生活里常指水面或石头上那层绿色的“水藻/青苔状物”。"]}
{"word":"Alcaeus","summary":{"en":"Alcaeus: an ancient Greek lyric poet from Lesbos, known for political verse and songs about wine and friendship.","zh":"Alcaeus：古希腊莱斯博斯岛的抒情诗人，以政治诗与酒歌、友情主题闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient Greek lyric poet from the island of Lesbos (c. 620–560 BCE), famous for political poems and songs about wine, friendship, and love.","zh":"阿尔凯俄斯：古希腊莱斯博斯岛的抒情诗人（约公元前620–560年），以政治诗、酒歌以及关于友情与爱情的作品著称。"},"examples":[{"en":"Alcaeus is often mentioned together with Sappho as a major voice of early Greek lyric poetry.","zh":"阿尔凯俄斯常与萨福并列，被视为早期希腊抒情诗的重要代表。"},{"en":"In class, we read a fragment of Alcaeus describing a storm as a metaphor for political turmoil.","zh":"课堂上我们读了阿尔凯俄斯的一段残篇，他用暴风雨来隐喻政治动荡。"}]},{"partOfSpeech":"n.","definition":{"en":"A personal name used in history and literature; it most commonly refers to the poet Alcaeus when capitalized.","zh":"人名（历史与文学中使用）；大写时最常指那位诗人阿尔凯俄斯。"},"examples":[{"en":"The essay compares Alcaeus’s public, political tone with Sappho’s more personal lyric style.","zh":"这篇文章对比了阿尔凯俄斯偏公共、政治性的语气与萨福更私人化的抒情风格。"}]}],"synonyms":["Greek lyric poet","Sappho (related figure)","Horace (later influence)"],"phonetic":"/ælˈsiːəs/","extraExplanation":["阿尔凯俄斯的诗多以“残篇”（fragments）的形式保存下来，因为原作没有完整传世。你可能会在西方文学/古典学课程里以短段落或引文的方式见到他。","他常被认为与“阿尔开俄斯诗节（Alcaic stanza）”有关，这是一种后来被拉丁诗人（如贺拉斯 Horace）发展并广泛使用的诗体。"]}
{"word":"alcahest","summary":{"en":"Alcahest is an alchemical term for a mythical universal solvent that could dissolve anything.","zh":"Alcahest 是炼金术用语，指一种传说中的“万能溶剂”，被认为能溶解任何物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In alchemy) a supposed “universal solvent” that could dissolve any substance, often imagined as a key to transforming materials or discovering the philosopher’s stone.","zh":"（炼金术中）一种假想的“万能溶剂”，被认为能溶解任何物质，常被视为实现物质转化或寻找贤者之石的关键。"},"examples":[{"en":"In old alchemical writings, the alcahest was said to dissolve metals without being used up.","zh":"在古老的炼金术著作中，据说“万能溶剂”（alcahest）能溶解金属而自身不被消耗。"},{"en":"The novel uses “alcahest” as a symbol of a solution that can break down every problem.","zh":"这部小说把“alcahest”当作一种象征：能分解一切问题的终极解决之道。"}]}],"synonyms":["universal solvent","philosophers’ stone (related concept)"],"phonetic":"/ˈæl.kə.hɛst/","extraExplanation":["“alcahest”主要出现在欧洲近代早期的炼金术语境中，常与追求“贤者之石”、长生或金属转化等观念相连。现代化学并不存在真正能溶解一切物质的“万能溶剂”，所以它更多被当作历史概念或文学象征来使用。","词源通常被认为来自阿拉伯语化学术语（常见解释与“alkali/碱”等词族有关），后来进入拉丁语与欧洲语言体系。"]}
{"word":"alcahests","summary":{"en":"Alcahest (plural: alcahests) is an alchemical, imaginary universal solvent that could dissolve anything.","zh":"Alcahest（复数 alcahests）是炼金术中想象的“万能溶剂”，传说可溶解一切物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an imaginary “universal solvent” in alchemy, believed to be able to dissolve any substance","zh":"（炼金术中的）万能溶剂；传说中能溶解一切物质的溶剂"},"examples":[{"en":"In old alchemical texts, the alcahest was said to dissolve even gold.","zh":"在古老的炼金术文献里，alcahest 被说成甚至能溶解黄金。"},{"en":"The scientist dismissed the alcahest as a myth rather than a real chemical.","zh":"那位科学家认为 alcahest 是神话，而不是真实存在的化学物质。"}]}],"synonyms":["universal solvent","philosophers' solvent","alchemy (context)"],"phonetic":"/ˈæl.kəˌhɛst/","extraExplanation":["“Alcahest”主要出现在欧洲炼金术传统中，常与16–17世纪的炼金术士（如帕拉塞尔苏斯 Paracelsus 的思想背景）相关联，用来表达一种“能分解万物、提取本质”的理想化概念。","你输入的“alcahests”是复数形式：one alcahest / two alcahests。现代英语里该词很少用于日常化学，多用于历史、文学或象征性的语境。"]}
{"word":"Alcaic","summary":{"en":"Alcaic means “connected with Alcaeus” or “written in the Alcaic stanza,” a classical four-line metrical pattern; it can also name the stanza itself.","zh":"Alcaic 指“与阿尔卡俄斯有关的”或“采用阿尔卡俄斯诗节（古典四行格律）写成的”；也可作名词指这种诗节/诗体本身。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the ancient Greek poet Alcaeus, especially his style of lyric poetry","zh":"（尤指在抒情诗风格上）与古希腊诗人阿尔卡俄斯（Alcaeus）有关的；阿尔卡俄斯式的"},"examples":[{"en":"Scholars discuss the Alcaic tone of the poem—political, personal, and sharply lyrical.","zh":"学者们讨论这首诗的阿尔卡俄斯式语调——兼具政治性、个人性且抒情尖锐。"},{"en":"The author imitates Alcaic themes such as exile, friendship, and wine.","zh":"作者模仿了阿尔卡俄斯常写的主题，如流放、友谊与酒。"}]},{"partOfSpeech":"adj.","definition":{"en":"written in, or using, the Alcaic stanza (a classical four-line metrical pattern)","zh":"采用阿尔卡俄斯诗节（Alcaic stanza，一种古典四行格律诗节）的；阿尔卡俄斯诗节体的"},"examples":[{"en":"Horace is famous for his Alcaic odes in Latin literature.","zh":"贺拉斯在拉丁文学中以他的阿尔卡俄斯诗节颂歌闻名。"},{"en":"She tried composing an Alcaic stanza, but the strict rhythm was difficult.","zh":"她尝试写一段阿尔卡俄斯诗节，但严格的节奏很难掌握。"}]},{"partOfSpeech":"n.","definition":{"en":"an Alcaic stanza or Alcaic verse (poetry in that stanza form)","zh":"阿尔卡俄斯诗节；阿尔卡俄斯体诗（指采用该诗节形式的诗）"},"examples":[{"en":"The poem’s opening is an Alcaic that sets a solemn mood.","zh":"这首诗的开头是一段阿尔卡俄斯诗节，奠定了庄严的氛围。"},{"en":"In class, we scanned an Alcaic to hear how the stresses fall.","zh":"课堂上我们分析了一段阿尔卡俄斯体诗的格律，听重音如何落下。"}]}],"synonyms":["Alcaean","Alcaeus-related","Alcaic stanza (n.)","Alcaic verse (n.)"],"phonetic":"/ælˈkeɪɪk/","extraExplanation":["“Alcaic”源自古希腊抒情诗人阿尔卡俄斯（Alcaeus，约公元前6世纪）。在英语文学与古典学语境里，它最常指“阿尔卡俄斯诗节”（Alcaic stanza）：四行一节的固定格律形式。罗马诗人贺拉斯（Horace）用拉丁语大量改写并发扬这种诗节，因此在西方文学史中非常有名。日常英语里很少用到，主要出现在诗歌、古典文学或格律分析的讨论中。"]}
{"word":"alcaic","summary":{"en":"Alcaic means “related to Alcaeus,” especially the Alcaic stanza, a classical four-line lyric meter used by poets like Horace.","zh":"Alcaic 指“与阿尔开俄斯相关”，尤指古典的“四行一节”阿尔开俄斯诗节（格律），如贺拉斯常用的诗体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the ancient Greek poet Alcaeus, especially to the poetic meter called the Alcaic stanza (a four-line lyric stanza used in Greek and Latin poetry).","zh":"与古希腊诗人阿尔开俄斯（Alcaeus）有关的；尤指“阿尔开俄斯诗节（Alcaic stanza）”这种诗歌格律（四行一节的抒情诗体，常见于希腊与拉丁诗）。"},"examples":[{"en":"Horace often wrote in the Alcaic stanza, adapting a Greek form for Latin poetry.","zh":"贺拉斯常用阿尔开俄斯诗节写诗，把希腊的诗体改造为拉丁诗的形式。"},{"en":"The poem’s Alcaic rhythm gives it a formal, song-like movement.","zh":"这首诗的阿尔开俄斯节奏让它呈现出一种正式、如歌般的律动。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) an Alcaic stanza or poem written in that meter.","zh":"（较少见）阿尔开俄斯诗节；或用该格律写成的诗。"},"examples":[{"en":"The anthology includes a few Alcaics alongside odes in other meters.","zh":"这本选集中除了其他格律的颂诗外，也收录了几首阿尔开俄斯诗体的作品。"}]}],"synonyms":["Alcaean","Horatian (context-dependent)"],"phonetic":"/ælˈkeɪ.ɪk/","extraExplanation":["“Alcaic”来自古希腊抒情诗人阿尔开俄斯（Alcaeus，公元前7—6世纪，莱斯博斯岛）。他的诗体影响了后来的罗马诗人，尤其是贺拉斯（Horace）。","“Alcaic stanza（阿尔开俄斯诗节）”通常指四行一节的固定格律：前两行是阿尔开俄斯十一音步（Alcaic hendecasyllable），第三行较短（常称为九音步），第四行是十音步（Alcaic decasyllable）。学习时不必背细节，记住它是一种古典“固定节式”即可。","在英语诗歌批评或文学课程里，“Alcaic”多用于讨论古典传统、格律模仿（imitation）与诗体翻译（translation/adaptation）。"]}
{"word":"alcaiceria","summary":{"en":"Alcaicería means a traditional market district (often linked to silk and luxury goods), especially the famous historic market area in Granada, Spain.","zh":"Alcaicería 指一种传统集市/商业街区（历史上常与丝绸和奢侈品有关），也常特指西班牙格拉纳达著名的历史集市街区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a market (especially in Spain) traditionally associated with silk and luxury goods; often referring to a covered bazaar-like shopping area.","zh":"（尤指西班牙的）传统市场，原本多与丝绸和奢侈品买卖有关；也常指带拱廊或有顶棚、像集市（bazaar）一样的商业街区。"},"examples":[{"en":"We wandered through the Alcaicería, where small shops sold textiles and souvenirs.","zh":"我们在阿尔卡伊塞里亚（Alcaicería）里闲逛，小店卖纺织品和纪念品。"},{"en":"The guide explained that the alcaicería was once a center of the silk trade.","zh":"导游解释说，alcaicería 曾经是丝绸贸易的中心。"}]},{"partOfSpeech":"n.","definition":{"en":"(often capitalized) the Alcaicería of Granada: a famous historic market district near the cathedral, rebuilt after a fire and now known for narrow lanes and small shops.","zh":"（常大写）格拉纳达的 Alcaicería：一处著名的历史集市街区，靠近主教座堂，曾因大火后重建，如今以狭窄巷道与小商铺闻名。"},"examples":[{"en":"The Alcaicería of Granada is popular with visitors looking for a traditional market atmosphere.","zh":"格拉纳达的 Alcaicería 很受游客欢迎，适合体验传统集市氛围。"},{"en":"We met in the Alcaicería, then walked to nearby plazas for tapas.","zh":"我们在 Alcaicería 碰面，然后走去附近的广场吃塔帕斯（tapas）。"}]}],"synonyms":["bazaar","market","market district","covered market"],"phonetic":"/ˌɑlkaɪˈsɛəriə/","extraExplanation":["这个词来自西班牙语，常被用作地名/景点名；词源与阿拉伯语有关，反映了伊比利亚半岛历史上的安达卢斯（Al-Andalus）文化影响。","在英语旅行写作中常直接借用原词 Alcaicería；如果面向普通读者，也可以用更通用的表达如 “covered market / bazaar / market district” 来解释。"]}
{"word":"Alcaics","summary":{"en":"Alcaics are poems/lines in the classical Alcaic meter, associated with Alcaeus and later Latin poets like Horace.","zh":"Alcaics 指用古典“阿尔开奥斯格律”写成的诗句或诗节（源自阿尔开奥斯，后被贺拉斯等拉丁诗人常用）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Alcaic verses or stanzas; poetry written in the Alcaic meter (a classical Greek lyric pattern).","zh":"阿尔开奥斯体诗句/诗节；用“阿尔开奥斯格律”（古希腊抒情诗的一种格律）写成的诗。"},"examples":[{"en":"Horace is famous for writing many odes in Alcaics.","zh":"贺拉斯以用阿尔开奥斯体写下许多颂歌而闻名。"},{"en":"The translator tried to echo the rhythm of the original Alcaics in English.","zh":"译者试图在英文中再现原作阿尔开奥斯体的节奏。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the Alcaic meter or the Alcaic stanza.","zh":"（形容）与阿尔开奥斯格律或阿尔开奥斯诗节有关的。"},"examples":[{"en":"She chose an Alcaic stanza to give the poem a classical tone.","zh":"她选择阿尔开奥斯诗节，让诗歌带有古典气息。"},{"en":"The poem’s Alcaic structure makes it feel formal and musical.","zh":"这首诗的阿尔开奥斯体结构让它显得庄重而富有乐感。"}]}],"synonyms":["Alcaic meter","Alcaic stanza","classical lyric meter"],"phonetic":"/ælˈkeɪ.ɪks/","extraExplanation":["“Alcaic/Alcaics”源自古希腊诗人阿尔开奥斯（Alcaeus，公元前6世纪左右）。这种诗体后来在拉丁文学中很重要，罗马诗人贺拉斯（Horace）的《颂歌》（Odes）里常用，因此在英文学术语境中多见于古典文学、诗歌格律与翻译评论。","拼写提示：单数常写作 Alcaic；复数名词常写作 Alcaics（指“阿尔开奥斯体诗作/诗节”这一类作品）。"]}
{"word":"alcaics","summary":{"en":"“Alcaics” refers to the Alcaic stanza/metre, a classical verse form used in Greek and Latin lyric poetry.","zh":"“Alcaics”指“阿尔卡奥斯诗节/格律”，一种古希腊与拉丁抒情诗常用的古典诗体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of classical Greek and Latin verse form (the Alcaic stanza), used especially in lyric poetry","zh":"一种古希腊与拉丁诗歌的格律/诗节形式（阿尔卡奥斯诗节，Alcaic stanza），常用于抒情诗"},"examples":[{"en":"Horace wrote many poems in Alcaics.","zh":"贺拉斯写过许多采用阿尔卡奥斯诗节（Alcaics）的诗。"},{"en":"The translator kept the original poem’s Alcaics to preserve its rhythm.","zh":"译者保留了原诗的阿尔卡奥斯格律，以保存其节奏感。"},{"en":"In class we compared Sapphic stanzas with Alcaics.","zh":"课堂上我们比较了萨福诗节与阿尔卡奥斯诗节（Alcaics）。"}]}],"synonyms":["Alcaic stanza","Alcaic metre","classical metre"],"phonetic":"/ælˈkeɪ.ɪks/","extraExplanation":["“Alcaics”来自古希腊抒情诗人阿尔卡奥斯（Alcaeus）的名字，指与他相关的一组固定韵律结构。英语里常用复数形式（Alcaics）来泛指“阿尔卡奥斯格律/诗节”。","在拉丁文学中，诗人贺拉斯（Horace）最著名地模仿并推广了 Alcaic stanza，因此在英文学术语境里常会看到“Horatian Alcaics（贺拉斯式阿尔卡奥斯诗节）”。","这是偏文学/古典学术语；日常英语里很少用，多见于诗歌赏析、古典文学研究与翻译讨论。"]}
{"word":"alcaid","summary":{"en":"Alcaid is an old term meaning a jailer/warden, and historically it can also mean a local governor or commander in Spain and North Africa.","zh":"Alcaid 是较古旧的词，可指狱卒/监狱看守；在历史语境中也可指西班牙及北非的地方长官或指挥官。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a jailer or prison warden (an old-fashioned term).","zh":"狱卒；监狱看守（较古旧的用法）。"},"examples":[{"en":"In the old story, the alcaid refused to open the cell door at night.","zh":"在那个古老的故事里，狱卒夜里拒绝打开牢门。"},{"en":"The prisoner tried to persuade the alcaid with promises of money.","zh":"囚犯试图用金钱的承诺说服狱卒。"}]},{"partOfSpeech":"n.","definition":{"en":"a local governor or commander in parts of Spain and North Africa (historical use).","zh":"（历史用语）西班牙及北非部分地区的地方长官；指挥官。"},"examples":[{"en":"The alcaid governed the fortress on behalf of the crown.","zh":"这位地方长官代表王室管理那座要塞。"},{"en":"Merchants needed the alcaid’s permission to enter the guarded port.","zh":"商人们需要长官的许可才能进入设防的港口。"}]}],"synonyms":["warden","jailer","gaoler","governor","commandant"],"phonetic":"/ælˈkeɪd/","extraExplanation":["“alcaid”是一个较少见、带历史色彩的词，常出现在古典文学、历史叙述或以中世纪伊比利亚（西班牙/安达卢斯）为背景的作品里；现代英语里更常用“warden / jailer / governor”。","词源与阿拉伯语有关（常见解释来自 al-qā’id，意为“领袖/指挥官”），反映了伊比利亚半岛历史上阿拉伯语对西班牙语与英语借词的影响。"]}
{"word":"alcaide","summary":{"en":"An alcaide is a historical term for the commander of a fortress or the warden of a prison, especially in Spain or Portugal.","zh":"alcaide 是历史用语，指（尤在西班牙或葡萄牙）要塞守将或监狱典狱长。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) The governor or commander of a castle, fortress, or fortified town (especially in Spain or Portugal).","zh":"（历史用语）城堡、要塞或设防城镇的总管／守将（尤指西班牙或葡萄牙）。"},"examples":[{"en":"In the novel, the alcaide refuses to open the city gates at night.","zh":"在小说里，那位要塞守将拒绝在夜里打开城门。"},{"en":"The messenger brought orders directly to the alcaide of the fortress.","zh":"信使把命令直接送到要塞总管手中。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) A jailer or warden of a prison.","zh":"（历史用语）监狱看守／典狱长。"},"examples":[{"en":"The alcaide allowed the prisoner to receive a visitor.","zh":"典狱长允许囚犯会见来访者。"},{"en":"He bribed the alcaide for better food.","zh":"他贿赂狱卒以换取更好的食物。"}]}],"synonyms":["castellan","fortress commander","governor","warden","jailer"],"phonetic":"/ælˈkaɪd/","extraExplanation":["“alcaide”多见于历史语境，常用于描述伊比利亚半岛（西班牙、葡萄牙）中世纪到近代早期的城堡守将或监狱管理者。","词源上经由西班牙语/葡萄牙语进入英语，源头与阿拉伯语中表示“领袖、指挥官”的词有关；因此它常带有“掌管、统领”的含义。","在现代英语中较少用于日常对话，写作时常用更常见的词替换，如 fortress commander / governor 或 prison warden / jailer；使用“alcaide”会显得更有历史或文学色彩。"]}
{"word":"alcaides","summary":{"en":"Alcaides means the officials (historically fortress commanders or local governors, sometimes prison wardens) called an alcaide.","zh":"Alcaides 是 alcaide 的复数，指（历史上）城堡守将/地方长官，有时也指监狱典狱官。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of alcaide: a local governor or castle commander (historical), or a prison warden/jailer (especially in Spanish/Portuguese contexts).","zh":"alcaide 的复数：地方长官或城堡守将（历史用法）；也可指监狱看守/典狱长（尤见于西班牙语/葡萄牙语语境）。"},"examples":[{"en":"In the old chronicles, the alcaides controlled the fortress and its gates.","zh":"在古老的编年史里，这些 alcaides 掌管要塞及其城门。"},{"en":"The prisoners were taken to the alcaides for questioning.","zh":"囚犯被带到典狱官（alcaides）那里接受讯问。"}]}],"synonyms":["wardens","jailers","fortress commanders","castellans","governors"],"phonetic":"/ælˈkaɪdz/","extraExplanation":["该词多见于历史、文学或翻译文本中，属于借词：源自西班牙语/葡萄牙语 alcaide（常指城堡长官或监狱看守），更早可追溯到阿拉伯语词根，反映了伊比利亚半岛历史上的阿拉伯语影响。","英语里日常更常用的对应词通常是 governor（地方长官）、castellan/fortress commander（城堡守将）或 warden/jailer（监狱看守）。"]}
{"word":"Alcaids","summary":{"en":"“Alcaids” is the plural of “alcaid,” a historical term for a local governor/commander or sometimes a fortress/prison warden, especially in Spanish/Portuguese settings.","zh":"“Alcaids” 是 “alcaid” 的复数，是历史用语，指地方总督/指挥官，有时也指要塞或监狱的看守（多见于西班牙/葡萄牙语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A governor, military commander, or local leader, especially in Spanish or Portuguese contexts; sometimes also the warden of a fortress or prison.","zh":"（历史用语）总督、军事指挥官或地方长官（常见于西班牙/葡萄牙语境）；有时也指城堡或监狱的看守/典狱长。"},"examples":[{"en":"In the chronicle, the alcaid was responsible for defending the fortress.","zh":"在那部编年史中，alcaid 负责守卫要塞。"},{"en":"The alcaid ordered the gates to be closed at night.","zh":"alcaid 下令夜间关闭城门。"},{"en":"Records mention an alcaid who acted as the prison’s warden.","zh":"档案提到一位担任监狱典狱长的 alcaid。"}]}],"synonyms":["governor","commander","castellan","warden"],"phonetic":"/ælˈkeɪd/","extraExplanation":["“Alcaids” 是名词复数，单数是 “alcaid”。该词在现代日常英语中很少见，多出现在历史写作、翻译作品或讨论伊比利亚半岛（西班牙/葡萄牙）中古时期的语境。","词源与阿拉伯语有关（常见解释来自 *al-qā’id*，意为“指挥官/领袖”），也因此在涉及摩尔人统治时期或相关史料时更常出现。","常见拼写变体包括 **alcaide**（更贴近西班牙语/葡萄牙语形式）以及 **alkaid**（有时也用于其他专名；注意不要与星名等专有名词混淆）。"]}
{"word":"Alcalde","summary":{"en":"Alcalde means a mayor or chief local official in Spanish-speaking contexts, especially in the U.S. Southwest.","zh":"Alcalde 指西班牙语地区（尤指美国西南部语境）中的市长或地方主要官员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Spanish-speaking places, and especially in the U.S. Southwest) a mayor or local chief official; sometimes also a local magistrate.","zh":"（用于西班牙语地区，尤指美国西南部）市长或地方首长官员；有时也指地方行政/司法官。"},"examples":[{"en":"The town elected a new alcalde to oversee local services.","zh":"这个小镇选出了一位新任 alcalde（市长）来负责地方公共服务。"},{"en":"In some historical records, the alcalde handled minor legal disputes.","zh":"在一些历史记录中，alcalde 也会处理轻微的法律纠纷。"}]}],"synonyms":["mayor","local magistrate","town leader"],"phonetic":"/ælˈkæl.deɪ/","extraExplanation":["“alcalde”来自西班牙语，常出现在与西班牙殖民历史相关的语境里（例如美国西南部旧时的城镇管理体系，或拉丁美洲地方政府结构）。在现代英语中，它通常被当作带文化背景的借词使用，相当于“mayor”，但在历史文献里有时兼具行政与司法职能。"]}
{"word":"alcalde","summary":{"en":"An alcalde is a mayor or local chief official in Spanish-speaking regions.","zh":"alcalde 指西语地区的“市长”或“地方行政长官”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Spanish-speaking places (especially in Latin America or Spain), a mayor or local chief official.","zh":"（西语国家/地区，尤指拉美或西班牙）市长；地方行政长官。"},"examples":[{"en":"The alcalde met with residents to discuss public safety.","zh":"市长与居民会面，讨论公共安全问题。"},{"en":"In some towns, the alcalde also has certain judicial responsibilities.","zh":"在一些城镇里，地方行政长官还承担一定的司法职责。"}]}],"synonyms":["mayor","local chief official","magistrate (in some historical contexts)"],"phonetic":"/ælˈkɑldi/","extraExplanation":["“alcalde”是英语中借用的西班牙语词，常见于新闻报道、历史写作或与西语地区有关的语境中。","词源上与阿拉伯语有关：西班牙语的“alcalde”来自阿拉伯语词根，历史上反映了伊比利亚半岛长期的文化接触。","在不同国家或历史时期，“alcalde”的具体权力可能不同：有的更接近“市长”，有的带有“地方法官/行政官”的色彩，因此翻译时可根据语境在“市长/地方行政长官”之间选择。"]}
{"word":"alcaldes","summary":{"en":"*Alcaldes* means “mayors,” especially in Spanish-speaking contexts (plural of *alcalde*).","zh":"*Alcaldes* 指“市长们”，多用于西语国家/西班牙语语境（*alcalde* 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mayor (especially in Spain or Spanish-speaking countries); plural of *alcalde*.","zh":"市长（尤指西班牙或西语国家的市政长官）；*alcalde* 的复数。"},"examples":[{"en":"In many towns, the *alcaldes* meet with community leaders to discuss public safety.","zh":"在许多城镇，市长们（*alcaldes*）会与社区领袖会面，讨论公共安全。"},{"en":"The article compared how *alcaldes* in Spain and mayors in the U.S. manage local budgets.","zh":"这篇文章比较了西班牙的 *alcaldes* 与美国市长如何管理地方预算。"}]}],"synonyms":["mayors","municipal leaders"],"phonetic":"/ælˈkældi/","extraExplanation":["*Alcalde* 是西班牙语词，常在英语新闻、历史或拉丁美洲/西班牙语境中出现，用来指“市长/地方行政首长”。英语里也可能写成单数 *alcalde*、复数 *alcaldes*。","词源上与阿拉伯语有关（西班牙语中不少以 al- 开头的词来自阿拉伯语影响），因此在伊比利亚历史与地方行政制度的讨论中较常见。"]}
{"word":"alcaldeship","summary":{"en":"Alcaldeship means the office or term of an alcalde (a Spanish/Spanish-American mayor or local magistrate).","zh":"Alcaldeship 指 alcalde（西班牙语系地区的市长或地方行政/司法官）的职位或任期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the office, position, or term of an alcalde (a Spanish or Spanish-American mayor or local magistrate)","zh":"（西班牙语系地区）市长或地方行政/司法官（alcalde）的职位、任期或管辖权"},"examples":[{"en":"Under Spanish colonial rule, local disputes were often decided during an alcaldeship.","zh":"在西班牙殖民统治下，地方纠纷常常在某位市长/地方官的任期内得到裁决。"},{"en":"The record notes the start of his alcaldeship in 1847.","zh":"档案记载他于1847年开始担任市长/地方官（进入其任期）。"}]}],"synonyms":["office of an alcalde","mayoralty (context-dependent)","magistracy (context-dependent)"],"phonetic":"/ælˈkɑldiˌʃɪp/","extraExplanation":["“Alcalde”源自西班牙语，历史上既可指“市长”，也可指兼具行政与司法职能的地方官（尤其在西班牙殖民体系中常见）。因此“alcaldeship”在不同文本里可能偏向强调：①职位/职权（office/powers），或②任期（term）。","该词在现代日常英语中较少见，更常出现在历史、法律、殖民地治理、或拉丁美洲/美国西南部（如旧时加州、新墨西哥等）相关的文献与档案中。"]}
{"word":"alcaldia","summary":{"en":"Alcaldía means the mayor’s office/city hall or the local administrative area governed by an alcalde in Spanish-speaking regions.","zh":"Alcaldía 通常指西语地区的市长办公室/市政厅，或由 alcalde 管辖的地方行政区（用法因国家而异）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In many Spanish-speaking places, the mayor’s office or city hall (the local government led by an alcalde).","zh":"在许多西班牙语地区，指“市长办公室/市政厅”（由 alcalde 市长领导的地方政府机构）。"},"examples":[{"en":"You can pick up the permit at the alcaldía downtown.","zh":"你可以去市中心的市政厅（alcaldía）领取许可。"},{"en":"The alcaldía announced new rules for street vendors.","zh":"市政府（alcaldía）宣布了针对街头摊贩的新规定。"}]},{"partOfSpeech":"n.","definition":{"en":"A municipality or local administrative district governed by an alcalde (usage varies by country).","zh":"由 alcalde 管辖的市镇或地方行政区（不同国家用法略有差异）。"},"examples":[{"en":"She works in public health for the alcaldía of a small town.","zh":"她在一个小镇的地方政府（alcaldía）从事公共卫生工作。"}]}],"synonyms":["city hall","mayor's office","municipal government","town hall"],"phonetic":"/ˌɑl.kɑlˈdi.ə/","extraExplanation":["“Alcaldía”是西班牙语词，在英语里常用于拉丁美洲或西班牙语语境的新闻、旅行与官方文件中，通常不翻译或在后面加解释（例如：alcaldía (city hall)）。","词源上与“alcalde（市长）”相关；而“alcalde”一词更早可追溯到阿拉伯语词源（与法官/行政官的概念有关），反映了伊比利亚历史上的语言与文化影响。"]}
{"word":"alcali","summary":{"en":"Alcali is a less common spelling of alkali, meaning a basic (non-acidic) substance used in chemistry and everyday contexts like soil and cleaners.","zh":"Alcali 是 alkali 的较少见拼写，表示“碱/碱性物质”，常见于化学以及土壤、清洁剂等日常语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Less common spelling) a chemical substance that forms a base (the opposite of an acid), often producing a bitter taste and turning red litmus paper blue. Common modern spelling: alkali.","zh":"（较少见的拼写）碱性物质（与酸相对），常有苦味，能使红色石蕊试纸变蓝。现代常用拼写：alkali（碱）。"},"examples":[{"en":"The soil in this area contains a lot of alkali (also spelled alcali), so only certain plants grow well.","zh":"这个地区的土壤含有较多的碱（也可拼作 alcali），所以只有某些植物长得好。"},{"en":"If a cleaner is an alcali, it can irritate your skin—wear gloves.","zh":"如果清洁剂是碱性（alcali），可能会刺激皮肤——要戴手套。"}]},{"partOfSpeech":"n.","definition":{"en":"A type of salt found in alkaline substances, especially those containing sodium or potassium (often discussed in chemistry).","zh":"（尤指化学语境）碱金属盐；常指含钠或含钾的碱性盐类。"},"examples":[{"en":"Potassium compounds were once described as vegetable alkali (sometimes written alcali) in older texts.","zh":"在较早的文献中，含钾化合物曾被称为“植物碱”（有时拼作 alcali）。"}]}],"synonyms":["alkali","base"],"phonetic":"/ˈæl.kəˌlaɪ/","extraExplanation":["“alcali”是“alkali”的旧式或非主流拼写。现代科学与日常英语里几乎都写作“alkali”。","词源上来自阿拉伯语 al-qaly（与“灰烬/碱”有关），历史上碱常通过植物灰烬获得，因此在旧文本中常出现相关表达。"]}
{"word":"Alcaligenes","summary":{"en":"Alcaligenes is the scientific name of a genus of Gram-negative bacteria found in the environment; some species can occasionally cause opportunistic infections.","zh":"Alcaligenes（产碱菌属）是环境中常见的一类革兰氏阴性细菌的属名；部分物种可偶发导致机会性感染。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of Gram-negative bacteria, found in soil and water; some species can occasionally cause infections in humans, especially in hospital settings","zh":"一种革兰氏阴性细菌的属名，常见于土壤和水环境；其中某些物种在特定情况下（如医院环境）可偶发引起人类感染"},"examples":[{"en":"Alcaligenes species are commonly detected in environmental samples such as soil and wastewater.","zh":"在土壤和污水等环境样本中常能检测到产碱菌属（Alcaligenes）的细菌。"},{"en":"In rare cases, Alcaligenes can be linked to opportunistic infections in immunocompromised patients.","zh":"在少数情况下，产碱菌属可能与免疫力低下患者的机会性感染有关。"}]}],"synonyms":["Alcaligenes (genus)","Alcaligenes spp."],"phonetic":"/ˌæl.kəˈlɪdʒ.əˌniːz/","extraExplanation":["“Alcaligenes”是拉丁化的学名，词源与“alkali（碱）/alcaline（碱性的）”有关，早期用于指这类细菌可能与产碱或耐碱特性相关。","在医学与临床检验语境中，它多作为“属名”出现；是否致病、如何治疗要以具体“种（species）”与药敏结果为准。","阅读学术文章时，属名通常首字母大写并用斜体（Alcaligenes），单复数在英语写法上常保持同形（如“Alcaligenes spp.”表示该属的多个未定种）。"]}
{"word":"alcaligenes","summary":{"en":"Alcaligenes is a genus of Gram-negative bacteria, mainly environmental but sometimes causing opportunistic human infections.","zh":"Alcaligenes是革兰氏阴性细菌属，多见于环境中，偶尔可致机会性感染。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of Gram-negative bacteria found in soil and water; some species can act as opportunistic pathogens in humans.","zh":"一种革兰氏阴性细菌属，常见于土壤和水环境；其中部分菌种在人体免疫力低下时可引起机会性感染。"},"examples":[{"en":"Alcaligenes species are commonly isolated from environmental samples such as soil and water.","zh":"在土壤和水等环境样本中常能分离到Alcaligenes属细菌。"},{"en":"In hospitals, Alcaligenes can occasionally cause infections in patients with weakened immune systems.","zh":"在医院环境中，Alcaligenes偶尔会在免疫力较弱的患者中引发感染。"}]}],"synonyms":["Alcaligenes (genus name)"],"phonetic":"/ˌæl.kəˈlɪdʒ.əˌniːz/","extraExplanation":["“Alcaligenes”来自“alkali（碱）”这一词根，早期用于描述部分菌株与“碱性环境/产碱特征”相关的发现与分类。","在临床检验中，这类细菌可能与呼吸道、血流或器械相关感染有关；是否需要治疗与用药通常取决于具体菌种鉴定与药敏结果。"]}
{"word":"alcalizate","summary":{"en":"Alkalize means to make something less acidic (more alkaline), especially by changing its pH.","zh":"Alkalize 指使某物降低酸性、变得更偏碱性，常指调整 pH 值。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something alkaline (the opposite of acidic), usually by adding an alkali","zh":"使……碱化（变成偏碱性；与“酸性”相反），通常通过加入碱性物质"},"examples":[{"en":"The lab alkalized the solution to reach a pH of 9.","zh":"实验室把溶液碱化，使其达到 9 的 pH 值。"},{"en":"Some products claim they can alkalize the body, but the science is limited.","zh":"有些产品声称可以让身体“碱化”，但科学证据有限。"}]},{"partOfSpeech":"vt.","definition":{"en":"(medicine) to reduce acidity in the body or urine by giving alkaline substances","zh":"（医学）通过给予碱性物质来降低体内或尿液的酸度"},"examples":[{"en":"The doctor may alkalize the urine to help prevent certain kidney stones.","zh":"医生可能会让尿液碱化，以帮助预防某些肾结石。"}]}],"synonyms":["make alkaline","basify","neutralize (partly, depending on context)"],"phonetic":"/ˈæl.kəˌlaɪz/","extraExplanation":["你写的 **alcalizate** 不是常见英语拼写，常见形式是 **alkalize**（美式）或 **alkalise**（英式）。它来自 **alkali**（“碱”）。","在健康营销语境里，“alkalize the body（让身体碱化）”常被用作宣传说法；学习时要注意它在科学与医学语境中的更严格含义通常与 **pH** 调整有关。"]}
{"word":"Alcalzar","summary":{"en":"“Alcázar” (often misspelled as “Alcalzar”) means a Spanish palace-fortress, commonly tied to medieval Moorish influence.","zh":"“Alcázar”（常被误写为“Alcalzar”）指西班牙的宫殿式城堡/要塞，常与中世纪摩尔（伊斯兰）文化影响相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Spanish palace or fortress, often originally built (or influenced) by Muslims in medieval Spain; commonly seen in place names and in the term “Alcázar.”","zh":"（西班牙的）城堡式宫殿/要塞；常见于地名或作为“Alcázar（阿尔卡萨尔）”一词出现，多与中世纪伊斯兰建筑影响有关。"},"examples":[{"en":"We visited the Alcázar in Seville and admired its Moorish-style rooms.","zh":"我们参观了塞维利亚的阿尔卡萨尔宫，并欣赏了它带有摩尔风格的房间。"},{"en":"The old alcázar once served as both a royal palace and a defensive stronghold.","zh":"这座古老的阿尔卡萨尔曾同时作为王宫和防御要塞使用。"}]}],"synonyms":["palace","fortress","castle","citadel","stronghold"],"phonetic":"/ælˈkɑːzɑːr/","extraExplanation":["你输入的“Alcalzar”更常见的拼写是西班牙语 **Alcázar**（英语里也常直接用这个拼写）。重音在第二个音节：al-**CA**-zar。","词源来自阿拉伯语 **al-qaṣr**（意为“宫殿/城堡”），因此在西班牙很多城市会有“Alcázar”，常与伊斯兰—基督教交错的历史时期相关。","在英语写作中它既可以专指某一座著名建筑（如 *the Alcázar of Seville*），也可作普通名词表示“西班牙式城堡/王宫”。"]}
{"word":"alcalzar","summary":{"en":"“alcalzar” is most likely a misspelling of Spanish “alcanzar,” meaning “to reach,” “to catch up,” or “to be enough.”","zh":"“alcalzar”多半是西语“alcanzar”的误拼，意思是“够到/到达”“赶上”或“够用/足够”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Spanish verb; usually spelled “alcanzar”) to reach; to catch up with; to be enough (suffice).","zh":"（西班牙语动词；常见拼写为“alcanzar”）到达/伸手够到；赶上；足够/够用。"},"examples":[{"en":"No puedo alcanzar la taza en el estante alto.","zh":"我够不到高架子上的杯子。"},{"en":"Si corres más rápido, puedes alcanzar al autobús.","zh":"如果你跑快一点，你就能赶上公交车。"},{"en":"¿Te alcanza el dinero para el boleto?","zh":"你的钱够买票吗？"}]}],"synonyms":["(Spanish) llegar a","(Spanish) conseguir","(Spanish) atrapar","(Spanish) bastar"],"phonetic":"/ˌɑl.kɑnˈsɑr/","extraExplanation":["“alcalzar”在现代标准西班牙语里通常被视为拼写错误或非常少见的变体；最常用、最标准的形式是“alcanzar”。","“alcanzar”在日常西语中很常见：既可以表示身体上“够到/到达”，也可以表示“追上”，还可以在口语里表示“够用/足够”（如“Me alcanza.”=“够了/够用。”）。"]}
{"word":"alcamine","summary":{"en":"Alcamine is a rare chemistry term meaning an amino alcohol (often spelled “alkamine”).","zh":"alcamine 是一个较少使用的化学词，指“氨基醇”（常见拼写为 alkamine）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry, rare) An amino alcohol; a compound that contains both an amine (–NH2/–NR2) group and an alcohol (–OH) group. Often spelled “alkamine.”","zh":"（化学，较少用）氨基醇；同时含有胺基（–NH2/–NR2）与羟基（–OH）的化合物。常见拼写为“alkamine”。"},"examples":[{"en":"Ethanolamine is an alcamine used in making detergents and other chemicals.","zh":"乙醇胺是一种氨基醇，可用于生产洗涤剂和其他化学品。"},{"en":"Some drugs are made from alcamines because they can react like both alcohols and amines.","zh":"一些药物会以氨基醇为原料，因为它们既能表现出醇类反应性，也能表现出胺类反应性。"}]}],"synonyms":["alkamine","amino alcohol"],"phonetic":"/ˈæl.kə.miːn/","extraExplanation":["“alcamine”在现代英语里非常少见，很多情况下是“alkamine”的变体拼写。学术或工业语境中通常直接用更具体的词，如“ethanolamine（乙醇胺）”“amino alcohol（氨基醇）”。","注意不要与“alkaline（碱性的）”混淆；两者拼写和读音相近，但含义完全不同：alkaline 指“呈碱性”，而 alcamine/alkamine 指“一类含胺基与羟基的化合物”。"]}
{"word":"Alcandre","summary":{"en":"Alcandre is mainly a literary proper name, best known as the magician character in Corneille’s *L’Illusion comique*.","zh":"Alcandre 主要是文学中的人名，最知名的是高乃依《喜剧幻觉》里的魔法师角色。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A male proper name used in literature (especially French drama), most famously the magician Alcandre in Pierre Corneille’s play *L’Illusion comique*.","zh":"男性专有名（多见于文学作品中），最著名的是法国剧作家高乃依（Pierre Corneille）戏剧《喜剧幻觉》（*L’Illusion comique*）里的魔法师/术士 Alcandre。"},"examples":[{"en":"In *L’Illusion comique*, Alcandre uses magic to show Pridamant visions of his son’s life.","zh":"在《喜剧幻觉》中，Alcandre 用魔法让 Pridamant 看到他儿子生活的种种幻象。"},{"en":"The director portrayed Alcandre as a wise, mysterious guide rather than a villain.","zh":"导演把 Alcandre 塑造成睿智又神秘的引路人，而不是反派。"}]}],"synonyms":["(proper name)"],"phonetic":"/ælˈkændər/","extraExplanation":["“Alcandre”在英语里通常不会当作普通词汇使用，而是作为人物名出现；在高乃依的《喜剧幻觉》中，他的角色有点像“操控舞台幻象的人”，也常被理解为“戏剧/想象力本身”的象征。","读法上，英语使用者往往按英语习惯读成 /ælˈkændər/；如果在法语语境中讨论作品，发音可能会更接近法语，但这里按英文学习者常用读音给出。"]}
{"word":"alcanna","summary":{"en":"Alcanna is a (rare) word for a dye plant whose root yields a red coloring, often the same as alkanna/alkanet.","zh":"Alcanna 是一个较少见的词，指一种可从根部提取红色染料的植物，常与 alkanna/alkanet（紫草类）指同一种。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant (often the same as alkanna/alkanet) whose roots produce a red dye used for coloring oils, ointments, and sometimes cosmetics","zh":"一种植物（常与 alkanna/alkanet 指同类），其根可提取红色染料，用于给油脂、药膏，有时也用于化妆品着色"},"examples":[{"en":"Historically, alcanna root was used to tint oils and balms a warm red.","zh":"在历史上，人们用 alcanna 的根给油和药膏染成温暖的红色。"},{"en":"Some traditional recipes mention alcanna as a natural dye ingredient.","zh":"一些传统配方会提到用 alcanna 作为天然染料成分。"}]}],"synonyms":["alkanna","alkanet","dyer’s alkanet"],"phonetic":"/ælˈkænə/","extraExplanation":["“alcanna”在英语中较少见，常被当作“alkanna / alkanet（紫草、染料紫草）”的旧称或变体拼写，常见于历史文本、草药书或传统配方中。","其染色来源主要是根部的色素（常被称为 alkanin 一类色素），常用于给油性基质上色，因此在古老的软膏、香膏、染色油中更常见。"]}
{"word":"Alcantara","summary":{"en":"Alcantara is most commonly a brand-name synthetic suede material, and it can also be a surname or place name (often spelled Alcántara in Spanish).","zh":"Alcantara最常见的意思是商标名的“仿麂皮”合成材料；它也可作姓氏或地名（西班牙语中常写作Alcántara）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand name for a soft, suede-like synthetic material (usually microfiber) used for car interiors, furniture, and clothing","zh":"Alcantara（常作商标名）：一种柔软、类似麂皮触感的合成材料（多为超细纤维），常用于汽车内饰、家具与服装"},"examples":[{"en":"This car has Alcantara seats and a leather steering wheel.","zh":"这辆车的座椅是Alcantara材质，方向盘是皮质的。"},{"en":"The sofa is upholstered in Alcantara for a suede-like feel.","zh":"这张沙发用Alcantara做面料包覆，触感像麂皮。"}]},{"partOfSpeech":"n.","definition":{"en":"a proper name used as a surname or place name (for example, Alcántara in Spain); spelling may vary with or without an accent in Spanish","zh":"专有名词：可作姓氏或地名（例如西班牙的Alcántara）；在西班牙语中可能带或不带重音符号"},"examples":[{"en":"She traced her family roots to the Alcantara surname.","zh":"她追溯家族渊源时发现祖姓是Alcantara。"},{"en":"They visited Alcántara to see the famous Roman bridge.","zh":"他们去Alcántara参观那座著名的古罗马桥。"}]}],"synonyms":["synthetic suede","microfiber suede","suede-like fabric"],"phonetic":"/ˌæl.kænˈtɑːr.ə/","extraExplanation":["“Alcantara”作为材料名称时通常指意大利公司推出的注册商标（常写作Alcantara®），英语里也常被当作普通名词来指代这种“仿麂皮”面料。","“Alcántara”这个地名在西班牙语里常与阿拉伯语词源有关，传统上被解释为与“桥”相关；因此在旅游介绍中常会提到当地的古桥（如罗马桥）。"]}
{"word":"alcantara","summary":{"en":"Alcantara usually refers to a brand-name synthetic suede used for interiors and clothing; it can also be a surname or place name.","zh":"Alcantara 通常指一种品牌仿麂皮面料；也可以是姓氏或地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand-name synthetic suede (a soft microfiber fabric) often used in car interiors, furniture, and fashion","zh":"Alcantara（品牌名）：一种仿麂皮的超细纤维面料，常用于汽车内饰、家具与服装"},"examples":[{"en":"This car has Alcantara on the steering wheel and seats.","zh":"这辆车的方向盘和座椅用了 Alcantara 面料。"},{"en":"Alcantara feels like suede, but it’s easier to maintain.","zh":"Alcantara 摸起来像麂皮，但更好打理。"},{"en":"She bought a bag with an Alcantara lining.","zh":"她买了一个内衬是 Alcantara 的包。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name or place name (e.g., in Spanish/Portuguese-speaking regions)","zh":"人名或地名（常见于西班牙语/葡萄牙语地区）"},"examples":[{"en":"Alcántara is a town in Spain.","zh":"Alcántara 是西班牙的一个城镇。"},{"en":"Her last name is Alcantara.","zh":"她的姓是 Alcantara。"}]}],"synonyms":["synthetic suede","microfiber suede","faux suede"],"phonetic":"ˌæl.kænˈtɑr.ə","extraExplanation":["在英语里，谈到面料时通常写作大写 Alcantara（商标/品牌名）。口语中也有人用它泛指“类似麂皮的超细纤维面料”，但在正式场合更推荐把它当作品牌来用。","Alcantara 常见搭配：Alcantara seats（Alcantara 座椅）、Alcantara trim（Alcantara 饰板/包覆）、Alcantara upholstery（Alcantara 装饰面料）。","如果你指的是西班牙地名 Alcántara，重音在中间音节（并且常见带重音符号）。英语文本里有时会省略重音符号写成 Alcantara。"]}
{"word":"Alcantarines","summary":{"en":"A plural demonym meaning “people from Alcântara/Alcántara.”","zh":"表示“来自Alcântara/Alcántara的人（当地居民）”的复数称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People from a place called Alcântara (Portugal) or Alcántara (Spain); a demonym used mainly in Portuguese/Spanish contexts. In English it is usually treated as a proper noun plural.","zh":"“Alcântara（葡萄牙）/Alcántara（西班牙）”这一地名的居民/本地人；多见于葡语或西语语境。在英语中通常作为专有名词复数使用。"},"examples":[{"en":"The Alcantarines celebrate local festivals each summer.","zh":"Alcantarines（当地居民）每年夏天都会庆祝本地节日。"},{"en":"She interviewed several Alcantarines about the town’s history.","zh":"她采访了几位Alcantarines，了解这座小镇的历史。"}]}],"synonyms":["residents of Alcântara","people from Alcántara"],"phonetic":"/ælˌkæn.təˈriːnz/","extraExplanation":["“Alcantarines”更常见于葡语/西语书写中的“居民称呼（demonym）”。英语里若要更自然，常写成“residents of Alcântara/Alcántara”或“people from Alcântara/Alcántara”。","对应的单数形式通常是“Alcantarine”（某位当地人），但在英语语料中并不算常见；实际使用时建议根据具体地点（葡萄牙的Alcântara还是西班牙的Alcántara）补充说明，以免混淆。"]}
{"word":"alcantarines","summary":{"en":"“Alcantarines” refers to a strict reform group within the Franciscans, linked to St. Peter of Alcántara.","zh":"“Alcantarines”指与阿尔坎塔拉的圣伯多禄相关的方济各会严格改革派（常用复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a strict reform branch of the Franciscan order, associated with St. Peter of Alcántara (often written as a plural: Alcantarines)","zh":"阿尔坎塔拉派方济各会士；指与“阿尔坎塔拉的圣伯多禄”（St. Peter of Alcántara）相关的方济各会严格改革派成员（常用复数：Alcantarines）"},"examples":[{"en":"The historian notes that the Alcantarines followed a particularly austere rule.","zh":"这位历史学者指出，阿尔坎塔拉派遵守一种特别严厉的会规。"},{"en":"In the 16th century, some Franciscan communities identified themselves as Alcantarines.","zh":"在16世纪，一些方济各会团体自称为阿尔坎塔拉派。"}]}],"synonyms":["Alcantarines (Franciscan reform)","Discalced Franciscans (related context)"],"phonetic":"/ælˈkæntəriːnz/","extraExplanation":["“Alcantarines”在英文资料里多见于宗教史/修会史语境，常指方济各会内部受西班牙圣人“阿尔坎塔拉的圣伯多禄”影响而形成的严格改革派（也常被视作“赤足/严规方济各会”的一支）。","词形上它经常以复数出现（Alcantarines），单数可写作“Alcantarine”。在一般现代英语中较少使用，主要出现在学术写作或历史文献。"]}
{"word":"alcapton","summary":{"en":"Alcapton is an older medical term for a urine substance that darkens on exposure to air, linked to alkaptonuria.","zh":"Alcapton 是较旧的医学用语，指一种会在空气中变黑的尿中物质，与黑尿症有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance once identified in urine that darkens when exposed to air, associated with the metabolic disorder alkaptonuria (now understood to be mainly homogentisic acid).","zh":"（旧称）尿中一种暴露在空气中会变黑的物质，与代谢性疾病“黑尿症（alkaptonuria）”有关（后来认为主要是尿黑酸/同黑酸 homogentisic acid）。"},"examples":[{"en":"Early medical reports described alcapton in patients whose urine turned dark after standing.","zh":"早期医学报告把“alcapton”描述为一种出现在病人尿液中的物质，尿液静置后会变深色。"},{"en":"Today, doctors usually talk about homogentisic acid rather than using the older term alcapton.","zh":"如今医生通常说“homogentisic acid（尿黑酸/同黑酸）”，而不是使用较旧的术语“alcapton”。"}]}],"synonyms":["homogentisic acid (modern usage in this context)","alkapton (variant spelling in older texts)"],"phonetic":"/ælˈkæp.tɑn/","extraExplanation":["“alcapton”多见于较早的医学文献，属于历史性/过时用法。现代医学更常用“alkaptonuria（黑尿症）”描述疾病，用“homogentisic acid（尿黑酸/同黑酸）”描述相关化学物质。","词形上可与“alkaptonuria”对应：-uria 表示“尿/尿液相关”，整体指“因某种物质导致尿液变色的代谢异常”。"]}
{"word":"alcaptonuria","summary":{"en":"Alkaptonuria is a rare inherited metabolic disorder that can cause dark urine and long-term joint problems.","zh":"尿黑酸症是一种罕见的遗传性代谢疾病，可导致尿液变黑，并可能引发长期关节问题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare inherited disorder in which the body cannot fully break down a substance called homogentisic acid, causing it to build up and possibly leading to dark urine and joint problems over time","zh":"一种罕见的遗传性疾病：人体无法完全分解“黑酸（同黑酸/尿黑酸）”（homogentisic acid），导致其在体内累积，常见表现为尿液变黑，并可能随着时间出现关节等问题"},"examples":[{"en":"Alkaptonuria can cause urine to turn dark after it sits in the air.","zh":"尿黑酸症可能会导致尿液在空气中放置一段时间后变黑。"},{"en":"Because alkaptonuria is inherited, it often appears in families.","zh":"由于尿黑酸症是遗传性的，它常常在家族中出现。"},{"en":"Some people with alkaptonuria develop joint pain later in life.","zh":"一些尿黑酸症患者在成年后期会出现关节疼痛。"}]}],"synonyms":["alkaptonuria","black urine disease","ochronosis (related condition)"],"phonetic":"/ˌæl.kæp.təˈn(j)ʊr.i.ə/","extraExplanation":["读音与拼写提示：医学文献中常见拼写是 **alkaptonuria**（带 k），你写的 **alcaptonuria** 也会见到但较少。","词源小提示：词尾 **-uria** 在医学英语里常表示“尿/尿液相关的情况”（如 hematuria 血尿）。","文化/语境：这是一个医学专有名词，日常英语很少用，更多出现在遗传学、代谢病或临床描述中。"]}
{"word":"alcargen","summary":{"en":"“alcargen” is not recognized as a standard English word; it is likely a proper noun, brand name, or misspelling.","zh":"“alcargen”不是标准英语词汇；更可能是专有名词、品牌名或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in major dictionaries; it is likely a misspelling, a brand/product name, or a proper noun (e.g., a company or username).","zh":"不是主流英语词典中的标准词；更可能是拼写错误、品牌/产品名，或专有名词（如公司名、用户名）。"},"examples":[{"en":"I can’t find “alcargen” in a dictionary—could it be a brand name or a typo?","zh":"我在词典里找不到“alcargen”——它会不会是品牌名或拼写错误？"},{"en":"Please share the sentence where you saw “alcargen” so I can help you figure out what it means.","zh":"请把你看到“alcargen”的句子发出来，这样我可以帮你判断它的意思。"}]}],"phonetic":"/ˈæl.kɑr.dʒən/","extraExplanation":["这个词看起来不像常见英语词汇。如果你能提供：1）出现的句子/上下文，2）它来自哪里（药品、游戏、论文、品牌等），3）是否大小写固定（Alcargen/ALCARGEN），我可以更准确判断。","也可能是拼写接近的词（例如以 alca-/alka- 开头的专有名词或化学相关词）。建议先核对原文拼写，或把截图发来。"]}
{"word":"alcarraza","summary":{"en":"An alcarraza is a porous clay jug that cools water naturally through evaporation.","zh":"alcarraza 指一种多孔陶制水罐，靠蒸发原理自然给水降温。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a porous earthenware water jug (common in Spain and parts of Latin America) that keeps water cool by letting a little moisture seep through and evaporate","zh":"（西班牙及部分拉丁美洲常见的）多孔陶制水罐/水壶，通过渗出少量水分并蒸发来给水降温"},"examples":[{"en":"In the summer heat, they kept drinking water in an alcarraza to keep it cool.","zh":"在夏天的炎热里，他们把饮用水放在alcarraza（水罐）里保冷。"},{"en":"The traveler asked for water, and the host brought an alcarraza from the kitchen.","zh":"旅行者要水喝，主人从厨房拿来一个alcarraza（水罐）。"}]}],"synonyms":["earthenware jug","clay water jug","water jar"],"phonetic":"ˌæl.kəˈrɑː.zə","extraExplanation":["这个词多见于西班牙语语境的文化描写（尤其是乡村或传统生活场景）。它利用“渗水+蒸发”的原理降温，类似没有电的“天然冷却器”。","词源通常追溯到阿拉伯语（与伊比利亚半岛历史上的阿拉伯文化影响有关），因此在西班牙文化词汇中较有代表性。"]}
{"word":"Alcathous","summary":{"en":"Alcathous is a name from Greek mythology, most often referring to a hero-king of Megara (son of Pelops).","zh":"Alcathous 是希腊神话中的人名，最常指麦加拉的英雄国王（珀洛普斯之子）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) A hero and king of Megara, usually described as the son of Pelops; he is known for rebuilding the walls of Megara and killing a lion that was ravaging the area.","zh":"（希腊神话）麦加拉的英雄与国王，通常被说成是珀洛普斯之子；以重建麦加拉城墙、并杀死为害当地的狮子而闻名。"},"examples":[{"en":"In Greek myth, Alcathous becomes king of Megara after proving his strength and courage.","zh":"在希腊神话中，阿尔卡托斯因展现力量与勇气而成为麦加拉之王。"},{"en":"Some stories say Alcathous rebuilt Megara’s walls with help from the god Apollo.","zh":"有些传说说阿尔卡托斯在阿波罗的帮助下重建了麦加拉的城墙。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A name used for other minor figures in Greek legend, such as a Trojan warrior in accounts of the Trojan War (spelling may vary, e.g., Alkathoos).","zh":"（较少见）也可指希腊传说中的其他次要人物，例如特洛伊战争故事里的特洛伊战士（拼写可能不同，如 Alkathoos）。"},"examples":[{"en":"In some versions of the Trojan War stories, an Alcathous appears as a Trojan fighter.","zh":"在某些特洛伊战争故事版本中，会出现一位名叫阿尔卡托斯的特洛伊战士。"}]}],"synonyms":["Alkathoos","Alkáthoos"],"phonetic":"/ælˈkæθoʊəs/","extraExplanation":["“Alcathous”是英文里对希腊名“Alkáthoos/Alkathoos（Ἀλκάθοος）”的拉丁化/英语化拼写之一；不同译本可能出现 Alcathous、Alcathoüs、Alkathoos 等。","他与“麦加拉（Megara）城墙”的传说常与阿波罗有关：故事里阿波罗曾以弹奏里拉琴的方式参与建墙，体现古希腊神话中“神助建城/建墙”的母题。"]}
{"word":"alcatras","summary":{"en":"Alcatraz is a famous island in San Francisco Bay best known for its former federal prison.","zh":"Alcatraz 是旧金山湾著名的小岛，最出名的是曾经的联邦监狱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Alcatraz (proper noun): an island in San Francisco Bay, California, famous for the former federal prison there.","zh":"阿尔卡特拉兹（专有名词）：位于美国加州旧金山湾的一座小岛，以曾经的联邦监狱而闻名。"},"examples":[{"en":"They visited Alcatraz during their trip to San Francisco.","zh":"他们去旧金山旅行时参观了阿尔卡特拉兹。"},{"en":"Alcatraz was once a high-security federal prison.","zh":"阿尔卡特拉兹曾经是一座高度戒备的联邦监狱。"},{"en":"The movie is set on Alcatraz Island.","zh":"这部电影以阿尔卡特拉兹岛为背景。"}]}],"synonyms":["Alcatraz Island","the Rock"],"phonetic":"ˈæl.kəˌtræz","extraExplanation":["你输入的“alcatras”更常见的拼写是 **Alcatraz**（阿尔卡特拉兹）。在英语里它通常作为专有名词出现，常说 **Alcatraz Island**，口语里也常被称为 **the Rock**（“岩石”，指这座岛/监狱）。","词源上，名称来自西班牙语 *alcatraces*，与“鹈鹕”等海鸟有关。","文化语境：Alcatraz 常出现在美国历史、犯罪题材纪录片与电影中；它在 1963 年关闭为联邦监狱，后来成为热门旅游景点（隶属金门国家休闲区）。"]}
{"word":"Alcatraz","summary":{"en":"Alcatraz is an island in San Francisco Bay, most famous for the former federal prison there; it can also be used figuratively for an inescapable place.","zh":"Alcatraz 指旧金山湾的阿尔卡特拉斯岛，最出名的是岛上的旧联邦监狱；也可比喻“难以逃脱的地方”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small island in San Francisco Bay, California, best known for the former federal prison located there","zh":"美国加州旧金山湾中的一座小岛，以曾经的联邦监狱最为著名"},"examples":[{"en":"They visited Alcatraz during their trip to San Francisco.","zh":"他们在旧金山旅行时参观了阿尔卡特拉斯岛。"},{"en":"Alcatraz is now a popular tourist site and museum.","zh":"阿尔卡特拉斯岛如今是热门的旅游景点和博物馆。"}]},{"partOfSpeech":"n.","definition":{"en":"the former U.S. federal penitentiary on Alcatraz Island (often simply called “Alcatraz”), famous for strict security and attempted escapes","zh":"阿尔卡特拉斯联邦监狱（常直接称“Alcatraz”），以戒备森严和越狱传闻著称"},"examples":[{"en":"Alcatraz held some of the most notorious criminals in U.S. history.","zh":"阿尔卡特拉斯曾关押过美国历史上一些最臭名昭著的罪犯。"},{"en":"He watched a documentary about an escape attempt from Alcatraz.","zh":"他看了一部关于阿尔卡特拉斯越狱行动的纪录片。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) a place that feels impossible to escape from","zh":"（比喻）让人感觉难以逃脱的地方"},"examples":[{"en":"During the storm, the house felt like Alcatraz.","zh":"暴风雨期间，那栋房子让人感觉像“阿尔卡特拉斯”一样出不去。"}]}],"synonyms":["the Rock","Alcatraz Island","Alcatraz Federal Penitentiary"],"phonetic":"/ˈælkəˌtræz/","extraExplanation":["“Alcatraz”常被昵称为“The Rock”（岩石），强调它四面环水、难以逃离的地理特征。","词源一般认为来自西班牙语，早期与海鸟（常被解释为“鹈鹕”）相关的称呼有关，后来成为岛名。","在美国流行文化中，Alcatraz经常出现在电影、纪录片和小说里，象征“极度戒备的监狱”或“无法逃脱的困境”。"]}
{"word":"alcavala","summary":{"en":"Alcavala is a historical Spanish(-American) sales tax on the sale or transfer of goods.","zh":"Alcavala 指历史上西班牙及西属美洲对商品买卖或转让征收的一种销售税。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sales tax (especially in Spain and Spanish America) historically charged on the sale or transfer of goods.","zh":"（尤指历史上的西班牙及西属美洲）一种对商品买卖或转让征收的销售税。"},"examples":[{"en":"Merchants complained that the alcavala made everyday goods more expensive.","zh":"商人抱怨说，alcavala 让日常商品变得更贵。"},{"en":"The colonial government collected the alcavala on many local transactions.","zh":"殖民政府对许多本地交易征收 alcavala。"}]}],"synonyms":["sales tax","transaction tax","excise (general sense)"],"phonetic":"/ˌæl.kəˈvɑː.lə/","extraExplanation":["alcavala 是一个西班牙语借词，常见于历史与殖民研究语境。它指一种“交易税/销售税”，在中世纪后期的西班牙形成，并在西属美洲殖民时期被广泛征收。","词源来自西班牙语 alcabala，进一步可追溯到阿拉伯语来源的词形；这也反映了伊比利亚半岛历史上阿拉伯语对西班牙语的影响。","在英文史料或学术写作中，alcavala 往往不翻译，直接用作专名；写作时可在首次出现处用括号解释为 “a sales tax” 以帮助读者理解。"]}
{"word":"alcayde","summary":{"en":"A historical word meaning the governor or keeper of a fortress or castle.","zh":"一个历史词，指城堡或要塞的总督/看守官。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A governor, commander, or keeper of a fortress or castle (especially in Spain or in older English writing).","zh":"（历史用语）城堡/要塞的总督、指挥官或看守（尤指西班牙，或旧式英语文献中）。"},"examples":[{"en":"In the old chronicle, the alcayde refused to surrender the castle.","zh":"在那部古老的编年史里，城堡的总督（alcayde）拒绝投降。"},{"en":"The prisoners were brought before the alcayde of the fortress.","zh":"囚犯被带到要塞的看守官（alcayde）面前。"}]}],"synonyms":["alcaide","castellan","governor","warden"],"phonetic":"/ælˈkaɪd/","extraExplanation":["“alcayde”是较古老的拼写形式，更常见的变体包括“alcade / alcaide”。它来自西班牙语，并可追溯到阿拉伯语借词，常见于描写中世纪伊比利亚半岛（西班牙/葡萄牙）历史的英文文本中。","现代英语里很少在日常语境使用；如果你在小说或历史书里看到它，通常就是指“城堡/要塞的最高负责人或看守”。"]}
{"word":"alcaydes","summary":{"en":"“Alcaydes” is an archaic plural noun meaning wardens/commanders of a fortress or prison (often spelled “alcaides” today).","zh":"“alcaydes”是一个较古旧的复数名词，指要塞或监狱的看守长/指挥官（现代更常拼作“alcaides”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of alcayde: a warden or commander of a castle, fortress, or prison (an older spelling of Spanish-derived “alcaide”).","zh":"alcayde 的复数：城堡/要塞或监狱的看守长、司令/总管（源自西班牙语的旧式拼写，常见作 alcaide）。"},"examples":[{"en":"In the old chronicle, the alcaydes guarded the fortress gates day and night.","zh":"在那部古老的编年史里，alcaydes 日夜看守要塞城门。"},{"en":"The prisoner was brought before the alcaydes for questioning.","zh":"囚犯被带到几位 alcaydes 面前受讯。"}]}],"synonyms":["wardens","governors","commanders","jailers"],"phonetic":"/ælˈkaɪdz/","extraExplanation":["“alcayde/alcaydes”属于较古旧的拼写与用法，现代英语里更常见的是 **alcaide**（也可指监狱长/要塞长官）。","词源上与西班牙语 **alcaide** 有关，而西班牙语又来自阿拉伯语（大意为“首领/指挥官”）。因此它常出现在描写伊比利亚半岛中世纪、摩尔人统治时期或古代编年史风格的文本中。","阅读文学或历史译本时，遇到它通常可理解为“（要塞/监狱的）长官、看守长”。"]}
{"word":"alcazaba","summary":{"en":"An alcazaba is a Moorish-era fortress or fortified palace in Spain.","zh":"alcazaba 指西班牙伊斯兰时期的城堡式要塞/城寨（偏军事防御）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fortress or fortified palace, especially a Moorish (Islamic-era) citadel in Spain.","zh":"城堡；要塞；（尤指西班牙伊斯兰时期的）摩尔人城堡／城寨（城堡式堡垒）。"},"examples":[{"en":"We visited the Alcazaba of Málaga and walked along its old defensive walls.","zh":"我们参观了马拉加的阿尔卡萨瓦城堡，沿着古老的城墙散步。"},{"en":"Many Spanish cities still have an alcazaba from the period of Muslim rule.","zh":"许多西班牙城市至今仍保留着穆斯林统治时期的城堡（alcazaba）。"}]}],"synonyms":["citadel","fortress","stronghold"],"phonetic":"ˌæl.kəˈzɑː.bə","extraExplanation":["“alcazaba”常见于西班牙历史与旅游语境，指伊斯兰统治时期（常被概称为“摩尔人时期”）修建的防御性城堡或城寨。","词源来自阿拉伯语 al-qaṣabah（意为“城堡/要塞”）。在西班牙地名与历史建筑名称中常保留阿拉伯语影响，如以“al-”开头的词。","易混词：alcázar 通常指“王宫/城堡”（更偏宫殿性质），alcazaba 更强调“军事防御”的堡垒或城寨。"]}
{"word":"Alcazar","summary":{"en":"An alcázar is a Spanish fortress-palace, often with Moorish (Islamic) origins.","zh":"Alcázar 指西班牙的堡垒式宫殿，常源自摩尔（伊斯兰）时期建筑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fortress or palace in Spain (or formerly under Spanish rule), often originally built by Muslim rulers and later modified by Christian monarchs","zh":"（西班牙或曾受西班牙统治地区的）阿尔卡萨尔：一种堡垒式宫殿，常最初由穆斯林统治者修建，后由基督教君主改建或扩建"},"examples":[{"en":"We toured the Alcázar of Seville and saw its intricate tilework.","zh":"我们参观了塞维利亚王宫（Alcázar），看到了精美繁复的彩砖装饰。"},{"en":"Many alcázars combine defensive walls with luxurious royal rooms.","zh":"许多阿尔卡萨尔既有防御城墙，也有奢华的王室房间。"}]},{"partOfSpeech":"n.","definition":{"en":"a specific place name: “the Alcázar,” used to refer to a particular famous palace/fortress (for example, the Alcázar of Toledo or the Royal Alcázar of Seville)","zh":"专有名词用法：“the Alcázar”常指某一座著名的阿尔卡萨尔（如托莱多城堡或塞维利亚王宫）"},"examples":[{"en":"The Alcázar dominates the skyline of Toledo.","zh":"托莱多城堡（The Alcázar）在天际线中十分醒目。"},{"en":"Tickets for the Alcázar often sell out in peak season.","zh":"旺季时，阿尔卡萨尔的门票常常售罄。"}]}],"synonyms":["fortress","palace","castle","citadel"],"phonetic":"/ælˈkɑːzɑːr/","extraExplanation":["“Alcázar”来自西班牙语 alcázar，源头可追溯到阿拉伯语 al-qaṣr（意为“城堡/宫殿”）。因此它常和伊斯兰—伊比利亚历史联系在一起，许多建筑呈现穆德哈尔（Mudéjar）风格：把伊斯兰装饰艺术与基督教王室建筑结合。","英语里这个词多用于历史、旅游与建筑语境；书写时常保留重音符号“á”（Alcázar），但在英文出版物中也常见不带重音的“Alcazar”。"]}
{"word":"alcazar","summary":{"en":"An alcázar is a Spanish fortress or palace, often associated with Moorish architectural influence.","zh":"alcázar 指西班牙的城堡或王宫，常与摩尔式（伊斯兰）建筑风格相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fortress or palace in Spain (or formerly under Spanish rule), especially one built or influenced by Moorish/Islamic architecture.","zh":"（尤指西班牙或曾受西班牙统治地区的）城堡或王宫，常带有摩尔/伊斯兰风格的建筑特色。"},"examples":[{"en":"We visited the Alcázar of Seville and admired its courtyards and tiled walls.","zh":"我们参观了塞维利亚王宫（Alcázar），很欣赏那里的庭院和瓷砖墙面。"},{"en":"Many tourists think an alcázar is only a castle, but it can also be a royal palace.","zh":"很多游客以为 alcázar 只是“城堡”，但它也可以是“王宫”。"}]}],"synonyms":["fortress","palace","castle","citadel"],"phonetic":"/ˈæl.kə.zɑr/","extraExplanation":["词源来自阿拉伯语 al-qaṣr（القصر，“城堡/宫殿”），体现了伊比利亚半岛历史上伊斯兰文化对建筑与语言的影响。","在英语里常写作 Alcázar（保留重音符号 á），也可见到不带重音的 Alcazar；通常指具体建筑名称（如 Alcázar of Toledo, Alcázar of Seville）。"]}
{"word":"alcazars","summary":{"en":"“Alcazars” means Spanish palaces/fortresses, especially Moorish-built ones; it’s the plural of “alcazar.”","zh":"“alcazars”是“alcazar”的复数，指西班牙的宫殿/要塞，尤指摩尔人建造的阿尔卡萨尔宫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of alcazar: a Spanish palace or fortress, especially one originally built by the Moors (Muslims) in medieval Spain.","zh":"alcazar（阿尔卡萨尔宫/城堡）的复数：指西班牙的宫殿或要塞，尤指中世纪由摩尔人（穆斯林）建造的王宫或城堡。"},"examples":[{"en":"Many tourists visit the alcazars of Spain to see Islamic and Christian architectural styles together.","zh":"很多游客会参观西班牙的各座阿尔卡萨尔宫，以欣赏伊斯兰与基督教风格融合的建筑。"},{"en":"The guide explained how several alcazars were later expanded by Christian kings.","zh":"导游解释说，一些阿尔卡萨尔宫后来被基督教国王扩建。"}]}],"synonyms":["palaces","fortresses","citadels","castles"],"phonetic":"ˈælkəˌzɑr","extraExplanation":["“alcazar”一词来自阿拉伯语“al-qaṣr”（意思是“城堡/宫殿”）。在西班牙语中常写作“alcázar”（带重音符号），英语里常见拼写为“alcazar”。著名例子包括塞维利亚王宫（Real Alcázar of Seville）和塞哥维亚王宫（Alcázar of Segovia）。"]}
{"word":"alcazava","summary":{"en":"An alcazaba is an Arabic-style fortress or citadel in Spain, especially from the period of Muslim rule.","zh":"alcazaba 指西班牙（尤指穆斯林统治时期）常见的阿拉伯式城堡或城塞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fortress or fortified palace, especially one from Muslim-ruled Spain (Al-Andalus); often an Arabic-style citadel in a Spanish city.","zh":"城堡；要塞（尤指西班牙安达卢斯时期的穆斯林防御工事或设防宫殿），常见为城市中的阿拉伯式城堡/城塞。"},"examples":[{"en":"Tourists visited the alcazaba to see its old stone walls and views of the city.","zh":"游客参观了这座 alcazaba（城堡/城塞），欣赏古老的石墙和城市景观。"},{"en":"The guide explained that the alcazaba once protected the port from attacks.","zh":"导游解释说，这座 alcazaba 曾经用来保护港口免受攻击。"}]}],"synonyms":["citadel","fortress","stronghold"],"phonetic":"/ˌæl.kəˈzɑː.bə/","extraExplanation":["你输入的 **alcazava** 多半是拼写误差；英语里更常见的拼写是 **alcazaba**（也可见 alcaçaba，偏葡语/旧拼写）。","词源来自阿拉伯语 **al-qaṣbah**（意为“城塞/堡垒”）。在西班牙语语境中，alcazaba 常指伊斯兰统治时期修建的防御性城堡，如马拉加（Málaga）的 Alcazaba。"]}
{"word":"alce","summary":{"en":"“Alce” is most likely a misspelling of the name “Alice.”","zh":"“alce”很可能是人名“Alice”的拼写错误。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Alice (common spelling; “alce” is usually a misspelling): a female given name.","zh":"Alice（常见拼写；“alce”通常是拼写错误）：女性名字。"},"examples":[{"en":"Alice is coming to the meeting at 3 p.m.","zh":"Alice 下午三点来开会。"},{"en":"My grandmother’s name is Alice.","zh":"我祖母叫 Alice。"}]}],"synonyms":["Alison (related name)","Alicia (related name)"],"phonetic":"/ˈælɪs/","extraExplanation":["“alce”在英语里不是常见单词，最常见情况是把人名 **Alice** 拼错了（少了一个 i）。","**Alice** 的常见发音是 /ˈælɪs/，重音在第一个音节：AL-iss。","Alice 也是经典文学作品《Alice’s Adventures in Wonderland》（《爱丽丝梦游仙境》）中的主角名字，因此在英语文化中非常常见、辨识度很高。","如果你本来想查的是缩写 **ALCE**（例如某些专业领域的机构/课程名），告诉我上下文（句子或领域），我可以按正确含义解释。"]}
{"word":"Alcedines","summary":{"en":"Alcedines refers to the bird group that includes kingfishers.","zh":"Alcedines 指包含翠鸟在内的一类鸟（翠鸟亚目）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a taxonomic group (suborder) of birds that includes the kingfishers","zh":"（鸟类分类中的）翠鸟亚目；包括各种翠鸟的一个分类群"},"examples":[{"en":"Alcedines are best known for the brightly colored kingfishers found near rivers and lakes.","zh":"翠鸟亚目最为人熟知的是那些生活在河流和湖泊附近、羽色鲜艳的翠鸟。"},{"en":"In older field guides, some kingfishers are listed under the suborder Alcedines.","zh":"在较早的野外鸟类图鉴中，一些翠鸟被归在翠鸟亚目（Alcedines）之下。"}]}],"synonyms":["kingfishers (general meaning)","Alcedo (genus name, related)"],"phonetic":"/ælˈsiːdɪniːz/","extraExplanation":["“Alcedines”来自拉丁语词根 *Alcedo*（意为“翠鸟”）。它是传统分类法里常见的名称；在现代鸟类分类中，不同资料可能采用不同的分组方式（例如把相关类群拆分或改用其他层级名称）。阅读鸟类学或图鉴时，遇到它通常可以理解为“翠鸟这一大类”。"]}
{"word":"alcedines","summary":{"en":"Alcedines refers to the kingfisher family (Alcedinidae) or kingfisher-type birds.","zh":"Alcedines 指翠鸟科（Alcedinidae）或广义的翠鸟类鸟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of birds that includes the kingfishers (scientific family name: Alcedinidae).","zh":"翠鸟科（包含翠鸟等鸟类的一个鸟类科名，学名：Alcedinidae）。"},"examples":[{"en":"The alcedines are best known for the bright colors and swift dives of many kingfishers.","zh":"翠鸟科最为人熟知的是许多翠鸟鲜艳的羽色和迅猛的俯冲捕鱼。"},{"en":"In the field guide, alcedines are listed under the order Coraciiformes.","zh":"在野外鸟类图鉴里，翠鸟科被列在佛法僧目之下。"}]}],"synonyms":["kingfishers","Alcedinidae"],"phonetic":"/ælˈsiːdaɪnz/","extraExplanation":["“Alcedines”通常是较学术或较旧的用法，多用来指“翠鸟类（kingfishers）”或“翠鸟科相关的鸟”。现代生物分类写作里更常见的是直接用科名“Alcedinidae”或通俗名“kingfishers”。","词源上与拉丁语“alcedo”（翠鸟）有关；在英语里相关词还有形容词“alcedine”（翠鸟的／似翠鸟的）。"]}
{"word":"Alcedinidae","summary":{"en":"Alcedinidae = the kingfisher family (a group of birds).","zh":"Alcedinidae = 翠鸟科（翠鸟等鸟类所属的一科）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the bird family that includes the kingfishers (small to medium birds known for strong bills and fishing behavior).","zh":"翠鸟科（鸟类的一科，包含翠鸟等；以粗壮的喙与善于捕食鱼类等水生动物而著名）。"},"examples":[{"en":"The common kingfisher belongs to the family Alcedinidae.","zh":"普通翠鸟属于翠鸟科（Alcedinidae）。"},{"en":"In this wetland survey, several Alcedinidae species were recorded near clear, slow-moving streams.","zh":"在这次湿地调查中，研究人员在清澈、缓流的溪流附近记录到多种翠鸟科鸟类。"}]}],"synonyms":["kingfisher family"],"phonetic":"/ælˌsiːˈdɪnəˌdiː/","extraExplanation":["“Alcedinidae”是生物分类学里的拉丁化名称，常用于论文、野外调查报告、博物馆标本标签等正式语境；日常英语里更常说kingfisher(s)（翠鸟）。","词源上与拉丁语“alcedo”（翠鸟）有关，因此在学术写作中看到该词，通常就是在说“翠鸟这一科/这一类群”。"]}
{"word":"alcedinidae","summary":{"en":"Alcedinidae is the scientific family name for kingfishers.","zh":"Alcedinidae 是翠鸟（kingfisher）所属的科名（科学分类用语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the bird family that includes kingfishers; small to medium birds often found near water, known for sharp bills and fast dives to catch fish","zh":"翠鸟科；包含翠鸟等鸟类的一个科，常生活在水边，以尖长的喙和俯冲捕食（常抓鱼）而闻名"},"examples":[{"en":"The Alcedinidae are famous for diving into rivers to catch fish.","zh":"翠鸟科以俯冲入河捕鱼而闻名。"},{"en":"In wetland surveys, scientists may record species from the family Alcedinidae.","zh":"在湿地调查中，科学家可能会记录到翠鸟科的物种。"}]}],"synonyms":["kingfisher family","kingfishers (common term)"],"phonetic":"/ˌæl.səˈdɪn.ɪˌdi/","extraExplanation":["“Alcedinidae”是生物分类学里的“科名”，通常首字母大写并用斜体（Alcedinidae）。它来源于拉丁语相关词根（与“kingfisher/翠鸟”有关）。日常英语里更常说“kingfishers（翠鸟）”，而不是直接说这个科名。"]}
{"word":"Alcedininae","summary":{"en":"Alcedininae is the scientific name for a subfamily of kingfishers, often called river kingfishers.","zh":"Alcedininae 是翠鸟的一个亚科的学名，常被称为“河翠鸟”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a subfamily of kingfishers (family Alcedinidae), often called the “river kingfishers,” found mainly in Africa and Asia.","zh":"翠鸟科（Alcedinidae）中的一个亚科，常被称为“河翠鸟（river kingfishers）”，主要分布在非洲和亚洲。"},"examples":[{"en":"Many brightly colored kingfishers in Asia belong to the subfamily Alcedininae.","zh":"亚洲许多色彩鲜艳的翠鸟属于翠鸟亚科（Alcedininae）。"},{"en":"In some field guides, Alcedininae are described as specialists at hunting fish in rivers and streams.","zh":"在一些野外图鉴中，翠鸟亚科（Alcedininae）被描述为擅长在河流与溪流中捕鱼的类群。"}]}],"synonyms":["river kingfishers","kingfisher subfamily Alcedininae"],"phonetic":"/ælˌsiːdɪˈnaɪ.iː/","extraExplanation":["这是一个“生物分类学”名词：-inae 结尾通常表示“亚科”。Alcedininae 是翠鸟科（Alcedinidae）里的一个亚科名称。","词根来自拉丁化学名：Alcedo（常用作“翠鸟/普通翠鸟”的属名）+ -inae（亚科后缀）。在不同的分类系统里，亚科划分可能会因研究更新而略有变化。"]}
{"word":"alcedininae","summary":{"en":"Alcedininae is a taxonomic subfamily of kingfishers, often referred to as river kingfishers.","zh":"Alcedininae 指翠鸟科下的一个亚科，常被称为河翠鸟（或水翠鸟）类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a subfamily of kingfishers (family Alcedinidae), often called the “river kingfishers,” which typically hunt fish along rivers and streams.","zh":"翠鸟科（Alcedinidae）中的一个亚科，常被称为“河翠鸟/水翠鸟”类群，通常在河流与溪流附近捕食鱼类。"},"examples":[{"en":"The field guide lists the common kingfisher under the subfamily Alcedininae.","zh":"这本野外图鉴把普通翠鸟归在翠鸟亚科（Alcedininae）之下。"},{"en":"Researchers compared skull shapes across Alcedininae to understand how different species catch prey.","zh":"研究人员比较了翠鸟亚科（Alcedininae）不同物种的头骨形态，以了解它们如何捕捉猎物。"}]}],"synonyms":["river kingfishers"],"phonetic":"ˌæl.səˈdɪn.ɪˌni","extraExplanation":["“Alcedininae”是生物分类学名称：科（Alcedinidae，翠鸟科）之下的“亚科”。这种拉丁化命名常见于学术写作与物种名录中。","词尾“-inae”通常表示“亚科”，因此它更常出现在科研论文、分类检索和博物馆标注里，而不是日常英语对话。"]}
{"word":"Alcedo","summary":{"en":"Alcedo is the scientific genus name for certain small kingfishers.","zh":"Alcedo 是部分小型翠鸟的科学属名（翠鸟属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small, brightly colored kingfishers found mainly in Europe, Asia, and Africa (for example, the Common Kingfisher).","zh":"翠鸟属（Alcedo）：一种体型较小、羽色鲜艳的翠鸟类群，主要分布于欧洲、亚洲和非洲（如普通翠鸟）。"},"examples":[{"en":"The Common Kingfisher belongs to the genus Alcedo.","zh":"普通翠鸟属于翠鸟属（Alcedo）。"},{"en":"Researchers compared Alcedo species that live along rivers and streams.","zh":"研究人员比较了生活在河流与溪流沿岸的翠鸟属（Alcedo）物种。"}]}],"synonyms":["kingfisher (genus)","river kingfisher (general)"],"phonetic":"/ælˈsiːdoʊ/","extraExplanation":["“Alcedo”来自拉丁语 alcedo，意为“翠鸟”。它与英语中的“halcyon（宁静的；太平的）”有历史渊源：在古希腊—罗马传统里，翠鸟常与“风平浪静的日子（halcyon days）”联系在一起。","生物学写法中常用斜体表示属名（Alcedo），属名首字母大写；具体物种名与属名连写，如 *Alcedo atthis*（普通翠鸟）。"]}
{"word":"alcedo","summary":{"en":"Alcedo is the scientific genus name for certain kingfishers.","zh":"Alcedo 是某些翠鸟的属名（科学分类名称）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of kingfishers (a group of small, brightly colored fishing birds), including the common kingfisher.","zh":"翠鸟属（翠鸟的一类属名；多为体型小、色彩鲜艳、以鱼为食的鸟），包括普通翠鸟等。"},"examples":[{"en":"In older bird guides, the common kingfisher is listed as Alcedo atthis.","zh":"在较早的鸟类图鉴中，普通翠鸟常被标注为 Alcedo atthis。"},{"en":"The genus Alcedo is known for species that hunt by diving into water.","zh":"翠鸟属（Alcedo）的物种以俯冲入水捕食而闻名。"}]}],"synonyms":["kingfisher (general term)","genus (taxonomic term)"],"phonetic":"/ælˈseɪdoʊ/","extraExplanation":["“Alcedo”是拉丁化的科学名称，常见于生物分类学（属名首字母大写，如 Alcedo）。它与拉丁语中“翠鸟/渔鸟”的词源有关，也常被认为与希腊语中指“翠鸟”的词根有关；在英文里更常用普通词 kingfisher，而 Alcedo 多用于学术或观鸟记录。"]}
{"word":"alcelaphine","summary":{"en":"“Alcelaphine” means related to the African antelope group that includes wildebeests and hartebeests.","zh":"“alcelaphine”指与包含角马、牛羚等在内的非洲羚羊类群（牛羚亚科）相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Alcelaphinae, a group (subfamily/tribe) of African antelopes such as wildebeests and hartebeests.","zh":"与牛羚亚科（Alcelaphinae）有关的；指一类非洲羚羊，如角马和牛羚等。"},"examples":[{"en":"The museum has an alcelaphine skull on display, likely from a wildebeest.","zh":"博物馆展出了一具牛羚亚科动物的头骨，可能来自角马。"},{"en":"Researchers compared alcelaphine species to other antelopes using DNA data.","zh":"研究人员用 DNA 数据将牛羚亚科物种与其他羚羊进行比较。"}]}],"synonyms":["Alcelaphinae-related","wildebeest-related","hartebeest-related"],"phonetic":"/ælˈsɛləˌfaɪn/","extraExplanation":["“alcelaphine”是动物分类学（zoological taxonomy）里较少见的形容词，来自拉丁化的属名/类群名（Alcelaph-）。日常英语里更常见的说法是直接用具体动物名（wildebeest 角马、hartebeest 牛羚）或说“in the Alcelaphinae group”。","在不同资料中，Alcelaphinae 有时被当作“亚科（subfamily）”，有时被细分为“族（tribe）”；因此你可能会看到不同的分类层级，但“alcelaphine”都表示“属于这一类群/与之相关”。"]}
{"word":"Alcelaphus","summary":{"en":"Alcelaphus is the scientific genus name for hartebeests and related African antelopes.","zh":"Alcelaphus 是角马羚（hartebeest）及其近缘非洲羚羊的科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of African antelopes that includes the hartebeests (animals known for their long faces and sloping backs).","zh":"非洲羚羊的一属（包括角马羚/哈特比斯特羚等，常见特征是脸较长、背部向后倾斜）。"},"examples":[{"en":"The genus Alcelaphus includes the red hartebeest found in parts of southern Africa.","zh":"Alcelaphus（角马羚属）包括分布在非洲南部部分地区的红角马羚。"},{"en":"In the field guide, Alcelaphus is listed under bovids, the same family as cattle and goats.","zh":"在野外图鉴里，Alcelaphus 被列在牛科（bovids）之下，与牛和山羊同科。"}]}],"synonyms":["hartebeest (genus)","scientific genus name"],"phonetic":"/ælˈsɛləfəs/","extraExplanation":["这是一个拉丁化的学名（属名），日常英语对话里不常用，更常见的说法是“hartebeest（角马羚/哈特比斯特羚）”。","词源上可拆为希腊语/拉丁化元素：alce-（麋鹿/鹿）与 -elaphus（鹿），体现早期博物学命名里常用“鹿/羚羊”相关词根来给动物分类命名。"]}
{"word":"alcelaphus","summary":{"en":"Alcelaphus is the scientific genus name for hartebeests, a group of African antelopes.","zh":"Alcelaphus 是牛羚属的学名（属名），指一类非洲羚羊（牛羚）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A genus of African antelopes that includes the hartebeests, known for their long faces and sloping backs.","zh":"牛羚属（非洲的一类羚羊），包括多种牛羚；常见特征是脸部细长、背部略向下倾。"},"examples":[{"en":"The red hartebeest belongs to the genus Alcelaphus.","zh":"红牛羚属于牛羚属（Alcelaphus）。"},{"en":"In African savannas, Alcelaphus species often graze in open grassland.","zh":"在非洲稀树草原上，牛羚属的物种常在开阔草地上取食。"}]}],"synonyms":["hartebeest (common name)"],"phonetic":"/ælˌsɛləˈfəs/","extraExplanation":["“Alcelaphus”是动物分类学（拉丁化的学名）中的属名，通常在科普文章、动物图鉴或学术写作中出现；日常英语更常说“hartebeest（牛羚）”。","在英文中，属名首字母要大写并常用斜体（Alcelaphus）；表示单个物种时常与种加词连用，如 *Alcelaphus buselaphus*（一种牛羚）。"]}
{"word":"Alces","summary":{"en":"Alces is the scientific genus name for the moose (e.g., Alces alces).","zh":"Alces 是驼鹿属的学名（属名），如 Alces alces（驼鹿）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific genus name for the moose (and closely related animals), used in biology (e.g., Alces alces).","zh":"（生物学）驼鹿属的学名（属名），例如 Alces alces（驼鹿）。"},"examples":[{"en":"The moose is classified in the genus Alces.","zh":"驼鹿被归类在驼鹿属（Alces）中。"},{"en":"In scientific writing, Alces is capitalized and italicized.","zh":"在科学写作中，Alces 要首字母大写并用斜体。"}]}],"synonyms":["moose (common name)","genus Alces"],"phonetic":"ˈæl.siːz","extraExplanation":["“Alces”是拉丁化的学名（属名），多用于学术语境；日常英语里一般直接说“moose”（北美常用）或在欧洲语境下也会说“elk”（但北美的“elk”通常指马鹿/wapiti，含义不同，需注意地区差异）。","生物分类写法提示：属名首字母大写（Alces），种加词小写（alces），合起来写作 *Alces alces*。"]}
{"word":"alces","summary":{"en":"*Alces* is the scientific genus name for the moose.","zh":"*Alces* 是驼鹿（moose）的科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific (Latin) genus name for the moose; used in biology to classify moose species (e.g., *Alces alces*).","zh":"（生物学）麋鹿/驼鹿的属名（拉丁学名属），用于分类驼鹿，例如 *Alces alces*。"},"examples":[{"en":"The moose is classified in the genus *Alces*.","zh":"驼鹿被归类在 *Alces* 这一属中。"},{"en":"In older sources you may see *Alces alces* used for the Eurasian moose.","zh":"在较早的资料中，你可能会看到用 *Alces alces* 指欧亚驼鹿。"}]}],"synonyms":["moose","*Alces alces*"],"phonetic":"/ˈæl.siz/","extraExplanation":["“Alces”是拉丁化的科学命名：通常首字母大写并用斜体（*Alces*）。在日常英语里人们更常说 moose（北美）或 elk（英式英语里常指驼鹿；但美式英语里 elk 多指马鹿/麋鹿 Wapiti），所以阅读科普或论文时看到“Alces”要把它理解成“驼鹿这一类动物的属名”。"]}
{"word":"Alceste","summary":{"en":"Alceste is a literary/mythological name: either the self-sacrificing queen (Alcestis) in Greek myth or the idealistic, blunt hero of Molière’s *The Misanthrope*.","zh":"Alceste 是文学/神话人物名：可指希腊神话中为爱牺牲的王后（Alcestis），也可指莫里哀《恨世者》中理想主义且直率的男主角。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper name) A character name used in Greek myth and in European literature, most famously referring to Alcestis/Alceste, a queen known for sacrificing herself for her husband, and to Alceste, the frank, idealistic man in Molière’s play *The Misanthrope*.","zh":"（专有名）一个出现在希腊神话与欧洲文学中的人物名。最著名的用法指“阿尔刻斯提斯/阿尔塞斯特”（以为丈夫牺牲自己而闻名的王后），以及莫里哀喜剧《恨世者》中的阿尔塞斯特（直率、理想主义的男主角）。"},"examples":[{"en":"In Greek mythology, Alceste (often written as Alcestis) is remembered for her self-sacrifice.","zh":"在希腊神话中，Alceste（常写作 Alcestis）因自我牺牲而被铭记。"},{"en":"In Molière’s *The Misanthrope*, Alceste insists on honesty even when it hurts.","zh":"在莫里哀的《恨世者》中，Alceste 坚持诚实，即使会伤人。"}]}],"synonyms":["Alcestis"],"phonetic":"/ælˈsɛst/","extraExplanation":["“Alceste”是法语/英语里常见的拼写；在古希腊语传统中更常见的是“Alcestis（阿尔刻斯提斯）”。两者在不同作品与译本中会互相对应。","莫里哀（17世纪法国剧作家）的 Alceste 并不是神话人物本人，而是借用古典名字来塑造“厌恶虚伪、追求真诚”的人物形象。阅读时可根据作品背景判断指的是哪一位。"]}
{"word":"Alcester","summary":{"en":"Alcester is a market town in Warwickshire, England, and the name is commonly used in addresses and local institution names.","zh":"Alcester（阿尔切斯特）是英国英格兰沃里克郡的一座集镇，也常作为地址与当地机构名称中的地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small market town in Warwickshire, England, near Stratford-upon-Avon","zh":"（英国）英格兰沃里克郡的一座小集镇（市镇），靠近斯特拉特福德（莎士比亚故乡）"},"examples":[{"en":"Alcester is a quiet market town in Warwickshire.","zh":"阿尔切斯特是沃里克郡一座安静的集镇。"},{"en":"We stopped in Alcester on the way to Stratford-upon-Avon.","zh":"我们去斯特拉特福德的路上在阿尔切斯特停了一下。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used in addresses and local institutions (e.g., “Alcester Grammar School”)","zh":"用于地址与当地机构名称中的地名（如“Alcester Grammar School / 阿尔切斯特文法学校”）"},"examples":[{"en":"Her package was sent to Alcester, Warwickshire.","zh":"她的包裹寄到了沃里克郡的阿尔切斯特。"},{"en":"He works for a business based in Alcester.","zh":"他在一家位于阿尔切斯特的公司工作。"}]}],"synonyms":["(no direct synonyms; it is a proper place name)"],"phonetic":"/ˈælstər/","extraExplanation":["Alcester 常被认为源自拉丁语和古英语的地名组合：罗马时期此地与“堡垒/营地（-chester）”有关，因此许多以 -cester/-chester 结尾的英国地名往往与古罗马营地或要塞有关。","在英语中它是专有名词，通常不加冠词（说 “in Alcester”，而不是 “in the Alcester”）。"]}
{"word":"Alcestis","summary":{"en":"Alcestis is a figure from Greek mythology known for sacrificing herself for her husband, and it is also the title of a tragedy by Euripides based on that myth.","zh":"Alcestis（阿尔刻斯提斯）既指希腊神话中为丈夫牺牲、后被救回的女子，也指欧里庇得斯根据该神话创作的同名戏剧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, the devoted wife of King Admetus who agrees to die in his place and is later brought back to life (often by Heracles).","zh":"（希腊神话）阿尔刻斯提斯：阿德墨托斯国王忠贞的妻子，愿意代替丈夫去死，后常在故事中被（如赫拉克勒斯）救回人间。"},"examples":[{"en":"Alcestis is remembered for sacrificing herself to save her husband, Admetus.","zh":"阿尔刻斯提斯因替丈夫阿德墨托斯牺牲而被人铭记。"},{"en":"In some versions of the myth, Heracles wrestles Death and returns Alcestis to the living.","zh":"在某些版本的神话里，赫拉克勒斯与死神搏斗，把阿尔刻斯提斯带回人间。"}]},{"partOfSpeech":"n.","definition":{"en":"A famous ancient Greek play by Euripides (438 BCE) based on the myth of Alcestis.","zh":"（古希腊戏剧）欧里庇得斯于公元前438年创作的戏剧《阿尔刻斯提斯》，取材于同名神话。"},"examples":[{"en":"We read Euripides’ Alcestis in literature class.","zh":"我们在文学课上读了欧里庇得斯的《阿尔刻斯提斯》。"},{"en":"The play Alcestis explores love, duty, and the meaning of sacrifice.","zh":"《阿尔刻斯提斯》探讨了爱、责任与牺牲的意义。"}]}],"synonyms":["(related) Admetus","(related) Heracles","(related) Euripides’ tragedy"],"phonetic":"/ælˈsɛstɪs/","extraExplanation":["“Alcestis”既是神话人物名，也常指欧里庇得斯的同名戏剧；写作时可根据上下文判断是“人物”还是“作品”。","在英文里它属于专有名词，通常首字母大写：Alcestis。","该故事常被用来讨论“自我牺牲”“婚姻承诺”和“死亡的界限”等主题，在西方文学与戏剧传统中很有影响。"]}
{"word":"alcestis","summary":{"en":"Alcestis is (1) a queen in Greek myth known for dying for her husband, and (2) the title of a play by Euripides about that story.","zh":"Alcestis 指（1）希腊神话中以替夫赴死著称的王后阿尔刻斯提斯；也指（2）欧里庇得斯以此故事为题的戏剧《阿尔刻斯提斯》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, a queen of Thessaly (wife of King Admetus) famous for offering to die in her husband’s place; a symbol of loyal, self-sacrificing love.","zh":"（希腊神话）阿尔刻斯提斯：帖萨利的王后（阿德墨托斯之妻），以愿意代夫而死而闻名；常被视为忠诚与自我牺牲之爱的象征。"},"examples":[{"en":"In the myth, Alcestis chooses to die so that Admetus can live.","zh":"在神话中，阿尔刻斯提斯选择替阿德墨托斯去死，让丈夫得以活下去。"},{"en":"Some writers use Alcestis as an example of devotion and sacrifice.","zh":"一些作家用阿尔刻斯提斯来举例说明奉献与牺牲。"}]},{"partOfSpeech":"n.","definition":{"en":"A tragedy (often described as a tragicomedy) by the ancient Greek playwright Euripides, titled Alcestis.","zh":"《阿尔刻斯提斯》：古希腊悲剧作家欧里庇得斯的一部戏剧（常被认为带有悲喜剧色彩）。"},"examples":[{"en":"We read Euripides’ Alcestis in class to discuss heroism and duty.","zh":"我们在课上读了欧里庇得斯的《阿尔刻斯提斯》，讨论英雄主义与责任。"},{"en":"In Alcestis, Heracles plays an important role in changing the outcome.","zh":"在《阿尔刻斯提斯》中，赫拉克勒斯在改变结局方面起了重要作用。"}]}],"synonyms":["Alcestis (Euripides)"],"phonetic":"/ælˈsɛstɪs/","extraExplanation":["“Alcestis”是希腊语名字的英译，常见读法重音在第二音节：al-SES-tis。","故事核心是“以死换生”的约定：阿德墨托斯本应死去，但若有人自愿替他死，他就能继续活。最终只有阿尔刻斯提斯愿意承担。","欧里庇得斯的《阿尔刻斯提斯》很特别：虽然题材沉重，但结局带有“被救回/复归”的转折，因此常被讨论为介于悲剧与喜剧之间的作品。","在英语文学评论里，提到“an Alcestis figure”时，通常指“愿为所爱之人牺牲自己的人”（多指女性形象），属于文化典故用法。"]}
{"word":"alchem","summary":{"en":"“alchem-” is a root meaning “alchemy-related,” used in words like alchemy/alchemist/alchemical rather than alone.","zh":"“alchem-”是表示“与炼金术有关”的词根，常见于 alchemy/alchemist/alchemical 等词中，通常不单独使用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a word root/combining form meaning “related to alchemy” (seen in words like alchemy, alchemist, alchemical). It is not usually used as a standalone word in modern English.","zh":"词根/构词成分，表示“与炼金术有关”（常见于 alchemy, alchemist, alchemical 等词）。现代英语中通常不单独作为一个词使用。"},"examples":[{"en":"She loves fantasy novels full of alchemists and strange experiments.","zh":"她喜欢充满炼金术士和奇异实验的奇幻小说。"},{"en":"The lab’s “alchemical” process turned waste into useful material.","zh":"实验室那种“炼金般”的过程把废物变成了有用的材料。"}]}],"synonyms":["alchemy-related","alchemical"],"phonetic":"/ˈæl.kə.mi/","extraExplanation":["“alchemy（炼金术）”历史上既指把普通金属变成黄金的尝试，也指早期化学、药学与哲学思想的混合体系。现代英语里 alchemical 常带比喻义，表示“神奇的转化/点石成金式的改变”。","词源上与阿拉伯语 al-（定冠词“the”）有关：alchemy 来自中世纪拉丁语/法语，最终追溯到阿拉伯语 al-kīmiyāʾ。"]}
{"word":"alchemic","summary":{"en":"Alchemic means relating to alchemy, or (figuratively) seeming magically transformative.","zh":"Alchemic 指与炼金术有关，或引申为“仿佛具有魔法般转化力量的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to alchemy (the old practice that tried to change metals into gold and discover special medicines); also used more broadly for something that seems magically transformative.","zh":"与“炼金术”有关的（古代试图把金属变成黄金、寻找灵药的实践）；也可引申指“仿佛具有魔法般的转化力量”。"},"examples":[{"en":"Medieval texts describe alchemic experiments meant to turn lead into gold.","zh":"中世纪文献描述了旨在把铅变成黄金的炼金术实验。"},{"en":"Some people call cooking an alchemic art because simple ingredients become something new.","zh":"有人把烹饪称为“炼金般的艺术”，因为简单食材会变成全新的东西。"}]}],"synonyms":["alchemical","transformative (figurative)","mystical (figurative)"],"phonetic":"/ælˈkɛmɪk/","extraExplanation":["“alchemic”是“alchemy（炼金术）”的形容词形式之一；更常见的形容词还有“alchemical”。两者意思接近，但“alchemical”在现代英语里更常用、更自然。","文学或评论中常用“alchemic/alchemical”作比喻，强调某种转化（把普通变成珍贵、把痛苦变成力量等），不一定真与化学实验有关。"]}
{"word":"alchemical","summary":{"en":"Alchemical means related to alchemy, or metaphorically magical and transformative.","zh":"alchemical 指与炼金术相关，或比喻“神奇且具有转化力的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to alchemy (an old tradition that tried to change ordinary metals into gold and to discover a “cure-all” medicine).","zh":"与炼金术有关的（炼金术是一种古老传统，试图把普通金属变成黄金，并寻找“万能药”）。"},"examples":[{"en":"The novel has an alchemical atmosphere, full of symbols and secret knowledge.","zh":"这部小说有一种炼金术般的氛围，充满象征与隐秘的知识。"},{"en":"Medieval alchemical texts often mix science, religion, and poetry.","zh":"中世纪的炼金术文本常把科学、宗教与诗意写作混在一起。"}]},{"partOfSpeech":"adj.","definition":{"en":"Seeming magical or transformative; able to change something in a surprising way (often used metaphorically).","zh":"（常作比喻）仿佛具有魔力或转化力的；能以出人意料的方式改变事物的。"},"examples":[{"en":"There was something alchemical about the way music lifted everyone’s mood.","zh":"音乐提振所有人情绪的方式有一种“炼金术般”的神奇。"},{"en":"Her cooking has an alchemical power to turn simple ingredients into comfort food.","zh":"她的厨艺有种炼金术般的力量，能把简单食材变成慰藉人心的食物。"}]}],"synonyms":["magical","transformative","mystical","esoteric"],"phonetic":"/ælˈkɛmɪkəl/","extraExplanation":["“alchemical”来自“alchemy（炼金术）”。在现代英语里，它既可用于字面（与炼金术、古代实验传统相关），也常用于比喻，强调“神奇的转化、点石成金般的改变”。","文学与流行文化中，“alchemical”常用来营造神秘、象征、隐秘知识的氛围。比如保罗·柯艾略的小说《The Alchemist》（《炼金术士》）让“炼金术/炼金术般”在当代读者中更常被联想到“人生转化与追寻”。"]}
{"word":"alchemically","summary":{"en":"Alchemically means “in a way related to alchemy,” often used figuratively to mean “transformatively, as if by magic.”","zh":"alchemically 意为“以炼金术的方式；与炼金术有关地”，也常作比喻表示“以神奇的转化方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to alchemy (an old tradition that tried to transform materials—especially turning metal into gold—and to discover a universal medicine).","zh":"以炼金术的方式；与炼金术有关地（炼金术是一种古老传统，试图转化物质，尤其把金属变成黄金，并寻找万能药）。"},"examples":[{"en":"The novel describes a scientist who alchemically transforms ordinary metals into gold.","zh":"这部小说描写了一位科学家用炼金术般的方式把普通金属变成黄金。"},{"en":"She speaks of love as something that can alchemically change pain into wisdom.","zh":"她说爱情能以“炼金术般”的方式把痛苦变成智慧。"}]},{"partOfSpeech":"adv.","definition":{"en":"Figuratively: in a transformative, almost magical way (changing one thing into something very different or better).","zh":"（比喻）以近乎魔法的转化方式；把某物变成截然不同或更好的东西地。"},"examples":[{"en":"Good editing can alchemically turn a messy draft into a clear story.","zh":"好的编辑能以“炼金术般”的方式把杂乱的草稿变成清晰的故事。"},{"en":"The chef alchemically combined simple ingredients into an elegant dish.","zh":"主厨以“炼金术般”的手法把简单食材组合成一道精致菜肴。"}]}],"synonyms":["transformatively","magically","mysteriously","in an alchemical way"],"phonetic":"/ælˈkɛmɪkli/","extraExplanation":["“alchemically”来自“alchemy（炼金术）”。在现代英语里，它常用作比喻，强调一种“奇妙的转化”：把低价值/普通/痛苦的东西变成高价值/特别/有意义的东西。","常见搭配有：alchemically transform（炼金术般地转化）、alchemically change A into B（把A神奇地变成B）。在文学与评论写作中很常见，用来增强画面感与象征意味。"]}
{"word":"alchemies","summary":{"en":"“Alchemies” is the plural of “alchemy,” meaning either historical alchemy (early chemistry) or, figuratively, different kinds of powerful transformation.","zh":"“alchemies”是“alchemy（炼金术）”的复数，既可指历史上的炼金术传统，也可比喻各种强大的“转化”过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of “alchemy”: a medieval early form of chemistry that tried to change ordinary metals into gold and to find a life-extending “elixir,” often mixing science, philosophy, and mysticism","zh":"“alchemy（炼金术）”的复数：中世纪早期的一种“化学/哲学”体系，试图把普通金属变成黄金，并寻找延长生命的“长生药/灵药”，常结合科学、哲学与神秘思想"},"examples":[{"en":"Medieval books describe many different alchemies practiced across Europe and the Middle East.","zh":"中世纪的书籍描写了在欧洲和中东各地流行的多种炼金术传统。"},{"en":"The museum shows tools used in early alchemies before modern chemistry developed.","zh":"博物馆展出了现代化学出现之前，各种早期炼金术所用的工具。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) different kinds of “magical” transformations—ways of turning something ordinary into something valuable or beautiful","zh":"（比喻）不同形式的“神奇转化”——把普通事物变得珍贵或美好的方法/过程"},"examples":[{"en":"Her poems explore the alchemies of memory—pain turning into meaning.","zh":"她的诗探讨记忆的炼金术：痛苦如何转化为意义。"},{"en":"Good teaching has its own alchemies: confusion becomes understanding.","zh":"好的教学有它的炼金术：困惑变成理解。"}]}],"synonyms":["transformations","transmutations","magic (figurative)","early chemistry (historical context)"],"phonetic":"/ˈæl.kə.mi/","extraExplanation":["“alchemy”的词源来自阿拉伯语“al-kīmiyāʾ”，后来进入欧洲语言。历史上的炼金术并不等同于现代化学，但它推动了实验方法、器具与材料知识的发展。","在文学里，“alchemy/ alchemies”常用作隐喻，强调“转化（transformation）”与“把平凡变非凡”的感觉。英语中也常见搭配：the alchemy of + 名词（如 the alchemy of love / art / cooking）。"]}
{"word":"Alchemilla","summary":{"en":"Alchemilla is a plant genus called lady’s mantle, famous for its round leaves that collect water droplets.","zh":"Alchemilla 是“披风草/女士斗篷草”（lady’s mantle）的植物属，以能在圆叶上聚集水滴而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of low-growing plants commonly called lady’s mantle, known for round, pleated leaves that hold beads of water (dew or rain).","zh":"一种常见被称为“披风草/女士斗篷草”（lady’s mantle）的植物属，特点是圆形、带褶皱的叶片，常能托住露珠或雨滴。"},"examples":[{"en":"Alchemilla is often planted along garden borders for its soft green leaves and tiny yellow-green flowers.","zh":"披风草（Alchemilla）常被种在花园边缘，用它柔和的绿叶和细小的黄绿色花作点缀。"},{"en":"After the rain, drops of water sit on Alchemilla leaves like little glass beads.","zh":"雨后，水滴会像小玻璃珠一样停在披风草的叶子上。"}]}],"synonyms":["lady’s mantle","Alchemilla mollis (a common species)"],"phonetic":"ˌæl.kəˈmɪl.ə","extraExplanation":["词源与文化：Alchemilla 的名字与“alchemy（炼金术）”有关。中世纪时期人们注意到它的叶片会聚集露水，并把这些露水称为“天露”，认为可用于炼金或药用实验，因此得名。","常见英文名：lady’s mantle（“女士斗篷”）来自叶片形状像披肩/斗篷的联想。在园艺写作中常见的具体种是 Alchemilla mollis（园艺披风草）。","使用场景提示：这是一个植物学属名，英语中常以大写开头（Alchemilla）。日常对话里更常说 lady’s mantle。"]}
{"word":"alchemilla","summary":{"en":"Alchemilla is the plant genus known as lady’s mantle, valued for its scalloped leaves that often hold beads of water.","zh":"Alchemilla 指“斗篷草/女士斗篷草”这一植物属，以扇形锯齿叶片和能托住水珠的特征而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small flowering plants commonly called lady’s mantle, often grown in gardens; some species have scalloped leaves that hold beads of water.","zh":"炼金草属（又称“斗篷草 / 女士斗篷草”）的一类小型开花植物，常见于园艺种植；其叶片常呈扇形锯齿，能托住水珠。"},"examples":[{"en":"Alchemilla mollis is popular in gardens for its soft, fan-shaped leaves.","zh":"斗篷草（Alchemilla mollis）因柔软的扇形叶片而很受园艺爱好者欢迎。"},{"en":"After the rain, drops of water sit like pearls on alchemilla leaves.","zh":"雨后，水滴像珍珠一样停在炼金草的叶子上。"}]}],"synonyms":["lady’s mantle","Alchemilla mollis (a common species)"],"phonetic":"/ˌæl.kəˈmɪl.ə/","extraExplanation":["“Alchemilla”这个名字与“alchemy（炼金术）”有关：传统上人们注意到它叶面常聚起晶莹水珠（露水或雨水），在中世纪欧洲被赋予神秘色彩，被认为可用于炼金或药用实验。","常见园艺名是“lady’s mantle（女士斗篷）”，来自叶片形状像披风/斗篷的联想；在文学与自然描写中，它常用来表现清晨露珠与细致的自然之美。"]}
{"word":"alchemise","summary":{"en":"Alchemise means to transform something as if by magic, or (less commonly) to practice alchemy.","zh":"alchemise 指“像魔法般转化（事物）”，较少见的意思是“从事炼金术”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to change (something) completely, often in a surprising or creative way, as if by magic; to transform","zh":"（像炼金术一样）使（某物）发生彻底改变；（常指出人意料地、富有创造性地）转化"},"examples":[{"en":"The director alchemised a simple story into a powerful film.","zh":"导演把一个简单的故事“炼”成了一部有力量的电影。"},{"en":"Good teachers can alchemise curiosity into real skills.","zh":"好老师能把好奇心“点化”为真正的技能。"}]},{"partOfSpeech":"v.","definition":{"en":"to practice alchemy (an old attempt to turn base metals into gold and to find a universal medicine)","zh":"从事炼金术（古代试图把贱金属变成黄金、并寻找“万能药”的实践）"},"examples":[{"en":"In old legends, scholars alchemised in secret rooms late at night.","zh":"在古老传说里，学者常在深夜的密室里进行炼金术实验。"}]}],"synonyms":["transform","transmute","convert","turn","metamorphose"],"phonetic":"/ˈælkəˌmaɪz/","extraExplanation":["“alchemise”更常见于英式拼写；美式拼写更常用“alchemize”。两者意思相同。","词根来自阿拉伯语“al-”（定冠词“the”）+希腊语/拉丁语体系中关于“alchemy（炼金术）”的词源。现代英语里多用于比喻：把普通事物转化成非凡成果。"]}
{"word":"alchemised","summary":{"en":"“Alchemised” means “transformed (as if by alchemy),” often used metaphorically in literature.","zh":"“alchemised”意为“像炼金术一样把……转化”，常用于文学性的比喻表达。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"changed or transformed something in a mysterious, seemingly magical way (past tense/past participle of alchemise).","zh":"（alchemise 的过去式/过去分词）以神秘、近乎“魔法”的方式把某物改变或转化。"},"examples":[{"en":"She alchemised her grief into art.","zh":"她把悲伤“炼化”为艺术。"},{"en":"The chef alchemised simple vegetables into a rich, comforting soup.","zh":"这位厨师把普通蔬菜“点化”为浓郁暖心的汤。"},{"en":"Time had alchemised their anger into understanding.","zh":"时间把他们的愤怒“转化”为理解。"}]},{"partOfSpeech":"adj.","definition":{"en":"made or treated using alchemy (historical/rare use).","zh":"（历史/罕见用法）用炼金术制作的；用炼金术处理过的。"},"examples":[{"en":"The story mentions alchemised metals kept in a hidden chamber.","zh":"故事提到密室里保存着用炼金术处理过的金属。"},{"en":"He hunted for an alchemised elixir in old manuscripts.","zh":"他在古手稿中寻找炼金术制成的灵药。"}]}],"synonyms":["transformed","converted","transmuted","turned into","refined"],"phonetic":"/ˈæl.kəˌmaɪzd/","extraExplanation":["“alchemised/alchemized”多见于文学或修辞表达，强调“把一种体验/材料转成更珍贵之物”的意象，常用于情感、时间、创作、料理等语境。","拼写上英式常用 alchemise/alchemised，美式更常见 alchemize/alchemized；含义相同。"]}
{"word":"alchemising","summary":{"en":"Alchemising means transforming something—often figuratively—in a seemingly magical way; it can also mean practicing alchemy in the old historical sense.","zh":"alchemising 指以“炼金术般”的方式转化事物（多为比喻），也可指历史上的炼金术实践。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of alchemise) to transform something in a seemingly magical or surprising way, especially by turning something ordinary into something valuable (often figurative).","zh":"（alchemise 的现在分词）以似乎“炼金术般”的方式转化某物，尤其指把平凡之物变得更有价值（多为比喻用法）。"},"examples":[{"en":"She’s alchemising her painful experiences into powerful songs.","zh":"她把痛苦的经历“炼金”成了有力量的歌曲。"},{"en":"Good teachers are always alchemising confusion into clarity.","zh":"优秀的老师总能把困惑“炼金”成清晰。"}]},{"partOfSpeech":"v.","definition":{"en":"(literal, historical) to practice alchemy—trying to change base metals into gold or discover a universal medicine.","zh":"（字面义、历史）从事炼金术——试图把贱金属变成黄金，或寻找“万能药”。"},"examples":[{"en":"In old stories, scholars spent years alchemising in hidden laboratories.","zh":"在古老故事里，学者们在隐秘的实验室里炼金多年。"}]}],"synonyms":["transforming","transmuting","converting","turning","metamorphosing"],"phonetic":"/ˈæl.kəˌmaɪ.zɪŋ/","extraExplanation":["“alchemising”是英式拼写；美式更常见“alchemizing”。两者意思相同。","该词常用于文学或评论语境，强调一种“把普通变珍贵”的创造性转化，带有隐喻色彩。"]}
{"word":"alchemist","summary":{"en":"An alchemist is historically a practitioner of alchemy who tried to turn metals into gold or find the elixir of life; figuratively, it means someone who transforms something ordinary into something valuable.","zh":"alchemist 指历史上的“炼金术士”，尝试点金或寻找长生不老药；也可作比喻，指能把普通事物转化为有价值成果的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person in the past who tried to change ordinary metals into gold and searched for a magical medicine that could cure illness or make people live longer (the “elixir of life”)","zh":"炼金术士；古代尝试把普通金属变成黄金，并寻找能治病或延长寿命的“长生不老药”的人"},"examples":[{"en":"In medieval Europe, many alchemists believed they could turn lead into gold.","zh":"在中世纪欧洲，许多炼金术士相信他们能把铅变成黄金。"},{"en":"The novel uses the alchemist as a symbol of transformation and inner growth.","zh":"这部小说用“炼金术士”象征转变与内在成长。"}]},{"partOfSpeech":"n.","definition":{"en":"someone who is very skilled at transforming things—especially turning something ordinary into something valuable or beautiful (figurative use)","zh":"（比喻）善于“点石成金”的人；能把普通事物变得很有价值或很精彩的人"},"examples":[{"en":"She’s an alchemist with leftovers, turning simple ingredients into great meals.","zh":"她像个“炼金术士”，能把剩菜剩饭变成美味佳肴。"},{"en":"The producer was an alchemist, making unknown singers into stars.","zh":"那位制作人像炼金术士一样，把无名歌手打造成明星。"}]}],"synonyms":["alchemizer (rare)","transformer (figurative)","magician (figurative)"],"phonetic":"/ˈæl.kə.mɪst/","extraExplanation":["“alchemy（炼金术）”在历史上介于早期化学、哲学与神秘传统之间；许多炼金术士的实验与记录，后来对现代化学的发展有间接影响。","文学与流行文化中，“alchemist”常被用作“转化/蜕变”的隐喻：把外在材料的改变对应到人的心灵成长与自我实现。"]}
{"word":"alchemister","summary":{"en":"Alchemister (rare/archaic) means an alchemist—someone who practices alchemy.","zh":"alchemister（较少见/古体）指炼金术士，即从事炼金术的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who practices alchemy (an old tradition that tried to change base metals into gold and discover life-extending medicines); an alchemist. This form is rare or archaic in modern English.","zh":"炼金术士；从事炼金术的人（古老传统，试图把普通金属变成黄金、并寻找延寿药物）。此拼写在现代英语中较少见/偏古体。"},"examples":[{"en":"In the novel, the alchemister works in secret, searching for the philosopher’s stone.","zh":"在小说里，那位炼金术士秘密工作，寻找“贤者之石”。"},{"en":"People once believed an alchemister could turn lead into gold.","zh":"人们曾相信炼金术士能把铅变成金。"}]}],"synonyms":["alchemist","adept (literary)","occultist (context-dependent)"],"phonetic":"/ˈæl.kə.mɪ.stɚ/","extraExplanation":["“alchemister”多被视为“alchemist”的罕见变体拼写，常见于较古老或仿古风格的文本。现代写作中通常用“alchemist”。","文化背景：炼金术在欧洲中世纪与文艺复兴时期很流行，既有“化金为银/金”的追求，也包含早期化学与药学探索；文学作品中常把炼金术士塑造成神秘学者或隐士形象。"]}
{"word":"alchemistic","summary":{"en":"Alchemistic means “related to alchemy” or “suggesting a magical transformation,” often used in literary or artistic contexts.","zh":"Alchemistic 意为“与炼金术有关的”或“带有神奇转化意味的”，常见于文学与艺术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to alchemy (a historical mix of early chemistry, philosophy, and mysticism), especially the idea of trying to transform ordinary materials into something precious or spiritually “higher.”","zh":"与炼金术有关的（炼金术是早期化学、哲学与神秘主义的混合），尤指把普通物质转化为珍贵之物或在精神层面“提升/转化”的观念。"},"examples":[{"en":"The novel uses alchemistic imagery to show the hero’s inner transformation.","zh":"这部小说用炼金术式的意象来表现主人公的内在蜕变。"},{"en":"They spoke in an alchemistic language of fire, metals, and secret formulas.","zh":"他们用一种炼金术式的语言谈论火、金属和秘密配方。"},{"en":"In art criticism, “alchemistic” can suggest turning everyday life into something magical through creativity.","zh":"在艺术评论里，“alchemistic”可指通过创造力把日常生活“点化”为带魔力的东西。"}]}],"synonyms":["alchemical","occult","mystical","esoteric"],"phonetic":"/ˌæl.kəˈmɪs.tɪk/","extraExplanation":["“alchemistic”比“alchemical”更少见；现代英语里通常更常用“alchemical”。两者意思很接近，都表示“炼金术的/像炼金术的”。","在文学与文化语境中，炼金术常被当作隐喻：把“粗糙的经历”转化为“智慧/成长”，或把“普通材料”变成“艺术/价值”。"]}
{"word":"alchemistical","summary":{"en":"An adjective meaning “related to alchemy,” or figuratively “mysteriously transformative.”","zh":"形容词：与炼金术相关；或比喻“具有神秘转化力量的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to alchemy (an old practice that mixed early chemistry with philosophy and magic), especially attempts to change base metals into gold or to find a universal cure.","zh":"与炼金术有关的（炼金术是一种古老的实践，结合了早期化学、哲学与神秘/魔法元素），尤其指把贱金属变成黄金或寻找万能药的尝试。"},"examples":[{"en":"The novel describes an alchemistical experiment in a hidden basement lab.","zh":"这部小说描写了一个在隐秘地下实验室进行的炼金术实验。"},{"en":"In medieval Europe, many people believed alchemistical recipes could lead to gold.","zh":"在中世纪欧洲，许多人相信炼金术配方能够炼出黄金。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Seeming to transform something in a mysterious or surprising way.","zh":"（比喻）似乎以神秘或出人意料的方式把某物“转化”。"},"examples":[{"en":"Her alchemistical ability to turn scraps into art amazed everyone.","zh":"她把零碎材料“点石成金”变成艺术的能力令大家惊叹。"},{"en":"The director has an alchemistical talent for turning simple stories into powerful films.","zh":"这位导演有一种“炼金般”的本事，把简单故事拍成很有力量的电影。"}]}],"synonyms":["alchemical","occult (in some contexts)","transformative (figurative)"],"phonetic":"/ˌæl.kəˈmɪs.tɪ.kəl/","extraExplanation":["“alchemistical”比“alchemical”更少见、带一点古旧/书面味道；现代英语里更常用的是“alchemical”。","文学与文化中，炼金术常被当作“转化”的象征：不仅是把金属变成金子，也象征自我修炼、思想或灵魂的改变。常见相关词：alchemy, alchemical, philosopher’s stone（贤者之石）。"]}
{"word":"alchemistry","summary":{"en":"Alchemistry is a rare term meaning alchemy or very early chemistry.","zh":"Alchemistry 是个较少见的词，通常指炼金术或非常早期的化学。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/old-fashioned) Alchemy: a medieval practice that tried to change ordinary metals into gold and discover a universal medicine.","zh":"（罕见/旧式）炼金术：中世纪的一种实践，试图把普通金属变成黄金，并寻找“万能药”。"},"examples":[{"en":"In old stories, alchemistry promised that lead could become gold.","zh":"在古老故事里，炼金术声称铅可以变成黄金。"},{"en":"The novel uses alchemistry as a symbol of transformation and hope.","zh":"这部小说把炼金术当作“转变与希望”的象征。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) Early chemistry, especially before modern scientific methods became standard.","zh":"（罕见）早期化学：尤指现代科学方法尚未普及之前的化学研究。"},"examples":[{"en":"Some writers describe early laboratory work as alchemistry rather than chemistry.","zh":"一些作者会把早期的实验室工作称为“炼金式的化学”，而不是现代意义上的化学。"}]}],"synonyms":["alchemy","early chemistry","proto-chemistry"],"phonetic":"/ˈæl.kəˌmɪs.tri/","extraExplanation":["“alchemistry”在现代英语里非常少见，更常用的词是“alchemy”。它多出现在较旧的文本中，或作者刻意用来营造古风/神秘氛围。","词根来自阿拉伯语“al-”（定冠词“the”）+ “kīmiyā’”（化学/炼金术），因此与“alchemy/chemistry”有亲缘关系。"]}
{"word":"alchemists","summary":{"en":"“Alchemists” means people who practiced alchemy, an early science that aimed to transform metals (like lead) into gold and discover a life-extending elixir.","zh":"“alchemists”指炼金术士，即从事炼金术的人；炼金术是一种早期科学/术法，试图把金属（如铅）变成黄金，并寻找延寿的灵药。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who practiced alchemy: an early form of chemistry that tried to change ordinary metals into gold and to find a medicine for long life.","zh":"炼金术士：从事炼金术的人。炼金术是早期的化学尝试，目标包括把普通金属变成黄金、寻找延年益寿的“灵药”。"},"examples":[{"en":"In medieval stories, alchemists tried to turn lead into gold.","zh":"在中世纪的故事里，炼金术士试图把铅变成黄金。"},{"en":"The novel features an alchemist searching for the secret of eternal life.","zh":"这部小说里有一位炼金术士在寻找长生不老的秘密。"}]}],"synonyms":["alchemy practitioners","adepts","occultists"],"phonetic":"/ˈæl.kə.mɪsts/","extraExplanation":["“alchemists”是“alchemist”的复数形式。","炼金术在欧洲与阿拉伯世界都很重要：它既有实验的一面（器具、蒸馏等方法），也常和宗教、哲学、象征意义联系在一起。现代化学在一定程度上继承并发展了其中的实验传统。","在文学和流行文化中，alchemist常被用作隐喻：指“把普通事物转化为珍贵成果的人”（例如把艰难经历转化为智慧的创作者）。"]}
{"word":"alchemize","summary":{"en":"Alchemize means to transform something—literally by alchemy, or more commonly in a figurative sense, to turn something ordinary into something valuable.","zh":"Alchemize 指“转化、炼成”：字面上是用炼金术炼制；更常见的是比喻把普通的事物转化为有价值的成果。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to change or transform something by alchemy (an old practice that tried to turn ordinary metals into gold and discover a life-extending “elixir”).","zh":"用炼金术改变或转化某物（古代试图把普通金属变成黄金，并寻找“长生不老药”的做法）。"},"examples":[{"en":"In the legend, the magician tried to alchemize lead into gold.","zh":"在传说里，魔法师试图用炼金术把铅炼成金子。"},{"en":"Medieval texts described how to alchemize metals using secret recipes.","zh":"中世纪文献描述了如何用秘密配方来炼制金属。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) to transform something completely into a new and often better form.","zh":"（比喻）把某事物彻底转化成一种新的、往往更好的形式。"},"examples":[{"en":"She could alchemize a rough idea into a clear plan.","zh":"她能把粗糙的想法“炼”成清晰的计划。"},{"en":"Good teachers alchemize curiosity into lasting motivation.","zh":"好老师能把好奇心转化为持久的动力。"},{"en":"The writer alchemized personal grief into a powerful novel.","zh":"这位作家把个人的悲痛转化成了一部有力量的小说。"}]}],"synonyms":["transform","transmute","convert","turn","refine"],"phonetic":"/ˈæl.kəˌmaɪz/","extraExplanation":["“alchemize”来自“alchemy（炼金术）”。在现代英语里，它常用于文学或评论写作中，强调一种近乎“魔法般”的转化，尤其是把平凡、痛苦或混乱的东西变成有价值的成果。","常见搭配：alchemize A into B（把A转化成B）。例如：alchemize experience into wisdom（把经历化为智慧）。"]}
{"word":"alchemized","summary":{"en":"“Alchemized” means transformed something in a seemingly magical way, often turning the ordinary or painful into something valuable.","zh":"“alchemized”常指以“炼金术般”的方式转化事物，尤指把平凡或痛苦的经历转化为更有价值的成果。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"changed or transformed (something) in a surprising or almost magical way, as if by alchemy; turned into something more valuable or different in nature","zh":"（仿佛通过炼金术般）把（某物）转化、点化成另一种更有价值或性质不同的东西；带有“神奇转化”的比喻意味"},"examples":[{"en":"She alchemized a painful breakup into a powerful song.","zh":"她把痛苦的分手点化成了一首有力量的歌。"},{"en":"The chef alchemized simple ingredients into an unforgettable meal.","zh":"这位厨师把简单的食材“炼”成了一顿令人难忘的美餐。"},{"en":"In the novel, the city’s hardships are alchemized into hope and solidarity.","zh":"在小说里，城市的苦难被“炼化”为希望与团结。"}]},{"partOfSpeech":"vt.","definition":{"en":"(less common, literal) treated (materials) using alchemy or alchemical methods","zh":"（较少见，字面义）用炼金术或炼金术式的方法处理（材料）"},"examples":[{"en":"The manuscript claims that metals were alchemized in secret workshops.","zh":"手稿声称金属曾在秘密作坊里被用炼金术处理。"}]}],"synonyms":["transformed","converted","transmuted","turned","refined"],"phonetic":"/ˈæl.kəˌmaɪzd/","extraExplanation":["“alchemized”来自动词 alchemize（炼金术 → 比喻“点石成金”）。现代英语里更常见的是比喻用法：把痛苦、平凡经历、失败、原材料等“转化”为价值、意义或美感。","语感上它比 change/transform 更带文学色彩，暗示“不可思议的转化”或“把低价值变高价值”。常见搭配：alchemize X into Y（把X炼成Y）。"]}
{"word":"alchemizing","summary":{"en":"“Alchemizing” means transforming something—often figuratively—in a striking, almost magical way; historically, it refers to practicing alchemy to turn metals into gold.","zh":"“alchemizing”指以仿佛神奇般的方式转化事物（多为比喻）；历史上也指炼金术中把金属炼成黄金。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"changing something into something else in a seemingly magical, surprising, or creative way (often used figuratively).","zh":"（常为比喻）以一种仿佛“魔法般”、出人意料或很有创意的方式把某物转变成另一种东西。"},"examples":[{"en":"She is alchemizing her grief into art.","zh":"她把悲伤“炼化”为艺术。"},{"en":"Good teachers can alchemize a boring topic into an exciting lesson.","zh":"好老师能把枯燥的话题“点化”成精彩的课堂。"}]},{"partOfSpeech":"v.","definition":{"en":"trying to turn base metals into gold, as in historical alchemy.","zh":"（历史上的炼金术）试图把贱金属炼成黄金。"},"examples":[{"en":"In old stories, alchemizing metals was a secret pursuit.","zh":"在古老故事里，把金属炼成黄金是一种秘密追求。"}]}],"synonyms":["transforming","transmuting","turning","converting","reworking","refining"],"phonetic":"/ˈæl.kəˌmaɪ.zɪŋ/","extraExplanation":["“alchemizing”来自“alchemy（炼金术）”。在英语里它很常用作比喻：强调把平凡、痛苦或混乱的东西“转化”为有价值的结果（如把失败化为经验、把情绪化为作品）。","语气上通常带一点文学感/诗意，写作里比“changing”更有画面感；日常口语中用得较少，但在评论、演讲、艺术与自我成长话题中很常见。","常见搭配：alchemize X into Y（把X转化为Y）；the alchemy of…（……的神奇转化力量）。"]}
{"word":"alchemy","summary":{"en":"Alchemy is (1) a medieval early chemistry aimed at turning metals into gold and finding a life-giving cure, and (2) a metaphor for a magical transformation.","zh":"Alchemy 指（1）中世纪的炼金术：试图炼金与求长生之药；（2）比喻“神奇的转化”，把平凡变得珍贵或美好。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medieval early form of chemistry that tried to change ordinary metals into gold, and to find a substance that could cure disease and give long life.","zh":"炼金术（中世纪的一种早期化学实践，试图把普通金属变成黄金，并寻找能治病、延年益寿的神奇物质）。"},"examples":[{"en":"In the Middle Ages, many scholars studied alchemy to search for a way to make gold.","zh":"在中世纪，许多学者研究炼金术，寻找制造黄金的方法。"},{"en":"Alchemy mixed experiments with philosophy and spiritual beliefs.","zh":"炼金术把实验与哲学、宗教或精神信仰混合在一起。"}]},{"partOfSpeech":"n.","definition":{"en":"A mysterious or magical process of transformation, especially turning something ordinary into something valuable or beautiful.","zh":"（比喻）奇妙的转化过程；点石成金般的变化（把普通事物变得更珍贵或更美好）。"},"examples":[{"en":"Great cooking can feel like alchemy—simple ingredients become an amazing meal.","zh":"高水平的烹饪有时像炼金术——简单的食材变成一顿惊艳的饭。"},{"en":"They talked about the alchemy of friendship, how strangers became close friends.","zh":"他们谈到友谊的“炼金术”——陌生人如何变成挚友。"}]}],"synonyms":["magic","transformation","mysticism","early chemistry"],"phonetic":"/ˈæl.kə.mi/","extraExplanation":["“alchemy”源自阿拉伯语 *al-kīmiyāʾ*（其中 *al-* 是定冠词“the”），后来进入拉丁语与英语。现代化学（chemistry）在历史上与炼金术有传承关系：炼金术虽有许多不科学的目标，但也推动了实验方法、器具和物质研究的发展。","文学与文化中，“alchemy”常用来营造神秘、转化与追求永恒的意象，例如提到“philosopher’s stone（贤者之石）”或“elixir of life（长生不老药）”。在现代写作里，它常作为比喻，表示“把平凡变不凡”的创造力或情感变化。"]}
{"word":"alchera","summary":{"en":"Alchera: an Aboriginal Australian term for the Dreamtime/Dreaming—the ancestral creation era and its continuing spiritual reality.","zh":"Alchera：澳大利亚原住民语词，指“梦幻时／梦见”——祖灵创世的远古时代及其延续的精神现实。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a term (from Central Australian Aboriginal languages, especially Arrernte) referring to the “Dreamtime” or “Dreaming,” the sacred ancestral era when the world was formed and ancestral beings created laws, places, and cultural traditions; also used for the continuing spiritual reality connected to those stories","zh":"（源自澳大利亚中部原住民语言，尤指阿伦特语 Arrernte）指“梦幻时／梦见（Dreamtime/Dreaming）”：祖灵在神圣的远古时代创造世界、制定律法、形成地貌与文化传统的时期；也可指与这些故事相连、持续存在的精神世界"},"examples":[{"en":"In some writings, “Alchera” is used to describe the Dreamtime stories that explain how the land was formed.","zh":"在一些文字中，“Alchera”用来指解释大地如何形成的“梦幻时”故事。"},{"en":"The artist said her painting was inspired by Alchera—ancestral journeys across the desert.","zh":"那位艺术家说，她的画作灵感来自 Alchera——祖灵穿越沙漠的旅程。"}]}],"synonyms":["Dreamtime","the Dreaming","Alcheringa"],"phonetic":"/ælˈtʃɛrə/","extraExplanation":["“Alchera”常被视为“Alcheringa”的拼写变体。学术与当代语境里也常用“The Dreaming / Dreamtime”。不同原住民民族与语言对这一概念的表达不尽相同，含义也可能有细微差别。","在使用该词时，建议尊重其宗教／文化敏感性：许多相关故事、地名与仪式具有特定的传承规则，并非所有细节都适合公开传播。若用于写作或学习，最好参考可靠来源并标注具体族群与地区。"]}
{"word":"alcheringa","summary":{"en":"Alcheringa refers to the Aboriginal concept of the Dreamtime—ancestral creation and an ongoing spiritual framework connecting people, land, and law; it’s also used as a name for some festivals or groups.","zh":"Alcheringa 指澳大利亚原住民“梦幻时光／Dreamtime”的观念：祖灵创世及持续存在的精神体系，连接人、土地与律法；也常被借用作节庆或组织名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Australian Aboriginal, especially Arrernte) the Dreamtime—ancestral time and continuing spiritual reality that explains creation, law, and connections between people, land, and beings.","zh":"（澳大利亚原住民文化，尤指阿伦特 Arrernte）“梦幻时光／梦幻纪元”（Dreamtime）——祖灵创世的时代，也是一种持续存在的精神现实，用来解释世界的起源、律法与人与土地、万物之间的联系。"},"examples":[{"en":"In some Central Australian traditions, Alcheringa stories describe how ancestral beings shaped the landscape.","zh":"在澳大利亚中部的一些传统中，Alcheringa 的故事讲述祖灵如何塑造地貌。"},{"en":"The guide reminded visitors that Alcheringa is a living belief, not just a myth from the past.","zh":"导览员提醒游客：Alcheringa 是活的信仰体系，不只是过去的神话。"}]},{"partOfSpeech":"n.","definition":{"en":"A name used for events or organizations (e.g., a university cultural festival) that draw on the idea of “Dreamtime.”","zh":"用作活动或组织名称（例如大学文化节）的词，借用“梦幻时光／Dreamtime”的意涵。"},"examples":[{"en":"She performed at Alcheringa, the cultural festival hosted by IIT Guwahati.","zh":"她在 IIT Guwahati 举办的文化节 Alcheringa 上演出。"}]}],"synonyms":["Dreamtime","Dreaming"],"phonetic":"/ˌæl.tʃəˈrɪŋ.ɡə/","extraExplanation":["“Alcheringa”一词常与 Arrernte 语相关，英文里也常用 Dreamtime 对应，但不同原住民群体对“梦幻时光”的称呼与理解不尽相同；在写作或讨论时，尽量注明具体族群/地区来源，并避免把它简化成“传说”或“幻想”。","在澳大利亚语境中，它涉及对土地（Country）的关系与文化法则（Law）。若在公共场合使用（如活动命名、文案），通常应尊重并遵循相关原住民社群的文化指引与致谢方式（Acknowledgement of Country）。"]}
{"word":"alchim","summary":{"en":"“Alchim” is a rare/archaic form related to “alchemy,” meaning the old art of transmuting metals (and, figuratively, a mysterious transformation).","zh":"“alchim”是与“alchemy（炼金术）”相关的罕见/古体形式：指把金属变成黄金的古代术，也可引申为神秘的转化过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic) A spelling/short form related to “alchemy”: the old practice that tried to change common metals into gold and to discover a universal medicine; in modern use, it often means a mysterious process of transformation.","zh":"（罕见/古体）与“alchemy（炼金术）”相关的拼写或缩写：指古代试图把普通金属变成黄金、寻找“万能药”的学术/技艺；现代常引申为一种神秘的“转化过程”。"},"examples":[{"en":"In some older texts, you may see “alchim” used where modern English would use “alchemy.”","zh":"在一些较老的文本中，你可能会看到用“alchim”来表示现代英语里的“alchemy（炼金术）”。"},{"en":"People sometimes use “alchemy” metaphorically: “the alchemy of love” meaning a powerful change in someone’s life.","zh":"人们也常把“alchemy”作比喻：例如“the alchemy of love（爱情的炼金术）”，表示一种强烈的生命转变。"}]}],"synonyms":["alchemy","transmutation","magic (figurative)","transformation (figurative)"],"phonetic":"/ˈælkəmi/","extraExplanation":["“alchim”在现代英语里非常不常见；如果你是在拼写或查词，通常你想找的是：alchemy /ˈælkəmi/（炼金术）。","炼金术在欧洲中世纪与文艺复兴时期很流行，既包含早期化学实验，也带有宗教/哲学象征（比如“把低等物质提升为高等物质”）。因此在文学里常被借用来表达“神奇的转变”。","相关词：alchemist（炼金术士），alchemical（炼金术的；引申：神奇转化的）。"]}
{"word":"alchimy","summary":{"en":"“Alchimy” is usually a misspelling of “alchemy”: medieval proto-chemistry and, figuratively, a magical transformation.","zh":"“alchimy”通常是“alchemy”的误拼：本义为中世纪炼金术；引申为“点石成金”的转化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled “alchemy”) an early form of chemistry in the Middle Ages, mixing science, philosophy, and mysticism; it aimed to change one substance into another (especially turning base metals into gold) and to find an “elixir” for long life.","zh":"（通常拼作“alchemy”）炼金术：中世纪早期的化学形态，融合科学、哲学与神秘思想；目标包括把普通金属变成黄金，以及寻找“长生不老药”。"},"examples":[{"en":"In medieval Europe, alchemy was closely connected to medicine and religion.","zh":"在中世纪欧洲，炼金术与医学和宗教关系密切。"},{"en":"Many famous scientists were influenced by alchemy before modern chemistry developed.","zh":"在现代化学形成之前，许多著名科学家都曾受炼金术影响。"}]},{"partOfSpeech":"n.","definition":{"en":"A process that seems like magic because it transforms something ordinary into something valuable or beautiful.","zh":"（比喻）点石成金般的转化：把普通事物变得珍贵或美好的过程。"},"examples":[{"en":"Her cooking has a kind of alchemy—simple ingredients become an amazing meal.","zh":"她的厨艺有种“炼金术”般的魔力——简单食材能变成一顿惊艳的饭。"},{"en":"The film captures the alchemy of friendship turning hardship into hope.","zh":"这部电影呈现了友谊的“炼金术”——把艰难转化为希望。"}]}],"synonyms":["transformation","magic","chemistry","mysticism","sorcery"],"phonetic":"/ˈælkəmi/","extraExplanation":["你输入的“alchimy”是常见拼写误差；标准拼写是 **alchemy**。","词源来自阿拉伯语 *al-kīmiyāʾ*（其中 *al-* 表示“the/这门”），后来进入拉丁语和法语，再进入英语。","文学与文化中常把“alchemy”用作隐喻，强调一种看似神奇的“转化力量”。例如保罗·科埃略的小说《牧羊少年奇幻之旅》（*The Alchemist*）就借“炼金术士”象征追寻人生目标与内在成长。"]}
{"word":"alchitran","summary":{"en":"Alchitran is a rare word meaning tar or pitch (a thick, dark, sticky substance).","zh":"Alchitran 是个较罕见的词，意思是焦油或沥青（浓稠、深色、黏性的物质）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/obsolete) Tar or pitch: a thick, dark, sticky substance from wood or petroleum, used for waterproofing or paving.","zh":"（罕见/旧用）焦油或沥青：一种浓稠、深色、黏性的物质，可来自木材或石油，用于防水或铺路。"},"examples":[{"en":"The boat’s seams were sealed with alchitran to keep water out.","zh":"船的接缝用 alchitran（焦油/沥青）封住，以防进水。"},{"en":"In older texts, alchitran may refer to tar used in construction or repairs.","zh":"在较旧的文本里，alchitran 可能指用于建筑或修补的焦油。"}]}],"synonyms":["tar","pitch","bitumen","asphalt"],"phonetic":"/ˌæl.kɪˈtræn/","extraExplanation":["“alchitran”在现代英语中几乎不用，更常见的是 tar / pitch / bitumen。它很可能与西班牙语“alquitrán（焦油）”有关，而该词又可追溯到阿拉伯语词源（常见于以 al- 开头的借词）。如果你是在某本书、历史材料或多语言语境中看到它，通常就按“焦油/沥青”理解即可。","拼写上也常见混淆：你看到的“alchitran”可能是“alquitran/alquitrán”的转写或变体；不同语言和出版年代会导致拼法不一致。"]}
{"word":"alchochoden","summary":{"en":"“alchochoden” is not a standard English word; it’s probably a misspelling (often of “alcohol”) or a name.","zh":"“alchochoden”不是标准英语单词；很可能是拼写错误（常见是“alcohol”）或某个名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name (for example, a username, brand, or a mistaken spelling of a real word).","zh":"不是标准英语单词。很可能是拼写错误，或是某个名字（例如用户名、品牌名），也可能是把某个真实单词拼错了。"},"examples":[{"en":"I couldn’t find “alchochoden” in an English dictionary—could you share the sentence you saw it in?","zh":"我在英语词典里查不到“alchochoden”——你能把它出现的句子发给我吗？"},{"en":"If you meant “alcohol,” the spelling is a-l-c-o-h-o-l.","zh":"如果你想写的是“alcohol（酒精/酒）”，拼写是 a-l-c-o-h-o-l。"}]}],"phonetic":"N/A","extraExplanation":["“alchochoden”看起来像把“alcohol（酒精/酒）”拼错了（常见错误：把 alcohol 写成 alchohol / alcho…）。也有可能你想写的是某种药名或品牌名。","如果你把它出现的语境（整句、截图、或它指的是什么）发我，我可以更准确地判断你想要的单词，并给出正确拼写、读音和用法。"]}
{"word":"Alchornea","summary":{"en":"Alchornea is a botanical genus of tropical shrubs and small trees in the spurge family.","zh":"Alchornea 是大戟科的一属热带灌木或小乔木的属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of shrubs and small trees in the spurge family (Euphorbiaceae), found mainly in tropical regions (especially Africa, Asia, and the Americas).","zh":"黄桐属（Alchornea）：大戟科（Euphorbiaceae）的一属灌木或小乔木，主要分布在热带地区（尤以非洲、亚洲与美洲为主）。"},"examples":[{"en":"Alchornea species are common in tropical forests and forest edges.","zh":"黄桐属的一些物种常见于热带森林及林缘地带。"},{"en":"In a botany class, we learned that Alchornea belongs to the Euphorbiaceae family.","zh":"在植物学课上，我们学到黄桐属属于大戟科。"}]}],"synonyms":["(botany) genus name: Alchornea"],"phonetic":"/ælˈkɔrniə/","extraExplanation":["“Alchornea”是拉丁化的植物学属名，日常英语里通常出现在学术写作、植物名录或药用植物资料中，而不太用于一般口语。","该属中较常被提到的物种之一是 Alchornea cordifolia（在部分地区有地方俗名），在民间传统中有药用记载；但草药使用可能存在安全风险与剂量问题，最好以可靠来源与专业建议为准。"]}
{"word":"alchornea","summary":{"en":"Alchornea is a scientific name for a genus of tropical shrubs and small trees.","zh":"Alchornea 是热带灌木或小乔木的一个植物属名（学名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical plants (family Euphorbiaceae), including shrubs and small trees found especially in Africa and the Americas; some species are used in traditional medicine.","zh":"黄杨叶属（大戟科）植物的一个属，主要分布于非洲与美洲的热带地区，多为灌木或小乔木；部分物种在传统医药中有应用。"},"examples":[{"en":"Researchers studied Alchornea leaves for their chemical compounds.","zh":"研究人员分析了黄杨叶属（Alchornea）植物叶片中的化学成分。"},{"en":"In some regions, Alchornea is used in traditional herbal remedies.","zh":"在一些地区，黄杨叶属植物会被用于传统草药疗法。"}]}],"synonyms":["genus Alchornea","Alchornea plant","Euphorbiaceae genus"],"phonetic":"/ælˈkɔrniə/","extraExplanation":["“Alchornea”是植物学中的拉丁学名（属名），通常在学术论文、植物志或药用植物资料中出现；日常英语里不常用，多出现在科普或科研语境。","常见写法是首字母大写并用斜体：Alchornea（表示属名）。如果指某个具体物种，会写成“Alchornea + 种加词”，例如 Alchornea cordifolia。"]}
{"word":"Alchuine","summary":{"en":"Alchuine is a rare/older spelling of Alcuin, a famous medieval scholar connected with Charlemagne’s court.","zh":"Alchuine 是 Alcuin（阿尔昆）的罕见/旧式拼写，指与查理曼大帝宫廷相关的著名中世纪学者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a variant spelling of **Alcuin**, a medieval English scholar and churchman who worked at Charlemagne’s court and helped promote education in the Carolingian Renaissance.","zh":"**Alcuin（阿尔昆）**的异拼写：中世纪英格兰学者与教士，曾在查理曼大帝宫廷任职，推动教育与“加洛林文艺复兴”。"},"examples":[{"en":"Some older books spell his name as **Alchuine**, but modern English usually uses **Alcuin**.","zh":"一些旧书会把他的名字拼作 **Alchuine**，但现代英语通常用 **Alcuin**。"},{"en":"**Alchuine/Alcuin** advised Charlemagne on schools and learning.","zh":"**Alchuine/Alcuin** 曾为查理曼大帝的学校与学术事务提供建议。"}]}],"synonyms":["Alcuin","Alcuinus"],"phonetic":"/ˈælkwɪn/","extraExplanation":["“Alchuine”较少见，通常出现在较早的拉丁化或地方拼写传统中；现代学术与通用英语更常用 **Alcuin (of York)**。","阿尔昆常被认为是“加洛林文艺复兴”的关键人物之一，参与宫廷学校与教材整理，对中世纪欧洲教育体系影响很大。"]}
{"word":"alchym","summary":{"en":"“Alchym” is an archaic spelling of “alchemy,” meaning medieval proto-chemistry and, figuratively, a magical transformation process.","zh":"“alchym”是“alchemy（炼金术）”的古旧拼写：既指中世纪的炼金术，也可比喻“神奇的转化过程”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An old or nonstandard spelling of “alchemy,” the medieval practice that mixed early chemistry with philosophy and mysticism (often aiming to turn base metals into gold or find a life-extending elixir).","zh":"“alchemy（炼金术）”的古旧或非标准拼写；指中世纪将早期化学与哲学、神秘思想结合的实践（常追求点石成金或寻找长生灵药）。"},"examples":[{"en":"In old texts, you may see “alchym” used where modern English would write “alchemy.”","zh":"在旧文献中，你可能会看到用“alchym”来表示现代英语里的“alchemy（炼金术）”。"},{"en":"The novel describes a scholar studying alchym in search of a cure for disease.","zh":"小说描写一位学者研究“alchym（炼金术）”，寻找治病的办法。"}]},{"partOfSpeech":"n.","definition":{"en":"Figuratively: a seemingly magical process of transforming something ordinary into something valuable or beautiful (also usually written “alchemy”).","zh":"（比喻）把平凡之物“神奇般”转化为珍贵或美好之物的过程（通常写作“alchemy”）。"},"examples":[{"en":"Great teachers have an alchym that turns confusion into understanding.","zh":"优秀的老师仿佛有种“炼金术”，能把困惑变成理解。"},{"en":"Their friendship had an alchym that made hard times feel lighter.","zh":"他们的友谊像有种“炼金术”，让艰难时光也变得没那么沉重。"}]}],"synonyms":["alchemy","alchymy (archaic)","transformation (figurative)","metamorphosis (figurative)"],"phonetic":"/ˈæl.kə.mi/","extraExplanation":["“alchym”多见于较早期的英语拼写（也可见“alchymy”），现代标准写法是“alchemy”。在学习或检索资料时，建议用“alchemy”查词更容易找到权威解释与例句。","词源上与阿拉伯语“al-”(定冠词“the”)有关，体现了中世纪欧洲通过阿拉伯世界吸收古典科学知识的历史背景。","文学与文化中“alchemy”常用来营造神秘、古老的氛围，或象征“蜕变/转化”的主题。"]}
{"word":"alchymies","summary":{"en":"“Alchymies” is an archaic spelling of “alchemies,” meaning the practices of alchemy or, figuratively, magical transformations.","zh":"“alchymies”是“alchemies”的古拼写，既可指炼金术的种种实践，也可比喻看似神奇的转变。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of alchemy: old or mystical practices that tried to change common metals into gold and discover a life-extending “elixir.”","zh":"alchemy（炼金术）的复数：指古老或神秘的实验与学说，试图把普通金属变成黄金，并寻找延年益寿的“灵药”。"},"examples":[{"en":"Medieval writers described many alchymies for turning lead into gold.","zh":"中世纪作家描述了许多把铅变成金的“炼金术”方法。"},{"en":"In old stories, kings paid for alchymies and secret laboratories.","zh":"在古老故事里，国王会资助炼金术和秘密实验室。"}]},{"partOfSpeech":"n.","definition":{"en":"Figurative: surprising or magical-looking changes (often in art, love, or ideas).","zh":"（比喻）看似神奇、令人惊讶的转变（常用于艺术、爱情或思想等语境）。"},"examples":[{"en":"Good teaching can work small alchymies in a shy student’s confidence.","zh":"好的教学能在害羞学生的自信上产生小小的“点石成金”的变化。"},{"en":"Poets write about the alchymies of memory—how pain can turn into wisdom.","zh":"诗人常写记忆的“炼金术”——痛苦如何转化为智慧。"}]}],"synonyms":["alchemies","alchemy","transmutations","transformations"],"phonetic":"/ˈæl.kə.miz/","extraExplanation":["“alchymies”是“alchemies”的古拼写（archaic spelling），常见于早期现代英语的诗歌与宗教/哲学文本中。现代英语通常写作“alchemies”。"]}
{"word":"alchymy","summary":{"en":"Alchemy is an ancient tradition aiming to transform metals and find a life-extending medicine; today it also means a seemingly magical transformation.","zh":"Alchemy 指古代的炼金术（炼金与求“万能药”），也可比喻看似神奇的转化过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Alchemy (often misspelled as “alchymy”) is an old practice that tried to change common metals into gold and to discover a universal medicine for long life.","zh":"炼金术（常被拼成“alchymy”）是一种古老的实践，试图把普通金属变成黄金，并寻找能延年益寿的“万能药”。"},"examples":[{"en":"In medieval Europe, alchemists believed they could turn lead into gold.","zh":"在中世纪欧洲，炼金术士相信他们能把铅变成黄金。"},{"en":"Alchemy mixed early chemistry with philosophy and spirituality.","zh":"炼金术把早期化学与哲学、灵性观念混在一起。"}]},{"partOfSpeech":"n.","definition":{"en":"Alchemy also means a mysterious or magical process of change, especially when something ordinary becomes something valuable or beautiful.","zh":"alchemy 也可指一种“神奇的转化过程”，尤其是把平凡之物变得珍贵或美好的变化。"},"examples":[{"en":"Great teachers have a kind of alchemy—they make hard ideas feel simple.","zh":"优秀的老师仿佛有一种“点石成金”的能力——能把难懂的概念讲得简单。"},{"en":"Their friendship had an alchemy that made bad days easier.","zh":"他们的友谊有种神奇的力量，让糟糕的日子也更容易熬过去。"}]}],"synonyms":["transformation","magic","mystique","chemistry (figurative)","transmutation"],"phonetic":"/ˈælkəmi/","extraExplanation":["拼写提醒：标准拼写是 alchemy（不是 *alchymy*）。发音重音在第一音节。","词源背景：alchemy 来自阿拉伯语 *al-kīmiyāʾ*（其中 *al-* 是定冠词“the”），后进入欧洲语言。炼金术在历史上与占星术、宗教象征和自然哲学有联系。","文化用法：现代英语里常把 alchemy 当作比喻，表示“把普通变成非凡”的创造力或奇妙化学反应（如团队默契、艺术创作、爱情等）。"]}
{"word":"Alcibiadean","summary":{"en":"Alcibiadean describes something connected to Alcibiades, or someone/something seen as charming, ambitious, and politically changeable like him.","zh":"Alcibiadean 指与阿尔西比亚德相关，或形容像他一样迷人、有野心但政治立场多变、带投机色彩的人或风格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Alcibiades (an Athenian statesman and general), or showing qualities traditionally associated with him—especially charm, ambition, political opportunism, and shifting loyalties.","zh":"与阿尔西比亚德（雅典政治家、将军）有关的；或具有传统上与他相关的特质——尤指迷人但野心强、政治投机、立场反复、善变的风格。"},"examples":[{"en":"Some historians describe him as an Alcibiadean figure—brilliant, persuasive, and hard to trust.","zh":"一些历史学家把他形容为“阿尔西比亚德式”的人物——才华横溢、很有说服力，却很难让人信任。"},{"en":"Her Alcibiadean talent for winning allies sometimes came with sudden changes of direction.","zh":"她那种“阿尔西比亚德式”的结盟手腕，有时伴随着方向的突然转变。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who resembles Alcibiades or follows his style of politics; an admirer or imitator of Alcibiades.","zh":"像阿尔西比亚德的人；奉行其政治风格的人；阿尔西比亚德的崇拜者或模仿者。"},"examples":[{"en":"In the play, the young Alcibiadean is torn between loyalty and self-interest.","zh":"在剧中，这位年轻的“阿尔西比亚德派”人物在忠诚与私利之间挣扎。"}]}],"synonyms":["opportunistic","Machiavellian","protean","mercurial"],"phonetic":"/ˌæl.sə.bɪˈdaɪ.ən/","extraExplanation":["“Alcibiadean”来自古希腊人物 Alcibiades（约公元前450—404）。他以口才与个人魅力著称，也因在雅典、斯巴达与波斯之间多次转换阵营而饱受争议。因此该词在英语里常带有“耀眼但不可靠、机会主义”的评价色彩，常见于历史写作、政治评论与文学批评语境。","文学/经典语境中常与柏拉图对话录《会饮篇》（Symposium）里阿尔西比亚德的登场形象相关：既迷人又自负，强调个人魅力与权力欲望的复杂混合。"]}
{"word":"alcibiadean","summary":{"en":"Alcibiadean means “of Alcibiades” or, by extension, “brilliant and charismatic but opportunistic or unreliable.”","zh":"Alcibiadean 指“与阿尔基比亚德有关的”，也可引申为“才华与魅力兼具，但投机或不可靠的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Alcibiades, an ancient Athenian statesman and general.","zh":"与阿尔基比亚德（Alcibiades），古雅典政治家与将军，有关的；阿尔基比亚德式的。"},"examples":[{"en":"The essay explores the Alcibiadean politics of shifting alliances in wartime Athens.","zh":"这篇文章探讨了战时雅典那种阿尔基比亚德式的、不断转换盟友的政治。"},{"en":"Her thesis compares Alcibiadean ambition with Periclean leadership.","zh":"她的论文把阿尔基比亚德式的野心与伯里克利式的领导力作比较。"}]},{"partOfSpeech":"adj.","definition":{"en":"Clever and charismatic but seen as opportunistic, untrustworthy, or morally flexible (in the way Alcibiades is often portrayed).","zh":"（引申）聪明迷人但带有投机、反复无常或道德弹性大（常被认为具有“阿尔基比亚德式”特质）。"},"examples":[{"en":"Some critics call him an Alcibiadean figure—brilliant on stage, unreliable off it.","zh":"一些评论家称他是“阿尔基比亚德式”的人物——台上才华横溢，台下却不太可靠。"},{"en":"The novel’s hero has an Alcibiadean charm that keeps drawing people back despite his betrayals.","zh":"小说主角有一种阿尔基比亚德式的魅力，即便他曾背叛他人，人们仍会被他吸引回来。"}]}],"synonyms":["Alcibiades-like","Athenian (context-specific)","opportunistic","mercurial","charismatic"],"phonetic":"/ˌæl.sɪ.baɪˈdiː.ən/","extraExplanation":["“Alcibiadean”来自 Alcibiades（阿尔基比亚德）。他活跃于伯罗奔尼撒战争时期，以口才、魅力与野心著称，也因政治立场多次转变而饱受争议。因而这个词既可作中性学术用语（指“与其相关”），也可带评价色彩（指“聪明却机会主义/不够可靠”）。","常见于历史、政治评论与文学批评语境，用来暗示一种“迷人的野心家、但道德或忠诚度不稳定”的人物类型。"]}
{"word":"Alcibiades","summary":{"en":"Alcibiades was a famous Athenian leader known for brilliance, charisma, and changing sides; his name can also mean a charming but unreliable person.","zh":"阿尔西比亚德是以才华与魅力、以及多次倒向不同阵营而闻名的雅典领袖；其名也可引申为“迷人但不可靠的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An influential Athenian politician, general, and orator (c. 450–404 BCE), famous for his charisma, shifting loyalties during the Peloponnesian War, and close association with Socrates in ancient sources.","zh":"阿尔西比亚德（约公元前450–前404）：雅典著名的政治家、将领与演说家，以个人魅力、在伯罗奔尼撒战争中多次改变阵营、以及在古代文献中与苏格拉底的密切关联而闻名。"},"examples":[{"en":"Alcibiades persuaded Athens to launch the Sicilian Expedition, a decision that ended disastrously.","zh":"阿尔西比亚德说服雅典发动西西里远征，但这一决定以惨败告终。"},{"en":"In Plato’s works, Alcibiades appears as a brilliant but morally unstable young man.","zh":"在柏拉图的作品中，阿尔西比亚德常被描写为才华横溢却道德不稳的青年。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension) A symbol of dazzling charm mixed with ambition and unreliability—someone whose talent is impressive but whose loyalty or judgment may be questionable.","zh":"（引申）指“魅力耀眼但野心强、立场不稳的人”：才能出众，却可能缺乏忠诚或判断失准。"},"examples":[{"en":"Some critics call the character an Alcibiades figure—magnetic, gifted, and hard to trust.","zh":"有评论家称这个角色是“阿尔西比亚德式人物”——迷人、有才华，却很难信任。"},{"en":"He’s no Alcibiades, but his sudden switch of sides shocked everyone.","zh":"他当然称不上阿尔西比亚德，但他突然倒戈仍让所有人震惊。"}]}],"synonyms":["Pericles","Socrates","Peloponnesian War figure"],"phonetic":"ˌælsəˈbaɪədiːz","extraExplanation":["“Alcibiades”是古希腊人名，现代英语中多用于历史与文学语境。最常见的发音重音落在“-bi-”附近。","他在伯罗奔尼撒战争中的“多次转向”（雅典→斯巴达→波斯势力→回到雅典）使他常被视为政治投机与个人野心的典型。","文学与哲学作品中，他常与苏格拉底并置：例如柏拉图《会饮篇》（Symposium）和《阿尔西比亚德》（Alcibiades，作者归属有争议）都强化了他“才华与欲望并存”的形象。"]}
{"word":"alcibiades","summary":{"en":"Alcibiades is a famous Athenian general and politician; the name can also describe a charming but unreliable opportunist.","zh":"Alcibiades（阿尔西比亚德）是著名的雅典将军与政治家；也可引申指有魅力但不可靠、投机的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An Athenian politician and general (c. 450–404 BCE), famous for his charisma, ambition, and shifting loyalties during the Peloponnesian War.","zh":"阿尔西比亚德（约公元前450—404年），雅典的政治家与将军，以强烈的个人魅力、野心，以及在伯罗奔尼撒战争中多次改变阵营而闻名。"},"examples":[{"en":"Alcibiades was brilliant in politics but often accused of putting his own ambition first.","zh":"阿尔西比亚德在政治上很聪明，但常被指责把个人野心放在第一位。"},{"en":"Many histories of the Peloponnesian War describe Alcibiades as both a talented leader and a risky ally.","zh":"许多关于伯罗奔尼撒战争的历史著作都把阿尔西比亚德描写成既有才能又难以信任的盟友。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension) A person seen as charming and gifted but politically unreliable or opportunistic.","zh":"（引申）指有魅力、有才华但在政治或立场上不可靠、投机的人。"},"examples":[{"en":"Critics called the candidate an Alcibiades—magnetic, but impossible to trust.","zh":"批评者称那位候选人是“阿尔西比亚德式人物”——很有吸引力，但难以信任。"},{"en":"In the novel, the advisor plays the Alcibiades role, changing sides when it benefits him.","zh":"在小说里，那位顾问扮演“阿尔西比亚德式”的角色：只要对自己有利就倒戈。"}]}],"synonyms":["Athenian statesman","general","politician","opportunist (figurative)"],"phonetic":"/ˌælsəˈbaɪəˌdiːz/","extraExplanation":["他在伯罗奔尼撒战争中的“倒戈”经历很有代表性：先为雅典出谋划策（包括推动远征西西里），后因被控亵渎宗教而逃亡，转而为斯巴达出主意，后来又与波斯势力周旋，最终一度回到雅典阵营。","在文学与古典作品中他常被当作“天才与自毁并存”的人物：柏拉图《会饮篇》里有他登场的著名段落；莎士比亚《雅典的泰门》（Timon of Athens）中也出现名为 Alcibiades 的角色。"]}
{"word":"Alcicornium","summary":{"en":"Alcicornium is a rare, mostly historical botanical name associated with staghorn (elk-horn) ferns, often now classified under Platycerium.","zh":"Alcicornium 是一个罕见、偏旧的植物学名称，多与鹿角蕨（麋角蕨）相关，现常并入 Platycerium（鹿角蕨属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, botanical, mostly historical) An old or less-used scientific name referring to “elk-horn” ferns; often treated as a former genus name now placed under Platycerium (staghorn ferns).","zh":"（罕见；植物学；多见于旧文献）一个较少使用的学名，指“鹿角蕨/麋角蕨”一类植物；常被视为旧属名，现多并入 Platycerium（鹿角蕨属）。"},"examples":[{"en":"Older horticulture books may list some staghorn ferns under the name Alcicornium.","zh":"较早的园艺书里，某些鹿角蕨可能会用 Alcicornium 这个名字来标注。"},{"en":"Today, the plant is usually classified as Platycerium rather than Alcicornium.","zh":"如今这种植物通常归为 Platycerium（鹿角蕨属），而不是 Alcicornium。"}]}],"synonyms":["Platycerium (modern classification)","staghorn fern","elkhorn fern"],"phonetic":"/ˌæl sɪˈkɔr ni əm/","extraExplanation":["这个词很少出现在现代英语词典里，更多见于旧的拉丁化植物命名或园艺资料。词形里可见类似 *alci-*（与“麋/鹿”相关）和 *-corn-*（“角”）的构词感觉，因此常被解释为“像鹿角一样的”。","如果你是在某本书、标签或论文里看到 Alcicornium，建议提供上下文（句子/图片/出处），以确认它指的是具体某种鹿角蕨（如旧名与现行学名的对应关系）。"]}
{"word":"alcicornium","summary":{"en":"A very rare Latin-based term meaning “elk horn/antler,” used to describe hornlike branching forms (especially in botanical contexts).","zh":"一个非常罕见的拉丁语系词，意为“麋鹿角/鹿角”，常用于（尤其是植物学中）形容角状分叉的形态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Very rare; mainly in botanical/Latin contexts) “Elk-horn / antler”; used to describe something shaped like an elk’s horn, and sometimes used as a Latin-based name element for plants or lichens with branching, hornlike fronds.\nExamples:\n• en: The specimen was described as *alcicornium* because its branches looked like an elk’s antlers.  zh: 该标本被描述为 *alcicornium*，因为它的分枝看起来像麋鹿的鹿角。\n• en: In older botanical notes, *alcicornium* appears as a Latin descriptor for horn-shaped growth.  zh: 在较早的植物学记录中，*alcicornium* 作为拉丁语描述词，用来指“角状”的生长形态。","zh":"（非常罕见；主要见于植物学/拉丁语语境）“麋鹿角/鹿角”；用于形容外形像麋鹿角一样分叉、角状的事物，也可能作为某些植物或地衣拉丁化名称中的构词成分。\n例句：\n• en: The specimen was described as *alcicornium* because its branches looked like an elk’s antlers.  zh: 该标本被描述为 *alcicornium*，因为它的分枝看起来像麋鹿的鹿角。\n• en: In older botanical notes, *alcicornium* appears as a Latin descriptor for horn-shaped growth.  zh: 在较早的植物学记录中，*alcicornium* 作为拉丁语描述词，用来指“角状”的生长形态。"},"examples":[{"en":"The specimen was described as *alcicornium* because its branches looked like an elk’s antlers.","zh":"该标本被描述为 *alcicornium*，因为它的分枝看起来像麋鹿的鹿角。"},{"en":"In older botanical notes, *alcicornium* appears as a Latin descriptor for horn-shaped growth.","zh":"在较早的植物学记录中，*alcicornium* 作为拉丁语描述词，用来指“角状”的生长形态。"}]}],"synonyms":["elk-horn","staghorn","antlerlike"],"phonetic":"ˌæl.sɪˈkɔr.ni.əm","extraExplanation":["这个词在现代英语里几乎不用，更常见于“新拉丁语（Neo-Latin）/植物学拉丁语”的命名或描述传统。词根上可理解为“alci-（麋鹿）+ cornu（角）+ -ium（名词词尾）”，整体意思就是“麋鹿角状的东西/麋鹿角”。","如果你是在植物学或园艺语境中遇到它，实际想表达的常见英语通常是 **elk-horn** 或 **staghorn**（如 *elk-horn fern* “鹿角蕨”、*staghorn lichen* “鹿角地衣”等）。"]}
{"word":"alcid","summary":{"en":"An alcid is a seabird in the auk family (Alcidae), such as a puffin or murre; it can also mean “relating to” that family.","zh":"alcid 指海雀科（Alcidae）的海鸟（如海鹦、海鸦等），也可作形容词表示“海雀科的/与海雀科相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a seabird of the auk family (Alcidae), such as a puffin, murre, guillemot, or razorbill.","zh":"海雀科（Alcidae）的海鸟，如海鹦（puffin）、海鸦（murre）、海鸽/海鸦（guillemot）或剃刀海雀（razorbill）。"},"examples":[{"en":"Puffins are one type of alcid found in the North Atlantic.","zh":"海鹦是北大西洋常见的一种海雀科海鸟（alcid）。"},{"en":"Researchers counted alcids nesting on the coastal cliffs.","zh":"研究人员统计了在海岸悬崖上筑巢的海雀科海鸟数量。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the auk family (Alcidae).","zh":"与海雀科（Alcidae）有关的；海雀科的。"},"examples":[{"en":"The museum has an alcid exhibit featuring puffins and murres.","zh":"博物馆有一个海雀科主题展，展示海鹦和海鸦等。"},{"en":"Alcid colonies can be very noisy during breeding season.","zh":"海雀科鸟类在繁殖季的群落往往非常吵闹。"}]}],"synonyms":["auk","puffin","murre","guillemot","razorbill"],"phonetic":"/ˈæl.sɪd/","extraExplanation":["“Alcid”常用于鸟类学/自然纪录片语境，指海雀科这一“类群”（不是单一物种）。它们多生活在北半球寒冷海域，善于潜水捕鱼，外形常被误认为企鹅，但海雀科能飞（企鹅不会飞）。","相关词：auk（海雀，常作统称），puffin（海鹦），murre（海鸦/海鸦属），guillemot（海鸽/海鸦），razorbill（剃刀海雀）。"]}
{"word":"Alcidae","summary":{"en":"Alcidae is the scientific name for the auk family of Northern Hemisphere seabirds, including puffins and murres.","zh":"Alcidae 是海雀科的学名，指主要分布在北半球的一类海鸟，包括海鹦和海鸦等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of seabirds (auks) that includes puffins, murres, guillemots, and razorbills, found mainly in the Northern Hemisphere and known for diving and “flying” underwater with their wings","zh":"海雀科（Alcidae）：一种海鸟科，主要分布于北半球，包括海鹦（puffin）、海鸦/海鸥形的海鸟（murre）、海鸽（guillemot）、剃刀海雀（razorbill）等，以善于潜水、用翅膀在水下“飞行”而闻名"},"examples":[{"en":"Puffins belong to the family Alcidae.","zh":"海鹦属于海雀科（Alcidae）。"},{"en":"Many Alcidae nest on rocky cliffs near cold northern seas.","zh":"许多海雀科鸟类会在寒冷的北方海域附近的岩石峭壁上筑巢。"},{"en":"Because they are excellent divers, Alcidae can catch fish underwater with speed and control.","zh":"由于潜水能力很强，海雀科鸟类能在水下快速而灵活地捕捉鱼类。"}]}],"synonyms":["auk family","auks"],"phonetic":"/ˈæl.sɪ.diː/","extraExplanation":["“Alcidae”是动物分类学中的拉丁学名（科名），常用于科学写作与自然纪录片解说中。日常英语里更常说“auks”（海雀类）或直接用具体鸟名，如“puffin”。","海雀科常与南半球的企鹅作类比：两者都擅长潜水、在水下用翅膀推进，但海雀科鸟类通常仍能飞行（不同物种飞行能力差异较大）。"]}
{"word":"alcidae","summary":{"en":"Alcidae is the bird family that includes auks and puffins.","zh":"Alcidae 指海雀科，即包含海雀与海鹦等的一科海鸟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of seabirds in the order Charadriiformes, including auks, puffins, murres, and guillemots, found mostly in the North Atlantic and North Pacific.","zh":"海鸟的一科（海雀科），属于鸻形目，包含海雀、海鹦（puffin）、海鸦（murre）与海鸽（guillemot）等，主要分布在北大西洋与北太平洋。"},"examples":[{"en":"Puffins belong to the family Alcidae.","zh":"海鹦属于海雀科（Alcidae）。"},{"en":"Scientists study Alcidae to understand how seabirds adapt to cold oceans.","zh":"科学家研究海雀科，来了解海鸟如何适应寒冷的海洋环境。"},{"en":"Many Alcidae species are excellent divers, using their wings to “fly” underwater.","zh":"许多海雀科物种很擅长潜水，会用翅膀在水下“飞行”。"}]}],"synonyms":["auks (general term)","auk family"],"phonetic":"/ˈæl.sɪ.diː/","extraExplanation":["“Alcidae”是生物分类学里的拉丁化名称，通常在学术写作中使用；日常英语更常说“auks”（海雀类）或具体物种名如“puffin”（海鹦）。","词源上与“auk”（海雀）有关：中古英语中有类似词形，后来形成“Alcidae”这种以“-idae”结尾、表示“科”的动物分类学命名方式。"]}
{"word":"Alcide","summary":{"en":"Alcide is mainly a male given name (French/Italian) and can also be a classical literary name connected to Hercules (via “Alcides”).","zh":"Alcide 主要是法语/意大利语常见的男性名字；在古典文学中也可指与海格力斯相关的称呼（源自 Alcides）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a male given name used especially in French and Italian (a form related to “Alcides”)","zh":"男性名字，常见于法语和意大利语语境（与“Alcides/阿尔喀德斯”同源或相关的变体）"},"examples":[{"en":"Alcide De Gasperi was a key figure in modern Italian politics.","zh":"阿尔奇德·德·加斯佩里是意大利现代政治中的重要人物。"},{"en":"In the novel, Alcide is a quiet character who avoids attention.","zh":"在小说里，Alcide 是个安静、尽量不引人注意的角色。"}]},{"partOfSpeech":"other","definition":{"en":"(mythology, literary) a name/epithet linked to Heracles (Hercules), from “Alcides,” meaning “descendant of Alcaeus”","zh":"（神话/文学）与赫拉克勒斯（海格力斯）相关的称号/名字，源自“Alcides”，含义为“阿尔卡俄斯的后裔”"},"examples":[{"en":"Some poems refer to Hercules as Alcides to sound more classical.","zh":"有些诗歌会用 Alcides 来称呼海格力斯，以营造更古典的风格。"},{"en":"The hero, like Alcide, must complete trials to prove his strength.","zh":"这位英雄像“Alcide”一样必须完成考验来证明力量。"}]}],"synonyms":["Alcides","Heracles","Hercules"],"phonetic":"/ælˈsaɪd/","extraExplanation":["“Alcide”在英语里最常见的用法是作为人名（专有名词），因此通常不加冠词，也不写复数。","词源上与希腊神话名字“Alcides（阿尔喀德斯）”相关；在文学中使用这个称呼常带有“古典化、史诗感”的色彩。","在法语与意大利语文化中，这个名字在19—20世纪更常见；例如意大利政治家 Alcide De Gasperi、法国博物学家 Alcide d’Orbigny。"]}
{"word":"Alcides","summary":{"en":"Alcides is an epithet for Heracles/Hercules in Greek mythology; it is also a rare male given name.","zh":"Alcides 是希腊神话中赫拉克勒斯/海格力斯的别名，也可作较少见的男性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a name (epithet) for Heracles/Hercules in Greek mythology, meaning “descendant/son of Alcaeus.”","zh":"（希腊神话中）赫拉克勒斯/海格力斯的别名（称号），意为“阿尔凯俄斯的后裔/之子”。"},"examples":[{"en":"In Greek myths, Alcides later became known as Heracles after he gained Hera’s fame through his labors.","zh":"在希腊神话中，Alcides 后来因完成诸多苦役而被称为 Heracles。"},{"en":"The poem calls the hero “Alcides,” using the older name to sound more classical.","zh":"这首诗称英雄为“Alcides”，用较古老的名字来营造更古典的风格。"}]},{"partOfSpeech":"n.","definition":{"en":"a masculine given name (rare in modern English).","zh":"男性名字（在现代英语中较少见）。"},"examples":[{"en":"Alcides is uncommon today, but it appears as a first name in some countries influenced by Greek or Latin culture.","zh":"Alcides 如今不常见，但在一些受希腊/拉丁文化影响的国家会作为名字出现。"}]}],"synonyms":["Heracles","Hercules"],"phonetic":"/ælˈsaɪdiːz/","extraExplanation":["“Alcides”来自希腊语形式（常见于拉丁化拼写），与英雄的家族血统有关：赫拉克勒斯的祖父/祖先之一是 Alcaeus（阿尔凯俄斯），因此用“Alcides”强调“出身/宗族”。","在文学或史诗语境中，用“Alcides”称呼赫拉克勒斯有一种“古典、庄严、史诗化”的效果，类似用“the son of…”来替代直呼姓名。"]}
{"word":"Alcidice","summary":{"en":"Alcidice is a rare female name of Greek origin, often encountered in myth- or literature-related contexts.","zh":"Alcidice 是一个源自希腊语的罕见女性名字，常见于神话或文学相关语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a rare female given name, originally from Ancient Greek, sometimes used in English in references to mythology or as a modern name.","zh":"一个较少见的女性名字，源自古希腊语；在英语中偶见于神话相关引用或作为现代人名使用。"},"examples":[{"en":"In the novel, Alcidice is portrayed as a brave young queen.","zh":"在小说里，Alcidice 被描写成一位勇敢的年轻女王。"},{"en":"Alcidice is an uncommon name, so people often ask how to spell it.","zh":"Alcidice 这个名字不常见，所以人们常会问该怎么拼写。"}]}],"synonyms":["(no direct synonyms; proper name)"],"phonetic":"/ælˈsɪdɪsi/","extraExplanation":["词源提示：Alcidice 常被认为来自古希腊语元素 *alki-*（“力量、勇气”）与 *dikē*（“正义、公正”），因此可理解为“以力量守护正义/勇敢而公正”的含义。","用法提示：它更常见于古典学、历史/神话题材作品的人物命名或现代取名；在日常英语里不是常用词，通常需要说明发音与拼写。"]}
{"word":"alcidine","summary":{"en":"Alcidine means “related to auks,” the seabird family that includes puffins and murres.","zh":"alcidine 指“与海雀科（auks）有关的”，包括海鹦、海鸦等海鸟。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(zoology) Relating to the auks (the bird family Alcidae), such as puffins, guillemots, and murres.","zh":"（动物学）与海雀科（Alcidae）鸟类有关的，如海鹦、海鸽、海鸦等。"},"examples":[{"en":"Puffins are alcidine birds that nest on sea cliffs and islands.","zh":"海鹦属于海雀科（alcidine）鸟类，常在海崖和海岛上筑巢。"},{"en":"The museum has an alcidine display featuring murres and guillemots.","zh":"博物馆有一个海雀科（alcidine）展区，展示了海鸦和海鸽等。"}]}],"synonyms":["auk-related","Alcidae (related term)"],"phonetic":"/ˈæl.səˌdaɪn/","extraExplanation":["“alcidine”主要用于动物学或科普写作，来源于鸟类分类名称（海雀科 Alcidae）。在日常英语里更常见的是直接说“auk”或具体鸟名（如 puffin）。"]}
{"word":"alcids","summary":{"en":"Alcids are Northern Hemisphere seabirds such as puffins and auks.","zh":"alcids 指北半球的海雀科海鸟，如海鹦和海雀。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Seabirds in the family Alcidae (including auks, murres, guillemots, puffins, and razorbills), found mainly in the Northern Hemisphere.","zh":"海雀科（Alcidae）的海鸟总称（包括海雀、海鸦、海鸫/海鸦类、海鹦等），主要分布在北半球。"},"examples":[{"en":"Puffins and murres are alcids commonly seen along northern coasts.","zh":"海鹦和海鸦是北方海岸常见的海雀科鸟类。"},{"en":"Alcids are excellent swimmers and use their wings to ‘fly’ underwater.","zh":"海雀科鸟类游泳能力很强，会用翅膀在水下“飞行”。"}]}],"synonyms":["auks","Alcidae (family name)"],"phonetic":"/ˈæl.sɪdz/","extraExplanation":["“alcid”是生物分类学用词，来自“Alcidae（海雀科）”。它常见于自然纪录片、鸟类图鉴与海洋生态文章中。","海雀科鸟类与企鹅在外形与生态位上有相似之处，但它们并不是近亲；这种相似属于“趋同演化”。"]}
{"word":"Alcimede","summary":{"en":"Alcimede is a name from Greek mythology, often identified as Jason’s mother and Aeson’s wife in some traditions.","zh":"Alcimede 是希腊神话中的人名，在一些传统中被认为是伊阿宋之母、伊宋之妻。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) The mother of Jason (leader of the Argonauts) in some ancient sources; wife of Aeson.","zh":"（希腊神话）在一些古代文献中，阿尔西墨德（Alcimede）是伊阿宋（Jason，阿耳戈英雄们的领袖）之母，伊宋（Aeson）之妻。"},"examples":[{"en":"In some versions of the myth, Alcimede is named as Jason’s mother.","zh":"在某些神话版本里，阿尔西墨德被称为伊阿宋的母亲。"},{"en":"Alcimede is sometimes described as the wife of Aeson in stories about the Argonauts.","zh":"在与阿耳戈英雄相关的故事中，阿尔西墨德有时被描述为伊宋的妻子。"}]}],"synonyms":["Alcimedē","Alcimedê"],"phonetic":"/ˌæl.sɪˈmiː.di/","extraExplanation":["“Alcimede”是一个源自古希腊的专名，不同译本和抄本里常见拼写差异，例如更接近希腊文拼写的“Alcimedē / Alcimedê”。在读神话或古典文学二手资料时，人物关系也可能因作者（如阿波罗尼奥斯、后世神话汇编者）而略有不同。","如果你本来想查的是“Archimedes（阿基米德）”或“Alcibiades（阿尔西比亚德）”，拼写很接近，但含义完全不同；告诉我你看到这个词的上下文句子，我可以帮你确认。"]}
{"word":"Alcimedes","summary":{"en":"Alcimedes is a Greek-origin male name; it can also refer to various minor figures in Greek myth or history depending on the source.","zh":"Alcimedes 是一个源自希腊语的男性名字；在不同资料中也可能指希腊神话或历史里的不同人物。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a male name of Greek origin (a transliteration of Greek “Alkímedēs”).","zh":"一个源自希腊语的男性名字（希腊语“Alkímedēs”的音译）。"},"examples":[{"en":"In the novel, Alcimedes is the loyal friend who helps the hero.","zh":"在小说里，Alcimedes 是帮助主角的忠诚朋友。"},{"en":"The list includes Alcimedes, a name with a classical Greek feel.","zh":"名单里有 Alcimedes，这个名字带有古典希腊的感觉。"}]},{"partOfSpeech":"other","definition":{"en":"the name of several minor figures in Greek myth and ancient history (used in different sources for different people).","zh":"希腊神话与古代历史中若干人物的名字（不同文献中指代的人物可能不同）。"},"examples":[{"en":"Different encyclopedias may list more than one Alcimedes from Greek tradition.","zh":"不同的百科资料可能会列出不止一位来自希腊传统的 Alcimedes。"},{"en":"When you see the name Alcimedes, check the context to know which person it refers to.","zh":"看到 Alcimedes 这个名字时，要看上下文才能确定指的是哪一位人物。"}]}],"synonyms":["Alkimedes","Alcimedēs"],"phonetic":"/ælˈsɪməˌdiːz/","extraExplanation":["“Alcimedes”常见对应希腊语名 Ἀλκίμεδης（Alkímedēs）。词根常被解释为：alkē（力量、勇气）+ mēdos（计谋、谋略/计划），因此名字带有“勇敢而有谋略”之类的含义。","这是一个在英文里相对少见的古典人名；在阅读神话、历史资料或现代改编作品时，可能会遇到同名不同人的情况，建议同时核对作者、时代、地点等线索。"]}
{"word":"Alcimedon","summary":{"en":"Alcimedon is a classical proper name found in Greco-Roman myth and literature, sometimes referring to a craftsman in Virgil’s poetry.","zh":"Alcimedon 是希腊—罗马神话与古典文学中的专名；在维吉尔作品里也可指被提到的一位工匠。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A masculine proper name from Greco-Roman myth and classical literature, used for several minor characters (often warriors or companions) in ancient sources.","zh":"源自希腊—罗马神话与古典文学的男性专名；古代文献中有数位同名的小人物（常见为战士或同伴）。"},"examples":[{"en":"In Greek myth, Alcimedon is the name of more than one minor figure, so the exact reference depends on the text.","zh":"在希腊神话里，“Alcimedon”不止指一个角色，具体是谁要看所引用的作品。"},{"en":"The character’s name may appear in English translations of classical epics and myths.","zh":"在英文译本的古典史诗或神话故事中，可能会看到这个名字。"}]},{"partOfSpeech":"other","definition":{"en":"(Literary) In Virgil’s pastoral poetry, the name of a craftsman mentioned as the maker of finely carved wooden cups.","zh":"（文学）在维吉尔的田园诗中，指一位工匠，被提到曾制作精雕细刻的木杯。"},"examples":[{"en":"Virgil mentions Alcimedon as the one who made the decorated cups in a shepherds’ singing contest.","zh":"维吉尔在牧歌的对唱比赛情节里提到“Alcimedon”是那些装饰木杯的制作者。"},{"en":"In some editions you’ll find a line like: “Alcimedon carved these.”","zh":"有些版本会出现类似“Alcimedon carved these（这些是阿尔西米冬刻的）”这样的句子。"}]}],"phonetic":"/ælˈsɪmɪˌdɑn/","extraExplanation":["“Alcimedon”是古典专名，不是现代英语常用词。阅读时更像是在“查人名”：先看出自哪部作品（如维吉尔《牧歌》）或哪段神话谱系，再确定具体指谁。","专名的英文拼写通常直接拉丁化/英文化自希腊语，不同译本可能会有不同的注释来区分同名人物。"]}
{"word":"Alcina","summary":{"en":"Alcina is the name of a famous fictional sorceress from *Orlando Furioso* and the title character of Handel’s opera *Alcina*.","zh":"Alcina（阿尔奇娜）是著名的虚构女巫角色，源自《疯狂的奥兰多》，也指亨德尔歌剧《阿尔奇娜》及其女主角。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sorceress (enchantress) in Italian Renaissance literature, best known from Ariosto’s epic poem *Orlando Furioso*; she later became the title character of Handel’s opera *Alcina* (1735).","zh":"意大利文艺复兴文学中的女巫/女魔法师形象，最著名出自阿里奥斯托的史诗《疯狂的奥兰多》（*Orlando Furioso*）；后来也成为亨德尔歌剧《阿尔奇娜》（*Alcina*，1735）的标题角色。"},"examples":[{"en":"In Handel’s *Alcina*, Alcina uses magic to control and transform people who come to her island.","zh":"在亨德尔的《阿尔奇娜》中，阿尔奇娜用魔法控制并改变来到她岛上的人。"},{"en":"The name Alcina often suggests a beautiful but dangerous enchantress in Western stories.","zh":"“Alcina”这个名字在西方故事语境里常让人联想到“美丽却危险的女妖/女巫”。"}]}],"synonyms":["enchantress","sorceress"],"phonetic":"/ælˈsiːnə/","extraExplanation":["“Alcina”更多作为专有名词使用（人名/角色名）。如果你在音乐或歌剧评论里看到它，通常指亨德尔的歌剧《Alcina》或其中的女主角。","该角色源头可追溯到阿里奥斯托《疯狂的奥兰多》中的魔女“Alcina”情节：她以魅力与幻术诱惑骑士，并把一些人变成动物或石头等。不同改编版本对她的性格（纯反派、复杂人物、可怜/可爱等）会有差异。"]}
{"word":"Alcine","summary":{"en":"Alcine is a rare spelling of the literary name Alcina, a famous enchantress character from Italian Renaissance stories and later opera.","zh":"Alcine 是文学人物名 Alcina 的罕见拼写变体，指意大利文艺复兴故事（及后来的歌剧）中著名的女魔法师形象。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A female name/character (proper noun), usually referring to the enchantress (a powerful sorceress) from Italian Renaissance literature; “Alcine” is a less common spelling, related to “Alcina.”","zh":"（专有名词）女性名字/人物名，通常指意大利文艺复兴文学中的女巫式人物“Alcina（阿尔奇娜）”；“Alcine”是较少见的拼写变体。"},"examples":[{"en":"In the story, Alcine uses magic to trap knights on her island.","zh":"在故事里，Alcine 用魔法把骑士困在她的岛上。"},{"en":"Some editions spell the character’s name as “Alcine,” but “Alcina” is more common in English.","zh":"有些版本把角色名字拼作“Alcine”，但英语里更常见的是“Alcina”。"}]}],"synonyms":["Alcina"],"phonetic":"/ælˈsiːn/","extraExplanation":["“Alcina/Alcine”最著名的来源之一是意大利诗人阿里奥斯托（Ludovico Ariosto）的史诗《疯狂的奥兰多》（Orlando Furioso），其中她是以诱惑与魔法著称的女巫形象。后来这位人物也出现在歌剧中（如亨德尔的《阿尔奇娜》Handel: Alcina）。因此你在文学、歌剧、古典音乐介绍里更容易见到这个名字。","拼写差异常与语言和译名习惯有关：法语中可能更常见“Alcine”，英语材料里通常写作“Alcina”。"]}
{"word":"alcine","summary":{"en":"“Alcine” is a rare, nonstandard spelling of “alkyne” (a hydrocarbon with a C≡C triple bond).","zh":"“Alcine”是“alkyne（炔烃）”的罕见、非标准拼写，指含C≡C三键的烃。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard) A variant spelling of “alkyne,” a type of hydrocarbon that contains at least one carbon–carbon triple bond (C≡C).","zh":"（非标准用法）“alkyne（炔烃）”的另一种拼写形式，指含有至少一个碳—碳三键（C≡C）的烃类。"},"examples":[{"en":"In most English chemistry textbooks, you will see “alkyne,” not “alcine.”","zh":"在大多数英文化学教材中，你会看到“alkyne”，而不是“alcine”。"},{"en":"Ethyne (acetylene) is the simplest alkyne.","zh":"乙炔（acetylene）是最简单的炔烃。"}]}],"synonyms":["alkyne","ethyne (a specific alkyne)"],"phonetic":"/ˈælkaɪn/","extraExplanation":["“alcine”在标准英语里很少见，常见于把其他语言（如西语/葡语/意语中对应“炔烃”的形式）直接迁移到英语，或是对“alkyne”的拼写误写。写英文作业、论文或考试时，建议使用“alkyne”。","记忆小提示：alkyne /ˈælkaɪn/ 与 alkane（烷烃）、alkene（烯烃）是一组相关词：-ane 单键，-ene 双键，-yne 三键。"]}
{"word":"Alcinia","summary":{"en":"“Alcinia” is not a standard common English word; it is usually a proper name or a spelling variant of a similar name.","zh":"“Alcinia”不是常见的标准英语词汇；通常作为专有名词使用，或是相近名称的拼写变体。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare or unclear term in modern English; it most often appears as a proper name (e.g., in usernames, fantasy writing, or as a misspelling/variant of similar names).","zh":"在现代英语中非常少见、含义不明确；最常见的用法是作为专有名词（如网名、奇幻作品中的人名/地名），或是与相近词的拼写变体/误拼。"},"examples":[{"en":"The character is named Alcinia in the novel.","zh":"小说中的角色名叫 Alcinia。"},{"en":"I couldn’t find a dictionary entry for “Alcinia,” so I checked if it was a name.","zh":"我在词典里找不到“Alcinia”，所以我去确认它是不是一个名字。"}]}],"phonetic":"ælˈsɪniə","extraExplanation":["“Alcinia”并不是常见的标准英语词条，因此在阅读或写作中遇到它时，建议先判断语境：是不是人名/地名、品牌名、游戏或作品设定用名。","它可能与若干更常见的相近形式混淆：例如 Alcina（常见于歌剧/文学中的女性名字），或 Alcyone（源自希腊神话的名字）。如果你能提供句子或出处，我可以帮你更准确地判定含义。"]}
{"word":"Alcinous","summary":{"en":"Alcinous is the Phaeacian king in Homer’s *Odyssey* who helps Odysseus get home.","zh":"Alcinous（阿尔基诺俄斯）是《奥德赛》中费埃克人的国王，帮助奥德修斯回家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology (especially Homer’s *Odyssey*), the king of the Phaeacians, who welcomes Odysseus and helps him return home to Ithaca.","zh":"在希腊神话（尤其是荷马《奥德赛》）中，费埃克人（Phaeacians）的国王；他接待奥德修斯，并帮助他回到故乡伊萨卡。"},"examples":[{"en":"In *The Odyssey*, Alcinous listens to Odysseus’s story and offers him safe passage home.","zh":"在《奥德赛》中，阿尔基诺俄斯听奥德修斯讲述经历，并承诺护送他安全回家。"},{"en":"Alcinous and Queen Arete represent the ideal of generous hospitality in epic literature.","zh":"阿尔基诺俄斯与王后阿瑞忒象征史诗文学中“慷慨好客”的理想。"}]}],"synonyms":["King of the Phaeacians"],"phonetic":"/ælˈsɪnoʊ.əs/","extraExplanation":["“Alcinous”是专名，常见于古典文学与神话语境。读《奥德赛》时，他与王后Arete（阿瑞忒）一起构成“宾客礼”（xenia，重视接待与礼仪）的典型形象。","在英语写作里，提到Alcinous往往是在做古典典故（allusion），用来暗示“被善待的漂泊者/旅人”或“慷慨的东道主”。"]}
{"word":"Alcippe","summary":{"en":"Alcippe is usually a Greek-mythology female name, and it can also be an older scientific name for a group of Asian birds.","zh":"Alcippe 通常是希腊神话中的女性名字；也可指鸟类学中较旧的一个鸟类属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A female name from Greek mythology; in different stories, Alcippe is used for more than one woman (for example, a daughter of Ares in an Athenian myth).","zh":"（专有名词）希腊神话中的女性名字；在不同传说里，Alcippe 可能指不同人物（例如雅典神话中战神阿瑞斯之女）。"},"examples":[{"en":"In one Athenian myth, Alcippe is described as a daughter of Ares.","zh":"在一则雅典神话里，Alcippe 被描述为战神阿瑞斯的女儿。"},{"en":"The author chose “Alcippe” as a character name to give the story a classical Greek feeling.","zh":"作者把“Alcippe”用作角色名，让故事带有古典希腊的氛围。"}]},{"partOfSpeech":"n.","definition":{"en":"(Biology) A scientific name used for a group of small Asian birds (a former genus name in older classifications).","zh":"（生物）用于一类亚洲小型鸟类的学名（在较旧的分类中曾作为属名使用）。"},"examples":[{"en":"Some older bird guides list certain babblers under the genus Alcippe.","zh":"一些较旧的鸟类图鉴会把某些噪鹛类鸟标在 Alcippe 这个属名下。"},{"en":"The taxonomy has changed, but you may still see “Alcippe” in earlier scientific papers.","zh":"分类学后来有调整，但你仍可能在早期论文中看到“Alcippe”。"}]}],"synonyms":["Alkippe (variant transliteration)"],"phonetic":"/ælˈsɪpi/","extraExplanation":["在英文里，Alcippe 通常出现在两类语境：①古希腊神话与古典文学/改写作品中，作为人物名使用；②鸟类学资料中，作为较早期的拉丁学名（属名）出现。读到时可根据上下文判断是“人物名”还是“生物分类名”。","古典神话人物常有“同名不同人”的情况：同一个名字可能在不同城邦传说、作者版本里指向不同角色，因此严谨写作时会注明来源（例如具体神话作者或故事线）。"]}
{"word":"alcippe","summary":{"en":"Alcippe is a proper name used for a figure in Greek mythology and also a scientific genus name for certain Asian songbirds in older or some taxonomic systems.","zh":"Alcippe 可指希腊神话人物名，也可指某些亚洲小型鸣禽的属名（在部分旧式或特定分类体系中使用）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) A woman in Greek myth, most often described as the daughter of Ares; she is linked to a famous trial of Ares on the Areopagus after she was attacked by Halirrhothius.","zh":"（希腊神话）名叫 Alcippe 的女子，最常见的说法是战神阿瑞斯（Ares）的女儿；她与“阿瑞斯在阿瑞奥帕古斯（Areopagus）受审”的故事有关。"},"examples":[{"en":"In one version of Greek myth, Alcippe is the daughter of Ares.","zh":"在某个希腊神话版本中，Alcippe 是阿瑞斯的女儿。"},{"en":"The story of Alcippe is used to explain why the Areopagus was associated with trials.","zh":"Alcippe 的故事常被用来解释为何阿瑞奥帕古斯与审判有关。"}]},{"partOfSpeech":"n.","definition":{"en":"(Zoology) A scientific genus name used for certain small Asian songbirds (often called babblers), though some species have been reclassified in modern taxonomy.","zh":"（动物学）某些亚洲小型鸣禽（常被称为“鹛/鹟鹛类、噪鹛类”一类的“babblers”）的属名 Alcippe；但在现代分类中其中一些物种已被重新归类。"},"examples":[{"en":"Some older field guides list several babblers under the genus Alcippe.","zh":"一些较旧的观鸟手册会把几种噪鹛类鸟列在 Alcippe 这个属下。"},{"en":"Taxonomy changes mean an Alcippe species name may appear differently in newer books.","zh":"由于分类学更新，某个 Alcippe 物种在新书里的名称可能会不一样。"}]}],"synonyms":["Alkippē (variant transliteration)"],"phonetic":"/ælˈsɪpi/","extraExplanation":["“Alcippe”源自古希腊语名字（常写作 Alkippē），一般被解释为由表示“力量/勇武”的词根与“马”（hippos）相关的成分组合而成，因此有时会被理解为“强壮的马/勇马”之意。","在英语写作中它通常作为专名使用：神话人物时首字母大写；作为生物学属名也首字母大写并常以斜体呈现（如 *Alcippe*）。"]}
{"word":"Alcis","summary":{"en":"Alcis refers to twin Germanic gods mentioned by Tacitus, often compared to Castor and Pollux.","zh":"Alcis 指塔西佗记载的日耳曼双胞神，常被类比为卡斯托耳与波吕丢刻斯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Roman historian Tacitus’s *Germania*) the **Alcis**: twin gods worshiped by the Germanic tribe called the Naharvali, often compared to the Greek-Roman twin heroes Castor and Pollux (the Dioscuri).","zh":"（罗马史学家塔西佗《日耳曼尼亚》中）**Alcis**：日耳曼部族纳哈尔瓦里（Naharvali）所崇拜的一对双胞神，常被拿来类比希腊—罗马的双子英雄卡斯托耳与波吕丢刻斯（Dioscuri）。"},"examples":[{"en":"Tacitus mentions the Alcis as twin deities worshiped in a sacred grove.","zh":"塔西佗提到，Alcis 是在一片神圣树林中被崇拜的双胞神。"},{"en":"Some scholars link the Alcis to broader Indo-European traditions of divine twins.","zh":"一些学者把 Alcis 与更广泛的印欧“神圣双子”传统联系起来。"}]}],"synonyms":["the Dioscuri (as a comparison)"],"phonetic":"ˈæl.sɪs","extraExplanation":["“Alcis”主要见于塔西佗（Tacitus）约公元 1 世纪末写成的《日耳曼尼亚》（*Germania*）。他写到纳哈尔瓦里人在圣林中祭祀一对双子神，但没有留下清晰的图像或详细神话，因此现代解释多依靠比较神话学（如与“神圣双子”主题相对照）。","词形“Alcis”是拉丁文转写形式；其更早的日耳曼语来源并不确定，所以在不同研究中也可能出现不同的拼写或推测。"]}
{"word":"Alcithoe","summary":{"en":"Alcithoe is a name used for a figure in Greek mythology and also for a genus of large sea snails.","zh":"Alcithoe 既可指希腊神话人物阿尔基托厄，也可指一种大型海螺的属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) Alcithoe (also spelled Alcithoë): one of the three daughters of King Minyas who refused to worship Dionysus and were punished (in many versions, turned mad and/or transformed into bats).","zh":"（希腊神话）阿尔基托厄（亦拼作 Alcithoë）：弥纽阿斯王的三个女儿之一；因拒绝崇拜酒神狄俄尼索斯而受罚（许多版本中被使疯狂，或被变成蝙蝠）。"},"examples":[{"en":"In the myth, Alcithoe and her sisters stay inside to spin and weave instead of joining Dionysus’s rites.","zh":"在神话中，阿尔基托厄和她的姐妹选择留在屋里纺线织布，而不参加狄俄尼索斯的仪式。"},{"en":"Some retellings say Alcithoe was transformed into a bat as punishment.","zh":"一些改写版本说阿尔基托厄因惩罚而被变成蝙蝠。"}]},{"partOfSpeech":"n.","definition":{"en":"(Biology) Alcithoe: a scientific genus name for certain large sea snails (volutes), mainly found around New Zealand.","zh":"（生物）Alcithoe：一种大型海螺（骨螺科/海神螺类中的“凤螺”类群）的属名，主要分布在新西兰附近海域。"},"examples":[{"en":"The museum label lists the shell as Alcithoe sp., indicating the genus but not the exact species.","zh":"博物馆标签把这枚贝壳标为 Alcithoe sp.，表示已确定属，但未确定具体种。"},{"en":"Researchers compared Alcithoe shells to study variation in shape and color.","zh":"研究人员比较不同 Alcithoe 的贝壳，以研究形状和颜色的差异。"}]}],"synonyms":["Alcithoë"],"phonetic":"/ælˈsɪθoʊ.i/","extraExplanation":["“Alcithoe/Alcithoë”是从古希腊名字（常见转写为 Alkithoē）拉丁化而来；英语里常见两种拼法。","在古典文学中，这个故事常与奥维德《变形记》（Metamorphoses）中关于弥纽阿斯的女儿们（Minyades）的篇章相关联；不同版本对“惩罚”细节（疯狂、变形等）会有差异。"]}
{"word":"alclad","summary":{"en":"Alclad is aluminum sheet with a pure-aluminum coating on a strong alloy core, valued for corrosion resistance (especially in aviation).","zh":"Alclad 指外覆纯铝、内为高强度铝合金的复合铝材，以耐腐蚀著称，航空领域尤常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of aluminum sheet or metal made with a strong aluminum alloy core coated with a thin layer of pure aluminum to improve corrosion resistance (often used in aircraft).","zh":"一种铝板/金属材料：以高强度铝合金为芯材，表面覆一层薄的纯铝以增强耐腐蚀性（常用于飞机制造）。"},"examples":[{"en":"The aircraft skin was made from Alclad to resist corrosion.","zh":"飞机外蒙皮使用了 Alclad，以提高抗腐蚀能力。"},{"en":"He ordered Alclad sheet for a restoration project.","zh":"他为修复项目订购了 Alclad 铝板。"}]},{"partOfSpeech":"adj.","definition":{"en":"made of, coated with, or using Alclad material.","zh":"由 Alclad 制成的；表面覆有 Alclad 的；使用 Alclad 材料的。"},"examples":[{"en":"An Alclad panel can handle weather better than bare alloy.","zh":"Alclad 面板通常比未覆层的合金更耐风雨。"},{"en":"They replaced the damaged part with an Alclad sheet.","zh":"他们用一块 Alclad 板更换了损坏的部件。"}]}],"synonyms":["clad aluminum","aluminum-clad sheet","clad aluminium"],"phonetic":"/ˈælklæd/","extraExplanation":["“Alclad”原本是商标名（常写作 Alclad），在航空与金属加工语境里也常被当作通用名词使用。","它的关键特点是“合金芯 + 纯铝覆层”：合金提供强度，外层纯铝更耐腐蚀，因此在早期与现代的飞机结构（如蒙皮、机身板材）中很常见。","在技术写作中你也可能看到更通用的说法：clad aluminum / aluminum-clad sheet，含义接近。"]}
{"word":"Alcmaeon","summary":{"en":"Alcmaeon is a Greek myth figure known for killing his mother and being punished for it; the name can also symbolize tragic guilt in literature.","zh":"Alcmaeon（阿尔克迈翁）是希腊神话人物，以弑母及其后的惩罚与疯狂闻名；在文学中也可象征悲剧性的罪责与内疚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, a prince of Argos and the son of the seer Amphiaraus; he killed his mother Eriphyle (to avenge his father) and was later driven mad and pursued by the Furies for the crime.","zh":"（希腊神话）阿尔克迈翁：阿尔戈斯的王子、先知安菲阿拉俄斯之子；为替父报仇杀死母亲厄里菲勒，随后因弑母之罪陷入疯狂并遭复仇女神追逐。"},"examples":[{"en":"In Greek myth, Alcmaeon is punished after he kills his mother.","zh":"在希腊神话中，阿尔克迈翁在弑母后受到惩罚。"},{"en":"The story of Alcmaeon explores guilt, revenge, and family duty.","zh":"阿尔克迈翁的故事探讨了内疚、复仇与家族责任。"}]},{"partOfSpeech":"n.","definition":{"en":"A figure used in literature and scholarship as an example of a tragic hero haunted by blood guilt (especially guilt for killing a family member).","zh":"（文学/学术用法）常被用作“因血债而受折磨的悲剧人物”的典型，尤指弑亲所带来的罪责与报应。"},"examples":[{"en":"The author compares the character’s remorse to Alcmaeon’s madness.","zh":"作者将这个角色的悔恨比作阿尔克迈翁的疯狂。"},{"en":"In classical studies, Alcmaeon is often discussed alongside Orestes as a model of kin-slaying tragedy.","zh":"在古典研究中，阿尔克迈翁常与俄瑞斯忒斯并论，作为弑亲悲剧的典型。"}]}],"synonyms":["Orestes (related figure)","Furies (associated motif)"],"phonetic":"/ælˈkmiːən/","extraExplanation":["“Alcmaeon”在英语里通常按希腊-拉丁传统写作专名，常见于神话、古典文学研究与戏剧改写（例如古希腊悲剧传统中关于“弑亲与复仇女神”的主题）。","他与“Orestes（俄瑞斯忒斯）”常被并提：两者都因弑亲而遭复仇女神（Furies/Eumenides）追逐，体现古希腊文化中对“家族血债/污染（miasma）”的恐惧与道德秩序观。"]}
{"word":"Alcman","summary":{"en":"Alcman was an ancient Greek lyric poet linked with Sparta, famous for choral songs preserved mostly in fragments.","zh":"阿尔克曼是与斯巴达相关的古希腊抒情诗人，以合唱歌曲著称，作品多以残篇流传。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient Greek lyric poet (7th century BCE), associated especially with Sparta, known for choral songs (poetry meant to be sung by a group).","zh":"阿尔克曼：古希腊抒情诗人（约公元前7世纪），与斯巴达关系密切，以合唱歌曲（由群体歌唱的诗）闻名。"},"examples":[{"en":"Alcman is one of the earliest poets whose choral lyric survives in fragments.","zh":"阿尔克曼是最早的合唱抒情诗人之一，其作品多以残篇保存下来。"},{"en":"In class we read a fragment of Alcman to see how Greek choral poetry sounded.","zh":"课堂上我们读了阿尔克曼的一段残篇，来感受希腊合唱诗的风格。"}]}],"synonyms":["ancient Greek lyric poet","Spartan choral poet"],"phonetic":"/ˈælmən/","extraExplanation":["阿尔克曼（Alcman）常被认为活跃于斯巴达的诗人，他的作品多为“合唱抒情诗”（choral lyric），原本用于节庆、宗教仪式等公共场合的歌唱表演。","他最著名的作品之一是《少女歌》（Partheneion，常译作“少女合唱歌/少女颂”）的残篇，学者常用它来研究古希腊少女合唱队、仪式文化与早期希腊诗歌语言。","由于作品主要以纸草残片和引文形式保存，现代读者通常接触到的是“残篇”（fragments），阅读时常需要注释来补足背景与缺失处。"]}
{"word":"Alcmaon","summary":{"en":"Alcmaon (more commonly Alcmaeon) is a figure in Greek mythology known for avenging his father by killing his mother and suffering divine punishment afterward.","zh":"Alcmaon（更常见为 Alcmaeon）是希腊神话人物，以弑母为父复仇、随后遭神罚与精神折磨而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) A hero, son of the seer Amphiaraus; he killed his mother Eriphyle to avenge his father and was later driven mad and pursued by the Furies.","zh":"（希腊神话）英雄人物，预言家安菲阿拉俄斯之子；为替父报仇杀死母亲厄里菲勒，之后被复仇女神追逐并陷入疯狂。"},"examples":[{"en":"In Greek myth, Alcmaon avenges his father by killing Eriphyle.","zh":"在希腊神话中，阿尔克迈翁为替父报仇而杀死厄里菲勒。"},{"en":"The story of Alcmaon is often linked with guilt, justice, and divine punishment.","zh":"阿尔克迈翁的故事常与罪疚、正义与神罚相联系。"}]}],"synonyms":["Alcmaeon"],"phonetic":"/ælˈkmiːən/","extraExplanation":["更常见的拼写是 **Alcmaeon**（阿尔克迈翁）；你写的 **Alcmaon** 属于变体拼写。","他的故事与“弑亲（matricide）后的污染/罪责（miasma）”这一古希腊宗教观念有关：即使出于复仇或正义，杀害亲属仍会招致精神折磨与神祇追讨。","他在古典文学中多次出现：欧里庇得斯（Euripides）写过以他为主角的悲剧《阿尔克迈翁在科林斯》（已佚），后世也常用他的形象讨论复仇与道德代价。"]}
{"word":"Alcmena","summary":{"en":"Alcmena is a figure from Greek mythology, famous as the mortal mother of Heracles.","zh":"Alcmena 是希腊神话人物，以赫拉克勒斯的凡人母亲而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) The mother of Heracles (Hercules), a mortal woman whom Zeus deceived by taking the form of her husband Amphitryon.","zh":"（希腊神话）阿尔克墨涅：赫拉克勒斯（海格力斯）的凡人母亲；宙斯曾变成她丈夫安菲特律翁的模样欺骗她。"},"examples":[{"en":"In Greek mythology, Alcmena is best known as the mother of Heracles.","zh":"在希腊神话中，阿尔克墨涅最有名的身份是赫拉克勒斯的母亲。"},{"en":"Some stories say Zeus visited Alcmena while disguised as Amphitryon.","zh":"有些故事说宙斯乔装成安菲特律翁去拜访阿尔克墨涅。"}]}],"synonyms":["Alcmene"],"phonetic":"/ælˈkmiːnə/","extraExplanation":["“Alcmena”也常拼作“Alcmene”，英文里两种写法都能见到；中文多译为“阿尔克墨涅”。","她的故事常与赫拉（Hera）对赫拉克勒斯的敌意一起出现，因为赫拉克勒斯是宙斯与凡人所生。"]}
{"word":"Alcmene","summary":{"en":"Alcmene is a figure from Greek mythology, famous as the mother of Heracles (Hercules).","zh":"阿尔克墨涅是希腊神话人物，以赫拉克勒斯（海格力斯）的母亲而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, the mother of Heracles (Hercules) and the wife of Amphitryon; Zeus, disguised as Amphitryon, fathered Heracles with her.","zh":"（希腊神话）阿尔克墨涅：赫拉克勒斯（海格力斯）的母亲，安菲特律翁之妻；宙斯假扮安菲特律翁与她同寝，因此成为赫拉克勒斯之父。"},"examples":[{"en":"In Greek myth, Alcmene is best known as the mother of Heracles.","zh":"在希腊神话中，阿尔克墨涅最著名的身份是赫拉克勒斯的母亲。"},{"en":"Many retellings describe Zeus visiting Alcmene in Amphitryon’s shape.","zh":"许多改写版本都描写宙斯化作安菲特律翁的模样去见阿尔克墨涅。"}]}],"phonetic":"/ælˈkmiːni/","extraExplanation":["“Alcmene”常见拼写也有“Alcmena”。在英语阅读中它通常出现在神话、戏剧或文学改写里（例如围绕赫拉克勒斯的出生与赫拉的嫉妒展开的故事）。","发音要点：重音落在第二音节（-MEE-），读起来类似“al-KMEE-nee”。"]}
{"word":"alcmene","summary":{"en":"Alcmene is a figure in Greek mythology, most famous as the mother of Heracles (Hercules).","zh":"阿尔克墨涅是希腊神话人物，最著名的身份是赫拉克勒斯（海格力斯）的母亲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, the mother of Heracles (Hercules), famed for her beauty and virtue; wife of Amphitryon. Zeus disguised himself as Amphitryon and fathered Heracles with her.","zh":"（希腊神话）阿尔克墨涅：赫拉克勒斯（Hercules/海格力斯）的母亲，以美貌与德行闻名；安菲特律翁的妻子。宙斯伪装成安菲特律翁与她同寝，从而生下赫拉克勒斯。"},"examples":[{"en":"In Greek myth, Alcmene is best known as the mother of Hercules.","zh":"在希腊神话中，阿尔克墨涅最为人熟知的身份是海格力斯的母亲。"},{"en":"Some retellings describe Hera’s jealousy toward Alcmene and her child.","zh":"一些改写故事会描写赫拉对阿尔克墨涅及其孩子的嫉妒。"}]}],"synonyms":["Alcmena"],"phonetic":"/ælˈkmiːni/","extraExplanation":["“Alcmene”也常见拼写为“Alcmena”。在英语作品中，她通常作为神话人物被提及，用来引出赫拉克勒斯的出身、赫拉的迫害，以及“神与凡人结合”这一类母题。"]}
{"word":"Alco","summary":{"en":"“Alco” is an informal abbreviation related to alcohol, mainly used in casual or label-style contexts.","zh":"“Alco”是与酒精相关的非正式缩写，主要用于口语或标签式的简写场景。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Informal short form of “alcohol” (often used in labels, menus, or casual speech).","zh":"“alcohol（酒精/酒）”的非正式缩写（常见于标签、菜单或口语）。"},"examples":[{"en":"This drink has no alco, so it’s fine for me.","zh":"这杯饮料不含酒精，所以我可以喝。"},{"en":"The menu marks alco drinks separately from non-alco ones.","zh":"菜单把含酒精饮品和不含酒精饮品分开标注。"}]},{"partOfSpeech":"other","definition":{"en":"A combining form meaning “alcohol-,” used in words related to alcohol (e.g., “alcohol-free” sometimes shortened in product notes).","zh":"表示“与酒精有关的-”的构词成分，用于和酒精相关的词（在一些产品说明里会被简写）。"},"examples":[{"en":"You may see “alco-free” in informal product notes, meaning “alcohol-free.”","zh":"在非正式的产品说明里可能会看到“alco-free”，意思是“无酒精”。"}]}],"synonyms":["alcohol (full form)","booze (very informal)","liquor (for strong alcohol)"],"phonetic":"/ˈælkoʊ/","extraExplanation":["“Alco”不是标准书面英语里常用的正式词，更常见于口语、简写、商品标签或社交媒体。正式写作中建议用“alcohol”“alcoholic (drink)”或“alcohol-free”。","在不同地区，“alco”有时也会作为品牌名/公司名的一部分（如历史上某些企业简称），这时通常按专有名词理解。"]}
{"word":"alco","summary":{"en":"“alco” usually means alcohol in informal speech/writing; it can also be a word part meaning alcohol, or the acronym ALCO (American Locomotive Company).","zh":"“alco”常在非正式语境中表示“酒精/酒（alcohol）”的简写；也可作表示“酒精相关”的构词成分，或指缩写ALCO（美国机车公司）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A short form of “alcohol.”","zh":"（非正式）“alcohol（酒精/酒）”的简写。"},"examples":[{"en":"No alco for me tonight—I’m driving.","zh":"今晚我不喝酒——我要开车。"},{"en":"The festival is alco-free.","zh":"这个节日是无酒精（禁酒）的。"}]},{"partOfSpeech":"other","definition":{"en":"A combining form meaning “alcohol” or “related to alcohol,” used in technical/scientific words.","zh":"（构词成分）表示“酒精”或“与酒精有关”，常见于科技/医学词汇中。"},"examples":[{"en":"In chemistry, “alco-” can refer to alcohol-related compounds.","zh":"在化学中，“alco-”可指与酒精有关的化合物。"},{"en":"You may see “alco-” in specialized terms, though “ethanol-” is often more precise.","zh":"你可能会在专业术语里看到“alco-”，不过“ethanol-（乙醇-）”常更精确。"}]},{"partOfSpeech":"other","definition":{"en":"An acronym for the American Locomotive Company (ALCO), a historic U.S. locomotive manufacturer.","zh":"美国机车公司（American Locomotive Company）的缩写（ALCO），一家历史上的美国机车制造商。"},"examples":[{"en":"The museum has an old ALCO locomotive on display.","zh":"博物馆里展出了一台老式的ALCO机车。"},{"en":"Some railfans collect photos of ALCO engines.","zh":"一些铁路迷会收藏ALCO机车的照片。"}]}],"synonyms":["alcohol (informal meaning)","ethanol (more specific, chemical)","booze (slang, not the same form)"],"phonetic":"/ˈælkoʊ/","extraExplanation":["“alco”在口语里多见于简短表达（如短信、标题、标牌）：alco-free（无酒精/禁酒）、no alco（不喝酒）。正式写作中建议用“alcohol”。","注意：单独写“alco”有时会让人不确定你指“alcohol”还是“ALCO（机车公司）”；如果语境不清楚，最好写全称。"]}
{"word":"Alcoa","summary":{"en":"Alcoa is a well-known U.S. aluminum company (from “Aluminum Company of America”).","zh":"Alcoa 是一家知名的美国铝业公司（源自“美国铝业公司”的缩写）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Alcoa: a major U.S. company known for producing aluminum and related products (originally short for “Aluminum Company of America”).","zh":"Alcoa：美国一家以生产铝及相关产品闻名的大型公司（名称最初是“美国铝业公司 Aluminum Company of America”的缩写）。"},"examples":[{"en":"Alcoa is one of the most famous names in the global aluminum industry.","zh":"Alcoa 是全球铝业中最知名的公司名称之一。"},{"en":"The factory used aluminum supplied by Alcoa.","zh":"这家工厂使用由 Alcoa 提供的铝材料。"}]}],"phonetic":"/ˈælkoʊə/","extraExplanation":["Alcoa 是一个专有名词（公司名），在新闻、商业与工业领域很常见。读到它时，通常不翻译成普通名词“铝”，而是保留为公司名称。","历史上，Alcoa 曾长期与美国铝工业的发展密切相关，因此在材料工程、制造业与经济史的语境中经常出现。"]}
{"word":"alcoate","summary":{"en":"Allocate means to distribute or officially assign resources (and in computing, to reserve memory/resources).","zh":"Allocate 指分配或正式划拨资源（在计算机中也指分配/预留内存等资源）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to give or distribute something (money, time, resources) to different people or purposes","zh":"（把金钱、时间、资源等）分配给不同的人或用途"},"examples":[{"en":"The city allocated more money to public schools this year.","zh":"今年市政府给公立学校分配了更多资金。"},{"en":"We need to allocate enough time for practice.","zh":"我们需要分配足够的时间来练习。"}]},{"partOfSpeech":"vt.","definition":{"en":"to officially assign something for a specific use or person","zh":"（正式）划拨、指定（给特定用途或某人）"},"examples":[{"en":"Each team member was allocated a specific role.","zh":"每位团队成员都被分配了一个具体角色。"},{"en":"The government allocated land for a new hospital.","zh":"政府划拨土地用于建新医院。"}]},{"partOfSpeech":"vt.","definition":{"en":"(computing) to set aside memory or other system resources for a program or process","zh":"（计算机）为程序或进程分配（内存等）资源"},"examples":[{"en":"The program allocates memory when it starts.","zh":"程序启动时会分配内存。"},{"en":"Try allocating more storage to the app.","zh":"试着给这个应用分配更多存储空间。"}]}],"synonyms":["assign","distribute","allot","designate","apportion"],"phonetic":"ˈæləˌkeɪt","extraExplanation":["“alcoate”通常不是标准英语单词；最常见的是把 **allocate** 拼错了（少写了一个 l）。","词根提示：**loc** 与“place（放置）”有关（如 locate）；**allocate** 可以理解为“把资源放到各个地方/用途上”。"]}
{"word":"Alcock","summary":{"en":"Alcock is most commonly used as an English surname.","zh":"Alcock 最常见的用法是英语姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname) of English origin","zh":"（英源）姓氏：阿尔科克"},"examples":[{"en":"Ms. Alcock is our new English teacher.","zh":"阿尔科克女士是我们的新英语老师。"},{"en":"Alcock is spelled A-L-C-O-C-K.","zh":"Alcock 的拼写是 A-L-C-O-C-K。"}]}],"synonyms":["a surname","a family name","a last name"],"phonetic":"/ˈælkɑk/","extraExplanation":["“Alcock”常见于英语国家的姓氏。你可能会在历史或新闻中看到它，例如英国飞行员 John Alcock（约翰·阿尔科克），他与 Arthur Brown 在1919年完成了首次不间断横跨大西洋的飞行（常写作“Alcock and Brown”）。","作为姓氏时一般不翻译含义，中文多按读音译为“阿尔科克”。不同家庭或个人也可能使用略有差异的译名。"]}
{"word":"alcogel","summary":{"en":"Alcogel is an alcohol-based gel used to sanitize hands and kill germs.","zh":"Alcogel指用于手部消毒、杀菌的酒精凝胶（免洗洗手液）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A gel containing alcohol (usually ethanol or isopropyl alcohol) used to clean hands and kill germs; alcohol-based hand sanitizer.","zh":"含酒精的凝胶（通常为乙醇或异丙醇），用于清洁双手、杀灭细菌的免洗消毒凝胶（酒精洗手液/凝胶）。"},"examples":[{"en":"Keep a small bottle of alcogel in your bag for when you can’t wash your hands.","zh":"包里放一小瓶alcogel，没法洗手的时候就能用。"},{"en":"The clinic provides alcogel at the entrance for all visitors.","zh":"诊所在入口处为所有访客提供alcogel消毒。"},{"en":"Use alcogel after touching shared surfaces like door handles.","zh":"摸过门把手这类公共接触面后，用alcogel消毒一下。"}]}],"synonyms":["hand sanitizer","alcohol gel","sanitizer gel","alcohol-based hand rub"],"phonetic":"/ˈæl.kəˌdʒɛl/","extraExplanation":["“alcogel”在很多地区（尤其是欧洲、拉美等）是“alcohol gel（酒精凝胶）/hand sanitizer（免洗洗手液）”的常见说法或商品名用法；英语中也常写作“alco-gel”或直接说“alcohol gel”。","常见有效酒精浓度通常在60%–70%（或更高）左右；日常表达里也会说“alcohol-based hand sanitizer（酒精类免洗洗手液）”。"]}
{"word":"alcogene","summary":{"en":"“Alcogene” is not a common standard English word; it’s likely a misspelling or a context-specific coined term (often related to alcohol + producing/gene).","zh":"“alcogene”不是常见标准英语词，可能是拼写错误或特定语境下的造词（常与“酒精”+“产生/基因”相关）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in most dictionaries; it may be a misspelling, a brand name, or a coined term. If it is used in a specific text, its meaning depends on that context (often something related to “alcohol” + “-gene/-gen,” meaning producing or generating).","zh":"在大多数英语词典中并不是标准词；可能是拼写错误、品牌名或临时造词。若出现在特定文章中，含义通常取决于语境（常见拆解为 alcohol“酒精” + -gene/-gen“产生/生成”）。"},"examples":[{"en":"I can’t find “alcogene” in a standard dictionary—could you share the sentence it appears in?","zh":"我在常见词典里查不到“alcogene”，你能把它出现的句子发我吗？"},{"en":"In that article, “alcogene” seems to mean something that produces alcohol.","zh":"在那篇文章里，“alcogene”似乎指“产生酒精的东西/因素”。"}]}],"phonetic":"/ˈælkoʊdʒiːn/","extraExplanation":["“alcogene”很可能是拼写或识别错误。你可能想查的是：\n- chalcogen（硫族元素，如氧、硫、硒等；与化学有关）\n- halogen（卤素，如氟、氯等）\n也可能是把 alcohol + gene（与酒精代谢相关的基因）或 alcohol + -gen（“生成……的”后缀）写成了一个词。把原句或领域（化学/生物/品牌/游戏等）发来，我可以帮你准确判断。"]}
{"word":"alcohate","summary":{"en":"“Alcohate” isn’t standard English; it’s usually a misspelling of “alcohol/alcoholic” or “alcoholate” (chemistry).","zh":"“alcohate”不是标准英语词；通常是“alcohol / alcoholic”或化学词“alcoholate”的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling of “alcoholate” (a chemistry term) or a mistaken form of “alcoholic/alcohol.”","zh":"不是标准英语单词；多见于对“alcoholate”（化学术语）或“alcoholic / alcohol”（酒精/酒精饮料）的拼写误写。"},"examples":[{"en":"I can’t find “alcohate” in a dictionary—did you mean “alcohol” or “alcoholic”?","zh":"我在词典里找不到“alcohate”——你想写的是“alcohol（酒精/酒）”还是“alcoholic（酒精的/酗酒者）”？"},{"en":"In chemistry texts, the word is usually “alcoholate,” not “alcohate.”","zh":"在化学文献里通常用“alcoholate”，而不是“alcohate”。"}]}],"synonyms":["alcohol","alcoholic","alcoholate","alkoxide"],"phonetic":"/ˈæl.kə.hə.leɪt/","extraExplanation":["“alcohate”很可能是把 alcohol / alcoholic 拼错了：alcohol 里有 “-hol”，不是 “-hat”。","如果你原本想表达“讨厌酒精/讨厌喝酒”，英语更自然的说法是：I hate alcohol. / I hate drinking.（而不是造一个新词 *alcohate）。","如果你是在化学语境里看到的词，可能是 alcoholate（也写作 alkoxide / alkoxylate 等相关术语，具体要看句子和领域）。把原句发给我，我可以帮你确认。"]}
{"word":"alcohol","summary":{"en":"Alcohol usually means alcoholic drinks, and it can also mean ethanol used in products like sanitizers.","zh":"Alcohol 通常指酒精饮料，也可指乙醇这种成分（如消毒用品中的酒精）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A drink such as beer, wine, or liquor that contains ethanol and can make people feel relaxed or drunk.","zh":"含乙醇的饮料（如啤酒、葡萄酒或烈酒），可能让人放松或醉酒。"},"examples":[{"en":"In many restaurants, alcohol is served only to adults.","zh":"在许多餐厅里，酒精饮料只卖给成年人。"},{"en":"He decided to stop drinking alcohol for his health.","zh":"为了健康，他决定戒酒。"}]},{"partOfSpeech":"n.","definition":{"en":"A chemical substance (especially ethanol) found in alcoholic drinks; also used in medicine, cleaning, and industry.","zh":"一种化学物质（尤指乙醇），存在于酒精饮料中；也用于医疗消毒、清洁和工业。"},"examples":[{"en":"This hand sanitizer contains alcohol.","zh":"这款免洗洗手液含有酒精。"},{"en":"The nurse wiped the skin with alcohol before the injection.","zh":"护士在注射前用酒精擦拭皮肤。"}]}],"synonyms":["liquor","booze","spirits","ethanol"],"phonetic":"/ˈæl.kə.hɔːl/","extraExplanation":["英语里 alcohol 既可指“酒精饮料”（日常语境常见），也可指“酒精/乙醇这种化学物质”（医疗、清洁、工业语境常见）。具体看上下文：drink alcohol=喝酒；contains alcohol=含酒精（成分）。","文化语境：在美国语境中，alcohol 往往与法定饮酒年龄（通常为 21 岁）以及“酒后驾驶（DUI）”等公共安全话题相关。写作或对话中可用 more neutral 的说法，如 alcoholic beverages（酒精饮料）或 drinking（饮酒）。"]}
{"word":"alcoholate","summary":{"en":"Alcoholate most commonly means an alkoxide (a salt/anion derived from an alcohol), and less commonly a verb meaning to form such a compound.","zh":"Alcoholate 最常指“醇盐/烷氧基化合物（由醇衍生）”，也可作动词表示“使生成醇盐”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound formed when an alcohol loses a hydrogen atom and becomes an alkoxide, often paired with a metal ion (for example, sodium ethoxide).","zh":"（化学）醇去掉一个氢原子后形成的“醇盐/烷氧基化合物”，常与金属离子结合（如：乙醇钠）。"},"examples":[{"en":"Sodium ethoxide is an alcoholate commonly used as a base in organic reactions.","zh":"乙醇钠是一种常见的醇盐，常在有机反应中用作碱。"},{"en":"The reaction produces an alcoholate intermediate before the final product forms.","zh":"该反应在生成最终产物前会先形成一个醇盐中间体。"}]},{"partOfSpeech":"v.","definition":{"en":"(chemistry) to form an alcoholate (alkoxide) from an alcohol, or to treat a substance with alcohol so it becomes an alcoholate.","zh":"（化学）使醇生成醇盐（烷氧基）；或用醇处理某物使其转化为醇盐/醇合物。"},"examples":[{"en":"The chemist alcoholated the solution by adding sodium to ethanol.","zh":"化学家将钠加入乙醇，使溶液生成乙醇钠（醇盐）。"}]}],"synonyms":["alkoxide","alkoxy salt"],"phonetic":"/ˈæl.kə.həˌleɪt/","extraExplanation":["“alcoholate”主要出现在化学语境中，日常英语很少用；在现代教材和论文里，更常见的说法是“alkoxide（烷氧基/醇盐）”。","命名上通常是“金属 + 醇名 + oxide/ate”的形式，例如 sodium ethoxide（乙醇钠）、potassium tert-butoxide（叔丁醇钾）。"]}
{"word":"alcoholature","summary":{"en":"“Alcoholature” is a rare, nonstandard blend of alcohol + literature, used playfully for alcohol-themed writing or book-and-drink culture.","zh":"“Alcoholature”是少见的非标准混成词（alcohol + literature），多用于戏谑地指酒精题材写作或“书与酒”的文化内容。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard) A humorous or coined word meaning “alcohol + literature,” often referring to writing about drinking, or to a playful pairing of books and alcoholic drinks.","zh":"（非标准用法）一个戏谑/自造词，意为“酒精 + 文学”，常指描写饮酒的文字作品，或把书与酒做趣味搭配的概念。"},"examples":[{"en":"Her blog is basically alcoholature: short book reviews matched with cocktails.","zh":"她的博客基本就是“alcoholature”：用鸡尾酒来搭配短书评。"},{"en":"The novel’s alcoholature is strong—nearly every chapter includes drinking scenes.","zh":"这部小说的“alcoholature”气息很浓——几乎每章都有饮酒场景。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare) The body of writing or cultural talk centered on alcohol (drinking culture, bars, cocktails, sobriety, etc.).","zh":"（很少见）围绕酒精展开的一系列写作或文化讨论（饮酒文化、酒吧、鸡尾酒、戒酒等）。"},"examples":[{"en":"He studies modern alcoholature and how it shapes ideas about nightlife.","zh":"他研究当代“alcoholature”以及它如何影响人们对夜生活的观念。"},{"en":"This memoir is part of today’s alcoholature, but it focuses on recovery.","zh":"这本回忆录也可算当代“alcoholature”的一部分，但它侧重于康复与戒酒。"}]}],"synonyms":["drinking literature","alcohol-themed writing","booze lit (informal)","bar stories"],"phonetic":"/ˈæl.kə.hɔːl.ə.tʃɚ/","extraExplanation":["“alcoholature”并不是常见词典词汇，更像是由 alcohol + literature 拼成的混成词（portmanteau）。在正式写作里更常用的表达是：drinking literature（饮酒题材文学）、alcohol-related literature（与酒精相关的文学/作品）、bar stories（酒吧故事）等。","如果你是在某本书、播客或社群里看到它，它可能是该圈子自创的标签/梗，用来指“书+酒”的内容风格。正式场合建议先解释或改用更通用的说法。"]}
{"word":"alcoholdom","summary":{"en":"A humorous word meaning “the world or culture related to alcohol and drinking.”","zh":"一个带幽默色彩的说法，指“与酒精和饮酒有关的世界/文化/圈子”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(humorous, informal) The world, culture, or sphere connected with alcohol and drinking—especially the drinking community or industry.","zh":"（幽默、非正式）与酒精和饮酒相关的世界／文化／圈子；尤指饮酒社群或酒类行业。"},"examples":[{"en":"In alcoholdom, craft cocktails and small-batch spirits are still trending.","zh":"在“酒精圈”（alcoholdom）里，精酿鸡尾酒和小批量烈酒仍然很流行。"},{"en":"She writes about the latest controversies in alcoholdom, from labeling rules to bar etiquette.","zh":"她写的是酒类圈最近的争议，从标签规定到酒吧礼仪。"}]}],"synonyms":["drinking culture","the bar scene","alcohol industry","booze world"],"phonetic":"/ˈæl.kəˌhɔl.dəm/","extraExplanation":["“alcoholdom”不是常见标准词，更多见于写作或媒体里的幽默用法，用来把“饮酒相关的一切”当成一个独立的“领域”。","后缀“-dom”常表示“领域/范围/状态”（如 kingdom 王国，freedom 自由），因此“alcoholdom”字面意思就是“酒精的领域/世界”。","使用时要注意语境：在正式写作中更常用 alcohol industry（酒类行业）、drinking culture（饮酒文化）、the bar scene（酒吧圈）。"]}
{"word":"alcoholemia","summary":{"en":"Alcoholemia means the level of alcohol in the bloodstream (a medical term).","zh":"Alcoholemia 指血液中的酒精含量（医学用语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the amount of alcohol in a person’s blood; blood alcohol level (medical term).","zh":"（医学）血液中的酒精含量；血中酒精浓度。"},"examples":[{"en":"The doctor measured his alcoholemia after the accident.","zh":"事故后，医生测量了他的血中酒精浓度。"},{"en":"High alcoholemia can slow reaction time and impair judgment.","zh":"较高的血中酒精含量会减慢反应速度并影响判断力。"},{"en":"The report listed alcoholemia as 0.08%.","zh":"报告中标注血中酒精浓度为0.08%。"}]}],"synonyms":["blood alcohol level","blood alcohol concentration","BAC"],"phonetic":"/ˌæl.kəˈhiː.mi.ə/","extraExplanation":["这是较偏医学/法律语境的词，在日常英语里更常说 blood alcohol level、blood alcohol concentration（BAC）。","词尾 -emia 来自希腊语，常表示“血液中的……”，例如 anemia（贫血）指血液中红细胞/血红蛋白不足；所以 alcoholemia 字面意思就是“血液中的酒精”。"]}
{"word":"alcoholic","summary":{"en":"“Alcoholic” most commonly means “containing alcohol,” and it can also mean “a person addicted to alcohol.”","zh":"“alcoholic”最常见表示“含酒精的/与酒精有关的”，也可作名词指“酒精成瘾者/酗酒者”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to alcohol or containing alcohol.","zh":"与酒精有关的；含酒精的。"},"examples":[{"en":"They serve alcoholic drinks, but also have non-alcoholic options.","zh":"他们提供含酒精饮料，但也有无酒精的选择。"},{"en":"Alcoholic beverages are only for adults in many countries.","zh":"在许多国家，含酒精饮料只允许成年人饮用。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who is addicted to alcohol or cannot control their drinking.","zh":"酗酒者；酒精成瘾者（难以控制饮酒的人）。"},"examples":[{"en":"He is a recovering alcoholic and has been sober for two years.","zh":"他是一名戒酒中的酒精成瘾者，已经清醒两年了。"},{"en":"The program offers support for alcoholics and their families.","zh":"该项目为酒精成瘾者及其家人提供支持。"}]}],"synonyms":["boozy","intoxicating","inebriating","person with alcohol use disorder"],"phonetic":"/ˌæl.kəˈhɔː.lɪk/","extraExplanation":["“Alcoholic”作名词时，指“酒精成瘾者/酗酒者”。在日常交流中，这个称呼有时会带标签化色彩；更中性、更尊重的说法是“a person with alcohol use disorder（有酒精使用障碍的人）”或“a person struggling with alcohol (addiction)（正在与酒精成瘾/饮酒问题斗争的人）”。","常见搭配：alcoholic drink/beverage（含酒精饮料）、alcoholic content（酒精含量）、recovering alcoholic（正在康复/戒酒中的人）、alcoholic addiction（酒精成瘾）。"]}
{"word":"alcoholically","summary":{"en":"Alcoholically means “in a way related to alcoholism” or “in a way involving drinking alcohol.”","zh":"alcoholically 表示“以酗酒/酒精依赖相关的方式”，也可指“以饮酒相关的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows alcoholism (alcohol dependence), especially drinking compulsively or habitually.","zh":"以酗酒／酒精依赖（酒瘾）的方式；指强迫性或习惯性地喝酒。"},"examples":[{"en":"He drank alcoholically for years before getting treatment.","zh":"在接受治疗前，他以酗酒的方式喝了很多年。"},{"en":"The novel portrays a character who lives alcoholically, damaging his relationships.","zh":"这部小说刻画了一个以酗酒方式生活、破坏人际关系的角色。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that involves alcoholic drinks; while drinking alcohol.","zh":"以含酒精饮品相关的方式；在饮酒时。"},"examples":[{"en":"Some people celebrate alcoholically, while others prefer nonalcoholic drinks.","zh":"有些人会用喝酒来庆祝，而另一些人更喜欢无酒精饮料。"},{"en":"The party started quietly and became more alcoholically focused as the night went on.","zh":"聚会一开始很安静，夜深后越来越以喝酒为中心。"}]}],"synonyms":["in an alcoholic way","with alcohol dependence","compulsively","habitually (with alcohol)"],"phonetic":"/ˌæl.kəˈhɑː.lɪ.kli/","extraExplanation":["“alcoholically”常用来描述一种不健康的饮酒模式（偏向“酗酒/酒瘾”语境）。在正式或更有同理心的表达中，也可以用“with alcohol dependence / in a way that suggests alcohol dependence”等说法，避免给人贴标签的感觉。","谈到这个词时容易涉及健康与成瘾议题；如果是在关心他人，英语里更常见更温和的表达是“has a drinking problem”或“struggles with alcohol”。"]}
{"word":"alcoholicity","summary":{"en":"Alcoholicity means alcoholism—the state of being addicted to alcohol (a less common term).","zh":"Alcoholicity 指酒精成瘾／酒精依赖（较少用的词，常用 alcoholism）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The condition of being addicted to alcohol; alcoholism (a less common, more formal word).","zh":"酒精成瘾的状态；酒精依赖／酒精成瘾（较少用、较正式的说法）。"},"examples":[{"en":"The clinic offers support for people dealing with alcoholicity and related health problems.","zh":"这家诊所为正在应对酒精成瘾及相关健康问题的人提供支持。"},{"en":"In older medical writing, you may see “alcoholicity” used where we now say “alcoholism.”","zh":"在较早的医学写作中，你可能会看到用“alcoholicity”来表达如今常说的“alcoholism（酒精成瘾）”。"}]}],"synonyms":["alcoholism","alcohol dependence","alcohol addiction","alcohol use disorder (AUD)"],"phonetic":"/ˌæl.kəˈhɑː.lə.sə.ti/","extraExplanation":["“alcoholicity”在现代英语中不如“alcoholism”常见；在医学或较正式的语境里偶尔出现。","谈论酒精成瘾时，很多医疗与公共卫生写作更倾向使用“alcohol use disorder (AUD)（酒精使用障碍）”，以强调这是可治疗的健康问题，并减少污名化。"]}
{"word":"alcoholics","summary":{"en":"“Alcoholics” usually means people who are addicted to alcohol; it’s the plural of “alcoholic.”","zh":"“alcoholics”通常指酒精成瘾者（酗酒者），是“alcoholic”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who has an alcohol use disorder (someone who cannot control drinking and continues despite harm).","zh":"酒精成瘾者；酗酒者（无法控制饮酒，并在造成伤害后仍继续饮酒的人）。"},"examples":[{"en":"He is a recovering alcoholic and hasn’t had a drink in three years.","zh":"他是一名戒酒中的酒精成瘾者，三年没喝过酒了。"},{"en":"Alcoholics may need medical help and long-term support to stop drinking safely.","zh":"酒精成瘾者可能需要医疗帮助和长期支持，才能安全地停止饮酒。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural form of alcoholic; people with alcohol addiction.","zh":"alcoholic 的复数；酒精成瘾者们；酗酒者们。"},"examples":[{"en":"The clinic offers a support group for alcoholics and their families.","zh":"这家诊所为酒精成瘾者及其家人提供互助小组。"},{"en":"Some alcoholics hide their drinking because they feel ashamed.","zh":"有些酒精成瘾者会隐瞒饮酒，因为他们感到羞耻。"}]}],"synonyms":["people with alcohol use disorder (AUD)","people with alcoholism","problem drinkers (broader, less exact)","heavy drinkers (not the same as addiction)"],"phonetic":"/ˌæl.kəˈhɑː.lɪks/","extraExplanation":["在更尊重与减污名的表达中，英语里常用“people with alcohol use disorder (AUD)”或“people with alcoholism（酒精依赖）”，强调“先是人、再是疾病”，比直接说“alcoholics”更温和。","“recovering alcoholic”表示正在康复/戒酒的人；也常见“in recovery”。在互助组织语境（如 Alcoholics Anonymous, AA）中，人们有时会自称“alcoholic”，作为对问题的承认与互相支持的一部分。","形容词用法的“alcoholic”意为“含酒精的/与酒精有关的”（如 alcoholic drinks 酒精饮料）。"]}
{"word":"alcoholimeter","summary":{"en":"An alcoholimeter is a tool for measuring the alcohol strength of a liquid (often spirits).","zh":"alcoholimeter 指测量液体（多为烈酒）酒精度的仪器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An instrument used to measure the alcohol content (strength) of a liquid, especially alcoholic drinks.","zh":"酒精计；用于测量液体（尤其是酒类）酒精含量（酒精度）的仪器。"},"examples":[{"en":"The distiller checked the spirit with an alcoholimeter before bottling.","zh":"酿酒师在装瓶前用酒精计检测蒸馏酒的酒精度。"},{"en":"Many alcoholimeters are calibrated at a specific temperature for accurate readings.","zh":"许多酒精计会在特定温度下校准，以获得准确读数。"}]}],"synonyms":["alcoholometer","alcohol hydrometer","proof hydrometer"],"phonetic":"/ˌæl.kəˈhɑː.ləˌmiː.tɚ/","extraExplanation":["“alcoholimeter”常用于蒸馏与酿酒行业，也可写作 alcoholometer（更常见）。它通常基于液体密度（比重）来推算酒精度；如果液体含糖或其他溶质较多，读数可能需要修正。","在实际语境中，人们也常说 hydrometer（比重计）或 alcohol hydrometer（酒精比重计）。需要注意：它测的是“酒精度/ABV”的估算值，和实验室用的精密分析方法不同。"]}
{"word":"alcoholisation","summary":{"en":"Alcoholisation means the process of adding alcohol to something; less commonly, it can refer to becoming intoxicated or developing alcohol dependence.","zh":"Alcoholisation 指“加入酒精的过程”；较少见时也可指“醉酒过程”或“酒精依赖/成瘾的形成”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of adding alcohol to something (such as a drink, medicine, or product)","zh":"（在饮料、药品或产品中）加入酒精的过程；酒精化（处理）"},"examples":[{"en":"The lab used alcoholisation to prepare the herbal extract for long-term storage.","zh":"实验室用酒精化处理来制备草本提取物，以便长期保存。"},{"en":"In some industrial processes, alcoholisation helps prevent microbial growth.","zh":"在一些工业流程中，酒精化处理有助于抑制微生物生长。"}]},{"partOfSpeech":"n.","definition":{"en":"the process of becoming intoxicated or developing alcohol dependence (less common and often technical)","zh":"醉酒过程；酒精依赖/酒精成瘾的形成（较少见，多用于技术语境）"},"examples":[{"en":"The report discussed early signs that may lead to alcoholisation in vulnerable groups.","zh":"报告讨论了在脆弱人群中可能导致酒精化（走向成瘾）的早期迹象。"},{"en":"Clinicians warn that repeated binge drinking can accelerate alcoholisation.","zh":"临床人员警告说，反复暴饮会加速酒精化（成瘾进程）。"}]}],"synonyms":["alcoholization","fortification (of drinks)","intoxication","inebriation","alcohol dependence"],"phonetic":"/ˌæl.kə.hə.ləˈzeɪ.ʃən/","extraExplanation":["“alcoholisation”更常见于英式拼写；美式英语里通常写作“alcoholization”。","该词多见于科技/医学/工业写作；日常英语里更常用“adding alcohol”“fortification (of a beverage)”“intoxication”“alcohol dependence”等更具体的表达。"]}
{"word":"alcoholise","summary":{"en":"Alcoholise means to add alcohol to something, or to treat/preserve it with alcohol; rarely, it can mean to make someone drunk.","zh":"Alcoholise 指给某物加入酒精，或用酒精处理/保存；很少情况下也可指使人醉酒。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to add alcohol to something (for example, a drink, a mixture, or a product).","zh":"（向某物中）加入酒精；使含酒精。"},"examples":[{"en":"Some manufacturers alcoholise the syrup to improve flavor and preservation.","zh":"一些厂家会在糖浆中加入酒精，以改善风味并帮助保存。"},{"en":"The lab alcoholised the solution before storing it.","zh":"实验室在储存前让该溶液含有酒精（加入酒精处理）。"}]},{"partOfSpeech":"v.","definition":{"en":"to treat or preserve something with alcohol (often for cleaning, disinfecting, or preventing decay).","zh":"用酒精处理（常指清洁、消毒或防腐）。"},"examples":[{"en":"Alcoholise the surface before you apply the bandage.","zh":"贴绷带前先用酒精处理（消毒）表面。"},{"en":"Specimens were alcoholised to prevent decay.","zh":"标本用酒精处理以防腐败。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare) to make someone intoxicated; to cause drunkenness.","zh":"（罕见）使人醉酒；使酩酊。"},"examples":[{"en":"He was easily alcoholised after just one strong cocktail.","zh":"他只喝了一杯烈鸡尾酒就很容易醉。"}]}],"synonyms":["alcoholize","add alcohol to","fortify","spike","disinfect","sterilize","preserve"],"phonetic":"/ˈæl.kə.həˌlaɪz/","extraExplanation":["“alcoholise”是英式拼写；美式更常见的是“alcoholize”。在日常英语里，这个动词并不常用，通常会用更自然的表达：add alcohol to…（往……加酒精）、preserve in alcohol（用酒精保存）、disinfect with alcohol（用酒精消毒）、get someone drunk（把人灌醉/使人喝醉）。","在医护或实验语境中，“alcoholise”可能指用酒精擦拭/浸泡来消毒或保存，但写作时常用更明确的动词（如 disinfect、sterilize、preserve）。"]}
{"word":"alcoholised","summary":{"en":"Alcoholised means “containing alcohol (made alcoholic)” or, less commonly, “drunk/intoxicated.”","zh":"Alcoholised 指“含酒精的/被酒精化的”，较少见也可指“喝醉的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a drink or other liquid) made alcoholic by adding alcohol or by fermentation.","zh":"（指饮料或其他液体）加入酒精或经发酵而变成含酒精的。"},"examples":[{"en":"Only alcoholised beverages are sold after 10 p.m.","zh":"晚上10点以后只出售含酒精饮品。"},{"en":"The sauce is lightly alcoholised with a splash of brandy.","zh":"这道酱汁加了一点白兰地，带有轻微酒精味。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of a person) intoxicated; under the influence of alcohol.","zh":"（指人）喝醉的；受酒精影响的。"},"examples":[{"en":"He sounded alcoholised and kept repeating himself.","zh":"他听起来像是喝醉了，一直重复同样的话。"},{"en":"Police refused entry to alcoholised spectators.","zh":"警方拒绝让醉酒的观众入场。"}]}],"synonyms":["alcoholic","alcohol-containing","fortified","intoxicated","drunk"],"phonetic":"/ˈæl.kə.hɑː.laɪzd/","extraExplanation":["“alcoholised”是英式拼写，对应美式更常见的“alcoholized”。在日常英语里，描述“喝醉”更常用 drunk / intoxicated；“alcoholised”更偏正式或常见于法律、医疗、新闻语境。","在食品与饮料说明中，“alcoholised”常用于表示“含酒精/加了酒精”，但标签上更常见的表达是 “alcoholic” 或 “contains alcohol”。"]}
{"word":"alcoholising","summary":{"en":"Alcoholising means adding alcohol or treating something with alcohol; less commonly, it can mean causing alcohol dependence.","zh":"Alcoholising 指添加酒精或用酒精处理；较少见地也可指导致酒精依赖。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"the process of adding alcohol to something (or treating something with alcohol), or making something alcoholic","zh":"给某物添加酒精（或用酒精处理），使其含酒精/酒精化的过程"},"examples":[{"en":"The lab is alcoholising the equipment to reduce contamination.","zh":"实验室正在用酒精处理器材，以减少污染。"},{"en":"Some producers are alcoholising the mixture to increase its alcohol content.","zh":"一些生产商正在给混合物添加酒精，以提高酒精含量。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common) causing someone to become dependent on alcohol; making someone an alcoholic","zh":"（较少见）使某人对酒精产生依赖；使某人酒精成瘾"},"examples":[{"en":"He warned that stress and isolation can be alcoholising for some people.","zh":"他警告说，压力和孤立对一些人可能会“促成酒精成瘾”。"}]}],"synonyms":["alcoholizing","adding alcohol","fortifying (with alcohol)","spiking (with alcohol)","disinfecting (with alcohol)"],"phonetic":"/ˈæl.kə.hɔˌlaɪ.zɪŋ/","extraExplanation":["“alcoholising”是英式拼写；美式更常见写法是“alcoholizing”。两者意思相同。","在科学/医疗语境里，常见的是“用酒精消毒/处理”（例如 alcoholise instruments）。在日常生活中，“使人酒精成瘾”这层意思较少见，通常会用更直接的说法，如 “lead someone to alcoholism / make someone an alcoholic”。"]}
{"word":"alcoholism","summary":{"en":"Alcoholism is the inability to control drinking despite harmful consequences (also called alcohol use disorder).","zh":"Alcoholism 指无法控制饮酒且在造成伤害后仍持续饮酒的疾病（也称酒精使用障碍）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical condition in which a person cannot control drinking and keeps drinking despite harm to health, relationships, or work; alcohol use disorder (AUD).","zh":"一种疾病：无法控制饮酒，并且即使饮酒已伤害健康、人际关系或工作仍持续饮酒；即酒精使用障碍（AUD）。"},"examples":[{"en":"Alcoholism can affect the whole family, not just the person who drinks.","zh":"酒精成瘾会影响整个家庭，不只是饮酒者本人。"},{"en":"He sought treatment for alcoholism after repeated problems at work.","zh":"在工作上反复出问题后，他为酒精成瘾寻求治疗。"},{"en":"Many people recover from alcoholism with counseling, support groups, and medical care.","zh":"许多人通过心理咨询、互助团体和医疗照护从酒精成瘾中康复。"}]}],"synonyms":["alcohol use disorder (AUD)","alcohol dependence","problem drinking"],"phonetic":"/ˈæl.kə.hɑː.lɪ.zəm/","extraExplanation":["“alcoholism”在日常英语中很常用，但医学与公共卫生语境更常说“alcohol use disorder (AUD)”，强调这是一种可诊断、可治疗的健康问题，而不是道德失败。","语气与敏感性：谈到他人时，很多场合更偏好“a person with alcoholism/AUD”（有酒精成瘾/酒精使用障碍的人），而不是“an alcoholic”（酒鬼/酒徒），以减少污名化。","构词小提示：-ism 常表示“某种状态/体系/倾向”（如 racism 种族主义、tourism 旅游业），因此 alcoholism 指“与酒精相关的成瘾状态”。"]}
{"word":"alcoholisms","summary":{"en":"“Alcoholisms” is the plural of “alcoholism,” meaning alcohol addiction; the plural is uncommon and usually used in academic contexts to compare different cases or types.","zh":"“Alcoholisms”是“alcoholism”的复数，指酒精成瘾；复数形式较少见，多用于学术语境中比较不同案例或类型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The disease/condition of being addicted to alcohol; a pattern of compulsive drinking that causes health or life problems.","zh":"酒精成瘾；酒精依赖（对酒精产生依赖、无法控制饮酒，并造成健康或生活问题的疾病/状态）。"},"examples":[{"en":"He has been in treatment for alcoholism for six months.","zh":"他接受酒精成瘾治疗已经六个月了。"},{"en":"Alcoholism can damage relationships, work, and health.","zh":"酒精成瘾会伤害人际关系、工作和健康。"}]},{"partOfSpeech":"n.","definition":{"en":"In some contexts, different types or cases of alcohol addiction (plural form used in academic or comparative writing).","zh":"（较少见）在学术或比较语境中指不同类型/不同案例的酒精成瘾（复数用法）。"},"examples":[{"en":"Researchers compared alcoholisms across different age groups.","zh":"研究者比较了不同年龄群体中的酒精成瘾案例。"}]}],"synonyms":["alcohol addiction","alcohol dependence","alcohol use disorder (AUD)"],"phonetic":"/ˈæl.kə.hɔː.lɪ.zəm/","extraExplanation":["“alcoholism”在日常英语里通常是不可数名词，更常说：alcoholism（不加-s）、alcohol addiction、alcohol use disorder（医学/正式用语）。","“alcoholisms”这个复数形式不太常见；多出现在研究、统计或讨论“不同类型/不同人群的案例”时。","表达时可注意尊重与去污名化：可以说“a person with alcoholism”（患有酒精成瘾的人），而不是用带标签的说法。"]}
{"word":"alcoholist","summary":{"en":"“Alcoholist” is a rare, nonstandard word for someone who drinks alcohol regularly, often meaning an alcoholic.","zh":"“alcoholist”是少见且不太标准的词，指经常饮酒的人，常用来表示“酗酒者/酒精成瘾者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, nonstandard) A person who drinks alcohol regularly; often used to mean an alcoholic.","zh":"（少见、非标准用法）经常饮酒的人；常被用来表示“酒精成瘾者/酗酒者”。"},"examples":[{"en":"Some people say “alcoholist,” but “alcoholic” is the common word in English.","zh":"有些人会说“alcoholist”，但英语里更常用的词是“alcoholic”。"},{"en":"He described himself as an alcoholist, meaning he had a serious drinking problem.","zh":"他称自己是“alcoholist”，意思是他有严重的饮酒问题。"}]}],"synonyms":["alcoholic","drinker","heavy drinker"],"phonetic":"/ˈæl.kə.hɑː.lɪst/","extraExplanation":["“alcoholist”在现代英语里很少见，也不太标准。日常表达通常用：\n- “alcoholic”（最常见，表示酒精依赖/酗酒者）\n- 更委婉、更注重“人”的说法： “a person with alcohol use disorder (AUD)”（医学/正式语境）\n写作或正式场合建议避免用“alcoholist”，以免显得不地道或不够准确。"]}
{"word":"alcoholizable","summary":{"en":"Alcoholizable means “able to be converted into alcohol,” usually by fermentation.","zh":"Alcoholizable 指“可被转化为酒精的”，通常指可通过发酵产生酒精。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to be turned into alcohol (especially by fermentation); capable of producing alcohol.","zh":"可被转化为酒精的（尤指可通过发酵产生酒精的）；能产酒精的。"},"examples":[{"en":"Grapes contain alcoholizable sugars that yeast can ferment into ethanol.","zh":"葡萄含有可被转化为酒精的糖分，酵母可以把它们发酵成乙醇。"},{"en":"The lab measured how much alcoholizable material was in the sample.","zh":"实验室测量了样品中有多少可被转化为酒精的物质。"}]}],"synonyms":["fermentable (when talking about sugars)","convertible into alcohol","ethanol-producing (in context)"],"phonetic":"/ˌæl.kəˈhɑː.ləˌzaɪ.zə.bəl/","extraExplanation":["“alcoholizable”比较少见，常见于酿造学、食品科学或化学语境里，常和“sugars（糖）”“material（物质）”“substrate（底物）”等搭配，用来强调“能被酵母发酵成乙醇”。日常英语更常说：fermentable (sugars)（可发酵的糖）或 can be fermented into alcohol（能发酵成酒精）。","构词：alcohol + -ize + -able。-ize 表示“使……化”，-able 表示“可以……的”，合起来就是“可以被酒精化/转成酒精的”。在酿酒语境中，它往往特指“可转化为乙醇的糖分或成分”。"]}
{"word":"alcoholization","summary":{"en":"Alcoholization usually means treating something with alcohol or adding alcohol; less commonly, it means becoming drunk.","zh":"Alcoholization 通常指用酒精处理或加入酒精；较少用来表示醉酒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of adding alcohol to something or treating something with alcohol (for example, for preservation, extraction, or disinfection)","zh":"（向某物）加入酒精或用酒精处理的过程（如用于保存、萃取或消毒）"},"examples":[{"en":"In the lab, alcoholization of the plant material helps preserve it before testing.","zh":"在实验室里，用酒精处理植物材料有助于在检测前保存样本。"},{"en":"Some traditional preparations use alcoholization to extract flavor and active compounds.","zh":"一些传统制剂会用酒精浸提来萃取风味和有效成分。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) the act or state of becoming intoxicated; drunkenness","zh":"（较少用）醉酒的行为或状态；酒醉"},"examples":[{"en":"The report mentioned repeated alcoholization and its effects on health.","zh":"报告提到了反复醉酒及其对健康的影响。"}]}],"synonyms":["alcohol treatment","addition of alcohol","intoxication","drunkenness"],"phonetic":"ˌæl.kə.hə.laɪˈzeɪ.ʃən","extraExplanation":["“alcoholization”在日常英语里不算常用词，更常见的说法是：用于“用酒精处理/加入酒精”时说 add alcohol, treat with alcohol, alcohol treatment；用于“醉酒”时说 intoxication, drunkenness。","在医学或公共卫生语境中，表示“醉酒/酒精中毒”更常用 intoxication（中毒/醉酒）或 alcohol poisoning（酒精中毒）；而在化学/生物实验语境中，它更可能指“用酒精使样品固定、脱水或保存”等处理过程。"]}
{"word":"alcoholize","summary":{"en":"Alcoholize means to add alcohol to something (often for preservation) or to make someone drunk.","zh":"Alcoholize 指在某物中加入酒精（常用于保存/处理），或使某人醉酒。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to add alcohol to something; to treat or preserve something with alcohol","zh":"在某物中加入酒精；用酒精处理或保存（某物）"},"examples":[{"en":"The lab alcoholized the solution to preserve the sample.","zh":"实验室在溶液中加入酒精来保存样本。"},{"en":"Some products are alcoholized during processing to improve shelf life.","zh":"有些产品在加工过程中会加入酒精处理，以延长保质期。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make someone intoxicated (drunk); to cause drunkenness","zh":"使某人醉酒；使人处于酒精作用下"},"examples":[{"en":"The strong punch quickly alcoholized several guests.","zh":"那杯烈味的宾治很快就把几位客人灌醉了。"},{"en":"He didn’t mean to alcoholize anyone; he misjudged how strong it was.","zh":"他并不是想把别人灌醉，只是低估了酒的度数。"}]}],"synonyms":["add alcohol to","fortify","preserve","intoxicate","inebriate","get (someone) drunk"],"phonetic":"ˈælkəˌhaɪz","extraExplanation":["“alcoholize”在日常英语中不算常用，更常见的说法是“add alcohol to… / preserve with alcohol / get someone drunk / intoxicate”。在科技、医学、食品加工等语境中，用来表示“用酒精处理或加入酒精”会更自然。","美式拼写是 alcoholize；英式拼写常见 alcoholise。"]}
{"word":"alcoholized","summary":{"en":"Alcoholized means “containing/treated with alcohol,” and less commonly “drunk from alcohol.”","zh":"alcoholized 指“含酒精/用酒精处理的”，较少也可指“喝醉的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing alcohol or treated with alcohol; made alcoholic (often used for drinks, solutions, or extracts).","zh":"含酒精的；用酒精处理的；使带酒精（常用于饮料、溶液或提取物）。"},"examples":[{"en":"The lab used an alcoholized solution to clean the equipment.","zh":"实验室用含酒精的溶液来清洁设备。"},{"en":"Some flavorings are alcoholized to preserve the aroma.","zh":"有些香料会用酒精处理以保留香气。"}]},{"partOfSpeech":"adj.","definition":{"en":"Intoxicated from drinking alcohol; drunk (less common and can sound formal or old-fashioned).","zh":"因饮酒而醉的；喝醉的（较少见，语气可能偏正式或旧式）。"},"examples":[{"en":"He sounded alcoholized and kept repeating the same story.","zh":"他听起来像是喝醉了，一直重复同一个故事。"},{"en":"The report said the driver was alcoholized at the time of the accident.","zh":"报告称该司机在事故发生时处于醉酒状态。"}]}],"synonyms":["alcoholic","alcohol-containing","spirited","intoxicated","drunk"],"phonetic":"/ˈæl.kə.həˌlaɪzd/","extraExplanation":["“alcoholized”常见于技术/说明性语境（如化学、制药、食品）来描述“含酒精”或“用酒精处理过”的配方；日常英语更常说“alcoholic”（含酒精的）或“drunk/intoxicated”（喝醉的）。","构词：alcohol + -ize（使……化）+ -ed（形容词化/过去分词），字面意思是“被酒精化了”。"]}
{"word":"alcoholizing","summary":{"en":"Alcoholizing means adding or using alcohol to treat something, or (less commonly) making someone intoxicated.","zh":"Alcoholizing 指加入/使用酒精来处理某物；较少见时也可指使人醉酒。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"adding alcohol to a liquid or mixture; treating something with alcohol (often to preserve, disinfect, or extract flavors/chemicals).","zh":"向液体或混合物中加入酒精；用酒精处理某物（常用于保存、消毒或萃取成分/风味）。"},"examples":[{"en":"The lab is alcoholizing the plant samples to preserve them for testing.","zh":"实验室正在用酒精处理植物样本，以便保存用于检测。"},{"en":"Some producers avoid alcoholizing the drink and keep it naturally low in alcohol.","zh":"有些生产商避免给饮料“加酒精”，而是保持其天然低酒精。"}]},{"partOfSpeech":"v.","definition":{"en":"making someone intoxicated; causing drunkenness (less common and often informal).","zh":"使人醉酒；使人产生酒醉状态（较少见，且常带口语色彩）。"},"examples":[{"en":"He said the strong punch was alcoholizing everyone at the party.","zh":"他说那杯很烈的潘趣酒把派对上的人都喝醉了。"}]}],"synonyms":["adding alcohol","fortifying","spiking","treating with alcohol","intoxicating"],"phonetic":"/ˈæl.kə.həˌlaɪ.zɪŋ/","extraExplanation":["“alcoholizing”来自动词 alcoholize（英式拼写 alcoholise）。在食品、化学、医药语境里更常指“加入/使用酒精进行处理”，比“把人灌醉”更正式、更常见。"]}
{"word":"alcoholmeter","summary":{"en":"An alcoholmeter is a tool for measuring how much alcohol a liquid contains.","zh":"alcoholmeter 指“酒精计/测酒精度计”，用来测量液体的酒精含量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An instrument used to measure the amount (percentage) of alcohol in a liquid, especially in wine, beer, or spirits.","zh":"酒精计；测酒精度计：用来测量液体中酒精含量（百分比）的仪器，常用于葡萄酒、啤酒或烈酒。"},"examples":[{"en":"The distiller checked the spirit with an alcoholmeter before bottling it.","zh":"酿酒师在装瓶前用酒精计检测了烈酒的酒精度。"},{"en":"Home brewers often use an alcoholmeter to estimate alcohol by volume (ABV).","zh":"自酿者常用酒精计来估算酒精度（ABV，酒精体积分数）。"}]}],"synonyms":["alcohol meter","alcohol hydrometer","proof meter","hydrometer"],"phonetic":"/ˌæl.kəˈhɔlˌmiː.tɚ/","extraExplanation":["在日常英文里也常见更通用的说法：alcohol meter（分开写）或 alcohol hydrometer（酒精比重计）。在啤酒/葡萄酒酿造中，很多人更常用 hydrometer（比重计）通过“发酵前后比重差”来推算 ABV；而蒸馏酒常用酒精计直接读出酒精度。不同仪器的刻度与适用液体可能不同，使用时要注意温度校正与说明书。"]}
{"word":"alcoholmetric","summary":{"en":"“Alcoholmetric” means “about measuring alcohol strength (ABV) in liquids.”","zh":"“alcoholmetric”意为“与测量液体酒精度（ABV）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to measuring the strength (percentage) of alcohol in a liquid.","zh":"与测量液体中酒精浓度（酒精度）有关的；酒精测定的。"},"examples":[{"en":"An alcoholmetric test showed the spirit was 40% alcohol by volume.","zh":"酒精测定结果显示这种烈酒的酒精度为40%（按体积计）。"},{"en":"The lab uses alcoholmetric methods to verify product labels.","zh":"实验室使用酒精测定方法来核对产品标签。"}]}],"synonyms":["alcoholometric","alcoholometry-related","ABV-measuring"],"phonetic":"/ˌæl.kə.hɔlˈmɛt.rɪk/","extraExplanation":["“alcoholmetric”较少见，更常见的相关词是“alcoholometric”（同义）以及名词“alcoholometry”（酒精测定法）。在酿酒、蒸馏、食品检测、法规检验等语境中，会涉及用酒精计（alcoholmeter/hydrometer）来测ABV（alcohol by volume，酒精度）。"]}
{"word":"alcoholomania","summary":{"en":"Alcoholomania is an older term meaning an uncontrollable craving for alcohol (alcohol addiction).","zh":"Alcoholomania 是较旧的术语，指对酒精无法控制的强烈渴求（酒精成瘾）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical or psychological term for an abnormal, uncontrollable craving for alcohol; alcohol addiction (now more commonly called alcohol use disorder).","zh":"（医学/心理学用语）对酒精的异常、难以控制的强烈渴求；酒精成瘾（现在更常用“酒精使用障碍”来表达）。"},"examples":[{"en":"In older medical writing, alcoholomania was used to describe compulsive drinking.","zh":"在较早的医学文献中，alcoholomania 用来描述强迫性饮酒。"},{"en":"The clinic no longer uses the word alcoholomania; it screens patients for alcohol use disorder instead.","zh":"这家诊所已不再使用 alcoholomania 这个词，而是改用“酒精使用障碍”的评估方式。"}]}],"synonyms":["alcoholism","alcohol addiction","alcohol dependence","alcohol use disorder (modern term)"],"phonetic":"/ˌæl.kəˌhɑː.ləˈmeɪ.ni.ə/","extraExplanation":["这是一个较老、较少见的术语：-mania 表示“狂热/强迫性的冲动”，因此 alcoholomania 字面是“对酒精的狂热/强迫”。现代医学与公共健康领域更倾向使用中性、非污名化的说法，如 alcohol use disorder（酒精使用障碍）。","在日常英语中，人们通常说 alcoholism（酗酒/酒精依赖，语感较常见）或 problem drinking（饮酒问题）。在正式场合，用 alcohol use disorder 更贴近当代临床表述。"]}
{"word":"alcoholometer","summary":{"en":"An alcoholometer is a tool for measuring how much alcohol a liquid contains.","zh":"alcoholometer 指用于测量液体酒精含量（酒精度/浓度）的仪器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An instrument used to measure the alcohol content (strength) of a liquid, especially spirits.","zh":"酒精计；测酒精度仪（用于测量液体中的酒精含量，尤指烈酒的酒精度/浓度）。"},"examples":[{"en":"The distiller used an alcoholometer to check the strength of the newly distilled spirit.","zh":"酿酒师用酒精计检查新蒸馏出的烈酒度数。"},{"en":"If the alcoholometer reading is too high, the spirit may be diluted with water.","zh":"如果酒精计读数太高，可能需要加水稀释。"}]}],"synonyms":["alcohol meter","hydrometer (for alcohol)","spirit hydrometer"],"phonetic":"/ˌæl.kəˈhɑl.əˌmi.tɚ/","extraExplanation":["“alcoholometer”常见于酿酒、蒸馏与质量检验语境，通常通过浮力/密度来推算酒精浓度。","不同国家的标示体系可能不同：有的读数对应ABV（alcohol by volume，按体积计的酒精百分比），有的与“proof（酒精度数）”体系相关。"]}
{"word":"alcoholometric","summary":{"en":"Alcoholometric means “related to measuring alcohol content.”","zh":"alcoholometric 指“与测量酒精含量（酒精度）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the measurement of alcohol content (especially in alcoholic liquids).","zh":"与酒精含量的测量有关的（尤指测量酒精饮料中的酒精度）。"},"examples":[{"en":"An alcoholometric test showed the spirit was 40% alcohol by volume (ABV).","zh":"酒精度测定显示这款烈酒的酒精度为 40%（按体积计，ABV）。"},{"en":"The lab uses alcoholometric methods to verify labeling accuracy.","zh":"实验室使用酒精度测定方法来核实标签标注是否准确。"}]}],"synonyms":["alcoholimetric","alcohol-content measurement (related)","ABV-measurement (related)"],"phonetic":"/ˌæl.kə.hɑː.ləˈmɛt.rɪk/","extraExplanation":["“alcoholometric”来自 alcohol（酒精）+ -metric（测量的），常见于蒸馏、酿造、食品检验、海关与质检等语境。","相关名词是 alcoholometry（酒精度测定/酒精计量学）；常见工具包括 alcoholometer（酒精计）或 hydrometer（比重计），用于估算或测定 ABV。"]}
{"word":"alcoholometrical","summary":{"en":"Alcoholometrical means “connected with measuring alcohol strength (ABV), often using an alcoholometer.”","zh":"alcoholometrical 指“与测量酒精度（ABV）有关的（常用酒精计）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the measurement of the strength (percentage) of alcohol, especially by using an alcoholometer.","zh":"与酒精浓度（酒精度）测量有关的，尤指用酒精计进行测量的。"},"examples":[{"en":"The lab report includes alcoholometrical readings taken at 20°C.","zh":"实验报告包含在20°C下测得的酒精计读数。"},{"en":"Alcoholometrical tests help confirm the alcohol content of spirits before bottling.","zh":"装瓶前进行酒精度测量有助于确认烈酒的酒精含量。"}]}],"synonyms":["alcoholometric","related to alcohol measurement","ABV-measuring"],"phonetic":"/ˌæl.kəˌhɑːl.əˈmɛ.trɪ.kəl/","extraExplanation":["“alcoholometrical”较少用于日常英语，多见于化学、酿造、蒸馏、质检或旧式技术文献中。更常见的表达是“alcohol content (ABV)”或“alcohol measurement”。","词根拆解：alcohol + -meter（测量仪器）+ -ical（……的）。对应名词是“alcoholometry（酒精度测定）”，测量仪器是“alcoholometer（酒精计）”。"]}
{"word":"alcoholometry","summary":{"en":"Alcoholometry means measuring alcohol content (strength) in liquids, especially alcoholic beverages.","zh":"alcoholometry 指测量液体（尤指酒类）中酒精含量/酒精度的方法或学科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the science or practice of measuring the amount (strength) of alcohol in a liquid, especially in alcoholic drinks","zh":"酒精测定学；测量液体（尤其是酒类）中酒精含量（酒精度/强度）的科学或方法"},"examples":[{"en":"Alcoholometry is used to determine the alcohol content of spirits like vodka or whiskey.","zh":"酒精测定学用于测定伏特加、威士忌等烈酒的酒精含量。"},{"en":"In quality control, alcoholometry helps breweries keep each batch at a consistent strength.","zh":"在质量控制中，酒精测定有助于啤酒厂保持每一批产品的酒精度一致。"}]}],"synonyms":["alcohol measurement","alcohol content analysis","ABV determination"],"phonetic":"/ˌæl.kəˈhɑːl.ɑː.mə.tri/","extraExplanation":["词源上由 alcohol（酒精）+ -metry（测量）构成，意思直观就是“酒精的测量”。","常见工具与方法包括酒精计/比重计（alcoholmeter/hydrometer）以及现代的密度测定、蒸馏后测量等；测量结果常以 ABV（Alcohol by Volume，按体积计酒精度）表示。"]}
{"word":"alcoholophilia","summary":{"en":"Alcoholophilia means a strong liking for or attraction to alcohol (a rare word).","zh":"alcoholophilia 指对酒精的强烈喜爱或吸引（较罕见的词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) A strong liking for or attraction to alcohol; love of drinking alcohol.","zh":"（罕见）对酒精的强烈喜爱或吸引；嗜酒的倾向。"},"examples":[{"en":"His jokes about alcoholophilia worried his friends because he drank every night.","zh":"他拿“alcoholophilia（嗜酒倾向）”开玩笑，却让朋友担心，因为他每晚都在喝酒。"},{"en":"The article used the word alcoholophilia to describe a cultural fascination with drinking.","zh":"那篇文章用 alcoholophilia 来形容一种对饮酒的文化迷恋。"}]}],"synonyms":["fondness for alcohol","love of drinking","taste for alcohol","alcohol addiction (not the same, but related)"],"phonetic":"/ˌæl.kəˌhɑː.ləˈfɪl.i.ə/","extraExplanation":["这个词在日常英语中非常少见，更多见于戏谑、修辞或非正式的“造词”。正式语境里更常用 alcohol use disorder（酒精使用障碍）、alcohol dependence（酒精依赖）、heavy drinking（大量饮酒）等表述。","词根说明：alcohol + -philia（“喜爱/偏好”）。英语里有很多类似构词，如 bibliophilia（爱书）、audiophilia（发烧友）。使用这类“-philia”词汇时要注意语境：有时只是“兴趣/偏好”，有时可能带有“问题性/过度”的暗示。"]}
{"word":"alcohols","summary":{"en":"“Alcohols” can mean alcoholic drinks as a group, or (in chemistry) compounds with an -OH group.","zh":"“alcohols”可指一类酒精饮品；在化学中指含羟基（-OH）的醇类化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Drinks that contain ethanol (like beer, wine, or spirits), especially when talking about them as a group.","zh":"含乙醇的酒类饮品（如啤酒、葡萄酒、烈酒等），尤指作为一类来谈论。"},"examples":[{"en":"The store sells a wide range of alcohols, including beer and wine.","zh":"这家店出售多种酒类饮品，包括啤酒和葡萄酒。"},{"en":"Some people avoid alcohols for health or religious reasons.","zh":"有些人出于健康或宗教原因避免饮酒。"}]},{"partOfSpeech":"n.","definition":{"en":"(Chemistry) Organic compounds with a hydroxyl group (-OH), such as ethanol and methanol.","zh":"（化学）含有羟基（-OH）的有机化合物，如乙醇和甲醇。"},"examples":[{"en":"Ethanol and methanol are two common alcohols in chemistry.","zh":"乙醇和甲醇是化学中两种常见的醇类。"},{"en":"Many alcohols can be used as solvents in laboratories.","zh":"许多醇类可在实验室中用作溶剂。"}]}],"synonyms":["alcoholic drinks","liquor","spirits","booze","alcoholic beverages","alcohol compounds"],"phonetic":"/ˈæl.kə.hɔl/","extraExplanation":["“alcohols”是“alcohol”的复数：在日常英语里常指“各种酒类饮品”；在理工科语境里更常指“醇类化合物”。","日常表达里如果泛指“喝酒/酒精（这一类物质）”，更常用不可数名词“alcohol”（如：He doesn’t drink alcohol）。若强调“不同种类的酒”，才更常用复数“alcohols”（如：a selection of alcohols）。"]}
{"word":"alcoholuria","summary":{"en":"Alcoholuria means having alcohol present in the urine.","zh":"Alcoholuria 指尿液中出现酒精（乙醇）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the presence of alcohol (ethanol) in the urine.","zh":"尿中含有酒精（乙醇）的现象；酒精尿。"},"examples":[{"en":"The lab report noted alcoholuria after the patient’s heavy drinking the night before.","zh":"化验报告显示患者前一晚大量饮酒后出现酒精尿。"},{"en":"Alcoholuria can be detected with urine testing, though blood tests may reflect current intoxication more directly.","zh":"酒精尿可通过尿检发现，不过血检通常更能直接反映当前的醉酒程度。"}]}],"synonyms":["ethanoluria","urinary alcohol"],"phonetic":"/ˌæl.kəˌhɑːlˈjʊr.i.ə/","extraExplanation":["“alcoholuria”多见于医学或检验语境，属于较少见、偏专业的词。","它由 alcohol（酒精）+ -uria（表示“尿中出现某物”的医学后缀，如 proteinuria“蛋白尿”）构成。","尿中的酒精常与近期饮酒有关；在临床与法医场景中，检测方式与解读会结合采样时间、代谢速度等因素。"]}
{"word":"alcoholysis","summary":{"en":"Alcoholysis is the chemical breakdown of a compound by an alcohol, often used in organic chemistry and biodiesel production.","zh":"Alcoholysis 指“由醇引起的分解反应（醇解）”，常见于有机化学与生物柴油制备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A chemical reaction in which an alcohol breaks a chemical bond (often an ester bond), producing new compounds (commonly a new ester and another alcohol or related product).","zh":"醇解：一种化学反应，醇会断开某种化学键（常见为酯键），生成新的化合物（通常得到新的酯以及另一种醇或相关产物）。"},"examples":[{"en":"Biodiesel can be produced by the alcoholysis of vegetable oils with methanol.","zh":"生物柴油可以通过植物油与甲醇的醇解反应来制备。"},{"en":"In the lab, we studied alcoholysis as a way to modify ester compounds.","zh":"在实验室里，我们学习醇解作为改性酯类化合物的一种方法。"}]}],"synonyms":["solvolysis (by alcohol)","transesterification (common specific case)"],"phonetic":"/ˌæl.kəˈhɑː.lə.sɪs/","extraExplanation":["“alcoholysis”主要用于有机化学与工业化学语境，常与“hydrolysis（加水分解）”对比：hydrolysis 用水作反应物，而 alcoholysis 用醇（如甲醇、乙醇）。","在生物柴油领域，常见的是三酰甘油（油脂）与甲醇/乙醇发生醇解（更具体常说 transesterification，酯交换），生成脂肪酸甲酯/乙酯（生物柴油）和甘油。","词形结构：alcohol（醇）+ -lysis（分解/裂解），-lysis 表示“分解反应”，如 hydrolysis（加水分解）、electrolysis（电解）。"]}
{"word":"alcoholytic","summary":{"en":"Alcoholytic means “related to or causing alcoholysis,” a chemical bond-breaking reaction involving an alcohol.","zh":"alcoholytic 指“与醇解有关或能引起醇解的”，常用于化学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or causing alcoholysis (a chemical reaction where an alcohol breaks a chemical bond, often replacing a group in a molecule).","zh":"与“醇解”有关的；能引起醇解的（指醇类参与反应，断裂某种化学键并常伴随取代）。"},"examples":[{"en":"Methanol can be used in an alcoholytic reaction to convert an ester into a different ester.","zh":"甲醇可用于醇解反应，把一种酯转化为另一种酯。"},{"en":"The paper describes alcoholytic cleavage of the polymer under mild conditions.","zh":"这篇论文描述了该聚合物在温和条件下的醇解断裂。"}]}],"synonyms":["alcoholysis-related","alcohol-splitting","alcohol-mediated"],"phonetic":"/ˌæl.kə.həˈlɪt.ɪk/","extraExplanation":["“alcoholytic”主要见于化学/生物化学语境，来自 alcohol（醇/酒精）+ -lytic（溶解、裂解的）。它通常不是日常英语中形容“与酒精有关”的常用词；日常表达更常用 alcoholic（含酒精的/酗酒的）或 alcohol-related（与酒精相关的）。","相关名词是 alcoholysis（醇解）。常见搭配：alcoholytic reaction（醇解反应）、alcoholytic cleavage（醇解裂解）、alcoholytic degradation（醇解降解）。"]}
{"word":"Alcolu","summary":{"en":"Alcolu is a place name: a small community in South Carolina, USA.","zh":"Alcolu 是一个地名：美国南卡罗来纳州的一个小社区。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a small unincorporated community in Clarendon County, South Carolina, USA","zh":"美国南卡罗来纳州克拉伦登县的一个小型非建制社区（地名）"},"examples":[{"en":"Alcolu is a quiet community in Clarendon County, South Carolina.","zh":"Alcolu 是南卡罗来纳州克拉伦登县的一个安静社区。"},{"en":"The documentary mentioned events that took place in Alcolu during the 1940s.","zh":"那部纪录片提到了 20 世纪 40 年代发生在 Alcolu 的事件。"}]}],"phonetic":"/ˈælkəlu/","extraExplanation":["Alcolu 常在历史与社会议题语境中被提及，尤其与 1944 年“George Stinney Jr.”案件有关：他是美国历史上已知最年轻的被处决者之一，案件后来引发广泛争议与反思。","作为地名，Alcolu 在英语中通常像专有名词一样使用：首字母大写，不加冠词（不说 the Alcolu，除非特指某个设施如 the Alcolu post office）。"]}
{"word":"Alcon","summary":{"en":"“Alcon” can mean an archaic literary “everyone/all of you,” and it is also the name of an eye-care company/brand.","zh":"“Alcon”既可指古用文学表达“大家/诸位”，也可指一家眼科护理公司/品牌（爱尔康）。"},"definitions":[{"partOfSpeech":"pron.","definition":{"en":"(Archaic, literary) everyone; all people (often used to address a group, like “everyone”).","zh":"（古用／文学用语）大家；所有人（常用于对一群人发话，相当于“各位/大家”）。"},"examples":[{"en":"Alcon, listen to my words.","zh":"各位，请听我说。"},{"en":"Peace be with you, alcon.","zh":"愿平安与你们同在，各位。"}]},{"partOfSpeech":"other","definition":{"en":"Alcon (proper noun): a global eye-care and medical-device company; also used as a brand name in eye-related products.","zh":"Alcon（专有名词）：一家全球性的眼科护理与医疗器械公司；也常作为眼科相关产品的品牌名。"},"examples":[{"en":"She uses Alcon contact lens solution.","zh":"她用爱尔康（Alcon）的隐形眼镜护理液。"},{"en":"Alcon develops surgical equipment for eye procedures.","zh":"Alcon 研发用于眼科手术的设备。"}]}],"synonyms":["everyone","everybody","all (of you)","all people"],"phonetic":"/ˈæl.kən/","extraExplanation":["“alcon”作为“大家/众人”的用法非常古老，主要见于中古英语和早期诗歌、宗教或演讲式的文字里；现代英语几乎不用，更多会用 everyone / everybody / all of you。","词形常被解释为“all”加上古老的成分（与早期英语中的用法有关），因此带有明显的古风、诗体色彩。"]}
{"word":"alconde","summary":{"en":"An alcove is a small recessed area or nook in a room or wall.","zh":"alcove 指房间或墙面上凹进去的小空间或角落。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small recessed space in a room or wall; a nook.","zh":"（房间或墙里的）凹处；壁龛；小角落"},"examples":[{"en":"She put a reading chair in the alcove by the window.","zh":"她把一把阅读椅放在窗边的壁龛里。"},{"en":"The bed was tucked into an alcove to save space.","zh":"床被塞进一个凹进去的小角落里以节省空间。"}]}],"synonyms":["nook","recess","corner","bay"],"phonetic":"/ˈælkoʊv/","extraExplanation":["“alconde” 不是常见的英语单词，很可能是拼写错误；最接近且常用的词是 “alcove”（壁龛/凹处）。如果你想查的是别的词（例如人名、地名或其他语言的词），告诉我上下文或原句，我可以再确认。"]}
{"word":"alcoothionic","summary":{"en":"“Alcoothionic” is not a standard English word; its meaning is unclear and it is likely a misspelling (often of “alcoholic”).","zh":"“alcoothionic”不是标准英语词；含义不明确，可能是拼写错误（常见误写为“alcoholic”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or extremely rare term; it does not appear in major English dictionaries, so its meaning is unclear without context. It may be a misspelling of a more common word (often “alcoholic”).","zh":"非标准或极罕见的词；在主流英语词典中通常查不到，因此含义不清，需要语境才能判断。它可能是更常见词的拼写错误（常见为“alcoholic”）。"},"examples":[{"en":"I couldn’t find “alcoothionic” in standard English dictionaries—could you share the sentence where you saw it?","zh":"我在常用英语词典中找不到“alcoothionic”——你能把它出现的句子发我吗？"},{"en":"If you meant “alcoholic,” the spelling is different and the meaning changes.","zh":"如果你想写的是“alcoholic”，拼写不同，意思也会不一样。"}]}],"synonyms":["(possible intended word) alcoholic","alcohol-related","alcohol-based"],"phonetic":"/ˌælkoʊˈθaɪɑnɪk/","extraExplanation":["这个词很可能是拼写误差或专业领域里的自造词/极小众术语。请提供：1）原句或段落；2）主题领域（化学/医学/文学等）；3）是否来自扫描版PDF或手写体（容易看错字母）。我就能判断它到底指什么，并给出准确释义与用法。","如果你想表达“与酒精有关的”，常见词是 alcohol / alcoholic / alcoholic beverage；如果你想表达“含酒精的（用于消毒）”，常见说法是 alcohol-based。"]}
{"word":"Alcor","summary":{"en":"Alcor is a faint star near Mizar in Ursa Major, famously used in tradition as an eyesight test.","zh":"Alcor 是大熊座中靠近开阳星（Mizar）的一颗暗星，传统上常被用来考验肉眼视力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A faint star in the constellation Ursa Major (the Big Dipper area), traditionally known as a companion to the star Mizar and sometimes used as a simple eyesight test.","zh":"一颗位于大熊座（北斗七星附近）的暗星，传统上被认为是与“开阳星”（Mizar）相伴的星，有时被用作简单的视力辨识测试。"},"examples":[{"en":"On a clear night, people try to spot Alcor next to Mizar in the Big Dipper’s handle.","zh":"在晴朗的夜晚，人们会试着在北斗七星“斗柄”处的开阳星（Mizar）旁边找到辅星 Alcor。"},{"en":"In some traditions, seeing Alcor without help was taken as a sign of sharp eyesight.","zh":"在一些传统里，不借助工具就能看见 Alcor 被视为视力很好的表现。"}]}],"phonetic":"/ˈælkɔr/","extraExplanation":["词源与文化：Alcor 这个名字来自阿拉伯语，常被解释为“微弱者/被忽略者”之类的含义（不同资料译法略有差异）。它与 Mizar 在天空中距离很近，肉眼有时能分辨成两点，因此在民间传说与航海/观星故事里经常一起出现。","天文学补充：现代天文学认为 Alcor 与 Mizar 都与多星系统有关（并非只是“两个单星并排”那么简单），但日常英语里 Alcor 最常作为这颗恒星的名称来使用。"]}
{"word":"alcor","summary":{"en":"Alcor is a star near Mizar in the Big Dipper, traditionally used as a simple eyesight test.","zh":"Alcor（辅星）是北斗七星中靠近 Mizar（开阳）的一颗恒星，传统上常被用作简单的“视力测试星”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A star in the constellation Ursa Major (the Big Dipper), close to the star Mizar; it is sometimes used as a traditional test of sharp eyesight because the two stars appear close together.","zh":"“辅星”（Alcor）：位于大熊座（北斗七星所在星座）的一颗恒星，靠近“开阳星”（Mizar）；由于两星距离很近，传统上常被用作视力是否敏锐的简单测试。"},"examples":[{"en":"On a clear night, you can try to spot Alcor next to Mizar in the Big Dipper.","zh":"在晴朗的夜晚，你可以试着在北斗七星里找出紧挨着开阳星（Mizar）的辅星（Alcor）。"},{"en":"Some people say that seeing Alcor without binoculars means you have good eyesight.","zh":"有人说如果不用望远镜就能看见辅星（Alcor），说明视力不错。"}]}],"synonyms":["80 Ursae Majoris"],"phonetic":"/ˈælˌkɔr/","extraExplanation":["Alcor 常与 Mizar（中文常译“开阳”）成对出现；肉眼看去像一颗亮星旁边贴着一颗更暗的小星，因此在多种文化里被当作“能不能分辨细节”的象征性视力测试。","词源上，Alcor 来自阿拉伯语音译（常被解释为“微弱/昏暗的”之意），反映了它在肉眼观测中较暗、较难辨认的特点。"]}
{"word":"Alcoran","summary":{"en":"“Alcoran” is an archaic English term for the Qur’an.","zh":"“Alcoran”是《古兰经》的过时英语称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an old-fashioned (now rare) English word for the Qur’an, the holy book of Islam","zh":"（过时、少见）《古兰经》的旧式英语称呼，即伊斯兰教的经典"},"examples":[{"en":"In some older English texts, the Qur’an is called the Alcoran.","zh":"在一些较早期的英文文本中，《古兰经》被称作 Alcoran。"},{"en":"Modern writing usually prefers “the Qur’an” rather than “Alcoran.”","zh":"现代写作通常更倾向使用 “the Qur’an”，而不是 “Alcoran”。"}]}],"synonyms":["Qur'an","Koran"],"phonetic":"/ˈæl.kə.ræn/","extraExplanation":["“Alcoran”多见于早期欧洲英文或拉丁化/法语化的写法，源自对阿拉伯语“al-Qurʾān（古兰经）”的旧式转写。","当代英语中使用“Alcoran”可能显得过时，甚至带有历史语境中的“他者化”色彩；在正式或尊重的表达里，更常用并建议使用“Qur’an / Koran”。"]}
{"word":"alcoran","summary":{"en":"Alcoran is an archaic English term for the Qur’an, the Islamic holy book.","zh":"Alcoran 是《古兰经》的古旧英文称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an old-fashioned or historical English word for the Qur’an (the holy book of Islam).","zh":"《古兰经》的旧式或历史性英文称呼（伊斯兰教的经典）。"},"examples":[{"en":"In some older European writings, the Qur’an was called the Alcoran.","zh":"在一些较早的欧洲著作中，《古兰经》被称为 Alcoran。"},{"en":"Modern English usually uses “Qur’an” (or “Koran”), not “Alcoran.”","zh":"现代英语通常用“Qur’an”（或“Koran”），而不用“Alcoran”。"}]}],"synonyms":["Qur'an","Koran"],"phonetic":"/ˌælkəˈrɑn/","extraExplanation":["“Alcoran”多见于早期英语/欧洲文献，是对阿拉伯语 al-Qur’ān 的旧式转写；在当代英语中基本不用。","由于该词常出现在殖民时代或带偏见的旧文本里，现代写作更推荐使用更准确、也更尊重的拼写“Qur’an”（或常见的“Koran”）。"]}
{"word":"Alcoranic","summary":{"en":"Alcoranic means “Qur’anic”—related to the Qur’an; it is an older, less common word today.","zh":"Alcoranic 意为“古兰经的”；属于较旧、如今较少见的用词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Qur’an (also spelled Quran/Koran), especially in an older or formal style.","zh":"与《古兰经》有关的；古兰经的（多为较古老或较正式的用法）。"},"examples":[{"en":"Some 19th‑century writers used the term “Alcoranic” when discussing Islamic scripture.","zh":"一些19世纪的作者在讨论伊斯兰经典时会用“Alcoranic”这个词。"},{"en":"The museum label described the manuscript’s Alcoranic quotations.","zh":"博物馆的说明牌称这份手稿包含《古兰经》的引文。"}]}],"synonyms":["Quranic","Koranic"],"phonetic":"ˌæl.kəˈræn.ɪk","extraExplanation":["“Alcoranic”源自较早的英语写法“Alcoran”（对 Qur’an 的旧式拼写），因此在现代英语中比较少见。现在更常用的是 “Quranic” 或 “Koranic”。","在学术或历史文本中看到 “Alcoranic” 时，通常只是反映当时的拼写与译写习惯，并不一定带有特殊立场。"]}
{"word":"alcoranic","summary":{"en":"Alcoranic means “Qur’an-related; Quranic,” but it is archaic/rare today.","zh":"alcoranic 意为“与《古兰经》有关的”，但在现代英语中较古旧/少见。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Qur’an (also spelled the Koran), the holy book of Islam; Quranic/Koranic. (Archaic or rare in modern English.)","zh":"与《古兰经》（也拼作 Koran）有关的；古兰经的。（较古旧或少见）"},"examples":[{"en":"The writer used several Alcoranic references to discuss Islamic ethics.","zh":"作者引用了几处古兰经相关的内容来讨论伊斯兰伦理。"},{"en":"In older English texts, you may see “Alcoranic” where modern writers would say “Quranic.”","zh":"在较早的英文文本中，你可能会看到“Alcoranic”，而现代作者通常会写“Quranic”。"}]}],"synonyms":["Quranic","Koranic"],"phonetic":"/ˌælkəˈrænɪk/","extraExplanation":["“Alcoranic”来自较旧的英语用法：过去常用“Alcoran/Alcoran”指《古兰经》（现多用“Qur’an/Quran”或“Koran”）。因此这个形容词在现代写作里通常被“Quranic/Koranic”取代。","在宗教与文化语境中，现代英文更倾向使用“Qur’an / Quran”，因为它更接近阿拉伯语发音与转写习惯。"]}
{"word":"Alcoranist","summary":{"en":"An archaic word meaning a Muslim; literally, a follower of the Qur’an (formerly spelled “Alcoran”).","zh":"古语词，指穆斯林；字面为《古兰经》（旧拼 Alcoran）的信奉者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) a follower of the Alcoran (an old English spelling of the Qur’an); a Muslim.","zh":"（古语）《可兰经》（Qur’an 的旧式英文拼写 Alcoran）的信奉者；穆斯林。"},"examples":[{"en":"In older European writings, an “Alcoranist” meant a Muslim believer.","zh":"在较早的欧洲著作中，“Alcoranist”指的是穆斯林信徒。"},{"en":"The novel uses the term “Alcoranist,” but modern English usually says “Muslim.”","zh":"这部小说用了“Alcoranist”一词，但现代英语通常说“Muslim（穆斯林）”。"}]}],"synonyms":["Muslim","believer in Islam","Islamic follower"],"phonetic":"/ælˈkɔrənɪst/","extraExplanation":["“Alcoran”是 Qur’an 的旧式拼写，常见于早期欧洲/英语文本（尤其是带有东方学色彩的写作）。因此“Alcoranist”也带有明显的时代痕迹，现代英语中基本不用。","在当代语境里，建议使用更中性、准确的词：Muslim（穆斯林）。避免使用过时且可能带偏见的旧称（例如 Mohammedan）。"]}
{"word":"alcoranist","summary":{"en":"“Alcoranist” is an old-fashioned word meaning a Muslim, i.e., a follower of the Qur’an.","zh":"“Alcoranist”是旧式用语，意思是穆斯林，即信奉《古兰经》的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) A Muslim; a follower of the Qur’an (formerly often spelled “Alcoran” in older English).","zh":"（古旧用法）穆斯林；《古兰经》（旧式英语常拼作 Alcoran）的信奉者。"},"examples":[{"en":"In some 17th–19th century writings, the author calls Muslims “Alcoranists.”","zh":"在一些17至19世纪的作品中，作者把穆斯林称为“Alcoranists”。"},{"en":"The term “Alcoranist” is rarely used in modern English; “Muslim” is standard today.","zh":"“Alcoranist”在现代英语中很少使用；如今通常说“Muslim”。"}]}],"synonyms":["Muslim","follower of Islam","(historical) Mohammedan (dated/offensive in some contexts)"],"phonetic":"/ælˈkɔrənɪst/","extraExplanation":["“Alcoranist”来自早期英语对《古兰经》Qur’an 的旧拼写“Alcoran/Alkoran”，因此字面意思是“信奉《古兰经》的人”。","这个词在现代英语里基本不用，带有明显的时代色彩；在一些旧式旅行记、宗教争论或殖民时期文本中出现时，可能夹带“他者化/东方主义”语气。写作与交流中更推荐使用“Muslim”或“follower of Islam”。"]}
{"word":"alcornoco","summary":{"en":"Alcornoco means “cork oak,” the tree whose bark is used to make cork.","zh":"Alcornoco 指“栓皮栎（软木橡树）”，其树皮用于制作软木。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cork oak tree (the species that produces cork), especially the Mediterranean cork oak; sometimes used to mean its cork bark.","zh":"栓皮栎（产软木的橡树，尤指地中海地区的栓皮栎）；有时也指其栓皮（软木树皮）。"},"examples":[{"en":"Traditional cork comes from the bark of the alcornoco.","zh":"传统软木来自栓皮栎（alcornoco）的树皮。"},{"en":"In parts of Spain and Portugal, alcornoco forests are managed for cork harvesting.","zh":"在西班牙和葡萄牙的一些地区，人们管理栓皮栎林以采收软木。"}]}],"synonyms":["cork oak","cork tree","alcornoque"],"phonetic":"/ˌæl.kɔrˈnoʊ.koʊ/","extraExplanation":["“alcornoco”多被认为是从西班牙语/葡萄牙语词源（常见形式为 *alcornoque*）进入英语的少见拼写或变体；在现代英语里更常见的标准说法是 **cork oak**（栓皮栎）。","软木不是把树砍掉得到的，而是周期性剥取树皮外层；这种做法在伊比利亚半岛（西班牙、葡萄牙）具有重要的生态与经济意义。"]}
{"word":"alcornoque","summary":{"en":"Alcornoque is a Spanish word meaning “cork oak,” and informally it can also mean “a blockhead” (an insult).","zh":"Alcornoque 是西语，常指“栓皮栎／软木橡树”；口语里也可骂人，指“笨蛋／木头人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) the cork oak tree, whose bark is harvested to make cork.","zh":"（西语）栓皮栎／软木橡树；其树皮可剥取制作软木。"},"examples":[{"en":"In Spain, the alcornoque is valued because it produces cork without killing the tree.","zh":"在西班牙，alcornoque 很受重视，因为它能产出软木而不需要砍伐树木。"},{"en":"Wine corks are often made from the bark of the alcornoque.","zh":"葡萄酒瓶塞常用 alcornoque 的树皮制成。"}]},{"partOfSpeech":"n.","definition":{"en":"(Spanish, informal, insulting) a foolish or dull person; a blockhead.","zh":"（西语，非正式、带侮辱）蠢人；木头人；笨蛋。"},"examples":[{"en":"He called me an alcornoque for forgetting the keys. (rude)","zh":"我忘带钥匙，他骂我 alcornoque。（粗鲁）"},{"en":"Don’t use “alcornoque” in polite conversation—it’s an insult.","zh":"在正式或礼貌的场合不要用 “alcornoque”，因为它是骂人的。"}]}],"synonyms":["cork oak","blockhead","idiot"],"phonetic":"/ˌæl.kɔrˈnoʊ.keɪ/","extraExplanation":["“Alcornoque”在西班牙与葡萄牙一带很常见，相关的软木产业（例如瓶塞、软木地板、隔热材料）与地中海生态系统联系紧密。","作为骂人的用法，它带有“像木头一样不开窍”的比喻色彩；语气偏冲，最好避免对人使用。"]}
{"word":"alcosol","summary":{"en":"Alcohol usually means alcoholic drinks or ethanol; in chemistry it also means a broader class of -OH compounds.","zh":"Alcohol 通常指酒类/乙醇；在化学中也指含 -OH 的一类“醇”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A drink that contains ethanol (like beer, wine, or liquor), or the substance ethanol itself.","zh":"含有乙醇的饮料（如啤酒、葡萄酒、烈酒等），或乙醇这种物质本身。"},"examples":[{"en":"He doesn’t drink alcohol.","zh":"他不喝酒。"},{"en":"This medicine should not be taken with alcohol.","zh":"这种药不要和酒一起服用。"},{"en":"The main alcohol in beer and wine is ethanol.","zh":"啤酒和葡萄酒中的主要酒精是乙醇。"}]},{"partOfSpeech":"n.","definition":{"en":"In chemistry, a type of organic compound with a hydroxyl (-OH) group (e.g., methanol, ethanol).","zh":"（化学）一类含有羟基（-OH）的有机化合物（如甲醇、乙醇）。"},"examples":[{"en":"Ethanol is an alcohol used in fuel and hand sanitizer.","zh":"乙醇是一种用于燃料和免洗洗手液的醇。"},{"en":"Some alcohols are toxic, like methanol.","zh":"有些醇是有毒的，比如甲醇。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to alcoholic drinks (used before a noun).","zh":"与酒精饮料有关的（用于名词前作定语）。"},"examples":[{"en":"They sell alcohol-free beer.","zh":"他们卖无酒精啤酒。"},{"en":"The restaurant has an alcohol license.","zh":"这家餐厅有酒类经营许可证。"}]}],"synonyms":["liquor","booze (informal)","ethanol"],"phonetic":"/ˈæl.kə.hɑːl/","extraExplanation":["你输入的“alcosol”常见是拼写错误；更常见的正确拼写是 **alcohol**。在口语里也有人说“alc/alky”作俚语缩写，但正式写作中建议用 alcohol。","词源小知识：alcohol 来自阿拉伯语 **al-kuḥl**，早期指一种细粉（眼线粉），后来在炼金术语境中引申为“提纯出的精华/蒸馏物”，再发展为今天的“酒精”。"]}
{"word":"Alcot","summary":{"en":"“Alcot” is likely a misspelling of “Alcott,” a surname best known from the author Louisa May Alcott (Little Women).","zh":"“Alcot”很可能是“Alcott”的误拼；“Alcott”是一个姓氏，最常见指《小妇人》作者露易莎·梅·奥尔科特。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper noun) A surname; most famously referring to Louisa May Alcott, an American author best known for the novel Little Women.","zh":"（专有名词）一个英文姓氏；最常见的指代是美国作家露易莎·梅·奥尔科特（Louisa May Alcott），以小说《小妇人》最为著名。"},"examples":[{"en":"I’m reading Little Women by Louisa May Alcott.","zh":"我正在读露易莎·梅·奥尔科特的《小妇人》。"},{"en":"Alcott’s stories often focus on family, growing up, and moral choices.","zh":"奥尔科特的故事常常关注家庭、成长以及道德选择。"}]}],"synonyms":["Alcott"],"phonetic":"ˈɔlˌkɑt","extraExplanation":["你输入的“Alcot”在英语里并不常见；更常见的拼写是“Alcott”（多一个t），尤其是在指作家 Louisa May Alcott 时。","Louisa May Alcott（1832–1888）生活在美国新英格兰地区，她的作品常被视为“成长小说（coming-of-age）”与家庭文学的代表；《Little Women》在英语文化中知名度很高，也常被改编成电影与电视剧。"]}
{"word":"Alcotate","summary":{"en":"Allocate means to distribute or set aside money, time, or resources for a specific purpose, or to assign tasks/places.","zh":"Allocate 指为特定目的分配/划拨资金、时间或资源，也可指分派任务或安排名额。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to give or set aside something (such as money, time, or resources) for a particular purpose","zh":"（为某个目的）分配；划拨；拨出（资金、时间或资源）"},"examples":[{"en":"The school allocated more money to the library this year.","zh":"学校今年给图书馆分配了更多经费。"},{"en":"We need to allocate enough time to finish the project.","zh":"我们需要拨出足够的时间来完成这个项目。"}]},{"partOfSpeech":"vt.","definition":{"en":"to decide where people or things should go; to assign","zh":"分派；指派（人员或任务到某处/某项工作）"},"examples":[{"en":"The manager allocated tasks to each team member.","zh":"经理把任务分派给每位团队成员。"},{"en":"Seats were allocated on a first-come, first-served basis.","zh":"座位按先到先得的原则分配。"}]}],"synonyms":["assign","distribute","allot","designate","apportion"],"phonetic":"/ˈæləˌkeɪt/","extraExplanation":["你输入的“Alcotate”很可能是拼写错误，常见正确拼写是 allocate。allocate 常用于正式语境（工作、政府、预算、项目管理），比 give/put 更强调“按计划/按规则分配”。","词源提示：来自拉丁语词根，含义与“分配到某个位置/份额”有关，所以常与 budget（预算）、resources（资源）、funds（资金）、time（时间）等搭配。"]}
{"word":"alcotate","summary":{"en":"“Alcotate” is not standard English; it’s likely a misspelling (often of “allocate”).","zh":"“alcotate”不是标准英语词，通常是误拼（常见是“allocate”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard or widely recognized English word. You may be seeing a misspelling or a very rare/obsolete form.","zh":"这不是一个标准或常见的英语单词；你可能看到的是拼写错误，或极少见/已过时的形式。"},"examples":[{"en":"I can’t find “alcotate” in major English dictionaries—could you share the sentence where you saw it?","zh":"在主流英语词典里我查不到“alcotate”；你能把它出现的句子发给我吗？"},{"en":"If you meant “allocate,” the budget was allocated to schools and hospitals.","zh":"如果你想写的是“allocate（分配）”，预算被分配给了学校和医院。"}]}],"synonyms":["allocate","advocate","annotate"],"phonetic":"/ˈæl.kəˌteɪt/","extraExplanation":["“alcotate”很可能是以下词的误拼（取决于语境）：\n1) allocate /ˈæləˌkeɪt/：分配（资源、时间、预算）\n2) advocate /ˈædvəˌkeɪt/：提倡；拥护\n3) annotate /ˈænəˌteɪt/：做注释\n4) alkylate /ˈæl.kəˌleɪt/（化学）：烷基化\n\n把你看到它的原句（或截图）发来，我可以根据上下文帮你精准判断到底是哪一个词。"]}
{"word":"Alcott","summary":{"en":"Alcott is a surname, most closely associated with American author Louisa May Alcott, best known for Little Women.","zh":"Alcott 是一个姓氏，最常指美国作家路易莎·梅·奥尔科特，以《小妇人》最著名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname), best known from Louisa May Alcott (1832–1888), an American novelist famous for Little Women.","zh":"一个姓氏（家族名）；最广为人知的是美国作家路易莎·梅·奥尔科特（1832–1888），《小妇人》的作者。"},"examples":[{"en":"I’m reading Alcott’s Little Women for a class.","zh":"我在为课程阅读奥尔科特的《小妇人》。"},{"en":"Alcott is often taught as a classic American author.","zh":"奥尔科特常被作为美国经典作家来教授。"}]},{"partOfSpeech":"other","definition":{"en":"(by extension) a reference to the Alcott family, especially Bronson Alcott (her father), an American educator and thinker.","zh":"（引申）指奥尔科特家族，尤指她的父亲布朗森·奥尔科特——美国教育家与思想家。"},"examples":[{"en":"The lecture mentioned the Alcotts and their connection to New England intellectual life.","zh":"讲座提到奥尔科特一家及其与新英格兰知识界的联系。"}]}],"synonyms":["Louisa May Alcott"],"phonetic":"ˈɔl.kɑt","extraExplanation":["“Alcott”在英语语境里多作为专有名词出现，常见搭配是“Louisa May Alcott（路易莎·梅·奥尔科特）”和她的作品名《Little Women（小妇人）》。","奥尔科特与19世纪美国新英格兰文化圈有关，常被放在“家庭、成长、女性教育与自我实现”等主题中讨论。"]}
{"word":"Alcova","summary":{"en":"Alcova is a less common spelling of alcove: a small recessed space in a room, sometimes referring (literarily) to a private sleeping area.","zh":"Alcova 是 alcove 的较少见拼写：指房间里凹进去的小空间；在文学语境中也可指私密的睡眠处/卧室。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small recessed area or niche in a room, often used for a bed, seating, or display","zh":"（房间内的）壁龛；凹进去的小空间（常用来放床、座位或陈列物品）"},"examples":[{"en":"The hotel room had an alcova with a reading chair and a lamp.","zh":"酒店房间里有一个壁龛，放着阅读椅和台灯。"},{"en":"They put the bed in the alcova to save space.","zh":"他们把床放在壁龛里以节省空间。"},{"en":"A vase stood in an alcova beside the fireplace.","zh":"壁炉旁的壁龛里摆着一个花瓶。"}]},{"partOfSpeech":"n.","definition":{"en":"(literary/old-fashioned) a private sleeping area; a bedroom, especially suggesting intimacy","zh":"（文学/较旧用法）私密的睡眠空间；卧室（常带“亲密、私房”的暗示）"},"examples":[{"en":"In the novel, the letter was hidden in her alcova.","zh":"小说里，那封信被藏在她的卧室里。"},{"en":"The poem describes a quiet alcova lit by candlelight.","zh":"诗中描写了一个烛光照亮的安静卧室。"}]}],"synonyms":["alcove","niche","recess","bay"],"phonetic":"/ˈælkoʊv/","extraExplanation":["“Alcova”在英语里不如更常见的拼写“alcove”普遍，多见于个别写法或受其他语言（如西班牙语/意大利语）影响的拼写。","词源与“alcove”相同，通常追溯到阿拉伯语词根，原义与“拱顶、穹顶的小空间”有关，因此常指墙内凹进去的一块区域。"]}
{"word":"alcove","summary":{"en":"An alcove is a small recessed nook in a room or wall.","zh":"alcove 指房间或墙壁里凹进去的一小块空间（壁龛/凹室）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small recessed area (a niche) in a room or wall, often used for a bed, seating, or a display.","zh":"（房间或墙壁里）凹进去的一小块空间／壁龛，常用于放床、座位或摆设。"},"examples":[{"en":"They put a reading chair and lamp in the alcove by the window.","zh":"他们在窗边的壁龛里放了一把阅读椅和一盏灯。"},{"en":"The bed fits neatly into the alcove, saving space in the room.","zh":"床正好嵌在凹室里，节省了房间空间。"},{"en":"A statue stood in an alcove along the hallway.","zh":"走廊旁的壁龛里立着一尊雕像。"}]}],"synonyms":["nook","recess","niche","cubicle"],"phonetic":"/ˈælˌkoʊv/","extraExplanation":["“alcove”常用于室内设计与建筑语境，强调“向里凹进去”的空间感（recessed）。在美式英语里，房产描述中常见如“bed alcove / dining alcove”。"]}
{"word":"alcoved","summary":{"en":"Alcoved means “having alcoves,” describing a room or space with recessed nooks in the wall.","zh":"alcoved 表示“带有壁龛/凹室的”，用来形容墙面有凹入小空间的房间或场所。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having one or more alcoves (small recessed spaces) built into a wall or room.","zh":"有壁龛的；带有凹室的（墙面或房间里有一个或多个小的凹入空间）。"},"examples":[{"en":"They rented an alcoved studio with a sleeping nook behind a curtain.","zh":"他们租了一间带壁龛的单间，窗帘后面有个睡眠小凹室。"},{"en":"The alcoved hallway displayed family photos in the recesses.","zh":"这条带壁龛的走廊把家庭照片陈列在墙面的凹槽里。"}]}],"synonyms":["recessed","nook-filled","indented"],"phonetic":"/ælˈkoʊvd/","extraExplanation":["“alcove”常见于建筑与室内设计语境，指墙面或房间里凹进去的一小块空间，常用来放床、书桌、雕像或书架。“alcoved”多用于描述“带有这种凹入结构的房间/走廊/空间”。"]}
{"word":"alcoves","summary":{"en":"Alcoves are small recessed spaces—usually indoors in a wall or room, sometimes outdoors in rock or hillsides.","zh":"alcove 指凹进去的小空间，常见于室内的壁龛/凹室，也可指户外岩壁或山坡的隐蔽凹处。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small recessed area or nook in a room or wall, often used for seating, a bed, or a display.","zh":"（房间或墙壁里）凹进去的小空间／壁龛／小角落，常用来放座位、床或摆设。"},"examples":[{"en":"They put a reading chair and a lamp in the alcove by the window.","zh":"他们在窗边的壁龛里放了一把阅读椅和一盏灯。"},{"en":"The bed was tucked into an alcove to save space.","zh":"床被塞进了一个凹进去的小角落里，以节省空间。"}]},{"partOfSpeech":"n.","definition":{"en":"A small sheltered or recessed place outdoors, especially in a rock face or hillside.","zh":"（户外）隐蔽的小凹处，尤指岩壁或山坡上的凹进去之处。"},"examples":[{"en":"We rested in a shady alcove along the trail.","zh":"我们在小路旁一处阴凉的凹处休息。"},{"en":"Birds nested in alcoves in the cliff.","zh":"鸟儿在悬崖的凹洞里筑巢。"}]}],"synonyms":["nook","recess","cubby","cranny"],"phonetic":"/ˈælkoʊv/","extraExplanation":["“alcove”常指建筑里的“壁龛/凹室”，带有一种“被墙面包围、比较私密的小空间”的感觉。中文里可根据场景译为“壁龛、凹室、小角落”。","词源来自阿拉伯语 al-qubba（意为“圆顶/拱顶”），后来经西班牙语、法语进入英语，因此在描述拱形、凹入式空间时很常见。"]}
{"word":"alcovinometer","summary":{"en":"An alcovinometer is a hydrometer-like tool used to estimate the alcohol content of wine or other alcoholic liquids.","zh":"alcovinometer 指一种类似比重计的工具，用于估算葡萄酒或其他酒精饮料液体的酒精含量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a measuring instrument (a type of hydrometer) used to estimate the alcohol content of wine or other alcoholic liquids, usually by measuring density/specific gravity","zh":"酒精计（醇酒计）：一种测量仪器（属比重计/浮计的一种），通常通过测量液体密度/比重来估算葡萄酒或其他酒类液体的酒精含量"},"examples":[{"en":"The winemaker checked the batch with an alcovinometer before bottling.","zh":"酿酒师在装瓶前用酒精计检测了这一批酒。"},{"en":"Temperature can affect an alcovinometer reading, so the sample is often measured under standard conditions.","zh":"温度会影响酒精计读数，所以样品常在标准条件下测量。"}]}],"synonyms":["alcoholometer","hydrometer","proof meter"],"phonetic":"/ˌælkoʊˈvaɪnɑmɪtɚ/","extraExplanation":["“alcovinometer”由 alco-（酒精）+ vino（拉丁语“葡萄酒”）+ -meter（测量器）构成。它常见于酿酒、蒸馏与实验室语境，属于较专业、较少见的词。","它与“breathalyzer（酒精呼气测试仪）”不同：alcovinometer 主要测液体（酒、烈酒等），而 breathalyzer 主要测呼气中的酒精以推算血液酒精浓度。"]}
{"word":"Alcuin","summary":{"en":"Alcuin: a major medieval scholar from York who advised Charlemagne and helped revive learning in the Carolingian Empire.","zh":"Alcuin：来自约克的重要中世纪学者，曾辅佐查理曼大帝并推动加洛林帝国的学术与教育复兴。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medieval English scholar and churchman (c. 735–804), also called Alcuin of York, who became a leading adviser to Charlemagne and helped promote learning and education in the Carolingian Empire.","zh":"中世纪英格兰学者与教士（约735–804），又称“约克的阿尔昆”，曾任查理曼大帝的重要顾问，并在加洛林帝国推动教育与学术复兴。"},"examples":[{"en":"Alcuin of York worked at Charlemagne’s court and encouraged the study of grammar, theology, and classical texts.","zh":"约克的阿尔昆在查理曼大帝的宫廷工作，鼓励学习语法、神学与古典文献。"},{"en":"In many histories, Alcuin is described as a key figure in the Carolingian Renaissance.","zh":"在许多历史著作中，阿尔昆被描述为“加洛林文艺复兴”的关键人物。"}]}],"synonyms":["Alcuin of York"],"phonetic":"/ælˈkwɪn/","extraExplanation":["读音提示：Alcuin 常见英语读法重音在第二音节（al-KWIN）。","文化背景：阿尔昆常被视为推动“宫廷学校”与文本校勘的重要人物，对拉丁教育体系、手抄本整理与学术交流影响很大。","用法提醒：作为专有名词，通常大写；在学术语境中常写作 Alcuin of York（约克的阿尔昆）以避免与其他同名人物混淆。"]}
{"word":"Alcuinian","summary":{"en":"Alcuinian means connected with Alcuin of York and the scholarly and educational influence associated with him in Charlemagne’s time.","zh":"Alcuinian 指与约克的阿尔昆及其在查理曼时代所代表的学术与教育影响相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Alcuin of York (c. 735–804) or to his ideas, writings, teaching, and influence at the court of Charlemagne.","zh":"与约克的阿尔昆（Alcuin，约735–804）有关的；指他的思想、著作、教学与其在查理曼宫廷中的影响。"},"examples":[{"en":"The manuscript shows Alcuinian influence in its clear handwriting and careful corrections.","zh":"这份手稿在清晰的书写和细致的校订上体现出阿尔昆式（Alcuinian）的影响。"},{"en":"Scholars discuss Alcuinian reforms in education during the Carolingian period.","zh":"学者们讨论加洛林时期教育中的阿尔昆式改革。"}]}],"synonyms":["Alcuin-related","Carolingian (in context)"],"phonetic":"/ælˈkjuːɪniən/","extraExplanation":["Alcuinian 这个词来自人名 Alcuin（阿尔昆）。阿尔昆是“加洛林文艺复兴”中的关键学者与教师，被查理曼邀请到宫廷学校任教，推动拉丁文学习、修辞与逻辑训练，并参与改进文本校勘与教育制度。","在学术语境里，Alcuinian 常用来形容与阿尔昆相关的“学风/传统”，比如教学方法、学术圈（宫廷学校）、或某些手稿与文本修订风格。"]}
{"word":"alcuinian","summary":{"en":"Alcuinian means “connected with Alcuin of York” and often refers to his influence on learning, education, and manuscript culture in Charlemagne’s time.","zh":"Alcuinian意为“与约克的阿尔昆有关的”，常用来指他在查理曼时代对学术、教育与手稿文化的影响。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Alcuin of York (c. 735–804), an English scholar and teacher at Charlemagne’s court, or to his style of learning and writing.","zh":"与约克的阿尔昆（Alcuin，约约735–804）有关的；或指与他所代表的学术、教育与写作风格相关的。"},"examples":[{"en":"The manuscript shows Alcuinian influence in its careful copying and clear organization.","zh":"这份手稿在谨慎抄写与清晰编排上显示出阿尔昆式（Alcuinian）的影响。"},{"en":"Some historians discuss Alcuinian reforms in education during the Carolingian period.","zh":"一些历史学家会讨论加洛林时期教育中的阿尔昆式（Alcuinian）改革。"}]}],"synonyms":["Alcuin’s","Carolingian (in context)"],"phonetic":"/ælˈkwɪniən/","extraExplanation":["“Alcuinian”来自人物名Alcuin（阿尔昆）+ 形容词后缀 -ian，表示“与某人有关的/具有某人特征的”。","阿尔昆是“加洛林文艺复兴”（Carolingian Renaissance）中最重要的学者之一，常被提及于中世纪教育改革、修道院学校与宫廷学术圈的背景。","在书籍史/古文字学里，有时会把与阿尔昆学术圈相关的书写与文本规范（如强调清晰、统一的抄写传统）称为“Alcuinian”的影响。"]}
{"word":"alcumy","summary":{"en":"Alchemy is an old tradition that tried to turn metals into gold; today it can also mean a mysterious transformation that creates something valuable.","zh":"Alchemy指古代的炼金术（试图点石成金等）；现代也常作比喻，指把普通事物神奇地转化为有价值之物的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Correct spelling: alchemy) An old form of science and philosophy that tried to change ordinary metals into gold and to discover a medicine for long life.","zh":"（正确拼写：alchemy）一种古老的科学与哲学体系，试图把普通金属变成黄金，并寻找延年益寿的“万能药”。"},"examples":[{"en":"In the Middle Ages, many people studied alchemy to try to turn lead into gold.","zh":"在中世纪，很多人研究炼金术，想把铅变成黄金。"},{"en":"The novel uses alchemy as a symbol of secret knowledge and transformation.","zh":"这部小说把炼金术当作“隐秘知识”和“转变”的象征。"}]},{"partOfSpeech":"n.","definition":{"en":"A magical or mysterious process that seems to transform something ordinary into something valuable or beautiful.","zh":"一种带有“魔法感”的转化过程，似乎能把普通事物变得珍贵或美好。"},"examples":[{"en":"Great cooking can feel like alchemy—simple ingredients become an amazing meal.","zh":"高水平的烹饪像炼金术一样——简单食材变成了惊艳的一餐。"},{"en":"Their teamwork was pure alchemy, turning a small idea into a successful project.","zh":"他们的合作简直是“炼金术”，把一个小点子变成了成功的项目。"}]}],"synonyms":["transformation","magic","mystery","chemistry (figurative)","wizardry (figurative)"],"phonetic":"/ˈæl.kə.mi/","extraExplanation":["“alcumy”通常是对“alchemy”的拼写错误。现代英语中更常见的拼写是alchemy。","词源来自阿拉伯语al-（“the”）+ kīmiyāʾ（与“化学/炼金”相关），后来进入欧洲语言；炼金术的思想也推动了早期化学的发展。","文学与流行文化中常把alchemy用作“心灵或人生转化”的隐喻；例如《哈利·波特》系列提到的“Philosopher’s Stone（贤者之石）”就源于炼金术传说。"]}
{"word":"Alcus","summary":{"en":"“Alcus” is usually a proper name rather than a regular English word; its meaning depends on context.","zh":"“Alcus”通常是专有名词而不是常规英语词；含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard modern English vocabulary word; most often seen as a proper name (e.g., a person, character, username, or place name). Meaning depends on the specific context where it appears.","zh":"不是现代英语里的常用词汇；最常见的用法是专有名词（如人名、角色名、用户名或地名）。具体含义取决于出现的语境。"},"examples":[{"en":"In the novel, Alcus is a minor character who helps the hero.","zh":"在小说里，Alcus 是一个帮助主角的小角色。"},{"en":"Alcus is the username I use for online games.","zh":"Alcus 是我玩网游时用的用户名。"}]}],"phonetic":"/ˈæl.kəs/","extraExplanation":["“Alcus”在常见英语词典中通常查不到，因此很可能是专名、拼写变体或打字错误。","如果你想查的是某个常见单词，可能是：\n- “Alcus”→“Alcove”（壁龛/凹室）\n- “Alcus”→“Algae”（藻类）\n- “Alcus”→“Alcus/Alcus”作为拉丁化名字（学名/人名）\n你可以告诉我它出现的句子或来源（书名、游戏、学术文本等），我可以更准确解释。"]}
{"word":"alcyon","summary":{"en":"Alcyon is a rare/literary form of “halcyon,” meaning a kingfisher or, less commonly, calm and peaceful.","zh":"Alcyon是“halcyon”的罕见/文学写法，可指翠鸟；较少见地也可形容平静安宁。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a kingfisher (a bird that often hunts fish by diving), especially in older or literary English.","zh":"翠鸟（常俯冲捕鱼的一种鸟），多用于较古老或文学语境。"},"examples":[{"en":"In the poem, an alcyon flashes blue above the river.","zh":"在诗里，一只翠鸟在河面上方闪着蓝光。"},{"en":"The old naturalist wrote of the alcyon nesting near quiet streams.","zh":"那位老博物学家写到翠鸟在安静的溪流旁筑巢。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) calm and peaceful; like the “halcyon days.”","zh":"（罕见）平静安宁的；如“太平盛世/风平浪静的日子”。"},"examples":[{"en":"They remembered an alcyon summer before everything changed.","zh":"他们记得在一切改变之前那个宁静的夏天。"},{"en":"The lake looked alcyon at dawn, without a single ripple.","zh":"黎明时湖面宁静无波。"}]}],"synonyms":["halcyon","kingfisher","peaceful","tranquil"],"phonetic":"/ˈæl.si.ən/","extraExplanation":["“Alcyon”是“halcyon”的较少见拼写变体。它与希腊神话中Alcyone（阿尔库俄涅）有关：传说诸神在冬季为她的翠鸟筑巢期赐予海上风平浪静的日子，因此有“halcyon days（风平浪静的日子/太平盛世）”这一常见表达。","在现代英语里，表示“宁静、太平”的形容词用法更常见的是“halcyon”，而“alcyon”多见于诗歌、古文或专门语境。"]}
{"word":"Alcyonacea","summary":{"en":"Alcyonacea is the scientific name for an order of soft corals (octocorals).","zh":"Alcyonacea 是软珊瑚（八放珊瑚）的一项科学分类名称（一个“目”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific group (an order) of marine animals known as soft corals, including many sea fans and leather corals (octocorals).","zh":"（生物分类）海洋无脊椎动物的一类（一个“目”），通常指软珊瑚类群，包括许多海扇与皮革珊瑚等（八放珊瑚）。"},"examples":[{"en":"Researchers surveyed Alcyonacea populations on the reef after the storm.","zh":"研究人员在风暴后调查了珊瑚礁上的软珊瑚（Alcyonacea）种群。"},{"en":"Some Alcyonacea species form flexible, tree-like colonies that sway with the current.","zh":"一些软珊瑚（Alcyonacea）会形成柔韧的树状群体，随海流摆动。"}]}],"synonyms":["soft corals","octocorals"],"phonetic":"/ælˌsaɪəˈneɪʃiə/","extraExplanation":["“Alcyonacea”是拉丁化的科学名称，常见于学术论文、海洋生物学教材与物种名录中；日常英语里更常说“soft corals（软珊瑚）”或“octocorals（八放珊瑚）”。","词源上与属名“Alcyonium”相关；在现代分类中，不同资料对其范围与层级可能有更新或调整，因此阅读文献时可留意作者采用的分类体系。"]}
{"word":"alcyonacea","summary":{"en":"Alcyonacea is the scientific name for an order of soft corals (like sea fans and sea pens).","zh":"Alcyonacea 是“八放珊瑚目”的学名，指一类软珊瑚（如海扇、海笔等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific order of soft corals (including sea fans and sea pens) that lack a hard stony skeleton and often form flexible, branching colonies.","zh":"（生物）八放珊瑚目的一个类群（如海扇、海笔等），属于软珊瑚；通常没有坚硬的石质骨骼，常形成柔韧的分枝群体。"},"examples":[{"en":"Many Alcyonacea live on coral reefs and sway with the current.","zh":"许多八放珊瑚目动物生活在珊瑚礁上，会随着水流摆动。"},{"en":"The diver photographed an Alcyonacea colony that looked like a colorful fan.","zh":"潜水员拍到一丛八放珊瑚目的群体，看起来像一把彩色的扇子。"}]}],"synonyms":["soft corals","octocorals"],"phonetic":"/ˌæl.si.əˈneɪ.ʃi.ə/","extraExplanation":["“Alcyonacea”是分类学名称（常见于科研、博物馆说明牌、纪录片字幕），日常英语里更常说 soft corals（软珊瑚）、sea fans（海扇）或 sea pens（海笔）。","词源上与拉丁化学名有关，来源可追溯到属名 Alcyonium；拼写中 -acea 常见于生物分类的“目/科”等拉丁化后缀。"]}
{"word":"alcyonacean","summary":{"en":"An alcyonacean is a soft coral (octocoral) in the order Alcyonacea, or an adjective meaning ‘related to these soft corals.’","zh":"alcyonacean 指海鸡冠珊瑚目（Alcyonacea）的软珊瑚，也可作形容词表示“与该类软珊瑚有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a soft coral (an octocoral) belonging to the order Alcyonacea, often forming flexible, fleshy colonies in the sea","zh":"（动物）海鸡冠珊瑚目（Alcyonacea）的软珊瑚（八放珊瑚之一）；常形成柔软、肉质的群体"},"examples":[{"en":"Divers photographed an alcyonacean colony swaying with the current.","zh":"潜水员拍到了一个随海流摆动的软珊瑚目群体。"},{"en":"Many alcyonaceans live on reefs but do not build hard coral skeletons.","zh":"许多软珊瑚目动物生活在珊瑚礁上，但不会建造硬珊瑚那样的骨骼结构。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the soft corals of the order Alcyonacea","zh":"（形容词）与海鸡冠珊瑚目（软珊瑚）有关的"},"examples":[{"en":"The paper compares alcyonacean species from different oceans.","zh":"这篇论文比较了来自不同海洋的软珊瑚目物种。"}]}],"synonyms":["soft coral","octocoral"],"phonetic":"/ælˌsaɪəˈneɪʃən/","extraExplanation":["“Alcyonacean”是生物分类学用语，常见于海洋生物学与生态学文章中；日常英语里更常说 soft coral（软珊瑚）或 octocoral（八放珊瑚）。","词源上与拉丁化的属名/目名 Alcyon- 有关（如 Alcyonium 属），而 Alcyon- 又与希腊语相关；在英文里也常让人联想到 halcyon（宁静的）这一词根背景，但在此处它主要是分类命名。"]}
{"word":"Alcyonaria","summary":{"en":"Alcyonaria is an older scientific term for soft corals and their relatives, now usually called Octocorallia.","zh":"Alcyonaria 是软珊瑚及其近缘类群的旧称，现代多称为 Octocorallia（八放珊瑚亚纲）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former scientific name for a large group of soft corals and related animals (including sea fans and sea pens); now usually classified as Octocorallia","zh":"（旧）软珊瑚及其近缘类群的科学名称（包括海扇、海笔等）；现代分类中通常归入“八放珊瑚亚纲（Octocorallia）”"},"examples":[{"en":"Many sea fans were once placed in Alcyonaria in older biology books.","zh":"在较老的生物学书籍里，许多海扇曾被归入 Alcyonaria。"},{"en":"Alcyonaria refers to soft-bodied corals rather than reef-building stony corals.","zh":"Alcyonaria 指的是软体珊瑚，而不是造礁的石珊瑚。"}]}],"synonyms":["Octocorallia","soft corals"],"phonetic":"/ˌæl.si.əˈnɛr.i.ə/","extraExplanation":["这是一个“较旧的分类名”。现在常用的名称是 Octocorallia（八放珊瑚亚纲），因为这一类群的珊瑚虫通常有 8 条触手，且内部常见 8 个隔膜等“八放”特征。","词源上与希腊神话中的 Alcyone（阿尔库俄涅）有关，早期一些分类学命名常借用神话人物或意象。"]}
{"word":"alcyonaria","summary":{"en":"Alcyonaria is an older scientific name for a group of soft corals and related animals (now often called Octocorallia).","zh":"Alcyonaria 是一个较旧的科学分类名，指一类软珊瑚及其近缘动物（现代多称为八放珊瑚类 Octocorallia）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific term for a group of soft corals and related animals (an older name roughly corresponding to the modern group Octocorallia), such as sea fans and sea pens","zh":"（生物学术语）指一类软珊瑚及其近缘动物的分类群（旧称，大致相当于现代分类的“八放珊瑚类”Octocorallia），如海扇与海笔等"},"examples":[{"en":"In older marine biology books, Alcyonaria is used for many soft corals.","zh":"在较早的海洋生物学书籍中，Alcyonaria 常用来指许多软珊瑚。"},{"en":"Some Alcyonaria form branching sea fans that provide shelter for small fish.","zh":"一些 Alcyonaria 会形成分枝状的海扇，为小鱼提供栖身之处。"}]}],"synonyms":["Octocorallia","soft corals"],"phonetic":"/ˌæl.si.əˈnɛr.i.ə/","extraExplanation":["Alcyonaria 是较旧的分类名称；在现代分类中，相关动物通常归入 Octocorallia（八放珊瑚类），其共同特征常包括“八个触手/八个隔膜”的结构。","词源与希腊神话有关：Alcyone（阿尔库俄涅）常与“翠鸟（halcyon）”的传说联系；因此该词带有一定“神话命名”的传统色彩，但在科学语境中主要是分类学用语。"]}
{"word":"alcyonarian","summary":{"en":"Alcyonarian means a soft coral (or related to soft corals) in the group Alcyonacea.","zh":"alcyonarian 指软珊瑚（名词），或“与软珊瑚目软珊瑚有关的”（形容词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a soft coral (often a “leather coral” or related form) belonging to the group Alcyonacea (also called octocorals).","zh":"一种软珊瑚（常见如“皮革珊瑚”等），属于软珊瑚目（Alcyonacea，也常归入八放珊瑚类）。"},"examples":[{"en":"The aquarium features an alcyonarian that sways gently with the current.","zh":"水族箱里有一株软珊瑚，随着水流轻轻摇摆。"},{"en":"Researchers recorded how an alcyonarian colony responded to warmer water.","zh":"研究人员记录了软珊瑚群体对升温海水的反应。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to soft corals of the group Alcyonacea.","zh":"与软珊瑚目（Alcyonacea）软珊瑚有关的；软珊瑚的。"},"examples":[{"en":"Alcyonarian corals often rely on symbiotic algae for energy.","zh":"软珊瑚常依赖共生藻类获取能量。"},{"en":"The diver photographed alcyonarian species along the reef wall.","zh":"潜水员在礁壁旁拍到了多种软珊瑚。"}]}],"synonyms":["soft coral","octocoral (broader)","Alcyonacea (scientific group name)"],"phonetic":"/ˌæl.si.əˈnɛr.i.ən/","extraExplanation":["词源上与“halcyon（宁静的、风平浪静的）”同源，来自希腊语中的“Alcyone/Alkyone”（神话人物名），后来用于生物学命名。","在科普或水族语境中，alcyonarian 常与 gorgonian（海扇/柳珊瑚）一起出现：两者都属“八放珊瑚”大类，但外形与生态位可能不同。"]}
{"word":"Alcyone","summary":{"en":"Alcyone is a proper name referring either to a figure in Greek mythology (linked to “halcyon days”) or to the brightest star in the Pleiades.","zh":"Alcyone 是专有名词，可指希腊神话人物（与“halcyon days/风平浪静的日子”相关），也可指昴星团中最亮的恒星。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Alcyone: In Greek mythology, a woman (one of the Pleiades) whose story is linked to the idea of calm “halcyon days.” Examples: (1) “In the myth, Alcyone mourned her husband.” (神话中，阿尔西俄涅为丈夫哀悼。) (2) “The poet compared her grief to a stormy sea.” (诗人把她的悲伤比作暴风雨中的大海。)","zh":"Alcyone（阿尔西俄涅）：希腊神话人物之一（昴宿七姊妹之一），其故事与“halcyon days（风平浪静的日子）”这一说法有关。例：(1) “In the myth, Alcyone mourned her husband.”（神话中，阿尔西俄涅为丈夫哀悼。）(2) “The poet compared her grief to a stormy sea.”（诗人把她的悲伤比作暴风雨中的大海。）"},"examples":[{"en":"In Greek myth, Alcyone is often remembered for her tragic love story.","zh":"在希腊神话中，Alcyone 常因其悲剧性的爱情故事而被人记住。"},{"en":"Some writers use “Alcyone” as a symbol of sorrow turning into calm.","zh":"一些作家会用“Alcyone”来象征“悲伤转为平静”。"}]},{"partOfSpeech":"n.","definition":{"en":"Alcyone: The brightest star in the Pleiades star cluster (in the constellation Taurus). Examples: (1) “Alcyone is a key star in the Pleiades.” (Alcyone 是昴星团中的重要恒星。) (2) “On a clear night, you can spot Alcyone near Taurus.” (晴朗的夜晚，你能在金牛座附近看到 Alcyone。)","zh":"Alcyone：昴星团（Pleiades，位于金牛座）中最亮的恒星。例：(1) “Alcyone is a key star in the Pleiades.”（Alcyone 是昴星团中的重要恒星。）(2) “On a clear night, you can spot Alcyone near Taurus.”（晴朗的夜晚，你能在金牛座附近看到 Alcyone。）"},"examples":[{"en":"Astronomy guides often label Alcyone as the brightest member of the Pleiades.","zh":"天文指南常把 Alcyone 标注为昴星团中最亮的一颗。"}]}],"synonyms":["Halcyone"],"phonetic":"/ælˈsaɪ.ə.ni/","extraExplanation":["“halcyon days（太平/风平浪静的日子）”这个表达常被认为与 Alcyone 的神话有关：传说众神怜悯她的悲痛，让她与丈夫化为翠鸟（halcyon），并在其筑巢孵卵时赐予海面短暂的平静，因此 halcyon 后来引申为“安宁、繁荣的时期”。","在英语里，Alcyone 通常作为专有名词出现：神话语境多见于文学、艺术评论；天文学语境多见于科普或观星指南。拼写有时会见到变体 “Halcyone”。"]}
{"word":"alcyone","summary":{"en":"Alcyone is a name from Greek mythology (linked to “halcyon days”) and also the name of the brightest star in the Pleiades (Eta Tauri).","zh":"Alcyone 既指希腊神话人物（与“halcyon days 太平宁静的日子”相关），也指昴宿星团中最亮的星（Eta Tauri）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, a daughter of Aeolus who became (with her husband Ceyx) a kingfisher; her story is linked to the phrase “halcyon days.”","zh":"（希腊神话）阿尔库俄涅：风神埃俄罗斯之女，相传与丈夫刻宇克斯死后化为翠鸟；其故事与“halcyon days（太平宁静的日子）”这一说法有关。"},"examples":[{"en":"The poem mentions Alcyone to suggest a time of calm after grief.","zh":"这首诗提到阿尔库俄涅，用来暗示悲伤之后的宁静时刻。"},{"en":"In mythology, Alcyone and Ceyx are turned into birds by the gods.","zh":"在神话中，诸神将阿尔库俄涅与刻宇克斯变成了鸟。"}]},{"partOfSpeech":"n.","definition":{"en":"A star name: Alcyone, the brightest star in the Pleiades star cluster (Eta Tauri).","zh":"（天文学）昴宿星团中最亮的一颗星：Alcyone（即金牛座η，常译“昴宿六”）。"},"examples":[{"en":"On a clear winter night, Alcyone shines near the other stars of the Pleiades.","zh":"在晴朗的冬夜，Alcyone 与昴宿星团的其他星一起闪耀。"},{"en":"The telescope view made Alcyone stand out as the brightest point in the cluster.","zh":"透过望远镜，Alcyone 作为星团中最亮的点格外显眼。"}]}],"synonyms":["(myth) Halcyone","(astronomy) Eta Tauri"],"phonetic":"ælˈsaɪəni","extraExplanation":["“Alcyone”与英语单词/短语“halcyon”“halcyon days”同源：来自希腊语中与“翠鸟（kingfisher）”相关的说法。传说阿尔库俄涅在冬季为孵卵而让海面平静数日，因此“halcyon days”引申为“风平浪静、安稳幸福的时期”。","文学中提到 Alcyone 往往带有象征意味：从“海的平静”延伸到“短暂的安宁、怀旧的幸福时光”，也可能暗示“悲剧之后的平静”。"]}
{"word":"Alcyones","summary":{"en":"“Alcyones” is the plural of Alcyone, used mainly for the Pleiades sisters in Greek myth and sometimes for the star Alcyone/related stars in the Pleiades cluster.","zh":"“Alcyones”是 Alcyone 的复数，主要指希腊神话中的昴宿七姊妹，也可指昴宿星团中名为 Alcyone 的恒星（或相关星体）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) the plural of Alcyone: usually referring to Alcyone and her sisters, the Pleiades (seven nymphs/daughters of Atlas), later placed among the stars as the Pleiades cluster.","zh":"（希腊神话）Alcyone 的复数：常指 Alcyone 及其姐妹——昴宿七姊妹（阿特拉斯之女的宁芙们），后来被化为星座中的昴宿星团。"},"examples":[{"en":"In Greek myth, the Alcyones (the Pleiades) were turned into stars.","zh":"在希腊神话中，Alcyones（昴宿七姊妹）被化作星辰。"},{"en":"The poem mentions the Alcyones as shining sisters in the night sky.","zh":"这首诗把 Alcyones 写成夜空中闪耀的姐妹。"}]},{"partOfSpeech":"n.","definition":{"en":"Astronomy: the plural of Alcyone, the brightest star in the Pleiades star cluster (in the constellation Taurus).","zh":"（天文学）Alcyone 的复数：指昴宿星团中最亮的那颗星（位于金牛座方向）。"},"examples":[{"en":"The guide pointed out Alcyone in the Pleiades, sometimes loosely grouped with the “Alcyones.”","zh":"讲解员指出了昴宿星团中的 Alcyone，有时也会把相关星体笼统称作 “Alcyones”。"}]}],"synonyms":["Pleiades","the Seven Sisters"],"phonetic":"/ælˈsaɪ.əˌniːz/","extraExplanation":["“Alcyone（阿尔西俄涅）”在西方文化里常与“halcyon days（太平盛世/风平浪静的好日子）”的意象相连：源自 Alcyone 与丈夫 Ceyx 的神话故事，后来引申为宁静、祥和的时期。","在文学中，提到昴宿七姊妹（Pleiades）往往用来营造“群星、季节更迭、远航与乡愁”等氛围；“Alcyones”作为复数用法较少见，更多时候作者会直接写 Pleiades。"]}
{"word":"alcyones","summary":{"en":"Alcyones is the plural of Alcyone, used in Greek-myth and literary contexts—either for mythic figures (especially a Pleiad) or, poetically, for kingfishers linked to “halcyon days.”","zh":"Alcyones 是 Alcyone 的复数，多见于希腊神话与文学语境：可指神话人物（尤指昴宿七姐妹之一），也可诗意地指与“halcyon days（太平日子）”相关的翠鸟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) plural of Alcyone: figures named Alcyone, especially Alcyone, one of the Pleiades (the “Seven Sisters”) in the night sky.","zh":"（希腊神话）Alcyone 的复数：名为 Alcyone 的人物，尤指昴宿七姐妹（Pleiades，“七姊妹星团”）之一的阿耳库俄涅。"},"examples":[{"en":"In Greek myths, the alcyones are linked with stories about the sea and the stars.","zh":"在希腊神话中，alcyones 常与海洋与星辰的故事联系在一起。"},{"en":"The constellation story names Alcyone as one of the Pleiades; “alcyones” refers to such figures in the plural.","zh":"星座传说中，Alcyone 是昴宿七姐妹之一；“alcyones”用来表示这些人物的复数。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literary/poetic) kingfishers; birds traditionally associated with calm seas (related to “halcyon days”).","zh":"（文学/诗意用法）翠鸟；传统上与“风平浪静的日子”相关联的鸟（与 halcyon days 一脉相承）。"},"examples":[{"en":"The poet compared the quiet harbor to a place where alcyones might nest.","zh":"诗人把宁静的港湾比作 alcyones 可能筑巢的地方。"},{"en":"She longed for alcyones and halcyon days—peace after a hard winter.","zh":"她渴望 alcyones 与“halcyon days”——在艰难的冬天之后迎来安宁。"}]}],"synonyms":["Pleiads","kingfishers (poetic)","halcyon birds (literary)"],"phonetic":"/ælˈsaɪ.əˌni/","extraExplanation":["“Alcyone/Alcyones”来自希腊语词源，常与“halcyon（宁静的、太平的）”同源联想：古传说里翠鸟在冬至前后孵卵时海面会短暂平静，因此有“halcyon days（太平日子）”这一固定说法。","在天文学语境里，Alcyone（阿耳库俄涅）也是昴宿星团中最亮的成员之一；文学作品中有时用古典神话名字来增添典雅、古风的意象。"]}
{"word":"Alcyoneus","summary":{"en":"Alcyoneus is a named giant in Greek mythology, known for fighting the gods in the Gigantomachy.","zh":"Alcyoneus（阿尔库俄纽斯）是希腊神话中的巨人族名号人物，以参与“巨人之战”并与众神为敌而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, a giant (one of the Gigantes) who fought the gods; he was said to be especially powerful in his homeland and is often linked with the hero Heracles.","zh":"（希腊神话）阿尔库俄纽斯：巨人族（Gigantes）之一，曾与众神交战；据说他在自己的故土力量格外强大，常与英雄赫拉克勒斯的战斗传说相关。"},"examples":[{"en":"In some myths, Heracles defeats Alcyoneus during the war between the gods and the giants.","zh":"在一些神话版本中，赫拉克勒斯在众神与巨人之战中击败了阿尔库俄纽斯。"},{"en":"The name Alcyoneus appears in stories about the Gigantomachy, the great battle of Olympus.","zh":"“阿尔库俄纽斯”这个名字常出现在关于“巨人之战”（Gigantomachy）的故事里。"}]}],"synonyms":["Gigantes","giant"],"phonetic":"/ælˌsaɪəˈniːəs/","extraExplanation":["“Alcyoneus”是神话专名（专有名词），不同古典作者对他的细节描写可能不完全一致，但他通常被描述为巨人族中很强的一位。","常见叙述里，他的“强大”与地理范围有关：在自己的土地上更难被杀死，因此神话中会出现把他拖离故土再击败的情节（不同版本表述略有差异）。","他多见于古希腊关于“Gigantomachy（巨人之战）”的传统中，这一主题在古典艺术与文学中很常见，用来象征秩序（众神）战胜混乱（巨人）。"]}
{"word":"Alcyoniaceae","summary":{"en":"Alcyoniaceae is the scientific name for a family of soft corals.","zh":"Alcyoniaceae 是“软珊瑚的一科”的科学名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of soft corals (octocorals), including many leathery or fleshy “soft coral” species often found in warm oceans.","zh":"软珊瑚的一科（八放珊瑚类群），包含许多质地柔软、皮革状或肉质的“软珊瑚”物种，常见于温暖海域。"},"examples":[{"en":"Some reef tanks feature soft corals from the family Alcyoniaceae because they are relatively hardy.","zh":"一些海水缸会饲养软珊瑚科（Alcyoniaceae）的软珊瑚，因为它们相对耐养。"},{"en":"Researchers compared chemical defenses in several Alcyoniaceae species.","zh":"研究人员比较了多种软珊瑚科物种的化学防御机制。"}]}],"synonyms":["soft-coral family"],"phonetic":"/ælˌsaɪ.oʊˈneɪ.ə.si.iː/","extraExplanation":["“Alcyoniaceae”是生物分类学名称，属于刺胞动物门、珊瑚纲中的八放珊瑚（Octocorallia）相关类群；日常英语里更常说“soft corals（软珊瑚）”。","词根来自属名“Alcyonium（海鸡冠珊瑚属）”，该属名又与希腊语中指“翠鸟（kingfisher）/与翠鸟相关的神话（halcyon days）”的词源有关，但在这里主要是拉丁化的分类命名传统。"]}
{"word":"alcyoniaceae","summary":{"en":"Alcyoniaceae is a scientific name for a family of soft corals (often “leather corals”).","zh":"Alcyoniaceae 是软珊瑚的一科的学名（常见俗称包括“皮革珊瑚”等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of soft corals (octocorals) that includes many leathery or fleshy species, often called “leather corals,” found mainly in warm seas.","zh":"软珊瑚的一科（八放珊瑚类群），包含许多“皮革珊瑚”等种类，常见于温暖海域，体表多呈皮革状或肉质。"},"examples":[{"en":"Some reef aquariums keep Alcyoniaceae corals because they are hardy and grow quickly.","zh":"一些珊瑚礁水族箱会饲养Alcyoniaceae（软珊瑚科）珊瑚，因为它们比较耐养、长得也快。"},{"en":"Researchers surveyed Alcyoniaceae on the reef to track changes in coral community structure.","zh":"研究人员在珊瑚礁上调查Alcyoniaceae（软珊瑚科）物种，用来追踪珊瑚群落结构的变化。"}]}],"synonyms":["soft-coral family (general)","leather coral family (informal, general)"],"phonetic":"/ˌæl.si.oʊ.naɪˈeɪ.si.iː/","extraExplanation":["这是一个生物分类学名（科名），通常在学术文章、物种名录和生态调查中出现；日常英语里很少使用。","词源上与拉丁化的属名/词干“Alcyonium”相关，常见的英文俗称更常用，如 leather coral（皮革珊瑚）、soft coral（软珊瑚）。","在写作中，作为科名通常首字母大写（Alcyoniaceae），并按拉丁学名规则使用斜体的情况取决于期刊/格式要求。"]}
{"word":"alcyonic","summary":{"en":"Alcyonic means calm and peaceful, and it can also refer to Alcyone/kingfisher imagery in literary contexts.","zh":"alcyonic 意为“平静安宁的”，也可指与希腊神话中的 Alcyone 或翠鸟相关的文学意象。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Calm, peaceful, and untroubled; like a quiet period of time.","zh":"平静的；安宁的；无忧无虑的（常指一段宁静的时期）。"},"examples":[{"en":"The lake looked alcyonic in the early morning light.","zh":"清晨的光线下，湖面显得格外平静。"},{"en":"She remembered an alcyonic summer when everything felt possible.","zh":"她记得那个宁静美好的夏天，那时一切都充满可能。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to Alcyone (in Greek myth) or the kingfisher (a bird linked to the idea of calm seas).","zh":"与希腊神话中的阿尔库俄涅（Alcyone）或“翠鸟”（kingfisher，常与“风平浪静”的意象相关）有关的。"},"examples":[{"en":"The poem uses alcyonic imagery to suggest a still sea and a gentle mood.","zh":"这首诗用“翠鸟/阿尔库俄涅”的意象来暗示海面宁静、氛围柔和。"}]}],"synonyms":["halcyon","peaceful","tranquil","serene","placid"],"phonetic":"/ælˈsaɪ.ə.nɪk/","extraExplanation":["“alcyonic”与更常见的“halcyon”意义非常接近；在现代英语里，多数场合用“halcyon”更自然。“alcyonic”更偏文学或典故用法。","“Halcyon days（太平日子/黄金岁月）”来自希腊神话：Alcyone与丈夫的故事后来与“冬季风平浪静的日子”联系在一起（也常与翠鸟的繁殖期传说相连），因此延伸出“宁静、幸福的时光”的含义。"]}
{"word":"alcyoniform","summary":{"en":"“Alcyoniform” means “related to kingfisher-type birds (the order *Alcyoniformes*), or having their characteristics.”","zh":"“alcyoniform”指“与翠鸟类（佛法僧目 *Alcyoniformes*）有关，或具有其特征的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the bird order *Alcyoniformes* (traditionally including kingfishers and related birds), or having features typical of these birds.","zh":"与*佛法僧目*（传统上包括翠鸟及其近缘鸟类）有关的；或具有这类鸟典型特征的。"},"examples":[{"en":"The museum displayed an alcyoniform specimen with a long bill and bright plumage.","zh":"博物馆展出了一件佛法僧目（翠鸟类）标本，喙很长、羽色鲜艳。"},{"en":"In older field guides, some species were grouped as alcyoniform birds.","zh":"在较早的野外鸟类图鉴里，有些物种被归为佛法僧目（alcyoniform）鸟类。"}]}],"synonyms":["kingfisher-related","Alcyoniformes-related","alcyonine (less common)"],"phonetic":"/ælˈsaɪ.ə.nəˌfɔrm/","extraExplanation":["词源上，*alcyon-* 来自拉丁语/希腊语中与“翠鸟（kingfisher）”相关的词根（常与神话中的 Alcyone 相关联）；后缀 *-form* 表示“……形的/……类的”。","现代鸟类分类学会随研究更新而调整类群范围；因此你可能在“旧分类”与“新分类”资料里看到该词所指范围略有不同。"]}
{"word":"Alcyonium","summary":{"en":"Alcyonium is a genus of soft corals, often called “dead man’s fingers.”","zh":"Alcyonium 是一种软珊瑚属，常被俗称为“死人手指”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of soft corals (often called “dead man’s fingers”) that forms finger-like, rubbery colonies and lives attached to rocks in cold or temperate seas.","zh":"一种软珊瑚属（常被称为“死人手指”），群体常呈手指状、质地柔软有弹性，附着在岩石上生活于温带或寒带海域。"},"examples":[{"en":"Divers spotted Alcyonium growing on the shaded side of the reef.","zh":"潜水员在礁石背阴处发现了Alcyonium（软珊瑚）群落。"},{"en":"The rock was covered with orange Alcyonium colonies.","zh":"那块岩石上覆盖着一片橙色的Alcyonium群体。"}]}],"synonyms":["dead man's fingers (common name)","soft coral (general term)"],"phonetic":"/ˌæl.siˈoʊ.ni.əm/","extraExplanation":["“Alcyonium”是拉丁化的学名，通常在科学写作中首字母大写并用斜体（Alcyonium）。在非正式英语里，人们更常用俗名“dead man’s fingers”来指其中一些外形像手指的种类。","它不是“硬珊瑚”（会形成坚硬骨骼的造礁珊瑚），而是“软珊瑚”，多依靠体内的小骨针（spicules）提供支撑，因此触感更柔软。"]}
{"word":"alcyonium","summary":{"en":"Alcyonium is a genus of soft corals, often known as “dead man’s fingers.”","zh":"Alcyonium 是一种软珊瑚属，常被称为“死人手指”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of soft corals that form finger-like, fleshy colonies; often called “dead man’s fingers,” common in cold and temperate seas (especially the North Atlantic).","zh":"一种软珊瑚属，群体常呈手指状、肉质突起；常被称为“死人手指”，多见于寒冷或温带海域（尤以北大西洋常见）。"},"examples":[{"en":"Divers saw a cluster of Alcyonium growing on the rocky seabed.","zh":"潜水员看见岩石海底上长着一簇阿尔基奥尼乌姆属（Alcyonium）的软珊瑚。"},{"en":"The pier pilings were coated with “dead man’s fingers” (Alcyonium) and seaweed.","zh":"码头的桩柱上附着着“死人手指”（Alcyonium）和海藻。"}]}],"synonyms":["dead man’s fingers","soft coral"],"phonetic":"/ˌæl.siˈoʊ.ni.əm/","extraExplanation":["在海洋生物学里，Alcyonium 常被当作一个拉丁学名使用，因此在英文文章中多以大写字母出现并用斜体排版（如 *Alcyonium digitatum*）。","词源上与希腊语 *alkyón*（常指“翠鸟/神话中的海鸟”）有关；在英语文化中它也让人联想到 “halcyon days（风平浪静的好日子）” 这一表达，但 Alcyonium 本身主要是生物分类名称。"]}
{"word":"alcyonoid","summary":{"en":"Alcyonoid means “related to soft corals (octocorals),” and can also refer to a soft coral itself in scientific contexts.","zh":"alcyonoid 指“与软珊瑚（八放珊瑚）有关的”，在学术语境中也可作名词指某个软珊瑚个体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a coral or similar marine animal) relating to soft corals (octocorals), especially those in the group Alcyonaria/Alcyonacea.","zh":"（珊瑚等海洋动物）与软珊瑚（八放珊瑚）有关的，尤指海鸡冠珊瑚类（Alcyonaria/Alcyonacea）。"},"examples":[{"en":"Alcyonoid corals often form flexible, leathery colonies rather than hard reefs.","zh":"软珊瑚类（alcyonoid）常形成柔软、似皮革的群体，而不是坚硬的礁体。"},{"en":"The diver photographed an alcyonoid colony swaying with the current.","zh":"潜水员拍到一簇 alcyonoid 珊瑚随水流摇摆。"}]},{"partOfSpeech":"n.","definition":{"en":"A soft coral (an octocoral), especially one belonging to the alcyonarian group.","zh":"软珊瑚；（尤指）海鸡冠珊瑚类的八放珊瑚个体。"},"examples":[{"en":"The aquarium includes sponges, sea fans, and a few alcyonoids.","zh":"这个水族箱里有海绵、海扇，还有几种软珊瑚（alcyonoids）。"}]}],"synonyms":["alcyonarian","soft-coral","octocoral"],"phonetic":"/ælˈsaɪəˌnɔɪd/","extraExplanation":["这个词比较学术，常见于海洋生物学与分类学语境中；日常英语里更常说 soft coral（软珊瑚）或 octocoral（八放珊瑚）。","词形上，-oid 表示“……状/类似……的”。Alcyon- 源于拉丁化的希腊词根，常与“alkyōn（翠鸟/海燕）”及神话意象有关，因此相关词在文学里偶尔带有“宁静、风平浪静（halcyon）”的联想，但在生物学里主要是分类用法。"]}
