{"word":"Ald","summary":{"en":"“Ald” is mainly a Scots dialect form meaning “old,” while “ALD” is more commonly an abbreviation (e.g., atomic layer deposition or a medical term).","zh":"“Ald”多为苏格兰方言形式，意为“old（老的/旧的）”；而“ALD”更常见作缩写（如原子层沉积或医学术语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Scots/older English) “old”; used mainly in dialect or in older literary-style writing.","zh":"（苏格兰英语/较旧用法）“老的；旧的”，多见于方言或较旧的文学风格。"},"examples":[{"en":"In some Scots songs, you may see “the ald town” meaning “the old town.”","zh":"在一些苏格兰歌曲里，你可能会看到“the ald town”，意思是“老城/旧城”。"},{"en":"He spoke in an ald dialect that sounded unfamiliar to me.","zh":"他说着一种老式方言，听起来我不太熟悉。"}]},{"partOfSpeech":"other","definition":{"en":"Abbreviation for “atomic layer deposition,” a method used to make very thin films in semiconductor and materials manufacturing.","zh":"“atomic layer deposition（原子层沉积）”的缩写：一种在半导体与材料制造中用于制备超薄膜的工艺。"},"examples":[{"en":"The lab uses ALD to coat the material with a uniform thin film.","zh":"实验室用ALD给材料镀上一层均匀的薄膜。"},{"en":"ALD is valued for precise thickness control.","zh":"ALD的优点是能精确控制厚度。"}]},{"partOfSpeech":"other","definition":{"en":"Abbreviation for “adrenoleukodystrophy,” a rare genetic disorder (used in medical contexts).","zh":"“adrenoleukodystrophy（肾上腺脑白质营养不良）”的缩写：一种罕见遗传病（医学语境）。"},"examples":[{"en":"The doctor mentioned ALD and recommended genetic testing.","zh":"医生提到ALD，并建议做基因检测。"},{"en":"Support groups for families affected by ALD are available online.","zh":"网上有面向受ALD影响家庭的互助组织。"}]}],"synonyms":["old (for the Scots sense)"],"phonetic":"/eɪ ɛl diː/","extraExplanation":["“Ald”本身在现代标准英语里并不常见；更常见的是大写“ALD”作为缩写，具体含义要看领域（材料/半导体、医学等）。","如果你是在句子里看到“Ald/ALD”，把原句发我，我可以根据上下文判断最准确的意思和读法。"]}
{"word":"ald","summary":{"en":"ALD is usually an acronym. In English-learning it often means Advanced Learner’s Dictionary; in other fields it can mean different things (e.g., a medical condition or a thin-film technique).","zh":"ALD 通常是缩写。在英语学习中常指“高级学习者词典”；在其他领域也可能表示不同含义（如一种疾病或薄膜制程技术）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation used for “Advanced Learner’s Dictionary,” especially in English-learning and dictionary/publishing contexts (e.g., OALD = Oxford Advanced Learner’s Dictionary).","zh":"（缩写）指“高级学习者词典（Advanced Learner’s Dictionary）”，常见于英语学习与词典/出版语境（如 OALD = 牛津高阶英汉/英英学习词典）。"},"examples":[{"en":"Many ESL teachers recommend an ALD for accurate meanings and example sentences.","zh":"很多英语老师会推荐使用 ALD（高级学习者词典）来获取准确释义和例句。"},{"en":"I checked it in an ALD instead of a slang-heavy online dictionary.","zh":"我用 ALD 查了这个词，而不是用俚语很多的在线词典。"}]},{"partOfSpeech":"other","definition":{"en":"a common acronym in science/medicine; for example, ALD can mean “adrenoleukodystrophy,” a rare genetic disorder.","zh":"（缩写）在科学/医学中也常见；例如 ALD 可指“肾上腺脑白质营养不良（adrenoleukodystrophy）”，一种罕见遗传病。"},"examples":[{"en":"The brochure explains symptoms and screening for ALD.","zh":"这份宣传册介绍了 ALD 的症状和筛查方式。"}]},{"partOfSpeech":"other","definition":{"en":"a common acronym in engineering/materials science meaning “atomic layer deposition,” a method for making very thin films.","zh":"（缩写）在工程与材料科学中可指“原子层沉积（atomic layer deposition）”，一种制备超薄薄膜的方法。"},"examples":[{"en":"They used ALD to coat the surface with a uniform thin layer.","zh":"他们用 ALD 在表面镀上一层均匀的薄膜。"}]}],"synonyms":["advanced learner’s dictionary (when used in ESL context)"],"phonetic":"ˌeɪ el ˈdiː","extraExplanation":["“ald / ALD”本身通常不是常见英语单词，更常见的是全大写的缩写“ALD”。你如果是想问某个特定领域（英语学习/医学/材料等）的 ALD，请告诉我上下文句子，我可以帮你锁定最准确的含义。"]}
{"word":"Alda","summary":{"en":"Alda is mainly used as a surname (notably Alan Alda) and is also used as a first name in some cultures.","zh":"Alda 主要作为姓氏使用（最著名的是 Alan Alda），也在一些文化中作为名字使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), best known in the U.S. from the actor and writer Alan Alda.","zh":"一个姓氏（家族姓），在美国最广为人知的是演员、作家 Alan Alda（艾伦·阿尔达）。"},"examples":[{"en":"Alan Alda became famous for the TV series M*A*S*H.","zh":"Alan Alda 因电视剧《风流医生俏护士》（M*A*S*H）而出名。"},{"en":"My professor mentioned Alda in a lecture about film and television history.","zh":"我的教授在一堂关于电影与电视史的课上提到了 Alda。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name (first name), used in several cultures; sometimes a short form of longer names.","zh":"一个名字（名），在多种文化中都有使用；有时也作为较长名字的简称。"},"examples":[{"en":"Alda is an uncommon first name in English-speaking countries.","zh":"Alda 在英语国家并不常见作为名字使用。"},{"en":"Her name is Alda, and she prefers it to be pronounced clearly.","zh":"她叫 Alda，并希望别人把这个名字读清楚。"}]}],"phonetic":"/ˈɔldə/","extraExplanation":["“Alda”在英语里通常被当作专有名词使用，因此词典里常见于“人名/姓氏”。最知名的关联是美国演员与编剧 Alan Alda，他在经典美剧《M*A*S*H》中饰演 Hawkeye Pierce。","作为名字的“Alda”在不同语言与地区可能有各自的来源与含义（例如在部分欧洲语言中出现），但在英语语境里更常被识别为人名而非普通词汇。"]}
{"word":"Aldabra","summary":{"en":"Aldabra is a remote atoll in the Seychelles, best known for its protected ecosystem and giant tortoises.","zh":"Aldabra 指塞舌尔的阿尔达布拉环礁，以受保护的生态系统和巨型陆龟闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a remote coral atoll in the Seychelles (Indian Ocean), famous for its rich wildlife and being a UNESCO World Heritage site","zh":"阿尔达布拉（塞舌尔群岛的偏远珊瑚环礁，位于印度洋），以丰富的野生动植物和联合国教科文组织世界遗产身份著称"},"examples":[{"en":"Aldabra is home to one of the world’s largest populations of giant tortoises.","zh":"阿尔达布拉拥有世界上规模最大的巨型陆龟种群之一。"},{"en":"Scientists study seabirds and coral reefs on Aldabra because the ecosystem is relatively undisturbed.","zh":"由于生态系统相对少受干扰，科学家会在阿尔达布拉研究海鸟与珊瑚礁。"}]},{"partOfSpeech":"adj.","definition":{"en":"in names of animals, referring to Aldabra, especially the Aldabra giant tortoise","zh":"（用于动物名称）指与阿尔达布拉有关，尤指“阿尔达布拉象龟/巨型陆龟”"},"examples":[{"en":"The Aldabra giant tortoise can live for more than a century.","zh":"阿尔达布拉象龟可能活超过一个世纪。"},{"en":"Some zoos run conservation programs for Aldabra tortoises.","zh":"一些动物园开展阿尔达布拉陆龟的保育项目。"}]}],"synonyms":["Aldabra Atoll"],"phonetic":"/ɔlˈdɑbrə/","extraExplanation":["阿尔达布拉环礁属于塞舌尔外岛，因交通不便、开发少而保留了相对原始的生态，被视为研究“自然状态下”岛屿生态的重要地点。","常见搭配：Aldabra Atoll（阿尔达布拉环礁）、Aldabra giant tortoise（阿尔达布拉象龟/巨型陆龟）。作为地名使用时，首字母大写。"]}
{"word":"Aldactone","summary":{"en":"Aldactone is a brand-name prescription drug (spironolactone) used as a potassium-sparing diuretic for conditions like high blood pressure and fluid retention.","zh":"Aldactone 是螺内酯的商品名，为一种“保钾”利尿处方药，常用于高血压与水肿等情况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A brand name for spironolactone, a prescription medicine (a diuretic) that helps the body remove extra water and salt while keeping potassium; it is often used for high blood pressure, heart failure, and conditions related to fluid retention or high aldosterone.","zh":"安体舒通（Aldactone）：螺内酯（spironolactone）的商品名，一种处方利尿药，帮助身体排出多余水分和盐分，同时相对“保钾”；常用于高血压、心力衰竭，以及与水肿或醛固酮过高相关的情况。"},"examples":[{"en":"My doctor prescribed Aldactone to help with fluid retention.","zh":"医生给我开了安体舒通来帮助缓解水肿（体液潴留）。"},{"en":"Aldactone is the brand name; the generic drug is spironolactone.","zh":"Aldactone 是商品名；它的通用名药是 spironolactone（螺内酯）。"},{"en":"If you take Aldactone, your doctor may check your potassium level with blood tests.","zh":"如果你在服用安体舒通，医生可能会通过验血监测你的钾水平。"}]}],"synonyms":["spironolactone","water pill (informal)","potassium-sparing diuretic"],"phonetic":"/ælˈdæktoʊn/","extraExplanation":["Aldactone 是商标名（brand name），在不同国家/地区可能还有其他商品名；在口语和医疗记录中也常直接写通用名 spironolactone（螺内酯）。","作为“保钾利尿剂”，它可能导致血钾升高，因此英语中常见搭配有 potassium level（钾水平）、blood test（验血监测）、side effects（副作用）。如有用药问题应咨询医生/药师。"]}
{"word":"aldactone","summary":{"en":"Aldactone is a brand name for spironolactone, a prescription potassium-sparing diuretic used for fluid retention, high blood pressure, and some hormone-related conditions.","zh":"Aldactone 是螺内酯的商品名，为处方保钾利尿剂，用于水肿/体液潴留、高血压及部分激素相关问题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand name for spironolactone, a prescription medicine that helps the body remove extra fluid while keeping potassium; it is used for conditions like high blood pressure, heart failure, swelling (edema), and some hormone-related issues such as acne or excess androgens.","zh":"安体舒通（Aldactone）：螺内酯的商品名，一种处方药利尿剂，帮助身体排出多余水分但保留钾；用于高血压、心力衰竭、水肿等，也常用于部分激素相关问题（如痤疮或雄激素过多）。"},"examples":[{"en":"My doctor prescribed Aldactone to help with fluid retention from heart failure.","zh":"医生给我开了安体舒通，用来缓解心衰导致的体液潴留（水肿）。"},{"en":"Some people take Aldactone for hormonal acne, but it should be used under medical supervision.","zh":"有些人用安体舒通来治疗激素相关痤疮，但应在医生指导下使用。"},{"en":"Because Aldactone can raise potassium levels, blood tests may be needed.","zh":"因为安体舒通可能升高血钾，可能需要抽血检查。"}]}],"synonyms":["spironolactone","potassium-sparing diuretic","diuretic"],"phonetic":"/ælˈdæktoʊn/","extraExplanation":["Aldactone 是“商品名”（brand name），其通用名（generic name）是 spironolactone（螺内酯）。在英语里，商品名通常首字母大写。","它属于“保钾利尿剂”（potassium-sparing diuretic），与某些利尿药不同，可能导致血钾偏高；若同时使用补钾剂、含钾盐替代品或某些降压药（如 ACEI/ARB），需要遵医嘱评估风险。","该药在皮肤科/内分泌领域也较常见（例如女性痤疮、多毛等），与“抗雄激素”作用有关；但是否适合、剂量与监测频率应由专业人员决定。"]}
{"word":"aldamin","summary":{"en":"“Aldamin” is uncommon; it likely refers to “aldimine,” a chemistry term for an imine made from an aldehyde and an amine.","zh":"“aldamin”并非常见词；多半是指“aldimine（醛亚胺）”，即由醛与胺反应生成的一类亚胺。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) An imine formed from an aldehyde and an amine (often written as R–CH=NR′).","zh":"（化学）由醛与胺反应生成的一类亚胺（常写作 R–CH=NR′）。"},"examples":[{"en":"In organic chemistry, an aldimine can be made by reacting an aldehyde with a primary amine.","zh":"在有机化学中，醛与一级胺反应可以生成醛亚胺（aldimine）。"},{"en":"Aldimines are often discussed when learning about Schiff bases and condensation reactions.","zh":"学习席夫碱和缩合反应时，经常会提到醛亚胺（aldimines）。"}]}],"synonyms":["aldimine","imine","Schiff base"],"phonetic":"/ˈæl.dəˌmiːn/","extraExplanation":["“aldamin”不是常见的标准英文词形；你可能想找的是 **aldimine**（醛亚胺）。在化学里，aldimine 是 imine（亚胺）的一种：若来自 aldehyde（醛）就叫 aldimine，若来自 ketone（酮）则常叫 ketimine（酮亚胺）。","若你指的是某个品牌名、药品名或人名（例如拼作 Aldamin），请给我一个句子或更多上下文，我可以按专有名词帮你解释。"]}
{"word":"aldamine","summary":{"en":"Aldamine is a chemistry term for an imine made from an aldehyde (often called an aldimine).","zh":"Aldamine 是化学术语，指由醛生成的亚胺（常称醛亚胺 aldimine）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) An imine formed from an aldehyde; a compound that contains the functional group R–CH=NR′ (also commonly called an aldimine).","zh":"（化学）由醛形成的亚胺类化合物；含有官能团 R–CH=NR′ 的化合物（也常称为“醛亚胺/aldimine”）。"},"examples":[{"en":"In organic chemistry, an aldamine can form when an aldehyde reacts with a primary amine.","zh":"在有机化学中，醛与一级胺反应时可生成醛亚胺（aldamine）。"},{"en":"Many ald amines (aldimines) are used as intermediates to make more complex molecules.","zh":"许多醛亚胺（aldamines/aldimines）可作为中间体，用来合成更复杂的分子。"}]}],"synonyms":["aldimine","Schiff base"],"phonetic":"/ˈældəˌmin/","extraExplanation":["“aldamine”在现代教材与论文里不如“aldimine”常见，很多情况下可视为同义或较旧/较少用的拼法。","典型生成机理是：醛与胺先形成“羟基胺醇（carbinolamine）”中间体，再脱水得到 C=N 的亚胺键；该反应常在酸催化并移除水分时更顺利。","相关术语：若由酮生成则叫“ketimine（酮亚胺）”；“Schiff base（席夫碱）”常泛指由醛/酮与胺缩合得到的亚胺类化合物。"]}
{"word":"Aldan","summary":{"en":"Aldan is a proper name most often referring to a river and a town in Russia’s Sakha Republic (eastern Siberia), and sometimes to the “Aldan Shield” in geology.","zh":"Aldan（阿尔丹）多为专有名词，常指俄罗斯东西伯利亚萨哈共和国（雅库特）的阿尔丹河与阿尔丹市；在地质语境中也可指“阿尔丹地盾”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a river in eastern Siberia (Russia), a major tributary of the Lena River.","zh":"阿尔丹河：俄罗斯东西伯利亚的一条河流，是勒拿河（Lena River）的重要支流。"},"examples":[{"en":"The Aldan River flows through the Sakha Republic in eastern Siberia.","zh":"阿尔丹河流经俄罗斯东西伯利亚的萨哈共和国（雅库特）。"},{"en":"Some maps label the Aldan as one of the Lena River’s largest tributaries.","zh":"一些地图把阿尔丹河标注为勒拿河最大的支流之一。"}]},{"partOfSpeech":"n.","definition":{"en":"a town/city in the Sakha Republic (Yakutia), Russia, known historically for nearby gold mining.","zh":"阿尔丹市：俄罗斯萨哈共和国（雅库特）的一座城镇/城市，历史上因附近金矿而知名。"},"examples":[{"en":"He worked in Aldan for a season during the mining boom.","zh":"在采矿热潮时期，他在阿尔丹工作过一个季节。"},{"en":"Aldan is far from Russia’s major population centers, with a harsh winter climate.","zh":"阿尔丹远离俄罗斯主要人口中心，冬季气候严酷。"}]},{"partOfSpeech":"n.","definition":{"en":"(geology) the Aldan Shield: an ancient area of exposed crystalline rock in Siberia.","zh":"（地质）阿尔丹地盾：西伯利亚一片古老的结晶基底出露区。"},"examples":[{"en":"The Aldan Shield contains very old rocks studied by geologists.","zh":"地质学家研究阿尔丹地盾中非常古老的岩石。"}]}],"synonyms":["(no direct synonyms; related: Sakha Republic/Yakutia, Lena River, Siberia)"],"phonetic":"/ɑlˈdɑn/","extraExplanation":["“Aldan”通常作为专有名词出现在地理或地质语境中；在英文文章里常与 Russia、Siberia、Sakha Republic（Yakutia）、Lena River 等词一起出现。","读地图或新闻时要注意大小写：Aldan（专名）通常首字母大写；如果指“阿尔丹地盾”，常见写法是 Aldan Shield。"]}
{"word":"aldane","summary":{"en":"Aldane is mainly used as a rare personal name (surname/given name), not a common English word.","zh":"Aldane 主要作为较少见的人名（姓氏/名字）使用，并非常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a rare proper name (usually a surname, sometimes a given name). It is not a common standard English vocabulary word.","zh":"一个较少见的专有名词（通常作姓氏，有时作名字），并非英语中常见的通用词汇。"},"examples":[{"en":"Dr. Aldane published a paper on coastal ecosystems.","zh":"奥尔丹（Aldane）博士发表了一篇关于海岸生态系统的论文。"},{"en":"I met someone named Aldane at the conference.","zh":"我在会议上认识了一个叫 Aldane 的人。"}]}],"phonetic":"/ælˈdeɪn/","extraExplanation":["“Aldane”在主流英语词典中通常不作为普通词条出现，更常见于人名/姓氏或特定作品、品牌、地名等语境。","如果你是在化学/农药语境里看到它，可能是拼写误差：常见相关词有“lindane（林丹/六六六的一种异构体，杀虫剂）”“aldrin（艾氏剂）”等。你可以把原句/上下文发来，我可以帮你确认具体指什么。"]}
{"word":"Aldarcie","summary":{"en":"Aldarcie is a rare proper name rather than a common English word; its exact meaning and pronunciation depend on context.","zh":"Aldarcie 更像少见的专有名称而非常见英语词；具体含义和读音需要结合上下文确认。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare personal name (proper noun); not a standard English vocabulary word. It may be used as a given name or surname in fiction or in specific families.","zh":"一个较少见的人名（专有名词）；不是常见英语词汇。可能作为名字或姓氏使用（常见于特定家族或虚构作品中）。"},"examples":[{"en":"Aldarcie appears as a character name in the story.","zh":"Aldarcie 在这个故事里是一个角色名。"},{"en":"I’m not sure how to pronounce Aldarcie—could you say it for me?","zh":"我不确定 Aldarcie 怎么读——你能读给我听吗？"}]},{"partOfSpeech":"other","definition":{"en":"If you meant a different word (for example, a place name or a spelling variant), please share the sentence or context so the meaning and pronunciation can be identified accurately.","zh":"如果你想查的是别的词（例如地名或拼写变体），请提供原句或上下文，这样才能更准确判断含义和读音。"},"examples":[{"en":"Could you put “Aldarcie” in a sentence?","zh":"你能把 “Aldarcie” 放进一句话里吗？"}]}],"synonyms":["(no direct synonyms; proper names usually do not have synonyms)"],"phonetic":"/ælˈdɑrsi/","extraExplanation":["“Aldarcie”在常见英语词典中并不常见，因此很可能是：①人名/姓氏（较少见）；②某个作品里的虚构名称；③拼写误差或变体。若你告诉我它来自哪本书/哪段对话/哪个地区，我可以帮你更精确地确认来源、含义与标准读法。","读音提示：在缺少权威来源时，只能给出近似读法。常见的英语名字读法可能是 /ælˈdɑrsi/（重音在第二音节），但请以原作者、本人或当地习惯为准。"]}
{"word":"Aldarcy","summary":{"en":"Aldarcy is mainly used as a personal name, not a standard English word with a common meaning.","zh":"Aldarcy 主要用作人名，并非英语里常见且有固定含义的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper noun used as a personal name (given name) or family name; not a common English vocabulary word with a standard dictionary meaning.","zh":"专有名词：用作人名（名字）或姓氏；不是英语里常见且有固定词典释义的普通词汇。"},"examples":[{"en":"Aldarcy introduced herself at the meeting.","zh":"Aldarcy 在会议上做了自我介绍。"},{"en":"I received an email from Aldarcy Johnson.","zh":"我收到了一封来自 Aldarcy Johnson 的邮件。"},{"en":"The artwork is signed “Aldarcy.”","zh":"这幅作品的署名是 “Aldarcy”。"}]}],"synonyms":["(none; it is a name)"],"phonetic":"/ælˈdɑrsi/","extraExplanation":["“Aldarcy”更像是英文姓名（可能是自创名、罕见拼写或姓氏）。如果你是在小说、游戏、品牌或社交媒体账号里看到的，它通常只是标识某个人/角色/品牌，而不是一个有固定词义的单词。","如果你其实想查的是发音相近或拼写相近的词（例如 aristocracy, Darcy 等），告诉我你看到它的句子或语境，我可以帮你确认最可能的目标词并解释。"]}
{"word":"Aldas","summary":{"en":"Aldas is usually a male first name, especially used in Lithuania.","zh":"Aldas 通常是男性名字，尤其常见于立陶宛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A masculine given name (a first name), used especially in Lithuania and nearby regions.","zh":"男性名字（名），尤其在立陶宛及周边地区使用。"},"examples":[{"en":"Aldas is my colleague from Vilnius.","zh":"Aldas 是我来自维尔纽斯的同事。"},{"en":"They named their son Aldas to honor his Lithuanian roots.","zh":"他们给儿子取名 Aldas，以纪念他的立陶宛血统。"}]}],"synonyms":["(no direct synonyms; it is a personal name)"],"phonetic":"/ˈɑldəs/","extraExplanation":["“Aldas”在英语中不算常见词汇，更多作为人名出现；在一些波罗的海地区（如立陶宛）较常见。","如果你是在某个特定语境里看到“ALDAS”（全大写），它也可能是某个组织/系统的缩写；如果你能提供句子或领域（科技、学校、公司等），我可以进一步确认含义。"]}
{"word":"alday","summary":{"en":"“alday” is a nonstandard spelling; the correct form is “all day,” meaning “throughout the whole day.”","zh":"“alday”是非标准拼写；正确写法是“all day”，意思是“整天；从早到晚”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Commonly written as “all day”) for the entire day; throughout the day.","zh":"（常写作“all day”）一整天；从早到晚。"},"examples":[{"en":"I’ve been tired all day.","zh":"我一整天都很累。"},{"en":"It rained all day, so we stayed indoors.","zh":"雨下了一整天，所以我们待在室内。"},{"en":"She worked all day and still had homework at night.","zh":"她工作了一整天，晚上还有作业要做。"}]}],"synonyms":["throughout the day","the whole day","all day long"],"phonetic":"/ɔl deɪ/","extraExplanation":["“alday”不是标准拼写，通常是把“all day”连写成一个词的非正式写法（多见于聊天、短信、社媒）。正式写作中请用“all day”。","注意区分：\n- all day（副词短语）：整天都……\n- all-day（形容词，带连字符）：全天的/持续一整天的（如：an all-day meeting 全天会议）"]}
{"word":"aldazin","summary":{"en":"Not a standard English word; likely a proper name or a misspelling.","zh":"不是标准英语词；多半是专有名词或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Aldazin is not a common English dictionary word. It is most likely a proper name (a person’s name, username, or brand name) or a misspelling of another word.","zh":"Aldazin 不是常见的英语词典词汇。它更可能是专有名词（人名、用户名或品牌名），或是其他单词的拼写错误。"},"examples":[{"en":"I saw the name Aldazin in the comments section, but I’m not sure how to pronounce it.","zh":"我在评论区看到 Aldazin 这个名字，但不确定怎么读。"},{"en":"Aldazin is listed as the author on this page.","zh":"这个页面把 Aldazin 列为作者。"}]}],"phonetic":"/ˈældəˌzɪn/","extraExplanation":["如果你是在某个特定场景里看到“aldazin”（例如药品名、游戏角色、公司名、阿拉伯语/其他语言的音译），含义会取决于来源。建议你提供一句原文或截图，或确认是否想查类似拼写：Aldazine / Aldazin(e) / Al-Dazin 等，我可以再精准解释。"]}
{"word":"aldazine","summary":{"en":"An aldazine is an organic compound formed from aldehydes and hydrazine (RCH=N–N=CHR).","zh":"Aldazine 指由醛与肼缩合形成的有机化合物（RCH=N–N=CHR）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound formed when two aldehyde molecules react with hydrazine, typically having the structure RCH=N–N=CHR (an “azine” made from aldehydes).","zh":"一种化学化合物，由两分子醛与肼反应生成，常见结构为 RCH=N–N=CHR（由醛形成的“连氮化合物/腙类相关物”）。"},"examples":[{"en":"Benzaldazine can be prepared by reacting benzaldehyde with hydrazine under suitable conditions.","zh":"苯甲醛连氮（benzaldazine）可在适当条件下由苯甲醛与肼反应制得。"},{"en":"In organic chemistry, an aldazine is often discussed as a condensation product of aldehydes and hydrazine.","zh":"在有机化学中，aldazine 常被描述为醛与肼缩合产生的产物。"}]}],"synonyms":["azine (general class)","aldehyde azine"],"phonetic":"/ælˈdeɪziːn/","extraExplanation":["“Aldazine”属于有机化学术语：前半部分 alda- 来自 aldehyde（醛），-azine 指含有 –N–N– 键并带有 C=N 的一类结构（可理解为由羰基化合物与肼缩合得到的衍生物）。","常见的具体物质名会用“某某-aldazine”表示，例如 benzaldazine（苯甲醛连氮），在文献中多用于反应机理、缩合反应或表征讨论。"]}
{"word":"aldea","summary":{"en":"Aldea means a small village (a Spanish term often kept in English for local flavor).","zh":"aldea 指“小村庄”，常作为西语词在英文中保留以体现地域语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish loanword) A village, especially in Spanish-speaking regions; a small rural community.","zh":"（西语借词）村庄；（尤指西语地区的）小型乡村聚落。"},"examples":[{"en":"They stopped in a small aldea in northern Spain for lunch.","zh":"他们在西班牙北部的一个小村庄停下来吃午饭。"},{"en":"The writer describes life in an Andean aldea, far from the city.","zh":"这位作家描写了远离城市的安第斯山区村落生活。"}]}],"synonyms":["village","hamlet","rural settlement"],"phonetic":"ælˈdeɪ.ə","extraExplanation":["“Aldea”多见于英文旅行写作、人类学/历史文本中，用来保留“西语语境中的村庄”这一地域色彩；在一般英文里更常用 village/hamlet。","词源：西班牙语 aldea，进一步来自阿拉伯语（常见解释为与“乡村聚落/村落”相关的词根）。"]}
{"word":"aldeament","summary":{"en":"“Aldeament” is not a standard English word; it’s likely a misspelling (often of “alderman”).","zh":"“aldeament”不是标准英语词，通常是拼写错误（常见为“alderman”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a non-English/rare form. Common intended words include “alderman” (a city official) or “allegement/engagement” depending on context.","zh":"不是标准英语单词。很可能是拼写错误或非英语/极少见形式。常见可能想表达的词包括“alderman”（市政官员）或（视语境而定）“allegement/engagement”等。"},"examples":[{"en":"I can’t find “aldeament” in standard dictionaries—did you mean “alderman”?","zh":"我在常见词典里找不到“aldeament”——你是不是想写“alderman”？"},{"en":"Please share the full sentence with “aldeament” so I can help you identify the intended word.","zh":"请把包含“aldeament”的完整句子发我，我可以帮你判断你想表达的词。"}]}],"phonetic":"N/A","extraExplanation":["“alderman”在英美语境中指地方政府官员（有些地区仍在使用这个称呼，有些已改为 councillor/city council member 等）。","如果你是在阅读文学/历史文本看到“aldeament”，也可能是扫描（OCR）错误或旧拼写变体；提供出处或上下文能更准确判断。"]}
{"word":"Aldebaran","summary":{"en":"Aldebaran is a very bright star in Taurus (Alpha Tauri), known as the “Eye of the Bull.”","zh":"Aldebaran（毕宿五）是金牛座的一颗明亮恒星（金牛座α），又称“公牛之眼”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A bright star in the constellation Taurus (Alpha Tauri), often called “the Eye of the Bull.” It is one of the most prominent stars in the night sky.","zh":"毕宿五（Aldebaran）：金牛座中的一颗明亮恒星（即金牛座α，Alpha Tauri），常被称为“公牛之眼”，是夜空中非常显眼的恒星之一。"},"examples":[{"en":"On a clear winter night, you can spot Aldebaran glowing orange in Taurus.","zh":"在晴朗的冬夜，你可以在金牛座里看到橙色发光的毕宿五。"},{"en":"Astronomy apps often label Aldebaran as Alpha Tauri.","zh":"天文类App常把毕宿五标注为金牛座α（Alpha Tauri）。"}]}],"synonyms":["Alpha Tauri","α Tauri"],"phonetic":"/ælˈdɛbəræn/","extraExplanation":["词源来自阿拉伯语 **al-dabarān**，大意是“追随者/跟随者”，因为它在天空中似乎“跟着”昴宿星团（Pleiades，七姐妹星团）一起升起或移动。","在一些文化与航海传统中，毕宿五因亮度高、位置醒目，常被用作辨认星座与夜间方位的参考星。"]}
{"word":"aldebaran","summary":{"en":"Aldebaran is a famous bright star (Alpha Tauri) in the constellation Taurus, often seen as the Bull’s eye.","zh":"Aldebaran（毕宿五）是金牛座中著名的亮星（金牛座α星），常被视为“牛眼”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A bright red giant star in the constellation Taurus (the Bull), traditionally known as the Bull’s “eye”; it is also called Alpha Tauri.","zh":"毕宿五：金牛座中一颗明亮的红巨星，传统上被称为“金牛的眼睛”，也叫金牛座α星（Alpha Tauri）。"},"examples":[{"en":"On a clear winter night, you can often spot Aldebaran shining orange-red in Taurus.","zh":"在晴朗的冬夜，你常常能在金牛座看到毕宿五呈橙红色闪耀。"},{"en":"The book explains how Aldebaran helps beginners learn to identify Taurus and nearby constellations.","zh":"这本书说明了毕宿五如何帮助初学者辨认金牛座及其附近的星座。"}]}],"synonyms":["Alpha Tauri","α Tauri"],"phonetic":"/ælˈdɛbəræn/","extraExplanation":["“Aldebaran”一词来自阿拉伯语（الدبران），意为“跟随者”，因为它在天空中似乎跟随昴宿星团（Pleiades，昴星团）运行。","在天文学上，毕宿五常被用作观星入门的“指路星”：从猎户座的腰带星向西北方向延伸，常可找到它。","日常英语中它多作为专有名词出现，首字母大写（Aldebaran）。"]}
{"word":"aldebaranium","summary":{"en":"Aldebaranium is a made-up sci‑fi material named after the star Aldebaran, not a real chemical element.","zh":"Aldebaranium 是以恒星毕宿五命名的科幻虚构材料，并非真实化学元素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fictional or speculative substance (often described as a metal or element) named after the star Aldebaran; used mainly in science fiction or fan-made worldbuilding rather than real science.","zh":"一种虚构或推测性的物质（常被写成金属或化学元素），名称源自恒星“毕宿五（Aldebaran）”；主要出现在科幻作品或同人设定中，并非真实科学名词。"},"examples":[{"en":"In the novel, the ship’s hull was reinforced with aldebaranium to survive extreme heat.","zh":"在小说里，飞船外壳用 aldebaranium 加固，以承受极端高温。"},{"en":"The game describes aldebaranium as a rare alien metal found near Aldebaran.","zh":"游戏把 aldebaranium 描述成在毕宿五附近发现的稀有外星金属。"}]}],"synonyms":["unobtainium","fictional element","alien metal"],"phonetic":"/ˌældəˈbærəniəm/","extraExplanation":["从构词上看，-ium 常见于元素名称（如 titanium、uranium），因此 aldebaranium 常被读者直觉理解为“某种元素/金属”。不过它不在国际纯粹与应用化学联合会（IUPAC）的真实元素命名体系中。","Aldebaran（毕宿五）是金牛座中非常显眼的一颗亮星；科幻作品里常用“以恒星/星系命名材料”的方式营造宇宙感与异域感。"]}
{"word":"Alded","summary":{"en":"“Added” means “put in/increased” (past of add) or “extra/additional.”","zh":"“Added”表示“加了/增加了”（add 的过去式）或“额外的/附加的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “add”: to put something with something else; to increase an amount","zh":"“add”的过去式和过去分词：把……加到……里；增加数量"},"examples":[{"en":"I added sugar to the coffee.","zh":"我往咖啡里加了糖。"},{"en":"They added two more chairs for the guests.","zh":"他们又加了两把椅子给客人。"}]},{"partOfSpeech":"adj.","definition":{"en":"extra; additional (often used before a noun)","zh":"额外的；附加的（常放在名词前）"},"examples":[{"en":"There is an added cost for delivery.","zh":"送货要额外收费。"},{"en":"Practice gives you added confidence.","zh":"练习会给你额外的自信。"}]}],"synonyms":["additional","extra","increased","supplementary"],"phonetic":"/ˈædɪd/","extraExplanation":["“Alded”本身不是常见英语单词，很可能是拼写误差，通常想写的是 added（added 中间是两个 d）。如果你是想查别的词（如 alder/aldol/alidade 等），把完整句子或上下文发我，我可以帮你确认。"]}
{"word":"aldehol","summary":{"en":"“Aldehol” is probably a misspelling of “aldehyde,” a type of organic compound used widely in chemistry and industry.","zh":"“aldehol”很可能是“aldehyde（醛）”的拼写错误；醛是一类在化学与工业中很常见的有机化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely meant) aldehyde: an organic chemical compound that contains a –CHO group (a carbonyl group bonded to a hydrogen). Many aldehydes have strong smells and are used in making plastics, perfumes, and other chemicals.","zh":"（可能想写）aldehyde：一种含有 –CHO（醛基，碳氧双键与氢相连）结构的有机化合物。许多醛类气味明显，用于制造塑料、香精香料等化学品。"},"examples":[{"en":"Formaldehyde is a common aldehyde used in many industrial products.","zh":"甲醛（formaldehyde）是一种常见的醛类，广泛用于许多工业产品。"},{"en":"Some perfumes include aromatic aldehydes to create a clean, soapy scent.","zh":"有些香水会加入芳香族醛来营造干净、皂感的气味。"}]}],"synonyms":["aldehyde (correct spelling)","alkanals (for simple aldehydes)"],"phonetic":"/ˈæl.dəˌhaɪd/","extraExplanation":["你输入的“aldehol”在英语里不常见，最可能是把“aldehyde”（醛）拼错了。","词源提示：aldehyde 来自拉丁语 alcohol（酒精）与 dehydrogenatus（去氢的），因为醛可以看作是“酒精去掉氢”氧化得到的一类化合物。"]}
{"word":"aldehydase","summary":{"en":"Aldehydase is an enzyme that breaks down aldehydes, often referring broadly to aldehyde dehydrogenase-type enzymes.","zh":"Aldehydase 指分解醛类的酶，常泛指醛脱氢酶等相关酶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an enzyme that helps break down aldehydes (often by converting them into less harmful acids); commonly used in biology to refer to enzymes such as aldehyde dehydrogenase","zh":"醛酶；一种帮助分解“醛类”物质的酶（常通过把醛转化为较不有害的酸），生物学中常泛指如“醛脱氢酶”等相关酶"},"examples":[{"en":"In the liver, aldehydase helps detoxify aldehydes produced during alcohol metabolism.","zh":"在肝脏中，醛酶有助于解毒酒精代谢过程中产生的醛类物质。"},{"en":"Researchers measured aldehydase activity to see how quickly the cells could process toxic aldehydes.","zh":"研究人员测量醛酶活性，以观察细胞处理有毒醛类的速度。"}]}],"synonyms":["aldehyde dehydrogenase","ALDH","aldehyde-metabolizing enzyme"],"phonetic":"/ælˈdiˌhaɪdeɪz/","extraExplanation":["“aldehydase”在日常英语里不常见；更常见、更规范的写法通常是更具体的酶名，例如：aldehyde dehydrogenase（醛脱氢酶，常写作 ALDH）。不同生物、不同组织里可能有不同类型的 ALDH 家族成员。","词源上可以拆开理解：aldehyde（醛）+ -ase（表示“酶”的后缀）。看到“-ase”结尾的词，多半是某种酶（如 lactase 乳糖酶、lipase 脂肪酶）。"]}
{"word":"aldehyde","summary":{"en":"An aldehyde is an organic chemical containing the –CHO group, often with a noticeable odor and many industrial uses.","zh":"aldehyde 指“醛”，含–CHO 醛基的一类有机化合物，常有明显气味并广泛用于工业与日常产品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of organic chemical (a compound made mainly of carbon, hydrogen, and oxygen) that contains a special group of atoms called the aldehyde group (–CHO). Many aldehydes have strong smells and are used in perfumes, flavorings, plastics, and disinfectants.","zh":"醛；一类有机化合物，含有醛基（–CHO）。许多醛类有明显气味，常用于香精香料、食品香味、塑料和消毒等领域。"},"examples":[{"en":"Formaldehyde is a common aldehyde used in laboratories and some building materials.","zh":"甲醛是一种常见的醛类，用于实验室和某些建筑材料中。"},{"en":"Some aldehydes give fruits and flowers their characteristic smells.","zh":"有些醛类会带来水果和花朵特有的气味。"}]}],"synonyms":["formaldehyde (a specific aldehyde)","ethanal (a specific aldehyde)","acetaldehyde (a specific aldehyde)"],"phonetic":"/ˈæl.də.haɪd/","extraExplanation":["“aldehyde”源自早期化学命名：来自“alcohol dehydrogenated”（酒精脱氢/去氢）这一概念，因为醛常可由醇经过氧化（失去氢）生成。","学习提示：醛常与“ketone（酮）”一起出现。简单区分：醛的–CHO通常在分子“末端”，酮的羰基（C=O）通常在“中间”。"]}
{"word":"aldehyde-containing","summary":{"en":"A technical adjective meaning “containing aldehydes or an aldehyde group (—CHO).”","zh":"技术性形容词，表示“含有醛（或醛基—CHO）的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing an aldehyde group (—CHO), or having aldehydes as one of the components.","zh":"含有醛基（—CHO）的；含醛的（指物质或配方中含有醛类成分）。"},"examples":[{"en":"The researchers tested aldehyde-containing compounds for antibacterial activity.","zh":"研究人员测试了含醛化合物的抗菌活性。"},{"en":"Some aldehyde-containing fragrance ingredients can irritate sensitive skin.","zh":"某些含醛的香精成分可能会刺激敏感皮肤。"},{"en":"Aldehyde-containing preservatives must be handled with care.","zh":"含醛防腐剂必须小心处理。"}]}],"synonyms":["aldehydic","aldehyde-bearing","aldehyde-rich"],"phonetic":"/ˈæl.dəˌhaɪd kənˈteɪ.nɪŋ/","extraExplanation":["“aldehyde-containing”常见于化学、材料、医药与香精香料领域，用作定语（放在名词前）：aldehyde-containing compound/solution/material（含醛化合物/溶液/材料）。","醛（aldehyde）是一类有机化合物，特点是末端带有醛基 —CHO；常见例子包括甲醛（formaldehyde）和乙醛（acetaldehyde）。在日常语境里，涉及“含醛”时也常和气味、刺激性、消毒/防腐用途等话题相关。"]}
{"word":"aldehyde-like","summary":{"en":"“Aldehyde-like” means resembling an aldehyde, especially in smell or chemical behavior.","zh":"“Aldehyde-like”表示类似醛类的，常指气味或化学性质像醛。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the qualities of an aldehyde (for example, a sharp, pungent smell or a reactive chemical character), or resembling an aldehyde in structure or behavior.","zh":"具有醛类的特征（例如刺鼻、辛辣的气味或较强的反应性），或在结构/性质上类似醛类的。"},"examples":[{"en":"The cleaner had an aldehyde-like odor that stung my nose.","zh":"这种清洁剂有一种类似醛类的气味，闻起来刺鼻。"},{"en":"Some people describe freshly cut grass as having a slightly aldehyde-like note.","zh":"有人形容刚割下的青草带有一点类似醛类的气息。"},{"en":"The chemist tested the sample for aldehyde-like reactivity.","zh":"化学家检测该样品是否有类似醛类的反应性。"}]}],"synonyms":["aldehydic","aldehyde-scented","pungent","sharp-smelling"],"phonetic":"/ˈæl.də.haɪd laɪk/","extraExplanation":["“-like”表示“像……一样/具有……特征”，因此“aldehyde-like”常用于化学、香精香料与气味描述中。它通常不是严格的分类名词，而是说明“闻起来/表现得像醛”。","在香水与香味描述里，“醛香（aldehydic）”常指一种明亮、清爽、略带金属感或皂感的气息；因此“aldehyde-like note”多用于感官描述，不一定表示真的含有醛类化合物。"]}
{"word":"aldehyde-related","summary":{"en":"Aldehyde-related means connected with or involving aldehydes.","zh":"aldehyde-related 意为“与醛类有关的；涉及醛类的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with, caused by, or involving aldehydes (a group of organic chemicals that contain the –CHO group).","zh":"与醛类有关的；由醛类引起的；涉及醛类（含有 –CHO 官能团的一类有机化学物质）。"},"examples":[{"en":"The lab added an aldehyde-related reagent to help identify the unknown compound.","zh":"实验室加入了一种与醛相关的试剂，用来鉴定未知化合物。"},{"en":"Some people are sensitive to aldehyde-related odors in new furniture or paint.","zh":"有些人对新家具或油漆中与醛相关的气味比较敏感。"}]}],"synonyms":["aldehyde-associated","related to aldehydes","aldehyde-linked"],"phonetic":"/ˈæl.dəˌhaɪd rɪˈleɪ.tɪd/","extraExplanation":["“aldehyde-related”常用于科研、医学、环境与材料语境，表示“与醛这一类物质有关”，不一定指某一种具体的醛（如甲醛 formaldehyde、乙醛 acetaldehyde），而是指与醛的化学性质、反应、代谢或影响相关。","写作上它常作定语：aldehyde-related compounds/issues/exposure/symptoms（与醛相关的化合物/问题/暴露/症状）。日常英语里也可能改写为 related to aldehydes 或 aldehyde-associated。"]}
{"word":"aldehydes","summary":{"en":"Aldehydes are organic compounds with the –CHO group, common in chemistry and in products like perfumes and industrial materials.","zh":"醛类是含有–CHO醛基的有机化合物，在化学中常见，也常用于香水与多种工业材料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A class of organic chemicals that contain an aldehyde group (–CHO), often with a strong smell; many are used in making plastics, perfumes, dyes, and disinfectants.","zh":"醛类：一类含有醛基（–CHO）的有机化合物，常有较强气味；许多用于制造塑料、香料、染料和消毒剂等。"},"examples":[{"en":"Formaldehyde is one of the best-known aldehydes.","zh":"甲醛是最常见、最知名的醛类之一。"},{"en":"Some perfumes contain aldehydes to create a fresh, “soapy” scent.","zh":"有些香水会加入醛类来营造清新、带“皂感”的气味。"},{"en":"In chemistry class, we learned how aldehydes can be oxidized into carboxylic acids.","zh":"在化学课上我们学到，醛类可以被氧化生成羧酸。"}]}],"synonyms":["carbonyl compounds (broader)","alkanals (more specific)"],"phonetic":"/ælˈdiˌhaɪdz/","extraExplanation":["“aldehyde”一词来自德语/拉丁语系的缩合：alcohol（酒精） + dehydrogenatus（去氢的），因为醛常可由醇“去氢”生成。","在日常安全语境中常提到的醛是“formaldehyde（甲醛）”，与室内装修材料、消毒、防腐等相关；接触时需注意通风与合规标准。","文学与文化上，“aldehydic”常用来形容香水的气味风格（如“醛香调/皂感、冷冽、明亮”），这是一种香水评论里常见的描述。"]}
{"word":"aldehydic","summary":{"en":"Aldehydic means “related to aldehydes” or “having an aldehyde-like sharp, clean scent,” especially in perfumes.","zh":"aldehydic 指“与醛类有关/含醛基的”，也可指“带醛香调的清洁、明亮气味”（香水语境常见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to aldehydes (a class of organic compounds that contain the –CHO group).","zh":"与醛类有关的；含有醛基（–CHO）的（有机化合物）。"},"examples":[{"en":"Formaldehyde is the simplest aldehyde compound.","zh":"甲醛是最简单的醛类化合物。"},{"en":"The lab report described an aldehydic functional group in the sample.","zh":"实验报告描述样品中含有醛基官能团。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a sharp, clean, sometimes soapy or citrus-like smell often associated with aldehydes (common in perfumery).","zh":"带有醛香调的（气味尖锐清洁，有时带肥皂感或柑橘感；香水中常见）。"},"examples":[{"en":"The perfume opens with an aldehydic sparkle.","zh":"这款香水前调带有明显的醛香闪亮感。"},{"en":"Some people find aldehydic scents fresh, while others think they smell too soapy.","zh":"有人觉得醛香清爽，也有人觉得太“肥皂味”。"}]}],"synonyms":["aldehyde-related","aldehyde-like","aldehydic note"],"phonetic":"/ˌæl.dəˈhɪdɪk/","extraExplanation":["“aldehydic”常见于两类语境：①化学/生物化学里描述含醛基（–CHO）的结构；②香水评价里指“醛香调”（aldehydes），常用来形容一种明亮、清洁、带金属感或肥皂感的开场气味。","香水史上“醛香调”常与经典作品相联系（例如常被提到的 Chanel No. 5），因此在香评中它不仅是化学概念，也带有审美与风格标签。"]}
{"word":"aldehydine","summary":{"en":"A rare chemistry word meaning “aldehyde-related; aldehyde-containing.”","zh":"一个较少用的化学词，意思是“与醛有关的；含醛的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry, rare) Relating to aldehydes; containing or characterized by an aldehyde group (–CHO).","zh":"（化学，较少用）与醛有关的；含有或具有醛基（–CHO）特征的。"},"examples":[{"en":"The sample had a strong aldehydine odor, similar to formaldehyde.","zh":"这个样品有很强的醛类气味，类似甲醛。"},{"en":"Aldehydine compounds can be irritating, so use gloves and good ventilation.","zh":"醛类化合物可能有刺激性，因此要戴手套并保持良好通风。"}]}],"synonyms":["aldehydic","aldehyde-related","aldehyde-containing"],"phonetic":"/ælˈdiˌhaɪdiːn/","extraExplanation":["“aldehydine”在现代英语中非常罕见，很多情况下是拼写或用词选择问题。更常见、更标准的表达是：\n- **aldehydic**（adj. 醛的/含醛的）\n- **aldehyde**（n. 醛；如 formaldehyde 甲醛、acetaldehyde 乙醛）\n如果你是在论文、化学安全说明或产品成分里看到它，建议回到原文确认是否其实写的是 *aldehydic* 或 *aldehyde*。"]}
{"word":"aldehydrol","summary":{"en":"A rare/older chemistry word for “aldol,” a beta‑hydroxy aldehyde (an aldehyde‑plus‑alcohol type product).","zh":"一个较少见/较旧的化学词，指“醛醇（aldol）”，即β-羟基醛（兼具醛与醇特征的产物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry, older term) An aldol: a beta‑hydroxy aldehyde formed when aldehydes react to make an “aldehyde + alcohol” product (the aldol condensation reaction).","zh":"（化学，旧称）“醛醇”（aldol）：一种β-羟基醛，由醛类反应生成，产物兼具“醛 + 醇”的结构特征（与“醛醇缩合”反应相关）。"},"examples":[{"en":"In older chemistry texts, aldehydrol is used as another name for aldol.","zh":"在一些较早的化学教材里，aldehydrol 被用作 aldol（醛醇）的别称。"},{"en":"The reaction produces an aldehydrol, which can later dehydrate to form an alpha,beta‑unsaturated aldehyde.","zh":"该反应先生成一个醛醇（aldehydrol），随后可能脱水形成α,β-不饱和醛。"}]}],"synonyms":["aldol","beta-hydroxy aldehyde","aldol product"],"phonetic":"/ˈæl.dəˌhaɪ.drɔl/","extraExplanation":["这是一个比较少见、偏历史用法的术语：字面上可理解为 “aldehyde（醛）+ -ol（醇）”。后来更常用、更标准的名称是 **aldol（醛醇）**，因此你在现代教材、论文里更可能看到 aldol 而不是 aldehydrol。"]}
{"word":"aldeia","summary":{"en":"A Portuguese word meaning “village,” especially a small rural settlement.","zh":"葡语词，意为“村庄/乡村聚落”，常指较小的乡村社区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Portuguese) a small village; a rural settlement, often smaller and quieter than a town.","zh":"（葡语）村庄；乡村聚落，通常比城镇更小、更安静。"},"examples":[{"en":"They stayed in a quiet aldeia in the countryside.","zh":"他们住在乡间一个安静的村庄里。"},{"en":"The aldeia has a small church and a few shops.","zh":"这个村庄有一座小教堂和几家商店。"}]}],"synonyms":["village","hamlet","rural settlement"],"phonetic":"/ɑlˈdeɪ.ə/","extraExplanation":["“aldeia”是葡萄牙语（也常见于巴西葡语、部分非洲葡语国家）的常用词，意思接近英语的“village”。","词源上常被认为与阿拉伯语有关（伊比利亚半岛历史上受阿拉伯语影响较深），很多以“al-”开头的葡/西语词都来自这一时期。","与葡语里更常见的“vila（小镇）”“cidade（城市）”相比，“aldeia”更强调乡村、规模较小、社区更紧密的居住地；在不同国家/地区，其行政含义可能不完全一致。"]}
{"word":"Alden","summary":{"en":"Alden is used as a male first name and as a surname.","zh":"Alden 可用作男性名字，也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name)","zh":"（男性）名字；名"},"examples":[{"en":"Alden is starting high school this fall.","zh":"Alden 今年秋天要上高中了。"},{"en":"We named our son Alden because we liked how it sounds.","zh":"我们给儿子取名 Alden，因为我们喜欢这个名字的发音。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname)","zh":"姓；家族姓氏"},"examples":[{"en":"Her last name is Alden.","zh":"她的姓是 Alden。"},{"en":"Mr. Alden will lead the meeting today.","zh":"Alden 先生今天将主持会议。"}]}],"synonyms":["(related names) Alton","(related names) Arden"],"phonetic":"/ˈɔːldən/","extraExplanation":["“Alden”作为专有名词通常要大写，用于人名（名或姓）。","在美国文化中，“Alden”常让人联想到五月花号乘客 John Alden，以及朗费罗的叙事诗《The Courtship of Miles Standish》（《迈尔斯·斯坦迪什的求婚》）中出现的 John Alden 形象。"]}
{"word":"alden","summary":{"en":"Alden is mainly used as a personal name (first name or surname) and also appears in place names.","zh":"Alden 主要用作人名（名或姓），也常见于地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name and family name (surname).","zh":"（人名）奥尔登：男性名字，也可作姓氏。"},"examples":[{"en":"Alden is my grandfather’s first name.","zh":"Alden 是我祖父的名字。"},{"en":"Ms. Alden will lead today’s meeting.","zh":"Alden 女士将主持今天的会议。"}]},{"partOfSpeech":"n.","definition":{"en":"a name used for several places (towns, neighborhoods, streets), especially in the United States.","zh":"（地名）奥尔登：用于一些地方名称（城镇、社区、街道等），在美国较常见。"},"examples":[{"en":"They moved to Alden, New York, for work.","zh":"他们为了工作搬到了纽约州的奥尔登。"},{"en":"The café is on Alden Street.","zh":"那家咖啡馆在奥尔登街上。"}]}],"phonetic":"ˈɔldən","extraExplanation":["“Alden”常被认为与古英语词根有关，常见解释是含有“old（年长的）/friend（朋友）”之意，因此有时会被理解为“老朋友”。","在美国文化语境中，Alden 也常让人联想到“John Alden（约翰·奥尔登）”，他与“五月花号（Mayflower）”殖民史相关，常出现在早期移民题材的历史叙述与文学作品中。"]}
{"word":"Aldenville","summary":{"en":"“Aldenville” is a proper name, usually a place name (real or fictional).","zh":"“Aldenville”是专有名词，通常用作地名（可真实可虚构）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a proper name used for a place (a town, neighborhood, or community) called “Aldenville.”","zh":"专有名词：地名，“Aldenville”（可指名为奥尔登维尔的城镇、社区或地区）。"},"examples":[{"en":"She grew up in Aldenville before moving to Chicago.","zh":"她在Aldenville长大，后来搬去了芝加哥。"},{"en":"The package was sent to Aldenville, but the ZIP code was missing.","zh":"包裹寄到了Aldenville，但缺少邮政编码。"}]},{"partOfSpeech":"n.","definition":{"en":"a fictional place name used in stories, games, or writing to create a setting called “Aldenville.”","zh":"虚构地名：在小说、游戏或写作中用来设定场景的“Aldenville”。"},"examples":[{"en":"In the novel, Aldenville is a quiet town hiding a big secret.","zh":"在小说里，Aldenville是一座表面宁静却隐藏重大秘密的小镇。"},{"en":"Our campaign starts in Aldenville, a farming village near the river.","zh":"我们的战役从Aldenville开始——一个靠近河流的农耕村庄。"}]}],"synonyms":["(no direct synonyms; it’s a proper name)"],"phonetic":"/ˈɔldənˌvɪl/","extraExplanation":["从构词来看，Aldenville 常见的结尾 -ville 来自法语，意思是“城镇/村庄”，在英语地名中很常见（如 Jacksonville, Fayetteville）。Alden- 可能源于人名（Alden）或古英语词根的变体，因此这个名字整体给人的感觉是“以Alden命名的小镇/城”。","因为它更像专有名词，具体指哪里要看上下文（例如州、国家、邮编、或作品设定）。写作中若想让读者更容易定位，可以加上州名/国家名，或用一句话补充地理特征（如靠海、靠山、以矿业闻名等）。"]}
{"word":"Alder","summary":{"en":"An alder is a wetland-loving tree; it can also mean the wood from that tree.","zh":"Alder 指常生长在湿地或河岸的桤木（赤杨）；也可指桤木木材。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tree (genus Alnus) that often grows near rivers and wet ground, with small cone-like fruiting bodies.","zh":"桤木；赤杨（桤木属的一种树），常生长在河边或潮湿地带，果实像小松果。"},"examples":[{"en":"Alders often grow along streams and help protect the riverbank.","zh":"桤木常沿溪流生长，并帮助保护河岸。"},{"en":"We walked through a wet area filled with alder trees.","zh":"我们穿过一片长满桤木的潮湿地带。"}]},{"partOfSpeech":"n.","definition":{"en":"the wood from an alder tree, used for furniture, carving, and sometimes smoking food.","zh":"桤木木材（用于家具、雕刻，有时也用于熏制食物）。"},"examples":[{"en":"The cabinet is made of alder, then stained a darker color.","zh":"这个柜子用桤木做成，然后被染成了更深的颜色。"},{"en":"Some cooks use alder wood to smoke salmon.","zh":"一些厨师会用桤木来熏制三文鱼。"}]}],"synonyms":["alnus","alder tree"],"phonetic":"/ˈɔldɚ/","extraExplanation":["“alder”常见于北半球温带地区，喜欢湿润环境，因此在英文自然写作里常用来营造“河岸、沼泽、雨后林地”的氛围。","在某些文化与民俗中，赤杨与“水边、保护、更新”相关联；也常被提到用于护岸、固土等生态用途。","词源上来自古英语，与“红褐色/赤色”的联想有关（部分种类树皮或木材带红色调）。"]}
{"word":"alder","summary":{"en":"An alder is a riverside/wetland tree; alder also means its wood, often used for carving or smoking food.","zh":"Alder 指常见于河岸湿地的赤杨树；也可指赤杨木，常用于雕刻或熏制食物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tree (or shrub) that often grows near rivers and wetlands, known for its catkins and for improving soil by adding nitrogen","zh":"赤杨（属）树；常生长在河岸与湿地附近，以柔荑花序（catkins）和能固氮、改良土壤而闻名"},"examples":[{"en":"Alders often grow along streams where the soil stays damp.","zh":"赤杨常沿着溪流生长，因为那里的土壤长期潮湿。"},{"en":"The restoration project planted alder to stabilize the riverbank.","zh":"修复项目种植了赤杨来稳固河岸。"}]},{"partOfSpeech":"n.","definition":{"en":"the wood of the alder tree, valued for carving and for smoking foods","zh":"赤杨木；常用于雕刻，也常用作熏制食物的木材"},"examples":[{"en":"This bowl is carved from alder.","zh":"这个碗是用赤杨木雕刻的。"},{"en":"The salmon was smoked over alder wood.","zh":"这条三文鱼是用赤杨木熏制的。"}]}],"synonyms":["birch (related, not the same)","catkin-bearing tree","hardwood"],"phonetic":"/ˈɔldɚ/","extraExplanation":["“Alder”在英语里通常指“赤杨”，在北美和欧洲都很常见。它喜欢潮湿环境，因此常出现在河岸、湖边等地。","赤杨在生态修复中很受欢迎：它能通过根部与微生物共生“固氮”，帮助贫瘠或受扰动的土地更快恢复。","文化与用法小提示：在美国西北地区（如华盛顿、俄勒冈），用“alder wood”熏三文鱼非常有地方特色；菜单上看到“alder-smoked”一般就是指用赤杨木烟熏的风味。"]}
{"word":"Alderamin","summary":{"en":"Alderamin is the traditional name of Alpha Cephei (α Cephei), a bright star in the constellation Cepheus.","zh":"Alderamin是仙王座α星（Alpha Cephei，α Cephei）的传统星名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Alderamin: the traditional name of Alpha Cephei (α Cephei), a relatively bright star in the constellation Cepheus, visible in the Northern Hemisphere.","zh":"Alderamin：仙王座α星（Alpha Cephei，α Cephei）的传统星名，是仙王座中较亮的一颗恒星，在北半球较容易观测到。"},"examples":[{"en":"On a clear autumn night, you can spot Alderamin in the constellation Cepheus.","zh":"在晴朗的秋夜，你可以在仙王座里找到Alderamin。"},{"en":"The star Alderamin is also known by its catalog name, Alpha Cephei.","zh":"Alderamin也可以用它的星表名称来称呼：Alpha Cephei（仙王座α星）。"}]}],"synonyms":["Alpha Cephei","α Cephei"],"phonetic":"/ˌɔːl.dəˈreɪ.mɪn/","extraExplanation":["Alderamin 来自阿拉伯语传统星名，常被解释为与“右臂”相关（不同资料对原词拼写/转写略有差异）。许多亮星的英文传统名称都源自中世纪阿拉伯天文学。","在现代天文学里，“Alderamin”属于传统专名用法；更规范、便于检索的称呼是 “Alpha Cephei（α Cephei）”。"]}
{"word":"alderamin","summary":{"en":"Alderamin is the traditional name of the star Alpha Cephei in the constellation Cepheus.","zh":"Alderamin 是仙王座中仙王座α星（Alpha Cephei）的传统星名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A star (Alpha Cephei) in the constellation Cepheus; its traditional proper name is used in astronomy.","zh":"（天文学）仙王座α星（Alpha Cephei）的传统专名，用于指代仙王座中的一颗恒星。"},"examples":[{"en":"Alderamin is also known by its Bayer designation, Alpha Cephei.","zh":"Alderamin 也被称为它的拜耳命名：仙王座α星（Alpha Cephei）。"},{"en":"On a clear night, you can look for Cepheus and identify Alderamin as one of its brighter stars.","zh":"在晴朗的夜晚，你可以找到仙王座，并把 Alderamin 认作其中较亮的恒星之一。"}]}],"synonyms":["Alpha Cephei","α Cephei"],"phonetic":"/ælˈdɛrəmɪn/","extraExplanation":["Alderamin 是恒星的“专名”（proper name），常见于天文图、观测指南和科普文章中。","词源来自阿拉伯语，常被解释为与“右臂/右臂部位”相关的含义（不同资料在转写与解释上略有差异），反映了传统星名中阿拉伯语来源非常普遍的历史背景。"]}
{"word":"Aldercy","summary":{"en":"“Aldercy” is not a recognized English word; it’s likely a misspelling or a proper name.","zh":"“Aldercy” 不是常见英语词，更可能是拼写错误或专有名词（如人名/品牌）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name/brand; common close matches include “adultery,” “alder” (a type of tree), or “aldehyde” (a chemistry term).","zh":"不是标准英语单词。更可能是拼写错误，或是人名/品牌名；常见的相近词包括 “adultery（通奸）”、“alder（赤杨树）” 或 “aldehyde（醛，化学术语）”。"},"examples":[{"en":"I couldn’t find “Aldercy” in a dictionary—could it be “adultery” or “aldehyde”?","zh":"我在词典里找不到 “Aldercy”——你是不是想写 “adultery” 或 “aldehyde”？"},{"en":"If it’s a person’s name (Aldercy), the meaning depends on the individual or family origin.","zh":"如果它是人名（Aldercy），含义会取决于个人或家族来源。"}]}],"phonetic":"/ˈɔːldərsi/","extraExplanation":["你可以告诉我它出现的语境吗（例如一句话、学科、国家/地区、是否为人名/地名/产品名）？我就能更准确判断你想查的是哪个词。","如果你想查相近词：\n- adultery /əˈdʌltəri/：婚外性关系（法律/宗教语境更常见）\n- alder /ˈɔːldər/：赤杨树（常见于植物与地名）\n- aldehyde /ˈældəhaɪd/：醛（化学名词）"]}
{"word":"alderflies","summary":{"en":"Alderflies are aquatic insects whose larvae live in freshwater; the plural of “alderfly.”","zh":"Alderflies 指生活在淡水附近的水生昆虫（alderfly）的复数，幼虫在水中生活，常见于溪流与河岸周边。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of aquatic insect (alderfly), whose larvae live in freshwater and are often used as fish bait; “alderflies” is the plural form.","zh":"一种水生昆虫（石蛉目/广义水蜉蝣类中的“alderfly”，中文常译作“泥蛉/水蛉”等），幼虫生活在淡水中，常被用作钓鱼饵；“alderflies”为复数形式。"},"examples":[{"en":"Alderflies hatch near streams, so you often see them around riverbanks in spring.","zh":"蛉虫常在溪流附近羽化，所以春天在河岸边经常能看到它们。"},{"en":"The angler bought a box of alderflies to use as bait.","zh":"钓鱼的人买了一盒蛉虫当鱼饵。"},{"en":"Insects like alderflies and mayflies can tell us a lot about water quality.","zh":"像蛉虫和蜉蝣这类昆虫能反映很多水质信息。"}]}],"synonyms":["alderfly (singular)","Sialidae (family name)","megalopteran insects"],"phonetic":"/ˈɔldərˌflaɪz/","extraExplanation":["“Alderfly”这个名字来自它们常出现在河岸边的桤木（alder）附近，但并不表示它们只生活在桤木旁。","它们的幼虫在水中生活、以小型水生生物为食；成虫通常寿命较短，常被视为生态监测中“清洁水体”的指示生物之一。","容易混淆：alderfly（蛉虫）与 dobsonfly（大蚁蛉/鱼蛉）和 fishfly（鱼蛉的一类）外形相近，但并非同一种昆虫。"]}
{"word":"alderfly","summary":{"en":"An alderfly is a water-associated insect; its larvae live in water and adults are often seen near streams.","zh":"alderfly 指与水域相关的昆虫：幼虫生活在水中，成虫常见于溪流等水边。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a dark, soft-bodied insect whose larvae live in water; adult alderflies are often found near streams and lakes","zh":"（广义）鱼蛉：一种颜色较深、身体柔软的昆虫；其幼虫生活在水中，成虫常见于溪流和湖泊附近"},"examples":[{"en":"We saw an alderfly resting on a rock by the river.","zh":"我们在河边的一块石头上看到一只鱼蛉停着。"},{"en":"Fishermen sometimes use alderfly larvae as bait.","zh":"钓鱼的人有时会用鱼蛉幼虫做鱼饵。"}]}],"synonyms":["fishfly","dobsonfly (related)"],"phonetic":"/ˈɔl.dɚˌflaɪ/","extraExplanation":["“Alderfly”由“alder（桤木）+ fly（苍蝇/会飞的昆虫）”组成，但它并不是“苍蝇（true fly）”。英文里很多昆虫名都用fly结尾，表示“会飞的昆虫”，不一定属于苍蝇那一类。","在更严谨的昆虫学语境里，alderfly通常指广义“鱼蛉类”中的一种（隶属 Megaloptera 目、Sialidae 科）。日常英语里也可能被更宽泛地用来指与之相近的水生昆虫。"]}
{"word":"alderliefest","summary":{"en":"An archaic word meaning either “dearest of all” (adjective) or “most willingly/most gladly” (adverb).","zh":"一个古语词，可表示“最亲爱的”（形容词）或“最乐意地/非常情愿地”（副词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic) Dearest; most beloved of all.","zh":"（古语）最亲爱的；最受宠爱的。"},"examples":[{"en":"In the old ballad, he calls her his alderliefest lady.","zh":"在那首古老的民谣里，他称她为自己最亲爱的女士。"},{"en":"She was his alderliefest friend, above all others.","zh":"她是他最亲爱的朋友，胜过所有人。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Archaic) Most willingly; with the greatest pleasure.","zh":"（古语）最乐意地；非常情愿地。"},"examples":[{"en":"I would alderliefest help you, if I could.","zh":"如果我能的话，我会非常乐意帮助你。"},{"en":"He would alderliefest stay at home rather than argue.","zh":"他非常情愿待在家里，也不想争吵。"}]}],"synonyms":["dearest","most beloved","most gladly","most willingly","with pleasure"],"phonetic":"/ˈɔldɚˌlifɪst/","extraExplanation":["“alderliefest”是中古英语/早期近代英语里的强调形式：alder- 表示“在所有之中（of all）”，lief 表示“令人喜爱、乐意”。合起来就是“最……的（在所有之中）”。","如今几乎不用于现代日常英语，多见于古诗、史诗、民谣或仿古文风。现代英语通常用 “dearest / most beloved” 或 “most gladly / most willingly” 来表达。"]}
{"word":"alderling","summary":{"en":"A very rare word meaning an old person or elder; usually a variant of “elderling.”","zh":"一个很罕见的词，指老人/长者；通常被看作“elderling”的异体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic) An old person; an elder (a variant spelling of “elderling”).","zh":"（罕见/古用）老人；长者（常被视为“elderling”的异体拼写）。"},"examples":[{"en":"In the village tale, an alderling warns the children not to wander into the marsh at night.","zh":"在那个村庄传说里，一位老人告诫孩子们夜里不要走进沼泽。"},{"en":"The poem speaks of alderlings who remember the hard winters of earlier days.","zh":"那首诗写到一些老人仍记得往昔艰难的寒冬。"}]}],"synonyms":["elder","old-timer","senior","elderly person"],"phonetic":"/ˈɔldərlɪŋ/","extraExplanation":["“alderling”在现代英语中几乎不用，读者更常见的是“elderling”（意为“年长者/长辈”）。如果你是在现代文章或作业里遇到它，很可能是拼写变体、方言写法，或是误写。","不要把它和“alder”（桤木，一种树）混淆；也别和“underling”（小喽啰/下属）混淆——这两个词在现代英语里更常见。"]}
{"word":"Alderman","summary":{"en":"An alderman is an elected local lawmaker on a city/town council (and historically, a senior civic leader).","zh":"Alderman 指（某些地区的）市议员/地方议会议员；历史上也指资深的城市自治官员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An elected member of a city or town council in some countries (especially in the U.S. and the U.K.).","zh":"（某些国家的）市议员；地方议会议员（尤指美国、英国的一些地区）。"},"examples":[{"en":"The alderman proposed a new plan to improve public transportation.","zh":"这位市议员提出了一项改善公共交通的新方案。"},{"en":"Residents spoke to their alderman about the neighborhood’s safety concerns.","zh":"居民向他们的市议员反映了社区的安全问题。"}]},{"partOfSpeech":"n.","definition":{"en":"In historical use, a senior local official or civic leader in an English-speaking town or city.","zh":"（历史用法）地方高级官员；城市自治团体中的资深领袖。"},"examples":[{"en":"In old records, aldermen were listed as leading figures in the town government.","zh":"在旧档案中，市议员常被列为镇政府的重要人物。"},{"en":"The guild hall displayed portraits of former aldermen.","zh":"行会大厅里陈列着历任市议员的肖像。"}]}],"synonyms":["city council member","councilor","municipal legislator","local representative"],"phonetic":"/ˈɔldɚmən/","extraExplanation":["在美国，“alderman”是否使用取决于城市体制：有些城市用“alderman”，有些则用“city council member/councilor”。现代语境里，为了性别中立，也常用“council member”。","词源来自古英语，原意与“长者、德高望重的人”有关，因此带有“资深、受尊敬的地方领袖”的历史色彩。"]}
{"word":"alderman","summary":{"en":"An alderman is a local elected official, usually a member of a city or town council.","zh":"alderman 指地方民选官员，通常是市/镇议会议员（部分地区用法或属历史称呼）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An elected member of a city or town council in some places, especially in the U.S. or historically in the U.K.","zh":"（某些地区，尤指美国或英国历史上）市议会/镇议会的民选议员。"},"examples":[{"en":"She spoke with an alderman about fixing the streetlights in her neighborhood.","zh":"她和一位市议员谈了谈修理社区路灯的问题。"},{"en":"The aldermen voted on the new housing policy at the council meeting.","zh":"市议员们在议会会议上对新的住房政策进行了表决。"}]},{"partOfSpeech":"n.","definition":{"en":"A senior local official in some older British systems; historically, a member of a municipal governing body.","zh":"（旧时英国制度）资深地方官员；历史上指市政管理机构成员。"},"examples":[{"en":"In older records, the town was governed by a mayor and several aldermen.","zh":"在较早的档案中，这个城镇由市长和几位市政官员（aldermen）共同治理。"}]}],"synonyms":["council member","city councilor","councillor","local legislator"],"phonetic":"/ˈɔldɚmən/","extraExplanation":["词源提示：alderman 来自古英语，原意接近“长者/有地位的人”，所以带有“资深、受尊敬的地方治理者”的历史色彩。","用法提醒（美式语境）：在美国，不同城市对 alderman 的称呼和权力范围不完全一样；有的城市改用 city council member、councilor 等更通用的说法。","文化/文学小知识：在一些以城市政治为背景的英文小说、戏剧或新闻报道中，alderman 常与地方选举、社区议题（治安、道路、住房等）一起出现。"]}
{"word":"aldermanate","summary":{"en":"A formal word meaning the office or term of an alderman (city council member).","zh":"较正式用语，指市议员（alderman）的职位或任期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the office, position, or term of service of an alderman (a member of a city or town council).","zh":"（市镇议会）市议员（alderman）的职位、任期或在任期间。"},"examples":[{"en":"She served one four-year term in the aldermanate before running for mayor.","zh":"她在担任市议员的任期内服务了四年，之后竞选市长。"},{"en":"Reformers pushed for changes in the aldermanate to reduce corruption.","zh":"改革者推动对市议员体系进行调整，以减少腐败。"}]}],"synonyms":["office of alderman","aldermanship","council seat","term in office"],"phonetic":"/ˈɔldɚmənət/","extraExplanation":["“aldermanate”是比较少见、偏正式的词，常见于历史叙述、法律/政府文件或学术写作中。日常表达更常用“city council”“council seat/term”“serving as an alderman”。","“alderman”一词在不同地区制度不完全一样：在英国多为历史或荣誉性头衔；在美国一些城市曾较常见，但许多地方现在更常用“councilmember/city councilor”等中性称呼。"]}
{"word":"aldermancy","summary":{"en":"Aldermancy means the office or term of an alderman, or the body/system of aldermen in local government.","zh":"Aldermancy 指市议员（alderman）的职位或任期，也可指市议员群体/制度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the office, position, or term of an alderman (a local government official); sometimes the system or body of aldermen in a city","zh":"（市政）参议员/市议员（alderman）的职位、任期；有时也指由这些官员组成的机构或制度"},"examples":[{"en":"She ran for aldermancy to represent her neighborhood at city hall.","zh":"她竞选市议员职位，希望在市政厅代表自己的社区。"},{"en":"After one term of aldermancy, he returned to private law practice.","zh":"担任一届市议员任期后，他回到私人律师执业。"},{"en":"The report criticized the city’s aldermancy for poor oversight of public spending.","zh":"这份报告批评该市的市议员机构对公共开支监督不力。"}]}],"synonyms":["office of alderman","aldermanship","city council seat","municipal office"],"phonetic":"/ˈɔldərmənsi/","extraExplanation":["“aldermancy”较为少见，常见于较正式或历史性语境。美国一些城市过去或现在会使用“alderman”（市议员/区议员）这一称呼，但也有城市改用更中性、通用的“city council member”。在英国历史语境中，alderman也与地方自治和行会传统有关。"]}
{"word":"aldermaness","summary":{"en":"A rare, old-fashioned word meaning a female alderman or an alderman’s wife.","zh":"一个少见的旧式词，指“女市议员”或“市议员的妻子”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) A woman who holds the office of alderman (a city official).","zh":"（古语）女市议员；担任 alderman（市政官员/市议员）职务的女性。"},"examples":[{"en":"In some old records, an aldermaness is listed among the city officials.","zh":"在一些旧档案中，会把 aldermaness 列在市政官员名单里。"},{"en":"The term aldermaness is now rare and mostly found in historical writing.","zh":"aldermaness 这个词现在很少用，多见于历史性写作中。"}]},{"partOfSpeech":"n.","definition":{"en":"(Archaic) The wife of an alderman.","zh":"（古语）市议员（alderman）的妻子。"},"examples":[{"en":"The aldermaness hosted a dinner for visiting guests, according to the diary.","zh":"日记里写道，那位 aldermaness 设宴招待来访宾客。"},{"en":"Today, people would usually say “the alderman’s wife” instead of aldermaness.","zh":"如今人们通常说“the alderman’s wife”，而不是 aldermaness。"}]}],"synonyms":["female alderman","alderman’s wife","councilwoman (modern equivalent)"],"phonetic":"/ˈɔːldərmənɪs/","extraExplanation":["“alderman”在英美历史上常指地方城市治理中的资深官员/市议员。英语里曾用“-ess”构成女性对应词（如 actress），但现代英语更倾向用中性称呼（如 alderman 或 council member），因此“aldermaness”带有明显的旧式/历史色彩。"]}
{"word":"aldermanic","summary":{"en":"“Aldermanic” means “connected with an alderman or city council politics.”","zh":"“aldermanic”意为“与市议员或市议会政治相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an alderman (a city or town official, often an elected member of a city council).","zh":"与市议员（alderman；城市或城镇的官员，常为市议会民选成员）有关的；市议员的。"},"examples":[{"en":"She wrote an aldermanic report about zoning changes in the neighborhood.","zh":"她写了一份有关社区分区变更的市议员报告。"},{"en":"The aldermanic election drew a lot of local attention.","zh":"这次市议员选举引起了很多本地关注。"}]}],"synonyms":["council","municipal","civic","local-government"],"phonetic":"/ˌɔl.dɚˈmæn.ɪk/","extraExplanation":["“Aldermanic”多见于美国或英国的正式/新闻语体，常用来修饰与市议员职位或市议会政治相关的事物（如 aldermanic race/election、aldermanic district、aldermanic privilege）。","在美国一些城市（如芝加哥），“alderman”是市议会议员的传统称呼；而在很多地方如今更常用的是“councilmember / city councilor”，所以“aldermanic”也带有一点制度/历史色彩。"]}
{"word":"aldermanical","summary":{"en":"A formal adjective meaning “connected with an alderman or the city-council office.”","zh":"较正式的形容词，表示“与市议员或市议会职位/事务相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an alderman (a member of a city or town council) or to the office, duties, or actions of aldermen.","zh":"与市议员（alderman，市镇议会成员）有关的；与市议员职位、职责或行为有关的。"},"examples":[{"en":"The newspaper criticized the aldermanical decision to approve the new zoning plan.","zh":"报纸批评了市议员层面做出的决定：批准新的分区规划。"},{"en":"She worked in the aldermanical office to help residents report neighborhood problems.","zh":"她在市议员办公室工作，帮助居民反映社区问题。"}]}],"synonyms":["aldermanic","council-related","municipal","civic"],"phonetic":"/ˌɔldɚˈmænɪkəl/","extraExplanation":["“aldermanical”来自“alderman”（市议员）+ 形容词后缀“-ical”。在美国语境里，alderman常见于一些城市（如芝加哥）的市议会称呼；在英国，“alderman”多为历史或荣誉性称号，现代地方政府更常用“councillor”。因此该词多见于正式、法律或新闻写作中。","相关名词：alderman（市议员）；相关表达：aldermanic（更常见的同义形容词形式）、city council / council member（更通用的说法）。"]}
{"word":"aldermanity","summary":{"en":"A rare word meaning the office or collective body of aldermen (city officials).","zh":"一个罕见词，指市议员的职位或市议员群体/体制。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the office, position, or collective body of aldermen (city officials); aldermanic government (rare/old-fashioned).","zh":"（罕见/偏旧）市议员（alderman）的职位、任期或市议员群体；由市议员构成的市政管理机构。"},"examples":[{"en":"In the 19th century, local papers often criticized the aldermanity for corruption.","zh":"在19世纪，当地报纸常常批评市议员团体（aldermanity）腐败。"},{"en":"The reform aimed to limit the power of the aldermanity in city contracts.","zh":"这项改革旨在限制市议员群体在市政合同中的权力。"}]}],"synonyms":["the aldermen","the city council","aldermanic body","municipal government"],"phonetic":"/ˌɔldərˈmænəti/","extraExplanation":["“aldermanity”在现代英语里非常少见，很多时候人们会用更常见的表达来代替，例如：the aldermen（市议员们）、the aldermanic body/board（市议员机构）、the city council（市议会）。","“alderman”在英美语境中历史用法不同：英国一些城市曾用alderman指资深市政官员；美国（尤其过去）一些城市把选区代表称为alderman，但如今更常见的是councilmember/city councillor等说法。","构词上可理解为alderman + -ity（表示“……的性质/整体/状态”），因此有“市议员整体/体制”的含义。"]}
{"word":"aldermanlike","summary":{"en":"aldermanlike = dignified or official in the way a local council member might be.","zh":"aldermanlike＝有市议员/地方官员那种庄重、正式的作风或气质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the manner or qualities of an alderman (a local government official), often suggesting a dignified, formal, or civic-minded style.","zh":"具有市议员（地方政府官员）那种举止或特质的；常暗示庄重、正式或有公民风范。"},"examples":[{"en":"He walked in with an aldermanlike calm, as if the meeting already belonged to him.","zh":"他带着一种市议员般的沉稳走进来，仿佛这场会议早已在他掌控之中。"},{"en":"The newspaper described her aldermanlike tone when she spoke about budgets and public safety.","zh":"报纸形容她谈到预算和公共安全时的语气很“市议员范儿”，庄重而正式。"}]}],"synonyms":["official","dignified","statesmanlike","civic-minded","formal"],"phonetic":"/ˈɔldərmənˌlaɪk/","extraExplanation":["“alderman”在英语里通常指地方议会或市政机构中的官员（不同国家/地区制度不完全相同）。因此“aldermanlike”多用于描写一种“官员式、端庄、讲公共事务”的气质或腔调，常见于新闻写作或文学描写中，有时也带一点轻微的讽刺意味（像官腔、像政客）。"]}
{"word":"aldermanly","summary":{"en":"Alder manly means “related to an alderman” or, more loosely, “dignified/official in an old-fashioned way.”","zh":"aldermanly 指“与市议员有关的”，也可引申为“带旧式官员气质的、庄重正式的（常带幽默）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an alderman (a member of a city council), or typical of an alderman’s role and duties.","zh":"与市议员（城市议会成员）有关的；具有市议员职责或特点的。"},"examples":[{"en":"The reporter described the meeting as full of aldermanly debate about budgets and zoning.","zh":"记者形容那场会议充满了市议员式的辩论，讨论预算和分区规划。"},{"en":"She took on an aldermanly tone when talking about local services and public safety.","zh":"她谈到地方服务和公共安全时，语气显得很“市议员式”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Dignified, formal, or respectable in a slightly old-fashioned way (often used humorously).","zh":"（略带旧式感，常带幽默语气）庄重的、正式的、体面的。"},"examples":[{"en":"He tried to look aldermanly in his suit, but his bright sneakers gave him away.","zh":"他穿西装想显得很庄重体面，但亮色运动鞋还是“出卖”了他。"},{"en":"They joked about his aldermanly manners at the family dinner.","zh":"他们在家庭聚餐时开玩笑说他举止特别“官派/体面”。"}]}],"synonyms":["civic","municipal","council-related","official","dignified"],"phonetic":"ˈɔldərmənli","extraExplanation":["“Alderman”在英语里传统上指城市或城镇议会的成员，历史上常见于英国及北美一些城市的市政体系；在当代美国，很多地方更常用“council member / city councilor”。因此“aldermanly”也带有一点旧时代市政官员的色彩，实际写作中较少见，多用于描写语气、风格或场面。"]}
{"word":"aldermanries","summary":{"en":"“Aldermanries” means the offices/terms or electoral districts of aldermen (city council members).","zh":"“Aldermanries”指市议员（alderman）的职位/任期，或其对应的选区（区/分区）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of aldermanry) the office, term, or district/ward of an alderman (a city or town council member).","zh":"（aldermanry 的复数）市议员/镇议员（alderman）的职位、任期，或其所代表的选区（区/分区）。"},"examples":[{"en":"She ran for an aldermanry in Chicago’s city government.","zh":"她竞选芝加哥市政府的一个市议员席位。"},{"en":"The reform changed how aldermanries were drawn across the city.","zh":"这项改革改变了全市各个市议员选区的划分方式。"}]}],"synonyms":["aldermanic seats","aldermanic wards","council seats","municipal districts"],"phonetic":"/ˈɔldərmənri/","extraExplanation":["“aldermanry”比较少见，更常见的说法是“the office of alderman / an aldermanic seat（市议员席位）/ an aldermanic ward（市议员选区）”。","“alderman”这个职位在不同国家和城市制度中含义不完全一样：在一些美国城市里相当于市议会成员；在英国传统语境中也有历史上的“alderman（市政官员）”用法，带有较强的历史色彩。"]}
{"word":"aldermanry","summary":{"en":"Aldermanry means the office or term of an alderman, or (more formally) the group of aldermen.","zh":"Aldermanry 指市议员的职位/任期，或（较正式地）市议员群体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the office, rank, or term of service of an alderman (a local elected official in a city or town)","zh":"市议员（或镇议员）的职位、身份（级别）或任期"},"examples":[{"en":"She served two terms in the aldermanry before running for mayor.","zh":"她担任过两届市议员，之后竞选市长。"},{"en":"Corruption scandals weakened public trust in the aldermanry.","zh":"腐败丑闻削弱了公众对市议员职位的信任。"}]},{"partOfSpeech":"n.","definition":{"en":"the group or body of aldermen as a whole (used especially in older or formal writing)","zh":"（尤用于较旧或正式文体）市议员群体；市议员会议（整体）"},"examples":[{"en":"The aldermanry debated the new housing ordinance late into the night.","zh":"市议员们就新的住房条例辩论到深夜。"},{"en":"A petition was presented to the aldermanry for review.","zh":"一份请愿书被提交给市议员团体审议。"}]}],"synonyms":["aldermanship","city council (close in meaning)","municipal council (close in meaning)"],"phonetic":"/ˈɔldɚmənri/","extraExplanation":["“aldermanry”较少用于日常口语，更常见的是用“city council”（市议会）或直接说“the aldermen / council members”。","词源上由“alderman（市议员）+ -ry（表示身份、群体或职务的后缀）”构成，因此常指“职位/任期”或“群体整体”。在英美历史与地方政治语境中更常见。"]}
{"word":"aldermanship","summary":{"en":"Aldermanship means holding the office or term of an alderman (a local government official).","zh":"Aldermanship 指担任市政议员（alderman）的职务、身份或任期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the position, rank, or term of office of an alderman (a local government official)","zh":"市政议员（alderman）的职位、身份或任期"},"examples":[{"en":"After years of community work, she ran for aldermanship in her district.","zh":"在多年社区服务之后，她在所在选区竞选市政议员职位。"},{"en":"His aldermanship lasted four years before he decided not to run again.","zh":"他的市政议员任期持续了四年，之后他决定不再连任。"}]},{"partOfSpeech":"n.","definition":{"en":"the group of aldermen as a governing body (less common)","zh":"（较少用）市政议员团体；市政议员作为整体的管理机构"},"examples":[{"en":"The mayor met with the aldermanship to discuss the new housing plan.","zh":"市长与市政议员团体会面，讨论新的住房计划。"}]}],"synonyms":["aldermanic office","council seat","city council position","councillorship (in many UK contexts)"],"phonetic":"/ˈɔldɚmənˌʃɪp/","extraExplanation":["“alderman”在不同地区含义不完全一样：在美国一些城市（如芝加哥）常指市议会成员；在英国传统上与市政自治历史相关，很多地方已改用更常见的“councillor”（议员）。因此“aldermanship”多见于较正式或历史语境。","词源上，“-ship”常表示“身份/职位/状态”（如 friendship, leadership），所以 aldermanship 直观理解就是“当 alderman 的身份或职务”。"]}
{"word":"Aldermaston","summary":{"en":"Aldermaston is a place name: a village in Berkshire, England, often mentioned in connection with the nearby Atomic Weapons Establishment and anti-nuclear marches.","zh":"Aldermaston 是地名：英国英格兰伯克郡的村庄，常因附近的原子武器机构（AWE）及反核游行而被提及。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a village and civil parish in Berkshire, England, known especially for its connection to the UK’s Atomic Weapons Establishment (AWE) nearby.","zh":"奥尔德马斯顿：英国英格兰伯克郡的一个村庄与民政教区，尤其因附近的英国原子武器研究与制造机构（AWE）而为人所知。"},"examples":[{"en":"Aldermaston is a small village in Berkshire, west of London.","zh":"奥尔德马斯顿是伯克郡的一个小村庄，位于伦敦以西。"},{"en":"The protest march went to Aldermaston to speak out against nuclear weapons.","zh":"抗议游行前往奥尔德马斯顿，表达对核武器的反对。"}]}],"synonyms":["AWE Aldermaston (related term)"],"phonetic":"/ˈɔːldərˌmæsən/","extraExplanation":["“Aldermaston”在英语语境中常作为地名出现。20世纪50—60年代，“Aldermaston Marches（奥尔德马斯顿游行）”是英国著名的反核游行活动之一，通常从伦敦出发前往奥尔德马斯顿附近的相关设施。","AWE（Atomic Weapons Establishment）常被称为“AWE Aldermaston”，因此在新闻、历史或政治讨论中，“Aldermaston”有时会被用来间接指代该核武器机构或与核政策相关的议题。"]}
{"word":"aldermen","summary":{"en":"Aldermen are members of a local city or town council; historically, the term can refer to senior civic officials.","zh":"Aldermen 指市镇议会议员；在历史语境中也可指资深的市政官员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Elected members of a city or town council (plural of *alderman*), especially in the U.S. and Canada.","zh":"（*alderman* 的复数）市镇议会议员；（尤指）美国、加拿大的市议员。"},"examples":[{"en":"Several aldermen voted against the new housing plan.","zh":"几位市议员投票反对新的住房方案。"},{"en":"The mayor met with the aldermen to discuss the budget.","zh":"市长与市议员会面讨论预算。"}]},{"partOfSpeech":"n.","definition":{"en":"Senior local officials in some places (especially historically in the U.K.); today often a traditional or ceremonial title.","zh":"（尤指历史上在英国）资深地方官员；如今常为传统或礼仪性头衔。"},"examples":[{"en":"In older records, the city’s aldermen were important civic leaders.","zh":"在较早的记录中，这座城市的市政领袖包括多位资深市政官（aldermen）。"},{"en":"The book describes how aldermen once governed parts of the town.","zh":"这本书描述了过去市政官（aldermen）如何治理城镇的一些事务。"}]}],"synonyms":["city council members","council members","city councillors","municipal legislators"],"phonetic":"/ˈɔldərmən/","extraExplanation":["在现代北美语境中，*alderman* 常指“市议员”，但有些城市已改用更中性的 *council member / city councillor*。不同城市的制度与权限不完全一样，有的 *alderman* 代表特定选区（ward）。","词源来自古英语，原意与“长者、资深人士”有关，因此在英国历史语境中常带有“资深市政人士”的色彩。"]}
{"word":"aldern","summary":{"en":"“Aldern” is usually a misspelling; the intended word is typically “alder,” a tree common near water, or its wood.","zh":"“aldern”通常是拼写错误；多半想表达的是“alder（桤木/赤杨）”这种近水而生的树，或其木材。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“Aldern” is not a common standard English word; it is most often a misspelling of “alder,” a kind of tree.","zh":"“aldern”不是常见的标准英语单词；它最常见的情况是把“alder（桤木/赤杨）”拼错了。"},"examples":[{"en":"Did you mean “alder” (the tree)?","zh":"你是不是想写“alder（桤木/赤杨）”这种树？"}]},{"partOfSpeech":"n.","definition":{"en":"an alder tree (a tree that often grows near rivers and wetlands)","zh":"桤木/赤杨（常生长在河边、湿地附近的一种树）"},"examples":[{"en":"Alders grow well in wet soil near streams.","zh":"桤木很适合在小溪附近的湿土里生长。"},{"en":"The trail passed a line of alder trees along the river.","zh":"小路沿着河边经过一排桤木。"}]},{"partOfSpeech":"n.","definition":{"en":"wood from an alder tree, used for furniture and smoking food","zh":"桤木木材（可用于家具，也常用于熏制食物）"},"examples":[{"en":"They smoked salmon over alder wood.","zh":"他们用桤木来熏三文鱼。"}]}],"synonyms":["alder"],"phonetic":"/ˈɔldɚ/","extraExplanation":["“alder”在英语里更常见；在北美烹饪语境中，尤其常见到“alder-smoked（用桤木烟熏的）”，比如alder-smoked salmon（桤木烟熏三文鱼）。","如果你是在读文学/诗歌，alder常和“河岸、湿地、溪流”等意象一起出现，用来营造潮湿、野生的自然场景。"]}
{"word":"Alderney","summary":{"en":"Alderney is a Channel Island (a British Crown Dependency) near France, known as a small island within the Bailiwick of Guernsey.","zh":"Alderney（奥尔德尼岛）是靠近法国的海峡群岛之一，属于英国王室属地，隶属根西行政区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small British Crown Dependency island in the Channel Islands, located in the English Channel near the coast of Normandy (France).","zh":"奥尔德尼岛：英吉利海峡中的海峡群岛之一，靠近法国诺曼底海岸，属于英国王室属地（Crown Dependency）。"},"examples":[{"en":"Alderney is part of the Bailiwick of Guernsey.","zh":"奥尔德尼岛属于根西行政区（Bailiwick of Guernsey）。"},{"en":"Many travelers visit Alderney for its coastal walks and wildlife.","zh":"许多游客到奥尔德尼岛是为了海岸徒步和观赏野生动物。"}]},{"partOfSpeech":"adj.","definition":{"en":"(In place names) Something relating to Alderney, such as its people, history, or local institutions (e.g., “Alderney Airport”).","zh":"（用于地名/机构名）与奥尔德尼岛有关的事物，如当地人民、历史或机构（如“奥尔德尼机场”）。"},"examples":[{"en":"They took a flight to Alderney Airport from Guernsey.","zh":"他们从根西岛乘飞机到奥尔德尼机场。"},{"en":"An Alderney resident told us stories about island life.","zh":"一位奥尔德尼岛居民给我们讲了岛上生活的故事。"}]}],"synonyms":["Alderney Island","(related) Channel Islands","(related) Guernsey"],"phonetic":"/ˈɔldɚni/","extraExplanation":["“Alderney”常被视为专有名词（地名）。奥尔德尼岛虽与英国关系密切，但并不属于英国本土（UK），而是“王室属地”，在法律与行政上有一定自治。","海峡群岛（Channel Islands）在文化上受英法两边影响；奥尔德尼岛地理上更靠近法国，但历史上与英格兰王室联系深。"]}
{"word":"alderney","summary":{"en":"Alderney is mainly a place name: a Channel Island near France, linked to Guernsey. Historically, it can also refer to a type of Channel Island dairy cow.","zh":"Alderney主要是地名，指海峡群岛之一的奥尔德尼岛（与根西相关）。历史上也可指与海峡群岛有关的奶牛品类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small island in the Channel Islands, located in the English Channel and connected to the Bailiwick of Guernsey (a British Crown Dependency).","zh":"奥尔德尼岛：英吉利海峡中的海峡群岛之一，行政上隶属根西行政区（英国王室属地）。"},"examples":[{"en":"Alderney is known for its rugged coastline and strong tides.","zh":"奥尔德尼岛以崎岖的海岸线和强劲的潮汐闻名。"},{"en":"She took a ferry from Guernsey to Alderney.","zh":"她从根西乘渡轮去了奥尔德尼岛。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical) A cow or cattle associated with the Channel Islands, especially once linked to Alderney, famous for rich milk; in modern use it’s often loosely grouped with “Channel Island cattle.”","zh":"（历史用法）奥尔德尼牛：曾与奥尔德尼岛相关的海峡群岛牛种之一，以牛奶浓厚著称；现代用法中常被笼统归入“海峡群岛奶牛”。"},"examples":[{"en":"Older texts sometimes mention “Alderney cows” for their creamy milk.","zh":"较早的文献有时会提到“奥尔德尼牛”，强调其牛奶的醇厚。"}]}],"synonyms":["Channel Island (context)"],"phonetic":"/ˈɔldərni/","extraExplanation":["“Alderney”多作为专有名词使用（地名），首字母通常大写。它属于“Channel Islands（海峡群岛）”，地理位置靠近法国诺曼底海岸，但政治上与英国王室属地相关。","在一些19世纪到20世纪早期的英语里，“Alderney cow(s)”常被用来指代海峡群岛的优质奶牛，但严格的品种归属在历史上有混用或变化；现代更常见的是“Jersey（泽西牛）”和“Guernsey（根西牛）”。"]}
{"word":"alders","summary":{"en":"“Alders” means more than one alder tree, often found near rivers and wetlands.","zh":"“Alders”指多株桤木（alder 的复数），常见于河岸与湿地附近。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of alder: trees (genus Alnus) that often grow near water and have small cone-like fruits.","zh":"alder 的复数：桤木（榛属 Alnus）的树木，常生长在水边，结小而像松果的果序。"},"examples":[{"en":"Alders grow well along rivers and wetlands.","zh":"桤木在河岸和湿地附近长得很好。"},{"en":"We walked through a grove of alders by the stream.","zh":"我们沿着小溪穿过一片桤木林。"}]}],"synonyms":["alder trees","Alnus (scientific name)"],"phonetic":"ˈɔldərz","extraExplanation":["“alder/桤木”在英语里既可指一种树，也常作为生态环境描写中的意象（湿地、河岸、凉爽阴湿的林地）。","桤木与某些固氮细菌共生，能改善贫瘠土壤，因此在河岸恢复、护坡和造林中较常见。","英文里常见搭配：alder tree（桤木树）、alder grove（桤木林）、alder catkins（桤木花序/柔荑花序）。"]}
{"word":"Aldershot","summary":{"en":"Aldershot is a town in Hampshire, England, famous for its British Army connections.","zh":"Aldershot（奥尔德肖特）是英国英格兰汉普郡的一座城镇，以与英国陆军的联系而著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A town in Hampshire, England, known for its long association with the British Army (often called a “garrison town”).","zh":"英国英格兰汉普郡的一座城镇，以与英国陆军长期密切相关而闻名（常被称为“军营城/驻军城镇”）。"},"examples":[{"en":"He was stationed near Aldershot during his training.","zh":"他在受训期间被派驻在奥尔德肖特附近。"},{"en":"Aldershot has a strong military history.","zh":"奥尔德肖特有深厚的军事历史。"}]}],"synonyms":["a garrison town (description)"],"phonetic":"/ˈɔldɚˌʃɑt/","extraExplanation":["Aldershot 常与 British Army（英国陆军）联系在一起，19 世纪起发展为重要军营与训练基地，因此在英国文化语境里常被用来指“军队气息浓厚的地方”。","在旅行/地理语境中，它靠近 Farnborough、Guildford，距离伦敦不远；在英式英语中读音常见为 /ˈɔːldərʃɒt/，但此处按美式 IPA 给出近似读法。"]}
{"word":"Alderson","summary":{"en":"Alderson is most commonly a surname, and it can also be a place name (a town/community).","zh":"Alderson最常见为姓氏，也可作地名（某些地区的城镇/社区名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"（人名）奥尔德森；一种姓氏。"},"examples":[{"en":"Ms. Alderson will lead the meeting today.","zh":"奥尔德森女士今天将主持会议。"},{"en":"I met Dr. Alderson at the conference.","zh":"我在会议上见到了奥尔德森博士。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name (a town/community) in some English-speaking regions, especially in the U.S.","zh":"（地名）奥尔德森；英语国家中一些地区的地名，尤其在美国。"},"examples":[{"en":"They drove through Alderson on their way to the mountains.","zh":"他们去山里途中开车经过奥尔德森。"},{"en":"Alderson is a small town with a quiet pace of life.","zh":"奥尔德森是个节奏安静的小镇。"}]}],"phonetic":"/ˈɔːldərsən/","extraExplanation":["“Alderson”常见于英语姓氏体系，结构上往往可理解为“某人的儿子（-son）”。在历史上，许多此类姓氏源自父名或绰号，后来固定为家族姓氏。","作为地名时，通常来自早期定居者的姓氏或当地历史人物的名字，因此不同地区可能都有名为“Alderson”的城镇或社区。"]}
{"word":"alderwoman","summary":{"en":"An alderwoman is a female member of a city council where the title “alderman” is used.","zh":"alderwoman 指在使用“alderman”头衔的地区担任市/镇议会成员的女性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A woman who is an elected member of a city or town council (especially in places where the title “alderman” is used).","zh":"（尤指仍使用“alderman”这一称谓的地区）女市议员；女镇议员。"},"examples":[{"en":"She served as an alderwoman for eight years and worked on affordable housing.","zh":"她担任女市议员八年，致力于可负担住房议题。"},{"en":"The alderwoman spoke at the public meeting about road safety.","zh":"这位女市议员在公众会议上就道路安全发表了讲话。"}]}],"synonyms":["councilwoman","city council member","councilor"],"phonetic":"/ˈɔldɚˌwʊmən/","extraExplanation":["“alderwoman”是“alderman”的女性形式，但在很多英语地区，“alderman/alders”这个头衔已经逐渐被更中性的“councilor/councillor”（议员）或“city council member”（市议会议员）取代。","在美国，不同城市对“alderman/alders”的用法不一样：有的城市仍用作正式官职名称；有的则只在历史或新闻语境中出现。写作时可根据当地官方称谓选择：如 Chicago 常见 “alderperson”（更中性），而有些城市仍写 “alderman”。"]}
{"word":"alderwomen","summary":{"en":"A plural noun meaning female members of a city/town council.","zh":"复数名词，指在市/镇议会任职的女性议员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Women who serve as elected members of a city or town council (plural of alderwoman).","zh":"担任市/镇议会民选议员的女性（alderwoman 的复数）。"},"examples":[{"en":"The alderwomen voted to approve the new housing plan.","zh":"这些女市议员投票通过了新的住房计划。"},{"en":"Several alderwomen met with residents to discuss public safety.","zh":"几位女市议员与居民会面，讨论公共安全问题。"}]}],"synonyms":["female city council members","council members","councilors"],"phonetic":"/ˈɔldərˌwʊmən/","extraExplanation":["“alderwomen”是“alderwoman”的复数形式，常见于美国一些城市的地方政府语境中，对应男性形式是“aldermen / alderman”。不过在当代英语里，很多地区更倾向使用性别中立的说法，如“city council members / councilors”。","拼写提示：更常见的单数写法是“alderwoman”，复数为“alderwomen”。如果你想表达“市议员（不分性别）”，可以用“council members”。"]}
{"word":"ALDH","summary":{"en":"ALDH usually means aldehyde dehydrogenase—enzymes (or related genes like ALDH2) involved in breaking down aldehydes, especially in alcohol metabolism.","zh":"ALDH 通常指“醛脱氢酶”（或相关基因如 ALDH2），负责分解醛类，尤其与酒精代谢密切相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(biochemistry) Abbreviation for aldehyde dehydrogenase: a family of enzymes that break down aldehydes (including acetaldehyde from alcohol) into less harmful acids.","zh":"（生物化学）“aldehyde dehydrogenase”的缩写：一类把醛类（包括酒精代谢产生的乙醛）分解成较不有害的酸的酶。"},"examples":[{"en":"ALDH helps convert acetaldehyde into acetate after you drink alcohol.","zh":"饮酒后，ALDH 会把乙醛转化成乙酸盐。"},{"en":"Some cancer researchers use ALDH as a marker to identify certain stem-like tumor cells.","zh":"一些癌症研究者会把 ALDH 当作标记，用来识别某些具有干细胞样特征的肿瘤细胞。"}]},{"partOfSpeech":"n.","definition":{"en":"(genetics/medicine) Short for specific ALDH genes or proteins (e.g., ALDH2), often discussed in relation to alcohol sensitivity and metabolism.","zh":"（遗传学/医学）指特定的 ALDH 基因或蛋白（如 ALDH2）的简称，常用于讨论酒精敏感性与代谢。"},"examples":[{"en":"People with an inactive ALDH2 variant may flush easily after drinking.","zh":"带有低活性 ALDH2 变异的人，喝酒后可能很容易脸红。"},{"en":"The report noted a change in ALDH gene expression in liver tissue.","zh":"报告提到肝组织中 ALDH 基因表达发生了变化。"}]}],"synonyms":["aldehyde dehydrogenase","ALDH2 (a specific type)"],"phonetic":"/ˌæl.diː.eɪtʃˈdiː/","extraExplanation":["ALDH 在日常讨论里常和“酒精代谢”一起出现：酒精先被 ADH（乙醇脱氢酶）转成乙醛，再由 ALDH（特别是 ALDH2）把乙醛转成乙酸盐。乙醛累积会让人出现脸红、心跳加快、恶心等不适。","在学术文章里，ALDH 也可能指某个具体成员（如 ALDH1A1、ALDH2），因此阅读时要看上下文或全称（aldehyde dehydrogenase）来确认。"]}
{"word":"Aldhafara","summary":{"en":"Aldhafara is a traditional name for the star Zeta Leonis (in Leo).","zh":"Aldhafara 是狮子座ζ星（Zeta Leonis）的传统星名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A traditional proper name for the star Zeta Leonis in the constellation Leo.","zh":"（天文学）狮子座ζ星（Zeta Leonis）的传统星名。"},"examples":[{"en":"Adhafera (also spelled Aldhafara) is the traditional name of Zeta Leonis.","zh":"Adhafera（也可拼作 Aldhafara）是狮子座ζ星的传统名称。"},{"en":"On a clear night, Leo’s stars can be found near Adhafera.","zh":"在晴朗的夜晚，你可以在 Adhafera 附近找到狮子座的一些恒星。"}]}],"synonyms":["Adhafera","Aldhafera","Zeta Leonis"],"phonetic":"/ˌɑldəˈfɛrə/","extraExplanation":["“Aldhafara”更常见的拼写是“Adhafera / Aldhafera”，属于源自阿拉伯语的传统星名体系。许多传统星名来自中东地区的天文观测与命名习惯，后来被拉丁化并进入现代星表。","在现代天文学中，这类名字通常与“拜耳命名法”（如 Zeta Leonis）并行使用：科学论文和星表更常用字母+星座的标记，而传统星名更常用于科普、观星与文化语境。"]}
{"word":"aldhafara","summary":{"en":"Aldhafara is a rare proper name spelling, sometimes seen as an Arabic transliteration for an old star name or for the place name more commonly written “Al Dhafra.”","zh":"Aldhafara 是一种较少见的专有名词拼写，可能是阿拉伯语音译，用于旧式星名，或用于更常见写作“Al Dhafra”的地名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper name) A rare romanized spelling of an Arabic name used in some traditional star catalogs; it may refer to a star name found in older astronomical sources (spelling varies by author).","zh":"（专有名词）一种较少见的阿拉伯语拉丁转写拼法，见于部分传统星名/星表；在较早的天文学资料中可能用作某颗恒星的传统名称（不同资料拼写不一）。"},"examples":[{"en":"In one old catalog, “Aldhafara” appears as a traditional star name with a note about variant spellings.","zh":"在某本旧星表里，“Aldhafara”作为传统星名出现，并附注说明其拼写有不同变体。"},{"en":"Modern charts may not label the star as “Aldhafara,” so you may need to cross-check the designation.","zh":"现代星图可能不会标注“Aldhafara”，因此你可能需要对照该恒星的编号/星座标识来确认。"}]},{"partOfSpeech":"other","definition":{"en":"(Proper name) A less common transliteration that may be used for the Arabic place name more often written as “Al Dhafra” (a region in Abu Dhabi, UAE).","zh":"（专有名词）一种不太常见的阿拉伯地名转写，可能对应更常见的拼法“Al Dhafra”（阿联酋阿布扎比的达夫拉地区）。"},"examples":[{"en":"Some travel notes spell the region as “Aldhafara,” but “Al Dhafra” is more standard.","zh":"一些旅行记录会把该地区拼作“Aldhafara”，但更常见/更标准的是“Al Dhafra”。"},{"en":"If you search online, try both “Aldhafara” and “Al Dhafra” to find the same place.","zh":"如果你在网上检索，可以同时尝试“Aldhafara”和“Al Dhafra”，它们可能指同一个地方。"}]}],"synonyms":["Al Dhafra (common spelling, place name variant)","Aldhafra (variant spelling)"],"phonetic":"/ˌældəˈfɑːrə/","extraExplanation":["“Aldhafara”这类词常见于阿拉伯语音译：不同语言、不同年代、不同作者会用不同字母来转写同一个阿拉伯词，因此会出现多种拼写（variant spellings）。","如果你是在某本书、地图或星表里看到“Aldhafara”，最稳妥的方法是查看上下文：是“星座/恒星编号（如 Bayer/Flamsteed designation）”还是“地理位置（阿布扎比/阿联酋）”。"]}
{"word":"Aldhafera","summary":{"en":"Aldhafera is a traditional name (variant spelling of Adhafera) for the star Zeta Leonis in the constellation Leo.","zh":"Aldhafera是狮子座ζ星（Zeta Leonis）的传统星名之一，常被视为Adhafera的变体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Astronomy) A traditional star name for Zeta Leonis, a star in the constellation Leo; often spelled “Adhafera.”","zh":"（天文学）狮子座ζ（Zeta Leonis）的传统恒星名；常见拼写为“Adhafera”。"},"examples":[{"en":"Adhafera (sometimes written Aldhafera) is the traditional name of Zeta Leonis in Leo.","zh":"Adhafera（有时写作Aldhafera）是狮子座中ζ星（Zeta Leonis）的传统名称。"},{"en":"On a star map, look for Zeta Leonis—its older name may appear as Aldhafera.","zh":"在星图上找狮子座ζ星——它的旧名有时会标为Aldhafera。"}]}],"synonyms":["Adhafera","Zeta Leonis","ζ Leonis"],"phonetic":"ˌæl.dəˈfɛr.ə","extraExplanation":["“Adhafera/Aldhafera”源自阿拉伯语（常被解释为“辫子/发绺”之意），与狮子座在传统阿拉伯星官体系中的形象有关。现代天文学更常用拜耳命名“Zeta Leonis”，而传统星名在一些星图、天文软件或科普文章中仍会出现。","拼写上带不带“l”（Adhafera vs. Aldhafera）多见于不同转写体系或资料误差；如果你是在某本书/网站看到“Aldhafera”，通常就是指同一颗星。"]}
{"word":"aldhafera","summary":{"en":"Aldhafera is a traditional name for the star Zeta Leonis in the constellation Leo.","zh":"Aldhafera 是狮子座中恒星 ζ Leonis（狮子座ζ）的传统名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name for a star: Zeta Leonis, a star in the constellation Leo (the Lion).","zh":"（专有名词）一颗恒星的名称：狮子座ζ（Zeta Leonis），位于狮子座（Leo）。"},"examples":[{"en":"Aldhafera is the traditional name for Zeta Leonis in the constellation Leo.","zh":"Aldhafera 是狮子座ζ（Zeta Leonis）在狮子座中的传统名称。"},{"en":"In some star charts, Aldhafera marks part of the Lion’s mane.","zh":"在一些星图中，Aldhafera 标示狮子鬃毛的一部分。"}]}],"synonyms":["Zeta Leonis","ζ Leonis","Adhafera"],"phonetic":"ˌældəˈfɪrə","extraExplanation":["Aldhafera（也常见拼写 Adhafera / Aldhaferah）属于传统星名的一种，很多来源于阿拉伯语的转写；不同书籍、星表或年代可能采用不同拼写。","现代天文学里，日常辨识通常更常用“Zeta Leonis（ζ Leonis）”这种以希腊字母+星座属格的命名方式；而 Aldhafera 更多出现在文化、航海或传统星名语境中。"]}
{"word":"Aldhafra","summary":{"en":"Aldhafra (Al Dhafra) is a proper name most commonly referring to a region in Abu Dhabi, UAE, and sometimes to Al Dhafra Air Base.","zh":"Aldhafra（Al Dhafra/阿尔达夫拉）多指阿联酋阿布扎比的阿尔达夫拉地区，也可能指阿尔达夫拉空军基地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a region in the Emirate of Abu Dhabi, United Arab Emirates (also written “Al Dhafra”); it refers to the western part of Abu Dhabi and is known for desert landscapes and surrounding oases.","zh":"阿联酋阿布扎比酋长国的一个地区（也常写作“Al Dhafra/阿尔达夫拉”）；指阿布扎比西部区域，以沙漠景观与周边绿洲闻名。"},"examples":[{"en":"Al Dhafra is part of the Emirate of Abu Dhabi in the UAE.","zh":"阿尔达夫拉是阿联酋阿布扎比酋长国的一部分。"},{"en":"Many visitors travel through Al Dhafra to explore the desert and nearby heritage sites.","zh":"许多游客会经过阿尔达夫拉，去探索沙漠和附近的文化遗产景点。"}]},{"partOfSpeech":"n.","definition":{"en":"short for “Al Dhafra Air Base,” a military air base in Abu Dhabi, UAE, often mentioned in news and defense contexts.","zh":"“Al Dhafra Air Base（阿尔达夫拉空军基地）”的简称；位于阿联酋阿布扎比的军事空军基地，常见于新闻与国防语境。"},"examples":[{"en":"The aircraft landed at Al Dhafra Air Base for a scheduled stop.","zh":"飞机在阿尔达夫拉空军基地按计划降落停靠。"},{"en":"Al Dhafra is frequently referenced in reports about regional security.","zh":"阿尔达夫拉常在有关地区安全的报道中被提及。"}]}],"synonyms":["Al Dhafra","Al Dhafra Region","Al Dhafra Air Base"],"phonetic":"ˌæl ˈdɑːfrə","extraExplanation":["“Al-”是阿拉伯语定冠词，相当于英语的“the”。“Dhafra/Ẓafrah”常见为音译写法，因此你可能会看到多种拼写：Al Dhafra、Aldhafra、Al Dafrah 等。","在英文新闻或地图中，它既可能指更广的“阿尔达夫拉地区”，也可能特指“阿尔达夫拉空军基地”。阅读时可根据上下文（旅游/地理 vs. 军事/国防）判断。"]}
{"word":"Aldi","summary":{"en":"Aldi is a discount supermarket chain known for low prices and efficient shopping.","zh":"Aldi 是以低价和高效购物体验著称的折扣超市连锁。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A German-owned discount supermarket chain known for low prices, a small selection of store-brand items, and a simple, efficient shopping style.","zh":"奥乐齐（Aldi）：一家德国背景的折扣超市连锁，以低价、精选商品（多为自有品牌）和简化高效的购物方式而闻名。"},"examples":[{"en":"I usually buy groceries at Aldi because it’s cheaper than most supermarkets.","zh":"我通常在Aldi买日用品，因为它比大多数超市更便宜。"},{"en":"Aldi has good store-brand snacks and basics like eggs and milk.","zh":"Aldi的自有品牌零食不错，鸡蛋、牛奶等基础食品也很划算。"},{"en":"Don’t forget a quarter for the cart at Aldi.","zh":"去Aldi别忘了带一枚25美分硬币用来取购物车。"}]}],"synonyms":["discount supermarket","grocery chain"],"phonetic":"/ˈɔldi/","extraExplanation":["Aldi 来自德语“Albrecht Discount”（阿尔布雷希特折扣店）的缩写，起源于德国。后来发展成两大体系：Aldi Nord（北）和 Aldi Süd（南），在不同国家由不同体系运营。","在美国等地，Aldi 购物常见特点包括：以自有品牌为主、门店面积较小、商品品类更精简；部分门店使用“投币取车”（通常 25 美分，可退还），并鼓励自带购物袋或购买购物袋。"]}
{"word":"aldide","summary":{"en":"An aldehyde is an organic chemical compound with the –CHO group, commonly mentioned in chemistry, materials, and perfumes.","zh":"Aldehyde（醛）是一类含 –CHO 醛基的有机化合物，常见于化学、材料与香水等语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of organic chemical compound that contains the aldehyde group (–CHO), often with a strong smell; used in making plastics, perfumes, and other chemicals","zh":"一种有机化合物，含有醛基（–CHO），常有较强气味；常用于制造塑料、香料及其他化学品"},"examples":[{"en":"Formaldehyde is an aldehyde used in some building materials.","zh":"甲醛是一种醛，常用于某些建筑材料中。"},{"en":"Some perfumes contain aldehydes that add a fresh, soapy scent.","zh":"有些香水含有醛类成分，会带来清新、皂感的气味。"}]}],"synonyms":["carbonyl compound (broader)","alkanal (systematic term for many aldehydes)"],"phonetic":"/ˈæl.də.haɪd/","extraExplanation":["你输入的“aldide”很可能是拼写错误，常见正确拼法是 **aldehyde**（醛）。","在日常英语里，**aldehyde** 多出现在化学、材料、香水与健康安全相关语境（如“formaldehyde 甲醛”）。一些醛类具有刺激性气味，谈到室内空气或新家具气味时也可能见到这个词。"]}
{"word":"Aldie","summary":{"en":"Aldie is most commonly a place name (a small community in Northern Virginia) and can also be a surname.","zh":"Aldie最常见是地名（美国弗吉尼亚州北部的一个小社区），也可用作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small unincorporated community (village) in Loudoun County, Northern Virginia, U.S.","zh":"（美国）弗吉尼亚州北部劳登县的一个非建制社区（小镇/村落）。"},"examples":[{"en":"We drove through Aldie on the way to the mountains.","zh":"我们去山里路上开车经过了Aldie。"},{"en":"Aldie is known for its rural scenery and historic sites.","zh":"Aldie以乡村风景和历史遗迹而闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname).","zh":"姓氏：Aldie。"},"examples":[{"en":"Ms. Aldie will speak at the meeting today.","zh":"Aldie女士今天会在会上发言。"}]}],"synonyms":["(place) Aldie, Virginia","Aldie Mill"],"phonetic":"/ˈɔldi/","extraExplanation":["作为地名时，Aldie常被读作“ALL-dee”。它与当地历史景点（如Aldie Mill，奥尔迪磨坊）和弗州北部的乡村文化联系较多。","地名来源有多种说法；常见解释认为与苏格兰盖尔语相关，可能指“幽暗/黑色的小溪”之类的地貌描述。"]}
{"word":"aldim","summary":{"en":"“aldim” is usually a non-English spelling of Turkish “aldım,” meaning “I bought / I took.”","zh":"“aldim”通常是土耳其语“aldım”的非英语写法，意思是“我买了/我拿了”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not standard English) A Turkish word meaning “I bought” or “I took,” from the verb almak (“to buy; to take”).","zh":"（非标准英语）土耳其语词，意思是“我买了”或“我拿了/取了”，来自动词 almak（“买；拿/取”）。"},"examples":[{"en":"In Turkish, “Bunu aldım” means “I bought this / I took this.”","zh":"在土耳其语里，“Bunu aldım”意思是“我买了这个 / 我拿了这个”。"},{"en":"You might see “aldim” in casual typing where the Turkish letter ı is omitted; the standard spelling is “aldım.”","zh":"你可能会在随意打字时看到“aldim”（省略了土耳其语字母“ı”）；标准拼写是“aldım”。"}]}],"synonyms":["(Turkish) aldım","I bought","I took"],"phonetic":"/ɑlˈdim/","extraExplanation":["土耳其语里“aldım”的“ı”是一个没有点的元音字母（与英语或中文拼音的“i”不同），在不支持土耳其语键盘或随意输入时常被写成“aldim”。","如果你是在英语语境中看到“aldim”，它通常是人名/用户名/品牌名，或是土耳其语夹杂（code-switching）。需要结合上下文判断。"]}
{"word":"aldime","summary":{"en":"“Aldime” isn’t a standard word; it most likely means “al dente” (firm to the bite when cooked).","zh":"“aldime”不是标准单词；多半是想写“al dente”，指食物煮到“有嚼劲、刚刚好熟”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard spelling) This isn’t a common English word. It is most likely a misspelling of “al dente,” an Italian cooking phrase used in English.","zh":"（非标准拼写）这不是常见的英文单词。它很可能是“al dente”的误拼（意大利语词组，英语中常用来描述面食/蔬菜的口感）。"},"examples":[{"en":"Did you mean “al dente”? Cook the pasta until it’s firm but not hard.","zh":"你是不是想写“al dente”？把意大利面煮到有嚼劲、但不生硬。"},{"en":"The recipe says to boil the noodles and drain them when they’re al dente.","zh":"食谱说把面条煮好，达到 al dente 的口感就捞出沥干。"}]}],"synonyms":["firm to the bite","tender-crisp"],"phonetic":"/ˌæl ˈdɛn.teɪ/","extraExplanation":["“al dente”在英语里非常常见，尤其出现在菜单、食谱和烹饪节目中，意思是“有咬劲/刚刚好熟”。正确拼写中间有空格：al dente。","如果你原本想表达的是“a dime（十美分/一点点钱）”或其他词，请把完整句子发我，我可以根据上下文帮你确认。"]}
{"word":"aldimin","summary":{"en":"An aldimine is an imine made from an aldehyde (R–CH=NR′), commonly discussed in organic chemistry.","zh":"醛亚胺是由醛形成的亚胺（R–CH=NR′），常见于有机化学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) An imine formed from an aldehyde, with the general structure R–CH=NR′; a type of Schiff base.","zh":"（化学）醛亚胺：由醛与胺缩合形成的亚胺，通式常写作 R–CH=NR′；属于席夫碱的一类。"},"examples":[{"en":"In organic synthesis, an aldimine can be reduced to give a primary amine.","zh":"在有机合成中，醛亚胺可以被还原生成一级胺。"},{"en":"The aldehyde reacted with an amine to form an aldimine and water.","zh":"该醛与胺反应生成醛亚胺和水。"}]}],"synonyms":["Schiff base (broader term)","imine (broader term)"],"phonetic":"ˈældɪmiːn","extraExplanation":["“aldimin”更常见是对“aldimine”的误拼或非常少见的变体写法；在教材与论文中通常使用“aldimine”。","“aldimine”一词由“aldehyde（醛）+ imine（亚胺）”构成，强调该亚胺来源于醛（而非酮）；对应的“ketimine”则来源于酮。"]}
{"word":"aldimine","summary":{"en":"An aldimine is an imine made from an aldehyde and an amine (R–CH=NR′).","zh":"Aldimine 指由醛与胺生成的亚胺（R–CH=NR′），即“醛亚胺”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of imine formed when an aldehyde reacts with an amine; it contains the functional group R–CH=NR′ (also called an aldehyde imine).","zh":"醛亚胺：由醛与胺反应生成的一类亚胺，含有 R–CH=NR′ 官能团（也可称“醛型亚胺”）。"},"examples":[{"en":"In organic chemistry, an aldimine can form when an aldehyde reacts with a primary amine.","zh":"在有机化学中，醛与一级胺反应可以生成醛亚胺。"},{"en":"The reaction mixture was dried to shift the equilibrium toward aldimine formation.","zh":"对反应体系进行干燥以推动平衡向生成醛亚胺的方向移动。"},{"en":"The aldimine intermediate later underwent reduction to give an amine.","zh":"该醛亚胺中间体随后被还原生成胺。"}]}],"synonyms":["aldehyde imine","Schiff base (broadly)","imine (general category)"],"phonetic":"/ˈæl.dəˌmiːn/","extraExplanation":["“aldimine”来自“aldehyde（醛）+ imine（亚胺）”。通常由醛与一级胺缩合生成，同时脱去一分子水；因此常用移水手段（如分子筛、Dean–Stark 装置）来提高产率。","在文献中，醛亚胺常与“Schiff base（席夫碱）”相关联；但严格来说，Schiff base 是更宽泛的术语，常指由一级胺与醛/酮形成的亚胺类化合物。"]}
{"word":"Aldin","summary":{"en":"Aldin is mainly used as a personal name; in some cultures it is linked to Arabic “dīn,” meaning faith/religion.","zh":"Aldin 主要用作人名；在一些文化中，它与阿拉伯语 dīn（信仰/宗教）有关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name (male in many countries), used as a personal name.","zh":"人名（多为男性名），用作个人名字。"},"examples":[{"en":"Aldin is starting a new job next week.","zh":"Aldin 下周要开始一份新工作。"},{"en":"I met Aldin at the library.","zh":"我在图书馆认识了 Aldin。"}]},{"partOfSpeech":"other","definition":{"en":"(in some cultures) a name formed from Arabic “-al-dīn / -ud-dīn,” meaning “of the faith/religion,” seen in names like “Ṣalāḥ ad-Dīn.”","zh":"（在一些文化中）源自阿拉伯语后缀 “-al-dīn / -ud-dīn”，意为“信仰/宗教的”，常见于如“Ṣalāḥ ad-Dīn（萨拉丁）”一类名字中。"},"examples":[{"en":"In some communities, Aldin is understood as a name connected with “dīn,” meaning faith or religion.","zh":"在一些社群里，Aldin 常被理解为与 “dīn（信仰/宗教）”有关的名字。"},{"en":"You may also see similar endings in names like Nuruddin or Fakhruddin.","zh":"你也可能在 Nuruddin、Fakhruddin 等名字里看到类似的结尾。"}]}],"phonetic":"/ˈɔːldɪn/","extraExplanation":["“Aldin”通常是音译人名，不像普通词那样有固定词义；不同国家/家庭可能有不同的来源与拼写变体（例如 Alden、Alden/Aldin）。","若来自阿拉伯语姓名体系，它常与“dīn（دين）=信仰/宗教”相关；在英语文本里有时会简化或合并拼写，读音也可能因地区而略有差异。","正式场合可直接问对方偏好的发音与拼写（例如用于邮件、证件）。"]}
{"word":"Aldine","summary":{"en":"Aldine means connected to Aldus Manutius/the Aldine Press, or to the classic typographic style (especially italic) that came from that tradition.","zh":"Aldine 指与阿尔杜斯·马努提乌斯/阿尔丁印刷所相关，或指源自该传统的经典排版与字体风格（尤其斜体）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Aldus Manutius (an Italian Renaissance printer) or the Aldine Press, famous for high-quality printing and early italic type.","zh":"与阿尔杜斯·马努提乌斯（意大利文艺复兴时期的印刷家）或“阿尔丁印刷所（Aldine Press）”有关的；指其以高质量印刷与早期斜体字著称。"},"examples":[{"en":"The museum displayed an Aldine edition of a classical Greek text.","zh":"博物馆展出了一部古希腊经典作品的阿尔丁版（Aldine edition）。"},{"en":"Collectors prize Aldine books for their craftsmanship and historical importance.","zh":"收藏家珍视阿尔丁印刷书籍的工艺与历史价值。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing a typeface or typographic style associated with early Renaissance printing, especially the classic Aldine italic tradition.","zh":"（排版/字体）指与文艺复兴早期印刷相关的字体或风格，尤指经典的“阿尔丁斜体”传统。"},"examples":[{"en":"The designer chose an Aldine italic for the book’s chapter headings.","zh":"设计师为这本书的章节标题选择了阿尔丁风格的斜体。"},{"en":"Aldine type gives the page a distinctly classical feel.","zh":"阿尔丁字体让页面呈现出明显的古典气质。"}]}],"synonyms":["Manutian (rare)","Aldus-related (informal)","Renaissance-style (broader)"],"phonetic":"ˈɔlˌdaɪn","extraExplanation":["“Aldine”来自人名 Aldus Manutius（1450–1515）。他在威尼斯创办印刷所，以精美校勘与版式闻名，并推动“小开本便携书”（octavo）与斜体字的流行，因此在书目学、古籍收藏、印刷史与字体设计领域常见该词。","常见搭配：Aldine Press（阿尔丁印刷所）、Aldine edition（阿尔丁版）、Aldine italic（阿尔丁斜体）。在学术或收藏语境里，它往往带有“经典、权威、精工”的联想。"]}
{"word":"aldine","summary":{"en":"Aldine means “connected with Aldus Manutius or the Aldine Press,” and it can also mean a book/edition printed by that press.","zh":"Aldine 指“与阿尔杜斯·马努提乌斯或阿尔丁印刷所有关”，也可指“阿尔丁印刷所印制的书/版本”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often capitalized) Relating to the Aldine Press (a famous Venetian printing house) or to the Italian printer-publisher Aldus Manutius (c. 1449–1515).","zh":"（常大写）与“阿尔丁印刷所”（威尼斯著名出版社/印刷所）或意大利印刷家兼出版人阿尔杜斯·马努提乌斯（约1449–1515）有关的。"},"examples":[{"en":"The library owns several Aldine editions of Greek and Latin classics.","zh":"这家图书馆藏有几部阿尔丁版的希腊与拉丁经典著作。"},{"en":"She is writing a paper on Aldine printing and Renaissance book culture.","zh":"她正在写一篇关于阿尔丁印刷与文艺复兴时期书籍文化的论文。"}]},{"partOfSpeech":"n.","definition":{"en":"An edition or book printed by the Aldine Press; an “Aldine edition.”","zh":"阿尔丁印刷所出版/印制的版本或书；阿尔丁版。"},"examples":[{"en":"Collectors pay high prices for an Aldine in good condition.","zh":"品相好的阿尔丁版在收藏市场上价格很高。"},{"en":"He proudly displayed an Aldine on the top shelf.","zh":"他自豪地把一本阿尔丁版放在书架最上层。"}]}],"synonyms":["Manutian","Aldus-related","Aldine edition"],"phonetic":"/ˈɔlˌdiːn/","extraExplanation":["“Aldine”来自Aldus Manutius（拉丁名Aldus Manutius）。他在威尼斯创办Aldine Press，以高质量排印古典文本闻名，也常被认为推动了早期的“便携小开本”书籍与更规范的排版传统。","在书籍史与字体/排版语境里，你可能会看到：Aldine Press（阿尔丁印刷所）、Aldine edition（阿尔丁版）。有时也会提到与其传统相关的意大利体（italic）发展史。"]}
{"word":"Aldington","summary":{"en":"Aldington is a proper noun used mainly as a British surname and as the name of several villages in England.","zh":"Aldington 是专有名词，主要用作英国姓氏，也可指英格兰若干村庄的地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name), especially found in Britain","zh":"（尤指英国常见的）姓氏"},"examples":[{"en":"Richard Aldington was an English writer associated with early modernist poetry.","zh":"理查德·奥尔丁顿（Richard Aldington）是与早期现代主义诗歌相关的英国作家。"},{"en":"Ms. Aldington will chair the meeting today.","zh":"奥尔丁顿女士今天将主持会议。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used for several villages in England (e.g., in Kent and Worcestershire)","zh":"英格兰若干村庄的地名（例如肯特郡、伍斯特郡等地的 Aldington）"},"examples":[{"en":"They stopped in Aldington on their way across Kent.","zh":"他们穿过肯特郡时在奥尔丁顿（Aldington）停了一下。"},{"en":"Aldington is a small village with a long local history.","zh":"奥尔丁顿是一个历史悠久的小村庄。"}]}],"phonetic":"/ˈɔl.dɪŋ.tən/","extraExplanation":["Aldington 作为人名时，较常让人联想到英国作家 Richard Aldington（1892–1962），他与“意象派（Imagism）”有渊源，并写过第一次世界大战相关作品。","作为地名时，Aldington 属于典型的英格兰乡村地名，用法上通常直接当专有名词使用：in Aldington / from Aldington。"]}
{"word":"Aldis","summary":{"en":"“Aldis” is most often an informal way to write or say “Aldi’s” (the store), and it can also be a Latvian male name.","zh":"“Aldis”常见用法是非正式地表示“Aldi’s”（Aldi 超市），也可以是拉脱维亚的男性名字。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal) A spelling of “Aldi’s,” meaning the discount grocery store Aldi (possessive form), often used when people say “I’m going to Aldi’s.”","zh":"（非正式）“Aldi’s”的一种写法，指折扣超市 Aldi（所有格形式），人们口语里常说“我去 Aldi’s（Aldi）买东西”。"},"examples":[{"en":"I’m stopping by Aldi’s to pick up milk and bread.","zh":"我去 Aldi’s（Aldi）买点牛奶和面包。"},{"en":"Aldi’s prices are usually lower than the big supermarkets.","zh":"Aldi’s（Aldi）的价格通常比大型超市更便宜。"}]},{"partOfSpeech":"other","definition":{"en":"A male given name, most commonly found in Latvia (a Baltic country in Northern Europe).","zh":"男性名字，最常见于拉脱维亚（北欧波罗的海国家）。"},"examples":[{"en":"Aldis is a common Latvian name.","zh":"Aldis 是一个常见的拉脱维亚名字。"},{"en":"My classmate Aldis moved here from Riga.","zh":"我的同学 Aldis 从里加搬来这里。"}]}],"synonyms":["Aldi","Aldi’s"],"phonetic":"ˈɔldiːz","extraExplanation":["在英语里，很多店名会被口语化成“店名 + ’s”，听起来像“这家店的地方”，例如：Costco’s、Trader Joe’s、Aldi’s。正式写法通常直接用店名：Aldi。","Aldi 是德国起源的连锁折扣超市品牌，在美国和英国都很常见；购物袋常需自带或付费，部分门店购物车需要投币（用完可退回）。"]}
{"word":"alditol","summary":{"en":"An alditol is a sugar alcohol formed by reducing an aldose sugar.","zh":"Alditol 指由醛糖还原生成的糖醇（醛糖醇）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sugar alcohol made by reducing an aldose sugar (for example, glucose → sorbitol); used in food, medicine, and chemical research","zh":"醛糖醇；由醛糖（aldose）经还原反应生成的糖醇（例如：葡萄糖→山梨醇），常用于食品、医药与化学研究"},"examples":[{"en":"Sorbitol is an alditol commonly used as a sweetener in sugar-free gum.","zh":"山梨醇是一种常见的醛糖醇，常用作无糖口香糖中的甜味剂。"},{"en":"In the lab, we identified the alditol by comparing it with known standards.","zh":"在实验室里，我们通过与已知标准品对比来鉴定这种醛糖醇。"},{"en":"Some people may experience stomach discomfort if they eat too much alditol-based sweetener.","zh":"有些人如果摄入过多以醛糖醇为基础的甜味剂，可能会出现胃部不适。"}]}],"synonyms":["sugar alcohol","polyol"],"phonetic":"/ˈæl.dəˌtɔl/","extraExplanation":["“Alditol”是化学/生物化学用词，结构上属于“多元醇（polyol）”。常见例子包括：由葡萄糖还原得到的山梨醇（sorbitol）、由甘露糖还原得到的甘露醇（mannitol）。","在食品标签中更常看到具体名称（如 sorbitol、xylitol），而不是统称“alditol”。"]}
{"word":"Aldm","summary":{"en":"“Aldm/ALDM” is not a common English word; it’s likely an acronym or a misspelling, so context is needed.","zh":"“Aldm/ALDM”不是常见英文单词；更可能是缩写或拼写错误，需要上下文才能确定含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; most likely an acronym, username, or a misspelling.","zh":"不是常见词典里的标准英文单词；更可能是缩写、用户名，或拼写错误。"},"examples":[{"en":"I can’t define “ALDM” without context—where did you see it?","zh":"没有上下文我没法准确解释“ALDM”——你是在哪里看到的？"},{"en":"If you meant a different word, please check the spelling and tell me the sentence.","zh":"如果你想查的是别的词，请核对拼写并把句子发我。"}]}],"synonyms":["acronym","initialism","abbreviation"],"phonetic":"/ˈeɪ.ɛl.diː.ɛm/","extraExplanation":["“ALDM / Aldm”在英文里经常以“缩写”形式出现，但不同领域含义差异很大（例如公司/项目名、技术系统名、课程名等）。\n请告诉我：\n1）全大写还是首字母大写？(ALDM / Aldm)\n2）出现的句子或领域（学校/游戏/工程/医学/社交媒体）\n我就能给出最可能的展开形式和准确释义。"]}
{"word":"aldm","summary":{"en":"“aldm” is usually an abbreviation, not a common English word; its meaning depends on context.","zh":"“aldm”通常是缩写而非常见英文单词；具体含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“aldm” is not a standard English word. It is most often seen as an abbreviation (an initialism) whose meaning depends on context (work notes, texting, technical fields, etc.).","zh":"“aldm”不是标准英语单词，更常见的是一种缩写（首字母缩略语），具体意思要看使用场景（工作记录、聊天、技术领域等）。"},"examples":[{"en":"I saw “ALDM” in the email, but there was no explanation—what does it stand for?","zh":"我在邮件里看到“ALDM”，但没有解释——它代表什么？"},{"en":"Could you tell me what “aldm” means in this document?","zh":"你能告诉我“aldm”在这份文件里是什么意思吗？"}]}],"phonetic":"/ˌeɪ.ɛl.diːˈɛm/","extraExplanation":["“ALDM/aldm”可能是某个组织、项目、课程、型号或内部流程的缩写；仅凭这四个字母无法可靠确定含义。","如果你把它出现的完整句子/段落贴出来（或说明领域：工作、游戏、医学、工程、聊天等），我可以更准确地解释，并给出对应的例句与近义表达。"]}
{"word":"Aldo","summary":{"en":"Aldo is usually a male first name; it can also refer to the shoe brand ALDO.","zh":"Aldo 通常是男性名字；也可指鞋履品牌 ALDO。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name, common in Italian- and Spanish-speaking cultures","zh":"男性名字（常见于意大利语和西班牙语文化圈）"},"examples":[{"en":"Aldo is my cousin; he lives in Milan.","zh":"Aldo 是我表哥，他住在米兰。"},{"en":"We met an engineer named Aldo at the conference.","zh":"我们在会议上认识了一位叫 Aldo 的工程师。"}]},{"partOfSpeech":"n.","definition":{"en":"ALDO: a well-known international shoe and accessories brand (a company name)","zh":"ALDO：知名国际鞋履与配饰品牌（公司名）"},"examples":[{"en":"She bought boots at ALDO.","zh":"她在 ALDO 买了靴子。"},{"en":"There’s an ALDO store in that mall.","zh":"那家商场里有一家 ALDO 门店。"}]}],"synonyms":["(as a name) none; related names: Alberto, Rinaldo"],"phonetic":"/ˈɑːl.doʊ/","extraExplanation":["“Aldo”多被认为源自古日耳曼语名字元素（与“年长、智慧”等含义相关），经由意大利语文化传播后更为常见。","在英文里，作为人名通常不翻译含义；在写作中首字母大写（Aldo），指品牌时常见全大写（ALDO）。"]}
{"word":"aldo-heptose","summary":{"en":"An aldo-heptose is a seven-carbon monosaccharide with an aldehyde group.","zh":"aldo-heptose（醛庚糖）是含7个碳并带醛基的单糖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a seven-carbon sugar (heptose) that has an aldehyde group; a type of monosaccharide in carbohydrate chemistry","zh":"醛己糖？纠正：醛庚糖（aldoheptose）是含有7个碳原子、带醛基的糖；属于单糖的一类"},"examples":[{"en":"Sedoheptulose is related to aldo-heptose chemistry studied in biochemistry.","zh":"在生物化学中，人们会学习与醛庚糖相关的庚糖化学（如庚酮糖 sedoheptulose 等）。"},{"en":"In the lab, an aldo-heptose can be identified by reactions typical of aldehyde sugars.","zh":"在实验中，醛庚糖可通过醛糖常见的反应来鉴定。"}]}],"synonyms":["aldoheptose","aldose heptose","seven-carbon aldose"],"phonetic":"/ˌæl.doʊˈhɛp.toʊs/","extraExplanation":["术语拆解：aldo- 表示“醛”（aldehyde），heptose 表示“七碳糖”。因此 aldo-heptose 指“带醛基的七碳单糖”。","这类糖在生物体内不如葡萄糖（六碳）常见，但在某些生化途径、细菌表面多糖等研究中会出现。","写法上常见 aldoheptose（不加连字符）与 aldo-heptose（加连字符）；含义相同，取决于期刊或教材风格。","小提醒：中文不要把它译成“醛己糖”（六碳）；正确是“醛庚糖”（七碳）。"]}
{"word":"aldoheptose","summary":{"en":"An aldoheptose is a seven-carbon simple sugar (a heptose) that has an aldehyde group in its open-chain form.","zh":"Aldoheptose 指一种七碳单糖（庚糖），在开链形式中带有醛基。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a seven-carbon monosaccharide (simple sugar), especially one in the open-chain aldehyde form; a type of heptose used in biochemistry.","zh":"七碳单糖（简单糖）的一种，尤指以开链“醛糖”形式存在的七碳糖；属于生物化学中的庚糖类。"},"examples":[{"en":"Sedoheptulose is an aldoheptose found in the pentose phosphate pathway.","zh":"庚酮糖-7-磷酸（sedoheptulose）相关的庚糖可在磷酸戊糖途径中出现。（注：sedoheptulose本身是酮庚糖，但与庚糖代谢常一起学习）"},{"en":"In some bacteria, an aldoheptose helps build lipopolysaccharides on the cell surface.","zh":"在一些细菌中，醛庚糖参与构建细胞表面的脂多糖。"}]}],"synonyms":["aldo-heptose","seven-carbon aldose","C7 aldose"],"phonetic":"/ˌæl.doʊˈhɛp.toʊs/","extraExplanation":["“Aldo-”表示“醛（aldehyde）”，指这种糖在开链结构时含有醛基；“heptose”表示“七个碳的糖”。因此 aldoheptose 就是“醛型七碳单糖”。","常见相关词：ketoheptose（酮庚糖，含酮基）；以及具体分子名如 glucoheptose、mannoheptose 等，表示不同立体构型。","在微生物学中，某些醛庚糖与革兰氏阴性菌外膜成分（如脂多糖 LPS）的结构有关；这类术语多出现在生物化学/微生物学教材与科研论文中。"]}
{"word":"aldohexose","summary":{"en":"An aldohexose is a six-carbon monosaccharide with an aldehyde group (e.g., glucose).","zh":"醛己糖是带醛基的六碳单糖（如葡萄糖）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A simple sugar (monosaccharide) that has six carbon atoms and an aldehyde group; many common sugars in biology belong to this group.","zh":"一种单糖，含有六个碳原子并带有醛基；许多生物体中常见的糖类属于这一类。"},"examples":[{"en":"Glucose is an aldohexose found in many foods and in the blood.","zh":"葡萄糖是一种醛己糖，存在于许多食物中，也存在于血液里。"},{"en":"In biochemistry class, we learned how an aldohexose can form a ring in water.","zh":"在生物化学课上，我们学习了醛己糖在水中如何形成环状结构。"}]}],"synonyms":["hexose (broader term)","aldose (broader term)"],"phonetic":"/ˌæl.doʊˈhɛk.soʊs/","extraExplanation":["“aldo-”表示“醛（aldehyde）”，“hexose”表示“六碳糖”。因此 aldohexose 字面意思就是“醛基六碳糖”。","常见的醛己糖包括 glucose（葡萄糖）、galactose（半乳糖）、mannose（甘露糖）。与之对比，ketohexose（酮己糖）指含酮基的六碳糖，如 fructose（果糖）。","在水溶液中，很多醛己糖常以环状形式存在（如吡喃糖环），这也是教材和结构式中常见的画法。"]}
{"word":"aldoketene","summary":{"en":"Aldoketene is a rare chemistry term for a ketene that has an aldehyde group.","zh":"Aldoketene 是较少见的化学术语，指带有醛基的烯酮（ketene）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A rare, specialized term for a ketene (R2C=C=O) that contains an aldehyde (“aldo-”) group—often discussed in organic reaction mechanisms rather than everyday English.","zh":"（化学）一个较少见的专业术语，指带有醛基（“aldo-”）的烯酮（ketene，R2C=C=O）。多见于有机反应机理讨论，而非日常英语。"},"examples":[{"en":"The paper proposes an aldoketene intermediate during the rearrangement step.","zh":"该论文提出在重排步骤中存在一种“aldoketene（醛基烯酮）”中间体。"},{"en":"Aldoketenes are typically described in advanced organic chemistry contexts, not in general textbooks.","zh":"“Aldoketene”通常出现在高阶有机化学语境中，而不常见于普通教材。"}]}],"synonyms":["formyl ketene","acyl ketene (related)","ketene (broader term)"],"phonetic":"ˌæl.doʊˈkiː.tiːn","extraExplanation":["这个词在通用英语词典里往往查不到，更像是由两个化学构词成分拼出来的术语：aldo-（表示“醛/醛糖相关”）+ ketene（烯酮，一类高反应性的官能团）。","如果你是在文献里看到的拼写，也可能是作者自造用法或与更常见的词混淆（如 ketene / keto- / aldoketone 等）。可以把原句或上下文贴出来，我可以帮你确认具体指哪一种结构或反应中间体。"]}
{"word":"aldol","summary":{"en":"Aldol is a chemistry term for the β-hydroxy carbonyl product formed in an aldol reaction (often from aldehydes/ketones).","zh":"Aldol 是化学术语，指醛醇反应生成的 β-羟基羰基化合物（常由醛/酮形成）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound formed by the addition of an enolate (or enol) to an aldehyde or ketone; also used more generally to refer to the product of an aldol reaction (a β-hydroxy aldehyde or β-hydroxy ketone).","zh":"（化学）醛醇（或“醛醇加成产物”）：由烯醇负离子（或烯醇）对醛或酮发生加成而形成的化合物；也常泛指“羟基醛/羟基酮”（β-羟基醛或β-羟基酮）这一类醛醇反应产物。"},"examples":[{"en":"The aldol can dehydrate to form an α,β-unsaturated carbonyl compound.","zh":"醛醇产物可以脱水生成 α,β-不饱和羰基化合物。"},{"en":"In this experiment, we first form an aldol, then heat it to drive elimination.","zh":"在这个实验中，我们先生成醛醇产物，然后加热促进消除（脱水）。"}]}],"synonyms":["β-hydroxy carbonyl (product)","aldol product"],"phonetic":"/ˈæl.dɔl/","extraExplanation":["“Aldol”这个词来自 aldehyde（醛）+ alcohol（醇）的合成，因为典型的醛醇加成产物同时含有醛/酮的羰基和一个醇羟基。","学习中常见搭配：aldol reaction（醛醇反应）、aldol addition（醛醇加成）、aldol condensation（醛醇缩合，通常指加成后继续脱水形成共轭烯酮/烯醛）。","在有机化学里，“aldol”有时既指具体化合物（如最早发现的“醛醇”），也可泛指这类反应的加成产物；具体含义要看上下文。"]}
{"word":"aldol-condense","summary":{"en":"A chemistry verb meaning “to undergo or perform an aldol condensation reaction.”","zh":"化学动词，指“发生或进行羟醛缩合反应”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Chemistry) to carry out or undergo an aldol condensation: a reaction in which aldehydes and/or ketones form a new carbon–carbon bond, often producing a β-hydroxy carbonyl compound that may dehydrate to an α,β-unsaturated carbonyl compound.","zh":"（化学）进行或发生“羟醛缩合（aldol condensation）”：醛和/或酮形成新的碳—碳键的反应，通常先生成β-羟基羰基化合物，随后可能脱水生成α,β-不饱和羰基化合物。"},"examples":[{"en":"Under basic conditions, acetone can aldol-condense to form diacetone alcohol.","zh":"在碱性条件下，丙酮可以发生羟醛缩合生成二丙酮醇。"},{"en":"If the mixture is heated, the aldol product may dehydrate after it aldol-condenses.","zh":"如果加热，缩合后的羟醛产物可能进一步脱水。"}]}],"synonyms":["undergo an aldol condensation","perform an aldol condensation","condense (via an aldol reaction)"],"phonetic":"/ˈæl.dɑːl kənˈdɛns/","extraExplanation":["“aldol-condense”不是日常英语里常见的单词，更常见的说法是用名词短语“aldol condensation（羟醛缩合）”，或动词短语“undergo an aldol condensation / perform an aldol condensation”。","词源提示：Aldol 来自 aldehyde（醛）+ alcohol（醇），因为该反应常先生成同时含“醛/酮基（羰基）”与“醇基（羟基）”的产物。","写作与格式：在科研论文里通常不加连字符，写作“aldol condense”或直接写“condense via an aldol reaction”。带连字符多见于非正式笔记或作为临时动词用法。"]}
{"word":"aldolase","summary":{"en":"Aldolase is an enzyme that helps cells break down sugars for energy, and it can also be measured in blood tests related to muscle damage.","zh":"醛缩酶是一种帮助细胞分解糖类以产生能量的酶，也可在某些与肌肉损伤相关的血液检查中被测量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an enzyme (a type of protein) that helps break down sugars during glycolysis, an important energy-producing process in cells","zh":"醛缩酶（一种酶/蛋白质），在糖酵解过程中帮助分解糖类，是细胞产能的重要步骤之一"},"examples":[{"en":"Aldolase is involved in glycolysis, helping cells release energy from glucose.","zh":"醛缩酶参与糖酵解，帮助细胞从葡萄糖中释放能量。"},{"en":"Doctors sometimes check aldolase levels to help evaluate muscle damage.","zh":"医生有时会检测醛缩酶水平，以辅助评估肌肉损伤。"}]}],"synonyms":["fructose-bisphosphate aldolase","aldolase A","aldolase B"],"phonetic":"/ælˈdoʊleɪs/","extraExplanation":["“Aldolase”这个名字来自有机化学里的“醛醇（aldol）反应/缩合”概念：它催化的反应类型与把糖分子“切开/重排”有关，因此得名。","在医学化验里，血液中的醛缩酶升高有时与骨骼肌疾病（如肌炎）或组织损伤有关，但通常需要结合其他指标（如CK、AST等）一起判断。"]}
{"word":"aldolases","summary":{"en":"Aldolases are enzymes that split certain sugars into smaller molecules, especially in glycolysis.","zh":"aldolases 指“醛缩酶”，一类把某些糖裂解成更小分子的酶，常见于糖酵解等代谢过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Aldolases are enzymes that help break down (or sometimes build) certain sugars by splitting them into two smaller molecules. They are important in pathways like glycolysis.","zh":"醛缩酶（复数：aldolases）是一类酶，帮助分解（有时也参与合成）某些糖类，通过把一个糖分子“裂解”为两个较小分子来完成反应；在糖酵解等代谢途径中很重要。"},"examples":[{"en":"In glycolysis, aldolases help split a six-carbon sugar into two three-carbon molecules.","zh":"在糖酵解过程中，醛缩酶帮助把一个六碳糖裂解成两个三碳分子。"},{"en":"Researchers compared aldolases from different organisms to study how metabolism evolved.","zh":"研究人员比较了不同生物的醛缩酶，以研究代谢如何演化。"}]}],"synonyms":["aldolase (enzyme)","fructose-bisphosphate aldolase (specific type)"],"phonetic":"/ˈæl.doʊ.leɪs/","extraExplanation":["“Aldolase”这个词来自“aldol（醛醇缩合产物）+ -ase（表示酶的后缀）”。在生物化学里最常见的是“果糖-1,6-二磷酸醛缩酶（fructose-bisphosphate aldolase）”，它在糖酵解中把果糖-1,6-二磷酸切成两种三碳分子（DHAP 和 G3P）。","日常英语里很少用到这个词，更多出现在生物、医学、化学的教材、论文和检验指标中；当你看到复数“aldolases”，通常是在讨论不同类型或不同来源（不同物种/组织）的醛缩酶。"]}
{"word":"aldolization","summary":{"en":"Aldolization is the aldol reaction: carbonyl compounds (aldehydes/ketones) join to form a β-hydroxy aldehyde or ketone.","zh":"Aldolization 指醇醛反应：醛/酮等羰基化合物结合生成β-羟基醛或β-羟基酮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A chemical reaction in which aldehydes or ketones form a new carbon–carbon bond, producing a β-hydroxy aldehyde or β-hydroxy ketone (an “aldol”).","zh":"（化学）醛或酮之间发生的一种反应，通过形成新的碳—碳键，生成β-羟基醛或β-羟基酮（称为“醇醛/aldol”）。"},"examples":[{"en":"In organic chemistry, aldolization is a key method for building larger molecules from smaller carbonyl compounds.","zh":"在有机化学中，aldolization 是一种关键方法，用较小的羰基化合物构建更大的分子。"},{"en":"Under basic conditions, acetone can undergo aldolization to give a β-hydroxy ketone.","zh":"在碱性条件下，丙酮可以发生 aldolization，生成β-羟基酮。"}]},{"partOfSpeech":"n.","definition":{"en":"More broadly, the process or tendency of a system to undergo an aldol reaction (sometimes discussed in mechanisms, kinetics, or synthesis planning).","zh":"（更广义）发生醇醛反应的过程或倾向（常用于讨论机理、动力学或合成路线设计）。"},"examples":[{"en":"The catalyst increases the aldolization rate by stabilizing the enolate intermediate.","zh":"该催化剂通过稳定烯醇负离子中间体来提高 aldolization 的速率。"},{"en":"Chemists may suppress aldolization when they want to prevent unwanted side products.","zh":"当化学家想避免不必要的副产物时，可能会抑制 aldolization。"}]}],"synonyms":["aldol reaction","aldol addition"],"phonetic":"/ˌæl.doʊ.ləˈzeɪ.ʃən/","extraExplanation":["“Aldolization”来自“aldol”（由 aldehyde 醛 + alcohol 醇 组合而来），因为典型产物既含有醛/酮相关结构，又含有羟基（像醇）。","学习相关词时可一起区分：aldolization（醇醛加成/生成β-羟基产物）与 aldol condensation（醇醛缩合，常在后续脱水后生成α,β-不饱和羰基化合物）。"]}
{"word":"aldolize","summary":{"en":"A chemistry verb meaning to perform or undergo an aldol reaction (aldol condensation/addition).","zh":"一个化学动词，指进行或发生羟醛反应（羟醛缩合/加成）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Chemistry) To undergo or carry out an aldol reaction (aldol addition/aldol condensation), forming an “aldol” product (a β‑hydroxy aldehyde or β‑hydroxy ketone) or its dehydration product.","zh":"（化学）发生或进行羟醛反应（羟醛加成/羟醛缩合），生成“羟醛”产物（β‑羟基醛或β‑羟基酮）或其脱水后的产物。"},"examples":[{"en":"Under basic conditions, acetaldehyde can aldolize to form a β‑hydroxy aldehyde.","zh":"在碱性条件下，乙醛可以发生羟醛反应，生成β‑羟基醛。"},{"en":"The chemist aldolized the ketone with an aldehyde to build a new carbon–carbon bond.","zh":"化学家让该酮与醛进行羟醛反应，以构建新的碳—碳键。"}]}],"synonyms":["undergo aldol condensation","perform an aldol reaction","aldol-condense (less common)"],"phonetic":"/ælˈdoʊlaɪz/","extraExplanation":["“aldolize”主要出现在有机化学语境中，属于较专业的动词。学习时可把它理解为“做羟醛反应/发生羟醛反应”。","词源来自“aldol”（由 aldehyde 醛 + alcohol 醇 组合而来），因为典型产物同时含有醛（或酮）与醇（羟基）结构特征。","常见搭配：aldolize A with B（让A与B做羟醛反应）；under acid/base conditions（在酸/碱条件下）。"]}
{"word":"aldolized","summary":{"en":"Aldolized describes a compound that has undergone an aldol reaction (aldol condensation).","zh":"Aldolized 指某化合物已经发生醛醇反应（醛醇缩合）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(chemistry) Having undergone an aldol reaction (often aldol condensation), forming a new carbon–carbon bond and typically producing a β-hydroxy carbonyl compound or a related product.","zh":"（化学）已发生醛醇反应（常指醛醇缩合）的；形成新的碳—碳键，通常生成β-羟基羰基化合物或其相关产物。"},"examples":[{"en":"The mixture contained an aldolized product that could be purified by recrystallization.","zh":"该混合物含有一个醛醇化产物，可通过重结晶进行纯化。"},{"en":"Under basic conditions, the aldehyde aldolized quickly and then dehydrated to an enone.","zh":"在碱性条件下，该醛很快发生醛醇化，随后脱水生成烯酮。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “aldolize”: to make a compound undergo an aldol reaction.","zh":"“aldolize”的过去式/过去分词：使化合物发生醛醇反应。"},"examples":[{"en":"The chemists aldolized the ketone with an aldehyde to build a larger molecule.","zh":"化学家让该酮与醛发生醛醇反应，以构建更大的分子。"},{"en":"After being aldolized, the product was analyzed by NMR.","zh":"产物醛醇化后，用核磁共振进行分析。"}]}],"synonyms":["(chemistry) aldol-condensed","(chemistry) undergone aldol reaction"],"phonetic":"/ælˈdoʊlˌaɪzd/","extraExplanation":["“aldol”来自“aldehyde（醛）”与“alcohol（醇）”的组合，因为经典醛醇加成产物同时含有醛/酮的羰基（C=O）与醇的羟基（–OH）。","在科研写作里，“aldolized”常用来简洁描述“某底物已经发生了醛醇加成/缩合”，不一定强调具体条件（酸/碱、催化剂）或机理细节。"]}
{"word":"aldolizing","summary":{"en":"“Aldolizing” means carrying out or undergoing an aldol (condensation) reaction in organic chemistry.","zh":"“aldolizing”指在有机化学中进行或发生羟醛（缩合）反应。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Chemistry) To carry out or undergo an aldol reaction/aldol condensation, forming a β-hydroxy carbonyl compound (an “aldol”) and often then dehydrating to an α,β-unsaturated carbonyl compound.","zh":"（化学）进行或发生羟醛反应/羟醛缩合，生成β-羟基羰基化合物（“羟醛”），并常进一步脱水生成α,β-不饱和羰基化合物。"},"examples":[{"en":"Under basic conditions, acetaldehyde can be aldolizing to form a larger molecule.","zh":"在碱性条件下，乙醛可以发生羟醛反应生成更大的分子。"},{"en":"The chemist avoided aldolizing the aldehyde by keeping the temperature low.","zh":"化学家通过保持低温来避免该醛发生羟醛反应。"}]}],"synonyms":["undergo an aldol reaction","undergo aldol condensation","self-condense (in an aldol reaction)","form an aldol (product)"],"phonetic":"/ælˈdoʊlaɪz/","extraExplanation":["“aldolizing”是动词“aldolize”的现在分词/动名词形式，常见于有机化学实验或论文里，用来描述某底物“正在发生”或“容易发生”羟醛（缩合）反应。","羟醛反应通常发生在含α-氢的醛/酮之间（或分子内），在碱或酸催化下生成新的C–C键；若继续脱水，常得到共轭的烯酮/烯醛。","在实际语境中，作者也可能用“aldolize”泛指“发生羟醛缩合导致副反应/聚合”，比如在强碱、升温或浓度高时更容易出现。"]}
{"word":"aldols","summary":{"en":"“Aldols” is the plural of “aldol,” referring to compounds (or products of an aldol reaction) that contain both alcohol and aldehyde/ketone features.","zh":"“Aldols”是“aldol”的复数，指含有羟基与醛基/酮基特征的化合物，常为羟醛反应的产物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an organic compound that contains both an aldehyde (or ketone) group and an alcohol group; often a product of an aldol reaction (typically a β-hydroxy carbonyl compound)","zh":"一种同时含有醛基（或酮基）与羟基（醇基）的有机化合物；常为“羟醛反应”的产物（通常为β-羟基羰基化合物）"},"examples":[{"en":"The textbook explains that aldols are β-hydroxy carbonyl compounds formed under basic conditions.","zh":"教材解释说，羟醛类（aldols）是在碱性条件下形成的β-羟基羰基化合物。"},{"en":"In the lab, we purified the aldol before heating it further.","zh":"在实验室里，我们先纯化羟醛产物，再继续加热处理。"}]},{"partOfSpeech":"n.","definition":{"en":"(in the phrase “aldol reaction/aldol condensation”) a carbon–carbon bond-forming reaction where an enolate adds to a carbonyl compound, often giving an aldol product and sometimes dehydrating to an α,β-unsaturated carbonyl compound","zh":"（用于短语“羟醛反应/羟醛缩合”）一种形成碳—碳键的反应：烯醇盐加成到羰基化合物上，常先生成羟醛产物，之后有时脱水生成α,β-不饱和羰基化合物"},"examples":[{"en":"We used an aldol reaction to build a larger carbon skeleton.","zh":"我们用羟醛反应来构建更大的碳骨架。"},{"en":"Under heat, the aldol condensation can produce an α,β-unsaturated aldehyde.","zh":"在加热条件下，羟醛缩合可能生成α,β-不饱和醛。"}]}],"synonyms":["β-hydroxy carbonyl compound","aldol product"],"phonetic":"/ˈæl.dɑːl/","extraExplanation":["“Aldol”这个词来自“aldehyde（醛）+ alcohol（醇）”的合成词，强调产物同时具有醛/酮与醇两类官能团。","在有机合成中，羟醛反应非常常见：先生成“aldol（β-羟基羰基化合物）”，再可能在酸或碱、加热条件下脱水，得到更稳定、共轭的α,β-不饱和羰基化合物。"]}
{"word":"Aldomet","summary":{"en":"Aldomet is a brand-name medicine (methyldopa) used to treat high blood pressure.","zh":"Aldomet 是用于治疗高血压的品牌药名（有效成分为甲基多巴）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A brand name for methyldopa, a medicine used to treat high blood pressure (hypertension).","zh":"一种药品商品名（品牌名），其有效成分为甲基多巴，用于治疗高血压。"},"examples":[{"en":"My doctor switched me to Aldomet to help control my blood pressure.","zh":"医生把我的药换成了 Aldomet，来帮助控制血压。"},{"en":"Aldomet is an older blood-pressure medicine and may cause drowsiness in some people.","zh":"Aldomet 是一种较早的降压药，有些人服用后可能会犯困。"}]}],"synonyms":["methyldopa","antihypertensive"],"phonetic":"ˈældəˌmɛt","extraExplanation":["Aldomet 是“商品名/品牌名”，药品通用名是 methyldopa（甲基多巴）。不同国家或地区可能用不同品牌，但成分相同。","它属于中枢性降压药（通过影响神经系统来降低血压）。临床上也常被提到与“妊娠期高血压/孕期用药”相关，但是否适合个人情况必须遵医嘱。","常见搭配表达：take Aldomet（服用Aldomet），be on Aldomet（正在用Aldomet治疗），Aldomet for hypertension（用于高血压的Aldomet）。"]}
{"word":"Aldon","summary":{"en":"Aldon is mainly used as a male first name, and sometimes as a surname.","zh":"Aldon 主要用作男性名字，有时也用作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name).","zh":"男性名字（名）。"},"examples":[{"en":"Aldon is joining our team next week.","zh":"Aldon 下周加入我们的团队。"},{"en":"I met Aldon at a conference in Chicago.","zh":"我在芝加哥的一场会议上认识了 Aldon。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname), less common than the first name.","zh":"姓氏（较少见）。"},"examples":[{"en":"Dr. Aldon will speak at the seminar.","zh":"Aldon 博士将在研讨会上发言。"},{"en":"Her last name is Aldon.","zh":"她的姓是 Aldon。"}]}],"synonyms":["Alden","Alton","Arden"],"phonetic":"/ˈæl.dən/","extraExplanation":["Aldon 通常被视为英语人名，常见于美国等英语国家。实际使用中，有时也可能是 Alden 的变体或受其影响。Alden 的传统解释之一与古英语/古日耳曼语词根有关，常被民间理解为“老朋友（old friend）”之类的含义，但姓名的真实来源在不同家谱或地区记录中可能略有差异。","作为专有名词（人名/姓氏），Aldon 一般不翻译含义，通常按发音音译；在正式文件中要注意大小写首字母大写。"]}
{"word":"aldonic","summary":{"en":"A chemistry adjective meaning “related to aldonic acids (oxidized aldose sugars).”","zh":"化学用形容词，表示“与醛糖酸（由醛糖氧化生成的糖酸）有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to an aldonic acid (a type of sugar-derived acid formed when an aldose is oxidized at the aldehyde group to a carboxylic acid).","zh":"与“醛糖酸（aldonic acid）”有关的；指醛糖的醛基被氧化成羧酸后形成的一类糖酸。"},"examples":[{"en":"Gluconic acid is an aldonic acid, so it can be described as an aldonic compound.","zh":"葡萄糖酸（gluconic acid）是一种醛糖酸，因此可以称为“aldonic”化合物。"},{"en":"In carbohydrate chemistry, aldonic acids often appear in discussions of mild oxidation of sugars.","zh":"在糖类化学中，醛糖酸常出现在关于糖的温和氧化反应的讨论里。"}]}],"synonyms":["related to aldonic acid","gluconic (in specific contexts)"],"phonetic":"/ælˈdɑːnɪk/","extraExplanation":["“Aldonic”主要用于化学/生物化学语境，日常英语几乎不用。最常见的例子是 gluconic acid（葡萄糖酸），它来自 glucose（葡萄糖，属于 aldose 醛糖）在醛基位置被氧化后生成的酸。","构词上：aldo- 表示“醛糖/醛（aldehyde）相关”，-onic 常用于某些有机酸或其相关形容词的命名中。"]}
{"word":"aldononose","summary":{"en":"“aldononose” isn’t a standard English word; it most likely means “I don’t know.”","zh":"“aldononose”不是标准英语词；很可能想表达“我不知道（I don’t know）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It looks like a misspelling or a playful phonetic spelling of “I don’t know.”","zh":"不是标准英语单词；看起来像拼写错误或用拟声/随意拼法写的 “I don’t know（我不知道）”。"},"examples":[{"en":"If you meant “I don’t know,” you can write: I don’t know.","zh":"如果你想表达“我不知道”，可以写：I don’t know。"},{"en":"In casual speech, people often say: I dunno.","zh":"在口语里，人们常说：I dunno（我不知道/不清楚）。"}]}],"synonyms":["I don't know","I dunno","I'm not sure","Beats me"],"phonetic":"/aɪ doʊnt noʊ/","extraExplanation":["“aldononose”在常见英语词典中查不到，不像是固定短语或俚语。你可能想写的是：\n1) “I don’t know.”（标准、通用）\n2) “I dunno.”（更口语、更随意）\n如果你告诉我它出现的句子/语境（例如你在哪里看到的），我可以更准确判断它到底想表达什么。"]}
{"word":"aldopentose","summary":{"en":"An aldopentose is a five-carbon monosaccharide with an aldehyde group (e.g., ribose).","zh":"醛戊糖是带有醛基的五碳单糖（例如核糖）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a five-carbon sugar (pentose) that has an aldehyde group; a type of monosaccharide commonly found in biology and biochemistry","zh":"醛戊糖：一种含五个碳原子并带有醛基的糖（戊糖），属于单糖，在生物学与生物化学中常见"},"examples":[{"en":"Ribose is an aldopentose that forms part of RNA.","zh":"核糖是一种醛戊糖，是 RNA 的组成部分。"},{"en":"In class, we learned to distinguish an aldopentose from a ketopentose by its functional group.","zh":"课堂上我们学习了通过官能团来区分醛戊糖与酮戊糖。"},{"en":"Many aldopentoses can exist in ring forms in water.","zh":"许多醛戊糖在水中可以以环状形式存在。"}]}],"synonyms":["pentose aldehyde (less common)","aldose (broader term)","pentose (broader term)"],"phonetic":"ˌæl.doʊˈpɛn.toʊs","extraExplanation":["“aldo-”表示“醛（aldehyde）”，“-pentose”表示“戊糖（五碳糖）”。常见例子包括 ribose（核糖）和 arabinose（阿拉伯糖）。在溶液中它们常以环状结构为主，但在命名与分类时仍按“含醛基的五碳单糖”来归类。","学习相关词：ketopentose（酮戊糖，如 ribulose 核酮糖）、hexose（己糖，如 glucose 葡萄糖）、aldose/ketose（醛糖/酮糖）。"]}
{"word":"Aldora","summary":{"en":"Aldora is most commonly used as a proper name (often a female given name), and it can also be used as a brand or place name depending on context.","zh":"Aldora 最常见用法是专有名词（常作女性人名），也可能作为品牌名或地名，具体含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A female given name (a personal name).","zh":"女性名字（人名）。"},"examples":[{"en":"Aldora introduced herself to the class on the first day.","zh":"开学第一天，Aldora 向全班做了自我介绍。"},{"en":"I met someone named Aldora at the conference.","zh":"我在会议上认识了一个叫 Aldora 的人。"}]},{"partOfSpeech":"other","definition":{"en":"A place name or brand name in some contexts (for example, a business, product, or fictional location).","zh":"在某些语境中可作地名或品牌名（例如公司、产品名或虚构地点）。"},"examples":[{"en":"Aldora is the name of a local business in my area.","zh":"Aldora 是我家附近一家本地公司的名字。"},{"en":"In the novel, Aldora is a coastal town where the story begins.","zh":"在小说里，Aldora 是故事开始的海滨小镇。"}]}],"phonetic":"/ælˈdɔrə/","extraExplanation":["“Aldora”更常见于专有名词（人名/品牌名/地名），因此含义通常取决于具体指代对象，而不是像普通词汇那样有固定词义。","发音在英语里一般按拼写读作 /ælˈdɔrə/（重音多在第二音节）。不同人名/品牌也可能有自己的读法。"]}
{"word":"Aldos","summary":{"en":"“Aldos” usually means more than one person named Aldo, or informally stands for “Aldo’s” (possessive) when the apostrophe is omitted.","zh":"“Aldos”通常表示多个叫 Aldo 的人，或在非正式写法中代指“Aldo’s”（省略撇号的所有格）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"plural form of “Aldo” (a male given name), meaning more than one person named Aldo.","zh":"“Aldo”（男性名字）的复数形式，表示不止一个叫 Aldo 的人。"},"examples":[{"en":"There are two Aldos in our class, so we call them Aldos A and B.","zh":"我们班有两个叫 Aldo 的人，所以我们叫他们 Aldo A 和 Aldo B。"},{"en":"The Aldos on the team both play defense.","zh":"队里那两位叫 Aldo 的人都踢（打）防守位置。"}]},{"partOfSpeech":"other","definition":{"en":"sometimes used informally as “Aldo’s” (possessive) when the apostrophe is omitted, referring to something belonging to a person named Aldo or to the store/brand ALDO.","zh":"有时口语/非正式写法中把 “Aldos” 当作 “Aldo’s”（省略撇号）来用，表示“属于 Aldo 的……”，或指 ALDO 店/品牌的……。"},"examples":[{"en":"Meet me at Aldos after work. (informal; meaning ALDO’s store)","zh":"下班后在 Aldos（ALDO 店）见。 （非正式说法）"},{"en":"That’s Aldos jacket. (informal; meaning Aldo’s jacket)","zh":"那是 Aldos 的夹克。 （非正式写法，等于 Aldo’s）"}]}],"synonyms":["Aldo (plural: Aldos)","Aldo’s (possessive)"],"phonetic":"/ˈældoʊz/","extraExplanation":["“Aldo”常见于意大利语、英语语境中的男性名字；“Aldos”本身不是很标准的词形，更常见的是复数用法（多个叫Aldo的人），或把“Aldo’s”写成“Aldos”（在短信、随手笔记里偶尔会这样省略撇号）。","如果你指的是鞋履品牌/店铺“ALDO”，更标准的写法是全大写“ALDO”；表示“去ALDO店”可以说“at ALDO”或“at the ALDO store”。"]}
{"word":"aldose","summary":{"en":"An aldose is a monosaccharide whose open-chain form contains an aldehyde group.","zh":"醛糖（aldose）是一类单糖，其开链形式含有醛基。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of monosaccharide (simple sugar) that has an aldehyde group (–CHO) in its open-chain form.","zh":"一种单糖（简单糖）；其直链（开链）形式含有醛基（–CHO）。"},"examples":[{"en":"Glucose is an aldose, while fructose is a ketose.","zh":"葡萄糖是醛糖（aldose），而果糖是酮糖（ketose）。"},{"en":"In water, an aldose often forms a ring structure, but it can still be classified by its aldehyde form.","zh":"在水中，醛糖常形成环状结构，但分类时仍以其醛形式为依据。"}]}],"synonyms":["aldehyde sugar"],"phonetic":"/ˈældoʊs/","extraExplanation":["“aldose”来自“aldehyde（醛）+ -ose（糖）”。-ose 是糖类常见后缀。","醛糖通常按碳原子数进一步分类：如 triose（丙糖）、pentose（戊糖，如核糖）、hexose（己糖，如葡萄糖）。","虽然很多醛糖在溶液中主要以环状形式存在，但它们与其他糖的区分仍基于开链结构中是否为醛基（对比 ketose：开链为酮基）。"]}
{"word":"aldoses","summary":{"en":"Aldoses are monosaccharide sugars that contain an aldehyde group in their open-chain form.","zh":"Aldoses 指在开链形式中含醛基的单糖（醛糖）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of sugar (monosaccharide) that has an aldehyde group (—CHO) when in its open-chain form; the plural form is aldoses.","zh":"一种糖（单糖），在其开链结构中含有醛基（—CHO）；“aldoses”是其复数形式。"},"examples":[{"en":"Glucose is an aldose, while fructose is a ketose.","zh":"葡萄糖是醛糖（aldose），而果糖是酮糖（ketose）。"},{"en":"Many aldoses can form ring structures in water, even though they are aldehydes in the open-chain form.","zh":"许多醛糖在水中会形成环状结构，尽管它们在开链形式下属于醛类。"}]}],"synonyms":["aldose sugars","aldehyde sugars","monosaccharides (context-dependent)"],"phonetic":"/ˈæl.doʊs.ɪz/","extraExplanation":["“aldose”来自“aldehyde（醛）+ -ose（糖类常见后缀）”，用来按官能团对单糖分类：醛糖（aldose）vs 酮糖（ketose）。","学习时可抓住一个判断点：开链形式中末端是醛基（—CHO）的一般称为醛糖；末端不是醛基、而在链中含酮基（C=O）的称为酮糖。","常见醛糖例子：ribose（核糖，五碳醛糖）、glucose（葡萄糖，六碳醛糖）。"]}
{"word":"aldoside","summary":{"en":"“Aldoside” means an aldose sugar—a monosaccharide with an aldehyde group in its open-chain form.","zh":"“aldoside”指醛糖：开链结构含醛基（–CHO）的单糖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An aldose sugar; a monosaccharide whose open-chain form contains an aldehyde group (–CHO).","zh":"醛糖；一种单糖，其开链形式含有醛基（–CHO）。"},"examples":[{"en":"Glucose is an aldoside because it has an aldehyde group in its linear form.","zh":"葡萄糖是醛糖，因为它的直链形式含有醛基。"},{"en":"In biochemistry, aldosides and ketosides are classified based on their carbonyl group.","zh":"在生物化学中，醛糖和酮糖通常按羰基类型来分类。"}]}],"synonyms":["aldose","aldo sugar"],"phonetic":"/ˈæl.doʊ.saɪd/","extraExplanation":["“aldoside”在现代教材里更常见的标准术语是“aldose（醛糖）”。有些资料会把它当作同义词使用，但在严谨写作中建议优先用“aldose”。","醛糖与酮糖（ketose）的区别在于：醛糖的羰基位于末端形成醛基，而酮糖的羰基通常在分子内部形成酮基。尽管糖在溶液中多以环状形式存在，这种分类仍基于其开链结构。"]}
{"word":"aldosterone","summary":{"en":"Aldosterone is an adrenal hormone that regulates sodium and water balance and helps control blood pressure.","zh":"醛固酮是肾上腺分泌的激素，调节钠和水的平衡，并帮助控制血压。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hormone made by the adrenal glands that helps the body control salt (sodium) and water levels, which affects blood pressure","zh":"一种由肾上腺分泌的激素，帮助身体调节盐（钠）和水的平衡，从而影响血压"},"examples":[{"en":"Aldosterone helps the kidneys keep the right amount of sodium and water in the body.","zh":"醛固酮帮助肾脏在体内维持适当的钠和水含量。"},{"en":"If aldosterone is too high, blood pressure may rise.","zh":"如果醛固酮过高，血压可能会上升。"},{"en":"The doctor ordered an aldosterone test to check the cause of low potassium.","zh":"医生安排了醛固酮检测，以检查低钾的原因。"}]}],"synonyms":["mineralocorticoid (class term)"],"phonetic":"/ælˈdɑstəˌroʊn/","extraExplanation":["发音中常见重音在第二个音节：al-DOS-ter-one（美式/英式会略有差异）。","常与“RAAS（肾素-血管紧张素-醛固酮系统）”一起出现：当身体觉得血容量/血压偏低时，会通过这套系统促使醛固酮增加，从而让肾脏“留盐留水”。","词源：aldo- 与“aldehyde（醛）”有关，-sterone 常见于类固醇激素名称中（如 testosterone 睾酮、progesterone 孕酮）。"]}
{"word":"aldosteronism","summary":{"en":"Aldosteronism is the overproduction of the hormone aldosterone, often leading to high blood pressure and low potassium.","zh":"醛固酮增多症是醛固酮分泌过多的疾病，常导致高血压与低钾。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical condition in which the body produces too much aldosterone (a hormone made by the adrenal glands), often causing high blood pressure and low potassium levels","zh":"醛固酮增多症：身体产生过多醛固酮（由肾上腺分泌的激素）的疾病，常导致高血压和低钾"},"examples":[{"en":"The doctor tested her blood potassium because aldosteronism can cause low potassium.","zh":"医生检测了她的血钾，因为醛固酮增多症会导致低钾。"},{"en":"If high blood pressure is hard to control, the clinician may consider aldosteronism as a cause.","zh":"如果高血压很难控制，临床医生可能会考虑醛固酮增多症作为病因之一。"}]}],"synonyms":["hyperaldosteronism","primary aldosteronism"],"phonetic":"/ælˌdɑːstɚˈoʊnɪzəm/","extraExplanation":["醛固酮（aldosterone）主要作用是让肾脏“保钠排钾”，从而影响体液量与血压；因此醛固酮过多常见表现为高血压、低钾、肌无力、抽筋、乏力等。","常见类型包括“原发性醛固酮增多症”（如肾上腺腺瘤或双侧增生导致）与“继发性醛固酮增多症”（如肾动脉狭窄、心衰等激活肾素-血管紧张素系统导致）。","英语里也常说 hyperaldosteronism（高醛固酮血症/醛固酮增多），意思非常接近；临床上可能会用 ‘primary aldosteronism’ 指代较常见、可筛查与治疗的原发性类型。"]}
{"word":"aldotetrose","summary":{"en":"An aldotetrose is a four‑carbon aldehyde sugar (a type of simple sugar).","zh":"aldotetrose 指“醛四糖”：一种含四个碳并带醛基的单糖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a monosaccharide (simple sugar) with four carbon atoms and an aldehyde group; a type of tetrose sugar.","zh":"一种含有四个碳原子并带有醛基的单糖；属于“四碳糖（tetrose）”中的“醛糖”。"},"examples":[{"en":"Erythrose and threose are the two common aldotetroses.","zh":"赤藓糖（erythrose）和苏糖（threose）是两种常见的醛四糖。"},{"en":"In biochemistry, an aldotetrose can appear as an intermediate in certain metabolic pathways.","zh":"在生物化学中，醛四糖可能作为某些代谢途径中的中间产物出现。"}]}],"synonyms":["aldose tetrose","aldotetrose sugar"],"phonetic":"ˌæl.doʊˈtɛ.troʊs","extraExplanation":["“aldo-”表示“醛（aldehyde）”，“-tetrose”表示“四碳糖”。合起来就是“带醛基的四碳单糖”。","醛四糖常见的具体成员是 erythrose（赤藓糖）和 threose（苏糖），它们互为立体异构体（空间构型不同）。在学习时可以把“aldotetrose”理解为一类糖的统称，而不是某一种单一分子名称。"]}
{"word":"Aldous","summary":{"en":"Aldous is a male first name; it can also refer specifically to the writer Aldous Huxley.","zh":"Aldous 是一个男性英文名；也常特指作家阿道司·赫胥黎。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name), used especially in English-speaking countries.","zh":"（男子）名字，常见于英语国家。"},"examples":[{"en":"Aldous is a relatively uncommon first name today.","zh":"Aldous 现在是一个相对不常见的英文名。"},{"en":"His parents named him Aldous after a writer they admired.","zh":"他的父母以一位他们欣赏的作家为由，给他取名 Aldous。"}]},{"partOfSpeech":"n.","definition":{"en":"(often referring to) Aldous Huxley (1894–1963), an English writer best known for the novel “Brave New World.”","zh":"（常指）阿道司·赫胥黎（Aldous Huxley，1894–1963），英国作家，以小说《美丽新世界》最为著名。"},"examples":[{"en":"Aldous Huxley wrote “Brave New World,” a classic dystopian novel.","zh":"阿道司·赫胥黎写了《美丽新世界》，这是一部经典的反乌托邦小说。"},{"en":"In class we compared Aldous Huxley with George Orwell.","zh":"课堂上我们把阿道司·赫胥黎和乔治·奥威尔作了比较。"}]}],"synonyms":["(as a name) Al","(as a reference) Huxley"],"phonetic":"/ˈɔldəs/","extraExplanation":["“Aldous”多被认为源自古英语名字“Ealdwulf”（大致含义与“old/ancient（古老的）”+“wolf（狼）”相关），后来演变出不同拼写形式。","在文化语境中，如果别人说“Have you read Aldous?”通常是省略说法，指读过阿道司·赫胥黎的作品。"]}
{"word":"aldovandi","summary":{"en":"Aldovandi is an Italian surname, often referring to the Renaissance naturalist Ulisse Aldrovandi.","zh":"Aldovandi 是意大利姓氏，常用来指文艺复兴时期的自然学家乌利塞·阿尔多万迪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper name) Aldovandi: an Italian surname, best known from Ulisse Aldrovandi (1522–1605), a pioneering naturalist and one of the early founders of modern natural history.","zh":"（专有名词）Aldovandi：意大利姓氏，最著名的是乌利塞·阿尔多万迪（1522–1605），早期自然学家与现代自然史的重要奠基者之一。"},"examples":[{"en":"Ulisse Aldovandi collected thousands of plant and animal specimens for study.","zh":"乌利塞·阿尔多万迪为研究收集了成千上万的动植物标本。"},{"en":"The museum in Bologna preserves materials connected to Aldovandi’s work.","zh":"博洛尼亚的一些博物馆保存着与阿尔多万迪研究有关的资料。"}]}],"synonyms":["Aldrovandi (common historical spelling)"],"phonetic":"/ˌɑl.doʊˈvɑn.di/","extraExplanation":["“Aldovandi”在英语中通常作为人名/姓氏出现，最常指文艺复兴时期的博洛尼亚学者Ulisse Aldrovandi。他以系统收集、分类自然标本并出版大型自然史著作而闻名，对后来的生物分类与博物馆传统影响很大。","拼写上你输入的是“Aldovandi”，常见历史人物的英文拼写是“Aldrovandi”（中间多一个r）。如果你指的是某本书、某个品牌或某个地名中的“Aldovandi”，也可能有不同来源。"]}
{"word":"aldoxime","summary":{"en":"An aldoxime is an oxime made from an aldehyde (R–CH=NOH).","zh":"醛肟是由醛生成的肟（R–CH=NOH）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Organic chemistry) An oxime derived from an aldehyde, with the general structure R–CH=NOH.","zh":"（有机化学）由醛生成的肟，通式为 R–CH=NOH。"},"examples":[{"en":"Acetaldoxime is an aldoxime made from acetaldehyde and hydroxylamine.","zh":"乙醛肟（acetaldoxime）是一种由乙醛与羟胺反应生成的醛肟。"},{"en":"Many aldoximes can exist as E/Z (syn/anti) isomers around the C=N bond.","zh":"许多醛肟在 C=N 双键附近会出现 E/Z（或 syn/anti）几何异构。"}]}],"synonyms":["aldehyde oxime"],"phonetic":"/ælˈdɑːksiːm/","extraExplanation":["“Aldoxime”由“aldo-（醛）+ oxime（肟）”构成，强调该肟来自醛；相对应的“ketoxime（酮肟）”来自酮，结构为 R2C=NOH。","醛肟常见于有机合成与分析化学中，例如作为中间体，或在某些反应（如脱水生成腈等）中出现。具体反应条件依底物与试剂而变。"]}
{"word":"Aldred","summary":{"en":"Aldred is a relatively uncommon English name used as a male first name or a surname.","zh":"Aldred 是较少见的英语人名，可作男性名字或姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name).","zh":"男性名字（名）。"},"examples":[{"en":"Aldred introduced himself at the meeting.","zh":"Aldred 在会议上做了自我介绍。"},{"en":"They named their son Aldred to honor a family tradition.","zh":"他们给儿子取名 Aldred，以纪念家族传统。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"姓氏。"},"examples":[{"en":"Ms. Aldred works in the library.","zh":"Aldred 女士在图书馆工作。"},{"en":"The article was written by Jordan Aldred.","zh":"这篇文章是 Jordan Aldred 写的。"}]}],"synonyms":["(related names) Alfred","(related names) Eldred"],"phonetic":"ˈɔldrəd","extraExplanation":["Aldred 是一个较少见的英语人名，常被认为源自古英语元素（常见解释为与“old/ancient（古老的）”和“counsel/advice（忠告、谋略）”相关），因此有时会被解读为“古老的忠告/智谋”。","在英国中世纪史里，Aldred 也可指一位重要人物：约克大主教/主教 Aldred（11 世纪）。在语言与书籍史中还常见到“（Aldred 的）林迪斯法恩福音书边注/释文（Old English gloss）”的相关讨论。"]}
{"word":"Aldredge","summary":{"en":"Aldredge is mainly used as a surname, and it can also be a spelling variant of Aldridge/Eldridge.","zh":"Aldredge 主要用作姓氏，也可能是 Aldridge/Eldridge 的拼写变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"姓氏（家族名）。"},"examples":[{"en":"Dr. Aldredge will see you now.","zh":"Aldredge 医生现在要见你。"},{"en":"My teacher’s last name is Aldredge.","zh":"我老师的姓是 Aldredge。"}]},{"partOfSpeech":"n.","definition":{"en":"a less common spelling variant of the surname “Aldridge/Eldridge.”","zh":"姓氏 “Aldridge/Eldridge” 的一种较少见的拼写变体。"},"examples":[{"en":"In old records, the same family name may appear as Aldredge or Aldridge.","zh":"在旧档案里，同一个家族姓氏可能写作 Aldredge 或 Aldridge。"},{"en":"She found both “Eldridge” and “Aldredge” in her family tree.","zh":"她在家谱里同时找到了 “Eldridge” 和 “Aldredge” 两种写法。"}]}],"synonyms":["Aldridge","Eldridge"],"phonetic":"/ˈɔl.drɪdʒ/","extraExplanation":["Aldredge 通常作为英美姓氏出现，不是常见的普通词汇。拼写变体在英语姓氏中很常见，原因包括早期记录员按读音拼写、移民登记时的误写/简写等。","词源上常与古英语人名成分相关（如表示“老/高贵”等含义的词根），并与 Eldridge/Aldridge 等姓氏家族有历史关联；但具体到某个家庭的来源，仍以家族文献与地域记录为准。"]}
{"word":"Aldric","summary":{"en":"Aldric is a male given name; it’s often linked to old Germanic roots meaning “old” + “ruler/power.”","zh":"Aldric 是一个男性名字；常被解释为源自古日耳曼语词根，含义为“古老的”+“统治/权力”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A male given name (first name), used mainly in English-speaking contexts; it has an old, medieval feel.","zh":"男性名字（名），主要见于英语语境；带有较古老、偏中世纪的气息。"},"examples":[{"en":"Aldric introduced himself at the meeting.","zh":"Aldric 在会上做了自我介绍。"},{"en":"In the novel, Aldric is a knight loyal to the king.","zh":"在小说里，Aldric 是一位忠于国王的骑士。"}]},{"partOfSpeech":"n.","definition":{"en":"In name history, Aldric is often explained as coming from old Germanic roots meaning “old” + “ruler/power,” suggesting “old ruler” or “wise ruler.”","zh":"在姓名词源解释中，Aldric 常被认为来自古日耳曼语词根，意为“古老的”+“统治者/权力”，可理解为“年长的统治者”或“睿智的统治者”。"},"examples":[{"en":"The family chose the name Aldric for its meaning and traditional sound.","zh":"这家人因为寓意和传统的音韵选择了 Aldric 这个名字。"}]}],"synonyms":["Alaric","Aldrich"],"phonetic":"/ˈɔldrɪk/","extraExplanation":["Aldric 属于较少见的英文男性名，因此在现代日常生活中不算常见；在奇幻文学、游戏或带“中世纪/骑士”氛围的作品中更容易出现。","常见相近/易混名字：Alaric（更常见）、Aldrich（拼写相近，也可作姓氏）。"]}
{"word":"Aldrich","summary":{"en":"Aldrich is most commonly an English-origin surname, and it can also appear as a name for places or institutions.","zh":"Aldrich 最常见是英语来源的姓氏，也可能出现在地名或机构名称中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname) of English origin; used as a person’s last name.","zh":"一个英语来源的姓氏；用作人的“姓/家族名”。"},"examples":[{"en":"My professor’s last name is Aldrich.","zh":"我教授的姓是 Aldrich。"},{"en":"Aldrich wrote a short note at the end of the report.","zh":"Aldrich 在报告末尾写了一段简短的说明。"}]},{"partOfSpeech":"n.","definition":{"en":"a place or institution name (often a name of buildings, schools, museums, companies, etc.).","zh":"地名或机构名（常用于建筑、学校、博物馆、公司等名称）。"},"examples":[{"en":"We met near Aldrich Hall after class.","zh":"下课后我们在 Aldrich Hall 附近见面。"},{"en":"She works at a company with “Aldrich” in its name.","zh":"她在一家名称里带有 “Aldrich” 的公司工作。"}]}],"phonetic":"/ˈɔldrɪtʃ/","extraExplanation":["Aldrich 多见于英语国家的姓氏系统中，读音通常重音在第一个音节：AL-drich。","词源上常被认为与古英语元素有关（大意与“old/古老”以及“rule/power/统治”相关），也常被视为 Eldridge 等姓氏的变体拼写之一。","在阅读中看到 Aldrich 时，先根据上下文判断：它通常是人名（姓），也可能是某个建筑/机构/地点的专名。专有名词一般首字母大写。"]}
{"word":"Aldridge","summary":{"en":"Aldridge is mainly an English surname; it can also refer to a town in England, and only rarely a given name.","zh":"Aldridge主要是英源姓氏；也可指英格兰的一座城镇；作为名字使用较少见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname) of English origin","zh":"（英源）姓氏：奥尔德里奇 / 奥德里奇（常见译法之一）"},"examples":[{"en":"Ms. Aldridge will lead today’s meeting.","zh":"奥尔德里奇女士将主持今天的会议。"},{"en":"I emailed Professor Aldridge about the assignment.","zh":"我给奥尔德里奇教授发邮件问了作业的事。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name; Aldridge is a town in the West Midlands, England","zh":"地名：奥尔德里奇（英格兰西米德兰兹郡的一座城镇）"},"examples":[{"en":"He grew up in Aldridge before moving to London.","zh":"他在奥尔德里奇长大，后来搬去了伦敦。"},{"en":"Aldridge is not far from Birmingham.","zh":"奥尔德里奇离伯明翰不远。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name in rare cases (more often seen as a surname)","zh":"（较少见）人名：作名字用，但更常见于姓氏"},"examples":[{"en":"Their son is named Aldridge, after his grandfather.","zh":"他们的儿子取名叫Aldridge，以纪念祖父。"}]}],"synonyms":["(no true synonyms; it’s a proper name)"],"phonetic":"/ˈɔl.drɪdʒ/","extraExplanation":["“Aldridge”常被认为来自古英语词根，含义与“old（古老的）+ ridge（山脊/山岭）”相关，因此可理解为“古老的山脊/高地”之意。","作为专有名词，它在英文里通常不翻译含义，而是音译；中文译名会因地区与习惯不同而有差异（如“奥尔德里奇”等）。"]}
{"word":"Aldridge-Brownhills","summary":{"en":"A place name in the West Midlands, England, also used for a UK parliamentary constituency.","zh":"英国英格兰西米德兰兹地区的地名，也用作英国议会下议院选区名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A town and suburban area in the West Midlands, England, historically connected with the communities of Aldridge and Brownhills; it is also used in the name of a UK parliamentary constituency.","zh":"英格兰西米德兰兹地区的一个城镇/郊区区域，历史上与Aldridge和Brownhills两个社区相关；该名称也用于英国议会下议院的选区名称。"},"examples":[{"en":"She grew up in Aldridge-Brownhills before moving to Birmingham.","zh":"她在Aldridge-Brownhills长大，后来搬到了伯明翰。"},{"en":"The MP for Aldridge-Brownhills spoke about local transport and housing.","zh":"Aldridge-Brownhills选区的议员谈到了当地交通和住房问题。"}]}],"synonyms":["Aldridge","Brownhills","West Midlands","(UK) parliamentary constituency"],"phonetic":"/ˈɔl.drɪdʒ ˈbraʊn.hɪlz/","extraExplanation":["这是一个带连字符的地名写法，常见于英国：用来把两个相邻/关联的社区名称连接起来，表示更大的区域或行政/选区范围。","在新闻或政治语境里，它更常指“英国议会下议院选区（constituency）”，用于讨论选举、议员（MP）或地方议题。"]}
{"word":"Aldrin","summary":{"en":"Aldrin most often refers to Buzz Aldrin, the Apollo 11 astronaut; it can also mean a toxic insecticide called aldrin.","zh":"Aldrin最常指阿波罗11号宇航员巴兹·奥尔德林；也可指一种名为艾氏剂的有毒杀虫剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Buzz Aldrin (Edwin E. Aldrin Jr.), an American astronaut who became the second person to walk on the Moon during the Apollo 11 mission in 1969.","zh":"巴兹·奥尔德林（Edwin E. Aldrin Jr.），美国宇航员，1969年阿波罗11号任务中第二位登上月球行走的人。"},"examples":[{"en":"Buzz Aldrin and Neil Armstrong walked on the Moon in 1969.","zh":"巴兹·奥尔德林和尼尔·阿姆斯特朗在1969年登上月球行走。"},{"en":"Aldrin later worked to promote space exploration.","zh":"奥尔德林后来致力于推动太空探索。"}]},{"partOfSpeech":"n.","definition":{"en":"Aldrin, a synthetic chemical insecticide (a pesticide) once widely used but later restricted or banned in many countries due to environmental and health concerns.","zh":"艾氏剂（Aldrin），一种合成杀虫剂（农药），曾被广泛使用，但因环境与健康风险在许多国家被限制或禁用。"},"examples":[{"en":"Aldrin was used to control insects, but it can persist in the environment.","zh":"艾氏剂曾用于防治昆虫，但它可能在环境中长期残留。"},{"en":"Many regulations limit aldrin because of its toxicity.","zh":"由于毒性问题，许多法规对艾氏剂进行了限制。"}]}],"synonyms":["Buzz Aldrin","insecticide","pesticide"],"phonetic":"/ˈɔːldrɪn/","extraExplanation":["“Buzz Aldrin”常与“Apollo 11（阿波罗11号）”“Moon landing（月球登陆）”一起出现；新闻与历史写作里也会说他是“the second man on the Moon（登月第二人）”。","作为化学品的“aldrin”通常写小写，属于有机氯类杀虫剂；学习时可注意：专有名词（人名）常大写，而化学品/普通名词多小写。"]}
{"word":"aldrin","summary":{"en":"Aldrin is a toxic, persistent insecticide that is now banned or tightly controlled in many places.","zh":"Aldrin 是一种毒性强、持久性的杀虫剂，如今在许多地区已被禁用或严格管制。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a highly toxic, long-lasting (persistent) chlorinated insecticide that was once used to kill insects in agriculture and pest control, but is now banned or strictly restricted in many countries because it can harm humans, animals, and the environment.","zh":"一种毒性很强、在环境中难以分解（持久性）的含氯杀虫剂，曾用于农业与害虫防治；由于对人体、动物及环境危害较大，如今在许多国家已被禁用或严格限制。"},"examples":[{"en":"Aldrin was widely used on crops before many governments banned it.","zh":"在许多国家禁止之前，aldrin 曾被广泛用于农作物上。"},{"en":"Scientists found aldrin residues in soil and wildlife near old farming sites.","zh":"科学家在旧农田附近的土壤和野生动物中发现了 aldrin 残留。"},{"en":"The report lists aldrin as a persistent organic pollutant with serious risks.","zh":"报告将 aldrin 列为具有严重风险的持久性有机污染物。"}]}],"synonyms":["chlorinated insecticide (category term)","organochlorine pesticide (category term)"],"phonetic":"/ˈɔldrɪn/","extraExplanation":["Aldrin 常与 dieldrin 一起出现：aldrin 在环境或生物体内可能转化为 dieldrin。","它属于“持久性有机污染物（POPs）”类别，因易在食物链中累积而引发关注；在环境议题与公共卫生文本中较常见。","注意：aldrin 与美国宇航员 Buzz Aldrin（奥尔德林）同形但无关；这里是化学品名称。"]}
{"word":"aldrins","summary":{"en":"“Aldrins” usually means multiple instances of the pesticide aldrin; less commonly, it means more than one person named Aldrin.","zh":"“aldrins”通常指杀虫剂aldrin的复数；较少见的用法是指多位姓Aldrin的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A plural form of aldrin: a manufactured chemical once used as an insecticide (to kill insects), now banned or tightly restricted in many countries because it can persist in the environment and harm wildlife and human health.","zh":"aldrin（艾氏剂/艾氏杀虫剂）的复数：一种人工合成、曾用于杀虫的化学物质；因对环境与健康风险较大，在许多国家已被禁用或严格限制。"},"examples":[{"en":"Some older reports mention aldrins and other pesticides used on crops.","zh":"一些较早的报告会提到aldrins以及其他用于农作物的农药。"},{"en":"Scientists tested soil samples for aldrins and related chemicals.","zh":"科学家检测土壤样本中是否含有aldrins及其相关化学物质。"}]},{"partOfSpeech":"other","definition":{"en":"The plural of Aldrin (a family name), referring to more than one person with the surname Aldrin.","zh":"姓氏Aldrin的复数：指不止一位姓Aldrin的人。"},"examples":[{"en":"In the archive, the Aldrins are listed in two different decades.","zh":"在档案里，Aldrins这一家（或这些姓Aldrin的人）出现在两个不同的年代。"}]}],"synonyms":["(chemical sense) insecticides","organochlorine pesticides"],"phonetic":"/ˈɔldrɪnz/","extraExplanation":["“Aldrin”作为杀虫剂名称来自化学命名体系；它属于持久性有机污染物（POPs）相关讨论中常见的词。阅读环境新闻或旧农业资料时可能会遇到。","另外，“Aldrin”也是著名宇航员Buzz Aldrin（巴兹·奥尔德林）的姓；不过“aldrins”通常更像是化学品复数或姓氏复数，需结合上下文判断。"]}
{"word":"Aldrovanda","summary":{"en":"Aldrovanda is the scientific name of the waterwheel-plant genus, a floating aquatic carnivorous plant.","zh":"Aldrovanda 是“捕虫水轮草属”的学名，指一种漂浮的水生食虫植物类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small, free-floating aquatic carnivorous plants (the waterwheel plants), especially the species Aldrovanda vesiculosa.","zh":"一种小型、自由漂浮的水生食虫植物属（捕虫水轮草属）；尤指“水轮草”（Aldrovanda vesiculosa）这一物种。"},"examples":[{"en":"Aldrovanda is a carnivorous plant that traps tiny aquatic animals.","zh":"Aldrovanda（捕虫水轮草属植物）会捕捉微小的水生动物。"},{"en":"The waterwheel plant (Aldrovanda vesiculosa) is rare in many regions.","zh":"水轮草（Aldrovanda vesiculosa）在许多地区都很稀有。"}]}],"synonyms":["waterwheel plant (common name, especially for A. vesiculosa)"],"phonetic":"/ˌæl.droʊˈvæn.də/","extraExplanation":["词源：Aldrovanda 来自意大利博物学家 Ulisse Aldrovandi（乌利塞·阿尔德罗万迪）的姓氏，属名用来纪念他。","背景：Aldrovanda 和捕蝇草（Venus flytrap）是近亲，都用“啪”地合拢的叶片捕食；但 Aldrovanda 生活在水中，捕食水蚤等微小动物。"]}
{"word":"aldrovanda","summary":{"en":"Aldrovanda is the waterwheel plant, a rare aquatic carnivorous plant with tiny snap-traps.","zh":"Aldrovanda 指“水轮草/水车草”，一种稀有的水生食虫植物，靠微型合拢式陷阱捕食。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small genus of aquatic carnivorous plants (especially Aldrovanda vesiculosa), known for tiny snap-traps that catch insects and other small water animals; also called the waterwheel plant","zh":"一种小型的水生食虫植物属（尤指囊泡狸藻 Aldrovanda vesiculosa），以能“啪”地合拢的微型捕虫夹捕捉昆虫及小型水生动物而闻名；也叫“水轮草/水车草（waterwheel plant）”"},"examples":[{"en":"Aldrovanda is a rare carnivorous plant that lives floating in still freshwater.","zh":"Aldrovanda 是一种稀有的食虫植物，漂浮生活在静止的淡水中。"},{"en":"In the documentary, Aldrovanda snaps shut to trap tiny aquatic prey.","zh":"在纪录片里，Aldrovanda 会迅速合拢，捕捉微小的水生猎物。"}]}],"synonyms":["waterwheel plant"],"phonetic":"/ˌæl.droʊˈvæn.də/","extraExplanation":["“Aldrovanda”是植物学里的拉丁化名称，通常在英语中作为专有名词使用，首字母大写（Aldrovanda）。","它的捕虫机制常被拿来与捕蝇草（Venus flytrap）比较：都是“夹子式”陷阱，但 Aldrovanda 完全水生、陷阱更小、猎物多为水中的小生物。","在科普与自然写作中，它常被用来表现“看似安静的水面下也有捕食与竞争”的主题。"]}
{"word":"Aldrovandi","summary":{"en":"Aldrovandi is usually a proper noun: most often the name of Ulisse Aldrovandi, a Renaissance Italian naturalist, and also an Italian surname.","zh":"Aldrovandi 通常是专有名词：多指文艺复兴时期的意大利博物学家乌利塞·阿尔德罗万迪，也可作意大利姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ulisse Aldrovandi (1522–1605), an Italian naturalist and one of the early founders of natural history; his name is often used in academic contexts to refer to his writings, collections, or illustrations of plants and animals.","zh":"乌利塞·阿尔德罗万迪（1522–1605），意大利博物学家、早期自然史的重要奠基者之一；在学术语境中常用其姓名指代他的著作、标本收藏或动植物插图。"},"examples":[{"en":"Aldrovandi’s books include detailed drawings of animals, typical of Renaissance natural history.","zh":"阿尔德罗万迪的著作包含许多动物的细致图绘，具有文艺复兴时期自然史的典型风格。"},{"en":"The museum catalog mentions specimens linked to Aldrovandi’s collection.","zh":"博物馆目录提到了一些与阿尔德罗万迪收藏有关的标本。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname), most commonly Italian; used to refer to a person or family named Aldrovandi.","zh":"姓氏（多见于意大利）；用于指名为 Aldrovandi 的个人或家族。"},"examples":[{"en":"Professor Aldrovandi will speak on the history of scientific illustration.","zh":"Aldrovandi 教授将就科学插图史进行演讲。"},{"en":"I found an email from someone named Aldrovandi.","zh":"我收到了一封署名为 Aldrovandi 的邮件。"}]}],"phonetic":"/ˌæl.droʊˈvɑn.di/","extraExplanation":["“Aldrovandi”在英语里通常作为专有名词出现，常见于自然史、博物馆学、文艺复兴科学史等领域。","阿尔德罗万迪以建立大型标本与图像档案而闻名；在他所处的时代，“博物学”常把观察、收集与绘图结合在一起，是现代生物学与博物馆收藏传统的重要前身。"]}
{"word":"Alduin","summary":{"en":"Alduin is a fictional dragon character from *Skyrim*, known as the “World-Eater.”","zh":"Alduin是《上古卷轴V：天际》中的虚构巨龙角色，被称为“吞世者（World-Eater）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) Alduin: the main dragon antagonist in *The Elder Scrolls V: Skyrim*, also called the “World-Eater,” a legendary dragon prophesied to end the world in the game’s lore.","zh":"（专有名词）Alduin：游戏《上古卷轴V：天际》（*Skyrim*）中的主要反派巨龙，也被称为“吞世者（World-Eater）”，在该系列设定中被预言将吞噬世界的传奇巨龙。"},"examples":[{"en":"In *Skyrim*, the Dragonborn fights Alduin to stop the end of the world.","zh":"在《天际》中，龙裔与Alduin战斗，以阻止世界终结。"},{"en":"Players often remember Alduin as the dragon who appears during the execution scene at the start of the game.","zh":"许多玩家会记得Alduin是在游戏开场处决场景中出现的那条龙。"},{"en":"Alduin is sometimes confused with other dragons, but he has a special role in the story.","zh":"Alduin有时会和其他龙混淆，但他在剧情中有独特且关键的地位。"}]}],"synonyms":["World-Eater (title)"],"phonetic":"/ˈɔl.duːɪn/","extraExplanation":["“Alduin”主要是虚构作品中的专名，一般不翻译（或按音译写作“奥杜因/阿尔杜因”等），但在中文玩家社区里常直接用英文名“Alduin”。","在《上古卷轴》的世界观里，Alduin不仅是“强大的龙”，还带有“神话预言与末日循环”的象征意义；“World-Eater（吞世者）”更像是头衔/称号，而不是普通描述。"]}
{"word":"Alduino","summary":{"en":"“Alduino” is usually a misspelling of “Arduino,” an open-source microcontroller platform for electronics projects.","zh":"“Alduino”通常是“Arduino”的误拼；Arduino 是用于电子项目的开源微控制器平台。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Arduino: an open-source electronics platform (a small programmable circuit board and its software) used to build interactive projects.","zh":"Arduino：一种开源电子平台（可编程电路板及其软件），常用于制作互动电子项目。"},"examples":[{"en":"I built a simple robot with an Arduino board.","zh":"我用一块 Arduino 板做了一个简单的机器人。"},{"en":"Arduino is popular for beginners learning electronics and coding.","zh":"Arduino 很受电子与编程初学者欢迎。"}]},{"partOfSpeech":"other","definition":{"en":"(Common mistake) “Alduino” is often a misspelling of “Arduino.”","zh":"（常见错误）“Alduino” 常被用来误拼 “Arduino”。"},"examples":[{"en":"Did you mean Arduino (not Alduino)?","zh":"你是想说 Arduino（不是 Alduino）吗？"}]}],"synonyms":["microcontroller","development board","electronics platform"],"phonetic":"/ɑrˈdwiːnoʊ/","extraExplanation":["“Arduino”这个名字来自意大利伊夫雷亚（Ivrea）的一家酒吧“Bar di Re Arduino”，而“Arduino”也是一位中世纪意大利国王的名字。它之所以常见，是因为硬件和软件都相对容易上手，社区资源也非常丰富。"]}
{"word":"Aldus","summary":{"en":"Aldus is usually a proper noun: a rare male name, most famously Aldus Manutius (a Renaissance printer), and it can also refer to the former software company Aldus (PageMaker).","zh":"Aldus 通常是专有名词：可作少见的男性名字；最常指文艺复兴时期的印刷出版家阿尔杜斯·马努提乌斯；也可指曾推出 PageMaker 的软件公司 Aldus。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (rare in modern use)","zh":"男性名字（现代较少见）"},"examples":[{"en":"Aldus is an unusual first name in the U.S.","zh":"Aldus 在美国是个不太常见的名字。"},{"en":"His parents named him Aldus after a famous Renaissance printer.","zh":"他父母给他取名为 Aldus，是为了纪念一位著名的文艺复兴时期印刷家。"}]},{"partOfSpeech":"n.","definition":{"en":"Aldus Manutius (c. 1450–1515), an influential Renaissance Italian printer and publisher, known for the Aldine Press and popularizing italic type and small, portable books","zh":"阿尔杜斯·马努提乌斯（约1450—1515）：文艺复兴时期意大利重要的印刷商与出版家，创办“阿尔杜斯印刷所（Aldine Press）”，推广斜体字并推动小开本便携书的流行"},"examples":[{"en":"Aldus Manutius helped make classical Greek and Latin texts more widely available.","zh":"阿尔杜斯·马努提乌斯帮助古典希腊和拉丁文作品更广泛地流传。"},{"en":"Many book historians link Aldus to the rise of affordable, portable editions.","zh":"许多图书史研究者把平价便携版本的兴起与 Aldus 联系在一起。"}]},{"partOfSpeech":"n.","definition":{"en":"Aldus Corporation, a former U.S. software company (later acquired by Adobe) known for PageMaker, an early desktop-publishing program","zh":"Aldus 公司：美国一家已被 Adobe 收购的旧软件公司，以早期桌面出版软件 PageMaker 闻名"},"examples":[{"en":"In the 1980s, Aldus PageMaker was a major tool for desktop publishing.","zh":"在20世纪80年代，Aldus PageMaker 是桌面出版领域的重要工具。"}]}],"synonyms":["(proper noun) Manutius (for the person)","Aldine (related term)"],"phonetic":"/ˈɔldəs/","extraExplanation":["“Aldus”在英语里多作为专有名词出现：要么指文艺复兴时期的印刷家 Aldus Manutius，要么指早期软件公司 Aldus。读到与书籍、排版、字体（如斜体 italic）有关的语境时，通常指前者。","“Aldine Press（阿尔杜斯印刷所）/ Aldine edition（阿尔杜斯版本）”常见于书籍史、出版史与图书馆学语境，用来指该印刷所出版的版本或与其风格相关的出版物。"]}
{"word":"aldus","summary":{"en":"Aldus is mainly used as a male name, and it can also refer to the famous Renaissance printer Aldus Manutius (and by extension his publishing tradition).","zh":"Aldus 主要作男性人名；也常指文艺复兴时期著名印刷出版家阿尔杜斯·马努提乌斯（及其出版传统）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a male given name.","zh":"男性名字（人名）。"},"examples":[{"en":"Aldus is a character in the novel.","zh":"Aldus 是小说里的一个角色。"},{"en":"His parents named him Aldus after a historical figure.","zh":"他父母以一位历史人物为名，给他取名 Aldus。"}]},{"partOfSpeech":"other","definition":{"en":"(often referring to Aldus Manutius) a famous Italian Renaissance printer and publisher; his work is strongly associated with high-quality book design and early italic type.","zh":"（常指 Aldus Manutius，阿尔杜斯·马努提乌斯）意大利文艺复兴时期著名的印刷家、出版家；以精良的书籍设计与早期斜体字的发展而闻名。"},"examples":[{"en":"The museum has an exhibition on Aldus and early printing.","zh":"博物馆有一场关于阿尔杜斯与早期印刷术的展览。"},{"en":"This edition is inspired by Aldus’s classic book design.","zh":"这个版本的设计灵感来自阿尔杜斯的经典书籍排版。"}]},{"partOfSpeech":"other","definition":{"en":"(technology) a brand name once used for a software company known for desktop publishing tools (e.g., PageMaker).","zh":"（科技）曾用于一家软件公司的品牌名，以桌面出版工具闻名（如 PageMaker）。"},"examples":[{"en":"In the early days of desktop publishing, Aldus PageMaker was widely used.","zh":"在桌面出版的早期，Aldus PageMaker 曾被广泛使用。"}]}],"synonyms":["Aldus Manutius (as a specific reference)","Aldine (related term)"],"phonetic":"ˈældəs","extraExplanation":["“Aldus”最常见的文化含义来自阿尔杜斯·马努提乌斯（Aldus Manutius，约1450–1515）。他在威尼斯创办“阿尔杜斯印刷所”（Aldine Press），以出版希腊、拉丁经典著作闻名，并推动更便携的小开本书籍与字体排印的发展。","英语里你可能会看到相关词：Aldine（阿尔杜斯的／阿尔杜斯印刷所的），常用来形容其风格或版本。"]}
{"word":"Aldus-related","summary":{"en":"Aldus-related means “connected with Aldus,” usually referring either to Aldus Manutius (printing history) or to the former Aldus software company (desktop publishing).","zh":"Aldus-related 指“与 Aldus 有关”，通常要么指印刷史上的阿尔杜斯·马努提乌斯，要么指曾经的 Aldus 软件公司（桌面出版）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with Aldus (usually Aldus Manutius, the Renaissance Venetian printer), or with things associated with him such as Aldine editions and italic type.","zh":"与“Aldus”（通常指文艺复兴时期威尼斯印刷家阿尔杜斯·马努提乌斯）有关的；或与其相关事物（如“阿尔丁版”出版物、意大利斜体字等）有关的。"},"examples":[{"en":"The exhibit included Aldus-related books printed in Venice in the early 1500s.","zh":"展览包含了一些与阿尔杜斯相关、在16世纪初于威尼斯印刷的书籍。"},{"en":"Scholars study Aldus-related typography to understand the spread of italic type.","zh":"学者研究与阿尔杜斯相关的字体排印，以了解斜体字的传播。"}]},{"partOfSpeech":"adj.","definition":{"en":"connected with Aldus (often meaning the former publishing/software company known for PageMaker).","zh":"与“Aldus”（常指曾经的出版/软件公司，因 PageMaker 而知名）有关的。"},"examples":[{"en":"She found an Aldus-related manual for early desktop publishing.","zh":"她找到了一本与 Aldus 相关的早期桌面出版（DTP）手册。"},{"en":"The archive preserves Aldus-related files from the PageMaker era.","zh":"该档案馆保存了 PageMaker 时代与 Aldus 相关的文件。"}]}],"synonyms":["Aldine","associated with Aldus","Aldus-linked"],"phonetic":"ˈæl.dəs rɪˈleɪ.tɪd","extraExplanation":["“Aldus-related”常见于学术或博物馆语境。若指阿尔杜斯·马努提乌斯（Aldus Manutius），相关词有 **Aldine**（阿尔丁的/阿尔杜斯印刷所的）、**Aldine edition**（阿尔丁版）。他与便携“小开本”书籍和推动斜体字（italic）普及有关。","若指软件公司 Aldus（后被 Adobe 收购），最常被提到的是 **PageMaker**（早期桌面排版软件）。语境不同，含义也会不同，通常可从“印刷史/文献学”或“电脑排版史”来判断。"]}
{"word":"Aldwin","summary":{"en":"Aldwin is an uncommon male first name, from Old English meaning “old friend.”","zh":"Aldwin 是一个较少见的男性英文名，源自古英语，含义为“老朋友”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name), relatively uncommon today.","zh":"男性名字（名），如今较少见。"},"examples":[{"en":"Aldwin joined the team as a new software engineer.","zh":"Aldwin 以新软件工程师的身份加入了团队。"},{"en":"I met someone named Aldwin at the conference.","zh":"我在会议上认识了一个叫 Aldwin 的人。"}]}],"synonyms":["Aldwyn","Aldwine"],"phonetic":"/ˈɔːldwɪn/","extraExplanation":["Aldwin 是源自古英语的名字，常被解释为“old friend（老朋友）”：ald/old 表示“古老的、年长的”，wine 表示“朋友”。","在中世纪英格兰更常见，现代英语语境里属于较为罕见、带一点复古气质的名字。","常见拼写变体包括：Aldwyn、Aldwine。与其词源相关的名字有 Edwin、Godwin（都含有 -win/-wine “朋友”的成分）。"]}
{"word":"Aldwine","summary":{"en":"Aldwine is a rare English name (and sometimes a surname) meaning “old friend.”","zh":"Aldwine 是较少见的英语人名（有时也作姓），常被解释为“老朋友／古老的朋友”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name), of Old English origin, meaning “old friend.”","zh":"男性名字（名），源自古英语，常被解释为“老朋友／古老的朋友”。"},"examples":[{"en":"Aldwine is a rare name today, but it appears in older English records.","zh":"Aldwine 现在比较少见，但在较早的英国历史记录中能看到。"},{"en":"In the story, Aldwine is portrayed as a loyal friend and counselor.","zh":"在故事里，Aldwine 被塑造成一位忠诚的朋友和顾问。"}]},{"partOfSpeech":"n.","definition":{"en":"a surname (family name) in some English-speaking contexts.","zh":"（在部分英语语境中）用作姓氏。"},"examples":[{"en":"Dr. Aldwine published research on medieval literature.","zh":"Aldwine 博士发表了关于中世纪文学的研究。"}]}],"synonyms":["Aldwin","Aldwyn"],"phonetic":"/ˈɔːld.waɪn/","extraExplanation":["“Aldwine”通常被认为来自古英语元素：eald（old，古老的）+ wine（friend，朋友）。这里的 wine 与现代英语的“葡萄酒”无关，而是古英语里表示“朋友”的词根。","在英格兰盎格鲁-撒克逊时期（早期中世纪），这类由两部分词根组成的人名很常见（例如以 -wine 结尾的名字）。在一些历史文献中也会见到拼写变体，如 Aldwin / Aldwyn 等。"]}
{"word":"Aldwon","summary":{"en":"“Aldwon” is most likely a rare personal name (not a standard English vocabulary word).","zh":"“Aldwon”更可能是少见的人名，并非标准英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (rare). “Aldwon” is not a common dictionary word in modern English; it is most likely a personal name or a misspelling/variant of similar names (e.g., Aldwin, Aldwyn).","zh":"专有名词（少见）。“Aldwon”并不是现代英语里常见的词条，更可能是人名，或是相近名字的拼写变体/误拼（如 Aldwin、Aldwyn）。"},"examples":[{"en":"My teammate Aldwon will present the report today.","zh":"我的队友 Aldwon 今天会做报告。"},{"en":"I’m not sure how to spell it—maybe Aldwon or Aldwin?","zh":"我不确定怎么拼——可能是 Aldwon，也可能是 Aldwin？"}]}],"phonetic":"/ˈɔldwən/","extraExplanation":["“Ald- / Eald-”在古英语人名中比较常见，常与“old（古老的）”相关；“-win / -wyn”也常见，常与“friend（朋友）”有关。所以一些相近名字（如 Aldwin/Aldwyn）有时会被解释为“老朋友/古老的朋友”。\n如果你是在文章、游戏角色、品牌或地名里看到“Al d won”，也可能是作者自造名或特殊拼法。提供一句上下文，我可以更准确判断意思与读法。"]}
{"word":"Aldwyn","summary":{"en":"Aldwyn is a (rare) masculine English name, sometimes used as a surname.","zh":"Aldwyn 是较少见的男性英文名，也偶尔用作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A masculine given name (first name), sometimes also used as a surname.","zh":"男性名字（名），有时也可作姓氏。"},"examples":[{"en":"Aldwyn moved to Chicago for a new job.","zh":"Aldwyn 搬到芝加哥开始一份新工作。"},{"en":"Please welcome our speaker, Aldwyn Chen.","zh":"让我们欢迎本次演讲嘉宾 Aldwyn Chen。"}]}],"synonyms":["Aldwin","Alwin"],"phonetic":"/ˈɔld.wɪn/","extraExplanation":["Aldwyn 常被认为源自古英语（Old English）的名字元素：eald（“年长的、古老的”）+ wine（“朋友”），因此常被解释为“老朋友 / 年长的朋友”。","在英语语境里它属于相对少见、偏复古风格的名字；拼写相近的变体有 Aldwin、Alwin。"]}

