{"word":"Alf","summary":{"en":"“Alf” is most commonly a male name; “ALF” (all caps) can also be a TV show title or an abbreviation with different meanings depending on context.","zh":"“Alf”最常见是男性名字；“ALF”（全大写）也可能是电视剧名或不同领域的缩写，具体含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a male given name (short for Alfred or Alphonse in some families; also used as a standalone name).","zh":"男性名字（有时是 Alfred 或 Alphonse 的昵称，也可单独作为名字使用）。"},"examples":[{"en":"Alf is coming over for dinner tonight.","zh":"Alf 今晚会来吃晚饭。"},{"en":"His friends call him Alf, but his full name is Alfred.","zh":"朋友们叫他 Alf，但他的全名是 Alfred。"}]},{"partOfSpeech":"other","definition":{"en":"a pop-culture name: ALF, the main character of the U.S. TV sitcom *ALF* (an alien who lives with a family).","zh":"流行文化用法：美剧《ALF》中的主角名（一个和人类家庭一起生活的外星人）。"},"examples":[{"en":"My dad watched ALF when he was a kid.","zh":"我爸小时候看过《ALF》。"},{"en":"The show ALF is about a funny alien living on Earth.","zh":"《ALF》这部剧讲的是一个搞笑外星人在地球生活。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation (all caps: ALF) used in different fields; meanings depend on context, such as “Assisted Living Facility” or “Animal Liberation Front.”","zh":"缩写（大写 ALF）：在不同领域含义不同，需看语境，例如“辅助生活机构/养老照护机构（Assisted Living Facility）”或“动物解放阵线（Animal Liberation Front）”。"},"examples":[{"en":"She works at an ALF that helps seniors with daily tasks.","zh":"她在一家 ALF 工作，帮助老人处理日常事务。"},{"en":"In the news, ALF can also refer to the Animal Liberation Front.","zh":"在新闻里，ALF 也可能指“动物解放阵线”。"}]}],"synonyms":["Alfred (related name)","Al (similar nickname)"],"phonetic":"/ælf/","extraExplanation":["作为人名的 Alf 在欧洲（尤其是北欧和英国）较常见；它有时与古英语/日耳曼语中表示“精灵（elf）”的词根有关，因此在一些文化背景里会带一点“精灵般”的联想。","注意大小写：Alf（首字母大写）通常是人名；ALF（全大写）更可能是缩写。遇到 ALF 时，最好根据上下文（医疗照护、新闻、科技等）来判断具体意思。"]}
{"word":"alf","summary":{"en":"“ALF” is usually an abbreviation, most commonly meaning “assisted living facility,” but it can also refer to the TV show/character ALF or the Animal Liberation Front.","zh":"“ALF”通常是缩写，最常见指“辅助生活机构（养老辅助居住机构）”，也可能指美剧/角色《ALF》或“动物解放阵线”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbr.) assisted living facility: a residential place that helps older adults or people with disabilities with daily activities (meals, medication reminders, bathing) while allowing some independence.","zh":"（缩写）辅助生活机构／养老辅助居住机构：为老年人或需要照护的人提供日常生活协助（如餐食、用药提醒、洗浴等），同时保留一定独立性的居住场所。"},"examples":[{"en":"My grandmother moved into an ALF after she started needing help with cooking and medication.","zh":"我奶奶开始需要人帮忙做饭和用药后，就搬进了一家ALF（辅助生活机构）。"},{"en":"The hospital social worker gave us a list of nearby ALFs.","zh":"医院的社工给了我们一份附近ALF（辅助生活机构）的名单。"}]},{"partOfSpeech":"n.","definition":{"en":"ALF: an American TV sitcom (1986–1990) about a friendly alien who lives with a suburban family; also the alien character’s name.","zh":"ALF：美国情景喜剧（1986–1990），讲一位友善的外星人住进郊区家庭的故事；也指剧中的外星人角色名。"},"examples":[{"en":"My dad loved watching ALF when he was a kid.","zh":"我爸爸小时候很爱看《ALF》。"},{"en":"In ALF, the alien tries to fit into human life—often with funny results.","zh":"在《ALF》里，这个外星人努力融入人类生活——结果常常很好笑。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbr.) Animal Liberation Front: a radical animal-rights group name, often mentioned in news or history contexts.","zh":"（缩写）动物解放阵线：一个较激进的动物权利组织名称，常见于新闻或历史语境。"},"examples":[{"en":"The documentary mentions the ALF when discussing the history of animal-rights activism.","zh":"这部纪录片在讲动物权利运动史时提到了ALF（动物解放阵线）。"}]}],"synonyms":["assisted living facility","assisted living","residential care (related)"],"phonetic":"/ælf/","extraExplanation":["“ALF”通常要大写，因为多为缩写或专有名词。不同语境含义差很多：医疗/养老语境最常见的是 assisted living facility；流行文化里可能指电视剧《ALF》；社会议题语境里可能指 Animal Liberation Front。看上下文（医院、养老、电视、新闻）来判断。"]}
{"word":"ALFA","summary":{"en":"“Alfa” most commonly means the NATO phonetic alphabet word for the letter A.","zh":"“Alfa”最常见的意思是北约无线电话字母中代表字母A的拼读词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in the NATO/ICAO phonetic alphabet) the code word for the letter “A,” used to spell out words clearly over radio or phone.","zh":"（北约/国际民航组织无线电话字母）代表字母“A”的报码词，用于在无线电或电话中清晰拼读。"},"examples":[{"en":"Your booking code starts with A—“Alfa”—then 7, then K.","zh":"你的预订码以A开头——“Alfa”——然后是7，再然后是K。"},{"en":"Please confirm the first letter: is it “Alfa” or “Echo”?","zh":"请确认第一个字母：是“Alfa”还是“Echo”？"}]},{"partOfSpeech":"n.","definition":{"en":"a less common spelling/short form referring to alfalfa, a forage plant grown for animal feed.","zh":"较少见的写法/简称，指“alfalfa（苜蓿）”，一种常用于饲料的牧草植物。"},"examples":[{"en":"The farm grows alfa (alfalfa) to feed the horses.","zh":"这家农场种植alfa（苜蓿）来喂马。"}]}],"synonyms":["Alpha (common spelling outside the NATO code word)","the letter A (in context)"],"phonetic":"/ˈælfə/","extraExplanation":["在无线电拼读中常写作“Alfa”（而不是“Alpha”），主要是为了让不同语言背景的人更容易、也更不容易读错；它对应的实际字母仍然是A。"]}
{"word":"alfa","summary":{"en":"“Alfa” most commonly means the phonetic-alphabet code word for the letter A; it can also refer to esparto grass used in paper and weaving.","zh":"“Alfa” 最常见指音标字母表中代表字母 A 的代码词；也可指一种用于造纸和编织的地中海草类（esparto grass）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(radio/aviation) The code word for the letter A in the NATO/ICAO phonetic alphabet; a spelling used internationally to avoid confusion in pronunciation.","zh":"（无线电/航空）北约/国际民航组织（NATO/ICAO）音标字母表中代表字母 A 的代码词；这种拼写用于国际场景，便于不同母语者发音并减少误听。"},"examples":[{"en":"Tower, this is Alfa Two-One, requesting takeoff clearance.","zh":"塔台，这里是 Alfa 21，请求起飞许可。"},{"en":"Please spell your last name using the phonetic alphabet—start with Alfa for A.","zh":"请用音标字母表拼写你的姓——A 用 Alfa 开头。"}]},{"partOfSpeech":"n.","definition":{"en":"A tough Mediterranean grass (esparto grass) used for making paper, rope, and woven goods.","zh":"一种地中海地区的韧性草（西班牙草/细茎针茅等常指“esparto grass”），可用于造纸、制绳和编织品。"},"examples":[{"en":"Some specialty papers are made from alfa fibers.","zh":"有些特种纸由 alfa 纤维制成。"}]}],"synonyms":["alpha (general spelling)","NATO A (informal)","esparto (for the grass sense)"],"phonetic":"/ˈælfə/","extraExplanation":["在北约/ICAO 音标字母表里，A 的标准写法是 “Alfa” 而不是 “Alpha”。原因是为了让不熟悉英语中 “ph” 发音的人也能更容易读对、听清。","不要把 “alfa” 和 “alfalfa”（苜蓿，一种饲料作物）混淆；两者拼写和含义不同。"]}
{"word":"Alfadir","summary":{"en":"Alfadir is a Norse-mythology epithet for Odin meaning “All-father.”","zh":"Alfadir 是北欧神话中奥丁的称号，意为“众神之父/全父”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a name (epithet) for Odin meaning “All-father,” used in Norse mythology to describe him as the father or chief of the gods","zh":"“阿尔法迪尔 / 众神之父 / 全父”（奥丁的称号），在北欧神话中用来强调他作为诸神之父或众神领袖的地位"},"examples":[{"en":"In some Norse stories, Alfadir is another title for Odin.","zh":"在一些北欧神话故事中，Alfadir 是奥丁的另一个称号。"},{"en":"The poet calls on Alfadir for wisdom and guidance.","zh":"诗人向 Alfadir 祈求智慧与指引。"}]}],"synonyms":["Allfather","Odin","Alföðr"],"phonetic":"/ˈælˌfɑðər/","extraExplanation":["“Alfadir”常被视为古诺尔斯语 *Alföðr*（意为“全父/众神之父”）的英语转写之一，最常见的拼法是 **Allfather**（或 All-father）。","它多见于北欧神话相关的英文译本、学术写作与奇幻作品中，通常用来强调奥丁的“至高神/父神”形象，而不是指一个独立角色。"]}
{"word":"alfaje","summary":{"en":"Alfaje is a historical word for a curved sword or cutlass, especially linked to medieval Spain.","zh":"Alfaje 指一种历史上的弯刀/弯刃短剑，尤其与中世纪西班牙有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a curved sword or cutlass, especially one associated with Moorish (Muslim) Spain and medieval Iberia.","zh":"（尤指与中世纪伊比利亚、穆斯林西班牙相关的）弯刀；弯刃短剑。"},"examples":[{"en":"In the museum, a soldier’s alfaje was displayed beside a shield.","zh":"在博物馆里，一把士兵用过的 alfaje（弯刀）陈列在盾牌旁边。"},{"en":"The novel describes a rider drawing an alfaje at close range.","zh":"小说描写一名骑手在近距离拔出一把 alfaje（弯刀）。"}]}],"synonyms":["scimitar","cutlass","saber"],"phonetic":"/ælˈfɑːheɪ/","extraExplanation":["“alfaje”是一个较少见的英语借词，常见于历史、武器、或文学语境。它通常指一种弯刃刀，和伊比利亚半岛（西班牙/葡萄牙）中世纪时期的军事与文化背景有关。","词源上一般认为与阿拉伯语有关（受“al-”开头的阿拉伯借词影响），因此带有明显的历史文化色彩。阅读时可把它理解为一种“弯刀/军刀”类武器。"]}
{"word":"alfaki","summary":{"en":"Alfaki is a West African term for a Muslim religious scholar/teacher, sometimes also someone who writes Qur’anic verses or makes protective amulets.","zh":"Alfaki 是西非常用词，指穆斯林宗教学者/教师；有时也指书写《古兰经》经文或制作护身符的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(West Africa) a Muslim religious teacher or learned person in Islamic law; sometimes also a person who makes amulets or writes Qur’anic verses for protection.","zh":"（西非）伊斯兰宗教教师或精通伊斯兰法的学者；有时也指制作护身符、书写《古兰经》经文用于祈福护佑的人。"},"examples":[{"en":"In some West African communities, an alfaki may teach children how to recite the Qur’an.","zh":"在一些西非社区里，alfaki 可能会教孩子们背诵《古兰经》。"},{"en":"People visited the alfaki to ask for blessings and a written verse to carry with them.","zh":"人们去拜访 alfaki，请求祝福，并求一段写好的经文随身携带。"}]}],"synonyms":["Islamic scholar","cleric","teacher","faqih"],"phonetic":"/ælˈfɑːki/","extraExplanation":["“alfaki”常见于西非英语语境（也可见拼写 alfaqui / al-faqih 等），源自阿拉伯语“al-faqīh”（意为“精通伊斯兰法的人”）。在不同地区，它既可能是受尊敬的宗教教师/学者称呼，也可能与民间护符、祈福书写等习俗联系在一起，具体含义取决于当地文化与使用场景。"]}
{"word":"alfakis","summary":{"en":"Alfaki means a West African Muslim religious teacher or Islamic legal scholar; sometimes it also refers to a healer who uses Qur’anic verses as amulets.","zh":"Alfaki 指西非的穆斯林宗教教师或伊斯兰法学者；有时也可指用《古兰经》经文制作护身符的民间疗愈者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Muslim religious teacher or legal scholar in West Africa (especially in Hausa-speaking regions); sometimes also used for a healer who writes Qur’anic verses as amulets.","zh":"（西非，尤指豪萨地区的）穆斯林宗教教师或伊斯兰法学者；有时也指用《古兰经》经文制作护身符、从事民间疗愈的人。"},"examples":[{"en":"In the village, people asked the alfaki to teach children to read the Qur’an.","zh":"在村里，人们请这位 alfaki 教孩子们诵读《古兰经》。"},{"en":"Some families visited an alfaki to get a protective charm with Qur’anic verses.","zh":"有些家庭会去找 alfaki 求一张写有《古兰经》经文的护身符。"}]}],"synonyms":["Islamic scholar","cleric","religious teacher","marabout"],"phonetic":"/ælˈfɑːki/","extraExplanation":["“alfaki”一词常被认为来自阿拉伯语 al-faqīh（فقیه/فقيه），意为“法学家、精通伊斯兰法律的人”。在西非语境中（如豪萨语地区），它既可指宗教学者/教师，也可能在民俗使用里带有“写经文作护符、祈祷疗愈”的角色色彩。","你输入的 “alfakis” 常见为复数形式（多个 alfaki），也可能是拼写变体；更常见的词条形式是 “alfaki”。"]}
{"word":"alfalfa","summary":{"en":"Alfalfa is a common forage plant used for hay and animal feed; its sprouts are also eaten.","zh":"Alfalfa（苜蓿/紫花苜蓿）是一种常见牧草，用于干草和饲料；其嫩芽也可食用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant grown mainly as animal feed (hay) and sometimes eaten as sprouts; also called lucerne","zh":"一种主要用作牲畜饲料（干草）的植物；也可食用其嫩芽（苜蓿芽）；也叫“lucerne（紫花苜蓿）”"},"examples":[{"en":"Farmers grow alfalfa to make hay for horses and cows.","zh":"农民种植苜蓿来制作给马和牛吃的干草。"},{"en":"I added alfalfa sprouts to my sandwich for extra crunch.","zh":"我在三明治里加了苜蓿芽，口感更脆。"}]}],"synonyms":["lucerne","alfalfa sprouts (sprouts)"],"phonetic":"/ælˈfælfə/","extraExplanation":["“alfalfa”一词来自阿拉伯语“al-fasfasa”，经西班牙语进入英语；在北美农业中很常见，常被称为“the queen of forages（牧草之王）”。","在英语里，“alfalfa sprouts（苜蓿芽）”常出现在健康饮食或素食语境中，通常指可生食的嫩芽。"]}
{"word":"alfalfas","summary":{"en":"Alfalfas means multiple alfalfa plants or crops, commonly grown as animal feed.","zh":"Alfalfas 指多株/多块种植的紫花苜蓿，常作为牲畜饲料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of alfalfa; a plant with small purple flowers that is grown as animal feed (also used as hay).","zh":"alfalfa（紫花苜蓿）的复数；一种开紫色小花的牧草，常用作牲畜饲料（也可制成干草）。"},"examples":[{"en":"Farmers grow alfalfas to feed cattle and horses.","zh":"农民种植紫花苜蓿来喂牛和马。"},{"en":"These fields used to be corn, but now they’re planted with alfalfas.","zh":"这些田地以前种玉米，但现在改种紫花苜蓿了。"}]}],"synonyms":["lucerne","alfalfa hay","forage"],"phonetic":"/ælˈfæl.fə/","extraExplanation":["“alfalfa”一词来自阿拉伯语“al-falfa”，在英语中常指用于饲养牲畜的紫花苜蓿。日常口语里更常说单数“alfalfa”（把它当作一种作物/饲料的统称），而复数“alfalfas”多用于强调不同品种或不同地块的苜蓿。"]}
{"word":"alfaqui","summary":{"en":"Alfaqui is a historical term for a Muslim religious scholar or jurist (a faqih).","zh":"Alfaqui 是历史用语，指穆斯林的宗教学者或伊斯兰法学家（相当于 faqih）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Historical) A Muslim religious scholar or jurist; an expert in Islamic law and learning (a *faqih*).","zh":"（历史用语）穆斯林宗教学者或法学家；精通伊斯兰教法与学问的人（相当于 *faqih*）。"},"examples":[{"en":"In some old Spanish texts, an *alfaqui* is described as advising the community on religious law.","zh":"在一些古老的西班牙文献中，*alfaqui* 被描写为就宗教法规向社区提供建议的人。"},{"en":"The traveler wrote that he consulted an *alfaqui* before making an important decision.","zh":"那位旅行者写道，他在做重要决定前咨询了一位 *alfaqui*。"}]}],"synonyms":["faqih","Islamic jurist","religious scholar","theologian"],"phonetic":"/ælˈfɑːki/","extraExplanation":["这个词多见于旧时的英语/西语语境，来源于阿拉伯语 *al-faqīh*（法学家、教法学者）。在伊比利亚半岛的历史背景（如中世纪的安达卢斯/摩尔人时期）相关叙述中更常出现。","拼写上也可能看到 *alfaki*、*alfaquí*（西语重音形式）等变体；现代英语更常直接用 *faqih* 来指这一类宗教法学者。"]}
{"word":"alfaquin","summary":{"en":"An archaic word for a Muslim jurist or religious teacher, especially in medieval Spain/North Africa.","zh":"指穆斯林法学家或宗教教师的古旧词，尤见于中世纪西班牙/北非语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A Muslim legal scholar or religious teacher; especially an Islamic jurist in medieval Spain or North Africa.","zh":"（历史用语）穆斯林法学家或宗教教师；尤指中世纪西班牙或北非的伊斯兰教法学者。"},"examples":[{"en":"In some medieval Spanish texts, an alfaquin is consulted to interpret religious law.","zh":"在一些中世纪西班牙文献中，人们会请一位 alfaquin 来解释宗教法律。"},{"en":"The story describes an alfaquin advising the ruler on matters of faith and justice.","zh":"故事描写一位 alfaquin 就信仰与公正问题向统治者进言。"}]}],"synonyms":["Islamic jurist","faqih","religious scholar","theologian"],"phonetic":"/ˌæl.fəˈkiːn/","extraExplanation":["这个词非常少见，多见于历史写作或翻译作品中。它源自阿拉伯语 *al-faqīh*（意为“精通教法的人、法学家”），进入伊比利亚半岛的西班牙语/葡萄牙语后再被英语借用。","在当时的文化语境里，alfaquin 常常不仅指“学者”，还带有“能为社会与统治者提供宗教与法律意见的权威人物”的含义。"]}
{"word":"alfaquins","summary":{"en":"Alfaquins are Muslim jurists (Islamic legal scholars), especially in medieval Spain and Portugal.","zh":"Alfaquins 指穆斯林法学家（伊斯兰法学者），尤用于中世纪西班牙和葡萄牙的历史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) Muslim legal scholars or jurists, especially in medieval Spain and Portugal; plural of alfaquin/alfaquí.","zh":"（历史）穆斯林法律学者、法官式的法学家，尤指中世纪伊比利亚半岛（西班牙、葡萄牙）地区的；alfaquin/alfaquí 的复数。"},"examples":[{"en":"In medieval Iberia, some kings consulted alfaquins on questions of Islamic law.","zh":"在中世纪的伊比利亚半岛，一些国王会就伊斯兰法的问题征询 alfaquins 的意见。"},{"en":"The chronicle mentions debates between Christian clerics and local alfaquins.","zh":"编年史提到基督教神职人员与当地 alfaquins 之间的辩论。"}]}],"synonyms":["Islamic jurists","Muslim legal scholars","faqihs","ulema (broader)"],"phonetic":"/ˈæl.fə.kiːnz/","extraExplanation":["这是一个非常少见、偏古史语境的词，主要出现在与“安达卢斯（Al-Andalus）/穆瓦希德或穆拉比特时期/伊比利亚半岛宗教与法律史”相关的英文史料或译文中。","词源通常追溯到阿拉伯语 الفقيه (al-faqīh) “法学家、精通伊斯兰法的人”。英文里也可能见到拼写变体：alfaqui, alfaquí, alfaquin。读史料时可把它理解为“伊斯兰法学家/教法学者”。"]}
{"word":"alfaquis","summary":{"en":"Alfaquis is a historical word meaning Muslim legal scholars or judges (experts in Islamic law).","zh":"Alfaquis 是历史用语，指穆斯林法学家或法官（精通伊斯兰法的人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) Muslim legal scholars or judges; experts in Islamic law (fiqh).","zh":"（历史用语）穆斯林法学家或法官；精通伊斯兰法（fiqh/教法学）的人。"},"examples":[{"en":"In medieval Iberian texts, alfaquis are mentioned as advisers on religious law.","zh":"在中世纪伊比利亚半岛的文本中，常提到alfaquis作为宗教法律顾问。"},{"en":"The ruler consulted the alfaquis before announcing a new decree.","zh":"统治者在宣布新法令前先征询了alfaquis的意见。"}]}],"synonyms":["Islamic jurists","legal scholars","qadis (context-dependent)"],"phonetic":"/ælˈfɑki/","extraExplanation":["该词较少见，多出现在历史/文学语境中，常见于描述中世纪西班牙（含安达卢斯地区）与北非的伊斯兰社会。","alfaquis 是复数形式；单数常写作 alfaqui（也可见变体 alfaquin）。其来源与阿拉伯语 faqīh（法学家）相关，指精通伊斯兰教法学（fiqh）的人。","阅读时可把它理解为“伊斯兰法学家/教法学者”，接近于“jurist（法学家）/legal scholar（法律学者）/judge（法官）”在伊斯兰法律传统中的对应角色。"]}
{"word":"Alfarabius","summary":{"en":"Alfarabius is the Latinized name used for the medieval philosopher Al-Farabi.","zh":"Alfarabius 是中世纪哲学家阿尔·法拉比（Al-Farabi）的拉丁化名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Alfarabius: the Latinized name of Al-Farabi (c. 872–950), a major medieval Islamic philosopher and polymath, often called “the Second Teacher” (after Aristotle).","zh":"Alfarabius：阿尔·法拉比（约872–950）的拉丁化名字；他是中世纪伊斯兰世界的重要哲学家与博学者，常被称为“第二导师”（仅次于亚里士多德）。"},"examples":[{"en":"In some older European books, Al-Farabi appears under the name Alfarabius.","zh":"在一些较早的欧洲著作中，阿尔·法拉比会以 Alfarabius 这个名字出现。"},{"en":"Alfarabius wrote influential works on logic, politics, and music theory.","zh":"Alfarabius 在逻辑学、政治哲学与音乐理论方面都有很有影响力的著作。"}]}],"synonyms":["Al-Farabi","Abu Nasr al-Farabi","Alpharabius"],"phonetic":"/ˌæl.fəˈreɪ.bi.əs/","extraExplanation":["“Alfarabius”属于欧洲学术传统里常见的拉丁化写法：中世纪与近代早期的学者在写作拉丁文时，常把阿拉伯语人名改写成拉丁形式，便于在拉丁学术圈传播与引用。","你也可能会看到拼写差异（如 Alpharabius / Alfarabi），通常都指同一位学者。学术检索时可同时搜索“Al-Farabi”“Abu Nasr al-Farabi”“Alfarabius”。"]}
{"word":"alfarga","summary":{"en":"“Alfarga” is usually a rare proper name (place/surname) or a misspelling of “alfalfa.”","zh":"“Alfarga”通常是较少见的专名（地名/姓氏），或是把“alfalfa（苜蓿）”误写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (rare in English) used as a place name or surname, especially in Spanish-speaking contexts.","zh":"专有名词（英语中较少见）：可用作地名或姓氏，常见于西班牙语语境。"},"examples":[{"en":"She traced her family roots back to the surname Alfarga.","zh":"她追溯家族根源时发现祖姓是 Alfarga。"},{"en":"Their route passed near a small village called Alfarga.","zh":"他们的路线经过一个叫 Alfarga 的小村庄附近。"}]},{"partOfSpeech":"other","definition":{"en":"A misspelling or variant spelling that people sometimes use when they mean “alfalfa” (a fodder plant).","zh":"常见拼写误写/变体：有时人们写成 alfarga，其实想表达 “alfalfa（苜蓿）”。"},"examples":[{"en":"Did you mean alfalfa? “Alfarga” isn’t a standard English spelling.","zh":"你是想写 alfalfa（苜蓿）吗？“alfarga” 不是标准英文拼法。"},{"en":"The label says “alfarga hay,” but the correct term is “alfalfa hay.”","zh":"标签写着“alfarga hay”，但正确说法是“alfalfa hay（苜蓿干草）”。"}]}],"synonyms":["alfalfa (when used as a misspelling)"],"phonetic":"/ælˈfɑrɡə/","extraExplanation":["“Alfarga”不是常见英语词条，更像是专有名词（地名/姓氏）。如果你是在阅读文章、地图或家谱资料里看到它，最好结合上下文判断属于哪一种专名。","如果你是在农业、饲料、马匹饲养等语境看到“alfarga”，很可能是把“alfalfa（苜蓿）”写错了；英语里标准拼写是 alfalfa。"]}
{"word":"alfas","summary":{"en":"Alpha is the first Greek letter, and it can also mean the leading person in a group or an extra advantage/performance over a standard.","zh":"Alpha 是希腊字母表的第一个字母，也可指群体中的主导人物，或指相对基准的超额优势/表现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the first letter of the Greek alphabet (Α, α)","zh":"希腊字母表的第一个字母（Α, α）"},"examples":[{"en":"In math, we often use alpha (α) to represent an angle.","zh":"在数学里，我们常用 alpha（α）来表示一个角。"},{"en":"The word “alphabet” comes partly from alpha and beta.","zh":"“alphabet”（字母表）这个词部分来自 alpha 和 beta。"}]},{"partOfSpeech":"n.","definition":{"en":"a leading or most influential person in a group (often “alpha male/female”)","zh":"（群体中）最有领导力或最有影响力的人（常说“alpha male/female”）"},"examples":[{"en":"She’s not loud, but she’s clearly the alpha in the team.","zh":"她不吵闹，但显然是团队里的主导人物。"},{"en":"Some people dislike the stereotype of the “alpha male.”","zh":"有些人不喜欢“alpha male（强势男）”这种刻板印象。"}]},{"partOfSpeech":"n.","definition":{"en":"extra performance or advantage compared to a standard (common in finance and statistics)","zh":"相对于基准的超额表现或优势（常见于金融与统计）"},"examples":[{"en":"The fund’s alpha was positive this year.","zh":"这只基金今年的 alpha（超额收益）为正。"},{"en":"Researchers looked for signals that could generate alpha.","zh":"研究人员寻找可能产生 alpha（超额优势）的信号。"}]}],"synonyms":["first (Greek) letter","leader","dominant person","front-runner","top performer","excess return"],"phonetic":"ˈælfə","extraExplanation":["你输入的“alfas”在英语里不常见；最可能是“alphas”（alpha 的复数）的误拼，或受西语拼写习惯影响。英语里通常写作：one alpha / two alphas。"]}
{"word":"ALFE","summary":{"en":"ALFE is usually an acronym/initialism or a name, not a common dictionary word; its meaning depends on context.","zh":"ALFE通常是缩写或名称，并非常见词典词；具体含义取决于上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare or non-standard term in English; most often seen as an acronym/initialism (a short form made from initials) or as a personal name/username rather than a dictionary word.","zh":"英语中较少见、非标准的词；最常见的用法是作为首字母缩写（由首字母组成的简称）或人名/用户名，而不是常规词典词汇。"},"examples":[{"en":"I couldn’t find “ALFE” in a standard dictionary; it may be an acronym used by a specific organization.","zh":"我在常规词典里找不到“ALFE”；它可能是某个组织使用的缩写。"},{"en":"In this document, ALFE stands for a program name, so check the introduction section for the full form.","zh":"在这份文件里，ALFE代表一个项目名称，所以请查看引言部分找到全称。"}]}],"phonetic":"/ˌeɪ.ɛl.ɛfˈiː/","extraExplanation":["“ALFE”本身不是常见英语单词，因此没有固定、通用的词义。很多情况下它需要上下文来确认：例如某个机构名、课程名、系统模块、文件名，或个人名字/网名。","如果你能提供一句包含 ALFE 的原句（或说明它出现在哪个领域：学校/公司/软件/医学等），我可以帮你判断它最可能的全称与含义，并给出更贴近语境的例句与相关词。"]}
{"word":"Alfedena","summary":{"en":"Alfedena is the name of a small town in Abruzzo, Italy.","zh":"Alfedena 是意大利阿布鲁佐大区的一个小镇名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A small town (comune) in the Abruzzo region of central Italy, in the Province of L’Aquila.","zh":"意大利中部阿布鲁佐大区（阿布鲁佐）拉奎拉省的一个小镇（市镇）。"},"examples":[{"en":"Alfedena is a quiet mountain town in Abruzzo.","zh":"Alfedena 是阿布鲁佐山区里一个安静的小镇。"},{"en":"We drove through Alfedena on the way to a national park.","zh":"我们开车经过 Alfedena，前往一个国家公园。"}]}],"phonetic":"/ˌæl.fəˈdeɪ.nə/","extraExplanation":["Alfedena 通常作为地名使用（专有名词），写法首字母大写。日常英语里不常见，更多出现在旅游、地理或意大利地方新闻语境中。","它位于亚平宁山脉区域，靠近一些自然保护区与徒步路线；如果你在文章里看到它，往往是在描述意大利山区生活、旅行路线或历史遗迹。"]}
{"word":"alfenide","summary":{"en":"Alfenide is a nickel-silver alloy (copper–nickel–zinc) with a silver-like appearance.","zh":"Alfenide 是一种外观似银的镍银合金（铜-镍-锌）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of nickel silver (a copper–nickel–zinc alloy) used for coins, metal parts, and decorative objects; it looks silvery but contains no real silver.","zh":"一种“镍银”（铜-镍-锌合金）的材料，常用于硬币、金属零件和装饰品；外观像银色，但不含真正的银。"},"examples":[{"en":"Some older coins were made from alfenide because it is hard and resists corrosion.","zh":"一些较早的硬币使用了 alfenide，因为它坚硬且耐腐蚀。"},{"en":"The instrument’s keys were made of alfenide to give a bright, silver-like finish.","zh":"这种乐器的按键用 alfenide 制成，以呈现明亮的银色外观。"}]}],"synonyms":["nickel silver","German silver","alpaca (alloy)"],"phonetic":"/ˈæl.fə.naɪd/","extraExplanation":["“Alfenide”常被当作一种镍银合金的名称（有时也可视为商品名/旧称），在不同国家或不同资料里，具体配比可能略有差异，但核心特征是铜-镍-锌体系、颜色近似银、价格比真银低且耐用。"]}
{"word":"Alfeo","summary":{"en":"Alfeo is usually a male given name, and it can also refer to a variant form of the Greek mythological name Alpheus.","zh":"Alfeo 通常是男性名字；也可指希腊神话名字 Alpheus 的一种变体写法。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a male given name (mainly used in Italian and Spanish-speaking communities), related to the mythological name Alpheus.","zh":"男性名字（主要见于意大利语与西班牙语社群中），与希腊神话中的“Alpheus/阿尔菲俄斯”这一名字有关。"},"examples":[{"en":"Alfeo is an Italian first name that you may see in older records.","zh":"Alfeo 是一个意大利男性名，你可能会在较早的档案记录中见到。"},{"en":"Alfeo wrote his name on the form in capital letters.","zh":"Alfeo 用大写字母在表格上写下了自己的名字。"}]},{"partOfSpeech":"other","definition":{"en":"in Greek mythology, a name connected with Alpheus, a river god (often spelled Alpheus in English).","zh":"希腊神话相关名称：与河神 Alpheus（英语常拼作 Alpheus/阿尔菲俄斯）有关。"},"examples":[{"en":"In some retellings, Alfeo is used as a variant of Alpheus.","zh":"在一些改写或译名中，Alfeo 会被当作 Alpheus 的变体使用。"}]}],"synonyms":["Alpheus","Alfeo (variant spellings: Alfeus/Alpheo in some contexts)"],"phonetic":"/ælˈfiːoʊ/","extraExplanation":["“Alfeo”常被视为源自希腊语名字“Alpheus（阿尔菲俄斯）”的意大利语/西班牙语形式。英语里更常见的写法是 Alpheus。","如果你是在文学、歌剧或人名名单里看到 Alfeo，它通常就是专有名词（人名）；在普通英语词典中一般不会作为常用词条出现。"]}
{"word":"alferes","summary":{"en":"Alferes is a Portuguese historical term for a junior military officer (often like an ensign/second lieutenant) and sometimes specifically a standard-bearer.","zh":"Alferes 是葡语中的历史称谓，指初级军官（常近似少尉/旗官），有时特指掌旗官。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Portugal and Brazil, historical) a junior army officer rank, roughly like an ensign or second lieutenant; the person holding that rank.","zh":"（葡萄牙和巴西的历史用语）一种初级军官军衔，大致相当于“少尉/旗官（ensign）”；也可指担任该军衔的人。"},"examples":[{"en":"In some Brazilian history books, Tiradentes is described as an alferes in the colonial militia.","zh":"在一些巴西历史书里，蒂拉登特斯被描述为殖民地民兵中的一名 alferes（初级军官）。"},{"en":"The document lists him as alferes before he was promoted to a higher rank.","zh":"文件中先把他记为 alferes，之后他才被提升到更高军衔。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) a standard-bearer—the officer who carried a flag or military standard.","zh":"（历史用语）掌旗官／旗手——负责携带军旗或旗帜的军官。"},"examples":[{"en":"The alferes rode at the front, carrying the unit’s standard.","zh":"那名 alferes 骑马走在队伍前方，手持该部队的军旗。"},{"en":"In old chronicles, the alferes is often mentioned alongside other ceremonial officers.","zh":"在古老的编年史中，alferes 常与其他礼仪性官员一起被提及。"}]}],"synonyms":["ensign","second lieutenant","standard-bearer","flag-bearer"],"phonetic":"ˌæl.fəˈrɛs","extraExplanation":["词源常被认为与阿拉伯语有关（类似 al-fāris，意为“骑士/武士”），后来进入伊比利亚语系并成为军事与礼仪职称。","在巴西语境中，alferes 这个头衔因“蒂拉登特斯”（Tiradentes）的历史身份而较为知名；阅读葡语史料时常会遇到。","英语里它多作为外来词出现在历史、军事或葡语文化相关的文本中；日常英语对话一般不用这个词。"]}
{"word":"alferez","summary":{"en":"Alférez is a Spanish-term noun meaning a junior officer in some Spanish-speaking militaries, and historically a standard-bearer.","zh":"Alférez是源自西班牙语的名词，指一些西语国家的初级军官；历史上也指战场上的旗手/掌旗官。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A junior military officer in some Spanish-speaking countries (often roughly similar to an ensign or second lieutenant).","zh":"（一些西语国家的）初级军官（常大致相当于“海军少尉/陆军少尉”等级别）。"},"examples":[{"en":"In the novel, the young alférez is eager to prove himself in his first campaign.","zh":"在小说里，那位年轻的alférez渴望在首次战役中证明自己。"},{"en":"She commissioned as an alférez in the national police academy.","zh":"她从国家警校毕业并被任命为alférez。"}]},{"partOfSpeech":"n.","definition":{"en":"Historically, a standard-bearer (the person who carried a flag or banner in battle).","zh":"（历史上）旗手；掌旗官（战场上举旗、持军旗的人）。"},"examples":[{"en":"The alférez rode at the front, holding the banner high.","zh":"那位alférez骑在队伍前方，高举军旗。"},{"en":"Losing the alférez meant losing the standard and, symbolically, morale.","zh":"失去alférez往往意味着军旗被夺，在象征意义上也会打击士气。"}]}],"synonyms":["ensign","second lieutenant","standard-bearer","flag-bearer"],"phonetic":"ˌæl.fəˈrɛz","extraExplanation":["“alférez”是西班牙语外来词，来自阿拉伯语词源（与“骑士/随从”等含义相关），在中世纪伊比利亚的军事体系中常指“执旗官/旗手”，后来在许多拉丁美洲国家演变为正式军衔名称。","不同国家与不同军种的对应军衔不完全一致：有的更接近“少尉（second lieutenant）”，有的用于警察/宪兵体系或军校学员阶段的称号。阅读或翻译时，最好结合具体国家背景来理解。"]}
{"word":"alfet","summary":{"en":"“alfet” is not standard English; it is usually a misspelling of “after,” meaning “later than” or “following.”","zh":"“alfet”不是标准英语，通常是“after”的拼写错误，表示“在……之后/随后”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A common misspelling of “after.” (Not a standard English word.)","zh":"“after”的常见拼写错误。（不是标准英语单词。）"},"examples":[{"en":"Incorrect: I’ll call you alfet class. → Correct: I’ll call you after class.","zh":"错误：I’ll call you alfet class. → 正确：I’ll call you after class.（我下课后给你打电话。）"},{"en":"Did you mean “after” (later than / following)?","zh":"你想表达的是“after”（在……之后 / 跟随……）吗？"}]},{"partOfSpeech":"prep.","definition":{"en":"Later than a time or event; following something in time.","zh":"（时间上）在……之后；在某事之后发生。"},"examples":[{"en":"Let’s meet after dinner.","zh":"我们晚饭后见。"},{"en":"After the movie, we went home.","zh":"电影结束后，我们回家了。"}]},{"partOfSpeech":"adv.","definition":{"en":"In the time following an event; later.","zh":"（副词）之后；后来。"},"examples":[{"en":"We talked for a while, and left soon after.","zh":"我们聊了一会儿，不久之后就离开了。"}]},{"partOfSpeech":"prep.","definition":{"en":"Following behind; pursuing (less common).","zh":"（较少用）追赶；追随在后。"},"examples":[{"en":"The police went after the thief.","zh":"警察追赶小偷。"}]}],"synonyms":["later","following","subsequent to"],"phonetic":"/ˈæf.tɚ/","extraExplanation":["“alfet”常见于打字/拼写错误：把“after”中的“r”漏掉或把字母顺序打乱。正式写作中应改为“after”。","“after”还有一个常见固定搭配：“after all”（毕竟/终究）。例如：After all, we tried our best.（毕竟，我们已经尽力了。）"]}
{"word":"Alfeus","summary":{"en":"Alfeus is a proper name, usually a variant of Alpheus, known from the Bible and (less commonly) from Greek mythology and a Greek river name.","zh":"Alfeus 是专有名词，通常是 Alpheus 的变体拼写；常见于《圣经》人名，也可（较少）指希腊神话中的河神或希腊河流名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a male given name (proper noun), best known in English from the Bible as the name of the father of the apostle James (often translated as “Alpheus”).","zh":"男性名字（专有名词）。在英语里最常见的来源是《圣经》，指使徒雅各的父亲（常译作“亚勒腓/亚勒腓”)."},"examples":[{"en":"In the New Testament, James is sometimes identified as “the son of Alfeus (Alpheus).”","zh":"在《新约》中，雅各有时被称为“亚勒腓（Alpheus/Alfeus）的儿子”。"},{"en":"The family tree listed Alfeus as an ancestor’s name.","zh":"家谱里把 Alfeus 记录为一位祖先的名字。"}]},{"partOfSpeech":"other","definition":{"en":"(less common) a name used for Alpheus, a river god in Greek mythology and the name of a river in Greece.","zh":"（较少见）Alpheus 的另一种写法或转写：希腊神话中的河神阿尔甫斯/阿尔菲俄斯，以及希腊的一条河流名。"},"examples":[{"en":"In Greek myths, Alfeus (Alpheus) is linked with rivers and flowing water.","zh":"在希腊神话中，Alfeus（Alpheus）常与河流和流水联系在一起。"},{"en":"The story mentions the river Alfeus as part of the landscape.","zh":"故事里提到 Alfeus 河作为背景的一部分。"}]}],"synonyms":["Alpheus"],"phonetic":"ˈælfiəs","extraExplanation":["“Alfeus”更常见的英文拼写是“Alpheus”。你看到“Alfeus”时，往往是不同语言转写（如拉丁化或旧译名）造成的拼写差异。","在中文语境里，《圣经》人物常译作“亚勒腓”；希腊神话/地名则可能译作“阿尔甫斯/阿尔菲俄斯”等，具体因译本而异。"]}
{"word":"Alfheim","summary":{"en":"Alfheim is a realm of elves in Norse mythology and a popular elf-land name in modern fantasy.","zh":"Alfheim 指北欧神话中的精灵国度，也常被现代奇幻作品用作“精灵之乡/精灵国”的地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Norse mythology) One of the Nine Worlds, the realm of the ljósálfar (“light elves”), sometimes described as a bright, beautiful elf-land ruled by the god Freyr.","zh":"（北欧神话）“九界”之一，被称为“光之精灵（光精灵）”的居所，常被描写为明亮美丽的精灵国度，有时说由弗雷（Freyr）统治。"},"examples":[{"en":"In some stories, Alfheim is the home of the light elves.","zh":"在一些故事里，Alfheim 是光精灵的家园。"},{"en":"The book explained that Alfheim is one of the Nine Worlds in Norse mythology.","zh":"那本书解释说，Alfheim 是北欧神话中的九界之一。"},{"en":"Many fantasy games borrow the name Alfheim to suggest an elf kingdom.","zh":"许多奇幻游戏借用 Alfheim 这个名字来暗示“精灵王国”。"}]},{"partOfSpeech":"n.","definition":{"en":"A modern fantasy place-name inspired by Norse myth, used in novels, games, and pop culture (often meaning “elf home/elf realm”).","zh":"（现代奇幻语境）受北欧神话启发的地名，常见于小说、游戏与流行文化中（常带“精灵之乡/精灵国度”的含义）。"},"examples":[{"en":"The game set its final chapter in Alfheim, a land of elves and magic.","zh":"这款游戏把终章设在 Alfheim——一个充满精灵与魔法的国度。"},{"en":"Their band chose the name Alfheim to evoke a mythic, fairy-tale mood.","zh":"他们的乐队取名 Alfheim，是为了营造神话般、童话般的氛围。"}]}],"synonyms":["Álfheimr","Alfheimr","elf realm","elfland"],"phonetic":"/ˈɑlf.heɪm/","extraExplanation":["“Alfheim”来自古诺尔斯语 Álfheimr：álfr（精灵）+ heimr（家园/世界），字面意思接近“精灵之家/精灵国”。英语里也常见拼写 Alfheim、Álfheim 或 Alfheimr。","北欧神话资料来源并不完全一致：有些传统把它与“光精灵”联系在一起，并提到与神祇 Freyr 的关联；不同作品与改编（如奇幻文学、影视、游戏）会根据需要重新设定其地理与角色。"]}
{"word":"Alfi","summary":{"en":"Alfi is a personal name, often a nickname for Alfred, and a variant spelling of Alfie.","zh":"Alfi 是人名，常作 Alfred 的昵称，也可看作 Alfie 的变体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (usually a boy’s name), commonly used as a nickname for names like Alfred; also a variant spelling of “Alfie.”","zh":"人名（多为男名）；常作 Alfred 等名字的昵称；也可视为 “Alfie” 的变体拼写。"},"examples":[{"en":"Alfi is short for Alfred in some families.","zh":"在一些家庭里，Alfi 是 Alfred 的简称。"},{"en":"I met a kid named Alfi at the park.","zh":"我在公园认识了一个叫 Alfi 的小朋友。"}]}],"synonyms":["Alfie","Alfred"],"phonetic":"/ˈælfi/","extraExplanation":["“Alfi”更常见的拼法是“Alfie”，在英国尤其常见，带有亲切、可爱的感觉；在美国也能见到，但相对少一些。","在流行文化里，更常见的形式是“Alfie”（例如同名歌曲/电影），所以如果你在文本里看到“Alfi”，有时也可能是个人偏好的拼写或拼写变化。"]}
{"word":"Alfie","summary":{"en":"Alfie is usually a male first name, often a nickname for Alfred; it can also refer to the film/song title “Alfie.”","zh":"Alfie 通常是男性名字，多为 Alfred 的昵称；也可指电影/歌曲《Alfie》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (a personal name), often used as a nickname for Alfred (and sometimes Alfonso).","zh":"男性名字（人名），常用作 Alfred 的昵称（有时也指 Alfonso 的昵称）。"},"examples":[{"en":"Alfie is starting kindergarten this fall.","zh":"Alfie 今年秋天要上幼儿园了。"},{"en":"His full name is Alfred, but everyone calls him Alfie.","zh":"他的全名是 Alfred，但大家都叫他 Alfie。"}]},{"partOfSpeech":"n.","definition":{"en":"(in popular culture) the title/name of a well-known film and song, “Alfie,” often associated with themes of romance and self-reflection.","zh":"（流行文化）著名电影和歌曲《Alfie》的片名/歌名，常让人联想到爱情与自我反思等主题。"},"examples":[{"en":"Have you heard the song “Alfie” from the 1960s?","zh":"你听过 20 世纪 60 年代的歌曲《Alfie》吗？"},{"en":"They referenced the film “Alfie” in the conversation.","zh":"他们在谈话中提到了电影《Alfie》。"}]}],"synonyms":["Alfred (full form)"],"phonetic":"/ˈælfi/","extraExplanation":["“Alfie”在英式英语里尤其常见，带有亲切、可爱的感觉；结尾“-ie/-y”的昵称形式在英语中很常见（如 Charlie, Annie）。","如果你在句子里看到首字母大写“Alfie”，通常就是人名或作品名；在正式文件中可能会写全名 Alfred。"]}
{"word":"Alfieri","summary":{"en":"Alfieri is an Italian surname; in English literature classes it often refers to the lawyer-narrator in Arthur Miller’s A View from the Bridge.","zh":"Alfieri 是一个意大利姓氏；在英语文学课堂中，它常指阿瑟·米勒《桥头眺望》里的律师兼叙述者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A family name (surname) of Italian origin; often used as a proper noun to refer to specific people named Alfieri.","zh":"一个意大利起源的姓氏（专有名词）；常用来指代名为 Alfieri 的特定人物。"},"examples":[{"en":"Alfieri is an Italian surname.","zh":"Alfieri 是一个意大利姓氏。"},{"en":"I found a biography of Vittorio Alfieri at the library.","zh":"我在图书馆找到了一本关于维托里奥·阿尔菲耶里（Vittorio Alfieri）的传记。"}]},{"partOfSpeech":"n.","definition":{"en":"In Arthur Miller’s play A View from the Bridge, Alfieri is the lawyer-narrator who comments on the events and adds a reflective, moral perspective.","zh":"在阿瑟·米勒的戏剧《桥头眺望》（A View from the Bridge）中，Alfieri 是律师兼叙述者，会对故事进行评论，并提供带有道德反思的视角。"},"examples":[{"en":"Alfieri narrates parts of the story in A View from the Bridge.","zh":"在《桥头眺望》中，Alfieri 叙述了故事的部分内容。"},{"en":"Through Alfieri, the play shows the tension between law and personal honor.","zh":"通过 Alfieri，这部剧展现了法律与个人名誉（面子/荣誉）之间的冲突。"}]}],"phonetic":"/ælˈfjɛri/","extraExplanation":["“Alfieri”在意大利语里常见作姓氏。英语语境中，如果在文学课或戏剧讨论里看到它，很多时候是在指《桥头眺望》里的角色（发音和拼写都固定）。","相关文学人物：Vittorio Alfieri（1749–1803）是意大利悲剧作家与诗人；但在英语学习材料里，更常见的“Alfieri”通常来自阿瑟·米勒的戏剧。"]}
{"word":"alfilaria","summary":{"en":"Alfilaria is a wild plant (often *Erodium cicutarium*) known for its needle-like seeds, common in dry regions of the western U.S.","zh":"Alfilaria是一种常见于美国西部干燥地区的野生植物（常指*Erodium cicutarium*），以细长像针的种子著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small wild plant (often the species *Erodium cicutarium*) with needle-like seed pods, common in dry places in the western U.S.; also called (redstem) filaree.","zh":"一种常见的野生小草本植物（常指*Erodium cicutarium*，即“针果鹤虱/红茎鹤虱”），在美国西部等干燥地区常见，种子果荚细长像针；也常叫（红茎）filaree。"},"examples":[{"en":"After the spring rains, alfilaria covers the hillsides with low, feathery green growth.","zh":"春雨过后，山坡上会长满一片片低矮、羽状的绿色alfilaria。"},{"en":"The dog came back with alfilaria seeds stuck in its fur.","zh":"狗回来时，毛里粘了不少alfilaria的种子。"},{"en":"Some ranchers consider alfilaria good forage when it’s young.","zh":"一些牧场主认为alfilaria在幼嫩时是不错的牧草。"}]}],"synonyms":["filaree","redstem filaree","storksbill (regional)"],"phonetic":"/ˌælfiˈlɛriə/","extraExplanation":["“alfilaria”多见于美国西南部/西部英语语境，尤其在牧场、野地植物介绍里。","词源与西班牙语有关，常被解释为来自表示“像针/小别针”的词（因其种子果荚细长尖锐、容易粘到毛发或衣物上）。","在日常英语中更常见的同义称呼是“filaree / filaree seeds（针状种子）”。"]}
{"word":"alfileria","summary":{"en":"Alfilería is a Spanish word meaning a notions/haberdashery shop (or the trade) dealing with pins and small sewing items.","zh":"Alfilería 是西班牙语，常指卖别针等针线小物的店，也可指相关行业。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) a haberdashery or notions shop; a place that sells small sewing items like pins, needles, and buttons.","zh":"（西班牙语）小针线用品店；出售别针、针、纽扣等缝纫小物的店。"},"examples":[{"en":"I stopped by the alfilería to buy pins and thread.","zh":"我去那家 alfilería 买了别针和线。"},{"en":"In some neighborhoods, the alfilería is where people get quick sewing supplies.","zh":"在一些社区里，alfilería 是人们快速买到针线用品的地方。"}]},{"partOfSpeech":"n.","definition":{"en":"(Spanish) the trade or craft related to making or selling pins and similar small metal fasteners.","zh":"（西班牙语）与制作或销售别针及类似小金属扣件有关的行业/手艺。"},"examples":[{"en":"Historically, alfilería was an important small craft in local markets.","zh":"从历史上看，alfilería 曾是地方集市里重要的小手工业。"}]}],"synonyms":["notions shop","haberdashery (BrE)","sewing-supplies store"],"phonetic":"/ˌælfiˈlɛriə/","extraExplanation":["“Alfilería”来自西班牙语“alfiler”（别针）。在不同地区，它既可以指卖针线小物的店，也可泛指与别针相关的行业。英语里通常不会用这个词，更多出现在西语语境、地名招牌或双语文本中。","如果你是在某个句子/店招/地址里看到“alfileria/alfilería”，也可能是店名或品牌名；发音和含义会跟当地用法有关。"]}
{"word":"alfilerilla","summary":{"en":"*Alfilerilla* is Spanish for “a small pin,” and in some regions it can also name a pin-like wild plant (often storksbill/filaree).","zh":"*Alfilerilla* 是西班牙语，常指“小别针”，在一些地区也可指外形/种子像针的野生植物（常见为鹳嘴草/针草类）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small pin; a diminutive form of Spanish *alfiler* (“pin”), often used affectionately or to mean something tiny and pin-like.","zh":"小别针；西班牙语 *alfiler*（别针）的指小形式，常用来表示“更小的别针/像针一样的小东西”。"},"examples":[{"en":"She fixed the ribbon with an *alfilerilla* so it wouldn’t slip.","zh":"她用一枚小别针（*alfilerilla*）把丝带固定住，免得滑落。"},{"en":"Be careful—there’s an *alfilerilla* on the table.","zh":"小心——桌上有一枚小别针（*alfilerilla*）。"}]},{"partOfSpeech":"n.","definition":{"en":"(in some regions) a common name for certain wild plants whose seeds or shape resemble pins (often referring to storksbill/filaree, *Erodium* species).","zh":"（部分地区用法）某些野生植物的俗名，因为种子或外形像“针”（常指鹳嘴草/针草一类，*Erodium* 属）。"},"examples":[{"en":"In spring, the fields fill with *alfilerilla* and other wildflowers.","zh":"春天，田野里开满了针草（*alfilerilla*）和其他野花。"},{"en":"The *alfilerilla* seeds stick to your socks after a hike.","zh":"徒步后，针草（*alfilerilla*）的种子会粘在袜子上。"}]}],"synonyms":["alfiler (pin)","alfilerito (small pin)","(plant) alfilerillo","(plant) filaree"],"phonetic":"/ˌælfiːləˈriːjə/","extraExplanation":["*Alfilerilla* 是西班牙语常见的“指小词”（diminutive）：*alfiler*（别针）→ *alfiler-illa*，带有“小、可爱、少量”的语感。不同地区也会把某些“像针一样”的植物叫作 *alfilerilla*，因此具体所指可能随国家/方言而变。","如果你告诉我语境（国家/地区、出现在哪句话里），我可以帮你判断更可能是“别针”还是“植物名”。"]}
{"word":"alfilerillo","summary":{"en":"“Alfilerillo” is Spanish for a tiny pin, and it can also refer to a wild *Erodium* plant (storksbill/filaree) named for its needle-like seeds.","zh":"“Alfilerillo”在西班牙语里可指“小别针”，也可指牻牛儿苗属（storksbill/filaree）的一类野草，因种子像针而得名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) a small pin; a diminutive of “alfiler” (“pin”), often used affectionately or to mean a very tiny pin.","zh":"（西班牙语）小别针；“alfiler（别针）”的指小词，常带有“更小、很可爱”的语气。"},"examples":[{"en":"In the sewing kit, there were a few alfilerillos for delicate fabric.","zh":"在针线盒里，有几枚适合精细布料的小别针（alfilerillos）。"},{"en":"She fixed the hem with an alfilerillo before sewing it properly.","zh":"她先用一枚小别针（alfilerillo）把衣摆别住，再认真缝好。"}]},{"partOfSpeech":"n.","definition":{"en":"(Latin American/Spain, common name) a wild plant in the genus *Erodium* (often *Erodium cicutarium*), known in English as storksbill or (redstem) filaree; its long, needle-like seed shape inspires the name.","zh":"（西语常用俗名）牻牛儿苗属（*Erodium*，常指 *Erodium cicutarium*）的一种野草；英语常叫 storksbill 或（redstem）filaree，因种子细长像“针”而得名。"},"examples":[{"en":"After the rain, alfilerillo covered the field with small pink flowers.","zh":"雨后，田野里长满了开着小粉花的牻牛儿苗（alfilerillo）。"},{"en":"The hikers picked alfilerillo seeds out of their socks.","zh":"徒步者从袜子上把牻牛儿苗（alfilerillo）的种子挑出来。"}]}],"synonyms":["(pin sense) small pin","(plant sense) storksbill","filaree","redstem filaree"],"phonetic":"/ˌɑlfiˌlɛˈɹijoʊ/","extraExplanation":["“alfilerillo”来自“alfiler（别针）+ -illo（指小后缀）”，所以字面意思就是“像小针一样的东西”。在不少地区它也被用作植物俗名，指一种种子细长、容易黏在衣物或动物毛上的野草。"]}
{"word":"alfin","summary":{"en":"“Alfin” is usually a personal name; if you meant the adjective “elfin,” it means fairy-like and very small/delicate.","zh":"“Alfin”通常是人名；如果你想查形容词“elfin”，它表示“精灵般的、很小巧纤细的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Alfin: a given name (first name) and sometimes a family name, used in several countries (often for boys). It does not have one single fixed dictionary meaning in English.","zh":"Alfin：人名（名字），有时也作姓氏，在一些国家/地区使用（常见于男生）。在英语里它通常没有固定的词典义。"},"examples":[{"en":"Alfin is my classmate; he’s from Indonesia.","zh":"Alfin 是我的同学；他来自印度尼西亚。"},{"en":"Please ask Alfin to email me the file.","zh":"请让 Alfin 把文件发邮件给我。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Common confusion) A misspelling of “elfin,” meaning very small, delicate, or fairy-like.","zh":"（常见混淆）可能是 “elfin” 的拼写错误；elfin 意为“很小巧的、精灵般的”。"},"examples":[{"en":"She has an elfin face and a quiet smile.","zh":"她的脸很小巧精致，笑容很安静。"},{"en":"The story describes an elfin creature in the forest.","zh":"故事描写了森林里一种精灵般的生物。"}]}],"synonyms":["elfin (if that is what you meant)"],"phonetic":"/ˈæl.fɪn/","extraExplanation":["“Alfin”更多见于姓名（例如印尼、马来西亚等地较常见），因此在英文语境里通常当作专有名词使用，不像普通词汇那样有稳定词义。","如果你原本想查的是形容词“小精灵似的”，正确拼写一般是 elfin（不是 alfin）。你也可以告诉我你看到这个词的句子，我可以帮你判断具体是哪一种。"]}
{"word":"alfiona","summary":{"en":"“Alfiona” is mainly used as a personal name, not a common English word.","zh":"“Alfiona”主要作为人名使用，不是常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a female given name (proper noun); not a standard English vocabulary word, but used as a personal name.","zh":"女性名字（专有名词）；不是常见英语词汇，但可作为人名使用。"},"examples":[{"en":"Alfiona introduced herself at the meeting and shared her project idea.","zh":"Alfiona 在会议上做了自我介绍，并分享了她的项目想法。"},{"en":"I got an email from Alfiona about the schedule change.","zh":"我收到了 Alfiona 发来的邮件，说日程有调整。"}]}],"synonyms":["(no direct synonyms; it’s a name)"],"phonetic":"/ælˈfiːənə/","extraExplanation":["“Alfiona”更像是人名而不是英语单词，因此在英语词典里通常查不到固定释义。不同地区可能有不同拼写与读法；如果你是在某篇文章、游戏或社交平台看到的，它也可能是昵称/用户名。","如果你想确认读音与来源，最可靠的方法是看当事人或作品的官方拼写与发音说明；也可以告诉我你看到它的语境（国家/语言/句子），我可以更准确地判断。"]}
{"word":"alfione","summary":{"en":"“Alfione” is mainly used as a proper name, not a common English word with a set meaning.","zh":"“Alfione”主要作为专有名词使用，不是英语里有固定词义的常用词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a proper name (surname or given name), likely of Italian origin; not a standard English vocabulary word with an established dictionary meaning","zh":"专有名词（姓氏或名字），可能源自意大利语；并非英语中有固定词典释义的常用词"},"examples":[{"en":"I found a researcher named Alfione in the author list.","zh":"我在作者名单里看到一位名叫 Alfione 的研究者。"},{"en":"Alfione is a family name in this record, not an English word.","zh":"在这份记录里，Alfione 是一个姓氏，不是英语单词。"}]}],"phonetic":"/ælfiˈoʊni/","extraExplanation":["“Alfione”更像人名/姓氏（例如意大利裔姓氏），因此通常不会像普通英语词汇那样有固定“词义”。如果你是在某篇文章、歌词、游戏或品牌里看到它，请把原句/上下文发来，我可以帮你判断它在该语境中的指代（人名、地名、账号名、作品名等），以及是否其实是拼写接近的其他词。"]}
{"word":"Alfirk","summary":{"en":"Alfirk is the traditional name of the star Beta Cephei in the constellation Cepheus.","zh":"Alfirk 是仙王座中恒星“β仙王座”（Beta Cephei/β Cephei）的传统名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a star name: the traditional proper name of Beta Cephei (β Cephei), a bright star in the constellation Cepheus, known in astronomy as the prototype of the “Beta Cephei variables” (a class of pulsating stars).","zh":"恒星名：北极仙王座β星（β Cephei）的传统专名，位于仙王座（Cepheus）内；在天文学中它也因“β仙王座型变星”（一类脉动变星）的代表星而出名。"},"examples":[{"en":"Alfirk (Beta Cephei) is a well-known star in the constellation Cepheus.","zh":"Alfirk（仙王座β星）是仙王座中一颗很有名的恒星。"},{"en":"In astronomy class, we learned that Alfirk gives its name to the Beta Cephei type of variable stars.","zh":"在天文学课上，我们学到Alfirk让“β仙王座型变星”这一类变星得名（或作为代表星）。"}]}],"synonyms":["Beta Cephei","β Cephei"],"phonetic":"/ˈæl.fɝk/","extraExplanation":["“Alfirk”常见于星图、天文软件和科普资料中，属于传统恒星专名（proper name），通常不用于日常英语对话。","在许多恒星专名中，前缀“Al-”常与阿拉伯语来源有关；不少传统星名来自中世纪阿拉伯天文学传统，但具体词源在不同资料里可能有细微差异。"]}
{"word":"alfirk","summary":{"en":"Alfirk is the proper name of the star Beta Cephei in the constellation Cepheus.","zh":"Alfirk 是北仙王座中“北仙王座β”（Beta Cephei）这颗恒星的专名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Alfirk: the traditional proper name of the star Beta Cephei, a bright star in the constellation Cepheus (a northern constellation).","zh":"Alfirk：北仙王座（Cepheus）中一颗亮星——“北仙王座β”（Beta Cephei）的传统专名。"},"examples":[{"en":"Alfirk (Beta Cephei) is one of the brighter stars in the constellation Cepheus.","zh":"Alfirk（北仙王座β）是北仙王座中较亮的恒星之一。"},{"en":"On a clear night, you can use a star map to locate Cepheus and identify Alfirk.","zh":"在晴朗的夜晚，你可以用星图找到北仙王座并辨认出 Alfirk。"}]}],"synonyms":["Beta Cephei","β Cephei"],"phonetic":"/ælˈfɝk/","extraExplanation":["“Alfirk”常见于天文学与观星资料中，属于恒星的传统名称而非普通英语词汇。传统恒星名很多来自阿拉伯语在中世纪传入欧洲的天文传统，因此在英语里通常作为专有名词使用（首字母大写），不加复数，也不用于一般意义的“形容/动词”用法。"]}
{"word":"alfoncino","summary":{"en":"“alfoncino/alfonsino” is a deep-sea fish commonly eaten as seafood.","zh":"“alfoncino/alfonsino”指一种常作为海鲜食用的深海鱼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of deep-sea fish (often red or pink), eaten as seafood; also spelled “alfonsino.”","zh":"一种深海鱼（常见为红色或粉红色），可食用的海鲜；也常拼作“alfonsino”。"},"examples":[{"en":"We ordered grilled alfonsino with lemon and herbs.","zh":"我们点了柠檬香草烤的阿方西诺鱼。"},{"en":"Alfonsino is sometimes served as sashimi in Japanese restaurants.","zh":"在一些日料店里，阿方西诺鱼有时也会做成刺身。"},{"en":"The menu listed “alfoncino,” but it likely meant “alfonsino.”","zh":"菜单上写的是“alfoncino”，但很可能指的是“alfonsino”。"}]}],"synonyms":["alfonsino","splendid alfonsino"],"phonetic":"ˌæl.fɑnˈsiː.noʊ","extraExplanation":["“alfoncino”在英语里不算常见标准拼写；更常见的是“alfonsino”。在海鲜语境中，它通常指深海鱼类（常见对应学名 Beryx splendens），有时也会被称作“splendid alfonsino”。不同国家/餐厅可能因转写习惯出现拼写差异，点菜时看描述（红色鱼、深海鱼）更可靠。"]}
{"word":"Alfons","summary":{"en":"Alfons is a male first name, a European form of Alfonso/Alphonse.","zh":"Alfons 是男性名，是 Alfonso/Alphonse 的欧洲变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a masculine given name (first name), common in several European languages; a form of “Alfonso/Alphonse.”","zh":"男性名字（名），在多种欧洲语言中常见；是 Alfonso/Alphonse 的一种形式。"},"examples":[{"en":"Alfons is my grandfather’s name.","zh":"Alfons 是我祖父的名字。"},{"en":"In the email, Alfons introduced himself as a designer from Prague.","zh":"在邮件里，Alfons 自我介绍说他是来自布拉格的设计师。"},{"en":"We met Alfons at the conference and exchanged contact information.","zh":"我们在会议上认识了 Alfons，并交换了联系方式。"}]}],"synonyms":["Alfonso","Alphonse","Alfonsus"],"phonetic":"/ˈæl.fɑːns/","extraExplanation":["“Alfons”多见于德语、波兰语、捷克语、斯堪的纳维亚语等语境，常被视为 Alfonso（西班牙语/意大利语）或 Alphonse（法语）的同源变体。","词源通常追溯到古日耳曼语成分，含义常被解释为“高贵/贵族”（adal）+“准备好/敏捷”（如 funs 相关成分），因此可理解为“高贵而有准备的人”。","文化提示：捷克新艺术（Art Nouveau）画家与设计师 Alfons Mucha（慕夏）使这个名字在艺术领域较为知名。"]}
{"word":"Alfonse","summary":{"en":"Alfonse is a male first name, commonly a spelling variant of Alphonse or Alfonso.","zh":"Alfonse 是男性名字，常见为 Alphonse 或 Alfonso 的拼写变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name; a variant spelling of Alphonse/Alfonso.","zh":"男性名字；Alphonse/Alfonso 的一种拼写变体。"},"examples":[{"en":"Alfonse is a family name passed down for generations.","zh":"Alfonse 是家族世代相传的名字。"},{"en":"I met Alfonse at the new student orientation.","zh":"我在新生迎新活动上认识了 Alfonse。"}]}],"synonyms":["Alphonse","Alfonso"],"phonetic":"/ælˈfɑns/","extraExplanation":["Alfonse 通常被视为 Alphonse（多见于法语语境）或 Alfonso（多见于西班牙语、意大利语语境）的变体拼写。","这些名字可追溯到日耳曼语系的成分，常被解释为与“高贵/贵族（noble）”与“准备好/愿意（ready）”相关；不同语言与地区会出现不同拼写与发音习惯。"]}
{"word":"alfonsin","summary":{"en":"Alfonsin usually refers to Raúl Alfonsín, the Argentine president who helped restore democracy in the 1980s.","zh":"Alfonsin通常指阿根廷前总统劳尔·阿方辛，他在20世纪80年代推动阿根廷恢复民主。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Raúl Alfonsín (1927–2009), an Argentine politician who served as President of Argentina (1983–1989) and is widely remembered for helping restore democracy after military rule.","zh":"劳尔·阿方辛（Raúl Alfonsín，1927–2009），阿根廷政治人物，1983–1989年任阿根廷总统，常被认为是在军政府结束后推动国家恢复民主的重要人物。"},"examples":[{"en":"Many Argentines remember Alfonsín as a key figure in the country’s return to democracy.","zh":"许多阿根廷人记得阿方辛是国家重返民主的重要人物。"},{"en":"In our history class, we discussed Alfonsín’s presidency after the military dictatorship.","zh":"在历史课上，我们讨论了军政府之后阿方辛的总统任期。"}]}],"synonyms":["Raúl Alfonsín","Alfonsín"],"phonetic":"/ˌɑl.fɑnˈsin/","extraExplanation":["“Alfonsín”在西班牙语里通常带重音符号（Alfonsín），重音落在最后一个音节。英语文本里有时会省略重音符号，写作“Alfonsin”。","他在阿根廷当代史中常与“民主回归”“审判军政府时期的人权罪行（对军政府领导人的审判）”等话题一起出现。"]}
{"word":"Alfonso","summary":{"en":"Alfonso is a common male first name, especially in Spanish and Italian contexts.","zh":"Alfonso 是常见的男性名字，尤其常见于西班牙语和意大利语语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name), common in Spanish- and Italian-speaking cultures; sometimes also used as a surname","zh":"男性名字（名），常见于西班牙语和意大利语文化中；有时也可作姓氏"},"examples":[{"en":"Alfonso is my grandfather’s name.","zh":"Alfonso 是我祖父的名字。"},{"en":"Alfonso moved to California for work.","zh":"Alfonso 为了工作搬到了加州。"},{"en":"I met Alfonso at a Spanish language class.","zh":"我在西班牙语课上认识了 Alfonso。"}]}],"synonyms":["Alonzo (related form)"],"phonetic":"/ælˈfɑnsoʊ/","extraExplanation":["“Alfonso”在英语里通常被当作专有名词（人名）使用。它常见于西班牙、墨西哥、意大利等地，也会出现在拉丁裔（Latino/Hispanic）社群中。","词源上一般认为来自中世纪的拉丁化/罗曼语形式，与日耳曼语元素有关，常被解释为带有“高贵/贵族”（noble）之意。","文化提示：在正式场合，你可以用 Mr./Dr. + 姓氏称呼对方；只叫 Alfonso 通常表示更熟悉或较随意的语境。"]}
{"word":"alfonso","summary":{"en":"Alfonso is mainly a male first name, also famous as a royal name in Spanish and Portuguese history.","zh":"Alfonso 主要是男性名，也因西班牙、葡萄牙历史上的王室使用而广为人知。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name, common in Spanish- and Italian-speaking cultures (often shortened to “Al” or “Fonzo”).","zh":"一个男性名字，在西班牙语和意大利语文化中较常见（常见昵称有 Al 或 Fonzo）。"},"examples":[{"en":"Alfonso moved to California for college.","zh":"Alfonso 去加州上大学。"},{"en":"My uncle Alfonso loves cooking for the whole family.","zh":"我叔叔 Alfonso 很喜欢给全家做饭。"}]},{"partOfSpeech":"n.","definition":{"en":"a historical royal name used by several kings, especially in Spain and Portugal (e.g., Alfonso X of Castile).","zh":"历史上的王室名字，西班牙和葡萄牙等地有多位国王使用过（例如卡斯蒂利亚的阿方索十世）。"},"examples":[{"en":"In history class, we learned about Alfonso X and his cultural projects.","zh":"历史课上我们学习了阿方索十世和他的文化项目。"},{"en":"Several Spanish kings were named Alfonso.","zh":"有好几位西班牙国王都叫 Alfonso（阿方索）。"}]}],"synonyms":["Alonzo","Alphonse"],"phonetic":"/ælˈfɑnsoʊ/","extraExplanation":["“Alfonso”源自中世纪西班牙常见的名字形式，通常被认为与日耳曼语系名字有关，含义常被解释为“高贵/尊贵”与“准备好/勇敢”等概念的组合。","在英语语境中它通常作为人名使用，拼写不变，但不同语言里读音会略有差异。"]}
{"word":"Alfonson","summary":{"en":"“Alfonson” is a rare male name, usually a variant of Alfonso/Alfonse.","zh":"“Alfonson”是较少见的男性名字，通常是 Alfonso/Alfonse 的变体。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A male given name; “Alfonson” is uncommon in English and is often a spelling variation or misspelling of Alfonso/Alfonse.","zh":"男性名字；“Alfonson”在英语中较少见，常被视为 Alfonso/Alfonse 的拼写变体或误拼。"},"examples":[{"en":"My classmate Alfonson moved here from another country.","zh":"我的同学 Alfonson 从另一个国家搬到这里。"},{"en":"Is your name spelled Alfonson or Alfonso?","zh":"你的名字拼作 Alfonson 还是 Alfonso？"}]}],"synonyms":["Alfonso","Alfonse","Alphonse"],"phonetic":"/ælˈfɑnsoʊn/","extraExplanation":["“Alfonso”是更常见的拼法，常见于西班牙语和意大利语文化中；“Alfonse/Alphonse”也常见于法语背景。它们大多源自日耳曼语姓名元素，含义常被解释为“高贵/准备好（noble/ready）”之类。","如果你是在找某位历史人物或名人，很多西班牙与意大利君主、贵族使用“Alfonso”这个名字（例如某些国王名号）。"]}
{"word":"Alfonzo","summary":{"en":"Alfonzo is usually a male first name (and sometimes a surname), commonly a variant spelling of Alfonso/Alonso.","zh":"Alfonzo 通常是男性名字（有时也作姓氏），多为 Alfonso/Alonso 的变体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name; a variant spelling of Alfonso/Alonso.","zh":"男性名字；是 Alfonso/Alonso 的一种拼写变体。"},"examples":[{"en":"Alfonzo is starting a new job next week.","zh":"Alfonzo 下周要开始一份新工作。"},{"en":"I met Alfonzo at the library after class.","zh":"下课后我在图书馆遇到了 Alfonzo。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname) in some communities.","zh":"在一些社群中也可作姓氏。"},"examples":[{"en":"Ms. Alfonzo emailed the class schedule to everyone.","zh":"Alfonzo 女士把课程表发邮件给了大家。"}]}],"synonyms":["Alfonso","Alonzo","Alonso"],"phonetic":"/ælˈfɑnzoʊ/","extraExplanation":["Alfonzo 常被视为 Alfonso 的变体拼写。Alfonso 源自中古西班牙语/意大利语形式，对应更早的日耳曼语名字，常被解释为“高贵、准备好（noble, ready）”之类的含义。","在英语环境里，人名的拼写可能因家庭传统、地区习惯或个人偏好而不同（例如 Alfonso / Alonzo / Alfonzo）。发音通常相近，但也可能因个人或地区口音略有差异。"]}
{"word":"Alford","summary":{"en":"Alford is most commonly a surname, and it can also be a place name in English-speaking regions.","zh":"Alford 最常见为英文姓氏，也可用作英语国家的一些地名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname).","zh":"（人名）姓氏：Alford（奥尔福德）。"},"examples":[{"en":"Dr. Alford will see you now.","zh":"奥尔福德医生现在要见你。"},{"en":"My English teacher’s last name is Alford.","zh":"我英语老师的姓是 Alford。"}]},{"partOfSpeech":"other","definition":{"en":"A place name used for some towns or areas (especially in English-speaking countries).","zh":"（地名）Alford：一些英语国家里的城镇或地区名称。"},"examples":[{"en":"They drove through Alford on the way to the coast.","zh":"他们去海边的路上开车经过了 Alford。"},{"en":"Alford is a small town with a long local history.","zh":"Alford 是一个小镇，有着悠久的地方历史。"}]}],"phonetic":"/ˈɔl.fərd/","extraExplanation":["“Alford”常被认为源自古英语地名构词：常见解释是“old（老的）+ ford（浅滩/可涉水处）”，意指“老渡口/老浅滩”。因此它既可能是地名，也可能由地名演变为姓氏。","英语里很多姓氏来自地名（例如 Hill, Wood, Brook），Alford 也属于这种常见类型：最初用来表示“来自 Alford 的人”。"]}
{"word":"alforge","summary":{"en":"Alforge means a saddlebag hung over an animal’s saddle to carry supplies.","zh":"Alforge 指挂在牲畜鞍上的鞍囊，用来装载随身物品或货物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a saddlebag; a bag (often one of a pair) hung over a horse or donkey’s saddle for carrying things","zh":"（多指一对中的）鞍囊；挂在马/驴鞍上的行囊，用来装载物品"},"examples":[{"en":"The rider packed bread and water into the alforge before crossing the hills.","zh":"骑手把面包和水装进鞍囊（alforge）里，准备翻越山丘。"},{"en":"In the village market, she sold spices from her alforge.","zh":"在村庄集市上，她从鞍囊（alforge）里拿出香料来卖。"}]}],"synonyms":["saddlebag","pannier","packbag"],"phonetic":"/alˈfɔr.dʒeɪ/","extraExplanation":["“alforge”常见于西班牙语/葡萄牙语语境中（也会出现在英语的历史或文学描写里），指传统骑乘或驮运用的鞍袋。词首的“al-”来源于阿拉伯语借词传统，在伊比利亚半岛许多与日常器物相关的词里都能看到这一痕迹。"]}
{"word":"alforja","summary":{"en":"Alforja means a saddlebag used on pack animals, especially in Spanish-speaking contexts.","zh":"Alforja 指驮运或骑乘动物（如马、驴、骡）鞍具两侧的鞍袋，常见于西语文化语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a saddlebag (often a pair of bags) hung over a horse, donkey, or mule; sometimes used more generally for a travel bag carried on an animal’s saddle.","zh":"（常指一对）挂在马、驴或骡子鞍具两侧的鞍袋；也可泛指骑乘动物用来装行李的袋子。"},"examples":[{"en":"The guide tied the alforja to the mule before the mountain trip.","zh":"向导在上山前把鞍袋（alforja）系在骡子背上。"},{"en":"She stored food and water in the alforja for the long ride.","zh":"她把食物和水装进鞍袋（alforja），准备长途骑行。"}]}],"synonyms":["saddlebag","saddlebags","pannier"],"phonetic":"/ælˈfɔɹ.hə/","extraExplanation":["“alforja”是西班牙语借词，常见于与西班牙语文化背景相关的语境（如拉丁美洲乡村、骑行/驮运旅行描写）。在一般英语中更常用的对应词是 “saddlebag / saddlebags”。","词源上它经由西班牙语传入，西班牙语中许多以“al-”开头的词与阿拉伯语影响有关，这个词也带有这种历史痕迹。"]}
{"word":"alforjas","summary":{"en":"Alforjas are saddlebags—usually a pair of bags hung over a saddle for carrying supplies.","zh":"alforjas 指马鞍袋／驮袋，通常是一对挂在鞍具两侧用来装载物品的袋子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"saddlebags (usually a pair of bags) hung over a horse’s saddle; sometimes used more broadly for pannier-style bags on an animal or bike.","zh":"（通常成对的）马鞍袋／驮袋；也可泛指挂在动物或自行车两侧的驮包（类似“边包/驮包”）。"},"examples":[{"en":"He packed food and water into the alforjas before the long ride.","zh":"他在长途骑行前把食物和水装进马鞍袋里。"},{"en":"The mule carried alforjas filled with supplies up the mountain trail.","zh":"骡子驮着装满补给的驮袋沿山路向上走。"}]}],"synonyms":["saddlebags","panniers","saddlebag"],"phonetic":"/ælˈfɔr.hɑs/","extraExplanation":["“alforjas”常见于美国西南部与拉丁美洲语境（如牧场、骑马旅行、驮运）。在英语中多作为借词使用，通常指挂在马鞍两侧的一对袋子。","词源上来自西班牙语 alforjas，而西班牙语中许多以“al-”开头的词受到阿拉伯语影响（“al-”相当于定冠词“the”）。在现代英语里它通常被当作复数来用；需要单数时有时会见到“alforja”，但不如复数常用。"]}
{"word":"Alfraganus","summary":{"en":"Alfraganus is the Latinized name of the 9th-century astronomer Aḥmad al-Farghānī.","zh":"Alfraganus 是9世纪天文学家艾哈迈德·法尔加尼（Aḥmad al-Farghānī）的拉丁化名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The Latinized name of Aḥmad al-Farghānī, a 9th-century Persian astronomer whose works on astronomy were widely read in medieval Europe.","zh":"阿尔弗拉加努斯：9世纪波斯天文学家艾哈迈德·法尔加尼（Aḥmad al-Farghānī）的拉丁化名字；其天文学著作在中世纪欧洲广泛流传。"},"examples":[{"en":"In medieval Latin texts, al-Farghānī is often called Alfraganus.","zh":"在中世纪拉丁文献中，法尔加尼常被称为 Alfraganus（阿尔弗拉加努斯）。"},{"en":"Dante refers to “Alfraganus” when mentioning famous astronomers in the Middle Ages.","zh":"但丁在提到中世纪著名天文学家时，也会提及“Alfraganus（阿尔弗拉加努斯）”。"}]}],"synonyms":["al-Farghānī","Ahmad al-Farghani","Aḥmad ibn Muḥammad al-Farghānī"],"phonetic":"/ælˈfræɡənəs/","extraExplanation":["“Alfraganus”并不是英文常用词，而是学术/历史语境里的专名（人名）。它来自阿拉伯语姓名 al-Farghānī 的拉丁化写法：中世纪欧洲学者常把阿拉伯学者的名字改写成便于拉丁语书写和发音的形式。","他最著名的作品常被称为《Elements of Astronomy》（天文学纲要/要素），曾作为欧洲大学与学者了解托勒密天文学的重要入门资料，对中世纪到文艺复兴时期的天文学传播影响很大。"]}
{"word":"Alfred","summary":{"en":"Alfred is a common male first name; it can also specifically refer to King Alfred the Great in English history.","zh":"Alfred 是常见的男性名；也可特指英国历史上的阿尔弗雷德大帝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A male given name (first name).","zh":"一个男性名字（名）。"},"examples":[{"en":"My neighbor Alfred is a retired teacher.","zh":"我的邻居阿尔弗雷德是一位退休教师。"},{"en":"Alfred called to say he’ll be late.","zh":"阿尔弗雷德打电话说他会迟到。"}]},{"partOfSpeech":"n.","definition":{"en":"(Often refers to) King Alfred the Great (849–899), an English king known for defending his kingdom and supporting education and law.","zh":"（常指）“阿尔弗雷德大帝”（849–899），英格兰国王，以抵御入侵、推动教育与法律而闻名。"},"examples":[{"en":"In British history class, we learned about Alfred the Great.","zh":"在英国历史课上，我们学习了阿尔弗雷德大帝。"},{"en":"A statue of Alfred the Great stands in Winchester.","zh":"温彻斯特有一座阿尔弗雷德大帝的雕像。"}]}],"synonyms":["Alf (nickname)"],"phonetic":"/ˈælfrəd/","extraExplanation":["“Alfred”源自古英语名字“Ælfræd”，大致含义是“精灵的忠告/智慧的建议”（ælf=精灵；ræd=忠告、建议）。在英语文化中这是一个传统而常见的男性名。","文学与文化中也常见这个名字：例如蝙蝠侠的管家“Alfred Pennyworth”，以及狄更斯《荒凉山庄》中的角色“Esther Summerson”的监护人之一“Mr. Jarndyce”的仆人等（不同作品里常用来塑造稳重、可靠的形象）。"]}
{"word":"alfred","summary":{"en":"Alfred is a traditional male first name, and it can also refer to famous people or characters named Alfred.","zh":"Alfred 是一个传统的男性英文名，也可用来指代名叫 Alfred 的著名人物或角色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name).","zh":"（男子）名字；男性英文名。"},"examples":[{"en":"My grandfather’s name is Alfred.","zh":"我爷爷叫阿尔弗雷德。"},{"en":"Alfred is often shortened to Al.","zh":"Alfred 常被简称为 Al。"}]},{"partOfSpeech":"n.","definition":{"en":"a person named Alfred, especially a well-known fictional or historical figure with that name (used as a proper noun).","zh":"名叫 Alfred 的人；特指著名的历史人物或文学/影视角色（专有名词）。"},"examples":[{"en":"Alfred serves as Bruce Wayne’s loyal butler in Batman stories.","zh":"在《蝙蝠侠》的故事里，Alfred 是布鲁斯·韦恩忠诚的管家。"},{"en":"Alfred the Great was a king of Wessex in early English history.","zh":"Alfred the Great（阿尔弗雷德大帝）是英格兰早期历史上威塞克斯王国的国王。"}]}],"synonyms":["Al (nickname)","Alf (nickname)"],"phonetic":"/ˈælfrəd/","extraExplanation":["“Alfred”来自古英语名字 Ælfræd，常被解释为“精灵（elf）+ 建议/智慧（counsel）”，所以有“智慧的精灵”之类的含义。","在英语文化里，这是一个偏传统、经典的男性名字；口语中常见昵称有 Al、Alf、Freddie（较少见）。"]}
{"word":"Alfreda","summary":{"en":"Alfreda is a feminine given name, the female form of Alfred.","zh":"Alfreda 是女性名字，是 Alfred 的女性形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name; the feminine form of Alfred, used mainly in English-speaking countries (now somewhat uncommon).","zh":"女性名字；Alfred（阿尔弗雷德）的女性形式，主要见于英语国家（现在较少见）。"},"examples":[{"en":"Alfreda moved to Chicago to study nursing.","zh":"Alfreda 去芝加哥学习护理。"},{"en":"My great-aunt Alfreda was born in the 1930s.","zh":"我的姑婆 Alfreda 出生于 20 世纪 30 年代。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a family name (surname).","zh":"（少见）姓氏。"},"examples":[{"en":"Dr. Alfreda published a paper on public health.","zh":"Alfreda 医生发表了一篇关于公共卫生的论文。"}]}],"synonyms":["Alfred","Freda"],"phonetic":"/ælˈfriːdə/","extraExplanation":["Alfreda 源自古英语名字 Alfred，常被解释为“精灵的忠告/智慧”（aelf“精灵”+ raed“忠告、建议”）。因此它带有一种传统、古典的气质。","在美国，Alfreda 在 20 世纪上半叶更常见；如今更常见的相近名字有 Alfred、Alfredo、Alfreda 的简写可用 Freda（不过 Freda 也可能独立来源于其他名字）。"]}
{"word":"alfreda","summary":{"en":"Alfreda is usually a feminine first name (the female form of Alfred) and is sometimes used as a U.S. place name.","zh":"Alfreda 通常是女性名字（Alfred 的女性形式），有时也作为美国地名出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name, usually understood as the feminine form of Alfred.","zh":"女子名字，通常被理解为 Alfred（阿尔弗雷德）的女性形式。"},"examples":[{"en":"Alfreda moved to Chicago for a new job.","zh":"Alfreda 为了一份新工作搬到了芝加哥。"},{"en":"My grandmother’s name was Alfreda.","zh":"我外婆/祖母叫 Alfreda。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a place name in the U.S., such as a small community called Alfreda.","zh":"（较少见）美国的地名，例如名为 Alfreda 的小社区。"},"examples":[{"en":"He grew up near Alfreda, West Virginia.","zh":"他在西弗吉尼亚州的 Alfreda 附近长大。"}]}],"synonyms":["Alfred","Alfredine","Alfreda (as a place name)"],"phonetic":"/ælˈfriːdə/","extraExplanation":["Alfreda 一般被认为源自古英语名字 Alfred 的延伸：常见解释是由 *ælf*（精灵）+ *ræd*（建议、智慧）构成，因此常被引申为“睿智的顾问/有智慧的人”。","在英语文化里，Alfred 历史上较常见（如英国的 Alfred the Great），而 Alfreda 相对少见，更多见于早期移民家庭或作为纪念性取名。"]}
{"word":"Alfredo","summary":{"en":"Alfredo most commonly refers to a creamy white pasta sauce or a pasta dish made with it; it is also a male given name.","zh":"Alfredo 最常指奶油白酱或使用这种酱的意面菜；也可作男性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rich, creamy white sauce (usually made with butter, cream, and Parmesan) and the pasta dish served with it, especially fettuccine Alfredo","zh":"（通常由黄油、奶油和帕玛森芝士制成的）浓郁白奶油酱；也指拌这种酱的意面菜肴，尤其是“阿尔弗雷多宽面”"},"examples":[{"en":"I’ll have the fettuccine Alfredo, please.","zh":"请给我一份阿尔弗雷多宽面。"},{"en":"This Alfredo sauce is very creamy—did you add extra Parmesan?","zh":"这个阿尔弗雷多酱很浓稠——你多加了帕玛森芝士吗？"},{"en":"She made chicken Alfredo for dinner.","zh":"她晚餐做了鸡肉阿尔弗雷多意面。"}]},{"partOfSpeech":"n.","definition":{"en":"a male given name; also used as a surname in some cultures","zh":"男性名“Alfredo”（在一些文化中也可作姓氏）"},"examples":[{"en":"Alfredo is visiting his grandparents this weekend.","zh":"Alfredo 这周末要去看望他的祖父母。"},{"en":"My classmate Alfredo speaks both Spanish and English.","zh":"我的同学 Alfredo 会说西班牙语和英语。"}]}],"synonyms":["cream sauce","white sauce","fettuccine Alfredo"],"phonetic":"/ælˈfreɪdoʊ/","extraExplanation":["“Alfredo（阿尔弗雷多）”作为意面名称源自意大利罗马餐馆老板 Alfredo di Lelio。早期版本常用黄油+奶酪（而不一定加奶油）；在美国餐厅里更常见的是加入奶油的“奶油版”Alfredo。","常见搭配：fettuccine Alfredo（阿尔弗雷多宽面）、chicken/shrimp Alfredo（鸡肉/虾仁阿尔弗雷多）。点餐时说“Alfredo”通常默认指这种白奶油酱口味。"]}
{"word":"alfresco","summary":{"en":"Alfresco means “outdoors, in the open air,” especially for dining or events.","zh":"Alfresco 指“在户外、露天”，尤指户外用餐或露天活动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"In the open air; outdoors (often used when talking about eating, dining, or events outside).","zh":"在户外；在露天（常用于指户外用餐或露天活动）。"},"examples":[{"en":"We had an alfresco lunch on the patio.","zh":"我们在露台上吃了一顿露天午餐。"},{"en":"The café offers alfresco dining in summer.","zh":"这家咖啡馆在夏天提供户外用餐。"}]},{"partOfSpeech":"adv.","definition":{"en":"Outdoors; in the open air.","zh":"在户外；在露天。"},"examples":[{"en":"Let’s eat alfresco tonight.","zh":"我们今晚在户外吃吧。"},{"en":"They spent the evening alfresco, listening to music.","zh":"他们在户外度过了夜晚，听着音乐。"}]}],"synonyms":["outdoors","outside","in the open air","open-air"],"phonetic":"/ælˈfrɛs.koʊ/","extraExplanation":["“alfresco”来自意大利语，字面意思是“在清新的空气中”。英语里多与吃饭、咖啡馆座位、聚会等场景搭配，语气常带一点轻松、度假感。","在美式英语里，写作多作一个词（alfresco）；也常见搭配：alfresco dining / alfresco seating / alfresco concert。","注意与“al fresco”两词写法都常见；含义相同。"]}
{"word":"Alfric","summary":{"en":"Alfric is a rare Old English male name, and it often refers to the Anglo-Saxon writer and abbot Ælfric of Eynsham.","zh":"Alfric 是一个罕见的古英语男性名字，也常用来指盎格鲁-撒克逊时期的作家与修道院院长“艾因舍姆的 Ælfric”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a masculine given name of Old English origin (often written as Ælfric).","zh":"一个源自古英语的男性名字（常写作 Ælfric）。"},"examples":[{"en":"Alfric is a rare name today, but it appears in many texts about early England.","zh":"Alfric 如今很少见，但在许多关于早期英格兰的书里会出现。"},{"en":"They named their character Alfric to give the story an Anglo-Saxon feel.","zh":"他们把角色取名为 Alfric，让故事更有盎格鲁-撒克逊的感觉。"}]},{"partOfSpeech":"n.","definition":{"en":"(usually referring to Ælfric of Eynsham) an important Anglo-Saxon abbot and writer (c. 955–c. 1010), known for Old English religious works and sermons.","zh":"（通常指“艾因舍姆的 Ælfric”）一位重要的盎格鲁-撒克逊时期修道院院长与作家（约955—约1010），以古英语宗教著作和布道文闻名。"},"examples":[{"en":"Alfric wrote sermons in Old English to teach ordinary people.","zh":"Alfric 用古英语写布道文，以教导普通民众。"},{"en":"In class, we read a passage from Alfric to see how Old English worked.","zh":"课堂上我们读了 Alfric 的一段文字，来了解古英语的运作方式。"}]}],"synonyms":["Ælfric","Aelfric"],"phonetic":"/ˈælfrɪk/","extraExplanation":["“Ælfric”中的字母“Æ”读音接近英语里的短元音 /æ/（像 cat 里的 a），现代文章中常被简化写成“Alfric”或“Aelfric”。","名字来源：古英语 ælf（精灵）+ rīc（统治、强大），可理解为“精灵的统治者/强大如精灵的人”。","Ælfric of Eynsham 的作品在研究古英语词汇、语法与基督教教育史时非常重要，因此在语言学或中世纪文学课程里常会见到这个名字。"]}
{"word":"alfridaric","summary":{"en":"“Alfridaric” is not a standard English word; it is most likely a rare proper name (often fictional or user-created).","zh":"“Alfridaric”不是标准英语词汇；更可能是一个少见的专有名词（常见于虚构或自创名字）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare or nonstandard word; most likely a proper name (often used as a fictional/created name) rather than a common English vocabulary item.","zh":"一个很少见或非标准的词；更可能是专有名词（常见于虚构/自创名字），而不是常用英语词汇。"},"examples":[{"en":"I couldn’t find “Alfridaric” in standard English dictionaries; it may be a character name.","zh":"我在常见英语词典里找不到“Alfridaric”；它可能是一个角色名。"},{"en":"If “Alfridaric” is a username, ask the owner how they want it pronounced.","zh":"如果“Alfridaric”是用户名，最好询问使用者希望怎么读。"}]}],"phonetic":"ˌælfrɪˈdærɪk","extraExplanation":["“Alfridaric”看起来像是拼合/改写的日耳曼风格名字：可能让人联想到 Alfred（阿尔弗雷德）或 Alaric（阿拉里克）。如果你是在小说、游戏、家谱或网名里看到它，它通常不承载固定的“词典义”，含义取决于作者设定。","如果你想确认：1）它出现的上下文句子；2）是否有原始拼写（例如 Alfridric / Alfridarich 等）；3）是否来自某个作品或语言。我可以据此判断更接近哪个名字或词源。"]}
{"word":"alfridary","summary":{"en":"“alfridary” is not a recognized English word; it’s likely a misspelling or a proper name.","zh":"“alfridary”不是常见英语单词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name.","zh":"不是标准英语单词，可能是拼写错误或人名/专有名词。"},"examples":[{"en":"I couldn’t find “alfridary” in an English dictionary—did you mean another word?","zh":"我在英语词典里找不到“alfridary”——你是不是想写另一个词？"},{"en":"Could you share the full sentence where you saw “alfridary”?","zh":"你能把你看到“alfridary”的完整句子发我吗？"}]}],"extraExplanation":["“alfridary”很像拼写误差。常见的相近词形包括：\n- infirmary（医务室/医院病房）\n- lapidary（宝石雕刻师；简练的）\n- ancillary（辅助的；附属的）\n如果你把它出现的句子贴出来，或告诉我你想表达的中文意思，我可以帮你锁定最可能的正确单词与用法。","如果这是人名/地名/品牌名，通常不会出现在通用词典里；可以告诉我它来自哪里（书名、网站、游戏、课程材料等），我也能帮你判断读音和含义。"]}
{"word":"Alfur","summary":{"en":"Alfur is usually a proper name (often linked to Old Norse/Icelandic “elf”) and is also used in fantasy as an elf-like name.","zh":"Alfur 通常是一个专有名词（常与古北欧/冰岛语“精灵”相关），也常在奇幻作品中用作带“精灵感”的名字。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper name) A given name of Icelandic/Old Norse origin, related to the word for “elf.”","zh":"（专有名词）一个源自冰岛语/古北欧语的名字，与“精灵/妖精”这个词有关。"},"examples":[{"en":"His name is Alfur, an Icelandic name connected to the idea of an elf.","zh":"他叫 Alfur，这是一个与“精灵”概念相关的冰岛名字。"},{"en":"In some fantasy settings, Alfur is used as a character name to suggest something magical or elf-like.","zh":"在一些奇幻设定里，Alfur 常被用作角色名，用来暗示“有魔法、像精灵一样”的感觉。"}]},{"partOfSpeech":"other","definition":{"en":"(Fantasy/creative use) A stylized spelling used for an elf-like character, clan, or place name.","zh":"（奇幻/创作用法）一种风格化拼写，可用作“精灵风格”的角色、氏族或地名。"},"examples":[{"en":"The author named the forest guardians the Alfur to give them a mythical feel.","zh":"作者把森林守护者命名为 Alfur，让他们更有神话感。"}]}],"synonyms":["elf","elfin","Álfur"],"phonetic":"/ˈæl.fər/","extraExplanation":["“Alfur/Álfur”常被认为与古北欧语 álfr（复数：álfar）同源，意思是“精灵”。在冰岛文化与北欧传说里，“精灵/隐形人”是常见的民间想象元素，因此这个名字在语感上会带有一点神秘、自然与魔法的联想。","如果你指的是某个作品、游戏、品牌或人名（例如某位作者/角色/公司），告诉我上下文，我可以给出更精确的释义与用法。"]}
{"word":"alfur","summary":{"en":"“Alfur” isn’t a standard English word; it’s usually a Nordic/Icelandic form meaning “elf,” or a name/variant spelling used in fantasy contexts.","zh":"“alfur”不是标准英语词；多见于北欧/冰岛语来源，意为“精灵”，也可能是奇幻语境中的名字或变体拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard English word; most often seen as an Icelandic (or Old Norse–related) form meaning “elf” (Icelandic: álfur). In English contexts, it may appear as a name, a fantasy term, or a misspelling/variant of “elf.”","zh":"不是标准英语词；最常见的来源是冰岛语（或与古诺尔斯语相关）的词形，意思是“精灵”（冰岛语：álfur）。在英语语境中，它可能作为人名、奇幻用语出现，或是“elf”的拼写变体/误拼。"},"examples":[{"en":"In Icelandic folklore, an álfur (sometimes written as “alfur” without accents) is an elf-like hidden being.","zh":"在冰岛民间传说中，álfur（有时不写重音就写作“alfur”）指类似精灵的“隐匿之民”。"},{"en":"The game uses “Alfur” as a character name to suggest a Nordic, fantasy feel.","zh":"这款游戏把“Alfur”用作角色名，以营造北欧奇幻氛围。"}]}],"synonyms":["elf","Alf (name variant)"],"phonetic":"/ˈæl.fər/","extraExplanation":["“álfur”里的重音符号 á 会影响发音与词义；在英语文本里省略重音写成 alfur 很常见，但严格来说属于外来词转写。","如果你是在英语文章里看到 alfur，建议结合上下文判断：是北欧神话/冰岛文化相关的“精灵”，还是专有名词（人名、地名、角色名）。"]}
{"word":"Alfurese","summary":{"en":"“Alfurese” is a rare, older term meaning “related to the Alfur (Alifuru) peoples of eastern Indonesia,” or sometimes “an Alfur person.”","zh":"“Alfurese”是较旧且少见的词，可指“与印度尼西亚东部阿尔富尔（Alifuru）族群有关的”，有时也指“阿尔富尔人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"an older or rare term referring to the Alfur (Alifuru) people of eastern Indonesia, or to their languages/culture; sometimes used in historical writing","zh":"一个较旧或少见的用法，指印度尼西亚东部的阿尔富尔（Alfur/Alifuru）人，或与其语言/文化有关；多见于历史文献"},"examples":[{"en":"The museum label used the word “Alfurese” to describe objects from the Alifuru communities of Maluku.","zh":"博物馆说明牌用“Alfurese”来描述来自马鲁古（Maluku）阿利富鲁社群的物品。"},{"en":"Some older sources speak of “Alfurese languages,” but modern works usually name the specific language instead.","zh":"一些较早的资料会说“Alfurese languages（阿尔富尔语诸语言）”，但现代著作通常会直接写出具体语言名称。"}]},{"partOfSpeech":"n.","definition":{"en":"a person belonging to the Alfur (Alifuru) peoples (rare in modern English)","zh":"阿尔富尔（阿利富鲁）人（现代英语中较少用）"},"examples":[{"en":"In a 19th‑century travel account, the author called local residents “Alfurese.”","zh":"在一篇19世纪的旅行记中，作者把当地居民称作“Alfurese”。"}]}],"synonyms":["Alfur","Alifuru"],"phonetic":"/ˌæl.fjəˈriːz/","extraExplanation":["“Alfurese”不是现代英语里的常用词，更常见的是 Alfur / Alifuru（族群名），以及直接使用具体地区或语言名称（例如 Maluku 的某某语言/族群）。","在殖民时期或早期人类学/旅行文献里，这类词有时被当作一个笼统分类来使用，因此含义可能因作者与时代而不同；写作或研究时建议查证原文语境，并尽量采用当代更精确、当事群体更认可的称呼。"]}
{"word":"alfurese","summary":{"en":"Alfurese: an older word meaning “Alfur; relating to the Alfur peoples/cultures (Maluku, eastern Indonesia).”","zh":"Alfurese：较旧的词，指“阿尔富尔/阿尔富雷斯人”；也可作形容词指其文化、语言等（印度尼西亚东部马鲁古地区）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Alfur (Alfurese) peoples of eastern Indonesia (especially Seram and nearby islands in Maluku), or to their languages/cultures (an older ethnographic term).","zh":"（较旧的民族志用语）指印度尼西亚东部（尤指马鲁古群岛塞兰岛及附近岛屿）阿尔富尔/阿尔富雷斯人及其语言、文化的。"},"examples":[{"en":"The museum label describes the shield as Alfurese, from Seram in the Maluku Islands.","zh":"博物馆的说明牌把这面盾牌标注为“Alfurese（阿尔富雷斯人的）”，来自马鲁古群岛的塞兰岛。"},{"en":"Some older sources use “Alfurese” to group several communities in eastern Indonesia.","zh":"一些较早的资料用“Alfurese”来笼统指称印度尼西亚东部的多个社群。"}]},{"partOfSpeech":"n.","definition":{"en":"an Alfur person; an (older) term for an indigenous person from parts of the Maluku region.","zh":"阿尔富尔人；（旧称）马鲁古地区部分地方的原住民。"},"examples":[{"en":"The report mentions Alfurese communities living inland.","zh":"报告提到居住在内陆的阿尔富雷斯人社群。"}]}],"synonyms":["Alfur","Alfuran","Moluccan (broader, regional)"],"phonetic":"/ˌæl.fjəˈriːz/","extraExplanation":["这是一个在英文里较少见、偏历史/民族志语境的词。现代写作中更常见的是更具体的族群名称或用 “Alfur/Alfuran” 等说法，并尽量注明地点与自称（例如具体岛屿、族名或语言名）。","一些旧文献曾把 “Alfurese” 用作较宽泛的类别（有时带有殖民时期的分类色彩）。在当代学术或公共写作中，使用时注意语境与尊重当事群体的称呼会更合适。"]}
{"word":"Alfuro","summary":{"en":"Alfuro is a historical/ethnographic term for certain Indigenous peoples in eastern Indonesia, especially the Maluku (Moluccas), and it can be a broad outside label.","zh":"Alfuro（阿尔富罗）是民族志/历史用语，指印尼东部（尤指马鲁古/摩鹿加）的部分原住民社群，有时也被外部用作较宽泛的称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an Indigenous people of eastern Indonesia (especially the Maluku/Moluccas), sometimes used historically as a general label for “mountain/forest people.”","zh":"（印尼东部，尤指马鲁古/摩鹿加群岛的）阿尔富罗人；历史上有时被用作对“山地/森林居民”的笼统称呼。"},"examples":[{"en":"Some older travel books mention the Alfuro peoples of the Moluccas.","zh":"一些较早的游记会提到摩鹿加群岛的阿尔富罗人。"},{"en":"The word “Alfuro” is sometimes treated as an outside label rather than a group’s own name.","zh":"“Alfuro/阿尔富罗”有时被视为外来称呼，而不一定是族群自称。"}]}],"synonyms":["Alfur","Alfuru"],"phonetic":"ˈæl.fjʊˌruː","extraExplanation":["“Alfuro/Alfur/Alfuru”等拼写在英文资料中都可能出现，多见于殖民时期或早期民族志写作。现代语境下更建议使用更具体的族群名称（若已知），以避免把不同社群混称在一起。","该词在不同地区与不同作者笔下所指可能不完全一致：有时是特定社群，有时是对内陆、山地居民的泛称。阅读史料时可留意作者年代、地点与语境。"]}
{"word":"alfuro","summary":{"en":"Alfuro is an old, broad label used in some historical texts for Indigenous peoples in parts of the Moluccas (Indonesia), especially Halmahera, and is often avoided today for being imprecise.","zh":"Alfuro 是历史文本中对印尼摩鹿加群岛（尤指哈马黑拉岛）一些原住民的笼统称呼，如今常因不够准确而少用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historical term for certain Indigenous (non-Muslim) peoples of the Moluccas (Maluku Islands) in eastern Indonesia, especially on Halmahera; now often considered outdated or imprecise","zh":"（历史用语）指印度尼西亚东部摩鹿加群岛（马鲁古群岛）一些原住民（传统上多指非穆斯林群体），尤指哈马黑拉岛一带；现多被认为过时或不够准确"},"examples":[{"en":"Older colonial-era writings sometimes describe the Alfuro of Halmahera.","zh":"较早的殖民时期文献有时会描述哈马黑拉岛的 Alfuro 原住民。"},{"en":"Many modern sources avoid the word “Alfuro” because it groups different communities together.","zh":"许多现代资料会避免使用“Alfuro”，因为它把不同社群笼统归为一类。"}]}],"synonyms":["(historical) Alfur","(context-dependent) Indigenous peoples of the Moluccas"],"phonetic":"/ælˈfjʊroʊ/","extraExplanation":["“Alfuro/Alfur”常出现在早期欧洲旅行记与殖民文献中，往往是外来者对当地多样族群的概括性称呼，而非单一民族自称，因此在当代人类学或新闻语境中容易被视为不精确。","如果你是在读某篇文章或看到某个专有名词（如人名、品牌名、游戏/小说设定）“Alfuro”，可能并非这个历史族称；可以把原句发来，我可以按上下文判断意思与更合适的译法。"]}
{"word":"Alfy","summary":{"en":"Alfy is a male name, usually a nickname for Alfred (often spelled Alfie).","zh":"Alfy 是男性名字，通常是 Alfred 的昵称（常拼作 Alfie）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name, often used as a nickname for Alfred (and sometimes Alphonse); also spelled Alfie","zh":"男性名字，常用作 Alfred（有时也指 Alphonse）的昵称；也常拼作 Alfie"},"examples":[{"en":"Alfy is short for Alfred in some families.","zh":"在一些家庭里，Alfy 是 Alfred 的昵称。"},{"en":"I met a boy named Alfy at school.","zh":"我在学校遇到一个叫 Alfy 的男孩。"},{"en":"Alfy, could you help me with this homework?","zh":"Alfy，你能帮我做这份作业吗？"}]}],"synonyms":["Alfie","Alfred (full form)"],"phonetic":"/ˈælfi/","extraExplanation":["“Alfy/Alfie”在英语里更常见的拼法是 Alfie，属于比较亲切、可爱的昵称风格。","Alfred 这个名字源自古英语，常被解释为“精灵（elf）+ 忠告/智慧（counsel）”，所以很多人会把它理解为“睿智的（精灵般的）顾问”。","文化提示：在英国，“Alfie”是比较常见的男孩名/昵称；在美国也能见到，但相对没那么普遍。"]}
