{"word":"alhacena","summary":{"en":"“Alhacena” is an uncommon, older spelling referring to Alhazen (Ibn al-Haytham), a famous medieval scholar of optics.","zh":"“Alhacena”是较少见的古旧拼写，指阿尔哈曾（伊本·海赛姆），以光学研究著名的中世纪学者。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a rare or old spelling of “Alhazen,” the Latinized name of Ibn al-Haytham (965–c.1040), a major medieval scientist famous for his work on optics and vision.","zh":"“Alhazen（阿尔哈曾）”的罕见/古旧拼写形式，指伊本·海赛姆（Ibn al-Haytham，965–约1040），中世纪重要科学家，以光学与视觉研究闻名。"},"examples":[{"en":"Some older English texts spell Alhazen as Alhacena.","zh":"一些较早的英文文本会把 Alhazen 拼作 Alhacena。"},{"en":"Alhacena is associated with early theories about how humans see light and images.","zh":"Alhacena 常与早期关于人类如何看见光与影像的理论联系在一起。"}]}],"synonyms":["Alhazen","Ibn al-Haytham","Alhacen"],"phonetic":"/ˌæl.həˈsiː.nə/","extraExplanation":["“Alhacena”多见于拉丁化/古英语转写传统中；现代英语更常用 Alhazen 或直接用 Ibn al-Haytham。","伊本·海赛姆最著名的著作之一是《光学书》（Book of Optics），对后来的欧洲光学发展影响很大；数学里也有 “Alhazen’s problem（阿尔哈曾问题）”。","如果你是在天文学/星名语境看到该词，也可能是误拼；可以提供原句或截图以便确认。"]}
{"word":"Alhagi","summary":{"en":"Alhagi is a scientific genus name for thorny desert shrubs known as camelthorn.","zh":"Alhagi 是骆驼刺等带刺荒漠灌木的植物学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of thorny shrubs in the pea family (Fabaceae), often called camelthorn, found in dry regions of Eurasia and North Africa.","zh":"一种豆科（Fabaceae）带刺灌木的属名，常称“骆驼刺”，分布于欧亚及北非等干旱地区。"},"examples":[{"en":"In some deserts, Alhagi grows in salty soil where few other plants survive.","zh":"在一些沙漠里，骆驼刺（Alhagi）能在盐碱土中生长，几乎没有别的植物能存活。"},{"en":"Camels may browse on Alhagi when grass is scarce.","zh":"当草很少时，骆驼可能会啃食骆驼刺（Alhagi）。"}]}],"synonyms":["camelthorn","Alhagi maurorum"],"phonetic":"/ælˈhɑːɡaɪ/","extraExplanation":["“Alhagi”是植物学属名，常见英文俗名是 camelthorn（骆驼刺）。常被提到的种包括 Alhagi maurorum。","在一些地区，骆驼刺会分泌甜性的物质（有时被称作“manna/甘露”），因此在民俗与历史记载中偶尔出现；不过不同“manna”的来源不一，需结合具体地区与植物来源理解。","作为词汇学习提示：首字母大写的 Alhagi 多指“属名”（科学分类）；小写 alhagi 在一般写作中较少见。"]}
{"word":"alhagi","summary":{"en":"Alhagi is the botanical genus name for camelthorn, a thorny desert shrub.","zh":"Alhagi 是“骆驼刺”这类多刺荒漠灌木的植物学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of thorny shrubs (the camelthorn plants) that grow in dry regions of Eurasia and North Africa, sometimes used for fodder or traditional remedies","zh":"骆驼刺属（骆驼刺类）——生长在欧亚与北非干旱地区的多刺灌木属，有时用作饲料或传统草药"},"examples":[{"en":"In some deserts, alhagi is one of the few shrubs that can survive the heat and drought.","zh":"在一些沙漠里，骆驼刺属植物是少数能在高温干旱中存活的灌木。"},{"en":"The traveler described thorny alhagi bushes along the roadside.","zh":"那位旅人描写了路边带刺的骆驼刺灌木。"}]}],"synonyms":["camelthorn","camel-thorn"],"phonetic":"/ælˈheɪɡi/","extraExplanation":["“Alhagi”多见于植物学或博物学写作中，日常英语里不常用；更常见的俗名是“camelthorn（骆驼刺）”。","该词常作为拉丁化的属名使用（生物分类学命名），写作时一般不加冠词或复数形式也可视语境而定（如：Alhagi is…, species of Alhagi）。"]}
{"word":"Alhambra","summary":{"en":"The Alhambra is a historic palace-fortress in Granada, Spain, famous for Islamic architecture and gardens.","zh":"Alhambra（阿尔罕布拉宫）是西班牙格拉纳达的历史性宫殿要塞，以伊斯兰建筑与庭园闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a famous palace and fortress complex in Granada, Spain, built mainly by Muslim (Nasrid) rulers in the Middle Ages; known for its Islamic architecture, gardens, and intricate decoration","zh":"西班牙格拉纳达著名的宫殿与堡垒建筑群，主要由中世纪的穆斯林（纳斯里德王朝）统治者建造；以伊斯兰建筑、庭园与精美装饰闻名"},"examples":[{"en":"We visited the Alhambra and walked through its courtyards and gardens.","zh":"我们参观了阿尔罕布拉宫，走过它的庭院和花园。"},{"en":"The Alhambra is one of Spain’s most important examples of Islamic architecture.","zh":"阿尔罕布拉宫是西班牙最重要的伊斯兰建筑代表之一。"},{"en":"She read Washington Irving’s Tales of the Alhambra before her trip.","zh":"旅行前，她读了华盛顿·欧文的《阿尔罕布拉宫的故事》。"}]}],"synonyms":["palace","fortress","citadel","Islamic architecture"],"phonetic":"/ælˈhæmbrə/","extraExplanation":["词源：来自阿拉伯语“al-ḥamrāʾ（红色的）”，常被解释为“红堡/红色宫殿”，可能与建筑材料在夕阳下呈红色有关。","文化背景：阿尔罕布拉宫体现了伊比利亚半岛“安达卢斯（Al-Andalus）”时期的伊斯兰艺术与工艺（如阿拉伯书法、几何纹样、镂空石膏装饰）。","文学与英语语境：英语中常因华盛顿·欧文（Washington Irving）的《Tales of the Alhambra》而广为人知；在写作里，“the Alhambra”常用来唤起异域、历史与浪漫的意象。"]}
{"word":"alhambra","summary":{"en":"Alhambra: the famous palace-fortress in Granada, Spain; also a cultural symbol of Islamic Spain in literature and art.","zh":"Alhambra：西班牙格拉纳达著名的宫殿要塞“阿尔罕布拉宫”；在文学与艺术中也可象征“伊斯兰西班牙”的文化与历史。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A famous palace and fortress complex in Granada, Spain, built mainly under Muslim (Nasrid) rule and known for its intricate Islamic architecture, gardens, and courtyards.","zh":"（西班牙）阿尔罕布拉宫：位于格拉纳达的著名宫殿与要塞建筑群，主要在穆斯林（纳斯里德王朝）统治时期建造，以精美的伊斯兰建筑、花园与庭院闻名。"},"examples":[{"en":"The Alhambra is one of Spain’s most visited historical sites.","zh":"阿尔罕布拉宫是西班牙游客最多的历史景点之一。"},{"en":"She studied the geometric patterns in the Alhambra for her art project.","zh":"她为艺术作业研究了阿尔罕布拉宫里的几何纹样。"}]},{"partOfSpeech":"n.","definition":{"en":"A symbol in art and writing for the beauty and complexity of Islamic Spain (Al-Andalus), often linked with themes of history, cultural exchange, and the passing of time.","zh":"（文学/艺术意象）阿尔罕布拉：常用来象征“伊斯兰西班牙（安达卢斯）”的美与复杂性，并引出历史、文化交流与时光流逝等主题。"},"examples":[{"en":"In the novel, the Alhambra represents a lost world of cultures living side by side.","zh":"在小说里，阿尔罕布拉象征着一个多元文化共存却已逝去的世界。"},{"en":"His essay uses the Alhambra as a metaphor for how empires rise and fall.","zh":"他的文章用阿尔罕布拉作隐喻，说明帝国如何兴衰更替。"}]}],"synonyms":["the Alhambra Palace","Alcázar (related term)"],"phonetic":"/ælˈhɑːmbrə/","extraExplanation":["“Alhambra”来自阿拉伯语 *al-ḥamrāʾ*（意为“红色的”），常被解释为与建筑在夕阳下呈现的红色城墙有关。","英语里常会在历史、旅行与文学语境中看到它。一个著名的英文作品是华盛顿·欧文（Washington Irving）的《The Alhambra》（1832），他以游记/故事的方式描写了阿尔罕布拉宫与当地传说。"]}
{"word":"Alhambraic","summary":{"en":"An adjective meaning “of or like the Alhambra,” especially its Moorish/Islamic architectural style.","zh":"形容词：指“与阿尔罕布拉宫有关或像阿尔罕布拉宫的”，尤指其摩尔/伊斯兰建筑风格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Alhambra (the famous palace-fortress in Granada, Spain) or to its Moorish/Islamic architectural style (arches, intricate geometric patterns, carved stucco, tilework).","zh":"与西班牙格拉纳达的阿尔罕布拉宫（宫殿与堡垒）有关的；或指其摩尔/伊斯兰风格的建筑与装饰（拱门、复杂几何纹样、灰泥雕刻、彩釉瓷砖等）。"},"examples":[{"en":"The courtyard was designed with Alhambraic arches and patterned tiles.","zh":"这个庭院采用了阿尔罕布拉式的拱门和图案瓷砖。"},{"en":"Her novel describes an Alhambraic palace filled with fountains and shadowed corridors.","zh":"她的小说描写了一座阿尔罕布拉风格的宫殿，喷泉遍布，走廊幽暗。"}]}],"synonyms":["Alhambran","Moorish","Andalusian (in some contexts)"],"phonetic":"/ælˈhæm.breɪ.ɪk/","extraExplanation":["“Alhambraic”并不算高频词，常见于艺术史、建筑评论或文学描写中，用来强调“像阿尔罕布拉宫那样的审美”：精细的几何装饰、阿拉伯式书法纹样、庭院与水景（喷泉、渠水）等。","阿尔罕布拉宫（Alhambra）是安达卢西亚历史的重要象征；英语世界中，华盛顿·欧文（Washington Irving）的《The Alhambra》（1832）也让它在文学想象里更具“浪漫异域”的色彩。使用“Alhambraic”时往往带有这种审美联想。"]}
{"word":"alhambraic","summary":{"en":"“Alhambraic” means “related to the Alhambra” or “in the ornate Moorish style associated with it.”","zh":"“alhambraic”表示“与阿尔罕布拉宫有关的”，或“具有其典型华丽摩尔式装饰风格的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Alhambra palace/fortress in Granada, Spain, or to its characteristic Moorish (Islamic) architecture and decoration (e.g., intricate geometric patterns, arabesques, ornate tiles).","zh":"与西班牙格拉纳达的阿尔罕布拉宫（Alhambra）有关的；或指具有其典型的摩尔式（伊斯兰）建筑与装饰风格（如复杂几何纹样、蔓藤纹、华丽瓷砖）的。"},"examples":[{"en":"The hotel lobby has Alhambraic arches and patterned tiles that echo Andalusian design.","zh":"这家酒店大堂有阿尔罕布拉式的拱门和花纹瓷砖，呼应了安达卢西亚的设计风格。"},{"en":"She described the courtyard as Alhambraic, filled with light, water, and carved stucco.","zh":"她形容那座庭院很“阿尔罕布拉式”：充满光影、水景和精雕细刻的灰泥装饰。"}]}],"synonyms":["Alhambra-like","Moorish","Andalusian","Islamic-style","ornate"],"phonetic":"/ælˈhæmbrəɪk/","extraExplanation":["“Alhambraic”是从专有名词“Alhambra（阿尔罕布拉宫）”加形容词后缀“-ic”构成，常见于艺术史、建筑评论或文学描写中，用来唤起一种带有伊斯兰-安达卢斯气息的审美联想（精细、繁复、几何与植物纹样、庭院与水景等）。","在英语里更常见的近义表达是“Alhambra-like”或更宽泛的“Moorish / Andalusian / Islamic-style（摩尔式/安达卢西亚式/伊斯兰风格的）”。"]}
{"word":"Alhambresque","summary":{"en":"Alhambresque means “in the decorative style of the Alhambra,” featuring Moorish/Islamic-inspired arches and intricate geometric or floral patterns.","zh":"Alhambresque 指“阿尔罕布拉风格的”，常见特征是摩尔/伊斯兰启发的拱形结构与繁复的几何或花纹装饰。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of art, architecture, or decoration) in a style inspired by the Alhambra palace in Granada, Spain, especially Moorish/Islamic patterns such as arches, arabesques, geometric tilework, and intricate ornament.","zh":"（艺术、建筑或装饰）“阿尔罕布拉风格”的；受西班牙格拉纳达阿尔罕布拉宫启发的（尤指摩尔/伊斯兰式的拱门、蔓藤花纹、几何瓷砖与繁复装饰）。"},"examples":[{"en":"The café’s interior is Alhambresque, with carved arches and repeating geometric tiles.","zh":"这家咖啡馆的室内是阿尔罕布拉风格的，有雕刻拱门和重复的几何瓷砖。"},{"en":"She designed an Alhambresque screen to cast patterned shadows across the room.","zh":"她设计了一扇阿尔罕布拉风格的屏风，让房间里投下有图案的影子。"}]}],"synonyms":["Moorish-style","Moorish Revival","Islamic-inspired","arabesque","ornate"],"phonetic":"/ælˈhæm.brɛsk/","extraExplanation":["“Alhambresque”来自“Alhambra（阿尔罕布拉宫）+ -esque（……风格的）”。它通常用来形容19世纪以来在欧洲与北美流行的“摩尔复兴（Moorish Revival）”或带伊斯兰装饰意味的设计语言，如马蹄形拱（horseshoe arch）、精细灰泥纹饰、阿拉伯式蔓藤花纹（arabesque）与几何图案。","在文学与旅行写作中，这个词常带有“异域风情/浪漫化的西班牙-安达卢斯想象”的色彩；使用时更适合描述审美与装饰特征，而非指代特定宗教或族群身份。"]}
{"word":"alhambresque","summary":{"en":"“Alhambresque” means “in the decorative Moorish style of the Alhambra.”","zh":"“alhambresque”意为“阿尔罕布拉宫（摩尔/伊斯兰）装饰风格的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"in the style of the Alhambra (the famous Moorish palace in Granada, Spain); featuring Moorish/Islamic decorative patterns such as intricate geometric designs, arabesques, arches, and ornate tilework","zh":"阿尔罕布拉宫风格的；具有摩尔/伊斯兰装饰特色的（如繁复的几何图案、蔓藤花纹、拱门、华丽瓷砖等）"},"examples":[{"en":"The hotel lobby is decorated in an alhambresque style, with carved arches and patterned tiles.","zh":"这家酒店的大堂采用阿尔罕布拉宫式风格装饰，有雕刻拱门和花纹瓷砖。"},{"en":"She chose alhambresque motifs for the book cover to suggest a North African or Andalusian atmosphere.","zh":"她为书封选择了阿尔罕布拉式的图案，以营造北非或安达卢西亚的氛围。"}]}],"synonyms":["Moorish","Islamic-style","arabesque","Andalusian-style"],"phonetic":"/ælˌhɑmˈbrɛsk/","extraExplanation":["“Alhambresque”来自“The Alhambra（阿尔罕布拉宫）”。阿尔罕布拉宫以伊斯兰艺术的几何纹样、阿拉伯式蔓藤花纹（arabesque）、书法装饰与拱廊闻名，因此这个词常用于建筑、室内设计、图案与装饰艺术的描写。","在19世纪欧洲的“东方主义/异国情调”审美中，这个词也常被用来营造“安达卢西亚—摩尔式”的浪漫氛围；使用时可注意语境，避免把多元的伊斯兰文化简单当作单一的“异域风”。"]}
{"word":"alhandal","summary":{"en":"Alhandal is a rare English loanword referring to the colocynth, a very bitter desert plant, often used figuratively to mean intense bitterness.","zh":"Alhandal 是较少见的英语外来词，指药西瓜/苦葫芦这种极苦的沙漠植物，也常用作“极度苦涩”的比喻。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bitter desert plant (colocynth), whose fruit is very bitter; used in traditional medicine and as a symbol of bitterness.","zh":"一种生长在沙漠地区的苦味植物（药西瓜／苦葫芦，colocynth），果实极苦；在传统医药中有用法，也常用来象征“苦涩”。"},"examples":[{"en":"In some Arabic poems, alhandal is used to symbolize the bitterness of hardship.","zh":"在一些阿拉伯诗歌里，alhandal 常用来象征艰难生活的苦涩。"},{"en":"The traveler compared the taste of the fruit to alhandal—shockingly bitter.","zh":"那位旅行者把这种果实的味道比作 alhandal——苦得让人吃惊。"}]}],"synonyms":["colocynth","bitter apple","desert gourd"],"phonetic":"/ælˈhɑndəl/","extraExplanation":["“alhandal”常见于阿拉伯语转写（也写作 al-ḥanḍal / al-handal），通常指“colocynth（药西瓜/苦葫芦）”。在中东与北非语境里，它不仅是植物名，也常被当作“极苦、苦难”的文化意象。","英语里这个词相对少见，多出现在翻译作品、人类学/民俗/植物学资料或文学评论中；日常英语更常说 colocynth 或 bitter apple（注意 bitter apple 也可能指别的植物，需看语境）。"]}
{"word":"Alhazen","summary":{"en":"Alhazen is the Latinized name of Ibn al-Haytham, a medieval scholar famous for foundational work in optics.","zh":"Alhazen 是伊本·海什木的拉丁化名字，他是以奠基性光学研究闻名的中世纪学者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ibn al-Haytham (c. 965–1040), a famous medieval scholar from the Islamic Golden Age, best known for his work on optics and the scientific method; often called the “father of modern optics.”","zh":"伊本·海什木（约965–1040），伊斯兰黄金时代的著名学者，以光学研究和早期科学方法论闻名，常被称为“现代光学之父”。"},"examples":[{"en":"Alhazen’s experiments helped explain how light enters the eye and forms images.","zh":"阿尔哈曾的实验帮助解释了光如何进入眼睛并形成影像。"},{"en":"Many textbooks mention Alhazen when introducing the history of optics.","zh":"许多教材在介绍光学史时都会提到阿尔哈曾。"}]}],"synonyms":["Ibn al-Haytham","Ibn al-Haitham"],"phonetic":"/ælˈheɪzən/","extraExplanation":["“Alhazen”是拉丁化（西方文献常用）的名字形式，对应的阿拉伯语姓名是“Ibn al-Haytham（伊本·海什木）”。","他最著名的著作是《光学书》（Book of Optics），强调通过观察、实验来验证观点，对后来的欧洲科学发展影响很大。","在学术语境中，提到“camera obscura（暗箱）”的原理或早期视觉理论时，也常会提及他。"]}
{"word":"Alhena","summary":{"en":"Alhena is the traditional name of the star Gamma Geminorum in the constellation Gemini.","zh":"Alhena 是双子座 γ（伽马）星（γ Geminorum）的传统恒星名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A star in the constellation Gemini (γ Geminorum), traditionally called Alhena.","zh":"（天文学）双子座中的一颗恒星（γ 双子座），传统名称为 Alhena（“天樽二”）。"},"examples":[{"en":"Alhena is one of the notable stars that helps outline the constellation Gemini.","zh":"Alhena 是勾勒双子座形状的一颗显著恒星。"},{"en":"On a clear winter night, you can sometimes spot Alhena near Castor and Pollux.","zh":"在晴朗的冬夜，你有时可以在北河二（Castor）和北河三（Pollux）附近找到 Alhena。"}]}],"synonyms":["Gamma Geminorum","γ Geminorum"],"phonetic":"/ælˈhiːnə/","extraExplanation":["Alhena 是传统恒星名，多源自阿拉伯语恒星命名传统；现代天文学中它也常以“γ Geminorum（伽马双子座）”来标注。","中文里 Alhena 通常对应“双子座的‘天樽二’”（不同资料在译名细节上可能略有差异），属于恒星名称的音译/意译混用情况。"]}
{"word":"alhena","summary":{"en":"Alhena is the proper name of a bright star in Gemini, also called Gamma Geminorum.","zh":"Alhena 是双子座的一颗亮星的专名，也叫“双子座伽玛星”（Gamma Geminorum）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A bright star in the constellation Gemini; the star is also known as Gamma Geminorum.","zh":"双子座中的一颗明亮恒星；也称为“双子座伽玛星”（Gamma Geminorum）。"},"examples":[{"en":"On clear winter nights, you can try to find Alhena in the constellation Gemini.","zh":"在晴朗的冬夜，你可以试着在双子座里找到 Alhena（天樽二）。"},{"en":"Alhena is often mentioned in star charts as Gamma Geminorum.","zh":"在星图中，Alhena 常被标注为双子座伽玛星（Gamma Geminorum）。"}]}],"synonyms":["Gamma Geminorum"],"phonetic":"/ælˈhiːnə/","extraExplanation":["Alhena 是国际天文学联合会（IAU）正式采用的恒星专名之一，常用于天文观测、星图与科普写作。","词源来自阿拉伯语，传统上与“双子之一的脚（足部）”相关（不同资料的译法略有差异）。","中文常见译名为“天樽二”，属于中国古代星官体系中的命名方式；在西方星座体系中则归入双子座。"]}
{"word":"alhenna","summary":{"en":"Alhenna is an uncommon spelling of henna, the plant-based dye used for skin art and hair coloring.","zh":"Alhenna是不太常见的拼写，指henna（海娜），一种用于皮肤彩绘和染发的植物染料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a variant spelling of “al-henna” or “henna”: a reddish-brown dye made from the leaves of the henna plant, used to stain skin (especially in decorative body art) and to color hair.","zh":"“al-henna”或“henna（海娜）”的变体拼写：一种由海娜植物叶子制成的红褐色染料，用于皮肤（常见于装饰性纹身/彩绘）和染发。"},"examples":[{"en":"She used alhenna to make traditional patterns on her hands for the wedding.","zh":"她用alhenna在婚礼前在手上画了传统花纹。"},{"en":"Some natural hair dyes are made with alhenna.","zh":"有些天然染发剂是用alhenna制成的。"}]}],"synonyms":["henna","al-henna"],"phonetic":"/ælˈhɛnə/","extraExplanation":["“al-”常见于从阿拉伯语进入英语的词里，表示定冠词“the（这/那）”。“alhenna”可以理解为“the henna”的来源痕迹，但在现代英语里更常见的写法是“henna”，而“alhenna/al-henna”多见于古旧文本、音译或特定地区/作者的拼写习惯。","海娜（henna）在许多文化中用于节庆、婚礼等场合的手足彩绘（如mehndi），图案通常象征祝福、喜庆或身份仪式。使用时注意皮肤敏感与产品来源；所谓“black henna（黑海娜）”有时含有可能致敏的化学成分，应谨慎。"]}
{"word":"alhet","summary":{"en":"“Alhet” is not a standard English word; it’s likely a typo (e.g., “albeit,” “athlete,” or “alert”).","zh":"“alhet”不是标准英语单词；很可能是拼写错误（例如“albeit”“athlete”或“alert”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name/term from another language.","zh":"不是标准英语单词。更可能是拼写错误，或是来自其他语言的人名/术语。"},"examples":[{"en":"I couldn’t find “alhet” in an English dictionary—did you mean “albeit” or “athlete”?","zh":"我在英语词典里找不到“alhet”——你是不是想写“albeit”或“athlete”？"},{"en":"Please check the spelling and share the sentence where you saw “alhet.”","zh":"请检查拼写，并把你看到“alhet”的句子发我。"}]}],"phonetic":"/ælˈhɛt/","extraExplanation":["“alhet”最常见的情况是拼写误差。根据字母形状/键盘邻近，可能想写：\n- **albeit** /ɔlˈbiːɪt/（conj. 虽然；尽管）\n- **athlete** /ˈæθliːt/（n. 运动员）\n- **alert** /əˈlɝːt/（adj. 警觉的；v. 警告）\n如果你把原句贴出来，我可以更准确判断你要查的词。"]}
