{"word":"aljama","summary":{"en":"Aljama is a historical word for a Muslim or Jewish community (or its council) in medieval Spain under Christian rule.","zh":"Aljama 是历史用语，指中世纪西班牙基督教统治下的穆斯林或犹太人社群，或指代表该社群的管理议会。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(History) A legally recognized community of Muslims or Jews living under Christian rule in medieval Spain (and sometimes Portugal), often with some local self-government.","zh":"（历史）中世纪西班牙（有时也指葡萄牙）基督教统治下，获得法律承认的穆斯林或犹太人社群，通常享有一定程度的自治。"},"examples":[{"en":"The novel describes the daily life of a Jewish aljama in Castile.","zh":"这部小说描写了卡斯蒂利亚一个犹太人阿尔哈马（aljama）社群的日常生活。"},{"en":"After the conquest, the aljama negotiated taxes and protections with the crown.","zh":"征服之后，该 aljama 与王室协商税赋与保护措施。"}]},{"partOfSpeech":"n.","definition":{"en":"(History) The council or governing body representing such a community, especially in administrative or legal matters.","zh":"（历史）代表该社群处理行政或法律事务的议会／管理机构。"},"examples":[{"en":"Disputes were brought before the aljama rather than the town court.","zh":"争议会提交给 aljama（社群议会）处理，而不是交由城镇法庭。"},{"en":"Records show the aljama collected funds for communal needs.","zh":"记录显示该 aljama 为社群公共需求筹集资金。"}]}],"synonyms":["community","congregation","council","Jewish quarter (approx.)"],"phonetic":"/ælˈhɑːmə/","extraExplanation":["这个词来自西班牙语 aljama，源头与阿拉伯语定冠词 al-（“the”）有关，常见于伊比利亚半岛“收复失地运动”（Reconquista）及其后基督教王国统治时期的史料。","在历史语境里，它并不只是“街区/聚居区”，更强调“被官方承认的少数宗教社群”及其自治组织；因此翻译时可视上下文译为“社群”“会众”“社群议会/管理机构”。","常见搭配：aljama de judíos（犹太人社群）、aljama de moros（穆斯林社群）。"]}
{"word":"aljamado","summary":{"en":"Aljamiado refers to Romance-language writing (especially Spanish) written with Arabic letters, and also to the texts written that way.","zh":"Aljamiado 指用阿拉伯字母书写的罗曼语（尤指西班牙语），也可指这种写法产生的文本。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Historical) Written in Spanish or another Romance language but using the Arabic script, especially by Muslims and Moriscos in medieval and early modern Spain.","zh":"（历史）用阿拉伯字母书写的西班牙语或其他罗曼语（而不是用拉丁字母），尤指中世纪至近代早期西班牙的穆斯林与摩里斯科人所用。"},"examples":[{"en":"Some Morisco communities kept religious texts in Aljamiado to preserve their traditions.","zh":"一些摩里斯科社群用阿尔哈米亚多文献保存他们的传统。"},{"en":"The manuscript is Spanish, but it is written in Arabic letters—an Aljamiado text.","zh":"这份手稿语言是西班牙语，但用阿拉伯字母书写——属于阿尔哈米亚多文本。"}]},{"partOfSpeech":"n.","definition":{"en":"A text written in this way (a Romance-language text written with Arabic script).","zh":"用这种方式写成的文本（用阿拉伯字母书写的罗曼语文本）。"},"examples":[{"en":"Researchers digitized several Aljamiado from the 16th century.","zh":"研究人员将数份16世纪的阿尔哈米亚多文本数字化。"}]}],"synonyms":["Aljamiado text","Arabic-script Spanish"],"phonetic":"/ˌæl.həˈmiː.ɑː.doʊ/","extraExplanation":["你输入的 **aljamado** 在英语资料里更常见的拼写是 **Aljamiado**（也见 *aljamiado*）。它来自西班牙语，和阿拉伯语里表示“外语/非阿拉伯语”的词根有关，指“用阿拉伯字母写出来的西班牙语等”。","文化背景上，它常与西班牙的宗教与身份历史相关：在被迫改宗或遭压迫的时期，一些群体用这种书写方式来隐藏或保存语言与信仰内容。"]}
{"word":"aljamia","summary":{"en":"Aljamia refers to Spanish (or another Romance language) written in Arabic script, especially in historical Iberian Muslim/Morisco contexts.","zh":"Aljamia 指（尤其在伊比利亚穆斯林/莫里斯科历史语境中）用阿拉伯字母书写的西班牙语等罗曼语，或这种写法的文本。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Romance language (especially Spanish) written in Arabic script, used historically by Muslims and Moriscos in Iberia; also, a text written in this way.","zh":"（历史上伊比利亚半岛的）用阿拉伯字母书写的罗曼语（尤其是西班牙语）；也可指这种写法的文本。"},"examples":[{"en":"Some Morisco communities wrote Spanish in Arabic script; scholars call this Aljamia (or Aljamiado).","zh":"一些莫里斯科社群用阿拉伯字母书写西班牙语；学者称之为 Aljamia（或 Aljamiado）。"},{"en":"The library preserves Aljamia manuscripts that mix Islamic formulas with everyday Spanish.","zh":"图书馆保存着一些 Aljamia 手稿，其中既有伊斯兰常用语，也有日常西班牙语。"}]}],"synonyms":["Aljamiado","aljamía"],"phonetic":"/ɑlˈhɑmiə/","extraExplanation":["“Aljamia”常被视为西班牙语 aljamía 的拼写变体；英文研究中更常见的术语是 “Aljamiado（阿拉米亚多文献/书写）”。","历史背景：在中世纪到近代早期的西班牙，穆斯林与后来被迫改宗的莫里斯科人，为了在社会压力与审查中保存宗教与文化传统，常用阿拉伯字母来记录西班牙语或其他罗曼语。","词源大意可追溯到阿拉伯语中与“外族语言/非阿拉伯语”相关的表达，后来在伊比利亚语境中专指“用阿拉伯字母写本地语言”。"]}
{"word":"aljamiado","summary":{"en":"Aljamiado refers to Romance-language writing (or texts) that use the Arabic alphabet, especially from medieval/early modern Spain.","zh":"Aljamiado 指用阿拉伯字母书写罗曼语（或此类文献/手稿），尤常见于中世纪至近代早期的西班牙。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially in Spain) written in a Romance language (like Spanish) but using the Arabic alphabet; also describes such texts.","zh":"（尤指西班牙）用阿拉伯字母来书写罗曼语族语言（如西班牙语）的；也可指这类文字/文献。"},"examples":[{"en":"Scholars study aljamiado manuscripts to understand how Moriscos preserved their language and faith.","zh":"学者研究 aljamiado 手稿，以了解穆德哈尔后裔/摩里斯科人如何保存语言与信仰。"},{"en":"The poem survives in an aljamiado version written with Arabic letters.","zh":"这首诗以 aljamiado 版本流传下来，用阿拉伯字母书写。"}]},{"partOfSpeech":"n.","definition":{"en":"a text or manuscript written in a Romance language but in the Arabic script (often from medieval or early modern Spain).","zh":"（常见于中世纪至近代早期西班牙的）用阿拉伯字母书写的罗曼语文本/手稿。"},"examples":[{"en":"The archive holds several aljamiados from the sixteenth century.","zh":"该档案馆保存着几份16世纪的 aljamiado 文献。"},{"en":"Reading an aljamiado can be difficult if you don’t know the Arabic script conventions used for Spanish sounds.","zh":"如果不了解用阿拉伯字母记录西班牙语语音的写法规则，阅读 aljamiado 会很困难。"}]}],"synonyms":["Arabic-script Romance texts","Morisco writings (context-specific)","aljamía (related term)"],"phonetic":"/ˌæl.həˈmiː.ɑː.doʊ/","extraExplanation":["“Aljamiado”常与西班牙历史中的穆德哈尔人（Mudéjars）与摩里斯科人（Moriscos）相关：在基督教统治下的穆斯林/改宗者群体，有时会用阿拉伯字母记录西班牙语或其他罗曼语，以便在社会压力或审查环境下保存宗教与文化传统。","词源上来自西班牙语 aljamiado，进一步与阿拉伯语中表示“外来/非阿拉伯语言”的词根相关（常见解释与 ʿajam/ʿajamī 一类词有关）。在英语学术写作中多见于历史学、语言学与手稿研究语境。"]}
{"word":"aljamiah","summary":{"en":"Aljamiah is a transliteration from Arabic meaning “(the) university,” often used in names.","zh":"Aljamiah源自阿拉伯语的音译，意为“（这所）大学”，常见于名称中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(loanword from Arabic) a university; an institution of higher education.","zh":"（源自阿拉伯语的外来词）大学；高等教育机构。"},"examples":[{"en":"She studied Arabic at aljamiah in Cairo.","zh":"她在开罗的一所aljamiah（大学）学习阿拉伯语。"},{"en":"The program partners with a local aljamiah to train teachers.","zh":"该项目与当地一所aljamiah（大学）合作培训教师。"}]},{"partOfSpeech":"other","definition":{"en":"(proper noun) part of the name of an organization, school, or publication meaning “the university.”","zh":"（专有名词）用于机构、学校或刊物名称的一部分，意为“大学”。"},"examples":[{"en":"He works at Aljamiah Press.","zh":"他在Aljamiah出版社工作。"},{"en":"Aljamiah University announced new scholarships.","zh":"Aljamiah大学宣布了新的奖学金项目。"}]}],"synonyms":["university","college"],"phonetic":"/ˌæl dʒəˈmiːə/","extraExplanation":["“aljamiah”多见于把阿拉伯语“الجامعة（al-jāmiʿa）”音译成拉丁字母的写法之一，字面意思常被理解为“（这所）大学”。不同地区/机构可能拼作al-jami‘ah、aljami'a、aljamia等，属于转写差异。","在英语语境中它并不是常用普通词，更常作为校名、社团名或刊物名出现；如果你能提供上下文（句子/国家/机构名称），释义可以更精准。"]}
{"word":"aljoba","summary":{"en":"“Aljoba” isn’t a common English word; it’s likely a name or a misspelling.","zh":"“aljoba”不是常见英语词；更可能是专有名词或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is most likely a proper name (e.g., a place, brand, or surname) or a misspelling of a similar word.","zh":"不是常见英语词典里的标准词；更可能是专有名词（地名、品牌、姓氏等）或与其他相近拼写的词混淆/拼错。"},"examples":[{"en":"I couldn’t find “aljoba” in an English dictionary—could it be a name or a typo?","zh":"我在英语词典里找不到“aljoba”——它会不会是名字或拼写错误？"},{"en":"If you tell me where you saw “aljoba” (a book, a game, a label), I can help identify it.","zh":"如果你告诉我“aljoba”出现在哪里（书里、游戏里、标签上），我可以帮你确认它的意思。"}]}],"phonetic":"/ælˈdʒoʊbə/","extraExplanation":["“aljoba”很可能与西班牙语/阿拉伯语来源的词形混淆有关。常见的相近词包括：\n- aljaba（西语：箭袋/quiver）\n- aljuba/aljube（在不同地区可能指一种衣物或旧称的事物）\n如果你把原句发来，或说明语言与上下文，我可以更准确判断。"]}
{"word":"aljofaina","summary":{"en":"An uncommon word meaning a washbasin/large bowl, often in Spanish or historical settings.","zh":"一个较少见的词，指洗脸盆/大碗，常用于西班牙或历史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a washbasin or large bowl (often a metal basin), especially in Spanish or historical contexts.","zh":"（多指金属的）洗脸盆／大碗；常见于西班牙语或历史语境中。"},"examples":[{"en":"In the old story, the traveler rinsed his hands in an aljofaina.","zh":"在那个古老的故事里，旅人用一个aljofaina洗了手。"},{"en":"The barber set an aljofaina on the table to catch water.","zh":"理发师把一个aljofaina放在桌上，用来接水。"}]}],"synonyms":["basin","washbowl","washbasin","barber’s basin","bowl"],"phonetic":"/ˌælhoʊfaɪˈiːnə/","extraExplanation":["这个词在英语里非常少见，多半出现在翻译作品、历史/文学描写或讨论西班牙文化用品时。","词源一般认为来自西班牙语 aljofaina，更早可追溯到阿拉伯语来源；它常被用来指“理发师用的盆”或“洗漱用的盆”。","在《堂吉诃德》（Don Quixote）的相关文化语境中，人们常提到“理发师的盆”（barber’s basin）；有些英文讨论或译文里会用到 aljofaina 来强调原文风味。"]}
