{"word":"alk","summary":{"en":"“alk” is usually an abbreviation in science/technical contexts (often alkaline, alcohol, or alkyl).","zh":"“alk”通常是科学/技术语境中的缩写（常指碱性、酒精或烷基）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) alkaline; used in chemistry to describe something basic (not acidic).","zh":"（缩写）alkaline（碱性的）；在化学中指“呈碱性、非酸性”的。"},"examples":[{"en":"The label says the solution is alk, so don’t mix it with acids.","zh":"标签上写着溶液是 alk（碱性的），所以不要和酸混合。"},{"en":"Add water until the mixture becomes slightly alk.","zh":"加水直到混合物变得略微呈碱性（alk）。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) alcohol; used in lab notes or informal technical writing.","zh":"（缩写）alcohol（酒精）；常见于实验记录或较随意的技术写作中。"},"examples":[{"en":"Clean the surface with alk before testing.","zh":"测试前用酒精（alk）清洁表面。"},{"en":"Store the sample in alk to prevent contamination.","zh":"把样品保存在酒精（alk）中以防污染。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) alkyl; used in organic chemistry for a group like methyl or ethyl.","zh":"（缩写）alkyl（烷基）；有机化学中指如甲基、乙基等取代基。"},"examples":[{"en":"The diagram shows an alk group attached to the ring.","zh":"图中显示环上连接了一个烷基（alk）基团。"},{"en":"Replace the alk chain to change the compound’s properties.","zh":"更换烷基（alk）链可以改变化合物的性质。"}]}],"synonyms":["alkaline (abbr.)","alcohol (abbr.)","alkyl (abbr.)"],"phonetic":"/ælk/","extraExplanation":["“alk”不是日常英语里常用的独立单词，更多是专业或笔记式缩写。不同学科/团队写法可能不同：化学里常见指 alkaline 或 alkyl；有些实验记录里也会用来简写 alcohol。正式写作中通常建议直接写全称（alkaline / alcohol / alkyl），避免歧义。"]}
{"word":"Alka-Seltzer","summary":{"en":"Alka-Seltzer is a well-known brand of effervescent tablets you dissolve in water to ease indigestion/heartburn (and some versions help with cold symptoms).","zh":"Alka-Seltzer 是一种知名泡腾片品牌，通常溶于水后饮用，用于缓解消化不良/胃灼热（部分版本也用于缓解感冒症状）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand of effervescent tablets dissolved in water to relieve indigestion, heartburn, or upset stomach; sometimes also used for cold/flu symptoms (depending on the product).","zh":"“Alka-Seltzer（阿尔卡舒尔特）”是一种泡腾片品牌，通常溶于水后饮用，用于缓解消化不良、胃灼热或胃部不适；部分系列产品也用于缓解感冒/流感症状（视具体配方而定）。"},"examples":[{"en":"I took an Alka-Seltzer after a heavy meal, and my stomach felt better.","zh":"大吃一顿后我吃了一片 Alka-Seltzer，胃舒服多了。"},{"en":"Dissolve the tablet in a glass of water before drinking it.","zh":"先把药片溶在一杯水里再喝。"},{"en":"Do you have any Alka-Seltzer for heartburn?","zh":"你有治胃灼热的 Alka-Seltzer 吗？"}]}],"synonyms":["antacid","effervescent tablet","bicarbonate tablet"],"phonetic":"/ˌæl.kəˈsɛltsɚ/","extraExplanation":["在美国文化里，Alka-Seltzer 作为“泡腾片+水”的典型形象很深入人心，常出现在影视或日常对话中，带有“临时缓解胃不舒服”的联想。","严格来说它是商标名，但口语中有时会被泛指“泡腾的胃药/解酸药”。购买或使用时要看具体配方：有的主打胃酸，有的主打感冒症状；不同配方的成分（如阿司匹林等）可能有禁忌，按说明使用更安全。"]}
{"word":"Alkabo","summary":{"en":"“Alkabo” is not a common English word; it’s most likely a proper name, and the meaning depends on where you saw it.","zh":"“Alkabo”不是常见英语词汇；更可能是专有名词，含义要看你在哪里看到它。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (e.g., a surname, brand, or place name). It is not a standard English vocabulary word, so its meaning depends on context.","zh":"专有名词（如姓氏、品牌名或地名）。它不是标准英语词汇，因此含义取决于具体语境。"},"examples":[{"en":"I saw the name “Alkabo” on a sign, but I’m not sure what it refers to.","zh":"我在一个标牌上看到“Alkabo”这个名字，但不确定它指什么。"},{"en":"Alkabo is listed as a username in the chat.","zh":"聊天里“Alkabo”被列为一个用户名。"}]}],"phonetic":"/ælˈkɑːboʊ/","extraExplanation":["“Alkabo”在常见英语词典中通常找不到，可能是人名/地名/品牌名，也可能是外来语或拼写变体。","如果你原本想写的是西班牙语“al cabo”（分开写），它常表示“最终、到头来（in the end）”。如果你告诉我句子或出处（在哪看到的、属于哪种语言/地区），我可以更准确解释。"]}
{"word":"alkahest","summary":{"en":"An alkahest is a legendary alchemical universal solvent; figuratively, it can mean a perfect all-problems solution.","zh":"alkahest 指炼金术里传说的“万能溶剂”；引申可指能解决一切问题的“终极办法”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In alchemy) a legendary “universal solvent” believed to be able to dissolve or purify any substance.","zh":"（炼金术中）传说中的“万能溶剂”，据说可以溶解或净化任何物质。"},"examples":[{"en":"Alchemists searched for the alkahest, a solvent said to dissolve everything.","zh":"炼金术士寻找“alkahest”，一种据说能溶解万物的溶剂。"},{"en":"In the novel, the scientist treats the alkahest as a symbol of perfect transformation.","zh":"在小说里，科学家把“alkahest”当作完美蜕变的象征。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, literary) something imagined as a perfect solution that removes all obstacles or problems.","zh":"（引申义，文学/修辞）被想象成能解决一切问题的“终极办法”。"},"examples":[{"en":"There is no alkahest for loneliness; it takes time and connection.","zh":"孤独没有什么“万能溶剂”；它需要时间和联结。"},{"en":"People often look for an alkahest—one trick that will fix everything at work.","zh":"人们常常想找一种“万能灵药”——一个招数就能解决工作中的所有问题。"}]}],"synonyms":["universal solvent","panacea","cure-all","elixir"],"phonetic":"ˈæl.kə.hɛst","extraExplanation":["“alkahest”来自炼金术传统，常与17世纪佛兰德化学家/炼金术士 Jan Baptist van Helmont 相关；他把它描述为能把一切物质“还原/分解到最根本状态”的溶剂。这一概念也受到阿拉伯炼金术词汇影响，常被认为含有类似“碱（alkali）”的语感，但它并不是现代化学里的真实物质。","在文学与幻想作品中，“alkahest”常被用作象征：对绝对知识、彻底净化或彻底改变的渴望；也可用来讽刺人们追求“一招解决一切”的心理。"]}
{"word":"alkahestic","summary":{"en":"Alkahestic means related to the alchemical \"alkahest\"—a mythical universal solvent—or having a supposed all-dissolving power.","zh":"Alkahestic 指与炼金术中的“万溶剂（alkahest）”有关，或（传说中）具有能溶解万物的力量。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an \"alkahest\" (a legendary universal solvent in alchemy), or having the supposed power to dissolve anything.","zh":"与“万溶剂/万能溶剂（alkahest，炼金术中传说能溶解万物的溶剂）”有关的；（传说中）具有能溶解一切的力量的。"},"examples":[{"en":"In old alchemical texts, the alkahestic solvent was said to dissolve all substances.","zh":"在早期炼金术文献中，据说这种“alkahestic（万溶剂的）”溶剂能溶解一切物质。"},{"en":"The novel describes an alkahestic liquid that melts metal and stone alike.","zh":"小说描写了一种“alkahestic（能溶万物的）”液体，连金属和石头都能融化。"}]}],"synonyms":["alchemical","all-dissolving (figurative)","universal-solvent (figurative)"],"phonetic":"/ˌæl.kəˈhɛs.tɪk/","extraExplanation":["“Alkahest（万溶剂）”是欧洲炼金术传统里的概念，常与帕拉塞尔苏斯（Paracelsus）及其后继炼金术士的思想联系在一起：他们设想存在一种能把任何物质还原到最基本形态的溶剂。“alkahestic”就是形容这种传说中的“万能溶解力”。","现代科学里并不存在真正意义上的“万能溶剂”。因此在当代写作中，alkahestic 常见于文学、奇幻、哲学或比喻性表达（如“能化解一切矛盾的办法”）。"]}
{"word":"alkahestica","summary":{"en":"Alkahestica is a rare word meaning “alkahest-related,” referring to the mythical alchemical universal solvent.","zh":"Alkahestica 是个罕见词，意思是“与万能溶剂（炼金术传说中的 universal solvent）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Relating to an “alkahest,” a legendary universal solvent in alchemy said to dissolve anything.","zh":"（罕见）与“万能溶剂（alkahest）”有关的；指炼金术中传说能溶解万物的溶剂。"},"examples":[{"en":"In old alchemical notes, an alkahestica liquid is described as able to dissolve any substance.","zh":"在古老的炼金术笔记里，一种被称为 alkahestica 的液体被描述为能溶解任何物质。"},{"en":"The story mentions an alkahestica solvent, but modern chemistry treats it as myth rather than fact.","zh":"故事里提到一种 alkahestica 溶剂，但现代化学更倾向把它视为神话而非事实。"}]},{"partOfSpeech":"other","definition":{"en":"A very rare learned/Latin-style form used to refer to writings or ideas about the alkahest (the “universal solvent”).","zh":"一种非常少见的学术/拉丁化用法，用来指与“万能溶剂（alkahest）”相关的论述或观念。"},"examples":[{"en":"The author grouped several alkahestica passages together in an appendix on alchemy.","zh":"作者在关于炼金术的附录里把几段 alkahestica 相关的文字归在一起。"}]}],"synonyms":["alkahestic","alchemical (contextual)"],"phonetic":"/ˌæl.kəˈhɛs.tɪ.kə/","extraExplanation":["“alkahestica”非常罕见；在英语里更常见的是形容词 **alkahestic**（与万能溶剂有关的）以及名词 **alkahest**（万能溶剂）。","“alkahest”常被认为来自阿拉伯语词源（常写作 *al-* + *kahest* 的形式），并在16–17世纪的欧洲炼金术传统中流行（常与帕拉塞尔苏斯 Paracelsus 的炼金/医化思想一起被提及）。"]}
{"word":"alkahestical","summary":{"en":"Alkahestical means “related to the legendary universal solvent (alkahest) in alchemy.”","zh":"alkahestical 指“与炼金术中传说的万能溶剂（alkahest）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an alkahest (a legendary “universal solvent” in alchemy said to dissolve any substance).","zh":"与“万能溶剂”（炼金术中传说可溶解一切物质的溶剂，alkahest）有关的；万能溶剂的（多见于古旧或文学用语）。"},"examples":[{"en":"The story describes an alkahestical liquid that could melt gold and stone alike.","zh":"故事描写了一种“万能溶剂”般的液体，连黄金和石头都能溶解。"},{"en":"In old alchemical writings, alkahestical powers were often exaggerated to symbolize perfect purification.","zh":"在旧时炼金术著作里，“万能溶剂”的力量常被夸张，用来象征彻底的净化。"}]}],"synonyms":["alchemical","universal-solvent (figurative)","dissolving (figurative)"],"phonetic":"/ˌæl.kəˈhɛs.tɪ.kəl/","extraExplanation":["“alkahest”一词出自炼金术传统，常与16–17世纪欧洲的炼金术思想相关；它指一种传说中的“普遍溶剂”，更多是象征概念而非现代化学中的真实物质。","“alkahestical”在现代英语中非常罕见，多用于文学、历史或神秘学/炼金术语境；日常表达更常用“universal solvent-like（像万能溶剂一样的）”之类说法。"]}
{"word":"alkahests","summary":{"en":"Alkahests are legendary universal solvents in alchemy (plural of alkahest).","zh":"Alkahests 指炼金术传说中的“万能溶剂”（alkahest 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of alkahest) A legendary “universal solvent” in alchemy—an imagined liquid said to be able to dissolve any substance.","zh":"（alkahest 的复数）炼金术中的“万能溶剂”；传说中一种能溶解任何物质的液体。"},"examples":[{"en":"In old alchemical writings, alkahests were described as solvents that could dissolve even the hardest metals.","zh":"在古老的炼金术著作中，alkahests 被描述为甚至能溶解最坚硬金属的溶剂。"},{"en":"The novel uses the word alkahests to suggest a magical force that breaks everything down to its simplest form.","zh":"这部小说用 alkahests 来暗示一种能把万物分解到最简单形态的魔力。"}]}],"synonyms":["universal solvent (legendary)","alchemical solvent"],"phonetic":"/ˈæl.kə.hɛsts/","extraExplanation":["“Alkahest”多见于欧洲炼金术传统，常与“寻找能分解万物的终极溶剂”这一思想相关；它更多是象征性的概念，而不是现代化学中真实存在的物质。","词源常被认为与阿拉伯语定冠词“al-”有关，体现了中世纪欧洲炼金术受阿拉伯科学与术语影响的历史背景。"]}
{"word":"Alkaid","summary":{"en":"Alkaid is the bright star at the end of the Big Dipper’s handle (Eta Ursae Majoris).","zh":"Alkaid 是北斗七星斗柄末端的一颗亮星（大熊座η，Eta Ursae Majoris）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Alkaid: a bright star at the end of the Big Dipper’s handle (in the constellation Ursa Major); its official star designation is Eta Ursae Majoris.","zh":"Alkaid（天枢右/玉衡右一，常译“开阳”一带的端星；更常见为“北斗七星斗柄末端那颗亮星”）：位于大熊座（Ursa Major）北斗七星斗柄末端的一颗亮星；其恒星编号为大熊座η（Eta Ursae Majoris）。"},"examples":[{"en":"On a clear night, you can find Alkaid at the tip of the Big Dipper’s handle.","zh":"在晴朗的夜晚，你可以在北斗七星斗柄的末端找到 Alkaid。"},{"en":"Alkaid is part of the well-known asterism called the Big Dipper.","zh":"Alkaid 属于著名的“北斗七星”（Big Dipper）这个星群。"}]}],"synonyms":["Eta Ursae Majoris","Benetnash"],"phonetic":"/ælˈkeɪd/","extraExplanation":["“Alkaid”来自阿拉伯语词源（与“领袖/首领”一类含义有关），许多亮星的英文名都保留了阿拉伯天文学传统的影响。","在天文学中，北斗七星是“大熊座的一部分”（星群/构形，asterism），并不是一个独立星座；Alkaid 是斗柄末端的那颗星。","Alkaid 也常见别名 Benetnash（或写作 Benetnasch），在不同星图和资料中可能会遇到。"]}
{"word":"alkaid","summary":{"en":"Alkaid is a star name: the bright star at the end of the Big Dipper’s handle (Ursa Major).","zh":"Alkaid 是一颗恒星的名字：北斗七星斗柄末端的亮星（大熊座）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bright star at the end of the Big Dipper’s handle (in the constellation Ursa Major); its official star name is Alkaid (also known as Eta Ursae Majoris).","zh":"（天文学）北斗七星“斗柄”末端的一颗亮星，位于大熊座；其正式星名为 Alkaid（也称大熊座η）。"},"examples":[{"en":"On clear nights, you can trace the Big Dipper’s handle to Alkaid at the tip.","zh":"在晴朗的夜晚，你可以沿着北斗七星的斗柄找到末端的 Alkaid。"},{"en":"Alkaid is not the North Star, but it helps you recognize the Big Dipper’s shape.","zh":"Alkaid 不是北极星，但它能帮助你辨认北斗的形状。"}]}],"synonyms":["Eta Ursae Majoris","Benetnash"],"phonetic":"/ælˈkeɪd/","extraExplanation":["Alkaid 这个名字源自阿拉伯语，常被解释为“领袖/首领（the leader）”之类的含义；在英语里它通常作为专有名词（星名）使用，首字母大写。","在现代天文学命名中，Alkaid 的拜耳命名是 Eta Ursae Majoris（大熊座η）。在一些资料里你也会看到它的传统别名 Benetnash。"]}
{"word":"alkalamide","summary":{"en":"“Alkalamide” is a rare chemistry term for an alkyl/alkanamide (a compound containing an amide group attached to an alkyl chain).","zh":"“Alkalamide”是较少见的化学用语，通常指烷基/烷酰胺（酰胺基连接在烷基链上的化合物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) An amide derived from an alkane (or alkyl group)—a nitrogen-containing organic compound with the amide group (–CONH2, –CONHR, or –CONR2) attached to an alkyl chain. This term is rare in everyday English and is often replaced by “alkanamide” or “alkylamide.”","zh":"（化学）由烷烃（或烷基）衍生的酰胺类化合物——含有酰胺基（–CONH2、–CONHR 或 –CONR2）并连接在烷基链上的含氮有机物。该词在日常英语中较少见，常用“alkanamide（烷酰胺）”或“alkylamide（烷基酰胺）”替代。"},"examples":[{"en":"In the lab report, the product was identified as an alkalamide based on its amide peak in the IR spectrum.","zh":"在实验报告中，根据红外光谱中的酰胺特征峰，产物被鉴定为一种烷基酰胺（alkalamide）。"},{"en":"Some industrial surfactants are made from fatty alkalamides to improve foaming and thickening.","zh":"一些工业表面活性剂会使用脂肪族烷基酰胺（alkalamides）来增强起泡性和增稠效果。"}]}],"synonyms":["alkanamide","alkylamide","fatty amide","amide"],"phonetic":"/ˌæl.kəˈlæ.maɪd/","extraExplanation":["“alkalamide”不是特别规范或高频的标准术语；在化学命名里更常见的是“alkanamide”（如 ethanamide = acetamide）或“alkylamide”。如果你是在配方/表活资料里看到它，它可能指“脂肪酸酰胺类（fatty amides）”，例如由脂肪酸与胺反应得到的酰胺，用于增稠、稳泡等。","词形可拆解为 alk-（与烷基/烃链有关）+ amide（酰胺）。如果你能提供出现它的句子或化学式，我可以更准确判断它在那份文本中的具体所指。"]}
{"word":"alkalemia","summary":{"en":"Alkalemia is an abnormally high blood pH (blood that is too alkaline).","zh":"Alkalemia 指血液 pH 异常升高、血液过于偏碱的状态（碱血症）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical condition in which the blood is too alkaline (the blood pH is higher than normal).","zh":"（医学）碱血症；指血液过于偏碱（血液 pH 高于正常范围）的状态。"},"examples":[{"en":"The doctor diagnosed alkalemia after a blood gas test showed a high pH.","zh":"医生在血气检查发现 pH 偏高后，诊断为碱血症。"},{"en":"Alkalemia can happen when you breathe too fast or lose too much stomach acid from vomiting.","zh":"过度呼吸或因呕吐丢失过多胃酸，都可能导致碱血症。"}]}],"synonyms":["high blood pH","alkaline blood"],"phonetic":"/ˌæl.kəˈliː.mi.ə/","extraExplanation":["“alkalemia”常用于临床检验与病历记录，通常指动脉血 pH > 7.45 的状态。它描述的是“血液偏碱”这一结果；而“alkalosis（碱中毒）”更常指导致血液变碱的生理过程（例如呼吸性或代谢性）。","常见相关原因包括：呼吸性（过度通气导致二氧化碳下降）、代谢性（呕吐/胃管引流导致酸丢失、利尿剂使用、低钾等）。严重时可能出现头晕、手脚麻木、肌肉抽搐等，需要根据病因处理。"]}
{"word":"alkalescence","summary":{"en":"Alkalescence means becoming more alkaline (pH rising)—an increase in alkalinity.","zh":"Alkalescence 指“逐渐变得更碱性（pH 上升）”，即碱性增强的过程或状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process or condition of becoming alkaline (having a higher pH); increasing alkalinity","zh":"变成碱性的过程或状态；碱性增强（pH 升高）"},"examples":[{"en":"During fermentation, the liquid showed slight alkalescence as acids were used up.","zh":"在发酵过程中，随着酸被消耗，这种液体出现了轻微的碱化（碱性增强）。"},{"en":"The lab report recorded alkalescence after the base was added drop by drop.","zh":"实验报告记录到在一滴一滴加入碱之后出现了碱化现象。"}]}],"synonyms":["increasing alkalinity","alkalinization","basification"],"phonetic":"/ˌæl.kəˈlɛs.əns/","extraExplanation":["“alkalescence”多用于化学/生物学语境，强调“正在变得更碱性”的变化过程；如果只是描述“碱性程度本身”，更常用的是“alkalinity（碱度/碱性）”。","词形上可与“alkalescent（adj. 正在变得碱性的）”“alkali（n. 碱）”联系记忆；写作时常与 pH、acid/base（酸/碱）等概念搭配。"]}
{"word":"alkalescency","summary":{"en":"Alkalescency means alkalinity—the state or tendency of being alkaline.","zh":"alkalescency 指“碱性/碱度”，也可指“变碱的趋势（碱化）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being alkaline; alkalinity (the ability of a substance or solution to neutralize acid).","zh":"碱性；碱度（物质或溶液中和酸的能力）。"},"examples":[{"en":"The water’s alkalescency increased after limestone dissolved into it.","zh":"石灰岩溶解进入水中后，水的碱性增强了。"},{"en":"In chemistry class, we measured alkalescency by checking how much acid the solution could neutralize.","zh":"在化学课上，我们通过检测溶液能中和多少酸来测量其碱度。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a tendency to become alkaline; the process of turning alkaline.","zh":"（较少见）变成碱性的倾向；碱化过程。"},"examples":[{"en":"The soil showed alkalescency over time due to irrigation with mineral-rich water.","zh":"由于使用富含矿物质的水灌溉，土壤随着时间推移呈现出碱化趋势。"}]}],"synonyms":["alkalinity","alkaline nature","basicity"],"phonetic":"/ˌæl.kəˈlɛ.sən.si/","extraExplanation":["“alkalescency”是较少使用的学术词，更常见的对应词是“alkalinity（碱度）”或“alkaline nature（碱性）”。","词源上与“alkali（碱）”有关；在环境科学/土壤学/水质分析里，有时会用它来强调“呈碱性”或“变得更碱”的性质或趋势。","日常表达里通常说：The water is alkaline. / The soil has high alkalinity（这片土壤碱度高）。"]}
{"word":"alkalescent","summary":{"en":"Alkalescent means “becoming alkaline” or “slightly alkaline,” mainly used in scientific contexts.","zh":"alkalescent 指“趋于碱性/正在变碱”或“微碱性”，主要用于科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Becoming alkaline; tending to turn something into an alkali (higher pH).","zh":"（化学）呈碱性趋势的；会变成碱性的；使环境趋向碱性（pH 升高）的。"},"examples":[{"en":"As the algae grew, the lake water became alkalescent.","zh":"随着藻类生长，湖水逐渐呈碱性趋势。"},{"en":"The soil is alkalescent after repeated liming.","zh":"反复施用石灰后，土壤开始趋于碱性。"}]},{"partOfSpeech":"adj.","definition":{"en":"Slightly alkaline; mildly basic in reaction.","zh":"微碱性的；略呈碱性反应的。"},"examples":[{"en":"This spring has an alkalescent taste because of dissolved minerals.","zh":"这处泉水因溶解矿物质而带有微碱性的味道。"},{"en":"An alkalescent solution may reduce acidity in the mixture.","zh":"微碱性的溶液可能会降低混合物的酸度。"}]}],"synonyms":["alkaline","becoming alkaline","mildly basic","slightly basic"],"phonetic":"/ˌæl.kəˈlɛs.ənt/","extraExplanation":["“alkalescent”较少见，多用于化学、地质、环境科学等语境；日常英语里更常说“alkaline”（碱性的）或“becoming alkaline”（正在变碱）。","词源上与“alkali（碱）”同源，后缀“-escent”表示“开始……、渐渐变得……”，类似：“effervescent（起泡的/冒泡的）”“phosphorescent（发磷光的）”。"]}
{"word":"alkali","summary":{"en":"An alkali is a basic (not acidic) substance that can neutralize acids; it can also describe something that is basic.","zh":"alkali 指能中和酸的碱性物质，也可形容“碱性的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance (such as a base) that can neutralize acid and often dissolves in water to make a solution with a pH greater than 7","zh":"碱性物质（如碱），能中和酸；常可溶于水形成 pH 大于 7 的溶液"},"examples":[{"en":"Baking soda is a mild alkali that can help neutralize stomach acid.","zh":"小苏打是一种温和的碱性物质，可以帮助中和胃酸。"},{"en":"Soap is made using an alkali and fats or oils.","zh":"肥皂是用碱和脂肪或油脂制成的。"},{"en":"If the pool water is too acidic, you may need to add an alkali.","zh":"如果泳池水太酸，可能需要加入碱性物质。"}]},{"partOfSpeech":"adj.","definition":{"en":"having the chemical properties of an alkali; basic (not acidic)","zh":"碱性的；呈碱性质的（非酸性的）"},"examples":[{"en":"Some plants grow best in alkali soil rather than acidic soil.","zh":"有些植物在碱性土壤中比在酸性土壤中长得更好。"},{"en":"The product is designed to work in alkali conditions.","zh":"该产品被设计用于碱性条件下。"}]}],"synonyms":["base","alkaline substance","caustic (for strong alkalis in some contexts)"],"phonetic":"/ˈæl.kəˌlaɪ/","extraExplanation":["“alkali”常用于科学与日常生活：如清洁用品（肥皂、洗涤剂）、烘焙（baking soda 小苏打）、水处理（泳池/自来水调节 pH）。","在化学里，“alkali”有时更具体地指“碱金属（alkali metals）”的相关化合物；但日常英语里更常泛指“碱性物质/碱”。注意与“alkaline（碱性的）”的词形变化：alkaline 通常更常见作形容词。"]}
{"word":"alkalic","summary":{"en":"Alkalic means alkaline or basic (not acidic), but it is a rare word; alkaline is more common.","zh":"alkalic 意为“碱性的/偏碱的（非酸性）”，但较少用；更常见的说法是 alkaline。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) alkaline; having the nature of an alkali (basic rather than acidic).","zh":"（较少用）碱性的；具有碱（与酸相对）的性质。"},"examples":[{"en":"Some desert soils are alkalic and can be hard for crops to grow in.","zh":"一些沙漠土壤呈碱性，农作物可能不易生长。"},{"en":"The lake water became more alkalic after minerals washed in.","zh":"矿物质被冲入后，湖水变得更偏碱性。"}]}],"synonyms":["alkaline","basic"],"phonetic":"/ælˈkælɪk/","extraExplanation":["“alkalic”在现代英语中比较少见，更常用的是“alkaline”。两者意思基本相同，都是“碱性的”。","词根来自“alkali（碱）”。在科学或环保话题里，你更常看到“alkaline soil / alkaline water（碱性土壤/碱性水）”。"]}
{"word":"alkalies","summary":{"en":"“Alkalies” means “alkalis,” the plural of “alkali” (basic substances). It’s an older/less common spelling today.","zh":"“alkalies”相当于“alkalis”，是“alkali（碱）”的复数，属于较旧/较少见的拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “alkali”: basic (not acidic) substances, often used in chemistry and in products like soap or cleaning solutions.","zh":"“alkali”的复数：碱性物质（非酸性），常见于化学与肥皂、清洁剂等产品中。"},"examples":[{"en":"Strong alkalies can irritate your skin, so wear gloves when cleaning.","zh":"强碱可能刺激皮肤，所以清洁时要戴手套。"},{"en":"The lab stored acids and alkalies in separate cabinets.","zh":"实验室把酸和碱分别存放在不同的柜子里。"},{"en":"This soil has too many alkalies, so some plants won’t grow well.","zh":"这片土壤碱性物质太多，所以有些植物长不好。"}]},{"partOfSpeech":"n.","definition":{"en":"An older or less common spelling of “alkalis” (same meaning).","zh":"“alkalis”的较旧或较不常见拼写（意思相同）。"},"examples":[{"en":"In older texts you may see the spelling “alkalies.”","zh":"在较旧的文本中你可能会看到拼写“alkalies”。"}]}],"synonyms":["alkalis","bases"],"phonetic":"/ˈæl.kə.laɪz/","extraExplanation":["“alkalies”在现代英语里相对少见，更常用的复数是“alkalis”。在一些较早的英美出版物或旧式拼写体系中会看到“alkalies”。","化学里“alkali/alkalis”常用来泛指“碱”，尤其是能在水中形成碱性溶液的物质；但严格来说，“alkali metals（碱金属）”是元素类别（如钠、钾），不要和一般意义的“alkali（碱性物质）”混淆。"]}
{"word":"alkaliferous","summary":{"en":"Alkaliferous means containing or producing alkali, usually in scientific contexts (soils, rocks, water).","zh":"alkaliferous 指“含碱的/产碱的”，多用于土壤、岩石、水等科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing alkali (alkaline substances), or producing alkali; often used in geology or soil science.","zh":"含有碱性物质的；产碱的（常用于地质、土壤等语境）。"},"examples":[{"en":"The region has alkaliferous soils, so only certain crops grow well there.","zh":"这个地区的土壤含碱，因此只有某些作物在这里长得好。"},{"en":"Scientists tested the spring water and found it was mildly alkaliferous.","zh":"科学家检测了泉水，发现它具有轻微的含碱特性。"}]}],"synonyms":["alkaline","alkali-bearing","alkali-rich"],"phonetic":"/ˌæl.kəˈlɪf.ɚ.əs/","extraExplanation":["这个词比较少见，常见于学术或技术写作（如地质、矿物、土壤、地下水报告）。日常英语里更常用的表达是 alkaline（“碱性的”）。","词形结构：alkali（碱）+ -ferous（“含有/产生……的”，如 carboniferous 含碳的）。因此 alkaliferous 字面意思就是“含碱的/产碱的”。"]}
{"word":"alkalifiable","summary":{"en":"Alkalifiable means “able to be made alkaline (more basic).”","zh":"alkalifiable 意为“可被碱化的；可变成（更）碱性的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be made alkaline (more basic), usually by adding an alkali in a chemical process.","zh":"可被碱化的；可通过加入碱使其变成（更）碱性的（多用于化学过程）。"},"examples":[{"en":"Some industrial wastewaters are alkalifiable before treatment to reduce corrosion.","zh":"一些工业废水在处理前可先进行碱化，以减少腐蚀。"},{"en":"This solution is alkalifiable, so its pH can be adjusted upward if needed.","zh":"这种溶液可被碱化，因此有需要时可以把 pH 往上调。"}]}],"synonyms":["alkalizable","alkalinisable","capable of being made alkaline"],"phonetic":"/ˌæl.kəˈlaɪ.fə.bəl/","extraExplanation":["“alkalifiable”属于较少见的科技/化学用词，更常见的近义表达是“alkalizable/alkalinisable”（可碱化的）或直接说“can be made alkaline”。","相关词：alkalify（使碱化，较少见）/ alkalinize（使碱化，更常见）；alkaline（碱性的）与 alkali（碱）是基础词根。"]}
{"word":"alkalified","summary":{"en":"“Alkalified” means made alkaline (less acidic), usually in scientific or technical contexts.","zh":"“alkalified”指“被碱化的、变成碱性的”，多用于科学或技术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made alkaline; treated with an alkali so the pH becomes higher (less acidic).","zh":"变成碱性的；经过加碱处理，使 pH 升高（酸性降低）。"},"examples":[{"en":"The soil was alkalified to help certain crops grow better.","zh":"土壤被碱化处理，以帮助某些作物更好地生长。"},{"en":"Alkalified water may taste slightly bitter compared with normal water.","zh":"碱化水的味道可能比普通水略苦一点。"}]},{"partOfSpeech":"v.","definition":{"en":"Past participle of “alkalify”: to make something alkaline.","zh":"“alkalify（使碱化）”的过去分词：使某物变成碱性。"},"examples":[{"en":"The solution was alkalified with sodium bicarbonate before the next step.","zh":"在下一步之前，用碳酸氢钠把溶液碱化了。"}]}],"synonyms":["alkalinized","made alkaline","basified"],"phonetic":"/ælˈkælɪˌfaɪd/","extraExplanation":["“alkalified/alkalify”多见于化学、农业、食品加工等语境，日常英语里更常说“made alkaline”或“alkalinized”。","注意拼写：美式英语里“alkalinized”（与“alkaline”同根）更常见；“alkalified”相对少见，但含义相同。","理解要点：pH 数值越高越“碱性”（alkaline），越低越“酸性”（acidic）。"]}
{"word":"alkalifies","summary":{"en":"“Alkalifies” means “makes something alkaline; raises its pH.”","zh":"“alkalifies”表示“使……变成碱性；提高……的pH值/碱度”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(third-person singular) to make something alkaline; to increase its alkalinity (raise its pH).","zh":"（第三人称单数）使某物变成碱性；提高其碱度（提高 pH 值）。"},"examples":[{"en":"The lab technician alkalifies the solution to reach the target pH.","zh":"实验室技术员把溶液碱化，以达到目标 pH 值。"},{"en":"This treatment alkalifies the soil, which can help some plants grow better.","zh":"这种处理会让土壤碱化，有助于某些植物更好地生长。"}]}],"synonyms":["makes alkaline","alkalinizes","raises the pH","basifies"],"phonetic":"/ælˈkælɪˌfaɪz/","extraExplanation":["“alkalifies”来自动词“alkalify”，常见于化学、环境科学与农业语境。它通常指通过加入碱性物质（如石灰、碳酸盐等）来提高pH，使体系从偏酸转向更碱性。日常英语中更常用的表达是“make … alkaline”或“raise the pH (of …)”。"]}
{"word":"alkalify","summary":{"en":"Alkalify means to make something alkaline (raise its pH), or less commonly, to become alkaline.","zh":"Alkalify 指使……变成碱性（提高pH值），较少情况下也指自身变成碱性。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something alkaline (raise its pH); to add alkali so it becomes less acidic","zh":"使……变成碱性（提高pH值）；加入碱使其酸性降低"},"examples":[{"en":"The lab worker alkalified the solution to prevent the acid from damaging the equipment.","zh":"实验室工作人员把溶液碱化，以防酸腐蚀设备。"},{"en":"Gardeners sometimes alkalify soil to help certain plants grow better.","zh":"园艺爱好者有时会把土壤碱化，帮助某些植物生长得更好。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become alkaline (less common)","zh":"变成碱性（较少用）"},"examples":[{"en":"After treatment, the water slowly alkalified over several hours.","zh":"处理后，水在几小时内慢慢变成碱性。"}]}],"synonyms":["make alkaline","raise the pH","basify","neutralize (in some contexts)"],"phonetic":"/ælˈkæl.əˌfaɪ/","extraExplanation":["“alkalify”常见于化学、生物、农业等语境，意思是“碱化”。日常英语里也常用“make … alkaline”或“raise the pH (of …)”来表达。","拼写上要注意：alkaline（碱性的）→ alkalify（使碱化）。与之相对的常见动词是“acidify”（使酸化）。"]}
{"word":"alkalifying","summary":{"en":"Alkalifying means making something more alkaline (raising its pH) or the action of doing so.","zh":"Alkalifying 指使某物更偏碱性（提高 pH 值），或指正在进行这种“碱化”的动作。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Making something more alkaline (raising its pH); causing it to become less acidic.","zh":"使某物更偏碱性（提高 pH 值）；使其变得不那么酸。"},"examples":[{"en":"Adding lime to the soil has an alkalifying effect.","zh":"往土壤里加石灰会产生“碱化”的效果。"},{"en":"This cleaner is alkalifying, so avoid using it on delicate stone surfaces.","zh":"这种清洁剂具有碱化作用，所以避免用在脆弱的石材表面。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “alkalify”: to make something alkaline or to raise its pH.","zh":"“alkalify”的现在分词：使某物碱化或提高其 pH 值。"},"examples":[{"en":"They are alkalifying the wastewater before discharge.","zh":"他们在排放前对废水进行碱化处理。"},{"en":"Alkalifying the solution too quickly can cause unwanted reactions.","zh":"过快地碱化溶液可能引发不想要的反应。"}]}],"synonyms":["alkalinizing","basifying","raising the pH","making (something) more alkaline"],"phonetic":"/ælˈkæl.əˌfaɪ.ɪŋ/","extraExplanation":["“alkalifying”常见于化学、环境工程、农业等语境，强调“提高 pH 值/中和酸性”。日常英语里更常说“make it more alkaline”或“raise the pH”。","拼写上也常见“alkalinizing”（尤其在美式科学写作中更常用）与“alkalizing/alkalising”等变体，含义基本相同。"]}
{"word":"alkaligen","summary":{"en":"An alkaligen is something (often a substance or microbe) that produces alkali or makes conditions more alkaline.","zh":"alkaligen 指能产生碱或使环境更碱性的物质（也可指产碱的微生物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance that produces alkali (a base), or causes something to become more alkaline.","zh":"产碱物；能产生碱（使环境变得更碱性）的物质。"},"examples":[{"en":"Some bacteria release alkaligens that raise the pH of their surroundings.","zh":"一些细菌会释放产碱物，从而提高周围环境的 pH 值。"},{"en":"The lab tested whether the compound acted as an alkaligen in water.","zh":"实验室检测这种化合物在水中是否具有产碱作用。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a microorganism that produces alkali; sometimes used loosely for alkali-forming bacteria.","zh":"（较少见）产碱微生物；有时泛指能形成碱性的细菌。"},"examples":[{"en":"The clinician suspected an alkaligen in the sample because the medium turned alkaline.","zh":"由于培养基变碱，临床医生怀疑样本中有产碱菌。"}]}],"synonyms":["alkali-producing substance","alkali-forming agent","base-forming substance"],"phonetic":"/ælˈkælɪdʒən/","extraExplanation":["“alkaligen”是相对少见的词，多见于较旧或专业的生物化学/微生物学语境。词根来自“alkali（碱）”+ 后缀“-gen（产生……的）”，意思直观就是“产生碱的东西/因素”。在现代写作中，更常见的表达是“alkali-producing substance/bacteria（产碱物/产碱菌）”。","注意不要与细菌属名“Alcaligenes（产碱菌属）”混淆：Alcaligenes 是正式的拉丁学名，而 alkaligen 更像是描述性普通名词。"]}
{"word":"alkaligenous","summary":{"en":"Alkaligenous describes something that produces alkali and makes conditions more basic (higher pH).","zh":"Alkaligenous 指“产碱的”，会生成碱性物质并使环境更偏碱（pH 升高）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Producing or generating alkali (basic substances), especially used in chemistry and microbiology to describe organisms or reactions that make the environment more alkaline.","zh":"产碱的；生成碱性物质的（尤用于化学与微生物学，指能使环境更偏碱性的生物或反应）。"},"examples":[{"en":"The lab identified an alkaligenous bacterium that raised the pH of the culture medium.","zh":"实验室鉴定出一种产碱细菌，使培养基的 pH 升高。"},{"en":"Some soils become more alkaline because of alkaligenous processes.","zh":"由于产碱过程，一些土壤会变得更偏碱性。"}]}],"synonyms":["alkali-forming","base-producing"],"phonetic":"/ˌæl.kəˈlɪdʒ.ə.nəs/","extraExplanation":["词源上可拆为 alkali（碱）+ -genous（“产生……的”）。因此 alkaligenous 直观意思就是“会产生碱的”。","它多见于专业语境（如微生物鉴定、环境化学）。日常英语里更常说 alkali-forming（成碱的）或 makes the environment alkaline（使环境变碱）。"]}
{"word":"alkalimeter","summary":{"en":"An alkalimeter is a device used to measure how alkaline a solution is.","zh":"alkalimeter 指用于测量溶液碱度的仪器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An instrument used to measure the alkalinity (the amount of base) in a solution, often by chemical testing such as titration.","zh":"碱度计；测碱仪：用于测量溶液的碱度（碱性物质含量）的仪器，常通过化学测试（如滴定）来测定。"},"examples":[{"en":"The lab technician used an alkalimeter to test the alkalinity of the water sample.","zh":"实验室技术员用碱度计检测水样的碱度。"},{"en":"In water treatment, an alkalimeter helps check whether the solution has enough alkalinity to resist sudden pH changes.","zh":"在水处理过程中，碱度计有助于检查溶液是否有足够的碱度来抵抗 pH 的突然变化。"}]}],"synonyms":["alkalinity meter","alkalinity tester"],"phonetic":"/ˌæl.kəˈlɪm.ə.tɚ/","extraExplanation":["“alkalimeter”多见于较正式或较旧的技术文献中，现代实验室更常直接说“alkalinity meter”（碱度测定仪）或描述具体方法如“alkalinity titration”（碱度滴定）。","词根拆解有助记忆：alkali（碱）+ -meter（测量仪器），字面意思就是“测碱的仪器”。"]}
{"word":"alkalimetric","summary":{"en":"Alkalimetric means “used for measuring alkalinity,” usually by titration in chemical analysis.","zh":"alkalimetric 指“用于测定碱度的”，通常指化学分析中的碱量法滴定。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the measurement of alkalinity (how basic a solution is), especially by titration in chemical analysis.","zh":"与碱度（溶液呈碱性的程度）的测定有关的，尤指在化学分析中通过滴定来测量。"},"examples":[{"en":"The lab used an alkalimetric titration to determine the concentration of sodium hydroxide.","zh":"实验室使用碱量法滴定来测定氢氧化钠的浓度。"},{"en":"Alkalimetric methods are common in quality control for cleaning products and detergents.","zh":"在清洁用品和洗涤剂的质量控制中，碱量法方法很常见。"}]}],"synonyms":["alkalimetric (titration)","alkalimetry-related","basicity-measuring"],"phonetic":"/ˌæl.kə.ləˈmɛt.rɪk/","extraExplanation":["“alkalimetric”常见于分析化学语境，尤其指用标准酸溶液去滴定未知碱溶液，通过指示剂变色或pH计终点来计算碱的含量。","词形上可拆为 alkali（碱）+ -metric（测量的）。与之相对的常见术语是 acidimetric（酸量法，用标准碱测酸）。"]}
{"word":"alkalimetrical","summary":{"en":"An adjective meaning “related to alkalimetry (measuring alkali concentration, often by titration).”","zh":"形容词：与碱量分析有关（测定碱的浓度，常通过滴定）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to alkalimetry: the measurement of the concentration (strength) of an alkali (base), usually by titration with a standard acid.","zh":"与碱量分析（alkalimetry）有关的：指测定碱（碱性物质）浓度/强度的方法，通常通过用标准酸进行滴定来完成。"},"examples":[{"en":"The report includes alkalimetrical data from the titration of sodium hydroxide.","zh":"报告包含对氢氧化钠滴定得到的碱量分析数据。"},{"en":"An alkalimetrical method can be used to determine the purity of a basic solution.","zh":"碱量分析方法可用于测定碱性溶液的纯度。"}]}],"synonyms":["alkalimetric","alkalimetric (titration-related)"],"phonetic":"/ˌæl.kə.laɪˈmɛ.trɪ.kəl/","extraExplanation":["“alkalimetrical”是一个较少见、偏专业的实验室用词，更常见的说法是“alkalimetric”（碱量分析的）或直接说“alkalimetry/alkalimetric titration”（碱量分析/碱量滴定）。","词形上：alkali（碱）+ -metric/-metrical（测量的）。在科学写作中，-metrical 有时显得更“书面/旧式”，现代论文里多用 -metric。"]}
{"word":"alkalimetrically","summary":{"en":"Alkalimetrically means “by alkali-based measurement,” especially alkali titration used to analyze acids.","zh":"alkalimetrically 表示“以碱量法（尤其是碱滴定）进行测定/分析”，常用于测定酸性物质的含量。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that involves measuring or analyzing a substance by determining the amount of alkali needed for neutralization (usually by titration).","zh":"以碱量法进行；通过测定为中和而需要加入的碱的量来进行测量或分析（通常指滴定法）。"},"examples":[{"en":"The acidity of the sample was determined alkalimetrically using a standard sodium hydroxide solution.","zh":"使用标准氢氧化钠溶液以碱量法测定了样品的酸度。"},{"en":"The lab report asks you to quantify the acid content alkalimetrically.","zh":"实验报告要求你用碱量法测定酸含量。"}]}],"synonyms":["by alkalimetry","by alkali titration","titrimetrically (more general)"],"phonetic":"/ˌæl.kə.ləˈmɛ.trɪ.kli/","extraExplanation":["“alkalimetrically”是化学分析里的用语，来自“alkalimetry（碱量法）”。常见场景是酸碱滴定：用已知浓度的碱（如NaOH）去中和未知酸，借由消耗的体积/物质的量来计算酸的含量。日常英语很少用，主要见于论文、实验报告与方法学描述。"]}
{"word":"alkalimetry","summary":{"en":"Alkalimetry is a lab method (usually titration) used to measure how much base/alkali is in a solution.","zh":"Alkalimetry 指用实验方法（多为滴定）测定溶液中碱/碱性物质含量的“碱量测定”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the measurement of the amount (concentration) of alkali (base) in a solution, usually by titration with a standard acid","zh":"碱量测定；（通常用标准酸进行滴定来）测定溶液中碱（碱性物质）的含量/浓度"},"examples":[{"en":"In the lab, alkalimetry is used to determine how much sodium hydroxide is in a sample.","zh":"在实验室里，碱量测定常用来测定样品中氢氧化钠的含量。"},{"en":"The technician performed alkalimetry by titrating the solution with hydrochloric acid.","zh":"技术员用盐酸滴定溶液来进行碱量测定。"}]}],"synonyms":["alkali titration","base titration"],"phonetic":"/ˌæl.kəˈlɪm.ə.tri/","extraExplanation":["词源与构词：alkali（碱）+ -metry（测量法），常见于分析化学。与 acidimetry（酸量测定）相对：acidimetry 用标准碱滴定来测酸；alkalimetry 用标准酸滴定来测碱。","使用场景：常见于水质检测、药物与食品质量控制、化工生产等；在日常英语中不常用，更多出现在学术/实验室语境。"]}
{"word":"alkalin","summary":{"en":"Alkaline means ‘basic (not acidic), pH above 7,’ and can also refer to an alkali substance.","zh":"alkaline 指“碱性的（非酸性，pH>7）”，也可指“碱/碱性物质”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the properties of an alkali; having a pH higher than 7 (the opposite of acidic).","zh":"碱性的；呈碱性质的；pH 值大于 7（与“酸性”相反）。"},"examples":[{"en":"This soil is slightly alkaline, so some plants may not grow well here.","zh":"这片土壤略偏碱性，所以有些植物可能不太适合在这里生长。"},{"en":"Use an alkaline cleaner to remove grease from the kitchen floor.","zh":"用碱性清洁剂把厨房地面的油污清掉。"}]},{"partOfSpeech":"n.","definition":{"en":"An alkaline substance (an alkali), such as a chemical that can neutralize acid.","zh":"碱性物质；碱（可中和酸的物质）。"},"examples":[{"en":"Adding an alkaline can help neutralize the acid in the solution.","zh":"加入碱性物质可以帮助中和溶液中的酸。"}]}],"synonyms":["basic","nonacidic","alkali"],"phonetic":"/ˈæl.kə.laɪn/","extraExplanation":["你输入的“alkalin”常见于拼写未完成或误拼，标准拼写通常是 **alkaline**。在日常语境里，最常见搭配有 **alkaline water（碱性水）**、**alkaline battery（碱性电池）**、**alkaline soil（碱性土壤）**。","“alkaline battery（碱性电池）”是日常英语里很常见的固定搭配，商店里 AA/AAA 电池包装上常印有 alkaline；这里的 alkaline 指电池内部使用的碱性电解质（如氢氧化钾）。"]}
{"word":"alkaline","summary":{"en":"Alkaline means “basic, not acidic,” especially describing substances with pH above 7.","zh":"alkaline 指“碱性的（非酸性）”，尤指 pH 值大于 7 的物质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a pH above 7; basic rather than acidic.","zh":"（化学）碱性的；pH 值大于 7 的；不呈酸性。"},"examples":[{"en":"Baking soda is alkaline, so it can help neutralize mild acids.","zh":"小苏打是碱性的，所以它能帮助中和轻微的酸。"},{"en":"Many soaps are slightly alkaline to clean oils and dirt effectively.","zh":"很多肥皂略呈碱性，以便更有效地清洁油脂和污垢。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to an alkali (a substance that forms a base in water), such as sodium hydroxide or potassium hydroxide.","zh":"与碱（在水中形成碱性溶液的物质）有关的，如氢氧化钠或氢氧化钾。"},"examples":[{"en":"The lab stored alkaline solutions in clearly labeled bottles.","zh":"实验室把碱性溶液存放在贴有清晰标签的瓶子里。"},{"en":"Some cleaners contain alkaline compounds that can irritate skin.","zh":"有些清洁剂含有碱性化合物，可能会刺激皮肤。"}]}],"synonyms":["basic","nonacidic"],"phonetic":"/ˈæl.kə.laɪn/","extraExplanation":["“Alkaline”常见于健康与日常语境（如“alkaline water/alkaline diet”）。从科学角度，人体血液的酸碱度会被严格调节，“喝碱性水就能显著改变血液 pH”的说法通常被认为缺乏可靠证据；更实用的理解是：它描述的是食物或水本身的酸碱性。","词源上与“alkali（碱）”相关，来自阿拉伯语 al-qaly（指植物灰，可用来制碱）。学习时可一起记：acidic（酸性的）↔ alkaline/basic（碱性的）。"]}
{"word":"alkalinisation","summary":{"en":"Alkalinisation means the process or practice of making something more alkaline (higher pH), commonly used in chemistry, environmental science, and medicine.","zh":"Alkalinisation 指“碱化”：让某物变得更碱性（pH 升高）的过程或做法，常用于化学、环境科学和医学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making something more alkaline (increasing its pH), especially in chemistry, medicine, or the environment","zh":"碱化；使某物变得更“碱性”（提高 pH 值）的过程，常见于化学、医学或环境领域"},"examples":[{"en":"Alkalinisation of the soil can affect which plants grow well.","zh":"土壤的碱化会影响哪些植物能长得好。"},{"en":"Doctors may use alkalinisation of urine to help the body remove certain drugs.","zh":"医生可能通过尿液碱化来帮助身体排出某些药物。"}]},{"partOfSpeech":"n.","definition":{"en":"(medical) a treatment approach aimed at raising the body’s or a body fluid’s alkalinity, often to reduce acidity-related symptoms or risks","zh":"（医学）提高人体或体液碱性的一种治疗思路，常用于降低与酸性相关的不适或风险"},"examples":[{"en":"In some cases, alkalinisation therapy is considered for patients with high acid levels.","zh":"在某些情况下，会考虑对酸性水平较高的患者进行碱化治疗。"},{"en":"The plan included alkalinisation under careful monitoring.","zh":"该方案包括在严密监测下进行碱化处理。"}]}],"synonyms":["alkalinization","basification","making (something) alkaline","raising pH"],"phonetic":"/ˌæl.kə.laɪ.nəˈzeɪ.ʃən/","extraExplanation":["“alkalinisation”更常见于英式拼写；美式拼写通常是“alkalinization”。两者意思相同。","词根提示：alkali（碱）+ -ise/-ize（使变成）+ -ation（过程/结果）。理解词根有助于记忆相关词，如 alkaline（碱性的）、alkalinity（碱度）。","常见搭配：alkalinisation of soil/urine/water（对土壤/尿液/水的碱化）。在医学语境中，常涉及“尿液碱化”以改变某些物质在体内的排出方式。"]}
{"word":"alkalinise","summary":{"en":"Alkalinise means to make something alkaline (less acidic) by raising its pH.","zh":"alkalinise 指使某物碱化（酸性降低、pH升高）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something alkaline (raise its pH); to add an alkali so it becomes less acidic","zh":"使……碱化（提高pH值）；加入碱性物质使其酸性降低"},"examples":[{"en":"The technician alkalinised the solution before the next step of the experiment.","zh":"技术员在实验的下一步之前先把溶液碱化。"},{"en":"Some products are designed to alkalinise soil that is too acidic.","zh":"有些产品用于给过酸的土壤做碱化处理。"},{"en":"Doctors may recommend treatments to alkalinise the urine in certain conditions.","zh":"在某些情况下，医生可能会建议让尿液碱化的治疗。"}]}],"synonyms":["alkalinize","make alkaline","raise the pH","neutralize acidity"],"phonetic":"/ælˈkæl.əˌnaɪz/","extraExplanation":["“alkalinise”是英式拼写，对应美式更常见的“alkalinize”。在英式英语里，许多动词可用 -ise 或 -ize（如 organise/organize）。","该词常见于化学、农业（土壤改良）与医学语境（如使尿液碱化），日常口语里更常用“make … more alkaline / less acidic”。"]}
{"word":"alkalinised","summary":{"en":"“Alkalinised” means made more alkaline (higher pH), the BrE spelling of “alkalinized.”","zh":"“alkalinised”意为“被碱化/更碱性的（pH 升高）”，是“alkalinized”的英式拼写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(BrE spelling) Made alkaline; treated to increase alkalinity (higher pH).","zh":"（英式拼写）被碱化的；经过处理以提高碱性（提高 pH 值）的。"},"examples":[{"en":"Alkalinised cocoa has a darker color and a milder taste.","zh":"碱化可可颜色更深，味道也更柔和。"},{"en":"The water was alkalinised to reduce corrosion in the pipes.","zh":"为了减少管道腐蚀，水被碱化处理。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense / past participle of “alkalinise” (to make something more alkaline).","zh":"“alkalinise”的过去式/过去分词：使某物更碱化。"},"examples":[{"en":"The solution was alkalinised before the next step of the experiment.","zh":"在实验的下一步之前，溶液已被碱化。"}]}],"synonyms":["alkalinized","made alkaline","basified"],"phonetic":"/ˈæl.kə.ləˌnaɪzd/","extraExplanation":["“alkalinised”是英式拼写；美式更常见“alkalinized”。两者含义相同，只是 -ise / -ize 的拼写差异。","常见语境：化学/实验（alkalinised solution），水处理（调节 pH、减少腐蚀），食品（alkalinised/alkalized cocoa，又称 Dutch-processed cocoa）。"]}
{"word":"alkalinising","summary":{"en":"Alkalinising means making something more alkaline (less acidic) by raising its pH.","zh":"Alkalinising 指通过提高 pH 值使某物更碱性（更不酸）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"making something less acidic and more alkaline (raising its pH)","zh":"使某物酸性降低、碱性增强（提高 pH 值）"},"examples":[{"en":"Lime is often used for alkalinising soil in gardens.","zh":"石灰常用于给花园土壤增碱。"},{"en":"The product contains alkalinising agents to reduce acidity.","zh":"该产品含有增碱成分，用来降低酸度。"}]},{"partOfSpeech":"n.","definition":{"en":"the process of making something more alkaline (raising pH)","zh":"使某物变得更碱性的过程（提高 pH 值）"},"examples":[{"en":"Alkalinising the water can protect pipes from corrosion.","zh":"给水增碱可以保护管道免受腐蚀。"},{"en":"Doctors may recommend alkalinising the urine in some conditions.","zh":"在某些情况下，医生可能会建议让尿液“碱化”。"}]}],"synonyms":["alkalinizing","basifying","making alkaline"],"phonetic":"/ˈæl.kə.ləˌnaɪ.zɪŋ/","extraExplanation":["“alkalinising”是英式拼写；美式更常写作“alkalinizing”。两者意思相同。","词根来自“alkaline（碱性的）”，常用于化学、农业（改良土壤酸度）、以及医学语境（如“urine alkalinisation/alkalinization 尿液碱化”）。","日常生活中也会见到与之相关的表达：alkalinising agent（增碱剂）、alkalinising diet（偏“增碱”的饮食；但健康宣称应谨慎看待，具体以医学建议为准）。"]}
{"word":"alkalinities","summary":{"en":"“Alkalinities” means multiple measurements of a liquid’s ability to neutralize acid (buffering capacity), especially in water testing.","zh":"“Alkalinities”指多个“碱度”测量值：液体（尤指水）中和酸、抵抗 pH 变化的缓冲能力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of alkalinity: measures of how strongly a liquid (especially water) can neutralize acids; the buffering capacity of a solution","zh":"alkalinity 的复数：指液体（尤其是水）中中和酸的能力；溶液的“缓冲能力”"},"examples":[{"en":"The lab compared alkalinities across several river samples.","zh":"实验室比较了几条河流水样的碱度（alkalinities）。"},{"en":"Different alkalinities can affect how stable the water’s pH remains over time.","zh":"不同的碱度会影响水的 pH 随时间变化时能否保持稳定。"}]}],"synonyms":["buffering capacities","alkalinity levels","base-neutralizing capacities"],"phonetic":"/ˌæl.kəˈlɪn.ə.tiz/","extraExplanation":["在水质与环境科学里，alkalinity 常用来描述“缓冲酸”的能力，和 pH（酸碱度）不是同一个概念：pH 是当下酸碱强弱的“数值”，alkalinity 更像是抵抗 pH 变化的“储备能力”。","在实际检测中，alkalinity 往往与碳酸氢根（bicarbonate）、碳酸根（carbonate）等有关；因此在讨论泳池、水族箱、饮用水或锅炉用水时经常出现。"]}
{"word":"alkalinity","summary":{"en":"Alkalinity means “alkaline quality” and especially a liquid’s ability to neutralize acid.","zh":"Alkalinity 指“碱性/碱度”，尤其指液体中和酸的能力（缓冲能力）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being alkaline (having a pH above 7); the ability of a liquid or substance to neutralize acid","zh":"碱性；（尤指水的）碱度/缓冲能力，即中和酸的能力（通常与 pH>7 相关）"},"examples":[{"en":"The alkalinity of the water helps protect pipes from corrosion.","zh":"水的碱度有助于保护管道，减少腐蚀。"},{"en":"High alkalinity can make a swimming pool’s water cloudy and harder to balance.","zh":"碱度过高会让泳池水变浑浊，也更难把水质调到合适范围。"},{"en":"The lab measured alkalinity to see how well the lake could resist acid rain.","zh":"实验室测量碱度，以判断湖泊抵抗酸雨的能力。"}]}],"synonyms":["basicity","alkaline quality"],"phonetic":"/ˌæl.kəˈlɪn.ə.t̬i/","extraExplanation":["在水质领域里，alkalinity 不完全等同于 pH。pH 描述“当下有多酸/多碱”，而 alkalinity 更像“缓冲库存”，表示水能吸收多少酸而不让 pH 剧烈下降（常与碳酸氢盐 bicarbonate、碳酸盐 carbonate 等有关）。","常见搭配：total alkalinity（总碱度）、adjust alkalinity（调节碱度）、alkalinity level（碱度水平）。在泳池/水族/自来水处理中经常出现。"]}
{"word":"alkalinization","summary":{"en":"Alkalinization means the process of making something more alkaline (higher pH).","zh":"Alkalinization 指“碱化”，即使某物变得更碱性（pH升高）的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making something alkaline (more basic, with a higher pH)","zh":"碱化；使（某物）变成碱性的过程（pH升高、酸性降低）"},"examples":[{"en":"The doctor monitored urine alkalinization to help prevent kidney stones.","zh":"医生监测尿液碱化，以帮助预防肾结石。"},{"en":"Adding lime can cause soil alkalinization, which may affect plant growth.","zh":"施加石灰会导致土壤碱化，从而可能影响植物生长。"}]}],"synonyms":["basification","alkalization","raising pH"],"phonetic":"/ˌæl.kə.lɪ.nəˈzeɪ.ʃən/","extraExplanation":["“Alkalinization”常见于医学与环境/农业语境：例如“urine alkalinization（尿液碱化）”用于某些结石预防或药物排泄相关的处理；“soil alkalinization（土壤碱化）”多与施用石灰、灌溉方式或盐碱化过程有关。","拼写上也可见英式“alkalinisation”。该词来自“alkaline（碱性的）+ -ize（使……）+ -ation（……的过程/结果）”。"]}
{"word":"alkalinize","summary":{"en":"Alkalinize means to make something alkaline (raise its pH).","zh":"Alkalinize 指使某物碱化（提高pH值）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something alkaline (to raise its pH, making it less acidic)","zh":"使……碱化；使……呈碱性（提高pH值，降低酸性）"},"examples":[{"en":"Some antacids alkalinize the stomach and relieve heartburn.","zh":"一些抗酸药会使胃部碱化，从而缓解胃灼热。"},{"en":"Farmers may alkalinize soil by adding lime.","zh":"农民可能会通过施加石灰来使土壤碱化。"},{"en":"The lab protocol says to alkalinize the solution before adding the next chemical.","zh":"实验流程要求在加入下一种化学品之前先使溶液碱化。"}]}],"synonyms":["make alkaline","raise the pH","basify"],"phonetic":"/ælˈkælɪnˌaɪz/","extraExplanation":["“alkalinize”多用于医学、化学与农业语境，强调把环境从“偏酸”调整到“偏碱”。日常英语里更常见的表达是“make something more alkaline / raise the pH”。","拼写上也常见英式变体“alkalinise”。两者意思相同，只是美式/英式拼写差异。"]}
{"word":"alkalinized","summary":{"en":"Alkalinized means “made more alkaline (less acidic),” often used for chemicals, soil, or foods like cocoa.","zh":"Alkalinized 指“经过碱化处理、碱性增强（酸性降低）”，常用于化学品、土壤或食品（如碱化可可）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially of a product, solution, or substance) made more alkaline; having had its pH raised (made less acidic).","zh":"（尤指产品、溶液或物质）被碱化的；碱性增强的；pH 值被提高（酸性降低）的。"},"examples":[{"en":"Alkalinized cocoa has a darker color and a milder, less bitter taste.","zh":"碱化可可颜色更深，味道更温和、没那么苦。"},{"en":"The lab report notes that the sample was alkalinized before the final measurement.","zh":"实验报告注明：在最终测量前，样品已进行碱化处理。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “alkalinize”: to make something more alkaline.","zh":"“alkalinize”的过去式/过去分词：使某物碱化；提高其碱性。"},"examples":[{"en":"They alkalinized the solution to protect the metal from corrosion.","zh":"他们将溶液碱化，以保护金属免受腐蚀。"},{"en":"The soil was alkalinized to adjust the pH for certain crops.","zh":"为适应某些作物，他们对土壤进行了碱化以调节 pH 值。"}]}],"synonyms":["alkaline-treated","made alkaline","basified"],"phonetic":"ˈæl.kəˌlaɪn.aɪzd","extraExplanation":["“alkalinized”在美式英语里常见拼写；英式英语更常见“alkalinised”。","食品语境里最常见的是“alkalinized cocoa”（荷兰式可可粉，Dutch-processed cocoa），指用碱（如碳酸钾）处理来降低酸味、加深颜色。","注意：“alkaline”是形容词“碱性的”；“alkalinize”是动词“使变碱/碱化”；“alkalinized”是其过去分词/形容词用法。"]}
{"word":"alkalinizes","summary":{"en":"“Alkalinizes” means “makes something (or becomes) more alkaline; raises pH.”","zh":"“alkalinizes” 表示“使……碱化/变碱；提高 pH 值（也可指变得更碱性）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make something more alkaline (raise its pH); to neutralize acidity","zh":"使……变成更碱性（提高 pH 值）；中和酸性"},"examples":[{"en":"This antacid alkalinizes the stomach contents and eases heartburn.","zh":"这种抗酸药会使胃内容物更偏碱性，从而缓解胃灼热。"},{"en":"The lab technician alkalinizes the solution before adding the next reagent.","zh":"实验员在加入下一种试剂之前先让溶液碱化。"},{"en":"Some foods may slightly alkalinize your urine.","zh":"某些食物可能会让你的尿液略微碱化。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become more alkaline (increase in pH)","zh":"变得更碱性（pH 值升高）"},"examples":[{"en":"If too much base is added, the mixture alkalinizes quickly.","zh":"如果加入太多碱，混合物会很快变得更碱性。"},{"en":"As carbon dioxide escapes, the water can alkalinize a little.","zh":"当二氧化碳逸出时，水可能会稍微碱化。"}]}],"synonyms":["makes alkaline","basifies","neutralizes acid","raises pH"],"phonetic":"ælˈkæl.əˌnaɪzɪz","extraExplanation":["“alkalinizes” 是动词 “alkalinize” 的第三人称单数（He/She/It alkalinizes…）。英式拼写常见为 “alkalinise”。","在医学语境里常见说法有 “alkalinize the urine（尿液碱化）”，用于描述通过药物或治疗让尿液 pH 升高，以帮助某些药物排泄或减少某些结石形成风险（具体需遵医嘱）。"]}
{"word":"alkalinizing","summary":{"en":"“Alkalinizing” means making something more alkaline (higher pH, less acidic), used often in medicine, chemistry, and agriculture.","zh":"“alkalinizing”指使某物更偏碱性（提高 pH、降低酸性），常用于医学、化学与农业语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Making something more alkaline (raising its pH; making it less acidic).","zh":"使某物更偏碱性（提高 pH 值、降低酸性）。"},"examples":[{"en":"The doctor recommended an alkalinizing diet to reduce acid reflux symptoms.","zh":"医生建议采用“碱化饮食”来减轻胃酸倒流的症状。"},{"en":"This medication has an alkalinizing effect on the urine.","zh":"这种药物对尿液有碱化作用。"}]},{"partOfSpeech":"n.","definition":{"en":"The process or action of making something more alkaline.","zh":"使某物碱化的过程或行为。"},"examples":[{"en":"Alkalinizing the soil can help some plants grow better.","zh":"对土壤进行碱化可能有助于某些植物更好生长。"},{"en":"The lab studied the alkalinizing of seawater and its effects on marine life.","zh":"实验室研究了海水碱化及其对海洋生物的影响。"}]}],"synonyms":["basifying","making more alkaline","raising pH","deacidifying"],"phonetic":"/ˌæl.kəˈlaɪ.nəˌzaɪ.zɪŋ/","extraExplanation":["在美式拼写里常见为 alkalinizing（带 z）；英式拼写多为 alkalinising（带 s）。两者意思相同。","常见搭配：alkalinizing agent（碱化剂）、alkalinizing effect（碱化作用）、alkalinizing diet（碱化饮食，常见于健康话题，但“改变人体整体酸碱度”的说法在医学上常被认为过度简化）。"]}
{"word":"alkalinuria","summary":{"en":"Alkalinuria means having unusually alkaline urine (higher-than-normal urine pH).","zh":"Alkalinuria 指尿液异常偏碱（尿 pH 值高于正常）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical condition in which the urine is unusually alkaline (has a higher-than-normal pH)","zh":"（医学）碱性尿：尿液异常偏碱（pH 值高于正常）的一种情况"},"examples":[{"en":"The lab report noted alkalinuria, so the doctor checked for a urinary tract infection.","zh":"化验报告提示有碱性尿，因此医生检查是否存在尿路感染。"},{"en":"Alkalinuria can sometimes appear after a diet very high in fruits and vegetables.","zh":"在以大量水果和蔬菜为主的饮食之后，有时也会出现碱性尿。"}]}],"synonyms":["alkaline urine"],"phonetic":"/ˌæl.kə.lɪˈn(j)ʊr.i.ə/","extraExplanation":["“alkalinuria”由“alkalin-（碱性）+ -uria（尿/尿液情况）”构成，属于较正式的医学用语，日常交流中医生也可能说“alkaline urine（尿液偏碱）”。","尿液偏碱的原因很多：例如某些细菌导致的尿路感染、长期呕吐造成的体液变化、某些药物或碱化尿液的治疗、以及饮食因素等。它通常是“检查结果/线索”，还需要结合症状与其他化验来判断。","与之相对的常见词是“aciduria（酸性尿）/ acidic urine（尿液偏酸）”。"]}
{"word":"alkalis","summary":{"en":"“Alkalis” means basic substances (plural) that neutralize acids.","zh":"“alkalis”是复数，指能中和酸的碱性物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Basic substances that can neutralize acids, usually producing salt and water; many alkalis dissolve in water and have a pH above 7.","zh":"碱性物质，能中和酸，通常生成盐和水；许多碱可溶于水，pH 值大于 7。"},"examples":[{"en":"Soap works well because it contains alkalis that help remove grease.","zh":"肥皂很好用，因为它含有碱性成分，能帮助去除油污。"},{"en":"Strong alkalis can burn the skin, so wear gloves when cleaning.","zh":"强碱会灼伤皮肤，所以清洁时要戴手套。"}]}],"synonyms":["bases","alkaline substances"],"phonetic":"/ˈæl.kəˌlaɪz/","extraExplanation":["“alkalis”是“alkali”的复数形式。日常英语里更常见的相关词是“base（碱）”和“alkaline（碱性的）”。化学上通常把能溶于水并产生 OH⁻ 的碱称为“alkali（碱、可溶性碱）”，例如 sodium hydroxide（氢氧化钠）和 potassium hydroxide（氢氧化钾）。"]}
{"word":"alkalisable","summary":{"en":"Alkalisable means “able to be made alkaline (more basic).”","zh":"Alkalisable 指“可被碱化、可变成碱性的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be made alkaline (more basic), especially by adding an alkali or by a chemical reaction.","zh":"可被碱化的；可变成碱性的（通常指通过加入碱或发生化学反应而变得更“碱”）。"},"examples":[{"en":"This solution is alkalisable, so its pH can be raised by adding a base.","zh":"这种溶液是可被碱化的，因此可以通过加入碱来提高它的 pH 值。"},{"en":"Researchers tested whether the soil was alkalisable under different treatments.","zh":"研究人员测试了在不同处理条件下土壤是否可被碱化。"}]}],"synonyms":["alkalizable","able to be alkalinized","base-forming (context-dependent)"],"phonetic":"/ˌæl.kəˈlaɪ.zə.bəl/","extraExplanation":["“alkalisable”主要见于英式拼写；美式更常写作“alkalizable”。两者意思相同，常用于化学、材料、土壤与环境科学语境。","词根提示：alkali（碱）+ -ise/-ize（使……化）+ -able（可……的），整体就是“可被使成碱性的”。"]}
{"word":"alkalisation","summary":{"en":"Alkalisation means the process of making something alkaline (raising its pH).","zh":"Alkalisation 指使某物碱化（提高 pH 值）的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making something alkaline (increasing its pH); alkalinization","zh":"碱化；使某物变成碱性（提高 pH 值）的过程"},"examples":[{"en":"Alkalisation of the soil can reduce the availability of some nutrients.","zh":"土壤碱化会降低某些养分的有效性。"},{"en":"The treatment aims at alkalisation of the urine to help prevent certain kidney stones.","zh":"这种治疗旨在使尿液碱化，以帮助预防某些肾结石。"}]}],"synonyms":["alkalinization","alkalization","basification"],"phonetic":"/ˌæl.kə.laɪˈzeɪ.ʃən/","extraExplanation":["“alkalisation”是英式拼写；美式更常见“alkalization”。两者意思相同。","该词多用于化学、医学、农业等语境，日常英语中更常用“make something more alkaline / raise the pH”。"]}
{"word":"alkalise","summary":{"en":"Alkalise means to make something less acidic by making it alkaline, especially in chemistry, environmental work, gardening, or medicine.","zh":"Alkalise 指通过使其呈碱性来降低酸性，常用于化学、环保、园艺或医学语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something alkaline (less acidic), often by adding an alkali","zh":"使……碱化（降低酸性），通常通过加入碱性物质"},"examples":[{"en":"The factory used chemicals to alkalise the wastewater before releasing it.","zh":"工厂在排放前用化学品把废水碱化。"},{"en":"Gardeners sometimes alkalise soil to help certain plants grow better.","zh":"园艺爱好者有时会给土壤碱化，以帮助某些植物长得更好。"}]},{"partOfSpeech":"vt.","definition":{"en":"(medicine/biology) to increase the alkalinity of the body or urine, usually with medication or diet","zh":"（医学/生物）使人体或尿液碱化，通常通过药物或饮食"},"examples":[{"en":"Doctors may alkalise the urine to reduce discomfort from some urinary conditions.","zh":"医生可能会使尿液碱化，以减轻某些泌尿问题带来的不适。"},{"en":"This treatment helps alkalise the blood in specific medical situations.","zh":"这种治疗在特定医疗情况下有助于使血液碱化。"}]}],"synonyms":["alkalize","make alkaline","basify"],"phonetic":"/ˈæl.kəˌlaɪz/","extraExplanation":["“alkalise”是英式拼写；美式更常写作“alkalize”。两者意思相同。","词根来自“alkali（碱）”，常见于化学、环境工程、园艺与医学语境。日常口语中不太常用。"]}
{"word":"alkalised","summary":{"en":"Alkalised means treated with an alkali to reduce acidity or change properties (common in foods like cocoa).","zh":"Alkalised 指“经碱处理的”，用于降低酸度或改变性质（食品如可可粉中很常见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"treated with an alkali (a basic substance) to reduce acidity or change chemical properties.","zh":"经碱处理的；用碱性物质处理过的（用来降低酸度或改变性质）。"},"examples":[{"en":"The label says the cocoa is alkalised, so it tastes less acidic.","zh":"标签写着这款可可粉是经碱处理的，所以尝起来没那么酸。"},{"en":"Some foods are alkalised to adjust flavor and color.","zh":"有些食品会进行碱化处理，以调整风味和颜色。"}]},{"partOfSpeech":"adj.","definition":{"en":"(medicine) made more alkaline; having the acidity reduced, often to protect the stomach or improve tolerance.","zh":"（医药）被碱化的；降低酸度的（常用于减少胃刺激或提高耐受性）。"},"examples":[{"en":"An alkalised preparation may be easier on the stomach for some people.","zh":"对一些人来说，碱化制剂可能更不刺激胃。"}]}],"synonyms":["alkalized","treated with alkali","deacidified","basified"],"phonetic":"/ˈælkəˌlaɪzd/","extraExplanation":["“alkalised”是英式拼写；美式更常写作“alkalized”。在食品领域最常见的例子是“Dutch-processed (alkalised) cocoa”（荷兰式/碱化可可）：通过碱处理让颜色更深、酸味更低、风味更圆润。","发音和拼写小提示：词根来自“alkali（碱）”，动词是“alkalise/alkalize（使碱化）”，形容词/过去分词形式就是“alkalised/alkalized”。"]}
{"word":"alkaliser","summary":{"en":"An alkaliser is something (often a chemical or medicine) that makes a substance more alkaline.","zh":"alkaliser 指能使物质变得更碱性（提高 pH）的东西，常为化学品或药物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance, medicine, or agent that makes something more alkaline (raises pH); an alkalizing agent","zh":"使某物变得更碱性（提高 pH 值）的物质、药物或作用剂；碱化剂"},"examples":[{"en":"Sodium bicarbonate is used as an alkaliser to reduce stomach acidity.","zh":"碳酸氢钠可作为碱化剂，用来降低胃酸。"},{"en":"The lab added an alkaliser to the solution to adjust its pH.","zh":"实验室向溶液中加入碱化剂以调节其 pH 值。"}]}],"synonyms":["alkalizer","alkalizing agent","alkalinizer","base (in chemistry)"],"phonetic":"/ˈæl.kəˌlaɪ.zɚ/","extraExplanation":["“alkaliser”是英式拼写，美式更常写作“alkalizer”。两者意思相同。","在医学语境里，alkaliser 常指“碱化药”，用于中和或减轻酸性（如胃酸、尿液酸性）。在化学/工业语境里，则泛指任何“使之变碱”的添加剂或处理剂。"]}
{"word":"alkalises","summary":{"en":"Alkalises means makes something less acidic (more alkaline), especially by adding an alkali; it can also mean reducing acidity in a medical sense.","zh":"Alkalises 指“使……碱化/降低酸性”，常指加入碱性物质；在医学语境中也可指降低体液酸度。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(BrE spelling) to make something alkaline (less acidic), usually by adding an alkali.","zh":"（英式拼写）使某物呈碱性（降低酸性），通常通过加入碱性物质。"},"examples":[{"en":"This detergent alkalises the water, which helps remove grease.","zh":"这种清洁剂会使水呈碱性，从而更容易去除油污。"},{"en":"The process alkalises the solution before the next step.","zh":"在下一步之前，这个过程会先使溶液呈碱性。"}]},{"partOfSpeech":"v.","definition":{"en":"(Medicine) to reduce acidity in the body or urine; to make body fluids less acidic.","zh":"（医学）降低体内或尿液的酸度；使体液酸性减弱。"},"examples":[{"en":"The doctor prescribed a medicine that alkalises the urine.","zh":"医生开了一种能使尿液碱化的药。"},{"en":"Some treatments aim to alkalise stomach contents to ease irritation.","zh":"有些治疗旨在使胃内容物碱化，以减轻刺激。"}]}],"synonyms":["alkalizes","neutralizes (partly)","makes alkaline"],"phonetic":"ˈæl.kəˌlaɪ.zɪz","extraExplanation":["“alkalises”是动词第三人称单数形式（he/she/it alkalises）。不定式是“alkalise”。","拼写提示：英式英语常用 -ise（alkalise），美式英语更常见 -ize（alkalize）。意思相同。"]}
{"word":"alkalising","summary":{"en":"Alkalising means making something more alkaline (higher pH) or the process of doing so.","zh":"Alkalising 指“使……更碱性（提高 pH）”，也可指“碱化的过程”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry/medicine) Making something more alkaline (raising its pH).","zh":"（化学/医学）使某物变得更碱性（提高 pH 值）。"},"examples":[{"en":"The treatment has an alkalising effect on the blood.","zh":"这种治疗对血液有碱化作用。"},{"en":"Some athletes use alkalising supplements, but the evidence is mixed.","zh":"一些运动员使用碱化补充剂，但证据并不一致。"}]},{"partOfSpeech":"n.","definition":{"en":"The process or act of making something more alkaline.","zh":"使某物碱化的过程或行为。"},"examples":[{"en":"Alkalising of the soil can help some crops, but too much can harm others.","zh":"土壤碱化对某些作物有帮助，但过度会伤害其他作物。"},{"en":"Doctors may monitor alkalising in patients with acid–base imbalances.","zh":"医生可能会监测酸碱失衡患者的碱化情况。"}]}],"synonyms":["alkalizing","making alkaline","basifying"],"phonetic":"/ˈæl.kəˌlaɪ.zɪŋ/","extraExplanation":["“alkalising”是英式拼写；美式更常写作“alkalizing”。两者意思相同。","常见搭配：alkalising effect（碱化作用）、alkalising agent（碱化剂）、alkalising diet（所谓“碱性饮食”，属于流行健康概念，科学证据因说法而异）。"]}
{"word":"alkalizable","summary":{"en":"Alkalizable means “able to be made alkaline (more basic).”","zh":"alkalizable 指“可被碱化的；能够变成（更）碱性的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be made alkaline (more basic); capable of being alkalized.","zh":"可被碱化的；可变成（更）碱性的。"},"examples":[{"en":"This solution is alkalizable, so its pH can be raised by adding a base.","zh":"这种溶液可被碱化，因此加入碱可以提高它的 pH 值。"},{"en":"Some soils are easily alkalizable, which can affect how plants absorb nutrients.","zh":"有些土壤很容易被碱化，这会影响植物吸收养分。"}]}],"synonyms":["alkalizable","capable of being alkalized","basifiable"],"phonetic":"/ˌæl.kəˈlaɪ.zə.bəl/","extraExplanation":["“alkalizable”常见于化学、生物与医学写作中，强调“能够被处理成碱性”的性质。日常英语里更常见的相关词是动词“alkalize/alkalise（使碱化）”以及形容词“alkaline（碱性的）”。","词形上，“-ize/-ise”表示“使……化”，而“-able”表示“能够……的”，所以 alkalizable = able to be alkalized（能够被碱化的）。"]}
{"word":"alkalizate","summary":{"en":"“Alkalizate” is a rare form; it usually means “alkalize”: to make something more alkaline (less acidic).","zh":"“alkalizate” 很少见，通常指 “alkalize/alkalise”：使某物碱化、变得更碱（更不酸）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something more alkaline (less acidic), often by adding an alkali; to treat with an alkali","zh":"使（某物）碱化、变得更碱（更不酸）；常指加入碱或用碱处理"},"examples":[{"en":"Some antacids work by alkalizing the stomach acid.","zh":"一些抗酸药通过使胃酸碱化来起作用。"},{"en":"The technician alkalized the solution to stabilize the reaction.","zh":"技术员把溶液碱化，以稳定反应。"},{"en":"This process alkalizes the soil to help certain crops grow better.","zh":"这个过程使土壤碱化，帮助某些作物更好生长。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become more alkaline (less acidic)","zh":"（某物）变得更碱、碱化（更不酸）"},"examples":[{"en":"Over time, the water may alkalize as minerals dissolve into it.","zh":"随着时间推移，矿物质溶解进水中，水可能会逐渐碱化。"}]}],"synonyms":["alkalize","alkalise","make alkaline","basify"],"phonetic":"/ˈælkəˌlaɪz/","extraExplanation":["“alkalizate” 在英语里非常少见，多数情况下是把更常用的动词 **alkalize**（美式拼写）或 **alkalise**（英式拼写）拼错了。写作和考试中建议用 alkalize/alkalise。","常见使用场景：化学实验（alkalize a solution）、农业/环境（alkalize soil/water）、医学（alkalize urine＝使尿液更碱，常见于医生说明或药物标签）。"]}
{"word":"alkalization","summary":{"en":"Alkalization is the process of making something more alkaline (higher pH), used in chemistry/medicine and in food processing (e.g., Dutch-process cocoa).","zh":"Alkalization 指“碱化”：使某物更偏碱性（pH 升高）的过程，常用于化学/医学，以及食品加工（如荷兰化可可）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process of making something more alkaline (raising its pH), usually by adding a base such as sodium bicarbonate.","zh":"使某物更偏碱性（提高 pH 值）的过程，通常通过加入碱性物质（如小苏打/碳酸氢钠）来实现。"},"examples":[{"en":"Doctors may recommend urine alkalization to help prevent certain kidney stones.","zh":"医生可能会建议进行尿液碱化，以帮助预防某些类型的肾结石。"},{"en":"The lab monitored the solution’s pH during alkalization.","zh":"实验室在碱化过程中监测溶液的 pH 值。"}]},{"partOfSpeech":"n.","definition":{"en":"In food processing, a treatment that reduces acidity and changes flavor and color (for example, alkalization of cocoa, also called “Dutch process”).","zh":"在食品加工中，一种降低酸度并改变风味与颜色的处理方式（例如可可的碱化，也称“荷兰化/ Dutch process”）。"},"examples":[{"en":"Dutch-process cocoa gets its darker color from alkalization.","zh":"荷兰化可可之所以颜色更深，是因为经过了碱化处理。"},{"en":"Alkalization can make cocoa taste less sharp and more mellow.","zh":"碱化能让可可味道没那么酸涩，更柔和。"}]}],"synonyms":["alkalinization","basification"],"phonetic":"/ˌæl.kə.ləˈzeɪ.ʃən/","extraExplanation":["“alkalization”也常写作“alkalisation”（英式拼写）。医学里常见搭配有：urine alkalization（尿液碱化）、blood alkalization（血液碱化，通常在更专业语境中讨论）。","食品领域里“cocoa alkalization / Dutch process”是常见固定说法：通过碱化降低酸度、改变颜色与溶解性，但也可能影响某些风味与成分保留。"]}
{"word":"alkalize","summary":{"en":"Alkalize means to make something alkaline (less acidic), or to become alkaline.","zh":"Alkalize 指使某物变成（更）碱性、降低酸性，或指某物变得碱性。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something alkaline (raise its pH; make it less acidic) by adding an alkali or another substance","zh":"使……碱化（提高pH值、降低酸性），通常通过加入碱或其他物质实现"},"examples":[{"en":"The lab technician alkalized the solution to pH 8.0 before running the test.","zh":"化验员先把溶液碱化到pH 8.0，然后再进行测试。"},{"en":"Some water filters are designed to alkalize drinking water slightly.","zh":"有些净水器的设计会让饮用水轻微碱化。"}]},{"partOfSpeech":"vi.","definition":{"en":"(of something) to become alkaline; to turn less acidic","zh":"（某物）变得呈碱性；酸性降低"},"examples":[{"en":"After treatment, the mixture began to alkalize over time.","zh":"处理后，这种混合物随着时间推移开始逐渐碱化。"}]}],"synonyms":["make alkaline","basify","neutralize (sometimes, depending on context)"],"phonetic":"/ˈæl.kəˌlaɪz/","extraExplanation":["英式拼写常见为 alkalise；美式拼写为 alkalize。两者意思相同。","多用于化学、医学与环境领域（如“使尿液碱化 alkalize the urine”）。日常口语里更常说 “make it more alkaline / make it less acidic”。"]}
{"word":"alkalized","summary":{"en":"Alkalized means “treated with alkali” or “made more alkaline,” often describing cocoa or other materials after chemical processing.","zh":"Alkalized 指“经过碱处理/被碱化、变得更碱性”，常用来描述碱化可可等经过化学处理的材料。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"treated with an alkali (a basic chemical) to reduce acidity or change properties; made more alkaline","zh":"用碱（碱性物质）处理过的；使其碱性增强的"},"examples":[{"en":"Alkalized cocoa has a darker color and a smoother, less acidic taste.","zh":"碱化可可粉颜色更深，口感更顺滑、酸味更少。"},{"en":"The manufacturer uses an alkalized process to improve the powder’s solubility.","zh":"厂家用碱化工艺来提高粉末的溶解性。"}]}],"synonyms":["alkali-treated","alkaline-treated","made alkaline"],"phonetic":"/ˈæl.kəˌlaɪzd/","extraExplanation":["“alkalized”常见于食品与化工语境，尤其是“alkalized cocoa / Dutch-processed cocoa（荷兰式/碱化可可）”。通过加入碱（如碳酸钾）来降低酸度、加深颜色、改变风味与溶解性。","英式拼写常见为“alkalised”。在日常英语里也常用“alkaline (adj.)”来表示“碱性的”，但“alkalized”强调“经过处理/被碱化”。"]}
{"word":"alkalizer","summary":{"en":"An alkalizer is something (often a chemical) that makes a substance less acidic by increasing alkalinity (raising pH).","zh":"Alkalizer 指使物质碱性增强、酸性降低（提高pH值）的物质，常见为化学碱化剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance or agent that makes something more alkaline (raises its pH), or reduces acidity","zh":"碱化剂；使（某物）变得更碱性的物质或手段（提高pH值、降低酸性）"},"examples":[{"en":"This antacid works as an alkalizer in the stomach, helping reduce acid.","zh":"这种抗酸药在胃里起到碱化剂的作用，帮助降低胃酸。"},{"en":"Some sports drinks contain an alkalizer to help buffer acidity.","zh":"一些运动饮料含有碱化成分，用来帮助缓冲酸性。"}]},{"partOfSpeech":"n.","definition":{"en":"a chemical used to treat or process a material by making it more alkaline (for example, in food or industrial production)","zh":"（工艺用）碱化剂；用于加工处理材料、使其更碱性的化学品（如食品或工业生产中）"},"examples":[{"en":"In cocoa processing, an alkalizer may be used to change flavor and color.","zh":"在可可加工中，可能会使用碱化剂来改变风味和颜色。"},{"en":"The factory added an alkalizer to adjust the solution’s pH.","zh":"工厂加入碱化剂来调节溶液的pH值。"}]}],"synonyms":["alkalizing agent","alkali","base","neutralizer (context-dependent)"],"phonetic":"/ˈæl.kəˌlaɪ.zɚ/","extraExplanation":["“alkalizer”也常拼作“alkaliser”（英式拼法）。","在食品领域，处理可可粉的“Dutch process（荷兰处理法）”常涉及碱化步骤，会影响可可的颜色更深、口感更顺、酸味更低。","在医疗/保健语境里，尿液碱化剂（urinary alkalizer）有时用于帮助缓解某些泌尿道不适或配合药物使用；具体使用应遵医嘱。"]}
{"word":"alkalizes","summary":{"en":"“Alkalizes” means “makes something more alkaline (raises pH).”","zh":"“alkalizes”表示“使某物更偏碱性（提高 pH）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make something more alkaline (to raise its pH); to treat with an alkali","zh":"使……碱化（提高 pH 值）；用碱处理"},"examples":[{"en":"This medicine alkalizes the urine to reduce burning during urination.","zh":"这种药会使尿液碱化，以减轻排尿时的灼痛感。"},{"en":"Lime is added to the soil because it alkalizes acidic ground.","zh":"人们往土壤里加石灰，因为它能使酸性土壤碱化。"},{"en":"The cleaning solution alkalizes the surface, helping grease break down.","zh":"这种清洁液会使表面更偏碱性，从而帮助分解油脂。"}]}],"synonyms":["make alkaline","basify","neutralize (in some contexts)"],"phonetic":"/ˈæl.kə.laɪz/","extraExplanation":["“alkalizes”是动词“alkalize”的第三人称单数形式（he/she/it alkalizes）。常见于化学、农业（改良酸性土壤）和医学（碱化尿液、胃酸相关处理）等语境。","英式拼写常写作“alkalise / alkalises”。"]}
{"word":"alkalizing","summary":{"en":"“Alkalizing” means making something more alkaline (less acidic), i.e., raising its pH.","zh":"“alkalizing”指使某物变得更碱（更不酸），也就是提高 pH 值。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Making something less acidic (more alkaline); raising the pH.","zh":"使……碱化；降低酸性、提高 pH 值。"},"examples":[{"en":"The doctor recommended an alkalizing medication to reduce stomach acid.","zh":"医生建议使用碱化药物来降低胃酸。"},{"en":"Some people follow an alkalizing diet, aiming to eat more fruits and vegetables.","zh":"有些人会选择“碱性饮食”，希望多吃水果和蔬菜。"},{"en":"Adding lime can have an alkalizing effect on acidic soil.","zh":"添加石灰会对酸性土壤产生碱化作用。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of alkalize: to make something more alkaline; to raise the pH of a liquid or environment.","zh":"alkalize 的现在分词：使……变得更碱；提高液体或环境的 pH 值。"},"examples":[{"en":"They are alkalizing the pool water to keep the pH in the safe range.","zh":"他们正在把泳池水碱化，以把 pH 维持在安全范围内。"},{"en":"This supplement claims to be alkalizing the body, though evidence is limited.","zh":"这种补充剂声称能“碱化身体”，但证据有限。"}]}],"synonyms":["alkaline-forming","basifying","deacidifying","neutralizing (sometimes)"],"phonetic":"/ˈælkəˌlaɪzɪŋ/","extraExplanation":["“alkalizing”也常写作英式拼法“alkalising”。常见搭配有：alkalizing agent（碱化剂）、alkalizing effect（碱化作用）、alkalizing diet（碱性饮食）。","在健康语境里，“alkalizing the body（碱化身体）”多用于营销或大众健康说法；科学上人体血液酸碱度由机制严格调节，饮食更多影响的是尿液 pH。"]}
{"word":"alkaloid","summary":{"en":"An alkaloid is a natural, nitrogen-containing chemical—often from plants—that can have strong effects on the body.","zh":"alkaloid 指生物碱：多来自植物的天然含氮化合物，对人体有显著作用，可能成药也可能有毒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A naturally occurring nitrogen-containing chemical (often from plants) that can strongly affect the human body, sometimes as a medicine and sometimes as a poison.","zh":"生物碱：一种天然存在、含氮的化学物质（常来自植物），能显著影响人体，可能用于药物，也可能有毒。"},"examples":[{"en":"Caffeine is an alkaloid found in coffee and tea.","zh":"咖啡因是咖啡和茶中含有的一种生物碱。"},{"en":"Some alkaloids are used in medicine, but they can be dangerous in high doses.","zh":"一些生物碱可用于药物，但剂量过高会很危险。"}]}],"synonyms":["plant toxin","natural compound"],"phonetic":"/ˈæl.kə.lɔɪd/","extraExplanation":["“alkaloid”来自“alkali”（碱）+ “-oid”（像……的），因为许多生物碱在化学性质上呈碱性。","常见例子：尼古丁（nicotine）、吗啡（morphine）、奎宁（quinine）、阿托品（atropine）、咖啡因（caffeine）。它们往往是植物用来防御昆虫或动物的“化学武器”。","阅读或新闻里常见搭配：alkaloid content（生物碱含量）、toxic alkaloids（有毒生物碱）、alkaloid-rich plants（富含生物碱的植物）。"]}
{"word":"alkaloidal","summary":{"en":"An academic adjective meaning “related to or containing alkaloids.”","zh":"一个偏学术的形容词，意思是“与生物碱有关的/含生物碱的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to, containing, or having the chemical nature of an alkaloid (a naturally occurring, nitrogen-containing compound often found in plants and often having strong effects on the body).","zh":"与生物碱有关的；含有生物碱的；具有生物碱性质的（生物碱多为植物中天然存在、含氮且对人体有明显作用的化合物）。"},"examples":[{"en":"Tobacco leaves contain alkaloidal compounds such as nicotine.","zh":"烟草叶含有尼古丁等生物碱类化合物。"},{"en":"Some alkaloidal extracts can be toxic if taken in the wrong dose.","zh":"某些生物碱类提取物如果剂量不当可能有毒。"}]}],"synonyms":["alkaloid","alkaloid-containing","alkaline (not the same, but sometimes confused)"],"phonetic":"/ˌæl.kəˈlɔɪ.dəl/","extraExplanation":["词形提示：alkaloidal = alkaloid（生物碱）+ -al（“……的”）+ -oid（“类似……的/……状的”）的衍生形容词形式。常见于化学、药理学、植物学语境。","语域提示：在日常英语里更常说“alkaloid”或“alkaloid compounds”；“alkaloidal”更偏学术/技术写法，用来修饰“compound(s), extract(s), content/level”等名词。"]}
{"word":"alkaloids","summary":{"en":"Alkaloids are strong-acting, nitrogen-containing natural chemicals, especially from plants, often used in medicine or potentially harmful in high doses.","zh":"alkaloids 指生物碱：多见于植物的含氮天然化学物质，作用强，可入药但高剂量可能有害。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Naturally occurring nitrogen-containing chemicals (often from plants) that can have strong effects on the body and mind; many are used as medicines or can be toxic.","zh":"生物碱：天然存在、含氮的化学物质（常见于植物），对人体与神经系统可能有强烈作用；许多可入药，也可能有毒。"},"examples":[{"en":"Caffeine and nicotine are common alkaloids found in coffee and tobacco.","zh":"咖啡因和尼古丁是咖啡和烟草中常见的生物碱。"},{"en":"Some alkaloids are used in medicine to relieve pain or treat heart problems.","zh":"一些生物碱用于医疗，例如缓解疼痛或治疗心脏问题。"},{"en":"Because certain alkaloids can be poisonous, dosage matters.","zh":"由于某些生物碱可能有毒，剂量非常关键。"}]}],"synonyms":["plant alkaloids","nitrogenous compounds"],"phonetic":"/ˈæl.kəˌlɔɪdz/","extraExplanation":["“alkaloid”源自“alkali（碱）”，因为早期研究发现这类物质常呈碱性，能与酸形成盐（因此也常以“某某盐”的形式作为药物）。","常见例子：咖啡因（caffeine）、尼古丁（nicotine）、吗啡（morphine）、奎宁（quinine）、阿托品（atropine）。它们的共同点是含氮、作用强，但并不等于“毒品”——很多是合法的日常或医疗用途物质。","学习提示：在科普或医学语境里常见搭配有 “plant alkaloids（植物生物碱）”“toxic alkaloids（有毒生物碱）”“alkaloid content（生物碱含量）”。"]}
{"word":"alkalometry","summary":{"en":"Alkalometry means measuring how alkaline a solution is, especially by titration.","zh":"Alkalometry 指测定溶液碱度（含碱量），尤其常用滴定法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the measurement of alkalinity (the amount of base/alkali) in a solution, often by titration in chemistry or water testing","zh":"碱量测定；测定溶液碱度（碱/碱性物质含量）的方法，常用滴定法用于化学或水质检测"},"examples":[{"en":"In water treatment, alkalometry is used to check whether the water can resist changes in pH.","zh":"在水处理领域，会用碱量测定来检查水是否能抵抗 pH 的变化。"},{"en":"The lab report included an alkalometry titration to determine the sample’s alkalinity.","zh":"实验报告包含一次碱量测定滴定，用于确定样品的碱度。"}]}],"synonyms":["alkalinity measurement","alkalinity determination","alkalinity titration"],"phonetic":"/ˌæl.kəˈlɑː.lə.mə.tri/","extraExplanation":["“alkalometry”是较偏专业的化学术语。词根拆解：alkali（碱）+ -metry（测量），意思就是“测碱/测碱度”。常见相关词：alkalinity（碱度）、titration（滴定）、acid-base titration（酸碱滴定）。"]}
{"word":"alkalosis","summary":{"en":"Alkalosis is an abnormally high (too alkaline) pH in the body’s fluids, especially the blood.","zh":"Alkalosis 指体液（尤其是血液）pH异常升高、过于碱性的状态，即“碱中毒”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A condition in which the body’s fluids (especially the blood) become too alkaline (the pH becomes abnormally high).","zh":"碱中毒（体液，尤其是血液，变得过于碱性，pH异常升高的状态）。"},"examples":[{"en":"The doctor suspected alkalosis after seeing the patient’s high blood pH.","zh":"医生在看到患者血液pH偏高后，怀疑是碱中毒。"},{"en":"Severe vomiting can lead to metabolic alkalosis.","zh":"严重呕吐可能导致代谢性碱中毒。"},{"en":"Hyperventilation may cause respiratory alkalosis.","zh":"过度换气可能引起呼吸性碱中毒。"}]}],"synonyms":["high blood pH","alkaline imbalance"],"phonetic":"/ˌæl.kəˈloʊ.sɪs/","extraExplanation":["“alkalosis”常与两种类型一起出现：metabolic alkalosis（代谢性碱中毒）多与胃酸丢失、利尿剂等有关；respiratory alkalosis（呼吸性碱中毒）多与过度换气导致二氧化碳下降有关。","词源上与“alkali（碱）”相关；相对概念是“acidosis（酸中毒）”。"]}
{"word":"alkalous","summary":{"en":"Alkalous (rare) means “alkaline; basic; containing alkali.”","zh":"alkalous（罕用）指“碱性的；含碱的；呈碱性”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Alkaline; containing or resembling an alkali; having a basic (not acidic) quality.","zh":"（罕用）碱性的；含碱的；呈碱性（非酸性）的。"},"examples":[{"en":"This cleaner is mildly alkalous, so it can irritate skin.","zh":"这种清洁剂略带碱性，所以可能会刺激皮肤。"},{"en":"The soil in this area is alkalous rather than acidic.","zh":"这个地区的土壤偏碱性，而不是酸性。"}]}],"synonyms":["alkaline","basic"],"phonetic":"/ˈælkələs/","extraExplanation":["“alkalous”在现代英语中非常少见，更常用的词是“alkaline”（碱性的）。","词根来自“alkali”（碱）。日常语境里，描述“酸/碱度”通常会说：acidic（酸性的）、alkaline（碱性的）。"]}
{"word":"Alkalurops","summary":{"en":"Alkalurops is a rare scientific proper name, likely used as a taxonomic (genus) label in specialized contexts rather than common English.","zh":"Alkalurops 是一个罕见的科学专名，可能用作分类学（属名）标签，主要出现在专业语境中而非日常英语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare scientific/proper name (likely a Latinized genus name) that is not used in everyday English; it most often appears in specialized biological or microbiological contexts.","zh":"一个较少见的科学/专有名词（可能是拉丁化的属名），日常英语中几乎不用；通常只在生物学或微生物学等专业语境中出现。"},"examples":[{"en":"The sample was tentatively assigned to Alkalurops based on its growth in alkaline conditions.","zh":"根据其在碱性条件下的生长表现，该样本被暂时归入 Alkalurops。"},{"en":"I couldn’t find Alkalurops in general dictionaries, so I checked scientific databases for the taxonomic name.","zh":"我在通用词典里找不到 Alkalurops，所以去科学数据库里核对这个分类学名称。"}]}],"synonyms":["(no common synonyms; depends on the specific taxon)"],"phonetic":"/ˌæl.kəˈlʊr.ɑps/","extraExplanation":["这个词不属于常见英语词汇，更像是“拉丁化学名/属名”的拼写形式。不同数据库或论文里可能存在拼写差异（例如大小写、词尾变化），建议你提供出现它的句子或截图，或告知所属领域（植物学/细菌学/真菌学等），我可以进一步确认其准确含义与规范写法。"]}
{"word":"alkalurops","summary":{"en":"“alkalurops” does not appear to be a standard English word; it is likely a misspelling (possibly of “alkalosis,” “alkaline,” or “alkalinity”).","zh":"“alkalurops”不像是标准英语词；很可能是拼写错误（可能想写“alkalosis/alkaline/alkalinity”等）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; likely a misspelling or a very rare/technical term.","zh":"不是常见英语词典中的标准词；很可能是拼写错误或极少见的专业术语。"},"examples":[{"en":"I can’t find “alkalurops” in standard dictionaries—could you check the spelling?","zh":"我在常见词典里查不到“alkalurops”——你能确认一下拼写吗？"},{"en":"If you meant “alkalosis,” it refers to blood/body fluids being too alkaline.","zh":"如果你想写的是“alkalosis（碱中毒）”，它指血液或体液碱性过高。"}]}],"synonyms":["alkalosis","alkaline","alkalinity","alkaloid"],"extraExplanation":["“alkalurops”很可能是拼写误差。你可以把原句（上下文）发我，或确认是否想写以下常见相关词：\n1) alkalosis /ˌæl.kəˈloʊ.sɪs/（碱中毒；体液过碱）\n2) alkaline /ˈæl.kəˌlaɪn/（碱性的）\n3) alkalinity /ˌæl.kəˈlɪn.ə.ti/（碱度）\n4) alkaloid /ˈæl.kəˌlɔɪd/（生物碱）\n有了语境我可以确定你真正想表达的词，并给出准确释义与例句。"]}
{"word":"alkamin","summary":{"en":"Alkamin is a rare chemistry term meaning an amine (an organic base), sometimes referring specifically to an alkanolamine.","zh":"Alkamin 是较少见的化学用词，指胺类（有机碱），有时也特指醇胺（alkanolamine）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) An organic base related to ammonia, especially an amine; in some texts, a less common spelling/short form of “alkamine/alkanolamine.”","zh":"（化学）一种与氨相关的有机碱，尤指胺类；在一些资料中也可视为“alkamine/alkanolamine（醇胺）”的不常见拼写或简写。"},"examples":[{"en":"Alkamins (amines) are widely used to make dyes, medicines, and plastics.","zh":"烷胺（胺类）广泛用于制造染料、药物和塑料。"},{"en":"This cleaner contains an alkamin that helps adjust the pH.","zh":"这种清洁剂含有一种醇胺，用来调节酸碱度（pH）。"}]}],"synonyms":["amine","alkylamine","alkanolamine","alkamine"],"phonetic":"/ˈæl.kə.miːn/","extraExplanation":["“alkamin”不是现代英语里非常常见的标准拼写。你更常会在化学语境看到：\n- **amine**（胺，最常用的总称）\n- **alkylamine**（烷基胺）\n- **alkanolamine** / **alkamine**（醇胺，含有—OH与—NH—的化合物）\n如果你是在产品成分表、说明书或某篇文章里看到“alkamin”，也可能是品牌名、德语/北欧语言的转写，或对上述术语的非标准写法。"]}
{"word":"alkamine","summary":{"en":"“Alkamine” is a rare chemistry term meaning an alkane-derived amine (sometimes an amino alcohol).","zh":"“Alkamine”是较少见的化学术语，指由烷烃衍生的胺（有时指氨基醇）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) An amine derived from an alkane; sometimes used for an amino alcohol (alkanolamine).","zh":"（化学）由烷烃衍生的胺；有时也指“氨基醇”（alkanolamine，含有—NH₂与—OH的化合物）。"},"examples":[{"en":"Some alkamines are used as building blocks to make medicines and plastics.","zh":"一些烷胺类化合物可用作合成药物和塑料的基础原料。"},{"en":"Ethanolamine is an amino alcohol that may be described as an alkamine in older texts.","zh":"乙醇胺是一种氨基醇，在较旧的文献中有时会被称作 alkamine。"}]}],"synonyms":["amine","alkanolamine (in some contexts)"],"phonetic":"/ˈæl.kə.miːn/","extraExplanation":["“alkamine”在现代英语里非常少见，更多出现在化学或旧式术语中。很多学习者其实是想查“alkaline”（意为“碱性的”）。如果你想表达“碱性/碱性溶液”，通常用 alkaline /ˈæl.kə.laɪn/。","相关常见词：amine（胺）、alkanolamine（氨基醇）、alkali（碱）。"]}
{"word":"alkanal","summary":{"en":"An alkanal is an aliphatic aldehyde (R–CHO) derived from an alkane, named with the suffix “-al.”","zh":"烷醛（alkanal）是由烷烃衍生的脂肪族醛（R–CHO），通常用“-al”作后缀命名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an aldehyde that comes from an alkane (a saturated hydrocarbon); an aliphatic aldehyde with the functional group –CHO","zh":"由烷烃衍生的醛；一种脂肪族醛，含有 –CHO（醛基）官能团"},"examples":[{"en":"Propanal is an alkanal with three carbon atoms.","zh":"丙醛（propanal）是一种含三个碳原子的烷醛。"},{"en":"In basic organic chemistry, students learn to name alkanals using the suffix “-al.”","zh":"在基础有机化学中，学生会学习用“-al”作后缀来命名烷醛。"},{"en":"Many alkanals have strong smells and are used in flavor and fragrance chemistry.","zh":"许多烷醛气味较强，常用于香精香料化学。"}]}],"synonyms":["aliphatic aldehyde"],"phonetic":"/ˈæl.kə.næl/","extraExplanation":["“alkanal”常见于有机化学命名体系中，对应一般式 R–CHO（R 为烷基）。IUPAC 命名通常把相应烷烃末尾的 -e 改为 -al：methane → methanal（甲醛），ethane → ethanal（乙醛），propane → propanal（丙醛）。","书面语或教材里有时会用更通用的说法“aliphatic aldehyde（脂肪族醛）”。不过“alkanal”更强调它来自烷烃骨架。"]}
{"word":"alkane","summary":{"en":"An alkane is a saturated hydrocarbon with only single carbon–carbon bonds (CₙH₂ₙ₊₂).","zh":"alkane 指“烷烃”，一种只含碳—碳单键的饱和烃（CₙH₂ₙ₊₂）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of hydrocarbon that has only single bonds between carbon atoms (saturated) and follows the general formula CₙH₂ₙ₊₂","zh":"烷烃：一种只含碳—碳单键的饱和烃，通式为 CₙH₂ₙ₊₂"},"examples":[{"en":"Methane is the simplest alkane.","zh":"甲烷是最简单的烷烃。"},{"en":"Alkanes are found in natural gas and crude oil.","zh":"烷烃存在于天然气和原油中。"},{"en":"Because alkanes are saturated, they are generally less reactive than alkenes.","zh":"由于烷烃是饱和的，它们通常比烯烃更不活泼。"}]}],"synonyms":["paraffin (hydrocarbon)"],"phonetic":"/ˈæl.keɪn/","extraExplanation":["“alkane”来自“alk-”（表示碳链）+ “-ane”（有机化学命名中表示烷烃的一类后缀）。常见烷烃名称多以 -ane 结尾：methane（甲烷）、ethane（乙烷）、propane（丙烷）、butane（丁烷）。","学习时可和相关词对比：alkene（烯烃，含至少一个双键，通式常见为 CₙH₂ₙ）与 alkyne（炔烃，含至少一个三键，通式常见为 CₙH₂ₙ₋₂）。"]}
{"word":"alkanes","summary":{"en":"Alkanes are saturated hydrocarbons with only single C–C bonds (CₙH₂ₙ₊₂).","zh":"烷烃是只含碳—碳单键的饱和烃（CₙH₂ₙ₊₂）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of hydrocarbons that contain only single carbon–carbon bonds (saturated compounds). Their general formula is CₙH₂ₙ₊₂.","zh":"烷烃：只含碳—碳单键的烃类（饱和化合物）。通式为 CₙH₂ₙ₊₂。"},"examples":[{"en":"Methane and ethane are alkanes.","zh":"甲烷和乙烷是烷烃。"},{"en":"Alkanes usually burn to produce carbon dioxide and water.","zh":"烷烃通常燃烧生成二氧化碳和水。"},{"en":"Compared with alkenes, alkanes are less reactive because they have only single bonds.","zh":"与烯烃相比，烷烃因只有单键而通常较不活泼。"}]}],"synonyms":["paraffins","saturated hydrocarbons"],"phonetic":"/ˈæl.keɪnz/","extraExplanation":["“alkane”这个名称来自“alk-”（与酒精/烃类命名相关的词根）+“-ane”（表示单键饱和烃的后缀）。常见烷烃的英文名多以“-ane”结尾，如 methane（甲烷）、propane（丙烷）、butane（丁烷）。","在日常语境里，烷烃与燃料关系密切：天然气主要是甲烷（methane），液化石油气（LPG）常含丙烷（propane）和丁烷（butane）。"]}
{"word":"alkanet","summary":{"en":"Alkanet is a plant whose root produces a red dye; it can also mean the dye itself.","zh":"Alkanet 指能从根部提取红色染料的紫草，也可指这种紫草染料本身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant (especially *Alkanna tinctoria*) whose roots produce a red dye used to color oils, cosmetics, and some foods","zh":"紫草（尤指染料紫草 *Alkanna tinctoria*）；其根可提取红色染料，用于给油脂、化妆品及部分食品上色"},"examples":[{"en":"Traditionally, alkanet root was used to dye ointments and lip balm a reddish color.","zh":"传统上，人们用紫草根把药膏和润唇膏染成偏红的颜色。"},{"en":"Some cheesemakers color their cheese with alkanet to create a warm orange-red tone.","zh":"有些奶酪制作者会用紫草给奶酪上色，做出温暖的橙红色调。"}]},{"partOfSpeech":"n.","definition":{"en":"the red coloring (dye) made from the root of the alkanet plant","zh":"（由紫草根制成的）红色染料；紫草染料"},"examples":[{"en":"The recipe calls for a few drops of alkanet-infused oil for color.","zh":"这个配方需要滴几滴用紫草浸泡过的油来上色。"},{"en":"The soap turned pink after the maker added alkanet.","zh":"制皂者加入紫草染料后，肥皂变成了粉红色。"}]}],"synonyms":["alkanet root","Alkanna tinctoria","dyer’s alkanet","red dye (contextual)"],"phonetic":"/ˈæl.kə.nɛt/","extraExplanation":["“Alkanet”常见于草本、手工皂、护肤品与天然染色的语境中，尤其指用紫草根浸泡在油里（alkanet-infused oil）来取色。","词源上与阿拉伯语中表示“朱红/指甲花类染色”的词有关，因此常与“天然染料、古法上色”联系在一起。","学习时注意不要与“alkali（碱）”“alkane（烷烃）”混淆：拼写相近但意义完全不同。"]}
{"word":"alkanethiol","summary":{"en":"An alkanethiol is a thiol (R–SH) where R is an alkyl group, often known for strong odors and for bonding to metal surfaces like gold.","zh":"烷硫醇是 R–SH 型硫醇，其中 R 为烷基，常以气味强烈和易与金等金属表面结合而著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An organic sulfur compound (a thiol) with the general formula R–SH, where R is an alkyl group (an “alkane-like” carbon chain). Alkanethiols often have strong odors and can bond to metal surfaces such as gold.","zh":"一种有机含硫化合物（硫醇），通式为 R–SH，其中 R 为烷基（类似烷烃的碳链）。烷硫醇常有较强气味，并且能与金等金属表面结合。"},"examples":[{"en":"Ethanethiol is a simple alkanethiol with a noticeable smell.","zh":"乙硫醇是一种简单的烷硫醇，气味很明显。"},{"en":"Researchers used an alkanethiol layer on gold to form a self-assembled monolayer (SAM).","zh":"研究人员在金表面使用烷硫醇层来形成自组装单分子层（SAM）。"}]}],"synonyms":["thiol (when R is alkyl)","mercaptan","alkyl thiol"],"phonetic":"/ælˌkeɪnˈθaɪɔl/","extraExplanation":["“alkanethiol”由 alkane（烷烃）+ thiol（硫醇，–SH 官能团）组成，强调 R 基团是“烷基”。在旧文献中，硫醇类也常被称为“mercaptans（硫醇/硫代醇）”。","在表面科学中，烷硫醇常用于在金表面构筑有序的有机薄层（SAM），因为 –SH 与金表面有较强的结合倾向。"]}
{"word":"alkanets","summary":{"en":"Alkanets means alkanet plants or the red dye made from their roots.","zh":"Alkanets 指紫草类植物（或其根）以及由其根制成的红色染料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of alkanet: plants (especially in the borage family) whose roots can produce a deep red dye, or the dye made from those roots.","zh":"alkanet 的复数：指（多为紫草科的）染料植物，尤指其根可提取深红色染料的植物；也可指由其根制成的红色染料。"},"examples":[{"en":"Historically, alkanets were used to dye oils and ointments a reddish color.","zh":"历史上，人们用 alkanets 给油和药膏染成偏红的颜色。"},{"en":"The recipe mentions alkanets to tint the mixture naturally.","zh":"这份配方提到用 alkanets 来让混合物呈现天然色泽。"}]}],"synonyms":["alkanet","alkanet root","red dye (from alkanet)"],"phonetic":"/ˈæl.kə.nɛts/","extraExplanation":["“Alkanet”在英语里常见的具体指代包括：染料紫草（dyer’s alkanet, Alkanna tinctoria）及与“紫草根染料”相关的材料。日常阅读中更常见的搭配是 alkanet root（紫草根）或 alkanet dye（紫草染料）。","在传统工艺里，alkanet 常用于给油脂类（如油、蜡、软膏）着色；在现代语境中也可能出现在草本/手工护肤品或天然染色的介绍中。"]}
{"word":"Alkanna","summary":{"en":"Alkanna is a plant (especially *Alkanna tinctoria*) known for its root-based red dye, also referring to the dye itself.","zh":"Alkanna 指一种（尤指染料紫草）可从根部提取红色染料的植物，也可指这种红色染料本身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant (genus *Alkanna*, especially *Alkanna tinctoria*) whose roots can produce a red coloring; often associated with the dye known as alkanet.","zh":"一种植物（紫草属 *Alkanna*，尤指染料紫草 *Alkanna tinctoria*），其根可提取红色染料；常与“紫草红/阿尔卡奈特黄”（alkanet dye）相关。"},"examples":[{"en":"Alkanna tinctoria has been used for centuries to make a natural red dye.","zh":"几个世纪以来，人们一直用染料紫草（*Alkanna tinctoria*）来制作天然红色染料。"},{"en":"The oil was colored with alkanna root extract.","zh":"这种油用紫草属植物根部提取物上了色。"}]},{"partOfSpeech":"n.","definition":{"en":"the reddish dye or pigment obtained from the root of an alkanna plant (often called alkanet).","zh":"从紫草属植物根部获得的红色染料/色素（常称 alkanet）。"},"examples":[{"en":"Artisans sometimes use alkanna to tint soaps and balms.","zh":"手工匠人有时用紫草红给肥皂和膏霜上色。"},{"en":"The recipe mentions a small amount of alkanna for color, not flavor.","zh":"配方提到加少量紫草红是为了颜色，不是为了味道。"}]}],"synonyms":["alkanet","dyer’s alkanet","Alkanna tinctoria"],"phonetic":"/ælˈkænə/","extraExplanation":["“Alkanna/alkanet”常见于植物学、草药学与手工染色语境。它的根含有可溶于油脂的红色成分，因此常用于给油、软膏、肥皂等上色。","词源上，相关词“alkanet”常被认为经由西班牙语并追溯到阿拉伯语来源，反映了地中海地区传统染色与草药使用的传播历史。"]}
{"word":"alkanna","summary":{"en":"Alkanna is a type of flowering plant (genus Alkanna), best known because its roots can produce a red dye.","zh":"Alkanna 指紫草属植物，最广为人知的是其根可提取红色染料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant in the genus Alkanna (a group of small flowering plants in the borage family), especially one whose roots can produce a red dye.","zh":"紫草属植物（紫草科的一类开花小植物）；尤指其根部可提取红色染料的种类。"},"examples":[{"en":"Alkanna tinctoria has roots that have been used to make a natural red dye.","zh":"染料紫草（Alkanna tinctoria）的根部可用来制作天然红色染料。"},{"en":"In traditional herbal practices, alkanna was sometimes applied to color oils or ointments.","zh":"在一些传统草药做法中，alkanna 有时被用来给油或药膏上色。"}]}],"synonyms":["alkanet","Alkanna tinctoria"],"phonetic":"/ælˈkænə/","extraExplanation":["“alkanna”常见于植物学或染料相关语境；日常英语里更常见的通用名是“alkanet（紫草染料植物/紫草根染料）”。","词源上与阿拉伯语及中世纪拉丁语有关，进入英语后多用于学名/属名；其中最常被提到的是 Alkanna tinctoria（“tinctoria”意为“用于染色的”）。","学习时注意不要和“henna（海娜）”混淆：henna 通常指指甲花染料（偏橙红），而 alkanna/alkanet 更偏红紫色调，多用于给油脂、蜡、药膏、酒类等着色。"]}
{"word":"alkannin","summary":{"en":"Alkannin is a natural red-purple dye from alkanet roots, used mainly for coloring oils/cosmetics and for lab staining.","zh":"Alkannin 是从紫草（alkanet）根部得到的红紫色天然色素，常用于给油脂/化妆品上色，也可用于实验室染色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a red-purple natural dye (a pigment) obtained from the roots of the alkanet plant, used to color oils, ointments, cosmetics, and in some laboratory staining.","zh":"从紫草属（alkanet）植物根部提取的红紫色天然染料（色素），用于给油脂、软膏、化妆品上色，也用于实验室染色。"},"examples":[{"en":"Traditional lip balms sometimes use alkannin to create a natural reddish tint.","zh":"一些传统润唇膏会用 alkannin 来做出天然的偏红色调。"},{"en":"The researcher dissolved alkannin in oil to test how stable the color was over time.","zh":"研究人员把 alkannin 溶于油中，以测试颜色随时间变化的稳定性。"}]}],"synonyms":["alkanet dye","natural red pigment"],"phonetic":"/ælˈkænɪn/","extraExplanation":["alkannin 常与“shikonin（紫草素）”一起被提到：两者是结构非常相近的天然色素，来源植物也相近，因此在文献与产品成分表里容易混淆。","词源上来自植物名“alkanet（紫草/染料紫草）”；它在油脂中更易溶解，因此常用于油膏、护肤油等配方来“浸泡上色”。"]}
{"word":"alkanol","summary":{"en":"An alkanol is an alcohol with an –OH group attached to a saturated (alkane) carbon chain, such as methanol or ethanol.","zh":"alkanol 指烷醇：羟基 –OH 连在饱和碳链（烷烃骨架）上的醇类，例如甲醇、乙醇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An alcohol that is derived from an alkane; a compound with an –OH (hydroxyl) group attached to a saturated carbon chain (general formula: CnH2n+1OH).","zh":"烷醇；由烷烃衍生的醇类化合物，特点是在饱和碳链上连接一个 –OH（羟基）（通式：CnH2n+1OH）。"},"examples":[{"en":"Ethanol is an alkanol used in fuels, medicines, and beverages.","zh":"乙醇是一种烷醇，用于燃料、药品以及酒类饮品中。"},{"en":"In organic chemistry, methanol and propanol are common examples of alkanols.","zh":"在有机化学中，甲醇和丙醇是常见的烷醇例子。"}]}],"synonyms":["aliphatic alcohol","alkyl alcohol","alcohol (general term)"],"phonetic":"/ˈæl.kə.nɔl/","extraExplanation":["“alkanol”更常见于化学语境；日常英语里通常直接说“alcohol”（醇/酒精）或具体名称如“ethanol（乙醇）”。","命名上可以理解为“alkane（烷烃）+ -ol（醇类后缀）”：例如 ethane（乙烷）→ ethanol（乙醇）。","烷醇可按羟基所在碳原子类型分为一级（primary）、二级（secondary）、三级（tertiary）醇，这会影响它们的反应性质。"]}
{"word":"Alkaphrah","summary":{"en":"“Alkaphrah” is not a common English word; it is likely a transliterated proper name or foreign term.","zh":"“Alkaphrah”不是常见英语词，更可能是外来词或专名的转写形式。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare/nonstandard word in English; most likely a transliteration (romanization) of a name or term from another language (often Arabic). In English use, it would typically function as a proper noun (a person’s name, a place name, or a brand).","zh":"英语中非常少见/不规范的词；更可能是其他语言（常见为阿拉伯语等）的音译/转写形式。在英语语境里通常作为专有名词使用（人名、地名或品牌名）。"},"examples":[{"en":"I couldn’t find a standard English dictionary entry for “Alkaphrah”; it may be a name from another language.","zh":"我在标准英语词典里找不到“Alkaphrah”；它可能是来自其他语言的人名。"},{"en":"Is Alkaphrah the name of a person, a place, or a company? Context will help clarify the meaning.","zh":"Alkaphrah 是人名、地名还是公司名？提供语境会更容易确定意思。"}]}],"phonetic":"ˌæl.kəˈfrɑː","extraExplanation":["“Alkaphrah”看起来像是把非英语词用拉丁字母拼出来的写法（转写/音译）。不同转写体系会导致拼法差异很大（例如同一个阿拉伯语词根可能出现多种拼写）。","如果你能告诉我它出现的场景（例如一句话、来源国家/语言、是否为人名或地名），我可以更准确地判断含义、更自然的英文用法，以及可能的正确拼写。"]}
{"word":"alkaphrah","summary":{"en":"“alkaphrah” is not recognized as a standard English word; it’s likely a name/transliteration or a misspelling.","zh":"“alkaphrah”不是标准英语词；更可能是姓名/音译词或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username, or a transliteration of a name/word from another language (for example, Arabic).","zh":"不是标准英语词汇。可能是拼写错误、用户名，或来自其他语言（例如阿拉伯语）的音译/姓名。"},"examples":[{"en":"I couldn’t find “alkaphrah” in an English dictionary—could you share a sentence where you saw it?","zh":"我在英语词典里找不到“alkaphrah”——你能提供它出现的句子吗？"},{"en":"Is “alkaphrah” a person’s name, a place name, or a brand?","zh":"“alkaphrah”是人名、地名，还是品牌名？"}]}],"phonetic":"ˌæl.kəˈfrɑː","extraExplanation":["这个词看起来更像“音译拼写”（把另一种语言的发音用拉丁字母写出来），而不是英语本身的单词。音译常见于人名、地名、宗教/文化术语、社交账号等。","如果你告诉我来源（在哪本书/网站/游戏里看到）、语言背景，或贴出前后句，我可以帮你判断它可能对应的正确拼写与含义，并给出更准确的发音与用法。"]}
{"word":"alkapton","summary":{"en":"Alkapton is a dark substance linked to alkaptonuria, formed when certain urine chemicals oxidize.","zh":"Alkapton 指与黑尿症相关的一种深色物质，由尿液中特定化合物氧化形成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a dark pigment-like substance formed when a compound in urine (homogentisic acid) oxidizes; associated with the rare genetic condition alkaptonuria","zh":"一种深色、类似色素的物质，由尿液中的一种化合物（黑尿酸/尿黑酸，即 homogentisic acid）氧化后形成；与罕见遗传病“黑尿症（alkaptonuria）”有关"},"examples":[{"en":"In alkaptonuria, alkapton can turn urine dark after it stands in the air.","zh":"在黑尿症中，尿液静置接触空气后，形成的 alkapton 会让尿液变黑。"},{"en":"Researchers studied how alkapton builds up in connective tissue over time.","zh":"研究人员研究了 alkapton 如何随着时间在结缔组织中累积。"}]}],"synonyms":["dark pigment (contextual)","oxidation pigment (contextual)"],"phonetic":"/ælˈkæp.tɑn/","extraExplanation":["这个词主要出现在医学与生化语境里，日常英语中几乎不会用到。更常见、也更规范的相关词是 alkaptonuria（黑尿症）。","词源上，alkapton 与“alkali（碱）/kapto-（抓住、结合）”这类早期化学命名习惯有关；历史上用来指代与黑尿症相关、会氧化变暗的物质。"]}
{"word":"alkaptone","summary":{"en":"“Alkaptone” is a dark pigment-like substance associated with alkaptonuria, formed from oxidized homogentisic acid.","zh":"“alkaptone”指与黑尿症有关的深色（色素样）物质，多由尿黑酸氧化后形成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A dark substance (a type of polymer) that can form from homogentisic acid and may appear in the urine and tissues of people with alkaptonuria.","zh":"一种深色物质（可视为由尿黑酸聚合形成的聚合物），在患有“黑尿症/尿黑酸症”（alkaptonuria）的人体尿液或组织中可能出现。"},"examples":[{"en":"In alkaptonuria, excess homogentisic acid can oxidize and form alkaptone pigments.","zh":"在黑尿症中，过量的尿黑酸可能氧化并形成深色的 alkaptone 色素。"},{"en":"Doctors may suspect alkaptone when a patient's urine darkens after standing.","zh":"如果病人的尿液静置后变黑，医生可能会怀疑与 alkaptone 相关的沉积物。"}]}],"synonyms":["pigment","deposit","oxidation product","alkaptonuria-related pigment"],"phonetic":"/ælˈkæp.toʊn/","extraExplanation":["“alkaptone”在现代医学英语中不算常用词，更常见的相关词是“alkaptonuria（黑尿症/尿黑酸症）”和“homogentisic acid（尿黑酸）”。你可能是在文献里看到它，用来指尿黑酸氧化后产生的黑褐色色素/沉积物。","词源上与“alkaptonuria”同源：早期研究者用来描述“能吸收碱（alkali-）”相关的化学行为，后来这个病名沿用下来。如今更多用化学名（homogentisic acid）来精确表达。"]}
{"word":"alkaptonuria","summary":{"en":"Alkaptonuria is a rare inherited disorder that can cause dark urine and later joint/tissue problems.","zh":"黑尿症是一种罕见的遗传病，可导致尿液变黑，并在后期出现关节/组织问题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare genetic disorder in which the body cannot fully break down a substance called homogentisic acid, causing it to build up; this can lead to dark urine and, over time, joint and tissue damage","zh":"一种罕见的遗传性疾病，身体无法完全分解“尿黑酸（homogentisic acid）”，导致其在体内累积；可出现尿液变黑，并在长期内引发关节与组织损伤"},"examples":[{"en":"Alkaptonuria can cause urine to turn dark when it is exposed to air.","zh":"黑尿症会使尿液在接触空气后变黑。"},{"en":"Because it is inherited, doctors may ask about family history when diagnosing alkaptonuria.","zh":"由于它是遗传性的，医生在诊断黑尿症时可能会询问家族史。"},{"en":"In some adults with alkaptonuria, joint pain appears later in life.","zh":"一些患黑尿症的成年人会在较晚的年龄出现关节疼痛。"}]}],"synonyms":["black urine disease","alkaptonuria (AKU)"],"phonetic":"/ˌæl.kæp.təˈn(j)ʊr.i.ə/","extraExplanation":["词源提示：alka- 与“碱（alkali）”相关；-ton- 来自“to turn（变成）”；-uria 指“尿液情况/尿中含某物”。整体可理解为“尿液变暗/变黑的情况”。","背景知识：黑尿症常被归为“先天代谢异常/遗传代谢病”，较典型的表现之一是尿液放置后颜色加深；长期尿黑酸沉积还可能造成软骨、结缔组织变色与退变（有时称为 ochronosis）。这些属于医学科普信息，具体诊疗需由医生评估。"]}
{"word":"alkaptonuric","summary":{"en":"“Alkaptonuric” means “related to or affected by alkaptonuria (black urine disease).”","zh":"“alkaptonuric”意为“与黑尿症有关的；患黑尿症的（医学用语）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or affected by alkaptonuria (a rare inherited disorder that can cause dark urine and tissue darkening).","zh":"与黑尿症（alkaptonuria，一种罕见的遗传性疾病，可能导致尿液变黑及组织色素沉着）有关的；患有黑尿症的。"},"examples":[{"en":"The doctor noted alkaptonuric changes in the patient’s joints.","zh":"医生注意到患者关节出现了与黑尿症相关的改变。"},{"en":"An alkaptonuric patient may have urine that darkens after standing.","zh":"黑尿症患者的尿液静置后可能会变深。"}]}],"synonyms":["related to alkaptonuria","affected by alkaptonuria"],"phonetic":"/ˌæl.kæp.toʊˈnʊr.ɪk/","extraExplanation":["“alkaptonuric”来自疾病名“alkaptonuria（黑尿症）”。它通常用于医学语境，描述“与该病有关的表现/特征”，如关节、软骨的色素沉着（ochronosis）以及随年龄出现的关节问题。","黑尿症是一种罕见的常染色体隐性遗传病，常与体内某种代谢相关物质（如homogentisic acid，尿黑酸）积累有关；因此会出现“尿液放久变黑”等典型线索。"]}
{"word":"alkargen","summary":{"en":"“Alkargen” is not a recognized common English word; it is likely a misspelling or a proper/specialized name.","zh":"“alkargen”不是常见英语词；更可能是拼写错误或专有/专业名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it may be a misspelling, a brand/product name, or a specialized term.","zh":"不是标准英语词；可能是拼写错误、品牌/产品名，或某个专业领域术语。"},"examples":[{"en":"I couldn’t find “alkargen” in common English dictionaries—could you share the sentence you saw it in?","zh":"我在常见英语词典里查不到“alkargen”——你能把它出现的句子发我吗？"},{"en":"Did you mean “alkaline” or “alkane”?","zh":"你想写的是“alkaline（碱性的）”还是“alkane（烷烃）”吗？"}]}],"extraExplanation":["“alk-”这个开头在英语里常见于化学相关词（如 alkali 碱、alkaline 碱性的、alkane 烷烃）。但“alkargen”本身不属于常见词汇，也不太像标准化学名词的常见构词。","如果你能提供：1）它出现的上下文句子；2）所属领域（化学/医学/品牌/人名等）；3）是否可能有大小写（如 Alkargen）；我可以更准确地判断它的含义或最可能的正确拼写。"]}
{"word":"alkarsin","summary":{"en":"“alkarsin” is not a recognized standard English word; it’s likely a name or a misspelling.","zh":"“alkarsin”不是常见标准英语词；更可能是名字或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling, a username, a brand/product name, or a proper name (e.g., a surname).","zh":"不是标准英语词汇。更可能是拼写错误、用户名、品牌/产品名或专有名词（如姓氏）。"},"examples":[{"en":"I couldn’t find “alkarsin” in an English dictionary—could it be a name or a typo?","zh":"我在英语词典里找不到“alkarsin”——它可能是名字或拼写错误吗？"},{"en":"If you meant a chemistry term, please share the sentence where you saw “alkarsin.”","zh":"如果你指的是化学术语，请把你看到“alkarsin”的句子发我。"}]}],"phonetic":"/ælˈkɑr.sɪn/","extraExplanation":["“alkarsin”看起来像拼写变体/误拼。可能的目标词取决于语境：\n- 如果是化学相关：你可能想写 *alkarsine/alkylarsine*（有机砷化合物的一类），或与 *arsenic/arsine*（砷/砷烷）相关的词。\n- 如果是人名/网名：通常不需要翻译，只需按原拼写使用。\n把你看到它的句子、领域（游戏/化学/人名/产品等）或原文截图发来，我可以帮你定位正确词并给出准确释义。"]}
{"word":"alkarsine","summary":{"en":"Alkarsine is a rare chemistry term for an alkyl-substituted arsine (an organoarsenic compound).","zh":"Alkarsine 是一个较少见的化学词，指烷基取代的砷化氢衍生物（有机砷化合物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) An organic arsenic compound related to arsine, typically an alkyl-substituted arsine (general idea: an arsenic hydride where one or more hydrogens are replaced by an alkyl group).","zh":"（化学）一种与砷化氢（arsine）相关的有机砷化合物，通常指烷基取代的砷烷/砷化氢衍生物（大意：砷化氢中一个或多个氢被烷基取代）。"},"examples":[{"en":"Some alkarsines are extremely toxic and must be handled in a fume hood.","zh":"一些烷基砷烷（alkarsines）毒性极强，必须在通风橱中操作。"},{"en":"The paper discussed the synthesis of an alkarsine as an intermediate in organoarsenic chemistry.","zh":"该论文讨论了某种烷基砷烷作为有机砷化学中的中间体的合成。"}]}],"synonyms":["alkylarsine","organoarsine (broader)"],"phonetic":"/ælˈkɑrsiːn/","extraExplanation":["“alkarsine”是非常少见/偏专业的词，常见于较旧或更专门的有机砷化学文献中；现代写法更常用“alkylarsine（烷基砷烷）”或更具体的化学命名。","相关基础词“arsine（砷化氢，AsH3）”本身就具有高毒性；带烷基取代的同类化合物在安全规范上通常要求更严格的防护与密闭操作。"]}
{"word":"alkatively","summary":{"en":"“Talkatively” means “in a talkative way; talking a lot.”","zh":"“talkatively”表示“健谈地、话很多地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a talkative way; in a manner that involves talking a lot.","zh":"健谈地；话很多地；以爱说话的方式。"},"examples":[{"en":"She spoke talkatively during the long train ride.","zh":"在漫长的火车旅途中，她一直很健谈。"},{"en":"The children waited talkatively for the movie to start.","zh":"孩子们叽叽喳喳地等着电影开始。"}]}],"synonyms":["chattily","garrulously","volubly"],"phonetic":"/ˈtɔkətɪvli/","extraExplanation":["“alkatively”不是常见的标准拼写；你可能想写的是 **talkatively**（adv.）。","构词：talkative（健谈的，adj.）+ -ly（副词后缀）→ talkatively（健谈地）。","用法提示：这个副词常用来描述“说话的方式/氛围”（e.g., spoke/waited talkatively）。如果想表达“话太多、让人烦”，也可用 more negative 的表达，如 **chatter on**（不停唠叨）或 **ramble**（东拉西扯）。"]}
{"word":"alkedavy","summary":{"en":"“alkedavy” isn’t recognized as a standard English word; it’s likely a typo or a name/username.","zh":"“alkedavy”不是标准英语词汇；更可能是拼写错误或姓名/用户名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a name/username. If you meant a different word, please share the sentence or the correct spelling.","zh":"不是标准英语单词；更可能是拼写错误，或是姓名/用户名。如果你想查的是另一个词，请提供句子语境或正确拼写。"},"examples":[{"en":"I can’t find “alkedavy” in a standard dictionary—could you tell me where you saw it?","zh":"我在常见词典里找不到“alkedavy”——你是在哪里看到这个词的？"},{"en":"If you meant “already,” the sentence would be: “I already finished my homework.”","zh":"如果你想写的是“already（已经）”，句子可以是：“I already finished my homework.”"}]}],"extraExplanation":["“alkedavy”很像打字或拼写误差。常见的可能目标包括：\n1) already（已经）\n2) archaic/rare 的姓名、地名、网名（这种通常不进通用词典）\n\n如果你把它出现的整句发我（或告诉我它来自哪里：聊天、歌词、游戏ID、文件名等），我可以帮你更准确地判断你真正想查的词，并给出标准释义与用法。"]}
{"word":"alkekengi","summary":{"en":"Alkekengi is the Chinese lantern plant (Physalis alkekengi), known for its orange, papery, lantern-like husks around the fruit.","zh":"Alkekengi 指酸浆（Physalis alkekengi），以包裹果实的橙色纸质“灯笼”状果囊著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant (Physalis alkekengi) with small orange-red berries enclosed in a papery, lantern-shaped husk; often grown as an ornamental and sometimes called the Chinese lantern plant or winter cherry","zh":"酸浆属植物（Physalis alkekengi），果实外有纸质灯笼状的萼囊，成熟时呈橙红色；常作观赏植物，也叫“灯笼果/灯笼草（Chinese lantern plant）”或“冬樱桃（winter cherry）”"},"examples":[{"en":"Dried alkekengi husks are popular in autumn flower arrangements.","zh":"干燥的酸浆（alkekengi）“灯笼”常用于秋季花艺装饰。"},{"en":"The garden border was brightened by alkekengi’s orange lantern-like pods.","zh":"花园边缘被酸浆橙色的“灯笼”状果囊点亮了。"}]}],"synonyms":["Chinese lantern (plant)","winter cherry","Physalis alkekengi"],"phonetic":"/ˌæl.kəˈkɛn.dʒi/","extraExplanation":["词源来自拉丁语/希腊语传统植物名，现代英语里较少见，多出现在园艺、植物学或文学描写中。","虽然常被称为“Chinese lantern plant（中国灯笼草）”，但这是形状联想的俗名，并不一定指它原产中国；购买种子或花材时更常见的标签是 “Chinese lantern” 或学名 “Physalis alkekengi”。","文学中常用它来营造季节感（秋冬）、色彩意象（橙红）或“包裹/隐藏”的象征（果实被薄膜状外壳包住）。"]}
{"word":"alkene","summary":{"en":"An alkene is a hydrocarbon with at least one carbon–carbon double bond (C=C).","zh":"烯烃是至少含有一个碳碳双键（C=C）的烃类化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of hydrocarbon (a compound made only of carbon and hydrogen) that has at least one carbon–carbon double bond (C=C).","zh":"烯烃：一种只由碳和氢组成、且至少含有一个碳碳双键（C=C）的烃类化合物。"},"examples":[{"en":"Ethene is the simplest alkene, with one C=C double bond.","zh":"乙烯是最简单的烯烃，含有一个 C=C 双键。"},{"en":"Alkenes are often used to make plastics through polymerization.","zh":"烯烃常通过聚合反应用来制造塑料。"}]}],"synonyms":["olefin"],"phonetic":"/ælˈkin/","extraExplanation":["词根提示：alk- 表示“烃”（来自 alkane/alkyl 的命名体系），-ene 表示“含双键的不饱和烃”。因此 alkene 指“含至少一个双键的烃”。","对比记忆：alkane（烷烃）只含单键；alkene（烯烃）含双键；alkyne（炔烃）含三键。","常见例子：ethene（乙烯）、propene（丙烯）。这些基础烯烃在工业中常作为生产聚乙烯、聚丙烯等材料的原料。"]}
{"word":"alkenes","summary":{"en":"Alkenes are hydrocarbons with at least one C=C double bond.","zh":"Alkenes（烯烃）是至少含一个 C=C 双键的不饱和烃。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) Unsaturated hydrocarbons that contain at least one carbon–carbon double bond (C=C). An alkene is a member of this group; “alkenes” is the plural form.","zh":"（化学）含有至少一个碳—碳双键（C=C）的不饱和烃类。alkene 为单数，alkenes 为复数。"},"examples":[{"en":"Ethene and propene are simple alkenes.","zh":"乙烯（ethene）和丙烯（propene）是简单的烯烃。"},{"en":"Alkenes can react with bromine, which is often used to test for a double bond.","zh":"烯烃可以与溴发生反应，溴常用来检测是否存在双键。"},{"en":"In organic chemistry, alkenes are important starting materials for making plastics.","zh":"在有机化学中，烯烃是制造塑料的重要起始原料。"}]}],"synonyms":["olefins","unsaturated hydrocarbons"],"phonetic":"/ˈælkiːn/","extraExplanation":["“alkene”这个词来自命名规则：含双键的烃类常用后缀 -ene（如 ethene 乙烯、propene 丙烯）。相对地，只有单键的是 alkane（烷烃，-ane），含三键的是 alkyne（炔烃，-yne）。","常见反应（学习时经常出现）：加成反应（如加氢、加卤素、加水），因为双键更容易“打开”与其他原子/基团结合。"]}
{"word":"alkenna","summary":{"en":"“Alkenna” is not a standard English word; it’s usually a misspelling of “alkene” (chemistry) or “Alkanna” (a dye plant).","zh":"“alkenna”不是标准英文词；通常是把“alkene”（烯烃）或“Alkanna”（可作染料的植物）误拼出来的。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or very rare spelling; in most contexts, people mean “alkene” (a type of hydrocarbon in chemistry) or “Alkanna” (a plant name used for a red dye).","zh":"一种不规范或非常少见的拼写；多数语境下人们可能想写的是“alkene”（化学中的烯烃）或“Alkanna”（一种可提取红色染料的植物名）。"},"examples":[{"en":"I couldn’t find “alkenna” in a dictionary—did you mean “alkene”?","zh":"我在词典里找不到“alkenna”——你是不是想写“alkene”？"},{"en":"Some people mix up the spellings “Alkanna” and “alkene” and write “alkenna” by mistake.","zh":"有些人会把“Alkanna”和“alkene”的拼写弄混，误写成“alkenna”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Likely intended) “alkene”: an organic compound that has at least one carbon–carbon double bond.","zh":"（多半是想写）“alkene”：含有至少一个碳-碳双键的有机化合物（烯烃）。"},"examples":[{"en":"Ethene is the simplest alkene.","zh":"乙烯（ethene）是最简单的烯烃。"},{"en":"Alkenes often take part in addition reactions.","zh":"烯烃常常发生加成反应。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common, likely intended) “Alkanna”: a plant (alkanet) whose roots can produce a red dye used in cosmetics and traditional products.","zh":"（较少见但可能是想写）“Alkanna”：一种植物（紫草/红根草一类），其根可提取红色染料，用于化妆品和传统制品。"},"examples":[{"en":"Alkanna root has been used as a natural coloring agent.","zh":"Alkanna 的根曾被用作天然着色剂。"},{"en":"The balm gets its reddish color from Alkanna dye.","zh":"这款香膏的微红色来自 Alkanna 染料。"}]}],"synonyms":["alkene","Alkanna","alkanet"],"phonetic":"/ælˈkɛnə/","extraExplanation":["“alkenna”本身不是常见标准英文词，最常见的情况是拼写误差：把化学词“alkene”和植物名“Alkanna”混在一起写了。","如果你能告诉我你看到它的句子/领域（化学、生物、化妆品、染料等），我可以帮你确认到底应该用哪个词，并给出更贴近语境的例句。"]}
{"word":"alkenyl","summary":{"en":"Alkenyl is a chemistry term for a substituent (or adjective) related to alkenes and containing a C=C double bond, such as vinyl or allyl.","zh":"Alkenyl 是化学术语，指与烯烃相关、含 C=C 双键的取代基（或“烯基的”形容词用法），如乙烯基或烯丙基。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Organic chemistry) Relating to, or derived from, an alkene; containing a carbon–carbon double bond (C=C) in a substituent group.","zh":"（有机化学）烯基的；与烯烃有关或由烯烃衍生的；指含有碳-碳双键（C=C）的取代基。"},"examples":[{"en":"An alkenyl side chain can make the molecule more reactive in addition reactions.","zh":"烯基侧链会让分子在加成反应中更容易发生反应。"},{"en":"The drug candidate includes an alkenyl group that can be hydrogenated.","zh":"该候选药物含有可被加氢的烯基基团。"}]},{"partOfSpeech":"n.","definition":{"en":"(Organic chemistry) An alkenyl group: a substituent derived from an alkene by removing one hydrogen atom (e.g., vinyl, allyl).","zh":"（有机化学）烯基：由烯烃去掉一个氢原子得到的取代基（如乙烯基、烯丙基）。"},"examples":[{"en":"Vinyl is a common alkenyl used in polymer chemistry.","zh":"乙烯基是聚合物化学中常见的烯基。"},{"en":"The reaction attaches an alkenyl to the aromatic ring.","zh":"该反应把一个烯基接到芳香环上。"}]}],"synonyms":["olefinic","alkene-derived"],"phonetic":"ælˈkiːnɪl","extraExplanation":["“alkenyl”由“alkene（烯烃）+ -yl（表示取代基的后缀）”组成。很多化学名词里，-yl 表示“从某个母体分子去掉一个氢后形成的基团”，例如 methyl（甲基）来自 methane（甲烷）。","常见的烯基例子：vinyl（乙烯基，CH2=CH–）和 allyl（烯丙基，CH2=CH–CH2–）。它们常出现在材料（塑料、树脂）与有机合成语境中。"]}
{"word":"alkermes","summary":{"en":"“Alkermes” is most commonly a biopharmaceutical company name; it can also refer to a traditional sweet red liqueur.","zh":"“Alkermes”最常见是生物制药公司的名称；也可指一种传统的甜红色利口酒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a biopharmaceutical company name (Alkermes), known for developing medicines for conditions such as mental health and addiction.","zh":"一家生物制药公司的名称（Alkermes），以研发精神健康、成瘾等领域的药物而闻名。"},"examples":[{"en":"Alkermes is a biopharmaceutical company with products used in mental health care.","zh":"Alkermes 是一家生物制药公司，其产品用于精神健康护理。"},{"en":"She read an Alkermes press release about a new clinical trial.","zh":"她读了一份 Alkermes 关于新临床试验的新闻稿。"}]},{"partOfSpeech":"n.","definition":{"en":"(also spelled alkermes/alkermès) a traditional sweet red liqueur flavored with spices and historically colored with a red dye.","zh":"（也拼作 alkermes/alkermès）一种传统的甜红色利口酒，带香料风味，历史上常用红色染料着色。"},"examples":[{"en":"The old recipe called for a splash of alkermes to add color and aroma.","zh":"这道古老的配方需要加一点 alkermes 来增添颜色和香气。"},{"en":"In some Italian desserts, alkermes is used to moisten cakes.","zh":"在一些意大利甜点中，会用 alkermes 来浸润蛋糕。"}]}],"phonetic":"/ælˈkɝmiz/","extraExplanation":["“alkermes”这个词与一种历史上的红色染料有关：来自阿拉伯语词源（类似 al-qirmiz），指“胭脂虫/虫红”（kermes）所制的红色染料。传统利口酒 alkermes 之所以呈红色，也与这种染色传统有关。"]}
{"word":"Alkes","summary":{"en":"“Alkes” is most commonly an Indonesian abbreviation meaning medical devices/equipment; it is not standard English.","zh":"“Alkes”多为印尼语缩写，意为医疗器械/设备；并非标准英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal, Indonesia) an abbreviation for “alat kesehatan,” meaning medical devices or medical equipment.","zh":"（印尼口语）“alat kesehatan”的缩写，指医疗器械、医疗设备。"},"examples":[{"en":"Our company supplies alkes such as masks, syringes, and thermometers.","zh":"我们公司供应口罩、注射器、体温计等医疗器械（alkes）。"},{"en":"The clinic needs new alkes before opening.","zh":"诊所在开业前需要新的医疗设备（alkes）。"}]},{"partOfSpeech":"other","definition":{"en":"As an English word, “Alkes” is usually a name or a local abbreviation, not standard English vocabulary.","zh":"作为英语词汇，“Alkes”通常是人名/品牌名或地方性缩写，并非标准英语单词。"},"examples":[{"en":"I saw “Alkes” on the invoice—do you mean medical equipment?","zh":"我在发票上看到“Alkes”——你是指医疗设备吗？"}]}],"synonyms":["medical devices","medical equipment","medical supplies"],"phonetic":"/ˈælkeɪz/","extraExplanation":["在印尼商业与医疗领域，“alkes”很常见，常出现在招标、发票、采购清单中。正式写法多为“Alkes/ALKES”，全称是“alat kesehatan”。如果你是在英语语境里遇到它，通常需要在首次出现时解释为“medical devices/medical equipment”。"]}
{"word":"alkes","summary":{"en":"“alkes” is not standard English; it’s commonly an Indonesian abbreviation meaning medical devices/equipment.","zh":"“alkes”不是标准英语；常见为印尼语缩写，表示医疗器械/医疗设备。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as an Indonesian abbreviation for “alat kesehatan” (medical devices/equipment).","zh":"不是标准英语单词；最常见于印尼语中，作“alat kesehatan”的缩写，意为“医疗器械/医疗设备”。"},"examples":[{"en":"The shop sells alkes such as thermometers and blood pressure monitors.","zh":"这家店卖一些“alkes”（医疗器械），比如体温计和血压计。"},{"en":"Please check the alkes inventory before ordering new supplies.","zh":"请在订购新物资前先检查医疗器械（alkes）的库存。"}]}],"synonyms":["medical equipment","medical devices","medical supplies"],"phonetic":"/ˈælkeɪz/","extraExplanation":["“alkes”在英语语料中非常少见，通常不是英语词汇，而是印尼语缩写（alat kesehatan）。如果你是在英文化学语境里看到，可能是把“alkenes（烯烃）”或“alkanes（烷烃）”拼错了。你可以告诉我你看到它的句子/上下文，我可以帮你确认具体想表达哪个词。"]}
{"word":"Alkhimovo","summary":{"en":"Alkhimovo is a Russian place name, referring to a locality near Moscow (and sometimes a nearby station with the same name).","zh":"Alkhimovo 是俄罗斯的地名，指莫斯科附近的一个居民点（有时也指同名车站）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun), used for a settlement/village area near Moscow, Russia; it may also refer to a nearby railway stop/station with the same name.","zh":"地名（专有名词）：俄罗斯莫斯科附近的一个居民点/村庄名称；也可能指同名的铁路停靠点/车站。"},"examples":[{"en":"She lives in Alkhimovo, not far from Moscow.","zh":"她住在阿尔希莫沃（Alkhimovo），离莫斯科不远。"},{"en":"Get off at Alkhimovo station and walk ten minutes.","zh":"在 Alkhimovo 站下车，步行十分钟。"}]}],"synonyms":["(no true synonyms; it is a proper place name)"],"phonetic":"/ɑlˈkiməvoʊ/","extraExplanation":["“Alkhimovo”多见于英文对俄语地名“Алхимово”的转写（transliteration），属于专有名词，通常不翻译含义而是音译。","英语里地名的重音常随原语或英语习惯而变化；在口语中你也可以把它读得更“按字母来”，只要前后一致即可。","写作时常用作地点状语：in Alkhimovo / near Alkhimovo；如果指车站可说 Alkhimovo station/stop。"]}
{"word":"alkide","summary":{"en":"“Alkide” is usually a misspelling of “alkyd,” a resin used in paints and varnishes.","zh":"「alkide」多半是「alkyd」的拼寫誤差，指用於油漆、清漆等的醇酸樹脂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) An alkyd resin: a synthetic resin made from alcohols and acids, commonly used in paints and varnishes.","zh":"（化學）醇酸樹脂：由醇類與酸類製成的合成樹脂，常用於油漆與清漆。"},"examples":[{"en":"Alkyd paints are popular because they dry to a hard, glossy finish.","zh":"醇酸樹脂油漆很受歡迎，因為乾後會形成堅硬、有光澤的表面。"},{"en":"This primer contains an alkyd resin binder for better adhesion.","zh":"這種底漆含有醇酸樹脂作為黏結劑，能提升附著力。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made of or relating to alkyd resin.","zh":"由醇酸樹脂製成的；與醇酸樹脂有關的。"},"examples":[{"en":"Use an alkyd-based enamel on the trim for durability.","zh":"為了耐用性，線板可以使用醇酸樹脂基的瓷漆。"},{"en":"Alkyd coatings are common in industrial metal protection.","zh":"醇酸樹脂塗層常見於工業金屬防護。"}]}],"synonyms":["alkyd","alkyd resin","alkyd-based resin"],"phonetic":"/ˈælkaɪd/","extraExplanation":["「alkide」在一般英語中不常見；多數情況下是把「alkyd」拼錯了。標準拼法是 alkyd。","alkyd 這個詞源自 alcohol（醇）+ acid（酸）的混成，指用醇與酸反應製成的一類樹脂。"]}
{"word":"alkies","summary":{"en":"“Alkies” is an informal, often offensive plural term meaning “alcoholics.”","zh":"“alkies”是非正式且常带冒犯性的复数说法，意思是“酒精成瘾者/酒鬼（alcoholics）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, often offensive) People who are addicted to alcohol; alcoholics.","zh":"（非正式用语，常带冒犯性）酗酒成瘾的人；酒鬼（酒精成瘾者）。"},"examples":[{"en":"The article criticized how the film showed “alkies” as jokes instead of treating addiction seriously.","zh":"那篇文章批评这部电影把“alkies（酒鬼）”当笑料，而不是严肃对待成瘾问题。"},{"en":"Please don’t call people “alkies”—it can be hurtful; say “people with alcohol addiction” or “alcoholics.”","zh":"别把人叫作“alkies”，这可能伤人；可以说“有酒精成瘾的人”或“alcoholics（酒精成瘾者）”。"}]}],"synonyms":["alcoholics","people with alcohol addiction","people with alcohol use disorder"],"phonetic":"/ˈælki/","extraExplanation":["“alkies”来自俚语“alky”（alcoholic 的缩写）。在很多语境中它带有嘲讽、贬低色彩，因此在正式写作或尊重当事人的交流中应避免使用。更中性的说法包括：“alcoholic”（较直接），“a person with alcohol addiction / alcohol use disorder”（更强调人而非标签）。"]}
{"word":"alkin","summary":{"en":"“Alkin” is a nonstandard spelling sometimes used for “alkyne,” a hydrocarbon with a C≡C triple bond.","zh":"“alkin”是非标准拼写，有时被用来指“alkyne（炔烃）”，即含C≡C三键的烃。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(nonstandard) an alkyne; a type of hydrocarbon that contains at least one carbon–carbon triple bond (C≡C).","zh":"（非标准用法）同 alkyne（炔烃）；一种至少含有一个碳—碳三键（C≡C）的烃。"},"examples":[{"en":"In some notes, “alkin” is used to mean an alkyne like ethyne (acetylene).","zh":"在一些笔记里，“alkin”被用来表示炔烃，比如乙炔（acetylene）。"},{"en":"Alkynes (sometimes written as “alkins” in other languages) are unsaturated hydrocarbons.","zh":"炔烃（在一些其他语言里有时写作“alkins”）是不饱和烃。"}]}],"synonyms":["alkyne"],"phonetic":"ˈælkaɪn","extraExplanation":["“alkin”在标准英语里很少用，更多见于其他语言的影响或非正式拼写；在英语化学语境中通常写作 **alkyne**（复数 **alkynes**）。","英语化学命名中：**alkane**（烷烃，单键），**alkene**（烯烃，双键），**alkyne**（炔烃，三键）。学习/写作时建议使用这些标准形式以避免误解。"]}
{"word":"alkine","summary":{"en":"“Alkine” is commonly a misspelling of **alkyne**: a hydrocarbon with a C≡C triple bond.","zh":"“alkine”常见为 **alkyne** 的误拼：指含 C≡C 碳碳三键的炔烃。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of hydrocarbon (organic compound) that has at least one carbon–carbon triple bond (C≡C); alkynes are “unsaturated” and often appear in basic chemistry.","zh":"炔烃：一种含至少一个碳—碳三键（C≡C）的烃类（有机化合物）；属于“不饱和”化合物，常见于基础化学中。"},"examples":[{"en":"Ethyne (acetylene) is the simplest alkine/alkyne.","zh":"乙炔（acetylene）是最简单的炔烃。"},{"en":"In organic chemistry, alkynes can undergo addition reactions at the triple bond.","zh":"在有机化学中，炔烃可以在三键处发生加成反应。"}]}],"synonyms":["alkyne"],"phonetic":"/ˈælkaɪn/","extraExplanation":["“alkine”通常是拼写错误，更常见、标准的拼写是 **alkyne**（读音相同）。与 **alkane（烷烃，单键）**、**alkene（烯烃，双键）** 一起记：-ane 单键，-ene 双键，-yne 三键。","常见例子：ethyne/acetylene（乙炔）；带三键的结构常写作 C≡C。"]}
{"word":"alkines","summary":{"en":"Alkynes are hydrocarbons that contain a carbon–carbon triple bond.","zh":"炔烃是含有碳—碳三键的烃类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A type of hydrocarbon that has at least one carbon–carbon triple bond (C≡C). Alkynes are unsaturated compounds.","zh":"（化学）含有至少一个碳—碳三键（C≡C）的烃类。炔烃属于不饱和化合物。"},"examples":[{"en":"Ethyne (acetylene) is the simplest alkyne, with the formula C₂H₂.","zh":"乙炔（acetylene）是最简单的炔烃，化学式为 C₂H₂。"},{"en":"Alkynes often react by adding atoms across the triple bond.","zh":"炔烃常通过在三键上发生加成反应。"}]}],"synonyms":["acetylenes (sometimes used in older or specialized contexts)"],"phonetic":"/ˈælkaɪnz/","extraExplanation":["你输入的“alkines”更常见的正确拼写是“alkynes”（炔烃）。在有机化学里，常见的三类烃是：alkanes（烷烃，单键）、alkenes（烯烃，双键）、alkynes（炔烃，三键）。","词源提示：前缀“alk-”与“alkane/alkene/alkyne”同源，后缀“-yne”常用来表示含三键的化合物。"]}
{"word":"alkitran","summary":{"en":"Alkitran is a less-common loanword meaning tar—a thick, black, sticky substance used for sealing or waterproofing.","zh":"Alkitran 是较少见的外来词，意思是“焦油”，一种黑色黏稠物质，常用于密封或防水。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a dark, thick, sticky substance (tar), used for waterproofing or sealing; in some regions this word is used as a local/loanword form of “tar.”","zh":"一种黑色、浓稠、黏性的物质（焦油），用于防水或密封；在一些地区该词作为“tar（焦油）”的外来/地方用语出现。"},"examples":[{"en":"The fishermen coated the boat’s wood with alkitran to keep water out.","zh":"渔民用 alkitran 涂在船的木头上来防水。"},{"en":"The road repair used a tar-like material—sometimes called alkitran in older or regional speech.","zh":"修路时用了一种像焦油的材料——在较老或某些地区的说法里有时叫 alkitran。"}]}],"synonyms":["tar","pitch","bitumen"],"phonetic":"/ˌælkiˈtræn/","extraExplanation":["“alkitran”常被视为西班牙语“alquitrán（焦油）”的拼写变体/转写形式；在英语里并不是非常常见，通常只会在地区性用法、历史文本、或与西语接触较多的语境中出现。","词源上与阿拉伯语有关系：西班牙语里很多以“al-”开头的词来自阿拉伯语影响；了解这一点有助于记忆它与“tar/焦油”相关的意义。"]}
{"word":"Alkmaar","summary":{"en":"Alkmaar is a city in the Netherlands, especially known for its traditional cheese market.","zh":"Alkmaar 是荷兰的一座城市，尤其以传统奶酪市场闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in North Holland, the Netherlands, known for its historic center and traditional cheese market.","zh":"阿尔克马尔（荷兰北荷兰省城市），以历史城区与传统奶酪市场闻名。"},"examples":[{"en":"We visited Alkmaar to see the famous cheese market.","zh":"我们去阿尔克马尔看著名的奶酪市场。"},{"en":"Alkmaar is an easy day trip from Amsterdam.","zh":"阿尔克马尔从阿姆斯特丹出发很适合一日游。"}]}],"synonyms":["a Dutch city in North Holland"],"phonetic":"/ˈɑlkˌmɑr/","extraExplanation":["“Alkmaar”是荷兰地名的英语拼写；在英语里常按拼写读作 /ˈɑlkˌmɑr/。荷兰语本音更接近“阿尔克-马尔”，其中“aa”是较长的元音。","阿尔克马尔最常见的文化联想是“Alkmaar cheese market（阿尔克马尔奶酪市场）”，常在旅游介绍与纪录片中出现。"]}
{"word":"Alkol","summary":{"en":"Alcohol usually means alcoholic drinks, or the ethanol in them; in chemistry, it can also mean a class of compounds called alcohols.","zh":"Alcohol通常指酒类饮料或其中的乙醇；在化学中也可指“醇类”这一类化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a drink that contains ethanol (like beer, wine, or spirits); alcoholic drinks in general","zh":"含酒精的饮料（如啤酒、葡萄酒、烈酒）；泛指酒类"},"examples":[{"en":"Some people don’t drink alcohol for health or religious reasons.","zh":"有些人因为健康或宗教原因不喝酒。"},{"en":"The restaurant does not serve alcohol.","zh":"这家餐厅不提供酒类。"}]},{"partOfSpeech":"n.","definition":{"en":"ethanol, the intoxicating substance found in alcoholic drinks","zh":"乙醇；酒类饮料中使人醉的主要成分"},"examples":[{"en":"This beer has about 5% alcohol.","zh":"这款啤酒的酒精度大约是5%。"},{"en":"Alcohol can affect your judgment and reaction time.","zh":"酒精会影响你的判断力和反应速度。"}]},{"partOfSpeech":"n.","definition":{"en":"(chemistry) a group of organic compounds that contain a hydroxyl (-OH) group","zh":"（化学）醇类：含有羟基（-OH）的一类有机化合物"},"examples":[{"en":"Methanol and ethanol are both types of alcohols in chemistry.","zh":"甲醇和乙醇在化学上都属于醇类。"}]}],"synonyms":["booze","liquor","spirits","ethanol"],"phonetic":"/ˈæl.kə.hɑːl/","extraExplanation":["“Alkol”常见于土耳其语等语言中，对应英语的“alcohol”。英语里更常见的日常表达是“alcohol”或更具体地说“beer / wine / liquor (spirits)”。","文化语境提示：在英语国家，“drink alcohol”通常指喝酒精饮料；若要表达“完全不喝酒”，常说“I don’t drink.” 或 “I don’t drink alcohol.”"]}
{"word":"alkool","summary":{"en":"Alcohol is the substance in alcoholic drinks (and also a family of chemicals like ethanol).","zh":"Alcohol 指酒精（酒类饮品中的成分），也可指乙醇等“醇类”化学物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A chemical substance found in drinks like beer, wine, and spirits that can make you feel relaxed or drunk.","zh":"酒精（饮料中的成分），会使人放松或醉酒。"},"examples":[{"en":"He stopped drinking alcohol for his health.","zh":"为了健康，他戒酒了。"},{"en":"This medicine should not be mixed with alcohol.","zh":"这种药不要和酒精一起用。"}]},{"partOfSpeech":"n.","definition":{"en":"Alcoholic drinks in general.","zh":"含酒精饮料（统称）。"},"examples":[{"en":"No alcohol is allowed at the event.","zh":"活动禁止饮酒。"},{"en":"They serve alcohol after 6 p.m.","zh":"他们晚上六点后供应酒类饮品。"}]},{"partOfSpeech":"n.","definition":{"en":"In chemistry, a type of organic compound (like ethanol) that has a particular group of atoms (an –OH group).","zh":"（化学）醇：一类含有特定基团（–OH 羟基）的有机化合物，如乙醇。"},"examples":[{"en":"Ethanol is a common alcohol used in hand sanitizer.","zh":"乙醇是洗手液中常见的醇类成分。"}]}],"synonyms":["liquor","booze (informal)","spirits","ethanol (technical)"],"phonetic":"/ˈæl.kə.hɔl/","extraExplanation":["“alkool”通常被认为是“alcohol”的拼写错误。英语里标准拼法是 alcohol。","日常英语中如果只说 alcohol，通常指“酒精/酒”；在科学或产品成分表里，也可能更偏向“乙醇”等化学意义，需看上下文。"]}
{"word":"Alkoran","summary":{"en":"Alkoran is an old spelling of the Quran (Koran), the holy book of Islam.","zh":"Alkoran 是《古兰经》（Koran/Quran）的旧式拼写，指伊斯兰教经典。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an archaic or old-fashioned spelling of the Quran (also spelled Koran), the holy book of Islam.","zh":"《古兰经》（也拼作 Koran）的旧式或古体拼写；指伊斯兰教的经典。"},"examples":[{"en":"In some older English texts, you may see “Alkoran” instead of “the Quran.”","zh":"在一些较早的英文文献中，你可能会看到用 “Alkoran” 来代替 “the Quran”。"},{"en":"The library catalog lists an 18th‑century translation under the title “Alkoran.”","zh":"图书馆目录把一部18世纪的译本以 “Alkoran” 为书名收录。"}]}],"synonyms":["Quran","Koran","Alcoran"],"phonetic":"/ˌæl kəˈrɑːn/","extraExplanation":["“Alkoran/Alcoran” 多见于早期英语写作与旧译本，来源于把阿拉伯语定冠词 “al-（الـ，意为‘这/该’）” 与 “Qur’an” 一起转写的习惯，因此看起来像一个整体词。现代英语更常用 “the Quran” 或 “the Koran”。","由于该词与宗教经典有关，使用时建议采用当代更常见且更尊重当事社群偏好的写法（如 Quran），并在引用旧书名或历史文本时才使用 “Alkoran”。"]}
{"word":"alkoran","summary":{"en":"“Alkoran” is an archaic spelling of the Quran (the holy book of Islam).","zh":"“Alkoran”是《古兰经》（伊斯兰教经典 Quran）的古体/过时拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an old-fashioned or archaic English spelling of the Quran (also spelled “Koran”), the holy book of Islam","zh":"《古兰经》（Quran）的旧式/古体英语拼写（也写作 Koran），伊斯兰教的经典"},"examples":[{"en":"In some older European books, you may see “Alkoran” used where modern English writes “the Quran.”","zh":"在一些较早的欧洲书籍里，你可能会看到用 “Alkoran” 来指现代英语所写的 “the Quran（《古兰经》）”。"},{"en":"The museum label explains that “Alkoran” is an outdated spelling and can feel historically biased today.","zh":"博物馆的说明牌解释说，“Alkoran” 是过时的拼写，而且在今天可能带有历史偏见的感觉。"}]}],"synonyms":["Quran","Koran","Alcoran"],"phonetic":"/ˌæl.kəˈrɑːn/","extraExplanation":["“Al-”来自阿拉伯语定冠词“al-（الـ）”，意思类似英语的“the”。早期欧洲文本有时把它直接并入词里，形成“Alkoran”等写法。","现代英语更推荐使用“Quran”（更接近阿拉伯语发音与转写规范）。在一些历史语境中，“Koran/Alkoran”可能与旧时代的东方主义书写相关，写作或翻译时宜注意语气与尊重。","文学/历史文本中偶尔会见到“Alcoran/Alkoran”等变体，多出现在17–19世纪的英文译本、旅行记或宗教论战作品里。"]}
{"word":"Alkoranic","summary":{"en":"Alkoranic means “Quranic; related to the Quran.” It is an older, less common spelling.","zh":"Alkoranic 意为“古兰经的；与《古兰经》有关的”，属于较旧、较少见的拼写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"of or relating to the Quran (the Islamic holy book); Quranic.","zh":"《古兰经》的；与《古兰经》有关的；古兰经的。"},"examples":[{"en":"The essay analyzes Alkoranic themes of mercy and justice.","zh":"这篇文章分析了古兰经中关于慈悲与公正的主题。"},{"en":"Some older English texts use Alkoranic as a variant spelling of Quranic.","zh":"一些较早的英语文本会用 Alkoranic 作为 Quranic 的变体拼写。"}]}],"synonyms":["Quranic","Koranic"],"phonetic":"/ˌæl.kəˈræn.ɪk/","extraExplanation":["“Alkoranic”是一个较少见、较旧的英语形式，常见于早期或历史文献中，源自对《古兰经》旧式音译/拼写（如“Alcoran/Alkoran”）。现代英语更常用“Quranic”或“Koranic”。在当代写作中，使用“Alkoranic”可能带有古旧语感，建议在学术或历史语境下使用，并注意尊重宗教文本的称呼习惯。"]}
{"word":"alkoranic","summary":{"en":"“Alkoranic” means “Qur’anic; relating to the Qur’an,” and is an older/less common form.","zh":"“alkoranic” 意为“古兰经的”，属于较旧、较少见的用法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Qur’an (also spelled the Koran); Qur’anic.","zh":"与《古兰经》（也拼作 Koran）有关的；古兰经的。"},"examples":[{"en":"The museum displayed Alkoranic calligraphy alongside other Islamic art.","zh":"博物馆展出了古兰经书法，并与其他伊斯兰艺术一同陈列。"},{"en":"Some older English books use “Alkoranic” when discussing Qur’anic verses.","zh":"一些较早的英文书籍在讨论《古兰经》经文时会用 “Alkoranic” 这个词。"}]}],"synonyms":["Qur’anic","Koranic"],"phonetic":"/ˌæl.kəˈræn.ɪk/","extraExplanation":["“Alkoranic” 来自较旧的西方拼写 “Alcoran/Alkoran”（指 Qur’an）。现代英语中更常见的是 “Qur’anic” 或 “Koranic”。在学术或历史文献里遇到它，多半是时代用字或翻译传统的反映，而不是现代标准拼写。"]}
{"word":"alkoxid","summary":{"en":"An alkoxide is the RO⁻ ion (or its salt), formed when an alcohol loses H, often used as a strong base or nucleophile.","zh":"alkoxide（醇盐）是醇失去氢后形成的 RO⁻ 离子或其盐，常作强碱或亲核试剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A negatively charged ion (or salt) made by removing the hydrogen (H) from an alcohol; it has the form RO⁻ and often pairs with a metal such as Na⁺ or K⁺.","zh":"（化学）由醇（ROH）失去氢（H）形成的带负电的离子或其盐，通式为 RO⁻，常与 Na⁺、K⁺ 等金属阳离子配对。"},"examples":[{"en":"Sodium ethoxide is an alkoxide commonly used as a strong base in organic reactions.","zh":"乙醇钠是一种常见的醇盐，常在有机反应中用作强碱。"},{"en":"Alkoxides can act as nucleophiles and help form ethers.","zh":"醇盐可以作为亲核试剂，帮助生成醚。"}]}],"synonyms":["alkoxide ion","alkoxy anion","alcoholate"],"phonetic":"/ˈæl.kəksaɪd/","extraExplanation":["你输入的“alkoxid”更常见的标准拼写是 **alkoxide**。","醇盐（alkoxide）通常由醇与强碱/金属反应生成，例如：ROH + Na → RO⁻Na⁺ + 1/2 H₂。","在有机化学里，alkoxide 既常被当作“强碱”，也常被当作“亲核试剂”；典型用途包括 Williamson 醚合成（生成醚）。","命名上常见“金属 + 醇基”形式：sodium methoxide（甲醇钠）、potassium tert-butoxide（叔丁醇钾）等。"]}
{"word":"alkoxide","summary":{"en":"An alkoxide is the RO⁻ ion (or its metal salt) derived from an alcohol, commonly used as a strong base or nucleophile in chemistry.","zh":"alkoxide 指由醇去质子化得到的 RO⁻（或其金属盐），在化学中常作强碱或亲核试剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) The anion or salt formed when an alcohol (ROH) loses its hydrogen (H⁺), giving RO⁻; commonly paired with a metal ion (e.g., Na⁺) and used as a strong base or nucleophile.","zh":"（化学）醇（ROH）失去氢离子（H⁺）后形成的阴离子或其盐，化学式常写作 RO⁻；常与金属离子（如 Na⁺）结合，常用作强碱或亲核试剂。"},"examples":[{"en":"Sodium ethoxide is an alkoxide often used in organic synthesis.","zh":"乙醇钠是一种常用于有机合成的醇盐（alkoxide）。"},{"en":"Alkoxides can act as strong bases, so they may remove a proton from some molecules.","zh":"醇盐常表现为强碱，因此可能从某些分子上夺取一个质子。"},{"en":"The reaction produced an alkoxide intermediate before forming the final product.","zh":"该反应在生成最终产物之前先形成了一个醇盐中间体。"}]}],"synonyms":["alkoxide ion","alkoxy anion","metal alkoxide"],"phonetic":"/ˈæl.kək.saɪd/","extraExplanation":["在有机化学里，alkoxide 常被写成“alkoxide ion（醇盐离子）”或“metal alkoxide（金属醇盐）”，例如 sodium methoxide（甲醇钠，NaOCH₃）。","命名上通常是“金属 + 醇的烷氧基（-oxide）”，如 ethoxide（乙氧基，CH₃CH₂O⁻）。","醇盐常用于威廉姆逊醚化反应（Williamson ether synthesis）等反应中；由于碱性强，也可能引发消除反应（E2）等副反应。"]}
{"word":"alkoxy","summary":{"en":"Alkoxy means “containing or being an –OR (alkyl–oxygen) group,” common in organic chemistry (e.g., methoxy, ethoxy).","zh":"Alkoxy 指“含有或属于 –OR（烷基–氧）基团”的概念，常见于有机化学（如甲氧基、乙氧基）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Describing a group or compound that contains an alkoxy group (–OR), where R is an alkyl group (like methyl or ethyl) and O is oxygen; often used in names such as “alkoxy group.”","zh":"（化学）指含有烷氧基（–OR）的基团或化合物；其中 R 是烷基（如甲基、乙基），O 是氧。常用于“烷氧基/烷氧基团”等说法。"},"examples":[{"en":"Methoxy and ethoxy are common alkoxy groups found in many organic molecules.","zh":"甲氧基和乙氧基是许多有机分子中常见的烷氧基。"},{"en":"The alkoxy substituent can change a molecule’s solubility and reactivity.","zh":"烷氧基取代基会改变分子的溶解性和反应性。"}]},{"partOfSpeech":"n.","definition":{"en":"(Chemistry) An alkoxy group (–OR) itself; used as a noun in technical writing.","zh":"（化学）烷氧基（–OR）本身；在技术性文献中也可作名词使用。"},"examples":[{"en":"Replace the chlorine with an alkoxy to form an ether.","zh":"用烷氧基取代氯，从而生成醚。"},{"en":"An alkoxy was introduced at the para position of the ring.","zh":"在芳环的对位引入了一个烷氧基。"}]}],"synonyms":["alkoxyl","–OR (alkoxy group)","alkyl oxy (informal)"],"phonetic":"/ælˈkɑːksi/","extraExplanation":["“alkoxy”来自“alkyl（烷基）+ oxy（氧）”。烷氧基 –OR 常见于“醚（ether）”结构中，例如：R–O–R′。","常见具体烷氧基名称：methoxy（–OCH₃，甲氧基）、ethoxy（–OCH₂CH₃，乙氧基）、propoxy（–OCH₂CH₂CH₃，丙氧基）。","阅读有机化学命名时可抓住关键：看到“–oxy”通常提示“通过氧连接”的取代基；而“alkoxy”特指“烷基通过氧连接”。"]}
{"word":"alkoxyl","summary":{"en":"Alkoxyl (often written as alkoxy) means the –OR group from an alcohol, or something that contains it.","zh":"alkoxyl（更常写作 alkoxy）指由醇衍生的 –OR 烷氧基，或指含有该基团的。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical group (–OR) derived from an alcohol by removing the hydrogen from its –OH group; commonly called an alkoxy group.","zh":"（化学）烷氧基（–OR）：由醇去掉羟基（–OH）上的氢原子后形成的基团，常称为“alkoxy group（烷氧基）”。"},"examples":[{"en":"Methoxyl (–OCH₃) is an alkoxyl group found in many organic molecules.","zh":"甲氧基（–OCH₃）是许多有机分子中常见的一种烷氧基（alkoxyl）基团。"},{"en":"Replacing a hydrogen with an alkoxyl group can change a compound’s solubility.","zh":"用烷氧基（alkoxyl）取代一个氢原子，可能会改变化合物的溶解性。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or containing an alkoxyl (alkoxy) group.","zh":"（化学）与烷氧基有关的；含有烷氧基的。"},"examples":[{"en":"Alkoxyl substituents often affect the odor and reactivity of aromatic compounds.","zh":"烷氧基取代基常会影响芳香族化合物的气味与反应性。"}]}],"synonyms":["alkoxy","alkoxy group"],"phonetic":"/ælˈkɑːksɪl/","extraExplanation":["“alkoxyl”在日常英语中不常见，更常用的写法是“alkoxy”（如：alkoxy group 烷氧基）。","结构记忆：alcohol（醇）→ 去掉 –OH 上的 H → 得到 –OR（R 表示烃基，如 CH₃、C₂H₅）。","常见例子：methoxy（甲氧基 –OCH₃）、ethoxy（乙氧基 –OC₂H₅）。"]}
{"word":"alky","summary":{"en":"“Alky” is an informal slang word meaning an alcoholic (sometimes offensive); it can also mean ‘alcohol-related.’","zh":"“alky”是非正式俚语，指“酒鬼/酗酒者”（有时冒犯）；也可指“与酒精有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, sometimes offensive) An alcoholic; a person who is addicted to alcohol.","zh":"（非正式用语，有时带冒犯）酒鬼；酗酒成瘾者。"},"examples":[{"en":"He went to rehab after realizing he was becoming an alky.","zh":"他意识到自己正在变成酒鬼后，就去戒酒康复中心了。"},{"en":"Don’t call him an alky—it's hurtful; say “someone with an alcohol problem.”","zh":"别叫他“酒鬼”——很伤人；可以说“有酒精问题的人”。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) Relating to alcohol; alcoholic.","zh":"（非正式）与酒精有关的；含酒精的。"},"examples":[{"en":"She avoids alky drinks when she’s on medication.","zh":"她在吃药时会避免喝含酒精的饮料。"}]}],"synonyms":["alcoholic","drunkard","boozer","lush"],"phonetic":"/ˈælki/","extraExplanation":["“alky”是“alcoholic”的口语缩写，常用于随意谈话中。用来指人时可能带贬义或羞辱感，在正式或尊重的场合更建议说“a person with alcoholism / someone with an alcohol problem（有酒精成瘾/酒精问题的人）”。","在一些地区，“alky”也可用作形容词指“含酒精的”，但这种用法相对少见，更常见的说法是“alcoholic”或“alcohol-containing”。"]}
{"word":"alkyd","summary":{"en":"“Alkyd” means an alkyd resin or anything made with it, commonly used in durable paints and coatings.","zh":"“alkyd”指醇酸树脂或醇酸树脂类材料，常用于耐用型涂料与涂层。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a synthetic resin made from alcohols and acids, commonly used as the binder in paints and varnishes (especially oil-based paints).","zh":"醇酸树脂：一种由醇类与酸类反应制成的合成树脂，常用作涂料和清漆（尤其是油性漆）的成膜/黏结材料。"},"examples":[{"en":"Alkyd paint dries to a hard, durable finish.","zh":"醇酸漆会干燥成坚硬耐用的漆膜。"},{"en":"The contractor recommended an alkyd primer for the metal railing.","zh":"承包商建议给金属栏杆使用醇酸底漆。"}]},{"partOfSpeech":"adj.","definition":{"en":"made from or relating to alkyd resin.","zh":"醇酸树脂的；与醇酸树脂有关的。"},"examples":[{"en":"They used an alkyd enamel on the doors for extra toughness.","zh":"他们在门上用了醇酸磁漆（烤瓷漆）来提高耐用性。"},{"en":"Alkyd coatings are common in industrial and household finishes.","zh":"醇酸涂层在工业与家装涂装中很常见。"}]}],"synonyms":["alkyd resin","oil-based (paint)","enamel (paint)"],"phonetic":"/ˈælˌkɪd/","extraExplanation":["“alkyd”这个词来自“alcohol（醇）”和“acid（酸）”的组合（a-l + -kyd），用来提示它的化学来源：由多元醇与多元酸（或酸酐）缩聚形成的树脂。","醇酸漆的优点通常是流平好、漆膜坚韧、附着力强；但相对一些水性丙烯酸漆，干燥/固化更慢，且可能更容易随时间发黄。","学习搭配：alkyd paint（醇酸漆）, alkyd resin（醇酸树脂）, alkyd primer（醇酸底漆）, alkyd enamel（醇酸磁漆/瓷漆）。"]}
{"word":"alkyds","summary":{"en":"Alkyds are synthetic resins widely used in paints and coatings.","zh":"Alkyds 指常用于油漆与涂料的醇酸合成树脂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Alkyd resins (synthetic polymers) made from alcohol and acids, commonly used as binders in paints, varnishes, and coatings.","zh":"醇酸树脂（由醇与酸反应制成的合成聚合物），常用作油漆、清漆与涂料中的成膜/黏结材料。"},"examples":[{"en":"Many household enamel paints use alkyds because they dry to a hard, glossy finish.","zh":"许多家用瓷漆使用醇酸树脂，因为它们干燥后会形成坚硬、有光泽的漆膜。"},{"en":"The label says the coating is based on alkyds and mineral spirits.","zh":"标签上写着这种涂料以醇酸树脂和矿物油（矿物溶剂）为基础。"}]}],"synonyms":["alkyd resin","alkyd paint (context-specific)"],"phonetic":"/ˈælˌkɪdz/","extraExplanation":["“Alkyd”一词来自“alcohol（醇）”和“acid（酸）”的组合，指其原料来源。","在涂料里，醇酸树脂通常与溶剂型体系相关（如松节油/矿物油等），常见特点是流平好、漆膜较硬，但干燥时间可能比部分水性漆更长。"]}
{"word":"alkyl","summary":{"en":"Alkyl means a hydrocarbon group derived from an alkane (like methyl or ethyl), often discussed as part of a molecule in organic chemistry.","zh":"Alkyl 指“烷基”，是一种来自烷烃（如甲基、乙基）的烃基，常用于有机化学中描述分子结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to an alkyl group (a hydrocarbon group made by removing one hydrogen from an alkane, such as methyl or ethyl).","zh":"（化学）与“烷基”有关的；烷基是由烷烃去掉一个氢原子形成的烃基，例如甲基、乙基。"},"examples":[{"en":"Ethyl alcohol has an alkyl group in its structure.","zh":"乙醇的结构中含有一个烷基。"},{"en":"Alkyl chains can make a molecule more oily or water-repelling.","zh":"烷基链可能让分子更“油”、更疏水。"}]},{"partOfSpeech":"n.","definition":{"en":"an alkyl group, such as methyl (—CH3) or ethyl (—C2H5), that can attach to another part of a molecule.","zh":"（化学）烷基（如甲基—CH3、乙基—C2H5），可连接到分子中的其他部分。"},"examples":[{"en":"Replace a hydrogen with an alkyl to change the compound’s properties.","zh":"用一个烷基取代氢原子可以改变化合物的性质。"},{"en":"This reaction adds an alkyl to the aromatic ring.","zh":"这个反应会向芳香环上引入一个烷基。"}]}],"synonyms":["alkyl group","hydrocarbon substituent"],"phonetic":"/ˈælkaɪl/","extraExplanation":["“alkyl”常见于有机化学命名与反应机理中，表示来自烷烃（alkane）的取代基。最常见的烷基有 methyl（甲基）、ethyl（乙基）、propyl（丙基）。","在结构式里烷基常写成 R—，其中 R 代表某种烷基；例如 R—OH 表示“某种醇”。"]}
{"word":"alkylamine","summary":{"en":"An alkylamine is an amine whose nitrogen is bonded to one or more alkyl (alkane‑based) groups.","zh":"alkylamine 指“烷基胺”：氮原子上连接一个或多个烷基的胺类化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an amine in which one or more alkyl groups (carbon‑and‑hydrogen chains) are attached to the nitrogen atom","zh":"烷基胺；一种胺，其中氮原子上连接了一个或多个烷基（由碳和氢组成的链或基团）"},"examples":[{"en":"Methylamine is a simple alkylamine used as a building block in chemical synthesis.","zh":"甲胺是一种简单的烷基胺，常用作化学合成的基础原料。"},{"en":"Some alkylamines have strong smells and are handled carefully in the lab.","zh":"一些烷基胺气味很刺鼻，在实验室里需要小心操作。"},{"en":"The reaction produces an alkylamine as the main product.","zh":"该反应生成烷基胺作为主要产物。"}]}],"synonyms":["aliphatic amine","alkane amine"],"phonetic":"/ˌæl.kəlˈæ.miːn/","extraExplanation":["“alkyl-”表示“烷基”，来自alkane（烷烃）；“-amine”表示“胺”。因此alkylamine直译就是“带烷基的胺”。","按取代程度常分为：一级烷基胺（RNH₂）、二级烷基胺（R₂NH）、三级烷基胺（R₃N）。在有机化学里它们常表现为“碱性”并可与酸形成盐（如RNH₃⁺Cl⁻）。","读文献时要注意：有时作者会用更具体的名称（如ethylamine 乙胺、diethylamine 二乙胺）而不直接写alkylamine。"]}
{"word":"alkylamino","summary":{"en":"Alkylamino describes an amino group attached to an alkyl (carbon-chain) group, common in organic chemistry.","zh":"Alkylamino 指“氨基连接在烷基（碳链）上”的结构特征，常见于有机化学命名与描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) relating to, or containing an amino group (–NH2 or a substituted form) attached to an alkyl group (a carbon-and-hydrogen chain).","zh":"（化学）指“烷基氨基的”；即氨基（–NH2 或其取代形式）连接在烷基（由碳和氢组成的链）上的结构。"},"examples":[{"en":"An alkylamino substituent can change a molecule’s solubility in water.","zh":"烷基氨基取代基会改变分子在水中的溶解性。"},{"en":"This drug contains an alkylamino side chain that affects how it binds to receptors.","zh":"这种药物含有烷基氨基侧链，会影响它与受体的结合方式。"}]},{"partOfSpeech":"n.","definition":{"en":"an alkylamino group or substituent in a chemical structure.","zh":"（作名词用）化学结构中的烷基氨基基团或取代基。"},"examples":[{"en":"The molecule has a chloro group and an alkylamino.","zh":"这个分子含有一个氯基和一个烷基氨基。"}]}],"synonyms":["(related) aminoalkyl","(related) alkylamine (not identical)"],"phonetic":"/ˌælkaɪlˈæminoʊ/","extraExplanation":["“alkyl-”表示烷基（如 methyl 甲基 CH3–、ethyl 乙基 C2H5–），“amino”表示氨基相关。把两部分合起来，常用于命名有机化学中的取代基。","在命名里你也可能看到更具体的写法：methylamino（甲氨基）、dimethylamino（二甲氨基）。这些都属于 alkylamino 的具体类型。","发音上可分块记：alkyl + amino。阅读化学文献时，它常用于描述“结构特征”，而不是日常生活词汇。"]}
{"word":"alkylarylsulfonate","summary":{"en":"Alkylarylsulfonate is a chemical surfactant used in detergents and cleaners.","zh":"alkylarylsulfonate 指用于洗涤剂/清洁剂中的一种表面活性剂（烷基芳基磺酸盐）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (a type of sulfonate) that contains both an alkyl group and an aryl group; commonly used as a surfactant (a cleaning/foaming agent) in detergents and industrial cleaners","zh":"烷基芳基磺酸盐：一种同时含有烷基（alkyl）和芳基（aryl）的磺酸盐化合物；常用作表面活性剂（起清洁、起泡、乳化作用），常见于洗涤剂与工业清洗剂中"},"examples":[{"en":"Many laundry detergents use alkylarylsulfonates to help remove oily dirt.","zh":"许多洗衣粉/洗衣液使用烷基芳基磺酸盐来帮助去除油污。"},{"en":"The safety data sheet (SDS) lists an alkylarylsulfonate as the main surfactant.","zh":"安全数据表（SDS）把烷基芳基磺酸盐列为主要表面活性剂。"}]}],"synonyms":["sulfonate surfactant","alkylaryl sulfonate","alkylbenzene sulfonate"],"phonetic":"/ˌælkaɪlˌærəlˈsʌlfoʊˌneɪt/","extraExplanation":["这是一个偏化学/工业领域的术语，日常英语里不常用；在产品成分表或SDS里更常见。","词形可拆分理解：alkyl（烷基，常见于脂肪链）+ aryl（芳基，常见于苯环等芳香环）+ sulfonate（磺酸盐/磺酸根衍生物）。","在清洁产品里更常见的相关大类叫“alkylbenzene sulfonate（烷基苯磺酸盐）”，属于此类结构的典型代表。"]}
{"word":"alkylate","summary":{"en":"Alkylate means to introduce an alkyl (carbon-chain) group into a molecule; in refining, it refers to making high‑octane gasoline components through alkylation.","zh":"Alkylate 指“使烷基化”，即向分子引入烷基；在炼油中指通过烷基化工艺生产高辛烷值汽油组分。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to add an alkyl group (a carbon‑based chain such as methyl or ethyl) to a molecule, often in a chemical reaction","zh":"（化学）使烷基化；向分子中引入烷基（如甲基、乙基等碳链）"},"examples":[{"en":"Chemists alkylate the aromatic ring to change the compound’s properties.","zh":"化学家会对芳香环进行烷基化，以改变化合物的性质。"},{"en":"This step alkylates the nitrogen atom, forming a new amine derivative.","zh":"这一步会使氮原子发生烷基化，生成一种新的胺衍生物。"}]},{"partOfSpeech":"v.","definition":{"en":"(petroleum industry) to produce high‑octane fuel components by combining smaller hydrocarbons into larger branched molecules (alkylate)","zh":"（石油工业）烷基化（工艺）；把较小的烃组合成更大的支链分子，以生产高辛烷值汽油组分（烷基化油）"},"examples":[{"en":"Refineries alkylate isobutane with olefins to make cleaner-burning gasoline blendstock.","zh":"炼油厂会用异丁烷与烯烃进行烷基化，制得燃烧更清洁的汽油调和组分。"},{"en":"The plant upgraded its alkylation unit to increase alkylate production.","zh":"该工厂升级了烷基化装置，以提高烷基化油的产量。"}]}],"synonyms":["alkylate (a molecule)","perform alkylation","introduce an alkyl group"],"phonetic":"/ˈæl.kəˌleɪt/","extraExplanation":["“alkylate”主要出现在化学与炼油语境中，日常英语里很少用。名词“alkylation”指“烷基化（反应/工艺）”。在炼油行业里，“alkylate”也常用作名词，指“烷基化油（高辛烷值汽油组分）”。"]}
{"word":"alkylated","summary":{"en":"“Alkylated” means a molecule has been modified by adding an alkyl group (via alkylation).","zh":"“alkylated”指分子通过烷基化被引入烷基而发生改性。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Having an alkyl group added to a molecule; chemically modified by alkylation.","zh":"（化学）被引入烷基的；经过烷基化反应而改性的。"},"examples":[{"en":"Alkylated compounds are often more soluble in non‑polar solvents.","zh":"烷基化后的化合物通常更容易溶于非极性溶剂。"},{"en":"The lab compared an alkylated sample with the original material.","zh":"实验室将烷基化后的样品与原始材料进行了对比。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense / past participle of “alkylate”: to add an alkyl group to a compound (or to produce a product by alkylation).","zh":"“alkylate”的过去式/过去分词：使（化合物）发生烷基化；向分子中引入烷基。"},"examples":[{"en":"The chemist alkylated the aromatic ring to change its properties.","zh":"化学家对芳香环进行了烷基化以改变其性质。"},{"en":"The mixture was alkylated under controlled temperature and pressure.","zh":"该混合物在受控的温度和压力下进行了烷基化处理。"}]}],"synonyms":["alkylated (modified)","substituted (chemistry context)","alkyl-substituted"],"phonetic":"/ˈæl.kəˌleɪ.tɪd/","extraExplanation":["“alkylated”多见于化学与材料、药物、石油炼制等语境。烷基（alkyl）指由烷烃去掉一个氢后形成的基团，如 methyl（甲基）或 ethyl（乙基）。把烷基“接上去”常会改变分子的溶解性、挥发性或反应活性。日常英语中很少用到，主要是专业术语。"]}
{"word":"alkylates","summary":{"en":"Alkylates can mean (1) “adds an alkyl group to a molecule” (verb) or (2) “alkylation products,” especially high‑octane gasoline components (noun, plural).","zh":"alkylates 可指（1）“使……发生烷基化/引入烷基”（动词）；也可指（2）“烷基化产物”，尤指高辛烷值汽油调和组分（名词复数）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(chemistry) to add an alkyl group (a carbon‑based group such as –CH₃ or –C₂H₅) to a molecule; to convert a substance into an alkylated form.","zh":"（化学）使发生烷基化；向分子中引入烷基（如 –CH₃、–C₂H₅ 等），使其变成“被烷基化”的形式。"},"examples":[{"en":"In the lab, the reagent alkylates the nitrogen atom on the ring.","zh":"在实验室里，这种试剂会使环上的氮原子发生烷基化。"},{"en":"Some chemicals can alkylate DNA, which may damage cells.","zh":"有些化学物质可以烷基化 DNA，从而可能损伤细胞。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of alkylate: chemicals or fuel components produced by alkylation, especially high‑octane gasoline blending components.","zh":"alkylate 的复数：烷基化产物；尤指炼油中通过烷基化得到的高辛烷值汽油调和组分。"},"examples":[{"en":"The refinery increased production of alkylates to improve gasoline quality.","zh":"炼油厂提高了烷基化产物的产量，以改善汽油质量。"},{"en":"Alkylates are valued because they help raise octane without adding aromatics.","zh":"烷基化产物很受重视，因为它们能在不增加芳烃的情况下提高辛烷值。"}]}],"synonyms":["adds an alkyl group to","alkylates (a compound)","alkylation products","alkylate components"],"phonetic":"/ˈæl.kə.leɪts/","extraExplanation":["“alkyl-”来自“alkane（烷烃）”，指由碳氢链组成的基团；“-ate”在化学里常用于动词/名词形式（如 sulfate）。","在生物与医药语境里，“alkylating agents（烷基化剂）”常指能与DNA等发生反应的化合物；在石油化工里，“alkylate(s)”多指可用来调和汽油、提高辛烷值的产物。"]}
{"word":"alkylating","summary":{"en":"Alkylating means adding an alkyl group to a molecule; in medicine it often refers to chemotherapy drugs that damage DNA by doing this.","zh":"Alkylating 指对分子进行烷基化（添加烷基）；在医学中常指通过这种方式损伤 DNA 的化疗药物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Adding an alkyl group (a carbon-and-hydrogen chain) to a molecule; often describing a chemical reaction or a substance that performs this reaction.","zh":"（化学）将烷基（由碳和氢组成的链状基团）加到分子上的；常用于描述一种反应或能进行这种反应的物质。"},"examples":[{"en":"This lab focuses on alkylating reactions used to modify pharmaceuticals.","zh":"这个实验室研究用于改造药物分子的烷基化反应。"},{"en":"The reagent is alkylating the amine group, changing the compound’s properties.","zh":"该试剂正在对胺基进行烷基化，从而改变化合物的性质。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Describing a chemotherapy drug that damages DNA by adding alkyl groups, which can stop cancer cells from dividing.","zh":"（医学）指一种通过向 DNA 添加烷基而造成损伤的化疗药物，从而阻止癌细胞分裂。"},"examples":[{"en":"Alkylating agents are used in some cancer treatments.","zh":"烷基化剂用于某些癌症治疗。"},{"en":"The doctor discussed side effects common with alkylating chemotherapy.","zh":"医生说明了烷基化类化疗常见的不良反应。"}]},{"partOfSpeech":"v.","definition":{"en":"The act or process of alkylating (adding an alkyl group) as it is happening.","zh":"（进行中）正在进行烷基化（添加烷基）的过程或动作。"},"examples":[{"en":"Alkylating the molecule at this step improves its stability.","zh":"在这一步对分子进行烷基化会提高其稳定性。"},{"en":"They are alkylating the substrate under mild conditions.","zh":"他们正在温和条件下对底物进行烷基化。"}]}],"synonyms":["alkylation (related noun)","alkylated (related form)","DNA-alkylating (medical context)"],"phonetic":"/ˈæl.kəˌleɪ.tɪŋ/","extraExplanation":["在医学语境里，alkylating 常和 “alkylating agent（烷基化剂）” 连用，属于化疗药物的一大类。它们通过与 DNA 发生反应来抑制细胞复制，因此既可能杀伤肿瘤细胞，也可能影响生长快的正常细胞（如骨髓、毛囊）。具体用药与风险应由专业医生评估。"]}
{"word":"alkylation","summary":{"en":"Alkylation is the process of adding an alkyl group to a molecule; in refining, it also means making high-octane gasoline components.","zh":"烷基化指把烷基引入分子的过程；在炼油中也指生成高辛烷值汽油组分的工艺。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A reaction or process that adds an alkyl group (such as a methyl or ethyl group) to a molecule.","zh":"（化学）烷基化：把一个烷基（如甲基、乙基）引入某个分子中的反应或过程。"},"examples":[{"en":"Alkylation is used to modify molecules and change their chemical properties.","zh":"烷基化常用来改造分子并改变其化学性质。"},{"en":"In organic synthesis, alkylation can form new carbon–carbon bonds.","zh":"在有机合成中，烷基化可以形成新的碳—碳键。"},{"en":"The lab report describes an alkylation step followed by purification.","zh":"实验报告描述了一个烷基化步骤，随后进行纯化。"}]},{"partOfSpeech":"n.","definition":{"en":"(Petroleum refining) A process that combines small hydrocarbons to make high-octane gasoline components.","zh":"（石油炼制）烷基化：把小分子烃类结合起来，生成高辛烷值汽油组分的工艺。"},"examples":[{"en":"The refinery uses alkylation to produce cleaner, high-octane blending stocks.","zh":"炼油厂利用烷基化来生产更清洁的高辛烷值调和组分。"},{"en":"Sulfuric acid can be used as a catalyst in alkylation units.","zh":"在烷基化装置中，硫酸可用作催化剂。"}]}],"synonyms":["alkyl group addition","alkylating reaction","Friedel–Crafts alkylation (specific type)"],"phonetic":"/ˌælkaɪˈleɪʃən/","extraExplanation":["“alkylation”来自“alkyl（烷基）+ -ation（……的过程）”。在有机化学里，它常指把烷基接到含有亲核位点的分子上；在炼油领域，它是重要的提辛烷值工艺之一。","常见搭配：alkylation reaction（烷基化反应）, alkylation step（烷基化步骤）, alkylation unit（烷基化装置）, Friedel–Crafts alkylation（傅-克烷基化）。"]}
{"word":"alkylbenzenesulfonate","summary":{"en":"Alkylbenzenesulfonate is a detergent surfactant made from an alkyl-substituted benzene sulfonate.","zh":"Alkylbenzenesulfonate 指一种由烷基取代苯衍生的磺酸盐类表面活性剂，常见于洗涤与清洁产品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of sulfonate (a salt or ester of sulfonic acid) made from an alkyl-substituted benzene; commonly used as a surfactant (surface-active agent) in detergents and cleaners.","zh":"一种由“烷基取代的苯”衍生的磺酸盐（磺酸的盐或酯）；常用作洗涤剂与清洁剂中的表面活性剂。"},"examples":[{"en":"Many household laundry powders use alkylbenzenesulfonate as a key surfactant.","zh":"许多家用洗衣粉把 alkylbenzenesulfonate 作为关键的表面活性剂。"},{"en":"The label lists alkylbenzenesulfonate among the ingredients that help remove grease.","zh":"标签把 alkylbenzenesulfonate 列为有助于去除油污的成分之一。"}]}],"synonyms":["linear alkylbenzene sulfonate (LAS)","alkyl benzene sulfonate"],"phonetic":"/ˌælkaɪlˌbɛnzˌiːnˈsʌlfəˌneɪt/","extraExplanation":["这是一个化学/工业用语，在日常英语里不常单独出现，更常见于成分表、科研论文或安全数据表（SDS）。","常见变体是 linear alkylbenzene sulfonate（线性烷基苯磺酸盐），缩写 LAS；“linear（线性）”通常暗示更容易生物降解，因此在环境讨论中更常被提到。","构词提示：alkyl（烷基）+ benzene（苯）+ sulfonate（磺酸盐）。理解这些词根有助于读懂类似的化学名称。"]}
{"word":"alkylbenzenesulfonates","summary":{"en":"Alkylbenzenesulfonates are common synthetic surfactants used in detergents to lift and remove oily dirt.","zh":"烷基苯磺酸盐是一类常见的合成表面活性剂，用于洗涤剂中帮助去除油污。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of synthetic surfactants (cleaning agents) made from an alkyl-substituted benzene ring with a sulfonate group, widely used in detergents and cleaning products","zh":"一类合成表面活性剂（清洁剂成分），由带烷基取代的苯环与磺酸盐基团组成，广泛用于洗涤剂和清洁用品中"},"examples":[{"en":"Many household detergents use alkylbenzenesulfonates to help remove oily dirt.","zh":"许多家用洗涤剂使用烷基苯磺酸盐来帮助去除油污。"},{"en":"Environmental regulations often focus on how quickly alkylbenzenesulfonates break down in water.","zh":"环保法规常关注烷基苯磺酸盐在水中分解的速度。"}]}],"synonyms":["linear alkylbenzene sulfonates (LAS)","surfactants","detergent surfactants"],"phonetic":"/ˌælkaɪlˌbɛnˌzinˈsʌlfoʊˌneɪts/","extraExplanation":["“alkylbenzenesulfonates”通常指一整类物质，常见类型包括LAS（linear alkylbenzene sulfonates，直链烷基苯磺酸盐）。与较早的支链型相比，直链型通常更容易被微生物降解，因此在现代洗涤剂中更常用。","作为表面活性剂，它们的作用原理是：一端“亲水”（磺酸盐基团），另一端“亲油”（烷基链），能把油污分散到水中，便于冲洗。","该词多见于化学、环境科学与日化产品成分表；日常英语里更常说“surfactants（表面活性剂）”或“detergent ingredients（洗涤剂成分）”。"]}
{"word":"alkylene","summary":{"en":"An alkylene is a divalent hydrocarbon group used as a linking unit in chemical structures.","zh":"alkylene 指“二价烃基（亚烷基）”，常作为化学结构中的连接片段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a divalent hydrocarbon group (a type of substituent) derived from an alkane by removing two hydrogen atoms; often written as a linking unit in molecules (e.g., –CH2–CH2–).","zh":"亚烷基；由烷烃去掉两个氢原子形成的二价烃基（常作为分子中的连接片段，如 –CH2–CH2–）。"},"examples":[{"en":"Polyethylene glycol contains repeating alkylene units between oxygen atoms.","zh":"聚乙二醇在氧原子之间含有重复的亚烷基单元。"},{"en":"An alkylene bridge can connect two aromatic rings in a larger molecule.","zh":"亚烷基“桥”可以在更大分子中连接两个芳环。"}]}],"synonyms":["divalent alkyl group","alkane-1,2-diyl (systematic)"],"phonetic":"/ˈæl.kəˌliːn/","extraExplanation":["“alkylene”是有机化学里的术语，强调“二价（divalent）”这一点：它能在结构式中同时与两处相连，所以常被称为“桥”或“连接基”。","常见例子：methylene（亚甲基，–CH2–）、ethylene（亚乙基，–CH2–CH2–）、propylene（亚丙基，–CH2–CH2–CH2–，在具体结构中也可能有不同连接方式）。","不要与“alkene（烯烃）”混淆：alkene是含C=C双键的一类化合物；alkylene指的是作为取代基/连接基的一段二价烃基。"]}
{"word":"alkylic","summary":{"en":"“Alkylic” is a chemistry adjective meaning “related to or containing an alkyl group.”","zh":"“alkylic”是化学用形容词，意思是“与烷基有关的；含烷基的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Relating to an alkyl group (a group of carbon and hydrogen atoms, such as methyl or ethyl), or containing alkyl groups.","zh":"（化学）与烷基有关的；含有烷基的（烷基是由碳和氢组成的基团，如甲基、乙基）。"},"examples":[{"en":"Alkylic compounds often behave differently from aromatic compounds.","zh":"含烷基的化合物在性质上常常与芳香族化合物不同。"},{"en":"An alkylic side chain can change a molecule’s solubility.","zh":"一个烷基侧链可能会改变分子的溶解性。"}]}],"synonyms":["alkyl (more common)","aliphatic (related, broader)"],"phonetic":"/ælˈkɪlɪk/","extraExplanation":["“alkylic”在英语里属于较少见的用法；更常见、更标准的形容词是“alkyl”（如：alkyl group 烷基、alkyl halide 卤代烷）。","词源上来自“alkyl”（烷基）；在有机化学中常用来区分“alkyl（脂肪族、非芳香族）”与“aryl（芳基、芳香族）”。"]}
{"word":"alkylidene","summary":{"en":"Alkylidene is a chemistry term for a divalent group (often =CR2) derived from an alkane, commonly involved in double-bond-type bonding, especially in organometallic contexts.","zh":"Alkylidene 是化学术语，指由烷烃衍生的二价基团（常写作 =CR2），常与其他原子形成类似双键的键合，尤常见于有机金属语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A chemical group derived from an alkane by removing two hydrogen atoms from the same carbon atom, forming a divalent substituent (often written as =CR2) that commonly makes a double bond to another atom.","zh":"（化学）亚烷基/亚烷撑基：由烷烃在同一个碳原子上去掉两个氢原子得到的二价取代基（常写作 =CR2），常与其他原子形成双键。"},"examples":[{"en":"In an alkylidene complex, the metal is often bonded to the carbon through a double bond (M=CR2).","zh":"在亚烷基配合物中，金属常通过双键与该碳相连（M=CR2）。"},{"en":"The term “alkylidene” is frequently used when discussing carbene-like ligands in organometallic chemistry.","zh":"在有机金属化学中讨论类卡宾配体时，“alkylidene”一词经常出现。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Chemistry, adjective use) Relating to or containing an alkylidene group.","zh":"（作形容词用，化学）与亚烷基有关的；含有亚烷基基团的。"},"examples":[{"en":"An alkylidene intermediate can be proposed for this reaction mechanism.","zh":"该反应机理可以提出一个亚烷基中间体。"},{"en":"Researchers compared alkylidene and alkyl ligands to understand bonding differences.","zh":"研究人员比较了亚烷基配体与烷基配体，以理解键合差异。"}]}],"synonyms":["alkane-derived divalent group","carbene-like (contextual)"],"phonetic":"/ˌæl.kəˈlɪˌdin/","extraExplanation":["“alkylidene”常见于有机金属与催化领域（例如烯烃复分解反应中提到的金属-亚烷基/金属卡宾物种）。学习时可把它与“alkyl”（烷基，R–，一价）对比：alkylidene 更像“二价的烷基”，常以“= ”表示与外界形成双键。","词形来源：alkyl（烷基）+ -idene（表示“二价/成双键的”一类命名后缀），因此多与双键结构和“carbene-like（类卡宾）”语境相关。"]}
{"word":"alkylize","summary":{"en":"Alkylize means to add an alkyl group to a molecule (to alkylate it).","zh":"alkylize 指使分子引入烷基，即對其進行烷基化（同 alkylate）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Chemistry) To introduce an alkyl group (such as methyl or ethyl) into a molecule; to convert a compound into an alkyl derivative.","zh":"（化學）使某分子引入烷基（如甲基、乙基）；使化合物烷基化，生成烷基衍生物。"},"examples":[{"en":"Chemists alkylize aromatic rings to change the compound’s reactivity.","zh":"化學家會對芳香環進行烷基化，以改變化合物的反應性。"},{"en":"The catalyst helps alkylize the substrate under mild conditions.","zh":"該催化劑可在溫和條件下促進底物烷基化。"}]}],"synonyms":["alkylate"],"phonetic":"/ˈæl.kə.laɪz/","extraExplanation":["「alkylize」常見於有機化學與工業化學語境，等同於更常用的拼法「alkylate」。兩者意思相同，但在論文、教科書與工業流程描述中「alkylate」更常見。","烷基化的結果通常會改變分子的物理性質（例如揮發性、溶解度）與化學性質（例如親核/親電反應傾向），因此常用於合成藥物、燃料添加物與材料前驅物等。"]}
{"word":"alkylogen","summary":{"en":"“Alkylogen” is an uncommon chemistry term for something that supplies or generates an alkyl group in a reaction.","zh":"“Alkylogen”是较少见的化学用语，指在反应中提供或生成烷基的物质/基团。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry, uncommon) A substance or group that provides or generates an alkyl group (an “alkyl” fragment such as –CH3 or –C2H5) in a reaction; an alkyl-group source.","zh":"（化学，较少见）在反应中提供或生成烷基（如 –CH3、–C2H5 等）的物质或基团；烷基来源/烷基供体。"},"examples":[{"en":"In some reaction schemes, an alkylogen is used to introduce a methyl group onto the molecule.","zh":"在一些反应设计中，会使用 alkylogen 来把一个甲基引入到分子上。"},{"en":"The paper describes the reagent as an alkylogen that can donate an ethyl group under mild conditions.","zh":"论文将该试剂描述为一种 alkylogen，可在温和条件下提供乙基。"}]}],"synonyms":["alkylating agent","alkyl donor","alkyl source"],"phonetic":"/ælˈkaɪlədʒən/","extraExplanation":["“alkylogen”不是常见英语词汇，主要可能出现在专业化学语境或旧文献/特定作者用法中。更常见的表达通常是 **alkylating agent**（烷基化试剂）、**alkyl donor**（烷基供体）或具体写出试剂名称。","也可能是拼写误差：你想查的也许是 **alkylogen**（另一种拼写）、**alkyl halide**（卤代烷）、或某个试剂/商品名。若你能提供句子或出处，我可以按上下文给出更准确的释义。"]}
{"word":"alkylol","summary":{"en":"Alkylol is a chemistry term meaning a hydroxyalkyl group/compound (an alkyl group with an –OH), and it can also be used as an adjective meaning “hydroxyalkyl.”","zh":"Alkylol 是化学术语，指“带有 –OH 的烷基（羟基烷基）”或相关化合物，也可作形容词表示“羟基烷基的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(chemistry) A hydroxyalkyl group or compound—an alkyl group that includes a hydroxyl (–OH) group; often used in names like “alkylol amine.”","zh":"（化学）烷基醇（基）/羟基烷基：指带有羟基（–OH）的烷基片段或相关化合物；常见于如“alkylol amine（烷基醇胺）”等名称中。"},"examples":[{"en":"The resin was modified with an alkylol compound to improve water resistance.","zh":"这种树脂用烷基醇类化合物进行改性，以提高耐水性。"},{"en":"Alkylol amines are used as intermediates in making surfactants.","zh":"烷基醇胺常用作生产表面活性剂的中间体。"}]},{"partOfSpeech":"adj.","definition":{"en":"(chemistry, describing a substance) Containing an alkyl group and a hydroxyl (–OH) group; hydroxyalkyl.","zh":"（化学，用于描述物质）含烷基并含羟基（–OH）的；羟基烷基的。"},"examples":[{"en":"An alkylol substituent can increase a molecule’s polarity.","zh":"烷基醇取代基可能会提高分子的极性。"}]}],"synonyms":["hydroxyalkyl","hydroxylated alkyl","alkanol (related)"],"phonetic":"/ˈæl.kɪˌlɔl/","extraExplanation":["“alkylol”多见于化工/材料类文献或产品说明中（如树脂、涂料、表面活性剂）。它不是日常英语词汇，更像是专业命名用语。","词源上可理解为 alkyl（烷基）+ -ol（表示醇/羟基相关），因此常与“带有 –OH 的烷基”这一概念绑定。"]}
{"word":"alkyloxy","summary":{"en":"Alkyloxy is a chemistry term for an –OR group (alkyl attached through oxygen), also called an alkoxy group.","zh":"Alkyloxy 是化学术语，指 –OR（烷基经由氧连接）的烷氧基/烷基氧基基团，也常称 alkoxy。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Having or relating to an alkyl group attached through an oxygen atom (–O–R), as in an alkoxy/alkyloxy substituent.","zh":"（化学）指烷基通过一个氧原子连接形成的基团（–O–R）；用于描述“烷氧基/烷基氧基”取代基。"},"examples":[{"en":"Methoxy (–OCH₃) is an alkyloxy group.","zh":"甲氧基（–OCH₃）是一种烷基氧基（烷氧基）基团。"},{"en":"The molecule has an alkyloxy substituent on the aromatic ring.","zh":"该分子在芳香环上带有一个烷基氧基（烷氧基）取代基。"}]},{"partOfSpeech":"n.","definition":{"en":"An alkyloxy (alkoxy) group itself: a substituent of the form –OR, where R is an alkyl group.","zh":"烷基氧基（烷氧基）基团本身：通式为 –OR 的取代基，其中 R 为烷基。"},"examples":[{"en":"Replacing a hydroxy group with an alkyloxy group can change solubility.","zh":"把羟基换成烷基氧基（烷氧基）基团会改变溶解性。"}]}],"synonyms":["alkoxy","alkoxyl (less common)"],"phonetic":"ˌæl.kɪlˈɑk.si","extraExplanation":["“alkyloxy”在实际英文资料里不如“alkoxy”常见；两者通常指同一类基团（–OR）。例如：methoxy（甲氧基）、ethoxy（乙氧基）、propoxy（丙氧基）。","命名小提示：当它作为取代基时常写作“alkoxy group”；当强调连接方式（经由氧原子连接）时，有时也会看到“alkyloxy”。"]}
{"word":"alkyls","summary":{"en":"“Alkyls” are alkyl groups—carbon-and-hydrogen groups like methyl or ethyl—attached to larger molecules in organic chemistry.","zh":"“Alkyls”指烷基（如甲基、乙基等），是在有机化学中连接到更大分子上的碳氢基团。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) Alkyl groups: groups of carbon and hydrogen atoms derived from an alkane by removing one hydrogen (e.g., methyl, ethyl). They often act as substituents attached to a larger molecule.","zh":"（化学）烷基：由烷烃去掉一个氢原子得到的碳氢基团（如甲基、乙基），常作为取代基连接在更大的分子上。"},"examples":[{"en":"Many organic molecules contain one or more alkyls attached to a carbon chain.","zh":"许多有机分子在碳链上连接着一个或多个烷基。"},{"en":"Replacing a hydrogen with an alkyl can change a compound’s boiling point and solubility.","zh":"用烷基取代一个氢原子会改变化合物的沸点和溶解性。"}]}],"synonyms":["alkyl groups","alkyl substituents"],"phonetic":"/ˈælkaɪlz/","extraExplanation":["“alkyl”来自动词“alk-（来自alkane，烷烃）+ -yl（表示基团）”。因此“alkyls”是其复数形式，常见于有机化学与药物化学的结构描述中。","常见烷基例子：methyl（甲基，CH₃–）、ethyl（乙基，C₂H₅–）、propyl（丙基，C₃H₇–）。在命名中常写作“an alkyl group”或“alkyl substituent”。"]}
{"word":"alkyne","summary":{"en":"An alkyne is an unsaturated hydrocarbon containing at least one C≡C triple bond.","zh":"alkyne 指“炔烃”：至少含一个碳-碳三键（C≡C）的不饱和烃。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of hydrocarbon that has at least one carbon–carbon triple bond (C≡C); alkynes are unsaturated and often end in “-yne” (e.g., ethyne/acetylene).","zh":"炔烃：一种至少含有一个碳-碳三键（C≡C）的烃类；属于不饱和烃，名称常以“-yne”（中文常译作“炔”）结尾，如 ethyne/acetylene（乙炔）。"},"examples":[{"en":"Ethyne (acetylene) is the simplest alkyne.","zh":"乙炔（acetylene）是最简单的炔烃。"},{"en":"Alkynes can react with hydrogen to form alkenes or alkanes.","zh":"炔烃可以与氢反应生成烯烃或烷烃。"}]}],"synonyms":["acetylene (specific example)","triple-bond hydrocarbon"],"phonetic":"/ˈælkaɪn/","extraExplanation":["命名提示：在有机化学里，含三键的链通常用后缀“-yne”；中文常把同一类物质叫“某某炔”（如 propyne 丙炔）。","学习对比：alkane（烷烃，只有单键）→ alkene（烯烃，含双键）→ alkyne（炔烃，含三键），不饱和程度逐渐增加。","常见语境：教材与实验室中，acetylene（乙炔）常被提到，因为它可用于气焊/切割等工业用途。"]}
{"word":"alkynes","summary":{"en":"Alkynes are hydrocarbons that contain a carbon–carbon triple bond (C≡C).","zh":"炔烃是含有碳—碳三键（C≡C）的烃类化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A class of organic compounds (hydrocarbons) that contain at least one carbon–carbon triple bond (C≡C).","zh":"炔烃：一类含有至少一个碳—碳三键（C≡C）的有机化合物（烃）。"},"examples":[{"en":"Ethyne (acetylene) is the simplest alkyne.","zh":"乙炔（acetylene）是最简单的炔烃。"},{"en":"In basic organic chemistry, students learn how to name alkenes and alkynes.","zh":"在基础有机化学中，学生会学习如何给烯烃和炔烃命名。"},{"en":"Some alkynes can be used as starting materials to make plastics, medicines, or fragrances.","zh":"一些炔烃可以作为原料，用来合成塑料、药物或香精。"}]}],"synonyms":["acetylenes"],"phonetic":"/ˈælkaɪnz/","extraExplanation":["“Alkyne”是化学命名中的一类词，复数是“alkynes”。类似的家族词还有：alkane（烷烃，单键）、alkene（烯烃，双键）、alkyne（炔烃，三键）。","在常见命名里，含三键的化合物英文名常以“-yne”结尾（如 ethyne）。日常学习中也会看到更常用的俗名 acetylene（乙炔）。"]}
