{"word":"ALM","summary":{"en":"“alm” most commonly refers to charity given to poor people (usually used as “alms”).","zh":"“alm”最常指对穷人的施舍（通常以复数“alms”出现）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(usually plural: alms) Money, food, or other help given to poor people as charity.","zh":"（通常用复数 alms）施舍；施赠给穷人的钱、食物或帮助。"},"examples":[{"en":"The temple collects alms for families in need.","zh":"寺庙为有需要的家庭募集施舍。"},{"en":"He gave alms to the homeless man outside the station.","zh":"他给车站外的流浪汉施舍。"},{"en":"In some traditions, giving alms is seen as a moral duty.","zh":"在一些传统中，施舍被视为一种道德责任。"}]},{"partOfSpeech":"n.","definition":{"en":"A type of tree related to the elm (less common in modern English).","zh":"一种与榆树相关的树（现代英语中较少见）。"},"examples":[{"en":"Old records mention alm trees along the river.","zh":"旧记录提到河边有 alm 树。"}]}],"synonyms":["charity","donation","handout","aid","relief"],"phonetic":"/ɑm/","extraExplanation":["“alm”作为“施舍”更常见的形式是复数“alms”，在宗教或传统语境里很常出现（如 Christianity/Islam/Buddhism 等的慈善实践）。单数“an alm”在现代英语里不太常见，通常直接说“alms”或用更日常的词如“donation / charity”。","词源上，“alms”来自希腊语 *eleēmosynē*（怜悯、施舍），因此常与“mercy / compassion（怜悯、同情）”这类概念同场出现。","文学与文化中常见搭配：“give alms（施舍）”“ask/beg for alms（乞讨）”“alms for the poor（济贫施舍）”。"]}
{"word":"Alma","summary":{"en":"Alma is commonly used as a female first name; in Spanish, alma also means “soul.”","zh":"Alma 常用作女性名字；在西班牙语中，alma 也有“灵魂”的意思。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (first name), used in many languages","zh":"（女性）名字“Alma”（常见名）"},"examples":[{"en":"Alma is starting a new job next week.","zh":"Alma 下周开始一份新工作。"},{"en":"I met Alma at a friend’s birthday party.","zh":"我在朋友的生日派对上认识了 Alma。"}]},{"partOfSpeech":"n.","definition":{"en":"(Spanish) “soul”; a poetic or emotional way to refer to a person’s inner spirit","zh":"（西班牙语）“灵魂”；常带诗意或情感色彩，指内在精神"},"examples":[{"en":"In Spanish, “alma” means “soul.”","zh":"在西班牙语里，“alma”的意思是“灵魂”。"},{"en":"The song speaks to the alma of the people.","zh":"这首歌触动了人们的灵魂。"}]}],"synonyms":["(Spanish sense) soul","spirit"],"phonetic":"/ˈɑlmə/","extraExplanation":["“Alma”作为英文人名在19世纪后更常见，常被认为来自拉丁语/西班牙语“alma”（灵魂）或希伯来语传统中“年轻女子/少女”等相关来源；不同文化对其词源解释可能略有差异。","注意区分：alma mater（拉丁语，意为“母校/培育者”）是常见短语，但它不是单独的“Alma”这个词的常用英文意思。"]}
{"word":"alma","summary":{"en":"Alma is most commonly a female name in English; it also means “soul” in Spanish and Portuguese.","zh":"Alma 在英语中最常见的是女性名字；在西班牙语和葡萄牙语中也可表示“灵魂”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (used in many languages).","zh":"女性名字（多种语言中使用）。"},"examples":[{"en":"Alma is starting a new job next week.","zh":"Alma 下周要开始一份新工作。"},{"en":"I met a musician named Alma at the festival.","zh":"我在音乐节认识了一位叫 Alma 的音乐人。"}]},{"partOfSpeech":"n.","definition":{"en":"in Spanish and Portuguese, “soul” (often used in a poetic or religious sense).","zh":"在西班牙语和葡萄牙语中指“灵魂”（常带诗意或宗教色彩）。"},"examples":[{"en":"In Spanish, alma means “soul.”","zh":"在西班牙语里，alma 的意思是“灵魂”。"},{"en":"The poem speaks to the alma of the people.","zh":"这首诗触及人民的灵魂。"}]}],"synonyms":["soul","spirit"],"phonetic":"/ˈɑlmə/","extraExplanation":["在英语里你可能常见到 “alma mater”（母校）。其中 alma 是拉丁语，意为“滋养的、仁慈的”，mater 意为“母亲”，合起来比喻“像母亲一样养育你的学校”。英语中常说 “my alma mater”（我的母校）。","作为人名 Alma 在英语世界更常见；它也与多种语言的词源有关（如西班牙语/葡萄牙语的 alma=灵魂），因此在文学或歌词里有时会被用来营造“灵魂、内心”的意象。"]}
{"word":"Alma-Ata","summary":{"en":"Alma-Ata is the older name for Almaty, a major city in Kazakhstan.","zh":"Alma-Ata 是哈萨克斯坦城市 Almaty（阿拉木图）的旧称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the former name of Almaty, the largest city in Kazakhstan (used especially during the Soviet period).","zh":"阿拉木图（Almaty 的旧称，哈萨克斯坦最大城市之一，苏联时期及较早英语资料中常用）。"},"examples":[{"en":"Many older maps label Almaty as Alma-Ata.","zh":"许多旧地图把阿拉木图标成 Alma-Ata。"},{"en":"She found a Soviet-era postcard sent from Alma-Ata.","zh":"她找到一张苏联时期从 Alma-Ata 寄出的明信片。"}]}],"synonyms":["Almaty","Alma Ata"],"phonetic":"/ˌæl.mə.əˈtɑː/","extraExplanation":["“Alma-Ata”是俄语/苏联时期常见的英文转写；如今国际上更常用官方名称“Almaty（阿拉木图）”。","在阅读历史材料（如冷战、苏联历史、旧旅行书或老地图）时常会遇到“Alma-Ata”。在现代新闻与官方文件中一般改用“Almaty”。","词源上常被解释为与当地突厥语系词根中“苹果”相关；阿拉木图地区以野生苹果（如塞维氏苹果）闻名。"]}
{"word":"Alma-Tadema","summary":{"en":"Alma-Tadema is the name of a famous painter known for detailed ancient Greek and Roman scenes.","zh":"Alma-Tadema 指一位以精细描绘古希腊、古罗马题材而闻名的画家。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Lawrence Alma-Tadema (1836–1912), a Dutch-born British painter best known for highly detailed scenes of ancient Greece and Rome (often called “Neo-Classical” or “Victorian classical” painting).","zh":"劳伦斯·阿尔玛-塔德玛（1836–1912），荷兰出生的英国画家，以描绘古希腊与古罗马的细腻场景而闻名（常被归为“新古典主义/维多利亚时期古典题材绘画”）。"},"examples":[{"en":"Alma-Tadema’s paintings often show marble architecture and elegant Roman life.","zh":"阿尔玛-塔德玛的画作常呈现大理石建筑与优雅的罗马生活场景。"},{"en":"The museum displayed an Alma-Tadema alongside other Victorian artists.","zh":"博物馆展出了一幅阿尔玛-塔德玛的作品，与其他维多利亚时期艺术家的作品并列。"}]}],"synonyms":["Lawrence Alma-Tadema","Sir Lawrence Alma-Tadema"],"phonetic":"/ˌæl.mə təˈdeɪ.mə/","extraExplanation":["“Alma-Tadema”通常指画家本人或其作品风格；更完整的姓名常写作“Sir Lawrence Alma-Tadema”。","他以对材质（尤其是大理石、金属、织物）与光线的逼真表现著称，影响过后来的电影美术与古典题材视觉想象。","中文艺术史语境中多译作“阿尔玛-塔德玛/阿尔马-塔德马”，英文中姓氏常带连字符（Alma-Tadema）。"]}
{"word":"almacantar","summary":{"en":"An almacantar is an imaginary circle in the sky parallel to the horizon, marking points of equal altitude.","zh":"almacantar 指与地平线平行的等高度圈，用来表示天空中高度角相同的点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In astronomy/navigation, a small circle on the celestial sphere that is parallel to the horizon; it connects points in the sky with the same altitude (the same angle above the horizon).","zh":"（天文学/航海）天球上与地平圈平行的小圆；连接天空中高度（离地平线的角度）相同的各点的圆。"},"examples":[{"en":"On a star chart, an almacantar shows all points at the same altitude above the horizon.","zh":"在星图上，almacantar 表示所有离地平线高度角相同的点。"},{"en":"Astrolabes use almacantars to help estimate a star’s altitude.","zh":"星盘（astrolabe）会用到 almacantar 来帮助估算恒星的高度角。"}]}],"synonyms":["almucantar","circle of equal altitude","equal-altitude circle"],"phonetic":"/ˌæl.məˈkæn.tɑr/","extraExplanation":["这个词更常见的拼写是 **almucantar**（也叫 *almucantar circle*）。在实际应用中，它常用于天文观测、导航，以及传统仪器（如星盘）上的刻度线，用来表示“同高度圈/等高度圈”。","词源来自阿拉伯语（带 *al-* 的外来词），经由中世纪拉丁语与欧洲天文学传统进入英语；因此它常出现在较偏专业或历史文献的语境里。"]}
{"word":"almacen","summary":{"en":"Almacén is a Spanish word meaning “warehouse,” and in many Latin American contexts it can also mean a small grocery/general store.","zh":"almacén 是西班牙语，常指“仓库”；在许多拉美语境中也可指“杂货店/小商店”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a warehouse or storage building; a place where goods are kept before they are sold or shipped","zh":"仓库；货物存放处（用于储存、周转商品）"},"examples":[{"en":"The company keeps spare parts in an almacén outside the city.","zh":"公司把备件存放在城外的一个仓库里。"},{"en":"The shipment stayed in the almacén until the paperwork was finished.","zh":"这批货一直待在仓库里，直到手续办完。"}]},{"partOfSpeech":"n.","definition":{"en":"(in many Latin American countries) a small store, often selling food and daily necessities; a grocery shop","zh":"（拉美多地）小商店；杂货店（常卖食品与日用品）"},"examples":[{"en":"I stopped by the almacén to buy bread and milk.","zh":"我去杂货店买了面包和牛奶。"},{"en":"There’s a neighborhood almacén on the corner.","zh":"街角有一家社区小店。"}]}],"synonyms":["warehouse","storage","store","shop","grocery (store)"],"phonetic":"/ˌɑlmäˈsɛn/","extraExplanation":["“almacén”是西班牙语词（重音在最后一音节：al-ma-CÉN）。英语里有时会在谈到西语语境或拉美文化时直接借用。","词源上与阿拉伯语有关（许多以“al-”开头的西班牙语词来自阿拉伯语影响），大意与“储存/仓储”相关。","不同地区用法略有差异：在一些国家更常指“杂货店/小卖部”，在商业或物流语境中更常指“仓库”。"]}
{"word":"almacenista","summary":{"en":"Spanish: someone who works in (or sometimes runs) a warehouse.","zh":"西班牙语：仓库工作人员（有时也指仓库经营/管理者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a warehouse worker; someone who receives, stores, organizes, and ships goods (similar to a stock clerk or warehouse clerk).","zh":"仓库工作人员；负责收货、入库、整理与发货的人（类似“仓库文员/理货员”）。"},"examples":[{"en":"The almacenista checked the delivery and recorded the items in the system.","zh":"仓库员核对了到货，并把货品录入系统。"},{"en":"Ask the almacenista where the spare parts are stored.","zh":"问一下仓库员备件放在哪里。"}]},{"partOfSpeech":"n.","definition":{"en":"in some regions, a person who runs or owns a warehouse or a storage business (less common than the “warehouse worker” sense).","zh":"在部分地区也指经营或拥有仓库/储运业务的人（不如“仓库工作人员”的意思常见）。"},"examples":[{"en":"He worked as an almacenista and later opened his own storage company.","zh":"他先做仓库相关工作，后来开了自己的仓储公司。"}]}],"synonyms":["warehouse worker","warehouse clerk","stock clerk","storekeeper"],"phonetic":"/ɑl.mɑ.seˈnis.tɑ/","extraExplanation":["“almacenista”来自西班牙语“almacén”（仓库/储藏室）。在不同国家和行业里，它既可能指一线仓库员工，也可能指仓库的管理/经营者；求职或合同文本里最好结合岗位职责（如收货、盘点、拣货、发货）来判断更准确的对应英文（warehouse worker / warehouse clerk / stockroom clerk 等）。"]}
{"word":"Almach","summary":{"en":"Almach is the traditional name for Gamma Andromedae, a bright star in the constellation Andromeda, famous as a colorful double star in telescopes.","zh":"Almach 是仙女座伽马星（Gamma Andromedae）的传统名称，是仙女座的一颗亮星，用望远镜观测时以色彩明显的双星效果而著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Astronomy) A bright star in the constellation Andromeda; the traditional name of Gamma Andromedae, known as a colorful double (multiple) star when viewed through a telescope.","zh":"（天文）仙女座中的一颗亮星；Gamma Andromedae（仙女座伽马星）的传统名称。用望远镜观测时以色彩对比明显的双星（多星）而闻名。"},"examples":[{"en":"Almach (Gamma Andromedae) is often recommended to beginner stargazers because it looks like a striking double star through a small telescope.","zh":"Almach（Gamma Andromedae，仙女座伽马星）常被推荐给入门观星者，因为用小型望远镜就能看到很惊艳的双星效果。"},{"en":"On autumn evenings in the Northern Hemisphere, you can try to locate Almach in the constellation Andromeda.","zh":"在北半球的秋季夜晚，你可以尝试在仙女座里找到 Almach。"}]}],"synonyms":["Almaak","Gamma Andromedae","γ Andromedae"],"phonetic":"/ˈæl.mæk/","extraExplanation":["词源上，Almach 是从阿拉伯语传统恒星名转写而来（常见解释与阿拉伯语 al-ʿanāq 有关，意为“野猫/猞猁一类的猫科动物”）。不同资料里也可见拼写变体，如 Almach / Almaak。","在英文语境中它多用于天文学与观星指南，属于“传统恒星名”（traditional star name），常与其拜耳命名 Gamma Andromedae 并列出现。"]}
{"word":"almach","summary":{"en":"Almach is the traditional name of a bright star in the constellation Andromeda (Gamma Andromedae).","zh":"Almach 是仙女座中一颗明亮恒星（仙女座γ，Gamma Andromedae）的传统名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Almach: a bright star in the constellation Andromeda (also called Gamma Andromedae), traditionally known as a “double star” because it appears as two stars through a telescope.","zh":"Almach：仙女座（Andromeda）中的一颗明亮恒星（又称仙女座γ，Gamma Andromedae）。传统上常被称为“双星”，因为用望远镜观测时会看到两颗星的效果。"},"examples":[{"en":"On clear nights, you can find Almach near the Great Square of Pegasus and the stars of Andromeda.","zh":"在晴朗的夜晚，你可以在飞马座大四边形附近找到 Almach，以及仙女座的一些恒星。"},{"en":"The astronomer pointed her telescope at Almach to show the contrast of colors in the pair.","zh":"天文学家把望远镜对准 Almach，展示那对星体颜色的对比。"}]}],"synonyms":["Gamma Andromedae","γ Andromedae"],"phonetic":"/ˈæl.mæk/","extraExplanation":["“Almach”这个名字来自阿拉伯语的恒星命名传统（许多亮星的英文名都源自阿拉伯语）。在不同资料中也可能看到拼写或指代略有差异，但现代天文学中常把它对应为“Gamma Andromedae（仙女座γ）”。"]}
{"word":"almaciga","summary":{"en":"Almaciga usually refers to a seedbed for starting seedlings (Spanish usage), and more rarely to a fragrant resin similar to mastic.","zh":"Almaciga通常指育苗床/苗圃地（西语用法），较少情况下也可指类似玛斯提克的芳香树脂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Spanish/Latin American context) a seedbed or nursery plot where seedlings are started before being transplanted.","zh":"（西班牙语/拉丁美洲语境）育苗床；苗圃地（先育苗再移栽的地方）。"},"examples":[{"en":"They sowed tomatoes in the almaciga and moved the seedlings later.","zh":"他们在育苗床里播种番茄，之后再把幼苗移栽。"},{"en":"The farmer prepared an almaciga to protect young plants from heavy rain.","zh":"农民准备了育苗床，以保护幼苗免受大雨影响。"}]},{"partOfSpeech":"n.","definition":{"en":"A fragrant resin (mastic) used in varnish, incense, and traditional remedies; sometimes spelled similarly in older texts.","zh":"一种芳香树脂（乳香/玛斯提克树脂），用于清漆、熏香和传统疗法；旧文献中偶见类似拼写。"},"examples":[{"en":"The artisan mixed resin with oil to make a glossy finish, using a gum like almaciga.","zh":"工匠把树脂和油混合做出光亮涂层，使用了类似“almaciga”的树脂。"},{"en":"Some traditional incense blends mention almaciga for its pine-like scent.","zh":"一些传统熏香配方会提到“almaciga”，因为它带有松香般的气味。"}]}],"synonyms":["seedbed","nursery bed","mastic","mastic resin"],"phonetic":"/ˌɑl.məˈsiɡ.ə/","extraExplanation":["“almáciga”在现代西班牙语里更常见（有重音符号），主要指“育苗床/苗圃地”。英语里偶尔会借用该词，多出现在农业、园艺或地区性写作中。","树脂义项常与“mastic（玛斯提克树脂）”相关；不同地区可能把某些树脂称作almáciga，因此具体指哪种树脂要看语境。"]}
{"word":"almacigo","summary":{"en":"almácigo: a Spanish term meaning a seedbed or plant nursery for starting seedlings (sometimes also the mastic tree).","zh":"almácigo：西班牙语词，指育苗床/苗圃（有时也指乳香树）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) a seedbed or plant nursery where seedlings are started before being transplanted.","zh":"（西班牙语）育苗床；苗圃（先育苗、后移栽的地方）。"},"examples":[{"en":"We raised tomato seedlings in an almácigo and transplanted them a month later.","zh":"我们在育苗床里育番茄苗，一个月后再移栽。"},{"en":"The community garden built a small almácigo for native plants.","zh":"社区花园建了一个小苗圃来培育本地植物。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) the mastic tree (Pistacia lentiscus) in some Spanish-speaking regions.","zh":"（较少见）乳香树／马士提克树（部分西语地区对 Pistacia lentiscus 的称呼）。"},"examples":[{"en":"In some places, ‘almácigo’ can also refer to the mastic tree.","zh":"在一些地方，“almácigo”也可以指乳香树。"}]}],"synonyms":["seedbed","nursery bed","plant nursery"],"phonetic":"/ˌɑl.məˈsi.ɡoʊ/","extraExplanation":["“almácigo”常见于拉美农业语境，相当于英语里的 seedbed / nursery bed。日常英语对话中多直接说 seedbed 或 nursery；在双语农业资料或本地用语中可能保留西语词。","拼写上常见重音符号：almácigo；没有重音符号的写法 almacigo 也会出现，但在正式西语中通常保留重音。"]}
{"word":"Almad","summary":{"en":"“Almad” isn’t a common English word; it’s usually a name or a misspelling (often of “almond”).","zh":"“Almad”不是常见英语单词；通常是人名或拼写错误（常见为“almond/杏仁”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most often seen as a personal name (a rare spelling) or as a misspelling/typo of another word (commonly “almond”).","zh":"不是标准英语单词。更常见的是作为人名（较少见的拼写），或是其他单词的拼写错误/笔误（常见的是“almond / 杏仁”）。"},"examples":[{"en":"I couldn’t find “Almad” in an English dictionary—did you mean “almond”?","zh":"我在英语词典里找不到“Almad”——你是不是想写“almond（杏仁）”？"},{"en":"Almad is listed as a name in some contexts, but it isn’t a common English vocabulary word.","zh":"在一些语境里，Almad 会被当作人名使用，但它不是常见的英语词汇。"}]}],"phonetic":"/ˈæl.mæd/","extraExplanation":["“Almad”很可能是拼写误差：\n- 如果你想表达食物“杏仁”，正确拼写通常是 **almond**。\n- 如果你指的是人名，请告诉我它的来源语言/国家（例如阿拉伯语、南亚等）或给我一句完整例句，我可以帮你确认读音与含义。"]}
{"word":"Almada","summary":{"en":"Almada is mainly a place name: a Portuguese city across the river from Lisbon; it can also be a surname.","zh":"Almada 主要是地名：葡萄牙与里斯本隔河相望的城市；也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city/municipality in Portugal, across the Tagus River from Lisbon, known for views of Lisbon and the Cristo Rei monument.","zh":"葡萄牙的城市／市镇，位于塔霍河（Tagus River）对岸、与里斯本相望，以观景点和“基督君王像”（Cristo Rei）闻名。"},"examples":[{"en":"We took the ferry from Lisbon to Almada for sunset views.","zh":"我们从里斯本坐渡轮到阿尔马达看日落。"},{"en":"Almada is on the south bank of the Tagus River.","zh":"阿尔马达在塔霍河南岸。"}]},{"partOfSpeech":"n.","definition":{"en":"A Portuguese (and Spanish-speaking) family name (surname).","zh":"葡萄牙语（也见于西班牙语地区）的姓氏。"},"examples":[{"en":"Her last name is Almada.","zh":"她的姓是阿尔马达（Almada）。"}]}],"phonetic":"/ɑlˈmɑdə/","extraExplanation":["Almada 常被旅行者与里斯本一起提到：从里斯本跨越“四月二十五日大桥”（Ponte 25 de Abril）或乘渡轮即可到达，那里有著名观景点与 Cristo Rei（基督君王像）。","作为地名时通常大写（Almada）；在句中可直接当作专有名词使用，例如 “in Almada / to Almada”。"]}
{"word":"Almaden","summary":{"en":"Almaden is a proper name mainly used for places (notably Almadén in Spain and several locations in California).","zh":"Almaden 多为专有名词，主要作地名使用（尤指西班牙阿尔马登及加州若干地点）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a place name used for several locations, especially Almadén (a town in Spain famous for mercury mining) and places in California such as Almaden Valley and Almaden Quicksilver County Park.","zh":"专有地名，用于多个地点，尤指西班牙的阿尔马登（以汞/水银采矿闻名的小镇），以及美国加州的 Almaden Valley（阿尔马登谷）和 Almaden Quicksilver County Park（阿尔马登水银县立公园）。"},"examples":[{"en":"IBM Almaden Research Center is located in San Jose, California.","zh":"IBM 阿尔马登研究中心位于加州圣何塞。"},{"en":"We went hiking at Almaden Quicksilver County Park last weekend.","zh":"我们上周末去阿尔马登水银县立公园徒步了。"},{"en":"Almadén, Spain, was once one of the world’s most important mercury-mining areas.","zh":"西班牙的阿尔马登曾是世界上最重要的汞矿区之一。"}]}],"synonyms":["Almadén (Spain)","Almaden Valley","Almaden Quicksilver County Park"],"phonetic":"/ˈælməˌdɛn/","extraExplanation":["“Almaden/Almadén”这个地名常被认为与阿拉伯语来源有关：al-（“the”）+ ma‘din（“矿、矿山”），大意接近“那座矿山/矿区”。在伊比利亚半岛的历史上，阿拉伯语对地名影响很常见。","西班牙阿尔马登因汞（也叫水银，quicksilver）矿闻名，历史上曾长期供应重要的汞资源；加州的“Almaden Quicksilver”地名也与早期水银矿业历史有关。"]}
{"word":"almadia","summary":{"en":"Almadia is a (rare) word for a small canoe-like boat, especially a dugout used in West Africa.","zh":"Almadia 是一个较少见的词，指小型独木舟式船只，尤指西非常见的独木船。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small boat or canoe (often a dugout), especially one used in parts of West Africa; sometimes used more generally for a light local boat.","zh":"（尤指西非使用的）小船/独木舟（常为独木挖成）；有时也泛指当地的轻便小船。"},"examples":[{"en":"They crossed the river in an almadia made from a single tree trunk.","zh":"他们乘一条由整段树干挖成的 almadiа（独木舟）渡过了河。"},{"en":"Fishermen pulled their almadias up onto the sand at sunset.","zh":"日落时，渔民把他们的 almadias 拖上沙滩。"}]}],"synonyms":["canoe","dugout","small boat"],"phonetic":"/ɑlˈmɑdiə/","extraExplanation":["“almadia”属于较少见的词，多出现在旅行写作、历史/民族志（ethnography）或描述地方船只的语境中。","词源上常被认为与阿拉伯语定冠词“al-”有关（许多借入西班牙语/葡萄牙语的词都有这个前缀），也与伊比利亚语言及非洲沿海地区的接触历史相关；不同资料里也可能见到拼写变体，如“almadie/almady”。"]}
{"word":"almadie","summary":{"en":"An almadie is a West African canoe, often a dugout, used for travel and fishing.","zh":"almadie 指西非常见的独木舟/小舟，常由独木挖成，用于出行与捕鱼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long, narrow canoe (often a dugout) used especially in West Africa for travel and fishing","zh":"（尤指西非使用的）独木舟/长而窄的小舟（常为独木挖成），用于出行和捕鱼"},"examples":[{"en":"Fishermen paddled an almadie out into the lagoon at dawn.","zh":"渔民在黎明时分划着一只独木舟驶向潟湖。"},{"en":"We crossed the river in an almadie made from a single tree trunk.","zh":"我们乘坐一只由整段树干挖成的独木舟渡过了河。"},{"en":"The guide tied our bags to the almadie so they wouldn’t get wet.","zh":"向导把我们的包绑在独木舟上，以免被水打湿。"}]}],"synonyms":["canoe","dugout canoe","pirogue"],"phonetic":"/ˈælmədi/","extraExplanation":["“almadie”常见于旅行写作、人类学/民族志、殖民时期或法语背景的英语文本中，指西非沿海与河流地区常用的小舟；在现代日常英语里更常用“canoe”或更具体的“dugout canoe”。","词形有时也写作“almady”。相关近义词包括“pirogue”（皮罗格独木舟，亦常指类似的传统小舟）。"]}
{"word":"Almagest","summary":{"en":"The Almagest is Ptolemy’s influential ancient astronomy book explaining a geocentric universe.","zh":"Almagest 指托勒密的经典古代天文学著作《天文学大成》，以地心宇宙模型著称且影响深远。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a famous ancient Greek astronomy textbook by Ptolemy (2nd century CE), which explained a geocentric (Earth-centered) model of the universe and was highly influential for centuries","zh":"《天文学大成》（Almagest）：古希腊天文学家托勒密（公元2世纪）的一部著名天文学著作，阐述以地球为中心的宇宙模型，并在数百年间影响深远"},"examples":[{"en":"In medieval Europe, scholars studied the Almagest to learn astronomy.","zh":"在中世纪的欧洲，学者们通过研读《天文学大成》来学习天文学。"},{"en":"The Almagest shaped astronomical thinking until the rise of Copernicus.","zh":"《天文学大成》影响了天文学思想，直到哥白尼时代的兴起。"}]}],"synonyms":["Ptolemy’s Almagest","Almagest (Ptolemy)"],"phonetic":"ˈæl.mə.dʒɛst","extraExplanation":["“Almagest”这个名字来自阿拉伯语定冠词“al-”加上希腊语“megistē”（意为“最伟大的”）的转写，含有“最伟大的（著作）”之意。","这部作品的希腊原名常被译为《数学汇编》（Mathematical Syntaxis）。它在伊斯兰世界被保存、注释并传播，后来又经由拉丁译本回到欧洲。"]}
{"word":"almagest","summary":{"en":"The Almagest is Ptolemy’s classic astronomy work presenting an Earth-centered universe model.","zh":"Almagest 指托勒密的经典天文学著作《天文学大成》，核心内容是地心宇宙模型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a famous ancient Greek astronomy book by Claudius Ptolemy (2nd century CE) that explains a geocentric (Earth-centered) model of the universe and catalogs celestial observations.","zh":"《天文学大成》（Almagest）：古希腊天文学家托勒密（公元2世纪）的一部重要著作，阐述以地球为中心的宇宙模型，并记录与整理大量天体观测资料。"},"examples":[{"en":"In the Middle Ages, scholars in Europe studied the Almagest through Arabic translations.","zh":"在中世纪，欧洲学者常通过阿拉伯语译本研读《天文学大成》。"},{"en":"The Almagest shaped astronomy for more than a thousand years before Copernicus proposed a heliocentric model.","zh":"在哥白尼提出日心说之前，《天文学大成》对天文学的影响持续了一千多年。"}]}],"synonyms":["Ptolemy’s Almagest","Ptolemy’s treatise on astronomy"],"phonetic":"/ˈæl.mə.dʒɛst/","extraExplanation":["“Almagest”一词来自阿拉伯语定冠词“al-”加上对希腊语书名的转写；原本的希腊语标题常译作“伟大的（著作）”。","这本书系统化了“本轮—均轮”等数学工具，用来解释行星逆行等现象；即使后来被日心说取代，它仍是科学史与天文学史的重要里程碑。"]}
{"word":"almagests","summary":{"en":"“Almagests” is the plural of “Almagest,” usually referring to Ptolemy’s classic astronomy book, and rarely to similar authoritative scientific classics.","zh":"“almagests”是“Almagest”的复数，通常指托勒密的天文学经典《天文学大成》，也可（较少见）泛指类似的权威科学经典。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Almagest: a famous ancient Greek book on astronomy by Ptolemy (2nd century CE), long used as a key authority on the motions of the Sun, Moon, and planets","zh":"《天文学大成》（Almagest）：古希腊天文学家托勒密（公元2世纪）所著的经典天文学著作，长期被视为研究日月行星运动的重要权威来源"},"examples":[{"en":"In medieval Europe, scholars studied the Almagest through Arabic and Latin translations.","zh":"在中世纪欧洲，学者通过阿拉伯文和拉丁文译本研读《天文学大成》。"},{"en":"The Almagest shaped astronomy for centuries before the Copernican model became widely accepted.","zh":"在哥白尼体系被广泛接受之前，《天文学大成》数百年间深刻影响了天文学。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) authoritative scientific works like the Almagest; used as a plural to mean “classic reference texts,” especially in astronomy","zh":"（罕见）类似《天文学大成》那样的权威科学经典；用复数泛指“经典参考著作”，尤用于天文学语境"},"examples":[{"en":"Early modern astronomers compared new observations with the old almagests of the ancients.","zh":"近代早期的天文学家把新观测结果与古人的那些“权威经典”（almagests）进行对照。"}]}],"synonyms":["Ptolemy’s Almagest","astronomical treatise","classic reference work"],"phonetic":"/ˈæl.mə.dʒɛst/","extraExplanation":["“Almagest”一词经由阿拉伯语传入欧洲，常被认为来自阿拉伯语定冠词“al-”加上对希腊语“最大（的）”一词（megistē）的借用，含义接近“最伟大的（著作）”。","原书系统整理了地心宇宙模型与几何计算方法，并提供恒星表；它在伊斯兰世界与欧洲学术传统中都具有极高影响力。","英文里“almagests”多见于学术或文学性写作，用来强调“像《天文学大成》那样的经典权威”。"]}
{"word":"almagra","summary":{"en":"Almagara is a term for red ochre—a natural red earth used as a pigment, especially in traditional crafts and historic contexts.","zh":"Almagara指红赭土/红赭石颜料：一种天然红色土，用作颜料，常见于传统工艺和历史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural red earth (red ochre) used as a pigment or dye, often rich in iron oxide","zh":"（天然）红色赭土；红赭石颜料（常含氧化铁，用作颜料或染料）"},"examples":[{"en":"The potter colored the clay with almagra to give it a warm, reddish tone.","zh":"陶工用almagra给黏土上色，使它呈现温暖的红色调。"},{"en":"Old walls sometimes show traces of almagra where the paint has worn away.","zh":"老墙上有时能看到油漆磨损后露出的almagra痕迹。"}]},{"partOfSpeech":"n.","definition":{"en":"the pigment or coating made from this red earth, used especially in traditional crafts and some historic architecture","zh":"由这种红赭土制成的颜料/涂层（尤见于传统工艺与部分历史建筑）"},"examples":[{"en":"They repaired the facade using a traditional almagra wash.","zh":"他们用传统的almagra涂刷料修复了外立面。"},{"en":"The artisan demonstrated how to mix almagra with water and binder.","zh":"工匠演示了如何把almagra与水和黏结剂混合。"}]}],"synonyms":["red ochre","ochre","hematite pigment","iron oxide pigment"],"phonetic":"/ælˈmɑɡrə/","extraExplanation":["“almagra”是外来词，主要见于与西班牙语文化相关的语境，常指“红赭土/红赭石颜料”。词源可追溯到阿拉伯语“al-”(定冠词“the”) + “maghra”（赭土/红土），后来进入西班牙语并被英语在专业或地区性语境中借用。","在日常英语里更常用的说法是“red ochre/ochre”。“almagra”更偏向历史、考古、传统工艺或地方材料名称。"]}
{"word":"almah","summary":{"en":"*Almah* most commonly refers to a Hebrew word meaning “young woman,” often discussed in Bible translation; it can also mean a historical Middle Eastern female entertainer (often spelled *almeh*).","zh":"*Almah* 多指希伯来语“年轻女子”（常见于《圣经》翻译讨论）；也可指历史上的中东女艺人（常拼作 *almeh*）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Hebrew) a young woman of marriageable age; sometimes translated as “virgin,” especially in religious contexts.","zh":"（源自希伯来语）指适婚年龄的年轻女子；在宗教语境中有时被译为“童贞女/处女”。"},"examples":[{"en":"In some Bible translations, *almah* in Isaiah 7:14 is rendered as “virgin.”","zh":"在一些《圣经》译本中，《以赛亚书》7:14 里的 *almah* 被译作“童贞女/处女”。"},{"en":"Scholars debate whether *almah* emphasizes age and status more than sexual experience.","zh":"学者常讨论 *almah* 是否更强调年龄与身份，而不一定强调性经验。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) a Middle Eastern female singer, dancer, or entertainer, especially in 18th–19th century Egypt; also spelled *almeh* or *almée*.","zh":"（历史用法）中东地区的女歌者、舞者或艺人，尤指18–19世纪埃及；亦拼作 *almeh* 或 *almée*。"},"examples":[{"en":"Travel writers in the 1800s sometimes described an *almah* performing at celebrations.","zh":"19世纪的一些旅行记述会描写 *almah* 在庆典上表演。"},{"en":"The term *almeh* appears in older English accounts of Egyptian music and dance.","zh":"在较早的英文记载中，*almeh* 这一拼写常出现在关于埃及音乐与舞蹈的描述里。"}]}],"synonyms":["young woman","maiden","almeh"],"phonetic":"/ˈɑlmə/","extraExplanation":["*almah*（希伯来语 עַלְמָה）在英语讨论中最常见于《以赛亚书》7:14 的翻译争议：有些传统译为“virgin（处女）”，但在语言学与文本研究里也常被理解为“年轻女子”。另一个常被拿来对比的词是 *betulah*（有时更明确指“处女”，但语义也会随语境变化）。","“埃及女艺人”的意义多见于欧洲语言的转写与旅行文学中，拼写常见 *almeh/almée*；现代英语里这一用法较少见，通常出现在历史或文化研究语境。"]}
{"word":"almahs","summary":{"en":"“Almahs” usually means the plural of “almah,” a Biblical Hebrew term for a young woman/maiden, often discussed in Bible translation contexts.","zh":"“almahs”通常是“almah”的复数；“almah”是《圣经》希伯来语中指“年轻女子/未婚少女”的词，常出现在圣经翻译讨论里。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(From Biblical Hebrew) a young woman of marriageable age; a maiden.","zh":"（源自《圣经》希伯来语）年轻女子；未婚少女。"},"examples":[{"en":"Some Bible translations debate how to render the Hebrew word “almah.”","zh":"一些《圣经》译本会讨论希伯来语“almah”应如何翻译。"},{"en":"In Isaiah 7:14, the term “almah” is central to a long-standing translation discussion.","zh":"在《以赛亚书》7:14 中，“almah”是一个长期翻译讨论的关键。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural form: almahs (less common); more standard plural: almahs or almah (context-dependent).","zh":"复数形式：almahs（较少见）；更常见的复数写法仍为 almahs（也有人在特定语境中用 almah 表类指）。"},"examples":[{"en":"The author uses “almahs” as the plural of “almah.”","zh":"作者用“almahs”作为“almah”的复数。"}]}],"synonyms":["maiden","young woman","girl (context-dependent)"],"phonetic":"/ˈɑlmə/","extraExplanation":["你输入的“almahs”更像是“almah”的复数拼写。**almah** 常见于《圣经》研究与译经讨论中，通常指“年轻女子/未婚少女”。它与希伯来语 **betulah**（更明确的“处女”）经常被拿来对比，因此在宗教与翻译语境里会引发不同理解。","注意不要把它和阿拉伯语/埃及语境中的 **almeh/almah**（指歌舞表演的女子）混为一谈；那是另一条词源与文化背景。"]}
{"word":"Almain","summary":{"en":"Almain is an old word for a Renaissance court dance (and its music), more commonly called an allemande today.","zh":"Almain 是一个古旧词，指文艺复兴时期的宫廷舞蹈（及其舞曲），今天更常写作 allemande。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A lively, stately dance popular in Europe in the 16th–17th centuries; also the music/tune written for this dance.","zh":"（历史用语）16—17世纪欧洲流行的一种活泼而庄重的舞蹈；也可指为这种舞蹈写的曲子/舞曲。"},"examples":[{"en":"In the play, the musicians strike up an almain and the couple begins to dance.","zh":"在剧中，乐师奏起一支阿尔曼舞曲，这对恋人便开始起舞。"},{"en":"The book mentions an almain among other court dances of the Renaissance.","zh":"这本书在介绍文艺复兴时期的宫廷舞蹈时提到了阿尔曼舞。"}]}],"synonyms":["allemande"],"phonetic":"/ælˈmeɪn/","extraExplanation":["“almain”是较古旧的拼写形式，现代英语里更常见的是“allemande”。它与“German（德国的）”有关：在法语中“allemande”原意为“德国的（舞）”，后来进入英语，用来指一种当时被认为具有“德国风格”的宫廷舞蹈。","在英国文艺复兴时期的文学/戏剧中偶尔会出现该词（例如描写宫廷娱乐、舞会场景时），但在日常现代英语中几乎不使用，更多见于历史、音乐史、舞蹈史语境。"]}
{"word":"almain","summary":{"en":"Almain is an old term for a European court dance (and its music), more commonly called an “allemande.”","zh":"Almain 指一种欧洲古老的宫廷舞（及其舞曲），现代更常称为 allemande。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An old European dance (also spelled “allemande”), popular in the 16th–17th centuries; sometimes also the music written for this dance.","zh":"一种欧洲古老舞蹈（也可拼作“allemande / allemande”），在16–17世纪较流行；也可指为这种舞蹈创作的乐曲。"},"examples":[{"en":"In the play, the musicians strike up an almain and the courtiers begin to dance.","zh":"在剧中，乐师奏起一段阿尔曼舞曲，宫廷侍从们便开始起舞。"},{"en":"The composer included an almain among other court dances in his collection.","zh":"这位作曲家在作品集中收录了一首阿尔曼舞曲，与其他宫廷舞曲并列。"}]}],"synonyms":["allemande","court dance"],"phonetic":"/ˈæl.meɪn/","extraExplanation":["“almain”是较古旧的英文拼写，现代更常见的是“allemande”。它源自表示“德国的（German）”的词，因此也常被理解为“德式舞/德式舞曲”。","在文学与戏剧（尤其是莎士比亚时期的作品）里，“almain”常用来营造宫廷娱乐、社交舞会或古典氛围；今天多见于历史研究、古乐（early music）语境。"]}
{"word":"almaine","summary":{"en":"“almaine” is an archaic word meaning an allemande—a German-origin dance/music form from the Renaissance and Baroque traditions.","zh":"“almaine”是古语，指“allemande（阿勒曼德舞曲）”，一种源自德国、常见于文艺复兴与巴洛克传统的舞蹈/乐曲体裁。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) A Renaissance dance and musical form of German origin; an old spelling of “allemande.”","zh":"（古语）一种源自德国的文艺复兴时期舞蹈与音乐体裁；“allemande（阿勒曼德舞曲）”的旧拼写。"},"examples":[{"en":"The lute book includes an almaine followed by a courante.","zh":"这本鲁特琴曲集中有一首阿勒曼德舞曲（almaine），后面接着一首库朗特舞曲。"},{"en":"In some old texts, “almaine” is simply the older spelling of “allemande.”","zh":"在一些旧文本中，“almaine”只是“allemande”的旧拼写。"}]}],"synonyms":["allemande","German dance (historical)"],"phonetic":"/ɑlˈmeɪn/","extraExplanation":["“Almaine”多见于16–17世纪的英文文献与乐谱中，后来拼写逐渐固定为法语形式“allemande”。它常与其他巴洛克舞曲（如courante、sarabande、gigue）一起出现在组曲（suite）里。"]}
{"word":"Almallah","summary":{"en":"Almallah is typically a surname (a family/last name), not a common English vocabulary word.","zh":"Almallah 通常是一个姓氏（英文里的 last name），而不是常见的英语词汇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), most commonly found in Arabic-speaking communities; used as a last name for people","zh":"一个姓氏（家族名），常见于阿拉伯语社群；用作人的英文姓（last name）"},"examples":[{"en":"Dr. Almallah will speak at the conference tomorrow.","zh":"Almallah 医生将在明天的会议上发言。"},{"en":"My neighbor’s last name is Almallah.","zh":"我邻居的姓是 Almallah。"}]}],"phonetic":"/ˌælˈmɑːlə/","extraExplanation":["“Almallah”不是常见的英语词汇，更常见的是人名/姓氏的拉丁字母拼写（transliteration）。在英文语境里通常保留原拼写并首字母大写。","不同家庭或地区可能出现拼写变体（例如连字符、双写字母差异等），发音也会因个人习惯与方言而略有变化。若你是在特定文章/新闻中看到它，可以提供句子，我可以帮你更准确判断来源与含义。"]}
{"word":"Alman","summary":{"en":"“Alman” is a Turkish word meaning “German” (a German person or something from Germany).","zh":"“Alman”是土耳其语，意思是“德国人”或“德国的/来自德国的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a German person; “German” (common in Turkish; also used as online slang)","zh":"德国人；“德国的/德国人”（土耳其语常用，也常见于网络用语）"},"examples":[{"en":"In Turkish, “Alman” means “German.”","zh":"在土耳其语里，“Alman”意思是“德国人/德国的”。"},{"en":"He’s Alman, but he speaks Turkish very well.","zh":"他是德国人，但土耳其语说得很好。"}]},{"partOfSpeech":"adj.","definition":{"en":"German (describing something from Germany)","zh":"德国的（用来描述来自德国的事物）"},"examples":[{"en":"Alman culture has influenced many European traditions.","zh":"德国文化影响了许多欧洲传统。"},{"en":"They bought an Alman car brand.","zh":"他们买了一款德国汽车品牌。"}]}],"synonyms":["German"],"phonetic":"/ˈɑl.mɑn/","extraExplanation":["“Alman”主要是土耳其语词。在英语语境中，它通常出现在与土耳其文化、移民社区或网络讨论相关的内容里，而不是标准英语词汇。","在部分网络语境里，“Alman”可能被用作带刻板印象的调侃标签（类似“典型德国人”的梗）。使用时要注意场合与语气，避免冒犯。"]}
{"word":"alman","summary":{"en":"“Alman” is an informal borrowed word meaning “German / a German person,” commonly influenced by Turkish usage.","zh":"“Alman”是一个借词（多受土耳其语影响）的非正式说法，意思是“德国/德国人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(chiefly in Turkish or informal cross-cultural contexts) a German person; German.","zh":"（主要见于土耳其语或跨文化的非正式语境）德国人；德国的（人/事物）。"},"examples":[{"en":"He speaks Turkish and calls his German friend an Alman.","zh":"他会说土耳其语，会把他的德国朋友叫作“Alman”。"},{"en":"In Turkey, people often say “Alman” instead of “German.”","zh":"在土耳其，人们常说“Alman”，而不是“German”。"}]},{"partOfSpeech":"adj.","definition":{"en":"German; relating to Germany (used informally, often influenced by Turkish).","zh":"德国的；与德国有关的（非正式用法，常受土耳其语影响）。"},"examples":[{"en":"They bought an Alman car brand.","zh":"他们买了一个德国汽车品牌。"}]}],"synonyms":["German"],"phonetic":"/ˈɑl.mən/","extraExplanation":["“Alman”来自土耳其语，意思就是“德国人/德国的”。在英语里它不是标准词汇；正式写作一般用“German”。","在一些跨文化交流、移民社群或网络语境中，人们可能会直接借用“Alman”来指代德国人，有时带点调侃或刻板印象的意味；使用时注意场合与语气，避免冒犯。"]}
{"word":"almanac","summary":{"en":"An almanac is usually an annually published reference with calendars, weather/astronomy info, and statistics; it can also mean a themed collection of facts and tips.","zh":"almanac 通常指每年出版的年鉴（含日历、天气/天文信息和统计资料）；也可泛指按主题或日期整理的小知识与资料汇编。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a book or website published each year that lists useful facts such as calendars, weather information, astronomical events, and statistics","zh":"（通常每年出版的）年鉴；包含日历、天气/天文信息和各类统计资料的工具书或网站"},"examples":[{"en":"My grandfather still keeps a farmers’ almanac to check the best time to plant vegetables.","zh":"我爷爷还留着一本《农民年鉴》，用来查看种菜的最佳时间。"},{"en":"The almanac includes sunrise times, moon phases, and historical weather averages.","zh":"这本年鉴包含日出时间、月相以及历史平均气象数据。"}]},{"partOfSpeech":"n.","definition":{"en":"a collection of short pieces of information (quotes, tips, facts), often arranged by date or topic","zh":"（按日期或主题整理的）资料汇编；格言/小知识/提示集"},"examples":[{"en":"The magazine runs a travel almanac with quick facts about each country.","zh":"这本杂志有一个“旅行资料汇编”，提供各国的速查信息。"}]}],"synonyms":["yearbook","reference book","handbook","calendar"],"phonetic":"/ˈɔl.məˌnæk/","extraExplanation":["“almanac”常让人联想到《The Old Farmer’s Almanac》（《老农民年鉴》），在美国文化里很有名，传统上用来参考农事、节气、月相与天气趋势（注意：它的长期天气预测更多是传统/经验性质，不等同于现代气象预报）。","词源上，“almanac”经由中世纪拉丁语/古法语进入英语，历史上指一种包含历法与天象信息的“年表/历书”。"]}
{"word":"almanacs","summary":{"en":"Almanacs are yearly books or calendars that provide dates and practical information (often weather and astronomy), and can also mean a yearly collection of facts or statistics.","zh":"almanacs 指年鉴/历书：每年出版，提供日期与实用信息（常见天气、天文等）；也可指按年发布的资料或统计汇编。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A yearly reference book or calendar that lists important dates and often includes weather forecasts, astronomical information (sunrise, tides, moon phases), and other practical facts.","zh":"（通常每年出版的）年鉴；一种参考书/日历，列出重要日期，并常包含天气预测、天文信息（日出、潮汐、月相）等实用资料。"},"examples":[{"en":"My grandfather still buys a farmer’s almanac every year to plan his garden.","zh":"我爷爷每年都会买一本《农夫年鉴》来规划种菜。"},{"en":"The almanac shows sunrise and sunset times for each day.","zh":"这本年鉴列出了每天的日出和日落时间。"}]},{"partOfSpeech":"n.","definition":{"en":"A collection of facts, statistics, or information about a particular topic, published regularly (often yearly).","zh":"（某一主题的）资料汇编/统计年鉴；定期（常为每年）出版的信息与数据汇总。"},"examples":[{"en":"The company published an almanac of industry trends and key numbers.","zh":"这家公司发布了一本行业趋势与关键数据的统计年鉴。"},{"en":"She used a historical almanac to check population figures from the 1800s.","zh":"她用历史年鉴查找19世纪的人口数据。"}]}],"synonyms":["yearbook","annual","calendar","reference book","compendium"],"phonetic":"/ˈɔl.mə.næk/","extraExplanation":["“almanac”来源与阿拉伯语有历史关联，后来在欧洲被广泛用作“日历+实用知识汇编”。英语里常见搭配有 *Farmer’s Almanac*（《农夫年鉴》），在北美文化中常与农业、天气经验预测联系在一起。","单数是 **almanac**，复数是 **almanacs**（你输入的是复数形式）。"]}
{"word":"almander","summary":{"en":"“Almander” is usually a nonstandard spelling of “salamander” (an amphibian); in folklore it can also refer to a fire-resisting mythical creature.","zh":"“almander”通常是 “salamander（蝾螈/火蜥蜴）”的非标准拼写；在民俗传说中也可指不怕火的神话生物意象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard) A misspelling or rare variant of “salamander,” an amphibian that looks like a lizard (often with a long tail).","zh":"（非标准）常见于对 “salamander（蝾螈/火蜥蜴）” 的拼写错误或少见变体；指一种外形像蜥蜴、通常有长尾巴的两栖动物。"},"examples":[{"en":"I think you mean “salamander,” not “almander.”","zh":"我想你要写的是 “salamander”，不是 “almander”。"},{"en":"A salamander (sometimes misspelled as “almander”) can regrow its tail.","zh":"蝾螈（有时会被拼错成 “almander”）可以再生尾巴。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literary/folklore, via “salamander”) A mythical creature believed to live in fire or resist flames.","zh":"（文学/民俗；源自 “salamander”）传说中能栖身火中或不怕火的生物（“火蜥蜴”意象）。"},"examples":[{"en":"In old stories, the salamander was said to survive in fire.","zh":"在古老传说里，火蜥蜴据说能在火中存活。"},{"en":"The poet compared her courage to a salamander in flames.","zh":"诗人把她的勇气比作烈焰中的火蜥蜴。"}]}],"synonyms":["salamander","newt"],"phonetic":"/ˈsæl.əˌmæn.dɚ/","extraExplanation":["“almander”在现代英语中不是常用标准拼写。大多数情况下，你想表达的是 “salamander”。如果你是在某本旧书、方言文本或游戏/奇幻设定里看到 “almander”，它可能是作者的变体拼写或专有名词；建议提供句子，我可以帮你判断具体含义。"]}
{"word":"almandine","summary":{"en":"Almandine is a type of garnet gemstone, typically deep red; it can also mean a deep-red color.","zh":"Almandine 指一种石榴石宝石（常为深红色），也可作形容词表示“深红色的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a common type of garnet (a gemstone), usually deep red to reddish-brown, often used in jewelry","zh":"一种常见的石榴石（宝石），颜色多为深红到红褐色，常用于珠宝首饰"},"examples":[{"en":"The ring is set with an almandine garnet that looks like dark red wine.","zh":"这枚戒指镶着一颗铁铝榴石（almandine），颜色像深红葡萄酒一样。"},{"en":"Victorian jewelry often featured almandine because it was beautiful and widely available.","zh":"维多利亚时期的首饰常用铁铝榴石，因为它漂亮而且容易获得。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing a deep red color like that of almandine garnet","zh":"（颜色）指像铁铝榴石那样的深红色"},"examples":[{"en":"She chose an almandine dress for the winter party.","zh":"她为冬季聚会选了一条深红色（almandine）的连衣裙。"}]}],"synonyms":["garnet","red garnet","deep red"],"phonetic":"/ˈæl.mənˌdiːn/","extraExplanation":["词源小知识：almandine 来自中世纪拉丁语 *almandinus*，与古代小亚细亚（今土耳其一带）的城市 Alabanda 有关；历史上那里以宝石贸易闻名，因此这种石榴石的名称与地名产生了联系。","在珠宝语境里，almandine 常与其他“garnet（石榴石）”种类一起出现；日常英语里更常直接说 “garnet”，而在更专业或更精确的描述中才会用 “almandine”。"]}
{"word":"almandines","summary":{"en":"Almandines are deep red garnet gemstones (plural of almandine).","zh":"Almandines 指深红色的石榴石宝石（almandine 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Deep red to reddish-brown gemstones of the garnet family; plural of *almandine*.","zh":"深红到红褐色的石榴石宝石；*almandine*（铁铝榴石、红榴石）的复数。"},"examples":[{"en":"The necklace was set with small almandines that looked like dark red wine in the light.","zh":"这条项链镶着小小的红榴石，在光下像深红葡萄酒一样。"},{"en":"Medieval jewelry often used almandines because they were durable and richly colored.","zh":"中世纪的首饰常用红榴石，因为它们耐磨而且颜色浓郁。"}]}],"synonyms":["garnets","red garnets","almandine garnets"],"phonetic":"/ˈæl.mən.diːn/","extraExplanation":["“Almandine”一词与古代小亚细亚城市 Alabanda 有关，历史上这里曾是宝石交易地之一；因此这种石榴石在早期欧洲语境里常与该地名产生联想。","在文学与古董珠宝语境中，almandines 常用来营造“暗红、古老、沉稳”的视觉意象，尤其出现在描写中世纪或维多利亚时期饰品的文字里。"]}
{"word":"almandite","summary":{"en":"Almandite is a deep-red type of garnet (and the gemstone made from it).","zh":"Almandite 指一种通常深红色的榴石（铁铝榴石），也可指由它加工成的宝石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a common, usually deep-red variety of garnet (an iron–aluminum silicate), used as a gemstone and also found in metamorphic rocks.","zh":"（矿物）铁铝榴石：榴石的一种常见类型，通常呈深红色（铁—铝硅酸盐），可作宝石，也常见于变质岩中。"},"examples":[{"en":"The ring was set with a dark-red almandite that looked almost like a ruby.","zh":"那枚戒指镶着一颗深红色的铁铝榴石，看起来几乎像红宝石。"},{"en":"Geology students identified almandite garnet in the metamorphic sample.","zh":"地质课学生在那块变质岩样品中辨认出了铁铝榴石（榴石）。"}]},{"partOfSpeech":"n.","definition":{"en":"a gemstone cut from almandite garnet.","zh":"（宝石）由铁铝榴石切割打磨而成的宝石。"},"examples":[{"en":"She chose an almandite for its warm, wine-colored glow.","zh":"她选了一颗铁铝榴石宝石，因为它有温暖的酒红色光泽。"}]}],"synonyms":["almandine","garnet"],"phonetic":"/ˈæl.mən.daɪt/","extraExplanation":["“Almandite”也常写作“almandine”，在珠宝语境里两者经常互通使用。","词源与古代小亚细亚城市 Alabanda 有关：历史上该地以切磨宝石闻名，因此这种红色榴石的名称与之相连。","在日常英语里它属于较专业的矿物/宝石词汇；想表达更通俗的说法，可以说“a red garnet（红色榴石）”。"]}
{"word":"almanner","summary":{"en":"“All manner (of)” means “many different kinds of; every type of.”","zh":"“all manner (of)”表示“各种各样的；各类的”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"all manner (of) — many different kinds of; every type of (often used before a plural noun).","zh":"各种各样的；形形色色的（常放在复数名词前）。"},"examples":[{"en":"The market sells all manner of fruits and vegetables.","zh":"市场上卖各种各样的水果和蔬菜。"},{"en":"People showed all manner of reactions to the news.","zh":"人们对这条消息表现出各种各样的反应。"},{"en":"The book is full of all manner of strange stories.","zh":"这本书里满是各种奇怪的故事。"}]}],"synonyms":["all kinds of","all sorts of","every kind of","a variety of"],"phonetic":"/ɔl ˈmænɚ/","extraExplanation":["“almanner” 不是常见英文单词，最可能是把短语 **all manner (of)** 连写造成的拼写错误。标准写法通常分开写：**all manner of + 复数名词**（all manner of problems / people / things）。","语气与用法：**all manner of** 常用于较正式或带一点文学色彩的表达，也可用于口语强调“种类非常多”。有时可省略 of（all manner people），但现代英语更常保留 **of**。"]}
{"word":"Almanon","summary":{"en":"“Almanon” is not a common English word; it is usually a proper name or a misspelling of “almanac.”","zh":"“Almanon”不是常见英语词；通常是专有名词，或是“almanac（年鉴）”的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A very rare or nonstandard word in English; most often seen as a proper name (e.g., a person, place, brand, or fictional character name) rather than a dictionary vocabulary item.","zh":"英语中非常少见或不规范的词；最常见的用法是专有名词（如人名、地名、品牌名或虚构角色名），而不是常规词汇。"},"examples":[{"en":"I couldn’t find “Almanon” in a standard English dictionary; it may be a name or a misspelling.","zh":"我在常见英语词典里找不到“Almanon”；它可能是名字或拼写错误。"},{"en":"If “Almanon” is a character name, its meaning depends on the story’s context.","zh":"如果“Almanon”是角色名，它的含义取决于故事语境。"}]},{"partOfSpeech":"n.","definition":{"en":"Often a misspelling of “almanac” (a yearly book or online resource with calendars, weather forecasts, and useful facts).","zh":"常被当作“almanac”的误拼（年鉴；包含日历、天气预测和实用信息的年度出版物或在线资料）。"},"examples":[{"en":"Did you mean “almanac”? The farmer checked the almanac for the planting dates.","zh":"你是不是想写“almanac”？农夫查年鉴来确定播种日期。"},{"en":"The school library has an almanac with world records and historical timelines.","zh":"学校图书馆里有一本年鉴，收录了世界纪录和历史时间线。"}]}],"synonyms":["almanac","yearbook","annual"],"phonetic":"ˈæl.mə.nɑn","extraExplanation":["“Almanon”不是常见英语词条，所以最关键的是确认来源：它出现在哪本书/游戏/歌曲/网站上？如果你把上下文句子发我，我可以判断它是专有名词、拼写变体，还是你想表达“almanac（年鉴）”。","如果你要的是发音：专有名词通常按拼写读，但不同作品/地区可能会有作者设定的读法；而“almanac”的常见读音是 /ˈɔlməˌnæk/。"]}
{"word":"almas","summary":{"en":"“Almas” is most often a personal name; it can also be Spanish for “souls” (plural of alma) or, in some Turkic contexts, related to the word “diamond.”","zh":"“Almas”最常见是人名；也可能是西班牙语“灵魂们”（alma 的复数），或在一些突厥语语境中与“钻石”含义相关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name (usually masculine) used in Central Asia and some other regions","zh":"（人名）Almas：常见于中亚等地区的名字（多为男性名）"},"examples":[{"en":"Almas is studying computer science at the university.","zh":"Almas 正在大学学习计算机科学。"},{"en":"I met someone named Almas at the conference.","zh":"我在会议上遇到一位叫 Almas 的人。"}]},{"partOfSpeech":"n.","definition":{"en":"the plural of Spanish alma (“soul”), sometimes seen in English-language texts that quote Spanish","zh":"（西语借用）almas 是西班牙语 alma（灵魂）的复数，有时会出现在英文中引用西语的语境里"},"examples":[{"en":"The poem speaks of “almas perdidas,” meaning “lost souls.”","zh":"这首诗提到“almas perdidas”，意思是“迷失的灵魂”。"},{"en":"In the song, “almas” refers to the souls of the dead.","zh":"在这首歌里，“almas”指亡者的灵魂。"}]},{"partOfSpeech":"n.","definition":{"en":"in some Turkic languages, a word meaning “diamond” (often seen as a name or in cultural references)","zh":"（突厥语系）在一些突厥语中意为“钻石”（常以人名或文化语境出现）"},"examples":[{"en":"His name, Almas, is connected to the word for “diamond.”","zh":"他的名字 Almas 与“钻石”这个词有关。"},{"en":"The story mentions an “almas” as a symbol of something precious.","zh":"故事里提到“almas”，用来象征珍贵之物。"}]}],"synonyms":["(name) Almaz","(Spanish) almas = souls","(Turkic sense) diamond"],"phonetic":"/ˈɑl.mɑs/","extraExplanation":["“Almas”在英语里最常见是人名；不同地区读音会有差异。","如果你是在英文文章里看到“almas”，要留意上下文：它可能是在引用西班牙语（almas=灵魂们），也可能是中亚姓名或与“钻石”含义相关的文化用法。","另外在高加索与中亚民间传说中，曾有“almas/almasty”指类人野人的说法（类似“雪人”概念），但在现代英语中较少见，多出现在人类学/民俗学语境。"]}
{"word":"alme","summary":{"en":"Alms means charitable help (usually money or food) given to poor people.","zh":"Alms 指对贫困者的施舍或慈善救济（多指钱或食物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Money, food, or other help given to poor people as an act of charity (usually used in the plural: alms).","zh":"（施舍的）救济物、施舍（多用复数 alms），指出于慈善而给贫困者的钱、食物或其他帮助。"},"examples":[{"en":"He gave alms to people in need outside the temple.","zh":"他在寺庙外给有需要的人施舍。"},{"en":"Many religions encourage giving alms as a way to show compassion.","zh":"许多宗教鼓励施舍，以表达慈悲。"}]}],"synonyms":["charity","donation","handout","aid","relief"],"phonetic":"/ɑmz/","extraExplanation":["“alme”在英语里并不是常见词，很多时候是把 **alms**（施舍）拼错了。","**alms** 的拼写里有 **l**，但发音时 **l 不发音**，读作 /ɑmz/（听起来像“ahmz”）。","词源上与“施舍、怜悯”有关，常见于宗教或较正式的语境；日常口语也可用 **charity / donation**。"]}
{"word":"Almeda","summary":{"en":"Almeda is most commonly a female first name, and it can also be used as a place name; it’s often a variant of “Alameda.”","zh":"Almeda最常见是女性名字，也可作地名；常被视为“Alameda”的变体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (first name), sometimes used as a variant spelling of “Alameda.”","zh":"女性名字（名），有时也作为“Alameda”的变体拼写使用。"},"examples":[{"en":"Almeda moved to Chicago for her new job.","zh":"Almeda为了新工作搬到了芝加哥。"},{"en":"My great-grandmother’s name was Almeda.","zh":"我曾祖母的名字叫Almeda。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun), used for some towns, neighborhoods, or geographic features—especially in the United States.","zh":"地名（专有名词），可指某些城镇、社区或地理地点——在美国较常见。"},"examples":[{"en":"They drove through Almeda on the way to the coast.","zh":"他们去海边的路上开车经过了Almeda。"},{"en":"The package was sent to Almeda, Texas.","zh":"包裹寄到了德克萨斯州的Almeda。"}]}],"synonyms":["Alameda"],"phonetic":"/ælˈmiːdə/","extraExplanation":["“Almeda”常被视为“Alameda”的变体拼写；“Alameda”源自西班牙语，意为“白杨/杨树成林的地方（林荫道、杨树林）”，在美国的地名中很常见。作为人名时，“Almeda”多见于英语语境中的传统名字（尤其在19世纪到20世纪初更常见）。"]}
{"word":"Almeeta","summary":{"en":"“Almeeta” is a rare feminine given name used as a personal name in English.","zh":"“Almeeta”是较少见的女性英文人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feminine given name (proper noun); a less common spelling variant of names like “Almeta/Almita,” used in some English-speaking communities.","zh":"女性名字（专有名词）；较少见的拼写形式，可能与“Almeta/Almita”等名字有关，在一些英语社群中使用。"},"examples":[{"en":"Almeeta Williams joined our team last month.","zh":"Almeeta Williams 上个月加入了我们团队。"},{"en":"I’m not sure how to spell it—Almeeta or Almeta?","zh":"我不确定怎么拼——Almeeta 还是 Almeta？"}]}],"phonetic":"/ælˈmiːtə/","extraExplanation":["“Almeeta”更常见于人名而非普通词汇，因此通常不翻译含义，而是按发音音译或直接保留原拼写。","不同家庭可能会用不同拼写（如 Almeeta / Almeta / Almita），属于名字的变体写法；在正式场合最好直接确认对方偏好的拼写与读音。"]}
{"word":"almeh","summary":{"en":"Almeh is a historical term for a female Egyptian/Middle Eastern entertainer—especially a singer and poet.","zh":"Almeh 是一个历史词，指埃及/中东地区的女艺人，尤指女歌手与女诗人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A professional female singer, poet, and entertainer in Egypt and the Middle East, especially in the 18th–19th centuries; sometimes described in English sources as a type of dancer/performer.","zh":"（历史用语）埃及及中东地区的职业女歌手、女诗人和艺人，尤指18—19世纪；在英语资料中有时也被描述为一种舞者/表演者。"},"examples":[{"en":"In 19th-century travel writing, an almeh might be hired to sing and recite poetry at a celebration.","zh":"在19世纪的旅行文学中，人们可能会雇一位 almeh 在庆典上演唱并吟诵诗歌。"},{"en":"The novel mentions an almeh entertaining guests with music late into the night.","zh":"小说里提到一位 almeh 用音乐娱乐宾客直到深夜。"}]}],"synonyms":["entertainer","singer","poet","(loosely) dancer"],"phonetic":"/ˈælmeɪ/","extraExplanation":["“almeh”来自阿拉伯语（与“有学识的女人”相关的词根），原意更强调“受过教育、会诗歌与音乐的女艺人”。在一些早期英语/法语记述里，它常被与“舞者”混用或被误解为单指肚皮舞演员。","复数常见写法是“awalim”（也写作“ʿawālim”）。如果你在历史、东方主义题材或19世纪游记中遇到该词，通常带有特定时代与文化语境。"]}
{"word":"almehs","summary":{"en":"Almehs are female Egyptian entertainers—especially singers and dancers—often mentioned in historical travel writing and literature.","zh":"Almehs 指埃及的女职业艺人，尤指歌者与舞者，常见于历史旅行记与文学描写中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female professional entertainer in Egypt or nearby regions, especially a singer and dancer who performs at celebrations (plural: almehs)","zh":"（埃及及周边地区的）女艺人，尤指在庆典上表演的女歌手、舞者（复数：almehs）"},"examples":[{"en":"In the novel, an almeh is hired to sing and dance at a wedding feast.","zh":"在小说里，人们请来一位 almeh 在婚宴上歌舞助兴。"},{"en":"Travel writers in the 1800s often described almehs performing for wealthy households.","zh":"19世纪的旅行作家常写到 almehs 为富裕人家表演。"}]}],"synonyms":["almeh (singular)","female entertainer","Egyptian singer-dancer"],"phonetic":"/ˈæl.meɪ/","extraExplanation":["“almeh”源自阿拉伯语，原意与“有学识的女性/女学者”相关；在英语与旧式旅行记、东方主义语境中常被用来指埃及的女歌者/舞者。现代语境中可能带有历史与外来凝视色彩，建议在当代写作中注意语气与背景说明。","它与更广义的“belly dancer（肚皮舞者）”不完全等同：almeh更强调“职业表演者（尤其歌唱与娱乐）”这一社会角色。"]}
{"word":"Almeida","summary":{"en":"Almeida is usually a Portuguese surname and can also refer to a place in Portugal.","zh":"Almeida 通常是葡萄牙姓氏，也可指葡萄牙的一个地名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A Portuguese (and Galician) surname, originally from place names called Almeida.","zh":"一个常见的葡萄牙（也见于加利西亚）姓氏，源自名为 Almeida 的地名。"},"examples":[{"en":"Dr. Almeida will give a talk on public health tomorrow.","zh":"Almeida 医生明天会做一场关于公共卫生的讲座。"},{"en":"My neighbor’s last name is Almeida, and his family is from Portugal.","zh":"我邻居姓 Almeida，他的家族来自葡萄牙。"}]},{"partOfSpeech":"other","definition":{"en":"A place name—most notably a town/municipality in eastern Portugal near the Spanish border.","zh":"一个地名——最常指葡萄牙东部、靠近西班牙边境的阿尔梅达（Almeida）城镇/市镇。"},"examples":[{"en":"We visited Almeida to see its old fortress walls.","zh":"我们去了 Almeida 看它古老的城墙与要塞。"},{"en":"Almeida sits close to the border with Spain.","zh":"Almeida 靠近葡萄牙与西班牙的边境。"}]}],"synonyms":["de Almeida"],"phonetic":"/ælˈmeɪdə/","extraExplanation":["“Almeida”常被认为与阿拉伯语词源有关：中世纪伊比利亚半岛受阿拉伯文化影响，许多地名以“al-”开头（相当于英语的“the”）。有人解释其含义与“桌子/平台、平顶高地”相关，用来形容地形。","作为姓氏时，有时会看到“de Almeida”（意为“来自 Almeida”）这种形式，在葡语姓名中很常见。"]}
{"word":"almeidina","summary":{"en":"“almeidina” is not a standard English word; it’s most likely a proper name (often related to “Almeida”).","zh":"“almeidina”不是标准英语单词；更可能是专有名词（常与“Almeida”相关）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare proper name (not a standard English vocabulary word). It may be a surname, username, or a variant/misspelling of the Portuguese name “Almeida.”","zh":"一个较少见的专有名词（不属于标准英语词汇）。它可能是姓氏、用户名，或葡萄牙语姓名“Almeida”的变体/拼写误差。"},"examples":[{"en":"My classmate’s online handle is “almeidina.”","zh":"我同学的网名是“almeidina”。"},{"en":"I couldn’t find “almeidina” in an English dictionary—maybe it’s a family name.","zh":"我在英语词典里找不到“almeidina”——它可能是一个姓氏。"}]}],"phonetic":"/ˌælmeɪˈdiːnə/","extraExplanation":["“Almeida”是常见的葡萄牙语姓氏/地名；你输入的“almeidina”看起来像是在其基础上加了后缀（例如昵称化）或是拼写变体。若你能提供它出现的语境（人名、地名、账号名、文章句子等），我可以更准确判断含义与读法。"]}
{"word":"Almelo","summary":{"en":"Almelo is a city in the eastern Netherlands (Overijssel).","zh":"Almelo 是荷兰东部上艾瑟尔省的一座城市（地名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in the eastern Netherlands, in the province of Overijssel.","zh":"阿尔梅洛（Almelo）：荷兰东部上艾瑟尔省（Overijssel）的一座城市。"},"examples":[{"en":"Almelo is in the Dutch province of Overijssel.","zh":"阿尔梅洛位于荷兰的上艾瑟尔省。"},{"en":"She took a train from Amsterdam to Almelo.","zh":"她从阿姆斯特丹坐火车去阿尔梅洛。"}]}],"phonetic":"/ɑlˈmeɪloʊ/","extraExplanation":["“Almelo”是荷兰地名（专有名词）。英语里通常直接用原名，不翻译；中文常译作“阿尔梅洛”。","读音提示：英语使用者常按拼写读成 /ɑlˈmeɪloʊ/；在荷兰语中元音和重音可能会与英语近似读法略有不同。","学习小贴士：谈论地名时，常用介词 in（在……）+ 国家/省份/城市，例如：in the Netherlands / in Overijssel / in Almelo。"]}
{"word":"almemar","summary":{"en":"An almemar is the synagogue platform/desk used for reading the Torah aloud.","zh":"almemar 指犹太会堂中用于公开诵读《妥拉》的诵读台/高台。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a raised platform or reading desk in a synagogue, where the Torah is read aloud (also spelled \"bimah\" or \"almemor\").","zh":"（犹太会堂中的）诵读台／讲台；用于公开诵读《妥拉》的高台（也常写作 bimah 或 almémor）。"},"examples":[{"en":"During the service, the Torah was carried to the almemar for the public reading.","zh":"在礼拜过程中，《妥拉》被抬到诵读台上进行公开诵读。"},{"en":"The rabbi stood near the almemar to address the congregation.","zh":"拉比站在诵读台附近向会众讲话。"}]}],"synonyms":["bimah","almemor","reading desk","platform"],"phonetic":"/ˈæl.mə.mɑr/","extraExplanation":["“almemar”是一个较少见的拼写形式，英语里更常见的是“bimah”。在不同犹太社群与历史时期，相关用词与拼写会有差异。","词源上与希伯来语/阿拉伯语相关，指会堂内用于宣读经文的特定位置与结构；在传统礼仪中具有很强的象征意义。"]}
{"word":"almemars","summary":{"en":"“almemars” is not a standard English word; it is likely a name or a misspelling.","zh":"“almemars”不是标准英文单词，更可能是名字/专有名词或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most likely a proper name (e.g., a surname, username, or brand) or a misspelling/typo of another word.","zh":"不是标准英文单词；更可能是专有名词（如姓氏、用户名、品牌名等）或其他单词的拼写错误。"},"examples":[{"en":"I couldn’t find “Almemars” in the dictionary—maybe it’s a last name or a username.","zh":"我在词典里查不到“Almemars”——它可能是姓氏或用户名。"},{"en":"Is “Almemars” the correct spelling, or did you mean a different word?","zh":"“Almemars”的拼写确定吗？还是你想写另一个词？"}]}],"phonetic":"/ˈælmiˌmɑrz/","extraExplanation":["从拼写来看，“almemars”不像常见英文词汇。它可能是：\n1）专有名词（人名/地名/品牌/用户名）；\n2）带所有格的形式（例如 Almemar’s 的误写）；\n3）你想输入的单词拼错了。\n如果你告诉我它出现的句子或你想表达的中文意思，我可以帮你锁定最可能的正确单词并给出释义与用法。"]}
{"word":"almemor","summary":{"en":"“almemor” isn’t a recognized English word; it’s likely a misspelling or a proper name. Provide context to identify the intended word.","zh":"“almemor”不是公认的英语单词；更可能是拼写错误或专有名词。提供上下文可帮助确认你想表达的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a name/username.","zh":"不是标准英语单词；可能是拼写错误，或是人名/用户名。"},"examples":[{"en":"I couldn’t find “almemor” in an English dictionary—did you mean “memento” or “memoir”?","zh":"我在英语词典里找不到“almemor”——你是不是想写“memento（纪念品）”或“memoir（回忆录）”？"}]}],"extraExplanation":["“almemor”在常见英语词典中没有对应词条。如果你能提供一句包含它的原句、它出现的场景（比如游戏名、账号名、文章截图），我可以更准确判断含义。","最可能的近似词：\n- memento：纪念品；让人想起过去的东西\n- memoir：回忆录\n- memo：备忘录；便条\n- remember：记得（动词）","如果它来自其他语言（如西班牙语/阿拉伯语/拉丁语的转写），也可能不是英语词汇，本义需要结合出处确认。"]}
{"word":"Almena","summary":{"en":"Almena is usually used as a woman’s first name, and it can also be a U.S. place name (notably a town in Kansas).","zh":"Almena 通常作女性名字，也可作美国地名（尤指堪萨斯州的一个小镇）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feminine given name (first name).","zh":"女性名字（名）。"},"examples":[{"en":"Almena moved to Chicago for college.","zh":"Almena 去芝加哥上大学了。"},{"en":"Our new neighbor is named Almena.","zh":"我们的新邻居叫 Almena。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name in the United States (most commonly, a small city in Kansas).","zh":"美国的地名（最常见指堪萨斯州的一个小城）。"},"examples":[{"en":"They stopped in Almena, Kansas for gas.","zh":"他们在堪萨斯州的 Almena 停下来加油。"},{"en":"Almena is a quiet town with a small community.","zh":"Almena 是个安静的小镇，社区规模不大。"}]}],"synonyms":["Alma","Almina","Amina"],"phonetic":"/ælˈmiːnə/","extraExplanation":["“Almena”在英语里多作为专有名词使用（人名或地名），一般不用于普通名词或动词。","作为人名时并不算常见；拼写相近的名字有 Alma、Almina、Amina，读音和文化背景可能不同。"]}
{"word":"almendro","summary":{"en":"“Almendro” is Spanish for “almond tree.”","zh":"“almendro”是西班牙语，意思是“杏仁树”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) an almond tree.","zh":"（西语）杏仁树。"},"examples":[{"en":"In Spanish, “almendro” means “almond tree.”","zh":"在西班牙语里，almendro 的意思是“杏仁树”。"},{"en":"There are many almond trees in the countryside.","zh":"乡间有很多杏仁树。"}]}],"synonyms":["almond tree"],"phonetic":"/ɑlˈmɛn.droʊ/","extraExplanation":["“almendro”是西班牙语名词；对应的“杏仁（坚果）”在西语里通常是“almendra”。也就是说：almendra（杏仁） vs. almendro（杏仁树）。","在西班牙与拉美文化中，杏仁树常与春天开花、田园景色相关；在文学或诗歌里也可能被用来象征“早春、希望或短暂的美”。"]}
{"word":"almendron","summary":{"en":"Almendrón is a Cuban Spanish word for a classic old American car, often used as a shared taxi in Havana.","zh":"Almendrón是古巴西语词，指常见的经典美国老爷车，常在哈瓦那作为拼车出租车使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Cuba, a classic American car (often from the 1940s–1950s) that is still used today, commonly as a shared taxi.","zh":"（古巴用语）“老爷车”：多指20世纪40–50年代的美国老车，至今仍在使用，常被当作拼车出租车。"},"examples":[{"en":"We took an almendrón from Vedado to Old Havana.","zh":"我们从韦达多搭了一辆almendrón去哈瓦那老城。"},{"en":"Many almendrones work as fixed-route taxis in Havana.","zh":"在哈瓦那，很多almendrón作为固定线路的拼车出租车运营。"}]}],"synonyms":["classic car","old-timer","Cuban taxi","shared taxi (in Cuba)"],"phonetic":"/ˌɑl.mənˈdroʊn/","extraExplanation":["“Almendrón”在西班牙语里本意与“杏仁（almendra）”有关，字面感觉像“又大又圆的杏仁”。在古巴语境中，它用来形容那些车身圆润、体型较大的复古美国车，因此演变成特指古巴街头常见的经典老爷车。","在古巴，由于历史与经济原因，许多旧车被长期维修、改装并继续上路；因此“almendrón”不仅是交通工具，也常被视为当地生活与文化的标志之一。"]}
{"word":"Almera","summary":{"en":"“Almera” is most commonly a proper noun, especially the Nissan compact car model name; it can also be used as a personal name.","zh":"“Almera”多为专有名词，最常见的是日产紧凑型车的车型名；也可能作为人名使用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A compact passenger car model name used by Nissan in various markets.","zh":"（车型名）日产在不同市场使用的紧凑型乘用车车型名称“Almera”。"},"examples":[{"en":"She drives a Nissan Almera to work every day.","zh":"她每天开一辆日产 Almera 去上班。"},{"en":"The Almera is marketed under different names in some countries.","zh":"Almera 在一些国家会以不同的名字销售。"}]},{"partOfSpeech":"other","definition":{"en":"A personal name (used in some cultures and languages); spelling and usage vary, and it may also appear as a surname.","zh":"（人名）在一些文化与语言中使用的名字；拼写与用法可能不同，也可能作为姓氏出现。"},"examples":[{"en":"Almera introduced herself at the meeting.","zh":"Almera 在会议上做了自我介绍。"}]}],"phonetic":"/ælˈmɛrə/","extraExplanation":["“Almera”更常见于专有名词语境（如车型名或人名），不是高频普通英文词汇。","读音在英语里通常重音落在第二音节：al-MER-a（/ælˈmɛrə/）。不同国家与语言环境中可能有略微差异。","如果你指的是某个地区/地名或特定品牌、人物，请补充上下文，我可以给出更精确的释义与用法。"]}
{"word":"Almeria","summary":{"en":"Almería: a city and province on Spain’s Mediterranean coast (Andalusia).","zh":"Almería：西班牙安达卢西亚大区地中海沿岸的一座城市及同名省份。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city and province in southeastern Spain (in the region of Andalusia), on the Mediterranean coast.","zh":"阿尔梅里亚（Almería）：西班牙东南部安达卢西亚大区的一座沿地中海城市，同时也是同名省份。"},"examples":[{"en":"We drove along the coast from Málaga to Almería.","zh":"我们沿着海岸从马拉加开车到阿尔梅里亚。"},{"en":"Almería is known for its sunny climate and coastal scenery.","zh":"阿尔梅里亚以阳光充足的气候和海岸风景闻名。"}]}],"synonyms":["Almería (Spanish spelling)"],"phonetic":"/ælˈmɛriə/","extraExplanation":["“Almería”在西班牙语中带重音符号（í），英语里常写作“Almeria”。英语发音会更接近 /ælˈmɛriə/，而西语大致为 [almeˈɾi.a]。","阿尔梅里亚附近有著名的塔韦尔纳斯沙漠（Desert of Tabernas），曾作为许多“西部片”取景地；当地也以大规模温室农业（“欧洲的菜园”之一）而知名。"]}
{"word":"Almerian","summary":{"en":"“Almerian” means “from or related to Almería, Spain,” and can also mean a person from Almería.","zh":"“Almerian”指“来自或与西班牙阿尔梅里亚有关的”，也可指“阿尔梅里亚人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Almería (a city and province in Andalusia, southern Spain), or to its people or culture.","zh":"与西班牙南部安达卢西亚的阿尔梅里亚（城市/省）有关的；阿尔梅里亚的；阿尔梅里亚人（或文化）的。"},"examples":[{"en":"Almerian cuisine often features fresh seafood and tomatoes.","zh":"阿尔梅里亚的饮食常常以新鲜海鲜和番茄为特色。"},{"en":"She bought an Almerian ceramic bowl at the market.","zh":"她在集市上买了一个阿尔梅里亚风格的陶瓷碗。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Almería, Spain.","zh":"阿尔梅里亚人（来自西班牙阿尔梅里亚的人）。"},"examples":[{"en":"Two Almerians joined our tour of the old town.","zh":"有两位阿尔梅里亚人加入了我们老城区的旅行。"},{"en":"He’s an Almerian who moved to Madrid for work.","zh":"他是阿尔梅里亚人，后来为了工作搬到马德里。"}]}],"synonyms":["from Almería","Almería-based","Almeriense"],"phonetic":"/ælˈmɪəriən/","extraExplanation":["“Almerian”主要用作地名形容词/居民称呼，对应西班牙语里常见的“Almeriense”。英语里也可能见到写作“Almerian”，但在正式文本中更常直接用“from Almería / of Almería”。","阿尔梅里亚以干旱气候、电影取景地（部分沙漠景观）、以及大规模温室农业闻名；因此你可能会在旅游、地理、农业或文化语境中看到该词。"]}
{"word":"almerian","summary":{"en":"Almerian means “from Almería, Spain,” and can describe the place/people or a person from there.","zh":"Almerian 表示“来自西班牙阿尔梅里亚的”，可作形容词或名词（阿尔梅里亚人）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Almería (a province and city in southeastern Spain) or its people.","zh":"与阿尔梅里亚（西班牙东南部的省与城市）或其居民有关的；阿尔梅里亚的。"},"examples":[{"en":"Almerian beaches are known for their clear water and quiet coves.","zh":"阿尔梅里亚的海滩以清澈的海水和安静的海湾而闻名。"},{"en":"She cooks Almerian dishes with lots of olive oil and fresh seafood.","zh":"她会做阿尔梅里亚风味的菜肴，常用橄榄油和新鲜海鲜。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Almería (city or province).","zh":"阿尔梅里亚人（来自阿尔梅里亚市或阿尔梅里亚省的人）。"},"examples":[{"en":"He’s an Almerian who moved to Madrid for work.","zh":"他是阿尔梅里亚人，后来为了工作搬到马德里。"}]}],"synonyms":["from Almería","of Almería"],"phonetic":"/ælˈmɪriən/","extraExplanation":["“Almerian”通常是地名 Almería 的形容词/居民称呼（demonym）。在英文中更常见的写法是 “from Almería” 或直接用 “Almería” 作定语（如 “Almería province”）。","Almería 位于西班牙安达卢西亚（Andalusia）自治区，以干旱景观、温室农业以及电影取景地（如塔韦尔纳斯沙漠 Tabernas Desert）而较有名。"]}
{"word":"Almeric","summary":{"en":"Almeric is a rare male first name, associated with French/English usage and historically linked to Germanic name forms meaning “ruler/power.”","zh":"Almeric 是一个较少见的男性名字，常见于法语/英语语境，并在历史上与含有“统治/权力”词根的人名形式有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a masculine given name (first name), most often found in French- or English-speaking contexts; it is a rare name today.","zh":"男性名字（名），多见于法语或英语语境中；如今较少见。"},"examples":[{"en":"Almeric moved to Boston for graduate school.","zh":"Almeric 为了读研究生搬到了波士顿。"},{"en":"The novel’s hero, Almeric, is portrayed as quiet but determined.","zh":"小说里的男主角 Almeric 被刻画得沉静却很坚定。"}]}],"synonyms":["Alaric","Almeric (variant spellings: Almaric, Adalric)"],"phonetic":"/ˈæl.mə.rɪk/","extraExplanation":["Almeric 通常被认为与日耳曼语源的人名有关（常见的相关形式包括 Alaric、Adalric、Almaric 等），名字构词里常见的含义线索是“统治/权力（-ric）”。不同地区与不同时代的拼写差异较大，因此你可能会在历史人物、家谱或文学作品中见到它，但在现代日常生活中相对少见。"]}
{"word":"almeries","summary":{"en":"“Almeries” is the plural of “almery,” meaning an old-fashioned word for a cupboard or storage cabinet.","zh":"“almeries”是“almery”的复数，指（较旧用法的）橱柜/储物柜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cupboard or cabinet for storing food, dishes, or household items (an older or less common word; plural: almeries)","zh":"（较旧或不太常用的词）橱柜、碗柜、食品储藏柜（复数：almeries）"},"examples":[{"en":"In the old farmhouse, jars of jam were kept in the almery.","zh":"在那座老农舍里，果酱罐被放在储藏柜里。"},{"en":"She opened the almery to take out a plate and a cup.","zh":"她打开碗柜，拿出一个盘子和一个杯子。"}]}],"synonyms":["cupboard","cabinet","pantry","sideboard"],"phonetic":"/ˈɑlməri/","extraExplanation":["“almery”属于较为古旧的词，在现代英语里更常用的是“cupboard / cabinet / pantry”。在一些英国（尤其苏格兰）或文学/历史语境中可能更容易见到。","词源上与中古法语/拉丁语中表示“储藏/柜子”的词有关，因此常带有“古老房屋里的储物柜”这种氛围感。"]}
{"word":"almeriite","summary":{"en":"“almeriite” is not a common dictionary word; it likely refers to a misspelling or a proper/technical name.","zh":"“almeriite”不是常见词典词条；更可能是拼写错误或专有/技术名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A very rare or unclear term; it is not a standard English word in major dictionaries. It may be a misspelling of a similar-looking word (for example, a mineral name) or a proper name.","zh":"一个非常少见或不明确的词；在主流英语词典中不算标准词条。它可能是相近拼写词（例如某种矿物名）的拼写错误，或是专有名词。"},"examples":[{"en":"I can’t find “almeriite” in a dictionary—could it be a misspelling or a brand/name?","zh":"我在词典里找不到“almeriite”——它会不会是拼写错误，或是品牌/名字？"},{"en":"If you share the sentence where you saw “almeriite,” I can help identify what it refers to.","zh":"如果你把看到“almeriite”的句子发给我，我可以帮你判断它具体指什么。"}]}],"phonetic":"ˌæl.məˈriː.aɪt","extraExplanation":["“almeriite”更像是专有名词（人名/地名/产品名）或矿物学、地质学里的罕见术语。也可能与西班牙城市 Almería（阿尔梅里亚）相关，但英语里更常见的形容词是 Almerían / from Almería，而不是 *almeriite*。","如果你能提供：①出现的上下文句子；②是否为矿物/化学/游戏/小说里的词；③是否可能是 OCR 识别错误（例如把 -ite 看成 -iite），我可以更准确地给出释义、词源和对应中文。"]}
{"word":"almery","summary":{"en":"Almery means a cupboard or wardrobe (common in South Asian English).","zh":"Almery 指壁橱/衣柜/储物柜（多见于南亚英语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English) a cupboard or wardrobe, usually a tall wooden cabinet used for storing clothes, bedding, or household items.","zh":"（南亚英语）壁橱；衣柜；（常为高而直立的）储物柜，用来存放衣物、被褥或家用品。"},"examples":[{"en":"She folded the blankets and put them back in the almery.","zh":"她把毯子叠好，放回了储物柜（almery）里。"},{"en":"My school kept sports equipment in an old metal almery.","zh":"我学校把体育器材放在一个旧的金属柜（almery）里。"}]}],"synonyms":["wardrobe","cupboard","closet","cabinet"],"phonetic":"/ˈæl.mɚ.i/","extraExplanation":["“almery”常见于印度、巴基斯坦、孟加拉国等地的英语中；在更通用的美式/英式英语里，人们更常说“wardrobe”“cupboard”“closet”或“cabinet”。","它也常被拼作“almirah”（更接近来源词），日常对话中两种拼法都可能出现。"]}
{"word":"almes","summary":{"en":"Alms are charitable gifts (money, food, etc.) given to poor people, usually mentioned in the plural.","zh":"Alms 指给穷人的施舍或救济（钱、食物等），通常以复数形式出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"money, food, or other help given to poor people, often as an act of charity (usually used in the plural).","zh":"（通常用复数）施舍、救济物；给穷人的钱、食物或其他帮助（多指出于慈善）。"},"examples":[{"en":"The church collects alms for families in need.","zh":"教会为有需要的家庭募集施舍（救济金/物资）。"},{"en":"In the past, travelers sometimes asked for alms along the road.","zh":"过去，旅行者有时会在路边乞求施舍。"}]}],"synonyms":["charity","donation","handout","aid","relief"],"phonetic":"/ɑmz/","extraExplanation":["“almes”通常是“alms”的拼写错误，或是较古老/方言式的拼写。现代标准英语里更常用“alms”。","词源与文化：alms来自希腊语 eleēmosynē（“怜悯、施舍”），在基督教传统中常与慈善捐助、救济穷人相关。现代语境也可与“charity / donation”并用，但“alms”更偏宗教或历史语感。"]}
{"word":"Almeta","summary":{"en":"Almeta is mainly used as a woman’s name (and sometimes a surname).","zh":"Almeta 主要用作女性名字（有时也作姓氏）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (first name); also used as a family name in some cases.","zh":"女性名字（名）；有时也可作姓氏。"},"examples":[{"en":"Almeta Johnson is speaking at the meeting today.","zh":"Almeta Johnson 今天会在会上发言。"},{"en":"We named our daughter Almeta because it sounded classic and unique.","zh":"我们给女儿取名 Almeta，因为听起来经典又特别。"}]}],"synonyms":["Almeda","Almita","Almeta (variant spellings)"],"phonetic":"/ælˈmiːtə/","extraExplanation":["“Almeta”更常见于英语国家的人名中，属于专有名词（proper name），因此一般不翻译为固定中文词义，而是按音译（如“阿尔梅塔”）或按本人偏好写法处理。","关于词源：它可能与姓名“Almeda / Almita”等形式有关联，但不同家族与地区的来源不一定一致；在正式写作中建议以当事人证件拼写为准。"]}
{"word":"almice","summary":{"en":"“almice” is not a standard English word; it’s usually a typo or a proper name. You may mean “all mice.”","zh":"“almice”不是标准英语词；多为拼写错误或专有名词。你可能想写“all mice（所有老鼠）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username/brand name, or a rare proper name. Many people who type “almice” actually mean “all mice” (two words).","zh":"不是标准英语单词。可能是拼写错误、用户名/品牌名，或罕见的专有名词。很多人输入“almice”其实是想写“两词”的“all mice（所有老鼠）”。"},"examples":[{"en":"I can’t find “almice” in a dictionary—did you mean “all mice”?","zh":"我在词典里找不到“almice”——你是不是想写“all mice（所有老鼠）”？"},{"en":"The phrase “all mice” means every mouse in a group or place.","zh":"短语“all mice”表示“某个群体或地点里的所有老鼠”。"}]}],"phonetic":"/ælˈmaɪs/","extraExplanation":["如果你是在阅读文章/小说时遇到“almice”，很可能是排版或扫描（OCR）错误。把前后句贴出来，我可以帮你判断原词可能是什么（例如 all mice、Almice 作为昵称/账号名等）。"]}
{"word":"almicore","summary":{"en":"Almicore is a less-common name for a tuna-like fish, often the little tunny (“false albacore”).","zh":"Almicore 是一种类金枪鱼海鱼的少见名称，常指小金枪鱼（又称“假长鳍金枪鱼”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a kind of tuna-like fish (often the little tunny), sometimes called a “false albacore.”","zh":"一种类似金枪鱼的鱼（常指小金枪鱼 little tunny），有时也被称为“假长鳍金枪鱼/假鲣鱼（false albacore）”。"},"examples":[{"en":"In some coastal markets, almicore is sold alongside other tuna and bonito.","zh":"在一些沿海市场，almicore 会和其他金枪鱼及鲣鱼一起出售。"},{"en":"The guide warned us that almicore is often mistaken for albacore.","zh":"向导提醒我们，almicore 经常被误认为 albacore（长鳍金枪鱼）。"}]}],"synonyms":["false albacore","little tunny","bonito"],"phonetic":"/ˈæl.mɪˌkɔr/","extraExplanation":["“Almicore”是一个比较少见、带地域色彩的名称；在不同地区可能指不同的“类金枪鱼”鱼种，最常见的用法是指 little tunny（Euthynnus alletteratus），因此也常被叫作 false albacore。","学习时建议把它理解成“某种金枪鱼/鲣鱼类海鱼的俗名”，并注意它和更常见的 albacore（长鳍金枪鱼，常见于罐头‘白肉金枪鱼’）不是同一个词、也不一定是同一种鱼。"]}
{"word":"Almida","summary":{"en":"Almida is used as a personal name (often a surname), sometimes a variant of “Almeida.”","zh":"Almida 多作为人名（常见为姓氏），有时是 “Almeida” 的拼写变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A personal name (given name or surname). In English use, it is often treated as a variant spelling of the Portuguese surname “Almeida,” though “Almida” can also be an independent family name.","zh":"人名（名字或姓氏）。在英语语境中常被视为葡萄牙姓氏“Almeida”的一种拼写变体，但“Almida”也可能作为独立姓氏存在。"},"examples":[{"en":"Ms. Almida will join the meeting at 3 p.m.","zh":"Almida 女士将于下午三点参加会议。"},{"en":"I’m looking for books by Dr. Almida in the library catalog.","zh":"我在图书馆目录里查找 Almida 博士的著作。"}]}],"synonyms":["Almeida","Almeda"],"phonetic":"/ælˈmiːdə/","extraExplanation":["“Almeida”是较常见的葡萄牙姓氏形式；“Almida”有时出现在移民家庭的拼写简化、登记误写或家族自选拼写中。具体来源通常需要以当事人或家族文件为准。","作为人名时，英文里首字母大写（Almida）。如果你是想查词源或人物信息，最好提供：这是名还是姓、来自哪个国家/地区、以及出现的语境（书名、电影、证件等）。"]}
{"word":"almida","summary":{"en":"“Almida” is mainly used as a name (given name or surname), sometimes a variant of “Almeida.”","zh":"“Almida”主要作为人名使用（名或姓），有时是“Almeida”的拼写变体。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a personal name (given name) and surname, often used in Portuguese- and Spanish-speaking communities; also seen as a spelling variant of “Almeida.”","zh":"人名（名或姓），常见于葡语和西语文化圈；也可作为“Almeida”的一种拼写变体。"},"examples":[{"en":"Almida grew up speaking both English and Portuguese at home.","zh":"Almida 在家里同时使用英语和葡萄牙语长大。"},{"en":"Dr. Almida will present the research findings tomorrow.","zh":"Almida 博士将于明天展示研究结果。"}]}],"synonyms":["Almeida"],"phonetic":"/ælˈmiːdə/","extraExplanation":["“Almida”在英语里不是常见词汇，更多被当作姓名来使用。你如果是想查常见姓氏“Almeida”，它多见于葡萄牙语世界，来源常被解释为地名/地形相关的姓氏（与中世纪伊比利亚半岛的地名传统有关）。","发音在不同地区会有差异；在美式英语语境里常读作 /ælˈmiːdə/（类似“al-MEE-duh”）。如果你告诉我你看到它的具体句子或国家/地区背景，我可以给更贴近的读音和用法。"]}
{"word":"almight","summary":{"en":"Almighty means all-powerful (especially referring to God), and informally it can mean extremely great; it’s also used as an exclamation of surprise.","zh":"Almighty 指（尤指上帝）全能的；口语中也可表示“非常、极其”；还可作感叹词表示惊讶或强调。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of God) having unlimited power; all-powerful.","zh":"（指上帝）全能的；无所不能的。"},"examples":[{"en":"Many people believe God is almighty.","zh":"许多人相信上帝是全能的。"},{"en":"In the Bible, God is described as almighty.","zh":"《圣经》中把上帝描述为全能的。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) extremely great, strong, or impressive.","zh":"（非正式）极其巨大的；非常强烈的；很厉害的。"},"examples":[{"en":"We had an almighty storm last night.","zh":"昨晚下了一场特别猛烈的暴风雨。"},{"en":"He gave the door an almighty kick.","zh":"他狠狠地踢了门一脚。"}]},{"partOfSpeech":"int.","definition":{"en":"Used as an exclamation to show surprise, shock, or emphasis.","zh":"（感叹用语）用于表示惊讶、震惊或强调。"},"examples":[{"en":"Almighty! That was close.","zh":"天哪！差点就出事了。"},{"en":"Almighty, it’s loud in here.","zh":"天哪，这里也太吵了。"}]}],"synonyms":["all-powerful","omnipotent","supreme","mighty","powerful"],"phonetic":"ɔlˈmaɪti","extraExplanation":["你输入的“almight”通常是拼写错误，正确拼写是 **almighty**。","**the Almighty** 常作为对上帝的尊称使用（较正式或宗教语境）。在日常口语里，almighty 也常用来夸张加强语气（如 almighty mess / almighty noise）。"]}
{"word":"almightily","summary":{"en":"Almightily means “in an all-powerful way,” and more rarely “very strongly/forcefully.”","zh":"almightily 意为“以全能的方式”，较少见的用法是“非常强烈地/用力地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an all-powerful or supremely powerful way (often describing God or a god).","zh":"以全能、至高无上的方式（常用来形容上帝或神明）。"},"examples":[{"en":"In the hymn, God is praised as ruling almightily over heaven and earth.","zh":"在这首赞美诗中，上帝被颂扬为以全能统治天地。"},{"en":"The story portrays the deity as acting almightily, beyond any human law.","zh":"故事把这位神描写成以全能行事，超越人类一切律法。"}]},{"partOfSpeech":"adv.","definition":{"en":"Very strongly; with great force (rare, often literary or old-fashioned).","zh":"非常强烈地；用很大的力量（较少见，多见于文学或较旧的用法）。"},"examples":[{"en":"The wind blew almightily against the windows all night.","zh":"风整夜猛烈地吹打着窗户。"},{"en":"He slammed the door almightily, waking the whole house.","zh":"他用力把门一摔，把全屋人都吵醒了。"}]}],"synonyms":["powerfully","mightily","forcefully","strongly"],"phonetic":"/ɔlˈmaɪtəli/","extraExplanation":["“almightily”来自形容词“almighty（全能的）”。在现代英语里，这个副词并不常用；更常见的表达是“in an almighty way”“with great power”，或用更自然的副词如“powerfully / strongly”。","当它用于宗教或颂歌语境时，语气庄严；用于描述风、关门等动作时，往往带有文学/夸张色彩，听起来有点“古风”。"]}
{"word":"almightiness","summary":{"en":"Almightiness means unlimited power, especially referring to God’s power.","zh":"Almightiness 指“全能、无限的力量”，尤指上帝的权能。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of being almighty; unlimited power, often used to describe God.","zh":"全能；无所不能的状态或性质（常用于形容上帝）。"},"examples":[{"en":"In many religions, God’s almightiness is shown through creation and miracles.","zh":"在许多宗教中，上帝的全能常通过创造与神迹来体现。"},{"en":"The poem praises the almightiness of nature in storms and oceans.","zh":"这首诗赞美大自然在风暴与海洋中的“无穷力量”。"}]}],"synonyms":["omnipotence","all-powerfulness","supremacy"],"phonetic":"/ɔlˈmaɪt̬i.nəs/","extraExplanation":["“almightiness”由形容词“almighty（全能的）”加名词后缀“-ness”构成，表示“……的性质/状态”。","它通常出现在宗教、哲学或较正式的文体中；日常英语里更常说“omnipotence（全能）”或直接说“God is almighty（上帝是全能的）”。","“almightiness”多指神的绝对权能；如果用来形容人，往往带有批评或讽刺意味，暗示某人自以为无所不能。"]}
{"word":"Almighty","summary":{"en":"“Almighty” means all-powerful, and it is often used to describe God (the Almighty).","zh":"“Almighty”意为“全能的、无所不能的”，常用于描述上帝（the Almighty）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having complete power and control; all-powerful","zh":"全能的；拥有至高无上的力量与控制力的"},"examples":[{"en":"In many religions, God is described as almighty.","zh":"在许多宗教中，上帝被描述为全能的。"},{"en":"The king wanted to appear almighty, but he still needed support from others.","zh":"国王想显得全能，但他仍然需要他人的支持。"}]},{"partOfSpeech":"n.","definition":{"en":"(as a title or form of address) the all-powerful God","zh":"（称谓）全能的上帝"},"examples":[{"en":"They prayed to the Almighty for guidance.","zh":"他们向全能的上帝祈求指引。"},{"en":"May the Almighty bless you and keep you safe.","zh":"愿全能的上帝祝福你并保佑你平安。"}]}],"synonyms":["all-powerful","omnipotent","supreme","mighty"],"phonetic":"/ɔlˈmaɪti/","extraExplanation":["“almighty”由“all（全部）+ mighty（强大的）”组成，字面意思是“全然强大的”。在日常英语里它最常用于宗教语境（如指上帝），也可在非宗教语境中形容某人/某机构“权力过大”，有时带一点讽刺意味（如：the almighty boss 可能暗示“自以为无所不能的老板”）。","常见搭配：the Almighty（全能的上帝）；almighty God（全能的上帝）；almighty dollar（“万能的金钱”，常带批评或讽刺，指人们过度崇拜金钱）。"]}
{"word":"almighty","summary":{"en":"Almighty most commonly means “all-powerful,” especially describing God; it can also mean “very great/huge” for emphasis, and as a noun it can mean “God.”","zh":"almighty 常指“全能的”，尤用于形容上帝；也可作强调用语表示“非常巨大/强烈”；作名词时可指“上帝/全能者”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having complete power; able to do anything.","zh":"全能的；拥有至高无上的力量的。"},"examples":[{"en":"Many religions describe God as almighty.","zh":"许多宗教把上帝描述为全能的。"},{"en":"She spoke as if she were almighty and never wrong.","zh":"她说话的样子仿佛自己无所不能、从不犯错。"}]},{"partOfSpeech":"adj.","definition":{"en":"Very great or extremely strong; used for emphasis (often informal).","zh":"非常大的；极其强烈的（常用于强调，偏口语）。"},"examples":[{"en":"That was an almighty storm last night.","zh":"昨晚那场暴风雨真是大得吓人。"},{"en":"He let out an almighty shout when he won.","zh":"他赢了时发出一声巨大的喊叫。"}]},{"partOfSpeech":"n.","definition":{"en":"God (especially in religious or literary style).","zh":"上帝；全能者（尤用于宗教或文学语体）。"},"examples":[{"en":"They prayed to the Almighty for guidance.","zh":"他们向全能者祈求指引。"}]}],"synonyms":["all-powerful","omnipotent","supreme","mighty","powerful","enormous"],"phonetic":"/ɔlˈmaɪti/","extraExplanation":["“Almighty”由“all（全部）+ mighty（强大的）”组成，字面意思是“全然强大”。在宗教语境中常专指上帝（the Almighty），这种用法通常要大写。","在英式英语口语里，“an almighty + 名词”更常见，用来强调程度（如 an almighty mess）。在美式英语中也能听到，但相对不如英式常见。注意它带有夸张强调的语气，正式写作中要谨慎使用。"]}
{"word":"almique","summary":{"en":"An archaic word for a distilling vessel (alembic/still).","zh":"一个古义词，指蒸馏器（alembic / still）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) A distilling vessel; an alembic or still used to make distilled liquids.","zh":"（古义）蒸馏器；用于蒸馏液体的蒸馏瓶/蒸馏器（同 alembic / still）。"},"examples":[{"en":"In the old workshop, an almique sat on the stove for distilling herbs.","zh":"在那间旧作坊里，炉子上放着一只 almique，用来蒸馏草药。"},{"en":"The text describes perfume being made with an almique and careful heat.","zh":"文中描写用 almique 并小心控火来制作香水。"}]}],"synonyms":["alembic","still","distiller","retort"],"phonetic":"/ælˈmiːk/","extraExplanation":["这个词在现代英语里极少见，多见于旧书、炼金术（alchemy）、香水制作或早期化学语境中，基本可用更常见的 still 或 alembic 来替换。","词源上常被认为与阿拉伯语 al-anbīq（蒸馏器）相关，欧洲语言中出现了多种拼写变体（如 alembic 等）。"]}
{"word":"Almira","summary":{"en":"Almira is most commonly a female first name; it can also be a place name, and rarely a variant spelling for a wardrobe (almirah).","zh":"Almira 最常见是女性名字；也可作地名；较少见时可作“衣柜（almirah）”的变体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (first name).","zh":"女性名字（名）。"},"examples":[{"en":"Almira introduced herself and asked where the library was.","zh":"Almira 先自我介绍，然后问图书馆在哪里。"},{"en":"Almira is a classic-sounding name, though not very common today.","zh":"Almira 听起来很古典，不过今天并不算常见。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name (used for some towns/communities, especially in the U.S.).","zh":"地名（一些城镇/社区的名字，尤其在美国）。"},"examples":[{"en":"They drove through Almira on their way to Spokane.","zh":"他们去斯波坎的路上开车经过了 Almira。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common; variant of “almirah”) a tall cupboard or wardrobe for storing clothes.","zh":"（较少见；“almirah”的变体拼写）衣柜/立柜，用来存放衣物。"},"examples":[{"en":"He folded the shirts and put them in the almira.","zh":"他把衬衫叠好放进衣柜里。"}]}],"synonyms":["(name) —","(wardrobe sense) wardrobe","closet","cupboard"],"phonetic":"/ælˈmaɪrə/","extraExplanation":["“Almira”作为人名在英语世界多见于19世纪到20世纪初的使用记录；它常被认为与阿拉伯语名字词根有关（如 Almir 表“王子/指挥者”等含义），因此有时会被解读为带有“高贵、领导者气质”的名字。","表示“衣柜”的用法更常见的拼写是 **almirah**，多见于南亚英语（Indian English / Pakistani English）；来源与阿拉伯语/波斯语借词传统有关。若你在英文材料里看到 “almira” 表衣柜，通常是地区性拼写或简化写法。"]}
{"word":"almira","summary":{"en":"“Almira” means a (South Asian) wardrobe/cupboard for storage.","zh":"“almira”指（南亚英语中常说的）衣柜/储物柜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English) a tall cupboard or wardrobe used for storing clothes, bedding, documents, or household items; often a freestanding metal or wooden cabinet with doors (sometimes with a lock).","zh":"（南亚英语）衣柜/壁橱式的大柜子，用来存放衣物、被褥、文件或杂物；常见为独立的金属或木制带门柜（有时带锁）。"},"examples":[{"en":"Hang your uniform in the almira so it doesn’t get dusty.","zh":"把校服挂进almira（衣柜）里，免得落灰。"},{"en":"She kept important papers locked in the almira.","zh":"她把重要文件锁在almira里。"},{"en":"The room is small, but an almira fits in the corner.","zh":"房间很小，但角落里还能放下一只almira。"}]}],"synonyms":["wardrobe","closet","cupboard","cabinet","locker"],"phonetic":"/ɑlˈmɪrə/","extraExplanation":["“almira”更常见的拼写是“almirah”。这是南亚（尤其印度、巴基斯坦、孟加拉等）日常英语中很常用的词；在美式/英式通用英语里，人们更常说“wardrobe / closet / cupboard”。","词源上常被认为经由印地语/乌尔都语等（如 almari/almirah）进入英语，追溯与葡萄牙语“armário”（柜子、衣橱）有关。"]}
{"word":"almirah","summary":{"en":"An almirah is a cupboard or wardrobe, especially in South Asian English.","zh":"almirah 指壁橱或衣柜，尤其常见于南亚英语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cupboard or wardrobe used for storing clothes, dishes, or household items (common in South Asian English).","zh":"（南亚英语常用）壁橱／衣柜／储物柜，用来存放衣物、餐具或家庭用品。"},"examples":[{"en":"He kept his winter clothes in the almirah.","zh":"他把冬天的衣服放在衣柜（almirah）里。"},{"en":"The plates are in the almirah in the dining room.","zh":"餐厅里的餐具放在储物柜（almirah）里。"}]}],"synonyms":["wardrobe","cupboard","cabinet","closet"],"phonetic":"/ˌæl.məˈrɑː/","extraExplanation":["“almirah”在印度、巴基斯坦、孟加拉国等地很常见；在美式英语里更常说“wardrobe”（衣柜）或“cupboard/cabinet”（橱柜/柜子）。","词源上与阿拉伯语有关，历史上指一种带搁板或门的储物柜；在不同地区，它可以指放衣服的衣柜，也可以指放餐具的壁橱。"]}
{"word":"Almire","summary":{"en":"Almire is a rare given name, sometimes used as a variant spelling of Almira.","zh":"Almire 是较少见的人名，有时是 Almira 的变体拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a rare personal name (given name). It is sometimes treated as a variant spelling of “Almira/Almera,” used in English and some European contexts.","zh":"一个较少见的人名（名字）。有时被当作“Almira/Almera”的变体拼写，在英语及部分欧洲语境中出现。"},"examples":[{"en":"Almire is my great-aunt’s name, and it’s quite uncommon today.","zh":"Almire 是我姑奶奶的名字，如今很少见。"},{"en":"In old records, her name appears as Almire in one document and Almira in another.","zh":"在旧档案里，她的名字在一份文件中写作 Almire，另一份则写作 Almira。"}]}],"synonyms":["Almira","Almera"],"phonetic":"/ælˈmɪr/","extraExplanation":["“Almire”在现代英语里更常见的是作为人名拼写，而不是普通词汇。它有时与更常见的“Almira”混用（不同地区、不同年代的拼写差异很常见）。","如果你其实想查的是家具“armoire”（大衣橱/衣柜），那是另一个词，拼写不同但看起来容易混淆。","文化补充：巴洛克时期作曲家韩德尔有一部歌剧常见拼写为《Almira》（有时会看到相近拼法），因此在文学/艺术资料中可能出现相似名字。"]}
{"word":"almistry","summary":{"en":"Palmistry is fortune-telling by reading the lines of the palm.","zh":"palmistry 指“看手相”，通过手掌纹路进行占卜或性格判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The practice of reading a person’s character or predicting the future by studying the lines and shapes of the palm of the hand (a type of fortune-telling).","zh":"通过观察手掌的纹路与形状来判断一个人的性格或预测未来的做法（属于算命/占卜的一种）。"},"examples":[{"en":"She paid for a palmistry reading at the night market.","zh":"她在夜市花钱请人看手相。"},{"en":"Palmistry is popular in some cultures, but it is not considered a science.","zh":"手相在一些文化中很流行，但它不被认为是科学。"}]}],"synonyms":["chiromancy","hand reading"],"phonetic":"/ˈpɑːmɪstri/","extraExplanation":["你输入的“almistry”一般不是标准英文单词；大多数情况下人们想表达的是“palmistry（手相）”。","词源上与“palm（手掌）”有关；常见搭配有 palmistry reading（看手相/手相解读）、palmist（看手相的人）。"]}
{"word":"Almita","summary":{"en":"Almita is most commonly a female name; in Spanish it can also mean “little soul” as a warm, affectionate nickname.","zh":"Almita 最常见是女性名字；在西班牙语里也可表示“little soul（小灵魂/小心肝）”，用作温柔的爱称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (a proper noun).","zh":"女性名字（专有名词）。"},"examples":[{"en":"Almita is starting school this fall.","zh":"Almita 今年秋天要开始上学。"},{"en":"Please ask Almita to call me when she’s free.","zh":"请让 Almita 有空时给我打电话。"}]},{"partOfSpeech":"n.","definition":{"en":"(Spanish, affectionate) “little soul,” used as a tender nickname or term of endearment.","zh":"（西班牙语，亲昵称呼）“小灵魂/小心肝”，用作温柔的昵称或爱称。"},"examples":[{"en":"In Spanish, a parent might say, “Ven aquí, almita,” to comfort a child.","zh":"在西班牙语里，父母安慰孩子时可能会说：“Ven aquí, almita（过来，小宝贝）。”"},{"en":"She signed the note, “Con cariño, tu almita.”","zh":"她在便条末尾写道：“Con cariño, tu almita（爱你的，小心肝）。”"}]}],"synonyms":["(as a nickname, Spanish) almitita","(similar affectionate words, Spanish) cariño","(English equivalents) sweetheart","dear"],"phonetic":"/ɑlˈmiːtə/","extraExplanation":["“Almita”在西班牙语里常被理解为 alma（灵魂）+ -ita（指小或亲昵的后缀），因此有“可爱的小灵魂/心肝宝贝”的感觉。作为人名时，很多时候也带着这种温柔的含义。","作为名字的读音在英语环境中可能会有差异；有的人会读得更接近西班牙语的节奏，有的人则按英语重音来读。"]}
{"word":"almner","summary":{"en":"An almoner is a person who distributes charity; in modern British use, it can mean a hospital social-support worker.","zh":"almoner 指负责分发慈善救济的人；在现代英式用法中也可指医院的社会支持/救助协调人员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A person whose job was to distribute alms (money, food, or help) to poor people on behalf of a church, monastery, or wealthy household.","zh":"（历史用语）施舍官；负责代表教会、修道院或富有人家向穷人分发施舍（钱、食物或援助）的人。"},"examples":[{"en":"In medieval times, the almoner gave bread and coins to the needy at the monastery gate.","zh":"在中世纪，施舍官会在修道院门口把面包和钱币分发给贫困的人。"},{"en":"The king’s almoner managed the royal charity for local families.","zh":"国王的施舍官负责管理皇室对当地家庭的慈善救济。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in the UK) A hospital worker who supports patients with practical and social needs; similar to a medical social worker.","zh":"（尤指英国）医院慈善/社工人员；帮助病人处理实际与社会问题的人，类似“医疗社会工作者”。"},"examples":[{"en":"After the accident, the almoner helped her apply for financial assistance.","zh":"事故之后，医院的社工人员帮助她申请经济援助。"},{"en":"Ask the almoner if you need help arranging home care.","zh":"如果你需要安排居家照护，可以咨询医院社工人员。"}]}],"synonyms":["charity worker","benefactor (not exact)","social worker (modern sense)","distributor of alms (historical sense)"],"phonetic":"/ˈælmoʊnər/","extraExplanation":["你输入的“almner”更常见的正确拼写是 **almoner**。它来源于 **alms（施舍、救济）**，在欧洲中世纪常与教会慈善相关。","在现代英语里，这个词较少见；在英国语境中，有时仍用来指医院里提供社会支持与救助资源协调的人（类似“医务社工”）。"]}
{"word":"almners","summary":{"en":"An almoner is a person who distributes charitable help for an institution; sometimes it can also mean the aid given (less common).","zh":"almoner 指代表机构发放救济的人（更常见）；也可指施舍/救济金（较少见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person whose job is to give money, food, or other help to poor people on behalf of an institution (such as a church, hospital, or royal household)","zh":"（代表教会、医院、王室等机构）负责施舍救济的人；施赈官；救济员"},"examples":[{"en":"In the Middle Ages, an almoner distributed food and coins to the poor outside a monastery.","zh":"在中世纪，施赈官会在修道院外向穷人分发食物和钱币。"},{"en":"The hospital’s almoner helped patients who couldn’t afford treatment.","zh":"医院的救济员会帮助付不起治疗费用的病人。"}]},{"partOfSpeech":"n.","definition":{"en":"the charitable aid (money or goods) given to people in need","zh":"施舍物；救济金（或救济品）"},"examples":[{"en":"The church collected alms and used them as almoner for families in need.","zh":"教会募集施舍，并把这些救济金（或救济品）发给有需要的家庭。"}]}],"synonyms":["charity worker","relief worker","social worker (similar)","benefactor (related but different)"],"phonetic":"/ˈæl.mə.nɚ/","extraExplanation":["你输入的“almners”很可能是拼写错误，正确常见形式是 **almoners**（复数），单数是 **almoner**。","词源上与 **alms**（施舍）有关。这个词在现代英语里偏正式、带历史感，常见于宗教、王室或旧式医院制度的语境中。现代更常用的表达包括 **social worker（社工）**、**charity worker（慈善工作者）**、**aid worker（救援人员）**，但语感并不完全相同。","相关词：**alms**（施舍）、**charity**（慈善）、**benefactor**（捐助者）、**philanthropy**（慈善事业/博爱）。"]}
{"word":"Almo","summary":{"en":"“Almo” is usually a personal name; “ALMO” can also be a UK abbreviation for an organisation that manages council housing.","zh":"“Almo”通常是人名；“ALMO”也可作英国缩写，指管理地方政府公共住房的机构。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name (usually male), used in English and other languages; it appears as a personal name or surname in some cultures.","zh":"人名（多为男性名），在英语及其他语言中可作名字或姓氏使用。"},"examples":[{"en":"Almo grew up in Chicago but his family is originally from Italy.","zh":"Almo 在芝加哥长大，但他的家族最初来自意大利。"},{"en":"I met someone named Almo at the conference.","zh":"我在会议上认识了一个叫 Almo 的人。"}]},{"partOfSpeech":"other","definition":{"en":"(ALMO) an abbreviation in the UK for an “Arms-Length Management Organisation,” a company set up to manage council housing.","zh":"（ALMO）英国常用缩写，指“独立管理机构（Arms-Length Management Organisation）”，通常用于管理地方政府（council）的公共住房。"},"examples":[{"en":"The council worked with an ALMO to improve housing services.","zh":"地方政府与一家 ALMO 合作，改善住房服务。"},{"en":"In the UK, some estates are managed by an ALMO rather than directly by the council.","zh":"在英国，有些住宅区由 ALMO 管理，而不是由地方政府直接管理。"}]}],"synonyms":["(name) —","(UK) Arms-Length Management Organisation"],"phonetic":"/ˈælmoʊ/","extraExplanation":["“Almo”在日常英语里不算常见词，更多见于人名；如果你其实想查的是“almost”（几乎、差一点），拼写应为 almost。","缩写“ALMO”主要出现在英国公共住房语境，属于制度/机构类用语；在其他国家不一定常用。"]}
{"word":"almochoden","summary":{"en":"Almochoden is a very rare, obsolete word meaning a cushion or pillow, likely an old spelling of almohadon.","zh":"almochoden 是极罕见的古旧词，意为“靠垫/枕垫”，很可能是 almohadon 的旧拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(very rare/obsolete) A cushion or pillow; a padded seat or headrest.","zh":"（极罕见/古旧）靠垫、枕头；用于坐靠或枕靠的软垫。"},"examples":[{"en":"He leaned back on an almochoden and listened to the music.","zh":"他靠在一个软垫上，听着音乐。"},{"en":"The old inventory lists “two almochodens” among the household linens.","zh":"那份旧清单在家用织物中列出了“两只靠垫/枕垫”。"}]}],"synonyms":["cushion","pillow","pad","bolster"],"phonetic":"/ˌælmoʊˈhɑːdən/","extraExplanation":["“almochoden”多见于旧文献或拼写不统一的文本中，常被认为是“almohadon/almohadón（靠垫、枕垫）”的古旧或讹写形式。","词源通常被追溯到西班牙语 almohadón，进一步来自阿拉伯语（与“枕头/靠垫”有关的词根）。因此它带有伊比利亚—阿拉伯文化交流的痕迹，偶尔出现在旅行记、旧小说或古董清单中。","现代英语里几乎不用该拼写；阅读时可将其理解为“cushion / pillow / pad”。"]}
{"word":"almocrebe","summary":{"en":"An archaic word for a muleteer or pack-driver who transports goods by mule.","zh":"一个古语词，指用骡子驮运货物的骡夫／驮运人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) A muleteer or pack-driver; someone who drives mules/donkeys carrying goods, especially in Spain or Portugal.","zh":"（古语）骡夫／驮运人；驱赶骡子或驴驮运货物的人，尤指西班牙或葡萄牙地区。"},"examples":[{"en":"In older travel writing, an almocreve might lead a string of mules through mountain passes.","zh":"在较早的游记中，almocreve 可能会带着一串骡子穿越山口。"},{"en":"The merchant hired an almocreve to carry the cloth to the next town.","zh":"商人雇了一位 almocreve 把布料运到隔壁城镇。"}]}],"synonyms":["muleteer","packman","carrier"],"phonetic":"/ˈælmoʊkriːv/","extraExplanation":["这个词在现代英语里非常罕见，多见于历史文本、旅行记或带有古风的文学作品中。","词源上一般认为来自伊比利亚半岛语言（西班牙语/葡萄牙语）的相关形式，进一步可追溯到阿拉伯语影响；因此常带有“旧时地中海/伊比利亚贸易与驮运”的文化背景。","注意拼写：你输入的 *almocrebe* 很可能是 *almocreve* 的变体或误拼；英语资料中 *almocreve* 更常见。"]}
{"word":"almogavar","summary":{"en":"An almogavar was a medieval Spanish light-infantry soldier/mercenary, known for fast raids and toughness.","zh":"almogavar 指中世纪西班牙的轻步兵战士/雇佣兵，以机动突袭与强悍著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Almogavars: fierce light-infantry soldiers and mercenaries from medieval Spain (especially the Crown of Aragon), active in the Reconquista and later campaigns around the Mediterranean.","zh":"阿尔莫加瓦尔人（Almogavars）中的一员：中世纪西班牙（尤指阿拉贡王冠）著名的轻步兵战士与雇佣兵，以勇猛善战闻名，活跃于“收复失地运动”及其后在地中海地区的战争。"},"examples":[{"en":"The chronicle describes an almogavar as a tough soldier used to hardship and fast raids.","zh":"编年史把一名 almogavar 描写成能吃苦、擅长快速突袭的硬汉士兵。"},{"en":"In the Middle Ages, almogavars fought in Iberia and later served in campaigns in Greece and the eastern Mediterranean.","zh":"中世纪时期，almogavars 先在伊比利亚作战，后来又参与希腊及东地中海的军事行动。"}]}],"synonyms":["Almogavar (variant spelling: almogávar)","medieval mercenary","light infantry soldier"],"phonetic":"/ˌɑlmoʊˈɡævɑr/","extraExplanation":["“Almogavar”常见于历史语境，也常写作带重音的西班牙语形式“almogávar”（复数 almogávares）。","词源通常认为来自阿拉伯语（与“突袭/劫掠者、出击者”相关的词根），反映其以机动袭击、边境作战著称的军事风格。","在加泰罗尼亚与阿拉贡相关的史料中较常出现，例如《拉蒙·蒙塔内尔编年史》（Chronicle of Ramon Muntaner）等记载了他们的行动与名声。"]}
{"word":"Almohad","summary":{"en":"Almohad refers to the medieval North African–Iberian Muslim dynasty/movement (1100s–1200s), or a person connected with it.","zh":"Almohad 指12—13世纪统治北非并影响伊比利亚半岛的穆瓦希德（阿尔摩哈德）王朝/运动，或与其相关的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Almohad dynasty or movement, a powerful Muslim Berber-led empire that ruled much of North Africa and parts of Spain and Portugal in the 1100s–1200s","zh":"与“穆瓦希德王朝/阿尔摩哈德王朝”（Almohad）或其宗教政治运动有关的；该王朝在12—13世纪统治北非大部分地区，并控制过伊比利亚半岛（今西班牙、葡萄牙）部分地区"},"examples":[{"en":"The museum has Almohad art from medieval Morocco and Spain.","zh":"博物馆收藏了来自中世纪摩洛哥和西班牙的阿尔摩哈德时期艺术品。"},{"en":"Scholars study Almohad architecture to understand the development of Islamic design in the western Mediterranean.","zh":"学者研究阿尔摩哈德建筑，以了解伊斯兰设计在西地中海地区的发展。"}]},{"partOfSpeech":"n.","definition":{"en":"a member, supporter, or ruler connected with the Almohad movement or dynasty","zh":"阿尔摩哈德运动/王朝的成员、支持者或统治者"},"examples":[{"en":"The chronicler wrote about the Almohads and their reforms.","zh":"史官记述了阿尔摩哈德人及其改革。"},{"en":"An Almohad could hold authority across both North Africa and al-Andalus.","zh":"一位阿尔摩哈德人可能在北非与安达卢斯（伊斯兰统治时期的伊比利亚）都拥有权力。"}]}],"synonyms":["Muwaḥḥidun","Almohad dynasty"],"phonetic":"/ˈælmoʊˌhɑd/","extraExplanation":["“Almohad”来自阿拉伯语 al-muwaḥḥidūn（意为“坚持独一神的人/宣认唯一神者”），反映其强调宗教一体与信仰纯正的主张。","在英语里它多用于历史、艺术史、建筑史语境（如 Almohad mosque/fortress/architecture），指特定时期与地区的风格与政权，而不是日常用语。"]}
{"word":"almohad","summary":{"en":"Almohad refers to a medieval Muslim dynasty (and its people or culture) that ruled North Africa and southern Spain.","zh":"Almohad 指中世纪统治北非与西班牙南部的阿尔摩哈德王朝，以及其成员或相关文化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a Muslim Berber dynasty that ruled much of North Africa and southern Spain in the 1100s–1200s, known for religious reform and major building projects.","zh":"阿尔摩哈德王朝成员；一个在12—13世纪统治北非与西班牙南部的穆斯林柏柏尔王朝，以宗教改革与大型建筑闻名。"},"examples":[{"en":"The Almohads replaced the Almoravids as a major power in the western Islamic world.","zh":"阿尔摩哈德王朝取代了阿尔摩拉维德王朝，成为西部伊斯兰世界的重要力量。"},{"en":"Some famous monuments in Morocco and Spain are linked to Almohad rule.","zh":"摩洛哥和西班牙的一些著名古迹与阿尔摩哈德时期的统治有关。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Almohad dynasty, its government, culture, or historical period.","zh":"阿尔摩哈德的；与阿尔摩哈德王朝的政权、文化或历史时期有关的。"},"examples":[{"en":"Researchers discussed Almohad architecture and its influence on later styles.","zh":"研究者讨论了阿尔摩哈德建筑及其对后世风格的影响。"},{"en":"The museum displayed an Almohad-era inscription.","zh":"博物馆展出了一段阿尔摩哈德时期的铭文。"}]}],"synonyms":["Almohad dynasty","al-Muwaḥḥidūn","Berber dynasty"],"phonetic":"/ˈælmoʊˌhɑd/","extraExplanation":["“Almohad”来自阿拉伯语 *al-Muwaḥḥidūn*，意为“宣认（真主）独一者/一神论者”。该运动在北非兴起，强调宗教改革与更严格的信仰实践。","常见相关历史名词：Almoravid（阿尔摩拉维德，前一政权/对手）、Andalusia / al-Andalus（安达卢斯/伊斯兰西班牙）。在阅读历史书时，“Almohad”既可指“这个王朝的人”，也可指“该王朝时期的事物”（如 Almohad architecture）。"]}
{"word":"Almohade","summary":{"en":"“Almohade” refers to the Almohad dynasty/movement (12th–13th centuries) and can describe things related to it.","zh":"“Almohade”指阿尔摩哈德王朝/运动（12—13世纪），也可作形容词表示与其相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Almohad dynasty or movement, a North African Berber Muslim ruling power that controlled much of Morocco, Algeria, Tunisia, and Islamic Spain (Al-Andalus) in the 12th–13th centuries","zh":"阿尔摩哈德人（阿尔摩哈德王朝/运动的成员；12—13世纪北非柏柏尔穆斯林政权，统治过摩洛哥、阿尔及利亚、突尼斯及伊比利亚半岛的安达卢斯地区）"},"examples":[{"en":"The Almohade expanded their rule into Al-Andalus during the 1100s.","zh":"阿尔摩哈德人在12世纪将势力扩展到安达卢斯地区。"},{"en":"Some sources spell it “Almohad,” but “Almohade” is also used in French- or Spanish-influenced texts.","zh":"有些资料拼作“Almohad”，但在受法语或西班牙语影响的文本中也会用“Almohade”。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Almohad dynasty, its culture, art, architecture, or historical period","zh":"阿尔摩哈德（王朝/文化/艺术/建筑或历史时期）的"},"examples":[{"en":"You can see Almohade influence in the design of certain North African mosques.","zh":"在一些北非清真寺的设计中可以看到阿尔摩哈德的影响。"},{"en":"The museum has a small collection of Almohade-era ceramics.","zh":"这家博物馆收藏了一小批阿尔摩哈德时期的陶器。"}]}],"synonyms":["Almohad","Muwaḥḥidūn (historical term)"],"phonetic":"ˌælmoʊˈhɑːd","extraExplanation":["“Almohade/Almohad”源自阿拉伯语 **al-muwaḥḥidūn**（意为“强调独一真主的人/一神论者”），最初指一种宗教改革运动，后来也指建立并统治北非与伊比利亚部分地区的王朝。","在历史与艺术语境中，你可能会遇到“Almohad architecture（阿尔摩哈德建筑）”，常被用来讨论他们在清真寺、宣礼塔等建筑形式上的影响（例如塞维利亚的希拉尔达塔常被提及其渊源）。"]}
{"word":"almohade","summary":{"en":"Almohade refers to the Almohad dynasty (or a person from it) and to things connected with its culture and period.","zh":"Almohade 指阿尔摩哈德王朝（或其成员），也可作形容词表示与其文化与时代相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Almohad dynasty (a Muslim Berber movement and ruling dynasty in North Africa and parts of Spain in the 1100s–1200s).","zh":"阿尔摩哈德王朝（12—13世纪统治北非及伊比利亚部分地区的柏柏尔穆斯林运动与王朝）的成员；阿尔摩哈德人。"},"examples":[{"en":"The Almohade rulers controlled Marrakesh and influenced culture across the western Mediterranean.","zh":"阿尔摩哈德统治者控制了马拉喀什，并影响了西地中海地区的文化。"},{"en":"Some Spanish texts use “Almohade” to refer to the Almohad period in al-Andalus.","zh":"一些西班牙语文本用“Almohade”指代安达卢斯的阿尔摩哈德时期。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Almohad dynasty, its people, art, architecture, or period.","zh":"与阿尔摩哈德王朝（其人民、艺术、建筑或时代）有关的；阿尔摩哈德式的。"},"examples":[{"en":"The museum has an Almohade-style inscription carved in stone.","zh":"博物馆里有一段以石刻呈现的阿尔摩哈德风格铭文。"},{"en":"Historians compare Almohade architecture with earlier Almoravid designs.","zh":"历史学家把阿尔摩哈德建筑与更早的阿尔摩拉维德设计作比较。"}]}],"synonyms":["Almohad","Almohad dynasty","Almohad (adj.)"],"phonetic":"/ˌælmoʊˈhɑːd/","extraExplanation":["“Almohade”常见于西班牙语、法语等学术写作中；英语里更常写作“Almohad”。两者指同一对象，只是拼写体系不同。","词源上与阿拉伯语称号“al-Muwaḥḥidūn”（意为“宣认真主独一者/一神论者”）有关，因此在历史语境里常与宗教改革运动、政治统一及其在马格里布与安达卢斯的扩张联系在一起。","在艺术与建筑语境中，“Almohad”常让人联想到马拉喀什的库图比亚清真寺（Koutoubia）与塞维利亚的希拉尔达塔（Giralda）等相关风格与遗产。"]}
{"word":"Almohades","summary":{"en":"The Almohades were a Berber Muslim dynasty and movement that ruled North Africa and parts of medieval Spain in the 1100s–1200s.","zh":"阿尔摩哈德王朝是柏柏尔穆斯林的政权与宗教运动，主要在12—13世纪统治北非并一度控制中世纪西班牙部分地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Muslim Berber ruling dynasty and religious movement that controlled much of North Africa and parts of Spain (al-Andalus) mainly in the 12th–13th centuries","zh":"阿尔摩哈德王朝（阿尔摩哈德派）：柏柏尔穆斯林的政权与宗教运动，主要在12—13世纪统治北非并一度控制伊比利亚半岛部分地区（安达卢斯）"},"examples":[{"en":"The Almohades ruled large parts of North Africa and al-Andalus in the twelfth century.","zh":"阿尔摩哈德王朝在12世纪统治了北非大片地区，并曾控制安达卢斯。"},{"en":"After the Almohades weakened, several smaller states emerged in Iberia.","zh":"阿尔摩哈德王朝衰落后，伊比利亚半岛出现了多个较小的政权。"}]}],"synonyms":["Almohad dynasty","Almohads"],"phonetic":"ˈælmoʊhædz","extraExplanation":["“Almohades”是英语里对该政权/群体的称呼之一，更常见的拼写是“Almohads”。词源来自阿拉伯语“al-muwaḥḥidūn”（意为“主张神的一体/唯一者”，强调严格的一神论）。","在文化与历史语境中，阿尔摩哈德时期常与安达卢斯的城市、清真寺与要塞建筑联系在一起；在英语史学写作里也常与其前一政权“Almoravids（阿尔摩拉维德）”对比出现。"]}
{"word":"almohades","summary":{"en":"“Almohades” refers to the Almohads, a 12th–13th century North African Muslim movement and dynasty that also ruled parts of Islamic Spain.","zh":"“almohades”指阿尔摩哈德派/阿尔摩哈德王朝：12—13世纪兴起于北非、并曾统治安达卢斯部分地区的穆斯林运动与王朝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Almohads: a North African Muslim movement and ruling dynasty (12th–13th centuries) that controlled parts of Morocco and much of Islamic Spain (al-Andalus).","zh":"阿尔摩哈德王朝／阿尔摩哈德派：12—13世纪起源于北非的穆斯林宗教改革运动及其建立的统治王朝，曾控制摩洛哥并统治伊比利亚半岛的部分伊斯兰地区（安达卢斯）。"},"examples":[{"en":"The Almohades ruled large areas of North Africa and al-Andalus in the 1100s.","zh":"阿尔摩哈德王朝在12世纪统治了北非和安达卢斯的大片地区。"},{"en":"Many textbooks mention the Almohades when discussing the history of medieval Spain.","zh":"许多教材在讲述中世纪西班牙历史时会提到阿尔摩哈德王朝。"}]}],"synonyms":["Almohads","Almohad dynasty","al-Muwahhidun"],"phonetic":"/ˌælmoʊˈhɑːdz/","extraExplanation":["“Almohades”是西班牙语/法语等语境中常见的复数写法；英语里更常见的形式是“Almohads”。","名称源自阿拉伯语“al-Muwaḥḥidūn（认主独一者）”，强调严格的一神信仰与宗教改革。","在文化史里，阿尔摩哈德时期与伊比利亚半岛的政治变迁相关，也常与后续的收复失地运动（Reconquista）叙事一起出现。"]}
{"word":"almoign","summary":{"en":"Almoign is an archaic word meaning “alms” (charity), and it can also refer to a historical church-related land tenure connected with almsgiving.","zh":"almoign 是“施舍/救济”的古语，也可指与施舍相关的历史上教会土地占有方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic) Alms; charity given to the poor.","zh":"（古语）施舍；救济穷人的慈善捐赠。"},"examples":[{"en":"The monastery lived partly on gifts and almoign from local families.","zh":"修道院的生活部分依靠当地家庭的捐赠和施舍。"},{"en":"He asked for almoign at the church door.","zh":"他在教堂门口乞求施舍。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical, law) A type of church-held land or land tenure connected with giving alms (often seen in the phrase “frankalmoign”).","zh":"（历史/法律）与施舍相关的一种教会土地或土地占有方式（常见于短语“frankalmoign”）。"},"examples":[{"en":"The land was granted in frankalmoign, owing prayers rather than rent.","zh":"这块土地以“frankalmoign”的方式授予，主要义务是祈祷而非缴租。"},{"en":"Medieval records mention almoign in descriptions of church property.","zh":"中世纪的记录在描述教会财产时提到过“almoign”。"}]}],"synonyms":["alms","charity","handout","donation"],"phonetic":"/ˈæl.mɔɪn/","extraExplanation":["“almoign”是非常罕见的古拼写形式，和“alms（施舍）”同源，来自古法语/中古英语传统写法。现代英语里几乎不用，阅读中世纪文本或法律史资料时更可能见到。","与之相关的术语“frankalmoign”（也写作 frankalmoin）指一种中世纪英格兰的土地授予方式：把土地给教会，作为回报通常是宗教服务（如祈祷），而不是金钱租税。"]}
{"word":"almoin","summary":{"en":"Almoin is an archaic word meaning “alms/charity,” often seen in the phrase “in almoin.”","zh":"almoin 是古语，意为“施舍/赈济”，常见于短语 in almoin。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic, chiefly Scottish legal use) alms; money or food given to poor people as charity.","zh":"（古语，主要见于苏格兰法律语境）施舍；赈济穷人的钱或食物。"},"examples":[{"en":"In old records, land was sometimes held “in almoin,” meaning it was granted in return for prayers and charity.","zh":"在一些古老文书中，土地有时以“in almoin”的方式持有，意思是以祈祷与慈善作为回报而授予。"},{"en":"The church distributed almoin to the needy during hard winters.","zh":"在严冬时期，教会向贫困者分发施舍。"}]},{"partOfSpeech":"phrase","definition":{"en":"in almoin: given as charity (not as payment); granted for religious/charitable service.","zh":"in almoin：作为施舍/慈善而给出（不是作为报酬）；因宗教或慈善服务而授予。"},"examples":[{"en":"The money was offered in almoin, with no expectation of repayment.","zh":"这笔钱是作为施舍给出的，不期待归还。"}]}],"synonyms":["alms","charity","handout","donation (to the poor)"],"phonetic":"/ælˈmɔɪn/","extraExplanation":["“almoin”较少见，更多出现在历史文献与苏格兰法律/教会语境中，常与短语“in almoin”一起出现。","词源上与“alms（施舍）”同源，历史上也受到古法语/中古英语拼写影响，因此会看到多种旧式拼法。"]}
{"word":"Almon","summary":{"en":"Almon is usually a misspelling of almond (the nut/seed). It can also be a surname.","zh":"Almon 通常是 almond（杏仁）的误拼；在某些情况下也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly a misspelling of) almond: an edible nut (actually the seed of the almond tree), often eaten raw or used in cooking and desserts.","zh":"（常见拼写误写）almond（杏仁）：一种可食用的“坚果”（严格说是杏仁树的种子），可生吃，也常用于烹饪与甜点。"},"examples":[{"en":"I added chopped almonds to the salad for extra crunch.","zh":"我在沙拉里加了切碎的杏仁，增加脆感。"},{"en":"This cake is made with almond flour.","zh":"这个蛋糕用杏仁粉做的。"}]},{"partOfSpeech":"adj.","definition":{"en":"Almond (as an adjective) describes a light brown color similar to almond skin.","zh":"almond（作形容词）指类似杏仁皮的浅棕色。"},"examples":[{"en":"She chose an almond-colored sweater.","zh":"她选了一件杏仁色的毛衣。"}]},{"partOfSpeech":"other","definition":{"en":"Almon: a family name (surname) or place/name in some contexts.","zh":"Almon：在一些语境中是姓氏或地名/人名。"},"examples":[{"en":"Dr. Almon will see you now.","zh":"Almon 医生现在会见你。"}]}],"synonyms":["almond","nut (general category)"],"phonetic":"/ˈɑːmənd/","extraExplanation":["“Almon”在英语里并不是常见的普通词；日常学习中更常见的是“almond（杏仁）”。如果你是想查“almond”，拼写要在结尾加上字母 d。","发音小提示：在美式英语里，“almond”里字母 l 常常不发音或很弱，因此你可能会听到更接近“ah-mund”的读法。"]}
{"word":"almon","summary":{"en":"“Almond” means a nut (and the tree) used for food and cooking.","zh":"“Almond”指杏仁（也可指杏仁树），常用于食用和烹饪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a light-brown, oval nut with a slightly sweet taste, eaten raw or used in cooking; also the tree that produces it","zh":"杏仁；（也指）杏仁树。杏仁是一种浅棕色的椭圆形坚果，略带甜味，可生吃或用于烹饪"},"examples":[{"en":"She added sliced almonds to the salad.","zh":"她在沙拉里加了杏仁片。"},{"en":"Almond milk is a popular dairy-free drink.","zh":"杏仁奶是一种很受欢迎的无乳制品饮料。"},{"en":"We planted an almond tree in the backyard.","zh":"我们在后院种了一棵杏仁树。"}]}],"synonyms":["nut","kernel"],"phonetic":"/ˈɑmənd/","extraExplanation":["你输入的“almon”通常是“almond”的拼写错误，正确拼写是 almond（末尾有 d）。","发音小提示：在美式英语里，almond 的 d 通常不发音，听起来更像“AH-mund”。","文化/用法补充：almond 常见于烘焙（almond flour 杏仁粉、almond extract 杏仁香精）、零食（roasted almonds 烤杏仁）以及植物奶（almond milk 杏仁奶）。"]}
{"word":"almonage","summary":{"en":"Almonage is a historical term for the office or place where charity (alms) is distributed, often in religious settings.","zh":"Almonage 是一个偏历史用语，指（常在宗教机构中）负责分发施舍的职务或场所。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the office, work, or place connected with giving out charity (alms), especially in a church, monastery, or royal household","zh":"（尤指教会、修道院或王室机构中）施舍救济的职务、工作或发放施舍的地方"},"examples":[{"en":"In the Middle Ages, the monastery’s almonage provided bread to the poor at the gate.","zh":"在中世纪，修道院的施舍处会在门口向穷人发放面包。"},{"en":"Records mention repairs to the almonage, where daily charity was organized.","zh":"史料提到对施舍处进行修缮，因为日常救济在那儿安排。"}]}],"synonyms":["charity office","alms office","almonry","poor relief"],"phonetic":"ˈɑl.mə.nɪdʒ","extraExplanation":["“almonage”源自“alms（施舍）”相关词族，常与“almoner（施赈官/施舍官）”一起出现。它多见于历史、宗教或古文语境，现代日常英语很少用。","在英国等传统中，教会或王室会设立专门人员与场所负责慈善分发，因此“almonage”既可指“机构/部门”，也可指“施舍的场所”。"]}
{"word":"Almond","summary":{"en":"An almond is an edible seed used as a snack or ingredient in foods and drinks.","zh":"Almond 指可食用的杏仁（种子），常作为零食或食材用于食物和饮品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a nut-shaped edible seed with a mild, slightly sweet flavor, often eaten raw/roasted or used to make almond milk, almond flour, and desserts","zh":"杏仁；（外形像坚果的）可食用种子，味道清淡微甜，常生吃/烘烤食用，也常用来制作杏仁奶、杏仁粉和甜点"},"examples":[{"en":"She snacks on almonds instead of chips.","zh":"她用杏仁当零食，而不是薯片。"},{"en":"This cake is made with almond flour.","zh":"这个蛋糕用杏仁粉做的。"},{"en":"I ordered a latte with almond milk.","zh":"我点了一杯用杏仁奶做的拿铁。"}]}],"synonyms":["nut (general)","edible seed"],"phonetic":"/ˈɑmənd/","extraExplanation":["“Almond”在日常饮食语境里通常指可食用的“甜杏仁”（sweet almond）。有些“苦杏仁”（bitter almond）含有天然毒性成分，一般不直接食用，更多用于提取香味成分或经过处理后使用。","常见搭配：roasted almonds（烤杏仁）、sliced almonds（杏仁片）、almond butter（杏仁酱）、almond extract（杏仁香精）。","文化小知识：在一些西方婚礼或节庆中，糖裹杏仁（sugared almonds / Jordan almonds）常被当作祝福与分享的象征。"]}
{"word":"almond","summary":{"en":"An almond is an edible nut (seed) used in cooking and baking; it can also describe foods flavored with or made from almonds.","zh":"almond 指可食用的杏仁/扁桃仁，常用于烹饪烘焙；也可作形容词表示“杏仁味/杏仁制的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A light-brown, oval nut (the seed of the almond tree) that is eaten as food and used in cooking, baking, and making drinks like almond milk.","zh":"杏仁；扁桃仁（扁桃树的种子），可食用，常用于烹饪、烘焙或制作杏仁奶等。"},"examples":[{"en":"She added sliced almonds to the salad.","zh":"她在沙拉里加了杏仁片。"},{"en":"This cake is made with almond flour.","zh":"这个蛋糕是用杏仁粉做的。"},{"en":"I usually drink almond milk instead of dairy milk.","zh":"我通常喝杏仁奶来代替牛奶。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made from almonds, or having an almond flavor or scent.","zh":"杏仁制的；有杏仁味（或杏仁香）的。"},"examples":[{"en":"He ordered an almond croissant.","zh":"他点了一份杏仁可颂。"},{"en":"The soap has a soft almond scent.","zh":"这块肥皂有淡淡的杏仁香味。"}]}],"synonyms":["nut","seed","almond nut"],"phonetic":"/ˈɑmənd/","extraExplanation":["“almond”在日常英语里最常指食物中的“杏仁/扁桃仁”。需要注意的是，中文里“杏仁”有时也指“杏的仁”，但英文almond通常指扁桃（Prunus dulcis）的种子。","常见搭配：almond milk（杏仁奶）、almond flour（杏仁粉）、almond butter（杏仁酱）、toasted almonds（烤/烘过的杏仁）。","文化/用法提示：在西方烘焙里，杏仁常用于甜点（如杏仁可颂、马卡龙、杏仁蛋糕），也常与蜂蜜、巧克力、肉桂等口味搭配。"]}
{"word":"almondlike","summary":{"en":"“Almondlike” means similar to an almond in taste, smell, shape, or appearance.","zh":"“almondlike”表示在味道、气味、形状或外观上像杏仁。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling an almond in shape, taste, smell, or appearance.","zh":"像杏仁的；具有杏仁的形状、味道、气味或外观的。"},"examples":[{"en":"The cookies had an almondlike aroma.","zh":"这些饼干带有一种类似杏仁的香气。"},{"en":"She described the fruit as almondlike in flavor—slightly sweet and nutty.","zh":"她形容这种水果的味道像杏仁——微甜、带坚果香。"},{"en":"The petals formed an almondlike oval shape.","zh":"花瓣形成了类似杏仁的椭圆形。"}]}],"synonyms":["almond-scented","nutty","almond-flavored","almond-shaped"],"phonetic":"/ˈɑməndˌlaɪk/","extraExplanation":["“almondlike”更常见的写法是“almond-like”（用连字符），多用于描述香气、口感或外形；在食品、香水、植物学描述中很常见。"]}
{"word":"almonds","summary":{"en":"Almonds are edible nuts, often eaten as snacks or used in cooking and baking; the word can also refer to the crop/tree in farming contexts.","zh":"Almonds 指可食用的杏仁，常作零食或用于烹饪烘焙；也可在农业语境中指杏仁作物/杏仁树。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of nut with a mild, slightly sweet taste, often eaten raw or roasted, or used to make almond milk, flour, and desserts.","zh":"一种坚果，味道清淡略甜，常生吃或烘烤，也常用来制作杏仁奶、杏仁粉和甜点。"},"examples":[{"en":"I snack on almonds when I need something healthy.","zh":"我需要健康零食时会吃点杏仁。"},{"en":"This cake is topped with sliced almonds.","zh":"这个蛋糕上面撒了杏仁片。"},{"en":"She bought unsalted roasted almonds.","zh":"她买了无盐烤杏仁。"}]},{"partOfSpeech":"n.","definition":{"en":"The almond tree or its seed (especially when talking about farming or production).","zh":"杏仁树或其种子（尤其在谈论种植或产量时）。"},"examples":[{"en":"California produces a large share of the world’s almonds.","zh":"加州生产了全球很大比例的杏仁。"},{"en":"The farm grows almonds and olives.","zh":"这个农场种杏仁和橄榄。"}]}],"synonyms":["nuts","almond nuts"],"phonetic":"/ˈɑməndz/","extraExplanation":["“Almonds”通常用复数来表示“作为食物的一般意义”（像说“nuts”“grapes”一样）。单数“an almond”更常用于指“一颗/一粒杏仁”。","有些人会对杏仁过敏；在餐厅或烘焙食品里看到“may contain almonds / traces of almonds”（可能含有杏仁/微量杏仁）时要特别留意。","英语里常见搭配：almond milk（杏仁奶）、almond flour（杏仁粉）、almond butter（杏仁酱）、sliced/chopped almonds（杏仁片/碎杏仁）、blanched almonds（去皮杏仁）。"]}
{"word":"almondy","summary":{"en":"“Almondy” describes something that tastes or smells like almonds.","zh":"“almondy”用来形容带有杏仁味或杏仁香气的东西。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the taste or smell of almonds; reminiscent of almonds.","zh":"有杏仁味（或杏仁香气）的；带有杏仁风味的。"},"examples":[{"en":"The cake had an almondy aroma from the extract.","zh":"这块蛋糕因为加了香精而带着一股杏仁香。"},{"en":"I like almondy desserts, especially marzipan.","zh":"我喜欢带杏仁味的甜点，尤其是杏仁膏（marzipan）。"}]}],"synonyms":["almond-flavored","nutty","marzipan-like"],"phonetic":"ˈɑməndi","extraExplanation":["“almondy”是由“almond（杏仁）+ -y”构成的形容词，-y 常表示“有……的特征/味道/感觉”（如 creamy, smoky）。","在食物描述里，“almondy”常指类似杏仁的香气；这种香味有时来自杏仁本身，也可能来自杏仁香精。某些“杏仁味”实际上来自一种叫苯甲醛（benzaldehyde）的香味成分，因此你也会在樱桃、杏核等食材中闻到类似气味。"]}
{"word":"almoner","summary":{"en":"An almoner is someone who distributes charity (alms), especially in historical religious or royal settings; historically in the UK it could also mean a hospital social-work officer.","zh":"almoner 指负责发放施舍/救济的人（多见于宗教或王室的历史语境）；在英国旧用法中也可指医院的救济/社工类工作人员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person whose job is to give money, food, or other help (alms) to poor people, especially for a church, monastery, or royal household (historical).","zh":"（历史用语）施舍官；（尤指为教会、修道院或王室）负责向穷人发放施舍（救济金、食物等）的人。"},"examples":[{"en":"In the medieval abbey, the almoner distributed bread and coins to the poor at the gate.","zh":"在中世纪的修道院里，施舍官在大门口向穷人分发面包和硬币。"},{"en":"The queen’s almoner kept a list of families who needed weekly help.","zh":"王后的施舍官记录了需要每周救济的家庭名单。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in British English, historical) a hospital worker who helped patients with practical and social problems; similar to a medical social worker.","zh":"（尤英式英语，较旧）医院救济员；帮助病人处理实际与社会问题的工作人员（类似医务社工）。"},"examples":[{"en":"After the war, many hospitals appointed an almoner to assist injured workers.","zh":"战后，许多医院任命救济员来帮助受伤的工人。"},{"en":"She trained as an almoner before the title “medical social worker” became common.","zh":"在“医务社工”这一称呼普及之前，她曾受训成为一名医院救济员。"}]}],"synonyms":["charity worker","distributor of alms","(historical) hospital social worker"],"phonetic":"/ˈæl.mə.nɚ/","extraExplanation":["“almoner”源自“alms（施舍、赈济）”。在欧洲中世纪，教会与王室常设此职，专门管理和发放慈善救济。","英国医院里“almoner”这一称呼在20世纪曾常见，后来多被“(medical) social worker（医务社工）”取代。"]}
{"word":"almoners","summary":{"en":"“Almoners” means people who distribute charity (alms), and historically it can also mean early hospital social workers (especially in British usage).","zh":"“almoners”指负责发放救济（施舍）的人；在历史上也可指早期医院的施济员/社会工作者（尤见于英式用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of almoner: a person whose job is to give money, food, or other help (“alms”) to people in need, often on behalf of a church, charity, or institution.","zh":"almoner 的复数：施舍官／施济员；代表教会、慈善机构或某个组织向贫困者发放救济（施舍）的人。"},"examples":[{"en":"In the Middle Ages, almoners distributed food and coins outside monasteries.","zh":"在中世纪，施舍官会在修道院外分发食物和钱币。"},{"en":"The charity trained volunteer almoners to support families in crisis.","zh":"该慈善机构培训志愿施济员来帮助陷入危机的家庭。"}]},{"partOfSpeech":"n.","definition":{"en":"(Especially British, historical) Hospital almoners: early hospital social workers who helped patients with financial aid and practical support.","zh":"（尤指英式用法，历史）医院施济员：早期医院里的社会工作者，负责协助病人获得经济援助与实际支持。"},"examples":[{"en":"Before modern social services, hospital almoners helped patients apply for assistance.","zh":"在现代社会福利制度出现之前，医院施济员会帮助病人申请救助。"},{"en":"Some older texts mention almoners as part of a hospital’s staff.","zh":"一些较早的文本会把医院施济员列为医院工作人员之一。"}]}],"synonyms":["charity worker","aid worker","benefactor (context-dependent)","social worker (hospital context)"],"phonetic":"/ˈɑlmənɚ/","extraExplanation":["“Almoner”来自“alms（施舍、救济）”。这个词在现代英语里偏旧或偏历史语境；在当代医院语境中更常见的是“social worker（社会工作者）”。","在文学与历史记录中，almoner 常与修道院、主教宫廷或贵族家庭联系在一起，体现当时宗教与慈善救济的制度化。"]}
{"word":"almonership","summary":{"en":"Almonership means the office or duties of an almoner—someone responsible for giving aid to people in need.","zh":"Almonership 指施赈官（施舍救济者）的职位或职责，即负责向需要帮助的人分发救济。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the position, office, or duties of an almoner (a person who distributes money, food, or other help to people in need, often for a church, a noble household, or a charity).","zh":"施赈官（施舍救济者）的职位、职务或工作内容；指负责分发施舍/救济（常见于教会、贵族家庭或慈善机构）的职责。"},"examples":[{"en":"In the old records, the abbey’s almonership managed daily food for the poor.","zh":"在旧档案中，这座修道院的施赈职掌负责为穷人安排每日食物。"},{"en":"He was appointed to the almonership and oversaw charitable gifts during winter.","zh":"他被任命负责施赈职务，并在冬季监督慈善捐赠的发放。"}]}],"synonyms":["the office of an almoner","charitable office","charitable duty","relief work"],"phonetic":"/ˈæl.mə.nər.ʃɪp/","extraExplanation":["“almonership”较为古旧，常出现在中世纪至近代早期的教会或王室/贵族家庭文献中；当时“almoner”会代表机构向穷人发放钱粮、衣物等，也可能负责相关账目与仪式性施舍。现代英语里更常用“charity work / charitable office / the role of an almoner”等表达，或直接用“almoner”（在英式语境中仍偶见，如某些医院/王室职位的历史称谓）。"]}
{"word":"almoning","summary":{"en":"Almoning is a place name in Nova Scotia, Canada (a small community/village).","zh":"Almoning 是加拿大新斯科舍省的地名（一个小社区/村庄）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small community (village) in Nova Scotia, Canada; a proper noun used as a place name.","zh":"加拿大新斯科舍省的一个小社区（村庄）名称；作为地名使用的专有名词。"},"examples":[{"en":"Almoning is a quiet rural community in Nova Scotia.","zh":"Almoning 是新斯科舍省一个安静的乡村社区。"},{"en":"They drove from Truro to Almoning for the weekend.","zh":"他们周末从特鲁罗开车去 Almoning。"}]}],"phonetic":"/ˈælmoʊnɪŋ/","extraExplanation":["“Almoning”更常见于地名语境，不是常用英语词汇。日常英语学习中，你可能想查的是 **among**（在……之中），拼写很接近。","如果你原本想表达“在一群人/事物之中”，常用结构是：**among + 复数名词/代词**（e.g., among friends 在朋友之间）。"]}
{"word":"almonries","summary":{"en":"Almonries are places (often in monasteries or churches) where alms or charitable help is given out.","zh":"Almonries 指施舍处（多见于修道院或教堂），用于发放救济与慈善援助。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of almonry) places—especially in a monastery, church, or large household—where charity (food, money, or other help) is given to people in need.","zh":"（almonry 的复数）施舍处；（尤指修道院、教堂或大宅中）向贫困者发放食物、钱或救济的地方。"},"examples":[{"en":"In medieval towns, almonries often distributed bread to the poor.","zh":"在中世纪城镇里，施舍处常常向穷人分发面包。"},{"en":"The monastery’s almonries were busy during winter when more people needed help.","zh":"冬天需要帮助的人更多时，修道院的施舍处会格外忙碌。"}]}],"synonyms":["charity office","relief center","food pantry","alms house"],"phonetic":"/ˈælmənri/","extraExplanation":["“almonry”源自“alms”（施舍、救济）一词；在中世纪欧洲，很多修道院会设立专门的施舍处，并由负责施舍的人（almoner）管理。这个词偏历史/文学用法，现代英语里更常见的表达是“charity office/food pantry”。"]}
{"word":"almonry","summary":{"en":"An almonry is a place or office (often in a monastery or church) where charity is given to the poor.","zh":"almonry 指（多见于修道院或教堂的）施舍处/施赈机构，用于向穷人发放救济。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A place (especially in a monastery, church, or large household) where food, money, or other help is given to poor people; the office responsible for giving charity.","zh":"（尤指修道院、教堂或大型宅邸中）施舍处／施赈处；负责救济穷人的慈善部门。"},"examples":[{"en":"In the Middle Ages, travelers could sometimes receive bread at the monastery’s almonry.","zh":"在中世纪，旅人有时可以在修道院的施舍处领到面包。"},{"en":"Records show that the almonry distributed food during the winter.","zh":"记录显示，施舍处在冬季分发食物。"}]}],"synonyms":["charity office","alms house (related)","almshouse (related)","poor relief (related)"],"phonetic":"/ˈɑl.mən.ri/","extraExplanation":["“almonry”来自“alms（施舍）”，常见于中世纪欧洲的宗教与慈善语境。修道院里通常有专门的“almoner（施舍官/济贫官）”管理施舍。","现代英语里这个词较少见，更常在历史书写、文学作品或古建筑介绍中出现；相关词有“almshouse（救济院/贫民院）”。"]}
{"word":"Almont","summary":{"en":"Almont is usually a proper noun: most often a U.S. place name, and sometimes a personal name.","zh":"Almont 通常是专有名词：最常见是美国地名，也可能作人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun), used for several towns/communities in the United States (for example, Almont in Michigan and Almont in Colorado).","zh":"地名（专有名词）：美国若干城镇/社区的名称（例如密歇根州的 Almont、科罗拉多州的 Almont）。"},"examples":[{"en":"We stopped in Almont, Michigan, for lunch on the way north.","zh":"我们去北边的路上在密歇根州的 Almont 停下来吃午饭。"},{"en":"Almont is a small community, so services can be limited.","zh":"Almont 是个小社区，所以服务设施可能比较有限。"}]},{"partOfSpeech":"n.","definition":{"en":"a personal name (surname or given name), less common in everyday English.","zh":"人名（姓氏或名字）：在日常英语中相对少见。"},"examples":[{"en":"Dr. Almont will see you now.","zh":"Almont 医生现在可以见你了。"},{"en":"I met someone named Almont at the conference.","zh":"我在会议上认识了一个叫 Almont 的人。"}]}],"synonyms":["Almonte (similar spelling, different name)"],"phonetic":"/ˈæl.mɑnt/","extraExplanation":["“Almont”常被当作专名使用，因此在阅读或听到时，最重要的是结合上下文判断：是在说“地点”（如 Michigan/Colorado 的 Almont），还是在说“人名”。","词形上，“-mont”在法语/英语地名中常让人联想到“mountain/山”（如 Beaumont、Clermont），但“Almont”作为美国地名的具体命名来源可能因地区而异；需要查某一个州/县的历史资料才能确定。"]}
{"word":"Almoravid","summary":{"en":"Almoravid refers to a medieval Muslim Berber dynasty/movement in North Africa and al-Andalus (11th–12th centuries), or to things connected with it.","zh":"Almoravid 指11—12世纪活跃于北非与安达卢斯的穆斯林柏柏尔人王朝/运动，或与其相关的人与事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a Muslim Berber movement and dynasty that ruled parts of North and West Africa and al-Andalus (Islamic Spain) in the 11th–12th centuries.","zh":"阿尔摩拉维德王朝（或运动）的成员；该穆斯林柏柏尔人宗教与政治力量在11—12世纪统治过北非、西非部分地区以及安达卢斯（伊斯兰西班牙）。"},"examples":[{"en":"The Almoravids expanded their rule from the Sahara into Morocco and Spain.","zh":"阿尔摩拉维德人将势力从撒哈拉扩展到摩洛哥和西班牙。"},{"en":"In medieval Iberia, the Almoravids fought to defend Muslim territories from Christian kingdoms.","zh":"在中世纪伊比利亚半岛，阿尔摩拉维德人曾为保卫穆斯林领地而与基督教诸王国作战。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Almoravid dynasty, its people, or its art, architecture, and history.","zh":"阿尔摩拉维德的；与阿尔摩拉维德王朝、其人民，或其艺术、建筑与历史相关的。"},"examples":[{"en":"Researchers studied Almoravid coins to understand trade routes.","zh":"研究者通过阿尔摩拉维德钱币来了解贸易路线。"},{"en":"The museum displayed an Almoravid-style inscription from North Africa.","zh":"博物馆展出了一件北非的阿尔摩拉维德风格铭文。"}]}],"synonyms":["Almoravide","Almoravid dynasty","Almoravid empire"],"phonetic":"ˌæl.məˈrɑː.vɪd","extraExplanation":["“Almoravid”来自阿拉伯语称呼（常见解释为与“披面纱/面纱者”有关），在英语中多用于历史语境：如“Almoravid dynasty/empire（阿尔摩拉维德王朝/帝国）”。","在英文史学写作里，这个词常与“al-Andalus（安达卢斯）”“Maghreb（马格里布/北非西部）”“Berber/Amazigh（柏柏尔人/阿马齐格人）”等词一起出现，帮助定位其地理与文化背景。"]}
{"word":"almoravid","summary":{"en":"Almoravid refers to a medieval Muslim Berber dynasty (and its people) that ruled parts of North/West Africa and Spain in the 11th–12th centuries, or anything related to them.","zh":"Almoravid 指中世纪11—12世纪统治北非/西非及西班牙部分地区的穆斯林柏柏尔王朝（及其成员），也可作形容词表示“与其相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a Muslim Berber dynasty (11th–12th centuries) that ruled parts of North and West Africa and Spain (Al-Andalus).","zh":"阿尔摩拉维德王朝的成员；指11—12世纪统治北非、西非及西班牙（安达卢斯）部分地区的穆斯林柏柏尔王朝的人。"},"examples":[{"en":"The Almoravids expanded their rule from the Sahara into Morocco and then into Al-Andalus.","zh":"阿尔摩拉维德人将势力从撒哈拉扩展到摩洛哥，随后进入安达卢斯。"},{"en":"Historians often discuss the Almoravids when explaining how Islamic Spain was politically unified for a time.","zh":"历史学家在解释伊斯兰西班牙曾一度实现政治统一时，常会提到阿尔摩拉维德王朝。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Almoravids or their period, culture, art, or rule.","zh":"与阿尔摩拉维德王朝（或其时代、文化、艺术、统治）有关的。"},"examples":[{"en":"The museum has coins with Almoravid inscriptions.","zh":"博物馆里有带有阿尔摩拉维德铭文的硬币。"},{"en":"She wrote a paper on Almoravid architecture in Morocco.","zh":"她写了一篇关于摩洛哥阿尔摩拉维德建筑的论文。"}]}],"synonyms":["al-Murabitun","Almoravid dynasty","Almoravid Empire","Murabit"],"phonetic":"/ælˈmɔrəˌvɪd/","extraExplanation":["“Almoravid”源自阿拉伯语称呼，常与al-Murābiṭūn（意为“驻守边地/结社修行者”之类的宗教—军事团体称谓）相关。中文里也常译作“穆拉比特王朝”。","在英语史学写作中，这个词多出现在“Almoravid dynasty / Almoravid Empire / Almoravid period”等搭配里；谈到伊比利亚半岛时，常与“Al-Andalus（安达卢斯）”“Reconquista（收复失地运动）”等词一起出现。"]}
{"word":"Almoravide","summary":{"en":"Almoravid/Almoravide refers to the medieval Berber Muslim dynasty that ruled parts of North Africa and Iberia, and to things connected with it.","zh":"Almoravid/Almoravide 指中世纪统治北非与伊比利亚半岛部分地区的柏柏尔穆斯林王朝，也可作形容词表示“与其有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Almoravid dynasty, a Berber Muslim movement and ruling dynasty that controlled parts of North Africa and Iberia (Spain and Portugal) in the 11th–12th centuries","zh":"阿尔摩拉维德王朝（或“阿尔摩拉维德派”）成员；一个柏柏尔穆斯林运动与统治王朝，11—12世纪曾控制北非及伊比利亚半岛（西班牙、葡萄牙）部分地区"},"examples":[{"en":"The Almoravids expanded their rule from Morocco into al-Andalus.","zh":"阿尔摩拉维德王朝从摩洛哥扩张到安达卢斯地区。"},{"en":"Many textbooks mention the Almoravids when explaining medieval Spain.","zh":"许多教材在讲述中世纪西班牙时会提到阿尔摩拉维德王朝。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Almoravids or their time, culture, or government","zh":"与阿尔摩拉维德王朝（或其时代、文化、政权）有关的"},"examples":[{"en":"Almoravid architecture influenced later buildings in the region.","zh":"阿尔摩拉维德建筑影响了当地后来的建筑风格。"},{"en":"The museum has a small Almoravid coin collection.","zh":"这家博物馆有一小批阿尔摩拉维德时期的硬币收藏。"}]}],"synonyms":["Almoravid dynasty","al-Murabitun"],"phonetic":"/ælˈmɔːrəvɪd/","extraExplanation":["“Almoravide”更常见于法语/西班牙语的拼写；英语里通常写作 **Almoravid**（单数/形容词），复数 **Almoravids**。","历史语境：阿尔摩拉维德最早是撒哈拉边缘的宗教改革运动，后来建立政权，以马拉喀什（Marrakesh）为重要中心，并在伊比利亚半岛介入并统治部分泰法诸国（taifas）。"]}
{"word":"almoravide","summary":{"en":"Almoravide: a person from the Almoravid Berber Muslim dynasty/movement that ruled in North Africa and parts of Muslim Spain in the 11th–12th centuries.","zh":"Almoravide：阿尔摩拉维德王朝/运动的成员，11—12世纪在北非及安达卢斯部分地区统治的柏柏尔穆斯林势力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Almoravid movement/dynasty, a Berber Muslim group that founded an empire in North Africa and ruled parts of al-Andalus (Muslim Spain) in the 11th–12th centuries","zh":"阿尔摩拉维德人；阿尔摩拉维德王朝成员（11—12世纪兴起于北非、并统治过安达卢斯〈伊比利亚半岛穆斯林地区〉部分地区的柏柏尔穆斯林势力）"},"examples":[{"en":"The Almoravide rulers expanded their influence from the Sahara to Morocco and into al-Andalus.","zh":"阿尔摩拉维德统治者将势力从撒哈拉扩展到摩洛哥，并进入安达卢斯。"},{"en":"Some histories describe how Almoravide armies crossed into Iberia to support local Muslim states.","zh":"一些史书描述了阿尔摩拉维德军队如何渡海进入伊比利亚半岛，支援当地的穆斯林政权。"}]}],"synonyms":["Almoravid"],"phonetic":"/ælˈmɔrəvɪd/","extraExplanation":["“Almoravide”更常见的英语拼写是“Almoravid”。该词通常用于历史与伊斯兰世界研究语境，指一个以宗教改革与军事扩张著称的柏柏尔穆斯林运动/政权。","在西班牙与葡萄牙的历史叙述中，Almoravids常与“al-Andalus（安达卢斯）”以及随后兴起的“Almohads（阿尔摩哈德）”并列讨论。"]}
{"word":"Almoravides","summary":{"en":"Almoravides (more commonly spelled Almoravids) were a North African Muslim ruling group and dynasty that controlled parts of Morocco and Islamic Spain in the 11th–12th centuries.","zh":"Almoravides（更常见拼写为Almoravids）指北非穆斯林统治集团与其王朝，曾在11—12世纪统治摩洛哥及伊斯兰西班牙的部分地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a North African Muslim (Berber) ruling group that founded the Almoravid dynasty and controlled parts of Morocco and Islamic Spain (Al‑Andalus) in the 11th–12th centuries","zh":"阿尔穆拉比特人（北非柏柏尔穆斯林统治集团），建立阿尔穆拉比特王朝，并在11—12世纪统治摩洛哥及伊比利亚半岛的部分伊斯兰西班牙（安达卢斯）地区"},"examples":[{"en":"The Almoravids expanded from the Sahara into Morocco and then crossed into Al‑Andalus.","zh":"阿尔穆拉比特人从撒哈拉地区扩张到摩洛哥，随后进入安达卢斯。"},{"en":"Some histories describe the Almoravids as strict religious reformers who built a powerful empire.","zh":"一些史书把阿尔穆拉比特人描述为严格的宗教改革者，并建立了强大的帝国。"}]}],"synonyms":["Almoravids"],"phonetic":"/ˌæl.mə.rəˈvɪdz/","extraExplanation":["“Almoravides”常见于较旧或受法语/西语拼写影响的写法；现代英语里更常见的拼写是“Almoravids”。","他们的重要城市与势力中心包括马拉喀什（Marrakesh）。在伊比利亚半岛，他们曾介入当地泰法诸国（Taifa kingdoms）与基督教王国之间的战争局势。"]}
{"word":"almoravides","summary":{"en":"Almoravids: a medieval Muslim Berber dynasty/movement that ruled in North/West Africa and al-Andalus (11th–12th centuries).","zh":"阿尔摩拉维德王朝：中世纪穆斯林柏柏尔人王朝/运动，统治过北非、西非部分地区与安达卢斯（11—12世纪）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Almoravids: a Muslim Berber dynasty and religious movement that ruled parts of North and West Africa and al-Andalus (parts of Spain and Portugal) in the 11th–12th centuries","zh":"阿尔摩拉维德王朝（阿尔穆拉比通）：11—12世纪兴起的穆斯林柏柏尔人王朝与宗教运动，统治过北非与西非部分地区，以及伊比利亚半岛的安达卢斯（今西班牙、葡萄牙部分地区）"},"examples":[{"en":"The Almoravids expanded their rule from the Sahara region into Morocco and al-Andalus.","zh":"阿尔摩拉维德人从撒哈拉地区扩张势力，进入摩洛哥与安达卢斯。"},{"en":"In many history books, the Almoravids are discussed alongside the Almohads.","zh":"在许多历史书里，阿尔摩拉维德王朝常与阿尔摩哈德王朝一起讨论。"}]}],"synonyms":["al-Murabitun","Almorávides"],"phonetic":"/ˌælmoʊrəˈvɪdz/","extraExplanation":["“Almoravids”在英文中通常是复数专名；单数可说“an Almoravid”（一位阿尔摩拉维德人/该王朝成员），也可用来指该王朝本身。","英文名称来自阿拉伯语“al-Murābiṭūn”（常译作“驻守边地者/在宗教据点修行者”），反映其早期带有宗教改革与军事组织的性质。","若你输入的“almoravides”是西班牙语拼写（复数），“Almorávides”对应英文通常写作“Almoravids”。"]}
{"word":"almose","summary":{"en":"“Almost” means “very nearly; not quite.”","zh":"“almost”表示“几乎；差一点（但没到）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Very nearly; not quite.","zh":"几乎；差一点（但未达到）。"},"examples":[{"en":"I’m almost finished with my homework.","zh":"我的作业几乎做完了。"},{"en":"It’s almost midnight—let’s go home.","zh":"快到午夜了——我们回家吧。"},{"en":"She almost fell, but she caught herself.","zh":"她差点摔倒，但稳住了。"}]},{"partOfSpeech":"adv.","definition":{"en":"Used to say something is similar in many ways (but not exactly the same).","zh":"用于表示“在很多方面很像（但不完全一样）”。"},"examples":[{"en":"Their new apartment is almost the same size as the old one.","zh":"他们的新公寓大小几乎和旧的一样。"},{"en":"This tastes almost like coffee, but it’s actually tea.","zh":"这个味道几乎像咖啡，但其实是茶。"}]}],"synonyms":["nearly","practically","virtually","just about"],"phonetic":"/ˈɔlmoʊst/","extraExplanation":["你输入的“almose”常见是拼写错误，正确拼写通常是“almost”。","“almost”常与数量/时间/程度搭配：almost all（几乎全部）、almost every day（几乎每天）、almost impossible（几乎不可能）。","和“nearly”很接近；口语里“almost”更常见。“almost”也常用于“almost did”表示“差点就……（但没有）”，如：I almost forgot.（我差点忘了。）"]}
{"word":"almost","summary":{"en":"“Almost” means “nearly” or “just short of,” used to show something is very close but not fully true or finished.","zh":"“almost”表示“几乎/差一点”，强调非常接近但还没有完全发生、完成或成立。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Nearly; not completely; very close to happening or being true.","zh":"几乎；差一点；接近但未完全发生或成立。"},"examples":[{"en":"I almost missed the bus.","zh":"我差点错过公交车。"},{"en":"The movie is almost over.","zh":"电影快结束了。"},{"en":"It’s almost impossible to finish in one day.","zh":"要在一天内完成几乎不可能。"}]}],"synonyms":["nearly","just about","practically","all but"],"phonetic":"/ˈɔlmoʊst/","extraExplanation":["“almost”常与动词连用表示“差点做成/差点发生”，如“almost fell（差点摔倒）”。注意它表达的是“没有发生，但非常接近”。","与“nearly”很接近，但口语中“almost”更常见；某些搭配更自然：常说“almost never（几乎从不）”“almost all（几乎全部）”。","位置上常放在主要动词前（I almost forgot），或be动词/助动词之后（I am almost ready / I have almost finished）。"]}
{"word":"almous","summary":{"en":"“Almost” means “not quite; very nearly,” often used to show something is close to happening or being true.","zh":"“almost”表示“几乎；差一点”，常用来说明某事接近发生或接近为真。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Not quite; very nearly (used to show something is close to being true or happening).","zh":"几乎；差一点（表示接近发生或接近为真）。"},"examples":[{"en":"I’m almost finished with my homework.","zh":"我的作业快写完了。"},{"en":"It’s almost midnight—let’s go home.","zh":"快到半夜了——我们回家吧。"},{"en":"She almost fell, but she caught herself.","zh":"她差点摔倒，但稳住了。"}]},{"partOfSpeech":"adv.","definition":{"en":"Nearly; approximately (used before numbers or amounts).","zh":"将近；大约（常用于数字或数量前）。"},"examples":[{"en":"The trip took almost three hours.","zh":"这趟行程花了将近三个小时。"},{"en":"He has almost $100 in his wallet.","zh":"他钱包里有将近100美元。"}]},{"partOfSpeech":"adv.","definition":{"en":"Similar to but not exactly; practically (used to compare).","zh":"几乎等同于；差不多（用于比较但并非完全相同）。"},"examples":[{"en":"For her, singing is almost like breathing.","zh":"对她来说，唱歌几乎像呼吸一样自然。"},{"en":"Their new plan is almost the same as the old one.","zh":"他们的新计划跟旧计划几乎一样。"}]}],"synonyms":["nearly","practically","virtually","just about"],"phonetic":"/ˈɔlmoʊst/","extraExplanation":["“almous”通常不是标准英文拼写。你很可能想写的是 **almost**（最常见）。如果你的意思是“施舍/救济金”，对应的词更可能是 **alms**。"]}
{"word":"alms","summary":{"en":"Alms means money or help given to poor people, often as a charitable or religious act.","zh":"Alms 指施舍给穷人的钱或帮助，常带慈善或宗教色彩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Money, food, or other help given to poor people as an act of charity.","zh":"（施舍给穷人的）救济、施舍（钱、食物或其他帮助）。"},"examples":[{"en":"The monastery distributes alms to families in need.","zh":"这座修道院向有需要的家庭发放施舍。"},{"en":"He asked for alms outside the subway station.","zh":"他在地铁站外乞讨。"},{"en":"Many people give alms during religious festivals.","zh":"许多人会在宗教节日期间施舍。"}]},{"partOfSpeech":"n.","definition":{"en":"Charitable giving as a practice (often in a religious context).","zh":"（常指宗教语境中的）施舍行为、慈善布施。"},"examples":[{"en":"In some traditions, alms is seen as a duty.","zh":"在一些传统中，施舍被视为一种义务。"},{"en":"She donates quietly, treating alms as part of her faith.","zh":"她低调捐助，把施舍当作信仰的一部分。"}]}],"synonyms":["charity","donation","handout","aid","relief"],"phonetic":"/ɑlmz/","extraExplanation":["“alms”源自古英语/希腊语词根，和“compassion（怜悯）”相关。现代英语里它几乎总以复数形式出现（alms），即使表示“一笔施舍”也常说“give alms”。","语体上，“alms”带有较正式或宗教色彩；日常更常用“charity”“donation”“handout（略带贬义）”。在文学或历史语境中也常见“alms for the poor（施舍给穷人）”。"]}
{"word":"almsdeed","summary":{"en":"An almsdeed is a charitable act, especially giving to the poor.","zh":"almsdeed 指施舍救济穷人的善行（较古旧用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a charitable act, especially giving money, food, or help to poor people (an act of almsgiving).","zh":"施舍善行；救济穷人的行为（尤指布施金钱、食物或帮助）。"},"examples":[{"en":"In the old story, the traveler’s only almsdeed was sharing his bread with a hungry child.","zh":"在那个古老故事里，旅人唯一的施舍善行就是把面包分给饥饿的孩子。"},{"en":"The church encouraged almsdeeds during the winter to support families in need.","zh":"教会鼓励人们在冬天行善施舍，以帮助有需要的家庭。"}]}],"synonyms":["act of charity","charitable deed","good deed","donation","almsgiving"],"phonetic":"ˈɑmzˌdid","extraExplanation":["“almsdeed”较为古旧，现代英语更常用“charity”“act of charity”“donation”或“good deed”。","词源上可理解为“alms（施舍）+ deed（行为）”，常见于宗教、道德劝诫或较古典的文学语境中。"]}
{"word":"almsfolk","summary":{"en":"Almsfolk means poor people who receive charity (alms), and it is an old-fashioned, literary word.","zh":"almsfolk 指“领受施舍/救济的穷人”，属于较古旧、带文学色彩的用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Poor people who receive alms (money, food, or help given to the needy).","zh":"领受施舍的人；受赈济的穷人。"},"examples":[{"en":"The church set aside bread each week for the almsfolk.","zh":"教会每周留出面包分给受赈济的穷人。"},{"en":"In the old record, the mayor ordered blankets for the almsfolk during winter.","zh":"在那份旧记录里，市长下令在冬天为受赈济者发放毯子。"}]}],"synonyms":["the poor","the needy","paupers","charity recipients"],"phonetic":"/ˈɑlmzˌfoʊk/","extraExplanation":["“almsfolk”是较古旧、带文学色彩的词，多见于旧文献或历史语境中；现代英语更常用“the poor / the needy / charity recipients”。","词由“alms（施舍、救济）+ folk（人们）”组成，强调“作为一个群体的受助者”。在现代写作中使用时，会带有“年代感”或“叙事/历史风格”。"]}
{"word":"almsful","summary":{"en":"Almsful means “charitable; giving alms to people in need.” It’s rare and sounds literary/old-fashioned.","zh":"Almsful 意为“乐善好施、施舍救济的”。较少见，带文学/古风色彩。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"giving alms (money, food, or help to people in need); charitable in a way that focuses on helping the poor.","zh":"施舍（救济金、食物或帮助给有需要的人）；乐善好施的（尤指救助贫困者）。"},"examples":[{"en":"In the story, an almsful traveler shares his bread with hungry children.","zh":"在故事里，一位乐善好施的旅行者把面包分给饥饿的孩子们。"},{"en":"She was known for her almsful habits, quietly supporting local shelters.","zh":"她以乐善好施闻名，默默资助当地收容所。"}]}],"synonyms":["charitable","generous","benevolent","almsgiving"],"phonetic":"/ˈɑmz.fəl/","extraExplanation":["“almsful”是较少见、偏文学/古风的词，由“alms（施舍、救济）+ -ful（充满/具有……的）”构成。现代英语里更常用“charitable / generous / almsgiving”。","“alms”在英语中通常当作复数形式使用（没有常见的单数*alm*来表示“一次施舍”），所以“almsful”带有一种古典色彩，常见于描写人物品德或宗教慈善语境。"]}
{"word":"almsgiver","summary":{"en":"An almsgiver is someone who gives alms—charitable help to poor people.","zh":"almsgiver 指向穷人施舍（施济）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who gives money, food, or help to poor people (gives “alms,” usually as charity)","zh":"施舍者；施济者（向穷人施舍“施舍物/救济金”的人）"},"examples":[{"en":"The almsgiver left a small coin for the beggar outside the temple.","zh":"施舍者在寺庙外给乞丐留了一枚小硬币。"},{"en":"In many stories, the almsgiver is rewarded for kindness rather than wealth.","zh":"在许多故事里，施舍者因善意而非财富得到回报。"}]}],"synonyms":["donor","benefactor","giver","philanthropist"],"phonetic":"/ˈɑmzˌɡɪvɚ/","extraExplanation":["“alms”指对穷人的施舍（钱、食物等），带有宗教或传统慈善的色彩；“almsgiver”是较正式、偏书面用语。现代日常英语更常说 donor（捐赠者）、giver（给予者）、charitable person（乐善好施的人）。","词源上，“alms”来自希腊语，原意与“怜悯、施舍”有关；因此这个词常见于宗教语境（如基督教、伊斯兰教、佛教等的慈善实践）和文学叙述中。"]}
{"word":"almsgiving","summary":{"en":"Almsgiving means giving help to the poor, especially as a religious or moral practice.","zh":"Almsgiving 指对穷人施舍或济贫，常带有宗教或道德实践的意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of giving money, food, or other help to poor people, often as a religious or moral duty.","zh":"施舍；济贫（给穷人钱、食物或其他帮助，常被视为宗教或道德责任）"},"examples":[{"en":"During Lent, many Christians practice almsgiving to support people in need.","zh":"在四旬期，许多基督徒会通过施舍来帮助有需要的人。"},{"en":"The mosque encouraged almsgiving as part of caring for the community.","zh":"清真寺鼓励大家通过施舍来关怀社区。"},{"en":"She believed almsgiving should be done quietly, without seeking praise.","zh":"她认为施舍应当低调进行，不求称赞。"}]}],"synonyms":["charity","giving to the poor","donation","philanthropy"],"phonetic":"/ˈɑlmzˌɡɪvɪŋ/","extraExplanation":["“almsgiving”来自“alms（施舍物）+ giving（给予）”。“alms”源自古英语，并与希腊语 eleēmosynē（怜悯、施舍）有关，因此这个词常带有“出于怜悯而帮助”的意味。","在不同宗教文化中都有相近概念：基督教语境常见于“charity / almsgiving”；伊斯兰传统中有“zakat（天课，具有义务性质）”与“sadaqah（自愿施舍）”；佛教也常讲“布施”。英语里用“almsgiving”时，多强调“施舍/济贫”这一行为本身，而不只是一般的“慈善”。","语域上，“almsgiving”偏正式、带宗教/历史色彩；日常口语更常说“giving to the poor”或“donating to charity”。"]}
{"word":"almshouse","summary":{"en":"An almshouse is an old-fashioned charitable home that provided free shelter and basic care for poor people, especially the elderly.","zh":"almshouse 指旧式的慈善救济院，为贫困者（尤指老人）提供免费住宿和基本照护。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place where poor people (especially the elderly) were given free housing and basic care, usually supported by a church, charity, or local government (common in the past)","zh":"（旧时的）救济院；贫民院（多为穷人，尤其是老人，提供免费住宿与基本照护，常由教会、慈善机构或地方政府资助）"},"examples":[{"en":"In the 1800s, some towns built an almshouse for people who had no family to support them.","zh":"在19世纪，一些城镇会修建救济院，收容那些没有家人扶养的人。"},{"en":"The novel describes an old man who fears ending his life in the almshouse.","zh":"小说描写了一位老人害怕自己晚年会被送进救济院。"}]}],"synonyms":["poorhouse","charity home","shelter (historical sense)"],"phonetic":"/ˈɑlmzˌhaʊs/","extraExplanation":["“almshouse”来自“alms（施舍、赈济）+ house（房屋）”。在英美历史中，它与“poorhouse（贫民院）”“workhouse（济贫院/工场式救济院）”相关，带有明显的时代背景：当时社会救助体系不完善，贫困者往往只能依靠慈善或地方救济。现代英语里这个词较少用于现实机构，更多出现在历史叙述、文学作品或讨论旧式社会福利时。","文学与文化语境中，“almshouse”常用来传达贫穷、社会边缘与尊严受损的担忧；在描写19世纪社会的作品（如狄更斯式的贫困题材）里尤为常见。现代语境更常说“homeless shelter（收容所）”“nursing home（养老院）”“assisted living（协助生活社区）”等，含义与功能并不完全相同。"]}
{"word":"almshouses","summary":{"en":"Almshouses are charity-supported homes that provide free or low-cost housing for poor or elderly people.","zh":"Almshouses 指由慈善资助的救济住所，为贫困或年老的人提供免费或低价住房。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Buildings where poor, elderly, or disabled people are given free or very cheap housing, usually supported by a charity, church, or local community.","zh":"（通常由慈善机构、教会或社区资助的）救济院/济贫院：为贫困、年老或残障人士提供免费或低价住宿的住所。"},"examples":[{"en":"In the past, many towns built almshouses to shelter elderly people with no family support.","zh":"过去，许多城镇会建救济院，安置没有家人照料的老人。"},{"en":"The charity restored the old almshouses and offered affordable rooms to local residents.","zh":"慈善机构修复了这些老救济院，为当地居民提供可负担的房间。"},{"en":"The novel describes a widow who ends up living in the almshouses after losing her home.","zh":"小说描写了一位寡妇失去家园后被迫住进救济院。"}]}],"synonyms":["alms house","charity housing","poorhouse (historical/related)","workhouse (historical/related)"],"phonetic":"/ˈɑlmzˌhaʊzɪz/","extraExplanation":["“almshouse(s)”在英美历史上常与“poorhouse / workhouse（济贫院/劳役院）”一起出现，但语气更偏向“慈善救济的住所”。现代英语里这个词较偏历史/文学用法；在英国也常见“almshouses”指由基金会提供的成排小住宅（多给老年人居住），带有社区慈善传统。","词源提示：alm(s) 表示“施舍、救济”（如 alms），因此 almshouse 字面意思是“施舍之屋/救济之屋”。"]}
{"word":"almsman","summary":{"en":"An almsman is someone who receives alms or is supported by charity, especially in older or historical contexts.","zh":"almsman 指领受施舍或由慈善供养的人，多见于较旧式或历史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who receives alms (money, food, or help given to poor people).","zh":"领受施舍的人；受赈济者。"},"examples":[{"en":"In the old story, the almsman waited quietly outside the temple gate.","zh":"在这个古老的故事里，那位受施舍者安静地等在寺庙门口。"},{"en":"The charity distributed bread to each almsman in line.","zh":"慈善机构把面包分发给排队的每位受施舍者。"}]},{"partOfSpeech":"n.","definition":{"en":"A person supported by a charity or endowment (for example, in an almshouse or as an “almsman” at a college).","zh":"由慈善基金供养的人（例如住在救济院，或由学校/基金会资助的受助者）。"},"examples":[{"en":"He lived as an almsman in the almshouse after he could no longer work.","zh":"他无法继续工作后，作为受助者住进了救济院。"},{"en":"Historically, some institutions provided a room and meals for an almsman.","zh":"历史上，一些机构会为受助者提供住所和餐食。"}]}],"synonyms":["charity recipient","pauper","beggar (often less formal)"],"phonetic":"/ˈɑːlmzmən/","extraExplanation":["“almsman”由 alms（施舍、赈济）+ man（人）构成，是较偏旧式的用词。现代英语里更常见的说法包括：a beggar（乞丐，语气可能带评价）、a recipient of charity（慈善受助者，更中性）、a person experiencing homelessness（无家可归者，更尊重、更强调处境）。在正式或敏感语境中，建议根据具体情况选更中性的表达。"]}
{"word":"almsmen","summary":{"en":"“Almsmen” means men who receive charity, especially those supported by a church or charitable foundation.","zh":"“Almsmen”指接受施舍/救济的人（男性），尤指由教会或慈善机构供养者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A man who receives charity (alms), especially someone supported by a church or a charitable foundation.","zh":"接受施舍（救济金）的人，尤指由教会或慈善机构供养的男子。"},"examples":[{"en":"In earlier centuries, some hospitals provided food and lodging for almsmen.","zh":"在较早的世纪里，一些医院会为受济者提供食宿。"},{"en":"The foundation paid a small allowance to the almsmen living on the property.","zh":"该基金会向住在这处房产里的受济者发放少量津贴。"}]}],"synonyms":["charity recipient","pauper","beggar (sometimes, but can be harsher)","almshouse resident"],"phonetic":"/ˈɑːmzmən/","extraExplanation":["“almsman”的复数是“almsmen”。这个词带有较强的历史语境，常见于英国的救济制度、教会慈善与“almshouse（救济院/慈善济贫院）”相关的文字中。现代日常英语里更常用“a person receiving charity / a recipient of charity（受救济者）”。","词源上，“alms（施舍、救济）”来自古英语并与宗教慈善传统有关，因此在文学或历史写作中常用来营造“旧时社会救济/贫困救助”的氛围。"]}
{"word":"almsmoney","summary":{"en":"Alms money means money given to people in need as charity.","zh":"alms money 指出于慈善施舍给贫困者或有需要者的钱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Money given to poor people as an act of charity; money donated to help those in need.","zh":"施舍的钱；救济金（出于慈善而给穷人或有需要者的钱）。"},"examples":[{"en":"He gave alms money to a homeless man outside the station.","zh":"他在车站外给一位无家可归的人一些施舍钱。"},{"en":"The temple collects alms money to support families in need.","zh":"寺庙募集施舍钱来帮助有需要的家庭。"}]}],"synonyms":["alms","charity","donation","handout","spare change"],"phonetic":"/ɑːmz ˌmʌni/","extraExplanation":["“alms money”通常写作“alms”或“alms-money”（带连字符），把它连写成“almsmoney”比较少见，可能出现在旧式文本或特定拼写习惯中。","“alms”在英语里常带有宗教与传统慈善的语感（例如教会、寺庙、节日施舍）。在现代日常英语中，人们更常说“donation(s)”, “charity”, “spare change”，语气更中性。"]}
{"word":"almswoman","summary":{"en":"An old-fashioned word for a woman who lives by begging for charity.","zh":"指靠乞讨施舍为生的女子，较旧式、偏文学用语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A poor woman who lives by begging for money, food, or other help (often with a religious or old-fashioned tone).","zh":"靠乞讨（讨钱、讨食物或求施舍）为生的贫穷女子（常带有宗教或旧式语感）。"},"examples":[{"en":"In the old story, an almswoman asked for bread at the monastery gate.","zh":"在那个古老的故事里，一位女乞丐在修道院门口讨面包。"},{"en":"He gave a coin to an almswoman sitting quietly by the church.","zh":"他给了坐在教堂旁静静等候的一位女乞丐一枚硬币。"}]}],"synonyms":["beggar","female beggar","a woman asking for alms","homeless woman"],"phonetic":"/ˈɑlmzˌwʊmən/","extraExplanation":["“almswoman”由“alms（施舍、赈济）+ woman（女人）”构成，语体偏文学或古旧；现代英语更常用“a beggar / a homeless woman / a woman asking for alms”等表达。","在英国历史与基督教文化中，“alms（施舍）”常与“charity（慈善）”和教会救济联系在一起，因此这个词在文学作品里容易出现在教堂、修道院、节日施舍等场景。"]}
{"word":"almswomen","summary":{"en":"Almswomen means women who receive charity; it’s the plural of almswoman.","zh":"Almswomen 指“接受施舍/救济的女人”，是 almswoman 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of almswoman: women who live on charity (people who receive alms).","zh":"almswoman 的复数：靠施舍/救济生活的女人（接受救济的人）。"},"examples":[{"en":"In the old records, almswomen were listed among the town’s poor.","zh":"在旧档案里，almswomen 被列在镇上的贫民名单中。"},{"en":"The charity provided bread and blankets for almswomen during the winter.","zh":"这个慈善机构在冬天为 almswomen 提供面包和毯子。"}]}],"synonyms":["poor women","paupers","women receiving charity","beggars"],"phonetic":"ˈɑlmzˌwɪmɪn","extraExplanation":["这个词带有明显的“旧式/历史感”，常见于较早的英国社会背景或文学描写中。现代英语更常用 women in need、poor women、women receiving charity 等更中性、更具体的表达。","alms 指“施舍、救济（尤指给穷人的钱或食物）”。在历史上，接受救济的人可能与教会、慈善机构或 almshouse（济贫院/救济院）有关。"]}
{"word":"almucantar","summary":{"en":"An almucantar is an altitude circle: a line (circle) in the sky where all points are the same height above the horizon, also used as a marked scale on an astrolabe.","zh":"almucantar 指“等高度圈”：天球上连接所有相同地平高度（仰角）的点的圆；也可指星盘上用于表示高度的等高度线/刻度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In astronomy, a small circle on the sky (celestial sphere) connecting all points that have the same altitude above the horizon.","zh":"（天文学）天球上的等高度圈：把所有“离地平线高度相同”的点连成的圆。"},"examples":[{"en":"When a star crosses the almucantar of 30 degrees altitude, it is 30° above the horizon.","zh":"当一颗恒星穿过“高度为30度”的等高度圈时，它就在地平线上方30°。"},{"en":"The software plots almucantars to help you track an object’s altitude through the night.","zh":"这个软件会绘制等高度圈，帮助你追踪天体整晚的高度变化。"}]},{"partOfSpeech":"n.","definition":{"en":"A part of an astrolabe (a historic astronomical instrument): the altitude circle/scale used to measure the height of celestial objects.","zh":"（古代天文仪器“星盘”上的部件）用于测量天体高度的等高度圈/刻度。"},"examples":[{"en":"On some astrolabes, the almucantar lines are engraved to show different altitudes.","zh":"在一些星盘上，会刻出多条等高度线来表示不同的高度。"},{"en":"He learned to read the almucantar to estimate the Sun’s altitude.","zh":"他学会读取星盘上的等高度刻度来估算太阳高度。"}]}],"synonyms":["altitude circle","circle of equal altitude","parallel of altitude"],"phonetic":"/ˌæl.məˈkæn.tɚ/","extraExplanation":["“almucantar”来自阿拉伯语词源（与表示“圈、弧线”的概念有关），因为中世纪欧洲天文学大量吸收阿拉伯世界的观测与仪器传统。","学习时可以把它理解为“天空中的等高线”：就像地图上的等高线连接相同海拔，almucantar 连接相同“仰角/高度（altitude）”。"]}
{"word":"almuce","summary":{"en":"Almuce is a rare historical word meaning a medieval hood or hooded cape, often worn by clergy or scholars.","zh":"Almuce 是一个罕见的历史词，指中世纪的兜帽或连帽披肩，常由神职人员或学者穿戴。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medieval hood or hooded cape (often fur-lined), worn especially by clergy or scholars; an old-fashioned form of the word “amice/almuc.”","zh":"（中世纪的）兜帽或连帽披肩（常有毛皮内衬），尤指神职人员或学者所穿；是较古旧的拼写形式，接近 amice/almuc。"},"examples":[{"en":"In the manuscript illustration, the monk wears an almuce over his robe.","zh":"在那幅手稿插图中，修士在长袍外穿着一件 almuce（兜帽披肩）。"},{"en":"The cathedral records mention fur-lined almuc(e)s given to choir members in winter.","zh":"大教堂的记录提到，冬天会发放毛皮内衬的 almuc(e) 给唱诗班成员。"}]}],"synonyms":["hood","hooded cape","amice (related term)"],"phonetic":"ˈæl.mjus","extraExplanation":["这个词非常罕见，多见于中世纪拉丁语/古法语相关的历史文本、教会服饰史或博物馆说明中。现代英语里更常见的是 amice（礼仪服饰中的“领巾/披肩”一类）或 hood/cape（普通“兜帽/披风”）。不同资料里 almuce/almuc/amess 等拼写可能互通，但具体指的服饰部件会随时代与地区略有差异。"]}
{"word":"almuces","summary":{"en":"Almuces are archaic hoods or fur caps/cowls, especially in medieval clerical or scholarly clothing.","zh":"Almuces 是古语，指兜帽或毛皮帽/披肩式头巾，尤见于中世纪神职人员或学者的服饰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) A hood or fur cap/cowl, especially one worn by medieval clergy or scholars.","zh":"（古语）兜帽或毛皮帽/披肩式头巾，尤指中世纪神职人员或学者所戴的那种。"},"examples":[{"en":"In the manuscript illustration, the clerk wears an almuce lined with fur.","zh":"在那幅手稿插图里，那位书记官戴着一顶内衬毛皮的兜帽（almuce）。"},{"en":"The canon’s almuce was part of his winter church dress.","zh":"那位教士的兜帽（almuce）是他冬季礼服的一部分。"}]}],"synonyms":["hood","cowl","cap","coif"],"phonetic":"/ælˈmjuːs/","extraExplanation":["“almuces”通常是复数形式；单数是“almuce”。这是一个非常少见的历史词，多出现在中世纪教会服饰、手稿描述或文学中的古风描写。","词源大致来自中世纪拉丁语（almucia/almucium），在英语里属于古旧用法；现代英语更常用“hood”“cowl”等词来表达类似概念。"]}
{"word":"almud","summary":{"en":"Almud is an old Spanish/Portuguese dry-measure unit (often for grain) whose exact size varies by place and period.","zh":"Almud 是一种旧时西班牙语/葡萄牙语的干量单位（常用于谷物），具体大小因地区与时代而不同。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Spanish/Portuguese unit of dry measure (especially for grain), varying by region and time","zh":"一种传统的西班牙语/葡萄牙语“干量”计量单位（常用于谷物等），数值因地区与年代而异"},"examples":[{"en":"In older records, wheat was sometimes listed in almuds rather than kilograms.","zh":"在较早的记录里，小麦有时用 almud 来记载，而不是用千克。"},{"en":"The contract mentioned payment of two almuds of grain.","zh":"合同中提到以两 almud 的谷物作为支付。"}]}],"synonyms":["dry measure","traditional unit"],"phonetic":"/ælˈmʊd/","extraExplanation":["“almud”多见于历史文献、地契、税册或地方性民俗语境中；由于各地换算不同，阅读史料时通常需要结合具体地区与时期查表核对。","词源与阿拉伯语有关（与“al-”定冠词结构相似），反映了伊比利亚半岛历史上阿拉伯文化对语言与度量衡体系的影响。"]}
{"word":"almude","summary":{"en":"An almude is an old Spanish/Portuguese dry-measure unit (and sometimes the container), with size varying by place and era.","zh":"almude 指西班牙/葡萄牙旧时的干量单位（有时也指量器），具体大小因地区与年代而不同。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Spanish or Portuguese unit of dry measure (amount), varying by region and time; also used for a container holding that amount","zh":"（西班牙或葡萄牙的）传统干量单位（数值因地区与时代而异）；也可指盛装该量的容器"},"examples":[{"en":"In older records, grain was sometimes counted in almudes instead of kilograms.","zh":"在较早的记录里，谷物有时用 almude 来计量，而不是用千克。"},{"en":"The farmer filled two almudes of wheat before taking them to market.","zh":"农夫装满了两 almude 的小麦后才拿去集市。"}]}],"synonyms":["dry measure","traditional unit (of measure)","archaic measure"],"phonetic":"/ælˈmuːdeɪ/","extraExplanation":["这个词多见于历史、农业、殖民时期的文献或译著里；它不是现代国际通用单位，所以阅读时通常需要结合语境（地区/年代）换算或理解为“大约一斗/一桶的量”。","词源上与阿拉伯语计量词有关（带有常见的“al-”前缀），反映了伊比利亚半岛历史上的语言与文化交流。"]}
{"word":"almudes","summary":{"en":"“Almudes” means “almude” in the plural: a historical Spanish/Portuguese dry-measure unit, especially for grain.","zh":"“almudes”是“almude”的复数：一种历史上的西班牙语/葡萄牙语干货计量单位（常用于谷物），具体数值因地区与年代而不同。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plural form of almude: an old Spanish/Portuguese unit for measuring dry goods (especially grain), varying by region and time.","zh":"almude 的复数：一种旧时西班牙语/葡萄牙语的（干货，尤指谷物）计量单位，数值因地区与年代而异。"},"examples":[{"en":"In the old records, the farmer paid rent in almudes of wheat.","zh":"在旧账册里，农民用若干“almudes”的小麦来交租。"},{"en":"The document lists barley by almudes, not by modern kilograms.","zh":"这份文件用“almudes”而不是现代的公斤来记录大麦。"}]}],"synonyms":["dry measure","grain measure","bushel (rough equivalent)"],"phonetic":"/ælˈmuːdeɪz/","extraExplanation":["“almude”属于历史度量衡词，多见于关于伊比利亚半岛（西班牙、葡萄牙）及其殖民地的旧文献、地契、税务记录、贸易清单等。它通常是“干量”（dry measure），大致类似于“斗/升”这类容积性计量，但不同城镇/时期的具体容量可能差别很大。阅读历史文本时，常需要查该地区当时的换算表。"]}
{"word":"almuds","summary":{"en":"Almuds means “units of dry measure” (the plural of almud), used historically in Spanish contexts; the exact amount varies by place and time.","zh":"Almuds 是 almud 的复数，指西班牙语背景下历史上使用的干货容量单位；具体大小因地区和时代不同而变化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Spanish (and sometimes Portuguese/Latin American) unit of dry measure for grain, beans, etc.; its exact size varied by region and time period","zh":"（西班牙传统度量单位）“almud”，用于量取谷物、豆类等干货；具体容量因地区与时代而异"},"examples":[{"en":"The document says the farmer paid rent in almuds of wheat.","zh":"文件写道，这位农民用若干“almuds”的小麦来交租。"},{"en":"In different provinces, an almud could mean a different amount.","zh":"在不同省份里，“almud”可能代表不同的容量。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of almud","zh":"almud 的复数形式"},"examples":[{"en":"They stored several almuds of barley for winter.","zh":"他们为过冬储存了好几“almuds”的大麦。"}]}],"synonyms":["dry measure","historical unit","traditional measure"],"phonetic":"/ælˈmʊdz/","extraExplanation":["“almud”多见于历史资料、地契、账本或文学作品里，现代日常英语很少用；阅读时可把它理解为“一个地区性的谷物量具/容量单位”，必要时结合注释或上下文判断大概数量。","词源上常被认为与阿拉伯语有关（伊比利亚半岛历史上受阿拉伯文化影响较深），因此属于带有历史文化背景的度量词。"]}
{"word":"almuerzo","summary":{"en":"“Almuerzo” is a Spanish word meaning “lunch,” and it can also mean “I eat lunch” as a verb form.","zh":"“almuerzo”是西语词，常指“午餐”，也可作动词形式表示“我吃午饭”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) lunch; a midday meal.","zh":"（西语）午餐；中午吃的一餐。"},"examples":[{"en":"We met for almuerzo at a small café near the office.","zh":"我们在办公室附近的一家小咖啡馆一起吃了午餐（almuerzo）。"},{"en":"In many places, almuerzo is the main meal of the day.","zh":"在很多地方，午餐（almuerzo）可能是一天中最重要的一顿。"}]},{"partOfSpeech":"v.","definition":{"en":"(Spanish, verb form) “I have lunch / I eat lunch” (first-person singular present of almorzar).","zh":"（西语动词形式）“我吃午饭/我用午餐”（almorzar 的第一人称现在时）。"},"examples":[{"en":"Yo almuerzo a las doce.","zh":"我十二点吃午饭。"},{"en":"On weekdays, I usually almuerzo quickly.","zh":"工作日我通常很快就吃完午饭。"}]}],"synonyms":["(Spanish) comida (often “meal,” sometimes “lunch,” depending on region)","(English) lunch","midday meal"],"phonetic":"/ɑlˈmwerzoʊ/","extraExplanation":["“Almuerzo”在西班牙语国家里用法会有差异：在一些地区它就是“午餐”，而在另一些地区可能指上午晚些时候的加餐（类似 brunch 或早午间点心）。具体含义常由当地习惯和用餐时间决定。"]}
{"word":"almug","summary":{"en":"Almug is a rare Biblical word meaning a precious imported wood used for building and instruments.","zh":"Almug 是一个罕见的《圣经》用词，指一种进口的珍贵木材，用于建筑与制作乐器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a kind of valuable, fragrant wood mentioned in the Bible, imported for building and musical instruments (often identified with algum wood).","zh":"（《圣经》中提到的）一种珍贵、带香味的木材，用于建筑与制作乐器（常与 algum wood 视为同一种）。"},"examples":[{"en":"The temple account mentions almug wood used for pillars and instruments.","zh":"圣殿的记载提到用 almug 木制作柱子和乐器。"},{"en":"Scholars still debate what tree almug originally referred to.","zh":"学者们至今仍在争论 almug 最初指的是哪一种树。"}]}],"synonyms":["algum (variant spelling)"],"phonetic":"/ˈælˌmʌɡ/","extraExplanation":["“almug”主要见于《希伯来圣经/旧约》（如《列王纪上》与《历代志下》）关于所罗门时代贸易的段落：从海外输入这种名贵木材，用于建造与制作琴瑟等乐器。","由于古代植物名称在翻译与传抄中可能发生变化，almug/algum 的确切树种并不确定；常见推测包括檀香木、杜松类或其他硬木。阅读时可把它理解为“进口的高级木材”。"]}
{"word":"almugs","summary":{"en":"Almugs is a rare biblical term meaning valuable imported wood (plural of almug), also spelled algums.","zh":"Almugs 是罕见的《圣经》用词，指珍贵的进口木材（almug 的复数），也可写作 algums。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare word (plural) for a valuable imported wood mentioned in the Bible, used for building and fine objects; also spelled \"algums\" (singular: almug)","zh":"（复数）《圣经》中提到的一种珍贵进口木材，用于建筑与制作精美物品；也作 algums（单数：almug）"},"examples":[{"en":"In the Bible, almugs were used to make pillars and musical instruments.","zh":"在《圣经》中，almugs 被用来制作柱子和乐器。"},{"en":"The museum label notes that the exact tree called \"almug\" is uncertain.","zh":"博物馆说明牌指出，“almug”究竟指哪一种树并不确定。"}]}],"synonyms":["algums","almug (singular)","algum (singular)"],"phonetic":"/ˈæl.mʌɡz/","extraExplanation":["“almug(s)”主要出现在《列王纪上》与《历代志下》的英文译本中，指从海外（常被理解为俄斐 Ophir 一带）运来的贵重木材。","学者对它具体对应哪种树有不同看法（常见猜测包括檀香木、红木/紫檀类等），因此现代英语里很少在日常语境使用，更多用于宗教文本、圣经研究或古代贸易讨论。","拼写变体“algum(s)”常见于一些译本；检索资料时可同时搜索 almug/almugs 与 algum/algums。"]}
{"word":"Almund","summary":{"en":"“Almund” is usually a misspelling of “almond,” the nut; “almond” can also describe almond flavor, color, or shape.","zh":"“Almund”通常是“almond”的误拼；“almond”指杏仁，也可形容杏仁味、杏仁色或杏仁形。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a light-brown nut with a thin shell, eaten raw or used in cooking; it comes from the almond tree","zh":"杏仁（杏仁树的坚果；可生吃或用于烹饪、烘焙）"},"examples":[{"en":"She added sliced almonds to the salad.","zh":"她在沙拉里加了杏仁片。"},{"en":"Almond flour is common in gluten-free baking.","zh":"杏仁粉常用于无麸质烘焙。"},{"en":"Some people are allergic to almonds.","zh":"有些人对杏仁过敏。"}]},{"partOfSpeech":"adj.","definition":{"en":"having the color, shape, or flavor of an almond (often used before a noun)","zh":"杏仁味的；杏仁色的；杏仁形的（常作定语）"},"examples":[{"en":"The soap has an almond scent.","zh":"这款香皂有杏仁香味。"},{"en":"She has almond-shaped eyes.","zh":"她的眼睛是杏仁形的。"}]}],"synonyms":["nut (general)","almond nut","almond-shaped (for the shape use)"],"phonetic":"/ˈɑmənd/","extraExplanation":["“Almund”更常见是“almond”的拼写错误；标准拼写是 almond。","在部分历史文本或姓名中可能会看到“Almund/Almond”作为姓氏或人名，但日常英语里指食物时用 almond。"]}
{"word":"Almuredin","summary":{"en":"“Almuredin” is not a common English word; it is likely a proper name whose meaning depends on its origin.","zh":"“Almuredin”不是常见英语词，更可能是专有名词（人名/地名），含义取决于来源。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (not a standard English vocabulary word). It is most likely used as a person’s name or a place name, and its meaning depends on the language/culture it comes from.","zh":"一个专有名词（不是常见的英语词汇）。它更可能被用作人名或地名，具体含义取决于其来源语言与文化。"},"examples":[{"en":"I couldn’t find a dictionary entry for “Almuredin,” but it may be someone’s name.","zh":"我在词典里找不到“Almuredin”的词条，但它可能是一个人的名字。"},{"en":"Is “Almuredin” a surname, a character name, or a place name in your text?","zh":"你文本里的“Almuredin”是姓氏、角色名还是地名？"}]}],"phonetic":"/ˌæl.mjʊrˈɛdɪn/","extraExplanation":["“Almuredin”在英语主流词典中通常查不到，比较像外来语的人名/地名或拼写变体。若你能提供它出现的句子、语言背景（例如阿拉伯语/土耳其语/波斯语/巴尔干地区语言等）或是否为小说角色名，我可以更准确地判断读音、可能的词源与含义。","如果你是想查某个相近拼写的英语词，请确认是否是：Almohadin / Almoravid / al-Murīdīn（这类带阿拉伯语冠词 al- 的历史/宗教相关拼写），或是否存在拼写错误（例如把某个词的字母顺序打乱了）。"]}
{"word":"almuredin","summary":{"en":"“Almuredin” isn’t a recognized English word; it’s probably a proper name or a misspelling and needs context to identify.","zh":"“almuredin”不是常见英语词；更可能是专名或拼写误差，需要上下文才能确定含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a proper name (e.g., a person/place/character) or a misspelling of another term.","zh":"不是标准英语词；更可能是专有名词（人名/地名/角色名等）或其他词的拼写误差。"},"examples":[{"en":"I couldn’t find “almuredin” in an English dictionary—could it be a character’s name?","zh":"我在英语词典里找不到“almuredin”——它会不会是某个角色名？"},{"en":"If you share the sentence where you saw “almuredin,” I can help identify what it means.","zh":"如果你把看到“almuredin”的句子发出来，我可以帮你判断它的意思。"}]}],"phonetic":"/ˌæl.mjʊˈriː.dɪn/","extraExplanation":["“almuredin”在常见英语词典与语料中几乎没有记录，因此很可能是：①外来语/转写（来自阿拉伯语、土耳其语等的音译）；②文学、游戏或影视作品里的自造名；③拼写接近其他历史名词（如以 Almo-/Almu- 开头的中世纪伊比利亚相关词），但需要上下文才能确认。","如果你能提供：出现的原句、语言环境（英文小说/游戏/历史文章等）、以及是否为人名/地名，我可以进一步帮你锁定最可能的词源与正确拼写。"]}
{"word":"almury","summary":{"en":"“almury” isn’t a common English word; it’s probably a misspelling or a proper name.","zh":"“almury”不是常见英语单词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is likely a misspelling or a name (proper noun).","zh":"不是常见英语词典里的标准单词；更可能是拼写错误或专有名词（人名/地名/品牌名）。"},"examples":[{"en":"I couldn’t find “almury” in the dictionary—did you mean another word?","zh":"我在词典里找不到“almury”——你是不是想写另一个词？"},{"en":"“Almury” might be a person’s name, so its meaning depends on context.","zh":"“Almury”可能是人名，所以含义要看上下文。"}]}],"phonetic":"/ˈæl.mjʊr.i/","extraExplanation":["“almury”很可能是拼写误差。你可以检查是否想写：\n1) armory（军械库/武器库）\n2) alms（施舍/赈济）\n3) alchemy（炼金术）\n把你看到这个词的句子或截图发来，我可以根据上下文帮你确认正确词和意思。"]}
{"word":"almuten","summary":{"en":"Almuten is a traditional-astrology term for the planet with the strongest authority over a specific point in a birth chart.","zh":"Almuten 是传统占星术术语，指在星盘某个特定点上权力（尊贵）最强的那颗行星。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In traditional astrology) the planet that has the greatest essential dignity or strongest authority over a specific point in a chart (such as a degree of the zodiac), often considered the “ruler” or dominant planet for that place.","zh":"（传统占星术中）在星盘某个特定点（如黄道某一度数）上“本质尊贵”或权力最强的行星，常被视为该位置的“主宰星/最有力的行星”。"},"examples":[{"en":"In this chart, Venus is the almuten of the Ascendant degree.","zh":"在这张星盘里，金星是上升点度数的 almuten（主宰星）。"},{"en":"Some astrologers use the almuten to judge which planet has the final say in a house.","zh":"一些占星师会用 almuten 来判断某个宫位里哪颗行星最有决定权。"}]}],"synonyms":["ruler (astrology)","dominant planet","significator (context-dependent)"],"phonetic":"/ælˈmjuːtən/","extraExplanation":["这个词属于较少见的专业术语，主要出现在中世纪/传统占星体系里，不是现代日常英语词汇。","词源通常追溯到阿拉伯语（与“统治者/主宰”相关的表达），经由拉丁文传统进入英语占星写作。","不同传统/流派对“如何计算某点的 almuten”可能略有差异（例如是否加权不同尊贵：入庙、擢升、三分、界、面等），所以阅读资料时要看作者采用的规则。"]}
{"word":"Almyra","summary":{"en":"Almyra is usually a feminine given name; it can also be a U.S. place name.","zh":"Almyra 通常是女性名字；也可以是美国的地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feminine given name (first name), sometimes spelled Almira.","zh":"女性名字（名），有时也拼作 Almira。"},"examples":[{"en":"Almyra is my grandmother’s name.","zh":"Almyra 是我祖母的名字。"},{"en":"We invited Almyra to join our study group.","zh":"我们邀请 Almyra 加入我们的学习小组。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name in the United States (e.g., Almyra, Arkansas).","zh":"美国的地名（例如阿肯色州的 Almyra）。"},"examples":[{"en":"He drove through Almyra, Arkansas on his way to Little Rock.","zh":"他去小石城的路上开车经过了阿肯色州的 Almyra。"},{"en":"The storm passed near Almyra last night.","zh":"昨晚暴风雨从 Almyra 附近经过。"}]}],"synonyms":["Almira","Elmira"],"phonetic":"/ælˈmaɪrə/","extraExplanation":["“Almyra”多被视为“Almira”的变体拼法。Almira 常被解释为来自阿拉伯语词根（与“amir/amira”相关），可联想到“公主、贵族女子”等含义；也有人把它当作近代英语中受多语言影响而形成的名字拼写。","作为文学/文化联想：英语世界里更常见的相近名字是“Elmira/Almira”。如果你在小说或历史文本中见到“Almyra”，通常是人物名或地名，需要结合上下文判断。"]}
