{"word":"aln","summary":{"en":"“ALN” is usually an abbreviation, not a common English word; its meaning depends on context.","zh":"“ALN”通常是缩写而不是常见英文单词；具体含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(initialism) The letters “A-L-N” used as an abbreviation; the meaning depends on the context (e.g., a company name, a technical term, or an organization). It is not a common standalone English word.","zh":"（首字母缩写）“ALN”作为缩写使用，具体含义取决于语境（例如公司名、技术术语或组织名称）。它不是常见的独立英文单词。"},"examples":[{"en":"What does ALN stand for in this article?","zh":"这篇文章里的 ALN 代表什么？"},{"en":"I saw “ALN” in the report, but there wasn’t a definition.","zh":"我在报告里看到了“ALN”，但没有给出解释。"}]}],"phonetic":"/ˌeɪ ɛl ˈɛn/","extraExplanation":["“ALN”在不同领域可能指完全不同的东西（比如公司股票代码、医学/生物学术语、项目名称等）。如果你能告诉我它出现在哪句话里、属于哪个领域（新闻/科技/医学/学校/游戏等），我可以给出最准确的释义与用法。"]}
{"word":"Alna","summary":{"en":"Alna is usually a proper noun: a place name in Oslo, Norway (district/river) and sometimes a given name.","zh":"Alna 通常是专有名词：挪威奥斯陆的地名（地区/河流），也有时用作人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a proper name used as a place name (especially in Oslo, Norway) and also as a personal name","zh":"专有名：可作地名（尤其指挪威奥斯陆的 Alna 地区/Alna 河），也可作人名"},"examples":[{"en":"She lives in Alna, a district in Oslo.","zh":"她住在奥斯陆的 Alna 区。"},{"en":"The Alna River runs through parts of Oslo.","zh":"Alna 河流经奥斯陆的部分地区。"},{"en":"Alna is used as a given name in some families.","zh":"在一些家庭中，Alna 也被用作名字。"}]}],"phonetic":"/ˈɑlnə/","extraExplanation":["“Alna”在英语语境里通常属于专有名词（人名/地名），因此不像普通词汇那样有固定的“词义”。最常见的公共指代是挪威奥斯陆的 Alna 区（Alna borough）以及 Alna 河（Alna River）。","如果你是在读人名（例如护照、名单、小说角色），它一般就是音译/家族取名，不一定有明确词源含义。若你能提供上下文（句子、国家/语言背景），我可以更准确地解释它指的是什么。"]}
{"word":"alnage","summary":{"en":"Alnage is a historical term for the official measuring/inspection of cloth (and the fee for it), especially in medieval England.","zh":"Alnage 是历史用语，指（尤其中世纪英格兰）对布料的官方丈量与检验，以及相关费用/税费。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Historical) the official measuring and inspection of cloth, especially in medieval England; also the fee or duty paid for this service.","zh":"（历史用语）对布料进行官方丈量与检验（尤指中世纪英格兰）；也可指为此服务缴纳的费用/税费。"},"examples":[{"en":"In medieval towns, merchants sometimes paid for alnage before selling woolen cloth.","zh":"在中世纪城镇里，商人有时会在出售毛呢前为“alnage”（官方丈量检验）付费。"},{"en":"Records mention fines related to alnage when cloth was sold without inspection.","zh":"一些档案提到，如果布料未经检验就出售，会因违反 alnage 规定而被罚款。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) the unit or standard of measurement used for cloth in that system (based on the ‘ell,’ an old length measure).","zh":"（罕见）该制度中用于丈量布料的计量单位或标准（基于旧时长度单位 ell，约等于“厄尔/肘尺”一类的长度）。"},"examples":[{"en":"The contract specified cloth length according to the alnage standard.","zh":"合同按 alnage 的标准规定了布料长度。"}]}],"synonyms":["cloth inspection","cloth measurement","duty","fee"],"phonetic":"/ˈælneɪdʒ/","extraExplanation":["“alnage”来自中古法语/拉丁语系词根，与“ell（旧时量布长度单位）”有关。英格兰中世纪时期，政府会指派官员（alnager）在市场上丈量并加盖印记，以控制质量、打击短尺和征收相关费用。现代英语中几乎只在历史研究、档案或文学性描写里出现。"]}
{"word":"alnager","summary":{"en":"An alnager was a historical official who measured and inspected cloth for legal sale standards.","zh":"alnager 指历史上负责丈量与检验布匹、确保符合法规标准的官员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) An official in medieval and early modern England who measured and inspected cloth to make sure it met legal standards, often collecting a fee.","zh":"（历史用语）中世纪至近代早期英格兰负责丈量并检验布匹是否符合法定标准的官员，常同时征收相关费用。"},"examples":[{"en":"In medieval England, an alnager checked the length of cloth before it could be sold.","zh":"在中世纪英格兰，布匹在出售前常由 alnager 检查长度。"},{"en":"The merchant complained about the alnager’s fee on every bolt of fabric.","zh":"商人抱怨每匹布都要交给 alnager 一笔检验费。"}]}],"synonyms":["aulnager","cloth inspector","cloth measurer"],"phonetic":"/ˈɔlnˌeɪdʒər/","extraExplanation":["该词常见的拼写是 **aulnager**（alnager 为变体拼写），源自古法语 *aune*，意为“肘尺”（一种旧时量布的长度单位，类似 yard 之前的传统单位）。","这是非常少见的历史词，多出现在关于英国纺织业、行会制度、市场监管或税费制度的文献里。"]}
{"word":"alnagership","summary":{"en":"“alnagership” isn’t standard English; it’s likely a misspelling of “leadership” or “managership.”","zh":"“alnagership”不是标准英语词，可能是“leadership”或“managership”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “leadership” or (less commonly) “managership.”","zh":"不是标准英语单词。很可能是把“leadership（领导力/领导）”或（较少见）“managership（管理职责/管理层角色）”拼错了。"},"examples":[{"en":"Did you mean “leadership” (leading people) or “managership” (the role of managing)?","zh":"你想表达的是“leadership（带领他人）”还是“managership（担任管理职责）”？"}]}],"synonyms":["leadership","management","managership"],"phonetic":"ˈæl.nə.dʒɚ.ʃɪp","extraExplanation":["“alnagership”在常见词典里查不到，通常说明是拼写错误或非常罕见的自造词。你可以告诉我它出现的句子（上下文），我就能更准确地判断你要的词。","如果你想说“领导力/领导”，正确拼写是 leadership；如果你想强调“管理（作为一项角色或职责）”，有时会用 managership（但比 management/leadership 少见得多）。"]}
{"word":"Alnaschar","summary":{"en":"Alnaschar is a folktale character whose name is used in English for unrealistic daydreaming about future success, especially in the phrase “Alnaschar’s dream.”","zh":"Alnaschar 是民间故事人物名，英语里用来指对未来成功/发财的过度幻想，常见于短语 “Alnaschar’s dream（阿尔纳沙尔之梦）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A character name (often written Alnaschar) from a Middle Eastern folktale, used in English to refer to someone who makes unrealistic plans for future success or wealth.","zh":"一个中东民间故事中的人物名（常拼作 Alnaschar），在英语里常用来指“过度幻想未来成功/发财、计划不切实际的人”。"},"examples":[{"en":"He talks like Alnaschar—spending money he hasn’t earned yet.","zh":"他说话像 Alnaschar 一样——钱还没赚到就先想着怎么花。"},{"en":"Her business plan sounded like an Alnaschar-style dream with no real numbers.","zh":"她的商业计划听起来像“Alnaschar 式的美梦”，没有实际数据支撑。"}]},{"partOfSpeech":"phrase","definition":{"en":"In the set phrase “Alnaschar’s dream”: a fanciful plan based on imagined future gains rather than reality (similar to “counting your chickens before they hatch”).","zh":"在固定说法“Alnaschar’s dream（阿尔纳沙尔之梦）”中：指建立在想象的未来收益上的空想计划（类似“鸡还没孵出来就先数小鸡”）。"},"examples":[{"en":"Buying a new car now is just Alnaschar’s dream—you don’t even have a job offer yet.","zh":"现在就买新车只是“Alnaschar 之梦”——你连工作 offer 都还没有。"},{"en":"Don’t fall into Alnaschar’s dream; make a plan with steps you can actually do this week.","zh":"别陷入“Alnaschar 之梦”；做个这周就能真正执行的分步计划。"}]}],"synonyms":["pipe dream","castle in the air","counting your chickens before they hatch","wishful thinking"],"phonetic":"/ˈæl.nə.ʃɑr/","extraExplanation":["“Alnaschar”的用法主要来自一个广为流传的寓言：主人公一边走路一边幻想卖掉货物后如何层层获利、娶妻生子、发号施令，结果因沉浸在幻想里动作失手，把东西打翻，计划全落空。英语里因此用来提醒人别把未来的“可能”当成“已经到手”。","在现代英语中，这个名字本身不算常见；更常见的是用它来表达“空中楼阁/不切实际的发财梦”。更常用、也更容易被听懂的说法包括：a pipe dream（白日梦）、a castle in the air（空中楼阁）、count your chickens before they hatch（过早乐观）。"]}
{"word":"alnaschar","summary":{"en":"“Alnaschar” is most likely an Arabic-origin surname written in English in different spellings.","zh":"“Alnaschar”多半是阿拉伯语来源的姓氏，在英文中可能有多种拼写形式。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A surname or family name of Arabic origin (a transliteration into the Latin alphabet), seen in forms like Al-Nashar / Al Nashar / Alnashar.","zh":"一个阿拉伯语来源的姓氏/家族名（拉丁字母音译），常见拼写有 Al-Nashar、Al Nashar、Alnashar 等。"},"examples":[{"en":"Ms. Alnaschar submitted her application last week.","zh":"Alnaschar 女士上周提交了申请。"},{"en":"The email was signed “Ahmed Al-Nashar,” which is sometimes spelled “Alnaschar.”","zh":"邮件署名为“Ahmed Al-Nashar”，这个姓有时也写作“Alnaschar”。"}]}],"synonyms":["Al-Nashar","Al Nashar","Alnashar"],"phonetic":"ælˈnɑʃɑr","extraExplanation":["“Alnaschar”不像常见英语词汇，更可能是阿拉伯语姓名的音译/拼写变体。阿拉伯语姓氏中的“Al-”常表示“……的/……家族”，在英文里有时会连写（Alnaschar）、分写（Al Nashar）或加连字符（Al-Nashar），不同护照/文件可能出现不同拼法。","如果你本来想查的是一个英语单词，可能是拼写误差；你可以告诉我它出现的句子或你想表达的意思，我可以帮你确认最可能的正确拼写与词义。"]}
{"word":"Alnascharism","summary":{"en":"Alnascharism means making unrealistic plans or daydreaming about success before it actually happens.","zh":"Alnascharism 指对尚未发生的成功做不切实际的规划或白日梦式的空想。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the habit of making unrealistic plans or daydreaming about future success, especially by counting on gains that have not happened yet; “building castles in the air.”","zh":"指习惯性做不切实际的计划或空想未来的成功，尤其是在尚未得到收益时就开始“盘算”或“做白日梦”；类似“空中楼阁”。"},"examples":[{"en":"His business plan was pure alnascharism—he was spending imaginary profits before making a single sale.","zh":"他的商业计划纯属 alnascharism——一单没卖出去就开始花“想象中的利润”。"},{"en":"Try to avoid alnascharism: make a budget based on what you have, not what you hope to have.","zh":"尽量避免 alnascharism：做预算要以你实际拥有的为准，而不是以你希望拥有的为准。"}]}],"synonyms":["wishful thinking","daydreaming","fantasy planning","building castles in the air"],"phonetic":"/ælˈnæʃəˌrɪzəm/","extraExplanation":["这个词来自《一千零一夜》（Arabian Nights）中“Alnaschar（或 Alnaschar the Barber）”相关故事的文化典故：人物一边走路一边幻想未来发大财、步步高升，结果因为沉浸在幻想里而把手中的东西弄坏，梦想破灭。英语里用 alnascharism 来讽刺“未得先算、凭空规划”的空想。","使用场景多见于较正式或文学化表达，日常口语里更常说 daydreaming、wishful thinking、building castles in the air。"]}
{"word":"alnascharism","summary":{"en":"Alnascharism means unrealistic, over-optimistic dreaming or planning about future success without practical grounding.","zh":"Alnascharism 指不切实际、过度乐观的幻想或规划，缺乏现实依据。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"unrealistic daydreaming or over-optimistic planning about future success, often building “dreams on dreams” without considering practical risks.","zh":"不切实际的白日梦式幻想；过度乐观的未来规划（常指层层加码的美梦，却忽视现实风险）。"},"examples":[{"en":"His business plan was pure Alnascharism—he was spending profits he hadn’t earned yet.","zh":"他的商业计划简直是“阿尔纳沙尔式幻想”——还没赚到的钱就先花上了。"},{"en":"A little ambition helps, but Alnascharism can make you ignore basic details.","zh":"有点野心是好事，但“阿尔纳沙尔式幻想”会让你忽略最基本的细节。"}]}],"synonyms":["wishful thinking","daydreaming","pipe dream","castle-building","pie-in-the-sky thinking"],"phonetic":"/ˌælˈnæʃəˌrɪzəm/","extraExplanation":["“Alnascharism”源自《一千零一夜》（The Arabian Nights）中“阿尔纳沙尔（Alnaschar）”的故事：他一边走路一边幻想未来发大财、步步升级的美好生活，结果因为沉迷幻想而把手里的东西打碎，幻想破灭。英语里借此指“过度乐观、脱离现实的空想式计划”。","这是较少见的词，写作中更常用的近义表达包括：“castle-building（空想）”“pie-in-the-sky plans（不切实际的计划）”“wishful thinking（想当然的乐观）”。"]}
{"word":"alnath","summary":{"en":"Alnath is the traditional name of Beta Tauri, a bright star in Taurus.","zh":"Alnath 是金牛座β（Beta Tauri）这颗亮星的传统名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A bright star in the constellation Taurus; the star designated Beta Tauri, historically also known as Elnath.","zh":"金牛座中的一颗明亮恒星；即金牛座β（Beta Tauri），历史上也称作 Elnath（埃尔纳斯）。"},"examples":[{"en":"Alnath marks one of the horns of Taurus in many star charts.","zh":"在许多星图中，Alnath 标示出金牛座的一只角。"},{"en":"Astronomers list Alnath as Beta Tauri, a prominent star near the border of Taurus and Auriga.","zh":"天文学家将 Alnath 记为金牛座β，它位于金牛座与御夫座的交界附近，是一颗很显眼的恒星。"}]}],"synonyms":["Elnath","Beta Tauri"],"phonetic":"/ælˈnæθ/","extraExplanation":["“Alnath”是一个传统星名，常见于星图、天文科普与观星指南中；它更常用的现代拼写是“Elnath”。","名称来源与阿拉伯语有关，常被解释为与“角/顶撞（牛角）”之意相关，因此它在传统图像中常被说成是金牛座的“角”之一。"]}
{"word":"alnatrun","summary":{"en":"“alnatrun” is not a standard English word; it most likely refers to “Al Natrun/El Natrun,” a place in Egypt (Wadi El Natrun).","zh":"“alnatrun”不是标准英语单词；它很可能指埃及的 “Al Natrun/El Natrun”（纳特龙谷）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Usually written “Al Natrun” or “El Natrun”) A place name referring to Wadi El Natrun, a desert valley in northern Egypt historically known for deposits of natron (a natural salt) and for early Christian monasteries.","zh":"（通常写作 “Al Natrun / El Natrun”）地名，指埃及北部的纳特龙谷（Wadi El Natrun），历史上以天然碱盐“纳特龙（natron）”矿藏以及早期基督教修道院闻名。"},"examples":[{"en":"Several ancient monasteries are located in Wadi El Natrun (Al Natrun), Egypt.","zh":"埃及的纳特龙谷（Al Natrun）有好几座古老的修道院。"},{"en":"The region of Al Natrun was historically linked to natron used in mummification.","zh":"Al Natrun 地区在历史上与用于木乃伊防腐的纳特龙盐有关。"}]}],"synonyms":["Wadi El Natrun","Wadi al-Natrun","El Natrun","Al Natrun"],"phonetic":"/æl ˈneɪtrʊn/","extraExplanation":["“alnatrun”很可能是把阿拉伯语定冠词“al-（相当于英语 the）”和“natrun（纳特龙/天然碱）”连写在一起的拼法。常见的英文写法包括：Wadi El Natrun、Wadi al-Natrun、El Natrun、Al Natrun。","如果你本来想查的是英语单词“natron”（一种天然碳酸钠等盐类混合物），也可以告诉我，我可以按“natron”给出更标准的词条解释与用法。"]}
{"word":"alnein","summary":{"en":"“alnein” isn’t a standard English word; it is likely a misspelling of “alien” (foreign; a foreign national; or an extraterrestrial).","zh":"“alnein”不是标准英语单词；很可能是“alien”的拼写错误（外来的；外籍人士；或外星人）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended) “alien” (adj.): from another country or culture; foreign.","zh":"（可能想写）alien（形容词）：来自其他国家或文化的；外来的。"},"examples":[{"en":"The law applies to both citizens and alien residents.","zh":"这部法律适用于公民和外籍居民。"},{"en":"I felt alien in a new city where I didn’t know anyone.","zh":"在一个谁也不认识的新城市里，我感到很陌生、格格不入。"}]},{"partOfSpeech":"n.","definition":{"en":"(Likely intended) “alien” (n.): a person from another country; a foreigner.","zh":"（可能想写）alien（名词）：外国人；外侨。"},"examples":[{"en":"The form asks whether you are a citizen or an alien.","zh":"表格会询问你是公民还是外籍人士。"},{"en":"She married an alien and moved abroad.","zh":"她嫁给了一位外国人并搬到了国外。"}]},{"partOfSpeech":"n.","definition":{"en":"(Likely intended) “alien” (n.): a creature from outer space (common in science fiction).","zh":"（可能想写）alien（名词）：外星人（科幻作品中常见）。"},"examples":[{"en":"The movie is about aliens visiting Earth.","zh":"这部电影讲的是外星人造访地球。"},{"en":"In many stories, aliens arrive in a spaceship.","zh":"在很多故事里，外星人乘飞船到来。"}]}],"synonyms":["foreign","noncitizen","extraterrestrial"],"phonetic":"/ˈeɪliən/","extraExplanation":["“alnein”不是常见英文单词，最可能是拼写错误：你可能想写的是“alien”。它常用于法律/移民语境（外籍人士），也常用于科幻语境（外星人）。","如果你想表达“独自/单独”，你可能想到的是德语“allein”（不是英语）。英语更常用：alone（独自的/独自地）、by myself（我自己）。"]}
{"word":"Alnico","summary":{"en":"Alnico is an aluminum–nickel–cobalt alloy commonly used to make permanent magnets.","zh":"Alnico 是一种由铝、镍、钴组成的合金，常用于制造永久磁铁。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a metal alloy (mainly aluminum, nickel, and cobalt) used to make strong permanent magnets","zh":"一种金属合金（主要由铝、镍、钴组成），常用于制造强力的永久磁铁"},"examples":[{"en":"Many electric guitar pickups use Alnico magnets for a warm, classic tone.","zh":"许多电吉他拾音器使用 Alnico 磁铁，以获得温暖、经典的音色。"},{"en":"The sensor contains a small Alnico magnet to maintain a stable magnetic field.","zh":"该传感器内含一块小型 Alnico 磁铁，用于保持稳定的磁场。"}]},{"partOfSpeech":"adj.","definition":{"en":"made of, or relating to, the Alnico alloy","zh":"由 Alnico 合金制成的；与 Alnico 合金有关的"},"examples":[{"en":"He replaced the speaker with an Alnico model.","zh":"他把扬声器换成了带 Alnico 磁体的型号。"},{"en":"Alnico magnets are known for being stable at relatively high temperatures.","zh":"Alnico 磁铁以在相对较高温度下仍较稳定而闻名。"}]}],"synonyms":["aluminum–nickel–cobalt alloy","permanent-magnet alloy"],"phonetic":"/ælˈnɪkoʊ/","extraExplanation":["“Alnico”这个词是由主要成分的化学元素名缩合而来：Al (aluminum 铝) + Ni (nickel 镍) + Co (cobalt 钴)。在音频器材圈（如吉他拾音器、老式扬声器）里，人们常用“Alnico”来指代采用这种磁体材料的器件风格与声音取向。"]}
{"word":"alnicoes","summary":{"en":"Alnicoes are alnico magnets/materials—an aluminum–nickel–cobalt alloy used for strong, heat-stable magnets.","zh":"Alnicoes 指 alnico 磁体/材料的复数：由铝-镍-钴合金制成，磁力强且耐高温。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of alnico: magnets (or magnetic materials) made from an alloy of aluminum, nickel, and cobalt, known for being strong and stable at high temperatures.","zh":"alnico 的复数：指由铝、镍、钴等合金制成的磁体（或磁性材料），特点是磁力强、耐高温、性能稳定。"},"examples":[{"en":"Vintage electric guitars often use alnicoes in their pickups for a warm, classic tone.","zh":"一些复古电吉他的拾音器里常用 alnicoes，以获得温暖、经典的音色。"},{"en":"The engineer compared ceramic magnets with alnicoes for heat resistance.","zh":"工程师把陶瓷磁体和 alnicoes 的耐热性作了比较。"}]}],"synonyms":["alnico magnets","alnicos"],"phonetic":"/ælˈniːkoʊz/","extraExplanation":["“Alnico”来自元素名称的缩写：Al（aluminum 铝）+ Ni（nickel 镍）+ Co（cobalt 钴）。有时也包含少量铁、铜、钛等，以调整磁性与硬度。","在英文中复数可写作“alnicos”或“alnicoes”；“alnicoes”属于较少见但可接受的拼写形式。"]}
{"word":"Alnilam","summary":{"en":"Alnilam is the middle star of Orion’s Belt, a bright blue supergiant in the constellation Orion.","zh":"Alnilam（参宿二）是猎户座腰带中间那颗星，一颗明亮的蓝色超巨星。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A bright blue supergiant star in the constellation Orion, the middle star of Orion’s Belt (catalog name: Epsilon Orionis).","zh":"参宿二（Alnilam）：猎户座中的一颗明亮蓝色超巨星，是“猎户座腰带”（Orion’s Belt）三颗星中间的一颗（星表名：Epsilon Orionis）。"},"examples":[{"en":"On a clear winter night, you can spot Alnilam as the center star in Orion’s Belt.","zh":"在晴朗的冬夜，你可以把参宿二认作猎户座腰带中间的那颗星。"},{"en":"Alnitak, Alnilam, and Mintaka form the straight line known as Orion’s Belt.","zh":"参宿一、参宿二和参宿三组成了一条直线，被称为“猎户座腰带”。"}]}],"synonyms":["Epsilon Orionis"],"phonetic":"ˈæl.nɪ.læm","extraExplanation":["“Alnilam”来自阿拉伯语（常见解释与“腰带/带子”相关），因为它位于猎户座“腰带”三颗星的中间位置。","在英文里它通常作为专有名词使用，首字母大写：Alnilam。","天文科普文章中常把它与另外两颗腰带星并列：Alnitak（参宿一）与 Mintaka（参宿三）。"]}
{"word":"alnilam","summary":{"en":"Alnilam is the middle star in Orion’s Belt, a bright blue supergiant (Epsilon Orionis).","zh":"Alnilam（参宿二）是猎户座腰带中间的那颗明亮蓝色超巨星（猎户座ε）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A bright blue supergiant star in the constellation Orion; the middle star in Orion’s Belt (also known as Epsilon Orionis).","zh":"参宿二（Alnilam）：猎户座中的一颗明亮蓝色超巨星，也是“猎户座腰带”（三星）中间的那一颗（天文学名为“猎户座ε”）。"},"examples":[{"en":"On winter nights, Alnilam is easy to spot because it sits in the center of Orion’s Belt.","zh":"在冬夜里，Alnilam 很好找，因为它就在猎户座腰带的正中间。"},{"en":"The three belt stars are Alnitak, Alnilam, and Mintaka.","zh":"腰带三星分别是 Alnitak、Alnilam 和 Mintaka。"}]}],"synonyms":["Epsilon Orionis","ε Orionis"],"phonetic":"/ˈæl.nɪ.læm/","extraExplanation":["“Alnilam”这个名字来自阿拉伯语，常被解释为与“腰带/串珠（belt/string）”相关的意思，因为它位于猎户座腰带中央。","在大众文化和文学中，猎户座常被用作冬季夜空的象征；提到腰带三星时，Alnilam 通常作为辨认猎户座的关键参照点之一。"]}
{"word":"alniresinol","summary":{"en":"Alniresinol is a plant lignan (natural chemical), mainly mentioned in scientific contexts.","zh":"Alniresinol 是一种植物木脂素类天然化合物，主要用于科学研究语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural plant chemical (a lignan) found in some species of alder and other plants, studied for possible antioxidant and health-related effects","zh":"一种天然植物化合物（木脂素类），存在于某些桤木（alder）等植物中，常被研究其可能的抗氧化及健康相关作用"},"examples":[{"en":"Researchers identified alniresinol in extracts from alder bark.","zh":"研究人员在桤木树皮提取物中鉴定出了 alniresinol。"},{"en":"Alniresinol is one of several lignans measured in plant-based foods and herbs.","zh":"Alniresinol 是在植物性食物和草本植物中被测量的多种木脂素之一。"}]}],"synonyms":["lignan"],"phonetic":"/ˌælniˈrɛsɪˌnɔl/","extraExplanation":["词源提示：alni- 常与拉丁语 Alnus（桤木属，alder）有关，-resinol 常见于化学命名中，表示与“树脂/酚类结构”相关的化合物名称结尾。","使用场景：这个词主要出现在学术论文、营养学/天然产物化学、药理学等语境中，日常英语很少使用。"]}
{"word":"Alnitak","summary":{"en":"Alnitak is a bright star in Orion’s Belt, also called Zeta Orionis.","zh":"Alnitak（参宿一）是猎户座腰带上的一颗亮星，也称猎户座ζ星。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A bright star (Zeta Orionis) in Orion’s Belt; the easternmost of the three belt stars in the constellation Orion.","zh":"参宿一（Alnitak，猎户座ζ星）：位于“猎户座腰带”上的一颗明亮恒星，三颗腰带星中最靠东的一颗。"},"examples":[{"en":"On a clear winter night, you can spot Alnitak as one of the three stars in Orion’s Belt.","zh":"在晴朗的冬夜，你可以在“猎户座腰带”上看到参宿一，它是那三颗星之一。"},{"en":"Alnitak is also known by its scientific name, Zeta Orionis.","zh":"参宿一也有科学名称：猎户座ζ星（Zeta Orionis）。"}]}],"synonyms":["Zeta Orionis","ζ Orionis"],"phonetic":"/ˈæl.nɪ.tæk/","extraExplanation":["“Alnitak”这个名字来自阿拉伯语，常被解释为与“腰带/束带”有关，反映了它在“猎户座腰带”中的位置。","在天文学中，Alnitak（参宿一）不仅是一颗亮星，还是一个多星系统；在观测资料里你可能会看到它被标注为 Zeta Orionis 或 ζ Orionis。"]}
{"word":"alnitak","summary":{"en":"Alnitak is the name of a bright star in Orion—one of the three stars in Orion’s Belt (Zeta Orionis).","zh":"Alnitak 是猎户座里的一颗亮星，是“猎户座腰带”三星之一（猎户座ζ星）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A bright star in the constellation Orion, the easternmost star of Orion’s Belt (also called Zeta Orionis).","zh":"猎户座中的一颗明亮恒星，位于“猎户座腰带”最东端（也称“猎户座ζ星 / Zeta Orionis”）。"},"examples":[{"en":"On a clear winter night, you can spot Alnitak as the leftmost star of Orion’s Belt in the Northern Hemisphere sky.","zh":"在冬季晴朗的夜晚，你可以在北半球的天空中看到猎户座腰带左边那颗星——Alnitak。"},{"en":"The three belt stars are often listed as Alnitak, Alnilam, and Mintaka.","zh":"猎户座腰带的三颗星常被列为：Alnitak、Alnilam 和 Mintaka。"}]}],"synonyms":["Zeta Orionis","ζ Orionis"],"phonetic":"/ˈæl.nɪ.tæk/","extraExplanation":["Alnitak 是一个源自阿拉伯语的星名，常被解释为与“腰带/束带”有关的词源（与猎户座腰带的位置相呼应）。","在天文科普或观星手册里，Alnitak 往往和 Alnilam、Mintaka 一起出现，用来帮助初学者快速定位猎户座。"]}
{"word":"Alnitham","summary":{"en":"Alnitham is an older/alternate spelling of Alnilam, a bright star in Orion’s Belt.","zh":"Alnitham 是 Alnilam 的旧式/异体拼写，指猎户座腰带中的一颗明亮恒星。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A variant spelling of Alnilam, the bright blue supergiant star in Orion’s Belt (Epsilon Orionis).","zh":"Alnilam（猎户座腰带中的一颗明亮蓝色超巨星，天文学编号为猎户座ε星）的另一种拼写形式。"},"examples":[{"en":"On some older star charts, Alnitham appears where modern charts label the star as Alnilam.","zh":"在一些较老的星图上，你会看到 Alnitham，而现代星图通常标作 Alnilam。"},{"en":"Alnitham is one of the three famous stars that form Orion’s Belt.","zh":"Alnitham 是构成“猎户座腰带”的三颗著名恒星之一。"}]}],"synonyms":["Alnilam","Epsilon Orionis","Orion’s Belt (middle star)"],"phonetic":"/ˈæl.nɪ.θəm/","extraExplanation":["“Alnitham”多见于历史/旧式英文转写，现代天文学与大众科普更常用拼写“Alnilam”。","Alnilam（猎户座ε星）位于猎户座腰带中间位置，另外两颗通常是 Alnitak（参宿一）与 Mintaka（参宿三）。","这些名称很多源自阿拉伯语的传统星名：在中世纪通过阿拉伯天文学文献传入欧洲，因此出现多种拼写差异。"]}
{"word":"alnitham","summary":{"en":"“alnitham” is a nonstandard transliteration of Arabic meaning “the system/order,” used mainly in Arabic-related contexts.","zh":"“alnitham”多为阿拉伯语音译（对应 al-niẓām），意为“制度/体系/秩序”，常见于阿语相关语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard English spelling/transliteration of the Arabic word \"al-niẓām\" (النِّظام), meaning \"the system\" or \"the order/organization\"; used mainly in Arabic contexts (politics, government, institutions).","zh":"一种非标准英语拼写/音译形式，通常对应阿拉伯语“al-niẓām”（النِّظام），意思是“制度/体系/系统；秩序/组织方式”；多用于阿拉伯语语境（政治、政府、机构等）。"},"examples":[{"en":"In some translations, \"alnitham\" refers to the political system of a country.","zh":"在一些译文里，“alnitham”指一个国家的政治制度。"},{"en":"The article discusses reforms to the existing alnitham.","zh":"这篇文章讨论对现行制度（alnitham）的改革。"}]}],"synonyms":["system","order","regime","structure"],"phonetic":"/ˌæl nɪˈðɑːm/","extraExplanation":["“alnitham”在英语里并不是常见的标准拼写；更常见的拉丁转写是 al-nizam / al-niẓām。不同拼写来自不同的音译体系：有的人用 th 来代替阿拉伯语字母 ظ（ẓ）的发音。","如果你是在姓名、地名、机构名中看到它，它可能是专有名词的一部分；具体含义要结合上下文。你也可以把原句发我，我可以帮你判断它在那句话里的意思。"]}
{"word":"alniviridol","summary":{"en":"“Alniviridol” is not a standard English vocabulary word; it most likely refers to a specialized drug/chemical name and needs context to define precisely.","zh":"“alniviridol”不是常见英语词汇；更可能是某种药物/化学品的专用名称，需要上下文才能准确释义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare, specialized term that appears to be a drug or chemical name (likely an investigational medicine); it is not a common word in general English and may be a misspelling or a proprietary/research code name.","zh":"一个很少见的专业术语，看起来像是药物或化学物质名称（可能为研究/试验阶段用药）；在一般英语中并不常见，也可能是拼写错误或某种商品名/研发代号。"},"examples":[{"en":"I couldn’t find reliable general-dictionary entries for “alniviridol”; it may only appear in scientific or patent contexts.","zh":"我在常规词典里找不到“alniviridol”的可靠释义；它可能只出现在科研论文或专利语境中。"},{"en":"If “alniviridol” is a medication name, check the spelling on the label or in the research paper.","zh":"如果“alniviridol”是药名，请核对药品标签或论文中的拼写。"}]}],"phonetic":"/ælˌnɪˈvɪrɪˌdɔl/","extraExplanation":["这种以“-vir-”为核心片段的词形常见于与病毒（virus）相关的药物命名或代号中，但仅凭词形无法确定其确切含义或用途。","如果你能提供出现该词的句子、论文标题、或相关领域（如抗病毒/肿瘤/化学品），我可以更准确地判断它是专有名词、药物通用名、还是拼写变体。"]}
{"word":"alnoite","summary":{"en":"“All night” means “for the whole night,” and “all-night” describes something that lasts the entire night.","zh":"“all night”表示“整夜”；“all-night”作形容词表示“持续整晚的”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"for the whole night; from evening until morning without stopping","zh":"整夜；从晚上一直到早上（不停地）"},"examples":[{"en":"We talked all night and forgot to sleep.","zh":"我们聊了一整夜，忘了睡觉。"},{"en":"The baby cried all night.","zh":"宝宝整夜都在哭。"},{"en":"It rained all night.","zh":"雨下了一整夜。"}]},{"partOfSpeech":"adj.","definition":{"en":"lasting the entire night (often used before a noun)","zh":"持续整晚的（常用于名词前作定语）"},"examples":[{"en":"They hosted an all-night study session before the exam.","zh":"考试前他们组织了一场通宵学习。"},{"en":"The café offers an all-night breakfast menu.","zh":"那家咖啡馆提供通宵早餐菜单。"}]}],"synonyms":["through the night","the whole night","overnight (sometimes)"],"phonetic":"/ɔl naɪt/","extraExplanation":["“alnoite”本身不是常见英文单词，看起来像把葡语“à noite”（意思是“在晚上/夜里”）或英文“all night”（整夜）连在一起写了。","英文里通常写作两个词“all night”；如果作形容词放在名词前，常用连字符：all-night (e.g., an all-night flight 通宵航班)。"]}
{"word":"alnuin","summary":{"en":"“alnuin” is usually a misspelling of “Alduin,” the World-Eater dragon from Skyrim.","zh":"“alnuin”通常是“Alduin”的拼写错误，Alduin 是《上古卷轴5：天际》中的“吞世者”巨龙。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A misspelling of Alduin: a powerful dragon character in the video game The Elder Scrolls V: Skyrim, known as “the World-Eater.”","zh":"Alduin 的常见拼写错误：出自电子游戏《上古卷轴5：天际》（Skyrim）的一条强大巨龙角色，被称为“吞世者/世界吞噬者”。"},"examples":[{"en":"I think you mean Alduin, not alnuin.","zh":"我想你指的是 Alduin，不是 alnuin。"},{"en":"Alduin is the main dragon antagonist in Skyrim.","zh":"Alduin 是《天际》里的主要巨龙反派。"}]}],"synonyms":["Alduin","the World-Eater","First Dragon"],"phonetic":"/ælˈduːɪn/","extraExplanation":["“Alduin”在《上古卷轴》世界观中常被称为“World-Eater（吞世者）”，与“世界末日/轮回终结”的意象相关。","这个名字的风格受到北欧神话与古英语式的史诗叙事氛围影响：游戏里许多角色与设定都借鉴了北欧文化元素（如龙、预言、末日主题）。","如果你是在聊天或搜索攻略时看到“alnuin”，通常是打字错误；正确拼法是“Alduin”。"]}
{"word":"Alnus","summary":{"en":"Alnus is the scientific genus name for alders—trees/shrubs often growing in wet places.","zh":"Alnus 是“赤杨/桤木”的属名（学名），多生长在湿地或水边。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of trees and shrubs called alders, often found near rivers and wet ground (family Betulaceae).","zh":"赤杨属（桤木属）：一类被称为“赤杨/桤木”的乔木或灌木，常见于河边与潮湿地带（桦木科）。"},"examples":[{"en":"Alnus trees are common along streams because they tolerate wet soil.","zh":"赤杨属的树常见于溪流旁，因为它们能耐受潮湿土壤。"},{"en":"In ecology class, we learned that some Alnus species improve soil by working with nitrogen-fixing bacteria.","zh":"在生态学课上我们学到，一些赤杨属植物能与固氮细菌共生，从而改善土壤。"}]}],"synonyms":["alder"],"phonetic":"ˈæl.nəs","extraExplanation":["“Alnus”是拉丁学名，英语里常作为植物分类学用语出现，首字母大写表示“属名”。日常英语更常用普通名“alder”。","赤杨（alder）在生态恢复中很有名：它的根瘤可与放线菌共生固氮，有助于贫瘠土壤恢复。"]}
{"word":"alnus","summary":{"en":"Alnus is the scientific genus name for alder trees and shrubs.","zh":"Alnus 是“桤木/赤杨”的植物学属名（学名），指桤木属的树木与灌木。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of trees and shrubs called alders, often found near rivers and wet ground.","zh":"桤木属（榛木科的一属树木或灌木，统称“桤木/赤杨”，常生长在河边或潮湿地带）。"},"examples":[{"en":"In this wetland, Alnus grows along the stream banks.","zh":"在这片湿地里，桤木属植物生长在溪流两岸。"},{"en":"The guide pointed out an Alnus tree and explained how it supports wildlife.","zh":"导游指着一棵桤木属的树，解释它如何为野生动物提供栖息与食物。"}]}],"synonyms":["alder","alders","alder genus"],"phonetic":"ˈæl.nəs","extraExplanation":["“Alnus”是拉丁化的植物学属名，英语里常用作学名（科学名称），日常更常说“alder”（桤木/赤杨）。","桤木常与湿地生态相关；有些桤木能与根瘤菌共生固氮，因此在改良贫瘠土壤、恢复生态中很重要。"]}
