{"word":"alqueire","summary":{"en":"A regional, historical Portuguese/Brazilian unit for measuring grain (volume) and sometimes land area, with values that vary by place and period.","zh":"一种葡萄牙/巴西的地区性历史单位，用于计量谷物（体积）并有时用于土地面积，数值随地区与年代而变。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Portuguese/Brazilian unit of measure (especially in Brazil), used historically for grain (a volume measure) and also for land area; its exact size varies by region and time.","zh":"一种传统的葡萄牙/巴西计量单位（尤其在巴西常见），历史上用来量谷物（体积单位），也可用来表示土地面积；具体大小因地区与时期而不同。"},"examples":[{"en":"The farm record lists the harvest in alqueires, not in kilograms.","zh":"农场记录用 alqueires（阿尔凯雷）来记收成，而不是用千克。"},{"en":"In some parts of Brazil, an alqueire can refer to a measure of land area, so you must check the local standard.","zh":"在巴西的一些地方，alqueire 也可能指土地面积单位，所以必须查看当地标准。"}]}],"synonyms":["(approx.) bushel","regional unit of measure"],"phonetic":"/alˈkaɪɚ/","extraExplanation":["“alqueire”源自葡萄牙语，在英语中多见于讨论巴西/葡萄牙的历史、农业、土地契约或旧式统计资料时。因为各地换算不统一，阅读文献或合同最好同时寻找：地区（州/市）、年代，以及作者是否给出换算（例如折算成升、公斤或公顷）。","学习时可把它理解为“类似 bushel（蒲式耳）那样的传统谷物单位”，但不要直接等同；真正数值需要查具体地区的标准。"]}
{"word":"alquier","summary":{"en":"“alquier” isn’t an English word; it likely means Spanish “alquiler” = rent/rental.","zh":"“alquier”不是英语单词；多半是西语“alquiler”，意为“租金/租赁”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of the Spanish word “alquiler,” meaning “rent” or “rental (fee/contract).”","zh":"不是标准英语单词。很可能是西班牙语“alquiler”的拼写错误，意思是“租金/租赁（费用或合同）”。"},"examples":[{"en":"The sign says “Se alquila,” which means “For rent.”","zh":"牌子上写着“Se alquila”，意思是“出租”。"},{"en":"In Spain, “alquiler” usually refers to the rent you pay each month.","zh":"在西班牙，“alquiler”通常指你每个月支付的房租。"}]}],"synonyms":["rent","rental","lease"],"phonetic":"/ˌælkiˈlɛr/","extraExplanation":["你输入的“alquier”常见于把西班牙语“alquiler（房租/租赁）”少写了一个字母的情况。","在西语国家找房时常见短语：\n- “Se alquila”= 出租（For rent）\n- “alquiler mensual”= 月租\n- “contrato de alquiler”= 租赁合同","如果你想查的是英语“rent / rental”，也可以告诉我你要表达的句子，我帮你选更自然的英文说法。"]}
{"word":"alquifou","summary":{"en":"“Alquifou” is not recognized as a standard English word; it likely needs context or a corrected spelling.","zh":"“alquifou”不是标准英语词汇；需要上下文或确认正确拼写才能判断含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a proper name, or a word from another language.","zh":"不是标准英语单词。可能是拼写错误、人名/地名，或来自其他语言的词。"},"examples":[{"en":"I can’t find “alquifou” in English dictionaries—could you share the sentence where you saw it?","zh":"我在英语词典里查不到“alquifou”，你能把它出现的句子发我吗？"},{"en":"If you meant a different spelling, I can help once you confirm the correct form.","zh":"如果你想表达的是另一个拼法，确认正确拼写后我就能帮你解释。"}]}],"phonetic":"/ˌælkiˈfuː/","extraExplanation":["目前“alquifou”在常见英语词典与语料中没有对应词条。很可能是：\n1）拼写误差（多打/少打了字母）；\n2）专有名词（人名、品牌名、地名、用户名）；\n3）外来词（例如法语/阿拉伯语/西班牙语等的转写）。\n把它的来源（哪本书/哪段歌词/哪条消息）或上下文句子贴出来，我可以更准确判断你想找的词。"]}

