{"word":"ALS","summary":{"en":"ALS most commonly means amyotrophic lateral sclerosis (a progressive nerve disease). In emergency medicine it can also mean Advanced Life Support.","zh":"ALS最常指肌萎缩侧索硬化症（一种进行性的神经系统疾病）；在急救医学中也可指高级生命支持。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Amyotrophic lateral sclerosis: a serious disease of the nerves that control muscles, causing progressive muscle weakness and loss of movement; it can eventually affect breathing.","zh":"肌萎缩侧索硬化症：一种严重的运动神经元疾病，会逐渐导致肌肉无力、行动能力丧失，后期可能影响呼吸。"},"examples":[{"en":"His grandmother was diagnosed with ALS last year.","zh":"他奶奶去年被诊断为ALS（肌萎缩侧索硬化症）。"},{"en":"Researchers are working to find better treatments for ALS.","zh":"研究人员正在努力寻找更有效的ALS治疗方法。"},{"en":"Many people with ALS use assistive devices to communicate.","zh":"许多ALS患者会使用辅助设备进行沟通。"}]},{"partOfSpeech":"n.","definition":{"en":"Advanced Life Support: emergency medical care that uses specialized equipment and medicines (often provided by paramedics).","zh":"高级生命支持：指使用专业设备与药物的紧急医疗救治（常由急救医护/护理人员实施）。"},"examples":[{"en":"The patient needed ALS during transport to the hospital.","zh":"病人在转运去医院途中需要进行ALS（高级生命支持）。"},{"en":"This ambulance is equipped for ALS calls.","zh":"这辆救护车配备了处理ALS（高级生命支持）出车的设备。"}]}],"synonyms":["Lou Gehrig's disease (for the illness)","amyotrophic lateral sclerosis"],"phonetic":"/ˌeɪ.ɛlˈɛs/","extraExplanation":["“ALS”在日常语境里最常指“肌萎缩侧索硬化症”。在美国也常被称为“Lou Gehrig’s disease（卢·贾里格病）”，来源于著名棒球运动员Lou Gehrig罹患此病。","2014年的“Ice Bucket Challenge（冰桶挑战）”让ALS在全球范围内受到更多关注并促进了相关募款与科普。","在医疗急救领域，“ALS”也常指“Advanced Life Support（高级生命支持）”。遇到缩写不明确时，可以根据上下文（医学诊断 vs. 急救分级/救护车配置）来判断。"]}
{"word":"Als","summary":{"en":"“Als” is a common German word meaning “than/as” for comparisons and “when” for a specific past time.","zh":"“Als”是常见德语词，可表示比较的“比/像……一样”，也可表示过去某一具体时间的“当……时”。"},"definitions":[{"partOfSpeech":"conj.","definition":{"en":"(German) “than; as” — used to compare things (like English “than/as”).","zh":"（德语）“比；像……一样”——用于比较（相当于英语的 than/as）。"},"examples":[{"en":"Er ist größer als ich. (He is taller than me.)","zh":"Er ist größer als ich.（他比我高。）"},{"en":"Sie arbeitet als Lehrerin. (She works as a teacher.)","zh":"Sie arbeitet als Lehrerin.（她当老师工作。）"}]},{"partOfSpeech":"conj.","definition":{"en":"(German) “when” — used to talk about a specific time in the past (often with past tense).","zh":"（德语）“当……的时候”——常用于过去某个具体时间点（常配合过去时）。"},"examples":[{"en":"Als ich klein war, wohnte ich in Berlin. (When I was little, I lived in Berlin.)","zh":"Als ich klein war, wohnte ich in Berlin.（我小时候住在柏林。）"},{"en":"Als er ankam, war es schon spät. (When he arrived, it was already late.)","zh":"Als er ankam, war es schon spät.（他到的时候已经很晚了。）"}]}],"synonyms":["(German) wie (as…as, for comparisons)","(German) wenn (when/if, often for repeated or non-past situations)"],"phonetic":"/ɑlz/","extraExplanation":["“als”是非常高频的德语词：最常见用法是比较（= than/as）以及表示过去某一时刻的“当……时”（= when）。","与“wenn”的区别：一般来说，“als”多用于过去一次发生的时间点；“wenn”更常用于现在/将来或重复发生的“当……时”（= if/whenever）。"]}
{"word":"als","summary":{"en":"ALS most commonly means amyotrophic lateral sclerosis, a progressive disease that weakens muscles.","zh":"ALS最常指肌萎缩侧索硬化症，一种会逐渐导致肌肉无力的疾病。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"amyotrophic lateral sclerosis: a serious disease of the nervous system that gradually weakens the muscles, affecting movement, speech, swallowing, and sometimes breathing.","zh":"肌萎缩侧索硬化症：一种严重的神经系统疾病，会逐渐导致肌肉无力，影响行动、说话、吞咽，有时也会影响呼吸。"},"examples":[{"en":"My uncle was diagnosed with ALS last year.","zh":"我叔叔去年被诊断出患有ALS。"},{"en":"Researchers are working to find better treatments for ALS.","zh":"研究人员正在努力寻找更好的ALS治疗方法。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) an abbreviation used in some fields for other terms (for example, company names or technical systems); the exact meaning depends on the context.","zh":"（较少见）在某些领域中用作其他术语的缩写（例如公司名或技术系统）；具体含义取决于语境。"},"examples":[{"en":"In this document, ALS refers to the ‘Automated Labeling System.’","zh":"在这份文件中，ALS指“自动贴标系统”。"}]}],"synonyms":["amyotrophic lateral sclerosis","Lou Gehrig’s disease"],"phonetic":"ˌeɪ.ɛlˈɛs","extraExplanation":["在日常英语里，ALS最常指一种神经退行性疾病。美国也常把它称为“Lou Gehrig’s disease（卢·贾里格病）”，以纪念患病的著名棒球运动员。","“ALS”是一个字母缩写，读作三个字母（A-L-S），写作全大写；在专业资料中也可能代表别的词，所以最好根据上下文确认。"]}
{"word":"ALS Ice Bucket Challenge","summary":{"en":"A viral ice-water video challenge used to raise funds and awareness for ALS.","zh":"用冰水浇头拍视频、为ALS（渐冻症）募款与宣传的网络挑战活动。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A viral social-media fundraising campaign (popular in 2014) where people poured a bucket of ice water over themselves, posted the video, and donated to support research and awareness for ALS (amyotrophic lateral sclerosis).","zh":"一种在社交媒体上爆红的募款与公益宣传活动（2014年最流行）：参与者把一桶冰水倒在自己身上、上传视频，并为ALS（肌萎缩侧索硬化症，渐冻症）相关研究与倡议捐款。"},"examples":[{"en":"In 2014, the ALS Ice Bucket Challenge spread quickly on Facebook and raised millions of dollars.","zh":"2014年，“ALS冰桶挑战”在Facebook上迅速传播，筹到数百万美元。"},{"en":"She did the ALS Ice Bucket Challenge to support her friend’s family and donated afterward.","zh":"她参加ALS冰桶挑战来支持朋友的家人，并在之后捐款。"}]}],"synonyms":["Ice Bucket Challenge","ALS Challenge"],"phonetic":"/ˌeɪ ɛl ˈɛs aɪs ˈbʌkɪt ˈtʃælɪndʒ/","extraExplanation":["ALS在中文里常被称为“渐冻症”。该挑战之所以有效，是因为“可模仿、可拍视频、可点名接力”，非常适合社交媒体传播，从而带来大量捐款与关注。","在英语语境里，它常被当作专有名词使用；写作时常把每个词首字母大写（ALS Ice Bucket Challenge）。"],"etymology":"“ALS”是疾病名称“amyotrophic lateral sclerosis”的缩写；“Ice Bucket Challenge”指“用冰水浇头的挑战”。该活动在2014年由参与者互相点名（challenge）接力而病毒式传播，后来常合称为“ALS Ice Bucket Challenge”。","mnemonic":["把它拆开记：ALS（渐冻症）+ Ice bucket（冰桶）+ Challenge（挑战）。想到“冰水浇头=挑战”，目的就是为ALS募款与宣传。","“Bucket”可联想中文“桶”；“ice”=冰：冰+桶=冰桶，一下就抓住核心画面。"]}
{"word":"Alsace","summary":{"en":"Alsace is a region in eastern France near Germany, famous for its blended culture and wines.","zh":"Alsace（阿尔萨斯）是法国东部靠近德国的地区，以法德文化交融和葡萄酒闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historical region in eastern France on the border with Germany, known for its mix of French and German culture and for its wine-producing towns (capital: Strasbourg).","zh":"阿尔萨斯（法国东部靠德国边境的历史地区），以法德文化交融和葡萄酒产区闻名（首府：斯特拉斯堡）。"},"examples":[{"en":"Strasbourg is the largest city in Alsace.","zh":"斯特拉斯堡是阿尔萨斯最大的城市。"},{"en":"We traveled through Alsace to visit small villages and vineyards.","zh":"我们穿越阿尔萨斯，去参观小村庄和葡萄园。"}]},{"partOfSpeech":"n.","definition":{"en":"(by extension) wine from Alsace, often made from grapes like Riesling or Gewürztraminer.","zh":"（引申）阿尔萨斯葡萄酒，常见葡萄品种有雷司令（Riesling）或琼瑶浆/格乌兹塔明那（Gewürztraminer）。"},"examples":[{"en":"I ordered a glass of Alsace Riesling with the seafood.","zh":"我点了一杯阿尔萨斯雷司令配海鲜。"},{"en":"Alsace wines are often aromatic and food-friendly.","zh":"阿尔萨斯葡萄酒常常香气突出，也很适合配餐。"}]}],"synonyms":["Alsatian"],"phonetic":"/ælˈsæs/","extraExplanation":["阿尔萨斯在历史上多次在法国与德意志/德国之间易手，因此当地建筑、饮食与语言（如阿尔萨斯语，属德语方言）都带有明显的双重文化色彩。","英语里也常见形容词 Alsatian（阿尔萨斯的；阿尔萨斯风格的），例如 Alsatian cuisine（阿尔萨斯菜）或 Alsatian wine（阿尔萨斯葡萄酒）。"]}
{"word":"Alsace-Lorraine","summary":{"en":"Alsace-Lorraine is a border region between France and Germany known for shifting political control and mixed French-German culture.","zh":"阿尔萨斯-洛林是法德边境的历史地区，以多次易手的政治历史与法德文化交融而著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historical region on the border of France and Germany, often associated with Alsace and part of Lorraine; it has shifted between French and German control, especially in the 19th–20th centuries","zh":"法国与德国边境的历史地区，通常指“阿尔萨斯”和“洛林”的一部分；在19—20世纪曾多次在法德之间易手"},"examples":[{"en":"After the Franco-Prussian War, Alsace-Lorraine became part of the German Empire.","zh":"普法战争后，阿尔萨斯-洛林并入德意志帝国。"},{"en":"His family history is tied to Alsace-Lorraine, where French and German cultures meet.","zh":"他的家族史与阿尔萨斯-洛林有关，那是法德文化交汇之地。"}]}],"synonyms":["Alsace","Lorraine","Elsass-Lothringen (German)"],"phonetic":"/ælˈsæs lɔˈreɪn/","extraExplanation":["名称与用法提示：英语里常写作 Alsace-Lorraine（带连字符），也会见到法语形式 Alsace et Lorraine 或德语形式 Elsaß-Lothringen。它并不是一个永远固定的行政区称呼，而更多是历史语境下的政治与文化地理概念。","历史脉络（简要）：1871年普法战争后被德意志帝国吞并；第一次世界大战后（1919年《凡尔赛条约》）回到法国；二战期间又被纳粹德国事实控制；战后恢复为法国领土。因为反复易手，这里常被用来讨论民族认同、语言政策与边境文化。","文化语言特点：当地既有法语传统，也有德语方言/阿勒曼尼语系影响；饮食（如酸菜、白葡萄酒）与建筑风格也呈现法德交融。"]}
{"word":"Alsace-lorrainer","summary":{"en":"An Alsace-Lorrainer is a person from Alsace-Lorraine, or something related to that region on the French–German border.","zh":"“Alsace-Lorrainer”指阿尔萨斯-洛林人，或与阿尔萨斯-洛林（法德边境地区）相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Alsace-Lorraine (a border region between France and Germany).","zh":"阿尔萨斯-洛林人；来自阿尔萨斯-洛林地区的人（法德边境地区）。"},"examples":[{"en":"Her great-grandfather was an Alsace-Lorrainer who moved to Paris after the war.","zh":"她的曾祖父是阿尔萨斯-洛林人，战后搬到了巴黎。"},{"en":"The museum highlights the daily life of Alsace-Lorrainers in the early 1900s.","zh":"这座博物馆重点展示了20世纪初阿尔萨斯-洛林人的日常生活。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Alsace-Lorraine, its people, culture, or dialects.","zh":"阿尔萨斯-洛林的；与该地区、其人民、文化或方言有关的。"},"examples":[{"en":"He studies Alsace-Lorrainer history and identity.","zh":"他研究阿尔萨斯-洛林的历史与身份认同。"},{"en":"The book includes Alsace-Lorrainer folk songs in both French and German.","zh":"这本书收录了阿尔萨斯-洛林民歌，法语和德语版本都有。"}]}],"synonyms":["Alsatian (more common for Alsace)","Lorraine native (for Lorraine)","French-German border region resident"],"phonetic":"/ælˌsæs ˈlɔːrəneɪnər/","extraExplanation":["“Alsace-Lorraine（阿尔萨斯-洛林）”在历史上多次在法国与德国（尤其是普鲁士/德意志帝国）之间变更归属，特别与1871年普法战争后并入德意志帝国、以及第一次世界大战后回归法国有关。因此“Alsace-Lorrainer”常带有边境地区的双语/多元文化背景（法语、德语及阿尔萨斯方言等）。","拼写与用法：也常见作“Alsatian-Lorrainer”或直接用“Alsatian”（阿尔萨斯人）指更具体的阿尔萨斯地区；写作中是否使用该词，取决于是否强调“阿尔萨斯-洛林”作为一个历史/政治单元。"]}
{"word":"Alsace-related","summary":{"en":"“Alsace-related” means connected with the Alsace region of France or anything about it.","zh":"“Alsace-related”表示“与法国阿尔萨斯地区及其相关事物有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with Alsace (a region in eastern France), its people, culture, history, food, language, or wine.","zh":"与阿尔萨斯（法国东部地区）有关的；涉及其人民、文化、历史、饮食、语言或葡萄酒的。"},"examples":[{"en":"The museum has an exhibit of Alsace-related artifacts from the early 1900s.","zh":"这家博物馆有一个展览，展示20世纪初与阿尔萨斯有关的文物。"},{"en":"She is doing research on Alsace-related identity and bilingual education.","zh":"她在研究与阿尔萨斯相关的身份认同和双语教育。"},{"en":"We ordered Alsace-related dishes like choucroute and tarte flambée.","zh":"我们点了与阿尔萨斯有关的菜，比如酸菜拼肉（choucroute）和阿尔萨斯薄饼（tarte flambée）。"}]}],"synonyms":["Alsatian","Alsace-associated","Alsace-connected"],"phonetic":"/ælˈsæs rɪˈleɪtɪd/","extraExplanation":["“Alsace-related”是由专有名词“Alsace（阿尔萨斯）+ related（相关的）”构成的复合形容词，常见于新闻、学术写作、旅游介绍等需要把主题范围限定为“与阿尔萨斯有关”的语境。","阿尔萨斯位于法国与德国交界处（首府斯特拉斯堡 Strasbourg），历史上多次在法德之间易手，因此在语言（法语与阿尔萨斯方言/德语影响）、建筑与饮食上常呈现“法德交融”的特色。"]}
{"word":"Alsatia","summary":{"en":"Alsatia is an old name for Alsace in France, and also a historical nickname for London’s Whitefriars district, once known as a refuge from arrest.","zh":"Alsatia 既可指法国阿尔萨斯（Alsace）的旧称，也可指伦敦 Whitefriars（白修士区）一带的历史绰号，曾以可躲避逮捕的“避难所”闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) Another name for Alsace, a region in eastern France near Germany.","zh":"（古/较少用）阿尔萨斯：法国东部靠近德国的一个地区（Alsace 的旧称）。"},"examples":[{"en":"In some older English texts, Alsace is called Alsatia.","zh":"在一些较早的英文文本里，Alsace 有时被称为 Alsatia。"},{"en":"He traced his family roots to Alsatia (Alsace).","zh":"他追溯家族根源到 Alsatia（阿尔萨斯）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical, London) A nickname for the Whitefriars area, once known as a ‘sanctuary’ where debtors and some criminals tried to avoid arrest.","zh":"（历史用语，伦敦）“阿尔萨提亚”：对白修士区（Whitefriars）一带的绰号；该地曾被视为“避难所”，欠债者和一些罪犯会躲到那里以逃避逮捕。"},"examples":[{"en":"In the 1600s, Alsatia had a reputation for being lawless.","zh":"在17世纪，Alsatia 以无法无天而闻名。"},{"en":"The novel paints Alsatia as a hiding place for desperate debtors.","zh":"小说把 Alsatia 描写成走投无路的欠债者的藏身地。"}]}],"synonyms":["Alsace","Whitefriars"],"phonetic":"/ælˈseɪʃə/","extraExplanation":["“Alsatia”这个伦敦旧称带有强烈的时代色彩，常见于17—18世纪的讽刺作品与城市故事中。之所以叫这个名字，一种常见解释是把该地的“边缘/混杂、难以管束”类比为当时在欧洲政治上争议不断的阿尔萨斯（Alsace）地区。","文学中较有名的用例是托马斯·沙德韦尔（Thomas Shadwell）的喜剧《The Squire of Alsatia》（1688），以此地的无赖与逃债者为题材。"]}
{"word":"alsatia","summary":{"en":"Alsatia most often refers to a historical sanctuary district in London (Whitefriars), famous for sheltering debtors; it can also be an old name for Alsace in France.","zh":"Alsatia最常指伦敦历史上的“白衣修士院（Whitefriars）避难区”，以收容逃债者闻名；也可作法国“阿尔萨斯（Alsace）”的旧称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A lawless sanctuary area in London near Whitefriars, once known for sheltering debtors and criminals; also used figuratively to mean a refuge for people avoiding the law.","zh":"（历史）伦敦白衣修士院（Whitefriars）附近曾被称为“阿尔萨提亚”的避难区，过去以收容逃债者与犯罪者而闻名；也可引申指“逃避法律的避风港”。"},"examples":[{"en":"In the 1600s, some debtors hid in Alsatia to avoid arrest.","zh":"在17世纪，一些欠债的人躲进“阿尔萨提亚”以逃避逮捕。"},{"en":"The novel describes the alley like an Alsatia for runaway apprentices.","zh":"小说把那条小巷描写成学徒逃跑者的“阿尔萨提亚”（避难所）。"}]},{"partOfSpeech":"n.","definition":{"en":"(archaic) An old name for Alsace, a region in eastern France.","zh":"（古义）法国东部地区“阿尔萨斯”（Alsace）的旧称。"},"examples":[{"en":"Some older texts refer to Alsace as Alsatia.","zh":"一些较早的文献会用“Alsatia”来指“Alsace”（阿尔萨斯）。"}]}],"synonyms":["Whitefriars","sanctuary (figurative)","Alsace (archaic sense)"],"phonetic":"/ælˈseɪʃə/","extraExplanation":["“Alsatia”这个伦敦地名的用法来自“Alsace/Alsatia”（阿尔萨斯）这一地区的形象：历史上阿尔萨斯在不同政权之间更替频繁，因此“Alsatia”在英国讽刺语境中被借来指“法外之地/混乱地带”。","文学与文化：17世纪剧作家Thomas Shadwell写过喜剧《The Squire of Alsatia》（1688），以该地的无赖与逃债者为题材；后来一些英国作品也会用“Alsatia”来暗示“治安混乱、规则失效”的街区。"]}
{"word":"Alsatian","summary":{"en":"Alsatian usually means “from Alsace” (a person or something related). It can also mean a German Shepherd dog, especially in British usage.","zh":"Alsatian 通常指“阿尔萨斯的/阿尔萨斯人”。也可指德国牧羊犬（在英式用法中较常见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person from Alsace, a region in eastern France near Germany and Switzerland.","zh":"阿尔萨斯人；来自法国东部阿尔萨斯地区的人（靠近德国和瑞士）。"},"examples":[{"en":"She’s Alsatian, but she speaks both French and German.","zh":"她是阿尔萨斯人，但法语和德语都会说。"},{"en":"Many Alsatians have a mixed cultural background because of the region’s history.","zh":"由于这片地区的历史，许多阿尔萨斯人有着多元混合的文化背景。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to Alsace, its people, language varieties, or culture.","zh":"阿尔萨斯（地区/文化）的；与阿尔萨斯及其人民、语言或文化有关的。"},"examples":[{"en":"We tried an Alsatian dish with sauerkraut and sausage.","zh":"我们尝了一道阿尔萨斯菜，有酸菜和香肠。"},{"en":"The town has beautiful Alsatian architecture with colorful houses.","zh":"这个小镇有漂亮的阿尔萨斯建筑，房子色彩鲜艳。"}]},{"partOfSpeech":"n.","definition":{"en":"A dog of a breed associated with Alsace; commonly used as another name for the German Shepherd.","zh":"阿尔萨斯犬（常用来指德国牧羊犬的别称）。"},"examples":[{"en":"Their Alsatian is well-trained and very gentle with kids.","zh":"他们家的阿尔萨斯犬训练有素，对孩子很温柔。"},{"en":"In some places, people say “Alsatian” instead of “German Shepherd.”","zh":"在一些地方，人们会用“Alsatian”来代替“German Shepherd（德国牧羊犬）”。"}]}],"synonyms":["from Alsace","Alsace-related","German Shepherd (dog)"],"phonetic":"/ælˈseɪʃən/","extraExplanation":["“Alsatian”来自法语“Alsace（阿尔萨斯）”。阿尔萨斯在法德之间历史上多次易手，因此当地文化常被认为兼具法式与德式元素。","把德国牧羊犬称为“Alsatian”在英国等地更常见，历史上与一战、二战期间人们对“German（德国的）”这个称呼的敏感有关，所以改用与地名相关的“Alsatian”来称呼该犬种。"]}
{"word":"alsatian","summary":{"en":"Alsatian means “from Alsace” (France), and it can also mean a German Shepherd dog (especially in the UK).","zh":"Alsatian 指“阿尔萨斯的／阿尔萨斯人”，也可指（尤指英国所说的）德国牧羊犬。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Alsace, a region in eastern France, or to the people/language/culture from there.","zh":"（与）阿尔萨斯（法国东部地区）有关的；阿尔萨斯人的／语言的／文化的。"},"examples":[{"en":"She cooks several Alsatian dishes, like choucroute.","zh":"她会做几道阿尔萨斯菜，比如酸菜拼肉（choucroute）。"},{"en":"Alsatian architecture often shows both French and German influences.","zh":"阿尔萨斯的建筑常常同时体现法国和德国的影响。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Alsace, or someone connected to Alsace.","zh":"阿尔萨斯人；与阿尔萨斯有关的人。"},"examples":[{"en":"Many Alsatians grow up hearing both French and local dialects.","zh":"许多阿尔萨斯人从小就会听到法语和当地的方言。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in British English) a German Shepherd dog.","zh":"（尤指英式英语）德国牧羊犬。"},"examples":[{"en":"Their Alsatian is well trained and very protective.","zh":"他们的德国牧羊犬训练有素，也很护主。"},{"en":"In the UK, some people say “Alsatian” instead of “German Shepherd.”","zh":"在英国，有些人会用“Alsatian”来代替“German Shepherd（德国牧羊犬）”。"}]}],"synonyms":["from Alsace","German Shepherd"],"phonetic":"/ælˈseɪʃən/","extraExplanation":["“Alsatian”来自法国地名“Alsace（阿尔萨斯）”。阿尔萨斯地处法德交界，历史上多次在法国与德国之间变更归属，因此文化、饮食和语言常呈现法德混合特色。","把德国牧羊犬称作“Alsatian”主要见于英国：一战后英国社会对“German（德国的）”这个词较敏感，于是用“Alsatian（来自阿尔萨斯的）”来替代称呼。如今两种说法都能听到，但在美国更常说“German Shepherd”。"]}
{"word":"alsbachite","summary":{"en":"Alsbachite is a rare fossil resin (amber-like) noted in geology/mineralogy.","zh":"Alsbachite 是一种罕见的化石树脂（类似琥珀），多见于地质/矿物学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare natural resin (a fossil resin similar to amber) that has been found in parts of Germany and is sometimes discussed in mineralogy/geology.","zh":"（矿物学/地质学）一种罕见的天然树脂（属于类似琥珀的化石树脂），曾在德国部分地区发现并被记载。"},"examples":[{"en":"The museum label described the dark, brittle piece as alsbachite, a type of fossil resin.","zh":"博物馆标签把那块颜色深、较脆的标本描述为 alsbachite（一种化石树脂）。"},{"en":"Alsbachite is mentioned in older mineral lists rather than in everyday English.","zh":"alsbachite 更多见于较早的矿物名录中，而不是日常英语。"}]}],"synonyms":["fossil resin","resinite","amber (loosely)"],"phonetic":"/ˈælz.bɑːˌkaɪt/","extraExplanation":["词源提示：alsbachite 以德国地名 Alsbach 命名，后缀 -ite 常用于矿物或岩石名称（表示“某某石/矿物”）。","使用场景：这个词非常专业，通常只在地质、矿物学文献或博物馆说明牌中出现；日常交流更常用 fossil resin（化石树脂）或 amber-like resin（类似琥珀的树脂）来解释。"]}
{"word":"Alsea","summary":{"en":"Alsea is mainly a proper name: a place in Oregon (and the Alsea River/Bay), and also the name of an Indigenous people/language of Oregon’s coast.","zh":"Alsea 主要是专有名词：指俄勒冈州的地名（以及阿尔西河/阿尔西湾），也可指俄勒冈海岸的阿尔西族及其语言。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a place name in the U.S., most commonly referring to a small community in Oregon (and related nearby names like the Alsea River and Alsea Bay).","zh":"美国的地名，最常见指俄勒冈州的一个小社区（以及相关的阿尔西河 Alsea River、阿尔西湾 Alsea Bay 等）。"},"examples":[{"en":"We drove through Alsea on our way to the Oregon coast.","zh":"我们去俄勒冈海岸的路上开车经过了阿尔西（Alsea）。"},{"en":"The Alsea River is known for its scenery and fishing.","zh":"阿尔西河（Alsea River）以风景和垂钓闻名。"}]},{"partOfSpeech":"other","definition":{"en":"the name of an Indigenous people of the Oregon coast (and also used for their language, now largely dormant).","zh":"美国俄勒冈海岸一支原住民族的名称（也可指他们的语言，如今多已不再日常使用）。"},"examples":[{"en":"Some local place names come from Alsea and other Indigenous languages.","zh":"一些本地地名源自阿尔西语（Alsea）及其他原住民语言。"},{"en":"The museum has information about the Alsea people and neighboring groups.","zh":"博物馆里有关于阿尔西族（Alsea）及其邻近族群的资料。"}]}],"synonyms":["Alsea River","Alsea Bay","Alsea, Oregon"],"phonetic":"/ælˈsiə/","extraExplanation":["“Alsea”在日常英语里通常作为专有名词使用（地名/族名），一般不加冠词：说“in Alsea”“the Alsea River”。","读音在不同地区可能略有差异；最常见的读法接近“al-SEE-uh”。"]}
{"word":"Alsen","summary":{"en":"Alsen is mainly a proper name: a place name (notably in Sweden, and also the German name for Denmark’s island Als) or a surname.","zh":"Alsen 主要是专有名词：可作地名（如瑞典的 Alsen，也可作丹麦阿尔斯岛 Als 的德语名称）或作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun), used for several locations—most commonly a village/parish in Sweden, and also the German name for the Danish island Als.","zh":"地名（专有名词）：可指多个地点——最常见的是瑞典的一个村庄/教区；也可指丹麦“阿尔斯岛（Als）”的德语名称“Alsen”。"},"examples":[{"en":"She grew up in Alsen, Sweden, before moving to Stockholm.","zh":"她在瑞典的 Alsen 长大，后来搬到斯德哥尔摩。"},{"en":"In older German sources, the island of Als may appear as Alsen.","zh":"在较早的德语资料里，阿尔斯岛（Als）可能会写作 Alsen。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"姓氏（人名）。"},"examples":[{"en":"Dr. Alsen will speak at the conference tomorrow.","zh":"Alsen 博士明天将在会议上发言。"}]}],"synonyms":["Als (for the Danish island, English/Danish form)"],"phonetic":"/ˈæl.sən/","extraExplanation":["“Alsen”常见于地名与史料语境中，读到它时可以先判断：是在说某个具体地点（瑞典的 Alsen，或丹麦阿尔斯岛的德语写法），还是在指人的姓氏。","历史上也有“Battle of Alsen（阿尔森之战）”的说法，通常指1864年第二次石勒苏益格战争中的一次战役；如果在历史书里遇到“Alsen”，可以留意是否在讲这段史事。"]}
{"word":"Alsey","summary":{"en":"“Alsey” is usually a proper noun: a personal name or the name of a village in Illinois, USA.","zh":"“Alsey”通常是专有名词：人名，或美国伊利诺伊州一个村庄的地名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name (first name) used in English-speaking contexts; often treated as a variant spelling of names like “Alsie” or “Elsie.”","zh":"（专有名词）英语语境中的人名（名字）；有时被视为“Alsie / Elsie”等名字的变体拼写。"},"examples":[{"en":"Alsey moved to Seattle for a new job.","zh":"Alsey 搬到西雅图去做一份新工作。"},{"en":"The email was signed, “Best, Alsey.”","zh":"邮件落款写着：“祝好，Alsey。”"}]},{"partOfSpeech":"other","definition":{"en":"a place name: Alsey, a small village in Illinois, USA.","zh":"（地名）美国伊利诺伊州的一个小村庄：Alsey。"},"examples":[{"en":"We stopped for gas near Alsey, Illinois.","zh":"我们在伊利诺伊州 Alsey 附近停下来加油。"},{"en":"Alsey is a quiet place with a small-town feel.","zh":"Alsey 很安静，有一种小镇的氛围。"}]}],"phonetic":"/ˈæl.si/","extraExplanation":["“Alsey”更常见于专有名词（人名或地名），一般不当作普通词汇使用；在正式写作中通常首字母大写。","作为地名时，提到时常会加上州名或国家来避免歧义，例如 “Alsey, Illinois”。"]}
{"word":"Alshain","summary":{"en":"Alshain is the traditional name of Beta Aquilae, a star in the constellation Aquila.","zh":"Alshain 是天鹰座β（Beta Aquilae）的传统星名，位于天鹰座。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a star name: Beta Aquilae (β Aquilae), a fairly bright star in the constellation Aquila (the Eagle).","zh":"恒星名：天鹰座β（β Aquilae），位于天鹰座（Aquila，天鹰座）的一颗较亮的恒星。"},"examples":[{"en":"Alshain is the traditional name for Beta Aquilae in the constellation Aquila.","zh":"Alshain 是天鹰座中 β Aquilae（天鹰座β）的传统名称。"},{"en":"On a clear summer night, you can look near Altair to find Alshain in Aquila.","zh":"在夏季晴朗的夜晚，你可以在牛郎星（Altair）附近找到天鹰座的 Alshain。"}]}],"synonyms":["Beta Aquilae","β Aquilae"],"phonetic":"/ælˈʃeɪn/","extraExplanation":["Alshain 是“传统星名”（traditional star name），常见于星图、天文科普与观星应用中。","名称来源于阿拉伯语传统星名系统；不同资料里可能出现拼写差异或转写差异（例如大小写、连字符等）。","在天鹰座中，人们常把 Alshain 与更有名的 Altair（牛郎星）一起提到，便于定位。"]}
{"word":"alshain","summary":{"en":"Alshain is the traditional name of the star Gamma Aquilae in the constellation Aquila.","zh":"Alshain 是天鹰座中恒星“天鹰座γ（Gamma Aquilae）”的传统名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a star name: Gamma Aquilae, a bright star in the constellation Aquila (the Eagle).","zh":"恒星名：天鹰座γ（Gamma Aquilae），位于天鹰座（Aquila，天鹰座）的一颗较亮的恒星。"},"examples":[{"en":"On a clear summer night, you can spot Alshain in the constellation Aquila.","zh":"在晴朗的夏夜里，你可以在天鹰座里找到 Alshain。"},{"en":"The star chart labels Gamma Aquilae as Alshain.","zh":"星图上把天鹰座γ标注为 Alshain。"}]}],"synonyms":["Gamma Aquilae","γ Aquilae"],"phonetic":"/ælˈʃeɪn/","extraExplanation":["“Alshain”是传统恒星名，多来源于阿拉伯语天文学命名体系；常见解释认为与阿拉伯语中表示“（某种）猎鹰/隼”的词根有关，反映了古代把星星与动物形象联系起来的习惯。","在现代天文学中，这颗星更常用其拜耳命名“Gamma Aquilae（天鹰座γ）”来指代；“Alshain”则属于历史与文化传统命名，在星图、科普书和观星圈仍很常见。"]}
{"word":"alsifilm","summary":{"en":"“alsifilm” is not a standard English word; it’s likely a name or a typo (possibly “as if” or “ALS film”).","zh":"“alsifilm”不是标准英语单词；更可能是名称或拼写错误（可能是“as if”或“ALS film”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username/brand name, or a combination like “ALSI + film.”","zh":"不是标准英语单词。可能是拼写错误、用户名/品牌名，或像“ALSI + film”这样的组合。"},"examples":[{"en":"I couldn’t find “alsifilm” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里找不到“alsifilm”——你能把它出现的句子发我吗？"},{"en":"If you meant “as if,” the phrase means “as though.”","zh":"如果你想写的是“as if”，它的意思是“仿佛、好像”。"}]}],"phonetic":"/ˈæl.si.fɪlm/","extraExplanation":["“alsifilm”看起来更像是专有名词（品牌/账号/产品名）或输入法连写的结果，而不是英语词汇。最常见的可能是你想写“as if”（仿佛、好像）或“ALS film”（与“ALS（肌萎缩侧索硬化症）”相关的影片/纪录片）。\n你可以告诉我：1）它出现在哪个句子里；2）是否与电影/摄影有关；3）是否是某个品牌或网站名。我就能更准确地解释。"]}
{"word":"alsike","summary":{"en":"Alsike is a kind of clover (Alsike clover), used as pasture and hay and sometimes seen growing wild.","zh":"Alsike 指一种三叶草（Alsike clover），常作牧草和干草，也可能在野外生长。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of clover with pinkish-white flower heads, often grown for animal feed and sometimes found growing wild (Alsike clover).","zh":"一种三叶草（红白或粉白色花球），常用于牧草/饲料，也可在野外见到（瑞典三叶草/阿尔西克三叶草）。"},"examples":[{"en":"The farmer planted alsike to provide hay for the cattle.","zh":"农场主种了瑞典三叶草来给牛准备干草。"},{"en":"Bees were visiting the alsike blossoms in the field.","zh":"蜜蜂在田里采瑞典三叶草的花蜜。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to this type of clover.","zh":"与瑞典三叶草有关的；由瑞典三叶草制成的。"},"examples":[{"en":"Alsike seed is often mixed with other pasture grasses.","zh":"瑞典三叶草的种子常与其他牧草混播。"}]}],"synonyms":["Alsike clover","clover (general)"],"phonetic":"/ˈæl.saɪk/","extraExplanation":["“alsike”来自瑞典地名 Alsike（阿尔西克），这种三叶草据说最早在该地区被广泛栽培并因此得名。常见写法是“Alsike clover”。在英语里它多用于农业、牧草与养蜂相关语境。"]}
{"word":"alsikes","summary":{"en":"“Alsikes” is the plural of “alsike,” meaning Alsike clover, a pink-and-white clover grown as forage or for improving soil.","zh":"“Alsikes”是“alsike”的复数，指瑞典三叶草（一种粉白花的三叶草），常作牧草或用于改良土壤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Alsike clover: a type of clover (a small flowering plant) with pink-and-white flower heads, often grown for animal feed or soil improvement.","zh":"瑞典三叶草（又称阿尔西克三叶草）：一种开粉白色花球的小型豆科植物，常用于牧草饲料或改良土壤。"},"examples":[{"en":"The farmer planted alsikes in the wet part of the field because they tolerate damp soil.","zh":"农民在田里较潮湿的区域种了瑞典三叶草，因为它们比较耐湿。"},{"en":"Bees often visit alsike clover flowers for nectar.","zh":"蜜蜂常去瑞典三叶草的花上采蜜。"}]}],"synonyms":["Alsike clover","Swedish clover","clover","Trifolium hybridum"],"phonetic":"/ˈælˌsaɪk/","extraExplanation":["“Alsike”这个名字来自瑞典的一个地名（Alsike），因此也常被称为“Swedish clover（瑞典三叶草）”。","在畜牧语境中需要注意：某些情况下马匹大量食用瑞典三叶草可能会出现健康问题（不同地区与饲喂条件下风险不同），饲养者通常会控制摄入量或咨询兽医。"]}
{"word":"Alsinaceae","summary":{"en":"Alsinaceae is an older botanical family name for the chickweed group, now usually included in Caryophyllaceae.","zh":"Alsinaceae 是较旧的植物科名，指繁缕类群，现多并入石竹科（Caryophyllaceae）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a botanical family name (now mostly outdated) referring to plants commonly known as the chickweed group; it is generally treated today as part of the pink family (Caryophyllaceae).","zh":"（植物学）一个较旧的科名，主要指“繁缕类/繁缕组”的植物；现代分类多将其并入石竹科（Caryophyllaceae）。"},"examples":[{"en":"Older floras may list chickweed under the family Alsinaceae.","zh":"一些较早的植物志可能把繁缕列在Alsinaceae（繁缕科）下。"},{"en":"In modern taxonomy, many plants once placed in Alsinaceae are classified within Caryophyllaceae.","zh":"在现代分类学中，许多曾归入Alsinaceae的植物被划入石竹科（Caryophyllaceae）。"}]}],"synonyms":["chickweed family","Caryophyllaceae (modern placement)"],"phonetic":"/ˌæl.saɪˈneɪ.si.i/","extraExplanation":["Alsinaceae 这个名称在较老的英文植物分类资料中更常见，常与“chickweed（繁缕）一类的小型草本”相关。","按现代APG等系统，许多传统“科”被重新合并或拆分；Alsinaceae 通常不再作为独立科使用，更常见的处理是作为石竹科（Caryophyllaceae）中的一个类群（如亚科/族/类群）来讨论。","词形来源上，Alsin- 与属名 Alsine（古老用法，常与繁缕类相关）有关；-aceae 是植物科名的标准后缀。"]}
{"word":"alsinaceae","summary":{"en":"Alsinaceae is an older botanical family name, now usually included within Caryophyllaceae (the pink/carnation family).","zh":"Alsinaceae 是较旧的植物科名，现多并入石竹科（Caryophyllaceae）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former (now mostly obsolete) name for a plant family that includes chickweeds; often treated today as part of the pink/carnation family (Caryophyllaceae).","zh":"（植物）阿尔辛科：一种旧称（现多已废用）的植物科名，包含繁缕等植物；如今常被并入石竹科（Caryophyllaceae）。"},"examples":[{"en":"In older botany books, chickweed is sometimes listed under Alsinaceae.","zh":"在较老的植物学书里，繁缕有时被归在阿尔辛科（Alsinaceae）下。"},{"en":"Modern classifications usually place many “Alsinaceae” plants in the Caryophyllaceae family.","zh":"现代分类通常把许多“阿尔辛科”的植物归入石竹科。"}]}],"synonyms":["chickweed family","Alsine family (obsolete)","Alsinoideae (as a subfamily name in some systems)"],"phonetic":"ˌæl.sɪˈneɪ.si.i","extraExplanation":["这是一个偏“历史分类”的术语：19世纪到20世纪早期的一些植物分类系统会使用 Alsinaceae，把以繁缕（chickweed, Stellaria）等为代表的一组植物单独列为一科。后来随着分类方法更新（尤其是基于形态与分子证据的系统发育研究），这类群多被并入更大的石竹科（Caryophyllaceae），或作为其中的亚科/类群（如 Alsinoideae）来处理。","词形特点：以 -aceae 结尾通常表示“植物科名”（family name），在学术拉丁化命名中很常见。"]}
{"word":"alsinaceous","summary":{"en":"A rare botanical adjective meaning “chickweed-like” or “related to the historical *Alsine* group.”","zh":"一个较少见的植物学形容词，表示“像繁缕的/与历史上的 *Alsine*（繁缕类）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Relating to or resembling chickweed (historically linked to the genus *Alsine*), or belonging to the chickweed-type group in older botanical classifications.","zh":"（植物学）与繁缕（历史上与 *Alsine* 属有关）相关的；或指在较早的植物分类中属于“繁缕类/繁缕科一类”的。"},"examples":[{"en":"The botanist described the plant as alsinaceous because its small white flowers looked like chickweed.","zh":"植物学家把这种植物描述为 alsinaceous，因为它的小白花看起来像繁缕。"},{"en":"Older field guides may use alsinaceous to group several chickweed-like species together.","zh":"较旧的野外图鉴可能会用 alsinaceous 来把几种“像繁缕”的物种归为一组。"}]}],"synonyms":["chickweed-like","stellaria-related (context-specific)"],"phonetic":"ˌæl.səˈneɪ.ʃəs","extraExplanation":["这是一个较少见、偏“学术/古典植物分类”的形容词，常见于旧的植物志、分类文献或较传统的描述性文字里。","词源上来自拉丁化的属名 *Alsine*（与“繁缕/鸡肠菜”这类植物相关）。现代分类里相关类群的名称与范围可能已调整，所以阅读旧文献时会遇到它。"]}
{"word":"Alsine","summary":{"en":"Alsine is an old botanical name for chickweed-like plants, now usually classified as Stellaria (chickweed).","zh":"Alsine 是旧植物学名，常指繁缕（鸡肠菜）一类植物；现代多归入繁缕属（Stellaria）并用更常见的名称或学名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant name used in older botany for chickweeds or sandworts (small wild plants with tiny white flowers), especially those now classified in the genus Stellaria (chickweed).","zh":"（旧植物学用语）指繁缕/鸡肠菜类或石头菜类等小型野草，常开细小白花；多指现多归入繁缕属（Stellaria）的植物。"},"examples":[{"en":"In some old herbals, common chickweed is listed under the name alsine.","zh":"在一些旧版草药书里，常见的鸡肠菜会以 alsine 这个名称收录。"},{"en":"The gardener pulled out alsine growing between the paving stones.","zh":"园丁拔掉了长在铺路石缝里的 alsine（繁缕一类的杂草）。"}]}],"synonyms":["chickweed","Stellaria","sandwort"],"phonetic":"/ælˈsaɪni/","extraExplanation":["“Alsine”主要见于较早的英文植物志、草药书或园艺文献中；现代更常用的名称通常是“chickweed（繁缕/鸡肠菜）”或按最新分类用其拉丁学名（如 Stellaria media）。","词源可追溯到古希腊语中对某类植物的称呼，后来被借用为拉丁化的植物名。因为植物分类不断调整，你在阅读老文献时可能会看到“alsine”对应不同但相近的物种。"]}
{"word":"alsine","summary":{"en":"Alsine is an older botanical name for chickweeds (small flowering plants).","zh":"Alsine 是一个较旧的植物学名称，多用于指繁缕/鸡肠菜（chickweed）一类植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant name used in botany, especially in older texts, referring to chickweeds (plants in the pink/carnation family).","zh":"（植物学用语，尤见于较旧文献）指繁缕/鸡肠菜类植物（石竹科的一类植物名称）。"},"examples":[{"en":"In older field guides, some chickweed species were listed under the name Alsine.","zh":"在较旧的野外植物图鉴中，一些繁缕类植物曾以 Alsine 这个名称列出。"},{"en":"The herbarium label identified the specimen as Alsine, an older classification for chickweed.","zh":"标本馆的标签把该标本标为 Alsine，这是繁缕的一种旧分类名称。"}]}],"synonyms":["chickweed","Stellaria"],"phonetic":"/ælˈsaɪni/","extraExplanation":["“Alsine”常见于19世纪及更早的植物分类体系里，现代分类多把相关物种归入 Stellaria（繁缕属）等属名，因此你在新一点的资料里可能更常看到 Stellaria 或 chickweed。","如果你是想拼写别的常见单词（例如：alone / align / asinine），可以告诉我上下文句子，我可以帮你确认正确拼写与词义。"]}
{"word":"Alsinoideae","summary":{"en":"Alsinoideae is a mostly historical botanical subfamily name within the Caryophyllaceae (pink/carnation family).","zh":"Alsinoideae 是石竹科中一个多为历史用法的植物“亚科”名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former (now mostly historical) subfamily name in the pink/carnation family (Caryophyllaceae), used in some older botanical classifications for plants like chickweeds and stitchworts.","zh":"（多为历史用法的）石竹科（Caryophyllaceae）中的一个旧“亚科”名称，在一些较早的植物分类中使用，常包含如繁缕（chickweed）、繁缕属/繁缕类和繁缕菜属等相近类群。"},"examples":[{"en":"In older floras, some species were placed in the subfamily Alsinoideae.","zh":"在较早的植物志中，一些物种曾被归入 Alsinoideae 这个亚科。"},{"en":"Modern taxonomy often avoids the name Alsinoideae and uses updated groups within Caryophyllaceae.","zh":"现代分类学通常不再使用 Alsinoideae 这个名称，而是采用石竹科内更新后的分组。"}]}],"synonyms":["Caryophyllaceae subfamily (historical use)","pink family subfamily (older term)"],"phonetic":"/ˌæl.sɪˈnɔɪ.diˌi/","extraExplanation":["这是一个拉丁化的植物分类名，来自“alsine”（古称“繁缕/小型草本”的词源），因此常与“繁缕类（chickweed-like plants）”相关。","“Alsinoideae”在不同年代、不同学者的系统中内涵可能不完全一致；阅读旧文献时要结合作者采用的分类体系来理解。"]}
{"word":"Alsip","summary":{"en":"Alsip is most commonly the name of a village near Chicago in Illinois; it can also be a surname.","zh":"Alsip 最常见是美国伊利诺伊州芝加哥附近的一个村镇名；也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a village (suburban town) in Cook County, Illinois, near Chicago, in the United States.","zh":"（美国）伊利诺伊州库克县的一个村镇（芝加哥附近的郊区小镇）。"},"examples":[{"en":"She grew up in Alsip, just outside Chicago.","zh":"她在芝加哥郊外的阿尔西普（Alsip）长大。"},{"en":"The event will be held at a community center in Alsip, Illinois.","zh":"活动将在伊利诺伊州阿尔西普的一个社区中心举行。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"一个姓氏（人名）。"},"examples":[{"en":"Mr. Alsip will speak at the meeting tomorrow.","zh":"阿尔西普先生将于明天在会议上发言。"}]}],"synonyms":["Chicago suburb (related)","Alsip, IL (common written form)"],"phonetic":"/ˈæl.sɪp/","extraExplanation":["“Alsip”最常见的用法是地名，作为专有名词首字母要大写；在地址里常写作“Alsip, IL”。","作为地名时，它通常不需要冠词（不说“the Alsip”）。"]}
{"word":"alsmekill","summary":{"en":"“alsmekill” is not a recognized English word; it’s probably a typo or a proper name.","zh":"“alsmekill”不是常见英语词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a username/place name.","zh":"不是标准英语单词，可能是拼写错误，或是用户名/地名等专有名词。"},"examples":[{"en":"I can’t find “alsmekill” in a dictionary—could it be a typo?","zh":"我在词典里找不到“alsmekill”——它会不会是拼写错了？"},{"en":"Did you mean “almost kill” or “ask me” + “kill”?","zh":"你是想写“almost kill（差点杀死）”，还是“ask me（问我）”加上“kill（杀死）”？"}]}],"phonetic":"ˌælzmiˈkɪl","extraExplanation":["“alsmekill”在常见英语词典中没有收录。如果你能告诉我它出现的语境（句子/截图/你想表达的意思），我可以帮你判断：\n1）是否是拼写错误（如 almost、also、ask me 等）；\n2）是否是游戏ID/网名；\n3）是否是地名或其他语言（例如北欧语言中的地名常见以 -kill 结尾）。"]}
{"word":"Also","summary":{"en":"“Also” means “in addition/too,” used to add another fact or point.","zh":"“Also”表示“也/还/此外”，用于补充另一个事实或观点。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in addition; too; as well","zh":"也；还；此外"},"examples":[{"en":"I speak English, and I also speak Spanish.","zh":"我会说英语，也会说西班牙语。"},{"en":"She was tired, and she was also hungry.","zh":"她很累，也很饿。"}]},{"partOfSpeech":"adv.","definition":{"en":"used to add another statement or point; furthermore","zh":"而且；并且；另外（用于补充说明）"},"examples":[{"en":"The plan is expensive. Also, it may not work.","zh":"这个计划很贵。而且，它可能行不通。"},{"en":"Also, please remember to bring your ID.","zh":"另外，请记得带上身份证件。"}]}],"synonyms":["too","as well","in addition","furthermore","moreover"],"phonetic":"/ˈɔlsoʊ/","extraExplanation":["“also”通常放在助动词/系动词后面：She is also coming. / I have also finished. 如果没有助动词，常放在实义动词前：I also want to go.","句首的“Also,”更像“另外/而且”，语气比“and”更正式一点，常用于写作或较正式的口语。"]}
{"word":"also","summary":{"en":"“Also” means “in addition” or “too,” used to add another point.","zh":"“also” 表示“此外/也”，用于补充说明另一个要点。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in addition; too; as well (used to add another idea or fact)","zh":"也；还；此外（用来补充另一个想法或事实）"},"examples":[{"en":"I’m studying English, and I’m also learning Spanish.","zh":"我在学英语，也在学西班牙语。"},{"en":"She is smart and also very hardworking.","zh":"她很聪明，也非常勤奋。"},{"en":"Also, please remember to bring your ID.","zh":"另外，请记得带身份证件。"}]}],"synonyms":["too","as well","in addition","additionally","furthermore"],"phonetic":"/ˈɔlsoʊ/","extraExplanation":["位置小提示：\"also\" 常放在句中（主语后、主要动词前：I also agree），但如果要强调“另外/此外”，也可以放在句首：Also, ...","比较：\"too\" 更常放句末（I agree too）；\"as well\" 也常放句末（I agree as well）。三者意思接近，但语气与位置不同。"]}
{"word":"also-ran","summary":{"en":"An also-ran is someone or something seen as unlikely to win or succeed—essentially a minor competitor.","zh":"also-ran 指被认为不太可能获胜或成功的“陪跑者/无望夺冠者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person, team, product, or candidate that is unlikely to win or succeed; someone considered minor or not competitive compared with the leaders.","zh":"（人、队伍、产品或候选人等）不太可能获胜或成功的“陪跑者”；被认为不具竞争力、无望夺冠的一方。"},"examples":[{"en":"Most critics saw the movie as an also-ran compared with the summer’s big hits.","zh":"大多数影评人认为这部电影和暑期大片相比只是个“陪跑者”。"},{"en":"She refused to be treated as an also-ran in the competition and trained even harder.","zh":"她拒绝在比赛中被当作“陪跑者”，于是训练得更刻苦。"},{"en":"In the election, he was dismissed as an also-ran, but he later gained support.","zh":"在选举中他一开始被认为只是“陪跑者”，但后来获得了支持。"}]}],"synonyms":["long shot","underdog","noncontender","outsider","also-ran candidate"],"phonetic":"/ˈɔlsoʊ ˌræn/","extraExplanation":["这个词最初来自赛马：成绩单上除了冠军之外，其他“也跑了（also ran）”的马只会被简单记作“also ran”，久而久之就引申为“没什么希望赢的参赛者/竞争者”。","常见写法是连字符 also-ran（作名词或形容词用法时尤其常见）：an also-ran candidate；也会见到不加连字符的 also ran（较少见）。","语气通常带一点轻视或贬义；在正式或尊重的语境中可用 underdog（弱者/黑马，语气更中性甚至正面）或 long shot（胜算很小的人/事）替代。"]}
{"word":"also-rans","summary":{"en":"“Also-rans” are competitors who participate but are not expected to win.","zh":"「also-rans」指參賽但不太可能獲勝、成績不突出的競爭者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or things that take part in a competition but are not expected to win; less successful competitors.","zh":"在競爭中參與但不太可能獲勝的人或事物；表現較不突出的競爭者。"},"examples":[{"en":"In the election, the two major parties dominated the news while the also-rans struggled to get attention.","zh":"在選舉中，兩大政黨主導了新聞版面，而那些陪跑的候選人很難獲得關注。"},{"en":"Most startups fail, and many end up as also-rans in a crowded market.","zh":"多數新創公司會失敗，許多在擁擠的市場中最後成了陪跑者。"}]}],"synonyms":["also-ran","non-contender","underdog","second-stringer","minor player"],"phonetic":"/ˈɔlsoʊ ˌræn/","extraExplanation":["「also-ran」原本來自賽馬用語：在結果公告中，除了名次內的馬之外，其餘會被簡單列為「also ran」（也有參賽）。因此它帶有「有參加但不出色」的語氣，有時略帶貶義。正式寫作中常見複數 also-rans。"]}
{"word":"Alson","summary":{"en":"Alson is usually a personal name (given name or surname), not a common English word with a standard dictionary meaning.","zh":"Alson 通常是英文人名或姓氏，不是一个有标准词典释义的常用单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare given name or surname (proper noun). It is not a common everyday English vocabulary word.","zh":"一个较少见的英文人名或姓氏（专有名词）。它不是常见的日常英语词汇。"},"examples":[{"en":"Dr. Alson will speak at the conference tomorrow.","zh":"Alson 博士明天将在会议上发言。"},{"en":"I saw the name Alson on the class list.","zh":"我在班级名单上看到了 Alson 这个名字。"}]}],"phonetic":"/ˈɔlsən/","extraExplanation":["“Alson”在英语里更常见的是作为人名/姓氏出现，而不是一个有固定词义的普通单词。","如果你是在句子里看到“Alson”，也可能是拼写误差：常见的相近词包括“also”（也、而且）或女性名“Alison/Allison”（艾莉森）。如果你把原句发我，我可以帮你判断到底是哪一个。"]}
{"word":"alsoon","summary":{"en":"“As soon as” means “immediately when/after,” often used to connect two actions in time.","zh":"“as soon as”表示“一……就……”，用于连接两个按时间先后发生的动作。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"immediately after something happens; at the earliest possible time","zh":"一……就……；一旦……就……（表示事情发生后立刻做另一件事）"},"examples":[{"en":"Call me as soon as you arrive.","zh":"你一到就给我打电话。"},{"en":"As soon as the rain stopped, we went outside.","zh":"雨一停，我们就出去了。"},{"en":"I’ll let you know as soon as I have news.","zh":"我一有消息就告诉你。"}]},{"partOfSpeech":"phrase","definition":{"en":"used to emphasize quick action (often in requests or instructions)","zh":"用于强调要尽快（常见于请求或指示中）"},"examples":[{"en":"Please reply as soon as possible.","zh":"请尽快回复。"},{"en":"Send the document as soon as you can.","zh":"你能多快就多快把文件发过来。"}]}],"synonyms":["immediately","right after","the moment","as quickly as possible (ASAP)"],"phonetic":"/æz suːn æz/","extraExplanation":["你输入的“alsoon”很可能是把短语 **as soon (as)** 连在一起写了；正确写法通常是 **as soon as + 从句**（as soon as I can / as soon as you arrive）。","语法要点：**as soon as** 引导时间状语从句。谈论将来时，英语里常用 **一般现在时** 表将来：*I’ll call you as soon as I get home.*（从句不用 *will get* 更自然）。","常见相关表达：**as soon as possible (ASAP)**=“尽快”；口语也会说 **the moment / the minute / the second** 表示“一……就……”。"]}
{"word":"Alsop","summary":{"en":"“Alsop” is mainly a surname (family name) and sometimes a place name.","zh":"“Alsop”主要是姓氏，有时也用作地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), originally from England; used as the last name of various people (e.g., writers, journalists).","zh":"（英来源的）姓氏“Alsop”；用作人名的姓（例如作家、记者等的姓）。"},"examples":[{"en":"Her last name is Alsop, but her first name is Maria.","zh":"她姓Alsop，名字叫Maria。"},{"en":"I read an article by an author named Alsop.","zh":"我读过一位姓Alsop的作者写的文章。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name (less common), used for some locations that include “Alsop” in their names.","zh":"（较少见）地名；用于一些名称中包含“Alsop”的地点。"},"examples":[{"en":"They visited a village whose name includes Alsop.","zh":"他们参观了一个名字里带有Alsop的村庄。"}]}],"synonyms":["Allsop","Allsopp"],"phonetic":"/ˈɔlˌsɑp/","extraExplanation":["“Alsop”在英语里通常被当作专有名词（人名/地名）使用，所以不像普通词汇那样有很多“同义词”。常见的相关拼写变体是“Allsop / Allsopp”。","作为姓氏时，读音在日常对话中一般重音在第一个音节：AL-sop。若你指的是某位特定人物（例如历史人物或公众人物），也可以告诉我上下文，我可以补充更准确的背景信息与常见搭配。"]}
{"word":"Alsophila","summary":{"en":"Alsophila: a scientific genus name for certain tree ferns.","zh":"Alsophila：桫椤属，部分树蕨的科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tree ferns found mainly in tropical and subtropical regions (a scientific Latin name used in biology).","zh":"（生物学用语）桫椤属；一种主要分布在热带与亚热带地区的树蕨类植物属名（拉丁学名）。"},"examples":[{"en":"Alsophila ferns can grow tall like small trees in humid forests.","zh":"桫椤属的蕨类在潮湿森林里可以长得很高，像小树一样。"},{"en":"The researcher recorded several Alsophila species during the field survey.","zh":"研究人员在野外调查中记录了几种桫椤属的物种。"}]}],"synonyms":["tree fern (common name, not a strict synonym)"],"phonetic":"/ælˈsoʊfɪlə/","extraExplanation":["“Alsophila”是植物分类学中的拉丁学名（属名），常见于学术文章、标本标签与自然纪录片中。日常英语里更常用的通俗说法是“tree fern（树蕨）”。","该词源自希腊语词根：alsos（树林/林地）+ philos（喜爱），可理解为“喜林的（植物）”，贴合其常见的森林栖息环境。","不同地区与不同时期的分类系统可能会把某些物种归入或移出Alsophila属；阅读资料时可留意其学名是否有更新或同物异名（synonym in taxonomy）。"]}
{"word":"alsophila","summary":{"en":"Alsophila is a scientific genus name for certain tropical tree ferns, though some species are now often classified as Cyathea.","zh":"Alsophila 是某些热带树蕨的属名（学名），但部分物种现在常被归入 Cyathea 属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical tree ferns (also used in older or regional classifications for some species now often placed in the genus Cyathea).","zh":"桫椤属；一种热带“树蕨”类植物的属名（在较旧或部分地区的分类中使用；一些物种现在常被归入 Cyathea 属）。"},"examples":[{"en":"Alsophila ferns can grow tall like small trees in humid forests.","zh":"桫椤属的蕨类在潮湿森林里能长得很高，看起来像小树。"},{"en":"Some books still use Alsophila as the scientific name for certain tree ferns.","zh":"一些书仍把某些树蕨的学名写作 Alsophila。"}]}],"synonyms":["tree fern","Cyathea (in many modern classifications)"],"phonetic":"/ælˈsɑːfɪlə/","extraExplanation":["“Alsophila”来自希腊语词根：alsos（树林、林地）+ philos（喜爱……的），大意为“喜爱林地的”。","在植物分类学中，属名有时会因研究进展而调整；因此你可能在不同资料里看到同一种树蕨被写作 Alsophila 或 Cyathea。"]}
{"word":"Alstead","summary":{"en":"Alstead is the name of a town in New Hampshire, USA.","zh":"Alstead 是美国新罕布什尔州的一个城镇名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a small town in Cheshire County, in the state of New Hampshire, USA.","zh":"美国新罕布什尔州（New Hampshire）柴郡（Cheshire County）的一个小镇。"},"examples":[{"en":"She grew up in Alstead, New Hampshire, before moving to Boston.","zh":"她在新罕布什尔州的阿尔斯特德长大，后来搬到波士顿。"},{"en":"We drove through Alstead on the way to the mountains.","zh":"我们去山里的路上开车经过了阿尔斯特德。"}]}],"synonyms":["(no direct synonyms; it is a proper place name)"],"phonetic":"/ˈɔl.stɛd/","extraExplanation":["“Alstead”是专有名词，通常不翻译含义，而是按读音音译（如“阿尔斯特德”）。在英语里它常见于地址、新闻、旅行路线或个人经历叙述中。","这是新英格兰地区（New England）常见的地名用法：地名常直接作名词使用，不加冠词（说“in Alstead”，而不是“in the Alstead”）。"]}
{"word":"Alston","summary":{"en":"Alston is most commonly a surname, and it is also used as a place name (notably a town in Cumbria, England).","zh":"Alston 最常见是姓氏，也可作地名（尤其指英格兰坎布里亚郡的 Alston 小镇）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surname (family name) of English origin.","zh":"一个英语来源的姓氏（家族姓）。"},"examples":[{"en":"My teacher’s last name is Alston.","zh":"我老师的姓是 Alston。"},{"en":"She introduced herself as Ms. Alston.","zh":"她自我介绍说她叫 Alston 女士。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name found in the UK (e.g., a town in Cumbria, England) and also used in names of places in the US.","zh":"一个地名：在英国可见（例如英格兰坎布里亚郡的一个小镇），在美国也常被用作地名。"},"examples":[{"en":"They visited Alston in Cumbria during their trip to northern England.","zh":"他们去英格兰北部旅行时参观了坎布里亚的 Alston。"},{"en":"I live near an area called Alston.","zh":"我住在一个叫 Alston 的地方附近。"}]}],"phonetic":"/ˈɔlstən/","extraExplanation":["“Alston”通常被当作专有名词使用（人名/地名），日常英语里一般不把它当作有普通词义的单词来解释。","发音上常见的分段感觉是“AL-stən”（重音在前），第二音节的 -ston 往往读成弱读的 /stən/。","作为姓氏时，在英语世界（尤其英美）可见于许多人的姓名中；作为地名时，英国的 Alston（坎布里亚）较有代表性。"]}
{"word":"Alstonia","summary":{"en":"Alstonia is a genus of tropical trees (including the devil tree) used in botany and sometimes noted for timber, shade, or traditional medicine.","zh":"Alstonia 指热带乔木的一个属名（黑板树属），包含黑板树等物种；常见于植物学语境，也与木材、遮荫或传统药用相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical trees (family Apocynaceae), including species such as the devil tree, often grown for timber, shade, or traditional medicinal uses in parts of Asia and the Pacific","zh":"夹竹桃科的一个热带乔木属（黑板树属），包含如黑板树等物种；在亚洲和太平洋部分地区常用于木材、遮荫或传统药用"},"examples":[{"en":"Alstonia scholaris is widely planted as a roadside shade tree in Southeast Asia.","zh":"黑板树（Alstonia scholaris）在东南亚常被作为行道遮荫树种植。"},{"en":"The botanist identified the specimen as an Alstonia species based on its milky sap and leaves.","zh":"植物学家根据它的乳白色汁液和叶片特征，将标本鉴定为黑板树属（Alstonia）的物种。"}]}],"synonyms":["devil tree (for Alstonia scholaris)","Alstonia scholaris (a common species)"],"phonetic":"/ælˈstoʊniə/","extraExplanation":["“Alstonia”是植物学中的拉丁学名（属名），通常在学术写作中斜体书写，首字母大写；指“属”而不是单一物种。具体到某一种树时，会用双名法，例如 Alstonia scholaris（黑板树）。","该属名源自18世纪苏格兰植物学家 Charles Alston 的姓氏，用于纪念他；在一些地区，部分物种与民间草药或城市绿化有关，但在使用药用信息时应以可靠来源为准。"]}
{"word":"alstonia","summary":{"en":"Alstonia is the scientific name of a genus of tropical evergreen trees (e.g., the blackboard tree).","zh":"Alstonia 指热带常绿乔木的一个植物属名（如黑板树）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical and subtropical evergreen trees in the dogbane family (Apocynaceae), including species such as the blackboard tree (Alstonia scholaris).","zh":"海檬果属（Alstonia）：夹竹桃科的一类热带/亚热带常绿乔木属，包含黑板树（Alstonia scholaris）等物种。"},"examples":[{"en":"Alstonia trees are common in parts of South and Southeast Asia.","zh":"在南亚和东南亚的一些地区，海檬果属的树很常见。"},{"en":"The leaves of Alstonia scholaris are often used in traditional medicine in some communities.","zh":"在一些社群里，黑板树（海檬果属）的叶子常用于传统医学。"}]}],"synonyms":["blackboard tree (for Alstonia scholaris)","devil tree (for Alstonia scholaris)"],"phonetic":"/ælˈstoʊniə/","extraExplanation":["“Alstonia”是以18世纪的苏格兰植物学家 Charles Alston 命名的拉丁化属名，常见于植物学/药用植物文献中。","学习提示：日常英语里更常听到具体树种名（如 blackboard tree / devil tree）而不是属名“Alstonia”；在学术或园艺语境中属名更常用。"]}
{"word":"alstonidine","summary":{"en":"Alstonidine is a plant-derived alkaloid mainly mentioned in scientific research.","zh":"Alstonidine（阿尔斯通定）是一种来源于植物的生物碱，主要见于科研文献。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an alkaloid (natural chemical compound) found in some Alstonia plants, studied in pharmacology and chemistry","zh":"阿尔斯通定（alstonidine）：一种生物碱（天然化学成分），存在于某些鸡骨常山属（Alstonia）植物中，常用于药理与化学研究"},"examples":[{"en":"Researchers isolated alstonidine from Alstonia bark to analyze its structure.","zh":"研究人员从鸡骨常山属植物的树皮中分离出阿尔斯通定，以分析其结构。"},{"en":"Alstonidine is discussed in papers about plant alkaloids and their potential biological activity.","zh":"在讨论植物生物碱及其潜在生物活性的论文中，常会提到阿尔斯通定。"}]}],"synonyms":["alkaloid","plant alkaloid","natural product (chemistry)"],"phonetic":"/ælˈstoʊnɪdiːn/","extraExplanation":["“Alstonidine”属于专业术语，日常英语中几乎不用，更多出现在天然产物化学、药物化学或植物化学的学术语境里。","词名通常来自植物属名“Alstonia”（鸡骨常山属）+ 化合物命名后缀“-idine”，常用于某些含氮生物碱的命名。不同文献对其具体分类（如吲哚类生物碱等）可能有更细的说明，需以具体研究论文为准。"]}
{"word":"alstonine","summary":{"en":"Alstonine is a plant-derived alkaloid studied in pharmacology.","zh":"Alstonine 是一种来源于植物的生物碱，常在药理学研究中出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural chemical (an indole alkaloid) found in some plants, studied in medicine and pharmacology for possible effects on the brain and other body systems","zh":"一种天然化学物质（吲哚生物碱），存在于某些植物中；在医学与药理学中被研究其对大脑及其他身体系统可能产生的作用"},"examples":[{"en":"Alstonine is an alkaloid that researchers study for its potential neuroactive effects.","zh":"Alstonine 是一种生物碱，研究人员会研究它可能具有的神经活性作用。"},{"en":"The paper reports that alstonine was isolated from a medicinal plant extract.","zh":"论文报告称从一种药用植物提取物中分离得到了 alstonine。"}]}],"synonyms":["alkaloid","indole alkaloid"],"phonetic":"/ælˈstɑːnɪn/","extraExplanation":["“Alstonine”常见于科研语境（药理学、天然产物化学、神经科学等），日常英语里很少使用。","词形来源与植物学/化学命名有关：常与夹竹桃科（Apocynaceae）某些植物属名（如 Alstonia）相关联，表示“从该类植物中得到的成分”。","作为专有的化学名词，是否需要大写通常取决于写作规范与期刊格式；在多数科学写作中以小写形式出现。"]}
{"word":"alstonite","summary":{"en":"Alstonite is a rare barium–calcium carbonate mineral.","zh":"Alstonite（阿尔斯顿石）是一种稀有的钡—钙碳酸盐矿物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (a carbonate) made mainly of barium and calcium; it often forms small crystals and is typically found in hydrothermal veins.","zh":"一种稀有矿物（碳酸盐矿物），主要由钡和钙组成；常形成细小晶体，通常产于热液矿脉中。"},"examples":[{"en":"Alstonite is a rare carbonate mineral that collectors sometimes find in hydrothermal veins.","zh":"阿尔斯顿石是一种稀有的碳酸盐矿物，收藏者有时会在热液矿脉中发现它。"},{"en":"The sample was labeled “alstonite,” indicating it contains barium and calcium carbonates.","zh":"这块标本标注为“alstonite（阿尔斯顿石）”，表示它含有钡和钙的碳酸盐成分。"}]}],"synonyms":["barium calcium carbonate mineral"],"phonetic":"/ˈælstəˌnaɪt/","extraExplanation":["“Alstonite”这个名称来自英国英格兰的 Alston Moor（阿尔斯顿荒原）地区，该矿物最早在当地被描述与命名。它在地质与矿物学语境中使用较多，日常英语中很少见。"]}
{"word":"Alstroemeria","summary":{"en":"Alstroemeria is a lily-like flowering plant often used in bouquets, also known as the Peruvian lily.","zh":"Alstroemeria 指一种花形像百合、常用于花束的开花植物，也叫“秘鲁百合/六出花”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flowering plant (often grown as a cut flower) with lily-like blooms, also called the Peruvian lily","zh":"一种开花植物（常作切花），花形像百合，也叫“秘鲁百合”"},"examples":[{"en":"She bought a bouquet of alstroemeria because it stays fresh for a long time.","zh":"她买了一束六出花（秘鲁百合），因为它能保持新鲜很久。"},{"en":"Alstroemeria comes in many colors, like pink, yellow, and white.","zh":"六出花有很多颜色，比如粉色、黄色和白色。"}]}],"synonyms":["Peruvian lily","lily of the Incas"],"phonetic":"/ˌælstroʊˈmɪriə/","extraExplanation":["“Alstroemeria”常见读法会因人而异；日常英语里很多人也直接说“Peruvian lily（秘鲁百合）”，更好记也更常用。","这种花在花语文化中常与“友谊、支持、好运”联系在一起，因此在探望、祝贺、表达感谢时很常见。","它作为切花很受欢迎的原因之一是瓶插寿命较长；但对部分人来说，汁液可能刺激皮肤，插花时注意手部清洁即可。"]}
{"word":"alstroemeria","summary":{"en":"Alstroemeria is a lily-like flowering plant often used in bouquets, also called the Peruvian lily.","zh":"Alstroemeria 指一种常用于花束、花形像百合的开花植物，也叫“秘鲁百合/六出花”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flowering plant (often sold as a cut flower) with lily-like blooms, commonly called Peruvian lily or lily of the Incas","zh":"一种开花植物（常作切花售卖），花形像百合，常称“六出花 / 秘鲁百合 / 印加百合”"},"examples":[{"en":"She bought a bouquet of alstroemeria for the dinner table.","zh":"她买了一束六出花（alstroemeria）摆在餐桌上。"},{"en":"Alstroemeria is popular in flower shops because it stays fresh for a long time.","zh":"六出花在花店很受欢迎，因为保鲜时间比较长。"}]}],"synonyms":["Peruvian lily","lily of the Incas"],"phonetic":"/ˌælstrəˈmɪriə/","extraExplanation":["“Alstroemeria”源自植物学命名，来自瑞典博物学家阿尔斯特罗默（Alströmer）的姓氏；日常英语里更常说“Peruvian lily”。","在花语和送花语境中常被用来表达“友谊、支持、彼此相伴”等含义（不同文化与花店也可能有不同解读）。","注意：对部分人来说，六出花的汁液可能引起皮肤刺激；插花或修剪时敏感人群可戴手套。"]}
{"word":"alswa","summary":{"en":"“alswa” isn’t a standard English word; it’s likely a misspelling (often of “also”).","zh":"“alswa”不是标准英语单词；很可能是拼写错误（常见是把“also”拼错）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“alswa” is not a standard English word. It is most likely a typo for “also,” or it may be a name/username.","zh":"“alswa”不是标准英语单词。它很可能是把“also”拼错了，或者是一个名字/用户名。"},"examples":[{"en":"Did you mean “also”? For example: “I also want to go.”","zh":"你是不是想写“also”？例如：“I also want to go.（我也想去。）”"},{"en":"If “alswa” is a name, please tell me the context or the sentence.","zh":"如果“alswa”是名字，请告诉我语境或完整句子。"}]}],"synonyms":["also (possible intended word)","additionally","too"],"extraExplanation":["在英语学习里，遇到不确定的拼写，可以先：1）确认是不是常见词的拼写错误（如 also）；2）把它放进完整句子看词性；3）检查是否为人名、地名、品牌或缩写。","如果你想表达“也/而且”，最常见的词是“also”；若在句首强调，也可以用“Additionally,” 或 “Moreover,”（更正式）。"]}
{"word":"alsweill","summary":{"en":"“As well” means “also/in addition,” usually placed at the end of a sentence; in negatives it can mean “either.”","zh":"“as well”表示“也/还/此外”，通常放句末；在否定句中可表示“也（不）”，相当于“either”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Likely a misspelling of) “as well”: also; in addition.","zh":"（可能是拼写错误，正确应为）as well：也；还；此外。"},"examples":[{"en":"I’m bringing my notebook, and I’ll bring a pen as well.","zh":"我会带上笔记本，也会带一支笔。"},{"en":"She speaks English, and she knows a little Spanish as well.","zh":"她会说英语，也懂一点西班牙语。"}]},{"partOfSpeech":"phrase","definition":{"en":"“As well” after a negative clause can mean “either.”","zh":"在否定句末尾，as well 可表示“也（不）”，相当于 either。"},"examples":[{"en":"I didn’t see him, and I didn’t call him as well.","zh":"我没见到他，也没给他打电话。"},{"en":"She can’t come today, and she can’t come tomorrow as well.","zh":"她今天来不了，明天也来不了。"}]}],"synonyms":["also","too","in addition","either (in negatives)"],"phonetic":"/æz ˈwɛl/","extraExplanation":["“as well”通常放在句末（I will go as well）。而“also”更常放在句中（I will also go）。","口语里，“as well”很常见，语气比“also”更随意一点。"]}
{"word":"alswith","summary":{"en":"“alswith” is not standard English; it’s likely a misspelling of “along with” or “also with.”","zh":"“alswith”不是标准英语，多半是把“along with”或“also with”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “along with” or “also with,” depending on the sentence.","zh":"不是标准英语单词。很可能是把 “along with”（连同、以及）或 “also with”（也和……一起）拼错了，具体要看句子语境。"},"examples":[{"en":"Incorrect: I brought my laptop alswith my charger.","zh":"错误：我带了笔记本电脑 alswith 充电器。"},{"en":"Correct: I brought my laptop along with my charger.","zh":"正确：我带了笔记本电脑，连同（以及）充电器。"},{"en":"Correct: She is coming, also with her sister.","zh":"正确：她会来，也会和她妹妹一起。"}]}],"synonyms":["along with","together with","as well as","also with"],"phonetic":"/ˈɔlzwɪθ/","extraExplanation":["“alswith”在常见词典里一般查不到，更多像是打字错误或非标准拼写。","如果你想表达“连同、以及”，最自然的是：along with / together with / as well as。","如果你愿意，把包含“alswith”的完整句子发我，我可以帮你判断你原本想写哪一个表达，并给出更地道的改写。"]}
{"word":"Alsworth","summary":{"en":"Alsworth is mainly a proper noun: a village in Cambridgeshire, England; it can also be a rare surname.","zh":"Alsworth 主要是专有名词：英国剑桥郡的一个村庄；也可作较少见的英文姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small village and civil parish in Cambridgeshire, England (used as a place name).","zh":"（地名）英国英格兰剑桥郡的一个小村庄与民政教区。"},"examples":[{"en":"Alsworth is a quiet village in Cambridgeshire, not far from Huntingdon.","zh":"Alsworth 是剑桥郡一个安静的村庄，离亨廷登不远。"},{"en":"They moved to Alsworth for a more rural lifestyle.","zh":"他们搬到 Alsworth，想过更乡村的生活。"}]},{"partOfSpeech":"n.","definition":{"en":"a rare family name (surname), usually connected to English place names.","zh":"（姓氏）较少见的英文姓，通常与英国地名有关联。"},"examples":[{"en":"Her last name is Alsworth, but she lives in the U.S.","zh":"她的姓是 Alsworth，但她住在美国。"}]}],"phonetic":"/ˈɔːlz.wɝθ/","extraExplanation":["“Alsworth”主要作为专有名词出现，最常见是英国剑桥郡的村名。在英文里，很多姓氏来源于地名（比如某家族原本“来自某地”），因此也可能被用作姓。","作为地名时通常不加冠词（不说 *the Alsworth*），直接说 *in Alsworth*、*near Alsworth*。"]}

