{"word":"ALT","summary":{"en":"Alt most commonly means “alternative” (often “non-mainstream”), and it can also refer to the Alt key on a keyboard.","zh":"Alt 最常见表示“alternative（替代的/非主流的）”，也可指键盘上的 Alt 键。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially online) alternative; different from the mainstream or usual choice","zh":"（尤指网络上）另类的；非主流的；替代性的"},"examples":[{"en":"She likes alt music more than pop.","zh":"她更喜欢另类音乐，而不是流行音乐。"},{"en":"This cafe has an alt vibe—quiet, artsy, and a bit unconventional.","zh":"这家咖啡馆有种另类氛围——安静、文艺、还有点不走寻常路。"}]},{"partOfSpeech":"n.","definition":{"en":"the Alt key on a computer keyboard (used with other keys for shortcuts)","zh":"（键盘上的）Alt 键（与其他按键组合使用的快捷键）"},"examples":[{"en":"Press Alt + Tab to switch windows.","zh":"按 Alt + Tab 来切换窗口。"},{"en":"Hold Alt and click to open the menu.","zh":"按住 Alt 再点击以打开菜单。"}]},{"partOfSpeech":"n.","definition":{"en":"alternative (used as an abbreviation)","zh":"alternative 的缩写：替代方案；备选项"},"examples":[{"en":"Do you have an alt plan if it rains?","zh":"如果下雨，你有备选方案吗？"},{"en":"Choose the alt route to avoid traffic.","zh":"选一条替代路线来避开拥堵。"}]}],"synonyms":["alternative","non-mainstream","unconventional"],"phonetic":"/ælt/","extraExplanation":["“alt-”常见于网络与文化领域：alt music（另类音乐）、alt fashion（另类穿搭）、alt account（小号/备用账号）。其中“alt account”在社交媒体上很常见，指不用于正式身份展示的账号。","在无障碍与网页设计中，“alt text”指图片的替代文字（给读屏软件或图片加载失败时使用）。写 alt text 时通常建议：简短、客观、描述关键信息。"]}
{"word":"alt","summary":{"en":"Alt commonly means “alternative” (an alternative plan/account) and can also refer to the Alt key on a keyboard; in technical contexts it may mean “altitude.”","zh":"Alt 常指“alternative（替代/备用）”，可表示备用方案或小号；也可指键盘上的 Alt 键；在技术语境中还可能指“altitude（高度）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially online) alternative; different from the usual or main choice.","zh":"（尤指网络用语）“替代的；另一个选择的”，不同于常规或主要选项。"},"examples":[{"en":"Do you have an alt plan if the weather gets worse?","zh":"如果天气变差，你有备用方案吗？"},{"en":"Some people use an alt account to keep their hobbies private.","zh":"有些人会用小号（备用账号）来保护自己的兴趣隐私。"}]},{"partOfSpeech":"n.","definition":{"en":"a different/secondary version, plan, or account; short for “alternative.”","zh":"备用版本、备选方案或小号账号；“alternative”的缩写。"},"examples":[{"en":"Let’s make an alt route to avoid traffic.","zh":"我们选一条备用路线来避开堵车。"},{"en":"He posted the photo on his alt.","zh":"他把照片发在他的小号上了。"}]},{"partOfSpeech":"n.","definition":{"en":"the Alt key on a computer keyboard, used with other keys to perform commands.","zh":"（键盘上的）Alt 键；与其他按键组合使用以执行指令。"},"examples":[{"en":"Press Alt + Tab to switch windows on Windows.","zh":"在 Windows 上按 Alt + Tab 可以切换窗口。"},{"en":"Hold Alt and drag to copy the item (in some programs).","zh":"在一些软件里，按住 Alt 并拖动可以复制项目。"}]},{"partOfSpeech":"other","definition":{"en":"short for “altitude” in maps, flight, or technical contexts.","zh":"（地图、飞行或技术语境）“altitude（高度）”的缩写。"},"examples":[{"en":"Current alt: 10,000 feet.","zh":"当前高度：10,000 英尺。"},{"en":"Check your alt before landing.","zh":"着陆前检查你的高度。"}]}],"synonyms":["alternative","backup","spare","secondary"],"phonetic":"/ɔlt/","extraExplanation":["“alt”最常见是“alternative”的非正式缩写，网络上经常出现在：alt account（小号/备用账号）、alt text（图片替代文字，用于无障碍与SEO）、alt rock（另类摇滚）。","键盘上的 Alt 键名称来自“alternate（备用/替代）”，表示“切换到另一种功能/命令”。","在编程/网页中，“alt”也常指 HTML 的 alt 属性（替代文本），用于图片无法显示或读屏软件朗读时提供信息。"]}
{"word":"alt-az","summary":{"en":"Alt-az refers to altitude–azimuth: a simple two-axis way to point a telescope (up–down, left–right) or describe positions in the sky.","zh":"alt-az 指“高度—方位角”：一种简单的两轴方式来指向望远镜（上下、左右），也可指用该体系描述天体位置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of telescope mount that moves in two directions: altitude (up–down) and azimuth (left–right).","zh":"一种望远镜支架（经纬式支架），可沿两个方向运动：高度（上下）与方位角（左右）。"},"examples":[{"en":"My beginner telescope uses an alt-az mount, so I move it up and down and left and right to track the Moon.","zh":"我的入门望远镜用的是 alt-az 支架，所以我需要上下、左右移动来跟踪月亮。"},{"en":"An alt-az mount is easy to learn, but tracking stars smoothly can be harder without a motor.","zh":"alt-az 支架容易上手，但如果没有电机，平滑地跟踪恒星会更难。"}]},{"partOfSpeech":"adj.","definition":{"en":"(more generally) any system or coordinates described by altitude and azimuth, especially in astronomy.","zh":"（更广义）用“高度—方位角”来描述位置的系统或坐标，尤用于天文学。"},"examples":[{"en":"The app shows the planet’s position in alt-az coordinates.","zh":"这个应用用高度—方位角（alt-az）坐标显示行星的位置。"},{"en":"We recorded the comet’s alt-az readings every five minutes.","zh":"我们每五分钟记录一次彗星的 alt-az 读数。"}]}],"synonyms":["altaz","alt-azimuth","altazimuth"],"phonetic":"/ˌæl(t)ˈæz/","extraExplanation":["“alt-az”是“altitude-azimuth”的缩写，常见于天文观测与望远镜器材说明书。","经纬式（alt-az）支架优点是结构直观、操作简单、适合观月观景与入门；缺点是用来长时间跟踪天体拍照时会出现“视场旋转”（field rotation），因此深空摄影更常用赤道仪（equatorial mount）。","在口语或器材交流中也常写作“altaz”或“alt-azimuth（altazimuth）”。"]}
{"word":"Alta","summary":{"en":"Alta is most commonly a female first name in English. It also appears in place names from Spanish/Italian, meaning “high/upper.”","zh":"Alta最常见是英文中的女性名字；也常作为地名成分，源自西班牙语/意大利语，表示“高的/上部的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a female given name (first name), used especially in the U.S. in the late 1800s–early 1900s.","zh":"女性名字（名），在美国19世纪末到20世纪初较常见。"},"examples":[{"en":"Her grandmother’s name was Alta, and the family kept it as a tradition.","zh":"她外婆叫Alta，家里把这个名字当作传统延续下来。"},{"en":"Alta moved to California when she was young.","zh":"Alta小时候搬去了加州。"}]},{"partOfSpeech":"other","definition":{"en":"(in place names) from Spanish/Italian *alta*, meaning “high; upper,” often describing higher ground or an upper area.","zh":"（用于地名）源自西班牙语/意大利语 *alta*，意思是“高的；上部的”，常用来描述地势较高或上方的区域。"},"examples":[{"en":"“Alta” in a place name often suggests the area is on higher ground.","zh":"地名里的“Alta”常暗示那一带地势更高。"},{"en":"They hiked near Alta Vista, which literally means “high view.”","zh":"他们在Alta Vista附近徒步；这个名字字面意思是“高处的景观/远眺”。"}]}],"phonetic":"/ˈæl.tə/","extraExplanation":["在英语语境里，“Alta”本身不算常见的普通词，更常见的是人名或地名成分（尤其在美国西部、拉美风格地名中）。","如果你是在某个特定句子/标题里看到“Alta”（例如公司名、学校名、缩写ALTA），把上下文发我，我可以帮你判断具体含义。"]}
{"word":"Altadena","summary":{"en":"Altadena is a community in Los Angeles County, California, just north of Pasadena.","zh":"Altadena 是美国加州洛杉矶县的一个社区，位于帕萨迪纳以北。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A community in Los Angeles County, California, located just north of Pasadena at the base of the San Gabriel Mountains.","zh":"（美国）加利福尼亚州洛杉矶县的一个社区，位于帕萨迪纳（Pasadena）以北、圣盖博山脉（San Gabriel Mountains）山脚下。"},"examples":[{"en":"She moved to Altadena because it’s close to hiking trails and Pasadena.","zh":"她搬到阿尔塔迪纳，因为那里离徒步步道和帕萨迪纳都很近。"},{"en":"The café in Altadena is a popular weekend stop for locals.","zh":"阿尔塔迪纳的那家咖啡馆是当地人周末常去的地方。"}]}],"phonetic":"/ˌɔltəˈdiːnə/","extraExplanation":["Altadena 通常被称为“社区”（community）而不是独立建制的“城市”（city），在行政上属于洛杉矶县的非建制地区（unincorporated area）。","词名常被解释为由 Spanish 影响形成：alta- 表示“高的/更高的”（类似于西语 alta），-dena 与 Pasadena 的后半部分相呼应，整体可理解为“Pasadena 上方/更高处”的意思。"]}
{"word":"Altaf","summary":{"en":"Altaf is a male given name, commonly used in South Asian and Muslim cultures, often linked to the idea of kindness or grace.","zh":"Altaf 是一个常见男性名字，多见于南亚与穆斯林文化圈，含义常与“仁慈、恩惠/眷顾”相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (first name), common in South Asia and the Muslim world; from Arabic/Urdu, often understood as meaning “kindness,” “gentleness,” or “graces/favors.”","zh":"人名（名），在南亚与穆斯林社群中常见；源自阿拉伯语/乌尔都语，常被理解为“仁慈、温柔、恩惠/眷顾”。"},"examples":[{"en":"Altaf is my classmate from Pakistan.","zh":"Altaf 是我来自巴基斯坦的同学。"},{"en":"Mr. Altaf Khan will speak at the meeting today.","zh":"Altaf Khan 先生今天将在会议上发言。"}]}],"phonetic":"/ˈæl.tɑf/","extraExplanation":["“Altaf”常见于巴基斯坦、印度、孟加拉国等地，也见于中东与海外侨民社群。作为姓名时，书写与读音可能因地区语言不同而略有差异。","在英文语境里它通常被当作专有名词使用：首字母大写，不加冠词（不说 *the Altaf*），除非用于特指某个同名的人或事物（如一本书/一家公司）。"]}
{"word":"Altai","summary":{"en":"Altai most commonly refers to the Altai Mountains and the surrounding region in Central/East Asia; it can also relate to the debated “Altaic” language-family idea.","zh":"Altai 最常指中亚与东亚交界的阿尔泰山脉及其周边地区；也可与有争议的“阿尔泰语系（Altaic）”概念相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mountain range in Central and East Asia (mainly in Russia, Mongolia, China, and Kazakhstan), often called the Altai Mountains","zh":"阿尔泰山脉：位于中亚与东亚交界（主要在俄罗斯、蒙古、中国和哈萨克斯坦）的山脉"},"examples":[{"en":"The Altai Mountains are known for their dramatic peaks and wide степpe landscapes.","zh":"阿尔泰山脉以壮丽的山峰和广阔的草原景观闻名。"},{"en":"Some rivers in Siberia originate in the Altai.","zh":"西伯利亚的一些河流发源于阿尔泰山脉。"}]},{"partOfSpeech":"n.","definition":{"en":"a region name used for places connected to the Altai Mountains (for example, the Altai Republic and Altai Krai in Russia)","zh":"阿尔泰（地区名）：指与阿尔泰山脉相关的地区名称（如俄罗斯的阿尔泰共和国、阿尔泰边疆区）"},"examples":[{"en":"She traveled through Altai to visit small villages and national parks.","zh":"她穿越阿尔泰地区，参观了一些小村庄和国家公园。"},{"en":"Altai Krai is an important agricultural area in Russia.","zh":"阿尔泰边疆区是俄罗斯重要的农业地区。"}]},{"partOfSpeech":"adj.","definition":{"en":"in linguistics, “Altaic” refers to a proposed language family sometimes associated with the Altai region (often discussed and debated today)","zh":"在语言学中，“阿尔泰语系/阿尔泰语族（Altaic）”是一个与阿尔泰地区相关的假说性语系概念（在学界常有争论）"},"examples":[{"en":"Some older books group Turkic and Mongolic languages under the Altaic hypothesis.","zh":"一些较早的书会在“阿尔泰语系”假说下把突厥语族和蒙古语族归在一起。"},{"en":"In modern linguistics classes, the Altaic idea is often presented as controversial.","zh":"在现代语言学课程中，“阿尔泰语系”常被作为有争议的观点来介绍。"}]}],"synonyms":["Altai Mountains","Altay (variant spelling)","Altaic (linguistics)"],"phonetic":"/ælˈtaɪ/","extraExplanation":["“Altai/阿尔泰”常被解释为源自突厥语或蒙古语中与“金色/黄金”相关的词根，因此阿尔泰山脉有时被称为“金山”（不同语言与解释略有差异）。","文化与历史上，阿尔泰地区是欧亚草原文化交流的重要地带，与游牧传统、丝绸之路北线、以及多民族共居的历史有关。","注意拼写：Altai（地名/山脉/地区）；Altaic（语言学术语，更常见于讨论“阿尔泰语系假说”）。"]}
{"word":"Altai-related","summary":{"en":"“Altai-related” means connected with the Altai region (especially the Altai Mountains) or its peoples, languages, and culture.","zh":"“Altai-related”表示与阿尔泰地区（尤指阿尔泰山脉）及其民族、语言和文化有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with the Altai region (especially the Altai Mountains in Central and East Asia), its peoples, languages, or culture","zh":"与阿尔泰地区（尤指中亚与东亚的阿尔泰山脉）及其民族、语言或文化有关的"},"examples":[{"en":"Researchers compared several Altai-related languages to look for shared vocabulary.","zh":"研究人员比较了几种与阿尔泰相关的语言，以寻找共同词汇。"},{"en":"The museum has an exhibit of Altai-related musical instruments and clothing.","zh":"这家博物馆有一个展览，展示与阿尔泰相关的乐器和服饰。"},{"en":"She specializes in Altai-related history along the ancient trade routes.","zh":"她专攻古代商路沿线的阿尔泰相关历史。"}]}],"synonyms":["Altai-associated","Altai-connected","Altai-region-related"],"phonetic":"/ælˈtaɪ rɪˈleɪtɪd/","extraExplanation":["“Altai”常指“阿尔泰山脉”及其周边区域，地理上跨越俄罗斯、蒙古、中国与哈萨克斯坦等地。因此“Altai-related”可用于学术或新闻语境，表示与该地区的地理、民族（如阿尔泰人/突厥语族相关社群）、考古与文化传统等有关。","在语言学里，你也可能看到“Altaic（阿尔泰语系/假说）”。需要注意：把突厥语、蒙古语、通古斯语等归为同一语系的“阿尔泰语系”在学界有争议；而“Altai-related”更中性，通常只表示“与阿尔泰地区或相关研究有关”。"]}
{"word":"Altaian","summary":{"en":"Altaian describes the Altai region, its people, or the Altaian (Altai) Turkic language.","zh":"Altaian 指与阿尔泰地区有关的事物，也可指阿尔泰人或阿尔泰语（突厥语族）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Altai Mountains or the Altai region in Central and East Asia","zh":"与阿尔泰山脉或中亚、东北亚的阿尔泰地区有关的"},"examples":[{"en":"The museum has Altaian artifacts from the Altai region.","zh":"这家博物馆收藏了来自阿尔泰地区的阿尔泰相关文物。"},{"en":"Altaian landscapes are known for mountains, rivers, and steppe grasslands.","zh":"阿尔泰地区的风景以群山、河流和草原闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from the Altai region, especially a member of an Indigenous group there","zh":"阿尔泰地区的人（尤指当地原住民族成员）"},"examples":[{"en":"She interviewed an Altaian about traditional music and storytelling.","zh":"她采访了一位阿尔泰人，了解传统音乐与口述故事。"}]},{"partOfSpeech":"n.","definition":{"en":"the Altaian language (also called Altai), a Turkic language spoken mainly in Russia’s Altai Republic","zh":"阿尔泰语（也称 Altai），一种突厥语族语言，主要在俄罗斯阿尔泰共和国使用"},"examples":[{"en":"He is studying Altaian as part of a Turkic language program.","zh":"他在突厥语课程中学习阿尔泰语。"},{"en":"Some local schools offer classes in Altaian alongside Russian.","zh":"一些当地学校开设阿尔泰语课程，并与俄语一起教授。"}]}],"synonyms":["Altai","Altai-related"],"phonetic":"/ælˈtaɪ.ən/","extraExplanation":["“Altaian”来自“Altai（阿尔泰）”。阿尔泰山脉横跨俄罗斯、蒙古、中国和哈萨克斯坦一带，因此“Altaian”既可指地理区域，也可指当地民族文化与语言。","在语言学里你可能会看到“Altaic（阿尔泰语系）”这个说法，曾尝试把突厥语、蒙古语、通古斯语（有时还包括韩语、日语）归为同一语系；但这种“语系同源”的观点在学界争议较大。注意区分：Altaian（阿尔泰的/阿尔泰人/阿尔泰语）≠ Altaic（有争议的宏观语系概念）。"]}
{"word":"altaian","summary":{"en":"Altaian refers to the Altai region (people, culture, or language), especially in and around the Altai Mountains.","zh":"Altaian 指与阿尔泰地区（尤其阿尔泰山脉）相关的事物，可表示当地的人、文化或语言（阿尔泰语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Altai region or the Altai Mountains in Central and East Asia.","zh":"（与）阿尔泰地区或阿尔泰山脉（位于中亚与东亚交界）有关的。"},"examples":[{"en":"The expedition crossed Altaian valleys near the Altai Mountains.","zh":"探险队穿越了阿尔泰山脉附近的阿尔泰山谷。"},{"en":"Some Altaian traditions are closely tied to the mountains and rivers of the region.","zh":"一些阿尔泰地区的传统与当地的山川密切相关。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from the Altai region, especially an Indigenous Turkic-speaking people of the Russian Altai.","zh":"阿尔泰人；指来自阿尔泰地区的人，尤指俄罗斯阿尔泰地区的突厥语族原住民族群。"},"examples":[{"en":"She interviewed Altaian elders about local oral history.","zh":"她采访了阿尔泰族长者，了解当地的口述历史。"}]},{"partOfSpeech":"n.","definition":{"en":"The Altai language(s), especially Southern Altai, spoken in the Altai Republic of Russia.","zh":"阿尔泰语（尤指南阿尔泰语）；主要在俄罗斯阿尔泰共和国使用的语言。"},"examples":[{"en":"He is learning Altaian to communicate with his grandparents.","zh":"他在学习阿尔泰语，以便和祖父母交流。"},{"en":"The museum includes recordings of songs in Altaian.","zh":"博物馆里有用阿尔泰语演唱的歌曲录音。"}]}],"synonyms":["Altai","Altai (adj./n.)","Southern Altai (language)"],"phonetic":"/ælˈtaɪ.ən/","extraExplanation":["“Altaian”来自“Altai（阿尔泰）”。阿尔泰山脉横跨俄罗斯、蒙古、中国（新疆）和哈萨克斯坦交界附近，因此“Altaian”既可指地理与文化，也可能指当地民族与语言。","有时你会在语言学语境中看到“Altaic（阿尔泰语系）”这一说法，用来把突厥语、蒙古语、通古斯语（有时还包括韩语、日语）放在同一“语系/语族”里比较。但“阿尔泰语系”作为严格的亲缘语系假说存在争议；在学术写作中需要区分“Altaian（阿尔泰地区/语言）”与“Altaic（阿尔泰语系假说）”。","大小写很重要：通常“Altaian”作为专名（民族/语言/地区相关）要大写。"]}
{"word":"Altaic","summary":{"en":"Altaic means “related to the Altai region,” and in linguistics it often refers to a debated hypothesis grouping Turkic, Mongolic, and sometimes Tungusic languages.","zh":"Altaic 指“与阿尔泰地区有关的”；在语言学中常指一个有争议的假说，用来把突厥、蒙古及有时通古斯诸语言归为一类。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Altai Mountains/Altai region in Central and North Asia, or to the peoples and cultures historically connected with that area.","zh":"与中亚和北亚的阿尔泰山脉/阿尔泰地区有关的，或与历史上与该地区相关的民族与文化有关的。"},"examples":[{"en":"The museum has an exhibit on Altaic cultures from the Altai region.","zh":"这家博物馆有一个关于阿尔泰地区阿尔泰文化的展览。"},{"en":"Researchers collected folktales from Altaic communities.","zh":"研究人员从阿尔泰社群收集了民间故事。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Linguistics) Relating to the proposed “Altaic” language family, often used to group Turkic, Mongolic, and sometimes Tungusic languages (and occasionally others) based on suggested similarities.","zh":"（语言学）与“阿尔泰语系/阿尔泰语族”这一假设性分类有关；常用来把突厥语族、蒙古语族，有时也包括通古斯语族（偶尔还会扩展到其他语言）归为一类，基于一些被认为相似的特征。"},"examples":[{"en":"Some older textbooks describe Turkish and Mongolian as Altaic languages.","zh":"一些较早的教材把土耳其语和蒙古语称为阿尔泰语系语言。"},{"en":"The paper discusses whether “Altaic” is a useful label for these language groups.","zh":"这篇论文讨论“阿尔泰语系”作为这些语言群的标签是否有用。"}]},{"partOfSpeech":"n.","definition":{"en":"The proposed Altaic language family (as a concept in linguistics).","zh":"（语言学概念）所谓“阿尔泰语系/阿尔泰语族”。"},"examples":[{"en":"Altaic is still debated in historical linguistics.","zh":"在历史语言学中，“阿尔泰语系”仍然存在争议。"}]}],"synonyms":["Altai","Turkic (in some contexts)","Mongolic (in some contexts)","Tungusic (in some contexts)"],"phonetic":"/ælˈteɪ.ɪk/","extraExplanation":["“Altaic（阿尔泰）语系”在现代语言学里常被视为有争议的假说：一些相似之处可能来自长期接触、借词和语言趋同（areal influence），而不一定证明它们有共同祖先。因此在学术写作中，你可能会看到更谨慎的说法，如“Turkic, Mongolic, and Tungusic language groups”（突厥/蒙古/通古斯诸语群），而不是直接说它们同属一个确定的语系。","词源上，“Altaic”来自“Altai（阿尔泰）”，该名称常被用于地理与民族文化语境；在语言学语境中使用时，最好注意作者是否把它当作“假设分类”或“已确定的语系”。"]}
{"word":"Altaid","summary":{"en":"Altaid refers to something of or related to the Altaids, a major Central Asian mountain-building (orogenic) belt.","zh":"Altaid 指“阿尔泰造山带（Altaids）”的、或与之相关的地质/区域概念（中亚重要造山带）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Altaids; also, something connected with the Altaids (a major mountain-building region in Central Asia).","zh":"阿尔泰造山带（Altaids）的一员；也可指与阿尔泰造山带相关的人、事或地质对象（中亚重要的造山带/造山区域）。"},"examples":[{"en":"Some geologists study Altaid terranes to understand how continents grew in Central Asia.","zh":"一些地质学家研究阿尔泰造山带的地体（Altaid terranes），以了解中亚大陆是如何增生扩大的。"},{"en":"The paper compares Altaid rocks with those from nearby orogenic belts.","zh":"这篇论文将阿尔泰造山带的岩石与附近其他造山带的岩石进行比较。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Altaids (the Central Asian Orogenic Belt).","zh":"（形容词）与阿尔泰造山带（中亚造山带）有关的。"},"examples":[{"en":"Researchers mapped Altaid structures using satellite data.","zh":"研究人员利用卫星数据绘制了阿尔泰造山带相关构造。"}]}],"synonyms":["Central Asian Orogenic Belt","Altaids"],"phonetic":"/ˈæl.teɪd/","extraExplanation":["“Altaid/Altaids”多见于地质学与板块构造学语境，常与“Central Asian Orogenic Belt（中亚造山带）”近义或互指，讨论主题包括地体拼贴、俯冲-碰撞、花岗岩活动与大陆增生等。","词源上与“Altai（阿尔泰）”有关：该区域名称来自阿尔泰山与周边中亚地区；学术写作中更常见复数形式“Altaids”。"]}
{"word":"altaid","summary":{"en":"“Altaid” is an older linguistics term meaning “Altaic,” used for languages once thought to form one family (e.g., Turkic, Mongolic, Tungusic).","zh":"“Altaid”是语言学里的较旧术语，意为“阿尔泰（语系）的”，指曾被认为同属一语系的语言（如突厥、蒙古、通古斯）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Linguistics) relating to the (now largely rejected) “Altaic” language family hypothesis; used especially in older academic writing.","zh":"（语言学）与（如今多被否定的）“阿尔泰语系/阿尔泰语假说”有关；多见于较早的学术写作。"},"examples":[{"en":"Some 20th‑century books discuss “Altaid” languages such as Turkic, Mongolic, and Tungusic.","zh":"一些20世纪的书会讨论“Altaid（阿尔泰语系）”语言，比如突厥语族、蒙古语族和通古斯语族。"},{"en":"The article calls this an Altaid hypothesis rather than a proven family tree.","zh":"这篇文章把它称为Altaid（阿尔泰）假说，而不是被证实的谱系。"}]},{"partOfSpeech":"n.","definition":{"en":"a language (or language group) considered “Altaic” under that older hypothesis.","zh":"（旧假说下）被归为“阿尔泰语系”的一种语言（或语群）。"},"examples":[{"en":"The author lists Korean as an Altaid, but many modern linguists disagree.","zh":"作者把韩语列为一种Altaid（阿尔泰）语言，但许多现代语言学家并不同意。"},{"en":"In that framework, several Altaids were thought to share a common origin.","zh":"在那套框架里，一些Altaids（阿尔泰语言）被认为有共同起源。"}]}],"synonyms":["Altaic (older/related usage)"],"phonetic":"/ælˈtaɪd/","extraExplanation":["“Altaid”主要是学术语境里的旧用法，常与“Altaic（阿尔泰语系）”相关。现代主流观点通常认为：突厥语族、蒙古语族、通古斯语族之间的相似之处，很多可用长期接触、借词与语言趋同来解释，而不一定需要假定它们来自同一个共同祖语。","如果你其实想查的是“Altai（阿尔泰）”（指阿尔泰山脉/阿尔泰地区）或“Altaic（阿尔泰语系的）”，告诉我你看到它的句子或来源，我可以按语境给出最合适的词条。"]}
{"word":"Altaids","summary":{"en":"Altaids: languages sometimes grouped under the (controversial) Altaic language-family hypothesis.","zh":"Altaids：在“阿尔泰语系”这一（有争议的）语系假说中被归为一类的语言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A proposed (and controversial) language family thought to include Turkic, Mongolic, and Tungusic languages; sometimes also Koreanic and Japonic. The term is mostly used in historical linguistics discussions.","zh":"“阿尔泰语系”假说中的成员语言（有争议）。一般指可能包括突厥语族、蒙古语族和通古斯语族；有时也把韩语、日语纳入。该词多用于历史语言学讨论。"},"examples":[{"en":"Some older textbooks describe Turkic, Mongolic, and Tungusic languages as Altaids.","zh":"一些较早的教材把突厥语、蒙古语和通古斯语称为“阿尔泰语系（Altaids）”成员。"},{"en":"Many linguists today avoid the term Altaids because the Altaic family is not widely accepted.","zh":"如今很多语言学家会避免使用 Altaids，因为“阿尔泰语系”并未被广泛认可。"}]}],"synonyms":["Altaic languages","Turkic languages","Mongolic languages","Tungusic languages"],"phonetic":"/ælˈtaɪ.ɪdz/","extraExplanation":["“Altaids”是“Altaic（阿尔泰语系）”的衍生说法，通常指被归入该语系假说的语言或语言群体。现代研究中，更常见、也更中性的写法是直接说“Turkic, Mongolic, and Tungusic languages（突厥语族、蒙古语族、通古斯语族）”，而不是把它们统称为一个语系。","争议点主要在于：这些语言之间的相似性可能来自长期接触与相互影响（语言接触、借词、结构趋同），而不一定来自共同祖先语言。","词源上，“Altaic”来自中亚的阿尔泰山（Altai Mountains）。在一些学术写作中，你也可能看到“Macro-Altaic（宏阿尔泰）”或把韩语、日语纳入的更大范围说法，但接受度更低。"]}
{"word":"Altair","summary":{"en":"Altair is a bright star in Aquila and a key point in the Summer Triangle; it’s also used as a personal or fictional name.","zh":"Altair 指天鹰座的亮星“牛郎星”，也是“夏季大三角”的重要成员；它也常被用作人名或虚构角色名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Altair: a bright star in the constellation Aquila (the Eagle); it is one of the three stars in the “Summer Triangle.”","zh":"牛郎星：天鹰座中一颗非常明亮的恒星，也是“夏季大三角”的三颗星之一。"},"examples":[{"en":"Altair is easy to spot on summer nights because it shines brightly near the Milky Way.","zh":"夏夜里很容易找到牛郎星，因为它在银河附近非常明亮。"},{"en":"In the Summer Triangle, Altair forms a large triangle with Vega and Deneb.","zh":"在“夏季大三角”中，牛郎星与织女星和天津四共同组成一个大三角形。"}]},{"partOfSpeech":"n.","definition":{"en":"Altair (name): a given name used for people, characters, and brands, often chosen for its astronomical connection.","zh":"“Altair”（人名/名称）：可用作人名、角色名或品牌名，常因其与天文学的关联而被采用。"},"examples":[{"en":"The novelist named the hero Altair to suggest a calm, distant brightness.","zh":"小说家把主角命名为 Altair，以暗示一种沉静而遥远的光芒。"},{"en":"Altair is also used as a name in video games and science-fiction stories.","zh":"Altair 也常被用在电子游戏和科幻故事中作为名字。"}]}],"synonyms":["Alpha Aquilae","牛郎星"],"phonetic":"/ælˈtɛr/","extraExplanation":["“Altair”源自阿拉伯语名称（常被解释为“飞翔的鹰”之意），对应天鹰座α星（Alpha Aquilae）。在中文文化语境中，它常被称为“牛郎星”，与“织女星”（Vega）相关联，用于民间传说与节日意象（如七夕）。","天文学里“夏季大三角”（Summer Triangle）通常指织女星（Vega）、天津四（Deneb）与牛郎星（Altair）三颗亮星构成的醒目图形，便于观星入门。"]}
{"word":"altaite","summary":{"en":"Altaite is a rare mineral: lead telluride (PbTe).","zh":"Altaite 是一种较罕见的矿物：碲化铅（PbTe）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral made of lead telluride (PbTe), typically found in hydrothermal ore deposits.","zh":"一种较罕见的矿物——碲化铅（PbTe），通常产于热液矿床中。"},"examples":[{"en":"Altaite is studied because it contains tellurium, a valuable element in some technologies.","zh":"由于含有碲这种在某些技术中很有价值的元素，altaite 常被研究。"},{"en":"The sample was identified as altaite after a lab test confirmed it was lead telluride.","zh":"实验室检测确认它是碲化铅后，这个样品被鉴定为 altaite。"}]}],"synonyms":["lead telluride"],"phonetic":"/ˈæl.tə.aɪt/","extraExplanation":["Altaite 的名称来自阿尔泰（Altai）地区/阿尔泰山脉一带的发现记录，因此是典型的“以地名命名”的矿物名。","在英文里它常出现在地质、矿物学或矿床学的文章中；日常英语中几乎不用。阅读科普或论文时，可把它理解为“碲化铅矿物”。"]}
{"word":"Altaloma","summary":{"en":"Altaloma usually refers to Alta Loma, a place name in Southern California; the Spanish-based meaning is “high hill.”","zh":"Altaloma 通常指地名 Alta Loma（南加州一带）；词源来自西班牙语，大意为“高地/高丘”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a place name (proper noun), most commonly referring to Alta Loma, a community/neighborhood in Southern California (now part of Rancho Cucamonga, California).","zh":"地名（专有名词），最常见指美国南加州的 Alta Loma 社区/地名（现多作为加州兰乔库卡蒙加市 Rancho Cucamonga 的一部分）。"},"examples":[{"en":"I grew up in Alta Loma, near Rancho Cucamonga.","zh":"我在阿尔塔洛马（Alta Loma）长大，靠近兰乔库卡蒙加。"},{"en":"The meeting is at the Alta Loma library.","zh":"会议在阿尔塔洛马图书馆举行。"}]}],"synonyms":["Alta Loma"],"phonetic":"/ˌæl.tə ˈloʊ.mə/","extraExplanation":["“Alta Loma”源自西班牙语：alta（高的）+ loma（小山、丘陵），大致意思是“高地/高丘”。因此在美国西南部（受西班牙语影响较强的地区）会见到类似地名。","你写的“Altaloma”常见于把“Alta Loma”连写成一个词的情况；正式写法多为分开两词：Alta Loma。"]}
{"word":"altaltissimo","summary":{"en":"Altaltissimo is an informal music term meaning “even higher than altissimo,” used for extremely high notes or register (often on woodwinds).","zh":"Altaltissimo 是音乐里的非正式说法，意思是“比超高音（altissimo）还高”，常指木管乐器上极高的音或音域。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(music, informal) Extremely high notes—higher than the normal “altissimo” register, especially when talking about woodwinds like the saxophone or clarinet.","zh":"（音乐，非正式用法）极高音域——比“altissimo（超高音域）”还要更高的音，常用于描述萨克斯、单簧管等木管乐器的超高音。"},"examples":[{"en":"That solo goes into altaltissimo at the end, way above the written range.","zh":"那段独奏最后进到了超超高音域，远远超过了谱面常规音域。"},{"en":"He can hit altaltissimo notes on tenor sax with a really focused embouchure.","zh":"他用很集中的口型（embouchure）能在次中音萨克斯上吹出超超高音。"}]},{"partOfSpeech":"other","definition":{"en":"A playful or exaggerated way to say “even higher than altissimo.”","zh":"一种带点玩笑或夸张的说法，意思是“比超高音还要更高”。"},"examples":[{"en":"I thought it was altissimo, but she went altaltissimo for the final scream note.","zh":"我以为那已经是超高音了，但她最后那个“尖叫音”又更上一层——超超高音。"}]}],"synonyms":["extreme high register","super-altissimo","very high register"],"phonetic":"/ˌælt ˌæltoʊˈsɪsɪmoʊ/","extraExplanation":["“Altissimo”来自意大利语，字面意思是“最高的”。“Altaltissimo”并不是严格的标准术语，更常见于乐手口语或教学/论坛语境，用来强调“高到离谱”的音区。","在萨克斯等乐器上，所谓 altissimo/更高音区往往依赖泛音、特殊指法、口型控制与气息支持；不同教材可能对音区划分不完全一致。"]}
{"word":"Altamahaw","summary":{"en":"Altamahaw is a place name: a small community in North Carolina, USA, and it also appears in local institution names and addresses.","zh":"Altamahaw 是一个地名：美国北卡罗来纳州的一个小社区，也常出现在当地机构名称和地址中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small unincorporated community in Alamance County, North Carolina, USA.","zh":"美国北卡罗来纳州阿拉曼斯县的一个小型非建制社区（地名）。"},"examples":[{"en":"She grew up near Altamahaw, North Carolina.","zh":"她在北卡罗来纳州的 Altamahaw 附近长大。"},{"en":"The church in Altamahaw is a local landmark.","zh":"Altamahaw 的那座教堂是当地地标。"}]},{"partOfSpeech":"other","definition":{"en":"Used as a place name in local institutions and addresses (e.g., “Altamahaw” in the name of a church, school, or road).","zh":"用于当地机构名称或地址中的地名用法（例如教堂、学校或道路名称里的“Altamahaw”）。"},"examples":[{"en":"The event is hosted by the Altamahaw community center.","zh":"这次活动由 Altamahaw 社区中心举办。"},{"en":"Please mail the form to the Altamahaw address listed on the website.","zh":"请将表格寄到网站上列出的 Altamahaw 地址。"}]}],"synonyms":["Altamahaw, NC","Altamahaw-Ossipee (area name used locally)"],"phonetic":"/ˌɔltəməˈhɔ/","extraExplanation":["“Altamahaw”属于美国东南部常见的地名类型，许多此类地名源自原住民语言或早期殖民时期的转写拼法，因此拼写较独特、读音也容易让学习者不确定。","在书写中它通常首字母大写（专有名词），常与州名或县名连用以避免与其他地名混淆（如“Altamahaw, NC”）。"]}
{"word":"Altamahaw-Ossipee","summary":{"en":"Altamahaw-Ossipee is a proper name for a community/area in Alamance County, North Carolina.","zh":"Altamahaw–Ossipee 是美国北卡罗来纳州阿拉曼斯县的一个社区/区域名称（连字符合称）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hyphenated proper name referring to the Altamahaw-Ossipee area/community in Alamance County, North Carolina, USA (commonly associated with local places such as Altamahaw-Ossipee Elementary School).","zh":"（专有名词）美国北卡罗来纳州阿拉曼斯县的“Altamahaw–Ossipee”地区/社区的合称（常见于当地机构名称，如 Altamahaw–Ossipee 小学等）。"},"examples":[{"en":"My cousin went to Altamahaw-Ossipee Elementary School in Alamance County.","zh":"我表弟在阿拉曼斯县的 Altamahaw–Ossipee 小学上学。"},{"en":"The festival draws families from the Altamahaw-Ossipee area.","zh":"这个节日吸引了来自 Altamahaw–Ossipee 一带的家庭。"}]}],"synonyms":["Altamahaw–Ossipee area","Altamahaw-Ossipee community"],"phonetic":"/ˌæl.tə.məˈhɔ ˌɑ.səˈpi/","extraExplanation":["这是一个“连字符（hyphenated）地名/区域名”，把两个相邻或相关的地名（Altamahaw 与 Ossipee）并列，常用于学校、社区组织或服务范围的称呼。","发音时通常按两个部分分别读：Altamahaw /ˌæl.tə.məˈhɔ/ 与 Ossipee /ˌɑː.səˈpiː/（不同地区会有轻微差异）。","这类地名在美国东南部较常见，常与原住民语言或早期定居历史有关；实际拼写与读音可能保留了历史用法。"]}
{"word":"Altamira","summary":{"en":"Altamira usually refers to the famous Spanish cave with prehistoric paintings, and it can also be a place name in the Spanish-speaking world and beyond.","zh":"Altamira通常指西班牙以史前壁画闻名的阿尔塔米拉洞穴，也可作多地的地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a famous cave in northern Spain (Cantabria) known for its prehistoric Paleolithic rock paintings; often used to refer to the “Altamira cave paintings.”","zh":"西班牙北部（坎塔布里亚）的著名洞穴，以旧石器时代史前岩画闻名；也常用来指“阿尔塔米拉洞穴壁画”。"},"examples":[{"en":"The Altamira paintings are among the best-known examples of Paleolithic art.","zh":"阿尔塔米拉壁画是最知名的旧石器时代艺术代表之一。"},{"en":"Because the original cave is protected, visitors often see a replica instead of Altamira itself.","zh":"由于原洞受到保护，游客通常参观的是复制洞而非阿尔塔米拉本洞。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used for several cities and towns, especially in Spain and Latin America (e.g., Altamira in Pará, Brazil).","zh":"地名：用于多个城市和城镇名称，尤其见于西班牙与拉丁美洲（如巴西帕拉州的阿尔塔米拉）。"},"examples":[{"en":"She moved to Altamira, Brazil, for work.","zh":"她因工作搬到了巴西的阿尔塔米拉。"}]}],"synonyms":["Altamira Cave","Altamira cave paintings","Cave of Altamira"],"phonetic":"/ˌæl.təˈmɪr.ə/","extraExplanation":["“Altamira”在西班牙语中常被解释为“alta（高的）+ mira（眺望/瞭望处）”，可理解为“高处的眺望点”。","阿尔塔米拉洞穴壁画在19世纪末被提出后，最初曾遭质疑，后来随着更多史前洞穴艺术的发现才被学界广泛承认。如今出于保护目的，原洞长期限制或关闭参观，常以博物馆与复制洞（neocave）形式对公众展示。"]}
{"word":"Altamont","summary":{"en":"Altamont is mainly a proper noun used as a U.S. place name (notably in New York and California), and it can also be a surname.","zh":"Altamont 主要是专有名词，多用作美国地名（尤其纽约与加州），也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name used for several locations in the U.S., especially Altamont (a village in New York) and Altamont Pass (a mountain pass in California).","zh":"（专有名词）美国多处地名，较常见的有纽约州的阿尔塔蒙特（Altamont，村庄）以及加利福尼亚州的阿尔塔蒙特山口（Altamont Pass）。"},"examples":[{"en":"She grew up near Altamont, New York.","zh":"她在纽约州阿尔塔蒙特附近长大。"},{"en":"The wind turbines at Altamont Pass are visible from the highway.","zh":"从高速公路上能看到阿尔塔蒙特山口的风力发电机。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname) found in English-speaking contexts.","zh":"（专有名词）一个姓氏，在英语语境中可见。"},"examples":[{"en":"Dr. Altamont will speak at the conference today.","zh":"Altamont 医生今天将在会议上发言。"}]}],"synonyms":["(place name) — (no true synonyms; common related pattern: names with Alto-/Mont-)"],"phonetic":"/ˈɔl.tə.mɑnt/","extraExplanation":["“Altamont”在流行文化中常让人联想到 1969 年的“Altamont Free Concert”（阿尔塔蒙特免费音乐会），这是美国摇滚史上著名且具争议的事件之一，常被拿来与 1969 年的伍德斯托克（Woodstock）作对比。","词源上常被解释为由拉丁语系元素组合而来，含义接近“高山/高处”（alto=高，mont=山），因此在地名中很常见。"]}
{"word":"altar","summary":{"en":"An altar is a sacred table or platform used in religious worship, and it can also mean the place where a couple stands during a wedding ceremony.","zh":"altar 指宗教礼拜用的祭坛/供桌，也可指婚礼中新人宣誓站立的地方（常在祭坛前）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A raised table or platform used for religious worship, where offerings are made or ceremonies are performed.","zh":"（宗教）祭坛；用于礼拜、献祭或举行仪式的台/桌。"},"examples":[{"en":"They placed flowers and candles on the altar.","zh":"他们把花和蜡烛放在祭坛上。"},{"en":"The priest stood at the altar during the wedding ceremony.","zh":"婚礼仪式中，神父站在祭坛前。"}]},{"partOfSpeech":"n.","definition":{"en":"In a wedding, the front area of a church or venue where the couple stands and makes vows.","zh":"（婚礼中）宣誓处；新人站立并宣誓的前方区域（常在教堂祭坛前）。"},"examples":[{"en":"She walked down the aisle toward the altar.","zh":"她沿着过道走向宣誓处（祭坛前）。"},{"en":"They met at the altar and exchanged rings.","zh":"他们在宣誓处相见并交换戒指。"}]}],"synonyms":["shrine","sanctuary","chancel","communion table"],"phonetic":"/ˈɔltɚ/","extraExplanation":["“altar”常与“alter（改变）”混淆：两者发音相近但意思完全不同。记忆小技巧：altAR 里有“AR”，可联想到“ARea（区域）”——礼拜/仪式的区域；而 altER 以“ER”结尾更像“changeR（改变者）”。","在基督教语境中，altar 常与“communion / Eucharist（圣餐）”相关；在更广泛的文化中，也可指各类宗教或家庭祭祀中的供奉台（如“家庭祭坛/神龛”可译作 home altar）。"]}
{"word":"altar-related","summary":{"en":"“Altar-related” means connected with an altar or used for altar worship/ceremonies.","zh":"“altar-related”指与祭坛有关，或用于祭坛敬拜/仪式的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with an altar (a special table or place used in religious worship), or used near/for an altar","zh":"与祭坛有关的；用于祭坛附近或祭坛仪式的"},"examples":[{"en":"The museum displayed altar-related objects from ancient temples.","zh":"博物馆展出了来自古代神庙的祭坛相关物品。"},{"en":"Only trained staff can handle altar-related items during the ceremony.","zh":"仪式期间只有受过训练的工作人员可以处理祭坛相关物品。"},{"en":"We need to keep altar-related areas quiet and respectful.","zh":"我们需要保持祭坛相关区域安静并尊重。"}]}],"synonyms":["related to the altar","altar-associated","altar-linked","ceremonial (in some contexts)"],"phonetic":"/ˈɔl.tɚ rɪˌleɪ.tɪd/","extraExplanation":["“altar-related”是由名词“altar（祭坛）”+ “related（相关的）”构成的复合形容词，常用连字符连接，尤其在作定语时更常见：altar-related objects。","在正式或学术语境（博物馆说明、宗教研究、历史写作）中更常见；日常口语里也可以改说“related to the altar”来更自然、更清楚。","注意语气与文化敏感性：谈到宗教场所或物品时，常搭配 respectful, sacred, ceremonial 等词，表达尊重。"]}
{"word":"altarage","summary":{"en":"Altarage is an old word meaning altar-related worship or duties (and sometimes the altar furnishings as a group).","zh":"altarage 是较古旧的词，指与祭坛有关的礼仪/职责，也可指祭坛陈设等的统称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The service, worship, or duties connected with an altar (often in a church); altar service.","zh":"（多用于教会语境）与祭坛有关的礼仪、崇拜或职责；祭坛礼拜。"},"examples":[{"en":"In medieval records, the priest’s responsibilities included the altarage of the chapel.","zh":"在中世纪的记录中，神父的职责包括小礼拜堂的祭坛礼仪工作。"},{"en":"The document mentions payments for altarage and other church duties.","zh":"文件提到为祭坛礼仪以及其他教会事务支付的费用。"}]},{"partOfSpeech":"n.","definition":{"en":"Altars or altar furnishings collectively (an older, less common sense).","zh":"（较旧且少见）统称祭坛或祭坛的器具与陈设。"},"examples":[{"en":"The inventory lists the altarage along with candles and vessels.","zh":"清单把祭坛陈设与蜡烛、圣器一起列出。"}]}],"synonyms":["altar service","altar duties","worship","liturgy (contextual)","altar furnishings (for the older sense)"],"phonetic":"/ˈɔl.tə.rɪdʒ/","extraExplanation":["“altarage”属于较古旧/书面词，常见于中世纪或早期近代的教会档案、财产清单与法规文本中。现代英语里更常用的表达通常是“altar service / altar duties / worship at the altar”或更具体的“altar furnishings”。"]}
{"word":"altared","summary":{"en":"“Altared” is a rare word meaning “having/related to an altar,” and it can very rarely mean “placed on an altar.” It’s often confused with “altered” (= changed).","zh":"“altared”很罕见，主要指“有祭坛的/与祭坛有关的”，极少也可指“放在祭坛上/献祭”。它常与“altered”（=改变了的）混淆。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare/archaic) Having an altar; furnished with an altar; connected with worship at an altar.","zh":"（罕见/古语）有祭坛的；设有祭坛的；与祭坛礼拜有关的。"},"examples":[{"en":"The old church is richly altared, with carvings around the altar.","zh":"这座老教堂祭坛装饰华丽，祭坛周围有许多雕刻。"},{"en":"In the poem, the “altared space” suggests a holy, protected place.","zh":"在诗中，“有祭坛的空间”暗示一个神圣、受庇护的地方。"}]},{"partOfSpeech":"v.","definition":{"en":"(very rare) Past tense/past participle of “to altar”: to place or offer something on an altar.","zh":"（极罕见）动词“altar”的过去式/过去分词：把某物放在祭坛上，或在祭坛上献祭。"},"examples":[{"en":"They altared the gifts before the ceremony began.","zh":"仪式开始前，他们把礼物放在祭坛上。"},{"en":"A lamb was altared in the ancient rite (historical context).","zh":"在古代仪式中，一只羔羊被献于祭坛（历史语境）。"}]}],"synonyms":["altar-related","consecrated (context-dependent)","sanctified (context-dependent)"],"phonetic":"ˈɔltərd","extraExplanation":["“altared”在现代英语中非常少见。日常写作里更常见的是“altered”（改变了的）。两者发音相近，容易拼错：\n- altered = changed（改变）\n- altared = related to an altar（与祭坛有关）\n如果你想表达“被改变”，通常应写 altered。"]}
{"word":"altarist","summary":{"en":"An altarist is a person who serves or assists at a church altar, especially in religious services.","zh":"altarist 指在教堂祭坛前服事、协助礼仪的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who serves at an altar in a church (for example, someone who assists in religious services); an altar attendant.","zh":"（教堂里）在祭坛前服事的人；祭坛侍奉者（如协助礼拜的人）。"},"examples":[{"en":"The altarist prepared the candles before the service began.","zh":"礼拜开始前，那位祭坛侍奉者先把蜡烛准备好。"},{"en":"In the old parish records, an altarist is listed among the church staff.","zh":"在旧的教区档案里，“祭坛侍奉者”被列为教会工作人员之一。"}]}],"synonyms":["altar server","acolyte","altar attendant"],"phonetic":"ˈɔl.tə.rɪst","extraExplanation":["“altarist”是比较少见、偏宗教语境的词，通常出现在基督教礼仪或历史文献中。现代英语里更常见的表达是“altar server”（祭坛辅祭/侍者）或更广义的“acolyte”（侍从，尤指协助礼仪的人）。","构词上它来自“altar（祭坛）+ -ist（从事某事的人）”。在不同教派与地区，具体职责可能不同，但核心含义都是“在祭坛相关礼仪中协助的人”。"]}
{"word":"altarlet","summary":{"en":"“Altarlet” means a very small altar (a rare word).","zh":"“altarlet”表示“小祭坛/迷你祭坛”，但这个词较少见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very small altar; a miniature altar used for private devotion or as a decorative religious object (rare).","zh":"小祭坛；迷你祭坛（多用于私人祈祷或装饰性的宗教物件，较少见）"},"examples":[{"en":"She kept a tiny altarlet on the bookshelf with a candle and a photo.","zh":"她在书架上放了一个小祭坛，上面有蜡烛和一张照片。"},{"en":"The chapel displayed an altarlet used for travelers’ prayers.","zh":"小教堂里陈列着一个供旅人祈祷用的小祭坛。"}]}],"synonyms":["small altar","mini altar","shrine"],"phonetic":"/ˈɔl.tɚ.lət/","extraExplanation":["“altarlet”并不是现代英语里很常用的标准词，更多见于较旧的文本、宗教/艺术描述或个人写作中。","它由“altar（祭坛）”加上指“小”的后缀“-let”构成，语感类似于“booklet（小册子）”“streamlet（小溪流）”。","如果你是在日常英语中表达“小祭坛”，更常见的说法是“small altar”或“mini altar”；若指供奉/祈祷的小角落，也常说“shrine（神龛/小神龛）”。"]}
{"word":"altarpiece","summary":{"en":"An altarpiece is a religious artwork placed above or behind a church altar, often a painting or multi-panel piece.","zh":"altarpiece 指安放在教堂祭坛上方或后方的宗教艺术作品，常为绘画或多联画。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A work of art (often a painting, sculpture, or carved panel) placed above or behind an altar in a church.","zh":"（教堂中）安放在祭坛上方或后方的宗教艺术作品，常见为绘画、雕塑或雕刻板。"},"examples":[{"en":"The museum borrowed a Renaissance altarpiece from a small chapel in Italy.","zh":"博物馆从意大利一座小教堂借来了一件文艺复兴时期的祭坛画。"},{"en":"The altarpiece shows scenes from the life of Christ.","zh":"这件祭坛画描绘了基督生平的场景。"}]},{"partOfSpeech":"n.","definition":{"en":"A special kind of altar artwork made of several hinged panels that can open and close (a polyptych).","zh":"一种由多块可折叠、可开合的画板组成的祭坛艺术品（多联画）。"},"examples":[{"en":"On feast days, the priest opened the altarpiece to reveal brighter images inside.","zh":"在宗教节日，神父会打开这件多联祭坛画，露出里面更明亮的图像。"}]}],"synonyms":["altar painting","retable","polyptych"],"phonetic":"/ˈɔl.tɚ.pis/","extraExplanation":["“altarpiece”在艺术史里常与中世纪到文艺复兴时期的教堂委托艺术相关，常见题材包括圣母与圣婴、耶稣受难、圣徒故事等。","经典例子包括扬·凡·艾克《根特祭坛画》（Ghent Altarpiece）与马蒂亚斯·格吕内瓦尔德《伊森海姆祭坛画》（Isenheim Altarpiece），常被用来说明宗教艺术、赞助与仪式空间的关系。"]}
{"word":"altarpieces","summary":{"en":"“Altarpieces” are artworks placed on or behind an altar, especially in churches.","zh":"“Altarpieces”指放在教堂祭坛上或祭坛后方的宗教艺术作品（祭坛画/祭坛装置）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of altarpiece: works of art (often paintings, panels, or sculptures) placed on or behind a church altar as decoration and as a focus for worship.","zh":"altarpiece 的复数：放在教堂祭坛上或祭坛后方的宗教艺术作品（常见为绘画、拼板画或雕塑），用于装饰并帮助信徒在礼拜时集中注意力。"},"examples":[{"en":"Many medieval churches were famous for their richly painted altarpieces.","zh":"许多中世纪教堂以其华丽精美的祭坛画而闻名。"},{"en":"The museum restored two damaged altarpieces and returned them to the chapel.","zh":"博物馆修复了两件受损的祭坛艺术品，并将它们送回小礼拜堂。"},{"en":"Tourists often come to see the altarpieces by Renaissance masters.","zh":"游客常常前来观看文艺复兴大师创作的祭坛画。"}]}],"synonyms":["altar paintings","retables","reredoses","religious panels"],"phonetic":"/ˈɔl.tɚˌpis/","extraExplanation":["“altarpiece”常见于欧洲基督教艺术史，尤其在中世纪到文艺复兴时期很重要。常见形式包括多联画（triptych 三联画、polyptych 多联画），面板可能用铰链连接，节庆时打开展示更完整的图像。","词源上，altar（祭坛）+ piece（作品）。在学术或博物馆语境中也常用更具体的说法，如“retable / reredos”（指祭坛后方的结构或屏风式装置；不同地区用词略有差异）。"]}
{"word":"altars","summary":{"en":"Altars are religious tables/raised structures used for worship and offerings; ‘at the altar(s)’ can also mean getting married.","zh":"altars 是“祭坛/供桌”的复数；短语 at the altar(s) 也可指“在婚礼上结婚”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of altar: a table or raised structure used in religious ceremonies, where people place offerings, light candles, or pray.","zh":"altar 的复数：祭坛；（宗教仪式中）用于献祭、摆放供品、点蜡烛或祈祷的台/桌。"},"examples":[{"en":"The visitors walked quietly past the altars and lit candles.","zh":"游客们安静地走过祭坛，并点燃蜡烛。"},{"en":"Fresh flowers were placed on the altars every morning.","zh":"每天早晨都会在祭坛上摆上新鲜的花。"}]},{"partOfSpeech":"n.","definition":{"en":"Figurative: ‘at the altar(s)’ refers to getting married in a wedding ceremony (often in a church).","zh":"引申义：at the altar(s) 指“在婚礼仪式上结婚”（常指在教堂）。"},"examples":[{"en":"They met in college and were at the altar three years later.","zh":"他们在大学相识，三年后就举行婚礼结婚了。"},{"en":"He got cold feet right before they reached the altar.","zh":"他们快走到婚礼誓言台前时，他突然怯场了。"}]}],"synonyms":["shrines","sanctuaries","chapels (context-dependent)","communion table (Christian context)"],"phonetic":"/ˈɔltɚ/","extraExplanation":["“altar”在不同宗教与文化中外形和用途会不同：例如基督教常见于教堂前方；佛教、道教寺庙也常有供桌/香案。英语里用 altar/altars 时，通常泛指“宗教仪式用的祭台/供桌”，不限定具体宗教。"]}
{"word":"altarwise","summary":{"en":"Altarwise is a rare word meaning “in an altar-related way” or “altar-like,” mainly used in poetic or religious imagery.","zh":"altarwise 是个罕见词，主要用于诗歌或宗教意象中，表示“以祭坛的方式/与祭坛相关”或“像祭坛一样”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is related to an altar; as if at or toward an altar (often used in poetry).","zh":"以祭坛的方式；像在祭坛处/朝向祭坛一样（多用于诗歌语境）。"},"examples":[{"en":"In the poem, the speaker stands altarwise, as if ready for a sacred ceremony.","zh":"在诗中，说话者以“祭坛式”的姿态站立，仿佛准备参加神圣的仪式。"},{"en":"The candles were placed altarwise, carefully arranged for worship.","zh":"蜡烛被“祭坛式”地摆放，整齐地为礼拜而布置。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) Resembling or characteristic of an altar; altar-like.","zh":"（罕见）像祭坛的；具有祭坛特征的。"},"examples":[{"en":"An altarwise hush filled the room, quiet and reverent.","zh":"房间里弥漫着一种“祭坛般”的静默，安静而庄严。"}]}],"synonyms":["ritually","reverently","sacredly","ceremonially"],"phonetic":"/ˈɔl.tɚˌwaɪz/","extraExplanation":["“-wise”在英语里常表示“以……方式/朝……方向”（如 clockwise 顺时针地、lengthwise 纵向地）。但 altarwise 非常少见，更多出现在文学或宗教意象中，用来营造“仪式感/神圣感”。","它在英语文学中最有名的出现之一，是威尔士诗人 Dylan Thomas 的诗组标题《Altarwise by Owl-light》（可译作“在猫头鹰之光下的祭坛式……”），其中 altarwise 带有强烈象征意味，而不是日常指令式的“摆放方向”。"]}
{"word":"Altavista","summary":{"en":"AltaVista is a famous early web search engine (and its brand name), widely used in the 1990s.","zh":"AltaVista 是一个著名的早期网络搜索引擎（也指其品牌名称），在 1990 年代非常流行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A popular early web search engine and portal, launched in 1995 and widely used before Google became dominant.","zh":"一个早期非常流行的网络搜索引擎与门户网站，1995 年上线，在 Google 崛起前被广泛使用。"},"examples":[{"en":"In the late 1990s, many people searched the web using AltaVista.","zh":"在 1990 年代末，很多人用 AltaVista 来搜索网页。"},{"en":"I found that old page by typing the title into AltaVista.","zh":"我把标题输入 AltaVista，找到了那个旧网页。"}]},{"partOfSpeech":"n.","definition":{"en":"The brand/company name behind that search engine.","zh":"指该搜索引擎背后的品牌/公司名称。"},"examples":[{"en":"AltaVista was known for fast search results at the time.","zh":"当时 AltaVista 以搜索速度快而出名。"}]}],"synonyms":["search engine","web search"],"phonetic":"/ˌæltəˈvɪstə/","extraExplanation":["AltaVista 由 DEC（Digital Equipment Corporation）相关团队推出，曾是“搜索引擎”这个概念普及的重要代表之一。","它在早期以收录量大、速度快著称，但后来被更新的搜索技术与商业模式超越；2013 年左右被雅虎（Yahoo）关闭服务。","写法通常为 AltaVista（中间 V 大写），来源于西班牙语/葡萄牙语意为“高处的景色/远景（a high view）”，因此也带有一种“俯瞰全网”的品牌意象。"]}
{"word":"Altay","summary":{"en":"Altay most often refers to the Altai/Altay region or the Altai Mountains in Central Asia, and it can also mean the city of Altay (Aletai) in Xinjiang, China.","zh":"Altay 通常指中亚的阿尔泰地区或阿尔泰山脉，也可指中国新疆的阿勒泰市（Aletai）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a region and cultural area in Central and North Asia, especially around the Altai Mountains (parts of Russia, Kazakhstan, Mongolia, and China).","zh":"阿尔泰（地区/文化区）：位于中亚与北亚交界，尤指阿尔泰山脉周边（涉及俄罗斯、哈萨克斯坦、蒙古国和中国部分地区）。"},"examples":[{"en":"Many nomadic traditions in Altay are closely tied to mountain and steppe life.","zh":"阿尔泰地区的许多游牧传统与山地和草原生活密切相关。"},{"en":"The research team traveled through Altay to study local languages and folklore.","zh":"研究团队穿越阿尔泰地区，以研究当地语言与民间传说。"}]},{"partOfSpeech":"n.","definition":{"en":"the Altai Mountains, a major mountain range in Central Asia (often written as “Altai”).","zh":"阿尔泰山脉（常写作 Altai）：中亚重要山系之一。"},"examples":[{"en":"Snow can remain on the peaks of Altay well into late spring.","zh":"阿尔泰的山峰上，积雪常常会一直保留到晚春。"},{"en":"They planned a trekking route across the Altay mountains.","zh":"他们计划了一条穿越阿尔泰山脉的徒步路线。"}]},{"partOfSpeech":"n.","definition":{"en":"a city in Xinjiang, China, also commonly spelled “Altay” or “Aletai.”","zh":"阿勒泰市（中国新疆的城市；英文常写作 Altay 或 Aletai）。"},"examples":[{"en":"Altay in Xinjiang is known for its cold winters and nearby scenic areas.","zh":"新疆的阿勒泰以寒冷的冬季和附近的风景区而闻名。"},{"en":"She flew to Altay and then took a bus to the mountain village.","zh":"她飞到阿勒泰，然后坐大巴去山里的村庄。"}]}],"synonyms":["Altai","Aletai"],"phonetic":"/ælˈtaɪ/","extraExplanation":["“Altay/Altai”在英文里常见两种拼写：Altay 与 Altai。学术与地理语境里“Altai”更常见；在指代中国新疆的“阿勒泰”时，Altay 也很常用。","阿尔泰在文化与语言研究中也常被提到，例如“阿尔泰语系（Altaic hypothesis）”曾被用来假设突厥语族、蒙古语族等有共同来源，但这一观点在现代语言学界争议较大。"]}
{"word":"altazimuth","summary":{"en":"Altazimuth refers to the altitude–azimuth system used for pointing to objects in the sky, and to a common telescope mount that moves up-down (altitude) and left-right (azimuth).","zh":"Altazimuth 指用“高度角+方位角”来定位天空目标的经纬式系统，也指能上下（高度角）与左右（方位角）运动的常见望远镜支架。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to a way of describing or pointing to something in the sky using two angles: altitude (up–down from the horizon) and azimuth (direction along the horizon).","zh":"与“高度角（altitude，离地平线的上下角度）+方位角（azimuth，沿地平线的方向）”这两种角度来描述或指向天空中的目标有关的。"},"examples":[{"en":"The telescope uses an altazimuth mount for easy left-right and up-down movement.","zh":"这台望远镜使用经纬式（altazimuth）支架，左右和上下移动都很方便。"},{"en":"Altazimuth coordinates tell you the object’s direction and how high it is above the horizon.","zh":"经纬式坐标会告诉你目标的方向，以及它在地平线上方有多高。"}]},{"partOfSpeech":"n.","definition":{"en":"an altazimuth mount (a type of telescope mount) that moves in two directions: azimuth (horizontal rotation) and altitude (vertical tilt).","zh":"经纬式（altazimuth）支架：一种望远镜支架，能沿方位角（水平旋转）和高度角（上下俯仰）两个方向移动。"},"examples":[{"en":"Many beginner telescopes come with an altazimuth for quick setup.","zh":"很多入门望远镜都配有经纬式支架，安装很快。"},{"en":"An altazimuth is great for visual observing, but long-exposure photos may need tracking help.","zh":"经纬式支架很适合目视观测，但长时间曝光摄影可能需要额外的跟踪辅助。"}]}],"synonyms":["alt-az (informal)","altitude-azimuth"],"phonetic":"/ˌæl.təˈzɪ.məθ/","extraExplanation":["“altazimuth”常见于天文学与望远镜领域，也常写作“alt-az”。它来自两个词的组合：altitude（高度角）+ azimuth（方位角）。","经纬式支架的优点是结构简单、操作直观（像相机云台一样上下左右）；缺点是天体会因地球自转产生“视场旋转”，因此做深空长曝光摄影时通常不如赤道仪方便（除非配合软件或转台进行补偿）。"]}
{"word":"Altazor","summary":{"en":"Altazor is a famous avant-garde poem by Vicente Huidobro and also the name of its speaker, who symbolically falls while questioning language and existence.","zh":"Altazor既指惠多布罗的先锋长诗《Altazor》，也指诗中的发声者/主角：在象征性坠落中追问语言与存在。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A long experimental Spanish-language poem (1931) by Chilean poet Vicente Huidobro, known for its surreal imagery and innovative, sound-focused language.","zh":"《Altazor》：智利诗人比森特·惠多布罗（Vicente Huidobro）于1931年发表的西班牙语长篇实验诗，以超现实意象与强调声音/语言实验而著称。"},"examples":[{"en":"In Latin American literature classes, students often read Huidobro’s Altazor as a landmark of avant-garde poetry.","zh":"在拉丁美洲文学课程中，学生常把惠多布罗的《Altazor》视为先锋诗的重要里程碑。"},{"en":"Altazor becomes increasingly playful with language, pushing meaning toward pure sound.","zh":"《Altazor》越来越强调语言的游戏性，把意义推进到几乎只剩声音的层面。"}]},{"partOfSpeech":"n.","definition":{"en":"The poem’s speaker/protagonist, a figure who undergoes a symbolic fall and questions language, identity, and existence.","zh":"《Altazor》中发声的“我”/主角：一个经历象征性坠落、不断质疑语言、自我与存在的形象。"},"examples":[{"en":"Altazor speaks like a traveler falling through the sky, reflecting on what words can and cannot do.","zh":"Altazor像一位在空中坠落的旅人说话，思考词语能做什么、又做不到什么。"},{"en":"Some readers treat Altazor as a modern myth of the poet confronting the limits of expression.","zh":"一些读者把Altazor看作现代神话：诗人直面表达的极限。"}]}],"synonyms":["Huidobro’s Altazor","Altazor (poem)","Altazor (character/speaker)"],"phonetic":"/ˌæl.təˈzɔr/","extraExplanation":["“Altazor”常被解释为西语“alto”（高处）+“azor”（苍鹰/鹰隼），暗示“高处的鹰”或“在高空坠落的鹰”，与诗中“坠落”意象呼应。","作者惠多布罗与“创造主义”（Creacionismo）有关，强调诗歌不只是描写现实，而是“创造”一个新的现实；《Altazor》后段大量使用变形词、拆分与音响实验，阅读时可更关注节奏与声音带来的感受。"]}
{"word":"altcoin","summary":{"en":"An altcoin is any cryptocurrency other than Bitcoin.","zh":"Altcoin 指除比特币以外的任何加密货币。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Any cryptocurrency other than Bitcoin; often used to refer to smaller or newer crypto projects.","zh":"除比特币以外的任何加密货币；常指规模较小或较新的加密项目。"},"examples":[{"en":"Ethereum is one of the most well-known altcoins.","zh":"以太坊是最知名的山寨币之一。"},{"en":"She invested in several altcoins, hoping one would grow quickly.","zh":"她投资了几种山寨币，希望其中一种能快速增长。"},{"en":"Altcoin prices can be more volatile than Bitcoin.","zh":"山寨币的价格可能比比特币更波动。"}]}],"synonyms":["alternative coin","non-Bitcoin cryptocurrency"],"phonetic":"/ˈɔltˌkɔɪn/","extraExplanation":["“Altcoin”来自“alternative（替代的）+ coin（币）”。中文里常译为“山寨币”，但在日常语境中这个译法有时带一点贬义（暗示模仿或不够正统）。在更中性/正式的表达中，也有人说“比特币以外的加密货币”或直接用“其他币/主流币以外的币”。","在加密市场里，“altcoins”常被用作一个集合概念：既包括知名项目（如ETH），也可能包括风险更高的小币种。具体含义会随语境变化，比如在某些讨论里会把ETH也算作altcoin，在另一些讨论里则把ETH单独列为“主流币”再与其他altcoins区分。"]}
{"word":"Altdorf","summary":{"en":"Altdorf is most commonly a Swiss town (capital of Uri), though the name is also used by other places and sometimes in fantasy settings.","zh":"Altdorf 最常指瑞士乌里州州府阿尔特多夫；该名字也可能指德语区其他同名城镇，或偶见于奇幻作品的虚构地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A town in central Switzerland and the capital of the canton of Uri.","zh":"瑞士中部的一个小镇，是乌里州（Uri）的州府（首府）。"},"examples":[{"en":"We stopped in Altdorf on our way to the Gotthard Pass.","zh":"我们去圣哥达山口的路上在阿尔特多夫（Altdorf）停了一下。"},{"en":"Altdorf is often associated with Swiss legends like William Tell.","zh":"阿尔特多夫常与瑞士传说人物威廉·泰尔（William Tell）联系在一起。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name used for several towns in German-speaking areas; it may also refer to fictional settings in some fantasy works.","zh":"德语地区多个城镇可能使用的地名；在一些奇幻作品中也可能指虚构地点。"},"examples":[{"en":"There are several towns named Altdorf, so check the country and region.","zh":"叫“Altdorf”的城镇不止一个，所以要看清所在国家和地区。"},{"en":"In some fantasy games, Altdorf is portrayed as a major imperial city.","zh":"在某些奇幻游戏中，Altdorf 被描写为帝国的重要城市。"}]}],"phonetic":"/ˈɑlt.dɔrf/","extraExplanation":["这是一个德语地名：Alt- 表示“旧的”，-dorf 表示“村庄/聚落”，字面意思接近“旧村”。在英语语境里它通常作为专有名词使用，首字母大写。","在瑞士语境中，Altdorf 最常指乌里州州府；它常出现在与威廉·泰尔相关的民间传说与旅游介绍里。"]}
{"word":"Altdorfer","summary":{"en":"Altdorfer refers to the German Renaissance artist Albrecht Altdorfer, famous for influential landscapes and dramatic historical scenes.","zh":"Altdorfer 指德国文艺复兴艺术家阿尔布雷希特·阿尔特多费尔，以具有影响力的风景画与戏剧性的历史场景著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) Albrecht Altdorfer (c. 1480–1538), a German Renaissance painter and printmaker, often associated with the Danube School and known for expressive landscapes and historical scenes.","zh":"（专有名词）阿尔布雷希特·阿尔特多费尔（约1480–1538），德国文艺复兴时期画家与版画家，常与“多瑙河画派”联系在一起，以富有表现力的风景画和历史题材作品著称。"},"examples":[{"en":"Altdorfer is often praised for making landscape feel like the main character of the painting.","zh":"阿尔特多费尔常被称赞能让风景成为画作的“主角”。"},{"en":"In art history class, we compared Altdorfer’s dramatic forests with later Romantic landscapes.","zh":"在艺术史课上，我们把阿尔特多费尔戏剧性的森林描绘与后来的浪漫主义风景画作比较。"}]}],"synonyms":["Albrecht Altdorfer"],"phonetic":"/ˈɑlt.dɔr.fɚ/","extraExplanation":["“Altdorfer”在英语里通常指这位艺术家本人（全名 Albrecht Altdorfer）。他生活在德语区，作品常见浓密树林、起伏地形与强烈光影，能帮助理解北方文艺复兴中“风景独立成题”的发展。","你也可能在语境中看到他的代表作被提及，如《亚历山大战役》（The Battle of Alexander at Issus）。"]}
{"word":"Altea","summary":{"en":"Altea is most commonly the name of a seaside town in Spain; it can also be used as a given name, sometimes as a variant of Althea.","zh":"Altea 最常见指西班牙的一座海滨小镇；也可作人名使用，有时被视为 Althea 的变体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A coastal town in Alicante province, on Spain’s Mediterranean coast, known for its old town, whitewashed houses, and seaside views.","zh":"西班牙阿利坎特省（Alicante）地中海沿岸的一座海滨小镇，以古城区、白色房屋和海景闻名。"},"examples":[{"en":"We spent the afternoon walking through Altea’s old town and looking out over the sea.","zh":"我们下午在阿尔特亚（Altea）的古城区散步，眺望大海。"},{"en":"Altea is a quieter alternative to some of the busier resorts nearby.","zh":"和附近一些更热闹的度假地相比，阿尔特亚（Altea）更安静。"}]},{"partOfSpeech":"n.","definition":{"en":"A given name (less common in English), sometimes used as a variant spelling of “Althea.”","zh":"人名（英语中较少见），有时被当作“Althea”的变体拼写。"},"examples":[{"en":"Altea is her middle name, chosen because her family loves Spanish culture.","zh":"Altea 是她的中间名，选这个名字是因为她家人很喜欢西班牙文化。"},{"en":"Is Altea spelled like the Spanish town, or like Althea?","zh":"Altea 的拼法是和西班牙小镇一样，还是像 Althea 那样拼？"}]}],"synonyms":["Althea (similar-looking name)"],"phonetic":"/ælˈteɪə/","extraExplanation":["“Altea”在英语语境里最常见是地名；写作/旅行内容中常直接用原名不翻译，中文常译为“阿尔特亚”。","容易与“Althea”（常见英文女性名，源自希腊语，亦指蜀葵/木槿一类植物的旧称）混淆；两者拼写与来源不同。"]}
{"word":"Alten","summary":{"en":"“Alten” is most commonly a proper name in English (a place name or a surname), not a common everyday vocabulary word.","zh":"“Alten”在英语中多见于专有名词（地名或姓氏），并非常见的日常词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a place name (proper noun), used for several towns/villages in Europe (often in German-speaking areas).","zh":"地名（专有名词）：欧洲（常见于德语地区）若干城镇/村庄的名字。"},"examples":[{"en":"She studied in Alten for a semester while learning German.","zh":"她在 Alten 读了一个学期，同时学习德语。"},{"en":"The train stops at Alten and then continues to the next town.","zh":"火车在 Alten 停靠，然后继续开往下一个城镇。"}]},{"partOfSpeech":"other","definition":{"en":"a family name (surname).","zh":"姓氏。"},"examples":[{"en":"Dr. Alten will see you at 3 p.m.","zh":"Alten 医生会在下午三点见你。"},{"en":"I met someone named Alten at the conference.","zh":"我在会议上认识了一个叫 Alten 的人。"}]}],"phonetic":"/ˈæl.tən/","extraExplanation":["在英语语境里，“Alten”通常作为专有名词（地名或姓氏）出现，本身并不是常见的英语词汇。","补充：在德语中，*alten* 是形容词 *alt*（“老的/旧的”）的屈折形式之一（如复数、宾格/与格等用法），意思仍与“old”相关；但这属于德语语法，不是英语用法。"]}
{"word":"Altenburg","summary":{"en":"Altenburg is most commonly a town name in eastern Germany; it can also be a German surname.","zh":"Altenburg 最常见是德国东部的一座城市名；也可作德国姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a town in the state of Thuringia, eastern Germany (a place name).","zh":"德国东部图林根州的一座城市（地名）。"},"examples":[{"en":"Altenburg is known for its historic old town and castle.","zh":"阿尔滕堡以其历史悠久的老城区和城堡而闻名。"},{"en":"She took a train from Leipzig to Altenburg for a day trip.","zh":"她从莱比锡坐火车去阿尔滕堡一日游。"}]},{"partOfSpeech":"n.","definition":{"en":"a German surname (family name).","zh":"德国姓氏（人名）。"},"examples":[{"en":"Dr. Altenburg will speak at the conference tomorrow.","zh":"阿尔滕堡博士将于明天在会议上发言。"}]}],"phonetic":"/ˈæl.tən.bʊrɡ/","extraExplanation":["“Altenburg”字面可拆为德语 Alten（古老的）+ Burg（城堡/堡垒），因此常被理解为“古堡之地”的地名构词。","阿尔滕堡在文化上常被提到的一点是：纸牌游戏 Skat（斯卡特）与这座城市关系密切，历史上常说其规则在此地形成并传播。"]}
{"word":"alter","summary":{"en":"Alter means to change or modify something, usually not completely but enough to make it different or more suitable.","zh":"Alter 指“改变/修改”，通常是在原有基础上做调整，使其不同或更合适（不一定是彻底改变）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to change something (often slightly) to make it different or more suitable","zh":"改变；修改（通常是小幅度的，使其不同或更合适）"},"examples":[{"en":"We had to alter the schedule because of the rain.","zh":"因为下雨，我们不得不调整日程。"},{"en":"She altered her dress to fit better.","zh":"她把裙子改了一下，让它更合身。"},{"en":"The new evidence may alter the outcome of the case.","zh":"新证据可能会改变案件的结果。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become different; to change","zh":"变得不同；改变"},"examples":[{"en":"His attitude began to alter after the conversation.","zh":"谈话之后，他的态度开始改变。"},{"en":"Living abroad can alter how you see your home country.","zh":"在国外生活会改变你看待祖国的方式。"}]},{"partOfSpeech":"adj.","definition":{"en":"different from what it used to be; changed (often in the phrase “altered state”)","zh":"（与原先）不同的；改变了的（常见于短语“altered state”）"},"examples":[{"en":"The medication can cause an altered mental state.","zh":"这种药可能导致精神状态改变。"}]}],"synonyms":["change","modify","adjust","revise","amend","edit"],"phonetic":"/ˈɔːltɚ/","extraExplanation":["“alter”常表示“在原有基础上做修改/调整”，语气通常比“change”更偏“改动细节、改造使更合适”。在服装语境里，alter尤其常见（改衣、改尺寸）。","词源来自拉丁语 alter（“另一个、改变”相关），因此含有“变成不同的/变得另一些”的感觉。","常见搭配：alter plans（改变计划）、alter the course of history（改变历史进程）、alter a document（篡改/改动文件，语境可能带负面含义）。"]}
{"word":"alter-ego-like","summary":{"en":"“Alter-ego-like” means resembling an alter ego: a second self, double, or contrasting identity.","zh":"“alter-ego-like”表示“像另一个自我/分身一样的”，指第二自我、替身或与本我对照的身份特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the qualities of an alter ego—like a second self or a different version of someone’s identity (often hidden, private, or contrasting with the public self).","zh":"具有“另一个自我/第二人格”的特征——像某人的另一种身份或另一面（常常较隐秘、私密，或与公开形象形成对比）。"},"examples":[{"en":"In the novel, the hero’s alter-ego-like persona appears at night and does what he cannot do in daytime.","zh":"在小说里，主角那种“另一个自我”般的人格会在夜晚出现，做他白天无法做的事。"},{"en":"Her stage name became an alter-ego-like identity that felt freer and bolder than her everyday self.","zh":"她的艺名成了一种“替身自我”般的身份，比日常的自己更自由、更大胆。"}]},{"partOfSpeech":"adj.","definition":{"en":"Resembling a close counterpart or double—something that functions as a person’s stand-in or mirror version (not necessarily secret, but strongly parallel).","zh":"类似于紧密对应的“分身/对照版本”——像某人的替身或镜像（不一定秘密，但高度相似、互为对应）。"},"examples":[{"en":"The writer created an alter-ego-like character to speak honestly about his own fears.","zh":"作家塑造了一个“分身式”的角色，用来坦白表达他自己的恐惧。"},{"en":"In the film, the two sisters have an alter-ego-like relationship, each reflecting what the other suppresses.","zh":"在电影里，两姐妹的关系有点“互为另一个自我”的感觉：彼此映照出对方压抑的部分。"}]}],"synonyms":["dual-identity","double","counterpart","shadow-self-like","mirror-image"],"phonetic":"/ˌɔltɚ ˈiɡoʊ laɪk/","extraExplanation":["“alter ego”源自拉丁语，意为“另一个我”。常用于文学与心理叙事中，表示一个人不同面向的身份（例如白天/夜晚、守规矩/叛逆、现实自我/理想自我）。","写作中“alter-ego-like”多用连字符作形容词，修饰名词：an alter-ego-like figure/character/persona。也可写作“alter ego–like”（用短横/长横）或不连字符（较少见）。","文化与文学联想：像《化身博士》(Dr. Jekyll and Mr. Hyde) 这类作品常被用来说明“alter ego”式的双重身份或人格对照。"]}
{"word":"alterability","summary":{"en":"Alterability means how changeable something is, especially in formal, legal, or technical contexts.","zh":"Alterability 指事物“有多容易/是否能够被改变”，常用于较正式、法律或技术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The ability or capacity to be changed or modified.","zh":"可更改性；可变性（指能够被改变或修改的性质或能力）。"},"examples":[{"en":"The alterability of the schedule depends on everyone’s availability.","zh":"日程的可更改性取决于每个人是否有空。"},{"en":"In software design, high alterability makes updates easier.","zh":"在软件设计中，高可更改性会让更新更容易。"}]},{"partOfSpeech":"n.","definition":{"en":"(Law or formal use) The possibility that something—such as a document, contract term, or status—can be legally changed.","zh":"（法律/正式用语）可变更性（指文件、合同条款或身份等在法律上可被更改的可能性）。"},"examples":[{"en":"They argued about the alterability of the agreement after it was signed.","zh":"他们争论这份协议在签署后是否仍具有可变更性。"},{"en":"The policy states the alterability of fees with prior notice.","zh":"该政策规定费用在提前通知后可变更。"}]}],"synonyms":["changeability","modifiability","flexibility","mutability"],"phonetic":"/ˌɔltərəbɪləti/","extraExplanation":["“alterability”来自动词“alter”（改变、修改）加名词后缀“-ability”（……的能力/性质）。意思接近“changeability”，但“alterability”更偏正式，常见于学术写作、法律条款或工程/软件语境（强调“可修改、可维护”的特性）。","常见搭配：the alterability of + 名词（…的可更改性）；limited alterability（更改受限）；high alterability（高度可修改性）。"]}
{"word":"alterable","summary":{"en":"“Alterable” means something can be changed or modified.","zh":"“alterable”表示某事物“可以被改变或修改”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be changed, adjusted, or modified.","zh":"可改变的；可调整的；可修改的。"},"examples":[{"en":"The schedule is alterable if the weather gets worse.","zh":"如果天气变差，时间表是可以调整的。"},{"en":"These rules are alterable, so please check for updates.","zh":"这些规则是可以修改的，所以请留意更新。"}]}],"synonyms":["changeable","modifiable","adjustable","amendable"],"phonetic":"/ˈɔlt(ə)rəbəl/","extraExplanation":["“alterable”常用于正式或书面语，表示“可以被改动/调整”，语气比 “changeable” 更正式、更强调“经过人为修改”。","常见搭配：alterable plan/schedule（可调整的计划/时间表）、alterable terms（可更改的条款）、readily alterable（容易更改的）。","词源提示：来自动词 alter（改变）+ -able（能够……的）。"]}
{"word":"alterableness","summary":{"en":"Alterableness means the quality of being able to be changed or modified.","zh":"Alterableness 指“可改变性/可修改性”，即能够被更改或调整的性质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being able to be changed, modified, or adjusted","zh":"可改变性；可修改性（指能够被更改、调整的性质）"},"examples":[{"en":"The contract includes a clause about the alterableness of the schedule if both sides agree.","zh":"合同里有一条款说明：如果双方同意，日程安排是可以更改的。"},{"en":"In software design, alterableness can be useful, but too much can cause confusion.","zh":"在软件设计中，可修改性可能很有用，但太强的可修改性也会导致混乱。"}]}],"synonyms":["changeability","modifiability","flexibility","malleability"],"phonetic":"ˈɔlt(ə)rəb(ə)lnəs","extraExplanation":["“alterableness”比较少见，日常英语更常用“changeability / flexibility / modifiability”。它是由形容词“alterable（可改变的）”加名词后缀“-ness”构成，表示“……的性质/状态”。","在正式写作里，如果想更自然，常改写为：“the ability to alter … / how easily … can be altered（改变……的能力/……被改变的容易程度）”。"]}
{"word":"alterably","summary":{"en":"“Alterably” means “in a changeable or modifiable way.”","zh":"“alterably”表示“以可改变、可修改的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that can be changed or modified; in an alterable (changeable) manner.","zh":"以可以被改变或修改的方式；可变地。"},"examples":[{"en":"The schedule is alterably arranged, so we can adjust it if something comes up.","zh":"这个日程安排是可变的，所以如果有事我们可以调整。"},{"en":"These rules are not fixed; they are alterably written to fit different situations.","zh":"这些规则不是固定不变的；它们写得可调整，以适应不同情况。"}]}],"synonyms":["changeably","flexibly","mutably","in a way that can be changed"],"phonetic":"ˈɔltərəbli","extraExplanation":["“alterably”比较少见，多数场合母语者更常用“in a way that can be changed”“flexibly”“changeably”等表达。","词形上：alter（改变）+ -able（可……的）→ alterable（可改变的）+ -ly → alterably（可改变地）。理解这个构词规律有助于你猜测类似副词（如: reasonably, comfortably）。"]}
{"word":"alterant","summary":{"en":"Alterant means “causing a change” (adj.) or “a thing that causes change” (n.), but it is rare in modern English.","zh":"Alterant 表示“引起改变的”（形容词）或“导致改变的事物/因素”（名词），但在现代英语中较少使用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Causing or able to cause a change; having the effect of altering something.","zh":"（罕用）引起改变的；能够导致变化的；具有改变作用的。"},"examples":[{"en":"Heat is an alterant factor in many chemical reactions.","zh":"在许多化学反应中，热量是一个会引起变化的因素。"},{"en":"The doctor looked for alterant influences such as stress and diet.","zh":"医生在寻找会引起变化的影响因素，比如压力和饮食。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) Something that causes a change; an agent or factor that alters.","zh":"（罕用）改变事物的因素；改变剂；促使变化的力量。"},"examples":[{"en":"In the report, pollution was named as an alterant of local ecosystems.","zh":"报告中指出，污染是当地生态系统的一个改变因素。"},{"en":"They studied sunlight as an alterant in the aging of materials.","zh":"他们研究阳光作为材料老化过程中的改变因素。"}]}],"synonyms":["altering","transformative","change-inducing","agent","factor","catalyst"],"phonetic":"/ˈɔl.tɚ.ənt/","extraExplanation":["“alterant”在现代英语里非常少见，更多时候人们会用更自然的表达，如形容词用“altering / change-inducing / transformative”，名词用“agent / factor / catalyst（更偏‘促成反应’）”。","它来自“alter（改变）”加上表示“具有……作用的”的后缀“-ant”，结构上类似“irritant（刺激物/刺激性的）”。在学术或技术语境中偶尔会看到。"]}
{"word":"alterants","summary":{"en":"Alterants are things (often substances or factors) that cause changes; in older medical usage, an alterant is a mild remedy thought to gradually improve health.","zh":"alterants 指引起改变的东西（常为物质或因素）；在较旧的医学用法中，alterant 也可指被认为能逐步改善健康的温和调理药/疗法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance, agent, or factor that changes (alters) something; something that causes an alteration.","zh":"改变某物的物质/因素；使某物发生变化的东西。"},"examples":[{"en":"Heat and moisture are common alterants that can damage paper over time.","zh":"热和潮气是常见的改变因素，久而久之会损坏纸张。"},{"en":"The researchers tested several chemical alterants to see which one changed the color most effectively.","zh":"研究人员测试了几种化学改变剂，看看哪一种最能有效改变颜色。"}]},{"partOfSpeech":"n.","definition":{"en":"(medicine, older use) a mild treatment believed to gradually improve health by changing the body’s condition.","zh":"（医学，较旧用法）“改善剂/调理药”：被认为能逐步改善健康、改变体质状态的温和疗法或药物。"},"examples":[{"en":"In older medical writing, tonics were sometimes described as alterants.","zh":"在较早的医学写作中，补剂有时被称为“调理药（alterants）”。"},{"en":"This herbal mixture was once used as an alterant for skin conditions.","zh":"这种草药混合物曾被用作皮肤问题的调理药。"}]}],"synonyms":["agents of change","modifiers","change-causing factors","altering agents"],"phonetic":"/ˈɔːltərənt/","extraExplanation":["“alterants”是复数形式，单数是“alterant”。在现代日常英语里不算常用，更常见的表达是“things that cause changes / agents that alter …”。","医学义项多见于旧式或历史性的医学文献；现代医学语境更常用具体药名或“treatment/therapy”。"]}
{"word":"alterate","summary":{"en":"“Alterate” is a common misspelling; you likely mean “alternate” (take turns / every other) or “alter” (change).","zh":"“alterate”是常见拼写错误；你多半想写“alternate”（轮流/每隔一个）或“alter”（改变/修改）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Common misspelling) “alterate” is not a standard English word. Most learners mean “alternate” or “alter.”","zh":"（常见拼写错误）“alterate”不是标准英语单词。多数情况下你想表达的是“alternate”或“alter”。"},"examples":[{"en":"Did you mean “alternate” (take turns) or “alter” (change) instead of “alterate”?","zh":"你写的“alterate”是想说“alternate”（轮流）还是“alter”（改变）呢？"}]},{"partOfSpeech":"adj.","definition":{"en":"alternate (adj.): happening in turns; every other one.","zh":"alternate（形容词）：轮流发生的；隔一个的（每隔一个）。"},"examples":[{"en":"We meet on alternate Fridays.","zh":"我们每隔一个周五见一次。"},{"en":"Take alternate routes to avoid traffic.","zh":"走不同/交替的路线来避开堵车。"}]},{"partOfSpeech":"v.","definition":{"en":"alternate (vi./vt.): to take turns; to switch back and forth.","zh":"alternate（不及物/及物动词）：轮流；交替（来回切换）。"},"examples":[{"en":"The two teams alternated in the lead.","zh":"两支队伍轮流领先。"},{"en":"She alternates between working at home and in the office.","zh":"她在家办公和去办公室之间交替进行。"}]},{"partOfSpeech":"vt.","definition":{"en":"alter (vt.): to change something, usually slightly.","zh":"alter（及物动词）：改变（通常是小幅度的修改）。"},"examples":[{"en":"I need to alter this jacket so it fits better.","zh":"我需要改一下这件夹克，让它更合身。"},{"en":"The plan was altered after the meeting.","zh":"会议后计划被修改了。"}]}],"synonyms":["alternate","alter","switch","take turns","modify"],"phonetic":"/ˈɔl.tɚ.neɪt/","extraExplanation":["“alternate”和“alter”很容易混淆：\n- alternate 强调“轮流/交替”（A—B—A—B）；也可指“备选的”（an alternate plan 备选方案）。\n- alter 强调“把同一个东西改一改”（change/modify）。\n常见错误是把 alternate 拼成 alterate。","小提示：\n- “every other” ≈ “alternate”：every other day = alternate days（每隔一天）。\n- “alteration(s)”是名词，常见于改衣服：clothing alterations（衣服修改）。"]}
{"word":"alteratio","summary":{"en":"“Alteratio” isn’t a normal English word; you probably want “alteration” (a change or modification).","zh":"“alteratio”不是常用英语词；你多半想写“alteration”，意思是“改变；改动；修改”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard modern English word; most often a misspelling or truncated form of “alteration.”","zh":"不是现代英语中的标准单词；最常见是把“alteration（改变；改动）”拼错或写短了。"},"examples":[{"en":"I think you meant “alteration,” not “alteratio.”","zh":"我想你想写的是“alteration”，不是“alteratio”。"},{"en":"Please check the spelling before you submit your essay.","zh":"提交作文前请检查拼写。"}]},{"partOfSpeech":"n.","definition":{"en":"(Latin, used in academic contexts) “alteratio”: a change or process of becoming different; the act of making something ‘other.’","zh":"（拉丁语，学术语境）“alteratio”：变化、变得不同的过程；使某物“变成另一种”的行为。"},"examples":[{"en":"In some older texts, “alteratio” is used for a gradual change in quality.","zh":"在一些较旧的文本中，“alteratio”用来表示性质的逐渐变化。"},{"en":"The author contrasts “alteratio” (change) with stability.","zh":"作者把“alteratio（变化）”与稳定作对比。"}]}],"synonyms":["alteration","change","modification","revision","adjustment"],"phonetic":"/ˌɔl.təˈreɪ.ʃən/","extraExplanation":["在英语学习与写作中，一般不要用“alteratio”。如果你要表达“改动/修改（衣服、文件等）”，用 alteration；要表达“改变（使不同）”，动词常用 alter。","常见搭配：make an alteration（做出改动）；clothing alterations（衣物修改）；alter a plan（改变计划）。"]}
{"word":"alteration","summary":{"en":"Alteration means a change or the act of changing, often used for clothing changes or formal plan/document revisions.","zh":"Alteration 指“改动/修改”或“变更的行为”，常用于改衣以及对计划、文件等的正式修订。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a change or modification made to something (often to improve it or make it fit better)","zh":"（对某物做的）改动；修改（常为改进或更合适）"},"examples":[{"en":"The tailor made a few alterations to the jacket so it would fit perfectly.","zh":"裁缝对夹克做了几处修改，让它合身到刚刚好。"},{"en":"The final report included minor alterations suggested by the editor.","zh":"最终报告采纳了编辑提出的一些小改动。"}]},{"partOfSpeech":"n.","definition":{"en":"the process or act of changing something","zh":"改变的行为；变更的过程"},"examples":[{"en":"Any alteration to the plan must be approved by the committee.","zh":"对计划的任何变更都必须得到委员会批准。"}]}],"synonyms":["change","modification","adjustment","revision","amendment"],"phonetic":"/ˌɔl.tɚˈeɪ.ʃən/","extraExplanation":["“alteration”在日常生活里常见于服装语境（比如改裤脚、收腰等），这时往往用复数“alterations”，表示“（衣服的）改衣服务/改动项目”。","在法律、合同或学术语境中，“alteration”更偏正式，含义接近“变更/修订”，常与“unauthorized alteration（未经授权的改动）”“material alteration（重大变更）”搭配。"]}
{"word":"alteration-related","summary":{"en":"“Alteration-related” means connected with or caused by a modification or change.","zh":"“alteration-related”表示与改动/变更有关，或由修改、调整引起。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with an alteration; involving or caused by a change, modification, or adjustment.","zh":"与“改动/变更”有关的；涉及或由变化、修改、调整引起的。"},"examples":[{"en":"We need to document all alteration-related costs before the renovation begins.","zh":"在装修开始前，我们需要记录所有与改动相关的费用。"},{"en":"The nurse asked about any alteration-related side effects after the patient changed medication.","zh":"病人更换用药后，护士询问是否出现与改变相关的副作用。"},{"en":"Alteration-related delays are common when the design keeps changing.","zh":"当设计不断变化时，与改动相关的延误很常见。"}]}],"synonyms":["change-related","modification-related","revision-related","amendment-related"],"phonetic":"/ˌɔltəˈreɪʃən rɪˈleɪtɪd/","extraExplanation":["“alteration-related”是一个由名词alteration（改动、变更）+ related（相关的）构成的复合形容词，常用于正式写作（项目管理、医疗记录、法律/合同、工程等）来把“某类问题/费用/风险”明确归因于“改动”。","连字符（-）常见于放在名词前作定语时：alteration-related costs（与改动相关的费用）。如果放在名词后作表语，也可以不加连字符：The costs are alteration related / alteration-related（两种都可能见到，但加连字符更清晰、更常见于编辑规范）。","近义表达可用：change-related, modification-related, revision-related；语气上alteration更偏“对已有事物做调整/改造”，比change更具体、偏正式。"]}
{"word":"alterational","summary":{"en":"Alterational means “related to alteration or change,” often used in scientific/technical writing (especially geology).","zh":"alterational 指“与改变/变更有关的”，多见于科技写作（尤其地质学语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the act or process of changing something (an alteration), especially in technical or scientific contexts.","zh":"与“改变/变更”（alteration）的行为或过程有关的；（尤指）技术或科学语境中的“改造性的/变质的”。"},"examples":[{"en":"The report describes the alterational history of the rock samples.","zh":"报告描述了这些岩石样品的变质（改造）历史。"},{"en":"Scientists measured alterational effects caused by heat and pressure.","zh":"科学家测量了热和压力造成的改变（改造）效应。"},{"en":"Alterational processes can change a material’s color and strength over time.","zh":"改造过程会随着时间改变材料的颜色和强度。"}]}],"synonyms":["alterative","transformational","modificational","metamorphic (geology)","related to alteration"],"phonetic":"/ˌɔltəˈreɪʃənəl/","extraExplanation":["“alterational”在日常英语中比较少见，更常见的表达是“relating to alteration”或直接用“alteration + 名词”（如 alteration process / alteration history）。","在地质学里它常指岩石或矿物因热、压力、流体等作用发生的“变质/蚀变”（例如 hydrothermal alteration 与热液蚀变相关）。"]}
{"word":"alterations","summary":{"en":"“Alterations” means changes or modifications, often made to improve something or make it fit better (commonly used for clothing, plans, or buildings).","zh":"“alterations”指改动或修改，常用于为了改进或更合适而进行的调整（尤其常见于服装、计划或建筑）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"changes made to something, especially to improve it or make it fit a new purpose","zh":"（尤指为改进或适应新用途而做的）改动，修改"},"examples":[{"en":"The tailor made some alterations to my suit so it would fit better.","zh":"裁缝给我的西装做了一些改动，让它更合身。"},{"en":"The building needs alterations to meet safety rules.","zh":"这栋楼需要进行一些改造以符合安全规定。"}]},{"partOfSpeech":"n.","definition":{"en":"a change from the original form, condition, or plan","zh":"（相对于原来的形式、状态或计划的）变更，变化"},"examples":[{"en":"There were several alterations to the schedule because of the storm.","zh":"因为暴风雨，日程安排有几处变更。"},{"en":"Scientists observed alterations in the patient’s sleep patterns.","zh":"科学家观察到患者睡眠模式出现变化。"}]}],"synonyms":["changes","modifications","adjustments","revisions","amendments"],"phonetic":"/ˌɔl.tɚˈeɪ.ʃənz/","extraExplanation":["“alterations”是“alteration”的复数形式，来自动词“alter”（改变）。在日常英语里，它常见于两类场景：①服装修改（tailor alterations）；②计划/文件/建筑的改动（make alterations to the plan/house）。","和“changes”相比，“alterations”更偏正式，常暗示是有目的、有步骤的修改，尤其在商业、建筑、服装行业很常用。"]}
{"word":"alterative","summary":{"en":"Alternative means another choice or a different option (as an adjective or a noun).","zh":"Alternative 表示“另一种选择/替代方案”，既可作形容词也可作名词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"available as another choice; different from the usual or original option","zh":"可供选择的；替代的；不同于常规或原来的"},"examples":[{"en":"We need an alternative plan in case it rains.","zh":"我们需要一个备选方案，以防下雨。"},{"en":"She chose an alternative route to avoid traffic.","zh":"她选择了一条替代路线来避开交通拥堵。"}]},{"partOfSpeech":"n.","definition":{"en":"one of two or more choices; a different possibility","zh":"可供选择的事物；替代方案；另一种可能"},"examples":[{"en":"If you don’t like coffee, tea is a good alternative.","zh":"如果你不喜欢咖啡，茶是个不错的替代选择。"},{"en":"There is no alternative but to apologize.","zh":"别无选择，只能道歉。"}]}],"synonyms":["option","choice","substitute","replacement","backup"],"phonetic":"/ɔlˈtɝːnətɪv/","extraExplanation":["你输入的 **alterative** 很可能是拼写错误；正确拼写通常是 **alternative**。","小提示：**alternative** 里有 **-native**（像“原生的/本土的”那部分字母顺序），容易帮助记忆不要写成 *alterative*。"]}
{"word":"alteratively","summary":{"en":"“Alternatively” means “instead / as another option,” and less commonly “in an alternating way.”","zh":"“Alternatively”常表示“或者/作为另一种选择（相当于instead）”，较少表示“交替地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Used to introduce another choice, possibility, or way of doing something; “instead” or “as another option.”","zh":"用于提出另一种选择、可能性或做法；表示“或者/另一种方式/作为替代”。"},"examples":[{"en":"We could take the train. Alternatively, we could drive.","zh":"我们可以坐火车。或者，我们也可以开车。"},{"en":"If you don’t have fresh tomatoes, you can alternatively use canned ones.","zh":"如果你没有新鲜番茄，也可以改用罐装的。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that happens by turns, first one and then the other (less common).","zh":"交替地；轮流地（较少用）。"},"examples":[{"en":"The lights flashed alternatively red and blue.","zh":"灯光红蓝交替闪烁。"}]}],"synonyms":["instead","as an alternative","otherwise","or else"],"phonetic":"/ɔlˈtɝnətɪvli/","extraExplanation":["你输入的“alteratively”通常是“alternatively”的拼写错误。记忆小技巧：alternative（替代的）+ -ly（副词后缀）→ alternatively。常见搭配：Alternatively, ... / or alternatively ..."]}
{"word":"altercate","summary":{"en":"“Altercate” means to argue in a heated, angry way (a formal word).","zh":"“Altercate”表示“激烈争吵”，语气较正式。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to argue loudly or angrily; to have a heated disagreement (often verbally).","zh":"大声或激烈地争吵；发生口头上的激烈争执。"},"examples":[{"en":"Two customers began to altercate over who was next in line.","zh":"两位顾客为了谁该排在下一个而开始争吵。"},{"en":"They altercated in the hallway, but the teacher stopped it quickly.","zh":"他们在走廊里吵了起来，但老师很快制止了。"},{"en":"Try not to altercate online—take a break and cool down.","zh":"尽量不要在网上争吵——先休息一下冷静冷静。"}]}],"synonyms":["argue","quarrel","bicker","wrangle","dispute"],"phonetic":"/ˈɔltɚˌkeɪt/","extraExplanation":["词源来自拉丁语 altercari，含有“互相争辩/反驳”的意思；在现代英语中较偏正式（formal），比 argue 更强调“情绪激烈、争吵”的感觉。","常见搭配：altercate with someone（与某人争吵）、altercate over/about something（为某事争吵）。"]}
{"word":"altercated","summary":{"en":"“Altercated” means “argued loudly/angrily” (past tense of “altercate”).","zh":"“altercated”意为“发生激烈争吵/争执”（为“altercate”的过去式）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle) argued or quarreled noisily and angrily, often in public.","zh":"（过去式/过去分词）激烈争吵；大声争执（常发生在公共场合）。"},"examples":[{"en":"The two drivers altercated after the minor accident.","zh":"两名司机在小事故后发生了激烈争吵。"},{"en":"He altercated with a coworker over who should take the night shift.","zh":"他因谁该值夜班而和同事争执起来。"}]}],"synonyms":["argued","quarreled","bickered","squabbled","wrangled"],"phonetic":"/ˈɔl.tɚˌkeɪ.tɪd/","extraExplanation":["“altercated”来自动词“altercate”，在现代英语里较少见；更常见的说法是：\"argued\"（争吵）或用名词结构\"had an altercation\"（发生口角/冲突）。","常见搭配：altercate with someone（与某人争吵）; altercate about/over something（为某事争吵）。","拼写提示：不要和“altered”（改变了）混淆；两者意思完全不同。"]}
{"word":"altercating","summary":{"en":"Altercate means to argue angrily; it’s a formal, less common verb.","zh":"altercate 意为“激烈争吵/争论”，语气较正式且不太常用。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to argue or quarrel in an angry way (a formal or less common verb).","zh":"（较正式/不常用）激烈争吵；争论。"},"examples":[{"en":"The two drivers began to altercate over who had the right of way.","zh":"两位司机开始为谁该先行而争吵。"},{"en":"The meeting stayed calm until two members started altercating about the budget.","zh":"会议一直很平静，直到两位成员开始为预算问题争吵。"}]}],"synonyms":["argue","quarrel","bicker","dispute","fight"],"phonetic":"/ˈɔl.tɚˌkeɪt/","extraExplanation":["“altercating”多半是把动词现在分词拼错了：正确拼法是 **altercating**（来自动词 **altercate**）。不过 **altercate** 在现代英语里不算常用，更自然的说法通常是 **argue / quarrel / fight**，或用名词短语 **have an altercation**（发生争执）。","词源上与拉丁语中表示“争辩/反驳”的词有关，因此语气偏正式，常见于新闻、法律或较书面语境。"]}
{"word":"altercation","summary":{"en":"An altercation is a heated argument or a brief fight.","zh":"altercation 指激烈的争吵或短暂的肢体冲突。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A noisy argument or a brief physical fight, often happening suddenly in public.","zh":"（常在公共场合突然发生的）争吵；口角；（短暂的）肢体冲突。"},"examples":[{"en":"A small altercation broke out in the parking lot after the game.","zh":"比赛结束后，停车场里爆发了一场小争吵。"},{"en":"The police arrived quickly and separated the two men after an altercation.","zh":"警方很快赶到，在发生冲突后把两名男子分开。"},{"en":"She tried to walk away to avoid an altercation.","zh":"她试图走开以避免发生争执。"}]}],"synonyms":["argument","dispute","quarrel","confrontation","scuffle"],"phonetic":"/ˌɔltɚˈkeɪʃən/","extraExplanation":["“altercation”通常比“argument”更激烈，常暗示情绪升级、声音变大，甚至可能有推搡等轻微肢体冲突；但又不一定严重到“fight/assault”的程度。","搭配常见：have an altercation (with sb)（与某人发生争执/冲突）；get into an altercation（卷入争执）；an altercation broke out（争执爆发）。在新闻和警方通报中也很常见，语气偏正式。"]}
{"word":"altercations","summary":{"en":"Altercations are noisy, angry arguments or conflicts, sometimes close to a fight.","zh":"altercations 指激烈的争吵或冲突，语气较强，有时接近“打架”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A noisy argument or fight, often with angry words and sometimes physical conflict.","zh":"（通常带有愤怒言语、甚至可能升级为肢体冲突的）争吵；口角；冲突。"},"examples":[{"en":"The altercation started as a small disagreement and quickly became a shouting match.","zh":"这场冲突一开始只是小分歧，很快就变成了互相大喊。"},{"en":"Police arrived after an altercation outside the restaurant.","zh":"餐馆外发生争执后，警察赶到了现场。"},{"en":"He tried to walk away to avoid another altercation with his neighbor.","zh":"他试着走开，避免再和邻居发生口角。"}]}],"synonyms":["argument","dispute","quarrel","confrontation","scuffle"],"phonetic":"/ˌɔltɚˈkeɪʃən/","extraExplanation":["“altercation”通常指当场发生的激烈争吵或冲突，比一般的“argument”更火爆、更有对抗性；但又不一定像“fight”那样明确指肢体打斗。","词形提示：你输入的是复数“altercations”，单数是“altercation”。常见搭配：get into an altercation（卷入争执）、an altercation with sb（与某人争执）、a verbal altercation（口头冲突）。","语域：偏正式/新闻报道用语，在警方通报、法庭记录、媒体报道中很常见。"]}
{"word":"altercative","summary":{"en":"Alternative means a different choice or another way instead of the usual one.","zh":"Alternative 指“可替代的选择/方案”，也可形容“非传统的、不同于常规的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A choice or option you can use instead of another one.","zh":"可替代的选择；备选方案。"},"examples":[{"en":"We need an alternative to plastic bags.","zh":"我们需要塑料袋的替代品。"},{"en":"Is there an alternative plan if it rains?","zh":"如果下雨，有备用计划吗？"},{"en":"You can take the bus as an alternative to driving.","zh":"你可以坐公交车来代替开车。"}]},{"partOfSpeech":"adj.","definition":{"en":"Different from the usual or traditional; other.","zh":"非传统的；不同于通常的；另类的。"},"examples":[{"en":"She listens to alternative music.","zh":"她听另类音乐。"},{"en":"They chose an alternative approach to teaching.","zh":"他们选择了一种不同于传统的教学方法。"}]}],"synonyms":["option","choice","substitute","backup","other"],"phonetic":"/ɔlˈtɝnətɪv/","extraExplanation":["你输入的“altercative”应为 **alternative**（拼写：a-l-t-e-r-n-a-t-i-v-e）。常见错误是把中间的 **-n-** 漏掉或写错。可以记成：alter（改变）+ native（本来的）→ “改变原来的选择”。","在文化语境里，**alternative music/rock** 指相对主流（mainstream）而言的音乐风格与文化圈。日常口语中也常说 **an alternative** = “一个替代方案”。"]}
{"word":"altered","summary":{"en":"“Altered” means changed from the original; it can also be the past form of “alter” meaning to modify.","zh":"“altered”表示“被改变的/改动过的”，也可作动词 alter 的过去式/过去分词，意为“修改、调整”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Changed or made different from the original form, condition, or meaning.","zh":"（与原来相比）被改变的；改动过的；变样的。"},"examples":[{"en":"The document was altered to correct a few mistakes.","zh":"文件被修改过，以纠正一些错误。"},{"en":"He spoke in an altered voice after the surgery.","zh":"手术后他的声音变了。"}]},{"partOfSpeech":"v.","definition":{"en":"To change something, usually slightly, in order to improve it, correct it, or make it fit a new situation.","zh":"（通常小幅度地）改变；修改；更动，使其更好、更正确或更适合新情况。"},"examples":[{"en":"We had to alter the schedule because of the weather.","zh":"因为天气原因，我们不得不调整日程。"},{"en":"The tailor altered my pants to fit me better.","zh":"裁缝把我的裤子改得更合身。"}]}],"synonyms":["changed","modified","revised","adjusted","edited"],"phonetic":"ˈɔltərd","extraExplanation":["“altered”常见有两种用法：①作形容词，表示“已经被改变的”；②作动词 alter 的过去式/过去分词，表示“修改了/被修改”。","在服装语境里，alter 很常见，意思是“改衣服（尺寸）”，如 alter a dress / get a suit altered。","注意与 related 词区分：alternate（交替的/轮流的）和 alter（改变）拼写相近但意思不同。"]}
{"word":"alteregoism","summary":{"en":"Alteregoism is a rare term for the practice or idea of identifying with an alter ego—a second self or persona.","zh":"Alteregoism 是个较罕见的词，指认同或使用“另一个自我/第二人格”（alter ego）的做法或观念。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) The tendency or practice of creating, using, or strongly identifying with an alter ego (a “second self”), especially in writing, performance, or online identity.","zh":"（罕见用语）指创造、使用或强烈认同“另一个自我/第二人格”（alter ego）的倾向或做法，常见于写作、表演或网络身份。"},"examples":[{"en":"His stage persona is so detailed that critics describe his work as a kind of alteregoism.","zh":"他的舞台人格塑造得非常细致，评论家形容他的作品带有一种“另我主义/分身式自我认同”。"},{"en":"Online alteregoism lets her experiment with confidence she doesn’t feel in real life.","zh":"网络中的“另我主义”让她能尝试现实中并不具备的自信。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) An idea or belief that a person can have a meaningful “other self” that expresses hidden desires, values, or identity.","zh":"（较少见）一种观念：人可能存在一个有意义的“另一个自我”，用来表达隐藏的欲望、价值或身份。"},"examples":[{"en":"The novel explores alteregoism through a narrator who writes under a second name.","zh":"这部小说通过一个用第二个名字写作的叙述者来探讨“另我主义”。"},{"en":"In superhero stories, alteregoism often drives the tension between public duty and private life.","zh":"在超级英雄故事里，“另我主义”常推动公众责任与私人生活之间的张力。"}]}],"synonyms":["alter-ego identity","second self","dual identity","second persona","secret identity"],"phonetic":"/ˌɔltər ˈiɡoʊˌɪzəm/","extraExplanation":["“alter ego”源自拉丁语，字面意思是“另一个我”。“alteregoism”并不是常见标准词汇，更像是由“alter ego + -ism”构成的自造词/学术或评论写法，用来概括“使用或认同分身身份”的现象。日常英语里更常说：have an alter ego / create an alter ego / a secret identity / a second persona。"]}
{"word":"alteregoistic","summary":{"en":"“Alteregoistic” means connected to an alter ego—an alternative identity or second self.","zh":"“alteregoistic”指与“另一个自我/替身身份（alter ego）”相关，带有替身人格色彩的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an alter ego (a second self or alternative identity), or showing behavior that comes from such an identity.","zh":"与“另一个自我/替身身份（alter ego）”有关的；表现出源自另一种身份或第二自我的行为。"},"examples":[{"en":"In the novel, the hero becomes more alteregoistic at night, acting like a completely different person.","zh":"在小说里，主人公到了夜晚更显得“替身人格化”，行为像换了一个人。"},{"en":"Her alteregoistic stage persona is confident and loud, unlike her quiet real-life self.","zh":"她在舞台上的“替身形象”自信又张扬，和现实中安静的她很不一样。"}]}],"synonyms":["alter-ego-like","dual-identity","second-self","persona-based"],"phonetic":"/ˌɔl.tɚˌiː.ɡoʊˈɪs.tɪk/","extraExplanation":["“alteregoistic”不是常见的标准词汇，更常见的表达是“related to an alter ego / having an alter ego / alter-ego-like”。它通常由“alter ego（另一个自我）+ -istic（……倾向/……风格的）”构成，用来描述某种“替身身份”色彩很强的行为、风格或叙述。写作中使用时要注意语境，避免让读者觉得生造。"]}
{"word":"alterer","summary":{"en":"“Alterer” means a person or thing that changes something; it can also mean someone who (illegally) tampers with documents or records.","zh":"“Alterer”指改变某物的人或事物；也可指（非法）篡改文件或记录的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that changes something; someone who alters (often used in formal or technical writing).","zh":"改变某物的人或事物；进行修改/变更的人（常见于较正式或技术性语境）。"},"examples":[{"en":"In genetics, the environment can be an alterer of how certain traits appear.","zh":"在遗传学中，环境可能会改变某些性状的表现方式。"},{"en":"The editor was the alterer of several lines to make the meaning clearer.","zh":"编辑修改了几处句子，使意思更清晰。"}]},{"partOfSpeech":"n.","definition":{"en":"(law or documents) a person who illegally changes a record or document; a falsifier.","zh":"（法律/文书）非法改动记录或文件的人；篡改者。"},"examples":[{"en":"The court investigated whether an alterer had changed the contract date.","zh":"法院调查是否有人篡改了合同日期。"},{"en":"Digital logs can help identify an alterer of electronic records.","zh":"数字日志可以帮助找出电子记录的篡改者。"}]}],"synonyms":["changer","modifier","reviser","editor","tamperer","falsifier"],"phonetic":"/ˈɔl.tɚ.ɚ/","extraExplanation":["“alterer”由动词“alter（改变/修改）”+后缀“-er（做某事的人/物）”构成，意思直观但在日常口语中不算常用。更自然的说法常是“someone who alters/changes…”或根据具体工作说“editor（编辑）/modifier（修改者）”。"]}
{"word":"alterers","summary":{"en":"“Alterers” means people or things that change or modify something.","zh":"“Alterers”指改变或修改某物的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or things that alter something; changers or modifiers.","zh":"改变某物的人或事物；更改者；修改者。"},"examples":[{"en":"The editors were important alterers of the final manuscript.","zh":"编辑是最终稿件的重要修改者。"},{"en":"In this process, enzymes act as alterers of the chemical structure.","zh":"在这个过程中，酶充当化学结构的改变者。"}]}],"synonyms":["changers","modifiers","editors","revisers","adjusters"],"phonetic":"/ˈɔltərərz/","extraExplanation":["“alterers”是名词复数，单数是“alterer”，来自动词“alter”（改变、修改）+ 表示“做某事的人/物”的后缀“-er”。在日常英语里，人们更常用“people who change/modify…”或更具体的词（如“editors”“modifiers”），而“alterer(s)”相对少见、偏书面或技术语境。"]}
{"word":"altering","summary":{"en":"“Altering” means making changes, often small adjustments; it’s also commonly used for tailoring clothes to fit better.","zh":"“altering”指做出改变，常带“小幅调整/修改”的意思；也常用于裁缝语境，表示改衣使更合身。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"changing something (often slightly) to make it different or to improve it; the act/process of making a change","zh":"改变某物（常为小幅度的调整）使其不同或更好；改变/修改的过程"},"examples":[{"en":"They are altering the design to make it safer.","zh":"他们正在修改设计，让它更安全。"},{"en":"Altering your schedule can reduce stress.","zh":"调整你的时间安排可以减轻压力。"}]},{"partOfSpeech":"v.","definition":{"en":"making changes to clothing so it fits better (common in tailoring)","zh":"（裁缝中）改衣、改尺寸，使衣服更合身"},"examples":[{"en":"She’s altering the dress at the waist.","zh":"她正在把裙子的腰围改一下。"},{"en":"The jacket needs altering before the wedding.","zh":"这件外套在婚礼前需要改一改。"}]}],"synonyms":["changing","modifying","adjusting","revising","amending"],"phonetic":"ˈɔltərɪŋ","extraExplanation":["“altering”是动词“alter”的现在分词/动名词形式：可表示正在进行的动作（They are altering...），也可作名词性用法表示“改变/改动”这件事（Altering the plan was necessary.）。","语感上，alter通常强调“改动、调整”，不一定是彻底改变；比change更偏“修改/变更细节”。在服装语境里，alter几乎就是“改衣服”。"]}
{"word":"alterity","summary":{"en":"Alterity means the condition of being “other” or different, often used in academic contexts about identity and outsiders.","zh":"Alterity 指“他者性/他异性”，强调作为“他者”的差异与被当作局外人的状态，常见于学术语境讨论身份与外来者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of being “other” or different, especially in how a person or group is seen as separate from oneself or from what is considered normal.","zh":"“他者性/他异性”：作为“他者”的状态，指与自我或被视为常态的事物不同，常用于描述人或群体被看作与“我们”分离的差异。"},"examples":[{"en":"The novel explores alterity by showing how immigrants are treated as outsiders.","zh":"这部小说通过描写移民如何被当作外人，来探讨“他者性”。"},{"en":"Learning another language can help you respect alterity instead of fearing it.","zh":"学习另一种语言能帮助你尊重差异与“他者性”，而不是害怕它。"}]}],"synonyms":["otherness","difference","outsiderness"],"phonetic":"/ɔlˈtɛrɪti/","extraExplanation":["“alterity”多见于人文学科（哲学、文化研究、文学批评、社会学）语境，强调“我们如何把某些人/群体当成‘他者’来理解或对待”。在日常英语里更常用 otherness, difference, being an outsider 等更普通的表达。","词源上来自拉丁语 alter（“另一个”）。在学术写作中常与 identity（身份/认同）、self/other（自我/他者）、othering（他者化）一起出现，用来讨论权力、偏见与刻板印象如何制造“距离”。"]}
{"word":"alterius","summary":{"en":"*alterius* is a Latin form meaning “of the other / of another (person),” mainly seen in legal or scholarly English.","zh":"*alterius* 是拉丁语形式，意为“他人的/另一方的”，主要见于法律或学术英语语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin, used in English legal writing) “of the other” or “of another person”; the genitive (possessive) form of *alter* (“the other of two”).","zh":"（拉丁语，常见于英语法律语境）“他人的/另一方的”；是 *alter*（“两者中的另一个”）的属格（所有格）形式。"},"examples":[{"en":"In the maxim **\"alterius damnum\"**, *alterius* means “of another person,” referring to harm done to someone else.","zh":"在法律格言 **“alterius damnum（他人之损害）”** 中，*alterius* 表示“他人的”，指对他人造成的损害。"},{"en":"Some texts contrast **\"suum\"** (one’s own) with **\"alterius\"** (someone else’s).","zh":"一些文本会对比 **“suum（自己的）”** 与 **“alterius（他人的）”。"}]}],"synonyms":["another’s","someone else’s","the other party’s"],"phonetic":"/ɔlˈtɪriəs/","extraExplanation":["*alter* 在拉丁语里常带有“两者之中的另一个”的意味，因此 *alterius* 往往带有“另一方/对方/他人”的法律语气（与普通的“其他”略有差别）。","在英语里你通常不会把 *alterius* 当作日常词来用；它多出现在法律拉丁语、格言、判例或学术写作中，用来简洁表达“他人之……/另一方的……”。"]}
{"word":"alterman","summary":{"en":"Alterman is most commonly used as a surname; as a common noun meaning “a person who alters,” it is rare.","zh":"Alterman最常见的是姓氏；作为普通名词表示“改变/修改的人”较罕见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A surname (family name).","zh":"（专有名词）姓氏。"},"examples":[{"en":"Nathan Alterman was a well-known Israeli poet and playwright.","zh":"纳坦·阿尔特曼（Nathan Alterman）是著名的以色列诗人和剧作家。"},{"en":"Ms. Alterman will join the meeting at 3 p.m.","zh":"阿尔特曼女士将在下午三点参加会议。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A person who alters or changes something; not common in modern English (more natural: “someone who alters…,” “editor,” “modifier”).","zh":"（罕见）指“改变某物的人”；现代英语中不常用（更自然的说法是“someone who alters…/editor/modifier”等）。"},"examples":[{"en":"In older notes, he was described as the alterman of the text, making many revisions.","zh":"在较早的笔记里，他被描述为文本的“修改者”，做了许多修订。"}]}],"synonyms":["(as a rare common noun) modifier","editor","reviser"],"phonetic":"/ˈɔltərmən/","extraExplanation":["“Alterman”更常见于人名/姓氏语境，而不是普通词汇。它常见于犹太/意第绪语背景的姓氏系统中，在英语里通常不翻译，只按读音使用。","如果你是想查“alderman”（市议员/地方官员，历史用语），那是另一个词，拼写不同但容易混淆。"]}
{"word":"altern","summary":{"en":"“altern” is usually an informal abbreviation for “alternate/alternating,” and sometimes a clipped form of “alternative.” In formal English, write the full word.","zh":"“altern”通常是“alternate/alternating”的非正式缩写，有时也被当作“alternative”的截短写法。正式英语中建议写全词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev., not a standard standalone word) Short for “alternate/alternating” in notes, tables, or technical writing.","zh":"（缩写，非标准独立词）在笔记、表格或技术语境中常作“alternate / alternating（交替的；交替进行）”的简写。"},"examples":[{"en":"In the chart, “altern” means the two colors alternate every row.","zh":"在图表里，“altern”表示两种颜色每一行交替出现。"},{"en":"The manual uses “altern” to describe alternating current (AC).","zh":"说明书用“altern”来描述交流电（AC，alternating current）。"}]},{"partOfSpeech":"other","definition":{"en":"(rare) A clipped form people may type when they mean “alternative” (a different choice).","zh":"（少见）有人输入“altern”时，可能是“alternative（替代的；另一种选择）”的截短写法。"},"examples":[{"en":"Do you have an altern plan if it rains? (More natural: an alternative plan.)","zh":"如果下雨你有“altern”计划吗？（更自然：alternative plan。）"},{"en":"We need an altern route to avoid traffic. (More natural: an alternate/an alternative route.)","zh":"我们需要一条“altern”路线来避开拥堵。（更自然：alternate / alternative route。）"}]}],"synonyms":["alternate","alternating","alternative"],"phonetic":"ˈɔlˌtɝn","extraExplanation":["“altern”本身在正式英语里不常作为独立词使用，更像是非正式缩写或打字时的截断。正式写作中建议直接用：alternate（轮流的/备用的）、alternating（交替的）、alternative（替代的/另一种选择）。","“alternate”和“alternative”在口语里有时都可表示“备用的/另一种”，但常见区分是：alternate 更偏“轮流/间隔出现”或“备用的（另一个）”；alternative 更强调“不同选择/替代方案”。"]}
{"word":"alternacy","summary":{"en":"Alternacy means a regular alternation between things; in linguistics, it can mean form changes of a word or morpheme across contexts.","zh":"Alternacy 指事物之间规律交替；在语言学中也可指词或语素在不同语境/语法条件下的形式交替变化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or pattern of alternating; regular change between two (or more) things","zh":"交替状态；轮流变化的模式（在两种或多种事物之间规律转换）"},"examples":[{"en":"In some regions, there is an alternacy of wet and dry seasons.","zh":"在一些地区，雨季和旱季会交替出现。"},{"en":"The schedule was designed with an alternacy of work and rest.","zh":"这个日程安排成工作与休息交替进行。"}]},{"partOfSpeech":"n.","definition":{"en":"(linguistics) variation in the form of a word or morpheme depending on grammar or context","zh":"（语言学）词或语素的形式因语法或语境而发生的交替变化（如不同词形/变体）"},"examples":[{"en":"English shows vowel alternacy in pairs like “speak” and “spoke.”","zh":"英语在“speak”和“spoke”这类词对中体现出元音交替。"},{"en":"The textbook uses “alternacy” to describe stem changes across verb forms.","zh":"教材用“alternacy”来描述动词不同形式之间的词干变化。"}]}],"synonyms":["alternation","rotation","interchange","variation"],"phonetic":"/ˈɔl.tɚ.nə.si/","extraExplanation":["“Alternacy”相对少见，更常见的通用词是“alternation”（交替；交替现象）。在语言学里，“alternacy”有时用来强调“同一词根/语素在不同环境下出现不同形式”的系统性变化。"]}
{"word":"alternamente","summary":{"en":"“alternamente” means “alternately; in turn,” mainly seen in Italian/Spanish contexts.","zh":"“alternamente”主要出现在意大利语/西班牙语语境中，意思是“交替地；轮流地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Italian/Spanish) alternately; in turn; one after the other, switching back and forth.","zh":"（意大利语/西班牙语）交替地；轮流地；一个接一个地来回切换。"},"examples":[{"en":"They spoke alternamente, each taking a turn to explain the plan.","zh":"他们轮流发言，各自依次解释计划。"},{"en":"The lights flash alternamente: red, then blue, then red again.","zh":"灯光交替闪烁：先红，再蓝，再红。"}]},{"partOfSpeech":"adv.","definition":{"en":"alternatively; as another option (less common use; often expressed with a different word in English).","zh":"（较少见）或者；作为另一种选择（英语里通常用其他说法表达）。"},"examples":[{"en":"You can take the bus; alternamente, you can walk if the weather is nice.","zh":"你可以坐公交；或者，天气好的话也可以走路。"}]}],"synonyms":["alternately","in turn","one after another","back and forth","take turns"],"phonetic":"/ˌæl.tɚ.nəˈmɛn.teɪ/","extraExplanation":["“alternamente”常见于意大利语与西班牙语文本中，来自拉丁语词根，核心概念是“交替/轮流”。在英语写作里更自然的对应词通常是 **alternately**（交替地）或 **in turn**（轮流）。如果你在英文文章里直接用“alternamente”，通常会显得有意使用外来语（例如文学风格、引用原文、或强调文化语境）。"]}
{"word":"alternance","summary":{"en":"Alternance means a regular back-and-forth alternation, and can also refer to a change of political power through elections (especially in French-related contexts).","zh":"Alternance 指规律性的交替/轮替；也可指（尤在法语相关政治语境中）通过选举实现的执政更替。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the regular or repeated alternation of two things (a pattern of switching back and forth); also used for an alternation pattern in language (linguistics).","zh":"（两者之间）规律性或反复的交替、轮替；（语言学）指语音/词形等的交替现象。"},"examples":[{"en":"Many plants show an alternance of wet and dry season growth.","zh":"许多植物的生长表现为雨季与旱季的交替。"},{"en":"In linguistics, vowel alternance can change a word’s form, like in some verb patterns.","zh":"在语言学中，元音交替会改变词的形式，例如某些动词的变化模式。"}]},{"partOfSpeech":"n.","definition":{"en":"(politics, especially in French-speaking contexts) a change of governing party or leadership through elections; peaceful transfer of power.","zh":"（政治语境，尤见于法语圈）通过选举实现的执政党/领导层更替；和平的政权交接。"},"examples":[{"en":"The country experienced an alternance after the election, with a new party forming the government.","zh":"选举后该国出现执政更替，由新政党组阁。"},{"en":"Observers praised the alternance as a sign of a healthy democracy.","zh":"观察人士称赞这种执政更替是民主健康运作的标志。"}]}],"synonyms":["alternation","rotation","switching","turnover"],"phonetic":"/ˈɔl.tɚ.nəns/","extraExplanation":["“alternance”来自法语，在一般英语里相对少见；更常见的对应词是 alternation（交替）或 turnover/rotation（轮替）。","在语言学里，它常与“sound alternation / vowel alternation（语音/元音交替）”等概念相关；在政治语境中，特别是谈论法语国家政治时，常指“通过选举实现的和平更替”。"]}
{"word":"alternant","summary":{"en":"Alternant means “alternating” (adj.) or “an alternate/alternating form” (n.), often used in technical or academic contexts.","zh":"Alternant 可作形容词表示“交替的”，作名词表示“交替出现的事物/替代形式”，常见于技术或学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of things) occurring in turns; alternating.","zh":"（事物）轮流发生的；交替的。"},"examples":[{"en":"The machine uses alternant pressure: high, then low, then high again.","zh":"这台机器使用交替的压力：高、低、高循环。"},{"en":"In some poems, alternant rhythms can make the lines feel musical.","zh":"在一些诗歌中，交替的节奏会让诗句更有音乐感。"}]},{"partOfSpeech":"n.","definition":{"en":"Something that alternates with another thing; an alternate form.","zh":"交替出现的事物；替代形式。"},"examples":[{"en":"In linguistics, a word may have two alternants depending on the context.","zh":"在语言学中，一个词可能会因语境不同而有两种交替形式。"},{"en":"The design includes an alternant pattern of dark and light squares.","zh":"这个设计包含深浅方格交替的图案。"}]}],"synonyms":["alternating","alternate","interchanging"],"phonetic":"/ɔlˈtɝnənt/","extraExplanation":["“alternant”比较偏学术或技术场景，日常英语里更常用“alternating”（交替的）或“alternate”（替代的/交替的）。","词源上与“alternate / alternation（交替/交替变化）”同源，核心概念都是“轮流出现、两种形式来回切换”。","在语言学里，“alternant”常指同一词或词素在不同环境下出现的不同形式（例如复数、时态变化等引起的形式差异）。"]}
{"word":"Alternanthera","summary":{"en":"Alternanthera is a plant genus (amaranth family) that includes ornamental and sometimes invasive species.","zh":"Alternanthera 指苋科的莲子草属植物，既有观赏种，也有可能具入侵性的种类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of plants in the amaranth family (Amaranthaceae), including species used as ornamentals and some considered weeds or aquatic plants","zh":"莲子草属（苋科）的植物属名；其中一些种类可作观赏植物，也有的被视为杂草或水生入侵植物"},"examples":[{"en":"Alternanthera is often grown as a colorful edging plant in gardens.","zh":"莲子草属植物常被种作花园里色彩鲜艳的镶边观赏植物。"},{"en":"Some Alternanthera species spread quickly in wetlands and can become invasive.","zh":"有些莲子草属物种在湿地扩散很快，可能成为入侵物种。"}]}],"synonyms":["Alternanthera (genus name)","joyweed (for some species)"],"phonetic":"/ˌɔːl.tərˌnænˈθɪrə/","extraExplanation":["“Alternanthera”是拉丁化的学名，常见于园艺、植物学与生态入侵相关的语境中。日常英语里更常用具体物种名或俗名来指代，例如某些观赏品种常被称作“alternanthera”或用商品名；水域入侵种在报道中可能会提到其属名或学名。","词源上与“alternate（交替的）”有关，暗示某些种的叶序特征（但并非所有人都会从名字直接联想到这一点）。"]}
{"word":"alternanthera","summary":{"en":"Alternanthera is a plant genus (amaranth family) that includes ornamental and aquatic plants.","zh":"Alternanthera 指莲子草属（苋科）的植物类群，常见于观赏栽培与水草应用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of plants in the amaranth family (Amaranthaceae), including several ornamental or aquatic species; some are used as ground cover or aquarium plants.","zh":"莲子草属（苋科）植物的一个属，包含多种观赏性或水生品种；有些可作地被植物或水族箱水草。"},"examples":[{"en":"Alternanthera is popular in aquariums because some species have bright red leaves.","zh":"莲子草属在水族箱里很受欢迎，因为其中一些品种有鲜红的叶子。"},{"en":"The garden center sells Alternanthera as a colorful edging plant.","zh":"园艺店把莲子草属植物当作色彩鲜艳的花坛镶边植物来卖。"}]}],"synonyms":["joyweed"],"phonetic":"/ˌɔl.tərˌnænˈθɪrə/","extraExplanation":["“Alternanthera”是拉丁化的学名（属名），日常英语里常与具体物种一起出现，例如 *Alternanthera philoxeroides*（常被称为 alligator weed，入侵性较强）或 *Alternanthera reineckii*（水草爱好者常见的红色水草）。","作为属名，通常首字母大写并用斜体书写（Alternanthera）；如果指某个物种，会写成“属名 + 种加词”，如 *Alternanthera reineckii*。"]}
{"word":"Alternaria","summary":{"en":"Alternaria is a genus of molds; some species cause plant diseases and can trigger allergies.","zh":"Alternaria 指链格孢属霉菌；部分种会致植物病害，也可能引发过敏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of common molds (fungi) that often grow on plants and decaying organic matter; some species cause plant diseases and can trigger allergies in humans","zh":"链格孢属（常见霉菌/真菌的一属）；常生长在植物和腐败有机物上；其中一些种会引起植物病害，也可能诱发人体过敏"},"examples":[{"en":"The lab identified Alternaria on the leaf spots, suggesting a fungal disease.","zh":"实验室在叶斑中检测到链格孢属，提示这可能是真菌性病害。"},{"en":"Some people with asthma are sensitive to Alternaria spores in the air.","zh":"一些哮喘患者对空气中的链格孢孢子比较敏感。"}]}],"synonyms":["mold","fungus","Alternaria mold"],"phonetic":"/ˌæl.tɚˈnɛr.i.ə/","extraExplanation":["“Alternaria”在科学写作中通常首字母大写并用斜体（*Alternaria*），表示属名；常见的致病种包括 *Alternaria alternata*。","在农业语境里，它常与“叶斑病（leaf spot）”“早疫病（early blight，尤其与茄科作物相关）”等问题一起出现。","在环境与医学语境中，Alternaria 的孢子是常见的空气过敏原之一，可能与过敏性鼻炎、哮喘症状加重有关。"]}
{"word":"alternaria","summary":{"en":"Alternaria is a genus of fungi known for causing plant diseases and for spores that can trigger allergies.","zh":"Alternaria 指链格孢属真菌，常致植物病害，其孢子也可能引发过敏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of common fungi that often live on plants and can cause leaf spots, rots, and other plant diseases; some species’ spores can also trigger allergies in people.","zh":"链格孢属（真菌的一属），常见于植物上，可引起叶斑、腐烂等植物病害；其孢子也可能诱发人体过敏。"},"examples":[{"en":"The tomato leaves showed dark spots caused by Alternaria.","zh":"番茄叶片出现了由链格孢（Alternaria）引起的黑色斑点。"},{"en":"In late summer, Alternaria spores can make allergy symptoms worse.","zh":"在夏末，链格孢的孢子可能会加重过敏症状。"}]}],"synonyms":["fungus","mold (general)","plant pathogen"],"phonetic":"/ˌɔl.tɚˈnɛr.i.ə/","extraExplanation":["“Alternaria”常见于农业与园艺语境：例如“Alternaria leaf spot（链格孢叶斑病）”“Alternaria blight（链格孢疫病/枯斑病）”。不同作物（番茄、马铃薯、柑橘等）可能对应不同种或不同病名。","在健康相关语境里，它常被当作一种“霉菌/真菌过敏原”提到；报告里可能写“Alternaria sensitivity（对链格孢过敏）”或“Alternaria spores（链格孢孢子）”。","词首字母大写“Alternaria”多指真菌属名（生物分类学用法）；小写“alternaria”有时被当作通用名使用，但学术写作更常用大写属名。"]}
{"word":"alternariose","summary":{"en":"Alternariose is an infection or disease caused by Alternaria fungi, usually referring to plant disease.","zh":"Alternariose 指由链格孢属真菌引起的感染或病害，通常用于植物病害。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a disease or infection caused by fungi of the genus Alternaria (often affecting plants; rarely used for human/animal infection in English).","zh":"由链格孢属（Alternaria）真菌引起的疾病或感染（多指植物病害；在英语里用于人/动物感染较少见）。"},"examples":[{"en":"Tomato leaves can develop alternariose, showing dark, target-like spots.","zh":"番茄叶片可能发生 alternariose，出现深色的同心轮纹状斑点。"},{"en":"The report linked the crop losses to alternariose during a wet growing season.","zh":"报告指出，雨水偏多的生长季导致作物因 alternariose 而减产。"}]}],"synonyms":["Alternaria blight","Alternaria leaf spot","alternariosis"],"phonetic":"/ˌɔːl.tərˈnɛr.i.oʊs/","extraExplanation":["“alternariose”在英语中相对少见，更常见的相关术语是“Alternaria blight（链格孢叶斑/枯斑病）”“Alternaria leaf spot（链格孢叶斑病）”，以及在医学语境里偶尔会见到“alternariosis（链格孢病/链格孢感染）”。","“Alternaria”是一类常见的环境真菌，许多种类与植物叶斑、果实腐烂等有关；在农业与植保资料中更常用具体作物+病名的表达方式。"]}
{"word":"alternariosis","summary":{"en":"Alternariosis is an infection caused by Alternaria mold species.","zh":"Alternariosis 指由链格孢属霉菌引起的感染。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fungal infection caused by species of Alternaria (a common environmental mold), often affecting the skin, sinuses, eyes, or lungs—especially in people with weakened immune systems.","zh":"由链格孢属（Alternaria，一种常见环境霉菌）引起的真菌感染，常累及皮肤、鼻窦、眼部或肺部，免疫力较弱者更易发生。"},"examples":[{"en":"The dermatologist suspected alternariosis after the culture showed Alternaria species.","zh":"培养结果显示为链格孢属后，皮肤科医生怀疑是链格孢菌病（alternariosis）。"},{"en":"In immunocompromised patients, alternariosis may spread beyond the skin and require antifungal treatment.","zh":"在免疫功能低下的患者中，链格孢菌病可能不止局限于皮肤，可能需要抗真菌治疗。"}]}],"synonyms":["Alternaria infection","Alternaria fungal infection"],"phonetic":"/ˌæl.tɚˌnɛr.iˈoʊ.sɪs/","extraExplanation":["“Alternaria”是一类在土壤、植物、空气中很常见的霉菌；因此相关疾病多见于接触环境孢子后发生。","该词属于医学/真菌学用语，日常英语中很少见；在临床文本里也常写作“Alternaria infection”（链格孢感染）。","在过敏学里，Alternaria 也常作为致敏原出现（例如引发过敏性鼻炎或哮喘），但“alternariosis”通常指真正的感染而不只是过敏反应。"]}
{"word":"alternat","summary":{"en":"Alternate means to switch back and forth in turns; it can also mean “every other,” or a backup person/thing.","zh":"Alternate 表示“交替/轮流”；也可表示“隔一个的”；还可指“替补/备用者（物）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to happen or be used one after another, switching back and forth between two (or more) things","zh":"（在两者或多者之间）交替发生；轮流使用"},"examples":[{"en":"We alternate between online classes and in-person classes each week.","zh":"我们每周在网课和线下课之间交替进行。"},{"en":"The traffic light alternates red and green.","zh":"红绿灯红绿交替。"}]},{"partOfSpeech":"adj.","definition":{"en":"every other; happening in turns, not continuously","zh":"隔一个的；交替的；轮流的"},"examples":[{"en":"I work alternate Saturdays.","zh":"我隔周六上班。"},{"en":"They took alternate seats to keep space between them.","zh":"他们隔一个座位坐，以保持距离。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or thing that can replace another if needed; a substitute","zh":"备用者；替代物"},"examples":[{"en":"If the main speaker cancels, we have an alternate ready.","zh":"如果主讲人取消，我们有一位替补准备好了。"},{"en":"Carry an alternate plan in case it rains.","zh":"带一个备用计划，以防下雨。"}]}],"synonyms":["switch","take turns","rotate","substitute","backup"],"phonetic":"/ˈɔl.tɚ.neɪt/","extraExplanation":["你输入的“alternat”看起来像是拼写未完成或拼写错误；最常见的完整形式是 **alternate**（动词/形容词/名词）。","常见搭配：**alternate between A and B**（在A与B之间交替）、**alternate with**（与……交替出现）、**alternate days**（隔天）、**an alternate route**（备用路线/替代路线）。注意：美式英语里“alternate route”更常见；英式里也常说“alternative route”。"]}
{"word":"alternate","summary":{"en":"“Alternate” most often means taking turns (verb) or happening every other time (adjective). It can also mean a substitute choice, though “alternative” is more common for that meaning.","zh":"“alternate”常指“轮流/交替”（动词）或“隔一个的/轮流的”（形容词）。也可指“替代选择”，但表达“替代的”时更常用“alternative”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to switch between two (or more) things, or to happen one after the other in turns","zh":"在两者（或多者）之间轮流；交替进行"},"examples":[{"en":"We alternated between walking and resting during the hike.","zh":"徒步时我们在走路和休息之间交替进行。"},{"en":"The children alternated turns on the swing.","zh":"孩子们轮流玩秋千。"}]},{"partOfSpeech":"adj.","definition":{"en":"every other; happening in turns; different from the usual option","zh":"隔一个的；交替的；备选的（不同于常规选择的）"},"examples":[{"en":"I go to the gym on alternate days.","zh":"我隔一天去一次健身房。"},{"en":"We took an alternate route because of traffic.","zh":"因为堵车，我们走了另一条路线（替代路线）。"}]},{"partOfSpeech":"n.","definition":{"en":"another choice or possibility; a substitute option","zh":"另一种选择；替代方案"},"examples":[{"en":"If you don’t like tea, coffee is a good alternate.","zh":"如果你不喜欢茶，咖啡是个不错的替代选择。"}]}],"synonyms":["switch","take turns","rotate","interchange","alternative"],"phonetic":"/ˈɔl.tɚ.nət/","extraExplanation":["用法小提醒：在现代英语里，作形容词时更常见的是 “alternative”（替代的），比如 “an alternative plan”。“alternate” 作形容词也对，但更常见搭配是 “alternate days/years”（隔天/隔年）或 “alternate turns”（轮流）。","常见搭配：alternate between A and B（在A与B之间交替）；take alternate turns（轮流）；alternate route（替代路线/绕行路线）。"]}
{"word":"alternate-leaved","summary":{"en":"Alternate-leaved describes a plant whose leaves grow one per node in an alternating pattern up the stem.","zh":"alternate-leaved 指植物叶片在茎上互生：每个节位一片叶，上下左右交错排列。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having leaves arranged alternately on the stem (one leaf per node, switching sides as you go up the stem), rather than in opposite pairs or in whorls.","zh":"（植物学）叶序为互生的；叶子在茎上交替生长（每个节位一片叶，上下交错），而不是对生或轮生。"},"examples":[{"en":"Willows are typically alternate-leaved, so the leaves don’t grow in pairs at the same level.","zh":"柳树通常是互生叶，所以叶子不会在同一高度成对生长。"},{"en":"The field guide describes the plant as alternate-leaved with small, serrated leaves.","zh":"野外植物图鉴把这种植物描述为互生叶，叶片小且有锯齿。"}]}],"synonyms":["alternate","alternately leaved","with alternate leaves"],"phonetic":"ˈɔl.tɚ.nət ˌliːvd","extraExplanation":["“alternate-leaved”常见于植物图鉴、标本标签和科普文章中，用来快速描述“叶序（phyllotaxy）”。","辨别方法：沿着茎向上看，如果每个节位只有一片叶，而且左右交错出现，一般就是互生（alternate）。如果同一节位长出两片、左右相对，是对生（opposite）；如果同一节位长出三片或更多围成一圈，是轮生（whorled）。","写法上既可用连字符（alternate-leaved）强调它是一个复合形容词，也常见不加连字符的形式 alternate leaved（较少见）。"]}
{"word":"alternate-sepal","summary":{"en":"Alternate-sepal describes a flower whose sepals are positioned in an alternating (not opposite) pattern.","zh":"alternate-sepal 指花的萼片以交错/互生（非对生）的方式排列。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having sepals arranged alternately (not opposite) around the flower, or positioned in between other flower parts in an alternating pattern.","zh":"（植物学）花萼片（萼片）以“互生/交错”的方式排列（不是对生），或与花的其他结构呈交替位置排列。"},"examples":[{"en":"In this species, the flower shows an alternate-sepal arrangement, so each sepal sits between two neighboring petals.","zh":"在这个物种中，花呈现“萼片交错排列”，因此每一片萼片位于两片相邻花瓣之间。"},{"en":"The diagram labels the calyx as alternate-sepal, which helps explain the symmetry of the bud.","zh":"图示把花萼标注为“萼片互生”，这有助于解释花蕾的对称性。"}]}],"synonyms":["alternating sepals","sepals are alternate","alternate sepals"],"phonetic":"/ɔlˈtɝːnət ˈsiːpəl/","extraExplanation":["这是一个偏专业的植物学用语，常见于植物志、形态学描述或鉴定检索表中。日常英语里更常说“the sepals are alternate/alternating”。","“alternate-”在植物学里常用来描述器官的排列方式：互生（alternate）指相邻的器官不在同一条对称线上；对生（opposite）则是成对相对生长。"]}
{"word":"alternate-winter","summary":{"en":"“alternate-winter” usually means “every other winter,” but it is not a common fixed expression.","zh":"“alternate-winter”通常表示“隔一冬（每隔一个冬天）”，但并不是很固定、常见的表达。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Not very common) Happening every other winter; occurring in alternating winters.","zh":"（不太常见）隔一冬发生一次；在交替的冬季出现。"},"examples":[{"en":"Some years the lake freezes solid, but it usually happens only in alternate winters.","zh":"有些年份湖面会完全结冰，但通常只是在隔一冬才会发生一次。"},{"en":"They schedule major maintenance in alternate winters to reduce costs.","zh":"他们把大型维护安排在隔一冬进行一次，以降低成本。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare, technical) Relating to a seasonal pattern where a different winter condition or host is used compared with another season (used in some scientific writing).","zh":"（少见，偏专业）指季节性交替模式：冬季的条件或宿主与其他季节不同（见于部分科学写作）。"},"examples":[{"en":"The insect may use an alternate winter host in colder regions.","zh":"在较寒冷的地区，这种昆虫冬季可能会使用替代的越冬宿主。"}]}],"synonyms":["every other winter","in alternate winters","biennial (winter)"],"phonetic":"/ˈɔl.tɚ.nət ˈwɪn.tɚ/","extraExplanation":["“alternate-winter”带连字符并不是固定词条，更常见的表达是“every other winter（每隔一冬）”或“in alternate winters”。","当作形容词时，英文里通常写作“alternate winter + 名词”（如 alternate winter schedule）。连字符多见于作者临时造词、标题或说明文字中。"]}
{"word":"alternated","summary":{"en":"“Alternated” means switched back and forth or took turns, and can also describe a regular back-and-forth pattern.","zh":"“alternated”表示“交替/轮流进行”，也可形容“规律地交替出现”的状态。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “alternate”: to switch back and forth between two (or more) things, actions, or states.","zh":"“alternate”的过去式/过去分词：在两种（或多种）事物、动作或状态之间交替切换。"},"examples":[{"en":"She alternated between working at home and working in the office.","zh":"她在居家办公和去办公室办公之间交替进行。"},{"en":"The coach alternated two goalkeepers during the season.","zh":"教练在赛季中轮换了两名守门员。"}]},{"partOfSpeech":"adj.","definition":{"en":"taking turns; happening one after another in a regular pattern (used as an adjective, often in phrases like “alternated rows/steps”).","zh":"（作形容词）轮流的；交替出现的（常用于“alternated rows/steps”等搭配）。"},"examples":[{"en":"The scarf has alternated stripes of blue and white.","zh":"这条围巾有蓝白相间的条纹。"},{"en":"They walked up alternated steps to keep pace.","zh":"他们用交替的步伐往上走以保持速度。"}]}],"synonyms":["switched","took turns","rotated","interchanged"],"phonetic":"ˈɔl.tɚ.neɪ.tɪd","extraExplanation":["“alternate”常表示“轮流/交替进行”（动词）；“alternative”更常表示“可供选择的另一种/替代方案”（名词或形容词）。例如：We alternated seats.（我们轮流换座位。） vs. We need an alternative plan.（我们需要一个替代方案。）"]}
{"word":"alternately","summary":{"en":"“Alternately” most often means “in turns / switching back and forth,” and it can also (less formally) mean “as another option.”","zh":"“alternately”最常指“轮流/交替地”，也可（较不正式）表示“或者/作为另一个选择”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in turns; first one thing, then another, repeatedly (often switching back and forth).","zh":"轮流地；交替地（一个接一个地、反复切换）。"},"examples":[{"en":"The children sat alternately with their mother and father on the bus.","zh":"孩子们在公交车上轮流坐在妈妈和爸爸旁边。"},{"en":"The lights flashed alternately red and blue.","zh":"灯光红蓝交替闪烁。"}]},{"partOfSpeech":"adv.","definition":{"en":"as another option; alternatively (used to introduce a different choice).","zh":"或者；作为另一种选择（相当于 alternatively）。"},"examples":[{"en":"You can take the train; alternately, you could drive.","zh":"你可以坐火车；或者你也可以开车。"}]}],"synonyms":["in turn","by turns","back and forth","alternatively","as another option"],"phonetic":"ˌɔlˈtɝnətli","extraExplanation":["常见易混：**alternately**（交替地/轮流地）强调“轮番发生”；**alternatively**（或者/作为替代）更常用于提出“另一个选择”。不过在现代英语里，alternately 有时也会用来表示“或者”，但在正式写作中更推荐用 alternatively。"]}
{"word":"alternateness","summary":{"en":"Alternateness means the quality of alternating—things happening in turns or in a repeating back-and-forth pattern.","zh":"Alternateness 指“交替性”：事物轮流发生、来回重复的规律模式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of alternating; the pattern of happening first one way, then another, in turns","zh":"交替性；轮流发生的状态或性质（先这样、再那样，有规律地轮换）"},"examples":[{"en":"The poem’s rhythm comes from the alternateness of stressed and unstressed syllables.","zh":"这首诗的节奏来自重读与非重读音节的交替。"},{"en":"The alternateness of hot and cold air can create strong winds.","zh":"冷热空气的交替可能形成强风。"}]}],"synonyms":["alternation","interchange","back-and-forth","succession"],"phonetic":"/ɔlˈtɝnətnəs/","extraExplanation":["“alternateness”在现代英语里比较少见、更偏学术或技术性写法；日常更常用的名词是“alternation”（交替、交替变化），或直接用形容词/动词结构如“alternating pattern / to alternate”。","常见搭配语境：语言学/诗歌（重读与非重读的交替）、生物学（世代交替）、科学（电流的交替变化等）。"]}
{"word":"alternater","summary":{"en":"Alternate means to take turns or switch back and forth; it can also mean “every other,” or a substitute person/thing.","zh":"alternate 表示轮流/交替；也可表示“每隔一个/每隔一天”；还可指候补者或替代方案。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(verb) To change back and forth between two things; to take turns.","zh":"（动词）在两者之间交替变化；轮流进行。"},"examples":[{"en":"We alternate between studying and taking short breaks.","zh":"我们在学习和短暂休息之间交替进行。"},{"en":"The kids alternated carrying the heavy bag.","zh":"孩子们轮流搬那个重袋子。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective) Happening or appearing every other time; every second one.","zh":"（形容词）每隔一次发生的；每隔一个的。"},"examples":[{"en":"I go to the office on alternate days.","zh":"我隔天去一次办公室。"},{"en":"The streetlights are placed at alternate corners.","zh":"路灯安装在隔一个路口的拐角处。"}]},{"partOfSpeech":"n.","definition":{"en":"(noun) A person or thing that can replace another; a substitute.","zh":"（名词）候补者；替代者；替代方案。"},"examples":[{"en":"If the main speaker cancels, we have an alternate.","zh":"如果主讲人取消，我们有候补人选。"},{"en":"Bring an alternate plan in case it rains.","zh":"以防下雨，带一个备用方案。"}]}],"synonyms":["take turns","switch","rotate","every other","substitute","replacement"],"phonetic":"/ˈɔːltərneɪt/","extraExplanation":["“alternater”通常不是标准英文拼写。你可能想写的是：\n1) alternate（交替/轮流；隔一个的；候补）\n2) alternator（汽车/发电机中的“交流发电机”）\n\n另外，alternate 作形容词时常读 /ˈɔːltərnət/（末尾是 -nət），作动词时常读 /ˈɔːltərneɪt/（末尾像 -neɪt）。"]}
{"word":"alternates","summary":{"en":"“Alternates” can mean substitutes (plural noun) or “switches back and forth” (3rd-person verb form of alternate).","zh":"“alternates”可指“替补/替代品”（复数名词），也可指“交替进行”（alternate 的动词第三人称单数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) People or things that can replace the main one; substitutes.","zh":"（复数名词）可替代主要人/物的人或事物；替补；替代品。"},"examples":[{"en":"If you can’t attend the meeting, please send one of the alternates.","zh":"如果你不能参加会议，请派一位替补去。"},{"en":"The team listed two alternates in case a player got injured.","zh":"球队列了两名替补，以防球员受伤。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, 3rd person singular) To switch back and forth between two (or more) things or actions.","zh":"（动词第三人称单数）在两种（或多种）事物/行为之间交替进行。"},"examples":[{"en":"She alternates between working at home and working in the office.","zh":"她在居家办公和在办公室办公之间交替进行。"},{"en":"The weather alternates between sunny and rainy in spring.","zh":"春天的天气在晴和雨之间交替变化。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective, plural form) Happening every other time; occurring in turns (e.g., alternate days).","zh":"（形容词复数形式）每隔一次发生的；轮流的（如：隔天的）。"},"examples":[{"en":"We have classes on alternate mornings.","zh":"我们隔天上午上课。"},{"en":"They took alternate seats to keep some distance.","zh":"他们隔一个座位坐下以保持距离。"}]}],"synonyms":["substitutes","replacements","stand-ins","switches","takes turns"],"phonetic":"/ˈɔl.tɚ.neɪts/","extraExplanation":["“alternate”常见有两种读音：作名词/形容词多读 /ˈɔl.tɚ.nət/（重音在第1音节，结尾像“nət”）；作动词多读 /ˈɔl.tɚ.neɪt/（结尾像“neɪt”）。你输入的“alternates”可能是名词复数（替补们/替代品们），也可能是动词第三人称单数（他/她/它在……之间交替）。"]}
{"word":"alternating","summary":{"en":"Alternating means happening in turns or switching back and forth.","zh":"Alternating 指“交替的、轮流的”，或“在两者之间来回切换”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening in turns; switching back and forth between two (or more) things.","zh":"交替的；轮流发生的；在两者（或多者）之间来回切换的。"},"examples":[{"en":"We have alternating meetings: online one week and in person the next.","zh":"我们的会议是交替进行的：这一周线上，下周线下。"},{"en":"The road had alternating patches of sun and shade.","zh":"路上阳光和阴影交替出现。"}]},{"partOfSpeech":"v.","definition":{"en":"(Present participle of “alternate”) To take turns or switch back and forth.","zh":"（动词 alternate 的现在分词）交替进行；轮流；来回切换。"},"examples":[{"en":"She is alternating between studying and taking short breaks.","zh":"她在学习和短暂休息之间交替进行。"},{"en":"The team is alternating speakers to keep the presentation lively.","zh":"团队轮流安排发言人，让展示更有活力。"}]}],"synonyms":["alternate","switching","back-and-forth","interchanging"],"phonetic":"/ˈɔl.tɚˌneɪ.tɪŋ/","extraExplanation":["“alternating”常用来描述一种有规律的“轮流/交替”模式，常见搭配有：alternating days（隔天/交替的日子）、alternating current/AC（交流电）、alternating colors（交替颜色）。","注意区分：alternative（可供选择的替代方案/另类的）强调“选择/替代”，而 alternating 强调“轮流发生”。"]}
{"word":"alternating current","summary":{"en":"Alternating current (AC) is electricity that reverses direction in a regular cycle and is used in most power grids and home outlets.","zh":"交流电（AC）是方向会周期性反转的电流，广泛用于电网与家庭插座供电。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Electric current that regularly changes direction (and usually changes size) in a repeating cycle.","zh":"交流电：电流方向会周期性改变（通常大小也会变化）的电流。"},"examples":[{"en":"Most household electricity is alternating current (AC).","zh":"大多数家庭用电是交流电（AC）。"},{"en":"An AC generator produces alternating current by rotating a coil in a magnetic field.","zh":"交流发电机通过在线圈在磁场中旋转来产生交流电。"}]},{"partOfSpeech":"phrase","definition":{"en":"A power supply system that uses alternating current rather than direct current (DC).","zh":"交流供电系统：使用交流电而非直流电（DC）的供电方式。"},"examples":[{"en":"This charger works with alternating current from a wall outlet and converts it to DC for the phone.","zh":"这个充电器使用墙上插座的交流电，并把它转换成手机需要的直流电。"},{"en":"Factories often use three-phase alternating current for heavy machinery.","zh":"工厂常用三相交流电来驱动重型机器。"}]}],"synonyms":["AC","alternating electricity"],"phonetic":"/ˈɔl.tɚˌneɪ.tɪŋ ˈkɝ.ənt/","extraExplanation":["“alternating current”常缩写为 AC（交流），与 DC（direct current，直流）相对。交流的频率用赫兹（Hz）表示，例如美国常见为 60 Hz，很多地区常见为 50 Hz。","历史上“交流 vs 直流”与19世纪末的“电流之战”（War of Currents）有关：特斯拉与西屋支持交流系统，爱迪生更支持直流系统。交流更容易通过变压器升压/降压，从而适合远距离输电。"]}
{"word":"alternating-day","summary":{"en":"Alternating-day means happening every other day in a repeating pattern.","zh":"alternating-day 指“隔天一次”，按“有一天、隔一天没有”的规律重复。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening every other day; occurring on one day, then not the next, repeating in that pattern.","zh":"隔天一次的；每隔一天发生一次的（今天有，明天没有，如此循环）。"},"examples":[{"en":"She takes the medicine on an alternating-day schedule.","zh":"她按隔天一次的时间表服药。"},{"en":"The class meets on an alternating-day basis (Monday, Wednesday, Friday).","zh":"这门课按隔天的方式上课（周一、周三、周五）。"},{"en":"They follow an alternating-day workout plan to recover better.","zh":"他们采用隔天训练计划，以便更好恢复。"}]}],"synonyms":["every other day","alternate-day"],"phonetic":"/ˈɔl.tɚˌneɪ.tɪŋ deɪ/","extraExplanation":["“alternating-day”常用于医学用药、训练计划或工作排班等语境，强调“隔一天一次”。写法上可作定语：an alternating-day schedule；也可不加连字符写作 alternating day(s)，但作复合形容词放在名词前时加连字符更常见、更清晰。","注意区分：alternating-day（隔天一次）≠ twice a day（一天两次）≠ every day（每天）。常见近义表达是 every other day。"]}
{"word":"alternating-direction","summary":{"en":"Alternating-direction describes something that repeatedly switches back and forth between opposite directions.","zh":"alternating-direction 表示“方向反复在相反两端来回交替”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of movement, flow, or actions) switching back and forth between two opposite directions in a repeating pattern.","zh":"（指运动、流动或行为）在两个相反方向之间反复来回切换、交替进行的。"},"examples":[{"en":"The fan creates an alternating-direction airflow to cool the room evenly.","zh":"这台风扇产生交替方向的气流，让房间降温更均匀。"},{"en":"We used an alternating-direction stirring technique to prevent the sauce from sticking.","zh":"我们用交替方向搅拌的技巧，防止酱汁粘锅。"},{"en":"In the drill, students practiced alternating-direction footwork: left, then right, then left again.","zh":"在训练中，学生练习交替方向的脚步：向左、向右、再向左。"}]}],"synonyms":["back-and-forth","bidirectional (alternating)","reversing","reciprocating"],"phonetic":"/ˈɔl.tɚˌneɪ.tɪŋ dɪˈrɛk.ʃən/","extraExplanation":["这是一个常见的“形容词 + 名词”复合形容词（alternating + direction），多用连字符放在名词前：alternating-direction flow/movement/stirring。放在名词后作表语时也常可不用连字符：The flow is alternating direction（但工程/技术写作里仍常保留连字符以更清晰）。"]}
{"word":"alternating-generation","summary":{"en":"An alternating-generation life cycle switches between two distinct forms, often sexual and asexual stages.","zh":"交替世代指生命周期在两种不同世代形态之间交替出现，常为有性与无性阶段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) A life cycle in which an organism regularly switches between two different forms (generations), often a sexual stage and an asexual stage.","zh":"（生物）一种生命周期：生物会规律地在两种不同形态（两代）之间交替出现，常见为有性世代与无性世代交替。"},"examples":[{"en":"Ferns show alternating generation: a spore-producing stage and a gamete-producing stage.","zh":"蕨类植物有交替世代：一代产生孢子，另一代产生配子。"},{"en":"In many algae, alternating generation helps the species survive changing environments.","zh":"在许多藻类中，交替世代有助于物种在环境变化中生存。"}]}],"synonyms":["alternation of generations","metagenesis"],"phonetic":"/ˈɔl.tɚˌneɪ.tɪŋ ˌdʒɛn.əˈreɪ.ʃən/","extraExplanation":["更常见、标准的术语是 **alternation of generations**（世代交替/交替世代）。你写的 **alternating-generation** 常见于教材或论文中作形容词（如 “alternating-generation life cycle”）或作为连字符形式的名词短语。","典型例子：植物（如苔藓、蕨类）常见 **配子体（gametophyte）** 与 **孢子体（sporophyte）** 两代交替。配子体产生配子（精子/卵），受精后形成孢子体；孢子体产生孢子，孢子发育成配子体。","这个概念也常被拿来对比动物的生命周期：多数动物没有明显的“世代形态交替”，主要以二倍体个体为主。"]}
{"word":"alternating-host","summary":{"en":"An alternating host is one of two (or more) host species a parasite switches between during its life cycle.","zh":"交替宿主指寄生虫在生活史中需要在两种（或多种）宿主之间轮换时，其中的一种宿主。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) A host in a parasite’s life cycle that is used in alternation with another host species; the parasite lives or develops in one host for one stage, then switches to the other host for another stage.","zh":"（生物）交替宿主：寄生虫生活史中与另一种宿主交替使用的宿主；寄生虫在一个宿主体内完成某一阶段后，会转到另一宿主完成另一阶段。"},"examples":[{"en":"Malaria parasites need an alternating host: humans and mosquitoes.","zh":"疟原虫需要交替宿主：人和蚊子。"},{"en":"Researchers traced the disease by identifying the alternating host in the wild.","zh":"研究人员通过找出野外的交替宿主来追踪这种疾病。"}]}],"synonyms":["alternate host","secondary host (context-dependent)"],"phonetic":"/ˈɔl.tɚˌneɪ.tɪŋ hoʊst/","extraExplanation":["“alternating host”常见于寄生虫学与植物病理学，用来强调“需要在不同物种之间轮换”的生活史特征。常与“definitive host（终宿主，进行有性繁殖）”“intermediate host（中间宿主，通常进行无性繁殖或幼体发育）”一起理解。","拼写上有时会写作不加连字符的 alternating host；加连字符 alternating-host 多见于复合形容词或为排版需要而出现。"]}
{"word":"alternating-movement","summary":{"en":"Alternating-movement means a back-and-forth pattern where two sides or actions take turns moving.","zh":"Alternating-movement 指“两侧/两种动作轮流进行”的交替运动（来回切换）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Exercise/biology) A pattern of motion where two sides or parts take turns moving—switching back and forth in a regular rhythm (e.g., left–right, up–down).","zh":"（运动/生物）一种“交替进行”的运动模式：身体两侧或两个部位轮流动作，按规律来回切换（如左—右、上—下）。"},"examples":[{"en":"Walking is an alternating-movement pattern: your left and right legs take turns.","zh":"走路是一种交替运动模式：左右腿轮流迈步。"},{"en":"Many fitness drills use alternating-movement to train coordination.","zh":"很多健身训练用交替运动来练协调性。"}]},{"partOfSpeech":"adj.","definition":{"en":"(General) Describing motion that alternates between two actions, directions, or sides instead of happening all at once.","zh":"（一般）形容“交替进行”的动作：在两种动作、方向或两侧之间来回切换，而不是同时发生。"},"examples":[{"en":"Try an alternating-movement warm-up, like alternating arm circles.","zh":"试试交替运动热身，比如左右手臂交替画圈。"},{"en":"The machine uses an alternating-movement mechanism to reduce vibration.","zh":"这台机器用交替运动的机构来减少震动。"}]}],"synonyms":["alternating motion","back-and-forth movement","reciprocal movement","rhythmic alternation"],"phonetic":"ˈɔl.tɚˌneɪ.tɪŋ ˈmuːv.mənt","extraExplanation":["“alternating-movement”多见于运动训练、舞蹈教学、康复理疗、以及机械结构描述中。它强调“轮流/交替”，常和对称的身体两侧（left/right）或两类动作（push/pull）搭配。","写作上也常见不加连字符的形式“alternating movement”。作为复合形容词放在名词前时更常加连字符：an alternating-movement drill（一个交替动作训练）。"]}
{"word":"alternating-sign","summary":{"en":"Alternating-sign describes a mathematical pattern where terms switch between + and − in sequence.","zh":"alternating-sign 指数学中项的符号按顺序在“+”与“−”之间交替出现的模式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Math) Having signs that switch back and forth between positive (+) and negative (−) in order.","zh":"（数学）符号正负交替出现的；符号在“+”与“−”之间来回切换的。"},"examples":[{"en":"An alternating-sign sequence might look like +, −, +, −, + …","zh":"一个符号交替的数列可能长这样：+、−、+、−、+……"},{"en":"The series 1 − 1/2 + 1/3 − 1/4 + … is an alternating-sign series.","zh":"级数 1 − 1/2 + 1/3 − 1/4 + ……是一个符号交替的级数。"}]}],"synonyms":["alternating","sign-alternating","alternating series (related)"],"phonetic":"/ˈɔl.tɚˌneɪ.tɪŋ saɪn/","extraExplanation":["在数学里，“alternating-sign”常用于描述数列或级数的“项的符号”按顺序正负交替（不是指数值大小交替）。常见相关概念有“alternating series（交错级数）”和“Leibniz test / alternating series test（莱布尼茨判别法/交错级数判别法）”。写作上也常见作定语：an alternating-sign pattern / an alternating-sign sum。"]}
{"word":"alternatingly","summary":{"en":"“Alternatingly” means ‘in an alternating way’—switching back and forth between two things.","zh":"“alternatingly”表示“交替地、轮流地”，强调在两件事之间来回切换。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an alternating way; first one thing, then the other, repeatedly.","zh":"交替地；轮流地（一个接一个，反复进行）。"},"examples":[{"en":"The children sat alternatingly with their parents during the ceremony.","zh":"在典礼上，孩子们交替地和父母坐在一起（一个孩子一个家长这样轮流坐）。"},{"en":"She worked alternatingly in the office and at home throughout the week.","zh":"她一周里在办公室和在家交替地工作。"}]}],"synonyms":["alternately","in turn","one after the other","back and forth"],"phonetic":"/ˈɔl.tɚˌneɪ.tɪŋ.li/","extraExplanation":["“alternatingly”来自形容词“alternating”（交替的）加副词后缀“-ly”。在现代英语里，这个词能用但不算常见；更自然的表达常是：\"alternately\"（更常用，尤其在正式写作中）或用结构表达，如 “A and B alternated / took turns”。\n\n小提醒：\n- “alternately”也常用来表示“或者（两种选择）”，如：\"You can call me or text me, alternately.\"（你可以打电话或发短信；或者也可以……）。\n- “alternatingly”更偏向强调“交替发生的方式”，不太用来表示“二选一”。"]}
{"word":"alternation","summary":{"en":"Alternation means a regular change between things or taking turns; in linguistics, it can mean a change in a word’s form or sound depending on context.","zh":"Alternation指事物之间有规律地交替变化或轮流；在语言学中也可指词形或语音在不同语境/语法条件下的交替变化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a change back and forth between two (or more) things in a regular pattern; taking turns","zh":"（两者或多者之间）交替；轮流；交错变化"},"examples":[{"en":"The alternation of hot days and cool nights is common in the desert.","zh":"沙漠里白天炎热、夜晚凉爽的交替现象很常见。"},{"en":"In the debate, there was an alternation between serious points and jokes.","zh":"在辩论中，严肃观点和玩笑之间不断交替。"},{"en":"The schedule uses an alternation of workdays and rest days.","zh":"这个排班采用工作日与休息日交替的方式。"}]},{"partOfSpeech":"n.","definition":{"en":"(linguistics) a change in the form or sound of a word depending on grammar or environment","zh":"（语言学）词形或语音因语法或语境变化而发生的交替变化"},"examples":[{"en":"English shows vowel alternation in some word families, like “speak” and “speech.”","zh":"英语中有些词族会出现元音交替，例如“speak”和“speech”。"},{"en":"Some languages have consonant alternation when adding endings.","zh":"一些语言在加词尾时会发生辅音交替。"}]}],"synonyms":["switching","rotation","taking turns","interchange","variation"],"phonetic":"/ˌɔl.tɚˈneɪ.ʃən/","extraExplanation":["“alternation”来自“alternate（交替）+ -ation（名词后缀）”，常用于较正式的写作中。日常口语里也常用“taking turns（轮流）”“switching back and forth（来回切换）”来表达相近意思。","与“alternative（可供选择的另一种）”容易混淆：alternative强调“选项/替代方案”，alternation强调“轮流/交替发生的过程”。"]}
{"word":"alternationist","summary":{"en":"An alternationist is someone who supports an alternation-based theory—especially the idea that code-switching alternates between two separate language systems.","zh":"alternationist 指“交替论者”，尤其指认为语码转换是在两套独立语言系统之间交替切换的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Sociolinguistics) A person who supports the view that bilingual speakers switch between two separate language/grammar systems when code-switching (rather than mixing them into one system).","zh":"（社会语言学）主张“交替论”的人：认为双语者在语码转换（code-switching）时是在两套相对独立的语言/语法系统之间来回切换，而不是把两种语言融合成一个系统。"},"examples":[{"en":"Some alternationists argue that code-switching follows clear boundaries between the two grammars.","zh":"一些交替论者认为，语码转换遵循两种语法之间清晰的边界。"},{"en":"In the debate over bilingual speech, she described herself as an alternationist rather than a “mixed-grammar” supporter.","zh":"在关于双语言语的讨论中，她称自己是交替论者，而不是“混合语法”观点的支持者。"}]},{"partOfSpeech":"n.","definition":{"en":"More generally, a person who believes in or advocates an alternation-based theory in a given field.","zh":"（更广义）主张某一领域“交替式”理论的人，即认为现象主要表现为在两种状态/机制之间轮换。"},"examples":[{"en":"As an alternationist, he explained the change as a cycle between two patterns.","zh":"作为交替论者，他把这种变化解释为两种模式之间的循环轮换。"}]}],"synonyms":["supporter of alternationism","code-switching alternation theorist"],"phonetic":"/ˌɔl.tɚˈneɪ.ʃə.nɪst/","extraExplanation":["“alternationist”来自 alternation（交替、轮换）+ -ist（……主义者/支持者）。在语言学里，它常出现在关于双语者语码转换的理论讨论中，通常与把两种语言视为更“融合”的观点形成对比。","该词比较学术化，日常英语中很少用；写作时常需要在前文交代讨论主题（如 code-switching 或 bilingualism），读者才容易理解。"]}
{"word":"alternations","summary":{"en":"Alternations are repeated changes or turn-taking patterns; in linguistics, they are systematic form changes like sing–sang–sung.","zh":"Alternations 指反复的变化或轮流交替；在语言学中指如 sing–sang–sung 这类系统性的词形/语音交替。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"changes between different states, forms, or options (often switching back and forth)","zh":"不同状态、形式或选项之间的变化（常指来回切换）"},"examples":[{"en":"The weather showed constant alternations between sun and rain.","zh":"天气在晴天和下雨之间不断交替变化。"},{"en":"Small alternations in the plan helped us finish on time.","zh":"计划上的一些小调整帮助我们按时完成。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of taking turns; a pattern where people or things happen one after another","zh":"轮流；交替发生的模式"},"examples":[{"en":"We work in alternations: one person cooks, the other washes dishes.","zh":"我们轮流分工：一个人做饭，另一个人洗碗。"},{"en":"The show uses alternations of comedy and serious scenes.","zh":"这部剧在喜剧场景和严肃场景之间交替安排。"}]},{"partOfSpeech":"n.","definition":{"en":"(linguistics) systematic changes in a sound or word form depending on grammar or context","zh":"（语言学）因语法或语境不同而出现的系统性语音或词形变化"},"examples":[{"en":"English has vowel alternations like sing–sang–sung.","zh":"英语有元音交替，如 sing–sang–sung。"},{"en":"Some languages show alternations in a word when it becomes plural.","zh":"有些语言在构成复数时会出现词形交替变化。"}]}],"synonyms":["changes","switches","shifts","variations","turn-taking","rotation"],"phonetic":"ˌɔltɚˈneɪʃənz","extraExplanation":["“alternation(s)”在日常英语里最常见的是“交替/轮换/变动”。在语言学里，它常指“同一个词根在不同语法环境下出现不同形式”，例如元音变化（ablaut）或因发音环境导致的变化。"]}
{"word":"alternative","summary":{"en":"“Alternative” means another option (noun) or something different from the usual used instead (adjective).","zh":"“alternative” 可作名词表示“替代选择/方案”，也可作形容词表示“替代的、非传统的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Another choice or possibility; something you can choose instead of the usual or first option.","zh":"替代选择；可供选择的另一种可能性（用来代替常规或首选）。"},"examples":[{"en":"If you don’t eat meat, tofu is a good alternative.","zh":"如果你不吃肉，豆腐是个不错的替代选择。"},{"en":"We need an alternative plan in case it rains.","zh":"我们需要一个备用方案，以防下雨。"}]},{"partOfSpeech":"adj.","definition":{"en":"Different from the usual; used instead of something else.","zh":"非传统的；替代的（用来代替别的事物）。"},"examples":[{"en":"She takes an alternative route to avoid traffic.","zh":"她走一条替代路线来避开拥堵。"},{"en":"Alternative energy includes wind and solar power.","zh":"替代能源包括风能和太阳能。"}]}],"synonyms":["option","choice","substitute","replacement","other"],"phonetic":"/ɔlˈtɝːnətɪv/","extraExplanation":["“Alternative” 常见搭配：an alternative to (something)（……的替代品/替代方案）；have no alternative but to do…（别无选择只能……）；alternative plan/route/solution（备用方案/路线/解决办法）。","易混点：英式英语中有时会说 “choose between alternatives”（在多个选项中选择）；美式英语里也常用，但日常表达里更常说 “options/choices”。","文化语境：在 “alternative music/alternative medicine” 中，alternative 往往带有“非主流/不同于传统体系”的意味，而不只是“备用”。"]}
{"word":"alternative-history","summary":{"en":"Alternative history imagines a different version of real history by changing a key past event.","zh":"Alternative history（架空历史）通过改写某个关键历史事件，想象一个不同的真实历史版本。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A genre or type of story that imagines how history might have turned out differently if a key event had changed (for example, if a war had ended another way).","zh":"一种假想历史走向的题材：设定某个关键历史事件发生改变，从而推演“如果当时不一样，后来会怎样”。"},"examples":[{"en":"I enjoy alternative-history novels that ask, “What if the Roman Empire never fell?”","zh":"我喜欢那种会问“如果罗马帝国从未灭亡会怎样？”的架空历史小说。"},{"en":"The game is set in an alternative-history version of the 20th century.","zh":"这款游戏的背景设定在一个“另一个版本的20世纪”的架空历史中。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing a story, setting, or idea that uses an imagined version of real history with changed events and outcomes.","zh":"（用于描述）基于真实历史但改写关键事件与结果的；架空历史的。"},"examples":[{"en":"The movie has an alternative-history setting where the space race never ended.","zh":"这部电影的背景是架空历史：太空竞赛从未结束。"},{"en":"She’s writing an alternative-history story about a different outcome of World War II.","zh":"她正在写一篇架空历史故事，设想二战出现不同的结局。"}]}],"synonyms":["alternate history","counterfactual history","what-if history"],"phonetic":"/ɔlˈtɝːnətɪv ˈhɪst(ə)ri/","extraExplanation":["“alternative history”在中文里常见译法有“架空历史”“另类历史”“假想历史”。其中“架空历史”更偏向文学/影视/游戏语境。","这种题材常用的写作手法是设定一个“关键分歧点（point of divergence）”，例如某次选举、战役、科技发明是否发生，从而展开后续连锁变化。","注意与“historical fiction（历史小说）”区分：historical fiction通常在真实历史框架内填充虚构人物/情节；alternative history则直接改写历史走向。"]}
{"word":"alternative-ize","summary":{"en":"Alternative-ize means “to make or present something as an alternative,” and it’s a rare, often academic-style verb.","zh":"Alternative-ize 指“把某事物变成/表述为替代方案”，属于较少见、偏学术/书面风格的动词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make something into an alternative (another option), or to present it as an alternative","zh":"使某事物变成“另一种选择”；或把某事物当作替代方案来提出"},"examples":[{"en":"Some people want to alternative-ize the current plan by offering a cheaper option.","zh":"有些人想把现有方案“替代化”，提出一个更便宜的选项。"},{"en":"The campaign tried to alternative-ize mainstream ideas, saying their approach was a new choice.","zh":"这场竞选试图把主流观点“替代化”，称他们的方法是一个新选择。"}]},{"partOfSpeech":"v.","definition":{"en":"(often in academic or political writing) to emphasize or promote “alternative” culture, viewpoints, or systems","zh":"（多见于学术或政治表达）强调或推动“另类/替代性”的文化、观点或体系"},"examples":[{"en":"The article discusses how music scenes alternative-ize youth identity.","zh":"这篇文章讨论音乐圈如何让青少年身份“另类化”。"},{"en":"Online communities can alternative-ize news by focusing on non-mainstream sources.","zh":"网络社群可能通过关注非主流来源来让新闻“另类化”。"}]}],"synonyms":["offer an alternative","present as an alternative","frame as an alternative","recast","reposition"],"phonetic":"/ɔlˈtɝːnətɪˌvaɪz/","extraExplanation":["“alternative-ize / alternativize”不是常见标准词，更常见的表达是：offer an alternative（提供替代方案）、make it an alternative（把它当作替代方案）、frame it as an alternative（把它表述为替代方案）。","词形上属于把形容词 alternative 加上动词后缀 -ize，含义大致是“使……具有 alternative 的性质”。在正式写作中偶尔可见，但日常口语里可能显得生硬。"]}
{"word":"alternative-medicine","summary":{"en":"Alternative medicine refers to non-mainstream health practices used instead of conventional medical treatment.","zh":"Alternative medicine 指用来取代常规医疗的非主流疗法或保健方法。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"medical treatments and health practices that are used instead of standard (conventional) medicine; often outside mainstream medical training and may have limited scientific evidence.","zh":"替代医学；指用来取代常规（主流）医学的治疗或保健方法，常不属于主流医疗训练体系，且证据支持可能有限。"},"examples":[{"en":"Some people try alternative medicine when conventional treatments don’t relieve their symptoms.","zh":"当常规治疗无法缓解症状时，有些人会尝试替代医学。"},{"en":"Always tell your doctor if you are using alternative medicine, especially if you also take prescription drugs.","zh":"如果你在使用替代医学（尤其同时服用处方药），一定要告知医生。"},{"en":"The clinic offers alternative medicine such as acupuncture and herbal remedies.","zh":"这家诊所提供针灸、草药疗法等替代医学服务。"}]}],"synonyms":["complementary medicine","integrative medicine","holistic medicine"],"phonetic":"/ɔlˈtɝːnətɪv ˈmɛdɪsən/","extraExplanation":["“alternative medicine”常与“complementary medicine（补充/辅助医学）”对比：alternative强调“替代”常规治疗；complementary强调“配合”常规治疗一起用。如今也常说“integrative medicine（整合医学）”，指在重视安全性与证据的前提下，把部分非主流疗法与常规医疗结合。","文化语境中，这个词有时带有争议色彩：一些疗法（如针灸）在某些领域证据较多，但也有一些做法缺乏可靠研究。学习使用时，可搭配“evidence-based（有证据支持的）”“safety（安全性）”“side effects（副作用）”等词更准确。"]}
{"word":"alternatively","summary":{"en":"“Alternatively” means “as another option” or “in a different way,” often used to introduce an alternative plan.","zh":"“Alternatively”表示“作为另一种选择/方式”，常用来引出备选方案。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In another way, or as another option; used when suggesting a different choice or possibility.","zh":"作为另一种方式；或者作为另一种选择/方案；用于提出不同的选择或可能性。"},"examples":[{"en":"We could drive; alternatively, we could take the train.","zh":"我们可以开车；或者，我们也可以坐火车。"},{"en":"Alternatively, you can email the form if you can’t print it.","zh":"如果你无法打印表格，也可以改用电子邮件发送。"}]},{"partOfSpeech":"adv.","definition":{"en":"In an alternating pattern; one after another in turn (less common).","zh":"交替地；轮流地（较少见）。"},"examples":[{"en":"The colors are arranged alternatively in red and white.","zh":"这些颜色以红白交替的方式排列。"}]}],"synonyms":["instead","otherwise","as another option","in another way"],"phonetic":"/ɔlˈtɝːnətɪvli/","extraExplanation":["“Alternatively”常出现在句首或分号后，用来引出“另一个选择/补充方案”，语气比较书面或正式。口语里也常用“or”/“instead”。","常见搭配：“Alternatively, …” “or alternatively …” “Alternatively, you could …”。"]}
{"word":"alternativeness","summary":{"en":"“Alternativeness” means the quality of being an alternative or having other possible options.","zh":"“alternativeness”指“替代性/可替代性”：作为另一种选择的性质，或拥有其他可选方案的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being an alternative (different from the usual choice) or having another possible option","zh":"“替代性/可替代性”：指作为另一种选择的性质，或存在其他可选方案的状态"},"examples":[{"en":"The app’s alternativeness appeals to people who dislike mainstream social media.","zh":"这款应用的“非主流替代性”吸引了不喜欢主流社交媒体的人。"},{"en":"We tested the alternativeness of the design by comparing it with the standard model.","zh":"我们通过与标准模型对比，测试了该设计的可替代性。"},{"en":"In this market, alternativeness is valuable when supply chains break.","zh":"在这个市场里，当供应链中断时，可替代性就很有价值。"}]}],"synonyms":["alternativeness","alternative nature","optionality","availability of alternatives","substitutability"],"phonetic":"/ɔlˈtɝnətɪvnəs/","extraExplanation":["“alternativeness”并不是非常常见的日常用词，更常见的表达包括：\n- “alternativeness”≈ “being an alternative”（作为替代选项的性质）\n- “alternativeness”≈ “availability of alternatives”（有其他选择的程度）\n在学术写作或较正式语境中偶尔会见到，但在口语和一般写作里更自然用 “alternativeness/alternative nature” 的改写，或直接用 “alternatives / options”。","如果你想表达“可替代性（能被替换的程度）”，很多场景用 “substitutability”（经济学/供应链常用）更地道；如果想表达“非主流、替代文化的特质”，用 “alternative vibe / alternative style” 更自然。"]}
{"word":"alternatives","summary":{"en":"“Alternatives” most commonly means other choices or possible substitutes.","zh":"“alternatives”最常见意思是“其他选择”或“替代方案”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a different choice or possibility you can use instead of the original one","zh":"可替代的选择；另一种可能性（代替原来的方案）"},"examples":[{"en":"We need a cheaper alternative to this software.","zh":"我们需要这个软件更便宜的替代方案。"},{"en":"If you don’t like coffee, tea is a good alternative.","zh":"如果你不喜欢咖啡，茶是个不错的替代选择。"}]},{"partOfSpeech":"n.","definition":{"en":"other options or ways of doing something","zh":"其他选择；其他做法（复数形式常见）"},"examples":[{"en":"Let’s discuss the alternatives before we decide.","zh":"在决定之前，我们先讨论一下其他选择。"},{"en":"There are several alternatives to driving, like taking the bus or biking.","zh":"除了开车，还有好几种选择，比如坐公交或骑车。"}]},{"partOfSpeech":"adj.","definition":{"en":"different from the usual or traditional; another style (often in culture, music, or politics)","zh":"非主流的；另类的（常用于文化、音乐或政治语境）"},"examples":[{"en":"She listens to alternative rock.","zh":"她听另类摇滚。"},{"en":"They prefer alternative lifestyles.","zh":"他们更喜欢非传统的生活方式。"}]}],"synonyms":["options","choices","substitutes","replacements","other possibilities"],"phonetic":"/ɔlˈtɝːnətɪvz/","extraExplanation":["“alternative”常见搭配：an alternative to (…的替代方案)；alternative options/solutions（替代选项/方案）。","拼写小提醒：alternative（形容词/名词）；alternatively（副词，表示“或者/作为另一种选择”），如：Alternatively, we could meet online（或者我们也可以线上见）。","文化语境里“alternative”常指非主流、与传统不同的风格或立场，例如 alternative rock（另类摇滚）、alternative media（非主流媒体）。"]}
{"word":"alternativity","summary":{"en":"Alternativity means the quality of having real alternatives—genuine options to choose from (often used in philosophy).","zh":"Alternativity 指“存在真实可行的替代选项/选择余地”的性质或状态（常用于哲学讨论）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often in philosophy) The state or quality of having alternatives; the possibility of choosing between different options.","zh":"（常用于哲学语境）“可替代性/可选择性”：存在不同选项并能够在其间选择的状态或性质。"},"examples":[{"en":"The debate focused on whether genuine alternativity is needed for moral responsibility.","zh":"这场辩论聚焦于：道德责任是否需要真正的“可选择性”。"},{"en":"If the system offers no alternativity, people may feel trapped.","zh":"如果这个体系不给人任何选择余地，人们可能会感到被困住。"}]},{"partOfSpeech":"n.","definition":{"en":"Alternative ways of organizing life, culture, or society; the presence of “other possibilities” beyond the mainstream.","zh":"（较少见）另类的生活/文化/社会组织方式；主流之外“还有别的可能性”的存在。"},"examples":[{"en":"Some artists celebrate alternativity as a space for new voices.","zh":"一些艺术家把“另类可能性”视为新声音出现的空间。"},{"en":"The novel imagines a city built on alternativity rather than uniform rules.","zh":"这部小说想象了一座建立在“多种可能性”而非统一规则之上的城市。"}]}],"synonyms":["optionality","choice","availability of alternatives","freedom of choice","alternativeness"],"phonetic":"/ɔlˌtɝnəˈtɪvɪti/","extraExplanation":["“alternativity”在日常英语中比较少见，更常用的表达是“alternatives / choice / optionality / the ability to choose”。在学术（尤其是伦理学、自由意志、政治哲学）讨论中，它有时用来强调：不仅有不同选项，而且这些选项对行动者来说是“真实可行的”。","词形结构：alternative（替代的/可供选择的）+ -ity（名词后缀，表示“性质/状态”）。","相关概念提示：在“自由意志”讨论里，人们常把“alternativity（可选择性）”与“control（控制）”“responsibility（责任）”一起谈，比如是否必须“could have done otherwise（本可以做别的）”。"]}
{"word":"alternativo","summary":{"en":"Alternativo means “alternative” or “non-mainstream/indie,” but it’s mainly used in Spanish/Italian/Portuguese; in English, the usual word is “alternative.”","zh":"alternativo 表示“替代的”或“非主流/独立风格的”，但主要出现在西/意/葡语中；英语里通常用 alternative。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(From Spanish/Italian/Portuguese) “alternative; different from the usual.”","zh":"（源自西班牙语/意大利语/葡萄牙语）“替代的；不同于常规的”。"},"examples":[{"en":"They chose an alternativo plan when the main option failed.","zh":"当主要方案失败时，他们选择了一个替代方案。"},{"en":"She likes alternativo ideas instead of traditional rules.","zh":"她更喜欢另类的想法，而不是传统规则。"}]},{"partOfSpeech":"adj.","definition":{"en":"“Alternative” in style or culture (often meaning indie, non-mainstream, or countercultural).","zh":"（风格/文化上）“另类的；非主流的；独立风格的”。"},"examples":[{"en":"He listens to alternativo music, not pop.","zh":"他听另类/独立音乐，不怎么听流行乐。"},{"en":"They hang out in alternativo cafés and art spaces.","zh":"他们常去一些非主流的咖啡馆和艺术空间。"}]}],"synonyms":["alternative","unconventional","non-mainstream","indie"],"phonetic":"/ɑlˌtɝːnəˈtivoʊ/","extraExplanation":["“alternativo”本身不是标准英语单词，更常见于西班牙语、意大利语和葡萄牙语。在英语里通常用对应词 “alternative”（替代的/另类的）。","在拉美西语语境中，“música alternativo/alternativa（另类音乐）”常指独立音乐、摇滚、非商业主流风格；用在衣着、生活方式上也可表示“非主流/反传统”。"]}
{"word":"alternativus","summary":{"en":"Alternativus is a Latin/academic form meaning “alternative; offering a choice,” but it’s uncommon in modern English (use “alternative” instead).","zh":"alternativus 是拉丁语/学术形式，意为“替代的；可供选择的”，但在现代英语中很少用（通常用 alternative）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Latin/academic) Alternative; offering a choice between two or more options; relating to an alternative.","zh":"（拉丁语/学术用语）“替代的；可供选择的”；指在两种或多种选项之间提供选择，或与替代方案有关。"},"examples":[{"en":"In older scholarly writing, alternativus can describe an “alternative” explanation.","zh":"在较早的学术写作中，alternativus 可以用来表示“另一种/替代的”解释。"},{"en":"The author uses a Latin term, alternativus, to sound more formal than “alternative.”","zh":"作者用拉丁词 alternativus 来让表达比 “alternative” 更正式。"}]}],"synonyms":["alternative","substitute","optional","other","different"],"phonetic":"/ˌɔl.tɚˈneɪ.tɪ.vəs/","extraExplanation":["alternativus 不是现代英语里的常用词，更常见的是英语单词 alternative。你可能会在拉丁语文献、旧式学术写作、或某些专业命名/注释中看到它，用来营造“古典/正式”的语气。","词形提示：它与英语 alternative 同源（都与“在……之间选择”的概念有关）。如果你的目标是日常或现代学术英语，通常直接用 alternative 就足够清晰自然。"]}
{"word":"alternator","summary":{"en":"An alternator is a machine (often in cars) that generates electricity—AC that is then used to charge the battery and power the vehicle’s systems.","zh":"alternator 指交流发电机，常见于汽车，用来发电并给电瓶充电、为车辆电气系统供电。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device that turns mechanical energy into electrical energy as alternating current (AC), especially in cars to charge the battery and power electrical systems while the engine runs.","zh":"交流发电机：把机械能转换为交流电（AC）的装置；在汽车中常用于给电瓶充电并在发动机运转时为电气系统供电。"},"examples":[{"en":"My car wouldn’t start because the alternator wasn’t charging the battery.","zh":"我的车打不着火，因为交流发电机没有给电瓶充电。"},{"en":"A mechanic tested the alternator to see if it was producing enough voltage.","zh":"修车师傅检测了交流发电机，看它输出电压是否足够。"}]}],"synonyms":["AC generator","generator (general)"],"phonetic":"/ˈɔl.tɚ.neɪ.tɚ/","extraExplanation":["在现代汽车里，“alternator（交流发电机）”通常取代了早期的“generator（直流发电机）”。它输出交流电，但会通过“rectifier（二极管整流器）”把电变成直流电（DC），用于给电瓶充电和供电。","常见相关词：battery（电瓶）、starter（起动机）、serpentine belt（多楔皮带/蛇形皮带）、charging system（充电系统）。如果仪表盘出现电池灯亮、车灯变暗、频繁亏电，可能与 alternator 故障有关。"]}
{"word":"alternators","summary":{"en":"Alternators are machines—most often in cars—that generate AC electricity and keep the battery charged.","zh":"Alternators（alternator 的复数）多指汽车上的交流发电机，用来发电并给电池充电。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a machine (especially in a car) that produces electricity as alternating current and charges the battery while the engine runs","zh":"（尤指汽车上的）交流发电机；发动机运转时发电并给电池充电的装置"},"examples":[{"en":"My car wouldn’t start because the alternator wasn’t charging the battery.","zh":"我的车启动不了，因为交流发电机没有给电池充电。"},{"en":"A mechanic tested the alternator and found it was failing.","zh":"修理工检测了交流发电机，发现它快坏了。"}]},{"partOfSpeech":"n.","definition":{"en":"a device that generates alternating current (AC) electricity in general (not only in vehicles)","zh":"（泛指）交流发电机；产生交流电（AC）的发电装置"},"examples":[{"en":"The backup system uses a small alternator to supply AC power.","zh":"备用系统用一台小型交流发电机来提供交流电。"}]}],"synonyms":["AC generator","generator (general)"],"phonetic":"ˈɔl.tɚˌneɪ.tɚ","extraExplanation":["“Alternators” 是 “alternator” 的复数形式。日常最常见的语境是汽车：它把发动机的机械能转成电能，同时给电瓶（battery）充电并为车灯、空调等供电。","常见故障信号包括：电瓶灯亮（battery warning light）、车灯变暗、怠速时电压不稳、或电瓶反复没电。英语里也常说 “alternator belt”（发电机皮带）和 “voltage regulator”（电压调节器）。"]}
{"word":"alterne","summary":{"en":"Alternate means switching between two things, happening every other time, or an alternative choice.","zh":"Alternate 表示“交替/轮流”“每隔一次”或“备选方案/替代选择”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) happening or used every other time; switching back and forth between two things.","zh":"（形容词）每隔一次发生/使用的；在两者之间交替的。"},"examples":[{"en":"We meet on alternate Fridays.","zh":"我们每隔一个周五见一次。"},{"en":"She took alternate steps to save energy.","zh":"她隔一步走一步来省力。"},{"en":"The plan has an alternate route in case of traffic.","zh":"这个方案有一条备用路线，以防堵车。"}]},{"partOfSpeech":"v.","definition":{"en":"(v.) to change back and forth between two things; to take turns.","zh":"（动词）在两者之间交替；轮流。"},"examples":[{"en":"We alternated between studying and taking short breaks.","zh":"我们在学习和短休之间交替进行。"},{"en":"The kids alternated seats so everyone got a window view.","zh":"孩子们轮流换座位，让每个人都能靠窗。"}]},{"partOfSpeech":"n.","definition":{"en":"(n.) one of two choices or possibilities; a substitute option.","zh":"（名词）二选一中的另一个；替代/备选方案。"},"examples":[{"en":"If this restaurant is full, we have an alternate nearby.","zh":"如果这家餐厅满了，我们附近还有一个备选。"},{"en":"The manager suggested an alternate to the original schedule.","zh":"经理提出了一个替代原定日程的方案。"}]}],"synonyms":["alternative","substitute","other","switch","take turns"],"phonetic":"/ˈɔl.tɚ.neɪt/","extraExplanation":["你输入的“alterne”很可能是拼写少了一个字母的 **alternate**。","注意这个词在英文里常见有两种读音：作**动词**通常重音在后面（alternate /ˈɔl.tɚ.neɪt/），作**形容词/名词**常见重音在前面（/ˈɔl.tɚ.nət/）。日常交流中两种读法都可能听到。"]}
{"word":"alterni","summary":{"en":"“Alterni” isn’t standard English; you probably mean “alternate/alternating/alternatively,” related to taking turns or offering another option.","zh":"“alterni”不是标准英语；你多半想写“alternate/alternating/alternatively”，都与“交替/轮流”或“提供另一种选择”有关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; often a misspelling or incomplete form of words like “alternate,” “alternating,” or “alternatively.”","zh":"不是标准英语单词；常见于把“alternate（交替的/替代的）”“alternating（交替进行的）”或“alternatively（或者；作为替代）”拼错或只输入了一部分。"},"examples":[{"en":"I can’t find “alterni” in an English dictionary—did you mean “alternate”?","zh":"我在英语词典里查不到“alterni”——你是不是想写“alternate”？"},{"en":"Try rewriting the sentence with “alternatively” if you mean “as another option.”","zh":"如果你想表达“作为另一种选择”，可以试着用“alternatively”来改写句子。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Likely intended) “alternate” (adj.): happening in turns; every other.","zh":"（可能想写）alternate（形容词）：轮流发生的；隔一个的。"},"examples":[{"en":"We meet on alternate Fridays.","zh":"我们每隔一个星期五见一次。"},{"en":"The kids sat in alternate seats to avoid chatting.","zh":"孩子们隔一个座位坐，以免聊天。"}]},{"partOfSpeech":"v.","definition":{"en":"(Likely intended) “alternate” (v.): to switch back and forth; to take turns.","zh":"（可能想写）alternate（动词）：交替；轮流。"},"examples":[{"en":"We alternated between studying and taking short breaks.","zh":"我们在学习和短暂休息之间交替进行。"},{"en":"They alternated speaking during the presentation.","zh":"他们在演讲中轮流发言。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Likely intended) “alternatively” (adv.): used to introduce another choice or possibility.","zh":"（可能想写）alternatively（副词）：用于提出另一种选择/可能性。"},"examples":[{"en":"You can email me; alternatively, you can call my office.","zh":"你可以给我发邮件；或者，你也可以打电话到我办公室。"},{"en":"Alternatively, we could postpone the meeting until next week.","zh":"或者，我们可以把会议推迟到下周。"}]}],"synonyms":["alternate","alternating","alternatively","switch","take turns","every other"],"phonetic":"/ˈɔːltɚneɪt/","extraExplanation":["“alternate / alternating / alternatively”都来自拉丁语词根 *alter*（“另一个”）。因此它们都和“在两者之间切换/提供另一种选择”有关。","快速区分：\n- **alternate (adj.)**＝轮流的/隔一个的（alternate days 隔天）\n- **alternate (v.)**＝交替、轮流（alternate A and B 在A与B之间交替）\n- **alternatively (adv.)**＝“或者；作为替代方案”（用于提出另一个选项）","如果你把包含“alterni”的完整句子发来，我可以帮你判断你原本想用哪一个词，并给出更地道的改写。"]}
{"word":"alternifoliate","summary":{"en":"Alternifoliate describes a leaf arrangement where leaves grow one per node, alternating along the stem.","zh":"Alternifoliate 指叶序为互生：每个节位一片叶，沿茎左右交替生长。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a plant or leaves) having leaves arranged alternately along the stem (not in opposite pairs).","zh":"（植物或叶子）互生的；叶子沿茎交替生长（不是成对对生）。"},"examples":[{"en":"The shrub is alternifoliate, with one leaf at each node along the twig.","zh":"这种灌木是互生叶的，枝条的每个节位只有一片叶子。"},{"en":"Many field guides note whether a species is alternifoliate or opposite-leaved.","zh":"许多野外图鉴会标注一个物种是互生叶还是对生叶。"}]}],"synonyms":["alternate-leaved","alternately arranged"],"phonetic":"/ɔlˌtɝnəˈfoʊliˌeɪt/","extraExplanation":["“alternifoliate”常见于植物学描述，属于较正式的书面词。日常更常说 alternate leaves / alternately arranged leaves（叶互生）。","辨别要点：互生（alternate）= 每个节位一片叶，左右交替；对生（opposite）= 每个节位两片叶成对；轮生（whorled）= 每个节位三片或更多。"]}
{"word":"alternipetalous","summary":{"en":"An adjective in botany meaning the petals alternate with the sepals.","zh":"植物学形容词：指花瓣与萼片交互排列。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having petals that alternate with the sepals (each petal is positioned between two sepals rather than directly in front of one).","zh":"（植物学）花瓣与萼片交互排列的；即每一片花瓣位于两片萼片之间，而不是与萼片正对。"},"examples":[{"en":"Many flowers are alternipetalous, with petals positioned between the sepals.","zh":"许多花是交互花瓣的，花瓣长在两片萼片之间。"},{"en":"In an alternipetalous flower, the petals and sepals form two alternating rings.","zh":"在交互花瓣的花中，花瓣与萼片形成两圈交错的结构。"}]}],"synonyms":["intersepalous (less common)","alternating (general, less precise)"],"phonetic":"/ˌɔl.tɚ.nə.pəˈtæl.əs/","extraExplanation":["构词记忆：alterna- 表示“交替的”，petalous 与“花瓣（petal）”有关，所以 alternipetalous 字面就是“花瓣交替排列的”。","这是偏专业的植物学描述词，常见于植物形态学教材、植物检索表（keys）或物种描述中。与之相对的说法是“oppositipetalous”（花瓣与萼片相对/正对）。"]}
{"word":"alternipinnate","summary":{"en":"An adjective used in botany for pinnate leaves arranged alternately along a stem.","zh":"植物学形容词：指羽状复叶在茎上互生排列。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Describing a plant with pinnate (feather-like) leaves that are arranged alternately along the stem, not in opposite pairs.","zh":"（植物学）指羽状复叶（像羽毛一样的复叶）在茎上呈互生排列，而不是成对对生。"},"examples":[{"en":"The shrub has alternipinnate leaves, with each compound leaf attached at a different level along the stem.","zh":"这种灌木的叶子为互生羽状复叶，每片复叶在茎上的着生位置彼此错开。"},{"en":"In the field guide, alternipinnate leaf arrangement helps distinguish this species from similar plants with opposite pinnate leaves.","zh":"在野外图鉴中，“互生羽状复叶”的叶序可用来区分该物种与叶子对生的相似植物。"}]}],"synonyms":["alternate pinnate","alternately pinnate"],"phonetic":"/ˌɔl.tɚ.nəˈpɪn.eɪt/","extraExplanation":["这是一个较少见的植物学形态术语，常见于植物鉴定（field identification）或描述性分类（taxonomy）文本中。","理解它可以拆开看：alterni- 表示“交替/互生”，pinnate 表示“羽状的”。“互生（alternate）”描述的是叶序（phyllotaxy）：沿茎一节一节错开；“羽状（pinnate）”描述的是复叶结构：小叶沿叶轴两侧排列。"]}
{"word":"alternisepalous","summary":{"en":"A botanical adjective meaning the sepals alternate with the petals in position.","zh":"一个植物学形容词，指萼片与花瓣在位置上交互（错位）排列。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having sepals arranged alternately with the petals (the sepals are positioned between the petals rather than directly in front of them).","zh":"（植物学）花萼与花瓣交互排列；即萼片与瓣片错位排列（萼片位于两片花瓣之间，而不是正对花瓣）。"},"examples":[{"en":"In many flowers, the calyx is alternisepalous, so each sepal sits between two petals.","zh":"在许多花中，花萼呈交互萼排列，因此每一片萼片位于两片花瓣之间。"},{"en":"The diagram shows an alternisepalous arrangement when viewed from above.","zh":"从上方观察，这张示意图显示出交互萼排列。"}]}],"synonyms":["alternate-sepal","intersepalous (rare)"],"phonetic":"/ˌɔlˌtɝˌnaɪˈsɛpələs/","extraExplanation":["这是一个较少见但在植物形态学里很实用的术语，常用于描述花部器官的“相对位置”。与之相对的术语是“oppositisepalous”（对萼：萼片与花瓣相对/对齐）。","词源上，alterni- 表示“交替”，-sepalous 来自 sepal（萼片）。阅读植物检索表（flora key）或分类描述时常会遇到这类组合形容词。"]}
{"word":"alternity","summary":{"en":"Alternity usually means the quality of alternating (taking turns), but it is also the name of a sci‑fi tabletop RPG.","zh":"Alternity通常指“交替/轮流的性质”，也可以指科幻桌面角色扮演游戏《Alternity》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being alternate; the idea that two things can take turns or exist as options","zh":"交替性；轮流性；可替换的状态或性质（两个事物轮流出现或作为不同选项存在的概念）"},"examples":[{"en":"The alternity of day and night is one of the most basic patterns in nature.","zh":"昼夜的交替性是自然界最基本的规律之一。"},{"en":"In her essay, she discussed the alternity between hope and fear during hard times.","zh":"在她的文章中，她讨论了艰难时期希望与恐惧之间的交替。"}]},{"partOfSpeech":"n.","definition":{"en":"a science-fiction tabletop role-playing game (as a proper name)","zh":"（专有名词）一款科幻题材的桌面角色扮演游戏《Alternity》"},"examples":[{"en":"He collects older RPG books, including Alternity.","zh":"他收藏较老的RPG规则书，其中包括《Alternity》。"}]}],"synonyms":["alternation","rotation","taking turns","interchange"],"phonetic":"/ɔlˈtɝnɪti/","extraExplanation":["“alternity”作为普通名词非常少见，写作中更常用的是“alternation（交替）”“alternatives（替代选择）”或“alternating（交替的）”。","《Alternity》是1990年代末推出的科幻TRPG（桌面角色扮演游戏）系统名称，因此在游戏圈里更常见为专有名词用法。"]}
{"word":"alternize","summary":{"en":"“Alternize” is a rare verb meaning to make something alternate or take turns; usually you should use “alternate” instead.","zh":"“alternize”是个很少见的动词，意思是使……交替/轮流；通常更建议用“alternate”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare) To make something alternate or happen in turns; to alternate.","zh":"（罕见）使某事物交替进行；轮流；交替。"},"examples":[{"en":"Some writers use different sentence lengths to alternize rhythm and keep the reader engaged.","zh":"有些作者用不同的句子长度来让节奏交替变化，从而吸引读者。"},{"en":"The two teams alternized positions each round.","zh":"两支队伍每一轮轮流换位。"}]}],"synonyms":["alternate","interchange","take turns"],"phonetic":"/ˈɔl.tɚ.naɪz/","extraExplanation":["“alternize”在现代英语中非常少见，更常用的说法是“alternate”（交替/轮流）或“make … alternate”（使……交替）。在正式写作或日常交流里，优先使用“alternate”。"]}
{"word":"alternus","summary":{"en":"Alternus means “alternating,” mainly used in Latin-based scientific contexts (especially biology).","zh":"Alternus 表示“交替的”，主要用于拉丁来源的科学语境（尤其生物学）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Latin; used in English mainly in scientific names) alternating; occurring in turns; arranged alternately.","zh":"（拉丁语；在英语中多见于科学名称）交替的；轮流发生的；交互排列的。"},"examples":[{"en":"In some plant descriptions, “alternus” indicates leaves that grow alternately along the stem.","zh":"在一些植物描述中，“alternus”表示叶子沿茎交互生长（互生）。"},{"en":"The species name may include alternus to show an alternating pattern in its structure.","zh":"某些物种名会包含 alternus，用来说明其结构具有“交替”的特征。"}]}],"synonyms":["alternating","alternate","successive","in turns"],"phonetic":"/ælˈtɝːnəs/","extraExplanation":["“alternus”是拉丁语形容词，意思是“交替的、轮流的”。在英语里它通常不作为日常词汇使用，而是出现在生物分类学的拉丁学名或学术描述中，用来提示某种“交替/互生/轮流”的形态特征。","如果你在植物学里看到它，常见对应概念是“alternate (leaves)”＝“互生叶”（一片一片错开长在茎上），区别于“opposite”＝“对生”。"]}
{"word":"alterocentric","summary":{"en":"Alterocentric means “other-centered”: paying more attention to other people than to yourself.","zh":"Alterocentric 指“以他人为中心”：更关注他人而不是自己。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"focused on other people’s needs, feelings, or viewpoints rather than your own; other-centered.","zh":"以他人为中心的；更关注他人的需求、感受或观点，而非自己的。"},"examples":[{"en":"Her alterocentric attitude made her a good listener and mediator.","zh":"她以他人为中心的态度让她成了很好的倾听者和调解者。"},{"en":"In customer service, an alterocentric approach means trying to see the problem from the customer’s side.","zh":"在客服工作中，以他人为中心的做法就是尽量从顾客的角度看问题。"}]}],"synonyms":["other-centered","other-focused","altruistic","empathetic","considerate"],"phonetic":"/ˌɔl.tɚˈsɛn.trɪk/","extraExplanation":["“alterocentric”比较少见，多用于心理学/社会科学或较正式的写作中。它常与“egocentric（以自我为中心）”对比。","词根提示：alter-（他者、他人）+ -centric（以……为中心）。有时也会和更常见的“other-centered / person-centered”互换使用。","相关概念：在空间/认知研究中你可能会见到“allocentric（以外部参照为中心）”，但它更偏技术含义，不等同于“关心他人”的alterocentric。"]}
{"word":"alters","summary":{"en":"“Alters” most commonly means “changes/modifies” (3rd-person singular of alter).","zh":"“alters” 最常见意思是“改变/修改”（动词 alter 的第三人称单数）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(third-person singular of “alter”) to change something, usually slightly, to improve it or make it suitable for a new purpose.","zh":"（alter 的第三人称单数）改变、修改（通常是小幅度的），以改进或适应新的用途。"},"examples":[{"en":"She alters the dress so it fits better.","zh":"她把裙子改了一下，让它更合身。"},{"en":"The company alters its plan after customer feedback.","zh":"公司根据客户反馈修改了计划。"},{"en":"He alters his schedule when meetings run late.","zh":"会议拖延时，他会调整自己的日程。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) plural of “alter” meaning a person who changes or modifies something (rare in modern everyday English).","zh":"（较少见）alter 的复数：指“改变或修改某事的人”（现代日常英语中很少这样用）。"},"examples":[{"en":"In the story, the alters of history reshape the kingdom’s fate.","zh":"在故事里，历史的改变者重塑了王国的命运。"}]}],"synonyms":["changes","modifies","adjusts","revises","edits"],"phonetic":"/ˈɔltɚz/","extraExplanation":["“alters” 很容易和 “altars”（祭坛的复数）混淆：\n- alters = 改变、修改（动词）\n- altars = 祭坛（名词复数）\n发音也不同：alters /ˈɔltɚz/；altars /ˈɔltɚz/ 在美式里常常同音，因此写作时要特别注意拼写。"]}
{"word":"alterum","summary":{"en":"Alterum is a Latin form meaning “the other (of two),” often quoted in legal maxims.","zh":"alterum 是拉丁语形式，意为“两者中的另一个”，常见于法律格言引语中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin; most often seen in legal phrases) “the other (one) of two.”","zh":"（拉丁语；常见于法律用语）“两者中的另一个”。"},"examples":[{"en":"In the maxim “audi alteram partem,” alteram means “the other side.”","zh":"在格言“audi alteram partem”（听取另一方意见）中，alteram/alterum 表示“另一方（另一边）”。"},{"en":"Some writers quote “alterum non laedere” as “do not harm the other.”","zh":"有些作者引用“alterum non laedere”，意为“不得伤害他人（另一方）”。"}]},{"partOfSpeech":"other","definition":{"en":"“another; a second one” (especially when contrasting two options or people).","zh":"“另一个；第二个”（尤指在两种选择或两个人之间作对比时）。"},"examples":[{"en":"Between the two proposals, they chose alterum (the second/other one).","zh":"在两份提案中，他们选了 alterum（另一份/第二份）。"},{"en":"The text contrasts unum (one) with alterum (the other).","zh":"文本把 unum（一个）与 alterum（另一个）进行对比。"}]}],"synonyms":["the other (of two)","another","the other side"],"phonetic":"ˈæl.tə.rəm","extraExplanation":["“alterum”来自拉丁语形容词 alter（“两者中的另一个”）。严格说它是屈折变化形式之一（常见为中性单数或在特定语境中出现），所以在英语里通常不是日常词汇，而是作为引语出现在法律、哲学或古典文献里。","在英语写作中最常见的相关短语：\n- audi alteram partem：听取另一方意见（程序正义/正当程序的重要原则）\n- alterum non laedere：不伤害他人（常被提及的法律/伦理原则）"]}
{"word":"Altes","summary":{"en":"“Altes” is German for “old,” commonly seen in German phrases or names quoted in English.","zh":"“Altes”是德语“旧的/老的”，多在英语中引用德语短语或名称时出现。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(German) “altes” means “old” and is a form of the adjective “alt,” often used before a neuter noun (e.g., “altes Haus” = “old house”). It may appear in English texts when quoting German names or phrases.","zh":"（德语）“altes”意为“旧的/老的”，是形容词“alt（老的）”的一种形式，常用于修饰中性名词（如“altes Haus”=“老房子”）。在英语里多见于引用德语专有名词或短语时。"},"examples":[{"en":"They visited the altes Rathaus (old town hall) in the city center.","zh":"他们参观了市中心的 altes Rathaus（老市政厅）。"},{"en":"The sign said “altes Haus,” which simply means “old house” in German.","zh":"牌子上写着“altes Haus”，在德语里就是“老房子”的意思。"}]}],"synonyms":["old","ancient","aged"],"phonetic":"/ˈɑltəs/","extraExplanation":["“altes”通常不是英语词汇，而是德语形容词“alt”的变形之一：常见于中性名词前（如 das Haus → altes Haus）。在德语中，形容词会随着名词的性（阴/阳/中）和格的变化而改变词尾。","如果你是在英文阅读中看到“Altes”首字母大写，可能是德语标题/地名/建筑名的一部分（如 Altes Museum = 旧博物馆），大写是因为在德语里名词要大写，或因为它作为专名的一部分。"]}
{"word":"Altesse","summary":{"en":"Altesse is a French word meaning “Highness,” and it can also refer to a French wine grape variety called Altesse (Roussette).","zh":"Altesse 是法语词，意为“殿下 / 高贵的殿下”；它也可指一种法国白葡萄酒葡萄品种 Altesse（又称 Roussette）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(French) a royal or noble title meaning “Highness,” used when addressing or referring to a prince, princess, or other high-ranking noble.","zh":"（法语）“殿下 / 高贵的殿下”，用于称呼或指代王室成员或高级贵族（如王子、公主等）。"},"examples":[{"en":"The invitation was addressed to Her Altesse, the Princess.","zh":"邀请函写给公主殿下（Her Altesse）。"},{"en":"In French court etiquette, people might say “Votre Altesse” (“Your Highness”).","zh":"在法式宫廷礼仪中，人们可能会说“Votre Altesse”（意为“殿下 / 您的殿下”）。"}]},{"partOfSpeech":"n.","definition":{"en":"a name used for certain European agricultural products, especially the Altesse grape (also called Roussette), used to make white wine in parts of France.","zh":"某些欧洲农产品的名称，尤其指“Altesse”葡萄（也叫 Roussette），用于法国部分地区酿造白葡萄酒。"},"examples":[{"en":"This white wine is made from the Altesse grape.","zh":"这款白葡萄酒由 Altesse 葡萄酿造。"},{"en":"The label mentions Altesse (Roussette) as the main variety.","zh":"酒标上写着主要葡萄品种是 Altesse（Roussette）。"}]}],"synonyms":["Highness","Your Highness","Serene Highness","Roussette (grape)"],"phonetic":"/ælˈtɛs/","extraExplanation":["“Altesse”是法语借词，在英语文本里多出现在历史、外交、礼仪或文学语境中，常作为一种带异国色彩的称谓使用。","作为称谓时，常见搭配有：Votre Altesse（您的殿下）、Son Altesse / Her/His Altesse（他/她的殿下）。在英文中有时会斜体或保留大写以强调其为头衔。"]}
{"word":"altesse","summary":{"en":"Altesse is a formal French-derived title meaning “Highness,” used for royalty.","zh":"Altesse 是源自法语的正式头衔，意为“殿下”，用于称呼或指代皇室成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(formal, from French) a title meaning “Highness,” used when speaking to or about a member of a royal family.","zh":"（正式用语，源自法语）对皇室成员的尊称，意为“殿下/阁下（Highness）”。"},"examples":[{"en":"Your Altesse, the guests have arrived.","zh":"殿下，宾客已经到了。"},{"en":"In the French letter, he addressed her as “Votre Altesse.”","zh":"在那封法语信里，他以“Votre Altesse（殿下）”称呼她。"}]}],"synonyms":["Highness","Royal Highness"],"phonetic":"/ælˈtɛs/","extraExplanation":["“altesse”是法语词，在英语里多见于历史、文学、外交或带有法式氛围的语境；日常英语更常说“Your Highness / Her Royal Highness”。","写作中常会大写（Altesse），尤其当它作为正式头衔使用时；是否大写取决于风格与是否指特定人物。","常见搭配：Votre Altesse（您的殿下）、Son Altesse（他的/她的殿下），以及更正式的Son/Her Altesse Royale（皇家殿下）。"]}
{"word":"alteza","summary":{"en":"Alteza is a Spanish-derived title meaning “Highness,” used for royalty or high nobility; it can also mean “height” in Spanish but is rare in English.","zh":"Alteza 源自西班牙语，常用作对皇室/高等贵族的称谓，意为“殿下”；在西班牙语中也可指“高度”，但在英语里较少这样用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Spanish) a royal or noble title meaning “Highness,” used when addressing or referring to a prince, princess, or other high-ranking person.","zh":"（源自西班牙语）皇室或贵族头衔，意为“殿下 / 高贵的阁下”，用于称呼或提及王子、公主等高阶人士。"},"examples":[{"en":"Su Alteza will arrive at the palace this evening.","zh":"殿下今晚将抵达宫殿。"},{"en":"The reporter addressed the princess as Alteza during the interview.","zh":"采访中，记者用“Alteza（殿下）”称呼那位公主。"}]},{"partOfSpeech":"n.","definition":{"en":"In Spanish, it can also mean “height” (the measurement of how tall something is), though this sense is uncommon in English use.","zh":"在西班牙语里也可指“高度/身高”，但这种用法在英语语境中较少见。"},"examples":[{"en":"In Spanish, “alteza” can refer to a mountain’s height.","zh":"在西班牙语中，“alteza”可以指山的高度。"}]}],"synonyms":["Highness","Your Highness"],"phonetic":"/ælˈteɪzə/","extraExplanation":["“Alteza”多见于西班牙语的礼仪称呼体系：常见搭配有“Su Alteza”（殿下），“Su Alteza Real”（王室殿下）。在英语文本里通常作为外来称谓保留原词，常用于历史、外交、王室新闻或文学作品的西班牙语背景场景。"]}
{"word":"altezza","summary":{"en":"Altezza is an Italian word meaning “height” or “altitude,” and sometimes (figuratively) “greatness” or “high status.”","zh":"Altezza 是意大利语，意思是“高度/海拔”，有时也可作比喻表示“崇高/高贵地位”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Italian) height; altitude; the measurement of how tall something is, or how high it is above sea level.","zh":"（意大利语）高度；海拔；指物体有多高，或高于海平面的高度。"},"examples":[{"en":"L’altezza della montagna è oltre 3.000 metri.","zh":"这座山的海拔高度超过3000米。"},{"en":"Controlla l’altezza della sedia prima di comprarla.","zh":"买之前先检查一下椅子的高度。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, Italian) greatness; high rank or elevated status.","zh":"（比喻义，意大利语）崇高；显赫地位；高阶身份。"},"examples":[{"en":"He spoke of the altezza of her ideals.","zh":"他谈到她理想的崇高。"},{"en":"In the novel, the duke’s altezza separates him from ordinary people.","zh":"在小说里，公爵的显赫身份让他与普通人有了距离。"}]}],"synonyms":["height","altitude","stature","elevation"],"phonetic":"/ɑlˈtɛtsə/","extraExplanation":["“Altezza”是意大利语名词，最常见对应英语的 height / altitude。日常意大利语里也常用在“海拔”（altezza sul livello del mare）或“高度尺寸”（altezza del tavolo/porta）等搭配中。","在某些语境中它也可指“身份的高贵/崇高”（比喻义），但比起字面“高度”更依赖上下文。","如果你在英文材料里见到 altezza，通常是保留意大利语风格（如文学、艺术、歌剧/意大利文化相关文本），英文更常直接写 height 或 altitude。"]}
{"word":"Altgeld","summary":{"en":"Altgeld usually refers to Illinois Governor John Peter Altgeld, and by extension to buildings named after him (e.g., Altgeld Hall). It can also mean “old money” in German contexts.","zh":"Altgeld 通常指伊利诺伊州州长约翰·彼得·奥特格尔德，也可指以他命名的建筑（如 Altgeld Hall）。在德语语境中还可指“旧钱/旧币”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) John Peter Altgeld (1847–1902), a German-American politician best known as the progressive Governor of Illinois (1893–1897).","zh":"（专有名词）约翰·彼得·奥特格尔德（1847–1902），德裔美国政治人物，以伊利诺伊州州长（1893–1897）及其进步主义改革著称。"},"examples":[{"en":"Governor Altgeld pushed for labor protections and prison reform in Illinois.","zh":"奥特格尔德州长推动了伊利诺伊州的劳工保护和监狱改革。"},{"en":"Altgeld became nationally known after he pardoned the surviving defendants from the Haymarket Affair.","zh":"奥特格尔德因赦免“干草市场事件”幸存被告而全国闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A name used for places and buildings, especially in Illinois, such as Altgeld Hall (a historic university building).","zh":"（专有名词）用于地名与建筑名，尤其常见于伊利诺伊州，如“奥特格尔德大厅”（Altgeld Hall，历史性大学建筑）。"},"examples":[{"en":"We met outside Altgeld Hall before class.","zh":"我们上课前在奥特格尔德大厅外见面。"},{"en":"Altgeld Hall is a landmark on several Midwestern campuses.","zh":"奥特格尔德大厅是中西部多所校园的地标。"}]},{"partOfSpeech":"n.","definition":{"en":"(From German) “Old money” or outdated currency; a nonstandard/rare English borrowing mainly seen in historical or German-language contexts.","zh":"（源自德语）“旧钱/旧币”，指过时的货币；在英语中较少见，多出现在历史或德语语境中。"},"examples":[{"en":"In the archive, the letter mentions paying a debt in Altgeld.","zh":"在档案里，那封信提到用“旧币（Altgeld）”还债。"}]}],"synonyms":["(proper name) Altgeld Hall (as a related name)","(German sense) old money"],"phonetic":"ˈæltˌɡɛld","extraExplanation":["在美国历史语境里，Altgeld 最常指伊利诺伊州州长 John Peter Altgeld。他在劳工权益、公共工程与监狱改革方面较为“进步主义”，也因对 1886 年“干草市场事件”（Haymarket Affair）相关人员的赦免而引发巨大争议。","不少校园建筑以他命名（如 Altgeld Hall），常与“大学地标、钟楼/哥特式建筑”等印象相关。"]}
{"word":"Altha","summary":{"en":"Altha is most commonly a proper noun used as a feminine given name, and it can also be a U.S. place name (e.g., Altha, Florida).","zh":"Altha 最常见作专有名词：可作女性名字，也可作美国地名（如佛罗里达州的 Altha）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a feminine given name (proper noun), sometimes treated as a variant spelling of Althea","zh":"（女性）名字（专有名词），有时被视为 Althea 的变体拼写"},"examples":[{"en":"Altha is my grandmother’s name.","zh":"Altha 是我奶奶的名字。"},{"en":"Altha Johnson will speak at the meeting today.","zh":"Altha Johnson 今天会在会议上发言。"}]},{"partOfSpeech":"other","definition":{"en":"a place name (proper noun), such as Altha, Florida (a small town in the U.S.)","zh":"地名（专有名词），例如美国佛罗里达州的 Altha（一个小镇）"},"examples":[{"en":"They drove through Altha, Florida on their way to the coast.","zh":"他们去海边的路上开车经过了佛罗里达州的 Altha。"},{"en":"Altha is a quiet rural community.","zh":"Altha 是一个安静的乡村社区。"}]}],"synonyms":["Althea (related name/spelling)"],"phonetic":"/ˈælθə/","extraExplanation":["Altha 多见于英语里的女性名字，也可能与 Althea（常被解释为源自希腊语、含“治愈/医治者”之意）在拼写上相关；不过作为名字时，具体含义常因家庭传统或个人选择而定。","作为地名时，Altha 最常指美国佛罗里达州的 Altha。很多美国小镇名会来自早期定居者姓名、地理特征或历史用法，因此不一定有固定“词义”。"]}
{"word":"Althaea","summary":{"en":"Althaea refers to a genus of mallow plants (including marsh-mallow) and is also a rare female name from Greek mythology.","zh":"Althaea 既指锦葵科的蜀葵属（含药蜀葵等植物），也可作源自希腊神话的少见女性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant genus in the mallow family (Malvaceae), including marsh-mallow (Althaea officinalis); the name is sometimes used in gardening for plants with similar flowers.","zh":"蜀葵属/药蜀葵属（锦葵科）植物的属名，其中包括药蜀葵（Althaea officinalis，常译“药蜀葵/药蜀葵根”）；园艺语境里有时也用来泛指花形相近的锦葵科植物。"},"examples":[{"en":"Marsh-mallow is classified in the genus Althaea.","zh":"药蜀葵被归入蜀葵属（Althaea）。"},{"en":"The herbal guide describes Althaea officinalis as a soothing plant.","zh":"这本草药指南把药蜀葵（Althaea officinalis）描述为具有舒缓作用的植物。"}]},{"partOfSpeech":"n.","definition":{"en":"a female given name, from Greek mythology: Althaea was the mother of Meleager.","zh":"女性名字（源自希腊神话）：阿尔泰亚（Althaea）是墨勒阿革洛斯（Meleager）的母亲。"},"examples":[{"en":"Althaea is an uncommon but classical-sounding name.","zh":"Althaea 是个不常见但很有古典气息的名字。"},{"en":"In Greek myth, Althaea’s story is closely tied to her son Meleager.","zh":"在希腊神话里，Althaea 的故事与她的儿子墨勒阿革洛斯紧密相连。"}]}],"synonyms":["marsh-mallow","hollyhock (related)","Althea (variant spelling)"],"phonetic":"/ælˈθiə/","extraExplanation":["词源提示：Althaea 来自古希腊语，与“治愈/疗愈”相关的词根有关，因此它常出现在草药与植物学命名中。","文化补充：英文里“marshmallow（棉花糖）”最初与药蜀葵（Althaea officinalis）的黏液有关——早期甜点会用这种植物的提取物来制作，后来才逐渐改用明胶等材料。"]}
{"word":"althaea","summary":{"en":"Althaea most commonly refers to the marshmallow plant genus; it is also a female name and a figure from Greek mythology.","zh":"Althaea 最常指“药蜀葵（marshmallow）”所在的植物属；也可作女性名字，并指希腊神话人物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of plants in the mallow family (Malvaceae), especially marshmallow (Althaea officinalis), known for soft flowers and a soothing root traditionally used in herbal remedies.","zh":"锦葵科（锦葵亚科）的一属植物，尤指药蜀葵/药用蜀葵（Althaea officinalis，marshmallow 植物），以柔和的花朵与传统上用于舒缓喉咙等不适的根部而闻名。"},"examples":[{"en":"Marshmallow, or Althaea officinalis, has long been used to soothe sore throats.","zh":"Marshmallow（药蜀葵），即 Althaea officinalis，长期以来被用来缓解喉咙痛。"},{"en":"The garden’s Althaea blooms attracted bees in late summer.","zh":"花园里的 Althaea 在夏末开花，吸引了蜜蜂。"}]},{"partOfSpeech":"n.","definition":{"en":"a female given name; also the name of a figure in Greek mythology (Althaea), the mother of Meleager.","zh":"女性名字；也指希腊神话人物阿尔泰娅（Althaea），为墨勒阿革洛斯（Meleager）之母。"},"examples":[{"en":"Althaea is an uncommon but elegant name.","zh":"Althaea 是个不常见但很典雅的名字。"},{"en":"In Greek myth, Althaea is remembered in the story of Meleager.","zh":"在希腊神话中，Althaea 常与墨勒阿革洛斯的故事一起被提起。"}]}],"synonyms":["marshmallow (plant)","Althaea officinalis","mallow"],"phonetic":"/ælˈθiːə/","extraExplanation":["词源上，Althaea 来自希腊语，常被解释为与“治愈/疗愈”相关（因此与药用蜀葵的传统用途契合）。","“marshmallow（棉花糖）”这个甜食的名字历史上与药蜀葵有关：早期做法会用其根部黏液制作糖果；现代棉花糖通常不再使用这种植物。","希腊神话中 Althaea 与“墨勒阿革洛斯之命系于一段木柴”的故事有关：这是古典文学与神话研究中常被引用的母子悲剧主题。"]}
{"word":"althaeas","summary":{"en":"“Althaeas” usually means the plural of Althaea: either multiple people named Althaea/Althea or multiple plants in the genus Althaea (marshmallow plant relatives).","zh":"“althaeas”通常是 Althaea 的复数：可能指多个叫 Althaea/Althea 的人，或指蜀葵属（Althaea，含“棉花糖植物”药蜀葵）的一类植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(proper noun) A female given name: Althaea (also spelled Althea).","zh":"（专有名词）女性名字：Althaea（也常拼作 Althea）。"},"examples":[{"en":"Althaea introduced herself and spelled her name for the receptionist.","zh":"Althaea 做自我介绍，并为接待员拼写了她的名字。"},{"en":"In the story, Althaea is the character who helps the lost child.","zh":"在故事里，Althaea 是帮助迷路孩子的角色。"}]},{"partOfSpeech":"n.","definition":{"en":"(botany) A genus of flowering plants in the mallow family, including the marshmallow plant (Althaea officinalis).","zh":"（植物）锦葵科（mallow family）的一属开花植物，包括药蜀葵/蜀葵属植物，如药蜀葵（Althaea officinalis，常与“marshmallow 植物”相关）。"},"examples":[{"en":"Althaea officinalis is often associated with the historical origin of marshmallow sweets.","zh":"药蜀葵（Althaea officinalis）常被认为与“棉花糖”甜点的历史起源有关。"},{"en":"The garden label read “Althaea,” but the guide also called it marsh mallow.","zh":"花园标签写着“Althaea”，但导览也把它叫作 marsh mallow（药蜀葵）。"}]}],"synonyms":["Althea (common spelling)"],"phonetic":"/ælˈθiːə/","extraExplanation":["“Althaea”源自希腊语，和“治疗、治愈”的含义有关；因此它既可作人名，也常出现在植物学命名中。","你输入的“althaeas”更可能是“Althaea”的复数（指多株/多个物种）或是把人名写成复数形式；如果你想表达“Althea’s（某人的）”，需要撇号：Althea’s."]}
{"word":"althaein","summary":{"en":"“althaein” isn’t a common English word; it’s likely a misspelling or a rare form related to “Althaea/Althea.”","zh":"“althaein”不是常见英语词；更可能是拼写错误或与“Althaea/Althea”相关的罕见形式。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard modern English word. It appears to be a rare or misspelled form, most likely related to “Althaea” (a plant genus, e.g., marshmallow plant) or “Althea” (a given name).","zh":"不是现代英语中的常用词。它看起来像是非常罕见或拼写错误的形式，最可能与“Althaea”（植物属名，如蜀葵属/药蜀葵、棉花糖草）或“Althea”（人名）有关。"},"examples":[{"en":"I couldn’t find “althaein” in standard English dictionaries; did you mean “Althaea” (the marshmallow plant)?","zh":"我在常见英语词典里找不到“althaein”；你是不是想写“Althaea”（药蜀葵/棉花糖草）？"},{"en":"If “althaein” is from a fantasy book or a game, tell me the sentence and I can help interpret it.","zh":"如果“althaein”来自小说/游戏等虚构作品，把原句发我，我可以帮你判断含义。"}]}],"synonyms":["Althaea","Althea"],"phonetic":"/ælˈθeɪɪn/","extraExplanation":["“Althaea”来自希腊语，和“治疗、治愈”相关，因此这种植物在传统草药语境中较常出现（如舒缓咽喉、黏膜）。你写的“althaein”可能是把属名/词根变形后拼出来的形式，或是某个作品里的专有名词。","如果你能提供：①你看到它的上下文句子，②是否是人名/地名/道具名，③来源（书名/游戏名/网页链接），我可以更准确地给出释义与用法。"]}
{"word":"Althaemenes","summary":{"en":"Althaemenes is a tragic prince in Greek mythology who tries to escape a prophecy of killing his father but ends up fulfilling it by accident.","zh":"Althaemenes 是希腊神话中的悲剧王子：为逃避“弑父”预言而出走，却最终意外应验预言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A figure in Greek mythology: a Cretan prince (son of King Catreus) who fled to Rhodes to avoid a prophecy that he would kill his father, but later accidentally fulfilled it and then died tragically (in some versions, by being swallowed by the earth).","zh":"希腊神话人物：克里特岛王子（卡特柔斯王之子）。他为躲避“将杀父”的预言而逃往罗得岛，但后来仍在误会与意外中应验预言，结局悲剧（有的版本说他被大地吞没而死）。"},"examples":[{"en":"In Greek myth, Althaemenes leaves Crete to escape a prophecy, but fate catches up with him anyway.","zh":"在希腊神话中，Althaemenes 为逃避预言离开克里特岛，但命运最终仍追上了他。"},{"en":"The story of Althaemenes is often read as a warning about trying to outrun fate.","zh":"Althaemenes 的故事常被解读为：试图逃避命运反而可能走向命运。"}]}],"synonyms":["(no true synonyms; a proper name)"],"phonetic":"/ælˈθiːməˌniːz/","extraExplanation":["这个名字常见于古典神话梗概与家族谱系（genealogy）中：他是克里特王卡特柔斯（Catreus）的儿子。为避免弑父预言而自我放逐到罗得岛（Rhodes），却在父亲寻子途中因误认与冲突而导致悲剧，带有强烈的“宿命/预言无法逃避”的主题。","读古典作品或神话改写时，可以把他和类似主题人物对比记忆：如俄狄浦斯（Oedipus）同样“越躲越中”。"]}
{"word":"althaz","summary":{"en":"“althaz” is not recognized as a standard English word; it’s likely a typo, a name, or context-specific slang.","zh":"“althaz”不是标准英语词；更可能是拼写错误、人名或特定语境下的用语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name, or a shortened form used in a specific community or language.","zh":"不是标准英语单词。可能是拼写错误、人名，或某个社群/语言里的缩写或用语。"},"examples":[{"en":"I couldn’t find “althaz” in an English dictionary—did you mean “altho” (although) or “Althaus” (a surname)?","zh":"我在英语词典里找不到“althaz”——你是不是想写“altho”（although 的非正式写法）或“Althaus”（姓氏）？"},{"en":"Please share the full sentence with “althaz,” and I can infer the meaning from context.","zh":"请把包含“althaz”的完整句子发我，我可以根据语境帮你判断意思。"}]}],"extraExplanation":["“althaz”看起来像是拼写打错或把某个词/名字听写成了英文。最常见的接近项是：\n1) although（尽管），非正式缩写有时写作 altho/altho’；\n2) 以 -az 结尾的可能是名字/网名（例如某些游戏ID）或外来语转写。\n如果你告诉我它出现的场景（聊天、歌词、小说、游戏、课堂笔记等）以及原句，我能更准确地给出对应词条。"]}
{"word":"Althea","summary":{"en":"Althea is most commonly a female first name; it can also refer to the plant genus Althaea (marsh mallow).","zh":"Althea 最常见是女性名字；也可指植物属名 Althaea（如药蜀葵/沼泽蜀葵）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (first name).","zh":"女性名字（名）。"},"examples":[{"en":"Althea moved to Chicago for her new job.","zh":"Althea 为了新工作搬到了芝加哥。"},{"en":"We named our daughter Althea because we liked how it sounds.","zh":"我们给女儿取名叫 Althea，因为我们喜欢这个名字的发音。"}]},{"partOfSpeech":"n.","definition":{"en":"(also Althaea) a group of plants in the mallow family, especially marsh mallow; sometimes used in gardening contexts.","zh":"（亦作 Althaea）锦葵科的一类植物，尤指药蜀葵/沼泽蜀葵；有时用于园艺语境。"},"examples":[{"en":"Marsh mallow (Althaea officinalis) has been used in traditional herbal remedies.","zh":"药蜀葵（Althaea officinalis）在传统草药疗法中曾被使用。"},{"en":"The gardener planted Althaea near the fence for its soft, pale flowers.","zh":"园丁把 Althaea 种在篱笆旁，欣赏它柔和的浅色花。"}]}],"synonyms":["given name","Althaea","marsh mallow"],"phonetic":"/ælˈθiːə/","extraExplanation":["Althea 源自希腊语，常被解释为与“治愈/疗愈”相关（与药用植物“药蜀葵”同源），因此有时被赋予“治愈、健康”的联想。","在英语文化里它主要作为人名使用；在流行文化中也可能让人联想到 Grateful Dead 的歌曲《Althea》（1979）。"]}
{"word":"altheas","summary":{"en":"“Altheas” most commonly means garden shrubs (althea/rose of Sharon); it can also be the plural of the name Althea.","zh":"“Altheas”最常指庭院里的木槿类灌木（althea/rose of Sharon）；也可指名字 Althea 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of althea: a flowering shrub (Hibiscus syriacus), often grown in gardens; also called rose of Sharon (in many U.S. contexts).","zh":"althea 的复数：一种常见庭院观赏开花灌木（木槿/叙利亚木槿，Hibiscus syriacus），在美国语境中常也叫“Rose of Sharon（沙仑玫瑰）”。"},"examples":[{"en":"The altheas by the fence bloom from midsummer into fall.","zh":"篱笆旁的木槿（altheas）从仲夏一直开到秋天。"},{"en":"She planted two altheas to attract bees and butterflies.","zh":"她种了两棵木槿（altheas）来吸引蜜蜂和蝴蝶。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of Althea: a female given name.","zh":"Althea 的复数：女性名字（Althea）。"},"examples":[{"en":"In the class photo, there are two students named Althea—so the teacher calls them “the Altheas.”","zh":"班级合照里有两个同名的 Althea，所以老师叫她们“两个 Althea”。"}]}],"synonyms":["rose of Sharon","Hibiscus syriacus"],"phonetic":"/ælˈθiəz/","extraExplanation":["在园艺英语里，althea 常指“叙利亚木槿/木槿”（Hibiscus syriacus），而“蜀葵/药蜀葵”（Althaea officinalis，marshmallow plant）是另一个不同的植物属名 Althaea，容易混淆。","Althea 这个名字源自希腊语词根，常被解释为与“治疗/治愈”有关（引申为“疗愈者”的意象），在文学与神话中也可见到该名的变体。"]}
{"word":"Althee","summary":{"en":"“Althee” is usually a rare spelling of the given name “Althea,” linked to the idea of healing.","zh":"“Althee”通常是人名“Althea”的少见拼写，与“治愈、健康”之意相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare spelling of the female given name “Althea,” often associated with the meaning “healing” or “wholesome” (from Greek roots).","zh":"女性名字“Althea”的少见拼写形式，常与“治愈、健康、完整”之意相关（源自希腊语词根）。"},"examples":[{"en":"Her name is Althee, spelled A‑L‑T‑H‑E‑E.","zh":"她的名字是 Althee，拼作 A‑L‑T‑H‑E‑E。"},{"en":"Althee is an uncommon name, so people sometimes ask how to pronounce it.","zh":"Althee 这个名字不常见，所以人们有时会问怎么读。"}]}],"synonyms":["Althea"],"phonetic":"/ælˈθiː/","extraExplanation":["“Althee”在英语里并不是常见词汇，更多被当作人名拼写。更常见的形式是“Althea”（常见读音类似 /ælˈθiːə/），而“Althee”往往读得更短一些（/ælˈθiː/）。","文化上你可能会在文学或音乐中看到“Althea”（如常作为古典感的女性名，或与植物名“Althaea/Althea（蜀葵/药蜀葵属）”有关），但“Althee”本身多是个性化拼写。"]}
{"word":"Altheimer","summary":{"en":"“Altheimer” is usually a surname, and it can also refer to the town of Altheimer in Arkansas, USA.","zh":"“Altheimer”通常是姓氏，也可指美国阿肯色州的阿尔特海默镇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name).","zh":"（姓氏）阿尔特海默 / 阿尔泰默（音译姓氏）"},"examples":[{"en":"Dr. Altheimer published a study on rural health care.","zh":"阿尔特海默博士发表了一项关于农村医疗的研究。"},{"en":"I met Ms. Altheimer at the conference.","zh":"我在会议上见到了阿尔特海默女士。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name, especially Altheimer, a small town in Arkansas, USA.","zh":"（地名）阿尔特海默镇：美国阿肯色州的一个小镇"},"examples":[{"en":"He grew up near Altheimer, Arkansas.","zh":"他在阿肯色州的阿尔特海默镇附近长大。"},{"en":"Our route passes through Altheimer on the way to Pine Bluff.","zh":"我们去派恩布拉夫的路上会经过阿尔特海默镇。"}]}],"phonetic":"/ˈælθaɪmɚ/","extraExplanation":["“Altheimer”是专有名词，常见于人名（姓氏）或地名，因此具体含义要看上下文。","容易与“Alzheimer’s (disease)”（阿尔茨海默病）混淆；拼写不同：Altheimer ≠ Alzheimer’s。"]}
{"word":"althein","summary":{"en":"“Althein” is most likely a surname (proper name), not a standard English word.","zh":"“Althein”很可能是姓氏（专有名词），不是标准英语单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A surname (family name). It is not a common English vocabulary word, and it usually appears as a person’s last name.","zh":"一个姓氏（家族姓）。它不是常见的英语词汇，通常作为人的姓出现。"},"examples":[{"en":"Dr. Althein will see you now.","zh":"Althein 医生现在会见你。"},{"en":"I found an article written by Althein in the journal.","zh":"我在期刊里找到一篇由 Althein 撰写的文章。"}]}],"phonetic":"/ˈælθaɪn/","extraExplanation":["“Althein”在常规英语词典里通常不作为词条出现，更常见的是人名/姓氏或品牌名。","如果你是在句子里看到的，发我原句（或截图）我可以帮你判断是不是拼写错误（例如是否想写 atheism, alt+something 等），并给出正确词义与用法。"]}
{"word":"altheine","summary":{"en":"Altheine usually refers to L-theanine, an amino acid in tea linked with relaxation and focus.","zh":"Altheine 通常指 L-theanine（L-茶氨酸），一种存在于茶叶中的氨基酸，常与放松和专注相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled L-theanine) an amino acid found naturally in tea leaves, often taken as a supplement for relaxation and focus.","zh":"（通常拼作 L-theanine）一种天然存在于茶叶中的氨基酸，也常作为膳食补充剂被服用，用于帮助放松与专注。"},"examples":[{"en":"Green tea contains L-theanine, which many people say helps them feel calm but alert.","zh":"绿茶含有 L-茶氨酸，很多人说它能让人放松但保持清醒。"},{"en":"She takes L-theanine before studying to reduce stress.","zh":"她在学习前会服用 L-茶氨酸来减轻压力。"}]}],"synonyms":["L-theanine","theanine"],"phonetic":"/ˈlˌθiːəniːn/","extraExplanation":["“altheine”有时被当作旧称或误拼，最常见、最标准的写法是“L-theanine”（L-茶氨酸 / 茶氨酸）。在食品与营养品语境里通常用这一拼法。","它常与咖啡因一起被提到：一些人认为两者搭配能提升专注同时降低“心慌/紧张”的感觉。不过个体差异较大，若有健康状况或在用药，使用补充剂前最好咨询专业人士。"]}
{"word":"Altheta","summary":{"en":"“Altheta” is not a common standard English word; it is usually a rare spelling of the name Althea/Alethea.","zh":"“Altheta”不是常见标准英语词；通常是人名 Althea/Alethea 的罕见拼写变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare spelling variant (often a misspelling) of the female given name **Althea** or **Alethea**.","zh":"一种罕见的拼写形式（常见为拼写错误），多用于女性名字 **Althea** 或 **Alethea** 的变体。"},"examples":[{"en":"I think “Altheta” might be intended as “Althea”—is that the spelling you want?","zh":"我觉得“Altheta”可能是想写“Althea”——你想用的是这个拼法吗？"},{"en":"Her name is written as Altheta on the form, but her passport says Althea.","zh":"表格上写的是 Altheta，但她的护照上是 Althea。"}]}],"synonyms":["Althea","Alethea"],"phonetic":"/ælˈθiːə/","extraExplanation":["“Altheta”本身并不是英语里常见的标准单词或固定拼法，更像是名字的非标准写法。常见的对应名字有：\n- **Althea**：源自希腊语，常被解释为“有治愈力量的（with healing power）”。\n- **Alethea**：也源自希腊语，含义接近“真理/真实（truth）”。\n如果你是在小说、人名、账号名或品牌名里见到“Altheta”，它也可能是作者/品牌刻意创造的拼写，用来营造独特感。"]}
{"word":"Althing","summary":{"en":"Althing: Iceland’s national parliament, famous for its very long history.","zh":"Althing：冰岛的国家议会，以历史悠久而著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the national parliament of Iceland; one of the world’s oldest continuing legislatures","zh":"冰岛的国家议会；世界上最古老、持续运作至今的议会之一"},"examples":[{"en":"The Althing meets in Reykjavík, Iceland’s capital.","zh":"冰岛议会（Althing）在首都雷克雅未克开会。"},{"en":"In school, we learned that the Althing was founded around the year 930.","zh":"在学校里我们学到，冰岛议会（Althing）大约在公元930年建立。"}]}],"synonyms":["Icelandic Parliament","Alþingi"],"phonetic":"/ˈɑlθɪŋ/","extraExplanation":["“Althing”也常写作冰岛语拼写“Alþingi”（字母þ读起来接近英语的th音）。这个词来自古诺尔斯语，意为“全民/总集会”，反映了早期北欧社会通过集会来立法与裁决纠纷的传统。","历史上，Althing最早在Þingvellir（辛格维利尔）召开露天集会；今天它是现代议会制度的一部分，但在冰岛文化记忆中仍象征着早期的公共讨论与法律传统。"]}
{"word":"althionic","summary":{"en":"“Althionic” is not a common standard English word; it is probably a misspelling, often related to chemistry terms like “thionic/polythionic.”","zh":"“althionic”并非常见标准英语词，更可能是拼写错误，常与化学术语“thionic/polythionic”相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not a standard English word in general use; it is most likely a misspelling or a rare technical form related to chemistry (often confused with “thionic” or “polythionic,” which describe certain sulfur–oxygen acids).","zh":"不是常见或标准的英语词；更可能是拼写错误，或极少见的化学术语形式（常与“thionic / polythionic”混淆，后者与含硫含氧的酸有关）。"},"examples":[{"en":"I couldn’t find “althionic” in major dictionaries; did you mean “thionic” or “polythionic”?","zh":"我在主要词典里找不到“althionic”；你是不是想写“thionic”或“polythionic”？"}]}],"phonetic":"/ælˈθaɪ.ɑn.ɪk/","extraExplanation":["“thionic acids / polythionic acids（硫代酸/多硫代酸）”是无机化学里的术语，用来指一类含硫、氧的酸（与硫的不同连接方式有关）。如果你是在化学论文、实验报告或成分表里看到“althionic”，建议你把原句/上下文贴出来，或核对是否其实是“thionic / polythionic / althion-”等词根相关的拼写。"]}
{"word":"altho","summary":{"en":"“altho” is an informal spelling of “although,” used to introduce contrast.","zh":"“altho”是“although”的非正式拼写，用来引出转折、对比。"},"definitions":[{"partOfSpeech":"conj.","definition":{"en":"an informal spelling of “although,” meaning “despite the fact that” or “even though.”","zh":"“although”的非正式拼写，表示“尽管/虽然（事实如此）”。"},"examples":[{"en":"Altho it was raining, we still went for a walk.","zh":"尽管在下雨，我们还是去散步了。"},{"en":"I like the movie, altho the ending is confusing.","zh":"我喜欢这部电影，尽管结尾有点让人困惑。"}]}],"synonyms":["although","though","even though"],"phonetic":"/ɔlˈðoʊ/","extraExplanation":["“altho”多见于短信、聊天、随笔或非正式笔记中；正式写作（邮件、论文、简历、报告）一般用完整形式“although”。","读音与“although”相同，只是把拼写简化了；语气上也更口语、更随意。"]}
{"word":"althorn","summary":{"en":"An althorn is a brass instrument (alto horn) in E♭, common in brass bands.","zh":"Althorn 指一种降E调的铜管乐器（中音号/alto horn），常用于铜管乐队。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brass wind instrument in the saxhorn family, pitched in E♭, similar to a small euphonium; often called an “alto horn” (and in British English, often “tenor horn”).","zh":"一种萨克号（saxhorn）家族的铜管乐器，通常为降E调，外形像缩小版的上低音号；英语里常称“alto horn”（英式英语中常叫“tenor horn”）。"},"examples":[{"en":"The band featured an althorn carrying the warm inner harmonies.","zh":"乐队里有一把中音号（althorn）来承担温暖的中声部和声。"},{"en":"She switched from trumpet to althorn for the brass band competition.","zh":"为了参加铜管乐队比赛，她从小号改学中音号（althorn）。"}]}],"synonyms":["alto horn","tenor horn","E-flat horn"],"phonetic":"/ˈælt.hɔrn/","extraExplanation":["“Althorn”常见于德语语境，字面意思是“中音号”。在英语资料里更常写作“alto horn”。","它多用于铜管乐队（brass band）或管乐团（concert band），音色圆润，常负责中间声部的旋律或和声支撑。"]}
{"word":"althorns","summary":{"en":"“Althorns” usually means “alto horns,” a type of brass instrument; the spelling comes from German “Althorn.”","zh":"“althorns”通常指“alto horns（中音号）”，这种拼写多受德语“Althorn”影响。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural) alto horn(s): a brass instrument similar to a tenor horn, often used in brass bands; “althorn” is a less common spelling influenced by German (Althorn).","zh":"（复数）中音号：一种铜管乐器，外形与次中音号相近，常见于铜管乐队；“althorn”是受德语 Althorn 影响的较少见拼写。"},"examples":[{"en":"The brass band added two althorns to warm up the middle harmonies.","zh":"这支铜管乐队加了两把中音号，让中声部的和声更温暖。"},{"en":"In some instrument catalogs, “althorn” is used instead of “alto horn.”","zh":"在一些乐器目录里，会用“althorn”来代替“alto horn”。"}]}],"synonyms":["alto horns","tenor horns"],"phonetic":"/ˈæltoʊ hɔrnz/","extraExplanation":["“Althorn”主要见于德语或受德语影响的语境：Alto=中音，Horn=号。英语里更常写作“alto horn”（两词）或称作“tenor horn”（尤其在英式铜管乐队传统中）。","如果你想表达“满是荆棘/都是刺”，英语通常不会写成“althorns”，而会说“all thorns”或“full of thorns”。"]}
{"word":"Although","summary":{"en":"Although introduces a contrast and means “in spite of the fact that…”.","zh":"Although用于引出转折，表示“尽管……/虽然……”。"},"definitions":[{"partOfSpeech":"conj.","definition":{"en":"used to introduce a contrast: it means “in spite of the fact that …” and is followed by a clause (subject + verb).","zh":"用于引出转折：表示“尽管……/虽然……”，后面接从句（主语+动词）。"},"examples":[{"en":"Although it was raining, we went for a walk.","zh":"虽然在下雨，我们还是去散步了。"},{"en":"I enjoyed the trip, although it was a bit expensive.","zh":"我很喜欢这次旅行，尽管有点贵。"},{"en":"Although she’s young, she’s very experienced.","zh":"虽然她很年轻，但她非常有经验。"}]}],"synonyms":["though","even though","while (contrast)","whereas"],"phonetic":"/ɔlˈðoʊ/","extraExplanation":["“although”常见结构：Although + 从句, 主句（更常见）；也可以主句 + although + 从句（更口语、更像补充信息）。","与“but”通常不连用：不要说“Although …, but …”。应选其一：用“Although …, …”或“… , but …”。","“though”语气更口语、位置更灵活（可句末：It’s hard, though.）；“although”更正式，多放句首或句中。","“even though”表示更强烈的让步/出乎意料的对比：Even though he was tired, he kept working（即使很累也继续工作）。"]}
{"word":"although","summary":{"en":"Although introduces a contrast, meaning “in spite of the fact that.”","zh":"Although 用来引出转折，意思是“尽管……；虽然……”。"},"definitions":[{"partOfSpeech":"conj.","definition":{"en":"Used to introduce a contrast: “in spite of the fact that.”","zh":"用于引出转折： “尽管……；虽然……（但……）”。"},"examples":[{"en":"Although it was raining, we went for a walk.","zh":"虽然在下雨，我们还是去散步了。"},{"en":"She kept working although she was tired.","zh":"尽管她很累，她还是继续工作。"},{"en":"Although he apologized, I was still upset.","zh":"虽然他道歉了，我还是很生气。"}]}],"synonyms":["though","even though","while (in the sense of contrast)"],"phonetic":"ɔlˈðoʊ","extraExplanation":["用法提示：although 常放在句首或句中，引导让步从句；主句里常出现转折结果（但不一定要用 but）。一般不说 “although ... but ...”（口语偶尔会听到，但正式英语里应避免）。","近义对比：though 更口语、更灵活（可放句末：It’s hard, though.）；even though 语气更强，表示“即使……也……”。"]}
{"word":"although-like","summary":{"en":"“Although-like” means “similar to ‘although’ in meaning or grammar,” typically introducing a contrast (a concessive idea).","zh":"“although-like” 指“在意义或语法功能上像 although 一样”，通常用来引出让步/转折。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling or functioning like the conjunction “although”; used to describe words/clauses that introduce a contrast or concession.","zh":"“although（虽然/尽管）式的”；指在功能上像 although 一样，用来引出转折或让步的词/从句。"},"examples":[{"en":"In this sentence, “even though” is an although-like connector.","zh":"在这个句子里，“even though” 是一种 although-like（让步转折）连接词。"},{"en":"Some languages have special although-like endings that show contrast.","zh":"有些语言有专门的 although-like 词尾，用来表达转折或让步。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Linguistics) Describing a clause or structure that behaves like an “although” clause (a concessive clause).","zh":"（语言学）形容像 “although 从句” 那样运作的结构（让步从句）。"},"examples":[{"en":"The writer added an although-like clause to soften the criticism.","zh":"作者加了一个 although-like（让步）从句，让批评听起来更委婉。"},{"en":"Although-like clauses often come at the beginning, but they can also appear later.","zh":"Although-like（让步）从句常放在句首，但也可以放在后面。"}]}],"synonyms":["though-like","concessive","contrastive"],"phonetic":"ɔlˈðoʊ laɪk","extraExplanation":["“although-like” 不是日常英语中常见的固定词汇，更常出现在语法/语言学讨论里，用来概括“像 although 一样表示让步转折”的表达。","常见的 although-like 表达包括：though, even though, although, while（表示对比时）, whereas。注意：like 本身不等于 although；这里的 like 是“像……一样”的意思。"]}
{"word":"alti","summary":{"en":"“Alti” is commonly an informal short form of “altitude,” and it can also refer to the word part meaning “high/height” in related terms.","zh":"“alti”常见作“altitude（海拔/高度）”的非正式缩写；也可指表示“高/高度”的构词成分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Short for “altitude,” especially in aviation, hiking, weather, or mapping contexts.","zh":"（非正式）“altitude（海拔/高度）”的缩写，常见于航空、徒步、天气或地图语境。"},"examples":[{"en":"What’s our alti right now—are we cruising at 30,000 feet?","zh":"我们现在的alti是多少——是不是在三万英尺巡航？"},{"en":"The app shows your alti and how many meters you’ve climbed.","zh":"这个应用会显示你的海拔（alti）以及你爬升了多少米。"}]},{"partOfSpeech":"other","definition":{"en":"A word part (combining form) meaning “high” or “height,” from Latin, seen in words like “altimeter” and “altitude.”","zh":"构词成分（组合词根），表示“高/高度”，源自拉丁语，常见于altimeter（测高仪）、altitude（海拔/高度）等词。"},"examples":[{"en":"In “altitude,” alti- relates to height.","zh":"在“altitude”里，alti-与“高度”有关。"},{"en":"An “altimeter” is a device for measuring altitude (height).","zh":"“altimeter”是用来测量高度（海拔）的仪器。"}]}],"synonyms":["altitude (full form)","height (general meaning)"],"phonetic":"/ˈælti/","extraExplanation":["在正式英文里，人们更常写全称 altitude；“alti”更像口语/圈内简写（例如飞行员通话、户外软件界面或笔记）。","如果你是在某个具体场景（比如手表、飞行记录、地图App）看到“alti”，它几乎总是指“海拔/高度”相关数据。"]}
{"word":"Altica","summary":{"en":"Altica: a genus of jumping flea beetles; some species damage plant leaves.","zh":"Altica：跳甲属，一类会跳跃的跳甲；部分种类会啃食叶片并造成危害。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small flea beetles (leaf beetles) that can jump and that often feed on plant leaves; some species are agricultural pests.","zh":"跳甲属（一类能跳跃的小型叶甲/跳甲），常取食植物叶片；其中一些种类是农业害虫。"},"examples":[{"en":"Farmers watched for Altica beetles because the leaves showed tiny round holes.","zh":"农民会留意跳甲属昆虫，因为叶片上会出现许多小圆孔。"},{"en":"In the field guide, Altica is listed under flea beetles in the family Chrysomelidae.","zh":"在野外图鉴中，Altica 被归在叶甲科的跳甲类（flea beetles）之下。"}]}],"synonyms":["flea beetle","leaf beetle (broad)"],"phonetic":"/ˈæl.tɪ.kə/","extraExplanation":["“Altica”是拉丁化的属名，常见于生物分类学写法（属名首字母大写，斜体）。日常英语里更常用的非正式说法是“flea beetle（跳甲）”。","跳甲属昆虫的典型危害特征是把叶面咬出“弹孔状/针孔状”的小洞（shot holes），在蔬菜、观赏植物或野生植物上都可能见到。"]}
{"word":"altica","summary":{"en":"Altica is a genus of flea beetles—small jumping leaf beetles, some of which damage crops.","zh":"Altica 指跳甲属：会弹跳的小型叶甲科昆虫，其中一些会危害作物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small leaf beetles (flea beetles) that jump when disturbed; some species are agricultural pests that chew holes in plant leaves.","zh":"（昆虫）跳甲属：一类体型小、受惊会弹跳的叶甲科昆虫；其中一些种会啃食作物叶片、成为害虫。"},"examples":[{"en":"Altica flea beetles can leave many tiny holes in the leaves of eggplant and other crops.","zh":"跳甲属（Altica）的跳甲可能在茄子等作物叶片上咬出许多小洞。"},{"en":"The researcher identified the specimen as Altica based on its jumping behavior and shiny body.","zh":"研究人员根据其弹跳行为和发亮的体表，将该标本鉴定为跳甲属（Altica）。"}]}],"synonyms":["flea beetle","leaf beetle (general)"],"phonetic":"/ˈæltɪkə/","extraExplanation":["“Altica”是生物分类学里的拉丁学名（属名），写作时通常首字母大写并用斜体（*Altica*）；提到具体物种时会用“属名 + 种加词”，例如 *Altica* sp.（未确定种的跳甲属昆虫）。","日常英语中更常见的说法是“flea beetle（跳甲）”；“Altica”更常用于学术文章、昆虫鉴定或农业害虫管理的语境。"]}
{"word":"Alticamelus","summary":{"en":"Alticamelus is a scientific name for an extinct genus of camelids, used mainly in paleontology.","zh":"Alticamelus 是一个已灭绝骆驼科动物的属名，主要用于古生物学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct genus of camel-like mammals (camelids) known from fossils; the name is used mainly in paleontology and scientific writing.","zh":"（古生物学用语）已灭绝的骆驼科动物属名，主要见于化石研究与学术写作中。"},"examples":[{"en":"Alticamelus is often mentioned in discussions of fossil camelids in North America.","zh":"在讨论北美骆驼科化石时，常会提到 Alticamelus。"},{"en":"The paper compares Alticamelus with other extinct camel relatives based on skeletal features.","zh":"这篇论文根据骨骼特征将 Alticamelus 与其他已灭绝的骆驼近亲作比较。"}]}],"synonyms":["(no common synonyms; scientific genus name)"],"phonetic":"ˌæltiˈkæmələs","extraExplanation":["“Alticamelus”是拉丁化的学名（属名），常见于学术语境；日常英语里几乎不会用到。","词源上可理解为“高（alti-）的骆驼（camelus）”，这种命名方式在生物分类学中很常见，用来暗示外形特征或研究者的判断。","作为属名，通常首字母大写并用斜体（Alticamelus）；如果指某一物种，会写成“Alticamelus + 种加词”的二名法形式。"]}
{"word":"alticamelus","summary":{"en":"Alticamelus is the scientific name of an extinct genus related to camels, known from North American fossils.","zh":"Alticamelus 是一种已灭绝的骆驼近亲属名，主要见于北美化石与古生物学资料中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Alticamelus: an extinct genus of camel-like mammals known from fossil remains in North America (used in paleontology).","zh":"Alticamelus：一种已灭绝的骆驼类哺乳动物属，主要根据北美出土的化石记录而知（古生物学用语）。"},"examples":[{"en":"Alticamelus is often discussed in studies of ancient camel evolution in North America.","zh":"Alticamelus 常见于研究北美古代骆驼演化的论文中。"},{"en":"The museum label mentioned Alticamelus as a fossil camel relative from millions of years ago.","zh":"博物馆的说明牌把 Alticamelus 介绍为数百万年前的骆驼近亲化石。"}]}],"synonyms":["extinct camelid","fossil camel relative","camelid genus"],"phonetic":"/ˌæltiˈkæmələs/","extraExplanation":["这是一个拉丁化的学名（属名），常见于学术写作而不常见于日常英语。词源可拆为 altus（“高的”）+ camelus（“骆驼”），大意类似“高大的骆驼”。在英文句子里通常首字母大写并用斜体书写（Alticamelus）。"]}
{"word":"altify","summary":{"en":"Altify (informal) means to make something—or become—more alternative/indie in style.","zh":"Altify（非正式）指让某物（或自身）变得更“另类/独立风”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(informal, nonstandard) To make something more “alternative” in style; to give something an alt/indie look or vibe.","zh":"（非正式、非标准用法）使某物更“另类/独立风”的；给某物加入 alt/indie 的风格或气质。"},"examples":[{"en":"They altified the band’s image with thrift-store clothes and DIY posters.","zh":"他们用二手店穿搭和 DIY 海报把乐队形象“另类化”了。"},{"en":"You can altify your playlist by adding more indie rock and lo‑fi tracks.","zh":"你可以通过加入更多独立摇滚和 lo‑fi 歌曲来把歌单“alt 化”。"}]},{"partOfSpeech":"vi.","definition":{"en":"(informal, nonstandard) To become more alternative in style or taste.","zh":"（非正式、非标准用法）变得更“另类/独立风”；风格或喜好变得更偏 alt。"},"examples":[{"en":"After college, his fashion sense gradually altified.","zh":"大学之后，他的穿衣风格逐渐变得更另类了。"},{"en":"The cafe has altified over the years—more zines, more local bands.","zh":"这些年这家咖啡馆越来越“alt”了——更多小志、更多本地乐队。"}]}],"synonyms":["make more alternative","give an indie vibe","indie-fy","alternative-ize"],"phonetic":"/ˈæl.tə.faɪ/","extraExplanation":["“altify”通常被理解为“alt + -ify”的临时造词：alt 是 alternative（另类/独立） 的缩写，-ify 表示“使……化”。它不算标准词，更多见于网络语境、音乐/潮流讨论或玩笑式表达。正式写作里更常用：make … more alternative / give … an indie vibe / alternative-leaning。"]}
{"word":"altigraph","summary":{"en":"Altigraph: a device that measures and records altitude changes over time.","zh":"Altigraph：用于测量并记录高度随时间变化的仪器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an instrument that measures and records changes in altitude over time (used especially in aviation and ballooning).","zh":"（尤用于航空、气球等的）高度记录仪：用于测量并记录随时间变化的高度的仪器。"},"examples":[{"en":"The pilot checked the altigraph to review the plane’s climb during the test flight.","zh":"飞行员查看高度记录仪，以回顾试飞过程中飞机的爬升情况。"},{"en":"Researchers attached an altigraph to the weather balloon to record its altitude profile.","zh":"研究人员把高度记录仪安装在探空气球上，用来记录其高度变化曲线。"}]}],"synonyms":["recording altimeter","altimeter","altitude recorder"],"phonetic":"/ˈæltiˌɡræf/","extraExplanation":["“altigraph”由“alti-（高度）+ -graph（记录/描写）”构成，字面意思是“记录高度的仪器”。在实际使用中，它常被视为能“记录”的一种高度计（altimeter），概念上接近“barograph（气压记录仪）”，因为高度测量常与气压变化有关。","该词在日常英语中较少见，更常见的表达是“altimeter（高度计）”或“recording altimeter（带记录功能的高度计）”。"]}
{"word":"altilik","summary":{"en":"Altılık is a Turkish word that generally means “a set/group of six,” and can also mean a “six” item depending on context.","zh":"Altılık 是土耳其语词，通常表示“六个一组/一套六个”，也可在特定语境中指“六码/点数为六的东西”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Turkish loanword) A group or set of six; something consisting of six items.","zh":"（土耳其语借词）六个一组；由六个组成的事物。"},"examples":[{"en":"In Turkish, “altılık” can mean a set of six items.","zh":"在土耳其语里，“altılık”可以指六个物品的一组。"},{"en":"He bought an altılık of bottled water (a six-pack).","zh":"他买了一组六码（六瓶装）的瓶装水。"}]},{"partOfSpeech":"n.","definition":{"en":"(By context) A “six” or six-denomination item in some games or everyday use (meaning depends on the situation).","zh":"（依语境）在某些游戏或日常表达中指“六”或面值/点数为六的东西（具体含义取决于场景）。"},"examples":[{"en":"In a card game, altılık may refer to the six card.","zh":"在纸牌游戏里，altılık 可能指“6”这张牌。"}]}],"synonyms":["set of six","six-pack","group of six"],"phonetic":"/ɑlˈtiːlik/","extraExplanation":["“Altılık”来自土耳其语：altı = “六”，-lık/-lik 是常见的名词后缀，可表示“……的东西/一套/一种”。因此它在不同语境里可能是“六个一组”“六瓶装”“六码（与6相关的物品）”等。","这个词在英语里不算常见；若你在英文语境看到它，通常是保留土耳其语拼写（多出现在土耳其文化、饮食、游戏或聊天语境中）。如果你能提供一句原句或场景，我可以帮你确定最准确的含义。"]}
{"word":"altiloquence","summary":{"en":"Altiloquence means lofty, elevated speech or writing, sometimes implying overly grand style.","zh":"Altiloquence 指高亢庄严的言语或文风，有时暗示辞藻过于华丽。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"lofty, elevated, or grand-sounding speech or writing (often used to suggest a formal or overly ornate style)","zh":"（言语或文风）高亢、庄严、宏伟的表达（有时含“过于华丽/夸饰”的意味）"},"examples":[{"en":"The senator’s speech was full of altiloquence, but it offered few concrete plans.","zh":"那位参议员的演讲充满了高调辞藻，但几乎没有提出具体方案。"},{"en":"In the novel, the priest speaks with altiloquence to inspire the crowd.","zh":"在小说里，神父用庄严高亢的语言激励众人。"}]}],"synonyms":["grandiloquence","lofty diction","high-flown language","oratory","rhetoric"],"phonetic":"/ælˈtɪləkwəns/","extraExplanation":["这个词较少见，语气偏文学或批评用语，常用来评价“辞藻华丽、格调高”的表达，有时带一点点讽刺：听起来很高大上，但内容可能空泛。","词源可拆解理解：alti- 表“高”（同 altitude 海拔/高度），-loquence 表“说话/言语”（同 eloquence 雄辩）。整体就是“高调的言语”。"]}
{"word":"altiloquent","summary":{"en":"Altiloquent describes language that is lofty and grand in style, sometimes overly so.","zh":"Altiloquent 指言辞风格高远华丽（有时也暗示过分夸张或华而不实）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Using high-flown, grand, or overly elevated language; lofty in style.","zh":"（罕见）言辞高亢华丽的；（有时带贬义）用词过于夸张、过分高调的。"},"examples":[{"en":"The speech sounded altiloquent, but it offered few practical details.","zh":"这篇演讲辞藻华丽高亢，但几乎没有提供实用细节。"},{"en":"Some critics called the poem altiloquent, praising its grand tone.","zh":"一些评论家称这首诗辞藻高远，称赞它的宏大语气。"},{"en":"Try to avoid an altiloquent style in business emails; clarity matters more.","zh":"商务邮件尽量避免过于“高大上”的文风；清晰更重要。"}]}],"synonyms":["lofty","grandiloquent","high-flown","bombastic","pompous"],"phonetic":"/ˌæltiˈlɔkwənt/","extraExplanation":["这个词比较少见，常见替代词包括 lofty（高远的）、grandiloquent（夸张华丽的/大词堆砌的）和 pompous（浮夸自大的）。","词源来自拉丁语：alti-（高的）+ loqui（说话）。因此它的核心画面感是“说得很高”。","语气可能是中性（表示“高雅、庄严”），也可能带轻微负面（暗示“华而不实、故作高深”），要看语境。"]}
{"word":"altimeter","summary":{"en":"An altimeter is a device that measures altitude, especially in aircraft.","zh":"altimeter 指测量高度的仪器，尤指飞机上的高度计。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An instrument that measures altitude (height above sea level), especially in aircraft; it is usually based on air pressure.","zh":"测高仪；高度计（测量高度，尤用于飞机上；通常依据气压变化来计算）。"},"examples":[{"en":"The pilot checked the altimeter before landing.","zh":"飞行员在着陆前检查了高度计。"},{"en":"Set the altimeter to the local pressure so the altitude reading is accurate.","zh":"把高度计设定为当地气压，这样读出的高度才准确。"}]}],"synonyms":["altitude gauge","height meter"],"phonetic":"/ælˈtɪmɪtɚ/","extraExplanation":["航空里的高度计多为“气压高度计”（barometric altimeter）：气压越低通常表示越高的高度，所以需要根据当地气压（如 QNH）校准，否则会出现读数偏差。"]}
{"word":"altimeters","summary":{"en":"Altimeters are instruments used to measure altitude, commonly used in aviation and outdoor activities.","zh":"Altimeters 指用于测量高度（海拔）的仪器，常见于航空和户外活动中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device that measures altitude (height above sea level), especially in aircraft, by using air pressure or GPS.","zh":"测高仪；高度表（测量海拔高度的仪器，尤指飞机上通过气压或 GPS 测量）"},"examples":[{"en":"The pilot checked the altimeter before takeoff.","zh":"飞行员在起飞前检查了高度表。"},{"en":"When the air pressure changed, the altimeter reading became less accurate.","zh":"当气压变化时，高度表读数会变得不太准确。"},{"en":"Modern planes may use both GPS and barometric altimeters.","zh":"现代飞机可能同时使用 GPS 测高仪和气压式高度表。"}]}],"synonyms":["height gauge","altitude meter","barometric altimeter"],"phonetic":"/ælˈtɪmɪtɚ/","extraExplanation":["“Altimeter”由拉丁语词根“alt-”（高）+ “-meter”（测量器）组成。航空中常见的是“barometric altimeter（气压式高度表）”，它通过气压变化推算高度，因此需要根据当地气压进行校准（常听到 QNH 等设定）。在日常英语里，“altimeter”最常出现在飞行、登山、气象等语境中。"]}
{"word":"altimetral","summary":{"en":"Altimetral means “related to measuring altitude.”","zh":"altimetral 意为“与海拔/高度测量有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the measurement of altitude (height above sea level), especially in mapping, surveying, aviation, or remote sensing.","zh":"与高度（海拔）测量有关的；尤用于制图、测量、航空或遥感领域。"},"examples":[{"en":"The report includes altimetral data collected from aircraft sensors.","zh":"报告包含由飞机传感器收集的高度测量数据。"},{"en":"Engineers used an altimetral map to plan the mountain road.","zh":"工程师使用高度测量（等高）地图来规划山路。"}]}],"synonyms":["altimetric","altitudinal","hypsometric"],"phonetic":"/ˌæl.təˈmiː.trəl/","extraExplanation":["“altimetral”在日常英语里非常少见，更常见的表达是“altimetric”（与测高有关的）或“altimetry”（测高学/测高技术）。如果你是在科研、地理信息（GIS）、遥感或航空资料里看到它，多半是在强调“与高度测量相关的数据/方法/图”。","词根提示：alti- = 高度（altitude）；-metr- = 测量（measure）。因此它整体意思就是“与高度测量有关的”。"]}
{"word":"altimetric","summary":{"en":"Altimetric means “about measuring altitude,” often used for satellite/radar height measurements in Earth science.","zh":"altimetric 指“与海拔/高度测量有关”，在地球科学中常用于卫星/雷达测高数据与技术。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to measuring altitude (height above sea level) or to data based on altitude measurements.","zh":"与测量海拔/高度（相对海平面）有关的；基于高度测量数据的。"},"examples":[{"en":"The study used altimetric data to estimate the mountain’s elevation change over time.","zh":"这项研究使用高度测量（altimetric）数据来估算这座山随时间的海拔变化。"},{"en":"Altimetric readings from the aircraft helped the pilot maintain a safe flight level.","zh":"飞机的高度测量读数帮助飞行员保持安全的飞行高度。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Especially in Earth science) Relating to satellite or radar altimetry—measuring the height of the sea surface, ice, or land from a distance.","zh":"（尤指地球科学）与卫星/雷达测高（altimetry）有关的；指用遥感方式测量海面、冰面或地表高度的。"},"examples":[{"en":"Altimetric satellites can track sea-level rise by measuring sea-surface height.","zh":"测高卫星可以通过测量海面高度来追踪海平面上升。"},{"en":"Scientists compared altimetric ice-sheet heights from different years to detect thinning.","zh":"科学家比较不同年份的冰盖测高数据，以检测冰层变薄。"}]}],"synonyms":["altitudinal","hypsometric","elevation-related","altimetry-based"],"phonetic":"/ˌæl.təˈmɛt.rɪk/","extraExplanation":["“altimetric”来自“altimeter（高度表）/ altimetry（测高学、测高技术）”。在航空语境里更常见的是“altimeter/altitude”；在海洋与遥感领域则常见“satellite altimetry（卫星测高）”“altimetric data（测高数据）”。","常见搭配：altimetric data/measurement/profile（测高数据/测量/剖面），altimetric satellite/mission（测高卫星/任务），altimetric map（高程/测高地图）。注意它通常是较正式、技术性的用词。"]}
{"word":"altimetrical","summary":{"en":"Altimetrical describes something connected to measuring altitude, especially with an altimeter.","zh":"Altimetrical 指与测量高度（海拔）有关的，尤指用高度表进行测量。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the measurement of altitude (height above sea level), especially by using an altimeter.","zh":"与高度（海拔）测量有关的，尤指用高度表测量的。"},"examples":[{"en":"The plane’s altimetrical readings showed a steady climb after takeoff.","zh":"飞机起飞后，高度表的测高读数显示在稳定爬升。"},{"en":"Researchers compared GPS data with altimetrical measurements to check accuracy.","zh":"研究人员将 GPS 数据与高度表测量结果进行对比，以检验准确性。"}]}],"synonyms":["altimetric","altimetral","altitudinal"],"phonetic":"/ˌæl.təˈmɛt.rɪ.kəl/","extraExplanation":["“altimetrical”较少见，更常见的表达是“altimetric”（测高的）或“altimetry”（测高法）。在航空与测绘语境中，你可能会更频繁看到“altimeter setting（高度表拨定值）”“altimetric data（测高数据）”等搭配。","词源上与拉丁语“altus（高的）”有关；在科技英语里常用于较正式、技术性的写作。"]}
{"word":"altimetrically","summary":{"en":"Altimetrically means “in a way related to measuring altitude.”","zh":"altimetrically 表示“以与高度（海拔）测量有关的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to altitude (height) measurement, especially using an altimeter or similar method.","zh":"以与高度（海拔）测量有关的方式；尤指用高度表或类似方法进行测量。"},"examples":[{"en":"The aircraft’s performance was assessed altimetrically during the climb.","zh":"飞机在爬升过程中，其性能以高度测量的方式进行了评估。"},{"en":"Researchers compared the valley’s depth altimetrically using satellite data.","zh":"研究人员用卫星数据以高度测量的方法对比了山谷的深度。"}]}],"synonyms":["by altitude measurement","in terms of altitude","altitudinally"],"phonetic":"/ˌæl.təˈmɛ.trɪ.kli/","extraExplanation":["这是一个非常少见、偏技术的副词，常见于航空、测绘、地理信息等语境。","词根来自 altitude（高度）+ -metric（测量的）+ -ally（副词后缀）。更常见的表达是：in terms of altitude / by altitude measurement（从高度角度/通过高度测量）。"]}
{"word":"altimetry","summary":{"en":"Altimetry is the measurement of altitude, often using tools like an altimeter or satellites.","zh":"Altimetry 指对海拔高度（高度）的测量，常借助高度表、雷达或卫星等工具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the measurement of altitude (height above sea level), especially using instruments like an altimeter","zh":"测高法；高度测量（测量海拔高度，尤指用高度表等仪器）"},"examples":[{"en":"Aircraft rely on altimetry to maintain safe separation from mountains and other planes.","zh":"飞机依靠高度测量来与山体和其他飞机保持安全间隔。"},{"en":"Radar altimetry can measure the height of an aircraft above the ground.","zh":"雷达测高可以测量飞机离地面的高度。"},{"en":"Satellite altimetry helps scientists track changes in sea level over time.","zh":"卫星测高帮助科学家追踪海平面随时间的变化。"}]}],"synonyms":["altitude measurement","height measurement"],"phonetic":"/ælˈtɪmətri/","extraExplanation":["词源提示：alti- 表示“高”（来自拉丁语 altus），-metry 表示“测量”。所以 altimetry 字面意思就是“测量高度”。","常见搭配与语境：aircraft altimetry（航空测高）、radar altimetry（雷达测高）、satellite altimetry（卫星测高）、altimetry data（测高数据）。"]}
{"word":"altimettrically","summary":{"en":"Altimetrically means “in terms of altitude measurement; using altitude/altimeter data.”","zh":"altimetrically 表示“从高度测量的角度；使用高度/高度计数据”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to altitude measurement (altimetry), especially using an altimeter or altitude data.","zh":"以与高度测量（高程测定、测高学）有关的方式；尤指使用高度计或高度数据来测量/描述。"},"examples":[{"en":"The aircraft’s flight path was analyzed altimetrically using onboard sensor data.","zh":"研究人员利用机载传感器数据从高度测量的角度分析了飞机的飞行轨迹。"},{"en":"Altimetrically corrected readings improved the accuracy of the terrain map.","zh":"经过高度测量校正的读数提高了地形图的准确性。"}]}],"synonyms":["by altitude measurement","in terms of altitude","altitude-wise"],"phonetic":"/ˌæl.təˈmɛ.trɪ.kli/","extraExplanation":["你写的 **altimettrically** 很可能是拼写错误；更常见、标准的形式是 **altimetrically**（来自 *altimetry* “测高/高程测定”）。","这是一个较偏技术/学术的副词，常出现在航空、测绘（GIS/遥感）、气象与地球科学等语境中；日常英语里很少用。"]}
{"word":"altin","summary":{"en":"Altin most commonly refers to Turkish “altın” meaning “gold,” and can also mean a historical Russian coin (altyn).","zh":"Altin最常指土耳其语“altın”（黄金），也可指一种俄罗斯历史旧币（altyn）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Turkish; often written with a dotless ı as “altın”) gold; something made of gold.","zh":"（土耳其语；常写作含无点 ı 的“altın”）黄金；金制品。"},"examples":[{"en":"In Turkish, “altın” means “gold.”","zh":"在土耳其语里，“altın”意思是“黄金”。"},{"en":"She bought a small altın necklace as a gift.","zh":"她买了一条小金项链（altın）当礼物。"}]},{"partOfSpeech":"n.","definition":{"en":"A historical coin used in parts of the Russian Empire (also spelled “altyn”).","zh":"（历史用语）俄罗斯帝国部分地区使用过的一种旧币（也拼作“altyn”）。"},"examples":[{"en":"The museum displayed an old altin (altyn) coin.","zh":"博物馆展出了一枚古老的altin（altyn）硬币。"},{"en":"In older texts, prices may be listed in altins.","zh":"在较早的文献里，价格可能会用altins来标注。"}]}],"synonyms":["gold","altyn"],"phonetic":"/ɑlˈtin/","extraExplanation":["“altın”里的字母“ı”是土耳其语的“无点 i”，发音不同于英语的 /i/。在英文语境中常被简化拼写为 altin，但严格转写通常保留为 altın。","俄语旧币更常见的转写是“altyn”。它的名称与突厥语系词源有关，和“黄金/金”这一概念有历史联系。"]}
{"word":"altincar","summary":{"en":"Altincar is usually a proper name (often a Turkish surname), not an English dictionary word.","zh":"Altincar 通常是专有名词（常见为土耳其姓氏），不是英语词典里的常用词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (most commonly a Turkish surname) rather than a standard English vocabulary word.","zh":"一个专有名词（最常见为土耳其姓氏），并非标准英语词汇。"},"examples":[{"en":"Ms. Altincar will present the report today.","zh":"Altincar 女士今天将汇报这份报告。"},{"en":"I found an email address with the surname Altincar.","zh":"我找到了一个姓 Altincar 的邮箱地址。"}]},{"partOfSpeech":"other","definition":{"en":"Less commonly, a brand, username, or place/company name spelled “Altincar,” depending on context.","zh":"较少见时，也可能是品牌名、用户名或地名/公司名，具体取决于语境。"},"examples":[{"en":"Altincar is the username he uses on social media.","zh":"Altincar 是他在社交媒体上使用的用户名。"}]}],"phonetic":"/ˈæl.tɪn.kɑr/","extraExplanation":["“Altincar”看起来像是土耳其语拼写的姓名（常见为姓）。土耳其语里“altın”意为“金/黄金”，因此这个姓氏可能带有与“金”相关的含义；但具体家族来源需要以个人或家谱信息为准。","如果你是在某篇文章、商标、车名或公司名里看到它，请告诉我出现的句子/链接，我可以按具体语境解释它在那里的含义与用法。"]}
{"word":"Altingiaceae","summary":{"en":"Altingiaceae is a botanical family name often used in older classifications, especially for sweetgum-related trees (Liquidambar).","zh":"Altingiaceae 是一个植物科名，多见于旧分类体系，常与枫香属（Liquidambar，甜胶树/枫香树）等相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a botanical family of flowering plants, best known for including sweetgum trees (genus Liquidambar).","zh":"（植物学）金缕梅科的一支（或旧分类中的一个科名），属于被子植物的一类，最知名的成员包括枫香属（Liquidambar，常见为“甜胶树/枫香树”）。"},"examples":[{"en":"Liquidambar, the sweetgum genus, has often been placed in Altingiaceae in older classifications.","zh":"枫香属（Liquidambar，甜胶树）在较早的分类系统中常被归入 Altingiaceae。"},{"en":"Some textbooks list Altingiaceae as a separate family, while others merge it into Hamamelidaceae.","zh":"有些教材把 Altingiaceae 单列为一个科，而另一些则把它并入金缕梅科（Hamamelidaceae）。"}]}],"synonyms":["sweetgum family"],"phonetic":"/ˌæl.tɪn.dʒiˈeɪ.si.i/","extraExplanation":["在现代分类系统（如 APG 体系）中，枫香属（Liquidambar）通常被并入金缕梅科（Hamamelidaceae），因此“Altingiaceae”更多见于旧文献、部分植物志或园艺/林业资料。","词源来自属名 Altingia（阿廷吉亚属），该属名源于人名。阅读植物分类资料时，遇到“旧分类/新分类”并存很常见。"]}
{"word":"altingiaceae","summary":{"en":"Altingiaceae is the plant family that includes sweetgum trees (Liquidambar).","zh":"Altingiaceae 指包含枫香（sweetgum，Liquidambar）等树木的植物科名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a botanical family of flowering plants (the sweetgum family), including trees such as sweetgum (Liquidambar).","zh":"（植物）金缕梅科相关的一支分类：枫香科/甜胶树科（Altingiaceae），包含枫香属（Liquidambar）等树木。"},"examples":[{"en":"Liquidambar styraciflua (American sweetgum) is often placed in the family Altingiaceae.","zh":"美洲枫香（American sweetgum，Liquidambar styraciflua）常被归入枫香科（Altingiaceae）。"},{"en":"In some textbooks, Altingiaceae is treated as part of Hamamelidaceae.","zh":"在一些教材中，枫香科（Altingiaceae）会被视为金缕梅科（Hamamelidaceae）的一部分。"}]}],"synonyms":["sweetgum family","Altingia family"],"phonetic":"/ˌæl.tɪn.dʒiˈeɪ.si.iː/","extraExplanation":["“Altingiaceae”是植物分类学中的“科”名，词尾“-aceae”表示“……科”，读音通常为 /-ˌeɪsi.iː/。","该科的范围在不同分类系统中可能有所变化：有的系统将其单独成科，有的将其并入金缕梅科（Hamamelidaceae）。学习时可关注所用教材/数据库采用的系统（如APG系统等）。"]}
{"word":"altingiacean","summary":{"en":"Altingiacean means ‘of or relating to the sweetgum family (Altingiaceae)’ or ‘a member plant of that family.’","zh":"altingiacean 指“与枫香科（Altingiaceae，甜胶树/枫香类）有关的；属于枫香科的”，也可指“枫香科植物”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the plant family Altingiaceae (the sweetgum family) or to plants that belong to it.","zh":"（形容词）与金缕梅科近缘的枫香科（Altingiaceae，甜胶树/枫香类植物所属的科）有关的；属于枫香科的。"},"examples":[{"en":"Sweetgum trees are an altingiacean group often planted for their brilliant fall color.","zh":"枫香类树木属于枫香科（altingiacean）的一支，常因秋色绚丽而被栽种。"},{"en":"The fossil was identified as altingiacean based on the shape of its leaves and fruiting structures.","zh":"根据叶形和结果结构，这块化石被鉴定为枫香科（altingiacean）植物。"}]},{"partOfSpeech":"n.","definition":{"en":"A plant of the family Altingiaceae.","zh":"（名词）枫香科（Altingiaceae）的植物；枫香科成员。"},"examples":[{"en":"Several altingiaceans occur naturally in East Asia.","zh":"东亚自然分布着若干种枫香科（altingiacean）植物。"}]}],"synonyms":["Altingiaceae (family name)","sweetgum (common term for some members)"],"phonetic":"/ˌæl.tɪn.dʒiˈeɪ.ʃi.ən/","extraExplanation":["“Altingiacean”是较偏学术的分类学用语，多见于植物系统学、古植物学和生态学论文中；日常英语里更常直接说“sweetgum(s)”或用科名“Altingiaceae”。","词形来源：科名“Altingiaceae” + 形容词后缀“-an”，表示“属于……的/与……有关的”。"]}
{"word":"altingiaceous","summary":{"en":"A technical adjective meaning “of or related to the sweetgum family (Altingiaceae).”","zh":"一个植物学术语形容词，意为“与枫香科（Altingiaceae，甜胶树/枫香类）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the plant family Altingiaceae (the sweetgum family), or to plants in that family.","zh":"与金缕梅科近缘的枫香科（Altingiaceae，常称“枫香科/甜胶树科”）有关的；属于该科植物的。"},"examples":[{"en":"Researchers compared altingiaceous fossils with modern sweetgum leaves.","zh":"研究人员将枫香科化石与现代枫香树叶进行比较。"},{"en":"This pollen type is often described as altingiaceous in palynology papers.","zh":"在孢粉学论文中，这类花粉常被描述为“枫香科型（altingiaceous）”。"}]}],"synonyms":["altingiacean","of the Altingiaceae","sweetgum-family"],"phonetic":"/ˌæl.tɪn.dʒiˈeɪ.ʃəs/","extraExplanation":["“altingiaceous” 是一个比较专业的植物学/古植物学用词，来自科名 Altingiaceae（枫香科）。日常英语里很少用到，更常见的说法是直接写出科名（Altingiaceae）或用 “sweetgum family”。","分类学上，枫香属（Liquidambar，常见如 American sweetgum）是该类群中最知名的成员之一，因此相关研究（化石叶片、木材、花粉等）里可能会看到这个形容词。"]}
{"word":"altininck","summary":{"en":"“altininck” isn’t recognized as a standard English word; it may be a misspelling or a proper name.","zh":"“altininck”不属于常见英语词汇；可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling, username, or a word from another language.","zh":"不是标准英语单词；可能是拼写错误、用户名，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “altininck” in an English dictionary—could you share a sentence or where you saw it?","zh":"我在英语词典里找不到“altininck”——你能提供一个句子或你在哪里看到的吗？"},{"en":"Did you mean “Altın İnci” (a name/brand) or another spelling?","zh":"你是不是想写“Altın İnci”（可能是姓名/品牌）或其他拼法？"}]}],"phonetic":"/ˌæl.tɪˈnɪŋk/","extraExplanation":["从拼写看，“altininck”不太像英语构词规则，更像是专有名词、用户名，或某种语言（例如土耳其语）里的拼写/转写。","如果你把它出现的上下文（整句、网页标题、产品名、聊天记录等）贴出来，我可以帮你判断它可能是哪种语言、可能的正确拼写，以及对应含义。","你也可以告诉我你想查的是发音相近的英语词：比如你是否想找的是某个以“alt-”开头的词（altitude/alternate 等）？"]}
{"word":"altiplanicie","summary":{"en":"Altiplanicie means a high plateau (a high, flat region of land), especially in the Andes.","zh":"altiplanicie 指“高原/高海拔平原”，尤常用于安第斯山脉地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a high plateau; an elevated plain, especially in the Andes (often referring to the Altiplano region).","zh":"高原；高海拔的平原（尤指安第斯山脉地区，常与“Altiplano/安第斯高原”相关）。"},"examples":[{"en":"Llamas and alpacas are common on the Andean altiplanicie.","zh":"在安第斯高原（altiplanicie）上，羊驼和美洲驼很常见。"},{"en":"The town sits on an altiplanicie where the air is thin and dry.","zh":"这个小镇坐落在高原上，空气稀薄而干燥。"}]}],"synonyms":["high plateau","plateau","high plain","Altiplano"],"phonetic":"/ˌæltiːpləˈnisi.eɪ/","extraExplanation":["“altiplanicie”主要是西班牙语词（来自“alto”高的 + “planicie”平原），在英语里较少单独使用；英语更常见的对应词是“high plateau”或借用词“Altiplano”。","在地理与人文语境中，它常指玻利维亚、秘鲁一带的安第斯高原地区；相关文化意象常包括高海拔气候、盐沼（如乌尤尼盐沼）、以及以艾马拉族、克丘亚族为代表的高原居民生活方式。"]}
{"word":"Altiplano","summary":{"en":"Altiplano means a high plateau, especially the Andean plateau region in Bolivia and southern Peru.","zh":"Altiplano 指高原，尤指玻利维亚与秘鲁南部的安第斯阿尔蒂普拉诺高原地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a high plateau, especially the large Andean plateau in Bolivia and southern Peru (often including parts of northern Chile and Argentina).","zh":"高原；（尤指）安第斯山脉的“阿尔蒂普拉诺高原”（主要在玻利维亚与秘鲁南部，常也包括智利北部与阿根廷部分地区）。"},"examples":[{"en":"Many Aymara and Quechua communities live on the Altiplano.","zh":"许多艾马拉人和克丘亚人社区生活在阿尔蒂普拉诺高原上。"},{"en":"Travelers often feel the thin air when they arrive on the Altiplano.","zh":"旅客到达阿尔蒂普拉诺高原时常会感到空气稀薄。"},{"en":"The Altiplano is known for its striking landscapes, including Lake Titicaca and salt flats.","zh":"阿尔蒂普拉诺高原以壮丽景观闻名，包括的的喀喀湖和盐沼（盐滩）。"}]}],"synonyms":["high plateau","plateau","Andean plateau"],"phonetic":"/ˌæltiˈplɑːnoʊ/","extraExplanation":["“Altiplano”来自西班牙语：alto（高）+ plano（平坦、平原/平地），字面意思是“高的平原”，因此常被翻译为“高原”或“高原平地”。","在英语里它通常指安第斯高原这一特定地区，常写作首字母大写（the Altiplano）。在地理、旅行、历史语境中很常见。"]}
{"word":"altiplano","summary":{"en":"Altiplano means a high plateau, especially the famous high plain in the Andes of Bolivia and Peru.","zh":"altiplano 指“高原”，尤指玻利维亚与秘鲁安第斯山脉的阿尔蒂普拉诺高原。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a high, flat plateau (a large area of level land at a great height), especially the one in the Andes of Bolivia and Peru","zh":"高原；高海拔的平坦台地（尤指玻利维亚与秘鲁安第斯山脉的“阿尔蒂普拉诺高原”）"},"examples":[{"en":"Many people who visit the Altiplano feel short of breath because of the thin air.","zh":"很多人去阿尔蒂普拉诺高原旅游时会因为空气稀薄而感到喘不过气。"},{"en":"The Altiplano is known for its vast landscapes and strong sunlight.","zh":"阿尔蒂普拉诺高原以辽阔的地貌和强烈的日照而闻名。"},{"en":"Llamas and alpacas are commonly seen on the Altiplano.","zh":"在阿尔蒂普拉诺高原常能看到骆马和羊驼。"}]}],"synonyms":["high plateau","high plain","plateau"],"phonetic":"/ˌæltiˈplɑnoʊ/","extraExplanation":["“Altiplano”来自西班牙语，字面意思是“高原/高地平原”（alto=高的，plano=平的）。在英语里常用来特指南美安第斯山脉中部的阿尔蒂普拉诺高原地区。","它通常大约在海拔3,600–4,000米左右，因此与高原反应（headache, dizziness 等）以及“thin air（空气稀薄）”等表达经常一起出现。","相关搭配：the Andean Altiplano（安第斯高原）、life at high altitude（高海拔生活）、acclimatize/acclimate to the altitude（适应海拔）。"]}
{"word":"Altis","summary":{"en":"Altis is a proper noun most commonly referring to the main island/map in Arma 3, and historically to the sacred sanctuary precinct at ancient Olympia, Greece.","zh":"Altis 多作专有名词：常见指《武装突袭3》的主要岛屿/地图；在历史语境中也指古希腊奥林匹亚的圣林与神域（宙斯圣区）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fictional Mediterranean island (based on the Greek island of Lemnos) used as the main setting/map in the video game Arma 3.","zh":"（游戏用语）《武装突袭3》（Arma 3）中的虚构地中海岛屿/地图，原型主要参考希腊的利姆诺斯岛（Lemnos）。"},"examples":[{"en":"Our unit is deploying to Altis for tonight’s mission.","zh":"我们的小队今晚要部署到 Altis 执行任务。"},{"en":"Altis has many towns, hills, and coastal areas, so scouting matters.","zh":"Altis 有很多城镇、山地和海岸区域，所以侦察很重要。"}]},{"partOfSpeech":"n.","definition":{"en":"the sacred grove and sanctuary area at ancient Olympia in Greece, especially the precinct of Zeus (the ‘Altis’).","zh":"（古希腊）奥林匹亚（Olympia）的圣林与神域，尤指宙斯神域的核心圣区（称为“Altis”）。"},"examples":[{"en":"Archaeologists describe temples and altars within the Altis at Olympia.","zh":"考古学家会描述奥林匹亚的 Altis 圣区内的神庙与祭坛。"},{"en":"The ancient games were closely connected to rituals held in the Altis.","zh":"古代奥林匹亚运动会与在 Altis 圣区举行的宗教仪式密切相关。"}]}],"phonetic":"/ˈæl.tɪs/","extraExplanation":["“Altis”在英语里多作为专有名词使用：一是游戏《Arma 3》的地图名；二是古希腊奥林匹亚宙斯圣域的“圣林/圣区”名称。阅读或听到这个词时，通常需要根据语境判断是“游戏地图”还是“考古/古典历史”含义。"]}
{"word":"altiscope","summary":{"en":"Altiscope means an instrument for measuring altitude, similar to an altimeter.","zh":"altiscope 指测量海拔高度的仪器，类似高度计（altimeter）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an instrument used to measure altitude (height above sea level), especially in aviation; similar to an altimeter","zh":"测高仪；高度计（测量海拔高度的仪器，尤用于航空；类似 altimeter）"},"examples":[{"en":"Before takeoff, the pilot checked the altiscope to confirm the plane’s altitude readings.","zh":"起飞前，飞行员检查了测高仪，以确认飞机的高度读数。"},{"en":"In older manuals, you may see “altiscope” used where modern texts say “altimeter.”","zh":"在较旧的手册里，你可能会看到用“altiscope”，而现代文本更常用“altimeter”。"}]}],"synonyms":["altimeter","height gauge"],"phonetic":"/ˈæltiˌskoʊp/","extraExplanation":["“altiscope”由表示“高”的拉丁语词根 alti-（来自 altus）+ 表示“观察/仪器”的 -scope（来自希腊语 skopein，意为“看”）构成，字面意思就是“用来观察/测量高度的仪器”。","它在现代英语里不算常用；在航空语境中更常见、更标准的词是 altimeter（高度计）。"]}
{"word":"altisonant","summary":{"en":"Altisonant describes pompous, overly grand-sounding language.","zh":"altisonant 形容语言辞藻华丽夸张、听起来高大上但显得浮夸。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of speech or writing) using lofty, grand-sounding words in a way that feels pompous or overblown.","zh":"（指言语或写作）用词高调、华丽夸张，给人自大、浮夸之感。"},"examples":[{"en":"His altisonant speech impressed a few people, but most listeners found it hard to follow.","zh":"他那篇辞藻夸张的演讲让少数人觉得气派，但大多数听众觉得难以理解。"},{"en":"The report became altisonant instead of clear, so the team asked for simpler wording.","zh":"这份报告变得辞藻浮夸而不够清晰，所以团队要求用更简单的措辞。"}]}],"synonyms":["pompous","grandiloquent","high-flown","bombastic","pretentious"],"phonetic":"/ælˈtɪzənənt/","extraExplanation":["这个词比较“书面、文学化”，日常口语里更常用 pompous（自大浮夸的）、grandiloquent（辞藻夸张的）、high-flown（浮夸的）来表达类似意思。","词源来自拉丁语：altus（高的）+ sonare（发声），字面意思是“高声、宏亮”，后来引申为“语言听起来很高大上但不一定有内容”。"]}
{"word":"altisonous","summary":{"en":"Altisonous describes language that sounds grand and lofty, often in an overly pompous way.","zh":"Altisonous 形容言辞听起来宏大高调，但往往过于浮夸。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of speech or writing) high-sounding and impressive, but often too grand or pompous.","zh":"（指言语或文章）辞藻华丽、听起来很宏大，但常带有夸张或浮夸之意。"},"examples":[{"en":"His altisonous speech was full of big words but short on real plans.","zh":"他那篇夸张华丽的演讲充满大词，却缺少实际计划。"},{"en":"The review criticized the novel for its altisonous style.","zh":"评论批评这部小说文风过于浮夸。"},{"en":"She avoided altisonous language and spoke plainly.","zh":"她避免使用浮夸的措辞，而是直截了当地表达。"}]}],"synonyms":["pompous","grandiloquent","high-flown","bombastic","grandiose"],"phonetic":"/ælˈtɪsənəs/","extraExplanation":["这个词比较少见，多用于批评某人“说得很大声、很宏伟”，但内容空洞或刻意装腔作势。常见的更日常表达包括 pompous（浮夸的）、grandiose（夸大的）、high-flown（辞藻华丽但不自然）。","词源来自拉丁语：altus（高的）+ sonus（声音），字面意思是“高声的/高音的”，引申为“高调、夸饰的”。"]}
{"word":"altissimo","summary":{"en":"Altissimo means “extremely high in pitch,” or the highest register of a voice/instrument.","zh":"Altissimo 指“极高音的”，也可指人声或乐器的“超高音域/最高音域”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Music) Extremely high in pitch; in the very highest range of a voice or instrument.","zh":"（音乐）极高音的；处在声乐或乐器的最高音域（超高音）的。"},"examples":[{"en":"The flute plays an altissimo passage near the end of the piece.","zh":"这首曲子的结尾处，长笛演奏了一段超高音的乐句。"},{"en":"She can sing altissimo notes with surprising ease.","zh":"她能很轻松地唱出超高音，令人惊讶。"}]},{"partOfSpeech":"n.","definition":{"en":"(Music) The altissimo register (the highest register) of a voice or instrument.","zh":"（音乐）超高音域；最高音域（指人声或乐器的最高音区）。"},"examples":[{"en":"On the saxophone, the altissimo is challenging but expressive.","zh":"在萨克斯上，超高音域很有挑战，但表现力很强。"},{"en":"The composer writes in the altissimo to create a bright, piercing color.","zh":"作曲家用超高音域来营造明亮、尖锐的音色。"}]}],"synonyms":["very high","high-register","uppermost register","extremely high-pitched"],"phonetic":"/ælˈtɪsəˌmoʊ/","extraExplanation":["“altissimo”来自意大利语，字面意思是“最高的”（alto=高，-issimo=最高级）。在乐谱或排练中，它常用来强调“比高音还更高”的音域，尤其常见于长笛、单簧管、萨克斯、小号等乐器技巧语境中。"]}
{"word":"altitonant","summary":{"en":"Altitonant means “loudly resonant, high-sounding,” used mainly in literary contexts.","zh":"altitonant 指“高亢洪亮、回荡响亮的”，主要用于文学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Literary, rare) High-sounding; loudly resonant, especially describing a voice, speech, or thunder.","zh":"（文学用语，罕见）声音高亢而洪亮的；（尤指）嗓音、言辞或雷声等响亮回荡的。"},"examples":[{"en":"The poet wrote of altitonant thunder rolling over the hills.","zh":"诗人写到高亢洪亮的雷声在群山间滚动回响。"},{"en":"His altitonant address filled the hall and silenced the crowd.","zh":"他那洪亮的演讲充满大厅，让人群安静下来。"}]}],"synonyms":["booming","resonant","sonorous","thunderous","ringing"],"phonetic":"/ælˈtɪtənənt/","extraExplanation":["这个词非常少见，常见于诗歌或古典风格的英语写作。更常用的近义表达有 loud, resonant, booming, sonorous。","词源来自拉丁语 altitonans（alto- “高” + tonare “打雷/发声”），因此常与“雷鸣般的声音”“宏大庄严的言辞”这类意象搭配。"]}
{"word":"altitude","summary":{"en":"Altitude means height above sea level/ground, and it can also mean a high level or degree (formal).","zh":"Altitude 指海拔/高度；也可引申为（较正式的）水平或境界的“高度”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"height above sea level (or above the ground), often used for mountains, aircraft, and places","zh":"海拔；高度（相对于海平面或地面），常用于山、飞机和地点"},"examples":[{"en":"The city sits at an altitude of about 1,500 meters above sea level.","zh":"这座城市的海拔大约是1500米。"},{"en":"The pilot announced that we were cruising at a high altitude.","zh":"飞行员宣布我们正在高空巡航。"}]},{"partOfSpeech":"n.","definition":{"en":"a high or great level, rank, or degree (often used in a more formal or literary style)","zh":"高水平；高境界；崇高程度（较正式或文学化用法）"},"examples":[{"en":"Her writing reached a new altitude of clarity and power.","zh":"她的写作达到了一个更清晰、更有力量的新高度。"},{"en":"At that altitude of influence, every decision matters.","zh":"在那种影响力的高度上，每个决定都很重要。"}]}],"synonyms":["elevation","height","level"],"phonetic":"/ˈæl.tə.tuːd/","extraExplanation":["“Altitude”多用于“垂直高度”（尤其是相对海平面），而“height”更常指物体本身的“高度”（如建筑、人的身高）。例如：the height of the mountain（山本身有多高） vs. the altitude of the summit（山顶的海拔）。","常见搭配：at an altitude of…（在……海拔/高度）；high/low altitude（高海拔/低海拔）；gain/lose altitude（爬升/下降高度，常用于飞机、登山）。"]}
{"word":"altitude-azimuth","summary":{"en":"Altitude-azimuth (alt-az) describes a sky-position system or mount using altitude (up from the horizon) and azimuth (compass direction along the horizon).","zh":"Altitude-azimuth（alt-az）指用高度角（离地平线向上）与方位角（沿地平线的方向）来表示天体位置的坐标系统，或指相应的望远镜支架。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Astronomy/Navigation) A coordinate system (or related to it) that describes the position of an object in the sky using two angles: altitude (how high above the horizon) and azimuth (the direction along the horizon).","zh":"（天文/导航）一种（或与之相关的）坐标系统，用两个角度来描述天空中天体的位置：高度角（离地平线有多高）和方位角（沿地平线的方向）。"},"examples":[{"en":"Many beginner telescopes use an altitude-azimuth mount because it is simple to point and move.","zh":"很多入门望远镜使用高度-方位（altitude-azimuth）支架，因为它更容易指向和移动。"},{"en":"In the altitude-azimuth system, the Moon’s altitude changes quickly as it rises and sets.","zh":"在高度-方位坐标中，月亮在升起和落下时高度角变化很快。"},{"en":"The app shows the star’s altitude and azimuth, so you can find it in the sky.","zh":"这个应用会显示恒星的高度角和方位角，方便你在天空中找到它。"}]},{"partOfSpeech":"n.","definition":{"en":"An altitude-azimuth mount: a telescope mount that moves up-and-down (altitude) and left-and-right (azimuth).","zh":"高度-方位支架：一种望远镜支架，可上下转动（高度）并左右旋转（方位）。"},"examples":[{"en":"I switched to an altitude-azimuth for quick backyard observing.","zh":"为了在后院快速观测，我换成了高度-方位支架。"},{"en":"An altitude-azimuth mount is convenient, but it doesn’t naturally track the stars’ motion like an equatorial mount.","zh":"高度-方位支架很方便，但不像赤道仪那样能自然跟踪恒星的视运动。"}]}],"synonyms":["alt-az","horizon (horizontal) coordinate system","altazimuth"],"phonetic":"ˈæl.təˌtud ˈæz.ə.məθ","extraExplanation":["“Altitude-azimuth”常写作“alt-az”。它属于以观测者所在地为基准的“地平坐标系”：高度角从地平线往上量，范围通常是0°到90°；方位角沿地平线量方向，常见约定是从正北开始顺时针0°到360°（不同资料可能从正南开始，使用时要确认约定）。","在摄影/深空观测中，alt-az支架若长时间追踪，画面可能出现“视场旋转”（field rotation），因此常搭配短曝光或使用“去旋器（field derotator）”，而深空长曝光更常用赤道仪（equatorial mount）。"]}
{"word":"altitude-intersection","summary":{"en":"Altitude-intersection usually means the intersection point of a triangle’s altitudes (the orthocenter); in technical aviation use, it can mean routes crossing at a set altitude.","zh":"Altitude-intersection 通常指三角形各条高的交点（垂心）；在航空等技术语境中也可指在某一指定高度上航线的交汇点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(geometry) The point where two or three altitudes of a triangle meet; the common intersection of the triangle’s altitude lines (also called the orthocenter).","zh":"（几何）三角形的两条或三条高的交点；三条高所在直线的公共交点（也叫“垂心”）。"},"examples":[{"en":"In an acute triangle, the altitude-intersection lies inside the triangle.","zh":"在锐角三角形中，高的交点位于三角形内部。"},{"en":"To locate the altitude-intersection, draw two altitudes; their crossing point is the answer.","zh":"要找到高的交点，画出两条高；它们的交点就是答案。"}]},{"partOfSpeech":"n.","definition":{"en":"(aviation/traffic planning) A crossing point where routes or paths intersect at a specified altitude (used in technical contexts).","zh":"（航空/交通规划）在指定高度上航线或路径相交的交汇点（多用于技术语境）。"},"examples":[{"en":"The controller assigned different levels to avoid conflict at the altitude-intersection.","zh":"管制员分配不同高度层，以避免在该高度交汇点发生冲突。"},{"en":"Pilots were advised to maintain speed while passing the altitude-intersection.","zh":"飞行员被建议在通过该高度交汇点时保持速度。"}]}],"synonyms":["orthocenter","altitude crossing point","intersection at altitude"],"phonetic":"/ˈæl.təˌtud ˌɪn.tɚˈsɛk.ʃən/","extraExplanation":["在几何里，“altitude-intersection”更常用的标准术语是 orthocenter（垂心）。三角形的“高”是从一个顶点向对边（或其延长线）作的垂线；三条高所在的直线必定共点，这个点就是垂心。","垂心位置与三角形类型有关：锐角三角形在内部；直角三角形在直角顶点；钝角三角形在外部。"]}
{"word":"altitude-related","summary":{"en":"Altitude-related means connected with altitude, especially effects or conditions at high elevations.","zh":"altitude-related 指与海拔有关的，尤指高海拔下的影响或状况。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with altitude (height above sea level), especially when describing effects, changes, or conditions that happen at higher elevations.","zh":"与海拔（高于海平面的高度）有关的，尤指描述在较高海拔发生的影响、变化或状况。"},"examples":[{"en":"The doctor warned him about altitude-related headaches.","zh":"医生提醒他注意与海拔有关的头痛。"},{"en":"Altitude-related weather changes can happen quickly in the mountains.","zh":"山区与海拔有关的天气变化可能来得很快。"},{"en":"They studied altitude-related differences in plant growth.","zh":"他们研究了植物生长随海拔变化的差异。"}]}],"synonyms":["high-altitude","altitude-associated","elevation-related","height-related"],"phonetic":"/ˈæl.təˌtud rɪˈleɪ.tɪd/","extraExplanation":["“altitude-related”是一个复合形容词（adjective compound），常用连字符连接，用来修饰名词：altitude-related illness（高原相关疾病）、altitude-related risk（海拔相关风险）。在英语里，这类“名词/概念 + related”的结构很常见，也可写成“related to altitude”，但放在名词前作定语时通常用连字符更清晰。"]}
{"word":"altitude-wise","summary":{"en":"“Altitude-wise” means “in terms of altitude; regarding height above sea level.”","zh":"“Altitude-wise”表示“就海拔/高度而言；从海拔（距海平面）角度来看”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In terms of altitude; regarding height above sea level (often used to compare conditions at different heights).","zh":"就海拔/高度而言；从高度（距海平面）这个角度来看（常用于比较不同高度的情况）。"},"examples":[{"en":"Altitude-wise, the air gets thinner as you climb higher.","zh":"从海拔角度看，爬得越高空气就越稀薄。"},{"en":"We’re fine altitude-wise, but we still need warmer clothes.","zh":"就海拔来说我们没问题，但我们还是需要更暖和的衣服。"},{"en":"Altitude-wise, this town is much higher than the capital.","zh":"从海拔来看，这个小镇比首都高得多。"}]}],"synonyms":["in terms of altitude","regarding altitude","as far as altitude is concerned","altitudinally"],"phonetic":"ˈæl.təˌtud waɪz","extraExplanation":["“X-wise”是英语里很常见的口语/写作用法，意思是“在X方面、从X角度”。比如：time-wise（时间上）、cost-wise（费用方面）。","写作时也可用不带连字符的“altitude wise”，但更常见、更清晰的写法是加连字符“altitude-wise”。更正式的替换说法有“in terms of altitude / regarding altitude”。"]}
{"word":"altitudes","summary":{"en":"Altitudes are heights above sea level (or ground), especially for places and aircraft; it can also mean a high level in a figurative sense.","zh":"Altitudes 指（海拔或离地面的）高度，常用于地点与飞机；也可比喻指某事物达到的高水平。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the height of a place or object above sea level (or above the ground); often used when talking about mountains, airplanes, or geography","zh":"（海拔或离地面的）高度；常用于描述山脉、飞机或地理位置的高度"},"examples":[{"en":"The city sits at an altitude of about 2,000 meters above sea level.","zh":"这座城市的海拔大约是2000米。"},{"en":"The plane quickly gained altitude after takeoff.","zh":"飞机起飞后很快爬升高度。"}]},{"partOfSpeech":"n.","definition":{"en":"a high level or degree of something (figurative use)","zh":"（比喻）高水平；高程度"},"examples":[{"en":"At that point, the debate reached a new altitude of intensity.","zh":"在那时，辩论的激烈程度达到了新的高度。"},{"en":"Her writing achieves an altitude of clarity that is hard to match.","zh":"她的写作清晰到一种很难被超越的高度。"}]}],"synonyms":["height","elevation","level"],"phonetic":"/ˈæl.təˌtud/","extraExplanation":["“altitudes”是“altitude”的复数形式，表示多个不同地点/时刻的高度（如不同山峰的海拔、飞行过程中的多段高度）。","常见搭配：high altitude（高海拔）、low altitude（低空/低海拔）、at an altitude of…（在……高度/海拔）、gain/lose altitude（爬升/下降高度）。"]}
{"word":"altitudinal","summary":{"en":"Altitudinal means related to altitude, especially patterns or differences across different heights (like climate or vegetation).","zh":"altitudinal 指“与海拔有关的”，常用于描述不同海拔带上的气候、植被或环境差异。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to altitude (height above sea level), especially differences or changes in climate, vegetation, or conditions at different heights.","zh":"与海拔（高于海平面的高度）有关的；尤指不同海拔导致的气候、植被或环境条件差异。"},"examples":[{"en":"Altitudinal changes can strongly affect temperature and rainfall.","zh":"海拔变化会强烈影响气温和降雨。"},{"en":"The park protects altitudinal zones from lowland forest to alpine meadow.","zh":"该公园保护从低地森林到高山草甸的不同海拔带。"},{"en":"Some birds move up and down the mountain in altitudinal migration.","zh":"一些鸟类会进行垂直迁徙，在山上上下移动。"}]}],"synonyms":["elevational","high-altitude (context-specific)","altitude-related"],"phonetic":"/ˌæl.təˈtuː.də.nəl/","extraExplanation":["“altitudinal”常见于地理、生态学与气候学语境，常与zone/belt（带）、gradient（梯度）、range（范围）、migration（迁徙）等搭配，如：altitudinal gradient（海拔梯度）、altitudinal zonation（海拔分带）。","与“latitudinal（纬度的）”常被对比：latitudinal强调南北方向的纬度差异，altitudinal强调上下方向的海拔差异。"]}
{"word":"altitudinally","summary":{"en":"Altitudinally means “in relation to altitude; by elevation levels.”","zh":"altitudinally 表示“与海拔有关地；按海拔高度（分层）地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to altitude (height above sea level), especially when comparing or describing changes at different elevations.","zh":"以与海拔（高于海平面）有关的方式；尤指在比较或描述不同海拔高度上的变化时使用。"},"examples":[{"en":"Temperatures often change altitudinally, becoming cooler at higher elevations.","zh":"气温常常会随海拔变化而变化，海拔越高通常越冷。"},{"en":"The forest composition shifts altitudinally from broadleaf trees to conifers.","zh":"森林的组成会随海拔变化：从阔叶树逐渐转为针叶树。"},{"en":"Researchers mapped biodiversity altitudinally along the mountain slope.","zh":"研究人员沿着山坡按海拔分段绘制了生物多样性的分布。"}]}],"synonyms":["by elevation","with altitude","elevationally"],"phonetic":"/ˌæl.təˈtuː.dən.əl.i/","extraExplanation":["“altitudinally”常见于学术或科普语境（生态学、地理学、气候学），用来强调“沿海拔梯度/按海拔层次”的变化。例如：altitudinal gradient（海拔梯度）、altitudinal zone/belt（海拔带）。日常口语中更常用“with altitude / at higher altitudes”。"]}
{"word":"altitudinarian","summary":{"en":"Altitudinarian describes (or refers to) someone with broad, non-strict religious views, especially in historical Christian contexts; it is a rare variant of latitudinarian.","zh":"altitudinarian 指（或指代）在宗教上较为宽容、不拘泥教条的人，尤见于历史上的基督教语境；它是较少见的 latitudinarian 变体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Religion, especially Christianity) holding broad, liberal views; not strict about doctrine or ritual.","zh":"（宗教，尤指基督教）主张宽容、开明的观点；对教义或仪式不那么严格的。"},"examples":[{"en":"Some Anglican writers were criticized for taking an altitudinarian approach to doctrine.","zh":"一些圣公会作家因对教义采取较为“宽容派”（altitudinarian）的态度而受到批评。"},{"en":"Her altitudinarian views made it easier to work with people from different denominations.","zh":"她较为宽容的宗教观点让她更容易与不同教派的人合作。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who holds broad, liberal religious views; a latitudinarian.","zh":"（宗教）宽容派人士；主张教义上较为自由、包容的人（同 latitudinarian）。"},"examples":[{"en":"In the debate, he was labeled an altitudinarian by his opponents.","zh":"在辩论中，他被对手贴上“宽容派人士”（altitudinarian）的标签。"},{"en":"Altitudinarians often argued that faith should focus on core beliefs rather than minor disputes.","zh":"宽容派人士常主张信仰应关注核心信念，而不是纠结于细枝末节的争论。"}]}],"synonyms":["latitudinarian","broad-church","liberal (in religion)","non-dogmatic"],"phonetic":"/ˌæl.təˌtuː.dəˈnɛri.ən/","extraExplanation":["“altitudinarian”较少见，多被视为“latitudinarian”的变体或误写。两者都常用于描述17世纪后英国国教（Church of England）内部较强调理性与宽容、反对过度教条化的一派。","在现代英语里，这个词带有较强的历史/学术语境色彩，日常更常用“liberal (in religion)”“broad-church”或直接用“latitudinarian”。"]}
{"word":"altitudinous","summary":{"en":"Altitudinous means very high (in altitude) or, figuratively, lofty and high-flown in style or ideas.","zh":"altitudinous 指“海拔很高的/高耸的”，也可引申为“（思想或文风）高深、崇高甚至有点不接地气的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Formal) Very high in altitude; lofty or elevated, especially describing mountains, places, or (figuratively) ideas and writing style.","zh":"（正式用语）海拔很高的；高耸的；（引申）思想、文风等“高深”的。"},"examples":[{"en":"They trekked through altitudinous valleys where the air felt thin and cold.","zh":"他们穿越了海拔很高的山谷，空气稀薄而寒冷。"},{"en":"Some readers find his altitudinous prose impressive but hard to follow.","zh":"有些读者觉得他的文风高深而令人佩服，但不太好读。"}]}],"synonyms":["high-altitude","lofty","elevated","towering","high-flown"],"phonetic":"/ˌæl.təˈtuː.də.nəs/","extraExplanation":["这个词比较少见，语气偏书面/文学，日常更常用 high, lofty, elevated, high-altitude。","词源上与 altitude（海拔）有关，后缀 -inous 表示“具有……特征的”。","引申义里，altitudinous 常带一点“过于高深、脱离实际”的微妙意味，语境会决定是褒义还是轻微的讽刺。"]}
{"word":"Altman","summary":{"en":"Altman is a surname, often referring to well-known people like director Robert Altman or the scholar behind the Altman Z-score.","zh":"Altman 是一个姓氏，常在语境中指代知名人物，例如导演罗伯特·奥特曼或提出奥特曼Z-score的学者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname). It is most commonly seen in English in the names of notable people, such as the American film director Robert Altman or the finance professor Edward I. Altman (known for the “Altman Z-score”).","zh":"姓氏（家族姓）。在英语中常见于一些知名人物的姓名中，例如美国电影导演罗伯特·奥特曼（Robert Altman），或提出“奥特曼Z值/ Z-score”的金融学教授爱德华·奥特曼（Edward I. Altman）。"},"examples":[{"en":"I’m watching a Robert Altman movie tonight.","zh":"我今晚要看一部罗伯特·奥特曼的电影。"},{"en":"Our finance class mentioned Altman’s Z-score for bankruptcy risk.","zh":"我们的金融课提到了奥特曼的Z-score（用于衡量破产风险）。"},{"en":"Altman is my mother’s last name.","zh":"Altman 是我妈妈的姓。"}]}],"phonetic":"/ˈɔltmən/","extraExplanation":["“Altman”属于专有名词（人名/姓氏），一般不翻译含义，而是按音译或约定译名处理。常见译法包括“奥特曼”。","在流行文化中，“Altman”可能让人联想到不同对象：电影领域常指导演 Robert Altman；商科/金融语境中常指 Edward I. Altman 以及“Altman Z-score”。需要根据上下文判断。"]}
{"word":"Altmar","summary":{"en":"Altmar is a place name: a small community in upstate New York, especially associated with fishing on the Salmon River.","zh":"Altmar 是地名：纽约州北部的一个小社区，常与鲑鱼河的垂钓活动相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A village (hamlet) in Oswego County, New York, U.S., known for salmon and steelhead fishing on the Salmon River.","zh":"美国纽约州奥斯威戈县的一个村落（聚落名），因鲑鱼与虹鳟（钢头鳟）在“鲑鱼河”（Salmon River）一带的垂钓活动而知名。"},"examples":[{"en":"We stopped in Altmar before heading to the Salmon River to fish.","zh":"我们在去鲑鱼河钓鱼前先在 Altmar 停了一下。"},{"en":"Altmar gets busy during the fall salmon run.","zh":"在秋季鲑鱼洄游季，Altmar 会变得很热闹。"}]}],"phonetic":"/ˈæl(t)mɑr/","extraExplanation":["“Altmar”是专有名词，通常不翻译；中文里多直接音译或保留英文拼写。","它常出现在户外/旅游语境中，尤其与纽约州著名的“Salmon River（鲑鱼河）”垂钓季相关。发音中重音通常在第一个音节。"]}
{"word":"alto","summary":{"en":"“Alto” is a musical term for the mid-low singing range (and the singer/part), and it can also mean an alto saxophone.","zh":"“Alto”是音乐术语，指中音（女低音）音域/声部及其歌手；也可指中音萨克斯风。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Music) A voice range between soprano and tenor; also the person who sings in that range (especially in a choir).","zh":"（音乐）女低音/中音的音域（介于女高音和男高音之间）；也指演唱该声部的人（尤指合唱中的中音声部歌手）。"},"examples":[{"en":"She sings alto in the church choir.","zh":"她在教堂合唱团唱中音声部。"},{"en":"The altos come in after the sopranos.","zh":"女高音之后轮到中音声部进入。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Music) Relating to the alto range; written or performed for altos.","zh":"（音乐）中音的；为中音声部写作或演奏的。"},"examples":[{"en":"This is the alto part—please sing these notes.","zh":"这是中音声部，请唱这些音符。"},{"en":"He prefers alto harmonies because they sound warm.","zh":"他更喜欢中音和声，因为听起来更温暖。"}]},{"partOfSpeech":"n.","definition":{"en":"Short for “alto saxophone,” a common type of saxophone with a mid-high sound.","zh":"“中音萨克斯风（alto saxophone）”的简称，一种常见的萨克斯风，音色介于中高音之间。"},"examples":[{"en":"She plays alto in the jazz band.","zh":"她在爵士乐队吹中音萨克斯。"},{"en":"An alto is often easier to start with than a tenor sax.","zh":"对初学者来说，中音萨克斯常常比次中音萨克斯更容易上手。"}]}],"synonyms":["contralto (lower, voice type)","middle voice (general)","alto sax (instrument)"],"phonetic":"/ˈæltoʊ/","extraExplanation":["“Alto”来自意大利语，原意与“高/上方”有关；在音乐里，它指的是比女高音低一些、但又不是最低的声部或音域。","在合唱中，“alto”常指女性中音声部，但也可能由男声用假声（countertenor）来演唱。"]}
{"word":"altocumulus","summary":{"en":"Altocumulus is a mid-level cloud layer with patchy, rippled, or clumped shapes.","zh":"Altocumulus 指“高积云”，是一种中层云，外观常为片状、波纹状或团块状。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of mid‑level cloud that appears as white or gray patches, ripples, or rounded clumps, often arranged in rows (“mackerel sky”)","zh":"高积云：一种中层云，常呈白色或灰色的片状、波纹状或圆团状云块，常成排排列（俗称“鱼鳞天”）"},"examples":[{"en":"Altocumulus clouds formed in rows across the sky this morning.","zh":"今天早上天空中出现了一排排的高积云。"},{"en":"A “mackerel sky” is often made up of altocumulus.","zh":"“鱼鳞天”常常由高积云构成。"},{"en":"Altocumulus can signal a change in weather later in the day.","zh":"高积云可能预示当天稍晚天气会有变化。"}]}],"synonyms":["altocumulus cloud","mackerel sky (informal, refers to the look)"],"phonetic":"/ˌæltoʊˈkjuːmjələs/","extraExplanation":["“alto-”来自拉丁语，意思是“高的”；“cumulus”指“堆积云/团状云”。高积云通常出现在大约2–7公里（中纬度常见）的高度，比低层的积云更高，但又低于卷云等高云。","日常表达里，人们常把高积云造成的“鱼鳞状”天空叫作 mackerel sky（鲭鱼天/鱼鳞天）。民间有句说法：Mackerel sky, mackerel sky, not long wet, not long dry（鱼鳞天，雨不久、晴也不久），意思是天气可能要变，但不等于一定会下雨。"]}
{"word":"altogether","summary":{"en":"Altogether means either “completely” or “in total,” depending on context.","zh":"altogether 可表示“完全地”，也可表示“总共/合计”，具体看语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Completely; entirely (used to emphasize a total degree).","zh":"完全地；彻底地（强调程度是“全然如此”）。"},"examples":[{"en":"I’m altogether certain that we met before.","zh":"我完全确定我们以前见过。"},{"en":"The plan was altogether unrealistic.","zh":"这个计划完全不现实。"}]},{"partOfSpeech":"adv.","definition":{"en":"In total; all things or people considered together.","zh":"总共；合计；总体而言（把所有事物/人一起算）。"},"examples":[{"en":"Altogether, the trip cost about $900.","zh":"总共，这趟旅行花了大约900美元。"},{"en":"The players, coaches, and staff altogether filled the hall.","zh":"球员、教练和工作人员加在一起把大厅都坐满了。"}]}],"synonyms":["completely","entirely","totally","overall","in total"],"phonetic":"/ˌɔːl.təˈɡeð.ɚ/","extraExplanation":["常见混淆：altogether（完全地/总共） vs. all together（都在一起）。例如：They were all together in the room.（他们都在房间里一起。）但：Altogether, there were ten people.（总共十个人。）","语体提示：altogether 在书面语和正式表达中更常见；口语里表达“完全”也常用 completely / totally。"]}
{"word":"altogetherness","summary":{"en":"Altogetherness means a strong sense of unity or being connected as one whole.","zh":"Altogetherness 指强烈的团结感或作为一个整体紧密相连的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being united, connected, or acting as one whole; togetherness as a complete group","zh":"团结一致、紧密连接或作为一个整体行动的状态；（作为完整群体的）凝聚感"},"examples":[{"en":"In a crisis, the team’s altogetherness became more important than individual talent.","zh":"在危机中，团队的凝聚一致比个人才能更重要。"},{"en":"The film is really about family altogetherness after a difficult year.","zh":"这部电影真正讲的是在艰难的一年后，家人的团聚与凝聚。"}]}],"synonyms":["togetherness","unity","solidarity","cohesion","connectedness"],"phonetic":"ˌɔl.təˈɡɛð.ɚ.nəs","extraExplanation":["“Altogetherness”并不是非常常见的标准词汇，更常用的表达是“togetherness”（凝聚力、团结）或“unity”（团结、一致）。","构词上它由“altogether（完全地；总共；作为整体）+ -ness（名词后缀）”组成，用来强调“作为一个整体/完整地在一起”的感觉。写作中使用时会带一点修辞色彩，显得更强调“整体性”。"]}
{"word":"altoist","summary":{"en":"An altoist is a musician who plays the viola.","zh":"altoist 指中提琴演奏者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A musician who plays the viola in an orchestra or ensemble.","zh":"中提琴演奏者（在管弦乐团或合奏中演奏中提琴的人）。"},"examples":[{"en":"The altoist tuned her viola before the rehearsal began.","zh":"排练开始前，那位中提琴手先给中提琴调音。"},{"en":"As an altoist, he often plays inner harmonies rather than the main melody.","zh":"作为中提琴演奏者，他常常演奏内声部的和声而不是主旋律。"}]}],"synonyms":["violist","viola player"],"phonetic":"/ˈæltoʊɪst/","extraExplanation":["“altoist”在英语里最常见的意思是“中提琴手（viola player）”。虽然“alto”也可指“女低音/中音声部”，但形容歌手时更常说“alto singer”或直接说“alto”，很少用“altoist”来指歌手。"]}
{"word":"altoists","summary":{"en":"Altoists are people who perform the alto part—either singers in the alto vocal range or players of an alto instrument (often alto saxophone).","zh":"altoists 指演唱中音声部的人，或演奏中音类乐器（常指中音萨克斯）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a musician or singer who performs the alto part (a lower-than-soprano voice range) in a choir or vocal group.","zh":"（合唱或声乐中）演唱中音声部的人；中音歌手。"},"examples":[{"en":"The choir needed two more altoists for the spring concert.","zh":"合唱团为春季音乐会还需要两名中音声部的歌手。"},{"en":"As an altoist, she often sings harmonies under the sopranos.","zh":"作为中音声部歌手，她常在女高音之下唱和声。"}]},{"partOfSpeech":"n.","definition":{"en":"a musician who plays an alto instrument, especially the alto saxophone.","zh":"演奏中音类乐器的人，尤指中音萨克斯演奏者。"},"examples":[{"en":"The altoists took turns playing the melody in the jazz band.","zh":"在爵士乐队里，中音萨克斯演奏者轮流演奏主旋律。"},{"en":"He’s one of the strongest altoists in the school’s sax section.","zh":"他是学校萨克斯声部里最出色的中音萨克斯手之一。"}]}],"synonyms":["alto singer","alto saxophonist","saxophonist (alto)","choral alto"],"phonetic":"/ˈæltoʊɪst/","extraExplanation":["“altoist”是由“alto（中音）+ -ist（从事某事的人）”构成的名词；“altoists”是其复数形式。","在英语里更常见的说法是“alto singer”（中音歌手）或“alto saxophonist”（中音萨克斯演奏者）；“altoist”相对更偏音乐圈或书面用法，语境通常能帮助判断是指声乐中音还是中音萨克斯等乐器。"]}
{"word":"altometer","summary":{"en":"Altimeter: a device used to measure altitude, especially in aviation.","zh":"Altimeter：测量高度（海拔）的仪器，尤其用于航空。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An instrument that measures altitude (height above sea level), especially in an aircraft.","zh":"高度计；测高仪（测量海拔高度的仪器，常用于飞机）"},"examples":[{"en":"The pilot checked the altimeter before takeoff.","zh":"飞行员在起飞前检查了高度计。"},{"en":"As we climbed, the altimeter showed 10,000 feet.","zh":"随着我们上升，高度计显示为一万英尺。"}]}],"synonyms":["height gauge","altitude meter"],"phonetic":"/ælˈtɪmɪtɚ/","extraExplanation":["你输入的 **altometer** 通常是 **altimeter** 的常见拼写错误。标准英语里更常用 *altimeter*。","*Altimeter* 常见于航空、登山与气象领域。传统机械式高度计常根据气压变化来估算高度；也有使用 GPS 的电子高度计（更依赖卫星定位）。"]}
{"word":"Alton","summary":{"en":"Alton is most commonly a place name, and it can also be a male given name (sometimes a surname).","zh":"Alton 最常见是地名，也可作男性名字（有时也作姓氏）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name used for several towns and locations (for example, Alton in Illinois, USA, and Alton in Hampshire, England).","zh":"地名：用于多个城镇或地点的名称（例如美国伊利诺伊州的阿尔顿、英国汉普郡的阿尔顿）。"},"examples":[{"en":"She grew up in Alton, Illinois, near the Mississippi River.","zh":"她在伊利诺伊州的阿尔顿长大，那里靠近密西西比河。"},{"en":"We stopped in Alton on our way to the national park.","zh":"我们去国家公园的路上在阿尔顿停了一下。"}]},{"partOfSpeech":"n.","definition":{"en":"a male given name (and sometimes a family name).","zh":"人名：男性名字（有时也作姓氏）。"},"examples":[{"en":"Alton is starting a new job next week.","zh":"阿尔顿下周开始一份新工作。"},{"en":"I met a designer named Alton at the conference.","zh":"我在会议上认识了一位叫阿尔顿的设计师。"}]}],"synonyms":["(place name) —","(given name) —"],"phonetic":"/ˈɔltən/","extraExplanation":["“Alton”也常出现在英国文化语境中，例如著名主题乐园“Alton Towers”（奥尔顿塔）。","作为地名时，它通常来自古英语词源，常被解释为与“old/ald（古老的）”或“tun（村庄/聚落）”有关；不同地区的词源细节可能略有差异。"]}
{"word":"Altona","summary":{"en":"Altona is a proper noun (place name), most often referring to a suburb of Melbourne, Australia, or a district of Hamburg, Germany.","zh":"Altona 是一个专有名词（地名），最常指澳大利亚墨尔本的郊区，或德国汉堡的一个城区/行政区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A place name used for several locations, most commonly (1) a suburb in Melbourne, Victoria, Australia, and (2) a district/borough in the city of Hamburg, Germany.","zh":"一个地名，用于多个地点，最常见的是（1）澳大利亚维多利亚州墨尔本的一个郊区 Altona；（2）德国汉堡市的一个行政区/城区 Altona。"},"examples":[{"en":"I’m moving to Altona because it’s close to the beach in Melbourne.","zh":"我打算搬到 Altona，因为它离墨尔本的海滩很近。"},{"en":"We took the train to Hamburg-Altona station.","zh":"我们坐火车到汉堡的 Hamburg-Altona 火车站。"}]}],"phonetic":"/ælˈtoʊnə/","extraExplanation":["“Altona”常被当作专有名词（地名）使用，首字母要大写。不同国家或城市里可能都有同名地点，理解时通常要看上下文（例如提到 Melbourne、Victoria 多半指澳大利亚；提到 Hamburg 多半指德国）。"]}
{"word":"Altoona","summary":{"en":"Altoona is mainly a U.S. place name, most commonly referring to the city in central Pennsylvania.","zh":"Altoona 主要是美国地名，最常见指宾夕法尼亚州中部的阿尔图纳市。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A city in central Pennsylvania, USA, known historically as a major railroad and industrial town (near the Allegheny Mountains).","zh":"美国宾夕法尼亚州中部的一座城市，历史上以铁路与工业闻名（靠近阿勒格尼山脉）。"},"examples":[{"en":"Altoona is in central Pennsylvania, not far from State College.","zh":"阿尔图纳在宾夕法尼亚州中部，离州立学院（State College）不远。"},{"en":"Many people connect Altoona with the history of American railroads.","zh":"很多人会把阿尔图纳与美国铁路史联系在一起。"}]},{"partOfSpeech":"other","definition":{"en":"A place name used for several smaller towns in the United States (for example, in Iowa and Wisconsin).","zh":"美国多个较小城镇使用的地名（例如爱荷华州、威斯康星州也有 Altoona）。"},"examples":[{"en":"There is also an Altoona in Wisconsin.","zh":"威斯康星州也有一个叫阿尔图纳（Altoona）的地方。"}]}],"synonyms":["a U.S. place name","a city in Pennsylvania"],"phonetic":"/ælˈtuːnə/","extraExplanation":["“Altoona”通常读作 /ælˈtuːnə/，重音在第二个音节。作为专有名词，英语里一般不加冠词（不说 *the Altoona*），除非在特定结构里（如 *the Altoona area*）。","文化/历史补充：宾州的 Altoona 曾因铁路相关产业而兴盛，与美国铁路发展史有一定关联；如果在新闻或旅行语境里看到这个词，多半指宾夕法尼亚州的那座城市。"]}
{"word":"altos","summary":{"en":"Altos = plural of alto: the alto singers/voice part in a choir, or instruments in the alto range (often alto saxophones).","zh":"Altos 是 alto 的复数：可指合唱中的中音声部/中音歌者，也可指中音音域的乐器（常指中音萨克斯）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of alto: singers or voices in the alto range (lower than soprano, higher than tenor), or the alto part in music.","zh":"alto 的复数：指女低音/中音声部的歌者或嗓音，也可指乐曲中的中音声部（低于女高音，高于男高音/男中音区域）。"},"examples":[{"en":"The altos come in after the sopranos in this hymn.","zh":"在这首圣诗里，女高音之后轮到中音（女低音/中音声部）进入。"},{"en":"Our choir needs more altos for the harmony.","zh":"我们的合唱团需要更多中音来丰富和声。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of alto: musical instruments in the alto range (especially alto saxophones).","zh":"alto 的复数：指中音音域的乐器（尤指中音萨克斯）。"},"examples":[{"en":"Two altos and a tenor sax played the main theme.","zh":"两把中音萨克斯和一把次中音萨克斯演奏了主旋律。"},{"en":"The jazz band added altos for a fuller sound.","zh":"爵士乐队加入了中音萨克斯，让音色更饱满。"}]}],"synonyms":["alto singers","alto section","alto part","alto saxophones","alto saxes"],"phonetic":"ˈæltoʊz","extraExplanation":["在英语音乐语境里，alto 通常指合唱的“中音声部”（在很多混声合唱中相当于女低音/女中音）。常见的四部合唱排列是 Soprano（女高音）-Alto（中音）-Tenor（男高音）-Bass（男低音），简称 SATB。","在乐器上，alto 最常见的搭配是 alto sax（中音萨克斯）。日常交流里说 “two altos” 常被理解为“两把中音萨克斯”，具体还要看上下文（合唱/乐队）。"]}
{"word":"altostratus","summary":{"en":"Altostratus is a gray-blue mid-level cloud layer that often covers the sky and dims the sun.","zh":"Altostratus 指灰蓝色的中层层状云，常覆盖大片天空并使太阳变暗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of mid-level cloud that forms a gray or bluish sheet covering much of the sky, often making the sun look dim or like it’s seen through frosted glass.","zh":"高层云的一种中层云：呈灰色或带蓝灰的云层，常像一整片薄毯覆盖天空，让太阳显得昏暗、像隔着毛玻璃。"},"examples":[{"en":"Altostratus clouds spread across the sky before the storm arrived.","zh":"暴风雨到来前，高层云在天空中铺展开来。"},{"en":"The sun looked pale behind the altostratus.","zh":"太阳在高层云后面显得很苍白。"}]}],"synonyms":["mid-level cloud layer","cloud sheet"],"phonetic":"/ˌæltoʊˈstrætəs/","extraExplanation":["“altostratus”来自拉丁语词根：alto- 表示“高的”（在气象学中指中层高度），stratus 表示“层状云”。因此它字面意思就是“中层的层云”。","在天气预报里，出现高层云常意味着大范围暖锋接近，之后可能转为更厚的雨层云（nimbostratus）并带来持续性降水。","与“cirrostratus（卷层云）”相比，高层云更厚、更低，常能让太阳只呈现模糊的亮斑；与“stratus（层云）”相比，高层云高度更高、范围常更广。"]}
{"word":"altoun","summary":{"en":"Altoun is an archaic spelling for a brass-like yellow metal (latoun/latten), and by extension can mean ‘golden-colored.’","zh":"Altoun 是古英语里对一种类似黄铜的黄色合金（latoun/latten）的异拼，也可引申为“金色的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic, variant spelling of **latoun**) a yellow metal alloy (often like brass/latten) used in medieval Europe for decorative objects.","zh":"（古义，**latoun** 的异拼）一种黄色金属合金（常类似黄铜/“latten”），中世纪欧洲常用于装饰性器物。"},"examples":[{"en":"The buckle was made of altoun and shone like gold.","zh":"那枚扣环是用 altoun 制成的，闪得像黄金一样。"},{"en":"In old poems, altoun often describes metal that looks golden.","zh":"在古老诗歌里，altoun 常用来形容看起来像金子的金属。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare, archaic) golden-colored; made to look like gold.","zh":"（罕见，古义）金色的；做得像黄金的。"},"examples":[{"en":"An altoun crown sat on the statue’s head.","zh":"雕像头上戴着一顶金色的（altoun）王冠。"}]}],"synonyms":["latoun","latten","brass","golden-colored"],"phonetic":"/ləˈtun/","extraExplanation":["“altoun”在现代英语里几乎不用，更多见于中世纪/早期英语文本，常被认为是“latoun”的变体拼写。“latoun/latten”指一种铜合金（接近黄铜），因颜色像金而在文学中常用来营造“金光闪闪”的意象。阅读古典作品时，如果你看到 altoun，可以先联想到“brass/latten（黄铜类）”或“golden-looking（像金子一样）”。"]}
{"word":"altretamine","summary":{"en":"Altretamine is a chemotherapy medicine used mainly for certain ovarian cancers.","zh":"Altretamine 是一种主要用于某些卵巢癌的化疗药物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemotherapy drug (an antineoplastic agent) used mainly to treat certain ovarian cancers, especially when other treatments have not worked","zh":"一种化疗药（抗肿瘤药），主要用于治疗某些卵巢癌，尤其常在其他治疗无效时使用"},"examples":[{"en":"Altretamine may be prescribed for recurrent ovarian cancer.","zh":"Altretamine 可能会用于复发性卵巢癌的治疗。"},{"en":"The doctor explained the possible side effects of altretamine before starting treatment.","zh":"开始治疗前，医生解释了 altretamine 可能带来的副作用。"}]}],"synonyms":["Hexalen","chemotherapy drug","antineoplastic agent"],"phonetic":"/ælˈtrɛtəˌmin/","extraExplanation":["Altretamine 是药物通用名，曾以品牌名 Hexalen 出现；在医学语境里常与“chemotherapy / ovarian cancer / side effects（化疗/卵巢癌/副作用）”一起出现。","它属于抗癌药物的一类，但并不是日常英语词汇；在阅读病历、药单或医学科普时更常见。"]}
{"word":"altrices","summary":{"en":"Altrices is a rare plural noun meaning “female nourishes/caretakers; foster-nurses,” from Latin.","zh":"Altrices 是一个罕见的复数名词，指“女性养育者/照料者；乳母（保育者）”，源自拉丁语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) plural of altrix: a female nourisher or foster-nurse; someone (often a woman) who feeds, raises, or supports others.","zh":"（罕见）altrix 的复数：女性的养育者、乳母/保育者；（常指女性）喂养、抚育或扶持他人的人。"},"examples":[{"en":"In the old Latin text, the altrices are praised for raising the children of the household.","zh":"在那部古拉丁文本中，altrices 因抚育家中的孩子而受到称颂。"},{"en":"The poem calls the earth and rivers our altrices, because they sustain life.","zh":"那首诗把大地与河流称作我们的 altrices，因为它们滋养生命。"}]}],"synonyms":["nurturers","caretakers","foster mothers","nurses"],"phonetic":"ælˈtraɪsiːz","extraExplanation":["“altrices”来自拉丁语：单数为 **altrix**（女性名词），源自动词 **alere**（喂养、滋养、抚育）。在现代英语中非常少见，多出现在古典研究、拉丁文本译注或较文学化的比喻中。","常见的近义表达可以用更现代、易懂的词来替换，如 **nurturers**（养育者）、**caretakers**（照料者）、**foster mothers**（养母/寄养母亲）等。"]}
{"word":"altricial","summary":{"en":"Altricial describes young animals that are born or hatched very undeveloped and need extensive parental care.","zh":"altricial 用于描述出生/孵化时发育不完善、需要亲代大量照料与喂养的幼体（晚成型）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of animals, especially birds) hatched or born in an undeveloped state and needing a lot of care and feeding from parents.","zh":"（指动物，尤指鸟类）早成不足的；孵化/出生时发育不完善、需要父母大量照料和喂养的。"},"examples":[{"en":"Songbirds are altricial, so the parents must feed the chicks for weeks.","zh":"鸣禽多为晚成型，所以亲鸟必须喂养雏鸟好几周。"},{"en":"An altricial newborn cannot survive alone and depends on parental care.","zh":"晚成型的新生幼体无法独立生存，必须依赖亲代照顾。"}]}],"synonyms":["dependent","underdeveloped (at birth)","nestbound"],"phonetic":"/ælˈtrɪʃəl/","extraExplanation":["“Altricial”常与“precocial（早成型的）”对比：precocial幼体出生/孵化时已较成熟，能较快行走、觅食；altricial则更“无助”，需要筑巢、保温、频繁喂食。","词源来自拉丁语 *alere*（喂养、培育），因此含义核心与“被喂养、被抚育”有关。"]}
{"word":"Altrincham","summary":{"en":"Altrincham is a town in Greater Manchester, England.","zh":"Altrincham（奥特灵厄姆）是英国英格兰大曼彻斯特郡的一个城镇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a town in Greater Manchester, England, known for its market, nearby suburbs, and good transport links to Manchester (often used in addresses and travel).","zh":"英国英格兰大曼彻斯特郡的一个城镇，以集市、周边住宅区以及通往曼彻斯特的交通便利而闻名（常用于地址与出行描述）。"},"examples":[{"en":"Altrincham is about 8 miles southwest of Manchester city centre.","zh":"奥特灵厄姆距离曼彻斯特市中心西南约8英里。"},{"en":"We took the tram to Altrincham for the weekend market.","zh":"我们坐有轨电车去奥特灵厄姆逛周末集市。"},{"en":"Her office is in Altrincham, so she commutes from Manchester.","zh":"她的办公室在奥特灵厄姆，所以她从曼彻斯特通勤。"}]}],"phonetic":"/ˈæltrɪŋəm/","extraExplanation":["读音提示：重音通常在第一个音节 AL-。","词源小知识：名称中的 -ham 在古英语地名里常见，通常与“家园/村落”有关；整体名称的早期形式与当地的聚落与地形有关。","文化与语境：在英国日常用法中，Altrincham 常作为地名出现在地址、通勤路线（如电车/火车线路）、以及当地市场与足球俱乐部（Altrincham F.C.）相关的对话中。"]}
{"word":"Altro","summary":{"en":"Altro is an Italian word meaning “other/another/else,” and it can also appear in music directions in Italian scores.","zh":"Altro 是意大利语，意思是“其他的/另一个/别的”，也常见于乐谱意大利语指示中表示“另一个/其他”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Italian) other; another; else (used to refer to a different person/thing, or something additional).","zh":"（意大利语）其他的；另一个的；别的（指不同的人/事物，或额外的）"},"examples":[{"en":"Vuoi un altro caffè?","zh":"你还要（另）一杯咖啡吗？"},{"en":"Non ho altro da dire.","zh":"我没有别的要说了。"},{"en":"Cerco un altro lavoro.","zh":"我在找另一份工作。"}]},{"partOfSpeech":"pron.","definition":{"en":"(Italian) another one; something else; the rest (used as a pronoun).","zh":"（意大利语）另一个；别的东西；其余（作代词用）"},"examples":[{"en":"Prendo questo; l’altro lo lasciamo qui.","zh":"我拿这个；另一个我们就放这儿。"},{"en":"C’è altro?","zh":"还有别的吗？"}]},{"partOfSpeech":"other","definition":{"en":"(Music, Italian in scores) “another / other,” used in directions like “Altro tempo” (“another tempo”).","zh":"（音乐术语，乐谱中的意大利语）“另一个/其他”，常见于如“Altro tempo”（换到另一种速度）的指示"},"examples":[{"en":"The score marks: “Altro tempo” after the pause.","zh":"乐谱在停顿后标注了“Altro tempo”（换另一种速度）。"}]}],"synonyms":["other","another","else","different"],"phonetic":"/ˈɑl.troʊ/","extraExplanation":["“Altro”是意大利语里非常高频的词，常见搭配有：un altro（另一个/再来一个）、qualcun altro（别人/另一个人）、nient’altro（没有别的/仅此而已）、altro che…（哪是……，分明是……，带强调或反驳语气）。","在意大利语里，“altro”会按性别和数变化：altro（阳单）、altra（阴单）、altri（阳复）、altre（阴复）。"]}
{"word":"altropathy","summary":{"en":"Altropathy is a rare term meaning an “other” or nonstandard form of treatment, sometimes referring to alternative medicine.","zh":"Altropathy 是个很少见的词，指“另一种/非主流”的治疗方式，有时指替代医学。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, somewhat old-fashioned) Treatment or medical practice that is “other” or nonstandard; sometimes used to mean alternative medicine.","zh":"（罕见、略旧式）指“另一种/非主流”的治疗或医疗做法；有时用来泛指替代医学。"},"examples":[{"en":"Some 19th‑century writers contrasted homeopathy, allopathy, and altropathy.","zh":"一些19世纪作者会把顺势疗法、对抗疗法（常规医学）和“altropathy”并列对比。"},{"en":"The term altropathy is rare today; most people say “alternative medicine.”","zh":"如今“altropathy”很少见；大多数人会说“alternative medicine（替代医学）”。"}]}],"synonyms":["alternative medicine","complementary medicine","unconventional therapy"],"phonetic":"/ælˈtrɑpəθi/","extraExplanation":["这个词在现代英语里非常少见，更多出现在较早期的医学争论语境中。日常表达建议用更常见、更清晰的说法：alternative medicine（替代医学）、complementary medicine（补充/辅助医学）。","词形上常被理解为 altro-（“其他/另种”，源自拉丁语 alter=“另一个”）+ -pathy（“疗法/疾病”，见于 homeopathy, neuropathy 等）。因此它字面含义接近“另一种疗法”。","注意不要和 allopathy（对抗疗法；在顺势疗法语境中指“常规医学”）混淆；两者拼写相近但指向不同。"]}
{"word":"altrose","summary":{"en":"Altrose is a rare six‑carbon simple sugar mainly discussed in chemistry/biochemistry.","zh":"Altrose 是一种较少见的六碳单糖，主要出现在化学/生物化学语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare simple sugar (an aldohexose) used mainly in chemistry and biochemistry; it is one of the stereoisomers of glucose.","zh":"一种较少见的单糖（醛己糖），主要用于化学与生物化学研究；它是葡萄糖的立体异构体之一。"},"examples":[{"en":"Altrose is studied in carbohydrate chemistry because it is a rare hexose.","zh":"在糖类化学中会研究 altrose，因为它是一种较少见的己糖。"},{"en":"The lab compared glucose and altrose to understand how stereochemistry affects reactions.","zh":"实验室比较了葡萄糖和 altrose，以了解立体化学如何影响反应。"}]}],"synonyms":["aldohexose","L-altrose","D-altrose"],"phonetic":"/ælˈtroʊs/","extraExplanation":["Altrose 常见于学术语境（教科书、论文、实验室对话），日常生活里几乎不会用来指“食糖”。","它属于“aldohexose（醛己糖）”，意思是：有 6 个碳原子、并带有醛基的一类单糖；与葡萄糖等互为立体异构体（原子连接方式相同，但空间排列不同）。","你可能会看到更具体的写法，如 L-altrose 或 D-altrose；这里的 D/L 用来表示与甘油醛相比的构型类别。"]}
{"word":"altruism","summary":{"en":"Altruism means selfless concern for others and actions that help them, sometimes at a personal cost.","zh":"Altruism 指无私关心他人并帮助他人，有时会让自己付出代价的行为与精神。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Caring about other people’s well-being and acting to help them, sometimes even when it costs you time, money, or comfort.","zh":"利他主义：关心他人的福祉并采取行动去帮助他人，即使这会让自己付出时间、金钱或舒适度的代价。"},"examples":[{"en":"Donating blood is a simple act of altruism.","zh":"献血是一种简单的利他行为。"},{"en":"Her altruism showed when she stayed late to help a new coworker.","zh":"她留下来加班帮助新同事，体现了她的利他精神。"},{"en":"Some people debate whether true altruism exists or whether we always gain something in return.","zh":"有些人争论是否真的存在“纯粹的利他主义”，还是我们总会得到某种回报。"}]},{"partOfSpeech":"n.","definition":{"en":"In biology and social science, behavior that benefits others (or a group) even if it reduces the individual’s chances of survival or success.","zh":"（生物学/社会科学）利他行为：对他人或群体有利，但可能降低个体生存或成功机会的行为。"},"examples":[{"en":"In nature, altruism can be seen when an animal warns the group of danger.","zh":"在自然界中，当动物发出警报提醒群体危险时，就能看到利他行为。"},{"en":"Researchers study altruism to understand cooperation in human societies.","zh":"研究者研究利他主义，以理解人类社会中的合作。"}]}],"synonyms":["selflessness","kindness","benevolence","charity"],"phonetic":"/ˈæltruˌɪzəm/","extraExplanation":["词源：来自拉丁语 alter（“他者/别人”），强调“以他人为中心”。","用法提示：altruism 常指一种价值观或品格（an attitude/trait）；具体行为可说 an act of altruism 或 altruistic behavior。","常见搭配：pure altruism（纯粹利他）、social altruism（社会利他）、altruism vs. self-interest（利他 vs. 私利）。","相关词：altruistic（adj. 利他的）；反义倾向词：selfishness（自私）、egoism（利己主义）。"]}
{"word":"altruisms","summary":{"en":"Altruism means caring about others and helping them selflessly; “altruisms” can also mean different altruistic principles or sayings.","zh":"altruism 指利他主义、无私助人；altruisms 也可指不同的利他主张或格言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Unselfish concern for other people’s well-being; the belief or practice of helping others, sometimes at a cost to yourself.","zh":"利他主义；无私为他人着想的信念或行为（有时会牺牲自身利益）。"},"examples":[{"en":"Her altruism showed when she volunteered every weekend at the food bank.","zh":"她每个周末都去食物银行做志愿者，体现了她的利他精神。"},{"en":"Some acts of altruism are small, like sharing notes with a classmate who was sick.","zh":"有些利他行为很小，比如把笔记分享给生病缺课的同学。"},{"en":"The novel explores whether altruism can survive in a competitive society.","zh":"这部小说探讨利他主义能否在竞争激烈的社会中存活。"}]},{"partOfSpeech":"n.","definition":{"en":"(Plural: altruisms) Different specific principles, sayings, or philosophies that promote helping others.","zh":"（复数：altruisms）不同的利他观念、主张或格言（强调帮助他人）。"},"examples":[{"en":"The speaker compared several cultural altruisms about caring for strangers.","zh":"演讲者比较了多种文化中关于关怀陌生人的利他观念。"},{"en":"Their team values weren’t empty altruisms; they shaped daily decisions.","zh":"他们团队的价值观不是空洞的利他口号，而是影响了日常决策。"}]}],"synonyms":["selflessness","generosity","benevolence","charity","kindness"],"phonetic":"/ˈæltruˌɪzəm/","extraExplanation":["“altruism”源自法语altruisme，与“autrui”（他人）有关，常与“egoism”（利己主义）对比。","在日常英语里更常用单数“altruism”表示一种品质或理念；复数“altruisms”多用于谈“不同种类/版本的利他主张或口号”。"]}
{"word":"altruist","summary":{"en":"An altruist is someone who selflessly helps others and cares about their well-being.","zh":"altruist 指“利他主义者”，强调无私地关心并帮助他人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who cares about other people’s well-being and tries to help them, sometimes even at a personal cost","zh":"利他主义者；无私帮助他人的人（有时会牺牲自己的利益）"},"examples":[{"en":"She’s an altruist who volunteers at the food bank every weekend.","zh":"她是个利他主义者，每个周末都去食物银行做志愿者。"},{"en":"As an altruist, he donated anonymously so no one would praise him.","zh":"作为一个利他主义者，他匿名捐款，不想得到任何称赞。"},{"en":"True altruists help because they genuinely care, not because they want attention.","zh":"真正的利他主义者帮助别人是出于关心，而不是为了博取关注。"}]},{"partOfSpeech":"n.","definition":{"en":"someone whose actions are guided by altruism (the belief that helping others is important)","zh":"以利他主义为原则行事的人（认为帮助他人很重要）"},"examples":[{"en":"Many healthcare workers are seen as altruists because they put patients first.","zh":"许多医护人员被视为利他主义者，因为他们把病人放在第一位。"},{"en":"He’s not trying to be a hero—he’s simply an altruist by nature.","zh":"他不是想当英雄——他天性就是个利他主义者。"}]}],"synonyms":["selfless person","good Samaritan","humanitarian"],"phonetic":"/ˈæltruɪst/","extraExplanation":["“altruist / altruism”常用于正式语境（新闻、学术、公益组织），日常口语里也可以说：a very kind person / someone who’s selfless（很无私的人）。","词源提示：altruism 来自法语 autre（“他人”），核心概念就是“以他人为中心”。","相关对比：altruist（利他的人）≠ philanthropist（慈善家，常指捐钱支持公益，偏“慈善捐赠/资助”）。相反词常见有 selfish person（自私的人）或 egoist（利己主义者，较书面）。"]}
{"word":"altruistic","summary":{"en":"Altruistic means unselfishly caring about others and helping them without expecting a reward.","zh":"Altruistic 指无私地关心并帮助他人，通常不期待回报。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"showing selfless concern for other people’s well-being; unselfish and generous, often without expecting anything in return","zh":"利他的；无私的：关心他人福祉，愿意帮助别人，通常不求回报"},"examples":[{"en":"She is known for her altruistic work with homeless families.","zh":"她因帮助无家可归家庭的利他工作而广为人知。"},{"en":"Donating blood is often seen as an altruistic act.","zh":"献血常被视为一种利他的行为。"},{"en":"His altruistic decision put the team’s needs before his own.","zh":"他的无私决定把团队的需求放在了自己的需求之前。"}]}],"synonyms":["selfless","unselfish","benevolent","generous","charitable"],"phonetic":"/ˌæl.truˈɪs.tɪk/","extraExplanation":["“altruistic”来自“altruism（利他主义）”，常用于讨论道德、心理学和社会行为。它强调“为别人好”这一动机，而不只是表面上的“做了好事”。","易混词对比：\n- altruistic（利他/无私）：重点在“不求回报”。\n- kind（善良）：更日常，动机不一定强调无回报。\n- charitable（慈善的）：常与捐款、慈善机构相关。"]}
{"word":"altruistically","summary":{"en":"“Altruistically” means doing something in a selfless way to help others, not yourself.","zh":"“altruistically”表示以无私、利他的方式做事，目的是帮助他人而非自己获益。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a selfless way; with the intention of helping others rather than benefiting yourself.","zh":"无私地；利他地（以帮助他人为目的，而不是为了自己的利益）。"},"examples":[{"en":"She donated blood altruistically, without expecting anything in return.","zh":"她无私地献血，不求任何回报。"},{"en":"The group works altruistically to support families after disasters.","zh":"这个团体以利他的方式工作，帮助灾后家庭。"}]}],"synonyms":["selflessly","unselfishly","charitably","benevolently"],"phonetic":"/ˌæltruˈɪstɪkli/","extraExplanation":["“altruistically”来自“altruism（利他主义）”。这个词常用于描述捐款、志愿服务、照顾弱者等行为，语气偏正式。","注意区分：altruistically（动机是为他人） vs. generously（慷慨，强调给得多，不一定讨论动机）。","在写作中它常与动词连用：act altruistically（利他行事）, behave altruistically（表现得无私）, donate altruistically（出于利他而捐赠）。"]}
{"word":"altruists","summary":{"en":"“Altruists” are people who help others selflessly, without expecting rewards.","zh":"altruists 指“利他主义者”，即不求回报、无私帮助他人的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who care about others’ well-being and often help, share, or sacrifice for others without expecting a reward.","zh":"利他主义者；关心他人福祉、常常在不求回报的情况下帮助、分享或为他人付出的人。"},"examples":[{"en":"The disaster relief team included many altruists who volunteered their time and skills.","zh":"救灾队里有很多利他主义者，他们自愿贡献时间和技能。"},{"en":"She’s an altruist—she donates quietly and never asks for credit.","zh":"她是个利他主义者——她默默捐助，从不邀功。"},{"en":"Some altruists choose careers in teaching or healthcare because they want to serve others.","zh":"一些利他主义者选择从事教育或医疗行业，因为他们想服务他人。"}]}],"synonyms":["selfless people","philanthropists","humanitarians"],"phonetic":"/ˈæltruɪsts/","extraExplanation":["“altruist”来自“altruism（利他主义）”。日常英语里也常说“a very selfless person（非常无私的人）”。","注意：altruist强调“动机是不求回报”，但并不表示这个人永远不照顾自己；合理的自我照顾与利他并不矛盾。","相关词：altruistic（adj. 利他的）、selfless（adj. 无私的）、charitable（adj. 乐善好施的）；反义倾向：selfish（自私的）。"]}
{"word":"alts","summary":{"en":"“Alts” most often means alternate accounts/characters online; it can also mean informal “alternatives” (other options).","zh":"“alts”最常指网络中的小号/分身账号或角色；也可非正式地表示“alternatives”（备选方案）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Alternative accounts or characters used in online games, social media, or other platforms (short for “alts”).","zh":"（网络游戏/社交媒体等中的）小号、分身账号/角色（“alternate accounts/characters”的简称）。"},"examples":[{"en":"He got banned on his main account, so he started using alts.","zh":"他的主号被封了，所以开始用小号。"},{"en":"That streamer plays on alts to practice new strategies.","zh":"那个主播会用小号练习新战术。"}]},{"partOfSpeech":"n.","definition":{"en":"Alternatives; other choices or options (informal shortening of “alternatives”).","zh":"替代选项；其他选择（“alternatives”的非正式缩写）。"},"examples":[{"en":"If this plan doesn’t work, we have a few alts.","zh":"如果这个方案不行，我们还有几个备选。"},{"en":"Do you have any dairy-free alts for this recipe?","zh":"这道菜有不含乳制品的替代方案吗？"}]}],"synonyms":["alternate accounts","alt accounts","smurfs (gaming)","alternatives","other options"],"phonetic":"/ɔlts/","extraExplanation":["“alts”常见于网络语境（尤其是游戏、论坛、社交平台），通常与“main（主号）”相对。使用小号可能是为了练习、隐私、分开社交圈，也可能用于规避封禁（这在很多平台规则里是不允许的）。","在口语/聊天里把“alternatives”简写成“alts”也很常见，尤其在工作沟通、文本消息中；正式写作中建议用“alternatives”。"]}
{"word":"altschin","summary":{"en":"“Altschin” is not a common English vocabulary word; it’s most likely a name (surname/place name) or a misspelling of another term.","zh":"“Altschin”不是常见英语词汇；更可能是名字（姓氏/地名）或其他词的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as a surname or a place-name spelling in some European contexts.","zh":"不是标准英语词；更常见于姓氏或某些欧洲语境中的地名拼写。"},"examples":[{"en":"I couldn’t find “Altschin” in an English dictionary; it may be a family name.","zh":"我在英语词典里找不到“Altschin”；它可能是一个姓。"},{"en":"The article mentions Dr. Altschin as the lead researcher.","zh":"文章提到 Altschin 医生是主要研究者。"}]},{"partOfSpeech":"other","definition":{"en":"A possible misspelling or transliteration of a different word/name (the intended form depends on the source text).","zh":"可能是其他词/名字的拼写错误或音译（具体应以原始文本为准）。"},"examples":[{"en":"Did you mean “Aldchin” or “Altchin”? Please share the sentence for context.","zh":"你是不是想写“Aldchin”或“Altchin”？可以把它所在的句子发我看看吗？"}]}],"phonetic":"/ˈæltsʃɪn/","extraExplanation":["“Altschin”看起来更像德语/中欧地区的拼写形式：德语里“Alt-”常表示“老的/旧的”。有些地名在历史上会有德语名与当地语言名两套写法（例如旧地图、家谱或历史文献里）。","如果你能提供它出现的句子、领域（人名/地名/品牌/游戏/小说）或原文截图，我可以更准确判断它指的是什么，并给出更合适的读音与用法。"]}
{"word":"altumal","summary":{"en":"Autumnal means “of or like autumn,” and can also describe the later stage of life in a poetic way.","zh":"Autumnal 意为“秋天的/像秋天的”，也可带文学色彩地指“人生暮年”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to autumn (fall), or typical of autumn weather and colors.","zh":"与秋季（秋天）有关的；具有秋天气候或色彩特征的。"},"examples":[{"en":"The mountains looked beautiful in the autumnal light.","zh":"群山在秋日的光线下显得格外美。"},{"en":"We took an autumnal walk through the park, surrounded by yellow leaves.","zh":"我们在公园里进行了一次充满秋意的散步，四周都是黄叶。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Suggesting the later part of life or a period of decline, like the season after summer.","zh":"（比喻）带有“人生暮年/走下坡路”的意味，像夏后之秋。"},"examples":[{"en":"In his autumnal years, he spent more time reading and reflecting.","zh":"在他人生的暮年，他花更多时间阅读与沉思。"}]}],"synonyms":["fall","autumn","seasonal","rust-colored"],"phonetic":"/ɔˈtʌmnəl/","extraExplanation":["“altumal”不是常见英文词，最可能是把“autumnal”拼错了（正确拼写：autumnal）。","“autumnal”常见于较书面或文学化的表达，用来描写秋天的光线、颜色与氛围（如 *autumnal light / colors*）。日常口语里更常直接说 *fall* 或 *autumn*。"]}
{"word":"altun","summary":{"en":"Altun is a historical term for a gold coin, named from a Turkic word meaning “gold.”","zh":"Altun 是一个历史用语，指一种金币，名字源自突厥语中“黄金”的词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former gold coin used in parts of the Ottoman/Turkish world (and sometimes in nearby regions), whose name comes from a Turkic word meaning “gold.”","zh":"一种旧时在奥斯曼/土耳其世界（有时也见于周边地区）使用的金币，其名称源自突厥语中“黄金”的意思。"},"examples":[{"en":"The museum displayed an altun alongside other Ottoman coins.","zh":"博物馆把一枚 altun 与其他奥斯曼硬币一起展出。"},{"en":"In the story, he paid the merchant with a single altun.","zh":"在故事里，他用一枚 altun 付给商人钱。"}]}],"synonyms":["gold coin","historical coin"],"phonetic":"/ælˈtuːn/","extraExplanation":["“Altun”常被认为与突厥语词根有关（如土耳其语 altın，意为“黄金”）。因此在历史文本或译著里，它多用于指“金币/金钱”，也可能作为人名或姓氏出现（尤其在土耳其语环境中），需要结合上下文判断。"]}
{"word":"Altura","summary":{"en":"Altura usually means “height/altitude” (borrowed from Spanish/Portuguese), and it can also be a place name.","zh":"Altura 通常指“高度/海拔”（源自西班牙语/葡萄牙语的借词），也可用作地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"height; altitude (the vertical distance above a surface, especially sea level)","zh":"高度；海拔（尤指高于海平面的垂直高度）"},"examples":[{"en":"The hikers checked the altura (altitude) before starting the climb.","zh":"徒步者在开始攀登前查看了海拔（altura）。"},{"en":"At this altura, the air feels thinner.","zh":"在这个海拔高度，空气感觉更稀薄。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used for towns/regions (a proper noun)","zh":"地名（专有名词，用于城镇或地区名称）"},"examples":[{"en":"She lives in Altura, Minnesota.","zh":"她住在明尼苏达州的 Altura。"},{"en":"We passed through Altura on our road trip.","zh":"我们自驾游时经过了 Altura。"}]}],"synonyms":["altitude","height","elevation"],"phonetic":"/ælˈtʊrə/","extraExplanation":["“Altura”常见于西班牙语和葡萄牙语，基本义是“高度/海拔”。在英语语境里，它有时会直接借用来表达“海拔”，尤其见于地理、登山或旅游文本；更多时候则作为地名出现（如美国某些小镇名）。","在西语里也常见搭配如“a gran altura”（在很高的地方/高空），对应英语的“at a high altitude”。"]}
{"word":"Alturas","summary":{"en":"“Alturas” is most commonly a U.S. place name (a city in northeastern California). It can also be Spanish for “heights/altitudes,” the plural of “altura.”","zh":"“Alturas”最常见是美国地名（加州东北部城市）。它也可能是西班牙语，意为“高度/高处/海拔”，是 altura 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Alturas: a small city in northeastern California, USA (county seat of Modoc County).","zh":"Alturas：美国加利福尼亚州东北部的一座小城市（莫多克县县治）。"},"examples":[{"en":"We stopped overnight in Alturas on our road trip through northeastern California.","zh":"我们在穿越加州东北部的公路旅行中在 Alturas 过了一夜。"},{"en":"Alturas is known for its high-desert landscape and wide-open skies.","zh":"Alturas 以其高地沙漠景观和开阔的天空而闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"(Spanish) “alturas”: plural of “altura,” meaning heights, altitude, or high places (often used in phrases like “a estas alturas”).","zh":"（西班牙语）“alturas”：altura 的复数，意思是“高度、海拔、较高的地方”；也常见于短语 a estas alturas（“到了这个时候/此时此刻”）。"},"examples":[{"en":"Spanish: A estas alturas, we should be ready to leave.","zh":"西班牙语：A estas alturas，我们现在应该准备出发了。"},{"en":"Spanish: The hikers struggled at high altitudes (a grandes alturas).","zh":"西班牙语：徒步者在高海拔（a grandes alturas）处行走很吃力。"}]}],"synonyms":["(Spanish) alturas: height(s), altitude(s), high places"],"phonetic":"/ælˈtʊrəs/","extraExplanation":["作为美国地名时，Alturas 通常被当作专有名词使用，中文里多按音译处理（如“阿尔图拉斯”），也有人按西班牙语词源理解为“高地/高处”。","西班牙语短语 a estas alturas 很常用，语气上相当于英语的 “by now / at this point”。"]}
{"word":"alture","summary":{"en":"“alture” is not a standard word; it is most often a misspelling of “altitude,” meaning height above sea level or ground.","zh":"“alture” 不是标准单词；它最常见是 “altitude” 的拼写错误，意思是海拔/高度。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Common misspelling) Intended word: “altitude” — the height of something above sea level or above the ground.","zh":"（常见拼写错误）通常想写的是 “altitude”——指某物高于海平面或地面的高度。"},"examples":[{"en":"The plane is flying at a high altitude.","zh":"飞机正以很高的高度飞行。"},{"en":"At this altitude, the air feels thinner.","zh":"在这个海拔高度，空气感觉更稀薄。"}]},{"partOfSpeech":"n.","definition":{"en":"“Altitude” can also mean an organization’s or person’s height/level in a metaphorical sense (a high level of quality, importance, or thought).","zh":"“Altitude” 也可用于比喻，表示（质量、重要性或思想等的）高度/层次。"},"examples":[{"en":"Her writing reaches a new altitude in this book.","zh":"她在这本书里的写作达到了新的高度。"}]}],"synonyms":["height","elevation"],"phonetic":"ˈæl.tə.tud","extraExplanation":["“alture” 不是标准英文单词，最常见的情况是把 “altitude” 拼错了（常见错误：漏掉中间的 “t i” 或写错字母顺序）。","如果你其实想表达“吸引力/诱惑”，你可能要找的是 “allure”。如果你告诉我你的句子，我可以帮你确认你想用哪个词。"]}
{"word":"Altus","summary":{"en":"Altus is most commonly a place name (a city in Oklahoma, USA). It also appears as the Latin word altus meaning ‘high/lofty’ (and sometimes ‘deep’).","zh":"Altus 最常见是地名（美国俄克拉荷马州的城市名）。它也可作为拉丁语 altus 出现，表示“高的/崇高的”（有时也指“深的”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a city in southwestern Oklahoma, USA; also the name of Altus Air Force Base nearby.","zh":"（专有名词）美国俄克拉荷马州西南部的城市“阿尔特斯（Altus）”；附近也有“阿尔特斯空军基地（Altus Air Force Base）”。"},"examples":[{"en":"She grew up in Altus, Oklahoma.","zh":"她在俄克拉荷马州的阿尔特斯长大。"},{"en":"He was stationed at Altus Air Force Base for training.","zh":"他被派到阿尔特斯空军基地参加训练。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Latin, used in mottos, literature, and scientific names) ‘high,’ ‘lofty’; in some contexts it can also mean ‘deep.’","zh":"（拉丁语词，常见于格言、文学或学名）“高的、崇高的”；在某些语境中也可表示“深的”。"},"examples":[{"en":"The Latin word altus can mean ‘high,’ as in a ‘lofty mountain.’","zh":"拉丁语 altus 可以表示“高的”，比如“高耸的山”。"},{"en":"In older texts, altus may also describe something ‘deep,’ like deep water.","zh":"在较早的文本里，altus 也可能形容“深的”，比如深水。"}]}],"synonyms":["high","lofty"],"phonetic":"/ˈæl.təs/","extraExplanation":["“Altus”作为英语里的地名时，通常读作 /ˈæl.təs/，重音在第一个音节。","拉丁语“altus”之所以既可表示“高”又可表示“深”，与其描述“从地面/表面向上或向下的垂直距离”有关：山峰很“高”，海水很“深”。","在英语里你有时会在校训、徽章标语或生物学命名（尤其是拉丁化名称）里看到“altus/alta/altum”这一词根或变体，常用来表达“高、崇高”的含义。"]}
{"word":"altus","summary":{"en":"Altus usually refers to the alto (middle/high) voice part in older choral naming, and it is also used as a proper name (e.g., a U.S. city).","zh":"Altus 通常指较早合唱命名中的“中音/女中音”声部；也常作为专有名词（如美国城市名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Music) The alto voice or part in choral music, especially in older or Latin-based naming (e.g., soprano–altus–tenor–bassus).","zh":"（音乐）合唱中的“女中音/中音”声部；尤其常见于较早或拉丁命名体系中（如 soprano–altus–tenor–bassus）。"},"examples":[{"en":"In the Renaissance score, the altus line sits between the soprano and tenor.","zh":"在这首文艺复兴时期的乐谱里，altus 声部位于女高音和男高音之间。"},{"en":"She was assigned to sing altus in the choir.","zh":"她在合唱团被分到唱 altus（中音/女中音）声部。"}]},{"partOfSpeech":"n.","definition":{"en":"A proper name used for places or people (e.g., Altus, a city in Oklahoma, USA).","zh":"专有名词：用于地名或人名（例如美国俄克拉何马州的城市 Altus）。"},"examples":[{"en":"He drove through Altus on his way across Oklahoma.","zh":"他横穿俄克拉何马州时路过了 Altus。"}]}],"synonyms":["alto"],"phonetic":"/ˈæl.təs/","extraExplanation":["“altus”源自拉丁语，意思是“高的/深的”（在不同语境里可指高度或深度）。英语里它最常见于音乐术语（指“alto/中音声部”），以及作为地名或人名出现。"]}
{"word":"alty","summary":{"en":"“Alty” is informal slang meaning “alternative” in style, music, or taste; it can describe something or someone.","zh":"“Alty”是非正式俚语，表示“另类/非主流”的风格、音乐或品味；既可形容事物也可指人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal, mainly UK/Ireland) Alternative; related to an alternative style, music scene, or way of dressing.","zh":"（非正式，主要用于英/爱）“另类的”；与另类风格、音乐圈或穿搭有关的。"},"examples":[{"en":"He’s kind of alty—he listens to indie bands and dresses differently.","zh":"他有点“另类风”——听独立乐队，穿得也不太一样。"},{"en":"She posted an alty outfit on social media.","zh":"她在社交媒体上发了一套“另类风”穿搭。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) A person who is “alternative” in style or taste.","zh":"（非正式）“另类的人”；指品味或风格偏独特的人。"},"examples":[{"en":"The party was full of alties from the local music scene.","zh":"派对里全是本地音乐圈的“另类青年”。"},{"en":"He’s an alty, but he’s really friendly.","zh":"他是个“另类风”的人，但人很友好。"}]}],"synonyms":["alternative","alt","indie","non-mainstream"],"phonetic":"/ˈɔlti/","extraExplanation":["“alty”通常是“alt/alternative”的口语变体，多见于社交媒体、口头聊天或年轻人语境；在正式写作中建议用“alternative / indie / non-mainstream”等更清晰的表达。","不同地区对“alt/alty”的联想可能不同：有时偏向“独立/非主流审美”，有时也特指某些亚文化穿搭与音乐圈；用时最好结合上下文，避免贴标签或带贬义。"]}
{"word":"altyn","summary":{"en":"Altyn most commonly means “gold” in Turkic languages; it can also be a personal name and a historical Russian coin.","zh":"Altyn 最常见的意思是突厥语中的“黄金”；也可作人名，并且曾是俄国历史上的一种硬币名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Turkic word meaning “gold,” sometimes used in names or as a poetic/brand term in Central Asia and nearby regions.","zh":"突厥语中的“黄金”，有时用于人名、诗意用法或品牌名称（中亚及周边地区较常见）。"},"examples":[{"en":"The jewelry shop is called Altyn to suggest “gold” and high value.","zh":"这家珠宝店取名为 Altyn，用来暗示“黄金”和高价值。"},{"en":"In some Turkic languages, altyn simply means “gold.”","zh":"在一些突厥语中，altyn 就是“黄金”的意思。"}]},{"partOfSpeech":"n.","definition":{"en":"a personal name (given name or surname) found in some Turkic-speaking communities; the meaning is connected to “gold.”","zh":"在一些突厥语社群中出现的人名（名或姓）；含义与“黄金”相关。"},"examples":[{"en":"Altyn is used as a girl’s name in some families.","zh":"在一些家庭里，Altyn 被用作女孩名。"}]},{"partOfSpeech":"n.","definition":{"en":"a historical Russian coin (obsolete), traditionally worth a few kopeks.","zh":"历史上的俄国硬币名称（已废止），传统上价值为几戈比。"},"examples":[{"en":"In older Russian texts, you may see prices written in altyns.","zh":"在较早的俄语文本里，你可能会看到用 altyn 计价的价格。"}]}],"synonyms":["gold"],"phonetic":"/ælˈtɪn/","extraExplanation":["“Altyn/altın”源自突厥语词根，基本义就是“金/黄金”。因此它常被用来做商号、品牌或人名，表达“珍贵、闪耀、好运”的联想。","作为货币名的“altyn（阿尔廷）”出现在沙俄时期的货币体系与文献中；在现代语境里更常作为历史文化词汇出现。"]}

