{"word":"ALU","summary":{"en":"ALU most commonly means the arithmetic logic unit in a CPU; less commonly it can mean aluminum in technical labels.","zh":"ALU 最常指 CPU 中的算术逻辑单元；较少见时也可在技术标签中指铝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(computing) Abbreviation for “arithmetic logic unit,” the part of a CPU that performs basic calculations (like addition) and logical operations (like AND/OR, comparisons).","zh":"（计算机）“算术逻辑单元”的缩写，CPU 中负责进行基本算术运算（如加法）和逻辑运算（如与/或、比较）的部件。"},"examples":[{"en":"The ALU adds two numbers and sends the result to a register.","zh":"ALU 把两个数字相加，并把结果送到寄存器中。"},{"en":"Logical tests like “is this value zero?” are handled by the ALU.","zh":"像“这个值是否为零？”这样的逻辑判断由 ALU 处理。"}]},{"partOfSpeech":"n.","definition":{"en":"Abbreviation used in manufacturing or engineering for “aluminum” (less common; often seen on labels or specifications).","zh":"（较少见）在制造业或工程语境中用作“aluminum（铝）”的缩写，常见于标签或技术规格。"},"examples":[{"en":"This frame is made of ALU for light weight.","zh":"这个框架用 ALU（铝）制成，以减轻重量。"},{"en":"Check the spec sheet: ALU, 6061-T6.","zh":"查看规格表：ALU，6061-T6。"}]}],"synonyms":["arithmetic logic unit","arithmetic and logic unit"],"phonetic":"/ˌeɪ ɛl ˈjuː/","extraExplanation":["“ALU”通常按字母读作 /ˌeɪ ɛl ˈjuː/。在计算机体系结构里，ALU 是 CPU 的核心功能模块之一，但它通常不负责长期存储数据（那是寄存器/缓存/内存的工作）。","在材料领域把 aluminum 简写为“ALU”并非最标准写法，更常见的是写全 “aluminum” 或在化学中用元素符号 “Al”。阅读说明书时需要结合上下文判断。"]}
{"word":"alu","summary":{"en":"ALU most commonly means the arithmetic logic unit in a CPU; in some informal regional English, “alu” can also mean aluminum.","zh":"ALU 最常见指 CPU 的算术逻辑单元；在某些地区的非正式英语中，alu 也可指铝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Computing) The arithmetic logic unit: the part of a CPU that performs arithmetic (like addition) and logical operations (like AND/OR, comparisons).","zh":"（计算机）算术逻辑单元：CPU 中负责进行算术运算（如加法）和逻辑运算（如与/或、比较）的部分。"},"examples":[{"en":"The ALU adds numbers and also compares them to decide which is larger.","zh":"ALU 不仅能做加法，也能比较大小来判断哪个更大。"},{"en":"If the ALU is slow, many calculations in the CPU will be slower.","zh":"如果 ALU 较慢，CPU 里的许多计算也会变慢。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, mainly in some varieties of English) Short for “aluminum/aluminium,” especially in contexts like foil or cookware.","zh":"（非正式，主要见于某些英语变体）“aluminum/aluminium（铝）”的简称，常用于铝箔或炊具等语境。"},"examples":[{"en":"Wrap the leftovers in alu foil.","zh":"把剩菜用铝箔包起来。"},{"en":"This pot is made of alu, so it heats up quickly.","zh":"这个锅是铝做的，所以升温很快。"}]}],"synonyms":["arithmetic logic unit","processor unit (general)","aluminum (regional informal)"],"phonetic":"/ˌeɪˌɛlˈjuː/","extraExplanation":["在标准英文写作里，表示“算术逻辑单元”通常写作大写 **ALU**；口语里多读作字母音“A-L-U”。","表示“铝”的 **alu** 更偏口语/地区用法（在一些地区也会见到 **alu foil** 的说法）。在更正式或更通用的英语里，建议写 **aluminum foil**（美式）或 **aluminium foil**（英式）。","另外，在南亚语境中你可能见过 **alu/aloo** 表示“土豆”，但那是外来词用法，并非标准英语词条。"]}
{"word":"Alucitidae","summary":{"en":"Alucitidae: the moth family called many-plumed moths, with wings split into feathery plumes.","zh":"Alucitidae：多羽蛾科；翅膀分裂成羽毛状“羽片”的一类蛾。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of small moths known as many-plumed moths, whose wings are divided into several narrow feathery “plumes.”","zh":"一种蛾类的科名，常称为“多羽蛾（many-plumed moths）”；其翅膀分裂成多条狭长、羽毛状的“羽片”。"},"examples":[{"en":"Alucitidae are often called many-plumed moths because their wings look like feathers.","zh":"Alucitidae 常被称为多羽蛾，因为它们的翅膀看起来像羽毛。"},{"en":"A student photographed an Alucitidae moth resting on a leaf at night.","zh":"一名学生在夜间拍到一只 Alucitidae 的蛾停在叶子上。"}]}],"synonyms":["many-plumed moths","alucitid moths"],"phonetic":"/ˌæluːˈsɪtɪˌdiː/","extraExplanation":["“Alucitidae”是生物分类学里的“科”（family）名称，通常用于科研、自然观察记录或博物馆标本标签中；日常英语里更常用通俗名称 many-plumed moth(s)（多羽蛾）。","词形来自属名 Alucita（模式属）+ 动物分类常见的科级后缀 -idae（表示“……科”）。","多羽蛾的典型特征是翅分裂成多条羽状裂片，外观像小羽毛扇；因此在英文里常用“plume（羽饰/羽毛）”来描述。"]}
{"word":"Aluco","summary":{"en":"Aluco is a rare zoological term connected to owl taxonomy, most commonly seen in the scientific name Strix aluco (tawny owl).","zh":"Aluco 是一个很少见的动物学用语，与猫头鹰的分类命名有关，最常见于学名 Strix aluco（褐林鸮）中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology, rare) A kind of owl; especially used in older scientific writing as a genus name for some owls (now mainly treated under the genus Strix), and seen in the species name Strix aluco (“tawny owl”).","zh":"（动物学，少见）一种猫头鹰；尤其在较早的科学文献中曾用作某些猫头鹰的属名（现多归入鸮属 Strix），也常见于学名 Strix aluco（“褐林鸮/茶色林鸮”）中。"},"examples":[{"en":"The tawny owl’s scientific name is Strix aluco.","zh":"褐林鸮的学名是 Strix aluco。"},{"en":"In older taxonomy, “Aluco” appeared as a genus name for certain owls.","zh":"在较早的分类学中，“Aluco”曾作为某些猫头鹰的属名出现。"}]}],"synonyms":["owl","tawny owl","Strix aluco"],"phonetic":"/əˈluːkoʊ/","extraExplanation":["“Aluco”多源自拉丁语/新拉丁语，用于生物分类命名。现在日常英语里几乎不用它来指“猫头鹰”，更常见的是 owl（猫头鹰）或具体物种名 tawny owl（褐林鸮）。","如果你是在照片、标本标签或论文里看到“aluco”，它往往是学名的一部分（如 Strix aluco），而不是普通英语单词。"]}
{"word":"aluco","summary":{"en":"“Aluco” is mainly seen in scientific Latin (e.g., *Strix aluco*, the tawny owl), not as a common English word.","zh":"“aluco”主要见于科学拉丁语学名（如 *Strix aluco* 褐林鸮），不是常见英语词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Latin species name element used in scientific naming, best known from *Strix aluco* (“the tawny owl”). It is not a common everyday English word.","zh":"（拉丁语）用于生物学学名中的种加词，最常见于 *Strix aluco*（“褐林鸮/灰林鸮”，即 tawny owl）。它不是日常英语词汇。"},"examples":[{"en":"The tawny owl’s scientific name is *Strix aluco*.","zh":"褐林鸮的学名是 *Strix aluco*。"},{"en":"You’ll mostly see “aluco” in biology texts, not in normal conversation.","zh":"你多半会在生物学资料里看到“aluco”，而不是日常对话。"}]}],"synonyms":["tawny owl (in the context of *Strix aluco*)"],"phonetic":"/əˈluːkoʊ/","extraExplanation":["“aluco”通常出现在学名里（斜体书写），属于拉丁语体系；在英语中一般不会单独当作普通词来用。","如果你想查的是日常英文单词，可能是拼写接近的词（例如 *alcohol* 或某个姓名如 *Aluko*）。你可以告诉我你看到它的句子/语境，我可以帮你精确判断。"]}
{"word":"Aluconidae","summary":{"en":"Aluconidae is an uncommon taxonomy family name, often treated as a variant/misspelling of Alucitidae (many-plumed moths).","zh":"Aluconidae 是不太常见的“科”级学名拼写，常被视为 Alucitidae（多羽蛾科）的异拼/误拼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific family name (taxonomy), referring to a group of insects; in many modern sources this spelling is uncommon and is often treated as a misspelling or variant of Alucitidae (the many-plumed moths).","zh":"（生物分类）一个昆虫的“科”级学名；但在现代资料中这种拼写并不常见，常被视为 Alucitidae（多羽蛾科/多羽蛾）的误拼或异拼。"},"examples":[{"en":"In one older checklist, Aluconidae was listed as a family of small moths.","zh":"在某些较旧的名录里，Aluconidae 被列为一种小型蛾类的科名。"},{"en":"Many databases instead use the name Alucitidae for the many-plumed moths.","zh":"许多数据库则用 Alucitidae 来指“多羽蛾”。"}]}],"synonyms":["Alucitidae"],"phonetic":"/ˌæljuˈkɑːnɪdiː/","extraExplanation":["“-idae”是动物分类学里表示“科”的常见后缀（如 Felidae 猫科）。因此 Aluconidae 这种形式看起来像一个科名，但实际使用频率较低。","如果你是在论文、昆虫鉴定或物种名录中看到 Aluconidae，建议对照权威数据库（如 GBIF、ITIS、Catalogue of Life）确认是否应为 Alucitidae，避免引用到过时或非标准拼写。"]}
{"word":"aluconidae","summary":{"en":"Aulaconidae: a taxonomic family of parasitic wasps.","zh":"Aulaconidae：寄生蜂的一种分类“科”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of parasitic wasps (in the superfamily Evanioidea), found in various regions; they lay eggs in or on other insects.","zh":"（昆虫分类）一种寄生蜂的科（隶属胡蜂总科 Evanioidea），分布于多地；通常把卵产在其他昆虫体内或体表。"},"examples":[{"en":"Aulaconidae are parasitic wasps that develop inside other insects.","zh":"Aulaconidae（寄生蜂科）的幼虫会在其他昆虫体内发育。"},{"en":"The researcher recorded an Aulaconidae specimen during the forest survey.","zh":"研究人员在森林调查中记录到一只寄生蜂科（Aulaconidae）的标本。"}]}],"synonyms":["Aulaconidae (standard spelling)"],"phonetic":"/ˌɔːləˈkɑːnɪdiː/","extraExplanation":["你输入的 **aluconidae** 很可能是拼写误差；更常见、正式的拼法是 **Aulaconidae**（寄生蜂科）。在生物分类学里，科名通常以 **-idae** 结尾（表示“……科”）。","这类词多用于学术写作（昆虫学、生态学、分类学）。日常英语中很少使用；如果你是在论文或标本标签里看到它，建议核对原文大小写与拼写。"]}
{"word":"Aluconinae","summary":{"en":"Aluconinae is a Latin scientific name for a subfamily-level taxonomic group in zoology.","zh":"Aluconinae 是动物分类学中表示“亚科”层级的拉丁学名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific (Latin) name for a subfamily in animal taxonomy (rank: subfamily). It is used in biology to refer to a particular group of related organisms; the exact members and placement can vary depending on the classification system and updated research.","zh":"（拉丁学名）动物分类学中的“亚科”名称（等级：亚科）。在生物学中用来指一组有亲缘关系的生物；其具体包含哪些成员、隶属哪个科，可能会因不同分类系统与研究更新而变化。"},"examples":[{"en":"The paper revises the diagnosis of Aluconinae based on new morphological data.","zh":"该论文基于新的形态学数据修订了 Aluconinae（某亚科）的鉴别特征。"},{"en":"Species formerly placed in Aluconinae were transferred after a phylogenetic analysis.","zh":"系统发育分析后，原先归入 Aluconinae 的物种被重新转移到其他类群。"}]}],"synonyms":["(no true synonyms; it is a formal taxonomic name)"],"phonetic":"ˌæljuːkəˈnaɪniː","extraExplanation":["在动物分类学里，词尾 **-inae** 通常表示“亚科”（subfamily）。这类词多为拉丁化的学名，常见于论文、检索表、物种名录等语境。","由于学名可能存在拼写差异或分类更新（例如与相近拼写的类群混淆），如果你是在某篇文章或数据库里看到 *Aluconinae*，建议同时提供出处（链接/截图/上下文），我可以帮你核对它目前对应的具体类群与上级分类。"]}
{"word":"aluconinae","summary":{"en":"Aluconinae is a Latin scientific name used as a zoological subfamily label in taxonomy.","zh":"Aluconinae 是用于动物分类学中的拉丁学名，表示某个“亚科”的分类名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a scientific (Latin) taxonomic name for a subfamily of animals (often used in zoology/entomology for a group of insects such as moths), depending on the classification system.","zh":"一个拉丁学名，用作动物分类学中的“亚科”名称（常见于动物学/昆虫学中，指某一类昆虫如蛾类等的亚科；具体涵盖哪些物种取决于所采用的分类系统）。"},"examples":[{"en":"In the catalog, several species are listed under the subfamily Aluconinae.","zh":"在这本目录里，有几个物种被列在 Aluconinae 这个亚科之下。"},{"en":"The paper revises the placement of some genera that were once assigned to Aluconinae.","zh":"这篇论文重新修订了一些曾被归入 Aluconinae 的属的分类位置。"}]}],"synonyms":["(no common English synonyms; it is a taxonomic name)"],"phonetic":"/ˌæluːkɑːˈnaɪniː/","extraExplanation":["“Aluconinae”以 -inae 结尾，这是动物命名法规里常见的“亚科”词尾（例如：Formicinae 蚁亚科）。因此它更像是分类标签，而不是日常英语词汇。","这种拉丁学名在不同资料/年代可能出现拼写差异或分类变动；如果你是从论文或数据库看到的，建议同时提供上下文（所属科/属名或链接），我可以帮你确认它具体指哪一群生物。"]}
{"word":"aludel","summary":{"en":"An aludel is an old alchemical vessel used for heating substances to produce and collect vapors/crystals (sublimation).","zh":"aludel 指炼金术/早期化学中用于加热与升华、收集蒸气或晶体的器皿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of laboratory vessel (often an earthenware or glass pot) used in early chemistry/alchemy for heating and sublimation, typically set over a furnace so vapors could rise and condense","zh":"一种早期化学/炼金术使用的实验器皿（常为陶制或玻璃的罐/瓶），用于加热与升华，通常放在炉上使蒸气上升并冷凝"},"examples":[{"en":"In the old alchemy text, the powder was heated in an aludel to collect the crystals.","zh":"在那本古老的炼金术文献里，粉末被放在升华器（aludel）中加热，以收集结晶。"},{"en":"The museum displayed an aludel alongside other early laboratory tools.","zh":"博物馆把升华器（aludel）与其他早期实验工具一起展出。"}]}],"synonyms":["alembic (related distillation apparatus)","retort (related)","sublimation vessel"],"phonetic":"/ˈæl.jə.dəl/","extraExplanation":["这个词多见于炼金术/早期化学史的语境，现代实验室里不常用；阅读历史材料或博物馆说明牌时更可能遇到。","词源可追溯到阿拉伯语（常解释为带有“the-”定冠词的形式），反映了中世纪伊斯兰世界对炼金术与实验器具发展的重要影响。"]}
{"word":"aludels","summary":{"en":"“Aludels” is the plural of “aludel,” an old alchemical vessel used for sublimation.","zh":"“aludels”是“aludel”的复数，指炼金术/早期化学中用于升华操作的器具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a piece of alchemical or early chemical glassware (often a tall pot or tube with a fitted head) used for sublimation—heating a solid so it turns into vapor and then re-condenses as a solid on a cooler surface.","zh":"（炼金术或早期化学中的）一种玻璃器具（常为高筒状容器并配有上部“罩/盖”），用于“升华”操作——把固体加热成蒸气，再在较冷处重新凝结为固体。"},"examples":[{"en":"The manuscript describes collecting white crystals in an aludel during sublimation.","zh":"手稿描述了在升华过程中用 aludel 收集白色晶体。"},{"en":"Early chemists used aludels to purify substances by heating them gently.","zh":"早期化学家会用 aludel 通过温和加热来提纯物质。"}]}],"synonyms":["sublimation vessel","sublimation tube","alchemical apparatus"],"phonetic":"/ˈæl.jə.dɛl/","extraExplanation":["“aludels”是名词复数形式，单数是“aludel”。","该词多见于炼金术史、古代化学器具介绍或博物馆/古籍语境里；现代实验室通常用更标准的升华装置（如冷指、升华管等）来完成类似操作。","词源常被认为来自中世纪拉丁语，并与阿拉伯语来源有关（许多炼金术器具名称在欧洲语言中都带有阿拉伯语影响，例如以“al-”开头的外来词）。"]}
{"word":"Aludra","summary":{"en":"Aludra is the traditional name of a bright star in Canis Major (Eta Canis Majoris).","zh":"Aludra 是大犬座一颗明亮恒星的传统名称（大犬座η星）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Aludra: a bright star in the constellation Canis Major (also called Eta Canis Majoris), traditionally known as one of the “stars of the Greater Dog.”","zh":"Aludra：大犬座中的一颗明亮恒星（又称“大犬座η星”），传统上被认为是“大犬座”中的重要星体之一。"},"examples":[{"en":"On a clear winter night, you can spot Aludra in the constellation Canis Major.","zh":"在晴朗的冬夜里，你可以在大犬座中找到 Aludra。"},{"en":"The star Aludra is also listed in astronomy catalogs as Eta Canis Majoris.","zh":"在天文学星表中，Aludra 也常以“大犬座η星（Eta Canis Majoris）”标注。"}]}],"synonyms":["Eta Canis Majoris"],"phonetic":"/əˈluːdrə/","extraExplanation":["“Aludra”是恒星的专名，常见于天文、星座观测与科普语境中；在日常英语对话里并不常用。","它属于大犬座（Canis Major），同一星座中最著名的恒星是天狼星（Sirius）。学习时可把它当作“星名/专有名词”记忆。"]}
{"word":"aludra","summary":{"en":"Aludra is the proper name of a bright star (Eta Canis Majoris) in the constellation Canis Major.","zh":"Aludra 是大犬座中一颗明亮恒星（大犬座η）的专有名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a bright star in the constellation Canis Major (Eta Canis Majoris), used in astronomy and star charts.","zh":"（天文学）大犬座中的一颗明亮恒星（大犬座η，Eta Canis Majoris），常见于星图与天文资料中。"},"examples":[{"en":"Aludra is one of the stars that helps outline the shape of Canis Major in the night sky.","zh":"Aludra 是帮助勾勒夜空中“大犬座”形状的恒星之一。"},{"en":"The astronomer noted that Aludra is a massive, luminous star compared with the Sun.","zh":"天文学家指出，与太阳相比，Aludra 质量更大、光度更高。"}]}],"phonetic":"/əˈluːdrə/","extraExplanation":["“Aludra”常见于英文天文资料，是恒星的专有名词。它的名称来源于阿拉伯语传统星名体系（常被解释为与“少女/处女”有关的词根或称呼），因此在不同资料里可能会看到略有差异的词源说明。","在观星或阅读星图时，它通常以“Eta Canis Majoris（大犬座η）”的拜耳命名法标注；如果你在中文资料里查找，也可以用“大犬座η”来对照。"]}
{"word":"Aluin","summary":{"en":"“Aluin” is usually a misspelling of “Alduin,” a dragon character in Skyrim; it isn’t a standard English word.","zh":"“Aluin”通常是“Alduin”的误拼，指《上古卷轴5：天际》中的巨龙角色；它不是标准英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard spelling of the fantasy proper name “Alduin,” a dragon character from the video game The Elder Scrolls V: Skyrim (often called the “World-Eater”). In general English, “Aluin” is not a standard dictionary word.","zh":"“Alduin”的非标准拼写（常见于误拼）。“Alduin”是游戏《上古卷轴5：天际》（Skyrim）中的一条巨龙角色，常被称为“吞世者/世界吞噬者”。在一般英语中，“Aluin”并不是标准词典词汇。"},"examples":[{"en":"I think you mean Alduin—the main dragon in Skyrim, not “Aluin.”","zh":"我想你是指Alduin——《天际》里的主龙，不是“Aluin”。"},{"en":"Some posts spell it “Aluin,” but the official name is Alduin.","zh":"有些帖子会拼成“Aluin”，但官方名字是Alduin。"}]}],"synonyms":["Alduin (correct spelling)"],"phonetic":"/ˈɔl.duɪn/","extraExplanation":["“Alduin”这个名字来自《上古卷轴》系列设定，带有北欧/古英语风格的史诗感；玩家社区里常见到拼写错误或简写（比如把d漏掉写成Aluin）。","如果你是在找真实世界的人名/地名“Aluin”，请告诉我你看到它的上下文（句子、作品/游戏/国家），我可以更准确判断它指什么。"]}
{"word":"Aluino","summary":{"en":"“Aluino” is not a standard English word; it usually means “Arduino,” a popular open‑source electronics/microcontroller platform.","zh":"“Aluino”不是标准英语词；通常是指“Arduino”，一种流行的开源电子/微控制器平台。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A misspelling or nonstandard spelling that most often refers to “Arduino,” an open-source electronics platform (a small microcontroller board plus software) used for learning and building DIY projects.","zh":"一种拼写错误或非标准拼写，最常见是指“Arduino（阿尔杜伊诺）”——一个开源电子平台（小型微控制器开发板 + 软件），常用于学习与制作DIY项目。"},"examples":[{"en":"I think you meant Arduino, not Aluino.","zh":"我想你想写的是Arduino，不是Aluino。"},{"en":"She built a simple temperature sensor with an Arduino board.","zh":"她用Arduino开发板做了一个简单的温度传感器。"}]}],"synonyms":["Arduino board","microcontroller board","DIY electronics platform"],"phonetic":"ɑrˈdwiːnoʊ","extraExplanation":["“Aluino”在英语里不是常见词条或固定拼写。多数情况下，人们是在写“Arduino”。Arduino名称来自意大利一家酒吧（Bar di Re Arduino），因此读写上常被误拼。"]}
{"word":"alula","summary":{"en":"Alula is the small thumb-like part on a bird’s wing that helps it fly slowly and land safely.","zh":"Alula 指鸟翼上拇指状的“翅上小翼”，帮助低速飞行与安全降落。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small thumb-like structure on a bird’s wing (with a few feathers) that helps control airflow and prevents stalling at slow speeds, especially during landing.","zh":"鸟翼上拇指状的小结构（带有几根羽毛），可帮助控制气流、在低速飞行时防止失速，常在降落时发挥作用。"},"examples":[{"en":"You can sometimes see a hawk’s alula extended when it slows down to land.","zh":"鹰减速准备降落时，有时能看到它张开翅上小翼（alula）。"},{"en":"The alula acts a bit like a leading-edge flap on an airplane wing.","zh":"翅上小翼的作用有点像飞机机翼前缘的襟翼。"}]}],"synonyms":["bastard wing","wing thumb"],"phonetic":"/əˈluːlə/","extraExplanation":["词源来自拉丁语 alula，意为“小翅膀”。在鸟类学中它也常被称为“bastard wing”（旧称，字面不太友好；现代更常用中性词 alula）。","功能上，alula 在低速、较大迎角时能让气流更贴附机翼，从而提高升力、减少失速风险；对理解鸟类如何“慢飞”和精细操控很有帮助。"]}
{"word":"alula-related","summary":{"en":"Alula-related means associated with a bird’s alula (thumb-like feathers) used for low-speed flight control.","zh":"alula-related 指与鸟类副翼（像拇指的一小簇羽毛，用于低速飞行控制）相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with the alula, a small group of feathers on the front edge of a bird’s wing (like a “thumb”) that helps control airflow and slow-speed flight.","zh":"与鸟翼的副翼（翼前缘、像“拇指”的一小簇羽毛）有关的；副翼相关的。"},"examples":[{"en":"Alula-related feathers help birds land smoothly by improving control at low speed.","zh":"副翼相关的羽毛能通过改善低速控制，帮助鸟类更平稳地降落。"},{"en":"The paper analyzes alula-related structures in different raptor species.","zh":"这篇论文分析了不同猛禽物种的副翼相关结构。"}]}],"synonyms":["alular","pertaining to the alula"],"phonetic":"/əˈluːlə rɪˌleɪtɪd/","extraExplanation":["“alula”来自拉丁语，意为“小翅膀”。在鸟类飞行中，副翼能在低速或大迎角时减少气流分离，起到类似飞机前缘缝翼（slat）的作用，因此学术写作里常见“alula-related structures/feathers/movements”等搭配。"]}
{"word":"alulae","summary":{"en":"Alulae are the small “thumb” feathers on a bird’s wing that help with slow flight and landing.","zh":"Alulae 指鸟翼前缘拇指处的小簇羽毛，帮助鸟在低速飞行与降落时保持稳定与操控。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the small group of feathers attached to a bird’s “thumb” at the front edge of the wing (plural of alula); they help control airflow during slow flight and landing.","zh":"鸟翼前缘“拇指”位置的一小簇羽毛（alula 的复数）；有助于在低速飞行与降落时控制气流。"},"examples":[{"en":"When the hawk landed, its alulae lifted slightly to help it slow down.","zh":"鹰降落时，它的 alulae（拇指羽）微微抬起，帮助它减速。"},{"en":"Scientists study alulae to understand how birds avoid stalling at low speeds.","zh":"科学家研究 alulae，以了解鸟类如何在低速时避免失速。"},{"en":"In some close-up photos, the alulae look like a tiny extra wing near the wrist.","zh":"在一些特写照片里，alulae 看起来像手腕附近一片小小的“额外机翼”。"}]}],"synonyms":["thumb feathers","bastard wings","alulas"],"phonetic":"/əˈluːli/","extraExplanation":["“Alulae”是拉丁语复数形式（单数：alula）。在鸟类学里，alula 常被称为“bastard wing”（俗称“副翼/假翼”或“拇指羽”）。它的作用有点像飞机机翼的襟翼：在低速、起降或急转时打开，帮助维持升力并提高操控性。"]}
{"word":"alular","summary":{"en":"Alular means “related to a bird’s alula,” a small wing structure that helps with flight control.","zh":"Alular 指“与鸟类的翅小羽（alula）有关”，是一种帮助控制飞行气流的小翼结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the alula (a small set of feathers on a bird’s wing that helps control airflow).","zh":"与鸟翼的“翅小羽（alula）”有关的；翅小羽的。"},"examples":[{"en":"The alular feathers lift slightly when the bird slows down.","zh":"当鸟减速时，翅小羽会微微抬起。"},{"en":"Researchers studied alular motion to understand how birds avoid stalling in flight.","zh":"研究人员观察翅小羽的运动，以了解鸟类如何在飞行中避免失速。"}]}],"synonyms":["alula-related","bastard-wing (older term)"],"phonetic":"/ˈæljələr/","extraExplanation":["“Alula”常被称为鸟类的“前缘小翼”（有时也叫“bastard wing”，但这个说法较旧且不够正式）。翅小羽像飞机的前缘缝翼一样，在低速或着陆时帮助稳定气流、减少失速风险。","“Alular”属于较专业的动物学/鸟类学词汇，日常英语中不常见，多见于科普文章、学术论文或自然纪录片解说。"]}
{"word":"alulas","summary":{"en":"An alula is a small front-edge flap on a bird’s wing that helps with slow flight and landing.","zh":"Alula 指鸟翅前缘的小羽片（副翼/小翼），用于低速飞行与降落时控制气流、防止失速。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small thumb-like flap on the front edge of a bird’s wing that helps the bird control airflow and avoid stalling at low speeds (like during landing).","zh":"（鸟类翅膀的）副翼／小翼：位于翅膀前缘、像“拇指”一样的小羽片，帮助鸟在低速（如降落）时控制气流、避免失速。"},"examples":[{"en":"As the hawk landed, its alula stuck out to help it slow down smoothly.","zh":"鹰降落时副翼会伸出来，帮助它更平稳地减速。"},{"en":"Many birds use the alula when flying slowly through trees.","zh":"许多鸟在树林里低速飞行时会用到副翼。"}]}],"synonyms":["bastard wing","thumb wing"],"phonetic":"/əˈluːlə/","extraExplanation":["“Alula”来自拉丁语，意思是“小翅膀”。在鸟类学里它常被比作飞机机翼的前缘缝翼（slat），能在低速时增加升力、延缓失速。","复数形式既可用较学术的“alulae”，也常见口语/现代写法“alulas”。","另一个常见别称是“bastard wing”（旧称/传统术语），但在正式写作中通常更推荐用“alula”。"]}
{"word":"alulet","summary":{"en":"An amulet is a protective charm or object people believe can ward off harm or bad luck.","zh":"amulet 指人们相信可避邪保平安的护身符/护符。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small object (often a charm or piece of jewelry) believed to protect the wearer from harm, bad luck, or evil.","zh":"护身符；护符（常为小饰物或符咒，被认为能保护佩戴者免受伤害、厄运或邪恶）。"},"examples":[{"en":"She wore an amulet around her neck for protection.","zh":"她脖子上戴着护身符，求个平安。"},{"en":"In the story, the hero carries an amulet that keeps him safe.","zh":"在故事里，英雄带着一枚护符，使他免于危险。"}]}],"synonyms":["charm","talisman","lucky charm"],"phonetic":"/ˈæmjələt/","extraExplanation":["“alulet”不是常见英文单词，最常见的情况是把 **amulet** 拼错了（u 和 l 的位置容易看混）。","**amulet** 常见于民间传说、奇幻文学与一些宗教/民俗语境中，指“用来避邪、保平安”的小物件；不一定真的有神秘力量，多用于信仰或象征意义。","词源来自拉丁语 *amuletum*，表示“护身符、避邪物”。"]}
{"word":"Alulim","summary":{"en":"Alulim is a legendary first king in the Sumerian King List, associated with Eridu and an extremely long, mythical reign before the flood.","zh":"Alulim 是《苏美尔王表》中传说性的第一位国王，与埃里都相关，并被描写为在大洪水前拥有极其漫长、神话式的统治。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In ancient Mesopotamian tradition) the first king listed in the Sumerian King List, said to have ruled the city of Eridu for an impossibly long time before a great flood.","zh":"（古代美索不达米亚传说中）《苏美尔王表》记载的第一位国王，据说在大洪水之前统治埃里都（Eridu）并拥有极其夸张的在位年数。"},"examples":[{"en":"Alulim is often described as the first antediluvian king in the Sumerian King List.","zh":"Alulim 常被描述为《苏美尔王表》中大洪水之前的第一位国王。"},{"en":"In some retellings, Alulim ruled Eridu for tens of thousands of years, showing the mythical style of the text.","zh":"在一些转述中，Alulim 统治埃里都长达数万年，体现了这类文本的神话叙事风格。"}]}],"synonyms":["(no direct synonyms; proper name)"],"phonetic":"/ˈæljuˌlɪm/","extraExplanation":["“Alulim”更像是历史-神话传统中的人名（专名），而非日常英语词汇；在英文写作里通常直接当作专有名词使用。","他出现在《苏美尔王表》（Sumerian King List）中：该文献把王权描述为“从天而降”，并将早期君主的寿命/在位时间写得极端夸张，用来体现远古时代的神圣与传奇色彩。","常见相关说法：Alulim of Eridu（“埃里都的阿卢利姆”）、antediluvian kings（“大洪水前的诸王”）。"]}
{"word":"alulim","summary":{"en":"Alulim is a legendary pre-flood king of Eridu in ancient Sumerian tradition.","zh":"Alulim 是苏美尔传统中埃里都的传说性“大洪水之前”君王。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper name) A legendary antediluvian (pre-flood) king of Eridu in ancient Sumerian tradition, often listed as the first king in the Sumerian King List.","zh":"（专有名词）苏美尔古代传说中的“大洪水之前”的埃里都（Eridu）国王，常被《苏美尔王表》列为第一位国王。"},"examples":[{"en":"In the Sumerian King List, Alulim is named as the first king of Eridu.","zh":"在《苏美尔王表》中，Alulim 被称为埃里都的第一位国王。"},{"en":"Some introductions to Mesopotamian myth mention Alulim alongside other pre-flood rulers.","zh":"一些关于美索不达米亚神话的导论会把 Alulim 与其他“大洪水之前”的统治者一起提到。"}]}],"synonyms":["(related) Sumerian King List","(related) Eridu","(related) antediluvian kings"],"phonetic":"/ˈæluˌlɪm/","extraExplanation":["“Alulim”主要出现在《苏美尔王表》等文献传统中，属于神话—历史交界的“远古王”人物；王表给这些早期君王极其夸张的在位年数，用来强调其神圣与久远，而非现代意义上的可考史实。","中文里有时译作“阿鲁林/阿鲁利姆”，属于音译；不同书籍的拼写和译名可能略有差异。"]}
{"word":"alum","summary":{"en":"Alum most commonly means a chemical salt (potassium alum) used for pickling, baking, and water treatment; informally it can also mean an alumnus/alumna—a former student.","zh":"alum 常指“明矾/钾明矾”等盐类，用于腌制、烘焙和净水；在口语中也可指“校友/毕业生”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A type of salt (usually potassium alum) used in baking powder, pickling, water purification, and some medicines; it has an astringent (tightening/drying) effect.","zh":"（化学）一种盐（常指明矾/钾明矾），用于泡打粉、腌制、净水和部分药用；有收敛（使组织变紧、变干）作用。"},"examples":[{"en":"Some traditional pickles use alum to help keep the vegetables crisp.","zh":"一些传统腌菜会用明矾来帮助蔬菜保持脆爽。"},{"en":"The water plant adds alum to help small particles clump together and settle out.","zh":"自来水厂会加入明矾，让细小杂质凝聚沉淀。"},{"en":"This product contains alum, so avoid it if you are sensitive to astringents.","zh":"这款产品含有明矾；如果你对收敛剂敏感就要避免。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, especially in the U.S.) A former student or graduate of a school, college, or program.","zh":"（非正式，尤指美国）某所学校/学院/项目的校友、毕业生。"},"examples":[{"en":"She is an alum of Stanford University.","zh":"她是斯坦福大学的校友。"},{"en":"The program invites alums back to mentor current students.","zh":"这个项目会邀请校友回来指导在读学生。"}]}],"synonyms":["(chemical) potassium alum","(school) alumnus","alumna","graduate"],"phonetic":"/ˈæləm/","extraExplanation":["“alum”有两个常见来源与用法：\n1）化学意义的“明矾”来自拉丁语 alumen（“苦味盐/明矾”）。生活中常见于腌制、净水、某些止血或收敛用途。\n2）“校友”义来自 alumni/alumnae（alumnus 的复数，拉丁语意为“受养育的人”）。在美式英语里，口语中常用单数“an alum”指一个校友；更正式的写法仍常用 alumnus（男）、alumna（女）、alumni（复数/混合）、alumnae（女性复数）。\n\n注意：在个人护理用品中常见的 “alum” 有时指“potassium alum（钾明矾）”；而“aluminum（铝）/aluminium”是金属元素，拼写和意义不同。"]}
{"word":"alum-bearing","summary":{"en":"Alum-bearing means “containing alum,” used in geology or in contexts where alum is added to a material or solution.","zh":"alum-bearing意为“含明矾的”，可用于地质矿物语境，也可指加入明矾的材料或溶液。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing alum (a mineral salt), especially in natural deposits or rock; rich in alum.","zh":"含明矾（矿物盐）的；含有或富含明矾的（尤指矿床或岩石中）。"},"examples":[{"en":"The explorers noted alum-bearing rocks near the hot springs.","zh":"探险者在温泉附近发现了含明矾的岩石。"},{"en":"Alum-bearing shale can affect the local water chemistry when it weathers.","zh":"含明矾的页岩在风化时可能会影响当地水体的化学性质。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing a material or solution that has alum added, often for clarifying water or for dyeing and tanning in traditional processes.","zh":"（指材料或溶液）加入了明矾的；常用于澄清水、染色或鞣制等传统工艺。"},"examples":[{"en":"They treated the muddy water with an alum-bearing solution to help particles settle.","zh":"他们用含明矾的溶液处理浑水，帮助杂质沉降。"},{"en":"In some traditional dyeing methods, alum-bearing baths help the color bind to the fabric.","zh":"在一些传统染色方法中，含明矾的染浴能帮助颜色更好地附着在布料上。"}]}],"synonyms":["alum-containing","aluminous (context-dependent)","alum-rich"],"phonetic":"/əˈlʌm ˌbɛrɪŋ/","extraExplanation":["“alum-bearing”是由“alum（明矾）+ bearing（含有……的）”构成的复合形容词，常见于地质、矿产、环境与工艺语境。","这里的“bearing”表示“携带/含有/具有（某种成分）”，类似表达还有“ore-bearing（含矿的）”“water-bearing（含水的）”。"]}
{"word":"alum-like","summary":{"en":"“Alum-like” means resembling alum, often describing a dry, astringent, puckering feel or effect.","zh":"“alum-like”指“像明矾的”，常用来形容收敛、发涩、使口腔或皮肤发紧的感觉或效果。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling alum (a chemical salt, often aluminum sulfate), especially in having an astringent, drying, or puckering quality.","zh":"像明矾的；（尤指）有明矾那种收敛、发涩或使口腔发紧的感觉。"},"examples":[{"en":"The mouthwash left an alum-like taste that made my mouth feel dry.","zh":"这款漱口水留下了类似明矾的味道，让我觉得口腔很干。"},{"en":"The solution had an alum-like effect on the fabric, helping set the dye.","zh":"这种溶液对布料有类似明矾的作用，有助于固色。"}]}],"synonyms":["astringent","puckery","drying","alumish"],"phonetic":"/ˈæləm laɪk/","extraExplanation":["“alum”常指“明矾”，日常语境里多用来描述一种“收敛、发涩”的感觉（astringent）。因此“alum-like”通常不是在说味道“像某种香味”，而是强调那种让口腔或皮肤“紧、干、涩”的体验。","在纺织、染色或净水等场景中，alum 也可作为媒染剂或絮凝剂使用，所以“alum-like”有时也可指“具有类似明矾的化学/工艺效果”。"]}
{"word":"alum-related","summary":{"en":"“Alum-related” means related either to alum (the chemical) or, in informal use, to an alum (a former student).","zh":"“Alum-related”表示与“明矾（化学品）”有关，或在非正式用法中表示与“校友/毕业生（alum）”有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with alum (a chemical salt used in water treatment, dyeing, pickling, etc.).","zh":"与“明矾”（一种盐类化学物质，常用于净水、染色、腌制等）有关的。"},"examples":[{"en":"The report lists alum-related costs for drinking-water treatment.","zh":"报告列出了饮用水处理中与明矾相关的成本。"},{"en":"Some traditional recipes mention alum-related steps to keep vegetables crisp.","zh":"一些传统食谱提到与明矾相关的步骤，以保持蔬菜爽脆。"}]},{"partOfSpeech":"adj.","definition":{"en":"Connected with an alum (informal: a former student of a school or university).","zh":"与“校友/毕业生”（alum 的非正式说法）有关的。"},"examples":[{"en":"The newsletter highlights alum-related events happening in different cities.","zh":"通讯重点介绍了在不同城市举行的校友相关活动。"},{"en":"She works in alum-related outreach for the university’s career office.","zh":"她在大学就业办公室负责校友相关的对外联络工作。"}]}],"synonyms":["alum-based","alum-associated","alumni-related","alumni-focused"],"phonetic":"/ˈæləm rɪˌleɪtɪd/","extraExplanation":["“alum-related” 有时会引起歧义：alum 既可以指“明矾”（化学品），也可以是 alumnus/alumna 的非正式说法（校友/毕业生）。在学术、新闻或职场写作中，如果是“校友”含义，常更清晰地写成 alumni-related / alumni affairs；如果是化学含义，可写 aluminum sulfate–related 或 alum (chemical)–related 来避免误解。"]}
{"word":"Alumbank","summary":{"en":"Alumbank is mainly used as a proper place name (a locality/neighborhood), especially in Scotland.","zh":"Alumbank 主要作为地名使用（某个地区/社区名称），尤其常见于苏格兰。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a place name (proper noun), used for a local area or neighborhood—most notably Alumbank in/near Airdrie, North Lanarkshire, Scotland","zh":"地名（专有名词），用于指某个地区或社区名称——较常见的是苏格兰北拉纳克郡艾尔德里（Airdrie）附近的 Alumbank"},"examples":[{"en":"She grew up in Alumbank before moving to Glasgow.","zh":"她在 Alumbank 长大，后来搬去了格拉斯哥。"},{"en":"The bus route passes through Alumbank on the way to the town centre.","zh":"这条公交线路去市中心的路上会经过 Alumbank。"}]}],"phonetic":"/ˈæləmˌbæŋk/","extraExplanation":["“Alumbank”通常被当作一个整体的地名来使用，因此在句子中常见搭配是介词（in/from/to Alumbank）。如果你是在地图、地址或新闻里看到它，它更可能是指具体地点，而不是普通英语词汇。","从构词上看，它看起来像“alum（明矾）+ bank（河岸/堤/坡）”，但在现代使用中多作为地名固定下来；具体来源通常与当地历史或地貌有关。"]}
{"word":"alumbloom","summary":{"en":"Alumbloom is the white, powdery corrosion/oxidation that can appear on aluminum.","zh":"Alumbloom 指铝材表面出现的白色粉状氧化/腐蚀物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A whitish, chalky, powdery coating that forms on aluminum surfaces due to oxidation/corrosion (often seen on old aluminum parts exposed to moisture and air).","zh":"铝材表面因氧化/腐蚀而形成的白色、粉状、粉笔灰样的覆盖物（常见于受潮、长期暴露在空气中的旧铝件）。"},"examples":[{"en":"There’s alumbloom on the window frame, so the aluminum needs cleaning and sealing.","zh":"窗框上有铝白霜（粉化腐蚀物），所以需要清洁并做封闭保护。"},{"en":"The mechanic found alumbloom around the rivets where water had collected.","zh":"修理工发现铆钉周围积水的地方出现了铝白霜。"}]}],"synonyms":["aluminum oxidation","powdery corrosion","white corrosion"],"phonetic":"ˈæləmˌbluːm","extraExplanation":["“Alumbloom”多见于维修、五金、航空/船舶维护等语境，属于较专业的用法；日常英语里更常说“oxidation on aluminum”或“white powdery corrosion.”","它通常指铝的氧化/腐蚀产物造成的粉化外观；处理方式常包括刷洗/打磨、除氧化层、干燥并涂保护层（如密封剂或防腐涂层）。"]}
{"word":"alumbrado","summary":{"en":"Alumbrado is a Spanish word meaning public/street lighting or “lit, illuminated.”","zh":"alumbrado 是西语词，常指公共/路灯照明，也可表示“被照亮的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) street lighting; illumination provided by lamps, especially public lights.","zh":"（西语）路灯照明；（尤指）公共照明、街道照明。"},"examples":[{"en":"The city improved the alumbrado to make the streets safer at night.","zh":"这座城市改善了路灯照明，让夜晚街道更安全。"},{"en":"In many towns, alumbrado público is strongest around the main plaza.","zh":"在许多城镇，主广场周围的公共照明通常最亮。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Spanish, from the verb alumbrar) lit; illuminated (often used like an adjective, as a past participle).","zh":"（西语，源自动词 alumbrar）被照亮的；点亮的（常作过去分词/形容词用）。"},"examples":[{"en":"The hallway was alumbrado by a single lamp.","zh":"走廊被一盏灯照亮。"},{"en":"They walked along an alumbrado path.","zh":"他们沿着一条灯光照亮的小路行走。"}]}],"synonyms":["iluminación","alumbrado público","luz"],"phonetic":"/a.lumˈbɾa.ðo/","extraExplanation":["“alumbrado”在西语里常和“público（公共的）”搭配成“alumbrado público”，指城市的路灯系统/公共照明设施。","词根来自西语动词“alumbrar（照亮、启发）”。在一些语境中，它既可指“照明（名词）”，也可表示“被照亮的（形容词/过去分词）”。"]}
{"word":"Alumel","summary":{"en":"Alumel is a nickel-based alloy commonly used in thermocouples (especially Type K) to measure temperature.","zh":"Alumel是一种以镍为主的合金，常用于热电偶（尤其K型）测量温度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a nickel-based alloy (typically nickel with aluminum, manganese, and silicon) used as one of the wires in certain thermocouples (especially Type K), paired with Chromel to measure temperature.","zh":"一种以镍为主的合金（常含铝、锰、硅等），常用作热电偶（尤其是K型）的一根导线，与Chromel（铬镍合金）配对用于测温。"},"examples":[{"en":"Type K thermocouples use Chromel and Alumel to sense temperature across a wide range.","zh":"K型热电偶使用Chromel和Alumel来在较宽的温度范围内测量温度。"},{"en":"The technician replaced the damaged Alumel lead to fix the unstable readings.","zh":"技术员更换了损坏的Alumel引线，以修复不稳定的读数。"}]}],"synonyms":["nickel-based alloy","thermocouple alloy","Type K negative leg (Alumel)"],"phonetic":"/ˈæl.jəˌmɛl/","extraExplanation":["Alumel多见于工程、实验室与工业测温场景（如炉温监测）。它与Chromel组成的“K型热电偶”之所以常用，是因为成本相对适中、耐用、量程广，但在高温或某些腐蚀/还原气氛中仍可能出现漂移，需要校准或选择其他类型热电偶。","作为商标/商品名（historically a trade name），在技术语境中常被当作通用材料名来使用。"]}
{"word":"alumel","summary":{"en":"Alumel is a nickel-based alloy commonly used in thermocouples, especially Type K (paired with Chromel).","zh":"Alumel 是一种以镍为主的合金，常用于热电偶，尤其是与 Chromel 配对的 K 型热电偶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a nickel-based alloy (mainly nickel with aluminum, manganese, and silicon) used especially as one wire in thermocouples (often paired with Chromel in a Type K thermocouple).","zh":"一种以镍为主的合金（通常含铝、锰、硅等），主要用于热电偶材料，常与 Chromel（铬镍合金）配对组成 K 型热电偶的一根导线。"},"examples":[{"en":"This temperature probe uses a Type K thermocouple made of Chromel and Alumel.","zh":"这个温度探头使用的是由 Chromel 和 Alumel 组成的 K 型热电偶。"},{"en":"Engineers chose Alumel because it is stable over a wide range of temperatures.","zh":"工程师选择 Alumel 是因为它在很宽的温度范围内比较稳定。"}]}],"synonyms":["nickel-based alloy","thermocouple alloy"],"phonetic":"/ˈæl.jə.mɛl/","extraExplanation":["Alumel 是一个商品名（trade name），在技术资料里常直接用来指代“热电偶用的镍基合金”。","在 K 型热电偶中，Chromel 通常作正极线，Alumel 通常作负极线；两种金属接点产生的热电势会随温度变化，用于测温。"]}
{"word":"alumen","summary":{"en":"Alumen is an older/Latin-based word meaning alum (a salt used in dyeing, tanning, etc.). It is not the same as alumnus/alumni (“graduate”).","zh":"Alumen 是较旧/拉丁语来源的词，意思是“明矾”（用于染色、鞣革等的盐类）。它不同于 alumnus/alumni（校友/毕业生）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry, old or Latin-based term) alum; a group of salts used especially for tanning leather, dyeing, and sometimes in medicine.","zh":"（化学/较旧或拉丁语用法）明矾；一类盐，常用于鞣革、染色，有时也用于医药。"},"examples":[{"en":"In older chemistry texts, alumen often refers to alum used in dyeing fabrics.","zh":"在较早的化学教材中，alumen 常用来指用于染布的明矾。"},{"en":"Historically, alumen was valued for helping set colors in cloth.","zh":"历史上，alumen 因能帮助固色而受到重视。"}]}],"synonyms":["alum"],"phonetic":"/əˈluːmən/","extraExplanation":["alumen 主要来自拉丁语，常见于古典文献、较旧的科学写作或词源讨论中；现代英语里更常用 alum。","如果你想表达“校友”，正确拼写通常是 alumnus（男校友）、alumna（女校友）、alumni（复数，或泛指校友群体）。alumen 不是“校友”的意思。"]}
{"word":"alumetize","summary":{"en":"Alumetize means to coat or treat metal with aluminum to protect it, especially from heat or corrosion.","zh":"Alumetize 指对金属进行镀铝/渗铝处理，以起到保护作用，尤其用于耐热和防腐蚀。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to coat or treat (a metal surface) with aluminum, usually to improve heat resistance or prevent corrosion","zh":"（使金属表面）镀铝/渗铝处理，通常用于提高耐热性或防腐蚀"},"examples":[{"en":"The steel parts were alumetized to withstand high temperatures in the furnace.","zh":"这些钢制零件经过镀铝/渗铝处理，以承受炉内的高温。"},{"en":"Some exhaust components are alumetized to resist rust and oxidation.","zh":"一些排气系统部件会做镀铝/渗铝处理，以抗锈蚀和氧化。"}]}],"synonyms":["aluminize","aluminum-coat","metalize","coat with aluminum"],"phonetic":"əˈluːməˌtaɪz","extraExplanation":["“alumetize”在现代英语中非常少见，很多时候被当作“aluminize”的变体拼写或行业写法。更常见的标准拼写是“aluminize”。","工艺上可指“镀铝（铝涂层）”或“渗铝（aluminizing，一种热扩散处理）”。具体含义常要看材料工程/制造业语境。"]}
{"word":"alumian","summary":{"en":"“Alumian” is not a standard modern English word; it is usually a misspelling of “aluminum.”","zh":"“alumian”不是现代英语的规范词；通常是把“aluminum（铝）”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard spelling; most often a misspelling of “aluminum” (the light, silvery metal used in cans, foil, aircraft, etc.).","zh":"非标准拼写；最常见是把“aluminum（铝）”拼错了（用于易拉罐、铝箔、飞机等的轻质银白色金属）。"},"examples":[{"en":"I think you meant aluminum, not alumian.","zh":"我觉得你想写的是 aluminum（铝），不是 alumian。"},{"en":"This pan is made of aluminum.","zh":"这口锅是铝做的。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Very rare) Describing something related to “alum” (a chemical used historically in dyeing and tanning).","zh":"（非常少见）形容与“alum（明矾/矾）”有关的事物（历史上用于染色、鞣皮等）。"},"examples":[{"en":"In older texts, you may see alum-based solutions described with uncommon adjectives like “alumian.”","zh":"在较老的文本里，你可能会看到用一些不常见的形容词（如“alumian”）来描述以明矾为基础的溶液。"}]}],"synonyms":["aluminum","aluminium","alum (rare-related sense)"],"phonetic":"əˈluːmiən","extraExplanation":["“alumian”在现代英语里几乎不作为规范词使用。日常写作中，如果你指的是金属“铝”，美式英语常用拼写是 aluminum；英式英语常见拼写是 aluminium（多一个 i）。如果你愿意，可以告诉我你的句子语境，我可以帮你判断你想表达的是哪一个词。"]}
{"word":"alumic","summary":{"en":"Alumic is a rare adjective meaning “related to or containing alum.”","zh":"Alumic 是一个很少见的形容词，表示“与明矾有关的；含明矾的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Related to or containing alum (a type of mineral salt, often used in pickling and some industrial processes).","zh":"（罕见）与明矾有关的；含有明矾的（明矾是一种矿物盐，常用于腌制及一些工业用途）。"},"examples":[{"en":"The recipe mentioned an alumic solution to help keep the pickles crisp.","zh":"食谱提到用含明矾的溶液来帮助腌菜保持爽脆。"},{"en":"Some older texts describe alumic compounds used in dyeing fabrics.","zh":"一些较早的文献会描述用于染布的含明矾化合物。"}]}],"synonyms":["aluminous","of alum","alum-related"],"phonetic":"əˈluːmɪk","extraExplanation":["“alumic”在现代英语里非常少见，更常见的说法是“alum (n.)”（明矾）或“aluminous (adj.)”（含明矾/含铝的，语境不同）。日常表达中你几乎不会看到“alumic”。","注意不要和“aluminum / aluminium（铝）”混淆：alum 指“明矾”（一种盐类），而 aluminum 指金属“铝”。两者有关联但不是同一个东西。"]}
{"word":"alumiferous","summary":{"en":"Alumiferous means containing or yielding alum, usually used in geology or mining contexts.","zh":"alumiferous 意为“含有/产出明矾的”，多用于地质或采矿语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing or producing alum (a mineral salt, often used in dyeing, tanning, and water treatment).","zh":"含有或产出明矾（常用于染色、鞣革和净水的矿物盐）。"},"examples":[{"en":"The report described an alumiferous deposit in the surrounding hills.","zh":"报告描述了周围山丘中一处含明矾的矿床。"},{"en":"Historically, alumiferous rocks were mined to supply alum for the textile industry.","zh":"历史上，人们开采含明矾的岩石，为纺织业提供明矾。"}]}],"synonyms":["alum-bearing","aluminous (sometimes, context-dependent)"],"phonetic":"/əˌluːˈmɪfərəs/","extraExplanation":["“alumiferous”由“alum（明矾）+ -ferous（含有/携带）”构成，类似结构的词还有“auriferous（含金的）”“carboniferous（含碳的）”。多用于地质、采矿或工业材料语境，日常英语中很少见。"]}
{"word":"alumin","summary":{"en":"Alumin is an uncommon/older term used for alum, and it can also appear as a word part meaning “related to aluminum.”","zh":"Alumin 是较少见/较旧的用法，常指明矾（alum）；也可作构词成分，表示“与铝相关”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance like alum (a type of salt), used especially in older or technical writing","zh":"（较旧或专业用法）明矾（一类盐），常用于加工或化学语境"},"examples":[{"en":"In older recipes, alumin was used to help fix dyes onto cloth.","zh":"在较旧的配方里，alumin 会用来帮助染料固定在布料上。"},{"en":"The text mentions alumin as a chemical used in treating hides.","zh":"这篇文章提到 alumin 是用于处理皮革的一种化学品。"}]},{"partOfSpeech":"other","definition":{"en":"(as a word part) relating to aluminum or aluminum compounds","zh":"（作词根/构词成分）与铝或铝的化合物有关"},"examples":[{"en":"You may see alumin- in scientific words about aluminum materials.","zh":"你可能会在与铝材料相关的科学词汇中看到 alumin- 这个词根。"},{"en":"Alumin compounds are discussed in the chapter on metals.","zh":"关于金属的章节里讨论了铝的化合物。"}]}],"synonyms":["alum","(related) aluminum","alumina"],"phonetic":"/ˈæljəmɪn/","extraExplanation":["“alumin”在现代日常英语里不算常用词，常见的是 **alum（明矾）**、**aluminum（铝，美式）/ aluminium（铝，英式）**、以及 **alumina（氧化铝）**。你如果是想查“铝”或“明矾”，告诉我使用场景（化学/日常/材料），我可以给最合适的词。"]}
{"word":"alumina","summary":{"en":"Alumina is aluminum oxide (Al₂O₃), widely used in making aluminum and in ceramics and industrial materials.","zh":"Alumina 指氧化铝（Al₂O₃），广泛用于冶炼铝以及陶瓷等工业材料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A white powder made of aluminum oxide (Al₂O₃), used to produce aluminum metal and to make ceramics, abrasives, and catalysts.","zh":"氧化铝（Al₂O₃），一种白色粉末，用于冶炼金属铝，也用于制造陶瓷、磨料和催化剂。"},"examples":[{"en":"Most aluminum is produced from bauxite, which is refined into alumina first.","zh":"大多数铝是从铝土矿生产的，而铝土矿会先被提炼成氧化铝。"},{"en":"The engineer chose alumina ceramics because they handle heat well.","zh":"工程师选择氧化铝陶瓷，因为它很耐高温。"}]}],"synonyms":["aluminum oxide","Al2O3"],"phonetic":"/əˈluːmɪnə/","extraExplanation":["“alumina”在日常语境里常与工业和材料科学相关，最常见的搭配是“refine bauxite into alumina（将铝土矿提炼成氧化铝）”和“alumina ceramics（氧化铝陶瓷）”。","词源上与“alum（明矾）”同源，但现代英语中的“alumina”特指氧化铝，而不是明矾或铝盐。"]}
{"word":"alumina-free","summary":{"en":"“Alumina-free” means containing no alumina (aluminum oxide).","zh":"“alumina-free”指“不含氧化铝（氧化铝为Al₂O₃）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing no alumina (aluminum oxide, Al₂O₃).","zh":"不含氧化铝（Al₂O₃）的；无氧化铝的。"},"examples":[{"en":"The manufacturer developed an alumina-free ceramic to avoid reactions at high temperatures.","zh":"厂家开发了一种无氧化铝陶瓷，以避免高温下发生反应。"},{"en":"For this process, use an alumina-free crucible to reduce contamination.","zh":"在这个工艺中，使用不含氧化铝的坩埚以减少污染。"}]}],"synonyms":["free of alumina","alumina-less","aluminum-oxide-free"],"phonetic":"əˈluːmɪnə friː","extraExplanation":["“alumina”在材料与化工语境里通常指“氧化铝（Al₂O₃）”，常见于陶瓷、耐火材料、催化剂载体、研磨材料等。标注为“alumina-free”一般意味着该配方/部件的主要成分或可检出的杂质中不包含氧化铝，以满足耐腐蚀、纯度、反应相容性或特定电/热性能的要求。","这是一个合成形容词，常用连字符（alumina-free）出现在产品规格、实验方法和技术文件中；也可写作“alumina free”（较不正式）。"]}
{"word":"alumina-rich","summary":{"en":"Alumina-rich means having a high content of alumina (aluminum oxide).","zh":"alumina-rich 指“氧化铝含量高、富含氧化铝的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing a high amount of alumina (aluminum oxide, Al₂O₃).","zh":"富含氧化铝（Al₂O₃）的；含氧化铝量高的。"},"examples":[{"en":"Alumina-rich clay is often used to make heat-resistant ceramics.","zh":"富含氧化铝的黏土常用于制造耐高温陶瓷。"},{"en":"The lab tested several alumina-rich samples to see how they behaved at high temperatures.","zh":"实验室检测了几种高氧化铝含量的样品，观察它们在高温下的表现。"},{"en":"Engineers chose an alumina-rich refractory lining to protect the furnace walls.","zh":"工程师选用了富含氧化铝的耐火衬里来保护炉壁。"}]}],"synonyms":["high-alumina","alumina-containing","Al2O3-rich"],"phonetic":"əˈluːmɪnə rɪtʃ","extraExplanation":["“alumina-rich”常见于材料科学、地质与工业语境（如陶瓷、耐火材料、矿石成分分析）。其中 rich 表示“在某种成分上含量高”，常与成分连用：silica-rich（富硅）、iron-rich（富铁）。","alumina（氧化铝）与 aluminum（金属铝）不同：alumina 是稳定的氧化物，常用于耐火、耐磨、绝缘等材料。"]}
{"word":"aluminaphone","summary":{"en":"An aluminaphone is a mallet percussion instrument with tuned aluminum bars, similar to a xylophone.","zh":"aluminaphone 指一种用槌敲击的打击乐器，由调音后的铝条组成，类似木琴/钟琴。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a percussion instrument like a xylophone or glockenspiel, with tuned aluminum bars that you strike with mallets","zh":"一种打击乐器，外形类似木琴/钟琴，由调音后的铝条组成，用槌敲击发声"},"examples":[{"en":"The music teacher brought an aluminaphone to demonstrate bright, bell-like tones.","zh":"音乐老师带来一台铝琴，示范那种明亮、像铃声一样的音色。"},{"en":"In the percussion section, the aluminaphone covered the higher notes with a clear metallic sound.","zh":"在打击乐声部里，铝琴用清晰的金属音色负责较高的音。"}]}],"synonyms":["metallophone","glockenspiel","xylophone (similar type)"],"phonetic":"/əˈluːməˌfoʊn/","extraExplanation":["“aluminaphone”并不是日常英语里很常见的词，更常见的相关说法包括：用“aluminum xylophone（铝制木琴）”、或直接称某些类似音色与结构的乐器为“glockenspiel（钟琴）/metallophone（金属琴）”。","词形可以拆开理解：alumina/aluminum（氧化铝/铝）+ -phone（“声音、发声器”的后缀，如 telephone）。因此它直观表达“用铝制部件发声的乐器”。","在不同学校乐队/打击乐编制中，这类乐器的名称可能因品牌、地区或教学传统而不同；遇到不确定时，可用“a xylophone-like aluminum-bar percussion instrument（类似木琴、带铝条的打击乐器）”来解释给他人。"]}
{"word":"aluminas","summary":{"en":"“Aluminas” is the plural of “alumina,” meaning aluminum oxide (Al₂O₃), widely used in industry and materials.","zh":"“Aluminas”是“alumina”的复数，指氧化铝（Al₂O₃），广泛用于工业与材料领域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of “alumina”: aluminum oxide (Al₂O₃), a white, hard substance used in making aluminum metal, ceramics, abrasives, and catalysts","zh":"“alumina”的复数：氧化铝（Al₂O₃），一种白色、坚硬的物质，用于生产金属铝、陶瓷、研磨材料和催化剂等"},"examples":[{"en":"Different grades of aluminas are used to make advanced ceramics.","zh":"不同等级的氧化铝用于制造先进陶瓷。"},{"en":"The factory stores aluminas in sealed containers to keep them dry and free of contamination.","zh":"工厂将氧化铝储存在密封容器中，以保持干燥并避免污染。"},{"en":"Some catalysts use aluminas as a support material.","zh":"有些催化剂以氧化铝作为载体材料。"}]}],"synonyms":["aluminum oxide","aluminium oxide","Al2O3"],"phonetic":"/əˈluːmɪnəz/","extraExplanation":["“alumina”在工业和材料科学中非常常见，常指用于冶炼金属铝的原料（通常来自铝土矿 bauxite，经拜耳法 Bayer process 制得）。","日常英语里更常见的是单数“alumina”。“aluminas”多出现在技术写作中，用来区分不同类型/等级的氧化铝（如活性氧化铝 activated alumina、α-氧化铝等）。","易混淆点：alumina（氧化铝）≠ aluminum（铝，金属）；也不同于 alum（明矾，一类含铝的盐）。"]}
{"word":"aluminate","summary":{"en":"An aluminate is a chemical compound/ion containing aluminum and oxygen; as a verb, it means to form or convert into an aluminate (technical usage).","zh":"aluminate 指含铝与氧的铝酸盐（化合物/离子）；作动词时表示“形成或转化为铝酸盐”（偏专业用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (salt or ion) that contains aluminum and oxygen, often written as AlO₂⁻ or related forms; aluminates are common in cement, ceramics, and water treatment chemistry.","zh":"铝酸盐；含铝与氧的化合物（盐或离子），常写作 AlO₂⁻ 等形式；常见于水泥、陶瓷与水处理化学中。"},"examples":[{"en":"Portland cement contains calcium aluminate phases that react quickly with water.","zh":"普通硅酸盐水泥含有铝酸钙相，会与水快速反应。"},{"en":"In strongly basic solution, aluminum can form aluminate ions.","zh":"在强碱溶液中，铝可以形成铝酸根离子。"}]},{"partOfSpeech":"v.","definition":{"en":"to convert something into an aluminate, or to form aluminate compounds (used mainly in chemistry/materials contexts).","zh":"使形成铝酸盐；将某物转化为铝酸盐（多用于化学/材料学语境）。"},"examples":[{"en":"Under alkaline conditions, dissolved aluminum may aluminate and stay in solution.","zh":"在碱性条件下，溶解的铝可能会形成铝酸盐并保持在溶液中。"},{"en":"The process can be used to aluminate the mixture before firing the ceramic.","zh":"该过程可用于在烧制陶瓷前使混合物生成铝酸盐。"}]}],"synonyms":["aluminum salt (context-dependent)","aluminate ion (technical)","sodium aluminate (specific example)"],"phonetic":"/əˈluːməˌneɪt/","extraExplanation":["“aluminate”常见于科学与工程文本（如水泥化学、无机化学、材料科学）。在日常英语里很少用，更多会看到具体名称，如“calcium aluminate（铝酸钙）”、“sodium aluminate（偏铝酸钠）”。","词形提示：-ate 结尾的化学名词常表示“某种盐/酯”（如 sulfate 硫酸盐、nitrate 硝酸盐），因此 aluminate 通常可理解为“与 aluminum（铝）相关的某种盐”。"]}
{"word":"alumine","summary":{"en":"Alumine is a less common word for alumina: aluminum oxide used in aluminum production and ceramics.","zh":"Alumine是较少见的说法，通常指alumina（氧化铝），常用于制铝与陶瓷等领域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a white powdery substance; aluminum oxide (Al₂O₃), used in making aluminum metal, ceramics, abrasives, and as a material for gemstones like sapphire and ruby","zh":"一种白色粉末状物质；氧化铝（Al₂O₃），用于制铝、陶瓷、磨料，也与蓝宝石、红宝石等宝石材料有关"},"examples":[{"en":"Bauxite is refined to produce alumine (alumina), which is then used to make aluminum.","zh":"铝土矿经过提炼可得到alumine（氧化铝/铝矾土熟料），随后用于生产金属铝。"},{"en":"In ceramics, alumine improves hardness and heat resistance.","zh":"在陶瓷中，alumine能提高硬度和耐热性。"}]}],"synonyms":["alumina","aluminum oxide"],"phonetic":"/ˈæljəˌmin/","extraExplanation":["“alumine”在现代英语中比较少见，更常用的词是“alumina”（氧化铝）。在一些较旧的科技文献、或受法语影响的写法中可能会看到“alumine”。","不要把“alumine / alumina（氧化铝）”和“alum（明矾）”混淆：alum通常指含硫酸根的盐类（如硫酸铝钾），用途和化学成分都不同。"]}
{"word":"alumines","summary":{"en":"“Alumines” is a rare form meaning types/amounts of alumina (aluminum oxide). In modern English, “alumina” (or sometimes “aluminas”) is much more common.","zh":"“alumines”较少见，意思是氧化铝（alumina）的复数/不同种类。在现代英语中更常用“alumina”（有时用复数“aluminas”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural form of (rare) alumine: aluminum oxide (also called alumina), a white powder used in making aluminum metal, ceramics, and abrasives.","zh":"（罕见）alumine 的复数：氧化铝（也叫 alumina），一种白色粉末，用于生产铝金属、陶瓷和研磨材料。"},"examples":[{"en":"The refinery produces alumines (alumina) that will later be smelted into aluminum.","zh":"这家精炼厂生产氧化铝（alumina），之后会被冶炼成铝。"},{"en":"High-purity alumines are used in advanced ceramics.","zh":"高纯度氧化铝用于先进陶瓷材料。"}]}],"synonyms":["alumina","aluminum oxide"],"phonetic":"/əˈluːmɪnə/","extraExplanation":["“alumines”在现代英语里很少见。更常用的词是“alumina”（不可数名词，用于指氧化铝这种材料），如果要强调不同种类或不同来源的氧化铝，有时也会用复数“aluminas”。","如果你是在化学/材料语境中看到“alumines”，很可能是把“alumina(s)”拼写成了“alumines”，或是从法语“alumine”影响而来的写法。"]}
{"word":"aluminic","summary":{"en":"Aluminic means “related to or made of aluminum,” and sometimes “containing aluminum” in technical use.","zh":"aluminic 指“与铝有关/由铝制成”，技术语境中也可指“含铝的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to aluminum; made of aluminum.","zh":"与铝有关的；由铝制成的。"},"examples":[{"en":"The bike has an aluminic frame, so it’s light and easy to carry.","zh":"这辆自行车有铝制车架，所以很轻，容易搬动。"},{"en":"Aluminic parts are common in airplanes because they are strong but not too heavy.","zh":"飞机上常见铝制零件，因为它们结实但不太重。"}]},{"partOfSpeech":"adj.","definition":{"en":"Containing aluminum (used mainly in scientific/technical contexts).","zh":"含铝的（多用于科学或技术语境）。"},"examples":[{"en":"The lab tested the soil and found it had aluminic compounds.","zh":"实验室检测了土壤，发现其中含有铝化合物。"},{"en":"Some minerals form aluminic salts under certain conditions.","zh":"在某些条件下，一些矿物会形成含铝盐。"}]}],"synonyms":["aluminum","aluminum-based","aluminum alloy","aluminous"],"phonetic":"/ˌæljuˈmɪnɪk/","extraExplanation":["“aluminic”在现代英语中相对少见，更常见、更自然的表达是“aluminum (adj.) / aluminum-based / aluminum alloy”。在写作或口语中，如果不是技术论文，一般用这些更常见的说法会更地道。","拼写提示：美式常用“aluminum”，英式常用“aluminium”。“aluminic”是由该词根派生出来的形容词形式。"]}
{"word":"aluminide","summary":{"en":"An aluminide is a compound of aluminum with another element, often used for high-temperature, protective, or corrosion-resistant materials.","zh":"aluminide 指铝与其他元素形成的化合物（常为金属间化合物），多用于耐高温、耐氧化或耐腐蚀材料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (often an intermetallic compound) made from aluminum and another element, especially a metal, used in high-temperature or corrosion-resistant materials","zh":"铝化物：由铝与另一种元素（尤指金属）形成的化合物（常为金属间化合物），常用于耐高温或耐腐蚀材料"},"examples":[{"en":"Nickel aluminide is used in some high-temperature engine parts.","zh":"镍铝化物用于一些耐高温的发动机部件。"},{"en":"Researchers tested an aluminide coating to protect the steel from oxidation.","zh":"研究人员测试了一种铝化物涂层来保护钢材免受氧化。"}]}],"synonyms":["aluminum intermetallic","intermetallic compound (of aluminum)","aluminide compound"],"phonetic":"/əˈluːməˌnaɪd/","extraExplanation":["“aluminide”常见于材料科学与工程语境，尤其是航空航天与燃气涡轮领域。许多铝化物属于“金属间化合物”（intermetallics），通常具有高熔点、较好的抗氧化性，但可能相对更脆，需要通过合金设计或复合材料方式改进韧性。"]}
{"word":"aluminiferous","summary":{"en":"Aluminiferous means “containing or producing aluminum,” usually describing ores, rocks, or soils.","zh":"aluminiferous 指“含铝的/产铝的”，多用于矿石、岩石或土壤等专业语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing or producing aluminum, or rich in aluminum (often used of rocks, soils, or ores).","zh":"含铝的；产铝的；富含铝的（常用于描述岩石、土壤或矿石）。"},"examples":[{"en":"Bauxite is an aluminiferous ore and the main source of aluminum.","zh":"铝土矿是一种含铝矿石，也是铝的主要来源。"},{"en":"The region has aluminiferous clays that can be used in industrial processes.","zh":"该地区有富含铝的黏土，可用于工业加工。"}]}],"synonyms":["aluminum-bearing","aluminous"],"phonetic":"/əˌluːməˈnɪfərəs/","extraExplanation":["词源提示：aluminum + -ferous（“含有……的 / 产生……的”，如 carboniferous“含碳的”、aquiferous“含水的”）。因此 aluminiferous 多见于地质、矿业和材料学语境，属于较正式、专业的形容词。","易混提示：aluminiferous（含铝的）不同于 aluminum（名词“铝”）以及 aluminous（也可表示“含铝的/像明矾的”，但更少见，语感更偏化学或古旧用法）。"]}
{"word":"aluminiform","summary":{"en":"Aluminiform means “aluminum-like in form or appearance,” often describing a silvery, metallic look.","zh":"aluminiform 指“外观或形状像铝的”，常用来形容银灰、金属质感的外观。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the form or appearance of aluminum; silvery or aluminum-like in color or look.","zh":"呈铝的形状或外观的；外观似铝的；呈银灰色、像铝一样的。"},"examples":[{"en":"The mineral has an aluminiform sheen that reflects light like metal.","zh":"这种矿物有一种铝样的光泽，像金属一样反光。"},{"en":"The designer chose an aluminiform finish for a clean, modern look.","zh":"设计师选用了铝样表面处理，以呈现干净、现代的风格。"}]}],"synonyms":["aluminum-like","silvery","metallic","aluminum-colored"],"phonetic":"/əˈluːməˌnɪfɔrm/","extraExplanation":["这是一个较少见的形容词，常见于技术写作或描述材料外观的语境。","词形上可以理解为 aluminum（铝）/ alumini-（铝的） + -form（……形状的），类似的构词还有 *cruciform*（十字形的）、*waveform*（波形的）。","日常英语里更常用的表达是 *aluminum-like*, *silvery*, *metallic* 或 *aluminum-colored*。"]}
{"word":"aluminio","summary":{"en":"Aluminum is a light, silvery metal widely used in everyday products.","zh":"Aluminum 指“铝”，一种轻质的银白色金属，广泛用于日常用品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a light, silvery metal used to make things like cans, foil, airplane parts, and window frames; chemical symbol Al","zh":"铝；一种轻质的银白色金属，常用于制作易拉罐、铝箔、飞机部件和窗框等；化学符号 Al"},"examples":[{"en":"This can is made of aluminum.","zh":"这个易拉罐是用铝做的。"},{"en":"Wrap the food in aluminum foil to keep it fresh.","zh":"用铝箔把食物包起来保鲜。"},{"en":"Aluminum is lightweight but strong.","zh":"铝很轻，但很坚固。"}]}],"synonyms":["Al (symbol)"],"phonetic":"/əˈluːmənəm/","extraExplanation":["“aluminio”是西班牙语，对应英语常用词是 **aluminum**（美式拼写与读音）。英式英语更常写作 **aluminium**，多了一个字母 i，读音也略不同。"]}
{"word":"aluminisation","summary":{"en":"Aluminisation means coating something with aluminum, mainly for heat and corrosion protection.","zh":"Aluminisation 指给材料镀铝/铝化，主要用于耐热与防腐保护。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of coating a material (especially steel or iron) with aluminum, usually to protect it from heat or corrosion","zh":"铝化；镀铝（指在材料，尤其是钢或铁表面覆盖一层铝，通常用于耐热或防腐）"},"examples":[{"en":"Aluminisation is used to protect steel parts that operate at high temperatures.","zh":"铝化工艺常用于保护在高温下工作的钢制零件。"},{"en":"The plant added an aluminisation step to improve corrosion resistance.","zh":"工厂增加了镀铝这一步，以提高耐腐蚀性。"}]}],"synonyms":["aluminization","aluminum coating","aluminium coating","aluminizing"],"phonetic":"/əˌluːmənaɪˈzeɪʃən/","extraExplanation":["“aluminisation”是英式拼写；美式更常见拼写是“aluminization”。两者意思相同。","常见于工程与材料科学语境，和“galvanization（镀锌）”类似，都是通过表面涂层来提升耐腐蚀/耐高温等性能。"]}
{"word":"aluminise","summary":{"en":"To coat or treat something with aluminum for protection (especially against heat or corrosion).","zh":"给物体进行镀铝/渗铝等处理以保护（尤其防腐或耐高温）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to coat or treat (a metal or surface) with aluminum, usually to protect it from heat or corrosion","zh":"给（金属或表面）镀铝/喷铝或进行渗铝处理，通常用于防腐或耐高温"},"examples":[{"en":"The steel parts were aluminised to resist rust and high temperatures.","zh":"这些钢制零件经过镀铝处理，以防锈并耐高温。"},{"en":"Some exhaust components are aluminised for extra protection.","zh":"有些排气系统部件会进行镀铝处理以加强防护。"}]}],"synonyms":["aluminize","coat with aluminum","aluminum-coat","metalize"],"phonetic":"əˈluːməˌnaɪz","extraExplanation":["“aluminise”更常见于英式拼写；美式拼写通常是“aluminize”。两者意思相同，技术语境里常用于金属加工与工程材料。","在工业语境中，“aluminise”可能指不同工艺（如喷铝、热浸镀铝、渗铝/扩散镀等）。具体是哪一种，需要看上下文或工艺说明。"]}
{"word":"aluminised","summary":{"en":"Aluminised means coated or treated with a thin layer of aluminum (UK spelling of aluminized).","zh":"aluminised 指“经铝化处理的、覆有一层薄铝的”（美式拼写为 aluminized）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(UK spelling) coated or treated with a thin layer of aluminum to protect from heat, corrosion, or wear.","zh":"（英式拼写）经铝化处理的；表面镀/涂了一层薄铝，用于防热、防腐蚀或耐磨。"},"examples":[{"en":"Aluminised fabric is used in protective clothing for firefighters.","zh":"铝化织物常用于消防员的防护服。"},{"en":"The pipe has an aluminised surface to reduce corrosion.","zh":"这根管道表面做了铝化处理，以减少腐蚀。"}]},{"partOfSpeech":"v.","definition":{"en":"(Past tense/past participle of “aluminise”) to coat or treat with aluminum.","zh":"（动词 aluminise 的过去式/过去分词）使铝化；用铝进行涂覆或处理。"},"examples":[{"en":"The manufacturer aluminised the steel sheet for better heat resistance.","zh":"厂家对钢板进行了铝化处理，以提高耐热性。"}]}],"synonyms":["aluminum-coated","aluminized","metal-coated"],"phonetic":"/əˈluːməˌnaɪzd/","extraExplanation":["“aluminised”更常见于英式英语；美式英语通常写作“aluminized”。两者含义相同。","在材料与工程语境中，aluminised 常指“铝涂层/铝镀层”或“扩散渗铝（aluminizing）”等表面处理，用于提升耐腐蚀、耐高温或反射热辐射的能力。"]}
{"word":"aluminish","summary":{"en":"“Aluminish” is an informal way to say “somewhat like aluminum,” especially in color or appearance.","zh":"“aluminish”多为非正式用法，表示“有点像铝的”，尤其指颜色或外观像铝。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Somewhat like aluminum in color, look, or feel; aluminum-like.","zh":"（非正式）有点像铝的；呈铝质外观的（颜色、质感或感觉像铝）。"},"examples":[{"en":"The paint dries to an aluminish silver that looks metallic in the sun.","zh":"这种油漆干了以后会变成一种偏铝质的银色，在阳光下看起来很有金属感。"},{"en":"I don’t want a bright chrome finish—just an aluminish tone.","zh":"我不想要那种很亮的镀铬效果——只要偏铝的色调就好。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) Related to aluminum in a loose, non-technical way.","zh":"（非正式）泛指与铝有关的（不严格、非技术性的说法）。"},"examples":[{"en":"He mentioned an aluminish coating to prevent rust.","zh":"他提到一种“偏铝的”涂层，用来防锈。"}]}],"synonyms":["aluminum-like","silvery","metallic","grayish"],"phonetic":"/əˈluːməˌnɪʃ/","extraExplanation":["“aluminish”不是常见的标准词，更像是口语/临时造词：aluminum（铝）+ “-ish”（有点像……、带点……的）。更常见、更正式的表达有 aluminum-like / aluminous（含铝的）/ aluminized（镀铝的、铝化的）。","美式英语通常拼作 aluminum（而英式常见 aluminium）。如果你是在写正式文本，建议用 aluminum-like 或 silvery/metallic 等更常见的词。"]}
{"word":"aluminising","summary":{"en":"Aluminising is coating or treating a surface with aluminum for protection or reflectivity.","zh":"Aluminising 指在表面镀铝/铝化处理，以增强防护或反光效果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of coating something with a thin layer of aluminum (often to protect it from heat or corrosion, or to make it reflective)","zh":"给物体表面镀上一层薄铝（常用于耐热、防腐蚀或增加反光性）的过程"},"examples":[{"en":"Aluminising the steel parts helps prevent rust in harsh conditions.","zh":"给钢制零件做铝化处理有助于在恶劣环境下防锈。"},{"en":"The factory uses aluminising to improve the heat resistance of engine components.","zh":"工厂使用铝化处理来提高发动机部件的耐热性。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of aluminise: to coat or treat something with aluminum","zh":"aluminise 的现在分词：给某物镀铝或进行铝化处理"},"examples":[{"en":"They are aluminising the pipe to reduce corrosion.","zh":"他们正在给管道镀铝以减少腐蚀。"},{"en":"The company specialises in aluminising metal sheets for industrial use.","zh":"这家公司专门为工业用途提供金属板的铝化处理。"}]}],"synonyms":["aluminizing","aluminisation","aluminum coating","aluminizing treatment"],"phonetic":"/əˈluːməˌnaɪzɪŋ/","extraExplanation":["“aluminising”是英式拼写；美式更常见“aluminizing”。在工程与材料领域，它常指表面处理/涂层工艺（如热浸、扩散渗铝或喷涂等），具体方法取决于应用场景（耐热、耐腐蚀或反射）。"]}
{"word":"aluminite","summary":{"en":"Aluminite is a rare mineral: hydrated aluminum sulfate, usually white and soft.","zh":"Aluminite（铝明矾矿）是一种较少见的矿物：含水硫酸铝，通常呈白色且质地较软。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a soft, white mineral made mainly of hydrated aluminum sulfate; it can form as a deposit in places affected by acidic water (such as some mines or clays).","zh":"一种柔软的白色矿物，主要成分为含水硫酸铝；常在酸性水影响的环境（如某些矿区或黏土沉积中）形成。"},"examples":[{"en":"Aluminite is sometimes found as a white, chalky crust on clay-rich ground.","zh":"铝明矾矿有时会以白色、粉笔状的薄壳出现在富含黏土的地表。"},{"en":"The report listed aluminite among several sulfate minerals formed by acid drainage.","zh":"报告将铝明矾矿列为由酸性排水形成的多种硫酸盐矿物之一。"}]}],"synonyms":["hydrated aluminum sulfate (mineral)","sulfate mineral"],"phonetic":"/əˈluːməˌnaɪt/","extraExplanation":["“aluminite”是矿物学用词，日常英语中很少用到。常见拼写与相关词包括 aluminum（铝）和 alum（明矾）；但 aluminite 指的是一种特定矿物，不等同于日常所说的“明矾/铝粉”。","矿物名称常以 “-ite” 结尾（如 calcite, graphite），表示“某种矿物/岩石”。"]}
{"word":"Aluminium","summary":{"en":"Aluminium is a light metal widely used in everyday products and transportation.","zh":"Aluminium 指“铝”，一种轻金属，广泛用于日常用品和交通工具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A light, silvery-white metal used widely because it is strong for its weight and resists rusting (common in cans, foil, airplanes, and window frames).","zh":"铝；一种轻质的银白色金属，因为“强度高且重量轻”并且耐腐蚀而被广泛使用（常见于易拉罐、铝箔、飞机、窗框等）。"},"examples":[{"en":"These cans are made of aluminium.","zh":"这些易拉罐是用铝做的。"},{"en":"Wrap the food in aluminium foil to keep it fresh.","zh":"用铝箔把食物包起来以保持新鲜。"},{"en":"Aluminium is light, so it’s useful for aircraft.","zh":"铝很轻，所以适合用于飞机。"}]}],"synonyms":["Al (chemical symbol)","aluminum (US spelling)"],"phonetic":"/ˌæl.jəˈmɪn.i.əm/","extraExplanation":["英式拼法是 aluminium，美式拼法通常写作 aluminum（少一个 i）。两者意思相同，只是地区习惯不同。","读音也常不同：英式通常是 /ˌæl.jʊˈmɪn.i.əm/ 一类的节奏；美式常见 /əˈluː.mə.nəm/。你在阅读或写作时，按所在地区（英式/美式）选择拼写会更自然。","与“steel（钢）”相比，铝更轻且不易生锈；但通常没有某些钢那么硬。日常生活中常见搭配：aluminium foil（铝箔）, aluminium can（铝罐/易拉罐）, aluminium alloy（铝合金）。"]}
{"word":"aluminium","summary":{"en":"Aluminium is a light metal (Al), commonly used for cans, foil, and many products.","zh":"Aluminium（铝）是一种轻质金属（元素符号 Al），常用于罐、铝箔和多种产品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A light, silvery metal used to make cans, foil, aircraft parts, and many everyday products; chemical symbol Al.","zh":"一种轻质银白色金属，常用于制造易拉罐、铝箔、飞机部件和许多日用品；化学符号为 Al（铝）。"},"examples":[{"en":"The drink comes in an aluminium can.","zh":"这种饮料装在铝罐里。"},{"en":"Wrap the leftovers in aluminium foil.","zh":"把剩菜用铝箔包起来。"},{"en":"Many bicycles use aluminium frames because they are light.","zh":"许多自行车使用铝制车架，因为它们很轻。"}]}],"synonyms":["aluminum","Al (symbol)"],"phonetic":"/ˌæl.jəˈmɪn.i.əm/","extraExplanation":["“aluminium”是英式拼写；美式英语更常用“aluminum”。两者指同一种金属，发音也不同：英式通常为 /ˌæl.jəˈmɪn.i.əm/，美式常为 /əˈluː.mə.nəm/。","在科学和工业语境中也常见合成词：aluminium alloy（铝合金）、anodized aluminium（阳极氧化铝）。"]}
{"word":"aluminium oxide","summary":{"en":"Al₂O₃, a hard aluminum–oxygen compound used in aluminum production, ceramics, and abrasives.","zh":"Al₂O₃：铝与氧形成的坚硬化合物，用于炼铝、陶瓷与磨料等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A chemical compound of aluminum and oxygen (Al₂O₃), a white or colorless solid used widely in making aluminum metal, ceramics, and as a catalyst support.","zh":"氧化铝（Al₂O₃），由铝和氧组成的化合物，常见为白色/无色固体，广泛用于炼铝、陶瓷材料以及作为催化剂载体。"},"examples":[{"en":"Aluminium oxide is used in the Hall–Héroult process to produce aluminum metal.","zh":"在霍尔—埃鲁法炼铝过程中会用到氧化铝来生产金属铝。"},{"en":"High-purity aluminium oxide is an important ceramic material because it is hard and heat-resistant.","zh":"高纯度氧化铝因硬度高、耐高温，是重要的陶瓷材料。"}]},{"partOfSpeech":"n.","definition":{"en":"A very hard material used as an abrasive (for grinding, polishing, or sandpaper).","zh":"一种非常坚硬的磨料材料，用于研磨、抛光或砂纸等。"},"examples":[{"en":"The sandpaper is coated with aluminium oxide for faster sanding.","zh":"这种砂纸表面涂有氧化铝，打磨更快。"},{"en":"They polished the surface using aluminium oxide powder.","zh":"他们用氧化铝粉末来抛光表面。"}]}],"synonyms":["alumina","aluminum oxide","Al2O3"],"phonetic":"/ˌæljuːˈmɪniəm ˈɑksaɪd/","extraExplanation":["常见别名：alumina（氧化铝/刚玉原料）。在自然界中，Al₂O₃ 的晶体形式包括 corundum（刚玉）；红宝石和蓝宝石本质上是含微量杂质的刚玉。","用途提示：炼铝时用的氧化铝通常来自铝土矿（bauxite）提炼；工程上氧化铝也常用于耐磨涂层、电子陶瓷基板与绝缘材料。"],"etymology":"“aluminium”来自“alum（明矾）”一词的拉丁语来源，后来用于指元素“铝”；“oxide”来自表示“氧化物”的构词方式（oxygen + -ide）。合在一起就是“铝的氧化物”。英式常写 aluminium oxide，美式更常写 aluminum oxide。","mnemonic":["记“oxide”=“氧化物”，看到 -oxide 基本就是“某某的氧化物”。所以 aluminium oxide=“铝的氧化物”=氧化铝。","联想“Al₂O₃”：Al（铝）+ O（氧）→ 氧化铝；把 2 和 3 当作“配方比例”帮助记住化学式。"]}
{"word":"aluminium-coated","summary":{"en":"Aluminium-coated means “covered with a thin layer of aluminum.”","zh":"aluminium-coated 指“表面覆有一层薄铝（铝涂层的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"covered with a thin layer of aluminum, usually to reflect heat/light, resist corrosion, or improve appearance.","zh":"表面覆有一层薄薄的铝（铝涂层的），通常用于反射热/光、防腐蚀或改善外观。"},"examples":[{"en":"The building uses aluminium-coated panels to reflect sunlight and reduce heat.","zh":"这栋建筑使用铝涂层面板来反射阳光并降低热量。"},{"en":"Aluminium-coated steel is common in outdoor equipment because it resists rust.","zh":"铝涂层钢常用于户外设备，因为它更耐生锈。"}]}],"synonyms":["aluminum-coated","aluminium-plated","aluminum-plated","metal-coated"],"phonetic":"/əˈluːmɪniəm ˌkoʊtɪd/","extraExplanation":["英式拼写为 aluminium-coated；美式拼写常见为 aluminum-coated（同义）。","在材料与工程语境里，-coated 表示“表面有涂层/镀层”，强调“覆盖在表面的一层”，不一定是厚重的材料本体。"]}
{"word":"aluminiums","summary":{"en":"“Aluminiums” means more than one kind or amount of aluminum (Al), though “aluminum” is usually uncountable in everyday English.","zh":"“aluminiums”表示“多种/多份铝（Al）”，但日常英语里“aluminum”通常作不可数名词更常用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of aluminum: the light, silver-colored metal (chemical symbol Al) used to make cans, foil, aircraft parts, and many everyday products.","zh":"aluminum 的复数：铝（金属元素符号 Al），一种轻、银白色的金属，常用于制作易拉罐、铝箔、飞机零件等。"},"examples":[{"en":"Different aluminums are used for different purposes, such as cooking pans and airplane parts.","zh":"不同类型的铝用于不同用途，比如锅具和飞机零件。"},{"en":"The factory tests the strength of several aluminums before choosing one for the frame.","zh":"工厂会测试几种铝材的强度，再选择其中一种用于框架。"}]}],"synonyms":["aluminum (usual form)","aluminium (BrE spelling)","aluminum alloys","Al"],"phonetic":"/əˈluːmɪnəm/","extraExplanation":["“aluminiums”在现代英语里不如“aluminum”（不可数名词）常见。日常表达通常说：some aluminum / a piece of aluminum / aluminum alloys（铝合金）。当强调“不同种类/不同牌号的铝材”时，才可能用复数“aluminiums”。","美式拼写是 aluminum（/əˈluːmɪnəm/），英式常见 aluminium。两者指同一种元素，只是拼写不同。"]}
{"word":"aluminization","summary":{"en":"Aluminization means applying an aluminum coating to a material to protect it, especially from heat and corrosion.","zh":"Aluminization 指在材料表面施加铝涂层（铝化处理），以增强耐热与耐腐蚀等性能。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of coating a material (especially steel or other metals) with a thin layer of aluminum, usually to protect it from heat, corrosion, or oxidation","zh":"铝化；铝涂层处理：在材料（尤指钢或其他金属）表面覆上一层薄薄的铝，通常用于耐高温、防腐蚀或抗氧化"},"examples":[{"en":"Aluminization is often used on turbine blades to improve heat resistance.","zh":"铝化处理常用于涡轮叶片，以提高耐热性。"},{"en":"The pipes underwent aluminization to reduce rusting in a harsh environment.","zh":"这些管道经过铝化处理，以在恶劣环境中减少生锈。"}]}],"synonyms":["aluminizing","aluminum coating","aluminized coating"],"phonetic":"/əˌluːmənaɪˈzeɪʃən/","extraExplanation":["“aluminization”是工程与材料领域常见名词，常见工艺包括热浸铝（hot-dip aluminizing）与渗铝/包铝（aluminizing, diffusion aluminide coating）等。不同工艺得到的涂层结构与耐温、耐蚀性能会有差异。","词形来源：aluminum（铝）+ -ize（使……化/处理）+ -ation（名词化），表示“使其具有铝层/铝化的过程”。在英式英语中也可能见到以 aluminium 为基础的拼写变体。"]}
{"word":"aluminize","summary":{"en":"Aluminize means to coat something with a thin layer of aluminum for protection, especially against heat or corrosion.","zh":"Aluminize 指给物体覆上一层薄铝以起到防护作用，尤其用于耐热或防腐。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to coat (a material or object) with aluminum, or to treat it so it gains a thin aluminum layer (often for heat resistance or protection).","zh":"给（材料或物体）镀铝/覆铝；用铝层处理（常用于耐热或防护）。"},"examples":[{"en":"The steel parts were aluminized to improve their resistance to heat and corrosion.","zh":"这些钢制零件进行了镀铝处理，以提高耐热性和耐腐蚀性。"},{"en":"Aluminized fabric is often used in protective clothing for firefighters.","zh":"覆铝织物常用于消防员的防护服。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become coated with aluminum (less common; usually used in technical contexts).","zh":"（较少见）变得被铝层覆盖；形成铝涂层（多用于技术语境）。"},"examples":[{"en":"Under the process conditions, the surface can aluminize evenly.","zh":"在这种工艺条件下，表面可以均匀形成铝涂层。"}]}],"synonyms":["coat with aluminum","aluminum-coat","metallize"],"phonetic":"/əˈluːməˌnaɪz/","extraExplanation":["“aluminize”多见于工程/制造领域（如航空航天、汽车排气系统、耐高温防护材料）。常见相关词：aluminized（adj. 覆铝的/镀铝的），aluminization（n. 镀铝处理）。","英式英语里也常见拼写“aluminise”，美式英语更常用“aluminize”。"]}
{"word":"aluminized","summary":{"en":"“Aluminized” means coated or treated with a layer of aluminum, often to reflect heat or resist corrosion.","zh":"“Aluminized”指表面镀/涂有一层铝、经过铝化处理的，常用于增强反射、耐热或抗腐蚀。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Coated or treated with a thin layer of aluminum, usually to make something more reflective, heat-resistant, or corrosion-resistant.","zh":"表面镀/涂有一层铝的；经过铝化处理的（通常用于增强反射性、耐热性或抗腐蚀性）。"},"examples":[{"en":"Firefighters often wear aluminized suits to reflect intense heat.","zh":"消防员常穿铝化防护服来反射强烈的热量。"},{"en":"The factory uses aluminized steel for parts that face moisture and high temperatures.","zh":"工厂会用铝化钢来制作需要面对潮湿和高温的部件。"},{"en":"Aluminized film is used in packaging to help block light and oxygen.","zh":"包装中会使用铝化薄膜来帮助阻隔光线和氧气。"}]},{"partOfSpeech":"v.","definition":{"en":"Past form of “aluminize”: to coat or treat with aluminum.","zh":"aluminize 的过去式/过去分词：使铝化；用铝覆盖或处理。"},"examples":[{"en":"The fabric was aluminized to improve heat reflection.","zh":"这种布料经过铝化处理，以增强热反射效果。"},{"en":"They aluminized the components before assembly.","zh":"他们在组装前对零件进行了铝化处理。"}]}],"synonyms":["aluminum-coated","aluminium-coated","metal-coated","foil-lined"],"phonetic":"əˈluːməˌnaɪzd","extraExplanation":["“aluminized”常见于工业与防护装备语境：如aluminized fabric（铝化织物）、aluminized steel（铝化钢）、aluminized mylar/film（铝化薄膜）。它强调“表面覆铝层”，不等同于“由铝制成”（made of aluminum）。"]}
{"word":"aluminizes","summary":{"en":"“Aluminizes” means “coats or treats something with aluminum,” usually for protection.","zh":"“aluminizes”表示“给……镀铝/覆铝处理”，通常用于保护（耐热、防腐等）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to coat or treat something with aluminum (or an aluminum compound), usually to protect it from heat, corrosion, or wear","zh":"用铝（或含铝材料）给某物镀铝/覆铝处理，通常用于耐热、防腐或防磨损"},"examples":[{"en":"The factory aluminizes steel parts to help them resist corrosion.","zh":"这家工厂会给钢制零件做镀铝处理，帮助它们抗腐蚀。"},{"en":"The company aluminizes turbine blades so they can handle high temperatures.","zh":"公司对涡轮叶片进行覆铝处理，使其能承受高温。"}]},{"partOfSpeech":"vi.","definition":{"en":"(of a material) to become coated with aluminum","zh":"（材料）被镀上一层铝；形成铝涂层"},"examples":[{"en":"If the surface aluminizes evenly, the coating will look smooth and bright.","zh":"如果表面镀铝均匀，涂层看起来就会光滑明亮。"}]}],"synonyms":["aluminum-coat","aluminum-plate","metalize","coat"],"phonetic":"/əˈluːməˌnaɪz/","extraExplanation":["“aluminizes”是动词“aluminize”的第三人称单数现在时（he/she/it aluminizes）。常见于工程、冶金、航空航天等语境。","相关工艺可能包括热浸镀铝（hot-dip aluminizing）或扩散镀铝/渗铝（aluminizing diffusion），目的多与提升耐高温氧化能力有关。"]}
{"word":"aluminizing","summary":{"en":"Aluminizing means coating a surface with aluminum, usually to improve heat or corrosion resistance.","zh":"Aluminizing 指在表面做铝化涂层处理，通常用于提升耐热或耐腐蚀性能。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of coating a surface with aluminum (or an aluminum-based layer) to improve heat resistance, corrosion resistance, or reflectivity","zh":"（铝化）在物体表面覆盖一层铝（或含铝涂层/扩散层）的工艺，用于提高耐热性、耐腐蚀性或反射性"},"examples":[{"en":"The factory uses aluminizing to protect steel parts from rust and high temperatures.","zh":"工厂使用铝化工艺来保护钢制零件免受生锈和高温影响。"},{"en":"Aluminizing is common in components that face intense heat, such as exhaust systems.","zh":"铝化常用于承受高温的部件，比如排气系统。"}]},{"partOfSpeech":"v.","definition":{"en":"the act of applying an aluminum coating to something; present participle of “aluminize”","zh":"给某物施加铝涂层/铝化处理的动作；为 aluminize 的现在分词"},"examples":[{"en":"They are aluminizing the turbine blades to help them withstand extreme heat.","zh":"他们正在对涡轮叶片进行铝化处理，以帮助其承受极端高温。"},{"en":"While aluminizing the sheet metal, the technicians monitor the coating thickness carefully.","zh":"在对金属板进行铝化处理时，技术人员会仔细监控涂层厚度。"}]}],"synonyms":["aluminum coating","aluminization","metal coating","protective coating"],"phonetic":"/əˈluːməˌnaɪzɪŋ/","extraExplanation":["“aluminizing（铝化）”常见于材料与制造领域，尤其是高温或腐蚀环境中的防护处理。根据工艺不同，它可能指：\n- 热浸铝（hot-dip aluminizing）：把钢件浸入熔融铝中形成涂层；\n- 扩散铝化/包铝（pack aluminizing / diffusion aluminizing）：让铝在高温下向金属表面扩散形成耐高温的保护层。\n学习时可把它理解为“给表面加一层铝的保护层/功能层”。"]}
{"word":"alumino","summary":{"en":"Alumino- is a technical combining form meaning “aluminum” or “aluminum-containing,” used in terms like aluminosilicate.","zh":"alumino- 是科技构词成分，表示“铝/含铝的”，常见于如 aluminosilicate（铝硅酸盐）等术语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a combining form meaning “aluminum” or “containing aluminum,” used in scientific and technical words (especially chemistry and geology).","zh":"构词成分，表示“铝”或“含铝的”，常用于科技词汇（尤其是化学、地质学）。"},"examples":[{"en":"Alumino- is used in words like “aluminosilicate,” meaning a mineral containing aluminum and silicon.","zh":"alumino- 常见于 “aluminosilicate（铝硅酸盐）” 这类词，表示含铝和硅的矿物。"},{"en":"The report described alumino-silicate materials used in ceramics.","zh":"报告描述了用于陶瓷的铝硅酸盐材料。"}]}],"synonyms":["alumin-","aluminum (related word)","alumina (related word)"],"phonetic":"əˈluːmɪnoʊ","extraExplanation":["“alumino-”通常不会单独当作一个完整英文单词使用，而是作为前缀/构词成分出现在复合术语里。","美式英语常用 aluminum（英式多见 aluminium）；但在构词里常见形式是 alumino-，例如 aluminosilicate（铝硅酸盐）。","如果你是在找一个具体单词：可能是 aluminum（铝，金属）或 alumina（氧化铝）。"]}
{"word":"alumino-ferric","summary":{"en":"“Alumino-ferric” describes something that contains or relates to both aluminum and iron (often Fe³⁺) in a material or compound.","zh":"“alumino-ferric”指含铝且含铁（常指三价铁）的物质或化合物，常用于地质/材料等专业语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing or relating to both aluminum (alumino-) and iron (ferric), especially in minerals, ores, or chemical compounds.","zh":"含铝并含铁的；与铝和铁（尤其是三价铁 ferric）同时相关的，常用于矿物、矿石或化合物的描述。"},"examples":[{"en":"The soil sample contained alumino-ferric minerals formed under high weathering conditions.","zh":"该土壤样品含有在强风化条件下形成的铝铁矿物。"},{"en":"Researchers analyzed an alumino-ferric oxide layer on the surface of the catalyst.","zh":"研究人员分析了催化剂表面的一层铝铁氧化物膜。"}]}],"synonyms":["aluminum–iron","aluminoferric","aluminum-iron-bearing"],"phonetic":"/əˌluːmənoʊˈfɛrɪk/","extraExplanation":["“alumino-”表示“铝的/含铝的”，“ferric”通常指“三价铁（Fe³⁺）的”。因此 alumino-ferric 多见于地质、土壤学、冶金与材料科学文献中，用来概括“铝—铁体系/铝铁复合成分”。","在实际写作中，它常作定语修饰名词：alumino-ferric minerals/oxides/clays（铝铁矿物/氧化物/黏土）。有时也会看到更常用的近似表达，如 “aluminum–iron” 或 “aluminoferric”（不加连字符的拼写变体）。"]}
{"word":"aluminoferric","summary":{"en":"“Aluminoferric” means ‘aluminum-and-iron containing’ and is mainly used in scientific descriptions.","zh":"“aluminoferric”指“含铝又含铁的”，主要用于科学/专业描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing or relating to both aluminum and iron (especially in minerals, soils, or chemical compounds).","zh":"含有或与铝和铁两者有关的（尤用于矿物、土壤或化合物）。"},"examples":[{"en":"The lab analyzed an aluminoferric mineral found near the old mine.","zh":"实验室分析了在旧矿区附近发现的一种铝铁矿物。"},{"en":"Some soils develop an aluminoferric layer after long-term weathering.","zh":"一些土壤在长期风化后会形成铝铁层。"}]}],"synonyms":["alumino-ferric","aluminum-and-iron (containing)"],"phonetic":"/əˌluːmɪnoʊˈfɛrɪk/","extraExplanation":["“aluminoferric”多见于地质学、土壤学或材料/化学的专业语境，用来概括“同时含铝（alumino-）与含铁（-ferric）”的性质。日常英语中很少用，更常见的写法是带连字符的“alumino-ferric”，或直接说“aluminum-and-iron (containing)”。","词根提示：alumino- 表示“铝”，ferric 与 iron/Fe 有关（在化学里常与三价铁 Fe(III) 相关，但在一些描述性用法中也可泛指“铁的”）。"]}
{"word":"aluminographic","summary":{"en":"“Aluminographic” means related to making images or prints using aluminum, especially aluminum plates.","zh":"aluminographic 指与使用铝（尤指铝版）进行制图或印刷的工艺相关，或由此工艺制作出的作品。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a printing or image-making process that uses aluminum (especially aluminum plates), or to images produced by such a process.","zh":"（尤指用铝版的）铝版印刷/制图工艺的；由此工艺制作出的（图像/印刷品）的。"},"examples":[{"en":"The museum catalog mentions an aluminographic print made from an aluminum plate.","zh":"博物馆的图录提到一幅用铝版制作的印刷作品。"},{"en":"They chose an aluminographic method because aluminum plates are light and durable.","zh":"他们选择铝版印刷的方法，因为铝版轻便且耐用。"}]}],"synonyms":["aluminum-plate (printing)","aluminum-based (printing)","lithographic (on aluminum)"],"phonetic":"/əˌluːmənoʊˈɡræfɪk/","extraExplanation":["这个词比较少见，多见于较专业的印刷、版画或材料相关语境。词形上可理解为 alumin(o)-（铝）+ -graphic（与“书写/绘制/制版/图像”相关），含义接近“与铝制印版/铝制图像工艺有关”。","在更常见的日常英语里，人们通常会用更具体的说法，比如：aluminum plate printing（铝版印刷）、lithography on aluminum（铝版平版印刷）等。"]}
{"word":"aluminography","summary":{"en":"Aluminography is a rare term for printing with an aluminum plate, or for the print made by that method.","zh":"Aluminography（较少见）指用铝版进行印刷的工艺，也可指用该工艺制作出的印刷品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a printing process that uses an aluminum plate (often in a lithographic or photo-lithographic method) to produce images or text.","zh":"一种使用铝板（常见于平版印刷或照相平版工艺）来印刷图像或文字的印刷方法。"},"examples":[{"en":"The poster was produced by aluminography on a thin aluminum plate.","zh":"这张海报是用铝版印刷（aluminography）在薄铝板上制作的。"},{"en":"In the archive notes, the technician described the process as aluminography rather than traditional stone lithography.","zh":"在档案记录中，技术员把这种工艺称为铝版印刷，而不是传统的石版印刷。"}]},{"partOfSpeech":"n.","definition":{"en":"a print or image made using an aluminum-plate printing process.","zh":"用铝板印刷工艺制作出的印刷品或图像。"},"examples":[{"en":"The museum catalog lists the work as an aluminography from the early 1900s.","zh":"博物馆目录把这件作品标注为20世纪初的一幅铝版印刷作品。"}]}],"synonyms":["lithography","photo-lithography","plate printing","offset printing"],"phonetic":"/əˌluːməˈnɑːɡrəfi/","extraExplanation":["“aluminography”属于较少见的术语，多见于艺术印刷、档案或技术描述中。它与“lithography（平版印刷/石版画）”关系密切：早期平版印刷常用石灰石做版材，后来也常改用更轻、更耐用、适合工业化生产的铝板。","词形上可拆为“alumino-（铝的）+ -graphy（书写/制图/印刷术）”。在现代语境里，人们更常说“(photo)lithography”“offset printing（胶印）”等，具体用词取决于工艺细节。"]}
{"word":"aluminohydrocalcite","summary":{"en":"a rare aluminum‑bearing hydrated calcium carbonate mineral.","zh":"一种罕见的含铝水合碳酸钙矿物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral: an aluminum‑bearing hydrated calcium carbonate (a carbonate mineral) found in some low‑temperature or weathering environments.","zh":"一种较少见的矿物：含铝的水合碳酸钙（碳酸盐矿物），常见于某些低温或风化环境中。"},"examples":[{"en":"The sample was identified as aluminohydrocalcite using X‑ray diffraction (XRD).","zh":"该样品通过X射线衍射（XRD）鉴定为铝水合方解石。"},{"en":"Aluminohydrocalcite can form as a secondary mineral during the alteration of carbonate rocks.","zh":"铝水合方解石可在碳酸盐岩的蚀变过程中作为次生矿物形成。"}]}],"synonyms":["hydrocalcite (related mineral)"],"phonetic":"/əˌluːmənoʊˌhaɪdroʊˈkælsaɪt/","extraExplanation":["词源拆解有助记忆：alumino-（含铝的）+ hydro-（含水/水合的）+ calcite（方解石/碳酸钙矿物）。因此它通常指“含铝、含水的碳酸钙类矿物”。","这是地质与矿物学中的专门词，日常英语里几乎不会用到；常见于学术论文、矿物数据库、鉴定报告等语境。"]}
{"word":"aluminose","summary":{"en":"Aluminous means containing or rich in alumina (aluminum oxide), used mainly in scientific contexts.","zh":"Aluminous 指“含（或富含）氧化铝/铝化合物的”，主要用于科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Usually in geology/chemistry) containing alumina (aluminum oxide), or rich in aluminum compounds.","zh":"（多用于地质/化学）含氧化铝（alumina），或富含铝化合物的。"},"examples":[{"en":"The soil here is aluminous, so it can affect which crops grow well.","zh":"这里的土壤含氧化铝较多，所以会影响哪些作物长得好。"},{"en":"Some metamorphic rocks are aluminous and form certain aluminum-rich minerals.","zh":"一些变质岩富含氧化铝，会形成某些富铝矿物。"}]}],"synonyms":["aluminum-rich","alumina-rich"],"phonetic":"əˈluːmənəs","extraExplanation":["你输入的“aluminose”很可能是拼写误差；英语里更常见的词是 **aluminous**（富含氧化铝的）。","**aluminous**主要出现在科学语境（地质、矿物学、化学材料等），日常英语里不常用。日常表达“含铝的”更常用 **aluminum** 作定语（如 aluminum foil 铝箔）或说 **contains aluminum**。"]}
{"word":"aluminosilicate","summary":{"en":"Aluminosilicate is a mineral/material (or describing one) made mainly of aluminum and silicate, common in rocks and clays.","zh":"Aluminosilicate 指铝硅酸盐（或“铝硅酸盐的”），主要由铝与硅酸盐组成，常见于岩石与黏土中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mineral or material made of aluminum, silicon, and oxygen (often with other elements); common in many rocks and clays","zh":"铝硅酸盐；由铝、硅和氧组成（常含其他元素）的矿物或材料，常见于许多岩石与黏土中"},"examples":[{"en":"Many common clays are aluminosilicates.","zh":"许多常见的黏土都是铝硅酸盐。"},{"en":"Aluminosilicate minerals are important in geology because they help scientists understand how rocks formed.","zh":"铝硅酸盐矿物在地质学中很重要，因为它们能帮助科学家了解岩石如何形成。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to aluminosilicates or made from them","zh":"铝硅酸盐的；由铝硅酸盐制成的"},"examples":[{"en":"The lab tested an aluminosilicate sample from volcanic ash.","zh":"实验室检测了一份来自火山灰的铝硅酸盐样品。"},{"en":"Some filters use aluminosilicate materials to trap impurities.","zh":"一些过滤器使用铝硅酸盐材料来捕捉杂质。"}]}],"synonyms":["aluminum silicate","aluminosilicate mineral"],"phonetic":"/əˌluːmənoʊˈsɪlɪkeɪt/","extraExplanation":["“aluminosilicate”是由 aluminum（铝）+ silicate（硅酸盐）构成的复合词，常见于地质学、材料科学与环境科学语境。","常见的铝硅酸盐矿物包括 feldspar（长石）、mica（云母）等；日常生活中也会在陶瓷、耐火材料（refractory materials）或某些吸附/过滤材料的说明中看到。"]}
{"word":"aluminosis","summary":{"en":"Aluminosis is an occupational lung disease caused by long-term inhalation of aluminum dust.","zh":"Aluminosis 指因长期吸入铝粉尘而引起的职业性肺部疾病（铝尘肺）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A lung disease caused by breathing in aluminum dust over a long period, leading to scarring (fibrosis) and breathing problems.","zh":"铝尘肺：长期吸入铝粉尘引起的肺部疾病，可导致肺组织瘢痕化（纤维化）和呼吸困难。"},"examples":[{"en":"The doctor suspected aluminosis after years of the patient working with aluminum powder.","zh":"医生在得知病人多年接触铝粉后，怀疑其患有铝尘肺。"},{"en":"Better ventilation and masks can reduce the risk of aluminosis in metal-processing workplaces.","zh":"改善通风并佩戴口罩能降低金属加工场所发生铝尘肺的风险。"}]}],"synonyms":["aluminum pneumoconiosis","occupational lung disease","pneumoconiosis"],"phonetic":"/əˌluːməˈnoʊsɪs/","extraExplanation":["“aluminosis”属于职业病相关词汇，多见于冶金、抛光、研磨、喷砂等可能产生铝粉尘的工作环境。现代职业卫生措施（局部排风、密闭作业、呼吸防护、粉尘监测）可显著降低风险。","词形来源：alumin-（铝）+ -osis（表示疾病或病理状态的后缀）。在医学语境中也可与“pulmonary fibrosis（肺纤维化）”“pneumoconiosis（尘肺）”等概念一起出现。"]}
{"word":"aluminosity","summary":{"en":"A noun meaning the degree to which something contains alumina/aluminum compounds.","zh":"名词：指某物含有氧化铝/铝化合物的程度（含铝性）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being aluminous; the presence or amount of alumina/aluminum compounds in a material (often used in geology or materials science)","zh":"含铝性；材料中氧化铝或铝化合物的存在程度/含量（常见于地质或材料领域）"},"examples":[{"en":"Higher aluminosity in the clay can make it more suitable for high-temperature ceramics.","zh":"黏土的含铝性更高时，可能更适合制作耐高温陶瓷。"},{"en":"The lab report compared the aluminosity of several soil samples from the site.","zh":"实验报告比较了该地点多份土壤样本的含铝性。"}]}],"synonyms":["aluminum content","alumina content","aluminousness"],"phonetic":"/əˌluːməˈnɑsɪti/","extraExplanation":["“aluminosity”较少见，更常见的相关词有“alumina（氧化铝）”“aluminous（含铝的）”“aluminosilicate（铝硅酸盐）”。在地质学里，谈到岩石或黏土的成分时，可能会用这个词来概括“含铝的程度”。"]}
{"word":"aluminothermic","summary":{"en":"Aluminothermic describes a high-heat process where aluminum reduces a metal oxide, often used in thermite reactions and welding.","zh":"aluminothermic 指“铝热的/铝热还原的”：铝把金属氧化物还原并放出大量热，常见于铝热反应与铝热焊接。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Using aluminum as a reducing agent to produce very high heat and extract a metal from its oxide (often in a thermite-type reaction).","zh":"（铝热的）指用铝作还原剂，在反应中释放极高热量，并把金属从其氧化物中还原出来（常见于“铝热/铝热剂”反应）。"},"examples":[{"en":"Aluminothermic welding is used to join railway tracks because it generates intense heat.","zh":"铝热焊接常用于连接铁路钢轨，因为它能产生极高的热量。"},{"en":"The lab demonstrated an aluminothermic reaction to show how aluminum can reduce metal oxides.","zh":"实验演示了铝热反应，说明铝如何还原金属氧化物。"}]}],"synonyms":["thermitic","thermite-based","aluminothermy-related"],"phonetic":"/əˌluːmənoʊˈθɝːmɪk/","extraExplanation":["“aluminothermic”常与“reaction（反应）”“process（过程）”“reduction（还原）”“welding（焊接）”连用。最典型的例子是铁的铝热反应（thermite reaction）：氧化铁与铝粉反应，生成熔融铁和氧化铝，并放出大量热。","词形结构：alumino-（铝）+ thermic（热的）。在工程与材料语境中多作形容词使用。","安全提示（语境常见）：铝热反应温度极高、飞溅风险大，通常需要专业防护与规范操作。"]}
{"word":"aluminothermics","summary":{"en":"Aluminothermics refers to the aluminothermic (thermite) process that uses aluminum to produce very high heat for metal production or welding.","zh":"Aluminothermics 指铝热（铝热剂/thermite）工艺：利用铝还原金属氧化物并释放巨大热量，用于冶炼或焊接金属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the aluminothermic process: using aluminum powder to reduce metal oxides and produce very high heat (often to make or weld metals, as in thermite reactions)","zh":"铝热法（铝热反应）：用铝粉还原金属氧化物并释放极高热量的工艺，常用于冶炼或焊接金属（如“铝热剂/thermite”反应）"},"examples":[{"en":"Aluminothermics is commonly used in rail welding because it can generate intense heat quickly.","zh":"铝热法常用于铁路焊接，因为它能快速产生极高的热量。"},{"en":"In class, we learned how aluminothermics can produce molten iron from iron oxide.","zh":"课堂上我们学习了铝热法如何把氧化铁生成熔融的铁。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to aluminothermic reactions or methods","zh":"与铝热反应或铝热方法有关的；铝热的"},"examples":[{"en":"They discussed aluminothermic welding techniques for repairing steel structures.","zh":"他们讨论了用于修复钢结构的铝热焊接技术。"}]}],"synonyms":["aluminothermy","aluminothermic process","thermite process","thermite welding"],"phonetic":"/əˌluːmənoʊˈθɝmɪks/","extraExplanation":["“aluminothermics”更常见的相关词有：aluminothermy（铝热法，名词）与 aluminothermic（铝热的，形容词）。在工程语境里你也会经常看到 thermite（铝热剂/铝热反应混合物）和 thermite welding（铝热焊）。","典型反应例子（理解即可，不必死记）：氧化铁 + 铝 → 铁 + 氧化铝 + 大量热。这种高温让金属可以熔融并用于焊接（例如铁轨接缝）。"]}
{"word":"aluminothermy","summary":{"en":"Aluminothermy is a high-heat chemical method that uses aluminum to reduce metal oxides and produce metals.","zh":"铝热法是一种利用铝粉高温还原金属氧化物、从而制取金属的化学方法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical process that uses aluminum powder as a reducing agent to extract a metal from its oxide, producing very high heat (often used to make metals like chromium or manganese, or to weld rail tracks).","zh":"一种化学冶金过程：用铝粉作还原剂，从金属氧化物中把金属还原出来，并释放出极高的热量（常用于制取铬、锰等金属，或用于铁轨焊接等）。"},"examples":[{"en":"Aluminothermy is used to produce ferroalloys in some industrial processes.","zh":"铝热法在某些工业流程中用于生产铁合金。"},{"en":"Railway workers can weld rails using an aluminothermy (thermite) reaction.","zh":"铁路工人可以利用铝热（铝热剂）反应来焊接铁轨。"}]}],"synonyms":["aluminothermic process","thermite process","thermite reaction"],"phonetic":"/əˌluːməˈnɑːθɚmi/","extraExplanation":["“aluminothermy”也常写作“aluminothermic process”，与“thermite reaction（铝热反应）”密切相关：典型反应是铝粉与金属氧化物（如氧化铁）反应，生成金属和氧化铝，并放出大量热。","词源上可拆为“alumino-（铝）+ -thermy（热）”，强调“利用铝引发的高温还原”。在安全语境中，这类反应温度很高，工业上需要严格的防护与操作规范。"]}
{"word":"aluminothermy-related","summary":{"en":"“Aluminothermy-related” means connected with aluminothermy (aluminothermic/thermite-type reactions used in metallurgy and welding).","zh":"“Aluminothermy-related”指“与铝热法/铝热反应有关的”（常见于冶金与焊接等技术语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with aluminothermy (a process that uses aluminum powder to reduce metal oxides and produce very high heat, often to extract or weld metals).","zh":"与铝热法/铝热反应有关的（利用铝粉还原金属氧化物并产生极高热量，常用于金属提取或焊接）。"},"examples":[{"en":"The lab follows strict safety rules for aluminothermy-related experiments.","zh":"实验室对与铝热反应相关的实验执行严格的安全规定。"},{"en":"Aluminothermy-related materials must be stored away from moisture and ignition sources.","zh":"与铝热反应相关的材料必须远离潮湿和火源保存。"}]}],"synonyms":["aluminothermic","aluminothermic-process-related","thermite-related","metallurgical"],"phonetic":"/əˌluːməˈnɑːrθərmi rɪˈleɪtɪd/","extraExplanation":["“Aluminothermy”常见于冶金与工程语境，最典型的例子是“thermite（铝热剂）”反应：铝粉与金属氧化物（如氧化铁）反应，放出大量热并生成熔融金属。铁路钢轨的现场焊接就是常见应用之一。","这个词在日常英语中很少见，多出现在技术报告、论文、专利或安全规范里；写作中也可用更常见的表达，如“related to thermite reactions / aluminothermic processes（与铝热反应/铝热工艺有关）”。"]}
{"word":"aluminotype","summary":{"en":"Aluminotype refers to an early photomechanical printing method using an aluminum plate, or to a print made by that method.","zh":"Aluminotype 指一种使用铝版进行图像复制的早期照相制版/印刷工艺，也可指由该工艺制作的印刷图像。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a photomechanical printing process that uses an aluminum plate (or aluminum-based surface) to reproduce photographs or illustrations, especially in early commercial printing.","zh":"一种使用铝版（或以铝为基底的版面）来复制照片或图像的照相制版/印刷工艺，常见于早期商业印刷。"},"examples":[{"en":"The magazine’s pictures were produced by an aluminotype process to keep costs low.","zh":"这本杂志的图片用铝版照相制版（aluminotype）工艺制作，以降低成本。"},{"en":"Collectors study how aluminotype methods changed the look of printed photographs.","zh":"收藏者研究铝版照相制版如何改变印刷照片的视觉效果。"}]},{"partOfSpeech":"n.","definition":{"en":"a print or image made using the aluminotype process.","zh":"用铝版照相制版（aluminotype）工艺制作的印刷品或图像。"},"examples":[{"en":"The archive contains several aluminotypes from the early 1900s.","zh":"档案馆里保存着几张20世纪初的铝版印刷图像（aluminotypes）。"},{"en":"The book includes an aluminotype of a street scene.","zh":"这本书收录了一幅街景的铝版印刷图像。"}]}],"synonyms":["photomechanical print","photoengraving","halftone print"],"phonetic":"/əˈluːmənoʊˌtaɪp/","extraExplanation":["该词由“alumino-（铝）+ -type（印制/版式）”构成，常见于19世纪末至20世纪初与印刷、照相制版相关的语境。它不是日常高频词，更常出现在印刷史、摄影史、古籍/版画鉴定与馆藏描述中。"]}
{"word":"aluminous","summary":{"en":"“Aluminous” means containing or rich in alumina/aluminum, often used in science and geology.","zh":"“aluminous”指含有或富含氧化铝/铝（常用于科学与地质语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing or rich in alumina or aluminum; relating to aluminum compounds.","zh":"含有或富含氧化铝/铝的；与铝化合物有关的。"},"examples":[{"en":"The soil here is aluminous, which can affect which crops grow well.","zh":"这里的土壤含铝量较高，这会影响哪些作物长得好。"},{"en":"They tested the rock and found it was aluminous, with a high alumina content.","zh":"他们检测了岩石，发现它含铝丰富，氧化铝含量很高。"}]}],"synonyms":["aluminum-rich","alumina-rich","aluminous (scientific)","rich in alumina"],"phonetic":"/əˈluːmɪnəs/","extraExplanation":["“aluminous”多见于地质、土壤学、材料与化学语境，强调“含氧化铝/铝成分较多”。日常英语里更常用的是“aluminum (adj./n.)”或直接说“high in alumina”。","词源与拉丁语“alumen”（明矾）有关，因此有时也带有“与明矾/含铝盐相关”的学术色彩；不要与“luminous”（发光的）混淆。"]}
{"word":"aluminousness","summary":{"en":"Aluminousness means the quality of containing aluminum compounds, especially alumina, usually in scientific contexts.","zh":"Aluminousness 指“含铝性”，即材料（多为土壤/岩石等）含有较多铝化合物（尤其氧化铝）的性质，常用于学术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of being aluminous; having a noticeable amount of aluminum compounds (especially alumina) in a material such as rock, soil, or clay.","zh":"含铝性；（尤指岩石、土壤、黏土等中）含有较多铝化合物（特别是氧化铝）的性质或状态。"},"examples":[{"en":"Geologists noted the soil’s aluminousness when analyzing the clay-rich layer.","zh":"地质学家在分析富含黏土的地层时注意到了土壤的含铝性。"},{"en":"The aluminousness of the ore affects which refining method is most efficient.","zh":"矿石的含铝性会影响哪种提炼方法最有效。"}]}],"synonyms":["aluminum content","alumina content","aluminosity"],"phonetic":"/əˈluːmɪnəsnəs/","extraExplanation":["“aluminousness”来自形容词“aluminous”（含铝的、富含氧化铝的）+ 名词后缀“-ness”（表示“性质/状态”）。它多见于地质、矿物、材料与土壤学等较正式或学术语境，日常英语中较少使用。更常见的表达包括“aluminum content（铝含量）”“alumina content（氧化铝含量）”等。"]}
{"word":"alumins","summary":{"en":"“Alumni” means former students or graduates of a school (plural).","zh":"“Alumni”指某学校的校友/毕业生（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"former students or graduates of a school, college, or university (plural).","zh":"（某学校/大学的）校友，毕业生（复数）。"},"examples":[{"en":"Our university alumni often return to give talks and mentor students.","zh":"我们大学的校友经常回来做讲座并指导学生。"},{"en":"The alumni association organizes a reunion every year.","zh":"校友会每年都会组织一次聚会。"}]}],"synonyms":["graduates","former students","alums (informal)"],"phonetic":"/əˈlʌmnaɪ/","extraExplanation":["“alumins”不是常见的标准拼写，最可能是把 **alumni**（校友，复数）拼错了。","易混点：**alumni** 是复数；单数通常是 **alumnus**（男校友/泛指）或 **alumna**（女校友）。例如：*He is an alumnus.* / *She is an alumna.*","口语里也有人用 **alum**（更随意）来指“校友”（单复数都可能：an alum / two alums）。"]}
{"word":"Aluminum","summary":{"en":"Aluminum is a lightweight, silver-colored metal (element Al) used in everyday products like cans and foil.","zh":"Aluminum（铝）是一种轻质的银白色金属（元素Al），常用于易拉罐、铝箔等日用品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A lightweight, silver-colored metal used widely for cans, foil, cookware, airplanes, and building materials.","zh":"一种轻质的银白色金属，广泛用于易拉罐、铝箔、炊具、飞机和建筑材料等。"},"examples":[{"en":"These drink cans are made of aluminum.","zh":"这些饮料罐是用铝制成的。"},{"en":"Wrap the food in aluminum foil to keep it fresh.","zh":"用铝箔把食物包起来保鲜。"}]},{"partOfSpeech":"n.","definition":{"en":"The chemical element Al (atomic number 13).","zh":"化学元素“铝”（符号Al，原子序数13）。"},"examples":[{"en":"Aluminum is the most common metal in Earth’s crust.","zh":"铝是地壳中含量最丰富的金属。"}]}],"synonyms":["Al (symbol)","aluminium (UK spelling)"],"phonetic":"/əˈluːmɪnəm/","extraExplanation":["“Aluminum”是美式英语的常用拼写；英式英语中也常见“aluminium”。两者指同一种金属，发音也略有差异（美式更常读作/əˈluːmɪnəm/）。","在日常语境里，它常和“lightweight（轻便）”“recyclable（可回收）”“corrosion-resistant（耐腐蚀）”等词一起出现，比如“aluminum frame（铝合金车架/框架）”“aluminum siding（铝制外墙板）”。"]}
{"word":"aluminum","summary":{"en":"Aluminum is a light, silvery metal commonly used in cans, foil, and many products.","zh":"Aluminum 指一种轻质银白色金属，常用于易拉罐、铝箔和许多产品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A light, silver-colored metal used widely for making cans, foil, airplanes, building materials, and many everyday products.","zh":"一种轻质的银白色金属，广泛用于制造易拉罐、铝箔、飞机、建筑材料和许多日用品。"},"examples":[{"en":"These cans are made of aluminum and can be recycled.","zh":"这些易拉罐是铝制的，可以回收再利用。"},{"en":"Wrap the leftovers in aluminum foil and put them in the fridge.","zh":"把剩菜用铝箔包好，放进冰箱。"},{"en":"Many airplanes use aluminum because it is strong but light.","zh":"许多飞机使用铝，因为它结实但重量轻。"}]}],"synonyms":["Al (symbol)","aluminium (BrE spelling)"],"phonetic":"/əˈluːmənəm/","extraExplanation":["在美式英语中拼写为 aluminum；英式英语常写作 aluminium（多一个 i），但指的是同一种元素（化学符号 Al）。","它的发音重音在第二音节：a-LU-mi-num。与 foil（铝箔）、can（罐）、recycle（回收）等词常搭配。"]}
{"word":"aluminum foil","summary":{"en":"thin aluminum sheet used for wrapping or cooking","zh":"用于包裹或烹饪的薄铝片"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a thin sheet of aluminum used mainly for wrapping, covering, or cooking food","zh":"铝箔；一种很薄的铝片，主要用于包裹、覆盖或烹饪食物"},"examples":[{"en":"Wrap the leftovers in aluminum foil and put them in the fridge.","zh":"把剩菜用铝箔包起来，然后放进冰箱。"},{"en":"Cover the baking tray with aluminum foil to make cleanup easier.","zh":"在烤盘上铺一层铝箔，清理会更方便。"},{"en":"Some people use aluminum foil to keep food warm during a picnic.","zh":"有些人野餐时用铝箔给食物保温。"}]},{"partOfSpeech":"n.","definition":{"en":"aluminum foil shaped into a hat, believed (often jokingly) to block mind control or surveillance","zh":"（常带调侃）“锡纸帽”；用铝箔做的帽子，被认为能阻挡“读心/监控”等"},"examples":[{"en":"He joked that he needed an aluminum foil hat before reading conspiracy forums.","zh":"他开玩笑说，看阴谋论论坛前得先戴上“锡纸帽”。"},{"en":"Calling someone ‘aluminum foil’ can imply they’re being paranoid.","zh":"说别人“铝箔/锡纸帽”有时是在暗示对方疑神疑鬼。"}]}],"synonyms":["foil","kitchen foil","tinfoil"],"phonetic":"/əˈluːmənəm fɔɪl/","extraExplanation":["日常用法里也常直接说 “foil”。但在不明确材质时，最好说 aluminum foil（避免和 plastic wrap 保鲜膜混淆）。","和烹饪相关的小提醒：铝箔适合包裹、遮盖、烘烤；但遇到强酸（如柠檬汁、番茄）或高盐、长时间接触，可能影响风味或让表面变色（通常不严重）。"],"etymology":"“aluminum”指金属“铝”，“foil”原意是“薄片/箔”。组合词字面就是“铝做的薄片”。在美式英语里常说 aluminum foil；英式英语更常用 aluminium foil（拼写多一个 i）。","mnemonic":["记忆法：foil 和 “薄薄一层像‘浮’在表面”联想——铝做的薄片就是 aluminum foil。","把它想成“铝 + 纸”：中文里很多人也叫“锡纸”（虽然材质多为铝），联想更快。"]}
{"word":"aluminum hydroxide","summary":{"en":"a compound used in antacids and as a vaccine ingredient to boost immune response","zh":"用于抗酸药并可作为疫苗辅料以增强免疫反应的化合物"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a white, gelatinous chemical compound (Al(OH)₃) used mainly as an antacid (to reduce stomach acid) and as an ingredient in some vaccines to help stimulate the immune response","zh":"一种白色胶状的化合物（氢氧化铝，Al(OH)₃），主要用作抗酸剂（中和/减少胃酸），也可作为部分疫苗中的辅料以增强免疫反应"},"examples":[{"en":"Aluminum hydroxide is commonly used in antacids to relieve heartburn.","zh":"氢氧化铝常用于抗酸药中，用来缓解胃灼热。"},{"en":"Some vaccines contain aluminum hydroxide to improve the body’s immune response.","zh":"有些疫苗含有氢氧化铝，以增强人体的免疫反应。"},{"en":"The label lists aluminum hydroxide as an active ingredient.","zh":"标签上把氢氧化铝列为有效成分。"}]}],"synonyms":["Al(OH)3","alumina hydrate","hydrated alumina"],"phonetic":"/əˈluːmənəm haɪˈdrɑːksaɪd/","extraExplanation":["发音与拼写提示：美式英语中 aluminum 常读作 5 个音节（ə-LU-mi-num），而英式常见 aluminium（多一个 i，音节更多）。这里的术语一般按美式拼写 aluminum hydroxide。","用法提醒：医学/药学语境里，它多指“抗酸剂成分”或“疫苗佐剂（adjuvant）”。日常交流中常直接说 antacid 或 vaccine ingredient。"],"etymology":"词源上由 aluminum（铝）+ hydroxide（氢氧化物）构成；hydroxide 来自“hydro-（水）+ oxide（氧化物）”，在化学命名中表示含 OH⁻ 的化合物。","mnemonic":["拆分记忆：aluminum（铝）+ hydroxide（氢氧化物）=“铝的氢氧化物”→ 氢氧化铝。","联想：OH⁻ 常见于“氢氧化物”；看到 hydroxide 就想到“含 OH 的碱性/中和相关物质”，对应其抗酸用途。"]}
{"word":"aluminum screw caps","summary":{"en":"Aluminum caps that twist on to seal containers.","zh":"用铝制成、通过旋拧密封容器的盖子。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Caps made of aluminum that close a container by twisting onto matching threads (common on bottles and jars).","zh":"用铝制成、通过旋拧与瓶口/罐口螺纹咬合来密封容器的盖子（常见于瓶子、罐子）。"},"examples":[{"en":"The olive oil comes in a glass bottle with an aluminum screw cap.","zh":"这款橄榄油装在玻璃瓶里，配的是铝制旋盖。"},{"en":"Make sure the aluminum screw cap is tight to prevent leaks.","zh":"把铝制旋盖拧紧，避免渗漏。"},{"en":"Many wines today are sealed with aluminum screw caps instead of corks.","zh":"现在很多葡萄酒用铝制旋盖封口，而不是软木塞。"}]}],"synonyms":["aluminum closures","screw-top caps","twist caps","bottle caps"],"phonetic":"əˈluːmənəm skruː kæps","extraExplanation":["在食品与饮料包装里，aluminum screw caps 常见于酒类、调味品、药品等。与软木塞相比，旋盖更稳定、开启方便，也能降低“木塞味”（cork taint）的风险；但在某些高端葡萄酒文化中，软木塞仍被视为更传统。"],"etymology":"“aluminum”源自拉丁语 alumen（明矾），后来形成 modern Latin 的元素名；“screw cap”由 screw（螺旋/拧）+ cap（盖子）组成，合起来指“通过旋拧方式固定的盖”。","mnemonic":["记忆拆分：aluminum=“铝”，screw=“拧/螺纹”，cap=“盖”→“铝的、拧上的盖子”。","联想中文：看到“螺纹盖”先想到“旋盖”，再加材质“铝制”= aluminum screw cap。"]}
{"word":"aluminum-and-iron","summary":{"en":"Describes something made of or involving both aluminum and iron.","zh":"用来描述由铝和铁构成或同时涉及铝与铁的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"made of, containing, or involving both aluminum and iron (often used in technical or descriptive writing).","zh":"由铝和铁构成的；含有铝与铁的；涉及铝与铁两者的（常见于技术或描述性写作）。"},"examples":[{"en":"The lab tested an aluminum-and-iron alloy for strength and corrosion resistance.","zh":"实验室测试了一种铝-铁合金的强度和耐腐蚀性。"},{"en":"The report compared aluminum-and-iron materials with pure steel.","zh":"报告将铝-铁材料与纯钢进行了比较。"}]}],"synonyms":["aluminum–iron","Al-Fe (technical abbreviation)","aluminum-iron alloy (specific)"],"phonetic":"/əˈluːmənəm ænd ˈaɪərn/","extraExplanation":["这是一个带连字符的复合形容词（compound adjective），通常放在名词前作定语，如“an aluminum-and-iron alloy / mixture”。连字符表示“两者共同修饰后面的名词”，强调“铝和铁一起构成/参与”。","在更正式或技术语境中，也可能写成“aluminum–iron”（用短横线/连接号）来表示两种元素的组合关系，常见于材料科学与化学描述。"]}
{"word":"aluminum-based","summary":{"en":"Aluminum-based describes something made mostly of aluminum or designed around aluminum as the main material.","zh":"Aluminum-based 指“以铝为主要材料/基础”的事物，常用于材料、结构或技术的描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"made from aluminum, or mainly using aluminum as a key material or ingredient","zh":"由铝制成的；以铝为主要材料/成分的"},"examples":[{"en":"The lab tested an aluminum-based alloy for aircraft parts.","zh":"实验室测试了一种用于飞机零件的铝基合金。"},{"en":"Aluminum-based packaging is lightweight but can still be recycled.","zh":"铝基包装很轻，但仍然可以回收利用。"}]},{"partOfSpeech":"adj.","definition":{"en":"built on or primarily using aluminum in its design, structure, or technology","zh":"以铝为基础设计/结构的；主要采用铝技术的"},"examples":[{"en":"They switched to an aluminum-based frame to reduce the bike’s weight.","zh":"他们改用铝基车架来减轻自行车重量。"},{"en":"The company developed an aluminum-based battery material for faster charging.","zh":"该公司开发了一种铝基电池材料，用于更快充电。"}]}],"synonyms":["aluminum-containing","aluminum-rich","aluminum alloy (when appropriate)","aluminum-centered"],"phonetic":"/əˈluːmɪnəm beɪst/","extraExplanation":["“aluminum-based”常见于科技与材料领域，用来修饰名词，如：aluminum-based alloy（铝基合金）、aluminum-based catalyst（铝基催化剂）、aluminum-based composite（铝基复合材料）。","拼写小提示：美式英语更常用 aluminum；英式英语常见 aluminium。作为复合形容词时通常加连字符（hyphen），放在名词前：an aluminum-based coating。"]}
{"word":"aluminum-bearing","summary":{"en":"Aluminum-bearing means “containing aluminum,” especially in technical contexts.","zh":"aluminum-bearing 指“含铝的”，多用于技术或科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing aluminum as a component (often used in science, engineering, and geology).","zh":"含铝的；以铝为成分之一的（常用于科学、工程与地质语境）。"},"examples":[{"en":"Aluminum-bearing minerals are common in many types of rocks.","zh":"含铝矿物在许多类型的岩石中很常见。"},{"en":"They tested an aluminum-bearing alloy to improve strength and reduce weight.","zh":"他们测试了一种含铝合金，以提高强度并减轻重量。"}]}],"synonyms":["aluminum-containing","aluminous"],"phonetic":"/əˈluːmənəm ˈbɛrɪŋ/","extraExplanation":["这是一个由“aluminum（铝）+ bearing（含有……的）”构成的复合形容词。英语里 bearing 常见于科技写作，表示“携带/含有某种成分或特征”，如 oxygen-bearing（含氧的）、iron-bearing（含铁的）。","写作上常用连字符（aluminum-bearing）来强调它作为一个整体形容词来修饰名词；在更正式的技术文本中也可能看到不加连字符的形式 aluminum bearing，但连字符更清晰。"]}
{"word":"aluminum-coat","summary":{"en":"“Aluminum-coat” means to cover something with a thin layer of aluminum, or describes something that has such a coating.","zh":"“aluminum-coat”指用薄铝层覆盖某物，或指带有铝涂层的物品。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to cover something with a thin layer of aluminum, usually to protect it, make it reflective, or improve resistance to heat or corrosion","zh":"用一层薄薄的铝覆盖某物，通常用于保护、增强反光性，或提高耐热/耐腐蚀性"},"examples":[{"en":"The manufacturer aluminum-coated the parts to prevent rust.","zh":"制造商给零件做了铝涂层以防生锈。"},{"en":"Some emergency blankets are aluminum-coated to reflect body heat.","zh":"一些应急毯有铝涂层，用来反射人体热量。"}]},{"partOfSpeech":"adj.","definition":{"en":"covered with a thin layer of aluminum","zh":"表面覆有一层薄铝的；有铝涂层的"},"examples":[{"en":"The aluminum-coated mirror reflects light efficiently.","zh":"铝涂层的镜子能高效反射光线。"},{"en":"Use aluminum-coated cookware only as directed by the manufacturer.","zh":"铝涂层炊具应按厂家说明使用。"}]}],"synonyms":["coat with aluminum","aluminize","aluminized (adj.)","metal-coat"],"phonetic":"/əˈluːmɪnəm koʊt/","extraExplanation":["“aluminum-coat”更常见的写法是连字符形式作形容词（aluminum-coated），或作动词短语（to aluminum-coat / to coat with aluminum）。在技术语境中也常用“aluminize / aluminized”（铝化/铝化处理）来表达类似工艺。","美式英语常用拼写 aluminum；英式英语多见 aluminium。"]}
{"word":"aluminum-coated","summary":{"en":"Aluminum-coated describes something covered with a thin aluminum layer.","zh":"aluminum-coated 指“表面覆有一层铝”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with a thin layer of aluminum (often for protection, reflection, or decoration).","zh":"覆有一层薄薄铝层的（常用于防护、反光或装饰）。"},"examples":[{"en":"The aluminum-coated film reflects heat and light.","zh":"这种覆铝薄膜能反射热量和光线。"},{"en":"They used an aluminum-coated sheet to improve insulation.","zh":"他们用覆铝片材来提高隔热效果。"}]}],"synonyms":["aluminized","aluminum-plated","aluminum-clad"],"phonetic":"/əˈluːmɪnəm ˌkoʊtɪd/","extraExplanation":["“aluminum-coated”是由“aluminum（铝）+ coated（涂覆/镀层的）”组成的复合形容词，常见于材料、包装、建筑保温和电子元件等语境。","常见近义表达：“aluminized（铝化的/镀铝的）”常指通过特定工艺（如真空镀膜）形成的铝层；而“aluminum-coated”更直观，强调“表面被铝覆盖”。","英式英语更常拼作“aluminium-coated”，美式英语为“aluminum-coated”。"]}
{"word":"aluminum-colored","summary":{"en":"“Aluminum-colored” describes something that looks silvery-gray and metallic like aluminum.","zh":"“aluminum-colored”表示某物像铝一样呈银灰色、带金属质感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the color or silvery-gray appearance of aluminum metal.","zh":"呈铝金属那种颜色的；银灰色、带金属光泽的。"},"examples":[{"en":"She bought an aluminum-colored jacket that shines under streetlights.","zh":"她买了一件铝色的夹克，在路灯下会发亮。"},{"en":"The phone comes in an aluminum-colored finish.","zh":"这款手机有铝色外观可选。"}]}],"synonyms":["silvery","silver-colored","metallic","metallic silver","gray-silver"],"phonetic":"/əˈluːmənəm ˌkʌlɚd/","extraExplanation":["“aluminum-colored”是复合形容词（名词 aluminum + 过去分词/形容词 colored），常用于产品描述、服装、汽车涂装等场景，强调“像铝一样的银灰金属感”。","美式英语常用拼写是 aluminum（英式为 aluminium）。作颜色描述时，也常见近似表达：silver, metallic silver, aluminum finish。"]}
{"word":"aluminum-like","summary":{"en":"“Aluminum-like” means resembling aluminum in look or properties (silvery, light, metallic).","zh":"“aluminum-like”表示“像铝的”，指外观或性质（银白、轻、金属感）类似铝。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling aluminum in appearance or qualities (such as being silvery, lightweight, or metallic-looking).","zh":"像铝的；具有铝的外观或特性（如银白色、轻、金属感）。"},"examples":[{"en":"The device has an aluminum-like finish that looks sleek and modern.","zh":"这个设备有一种像铝的表面处理，看起来简洁又现代。"},{"en":"The material is aluminum-like—light but surprisingly strong.","zh":"这种材料很像铝——很轻，但出奇地结实。"}]}],"synonyms":["aluminum-colored","metallic-looking","silvery","aluminum-ish"],"phonetic":"/əˈluːmənəm laɪk/","extraExplanation":["“-like”是常见后缀，表示“像……一样/具有……特征”，可用于形容外观、触感或性质（如 *glass-like*, *childlike*）。","美式英语常用拼写是 **aluminum**；英式英语多见 **aluminium**。两者指同一种金属，但拼写与发音略有差异。"]}
{"word":"aluminum-plate","summary":{"en":"An aluminum plate is a flat piece of aluminum used as a sheet or panel for practical purposes (e.g., making parts, signs, or coverings).","zh":"aluminum plate 指用于制作零件、标牌或覆盖等用途的平整铝板/铝制板材。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flat piece of aluminum used as a material for making, building, covering, or printing; an aluminum sheet or panel.","zh":"铝板；（用于制造、建筑、覆盖或印刷等的）平整铝片/铝制板材。"},"examples":[{"en":"The sign is made from an aluminum plate so it won’t rust in the rain.","zh":"这个标牌是用铝板做的，所以雨淋也不会生锈。"},{"en":"We cut an aluminum plate to cover the broken window temporarily.","zh":"我们切了一块铝板来临时封住破窗。"},{"en":"The machine shop drilled holes into the aluminum plate for the frame.","zh":"机加工车间在铝板上钻孔，用来安装框架。"}]}],"synonyms":["aluminum sheet","aluminum panel","aluminium plate (BrE)"],"phonetic":"/əˈluːmɪnəm pleɪt/","extraExplanation":["在美式英语里通常拼作 aluminum（英式多为 aluminium），发音也略不同。","在工程/制造语境中，plate 往往指“较厚的板材”，而 sheet 常指“较薄的薄板/板材”。不同领域对厚度的界限可能不一样。"]}
{"word":"aluminum-rich","summary":{"en":"“Aluminum-rich” means containing a high amount of aluminum.","zh":"“aluminum-rich”表示铝含量高、富含铝。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing a lot of aluminum (Al), compared with normal amounts; high in aluminum.","zh":"（含）铝较多的；富铝的；铝含量高的。"},"examples":[{"en":"The soil in this region is aluminum-rich, which can harm some crops.","zh":"这个地区的土壤富铝，可能会伤害一些农作物。"},{"en":"Scientists studied aluminum-rich minerals in the rock sample.","zh":"科学家研究了岩石样本中的富铝矿物。"},{"en":"Aluminum-rich alloys are often used to keep products lightweight.","zh":"富铝合金常用于让产品更轻。"}]}],"synonyms":["high-aluminum","aluminum-heavy","aluminous"],"phonetic":"/əˈluːmɪnəm rɪtʃ/","extraExplanation":["“aluminum-rich”常用于科学/技术语境（地质、材料、环境、化学），表示“相对更高的铝含量”，通常是与某个基准或常见水平相比。","拼写提示：美式英语常用 aluminum；英式英语更常见 aluminium，所以也可能看到“aluminium-rich”。","连字符提示：作定语放在名词前时常加连字符（an aluminum-rich soil）；若作表语可不加（The soil is aluminum rich），但加连字符也常见于正式写作。"]}
{"word":"aluminum-treated","summary":{"en":"“Aluminum-treated” describes something that has been processed with aluminum (or an aluminum-based treatment) to improve its properties.","zh":"“aluminum-treated”指某物经过铝或含铝材料处理，以改善其性能。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Adj.) Treated with aluminum or an aluminum-based substance, usually to improve strength, resistance, or performance (e.g., corrosion resistance, flame resistance, or water repellency).","zh":"（形容词）经铝或含铝材料处理的；通常用于提升材料的强度、耐腐蚀性、阻燃性或防水等性能。"},"examples":[{"en":"The manufacturer uses an aluminum-treated coating to slow down corrosion.","zh":"制造商使用经铝处理的涂层来减缓腐蚀。"},{"en":"Aluminum-treated fabric can withstand higher heat than untreated fabric.","zh":"经铝处理的布料比未处理的更耐高温。"}]}],"synonyms":["aluminized","aluminum-coated","aluminum-finished","treated with aluminum"],"phonetic":"/əˈluːmənəm ˈtriːtɪd/","extraExplanation":["“aluminum-treated”是由“aluminum（铝）+ treated（处理过的）”构成的复合形容词，常见于技术说明、产品规格、材料科学与工程语境。","具体“处理方式”可能不同：例如铝涂层（aluminized coating）、含铝化合物浸渍/整理（textile finishing）、或与铝相关的表面改性。阅读时可留意后面接的名词（如 aluminum-treated steel/fabric/wood）来判断用途。","有时也会看到拼写差异：美式常用 aluminum，英式常用 aluminium；对应的复合词也会随之变化。"]}
{"word":"AluminumAl","summary":{"en":"Aluminum (Al) is a lightweight metal widely used in everyday products; it can also describe things made from this metal.","zh":"Aluminum（化学符号 Al）是一种常见的轻质金属，广泛用于日常用品；也可作形容词表示“铝制的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a light, silver-colored metal used to make cans, foil, aircraft parts, window frames, and many other products","zh":"铝：一种轻质的银白色金属，常用于制作易拉罐、铝箔、飞机部件、窗框等"},"examples":[{"en":"These soda cans are made of aluminum.","zh":"这些汽水罐是用铝做的。"},{"en":"Wrap the food in aluminum foil to keep it fresh.","zh":"用铝箔把食物包起来以保持新鲜。"},{"en":"Aluminum is lightweight but strong enough for many uses.","zh":"铝很轻，但强度足以满足很多用途。"}]},{"partOfSpeech":"adj.","definition":{"en":"made of aluminum; relating to aluminum (often used before another noun)","zh":"铝制的；与铝有关的（常作定语）"},"examples":[{"en":"She bought an aluminum water bottle.","zh":"她买了一个铝制水瓶。"},{"en":"The kitchen has aluminum pots and pans.","zh":"厨房里有铝锅和铝制平底锅。"}]}],"synonyms":["aluminium","Al","lightweight metal"],"phonetic":"/əˈluːmɪnəm/","extraExplanation":["“Al”是化学元素符号，来自拉丁语/新拉丁语的命名传统；在科学写作里常写作“Al”。","美式英语常拼作 aluminum；英式英语更常见 aluminium（多一个 i），但指的是同一种金属。","铝的回收非常普遍：回收铝通常比从矿石提炼更省能源，因此在环保语境中经常被提到。"]}
{"word":"aluminums","summary":{"en":"“Aluminums” is the plural form of “aluminum,” used mainly when talking about different kinds/grades of aluminum or aluminum products.","zh":"“Aluminums”是“aluminum”的复数，主要用于指不同种类/等级的铝或铝制产品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of aluminum; the metal aluminum (often referring to different types/grades of aluminum, or aluminum items such as cans).","zh":"aluminum 的复数；指铝这种金属（也常指不同种类/等级的铝，或铝制物品，如铝罐）。"},"examples":[{"en":"Different aluminums are used for airplane parts and for soda cans.","zh":"不同种类的铝用于飞机零件和汽水罐。"},{"en":"The factory produces several aluminums for industrial use.","zh":"这家工厂生产多种用于工业的铝材。"}]}],"synonyms":["aluminum alloys","grades of aluminum","aluminum products"],"phonetic":"/əˈluːmɪnəmz/","extraExplanation":["“aluminum”在英语里通常是不可数名词（a lot of aluminum），所以日常生活中不常说“aluminums”。当强调“不同种类/配方/等级的铝”时，才会用复数“aluminums”。","美式英语常用拼写与读音是 aluminum；英式英语通常写作 aluminium（多一个 i），读音也略有不同。"]}
{"word":"aluminyl","summary":{"en":"Aluminyl is a chemistry term for a reactive, negatively charged aluminum-based group (and things related to it).","zh":"aluminyl 是化学术语，指一种反应性较强的带负电铝基（及其相关的化合物/性质）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) a negatively charged aluminum-containing group (an aluminyl anion), often written as [AlR2]− or similar, used as a strong nucleophile/base in modern inorganic and organometallic chemistry.","zh":"（化学）“铝基/铝负离子”基团（aluminyl anion）：带负电的含铝基团，常写作 [AlR2]− 等形式，在现代无机与有机金属化学中常作为强亲核体/强碱使用。"},"examples":[{"en":"The aluminyl anion can activate small molecules such as H2 or CO2 under mild conditions.","zh":"铝基（aluminyl）负离子在温和条件下可活化 H2 或 CO2 等小分子。"},{"en":"Researchers used an aluminyl reagent to form a new Al–C bond.","zh":"研究人员使用 aluminyl 试剂生成了新的 Al–C 键。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) relating to, containing, or derived from an aluminyl group.","zh":"（化学）与 aluminyl（铝基负离子）有关的；含有或来源于 aluminyl 基团的。"},"examples":[{"en":"They reported an aluminyl complex supported by a bulky ligand.","zh":"他们报道了一种由体积庞大配体稳定的 aluminyl 配合物。"},{"en":"Aluminyl species are often stabilized by specific counterions.","zh":"aluminyl 物种常通过特定对离子来稳定。"}]}],"synonyms":["aluminyl anion","aluminum-centered anion","aluminium-centered anion"],"phonetic":"/əˈluːmɪnɪl/","extraExplanation":["“aluminyl”是近年无机/有机金属文献中较常见的术语，通常特指低价态、强反应性的“铝中心阴离子”片段，而不只是泛指“含铝的”。它的用法有点类似于“boryl（硼基阴离子）”。","在写作中常见搭配：aluminyl anion（铝基阴离子）、aluminyl complex（铝基配合物）、aluminyl reagent（铝基试剂）。不同论文对其具体结构式写法会随配体（R 或配位环境）而变化。"]}
{"word":"alumish","summary":{"en":"“Alumish” is a rare adjective meaning “alum-like” (slightly bitter/astringent, like alum).","zh":"“alumish”是个很少见的形容词，意思是“像明矾的”（带点苦、发涩/收敛的感觉）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) having the qualities of alum; resembling alum (a mineral salt often used as an astringent).","zh":"（罕见）具有明矾的特性；像明矾一样的（明矾是一种常用作收敛剂的矿物盐）。"},"examples":[{"en":"The water had an alumish taste, slightly bitter and drying.","zh":"这水有点明矾似的味道，微苦而发涩。"},{"en":"Some old texts describe an alumish solution used for dyeing cloth.","zh":"一些旧文献会提到用于染布的“明矾样”溶液。"}]}],"synonyms":["alum-like","astringent","bitter"],"phonetic":"əˈluːmɪʃ","extraExplanation":["“Alumish”在现代英语中非常少见，多数情况下你会看到更常用的表达：alum-like（像明矾的）、astringent（收敛的/发涩的）、bitter（苦的）。","alum（明矾）在传统用途里常与“收敛、止血、除臭、固色（染布时固定颜色）”等语境有关，所以“alumish”常暗示一种“发涩、干燥、略苦”的感觉。"]}
{"word":"alumite","summary":{"en":"Alumite is an anodized protective coating on aluminum, or aluminum with that finish.","zh":"Alumite 指铝的阳极氧化保护层，或指带这种表面处理的铝材/涂层。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a protective, hard anodized coating on aluminum (or aluminum that has been given this coating); also used as a trade name for anodized aluminum finishes.","zh":"（铝表面的）阳极氧化硬质保护层；也可指经过这种阳极氧化处理的铝材/表面（常作商标名或商品名使用）。"},"examples":[{"en":"The flashlight body is alumite, so it resists scratches and corrosion.","zh":"这个手电筒外壳是 alumite（阳极氧化铝表面），所以更耐刮也更防腐蚀。"},{"en":"They chose an alumite finish to protect the aluminum parts outdoors.","zh":"他们选择了 alumite 的表面处理来保护户外使用的铝制零件。"}]}],"synonyms":["anodized aluminum","anodized finish","hard anodizing"],"phonetic":"ˈæl.jəˌmaɪt","extraExplanation":["“Alumite”常见于产品说明、五金/工具、户外装备等语境，表示铝材经过阳极氧化（anodizing）形成的氧化铝保护层。不同厂商可能把它当作商标或商品名使用，因此在技术文档里更常见的通用说法是 “anodized aluminum / anodized finish”。"]}
{"word":"alumium","summary":{"en":"“Aluminum” is a light metal widely used in everyday products and industry; the misspelling “alumium” should be “aluminum” (US) or “aluminium” (UK).","zh":"“aluminum”指一种常用的轻金属；你写的“alumium”应为美式“aluminum”或英式“aluminium”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A light, silver-colored metal used to make things like cans, foil, airplanes, and window frames.","zh":"一种轻的银白色金属，常用于制造易拉罐、铝箔、飞机和窗框等。"},"examples":[{"en":"This can is made of aluminum and can be recycled.","zh":"这个易拉罐是铝制的，可以回收。"},{"en":"Wrap the food in aluminum foil to keep it fresh.","zh":"用铝箔把食物包起来以保持新鲜。"}]}],"synonyms":["Al (chemical symbol)"],"phonetic":"/əˈluːmɪnəm/","extraExplanation":["你输入的 **alumium** 常见是拼写错误，正确拼写（美式）是 **aluminum**。英式拼写通常是 **aluminium**（多一个 i）。","发音差异也与拼写有关：美式 *aluminum* 通常四个音节；英式 *aluminium* 通常五个音节。"]}
{"word":"alumna","summary":{"en":"An alumna is a woman who graduated from a particular school or university.","zh":"alumna 指某所学校或大学的女校友、女毕业生。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman who has graduated from a particular school, college, or university (female form of “alumnus”)","zh":"（某校的）女校友；女毕业生（“alumnus”的女性形式）"},"examples":[{"en":"She is an alumna of Harvard University.","zh":"她是哈佛大学的女校友。"},{"en":"The university invited an alumna to speak to current students about her career.","zh":"学校邀请了一位女校友来给在校学生做职业分享。"}]}],"synonyms":["female graduate","(female) former student","alumnus (male form)","alumni (often used as gender-neutral plural)"],"phonetic":"/əˈlʌmnə/","extraExplanation":["“Alumna”来自拉丁语，原意与“被培养、被养育”有关，因此后来用来指“受过某校培养的人”。\n复数形式：alumnae（常见于正式写作或学校文件）。\n在现代英语中，很多学校或组织也会用更中性的“alumni”来泛指所有校友（不分性别），尤其在美国校园语境里很常见。"]}
{"word":"alumnae","summary":{"en":"Alumnae is the plural form for female graduates or former female students of a school; many contexts also use the gender-neutral plural alumni.","zh":"Alumnae 指“女校友/女毕业生”的复数；很多场合也会用更中性的 alumni 泛指所有校友。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Female graduates of a school, college, or university (plural).","zh":"某所学校/学院/大学的女校友、女毕业生（复数）。"},"examples":[{"en":"The alumnae returned to campus for the reunion weekend.","zh":"女校友们返校参加校友重聚周末活动。"},{"en":"The scholarship is funded by the college’s alumnae association.","zh":"这项奖学金由该学院的女校友会资助。"}]},{"partOfSpeech":"n.","definition":{"en":"Women who used to attend a particular school (not necessarily graduated), in formal usage (plural).","zh":"（较正式用法）曾就读于某校的女性（不一定毕业）（复数）。"},"examples":[{"en":"The museum talk was organized by alumnae of the arts program.","zh":"这场博物馆讲座由艺术项目的女校友/旧生组织。"}]}],"synonyms":["alumni (gender-neutral, common)","former female students (plain English)","women graduates"],"phonetic":"/əˈlʌmni/","extraExplanation":["“alumnae”来自拉丁语：单数是“alumna”（一位女校友），复数是“alumnae”。对应男性：单数“alumnus”，复数“alumni”。在现代英语里，很多学校/组织也会用更中性的“alumni”来指所有校友，不分性别。","发音提示：结尾“-ae”在英语中常读作 /i/（类似“ee”音），所以“alumnae”读起来像“alum-nee”。"]}
{"word":"alumnal","summary":{"en":"Alumnal means “autumnal”: relating to the season of autumn (fall).","zh":"alumnal 意为“秋天的”，与 autumnal 同义，较偏书面/文学用法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to autumn (fall), especially in a way that suggests the season’s colors, weather, or mood.","zh":"秋天的；与秋季有关的（常带有秋色、秋意或秋天气氛的联想）。"},"examples":[{"en":"We went for an alumnal walk under trees turning red and gold.","zh":"我们在红黄相间的树下进行了一次充满秋意的散步。"},{"en":"The lake looked calm in the alumnal light.","zh":"湖面在秋日的光线下显得很宁静。"}]}],"synonyms":["autumnal","fall","harvest-season (contextual)"],"phonetic":"/ɔˈtʌmnəl/","extraExplanation":["“alumnal”较为书面、偏文学化，日常更常用的是“autumnal”。两者意思相同，都是“秋天的”。","词源上来自拉丁语 autumnus（秋天）。在诗歌或散文中，它常用来营造一种略带清冷、沉静或怀旧的季节氛围。"]}
{"word":"alumni","summary":{"en":"“Alumni” usually means a group of graduates (former students) of a school; in everyday English it’s also sometimes used loosely for one graduate.","zh":"alumni 通常指某校的一群毕业生/校友；在日常英语里也有时被宽泛地用来指一位校友。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who have graduated from a particular school, college, or university (treated as a plural noun in common use).","zh":"（常作复数）某所学校、学院或大学的毕业生、校友（通常指一群人）。"},"examples":[{"en":"The university invited alumni back for homecoming weekend.","zh":"大学邀请校友返校参加返校周末活动。"},{"en":"Our alumni network helps recent graduates find jobs.","zh":"我们的校友网络帮助应届毕业生找工作。"}]},{"partOfSpeech":"n.","definition":{"en":"A former student or graduate of a particular school (singular use; often written as “alumnus” for a man or “alumna” for a woman, but “alumni” is commonly used in everyday English).","zh":"某所学校的前学生或毕业生（单数；传统上男性用 alumnus、女性用 alumna，但日常英语中也常用 alumni 泛指）。"},"examples":[{"en":"She is an alumna of Harvard University.","zh":"她是哈佛大学的校友（女校友）。"},{"en":"He’s an alumnus of the same high school as me.","zh":"他和我同一所高中毕业。"},{"en":"Many alumni donate to support scholarships.","zh":"许多校友捐款支持奖学金。"}]}],"synonyms":["graduates","former students","alums"],"phonetic":"/əˈlʌmnaɪ/","extraExplanation":["“Alumni”来自拉丁语：alumnus（男校友/毕业生，单数）、alumna（女校友/毕业生，单数）、alumni（男或混合性别，复数）、alumnae（全为女性，复数）。不过在现代英语里，很多学校与媒体会用更中性的说法：alum（口语，单数）/ alumni（复数）或 graduates（毕业生）。","用法提示：在正式写作中，若强调性别或语法严格性可用 alumnus/alumna；在一般对话或不强调性别时，用 alumni（尤其指群体）最常见。"]}
{"word":"alumni association","summary":{"en":"a graduates’ organization connected to a school","zh":"与学校相关的毕业生组织（校友会）"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"an organization for graduates (former students) of a school or university, often for networking, events, fundraising, and staying connected","zh":"校友会：由某学校/大学的毕业生（旧生）组成的组织，常用于联络感情、举办活动、人脉交流与募款等"},"examples":[{"en":"The alumni association hosts a reunion every spring.","zh":"校友会每年春天都会举办校友聚会。"},{"en":"She joined the alumni association to network with graduates in her field.","zh":"她加入校友会，想和同领域的校友建立人脉。"},{"en":"Donations through the alumni association help fund student scholarships.","zh":"通过校友会的捐款有助于资助学生奖学金。"}]}],"synonyms":["alumni group","alumni network","alumni organization","graduates' association","old boys' association"],"phonetic":"/əˈlʌm.naɪ əˌsoʊ.siˈeɪ.ʃən/","extraExplanation":["在美式英语里，alumni 常被当作性别中性的复数“校友们”；也有人用 alumnus（男单数）、alumna（女单数）、alumnae（女复数）。日常写作中最常见的是 alumni（复数）和 alumnus/alumna（单数）。","在美国校园文化中，alumni association 往往不仅办活动，还会参与筹款（fundraising）、职业发展（career services）、给在校生提供资源等。"],"etymology":"alumni 是拉丁语 alumnus（男）/ alumna（女）的复数，原意与“被养育的人、学生”有关；association 来自拉丁语 associāre，表示“联合、结社”。合起来就是“校友组成的社团/组织”。","mnemonic":["把 alumni 联想成“老（lǎo）-友（you）-你（ni）”：老同学/校友；association 就是“社团/协会”，合起来=校友会。","association 里有 associate（结交、建立联系），校友会的核心功能之一就是“联系校友”。"]}
{"word":"alumniate","summary":{"en":"“Alumniate” is a rare word meaning the collective body of alumni, or (as a verb) to make someone an alumnus by graduating them.","zh":"“Alumniate”是个罕见词，可指“全体校友/校友群体”，也可作动词表示“使人成为校友（使其毕业）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A group or body of alumni; the alumni of an institution considered collectively.","zh":"（罕见）校友群体；某机构的全体校友（统称）。"},"examples":[{"en":"The university’s alumniate funds scholarships for first-generation students.","zh":"这所大学的校友群体为第一代大学生提供奖学金。"},{"en":"He stayed active in the alumniate after graduation.","zh":"毕业后他仍积极参与校友群体的活动。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare) To make someone an alumnus/alumna; to bring someone into the status of alumnus/alumna (that is, to graduate them).","zh":"（罕见）使某人成为校友；使获得“校友”身份（即使其毕业）。"},"examples":[{"en":"Over a century, the school has alumniated thousands of teachers.","zh":"一个多世纪以来，这所学校培养并“毕业”了成千上万名教师。"},{"en":"The program aims to alumniate students with strong community ties.","zh":"该项目旨在培养毕业后与社区保持紧密联系的学生。"}]}],"synonyms":["alumni","alumni body","alumni association","graduates","graduate"],"phonetic":"/əˈlʌmniˌeɪt/","extraExplanation":["“alumniate”非常少见，更常用的表达是“alumni”（校友们/校友群体）、“the alumni body”（校友团体）、“alumni association”（校友会）。写作或正式场合中若用“alumniate”，通常是为了强调“校友作为一个整体”或带一点文雅/复古的语感。","词源上与拉丁语“alumnus”（受养育者、学生，后引申为毕业生/校友）同根。现代英语里与其对应的常见动词通常用“graduate”或“produce graduates”来表达。"]}
{"word":"Alumnol","summary":{"en":"“Alumnol” is likely a misspelling of “alumnus,” meaning a former student (an alumnus; plural: alumni).","zh":"“Alumnol”很可能是“alumnus”的拼写错误，意思是“校友/毕业生”（复数：alumni）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A former student of a school, college, or university.","zh":"（学校、学院或大学的）校友；毕业生（指曾在该校就读的人）。"},"examples":[{"en":"She is an alumnus of Harvard University.","zh":"她是哈佛大学的校友。"},{"en":"The school invited alumni back for a reunion.","zh":"学校邀请校友返校参加聚会。"}]}],"synonyms":["graduate","former student","alum (informal)"],"phonetic":"/əˈlʌmnəs/","extraExplanation":["“Alumnol”不是常见英语单词，最可能是拼写错误，想写的是 alumnus（单数）/ alumni（复数）。","用法小提示：alumnus 常指男性校友；alumna 常指女性校友；alumni 是复数（也常作为泛指的复数）；alumnae 是女性复数。在现代英语里，很多场合会用 gender-neutral 的 alumni（复数）或 alum（非正式，单复数都有人用）。"]}
{"word":"alumnol","summary":{"en":"“Alumnol” isn’t a standard English word; it’s probably meant to be “alumnus/alumna/alumni,” meaning a former student or graduate of a school.","zh":"“alumnol”不是标准英语词；多半想写“alumnus/alumna/alumni”，意思是某学校的校友或毕业生。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Likely a misspelling of “alumnus” (male graduate) or “alumna” (female graduate); “alumni” is the plural form.","zh":"很可能是“alumnus（男校友/男毕业生）”或“alumna（女校友/女毕业生）”的拼写错误；“alumni”是复数形式（校友们/毕业生们）。"},"examples":[{"en":"After graduation, he became an alumnus of UCLA.","zh":"毕业后，他成为加州大学洛杉矶分校（UCLA）的一名校友。"},{"en":"The school invited alumni back for a reunion.","zh":"学校邀请校友们回校参加聚会。"}]}],"synonyms":["alum","graduate","former student"],"phonetic":"/əˈlʌmnəs/","extraExplanation":["“alumnus/alumna/alumni”来自拉丁语，原意和“养育、培养”有关，因此常用于指“受某校培养的人”。","现代英语里，很多场合会用更中性的说法“alum”（口语）或直接用“alumni”泛指校友群体（不严格区分性别）。"]}
{"word":"alumnus","summary":{"en":"An alumnus is a graduate (or former member) of a school, college, or sometimes another organization.","zh":"alumnus 指某所学校/大学的毕业生、校友（传统上偏男性），也可指某组织或项目的前成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person (traditionally male) who has graduated from a particular school, college, or university; now often used for any graduate.","zh":"（传统上指男性）某所学校/学院/大学的毕业生、校友；如今也常泛指任何毕业生/校友。"},"examples":[{"en":"He is an alumnus of Stanford University.","zh":"他是斯坦福大学的校友。"},{"en":"The school invited alumni and current students to the reunion.","zh":"学校邀请校友和在校生参加返校活动。"}]},{"partOfSpeech":"n.","definition":{"en":"A former member of an organization, program, or group (not only a school).","zh":"（不只限学校）某个组织、项目或团体的前成员。"},"examples":[{"en":"She’s an alumna of the volunteer program and now mentors new members.","zh":"她是该志愿者项目的前成员，现在在指导新成员。"}]}],"synonyms":["graduate","former student","alum","ex-member"],"phonetic":"/əˈlʌmnəs/","extraExplanation":["“alumnus”来自拉丁语，原意是“被养育的人”，后来引申为“受某校培养的人”。女性传统形式是“alumna”，复数分别是“alumni”（常被当作男女混用的复数）和“alumnae”（女性复数）。","在现代英语里，口语和写作中常见更中性的用法：单数用“alum”（非正式），或直接用“alumni”泛指校友群体。正式场合仍常见“alumnus/alumna”。"]}
{"word":"alumohydrocalcite","summary":{"en":"Alumohydrocalcite is a rare hydrated calcium–aluminum carbonate mineral.","zh":"Alumohydrocalcite（铝水钙石）是一种罕见的含水钙—铝碳酸盐矿物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare white mineral (a hydrated calcium aluminum carbonate) that can form as a secondary deposit in caves and other moist environments.","zh":"一种罕见的白色矿物（含水的钙—铝碳酸盐），常作为次生矿物在洞穴等潮湿环境中形成。"},"examples":[{"en":"Alumohydrocalcite may appear as soft, powdery white coatings on cave walls.","zh":"铝水钙石可能以柔软、粉状的白色薄层出现在洞穴壁上。"},{"en":"The sample was identified as alumohydrocalcite based on its chemistry and crystal habit.","zh":"该样品根据其化学成分和晶体形态被鉴定为铝水钙石。"}]}],"synonyms":["aluminohydrocalcite"],"phonetic":"/ˌæljuːmoʊˌhaɪdroʊˈkæl.saɪt/","extraExplanation":["这个词在日常英语中极少见，主要出现在矿物学、地球化学和洞穴沉积（speleo- deposits）相关的学术或科普语境里。","拼写上有时会看到变体 aluminohydrocalcite（多了一个 -ni-），不同资料可能采用不同标准；检索资料时可以两种拼写都试试。","构词上可拆为 alumo-（与铝 aluminum 相关）+ hydro-（与水/含水 hydrated 相关）+ calcite（方解石/钙质碳酸盐相关），有助于从词形推测大意。"]}
{"word":"alumroot","summary":{"en":"Alumroot is a garden plant (Heuchera), grown mainly for colorful leaves and small flowers.","zh":"Alumroot 指矾根（Heuchera），一种常见观赏植物，以彩叶和小花著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a perennial garden plant (genus *Heuchera*) with ruffled leaves and small bell-shaped flowers, often grown for its colorful foliage; also called *coral bells*.","zh":"矾根（*Heuchera* 属多年生花卉），常用于园艺观赏，以色彩丰富的叶片和小铃状花著名；也常称“珊瑚铃”（coral bells）。"},"examples":[{"en":"She planted alumroot along the shady path for its purple leaves.","zh":"她在阴凉的小路旁种了矾根，因为它的紫色叶子很好看。"},{"en":"Alumroot is popular in landscaping because it tolerates partial shade.","zh":"矾根在景观设计中很受欢迎，因为它耐半阴环境。"}]}],"synonyms":["coral bells","Heuchera"],"phonetic":"/ˈæləmˌruːt/","extraExplanation":["“alumroot”这个名字来自早期人们用其根部（含单宁等成分）制作收敛性草药，传统上用于帮助止血、缓解轻微炎症等；但现代主要作为观赏植物栽培。","园艺语境里，你也会更常看到它的属名 *Heuchera* 或通俗名 *coral bells*（珊瑚铃）。不同品种的叶色变化很大，如绿色、紫色、银色、橙色等。"]}
{"word":"alumroots","summary":{"en":"Alumroots are *Heuchera* plants grown for decorative leaves and small flowers; the root was also used historically as an astringent herb.","zh":"Alumroots 指矾根属（*Heuchera*）的观赏植物，多以彩叶和小花著称；其根部也曾在传统草药中作为收敛剂使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a perennial garden plant (genus *Heuchera*) with small bell-shaped flowers and attractive foliage; often grown as an ornamental.","zh":"一种多年生庭院植物（矾根属 *Heuchera*），开小钟形花、叶色多变，常作观赏植物栽培。"},"examples":[{"en":"She planted alumroots along the shady path for their colorful leaves.","zh":"她在阴凉的小路旁种了几株矾根，主要看它们多彩的叶子。"},{"en":"Alumroots do well in partial shade and well-drained soil.","zh":"矾根适合半阴环境和排水良好的土壤。"}]},{"partOfSpeech":"n.","definition":{"en":"the dried root of alumroot, traditionally used in herbal medicine as an astringent (to tighten tissue and reduce bleeding).","zh":"矾根的干燥根部，传统草药中常作收敛剂（使组织收紧、减少出血）。"},"examples":[{"en":"In some older herbal guides, alumroot is mentioned as an astringent herb.","zh":"在一些较早的草药书里，矾根被提到可作收敛性药草。"}]}],"synonyms":["alumroot","coral bells","heuchera"],"phonetic":"/ˈæləmˌruːt/","extraExplanation":["“alumroot”之名与“alum（明矾）”有关，主要因为其根部味涩、具收敛性，让人联想到明矾的收敛效果；并不表示它含有明矾。","园艺语境里更常说“coral bells（珊瑚铃）”，这也是矾根属（*Heuchera*）的常见俗名；不同品种叶色从紫红到青柠绿很丰富。","你输入的“alumroots”是复数形式；单数是“alumroot”。"]}
{"word":"alums","summary":{"en":"“Alums” most often means former students (informal plural of alum), but it can also mean types of “alum” salts in chemistry.","zh":"“alums”最常指校友（alum 的非正式复数），也可指化学上的多种明矾/铝盐。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Former students or graduates of a school, college, or program; plural of “alum” (= alumnus/alumna).","zh":"（非正式）某所学校/大学/项目的校友；“alum”（= alumnus/alumna）的复数。"},"examples":[{"en":"Many alums came back for homecoming weekend.","zh":"很多校友返校参加校友返校周末活动。"},{"en":"Our alums often mentor current students.","zh":"我们的校友经常指导在校学生。"},{"en":"The university newsletter features successful alums.","zh":"大学通讯会报道成功校友的故事。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “alum”: a chemical salt (often potassium alum) used in water purification, dyeing, and sometimes as an astringent in skin products.","zh":"“alum”的复数：一种化学盐（常见为钾明矾），用于净水、染色等，也有时作为收敛剂用于皮肤用品。"},"examples":[{"en":"The lab stored several alums for different experiments.","zh":"实验室存放了几种明矾用于不同实验。"},{"en":"Some traditional methods use alums to help clarify water.","zh":"一些传统方法会用明矾帮助澄清水。"}]}],"synonyms":["alumni","former students","graduates","ex-students"],"phonetic":"/ˈæləmz/","extraExplanation":["“alums”最常见的意思是“校友们”，属于口语/非正式写法；正式场合常用“alumni”（男性或混合性别复数）或“alumnae”（女性复数）。","注意不要把“alums”（校友）和“alums”（明矾/化学品）混淆：语境通常会提示——谈学校、捐赠、活动多半是校友；谈实验、净水、染色多半是化学品。"]}
{"word":"alumstone","summary":{"en":"Alumstone is an alum-containing stone or crystal used mainly as an astringent (especially after shaving) and sometimes in traditional dyeing/tanning.","zh":"Alumstone 指含明矾的石块/晶体，主要用作收敛止血（常见于刮胡子后）并可用于传统染色与制革。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A mineral rock or hard lump containing alum (usually potassium alum), traditionally used as an astringent (to tighten skin/stop small bleeding) and as a mild deodorant.","zh":"一种含明矾（多为钾明矾）的矿石或硬块，传统上用作收敛剂（紧致皮肤、止小出血）以及温和的除臭用品。"},"examples":[{"en":"He rubbed an alumstone on the small cut after shaving to stop the bleeding.","zh":"他刮完胡子后用明矾石擦在小伤口上止血。"},{"en":"Some people use alumstone as a natural deodorant.","zh":"有些人把明矾石当作天然除臭剂使用。"}]},{"partOfSpeech":"n.","definition":{"en":"A naturally occurring alum-bearing stone historically used in dyeing and tanning to help fix color or treat leather.","zh":"一种天然含明矾的石料，历史上用于染色和制革，帮助固色或处理皮革。"},"examples":[{"en":"In older dyeing methods, alumstone helped the dye bind to the fabric.","zh":"在较早的染色工艺中，明矾石能帮助染料附着在布料上。"}]}],"synonyms":["alum stone","alum block","alum crystal","styptic stone"],"phonetic":"/əˈlʌmˌstoʊn/","extraExplanation":["“Alumstone”常见写法也有分开写的“alum stone”。日常英语里更常说“alum (block/crystal)”，指那种透明或半透明的明矾晶体块，用作剃须后止血（styptic）或除臭。","使用情境上，它多见于传统理容（barbershop）或“自然护理”产品介绍中；现代医学场景一般会用更明确的止血/消毒用品。"]}
{"word":"Alundum","summary":{"en":"Alundum is a very hard man-made alumina (aluminum oxide) used for grinding and heat-resistant industrial materials.","zh":"Alundum 指一种非常坚硬的人造氧化铝材料，常用于研磨磨料和耐高温工业材料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hard, artificial form of alumina (aluminum oxide) used as an abrasive and in refractory (heat-resistant) materials; originally a brand name.","zh":"一种人造的氧化铝（刚玉类材料），非常坚硬，常用作磨料以及耐火（耐高温）材料；最初为商标名。"},"examples":[{"en":"The workshop used Alundum wheels to grind metal parts smoothly.","zh":"这家车间用 Alundum 砂轮来把金属零件磨得更光滑。"},{"en":"Alundum bricks can withstand very high temperatures in industrial furnaces.","zh":"Alundum 耐火砖能在工业炉中承受很高的温度。"}]}],"synonyms":["alumina","aluminum oxide","fused alumina"],"phonetic":"əˈlʌndəm","extraExplanation":["“Alundum”最早是美国公司使用的商标名，常指“熔融氧化铝/人造刚玉”这种材料；在一些行业语境里会被当作普通名词使用。","它通常呈结晶颗粒或陶瓷制品形态，特点是硬度高、耐磨、耐高温，因此常见于砂轮、砂纸、耐火衬里等。"]}
{"word":"alundum","summary":{"en":"Alundum is a very hard aluminum-oxide abrasive used for grinding and polishing.","zh":"Alundum 指一种以氧化铝为主的硬质人造磨料，用于打磨和抛光。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hard, synthetic abrasive made mainly of aluminum oxide (fused alumina), used for grinding wheels, sandpaper, and polishing.","zh":"一种坚硬的人造磨料，主要成分为氧化铝（熔融刚玉），用于砂轮、砂纸与抛光。"},"examples":[{"en":"The machinist dressed the grinding wheel and then used an alundum stone to smooth the edge.","zh":"机械师修整了砂轮，然后用氧化铝磨石把边缘磨光。"},{"en":"Alundum abrasive paper is useful for sanding metal and removing rust.","zh":"氧化铝砂纸适合打磨金属并去除锈迹。"}]}],"synonyms":["aluminum oxide","alumina","fused alumina","corundum (abrasive)"],"phonetic":"/əˈlʌndəm/","extraExplanation":["“Alundum”最初是一个商品名（商标），在工程、加工语境中常被当作普通名词使用，泛指“氧化铝磨料/熔融刚玉”。","常见搭配：alundum wheel（氧化铝砂轮）、alundum stone（氧化铝磨石）。它适合打磨钢铁等较硬材料；而用于石材/混凝土的磨料更常见的是碳化硅（silicon carbide）。"]}
{"word":"aluniferous","summary":{"en":"“Aluniferous” means containing alum or aluminum (alumina), especially in rocks or soils.","zh":"aluniferous 指“含明矾或富含铝/氧化铝的”，多用于岩石、土壤或矿物的描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing alum (aluminum compounds), or rich in alumina/aluminum; often used to describe certain rocks, soils, or minerals.","zh":"含明矾（铝的化合物）的；富含氧化铝/铝的（常用于描述某些岩石、土壤或矿物）。"},"examples":[{"en":"Geologists described the clay layer as aluniferous, suggesting it contained significant aluminum compounds.","zh":"地质学家把这层黏土描述为 aluniferous，表示其中含有较多的铝化合物。"},{"en":"An aluniferous deposit may be processed to obtain alum for industrial use.","zh":"含明矾的（aluniferous）矿床可能会被加工以获取用于工业的明矾。"}]}],"synonyms":["aluminiferous","aluminous","alum-bearing"],"phonetic":"/ˌæljuˈnɪfərəs/","extraExplanation":["这个词比较少见，多见于地质学、采矿和材料相关文献中，用来强调某种物质“含铝/含明矾成分”。更常见、更易见到的近义学术词是 aluminiferous（含铝的、富铝的）。"]}
{"word":"alunite","summary":{"en":"Alunite is a mineral used as a natural source of alum, common in volcanic settings.","zh":"明矾石是一种矿物，是明矾的天然来源，常见于火山相关环境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A mineral (a sulfate of potassium and aluminum) that is a natural source of alum, often found in volcanic areas and used in making chemicals and in water treatment.","zh":"明矾石（一种含钾和铝的硫酸盐矿物），是明矾的天然来源，常见于火山地区，可用于化工生产和水处理等。"},"examples":[{"en":"Alunite can be processed to produce alum for industrial use.","zh":"明矾石可以加工制成用于工业的明矾。"},{"en":"The geologist identified alunite in altered volcanic rock.","zh":"地质学家在蚀变的火山岩中辨认出了明矾石。"}]}],"synonyms":["potassium aluminum sulfate mineral","alum mineral"],"phonetic":"/ˈæl.juˌnaɪt/","extraExplanation":["“alunite”一词来自“alum（明矾）”，因为它是明矾的重要矿物来源之一。在地质学中，明矾石常与火山热液活动有关，出现在岩石被酸性流体蚀变的环境里。"]}
{"word":"alunites","summary":{"en":"“Alunites” is the plural of “alunite,” a volcanic-related mineral sometimes used as a source of alum or aluminum.","zh":"“Alunites”是“alunite（明矾石）”的复数，指一种与火山相关的矿物，有时可作为明矾或铝的来源。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mineral (hydrated potassium aluminum sulfate) that often forms in volcanic rocks and is sometimes used as a source of alum or aluminum.","zh":"一种矿物（含水的钾铝硫酸盐），常形成于火山岩相关环境中，有时可作为明矾或铝的来源。"},"examples":[{"en":"The geologist found alunites in the altered volcanic ash layer.","zh":"地质学家在蚀变的火山灰层中发现了明矾石。"},{"en":"Some deposits of alunites have been studied for their industrial value.","zh":"一些明矾石矿床因其工业价值而受到研究。"}]}],"synonyms":["alunite","alumstone"],"phonetic":"/ˈæl.jəˌnaɪts/","extraExplanation":["“alunites”是“alunite”的复数形式；中文常译为“明矾石”。","该矿物常与火山作用及热液蚀变有关，因此在地质报告中常与“alteration（蚀变）”“volcanic（火山的）”“deposit（矿床）”等词一起出现。","词源与“alum（明矾）”相关：历史上明矾用于皮革鞣制、染色固色等，因此这种矿物名称也带有“与明矾有关”的含义。"]}
{"word":"alunogen","summary":{"en":"Alunogen is a mineral: hydrated aluminum sulfate, often seen as a whitish crust in dry acidic areas.","zh":"Alunogen 是一种矿物：含水硫酸铝，常在干燥的酸性环境中以白色结壳形式出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A soft, usually white to pale-colored mineral made of hydrated aluminum sulfate (often forming as a crust or coating in dry, acidic environments).","zh":"一种较软、通常呈白色或浅色的矿物，主要成分是含水硫酸铝（常在干燥、酸性环境中形成结壳或薄层）。"},"examples":[{"en":"Alunogen can form as a white crust on rocks near mine openings.","zh":"在矿洞口附近的岩石表面，alunogen 可能会形成白色的结壳。"},{"en":"Because it dissolves easily in water, alunogen is often found in very dry places.","zh":"由于它很容易溶于水，alunogen 常见于非常干燥的地方。"}]}],"synonyms":["hydrated aluminum sulfate"],"phonetic":"/əˈluːnəˌdʒɛn/","extraExplanation":["词源提示：alunogen 与 alum（明矾/铝盐）同源，都与“铝的硫酸盐”相关；但 alum 在日常英语里更常指多种“明矾类”物质的统称，而 alunogen 是更具体的一种矿物名称。","常见环境：它可能出现在含硫矿物风化后的酸性渗出环境（例如煤矿或硫化物矿区的干燥表面），但遇水容易溶解，因此不太耐潮湿。"]}
{"word":"alupag","summary":{"en":"“Alupag” is not recognized as a standard English word; it is likely a name or a non-English term.","zh":"“alupag”不是标准英语词，通常更可能是名字或非英语词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a name (username/surname/place) or a word from another language.","zh":"不是标准英语单词。可能是人名/网名/地名，或来自其他语言的词。"},"examples":[{"en":"My username is Alupag.","zh":"我的用户名是 Alupag。"},{"en":"I saw the word “alupag” in a comment, but it isn’t in English dictionaries.","zh":"我在评论里看到 “alupag”，但它不在英语词典中。"}]}],"phonetic":"/ˈɑluˌpɑɡ/","extraExplanation":["“alupag”很可能不是英语，而是其他语言（例如菲律宾语/他加禄语等）里的词，或是专有名词（昵称、品牌、地名）。如果你把它当作英语单词查含义，通常会查不到。","如果你愿意，把你看到它的完整句子发来（或说明你想表达的意思/语言），我可以帮你判断它是什么词、是否拼写有误，以及最合适的英文对应表达。"]}
{"word":"Alur","summary":{"en":"“Alur” is mainly an Indonesian/Malay noun meaning a channel/groove/track, and in Indonesian it also means a story’s plot or storyline.","zh":"“Alur”主要是印尼语/马来语名词，意为通道/沟槽/轨道；在印尼语中也可指故事的情节或故事线。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Indonesian/Malay) a track, channel, groove, or lane—something long and narrow that guides movement or flow.","zh":"（印尼语/马来语）指“轨道/沟槽/通道/车道”等狭长的路径，用来引导移动或流动。"},"examples":[{"en":"Water flows through the alur between the fields.","zh":"水沿着田地之间的沟渠（alur）流动。"},{"en":"Stay in your alur when you ride a motorcycle on a narrow road.","zh":"在狭窄道路上骑摩托时要保持在自己的车道（alur）里。"}]},{"partOfSpeech":"n.","definition":{"en":"(Indonesian) the plot or storyline of a novel, film, or story.","zh":"（印尼语）指小说、电影或故事的“情节/剧情/故事线”。"},"examples":[{"en":"The alur of the movie is simple but emotional.","zh":"这部电影的剧情（alur）很简单，但很感人。"},{"en":"I like stories with a fast alur.","zh":"我喜欢节奏快、情节推进快的故事。"}]}],"synonyms":["channel","groove","lane","track","plot","storyline"],"phonetic":"/ɑˈlʊr/","extraExplanation":["“Alur”不是常见英文单词，多数情况下是印尼语/马来语词汇。在印尼语里常见搭配是 **alur cerita**（故事情节/剧情线）、**alur sungai**（河道/水道）。","如果你想查的是英文 **allure**（吸引力/诱惑），拼写不同、读音也不同；可以告诉我你具体想查哪个词或出现在哪个句子里。"]}
{"word":"alur","summary":{"en":"“Alur” isn’t a common English word; you may mean “allure,” meaning strong attraction or to attract/tempt.","zh":"“alur”不是常见英语词；你可能想查“allure”，表示“吸引力/诱惑力”或“吸引、引诱”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly intended) the power to attract, interest, or excite someone; a strong, appealing charm.","zh":"（常见想表达的词）吸引力；诱惑力；让人感兴趣或着迷的魅力。"},"examples":[{"en":"The allure of the city is its food, music, and energy.","zh":"这座城市的吸引力在于它的美食、音乐和活力。"},{"en":"Many tourists come for the allure of the beaches.","zh":"很多游客是被海滩的魅力吸引而来的。"}]},{"partOfSpeech":"vt.","definition":{"en":"to attract or tempt someone, often by offering pleasure or advantage.","zh":"吸引；引诱（常通过愉快的体验或好处来诱人）。"},"examples":[{"en":"The ad tries to allure customers with low prices.","zh":"这则广告试图用低价吸引顾客。"},{"en":"She was allured by the idea of studying abroad.","zh":"她被出国留学的想法所吸引。"}]}],"synonyms":["attraction","appeal","charm","temptation","entice","lure"],"phonetic":"/əˈlʊr/","extraExplanation":["“alur”本身不是常见英语单词。很多学习者输入“alur”时，实际想查的是“allure”（拼写相近）。","补充：在印尼语/马来语里，“alur”常指“情节、脉络、流程/流向”（例如故事的“情节线”）。如果你想表达这个意思，用英语常见说法是 plot（情节）或 flow（流程/流动）。"]}
{"word":"Alura","summary":{"en":"Alura is usually a proper name—either a feminine given name or the name of a brand (notably a Brazilian e-learning platform).","zh":"Alura 通常是专有名词：要么是女性名字，要么是品牌名（尤其指巴西的在线学习平台）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A feminine given name (a proper noun), used for people or fictional characters.","zh":"女性名字（专有名词），可用于真人或虚构角色。"},"examples":[{"en":"Alura is my cousin’s name.","zh":"Alura 是我表妹的名字。"},{"en":"In the story, Alura is a brave pilot.","zh":"在故事里，Alura 是一名勇敢的飞行员。"}]},{"partOfSpeech":"other","definition":{"en":"A brand or organization name; commonly refers to Alura, a Brazilian online learning platform (especially for technology and design).","zh":"品牌或机构名称；常指巴西的在线学习平台 Alura（尤其面向科技与设计类课程）。"},"examples":[{"en":"I’m taking a Java course on Alura.","zh":"我在 Alura 上学习 Java 课程。"},{"en":"She uses Alura to practice front-end skills.","zh":"她用 Alura 练习前端技能。"}]}],"synonyms":["(none—proper name)"],"phonetic":"/əˈlʊrə/","extraExplanation":["“Alura”作为名字时，更多属于现代取名风格，常见于英语语境的创作作品或个人名字中；其具体词源并不固定，可能带有“听起来柔和、像自然或魔法元素”的审美取向。","如果你指的是巴西的学习平台“Alura”，在葡语圈（尤其巴西）较常见；在英文对话中通常直接当作品牌名使用，不需要翻译。"]}
{"word":"Alurd","summary":{"en":"“Alurd” is not a standard spelling; it most likely means “allured” = strongly attracted or tempted.","zh":"“Alurd” 不是标准拼写；最可能是 “allured”，意思是“被强烈吸引/被诱惑”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(likely meant “allured”) attracted or tempted strongly by something appealing.","zh":"（很可能是指 allured）被强烈吸引；被诱惑。"},"examples":[{"en":"She felt allured by the bright lights of the big city.","zh":"她被大城市的霓虹灯深深吸引。"},{"en":"I was allured into buying the more expensive version.","zh":"我被诱导去买了更贵的版本。"}]},{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of “allure”) to attract or tempt someone.","zh":"（allure 的过去式/过去分词）吸引；诱惑某人。"},"examples":[{"en":"The advertisement allured customers with huge discounts.","zh":"这则广告用大幅折扣吸引顾客。"},{"en":"He was allured by the promise of easy money.","zh":"他被“轻松赚钱”的承诺所诱惑。"}]}],"synonyms":["attracted","tempted","drawn","enticed"],"phonetic":"/əˈlʊrd/","extraExplanation":["“Alurd” 不是常见的标准英语拼写。最接近且常用的词是 **allured**（动词 allure 的过去式/过去分词），意思是“被吸引/被诱惑”。","如果你想表达“警觉/警报”的意思，可能你要找的是 **alert**（形容词/动词）。你可以告诉我你的句子语境，我可以帮你确认到底是哪一个。"]}
{"word":"alure","summary":{"en":"Allure means “to attract” (verb) or “attractive power/appeal” (noun).","zh":"Allure 表示“吸引/引诱”（动词）或“魅力/吸引力”（名词）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to attract or interest someone strongly, often by offering pleasure, beauty, or advantage","zh":"强烈吸引；引诱（常因快乐、美感或利益而使人心动）"},"examples":[{"en":"The bright lights of the city allure many young people.","zh":"城市的霓虹灯吸引了许多年轻人。"},{"en":"Ads often try to allure customers with big discounts.","zh":"广告常用大折扣来吸引顾客。"}]},{"partOfSpeech":"n.","definition":{"en":"the power or quality of being strongly attractive or interesting","zh":"魅力；吸引力"},"examples":[{"en":"The island’s allure comes from its quiet beaches and clear water.","zh":"这座岛的魅力来自宁静的海滩和清澈的海水。"},{"en":"Despite the risks, the allure of fame is strong.","zh":"尽管有风险，名声的诱惑依然很强。"}]}],"synonyms":["attract","appeal","tempt","entice","charm"],"phonetic":"/əˈlʊr/","extraExplanation":["你输入的“alure”通常是拼写错误；标准拼写是 **allure**。","词源提示：allure 来自法语，含“引到某处/引诱”的意思，所以它既可指中性的“吸引”，也可指带一点“诱惑”的感觉。","常见搭配：**the allure of + 名词**（……的魅力/诱惑）；**allure someone into doing sth**（诱使某人做某事，语气更偏负面）。"]}
{"word":"alurgite","summary":{"en":"Alurgite is a rare purple mica mineral, often a manganese-rich variety of muscovite.","zh":"Alurgite 指一种罕见的紫色云母矿物，常为富锰的白云母变种。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare, purple to reddish-purple variety of mica (usually a manganese-rich muscovite) found in some metamorphic rocks","zh":"一种罕见的紫色到红紫色云母矿物（通常为富锰的白云母变种），可见于部分变质岩中"},"examples":[{"en":"The thin, purple flakes in the rock were identified as alurgite, a manganese-rich mica.","zh":"岩石中那些薄薄的紫色片状物被鉴定为紫云母（alurgite），一种富锰的云母。"},{"en":"Alurgite can appear as shiny sheets, similar to other micas, but with a distinctive purplish color.","zh":"紫云母可能呈现出像其他云母一样的闪亮片状，但带有明显的紫色调。"}]}],"synonyms":["manganese-rich muscovite","purple mica"],"phonetic":"/əˈlɝːdʒaɪt/","extraExplanation":["“alurgite”在日常英语中极少使用，更多出现在矿物学/地质学语境里；学习时可把它理解为“紫色的云母（常与锰有关）”。","词源上常被认为与希腊语中表示“紫色/紫染”的词根有关，用来强调这种矿物的紫红色外观。"]}
{"word":"Alurta","summary":{"en":"“Alurta” is not a common English word; it is likely a name/brand or a misspelling (often of “alert”).","zh":"“Alurta”不是常见英语单词；更可能是专有名词/品牌名，或拼写误差（常见为“alert”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English vocabulary word. It is most likely a proper name (e.g., a person, company, product) or a misspelling/variant of another word (often “alert”).","zh":"不是标准英语词汇。更可能是专有名词（如人名、公司名、产品名），或是其他单词的拼写误差/变体（常见为“alert”）。"},"examples":[{"en":"I couldn’t find “Alurta” in a dictionary—could it be a brand name?","zh":"我在词典里找不到“Alurta”——它会不会是品牌名？"},{"en":"Did you mean “alert” (a warning) instead of “Alurta”?","zh":"你是想写“alert”（警报/提醒）而不是“Alurta”吗？"}]}],"synonyms":["alert (possible intended word)","warning","notice","alarm"],"phonetic":"/əˈlɝːtə/","extraExplanation":["如果你是在阅读某段文字或看到某个产品/APP/公司名，请把上下文句子贴出来，我可以帮你判断它是专有名词、拼写错误，还是某种外来语/创作词。","如果你本来想查的是 **alert**：它常用作名词表示“警报/提醒”，作形容词表示“警觉的/机警的”。你也可以确认一下拼写是否为 alert。"]}
{"word":"alushtite","summary":{"en":"A rare English term meaning a person from Alushta (Crimea) or something related to Alushta.","zh":"较少见的英语词，指阿卢什塔（克里米亚）人，或与阿卢什塔有关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Alushta (a coastal town in Crimea), or something related to Alushta.","zh":"来自阿卢什塔（克里米亚的一座海滨城镇）的人；或与阿卢什塔有关的事物。"},"examples":[{"en":"She is an Alushtite who moved abroad for university.","zh":"她是阿卢什塔人，后来出国读大学。"},{"en":"The festival features Alushtite music and local food.","zh":"这个节日展示阿卢什塔的音乐和当地美食。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Alushta; from Alushta.","zh":"阿卢什塔的；来自阿卢什塔的。"},"examples":[{"en":"Alushtite traditions are strongly influenced by the Black Sea coast.","zh":"阿卢什塔的传统深受黑海沿岸文化影响。"},{"en":"They tried an Alushtite-style fish dish at the market.","zh":"他们在市场尝了阿卢什塔风味的鱼料理。"}]}],"synonyms":["resident of Alushta","from Alushta","Alushta resident"],"phonetic":"/əˈluːʃtaɪt/","extraExplanation":["“Alushtite”是一个较少见的英语称呼，主要作为地名 Alushta（阿卢什塔）的居民称谓（demonym）或形容词使用。日常英文里更常见的表达是“a resident of Alushta / from Alushta”。","阿卢什塔位于克里米亚南岸（黑海沿岸）。由于克里米亚的政治地位在国际上存在争议，在正式写作中可用更中性的说法，如“Alushta, Crimea”并根据语境补充说明。"]}
{"word":"aluta","summary":{"en":"“Aluta” means a protest or struggle (often student activism), and is famous in the slogan “Aluta continua” (“the struggle continues”).","zh":"“Aluta”指抗争/抗议/罢工（常指学生运动），并常见于口号“Aluta continua”（抗争继续）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(West African English, informal) a protest, strike, or political struggle—especially student activism.","zh":"（西非英语，非正式）抗争、抗议或罢工，尤指学生运动/校园政治斗争。"},"examples":[{"en":"The students declared an aluta against the new tuition fees.","zh":"学生们发起了一场“aluta”，反对新的学费政策。"},{"en":"During the aluta, lectures were suspended for a week.","zh":"在这次“aluta”期间，课程停了一周。"},{"en":"He became known on campus for organizing aluta meetings.","zh":"他因在校园组织“aluta”集会而出名。"}]},{"partOfSpeech":"phrase","definition":{"en":"(Often in the slogan “Aluta continua”) the idea that the struggle/protest must keep going.","zh":"（常见于口号“Aluta continua”）“斗争/抗争要继续”的观念或号召。"},"examples":[{"en":"After the negotiations failed, the crowd shouted, “Aluta continua!”","zh":"谈判失败后，人群高喊：“Aluta continua！”（抗争继续！）"},{"en":"For many activists, “Aluta continua” is a reminder not to give up.","zh":"对许多行动者来说，“Aluta continua”是在提醒自己不要放弃。"}]}],"synonyms":["protest","strike","struggle","activism","demonstration"],"phonetic":"/əˈluːtə/","extraExplanation":["“Aluta”在很多西非国家的校园语境里很常见，常与学生会、罢课、示威等联系在一起。","它经常出现在口号“Aluta continua”（抗争继续）中；该口号在非洲反殖民与社会运动语境里很有辨识度。","“Aluta”并非标准英语里的常用词，更像地区性用法/口语借词；在正式写作中可用 protest, strike, struggle, activism 等替换。"]}
{"word":"alutaceous","summary":{"en":"Alutaceous describes a tawny, yellowish-brown, leather-like color.","zh":"Alutaceous 指黄褐色、偏黄棕、带皮革质感的颜色。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a tawny, yellowish-brown color (like tanned leather).","zh":"呈黄褐色/皮革般的黄棕色（像鞣制过的皮革颜色）。"},"examples":[{"en":"The desert at sunset turned an alutaceous shade.","zh":"夕阳下的沙漠变成了黄褐色。"},{"en":"The manuscript pages had an alutaceous tone with age.","zh":"这份手稿的纸页因年代久远呈现出黄褐色。"}]}],"synonyms":["tawny","tan","yellowish-brown","ochre"],"phonetic":"/ˌæl.jəˈteɪ.ʃəs/","extraExplanation":["“alutaceous”是非常少见的文学/学术用词，更多见于描写颜色的写作或博物学（自然观察）语境。","词源上与拉丁语中表示“皮革”的词有关，因此它强调“像皮革一样的黄褐色”，比一般的“brown”更偏黄、更带“皮革感”。","写作中更常用的近义表达有：tawny（黄褐色的）、tan（棕褐色的/晒黑的）、yellowish-brown（黄棕色的）。"]}

