{"word":"Alva","summary":{"en":"Alva is most commonly a personal name; it can also be a place name in several English-speaking regions.","zh":"Alva 最常见是人名；也可以是英语地区的一些地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (used for any gender, but often feminine today).","zh":"人名（可用于男女，但现代更常见作女性名）。"},"examples":[{"en":"Alva is starting a new job next Monday.","zh":"Alva 下周一开始新工作。"},{"en":"I met Alva at the library after class.","zh":"下课后我在图书馆遇到了 Alva。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name (e.g., Alva in Scotland; Alva, Florida in the U.S.).","zh":"地名（例如苏格兰的 Alva；美国佛罗里达州的 Alva）。"},"examples":[{"en":"They took a short trip to Alva in Scotland.","zh":"他们去苏格兰的 Alva 短途旅行。"},{"en":"Alva, Florida is known for its quiet, rural feel.","zh":"佛罗里达州的 Alva 以安静的乡村氛围闻名。"}]}],"synonyms":["Alvah (variant spelling)","Alvin (related name)"],"phonetic":"/ˈælvə/","extraExplanation":["“Alva”常见为名字，北欧语源的解释较多，常与古诺斯语中表示“精灵/超自然存在”的词根相关，因此在一些文化里带有“神秘、灵动”的联想。","在英语语境里，你可能见过“Thomas Alva Edison”（托马斯·阿尔瓦·爱迪生）这样的用法，其中 Alva 是他的中间名（middle name），所以也会出现在历史人物全名中。"]}
{"word":"Alvada","summary":{"en":"Alvada is mainly a proper noun: a small community in Ohio, and more rarely a given name.","zh":"Alvada 主要是专有名词：指俄亥俄州的一个小社区，也较少用作人名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a small unincorporated community in Seneca County, Ohio, United States (used as a place name).","zh":"（美国）俄亥俄州塞内卡县的一个小型非建制社区（地名）。"},"examples":[{"en":"She grew up near Alvada, Ohio, before moving to Columbus.","zh":"她在俄亥俄州阿尔维达（Alvada）附近长大，后来搬到哥伦布市。"},{"en":"The route passes through Alvada on the way to Tiffin.","zh":"这条路线去蒂芬（Tiffin）的路上会经过阿尔维达（Alvada）。"}]},{"partOfSpeech":"other","definition":{"en":"a rare personal name (usually used as a given name) in English-speaking contexts.","zh":"一个较少见的人名（通常作名字），在英语语境中偶尔使用。"},"examples":[{"en":"Alvada is an uncommon name, so people often ask how to spell it.","zh":"Alvada 这个名字比较少见，所以别人常会问怎么拼写。"},{"en":"Her grandmother’s name was Alvada.","zh":"她祖母的名字叫 Alvada。"}]}],"synonyms":["(no close synonyms; proper noun)"],"phonetic":"/ælˈveɪdə/","extraExplanation":["“Alvada”最常见的用法是专有名词（地名或人名），因此在句子里通常要大写：Alvada。","作为地名时，它指的是美国俄亥俄州的一个非建制社区（unincorporated community），意思是它不是一个独立建制的城市/镇，而是一个较小的聚居点，行政上通常由县（county）管理。"]}
{"word":"Alvadore","summary":{"en":"“Alvadore” is mainly used as a proper name (not a common English word).","zh":"“Alvadore”主要作为人名使用（不是常见英语词汇）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A personal name (given name or surname). It is not a standard English vocabulary word, and its meaning depends on the person/family or the specific source using it.","zh":"一个人名（名字或姓氏）。它不是标准英语词汇，含义通常取决于具体人物/家族或使用它的来源。"},"examples":[{"en":"Alvadore Johnson is listed as the author of the report.","zh":"阿尔瓦多尔·约翰逊被列为这份报告的作者。"},{"en":"Have you met Alvadore yet?","zh":"你见过阿尔瓦多尔了吗？"}]}],"phonetic":"/ˈæl.və.dɔr/","extraExplanation":["“Alvadore”在英语里较少见，通常作为专有名词（人名）出现，而不是可查到固定释义的普通词汇。","它有时可能被看作与西班牙语/葡萄牙语姓名“Salvador”（意为“救世主/救助者”）或类似拼写的名字相关的变体，但这并非确定来源；若你是在书名、品牌、地名或特定作品里看到它，含义往往由该作品设定。","如果你愿意提供一句你看到它的原句/出处（例如书名、歌词、对话），我可以更准确判断它是人名、地名、品牌名，还是某个词的拼写变体。"]}
{"word":"Alvah","summary":{"en":"Alvah is mainly a personal name (usually male), and more rarely a place name in the U.S.","zh":"Alvah 主要是人名（通常为男性名），较少情况下也可作美国地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (first name), usually masculine, used in English-speaking contexts.","zh":"人名（名字），在英语语境中使用，通常为男性名。"},"examples":[{"en":"Alvah moved to Chicago for a new job.","zh":"阿尔瓦为了新工作搬到了芝加哥。"},{"en":"My great-grandfather’s name was Alvah.","zh":"我曾祖父名叫阿尔瓦。"}]},{"partOfSpeech":"n.","definition":{"en":"a less common place name in the U.S. (used for some small communities or geographic locations).","zh":"（较少见）美国的一些地名，用于个别小社区或地理地点。"},"examples":[{"en":"They drove through Alvah on their way to the lake.","zh":"他们去湖边的路上开车经过了阿尔瓦。"}]}],"synonyms":["(given name)","(proper noun)"],"phonetic":"/ˈæl.və/","extraExplanation":["“Alvah”常被看作源自希伯来语传统的人名，在《圣经》相关谱系中也能见到该名字的形式（作为人名/族名出现）。在现代英语里它属于较复古、少见的名字。","文化上也有一些知名人物使用该名，例如 Alvah Roebuck（西尔斯 Sears 的联合创办人之一）与 Alvah Bessie（美国作家、编剧）。"]}
{"word":"alvah","summary":{"en":"Alvah is mainly a male first name (sometimes a surname), often linked to a biblical Hebrew origin and explained as meaning “exalted” or “his highness.”","zh":"Alvah 主要是男性名字（有时作姓），常被认为源自《圣经》中的希伯来名字，含义常解释为“尊贵的/崇高的/他的尊荣”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A male given name (first name), used especially in the U.S.; sometimes also used as a family name.","zh":"男性名字（名），在美国较常见；有时也作姓氏。"},"examples":[{"en":"Alvah Johnson moved to Chicago for work.","zh":"阿尔瓦·约翰逊为了工作搬到了芝加哥。"},{"en":"Our guest speaker today is Alvah Reed.","zh":"今天的特邀演讲者是阿尔瓦·里德。"}]},{"partOfSpeech":"other","definition":{"en":"(Name meaning) Often explained as “exalted” or “his highness,” from a Hebrew name found in the Bible.","zh":"（名字含义）常被解释为“尊贵的 / 崇高的 / 他的尊荣”，源自《圣经》中出现的希伯来名字。"},"examples":[{"en":"They chose the name Alvah because of its biblical roots.","zh":"他们选择“Alvah”这个名字是因为它有《圣经》渊源。"},{"en":"Alvah is an old-fashioned name with a dignified meaning.","zh":"Alvah 是一个略带复古感、含义端庄的名字。"}]}],"synonyms":["(related names) Alva","Alvin"],"phonetic":"/ˈæl.və/","extraExplanation":["“Alvah”在英语里主要作为专有名词使用，所以一般不翻译其“词义”，更多是音译为“阿尔瓦”。","在美国历史上较常见于19世纪到20世纪早期，带一点“老派/复古”的感觉；现代仍有人使用但不算热门。","相关文化联想：美国发明家托马斯·爱迪生的全名是 Thomas **Alva** Edison（Alva与Alvah拼写接近，但并非同一个名字）。"]}
{"word":"Alvan","summary":{"en":"Alvan is an uncommon male first name; it also appears as a biblical personal name in some translations.","zh":"Alvan 是较少见的男性名字；在一些《圣经》译本中也作为人名出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name).","zh":"男性名字（名）。"},"examples":[{"en":"Alvan moved to Chicago for his new job.","zh":"阿尔文为了新工作搬到了芝加哥。"},{"en":"My grandfather’s name was Alvan.","zh":"我祖父名叫阿尔文。"}]},{"partOfSpeech":"n.","definition":{"en":"a personal name found in the Bible (a person listed in genealogies).","zh":"《圣经》中出现的人名（家谱/族谱名单里的名字）。"},"examples":[{"en":"In some Bible translations, Alvan appears in the genealogies in Genesis.","zh":"在一些《圣经》译本中，“Alvan”出现在《创世记》的族谱名单里。"}]}],"synonyms":["Alvin","Alvanus"],"phonetic":"/ˈæl.vən/","extraExplanation":["“Alvan”在英语世界里比较少见，常被当作古老或传统风格的男性名字。不同《圣经》译本中，这个人名的拼写可能会有差异（例如出现其他近似拼写），属于音译/转写差别。"]}
{"word":"alvan","summary":{"en":"Alvan is mainly used as a male personal name, sometimes seen as a variant of Alvin.","zh":"Alvan 主要用作男性人名，有时被视为 Alvin 的变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (a personal name), sometimes a variant spelling of Alvin.","zh":"男性名字（人名）；有时是 Alvin 的变体拼写。"},"examples":[{"en":"Alvan is my grandfather’s name.","zh":"Alvan 是我祖父的名字。"},{"en":"The author dedicates the book to Alvan and Maria.","zh":"作者把这本书献给 Alvan 和 Maria。"}]}],"synonyms":["Alvin","Alva (similar-looking name)"],"phonetic":"/ˈæl.vən/","extraExplanation":["“Alvan”在英语里主要作为人名使用，不是常见的普通词汇。发音通常与“Alvin”相近。","名字来源常被认为与“Alvin”有关；“Alvin”在英语姓名传统里有“高贵的朋友/朋友”之类的含义解释（不同资料说法略有差异）。","如果你是在某个句子里看到“alvan”，也可能是拼写错误（如 Alvin, Alva, Alban 等）。你可以把原句发我，我能帮你判断具体指什么。"]}
{"word":"Alvanus","summary":{"en":"Alvanus is a rare proper name, mainly found in historical or literary uses.","zh":"Alvanus 是一个较少见的专有名词人名，多用于历史或文学语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a rare personal name (given name or surname), seen mostly in historical or literary contexts","zh":"一个较少见的人名（名或姓），多见于历史或文学语境"},"examples":[{"en":"In the old parish records, Alvanus appears as a witness to the marriage.","zh":"在旧的教区记录中，Alvanus 作为婚礼见证人出现。"},{"en":"The novel includes a minor character named Alvanus.","zh":"这部小说里有一个名叫 Alvanus 的次要角色。"}]}],"synonyms":["Alvan","Alvin","Alban","Albanus"],"phonetic":"/ælˈveɪnəs/","extraExplanation":["Alvanus 通常被当作专有名词使用，而不是普通英语词汇，所以在现代日常英语中很少遇到。","它看起来像拉丁化（Latinized）的名字形式：有些姓名在历史文献里会被写成带 -us 结尾的形式（类似“拉丁语风格”），常见于学术、宗教或早期欧洲文献记录。","如果你是在某本书、族谱、碑文或古文档里看到 Alvanus，理解为“人名”通常就足够了；具体含义往往要看该人物/家族的语言与背景。"]}
{"word":"Alvar","summary":{"en":"Alvar is mainly a male first name, and sometimes a place name.","zh":"Alvar 主要是男性名字，也可能用作地名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a masculine given name (first name), used especially in Nordic and Spanish-speaking contexts","zh":"男性名字（名），在北欧国家和部分西班牙语文化中较常见"},"examples":[{"en":"Alvar is a common-looking Nordic name, though it’s not very common in the U.S.","zh":"Alvar 看起来很有北欧风格，不过在美国并不算常见。"},{"en":"His name is Alvar, but his friends call him Al.","zh":"他叫 Alvar，不过朋友们叫他 Al。"}]},{"partOfSpeech":"other","definition":{"en":"a place name (used for some towns/areas), depending on the country or region","zh":"地名（某些国家/地区会用作城镇或区域名称）"},"examples":[{"en":"We passed through Alvar on the way to the coast.","zh":"我们去海边的路上经过了 Alvar。"}]}],"synonyms":["Álvar","Alvaro","Alvarus"],"phonetic":"/ˈæl.vɑr/","extraExplanation":["词源小提示：Alvar 常被认为来自古诺斯语（Old Norse）名字元素，常见解释与“精灵/超自然存在（elf）”或“战士（warrior）”等意象相关；不同语言传统可能有不同拼写与来源。","文化联想：著名人物中有芬兰建筑师 Alvar Aalto（阿尔瓦·阿尔托），在现代主义建筑与家具设计中很有影响力。"]}
{"word":"alvar","summary":{"en":"Alvar most commonly means a rare limestone plain habitat; it can also be a male given name.","zh":"Alvar 常指一种稀有的石灰岩裸露平原生态；也可作男性人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flat limestone plain with very thin or no soil, where plants must survive drought in summer and flooding in spring (common in parts of Canada, the Great Lakes region, and the Baltic).","zh":"石灰岩裸露的平原（或台地），土层极薄甚至没有；夏季易干旱、春季易积水，常见于加拿大、五大湖地区及波罗的海周边。"},"examples":[{"en":"They hiked across an alvar where wildflowers grew in cracks in the rock.","zh":"他们穿越一片石灰岩裸露平原，野花在岩石裂缝中生长。"},{"en":"Alvar habitats are rare and need careful protection.","zh":"这种石灰岩裸露平原的栖息地很稀有，需要细致的保护。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name (often masculine), used in several European languages.","zh":"人名（多为男性名），在一些欧洲语言中使用。"},"examples":[{"en":"Alvar studied architecture in college.","zh":"阿尔瓦尔在大学学习建筑。"}]}],"synonyms":["limestone pavement","karst plain","limestone flat"],"phonetic":"/ˈæl.vɑr/","extraExplanation":["“alvar”作为地貌/生态学术语，来源于瑞典语 allvar，原指厄兰岛（Öland）等地的石灰岩台地景观；英语中常用来指类似的石灰岩裸露平原生态系统。","作为人名时，Alvar 在北欧和西语系语境中都能见到；较著名的人物包括芬兰建筑师 Alvar Aalto（阿尔瓦·阿尔托）。"]}
{"word":"Alvarado","summary":{"en":"Alvarado is most commonly a Spanish-origin surname, and it is also used as a place name (e.g., cities or streets).","zh":"Alvarado 最常见的是西班牙语来源的姓氏，也常用作地名（如城市名或街道名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Spanish-origin surname (family name).","zh":"一个西班牙语来源的姓氏（家族姓）。"},"examples":[{"en":"Ms. Alvarado will lead the meeting today.","zh":"Alvarado 女士今天将主持会议。"},{"en":"My teacher’s last name is Alvarado.","zh":"我老师的姓是 Alvarado。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used for several locations (for example, cities or streets) in the United States and other Spanish-speaking regions.","zh":"一个地名，用于多个地点（例如城市或街道），常见于美国及其他受西语影响地区。"},"examples":[{"en":"We drove through Alvarado on our way to Dallas.","zh":"我们去达拉斯的路上开车经过了 Alvarado。"},{"en":"Take the subway to Alvarado Street and walk two blocks.","zh":"坐地铁到 Alvarado Street，然后步行两个街区。"}]}],"synonyms":["(no direct synonyms; proper name)"],"phonetic":"/ˌælvəˈrɑːdoʊ/","extraExplanation":["“Alvarado”常见于西班牙及拉丁美洲文化圈，也常见于美国西南部和加州等历史上受西班牙语影响较深的地区，因此既可能是姓氏，也可能出现在城市名、街道名等地名中。","词源上通常被视为来自西班牙语人名“Álvaro”的姓氏形式（类似“某某的后代/家族”这一类构词传统）。"]}
{"word":"Alvarez","summary":{"en":"Alvarez is a common Spanish-language surname (family name).","zh":"Alvarez是一个常见的西班牙语姓氏（家族姓）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Spanish-language surname (family name); also used as a last name by people in many countries, especially in Spain and Latin America","zh":"一个西班牙语常见的姓氏（家族姓）；在西班牙和拉丁美洲等许多国家都很常见"},"examples":[{"en":"My neighbor’s last name is Alvarez.","zh":"我邻居的姓是Alvarez（阿尔瓦雷斯）。"},{"en":"In the article, Alvarez said the team would keep working.","zh":"在那篇报道里，Alvarez说球队会继续努力。"}]}],"synonyms":["Álvarez"],"phonetic":"/ˈæl.və.rɛz/","extraExplanation":["“Alvarez”通常对应西班牙语拼写“Álvarez”，重音在第一个音节（Ál-）。在英语环境里常把重音符号省略，写作Alvarez。","词源上它常被解释为“Álvaro之子”（类似英语里Johnson = John’s son），属于西班牙语常见的父名姓氏（patronymic）。","在文学与新闻写作中，如果不确定对方是否使用重音符号，正式场合可以询问或参考其本人/官方文件的拼写。"]}
{"word":"Alvaro","summary":{"en":"Alvaro is a male first name, especially common in Spanish and Portuguese contexts.","zh":"Alvaro 是男性名，尤其常见于西语与葡语文化背景。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A masculine given name (first name), common in Spanish- and Portuguese-speaking cultures.","zh":"男性名字（名），常见于西班牙语和葡萄牙语文化圈。"},"examples":[{"en":"Alvaro is my classmate from Spain.","zh":"Alvaro 是我来自西班牙的同学。"},{"en":"I met Alvaro at a conference in Mexico City.","zh":"我在墨西哥城的一场会议上认识了 Alvaro。"},{"en":"Alvaro’s last name is García.","zh":"Alvaro 的姓是 García。"}]}],"phonetic":"/ælˈvɑɹoʊ/","extraExplanation":["在西班牙语中常写作 **Álvaro**（有重音符号），通常重读在第一音节附近；在英语环境里往往写作 **Alvaro**（不带重音），读音也会更“英语化”。","这是一个常见的伊比利亚半岛名字（西班牙、葡萄牙及拉丁美洲）。英语里把它当作人名使用时，一般不翻译含义，直接音译或保留原拼写。"]}
{"word":"Alvarus","summary":{"en":"Alvarus is a Latin-style form of the male name Álvaro, most often found in medieval or scholarly contexts.","zh":"Alvarus 是男性名字 Álvaro 的拉丁风格形式，多见于中世纪文本或学术语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a masculine given name; a Latinized form of the Spanish/Portuguese name Álvaro (also related to Alvar).","zh":"男性名字；西班牙语/葡萄牙语名字 Álvaro 的拉丁化形式（也与 Alvar 相关）。"},"examples":[{"en":"In the manuscript, the author signs his name as Alvarus.","zh":"在这份手稿里，作者署名为 Alvarus。"},{"en":"Alvarus is an older, Latin-style spelling you may see in medieval texts.","zh":"Alvarus 是一种较古老、偏拉丁风格的拼写，你可能会在中世纪文本中看到。"}]},{"partOfSpeech":"other","definition":{"en":"a name element used in the Latin names of some medieval Iberian writers and church figures (e.g., you may see it in scholarly references).","zh":"一些伊比利亚半岛（西班牙/葡萄牙）中世纪作家或教会人物的拉丁名用法（常见于学术引用中）。"},"examples":[{"en":"Some scholars refer to the writer as Alvarus of Córdoba in Latin sources.","zh":"一些学者在拉丁文资料中把这位作者称为“科尔多瓦的 Alvarus”。"}]}],"synonyms":["Álvaro","Alvar"],"phonetic":"/ælˈvɑrəs/","extraExplanation":["“Alvarus”通常不是现代英语里的常用拼写，更像是拉丁文写法（Latinized form）。在阅读历史、神学或中古手稿时更常见。","如果你是在姓名/用户名/品牌名里看到 Alvarus，它多半是借用这种“古典/中世纪”气质；现代西语常见对应形式是 Álvaro（重音在第一个 a 上）。"]}
{"word":"Alvaton","summary":{"en":"Alvaton is a place name: a small unincorporated community in Kentucky, USA.","zh":"Alvaton 是一个地名：美国肯塔基州的一个小型非建制社区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An unincorporated community (place name) in Warren County, Kentucky, USA, near Bowling Green.","zh":"（地名）美国肯塔基州沃伦县的一个非建制社区，靠近鲍灵格林（Bowling Green）。"},"examples":[{"en":"Alvaton is a small community just south of Bowling Green, Kentucky.","zh":"Alvaton 是肯塔基州鲍灵格林以南的一个小社区。"},{"en":"We drove through Alvaton on our way to visit family in Warren County.","zh":"我们去沃伦县探亲的路上开车经过了 Alvaton。"}]}],"phonetic":"/ˈæl.və.tɑn/","extraExplanation":["Alvaton 属于“非建制社区”（unincorporated community），意思是它不是独立建制的城市或镇，通常由县政府提供公共服务。","这类地名在英文里一般首字母大写，常用于地址、路线描述与地方新闻中。若你是在地图或地址中看到它，多半指肯塔基州的这个地点。"]}
{"word":"alvearies","summary":{"en":"Alvearies means beehives (plural), and more rarely small cavity-like spaces in scientific writing.","zh":"alvearies 是 alveary 的复数，主要指“蜂箱/蜂房”，较少见时指科学语境中的“小腔室”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural) beehives; places where bees are kept, especially in an apiary.","zh":"（复数）蜂箱；养蜂处（尤指蜂场里的蜂箱或蜂房）。"},"examples":[{"en":"The beekeeper inspected the alvearies early in the morning.","zh":"养蜂人一大早就检查了这些蜂箱。"},{"en":"In spring, the alvearies become busy with new workers and fresh honeycomb.","zh":"春天里，蜂箱里会因新工蜂和新蜂巢而变得忙碌。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) small cavities or cell-like spaces, especially in biological or anatomical descriptions.","zh":"（较少见）小腔室；细胞状的小空间（尤用于生物或解剖学描述）。"},"examples":[{"en":"The scientist described the tissue as having many tiny alvearies.","zh":"科学家描述这种组织有许多微小的腔室。"}]}],"synonyms":["beehives","hives","apiaries (related)"],"phonetic":"/ˈælviˌɛriz/","extraExplanation":["“alvearies”是“alveary”的复数。这个词来自拉丁语“alvearium”，与“alveus”（槽、容器）有关，因此常用来指放蜜蜂、盛放蜂巢的“蜂箱/蜂房”。","在现代英语里，更常见的日常说法是“beehives”。如果你在普通文章里看到“alveary”，往往带有较书面、古典或专业（养蜂/博物学）色彩。"]}
{"word":"alvearium","summary":{"en":"Alvearium means a beehive (a formal, Latin-based term).","zh":"Alvearium 指“蜂房/蜂巢”，是较正式、带拉丁语色彩的用词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A beehive; a place where bees live and store honey (a learned or Latin-based term).","zh":"蜂房；蜂巢（较书面、带拉丁语色彩的用词）。"},"examples":[{"en":"The naturalist described the alvearium as a carefully organized home for the colony.","zh":"这位博物学家把蜂房描写成蜂群井然有序的家。"},{"en":"Wax combs inside the alvearium held both larvae and honey.","zh":"蜂房里的蜡巢脾既养育幼虫，也储存蜂蜜。"}]}],"synonyms":["beehive","hive","apiary hive"],"phonetic":"/ˌælviˈɛəriəm/","extraExplanation":["“Alvearium”源自拉丁语，和“alveus”（槽、空腔）同源，意指由许多小“格子/小腔室”组成的结构，因此常用来指蜂巢那种蜂房格结构。","在现代英语里它属于较少见、偏学术或文学化的词；日常更常用的是“beehive”或“hive”。"]}
{"word":"alveary","summary":{"en":"Alveary means a beehive or, more broadly, an area/building where beehives are kept (an apiary).","zh":"alveary 指“蜂箱/蜂巢”，也可泛指“养蜂场”（放置多个蜂箱的地方）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a beehive; a place where bees are kept.","zh":"蜂箱；蜂巢（养蜂或蜜蜂居住的地方）。"},"examples":[{"en":"The beekeeper checked each alveary for signs of disease.","zh":"养蜂人检查每个蜂箱是否有疾病迹象。"},{"en":"In the old garden, an alveary stood near the lavender beds.","zh":"在老花园里，一个蜂箱立在薰衣草花圃旁。"}]},{"partOfSpeech":"n.","definition":{"en":"a building or area that contains multiple beehives (an apiary).","zh":"养蜂场；蜂房（放置多个蜂箱的区域或建筑）。"},"examples":[{"en":"They built an alveary on the edge of the orchard to improve pollination.","zh":"他们在果园边建了一个养蜂场，以提高授粉效果。"},{"en":"The farm’s alveary provides honey and supports local wildflowers.","zh":"农场的养蜂场既产蜂蜜，也支持当地野花的繁衍。"}]}],"synonyms":["beehive","apiary"],"phonetic":"/ˈælviˌɛri/","extraExplanation":["“alveary”较为书面、少见，日常英语更常用的是“beehive”（蜂箱/蜂巢）或“apiary”（养蜂场）。","词源来自拉丁语 alvearium（蜂箱），与 alveus（“槽、空腔”）有关，强调“容纳/盛放”的空间。","在文学或描写性写作里，alveary 常用来营造古典、自然史或田园氛围，比普通的 beehive 更“雅”。"]}
{"word":"alveated","summary":{"en":"Alveated means ‘having many small pits or cavities; honeycombed,’ usually in scientific description.","zh":"Alveated 指“有许多小凹穴/小腔、呈蜂窝状”，多用于科学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having small pits or cavities (alveoli); honeycombed in texture.","zh":"有小凹穴／小腔（alveoli）的；呈蜂窝状纹理的。"},"examples":[{"en":"Under the microscope, the shell surface looked alveated and porous.","zh":"在显微镜下，贝壳表面看起来有凹穴，且很疏松多孔。"},{"en":"Some fossils show an alveated pattern where tiny pits once held tissues.","zh":"一些化石呈现凹穴状纹理，那些细小凹坑曾经容纳组织。"}]}],"synonyms":["pitted","porous","honeycombed","alveolate","alveolated"],"phonetic":"/ˈælviˌeɪtɪd/","extraExplanation":["“alveated”比较少见，多用于生物学、植物学、古生物学或材料描述，意思接近“alveolate / alveolated”（有小腔/小孔的）。词根来自拉丁语 *alveus*（槽、腔），也与“alveoli（肺泡/小囊）”同源。写作中更常见的替代词有：*pitted*（有坑的）、*porous*（多孔的）、*honeycombed*（蜂窝状的）。"]}
{"word":"Alveda","summary":{"en":"Alveda is a female first name.","zh":"Alveda 是一个女性英文名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (first name).","zh":"女性名字（名）。"},"examples":[{"en":"Alveda introduced herself and said she was new to the class.","zh":"Alveda 自我介绍，说她是新来的同学。"},{"en":"Alveda King is a well-known American public figure.","zh":"Alveda King 是美国较知名的公众人物。"}]}],"synonyms":["Alva","Alvina","Alvida"],"phonetic":"ælˈviːdə","extraExplanation":["“Alveda”多见作英文女性名字，在美国等英语国家偶尔使用。它常被认为与名字“Alva”有关（也有人把它看作“Alva”的延伸形式），整体带有比较传统的姓名气质。","作为专有名词（人名），通常首字母大写：Alveda。发音在不同家庭或地区可能略有差别，但常见读法如上。"]}
{"word":"alvelos","summary":{"en":"Alvelos is usually a Portuguese place name or a Portuguese-language surname, not a common everyday English word.","zh":"Alvelos 通常是葡萄牙的地名或葡语姓氏，并不是常见的英语日常词汇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A place name (proper noun): Alvelos is the name of a locality/parish in Portugal (used as a geographic name).","zh":"地名（专有名词）：Alvelos 是葡萄牙的一个地名/教区名称，用作地理名称。"},"examples":[{"en":"She traced her family roots back to Alvelos, Portugal.","zh":"她把家族根源追溯到葡萄牙的 Alvelos。"},{"en":"They visited Alvelos during their trip through northern Portugal.","zh":"他们在穿越葡萄牙北部的旅行中去过 Alvelos。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname (family name), especially in Portuguese-speaking contexts.","zh":"姓氏（家族姓），在葡语语境中较常见。"},"examples":[{"en":"Mr. Alvelos will speak at the meeting today.","zh":"Alvelos 先生今天将在会议上发言。"}]}],"phonetic":"/ælˈvɛloʊs/","extraExplanation":["“Alvelos”在英语里不算常见词，更多以葡萄牙地名或姓氏出现；在英文文本中通常需要大写（Alvelos）。","如果你本来想查的是生物/医学词“alveolus（肺泡）/ alveoli（复数）”，拼写会很接近但意思完全不同；可以告诉我你的上下文，我可以帮你确认。"]}
{"word":"alveloz","summary":{"en":"“Alveloz” is not a recognized English vocabulary word; it’s likely a misspelling or a proper name.","zh":"“alveloz”不是常见英语词汇；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it may be a misspelling, a username, or a proper name (e.g., a surname).","zh":"不是标准英语单词；可能是拼写错误、用户名，或专有名词（如姓氏）。"},"examples":[{"en":"I couldn’t find “alveloz” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英文词典里找不到“alveloz”——你能把它出现的句子发我吗？"},{"en":"It might be a name rather than a vocabulary word.","zh":"它可能是名字，而不是词汇单词。"}]}],"extraExplanation":["“alveloz”很可能是拼写误差。常见的相近英文词包括：\n- alveolus（肺泡/小腔），发音 /ˌælˈviːələs/\n- alveolar（齿龈的/肺泡的），发音 /ælˈviːələr/\n如果你告诉我它出现的语境（句子、学科领域：医学/生物/昵称等），我可以更准确判断你想查的词。"]}
{"word":"alveodental","summary":{"en":"Alveodental describes a consonant articulation involving the alveolar ridge and/or the teeth (between alveolar and dental).","zh":"alveodental 指介于齿龈与牙齿之间（或两者同时参与）的发音部位与发音特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(phonetics) Related to sounds made with the tongue touching or close to the alveolar ridge (just behind the upper front teeth) and/or the teeth; dental and alveolar articulation together.","zh":"（语音学）指发音时舌头接触或接近齿龈嵴（上门牙后方的隆起）和/或牙齿的部位；兼具“齿音（dental）”与“齿龈音（alveolar）”的发音特征。"},"examples":[{"en":"In some accents, /t/ and /d/ can be described as alveodental rather than purely alveolar.","zh":"在某些口音中，/t/ 和 /d/ 可被描述为“齿龈-齿（alveodental）”而不是纯粹的齿龈音。"},{"en":"The teacher asked students to notice the alveodental position of the tongue when practicing clear consonants.","zh":"老师让学生在练习清晰辅音时注意舌头的“齿龈-齿（alveodental）”位置。"}]}],"synonyms":["dentoalveolar","alveolar (in some contexts)"],"phonetic":"ˌælvi.oʊˈdɛn.təl","extraExplanation":["“alveodental”常见于语音学描述，用来强调发音部位介于“齿龈（alveolar）”与“齿（dental）”之间，或两者同时参与。比如英语里很多人发 /t, d, n, l/ 时，舌尖可能更靠近上齿背后的位置，因此会被描述为 alveodental。","词形上：alveo- 来自 alveolar（齿龈），dental 来自 tooth（牙）。它不是日常生活中常用的词，更常出现在语言学、发音教学或口音分析的语境里。"]}
{"word":"alveola","summary":{"en":"Alveola is a plural anatomical term meaning small cavities—most commonly the lung air sacs for gas exchange; it can also refer to tooth sockets.","zh":"Alveola 是解剖学中的复数术语，指小腔隙；最常指肺泡（进行气体交换），也可指牙槽（牙齿窝）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"small air sacs in the lungs where oxygen and carbon dioxide are exchanged (plural form, used in anatomy).","zh":"（解剖）肺泡：肺里进行氧气与二氧化碳交换的微小气囊（复数形式）。"},"examples":[{"en":"In the lungs, gas exchange happens in the alveola.","zh":"在肺部，气体交换发生在肺泡中。"},{"en":"Smoking can damage the alveola and reduce breathing efficiency.","zh":"吸烟会损伤肺泡，降低呼吸效率。"}]},{"partOfSpeech":"n.","definition":{"en":"small hollow spaces or sockets, especially the tooth sockets in the jaw (plural form, used in anatomy/dentistry).","zh":"（解剖/牙科）小窝/牙槽：尤其指颌骨中的牙齿窝（复数形式）。"},"examples":[{"en":"The dentist checked the alveola for signs of infection.","zh":"牙医检查了牙槽是否有感染迹象。"},{"en":"After the extraction, the alveola began to heal.","zh":"拔牙后，牙槽开始愈合。"}]}],"synonyms":["alveoli","air sacs (lungs)","tooth sockets"],"phonetic":"/ælˈviːələ/","extraExplanation":["“alveola”来自拉丁语，是“alveolus”的复数形式之一；不过在现代医学英语中，更常见的复数是“alveoli”。写作或考试时通常优先用“alveolus (单数) / alveoli (复数)”。"]}
{"word":"alveolae","summary":{"en":"Alveolae are small cavities, especially the lung air sacs used for gas exchange; in dentistry, it can mean tooth sockets.","zh":"Alveolae 指小腔/小窝，最常指肺泡（气体交换处）；在牙科中也可指牙槽（牙根所在的窝）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural noun) Tiny air sacs in the lungs where oxygen and carbon dioxide are exchanged with the blood.","zh":"（复数名词）肺泡：肺部中进行氧气与二氧化碳与血液交换的微小气囊。"},"examples":[{"en":"Damage to the alveolae can make it hard to breathe.","zh":"肺泡受损会让呼吸变得困难。"},{"en":"In healthy lungs, the alveolae provide a large surface area for gas exchange.","zh":"在健康的肺里，肺泡提供很大的表面积来进行气体交换。"}]},{"partOfSpeech":"n.","definition":{"en":"(Plural noun) Tooth sockets in the jawbone (dental use).","zh":"（复数名词）（牙科）牙槽：颌骨中容纳牙根的窝。"},"examples":[{"en":"The dentist checked the alveolae for signs of infection.","zh":"牙医检查牙槽是否有感染迹象。"},{"en":"Bone loss around the alveolae may cause teeth to loosen.","zh":"牙槽周围的骨质流失可能导致牙齿松动。"}]}],"synonyms":["alveoli","air sacs","(dental) sockets","tooth sockets"],"phonetic":"/ælˈviəˌleɪ/","extraExplanation":["“alveolae”来自拉丁语，是单数“alveola”（小腔、小窝）的复数形式。在现代英语里，更常见的复数拼写是“alveoli”（同指肺泡）；很多医学英语写作会优先用“alveoli”。如果你在课本或论文里看到“alveolae”，通常是更偏拉丁化/学术的写法。"]}
{"word":"alveolar","summary":{"en":"Alveolar means “related to an alveolus,” especially a tooth socket (dentistry) or lung alveoli (anatomy). In phonetics, it can refer to a consonant made at the alveolar ridge.","zh":"alveolar 意为“与 alveolus（牙槽/肺泡等小腔室）有关的”，常指牙槽或肺泡。在语音学中也可指“齿龈音/齿龈辅音”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy/Dentistry) Relating to an alveolus—especially the tooth socket in the jawbone.","zh":"（解剖/牙科）与“牙槽（alveolus）”有关的；尤指颌骨中容纳牙根的牙槽窝。"},"examples":[{"en":"The dentist noticed alveolar bone loss around the molar.","zh":"牙医注意到臼齿周围有牙槽骨流失。"},{"en":"An alveolar abscess can cause swelling and severe pain.","zh":"牙槽脓肿可能引起肿胀和剧烈疼痛。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Anatomy) Relating to the alveoli in the lungs, where oxygen and carbon dioxide are exchanged.","zh":"（解剖）与肺泡有关的（气体交换发生的部位）。"},"examples":[{"en":"Smoking can damage alveolar tissue and reduce lung function.","zh":"吸烟会损伤肺泡组织并降低肺功能。"},{"en":"Doctors looked for signs of alveolar inflammation in the scan.","zh":"医生在影像检查中寻找肺泡炎症的迹象。"}]},{"partOfSpeech":"n.","definition":{"en":"(Phonetics) A sound made with the tongue touching or near the alveolar ridge (the ridge just behind the upper front teeth).","zh":"（语音学）齿龈音：舌尖接触或靠近齿龈嵴（上门牙后方的隆起）发出的音。"},"examples":[{"en":"In English, /t/ and /d/ are alveolar consonants.","zh":"在英语中，/t/ 和 /d/ 是齿龈辅音。"},{"en":"Learners often confuse alveolar /n/ with other nasal sounds.","zh":"学习者常把齿龈 /n/ 和其他鼻音混淆。"}]}],"synonyms":["dental (phonetics, sometimes)","pulmonary (lung-related, broader)","tooth-socket (informal, dentistry)"],"phonetic":"/ælˈviələr/","extraExplanation":["“alveolus”原意是“小凹槽/小腔室”，在牙科里常指“牙槽窝”，在呼吸系统里指“肺泡”。因此 alveolar 在医学语境中常见两大方向：牙槽（tooth socket）与肺泡（lung alveoli）。","语音学里的“alveolar（齿龈）”与牙科无关，指发音部位在“齿龈嵴”。常见英语齿龈音包括 /t, d, s, z, n, l/（不同口音会有细微差异）。"]}
{"word":"alveolariform","summary":{"en":"A rare medical/dental adjective meaning “shaped like an alveolus (a small socket or cavity), especially a tooth socket.”","zh":"一个少见的医学/牙科形容词，意为“呈牙槽（小窝/小腔）形的”，尤指像牙齿牙槽窝的形状。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape of an alveolus (a small cavity or socket), especially a tooth socket in the jawbone.","zh":"呈“牙槽（小凹/窝/腔）”形的；尤指呈颌骨中牙槽窝（牙齿牙根所在的骨性窝）形状的。"},"examples":[{"en":"The surgeon described an alveolariform depression where the tooth once sat.","zh":"外科医生描述了牙齿原本所在位置的一个牙槽状凹陷。"},{"en":"In the report, the lesion was noted as alveolariform in outline.","zh":"报告中提到该病灶的轮廓呈牙槽状。"}]}],"synonyms":["alveolus-shaped","socket-shaped","alveolar (context-dependent)"],"phonetic":"/ˌælviˈoʊlərəˌfɔrm/","extraExplanation":["这是一个非常少见、偏专业（解剖学/牙科/医学影像学）的形容词。词根来自 *alveolus*（小腔、牙槽、肺泡）+ *-form*（……形的）。在牙科语境里通常指“像牙槽窝一样的形状”；在其他医学语境中也可能泛指“像小腔/小窝一样的形状”。日常英语更常用的表达是 **alveolar (adj.)**（牙槽的/肺泡的）或 **socket-shaped**（像窝/牙槽一样的）。"]}
{"word":"alveolarization","summary":{"en":"Alveolarization means making a sound at (or changing it to) the alveolar ridge, just behind the upper front teeth.","zh":"Alveolarization 指把语音在齿龈嵴处发出，或使其变化为齿龈部位发音（齿龈化）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Phonetics/phonology) The process in which a sound is produced or changes so that it is articulated at the alveolar ridge (the bony ridge just behind the upper front teeth).","zh":"（语音学/音系学）“齿龈化”：某个语音在发音时在齿龈嵴（上门牙后方的凸起处）发出，或在语音变化中变成齿龈部位发音的过程。"},"examples":[{"en":"In some accents, a consonant may undergo alveolarization before certain vowels.","zh":"在一些口音中，某些辅音在特定元音前可能会发生齿龈化。"},{"en":"The teacher explained alveolarization by comparing /t/ and /d/ (alveolar) with sounds made further back in the mouth.","zh":"老师用 /t/ 和 /d/（齿龈音）与口腔更靠后的音作比较来解释齿龈化。"}]}],"synonyms":["alveolarisation","alveolarization process"],"phonetic":"ˌælviəˌlɛrəˌzaɪʃən","extraExplanation":["“alveolarization”是较偏学术的术语，多见于语音学、语言学教材与论文中；日常英语里更常直接说“it becomes alveolar / it’s pronounced as an alveolar sound（变成齿龈音/用齿龈发音）”。","相关部位：alveolar ridge = 齿龈嵴。常见的英语齿龈音包括 /t, d, s, z, n, l/。在某些语言或方言中，原本不是齿龈位的音可能在特定语音环境下向齿龈位“靠拢”，这就可以描述为 alveolarization。"]}
{"word":"alveolarly","summary":{"en":"“Alveolarly” means “in an alveolar (alveolar ridge) way,” especially describing how speech sounds are produced with the tongue at the gum ridge behind the upper front teeth.","zh":"“alveolarly”意为“以齿龈（上门牙后方的齿龈隆起）相关的方式”，多用于描述语音发音时舌头在齿龈处的发音方式。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that involves the alveolar ridge (the gum ridge just behind the upper front teeth), especially in speech sounds.","zh":"以（或关于）齿龈（上门牙后方的牙龈隆起）的方式；尤指在语音发音中与齿龈有关地。"},"examples":[{"en":"In English, /t/ and /d/ are usually pronounced alveolarly.","zh":"在英语中，/t/ 和 /d/ 通常以齿龈音（alveolarly）的方式发音。"},{"en":"The teacher asked the students to place the tongue alveolarly for a clearer /n/ sound.","zh":"老师让学生把舌尖放在齿龈处发音，以让 /n/ 更清晰。"}]}],"synonyms":["at the alveolar ridge","in an alveolar manner"],"phonetic":"/ˌælviˈoʊlərli/","extraExplanation":["“alveolarly”主要用于语音学/语言学语境，表示“在齿龈处发音”。齿龈（alveolar ridge）是上排门牙后面那条硬硬的隆起，许多常见英语辅音（如 /t d n s z l/）都与这里的舌位有关。","不要把它和“alveolar（肺泡的）”在医学里的含义混淆：同一个词根 alveol- 可指“小腔/小窝”，在口腔里是“牙槽/齿龈附近”，在医学里常指“肺泡”。具体含义要看上下文。"]}
{"word":"alveolars","summary":{"en":"“Alveolars” are consonant sounds articulated at the alveolar ridge (just behind the upper front teeth).","zh":"“Alveolars”指在上齿龈嵴（上门牙后方）发出的辅音（齿龈音）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Linguistics) Consonant sounds made by placing the tongue on or near the alveolar ridge (the bony ridge just behind the upper front teeth), such as /t/, /d/, /s/, /z/, /n/, and /l/.","zh":"（语言学）舌尖或舌叶靠近或接触上齿龈嵴（上门牙后方的硬脊）发出的辅音音位，如 /t/、/d/、/s/、/z/、/n/、/l/。"},"examples":[{"en":"In English, /t/ and /d/ are alveolars.","zh":"在英语里，/t/ 和 /d/ 属于齿龈音（alveolars）。"},{"en":"Spanish has an alveolar trill in words like perro.","zh":"西班牙语在 perro 这类词里有齿龈颤音（alveolar trill）。"},{"en":"Learners often confuse alveolars with dental sounds when the tongue position is slightly different.","zh":"学习者常把齿龈音和齿音混淆，因为舌位只差一点点。"}]}],"synonyms":["alveolar consonants","alveolar sounds"],"phonetic":"/ælˈviələrz/","extraExplanation":["“Alveolars”通常是“alveolar”的复数名词用法，常见于语音学/音系学课堂与教材里，表示“一类齿龈部位发音的辅音”。","齿龈嵴（alveolar ridge）的位置在“上门牙后方的凸起处”。把舌尖轻触那里发 /t/、/d/、/n/，很容易体会到“alveolar”的发音部位。","相关术语对比：dental（齿音，舌尖顶在牙齿上）、postalveolar（后齿龈音，如英语 /ʃ/ 在 ship 里的发音部位更靠后一些）。"]}
{"word":"alveolary","summary":{"en":"Alveolary means “related to an alveolus,” especially tooth sockets or lung air sacs; it’s less common than alveolar.","zh":"alveolary 表示“与肺泡/牙槽有关”，常指牙槽窝或肺部肺泡；比 alveolar 更少见。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy, dentistry) Related to an alveolus (a small cavity), especially the tooth socket in the jaw or the air sacs in the lungs.","zh":"（解剖/牙科）与“肺泡/牙槽”（小腔室）有关的，尤指颌骨中的牙槽窝或肺部的肺泡。"},"examples":[{"en":"The dentist noted inflammation in the alveolary bone around the molar.","zh":"牙医指出臼齿周围的牙槽骨出现了炎症。"},{"en":"Alveolary tissue in the lungs helps with gas exchange.","zh":"肺部的肺泡组织有助于气体交换。"}]}],"synonyms":["alveolar","alveolate"],"phonetic":"/ælˈviəˌlɛri/","extraExplanation":["“alveolary”在现代英语里相对少见，更常用的是“alveolar”。在医学、牙科语境中，你更可能在文章或课本里看到“alveolar bone（牙槽骨）”“alveolar ridge（牙槽嵴）”“alveolar sacs（肺泡囊）”等搭配。","词源来自拉丁语 alveolus（“小凹槽/小腔”），因此它常与“很多小小的腔室/小窝”这一形象相关。"]}
{"word":"alveolate","summary":{"en":"Alveolate means having many small cavities (alveoli), or (in linguistics) relating to the alveolar ridge used in making certain sounds.","zh":"alveolate 指“呈肺泡状/多小腔室的”，也可指（语言学）“与齿龈及其发音有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology/Anatomy) Having many small cavities (alveoli), like the tiny air sacs in the lungs or small pits in a surface.","zh":"（生物/解剖）具有许多小腔室或小窝（alveoli）的；如肺部的肺泡或表面的小凹坑。"},"examples":[{"en":"The lungs have an alveolate structure that increases the area for gas exchange.","zh":"肺具有肺泡状（alveolate）的结构，可增加气体交换的表面积。"},{"en":"Under the microscope, the tissue looks alveolate, with many tiny spaces.","zh":"在显微镜下，这种组织呈肺泡状，有许多细小空隙。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Linguistics) Relating to the alveolar ridge (the gum ridge behind the upper front teeth), used to describe certain speech sounds.","zh":"（语言学）与齿龈（上门牙后方的齿龈脊）有关的；用于描述某些语音。"},"examples":[{"en":"In English, /t/ and /d/ are often described as alveolate (alveolar) sounds.","zh":"在英语中，/t/ 和 /d/ 常被描述为齿龈音（alveolate/alveolar）。"},{"en":"The teacher explained how alveolate consonants are made with the tongue near the alveolar ridge.","zh":"老师解释了齿龈音是如何通过舌头靠近齿龈脊发出来的。"}]}],"synonyms":["alveolar","pitted","honeycombed"],"phonetic":"/ælˈviəˌleɪt/","extraExplanation":["“alveolate”来自拉丁语 alveolus，意为“小凹槽/小腔室”。在科学写作中更常见的近义形容词是 “alveolar”（如 alveolar sacs 肺泡囊、alveolar consonants 齿龈音），而 “alveolate”多见于生物学对结构外观的描述。"]}
{"word":"alveolated","summary":{"en":"Alveolated means “having small pit-like cavities (alveoli)” and, in biology, “related to the alveolates (Alveolata).”","zh":"alveolated 意为“具有小窝/小腔（alveoli）的，呈蜂窝状”，在生物学中也可指“与泡囊类（Alveolata）相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having small cavity-like spaces (alveoli); pitted or honeycombed in structure.","zh":"具有小腔/小窝状结构（alveoli）的；呈蜂窝状或凹坑状的。"},"examples":[{"en":"Under the microscope, the bone surface looked alveolated and porous.","zh":"在显微镜下，骨表面看起来呈蜂窝状且多孔。"},{"en":"Some leaves have an alveolated texture that traps tiny pockets of air.","zh":"有些叶片表面呈小窝状纹理，可以困住细小的空气层。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Biology, classification) Belonging to or characteristic of the alveolates—a major group of protists (e.g., dinoflagellates, ciliates, apicomplexans).","zh":"（生物分类）属于或具有“囊泡生物/泡囊类”（Alveolata）特征的——一大类原生生物（如甲藻、纤毛虫、顶复门）。"},"examples":[{"en":"Dinoflagellates are alveolated organisms found in many marine environments.","zh":"甲藻是常见于多种海洋环境的泡囊类生物。"},{"en":"The paper compared alveolated parasites with related protist groups.","zh":"这篇论文比较了泡囊类寄生生物与相关的原生生物类群。"}]}],"synonyms":["pitted","honeycombed","cavernous","alveolar (context-dependent)"],"phonetic":"ælˈviəˌleɪtɪd","extraExplanation":["“alveolated”来自“alveolus（小腔、小窝）”，常见于解剖学与组织学语境：如“pulmonary alveoli（肺泡）”。因此它既可描述“表面像小窝一样的结构”，也可用于生物分类学中指“Alveolata（泡囊类）”。","在牙科里也会见到相关词：如“alveolar bone（牙槽骨）”。注意：alveolar（牙槽的/肺泡的）更常用；alveolated更偏“形态学描述：呈小窝状/蜂窝状”。"]}
{"word":"alveolation","summary":{"en":"Alveolation usually means articulation at the alveolar ridge in phonetics, and in medical/biological use it can mean the formation of alveoli (such as lung air sacs).","zh":"Alveolation 通常指语音学中的“齿龈部位发音/齿龈化”；在医学/生物语境中也可指肺泡等 alveoli 的形成与发育。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Phonetics) Articulation made at or near the alveolar ridge (the bony ridge behind the upper front teeth); the process or feature of being alveolar.","zh":"（语音学）在齿龈嵴（上门牙后方的牙龈/硬腭前部隆起处）附近发音；“齿龈化/齿龈部位发音”的过程或特征。"},"examples":[{"en":"In English, /t/ and /d/ are often described in terms of alveolation because the tongue touches the alveolar ridge.","zh":"在英语中，/t/ 和 /d/ 常被用“齿龈部位发音（alveolation）”来描述，因为舌头会触碰齿龈嵴。"},{"en":"The learner’s /s/ improved after practicing alveolation with the tip of the tongue near the ridge behind the teeth.","zh":"学习者在练习把舌尖放在上门牙后方的齿龈嵴附近来发 /s/ 后，发音更清晰了。"}]},{"partOfSpeech":"n.","definition":{"en":"(Biology/Anatomy) The formation or development of alveoli—small cavity-like structures (for example, tiny air sacs in the lungs).","zh":"（生物/解剖）肺泡等“alveoli（小囊/小腔）”结构的形成或发育过程。"},"examples":[{"en":"Some medical texts discuss lung development in terms of alveolation during early life.","zh":"一些医学资料会用“alveolation（肺泡形成/发育）”来讨论生命早期的肺部发育。"},{"en":"Impaired alveolation can affect how efficiently the lungs exchange oxygen.","zh":"肺泡形成受影响可能会降低肺部交换氧气的效率。"}]}],"synonyms":["alveolar articulation","alveolarization","alveolar development"],"phonetic":"/ˌælviəˈleɪʃən/","extraExplanation":["在语音学里，alveolation 相关的核心概念是 alveolar ridge（齿龈嵴）。很多常见的英语音（如 /t, d, n, s, z, l/）都和这个发音部位密切相关。","在医学/生物语境中，alveolation 常与 lung alveoli（肺泡）出现，强调“形成、增多、成熟”的过程；具体含义要靠上下文判断是“发音部位”还是“肺泡发育”。"]}
{"word":"alveole","summary":{"en":"Alveole means a small cavity or socket, especially a tooth socket or (less commonly) a lung air sac.","zh":"Alveole 指小腔或小窝，尤指牙槽；也可（较少见）指肺泡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small hollow cavity or socket in the body, especially a tooth socket or a tiny air sac in the lungs (less common than “alveolus” in everyday English).","zh":"（解剖学）小腔或小窝，尤指牙槽或肺泡（在日常英语中不如“alveolus”常见）。"},"examples":[{"en":"After the tooth was removed, the dentist cleaned the alveole to prevent infection.","zh":"拔牙后，牙医清理了牙槽（alveole）以防感染。"},{"en":"In some texts, “alveole” is used to refer to a tiny lung air sac.","zh":"在一些书面材料中，“alveole”也用来指肺部的微小气囊（肺泡）。"}]},{"partOfSpeech":"n.","definition":{"en":"in botany or zoology, a small pit, cell, or honeycomb-like cavity in a structure.","zh":"（生物学）结构中的小凹坑、小室，或蜂窝状的小腔。"},"examples":[{"en":"Under the microscope, the surface showed many tiny alveoles arranged like a honeycomb.","zh":"在显微镜下，表面呈现出许多像蜂窝一样排列的微小小腔（alveoles）。"}]}],"synonyms":["alveolus","socket","cavity","air sac"],"phonetic":"/ælˈvi.oʊl/","extraExplanation":["“Alveole”在英语里属于较偏学术/专业的拼写与用法；更常见的是拉丁形式“alveolus”（单数）和“alveoli”（复数）。医学写作里通常用“alveolus/alveoli”来指肺泡或牙槽。","词源来自拉丁语 alvus（腹腔/空腔）相关概念，引申为“微小的腔、窝”。因此在不同学科里都可以表示“细小的空腔结构”。"]}
{"word":"alveolectomy","summary":{"en":"Alveolectomy is a dental/oral surgery procedure to remove the tooth socket and/or surrounding alveolar bone.","zh":"Alveolectomy 指牙科/口腔外科中切除牙槽（拔牙窝）及/或周围牙槽骨的手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical procedure that removes part or all of the tooth socket (alveolus) and/or surrounding alveolar bone, usually in dental or oral surgery.","zh":"一种外科手术，用于切除部分或全部牙槽（拔牙窝）及/或周围牙槽骨，常见于牙科或口腔外科。"},"examples":[{"en":"After the difficult extraction, the surgeon performed an alveolectomy to smooth the bone and help healing.","zh":"在困难拔牙后，外科医生进行了牙槽骨切除/修整（alveolectomy），以磨平骨面并促进愈合。"},{"en":"Alveolectomy may be considered when irregular alveolar bone prevents a denture from fitting comfortably.","zh":"当不规则的牙槽骨影响义齿舒适贴合时，可能会考虑进行 alveolectomy。"}]}],"synonyms":["alveolar bone resection","alveoloplasty (related)","socket resection"],"phonetic":"/ˌælviəˈlɛktəmi/","extraExplanation":["词源拆解：alveol- 来自拉丁语 alveolus（“小凹/小腔”，在牙科指“牙槽/牙槽窝”）；-ectomy 表示“切除术”。合起来就是“牙槽（骨/窝）切除术”。","使用场景：该词多见于病历、手术记录或学术文章；在日常就诊沟通中，医生更常用更具体的说法，如 “alveoloplasty（牙槽骨修整术）/ bone smoothing（磨骨）”。不同地区与医生用词可能略有差异。"]}
{"word":"alveoli","summary":{"en":"Alveoli are the tiny air sacs in the lungs where gas exchange happens.","zh":"Alveoli 指肺里的微小气囊（肺泡），在这里进行氧气与二氧化碳的交换。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Tiny air sacs in the lungs where oxygen enters the blood and carbon dioxide leaves the blood.","zh":"（肺部的）肺泡：肺里非常细小的气囊，负责让氧气进入血液、二氧化碳从血液排出。"},"examples":[{"en":"In the alveoli, oxygen moves into the bloodstream.","zh":"在肺泡里，氧气进入血液循环。"},{"en":"Smoking can damage the alveoli and make breathing harder.","zh":"吸烟会损伤肺泡，使呼吸变得更困难。"},{"en":"Doctors can see signs of alveoli damage in some lung diseases.","zh":"在一些肺部疾病中，医生能看到肺泡受损的迹象。"}]}],"synonyms":["air sacs","(lung) air sacs"],"phonetic":"/ælˈviːəlaɪ/","extraExplanation":["“Alveoli”是复数形式；单数是“alveolus”。在日常英语中更常见的是复数，因为肺里有大量肺泡。","词源来自拉丁语“alveolus”，原意是“小空腔/小槽”，用来形容肺泡像许多微小的腔室。"]}
{"word":"alveoliform","summary":{"en":"Alveoliform means “alveolus-shaped”: having tiny cavity-like structures, like tooth sockets or lung air sacs.","zh":"alveoliform 指“呈肺泡/齿槽形的”：具有许多小腔室结构，形态类似牙槽或肺泡。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having the shape or structure of an alveolus (a small cavity), especially like a tooth socket or the tiny air sacs in the lungs","zh":"呈“肺泡/齿槽（alveolus）”形的；具有小腔室（小窝）结构的，尤指类似牙槽或肺泡的形态"},"examples":[{"en":"Under the microscope, the tissue showed an alveoliform pattern of tiny cavities.","zh":"在显微镜下，这种组织呈现出由许多小腔构成的“肺泡样”结构。"},{"en":"The report described an alveoliform surface, like small honeycomb pits.","zh":"报告描述该表面为齿槽/肺泡样，像蜂窝一样布满小凹坑。"}]}],"synonyms":["alveolar","honeycombed","cavitated"],"phonetic":"/ælˈviː.ə.ləˌfɔrm/","extraExplanation":["“alveoliform”由 alveolus（肺泡；齿槽；小窝）+ -form（……形的）构成，多见于解剖学、医学和生物学描述中。日常英语里很少用，更常见的相关词是 alveolar（肺泡的；牙槽的）。"]}
{"word":"alveolite","summary":{"en":"Alveolite is a medical term meaning inflammation of alveoli, commonly in the lungs or a tooth socket.","zh":"alveolite 是医学词，指肺泡或牙槽窝的炎症，常见于肺部或拔牙后的牙槽部位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation of an alveolus (a small cavity), especially the air sacs in the lungs or the socket in the jaw where a tooth sits.","zh":"肺泡或牙槽（牙齿所在的牙槽窝）的炎症；常指肺部肺泡或拔牙后的牙槽窝发炎。"},"examples":[{"en":"The doctor suspected alveolite because the patient had fever and trouble breathing.","zh":"医生怀疑是肺泡炎，因为病人发烧并且呼吸困难。"},{"en":"After the tooth extraction, she developed alveolite and needed follow-up care.","zh":"拔牙后她出现了牙槽炎，需要复诊处理。"}]}],"synonyms":["alveolitis","dry socket","alveolar inflammation"],"phonetic":"/ˌælviəˈlaɪt/","extraExplanation":["“alveolite”在英语中属于医学用词，更常见的标准写法是“alveolitis”。牙科语境里常把拔牙后的剧痛性炎症称为“dry socket（干槽症）”，属于一种牙槽窝炎症。","词根提示：alveol- 来自拉丁语，意思与“小腔/小窝”有关（如 lung alveoli 肺泡；dental alveolus 牙槽窝）。"]}
{"word":"Alveolites","summary":{"en":"Alveolites are honeycomb-like fossils of an extinct coral genus.","zh":"Alveolites 指一种呈蜂窝状结构的已灭绝珊瑚属化石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of extinct tabulate corals (common as fossils), especially from Silurian to Devonian rocks; often seen as honeycomb-like fossil colonies.","zh":"（古生物）一种已灭绝的床板珊瑚属（常见化石），多见于志留纪到泥盆纪地层；群体化石常呈“蜂窝状”结构。"},"examples":[{"en":"We found Alveolites fossils embedded in the limestone by the river.","zh":"我们在河边的石灰岩里发现了 Alveolites（蜂窝状床板珊瑚）化石。"},{"en":"In the museum display, Alveolites looks like a tiny stone honeycomb.","zh":"在博物馆展柜里，Alveolites 看起来像一个小小的石质蜂巢。"}]}],"synonyms":["tabulate coral","fossil coral"],"phonetic":"/ælˈviːəˌlaɪts/","extraExplanation":["在学术写法中常用首字母大写 Alveolites，表示“属名”（genus）；口语或一般描述里也有人写作小写 alveolites 来泛指这类化石。","词源与拉丁语 alveolus（“小腔、小窝”）有关，指其骨骼结构里密集的小孔洞/小腔室，因此外观常被形容为“蜂窝状”。"]}
{"word":"alveolites","summary":{"en":"Alveolites are fossil corals (an extinct coral genus) often seen in Devonian rocks.","zh":"Alveolites 指一种常见于泥盆纪地层的珊瑚化石（已灭绝的板状珊瑚属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of extinct tabulate corals commonly found as fossils (especially in Devonian rocks), often with a honeycomb-like internal structure","zh":"（古生物）一种已灭绝的板状珊瑚属，常见于化石（尤见于泥盆纪地层），内部常呈蜂窝状结构"},"examples":[{"en":"We found Alveolites fossils in the limestone near the old quarry.","zh":"我们在旧采石场附近的石灰岩中发现了 Alveolites（蜂窝珊瑚属）化石。"},{"en":"Alveolites is often used in lessons to show what ancient reef communities looked like.","zh":"Alveolites 常用于课程中，用来展示古代礁体群落的样貌。"}]}],"synonyms":["tabulate coral","fossil coral","Alveolites (genus)"],"phonetic":"/ælˈviəlaɪts/","extraExplanation":["“Alveolites”在古生物学里常作为属名使用；你写的“alveolites”多半是它的复数形式（表示多件化石或多个标本）。","词源与形态有关：来自拉丁语 alveolus（“小腔室/小窝”），指其骨骼内部常见许多小孔洞，外观像蜂窝。","它不是医学里的“alveolitis”（牙槽/肺泡炎）。拼写很像，但意义完全不同。"]}
{"word":"alveolitis","summary":{"en":"Alveolitis means inflammation of lung alveoli or, in dentistry, inflammation of a tooth socket after extraction (dry socket).","zh":"Alveolitis 指肺泡炎；在牙科语境中也可指拔牙后牙槽窝炎（干槽症）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation of alveoli (tiny air sacs) in the lungs, which can make breathing difficult.","zh":"（肺部）肺泡炎：肺泡（微小气囊）发生炎症，可能导致呼吸困难。"},"examples":[{"en":"The doctor suspected alveolitis because the patient had shortness of breath and a dry cough.","zh":"医生怀疑是肺泡炎，因为病人有气短和干咳。"},{"en":"Some types of alveolitis are linked to long-term exposure to dust or mold.","zh":"某些类型的肺泡炎与长期接触粉尘或霉菌有关。"}]},{"partOfSpeech":"n.","definition":{"en":"Inflammation of a tooth socket after a tooth is removed (also called a “dry socket”).","zh":"（牙科）拔牙窝炎：拔牙后牙槽窝发生炎症（也常叫“干槽症”）。"},"examples":[{"en":"After the extraction, she developed alveolitis and needed follow-up treatment.","zh":"拔牙后她出现了拔牙窝炎，需要复诊治疗。"},{"en":"Smoking soon after a tooth extraction can raise the risk of alveolitis.","zh":"拔牙后不久吸烟会增加拔牙窝炎的风险。"}]}],"synonyms":["alveolar inflammation","pneumonitis (related term)","dry socket (dental)","alveolar osteitis (dental)"],"phonetic":"ˌælviəˈlaɪtɪs","extraExplanation":["“Alveolitis”是医学用词，常见于两大语境：①呼吸科/免疫相关疾病（肺泡发炎）；②口腔科拔牙后的并发症（拔牙窝发炎）。实际交流中，牙科常更常说“dry socket（干槽症）”。","词根提示：alveol- 来自拉丁语 alveolus（小腔/小窝），-itis 表示“炎症”。看到 -itis 结尾的词通常都与“发炎”有关。"]}
{"word":"alveolo","summary":{"en":"alveolo- is a word part meaning “related to an alveolus,” especially lung alveoli or tooth sockets.","zh":"alveolo- 是一个构词成分，表示“与肺泡或牙槽等 alveolus（小腔/小窝）有关”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Combining form) relating to an alveolus—especially the tiny air sacs in the lungs or the tooth sockets in the jaw.","zh":"（构词成分）与“alveolus（小腔/小窝）”有关，常指肺泡（肺里的小气囊）或牙槽（牙齿在颌骨里的窝）。"},"examples":[{"en":"The term alveolocapillary describes the area between the alveoli and the blood capillaries in the lungs.","zh":"“alveolocapillary（肺泡-毛细血管的）”描述的是肺泡与血毛细血管之间的区域。"},{"en":"Alveolodental structures support the teeth in the jaw.","zh":"“alveolodental（牙槽-牙齿的）”结构在颌骨中支撑牙齿。"}]}],"synonyms":["alveolar"],"phonetic":"/ælˈviəloʊ/","extraExplanation":["“alveolo-”来自拉丁语 alveolus，原意是“small cavity（小腔/小窝）”。在医学英语里常用来构成复合词（如 alveolocapillary）。","你输入的“alveolo”在英语里通常不单独作为一个常用词出现；更常见的相关词是：alveolus（单数：一个肺泡/牙槽）和 alveoli（复数：多个肺泡/牙槽）。如果你想查的是“alveolus / alveoli”，我也可以按这些词给出更完整的词条。"]}
{"word":"alveolo-condylar","summary":{"en":"“Alveolo-condylar” is a medical/dental adjective meaning ‘involving both the alveolar (tooth-bearing) part of the jaw and the mandibular condyle (jaw joint area).’","zh":"“Alveolo-condylar” 是医学/牙科用形容词，表示“同时涉及牙槽（承载牙齿的颌骨部分）与下颌髁突（颌关节区域）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the alveolar part of the jaw (tooth-bearing bone) and the condyle (the rounded end of the mandible forming the jaw joint).","zh":"与牙槽（承载牙齿的颌骨部分）以及髁突（下颌骨末端、构成颞下颌关节的圆形突起）有关的。"},"examples":[{"en":"The report describes an alveolo-condylar measurement used in orthodontic planning.","zh":"报告描述了一项用于正畸方案设计的牙槽-髁突测量指标。"},{"en":"Pain may be associated with alveolo-condylar changes in temporomandibular disorders.","zh":"疼痛可能与颞下颌关节紊乱中的牙槽-髁突相关改变有关。"}]}],"synonyms":["alveolocondylar","alveolar-condylar","alveolar and condylar (structures)"],"phonetic":"/ælˌviːəloʊ ˈkɑːndələr/","extraExplanation":["这是一个较专业的解剖/牙科复合形容词：alveolo-（牙槽的）+ condylar（髁突的）。常见于正畸、口腔颌面外科、颞下颌关节（TMJ）相关文献，用来描述同时涉及“牙槽区”和“下颌髁突/关节区”的结构、角度、距离或关系。","拼写上也可能见到连字符或不连字符（alveolocondylar），具体取决于期刊或教材的风格。","相关词：alveolar（牙槽的）、condylar（髁突的）、temporomandibular（颞下颌关节的）。"]}
{"word":"alveolo-dental","summary":{"en":"Alveolo-dental describes a consonant made with the tongue at or near the upper teeth and the alveolar ridge.","zh":"Alveolo-dental 指舌头在上齿及齿龈嵴附近发出的辅音（发音部位描述）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(phonetics) Made by placing the tongue against or near the upper teeth and the alveolar ridge (the bony ridge just behind the upper front teeth).","zh":"（语音学）指发音时舌头接触或接近上齿及齿龈嵴（上门牙后方的齿龈隆起）的发音部位。"},"examples":[{"en":"In some descriptions of English, /t/ and /d/ are called alveolo-dental sounds.","zh":"在一些对英语的描述中，/t/ 和 /d/ 被称为齿龈-齿（alveolo-dental）音。"},{"en":"The teacher asked students to make an alveolo-dental /n/ by touching the tongue near the upper teeth.","zh":"老师让学生把舌尖顶在上齿附近来发一个齿龈-齿的 /n/。"}]}],"synonyms":["denti-alveolar","alveolodental"],"phonetic":"/ˌælviəloʊˈdɛntəl/","extraExplanation":["这是一个较专业的术语，常见于语音学教材或发音训练中，用来更精细地区分“齿音（dental）”与“齿龈音（alveolar）”之间的发音位置：舌尖位置可能同时靠近上齿和齿龈嵴，因此用 alveolo-dental 这种“混合描述”。","写法上也常见作 alveolodental（不加连字符）或 denti-alveolar（同义/近义）。"]}
{"word":"alveolo-labial","summary":{"en":"A technical phonetics term meaning “made with both alveolar and lip articulation.”","zh":"语音学术语，指“同时在齿龈与唇部进行发音”的发音方式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(phonetics) Describing a speech sound made with a double articulation: the tongue touches or approaches the alveolar ridge while the lips also form a closure or constriction.","zh":"（语音学）指一种“双重发音”的语音：舌尖/舌端在齿龈（alveolar ridge）处接触或接近，同时双唇也形成闭塞或狭窄。"},"examples":[{"en":"In the transcription notes, the author mentions an alveolo-labial stop.","zh":"在转写说明里，作者提到了一种“齿龈-双唇”塞音。"},{"en":"Some field reports describe alveolo-labial consonants as rare and language-specific.","zh":"一些田野调查报告称“齿龈-双唇”辅音较罕见，并且往往只出现在特定语言中。"}]}],"synonyms":["double-articulated (in this context)","labial-alveolar"],"phonetic":"/ælˌviːəloʊˈleɪbiəl/","extraExplanation":["这是一个比较专门的语音学术语：alveolo- 表示“齿龈（齿槽）”，labial 表示“唇音”。合起来强调“舌位（齿龈）+唇部动作”同时参与发音。","它通常出现在对少数语言的描写或田野语言学资料中；在普通英语学习或日常交流里几乎不会用到。","也可以把它理解为“double articulation（双重发音）”的一种类型：两个不同的发音部位同时形成主要的发音动作。"]}
{"word":"alveolo-nasal","summary":{"en":"Alveolo-nasal means “involving both the alveolar ridge (gum ridge) and the nasal cavity,” used mainly in medical/scientific contexts.","zh":"alveolo-nasal 指“同时涉及齿龈嵴（齿槽区）与鼻腔的”，多用于医学/科研语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both the alveolar ridge (the gum ridge behind the upper front teeth) and the nasal cavity; involving these two areas together.","zh":"（形容词）与齿龈嵴（上门牙后方的牙龈隆起）和鼻腔都有关的；同时涉及这两部分的。"},"examples":[{"en":"The surgeon repaired an alveolo-nasal fistula after the cleft palate operation.","zh":"外科医生在腭裂手术后修补了一个“齿龈—鼻腔”瘘管。"},{"en":"The scan showed an infection spreading through the alveolo-nasal region.","zh":"影像检查显示感染扩散到了齿龈—鼻腔区域。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Phonetics, rare) Describing a speech sound or articulation that combines an alveolar tongue position with nasal airflow.","zh":"（语音学，较少用）描述一种发音方式：舌位在齿龈处（alveolar），同时气流从鼻腔通过（nasal）。"},"examples":[{"en":"Some descriptions label the sound as alveolo-nasal because it has an alveolar contact with nasal resonance.","zh":"有些描述会把该音称为 alveolo-nasal，因为它在齿龈处形成接触，同时带有鼻腔共鸣。"}]}],"synonyms":["alveolonasal","nasoalveolar","alveolar-nasal"],"phonetic":"/ælˌviːəˈloʊ ˈneɪzəl/","extraExplanation":["这个词由 alveolo-（指“齿槽/齿龈相关”，常见于 alveolar）和 nasal（鼻腔的）组成，属于学术/医学复合词，日常英语中不常用。","拼写上有时也写作 alveolonasal（不加连字符）。在医学语境里常见于描述结构、瘘管（fistula）、畸形或手术修复部位等。"]}
{"word":"alveolo-palatal","summary":{"en":"Alveolo-palatal describes consonant sounds produced between the alveolar ridge and the hard palate.","zh":"alveolo-palatal 用来描述发音位置介于齿龈嵴与硬腭之间的辅音。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Linguistics, phonetics) Describing a consonant sound made with the tongue close to the area between the alveolar ridge (just behind the teeth) and the hard palate (the roof of the mouth).","zh":"（语言学/语音学）指一种辅音发音部位：舌头靠近“齿龈嵴（牙齿后方的凸起）与硬腭（上颚前部）之间”的区域发出声音。"},"examples":[{"en":"In Mandarin, j, q, and x are often described as alveolo-palatal consonants.","zh":"在普通话里，j、q、x 常被描述为齿龈-硬腭音（alveolo-palatal）辅音。"},{"en":"The textbook contrasts alveolo-palatal fricatives with retroflex sounds like /ʂ/.","zh":"教材把齿龈-硬腭擦音与 /ʂ/ 这类卷舌音作对比。"}]}],"synonyms":["palato-alveolar (related, not always identical)","alveopalatal","pre-palatal (approx.)"],"phonetic":"/ˌælviəloʊˈpælətəl/","extraExplanation":["“alveolo-”来自 alveolus（齿槽/齿龈相关结构），指靠近齿龈嵴的部位；“palatal”指硬腭（palate）。合在一起强调发音位置介于齿龈与硬腭之间。","在汉语拼音教学中，人们常把 j/q/x 的发音位置说成“舌面前部靠近硬腭”，与 zh/ch/sh/r（卷舌）以及 z/c/s（舌尖前）区分。"]}
{"word":"alveoloclasia","summary":{"en":"A dental/jaw surgery term meaning surgical breaking and reshaping of the alveolar (tooth-bearing) bone to reposition or correct structures.","zh":"牙科/颌面外科术语：通过折断并重塑牙槽骨来移动、重新定位或矫正相关结构的手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine/Dentistry) A surgical procedure that breaks (fractures) and reshapes the alveolar bone (the tooth-bearing part of the jaw), often to reposition or correct deformities in the jaw or dental arch.","zh":"（医学/牙科）一种通过骨折（折断）并重塑牙槽骨（承载牙齿的颌骨部分）的手术，常用于移动、重新定位或矫正颌骨/牙弓的畸形。"},"examples":[{"en":"The surgeon explained that alveoloclasia could help reposition the dental arch.","zh":"外科医生解释说，alveoloclasia 可能有助于重新定位牙弓。"},{"en":"Alveoloclasia is discussed in older dental surgery texts, especially in relation to jaw correction.","zh":"在较早的牙科外科教材中常会提到 alveoloclasia，尤其与颌骨矫正相关。"}]}],"synonyms":["alveoloclasis","surgical fracture of the alveolar process (descriptive)"],"phonetic":"/ælˌviːəloʊˈkleɪʒə/","extraExplanation":["这个词较少见，多出现在较旧的口腔外科/颌面外科文献中。现代临床往往会用更具体的术式名称来描述（例如与“骨切开术”“正颌手术”相关的具体操作），因此在当代英语材料里不常看到。","构词提示：alveolo- 表示“牙槽/牙槽骨”，-clasia 源自希腊语，表示“打破、骨折（breaking）”。"]}
{"word":"alveoloclasis","summary":{"en":"A dental surgical procedure involving breaking/crushing the alveolar bone around a tooth.","zh":"一种牙科手术：对牙齿周围的牙槽骨进行折断或压碎。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medicine, dentistry) The surgical breaking or crushing of the alveolar bone (the tooth-bearing part of the jaw), usually to loosen a tooth or change its position during treatment.","zh":"（医学/牙科）牙槽骨（承载牙齿的颌骨部分）的手术性折断或压碎，通常用于松动牙齿或在治疗中改变其位置。"},"examples":[{"en":"The surgeon performed alveoloclasis to help loosen the impacted tooth.","zh":"外科医生进行了牙槽骨折碎术，以帮助松动阻生牙。"},{"en":"Because it is invasive, alveoloclasis is usually discussed along with other surgical options.","zh":"由于具有侵入性，牙槽骨折碎术通常会与其他外科方案一起讨论。"}]}],"synonyms":["alveoloclasia","surgical fracture of the alveolar bone"],"phonetic":"/ælˌviːəˈloʊkləsɪs/","extraExplanation":["这是一个较少见、偏旧的专业术语，主要出现在牙科或颌面外科的文献中。现代临床沟通里更常使用更具体的术式名称（例如与“牙槽骨切开/改形”等相关的说法），但在阅读旧教材或论文时可能会遇到。","词源上可拆解为 alveolo-（牙槽/牙槽骨）+ -clasis（打碎、折断；源自希腊语），因此从构词就能推测其“把牙槽骨弄裂/弄碎”的含义。"]}
{"word":"alveolocondylar","summary":{"en":"A medical/dental adjective meaning “involving both the tooth-bearing alveolar bone and the mandibular condyle.”","zh":"医学/牙科用形容词，指“同时涉及牙槽骨（含牙的颌骨部分）与下颌髁”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both the alveolar part of the jaw (the bone that holds the teeth) and the mandibular condyle (the rounded end of the lower jaw that forms the jaw joint).","zh":"与牙槽部（容纳牙齿的颌骨部分）和下颌髁（下颌骨末端形成颞下颌关节的圆形部分）两者相关的。"},"examples":[{"en":"The report described an alveolocondylar change after the jaw injury.","zh":"报告描述了该颌部损伤后出现的牙槽—髁部相关变化。"},{"en":"The surgeon evaluated alveolocondylar alignment before reconstructive surgery.","zh":"外科医生在重建手术前评估了牙槽—髁部的对位情况。"}]}],"synonyms":["alveolo-condylar","alveolar-condylar"],"phonetic":"/ælˌviːəloʊˈkɑːndəlɚ/","extraExplanation":["这是一个非常少见、偏专业的医学/牙科形容词，常见于口腔颌面外科、正畸学或影像学语境，用来强调“牙槽区（alveolo-）”与“下颌髁（-condylar）”这两处结构需要一起考虑（例如咬合、下颌位置、颞下颌关节问题等）。","构词法：alveolo- 来自 alveolus（“小腔/牙槽”），condylar 来自 condyle（“髁”）。写作上有时也会看到连字符形式 alveolo-condylar。"]}
{"word":"alveolocondylean","summary":{"en":"A rare anatomical adjective meaning “related to both the tooth socket (alveolus) and the condyle (joint surface),” often used in jaw/skull descriptions.","zh":"一个罕见的解剖学形容词，指“同时与牙槽（牙齿窝）和髁（关节面突起）相关”，常用于颌骨/颅骨的描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both an alveolus (a tooth socket) and a condyle (a rounded joint surface), especially in anatomical descriptions of the jaw/skull.","zh":"（解剖）与“牙槽/牙槽窝（alveolus，牙齿的牙槽）”和“髁（condyle，关节面的圆形突起）”两者都有关的，常用于描述颌骨/颅骨结构。"},"examples":[{"en":"The paper describes an alveolocondylean feature of the lower jaw in this fossil species.","zh":"这篇论文描述了该化石物种下颌骨的一个“牙槽—髁相关（alveolocondylean）”特征。"},{"en":"The surgeon reviewed the alveolocondylean region before planning the procedure.","zh":"手术前，外科医生先检查了颌部的牙槽—髁相关区域。"}]}],"synonyms":["alveolocondylar","alveolo-condylar"],"phonetic":"/ˌælviəloʊˌkɑnˈdɪliən/","extraExplanation":["这是一个非常少见、偏学术的形容词，多见于解剖学、古生物学或比较解剖的论文里。","词形可以拆开理解：alveolo-（牙槽/牙槽窝）+ condyle（髁）+ -ean（“……的/与……有关的”形容词后缀）。","不同作者可能用近似拼法（如 alveolocondylar / alveolo-condylar）来表达类似含义；具体指哪一块结构要看文章的上下文（例如某条沟、孔、管道或区域的命名）。"]}
{"word":"alveolodental","summary":{"en":"Alveolodental describes a sound made with the tongue at both the upper teeth and the alveolar ridge.","zh":"alveolodental 指一种发音部位：舌头在上齿与齿龈（齿槽嵴）附近同时接触或接近。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(phonetics) Made with the tongue touching or approaching both the upper teeth and the ridge just behind them (the alveolar ridge).","zh":"（语音学）“齿龈-齿的”；发音时舌头接触或接近上齿及其后方的齿龈（齿槽嵴）位置。"},"examples":[{"en":"In some descriptions, /n/ can be called alveolodental depending on the speaker’s tongue position.","zh":"在某些描述中，/n/ 也可能被称为“齿龈-齿的”，这取决于说话者舌位。"},{"en":"The teacher explained that the sound is alveolodental, so the tongue goes near the teeth and the alveolar ridge.","zh":"老师解释说这个音是“齿龈-齿的”，所以舌头要靠近牙齿和齿龈的位置。"}]}],"synonyms":["dental (related)","alveolar (related)","alveolo-dental"],"phonetic":"/ˌælviˌoʊloʊˈdɛntəl/","extraExplanation":["这个词多见于语音学（place of articulation，发音部位）的分类里，用来更精细地区分“齿音（dental）”和“齿龈音（alveolar）”之间的舌位差异。实际使用中，不同教材/学者对同一个音的标注可能不同：有的会写 alveolar，有的会写 dental 或 alveolodental。"]}
{"word":"alveololabial","summary":{"en":"Alveololabial describes a consonant made with the tongue at the alveolar ridge while the lower lip also contacts the upper teeth.","zh":"alveololabial 用来描述一种辅音：舌头在齿龈处发音的同时，下唇也与上齿接触。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a speech sound) produced with two simultaneous contacts: the tongue at the alveolar ridge (just behind the upper teeth) and the lower lip against the upper teeth.","zh":"（指语音）一种“双重调音”的发音方式：舌尖/舌端同时在齿龈（上齿后方的齿龈嵴）处形成阻碍，并且下唇同时与上齿接触。"},"examples":[{"en":"Some languages are described as having alveololabial consonants in detailed phonetic studies.","zh":"在更细致的语音学研究中，有些语言被描述为存在 alveololabial（齿龈-唇）辅音。"},{"en":"The paper compares alveololabial stops with ordinary alveolar and labiodental sounds.","zh":"这篇论文将 alveololabial（齿龈-唇）塞音与普通的齿龈音和唇齿音进行比较。"}]}],"synonyms":["alveolo-labial","double-articulated (in a broad sense)"],"phonetic":"/ælˌviːəloʊˈleɪbiəl/","extraExplanation":["alveololabial 是语音学里的专门术语，日常英语中几乎不会用到，常见于学术论文或国际音标（IPA）相关讨论。","它属于“共同时调音/双重调音”（coarticulation / double articulation）的描述：同一个辅音在发音时有两个主要的接触点。","词形来源：alveolo- 表示“齿龈（alveolar ridge）”，-labial 表示“唇部（lip）”。"]}
{"word":"alveololingual","summary":{"en":"Alveololingual describes sounds produced with the tongue at the alveolar ridge.","zh":"alveololingual 指“舌头在齿龈嵴处发音的（语音）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(phonetics) Made with the tongue touching or approaching the alveolar ridge (the ridge just behind the upper front teeth).","zh":"（语音学）用舌头接触或接近齿龈嵴（上门牙后方的“齿龈”隆起）来发音的。"},"examples":[{"en":"In English, /t/ and /d/ are typically alveololingual sounds.","zh":"在英语中，/t/ 和 /d/ 通常是齿龈舌音（alveololingual）."},{"en":"The teacher asked students to practice the alveololingual /n/ by placing the tongue at the alveolar ridge.","zh":"老师让学生把舌尖放在齿龈嵴处，练习齿龈舌音 /n/."}]}],"synonyms":["alveolar","apical alveolar","alveodental (closely related, depending on the language)"],"phonetic":"ˌælviəloʊˈlɪŋɡwəl","extraExplanation":["这个词主要出现在语音学/语言学资料里，属于较专业的形容词。日常更常见的说法是 alveolar（齿龈音）或 apical alveolar（舌尖齿龈音）。","alveolo- 指“齿龈（alveolar ridge）”，-lingual 指“舌的”。合在一起强调“用舌头在齿龈位置发音”的发音部位与发音器官。"]}
{"word":"alveolonasal","summary":{"en":"Alveolonasal describes something involving both the alveolar (gum ridge/teeth area) region and the nose or nasal cavity.","zh":"alveolonasal 指同时涉及齿龈/牙槽区域与鼻或鼻腔的（多为医学或解剖/语音学）描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both the alveolar ridge (the gum ridge behind the upper front teeth) and the nose/nasal cavity; involving alveolar and nasal structures or functions.","zh":"（解剖/语音学）与齿龈嵴（上门牙后方的牙龈隆起）和鼻/鼻腔都有关的；涉及“齿龈（alveolar）+鼻（nasal）”结构或功能的。"},"examples":[{"en":"The surgeon described an alveolonasal fistula that connected the mouth to the nasal cavity.","zh":"外科医生描述了一种“齿龈-鼻腔瘘”，它把口腔与鼻腔连通起来。"},{"en":"The report noted alveolonasal involvement after the injury.","zh":"报告指出受伤后出现了齿龈与鼻腔相关部位的受累。"}]}],"synonyms":["alveolo-nasal","oronasl (related, broader)","nasal-alveolar (less common wording)"],"phonetic":"/ˌælviəloʊˈneɪzəl/","extraExplanation":["这是一个很少见的专业词，多用于医学（口腔颌面外科、整形外科、耳鼻喉等）或少量用于语音学/解剖学描述。写作中也常见带连字符的形式 alveolo-nasal，用来更清楚地表示“alveolo-（齿龈/牙槽相关）+ nasal（鼻的）”。"]}
{"word":"alveoloplasty","summary":{"en":"Alveoloplasty is oral surgery to reshape or smooth the jawbone ridge, often to help dentures fit or aid healing after extractions.","zh":"Alveoloplasty（牙槽骨修整术）是重塑或磨平牙槽嵴的口腔手术，常用于帮助假牙贴合或促进拔牙后愈合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of oral surgery that reshapes or smooths the jawbone ridge (the alveolar ridge), often to prepare the mouth for dentures or to improve healing after a tooth extraction","zh":"一种口腔外科手术，用来重塑或磨平牙槽嵴（牙齿所在的颌骨边缘），常用于为义齿（假牙）做准备或帮助拔牙后的伤口更好愈合"},"examples":[{"en":"After the extractions, the dentist recommended an alveoloplasty so the dentures would fit better.","zh":"拔牙后，牙医建议做牙槽骨修整术，这样假牙会更贴合。"},{"en":"The surgeon performed an alveoloplasty to smooth sharp bone edges.","zh":"外科医生做了牙槽骨修整术，把尖锐的骨缘磨平。"}]}],"synonyms":["alveolar ridge reduction","bone smoothing","jawbone reshaping"],"phonetic":"/ælˌviːəˈloʊplæsti/","extraExplanation":["词源：alveolo- 来自拉丁语 alveolus（“小腔、窝”，在医学里常指“牙槽/肺泡”）；-plasty 表示“修复、成形的手术”。合起来就是“对牙槽（骨）的成形/修整手术”。","使用情境：这个词多见于牙科治疗计划、手术同意书或病历记录中，日常口语里医生可能会说 “smooth the bone” 或 “reshape the gum ridge”。","学习提示：不要和 lung alveoli（肺泡）混淆；在牙科语境中 alveolar ridge 指“牙槽嵴”，与牙齿/假牙贴合密切相关。"]}
{"word":"alveolosubnasal","summary":{"en":"An adjective used mainly in anatomy/dentistry for the area between the upper alveolar ridge and the region just beneath the nose.","zh":"主要用于解剖／牙科的形容词，指上颌牙槽部与鼻下区之间的区域。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy/Dentistry) Relating to the region from the upper jaw’s tooth-bearing ridge (the alveolar process) up to the area just under the nose (subnasal region).","zh":"（解剖／牙科）与上颌牙槽突（长牙齿的骨性牙槽部位）到鼻下区（鼻子正下方）这一带相关的。"},"examples":[{"en":"The surgeon evaluated the alveolosubnasal tissues before planning the incision.","zh":"外科医生在制定切口方案前评估了牙槽—鼻下区的软组织。"},{"en":"Swelling in the alveolosubnasal area can affect the upper lip and base of the nose.","zh":"牙槽—鼻下区的肿胀可能影响上唇和鼻底。"}]}],"synonyms":["subnasal","alveolar","nasolabial (related area)"],"phonetic":"ˌælviəloʊˌsʌbˈneɪzəl","extraExplanation":["这是一个较少见、偏专业的复合词：alveolo- 来自 alveolus（“牙槽／小腔”，在牙科常指“牙槽窝”），sub- 表示“在……下面”，nasal 表示“鼻的”。合起来常用于描述“上颌牙槽部与鼻下之间”的解剖区域。不同学科或文献可能写作 alveolo-subnasal（加连字符）。"]}
{"word":"alveolotomy","summary":{"en":"Alveolotomy is a surgical cut into a tooth socket or the alveolar bone to access an area for dental or oral treatment.","zh":"Alveolotomy 指为进行牙科/口腔治疗而对牙槽窝或牙槽骨做外科切开，以便进入目标区域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical incision into a dental alveolus (the tooth socket) or the alveolar bone, usually to gain access for treatment.","zh":"（牙科/外科）对牙槽（牙齿的牙槽窝）或牙槽骨进行的外科切开，通常用于暴露部位以便治疗。"},"examples":[{"en":"The surgeon performed an alveolotomy to remove an impacted tooth root.","zh":"外科医生进行了牙槽切开术，以取出阻生的牙根。"},{"en":"After imaging confirmed the location, an alveolotomy was planned to access the lesion.","zh":"影像检查确认位置后，医生计划通过牙槽切开术进入病灶。"}]}],"synonyms":["alveolar osteotomy","tooth-socket incision","oral surgical incision"],"phonetic":"/ˌælviəˈlɑtəmi/","extraExplanation":["这是较少见、偏专业的医学/牙科术语：alveolo- 表示“牙槽/小腔”（与 tooth socket 相关），-tomy 表示“切开”。临床上更常见的表达可能是“alveolar osteotomy（牙槽骨切开术）”或直接描述具体手术步骤。","不要与 alveolectomy（切除部分牙槽骨/牙槽切除术）混淆：-tomy 是“切开”，-ectomy 是“切除”。"]}
{"word":"alveolus","summary":{"en":"Alveolus means a tiny air sac in the lungs (most common), or a small body cavity such as a tooth socket.","zh":"Alveolus 常指肺泡（最常见），也可指身体中的小腔/小窝，如牙槽。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tiny air sac in the lungs where oxygen enters the blood and carbon dioxide leaves it.","zh":"（肺）肺泡：肺里非常小的气囊，是氧气进入血液、二氧化碳排出体外的地方。"},"examples":[{"en":"Smoking can damage the alveoli and make it harder to breathe.","zh":"吸烟会损伤肺泡，让呼吸变得更困难。"},{"en":"In healthy lungs, each alveolus helps exchange gases efficiently.","zh":"在健康的肺里，每个肺泡都能高效地进行气体交换。"}]},{"partOfSpeech":"n.","definition":{"en":"A small cavity or socket in the body, especially the tooth socket in the jawbone.","zh":"（解剖）小窝/小腔；尤指牙槽（下颌骨中的牙齿窝）。"},"examples":[{"en":"After the tooth was removed, the dentist checked the alveolus for bleeding.","zh":"拔牙后，牙医检查牙槽是否出血。"},{"en":"The tooth fits into an alveolus in the jaw.","zh":"牙齿嵌在下颌骨的牙槽里。"}]}],"synonyms":["air sac","lung sac","tooth socket","(anatomy) socket"],"phonetic":"/ælˈviə.ləs/","extraExplanation":["词源来自拉丁语 *alveolus*，意为“小槽/小凹处”，是 *alveus*（槽、盆）的小词形式，所以它既可指肺里的“小囊”，也可指骨头里的“小窝”（如牙槽）。","复数形式：*alveolus* → *alveoli*（常见于医学英语，如“damaged alveoli”）。"]}
{"word":"alveolus-shaped","summary":{"en":"Alveolus-shaped means shaped like a small hollow sac or socket (like lung alveoli or a tooth socket).","zh":"alveolus-shaped 指“呈肺泡/牙槽那样的小囊状空腔或凹窝形”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape of an alveolus (a small hollow, sac, or socket), especially like a tiny air sac in the lungs or a tooth socket.","zh":"呈“肺泡/小腔囊/牙槽”形的；形状像小小的囊状空腔或凹窝（常用于生物学、解剖学语境）。"},"examples":[{"en":"Under the microscope, the tissue shows many alveolus-shaped spaces.","zh":"在显微镜下，这种组织呈现出许多肺泡状的空隙。"},{"en":"The scaffold was designed with alveolus-shaped pores to improve gas exchange.","zh":"该支架被设计成肺泡状孔隙，以改善气体交换。"},{"en":"Some insects have alveolus-shaped pits on their body surface.","zh":"一些昆虫的体表有肺泡状的小凹坑。"}]}],"synonyms":["alveolar","saclike","cavity-shaped","pocket-shaped"],"phonetic":"/ælˈviːələs ʃeɪpt/","extraExplanation":["“alveolus”在英语里常指两类结构：①肺里的“肺泡”（tiny air sac）；②牙齿根部的“牙槽/牙槽窝”（tooth socket）。因此“alveolus-shaped”多用于学术或技术写作，强调“像小囊状空腔/小窝”的形状特征。","写作上常用连字符 alveolus-shaped 来做定语（如 alveolus-shaped pores）。在更常见的学术表达中，也可能用 “alveolar” 或 “alveolate” 来描述“与肺泡/牙槽相关或呈蜂窝状小腔结构”的特征，具体取决于学科用法。"]}
{"word":"Alver","summary":{"en":"Alver usually means an elf (or elves) in Northern European folklore; it can also be a person’s name.","zh":"Alver 通常指北欧民间传说中的精灵（也可指复数“精灵们”）；也可能是人名或姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Mythology, archaic or regional) An elf; a supernatural being in Northern European folklore. Also used as a plural meaning “elves.”","zh":"（神话；古语或方言）精灵；北欧民间传说中的超自然小人/精灵。也可作复数，意为“精灵们/众精灵”。"},"examples":[{"en":"In old tales, the alver were said to dance on the hills at night.","zh":"在古老的故事里，据说精灵们会在夜晚的山丘上跳舞。"},{"en":"The poem speaks of an alver who lures travelers with music.","zh":"那首诗写到一个用音乐引诱旅人的精灵。"}]},{"partOfSpeech":"other","definition":{"en":"A given name or surname (proper noun).","zh":"人名或姓氏（专有名词）。"},"examples":[{"en":"Alver is listed as the author of the article.","zh":"文章作者署名为 Alver。"},{"en":"Ms. Alver will join the meeting at 3 p.m.","zh":"Alver 女士将于下午三点参加会议。"}]}],"synonyms":["elf","elves","fairy","sprite"],"phonetic":"/ˈæl.vər/","extraExplanation":["“Alver”常见于挪威语/丹麦语等北欧语言中，通常是“elf（精灵）”的复数形式；在英语语境里多见于文学翻译、民俗研究或仿古风格的写作。","北欧与苏格兰传统里，“elves/ alver”不一定是童话里可爱的形象，也可能被描写得神秘甚至危险；阅读时可根据上下文判断语气与风格。"]}
{"word":"Alvera","summary":{"en":"Alvera is most commonly used as a woman’s first name; it can also be a surname or, less commonly, a place name.","zh":"Alvera 最常见是女性名字；也可以作姓氏，较少情况下作地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (first name).","zh":"女性名字（名）。"},"examples":[{"en":"Alvera moved to Chicago for a new job.","zh":"Alvera 为了新工作搬到了芝加哥。"},{"en":"My grandmother’s name was Alvera, so we named the baby after her.","zh":"我祖母叫 Alvera，所以我们用她的名字给宝宝取名。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"姓氏。"},"examples":[{"en":"Ms. Alvera will lead today’s meeting.","zh":"Alvera 女士将主持今天的会议。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used in some regions (less common).","zh":"地名（较少见，用于某些地区）。"},"examples":[{"en":"They stayed near Alvera during their trip.","zh":"他们旅行时住在 Alvera 附近。"}]}],"phonetic":"/ælˈvɪrə/","extraExplanation":["“Alvera”通常作为英文世界中的人名出现，整体感觉偏传统、复古（在一些家庭中作为纪念长辈的名字使用）。","作为专有名词（人名/地名）时，英文里一般不加冠词；称呼某人可用“Alvera”（名）或“Ms./Mr. Alvera”（姓）。","人名的词源在不同地区可能有不同解释与拼写变体（如 Alvera/Alverna/Alvaro 等），因此若你是在特定国家/家族语境里看到这个名字，含义可能会更具体。"]}
{"word":"Alverda","summary":{"en":"Alverda is a proper noun used as an uncommon given name and also as the name of some places (especially in the U.S.).","zh":"Alverda 是专有名词，可作较少见的人名，也可作一些地点（尤其在美国）的地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (usually feminine), used in English-speaking contexts but relatively uncommon","zh":"人名（多为女性名），在英语语境中使用但较少见"},"examples":[{"en":"Alverda moved to Chicago for her new job.","zh":"Alverda 为了新工作搬到了芝加哥。"},{"en":"They named their daughter Alverda to honor a family tradition.","zh":"他们给女儿取名 Alverda，以纪念家族传统。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun), such as small communities in the United States","zh":"地名（专有名词），例如美国的一些小社区名称"},"examples":[{"en":"He grew up near Alverda, Pennsylvania.","zh":"他在宾夕法尼亚州的 Alverda 附近长大。"},{"en":"Our road trip passed through Alverda on the way to the mountains.","zh":"我们去山里的自驾途中经过了 Alverda。"}]}],"synonyms":["(No direct synonyms; proper names usually don’t have synonyms.)"],"phonetic":"/ælˈvɝdə/","extraExplanation":["“Alverda”多见于美国的专名（人名或地名），因此通常首字母大写。不同地区或家庭可能有不同的读法；在不确定时，可以礼貌地问对方：\"How do you pronounce your name?\"（你的名字怎么读？）","在词源上，它常被认为与更常见的名字（如 Alberta/Alvina 等）在形式上相近，可能是变体拼写或家族化拼写；但具体来源往往取决于个人或地方历史，未必有单一、统一的“标准词源”。"]}
{"word":"Alverson","summary":{"en":"Alverson is mainly used as a surname (last name), and less commonly as a place name.","zh":"Alverson 主要用作英文姓氏（last name），较少情况下也可能是地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), used as a last name for people (e.g., in the U.S.).","zh":"姓氏（家族姓），用作人的英文姓/最后一个名字（在美国等地常见）。"},"examples":[{"en":"My professor’s last name is Alverson.","zh":"我教授的姓是 Alverson。"},{"en":"Please write “Alverson, Jamie” at the top of the form.","zh":"请在表格顶部写“Alverson, Jamie”。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name in some English-speaking regions (less common).","zh":"地名（在一些英语地区存在，但不常见）。"},"examples":[{"en":"They drove through Alverson on their way to the lake.","zh":"他们去湖边的路上开车经过了 Alverson。"}]}],"synonyms":["surname","last name","family name"],"phonetic":"/ˈæl.vɚ.sən/","extraExplanation":["“Alverson”多见于英语国家的姓氏体系里，常被理解为“某人的儿子/后代”这一类的传统构词方式（类似 Anderson、Johnson）。具体家族来源可能因不同家谱而异。"]}
{"word":"Alverta","summary":{"en":"Alverta is usually a proper noun: most commonly a woman’s name, and sometimes a place name.","zh":"Alverta 通常是专有名词：最常见是女性名字，有时也可作地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (a personal name), sometimes used as a variant spelling of Alberta.","zh":"女性名字（人名），有时被视为 Alberta 的变体拼写。"},"examples":[{"en":"Alverta moved to Chicago to start her new job.","zh":"Alverta 搬到芝加哥开始她的新工作。"},{"en":"My great-aunt Alverta loved gardening and classical music.","zh":"我姑婆 Alverta 喜欢园艺和古典音乐。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun) used in some communities, businesses, or local landmarks.","zh":"地名（专有名词），在一些社区、商家或地方地标中可能会出现。"},"examples":[{"en":"We drove through a small area called Alverta on the way to the coast.","zh":"我们去海边的路上经过一个叫 Alverta 的小地方。"},{"en":"The event is held at the Alverta Community Center.","zh":"活动在 Alverta 社区中心举行。"}]}],"synonyms":["Alberta (variant spelling in some cases)"],"phonetic":"/ælˈvɝtə/","extraExplanation":["“Alverta”多见于英语语境中的专有名词（人名/地名），一般不当作普通词汇使用，因此在词典里可能不常单独收录。","读音在不同家庭或地区可能略有差异；在不确定时，礼貌的做法是直接询问对方更偏好的发音（How do you pronounce your name?).","作为名字时，它常被认为与“Alberta”在形式上接近，可能是拼写变体或家族取名习惯造成的差异。"]}
{"word":"Alverton","summary":{"en":"Alverton is a proper name, usually a place name (especially in England) and sometimes a surname.","zh":"Alverton 是专有名词，通常指地名（尤其在英国），有时也用作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a proper name used mainly as a place name (especially in England), and sometimes as a family name (surname).","zh":"专有名词：主要用作地名（尤其在英国），有时也用作姓氏。"},"examples":[{"en":"She grew up near Alverton before moving to London.","zh":"她在阿尔弗顿附近长大，后来搬到伦敦。"},{"en":"The old map marks Alverton as a small settlement.","zh":"这张老地图把阿尔弗顿标为一个小聚落。"},{"en":"Mr. Alverton signed the letter at the bottom.","zh":"阿尔弗顿先生在信末签了名。"}]}],"synonyms":["(no direct synonyms; related: place name, surname)"],"phonetic":"ˈæl.vɚ.tən","extraExplanation":["“Alverton”多见于英国地名：在康沃尔（Cornwall）等地可见同名地点或相关地名（如 Alverton Manor / Alverton House 等），具体指向要看上下文（城市、郡、邮编或附近地标）。","词源上常见的“-ton”来自古英语，原意与“农庄、村落、聚居地”相关；因此很多英国地名以“-ton”结尾。"]}
{"word":"Alves","summary":{"en":"“Alves” is mainly used as a Portuguese-origin surname (a family name).","zh":"“Alves”主要用作源自葡语的姓氏（家族姓）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), common in Portuguese-speaking countries (and also seen in Spanish-speaking contexts).","zh":"一个姓氏（家族姓），在葡语国家很常见（在部分西语语境中也能见到）。"},"examples":[{"en":"Dani Alves is a famous Brazilian football player.","zh":"Dani Alves（达尼·阿尔维斯）是一位著名的巴西足球运动员。"},{"en":"Ms. Alves will lead the meeting today.","zh":"Alves 女士今天将主持会议。"},{"en":"I’m emailing Dr. Alves about the appointment.","zh":"我正在给 Alves 医生发邮件确认预约。"}]}],"synonyms":["(surname) Silva","(surname) Santos","(surname) Costa"],"phonetic":"/ˈæl.vz/","extraExplanation":["“Alves”通常被当作专有名词（姓氏）使用，而不是普通词汇；在英文里写作首字母大写：Alves。","发音在英语环境中常被读作 /ˈæl.vz/（类似“AL-vz”）；但在葡萄牙语里可能更接近“AL-ves/AL-vish”的音色（不同地区略有差异）。","文化语境：巴西、葡萄牙等地较常见；体育、音乐等领域你可能会遇到这个姓（如巴西球员 Dani Alves）。"]}
{"word":"Alveta","summary":{"en":"Alveta is most commonly used as a female first name.","zh":"Alveta 最常见的用法是作为女性名字（名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (first name).","zh":"女性名字（名）。"},"examples":[{"en":"Alveta moved to Chicago for a new job.","zh":"阿尔维塔为了新工作搬到了芝加哥。"},{"en":"We invited Alveta to join our study group.","zh":"我们邀请阿尔维塔加入我们的学习小组。"}]}],"synonyms":["Alveda","Alvita"],"phonetic":"/ælˈviːtə/","extraExplanation":["“Alveta”在英语里主要作为人名使用，不是常见词汇，因此通常不出现在普通词典的核心词条中。","发音在不同家庭或地区可能有差异；常见读法接近“al-VEE-tuh”。","它有时会被看作与相近的人名（如 Alveda / Alvita）同一类型的变体拼写；具体含义往往取决于家庭取名的来源与偏好，而不一定有固定、统一的词源解释。"]}
{"word":"alveus","summary":{"en":"Alveus is an anatomical term meaning a trough-like cavity or channel, most commonly the white matter layer on the surface of the hippocampus.","zh":"Alveus 是解剖学术语，指槽状的腔/沟；最常见用法是指海马体表面的一层白质结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A channel, trough, or cavity in the body (an anatomical term), especially a groove-like structure in the brain (the white matter layer covering the hippocampus).","zh":"（解剖）体内的沟槽、槽状通道或腔；尤指大脑中覆盖海马体的一层白质结构（海马槽/海马白质层，常称 alveus of the hippocampus）。"},"examples":[{"en":"In neuroanatomy, the alveus is the white matter layer on the surface of the hippocampus.","zh":"在神经解剖学中，alveus 指海马体表面的一层白质结构。"},{"en":"The report mentioned changes near the hippocampal alveus.","zh":"报告提到海马 alveus 附近出现了变化。"}]},{"partOfSpeech":"n.","definition":{"en":"In general Latin-based scientific usage: a hollow, small cavity, or basin-like space.","zh":"（较泛的拉丁科学用法）空腔、小凹陷或盆状空间。"},"examples":[{"en":"The term alveus comes from Latin and can refer broadly to a hollow or trough.","zh":"alveus 源自拉丁语，广义上可指“凹槽/空腔/槽”。"}]}],"synonyms":["trough","groove","channel","cavity"],"phonetic":"/ˈælviəs/","extraExplanation":["alveus 是较少见、偏专业的解剖学词，多出现在神经解剖（如“alveus of the hippocampus”）或拉丁化的医学文献中。日常英语里更常见的是 alveolus / alveoli（肺泡）——两者词源相近但指代的结构不同，别混淆。"]}
{"word":"Alvia","summary":{"en":"Alvia is most commonly a personal name; in Spain it can also refer to Renfe’s “Alvia” passenger trains.","zh":"Alvia 最常见是人名；在西班牙语境中也可指 Renfe 的“Alvia”客运列车。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A given name (usually feminine), used in several languages; it may be chosen for its sound or as a variant/modern form of names like “Alva” or “Olivia.”","zh":"人名（多为女性名），在多种语言环境中可见；常因读音好听而取用，也可能被当作“Alva”或“Olivia”的变体/现代写法。"},"examples":[{"en":"Alvia introduced herself at the start of the meeting.","zh":"Alvia 在会议开始时做了自我介绍。"},{"en":"I’m not sure how to spell it—Alvia or Alviah?","zh":"我不确定怎么拼——是 Alvia 还是 Alviah？"}]},{"partOfSpeech":"other","definition":{"en":"(Spain) The name of a category of Renfe passenger trains (“Alvia”) that run on both high-speed and conventional rail lines.","zh":"（西班牙）Renfe（西班牙国家铁路）一种客运列车类别名“Alvia”，可在高速线与普通铁路线上运行。"},"examples":[{"en":"We took an Alvia train from Madrid to the north of Spain.","zh":"我们从马德里坐 Alvia 火车去了西班牙北部。"},{"en":"Is the Alvia included in this rail pass?","zh":"这张铁路通票包含 Alvia 吗？"}]}],"synonyms":["(as a name) Alva","(as a name) Olivia (similar-sounding)"],"phonetic":"/ˈælviə/","extraExplanation":["“Alvia”作为人名时，通常没有固定的单一来源或含义，更多是现代取名中偏重音感与独特性的选择；在不同家庭或文化语境里，也可能被解释为与“Alva / Olivia”等名字相关。","西班牙铁路语境中的“Renfe Alvia”指一种跨线路运行的中长途列车服务；如果你是在旅行、购票或看时刻表时遇到“Alvia”，一般就是这个意思。"]}
{"word":"alvia","summary":{"en":"Alvia is mainly used as a personal name; as a common word it’s uncommon and is often a misspelling of “salvia.”","zh":"Alvia 主要用作人名；作为普通词较少见，常是把 “salvia（鼠尾草）” 拼错。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A given name (usually feminine).","zh":"人名（通常为女性名）。"},"examples":[{"en":"Alvia moved to Chicago for graduate school.","zh":"Alvia 为了读研究生搬到了芝加哥。"},{"en":"We invited Alvia to join our book club.","zh":"我们邀请 Alvia 加入读书会。"}]},{"partOfSpeech":"n.","definition":{"en":"Often a misspelling of “salvia,” a plant in the mint family (some types are used in gardens or as herbs).","zh":"常见的拼写误写：指 “salvia”（鼠尾草属植物，属薄荷科；有些品种用于园艺或作香草）。"},"examples":[{"en":"The label probably meant salvia, not alvia.","zh":"标签上很可能是想写 salvia，而不是 alvia。"},{"en":"Salvia flowers attract bees and butterflies.","zh":"鼠尾草的花会吸引蜜蜂和蝴蝶。"}]}],"synonyms":["(name) —","salvia"],"phonetic":"ˈælviə","extraExplanation":["“Alvia”更常见的是人名；在英文里作为普通词并不常用。若你是在植物、香草或园艺语境中看到“alvia”，很可能是把“salvia（鼠尾草）”少写了开头的 s。","如果你能告诉我看到它的句子或场景（例如药草、花卉标签、品牌名等），我可以帮你确认最准确的意思。"]}
{"word":"Alviani","summary":{"en":"“Alviani” is usually a proper noun, most often the surname of the Italian Op Art/kinetic artist Getulio Alviani.","zh":"“Alviani”通常是专有名词，多指意大利欧普艺术/动态艺术家盖图利奥·阿尔维亚尼的姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surname, most commonly referring to Getulio Alviani (1939–2018), an Italian artist associated with Op Art and kinetic/optical art.","zh":"一个姓氏，最常指意大利艺术家盖图利奥·阿尔维亚尼（Getulio Alviani，1939–2018），与欧普艺术（Op Art）及动态/视觉错觉艺术相关。"},"examples":[{"en":"The museum mounted a small exhibition of Alviani’s reflective aluminum works.","zh":"博物馆举办了一场小型展览，展出阿尔维亚尼的反光铝材作品。"},{"en":"In our art history class, we compared Alviani with other Op Art artists from the 1960s.","zh":"在艺术史课上，我们把阿尔维亚尼与其他20世纪60年代的欧普艺术家作了比较。"}]}],"synonyms":["Getulio Alviani","Op Art artist","kinetic artist"],"phonetic":"/ælviˈɑːni/","extraExplanation":["“Alviani”通常不是英文词汇，而是专有名词（人名/姓氏）。如果你是在艺术语境中看到它，多半指Getulio Alviani：他常用金属表面加工与光线反射，制造“会动”的视觉效果。","发音在英语里一般会按意大利姓氏的节奏读，重音常落在后半部分。若你指的是另一位名叫Alviani的人（例如作者、演员、品牌），告诉我上下文我可以更精准解释。"]}
{"word":"alviducous","summary":{"en":"“alviducous” is not recognized as a standard English word; it is likely a misspelling.","zh":"“alviducous”不是标准英语词，较可能是拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it does not appear in major English dictionaries and is likely a misspelling or a rare/obsolete technical form.","zh":"不是标准英语单词；在主流英语词典中查不到，可能是拼写错误或极少见/已废弃的专业形式。"},"examples":[{"en":"I couldn’t find “alviducous” in a dictionary, so I checked whether it was misspelled.","zh":"我在词典里找不到“alviducous”，所以我去确认它是不是拼错了。"},{"en":"If you meant a biology term, you might be looking for a different word.","zh":"如果你想找的是生物学术语，可能需要换一个正确的词。"}]}],"synonyms":["(none—nonstandard form)"],"phonetic":"/ˌælviˈduːkəs/","extraExplanation":["“alviducous”看起来像由拉丁语词根拼出来的词，但在现代英语里不常见。最可能的情况是拼写误差。","如果你想表达与“输卵管/卵管”有关的概念，常见词是 **oviduct**（卵管/输卵管）。如果你能提供原句或你想表达的意思（比如“生物学、解剖学、鸟类繁殖”等语境），我可以帮你定位最可能的正确单词。"]}
{"word":"Alvie","summary":{"en":"Alvie is most commonly used as a personal name or nickname, often a friendly short form of longer names (e.g., Alvin).","zh":"Alvie 多用于人名或昵称，常作为较长名字（如 Alvin）的亲昵简称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A given name or nickname, usually a shortened form of names like Alvin, Alvaro, Alvis, or (in some families) Alfred/Alfredo.","zh":"人名或昵称，常见作 Alvin、Alvaro、Alvis 等名字的简称；在一些家庭中也可能来自 Alfred/Alfredo 等名字的爱称。"},"examples":[{"en":"Alvie is coming over after school.","zh":"Alvie 放学后会过来。"},{"en":"My grandpa’s name was Alvin, but everyone called him Alvie.","zh":"我爷爷叫 Alvin，但大家都叫他 Alvie。"}]}],"synonyms":["Alvin","Al","Alvy","Alvis"],"phonetic":"/ˈælvi/","extraExplanation":["“Alvie”更常见于口语里的昵称或家庭用名（pet name）。在英语里，像 -ie/-y 这样的结尾（如 Charlie, Maggie, Annie）常用来表示亲昵或口语化的称呼。","它并不是一个固定对应某个“唯一原名”的昵称：不同地区、不同家庭可能把它当作不同名字的简称使用。"]}
{"word":"Alvin","summary":{"en":"Alvin is a common male first name in English-speaking cultures.","zh":"Alvin 是英语文化中常见的男性名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name).","zh":"男性名字（名）。"},"examples":[{"en":"Alvin is my classmate.","zh":"Alvin 是我的同学。"},{"en":"My uncle Alvin lives in California.","zh":"我叔叔 Alvin 住在加州。"}]}],"synonyms":["(As a name) none; related names: Al, Alvinus (rare)"],"phonetic":"/ˈælvɪn/","extraExplanation":["“Alvin”常见于英语国家的男性名，来源与古英语名字有关，常被解释为与“高贵的朋友 / 老朋友”之类的含义相关（不同资料解释略有差异）。","在流行文化中，你可能见过《Alvin and the Chipmunks》（《艾尔文与花栗鼠》）里的角色 Alvin，这让这个名字更为人熟悉。"]}
{"word":"alvin","summary":{"en":"Alvin is a common English male first name.","zh":"Alvin 是常见的英文男性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name).","zh":"男性名字（名）。"},"examples":[{"en":"Alvin is my cousin’s name.","zh":"Alvin 是我表哥的名字。"},{"en":"Alvin sent me a message after class.","zh":"下课后 Alvin 给我发了消息。"}]}],"synonyms":["(no direct synonyms; related names: Al, Alvinus)"],"phonetic":"/ˈæl.vɪn/","extraExplanation":["“Alvin”常见于英语国家的男性名，词源可追溯到古英语名字 **Ælfwine**，大意是“精灵的朋友”（elf + friend）。","在流行文化中，**Alvin** 也常让人想到动画/音乐团体 **Alvin and the Chipmunks**（《鼠来宝》）里的主角名。","一些知名人物也叫 Alvin，如美国现代舞编舞家 **Alvin Ailey**。"]}
{"word":"Alvina","summary":{"en":"Alvina is a female first name.","zh":"Alvina 是一个女性英文名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (first name).","zh":"女性名字（名）。"},"examples":[{"en":"Alvina is starting a new job next Monday.","zh":"Alvina 下周一开始一份新工作。"},{"en":"I met Alvina at a friend’s birthday party.","zh":"我在朋友的生日派对上认识了 Alvina。"}]}],"synonyms":["Alvin","Elvina","Alvyna"],"phonetic":"/ælˈviːnə/","extraExplanation":["“Alvina”多被视为女性名，常被认为与男性名“Alvin”有关。其词源通常追溯到古日耳曼语系：alf（精灵）+ win（朋友），所以有时会被解释为“精灵的朋友/高贵的朋友”等带有传说色彩的含义。","在英语语境中，它是一个相对少见但可识别的名字；书面或正式场合通常首字母大写：Alvina。"]}
{"word":"alvina","summary":{"en":"Alvina is a female first name used in English-speaking contexts.","zh":"Alvina 是英语语境中使用的女性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (first name).","zh":"女性名字（名）。"},"examples":[{"en":"Alvina moved to Chicago for a new job.","zh":"Alvina 为了新工作搬去了芝加哥。"},{"en":"Our teacher, Ms. Alvina Reyes, is very patient.","zh":"我们的老师 Alvina Reyes 女士很有耐心。"}]}],"synonyms":["Elvina","Alvin (related name)","Alwina (variant)"],"phonetic":"/ælˈviːnə/","extraExplanation":["“Alvina”通常被认为与日耳曼语系名字有关，常见解释是源自“Alwin/Alvin”等名字的女性形式：al-（与“高贵/精灵”相关的词根解释之一）+ -win（朋友），因此常被解读为“高贵的朋友/高贵的伙伴”。不同资料对词根含义可能略有差异，但整体属于传统欧洲名字体系。","在英语语境中，它主要作为专有名词使用：首字母大写（Alvina）。填写表格或证件时属于 given name/first name。"]}
{"word":"Alvine","summary":{"en":"Alvine is most commonly a personal name; lowercase alvine can also mean “intestinal,” mainly in medical writing.","zh":"Alvine 最常见是人名；小写 alvine 也可指“肠的/腹部的”，多用于医学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (usually feminine), used in English and French contexts.","zh":"人名（多为女性名），在英语和法语语境中可见。"},"examples":[{"en":"Alvine moved to Chicago for graduate school.","zh":"Alvine 去芝加哥读研究生了。"},{"en":"In the novel, Alvine is portrayed as quiet but determined.","zh":"在小说里，Alvine 被塑造成安静但很坚定的人。"}]},{"partOfSpeech":"adj.","definition":{"en":"(alvine) relating to the intestines or the belly; intestinal.","zh":"（alvine）与肠道或腹部有关的；肠的。"},"examples":[{"en":"The report mentioned alvine pain after the meal.","zh":"报告提到饭后出现肠腹部疼痛。"},{"en":"This is a medical term, so it’s uncommon in everyday speech.","zh":"这是医学术语，日常口语中不常用。"}]}],"synonyms":["Alvina","Alvin","Elvine"],"phonetic":"/ælˈvaɪn/","extraExplanation":["“Alvine”作为人名时，常被视为与“Alvin/Alvina”等名字有关的变体；不同地区可能发音略有差异。","注意区分大小写：小写“alvine”是较少见的医学用词，来自拉丁语词根，含“腹/肠”相关之意。"]}
{"word":"alvine","summary":{"en":"“Alvine” is a formal/medical adjective meaning “related to the intestines or bowels.”","zh":"“alvine”是偏医学/正式的形容词，表示“与肠道或排便相关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the abdomen or intestines; connected with bowel functions (a medical or formal word).","zh":"与腹部或肠道有关的；与排便功能相关的（医学/正式用语）。"},"examples":[{"en":"The doctor asked about any alvine pain or discomfort.","zh":"医生询问是否有与肠道相关的疼痛或不适。"},{"en":"The report noted changes in alvine activity after the medication.","zh":"报告指出用药后肠道活动出现变化。"},{"en":"Alvine symptoms like constipation should be discussed with a clinician.","zh":"像便秘这类肠道症状应与临床医生讨论。"}]}],"synonyms":["intestinal","bowel","abdominal (broader)","enteric (medical)"],"phonetic":"/ˈælvaɪn/","extraExplanation":["“alvine”较少用于日常口语，更常见于医学写作或较老的正式文体；日常表达通常用“intestinal / bowel / abdominal”。","词源来自拉丁语“alvus”（腹、肠道、腹腔），因此多与消化与排便相关的语境相连。"]}
{"word":"Alvinia","summary":{"en":"Alvinia is usually a rare female given name related to Alvin/Alvina; in scientific writing it can also appear as a capitalized genus name in biology.","zh":"Alvinia 通常是较少见的女性名字（与 Alvin/Alvina 相关）；在科学写作中也可能作为生物分类学里的属名出现（需大写）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a female given name (a rare form related to Alvin/Alvina).","zh":"女性名字（较少见，常被视为 Alvin/Alvina 的变体）。"},"examples":[{"en":"Alvinia moved to Chicago for graduate school.","zh":"Alvinia 去芝加哥读研究生了。"},{"en":"In the story, Alvinia is the youngest sister.","zh":"在故事里，Alvinia 是最小的妹妹。"}]},{"partOfSpeech":"n.","definition":{"en":"(biology) a scientific genus name used in taxonomy in some contexts (capitalized).","zh":"（生物）在某些分类学语境中使用的属名（首字母大写）。"},"examples":[{"en":"The paper compares Alvinia with related genera.","zh":"这篇论文把 Alvinia 和相关属进行了比较。"},{"en":"Alvinia is written with a capital A in scientific names.","zh":"在学名中，Alvinia 的 A 要大写。"}]}],"synonyms":["Alvina","Alvin","Elvina"],"phonetic":"/ælˈvɪniə/","extraExplanation":["作为人名时，Alvinia 通常被理解为 Alvin 的女性化形式之一；Alvin 常被追溯到古英语名 Ælfwine，含义大致为“精灵之友/朋友”。因此在文学或取名语境里，它常带一点古典、奇幻或复古的气质。","如果你是在课本/论文里看到 Alvinia，最好观察上下文：在人名场景它是专有名词；在生物分类中则可能是拉丁化的属名写法（通常出现在斜体学名体系中）。"]}
{"word":"Alvino","summary":{"en":"Alvino is mainly used as a given name or surname.","zh":"Alvino 主要用作人名（名字）或姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a personal name (given name) used for people, especially in communities with Italian, Spanish, or Filipino naming traditions.","zh":"人名（名字）；常见于有意大利语、西班牙语或菲律宾等命名传统的社群。"},"examples":[{"en":"Alvino introduced himself at the meeting.","zh":"Alvino 在会议上做了自我介绍。"},{"en":"My classmate Alvino is from Manila.","zh":"我的同学 Alvino 来自马尼拉。"}]},{"partOfSpeech":"other","definition":{"en":"a family name (surname).","zh":"姓氏。"},"examples":[{"en":"Dr. Alvino will see you now.","zh":"Alvino 医生现在可以见你了。"},{"en":"The book was written by Maria Alvino.","zh":"这本书由 Maria Alvino 所著。"}]}],"synonyms":["Alvin","Alvina"],"phonetic":"/ælˈviːnoʊ/","extraExplanation":["“Alvino”通常被当作专有名词（人名/姓氏）使用，因此在句子里一般不加冠词（不说 *the Alvino*）。","在英语环境中，人们有时会把它看作名字“Alvin”的一种变体（多了结尾 -o，风格更偏拉丁语系/意大利语系），但具体来源仍可能因家族与地区而不同。"]}
{"word":"Alvira","summary":{"en":"Alvira is a female personal name, sometimes a variant of Elvira.","zh":"Alvira 是一个女性人名，有时被看作 Elvira 的变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feminine given name (a personal name), used in several cultures; sometimes seen as a variant spelling of “Elvira.”","zh":"女性名字（人名）；在一些文化中使用，有时被视为 “Elvira” 的变体拼写。"},"examples":[{"en":"Alvira moved to Chicago for college.","zh":"Alvira 为了上大学搬到了芝加哥。"},{"en":"Our neighbor, Alvira, speaks both English and Spanish.","zh":"我们的邻居 Alvira 会说英语和西班牙语。"},{"en":"In the story, Alvira is the character who solves the mystery.","zh":"在故事里，Alvira 是解开谜团的角色。"}]}],"synonyms":["Elvira"],"phonetic":"/ælˈvaɪrə/","extraExplanation":["“Alvira”多见于姓名语境，属于专有名词（proper noun），通常不翻译含义，而是按读音音译或直接保留原拼写。","它常被认为与西班牙语/欧洲语境中的“Elvira”相关（拼写或地区变体）。在英语文本里出现时，多用作人物名；正式写作中首字母要大写。"]}
{"word":"Alvis","summary":{"en":"Alvis is usually a male personal name, and it can also refer to a historic British vehicle brand (Alvis Cars).","zh":"Alvis 通常是男性人名，也可指英国历史上的车辆品牌（Alvis Cars）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a masculine given name (first name), used mainly in English-speaking contexts; also used as a surname.","zh":"男性名字（名），主要见于英语语境；也可作姓氏。"},"examples":[{"en":"Alvis is my classmate from Texas.","zh":"Alvis 是我来自德州的同学。"},{"en":"I met Dr. Alvis at the conference.","zh":"我在会议上见到了 Alvis 博士。"}]},{"partOfSpeech":"n.","definition":{"en":"a British brand name historically associated with Alvis Cars, a maker of cars and military vehicles (especially in the 20th century).","zh":"英国品牌名，历史上指 Alvis（阿尔维斯）公司，20 世纪曾生产汽车与军用车辆。"},"examples":[{"en":"He collects old Alvis cars.","zh":"他收藏老款的 Alvis 汽车。"},{"en":"The museum has an Alvis armored vehicle on display.","zh":"博物馆展出了一辆 Alvis 装甲车。"}]}],"synonyms":["Alvarez (different name; not the same meaning)","Elvis (similar-looking name; different name)"],"phonetic":"/ˈæl.vɪs/","extraExplanation":["“Alvis”作为人名在英语里并不算特别常见，但在美国也会出现。不同地区可能有不同的读法；在日常交流中，直接问对方偏好的发音是礼貌且常见的做法。","“Alvis Cars”是英国历史上的汽车品牌；如果你在文章、纪录片或汽车收藏语境里看到 Alvis，往往指这家公司或其车型，而不是人名。"]}
{"word":"Alviso","summary":{"en":"Alviso is most commonly a place name in San José, California (near the south end of San Francisco Bay); it can also be a surname.","zh":"Alviso最常见是美国加州圣何塞的一处地名（靠近旧金山湾南端）；也可作姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a neighborhood in San José, California, at the southern end of San Francisco Bay; historically a small port town (formerly an incorporated city).","zh":"美国加州圣何塞（San José）的一处社区，位于旧金山湾（San Francisco Bay）南端；历史上曾是小型港口城镇（曾短暂为独立建制城市）。"},"examples":[{"en":"We drove to Alviso to walk the bay trails and watch birds.","zh":"我们开车去阿尔维索（Alviso）走海湾步道、看鸟。"},{"en":"Alviso was once an important landing point for goods traveling to San José.","zh":"阿尔维索曾经是货物运往圣何塞的重要靠岸点。"}]},{"partOfSpeech":"other","definition":{"en":"a family name (surname), especially in Spanish-speaking contexts.","zh":"姓氏（尤其在西语语境中常见）。"},"examples":[{"en":"Ms. Alviso will join the meeting at 3 p.m.","zh":"阿尔维索女士将在下午三点参加会议。"}]}],"synonyms":["Alviso (San José)","Alviso District"],"phonetic":"/ælˈviːsoʊ/","extraExplanation":["“Alviso”在湾区常被当作地名使用，读法在英语里通常重音落在中间音节附近。它与周边的湿地、候鸟栖息地、以及旧金山湾南端的盐田景观联系紧密，因此在旅游、自然教育和生态保护的语境中经常出现。","历史上这里与港口、运输和填海/湿地变化有关；如今也常与Don Edwards San Francisco Bay National Wildlife Refuge（旧金山湾国家野生动物保护区）等自然保护区域一起被提到。"]}
{"word":"Alviss","summary":{"en":"Alviss is usually a male personal name (a variant of Alvis) and can also refer to a dwarf in Norse mythology from “Alvíssmál.”","zh":"Alviss 通常是男性人名（Alvis 的变体拼写），也可指北欧神话《Alvíssmál》中的矮人 Alviss。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A masculine given name (a variant spelling of Alvis), used as a personal name.","zh":"男性名字（Alvis 的一种拼写变体），用作人名。"},"examples":[{"en":"Alviss introduced himself and shook everyone’s hand.","zh":"Alviss 做了自我介绍，并和大家一一握手。"},{"en":"Alviss is a less common spelling than Alvis.","zh":"Alviss 这个拼写比 Alvis 更少见。"}]},{"partOfSpeech":"n.","definition":{"en":"In Norse mythology, a dwarf named Alviss who appears in the Old Norse poem “Alvíssmál,” where he answers many questions about names for things in different worlds.","zh":"在北欧神话中，名为 Alviss 的矮人，出现在古诺尔斯诗歌《Alvíssmál》中；他回答关于不同世界对万物称呼的大量问题。"},"examples":[{"en":"In “Alvíssmál,” Alviss tries to prove his wisdom by naming things in many realms.","zh":"在《Alvíssmál》中，Alviss 通过说出不同领域对事物的称呼来证明自己的智慧。"},{"en":"The story connects Alviss with Thor in a famous mythic exchange.","zh":"这个故事把 Alviss 和雷神索尔（Thor）联系在一次著名的神话对话中。"}]}],"synonyms":["Alvis","Alvíss","Alvíssmál"],"phonetic":"/ˈæl.vɪs/","extraExplanation":["“Alviss”常见于北欧神话相关语境；在英文学术或译本中也可能写作“Alvíss”（带重音符号）。","名字在不同文化里可能有不同来源与含义；如果你是在某个文本、游戏或姓名里看到“Alviss”，我也可以根据具体上下文帮你判断更贴近哪一种用法。"]}
{"word":"Alvissmal","summary":{"en":"Alvissmal is an Eddic Old Norse poem where Thor questions the dwarf Alvíss, who lists many different names for the same things across beings and worlds.","zh":"Alvissmal（《Alvíssmál》）是一首《诗体埃达》诗歌：索尔盘问侏儒阿尔维斯，他列出同一事物在不同族群与世界中的多种称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An Old Norse (Poetic Edda) poem in which the dwarf Alvíss (“All-wise”) answers the god Thor’s questions by listing many names for the same things (like the sun, moon, earth) used by different beings (humans, gods, giants, etc.).","zh":"一首古诺尔斯语《诗体埃达》中的诗歌，内容是侏儒阿尔维斯（意为“全知者”）回答雷神索尔的提问，列出同一事物（如太阳、月亮、大地）在不同族群/存在（人类、诸神、巨人等）中的不同称呼。"},"examples":[{"en":"In Alvissmal, Thor stalls the dwarf with questions until sunrise.","zh":"在《Alvissmal》中，索尔用不停提问拖住侏儒，直到日出。"},{"en":"Students read Alvissmal to learn how Old Norse poetry preserves multiple word-forms for nature.","zh":"学生常读《Alvissmal》，了解古诺尔斯诗歌如何保存自然事物的多种称呼。"}]}],"synonyms":["Alvíssmál","The Lay of Alvíss","Poetic Edda","Eddic poem"],"phonetic":"/ˈælviːsˌmɑl/","extraExplanation":["“Alvissmal”常见的标准写法是带重音符号的“Alvíssmál”。其中“-mál”在古诺尔斯语里有“言语、说法、诗篇/歌”的意思，因此题名常译为“阿尔维斯之言/阿尔维斯之歌（The Lay of Alvíss / Alvíss’s Sayings）”。","这首诗的独特之处在于它像一份“同义词/称谓清单”：通过问答把不同世界（诸神、人类、精灵、巨人、矮人等）对同一事物的不同叫法展示出来，对理解北欧神话的世界观和诗歌用语（类似“诗语/替代称呼”）很有价值。"]}
{"word":"alvissmal","summary":{"en":"Alvíssmál is an Old Norse Edda poem where Thor questions the dwarf Alvíss, producing many poetic names for common things.","zh":"Alvíssmál 是《诗体埃达》中的古诺尔斯诗歌：索尔盘问侏儒阿尔维斯，从而引出大量事物的诗性别名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Alvíssmál: a poem (lay) in the Old Norse Poetic Edda, written as a dialogue where the dwarf Alvíss answers Thor’s questions by listing many poetic names for the same things (like “sun,” “moon,” “earth”) across different beings (gods, humans, giants, etc.).","zh":"Alvíssmál：《诗体埃达》中的一首古诺尔斯诗歌（“歌/诗章”），以对话形式展开：侏儒阿尔维斯（Alvíss）回答雷神索尔（Thor）的提问，通过列举同一事物在不同族群（诸神、人类、巨人等）中的不同称呼（如“太阳”“月亮”“大地”），展示北欧诗歌的“别名/诗性称呼”。"},"examples":[{"en":"In Alvíssmál, Thor keeps Alvíss talking until sunrise.","zh":"在《Alvíssmál》中，索尔不断让阿尔维斯说下去，直到天亮。"},{"en":"The poem is famous for its long lists of names for everyday things.","zh":"这首诗以对日常事物的大量“名称清单”而闻名。"},{"en":"Students of Norse myth often read Alvíssmál to learn traditional poetic word choices.","zh":"学习北欧神话的人常读《Alvíssmál》，用来了解传统诗歌用词与“别名”表达。"}]}],"synonyms":["Alvíssmál (standard spelling)","Alvissmal (common simplified spelling)"],"phonetic":"/ˈɑlviːsˌmɑl/","extraExplanation":["你输入的“alvissmal”更常见的规范拼写是 **Alvíssmál**（带重音符号），英语资料里也常写作 **Alvissmal**（不加重音）。","标题里的 **-mál** 在古诺尔斯语中有“言语、谈话、诗章/篇章”的意思；整首诗的结构像“问答式词汇表”，与北欧诗歌中常见的“诗性称呼（kennings/替代名）”传统有关。","故事结局常被解读为索尔用“拖延到日出”的方式取胜：阿尔维斯见到阳光后变成石头，这是北欧民间传说中常见的“精怪畏日”母题。"]}
{"word":"Alvita","summary":{"en":"Alvita is most commonly used as a woman’s given name; it can also appear as a brand name for wellness products in some contexts.","zh":"Alvita 最常见是女性人名；在某些语境中也可作为健康/养生产品的品牌名出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feminine given name (a personal name)","zh":"女性名字（人名）"},"examples":[{"en":"Alvita is starting a new job next Monday.","zh":"Alvita 下周一开始新工作。"},{"en":"I met Alvita at a conference in Chicago.","zh":"我在芝加哥的一场会议上认识了 Alvita。"}]},{"partOfSpeech":"n.","definition":{"en":"(in some contexts) a brand name used for health or wellness products, such as herbal teas or supplements","zh":"（在某些语境中）用于健康/养生产品的品牌名，例如花草茶或营养补充品"},"examples":[{"en":"She bought an Alvita herbal tea at the grocery store.","zh":"她在杂货店买了一款 Alvita 花草茶。"},{"en":"Check the label to see whether the Alvita product contains caffeine.","zh":"看看标签，确认这款 Alvita 产品是否含咖啡因。"}]}],"synonyms":["(given name)"],"phonetic":"/ælˈviːtə/","extraExplanation":["“Alvita”常被理解为与拉丁语词根“vita”（生命）有关，因此有时会被联想到“生命、活力”之意。不过作为人名时，具体含义更多取决于家庭命名习惯与文化背景。","作为品牌名时，是否指特定公司/产品会因地区而异；在实际阅读中可通过上下文（如“tea, supplement, brand, label”）判断。"]}
{"word":"alvite","summary":{"en":"“Alvite” is likely a misspelling of “invite,” meaning to ask someone to come, or to cause/encourage a result.","zh":"“alvite”很可能是“invite”的拼写错误，意思是“邀请”，也可指“招致/引来（某种结果）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to ask someone to come to an event or place; to request someone’s presence","zh":"邀请（某人）参加活动或到某处；请求某人出席"},"examples":[{"en":"I invited my neighbors to dinner.","zh":"我邀请邻居来吃晚饭。"},{"en":"Did you invite her to the party?","zh":"你邀请她参加派对了吗？"}]},{"partOfSpeech":"vt.","definition":{"en":"to encourage a particular action or result (often unintentionally)","zh":"招致；引来（某种行为或结果，常常是无意的）"},"examples":[{"en":"Leaving the door unlocked invites trouble.","zh":"门不锁会招来麻烦。"},{"en":"His rude comment invited criticism.","zh":"他那句无礼的评论招来了批评。"}]}],"synonyms":["ask","invite over","host","welcome","encourage","prompt"],"phonetic":"/ɪnˈvaɪt/","extraExplanation":["“alvite”不是常见的标准英语单词。它很可能是拼写错误，最常见的目标词是 **invite**（把 n 写成了 l）。如果你本来想查的是其他词（比如 **albeit** /ɔlˈbiːɪt/ 表示“尽管”），告诉我上下文句子，我可以帮你确认。"]}
{"word":"Alvito","summary":{"en":"Alvito is most commonly a proper noun: a town/municipality in Portugal, and also a Portuguese surname (sometimes a given name).","zh":"Alvito 多为专有名词：既是葡萄牙的一个城镇/市镇地名，也可作葡萄牙姓氏（偶尔作名字）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a municipality and town in the Alentejo region of Portugal.","zh":"葡萄牙阿连特茹（Alentejo）地区的一个市镇/城镇，名为 Alvito（阿尔维托）。"},"examples":[{"en":"We stopped in Alvito while traveling through Alentejo.","zh":"我们在穿越阿连特茹旅行时在阿尔维托（Alvito）停留。"},{"en":"Alvito is known for its historic castle.","zh":"阿尔维托（Alvito）以其历史悠久的城堡而闻名。"}]},{"partOfSpeech":"other","definition":{"en":"a Portuguese name used as a surname and sometimes as a given name.","zh":"葡萄牙语中的人名，可作姓氏，也偶尔作名字。"},"examples":[{"en":"Her last name is Alvito.","zh":"她的姓是 Alvito。"},{"en":"Mr. Alvito will speak at the meeting.","zh":"Alvito 先生将在会议上发言。"}]}],"phonetic":"/ælˈviːtoʊ/","extraExplanation":["“Alvito”常见于葡萄牙语语境中，因此在英文里多作为专有名词使用：写作首字母大写，通常不加冠词（例如：in Alvito）。当它是地名时，可直接说“the town/municipality of Alvito”。"]}
{"word":"Alvo","summary":{"en":"Alvo usually means “target/aim” (from Portuguese). In Portuguese it can also mean “white/pale,” often in poetic style.","zh":"Alvo通常表示“目标/靶子”（源自葡语）。在葡语中它也可表示“白色/苍白”，常带诗歌或文学色彩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Portuguese) a target; an aim or objective.","zh":"（源自葡萄牙语）目标；靶子；要达成的目的"},"examples":[{"en":"The campaign’s main alvo is to reduce plastic waste.","zh":"这项活动的主要目标是减少塑料垃圾。"},{"en":"Keep your eyes on the alvo and don’t get distracted.","zh":"盯紧目标，不要分心。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Portuguese, less common in English contexts) white; pale (often in poetic or formal Portuguese).","zh":"（葡语义，在英语语境较少见）白色的；苍白的（常见于葡语诗歌或较正式表达）"},"examples":[{"en":"In Portuguese poetry, “alvo” may describe something bright white.","zh":"在葡语诗歌里，“alvo”可以用来形容明亮的白色。"},{"en":"He described the moon as alvo in an old verse.","zh":"他在一段古老诗句中把月亮形容为“alvo”（白皙明亮的）。"}]}],"synonyms":["target","aim","objective","goal","mark","white","pale"],"phonetic":"/ˈælvoʊ/","extraExplanation":["“Alvo”在英语里不是常见词；你更常在葡萄牙语/巴西葡语或双语语境中看到它。葡语里“alvo”最常用作名词表示“目标/靶子”，也可作形容词表示“白色的”，带一点文学或修辞色彩。","如果你是在特定领域看到大写“ALVO”，它也可能是某个组织/项目的缩写；需要结合上下文才能确定含义。"]}
{"word":"Alvord","summary":{"en":"Alvord is a proper noun used mainly as a surname and as a U.S. place name.","zh":"Alvord 是专有名词，主要用作姓氏，也可指美国的地名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname).","zh":"（人名）奥尔沃德：姓氏。"},"examples":[{"en":"Ms. Alvord will lead today’s meeting.","zh":"奥尔沃德女士将主持今天的会议。"},{"en":"I found an article by Alvord in the library database.","zh":"我在图书馆数据库里找到一篇奥尔沃德写的文章。"}]},{"partOfSpeech":"other","definition":{"en":"A place name in the United States (a proper noun), especially used for locations such as Alvord, Texas, and the Alvord Desert in Oregon.","zh":"（地名）奥尔沃德：美国的地名专有名词，例如德克萨斯州的 Alvord，以及俄勒冈州的 Alvord Desert（奥尔沃德沙漠）。"},"examples":[{"en":"We drove through Alvord, Texas on our way north.","zh":"我们向北开车时经过了德州的奥尔沃德。"},{"en":"The Alvord Desert is known for its wide, flat landscape.","zh":"奥尔沃德沙漠以广阔平坦的地貌而闻名。"}]}],"phonetic":"/ˈæl.vɔrd/","extraExplanation":["“Alvord”多见于英语世界的姓氏与地名，因此在句子里通常要大写。读写时可以通过上下文判断：前面有人名头衔（Mr./Ms./Dr.）多半是姓氏；前面有州名、desert、county、road 等，多半是地名。"]}
{"word":"Alvordton","summary":{"en":"Alvordton is a place name for a small unincorporated community in Ohio, USA.","zh":"Alvordton 是美国俄亥俄州的一个小型非建制社区的地名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A small unincorporated community (place name) in Williams County, Ohio, USA.","zh":"美国地名：位于俄亥俄州威廉斯县的一个小型非建制社区（聚居地）。"},"examples":[{"en":"Alvordton is a small community in northwest Ohio.","zh":"Alvordton 是俄亥俄州西北部的一个小社区。"},{"en":"She grew up near Alvordton before moving to Toledo.","zh":"她在 Alvordton 附近长大，后来搬到托莱多。"}]}],"phonetic":"/ˈæl.vɔrd.tən/","extraExplanation":["“Alvordton”属于专有名词（地名），通常不翻译，直接音译或保留英文拼写。","美国很多小社区被称为“unincorporated community（非建制社区）”，意思是它不是独立的市镇，没有自己的市政府，通常由县（county）或乡镇（township）管理。"]}
{"word":"alvus","summary":{"en":"Alvus is a rare medical/anatomical term meaning the abdomen or the bowels/intestines.","zh":"Alvus 是较少见的医学/解剖学术语，指腹部，或指肠道/肠（肠道系统）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy/medicine) The belly or abdomen; sometimes used to mean the intestines (the bowels).","zh":"（解剖/医学）腹部、肚子；有时也指肠道（肠/大便相关的“肠道”之意）。"},"examples":[{"en":"In older medical writing, alvus could refer to the abdomen as a whole.","zh":"在较早的医学写作中，alvus 有时指整个腹部。"},{"en":"Some texts use alvus to mean the bowels rather than the stomach.","zh":"有些文献用 alvus 指“肠道/排便系统”，而不是“胃”。"}]}],"synonyms":["abdomen","belly","intestines","bowels"],"phonetic":"/ˈælvəs/","extraExplanation":["alvus 是拉丁词，现代英语里主要见于医学/解剖学或较古旧的学术文献，不是日常用词。","在临床英语里更常用的说法是 abdomen（腹部）、belly（肚子，较口语）、intestines/bowels（肠道/肠）。","某些语境下它还可能与排便有关（例如“bowel function”），但具体含义要看原文的专业用法。"]}
{"word":"Alvy","summary":{"en":"Alvy is mainly a personal name; it can also refer to Alvy Singer, a famous character from the film *Annie Hall*.","zh":"Alvy 主要用作人名；也可指电影《安妮·霍尔》中的知名角色 Alvy Singer。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (usually masculine), often a nickname or variant of Alvin or Alva.","zh":"人名（多为男性名），常作 Alvin 或 Alva 的昵称或变体。"},"examples":[{"en":"Alvy is short for Alvin in some families.","zh":"在一些家庭里，Alvy 是 Alvin 的简称。"},{"en":"Alvy moved to New York for work.","zh":"Alvy 为了工作搬到了纽约。"}]},{"partOfSpeech":"n.","definition":{"en":"(in popular culture) the main character Alvy Singer in the film *Annie Hall* (1977).","zh":"（流行文化）电影《安妮·霍尔》（1977）中的主角 Alvy Singer（阿尔维·辛格）。"},"examples":[{"en":"In *Annie Hall*, Alvy Singer is played by Woody Allen.","zh":"在《安妮·霍尔》中，Alvy Singer 由伍迪·艾伦饰演。"},{"en":"The movie often shows Alvy’s anxious, witty way of talking.","zh":"这部电影常常展现 Alvy 焦虑又机智的说话方式。"}]}],"synonyms":["Alvin (related name)","Alva (related name)"],"phonetic":"/ˈælvi/","extraExplanation":["“Alvy”在英语里更多见于姓名而不是普通词汇，所以通常不需要翻译；写作时首字母大写。","如果你在电影或文学讨论中看到“Alvy”，常常是在指《安妮·霍尔》的角色“Alvy Singer”，这个名字也让“Alvy”带有一点纽约知识分子式、神经质又幽默的文化联想。"]}
{"word":"Alvyna","summary":{"en":"Alvyna is a female given name, a variant spelling of Alvina.","zh":"Alvyna 是女性名字，通常被视为 Alvina 的变体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feminine given name (a variant spelling of Alvina), used as a personal name.","zh":"女性名字（Alvina 的变体拼写），用作人名。"},"examples":[{"en":"Alvyna introduced herself at the meeting.","zh":"Alvyna 在会议上做了自我介绍。"},{"en":"I saw Alvyna’s name on the guest list.","zh":"我在宾客名单上看到了 Alvyna 的名字。"}]}],"synonyms":["Alvina","Alvyna (variant spelling)"],"phonetic":"/ælˈviːnə/","extraExplanation":["“Alvyna”一般被视为“Alvina/Alvina”的变体拼写。Alvina 常被认为与日耳曼语系名字有关，可能与表示“精灵/妖精（elf）”的词根相关，因此有时会被解释为“朋友般的精灵/精灵之友”等含义（不同资料说法不一）。","作为专有名词（人名），它通常不翻译含义；在中文里多采用音译，如“阿尔维娜/阿尔薇娜”等，具体可按本人偏好或护照拼写来定。"]}

