{"word":"Alzada","summary":{"en":"Alzada is most commonly a U.S. place name (a small community in southeastern Montana).","zh":"Alzada 最常见的是美国地名（蒙大拿州东南部的一个小社区）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small unincorporated community in southeastern Montana, U.S., near the Wyoming and South Dakota borders (often used as a place name in addresses or travel directions).","zh":"（专有名词）美国蒙大拿州东南部的一个非建制小社区（常用于地址、旅行路线等作为地名）。"},"examples":[{"en":"We stopped for gas near Alzada on our way through southeastern Montana.","zh":"我们穿过蒙大拿州东南部时，在阿尔扎达附近停下来加油。"},{"en":"The ranch is about 20 miles from Alzada.","zh":"那个牧场离阿尔扎达大约20英里。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare in English; from Spanish) a ‘raising’ or ‘lift,’ sometimes seen in names or historical/Spanish-language contexts.","zh":"（英语中罕见；源自西班牙语）“抬起、 подня起（提升）”之意，多见于名称或历史/西语语境。"},"examples":[{"en":"The word appears in some place names that come from Spanish.","zh":"这个词会出现在一些源自西班牙语的地名中。"}]}],"synonyms":["(place name) Alzada, Montana"],"phonetic":"/ælˈzædə/","extraExplanation":["“Alzada”在英语里最常见的用法是地名（蒙大拿州的一个小社区），属于专有名词。","它常被认为与西班牙语 alzada 有关（来自 alzar“举起、抬高”），所以在地名里可能带有“升起、隆起、地势抬高”等联想。"]}
{"word":"alzheimer","summary":{"en":"Alzheimer’s (disease) is a progressive brain disorder that causes worsening memory and thinking problems.","zh":"Alzheimer’s（阿尔茨海默病）是一种进行性脑部疾病，会导致记忆和思维能力逐渐恶化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Alzheimer’s disease: a progressive brain disorder that slowly damages memory, thinking, and daily functioning, most often in older adults.","zh":"阿尔茨海默病：一种进行性脑部疾病，会逐渐损害记忆、思考能力和日常生活功能，常见于老年人。"},"examples":[{"en":"My grandmother has Alzheimer’s, so she sometimes forgets family names.","zh":"我奶奶得了阿尔茨海默病，所以她有时会忘记家人的名字。"},{"en":"Scientists are studying Alzheimer’s to find better treatments and early tests.","zh":"科学家正在研究阿尔茨海默病，以寻找更好的治疗方法和早期检测手段。"}]}],"synonyms":["Alzheimer’s disease","AD"],"phonetic":"/ˈɑlt͡shaɪmərz/","extraExplanation":["严格写法通常是 Alzheimer’s（带所有格撇号），源自德国医生 Alois Alzheimer 的姓氏。日常口语里人们也常说 “Alzheimer” 或简称 “Alzheimer’s”。","在表达时更礼貌、以人为本的说法包括：a person with Alzheimer’s（患阿尔茨海默病的人），避免用 “an Alzheimer’s patient” 给人贴标签。","它与 dementia（痴呆/失智）有关：Alzheimer’s 是最常见的一种 dementia，但 dementia 是更大的总称。"]}
{"word":"Alzheimer's","summary":{"en":"Alzheimer’s is a progressive brain disease that causes worsening memory and thinking problems; it is the most common cause of dementia.","zh":"Alzheimer’s（阿尔茨海默病）是一种进行性脑部疾病，会导致记忆与思维能力逐渐下降；是最常见的失智症原因。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a progressive brain disease that gradually damages memory, thinking, and daily functioning; the most common cause of dementia, especially in older adults","zh":"一种进行性脑部疾病，会逐渐损害记忆、思维和日常生活能力；也是最常见的失智症（痴呆）原因，尤其见于老年人"},"examples":[{"en":"My grandmother was diagnosed with Alzheimer’s two years ago.","zh":"我奶奶两年前被诊断为阿尔茨海默病。"},{"en":"Alzheimer’s can make it hard to remember recent conversations.","zh":"阿尔茨海默病会让人难以记住最近的对话。"},{"en":"The family hired a caregiver as Alzheimer’s symptoms became more severe.","zh":"随着阿尔茨海默病症状加重，这家人请了护工。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the disease Alzheimer’s (used before a noun)","zh":"与阿尔茨海默病有关的（作定语，用在名词前）"},"examples":[{"en":"Researchers are testing new Alzheimer’s treatments.","zh":"研究人员正在测试新的阿尔茨海默病治疗方法。"},{"en":"He joined an Alzheimer’s support group.","zh":"他加入了一个阿尔茨海默病互助小组。"}]}],"synonyms":["Alzheimer’s disease","AD (Alzheimer’s disease)","dementia (broader term)"],"phonetic":"/ˈɑːltshaɪmərz/","extraExplanation":["“Alzheimer’s”常作所有格形式使用（Alzheimer’s disease），口语和新闻里也常直接说“Alzheimer’s”。正式写作中更常见“Alzheimer’s disease（阿尔茨海默病）”。","词源来自德国医生Alois Alzheimer（阿洛伊斯·阿尔茨海默），他在20世纪初描述了这种疾病的典型病例。","学习提示：区分“Alzheimer’s（阿尔茨海默病）”与“dementia（失智症/痴呆）”。dementia是一个更大的类别（症状群），而Alzheimer’s是其中最常见的一种具体病因。"]}
{"word":"Alzheimer's disease","summary":{"en":"a progressive brain illness causing worsening memory and thinking problems","zh":"一种会逐步加重并影响记忆与思考能力的脑部疾病"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a progressive brain disorder that gradually damages memory, thinking, and daily functioning; the most common cause of dementia, especially in older adults","zh":"一种进行性脑部疾病，会逐渐损害记忆、思维与日常生活能力；也是最常见的失智症原因，尤其多见于老年人"},"examples":[{"en":"Alzheimer's disease often begins with mild memory loss, like misplacing everyday items.","zh":"阿尔茨海默病常以轻微的记忆力下降开始，比如把日常物品放错地方。"},{"en":"Her family learned ways to support her as Alzheimer’s disease progressed.","zh":"随着阿尔茨海默病加重，她的家人学习了如何支持与照护她。"},{"en":"Scientists are studying Alzheimer’s disease to understand how the brain changes over time.","zh":"科学家正在研究阿尔茨海默病，以了解大脑如何随时间发生变化。"}]}],"synonyms":["Alzheimer disease","AD","Alzheimer’s","senile dementia"],"phonetic":"/ˈɑlt͡sˌhaɪmərz dɪˈziz/","extraExplanation":["常見症狀包括：近期記憶變差、找詞困難、時間/地點感混亂、判斷力下降與情緒或人格改變。","它與一般「變老忘東忘西」不同：會影響日常功能並逐步惡化。若出現明顯困擾，建議就醫評估。","日常語境中有時會用 dementia（失智症）泛稱；Alzheimer’s disease 是其中最常見的一種類型。"],"etymology":"以德國精神科醫師 Alois Alzheimer 命名；1906 年他描述了典型病例，之後「Alzheimer’s disease」成為正式病名。","mnemonic":["把它想成「阿爾茨海默」=「阿（啊）…我（默）住了」：說不出、想不起，聯想到記憶與表達變困難。","記住縮寫 AD：可聯想到「A=Away（記憶離開）」+「D=Daily life（日常受影響）」。"]}

