{"word":"ANC","summary":{"en":"ANC is an acronym most commonly meaning the African National Congress or Active Noise Cancellation, but it can also mean antenatal care or absolute neutrophil count in medical contexts.","zh":"ANC 是一个缩写，最常见指非洲人国民大会或主动降噪；在医疗语境中也可能指产前护理或绝对中性粒细胞计数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often) African National Congress: a major political party in South Africa, historically central to the anti-apartheid movement.","zh":"（常指）非洲人国民大会：南非主要政党之一，历史上在反种族隔离运动中起关键作用。"},"examples":[{"en":"Nelson Mandela was a leader of the ANC.","zh":"纳尔逊·曼德拉曾是非洲人国民大会（ANC）的领导人。"},{"en":"The ANC won the national election.","zh":"非洲人国民大会（ANC）赢得了全国大选。"}]},{"partOfSpeech":"n.","definition":{"en":"Active Noise Cancellation: a technology that reduces unwanted sound by creating “anti-noise,” common in headphones.","zh":"主动降噪：通过产生“反向声音”来减少噪音的技术，常见于耳机。"},"examples":[{"en":"These earbuds have ANC, so the subway sounds much quieter.","zh":"这副耳机有主动降噪（ANC），所以地铁声音小多了。"},{"en":"Turn on ANC when you’re on a plane.","zh":"坐飞机时把主动降噪（ANC）打开。"}]},{"partOfSpeech":"n.","definition":{"en":"Antenatal care: medical care for a pregnant person before birth (more common in British English).","zh":"产前护理：指分娩前为孕妇提供的医疗照护（英式英语中更常见）。"},"examples":[{"en":"She goes to the clinic for ANC every month.","zh":"她每个月都去诊所做产前护理（ANC）。"},{"en":"Good ANC can help prevent complications.","zh":"良好的产前护理（ANC）有助于预防并发症。"}]},{"partOfSpeech":"n.","definition":{"en":"Absolute neutrophil count: a blood-test number showing how many neutrophils (a type of white blood cell) you have.","zh":"绝对中性粒细胞计数：血液检测指标，表示中性粒细胞（白细胞的一种）的数量。"},"examples":[{"en":"Your doctor will monitor your ANC during treatment.","zh":"治疗期间，医生会监测你的绝对中性粒细胞计数（ANC）。"},{"en":"A low ANC can increase infection risk.","zh":"ANC 偏低会增加感染风险。"}]}],"synonyms":["African National Congress","active noise cancellation","antenatal care","absolute neutrophil count"],"phonetic":"/ˌeɪɛnˈsiː/","extraExplanation":["“ANC”在不同领域含义差别很大：政治新闻里常指非洲人国民大会；消费电子里常指主动降噪；医疗场景里可能指产前护理或绝对中性粒细胞计数。判断含义最可靠的方法是看上下文（比如是否提到南非、耳机、孕检、抽血化验等）。"]}
{"word":"anc","summary":{"en":"ANC is a common abbreviation meaning the African National Congress, absolute neutrophil count, or active noise cancellation, depending on context.","zh":"ANC是常见缩写，可能指非洲人国民大会、中性粒细胞绝对计数或主动降噪，需结合语境判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"African National Congress (a major political party in South Africa, historically central to the anti-apartheid movement).","zh":"非洲人国民大会（南非主要政党之一，历史上在反种族隔离运动中起关键作用）。"},"examples":[{"en":"The ANC played a leading role in the struggle against apartheid.","zh":"非国大（ANC）在反对种族隔离的斗争中发挥了领导作用。"},{"en":"After 1994, the ANC became the governing party in South Africa.","zh":"1994年之后，非国大（ANC）成为南非的执政党。"}]},{"partOfSpeech":"n.","definition":{"en":"absolute neutrophil count (a blood-test number showing how many neutrophils you have, used to assess infection risk).","zh":"中性粒细胞绝对计数（血液检查指标，用来评估感染风险）。"},"examples":[{"en":"My doctor said my ANC was low, so I should be careful about infections.","zh":"医生说我的ANC偏低，所以要注意感染风险。"},{"en":"Chemotherapy can temporarily reduce your ANC.","zh":"化疗可能会暂时降低你的ANC。"}]},{"partOfSpeech":"n.","definition":{"en":"active noise canceling/cancellation (technology that reduces unwanted background sound in headphones).","zh":"主动降噪（耳机等设备通过技术降低环境噪音）。"},"examples":[{"en":"These headphones have ANC, which helps on airplanes.","zh":"这副耳机有ANC，在飞机上很有用。"},{"en":"Turn on ANC to block out office noise.","zh":"打开ANC来隔绝办公室的噪音。"}]}],"synonyms":["African National Congress","absolute neutrophil count","active noise cancellation"],"phonetic":"/ˌeɪ.ɛnˈsiː/","extraExplanation":["“ANC”是缩写，具体含义强烈依赖语境：谈南非政治时多指“非洲人国民大会”；在医院化验单上多指“中性粒细胞绝对计数”；在耳机/音频产品介绍里通常指“主动降噪”。","发音通常按字母读（A-N-C）。如果你能告诉我你看到“anc”的句子或领域（政治/医疗/耳机等），我可以帮你确认最准确的意思。"]}
{"word":"Ancaeus","summary":{"en":"Ancaeus is a figure from Greek mythology, best known as an Argonaut (and sometimes described as a king in various traditions).","zh":"Ancaeus（安卡俄斯）是希腊神话人物，最常见身份为阿尔戈英雄之一（不同传说中也被说成国王）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) A hero named Ancaeus, best known as one of the Argonauts; in different myths he is also described as a king (often of Tegea in Arcadia, or sometimes of Samos).","zh":"（希腊神话）安卡俄斯：一位英雄人物，最常见的身份是“阿尔戈英雄”（Argonauts）之一；在不同版本的神话中，他也被说成是国王（常见为阿卡迪亚的忒革亚 Tegea 之王，有时也说是萨摩斯 Samos 之王）。"},"examples":[{"en":"In some retellings of the voyage, Ancaeus is listed among the Argonauts who sailed with Jason.","zh":"在一些对航行故事的改写中，安卡俄斯被列为与杰森一同出航的阿尔戈英雄之一。"},{"en":"The myth of Ancaeus is often mentioned when discussing the idea that plans can fail at the last moment.","zh":"人们常在讨论“事情可能在最后一刻出差错”时提到安卡俄斯的神话。"}]}],"synonyms":["(no true synonyms; it is a proper name)"],"phonetic":"/ænˈsiːəs/","extraExplanation":["“Ancaeus（安卡俄斯）”并不是现代英语里的常用词，而是一个古希腊神话人物名，因此多见于文学、神话学、历史文化讨论中。","有一则著名故事与他相关：他种下葡萄、压酒成酿后正要举杯庆祝，却被野猪（或狩猎中的意外）害死，常被用来表达“不到最后一刻，事情都可能出变故”。这类含义也常和英语谚语“There's many a slip 'twixt the cup and the lip.”（酒杯到嘴边，仍可能出差错）一起被提及。"]}
{"word":"Ancalin","summary":{"en":"“Ancalin” is a rare proper name (usually a person’s name or surname) rather than a standard English vocabulary word.","zh":"“Ancalin”多为较少见的专名（人名或姓氏），而不是标准英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare proper noun used as a personal name or family name (surname). It does not have a widely recognized dictionary meaning in standard English; the meaning depends on the person, place, or story it refers to.","zh":"一个较少见的专有名词，用作人名或姓氏。在标准英语中没有公认的词典释义；具体含义取决于它指代的个人、地点或作品情境。"},"examples":[{"en":"I found “Ancalin” listed as a surname in an old document.","zh":"我在一份旧文件里看到“Ancalin”被列为一个姓氏。"},{"en":"Ancalin is the name on the account—could you confirm the spelling?","zh":"账户上的名字是 Ancalin——你能确认一下拼写吗？"}]}],"phonetic":"/ˈæŋkəlɪn/","extraExplanation":["“Ancalin”在英语里并不是常见词汇，更像是姓名/姓氏或某部作品中的专名。如果你是在小说、游戏、族谱、护照/证件、公司名等场景看到它，最好提供一句原文或上下文，我可以帮你判断它指的是谁/什么，以及是否可能是拼写变体。","它也可能是其他名字的拼写变体或误拼（例如以 Anca- / Ancal- 开头的姓名）。确认大小写、是否有重音符号、以及出现的语言环境（英语/罗马尼亚语/西班牙语等）会很有帮助。"]}
{"word":"ance","summary":{"en":"“-ance” is a noun-forming suffix meaning an action, process, state, or quality.","zh":"“-ance”是构成名词的后缀，常表示动作/过程、状态或性质。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a suffix used to form nouns meaning an action, process, state, or quality (often from verbs); similar in meaning to “-ing” or “-ment” in some words","zh":"后缀，用来构成名词，表示“动作/过程、状态或性质”（常由动词派生），有时意义上类似“-ing”或“-ment”"},"examples":[{"en":"accept + -ance → acceptance (the act of accepting)","zh":"accept + -ance → acceptance（接受这一行为/结果）"},{"en":"resist + -ance → resistance (the act or state of resisting)","zh":"resist + -ance → resistance（抵抗的行为/状态）"},{"en":"maintain + -ance → maintenance (the act of maintaining)","zh":"maintain + -ance → maintenance（维护/保养的工作）"}]}],"phonetic":"/əns/","extraExplanation":["“-ance”通常加在拉丁语来源的词根后面，用来把动词变成名词。拼写上常和“-ence”成对出现（如 dependence / dependence），具体用哪一个很多时候需要记单词本身。一个小线索：以 -ant 结尾的形容词更常对应 -ance（important → importance），以 -ent 结尾的形容词更常对应 -ence（different → difference），但也有例外。"]}
{"word":"Ancef","summary":{"en":"Ancef is the brand name of cefazolin, an injectable cephalosporin antibiotic used to treat or prevent certain bacterial infections.","zh":"Ancef 是头孢唑啉的商品名，一种注射用头孢菌素类抗生素，用于治疗或预防某些细菌感染。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a brand name for cefazolin, a first-generation cephalosporin antibiotic given by injection to treat or prevent certain bacterial infections (often around surgery).","zh":"安赛福（Ancef）：头孢唑啉（cefazolin）的商品名，为第一代头孢菌素类抗生素，通常以注射方式用于治疗或预防某些细菌感染（常用于手术前后预防感染）。"},"examples":[{"en":"The doctor ordered Ancef before surgery to help prevent infection.","zh":"医生在手术前开了安赛福，用来帮助预防感染。"},{"en":"She received Ancef intravenously in the hospital.","zh":"她在医院通过静脉注射使用了安赛福。"},{"en":"Ancef is effective against some common skin and soft-tissue infections.","zh":"安赛福对一些常见的皮肤和软组织感染有效。"}]}],"synonyms":["cefazolin","Kefzol"],"phonetic":"/ænˈsɛf/","extraExplanation":["“Ancef”是商品名，通用名是“cefazolin（头孢唑啉）”。在医学英语里，医护人员有时会用商品名直接指代药物。","它属于“cephalosporin（头孢菌素）”抗生素。常见用途包括手术预防用药（surgical prophylaxis）以及对部分革兰阳性菌等引起的感染。并非对所有细菌都有效，尤其对病毒无效。","用药安全提示：如果对“penicillin（青霉素）”或“cephalosporins（头孢类）”曾有严重过敏史，应告知医生；抗生素应按医嘱完成疗程，避免自行停药或随意使用。"]}
{"word":"Ancel","summary":{"en":"Ancel can mean an old-fashioned word for a servant/attendant, or it can be a personal or family name.","zh":"Ancel 既可指（古语）“仆人/侍从”，也可作为人名或姓氏使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic) A servant; an attendant, especially in medieval or literary contexts.","zh":"（古语/文学用语）仆人；侍从（常见于中世纪或文学语境）。"},"examples":[{"en":"In the old ballad, the knight rode out with his ancel close behind.","zh":"在那首古老的歌谣里，骑士出行，侍从（ancel）紧随其后。"},{"en":"The lord called for his ancel to bring a lantern.","zh":"领主叫仆人（ancel）拿来一盏灯。"}]},{"partOfSpeech":"other","definition":{"en":"A family name (surname) or given name; used as a proper noun.","zh":"姓氏或名字（专有名词用法）。"},"examples":[{"en":"Ms. Ancel will speak at the meeting today.","zh":"安塞尔女士（Ancel）今天将在会议上发言。"},{"en":"I found an article by Ancel in the library database.","zh":"我在图书馆数据库里找到一篇署名为 Ancel 的文章。"}]}],"synonyms":["servant","attendant","aide"],"phonetic":"/ˈæn.səl/","extraExplanation":["“ancel”作为“仆人/侍从”的意思比较古旧，多出现在历史题材、诗歌或仿古写作中；现代英语更常用 servant、attendant、aide 等词。","作为人名/姓氏的 Ancel 往往与语源或家族传统有关，发音可能因地区与个人偏好略有差异。"]}
{"word":"Ancelin","summary":{"en":"Ancelin is a French-origin name, usually a surname.","zh":"Ancelin 是一个法语来源的人名，通常是姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a French-origin personal name (more common as a surname, sometimes a given name). It is usually understood as a family name rather than a common English word.","zh":"一个法语来源的人名（更常见作姓氏，也可作名字）；通常被理解为姓氏，而不是英语里的常用词。"},"examples":[{"en":"Dr. Ancelin published a study on public health policy.","zh":"Ancelin 医生发表了一项关于公共卫生政策的研究。"},{"en":"In the novel, the detective is named Camille Ancelin.","zh":"在小说中，这位侦探名叫卡米耶尔·安塞兰（Camille Ancelin）。"}]}],"phonetic":"/ˈæn.sə.lɪn/","extraExplanation":["“Ancelin”多见于法语语境的人名/姓氏。词源上常被认为与古法语 ancel（意为“仆从、随从、家臣/附庸”）有关，因此作为姓氏时可能最初指“从事侍从工作的人”或与封建从属关系有关的称谓。现代使用时通常不再带有这些含义，只是家族姓氏。"]}
{"word":"Anceline","summary":{"en":"Anceline is primarily used as a female personal name, especially in French-influenced contexts.","zh":"Anceline 主要用作女性人名，常见于受法语影响的语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feminine given name (a personal name), used especially in French-speaking contexts; sometimes considered a variant of Anseline/Anselme-related names.","zh":"女性名字（人名），在法语语境中较常见；有时被视为 Anseline 等相关名字的变体。"},"examples":[{"en":"Anceline moved to New York for graduate school.","zh":"Anceline 去纽约读研究生。"},{"en":"Our new colleague, Anceline, will join the team next Monday.","zh":"我们的新同事 Anceline 将在下周一加入团队。"}]}],"synonyms":["Anseline","Angeline","Céline"],"phonetic":"/ˈæn.səˌliːn/","extraExplanation":["“Anceline”多见于法语姓名体系中，可能与古法语/中世纪法语的姓氏或名字形式有关。部分资料会把它与 Anseline（常被认为与 Anselm/Anselme 同源）联系起来；该类名字在历史上常被解释为与“神”“保护/头盔”等含义相关，但不同来源的解释不完全一致。","由于它主要是专有名词（人名），在英语词典里通常不会像普通词汇那样有固定、统一的“词义”，更多是作为名字使用。"]}
{"word":"Ancell","summary":{"en":"Ancell is mainly used as a surname; it can also be a rare given name and is historically linked to “ancel” meaning a servant.","zh":"Ancell 主要用作姓氏；也可作罕见名字，并在历史上与表示“仆人/侍从”的 ancel 有关联。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname).","zh":"姓氏（家族姓）。"},"examples":[{"en":"Dr. Ancell published several articles on public health.","zh":"安塞尔博士发表了几篇关于公共卫生的文章。"},{"en":"My neighbor’s last name is Ancell.","zh":"我邻居的姓是 Ancell。"}]},{"partOfSpeech":"other","definition":{"en":"A rare given name, sometimes used as a variant spelling of similar names (e.g., Ansel/Anselm).","zh":"罕见的名字（名），有时被当作相近名字（如 Ansel/Anselm）的变体拼写。"},"examples":[{"en":"Ancell is an uncommon first name today.","zh":"Ancell 作为名字在今天并不常见。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical/rare) A spelling variant of “ancel,” meaning a servant or attendant in older English.","zh":"（历史/罕见）“ancel”的变体拼写，在古英语中可指仆人、随从。"},"examples":[{"en":"In older texts, ancel could refer to a household servant.","zh":"在较早的文本里，ancel 可以指家中的仆人。"}]}],"synonyms":["(related) Ansel","(related) Anselm","(historical) ancel"],"phonetic":"/ˈæn.səl/","extraExplanation":["“Ancell”更常见于英语世界的姓氏。其来源常被认为与古法语/中古英语里的“ancel”有关，历史上与“仆人、侍从”之意相连（可追溯到拉丁语与“女仆/侍女”相关的词根）。作为名字（名）则较少见，且可能受类似名字（如 Ansel/Anselm）的拼写影响。"]}
{"word":"Ancerata","summary":{"en":"“Ancerata” is most likely a Latin scientific name; its meaning depends on where it appears.","zh":"“Ancerata”很可能是拉丁学名；具体含义要看它出现的上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A scientific-looking Latin name (likely a taxonomic term) rather than a standard everyday English word. Its exact meaning depends on the field (biology/zoology/botany) and the context where you saw it.","zh":"看起来像拉丁学名（多半是分类学术语），不是常见的日常英语词。具体含义取决于你看到它的学科背景（生物/动物/植物等）与上下文。"},"examples":[{"en":"I found “Ancerata” in a species list, but I couldn’t tell which organism it referred to without more context.","zh":"我在物种列表里看到“Ancerata”，但没有更多上下文就无法判断它指的是哪种生物。"},{"en":"In scientific writing, Latin names like Ancerata are usually italicized.","zh":"在科学写作中，像 Ancerata 这样的拉丁名通常要用斜体。"}]}],"phonetic":"/ˌæn.səˈrɑː.tə/","extraExplanation":["“Ancerata”不太像现代英语词汇，更像是某个分类单元的拉丁化名称（例如属名、科名或更高阶元），因此离开出处很难给出唯一、准确的释义。","如果你愿意，请把你看到它的句子/截图/学科领域（例如昆虫学、古生物、植物学）发来，我可以据此帮你确认它具体指什么，并给出更精确的读音与相关背景。","也可能是拼写误差：与之相近的形式有时会出现在分类学术语中（例如 Acerata 等），不同拼写会对应完全不同的概念。"]}
{"word":"ancerata","summary":{"en":"Ancerata is a rare scientific adjective meaning “goose-bill-shaped,” describing something with a beak-like hooked tip.","zh":"Ancerata 是较少见的科学形容词，意为“鹅嘴状/喙状”，指末端像喙一样弯钩的形状。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany/Zoology, rare) Shaped like a goose’s bill; curved or hooked at the tip.","zh":"（植物学/动物学，较少见）形状像鹅嘴；末端弯曲或呈钩状。"},"examples":[{"en":"The seed has an ancerata tip that helps it catch on fur.","zh":"这种种子末端呈“鹅嘴状”弯钩，有助于挂在动物毛上。"},{"en":"In older botanical descriptions, you may see ancerata used for a beak-like point.","zh":"在较早的植物学描写中，ancerata 有时用来形容“喙状”的尖端。"}]}],"synonyms":["beaked","hooked","uncinate"],"phonetic":"ˌæn.səˈrɑː.tə","extraExplanation":["“ancerata”多见于较旧或偏学术的描述中，常被视为“ancerate”的变体/拉丁化形式（在分类学拉丁文里，词尾会随名词性数格变化）。","词源与拉丁语 anser（“鹅”）有关，因此核心意象是“像鹅嘴一样的弯喙/钩状”。阅读植物形态描述时，可把它理解为 beak-like / hooked tip。","如果你是在论文或物种名称里看到它，最好结合上下文（描述的是种子、果实、叶尖还是器官突起）来判断具体指哪一部分的“喙状弯尖”。"]}
{"word":"ancestor","summary":{"en":"An ancestor is a family member from long ago, or an earlier form/source of something that exists today.","zh":"ancestor 指很久以前的祖先，也可指某种事物（动植物、语言等）的前身或来源。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person in your family who lived long ago (for example, a grandparent’s grandparent); someone you are descended from","zh":"祖先；（家族中）很久以前的人；你所出自的先人"},"examples":[{"en":"My ancestors came to the U.S. more than 100 years ago.","zh":"我的祖先在一百多年前来到美国。"},{"en":"She’s researching her ancestors using old records and photos.","zh":"她在用旧档案和照片研究自己的祖先。"}]},{"partOfSpeech":"n.","definition":{"en":"an earlier form of an animal, plant, language, or idea that later developed into something else","zh":"（动植物、语言、观念等的）祖先；前身；早期形态"},"examples":[{"en":"Wolves are considered ancestors of domestic dogs.","zh":"狼被认为是家犬的祖先。"},{"en":"Latin is an ancestor of several modern European languages.","zh":"拉丁语是多种现代欧洲语言的“祖先/来源”。"}]}],"synonyms":["forebear","forefather","predecessor","progenitor"],"phonetic":"/ˈæn.ses.tɚ/","extraExplanation":["“ancestor”常用于家谱与历史语境，比“forefather”更中性、性别不限；“forefather”多指男性祖先，也常见于民族/国家叙事（如 the Founding Fathers）。","常见搭配：trace one’s ancestors（追溯祖先）、ancestor worship（祖先崇拜）、ancestral home/land（祖宅/祖地）、common ancestor（共同祖先）。"]}
{"word":"ancestor-like","summary":{"en":"“Ancestor-like” means resembling an ancestor in looks, manner, or qualities.","zh":"“ancestor-like”表示“像祖先/祖辈的”，强调外貌、举止或特质的相似。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling an ancestor (a person in your family from long ago) in appearance, behavior, style, or qualities.","zh":"像祖先的；具有祖辈特征的（外貌、举止、风格或气质等）"},"examples":[{"en":"She has an ancestor-like profile that looks just like her great-grandmother’s photos.","zh":"她的侧脸很有祖辈的感觉，和曾祖母的照片几乎一模一样。"},{"en":"The museum displayed ancestor-like masks used in old family ceremonies.","zh":"博物馆展出了用于古老家族仪式的、带有祖先风格的面具。"},{"en":"His ancestor-like patience made him a steady leader in difficult times.","zh":"他那种“祖辈般”的耐心让他在艰难时期成为沉稳的领导者。"}]}],"synonyms":["ancestral","forebear-like","heritage-like","old-fashioned (context-dependent)"],"phonetic":"/ˈæn.sɛs.tɚˌlaɪk/","extraExplanation":["“ancestor-like”是由名词ancestor加上“-like（像……的）”构成的复合形容词，常用连字符连接，尤其在名词前作定语时更常见：ancestor-like features（祖辈般的特征）。放在系动词后作表语时有时也可写成ancestor like，但连字符更清晰。","语气通常是描述性的；在写作中也可带一点文学/叙述色彩，用来营造“古老、传承、祖辈气质”的氛围。常见近似表达有ancestral（祖先的/祖传的）与 old-fashioned（老式的），但ancestor-like更强调“像某位祖先/祖辈的样子”。"]}
{"word":"ancestor-worship-related","summary":{"en":"Ancestor-worship-related means connected with honoring ancestors through rituals or traditions.","zh":"ancestor-worship-related 指“与祭祖/敬祖等敬奉祖先的仪式或传统有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with the practice of honoring and showing respect to one’s ancestors (for example through rituals, offerings, or memorial ceremonies).","zh":"与“祭祖/祖先崇拜”（通过仪式、供品或纪念典礼等方式敬奉祖先）有关的。"},"examples":[{"en":"The museum has an ancestor-worship-related exhibit featuring family altars and ritual objects.","zh":"博物馆有一个与祭祖相关的展览，展示家族神龛和祭祀器物。"},{"en":"They studied ancestor-worship-related customs during the Qingming Festival.","zh":"他们在清明节期间研究与祭祖相关的习俗。"},{"en":"Some ancestor-worship-related traditions focus on remembering family history rather than religion.","zh":"一些与祭祖相关的传统更强调家族记忆，而不一定是宗教。"}]}],"synonyms":["related to ancestor worship","ancestral-veneration-related","ancestor-veneration-related","ancestral-ritual-related"],"phonetic":"/ˈæn.sɛs.tɚ ˌwɝː.ʃɪp rɪˈleɪ.tɪd/","extraExplanation":["这是一个由多个词组成的形容词短语（复合形容词），常用连字符把它们连接起来，表示“与……有关的”：ancestor + worship + related。也可以写成 ancestor-worship related（少见）或用更自然的表达：related to ancestor worship / ancestral-veneration-related。","在英语语境里，“ancestor worship”有时听起来偏“宗教化”，如果想更中性、学术或更尊重不同文化，也常用 ancestor veneration（敬祖/祖先崇敬）来表达。"]}
{"word":"ancestor-worshiping","summary":{"en":"“Ancestor-worshiping” describes people or cultures that honor ancestors through rituals or strong traditional respect.","zh":"“ancestor-worshiping”指通过仪式或深厚传统来敬奉、尊敬祖先的（人/文化）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Showing strong respect for one’s ancestors, often through traditional rituals, ceremonies, or beliefs.","zh":"崇敬祖先的；（常指）通过传统仪式、祭祀或信仰来敬奉祖先的。"},"examples":[{"en":"In some ancestor-worshiping families, people clean the graves and offer food during festivals.","zh":"在一些崇敬祖先的家庭里，人们会在节日里扫墓并供奉食物。"},{"en":"The novel describes an ancestor-worshiping village where family history guides daily life.","zh":"这部小说描写了一个敬祖的村庄，家族历史影响着人们的日常生活。"}]}],"synonyms":["ancestor-venerating","ancestor-honoring","traditional","filial"],"phonetic":"ˈænˌsɛstɚ ˌwɝːʃɪpɪŋ","extraExplanation":["“ancestor-worshiping”常用于学术写作、新闻或文学描述，强调一种文化或家庭传统；在日常口语里，更常说“ancestor worship”或“ancestor veneration”（对祖先的敬奉/追思）。","跨文化语境中，“worship（崇拜/祭拜）”有时会让人误以为是把祖先当作“神”来拜；很多文化里更接近“veneration（敬奉、尊敬）”与“remembrance（纪念）”，不一定等同于宗教意义上的“崇拜”。","相关表达：ancestor worship（祖先崇拜/祭祖）、venerate one’s ancestors（敬奉祖先）、pay respects to ancestors（祭拜/致敬祖先）。"]}
{"word":"ancestorial","summary":{"en":"“Ancestorial” is a rare adjective meaning “related to one’s ancestors,” similar to “ancestral.”","zh":"“ancestorial”是一个较少见的形容词，意思是“与祖先有关的”，相当于更常用的“ancestral”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Related to one’s ancestors; ancestral.","zh":"（较少用）与祖先有关的；祖传的；祖先的。"},"examples":[{"en":"Many families keep ancestorial records to remember where they came from.","zh":"许多家庭保存祖先相关的家谱/记录，以记住自己的来处。"},{"en":"The village still follows ancestorial customs during the New Year festival.","zh":"这个村庄在新年节庆时仍遵循祖传的习俗。"}]}],"synonyms":["ancestral","hereditary","inherited"],"phonetic":"/ˌæn.sɛˈstɔː.ri.əl/","extraExplanation":["“ancestorial”在现代英语中非常少见，常被视为“ancestral（祖先的）”的罕见变体或拼写变体。写作与考试中更推荐使用更常见、更标准的“ancestral”。","常见搭配（更自然）：ancestral home（祖宅）、ancestral land（祖传土地/故土）、ancestral tradition（祖传传统）、ancestral lineage（祖系/血统）。"]}
{"word":"ancestorially","summary":{"en":"“Ancestorially” means “in an ancestral way; relating to one’s ancestors or family origins.”","zh":"“ancestorially”意为“以祖先的方式；与祖先或家族渊源有关地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to one’s ancestors or family origins; ancestrally.","zh":"以祖先的角度；与祖先或家族渊源有关地；从祖源上。"},"examples":[{"en":"The family was ancestorially connected to the region through generations of farmers.","zh":"这个家族从祖源上与该地区有关联，因为好几代人都是农民。"},{"en":"Some traditions are ancestorially rooted, even if people no longer remember their exact beginnings.","zh":"有些传统在祖源上根深蒂固，即使人们已不记得它们的确切起点。"}]}],"synonyms":["ancestrally","hereditarily","by descent","traditionally"],"phonetic":"/ˌæn.sɛˈstɔr.i.ə.li/","extraExplanation":["“ancestorially”非常少见，更常见的表达是“ancestrally”或用短语“in an ancestral way / from an ancestral perspective”。在正式写作中，通常建议用更常用的“ancestrally”，读者更容易理解。"]}
{"word":"ancestors","summary":{"en":"Ancestors are people in your family from long ago; in science, it can also mean earlier forms that later species developed from.","zh":"Ancestors 指很久以前的家族祖先；在科学语境中也可指物种演化过程中更早的祖先型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People in your family who lived long ago, especially those related to you by blood (for example, your grandparents’ grandparents).","zh":"祖先；祖辈（指家族中很久以前的亲属，尤其是血缘上的，比如曾祖父母的上一辈）"},"examples":[{"en":"My ancestors came to the U.S. more than 100 years ago.","zh":"我的祖先一百多年前来到美国。"},{"en":"She enjoys researching her ancestors through old records and photos.","zh":"她喜欢通过旧档案和照片研究自己的祖先。"}]},{"partOfSpeech":"n.","definition":{"en":"(Biology/evolution) Earlier forms in a species’ history from which later forms developed.","zh":"（生物/进化）祖先型；前代个体（指某物种历史中较早的形态，后来的形态由此发展而来）"},"examples":[{"en":"Birds share a common ancestor with some dinosaurs.","zh":"鸟类与某些恐龙拥有共同的祖先。"},{"en":"Scientists study fossils to learn about our ancestors.","zh":"科学家研究化石来了解我们的祖先。"}]}],"synonyms":["forebears","forefathers","predecessors"],"phonetic":"/ˈæn.ses.tɚ/","extraExplanation":["“Ancestor”通常用于较久远的家族成员；如果只是上一代或上两代，英语更常说“parents / grandparents”。","常见搭配：“family ancestors（家族祖先）”“common ancestor（共同祖先）”“ancestor worship（祖先崇拜）”。在一些文化语境中，谈到祖先时也常与传统、迁徙历史、身份认同相关。"]}
{"word":"ancestral","summary":{"en":"An adjective meaning “related to ancestors” or “inherited from earlier generations.”","zh":"形容词，表示“与祖先有关”或“从前几代传承/继承而来”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to your ancestors (the people in your family who lived long ago).","zh":"与祖先有关的；祖传的（指家族中久远的先人）。"},"examples":[{"en":"She returned to her ancestral home village after many years abroad.","zh":"她在国外多年后回到了祖先的故乡。"},{"en":"They keep ancestral photos on the wall to remember past generations.","zh":"他们把祖先的照片挂在墙上，用来怀念前几代人。"}]},{"partOfSpeech":"adj.","definition":{"en":"Coming from earlier generations; inherited or traditional within a family, group, or culture.","zh":"来自前几代的；继承的；传统的（在家族、群体或文化中沿袭）。"},"examples":[{"en":"He wears his grandfather’s ring as an ancestral symbol of the family.","zh":"他戴着祖父的戒指，作为家族祖传的象征。"},{"en":"The festival celebrates ancestral traditions and local history.","zh":"这个节日庆祝祖传传统和地方历史。"}]}],"synonyms":["hereditary","inherited","forefathers’","family","traditional"],"phonetic":"/ænˈsɛstrəl/","extraExplanation":["“ancestral”常与表示地点/事物的名词搭配：ancestral home/land/village（祖居/祖地/故乡）、ancestral tomb（祖坟）、ancestral worship（祭祖/祖先崇拜）。","词源上来自拉丁语“ancestor”（先人），语气偏正式，写作或介绍文化传统时很常见。与“ancient（古老的）”不同：ancestral强调“与祖先、血缘或传承有关”，不只是年代久远。"]}
{"word":"ancestrally","summary":{"en":"Ancestrally means “through your ancestors/lineage,” or “in an evolution-from-ancestors sense.”","zh":"ancestrally 表示“从祖先/家族世代传承而来”，也可指“从演化祖先层面来看”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that comes from your ancestors or your family’s earlier generations; by inheritance or lineage.","zh":"以祖先传承的方式；从祖辈或家族世代沿袭而来。"},"examples":[{"en":"She is ancestrally linked to the region through her grandparents.","zh":"通过祖父母，她在祖源上与那个地区有联系。"},{"en":"The family is ancestrally Irish, though they live in the U.S. now.","zh":"这个家族祖籍是爱尔兰的，尽管他们现在住在美国。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way related to human ancestors over a long evolutionary history.","zh":"以与人类远古祖先（演化史）相关的方式。"},"examples":[{"en":"Fear of snakes may be ancestrally shaped in humans.","zh":"人类对蛇的恐惧可能在祖先层面受到塑造。"},{"en":"Some behaviors are described as ancestrally rooted, not simply learned.","zh":"有些行为被描述为根植于祖先层面，而不只是后天习得。"}]}],"synonyms":["by descent","hereditarily","traditionally","genetically","evolutionarily"],"phonetic":"/ænˈsɛstrəli/","extraExplanation":["“ancestrally”来自“ancestral（祖先的）+ -ly（副词后缀）”。语气常见于学术写作、族谱/基因/族裔身份讨论中，比日常的“in my family”更正式。","常见搭配：ancestrally linked / ancestrally related / ancestrally rooted / ancestrally inherited。"]}
{"word":"ancestress","summary":{"en":"“Ancestress” means a female ancestor; it’s a formal word often used in history, genealogy, or literature.","zh":"“ancestress”指“女性祖先”，较正式，常用于历史、家谱研究或文学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female ancestor; a woman from whom you are descended","zh":"女性祖先；你所出自的女祖先"},"examples":[{"en":"She traced her family history back to an ancestress who arrived in America in the 1800s.","zh":"她把家族史追溯到一位在19世纪来到美国的女祖先。"},{"en":"In the novel, the heroine honors an ancestress known for her courage.","zh":"在小说中，女主角纪念一位以勇敢著称的女祖先。"}]}],"synonyms":["female ancestor","foremother","ancestor"],"phonetic":"/ˈæn.sɛs.trəs/","extraExplanation":["“ancestress”较正式，常见于家谱研究、历史写作或文学语境；日常英语里更常说“female ancestor”或直接用“ancestor”（祖先，不分性别）。","词形提示：ancestor（祖先）→ ancestress（女祖先）。后缀“-ess”传统上表示女性（如 actress），但现代英语中有时会倾向使用不分性别的词（如 actor/ancestor）。"]}
{"word":"ancestresses","summary":{"en":"“Ancestresses” means female ancestors—women in your family line from earlier generations.","zh":"“ancestresses”指女性祖先，即家族血脉中更早世代的女性先辈。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"female ancestors; women from whom someone is descended","zh":"女性祖先；你所出自的女性先辈"},"examples":[{"en":"She wrote a memoir honoring her ancestresses and the sacrifices they made.","zh":"她写了一本回忆录，致敬她的女性祖先以及她们所作的牺牲。"},{"en":"In the family tree, the ancestresses are listed alongside the male ancestors.","zh":"在家谱里，女性祖先与男性祖先一起被列出。"}]}],"synonyms":["female ancestors","foremothers","ancestors"],"phonetic":"/ˈæn.ses.trəs/","extraExplanation":["“ancestress”是“ancestor（祖先）”的女性对应词，带有强调性别的意味。在现代英语里，人们更常用不分性别的“ancestor”，除非需要特别突出女性的血缘传承或女性视角。","复数“ancestresses”的拼写是不规则变化：ancestress → ancestresses（加 -es，并且 -ss 结尾变为 -sses）。"]}
{"word":"ancestrial","summary":{"en":"Ancestral means “connected with ancestors” or “from earlier origins.”","zh":"ancestral 指“与祖先有关的；祖传的”，也可指“更早起源/祖先型的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"related to your ancestors (family members from long ago) or coming from them","zh":"与祖先有关的；源自祖先的"},"examples":[{"en":"She kept an ancestral necklace that had been passed down for generations.","zh":"她保存着一条祖传项链，世代相传。"},{"en":"They returned to their ancestral village during the holiday.","zh":"假期里他们回到了祖籍村。"},{"en":"The festival has ancestral roots in local farming traditions.","zh":"这个节日的起源与当地农耕传统（祖先传承）有关。"}]},{"partOfSpeech":"adj.","definition":{"en":"(biology/genetics) from an earlier form in the history of a species","zh":"（生物/遗传）祖先型的；来自早期演化阶段的"},"examples":[{"en":"Scientists compared ancestral DNA with modern DNA to study human migration.","zh":"科学家比较了祖先DNA与现代DNA来研究人类迁徙。"},{"en":"Some traits are ancestral, while others evolved later.","zh":"有些特征是祖先型的，而另一些是后来演化出来的。"}]}],"synonyms":["hereditary","inherited","forefathers’","traditional","ancient"],"phonetic":"/ænˈsɛstrəl/","extraExplanation":["你输入的 **ancestrial** 通常被认为是拼写错误；正确拼写更常见的是 **ancestral**（与祖先有关的）。","常见搭配：ancestral home（祖宅/祖屋）、ancestral land（祖传土地/祖籍地）、ancestral roots（祖源/根）。"]}
{"word":"ancestrian","summary":{"en":"An uncommon adjective meaning “ancestral; related to one’s ancestors.”","zh":"一个不常见的形容词，意思是“祖先的；与祖先有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to one’s ancestors; ancestral (rare/old-fashioned).","zh":"与祖先有关的；祖先的（较罕见/偏旧式用法）。"},"examples":[{"en":"The ceremony honored the community’s ancestrian traditions.","zh":"这场仪式向社区的祖先传统致敬。"},{"en":"She felt an ancestrian connection to the land where her family began.","zh":"她对家族起源之地有一种祖先般的连结感。"}]}],"synonyms":["ancestral","hereditary","inherited","forebears’"],"phonetic":"/ænˈsɛstriən/","extraExplanation":["“ancestrian”在现代英语中非常少见，很多时候是拼写误写或较冷僻的用词。更常用、也更自然的是“ancestral”（祖先的）或“ancestry”（祖先血统/家族渊源）。","如果你想表达“祖先的传统/土地/记忆”，通常用“ancestral traditions / ancestral land / ancestral memory”。在正式写作里用“ancestrian”可能会让读者觉得奇怪或以为是拼写错误。"]}
{"word":"ancestries","summary":{"en":"“Ancestries” means family origins or family lines from the past (plural of “ancestry”).","zh":"“ancestries”指来自过去的家族来源或血统（“ancestry”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Family origins or family lines from the past; the backgrounds of your ancestors (plural of “ancestry”).","zh":"祖先来源；家族血统；家世（“ancestry”的复数）。"},"examples":[{"en":"People in the city have many different ancestries.","zh":"这座城市里的人有许多不同的祖先来源。"},{"en":"She is proud of her Chinese and Irish ancestries.","zh":"她为自己的华裔和爱尔兰血统感到自豪。"},{"en":"The report compares the ancestries of the two populations.","zh":"这份报告比较了两个人群的祖先来源。"}]}],"synonyms":["family origins","roots","heritage","lineage","descent","background"],"phonetic":"/ˈænˌsɛstriz/","extraExplanation":["“ancestry”常用于谈论家族来源、族裔背景或基因研究语境；复数“ancestries”强调“多种来源/多条血统”（例如一个人可能有多重族裔或家族分支）。","注意区分：ancestry（家族血统/祖源，偏家族与历史）≠ nationality（国籍）≠ ethnicity（族裔身份，偏文化与社会认同）。","在文化交流中，询问别人的“ancestry”可能涉及隐私或身份议题；更礼貌的问法可以是：“Do you have any family roots in…?”（你的家族和……有渊源吗？）"]}
{"word":"ancestry","summary":{"en":"Ancestry means your family origins and background from past generations.","zh":"Ancestry 指一个人来自哪些家族与祖先（跨越多代的血统与文化背景）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person’s family line or the people they come from, especially over many generations.","zh":"血统；世系；祖先来源（尤指跨越多代的家族传承）。"},"examples":[{"en":"She researched her ancestry to learn where her great-grandparents came from.","zh":"她研究自己的家族世系，想了解曾祖父母来自哪里。"},{"en":"Many families keep records of their ancestry in old photos and documents.","zh":"许多家庭会用老照片和文件保存家族世系的记录。"}]},{"partOfSpeech":"n.","definition":{"en":"A person’s ethnic or cultural background passed down from ancestors.","zh":"（祖先传下来的）族裔或文化背景。"},"examples":[{"en":"His ancestry is partly Irish and partly Korean.","zh":"他的族裔背景一部分是爱尔兰，一部分是韩国。"},{"en":"Food traditions in the community reflect its diverse ancestry.","zh":"社区的饮食传统反映了其多元的文化渊源。"}]}],"synonyms":["family line","lineage","heritage","roots","descent"],"phonetic":"/ˈænsɛstri/","extraExplanation":["词源：来自拉丁语 *antecessor*（意为“前辈、先行者”）相关词，核心概念是“在你之前的人”。","用法提示：*ancestry* 常用来谈“家族来源/族裔背景”这一整体概念；更具体的“某位祖先”通常用 *ancestor*（可数名词）。例如：*an ancestor*（一位祖先） vs. *my ancestry*（我的家族渊源）。","常见搭配：*trace your ancestry*（追溯族谱/家族来源），*ancestry research*（家谱研究），*family ancestry*（家族渊源）。"]}
{"word":"Ancha","summary":{"en":"“Ancha” is commonly the Spanish feminine form of “wide/broad,” and it can also be used as a personal name with meanings that vary by culture.","zh":"“Ancha”常见为西班牙语中“宽的/宽阔的”的阴性形式；也可作人名，但含义会因文化而异。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Spanish) “wide” or “broad” (feminine form), used to describe something with a large width.","zh":"（西班牙语）“宽的、宽阔的”（阴性形式），用于形容宽度较大的事物。"},"examples":[{"en":"La calle es ancha y fácil de cruzar.","zh":"这条街很宽，容易穿过。"},{"en":"Necesito una mesa más ancha para trabajar.","zh":"我需要一张更宽的桌子来工作。"}]},{"partOfSpeech":"n.","definition":{"en":"A given name (proper noun). It can be used as a personal name in different cultures, but its meaning depends on the specific language/background.","zh":"人名（专有名词）。可在不同文化中用作名字，但具体含义取决于所属语言与背景。"},"examples":[{"en":"Ancha is my classmate’s name.","zh":"Ancha 是我同学的名字。"},{"en":"I met Ancha at the conference.","zh":"我在会议上认识了 Ancha。"}]}],"synonyms":["wide","broad"],"phonetic":"ˈɑn.tʃɑ","extraExplanation":["在西班牙语里，形容词通常要和名词的“阴阳性”一致：ancho（阳性）/ ancha（阴性）。例如：un camino ancho（一条宽的路，camino 为阳性）；una calle ancha（一条宽的街，calle 为阴性）。","如果你指的是人名“Ancha”，不同地区可能有不同来源与含义。若你告诉我它来自哪种语言/国家（比如泰语、尼泊尔语、印地语等），我可以更准确说明。"]}
{"word":"ancha","summary":{"en":"“Ancha” is Spanish for “wide/broad” (feminine form).","zh":"“Ancha”是西班牙语，意思是“宽的/宽阔的”（阴性形式）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Spanish) wide; broad (feminine form, used with feminine nouns).","zh":"（西班牙语）宽的；宽阔的（阴性形式，用来修饰阴性名词）。"},"examples":[{"en":"La calle es ancha y luminosa.","zh":"这条街很宽而且很明亮。"},{"en":"Buscamos una puerta más ancha para mover el sofá.","zh":"我们在找一扇更宽的门，好把沙发搬进去。"}]}],"synonyms":["wide","broad"],"phonetic":"/ˈɑn.tʃɑ/","extraExplanation":["“Ancha”是西班牙语形容词“ancho/ancha”（宽的）的阴性形式：ancho 配阳性名词（如 el puente），ancha 配阴性名词（如 la calle）。","常见固定表达：“a sus anchas”= 很自在、很随意（字面：在自己的宽敞之处）。例如：Se quedó en casa a sus anchas.（他在家待得很自在。）"]}
{"word":"Anchat","summary":{"en":"“Anchat” isn’t a common English word; it’s usually a name or a misspelling of a nearby word like “chat.”","zh":"“Anchat”不是常见英语词；通常是名字/账号名，或是类似“chat”等词的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as a proper name (e.g., a username, brand name, or place name) rather than a vocabulary word with an established dictionary meaning.","zh":"不是标准英语单词；更常见于专有名词（如用户名、品牌名或地名），而不是有固定词典释义的词汇。"},"examples":[{"en":"Anchat is the username I use for online forums.","zh":"Anchat 是我在网络论坛上使用的用户名。"},{"en":"I couldn’t find a dictionary definition for “Anchat.”","zh":"我在词典里找不到“Anchat”的释义。"}]}],"synonyms":["chat (possible intended word)","enchant (possible intended word)"],"phonetic":"/ˈæn.tʃæt/","extraExplanation":["“Anchat”很可能是拼写、断词或大小写导致的误读/误打。你可能想查的是：\n1) chat（聊天）\n2) anchor chat（直播/电台里的“主播闲聊”一段）\n3) enchant（使着迷/施魔法）\n\n如果你告诉我它出现的句子或语境（例如一整句话、网站/app 名、或人名/地名），我可以更准确判断它的意思与更自然的发音。"]}
{"word":"anchat","summary":{"en":"“Anchat” isn’t a standard English word; it’s usually a typo for “a chat” or a specific name.","zh":"“anchat” 不是标准英语词；通常是把 “a chat” 连写的拼写错误，或特定名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; often a misspelling or a run-together form of “a chat” (a conversation), or a brand/app name in specific contexts.","zh":"不是标准英语单词；常见于把 “a chat”（一次聊天/谈话）连写的拼写错误，或在特定语境中作为品牌/应用名使用。"},"examples":[{"en":"Do you mean “a chat,” as in “Let’s have a chat” (let’s talk)?","zh":"你是想说 “a chat” 吗？比如 “Let’s have a chat”（我们聊聊）。"},{"en":"I couldn’t find “anchat” in a dictionary; it may be a typo or a product name.","zh":"我在词典里找不到 “anchat”；它可能是拼写错误或某个产品名称。"}]}],"synonyms":["a chat","conversation","talk"],"phonetic":"/ˈæn.tʃæt/","extraExplanation":["“a chat” 在英语里非常常用：chat 作名词表示“聊天/谈话”，作动词表示“聊天”。如果你想查的是动词 chat 或名词 chat，告诉我你要的词性和例句语境（工作/朋友/网络聊天），我可以给更准确的释义与用法。","如果你指的是某个叫 AnChat/Anch(at) 的软件或平台，请提供一句你看到它的原句或截图中的上下文，我可以按专有名词来解释。"]}
{"word":"Anchesmius","summary":{"en":"“Anchesmius” is not a common English word; it is most likely an uncommon proper name whose meaning depends on the source text.","zh":"“Anchesmius”不是常见英语词；更可能是罕见的专有名词（人名），含义需结合原始出处判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A very rare or nonstandard term in modern English; most likely a proper name (a Latinized personal name) found in historical texts, manuscripts, or specialized contexts. It is not a common dictionary word, so its exact meaning depends on where you saw it.","zh":"在现代英语中极为罕见或不属常用词；更可能是专有名词（拉丁化的人名），出现在历史文献、手稿或非常专业的语境中。它不是常见词典词条，确切含义需要结合来源语境判断。"},"examples":[{"en":"In the manuscript index, Anchesmius appears as a personal name.","zh":"在手稿索引里，Anchesmius 作为人名出现。"},{"en":"I couldn’t find “Anchesmius” in standard dictionaries, so I checked the original source for context.","zh":"我在常规词典中找不到“Anchesmius”，所以我去查阅原始出处的上下文。"}]}],"phonetic":"/ænˈkɛzmiəs/","extraExplanation":["这个词很可能是：①拼写误读/转写差异（例如抄写体导致字母看错）；②某个历史人物/圣徒名/地名的拉丁化形式；③学术文献中的专门用名。若你能提供它出现的句子、语言（英语/拉丁语/希腊语等）、作者或作品名，我可以更准确地判断其来源、含义与更自然的读法。","英语里常见的人名拉丁化后缀之一是 -ius（类似 Julius），所以它“看起来像人名”，但并不保证它本身就是现代英语词汇。"]}
{"word":"Anchiale","summary":{"en":"Anchiale is a proper name, best known as an ancient city in Cilicia (southern Turkey), and less commonly as a name in Greek mythology.","zh":"Anchiale 是专有名词，最常指古代奇里乞亚（今土耳其南部）的一座城市；较少见时也可指希腊神话中的人物名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient city in Cilicia (in today’s southern Turkey), near Tarsus, mentioned in Greek and Roman sources.","zh":"安基阿勒（Anchiale）：古代奇里乞亚的一座城市，位于今土耳其南部、靠近塔尔苏斯，在希腊与罗马文献中有记载。"},"examples":[{"en":"Ancient writers sometimes list Anchiale among the coastal settlements of Cilicia.","zh":"古代作家有时会把 Anchiale 列为奇里乞亚沿海的聚落之一。"},{"en":"In some histories, Anchiale is mentioned together with Tarsus as part of the same region.","zh":"在一些史书中，Anchiale 常与塔尔苏斯并提，作为同一地区的地点。"}]},{"partOfSpeech":"n.","definition":{"en":"(Mythology, less common) A female figure (a nymph) in Greek myth, appearing as a proper name in some sources.","zh":"（较少见，神话）希腊神话中的女性人物名（常被称作宁芙），在部分文献中作为专名出现。"},"examples":[{"en":"Some mythological genealogies include Anchiale as a named nymph.","zh":"一些神话谱系会把 Anchiale 记作一位有名字的宁芙。"}]}],"phonetic":"/ænˈkaɪ.ə.li/","extraExplanation":["这是一个专有名词，常见于古典学/历史阅读，而不是日常英语。拼写来自希腊语 Ἀγχιάλη（Anchialē）。","在古代地理书写中，Anchiale 常被放在“奇里乞亚（Cilicia）—塔尔苏斯（Tarsus）”的语境里理解。不同作者对其具体位置与重要性描述不一。"]}
{"word":"Anchie","summary":{"en":"“Anchie” is typically used as a name or nickname rather than a standard English word.","zh":"“Anchie”通常用作名字或昵称，而不是标准英语单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A personal name or nickname (not a standard English dictionary word). It is often used as a unique spelling in families or online, and may be a variant of names like “Angie” or “Archie” depending on the person.","zh":"人名或昵称（不是标准英语词典词）。常见于家庭称呼或网名，可能是“Angie”或“Archie”等名字的变体拼写，具体含义取决于本人。"},"examples":[{"en":"Anchie is my cousin’s nickname; her real name is Angela.","zh":"Anchie 是我表姐的昵称；她的真名叫 Angela。"},{"en":"You can call me Anchie—it's easier to remember than my full name.","zh":"你可以叫我 Anchie——比我的全名更好记。"}]}],"synonyms":["Angie","Archie"],"phonetic":"/ˈæn.tʃi/","extraExplanation":["“Anchie”在英语里更像是专有名词（名字/昵称），而不是有固定词义的普通词。不同地区或家庭可能会用它来当作独特拼写。","如果你看到它出现在聊天、游戏ID或社交媒体上，通常只需要把它当作对方的名字来理解与称呼。","如果你是想查别的词：\n- “Archie” (/ˈɑr.tʃi/) 常见英文名\n- “Angie” (/ˈæn.dʒi/) 常见英文名（Angelina/Angela 的昵称）\n你可以告诉我你想表达的发音或上下文，我可以帮你确认。"]}
{"word":"Anchietea","summary":{"en":"Anchietea: a South American plant genus in the violet family.","zh":"Anchietea：堇菜科中主要分布于南美洲的一个植物属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants in the violet family (Violaceae), native mainly to South America","zh":"（植物）堇菜科（Violaceae）的一个开花植物属，主要原产于南美洲"},"examples":[{"en":"Anchietea is a genus in the violet family, found in parts of South America.","zh":"Anchietea 是堇菜科的一个植物属，分布在南美洲部分地区。"},{"en":"The botanist recorded an Anchietea species during fieldwork in Brazil.","zh":"这位植物学家在巴西的野外调查中记录到一种 Anchietea。"}]}],"phonetic":"/ˌɑːnkiˈeɪtiə/","extraExplanation":["Anchietea 属名通常被认为是在致敬历史人物“Anchieta（安谢塔）”，常见指 16 世纪在巴西活动的传教士与学者 José de Anchieta；许多拉丁学名会用这种方式纪念人物或地点。","这是一个植物学上的专有名词；在普通英语对话里很少出现，更常见于植物分类、论文、标本标签或自然历史类文本中。"]}
{"word":"anchietea","summary":{"en":"Anxiety means a feeling of worry or nervous fear; less commonly, it can mean eager concern to know something.","zh":"Anxiety 指焦虑、担心、不安；较少见时也可指急切的担忧或迫切想知道结果的心情。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feeling of worry, nervousness, or fear, especially about something that might happen in the future","zh":"焦虑；担心；不安（尤指对未来可能发生的事）"},"examples":[{"en":"I felt anxiety before the interview.","zh":"面试前我感到很焦虑。"},{"en":"Her anxiety got worse when she didn’t get a reply.","zh":"她一直没收到回复，焦虑更严重了。"},{"en":"Deep breathing can help reduce anxiety.","zh":"深呼吸可以帮助减轻焦虑。"}]},{"partOfSpeech":"n.","definition":{"en":"a strong desire or eagerness to do something (less common)","zh":"渴望；急切（较不常用）"},"examples":[{"en":"He waited with anxiety to hear the results.","zh":"他急切地等待结果。"}]}],"synonyms":["worry","nervousness","fear","stress","unease"],"phonetic":"/æŋˈzaɪəti/","extraExplanation":["你输入的“anchietea”看起来不像常见英文单词，最可能是想写 **anxiety**（焦虑）。拼写提示：anxiety 的中间是 **-xie-**（an-xi-e-ty）。","常见搭配：**feel anxiety**（感到焦虑）、**reduce/an ease anxiety**（减轻焦虑）、**anxiety about/over something**（对某事的焦虑）、**social anxiety**（社交焦虑）、**test anxiety**（考试焦虑）。"]}
{"word":"anchietin","summary":{"en":"“Anchietin” is not a common English word; it’s likely a misspelling or a specialized/proper-name term.","zh":"“anchietin”不是常见英语词；更可能是拼写错误或某个专业/专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it may be a misspelling, a specialized scientific term, or a proper name (for example, related to “Anchieta”).","zh":"不是常见词典中的标准英语单词；可能是拼写错误、某个专业领域术语，或专有名词（例如与“Anchieta/安谢塔”相关）。"},"examples":[{"en":"I couldn’t find “anchietin” in a dictionary—did you mean “ancient” or “anchoring”?","zh":"我在词典里找不到“anchietin”——你是不是想写“ancient（古老的）”或“anchoring（固定/抛锚）”？"},{"en":"Could you share the full sentence where you saw “anchietin”?","zh":"你能把看到“anchietin”的完整句子发我吗？"}]}],"phonetic":"/ˌænkiˈɛtɪn/","extraExplanation":["“anchietin”看起来更像是专有名词或某种转写形式（例如人名、地名、学名或化学名）。如果你提供来源（网页/书名/学科）或上下文句子，我可以更准确地判断它指什么，以及是否应改为其他拼写。"]}
{"word":"anchietine","summary":{"en":"Anchietine is a rare term used as the name of a chemical compound in some sources.","zh":"Anchietine 是一个较少见的词，在部分资料中用作某种化学化合物的名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare scientific name for a chemical compound (reported in older chemistry/pharmacology sources); exact reference can vary by field or text.","zh":"一个较少见的科学用语，用作某种化学化合物的名称（多见于较旧的化学/药理文献）；在不同领域或文献中的具体所指可能不完全一致。"},"examples":[{"en":"The paper lists anchietine among several alkaloids isolated from the plant extract.","zh":"这篇论文把 anchietine 列为从植物提取物中分离出的几种生物碱之一。"},{"en":"I couldn’t find “anchietine” in modern dictionaries, so I checked specialized chemical databases.","zh":"我在现代词典里找不到“anchietine”，所以去查了更专业的化学数据库。"}]}],"phonetic":"/ˌænkiəˈtiːn/","extraExplanation":["“anchietine”并不是常见英语词汇，更像是专有名词式的化合物命名（可能来自人名/地名的拉丁化或法语化拼写）。如果你能提供它出现的句子、学科（如药理/植物化学）或来源链接，我可以更准确地确认它的具体含义与对应中文译名。","拼写也可能有误：建议核对是否是类似的词形（例如以 -ine 结尾的化学命名很常见），或是否应为另一种更常见的词。"]}
{"word":"anchieutectic","summary":{"en":"Anchieutectic describes an alloy or mixture whose composition is very close to the eutectic point (nearly eutectic).","zh":"anchieutectic 用来描述成分非常接近共晶点的合金或混合物，即“近共晶”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(materials science) Having a composition very close to the eutectic composition; nearly eutectic.","zh":"（材料/冶金）成分非常接近共晶成分的；近共晶的。"},"examples":[{"en":"An anchieutectic alloy can solidify with a microstructure that resembles a eutectic mixture.","zh":"近共晶合金凝固后可能形成类似共晶混合物的显微组织。"},{"en":"They adjusted the copper–silver ratio to an anchieutectic composition to lower the melting temperature.","zh":"他们把铜—银的比例调到近共晶成分，以降低熔点。"}]}],"synonyms":["near-eutectic","almost eutectic","eutectic-adjacent"],"phonetic":"/ˌæŋki.juːˈtɛktɪk/","extraExplanation":["词源上常解释为来自希腊语前缀 anchi-（意为“靠近、附近”）+ eutectic（共晶）。在相图讨论中，它用于强调“非常接近共晶点”，但在现代教材与工程文献里更常见的表达是 near-eutectic（近共晶），以及更常用的分类术语 hypoeutectic（亚共晶）/ hypereutectic（过共晶）。","拼写容易与更常见的术语混淆；如果你是在论文或课本里见到它，建议同时对照相图与该文献的定义，以确认它指的是“近共晶”而不是“亚/过共晶”。"]}
{"word":"anchimonomineral","summary":{"en":"A rare geology term meaning “almost made of only one mineral.”","zh":"一个较罕见的地质用语，意思是“几乎只由一种矿物组成”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Geology) made up of almost only one mineral; nearly monomineralic.","zh":"（地质）几乎只由一种矿物组成的；近似“单矿物”的。"},"examples":[{"en":"The rock is anchimonomineral, with quartz dominating and only trace feldspar.","zh":"这块岩石属于近似单矿物的，以石英为主，只有少量长石。"},{"en":"Under the microscope, the sample looks anchimonomineral rather than truly monomineralic.","zh":"在显微镜下，这个样品看起来是近似单矿物，而不是真正的单矿物。"}]}],"synonyms":["nearly monomineralic","almost monomineralic","quasi-monomineralic"],"phonetic":"/ˌænkaɪˌmɑːnoʊˈmɪnərəl/","extraExplanation":["这个词非常少见，多见于专业写作或作为“临时造词”。它通常可理解为 anchi-（表示“近似、接近”）+ monomineral/monomineralic（“单矿物的”）。","在常见地质英语里，更常用的表达是 nearly monomineralic / almost monomineralic。"]}
{"word":"Anchinoe","summary":{"en":"Anchinoe (Anchinoë) is a Greek-mythology female name, sometimes listed as one of the Danaids.","zh":"Anchinoe（Anchinoë）是希腊神话中的女性名字，有时被列为“达奈得斯”之一。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper noun) A feminine name from Greek mythology, often spelled Anchinoë; in some sources she is listed as one of the Danaids (the fifty daughters of Danaus).","zh":"（专有名词）源自希腊神话的女性名字，常写作 Anchinoë；在一些文献中她被列为“达奈得斯”（达那俄斯的五十个女儿）之一。"},"examples":[{"en":"Anchinoe appears in some lists of the Danaids, though details about her story are limited.","zh":"Anchinoe 在一些“达奈得斯”的名单中出现，但关于她的具体故事细节不多。"},{"en":"The name Anchinoë is a variant spelling; you may see it written with a diaeresis (ë) in older texts.","zh":"Anchinoë 这个名字有不同拼写；在较老的文本里你可能会看到带分音符（ë）的写法。"}]}],"synonyms":["Anchinoë"],"phonetic":"/ˌæŋkɪˈnoʊ.i/","extraExplanation":["Anchinoë（常见的带 ë 写法）来自古希腊语人名的拉丁化/英语化转写。ë 的作用是提示读者把 o 和 e 分开读（类似 “oh-eh” 的感觉），而不是合成一个音。","这类名字在不同神话版本、抄本与英译本中常有拼写差异；如果你是在特定书目、游戏或小说里看到 Anchinoe，可能是作者选用的某一版本拼写。"]}
{"word":"Anchisaurus","summary":{"en":"Anchisaurus: a small early Jurassic plant‑eating dinosaur genus from North America.","zh":"Anchisaurus：一种北美侏罗纪早期的小型植食性恐龙属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, early plant‑eating dinosaur (a genus of early sauropodomorphs) that lived in the Early Jurassic period, known from fossils found in North America.","zh":"安琪龙属（一种早期蜥脚形类恐龙的属），生活在侏罗纪早期，以植物为食；其化石主要发现于北美。"},"examples":[{"en":"Anchisaurus was a relatively small dinosaur compared with later giant sauropods.","zh":"与后期巨大的蜥脚类恐龙相比，Anchisaurus 的体型相对较小。"},{"en":"Some museum exhibits place Anchisaurus near the base of the long‑necked dinosaur family tree.","zh":"一些博物馆展览会把 Anchisaurus 放在长颈恐龙“家谱”的较早分支位置。"}]}],"synonyms":["early sauropodomorph","prosauropod (informal/older term)"],"phonetic":"/ˌæŋkɪˈsɔrəs/","extraExplanation":["词源上常解释为来自希腊语：ankhi-（“近、接近”）+ -saurus（“蜥蜴、蜥蜴类”），因此可理解为“近蜥蜴（的爬行动物）”。","这是一个属名（genus name），通常首字母大写；在科普或学术语境里多用拉丁化的学名写法。","读音上重音常落在倒数第二个音节（-sor-）附近，整体听起来像“an-ki-SOR-us”。"]}
{"word":"anchisaurus","summary":{"en":"Anchisaurus is an early Jurassic, small herbivorous dinosaur genus found mainly in North America.","zh":"Anchisaurus（近蜥龙）是一种侏罗纪早期、体型较小的食草恐龙属，主要发现于北美。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, early plant‑eating dinosaur (a genus of early sauropodomorphs) that lived in the Early Jurassic; fossils have been found mainly in North America (especially the northeastern U.S.).","zh":"一种体型较小、早期的食草恐龙（早期蜥脚形类的一个属），生活在侏罗纪早期；化石主要发现于北美（尤其美国东北部）。"},"examples":[{"en":"Anchisaurus fossils have been discovered in Connecticut and neighboring states.","zh":"在康涅狄格州及其周边地区发现过近蜥龙（Anchisaurus）的化石。"},{"en":"In some museum exhibits, Anchisaurus is shown as an early relative of the long‑necked sauropods.","zh":"在一些博物馆展览中，近蜥龙常被展示为长颈蜥脚类恐龙的早期近亲。"}]}],"synonyms":["near-lizard (etymological meaning)"],"phonetic":"/ˌæŋkɪˈsɔrəs/","extraExplanation":["“Anchisaurus”是一个属名（genus name），常见于科普、博物馆展板和古生物学文章中；中文常译作“近蜥龙”。","词源来自希腊语：anchi-（“近、接近”）+ sauros（“蜥蜴/蜥龙”），含义大致是“接近（其他）蜥龙的”。","作为学术名称，首字母通常大写（Anchisaurus）；如果在句中泛指这个属的成员，也可用小写复数（anchisaurs）作非正式表达。"]}
{"word":"Anchises","summary":{"en":"Anchises is a Trojan prince in myth, the lover of Aphrodite (Venus) and the father of Aeneas, especially known from Virgil’s *Aeneid*.","zh":"安喀塞斯是神话中的特洛伊王子，阿佛洛狄忒（维纳斯）的恋人、埃涅阿斯之父，尤以《埃涅阿斯纪》中的形象著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek & Roman mythology) A Trojan prince, loved by the goddess Aphrodite (Venus), and the father of Aeneas.","zh":"（希腊/罗马神话）安喀塞斯：特洛伊王子，被爱神阿佛洛狄忒（罗马称维纳斯）所爱，是埃涅阿斯的父亲。"},"examples":[{"en":"In mythology, Anchises is the mortal lover of Aphrodite and the father of Aeneas.","zh":"在神话中，安喀塞斯是阿佛洛狄忒的凡人恋人，也是埃涅阿斯的父亲。"},{"en":"Many retellings say Aphrodite visited Anchises in disguise.","zh":"许多改写版本说，阿佛洛狄忒曾乔装去拜访安喀塞斯。"}]},{"partOfSpeech":"n.","definition":{"en":"In Virgil’s *Aeneid*, Aeneas’s elderly father, famously carried out of burning Troy—often used as a symbol of duty and family devotion.","zh":"在维吉尔《埃涅阿斯纪》中，埃涅阿斯年迈的父亲；他被儿子背出燃烧的特洛伊，常被用来象征责任感与孝亲/家族担当。"},"examples":[{"en":"The image of Aeneas carrying Anchises appears in many paintings and sculptures.","zh":"“埃涅阿斯背着安喀塞斯”的形象出现在许多绘画与雕塑中。"},{"en":"Teachers sometimes mention Anchises to explain why Aeneas is called “pious” (devoted to duty).","zh":"老师有时会提到安喀塞斯，用来解释为什么埃涅阿斯被称为“虔敬的”（忠于责任）。"}]}],"synonyms":["Aeneas’s father","Trojan prince (in myth)"],"phonetic":"/ænˈkaɪsiːz/","extraExplanation":["“Anchises”常见于西方文学与艺术典故中，尤其是罗马史诗《埃涅阿斯纪》。他与埃涅阿斯的关系让这个名字常被用来谈“父辈传承”“家族责任”“在灾难中背负亲人”等主题。","词形上是专有名词（人名），中文常译作“安喀塞斯”（也有译作“安喀塞”）。阅读时把它当作人物名字即可，不需要按普通词汇去拆分记忆。"]}
{"word":"anchises","summary":{"en":"Anchises is a mythological figure: the mortal father of Aeneas and lover of Aphrodite/Venus.","zh":"Anchises（安喀塞斯）是神话人物：埃涅阿斯的凡人父亲，也是阿佛洛狄忒/维纳斯的情人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek and Roman mythology, the mortal father of Aeneas (a Trojan hero) and a lover of the goddess Aphrodite (Venus in Roman myth).","zh":"（希腊/罗马神话）安喀塞斯：特洛伊英雄埃涅阿斯（Aeneas）的凡人父亲，也是爱神阿佛洛狄忒（罗马名维纳斯 Venus）的情人。"},"examples":[{"en":"In the Aeneid, Aeneas carries Anchises out of burning Troy.","zh":"在《埃涅阿斯纪》中，埃涅阿斯背着安喀塞斯逃离燃烧的特洛伊。"},{"en":"Anchises is remembered as Aeneas’s father in many classical stories.","zh":"在许多古典故事里，安喀塞斯以“埃涅阿斯之父”的身份被人记住。"}]}],"phonetic":"ænˈkaɪsiːz","extraExplanation":["“Anchises”常出现在古典文学与艺术里，尤其与维吉尔（Virgil）的史诗《埃涅阿斯纪》（The Aeneid）相关：他象征家族传承与故土记忆。","英语里它通常作为专有名词使用（人名/神话人物名），写作时首字母要大写：Anchises。"]}
{"word":"Anchistea","summary":{"en":"Anchistea is a botanical genus name (a Latin scientific name) for a kind of fern, often seen in Anchistea virginica.","zh":"Anchistea 是蕨类植物的属名（拉丁学名），常见于 Anchistea virginica 等名称中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific (Latin) genus name for a type of fern; it is most often seen in botany, especially in the species name Anchistea virginica (Virginia chain fern).","zh":"（植物学）一种蕨类的拉丁学名属名；常见于植物学语境，尤其用于物种名 Anchistea virginica（弗吉尼亚链蕨）。"},"examples":[{"en":"In some modern classifications, the Virginia chain fern is listed as Anchistea virginica.","zh":"在一些较新的分类体系中，弗吉尼亚链蕨被列为 Anchistea virginica。"},{"en":"The label uses the genus name Anchistea, followed by the species name.","zh":"标签先写属名 Anchistea，再写种加词（species name）。"}]}],"synonyms":["Woodwardia (in some classifications)","Virginia chain fern (common name for Anchistea virginica)"],"phonetic":"/ˌæŋkɪˈstiːə/","extraExplanation":["“Anchistea”属于拉丁化的科学命名，通常首字母大写、用斜体书写（如 *Anchistea virginica*）。不同资料可能把它归入或并入其他属（例如与 *Woodwardia* 的关系），这是植物分类更新导致的常见现象。"]}
{"word":"anchistea","summary":{"en":"“anchistea” isn’t recognized as a standard English word; it’s probably a misspelling or a name.","zh":"“anchistea”不是标准英语单词；很可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a name/username. If you tell me the sentence or what you meant, I can identify the intended word.","zh":"不是标准英语单词；很可能是拼写错误，或是人名/用户名。若你提供句子或想表达的意思，我可以帮你找出正确单词。"},"examples":[{"en":"I can’t find “anchistea” in an English dictionary—could it be a typo?","zh":"我在英语词典里找不到“anchistea”——会不会是打错了？"},{"en":"If you meant “anxious,” the spelling is different.","zh":"如果你想写“anxious（焦虑的）”，拼写是不一样的。"}]}],"extraExplanation":["在英语里遇到“查不到”的词，常见原因有：①拼写错误（少/多了字母）；②专有名词（人名、地名、品牌名）；③其他语言的词被当成英文输入。","你可以把它出现的完整句子发给我，或告诉我你想表达的中文意思（例如“焦虑/茶/某个品牌”等），我就能更准确地帮你对照出最可能的英文词。"]}
{"word":"Anchistopoda","summary":{"en":"Anchistopoda is a scientific genus name used in biological classification.","zh":"Anchistopoda 是生物分类学中使用的属名（拉丁学名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific genus name (taxonomy), used for a group of related organisms—especially used in biological classification.","zh":"（生物分类学中的）属名：用于指一组亲缘关系较近的生物的拉丁学名层级。"},"examples":[{"en":"Anchistopoda is a genus name you might see in a taxonomic checklist.","zh":"Anchistopoda 这个词可能会出现在分类名录或物种清单中。"},{"en":"Researchers may update where Anchistopoda belongs as new DNA evidence appears.","zh":"随着新的 DNA 证据出现，研究人员可能会更新 Anchistopoda 在分类系统中的位置。"}]}],"synonyms":["genus name","taxonomic genus"],"phonetic":"/ˌæŋkɪˈstɑːpədə/","extraExplanation":["这是一个比较冷门的拉丁学名（属名）。在英文语境里它通常不会像普通词汇那样使用，而是出现在论文、博物馆标本标签、物种数据库（如分类检索表）中。","拉丁学名的读法在英语中常见做法是按英语发音规则“近似读”，不同地区或不同学科的人读音可能略有差异。"]}
{"word":"anchistopoda","summary":{"en":"“anchistopoda” appears to be a rare biological taxonomic name rather than a standard English word.","zh":"“anchistopoda”看起来更像罕见的生物分类学名称，而不是常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A scientific Latin taxonomic name (likely a genus or higher group name) used in biology; it is not a common English vocabulary word and its exact meaning depends on the organism and the source that uses the name.","zh":"一个生物分类学中的拉丁化学名（可能是属名或更高阶元名）；它不是常见英语词汇，具体指代要看出现的学科语境与采用该名称的文献。"},"examples":[{"en":"I couldn’t find “anchistopoda” in standard English dictionaries; it seems to be a taxonomic name from a biology text.","zh":"我在常见英语词典里找不到“anchistopoda”；它看起来像是出自生物学教材的分类学名称。"},{"en":"If “anchistopoda” is a genus name, it should be capitalized in scientific writing (e.g., Anchistopoda).","zh":"如果“anchistopoda”是属名，在科学写作中通常要首字母大写（例如 Anchistopoda）。"}]}],"phonetic":"/ˌæŋkɪˈstɑpədə/","extraExplanation":["这个词非常罕见，且不像一般英语单词；更像“拉丁化的分类名”。若你能提供它出现的句子/书名/学科（昆虫学、甲壳类、古生物等），我可以更准确地判断它属于哪一类群、现代是否仍在使用、以及是否有拼写变体。","很多分类名在不同年代的文献里可能经历过更名或并入其他类群（同物异名/异名），因此“准确释义”往往需要具体来源来核对。"]}
{"word":"anchithere","summary":{"en":"“anchithere” is not a recognized English word; it’s probably a misspelling and needs context.","zh":"“anchithere”不是可识别的英语词；很可能是拼写错误，需要上下文确认。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a typo or a misspelling of another word/phrase (so the meaning is unclear without context).","zh":"不是标准英语单词；很可能是拼写错误或把别的词/短语拼错了（因此没有明确含义，需要上下文）。"},"examples":[{"en":"I can’t find “anchithere” in a dictionary—did you mean a different word?","zh":"我在词典里找不到“anchithere”——你是不是想写别的词？"},{"en":"Could you share the full sentence with “anchithere” so I can guess what you meant?","zh":"你能把包含“anchithere”的完整句子发我吗？这样我才能判断你想表达什么。"}]}],"phonetic":"/ˈæn.tʃiˌðɛr/","extraExplanation":["“anchithere”看起来像把几个词连在一起或拼错了。常见的可能性（需要你提供句子确认）包括：\n- “an inch there”（那边差一英寸/一点点距离）\n- “aren’t you there?”（你不在吗？）\n- 人名/用户名/专有名词（这类通常不进词典）\n把原句贴出来，我可以帮你定位最可能的正确写法并解释用法。"]}
{"word":"anchithere-like","summary":{"en":"Antihero-like describes someone or something that feels like an antihero—central, compelling, but morally imperfect.","zh":"Antihero-like 用来形容“反英雄式”的人或事物：很吸引人、是核心人物，但道德上并不完美。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"resembling an antihero (a main character who lacks traditional heroic qualities and may be morally flawed, selfish, or cynical).","zh":"像“反英雄”的；具有反英雄特质的（主角缺乏传统英雄的高尚品质，可能有道德瑕疵、自私或愤世嫉俗）。"},"examples":[{"en":"The story’s narrator is antihero-like: he lies often, but you still understand his pain.","zh":"故事的叙述者很有反英雄的味道：他经常撒谎，但你依然能理解他的痛苦。"},{"en":"Her antihero-like charm comes from being honest about her mistakes.","zh":"她那种反英雄式的魅力来自于对自己错误的坦诚。"},{"en":"The film has an antihero-like lead who does the right thing for the wrong reasons.","zh":"这部电影的主角有反英雄气质：用不太正当的动机做了正确的事。"}]}],"synonyms":["antiheroic","morally gray","cynical","flawed"],"phonetic":"ˌæntiˈhɪroʊ laɪk","extraExplanation":["你输入的“anchithere-like”不太常见；更常见的拼写很可能是 **antihero-like**（antihero = 反英雄）。如果你指的是别的词/短语，可以告诉我上下文句子，我也能帮你确认。","“antihero”在英语流行文化里很常见，尤其是电影、电视剧、漫画与小说：角色往往不完美、甚至做坏事，但仍是故事核心人物。常见搭配：antihero-like character（反英雄式角色）、antihero-like vibe（反英雄氛围/气质）。"]}
{"word":"anchitheriine","summary":{"en":"Anchitheriine refers to (or is) an extinct early-horse group related to Anchitheriinae.","zh":"anchitheriine 指与安基马亚科有关的（或指该类的）已灭绝早期马科动物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Paleontology) Related to the Anchitheriinae, an extinct group of early horses (equids).","zh":"（古生物学）与“安基马亚科”（Anchitheriinae）有关的；指一类已灭绝的早期马科动物。"},"examples":[{"en":"The museum displayed an anchitheriine skull from the Miocene.","zh":"博物馆展出了一件来自中新世的安基马类头骨化石。"},{"en":"Anchitheriine fossils help scientists track how horses evolved over time.","zh":"安基马类化石帮助科学家追踪马在漫长时间中的演化。"}]},{"partOfSpeech":"n.","definition":{"en":"An anchitheriine animal—an extinct early horse belonging to the Anchitheriinae.","zh":"安基马类动物；指属于安基马亚科的一种已灭绝的早期马。"},"examples":[{"en":"Researchers compared the teeth of an anchitheriine with those of modern horses.","zh":"研究人员将一只安基马类动物的牙齿与现代马的牙齿进行比较。"},{"en":"An anchitheriine likely lived in wooded habitats rather than open grasslands.","zh":"安基马类动物可能更常生活在林地环境，而不是开阔草原。"}]}],"synonyms":["anchitherine","Anchitheriinae (related)","Anchitherium-like (informal)"],"phonetic":"/ˌæŋkɪˈθɪriˌaɪn/","extraExplanation":["词源提示：anchitheriine 来自属名 Anchitherium（“安基马”）+ -ine（表示“……的/……类的”）。在学术写作中常见于古生物学与演化生物学语境。","背景补充：安基马类通常被认为是较早期的马科支系之一，常与“现代马（Equus）”对比来讨论牙齿、四肢与栖息地（如森林到草原）的适应变化。"]}
{"word":"anchitherioid","summary":{"en":"A scientific adjective meaning “Anchitherium-like,” used for fossils or traits resembling an extinct early horse.","zh":"一个科学用语形容词，意为“安基兽型/似安基兽的”，用于描述与已灭绝早期马类相似的化石或特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or resembling an Anchitherium—an extinct, three-toed horse-like mammal (an early equid).","zh":"与“安基兽”（Anchitherium，一种已灭绝的三趾、马类哺乳动物，早期马科成员）有关的；或像安基兽的。"},"examples":[{"en":"The fossil teeth were described as anchitherioid, suggesting an early horse relative.","zh":"这些化石牙齿被描述为“anchitherioid（安基兽型的）”，暗示它们属于早期马类近亲。"},{"en":"Researchers compared the limb bones to determine whether the specimen was truly anchitherioid.","zh":"研究人员比较了四肢骨骼，以判断该标本是否确为安基兽型。"}]}],"synonyms":["anchithere-like","anchitheriine (related term)"],"phonetic":"/ˌæŋkɪˈθɪriˌɔɪd/","extraExplanation":["这是一个偏古生物学/动物学的形容词，常用于论文或博物馆说明文字里，用来表达“像某一类已灭绝马科（尤其与 Anchitherium 相关）的形态特征”。","词形结构上，-oid 表示“……样的/类似……的”（如 humanoid“类人型的”），因此 anchitherioid 可理解为“anchithere-like（像安基兽的）”。"]}
{"word":"anchoic","summary":{"en":"“Anchoic” means “without echoes,” especially in acoustics and ultrasound imaging (often spelled “anechoic”).","zh":"“anchoic”意为“无回声的”，常用于声学与超声成像（更常见拼写为“anechoic”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(in acoustics or imaging) Without echoes; producing no reflected sound waves. In medical ultrasound, it describes an area that looks completely dark because it does not reflect the ultrasound beam (often fluid-filled).","zh":"（声学或成像）无回声的；不产生反射声波的。在医学超声中，指不反射超声波、因此呈黑色的区域（常见于含液体的结构）。"},"examples":[{"en":"The researchers tested the microphone inside an anechoic (anchoic) chamber to avoid echoes.","zh":"研究人员在无回声室里测试麦克风，以避免回声干扰。"},{"en":"On the ultrasound image, the cyst appears as an anechoic (anchoic) area.","zh":"在超声图像上，囊肿表现为无回声（全黑）的区域。"},{"en":"Because the room was effectively anechoic, her voice sounded unusually “dry.”","zh":"因为房间几乎没有回声，她的声音听起来异常“干”。"}]}],"synonyms":["anechoic","echo-free","non-echoing","sound-absorbent"],"phonetic":"/ænˈkoʊɪk/","extraExplanation":["“anchoic”常被当作“anechoic”的变体或误拼；标准、最常见的拼写是 **anechoic**。","词源：来自前缀 **an-**（“无”）+ **echo**（“回声”）。在工程里常说 **anechoic chamber**（无回声室），用于测量音响、麦克风、扬声器等。","在超声检查报告中，“anechoic/无回声”通常提示该区域多为液体（如囊肿、积液），但最终解读应由专业医生结合其他特征判断。"]}
{"word":"Anchong-Ni","summary":{"en":"Anchong-Ni is a romanized proper name, not a common English word; its meaning depends on context.","zh":"Anchong-Ni 是罗马字拼写的专有名词，并非常见英语词；具体含义取决于上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A romanized proper name (not a standard English vocabulary word). It may refer to a person’s name or a place name written in Latin letters, depending on context.","zh":"一个罗马字拼写的专有名词（不是标准英语词汇）。可能指人名或地名，需结合上下文判断。"},"examples":[{"en":"Anchong-Ni appears to be a proper name, so I need the sentence or source to explain it accurately.","zh":"“Anchong-Ni”看起来像专有名词，所以我需要你提供句子或出处才能更准确解释。"},{"en":"Is Anchong-Ni the name of a person, a village, or a character in a story?","zh":"“Anchong-Ni”是人名、村名，还是故事/作品里的角色名呢？"}]}],"phonetic":"/ˈɑn.tʃɔŋ ni/","extraExplanation":["从形式看，“Anchong-Ni”更像东亚语言（如韩语/汉语等）音译成拉丁字母的写法；连字符（-）常用于把名字的两个部分分开，或用于地名的转写。","如果你能提供：1）它出现的句子/段落；2）所属语言或地区；3）是否是人名/地名/作品名，我可以进一步给出更贴切的含义、可能的原拼写（如拼音/韩语转写）以及在英语文本中应如何使用（大小写、是否需要连字符等）。"]}
{"word":"anchor","summary":{"en":"“Anchor” means a ship’s anchor, and more broadly anything that keeps something stable; it can also mean to secure firmly or to host a news program.","zh":"“anchor”既指（船的）锚，也可比喻“稳定的支撑/依靠”；作动词可表示“固定/停泊”，还可指“担任新闻主播”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a heavy metal object attached to a chain or rope, used to keep a ship or boat from moving","zh":"（船的）锚；（通过锚链/绳索固定船只、防止漂移的）金属重物"},"examples":[{"en":"The sailors dropped the anchor near the island.","zh":"水手们在岛附近下了锚。"},{"en":"We stayed overnight at anchor in a quiet bay.","zh":"我们在一个安静的海湾抛锚过夜。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or thing that provides stability, support, or a reliable starting point","zh":"精神支柱；靠山；让人稳定、安心或有依靠的人/事物"},"examples":[{"en":"Her family was her anchor during a difficult year.","zh":"在艰难的一年里，她的家人是她的精神支柱。"},{"en":"The school serves as an anchor for the community.","zh":"这所学校是社区的稳定核心。"}]},{"partOfSpeech":"vt.","definition":{"en":"to secure something firmly in place; to moor a boat","zh":"固定；使牢固；（使船）停泊、抛锚"},"examples":[{"en":"They anchored the boat a few meters from the shore.","zh":"他们把船停泊在离岸几米的地方。"},{"en":"The bookshelf is anchored to the wall for safety.","zh":"为了安全，书架被固定在墙上。"}]},{"partOfSpeech":"v.","definition":{"en":"to present the main news program on TV or radio (as the principal host)","zh":"（在电视/广播中）担任新闻主播；主持主要新闻节目"},"examples":[{"en":"She anchors the evening news on a national network.","zh":"她在一家全国性电视台主持晚间新闻。"}]}],"synonyms":["moor","secure","fasten","stabilize","mainstay"],"phonetic":"/ˈæŋkɚ/","extraExplanation":["“anchor”作比喻时很常见：像锚一样“让人不漂走”，强调稳定与支撑。常见搭配有 emotional anchor（情感支点）、anchor point（锚点/固定点）。","新闻里的“anchor”主要是美式用法，指主要主播；英式英语里也用，但有时更常说 newsreader（新闻播报员）。"]}
{"word":"anchor-related","summary":{"en":"“Anchor-related” means connected to an anchor or anchoring; in some contexts it can also mean connected to a news anchor or an “anchor” business/product that supports others.","zh":"“anchor-related”表示与锚/锚定有关；在某些语境中也可指与新闻主播或“主力/核心”商业事物有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to an anchor (a heavy device used to hold a boat or ship in place), or to the act of anchoring something firmly.","zh":"与“锚”（用来固定船只的重物）有关的；或与“固定/锚定”这一动作有关的。"},"examples":[{"en":"The crew checked all anchor-related equipment before the storm arrived.","zh":"暴风雨来临前，船员检查了所有与锚有关的设备。"},{"en":"The report listed several anchor-related accidents caused by poor maintenance.","zh":"报告列出了几起因维护不当导致的与锚有关的事故。"}]},{"partOfSpeech":"adj.","definition":{"en":"In media/business, related to an anchor person or “anchor” product/location (something central that supports others).","zh":"在媒体/商业语境中：与“主播/新闻主持人”或“主力产品/核心地点”（起支撑带动作用的核心事物）有关的。"},"examples":[{"en":"The editor requested more anchor-related questions for the interview.","zh":"编辑要求在采访中加入更多与主播相关的问题。"},{"en":"The mall’s anchor-related foot traffic increased after the new department store opened.","zh":"新百货公司开业后，商场与主力店相关的人流量增加了。"}]}],"synonyms":["anchor-associated","anchor-connected","anchoring-related","anchor-linked"],"phonetic":"/ˈæŋkɚ rɪˈleɪtɪd/","extraExplanation":["“anchor-related”是由名词 anchor + related 组成的复合形容词，常用连字符表示它们一起修饰后面的名词（如 anchor-related equipment）。在正式写作中，放在名词前时更常加连字符；放在系动词后作表语时有时可不加（如 The issue is anchor related），但加连字符更清晰。"]}
{"word":"anchor-safe","summary":{"en":"Anchor-safe describes something securely held by an anchor or a place that is good and safe for anchoring.","zh":"anchor-safe 指“锚固牢靠、不易走锚”，也可指“适合抛锚、锚地条件安全”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Secure to an anchor; not likely to drift because the anchor is holding well (used especially about a boat).","zh":"（尤指船只）锚固牢靠的；不易走锚漂移的（因为锚抓得很稳）。"},"examples":[{"en":"The captain checked the weather report to be sure the boat was anchor-safe overnight.","zh":"船长查看天气预报，确保船只夜间锚泊安全。"},{"en":"In this sheltered bay, most small boats remain anchor-safe even when the wind picks up.","zh":"在这个避风海湾里，即使风变大，大多数小船也能保持锚泊安全。"}]},{"partOfSpeech":"adj.","definition":{"en":"Suitable for anchoring; providing conditions where an anchor can hold well (used about a place such as a bay or seabed).","zh":"适合抛锚的；（指海湾、海床等）利于锚抓牢、不易走锚的。"},"examples":[{"en":"They looked for an anchor-safe spot with sand or mud on the bottom.","zh":"他们寻找海底是沙或泥、便于锚抓牢的抛锚点。"},{"en":"The marina suggested an anchor-safe cove on the leeward side of the island.","zh":"码头工作人员建议去岛的背风面一个适合抛锚的海湾。"}]}],"synonyms":["secure at anchor","anchored securely","safe at anchor","safe anchorage","good holding ground"],"phonetic":"/ˈæŋkɚ seɪf/","extraExplanation":["“anchor-safe”多见于航海/帆船语境，是由“anchor（锚）+ safe（安全的）”构成的复合形容词。在正式写作中也常用更常见的表达，如“secure at anchor”“good holding ground（抓地力好的海底）”“safe anchorage（安全锚地）”。"]}
{"word":"anchor-shaped","summary":{"en":"“Anchor-shaped” describes something that has the shape of an anchor.","zh":"“anchor-shaped”表示“锚形的”，即外形像船锚。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape of an anchor (the heavy metal tool used to hold a boat in place).","zh":"锚形的；形状像“船锚”的。"},"examples":[{"en":"The pendant is anchor-shaped and made of silver.","zh":"这枚吊坠是银制的，形状像船锚。"},{"en":"An anchor-shaped scar formed on his shoulder after the accident.","zh":"事故后，他肩膀上留下了一道锚形的疤痕。"},{"en":"The park has an anchor-shaped fountain near the entrance.","zh":"公园入口附近有一个锚形喷泉。"}]}],"synonyms":["anchorlike","anchored (figurative)","nautical-themed (broader)"],"phonetic":"/ˈæŋkər ʃeɪpt/","extraExplanation":["“anchor-shaped”是由名词anchor（船锚）+ shaped（……形状的）构成的复合形容词，常用于描述外观或图案（pendant项链坠、logo标志、scar疤痕、tattoo纹身等）。","书写上通常带连字符（anchor-shaped），尤其在名词前作定语时更常见：an anchor-shaped charm。放在系动词后作表语时也可见不加连字符的写法，但带连字符更清晰。","文化联想：在西方语境中，船锚常象征“稳定、希望、坚守”（如海军、航海文化、或“hope”主题纹身中常出现锚的图案）。"]}
{"word":"anchor-warping","summary":{"en":"Anchor-warping is a nautical way to move a ship by dropping an anchor and hauling in the cable to pull the ship forward.","zh":"Anchor-warping 指航海中通过下锚并绞收锚链来牵引船只前移的一种移船方法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nautical) The method of moving a ship by setting an anchor and then hauling on the anchor cable (or using a winch) to pull the ship forward, often in tight spaces or calm conditions.","zh":"（航海）“抛锚拖移/绞锚移船”：先下锚，再收紧并绞收锚链（或用绞盘牵引）把船拉动前移的方法，常用于狭窄水域或无风、难以机动时。"},"examples":[{"en":"In the narrow canal, the crew relied on anchor-warping to inch the vessel along.","zh":"在狭窄的运河里，船员靠抛锚拖移让船一点点向前移动。"},{"en":"With no wind for the sails, they used anchor-warping to reach the mooring.","zh":"没有风可用来扬帆时，他们用抛锚拖移靠近系泊点。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to or done by the anchor-warping method.","zh":"与抛锚拖移有关的；采用抛锚拖移方式进行的。"},"examples":[{"en":"They made an anchor-warping maneuver to avoid drifting into the rocks.","zh":"他们做了一次抛锚拖移动作，避免被水流带向礁石。"}]}],"synonyms":["warping","kedging","hauling on the anchor cable"],"phonetic":"ˈæŋkər ˌwɔrpɪŋ","extraExplanation":["“Warping”在航海英语里常指“用缆绳/绞盘拖拉使船移动”，不等于科幻语境里的“warp（扭曲/超光速）”。因此 anchor-warping 是非常传统的海事操作术语。","相关词：warp (a ship)＝用缆绳拖移船；warping into/out of a berth＝用缆绳把船拉进/拉出泊位。"]}
{"word":"anchorable","summary":{"en":"Anchorage-related adjective meaning “suitable for anchoring” (and sometimes “able to be firmly fixed in place”).","zh":"与航海停泊相关的形容词，意为“适合抛锚/停泊”，也可引申为“可牢固固定的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Suitable for dropping an anchor; safe or practical for a boat to anchor in (because of depth, seabed, shelter, etc.).","zh":"适合抛锚的；适宜船只停泊的（因水深、海底地质、避风条件等而安全或可行）。"},"examples":[{"en":"The captain searched for an anchorable bay before nightfall.","zh":"船长在天黑前寻找一个适合抛锚的海湾。"},{"en":"This area isn’t anchorable because the water is too deep and the current is strong.","zh":"这片水域不适合抛锚，因为水太深且水流很急。"}]},{"partOfSpeech":"adj.","definition":{"en":"Able to be fixed firmly in place (used more broadly or figuratively).","zh":"能被牢固固定的；可作为“支点/依托”的（引申义或比喻用法）。"},"examples":[{"en":"The design needs an anchorable base so it won’t slide during use.","zh":"这个设计需要一个可固定的底座，使用时才不会滑动。"},{"en":"She tried to build an anchorable routine during a stressful semester.","zh":"在压力很大的学期里，她努力建立一个能让自己稳定下来的作息。"}]}],"synonyms":["suitable for anchoring","safe to anchor","anchor-safe","secure","fixable"],"phonetic":"/ˈæŋkərəbəl/","extraExplanation":["“anchorable”由 anchor（锚；抛锚）+ -able（可……的）构成，常见于航海、港口与海图/航行说明等语境。更常见的相关表达还有 “anchorage”（锚地）与 “suitable for anchoring”（适合抛锚）。","在专业航海语境里，是否“anchorable”通常会考虑：水深是否合适、海底是否能抓锚（如沙/泥较好、礁石较差）、遮蔽风浪程度、潮汐与水流、是否有禁锚区等。"]}
{"word":"Anchorage","summary":{"en":"Anchorage means a place to anchor a ship, the act of anchoring securely, or the city of Anchorage in Alaska.","zh":"Anchorage 可指船只的停泊地/抛锚处、锚固（固定）的行为或方式，也可指美国阿拉斯加州的安克雷奇市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a safe place where a ship can drop its anchor; a place to anchor (often in a bay or harbor)","zh":"（船只的）抛锚处；停泊地（常指海湾或港口中适合下锚的地方）"},"examples":[{"en":"The captain looked for a sheltered anchorage before the storm arrived.","zh":"暴风雨到来前，船长寻找一个有遮蔽的停泊地。"},{"en":"This bay provides good anchorage for small boats.","zh":"这个海湾为小船提供了良好的抛锚条件。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or method of anchoring something firmly in place","zh":"固定；锚固（指把某物牢固固定在某处的做法或过程）"},"examples":[{"en":"The anchorage of the bridge cables must be checked regularly.","zh":"桥梁缆索的锚固必须定期检查。"},{"en":"Engineers improved the anchorage to make the structure safer.","zh":"工程师改进了锚固方式，使结构更安全。"}]},{"partOfSpeech":"n.","definition":{"en":"the largest city in Alaska, U.S.","zh":"安克雷奇（美国阿拉斯加州最大城市）"},"examples":[{"en":"Anchorage is a common starting point for trips into Alaska’s wilderness.","zh":"安克雷奇常是前往阿拉斯加荒野旅行的起点。"},{"en":"She moved to Anchorage for work.","zh":"她因为工作搬到了安克雷奇。"}]}],"synonyms":["mooring","berth","harbor","haven","dock"],"phonetic":"/ˈæŋkərɪdʒ/","extraExplanation":["“Anchorage”来自“anchor”（锚）+ “-age”（表示“地点/行为/结果”的后缀），所以既可表示“停泊地”，也可表示“锚固/固定”。","作为地名的 Anchorage（安克雷奇）常被称为“通往阿拉斯加的门户”（Gateway to Alaska），因为交通便利、人口集中，很多旅行和物流都会经过这里。"]}
{"word":"anchorage","summary":{"en":"Anchorage most commonly refers to Alaska’s largest city, and it can also mean a safe place to anchor a ship or, figuratively, a source of stability.","zh":"Anchorage 最常指阿拉斯加州最大城市“安克雷奇”，也可指船只的停泊地/停泊状态，并可引申为“稳定的依靠”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in southern Alaska, the largest city in the state","zh":"美国阿拉斯加州南部的一座城市（该州最大城市）"},"examples":[{"en":"Anchorage is a common gateway for trips to Alaska’s national parks.","zh":"安克雷奇常被当作前往阿拉斯加国家公园旅行的门户城市。"},{"en":"She moved to Anchorage for work and stayed for the outdoor lifestyle.","zh":"她因工作搬到安克雷奇，后来爱上户外生活而留下。"}]},{"partOfSpeech":"n.","definition":{"en":"a place where a ship can safely anchor; the act or position of being anchored","zh":"（船只的）停泊地；（船只）抛锚停泊的状态或位置"},"examples":[{"en":"The bay provided good anchorage during the storm.","zh":"暴风雨期间，这个海湾提供了良好的停泊地。"},{"en":"They searched the chart for a safe anchorage for the night.","zh":"他们在海图上寻找适合过夜的安全停泊点。"}]},{"partOfSpeech":"n.","definition":{"en":"something that provides stability, security, or a firm base (often used figuratively)","zh":"（比喻）支撑点；依靠；稳定的基础"},"examples":[{"en":"Her family became her anchorage during a difficult year.","zh":"在艰难的一年里，家人成了她的依靠。"},{"en":"A clear routine can be an anchorage when life feels uncertain.","zh":"当生活充满不确定时，清晰的作息可以成为一种稳定的支撑。"}]}],"synonyms":["harbor","haven","mooring","refuge","safe haven"],"phonetic":"/ˈæŋkərɪdʒ/","extraExplanation":["“Anchorage（安克雷奇）”作为城市名与“anchor（锚）”同源，字面意思与“停泊处”有关：早期这里是船只停靠的好地点。","在英语里，anchorage 常见于航海语境（安全停泊处），也可以引申为“心理上的依靠/稳定点”，语气比“support（支持）”更带“稳住、把你固定住”的画面感。"]}
{"word":"anchorages","summary":{"en":"“Anchorages” is the plural of “anchorage”: safe places where ships can anchor, or (technically) secure attachment/support points.","zh":"“anchorages”是“anchorage”的复数：指船只可抛锚停泊的锚地；也可指（技术上）锚固/系固等固定支撑点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"places in a bay or harbor where ships can safely drop anchor (anchor) and stay in position","zh":"（海湾或港口内）船只可以安全抛锚停泊的水域；锚地"},"examples":[{"en":"The captain looked for a sheltered anchorage before nightfall.","zh":"船长在天黑前寻找一个避风的锚地。"},{"en":"These islands offer several good anchorages during the summer.","zh":"这些岛屿在夏季提供好几个不错的停泊锚地。"}]},{"partOfSpeech":"n.","definition":{"en":"the support or secure holding that an anchor point provides; a point of attachment (often in technical fields)","zh":"（常用于技术领域）固定/支撑作用；锚固点；系固点"},"examples":[{"en":"Engineers tested the anchorages that hold the bridge cables in place.","zh":"工程师测试了用于固定桥梁缆索的锚固装置。"},{"en":"In orthodontics, strong anchorage helps move teeth safely.","zh":"在正畸中，良好的支抗有助于安全地移动牙齿。"}]}],"synonyms":["harbors","moorings","roadsteads","anchor points","anchor holds"],"phonetic":"/ˈæŋkərɪdʒ/","extraExplanation":["“Anchorage”也可以是美国阿拉斯加州最大城市“Anchorage（安克雷奇）”的专名；但“anchorages”通常指普通名词复数“多个锚地/多个锚固点”，并非城市名复数。","词源上与“anchor（锚）”同源；在航海语境里最常见，技术语境里常指桥梁缆索等结构的“锚固/系固”部位。"]}
{"word":"anchorate","summary":{"en":"An old, rare word meaning a religious hermit (anchorite) who withdraws from society for prayer and devotion.","zh":"较古老且少见的词，指为祈祷与灵修而离群索居的宗教隐修士（anchorite）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a religious hermit (especially in early Christianity) who lives alone and withdraws from society for prayer and spiritual devotion; an anchorite.","zh":"（尤指早期基督教的）隐修士、隐士：为祈祷与灵修而离群索居、与世隔绝的人；同 anchorite。"},"examples":[{"en":"In the Middle Ages, an anchorate might live in a small cell beside a church and spend most of the day in prayer.","zh":"在中世纪，隐修士可能住在教堂旁的小房间里，一天大部分时间都用来祈祷。"},{"en":"The novel describes a woman who becomes an anchorate, choosing silence and solitude over public life.","zh":"这部小说描写一位女子成为隐修士，选择沉默与独处，而不是公共生活。"}]}],"synonyms":["anchorite","anchoret","hermit","recluse"],"phonetic":"/ˈæŋkəˌreɪt/","extraExplanation":["“anchorate”是比较少见的拼写变体，常见形式是“anchorite/anchoret”。词源来自希腊语 anachōrētēs，意为“退隐的人”。","在欧洲中世纪，一些隐修士会被“封居”在教堂附近的房间（cell）里，与外界几乎隔绝，通过小窗接受食物或与神职人员交流；历史上常被提到的例子包括诺里奇的朱利安（Julian of Norwich）。","现代英语里这个词带有明显的宗教与历史色彩；日常表达“隐居者/独来独往的人”更常用 hermit 或 recluse。"]}
{"word":"anchored","summary":{"en":"“Anchored” usually means firmly fixed or made stable (literally or emotionally); it’s also the past form of “anchor,” meaning to secure or to host as a news anchor.","zh":"“anchored”常指（字面或比喻）被牢牢固定、变得稳定；也可作“anchor”的过去式/过去分词，表示固定/使稳定，或（新闻）担任主播/主持。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Fixed firmly in place; stable and not likely to move or change.","zh":"牢牢固定的；稳定的，不易移动或改变的。"},"examples":[{"en":"The boat stayed anchored in the harbor during the storm.","zh":"暴风雨期间，那艘船一直稳稳地停泊在港湾里。"},{"en":"She felt anchored by her close friends when she moved to a new city.","zh":"她搬到新城市后，亲密的朋友让她感到很踏实、很有依靠。"}]},{"partOfSpeech":"adj.","definition":{"en":"Fastened or secured with an anchor (or something that acts like one).","zh":"用锚（或起到锚作用的东西）系牢/固定的。"},"examples":[{"en":"The tent was anchored to the ground with stakes and ropes.","zh":"帐篷用地钉和绳子固定在地面上。"},{"en":"The floating platform is anchored by heavy chains.","zh":"漂浮平台用粗重的铁链固定住。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense or past participle of “anchor”: to secure (something) firmly in place; to provide a stable base.","zh":"“anchor”的过去式/过去分词：把……固定住；使……有稳定的基础。"},"examples":[{"en":"They anchored the sign to the wall so it wouldn’t fall.","zh":"他们把标牌固定在墙上，这样就不会掉下来。"},{"en":"The news program is anchored by a veteran journalist.","zh":"这档新闻节目由一位资深记者担任主播/主持。"}]}],"synonyms":["secured","fastened","moored","stable","grounded"],"phonetic":"/ˈæŋkɚd/","extraExplanation":["“anchored”既可以描述“物理上的固定”（船下锚、帐篷固定、结构加固），也常用于比喻义，表示“心理上有依靠、被某种价值/关系支撑”。例如：anchored in reality（脚踏实地）、anchored by family（被家庭支撑）。","在新闻语境里，anchor 还可作名词/动词，指“新闻主播/主持人”。因此 be anchored by… 常表示“由……担任主导/核心支撑”。"]}
{"word":"anchorer","summary":{"en":"“Anchorer” is an uncommon word meaning someone or something that anchors; most English speakers simply use “anchor.”","zh":"“anchorer”是不常用词，意思是“锚定者/起固定稳定作用的人或物”；多数情况下英语更常直接用“anchor”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon) A person or thing that anchors; someone/something that provides stability or holds something in place.","zh":"（不常用）锚定者；起“固定、稳定”作用的人或事物。"},"examples":[{"en":"In practice, people usually say “anchor,” not “anchorer.”","zh":"在实际用法中，人们通常说“anchor”，而不是“anchorer”。"},{"en":"A trusted friend can be an anchorer during a difficult time, but “anchor” sounds more natural.","zh":"一个值得信赖的朋友在困难时期可以成为你的“稳定支撑”，但用“anchor”更自然。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, technical/industry use) A worker/operator who anchors or secures equipment or structures.","zh":"（较少见，技术/行业用法）负责锚固、固定设备或结构的工人/操作人员。"},"examples":[{"en":"The anchorer checked the bolts before the heavy lift.","zh":"锚固人员在重物吊装前检查了螺栓。"}]}],"synonyms":["anchor","stabilizer","support","mainstay"],"phonetic":"/ˈæŋkɚɚ/","extraExplanation":["“anchorer”在现代英语里非常少见，很多时候是由“anchor（锚；支柱；主持人）”加上“-er”类比造出来的形式，但标准、自然的表达通常直接用“anchor”。","如果你想表达“新闻主播/主持人”，请用“news anchor”。如果你想表达“起稳定作用的人/事”，也更常用“anchor”。"]}
{"word":"anchoress","summary":{"en":"An anchoress is a woman who lives in religious seclusion, often in a small cell attached to a church.","zh":"anchoress 指“隐修女”，即为宗教修行而与世隔绝生活的女性，常居于教堂旁的小室中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A woman who chooses to live a very religious life in seclusion, often in a small room (an anchorhold) attached to a church, spending her time in prayer and meditation.","zh":"（尤指中世纪）隐修女；选择与世隔绝、通常住在教堂旁小室中，以祈祷与默想为生活重心的女性。"},"examples":[{"en":"In the Middle Ages, an anchoress might live in a tiny room beside a church and speak to visitors only through a small window.","zh":"在中世纪，隐修女可能住在教堂旁的一间小屋里，只通过一扇小窗与来访者交谈。"},{"en":"The novel portrays an anchoress who becomes a spiritual guide to her town despite living in solitude.","zh":"这部小说描写了一位隐修女：尽管独居与世隔绝，却成了小镇的精神导师。"}]}],"synonyms":["female anchorite","recluse","hermit (general)"],"phonetic":"/ˈæŋkəɹəs/","extraExplanation":["“anchoress”是“anchorite”（隐修士/隐修者）的女性形式；两者都指基督教传统中自愿退隐、专注灵修的人。","历史上，隐修女常居住在“anchorhold”（隐修室）里，有的会举行象征性仪式，表示与世俗生活告别；这属于特定时代与宗教文化背景下的修行方式。","文学中常提到的例子是14世纪英格兰的Julian of Norwich（诺里奇的朱利安），她常被称为anchoress，其灵修著作在英语世界影响深远。"]}
{"word":"anchoresses","summary":{"en":"“Anchoresses” are women (historically, often in the Middle Ages) who lived shut away from society for religious devotion and prayer.","zh":"“Anchoresses”指（多见于中世纪欧洲的）隐修女：为宗教虔修与祈祷而长期与世隔绝生活的女性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman who lives a very secluded religious life, usually alone, devoted to prayer (often shut away in a small room attached to a church); plural of “anchoress”","zh":"（anchoress 的复数）隐修女；通常指中世纪时期为祈祷而长期独居、与世隔绝的女性修行者（常被“封闭”在教堂旁的小室里）"},"examples":[{"en":"In medieval England, some anchoresses lived for years in a small cell beside a church.","zh":"在中世纪的英格兰，一些隐修女会在教堂旁的小室里生活多年。"},{"en":"The novel describes villagers bringing food to the anchoresses through a small window.","zh":"小说描写村民通过一扇小窗给隐修女送食物。"}]}],"synonyms":["recluses","hermits","anchorites"],"phonetic":"/ˈæŋkərəs/","extraExplanation":["“anchoress”来自希腊语词根，意为“退隐/撤离”。在欧洲中世纪，隐修女通常在宗教仪式后被象征性地“封闭”在隐修室中，把一生献给祈祷与灵修；对应的男性形式是“anchorite”。这个词多用于历史、宗教研究或文学描写，带有强烈的时代与文化背景。"]}
{"word":"anchoret","summary":{"en":"An “anchoret” is a religious hermit who lives in solitude for prayer.","zh":"“anchoret”指隐居修行、以祈祷为主的宗教隐士。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a religious hermit who withdraws from society to live a life of prayer and solitude (especially in early Christianity and medieval Europe)","zh":"（尤指早期基督教与中世纪欧洲的）隐修士；离群索居、专注祈祷的宗教隐士"},"examples":[{"en":"In the story, an anchoret lives in a small cell beside the church.","zh":"在故事里，一位隐修士住在教堂旁的一间小小隐修室里。"},{"en":"People visited the anchoret to ask for spiritual advice.","zh":"人们会拜访隐修士，寻求灵性方面的建议。"},{"en":"The novel uses the anchoret as a symbol of solitude and devotion.","zh":"小说把这位隐修士当作“孤独与虔诚”的象征。"}]}],"synonyms":["hermit","recluse","ascetic","anchorite"],"phonetic":"/ˈæŋkəˌrɛt/","extraExplanation":["“anchoret”较为文学/历史用语，常见于宗教史与中世纪题材作品；更日常的对应词是“hermit”（隐士）。","词源来自希腊语，含“退隐、撤离”之意，强调主动远离世俗生活以追求灵修。女性形式常见为“anchoress”（女隐修者）。"]}
{"word":"anchoretic","summary":{"en":"Anchoretic means connected to a religious hermit or a life of strict solitude and devotion.","zh":"anchoretic 指与宗教隐修士有关，或指严格独居、专注修行的隐修生活。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an anchorite (a religious hermit), or to a life of strict solitude and devotion.","zh":"与隐修士（宗教隐士）有关的；或指严格离群独居、专注宗教修行的生活方式。"},"examples":[{"en":"After years in the city, he chose an anchoretic life of prayer and silence.","zh":"在城市生活多年后，他选择了隐修式的生活，祈祷并保持沉默。"},{"en":"The novel describes an anchoretic monk living alone in the mountains.","zh":"这部小说描写了一位隐修僧侣独自住在山中。"}]}],"synonyms":["eremitic","hermitic","reclusive","ascetic"],"phonetic":"/ˌæŋkəˈrɛtɪk/","extraExplanation":["anchoretic 来自 anchorite（隐修士），而 anchorite 源于希腊语 anachōrētēs，意为“退隐的人”。在中世纪基督教传统中，anchorite/anchoret 往往指自愿长期独居、专注祷告与苦修的人。","在文学或学术写作中，anchoretic 常带有“宗教性的退隐”色彩；如果只是一般意义的“隐居”，更常用 reclusive 或 solitary。"]}
{"word":"anchoretical","summary":{"en":"Anchoretical means “hermit-like” or “related to an anchorite,” often implying religious or spiritual seclusion.","zh":"Anchoretical 指“隐士/隐修士式的”或“与隐修士有关的”，常带有宗教或精神层面的清修与隐居意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Related to an anchorite; hermit-like; living in seclusion for religious or spiritual reasons.","zh":"（罕见）与隐修士有关的；隐士式的；为宗教或精神原因而离群独居的。"},"examples":[{"en":"After the scandal, he chose an anchoretical life far from the city.","zh":"丑闻之后，他选择了远离城市的隐修式生活。"},{"en":"The book describes an anchoretical community devoted to prayer and silence.","zh":"这本书描写了一个致力于祈祷与静默的隐修团体。"},{"en":"Her weekends were almost anchoretical—no phone, no visitors, just reading.","zh":"她的周末几乎是隐修式的——不接电话、不见访客，只读书。"}]}],"synonyms":["hermit-like","reclusive","ascetic","monastic"],"phonetic":"/ˌæŋkəˈrɛtɪkəl/","extraExplanation":["“anchoretical”来自“anchorite”（隐修士、隐士），常见于宗教或文学语境。现代英语里更常用的同义表达有“hermit-like / reclusive / ascetic”。","注意它通常带有“出于信仰、修行、清修而退隐”的意味；如果只是一般“不爱社交”，用“reclusive”更自然。"]}
{"word":"anchoretish","summary":{"en":"“anchorite-ish” means somewhat like an anchorite—solitary, simple, and avoiding social life.","zh":"“anchorite-ish”表示“有点像隐士的”——孤独、简朴、回避社交。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Informal) Like an anchorite: living very simply and alone, avoiding society.","zh":"（非正式）像隐士一样的：生活极其简朴、独居，刻意回避社交。"},"examples":[{"en":"After the scandal, he lived an anchorite-ish life in a small cabin and rarely spoke to anyone.","zh":"丑闻之后，他在一间小木屋里过着近似隐士的生活，几乎不和任何人说话。"},{"en":"During exam week, my routine becomes a bit anchorite-ish: study, sleep, repeat.","zh":"考试周我会变得有点“隐士式”：学习、睡觉、重复。"}]}],"synonyms":["solitary","reclusive","hermit-like","ascetic"],"phonetic":"/ˈæŋkəˌraɪt ɪʃ/","extraExplanation":["“anchorite”原指基督教传统中的“隐修者/隐士”（常长期独居、祈祷、克己）。后缀“-ish”表示“有点……的、带点……风格的”，所以“anchorite-ish”常带轻松或夸张语气，用来形容像隐士一样不社交、很宅或极简。","拼写提示：你写的“anchoretish”更常见的写法是“anchorite-ish”（也可见“anchoritic / anchoretic”，更偏正式）。"]}
{"word":"anchoretism","summary":{"en":"Anchoretism is the religious practice of living as an anchoret (anchorite)—a life of deliberate solitude devoted to prayer.","zh":"Anchoretism 指隐修者的宗教生活方式：刻意离群索居，以祈祷与灵修为中心。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a way of life in which someone lives as an anchoret (anchorite)—a religious hermit who withdraws from society for prayer and contemplation, often in a small cell or secluded dwelling","zh":"隐修生活；隐士修行（指“隐修者/隐士”远离社会、以祈祷与默想为中心的宗教生活方式，常住在小室或隐居处）"},"examples":[{"en":"In the Middle Ages, some believers chose anchoretism as a path to deep prayer and solitude.","zh":"在中世纪，一些信徒选择隐修生活，把它当作深入祈祷与独处的道路。"},{"en":"Her research compares monastic community life with anchoretism and other forms of solitude.","zh":"她的研究把修道院的团体生活与隐修生活以及其他独居形式作比较。"}]}],"synonyms":["anchoritism","eremitism","hermit life","religious seclusion"],"phonetic":"/ˈæŋkəˌrɛtɪzəm/","extraExplanation":["“anchoretism”较少见，更常见的拼写是“anchoritism”（同义）。两者都来自“anchoret/anchorite（隐修者）”。","在基督宗教传统中，隐修者常被视为一种极端的奉献方式：主动离开世俗生活，把时间投入祈祷、禁欲与灵修。早期例子常被追溯到埃及等地的“沙漠教父（Desert Fathers）”传统。","历史上有些隐修者会被安置在教堂旁的“隐修室（anchorhold）”，与外界联系极少，但并不等于“讨厌人”，更多强调专注于信仰与内在生活。"]}
{"word":"anchorets","summary":{"en":"“Anchoret” means a religious hermit who lives in seclusion, often in Christian history; it’s a less common form of “anchorite.”","zh":"“anchoret”指宗教隐修者/隐士（多见于基督宗教历史语境），是较不常见的“anchorite”写法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a religious person (especially in early Christianity) who lives alone in seclusion, usually for prayer and spiritual discipline; a hermit","zh":"（尤指早期基督宗教中的）隐修者；隐士（常独居、与世隔绝，以祈祷与修行生活）"},"examples":[{"en":"In the Middle Ages, some anchorets lived in small cells attached to a church.","zh":"在中世纪，一些隐修者住在附属于教堂的小屋（或小室）里。"},{"en":"The novel describes an anchoret who chooses silence to focus on prayer.","zh":"小说描写了一位隐修者选择沉默，以专注于祈祷。"}]}],"synonyms":["anchorite","hermit","recluse"],"phonetic":"/ˈæŋkəˌrɛt/","extraExplanation":["“anchoret”常被视为较少见的拼写/形式，更常见的是“anchorite”。两者意思相同，多用于宗教、历史或文学语境。","词源来自希腊语，含“退隐、撤离”之意，因此带有“主动远离社会、专注灵修”的文化背景。","在英文历史语境里，anchoret/anchorite不同于一般“hermit（隐士）”：它更强调宗教誓愿与制度化的隐修传统（例如靠近教堂生活、接受教会认可）。"]}
{"word":"anchorhold","summary":{"en":"“Anchorhold” is a nautical noun meaning a good place for an anchor to grip, or the secure grip itself.","zh":"“anchorhold”是航海用名词，指适合锚抓牢的锚地，或锚本身牢牢抓住海底的抓力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nautical) A place or area of seabed where an anchor can grip securely; a good anchoring spot.","zh":"（航海）锚能牢牢抓住海底的地方；良好的抛锚点/锚地。"},"examples":[{"en":"This bay has a reliable anchorhold, so boats often spend the night here.","zh":"这个海湾的锚地很可靠，所以船只常在这里过夜。"},{"en":"The captain searched for anchorhold away from rocks and strong currents.","zh":"船长寻找远离礁石和急流的合适锚地。"}]},{"partOfSpeech":"n.","definition":{"en":"A secure hold or grip provided by an anchor (the anchor’s “bite” in the seabed).","zh":"锚对海底的牢固抓力（锚“咬住”海底的效果）。"},"examples":[{"en":"The wind rose, but the anchorhold stayed firm.","zh":"风变大了，但锚的抓力仍然很牢。"},{"en":"In soft mud, you may need extra chain to improve anchorhold.","zh":"在软泥底，你可能需要放出更多锚链来增强抓力。"}]}],"synonyms":["anchorage","holding ground","anchoring spot","good holding"],"phonetic":"ˈæŋkərˌhoʊld","extraExplanation":["这是一个偏航海/专业语境的词，日常英语里更常用 anchorage（锚地）或 holding ground（抓底良好的海底）。","在航海文化里，判断 anchorhold/holding ground 很重要：沙底、泥底通常较好；海草、岩石底可能打滑，容易走锚。"]}
{"word":"anchoring","summary":{"en":"Anchoring most commonly means securing something firmly, and it can also mean hosting a news program or creating a sense of stability (literally or emotionally).","zh":"Anchoring最常指“牢固固定”，也可指“新闻主持”，或指（字面/心理上的）“带来稳定感、让人稳住”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of securing something firmly in place (often with an anchor or a strong support)","zh":"（用锚或支撑物）把某物牢牢固定住的行为或过程"},"examples":[{"en":"Anchoring the boat close to the shore is not safe when the wind is strong.","zh":"大风时把船锚在近岸并不安全。"},{"en":"The engineers focused on anchoring the bridge cables to solid rock.","zh":"工程师重点研究把桥梁缆索牢牢固定在坚固岩层上。"}]},{"partOfSpeech":"n.","definition":{"en":"the job or role of presenting a TV or radio news program (as the main host)","zh":"（电视/广播）新闻节目主持（担任主主播报）"},"examples":[{"en":"She is anchoring the evening news this week.","zh":"这周她在主持晚间新闻。"},{"en":"Anchoring live coverage requires calm and clear communication.","zh":"主持直播报道需要冷静且清晰的表达。"}]},{"partOfSpeech":"n.","definition":{"en":"in psychology and everyday speech: using a person, place, memory, or routine to create a feeling of stability or confidence","zh":"（心理学/日常用法）用某个人、地点、记忆或习惯来获得稳定感或自信"},"examples":[{"en":"Deep breathing is a simple method for anchoring yourself during stress.","zh":"深呼吸是在压力中让自己“稳住”的简单方法。"},{"en":"Family traditions can be anchoring during times of change.","zh":"在变化时期，家庭传统能带来稳定感。"}]},{"partOfSpeech":"v.","definition":{"en":"the action of fixing something in place or giving it a firm base (present participle of “anchor”)","zh":"固定；使稳固（“anchor”的现在分词）"},"examples":[{"en":"They are anchoring the tent with heavy rocks.","zh":"他们用大石头把帐篷固定住。"},{"en":"The scientist kept anchoring her argument in evidence.","zh":"那位科学家不断用证据来支撑她的论点。"}]}],"synonyms":["mooring","fastening","securing","stabilizing","hosting"],"phonetic":"/ˈæŋkərɪŋ/","extraExplanation":["“Anchoring”既可以指字面上的“抛锚/固定”，也常见于抽象表达：例如把观点“anchored in evidence”（以证据为基础）。在心理学里，“anchoring”还可指一种认知偏差：人们会被最先看到的数字或信息“锚定”，之后的判断容易受它影响（如先报高价会影响你对合理价格的感觉）。"]}
{"word":"anchorite","summary":{"en":"An anchorite is a religious hermit—someone who lives in solitude to devote themselves to prayer or spiritual life.","zh":"anchorite 指宗教性的隐居苦修者（隐士），以独居与祈祷/灵修为生活核心。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who lives alone and avoids society for religious reasons; a religious hermit.","zh":"（因宗教原因）隐居避世的人；苦修隐士。"},"examples":[{"en":"In the novel, the anchorite lives in a small cell beside the church and spends most of the day praying.","zh":"在小说里，这位隐士住在教堂旁的一间小小的隐修室里，一天大部分时间都在祈祷。"},{"en":"People traveled far to ask the anchorite for advice and blessings.","zh":"人们远道而来，向这位隐士请教并求祝福。"}]}],"synonyms":["hermit","recluse","ascetic"],"phonetic":"/ˈæŋkəˌraɪt/","extraExplanation":["“Anchorite”常与中世纪基督教文化相关：一些隐士会住在教堂旁的“anchorhold”（隐修室）里，象征与世隔绝、专注灵修。","词源来自希腊语 *anachōrētēs*，意为“退隐的人”。在文学与历史写作中常用来营造“出世、清苦、神秘或智慧”的人物形象。","相关词：*hermit*（更常用、语气更中性）; *recluse*（不一定出于宗教原因）; *ascetic*（强调苦行与自律，不一定独居）。"]}
{"word":"anchorites","summary":{"en":"Anchorites are religious hermits (especially medieval) who lived apart for prayer; the word can also describe someone who lives like a hermit.","zh":"Anchorites 指（尤指中世纪的）宗教隐修士、遁世修行者；也可比喻过着隐士般生活的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A religious hermit (often in medieval Christianity) who lived apart from society for prayer, usually in a small room or cell; plural: anchorites.","zh":"（尤指中世纪基督教的）隐修士、遁世修行者；通常为祈祷而与世隔绝住在小房间或修道小室中；anchorites 为其复数。"},"examples":[{"en":"In the Middle Ages, some anchorites lived in tiny rooms beside a church.","zh":"在中世纪，有些隐修士住在教堂旁边的狭小房间里。"},{"en":"The book describes anchorites who chose silence and prayer over public life.","zh":"这本书描写了那些选择沉默与祈祷、而非世俗生活的隐修士。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) Someone who lives very privately and avoids social contact, like a hermit.","zh":"（比喻）像隐士一样独居、刻意避开社交的人。"},"examples":[{"en":"After the scandal, he became an anchorite and rarely left home.","zh":"丑闻之后，他几乎成了“隐修士”，很少出门。"},{"en":"She’s an anchorite when she’s writing—no calls, no visitors.","zh":"她写作时简直像隐修士——不接电话、不见客。"}]}],"synonyms":["hermits","recluses","ascetics","solitaries"],"phonetic":"/ˈæŋkəˌraɪt/","extraExplanation":["“anchorite”常与“hermit（隐士）”相近，但在历史语境里更带有宗教制度色彩：很多隐修士会住在称为“anchorhold”的小室里，有时甚至被象征性地“封闭”在其中，终身以祈祷与禁欲生活为主。","词源来自希腊语 *anachōrētēs*，意为“退隐者、离开尘世的人”。","文学与历史作品中常用来呈现中世纪宗教生活、苦修传统，以及“与世隔绝换取精神专注”的主题。"]}
{"word":"anchoritess","summary":{"en":"“Anchorites” means religious hermits who live in seclusion for spiritual devotion.","zh":"“anchorites” 指为灵修而隐居的宗教隐士（隐修者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of anchorite: a religious person who lives alone, away from society, for prayer and spiritual practice (a hermit, especially in early Christianity).","zh":"anchorite 的复数：隐修者；离群索居、专注祈祷与灵修的宗教隐士（尤指早期基督教传统中的隐修士）。"},"examples":[{"en":"In the Middle Ages, some anchorites lived in small cells beside a church.","zh":"在中世纪，一些隐修者住在教堂旁的小房间（隐修室）里。"},{"en":"The story describes anchorites who gave up ordinary life to seek spiritual peace.","zh":"这个故事描写了隐修者放弃世俗生活以寻求心灵安宁。"}]}],"synonyms":["hermits","recluses","ascetics"],"phonetic":"/ˈæŋkəˌraɪt/","extraExplanation":["你输入的 **anchoritess** 很可能是拼写错误；常见形式是 **anchorites**（复数），单数是 **anchorite**。","词源上与希腊语 *anachōrētēs*（意为“退隐的人”）有关，常见于描述早期基督教与中世纪欧洲的隐修传统。","语境提示：现代英语中更常用更通用的词是 **hermit**；**anchorite** 带有更明确的宗教/历史色彩。"]}
{"word":"anchoritic","summary":{"en":"Anchoritic describes something related to an anchorite or a life of strict solitude, often for spiritual purposes; it can also mean very reclusive.","zh":"anchoritic 指与隐修者或严格独处（常为灵修目的）的生活有关；也可泛指非常避世、孤僻。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an anchorite (a person who lives alone for religious reasons), or to a life of strict seclusion and spiritual devotion.","zh":"与“隐修者”（为宗教原因独居修行的人）有关的；指严格隐居、专注灵修的生活方式。"},"examples":[{"en":"She wrote a novel about an anchoritic monk living in a stone cell.","zh":"她写了一部小说，讲一位过着隐修生活、住在石室里的修士。"},{"en":"The diary records his anchoritic years of prayer and silence.","zh":"日记记录了他那段隐修的岁月：祈祷与沉默。"}]},{"partOfSpeech":"adj.","definition":{"en":"Very solitary; hermit-like; avoiding society (not necessarily religious).","zh":"非常孤僻的；像隐士一样避世的（不一定带宗教含义）。"},"examples":[{"en":"After the scandal, he became anchoritic and rarely left home.","zh":"丑闻之后，他变得极度避世，几乎不出门。"},{"en":"Her anchoritic routine helped her focus on her art.","zh":"她近乎隐居的作息让她更专注于创作。"}]}],"synonyms":["hermit-like","reclusive","ascetic","monastic","solitary"],"phonetic":"/ˌæŋkəˈrɪtɪk/","extraExplanation":["“anchoritic”来自“anchorite”（隐修者）。早期基督教传统中，隐修者常住在与世隔绝的“cell”（小房间/修行室）里，通过祈祷、禁欲与沉默追求灵性成长。文学作品里常用来营造一种肃穆、克制、与世隔绝的氛围。","易混词：\"anachronistic\"（时代错误的）拼写相近但含义完全不同。"]}
{"word":"anchoritical","summary":{"en":"“Anchoritical” means related to a religious hermit or a life of spiritual solitude.","zh":"“anchoritical”表示与宗教隐士或隐修式的独居生活有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an anchorite (a religious hermit) or to a life of religious solitude.","zh":"与“隐修士”（宗教隐士）有关的；指宗教式独居、隐修生活的。"},"examples":[{"en":"He was drawn to an anchoritical life, choosing prayer and solitude over city life.","zh":"他向往隐修式生活，选择祈祷与独处，而不是都市生活。"},{"en":"The old chapel became a place of anchoritical retreat.","zh":"那座古老的小教堂成了隐修式的静修之地。"}]}],"synonyms":["anchoritic","anchoretic","eremitic","hermitic"],"phonetic":"/ˌæŋkəˈrɪtɪkəl/","extraExplanation":["“anchoritical”较少见，常见的同义/替代形式是“anchoritic”或“anchoretic”，意思都与“anchorite（隐修士）”相关。","在中世纪基督教传统中，anchorite/anchoret往往选择长期独居、禁欲与祈祷；因此这个词常用于宗教史、文学或描述极端清静、远离社会的生活方式。"]}
{"word":"anchoritically","summary":{"en":"“Anchoritically” means ‘like an anchorite’: in religious seclusion or extreme solitude.","zh":"“anchoritically”表示“像隐修士一样”：以宗教式隐居或极度独处的方式。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In the manner of an anchorite; living in religious seclusion or extreme solitude.","zh":"以隐修士的方式；（尤指宗教意义上）隐居、离群索居地生活。"},"examples":[{"en":"After the scandal, he lived anchoritically in a small cabin far from town.","zh":"丑闻之后，他像隐修士一样住在远离城镇的小木屋里。"},{"en":"The monk chose to pray anchoritically, speaking to visitors only rarely.","zh":"那位僧侣选择隐修式地祈祷，很少与来访者交谈。"}]}],"synonyms":["solitarily","reclusively","in seclusion","hermitically"],"phonetic":"/ˌæŋkəˈrɪtɪkli/","extraExplanation":["“anchoritically”来自名词“anchorite”（隐修士）。在英语里更常见的形式是“anachoretically /ˌænə.kəˈrɛtɪkli/”（同义：以隐修方式），而“anchoritically”较罕见，多见于学术或宗教语境。","“anchorite”指基督教传统中离群独居、专注祈祷与修行的人（隐士/隐修士）；用来形容生活方式时，带有“刻意与世隔绝、禁欲或专注精神生活”的色彩，不只是一般的“独处”。"]}
{"word":"anchoritish","summary":{"en":"Anchoritic means “like a religious hermit; living in seclusion.”","zh":"Anchoritic 意为“像宗教隐修者一样；隐居、与世隔绝的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended: anchoritic) like an anchorite; living in religious seclusion like a hermit.","zh":"（多半是指：anchoritic）像隐修士一样的；过宗教式隐居生活的。"},"examples":[{"en":"After the scandal, he lived an anchoritic life, avoiding crowds and the media.","zh":"丑闻之后，他过着近乎隐修的生活，避开人群和媒体。"},{"en":"The monk’s anchoritic routine focused on prayer, silence, and simple work.","zh":"这位僧侣的隐修作息以祈祷、沉默和简单劳动为中心。"}]}],"synonyms":["hermit-like","reclusive","ascetic","monastic"],"phonetic":"/ˌæŋkəˈrɪtɪk/","extraExplanation":["“anchoritish”不是常见标准拼写，通常写作 **anchoritic**（形容词）或 **anchorite**（名词：隐修士）。有时也会用带连字符的口语式写法 **anchorite-ish**，表示“有点像隐修士那样”。","词源上与希腊语中表示“退隐、隐居”的词有关。在英语文化语境里，它常指基督教传统中的隐修生活（如隐居祈祷、与世隔绝），也可引申为“极度独处、与社交保持距离”的生活方式，并不一定字面上“宗教”。"]}
{"word":"anchoritism","summary":{"en":"Anchoritism means living as an anchorite—withdrawn from society for religious devotion, usually in solitude.","zh":"anchoritism 指隐修者的生活方式：为宗教虔修而远离社会、通常独居的遁世生活。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The practice or way of life of an anchorite (a person who withdraws from society for religious devotion, often living in solitude).","zh":"隐修生活；隐士（尤指宗教）遁世修行的生活方式。"},"examples":[{"en":"Medieval records describe women who chose anchoritism to devote their lives to prayer.","zh":"中世纪的记载描述了一些女性选择隐修生活，把一生奉献给祈祷。"},{"en":"Anchoritism was seen as an extreme form of religious commitment.","zh":"隐修生活被视为一种极端的宗教奉献形式。"}]}],"synonyms":["eremitism","hermitism","religious seclusion","ascetic life"],"phonetic":"/ˈæŋ.kəˌraɪ.tɪ.zəm/","extraExplanation":["“anchoritism”来自“anchorite（隐修者）”。在中世纪的欧洲，隐修者有时会住在教堂旁的小房间里，生活与外界隔离，但仍可能通过窗户接受食物或提供宗教劝导。","它与“monasticism（修道院制度）”不同：monasticism通常是群体共同生活的修道方式；anchoritism强调个人、长期的独居隐修。","文学与历史写作中常会提到14世纪的《Ancrene Wisse》（《隐修女指南》），这是给隐修女性的宗教生活指导文本，能帮助理解“anchoritism”的文化背景。"]}
{"word":"anchorless","summary":{"en":"Anchorless means “without an anchor” (literal) or “without stability or direction” (figurative).","zh":"anchorless 指“没有锚的”（字面），也可比喻“缺乏稳定与方向、没有依靠的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without an anchor; not attached or secured by an anchor (often used for boats or ships).","zh":"没有锚的；未用锚固定的（常指船只）。"},"examples":[{"en":"The small boat drifted slowly, anchorless in the bay.","zh":"小船在海湾里慢慢漂流，没有下锚固定。"},{"en":"An anchorless ship can be pushed off course by wind and waves.","zh":"未下锚的船容易被风浪推离航线。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Lacking stability, direction, or a sense of security; not firmly connected to a place, plan, or relationship.","zh":"（比喻）缺乏稳定感或方向感的；没有依靠的；不扎根的。"},"examples":[{"en":"After changing jobs three times in a year, he felt anchorless.","zh":"一年里换了三次工作后，他感到很不踏实、没有依靠。"},{"en":"Without close friends nearby, she sometimes lived an anchorless life.","zh":"身边没有亲近的朋友时，她有时过得很漂泊。"},{"en":"The story’s hero begins as an anchorless traveler, searching for purpose.","zh":"故事的主人公一开始是个漂泊的旅人，在寻找人生目标。"}]}],"synonyms":["unanchored","adrift","unstable","rootless","unmoored"],"phonetic":"/ˈæŋkɚləs/","extraExplanation":["“anchorless”由“anchor（锚/依靠）+ -less（没有……的）”构成，字面意思是“没有锚的”。英语里常用航海意象来表达心理状态：anchor（锚）也可指“让人稳定下来的事物”（如家庭、信念、长期计划）。因此 anchorless 很常见于写作中，形容“漂泊、无所依、缺少方向”。"]}
{"word":"anchorlike","summary":{"en":"Anchorlike means “like an anchor,” either in shape or in the way it provides stability and support.","zh":"anchorlike 的意思是“像锚一样”，可指外形像锚，也可比喻带来稳定与支撑的作用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling an anchor in shape or function; providing stability, support, or a feeling of being firmly held in place.","zh":"像锚一样的；（在形状或作用上）起到稳定、支撑或“把人牢牢固定住”的作用。"},"examples":[{"en":"The anchorlike base keeps the lamp steady on the table.","zh":"这个像锚一样的底座让台灯在桌上很稳。"},{"en":"Her anchorlike presence calmed the whole team during the crisis.","zh":"危机时她那种“像锚一样”的存在感让整个团队都安定下来。"},{"en":"The building has an anchorlike steel frame designed to resist strong winds.","zh":"这栋建筑有像锚一样稳固的钢结构，用来抵抗强风。"}]}],"synonyms":["anchored","stabilizing","supportive","anchor-shaped"],"phonetic":"/ˈæŋkɚˌlaɪk/","extraExplanation":["“anchorlike”由 anchor（锚）+ -like（像……一样）构成，常用于两种语境：①字面描述形状/结构像锚；②比喻某人或某物像“锚”一样带来稳定与安全感。","在写作中，这类 -like 形容词（如 childlike, lifelike）比较生动、偏描写性；正式技术文档中也可能出现来形容“锚固式/起锚作用的”结构。"]}
{"word":"anchorman","summary":{"en":"An anchorman is the main presenter who leads a news or sports broadcast.","zh":"anchorman 指在新闻或体育节目中负责带领整档节目的主要主播/主持人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A main news presenter on radio or TV who introduces stories and other reporters.","zh":"（广播或电视的）新闻主播；（新闻节目的）主持人"},"examples":[{"en":"The anchorman introduced the top story and then sent the report to a journalist on the scene.","zh":"新闻主播先介绍了头条新闻，然后把报道交给现场记者。"},{"en":"She became the evening news anchorman after years of reporting.","zh":"她做了多年记者后，成为晚间新闻主播。"}]},{"partOfSpeech":"n.","definition":{"en":"In sports broadcasting, the lead commentator who guides the whole program.","zh":"（体育转播中）主讲解说；主持解说的人"},"examples":[{"en":"The anchorman kept the discussion moving during the football match.","zh":"这位主讲解说在足球比赛期间让讨论保持顺畅。"}]}],"synonyms":["news anchor","anchor","presenter","newscaster"],"phonetic":"/ˈæŋkərˌmæn/","extraExplanation":["“Anchorman”字面是“锚的人”：anchor（锚）+ man（人）。引申义是“稳住全场、带领节目的人”。现代英语中也常用更中性的说法“anchor”或“news anchor”。","在美国文化中，“anchorman”常让人联想到传统晚间新闻的权威主持形象；电影《Anchorman: The Legend of Ron Burgundy》也让这个词带有一点喜剧、夸张的流行文化色彩。"]}
{"word":"anchormen","summary":{"en":"“Anchormen” is the plural of “anchorman,” most commonly meaning male news anchors; it can also mean key men who stabilize or lead a group.","zh":"anchormen 是 anchorman 的复数，最常指男性新闻主播；也可指在团队中起稳定或领导作用的关键男性成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of anchorman: male news presenters who introduce stories and guide a TV or radio news program.","zh":"anchorman 的复数：男新闻主播/主持人，在电视或广播新闻节目中介绍新闻并串联节目内容。"},"examples":[{"en":"The anchormen led the election-night coverage for three hours.","zh":"这些男主播主持了长达三小时的选举之夜报道。"},{"en":"Two anchormen and a reporter discussed the breaking news live.","zh":"两位男主播和一名记者现场讨论突发新闻。"}]},{"partOfSpeech":"n.","definition":{"en":"More generally, key men who hold an important leading or stabilizing role in a team or organization (less common than the media meaning).","zh":"（更广义）在团队或组织中起核心领导或“稳定支柱”作用的关键人物（不如新闻含义常见）。"},"examples":[{"en":"They were the anchormen of the campaign, keeping the team focused.","zh":"他们是竞选团队的核心人物，让团队保持专注。"},{"en":"In the early years, a few anchormen kept the project moving forward.","zh":"在早期阶段，少数关键人物推动项目持续前进。"}]}],"synonyms":["news anchors","anchors","anchorpeople","presenters","hosts"],"phonetic":"/ˈæŋkərˌmæn/","extraExplanation":["“anchorman”源自“anchor（船锚）”的比喻：像锚一样让节目/团队“稳住”。在新闻语境里，anchor 指主持人非常常见。","现代英语里因为性别包容性，很多媒体更常用 anchor、news anchor 或 anchorperson；anchormen/anchorman 带有明显的男性指向。"]}
{"word":"anchorpeople","summary":{"en":"“Anchorpeople” means news anchors—the people who host a news program on TV or radio.","zh":"“anchorpeople”指新闻主播/主持人，即在电视或广播新闻节目中负责主持与串联报道的人（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who present and guide a TV or radio news program (news anchors).","zh":"（电视/广播）新闻主播；节目主持人（复数）。"},"examples":[{"en":"The anchorpeople introduced the top stories at the start of the broadcast.","zh":"主播们在节目开始时介绍了头条新闻。"},{"en":"During the election night special, two anchorpeople hosted the live coverage.","zh":"在选举之夜特别节目中，两位主播主持了直播报道。"}]}],"synonyms":["news anchors","anchors","anchorpersons","presenters","newscasters"],"phonetic":"/ˈæŋkɚ ˌpiːpəl/","extraExplanation":["“anchorpeople”通常写作两个词“anchor people”，更常见的单数形式是“anchor”和“anchorperson”（更中性、正式），也有人说“anchorman/anchorwoman”（带性别指向）。在新闻行业语境里，“anchor”本身就很常用：如“the anchor asked a follow-up question（主播追问）”。"]}
{"word":"anchorperson","summary":{"en":"An anchorperson is a main TV/radio news presenter who leads the broadcast.","zh":"anchorperson 指电视/广播新闻的主要主播，负责引导整段新闻节目。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A main news presenter on TV or radio who introduces stories, speaks to reporters, and guides the program.","zh":"（电视或广播的）新闻主播；主持人（负责串联新闻、介绍报道并引导节目）"},"examples":[{"en":"She became the anchorperson for the evening news.","zh":"她成为晚间新闻的主播。"},{"en":"The anchorperson introduced the breaking story and then interviewed a reporter live.","zh":"主播先介绍了突发新闻，然后连线采访记者。"},{"en":"During election night, the anchorperson guided viewers through the results.","zh":"在选举之夜，主播带领观众解读各地结果。"}]}],"synonyms":["news anchor","anchor","newscaster","presenter"],"phonetic":"/ˈæŋkərˌpɝːsən/","extraExplanation":["“anchorperson”常用于强调性别中立；传统说法是“anchorman”，对应女性有“anchorwoman”。现代媒体里更常用“news anchor”或直接用“anchor”。","这个词里的“anchor（锚）”是比喻用法：主播像“锚”一样让整档新闻节目稳定、有中心，串联各个报道与连线。"]}
{"word":"anchors","summary":{"en":"Anchors are things that hold a boat steady, or people/things that provide stability; anchors also means “secures” or “serves as the main support,” including being a news anchor.","zh":"anchors 可指“锚”（固定船只）或比喻“稳定的依靠/支点”；作动词表示“固定、稳住、作为核心支撑”，也可指“担任新闻主播”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of anchor) Heavy objects that hold a ship or boat in place; also people or things that provide stability or support.","zh":"（anchor 的复数）锚：用来固定船只位置的重物；也指能带来稳定与支持的人或事物（比喻义）。"},"examples":[{"en":"The ship dropped its anchors near the harbor.","zh":"船在港口附近抛下锚。"},{"en":"Her family and close friends are her anchors during stressful times.","zh":"在压力大的时候，家人和密友是她的“定心锚”。"}]},{"partOfSpeech":"v.","definition":{"en":"(third-person singular of anchor) To secure or hold something firmly in place; to be the main support or central part of something.","zh":"（anchor 的第三人称单数）使固定；稳住；作为……的核心支撑/主力。"},"examples":[{"en":"He anchors the tent with ropes and stakes.","zh":"他用绳子和地钉把帐篷固定住。"},{"en":"She anchors the evening news on Channel 7.","zh":"她担任 7 频道晚间新闻主播。"},{"en":"A strong opening paragraph anchors the whole essay.","zh":"一个有力的开头段能支撑整篇文章。"}]}],"synonyms":["holdfasts","moorings","supports","foundations","stabilizers","secures","fastens","stabilizes"],"phonetic":"/ˈæŋkərz/","extraExplanation":["“anchor”除了“锚”，在现代英语里很常见的引申义是“稳定的依靠/核心支点”。在新闻语境中，anchor 指“（电视/广播）新闻主播”，相当于节目中的主要主持人。写作里也常用 anchor 表示“用一个关键点把内容‘钉住’、让结构更稳”。"]}
{"word":"Anchorville","summary":{"en":"“Anchorville” is a town name (a proper noun), real or fictional depending on context.","zh":"“Anchorville”是城镇地名（专有名词），可指真实地点或虚构小镇，取决于语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun), usually referring to a town or community called “Anchorville.” It may refer to a real location or be used as a fictional town name in stories.","zh":"地名（专有名词），通常指名为“Anchorville”的城镇或社区；也可能在故事中作为虚构小镇名使用。"},"examples":[{"en":"We drove through Anchorville on our way to the coast.","zh":"我们去海边的路上开车经过了 Anchorville。"},{"en":"The novel is set in Anchorville, a quiet town with a big secret.","zh":"这部小说的背景设在 Anchorville——一个宁静却藏着大秘密的小镇。"}]}],"synonyms":["(place name) town","(place name) village"],"phonetic":"/ˈæŋkərˌvɪl/","extraExplanation":["“Anchorville”由 anchor（锚）+ -ville（城镇）构成；-ville 常见于英语地名，带有“……城/……镇”的感觉（如 Nashville）。这类专有名词通常不翻译或按音译处理，具体以当地官方译名为准。"]}
{"word":"anchorwise","summary":{"en":"Anchorwise means ‘at anchor’ or ‘anchored’ (a rare nautical word).","zh":"Anchorwise 指“抛锚停泊/被锚固定”（较少见的航海用词）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(nautical) With an anchor down; in a position held by an anchor; at anchor.","zh":"（航海用语）抛锚地；用锚固定地；停泊着。"},"examples":[{"en":"The ship lay anchorwise in the bay during the storm.","zh":"暴风雨期间，这艘船在海湾里抛锚停泊。"},{"en":"They waited anchorwise until the fog lifted.","zh":"他们抛锚等待，直到雾散。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) Anchored; held in place like something fixed by an anchor.","zh":"（少见）像被锚固定住一样的；稳稳固定的。"},"examples":[{"en":"With the current so strong, the boat stayed anchorwise near the marker buoy.","zh":"水流很急，但小船仍像被锚固定一样，稳稳地停在标志浮标附近。"}]}],"synonyms":["at anchor","anchored","with the anchor down"],"phonetic":"/ˈæŋkərˌwaɪz/","extraExplanation":["“anchorwise”较少见，常出现在航海/海事语境中。它由“anchor（锚）+ -wise（以……方式/状态）”构成，-wise 常用于构成副词，表示“以……方式”“处于……状态”（如 clockwise）。","如果你在现代英语里想表达同样意思，更常用的说法是：at anchor（在抛锚停泊中）、anchored（已抛锚/固定的）、with the anchor down（锚已下水）。"]}
{"word":"anchorwoman","summary":{"en":"An anchorwoman is a female news anchor who presents news on TV or radio.","zh":"anchorwoman 指电视或广播新闻节目的女主播/女新闻主持人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A female anchor (main presenter) on a television or radio news program.","zh":"（电视或广播新闻节目的）女主播，女新闻主持人。"},"examples":[{"en":"The anchorwoman introduced the top stories of the day at 6 p.m.","zh":"这位女主播在晚上6点介绍了当天的头条新闻。"},{"en":"She became a well-known anchorwoman after covering the election live.","zh":"她在直播报道选举后成为知名女主播。"}]}],"synonyms":["news anchor","anchor","newscaster"],"phonetic":"/ˈæŋkərˌwʊmən/","extraExplanation":["“anchorwoman”是较传统的说法。现代英语新闻行业更常用更中性的“news anchor”或“anchor”，不强调性别；对应也有“anchorman”。在正式写作或职场交流中，用“news anchor”通常更稳妥、更符合当代语感。"]}
{"word":"anchory","summary":{"en":"“anchory” is not a standard word; it is usually a misspelling of “anchovy” (a small salty fish used in cooking).","zh":"“anchory”不是标准词，通常是把“anchovy（凤尾鱼）”拼错了。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common misspelling) Intended word: **anchovy** — a small, salty ocean fish often used as a strong-flavored ingredient in cooking.","zh":"（常见拼写错误）通常想表达的是 **anchovy（凤尾鱼）**——一种体型小、味道咸鲜、常用作调味食材的海鱼。"},"examples":[{"en":"I think you mean **anchovy**—it’s often used on pizza.","zh":"我觉得你想说的是 **anchovy（凤尾鱼）**——它常被用在披萨上。"},{"en":"Anchovies add a strong, salty flavor to pasta sauce.","zh":"凤尾鱼能给意面酱增加很浓的咸鲜味。"}]}],"synonyms":["anchovy","salted fish"],"phonetic":"/ænˈtʃoʊvi/","extraExplanation":["“anchory”不是标准英文单词，最常见是把“anchovy（凤尾鱼）”拼错了。","“anchovy”在西式料理里很常见：披萨配料、凯撒沙拉酱（Caesar dressing）、意大利风味酱汁等。它味道很重，少量就够。"]}
{"word":"anchoveta","summary":{"en":"Anchoveta means a small anchovy, especially the Peruvian anchovy, widely used to make fishmeal and fish oil.","zh":"Anchoveta 指一种小型鳀鱼，尤指秘鲁鳀鱼，常用于生产鱼粉和鱼油。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small anchovy (a type of fish), especially the Peruvian anchovy, often used for fishmeal and fish oil","zh":"（尤指秘鲁鳀鱼等）一种小型鳀科鱼；常用于制作鱼粉和鱼油"},"examples":[{"en":"Peru’s anchoveta fishery is one of the largest in the world.","zh":"秘鲁的鳀鱼（anchoveta）渔业是世界上最大的之一。"},{"en":"Most anchoveta is processed into fishmeal for animal feed.","zh":"大多数鳀鱼会被加工成鱼粉，用作动物饲料。"},{"en":"Anchoveta populations can drop during El Niño years.","zh":"在厄尔尼诺年份，鳀鱼的数量可能会下降。"}]}],"synonyms":["Peruvian anchovy","anchovy"],"phonetic":"/ˌæn.tʃoʊˈveɪ.tə/","extraExplanation":["“Anchoveta”是西班牙语借词，在英语里多用来指秘鲁鳀鱼（Peruvian anchovy，学名 Engraulis ringens）。它是秘鲁和智利沿海冷流生态系统的重要物种，也是全球鱼粉与鱼油产业的关键原料。","和英语里常见的“anchovy（凤尾鱼/鳀鱼）”相比，anchoveta更偏向渔业与经济语境；在餐桌语境中英语更常用“anchovy”。"]}
{"word":"anchovies","summary":{"en":"Anchovies are small salty fish used to add a strong, savory flavor to food.","zh":"Anchovies 指凤尾鱼（小型咸鱼），常用来为食物增加浓郁的咸鲜风味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, salty fish (often sold canned) used as a strong-flavored ingredient, especially on pizza, in salads, or in sauces","zh":"凤尾鱼（小型咸鱼，常见为罐装），常作为味道很重的配料，用于披萨、沙拉或酱汁等"},"examples":[{"en":"Would you like anchovies on your pizza?","zh":"你的披萨要加凤尾鱼吗？"},{"en":"A little anchovy can add a deep, salty taste to pasta sauce.","zh":"加一点凤尾鱼能让意大利面酱更鲜更咸、更有层次。"},{"en":"Caesar dressing often includes anchovies or anchovy paste.","zh":"凯撒沙拉酱常会加入凤尾鱼或凤尾鱼酱。"}]}],"synonyms":["anchovy paste","anchovy fillets"],"phonetic":"/ˈæn.tʃoʊ.viz/","extraExplanation":["“Anchovies”通常用复数，因为在餐饮语境里常指“一些凤尾鱼（片）/一罐凤尾鱼”。单数是“an anchovy”。","凤尾鱼味道很“咸鲜（umami）”，在西餐里常用来“提鲜”，即使加得很少也会明显改变风味。","常见相关说法：anchovy paste（凤尾鱼酱/膏）、anchovy fillets（凤尾鱼片）、salt-cured anchovies（盐渍凤尾鱼）。"]}
{"word":"anchovy","summary":{"en":"An anchovy is a small sea fish, often cured (salted or in oil) and used to add a strong salty flavor to food.","zh":"Anchovy 指凤尾鱼：一种小型海鱼，常被腌制后用作配料，为食物增添浓烈的咸鲜味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small sea fish often used as food, especially salted or kept in oil and used to add a strong, salty flavor","zh":"一种小型海鱼，常作食物；通常用盐腌或浸在油里，用来增添浓烈的咸鲜味"},"examples":[{"en":"I ordered a pizza with anchovies and olives.","zh":"我点了一份加凤尾鱼和橄榄的披萨。"},{"en":"Anchovies add a deep salty flavor to pasta sauce.","zh":"凤尾鱼能让意大利面酱增添更浓的咸鲜味。"}]},{"partOfSpeech":"n.","definition":{"en":"a small, salty piece of this fish used as an ingredient or topping","zh":"（作配料或浇头用的）一小片腌制的凤尾鱼"},"examples":[{"en":"Just one anchovy can change the flavor of the whole dish.","zh":"只要一片凤尾鱼就能改变整道菜的味道。"},{"en":"She chopped an anchovy into the dressing for extra umami.","zh":"她把一片凤尾鱼切碎加进沙拉酱里，让鲜味更足。"}]}],"synonyms":["salted fish","cured fish","anchovies"],"phonetic":"/ˈæn.tʃə.vi/","extraExplanation":["在英语菜单里常见两种写法：**anchovy**（单数）和 **anchovies**（复数）。点披萨配料时通常用复数：*pizza with anchovies*。","凤尾鱼常被用来提供“**umami**（鲜味）”，在西式烹饪中也常出现在凯撒沙拉酱、意大利面酱、以及一些酱料（如伍斯特酱）里。","词源来自西班牙语/意大利语等地中海语言，说明它在地中海饮食文化中很常见。"]}
{"word":"Anchtherium","summary":{"en":"Anchitherium is an extinct genus of early, three-toed horses, commonly referenced in discussions of horse evolution.","zh":"Anchitherium（安奇兽属）是一种已灭绝的早期三趾马类属，常用于讨论马的演化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An extinct genus of small, three-toed horses (equids) that lived mainly in the Miocene epoch; often discussed as an early relative in horse evolution.","zh":"安奇兽属：一种已灭绝的小型三趾马类（马科动物）属，主要生活在中新世；常被用来讨论马的早期演化亲缘关系。"},"examples":[{"en":"Anchitherium is often mentioned in lessons about the evolution of horses.","zh":"在讲解马的演化时，安奇兽属常被提到。"},{"en":"Fossils of Anchitherium show it still had three toes instead of a single hoof.","zh":"安奇兽属的化石显示它仍是三趾，而不是单一的蹄。"}]}],"synonyms":["extinct equid genus"],"phonetic":"/ˌæŋkˈθɪriəm/","extraExplanation":["词源常解释为来自希腊语词根：ankhi-（“近、接近”）+ -therium（“兽”），大意是“近似某种兽/接近某类兽”，用于命名这类早期马科近亲。","它并不是现代马（Equus）的“直接祖先”这一说法在科普中容易被简化；更准确地说，它代表了马科演化树上的一个早期分支或近亲类群，常用于比较形态变化（如牙齿与趾骨）。"]}
{"word":"anchtherium","summary":{"en":"Anchitherium is an extinct early horse genus from the Miocene, important in discussions of horse evolution.","zh":"Anchitherium 是中新世时期已灭绝的早期马类属，常用于讲解马的演化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Anchitherium: an extinct genus of early horses (three-toed), known from the Miocene epoch; often discussed in the evolution of modern horses.","zh":"Anchitherium（安基马属/安基兽属）：一种已灭绝的早期马类属（三趾），生活于中新世时期；常用于解释现代马的演化过程。"},"examples":[{"en":"Fossils of Anchitherium help scientists understand how horses evolved over millions of years.","zh":"Anchitherium 的化石帮助科学家了解马在数百万年间是如何演化的。"},{"en":"In museum exhibits, Anchitherium is sometimes shown as a small, forest-dwelling ancestor of later horses.","zh":"在博物馆展览中，Anchitherium 有时被展示为生活在森林里的小型早期马类。"}]}],"synonyms":["early horse","extinct horse genus"],"phonetic":"/ˌæŋkɪˈθɪriəm/","extraExplanation":["你输入的拼写“anchtherium”更常见的标准拼写是 **Anchitherium**（中间通常有一个 i）。","这是一个古生物学/演化生物学中的专名（属名），一般首字母大写并用斜体书写：*Anchitherium*。"]}
{"word":"Anchusa","summary":{"en":"Anchusa is a group of alkanet plants, often grown for their blue-purple flowers; some were used for dye.","zh":"Anchusa 指牛舌草属植物，常因蓝紫色花而栽培；部分种类传统上可用于染色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants (alkanets) in the borage family, known for rough hairy leaves and small blue or purple flowers; some species were traditionally used to make red dye from their roots.","zh":"牛舌草属（Anchusa）：紫草科的一类开花植物，叶片粗糙有毛，常开蓝色或紫色小花；部分种类的根传统上可用来制作红色染料。"},"examples":[{"en":"Anchusa often has bright blue flowers that attract bees.","zh":"Anchusa 常开鲜蓝色的花，很能吸引蜜蜂。"},{"en":"The garden border included Anchusa for its long-lasting summer color.","zh":"花园的花境里种了 Anchusa，因为它在夏季能长时间保持颜色。"}]}],"synonyms":["alkanet","borage (family member)"],"phonetic":"/æŋˈkjuːzə/","extraExplanation":["词源提示：Anchusa 来自希腊语，和“涂抹、上色”有关，呼应其部分物种根部可作染料的传统用途。","常见相关词：alkanet（常指可染色的“紫草/牛舌草”类植物；在日常园艺语境里，有时也用来泛称 Anchusa 的某些种）。"]}
{"word":"anchusa","summary":{"en":"Anchusa is a plant genus (alkanet) known for blue flowers; some species’ roots can be used for red dye.","zh":"Anchusa 指紫草属（alkanet），以蓝色花常见；部分种类的根可用于制红色染料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants in the borage family, often called “alkanet,” with small blue (sometimes purple) flowers; some species have roots used to make a red dye.","zh":"紫草属（紫草科）的开花植物属，常被称为“红根草/紫草（alkanet）”，多开蓝色（有时紫色）小花；部分种类的根可用来制红色染料。"},"examples":[{"en":"Anchusa plants produce clusters of bright blue flowers in late spring.","zh":"紫草属植物在晚春会开成簇的亮蓝色花。"},{"en":"In some traditions, the root of certain Anchusa species was used to color oils and ointments.","zh":"在一些传统做法中，某些紫草属植物的根被用来给油和药膏上色。"}]}],"synonyms":["alkanet","bugloss"],"phonetic":"/æŋˈkjuːzə/","extraExplanation":["“Anchusa”是拉丁学名（属名），日常英语里更常看到俗名“alkanet”。园艺和植物学语境中使用较多。","在草药与染料相关的历史中，紫草类植物常被用作天然着色来源；不过不同物种用途与安全性可能不同，不能随意食用或外用。"]}
{"word":"anchusas","summary":{"en":"“Anchusas” means plants of the genus Anchusa (bugloss), usually noted for rough leaves and bright blue flowers.","zh":"“Anchusas”指紫草属（Anchusa，bugloss）植物的复数，常以粗糙多毛的叶片和亮蓝色花著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flowering plant of the genus Anchusa (bugloss), known for rough, hairy leaves and small blue, purple, or pink flowers; often grown as an ornamental or found wild in parts of Europe and the Mediterranean.","zh":"紫草属（Anchusa）的开花植物（又称“牛舌草/bugloss”一类），叶片粗糙多毛，常开蓝色、紫色或粉色小花；可作观赏植物，也在欧洲及地中海部分地区野生分布。"},"examples":[{"en":"The garden border was bright with anchusas in early summer.","zh":"初夏时，花坛边缘因一丛丛紫草属植物（anchusas）而格外鲜亮。"},{"en":"Bees often visit anchusas for their nectar.","zh":"蜜蜂常会来采紫草属植物（anchusas）的花蜜。"}]}],"synonyms":["bugloss","Anchusa (singular)"],"phonetic":"/ænˈkjuːsəz/","extraExplanation":["“anchusas”是“anchusa”的复数形式。英文里也常用普通名“bugloss”来指这一类植物。","词源来自拉丁语与希腊语，传统上与“用于化妆/涂抹的颜料、粉”有关联；有些相关植物（如紫草科中的某些种）历史上确实被用作染料或药用，但具体用途会因物种与地区而异。"]}
{"word":"anchusin","summary":{"en":"“anchusin” is not a standard English word; it’s probably a misspelling or a proper noun.","zh":"“anchusin”不是标准英语单词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name/term from another language. If you meant a similar English word, common possibilities include “anchor,” “anchoring,” or “anxious.”","zh":"不是标准英语单词。很可能是拼写错误，或来自其他语言的人名/术语。若你想表达相近的英文，常见可能是“anchor（锚/固定）”、“anchoring（锚定/固定）”或“anxious（焦虑的）”。"},"examples":[{"en":"I can’t find “anchusin” in an English dictionary—could you check the spelling?","zh":"我在英文词典里找不到“anchusin”，你可以确认一下拼写吗？"},{"en":"Did you mean “anchoring,” like “anchoring the boat”?","zh":"你是不是想说“anchoring”，比如“把船抛锚固定”？},{"}]}],"phonetic":"/ˈæŋkjuːzɪn/","extraExplanation":["英语里遇到查不到的词，最常见原因是：1）拼写错误；2）专有名词（人名、地名、品牌）；3）其他语言的外来词/音译。","如果你告诉我它出现的句子/上下文（例如一整句或前后各5个词），我可以更准确判断你想表达的英文是什么，并给出正确词汇与用法。"]}
{"word":"anchusine","summary":{"en":"Anchusine is a rare word for a red dye/pigment made from alkanet (Anchusa) plants, historically used in ointments and oils.","zh":"Anchusine 是个很少见的词，指由牛舌草属（alkanet/Anchusa）植物制得的红色染料或色素，过去常用于药膏和油类上色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a red dye or coloring pigment obtained from alkanet (plants in the genus Anchusa), historically used to color oils, ointments, and sometimes textiles.","zh":"（源自牛舌草属 Anchusa，尤指“紫草/红根草”alkanet 的）红色染料或色素；历史上常用于给油、药膏，有时也用于织物上色。"},"examples":[{"en":"Historically, anchusine was used to tint ointments and cosmetic preparations a warm red.","zh":"历史上，anchusine 常被用来给药膏和化妆制剂染成温暖的红色。"},{"en":"The apothecary kept plant-based dyes like anchusine alongside herbs and oils.","zh":"这位药剂师把像 anchusine 这样的植物染料和草药、油品放在一起保存。"}]}],"synonyms":["alkanet dye","anchusin"],"phonetic":"/ˈæŋkjəˌsaɪn/","extraExplanation":["“anchusine”在现代英语里非常罕见，更多时候会看到拼写变体 **anchusin/anchusine**，意思都指与 **Anchusa（牛舌草属）**有关的红色染料/色素。","这种染料常与“古老药房、草药学、传统配方”语境相连，因此在历史题材写作或古方描述中更可能出现。","相关词：**alkanet**（常见名，紫草/红根草，提供红色染料），**apothecary**（旧时药剂师/药房）。"]}
{"word":"anchusins","summary":{"en":"“Anchusins” isn’t a standard English word; it’s probably a misspelling or a proper name.","zh":"“anchusins”不是标准英语单词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling or a name. If you meant a similar common word, see suggestions below.","zh":"不是标准英语单词；更可能是拼写错误或专有名词（如名字/姓氏）。如果你想表达的是相近的常见词，请看下面的建议。"},"examples":[{"en":"I couldn’t find “anchusins” in an English dictionary—did you mean “anchovies” or “cousins”?","zh":"我在英语词典里找不到“anchusins”——你是想写“anchovies（凤尾鱼）”还是“cousins（堂/表兄弟姐妹）”吗？"}]}],"phonetic":"ˈæŋkjuːzɪnz","extraExplanation":["“anchusins”在常见英语词典中通常查不到。最常见的可能是拼写误差：\n1）anchovies（凤尾鱼，常见于披萨/沙拉/意大利料理）；\n2）cousins（堂/表兄弟姐妹）。\n如果你告诉我它出现的句子或语境（菜单？聊天？书名？），我可以更准确判断。"]}
{"word":"anchylose","summary":{"en":"“Anchylose” is usually a misspelling of “ankylose,” meaning to become (or make) a joint stiff, often by fusion; the common noun is “ankylosis.”","zh":"anchylose 通常是 ankylose 的误拼，意思是（使）关节变得僵硬、强直（常伴骨性融合）；常见名词是 ankylosis（关节强直）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Medical) to make a joint stiff and immovable, usually because the bones fuse together after injury, inflammation, or disease; to become stiff in this way.","zh":"（医学）使关节僵硬并失去活动度（常因骨性融合）；（关节）变得僵硬、强直。"},"examples":[{"en":"Severe arthritis can ankylose the knee over time.","zh":"严重的关节炎可能会随着时间推移导致膝关节强直。"},{"en":"After the infection, the joint gradually ankylosed and lost movement.","zh":"感染之后，这个关节逐渐强直，活动度下降。"}]},{"partOfSpeech":"v.","definition":{"en":"(Less common) to stick together or become fused into one mass.","zh":"（较少见）黏在一起；融合成一体。"},"examples":[{"en":"The scar tissue can cause nearby structures to ankylose.","zh":"瘢痕组织可能使附近结构发生黏连融合。"}]}],"synonyms":["stiffen","fuse","immobilize","become rigid"],"phonetic":"ˌæŋkɪˈloʊz","extraExplanation":["你输入的 **anchylose** 通常是 **ankylose** 的误拼或少见拼法。更常见的名词形式是 **ankylosis（关节强直）**，指“关节因炎症/损伤等导致僵硬甚至骨性融合”的状态。临床与学术写作中更常用 *ankylosis*，动词用 *ankylose*。","词根来自希腊语 *ankylos*（意为“弯曲的、僵硬的”），因此这个词在医学语境中和“关节活动受限/僵硬”紧密相关。"]}
{"word":"anchylosed","summary":{"en":"Anchylosed means a joint has become abnormally stiff or fused (a less common spelling of ankylosed).","zh":"anchylosed 指关节因“强直”而异常僵硬或融合（是较少见的 ankylosed 拼写）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medical) Having become stiff, immobile, or fused—especially a joint—because of abnormal bone growth or scar tissue (ankylosis).","zh":"（医学）因强直（骨质增生或瘢痕组织等）而变得僵硬、不能活动，或出现关节融合的。"},"examples":[{"en":"After the injury, his knee gradually became ankylosed, limiting his movement.","zh":"受伤后，他的膝关节逐渐发生强直，活动受限。"},{"en":"The X-ray showed an ankylosed joint with little space left between the bones.","zh":"X光显示关节已强直，骨与骨之间的间隙几乎消失。"}]}],"synonyms":["ankylosed","stiffened","fused","immobile"],"phonetic":"/ˈæŋkəˌloʊzd/","extraExplanation":["“anchylosed”是“ankylosed”的较少见拼写变体；现代医学写作中更常用“ankylosed/ankylosis”。","词源来自希腊语“ankylos”（弯曲的、僵硬的），因此核心含义围绕“关节僵硬/融合”。"]}
{"word":"anchylosing","summary":{"en":"Ankylosing means becoming stiff and fixed, especially of joints (often used in medical contexts).","zh":"Ankylosing 指（尤指关节）逐渐变得僵硬、固定的，多用于医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) causing a joint or part of the body to become stiff and fixed, often because the bones fuse together.","zh":"（医学）使关节或身体某部分变得僵硬、固定的，常因骨头融合而致。"},"examples":[{"en":"Ankylosing spondylitis can cause chronic back pain and stiffness.","zh":"强直性脊柱炎可能导致长期背痛和僵硬。"},{"en":"The doctor explained that the inflammation was ankylosing the joint over time.","zh":"医生解释说，炎症会随着时间推移使关节逐渐强直。"}]}],"synonyms":["stiffening","rigid","immobilizing"],"phonetic":"/ˈæŋkəˌloʊzɪŋ/","extraExplanation":["你输入的 **anchylosing** 常见于拼写误差；标准拼写通常是 **ankylosing**（常见于短语 *ankylosing spondylitis* “强直性脊柱炎”）。","词根提示：*ankyl-* 来自希腊语，和“弯曲/僵硬的关节”有关；在医学语境里多指“强直、关节僵硬并可能融合”。","在日常英语中这个词很少单独使用，更常见于具体病名或医学描述中。"]}
{"word":"anchylosis","summary":{"en":"Anchylosis is a medical term for joint stiffness and loss of motion (a less common spelling of ankylosis).","zh":"Anchylosis 指关节强直、活动受限（为 ankylosis 的较少见拼写）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine) abnormal stiffness and loss of movement in a joint, often because the bones become fused or the tissues around the joint become rigid.","zh":"（医学）关节强直；关节活动受限或丧失，常因骨性融合或关节周围组织变硬所致。"},"examples":[{"en":"After years of untreated inflammation, the patient developed ankylosis (anchylosis) in the hip joint.","zh":"多年未治疗的炎症之后，患者髋关节出现了强直（ankylosis/anchylosis）。"},{"en":"The doctor explained that anchylosis can limit daily activities like walking or bending.","zh":"医生解释说，关节强直会限制走路、弯腰等日常活动。"}]}],"synonyms":["ankylosis","joint stiffness","joint fusion"],"phonetic":"/ˌæŋkəˈloʊsɪs/","extraExplanation":["“anchylosis”是“ankylosis”的较少见拼写形式，现代医学写作中更常用“ankylosis”。两者意义相同。","词源来自希腊语，意为“弯曲、变硬”；在临床语境中常与慢性炎症、风湿性疾病或外伤后关节结构改变有关。"]}
{"word":"anchylotic","summary":{"en":"Anchylotic means related to or causing joint stiffness/fusion (ankylosis); it’s a less common spelling of ankylotic.","zh":"Anchylotic 指“与关节强直有关或导致关节变僵硬/融合的”，是 ankylotic 的较少见拼写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to ankylosis (abnormal stiffness or fusion of a joint), or causing a joint to become stiff.","zh":"与关节强直（关节异常僵硬或融合）有关的；或导致关节变僵硬的。"},"examples":[{"en":"The X-ray showed anchylotic changes in the patient’s spine.","zh":"X光显示患者脊柱出现了关节强直相关的改变。"},{"en":"The doctor explained that an anchylotic joint may have limited range of motion.","zh":"医生解释说，发生关节强直的关节活动范围可能会受限。"}]}],"synonyms":["ankylotic","stiffening","rigid"],"phonetic":"/ˌæŋkəˈlɑtɪk/","extraExplanation":["“anchylotic”是“ankylotic”的较旧/较少见拼写，医学写作中更常用“ankylotic”。两者意义相同。","词根来自希腊语，含义与“弯曲、僵硬、粘连/融合”相关，因此常用于描述关节或脊柱变得僵硬、活动受限的情况（如强直性脊柱炎相关描述中可能出现）。"]}
{"word":"ancial","summary":{"en":"“ancial” is mainly a suffix used to form adjectives meaning “related to,” as in financial; it’s rarely used alone.","zh":"“ancial”主要是一个后缀，用于构成表示“与……相关”的形容词（如 financial）；几乎不单独使用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A suffix (not usually used as a standalone word) that forms adjectives meaning “related to” or “connected with.” Commonly seen in words like financial.","zh":"一个后缀（通常不能单独作为词使用），用来构成形容词，表示“与……有关的 / 与……相关的”。常见于如 financial 等词。"},"examples":[{"en":"financial (finance + -ancial): related to money or finance","zh":"financial（finance + -ancial）：与金钱或金融有关的"},{"en":"They offered financial support for the project.","zh":"他们为这个项目提供了经济支持。"},{"en":"Good financial planning can reduce stress.","zh":"良好的财务规划可以减轻压力。"}]}],"phonetic":"/ˈænʃəl/","extraExplanation":["“ancial”通常是黏着语素（bound morpheme），也就是只能附着在词根/词干上，自己单独出现时不算常见的英语单词。","在拼写上它常出现在以 -ancial 结尾的形容词中（如 financial）。发音往往并不是单独读“an + cial”，而是作为整个词的一部分连读。","如果你原本想查的是 financial / official / essential 等具体单词，也可以告诉我，我可以按那个词给出更标准的释义、搭配和例句。"]}
{"word":"ancien","summary":{"en":"“ancien” means “former/old,” and in English it’s most often seen in “ancien régime,” referring to pre-1789 France’s old system.","zh":"“ancien”意为“以前的/古老的”；在英语中最常见于“ancien régime（旧制度）”，指1789年法国大革命前的旧体制。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare in modern English) Former; old; belonging to an earlier time.","zh":"（现代英语中较少用）以前的；古老的；属于较早时期的。"},"examples":[{"en":"The museum displayed maps from an ancien era of exploration.","zh":"博物馆展出了来自一个较早探索时代的地图。"},{"en":"She studied ancien laws to understand how society used to work.","zh":"她研究旧时的法律，以了解社会过去如何运作。"}]},{"partOfSpeech":"phrase","definition":{"en":"Used especially in the phrase “ancien régime”: the old political and social system in France before the French Revolution (1789).","zh":"多用于短语“ancien régime（旧制度）”：指1789年法国大革命前法国的旧政治与社会体制。"},"examples":[{"en":"The novel is set in the final years of the ancien régime.","zh":"这部小说以旧制度的最后几年为背景。"},{"en":"Historians debate what weakened the ancien régime.","zh":"历史学家争论是什么削弱了旧制度。"}]}],"synonyms":["former","old","earlier","bygone","the ancien régime"],"phonetic":"/ɑnˈsjɛn/","extraExplanation":["“ancien”来自法语，意思是“古老的、以前的”。在英语里单独用较少见，更常见的是固定搭配“ancien régime”。","读法上，英语里通常保留法语味道：重音在后面，听起来接近“ahn-SYEN”。","相关常见搭配：the ancien régime（旧制度）、ancien era/ancien laws（较早时期/旧法，较少见，更常用 old/earlier/former 来替代）。"]}
{"word":"ancience","summary":{"en":"“Ancience” is not standard modern English; it’s usually a misspelling of “ancient” (very old; from long ago).","zh":"“ancience”不是现代英语的标准拼写，通常是把“ancient”（古老的；很久以前的）拼错了。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Likely a misspelling of “ancient”: very old; from a long time ago.","zh":"多半是“ancient”的拼写错误：古老的；很久以前的。"},"examples":[{"en":"We visited an ancient temple that was built over a thousand years ago.","zh":"我们参观了一座建于一千多年前的古老寺庙。"},{"en":"Ancient stories often explain how people understood the world long ago.","zh":"古代故事常常解释人们在很久以前如何理解世界。"}]},{"partOfSpeech":"n.","definition":{"en":"“The ancients”: people who lived in ancient times (especially Greeks and Romans).","zh":"“the ancients”：古人（尤指古希腊、古罗马人）。"},"examples":[{"en":"Many philosophers study what the ancients wrote about ethics.","zh":"许多哲学家研究古人关于伦理的著作。"},{"en":"Artists still borrow ideas from the ancients.","zh":"艺术家至今仍会借鉴古人的思想。"}]}],"synonyms":["old","age-old","antique","historical","of long ago"],"phonetic":"/ˈeɪnʃənt/","extraExplanation":["“ancience”在现代英语里几乎不用作标准拼写；你可能想写的是“ancient”。如果你是在某段古书/诗歌里见到“ancience”，它可能是旧式拼写或排印错误，现代写法通常用“ancience/anciency”极少见，常见表达是“antiquity（古代/古老）”或“ancientness（古老程度）”。"]}
{"word":"anciency","summary":{"en":"Anciency is an archaic noun meaning “ancientness” (great age) or sometimes “seniority” (priority by age/service).","zh":"Anciency 是一个古用名词，表示“古老/年代久远”，有时也指“资历/按资历的先后”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) the state of being ancient; great age or antiquity.","zh":"（古用）古老；年代久远；古代性。"},"examples":[{"en":"The ruins speak of the anciency of the city.","zh":"这些遗迹诉说着这座城市的古老历史。"},{"en":"Writers praised the anciency of the traditions to give them authority.","zh":"作家们赞美传统的“古老”，以增强它们的权威性。"}]},{"partOfSpeech":"n.","definition":{"en":"(Archaic) seniority; priority based on having existed or served longer.","zh":"（古用）资历；年长或先到者所享有的优先次序。"},"examples":[{"en":"They debated anciency in rank before the ceremony began.","zh":"典礼开始前，他们就名次的资历先后起了争论。"},{"en":"In old records, anciency could decide who spoke first.","zh":"在旧档案里，资历先后有时决定谁先发言。"}]}],"synonyms":["antiquity","ancientness","seniority"],"phonetic":"/ˈeɪnʃənsi/","extraExplanation":["“anciency”多见于较早的英语文本，是“ancientness”（古老、年代久远）或“seniority”（资历）的古拼写/罕见形式。现代英语里更常用“antiquity / ancientness / seniority”。","注意不要和“agency”（机构/代理）混淆；拼写相近但意义完全不同。"]}
{"word":"anciennete","summary":{"en":"Ancienneté means seniority or length of service, often used in French or formal workplace contexts.","zh":"Ancienneté 指“工龄/资历（任职年限）”，常见于法语或较正式的职场语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in French or formal HR contexts) seniority; the length of time someone has worked in a job or belonged to an organization, often affecting pay, rank, or benefits.","zh":"（尤用于法语或较正式的人事语境）工龄；资历；在某岗位或组织中工作的年限，常影响薪资、职级或福利。"},"examples":[{"en":"Your ancienneté in the company may affect your vacation days.","zh":"你在公司的工龄可能会影响你的年假天数。"},{"en":"They promoted her partly because of her ancienneté.","zh":"他们部分因为她的资历而提拔了她。"},{"en":"In union agreements, ancienneté can determine who gets laid off first.","zh":"在工会协议中，工龄可能决定谁先被裁员。"}]}],"synonyms":["seniority","length of service","tenure"],"phonetic":"/ˌɑnsiˌɛnəˈteɪ/","extraExplanation":["“ancienneté”是法语词（常写作 ancienneté；你输入的是不带重音符号的 anciennete），由“ancien”（古老的/年长的/资深的）衍生而来。英语里更常用的对应词是“seniority”或“length of service”，但在讨论法国或法语国家的劳动制度、工会合同、或法语原文材料时，英语文本也可能直接借用这个词。"]}
{"word":"anciens","summary":{"en":"“Anciens” is a French plural used in English mainly to mean ex-members/alumni or “the ancients” in historical/literary contexts.","zh":"“Anciens”是法语复数，英语中多用于指“前成员/校友”，或在历史与文学语境中指“古人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(French plural) former people; ex-members; alumni (often used in school or club contexts).","zh":"（法语复数）以前的人；前成员；校友（常用于学校或社团语境）。"},"examples":[{"en":"The association invited its anciens to the annual reunion.","zh":"该协会邀请校友参加一年一度的聚会。"},{"en":"Many anciens returned to mentor current students.","zh":"许多校友回来指导在校学生。"}]},{"partOfSpeech":"n.","definition":{"en":"(French plural, often with “les”) the ancients—people from ancient times; elders (in historical/literary discussion).","zh":"（法语复数，常与 les 连用）“古人/古代人”——指古代的人；长者（用于历史或文学讨论）。"},"examples":[{"en":"In the debate between the Moderns and the Anciens, each side defended a different idea of progress.","zh":"在“现代派与古人”的争论中，双方各自捍卫不同的进步观。"},{"en":"The writer often quoted the Anciens to support his arguments.","zh":"这位作者常引用古人来支持自己的论点。"}]}],"synonyms":["alumni","former members","ex-members","the ancients"],"phonetic":"/ˈɑːn.si.ɛ̃/","extraExplanation":["“anciens”本身不是常见英语单词，而是法语“ancien”的复数。英语文章里通常在讨论法国学校、社团、历史或文学时保留原文（例如指“校友/前成员”，或“古人”这一概念）。","如果你想表达英语里的“古人/古代人”，更常用的对应词是 **ancients**（拼写不同）。"]}
{"word":"Ancient","summary":{"en":"“Ancient” means very old and from long ago in history; it can also refer to people from ancient times (“the ancients”).","zh":"“Ancient”意为“古老的、远古的”；也可指“古人”（常用the ancients）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Very old; from a time long ago (especially in history).","zh":"古老的；远古的；来自很久以前（尤指历史时期）的。"},"examples":[{"en":"They visited an ancient temple in Greece.","zh":"他们参观了希腊的一座古老神庙。"},{"en":"Ancient history can help us understand modern society.","zh":"古代历史能帮助我们理解现代社会。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who lived in ancient times (often used in the plural: “the ancients”).","zh":"古人；古代的人（常用复数：the ancients，指古代先贤/古人）。"},"examples":[{"en":"The ancients believed the stars could influence human life.","zh":"古人相信星星会影响人的生活。"},{"en":"Many ideas of the ancients still shape our thinking today.","zh":"古人的许多思想至今仍影响着我们的思考。"}]}],"synonyms":["very old","age-old","antique","archaic"],"phonetic":"/ˈeɪnʃənt/","extraExplanation":["“ancient”常与具体文明或时代搭配，如 ancient China（古代中国）, ancient Rome（古罗马）, ancient Egypt（古埃及）。","用法对比：old 通常指“年纪大/旧”，不一定有历史感；ancient 强调“历史久远、带有历史/考古气息”。例如 an old building（旧楼） vs. an ancient ruin（古代遗址）。","常见固定说法：the ancient world（古代世界）、ancient times（远古时代）、ancient ruins（古遗址）。"]}
{"word":"ancient","summary":{"en":"Ancient means very old, especially from long-ago history (often the ancient world like Greece, Rome, or Egypt).","zh":"Ancient 表示“古老的、久远的”，尤其指历史上的古代（常见于希腊、罗马、埃及等古代世界）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Very old; from a long time ago in history.","zh":"古老的；来自很久以前的历史时期的。"},"examples":[{"en":"They studied ancient Egypt in class.","zh":"他们在课堂上学习了古埃及。"},{"en":"An ancient temple stands on the hill.","zh":"山上矗立着一座古老的寺庙。"}]},{"partOfSpeech":"adj.","definition":{"en":"Belonging to the early period of a civilization, especially Greece and Rome, or the world before the Middle Ages.","zh":"属于古代文明早期的，尤指古希腊、古罗马，或中世纪之前的时期。"},"examples":[{"en":"Ancient Greek philosophy still influences modern ideas.","zh":"古希腊哲学仍然影响着现代思想。"},{"en":"She reads books about the ancient world.","zh":"她读关于古代世界的书。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) Very old in a humorous or exaggerated way.","zh":"（非正式）很老的；常带夸张或幽默语气。"},"examples":[{"en":"This laptop is ancient—I need a new one.","zh":"这台笔记本电脑太老了——我需要换新的。"}]}],"synonyms":["old","age-old","antique","archaic"],"phonetic":"/ˈeɪnʃənt/","extraExplanation":["“ancient”常与历史与考古相关词搭配：ancient history（古代史）, ancient ruins（古遗址）, ancient civilization（古代文明）。","近义词区别：old强调“年纪/使用时间长”；ancient更强调“非常久远、历史上的古老”。","文学与文化中常见表达：the ancients（古人/古代人，常指希腊罗马时期的人或古代学者）。"]}
{"word":"ancient-alchemical","summary":{"en":"Ancient-alchemical describes things connected to early alchemy or having an old, mysterious “alchemy-like” feel.","zh":"ancient-alchemical 用来形容与早期炼金术相关的事物，或带有古旧神秘、炼金术式氛围的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to early (ancient or medieval) alchemy—the historical mix of philosophy, mysticism, and early chemistry often linked to attempts to turn metals into gold or find a life-extending elixir.","zh":"与早期（古代或中世纪）炼金术有关的——炼金术是一种结合哲学、神秘主义与早期化学的传统，常与“点石成金”或寻找长生灵药联系在一起。"},"examples":[{"en":"The novel’s lab has an ancient-alchemical atmosphere, with strange symbols and smoky glass bottles.","zh":"小说里的实验室有一种古老炼金术的氛围：奇怪的符号、冒烟的玻璃瓶。"},{"en":"She studied ancient-alchemical texts to understand how people explained nature before modern science.","zh":"她研究古代炼金术文本，以了解现代科学出现之前人们如何解释自然。"}]},{"partOfSpeech":"adj.","definition":{"en":"Old-fashioned, mysterious, or “magical-scientific” in style, like something from a legendary alchemist’s workshop.","zh":"（风格或感觉）古旧而神秘、带有“魔法+科学”色彩的，仿佛出自传说中的炼金术士工坊。"},"examples":[{"en":"The movie uses ancient-alchemical imagery to make the transformation scene feel powerful.","zh":"电影用古老炼金术式的意象，让“变形/转化”的场景更有力量。"},{"en":"His drawings look ancient-alchemical—part recipe, part spell.","zh":"他的画看起来像古老炼金术：一半像配方，一半像咒语。"}]}],"synonyms":["alchemical","arcane","esoteric","mystical","occult","old-world"],"phonetic":"/ˈeɪnʃənt ælˈkɛmɪkəl/","extraExplanation":["“ancient-alchemical”通常是作者为营造氛围而临时组合的形容词（creative hyphenation）。连字符把“ancient（古老的）”和“alchemical（炼金术的）”紧密绑定，强调一种特定的历史感与神秘感。","炼金术（alchemy）在欧洲中世纪很常见，也出现在伊斯兰世界与古代中国的相关实践中；在文学里常象征“转化（transformation）”与“追求终极真理/不朽”。","写作中它多用来修饰名词：ancient-alchemical texts/lab/symbols/rituals（古老炼金术的文本/实验室/符号/仪式）。"]}
{"word":"ancient-climate","summary":{"en":"Ancient-climate means the climate of the distant past, or relating to studying it (often called paleoclimate).","zh":"ancient-climate 指远古时期的气候，或与研究古气候有关（常称 paleoclimate）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Earth’s climate in the distant past (for example, thousands to millions of years ago).","zh":"与远古时期（如几千到数百万年前）的地球气候有关的；古气候的。"},"examples":[{"en":"Scientists study ancient-climate records to understand long-term climate change.","zh":"科学家研究远古气候记录，以了解长期气候变化。"},{"en":"Ice cores preserve ancient-climate information in tiny air bubbles.","zh":"冰芯通过微小的气泡保存了远古气候信息。"}]},{"partOfSpeech":"n.","definition":{"en":"A record, pattern, or set of conditions describing Earth’s climate in the distant past; paleoclimate.","zh":"对远古时期地球气候的记录、模式或状况；古气候（亦称 paleoclimate）。"},"examples":[{"en":"The ancient climate of the Sahara was once much wetter than it is today.","zh":"撒哈拉的远古气候曾比今天湿润得多。"},{"en":"Researchers reconstructed the region’s ancient climate using lake sediments.","zh":"研究人员利用湖泊沉积物重建了该地区的远古气候。"}]}],"synonyms":["paleoclimate","prehistoric climate","past climate"],"phonetic":"/ˈeɪnʃənt ˈklaɪmət/","extraExplanation":["“ancient-climate”更像是研究语境里的复合/连字符写法，常见表达是“ancient climate”或更标准的学术词“paleoclimate（古气候）”。如果你在论文或报告中使用，通常写作“ancient climate”更自然。","相关常见搭配：ancient climate record（远古气候记录）、ancient climate reconstruction（古气候重建）、ancient climate proxy（古气候代用指标，如树轮、冰芯、沉积物）。"]}
{"word":"ancient-cosmic","summary":{"en":"“Ancient-cosmic” describes something that feels both extremely ancient and vast like the universe, often used for a mysterious, mythic, sci‑fi atmosphere.","zh":"“ancient-cosmic”形容一种既远古又具宇宙尺度的感觉，常用于营造神秘、神话感或科幻氛围。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Extremely old and vast in scale, as if coming from the deep history of the universe; having a timeless, universe-level feeling.","zh":"极其古老且宏大（如同来自宇宙深处的历史）；带有“跨越时间、宇宙尺度”的氛围。"},"examples":[{"en":"The film’s music creates an ancient-cosmic mood, like a ritual echoing through space.","zh":"这部电影的配乐营造出一种“古老—宇宙级”的氛围，像仪式的回声穿越太空。"},{"en":"She wrote an ancient-cosmic myth about stars, oceans, and forgotten gods.","zh":"她写了一个“古老—宇宙级”的神话，讲星辰、海洋和被遗忘的神祇。"}]},{"partOfSpeech":"adj.","definition":{"en":"Blending images of the distant past with science-fiction or astronomy imagery; combining “ancient” and “cosmic” aesthetics.","zh":"把远古意象与科幻/天文学意象融合；结合“远古感”和“宇宙感”的审美风格。"},"examples":[{"en":"Their album cover uses ancient-cosmic symbols—stone carvings beside galaxies.","zh":"他们的专辑封面用了“远古—宇宙”符号：石刻旁边是星系。"},{"en":"The game’s design is ancient-cosmic, mixing temples with starships.","zh":"这款游戏的设计是“远古—宇宙”混搭：神庙与星舰并置。"}]}],"synonyms":["primordial","mythic","otherworldly","cosmic","eldritch","timeless","vast","astral"],"phonetic":"/ˈeɪnʃənt ˈkɑzmɪk/","extraExplanation":["“ancient-cosmic”不是常见的标准词条，更像创意性的复合形容词（多用于文学、影评、音乐/游戏美术评论）。用连字符把两个形容词绑在一起，强调它们共同塑造的气质。","语感上常带有庄严、神秘、宏大、超越人类时间尺度的感觉，接近“eldritch（诡异古老的）/mythic（神话般的）/primordial（原初的）+ cosmic（宇宙的）”。","写作中可替换为：“ancient and cosmic”“cosmically ancient”“primeval-cosmic”。如果放在名词前作定语（ancient-cosmic horror / ancient-cosmic imagery）会更自然。"]}
{"word":"ancient-crystal","summary":{"en":"“Ancient-crystal” is a nonstandard compound meaning an extremely old crystal (often in fantasy/poetic contexts) or an adjective phrase describing something made of ancient crystal or crystal-clear and ancient in feeling.","zh":"“ancient-crystal”是较非标准的复合写法，常指“远古的水晶”（多见于奇幻/诗意语境），也可作定语表示“由古老水晶制成”或“古老而晶莹”的修辞效果。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not a fixed standard word) a crystal that is very old, especially one from ancient times; often used in fantasy or poetic writing to suggest mystery and history.","zh":"（非固定标准词）“古老的水晶/远古水晶”：指非常古老、来自古代的水晶；常见于奇幻或诗意表达，用来营造神秘与历史感。"},"examples":[{"en":"Archaeologists displayed an ancient crystal found in a desert tomb.","zh":"考古学家展出了一块在沙漠古墓中发现的远古水晶。"},{"en":"In the novel, the hero carries an ancient-crystal amulet that can store memories.","zh":"在小说里，主角佩戴一枚远古水晶护身符，能储存记忆。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used as an attributive modifier (before a noun) meaning “ancient crystal (made of crystal and very old)” or “ancient, crystal-like (clear and shining).”","zh":"作定语（放在名词前）时，可表示“古老的水晶制的”或“古老而晶莹的/如水晶般清澈闪亮的”（偏修辞）。"},"examples":[{"en":"They restored an ancient-crystal goblet for the museum collection.","zh":"他们修复了一只古老的水晶高脚杯，收入博物馆馆藏。"},{"en":"Moonlight fell on the lake, an ancient-crystal glow over the water.","zh":"月光洒在湖面上，水上泛起一种古老而晶莹的光。"}]}],"synonyms":["ancient crystal","ancient crystal artifact","antique crystal","crystal relic"],"phonetic":"/ˈeɪnʃənt ˈkrɪstəl/","extraExplanation":["这个词更像是“自造复合词/风格化写法”，常见于游戏、奇幻设定、品牌命名或诗歌意象；在正式写作中，更自然的表达通常是：ancient crystal（古代的水晶）、an ancient crystal artifact（古老的水晶器物）、crystal from antiquity（来自古代的水晶）。","连字符（ancient-crystal）多用于强调它作为一个整体修饰后面的名词（如 ancient-crystal amulet）。如果只是普通描述，通常不加连字符：an ancient crystal amulet。"]}
{"word":"ancient-cycle","summary":{"en":"“Ancient-cycle” refers to an ancient (old, traditional) repeating cycle or a cycle-like pattern from ancient times, often used in history, myth, or literature.","zh":"“ancient-cycle”指古代/古老传统中的“循环/周期”，常用于历史、神话或文学语境，可作名词或作形容词修饰名词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Hyphenated, often used as an adjective) Related to a cycle (a repeating pattern or period) from ancient times or from an ancient civilization.","zh":"（常用作形容词，带连字符）与“古代的循环/周期”（重复出现的模式或时期）有关；来自古代或古文明的周期性现象。"},"examples":[{"en":"Researchers compared the ancient-cycle myths of death and rebirth across cultures.","zh":"研究人员比较了不同文化中关于死亡与重生的古代循环神话。"},{"en":"The novel is built on an ancient-cycle of seasons: planting, harvest, and winter rest.","zh":"这部小说以古代的季节循环为结构：播种、收获与冬季休养。"}]},{"partOfSpeech":"n.","definition":{"en":"A repeating pattern, period, or series of events believed to have occurred in ancient times (often used in history, mythology, or literature).","zh":"（常用于历史、神话或文学）被认为发生在古代、不断重复的模式、时期或事件序列。"},"examples":[{"en":"In the epic, the hero’s journey follows an ancient cycle of exile and return.","zh":"在史诗中，英雄的旅程遵循一种古老的“流放—归来”循环。"},{"en":"Some historians question whether this ancient cycle is fact or later storytelling.","zh":"一些历史学家质疑这种所谓的古代循环是真实史实还是后人叙事。"}]}],"synonyms":["ancient cycle","mythic cycle","traditional cycle","recurring motif"],"phonetic":"ˈeɪnʃənt ˈsaɪkəl","extraExplanation":["“ancient-cycle”不是一个固定、常见的词典词条，更常见的写法是 **ancient cycle**（不加连字符）。加连字符通常表示把它当作一个整体来修饰名词（作定语），例如：ancient-cycle story / ancient-cycle theory。","在文学与神话研究中，“cycle”常指反复出现的母题或结构（如生死轮回、季节更替、王朝兴衰）。因此“ancient cycle”常带有“古老传统中的循环叙事/观念”的色彩。"]}
{"word":"ancient-disease","summary":{"en":"“Ancient disease” means a disease known since ancient times; figuratively, it can mean a long-lasting problem in society.","zh":"“ancient disease”指自古就存在或已知很久的疾病；也可比喻长期存在、难以根治的社会问题。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a disease that existed in ancient times (or that has been known for a very long time)","zh":"古代的疾病；很久以前就存在的疾病"},"examples":[{"en":"Researchers study ancient diseases by analyzing DNA from old bones and teeth.","zh":"研究人员通过分析古老骨骼和牙齿中的 DNA 来研究古代疾病。"},{"en":"Malaria is often described as an ancient disease because people have suffered from it for thousands of years.","zh":"疟疾常被称为一种古老的疾病，因为人类受其困扰已有数千年。"}]},{"partOfSpeech":"phrase","definition":{"en":"(figurative) an old, persistent social problem that keeps returning","zh":"（比喻）长期存在、反复出现的社会顽疾"},"examples":[{"en":"Corruption is an ancient disease in many societies, and it is hard to cure.","zh":"腐败在许多社会里是一种长期存在的顽疾，很难根治。"},{"en":"Some people call loneliness an ancient disease of the human heart.","zh":"有些人把孤独称为人类心灵的一种古老顽疾。"}]}],"synonyms":["ancient illness","age-old disease","long-standing disease","old scourge","endemic problem"],"phonetic":"/ˈeɪnʃənt dɪˈziːz/","extraExplanation":["“ancient-disease”不是非常固定、常见的标准词条；更自然的写法通常是“ancient disease”（不加连字符），或根据语境用“an ancient disease like malaria/ tuberculosis”。","在学术语境里，它常出现在“paleopathology（古病理学）/ ancient DNA”相关讨论中，指通过遗骸、木乃伊、古文献等研究过去人群的疾病。","比喻用法时，常搭配“a disease of society / a social disease / an old scourge（旧日祸害）”，表达“顽疾、痼疾”的意思。"]}
{"word":"ancient-disease-related","summary":{"en":"“Ancient-disease-related” means connected with diseases from ancient times, or (more loosely) very old/long-standing diseases.","zh":"“Ancient-disease-related”指与古代疾病有关；也可较宽泛地指与非常久远/长期存在的疾病有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with diseases in ancient times (in history or archaeology).","zh":"与古代（历史或考古语境中的）疾病有关的。"},"examples":[{"en":"Researchers analyzed ancient-disease-related DNA from skeletal remains.","zh":"研究人员分析了骨骼遗骸中与古代疾病有关的DNA。"},{"en":"The museum has an exhibit on ancient-disease-related medical tools.","zh":"博物馆有一个关于古代疾病相关医疗工具的展览。"}]},{"partOfSpeech":"adj.","definition":{"en":"connected with very old or long-standing diseases (often in a broad, informal sense).","zh":"与非常久远或长期存在的疾病有关的（常为较宽泛、非正式用法）。"},"examples":[{"en":"He wrote an essay on ancient-disease-related myths and folk cures.","zh":"他写了一篇关于久远疾病相关迷思与民间疗法的文章。"}]}],"synonyms":["related to ancient diseases","ancient medical","historical-disease-related","disease-related (in ancient contexts)"],"phonetic":"/ˈeɪnʃənt dɪˈziːz rɪˌleɪtɪd/","extraExplanation":["这个词组更常见的自然表达是 **ancient disease–related** 或 **ancient disease related**。连字符通常用于把多个词“打包”成一个形容词，放在名词前面：*ancient-disease-related evidence*。放在名词后面时常可不加连字符：*evidence related to ancient diseases*。","在学术写作里，若指“古代的疾病（ancient diseases）”，用 **ancient-disease-related** 更清晰；若想表达“古老的/长期存在的疾病”，也可以用，但更建议改写为 **long-standing disease–related** 以避免歧义。"]}
{"word":"ancient-DNA","summary":{"en":"Ancient DNA is DNA recovered from old remains, or the research that studies such DNA to understand the past.","zh":"古代DNA指从古老遗骸中提取的DNA，或研究这类DNA以了解过去的学科与方法。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"genetic material (DNA) recovered from very old biological remains such as bones, teeth, hair, or preserved tissues, used to study past organisms and human history.","zh":"从非常古老的生物遗骸（如骨骼、牙齿、毛发或保存下来的组织）中提取出来的遗传物质（DNA），用于研究古代生物与人类历史。"},"examples":[{"en":"Researchers analyzed ancient DNA from a 4,000-year-old skeleton to learn about migration patterns.","zh":"研究人员分析了一具4,000年前骨骼的古代DNA，以了解迁徙模式。"},{"en":"Because ancient DNA is often damaged, scientists use special methods to avoid contamination.","zh":"由于古代DNA往往受损，科学家会使用特殊方法来避免污染。"}]},{"partOfSpeech":"phrase","definition":{"en":"the scientific field and techniques focused on extracting and interpreting DNA from ancient remains (often called ancient DNA research).","zh":"从古代遗骸中提取并解读DNA的研究领域与技术（常称为古代DNA研究）。"},"examples":[{"en":"Ancient-DNA studies have reshaped what we know about early farming communities.","zh":"古代DNA研究改变了我们对早期农业社区的认识。"},{"en":"She works in ancient DNA and collaborates with archaeologists and historians.","zh":"她从事古代DNA研究，并与考古学家和历史学家合作。"}]}],"synonyms":["aDNA","ancient genetic material","ancient DNA research","paleogenomics"],"phonetic":"/ˈeɪnʃənt ˌdiː ˌɛn ˈeɪ/","extraExplanation":["“ancient DNA”常写作 aDNA（学术缩写），也有人写作“ancient-DNA”（用连字符，多见于标题或作定语时，如 ancient-DNA analysis）。","古代DNA容易发生降解、断裂，并混入现代DNA污染，因此采样与实验室流程非常严格（如洁净室、空白对照等）。","这一领域的重要成果包括：重建古人群迁徙与混血、鉴定古病原体、研究已灭绝动物与古生态等。"]}
{"word":"ancient-DNA-related","summary":{"en":"“Ancient-DNA-related” describes something connected with research or evidence involving DNA from ancient remains.","zh":"“ancient-DNA-related”表示“与古代遗骸中的DNA及其研究/证据有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with or involving DNA obtained from ancient remains (such as bones, teeth, or preserved tissue), often used in archaeology, paleontology, and human history research","zh":"与从古代遗骸（如骨骼、牙齿或保存下来的组织）中提取的DNA有关的；常用于考古学、古生物学与人类历史研究"},"examples":[{"en":"The team published an ancient-DNA-related study on early farmers in Europe.","zh":"研究团队发表了一项与古代DNA相关的研究，探讨欧洲早期农民。"},{"en":"Ancient-DNA-related evidence suggested that the population mixed with newcomers over time.","zh":"与古代DNA相关的证据表明，这个群体随着时间推移与外来者发生了融合。"}]}],"synonyms":["ancient DNA–related","aDNA-related","ancient DNA–based","ancient-genetic-related"],"phonetic":"/ˈeɪnʃənt ˌdiːˌɛnˈeɪ rɪˈleɪtɪd/","extraExplanation":["这是一个由“ancient + DNA + related”组成的复合形容词，写作时常用连字符（hyphen）把它当作一个整体来修饰后面的名词：ancient-DNA-related research / findings。","学术语境中常见缩写 aDNA（ancient DNA）。你也会看到更常用的表达：ancient DNA research / ancient-DNA evidence / ancient DNA analysis。"]}
{"word":"ancient-Earth","summary":{"en":"“Ancient-Earth” describes the Earth in the very distant past, or (informally) something extremely old.","zh":"“ancient-Earth”指“远古地球/地球久远过去的”，口语中也可夸张表示“老得离谱”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Earth in the very distant past (especially in prehistoric or early geological time).","zh":"与地球在极其久远的过去有关（尤指史前或早期地质时期的）。"},"examples":[{"en":"Scientists study ancient-Earth climates to understand today’s warming trends.","zh":"科学家研究远古地球的气候，以理解当今的变暖趋势。"},{"en":"The exhibit shows what ancient-Earth oceans may have looked like.","zh":"展览展示了远古地球的海洋可能是什么样子。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal, hyperbolic) Extremely old; from a long time ago.","zh":"（非正式、夸张）非常古老的；年代久远的。"},"examples":[{"en":"That laptop is ancient-Earth—no wonder it’s so slow.","zh":"那台笔记本电脑简直是“远古地球级别”的——难怪这么慢。"}]}],"synonyms":["prehistoric","primeval","early-Earth","deep-time","very old"],"phonetic":"/ˈeɪnʃənt ˈɝːθ/","extraExplanation":["“ancient Earth”更常见的写法是不加连字符：ancient Earth（远古的地球）。当它放在名词前作定语时，有时会加连字符以强调它是一个整体修饰语：ancient-Earth atmosphere / ancient-Earth conditions。","在科普与学术语境中，它通常指地球的早期历史（如太古宙 Archean、元古宙 Proterozoic 等）以及当时的大气、海洋、生命演化等。","作为夸张说法时，多见于口语或网络表达，带一点幽默感，用来形容东西“老到离谱”。"]}
{"word":"ancient-ecology-related","summary":{"en":"Ancient-ecology-related means connected to ancient ecosystems and past environments (often said as “paleoecological”).","zh":"ancient-ecology-related 指“与古代生态/古生态学有关的”（更常见说法是 paleoecological）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected to the study of ancient ecosystems, environments, and how plants and animals lived in the past","zh":"与研究古代生态系统、环境以及过去动植物如何生存有关的；古生态相关的"},"examples":[{"en":"Scientists found ancient-ecology-related clues in lake mud.","zh":"科学家在湖底淤泥中发现了与古生态相关的线索。"},{"en":"This ancient-ecology-related evidence suggests the area was once a wetland.","zh":"这些与古生态相关的证据表明，这里曾经是湿地。"},{"en":"We read an ancient-ecology-related report about mammoths and grasslands.","zh":"我们读到一份与古生态相关的报告，内容关于猛犸象和草原。"}]}],"synonyms":["paleoecological","paleoecology-related","prehistoric-environment-related","ancient-environment-related"],"phonetic":"/ˈeɪnʃənt iˈkɑlədʒi rɪˈleɪtɪd/","extraExplanation":["“ancient-ecology-related”不是一个固定的常见词条，更像是临时组合的形容词，用连字符把“ancient + ecology + related”连在一起，强调“与古代生态有关”。在学术或科普写作里，更自然、更常见的对应词是“paleoecological（古生态的）”或“paleoecology-related”。","“paleo-”来自希腊语，意思是“古老的”。因此：paleoecology = 古生态学（研究远古时期生态系统与环境变化）。"]}
{"word":"ancient-ecosystem","summary":{"en":"“Ancient ecosystem” means an ecosystem from the distant past; it can also be used as a modifier (often hyphenated) before a noun.","zh":"“Ancient ecosystem”指远古时期的生态系统；也可作定语（常加连字符）修饰后面的名词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ecosystem that existed in the distant past (often studied through fossils, sediments, and other geological evidence).","zh":"远古（古代）的生态系统；指在久远过去存在的生态系统（常通过化石、沉积物等地质证据来研究）。"},"examples":[{"en":"Scientists reconstructed an ancient ecosystem from fossilized plants and pollen.","zh":"科学家通过植物化石和花粉化石重建了一个远古生态系统。"},{"en":"This site preserves an ancient ecosystem that once supported large herbivores and predators.","zh":"这个遗址保存了一个曾经供养大型食草动物和捕食者的远古生态系统。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used before a noun to describe something related to ecosystems from the distant past.","zh":"（作定语）用于名词前，表示“与远古生态系统有关的”。"},"examples":[{"en":"The museum has an ancient-ecosystem exhibit about life in the Ice Age.","zh":"博物馆有一个关于冰河时代生命的“远古生态系统”展览。"},{"en":"Researchers collected ancient-ecosystem data from lake sediments.","zh":"研究人员从湖泊沉积物中收集远古生态系统的数据。"}]}],"synonyms":["paleoecosystem","prehistoric ecosystem","past ecosystem"],"phonetic":"/ˈeɪnʃənt ˈiːkoʊˌsɪstəm/","extraExplanation":["这个词更常见的写法是不加连字符的“ancient ecosystem”。加连字符（ancient-ecosystem）多用于它作为复合定语放在名词前时（如 ancient-ecosystem study / ancient-ecosystem evidence），用来强调它是一个整体概念。","在学术语境中，你也会看到更专门的词：paleoecosystem（古生态系统）和 paleoecology（古生态学），常用于研究史前环境与生物群落。"]}
{"word":"ancient-ethnic","summary":{"en":"An adjective meaning ‘connected to very old times and to an ethnic group’s culture or identity.’","zh":"形容词，表示“与远古时代以及某一族群的文化或身份相关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to very old times (ancient) and to an ethnic group’s culture, traditions, or identity (ethnic); often describing long-standing cultural customs or heritage connected to a particular people.","zh":"与远古时代（ancient）以及某一族群的文化、传统或身份（ethnic）有关；常用来形容与特定民族/族群相关、历史悠久的文化习俗或遗产。"},"examples":[{"en":"The museum has an exhibition on ancient-ethnic clothing from different regions.","zh":"博物馆有一个关于不同地区古老民族服饰的展览。"},{"en":"Researchers studied ancient-ethnic rituals to understand how communities formed their identities.","zh":"研究人员研究古老的族群仪式，以了解群体如何形成身份认同。"},{"en":"The novel is set in a village that preserves ancient-ethnic traditions.","zh":"这部小说以一个保留古老族群传统的村庄为背景。"}]}],"synonyms":["ancient ethnic","ancient cultural","traditional ethnic","indigenous (in some contexts)"],"phonetic":"/ˌeɪnʃənt ˈɛθnɪk/","extraExplanation":["“ancient-ethnic”并不是英语里非常固定、常见的标准搭配，更常见的是把它拆开写或换成更自然的表达，例如：ancient ethnic traditions / ancient ethnic groups / ancient ethnic heritage。","连字符（-）通常用来把两个词临时组合成一个形容词，放在名词前作定语时更常见（如 ancient-ethnic traditions）。如果放在名词后面作表语，很多情况下可以不加连字符：The traditions are ancient and ethnic in origin（但这种说法语气会不同）。","语义上“ethnic”在英语里有时会带有“少数族裔/非主流文化”的暗示。正式写作中若想避免误解，可以具体说明族群名称（如 Han, Tibetan, Navajo）或用更中性的词：cultural / indigenous / traditional（视语境而定）。"]}
{"word":"ancient-fish","summary":{"en":"“Ancient-fish” is an informal, hyphenated way to mean an ancient/prehistoric fish, often used as a compound modifier or name.","zh":"“ancient-fish”是非正式的连字符写法，表示“古代/史前的鱼”，常作复合修饰语或名称使用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not a standard dictionary word) A hyphenated phrase meaning “an ancient fish” or “a fish from ancient/prehistoric times,” often used informally in writing, headlines, tags, or usernames.","zh":"（非标准词条）带连字符的短语，意思是“古代的鱼 / 史前的鱼”，常见于非正式写作、标题、标签或用户名中。"},"examples":[{"en":"Scientists found fossils of an ancient fish in the desert.","zh":"科学家在沙漠里发现了一种古代鱼类的化石。"},{"en":"The exhibit features an “ancient-fish” model to show early ocean life.","zh":"展览用“古代鱼类”的模型来展示早期海洋生命。"},{"en":"She named her art account Ancient-Fish because she loves prehistoric creatures.","zh":"她把自己的艺术账号取名为 Ancient-Fish，因为她喜欢史前生物。"}]}],"synonyms":["prehistoric fish","ancient fish","primitive fish","fossil fish"],"phonetic":"/ˈeɪnʃənt fɪʃ/","extraExplanation":["英语里用连字符（hyphen）把两个词临时连成一个“复合修饰语”，常用于名词前：an ancient-fish fossil（古代鱼类化石）。如果放在名词后，通常不需要连字符：a fish that is ancient / an ancient fish。","如果你指的是特定物种，可以用更常见的表达：prehistoric fish（史前鱼类）、ancient fish species（古老的鱼类物种）。有时还会说“living fossil（活化石）”，比如 coelacanth（腔棘鱼）。"]}
{"word":"ancient-geographic","summary":{"en":"“Ancient-geographic” means connected with the geography of the ancient world.","zh":"“ancient-geographic”指与古代世界的地理相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the geography (places, regions, maps, or land features) of ancient times.","zh":"与古代的地理（地点、区域、地图或地形特征）有关的；古代地理的。"},"examples":[{"en":"The museum has an ancient-geographic map showing the Mediterranean world.","zh":"博物馆里有一张古代地理地图，展示了地中海世界。"},{"en":"Her paper compares ancient-geographic descriptions with modern satellite data.","zh":"她的论文将古代地理描述与现代卫星数据进行比较。"}]}],"synonyms":["ancient geographic","ancient geographical","of ancient geography","historical-geographic"],"phonetic":"/ˌeɪnʃənt ˌdʒiəˈɡræfɪk/","extraExplanation":["“ancient-geographic”不是非常常见的固定词条，更常见的表达是“ancient geographic / ancient geographical”或“ancient geography（古代地理学）”。\n\n连字符（-）通常用于强调它们作为一个整体来修饰名词：ancient-geographic map（古代地理地图）。在正式学术写作中，很多情况下也可以不用连字符。"]}
{"word":"ancient-geographical","summary":{"en":"Ancient-geographical describes geography, maps, and place descriptions connected to the ancient world or very old geographical features.","zh":"ancient-geographical 指与古代世界的地理、地图、地域描述有关，或指非常古老的地理特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to geography (places, maps, landscapes, regions) in the ancient world; about how people understood and described places in ancient times.","zh":"与古代地理有关的；指古代世界的地点、地图、地形、区域，以及古人对空间与地域的认识和描述。"},"examples":[{"en":"The book includes ancient-geographical descriptions of the Nile and the Mediterranean coast.","zh":"这本书包含对尼罗河和地中海沿岸的古代地理描述。"},{"en":"Researchers compared ancient-geographical records with modern satellite images.","zh":"研究人员将古代地理记录与现代卫星图像进行对比。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing a feature of geography that is very old (from ancient times).","zh":"（地理特征）非常古老的；源自古代时期的。"},"examples":[{"en":"The site preserves ancient-geographical boundaries that later shaped the city’s districts.","zh":"该遗址保留了古老的地理边界，后来影响了这座城市的分区。"},{"en":"They studied the region’s ancient-geographical changes caused by earthquakes and floods.","zh":"他们研究了地震与洪水造成的该地区古老地理变化。"}]}],"synonyms":["ancient geographical","classical geographical","historical-geographical","historical geographical"],"phonetic":"/ˈeɪnʃənt ˌdʒiəˈɡræfɪkəl/","extraExplanation":["这个词组通常是学术写作里的复合形容词（hyphenated compound adjective），多见于“ancient-geographical texts/knowledge/descriptions/records”等搭配，用来修饰名词。很多情况下也可以写成不加连字符的“ancient geographical”（更常见），加连字符主要是为了强调它们作为一个整体一起修饰后面的名词。"]}
{"word":"ancient-geography","summary":{"en":"Ancient geography means either the study of how people in ancient times described the world, or the geography of the ancient world itself.","zh":"Ancient geography 指古代人如何认识与描绘世界的研究，或指古代世界本身的地理状况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study or description of places, maps, and the natural world as understood in ancient times (especially in ancient Greece, Rome, Egypt, China, etc.)","zh":"古代地理学；对古代人所理解的地方、地图与自然世界的研究或描述（尤指古希腊、古罗马、古埃及、中国等文明）"},"examples":[{"en":"She is writing a paper on ancient geography in the Mediterranean world.","zh":"她正在写一篇关于地中海世界古代地理学的论文。"},{"en":"Ancient geography mixed observation with myths about distant lands.","zh":"古代地理学把观察记录与关于遥远土地的神话传说混在一起。"}]},{"partOfSpeech":"n.","definition":{"en":"(more generally) the geography of the ancient world itself—its regions, borders, trade routes, and place names in antiquity","zh":"（更广义）古代世界的地理状况本身——古代的地区、边界、贸易路线与地名体系"},"examples":[{"en":"Understanding ancient geography helps explain why cities grew along rivers.","zh":"理解古代地理有助于解释为什么城市会沿河发展。"},{"en":"The museum exhibit compares ancient geography with modern maps.","zh":"博物馆展览把古代地理与现代地图作对比。"}]}],"synonyms":["historical geography","classical geography","geography of antiquity"],"phonetic":"/ˈeɪnʃənt dʒiˈɑɡrəfi/","extraExplanation":["“ancient geography”常见于历史、考古、古典学与历史地图学（historical cartography）语境。古代资料里经常出现两类特点：一是信息来源不一（旅行者记述、商路传闻、官方记录）；二是地图与文字描述并重，且可能夹杂神话想象。","西方传统中常被提到的代表人物与作品包括托勒密（Ptolemy）的《地理学》（Geographia）；东亚语境里也常涉及历代方志、舆图与地名沿革研究。学习时可特别关注“古今地名对应”“距离与方位的记录方式”“贸易路线与自然地形的关系”。"]}
{"word":"ancient-geologic","summary":{"en":"Ancient-geologic describes something very old and connected to Earth’s geological history or processes.","zh":"Ancient-geologic 用来形容“非常古老且与地质历史/地质过程有关”的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Extremely old; relating to the very distant past.","zh":"极其古老的；与遥远的过去有关的。"},"examples":[{"en":"They discovered ancient tools buried in the desert.","zh":"他们在沙漠里发现了埋藏的古代工具。"},{"en":"The story is set in ancient times.","zh":"这个故事发生在远古时代。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to geology (the study of Earth, rocks, and how the Earth changes over time).","zh":"与地质学有关的（研究地球、岩石及其长期变化的学科）。"},"examples":[{"en":"The park has unique geologic formations.","zh":"这个公园有独特的地质构造。"},{"en":"Geologic evidence suggests the climate changed many times.","zh":"地质证据表明气候曾多次变化。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Hyphenated) Describing something that is both very old and connected to geological history or processes; often used in scientific or educational writing.","zh":"（连字符形式）形容既非常古老、又与地质历史或地质过程有关的事物；常见于科普或学术写作。"},"examples":[{"en":"The canyon reveals ancient-geologic layers formed over millions of years.","zh":"这条峡谷展示了在数百万年间形成的远古地质层。"},{"en":"We studied ancient-geologic events that shaped the continent.","zh":"我们研究了塑造这块大陆的远古地质事件。"}]}],"synonyms":["prehistoric","primeval","geological","geologic","deep-time"],"phonetic":"/ˈeɪnʃənt dʒiəˈlɑːdʒɪk/","extraExplanation":["“ancient-geologic”不是最常见的固定词条，更常见的写法是用短语来表达：ancient geologic layers / ancient geological history。作者使用连字符通常是为了把两个形容词“捆绑”成一个整体概念，强调它们共同修饰后面的名词。","在更正式的学术写作中，也常见“geological”比“geologic”略常用（两者意思非常接近）。"]}
{"word":"ancient-looking","summary":{"en":"Ancient-looking describes something that appears very old or from the distant past.","zh":"Ancient-looking 用来形容某物外观看起来非常古老、像来自久远的过去。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having an old-fashioned or very old appearance; looking like it comes from long ago.","zh":"看起来很古老的；外观很旧式、像来自很久以前的。"},"examples":[{"en":"The temple has ancient-looking stone carvings on the walls.","zh":"这座寺庙的墙上有看起来很古老的石雕。"},{"en":"He wore an ancient-looking ring that seemed to belong in a museum.","zh":"他戴着一枚看起来很古老的戒指，仿佛应该在博物馆里。"},{"en":"The designer chose ancient-looking fonts to give the poster a historical feel.","zh":"设计师选了看起来很古老的字体，让海报更有历史感。"}]}],"synonyms":["old-looking","antique-looking","aged","timeworn","archaic-looking"],"phonetic":"/ˈeɪnʃənt ˈlʊkɪŋ/","extraExplanation":["“ancient-looking”是由“ancient（古代的）+ looking（看起来……的）”组成的复合形容词，常用来描述外观或风格，而不一定表示物品真的来自古代。","近义表达：old-looking（看起来旧的，语气更中性）、antique-looking（像古董的）、aged（做旧的/显旧的）；如果强调“仿古风格”，也可用“ancient-style / in an ancient style”。"]}
{"word":"ancient-minded","summary":{"en":"Ancient-minded means having very old-fashioned, outdated ideas or attitudes.","zh":"ancient-minded 指观念非常老派、过时。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having old-fashioned ideas or attitudes; thinking in a way that feels very outdated.","zh":"思想老派的；观念过时的；用很旧的方式看问题的。"},"examples":[{"en":"Some people think the rule is ancient-minded and unfair.","zh":"有些人觉得这条规定观念很过时，也不公平。"},{"en":"He sounded ancient-minded when he said men should never cook.","zh":"他说“男人绝不该做饭”时，听起来观念非常老派。"},{"en":"The company is trying to modernize its ancient-minded management style.","zh":"这家公司正尝试让它那种过时的管理方式现代化。"}]}],"synonyms":["old-fashioned","outdated","behind the times","traditional-minded","conservative"],"phonetic":"/ˈeɪnʃənt ˌmaɪndɪd/","extraExplanation":["“ancient-minded”不是特别常见的固定词，更像是由“ancient（古老的）+ minded（有……思想/倾向的）”临时组合出来的形容词，用来强调“观念像古代一样旧”。在正式写作中更常见的表达是“old-fashioned / outdated / traditional-minded / conservative”。","语气通常带一点批评或讽刺（觉得对方跟不上时代），但也可能在特定语境里只是中性描述（例如强调“非常传统”）。","写法上常用连字符“ancient-minded”来表示它是一个整体形容词；不加连字符也能看懂，但连字符更清楚。"]}
{"word":"ancient-motion","summary":{"en":"“ancient-motion” is a not-fixed, often creative compound meaning motion from ancient times or motion inspired by antiquity; the hyphen commonly marks it as a single modifier.","zh":"“ancient-motion”多为非固定、偏创意的复合表达，指“古代的运动/受古代启发的动作”；连字符常用来表示它作为一个整体去修饰名词。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(often creative or technical) movement from ancient times; motion associated with ancient people, animals, or objects.","zh":"（多为创意或技术语境）古代的运动；与古人、古代动物或器物相关的运动方式/运动现象。"},"examples":[{"en":"The museum’s animation shows the ancient motion of a Roman catapult as it launches a stone.","zh":"博物馆的动画展示了罗马投石机发射石块时的古代运动过程。"},{"en":"Researchers try to reconstruct ancient motion from footprints preserved in the mud.","zh":"研究人员试图根据泥中保存的足迹重建古代的运动方式。"}]},{"partOfSpeech":"adj.","definition":{"en":"(as a hyphenated modifier) describing something as involving ancient-era movement or a motion style inspired by antiquity.","zh":"（作连字符修饰语）形容某事物“涉及古代运动/受古代风格启发的动作”。"},"examples":[{"en":"They used an ancient-motion sequence in the film to make the battle feel historical.","zh":"他们在电影中加入“古代动作”段落，让战斗更有历史感。"},{"en":"The app includes ancient-motion exercises inspired by classical statues and poses.","zh":"这款应用包含受古典雕像和姿势启发的“古代动作”练习。"}]}],"synonyms":["ancient motion","movement in antiquity","ancient locomotion","historical movement"],"phonetic":"/ˈeɪnʃənt ˈmoʊʃən/","extraExplanation":["“ancient-motion”不是固定的常见词条，更像是作者自造的复合表达。加连字符通常表示它作为一个整体来修饰后面的名词（如 ancient-motion study / ancient-motion sequence）。如果只是普通说“古代的运动”，不加连字符更自然：ancient motion.","在学术/科普语境里，更常见的对应说法可能是：movement in antiquity（古代的运动）、ancient locomotion（古代行走/移动方式）、historical motion reconstruction（历史运动重建）。"]}
{"word":"ancient-plant","summary":{"en":"“Ancient plant” refers either to plants from very long ago (often known from fossils) or to plants closely connected with ancient human cultures and their uses.","zh":"“ancient plant”可指很久以前存在的植物（常通过化石得知），也可指与古代人类文化及其用途密切相关的植物。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a plant that existed in very old times (often in prehistoric or early historic periods), known from fossils, ancient texts, or archaeological remains","zh":"古代植物；指在很久以前（常见于史前或早期历史时期）存在的植物，常通过化石、古籍或考古遗存得知"},"examples":[{"en":"Scientists studied an ancient plant fossil found in the desert.","zh":"科学家研究了一块在沙漠中发现的古代植物化石。"},{"en":"Ancient plants helped shape Earth’s early ecosystems.","zh":"古代植物帮助塑造了地球早期的生态系统。"}]},{"partOfSpeech":"phrase","definition":{"en":"a plant (or plant product) associated with ancient cultures, especially one used for food, medicine, dye, or rituals in the past","zh":"与古代文明相关的植物（或植物制品）；尤指古人用于食物、药用、染料或仪式的植物"},"examples":[{"en":"Garlic is an ancient plant used in traditional medicine in many cultures.","zh":"大蒜是一种在许多文化的传统医药中使用的古老植物。"},{"en":"Archaeologists found seeds from an ancient plant in the tomb.","zh":"考古学家在墓葬里发现了某种古代植物的种子。"}]}],"synonyms":["prehistoric plant","fossil plant","primitive plant","ancient herb"],"phonetic":"/ˈeɪnʃənt plænt/","extraExplanation":["“ancient-plant”带连字符并不常见；更自然的写法通常是“ancient plant”。连字符多用于临时复合词，强调它作为一个整体来修饰名词，例如：an ancient-plant specimen（一个“古代植物”标本）。","在科学语境里，相关领域常见词包括 paleobotany（古植物学）与 fossil plant（化石植物）。如果指“现存但非常古老、变化很小的物种”，常用说法是 living fossil（活化石），如 ginkgo（银杏）常被这样称呼。"]}
{"word":"ancient-psychology-related","summary":{"en":"“Ancient-psychology-related” means connected with ancient ideas or writings about the mind.","zh":"“ancient-psychology-related”意为“与古代关于心灵/心理的思想或著作有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with or referring to ideas, texts, or theories about the mind from ancient times (especially Greek and Roman philosophy).","zh":"与古代（尤指希腊、罗马哲学传统中）关于心灵/心理的思想、文本或理论有关的。"},"examples":[{"en":"The paper includes an ancient-psychology-related discussion of Plato’s view of the soul.","zh":"这篇论文包含一段与古代心理学相关的讨论，介绍了柏拉图对灵魂的看法。"},{"en":"She is reading ancient-psychology-related texts like Aristotle’s writings on memory.","zh":"她正在阅读与古代心理学相关的文本，例如亚里士多德关于记忆的著作。"}]}],"synonyms":["ancient psychological","related to ancient theories of mind","classical-psychology-related"],"phonetic":"/ˈeɪnʃənt saɪˈkɑlədʒi rɪˈleɪtɪd/","extraExplanation":["这是一个研究写作中常见的“连字符复合形容词”（hyphenated compound adjective）：ancient + psychology + related，用来在名词前做定语，强调“与古代心理思想有关”。更自然的替代表达包括：related to ancient psychology / ancient psychological / about ancient theories of mind。","严格来说，“psychology（心理学）”作为现代学科名称较晚出现；在谈“古代心理学”时，很多语境其实指古代哲学中的“心灵/灵魂/认知”理论（theories of mind/soul, cognition, memory）。"]}
{"word":"ancient-style","summary":{"en":"Ancient-style describes something designed to look traditional or from ancient times.","zh":"ancient-style 指“仿古的、古风的”，用来形容具有古代或传统风格的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made to look like something from long ago; designed in a traditional or old-fashioned way.","zh":"仿古的；古风的；做成很久以前风格的。"},"examples":[{"en":"The hotel lobby has ancient-style lanterns and wooden screens.","zh":"酒店大堂有古风灯笼和木质屏风。"},{"en":"She wore an ancient-style dress for the historical photo shoot.","zh":"她为历史主题拍摄穿了一件古风长裙。"}]}],"synonyms":["antique-style","traditional","classical","vintage-style","old-world"],"phonetic":"/ˈeɪnʃənt staɪl/","extraExplanation":["“ancient-style”常用连字符作定语（如 ancient-style temple）。若放在名词后作表语，也可以不加连字符：The design is ancient style / ancient-style（前者更像名词短语，后者更像形容词）。","在英文里，“ancient”通常指“古代（很久以前）”，而“old-fashioned”更偏“过时的”。“ancient-style”一般是中性甚至带审美取向的“仿古风格”。"]}
{"word":"ancient-temperature","summary":{"en":"“Ancient temperature” means the temperature in ancient times; in science it often refers to reconstructed past temperatures (paleotemperature).","zh":"“ancient temperature”指古代的温度；在科学语境中常指重建得到的过去温度（古温度/古气温，paleotemperature）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"the temperature (weather or climate) in ancient times; an old or historical temperature record or estimate","zh":"古代的温度；对古代天气/气候温度的记录或推测"},"examples":[{"en":"Scientists estimated the ancient temperature of the region using lake sediments.","zh":"科学家通过湖泊沉积物估算了该地区的古代温度。"},{"en":"The ancient temperature was likely cooler than today during that period.","zh":"在那个时期，古代温度很可能比今天更低。"}]},{"partOfSpeech":"n.","definition":{"en":"(science) paleotemperature: the reconstructed temperature of Earth’s past climates, often based on indirect evidence (proxies)","zh":"（科学）古温度/古气温（paleotemperature）：利用“代用指标/代用资料”重建的地球过去气候温度"},"examples":[{"en":"Ice cores help researchers reconstruct paleotemperature changes over thousands of years.","zh":"冰芯帮助研究人员重建数千年来的古温度变化。"},{"en":"Oxygen isotopes in shells can be used as a proxy for paleotemperature.","zh":"贝壳中的氧同位素可作为重建古温度的代用指标。"}]}],"synonyms":["paleotemperature","past temperature","historic temperature","ancient climate temperature"],"phonetic":"/ˈeɪnʃənt ˈtɛmprətʃɚ/","extraExplanation":["“ancient-temperature”不是最常见的固定词条，更常写作 **ancient temperature**（不加连字符）或学术用语 **paleotemperature**。连字符有时用于标题、标签、数据字段名（如数据库列名），表示“与古代温度相关的”。","在古气候研究中，人们常用“代用指标（proxies）”来推断古温度，例如冰芯、树轮、珊瑚、湖海沉积物、以及同位素比例等；它们不是直接温度计读数，而是与温度有关的间接证据。"]}
{"word":"ancient-volcanic","summary":{"en":"Ancient-volcanic describes something very old that was formed by or connected to volcanoes.","zh":"ancient-volcanic 用来形容“非常古老且与火山形成/火山有关”的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Very old (from a long time ago) and related to volcanoes—often describing rocks, landscapes, islands, or geologic activity formed in the distant past.","zh":"非常古老的、并且与火山有关的——常用于形容在远古时期由火山活动形成的岩石、地貌、岛屿或地质特征。"},"examples":[{"en":"Geologists studied the island’s ancient-volcanic rocks to understand its early history.","zh":"地质学家研究这座岛屿的远古火山岩，以了解它的早期历史。"},{"en":"The hikers followed a trail across an ancient-volcanic plateau.","zh":"徒步者沿着小径穿越一片远古火山高原。"},{"en":"Ancient-volcanic soil can be rich in minerals and good for farming.","zh":"远古火山土壤可能富含矿物质，有利于农业。"}]}],"synonyms":["ancient volcanic","prehistoric volcanic","old volcanic"],"phonetic":"/ˈeɪnʃənt vɑlˈkænɪk/","extraExplanation":["“ancient-volcanic”通常是临时组合的复合形容词，用连字符把两个词连在一起，表示它们共同修饰后面的名词（如 ancient-volcanic rock/landscape）。在正式写作中也常写成不加连字符的“ancient volcanic”，意思基本相同；是否加连字符常取决于编辑风格与是否需要强调“作为一个整体概念”。","语境上它更常见于地质、自然地理、旅游介绍等文本；日常口语里更可能说“very old volcanic rocks/areas（非常古老的火山岩/火山区）”。"]}
{"word":"ancienter","summary":{"en":"“Ancienter” is a rare/old-fashioned way to say “more ancient” or “older.”","zh":"“ancienter”是较为罕见、偏古旧的说法，意思相当于“more ancient / older”（更古老的）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/archaic) More ancient; older, from a much earlier time.","zh":"（罕见/古旧）更古老的；更久远的；来自更早时期的。"},"examples":[{"en":"This manuscript seems ancienter than the others in the collection.","zh":"这份手稿似乎比馆藏中的其他手稿更古老。"},{"en":"They searched for signs of ancienter civilizations beneath the ruins.","zh":"他们在废墟之下寻找更古老文明的迹象。"}]}],"synonyms":["more ancient","older","more archaic","more primeval"],"phonetic":"/ˈeɪnʃəntər/","extraExplanation":["“ancienter”是形容词“ancient”的比较级形式，但在现代英语里几乎不用，听起来会很不自然。更常见、更标准的说法是“more ancient”或直接用“older”。","一般规律是：多音节形容词用“more + 形容词”构成比较级（more ancient），而不是加“-er”。因此“ancienter”多见于旧文本、仿古写法或个别作者的风格选择。"]}
{"word":"ancientest","summary":{"en":"“Ancientest” is a rare/nonstandard way to say “most ancient.” In modern English, “most ancient” is preferred.","zh":"“ancientest”是“most ancient（最古老的）”的罕见/非规范说法；现代英语更常用“most ancient”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare or nonstandard) the superlative form of “ancient,” meaning “the most ancient; very old, from the earliest time.”","zh":"（罕见或非规范用法）“ancient”的最高级，意为“最古老的；非常久远、最早期的”。"},"examples":[{"en":"Among these ruins, the temple is often described as the ancientest structure in the valley.","zh":"在这些遗迹中，这座神庙常被形容为山谷里最古老的建筑。"},{"en":"The manuscript may be the ancientest copy still in private hands.","zh":"这份手稿可能是仍在私人手中保存的最古老抄本。"}]}],"synonyms":["most ancient","oldest","earliest"],"phonetic":"/ˈeɪnʃəntɪst/","extraExplanation":["“ancient”通常不用“-est”来构成最高级，更自然的说法是“most ancient”。在现代英语里，“ancientest”多被视为不常见、带有古风或不规范的形式，偶尔出现在早期英语、模仿古文风格、诗歌/文学化表达中。","学习时更建议用：the most ancient / the oldest（如果强调“最老、最早”）/ the earliest。比如：the most ancient civilization（最古老的文明）。"]}
{"word":"ancientism","summary":{"en":"Ancientism usually means a preference for or admiration of ancient times; more rarely, it can mean an intentionally old-fashioned word or style modeled on ancient forms.","zh":"Ancientism通常指对古代的崇尚或偏爱；较少见时也可指刻意仿古的词语或风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong interest in, admiration for, or preference for things from ancient times; the tendency to treat ancient cultures or the distant past as especially important or superior.","zh":"对古代事物的强烈兴趣、崇尚或偏爱；倾向于认为古代文化或久远过去格外重要、甚至更优越。"},"examples":[{"en":"His writing shows a kind of ancientism, praising ancient Rome as the model for modern society.","zh":"他的写作带有一种“崇古倾向”，把古罗马赞为现代社会的典范。"},{"en":"The museum’s new exhibit avoids ancientism by showing both the achievements and the hardships of the ancient world.","zh":"博物馆的新展览避免了“过度崇古”，既呈现古代世界的成就，也呈现其艰难与问题。"}]},{"partOfSpeech":"n.","definition":{"en":"A word, expression, style, or practice that is deliberately old-fashioned or modeled on ancient forms (a rare usage).","zh":"刻意使用的古旧词语、表达方式、风格或做法（较少见的用法）。"},"examples":[{"en":"Some translators keep a few ancientisms to give the text an older, more formal tone.","zh":"有些译者会保留少量“古风用语”，让文本显得更古旧、更庄重。"},{"en":"The poet mixed modern speech with ancientisms borrowed from classical sources.","zh":"那位诗人把现代口语与从古典文献借来的古风表达混在一起。"}]}],"synonyms":["antiquarianism","archaism","classicizing","traditionalism","nostalgia"],"phonetic":"/ˈeɪnʃəntˌɪzəm/","extraExplanation":["“ancientism”在现代英语里不算常用词，学术写作中更常见的相关词包括：antiquarianism（对古物/古董/古史的研究或迷恋）、archaism（古语、古旧用法）、classicizing（仿古、古典化）。","第二个义项（指“古风用语/仿古做法”）在实际使用中更常由“archaism(s)”来表达；读到“ancientism(s)”时，常常是在强调“更偏向古代/古典”的语感或风格。"]}
{"word":"anciently","summary":{"en":"“Anciently” means “in ancient times; long ago,” and is mostly used in formal or historical writing.","zh":"“anciently”意为“在古代；很久以前”，多用于正式或历史类写作。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In ancient times; long ago.","zh":"在古代；很久以前。"},"examples":[{"en":"Anciently, people used the stars to navigate at sea.","zh":"在古代，人们用星星来进行海上导航。"},{"en":"This city was anciently the center of trade in the region.","zh":"这座城市在古代曾是该地区的贸易中心。"}]},{"partOfSpeech":"adv.","definition":{"en":"In an old-fashioned or traditional way (less common).","zh":"以古老的方式；以传统、过时的方式（较少见）。"},"examples":[{"en":"The ceremony is carried out anciently, with songs passed down for centuries.","zh":"仪式以古老的方式进行，唱着流传数百年的歌。"}]}],"synonyms":["in ancient times","long ago","in antiquity","in the past"],"phonetic":"/ˈeɪnʃəntli/","extraExplanation":["“anciently”比较少用于日常口语，更常见的替代说法有：in ancient times, long ago, in the past。写作或历史类文本中更常见，例如介绍古城、古文明或历史习俗。","语法提示：anciently常放在句首作时间状语（Anciently, …），或放在be动词/一般动词后说明“过去曾经是/曾经发生”（was anciently…, were anciently…, lived anciently…）。"]}
{"word":"ancientness","summary":{"en":"Ancientness means the quality of being very old or from ancient times.","zh":"Ancientness 指“非常古老/源自远古时代”的特质或状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of being very old; great age.","zh":"非常古老的特质或状态；年代久远。"},"examples":[{"en":"The museum’s artifacts remind visitors of the ancientness of the civilization.","zh":"博物馆的文物让参观者感受到这个文明的古老。"},{"en":"You can feel the ancientness of the city in its narrow streets and old stone walls.","zh":"你能从狭窄的街道和古老的石墙中感受到这座城市的古老气息。"}]}],"synonyms":["antiquity","great age","age-oldness","ancient character"],"phonetic":"/ˈeɪnʃəntnəs/","extraExplanation":["“ancientness”是由形容词“ancient（古老的）”加名词后缀“-ness”构成，表示“……的性质/状态”。它在英语里可用但不算非常常见；更自然、常用的表达通常是“antiquity（古代；古老）”“ancient age（古老年代）”或直接说“how ancient it is（有多古老）”。","语感上，“ancientness”常带一种抽象、描述氛围或质感的用法（比如地方、传统、气息的“古老感”），写作中偶尔使用以强调“古老这一特质”。"]}
{"word":"ancientry","summary":{"en":"“Ancientry” is a rare, literary noun meaning antiquity or ancient things as a whole.","zh":"“Ancientry”是一个较少见、偏文学的名词，指“古代/古风”，或“古代事物的总称”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Antiquity; ancient times, or the quality of being ancient.","zh":"古代；古老的时代，或“古老”这一性质。"},"examples":[{"en":"The museum’s collection evokes the magic of ancientry and legend.","zh":"博物馆的馆藏唤起了古代与传说的神秘感。"},{"en":"Poets sometimes use “ancientry” to give their writing an old-fashioned, historical tone.","zh":"诗人有时会用“ancientry”来营造一种古雅、历史感的语气。"}]},{"partOfSpeech":"n.","definition":{"en":"Ancient things collectively (old relics, customs, stories, or traditions).","zh":"（总称）古物、古俗、古老故事或传统等“古代事物”。"},"examples":[{"en":"He filled his book with ancientry—ruins, rites, and half-forgotten tales.","zh":"他在书中写满了古代事物——遗迹、仪式与半被遗忘的故事。"}]}],"synonyms":["antiquity","ancient times","the past","old traditions","relics"],"phonetic":"/ˈeɪnʃəntri/","extraExplanation":["“ancientry”是一个较少见、带文学色彩的词，更常见的替代说法是“antiquity”（古代/古风）或“ancient times”（古代时期）。","词尾“-ry”常见于表示“整体/集合/性质”的名词（如 “poetry” 诗歌之总称），因此“ancientry”也常带有“古代事物的整体氛围”这种感觉。"]}
{"word":"ancients","summary":{"en":"“Ancients” means people from ancient times, especially famous civilizations; it can also mean ancient writers or authorities in a scholarly context.","zh":"“ancients”指古代的人，尤指著名古代文明的人；在学术语境中也可指古代的作者或权威。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who lived in very old times, especially those from ancient civilizations (like Greece, Rome, Egypt, or China).","zh":"古人；古代人（尤指古代文明，如希腊、罗马、埃及或中国的人）"},"examples":[{"en":"The ancients built temples that still inspire architects today.","zh":"古人建造的神庙至今仍启发着建筑师。"},{"en":"In philosophy class, we read what the ancients wrote about virtue.","zh":"在哲学课上，我们阅读古人关于美德的著作。"}]},{"partOfSpeech":"n.","definition":{"en":"In literature or history writing: ancient writers, thinkers, or authorities (as opposed to modern ones).","zh":"（文学/史学语境）古代的作者、思想家或权威（相对于现代人）"},"examples":[{"en":"The poet often borrows images from the ancients.","zh":"这位诗人常借用古代作家的意象。"},{"en":"Some medical ideas of the ancients were surprisingly accurate.","zh":"古代权威的一些医学观点出奇地准确。"}]}],"synonyms":["the people of antiquity","ancient peoples","forebears","ancestors"],"phonetic":"/ˈeɪnʃənts/","extraExplanation":["“ancients”是形容词“ancient（古代的）”的名词复数用法，常见于书面语或课堂语境，带有一种“遥远时代的智慧/权威”的文化色彩。","常见搭配：the ancients（古人/古代先贤）、the ancients and the moderns（古人与今人，用于对比不同思想传统）。","文学中常见表达：如“The ancients said…”（古人说……），用来引出格言或古典观点。"]}
{"word":"ancienty","summary":{"en":"“ancienty” is not a standard English word; it is usually a misspelling of “anciently” (meaning “long ago, in ancient times”).","zh":"“ancienty”不是标准英语词，通常是“anciently”的拼写错误，意思是“很久以前/在古代”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard) A misspelling of “anciently.” In standard English, use “anciently” (adv.) or “ancient” (adj.).","zh":"（非标准）“ancienty”通常是“anciently”的拼写错误。标准英语中应使用“anciently”（副词）或“ancient”（形容词）。"},"examples":[{"en":"Nonstandard: “This city was ancienty famous.” → Standard: “This city was anciently famous.”","zh":"非标准：“This city was ancienty famous.” → 标准：“This city was anciently famous.”"},{"en":"If you mean something very old, use “ancient”: “They studied ancient history.”","zh":"如果你想表达“非常古老的”，用“ancient”：“他们学习古代史。”"}]},{"partOfSpeech":"adv.","definition":{"en":"anciently (adv.): in ancient times; long ago.","zh":"anciently（副词）：在古代；很久以前。"},"examples":[{"en":"Anciently, people used the stars to navigate.","zh":"在古代，人们用星星来导航。"},{"en":"The temple was anciently a place of healing.","zh":"这座寺庙在古时曾是治病疗养之所。"}]}],"synonyms":["anciently: long ago","anciently: in ancient times","anciently: formerly"],"phonetic":"/ˈeɪnʃəntli/","extraExplanation":["“anciently”常见于较正式或带历史感的写作（例如历史书、学术文章或文学仿古语气），日常口语里更常用“long ago / in ancient times”。"]}
{"word":"Ancier","summary":{"en":"“Ancier” is a rare, old-fashioned word meaning “former/earlier.”","zh":"“ancier”是一个罕见的古旧词，意思是“先前的/较早的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, archaic) Former; earlier; from an earlier time.","zh":"（罕见/古旧用法）先前的；较早的；来自更早时期的。"},"examples":[{"en":"In some old records, “ancier” is used to mean “former.”","zh":"在一些旧文献中，“ancier”用来表示“former（先前的）”。"},{"en":"They compared the new rule with the ancier custom of the town.","zh":"他们把新规定与该镇先前的习俗作了比较。"}]}],"synonyms":["former","earlier","previous","old","ancient"],"phonetic":"ˈænsiər","extraExplanation":["“ancier”在现代英语中非常少见，多见于历史文献、法律/家谱/纹章等语境，带有法语借词色彩（法语 ancien/ancienne 意为“旧的、以前的”）。日常英语更常用 former、earlier、old、ancient。","如果你本来想查的是 “ancient”，拼写是 a-n-c-i-e-n-t。"]}
{"word":"ancile","summary":{"en":"An ancile is a sacred shield from ancient Rome, famously linked to the Salii priests and Roman state religion.","zh":"ancile指古罗马的圣盾，最著名的是与萨利祭司及国家宗教仪式相关的那十二面圣盾。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in ancient Rome) a sacred oval shield, especially one of the twelve holy shields kept by the priests of Mars (the Salii).","zh":"（古罗马）神圣的椭圆盾，尤指由战神玛尔斯祭司团（Salii）保管的十二面圣盾之一。"},"examples":[{"en":"According to Roman legend, an ancile fell from the sky as a sign of divine protection.","zh":"按罗马传说，一面ancile从天而降，象征神明的护佑。"},{"en":"The Salii carried the ancilia in ritual processions through the city.","zh":"萨利祭司在宗教游行中抬着这些ancile穿行于城中。"}]}],"synonyms":["sacred shield","Roman sacred shield"],"phonetic":"/ˈæn.sɪ.li/","extraExplanation":["“ancile”来自拉丁语，常出现在罗马宗教与神话语境中：传说努马王（Numa Pompilius）时期天降一面圣盾，为防被盗而仿制成十二面，由萨利祭司守护并在仪式中使用。","复数常见写法为 ancilia（拉丁式复数），在历史与古典学文章中更常遇到。"]}
{"word":"ancilia","summary":{"en":"Ancilia are the sacred shields of Mars in ancient Rome, carried by the Salii in religious processions.","zh":"ancilia指古罗马供奉战神马尔斯的圣盾，由萨利祭司在宗教游行中携带。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Roman history/religion) Sacred shields kept by the priests of Mars (the Salii) in ancient Rome; traditionally there were twelve, and they were carried in religious processions.","zh":"（罗马历史/宗教）古罗马供奉给战神马尔斯的圣盾，由“萨利祭司”（Salii）保管；传说共有十二面，并在宗教游行中被携带。"},"examples":[{"en":"In March, the Salii carried the ancilia through Rome during public rituals for Mars.","zh":"每年三月，萨利祭司会在为战神马尔斯举行的公共仪式中携带ancilia在罗马城游行。"},{"en":"Some Roman writers linked the ancilia with the safety and power of the city.","zh":"一些罗马作家把ancilia与城邦的安全与力量联系在一起。"}]}],"synonyms":["sacred shields","shields of Mars"],"phonetic":"/ænˈsɪliə/","extraExplanation":["“ancilia”通常被视为拉丁语名词“ancile”的复数形式（指单面圣盾）。罗马传统说法是：第一面圣盾从天而降，象征罗马的命运与守护；为了防止被盗，后来又仿制了十一面，使真盾难以辨认。","在英语学术写作中，这个词多出现在罗马宗教、仪式与古典文学研究语境里；日常英语中非常少见。"]}
{"word":"Ancilin","summary":{"en":"“Ancilin” isn’t standard English; it likely refers to ampicillin or a penicillin-type antibiotic name ending in “-cillin.”","zh":"“Ancilin”不是标准英语词；多半指氨苄西林（ampicillin）或带“-cillin”结尾的青霉素类抗生素名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Ancilin is not a standard English dictionary word. It is most often seen as a misspelling or a brand-like spelling referring to ampicillin, a penicillin-type antibiotic.","zh":"Ancilin 不是标准英语词典词。它多半是拼写误差或类似商品名的写法，通常指的是 ampicillin（氨苄西林），一种青霉素类抗生素。"},"examples":[{"en":"I can’t find “Ancilin” in the dictionary—do you mean ampicillin?","zh":"我在词典里找不到“Ancilin”，你是不是想说 ampicillin（氨苄西林）？"},{"en":"The doctor prescribed ampicillin to treat a bacterial infection.","zh":"医生开了氨苄西林来治疗细菌感染。"}]},{"partOfSpeech":"other","definition":{"en":"(-cillin) A common ending in the names of penicillin-related antibiotics (e.g., penicillin, amoxicillin, ampicillin).","zh":"（-cillin）常见于青霉素相关抗生素名称的词尾（如 penicillin、amoxicillin、ampicillin）。"},"examples":[{"en":"Amoxicillin and ampicillin share the “-cillin” ending because they’re related antibiotics.","zh":"Amoxicillin 和 ampicillin 都以 “-cillin” 结尾，因为它们是同类（相关）的抗生素。"}]}],"synonyms":["ampicillin","penicillin","amoxicillin"],"phonetic":"/ˌæmpɪˈsɪlɪn/","extraExplanation":["“Ancilin”更像是商品名/误拼：不同国家和药品包装上可能出现接近的拼写。若你是在药盒、处方或说明书上看到，建议你补充照片或完整拼写（以及国家/地区），我可以更准确地帮你确认。","医学语境里，很多抗生素名称以 “-cillin” 结尾，来源于“penicillin（青霉素）”这一类药物的命名习惯。"]}
{"word":"ancilla","summary":{"en":"Ancilla means a (literary/archaic) female servant or handmaid, often in Roman or religious contexts.","zh":"Ancilla 指（文学/古风用语）女仆、侍女，常见于古罗马或宗教语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic or formal) a female servant; a maidservant or handmaid, especially in ancient Rome or in literary/religious writing.","zh":"（古风/正式）女仆；侍女；婢女（常指古罗马语境或文学/宗教文体中的用法）。"},"examples":[{"en":"In the novel, an ancilla lights the lamps before the guests arrive.","zh":"在小说中，一位侍女在客人到来前点亮灯火。"},{"en":"The inscription calls her an ancilla, suggesting she worked as a household servant.","zh":"碑文称她为“ancilla”，暗示她在家中做女仆。"}]}],"synonyms":["maidservant","handmaid","servant","housemaid"],"phonetic":"/ænˈsɪlə/","extraExplanation":["“ancilla”来自拉丁语，原意就是“女奴/女仆”。在英语里它带有明显的古典与书面色彩，日常更常说 maid、servant、housemaid。","在基督教传统中常见短语“ancilla Domini”（主的婢女/上主的侍女），用于表达谦卑与服侍的姿态；因此在宗教语境里它的语气可能更庄重、带敬虔意味，而不只是职业称呼。"]}
{"word":"ancillae","summary":{"en":"*Ancillae* means “female servants/handmaids,” the Latin plural of *ancilla*, used mainly in historical or religious writing.","zh":"*Ancillae* 指“女仆/侍女”，是拉丁语 *ancilla* 的复数，主要用于历史或宗教写作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of *ancilla*) female servants; handmaids (a rare, Latin-derived word used mostly in historical, religious, or literary contexts).","zh":"（*ancilla* 的复数）女仆；侍女（较罕见，源自拉丁语，多见于历史、宗教或文学语境）。"},"examples":[{"en":"In the Roman household, ancillae did much of the daily work.","zh":"在罗马家庭中，侍女们承担了许多日常劳动。"},{"en":"The text mentions ancillae and other servants attending the noblewoman.","zh":"文中提到侍女和其他仆人侍奉那位贵妇。"}]}],"synonyms":["handmaids","maids","female servants","servant women"],"phonetic":"/ænˈsɪliː/","extraExplanation":["*Ancillae* 来自拉丁语 *ancilla*（女仆、侍女）。英语里这种 -ae 结尾的拉丁复数有时会被读成 /iː/，也常被用来营造“古典/学术/宗教”风格。","在基督宗教语境中，*ancilla Domini*（“主的婢女/上主的使女”）是《圣经》中马利亚的自称（路加福音 1:38），因此相关拉丁表达有时会带有“谦卑服侍上帝”的含义。"]}
{"word":"ancillaries","summary":{"en":"Ancillaries are extra supporting items or services; ancillary means secondary or supporting.","zh":"ancillaries 指附加的配套事物/服务；ancillary 指辅助的、次要的、附加的。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(usually plural) extra or supporting things, services, or staff that are added to the main part of something.","zh":"（通常用复数）附加的、配套的事物/服务/人员，用来支持主要部分。"},"examples":[{"en":"The base price covers the room; ancillaries like breakfast and parking cost extra.","zh":"基础价格只包含房间；早餐和停车等附加服务要另外收费。"},{"en":"Hospitals often outsource ancillaries such as laundry and food services.","zh":"医院常把洗衣、餐饮等配套服务外包出去。"}]},{"partOfSpeech":"adj.","definition":{"en":"providing support; secondary to the main thing; additional.","zh":"辅助的；次要的；附加的（相对于主要部分）。"},"examples":[{"en":"The course includes ancillary materials like worksheets and short videos.","zh":"这门课包含练习单和短视频等辅助材料。"},{"en":"Please handle the ancillary tasks after you finish the main report.","zh":"主报告完成后再处理那些附带的任务。"}]}],"synonyms":["supplements","add-ons","extras","accessories","supporting services","secondary"],"phonetic":"/ænˈsɪləri/","extraExplanation":["“Ancillary”来自拉丁语 *ancilla*（女仆、侍女），引申为“起辅助作用的”。在商业、医疗、航空等领域很常见：例如航空公司的 *ancillary fees/revenue* 指行李、选座、餐食等额外收费/收入。"]}
{"word":"ancillarity","summary":{"en":"Ancillarity means being secondary or supportive; in statistics, it means a statistic’s distribution does not depend on unknown parameters.","zh":"Ancillarity 指“辅助/从属的状态”；在统计学中指某统计量的分布不依赖于未知参数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(General) the state of being auxiliary or secondary; a supporting role.","zh":"（一般）从属/辅助的状态；起支持作用的角色。"},"examples":[{"en":"In the project, design was central and testing had an ancillarity role.","zh":"在这个项目中，设计是核心，而测试起的是辅助作用。"},{"en":"Her duties included many tasks of ancillarity, like scheduling and filing.","zh":"她的工作包含许多辅助性任务，比如安排日程和归档。"}]},{"partOfSpeech":"n.","definition":{"en":"(Statistics) the property of a statistic being *ancillary*: its probability distribution does not depend on the unknown parameter(s) being estimated.","zh":"（统计学）“辅助统计量（ancillary statistic）”的性质：某统计量的分布不依赖于待估计的未知参数。"},"examples":[{"en":"In inference, ancillarity can help separate information about parameters from information about noise.","zh":"在统计推断中，辅助性（ancillarity）有助于把关于参数的信息与关于噪声的信息分开。"},{"en":"The professor discussed ancillarity when explaining conditional inference.","zh":"教授在讲条件推断时讨论了辅助性（ancillarity）。"}]}],"synonyms":["auxiliary role","secondary status","supporting function"],"phonetic":"/ˌæn.səˈlɛr.ə.ti/","extraExplanation":["词源：来自拉丁语 *ancilla*（女仆、侍女），引申为“辅助的、从属的”。与形容词 *ancillary*（辅助的）同源。","统计学语境中，ancillarity 常与 R. A. Fisher 的“条件推断（conditional inference）”思想相关：如果某统计量对参数“没有信息”（分布不随参数变），它可以用来做条件化，从而改进推断的合理性。"]}
{"word":"ancillary","summary":{"en":"Ancillary means “additional and supportive; secondary but helpful,” and can also refer to supportive people or services in formal settings.","zh":"Ancillary 指“辅助的、附属的；次要但有用的”，也可指正式语境中的辅助人员或配套服务。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Providing additional support or help; secondary but useful.","zh":"辅助的；附属的；提供额外支持的（次要但有用）。"},"examples":[{"en":"The app offers ancillary features like reminders and tips.","zh":"这个应用提供像提醒和小贴士这样的辅助功能。"},{"en":"Ancillary staff help the nurses and doctors do their jobs smoothly.","zh":"辅助人员帮助护士和医生更顺利地开展工作。"}]},{"partOfSpeech":"n.","definition":{"en":"A person, service, or thing that provides support or extra help (often in formal contexts).","zh":"辅助人员；附属服务/物品（常用于较正式语境）。"},"examples":[{"en":"The hospital relies on ancillaries such as lab technicians and cleaners.","zh":"医院依赖化验技师、清洁人员等辅助人员。"},{"en":"You may be charged for ancillaries like checked bags.","zh":"托运行李等附加服务可能会收费。"}]}],"synonyms":["supplementary","supporting","additional","secondary","auxiliary"],"phonetic":"/ænˈsɪləri/","extraExplanation":["“ancillary”常见于商务、医疗、法律、航空等正式场景，表示“主项之外的配套/附加”。比如：ancillary services（附属/配套服务）、ancillary costs（附带费用）。","词源来自拉丁语 ancilla（女仆/侍女），引申为“帮忙的、辅助的”。现代使用中多为中性含义，强调“支持主功能/主业务”。"]}
{"word":"ancillas","summary":{"en":"Ancillas is the plural of ancilla, meaning (1) handmaids/servant women in formal or old-fashioned use, and (2) in specialized contexts, helpers or auxiliary/supporting persons or things.","zh":"ancillas 是 ancilla 的复数，常指（1）侍女/女仆（较正式或古旧），也可在专门语境中指（2）辅助者或辅助性的人员/事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"female servant; handmaid (a formal or old-fashioned word)","zh":"女仆；侍女（较正式或古旧用法）"},"examples":[{"en":"In the novel, an ancilla quietly attends the queen’s daily needs.","zh":"在小说里，一位侍女安静地照料王后的日常起居。"},{"en":"The letter mentions “ancillas and attendants” who worked behind the scenes.","zh":"信中提到在幕后工作的“侍女和随从”。"}]},{"partOfSpeech":"n.","definition":{"en":"(specialized) a helper or secondary person/thing that supports the main one","zh":"（专门用语）辅助者；配角；起辅助作用的事物"},"examples":[{"en":"The chief researcher was supported by several ancillas who handled routine measurements.","zh":"首席研究员由几位“辅助人员”支持，他们负责常规测量。"},{"en":"In technical writing, an ancilla can mean an auxiliary component rather than the main unit.","zh":"在技术写作中，ancilla 可指辅助部件，而非主装置。"}]}],"synonyms":["handmaids","servant women","attendants","helpers","auxiliaries"],"phonetic":"/ænˈsɪləz/","extraExplanation":["“ancilla”来自拉丁语，基本意思是“女仆/侍女”。因此在宗教或文学语境里常带有庄重、谦卑的语感。","天主教传统中常见短语“Ancilla Domini”（意为“主的婢女/上主的侍女”），常用来指圣母玛利亚的自称（对应《圣经》路加福音 1:38 的表达）。"]}
{"word":"ancille","summary":{"en":"Ancille is a rare, literary word meaning a female servant or handmaid.","zh":"ancille 是一个较少见、偏文学的词，意思是“女仆/侍女”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female servant or attendant; a handmaid (literary or formal).","zh":"女仆；侍女；女随从（偏文学或正式用语）"},"examples":[{"en":"In the novel, an ancille waits quietly at the queen’s door.","zh":"在小说里，一名侍女静静地守在王后的门外。"},{"en":"She spoke to the ancille as if she were invisible.","zh":"她对那名侍女说话时，仿佛对方不存在一样。"}]}],"synonyms":["handmaid","maidservant","attendant","servant"],"phonetic":"/ænˈsɪl/","extraExplanation":["“ancille”在英语中很少见，带有法语/拉丁语的文雅色彩，常出现在历史、宗教或文学语境里。","词源可追溯到拉丁语 *ancilla*（女仆）。在基督教传统中常见短语 **Ancilla Domini**（“主的婢女/上主的侍女”），用于指圣母玛利亚的自称。"]}
{"word":"ancipital","summary":{"en":"Anciptial means “two-headed” (especially in anatomy) or, more rarely, “double-edged.”","zh":"ancipital 指“（尤指解剖学中）双头的”，更少见时也可指“双刃的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy) Having two heads or two points of attachment; two-headed (often used of a muscle).","zh":"（解剖）有两个“头”或两个附着点的；双头的（常指肌肉）。"},"examples":[{"en":"The biceps is an ancipital muscle with two heads near the shoulder.","zh":"肱二头肌是一块 ancipital（双头）肌肉，在肩部附近有两个肌头。"},{"en":"In some texts, a muscle may be described as ancipital when it has two distinct origins.","zh":"在一些教材中，若一块肌肉有两个明显的起点，可能会被描述为 ancipital（双起源/双头）。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having two opposite sides or edges; double-edged (rare, literary/scientific).","zh":"有两个相对的面或刃；双刃的（少见，多见于文学或学术语境）。"},"examples":[{"en":"He spoke of a decision as ancipital—helpful in one way, harmful in another.","zh":"他把这个决定说成是 ancipital（双刃的）——一方面有益，另一方面有害。"},{"en":"The ancipital blade cut cleanly on both strokes.","zh":"这把 ancipital（双刃）的刀在两个方向的挥砍都很利落。"}]}],"synonyms":["two-headed","bicipital","double-edged","two-pronged"],"phonetic":"/ænˈsɪpɪtəl/","extraExplanation":["该词较少见，主要出现在解剖学或较“书面/古典”的表达里。词源来自拉丁语 *anceps*（意为“两头的、双刃的”），由 *amb-*（两者、双）+ *caput*（头）构成，因此在医学里常用来表达“有两个肌头/两端”的概念。日常英语中更常用的替代词是 **two-headed**（双头的）或 **double-edged**（双刃的）。"]}
{"word":"ancipitous","summary":{"en":"Ancipientous means “two-sided” or “ambiguous,” often suggesting uncertain outcomes or mixed effects.","zh":"ancipitous 表示“具有两面性/模棱两可”，常暗示结果不确定或利弊并存。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having two opposite sides or effects; ambiguous, uncertain, or capable of being understood in more than one way","zh":"（结果或含义）两面性的；模棱两可的；不确定的"},"examples":[{"en":"The report’s conclusions were ancipitous, allowing both sides to claim victory.","zh":"这份报告的结论很“ancipitous”（两面性很强），双方都能据此宣称自己赢了。"},{"en":"Her ancipitous smile made it hard to tell whether she approved or criticized.","zh":"她那抹两面难辨的微笑，让人很难判断她是在赞同还是在批评。"}]}],"synonyms":["ambiguous","equivocal","uncertain","two-sided","double-edged"],"phonetic":"/ænˈsɪpɪtəs/","extraExplanation":["“ancipitous”是一个较少见、偏书面/文学的词，来自拉丁语“ancipitis”，字面含义接近“有两刃的、两头都锋利的”。因此它常用来比喻“事情具有两面性、结果难料、话语含义不止一个”。","近义词里“ambiguous”最常见；“ancipitous”更强调“左右都可能”“利弊并存/走向不定”的感觉，语气更文学化。"]}
{"word":"Ancistrocladaceae","summary":{"en":"Ancistrocladaceae is the botanical family name for a small group of mainly tropical climbing plants, especially the genus Ancistrocladus.","zh":"Ancistrocladaceae 指钩藤科，是一个较小的植物科，主要为热带攀援植物，以钩藤属（Ancistrocladus）为代表。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant family (the Ancistrocladaceae) consisting mainly of tropical climbing shrubs or lianas, best known for the genus Ancistrocladus","zh":"一种植物科名（钩藤科 Ancistrocladaceae），主要为热带地区的攀援灌木或藤本植物，以钩藤属（Ancistrocladus）最为著名"},"examples":[{"en":"Ancistrocladaceae is a small family found mainly in tropical regions.","zh":"钩藤科是一个较小的植物科，主要分布在热带地区。"},{"en":"In this paper, we compare leaf traits across Ancistrocladaceae and related families.","zh":"本文比较了钩藤科与其近缘科的叶片特征。"}]}],"synonyms":["Ancistroclad family (less common)"],"phonetic":"/ˌæn.sɪˌstroʊ.kləˈdeɪ.si.iː/","extraExplanation":["“Ancistrocladaceae”是拉丁化的植物分类名称，常见于植物学论文、标本标签和分类数据库中；日常英语里很少使用。","该科名来自代表属 Ancistrocladus（钩藤属）。其中 ancistro- 有“钩、弯钩”的含义，cladus 与“枝条/分枝”有关，暗示其攀援、具钩状结构等形态特征。","在阅读学术文本时，你也可能看到它与 Dioncophyllaceae 等热带类群一起被讨论（不同分类系统中其亲缘关系的处理可能略有差异）。"]}
{"word":"ancistrocladaceae","summary":{"en":"Ancistrocladaceae: a small tropical plant family (hook-vines), mainly the genus Ancistrocladus.","zh":"Ancistrocladaceae：钩藤科，一个较小的热带植物科，主要包含钩藤属（Ancistrocladus）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant family (the hook-vine family) that includes the genus Ancistrocladus, consisting mainly of tropical climbing woody plants.","zh":"（植物学）钩藤科：一个植物科，主要包含钩藤属（Ancistrocladus），多为热带地区的木质藤本植物。"},"examples":[{"en":"Ancistrocladaceae is a small family found mainly in tropical Africa and parts of Asia.","zh":"钩藤科是一个较小的植物科，主要分布在热带非洲及亚洲部分地区。"},{"en":"In a botany lecture, we learned that Ancistrocladaceae belongs to the order Caryophyllales.","zh":"在植物学课上，我们学到钩藤科属于石竹目（Caryophyllales）。"}]}],"synonyms":["the Ancistrocladaceae family","hook-vine family"],"phonetic":"/ænˌsɪstroʊˈkleɪdiːeɪsiˌiː/","extraExplanation":["“Ancistrocladaceae”是学术性很强的分类学名称，日常英语中极少使用，多见于植物分类、生态学、药用植物或天然产物化学的论文与教材。","词源上常可拆解理解：Ancistro-（与“钩、弯钩”相关）+ clad-（与“枝、分枝”相关）+ -aceae（植物科名常见后缀，读到这个后缀通常就能判断是“某某科”）。"]}
{"word":"Ancistrocladaceae-related","summary":{"en":"An adjective meaning “connected with the plant family Ancistrocladaceae.”","zh":"形容词，表示“与钩枝藤科（Ancistrocladaceae）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to, belonging to, or connected with the plant family Ancistrocladaceae (a small family of tropical woody vines).","zh":"与钩枝藤科（Ancistrocladaceae，一类热带木质藤本植物的小科）有关的；属于或涉及钩枝藤科的。"},"examples":[{"en":"The lab screened several Ancistrocladaceae-related extracts for potential antiviral activity.","zh":"实验室筛选了几种钩枝藤科相关的提取物，以评估其潜在的抗病毒活性。"},{"en":"Ancistrocladaceae-related compounds have attracted attention in natural-products research.","zh":"钩枝藤科相关化合物在天然产物研究中引起了关注。"}]}],"synonyms":["related to Ancistrocladaceae","Ancistrocladaceae-associated","Ancistrocladaceae-linked"],"phonetic":"/ˌæn.sɪ.stroʊˌklædˈeɪ.si.iː rɪˈleɪ.tɪd/","extraExplanation":["这是一个“专门领域用法”的复合形容词：Ancistrocladaceae（钩枝藤科）+ related（相关的）。多见于植物学、药用植物、化学/天然产物等学术写作中，用来概括“与该科植物有关的样本/化合物/特征”。","读写提示：在论文里它常修饰名词，如 “Ancistrocladaceae-related alkaloids（钩枝藤科相关生物碱）”“Ancistrocladaceae-related species（钩枝藤科相关物种）”。如果表达更正式，也可写成 “related to Ancistrocladaceae”。"]}
{"word":"ancistrocladaceous","summary":{"en":"A very technical adjective meaning “of or related to the plant family Ancistrocladaceae.”","zh":"非常专业的形容词，表示“与钩枝藤科（Ancistrocladaceae）有关的；属于钩枝藤科的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the plant family Ancistrocladaceae (a small tropical family of woody vines/lianas).","zh":"与钩枝藤科（Ancistrocladaceae，一类热带木质藤本植物的小科）有关的；属于钩枝藤科的。"},"examples":[{"en":"Researchers described several ancistrocladaceous specimens collected from West African forests.","zh":"研究人员描述了在西非森林采集到的若干钩枝藤科标本。"},{"en":"The paper focuses on ancistrocladaceous plants and their chemical compounds.","zh":"这篇论文重点讨论钩枝藤科植物及其化学成分。"}]}],"synonyms":["Ancistrocladaceae-related","of the Ancistrocladaceae"],"phonetic":"/ˌænˌsɪstroʊkləˈdeɪʃəs/","extraExplanation":["这是一个非常专业的植物学形容词，来自科名 Ancistrocladaceae + -aceous（“……的；……类的”）。在一般英语中几乎不会出现，多见于分类学、植物志或药用植物化学的学术写作。","钩枝藤科以热带木质藤本为主，常见属名是 Ancistrocladus；一些研究会关注其天然产物（植物化学成分）与潜在药用价值。"]}
{"word":"Ancistrocladus","summary":{"en":"Ancistrocladus is a genus of tropical climbing plants (lianas), mainly in Africa and Southeast Asia.","zh":"Ancistrocladus 指钩枝藤属：一种主要分布在非洲与东南亚的热带攀援藤本植物属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical climbing plants (lianas) in the family Ancistrocladaceae, found mainly in Africa and Southeast Asia.","zh":"钩枝藤属（Ancistrocladus）：钩枝藤科（Ancistrocladaceae）的一属热带攀援植物（藤本），主要分布于非洲和东南亚。"},"examples":[{"en":"Ancistrocladus species are woody vines that climb by using hooked branches.","zh":"钩枝藤属的植物多为木质藤本，常借助带钩的枝条攀爬。"},{"en":"Some Ancistrocladus plants have attracted scientific interest because they contain unusual natural compounds.","zh":"部分钩枝藤属植物因含有特殊的天然化合物而受到科研关注。"}]}],"synonyms":["genus (taxonomy term)","liana (related term)","Ancistrocladaceae (plant family)"],"phonetic":"ˌæn.sɪˈstrɑː.klə.dəs","extraExplanation":["这是一个拉丁学名（属名），在日常英语里不常见，更多出现在植物学、药用植物研究与化学（天然产物）相关文献中。","词源常被解释为源自希腊语：ankistron（“钩”）+ klados（“枝条/枝”），呼应一些物种具有“钩状枝条”以帮助攀援的特征。","在学术文章中它通常以斜体出现（Ancistrocladus），首字母大写；若指单个物种，会写成“Ancistrocladus + 种加词”，例如 Ancistrocladus korupensis（属名大写、种加词小写）。"]}
{"word":"ancistrocladus","summary":{"en":"Ancistrocladus is a scientific genus name for certain tropical climbing plants.","zh":"Ancistrocladus 是某些热带攀缘藤本植物的科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical climbing plants (lianas) in the family Ancistrocladaceae, found mainly in Africa and Southeast Asia.","zh":"一种热带攀缘植物（藤本）属名，隶属钩枝藤科（Ancistrocladaceae），主要分布于非洲和东南亚。"},"examples":[{"en":"Ancistrocladus species are woody climbers that often grow in humid tropical forests.","zh":"Ancistrocladus 属的植物多为木质藤本，常见于潮湿的热带森林。"},{"en":"Researchers have studied Ancistrocladus plants for their unusual natural compounds.","zh":"研究人员研究过 Ancistrocladus 植物，因为它们含有一些特殊的天然化合物。"}]}],"synonyms":["(no common synonym; a scientific genus name)"],"phonetic":"/ˌæn.sɪˈstroʊ.klə.dəs/","extraExplanation":["该词是拉丁化的植物学属名，常见于学术论文与植物志中；日常英语里很少单独使用。","部分 Ancistrocladus 物种因含有生物碱等天然产物而进入药物化学与天然产物研究领域（注意：这不等同于可直接用于治疗）。","拼写提示：Ancistrocladus 常被误写为 *ancistrocladus*（大小写不规范）或与近似的拉丁学名混淆；作为属名在英文中通常首字母大写。"]}
{"word":"ancistrodon","summary":{"en":"Ancistrodon is an older scientific name for a genus of venomous pit vipers, now usually called Agkistrodon.","zh":"Ancistrodon 是一个较旧的科学属名，指某些有毒坑蝮类；现在通常使用 Agkistrodon。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former scientific genus name for certain North American venomous pit vipers (especially the copperhead and cottonmouth); now usually classified under the genus Agkistrodon","zh":"（旧）某些北美洲有毒蝮蛇（坑蝮类，如铜头蝮、棉口蝮）的属名；现多归入 Agkistrodon（蝮属）"},"examples":[{"en":"In older books, the copperhead may be listed as Ancistrodon contortrix.","zh":"在较旧的书里，铜头蝮可能被写作 Ancistrodon contortrix。"},{"en":"Modern field guides usually use the genus name Agkistrodon instead of Ancistrodon.","zh":"现代野外图鉴通常使用 Agkistrodon，而不是 Ancistrodon。"}]}],"synonyms":["Agkistrodon"],"phonetic":"/ænˈsɪstrəˌdɑn/","extraExplanation":["“Ancistrodon”多见于较早的动物分类文献，是一种历史用法；后来分类修订后，常见种（如铜头蝮、棉口蝮）一般放在属名“Agkistrodon”之下。阅读旧资料时遇到它，可以把它理解为“Agkistrodon 的旧称”。"]}
{"word":"ancistroid","summary":{"en":"Ancestroid (often misspelled as “ancistroid”) is a rare word meaning “ancestor-like” or “resembling an ancestral form.”","zh":"Ancestroid（常被误拼为“ancistroid”）是个罕用词，意思是“像祖先的/呈祖先形态的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Resembling or related to an ancestor; ancestral-like.","zh":"（罕用）像祖先的；与祖先有关的；近似“祖先式/祖先型”的。"},"examples":[{"en":"The museum displayed ancestroid tools that looked similar to those used by early humans.","zh":"博物馆展出了带有祖先风格的工具，看起来与早期人类使用的很相似。"},{"en":"Some writers use “ancestroid” to describe a figure that feels like an ancestor returned.","zh":"有些作者用“ancestroid”来形容一种仿佛祖先再现的形象。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) Something that resembles an ancestor or an ancestral form.","zh":"（罕用）像祖先（或祖先形态）的事物；祖先式的形态/类型。"},"examples":[{"en":"In the story, the hero meets an ancestroid—part human, part memory.","zh":"在故事里，英雄遇到一个“祖先式存在”——一半是人，一半是记忆。"}]}],"synonyms":["ancestral","ancestor-like","primitive","archaic"],"phonetic":"/ænˈsɛstrɔɪd/","extraExplanation":["“ancistroid”很可能是拼写错误，更常见的拼法是 **ancestroid**。这个词非常少见，日常英语里通常用 **ancestral**（祖先的）、**ancestor-like**（像祖先的）来表达。","词尾 **-oid** 的意思是“……状的/类似……的”（如 *humanoid* 类人形的），所以 *ancestroid* 字面上就是“像祖先的/祖先状的”。"]}
{"word":"Ancius","summary":{"en":"“Ancius” is usually a rare proper name, not a standard English word.","zh":"“Ancius”通常是少见的专有名词（人名/姓氏），不是标准常用英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare proper name (Latin/Roman-style surname), sometimes seen in historical or fictional contexts; not a common modern English vocabulary word.","zh":"一个较少见的专有名词（带拉丁/古罗马风格的姓氏），偶尔出现在历史或文学/虚构语境中；不是现代英语里常用的词汇。"},"examples":[{"en":"In the novel, Ancius is the name of a minor Roman official.","zh":"在小说里，Ancius 是一位小罗马官员的名字。"},{"en":"The inscription lists several family names, including Ancius.","zh":"碑文列出了一些家族名称，其中包括 Ancius。"}]}],"phonetic":"/ˈænsiəs/","extraExplanation":["“Ancius”本身在现代英语里并不是常见词。如果你是在写作、字幕或笔记里看到它，它更可能是人名/家族名（带古典拉丁风格）。","也有一种常见情况是拼写误差：你可能想查的是 **anxious**（焦虑的、担心的，IPA: /ˈæŋkʃəs/）或 **ancient**（古老的，IPA: /ˈeɪnʃənt/）。如果你把原句发我，我可以帮你判断到底是哪一个。"]}
{"word":"ancle","summary":{"en":"An ankle is the joint just above your foot that connects your foot to your leg.","zh":"Ankle 指脚上方连接脚与小腿的关节，即脚踝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the joint that connects your foot to your leg; the part of the body just above the foot","zh":"脚踝；连接脚与小腿的关节（脚上方的部位）"},"examples":[{"en":"I twisted my ankle while running.","zh":"我跑步时扭伤了脚踝。"},{"en":"Her ankle was swollen after the fall.","zh":"她摔倒后脚踝肿了。"},{"en":"Wear shoes that support your ankles.","zh":"穿能支撑脚踝的鞋子。"}]}],"synonyms":["(no exact synonym)","ankle joint"],"phonetic":"/ˈæŋkəl/","extraExplanation":["你输入的“ancle”通常是拼写错误，正确拼写是“ankle”。","“ankle”常见搭配：twist/sprain/break an ankle（扭伤/拉伤/骨折脚踝）、ankle pain（脚踝疼）、ankle brace（护踝）。","与相关身体部位对比：wrist（手腕）是手和前臂连接处；ankle（脚踝）是脚和小腿连接处。"]}
{"word":"Anco","summary":{"en":"“anco” is a Scots dialect word meaning “unknown/strange” or “a stranger,” and it sounds old-fashioned in modern English.","zh":"“anco”是苏格兰方言词，表示“未知的/陌生的”或“陌生人”，在现代英语中带有古旧感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Scots, dialect; old-fashioned) unknown; strange; unfamiliar.","zh":"（苏格兰方言；较古旧）未知的；陌生的；不熟悉的。"},"examples":[{"en":"He gave me an anco look, as if I were a stranger.","zh":"他用一种陌生的眼神看着我，好像我就是个外人。"},{"en":"That’s an anco word—I’ve never heard it before.","zh":"那是个陌生的词——我以前从没听过。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scots, dialect; old-fashioned) a stranger; someone unknown.","zh":"（苏格兰方言；较古旧）陌生人；不认识的人。"},"examples":[{"en":"An anco walked into the inn and asked for directions.","zh":"一个陌生人走进小酒馆问路。"}]}],"synonyms":["unknown","strange","unfamiliar","stranger"],"phonetic":"/ˈæŋkoʊ/","extraExplanation":["“anco”主要见于苏格兰英语（Scots）或文学/历史语境，在现代标准英语里很少使用。日常英文更常用 unknown / strange / unfamiliar（形容词）或 stranger（名词）。","在阅读苏格兰题材的诗歌、民谣或历史小说时可能会遇到该词；它常用来营造地方色彩（dialect flavor）。"]}
{"word":"ancodont","summary":{"en":"An anecdote is a short, interesting true story, often used to illustrate a point.","zh":"Anecdote 指简短有趣的真实小故事，常用来说明观点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short, interesting (often funny or revealing) story about a real person or event, usually told to make a point","zh":"轶事；趣闻（通常简短、有趣，常用来说明一个观点或体现某种特质的真实小故事）"},"examples":[{"en":"She began her speech with an anecdote about her first day at work.","zh":"她以一个关于自己第一天上班的轶事开始了演讲。"},{"en":"He told a funny anecdote from his childhood.","zh":"他讲了一个童年时期的搞笑轶事。"},{"en":"The article is full of anecdotes, but it needs more facts and data.","zh":"这篇文章充满轶事，但需要更多事实和数据。"}]}],"synonyms":["story","tale","account"],"phonetic":"/ˈænɪkˌdoʊt/","extraExplanation":["你输入的“ancodont”通常不是标准英文拼写；最可能想表达的是“anecdote”。正确拼写是 a-n-e-c-d-o-t-e。","常见搭配：tell an anecdote（讲轶事/趣闻）；a personal anecdote（个人轶事）；an amusing anecdote（有趣的轶事）。","区分：anecdote（轶事）≠ evidence（证据）。轶事能让表达更生动，但在正式论证中通常不能代替数据与证据。"]}
{"word":"Ancohuma","summary":{"en":"Ancohuma is a major mountain peak in Bolivia’s Cordillera Real.","zh":"Ancohuma（安科乌马峰）是玻利维亚科迪勒拉雷亚尔山系的一座重要高峰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A high mountain in the Cordillera Real of Bolivia (near La Paz), known for being a prominent Andean peak and a destination for mountaineers.","zh":"安科乌马峰：玻利维亚安第斯山脉科迪勒拉雷亚尔山系中的一座高山（靠近拉巴斯），以醒目的山体与登山活动而知名。"},"examples":[{"en":"Ancohuma is one of the major peaks visible from the Lake Titicaca region on clear days.","zh":"在天气晴朗时，从的的喀喀湖周边有时能看到安科乌马峰等主要山峰。"},{"en":"The team planned an acclimatization schedule before attempting Ancohuma.","zh":"队伍在攀登安科乌马峰前制定了适应高海拔的计划。"}]}],"synonyms":["Nevado Ancohuma"],"phonetic":"ˌɑŋkoʊˈhuːmə","extraExplanation":["“Ancohuma”是专有名词（山峰名），常见于地理、旅行与登山语境。它通常与玻利维亚的科迪勒拉雷亚尔（Cordillera Real）一起被提及。","在英文文本中，你也可能看到它与附近其他著名山峰并列出现，如 Illimani、Huayna Potosí 等；这些都属于同一地区常见的高海拔登山目的地。"]}
{"word":"ancoly","summary":{"en":"“Ancoly” is likely a misspelling of “acolyte,” meaning a religious assistant or a devoted follower/assistant.","zh":"“ancoly”很可能是“acolyte”的误拼，指（宗教仪式的）辅祭/助手，也可指某人的忠实追随者或助手。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended word) A person who assists a priest or leader in a religious service; more generally, a devoted follower or assistant of an important person.","zh":"（可能你想查的是）“acolyte”：（宗教仪式中）协助神职人员的人；也可泛指某位重要人物的忠实追随者或助手。"},"examples":[{"en":"The acolyte carried candles during the ceremony.","zh":"这位辅祭在仪式中手持蜡烛。"},{"en":"She became an acolyte of the famous designer, learning everything from him.","zh":"她成了那位著名设计师的追随者/助手，从他那里学习一切。"}]}],"synonyms":["assistant","follower","disciple","attendant"],"phonetic":"/ˈækəlaɪt/","extraExplanation":["“ancoly”不是常见英文单词，最接近、也最常被误拼的可能是“acolyte”。","“acolyte”源自希腊语，含义与“跟随、随从”有关，所以除了宗教语境外，也常用于比喻意义：某人的“门徒/追随者”。","常见搭配：an acolyte of + 人/思想（某人的追随者）；也可与“devoted/young/faithful acolyte”等形容词连用。"]}
{"word":"ancome","summary":{"en":"“ancome” is not a standard English word; it’s likely a misspelling or a proper name. Share context to identify the intended word.","zh":"“ancome”不是标准英语词，更可能是拼写错误或专有名词；提供语境可帮助确定你想表达的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries. It is most likely a misspelling of another word (for example, “ancom” = anarcho-communist, or “encounter/come” in context).","zh":"不是常见英语词典中的标准词。更可能是其他词的拼写错误（例如“ancom”=无政府共产主义者，或在语境中想表达“encounter/come”等）。"},"examples":[{"en":"I couldn’t find “ancome” in the dictionary—did you mean “ancom” or another word?","zh":"我在词典里找不到“ancome”——你是想写“ancom”还是别的词？"},{"en":"If you share the sentence where you saw “ancome,” I can help identify the intended word.","zh":"如果你把看到“ancome”的句子发出来，我可以帮你判断原本想表达的词。"}]}],"phonetic":"/ˈænkoʊm/","extraExplanation":["“ancome”本身不常见；更像是拼写/听写错误。常见的相近形式有：\n1) ancom：网络缩写，指 anarcho-communist（无政府共产主义者/无政府共产主义的）。\n2) Lancome / Lancôme：品牌名（兰蔻），有时在输入时会丢掉首字母。\n3) 也可能是某个专有名词（人名/地名/公司名）。\n\n建议你提供：你看到它的原句、主题（政治/化妆品/人名等）、或发音（你怎么读），我就能更准确给出词条和释义。"]}
{"word":"Ancon","summary":{"en":"Ancon is most commonly a place name (notably a coastal district near Lima, Peru). More rarely, it can mean “elbow” or an elbow-shaped architectural support.","zh":"Ancon 最常见是地名（尤其指秘鲁利马附近的沿海地区 Ancón）。较少见时可指“肘”或建筑中的肘形支撑构件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name, especially Ancón/Ancon: a coastal district north of Lima, Peru (also used for other places in Latin America, e.g., in Panama City).","zh":"地名，常指安孔/Ancón：秘鲁利马以北的沿海地区（在拉丁美洲其他地方也可能见到该地名，如巴拿马城一带）。"},"examples":[{"en":"We took a day trip from Lima to Ancon to see the beach.","zh":"我们从利马去安孔一日游看海滩。"},{"en":"Ancon is mentioned in some travel guides about the coast near Lima.","zh":"一些旅行指南会提到利马附近海岸的安孔。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) the elbow; by extension, an elbow-shaped support in architecture (like a bracket or corbel).","zh":"（罕见）肘部；引申为建筑中“肘形”的支撑构件（类似托架/牛腿）。"},"examples":[{"en":"In older texts, ancon can mean “elbow.”","zh":"在较旧的文本里，ancon 有时表示“肘”。"},{"en":"The stone ancon supported the edge of the balcony.","zh":"这块石质肘形托架支撑着阳台边缘。"}]}],"synonyms":["Ancón","place name","(rare) elbow","(architecture) bracket","corbel"],"phonetic":"ɑnˈkoʊn","extraExplanation":["“Ancón/Ancon”作为地名多见于西班牙语地区；西语 ancon/ancón 与“肘、弯曲处”的意象有关，因此常用于描述海岸线、山体或城市地形的“弯曲/转折”位置。","如果你指的是专有名词（如秘鲁 Ancón 区或巴拿马的 Ancon/Ancón Hill），在英文资料中常保留西语拼写，有时带重音符号：Ancón。"]}
{"word":"ancon","summary":{"en":"Ancon is a rare word meaning “elbow,” and it also appears as a place name (often written Ancón in Spanish).","zh":"ancon 是个较少见的词，意思是“肘部”；它也可作为地名出现（西语常写作 Ancón）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy, rare) the elbow; the bend of the arm.","zh":"（解剖学，较少用）肘；手臂的弯曲处（肘部）。"},"examples":[{"en":"The old medical text uses the word ancon for the elbow.","zh":"这本旧医学书用 ancon 指“肘部”。"},{"en":"Pain around the ancon made it hard for him to lift anything.","zh":"肘部（ancon）附近疼痛，让他很难抬起东西。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name (proper noun), e.g., Ancón/Ancon in Spanish-speaking regions (often referring to a bay/cove area).","zh":"地名（专有名词），如西语地区的 Ancón/Ancon（常与海湾、海湾地形有关的地区名）。"},"examples":[{"en":"She stayed in Ancón while visiting the capital.","zh":"她在游览首都时住在安孔（Ancón）。"},{"en":"Ancon is also used in some English maps as a district name.","zh":"在一些英文地图上，Ancon 也被用作某个地区的名称。"}]}],"synonyms":["elbow"],"phonetic":"/ˈæŋkɑn/","extraExplanation":["“ancon”在现代英语里非常少见，主要会出现在旧医学/解剖学资料中，源自希腊语“ankōn”（意为“肘、弯曲处”）。","如果你看到的是带重音的西班牙语“Ancón”，它常与“海湾/小湾”相关，作为地名在拉丁美洲较常见；英语里有时会直接借用为 Ancon/Ancón。","若你是想查更常用的英文表达，日常说“elbow”即可。"]}
{"word":"Ancona","summary":{"en":"Ancona is a port city in central Italy on the Adriatic Sea, and the capital of the Marche region.","zh":"安科纳是意大利中部亚得里亚海沿岸的港口城市，也是马尔凯大区首府。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a port city in central Italy, on the Adriatic Sea; the capital of the Marche region","zh":"安科纳（意大利中部亚得里亚海沿岸的港口城市；马尔凯大区首府）"},"examples":[{"en":"Ancona is an important port on the Adriatic Sea.","zh":"安科纳是亚得里亚海沿岸的重要港口。"},{"en":"We took a train from Rome to Ancona before heading to the coast.","zh":"我们先从罗马坐火车到安科纳，然后去海边。"}]}],"phonetic":"/ænˈkoʊnə/","extraExplanation":["安科纳的名字常被认为与希腊语有关（意为“肘部/弯曲处”），因为它的海岸线形状像手肘，形成了天然港湾。","在旅行语境中，你可能会看到它作为前往亚得里亚海沿岸、以及去克罗地亚等地的渡轮出发港。","当地著名地标包括罗马时期的图拉真拱门（Arch of Trajan）。"]}
{"word":"ancona","summary":{"en":"Ancona is most commonly a port city in eastern Italy; it can also refer to a chicken breed.","zh":"Ancona最常指意大利东部的港口城市安科纳；也可指一种鸡的品种。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A port city in eastern Italy on the Adriatic Sea; the capital of the Marche region.","zh":"安科纳（意大利东部亚得里亚海沿岸的港口城市；马尔凯大区首府）。"},"examples":[{"en":"Ancona is a major port on Italy’s Adriatic coast.","zh":"安科纳是意大利亚得里亚海沿岸的重要港口。"},{"en":"We took a train from Bologna to Ancona.","zh":"我们从博洛尼亚坐火车到安科纳。"}]},{"partOfSpeech":"n.","definition":{"en":"Ancona (or Ancona chicken): a breed of chicken known for black-and-white speckled feathers and good egg-laying.","zh":"安科纳鸡（或称安科纳品种鸡）：一种鸡的品种，以黑白斑点羽毛和产蛋能力强著称。"},"examples":[{"en":"She keeps a few Ancona chickens for fresh eggs.","zh":"她养了几只安科纳鸡来获取新鲜鸡蛋。"}]}],"phonetic":"/ɑnˈkoʊnə/","extraExplanation":["“Ancona”是专有名词，常见于旅行、地理、新闻等语境；作为城市名通常不加冠词（说“in Ancona”）。","发音重音在第二音节：an-CO-na。","在英文里也能见到“Ancona chicken / Anconas”指鸡的品种，语境多出现在养殖、农业或家庭农场相关话题中。"]}
{"word":"anconad","summary":{"en":"Anaconda most commonly means a very large South American snake; it can also refer to the Python distribution Anaconda.","zh":"Anaconda 最常指体型巨大的南美森蚺；也可指 Python 的发行版 Anaconda。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very large snake from South America (a type of boa) that kills prey by squeezing it","zh":"（南美洲的）森蚺；一种体型巨大的蚺类，通过缠绕挤压猎物使其窒息"},"examples":[{"en":"An anaconda can squeeze its prey until it cannot breathe.","zh":"森蚺可以把猎物缠到无法呼吸。"},{"en":"We saw an anaconda at the zoo.","zh":"我们在动物园看到了森蚺。"}]},{"partOfSpeech":"n.","definition":{"en":"a popular software distribution for Python used for data science (capitalized: Anaconda)","zh":"用于数据科学的 Python 软件发行版（首字母大写：Anaconda）"},"examples":[{"en":"I installed Anaconda to manage Python packages for my data project.","zh":"我安装了 Anaconda 来管理数据项目的 Python 包。"}]}],"synonyms":["boa","boa constrictor","constrictor"],"phonetic":"/ˌænəˈkɑːndə/","extraExplanation":["你输入的“anconad”很可能是拼写错误，正确常见拼写是 anaconda（森蚺）。","在英文里，动物名 anaconda 通常不大写；而软件名 Anaconda 作为专有名词一般要大写。"]}
{"word":"anconagra","summary":{"en":"“anconagra” is not a standard English word; it is most likely a misspelling of “Conagra / ConAgra,” a U.S. food company name.","zh":"“anconagra”不是标准英语词；最可能是“Conagra / ConAgra（美国食品公司名）”的误写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A misspelling or mistaken form of **Conagra / ConAgra**, the name of a large American packaged-food company and brand group (e.g., frozen meals, snacks).","zh":"**Conagra / ConAgra（康尼格拉）**的常见拼写错误或误写形式；指一家美国大型包装食品公司及其旗下品牌（如冷冻食品、零食等）。"},"examples":[{"en":"I think you meant **Conagra**, not *anconagra*.","zh":"我想你想写的是 **Conagra**，不是 *anconagra*。"},{"en":"Conagra sells many packaged foods in U.S. supermarkets.","zh":"Conagra 在美国超市里销售许多包装食品。"}]}],"synonyms":["Conagra","ConAgra"],"phonetic":"/kəˈnæɡrə/","extraExplanation":["“ConAgra”这个拼法常见于公司正式写法（中间大写的 A），来源与公司历史命名有关；日常写作中也常见 “Conagra”。","如果你是在食物包装、新闻或财经内容里看到类似词，通常指公司名而不是普通英语单词。"]}
{"word":"anconal","summary":{"en":"“Anconal” means “related to the elbow,” mainly used in medical/anatomy contexts.","zh":"anconal 指“与肘部有关的”，主要用于医学/解剖学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the elbow (especially the outer/back part) or to structures near the anconeus muscle.","zh":"与肘部（尤其是肘外侧/后侧）有关的；与肘肌（anconeus）附近结构有关的。"},"examples":[{"en":"The doctor noted an anconal tenderness after the fall.","zh":"医生注意到他摔倒后肘部后外侧有压痛。"},{"en":"The incision was made along the anconal side of the elbow.","zh":"切口沿着肘部后外侧（肘区）进行。"}]}],"synonyms":["anconeal","cubital","olecranal"],"phonetic":"/æŋˈkoʊnəl/","extraExplanation":["这是医学/解剖学用词，日常英语中很少见；在临床记录里常用来精确描述疼痛、切口或感觉分布的位置。","词源来自希腊语 ankōn（意为“肘”）。在解剖学里也常见相关词：anconeus（肘肌），anconeal（同义形容词）。"]}
{"word":"anconas","summary":{"en":"“Anconas” usually means Ancona chickens (a speckled, good egg-laying breed); rarely, it can be the plural of the Italian city Ancona.","zh":"“Anconas”通常指安科纳鸡（带白斑、善产蛋的鸡种）；少数情况下也可作意大利城市Ancona（安科纳）的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hardy breed of domestic chicken, usually black with white speckles, known for good egg-laying.","zh":"安科纳鸡（原产意大利的一种家鸡品种），常见为黑底带白斑，以产蛋能力强、适应力好著称。"},"examples":[{"en":"She keeps a small flock of Anconas for fresh eggs.","zh":"她养了一小群安科纳鸡来获得新鲜鸡蛋。"},{"en":"Anconas are often described as active, alert birds.","zh":"安科纳鸡常被形容为活跃、警觉的鸡。"}]},{"partOfSpeech":"n.","definition":{"en":"the plural form of “Ancona” (a city on Italy’s Adriatic coast), though this plural use is uncommon in everyday English.","zh":"Ancona（意大利亚得里亚海沿岸城市“安科纳”）的复数形式，但这种复数用法在日常英语中不常见。"},"examples":[{"en":"The itinerary compares the ports of Trieste and the Anconas of the central Adriatic.","zh":"行程对比了的里雅斯特港与亚得里亚海中部的几个安科纳港口。"}]}],"synonyms":["Ancona (chicken breed)"],"phonetic":"æŋˈkoʊnə","extraExplanation":["“Ancona”作为鸡的品种名，来源于意大利城市安科纳（Ancona）。英语里谈到这种鸡时常用复数“Anconas”来表示“几只/一群安科纳鸡”。","在家禽语境中，“Anconas”通常特指该鸡种；若写作地名复数则需要语境支持，否则更常见的是用“in Ancona / to Ancona”而不是复数。"]}
{"word":"ancone","summary":{"en":"“Ancone” is a rare word meaning “elbow,” mostly found in older or specialized anatomical writing.","zh":"“ancone” 是个较少见的词，意思是“肘/肘部”，多出现在较旧或专业的解剖学语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The elbow; especially the elbow area (often used in older medical/anatomical writing, and sometimes for animals).","zh":"肘；肘部（多见于较旧的医学/解剖学用语，有时也用于动物）。"},"examples":[{"en":"The pain spread from the wrist up to the ancone.","zh":"疼痛从手腕向上扩散到肘部。"},{"en":"In older texts, the ancone is described as a key joint for lifting and pulling.","zh":"在较早的文献中，肘部被描述为抬举和牵拉时的重要关节。"}]}],"synonyms":["elbow"],"phonetic":"/ˈæŋkoʊn/","extraExplanation":["该词非常少见，现代英语里通常直接用 elbow。你更可能在古典/医学解剖学文献或较文学化的描写中看到 ancone。","词源来自希腊语 ankōn（意为“肘”），经拉丁语传入英语，因此带有较强的古典色彩。"]}
{"word":"anconeal","summary":{"en":"An anatomical adjective meaning “related to the elbow,” especially the back of the elbow.","zh":"一个解剖学形容词，表示“与肘部有关”，尤其指肘后侧。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy) Relating to the elbow (especially the back of the elbow) or to the anconeus muscle.","zh":"（解剖）与肘部（尤其是肘后侧）有关的；与肘肌（anconeus muscle）有关的。"},"examples":[{"en":"The doctor checked the anconeal region for swelling and tenderness.","zh":"医生检查了肘后侧（anconeal region）是否有肿胀和压痛。"},{"en":"Pain near the anconeal area can sometimes be linked to overuse or strain.","zh":"肘后侧附近的疼痛有时与过度使用或拉伤有关。"}]}],"synonyms":["elbow (related)","olecranal (more specific: relating to the olecranon)"],"phonetic":"/æŋˈkoʊniəl/","extraExplanation":["“anconeal”常见于医学或解剖学语境，日常英语里更常说“elbow (area/region)”。","词源上与表示“肘”的古典词根有关（常见于医学术语），因此看起来更“学术化”。"]}
{"word":"anconei","summary":{"en":"Anconei is a rare plural form meaning the anconeus muscles (small elbow muscles).","zh":"Anconei 是较少见的复数形式，指肘肌（anconeus muscles），即肘部后方的小肌肉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy, plural; rare) the anconeus muscles—small muscles at the back of the elbow that help extend and stabilize the forearm.","zh":"（解剖学，复数；较少见）肘肌（anconeus）的复数形式——位于肘部后方的小肌肉，帮助伸肘并稳定前臂。"},"examples":[{"en":"Some older anatomy texts refer to the anconei when describing the muscles behind the elbow.","zh":"一些较老的解剖学教材在描述肘后方肌肉时会用到 anconei 这个复数形式。"},{"en":"Pain near the elbow may involve the triceps or the anconei.","zh":"肘部附近的疼痛可能与肱三头肌或肘肌（anconei）有关。"}]}],"synonyms":["anconeus muscles","the anconeus (muscle)"],"phonetic":"/ænˈkoʊni.aɪ/","extraExplanation":["“anconei”源自拉丁语/新拉丁语，用作“anconeus（肘肌）”的复数形式，在现代英语中更常见的写法是直接说“anconeus muscles”或“the anconeus (muscle)”。","该词多见于医学/解剖学语境，日常英语几乎不用；如果你是在论文、教材或标注图里看到它，通常就是指“肘肌（复数）”。"]}
{"word":"anconeous","summary":{"en":"Anconeous means “related to the elbow,” especially in medical/anatomy contexts; it can also refer to the anconeus muscle near the back of the elbow.","zh":"anconeous 指“与肘部有关的”，多用于医学/解剖语境；也可指肘后方的肘肌（更常写作 anconeus）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the elbow (especially the outer/back part of the elbow).","zh":"肘部的；与肘相关的（尤指肘外侧/后侧）。"},"examples":[{"en":"The therapist checked the anconeous area of the elbow for tenderness.","zh":"治疗师检查了肘部的肘侧区域是否有压痛。"},{"en":"Pain near the anconeous region can increase when you extend the arm.","zh":"靠近肘侧区域的疼痛在伸直手臂时可能会加重。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Referring to the small triangular muscle at the back of the elbow; often written as “anconeus.”","zh":"（较少见）指肘后方的小三角肌；更常写作 anconeus（肘肌）。"},"examples":[{"en":"The anconeous (anconeus) helps stabilize the elbow during extension.","zh":"肘侧（肘肌）在伸肘时有助于稳定肘关节。"},{"en":"In anatomy class, we identified the anconeous muscle near the ulna.","zh":"在解剖课上，我们辨认了靠近尺骨的肘侧肌肉。"}]}],"synonyms":["anconeal","elbow-related"],"phonetic":"/æŋˈkoʊniəs/","extraExplanation":["“anconeous”在现代英语里很少单独使用；医学与解剖学资料中更常见的是名词形式“anconeus（肘肌）”，或用“anconeal”作形容词。","词源来自希腊语 *ankōn*（肘），所以它多出现在正式、专业的肌肉/关节描述中，而不是日常对话。"]}
{"word":"ancones","summary":{"en":"Ancones is the plural of ancon, meaning either “elbows” (old/technical) or “architectural brackets/supports.”","zh":"ancones 是 ancon 的复数，可指“肘部”（较古老/专业）或“建筑中的托臂/支架”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of ancon) the elbow; an old or technical word used especially in anatomy.","zh":"（ancon 的复数）肘部；较古老或专业（多见于解剖学）的用词。"},"examples":[{"en":"The diagram labeled the ancones to show where the forearm bends at the elbow.","zh":"图示标出 ancones，用来说明前臂在肘部弯曲的位置。"},{"en":"Pain around the ancones can make lifting difficult.","zh":"肘部周围疼痛会让抬举变得困难。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural of ancon) in architecture, projecting brackets or supports (similar to corbels) used to hold up a cornice, balcony, or other structure.","zh":"（ancon 的复数）【建筑】托臂、支架（类似牛腿/托座），用于支撑檐口、阳台等结构。"},"examples":[{"en":"Stone ancones supported the cornice above the doorway.","zh":"门道上方的檐口由石质托臂（ancones）支撑。"},{"en":"The old facade had carved ancones under the balcony.","zh":"老建筑的外立面在阳台下有雕刻的托臂（ancones）。"}]}],"synonyms":["elbows","brackets","corbels","supports"],"phonetic":"/ˈæŋkɑn/","extraExplanation":["“ancon”源自希腊语 ankōn（意为“肘”）。在现代英语里非常少见，多出现在解剖学、古典建筑描述或较旧的文献中。日常英语一般直接说 elbow（肘部）。"]}
{"word":"anconeus","summary":{"en":"Anconeus is a small muscle at the back of the elbow that helps extend and stabilize the elbow joint.","zh":"anconeus（肘肌）是位于肘后方的小肌肉，帮助伸肘并稳定肘关节。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small triangular muscle at the back (posterior side) of the elbow that helps straighten the elbow and stabilize the joint","zh":"肘后方的一块小三角肌（肘肌），帮助伸直肘关节并稳定关节"},"examples":[{"en":"The anconeus assists the triceps when you straighten your arm.","zh":"当你伸直手臂时，肘肌会协助肱三头肌。"},{"en":"Pain near the outer back of the elbow can involve the anconeus or nearby tendons.","zh":"肘外侧后方的疼痛可能与肘肌或附近的肌腱有关。"}]}],"synonyms":["elbow muscle","anconeus muscle"],"phonetic":"/æŋˈkoʊniəs/","extraExplanation":["“anconeus”是解剖学/医学术语，日常英语里很少用，常见于运动医学、康复训练和解剖教材。","位置大致在肘关节后外侧，连接肱骨与尺骨；功能主要是协助伸肘（配合肱三头肌）并在屈伸时帮助肘关节更稳定。","词源来自希腊语，含义与“肘部”相关；发音以 /k/ 音为主，重音在第二个音节附近。"]}
{"word":"anconitis","summary":{"en":"A rare medical term meaning inflammation in the elbow area, often linked to tissues near the anconeus muscle.","zh":"较少见的医学词，指肘部区域（常与肘肌周围组织相关）的炎症。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation in or around the elbow region (especially involving tissues near the anconeus muscle).","zh":"肘部区域的炎症（尤其指与肘肌 anconeus 周围组织相关的炎症）。"},"examples":[{"en":"The doctor considered anconitis because the patient had pain and swelling at the back of the elbow.","zh":"医生考虑到可能是 anconitis，因为病人肘后方疼痛并肿胀。"},{"en":"Rest and anti-inflammatory treatment were recommended to reduce symptoms of anconitis.","zh":"建议休息并使用抗炎治疗来减轻 anconitis 的症状。"}]}],"synonyms":["elbow inflammation","olecranon bursitis (related condition)","tendinitis (related condition)"],"phonetic":"/ˌæŋkoʊˈnaɪtɪs/","extraExplanation":["这是较少见、偏医学用语的词，来自词根 ancon-（与“肘”有关）+ -itis（“炎症”）。在实际临床表达中，更常见的说法可能是更具体的诊断（如肘滑囊炎 olecranon bursitis、肌腱炎 tendonitis、或一般性的“elbow inflammation/痛”），而不一定直接使用 anconitis。","anconeus（肘肌）是肘后外侧附近的一块小肌肉，参与肘关节稳定与伸展相关动作；因此该词有时会被用来指肘后侧相关组织的炎症。"]}
{"word":"anconoid","summary":{"en":"Anconoid means “related to the elbow,” mainly used in medical/anatomy contexts.","zh":"anconoid 指“与肘部有关的”，主要用于医学/解剖学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the elbow or the area around the elbow (especially the back of the elbow).","zh":"与肘部有关的；肘部周围（尤指肘后部）的。"},"examples":[{"en":"The therapist noted mild pain in the anconoid region after the fall.","zh":"治疗师指出摔倒后肘部后侧（肘部相关区域）有轻微疼痛。"},{"en":"In anatomy class, we discussed anconoid structures near the elbow joint.","zh":"在解剖课上，我们讨论了靠近肘关节的肘部相关结构。"}]}],"synonyms":["anconeal","elbow-related"],"phonetic":"/æŋˈkoʊ.nɔɪd/","extraExplanation":["该词多见于解剖学、医学与兽医学语境，用来描述“与肘（elbow）有关”的结构或区域。","词源来自希腊语 ankon（意为“肘”），因此常与表示“肘”的其他词根（如 anconeal）在专业文本中互换或并列出现。"]}
{"word":"ancony","summary":{"en":"“Ancony” is a rare, old adjective meaning “having a bent or crooked elbow,” mostly found in older texts.","zh":"“Ancony”是很罕见的古旧形容词，意思是“肘部弯曲/呈角状”，多见于旧文。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, old-fashioned) Having a crooked or bent elbow; elbowed or angular, especially used in older descriptions of people or animals.","zh":"（罕见/古旧）肘部弯曲的；像手肘一样呈角状的（旧时多用于描述人或动物的体态）。"},"examples":[{"en":"The old text describes an “ancony” man with his arm bent sharply at the elbow.","zh":"那本旧书把一个“ancony”的男人描写成手臂在肘部明显弯曲。"},{"en":"In some older writings, a horse might be called ancony if its foreleg looked oddly bent near the elbow.","zh":"在一些旧文中，如果马的前肢靠近肘部看起来异常弯曲，可能会被称为 ancony。"}]}],"synonyms":["crooked","bent","angular","elbowed"],"phonetic":"/ˈæŋkəni/","extraExplanation":["“ancony”非常少见，现代英语里几乎不用；更常见的日常表达会说 “bent elbow / crooked elbow / angular arm”。","词源上与“ancon（肘）”有关；“ancon”本身也属较少见词，多出现在解剖学或古典/文学语境中。","如果你本来想查的是别的常见词（例如 anxiety, economy, or balcony），告诉我你看到它的句子/上下文，我可以帮你确认正确拼写和意思。"]}
{"word":"ancor","summary":{"en":"Anchor means a ship’s anchor, something that provides stability, or to secure/host (the news).","zh":"Anchor 指“船锚”，也可指“支柱/依靠”，并可作动词表示“固定”或“担任新闻主播”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a heavy metal object (often with hooks) that a ship drops into the water to hold it in place","zh":"（船的）锚；抛入水中用来固定船只位置的重金属装置（常带钩）"},"examples":[{"en":"The captain dropped the anchor near the island.","zh":"船长在岛附近下锚。"},{"en":"The boat lifted anchor at sunrise.","zh":"小船在日出时起锚。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or thing that provides stability, support, or a strong connection in a situation","zh":"（比喻）支柱；靠山；使局面稳定的人或事物"},"examples":[{"en":"Her family is her anchor during hard times.","zh":"在困难时期，家人是她的依靠。"},{"en":"In the group project, he was the anchor who kept everyone organized.","zh":"在小组项目里，他是让大家保持有序的主心骨。"}]},{"partOfSpeech":"vt.","definition":{"en":"to hold something firmly in place; to secure or attach strongly","zh":"使固定；稳固地系住/连接"},"examples":[{"en":"They anchored the tent with heavy rocks.","zh":"他们用大石头把帐篷固定住。"},{"en":"The bridge is anchored to the rock on both sides.","zh":"这座桥两端牢固地固定在岩石上。"}]},{"partOfSpeech":"v.","definition":{"en":"to present or lead a news program (as the main host)","zh":"（新闻）担任主播；主持新闻节目"},"examples":[{"en":"She anchors the evening news on TV.","zh":"她主持电视晚间新闻。"},{"en":"He anchored live coverage during the storm.","zh":"风暴期间他担任直播报道的主播。"}]}],"synonyms":["mooring","support","mainstay","secure","fasten","host"],"phonetic":"/ˈæŋkɚ/","extraExplanation":["你输入的 **ancor** 常见为拼写错误；标准拼写是 **anchor**。","**anchor** 的比喻义很常见：表示“让人安心、让局面稳定的东西/人”，比如 *emotional anchor*（情感支点）。","词源来自希腊语/拉丁语中表示“锚”的词，后来引申出“固定、稳住”的动词用法。"]}
{"word":"ancora","summary":{"en":"“Ancora” is an Italian word sometimes used in English music/theater to mean “again!” (like “encore”).","zh":"“Ancora”是意大利语词，在英语的音乐/戏剧语境中偶尔用来表示“再来一次！”（类似“安可/encore”）。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(Italian loanword, used in music/theater) again; once more (similar to “encore”).","zh":"（意大利语借词，常见于音乐/戏剧场合）再来一次；再一次（类似“encore/安可”）。"},"examples":[{"en":"The audience shouted “Ancora!” after the final song.","zh":"最后一首歌结束后，观众喊着“Ancora！”要求再来一次。"},{"en":"In old opera programs, you may see “ancora” to request a repeat.","zh":"在老歌剧节目单里，你可能会看到“ancora”，表示要求返场再唱一遍。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Rare in English; Italian adverb) still; yet; again (depending on context).","zh":"（英语中较少直接使用；意大利语副词）仍然；还；又/再（意义随语境变化）。"},"examples":[{"en":"Italian: “Sei ancora qui?” literally means “Are you still here?”","zh":"意大利语：“Sei ancora qui?” 字面意思是“你还在这儿吗？”"},{"en":"Italian: “Ancora una volta” means “once again.”","zh":"意大利语：“Ancora una volta” 意为“再一次”。"}]}],"synonyms":["encore","again","once more"],"phonetic":"/ænˈkɔrə/","extraExplanation":["“Ancora”在意大利语里非常常用：既可以表示“仍然/还”（still/yet），也可以表示“再一次”（again）。在歌剧、古典音乐等场合，观众喊“Ancora!”就是请求表演者加演或重复演唱，英语里更常用的对应词是“Encore!”（法语借词）。","文学与舞台语境：在一些英文的歌剧评论、节目单或小说中，作者会用“ancora”来营造“意大利歌剧院/音乐会”的氛围，带有文化色彩与现场感。"]}
{"word":"ancoral","summary":{"en":"AncoraI means “related to an anchor,” and more rarely “stabilizing like an anchor.”","zh":"AncoraI 指“与锚有关的”，更少见时也可指“像锚一样起稳定作用的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to an anchor (the heavy object used to hold a ship in place).","zh":"与“锚”有关的；锚的（用于使船固定在水中的重物）。"},"examples":[{"en":"The museum displayed an ancoral cable recovered from an old shipwreck.","zh":"博物馆展出了一条从古老沉船中打捞上来的锚链。"},{"en":"Divers photographed the ancoral hardware on the seabed.","zh":"潜水员拍下了海床上的锚具。"}]},{"partOfSpeech":"adj.","definition":{"en":"(figurative, rare) providing stability or a firm point of support, like an anchor.","zh":"（比喻，罕见）像锚一样起到稳定作用的；提供支撑点的。"},"examples":[{"en":"In stressful times, a steady routine can be an ancoral force.","zh":"在压力很大的时期，稳定的日常习惯可以成为一种“锚”一样的稳定力量。"}]}],"synonyms":["anchor-related","anchoring","anchored","stabilizing","firm"],"phonetic":"/ænˈkɔrəl/","extraExplanation":["“ancoral”在现代英语中非常少见，更多时候人们会直接用更常见的表达：anchor (n./v.)、anchoring (adj.)、anchored (adj.)，例如：an anchored boat（停泊的船）、anchoring points（固定点）。","拼写上也容易与“anchor”相关的其他罕见派生词混淆；如果你的语境来自航海、考古或文学作品，保留“ancoral”通常更贴合原文风格。"]}
{"word":"Ancram","summary":{"en":"Ancram is most commonly a place name, especially a town in eastern New York State; it can also be a rare surname.","zh":"Ancram最常见是地名（尤其指美国纽约州东部的安克拉姆镇）；也可作较少见的姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A town in Columbia County, in eastern New York State (USA).","zh":"美国纽约州东部哥伦比亚县的一个小镇（地名：安克拉姆）。"},"examples":[{"en":"We drove through Ancram on our way to the Berkshires.","zh":"我们去伯克郡（Berkshires）的路上开车经过了安克拉姆。"},{"en":"The Ancram Opera House hosts performances and community events.","zh":"安克拉姆歌剧院会举办演出和社区活动。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname (family name), though not very common.","zh":"一个姓氏（不太常见）。"},"examples":[{"en":"I met someone named Ancram at the conference.","zh":"我在会议上遇到一位姓安克拉姆的人。"}]}],"phonetic":"/ˈæŋkrəm/","extraExplanation":["“Ancram”在日常英语中主要作为专有名词使用（地名/人名），通常不翻译含义，而是音译。它在美国语境里最常指纽约州的Ancram镇。","有资料认为该地名与苏格兰的Ancram（以及“Earl of Ancram”这一贵族头衔）有关，因此带有历史移民命名的色彩；但在学习与使用时，把它当作“地点名称”最实用。"]}
{"word":"Ancramdale","summary":{"en":"Ancramdale is a small hamlet in Columbia County, New York.","zh":"Ancramdale 是美国纽约州哥伦比亚县的一个小村落（聚落）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A small hamlet (unincorporated community) in the town of Ancram, Columbia County, New York, in the United States.","zh":"美国纽约州哥伦比亚县安克拉姆镇（Ancram）内的一个小村落/聚落（非建制社区）。"},"examples":[{"en":"She grew up in Ancramdale, a quiet hamlet in upstate New York.","zh":"她在安克拉姆代尔长大，那是纽约州北部一个安静的小村落。"},{"en":"Ancramdale is a small place, so services like stores and transit can be limited.","zh":"安克拉姆代尔地方不大，所以商店和公共交通等服务可能比较有限。"}]}],"synonyms":["Ancramdale, NY"],"phonetic":"/ˈæŋkræmdeɪl/","extraExplanation":["“Ancramdale”通常作为地名使用，可理解为“Ancram + dale（山谷）”。在美国语境里，hamlet 指比“town”更小的聚居点，往往没有独立市政建制。"]}
{"word":"ancraophobia","summary":{"en":"“Ancraophobia” is likely a misspelling of “arachnophobia,” the fear of spiders.","zh":"“ancraophobia”很可能是“arachnophobia”的误拼，意思是“蜘蛛恐惧症/怕蜘蛛”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An apparent misspelling of arachnophobia: an intense fear of spiders (and sometimes other eight-legged “arachnid” animals such as scorpions).","zh":"看起来是 arachnophobia（蜘蛛恐惧症）的拼写误写：对蜘蛛（有时也包括蝎子等蛛形纲动物）强烈的恐惧。"},"examples":[{"en":"She avoids basements because of her arachnophobia.","zh":"因为蜘蛛恐惧症，她会避免去地下室。"},{"en":"His arachnophobia makes camping stressful when he sees webs.","zh":"他有蜘蛛恐惧症，露营时看到蛛网就会很紧张。"}]}],"synonyms":["arachnophobia","fear of spiders","spider phobia"],"phonetic":"əˌræk.nəˈfoʊ.bi.ə","extraExplanation":["“ancraophobia”在常见英语词典中不太作为标准词条出现；最接近且常用的词是“arachnophobia”。如果你是在作业、论文或正式场合使用，建议改用标准拼写“arachnophobia”。","词根小提示：arachnid（蛛形纲动物）+ -phobia（恐惧）。因此 arachnophobia 字面意思是“对蛛形动物的恐惧”，日常通常指“怕蜘蛛”。"]}
{"word":"ancre","summary":{"en":"“Ancre” is usually French for “anchor,” or a proper name for the Ancre River in France; it is not common as a modern English word.","zh":"“Ancre”通常是法语“锚”，或指法国的昂克尔河（地名）；作为现代英语词并不常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Not standard modern English) A French word meaning “anchor.” In English texts, it may appear in French contexts or as an older/variant spelling related to “anchor.”","zh":"（非现代标准英语）法语里“锚”的意思。在英文中多见于法语语境，或作为与“anchor（锚）”相关的旧式/变体拼写。"},"examples":[{"en":"The museum label read “ancre,” the French word for “anchor.”","zh":"博物馆的标签写着“ancre”，这是法语里“锚”的意思。"},{"en":"In a French-themed logo, an ancre (anchor) is a common symbol of the sea.","zh":"在法式主题的标志里，ancre（锚）是常见的海洋象征。"}]},{"partOfSpeech":"n.","definition":{"en":"A proper name in English for the Ancre River in northern France (often seen in history, e.g., World War I writing).","zh":"英文中对法国北部昂克尔河（Ancre River）的专名；常见于历史语境（如一战相关文字）。"},"examples":[{"en":"The book describes fighting near the Ancre during World War I.","zh":"这本书描述了一战期间在昂克尔河附近的战斗。"},{"en":"They visited the Somme and the Ancre River to learn about local history.","zh":"他们参观了索姆河和昂克尔河，以了解当地历史。"}]}],"synonyms":["anchor"],"phonetic":"/ˈæŋkər/","extraExplanation":["“Ancre”在英文里通常不是一个独立的常用词；更常见的是英语“anchor”。如果你是在英文句子里看到“ancre”，很可能是法语借用、地名（Ancre River），或特定历史/文化语境（例如一战的“Battle of the Ancre”相关资料）。"]}
{"word":"ancress","summary":{"en":"An old word for a woman who lives as a religious recluse (an anchoress).","zh":"表示“隐修女”的古词（即 anchoress）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) a woman who lives a very strict religious life in seclusion, often withdrawn from society for prayer; an old form of “anchoress.”","zh":"（古义）隐修女；过严格隐居宗教生活的女性（常与社会隔离以祈祷）；为“anchoress”的旧拼写形式。"},"examples":[{"en":"In the medieval tale, an ancress prays in a small cell beside the church.","zh":"在这则中世纪故事里，一位隐修女在教堂旁的小房间里祈祷。"},{"en":"The poem describes an ancress who chooses silence and solitude.","zh":"这首诗描写了一位选择沉默与独处的隐修女。"}]}],"synonyms":["anchoress","female recluse","anchorite (general term)"],"phonetic":"/ˈæŋkrəs/","extraExplanation":["“ancress”是较少见、带古风的拼写/用法，更常见的是“anchoress”（女性隐修者）以及“anchorite”（隐修者，男女皆可）。","隐修传统在中世纪欧洲较常见：隐修者可能住在教堂旁的狭小房间里，终身以祈祷与苦修为主。阅读历史或文学文本时更容易遇到该词。"]}
{"word":"ancresses","summary":{"en":"“Ancresses” is usually a misspelling of “ancestresses,” meaning female ancestors.","zh":"“ancresses”通常是“ancestresses”的误拼，意思是“女祖先”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Female ancestors; women in your family line from long ago (plural of “ancestress”).","zh":"女祖先；家族谱系中很久以前的女性（“ancestress”的复数）。"},"examples":[{"en":"She studied her ancestresses through old family records and letters.","zh":"她通过旧家谱和信件研究自己的女祖先。"},{"en":"Many of his ancestresses came from coastal towns in New England.","zh":"他的许多女祖先来自新英格兰的沿海城镇。"}]}],"synonyms":["female ancestors","foremothers","ancestresses"],"phonetic":"/ˈæn.sɛs.trəs/","extraExplanation":["“ancresses”并不是常见拼写；你可能想写的是 **ancestresses**（ancestress 的复数）。单数是 **ancestress**，复数在 -ss 后面加 **-es** 变成 **ancestresses**。","“ancestress/ancestresses”在现代英语中相对少用；日常更常说 **ancestors**（不分性别的“祖先”）。在强调女性血脉、女性历史或家族谱系写作时，才更常用到。"]}
{"word":"ancy","summary":{"en":"“Fancy” can mean decorative/stylish (adj.), to like/want or be attracted to (v.), or a sudden liking/imagination (n.).","zh":"“Fancy”可指精致花哨的（形容词），也可表示喜欢/想要或对……有好感（动词），还可指一时的喜欢或想象/幻想（名词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Elaborate or decorative; more special or stylish than usual.","zh":"（形容词）精致的；花哨的；比平常更讲究、更有装饰性的。"},"examples":[{"en":"They stayed at a fancy hotel downtown.","zh":"他们住在市中心一家高档酒店。"},{"en":"She wore a fancy dress to the party.","zh":"她穿了一条漂亮华丽的裙子去参加聚会。"},{"en":"You don’t need anything fancy—just something clean and comfortable.","zh":"你不需要太讲究的东西——干净舒服就行。"}]},{"partOfSpeech":"v.","definition":{"en":"(v.) To like or want something; to feel attracted to someone or something.","zh":"（动词）喜欢；想要；对……产生好感/兴趣。"},"examples":[{"en":"Do you fancy a coffee?","zh":"你想喝杯咖啡吗？"},{"en":"He fancied her from the moment they met.","zh":"他们一见面他就对她有好感。"},{"en":"I quite fancy going for a walk later.","zh":"我挺想晚点去散步。"}]},{"partOfSpeech":"n.","definition":{"en":"(n.) A sudden liking or interest; also, imagination or a daydream.","zh":"（名词）一时的喜欢/兴趣；也可指想象（力）或幻想。"},"examples":[{"en":"She took a fancy to the little cat and decided to adopt it.","zh":"她一下子喜欢上了那只小猫，于是决定收养它。"},{"en":"His story is a mix of fact and fancy.","zh":"他的故事把事实和幻想混在了一起。"}]}],"synonyms":["decorative","stylish","elaborate","like","want","imagine","daydream"],"phonetic":"/ˈfænsi/","extraExplanation":["“Fancy”与“fantasy（幻想）”同源，早期更偏“想象、幻想”的意思，所以你会看到“fact and fancy（事实与想象）”这种搭配。","英式英语里“Fancy a…?”非常常见，用来礼貌地提出邀请或询问想不想要某物（如：Fancy a drink?）。美式英语中更常说“Do you want…?”或“Would you like…?”，但“fancy”仍可理解。","常见固定搭配：take a fancy to…（突然喜欢上……）；fancy oneself…（自以为很了不起/自恋地觉得自己很棒）。"]}
{"word":"ancylid","summary":{"en":"An ancylid is a small freshwater limpet-like snail that clings to surfaces in rivers and lakes.","zh":"ancylid 指一种淡水帽贝状的小蜗牛，常附着在河流和湖泊的表面。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small freshwater limpet (a cap-shaped snail) from the family Ancylidae (or related groups), which clings to rocks, plants, or other surfaces in rivers and lakes","zh":"（淡水）帽贝状小蜗牛；指淡水帽螺类（多指 Ancylidae 科或相关类群），常附着在河流或湖泊的岩石、植物等表面"},"examples":[{"en":"Ancylids often cling tightly to stones in fast-moving streams.","zh":"淡水帽螺常常紧紧附着在湍急溪流的石头上。"},{"en":"The researcher collected several ancylids from aquatic plants for identification.","zh":"研究人员从水生植物上采集了几只淡水帽螺用于鉴定。"}]}],"synonyms":["freshwater limpet","limpet-like snail"],"phonetic":"ˈæn.sə.lɪd","extraExplanation":["“ancylid”主要用于生物学/生态学语境，日常英语中不常见。","在分类学上，它与“freshwater limpet（淡水帽贝/淡水帽螺）”这一常用名称关系密切；不同资料可能因分类调整而把相关种归入不同科/属，但学习时把它理解为“淡水的帽贝状小螺”即可。"]}
{"word":"Ancyloceras","summary":{"en":"Ancyloceras is an extinct ammonite genus from the Early Cretaceous, known for a partly uncoiled, hook-shaped shell.","zh":"Ancyloceras 是白垩纪早期的一种已灭绝菊石属，以部分不规则展开、呈钩状的外壳著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of extinct, coiled marine mollusks (heteromorph ammonites) known from the Early Cretaceous period, often recognized by its partly uncoiled, hook-like shell shape","zh":"一种已灭绝的海洋软体动物属（异形菊石），生活于白垩纪早期，常以部分不规则展开、呈钩状的螺旋壳为特征"},"examples":[{"en":"Ancyloceras fossils are often displayed in natural history museums because their shells have an unusual hooked curve.","zh":"Ancyloceras（钩菊石）化石常见于自然历史博物馆展出，因为它的壳形有独特的钩状弯曲。"},{"en":"The rock layer contained Ancyloceras, suggesting an Early Cretaceous marine environment.","zh":"该岩层中发现了Ancyloceras，提示这里曾是白垩纪早期的海洋环境。"}]}],"synonyms":["ammonite","heteromorph ammonite"],"phonetic":"ˌæn.sɪˈlɑː.sə.rəs","extraExplanation":["Ancyloceras 是菊石（ammonite）的一类，属于“异形菊石”（heteromorph ammonites），外壳不像常见菊石那样规则盘卷，而是会部分伸展开来，因此外观更像“钩子”。","词源可拆分理解：ancyl-/ankyl- 表示“弯曲、钩状”，-ceras 源自希腊语，常用于与“角/角状”相关的命名（古生物学命名里也常见）。","在英语学术与科普写作中，它通常作为专有名词使用，首字母大写，斜体书写更符合生物分类学排版习惯（如 *Ancyloceras*）。"]}
{"word":"ancyloceras","summary":{"en":"Ancyloceras is an extinct ammonite genus with a characteristic hook-shaped shell.","zh":"Ancyloceras是已灭绝的菊石属，以钩状壳体为特征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct genus of ammonites (marine cephalopods) from the Early Cretaceous, known for a partly uncoiled, hook-shaped shell.","zh":"一种已灭绝的菊石属（海洋头足类），生存于白垩纪早期，以部分伸展、呈钩状的壳体形态著称。"},"examples":[{"en":"The museum display includes an Ancyloceras fossil with a distinctive hooked shell.","zh":"博物馆展柜里有一件Ancyloceras化石，壳体呈明显的钩状。"},{"en":"Ancyloceras is often discussed in lessons about Early Cretaceous marine life.","zh":"在讲解白垩纪早期海洋生物时，常会提到Ancyloceras。"}]}],"synonyms":["ammonite","hooked ammonite"],"phonetic":"ˌæn.sɪˈlɑː.sə.rəs","extraExplanation":["Ancyloceras主要作为古生物学中的属名使用，通常首字母大写并用斜体书写（Ancyloceras）。","词源来自希腊语：ankylos（弯曲的）+ keras（角），形容其“像弯角一样”的外形。","它属于菊石（ammonites）的一类，常被用作地层对比的“指示化石”，帮助判断岩层年代。"]}
{"word":"Ancylocladus","summary":{"en":"Ancylocladus is a rare botanical genus name, mainly seen in scientific or historical taxonomy.","zh":"Ancylocladus 是一个较少见的植物属名，主要用于科学或历史分类文献中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany) A scientific genus name used for certain plants in older or less common classifications; it is not widely used in everyday English and may appear in taxonomic or historical botanical texts.","zh":"（植物学）一个用于某些植物的属名（学名），多见于较旧或较少使用的分类体系；日常英语中很少用，主要出现在分类学或历史植物学文献中。"},"examples":[{"en":"Ancylocladus is a genus name you might encounter in older botanical references rather than modern field guides.","zh":"Ancylocladus 这个属名更常见于较旧的植物学参考书，而不是现代的野外识别手册。"},{"en":"The paper lists Ancylocladus as a synonym in the taxonomic history of the group.","zh":"这篇论文在该类群的分类沿革中把 Ancylocladus 列为异名（同物异名）。"}]}],"synonyms":["(context) genus name","(context) taxonomic synonym"],"phonetic":"/ænˌsaɪkloʊˈkleɪdəs/","extraExplanation":["这是拉丁化的学名（属名），首字母通常大写并用斜体书写：*Ancylocladus*。","词形来源上常见的解释是由希腊语词根构成：ancyl-/ankyl- 表示“弯曲的”，-cladus 与“枝/分枝（branch）”相关，整体有“弯枝”的含义，符合一些藤本或攀援植物“钩状/弯曲”结构的命名习惯。","不同数据库或时代的分类系统可能会把它视为“已不常用的名称/异名”，因此检索时也可尝试查找相关的现代接受名（accepted name）或近似拼写。"]}
{"word":"ancylocladus","summary":{"en":"Ancylocladus is a scientific genus name used in taxonomy, seen mainly in biological or botanical texts.","zh":"Ancylocladus 是生物分类学中的属名（学名），主要出现在生物/植物学资料中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific Latin name used for a genus (group) of organisms, mainly found in biological classification; it is not a common everyday English word.","zh":"（学名）Ancylocladus：用于生物分类中的属名（一组生物的名称）；并非常见英语日常词汇。"},"examples":[{"en":"In some older botanical references, Ancylocladus appears as a genus name in plant classification.","zh":"在一些较早的植物学资料中，Ancylocladus 会作为植物分类中的属名出现。"},{"en":"The specimen was labeled “Ancylocladus” in the herbarium, indicating its taxonomic placement in that source.","zh":"该标本在植物标本馆被标注为“Ancylocladus”，表示在那份资料中的分类归属。"}]}],"synonyms":["genus name","taxonomic name","scientific name"],"phonetic":"/ˌæn.sɪˈlɑː.dəs/","extraExplanation":["这是拉丁化的“学名”（taxonomy term），通常以属名形式出现，首字母大写并用斜体书写（如 *Ancylocladus*）。不同年代与不同分类系统可能会调整、合并或废弃某些属名；因此你可能会在旧文献里见到，但在现代资料中不一定仍广泛使用。"]}
{"word":"Ancylodactyla","summary":{"en":"Ancylodactyla is an older scientific name used for geckos (cling-toed lizards), mostly replaced by “Gekkota.”","zh":"Ancylodactyla 是壁虎类的旧科学分类名，如今多用 “Gekkota” 等称呼取代。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former scientific (taxonomic) name for geckos—a group of lizards known for specialized toes that help them cling to surfaces; now largely replaced by terms like “Gekkota.”","zh":"（旧的科学分类名）指壁虎类——一类以特殊脚趾结构、能攀附墙面等表面的蜥蜴；如今多被 “Gekkota（壁虎下目/壁虎类群）” 等名称取代。"},"examples":[{"en":"In older zoology texts, geckos were sometimes placed in a group called Ancylodactyla.","zh":"在较早的动物学教材中，壁虎有时被归入一个叫 Ancylodactyla 的类群。"},{"en":"Modern classifications usually use “Gekkota” rather than “Ancylodactyla.”","zh":"现代分类学通常使用 “Gekkota”，而不是 “Ancylodactyla”。"}]}],"synonyms":["Gekkota","geckos"],"phonetic":"/ˌæn.sɪ.loʊˈdæk.tɪ.lə/","extraExplanation":["词源来自希腊语：ankylo-（弯曲的、钩状的）+ dactylos（手指/脚趾），字面意思接近“钩状脚趾”，用来强调壁虎脚趾的特化结构（如趾垫等）。","这是较旧的分类用语：在不同历史时期、不同学者体系里可能出现过，用于学习时可把它理解为“壁虎类的旧称/旧类群名”。"]}
{"word":"ancylodactyla","summary":{"en":"Ancylodactyla is a rare medical term for stiff, fused, or fixed-bent fingers or toes due to limited joint movement.","zh":"Ancylodactyla 是较少见的医学词，指手指/脚趾因关节活动受限而僵硬、融合或固定弯曲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) A condition in which one or more fingers or toes are stiff, fused, or fixed in a bent position because the joints cannot move normally.","zh":"（医学）指一根或多根手指/脚趾因关节活动受限而僵硬、融合，或固定在弯曲姿势的情况。"},"examples":[{"en":"The exam suggested ancylodactyla affecting the patient’s ring finger.","zh":"检查提示患者无名指存在 ancylodactyla（指趾关节僵硬/固定）。"},{"en":"Some children are born with ancylodactyla and may need therapy or surgery depending on severity.","zh":"有些孩子天生就有 ancylodactyla，是否需要康复训练或手术取决于严重程度。"}]}],"synonyms":["ankylodactylia","ankylodactyly","digital ankylosis"],"phonetic":"/ˌæŋkɪloʊˈdæktɪlə/","extraExplanation":["这个词较少见，常被写作 **ankylodactylia / ankylodactyly**（拼写不同但同源）。词源来自希腊语：*ankylos*（弯曲的、僵硬的）+ *dactyl-*（手指/脚趾）。","在医学语境里，它描述的是“关节僵硬/融合导致手指脚趾不能正常伸屈”的状态；有时会和 **syndactyly（并指/并趾，皮肤或骨性黏连）**、**camptodactyly（屈指畸形，主要是弯曲）**等相关术语一起区分使用。"]}
{"word":"ancylopod","summary":{"en":"An ancylopod is a prehistoric hoofed mammal with claw-like toes (often a chalicothere), or something related to it.","zh":"ancylopod 指趾端像爪的史前有蹄类哺乳动物（常指铲齿兽类），也可作形容词表示“与其相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a prehistoric hoofed mammal (especially a chalicothere) that had large, claw-like toes instead of typical hooves.","zh":"（古生物）一种史前的有蹄类哺乳动物（尤指铲齿兽类），脚趾末端呈大而像爪的结构，而非典型的蹄。"},"examples":[{"en":"Scientists found ancylopod fossils that suggest it used its claws to pull down branches.","zh":"科学家发现了ancylopod（铲齿兽类等）的化石，推测它用爪状趾拉下树枝取食。"},{"en":"In the museum, the ancylopod skeleton looks like a mix of a horse and a giant sloth.","zh":"在博物馆里，ancylopod的骨架看起来像“马”和“巨型树懒”的混合体。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to these claw-toed prehistoric mammals.","zh":"与这类趾端呈爪状的史前哺乳动物有关的。"},"examples":[{"en":"The report discusses ancylopod anatomy and how it differs from modern horses.","zh":"报告讨论了ancylopod的解剖结构，以及它与现代马的不同。"}]}],"synonyms":["chalicothere (related term)","claw-toed ungulate (descriptive)"],"phonetic":"/ænˈsaɪləˌpɑd/","extraExplanation":["这个词较少见，常出现在古生物学/博物馆展览文字中。词源上来自希腊语：ankylo-（弯曲的、钩状的）+ -pod（脚），强调“脚/趾呈钩爪状”。在更常见的写法里，你也可能看到相关类群名“chalicothere（铲齿兽）”。"]}
{"word":"Ancylopoda","summary":{"en":"Ancylopoda is an older zoological term for extinct claw-footed odd-toed mammals, especially chalicotheres.","zh":"Ancylopoda 是较旧的动物学术语，指已灭绝的“爪足型”奇蹄类哺乳动物，尤指爪兽类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology, paleontology) A former scientific name for a group of extinct odd-toed mammals (especially chalicotheres) that had claw-like, “hooked” feet rather than hooves.","zh":"（动物学/古生物学）一个较旧的科学名称，指一类已灭绝的奇蹄类哺乳动物（尤指爪兽类 chalicotheres），其脚部呈爪状、似“钩形”，而非典型的蹄。"},"examples":[{"en":"Ancylopoda is an older term you may see in paleontology texts for the chalicotheres.","zh":"Ancylopoda 是一个较旧的术语，你可能会在古生物学文献中用它来指爪兽类。"},{"en":"Some books describe Ancylopoda as unusual perissodactyls with claws instead of hooves.","zh":"一些书会把 Ancylopoda 描述为“长爪不长蹄”的特殊奇蹄类。"}]}],"synonyms":["chalicotheres (related term)","Chalicotherioidea (related term)"],"phonetic":"/ˌæn.sɪˈlɑː.pə.də/","extraExplanation":["词源来自希腊语：ankylos（弯曲的、钩状的）+ poda（脚）。名称强调“钩状脚/爪”的特征。","在现代分类中，这个名称较少使用；相关动物通常被归入奇蹄目（Perissodactyla）中的爪兽类（Chalicotheriidae/Chalicotherioidea）等更具体的类群。"]}
{"word":"ancylopoda","summary":{"en":"Ancylopoda is a rare, older term for Perissodactyla (odd-toed ungulates like horses, rhinos, and tapirs).","zh":"Ancylopoda 是一个罕见的旧称，指奇蹄目（如马、犀牛、貘等奇数趾的有蹄类）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(zoology, taxonomy) An old or less common name for the mammal group Perissodactyla—the “odd-toed ungulates,” such as horses, rhinoceroses, and tapirs.","zh":"（动物学／分类学）一个较旧或较少使用的名称，指“奇蹄目”（Perissodactyla，奇数趾的有蹄类），例如马、犀牛和貘。"},"examples":[{"en":"In some older books, horses and tapirs were placed in Ancylopoda.","zh":"在一些旧书里，马和貘被归入 Ancylopoda。"},{"en":"Modern taxonomy usually uses the name Perissodactyla instead of Ancylopoda.","zh":"现代分类学通常用 Perissodactyla，而不用 Ancylopoda。"}]}],"synonyms":["Perissodactyla","odd-toed ungulates"],"phonetic":"/ˌænsaɪˈlɑːpədə/","extraExplanation":["这个词在现代英语里非常罕见，多见于较早期的动物分类文献。更常用、更标准的说法是 **Perissodactyla（奇蹄目）** 或 **odd-toed ungulates（奇数趾的有蹄类）**。","词源上常被解释为来自希腊语词根，含“弯曲/不直（ankyl-）”与“足（-poda）”之意，用来描述这一类动物的足部结构；但在不同旧文献里用法可能不完全一致。","你输入的拼写 **ancylopoda** 可能来自学术文献或旧书；如果你是在特定文章/图片里看到的，我也可以帮你确认它指的是不是“奇蹄目”。"]}
{"word":"ancylose","summary":{"en":"Ankylose means a joint becomes (or is made) stiff and immovable because the bones fuse, usually in a medical context.","zh":"Ankylose 指（医学上）关节因骨性融合而变得僵硬甚至不能活动，常用于医学语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Medical) to make a joint stiff or immovable by causing the bones to fuse together; to become stiff in this way.","zh":"（医学）使关节强直（因骨性融合而变得僵硬或不能活动）；（关节）发生强直。"},"examples":[{"en":"After the injury, the joint began to ankylose and lost much of its normal movement.","zh":"受伤后，这个关节开始发生强直，正常活动范围大大减少。"},{"en":"In severe arthritis, inflammation can cause the spine to ankylose over time.","zh":"在严重关节炎中，炎症可能随着时间推移导致脊柱发生强直。"}]}],"synonyms":["fuse","stiffen","immobilize","ossify"],"phonetic":"/ˈæŋkəˌloʊz/","extraExplanation":["“ancylose”通常是“ankylose”的拼写误差；更常见的名词是“ankylosis（关节强直）”。","该词多用于医学语境，日常英语里很少见；日常表达更可能说“the joint became stiff / the bones fused”。","词源来自希腊语，含义与“弯曲、僵硬”相关，强调因病变或损伤导致的‘骨性融合’而不是一般的肌肉酸痛。"]}
{"word":"Ancylostoma","summary":{"en":"Ancylostoma is the scientific genus name for certain hookworms (parasitic worms) that can infect humans or animals.","zh":"Ancylostoma 是部分“钩虫”的属名（学名），可感染人或动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of parasitic hookworms that live in the small intestine of humans or animals and can cause hookworm disease (anemia, stomach discomfort, weakness).","zh":"一种寄生性钩虫的属名，寄生于人或动物的小肠，可引起钩虫病（如贫血、胃肠不适、乏力）。"},"examples":[{"en":"Ancylostoma duodenale is one of the hookworms that can infect humans.","zh":"十二指肠钩虫（Ancylostoma duodenale）是可感染人类的一种钩虫。"},{"en":"The doctor ordered a stool test to check for Ancylostoma eggs.","zh":"医生安排了粪便检查，以确认是否有钩虫（Ancylostoma）虫卵。"}]}],"synonyms":["hookworm","Ancylostoma duodenale","Ancylostoma caninum"],"phonetic":"/ˌæn.sɪ.loʊˈstɑːmə/","extraExplanation":["词源：Ancylostoma 来自希腊语词根，ancyl(o)- 表示“弯曲”，-stoma 表示“口”，指这种虫的口部结构像“弯钩/弯曲的口”，与英文常见名 hookworm（钩虫）对应。","常见相关物种：A. duodenale（十二指肠钩虫，更多见于人）、A. caninum（犬钩虫）。在人类医学语境中，Ancylostoma 常出现在寄生虫学或检验报告里。"]}
{"word":"ancylostoma","summary":{"en":"Ancylostoma is a genus of hookworms—intestinal parasites common in dogs and cats—that can cause anemia and digestive illness.","zh":"Ancylostoma 指钩虫属：常见于犬猫等动物肠道的寄生虫，可能导致贫血和消化道疾病。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of parasitic hookworms that live in the intestines of animals (and sometimes humans), especially dogs and cats, and can cause anemia and digestive problems","zh":"一种寄生性钩虫属（多寄生于动物肠道，尤以犬猫常见，偶可感染人类），可引起贫血与消化道不适"},"examples":[{"en":"Ancylostoma caninum is a common hookworm that infects dogs.","zh":"犬钩虫（Ancylostoma caninum）是狗常见的钩虫感染之一。"},{"en":"The vet checked the puppy’s stool to test for Ancylostoma eggs.","zh":"兽医检查幼犬的粪便，以检测是否有钩虫属（Ancylostoma）的虫卵。"},{"en":"In severe cases, Ancylostoma infection may cause weakness due to blood loss.","zh":"严重时，钩虫属（Ancylostoma）感染可能因失血而导致乏力。"}]}],"synonyms":["hookworm","Ancylostoma caninum","Ancylostoma duodenale"],"phonetic":"/ˌænsɪˈlɑstəˌmə/","extraExplanation":["词源提示：Ancylostoma 来自希腊语成分，ancyl(o)- 表示“弯曲/钩状”，-stoma 表示“口”，指这种虫有“钩状口器”，用来附着在肠壁并吸血。","学习提醒：它常出现在医学/兽医学语境中；日常英语里更常用的通俗词是 hookworm（钩虫）。"]}
{"word":"ancylostome","summary":{"en":"Ancylostome means a hookworm, especially a parasitic worm of the genus Ancylostoma.","zh":"ancylostome 指钩虫，尤指钩口线虫属（Ancylostoma）的寄生虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hookworm; especially a parasitic worm of the genus Ancylostoma that lives in the intestines and can cause anemia and other illness","zh":"钩虫；尤指钩口线虫属（Ancylostoma）的寄生虫，寄生于肠道，可能导致贫血等疾病"},"examples":[{"en":"In tropical areas, ancylostomes can spread when people walk barefoot on contaminated soil.","zh":"在热带地区，人们赤脚走在受污染的土壤上时，钩虫可能传播。"},{"en":"The doctor suspected an ancylostome infection after finding low iron levels and stomach symptoms.","zh":"医生在发现缺铁和胃肠症状后，怀疑是钩虫感染。"}]}],"synonyms":["hookworm","Ancylostoma"],"phonetic":"/ænˈsɪləˌstoʊm/","extraExplanation":["“Ancylostome”是比较学术/医学的用词；日常英语里更常说“hookworm（钩虫）”。","传播途径常与卫生条件有关：幼虫可从受污染的土壤进入皮肤（例如赤脚行走），之后迁移到肠道寄生。","词源上与希腊语有关，含有“弯曲/钩状”的意思，用来描述这种虫的口部结构。"]}
{"word":"ancylostomiasis","summary":{"en":"Ancylostomiasis is a hookworm infection (often from Ancylostoma species) that typically affects the intestines and can cause anemia.","zh":"Ancylostomiasis 指钩虫感染（常与 Ancylostoma 属相关），多累及肠道并可能引起贫血。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A disease caused by infection with hookworms (especially Ancylostoma species), usually affecting the intestines and often leading to anemia and abdominal symptoms.","zh":"由钩虫（尤其是十二指肠钩口线虫属 Ancylostoma 等）感染引起的疾病，常累及肠道，可导致贫血及腹部不适等症状。"},"examples":[{"en":"In some tropical areas, ancylostomiasis is a common cause of iron-deficiency anemia.","zh":"在一些热带地区，钩虫病常是缺铁性贫血的常见原因。"},{"en":"The doctor suspected ancylostomiasis after learning the patient often walked barefoot on wet soil.","zh":"得知患者经常赤脚走在潮湿土壤上后，医生怀疑是钩虫病。"}]}],"synonyms":["hookworm infection","hookworm disease"],"phonetic":"/ˌæn.sɪˌloʊ.stəˈmaɪ.ə.sɪs/","extraExplanation":["“ancylostomiasis”来自“Ancylostoma”（钩口线虫属名）+ “-iasis”（表示疾病/感染的后缀）。日常医学语境中更常用的词是“hookworm infection / hookworm disease（钩虫感染/钩虫病）”。","传播途径多为幼虫经皮肤侵入（如赤脚接触被污染的土壤），随后迁移到肠道寄生；常见表现包括乏力、贫血、腹痛或食欲变化等（具体症状因人而异）。","预防要点通常包括：穿鞋避免赤脚接触土壤、改善卫生与粪便处理、在高风险地区按公共卫生建议进行筛查/驱虫治疗。"]}
{"word":"Ancylostomum","summary":{"en":"Ancylostomum is an older genus name for hookworms (parasitic roundworms) that can cause anemia.","zh":"Ancylostomum 是“钩虫”属名的旧称，指可致贫血的寄生线虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus name historically used for hookworms (parasitic roundworms) that live in the small intestine and can cause hookworm disease, especially anemia","zh":"（旧称/历史用法）指“钩虫”的一个属名：寄生在小肠内的线虫，可引起钩虫病，常导致贫血"},"examples":[{"en":"Ancylostomum was used in older medical texts for parasites now usually classified as Ancylostoma.","zh":"在较早的医学文献中，Ancylostomum 常用于指如今多归为 Ancylostoma 的寄生虫。"},{"en":"Hookworm infection caused by Ancylostomum/Ancylostoma can lead to fatigue and iron-deficiency anemia.","zh":"由 Ancylostomum/Ancylostoma 引起的钩虫感染可能导致乏力和缺铁性贫血。"}]}],"synonyms":["hookworm","Ancylostoma","hookworm (genus name)"],"phonetic":"/ˌæn.sɪˈlɑs.tə.məm/","extraExplanation":["“Ancylostomum”多见于早期寄生虫学或医学文献，现代更常用的属名是“Ancylostoma”（如犬钩虫 Ancylostoma caninum、人钩虫 Ancylostoma duodenale）。因此在阅读旧文献时，可把它理解为与“钩虫/钩口线虫”相关的旧分类名称或拼写变体。","词源可拆解理解：ancyl-/ankyl- 表示“弯曲”，-stoma 表示“口”；钩虫口部有钩状结构，用于附着在肠壁吸血，因此得名。"]}
{"word":"ancylostomum","summary":{"en":"Ancylostomum is a scientific genus name for hookworms—parasitic worms that infect the intestine.","zh":"Ancylostomum 是钩虫的一个属名（学名），指寄生在肠道内的寄生虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of parasitic hookworms (roundworms) that live in the small intestine of humans or animals and can cause disease, especially anemia and digestive problems","zh":"一种寄生性的钩虫属（线虫），寄生在人或动物的小肠内，可引起疾病，常见为贫血与消化道症状"},"examples":[{"en":"Ancylostomum can cause anemia because the worms feed on blood in the intestine.","zh":"钩虫属（Ancylostomum）可能导致贫血，因为成虫会在肠道内吸血。"},{"en":"The vet suspected an Ancylostomum infection and recommended a stool test.","zh":"兽医怀疑是钩虫属感染，并建议做粪便检查。"}]}],"synonyms":["hookworm","Ancylostoma (variant spelling in some sources)"],"phonetic":"/ænˌsɪloʊˈstoʊməm/","extraExplanation":["“Ancylostomum”是拉丁化的学名，常见于医学、寄生虫学与兽医学语境；日常英语里更常用的说法是“hookworm（钩虫）”。","在现代分类中，人类常见的钩虫多指“Ancylostoma duodenale（十二指肠钩虫）”等物种；不同资料可能会在属名拼写（Ancylostoma vs. Ancylostomum）或分类上略有差异。阅读医学/科研文献时要注意上下文。"]}
{"word":"Ancylus","summary":{"en":"Ancylus is a zoological genus name for small freshwater limpet-like snails.","zh":"Ancylus 是动物学中指淡水帽贝状小蜗牛的一个属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small freshwater limpets (aquatic snails) that cling to rocks, plants, or other surfaces in streams and ponds.","zh":"一种淡水帽贝状小蜗牛的属名（淡水腹足类软体动物），常附着在溪流或池塘中的石头、水草等表面。"},"examples":[{"en":"In the pond survey, students found Ancylus attached to the underside of water plants.","zh":"在池塘调查中，学生们发现 Ancylus 附着在水草的背面。"},{"en":"Ancylus species are often used to discuss freshwater habitats and water quality.","zh":"Ancylus 的一些物种常被用来讨论淡水栖息地与水质情况。"}]}],"synonyms":["freshwater limpet","ancylid (family-related term)"],"phonetic":"/ˈæn.sə.ləs/","extraExplanation":["“Ancylus”是生物分类学里的拉丁化属名，常见于动物学/生态学资料中；在日常英语里很少出现，通常只在科研、野外调查或科普文本中看到。","词源上与希腊语中表示“弯曲/钩状”的词根有关，用来形容其外形特征（像小帽子一样贴附在基质上）。"]}
{"word":"ancylus","summary":{"en":"Ancylus is a genus of small freshwater limpet-like mollusks.","zh":"Ancylus 指一种小型淡水帽贝（软体动物）的属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small freshwater limpets (snail-like mollusks) that have a low, cap-shaped shell and often cling to rocks or plants in streams and ponds","zh":"（生物）淡水帽贝属：一种小型淡水“帽贝”（类似蜗牛的软体动物）属，外壳低矮呈帽状，常附着在溪流或池塘中的石头或水草上"},"examples":[{"en":"The biologist found Ancylus attached to stones in the fast-moving stream.","zh":"生物学家在湍急的溪流里发现淡水帽贝属（Ancylus）附着在石头上。"},{"en":"Ancylus species are often used to study freshwater habitats and water quality.","zh":"淡水帽贝属（Ancylus）的物种常被用来研究淡水栖息地与水质。"}]}],"synonyms":["freshwater limpet (common name)"],"phonetic":"/ˈæn.sɪ.ləs/","extraExplanation":["“Ancylus”是拉丁化的生物分类名称，通常首字母大写（Ancylus）。在一般英语语境中不常见，多出现在动物学、淡水生态学或分类学文章里。","它指“属”（genus）而不是单一物种；具体某个物种会写成双名法，例如 Ancylus fluviatilis。"]}
{"word":"Ancyrean","summary":{"en":"Ancyrean means “of or relating to Ancyra,” the ancient city at modern Ankara, Turkey (and rarely, a person from there).","zh":"Ancyrean 指“安基拉（今土耳其安卡拉）相关的”，少见时也可指安基拉人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Ancyra, an ancient city in Galatia (in present-day Ankara, Turkey).","zh":"与安基拉（Ancyra，古代加拉太地区的城市，今土耳其安卡拉）有关的；安基拉的。"},"examples":[{"en":"The museum has artifacts from the Ancyrean period of central Anatolia.","zh":"这家博物馆收藏了安纳托利亚中部安基拉时期的文物。"},{"en":"Scholars discuss Ancyrean inscriptions found near modern Ankara.","zh":"学者们讨论在今安卡拉附近发现的安基拉铭文。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Ancyra (historical/rare).","zh":"安基拉人（来自安基拉的人；历史用法/较少见）。"},"examples":[{"en":"In the text, the Ancyreans are described as active traders.","zh":"在这篇文字中，安基拉人被描述为活跃的商人。"}]}],"synonyms":["Ankara-related","Galatian (context-dependent)"],"phonetic":"/ænˈsaɪriən/","extraExplanation":["“Ancyrean”来自拉丁化地名 Ancyra（安基拉）。在历史与古典研究中更常见的搭配是 “the Monumentum Ancyranum”（《安基拉纪功碑》/《奥古斯都事迹录》铭文），指刻在安基拉奥古斯都神庙墙上的重要拉丁文与希腊文碑刻。","现代英语里，人们更常用 “Ankara” 相关表达（如 “Ankara-based / Ankara region”）。因此 “Ancyrean”多出现在历史、考古、古典学语境中。"]}
{"word":"ancyrean","summary":{"en":"Ancyrean means “of Ancyra (ancient Ankara)” and can also mean a person from there.","zh":"Ancyrean 表示“与安该拉（Ancyra，今安卡拉）有关”，也可指“安该拉人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Ancyra, the ancient name of modern Ankara in Turkey.","zh":"（形容词）与安该拉（Ancyra，今土耳其首都安卡拉的古称）有关的；安该拉的。"},"examples":[{"en":"The Ancyrean inscription is often cited in studies of Roman Asia Minor.","zh":"研究罗马时期的小亚细亚时，人们常引用安该拉的（Ancyrean）铭文。"},{"en":"She wrote a paper on Ancyrean history under the Roman Empire.","zh":"她写了一篇关于罗马帝国时期安该拉（Ancyra）历史的论文。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Ancyra (ancient Ankara).","zh":"（名词）安该拉人；安该拉（Ancyra，今安卡拉）居民。"},"examples":[{"en":"Ancient sources mention Ancyreans trading with neighboring cities.","zh":"古代文献提到安该拉人（Ancyreans）与周边城市进行贸易。"}]}],"synonyms":["Ankaran (modern, less common in academic writing)","of Ankara"],"phonetic":"/ænˈsaɪriən/","extraExplanation":["“Ancyrean”来自拉丁化地名 Ancyra 的形容词形式，常见于历史学、古典学与考古学写作中。","与之相关的常见学术搭配包括：the Ancyrean inscription（安该拉铭文）与 Monumentum Ancyranum（《安该拉纪功铭》），后者是记录奥古斯都功绩的著名碑文。"]}
{"word":"Ancyrene","summary":{"en":"Ancyrene means “of or from Ancyra (ancient Ankara)” and can also mean “a person from Ancyra.”","zh":"Ancyrene 指“与安该拉（今安卡拉）有关/来自安该拉的”，也可指“安该拉人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to, from, or characteristic of Ancyra (the ancient name of modern Ankara, Turkey).","zh":"（与）安该拉相关的；来自安该拉的；具有安该拉特征的（安该拉为今土耳其安卡拉的古名）。"},"examples":[{"en":"Ancyrene inscriptions have been found in the region around modern Ankara.","zh":"在今安卡拉周边地区发现了安该拉的铭文。"},{"en":"The museum has a small collection of Ancyrene coins.","zh":"这家博物馆收藏了一小批安该拉的硬币。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Ancyra; an inhabitant of ancient Ancyra.","zh":"安该拉人；古代安该拉的居民。"},"examples":[{"en":"Some Ancyrenes were known for their role in trade routes across central Anatolia.","zh":"一些安该拉人以参与穿越安纳托利亚中部的贸易路线而闻名。"}]}],"synonyms":["Ancyrian","of Ancyra","Ankara (modern equivalent, context-dependent)"],"phonetic":"/ænˈsaɪriːn/","extraExplanation":["“Ancyrene”来自古城名 Ancyra（拉丁化写法，希腊语作 Ankýra），对应今天土耳其首都 Ankara（安卡拉）。在历史与宗教文献中你也可能见到与其相关的表达，如 “Council of Ancyra”（安该拉会议，公元314年早期教会会议）或 “Saint Basil of Ancyra”（安该拉的圣巴西尔）。"]}
{"word":"ancyrene","summary":{"en":"“ancyrene” is not recognized as a standard English word; it’s likely a misspelling or a proper/specialized name.","zh":"“ancyrene”不是标准英语词；更可能是拼写错误或专有/专业名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a brand/name, or a specialized term (e.g., a username or product name).","zh":"不是标准英语单词。可能是拼写错误、品牌/人名，或某个专业领域/网络用语（例如用户名或产品名）。"},"examples":[{"en":"I couldn’t find “ancyrene” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里找不到“ancyrene”——你能把看到它的句子发我吗？"},{"en":"If you meant a different spelling, I can explain that word instead.","zh":"如果你想查的是另一个拼法，我也可以改为解释那个词。"}]}],"phonetic":"/ˌænsiˈriːn/","extraExplanation":["目前“ancyrene”在常见英语词典与语料中不收录，因此更像是：①拼写误差（比如多/少了字母）；②专有名词（人名、地名、品牌、作品名）；③小众领域术语或网络ID。","你可以告诉我它出现的语境（一句话或一段文字）、来源（书/论文/游戏/网站）、以及你希望的语言方向（英->中还是中->英），我就能更准确判断。","如果你怀疑是拼写问题，也可以给我几个可能的拼法（例如：ancyrene / ancyrene / ancyrene?），我会逐个比对解释。"]}
{"word":"Ancyrian","summary":{"en":"Ancyrian means “of Ancyra (ancient Ankara)” or “a person from Ancyra.”","zh":"Ancyrian 指“与安居拉（今安卡拉的古称）有关的”，也可指“安居拉人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Ancyra (the ancient name of Ankara, in modern-day Turkey) or its people.","zh":"与安居拉（Ancyra，今土耳其首都安卡拉的古称）或其居民有关的。"},"examples":[{"en":"Ancyrian inscriptions have been found in the region around modern Ankara.","zh":"在今安卡拉周边地区发现了与安居拉有关的铭文。"},{"en":"The museum has a small collection of Ancyrian artifacts from the Roman period.","zh":"这家博物馆收藏了一小批罗马时期的安居拉文物。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Ancyra; an inhabitant of ancient Ancyra.","zh":"安居拉人；古代安居拉的居民。"},"examples":[{"en":"An ancient Ancyrian might have spoken Greek as a common language in the city.","zh":"古代安居拉人可能把希腊语作为城中的通用语言。"}]}],"synonyms":["Ankaran (modern, rarer)","of Ancyra","from Ancyra"],"phonetic":"/ænˈsaɪriən/","extraExplanation":["“Ancyrian”主要出现在历史、考古、古典学写作中，用来指代“安居拉（Ancyra）”这一古地名相关的人与事。安居拉在罗马时期具有重要地位，常见于关于小亚细亚（今土耳其境内）历史的讨论。","相关词：Ancyra（安居拉，地名）；Ankara（安卡拉，现代地名）。在现代语境里，人们更常说“of Ankara / from Ankara”，而不是“Ancyrian”。"]}
{"word":"ancyroid","summary":{"en":"“Ancyroid” is not a standard word; it likely means “android,” a human-like robot or Google’s Android OS.","zh":"“ancyroid”不是标准单词；多半是想写“android”，指类人机器人或谷歌的Android系统。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “android.”","zh":"不是标准英语单词；很可能是“android”的拼写错误。"},"examples":[{"en":"I couldn’t find “ancyroid” in the dictionary—did you mean “android”?","zh":"我在词典里找不到“ancyroid”——你是不是想写“android”？"},{"en":"Many people accidentally type “ancyroid” when they mean “android,” a human-like robot.","zh":"很多人会不小心把“android”打成“ancyroid”；“android”指类人机器人。"}]},{"partOfSpeech":"n.","definition":{"en":"(Likely intended) “android”: a robot or artificial being designed to look and act like a human; also commonly refers to Google’s mobile operating system (Android).","zh":"（可能本意）“android”：外形和行为像人的机器人；也常指谷歌的手机操作系统（Android）。"},"examples":[{"en":"The movie features an android that learns human emotions.","zh":"这部电影里有个会学习人类情感的类人机器人。"},{"en":"My phone runs on Android, not iOS.","zh":"我的手机用的是Android系统，不是iOS。"},{"en":"In science fiction, an android often raises questions about what makes someone human.","zh":"在科幻作品里，类人机器人常引出“什么让一个人成为人”的问题。"}]}],"synonyms":["robot","humanoid","automaton"],"phonetic":"/ˈænˌdrɔɪd/","extraExplanation":["“android”来自希腊语词根 andr-（男人、人类）+ -oid（……似的），字面意思是“像人一样的”。在文学与影视中，它常与“robot（机器人）”“cyborg（半机械人）”对比：android 强调“外形像人”；cyborg 强调“人身与机器的结合”。"]}

