{"word":"ANF","summary":{"en":"ANF is an abbreviation that most commonly refers to Abercrombie & Fitch or, in medical contexts, atrial natriuretic factor (ANP).","zh":"ANF是缩写，常见指Abercrombie & Fitch（服装品牌/股票代码），或在医学语境中指心房利钠因子（ANP）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Abercrombie & Fitch, an American casual clothing brand (also the NYSE stock ticker symbol “ANF”).","zh":"Abercrombie & Fitch（美国休闲服饰品牌；在纽约证券交易所的股票代码也为“ANF”）。"},"examples":[{"en":"She bought a hoodie from A&F (ANF).","zh":"她在A&F（ANF）买了一件连帽衫。"},{"en":"ANF shares rose after the company reported strong sales.","zh":"公司公布强劲销售额后，ANF（该股）股价上涨。"}]},{"partOfSpeech":"other","definition":{"en":"Atrial natriuretic factor, a hormone made by the heart that helps the body remove extra salt and water (often called ANP: atrial natriuretic peptide).","zh":"心房利钠因子（由心脏分泌的激素，帮助排出多余的盐和水；也常称为ANP：心房利钠肽）。"},"examples":[{"en":"Doctors study ANF/ANP to understand blood pressure control.","zh":"医生研究ANF/ANP来理解血压的调节机制。"},{"en":"ANF helps the kidneys excrete sodium and water.","zh":"ANF帮助肾脏排出钠和水。"}]}],"synonyms":["A&F","Abercrombie & Fitch","ANP (atrial natriuretic peptide)"],"phonetic":"/ˌeɪ ˌɛn ˈɛf/","extraExplanation":["“ANF”是缩写，具体含义高度依赖语境：在日常生活/商业新闻里常指服装品牌（或股票代码）；在医学、生理学文章里更可能指心房利钠因子（也常写作ANP）。阅读时可通过周围词（如stock/shares vs. hormone/kidney/blood pressure）来判断。"]}
{"word":"anfeeld","summary":{"en":"Anfield is Liverpool F.C.’s home stadium in Liverpool, England.","zh":"Anfield 是英格兰利物浦利物浦足球俱乐部的主场球场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Anfield: the football (soccer) stadium in Liverpool, England, best known as the home stadium of Liverpool F.C.","zh":"安菲尔德球场：位于英格兰利物浦的足球场，最著名的是利物浦足球俱乐部（Liverpool F.C.）的主场。"},"examples":[{"en":"Liverpool played at Anfield on Saturday night.","zh":"利物浦在周六晚上在安菲尔德比赛。"},{"en":"Many fans say the atmosphere at Anfield is special.","zh":"很多球迷说安菲尔德的氛围很特别。"}]}],"synonyms":["Liverpool F.C.’s home ground","the stadium at Anfield"],"phonetic":"ˈænfiːld","extraExplanation":["你输入的“anfeeld”很可能是拼写错误，常见正确写法是 **Anfield**。","安菲尔德在英语新闻与足球文化中经常出现，常与利物浦队歌 **“You’ll Never Walk Alone”**、以及“the Kop（看台/死忠球迷区）”等表达一起出现。"]}
{"word":"anfract","summary":{"en":"Anfract means a winding bend or turn, used in formal or scientific contexts.","zh":"anfract 指“弯曲、曲折的转弯/弧线”，多用于正式或学术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a winding turn, bend, or irregular curve (often used in formal writing or anatomy/geology).","zh":"（较正式用语）弯曲处；曲折的转弯；不规则的弧线（常见于解剖或地质语境）。"},"examples":[{"en":"The hikers followed the river’s anfract through the narrow valley.","zh":"徒步者沿着河流在狭窄山谷中的曲折弯道前行。"},{"en":"In some old texts, the brain’s surface is described as a series of anfracts.","zh":"在一些旧文献中，大脑表面被描述为一连串的曲折沟回。"}]}],"synonyms":["bend","turn","curve","twist","winding"],"phonetic":"/ˈænfrækt/","extraExplanation":["这个词非常少见，更多时候你会见到形容词 anfractuous（“曲折的、蜿蜒的”）。","词源来自拉丁语 anfractus，意为“弯曲、转弯”；因此它常出现在较学术或较古典的描写里（解剖学、地质学或文学性描写）。"]}
{"word":"anfractuose","summary":{"en":"Anfractuose means “winding and full of turns,” and it’s a rare, literary adjective.","zh":"anfractuose 表示“蜿蜒曲折、迂回多弯”，是较罕见、偏文学/书面语的形容词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) full of twists and turns; winding; tortuous.","zh":"（罕见）蜿蜒曲折的；迂回的；多弯道的。"},"examples":[{"en":"A narrow, anfractuose path led through the hills.","zh":"一条狭窄而蜿蜒曲折的小路穿过群山。"},{"en":"The river follows an anfractuose course before reaching the sea.","zh":"这条河在入海前沿着曲折的河道流淌。"},{"en":"In some old novels, writers describe anfractuose corridors to create a feeling of mystery.","zh":"在一些老小说里，作者会描写曲折的走廊来营造神秘感。"}]}],"synonyms":["winding","twisty","tortuous","sinuous","convoluted"],"phonetic":"/ænˈfræk.tʃu.oʊs/","extraExplanation":["“anfractuose”较少见，更常见的同源词是 **anfractuous**，意思基本相同。","词源来自拉丁语 *anfractus*，意为“弯曲、回旋”。因此它常用于描写地形（小路、河道、山谷）或抽象事物（论证、过程）“不直、绕来绕去”的感觉。","文学表达中，它带有较强的书面与古典色彩；日常英语里更常用 **winding / twisty / convoluted / tortuous**。"]}
{"word":"anfractuosity","summary":{"en":"Anfractuosity means winding complexity—either the quality of being full of twists and turns, or a winding passage/cavity.","zh":"Anfractuosity 指“曲折蜿蜒”：既可指弯曲复杂的特性，也可指蜿蜒的通道/腔道。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being full of twists and turns; winding, convoluted shape (often used in scientific or literary writing).","zh":"弯弯曲曲、曲折盘绕的性质；蜿蜒复杂的形态（常见于科学或文学用语）。"},"examples":[{"en":"The river’s anfractuosity slows the flow of water.","zh":"河道的曲折蜿蜒会减缓水流速度。"},{"en":"Writers sometimes describe the anfractuosity of a mountain road to create a vivid scene.","zh":"作家有时会描写山路的曲折盘绕，以营造生动的画面。"}]},{"partOfSpeech":"n.","definition":{"en":"a winding passage, cavity, or channel (especially in anatomy or geology).","zh":"蜿蜒的通道、腔道或沟槽（尤用于解剖学或地质学语境）。"},"examples":[{"en":"The cave system has narrow anfractuosities that are hard to navigate.","zh":"这个洞穴系统有狭窄蜿蜒的通道，很难穿行。"},{"en":"Microscopic anfractuosities in the rock can hold small amounts of water.","zh":"岩石中的微小曲折孔隙可以储存少量水分。"}]}],"synonyms":["windingness","tortuosity","convolutedness","twisting complexity","meanderingness"],"phonetic":"/ˌænfrækˈtuːəsi/","extraExplanation":["词源上来自拉丁语 anfractus（“弯曲、回旋”），因此常带有“曲折盘绕、非直线”的画面感。","语体偏正式、偏学术，日常英语里更常用 winding、twisting、convoluted、meandering 等词来表达类似意思。"]}
{"word":"anfractuous","summary":{"en":"Anfractuous means “winding and full of twists,” used in formal or literary contexts for paths, shapes, or even complicated reasoning.","zh":"anfractuous 指“曲折蜿蜒、迂回复杂”，多用于正式或文学语境，可形容道路/形状，也可比喻思路或解释复杂绕弯。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Full of twists and turns; winding in a complicated way (often used in formal or literary writing).","zh":"曲折的；蜿蜒复杂的（常见于正式或文学语境）。"},"examples":[{"en":"We followed an anfractuous mountain path to the village.","zh":"我们沿着一条曲折的山路走到村子。"},{"en":"The lawyer gave an anfractuous explanation that confused everyone.","zh":"律师给出了一个迂回复杂的解释，把大家都弄糊涂了。"}]}],"synonyms":["winding","twisting","tortuous","sinuous","meandering"],"phonetic":"/ænˈfræk.tʃu.əs/","extraExplanation":["这是一个较少见、偏文学/学术的词，常用来形容“道路、河流、洞穴”等地形的蜿蜒，也可比喻“论证、叙述、程序”非常迂回复杂。","词源上来自拉丁语 anfractus，含有“弯曲、曲折”的意思；因此它的语气通常比常见的 winding / twisty 更正式。","文学中偶尔会用它来营造“迷宫般、盘旋迂回”的氛围；日常英语里更常用 winding、twisting、tortuous（更强调折磨人/难以应付的曲折）。"]}
{"word":"anfractuousness","summary":{"en":"Anfractuousness means the quality of being winding and full of twists, or figuratively, overly complicated and indirect.","zh":"anfractuousness 指“蜿蜒曲折”的特性，也可比喻“表达或论证过于复杂、不直接”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of having many twists, bends, or winding turns; being complicated and not straightforward (often used about paths, arguments, or writing).","zh":"曲折性；蜿蜒多弯；（道路、论证或文字等）不直接、复杂难懂的特性。"},"examples":[{"en":"The mountain trail’s anfractuousness made the hike slow but beautiful.","zh":"那条山路的蜿蜒曲折让徒步变慢，但风景很美。"},{"en":"Readers complained about the anfractuousness of the author’s argument.","zh":"读者抱怨作者的论证过于曲折难懂。"},{"en":"To reduce anfractuousness, he rewrote the report in simpler language.","zh":"为了减少文章的曲折复杂，他用更简单的语言重写了报告。"}]}],"synonyms":["windingness","tortuosity","convolutedness","complexity"],"phonetic":"/ˌænˈfræk.tʃu.əs.nəs/","extraExplanation":["这个词很少在日常口语里出现，更常见于正式写作、文学评论或学术语境，用来强调“曲折/绕来绕去”的感觉。","词源上与表示“弯曲、迂回”的拉丁语词根有关，所以它既能形容“道路很蜿蜒”，也能比喻“思路或表达很不直白”。日常更常用 winding / twisty（路）或 complicated / convoluted（表达、论证）。"]}
{"word":"anfracture","summary":{"en":"Anfracture means a winding or irregular turn or cavity, often used in technical contexts like anatomy or geology.","zh":"Anfracture 指弯曲或不规则的转折/凹陷，多用于解剖学或地质学等技术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a winding or irregular turn, curve, or cavity (especially in anatomy or geology).","zh":"（尤指解剖学或地质学中的）弯曲处；曲折的凹陷/裂隙。"},"examples":[{"en":"The surgeon carefully inspected the anfractures of the inner ear.","zh":"外科医生仔细检查了内耳的曲折腔道。"},{"en":"Water collected in the rock’s anfractures after the storm.","zh":"暴风雨过后，水积在岩石的曲折裂隙里。"}]}],"synonyms":["winding turn","twist","convolution","sinuosity","crevice (context-dependent)"],"phonetic":"/ænˈfræk.tʃɚ/","extraExplanation":["这是一个较罕见的书面词，常见于医学、解剖学、地质学等偏学术语境。日常英语里更常用 winding curve（弯曲）、crevice（裂缝）、nook（角落/凹处）等表达。","词源来自拉丁语 anfractus，含“弯曲、回旋”的意思；相关词有形容词 anfractuous（曲折的、迂回的），以及名词 anfractuosity（曲折/凹陷，常用复数）。"]}
{"word":"Anfuso","summary":{"en":"“Anfuso” is mainly used as an Italian-origin surname in English.","zh":"“Anfuso” 在英语中主要作为意大利来源的姓氏使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surname (family name), most commonly of Italian origin.","zh":"一个姓氏（家族名），多见于意大利语背景。"},"examples":[{"en":"My teacher’s last name is Anfuso.","zh":"我老师的姓是 Anfuso。"},{"en":"Please spell Anfuso for the registration form.","zh":"请把 Anfuso 拼写出来，用于登记表。"}]}],"synonyms":["family name","surname","last name"],"phonetic":"/ænˈfjuːzoʊ/","extraExplanation":["Anfuso 通常被当作专有名词使用（姓氏），因此不像普通词汇那样有固定“词义”。在英文文本里，你会更多看到它出现在人名、署名、作者/演员/运动员名单或地址簿中。","发音在英语环境中可能会因地区与个人习惯略有变化；如果你告诉我你在哪个国家/地区看到这个名字（或提供一句原文），我可以更贴近语境地给出读法建议。"]}
