{"word":"Anh","summary":{"en":"“Anh” is commonly a Vietnamese term of address for an older male (“older brother”) and also a common Vietnamese given name.","zh":"“Anh”常见于越南语：可作对年长男性的称呼（“哥哥”），也常作为越南人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Vietnamese word used as a respectful way to address an older brother, or a slightly older male (often translated as “older brother” or sometimes “you” to a male).","zh":"越南语中用来礼貌称呼哥哥或年龄略长的男性（常译为“哥哥”，有时也相当于对男性的“你”）。"},"examples":[{"en":"In Vietnamese, you might call your boyfriend “anh” if he is older than you.","zh":"在越南语里，如果男朋友比你大，你可能会称呼他为“anh”。"},{"en":"She said, “Anh, can you help me?” using “anh” as a respectful form of address.","zh":"她说：“Anh，你能帮我吗？”这里用“anh”作为礼貌称呼。"}]},{"partOfSpeech":"n.","definition":{"en":"a Vietnamese given name (and sometimes part of a full name).","zh":"越南语名字（也可能是全名的一部分）。"},"examples":[{"en":"Anh Nguyen will present first.","zh":"Anh Nguyen 将首先发言。"},{"en":"My classmate’s name is Anh.","zh":"我同学叫 Anh。"}]}],"synonyms":["older brother (as a translation)","Vietnamese honorific (general category)"],"phonetic":"/ɑŋ/","extraExplanation":["“anh”在越南语亲属称谓系统里很常见，不只是亲兄弟之间使用，也常用于称呼比自己年长或地位更高的男性，以表达礼貌和亲近感。对应地，女性常用“chị”（姐姐）称呼年长女性。","作为人名时，“Anh”在越南很常见；在英语语境里通常被当作专有名词使用，是否重音、如何拼读可能因个人偏好而不同。"]}
{"word":"anhaematopoiesis","summary":{"en":"Anhaematopoiesis means a lack of blood-cell production (hematopoiesis), usually due to bone marrow failure.","zh":"Anhaematopoiesis 指造血（血细胞生成）缺失，通常与骨髓衰竭有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the complete or near-complete absence of hematopoiesis (blood-cell formation) in the body, especially in the bone marrow.","zh":"（尤指骨髓中）造血功能的完全或几乎完全缺失，即血细胞生成停止或严重不足。"},"examples":[{"en":"Severe marrow failure can lead to anhaematopoiesis, causing dangerously low blood cell counts.","zh":"严重的骨髓衰竭可能导致 anhaematopoiesis，使血细胞计数危险性降低。"},{"en":"The report noted signs consistent with anhaematopoiesis after exposure to toxic chemicals.","zh":"报告指出，在接触有毒化学物质后出现了与 anhaematopoiesis 相符的迹象。"}]}],"synonyms":["absence of hematopoiesis","failure of hematopoiesis","bone marrow aplasia (related)","aplastic anemia (related)"],"phonetic":"/ˌænhiːˌmætəpoʊˈiːsɪs/","extraExplanation":["这是一个医学术语，常见于学术论文或病理报告中：an-（否定/缺失）+ haematopoiesis（造血）。英式拼写常写作 haematopoiesis（含 ae），美式更常见写法是 hematopoiesis；因此你也可能看到 anaematopoiesis / anhematopoiesis 等变体。","临床上它常与“再生障碍性贫血（aplastic anemia）/骨髓衰竭（bone marrow failure）”相关，但两者不完全等同：anhaematopoiesis强调“造血这一过程缺失”，而诊断名称还会结合原因、程度和检查结果。"]}
{"word":"anhaematosis","summary":{"en":"Anhaematosis means the oxygenation of blood in the lungs.","zh":"Anhaematosis 指血液在肺部进行氧合的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of oxygenating the blood in the lungs; the conversion of venous (deoxygenated) blood into arterial (oxygenated) blood","zh":"（在肺部）血液氧合的过程；将静脉血（缺氧血）转变为动脉血（含氧血）的过程"},"examples":[{"en":"In normal breathing, anhaematosis happens in the lungs as blood picks up oxygen.","zh":"在正常呼吸中，血液在肺部吸收氧气时就会发生 anhaematosis（血液氧合）。"},{"en":"Diseases that damage the air sacs can reduce anhaematosis and lead to low blood oxygen.","zh":"损害肺泡的疾病会降低 anhaematosis（氧合效率），导致血氧偏低。"}]}],"synonyms":["oxygenation","blood oxygenation","pulmonary oxygenation"],"phonetic":"/ˌænhiːməˈtoʊsɪs/","extraExplanation":["这是一个较少见的医学/生理学术语，常见写法也可见于 **anaematosis**（拼写变体）。","词源可拆为：**an-/ana-（向上、再） + haima/haem-（血） + -osis（过程/状态）**，整体指“血液变为含氧状态的过程”。在现代医学英语中，更常用的相关词是 **oxygenation**（氧合）或 **blood oxygenation**（血液氧合）。"]}
{"word":"anhaemolytic","summary":{"en":"Anhaemolytic means “non-hemolytic”: not causing the breakdown of red blood cells, especially in lab descriptions of bacteria on blood agar.","zh":"anhaemolytic 意为“不溶血的”：不引起红细胞溶解，常用于描述细菌在血琼脂上的溶血表现。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not causing hemolysis (not breaking red blood cells); in microbiology, describes bacteria that do not lyse red blood cells on blood agar.","zh":"不引起溶血的（不破坏红细胞的）；在微生物学中，指在血琼脂培养基上不溶解红细胞的细菌。"},"examples":[{"en":"The culture was reported as anhaemolytic on blood agar.","zh":"该培养物在血琼脂上被报告为不溶血。"},{"en":"Anhaemolytic streptococci do not form a clear or green zone around colonies.","zh":"不溶血性链球菌在菌落周围不会形成透明区或绿色变色区。"}]}],"synonyms":["non-hemolytic","anhemolytic","gamma-hemolytic"],"phonetic":"/ˌænˌhiːməˈlɪtɪk/","extraExplanation":["“anhaemolytic”多见于英式拼写（含“hae-”），美式更常写作“anhemolytic”。","在实验室报告中，它通常对应“γ-hemolysis（伽马溶血）”，意思是“无溶血”，与“α-hemolysis（部分溶血，常见绿色变色）”和“β-hemolysis（完全溶血，透明溶血环）”相对。","这是专业医学/微生物学术语，日常英语中很少使用；读到时重点抓住“an-（不）+ haemolytic（溶血的）”。"]}
{"word":"anhalamine","summary":{"en":"Anhalamine is a cactus alkaloid (not a common everyday word), often mentioned in scientific discussions of peyote and related plant chemicals.","zh":"Anhalamine 是一种来自某些仙人掌的生物碱（非日常常用词），多用于关于佩奥特及相关植物化学成分的科学讨论。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a naturally occurring alkaloid found in some cacti (especially peyote), related to phenethylamines; studied in chemistry and pharmacology and sometimes mentioned in discussions of psychoactive plant compounds","zh":"一种天然生物碱，存在于某些仙人掌（尤其是佩奥特/仙人掌毒球）中；与苯乙胺类化合物相关，常见于化学与药理研究语境，也会出现在关于致幻植物成分的讨论中"},"examples":[{"en":"Researchers analyzed peyote and identified several minor alkaloids, including anhalamine.","zh":"研究人员分析了佩奥特仙人掌，并鉴定出包括 anhalamine 在内的多种微量生物碱。"},{"en":"In the article, anhalamine was mentioned as one of the compounds related to phenethylamine chemistry.","zh":"文章中提到 anhalamine 是与苯乙胺化学相关的化合物之一。"}]}],"synonyms":["alkaloid","cactus alkaloid"],"phonetic":"/ænˈhæl.ə.miːn/","extraExplanation":["该词多见于学术或科普文本，而不是日常英语。来源上与早期对“Anhalonium”（旧属名，常指佩奥特相关仙人掌）的研究有关，因此拼写与分类学历史有联系。","在文化语境中，佩奥特与北美部分原住民宗教仪式有关；讨论相关化学成分时应注意尊重文化与法律差异。"]}
{"word":"anhaline","summary":{"en":"Aniline is a toxic chemical liquid widely used in making dyes and other industrial products.","zh":"苯胺是一种有毒的化学液体，广泛用于制造染料等工业产品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a colorless, oily, poisonous liquid used to make dyes, medicines, plastics, and other chemicals (a type of aromatic amine).","zh":"苯胺：一种无色、油状、有毒液体，用于制造染料、药品、塑料等化学品（芳香胺的一种）。"},"examples":[{"en":"Aniline is an important starting material for making many industrial dyes.","zh":"苯胺是制造许多工业染料的重要原料。"},{"en":"Because aniline is toxic, workers must use protective equipment when handling it.","zh":"由于苯胺有毒，工人在处理它时必须使用防护装备。"}]}],"synonyms":["phenylamine","aminobenzene"],"phonetic":"/ˈænəˌlin/","extraExplanation":["你输入的 **anhaline** 很可能是 **aniline（苯胺）** 的拼写误差；在常见英语词典与语料中，*anhaline* 不是常用词。","**词源小贴士**：*aniline* 源自与靛蓝染料相关的词根（历史上与从植物提取染料的过程有关），因此它常出现在“染料/化工”语境里。"]}
{"word":"anhalonidine","summary":{"en":"Anhalonidine is a rare scientific term for an alkaloid found in peyote cactus.","zh":"Anhalonidine 是一个较少见的科学词汇，指存在于佩奥特仙人掌中的一种生物碱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a naturally occurring alkaloid found in the peyote cactus and some related plants, studied in chemistry and pharmacology.","zh":"一种天然生物碱，存在于佩奥特（peyote）仙人掌及部分相关植物中，常见于化学与药理学研究语境。"},"examples":[{"en":"Anhalonidine is one of several alkaloids reported in peyote.","zh":"Anhalonidine 是据报道存在于佩奥特中的多种生物碱之一。"},{"en":"The paper analyzed anhalonidine using chromatography.","zh":"该论文使用色谱法分析了 anhalonidine。"}]}],"synonyms":["peyote alkaloid","plant alkaloid"],"phonetic":"/ænˌhæl.oʊˈnaɪ.diːn/","extraExplanation":["这个词非常少见，主要出现在学术文献（植物化学/药理学）里，而不是日常英语。","佩奥特（peyote）在部分北美原住民宗教传统中具有神圣意义；在谈论其化学成分时，尽量保持尊重与文化敏感。","与佩奥特相关的物质在不同地区可能涉及法律限制；如果你的用途与采购/使用有关，建议先确认当地法规与合规渠道。"]}
{"word":"anhalonin","summary":{"en":"Anhalonine is a rarely used scientific term for an alkaloid associated with peyote; your spelling “anhalonin” is likely a variant.","zh":"Anhalonine 是一个较少见的科学用词，指与佩奥特相关的一种生物碱；你写的 “anhalonin” 很可能是拼写变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An alkaloid (a natural chemical) found in the peyote cactus and related plants, discussed in older scientific writing about their psychoactive compounds.","zh":"一种生物碱（植物产生的天然化学物质），存在于佩奥特仙人掌（peyote）及相关植物中，常见于较早期关于其致幻/精神活性成分的科学文献。"},"examples":[{"en":"Early studies of peyote listed anhalonine among its alkaloids.","zh":"早期对佩奥特的研究把 anhalonine 列为其生物碱之一。"},{"en":"The paper compared mescaline with other compounds such as anhalonine.","zh":"这篇论文把麦司卡林（mescaline）与包括 anhalonine 在内的其他化合物作了比较。"}]}],"synonyms":["alkaloid","peyote alkaloid"],"phonetic":"/ænˈhæl.ə.niːn/","extraExplanation":["你输入的 **anhalonin** 更像是拼写变体或拼写错误；英语资料里更常见的形式是 **anhalonine**。如果你是在某篇文章/药理或植物学资料里看到的拼写，我也可以根据原句帮你确认到底指哪一个化合物。","与佩奥特相关的词汇涉及北美原住民宗教与传统用法；在学习词义时也建议注意文化背景与法律/安全风险。"]}
{"word":"anhalonine","summary":{"en":"Anhalonine is a rare scientific term for an alkaloid found in peyote cactus.","zh":"Anhalonine 是一个较少见的科学词，指佩奥特仙人掌中的一种生物碱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural alkaloid found in the peyote cactus and some related cacti, studied for possible effects on the nervous system (it is chemically related to other peyote alkaloids).","zh":"一种天然生物碱，存在于佩奥特（peyote）仙人掌及部分近缘仙人掌中；因可能对神经系统产生作用而被研究（在化学上与其他佩奥特生物碱有关）。"},"examples":[{"en":"Researchers identified anhalonine as one of several alkaloids present in peyote.","zh":"研究人员发现，anhalonine 是佩奥特中存在的多种生物碱之一。"},{"en":"Older scientific texts sometimes list anhalonine alongside other peyote alkaloids in chemical analyses.","zh":"一些较早的科学文献在化学分析中会把 anhalonine 与其他佩奥特生物碱并列列出。"}]}],"synonyms":["peyote alkaloid","alkaloid"],"phonetic":"/ˌæn.həˈloʊ.niːn/","extraExplanation":["“Anhalonine”主要出现在化学与药理学语境里，属于较少见的专业词；日常英语中几乎不会用到。","与佩奥特（peyote）相关的内容在许多原住民文化中具有宗教与仪式意义；在学习或讨论时，尽量使用尊重与中性的表达方式。","如果你是从某篇文章或标签上看到这个词，也有可能是拼写或转写差异（例如与“anhalamine”等相近名称混淆）。你可以把原句发来，我可以帮你确认具体指哪一种化合物。"]}
{"word":"Anhalonium","summary":{"en":"Anhalonium is an old scientific name for the peyote cactus, now usually called Lophophora.","zh":"Anhalonium 是佩奥特仙人掌的旧学名，现多称为 Lophophora（洛福福拉属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former scientific name for the peyote cactus (now usually classified in the genus Lophophora), known for containing psychoactive substances such as mescaline","zh":"一种旧的学名，指“佩奥特仙人掌/佩奥特”（现多归入洛福福拉属 Lophophora），因含有如麦司卡林（mescaline）等致幻成分而知名"},"examples":[{"en":"In older botanical books, peyote may be listed under the name Anhalonium.","zh":"在较早的植物学书籍中，佩奥特可能会以 Anhalonium 这个名字出现。"},{"en":"The museum label mentioned Anhalonium, but the modern classification is Lophophora.","zh":"博物馆标签写着 Anhalonium，但现代分类是 Lophophora。"}]}],"synonyms":["peyote (common name)","Lophophora (modern genus name)"],"phonetic":"/ˌæn.həˈloʊ.ni.əm/","extraExplanation":["Anhalonium 多见于19世纪到20世纪早期的植物分类与药学文献中；后来分类学调整，常见的“peyote”主要被归到 Lophophora（如 Lophophora williamsii）。","在文化语境中，peyote 与北美部分原住民的宗教仪式有关；相关话题在不同地区也涉及法律与伦理问题，阅读或使用资料时要注意当地法规与尊重文化背景。"]}
{"word":"anhalonium","summary":{"en":"Anhalonium is a historical scientific name for the peyote cactus (now usually Lophophora).","zh":"Anhalonium 是“佩奥特仙人掌”（现多作 Lophophora）的旧学名/旧属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An old botanical genus name for the peyote cactus (now usually classified as Lophophora), known for containing mescaline and causing hallucinations.","zh":"一种旧的植物分类属名，指“佩奥特仙人掌/仙人球”（现多归入 Lophophora 属），因含有麦司卡林（mescaline）而会产生致幻作用。"},"examples":[{"en":"In older books, peyote may be listed under the genus name Anhalonium.","zh":"在较早的书里，佩奥特可能会被列在 Anhalonium 这个属名下。"},{"en":"The researcher noted that “Anhalonium” is largely a historical term in modern botany.","zh":"研究者指出，“Anhalonium”在现代植物学中主要是历史用语。"}]}],"synonyms":["peyote","Lophophora"],"phonetic":"/ˌæn.həˈloʊ.ni.əm/","extraExplanation":["“Anhalonium”多见于19世纪到20世纪早期的植物学与药物学文献；随着分类学更新，相关物种通常改归为 Lophophora（如 Lophophora williamsii，即 peyote）。","Peyote 在部分美洲原住民宗教与仪式传统中具有重要文化与精神意义；在许多国家和地区也受到法律管制。学习该词时可将其理解为“旧称/旧分类名”，避免在现代学术写作中误用。"]}
{"word":"anhalouidine","summary":{"en":"Anhalonidine is a rare chemistry term for an alkaloid found in the peyote cactus.","zh":"Anhalonidine 是一个较少见的化学术语，指存在于佩奥特仙人掌中的一种生物碱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) An alkaloid found in the peyote cactus, related to other naturally occurring compounds in the plant.","zh":"（化学）存在于佩奥特仙人掌（peyote）中的一种生物碱，与该植物中的其他天然化合物有关。"},"examples":[{"en":"Scientists have identified several alkaloids in peyote, including anhalonidine.","zh":"科学家在佩奥特仙人掌中鉴定出多种生物碱，包括 anhalonidine。"},{"en":"In older research papers, anhalonidine is listed as one of the minor alkaloids of the cactus.","zh":"在较早的研究论文中，anhalonidine 常被列为该仙人掌中的一种次要生物碱。"}]}],"synonyms":["anhalonidine"],"phonetic":"/ænˌhælənˈɪdiːn/","extraExplanation":["你输入的 **anhalouidine** 不是常见英文拼写；最接近、也更常见于资料中的词是 **anhalonidine**（少见的生物碱名称）。如果你想查的是别的词（例如拼写不同的化学品/药物名），把来源句子或上下文贴出来，我可以帮你准确定位。","关于文化与语境：peyote 在一些北美原住民宗教传统中具有重要意义；在不同国家/地区也可能受法律管制。学习该词时可将其视为“植物化学/民族植物学”语境中的专门词汇。"]}
{"word":"Anhalt","summary":{"en":"Anhalt is a historical region/former state in central Germany, now mostly within Saxony-Anhalt.","zh":"Anhalt（安哈尔特）是德国中部的历史地区/旧邦国名称，如今主要属于萨克森-安哈尔特州。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historical region and former state in central Germany; today it is mainly part of the German federal state of Saxony-Anhalt.","zh":"德国中部的一个历史地区与旧邦国名称；现今其大部分地域属于德国联邦州“萨克森-安哈尔特州”（Saxony-Anhalt）。"},"examples":[{"en":"Dessau was once a major city in Anhalt.","zh":"德绍（Dessau）曾是安哈尔特的重要城市。"},{"en":"The name Anhalt survives today in the state name Saxony-Anhalt.","zh":"“安哈尔特”这个名称如今保留在州名“萨克森-安哈尔特”中。"}]}],"phonetic":"/ˈæn.hɔlt/","extraExplanation":["“Anhalt”更常见于历史、地理或家族/王室背景中（如“Duchy of Anhalt”安哈尔特公国）。","现代行政区划中最常见的相关用法是“Saxony-Anhalt”（德语：Sachsen-Anhalt），这是德国16个联邦州之一。"]}
{"word":"anhang","summary":{"en":"Anhang (German) means an appendix/attachment or an annex—extra material added to a main document or something physically attached.","zh":"Anhang（德语）指“附录/附件”或“附属部分（附楼、附加物）”，用于补充主文档或表示附加连接的东西。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(German) an appendix or attachment added at the end of a document (for example, extra tables, references, or supporting information).","zh":"（德语）附录；附件（通常放在文件末尾，用来补充表格、参考资料或支持性信息）。"},"examples":[{"en":"See the Anhang for the full list of sources.","zh":"完整的来源列表请看附录（Anhang）。"},{"en":"The contract includes an Anhang with technical specifications.","zh":"这份合同包含一个写有技术规格的附件（Anhang）。"}]},{"partOfSpeech":"n.","definition":{"en":"(German, more general) an annex or add-on—something attached or connected to something else.","zh":"（德语，更广义）附属物；附加部分；加挂/连接的东西。"},"examples":[{"en":"The building has an Anhang used as a storage room.","zh":"这栋楼有一个用作储藏室的附属建筑（Anhang）。"},{"en":"There is an extra Anhang to the main report.","zh":"主报告还有一个额外的补充附件（Anhang）。"}]}],"synonyms":["appendix","annex","attachment","addendum"],"phonetic":"/ˈɑn.hɑŋ/","extraExplanation":["“Anhang”是德语名词，在德语中名词首字母要大写，所以你常见到“der Anhang”。在英语语境里，它多出现在德语文件/论文中，英文通常对应“appendix / annex / attachment”。","如果你是在某个软件或文件系统里看到“Anhang”，也可能指“附件/附加文件”（例如邮件附件的德语说法更常见是“Anhang/Anlage”，不同地区和场景会用不同词）。"]}
{"word":"Anhanga","summary":{"en":"Anhanga is a spirit/demon figure from Tupi-Guarani mythology, associated with forests and misfortune and sometimes seen as a protector of animals.","zh":"Anhanga 是图皮-瓜拉尼神话中的精灵/恶魔形象，与森林与厄运相关，有时也被视为动物守护者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A spirit or demon in Tupi-Guarani (Indigenous Brazilian) mythology, often linked with the forest, death, and misfortune; sometimes seen as a protector of animals who punishes hunters who kill too much.","zh":"图皮-瓜拉尼（巴西原住民）神话中的一种精灵或恶魔形象，常与森林、死亡与厄运相关；有时也被视为动物的守护者，会惩罚过度猎杀的猎人。"},"examples":[{"en":"In some stories, Anhanga appears in the forest to frighten hunters away from harming animals.","zh":"在一些故事里，Anhanga 会在森林中出现，吓退猎人，阻止他们伤害动物。"},{"en":"The legend of Anhanga is part of Brazil’s rich Indigenous oral tradition.","zh":"关于 Anhanga 的传说是巴西丰富的原住民口述传统的一部分。"}]}],"synonyms":["evil spirit","demon","forest spirit"],"phonetic":"/ɑnˈhɑŋɡə/","extraExplanation":["Anhanga 通常被当作专有名词使用（首字母大写），来源于图皮语系相关文化。不同地区与不同叙事版本中，它的形象可能从“作祟的恶灵”到“守护森林与动物的存在”不等。","在葡萄牙语与巴西民间传说的传播中，Anhanga 有时会与“夜间出没、制造恐惧”的妖灵形象相连接，因此在现代文本里含义也可能更偏向泛指“恶灵/妖怪”。"]}
{"word":"anhanga","summary":{"en":"Anhanga is a spirit from Brazilian (Tupi-Guarani) folklore, often seen as a demon or forest guardian connected to wild animals.","zh":"Anhanga 是源自巴西（图皮-瓜拉尼）民间传说的灵体，常被视为恶灵或森林守护者，与野生动物有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Brazilian/Tupi-Guarani folklore) a powerful spirit, often described as a demon or forest spirit, sometimes seen as a protector of wild animals and a punisher of hunters who kill without need.","zh":"（巴西/图皮-瓜拉尼民间传说）一种强大的灵体，常被描述为恶魔或森林精灵；有时也被视为野生动物的守护者，会惩罚滥杀的猎人。"},"examples":[{"en":"In the story, the hunter fears the Anhanga will punish him for killing too much.","zh":"在故事里，猎人害怕安汉加会因为他过度猎杀而惩罚他。"},{"en":"Some legends say the Anhanga protects the forest and its animals.","zh":"一些传说说安汉加会守护森林和其中的动物。"}]}],"synonyms":["evil spirit","demon","forest spirit","guardian spirit"],"phonetic":"/ɑnˈhɑŋɡə/","extraExplanation":["“Anhanga”来自巴西原住民的图皮语系（尤其与图皮-瓜拉尼文化相关）的神话与传说。不同地区对它的形象并不完全一致：有的把它当作会迷惑、恐吓人的恶灵；也有的强调它惩罚不必要的猎杀、保护森林生态。","英语中该词通常作为专有文化词使用（capital A: Anhanga），多见于介绍巴西民俗、原住民神话、文学或旅游文化的语境。"]}
{"word":"anharmonic","summary":{"en":"Anharmonic means “not perfectly harmonic,” especially when overtones or vibrations don’t line up as exact integer multiples of a fundamental frequency.","zh":"Anharmonic 指“非简谐的”，常用于描述泛音/振动频率不再是基频整数倍的情况。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not perfectly harmonic; involving vibrations whose frequencies are not exact integer multiples of a fundamental frequency (so the overtones are slightly “off”).","zh":"非简谐的；指振动频率不是基频整数倍的情况（泛音会略微“偏离”）。"},"examples":[{"en":"Real piano strings are slightly anharmonic, which affects how the notes sound in the high register.","zh":"真实的钢琴弦会有轻微的非简谐性，这会影响高音区的音色。"},{"en":"Scientists measured the anharmonic vibrations of the molecule at higher temperatures.","zh":"科学家测量了该分子在较高温度下的非简谐振动。"}]},{"partOfSpeech":"adj.","definition":{"en":"In physics and materials science, deviating from a simple harmonic (quadratic) potential; not following Hooke’s-law-like behavior exactly.","zh":"（物理/材料）偏离简单的谐振（二维抛物线势）；不严格遵循类似胡克定律的行为。"},"examples":[{"en":"Anharmonic effects become important when the atoms move far from their equilibrium positions.","zh":"当原子远离平衡位置运动时，非简谐效应就会变得重要。"},{"en":"The model includes anharmonic terms to better match experimental data.","zh":"该模型加入了非简谐项，以更好地匹配实验数据。"}]}],"synonyms":["nonharmonic","nonlinear"],"phonetic":"/ˌæn.hɑrˈmɑn.ɪk/","extraExplanation":["“anharmonic”由前缀 an-（表示“非、无”）+ harmonic（谐波的）构成，常见于声学、量子力学、固体物理等领域。","在音乐声学里，理想弦的泛音应为 2f、3f、4f……；但真实弦的刚性会让高次泛音略高于整数倍，这种现象就叫“非简谐性”（anharmonicity），也解释了为什么钢琴需要“伸缩调律”（stretched tuning）。"]}
{"word":"anhedonia","summary":{"en":"Anhedonia is a reduced ability to feel pleasure or interest in normally enjoyable activities.","zh":"Anhedonia 指对通常会带来快乐的活动感到无乐趣或兴趣下降（快感缺失）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The inability or reduced ability to feel pleasure or interest in activities that used to be enjoyable (often discussed in mental health).","zh":"快感缺失；对原本喜欢的事物感到无乐趣或兴趣下降（常用于心理健康语境）。"},"examples":[{"en":"During the depression, she experienced anhedonia and stopped enjoying music and food.","zh":"在抑郁期间，她出现了快感缺失，连音乐和食物都不再让她感到快乐。"},{"en":"The therapist asked whether anhedonia was making it hard for him to stay motivated.","zh":"治疗师询问快感缺失是否让他难以保持动力。"}]}],"synonyms":["loss of pleasure","inability to feel pleasure","pleasurelessness"],"phonetic":"/ˌænhiˈdoʊniə/","extraExplanation":["词源：来自希腊语 an-（“无/不”）+ hēdonē（“快乐”）。因此字面意思就是“没有快乐”。","用法提示：anhedonia 更偏向医学/心理学用语，日常表达常用 “I don’t enjoy things anymore.”（我对很多事都提不起兴趣了。）或 “Nothing feels fun.”（什么都不觉得好玩。）","相关概念：它常被描述为抑郁症等状态的一个症状，但并不等同于“懒”或“心情不好”；若持续影响生活，建议寻求专业帮助。"]}
{"word":"anhedonic","summary":{"en":"Anhedonic describes a person or state that cannot feel pleasure or enjoyment.","zh":"anhedonic 指“快感缺失的”，即难以或无法感到快乐与享受。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not able to feel pleasure; unable to enjoy things that are usually enjoyable.","zh":"（心理/医学）快感缺失的；无法从通常令人愉快的事物中感到快乐的。"},"examples":[{"en":"During the depression, he felt anhedonic and stopped enjoying music.","zh":"在抑郁期间，他出现了快感缺失，连音乐也不再觉得好听。"},{"en":"The therapist asked whether she had been feeling anhedonic lately.","zh":"治疗师询问她最近是否有快感缺失的感觉。"}]}],"synonyms":["unable to enjoy","joyless","pleasureless"],"phonetic":"/ˌænəˈdɑnɪk/","extraExplanation":["“anhedonic”来自心理学术语“anhedonia（快感缺失）”。前缀an- 表示“没有”，词根 -hedon- 来自希腊语，意为“快乐/享乐”，常见于“hedonism（享乐主义）”。","它常用于临床或学术语境，描述抑郁症、创伤后反应、物质使用障碍等情况下的一个症状（并不等同于“懒”或“冷漠”）。日常口语中更常说 “I can’t enjoy anything lately.”","相关词：hedonic（与快乐/享乐有关的）；anhedonia（名词：快感缺失）。相近但不同：apathetic（冷漠的，缺乏兴趣/关心）不一定强调“无法感到快乐”。"]}
{"word":"anhedral","summary":{"en":"Anhedral describes a crystal/mineral grain that lacks well-formed faces and has an irregular shape.","zh":"anhedral 指晶体/矿物颗粒没有明显晶面、外形不规则（他形）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a crystal or mineral grain) not having well-formed flat faces; having an irregular outline because growth was constrained by surrounding material.","zh":"（晶体或矿物颗粒）无自形晶面；因受周围物质限制而呈不规则外形。"},"examples":[{"en":"Under the microscope, many quartz grains in the rock are anhedral.","zh":"在显微镜下，这块岩石中的许多石英颗粒呈他形（anhedral）。"},{"en":"The anhedral crystals suggest they grew in a crowded melt where space was limited.","zh":"这些他形晶体表明它们在空间受限、晶体拥挤的熔体中生长。"}]}],"synonyms":["irregular","xenomorphic","faceless"],"phonetic":"/ænˈhiːdrəl/","extraExplanation":["词源：an- 表示“无/缺乏”，-hedral 与“面（hedron）”有关，所以 anhedral 字面意思是“没有晶面”。","地质与岩石学里常与 euhedral（自形，有完整晶面）和 subhedral（半自形，部分晶面）一起使用，用来描述矿物晶体的外形与生长环境。","在一些教材或论文中，anhedral 也可用同义术语 xenomorphic（他形）来表达。"]}
{"word":"anhedron","summary":{"en":"An anhedron is a rare geometry term for a face-less polyhedron—only edges and vertices remain.","zh":"Anhedron 是一个较少见的几何术语，指“没有面”的多面体，只剩棱和顶点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Geometry) A “polyhedron” described as having no faces—only edges and vertices; essentially a skeletal (frame-like) polyhedron.","zh":"（几何）一种被描述为“没有面”的多面体：只剩下棱和顶点；本质上是骨架式（框架状）的多面体。"},"examples":[{"en":"In some geometry texts, an anhedron is used as an extreme case: a polyhedron with faces removed, leaving only a framework.","zh":"在一些几何教材中，anhedron 被当作极端情形：把多面体的面“去掉”，只留下框架结构。"},{"en":"You can picture an anhedron as a wire model of a cube—edges and corners, but no solid surfaces.","zh":"你可以把 anhedron 想象成一个立方体的铁丝模型——只有棱和角，没有实体的面。"}]}],"synonyms":["skeletal polyhedron","wireframe model","frame model"],"phonetic":"/ænˈhiːdrən/","extraExplanation":["该词由前缀 an-（“无、非”）+ -hedron（与“面/底面”相关的词根，如 polyhedron 多面体）构成，字面意思就是“无面体”。","它不是日常英语常用词，更常见的表达是 wireframe model（线框模型）、skeletal polyhedron（骨架多面体）或 frame model（框架模型）。在不同教材或语境中，可能作为概念性/类比性术语出现。"]}
{"word":"anhelation","summary":{"en":"Anhelation means panting/shortness of breath, and in literary use it can also mean intense longing.","zh":"Anhelation 指“喘气、气喘”，在文学语境中也可指“强烈的渴望”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"panting or shortness of breath, often from exertion, illness, or strong emotion","zh":"喘气；气喘（常因运动、疾病或强烈情绪导致）"},"examples":[{"en":"After running up the stairs, she spoke in anhelation.","zh":"跑上楼梯后，她气喘吁吁地说话。"},{"en":"The doctor noted his anhelation and checked his oxygen level.","zh":"医生注意到他气喘，于是检查了他的血氧水平。"}]},{"partOfSpeech":"n.","definition":{"en":"(literary) an intense longing or eager desire","zh":"（文学用法）强烈的渴望；迫切的向往"},"examples":[{"en":"He felt anhelation for a life beyond the small town.","zh":"他对小镇之外的生活怀着强烈的向往。"},{"en":"Her anhelation for peace appears in many of her poems.","zh":"她对和平的渴望在她的许多诗中都有体现。"}]}],"synonyms":["panting","shortness of breath","breathlessness","gasping","yearning"],"phonetic":"/ˌæn.həˈleɪ.ʃən/","extraExplanation":["“anhelation”较少用于日常口语，更常见的表达是“panting”“shortness of breath”或“breathlessness”。","词源来自拉丁语 anhelare（喘气、气喘），与“inhale”（吸入）在拼写上相似，但意义不同；“anhel-”更强调“喘”。","文学语境中，它可被作者用来把“呼吸急促”的意象转化为“心中的渴望/向往”，带有修辞色彩。"]}
{"word":"anhele","summary":{"en":"“anhele” isn’t a common English word; it’s likely a typo or a name. If you share the sentence, I can identify the intended word.","zh":"“anhele”不是常见英语单词；很可能是拼写错误或人名。你把它出现的句子发来，我可以帮你判断原本想表达的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a name (proper noun). Common possibilities include “angel,” “Angela,” or “Ansel.”","zh":"不是标准英语单词。可能是拼写错误或人名（专有名词）。常见的可能是“angel（天使）”、“Angela（人名：安吉拉）”或“Ansel（人名：安瑟尔）”。"},"examples":[{"en":"I couldn’t find “anhele” in an English dictionary—did you mean “angel”?","zh":"我在英语词典里找不到“anhele”——你是不是想写“angel（天使）”？"},{"en":"Could you share the sentence where you saw “anhele”?","zh":"你能把你看到“anhele”的句子发我看看吗？"}]}],"phonetic":"ˈæn.hɛl"}
{"word":"anhelose","summary":{"en":"“anhelose” isn’t a standard English word; it’s probably a misspelling or a proper name.","zh":"“anhelose” 不是标准英语单词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“anhelose” is not a standard English word in common dictionaries. It is likely a misspelling or a name. If you share the sentence where you saw it, I can identify the intended word.","zh":"“anhelose” 不是常见词典中的标准英语单词，更可能是拼写错误或专有名词（如人名/品牌名）。如果你把看到它的句子发给我，我可以帮你判断原本想表达的词。"},"examples":[{"en":"I can’t find “anhelose” in standard English dictionaries—could it be a typo?","zh":"我在常见英语词典里查不到 “anhelose”——它会不会是拼写错误？"},{"en":"If you paste the full sentence, I can guess the correct word from context.","zh":"如果你把完整句子贴出来，我可以根据上下文推测正确的单词。"}]}],"extraExplanation":["从拼写上看，“anhelose”可能是以下词的误拼（需要上下文才能确定）：\n1) anhelous（非常少见，意为“气喘的/喘不过气的”）\n2) anhydrous（常见于化学，意为“无水的”）\n3) a name（人名/地名/品牌名，通常不收录为普通词汇）\n把原句或来源（文章/字幕/图片）给我，我可以更准确地帮你定位。"]}
{"word":"anhelous","summary":{"en":"Anhelous means breathless or panting (a rare, literary/medical word).","zh":"anhelous 表示“气喘的、喘不过气的”（罕见，多用于文学或医学）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, literary or medical) Breathless; panting; lacking steady breath.","zh":"（罕见，多见于文学或医学语境）气喘的；喘不过气的；呼吸不稳的。"},"examples":[{"en":"After climbing the stairs, he stood anhelous at the landing, trying to speak.","zh":"爬完楼梯后，他在平台上气喘吁吁地站着，想说话却说不出来。"},{"en":"The patient became anhelous during the asthma attack.","zh":"哮喘发作时，病人出现气喘、呼吸困难。"},{"en":"In the old poem, the hero is described as anhelous from the chase.","zh":"在那首古老的诗里，英雄被描写为追逐后气喘吁吁。"}]}],"synonyms":["breathless","out of breath","panting","winded","dyspneic"],"phonetic":"ænˈhiːləs","extraExplanation":["“anhelous”在现代日常英语里非常少见，更常用的表达是“breathless / out of breath / panting”。在医学语境中也更常见“dyspneic”（呼吸困难的）。","词源上与拉丁语“anhelus”（气喘、喘息的）有关，因此常带有“喘着气、呼吸急促”的画面感，适合文学描写或较正式的文字。"]}
{"word":"anhematopoiesis","summary":{"en":"Anhematopoiesis means a lack or failure of blood cell formation.","zh":"anhematopoiesis 指“无造血/造血功能缺失”，即血细胞生成失败或停止。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine) the absence or failure of blood cell production (no hematopoiesis).","zh":"（医学）无造血；造血功能缺失或衰竭（无法产生血细胞）。"},"examples":[{"en":"Severe bone marrow damage can lead to anhematopoiesis and life-threatening infections.","zh":"严重的骨髓损伤可能导致无造血，并引发生命危险的感染。"},{"en":"The report noted anhematopoiesis as a possible cause of the patient’s low blood counts.","zh":"报告指出“无造血”可能是患者血细胞计数偏低的原因之一。"}]}],"synonyms":["absent hematopoiesis","bone marrow failure","aplastic marrow (contextual)"],"phonetic":"/ˌænˌhiːˌmætəpɔɪˈiːsɪs/","extraExplanation":["这个词较少见，多见于医学/病理学语境，含义接近“造血停止/造血衰竭”。临床表达中更常用的相关说法包括：bone marrow failure（骨髓衰竭）、aplastic anemia（再生障碍性贫血）或 absent hematopoiesis（造血缺如）。","词缀理解：an- 表示“无/缺乏”，hematopoiesis 表示“造血（血细胞生成）”。拼写上更常见的是 hematopoiesis（美式常写 hemat-），英式也常见 haematopoiesis（haemat-）。"]}
{"word":"anhematosis","summary":{"en":"Anhematosis is a rare medical term meaning the absence or failure of normal blood oxygenation in the lungs.","zh":"anhematosis 是一个罕见医学词，指血液在肺部无法正常氧合（血氧化不足）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical, rare) Failure or absence of hematosis—the normal oxygenation of blood in the lungs; lack of proper oxygenation of the blood.","zh":"（医学，罕用）无血氧化／血氧化不足：指血液在肺部未能正常进行氧合，导致血液含氧量不足。"},"examples":[{"en":"Severe lung damage can lead to anhematosis and life‑threatening hypoxia.","zh":"严重的肺部损伤可能导致无血氧化，并引发危及生命的缺氧。"},{"en":"In extreme airway obstruction, doctors may describe the condition as approaching anhematosis.","zh":"在极端的气道阻塞中，医生可能会形容情况接近“无血氧化”。"}]}],"synonyms":["impaired oxygenation","failed oxygenation","hypoxemia (related)","hypoxia (related)"],"phonetic":"/ˌænhiːməˈtoʊsɪs/","extraExplanation":["这个词非常少见，多见于较早期或专门的医学文献。现代临床表达更常用：hypoxemia（低氧血症）、hypoxia（缺氧）、impaired oxygenation（氧合受损）、respiratory failure（呼吸衰竭）。","词形可拆解理解：an-（无、缺乏）+ hematosis（血液氧合）。hematosis 原本指血液在肺部与氧结合的过程。"]}
{"word":"anhemitonic","summary":{"en":"Anhemitonic describes a scale or melody that has no semitone intervals.","zh":"Anhemitonic 指不包含半音的音阶或旋律。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a scale or melody) containing no semitones; all adjacent notes are at least a whole step apart.","zh":"（指音阶或旋律）不含半音；相邻音之间至少相隔一个全音（大二度）或更大。"},"examples":[{"en":"The major pentatonic scale is an anhemitonic scale because it has no semitone steps.","zh":"大调五声音阶是无半音音阶（anhemitonic），因为它没有半音级进。"},{"en":"Many folk tunes use anhemitonic patterns, which often sound open and stable.","zh":"许多民谣使用无半音的音型，因此常听起来更开阔、稳定。"}]}],"synonyms":["non-hemitonic","without semitones"],"phonetic":"/ˌænˌhɛməˈtɑnɪk/","extraExplanation":["词源：an-（无、不）+ hemitone（半音）+ -ic（形容词后缀），字面意思就是“没有半音的”。","音乐理解小提示：没有半音通常意味着少了“紧张的半音摩擦感”，因此常被描述为更“柔和、空灵、稳定”。不过情绪仍取决于节奏、和声与演奏方式。","常见对比：hemitonic（有半音的）与 anhemitonic（无半音的）。例如自然小调是 hemitonic（含半音），而常见的五声音阶多为 anhemitonic。"]}
{"word":"anhemolytic","summary":{"en":"Anhemolytic means “not hemolytic”: it does not cause hemolysis (red blood cell breakdown).","zh":"anhemolytic 表示“不溶血的”：不会引起溶血或红细胞破裂。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not causing hemolysis (not destroying red blood cells)","zh":"不引起溶血的；不会破坏红细胞的"},"examples":[{"en":"The report described the strain as anhemolytic on blood agar.","zh":"报告描述该菌株在血琼脂上表现为不溶血（anhemolytic）。"},{"en":"They chose an anhemolytic solution to reduce the risk of red blood cell damage.","zh":"他们选择了不溶血的溶液，以降低红细胞受损的风险。"}]}],"synonyms":["nonhemolytic","non-haemolytic (BrE spelling)","gamma-hemolytic (common lab label)"],"phonetic":"/ˌænˌhiːməˈlɪtɪk/","extraExplanation":["“an-”是否定前缀，表示“无/不”；“hemolytic”与“溶血（hemolysis）”有关。合起来 anhemolytic 就是“不会引起溶血的”。","在微生物学中常见于描述细菌在血琼脂培养基上的表现：\n- beta-hemolytic：完全溶血（菌落周围透明圈明显）\n- alpha-hemolytic：部分溶血（发绿）\n- anhemolytic（也常写作 gamma-hemolytic）：不溶血（无明显变化）","这是医学/实验室用语，日常英语中很少用；更常在化验单、研究论文或实验记录里出现。"]}
{"word":"Anheuser","summary":{"en":"Anheuser is a surname, most commonly seen in Anheuser-Busch, and is strongly associated with U.S. brewing history.","zh":"Anheuser 是一个姓氏，最常见于 Anheuser-Busch（安海斯-布希），与美国啤酒酿造史密切相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a German-American family name best known from Anheuser-Busch, a major U.S. brewing company (the name is often used to refer to the company or its founders in business/history contexts).","zh":"一个德裔美国人的姓氏，最常见于美国大型啤酒公司“Anheuser-Busch（安海斯-布希）”；在商业或历史语境中也常用来指该公司或其创始家族。"},"examples":[{"en":"Anheuser-Busch became one of the largest beer producers in the United States.","zh":"安海斯-布希（Anheuser-Busch）成为美国最大的啤酒生产商之一。"},{"en":"The Anheuser name is closely tied to American brewing history.","zh":"Anheuser 这个姓氏与美国啤酒酿造史紧密相关。"}]}],"synonyms":["(no true synonyms; proper name)"],"phonetic":"ˈænˌhɔɪzər","extraExplanation":["“Anheuser”通常被视为专有名词（姓氏），日常英语里单独出现不多，更常见于品牌/公司名“Anheuser-Busch”。","读音里常见的分段感觉是“AN-hoy-zer”。在新闻或商业写作中，人们有时会用公司名来代指公司本身（类似用“白宫”指美国政府）。"]}
{"word":"Anheuser-Busch","summary":{"en":"Anheuser-Busch is a major U.S. brewing company known for brands like Budweiser and Bud Light.","zh":"Anheuser-Busch（安海斯-布希）是美国大型啤酒公司，以百威、百威淡啤等品牌著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large American brewing company (often called “AB”); famous for Budweiser and Bud Light.","zh":"美国大型啤酒酿造公司（常简称为“AB”）；以百威（Budweiser）与百威淡啤（Bud Light）等品牌闻名。"},"examples":[{"en":"Anheuser-Busch produces Budweiser, one of the best-known beers in the U.S.","zh":"安海斯-布希生产百威，这是美国最知名的啤酒之一。"},{"en":"The stadium has an Anheuser-Busch sponsorship deal.","zh":"这座体育场与安海斯-布希有赞助合作。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used as an adjective to describe something related to the company or its brands.","zh":"作形容词用：表示“与安海斯-布希公司或其品牌有关的”。"},"examples":[{"en":"They toured an Anheuser-Busch brewery in St. Louis.","zh":"他们参观了位于圣路易斯的一家安海斯-布希啤酒厂。"},{"en":"The event was held at an Anheuser-Busch facility.","zh":"活动在安海斯-布希的一处厂区举办。"}]}],"synonyms":["AB (informal)","Anheuser-Busch InBev (corporate name)","AB InBev (short form)"],"phonetic":"/ˈænˌhɔɪzɚ ˈbʊʃ/","extraExplanation":["“Anheuser-Busch”是德裔家族姓氏组合而成的公司名，常见读法会把它当作一个专有名词整体来念。","公司总部与品牌历史常与美国密苏里州圣路易斯（St. Louis）联系在一起；在商业新闻与体育赞助语境中很常见。","现代商业语境中也常见“AB”或“AB InBev”（其母公司全称 Anheuser-Busch InBev）这样的简称。"]}
{"word":"anhidrosis","summary":{"en":"Anhidrosis means little or no sweating.","zh":"Anhidrosis 指“少汗或无汗”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical condition in which the body cannot sweat normally, or cannot sweat at all.","zh":"无汗症：身体不能正常出汗或完全不出汗的一种医学状况。"},"examples":[{"en":"Because of anhidrosis, she overheats easily during exercise.","zh":"因为无汗症，她运动时很容易过热。"},{"en":"The doctor checked for anhidrosis after he reported dry skin and heat intolerance.","zh":"他反映皮肤干燥、怕热后，医生检查是否存在无汗症。"}]}],"synonyms":["lack of sweating","absence of sweating","hypohidrosis"],"phonetic":"/ˌæn.haɪˈdroʊ.sɪs/","extraExplanation":["词源提示：an- 表示“无/缺少”，hidrosis 与“出汗”有关（hydro- 与“水”相关）。合起来就是“没有出汗”。","学习点：医学语境中常见搭配有 heat intolerance（不耐热/怕热）、overheating（过热）、sweat glands（汗腺）。如果你在日常对话中想表达“出不了汗”，也可说 I can’t sweat normally.（我不能正常出汗。）"]}
{"word":"anhidrotic","summary":{"en":"“Anhidrotic” means not producing sweat or relating to a lack of sweating.","zh":"“Anhidrotic”指不出汗的，或与缺乏出汗有关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not producing sweat; relating to an absence of sweating (anhidrosis).","zh":"无汗的；与不出汗（无汗症）有关的。"},"examples":[{"en":"The doctor noted an anhidrotic response during the heat test.","zh":"医生在耐热测试中记录到无汗反应。"},{"en":"An anhidrotic dog can overheat easily in hot weather.","zh":"无汗的狗在炎热天气里很容易过热。"}]}],"synonyms":["non-sweating","anhidrotic (medical)","related to anhidrosis"],"phonetic":"/ˌænhaɪˈdrɑtɪk/","extraExplanation":["“anhidrotic”是医学/生理学用词，日常英语更常说“not sweating”或“unable to sweat”。","词根拆解有助记忆：an-（无、缺乏）+ hidr-（汗/水，来自希腊语）+ -otic（……的）。","相关名词是“anhidrosis”（无汗症）；它可能由遗传、皮肤损伤、神经问题或某些药物引起，严重时会增加中暑风险。"]}
{"word":"anhima","summary":{"en":"“Anhima” is a scientific name for a genus of South American screamer birds.","zh":"“Anhima”是南美洲叫鹤类鸟的一个属名（科学用语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of South American birds called screamers (large, loud, goose-like birds), in the family Anhimidae","zh":"（鸟类）角叫鹤属／叫鹤属（南美洲的“叫鹤/叫鹤类”鸟，体型较大、叫声响亮，外形有点像鹅，隶属叫鹤科）"},"examples":[{"en":"The anhima is a screamer native to wetlands in South America.","zh":"角叫鹤属的鸟类是南美洲湿地的原生鸟。"},{"en":"In some field guides, species in the genus Anhima are listed under “screamers.”","zh":"在一些野外图鉴中，角叫鹤属（Anhima）的物种会被归在“叫鹤类（screamers）”之下。"}]}],"synonyms":["screamer (bird)","Anhimidae (family name)"],"phonetic":"/ænˈhiːmə/","extraExplanation":["“Anhima”主要是生物学（鸟类分类学）用语，不是日常英语词汇；更常见的相关词是“screamer（叫鹤/叫鹤类鸟）”。","如果你是在查某个具体物种名（如 Anhimidae、horned screamer 等），也可以把完整的拉丁学名或句子发我，我可以帮你对应到更常用的英文名称与用法。"]}
{"word":"Anhimae","summary":{"en":"Anhimae is most likely a misspelling of “animae,” a Latin plural meaning “souls/spirits,” also used as the plural of Jung’s “anima.”","zh":"“Anhimae”很可能是“animae”的误拼；animae 是拉丁语复数，意为“灵魂/精神”，也可作荣格心理学中“anima（阿尼玛）”的复数。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin plural) “souls; spirits; inner life,” plural of anima.","zh":"（拉丁语复数）“灵魂；精神；内在生命”，为 anima 的复数形式。"},"examples":[{"en":"In the poem, the lost animae wander through the ruins.","zh":"在诗中，迷失的灵魂（animae）在废墟中徘徊。"},{"en":"Medieval texts often speak of caring for the animae of the dead.","zh":"中世纪文本常谈到照料亡者的灵魂（animae）。"}]},{"partOfSpeech":"other","definition":{"en":"In Jungian psychology, “animae” can refer to multiple ‘anima’ figures—the inner feminine image in a man’s psyche (plural).","zh":"在荣格心理学中，animae 可指多个“阿尼玛”形象——男性心理中的内在女性意象（复数）。"},"examples":[{"en":"The analyst described several animae appearing across his dreams.","zh":"分析师描述他在梦中出现了好几个阿尼玛形象（animae）。"},{"en":"Different animae may symbolize different stages of emotional growth.","zh":"不同的阿尼玛形象（animae）可能象征情感成长的不同阶段。"}]}],"synonyms":["souls","spirits","inner selves"],"phonetic":"/ˈænɪmiː/","extraExplanation":["“Animae”主要出现在学术、宗教、文学或心理学语境中，属于拉丁语借词；日常英语里更常用 souls / spirits。","容易与日语“anime（日本动画）”混淆：拼写相近但来源与含义完全不同。","发音在英语语境中可能有差异；本条给出的是常见的英语化读法。"]}
{"word":"anhimae","summary":{"en":"“anhimae” isn’t a standard word; you probably mean “anime” (Japanese animation).","zh":"“anhimae”不是标准单词；你很可能想写“anime”（日本动画）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a misspelling of “anime,” the Japanese style of animation.","zh":"这不是标准英文单词；很可能是把“anime”（日式动画/日本动画）拼错了。"},"examples":[{"en":"Did you mean “anime”?","zh":"你是不是想说“anime”（日本动画）？"},{"en":"Many people start learning Japanese because they enjoy anime.","zh":"很多人因为喜欢日本动画（anime）而开始学日语。"}]},{"partOfSpeech":"n.","definition":{"en":"(If you meant “anime”) Japanese animation, including TV series, films, and web shows, often with distinctive art styles.","zh":"（如果你想表达“anime”）指日本动画，包括电视动画、电影动画和网络动画，常见特点是风格鲜明的画风。"},"examples":[{"en":"My favorite anime is a slice-of-life series.","zh":"我最喜欢的日本动画是一部日常向的作品。"},{"en":"That anime film was beautifully animated.","zh":"那部日本动画电影的画面做得非常漂亮。"},{"en":"She watches anime with English subtitles.","zh":"她看带英文字幕的日本动画。"}]}],"synonyms":["Japanese animation","animated series (context-dependent)"],"phonetic":"/ˈænɪmeɪ/","extraExplanation":["“Anime”在英语里通常读作 /ˈænɪmeɪ/，来自日语“アニメ”，是“animation（动画）”的缩略。英语中一般用来专指“日本动画”，而不是所有国家的动画。","如果你原本想输入的是别的词（例如：anima、inhumane、animate 等），可以告诉我你想表达的意思或给我一个句子，我可以帮你确认正确拼写和用法。"]}
{"word":"Anhimidae","summary":{"en":"Anhimidae is the bird family of South American screamers.","zh":"Anhimidae 指南美洲“叫鹤（screamers）”这一鸟类科名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of South American waterbirds called screamers, known for their loud calls and large wing spurs.","zh":"叫作“叫鹤（screamers）”的一科南美洲水鸟，以叫声响亮和翅膀上有明显骨刺而闻名。"},"examples":[{"en":"Birdwatchers in the wetlands hoped to spot a screamer from the family Anhimidae.","zh":"观鸟者在湿地里希望能看到一只属于Anhimidae（叫鹤科）的叫鹤。"},{"en":"Anhimidae includes species that look a bit like geese but are not true geese.","zh":"Anhimidae（叫鹤科）包含一些外形有点像鹅但并不是真正鹅类的物种。"}]}],"synonyms":["screamers (family)"],"phonetic":"/ænˈhɪmɪdi/","extraExplanation":["Anhimidae 是鸟类分类学中的“科”（family），常见英文俗名是 screamers（叫鹤）。现生主要有 3 个物种（如 horned screamer、southern screamer、northern screamer），分布在南美洲的沼泽、湿地与泛滥平原。","词形来自拉丁化的生物学命名；在正式写作中常用斜体属名/种名，但“Anhimidae”作为科名通常首字母大写，不一定斜体。","它们翅膀前缘有角质/骨质刺，遇到威胁时可用来防御；“screamer”这一俗名则来自其非常响亮、远距离可听见的叫声。"]}
{"word":"anhimidae","summary":{"en":"Anhimidae is the scientific family name for South American birds called screamers.","zh":"Anhimidae 是南美“叫鹤/叫雁”（screamers）的鸟类科名（科学分类用语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of large South American birds called screamers, known for loud calls and long, sharp wing spurs (scientific family name).","zh":"叫“叫鹤/叫雁”（screamers）的一科南美大型鸟类，以响亮叫声和翅上的尖锐距刺而闻名（鸟类的科名）。"},"examples":[{"en":"Anhimidae includes birds commonly known as screamers.","zh":"Anhimidae 这一科包括人们常说的“screamers（叫鹤/叫雁）”。"},{"en":"Some species in the Anhimidae family have sharp spurs on their wings for defense.","zh":"Anhimidae 科的一些物种翅上有尖刺，用于防御。"}]}],"synonyms":["screamer family"],"phonetic":"/ænˈhɪmɪdiː/","extraExplanation":["这是拉丁学名（分类学用语），常出现在动物学、观鸟、自然纪录片和学术文章中；日常英语里更常说 screamer 或 the screamer family。","Anhimidae 通常被放在“雁形目”（Anseriformes）相关的分类讨论中，但不同资料的分类细节可能略有差异。"]}
{"word":"anhinga","summary":{"en":"An anhinga is a long-necked water bird in warm parts of the Americas, known for swimming with just its neck showing and drying its wings after diving.","zh":"anhinga（蛇鹈）是一种生活在美洲温暖地区的长颈水鸟，以“只露脖子游泳”和潜水后张开翅膀晾干而出名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, dark water bird with a long neck and a sharp bill, found in warm areas of the Americas; it often swims with only its neck above water and spreads its wings to dry after diving","zh":"一种大型深色水鸟，颈长、嘴尖，分布在美洲温暖地区；常常潜水游泳时只露出脖子，并在潜水后张开翅膀晾干"},"examples":[{"en":"We spotted an anhinga drying its wings on a branch above the swamp.","zh":"我们看到一只蛇鹈站在沼泽上方的树枝上张开翅膀晾干。"},{"en":"An anhinga can look like a snake when it swims with only its neck showing.","zh":"蛇鹈游泳时只露出脖子，看起来像一条蛇。"}]}],"synonyms":["snakebird","water turkey"],"phonetic":"/ænˈhɪŋɡə/","extraExplanation":["“anhinga”在北美也常被叫作“snakebird（蛇鸟）”或“water turkey（水火鸡）”，前者来自它游泳时像蛇一样的长脖子外观。","它的羽毛不像鸭子那样特别防水，所以潜水后常需要张开翅膀晒干；这也是观察这种鸟时很典型的动作特征。"]}
{"word":"anhingas","summary":{"en":"“Anhingas” means more than one anhinga, a fish-eating diving water bird often called a snakebird.","zh":"“Anhingas”是“anhinga（蛇鹈）”的复数，指多只善于潜水捕鱼、又常被称为“蛇鸟”的水鸟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, dark water bird (the anhinga) that swims and dives for fish; also called a “snakebird” because it often swims with only its long neck above the water","zh":"（水鸟）蛇鹈（anhinga）的复数；一种大型深色水鸟，善于潜水捕鱼，常只露出细长的脖子在水面上，因此也被称为“蛇鸟”"},"examples":[{"en":"We saw several anhingas drying their wings on the branches by the lake.","zh":"我们看到好几只蛇鹈在湖边的树枝上张开翅膀晾干。"},{"en":"Anhingas dive underwater to catch fish and can stay submerged for a long time.","zh":"蛇鹈会潜入水下捕鱼，而且能在水下待很久。"}]}],"synonyms":["snakebirds","anhingas (plural of anhinga)"],"phonetic":"/ænˈhɪŋɡəz/","extraExplanation":["“anhinga”常见于美国东南部（如佛罗里达）的湿地与湖泊。它的羽毛不像鸭子那样防水，所以捕完鱼后常需要张开翅膀“晾干”，这是很有辨识度的行为。","别名“snakebird（蛇鸟）”来自它游泳时身体沉在水里、只露出细长脖子和头部的样子，看起来像一条蛇在水面移动。"]}
{"word":"anhistic","summary":{"en":"“Anhistic” is a rare adjective meaning “without history” or “not historically grounded.”","zh":"“Anhistic”是一个罕见形容词，意思是“无历史的/不具历史依据的（非历史性的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) without history, or not concerned with historical development; not historical.","zh":"（罕见）无历史的；不涉及历史发展的；非历史性的。"},"examples":[{"en":"Some critics call the movie’s world-building anhistic because it ignores real historical context.","zh":"一些评论家认为这部电影的世界观设定是“anhistic”的，因为它忽略了真实的历史背景。"},{"en":"The argument feels anhistic, as if events happened in a vacuum.","zh":"这个论证显得“anhistic”，仿佛事件是在真空中发生的。"}]}],"synonyms":["ahistoric","unhistorical","nonhistorical"],"phonetic":"/ænˈhɪstɪk/","extraExplanation":["“anhistic”非常少见，更多时候人们会用“ahistoric / unhistorical / nonhistorical”。在正式写作中，建议优先使用这些更常见的词。","它容易和“anarchistic”（无政府主义的）混淆：两者拼写相近，但含义完全不同；“anarchistic”与政治/社会秩序有关，“anhistic”与“历史性”有关。"]}
{"word":"anhistous","summary":{"en":"Anhistous means “without differentiated tissue,” used mainly in biology and botany.","zh":"anhistous 指“无分化组织的”，主要用于生物学和植物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology/Botany) Lacking distinct or differentiated tissue; not organized into true tissues.","zh":"（生物/植物）无组织的；没有分化出明确组织结构的。"},"examples":[{"en":"Some algae have an anhistous body, meaning they don’t form true tissues like higher plants do.","zh":"一些藻类的身体是无组织的，也就是说它们不像高等植物那样形成真正的组织。"},{"en":"In basic biology, students learn that many simple organisms are anhistous rather than having complex organs.","zh":"在基础生物学里，学生会学到许多简单生物是无组织的，而不是拥有复杂器官。"}]}],"synonyms":["atissue","non-tissue","undifferentiated"],"phonetic":"/ænˈhɪstəs/","extraExplanation":["这个词主要出现在生物学/植物学语境中，描述结构层级很“原始”的生物体（例如某些藻类或较简单的生命形式）：细胞虽然存在，但没有进一步分工形成“组织（tissue）”。","词源上由否定前缀 an-（无、不）+ hist-（组织）+ -ous（形容词后缀）构成。日常英语里几乎不用，更多见于学术写作或教材。"]}
{"word":"Anhui","summary":{"en":"Anhui is a province in eastern China; it can also describe things from or related to that province.","zh":"Anhui 指中国东部的安徽省；也可作形容词，表示“安徽的/与安徽相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A province in eastern China (省名：安徽), whose capital city is Hefei.","zh":"中国东部的一个省（安徽省），省会是合肥。"},"examples":[{"en":"My grandparents are from Anhui, but I grew up in Shanghai.","zh":"我祖父母来自安徽，但我在上海长大。"},{"en":"Hefei is the capital of Anhui Province.","zh":"合肥是安徽省的省会。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used as an adjective meaning “from Anhui” or “related to Anhui.”","zh":"作形容词用，表示“安徽的 / 与安徽有关的”。"},"examples":[{"en":"She cooks Anhui dishes for her friends on weekends.","zh":"她周末会给朋友做徽菜（安徽菜）。"},{"en":"Anhui culture has strong ties to Huizhou traditions.","zh":"安徽文化与徽州传统联系紧密。"}]}],"synonyms":["Anhui Province","安徽","安徽省"],"phonetic":"/ɑnˈhweɪ/","extraExplanation":["“Anhui”常见读音接近“安-挥”。中文全称“安徽省”，简称“皖”(wǎn)，车牌与简称中常见这个字。","安徽在英语里通常按拼音写作 Anhui；谈到饮食时，“Anhui cuisine”常指“徽菜”，是中国八大菜系之一。"]}
{"word":"anhungered","summary":{"en":"“Anhungered” is an archaic word meaning “very hungry; famished.”","zh":"“anhungered”是古语，意思是“非常饿；饥饿难耐”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic/literary) very hungry; famished.","zh":"（古语/文学用语）非常饿的；饥肠辘辘的。"},"examples":[{"en":"After days at sea, the sailors were anhungered and weak.","zh":"在海上漂泊了好几天后，水手们饥饿难耐，十分虚弱。"},{"en":"The story describes an anhungered traveler asking for a piece of bread.","zh":"故事描写了一位饥肠辘辘的旅人讨要一块面包。"}]}],"synonyms":["starving","famished","ravenous","very hungry"],"phonetic":"/ænˈhʌŋɡɚd/","extraExplanation":["“anhungered”是较少见的古老/文学用词，相当于现代英语里的“hungry / starving”。常见于较旧的散文、诗歌或模仿古风的写作中。","前缀“an-”在古英语或早期英语里有时用来加强或表示“处于……状态”（类似“en-”的作用），所以“anhungered”带有更强的“陷入饥饿状态”的语气。"]}
{"word":"anhungry","summary":{"en":"Hungry means needing food, or strongly wanting something.","zh":"hungry 表示“饥饿的”，也可表示“渴望某事物的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"wanting or needing food; feeling that you should eat.","zh":"饥饿的；想吃东西的。"},"examples":[{"en":"I’m hungry—let’s get something to eat.","zh":"我饿了——我们去找点东西吃吧。"},{"en":"The children came home hungry after school.","zh":"孩子们放学回家时饿了。"}]},{"partOfSpeech":"adj.","definition":{"en":"strongly wanting something (such as success, attention, or information).","zh":"渴望（某事物）；非常想要（如成功、关注或信息）。"},"examples":[{"en":"She’s hungry for success.","zh":"她渴望成功。"},{"en":"People are hungry for reliable news.","zh":"人们渴望可靠的新闻。"}]}],"synonyms":["starving","famished","peckish","eager","craving"],"phonetic":"ˈhʌŋɡri","extraExplanation":["你输入的“anhungry”通常不是现代英语里的标准拼写。更常见的是“hungry”。不过在较古老或文学化的英语中，偶尔会看到“an hungry”（相当于“a hungry”），其中“an”是旧用法，读起来更顺口，意思不变。例如：\"an hungry man\" = \"a hungry man\"。"]}
{"word":"Anhwei","summary":{"en":"“Anhwei” is an older/alternate spelling of Anhui (安徽), a province in eastern China.","zh":"“Anhwei”是“Anhui（安徽）”的旧式/另一种英文拼写，指中国华东的安徽省。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) An older/alternate romanization of Anhui, a province in eastern China.","zh":"（专有名词）“Anhui（安徽）”的较旧/另一种英文拼写（罗马字转写），指中国华东地区的安徽省。"},"examples":[{"en":"My grandparents wrote it as “Anhwei” on old letters, but today it’s usually spelled “Anhui.”","zh":"我祖父母在旧信里写“Anhwei”，但如今通常拼作“Anhui”。"},{"en":"Anhui (sometimes seen as Anhwei in older sources) is known for Huangshan (Yellow Mountain).","zh":"安徽（旧资料中有时写作 Anhwei）以黄山而闻名。"}]}],"synonyms":["Anhui"],"phonetic":"/ɑnˈweɪ/","extraExplanation":["“Anhwei”多见于较早的英文资料或个人拼写习惯，属于旧式/非标准化的转写方式。现代英文中更通行、也更标准的是拼作“Anhui”。","如果你是在护照、老地图、旧书或家族文件中看到“Anhwei”，通常可以把它理解为同一个地方：安徽省。"]}
{"word":"anhyd","summary":{"en":"“anhyd” is a chemistry abbreviation for “anhydrous,” meaning “without water,” and it also relates to the prefix anhyd-/anhydro- meaning “water-free” or “formed by removing water.”","zh":"“anhyd”是化学中对“anhydrous（无水的）”的缩写，也与前缀 anhyd-/anhydro- 相关，表示“无水”或“脱水形成”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Chemistry, abbreviation) short for “anhydrous,” meaning “without water,” especially describing chemicals that contain no water molecules.","zh":"（化学，缩写）“anhydrous（无水的）”的简写，指“没有水”，常用于描述不含结晶水/水分子的化学物质。"},"examples":[{"en":"Use anhyd ethanol to avoid adding water to the reaction.","zh":"使用 anhyd（无水）乙醇可以避免把水带入反应体系。"},{"en":"The label says “anhyd sodium sulfate,” meaning it contains no water of crystallization.","zh":"标签写着“anhyd 硫酸钠”，意思是它不含结晶水。"}]},{"partOfSpeech":"other","definition":{"en":"(Chemistry, combining form) “anhyd-” / “anhydro-”: meaning “without water” or “formed by removing water.”","zh":"（化学，构词成分）“anhyd- / anhydro-”：表示“无水的”或“通过脱水形成的”。"},"examples":[{"en":"“Anhydroglucose” refers to a glucose unit formed by removing water.","zh":"“anhydroglucose（无水葡萄糖/脱水葡萄糖单元）”指通过脱去水形成的葡萄糖结构单元。"},{"en":"In organic chemistry, “anhydro-” often signals a dehydration process.","zh":"在有机化学里，“anhydro-”常提示发生了脱水过程。"}]}],"synonyms":["anhydrous","water-free"],"phonetic":"/ænˈhaɪd/","extraExplanation":["“anhyd”在实验记录或产品标签上多为非正式缩写；正式写法通常是“anhydrous”（无水的）。","词源提示：an-（不、无）+ hydr-（水），所以核心含义就是“没有水”。"]}
{"word":"anhydraemia","summary":{"en":"Anhydraemia is a medical term for severe dehydration specifically involving a lack of water in the blood.","zh":"Anhydraemia 是医学术语，指血液中水分不足所导致的严重脱水状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) An abnormal lack of water in the blood; severe dehydration affecting the bloodstream.","zh":"（医学）血液中水分异常缺乏；影响血液循环的严重脱水。"},"examples":[{"en":"The patient showed signs of anhydraemia after prolonged vomiting and diarrhea.","zh":"患者在长时间呕吐和腹泻后出现了血液缺水（anhydraemia）的迹象。"},{"en":"Doctors treated the anhydraemia with careful IV fluids and monitoring of electrolytes.","zh":"医生通过谨慎静脉补液并监测电解质来治疗这种血液缺水。"}]}],"synonyms":["anhydremia","severe dehydration","hypohydration"],"phonetic":"/ˌæn.haɪˈdriː.mi.ə/","extraExplanation":["这是较少见、偏英式拼写的医学术语（在一些资料中也写作 anhydremia）。词根上可理解为 an-（无）+ hydr-（水）+ -aemia/-emia（与血有关），整体意思就是“血中缺水”。","日常英语更常用 dehydration（脱水）来描述一般情况；anhydraemia 通常用于强调“血容量/血液水分不足”这一更具体、更临床的概念。"]}
{"word":"anhydraemic","summary":{"en":"“Anhydraemic” means severely lacking body fluids—especially too little water in the blood (very dehydrated).","zh":"“anhydraemic”指体液（尤其血液中的水分）严重不足的，即严重脱水的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Having too little water (fluid) in the blood or body; severely dehydrated.","zh":"（医学）血液或全身水分不足的；严重脱水的。"},"examples":[{"en":"The patient arrived anhydraemic after several days of vomiting and diarrhea.","zh":"病人因多日呕吐和腹泻而出现脱水（anhydraemic）状态入院。"},{"en":"Doctors gave IV fluids because she was anhydraemic and weak.","zh":"医生为她输液补水，因为她严重脱水且虚弱。"}]}],"synonyms":["dehydrated","fluid-depleted","volume-depleted","hypohydrated"],"phonetic":"/ˌæn.haɪˈdriː.mɪk/","extraExplanation":["“anhydraemic”是较少见的英式拼写/用词，更多医学语境会用“dehydrated（脱水的）”。它与名词“anhydraemia/anhydremia（血液水分不足/脱水状态）”有关。","词源上可拆分理解：an-（无、缺乏）+ hydr-（水）+ -aemic/-emic（与血液有关）。因此常用于描述“血液/体液缺水”的临床状态。"]}
{"word":"anhydrase","summary":{"en":"An enzyme that catalyzes reactions involving removing or adding the elements of water.","zh":"一种催化与“去水/加水元素”相关反应的酶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An enzyme that removes water from a substance or helps a reaction happen by adding/removing the elements of water (H and OH).","zh":"一种酶，能从物质中去除水分子，或通过加入/移除水的元素（H 和 OH）来促进化学反应。"},"examples":[{"en":"Carbonic anhydrase helps your body quickly balance carbon dioxide and bicarbonate in the blood.","zh":"碳酸酐酶帮助人体在血液中快速平衡二氧化碳与碳酸氢盐。"},{"en":"The researcher measured anhydrase activity to see how fast the reaction happened.","zh":"研究人员测量酐酶活性来了解反应发生得有多快。"}]}],"synonyms":["dehydrase (related)","carbonic anhydrase (common specific type)"],"phonetic":"/ænˈhaɪdreɪs/","extraExplanation":["词源提示：anhydrase 来自“an-（无）+ hydra（水）”，与 anhydrous（无水的）同源。它常用于生物化学语境，最常见的例子是 carbonic anhydrase（碳酸酐酶），与呼吸、酸碱平衡等生理过程密切相关。","注意：在英文里更常见的说法是直接说具体的酶名（如 carbonic anhydrase），单独用 anhydrase 往往出现在较专业的文本中。"]}
{"word":"anhydrate","summary":{"en":"An “anhydrate” is the water-free form of a compound; less commonly, it can mean to remove water from a substance.","zh":"“Anhydrate”指某化合物的无水形式；也可（较少）作动词表示使某物脱水成为无水状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical substance that contains no water (especially no water of crystallization); the water-free form of a compound.","zh":"（尤指晶体中）不含结晶水的化学物质；某化合物的无水形式。"},"examples":[{"en":"Copper(II) sulfate anhydrate is white, while its hydrate is blue.","zh":"无水硫酸铜是白色的，而它的水合物是蓝色的。"},{"en":"Store the anhydrate in a tightly sealed container to keep it dry.","zh":"把无水物质密封保存以保持干燥。"}]},{"partOfSpeech":"vt.","definition":{"en":"to remove water from a substance; to make something water-free (less common; often replaced by “dehydrate”).","zh":"去除（水分或结晶水）；使某物成为无水状态（较少用，常用 dehydrate 代替）。"},"examples":[{"en":"The crystals are heated to anhydrate the salt before the next step.","zh":"在下一步之前加热晶体以使盐脱水成为无水物。"},{"en":"Chemists may anhydrate a sample to measure its true mass without moisture.","zh":"化学家可能会让样品脱水，以测量不含水分时的真实质量。"}]}],"synonyms":["anhydrous compound","water-free form","dehydrate","desiccate"],"phonetic":"/ænˈhaɪdreɪt/","extraExplanation":["在化学里，hydrate（水合物）指结构中含有水（常见是结晶水）的物质；anhydrate（无水物）则是不含这些水的对应形式。英语中更常见的形容词是 anhydrous（无水的），如 “anhydrous ethanol（无水乙醇）”。"]}
{"word":"anhydrated","summary":{"en":"“Anhydrated” means having no water (especially in chemistry), or dried/dehydrated (less common).","zh":"“anhydrated”指无水的（尤指化学中的无结晶水），也可指脱水干燥的（较少用）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Having no water, especially no water of crystallization; anhydrous.","zh":"（化学）不含水的；无水的（尤指不含结晶水）。"},"examples":[{"en":"Anhydrous copper sulfate is white, but the hydrated form is blue.","zh":"无水硫酸铜是白色的，但含水（结晶水）形式是蓝色的。"},{"en":"The label says the solvent must be anhydrated before use.","zh":"标签上写着该溶剂必须先脱水（制成无水状态）才能使用。"}]},{"partOfSpeech":"adj.","definition":{"en":"Dried out; dehydrated (less common in everyday English).","zh":"干燥的；脱水的（在日常英语中较少用）。"},"examples":[{"en":"Use anhydrated fruit slices for long trips because they are lighter and keep longer.","zh":"长途出行可用脱水果片，因为更轻且更耐保存。"},{"en":"The camping meal includes anhydrated vegetables that rehydrate with hot water.","zh":"这份露营餐含有脱水蔬菜，用热水就能复水。"}]}],"synonyms":["anhydrous","water-free","dehydrated","dried"],"phonetic":"/ænˈhaɪdreɪtɪd/","extraExplanation":["“anhydrated”在现代英语里不如“anhydrous”（无水的）常见，尤其在化学语境中更常直接说“anhydrous”。日常生活里表达“脱水的”更常用“dehydrated”。","词源上，“an-”表示“无/不”，与“hydr-（水）”相关；因此整体意思就是“无水的”。"]}
{"word":"anhydrating","summary":{"en":"Anhydrating means removing water, especially in chemistry; it can also describe a water-removing agent or process.","zh":"“Anhydrating”指（尤在化学中）去除水分；也可形容具有脱水作用的物质或过程。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(chemistry) Removing water from something; dehydrating (often by a chemical process).","zh":"（化学）使某物失去水分；脱水（常指通过化学方法）。"},"examples":[{"en":"This reagent is anhydriting the solution to prevent unwanted side reactions.","zh":"这种试剂正在让溶液脱水，以防止不必要的副反应。"},{"en":"Anhydriting alcohol helps produce a purer product.","zh":"让酒精脱水有助于得到更纯的产物。"}]},{"partOfSpeech":"adj.","definition":{"en":"(chemistry) Describing a substance or process that removes water.","zh":"（化学）描述具有脱水作用的物质或过程的。"},"examples":[{"en":"Sulfuric acid can act as an anhydriting agent.","zh":"硫酸可以作为脱水剂。"},{"en":"They used an anhydriting procedure before the final analysis.","zh":"他们在最终分析前使用了脱水步骤。"}]}],"synonyms":["dehydrating","drying (technical contexts)","desiccating (more formal/technical)"],"phonetic":"/ænˈhaɪdreɪtɪŋ/","extraExplanation":["“Anhydrating”来自动词“anhydrate”，常用于化学与实验室语境，强调“把水（H₂O）从化合物或溶液中除去”。日常英语更常用“dehydrating（脱水、干燥）”，而“anhydrating”更偏专业。","相关名词：anhydrous（无水的）。例如：anhydrous ethanol（无水乙醇）、anhydrous salt（无水盐）。"]}
{"word":"anhydration","summary":{"en":"Anhydration means removing water from a substance, especially in chemistry.","zh":"Anhydration 指（尤其在化学中）从物质中去除水分的“脱水”过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of removing water from a substance; dehydration (often used in chemistry).","zh":"（常用于化学）脱水；去除物质中水分的过程。"},"examples":[{"en":"In the lab, anhydration of the salt is done by gentle heating.","zh":"在实验室里，通常通过轻微加热让这种盐脱水。"},{"en":"This reaction involves anhydration to form an anhydride.","zh":"这个反应涉及脱水，从而生成酸酐。"}]}],"synonyms":["dehydration","desiccation","drying"],"phonetic":"/ˌænhaɪˈdreɪʃən/","extraExplanation":["“anhydration”在日常英语中不如“dehydration（脱水/缺水）”常见，更偏学术或化学语境。","词根理解：an-（无）+ hydr-（水）+ -ation（过程/行为），字面意思是“去水的过程”。化学里常用来描述“除去水分”或“脱去一分子水”的步骤。"]}
{"word":"anhydremia","summary":{"en":"Anhydremia means a severe lack of water in the blood (a form of extreme dehydration).","zh":"anhydremia 指血液中水分严重不足（极重度脱水的一种表现）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical condition in which the blood has an abnormally low amount of water; severe dehydration affecting the bloodstream.","zh":"（医学）无水血症；血液中水分异常缺乏的状态（严重脱水影响到血液）。"},"examples":[{"en":"After days without safe drinking water, the patient developed anhydremia and needed IV fluids.","zh":"在多日缺乏安全饮用水后，患者出现无水血症，需要静脉补液。"},{"en":"The doctor warned that vomiting and diarrhea can quickly lead to anhydremia in children.","zh":"医生警告说，呕吐和腹泻可能很快导致儿童出现无水血症。"}]}],"synonyms":["dehydration","severe dehydration","hypohydration"],"phonetic":"/ˌænhaɪˈdriːmiə/","extraExplanation":["词源：由希腊语前缀 an-（“无、缺乏”）+ hydr-（“水”）+ -emia（“血液状况”）构成，字面意思是“血中缺水”。","使用场景：这是偏医学、较少见的术语，日常英语更常用 dehydration（脱水）来表达；在临床语境中可强调“血容量/血液水分不足”这一层含义。"]}
{"word":"anhydremic","summary":{"en":"Anhydremic means severely dehydrated, especially in a medical sense involving loss of body fluids (often with low blood volume).","zh":"Anhydremic 指严重脱水的（医学用语），强调体液大量缺失，常伴随血容量偏低。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medical) Relating to severe loss of body water and fluids; dehydrated (often with reduced blood/plasma volume).","zh":"（医学）与体内水分与体液严重缺失有关的；脱水的（常伴随血容量/血浆量减少）。"},"examples":[{"en":"After several days of vomiting, the patient became anhydremic and needed IV fluids.","zh":"连续呕吐几天后，病人出现严重脱水（anhydremic），需要静脉补液。"},{"en":"In hot weather, untreated diarrhea can quickly lead to an anhydremic state.","zh":"在炎热天气里，未治疗的腹泻可能很快导致严重脱水状态。"}]}],"synonyms":["dehydrated (more common)","fluid-depleted","hypovolemic (related, not identical)"],"phonetic":"/ˌænhaɪˈdriːmɪk/","extraExplanation":["这个词非常少见，主要出现在医学语境中，常见相关名词是 anhydremia（严重缺水/体液不足）。","词形可拆解理解：an-（无、缺乏）+ hydr-（水）+ -emic（与血液/体液状态有关），整体强调“缺水导致的体液/血容量问题”。","日常英语更常用的表达是 dehydrated（脱水的）或 severe dehydration（严重脱水）。"]}
{"word":"anhydric","summary":{"en":"Anhydric means “containing no water,” mainly used in chemistry.","zh":"anhydric 意为“无水的”，主要用于化学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Containing no water; waterless, especially lacking water of crystallization.","zh":"（化学）不含水的；无水的，尤指不含结晶水。"},"examples":[{"en":"Use an anhydric solvent to prevent the reaction from producing unwanted by-products.","zh":"使用无水溶剂可以防止反应产生不需要的副产物。"},{"en":"Copper sulfate becomes anhydric after heating, because the water of crystallization is removed.","zh":"硫酸铜加热后会变成无水状态，因为结晶水被除去了。"}]}],"synonyms":["anhydrous","waterless","dehydrated (context-dependent)"],"phonetic":"/ænˈhaɪdrɪk/","extraExplanation":["“anhydric”在现代英语中较少见，更常用的是“anhydrous”。两者意思非常接近，学习和写作时优先掌握/使用“anhydrous”。","词根提示：an-（无、不）+ hydr-（水）→ 字面意思就是“没有水的”。在化学语境里常指“无水（无结晶水/无溶剂水）”这一点。"]}
{"word":"anhydride","summary":{"en":"An anhydride is a chemistry term for a compound made by removing water, often one that reacts with water to form an acid.","zh":"anhydride 是化学用语，指“脱水形成的化合物”，常见为与水反应生成相应酸的“酸酐”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A compound formed by removing water (H₂O) from another compound; often used for substances that react with water to form an acid or another related compound.","zh":"（化学）由另一种化合物脱去水（H₂O）而形成的化合物；常指与水反应可生成相应酸或相关化合物的物质。"},"examples":[{"en":"Acetic anhydride reacts with water to produce acetic acid.","zh":"乙酸酐与水反应生成乙酸。"},{"en":"The label warns that the anhydride must be kept away from moisture.","zh":"标签警告这种酸酐必须远离潮气。"}]},{"partOfSpeech":"n.","definition":{"en":"(Chemistry) An oxide (especially of a nonmetal) that forms an acid when combined with water.","zh":"（化学）一种氧化物（尤指非金属氧化物），与水结合可生成酸。"},"examples":[{"en":"Sulfur trioxide is an anhydride of sulfuric acid.","zh":"三氧化硫是硫酸的酸酐。"},{"en":"In basic chemistry, students learn which oxides act as acid anhydrides.","zh":"在基础化学中，学生会学习哪些氧化物属于酸性氧化物（酸酐）。"}]}],"synonyms":["acid anhydride","dehydrated compound"],"phonetic":"/ænˈhaɪdraɪd/","extraExplanation":["词源：an-（无、缺少）+ hydride（与氢/水相关的成分），整体可理解为“去掉水后的（物质）”。在化学里最常见的搭配是 acid anhydride（酸酐）。","学习提示：在阅读化学英文时，anhydride 通常指“酸酐”（如 acetic anhydride 乙酸酐）；而讲“氧化物与水生成酸”的语境里，anhydride 也可理解为“某酸的酸酐/酸性氧化物”。"]}
{"word":"anhydrides","summary":{"en":"“Anhydrides” means plural anhydride compounds, often made by removing water and able to form acids again with water.","zh":"“anhydrides”是“anhydride（酸酐/无水物）”的复数，常指由脱水形成、并可与水反应再生成相应酸的化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A chemical compound (especially in inorganic or organic chemistry) formed by removing water from another compound, often an acid; many anhydrides react with water to form acids again.","zh":"（化学）“酸酐/无水物”：通常指由某种化合物（常见为酸）脱去水而形成的化合物；许多酸酐遇水会重新生成相应的酸。"},"examples":[{"en":"Acetic anhydride is used to make aspirin.","zh":"乙酸酐常用于制造阿司匹林。"},{"en":"Some acid anhydrides react violently with water.","zh":"一些酸酐与水反应会非常剧烈。"},{"en":"The lab stored anhydrides in a dry container to prevent moisture from reacting with them.","zh":"实验室把酸酐存放在干燥容器中，以防受潮发生反应。"}]}],"synonyms":["acid anhydrides","anhydride compounds"],"phonetic":"/ænˈhaɪdraɪd/","extraExplanation":["“Anhydrides”是名词复数；单数是“anhydride”。词源可理解为“an-（无）+ hydrate（水合物/水）”，表示“无水的”。","常见例子：硫酸酐（SO₃）加水可生成硫酸（H₂SO₄）；乙酸酐（acetic anhydride）加水可生成乙酸（acetic acid）。因此在阅读化学文献时，看到“anhydride”通常要联想到“脱水生成、遇水还原成酸”。"]}
{"word":"anhydridization","summary":{"en":"Anhydridization is the chemical formation of an anhydride, typically by removing water.","zh":"Anhydridization 指酸酐化：通常通过脱水来形成酸酐的化学过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A chemical process in which a compound is converted into an anhydride, usually by removing water (dehydration) or by reacting to form an anhydride functional group.","zh":"一种化学过程：把化合物转变成酸酐（anhydride），通常通过脱水（去除水分）或通过反应形成酸酐官能团。"},"examples":[{"en":"The synthesis involves anhydridization of the diacid to produce a cyclic anhydride.","zh":"该合成过程包含将二元酸进行酸酐化，生成环状酸酐。"},{"en":"Anhydridization can occur when carboxylic acids are heated with dehydrating agents.","zh":"当羧酸与脱水剂一起加热时，可能发生酸酐化反应。"}]}],"synonyms":["anhydride formation","dehydration (to an anhydride)"],"phonetic":"/ænˌhaɪdɹəˌdaɪˈzeɪʃən/","extraExplanation":["“anhydridization”主要见于化学/材料科学语境，常用来描述“生成酸酐结构”的步骤；在很多教材或论文中，也可能更常写成“anhydride formation（酸酐生成）”或“dehydration to anhydride（脱水生成酸酐）”。","词形理解：anhydride（酸酐）+ -ization（……化/……的过程）。其中 anhydride 字面含义与“去水（an- + hydrate）”有关，因为酸酐常可看作由酸失去水形成。"]}
{"word":"anhydridize","summary":{"en":"A chemistry verb meaning to form an anhydride, often by removing water.","zh":"化学动词：使生成酸酐，常通过脱水实现。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Chemistry) To convert a substance into an anhydride, usually by removing water (dehydration) or by reacting to form an anhydride group.","zh":"（化学）使……形成酸酐；通常指通过脱水（除去水）或发生反应生成酸酐结构。"},"examples":[{"en":"The chemist anhydridized the acid to produce its anhydride.","zh":"化学家将该酸进行成酐处理，制得相应的酸酐。"},{"en":"Under strong dehydrating conditions, some dicarboxylic acids can be anhydridized.","zh":"在强脱水条件下，一些二羧酸可以发生成酐反应。"}]},{"partOfSpeech":"vi.","definition":{"en":"To undergo a change that forms an anhydride (to form an anhydride).","zh":"（化学）形成酸酐；发生成酐变化。"},"examples":[{"en":"When heated, the compound may anhydridize and release water.","zh":"加热时，该化合物可能成酐并释放出水。"}]}],"synonyms":["dehydrate","form an anhydride","convert to an anhydride"],"phonetic":"/ænˈhaɪdrəˌdaɪz/","extraExplanation":["“anhydridize”主要用于化学语境，常见于有机合成或材料化学中，表示把酸（或相关化合物）转变为“酸酐（anhydride）”。在现代写作里，更常见的表达是“form an anhydride”或使用更常见的动词“dehydrate（脱水）”，具体用哪个取决于你想强调“除水”还是“生成酸酐结构”。","词形上它来自“anhydride（酸酐）+ -ize（使……化）”。在学术写作中，这类 -ize 动词有时显得较“专门/书面”，使用前可考虑目标读者是否熟悉该术语。"]}
{"word":"anhydrite","summary":{"en":"Anhydrite is a dry (water-free) calcium sulfate mineral, closely related to gypsum.","zh":"Anhydrite 指无水硫酸钙矿物（无水石膏/硬石膏），与石膏密切相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A mineral made of calcium sulfate (CaSO₄) without water; it is related to gypsum but is harder and forms in dry, evaporating environments.","zh":"无水石膏（硬石膏）：一种不含结晶水的硫酸钙矿物（CaSO₄）；与石膏有关，但更硬，常形成于干燥的蒸发沉积环境中。"},"examples":[{"en":"Anhydrite often occurs in salt deposits where seawater has evaporated.","zh":"无水石膏常见于海水蒸发后形成的盐类沉积层中。"},{"en":"The drill core showed layers of anhydrite beneath the gypsum.","zh":"钻芯显示石膏层下方有无水石膏层。"}]}],"synonyms":["calcium sulfate (mineral)","anhydrous calcium sulfate"],"phonetic":"/ænˈhaɪˌdraɪt/","extraExplanation":["词源：anhydrite 来自希腊语前缀 an-（“无、不”）+ hydor（“水”），字面意思是“无水的”。","与 gypsum（石膏）的关系：石膏是含水硫酸钙（CaSO₄·2H₂O）。在某些地质条件下，石膏可脱水变成无水石膏；反过来，无水石膏遇水也可能水化转为石膏，体积会膨胀。","常见语境：地质学、矿物学、油气勘探与采矿中会用到。日常英语里较少出现，通常是专业词汇。"]}
{"word":"anhydrization","summary":{"en":"Anhydrization is a chemistry term for removing water from a substance or forming an anhydride by loss of water.","zh":"Anhydrization是化学术语，指从物质中去除水分，或通过失水形成酸酐/无水物的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) The process of removing water from a substance, or converting a compound into an anhydride (a compound formed by loss of water).","zh":"（化学）脱水的过程；或使化合物失去水分而转变为酸酐/无水物（通过失水形成的化合物）的过程。"},"examples":[{"en":"In the lab, anhydrization of the acid produced an anhydride and water was eliminated.","zh":"在实验室里，对该酸进行脱水成酐反应生成了酸酐，并去除了水。"},{"en":"Heating can speed up anhydrization, but it may also cause unwanted side reactions.","zh":"加热能加快脱水过程，但也可能引发不希望出现的副反应。"}]}],"synonyms":["dehydration","dehydrating","anhydride formation","water removal"],"phonetic":"/æn.haɪˈdraɪ.zeɪ.ʃən/","extraExplanation":["“anhydrization”在现代英语中较少见，更常见的说法是“dehydration（脱水）”或在更专业的化学语境中用“anhydride formation（成酐）”。如果你是在论文/报告中使用，建议根据具体反应选择更常用、更明确的术语。","词形来源上与前缀“an-（无）”+“hydro（水）”有关，核心意思是“变成无水/去除水分”。也可能见到拼写变体“anhydrisation”（英式拼写风格）。"]}
{"word":"anhydrize","summary":{"en":"Anhydrize is a technical (chemistry) verb meaning to remove water from a substance, often to make it anhydrous or to form an anhydride.","zh":"Anhydrize 是一个偏化学领域的动词，表示使物质脱水（变为无水状态），有时也指通过脱水生成酸酐。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Chemistry) To remove water from a substance; to make something anhydrous (without water).","zh":"（化学）使……脱水；去除……中的水分，使其成为无水状态。"},"examples":[{"en":"The lab anhydrized the salt to prevent it from clumping.","zh":"实验室把这种盐脱水处理，以防结块。"},{"en":"Heat can anhydrize some hydrates and change their properties.","zh":"加热会使某些水合物脱水，并改变其性质。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Chemistry) To convert a compound into an anhydride form (often by removing water).","zh":"（化学）使……生成酸酐（通常通过脱水实现）。"},"examples":[{"en":"The reaction conditions can anhydrize the acid to form an anhydride.","zh":"反应条件可以使该酸脱水生成酸酐。"}]}],"synonyms":["dehydrate","desiccate","dry","dewater"],"phonetic":"/ænˈhaɪdraɪz/","extraExplanation":["“anhydrize”是较少见的拼写变体，更常见的是“anhydrize/anhydrize”的同义表达用“dehydrate（脱水）”。在学习与写作中，若不是化学语境，通常用“dehydrate”更自然。","词根提示：an-（无）+ hydr-（水）+ -ize（使……），字面意思就是“使之无水”。"]}
{"word":"anhydro","summary":{"en":"“Anhydro” means “without water” and is common in chemistry, often as an adjective or as a prefix in scientific terms.","zh":"“anhydro”表示“无水的/不含水的”，常用于化学语境，也常作为前缀出现在科学术语中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"without water; lacking water (used especially in chemistry)","zh":"无水的；缺水的（尤用于化学语境）"},"examples":[{"en":"This reaction must be done under anhydro conditions so water doesn’t interfere.","zh":"这个反应必须在无水条件下进行，以免水分干扰。"},{"en":"Anhydro crystals can absorb moisture from the air very quickly.","zh":"无水晶体可能会很快从空气中吸收水分。"}]},{"partOfSpeech":"other","definition":{"en":"a prefix/combining form meaning “without water” or “formed by removing water,” used in scientific words","zh":"前缀/构词成分，表示“无水”或“脱水形成的”，常用于科学词汇"},"examples":[{"en":"In chemistry, anhydro- appears in words like “anhydride” and “anhydrous.”","zh":"在化学中，anhydro- 常见于如 anhydride（酸酐）和 anhydrous（无水的）等词。"},{"en":"“Anhydroglucose” refers to a glucose unit described in a dehydration-related way in chemistry.","zh":"“Anhydroglucose”（脱水葡萄糖）指在化学中以“脱水相关方式”描述的葡萄糖结构单元。"}]}],"synonyms":["anhydrous","water-free","dehydrated (context-dependent)"],"phonetic":"/ænˈhaɪdroʊ/","extraExplanation":["“anhydro-”来自希腊语：an-（不、无）+ hydro（水）。因此它常出现在化学/生物化学术语里，强调“没有水”或“通过脱去水而形成”。日常英语里更常见的是 anhydrous（无水的）。","注意区分：anhydrous（无水的，形容试剂本身不含水）与 dehydrated（脱水的，通常指从原本含水的物质中去除水分，例如脱水蔬菜/脱水人体）。"]}
{"word":"anhydrobiosis","summary":{"en":"Anhydrobiosis is a survival state that lets some organisms endure extreme dryness and revive when rehydrated.","zh":"Anhydrobiosis 指一些生物在极度干燥时进入近乎停滞的生存状态，并在补水后恢复活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A state in which an organism can survive extreme drying by greatly slowing or nearly stopping its metabolism, then “come back to life” when water returns.","zh":"无水生存状态：生物在极度干燥时通过大幅降低甚至几乎停止代谢来存活，并在重新获得水分后恢复生命活动。"},"examples":[{"en":"Tardigrades are famous for anhydrobiosis, surviving long periods without water.","zh":"缓步动物以无水生存状态闻名，能在缺水的情况下存活很长时间。"},{"en":"Some seeds enter anhydrobiosis so they can wait for rain before germinating.","zh":"有些种子会进入无水生存状态，等到下雨后才发芽。"}]}],"synonyms":["cryptobiosis (broader)","desiccation-induced dormancy"],"phonetic":"/ˌæn.haɪ.droʊ.baɪˈoʊ.sɪs/","extraExplanation":["词源提示：an-（无）+ hydro（水）+ biosis（生命状态）。常见于生物学/生态学语境。它强调“脱水耐受”的生理状态，不等同于真正意义上的死亡；复水后可恢复活动。","相关词汇：desiccation（干燥/脱水），desiccation tolerance（耐脱水性），cryptobiosis（隐生状态，更广义的“极端休眠”概念，包含缺水等多种条件）。"]}
{"word":"anhydroglocose","summary":{"en":"An anhydroglucose (often written as an anhydroglucose unit) is a glucose-derived unit formed by loss of water, commonly used to describe the repeating units in cellulose and starch.","zh":"脱水葡萄糖（常写作脱水葡萄糖单元）是葡萄糖通过失去一分子水形成的结构单元，常用于描述纤维素和淀粉等多糖的重复单元。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely misspelling) anhydroglucose: a glucose unit that has lost a molecule of water (H₂O) during bonding; it is the repeating building block in polysaccharides such as cellulose and starch.","zh":"（很可能是拼写错误）anhydroglucose（脱水葡萄糖）：指葡萄糖在成键过程中失去一分子水（H₂O）后形成的结构单元；它是纤维素、淀粉等多糖的重复基本单元。"},"examples":[{"en":"Cellulose is made of many anhydroglucose units linked together.","zh":"纤维素由许多脱水葡萄糖（anhydroglucose）单元连接而成。"},{"en":"In starch, anhydroglucose units form long chains that plants use for energy storage.","zh":"在淀粉中，脱水葡萄糖单元形成长链，植物用来储存能量。"}]}],"synonyms":["anhydroglucose","anhydroglucose unit","AGU"],"phonetic":"/ænˌhaɪdroʊˈɡluːkoʊs/","extraExplanation":["你输入的 **anhydroglocose** 通常被认为是 **anhydroglucose** 的拼写误写（少了一个 “u”）。更常见的相关术语还有 **anhydroglucose unit (AGU)**（脱水葡萄糖单元），尤其在讲纤维素/淀粉结构时会用到。"]}
{"word":"anhydroglucose","summary":{"en":"An anhydroglucose is a dehydrated glucose unit that repeats to form polymers like starch and cellulose.","zh":"脱水葡萄糖是“脱去一分子水的葡萄糖单元”，是淀粉和纤维素等多糖的重复构件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a glucose unit (C6H10O5) formed when one molecule of water is removed from glucose; it is the repeating building block of many polysaccharides such as starch and cellulose.","zh":"脱水葡萄糖（C6H10O5）：指葡萄糖失去一分子水后形成的结构单元；它是淀粉、纤维素等多糖的重复基本单位。"},"examples":[{"en":"Starch is made of many anhydroglucose units linked together.","zh":"淀粉由许多脱水葡萄糖单元连接而成。"},{"en":"Cellulose contains anhydroglucose units in a long, straight chain.","zh":"纤维素含有脱水葡萄糖单元，排列成很长的直链。"}]}],"synonyms":["glucose unit","glucose residue","anhydroglucose unit"],"phonetic":"/ˌæn.haɪ.droʊˈɡluːkoʊs/","extraExplanation":["“anhydro-”表示“无水/脱水的”，在化学中常用来说明某个分子相对于原本结构“少了一分子水”。因此 anhydroglucose 常用来强调：多糖中的“葡萄糖残基”并不是游离的葡萄糖（C6H12O6），而是以“脱去水后的形式”（C6H10O5）参与形成糖苷键。","这个词多出现在生物化学、食品科学与材料科学（如纸浆/纤维素）语境中；日常英语里更常说“glucose unit”或“glucose residue”。"]}
{"word":"anhydromannitol","summary":{"en":"Anhydromannitol is a dehydrated form of mannitol used mainly in scientific contexts.","zh":"Anhydromannitol 指甘露醇的脱水衍生物，主要见于科研语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (a sugar alcohol) derived from mannitol by removing water; used mainly in chemistry and pharmaceutical/medical contexts.","zh":"一种由甘露醇（mannitol）脱水得到的化学化合物（糖醇）；主要用于化学与制药/医学相关领域。"},"examples":[{"en":"In the lab, anhydromannitol can be prepared by dehydrating mannitol under controlled conditions.","zh":"在实验室中，可以在控制条件下让甘露醇脱水来制备脱水甘露醇。"},{"en":"The paper compared mannitol and anhydromannitol to study how dehydration changes the molecule’s structure.","zh":"论文比较了甘露醇与脱水甘露醇，用来研究脱水如何改变分子结构。"}]}],"synonyms":["dehydrated mannitol"],"phonetic":"/ænˌhaɪdroʊˈmænɪˌtɔl/","extraExplanation":["这是一个较偏专业的化学/药学词汇，日常英语中几乎不会使用。","词形拆解：an-（表示“去除/缺失”）+ hydro（“水”）+ mannitol（“甘露醇”）。字面意思接近“去掉水的甘露醇”。","具体性质与用途会因所指的异构体或实验条件而异；阅读文献时通常需要结合化学结构或CAS信息来确定。"]}
{"word":"anhydromannose","summary":{"en":"Anhydromannose is a dehydrated form (derivative) of the sugar mannose used in carbohydrate chemistry.","zh":"无水甘露糖是甘露糖脱水后的衍生物，主要用于糖类化学研究与合成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mannose derivative formed by removing a molecule of water (dehydration), often used as a chemical intermediate in carbohydrate chemistry and glycoscience.","zh":"（化学）无水甘露糖：由甘露糖脱去一分子水（脱水）形成的衍生物，常用于糖类化学/糖科学中的合成与研究。"},"examples":[{"en":"Researchers synthesized anhydromannose to build more complex sugars for testing.","zh":"研究人员合成了无水甘露糖，用来构建更复杂的糖以进行测试。"},{"en":"Anhydromannose can appear as an intermediate during the dehydration of mannose under acidic conditions.","zh":"在酸性条件下甘露糖发生脱水时，无水甘露糖可能作为中间体出现。"}]}],"synonyms":["dehydrated mannose","mannose anhydride"],"phonetic":"/ˌænhaɪdroʊˈmænoʊs/","extraExplanation":["“anhydro-”表示“脱水的/无水的”，在有机化学里常指分子内部或分子间失去一分子水后形成的新结构（例如形成环状的“内醚/缩醛”结构）。","“mannose（甘露糖）”是一种常见的单糖（己糖），与葡萄糖结构相近；“anhydromannose”并不是日常英语词汇，主要出现在化学与生物化学文献中。"]}
{"word":"anhydromyelia","summary":{"en":"Anhydromyelia is an abnormal widening of the spinal cord’s central canal.","zh":"Anhydromyelia 指脊髓中央管的异常扩张。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical condition in which the central canal of the spinal cord becomes abnormally widened (dilated).","zh":"（医学）脊髓中央管异常扩张的一种病变。"},"examples":[{"en":"The MRI report suggested anhydromyelia in the cervical spinal cord.","zh":"核磁共振报告提示颈段脊髓可能存在脊髓中央管扩张（anhydromyelia）。"},{"en":"Doctors may monitor anhydromyelia over time if symptoms are mild.","zh":"如果症状较轻，医生可能会对脊髓中央管扩张进行随访观察。"}]}],"synonyms":["hydromyelia","central canal dilatation","dilated central canal"],"phonetic":"/ˌæn.haɪ.droʊ.maɪˈiː.li.ə/","extraExplanation":["这是一个较少见、偏专业的医学术语，常见于影像学（尤其是MRI）报告中。","词源可拆解为 anhydro-（与“无水/缺水”相关的构词成分）+ myelia（与脊髓有关）。不同文献对该词使用不一，有时会与 hydromyelia（脊髓中央管扩张、常与脑脊液相关）或 syringomyelia（脊髓空洞症）一起讨论，但三者并不完全等同；具体诊断通常需要结合影像表现与临床症状。","该词多用于医学语境；日常英语中几乎不会使用。"]}
{"word":"anhydrosis","summary":{"en":"Anhidrosis means little or no sweating, which can cause overheating.","zh":"Anhidrosis 指少汗或无汗，可能导致身体过热。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical condition in which the body does not sweat (or sweats much less than normal), which can make it hard to cool down.","zh":"（医学）无汗症：身体不出汗（或出汗明显减少），会导致散热困难。"},"examples":[{"en":"Because of anhidrosis, he overheated quickly during exercise.","zh":"因为无汗症，他运动时很快就会过热。"},{"en":"The doctor warned that anhidrosis can increase the risk of heatstroke.","zh":"医生提醒，无汗症会增加中暑的风险。"}]}],"synonyms":["lack of sweating","absence of sweating","hypohidrosis (related, milder)"],"phonetic":"/ˌæn.haɪˈdroʊ.sɪs/","extraExplanation":["“Anhidrosis”多见于医学语境；也常写作“anhidrosis/anhidrosis (no sweating)”。与之相关的词有：hypohidrosis（少汗，出汗减少但并非完全没有）和hyperhidrosis（多汗）。","常见诱因包括：神经系统问题、皮肤损伤或疤痕、某些药物（如部分抗胆碱药）、脱水或先天因素等。若出现运动或高温环境下不出汗并伴随头晕、皮肤发热发红等，应重视，必要时就医。"]}
{"word":"anhydrosugar","summary":{"en":"An anhydrosugar is a sugar formed by loss of water from another sugar (a dehydration product).","zh":"无水糖：由其他糖脱去水分子而生成的糖（脱水产物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of sugar (carbohydrate) that has been formed by removing a molecule of water (dehydration) from a normal sugar, often creating a ring structure such as an anhydro bridge.","zh":"一种通过从普通糖（碳水化合物）中脱去一分子水（脱水反应）而形成的糖类，常会产生环状结构（如“无水桥/内醚键”）。"},"examples":[{"en":"In carbohydrate chemistry, anhydrosugars can form when a sugar is dehydrated under heat or acid.","zh":"在糖类化学中，糖在加热或酸性条件下脱水时可能生成无水糖。"},{"en":"Researchers analyzed an anhydrosugar derivative to understand how the molecule rearranges.","zh":"研究人员分析了一种无水糖衍生物，以了解分子如何发生重排。"}]}],"synonyms":["anhydro sugar","dehydrated sugar (context-dependent)"],"phonetic":"/ænˌhaɪdroʊˈʃʊɡɚ/","extraExplanation":["“anhydro-”来自希腊语，意为“无水的”；“anhydrosugar”通常用于有机化学/糖化学语境，不是日常生活中的常用词。","无水糖并不等同于“干燥的糖”。它指的是分子结构上通过脱去水而形成的新结构（例如形成内醚键/桥连结构）。","常见相关术语：dehydration（脱水反应）、anhydro bridge（无水桥/内醚桥）、derivative（衍生物）。"]}
{"word":"anhydrotic","summary":{"en":"“Anhydrotic” means not sweating or unable to sweat.","zh":"“Anhydrotic”指“无汗的/不能出汗的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not producing sweat; having little or no sweating (often describing a medical condition or a type of ectodermal dysplasia).","zh":"无汗的；不出汗的（常用于医学语境，描述一种疾病状态或外胚层发育不良的类型）。"},"examples":[{"en":"The doctor noted an anhydrotic condition, so the child needed extra care in hot weather.","zh":"医生指出孩子有无汗症状，所以在炎热天气里需要格外注意。"},{"en":"People with anhydrotic disorders may overheat easily because they cannot sweat normally.","zh":"患有无汗相关疾病的人可能更容易过热，因为他们无法正常出汗。"}]}],"synonyms":["anhidrotic","non-sweating"],"phonetic":"/ˌænhaɪˈdrɑtɪk/","extraExplanation":["词源提示：an- 表示“无/不”，hydro- 表示“水”，-tic 表示“……的”。合起来就是“没有（汗水/水分排出）的”。","使用场景：这个词多见于医学或生物学写作，日常英语更常说“can’t sweat”或“doesn’t sweat”。","相关词：anhidrosis（无汗症，名词），anhidrotic ectodermal dysplasia（无汗性外胚层发育不良）。"]}
{"word":"anhydrous","summary":{"en":"Anhydrous means “containing no water,” commonly used to describe chemicals kept dry.","zh":"Anhydrous 指“无水的/不含水的”，常用于描述需要保持干燥的化学物质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no water in it; completely dry (especially used for chemicals or substances that normally contain water).","zh":"无水的；不含水的（尤用于化学物质，强调完全不含水分）。"},"examples":[{"en":"Store the anhydrous compound in a sealed container to keep out moisture.","zh":"把这种无水化合物存放在密封容器里，以防吸潮。"},{"en":"Anhydrous ethanol is used in labs because water can affect reactions.","zh":"实验室会使用无水乙醇，因为水会影响反应。"}]}],"synonyms":["water-free","dry","moisture-free"],"phonetic":"/ænˈhaɪdrəs/","extraExplanation":["词源：an- 表示“无/不”，hydrous 与“水”有关（同源于 hydro-）。所以 anhydrous 字面意思就是“没有水的”。","在化学与日常产品里常见对比：anhydrous（无水） vs. hydrated（含结晶水/水合的）。例如：anhydrous calcium chloride（无水氯化钙）常用作干燥剂，因为它很容易吸水。","易混点：anhydrous 不等于 “dehydrated（脱水的）”。dehydrated 强调“原来有水，被去掉水分”；anhydrous 更强调“状态/性质上无水”，常作为配方或化学品规格描述。"]}
{"word":"anhydrously","summary":{"en":"“Anhydrously” means doing something without any water or moisture present, especially in chemistry or lab work.","zh":"“anhydrously”指在无水、无湿气的条件下进行（多用于化学/实验室语境）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an anhydrous (water-free) way; without water or moisture present.","zh":"以无水的方式；在不含水分（无湿气）的情况下。"},"examples":[{"en":"The reaction must be carried out anhydrously to prevent the catalyst from being damaged.","zh":"该反应必须在无水条件下进行，以免催化剂受损。"},{"en":"The salt was stored anhydrously in a sealed container to keep it from absorbing moisture.","zh":"这种盐被密封保存于无水环境中，以防吸潮。"}]}],"synonyms":["without water","in an anhydrous way","under anhydrous conditions","dryly (in technical contexts)"],"phonetic":"/ænˈhaɪdrəsli/","extraExplanation":["“anhydrously”主要出现在化学、制药、材料与实验室语境中；日常英语里更常说“in an anhydrous environment/under anhydrous conditions”（在无水环境/无水条件下）。","“anhydrous”来自希腊语词根：an-（不、无）+ hydor（水），因此其核心含义就是“无水”。"]}
{"word":"anhydroxime","summary":{"en":"A rare chemistry term meaning a dehydrated product derived from a hydroxime.","zh":"一个较少见的化学术语，指由羟肟脱水得到的产物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A compound formed by removing water (dehydration) from a hydroxime; a dehydrated hydroxime used or discussed as a reactive intermediate in organic chemistry.","zh":"（化学）由羟肟酸/羟肟（hydroxime）脱水（失去一分子水）形成的化合物；可指有机化学中讨论或使用的“脱水羟肟”类反应性中间体。"},"examples":[{"en":"In some reactions, a hydroxime can be dehydrated to give an anhydroxime-type intermediate.","zh":"在一些反应中，羟肟可以脱水生成一种类似“anhydroxime”的中间体。"},{"en":"The paper describes the formation of an anhydroxime under strongly dehydrating conditions.","zh":"这篇论文描述了在强脱水条件下生成 anhydroxime 的过程。"}]}],"synonyms":["dehydrated hydroxime"],"phonetic":"/ˌænhaɪˈdrɑːksiːm/","extraExplanation":["这个词非常少见，更多出现在较老的化学文献或特定反应机理讨论里。日常英语或基础化学课程中几乎不会用到。","理解方式可以抓住词形：an-（表示“去掉/缺少”）+ hydroxy-（羟基相关）+ -oxime（肟）。整体暗示“把羟肟中的水去掉后得到的产物/形式”。如果你是在某篇论文里看到它，最好结合该文给出的结构式来确定它具体指哪一类脱水产物。"]}
{"word":"anhymenial","summary":{"en":"A rare medical adjective meaning “without a hymen.”","zh":"一个较少见的医学形容词，意思是“没有处女膜的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Having no hymen; lacking a hymen.","zh":"（医学）无处女膜的；缺少处女膜的。"},"examples":[{"en":"The exam noted an anhymenial condition, which can be present from birth.","zh":"检查记录为无处女膜的情况，这种情况可能从出生就存在。"},{"en":"Some people are naturally anhymenial, so the presence of a hymen is not a reliable sign of sexual activity.","zh":"有些人天生就无处女膜，因此处女膜的存在与否并不能可靠地判断是否有性行为。"}]}],"synonyms":["without a hymen","lacking a hymen"],"phonetic":"/ˌænhaɪˈmiːniəl/","extraExplanation":["“anhymenial”是非常少见、偏医学/解剖学的词，日常英语里更常用的说法通常是 “without a hymen”（没有处女膜）或更中性的医学描述。","需要注意文化与医学事实：处女膜形态差异很大，有人天生较少或缺如，也可能因运动、受伤或医疗原因改变；因此它不应被用作判断“贞洁/性经历”的依据。"]}
{"word":"anhysteretic","summary":{"en":"Anhysteretic means “without hysteresis,” especially in magnetism: no lag or history-dependent loop.","zh":"Anhysteretic 指“无磁滞/无滞后效应”，常用于磁学：响应不依赖历史，不出现滞回回线。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Physics/engineering) Describing a material, system, or process that shows no hysteresis—its response depends only on the current input, not on past history (no loop or lag effect).","zh":"（物理/工程）指材料、系统或过程“无磁滞/无滞后现象”：其响应只取决于当前输入，不受过去状态影响（不会出现滞回环或记忆效应）。"},"examples":[{"en":"In an ideal, anhysteretic material, the magnetization follows the applied field without forming a loop.","zh":"在理想的无磁滞材料中，磁化强度会随外加磁场变化而变化，不会形成滞回回线。"},{"en":"The model assumes an anhysteretic response to simplify the control design.","zh":"该模型假设系统响应无滞后，以简化控制设计。"}]}],"synonyms":["nonhysteretic","hysteresis-free","memoryless (in some contexts)"],"phonetic":"/ˌænˌhɪstəˈrɛtɪk/","extraExplanation":["“Anhysteretic”常见于磁学与材料科学，例如讨论铁磁材料时，会把真实的“磁滞回线（hysteresis loop）”与一个理想化的“无磁滞曲线/无磁滞磁化（anhysteretic magnetization）”对比，用来表征材料在没有历史效应时的基准行为。","词形结构：an-（否定前缀，“无/非”）+ hysteretic（“磁滞的/有滞后效应的”）。在工程语境里，它通常强调“没有记忆效应、可逆、路径无关”。"]}

