{"word":"Anja","summary":{"en":"Anja is a female first name, often used as a variant of Anya or related to Anna in different European naming traditions.","zh":"Anja 是女性名，在不同欧洲命名传统中常被视为 Anya 的变体或与 Anna 有关联。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feminine given name, used in several European languages (often a variant spelling of Anya/Anya), and sometimes used as a nickname for names like Anna.","zh":"女性名字，在多种欧洲语言中使用（常被视为 Anya/Anya 的另一种拼写），有时也可作为 Anna 等名字的昵称。"},"examples":[{"en":"Anja is starting a new job next week.","zh":"Anja 下周要开始一份新工作。"},{"en":"I met Anja at a conference in Berlin.","zh":"我在柏林的一场会议上认识了 Anja。"}]}],"synonyms":["Anya","Anna","Anya (variant spelling)"],"phonetic":"/ˈɑn.jə/","extraExplanation":["“Anja”常见于德语、荷兰语、斯堪的纳维亚语等语境里；在英语环境中也会出现，通常被理解为“Anya”的另一种拼法。","发音在不同语言里会有差异：英语里常读作“AHN-yuh”，而在一些欧洲语言里元音可能更接近“AHN-ya/AN-ya”。","文化来源上，它常与“Anna/Anne”的名字家族相关；而“Anya/Anja”也常被认为与斯拉夫语系中的昵称形式有关。"]}
{"word":"Anjali","summary":{"en":"Anjali is mainly a South Asian female given name; it can also refer to a respectful offering/gesture in Sanskrit-derived contexts.","zh":"Anjali 主要是南亚常见的女性名字；在源自梵语的语境中也可指表示敬意的供奉或合十礼等动作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feminine given name, common in India and among people of South Asian heritage","zh":"（女性名）安贾莉/安佳丽等音译名；常见于印度及南亚裔人群"},"examples":[{"en":"Anjali is my classmate; she moved here from Mumbai.","zh":"Anjali 是我的同学；她从孟买搬到这里。"},{"en":"I met Anjali at a volunteer event last weekend.","zh":"上周末我在一次志愿活动中认识了 Anjali。"}]},{"partOfSpeech":"n.","definition":{"en":"(from Sanskrit, in some cultural/religious contexts) an offering or gesture of respect—often linked to hands pressed together in front of the chest (anjali/anjali mudra)","zh":"（源自梵语，在部分文化/宗教语境中）供奉、敬献或表示敬意的动作；常与双手合十于胸前的姿势相关（anjali/合十礼手印）"},"examples":[{"en":"In yoga class, the teacher asked us to bring our hands to anjali at the heart.","zh":"在瑜伽课上，老师让我们把双手合十放在胸前。"},{"en":"The ceremony included an anjali of flowers as a sign of respect.","zh":"仪式中有献花以示敬意的环节。"}]}],"synonyms":["(as a name) none","(related term) Namaste","(related term) anjali mudra"],"phonetic":"/ʌnˈdʒɑːli/","extraExplanation":["“Anjali”来自梵语词根，常被解释为“奉献/致敬/献礼”。作为人名在印度很常见，也因宝莱坞电影、文学作品与海外移民社区而广为人知。","与其文化含义相关的“anjali mudra”常见于瑜伽与印度传统礼仪，动作类似“合十”，表达尊重、感谢或问候。"]}
{"word":"anjan","summary":{"en":"Anjan can mean traditional South Asian kohl/eyeliner, and it is also used as a personal name.","zh":"Anjan 可指南亚传统的眼部黑色眼膏/眼线，也可用作人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a black cosmetic (kohl/collyrium) traditionally applied to the eyelids or the rims of the eyes in South Asian cultures.","zh":"（南亚文化中常见的）眼部黑色化妆品/眼膏（类似 kohl），用于涂在眼睑或眼周。"},"examples":[{"en":"She applied a thin line of anjan to her eyes before the ceremony.","zh":"仪式前，她在眼周轻轻描了一道 anjan。"},{"en":"In some families, anjan is used for both beauty and tradition.","zh":"在一些家庭里，anjan 既用于美观，也带有传统意义。"}]},{"partOfSpeech":"other","definition":{"en":"a given name (especially in India and neighboring regions).","zh":"（尤见于印度及周边地区的）人名。"},"examples":[{"en":"Anjan is my colleague from Kolkata.","zh":"Anjan 是我来自加尔各答的同事。"},{"en":"They named their son Anjan.","zh":"他们给儿子取名叫 Anjan。"}]}],"synonyms":["kohl","collyrium","eyeliner"],"phonetic":"ˈʌn.dʒʌn","extraExplanation":["“Anjan”在英语里多作为南亚语境的借词出现，对应梵语/印地语等中的“眼膏、眼药”之意，常与“kohl（科尔眼线粉/眼膏）”相近。","在传统观念里，给孩子点抹眼周有时也被认为有象征性用途（如祈愿、习俗），但不同地区与家庭做法差异很大。"]}
{"word":"Anjanet","summary":{"en":"Anjanet is an uncommon female given name, often seen as a variant spelling of Anjanette.","zh":"Anjanet 是较少见的女性名字，常被视为 Anjanette 的变体拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a female given name (a personal name). It is an uncommon spelling variant of “Anjanette/Anjanette,” used as someone’s first name.","zh":"女性名字（人名）。这是较少见的拼写形式，常被视为 “Anjanette/Anjanette” 的变体，用作人的名字。"},"examples":[{"en":"Anjanet moved to Chicago for work.","zh":"Anjanet 为了工作搬到芝加哥。"},{"en":"Please ask Anjanet if she can join the meeting.","zh":"请问一下 Anjanet 能不能参加会议。"}]}],"synonyms":["Anjanette","Ann","Anne"],"phonetic":"ˈæn.dʒə.nɛt","extraExplanation":["“Anjanet/Anjanette” 常被认为与名字 “Ann/Anne”（源自希伯来语，含义常解释为“恩典/慈恩”）有关，并带有法语常见的昵称后缀 “-ette”（有“小、亲昵称呼”的感觉）。不过不同家庭可能有不同的取名来源与拼写选择。","作为人名时，英语里通常要大写首字母：Anjanet。也常见不同拼法（如 Anjanette/Anjanette），但读音可能因本人习惯而略有差异。"]}
{"word":"Anjanette","summary":{"en":"Anjanette is a female first name, a variant of Annette/Jeanette, often linked to Anne/Ann.","zh":"Anjanette 是女性名字，常被视为 Annette/Jeanette 的变体拼写，通常与 Anne/Ann 有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A female given name (proper noun). It is a variant spelling of names like “Annette” or “Jeanette,” often understood as a diminutive (affectionate form) related to Anne/Ann.","zh":"女性名字（专有名词）。常被视为“Annette”或“Jeanette”等名字的变体拼写，通常与 Anne/Ann 有关，带有昵称、亲昵的意味。"},"examples":[{"en":"Anjanette moved to Chicago for her new job.","zh":"Anjanette 为了新工作搬到了芝加哥。"},{"en":"My aunt’s name is Anjanette, but everyone calls her AJ.","zh":"我阿姨叫 Anjanette，但大家都叫她 AJ。"}]}],"synonyms":["Annette","Jeanette","Anjanet"],"phonetic":"/ˌæn.dʒəˈnɛt/","extraExplanation":["“Anjanette”多见于英语语境中的人名拼写变体。它常与法语系/英语系名字 Annette、Jeanette 相关：-ette 在法语中常带有“小、亲昵”的感觉（类似昵称后缀）。不过具体拼写与家族传统、地区习惯有关，因此含义通常以“人名”理解即可。"]}
{"word":"Anjaneya","summary":{"en":"Anjaneya is a widely used name for Hanuman in Hindu tradition, especially in South India.","zh":"Anjaneya 是印度教中哈奴曼（Hanuman）的常用称号之一，尤其常见于南印度。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A name/title for Hanuman, the monkey-god and devoted servant of Rama in Hindu tradition (especially common in South India).","zh":"“阿难迦尼耶（Anjaneya）”：印度教中哈奴曼（Hanuman，猴神）的一个称号/名字，意为他是安伽娜（Anjana）的儿子（在南印度尤常用）。"},"examples":[{"en":"Many devotees chant the Hanuman Chalisa and call him Anjaneya in their prayers.","zh":"许多信众在祈祷中诵念《哈奴曼四十颂》，并称他为 Anjaneya。"},{"en":"The temple is dedicated to Anjaneya, and Tuesdays are especially crowded.","zh":"这座寺庙供奉 Anjaneya，周二尤其拥挤。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension) A temple, statue, or devotional reference specifically associated with Hanuman under the name “Anjaneya.”","zh":"（引申）指以“Anjaneya”之名供奉哈奴曼的寺庙、神像或相关敬拜称呼。"},"examples":[{"en":"We stopped by an Anjaneya shrine during our trip.","zh":"旅行途中我们顺路拜访了一处 Anjaneya 小神龛。"},{"en":"There’s an Anjaneya statue at the entrance to the neighborhood.","zh":"社区入口处立着一尊 Anjaneya 神像。"}]}],"synonyms":["Hanuman","Maruti","Bajrangbali"],"phonetic":"ˌʌn.dʒəˈneɪ.jə","extraExplanation":["“Anjaneya”来自梵语传统，字面含义常理解为“安伽娜（Anjana）的儿子”，因此与哈奴曼的身世传说相关。不同地区也会用不同称呼指同一位神祇：如 Hanuman、Maruti、Bajrangbali 等。","在英文文本中它通常作为专有名词出现（首字母大写），也常见于寺庙名称（如 “Sri Anjaneya Temple”）。如果你在印度南部旅行或阅读相关文化材料，更容易遇到这一称呼。"]}
{"word":"Anjela","summary":{"en":"Anjela is a female given name, often a variant spelling of Angela.","zh":"Anjela 是女性名字，常见为 Angela 的变体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feminine given name; a variant spelling of “Angela” in some languages or personal spellings.","zh":"女性名字；在一些语言或个人拼写中是 “Angela” 的变体拼写。"},"examples":[{"en":"Anjela is my sister’s name.","zh":"Anjela 是我姐姐的名字。"},{"en":"In this book, Anjela is the main character.","zh":"在这本书里，Anjela 是主角。"},{"en":"She spells her name Anjela, but it’s often pronounced like “Angela.”","zh":"她把名字拼作 Anjela，但常常读起来像 “Angela”。"}]}],"synonyms":["Angela","Angelina","Angie"],"phonetic":"/ænˈdʒɛlə/","extraExplanation":["“Anjela” 多见于不同语言/地区对 “Angela” 的转写或个人改拼（例如把 -g- 的 /dʒ/ 音用字母 j 表示）。在英语环境中，人们常会把它当作 “Angela” 来读，但具体读音最好以本人习惯为准。","文化来源上，“Angela/Anjela” 与希腊语词根 angel-（“使者/天使”）相关，因此很多人会联想到“天使般、善良”的含义。"]}
{"word":"Anjelika","summary":{"en":"Anjelika is a feminine given name, a variant spelling of Angelika/Angelica.","zh":"Anjelika 是女性名字，属于 Angelika/Angelica 的变体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A female given name, a less common spelling of “Angelika/Angelica.”","zh":"女性名字，“Angelika/Angelica”的一种较少见拼写形式。"},"examples":[{"en":"Anjelika moved to Chicago for college.","zh":"Anjelika 去芝加哥上大学了。"},{"en":"Could you spell your name—Anjelika with a “j,” right?","zh":"你能拼一下你的名字吗——是带“j”的 Anjelika，对吗？"}]}],"synonyms":["Angelika","Angelica","Anjelica"],"phonetic":"/ˌæn.dʒəˈli.kə/","extraExplanation":["“Anjelika”通常被视为“Angelika/Angelica”的变体拼写。名字来源与“angel（天使）”同源，常带有“像天使一样、天使的”这种联想与文化意象。","常见拼写包括：Angelika（在一些欧洲语言环境更常见）、Angelica（英语中较常见）。在正式证件与邮件中，注意尊重当事人自选拼写。"]}
{"word":"Anjiang Agricultural School","summary":{"en":"a proper name for an agricultural school in Anjiang, China","zh":"中国安江地区一所农业学校的名称"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name for an agricultural (often vocational/secondary) school located in Anjiang, China; in many contexts it refers to the former school in Hunan associated with early hybrid-rice research.","zh":"“安江农业学校”的专有名称；多用于指中国安江地区的一所农业（常为中等职业/中专性质）学校；在不少语境中特指湖南安江那所与杂交水稻早期研究有关的学校。"},"examples":[{"en":"Yuan Longping once taught and did research at Anjiang Agricultural School.","zh":"袁隆平曾在安江农业学校任教并开展研究。"},{"en":"The students visited Anjiang Agricultural School to learn modern farming techniques.","zh":"学生们参观安江农业学校，学习现代农业技术。"},{"en":"She applied to Anjiang Agricultural School after middle school.","zh":"她初中毕业后报考了安江农业学校。"}]}],"synonyms":["Anjiang Agricultural School","Anjiang Agrarian School"],"phonetic":"/ɑnˈdʒjɑŋ ˌæɡrəˈkʌltʃərəl skul/","extraExplanation":["在英文材料里，这个名称有时会与“hybrid rice（杂交水稻）”的历史叙述一起出现，因为相关人物与研究曾在安江一带的农业学校/科研教学机构开展。不同资料对学校的英文名可能略有差异，但通常都指向同一所或同一系统的机构。"],"etymology":"“Anjiang”是中文地名“安江”的拼音转写；“Agricultural School”意为“农业学校”。合起来是机构名称的英译/英文化写法，常用于介绍学校或历史事件。","mnemonic":["记忆法：Anjiang≈“安江”（直接拼音对照）；Agricultural=“农业的”，School=“学校”，三段拼起来就是“安江+农业+学校”。"]}
{"word":"Anjou","summary":{"en":"Anjou can mean a historic region in western France or, in food contexts, the Anjou pear variety.","zh":"Anjou 可指法国西部的历史地区“安茹”，也可在食品语境中指“安茹梨”这一梨的品种。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A historic region (formerly a province) in western France, centered around the city of Angers, known for Loire Valley castles and wine.","zh":"（法国）昂热（Angers）一带的历史地区/旧省份“安茹”，位于法国西部，以卢瓦尔河谷城堡与葡萄酒闻名。"},"examples":[{"en":"They toured châteaux in Anjou during their trip through the Loire Valley.","zh":"他们在卢瓦尔河谷旅行时参观了安茹的城堡。"},{"en":"Anjou has a long history tied to French royalty and medieval politics.","zh":"安茹与法国王室及中世纪政治有很深的历史渊源。"}]},{"partOfSpeech":"n.","definition":{"en":"Short for “Anjou pear,” a common variety of pear (often sold as Green Anjou or Red Anjou).","zh":"“安茹梨”（Anjou pear）的简称，一种常见梨的品种（常见有绿安茹与红安茹）。"},"examples":[{"en":"I bought a bag of Anjou pears for a fruit salad.","zh":"我买了一袋安茹梨来做水果沙拉。"},{"en":"Green Anjou stays fairly firm, so it’s great for slicing.","zh":"绿安茹的果肉比较结实，很适合切片。"}]}],"synonyms":["Anjou pear (food context)","Green Anjou","Red Anjou"],"phonetic":"/ænˈʒuː/","extraExplanation":["“Anjou”是法语地名的英语写法，常见读法接近“an-ZHOO”。在英语文章里，它既可能指法国历史地理区域，也可能出现在食品语境里指“Anjou pear（安茹梨）”。判断含义通常看上下文：旅游/历史/葡萄酒多半是地区；超市/食谱/水果多半是梨。"]}
{"word":"anjou","summary":{"en":"Anjou most commonly refers to a historic region in western France; it can also mean an Anjou pear, and in history the House of Anjou.","zh":"Anjou 最常指法国西部的历史地区“安茹”；也可指“安茹梨”，以及历史上的“安茹家族/安茹系”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A historic region of western France (around today’s Maine-et-Loire), known for castles, wine, and its medieval history.","zh":"法国西部的一个历史地区（大致在今“曼恩-卢瓦尔省”一带），以城堡、葡萄酒和中世纪历史闻名。"},"examples":[{"en":"The Loire Valley includes parts of Anjou and is famous for its châteaux.","zh":"卢瓦尔河谷包含安茹的一部分，以众多城堡闻名。"},{"en":"They tasted a white wine from Anjou at the restaurant.","zh":"他们在餐厅品尝了一款来自安茹的白葡萄酒。"}]},{"partOfSpeech":"n.","definition":{"en":"A type of pear (often called the Anjou pear), usually green or red, known for its mild sweetness.","zh":"一种梨（常称“安茹梨”），通常为绿色或红色，味道清甜柔和。"},"examples":[{"en":"I bought a couple of Anjou pears for a snack.","zh":"我买了几个安茹梨当零食。"},{"en":"Anjou pears stay firm, so they work well in salads.","zh":"安茹梨比较耐放、口感较扎实，很适合做沙拉。"}]},{"partOfSpeech":"n.","definition":{"en":"In history, the noble “House of Anjou” (or Angevin dynasty), which ruled territories in France and England in the Middle Ages.","zh":"历史上的“安茹家族”（亦称“安茹王朝/安茹系”，英文常说 Angevin），中世纪曾统治法国与英格兰的部分领地。"},"examples":[{"en":"Henry II is often linked with the Angevin Empire, connected to Anjou.","zh":"亨利二世常与“安茹帝国”（与安茹相关）联系在一起。"},{"en":"The House of Anjou played a major role in medieval European politics.","zh":"安茹家族在中世纪欧洲政治中扮演了重要角色。"}]}],"synonyms":["Angevin (related term)"],"phonetic":"/ɑnˈʒu/","extraExplanation":["“Anjou”常见于地名、历史与美食语境：在英文里点酒或看产区时会遇到（如 Anjou Blanc/Anjou Rosé）。","与之相关的形容词/指代词是“Angevin”（安茹的；安茹家族的），例如 Angevin kings（安茹系国王）。","“Anjou pear”在北美超市很常见，读菜单或食谱时看到 Anjou 通常指这种梨。"]}

