{"word":"Ankara","summary":{"en":"Ankara is the capital city of Turkey.","zh":"Ankara 是土耳其的首都。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The capital city of Turkey, located in central Anatolia.","zh":"安卡拉（土耳其首都），位于安纳托利亚中部。"},"examples":[{"en":"Ankara is the political center of Turkey.","zh":"安卡拉是土耳其的政治中心。"},{"en":"She moved to Ankara for a government job.","zh":"她为了政府工作搬到了安卡拉。"}]}],"synonyms":["Turkey’s capital","the Turkish capital"],"phonetic":"/ˈæŋkərə/","extraExplanation":["“Ankara”在英语里主要作为专有名词使用（城市名），通常不加冠词：说“in Ankara”“from Ankara”。","安卡拉在1923年土耳其共和国成立后成为首都（取代伊斯坦布尔），常用于新闻与历史语境，如“Ankara-based government”（安卡拉的政府）。"]}
{"word":"ankara","summary":{"en":"Ankara most commonly means the capital of Turkey; it can also refer to a colorful patterned cotton fabric popular in West Africa.","zh":"Ankara通常指土耳其首都安卡拉；也可指西非常见的彩色印花棉布（安卡拉布）及其服饰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the capital city of Turkey, located in the central Anatolia region","zh":"安卡拉（土耳其首都，位于安纳托利亚中部）"},"examples":[{"en":"Ankara is Turkey’s capital, while Istanbul is its largest city.","zh":"安卡拉是土耳其的首都，而伊斯坦布尔是最大的城市。"},{"en":"We flew to Ankara for a conference at a university.","zh":"我们飞到安卡拉参加一所大学的会议。"}]},{"partOfSpeech":"n.","definition":{"en":"a brightly colored, patterned cotton fabric (and the clothing made from it), widely worn in parts of West Africa; often called “ankara fabric”","zh":"安卡拉布（色彩鲜艳的印花棉布及其服装），在西非等地很常见；常说“ankara fabric”"},"examples":[{"en":"She wore an ankara dress to the wedding.","zh":"她在婚礼上穿了一条安卡拉印花连衣裙。"},{"en":"Ankara fabric is popular for making skirts, shirts, and headwraps.","zh":"安卡拉布常用来做裙子、衬衫和头巾。"}]}],"synonyms":["Turkey’s capital","ankara fabric","wax print"],"phonetic":"/ˈɑŋkərə/","extraExplanation":["“Ankara（安卡拉）”这座城市在英语里以前也常被称为 **Angora（安哥拉）**；你可能在 **Angora goat（安哥拉山羊）/angora wool（安哥拉羊毛）** 里见过这个旧称。","“ankara fabric（安卡拉布）”在西非语境里通常指蜡染/印花棉布风格的面料与服饰；它的名称与土耳其首都并不一定有直接来源关系，更多是现代商业与流行用法。"]}
{"word":"ankaramite","summary":{"en":"Ankaramite is a type of basaltic volcanic rock rich in olivine and augite.","zh":"安卡拉岩是一种富含橄榄石和普通辉石的玄武质火山岩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a dark, volcanic igneous rock (a kind of basalt) rich in olivine and augite (pyroxene).","zh":"一种深色的火山喷出岩（玄武岩的一种），富含橄榄石和普通辉石（辉石类）。"},"examples":[{"en":"The lava flow cooled into ankaramite with visible green olivine crystals.","zh":"这股熔岩流冷却后形成了安卡拉岩，其中可见绿色的橄榄石晶体。"},{"en":"Some ocean-island basalts can be described as ankaramite when they contain abundant olivine and augite.","zh":"某些海洋岛玄武岩在含有大量橄榄石和普通辉石时，可称为安卡拉岩。"}]}],"synonyms":["olivine basalt","pyroxene-rich basalt","picritic basalt (close in meaning)"],"phonetic":"/ænˈkærəmaɪt/","extraExplanation":["“ankaramite”是地质学用语，属于比较专业且不常见的岩石名称。常用于描述矿物成分特征明显、富橄榄石与辉石的玄武质火山岩。","词名来自地名（与马达加斯加的Ankaramy/相关地区有关），用于指该地或类似成分的岩石类型。"]}
{"word":"ankaratrite","summary":{"en":"Ankaratrite is an olivine-rich volcanic rock, originally named after Madagascar’s Ankaratra region.","zh":"Ankaratrite 指一种富含橄榄石的火山岩，名称源自马达加斯加的安卡拉特拉地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a dark, fine-grained volcanic rock (a type of basalt/basanite) rich in olivine and often containing clinopyroxene; originally described from the Ankaratra region of Madagascar","zh":"一种深色、细粒的火山岩（可视作玄武岩/碱玄岩的一种变体），富含橄榄石，常含单斜辉石；最早在马达加斯加安卡拉特拉（Ankaratra）地区被描述"},"examples":[{"en":"The field guide notes that ankaratrite is an olivine-rich volcanic rock.","zh":"野外指南指出，ankaratrite 是一种富含橄榄石的火山岩。"},{"en":"Samples from the lava flow were classified as ankaratrite based on their mineral content.","zh":"根据矿物组成，那条熔岩流的样品被归类为 ankaratrite。"}]}],"synonyms":["basanite","basalt (broader term)"],"phonetic":"/ænˈkærəˌtraɪt/","extraExplanation":["词源与背景：ankaratrite 这个名称来自马达加斯加的 Ankaratra 火山地区，属于以产地命名的岩石名。","学习提示：它属于地质学/岩石学术语，在日常英语中很少出现；更常见的上位词是 basalt（玄武岩）或 basanite（碱玄岩）。"]}
{"word":"ankee","summary":{"en":"“Ankee” is almost certainly “Yankee”: an American (often a Northerner historically), or related to the New York Yankees.","zh":"“ankee”几乎可以确定是“Yankee”：指美国人（历史上常指北方人），也可指与纽约洋基队有关的人或事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled “Yankee”) a person from the United States; in some contexts, especially someone from the northern U.S. (historically, during the American Civil War).","zh":"（通常拼作“Yankee”）美国人；在某些语境中尤指美国北方人（历史上常与南北战争时期相关）。"},"examples":[{"en":"When I studied abroad, some people called me a Yankee because I’m American.","zh":"我在国外读书时，有些人因为我是美国人就叫我“Yankee”。"},{"en":"In the Civil War era, “Yankee” often referred to soldiers from the North.","zh":"在南北战争时期，“Yankee”常用来指北方的士兵。"}]},{"partOfSpeech":"n.","definition":{"en":"(Sports) a player on the New York Yankees baseball team, or a fan of the team.","zh":"（体育）纽约洋基队（New York Yankees）的球员；或该队球迷。"},"examples":[{"en":"He’s been a Yankees fan since he was a kid.","zh":"他从小就是洋基队的球迷。"},{"en":"A Yankee hit a home run in the ninth inning.","zh":"一名洋基队球员在第九局击出全垒打。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the U.S., especially the northern U.S., or to the New York Yankees team.","zh":"与美国（尤指美国北方）有关的；或与纽约洋基队有关的。"},"examples":[{"en":"She has a slight Yankee accent from growing up in New England.","zh":"她在新英格兰长大，带一点北方口音。"},{"en":"He wore a Yankees cap.","zh":"他戴着一顶洋基队的帽子。"}]}],"synonyms":["American","Northerner","New Yorker (context-dependent)"],"phonetic":"/ˈjæŋki/","extraExplanation":["你输入的“ankee”很可能是拼写少了首字母的“Yankee”。在英语里它有时带有立场或历史色彩：在美国南方语境中，“Yankee”可能带一点讽刺或对立意味；但在国际语境里常只是“美国人”的中性称呼。","词源常被认为与荷兰语名字/昵称有关（如 Jan/“Janke”），后来在北美逐渐演变为对某些殖民地居民的称呼。","文化用法：歌曲《Yankee Doodle》在美国独立战争时期很有名；“Yankee”也常出现在历史小说、战争题材作品里，用来区分北方与南方。"]}
{"word":"ankel","summary":{"en":"Ankle: the joint/area where the foot meets the leg.","zh":"Ankle：脚踝；脚与小腿连接处的关节/部位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the joint that connects the foot to the leg; the area around this joint","zh":"脚踝；踝关节（连接脚与小腿的关节及其周围部位）"},"examples":[{"en":"I twisted my ankle while running.","zh":"我跑步时扭伤了脚踝。"},{"en":"Her socks come up to her ankles.","zh":"她的袜子长到脚踝。"},{"en":"The dog bit him on the ankle.","zh":"那只狗咬了他的脚踝。"}]}],"synonyms":["(no exact synonym; related: joint, foot, heel)"],"phonetic":"/ˈæŋkəl/","extraExplanation":["你输入的“ankel”通常是拼写错误，正确拼写是 **ankle**。","在日常英语里，**ankle** 既可以指“踝关节”这个结构，也常泛指脚踝这一圈的位置（比如穿到脚踝的袜子）。","常见搭配：**twist/sprain your ankle**（扭伤脚踝），**ankle-high**（齐踝高的，如 ankle-high boots 齐踝靴）。"]}
{"word":"Ankeny","summary":{"en":"Ankeny is a city in central Iowa, USA.","zh":"Ankeny 是美国爱荷华州中部的一座城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in central Iowa, USA, near Des Moines.","zh":"美国爱荷华州中部的一座城市，靠近得梅因（Des Moines）。"},"examples":[{"en":"Ankeny is a fast-growing suburb of Des Moines.","zh":"安克尼（Ankeny）是得梅因附近发展很快的郊区城市。"},{"en":"I moved to Ankeny for a new job in Iowa.","zh":"我为了在爱荷华州的新工作搬到了安克尼。"}]}],"phonetic":"/ˈæŋkəni/","extraExplanation":["“Ankeny”是专有名词（地名），通常不翻译含义，而是按音译写作“安克尼”。","该地名常见于美国中西部语境；在日常英语中多用来指“住在/去到Ankeny”，搭配介词in、to、from等（如：in Ankeny, to Ankeny）。"]}
{"word":"anker","summary":{"en":"“Anker/anker” is uncommon as a regular English word; it usually refers to “anchor,” or appears as a German spelling or a brand/name.","zh":"“Anker/anker”在英语里不是常见标准拼写；通常对应“anchor（锚/固定点/主播）”，或作为德语拼写、品牌/名字出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon in everyday English) a person or thing that anchors something; for example, a TV/news anchor or an anchor point in a system.","zh":"（日常英语中不常见）起“固定/支撑/主持”作用的人或物；例如新闻主播，或系统中的固定点/锚点。"},"examples":[{"en":"She is the main anchor (anker) on the evening news.","zh":"她是晚间新闻的主力主播（anchor；anker 属不常见拼写/用法）。"},{"en":"The rope needs a strong anchor (anker) point in the rock.","zh":"这根绳子需要在岩石上有一个牢固的锚点。"}]},{"partOfSpeech":"other","definition":{"en":"A common spelling in German and some names/brands (e.g., the electronics brand Anker), meaning “anchor.”","zh":"在德语以及一些姓名/品牌中常见的拼写（如电子品牌 Anker），意思相当于英语的“anchor（锚；固定物/支撑点）”。"},"examples":[{"en":"Anker is a popular brand for phone chargers.","zh":"Anker 是一个很受欢迎的手机充电器品牌。"},{"en":"In German, “Anker” means “anchor.”","zh":"在德语里，“Anker”意思是“锚”。"}]}],"synonyms":["anchor","anchorperson","anchorman","anchorwoman","anchor point"],"phonetic":"/ˈæŋkər/","extraExplanation":["英语里更常见的拼写是 **anchor**。如果你是想表达“锚/固定/主播”的意思，写 **anchor** 会更自然、也更容易被理解。","“Anker” 作为品牌名时通常保留大写，并读音接近英语 **anchor**。"]}
{"word":"ankerhold","summary":{"en":"“Anchor hold” is mainly a wrestling submission hold; more loosely, it can mean a strong restraint that’s hard to escape.","zh":"“anchor hold”主要指摔跤/格斗中的一种锁技；也可较少见地比喻难以摆脱的强力牵制。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a wrestling hold (submission) where you twist an opponent’s leg (often by bending the knee and lifting the foot) to force them to submit","zh":"（摔跤/格斗中的）“锚式锁技/锚固压制”，通过扭转对手的腿（常见做法是弯膝并抬起脚）造成疼痛以迫使认输"},"examples":[{"en":"He won the match with an anchor hold in the second round.","zh":"他在第二回合用锚式锁技赢下了比赛。"},{"en":"The coach warned beginners not to apply the anchor hold too quickly.","zh":"教练提醒初学者不要太快施加锚式锁技。"}]},{"partOfSpeech":"phrase","definition":{"en":"(figurative, less common) a secure grip or restraint that makes it hard to move or escape","zh":"（比喻，用法较少）牢牢的控制/牵制，让人难以移动或摆脱"},"examples":[{"en":"Debt can feel like an anchor hold on your future plans.","zh":"债务有时会像一种“锚式束缚”，拖住你未来的计划。"},{"en":"Old habits kept an anchor hold on him.","zh":"旧习惯对他形成了难以挣脱的束缚。"}]}],"synonyms":["leg lock","submission hold","hold","grip","restraint"],"phonetic":"ˈæŋkər hoʊld","extraExplanation":["你输入的“ankerhold”在英语里不太常见，更可能是拼写合并后的“anchor hold”。在摔跤/职业摔角语境中更常见。","不同项目对这一招的名称可能不同；有时也会被归到更泛的“leg lock（腿部关节技）”类别里。"]}
{"word":"ankerite","summary":{"en":"Ankerite is a carbonate mineral composed mainly of calcium, iron, and magnesium.","zh":"Ankerite（铁白云石）是一种主要由钙、铁、镁组成的碳酸盐矿物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A mineral (a type of carbonate) made mainly of calcium, iron, and magnesium, often found in rocks and mineral veins.","zh":"一种矿物（碳酸盐矿物），主要由钙、铁、镁组成，常见于岩石中或矿脉里。"},"examples":[{"en":"The geologist identified ankerite in a carbonate vein.","zh":"地质学家在一条碳酸盐矿脉中鉴定出了铁白云石（ankerite）。"},{"en":"Ankerite can look similar to other carbonate minerals, so tests may be needed.","zh":"铁白云石看起来可能与其他碳酸盐矿物相似，因此可能需要做测试来区分。"}]}],"synonyms":["ankerite (iron-rich dolomite)"],"phonetic":"/ˈæŋkəˌraɪt/","extraExplanation":["“ankerite”常译为“铁白云石”，属于白云石族（dolomite group）的碳酸盐矿物，典型化学式可写作 Ca(Fe,Mg,Mn)(CO3)2（不同样品中铁、镁、锰的比例会变化）。","该名称来自奥地利矿物学家/地质学家 Matthias Joseph Anker（马提亚斯·约瑟夫·安克尔），属于以人物命名的矿物名。"]}
{"word":"ankerites","summary":{"en":"Ankerites are pieces or types of the mineral ankerite, a brownish/yellowish carbonate mineral related to dolomite.","zh":"Ankerites 指矿物 ankerite（菱铁白云石）的复数，即多块或多种该褐黄色综合碳酸盐矿物，和白云石相近。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mineral (a type of carbonate) similar to dolomite, usually brownish or yellowish, made mainly of calcium, iron, magnesium, and manganese; the plural form refers to multiple pieces or kinds of this mineral.","zh":"一种与白云石相似的碳酸盐矿物，常呈褐色或黄色，主要由钙、铁、镁和锰组成；复数形式表示多块或多种该矿物。"},"examples":[{"en":"The rock sample contains ankerites along with quartz and calcite.","zh":"这块岩石样品中含有菱铁白云石（ankerites），并伴生石英和方解石。"},{"en":"Geologists identified brown ankerites filling small cracks in the limestone.","zh":"地质学家发现石灰岩的小裂隙被褐色的菱铁白云石所充填。"}]}],"synonyms":["ankerite (singular)","carbonate mineral"],"phonetic":"/ˈæŋkəˌraɪts/","extraExplanation":["“ankerites”通常是“ankerite”的复数。该矿物常见于热液脉、变质岩或碳酸盐岩中，有时会与矿化作用（如金属矿床形成）相关。","在野外或标本观察时，它的颜色与光泽可能让人把它与白云石、方解石混淆；更准确的鉴定通常需要化学成分或实验室测试。"]}
{"word":"ankh","summary":{"en":"An ancient Egyptian symbol meaning (eternal) life.","zh":"古埃及象征“（永恒的）生命”的安卡符号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cross-shaped ancient Egyptian symbol with a loop at the top, representing life (especially eternal life) and sometimes protection.","zh":"“安卡（十字）”：古埃及符号，上端为环形的十字形图案，象征生命（尤指永生），有时也表示护佑。"},"examples":[{"en":"In many Egyptian paintings, a god holds an ankh to show the power to give life.","zh":"在许多埃及壁画中，神祇手持安卡，表示赐予生命的力量。"},{"en":"She wore an ankh necklace as a symbol of life and spiritual protection.","zh":"她戴着安卡项链，把它当作生命与精神守护的象征。"}]}],"synonyms":["crux ansata","Egyptian cross"],"phonetic":"/ɑŋk/","extraExplanation":["“ankh”源自古埃及语（常被解释为“生命”）。在艺术中，神常把安卡递到法老鼻前，象征赐予“生命之气”。","在现代文化里，安卡常见于首饰、纹身与流行文化作品中，有时也被新兴宗教或灵性社群借用为“生命/永恒”的象征；使用时注意尊重其古埃及文化背景。"]}
{"word":"ankhs","summary":{"en":"“Ankhs” means multiple ankhs—ancient Egyptian looped crosses symbolizing life (often eternal life).","zh":"“ankhs”是 ankh 的复数，指多个古埃及“生命之符”（上端有圆环的十字），象征生命/永生。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of ankh: ancient Egyptian cross-shaped symbols (a cross with a loop at the top) that represent “life,” especially eternal life.","zh":"ankh 的复数：古埃及的“生命之符”（上端有圆环的十字形符号），象征“生命”，也常指“永生”。"},"examples":[{"en":"The museum displayed several ankhs carved into the temple wall.","zh":"博物馆展出了刻在神庙墙上的几个生命之符（ankhs）。"},{"en":"In many paintings, gods are shown holding ankhs as a sign of life and power.","zh":"在许多绘画中，神祇手持生命之符（ankhs），象征生命与力量。"}]}],"synonyms":["Egyptian crosses","symbols of life","crux ansata"],"phonetic":"/ɑŋks/","extraExplanation":["“ankh”源自古埃及象形文字，常被称为“key of life（生命之钥）”。它经常出现在神庙浮雕与墓葬艺术中，神祇把 ankh 递到法老口边，象征赐予生命或复活。","英语里更常见的是单数 ankh；写成 ankhs 通常是在描述多个符号或多件文物。","相关术语：Coptic cross（科普特十字）有时会被拿来和 ankh 做比较，但它们的历史与用法并不相同。"]}
{"word":"Anking","summary":{"en":"“AnKing” usually refers to a well-known Anki flashcard deck used for spaced-repetition study, especially in medicine.","zh":"“AnKing”通常指一套很知名的 Anki 复习卡组，主打间隔重复记忆，尤其在医学学习中常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a popular community-made Anki flashcard deck and brand name (the “AnKing” deck), widely used by medical and other health-profession students for spaced-repetition studying","zh":"一个很受欢迎的 Anki 社群自制卡组与品牌名（“AnKing” 卡组），常被医学生及其他健康相关专业学生用来进行间隔重复记忆学习"},"examples":[{"en":"I’m using AnKing to review pathology every day.","zh":"我每天用 AnKing 来复习病理。"},{"en":"Many students suspend extra cards in AnKing to match their lectures.","zh":"很多学生会在 AnKing 里暂停一些额外卡片，让复习进度更贴合课堂。"},{"en":"She updated her AnKing deck after installing the new add-on.","zh":"她安装了新的插件后更新了 AnKing 卡组。"}]}],"synonyms":["AnKing deck","AnKing Overhaul","Anki deck (general term)"],"phonetic":"/ˈænˌkɪŋ/","extraExplanation":["“AnKing”通常写作 AnKing（大小写固定），在学习圈里多指“AnKing Overhaul”这一套基于 Anki 的大型卡组，内容常与 USMLE、医学基础与临床复习相关。","在英语语境中它更像专有名词/品牌名：常见搭配有 the AnKing deck, AnKing cards, AnKing Overhaul。日常口语里也有人把它当作动词用（非正式），如 “I AnKing’ed it”（我用 AnKing 刷了一遍）。"]}
{"word":"ankiz","summary":{"en":"“ankiz” usually means Anki (or Anki cards/decks) in casual typing.","zh":"“ankiz”通常是非正式写法，指 Anki 或 Anki 的卡片/卡组。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A casual or misspelled form of “Anki,” a popular spaced-repetition flashcard app used for memorizing vocabulary and facts (often for language learning).","zh":"“Anki”的口语/拼写变体；Anki 是一款利用“间隔重复”来记忆单词与知识点的抽认卡软件（常用于语言学习）。"},"examples":[{"en":"I’m making some ankiz for English phrasal verbs tonight.","zh":"我今晚要做一些 ankiz（Anki 卡片/卡组）来背英语短语动词。"},{"en":"Do you share your ankiz deck, or do you make your own cards?","zh":"你的 ankiz 卡组会分享吗，还是自己做卡？"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension) Anki flashcards or an Anki “deck” (a collection of cards).","zh":"（引申）指 Anki 的抽认卡或“卡组”（一组卡片的集合）。"},"examples":[{"en":"These ankiz are great for TOEFL vocabulary review.","zh":"这些 ankiz 很适合复习托福词汇。"},{"en":"I did 50 ankiz on my commute.","zh":"我通勤时刷了 50 张 ankiz（Anki 卡）。"}]}],"synonyms":["Anki","flashcards","spaced repetition","Anki deck"],"phonetic":"/ˈɑːnkiz/","extraExplanation":["“Anki”一词来自日语「暗記」（あんき），意思是“背诵/记忆”。因此在学习圈里，大家常把“刷 Anki”当作固定说法。","严格来说，英语里更常见的写法是 Anki（首字母大写）；“ankiz”多见于聊天、打字快速时的非正式拼写。"]}
{"word":"ankle","summary":{"en":"An ankle is the joint between your leg and your foot.","zh":"ankle 指脚与腿之间的关节，也就是“脚踝/踝关节”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the joint that connects the foot to the leg","zh":"踝关节；脚踝（连接脚与腿的关节）"},"examples":[{"en":"I twisted my ankle while running.","zh":"我跑步时扭伤了脚踝。"},{"en":"Her ankle was swollen, so she put ice on it.","zh":"她的脚踝肿了，所以敷了冰。"},{"en":"The nurse wrapped his ankle with a bandage.","zh":"护士用绷带把他的脚踝包扎起来。"}]}],"synonyms":["ankle joint"],"phonetic":"/ˈæŋkəl/","extraExplanation":["“ankle”常用于运动和医疗场景：twist/sprain/break an ankle（扭伤/扭到/骨折脚踝），以及ankle brace（护踝）、ankle strap（踝带/踝部绑带）。","在服装与时尚语境中，ankle也常出现在描述长度：ankle-length dress/skirt（及踝长裙）。","词源上与身体部位的古英语词有关，现代用法非常稳定；日常口语中“ankle”指关节本身，比“foot（脚）”更具体。"]}
{"word":"anklebone","summary":{"en":"Anklebone usually means a bone in the ankle—often the talus; historically it can also mean an animal ankle bone used in traditional games.","zh":"anklebone 通常指踝部的骨头（常指距骨）；在历史语境中也可指用于传统游戏的动物踝骨。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small bone in the ankle area; commonly refers to the talus (the bone between the leg bones and the heel bone).","zh":"踝骨；通常指距骨（位于小腿骨与跟骨之间的骨头）。"},"examples":[{"en":"He fractured an anklebone while playing basketball.","zh":"他打篮球时把踝骨骨折了。"},{"en":"The doctor checked her anklebone for swelling and pain.","zh":"医生检查了她踝骨是否肿胀和疼痛。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) The small bone of the ankle used in some traditional children’s games (like jacks), historically from animals such as sheep or goats.","zh":"（较少见）用于一些传统儿童游戏（类似“抓子儿/掷子儿”）的踝骨，小骨头历史上常取自动物（如羊或山羊）。"},"examples":[{"en":"In some old games, children tossed anklebones and tried to catch them.","zh":"在一些古老的游戏里，孩子们会抛掷踝骨并试着接住。"},{"en":"Museums sometimes display anklebones as early toys.","zh":"博物馆有时会把踝骨作为早期玩具展出。"}]}],"synonyms":["talus","ankle bone","astragalus (historical/technical)"],"phonetic":"/ˈæŋkəlˌboʊn/","extraExplanation":["“anklebone”在现代医学语境里常被用来泛指踝部的骨头，但更具体时常对应“talus（距骨）”。日常口语里，如果要更明确，常说“ankle bone”或直接用具体骨名（talus / malleolus 等）。","作为“游戏用的踝骨”，它在英语里也可见于古典或人类学/考古学语境，与古希腊罗马的astragalus（距骨游戏）传统有关；现代英语更常用复数“knucklebones/anklebones”来指这类游戏道具。"]}
{"word":"anklebones","summary":{"en":"“Anklebones” can mean the bones in the ankle, or a traditional game using small bones (like “jacks”).","zh":"“anklebones”可指脚踝处的骨头，也可指用小骨头当道具的传统游戏（类似 jacks）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The bones in your ankle area (especially the small bones that connect the foot and lower leg).","zh":"脚踝处的骨头（尤其指连接脚和小腿的那些小骨头）。"},"examples":[{"en":"He injured his anklebones when he fell down the stairs.","zh":"他从楼梯上摔下来，伤到了脚踝的骨头。"},{"en":"The doctor checked her anklebones to see if anything was broken.","zh":"医生检查了她的脚踝骨，看是否有骨折。"}]},{"partOfSpeech":"n.","definition":{"en":"A traditional game played with small bones (or similar pieces), tossed and caught—similar to the game “jacks.”","zh":"一种传统游戏：用小骨头（或类似小物件）进行抛掷与接住，玩法类似“抓子儿/弹子游戏（jacks）”。"},"examples":[{"en":"The children played anklebones in the yard after dinner.","zh":"晚饭后，孩子们在院子里玩“anklebones”。"},{"en":"In the museum, you can see ancient anklebones used as game pieces.","zh":"在博物馆里，你可以看到古代用作游戏道具的“anklebones”。"}]}],"synonyms":["ankle bones","talus (for one ankle bone)","astragali (game pieces)","jacks (similar game)"],"phonetic":"/ˈæŋkəlˌboʊnz/","extraExplanation":["“anklebones”作为游戏名时，常与古希腊/古罗马的“astragaloi（距骨）”有关：人们用羊或山羊的踝骨当作抛接或掷骰式的游戏道具。后来在英语文化中也常被拿来和更现代的“jacks（抓子儿）”类游戏做类比。","在日常医学或解剖语境里，更常说“ankle bones”或直接说具体骨名（如 talus/ankle bone）；“anklebones”作“脚踝骨”时多为口语或泛指。"]}
{"word":"ankled","summary":{"en":"“Ankled” usually means “walked (casually)” as the past form of “ankle,” and in sports slang it can mean “shook an opponent so they lost balance.”","zh":"“ankled”通常是动词ankle的过去式/过去分词，表示“（随意地）走路”；在体育俚语中也可指“把对手晃到失去平衡”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(past tense/past participle) walked or moved on foot, often in a casual way.","zh":"（过去式/过去分词）走路、步行；常带有随意地走动之意。"},"examples":[{"en":"We ankled down to the corner store after dinner.","zh":"晚饭后我们就随意走到街角的商店。"},{"en":"He ankled along the beach, looking for shells.","zh":"他沿着海滩慢慢走，找贝壳。"}]},{"partOfSpeech":"vt.","definition":{"en":"(sports slang, past tense/past participle) made an opponent lose balance with a quick move (as if their ankles ‘broke’).","zh":"（体育俚语，过去式/过去分词）用快速变向等动作把对手晃得失去平衡（俗称“把脚踝晃断”）。"},"examples":[{"en":"The guard ankled his defender with a sharp crossover.","zh":"那名后卫一个犀利的变向把防守者晃得失去平衡。"},{"en":"He got ankled on that play and nearly fell.","zh":"那一球他被晃了，差点摔倒。"}]},{"partOfSpeech":"vt.","definition":{"en":"(less common) injured someone’s ankle; hurt the ankle.","zh":"（较少见）伤到某人的脚踝；使脚踝受伤。"},"examples":[{"en":"She ankled herself stepping off the curb.","zh":"她下路沿时把脚踝扭伤了。"}]}],"synonyms":["walked","strolled","ambled","wandered","(sports) crossed up","(sports) shook"],"phonetic":"/ˈæŋkəld/","extraExplanation":["“ankled”最常见是动词ankle的过去式/过去分词，用来口语化地表示“走着去”。在一些地区英语里，这种说法带一点轻松、随意的语气。","篮球等运动里的“get ankled / he ankled him”属于俚语，常见于网络解说与社交媒体，意思接近“被晃倒/被过得失去重心”，对应表达还有“break someone’s ankles”。正式写作中不太常用。"]}
{"word":"anklejack","summary":{"en":"An uncommon word meaning an ankle boot.","zh":"一个较少见的词，意思是“踝靴/及踝短靴”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/old-fashioned) A short boot that covers the ankle; an ankle boot.","zh":"（较少见/较旧用法）及踝短靴；踝靴。"},"examples":[{"en":"She wore anklejacks with a long coat to keep warm.","zh":"她穿着及踝短靴和长外套来保暖。"},{"en":"In some older texts, “anklejacks” simply means ankle boots.","zh":"在一些较早的文本里，“anklejacks”指的就是踝靴。"}]}],"synonyms":["ankle boot","bootie"],"phonetic":"/ˈæŋkəlˌdʒæk/","extraExplanation":["“anklejack”现在很少见，更常见的说法是 ankle boot 或 bootie。拼写上也可能出现带连字符的 ankle-jack。由于不是现代高频词，在阅读旧书或方言材料时更可能遇到。"]}
{"word":"ankles","summary":{"en":"“Ankles” is the plural of “ankle,” meaning the joint between the foot and the leg.","zh":"“ankles”是“ankle”的复数，指脚与小腿之间的关节（脚踝）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The joint that connects the foot to the leg; the area around this joint.","zh":"脚踝；连接脚和小腿的关节，以及其周围部位。"},"examples":[{"en":"I twisted my ankle while running.","zh":"我跑步时把脚踝扭伤了。"},{"en":"Her ankles were sore after the long hike.","zh":"长途徒步后，她的脚踝很酸痛。"},{"en":"He wore boots that covered his ankles.","zh":"他穿的靴子盖住了脚踝。"}]}],"synonyms":["ankle joint"],"phonetic":"/ˈæŋkəl/","extraExplanation":["“ankles”是“ankle”的复数形式。谈到受伤时常用：sprain an ankle（扭伤脚踝）、break an ankle（脚踝骨折）、ankle brace（护踝）。","文化小知识：在19世纪的部分英语语境里，女性“露出脚踝”曾被视为不够得体；现代英语中这一含义基本只在历史背景或文学描写中出现。"]}
{"word":"anklet","summary":{"en":"An anklet is usually jewelry worn around the ankle; it can also mean a short sock that reaches the ankle.","zh":"anklet 通常指脚踝上戴的饰品（脚链），也可指到脚踝长度的短袜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small piece of jewelry worn around the ankle (often a chain, band, or bracelet-like ornament).","zh":"脚踝上佩戴的饰品（常见为链条、环带或类似手链的装饰）。"},"examples":[{"en":"She wore a silver anklet that jingled when she walked.","zh":"她戴着一条银脚链，走路时会叮当作响。"},{"en":"In some cultures, anklets are worn during weddings and festivals.","zh":"在一些文化中，脚链会在婚礼和节庆时佩戴。"}]},{"partOfSpeech":"n.","definition":{"en":"A sock or short stocking that covers the foot and reaches the ankle (common in plural: anklets).","zh":"短袜；袜口到脚踝处的袜子（常用复数 anklets）。"},"examples":[{"en":"These white anklets match her sneakers.","zh":"这些白色短袜很配她的运动鞋。"},{"en":"He prefers anklets in summer because they feel cooler.","zh":"他夏天更喜欢穿短袜，因为更凉快。"}]}],"synonyms":["ankle bracelet","ankle chain","ankle sock"],"phonetic":"/ˈæŋklət/","extraExplanation":["“anklet”来自“ankle（脚踝）+ -let（表示“小”或“较小的东西”）”，字面意思是“脚踝上的小东西”，因此既可指脚踝饰品，也可指到脚踝长度的短袜。","作为饰品时，anklet在不同文化中可能有不同的象征意义（如装饰、传统服饰的一部分等）；在英语里通常是中性描述，不默认带有特定含义。"]}
{"word":"anklets","summary":{"en":"“Anklets” usually means jewelry worn around the ankles, and it can also mean short ankle socks.","zh":"“Anklets”通常指脚链等脚踝饰品，也可指覆盖脚踝的短袜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A piece of jewelry worn around the ankle; an ankle bracelet.","zh":"脚踝上佩戴的饰品；脚链（脚踝手链）。"},"examples":[{"en":"She wore silver anklets that jingled when she walked.","zh":"她戴着会随步伐叮当作响的银脚链。"},{"en":"In the photo, you can see bright anklets on the dancer’s ankles.","zh":"在照片里，你可以看到舞者脚踝上亮眼的脚链。"}]},{"partOfSpeech":"n.","definition":{"en":"(Plural) Short socks that cover the foot and ankle, often called “ankle socks.”","zh":"（复数）短袜，覆盖脚和脚踝处，常称为“踝袜/船袜（更短）”或“短袜”。"},"examples":[{"en":"I bought a pack of cotton anklets for summer.","zh":"我买了一包夏天穿的棉质短袜。"},{"en":"Wear anklets with sneakers for a clean, casual look.","zh":"搭配运动鞋穿短袜，会显得干净又休闲。"}]}],"synonyms":["ankle bracelets","ankle chains","ankle socks"],"phonetic":"/ˈæŋkləts/","extraExplanation":["“Anklets”最常见是anklet的复数。根据语境，它可能指“脚链（首饰）”，也可能指“短袜（ankle socks）”。在购物或服装语境里常指短袜；在饰品、舞蹈、传统服饰语境里更可能指脚链。"]}
{"word":"ankling","summary":{"en":"“Ankling” is an informal way to say “walking” or sometimes “leaving on foot.”","zh":"“ankling”是口语说法，表示“步行”，有时也指“走人/离开”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"walking somewhere (especially in a casual or confident way); also used meaning “to leave.”","zh":"步行前往某处（常带有随意或自信的感觉）；也可指“离开/走人”。"},"examples":[{"en":"He was ankling down the street with his hands in his pockets.","zh":"他把手插在口袋里，沿街悠闲地走着。"},{"en":"When the meeting got awkward, she started ankling toward the door.","zh":"会议变得尴尬时，她开始朝门口走去。"},{"en":"After the final whistle, fans were ankling out of the stadium.","zh":"终场哨响后，球迷们步行离开了体育场。"}]}],"synonyms":["walking","strolling","heading out","leaving","making one’s way"],"phonetic":"/ˈæŋk(ə)lɪŋ/","extraExplanation":["“ankling”来自俚语动词“to ankle”（用脚踝走路→走路），常见于美式口语、体育报道或较随意的叙述中。语气比中性词“walking”更口语、更有画面感，有时也带一点“干脆走人”的意味。"]}
{"word":"anklong","summary":{"en":"“anklong” isn’t a recognized English word; it’s likely a misspelling or a name/romanization.","zh":"“anklong”不是规范英语词汇；更可能是拼写错误或人名/音译。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a name/romanization from another language.","zh":"不是标准英语单词，更可能是拼写错误，或来自其他语言的姓名/音译写法。"},"examples":[{"en":"I couldn’t find “anklong” in an English dictionary—did you mean “ankle” or “along”?","zh":"我在英语词典里找不到“anklong”——你是不是想写“ankle（脚踝）”或“along（沿着/一起）”？"}]}],"phonetic":"/ˈæŋklɔŋ/","extraExplanation":["“anklong”在英语里不常见，也没有固定词义。常见情况：\n1）把两个词连在一起打错了（如 an + along / an + long）。\n2）把常见词拼错了：ankle（脚踝）、along（沿着；一起）。\n3）可能是人名、地名，或其他语言的拉丁字母拼写（例如东南亚语言的音译）。\n如果你能提供一句原句或上下文（它出现在哪儿、你想表达什么），我可以帮你确定最可能的正确词和用法。"]}
{"word":"anklung","summary":{"en":"An anklung is an Indonesian bamboo instrument played by shaking it to make a clear, resonant sound.","zh":"安克隆是印尼的竹制摇奏乐器，通过摇动发出清亮的共鸣音。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Indonesian musical instrument made of bamboo tubes, shaken to produce a resonant, bell-like tone (often played in groups).","zh":"安克隆（一种印度尼西亚传统竹制乐器），通过摇动竹管发出共鸣、类似铃声的音色（常以合奏形式演奏）。"},"examples":[{"en":"In music class, we played the anklung by shaking the bamboo frame gently.","zh":"在音乐课上，我们轻轻摇动竹架来演奏安克隆。"},{"en":"A group of students performed a folk song using anklung, each person playing a different note.","zh":"一群学生用安克隆合奏民歌，每个人负责不同的音。"}]}],"synonyms":["bamboo rattle instrument","Indonesian bamboo instrument"],"phonetic":"/ˈɑnˌklʊŋ/","extraExplanation":["“Anklung”源自印度尼西亚（尤以西爪哇 Sundanese 文化最具代表性）。它通常是“多人合作的乐器”：每把安克隆常对应一个音高，合奏时需要分工与配合。","安克隆在国际上也常被视为印尼的重要文化象征之一；在介绍东南亚音乐、世界音乐课堂或文化交流活动中很常见。"]}
{"word":"Ankney","summary":{"en":"“Ankney” is usually a surname; it can also appear as a rare U.S. place name or a variant of “Ankeny.”","zh":"“Ankney”通常是姓氏；也可能作为少见的美国地名出现，或是 “Ankeny” 的拼写变体。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname).","zh":"姓氏（人名的姓）。"},"examples":[{"en":"My teacher’s last name is Ankney.","zh":"我老师的姓是 Ankney。"},{"en":"The report was written by Dr. Ankney.","zh":"这份报告由 Ankney 博士撰写。"}]},{"partOfSpeech":"other","definition":{"en":"a place name used in the U.S. (rare; often a variant spelling of “Ankeny”).","zh":"美国的地名用法（较少见；常被视为 “Ankeny” 的拼写变体）。"},"examples":[{"en":"I saw “Ankney” on an old map, but newer maps label the area differently.","zh":"我在一张旧地图上看到 “Ankney”，但新地图对该地区的标注不一样。"}]}],"synonyms":["Ankeny (common variant spelling)"],"phonetic":"/ˈæŋkni/","extraExplanation":["“Ankney”更常见于英语语境中的姓氏；如果你是想找美国爱荷华州的城市，多数情况下正确拼写是 **Ankeny**（常被读作 /ˈæŋkəni/）。","作为专有名词（人名/地名），它通常不翻译，只做音译或直接保留英文拼写。填写表格时注意大小写：Ankney。"]}
{"word":"Ankoli","summary":{"en":"Ankoli usually refers to a South Asian medicinal tree (also spelled ankola), and it can also be a name.","zh":"Ankoli 通常指一种南亚的药用树（也写作 ankola），也可能用作人名/地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a South Asian tree (Alangium salviifolium), also called ankola, whose bark, leaves, and fruit are used in some traditional medicines.","zh":"一种南亚树木（学名 Alangium salviifolium），也叫“ankola（安科拉树）”，其树皮、叶子和果实在一些传统医药中会被使用。"},"examples":[{"en":"In some Ayurvedic traditions, ankoli is mentioned as a medicinal plant.","zh":"在一些阿育吠陀传统中，会提到 ankoli 作为一种药用植物。"},{"en":"The ankoli tree grows in parts of India and neighboring regions.","zh":"ankoli 树生长在印度及其周边一些地区。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name or place name in some cultures (proper noun use).","zh":"在某些文化中用作人名或地名（专有名词用法）。"},"examples":[{"en":"Ankoli is also used as a personal name in some communities.","zh":"在一些社群里，Ankoli 也会被用作人名。"}]}],"synonyms":["ankola","Alangium salviifolium","sage-leaved alangium"],"phonetic":"/ænˈkoʊli/","extraExplanation":["“Ankoli”在英语里并不是非常常见的标准词条，更常见的写法是“ankola”。如果你是在植物、草药或南亚文化相关的语境中看到它，通常指的就是这种树（Alangium salviifolium）。如果你提供一句原文或出处（例如文章/标签/地名），我可以帮你判断更准确的含义。"]}
{"word":"ankoli","summary":{"en":"Ankoli is a South/Southeast Asian tree name, often referring to Alangium salvifolium.","zh":"Ankoli 是一种南亚／东南亚树木名称，常指 Alangium salvifolium（安可里树／安科拉树）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small tree (Alangium salvifolium) native to South and Southeast Asia, known for its fragrant flowers and traditional medicinal uses.","zh":"（南亚与东南亚的一种小乔木）安可里树／安科拉树（学名 Alangium salvifolium），以芳香花朵与传统药用用途而闻名。"},"examples":[{"en":"In some parts of India, ankoli is planted near villages for its shade and flowers.","zh":"在印度的一些地区，人们会在村庄附近种植 ankoli，用来遮荫并欣赏花朵。"},{"en":"Traditional medicine sometimes uses parts of the ankoli tree.","zh":"传统医药有时会使用 ankoli 树的某些部分。"}]}],"synonyms":["ankola (tree)","Alangium salvifolium"],"phonetic":"/ʌnˈkoʊli/","extraExplanation":["“ankoli”更常见于南亚语境中的英语转写（transliteration），可能也会拼作“ankola / ankolah”。在不同地区，它可能指同一种植物或相近的地方俗名。","如果你是想查“ankle（脚踝）”或其他相似拼写的词，请告诉我你看到它的句子或来源，我可以帮你确认正确单词与含义。"]}
{"word":"Ankou","summary":{"en":"Ankou is a Death figure from Breton folklore, believed to collect the souls of the dead.","zh":"Ankou 是布列塔尼民间传说中的“死神/收魂者”，被认为会带走亡者的灵魂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Breton folklore) The Ankou: a personification of Death, often imagined as a skeletal figure or the last person to die in a community, who collects the souls of the dead.","zh":"（布列塔尼民间传说）Ankou（昂库）：死亡的拟人化形象，常被想象为骷髅般的形象，或是“村里最后一个死去的人”，负责收集亡者的灵魂。"},"examples":[{"en":"In Breton stories, the Ankou drives a cart to gather the dead at night.","zh":"在布列塔尼的故事里，Ankou 会在夜里驾着车去收集亡者。"},{"en":"The villagers whispered that hearing the Ankou meant someone would die soon.","zh":"村民们低声说，听见 Ankou 的声音意味着不久就会有人死去。"}]}],"synonyms":["Death","the Grim Reaper","the Angel of Death"],"phonetic":"ˈɑnˌku","extraExplanation":["“Ankou”源自法国布列塔尼（Brittany）的凯尔特文化传统，常被描写为带着镰刀、驾驶“死亡之车”的收魂者，形象类似英语文化里的“Grim Reaper（死神）”，但带有更强的地方民俗色彩。","在一些版本里，Ankou 被认为是“一个教区/村庄里最后死去的人”，他会在来年成为死亡的代理者，直到下一位“最后死者”接替。"]}
{"word":"ankou","summary":{"en":"“ankou” most commonly refers to Japanese ankō: monkfish, especially in Japanese cuisine; it can also be a romanized Japanese name/word depending on context.","zh":"“ankou” 最常见指日语 ankō：安康鱼/鮟鱇鱼（常见于日本料理）；也可能只是日语词/名字的罗马字拼写，需看语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(From Japanese) monkfish; a deep-sea fish often eaten in Japanese cuisine, especially in hot pot dishes.","zh":"（源自日语）鮟鱇鱼／安康鱼（monkfish）；一种深海鱼，常见于日本料理，尤其是火锅。"},"examples":[{"en":"In winter, some Japanese restaurants serve ankō nabe (monkfish hot pot).","zh":"冬天，一些日本餐厅会供应 ankō nabe（安康鱼火锅）。"},{"en":"Monkfish is sometimes called ankō in English menus for Japanese food.","zh":"在英文的日式菜单里，monkfish 有时会写作 ankō。"}]},{"partOfSpeech":"other","definition":{"en":"A romanized spelling of a Japanese word/name (e.g., “Ankō”); it may appear as a personal name, place name, or brand name depending on context.","zh":"日语词或名字的罗马字拼写（如 “Ankō”）；根据语境可能是人名、地名或品牌名。"},"examples":[{"en":"I saw “Ankou” on the label, but I’m not sure if it’s a brand or a person’s name.","zh":"我在标签上看到 “Ankou”，但不确定是品牌还是人名。"}]}],"synonyms":["monkfish","anglerfish"],"phonetic":"/ˈɑnkoʊ/","extraExplanation":["“ankō（あんこう）”在日语里常指“鮟鱇鱼/安康鱼（monkfish）”。日文长音常用 “ō” 表示，因此你会看到 ankō / ankou 两种拼写（后者常用于不标注长音的写法）。","如果你是在英文语境中遇到“ankou”，最常见的情况是日式餐厅菜单借用日语词；若出现在姓名/地名/作品名里，则需要更多上下文才能确定具体含义。"]}
{"word":"ankus","summary":{"en":"An ankus is a hooked tool used by a mahout to guide or control an elephant.","zh":"ankus 指驯象人用来引导或控制大象的带钩工具（象钩/象棒）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hooked tool used to guide or control an elephant; an elephant goad (often a short handle with a hook).","zh":"（驯象用的）象钩；象棒（常为短柄带钩的工具，用来引导或控制大象）。"},"examples":[{"en":"The mahout carried an ankus to guide the elephant during the parade.","zh":"驯象人带着象钩，在游行中引导大象。"},{"en":"In the museum, a bronze ankus was displayed with other South Asian artifacts.","zh":"博物馆里展出了一把青铜象钩，和其他南亚文物放在一起。"}]}],"synonyms":["elephant goad","goad","bullhook"],"phonetic":"/ˈæŋkəs/","extraExplanation":["“ankus”来自梵语 aṅkuśa（意为“钩/钩棒”），在印度与南亚地区的驯象文化中较常见。","在印度艺术与宗教图像中（如象头神伽内什 Ganesha），aṅkuśa/ankus 有时象征“引导、约束或控制欲望与障碍”的力量；但在现实语境里它主要就是驯象工具。"]}
{"word":"ankuses","summary":{"en":"“Ankuses” is the plural of “ankus/ankush,” a hooked tool used to guide elephants.","zh":"“ankuses”是“ankus/ankush”的复数，指用来引导或控制大象的带钩工具（象钩）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hooked goad (tool) used by an elephant handler to guide or control an elephant; also called an “ankush.”","zh":"（赶象人使用的）象钩、象刺棒；一种带钩的驱使工具，也叫 ankush。"},"examples":[{"en":"The mahout carried an ankuses to guide the elephant during the ceremony.","zh":"赶象人在仪式上拿着象钩来引导大象。"},{"en":"In the museum, an ankuses was displayed beside other traditional animal-handling tools.","zh":"在博物馆里，象钩和其他传统驯兽工具一起展出。"}]}],"synonyms":["ankush","elephant goad","goad"],"phonetic":"/ˈʌŋkəs/","extraExplanation":["“ankuses”通常是名词复数形式，更常见的单数拼写是“ankus”，也常写作“ankush”。","词源多被认为来自梵语 aṅkuśa（意为“钩、刺棒”），在南亚文化中与赶象人（mahout）相关。","在部分印度教与佛教艺术里，神祇手持“ankush”可作为“约束、引导心念/欲望”的象征性意象。"]}
{"word":"ankush","summary":{"en":"An ankush is a hooked elephant goad used by a mahout to guide or control an elephant.","zh":"ankush 指驯象人用来引导或控制大象的带钩工具（象钩）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hooked tool (elephant goad) used by a mahout to guide or control an elephant; also spelled ankus.","zh":"（驯象人使用的）象钩；一种带钩的工具，用来引导或控制大象；也可拼作 ankus。"},"examples":[{"en":"The mahout carried an ankush to guide the elephant during the festival.","zh":"驯象人在节庆游行中带着象钩来引导大象。"},{"en":"The museum displayed an ankush alongside other traditional animal-handling tools.","zh":"博物馆把象钩与其他传统的动物管理工具一起展出。"}]}],"synonyms":["ankus","elephant goad","goad"],"phonetic":"/ˈæŋ.kʊʃ/","extraExplanation":["“ankush”来自梵语 aṅkuśa，历史上常见于南亚、东南亚与相关文化语境，特指驯象工具。","在现代语境中，这个词有时会出现在动物伦理与保护讨论里，因为它涉及对大象的控制方式。表达时可根据场景选择更中性的说法（如“elephant goad”）或说明其文化背景。"]}
{"word":"ankusha","summary":{"en":"Ankusha means an elephant goad (a hooked tool) used to guide an elephant; it can also be a symbolic ritual object in South Asian traditions.","zh":"Ankusha 指“象钩／象刺棒”，用于引导大象；在南亚部分传统中也可作为象征性仪式物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hooked tool (an elephant goad) used by a mahout to guide or control an elephant; also used as a ritual symbol in some South Asian traditions","zh":"（驯象人使用的）象钩／象刺棒：一种带钩的工具，用来引导或控制大象；在部分南亚宗教传统中也作为仪式象征物"},"examples":[{"en":"The mahout held an ankusha to guide the elephant during the parade.","zh":"驯象人拿着象钩，在游行时引导大象。"},{"en":"In some temples, the deity is shown holding an ankusha as a symbol of control and guidance.","zh":"在一些寺庙艺术中，神祇手持象钩，象征自我控制与引导。"}]}],"synonyms":["ankush","elephant goad","goad","hook"],"phonetic":"/ʌŋˈkuːʃə/","extraExplanation":["“Ankusha”（也常拼作“ankush”）源自梵语 aṅkuśa，字面与“钩、钩形工具”相关。它最常见的语境是印度等地的驯象文化（mahout 驯象人）。","在宗教与艺术语境中（例如某些印度教图像），象钩常被当作“约束、驯服、引导心念”的象征；这是一种象征意义的延伸，并不等同于日常工具用途。"]}
{"word":"ankushes","summary":{"en":"“Ankushes” means more than one ankush—hooked tools used to guide elephants.","zh":"“ankushes”指多个“ankush”（象钩/象鞭），用于引导大象的带钩工具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of ankush: a hooked tool (a type of goad) used by a mahout to guide an elephant.","zh":"ankush 的复数：一种带钩的工具（象钩/象鞭的一种），由驯象师（mahout）用来引导大象。"},"examples":[{"en":"The mahout carried ankushes and a rope to direct the elephants safely.","zh":"驯象师带着几把象钩和一根绳子，以便安全地引导大象。"},{"en":"In the museum case, you can see old ankushes used in South Asia.","zh":"在博物馆的展柜里，你可以看到南亚曾使用过的古老象钩。"}]}],"synonyms":["elephant goads","goads","hooks"],"phonetic":"/ˈæŋkʊʃɪz/","extraExplanation":["“ankush”常见于与印度及南亚文化相关的语境，指传统的驯象工具。现代语境中也可能出现在关于动物福利与训练方式的讨论里；使用该词时，语气通常偏描述性，但话题可能涉及伦理争议。"]}
{"word":"ankylenteron","summary":{"en":"Ankylenteron is the name of an extinct armored dinosaur genus (an ankylosaur) from Late Cretaceous Mongolia.","zh":"Ankylenteron 是一种已灭绝的装甲恐龙属（甲龙类），化石来自蒙古的晚白垩世。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An extinct genus of armored dinosaur (an ankylosaur) known from the Late Cretaceous of Mongolia.","zh":"甲龙类（装甲恐龙）的一属，已灭绝，化石发现于蒙古的晚白垩世地层。"},"examples":[{"en":"Ankylenteron was an ankylosaur, a group famous for heavy body armor and a low, sturdy build.","zh":"Ankylenteron 属于甲龙类，这一类恐龙以厚重的骨甲和低矮结实的体型闻名。"},{"en":"Fossils of Ankylenteron have been reported from Late Cretaceous deposits in Mongolia.","zh":"有研究报道在蒙古的晚白垩世地层中发现过 Ankylenteron 的化石。"}]}],"synonyms":["ankylosaur","armored dinosaur"],"phonetic":"/ˌæŋkɪˈlɛntəˌrɑn/","extraExplanation":["这是一个古生物学专有名词，常见于科普或学术语境；在一般英语写作中并不常用。","词形里的 ankyl- 源自希腊语，常见于表示“弯曲/融合/僵硬”的科学词汇（如 ankylosis“关节强直”）；-enteron 与“肠道”有关，因此该属名通常被解释为与“（肠道）融合/僵硬”相关的命名意象。","恐龙属名在英文中通常首字母大写（Ankylenteron），斜体多用于学术排版；口语中常直接说 it’s an ankylosaur（它是一种甲龙）。"]}
{"word":"ankyloblepharon","summary":{"en":"Ankyloblepharon is a rare medical condition where the eyelids are fused together.","zh":"Ankyloblepharon 指一种罕见的医学情况：上下眼睑发生粘连。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare condition (usually present at birth) in which the upper and lower eyelids are partially or completely joined together at the edges.","zh":"一种罕见的情况（多为先天性），指上、下眼睑在睑缘处部分或完全粘连在一起。"},"examples":[{"en":"The newborn was diagnosed with ankyloblepharon after the doctor noticed the eyelids were fused.","zh":"医生发现婴儿的眼睑粘连后，诊断为 ankyloblepharon（眼睑粘连）。"},{"en":"Surgery may be recommended if ankyloblepharon affects the baby’s ability to open the eyes normally.","zh":"如果 ankyloblepharon 影响婴儿正常睁眼，医生可能会建议手术治疗。"}]}],"synonyms":["eyelid fusion","fused eyelids"],"phonetic":"/ˌæŋkɪloʊˈblɛfərɑn/","extraExplanation":["词源提示：ankylo- 表示“粘连、僵硬”，-blepharon 表示“眼睑”，合起来就是“眼睑粘连”。","这是医学术语，日常英语中很少使用；通常出现在儿科、眼科或遗传相关的临床记录与研究中。","部分病例会与遗传综合征相关，是否需要治疗取决于粘连程度以及是否影响视力发育；具体应由专业医生评估。"]}
{"word":"ankylocheilia","summary":{"en":"Ankylocheilia is a rare medical term for a congenital fusion/adhesion of the lips.","zh":"ankylocheilia 是较少见的医学术语，指先天性嘴唇粘连/融合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A congenital (present-from-birth) condition in which the lips are abnormally fused or joined together (partly or completely), often limiting mouth opening.","zh":"（医学）先天性唇粘连：上下唇异常粘连（部分或完全粘在一起）的情况，常导致张口受限。"},"examples":[{"en":"The newborn was diagnosed with ankylocheilia after doctors noticed the lips were partially fused.","zh":"医生发现婴儿的嘴唇部分粘连后，诊断为先天性唇粘连（ankylocheilia）。"},{"en":"Surgery may be considered if ankylocheilia interferes with feeding or breathing.","zh":"如果先天性唇粘连影响喂养或呼吸，可能会考虑手术治疗。"}]}],"synonyms":["congenital lip adhesion","fused lips","labial synechiae"],"phonetic":"/ˌæŋ.kɪ.loʊˈkaɪ.li.ə/","extraExplanation":["词源：ankyl(o)- 表示“僵硬、粘连（fused）”，-cheilia 来自希腊语 cheilos “嘴唇”。整体字面意思可理解为“嘴唇的粘连/僵硬性融合”。","这是较少见、偏专业的医学词，常见于口腔颌面外科、儿科或先天畸形相关文献中。日常英语里更常用描述性说法，如 “fused lips” 或 “lip adhesion”。"]}
{"word":"ankylodactylia","summary":{"en":"Ankylodactylia is a medical term for stiff, bent fingers or toes that are hard to straighten.","zh":"ankylodactylia 是医学用语，指手指或脚趾弯曲僵硬、不易伸直的情况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical condition in which one or more fingers or toes are bent and stiff (often due to a joint problem), making them difficult to straighten.","zh":"（医学）指一根或多根手指/脚趾弯曲并僵硬（常与关节问题有关），不易伸直的病症。"},"examples":[{"en":"The doctor noted ankylodactylia in the patient’s right hand during the physical exam.","zh":"医生在体检时发现患者右手存在指趾强直弯曲（ankylodactylia）。"},{"en":"In severe cases of ankylodactylia, surgery may be considered to improve finger movement.","zh":"在严重的ankylodactylia病例中，可能会考虑手术来改善手指活动。"}]}],"synonyms":["digital ankylosis","finger/toe contracture","stiff fingers","stiff toes"],"phonetic":"/ˌæŋkɪloʊdækˈtɪliə/","extraExplanation":["这是一个较少见、偏专业的医学词汇，多用于医学文献或病历记录，日常英语中更常见的描述是“stiff/bent fingers or toes（手指/脚趾僵硬弯曲）”。","词源可拆解理解：ankyl- 表示“强直、关节僵硬”（与 ankylosis 同源），-dactylia 与“手指/脚趾”有关（dactyl = finger/toe）。因此字面意思接近“手指/脚趾的强直”。"]}
{"word":"ankylodontia","summary":{"en":"Ankylodontia is the condition of a tooth being fused to the jawbone, preventing normal movement or eruption.","zh":"Ankylodontia 指牙齿与颌骨骨性粘连，导致牙齿无法正常移动或萌出。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a dental condition in which a tooth becomes fused to the jawbone (ankylosed), so it cannot move or erupt normally","zh":"（牙科）牙齿与牙槽骨发生骨性粘连/融合（牙齿骨性强直），导致牙齿不能正常萌出或移动"},"examples":[{"en":"The dentist suspected ankylodontia because the baby tooth never loosened and sat lower than the others.","zh":"牙医怀疑是 ankylodontia，因为那颗乳牙一直不松动，而且位置比其他牙更低。"},{"en":"Ankylodontia can make orthodontic treatment harder since the tooth doesn’t respond well to braces.","zh":"ankylodontia 会让正畸更困难，因为牙齿对牙套的牵引反应不佳。"}]}],"synonyms":["dental ankylosis","ankylosed tooth","tooth ankylosis"],"phonetic":"/ˌæŋkɪloʊˈdɑnʃə/","extraExplanation":["这个词多用于医学/牙科语境，日常英语中很少见。更常见的表达是：an ankylosed tooth（骨性粘连的牙齿）或 dental ankylosis（牙齿骨性强直/粘连）。","词根提示：ankylo- 表示“僵硬、粘连”，-dont- 表示“牙”，-ia 表示“疾病/状态”。","在儿童中常见的相关现象是“埋伏、下沉的乳牙（infraocclusion）”，因为粘连的乳牙无法随着颌骨生长而“跟着长高”。"]}
{"word":"ankyloglossia","summary":{"en":"Ankyloglossia is “tongue-tie,” a short/tight tissue under the tongue that restricts tongue movement.","zh":"Ankyloglossia 指“舌系带过短/过紧（tongue-tie）”，会限制舌头活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a condition present at birth where the tissue under the tongue (the lingual frenulum) is unusually short or tight, limiting tongue movement; also called “tongue-tie.”","zh":"先天性舌系带过短/过紧，导致舌头活动受限；也称“tongue-tie（舌系带短/舌短系带）”。"},"examples":[{"en":"The pediatrician diagnosed the baby with ankyloglossia after noticing feeding difficulties.","zh":"儿科医生在发现宝宝喂养困难后，诊断其为舌系带过短（ankyloglossia）。"},{"en":"In some cases, ankyloglossia can affect speech sounds that require tongue-tip movement.","zh":"在某些情况下，舌系带过短可能影响需要舌尖活动的发音。"}]}],"synonyms":["tongue-tie"],"phonetic":"/ˌæŋkɪloʊˈɡlɑːsiə/","extraExplanation":["这是医学术语，日常交流中更常说 tongue-tie（“舌系带短”）。","是否需要处理（如剪舌系带/系带松解）通常取决于功能影响，例如哺乳含接困难、疼痛或明显的发音问题；具体应由专业医生评估。","词源：ankylo- 表示“黏连、僵硬”，-glossia 与“舌头”有关。"]}
{"word":"ankylomele","summary":{"en":"Ankylomele is a rare medical term for congenital limb fusion or stiffness caused by abnormal joining of bones/joints.","zh":"Ankylomele 是一个罕见医学术语，指因骨骼/关节异常连接导致的先天性肢体融合或僵硬。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical, rare) A congenital condition in which a limb (or limbs) is fused or stiffened, often due to abnormal joining of bones or joints; limb fusion.","zh":"（医学，较少见）一种先天性情况：肢体（一个或多个）发生融合或僵硬，常与骨骼或关节异常连接有关；肢体融合。"},"examples":[{"en":"The veterinarian noted ankylomele in the newborn calf, with the hind legs partially fused.","zh":"兽医发现这只新生小牛有肢体融合（ankylomele），后腿部分融合在一起。"},{"en":"In a case report, ankylomele was described alongside other congenital skeletal abnormalities.","zh":"在一份病例报告中，ankylomele 与其他先天性骨骼异常一起被描述。"}]}],"synonyms":["limb fusion","ankylosis (related)","synostosis (related)"],"phonetic":"/ˌæŋkɪloʊˈmiːl/","extraExplanation":["词源提示：ankylo- 来自希腊语，表示“弯曲、僵硬、关节强直”；-mele 来自希腊语 melos，表示“肢体”。合起来常用于形容“肢体因异常连接而融合/僵硬”的情况。","使用场景：这是非常少见的专业词，多见于医学或兽医学的病例报告与先天畸形描述中；日常英语一般不会用。"]}
{"word":"ankylomerism","summary":{"en":"Ankylomerism is a rare medical word meaning joint or body-part stiffness/fusion, similar to ankylosis.","zh":"Ankylomerism 是较罕见的医学词，指关节或身体部位僵硬/融合，含义近似 ankylosis（关节强直）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) Abnormal stiffness or fusion of body parts—especially a joint—so that movement becomes limited or impossible; a rare term close in meaning to ankylosis.","zh":"（医学）身体部位（尤指关节）异常僵硬或融合，导致活动受限或无法活动；较少使用的术语，含义接近“关节强直（ankylosis）”。"},"examples":[{"en":"After the infection, the patient developed ankylomerism of the elbow, making it hard to bend the arm.","zh":"感染后，患者出现肘关节的关节融合（ankylomerism），手臂很难弯曲。"},{"en":"The report mentioned ankylomerism, but modern texts usually use the word “ankylosis.”","zh":"报告中提到 ankylomerism，但现代资料通常用“ankylosis（关节强直）”。"}]}],"synonyms":["ankylosis","joint fusion","stiffness"],"phonetic":"/ˌæŋkɪˈlɑmərˌɪzəm/","extraExplanation":["这个词非常少见，多出现在较旧或非常专业的医学写作中。临床与教材里更常用的是 ankylosis（关节强直/关节融合）。","词源上可拆解理解：ankylo- 表“僵硬、弯曲”（源自希腊语 ankylos），-mer- 与 “部分/肢体（part）”相关，-ism 表“状态/情况”。整体强调“某个部位变得僵硬/融合的状态”。"]}
{"word":"ankylophobia","summary":{"en":"Ankylophobia means an extreme fear of joints becoming stiff or fused and losing mobility.","zh":"Ankylophobia 指对关节僵硬、粘连/强直并失去活动能力的极度恐惧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An intense fear of joints becoming stiff, fused, or unable to move normally (sometimes linked to fears about conditions like ankylosis).","zh":"对关节僵硬、粘连或无法正常活动的强烈恐惧（有时与对“关节强直/骨性强直”等疾病的担忧相关）。"},"examples":[{"en":"After his knee injury, he developed ankylophobia and worried that his leg would become permanently stiff.","zh":"膝盖受伤后，他出现了ankylophobia，担心腿会永久僵硬。"},{"en":"Her therapist explained that ankylophobia is a specific phobia and can be treated with gradual exposure and coping skills.","zh":"治疗师解释说，ankylophobia 属于特定恐惧症，可以通过循序渐进的暴露练习和应对技巧来改善。"}]}],"synonyms":["fear of joint stiffness","specific phobia (joints/immobility)","pathological fear of ankylosis"],"phonetic":"/ˌæŋ.kɪ.loʊˈfoʊ.bi.ə/","extraExplanation":["词源拆解：ankylo- 来自希腊语，含义与“弯曲、粘连、僵硬（如关节强直）”相关；-phobia 表示“恐惧”。合起来就是“对关节僵硬/强直的恐惧”。","使用场景：这是相对少见、偏医学/心理学语境的词。日常表达中更常说：fear of joint stiffness（害怕关节僵硬）或 fear of becoming immobile（害怕变得行动不便）。","学习提示：不要把它与 arthrophobia（对关节的恐惧）或 kinesiophobia（对运动/动作的恐惧）混淆；ankylophobia 更强调“僵硬、粘连、强直”这一结果。"]}
{"word":"ankylopodia","summary":{"en":"Ankylopodia is a medical term for stiffness or fusion of the joints in the feet.","zh":"ankylopodia 是指足部关节僵硬或融合（足部强直）的医学术语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) Stiffness or fusion of the joints of the feet (ankylosis of the feet), which can limit movement.","zh":"（医学）足部关节的僵硬或融合（足部强直），会限制活动。"},"examples":[{"en":"The doctor noted signs of ankylopodia that reduced the child’s ability to flex the feet.","zh":"医生注意到足部强直的迹象，这使孩子难以弯曲脚部。"},{"en":"In severe cases of ankylopodia, walking may require supportive braces or surgery.","zh":"在严重的足部强直病例中，行走可能需要支具支持或手术治疗。"}]}],"synonyms":["ankylosis of the foot","foot ankylosis"],"phonetic":"/ˌæŋkɪloʊˈpoʊdiə/","extraExplanation":["这是一个较少见的医学术语，常用于描述“足部关节强直/融合”的情况，多见于先天性问题或某些疾病、外伤后关节活动度明显下降。","词源上可拆为 ankyl-（僵硬、强直）+ -pod-（脚、足）+ -ia（状态/疾病），帮助记忆其含义。"]}
{"word":"ankylopoietic","summary":{"en":"Ankylopoietic means “causing or related to the formation of joint stiffness or fusion (ankylosis).”","zh":"ankylopoietic 指“导致或与关节强直/关节融合（ankylosis）形成有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine) causing or relating to the formation of ankylosis (abnormal stiffness or fusion of a joint).","zh":"（医学）引起或与“关节强直/关节融合”（关节异常僵硬或骨性融合）的形成有关的。"},"examples":[{"en":"The doctor described the condition as an ankylopoietic process that could gradually limit joint movement.","zh":"医生将这种情况描述为一种“致关节强直”的过程，可能会逐渐限制关节活动。"},{"en":"Some inflammatory diseases can lead to ankylopoietic changes in the spine.","zh":"一些炎症性疾病会导致脊柱出现致关节强直的改变。"}]}],"synonyms":["ankylosing","ankylotic","fusion-forming"],"phonetic":"/ˌæŋkɪloʊpɔɪˈɛtɪk/","extraExplanation":["词源提示：ankylo- 来自希腊语，意为“弯曲、僵硬”；-poietic 来自 -poiesis，意为“制造、形成”。合起来就是“促成（关节）僵硬/融合的”。","这是非常少见的医学形容词，写作或病理报告中偶尔出现；临床交流里更常见的说法是 ankylosing（如 ankylosing spondylitis：强直性脊柱炎）或 “leading to ankylosis”（导致关节强直）。"]}
{"word":"ankyloproctia","summary":{"en":"A rare medical term meaning abnormal stiffening/fixation of the anus or rectum, often linked to difficulty passing stool.","zh":"罕见医学术语：指肛门或直肠异常僵硬/固定（强直），常与排便困难相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical, rare) Abnormal stiffening or fixation (ankylosis) of the anus and/or rectum, which can narrow the passage and make bowel movements difficult.","zh":"（医学，罕见）肛门和/或直肠出现异常“僵硬、固定”（强直/关节样粘连），可能导致腔道变窄，从而排便困难。"},"examples":[{"en":"The surgeon noted signs of ankyloproctia that were contributing to the patient’s chronic constipation.","zh":"外科医生注意到有肛直肠强直（ankyloproctia）的迹象，这可能是患者长期便秘的原因之一。"},{"en":"Because ankyloproctia is rare, the diagnosis usually requires specialist evaluation.","zh":"由于肛直肠强直较罕见，通常需要专科评估才能确诊。"}]}],"synonyms":["(rare) proctic ankylosis","anal/rectal stricture (related, not exact)"],"phonetic":"/ˌæŋkɪloʊˈprɑːkʃiə/","extraExplanation":["词源可拆解为 ankyl(o)-（“强直、僵硬、固定”，常见于 ankylosis“强直/关节强直”）+ proct-（“肛门/直肠”，如 proctology“肛肠学”）+ -ia（表示“疾病/状态”）。","这是非常少见、偏专业的医学术语；日常英语里更常见的表达会围绕“rectal/anal stricture（直肠/肛门狭窄）”“adhesions（粘连）”“obstruction（梗阻）”“constipation（便秘）”等具体问题来描述。"]}
{"word":"ankylorrhinia","summary":{"en":"Ankylorrhinia is a rare condition where the nostrils/nasal openings are abnormally fused or closed (often from birth).","zh":"Ankylorrhinia 指一种罕见状况：鼻孔/鼻部开口异常黏连、融合或闭锁（常见于先天）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare (usually congenital) condition in which the nostrils or nasal openings are abnormally fused, stuck together, or closed due to tissue adhesion.","zh":"（罕见，常为先天性）鼻孔或鼻部开口因组织黏连而异常粘合、狭窄或闭锁的状况。"},"examples":[{"en":"The newborn had breathing difficulty, and the doctor suspected ankylorrhinia.","zh":"新生儿出现呼吸困难，医生怀疑是鼻孔黏连/闭锁（ankylorrhinia）。"},{"en":"Ankylorrhinia may require surgical correction to open the nasal passage.","zh":"ankylorrhinia 可能需要手术矫正以打开鼻腔通道。"}]}],"synonyms":["nasal atresia","nostril fusion"],"phonetic":"/ˌæŋkɪloʊˈrɪniə/","extraExplanation":["词源提示：ankyl(o)- 来自希腊语，表示“黏连、僵硬、融合”；-rrhinia 与“鼻（rhino-）”相关。整体字面意思接近“鼻部黏连/融合”。","这是非常少见的医学术语；在临床讨论里，更常见的相关表述可能会用“nasal atresia（鼻闭锁）”或更具体的解剖诊断名称。"]}
{"word":"ankylos","summary":{"en":"ankylos- is a root meaning stiff/crooked/fused, common in medical terms about joints and in names like Ankylosaurus.","zh":"ankylos- 是表示“僵硬/弯曲/融合”的词根，常见于关节相关的医学术语，也见于如 Ankylosaurus 等名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a word root/combining form meaning “stiff,” “crooked,” or “fused,” used especially in medical terms (about joints) and in some scientific names","zh":"词根/构词成分，表示“僵硬的 / 弯曲的 / 融合的（多指关节）”，常见于医学术语，也出现在一些科学名称中"},"examples":[{"en":"Ankylosis is a condition where a joint becomes stiff or fused.","zh":"ankylosis（关节强直）是一种关节变得僵硬或融合的情况。"},{"en":"The name Ankylosaurus comes from ankylos-, referring to stiff or fused bones.","zh":"恐龙名 Ankylosaurus（甲龙）的词源里有 ankylos-，指“僵硬或融合的骨骼”。"}]}],"synonyms":["(related roots) arthr- (joint)","(related idea) rigid- (stiff)"],"phonetic":"æŋˈkaɪloʊs","extraExplanation":["ankylos- 源自希腊语 ankýlos（意为“弯曲的、钩状的”），在医学里常延伸为“关节僵硬、粘连或骨性融合”的概念。","常见相关词：ankylosis（关节强直）、ankylosing spondylitis（强直性脊柱炎）、ankylosed（发生强直的/融合的）。"]}
{"word":"ankylosaur","summary":{"en":"An ankylosaur is an armored, plant-eating dinosaur, often with a clubbed tail for defense.","zh":"ankylosaur 指有装甲的食草恐龙（甲龙类），常见特征是厚重骨板，许多还有尾锤用于防御。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of plant-eating dinosaur known for having heavy bony armor on its body; many ankylosaurs also had a club-like tail used for defense.","zh":"一种食草恐龙，以全身厚重的骨质装甲著称；许多甲龙类还拥有棒状尾锤，用来防御。"},"examples":[{"en":"The ankylosaur protected itself with bony plates like a suit of armor.","zh":"甲龙用骨板保护自己，就像穿了一套盔甲。"},{"en":"In the museum, we saw an ankylosaur skeleton with a powerful tail club.","zh":"在博物馆里，我们看到了一具带有强大尾锤的甲龙骨架。"},{"en":"Unlike fast predators, an ankylosaur relied on defense rather than speed.","zh":"不同于行动迅速的捕食者，甲龙更依靠防御而不是速度。"}]}],"synonyms":["armored dinosaur","ankylosaurus"],"phonetic":"/ˈæŋkəloʊˌsɔr/","extraExplanation":["“ankylosaur”来自希腊语词根：ankylo-（弯曲、融合）+ -saur（蜥蜴/恐龙），可理解为“关节融合的蜥蜴”，指它们身体骨板与骨骼结构的坚固与融合感。","日常英语里，人们常把最著名的属名“Ankylosaurus（甲龙属）”泛称为“ankylosaur（甲龙类）”。前者是具体一种，后者更像“这一类恐龙”的统称。"]}
{"word":"Ankylosaurus","summary":{"en":"Ankylosaurus is an armored, plant-eating dinosaur known for its tail club.","zh":"甲龙是一种装甲型食草恐龙，以尾部骨槌闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a heavily armored plant-eating dinosaur with bony plates on its back and a large club at the end of its tail, used for defense","zh":"甲龙：一种全身披覆骨质甲板的食草恐龙，尾巴末端有大型骨槌，用于防御"},"examples":[{"en":"Ankylosaurus used its tail club to protect itself from predators.","zh":"甲龙会用尾部的骨槌来保护自己免受捕食者攻击。"},{"en":"In many museums, you can see an Ankylosaurus skeleton with its armor plates.","zh":"在很多博物馆里，你可以看到带有甲板的甲龙骨架。"},{"en":"My favorite dinosaur is Ankylosaurus because it looks like a living tank.","zh":"我最喜欢的恐龙是甲龙，因为它看起来像一辆活的坦克。"}]}],"synonyms":["armored dinosaur","ankylosaur"],"phonetic":"/ˌæŋkɪloʊˈsɔrəs/","extraExplanation":["“Ankylosaurus”来自希腊语：ankylos（弯曲/僵硬、融合）+ sauros（蜥蜴）。名字强调它的骨骼（尤其是背部与骨甲）融合得很“坚固”。","甲龙生活在白垩纪晚期的北美。它属于“甲龙类”（ankylosaurs）中非常著名的一种，常被用来代表“装甲恐龙”。","发音提示：重音通常在第三音节 -lo-（An-ky-lo-SAUR-us）。"]}
{"word":"ankylosaurus","summary":{"en":"Ankylosaurus is an armored, plant-eating dinosaur with a club tail.","zh":"Ankylosaurus（甲龙）是一种有装甲、食草、尾巴像棍棒的恐龙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large plant-eating dinosaur with heavy body armor and a club-like tail, living in the late Cretaceous period","zh":"一种大型食草恐龙，身体覆盖厚重的骨质装甲，尾巴末端像棍棒一样，生活在白垩纪晚期"},"examples":[{"en":"The ankylosaurus used its armored plates to protect itself from predators.","zh":"甲龙用身上的装甲骨板来保护自己免受掠食者攻击。"},{"en":"In many dinosaur books, ankylosaurus is shown swinging its tail club.","zh":"在很多恐龙书里，甲龙常被画成挥动它的尾棒。"}]}],"synonyms":["armored dinosaur","ankylosaur"],"phonetic":"/ˌæŋkɪləˈsɔrəs/","extraExplanation":["“Ankylosaurus”来自希腊语：ankylos（意为“弯曲的、融合的”）+ sauros（“蜥蜴”）。名字强调它某些骨骼（尤其是背部装甲与骨骼结构）呈现融合、坚固的特征。","常见拼写是首字母大写“Ankylosaurus”，因为它是一个属名（genus）。日常非正式讨论中也有人用小写，但在科普/学术写作里通常大写。","它并不是“恐龙里最会打架的”这种绝对说法，但尾部骨棒确实可能用于防御；很多影视与绘本会强化这一形象。"]}
{"word":"ankylose","summary":{"en":"“Ankylose” is a medical verb meaning to cause a joint to become stiff and immovable (or to become stiff) due to abnormal fusion.","zh":"“ankylose”是医学动词，指（使）关节因异常骨性融合而变得僵硬、无法活动，即（导致/发生）关节强直。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Medicine) to make a joint stiff and immovable by abnormal fusion of the bones; to cause ankylosis.","zh":"（医学）使关节因异常骨性融合而变得僵硬、无法活动；导致“关节强直”。"},"examples":[{"en":"Severe inflammation can ankylose the joint over time.","zh":"严重的炎症可能会随着时间推移导致关节强直。"},{"en":"The injury may eventually ankylose her ankle if not treated properly.","zh":"如果治疗不当，这次受伤最终可能会使她的踝关节强直。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Medicine) to become stiff and immovable because the bones in a joint fuse; to develop ankylosis.","zh":"（医学）因关节骨性融合而变得僵硬、失去活动度；发生关节强直。"},"examples":[{"en":"In advanced disease, the vertebrae can ankylose and limit movement.","zh":"在疾病晚期，椎骨可能会发生强直，从而限制活动。"}]}],"synonyms":["fuse","stiffen","immobilize"],"phonetic":"/æŋkəˈloʊz/","extraExplanation":["“ankylose”是较少见的医学动词，更常见的名词是 **ankylosis（关节强直）**，形容词是 **ankylosed（已强直的）**。","词源来自希腊语 *ankylos*（弯曲的、僵硬的）/ *ankyloun*（使变硬、使固定）。在日常英语中很少用，多见于医学论文、影像学报告或病历记录。"]}
{"word":"ankylosed","summary":{"en":"Ankylosed means a joint has become stiff or fused so it can’t move normally.","zh":"ankylosed 指关节变得僵硬或融合，导致无法正常活动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Stiff or fused, especially because a joint has become fixed and cannot move normally.","zh":"（医学）僵硬的；（尤指）关节强直/融合的，因关节固定而无法正常活动。"},"examples":[{"en":"The X-ray showed an ankylosed hip joint, which explained the patient’s limited movement.","zh":"X光显示髋关节强直，这解释了病人活动受限。"},{"en":"After years of inflammation, the vertebrae can become ankylosed and cause severe stiffness.","zh":"经过多年的炎症，椎骨可能会发生强直，导致严重僵硬。"}]}],"synonyms":["stiff","fused","immobile","rigid"],"phonetic":"/ˌæŋkəˈloʊzd/","extraExplanation":["词源提示：ankylosed 来自希腊语 ankylos，意思是“弯曲的、僵硬的”。医学里常见名词是 ankylosis（关节强直），动词是 ankylose（使关节强直/融合）。","使用场景：这是偏医学/解剖学用词，多见于病历、影像报告或科普文章；日常口语里更常说 stiff（僵硬的）或 fused（融合的）。","相关疾病背景：在如“强直性脊柱炎”（ankylosing spondylitis）等疾病中，炎症可能导致骨与关节逐渐融合，出现 ankylosed 的状态。"]}
{"word":"ankyloses","summary":{"en":"“Ankyloses” usually refers to multiple cases of joint stiffening/fusion (plural of ankylosis); it can also be the verb form meaning “causes/becomes stiff.”","zh":"“Ankyloses”通常指多处关节强直/融合（ankylosis 的复数）；也可作动词形式，表示“使变僵硬/发生强直”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of ankylosis) a condition in which a joint becomes stiff or immobile, often because the bones fuse together or scar tissue forms.","zh":"（ankylosis 的复数）关节强直：关节变得僵硬或不能活动的状态，常因骨性融合或瘢痕组织形成所致。"},"examples":[{"en":"X-rays showed ankyloses in several spinal joints.","zh":"X 光显示脊柱的几个关节出现了关节强直。"},{"en":"The doctor explained that long-term inflammation can lead to ankyloses.","zh":"医生解释说，长期炎症可能导致关节强直。"}]},{"partOfSpeech":"v.","definition":{"en":"(third-person singular of ankylose) to make a joint stiff or immobile, or to become stiff/immobile.","zh":"（ankylose 的第三人称单数）使关节强直；（关节）变得强直、僵硬或失去活动度。"},"examples":[{"en":"In severe cases, the disease ankyloses the vertebrae over time.","zh":"在严重情况下，这种疾病会随着时间推移使椎骨逐渐强直。"},{"en":"After repeated injury, the joint sometimes ankyloses.","zh":"反复受伤后，这个关节有时会发生强直。"}]}],"synonyms":["joint fusion","stiffening","immobility"],"phonetic":"/ˌæŋkəˈloʊsiz/","extraExplanation":["这是一个医学/解剖学用词，日常英语里不常见，更多出现在影像学报告、骨科或风湿免疫科的病历中。","词源来自希腊语 *ankylos*（弯曲的、僵硬的）+ *-osis*（疾病/状态）。","相关常见病名：*ankylosing spondylitis*（强直性脊柱炎）。在阅读医学材料时，注意 *ankylosis*（名词，状态）与 *ankylose*（动词，发生/导致强直）的区别。"]}
{"word":"ankylosing","summary":{"en":"Ankylosing means “causing joints (especially the spine) to become stiff or fused,” most commonly in the phrase ankylosing spondylitis.","zh":"ankylosing 指“导致关节（尤其脊柱）变得僵硬或融合的（强直性的）”，最常见于短语 ankylosing spondylitis（强直性脊柱炎）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) causing ankylosis—making a joint stiff or fused, often due to inflammation.","zh":"（医学）导致强直（关节僵硬或融合）的，常由炎症引起。"},"examples":[{"en":"Ankylosing inflammation can limit how much you can bend your spine.","zh":"强直性炎症会限制你弯曲脊柱的幅度。"},{"en":"The doctor explained that ankylosing changes may reduce joint movement over time.","zh":"医生解释说，强直性改变可能会随着时间推移减少关节活动度。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used in the name of a specific disease: ankylosing spondylitis (a long-term inflammatory condition that can stiffen the spine).","zh":"用于一种特定疾病名称中：强直性脊柱炎（可导致脊柱逐渐僵硬的慢性炎症性疾病）。"},"examples":[{"en":"He was diagnosed with ankylosing spondylitis after years of back pain.","zh":"多年背痛后，他被诊断为强直性脊柱炎。"},{"en":"Exercise and physical therapy can help many people with ankylosing spondylitis.","zh":"运动和物理治疗能帮助许多强直性脊柱炎患者。"}]}],"synonyms":["stiffening","fusing"],"phonetic":"/ˌæŋkɪˈloʊsɪŋ/","extraExplanation":["“ankylosing”来自“ankylosis（强直、关节融合）”。在日常英语里它几乎只出现在医学语境，最常见搭配就是“ankylosing spondylitis”。","发音重音通常在“-lo-”音节上；阅读医学资料时，你也可能看到相关词：ankylosis（名词，强直）、ankylosed（形容词，已强直的）。"]}
{"word":"ankylosis","summary":{"en":"Ankylosis is joint stiffness with reduced movement, often caused by disease or injury.","zh":"Ankylosis 指关节僵硬、活动度下降的状态，常由疾病或损伤引起。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Abnormal stiffness and loss of movement in a joint because the bones become fused or the joint becomes fixed (often after injury, inflammation, or disease).","zh":"关节强直；关节僵硬并活动受限，常因炎症、损伤或疾病导致关节固定或骨性融合。"},"examples":[{"en":"After the infection, the doctor warned about possible ankylosis in his knee.","zh":"感染之后，医生提醒他的膝关节可能出现关节强直。"},{"en":"Physical therapy may help reduce stiffness and delay ankylosis.","zh":"物理治疗可能有助于减轻僵硬并延缓关节强直。"}]}],"synonyms":["joint stiffness","joint fusion"],"phonetic":"/ˌæŋkəˈloʊsɪs/","extraExplanation":["词源：来自希腊语 ankylos（弯曲、僵硬）+ -osis（病变/状态），字面含义与“变得僵硬、难以弯曲”有关。","医学语境中常见搭配：ankylosis of the joint（关节强直）；bony ankylosis（骨性强直，真正骨融合）；fibrous ankylosis（纤维性强直，更多是结缔组织导致的固定）。"]}
{"word":"ankylostoma","summary":{"en":"Ankylostoma is a genus of hookworms—parasitic worms that can infect the intestines and cause illness such as anemia.","zh":"Ankylostoma 指钩口线虫属，是一种钩虫类寄生虫，可感染肠道并引发贫血等疾病。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of parasitic hookworms that live in the small intestine of humans and other animals; some species can cause hookworm disease (anemia, weakness, stomach discomfort).","zh":"钩口线虫属（寄生性钩虫的一类），寄生在人体或动物的小肠内；部分物种可引起钩虫病（如贫血、乏力、腹部不适等）。"},"examples":[{"en":"In tropical regions, Ankylostoma infections may lead to iron-deficiency anemia.","zh":"在热带地区，钩口线虫属的感染可能导致缺铁性贫血。"},{"en":"The lab report identified Ankylostoma larvae in the stool sample.","zh":"化验报告在粪便样本中检出了钩口线虫属的幼虫。"}]}],"synonyms":["hookworm","Ancylostoma (variant spelling)"],"phonetic":"/ˌæŋkɪləˈstoʊmə/","extraExplanation":["词源来自希腊语：ankylos（弯曲的）+ stoma（口）。这种虫的“口器”像钩子一样弯曲，能附着在肠壁上吸血，因此得名。","常见相关物种包括 *Ankylostoma duodenale*（十二指肠钩虫）等；在医学语境中常与 “hookworm” 一起出现。"]}
{"word":"ankylostomiasis","summary":{"en":"Ankylostomiasis is a hookworm disease that can cause anemia and weakness.","zh":"ankylostomiasis 指钩虫病，可引起贫血与乏力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a disease caused by hookworms (intestinal parasitic worms) that can lead to anemia, stomach/intestinal discomfort, and weakness, especially in warm, humid regions with poor sanitation","zh":"钩虫病：由钩虫（寄生在肠道的寄生虫）引起的疾病，可能导致贫血、胃肠不适和乏力，常见于温暖潮湿且卫生条件较差的地区"},"examples":[{"en":"The doctor suspected ankylostomiasis because the patient had anemia and a history of walking barefoot in the countryside.","zh":"医生怀疑是钩虫病，因为病人有贫血，并且有在乡间赤脚行走的经历。"},{"en":"Improving sanitation and wearing shoes can help prevent ankylostomiasis.","zh":"改善卫生条件并穿鞋有助于预防钩虫病。"}]}],"synonyms":["hookworm disease","hookworm infection","ancylostomiasis"],"phonetic":"/ˌæŋkɪloʊˌstʊmaɪˈeɪsɪs/","extraExplanation":["“ankylostomiasis”在医学上常与“hookworm infection（钩虫感染）”近义；常见致病虫为Ancylostoma duodenale（十二指肠钩虫）与Necator americanus（美洲板口线虫）。","感染途径多为幼虫从皮肤（尤其是脚底）钻入，随后进入血液再到肺部、咽部，最终被吞下进入小肠寄生；因此“赤脚接触被污染的土壤”是典型风险因素。"]}
{"word":"ankylotia","summary":{"en":"Ankylotia is a rare medical word for stiffness or fixation in the ear, often involving the middle-ear bones.","zh":"Ankylotia 是较少见的医学词，指耳部（常为中耳听小骨）出现僵硬或固定。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare medical term meaning stiffness or abnormal fixation in the ear (especially the middle ear), often referring to ankylosis (fusion/rigid immobility) of the tiny hearing bones (ossicles).","zh":"一个较少见的医学术语，指耳部（尤其是中耳）出现僵硬或异常固定，常指听小骨发生“强直/骨性粘连”（融合或僵硬不动）。"},"examples":[{"en":"The specialist suspected ankylotia as a possible cause of the patient’s conductive hearing loss.","zh":"专科医生怀疑“ankylotia（中耳结构僵硬/固定）”可能是患者传导性听力下降的原因之一。"},{"en":"Imaging was ordered to check whether ankylotia was limiting movement of the middle-ear bones.","zh":"医生安排了影像检查，以确认是否存在 ankylotia，导致中耳听小骨活动受限。"}]}],"synonyms":["ankylosis (of the middle ear)","ossicular fixation","stapes fixation"],"phonetic":"/ˌæŋkɪˈloʊʃiə/","extraExplanation":["“ankylotia”并不是日常英语中常见的词，更多见于较旧或较专业的医学语境。词根可拆为：ankyl(o)-（僵硬、强直）+ -otia（与耳相关的状况）。","它有时容易与“ankyloglossia（舌系带过短/舌系带强直）”混淆；两者前半部分相同（ankylo-），但后半部分不同：-otia（耳） vs. -glossia（舌）。"]}
{"word":"ankylotic","summary":{"en":"Ankylotic means medically stiff or immobile due to joint fusion or fixation; more generally, very stiff in movement.","zh":"ankylotic 指（医学上）关节强直、僵硬甚至固定不动；也可泛指动作很僵硬。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Having a joint that has become stiff or immobile because the bones are fused or the tissues have become fixed.","zh":"（医学）强直的；（关节）因骨性融合或组织固定而僵硬、几乎不能活动的。"},"examples":[{"en":"X-rays showed an ankylotic hip joint, which explained the patient’s limited movement.","zh":"X 光显示髋关节呈强直状态，这解释了患者活动受限。"},{"en":"After years of untreated inflammation, the spine can become ankylotic.","zh":"多年未治疗的炎症之后，脊柱可能变得强直。"}]},{"partOfSpeech":"adj.","definition":{"en":"Stiff or rigid in movement (a less technical, more general use).","zh":"（较通用）僵硬的；动作不灵活的。"},"examples":[{"en":"He walked with an ankylotic stiffness after sitting for too long.","zh":"他坐太久后走路显得僵硬不灵活。"}]}],"synonyms":["stiff","rigid","immobile","fused","fixed"],"phonetic":"/ˌæŋkəˈlɑtɪk/","extraExplanation":["“ankylotic” 来自医学名词 “ankylosis”（关节强直），常用于描述关节因长期炎症、损伤或疾病而“变得固定不动”。在临床语境里，它比一般的 “stiff” 更具体，暗示结构性改变（如骨性融合）。","常见相关疾病表达：ankylosing spondylitis（强直性脊柱炎），其中 “ankylosing” 与 “ankylotic” 同源。"]}
{"word":"ankylotome","summary":{"en":"An ankylotome is a surgical cutting instrument used to free a stiff or fused joint/tissue.","zh":"ankylotome 指用于松解或切开强直（僵硬/融合）组织或关节的外科切割器械。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical instrument used to cut or loosen stiffened or fused tissue (especially to release a joint that has become rigid from ankylosis).","zh":"（外科）强直刀；一种用于切开或松解僵硬、粘连或骨性融合组织的手术器械（尤指用于解除关节强直）。"},"examples":[{"en":"The surgeon used an ankylotome to release the scar tissue around the joint.","zh":"外科医生用强直刀松解关节周围的瘢痕组织。"},{"en":"In severe ankylosis, an ankylotome may be needed to restore some movement.","zh":"在严重关节强直时，可能需要使用强直刀来恢复一定活动度。"}]}],"synonyms":["surgical knife","tenotome (related)","osteotome (related)"],"phonetic":"/æŋˈkaɪləˌtoʊm/","extraExplanation":["这是一个较少见的医学器械名词，多出现在骨科或关节手术相关语境中。","词源可拆解为希腊语根：ankylo-（表示“弯曲、僵硬、强直”）+ -tome（表示“切割工具/刀”）。"]}
{"word":"ankylotomy","summary":{"en":"Ankylotomy is surgery to cut through a stiff or fused joint (ankylosis) to restore movement.","zh":"Ankylotomy 指通过切开关节强直（僵硬或融合）来恢复关节活动的手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical operation to cut through an ankylosis (an abnormal stiffness or fusion of a joint) in order to restore movement.","zh":"（外科）关节强直切开术：通过切开关节强直（关节异常僵硬或融合）来恢复活动度的手术。"},"examples":[{"en":"After imaging confirmed the joint was fused, the surgeon discussed ankylotomy as a possible option to improve mobility.","zh":"影像检查证实关节已经融合后，外科医生与患者讨论了关节强直切开术作为改善活动度的可能选择。"},{"en":"In severe cases of ankylosis, ankylotomy may be followed by rehabilitation to regain range of motion.","zh":"在严重关节强直的病例中，关节强直切开术后通常需要康复训练以恢复关节活动范围。"}]}],"synonyms":["surgical release of ankylosis","arthrolysis (related term)"],"phonetic":"/ˌæŋkɪˈlɑtəmi/","extraExplanation":["词源提示：ankyl/o- 表示“僵硬、关节强直”，-tomy 表示“切开术”。合起来就是“切开关节强直”的手术名称。","使用场景：这是医学专业词汇，日常英语中很少出现；在普通语境里更常见的是 ankylosis（关节强直）以及更宽泛的术语 joint fusion（关节融合）。","相关词：ankylosis（关节强直/融合），osteotomy（截骨术），arthroplasty（关节成形术/置换相关手术）。"]}
{"word":"ankylurethria","summary":{"en":"Ankylurethria is a rare medical term for abnormal stiffening or narrowing/partial closure of the urethra that can cause difficulty urinating.","zh":"Ankylurethria（尿道强直）是较少见的医学术语，指尿道异常僵硬或变窄/部分闭锁，可能引起排尿困难。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) Abnormal stiffening, scarring, or partial closure of the urethra, which can narrow the passage and make urination difficult.","zh":"（医学）尿道的异常僵硬、瘢痕化或部分闭锁，可能导致尿道变窄、排尿困难。"},"examples":[{"en":"The doctor suspected ankylurethria because the patient had a weak urine stream and difficulty starting urination.","zh":"医生怀疑是尿道强直（ankylurethria），因为病人的尿流变弱、起尿困难。"},{"en":"In severe cases of ankylurethria, imaging tests may be used to check whether the urethra has narrowed.","zh":"在尿道强直较严重的情况下，可能会用影像检查来确认尿道是否变窄。"}]}],"synonyms":["urethral stricture","urethral stenosis"],"phonetic":"/ˌæŋkɪl.jʊˈriːθriə/","extraExplanation":["这是一个较少见的医学术语，常用于描述尿道因炎症、外伤、手术或瘢痕形成而变得“僵硬/粘连/狭窄”的情况；临床上更常见的表达是 **urethral stricture（尿道狭窄）**。","词源上可拆解理解：**ankyl-** 表示“僵硬、强直、粘连”（如 *ankylosis* 强直），**urethr-** 指“尿道”，**-ia** 表示“疾病/状态”。","如果你是在病例或报告中看到这个词，也可能存在拼写变体（如 *ankylourethria*）；遇到不确定时可结合上下文或向医疗专业人士确认。"]}
{"word":"ankyroid","summary":{"en":"“Ankyroid” is a very rare medical adjective meaning a joint is stiff or fused (ankylosed).","zh":"“ankyroid”是非常罕见的医学形容词，表示关节僵硬或粘连（关节强直）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/medical) Stiff or fused (especially of a joint); ankylosed.","zh":"（罕见/医学）关节僵硬或粘连、骨性强直的；类似“关节强直（ankylosed）”。"},"examples":[{"en":"After the injury, his knee became stiff and nearly ankyroid.","zh":"受伤后，他的膝盖变得僵硬，几乎出现关节强直。"},{"en":"The doctor checked whether the joint was ankyroid or simply inflamed.","zh":"医生检查关节是发生强直，还是只是发炎。"}]}],"synonyms":["ankylosed","ankylotic","stiff","immobile"],"phonetic":"/ˈæŋkɪˌrɔɪd/","extraExplanation":["“ankyroid”在现代英语中非常少见，很多词典不收录；实际写作中更常用 ankylosed（关节已强直/粘连的）、ankylotic（关节强直的）、ankylosis（关节强直，名词）。","词源上与希腊语 ankylos（弯曲的、僵硬的）有关，因此常出现在医学语境（骨科/风湿免疫）里，而不是日常英语。","如果你是在医学报告或论文里看到该词，建议核对原文拼写：常见误拼包括 ankylod、ankyloid、ankylroid 等。"]}
