{"word":"anm","summary":{"en":"“ANM” is most commonly an abbreviation for Auxiliary Nurse Midwife, a frontline maternal-and-community health worker (often in India). It can also mean different things in technical/academic contexts depending on the source.","zh":"“ANM”最常见是“Auxiliary Nurse Midwife（辅助护士助产士）”的缩写，指一线母婴与社区健康工作人员（常见于印度）。在技术/学术语境中也可能代表其他含义，需结合上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"ANM: a trained health worker (especially in India and nearby regions) who provides basic nursing care, maternal health services, and family-planning support; short for “Auxiliary Nurse Midwife.”","zh":"ANM：一种受过培训的基层医护人员（尤指印度及周边地区），提供基础护理、孕产妇保健与计划生育等服务；是“Auxiliary Nurse Midwife（辅助护士助产士）”的缩写。"},"examples":[{"en":"In many villages, an ANM is the first point of contact for prenatal checkups.","zh":"在许多村庄，ANM 往往是孕期产检的第一联络人。"},{"en":"The clinic asked the ANM to organize a vaccination day for children.","zh":"诊所请 ANM 组织一次儿童疫苗接种日。"}]},{"partOfSpeech":"other","definition":{"en":"ANM: an abbreviation used in some academic and technical contexts for a name of a method/model (the exact meaning depends on the field and document).","zh":"ANM：在一些学术或技术语境中用作某种方法/模型的缩写（具体含义取决于学科与文档）。"},"examples":[{"en":"In this paper, ANM refers to a specific network model defined by the authors.","zh":"在这篇论文中，ANM 指作者定义的一种特定网络模型。"},{"en":"Please check the glossary to see what ANM stands for in this report.","zh":"请查看术语表，确认本报告中 ANM 的具体含义。"}]}],"synonyms":["Auxiliary Nurse Midwife","community health worker (approx.)"],"phonetic":"/ˌeɪˌɛnˈɛm/","extraExplanation":["在日常英语里，ANM 最常见的指代是印度公共卫生体系里的职业称呼（Auxiliary Nurse Midwife）。如果你是在论文、课程或软件界面里看到 ANM，它也可能是不同短语的首字母缩写；要结合上下文或术语表确认。"]}
{"word":"anmia","summary":{"en":"Anemia is a condition where the blood can’t carry enough oxygen because there aren’t enough healthy red blood cells or hemoglobin.","zh":"贫血是由于健康红细胞或血红蛋白不足，导致血液携氧能力下降的状况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical condition in which you don’t have enough healthy red blood cells (or hemoglobin), so your body can’t carry oxygen as well as it should.","zh":"贫血：体内健康红细胞（或血红蛋白）不足，导致携氧能力下降的一种医学状况。"},"examples":[{"en":"She was diagnosed with anemia after weeks of feeling tired and dizzy.","zh":"她在连续几周感到疲劳和头晕后被诊断为贫血。"},{"en":"Iron deficiency is a common cause of anemia.","zh":"缺铁是贫血的常见原因。"},{"en":"The doctor ordered a blood test to check for anemia.","zh":"医生开了血液检查来排查贫血。"}]},{"partOfSpeech":"n.","definition":{"en":"A lack of strength, energy, or richness (often used figuratively in writing or criticism).","zh":"（比喻）缺乏力量、活力或“厚度/丰富性”（常用于写作或评论语境）。"},"examples":[{"en":"Critics noted an anemia of ideas in the later chapters.","zh":"评论家指出后面几章在思想上显得贫乏无力。"}]}],"synonyms":["iron-deficiency (context-specific)","low hemoglobin (informal/medical context)"],"phonetic":"/əˈniːmiə/","extraExplanation":["你输入的“anmia”更像是拼写错误，常见正确拼法是 anemia（美式），英式拼法是 anaemia。","anemia 在日常健康语境里很常见；常见相关词包括 iron (铁)、hemoglobin (血红蛋白)、red blood cells (红细胞)、fatigue (疲劳)、dizzy (头晕)。如果你指的是别的词，也可以告诉我更多上下文。"]}
{"word":"Anmoore","summary":{"en":"Anmore is a place name: a small city in Metro Vancouver, British Columbia, Canada.","zh":"Anmore 是地名：加拿大BC省大温哥华地区的一座小城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small city in British Columbia, Canada, in the Metro Vancouver area (near Port Moody and Coquitlam).","zh":"加拿大不列颠哥伦比亚省（BC省）的一座小城市，位于大温哥华地区（靠近穆迪港和高贵林）。"},"examples":[{"en":"I live in Anmore, so I usually shop in Port Moody.","zh":"我住在安莫尔，所以我通常去穆迪港购物。"},{"en":"We went hiking on a trail near Anmore.","zh":"我们去安莫尔附近的一条步道徒步。"}]}],"phonetic":"/ˈæn.mʊr/","extraExplanation":["“Anmore”是专有名词（地名），通常不翻译或仅做音译（如“安莫尔”）。","在日常英语里常搭配介词：live in Anmore（住在安莫尔）、drive to Anmore（开车去安莫尔）、near Anmore（在安莫尔附近）。","如果你是在地址或地图上看到它，它多半指BC省大温地区的这座城市，而不是普通英语单词。"]}
