{"word":"ANP","summary":{"en":"ANP is an abbreviation most commonly meaning “atrial natriuretic peptide” (a heart hormone) or “advanced nurse practitioner” (a senior clinical nurse), depending on context.","zh":"ANP 是缩写，最常见指“心房利钠肽”（一种心脏激素）或“高级执业护士”，具体取决于语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medicine) Atrial natriuretic peptide: a hormone made by the heart that helps the body get rid of extra salt and water and lowers blood pressure.","zh":"（医学）心房利钠肽：由心脏产生的一种激素，帮助身体排出多余的盐和水，并降低血压。"},"examples":[{"en":"High ANP levels can be a sign that the heart is under stress.","zh":"ANP 水平升高可能表明心脏承受压力。"},{"en":"ANP helps the kidneys remove sodium and water from the body.","zh":"ANP 帮助肾脏从体内排出钠和水。"}]},{"partOfSpeech":"n.","definition":{"en":"(healthcare, especially UK) Advanced Nurse Practitioner: a nurse with advanced training who can assess patients and may prescribe medicine.","zh":"（医疗保健，尤指英国）高级执业护士：受过高级培训的护士，可评估病人，有时也能开具处方。"},"examples":[{"en":"I booked an appointment with the ANP at the clinic.","zh":"我在诊所预约了高级执业护士（ANP）。"},{"en":"The ANP examined my symptoms and explained the treatment plan.","zh":"ANP 检查了我的症状并解释了治疗方案。"}]},{"partOfSpeech":"n.","definition":{"en":"(media, India) Asian News International: an Indian news agency often abbreviated as ANI (sometimes confused with “ANP”).","zh":"（媒体，印度）亚洲国际新闻社：印度一家通讯社，常缩写为 ANI（有时会与“ANP”混淆）。"},"examples":[{"en":"The report was circulated by a news agency abbreviation that looked like ANP.","zh":"这则报道由一个看起来像 ANP 的通讯社缩写传播。"},{"en":"Check the source carefully, because ANI and ANP can be mixed up in screenshots.","zh":"要仔细核对来源，因为截图里 ANI 和 ANP 可能被混淆。"}]}],"synonyms":["(atrial natriuretic peptide) ANF (older term)"],"phonetic":"/ˌeɪɛnˈpiː/","extraExplanation":["“ANP”是缩写，具体含义强烈依赖语境（医学论文、医院门诊、新闻来源等）。如果你告诉我它出现在哪句话/哪种领域，我可以帮你锁定最准确的释义与用法。","在医学语境中更常见的是“ANP (atrial natriuretic peptide)”，在英国医疗体系里也常见“ANP (Advanced Nurse Practitioner)”。","发音通常按字母读：A-N-P。"]}
{"word":"anp","summary":{"en":"ANP is an abbreviation; most often it means atrial natriuretic peptide (a hormone), but it can also be the initials of an organization depending on context.","zh":"ANP 是一个缩写；最常见指“心房利钠肽”（一种激素），也可能是某个组织/机构名称的首字母缩写，需结合语境判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An abbreviation used for different things depending on context; most commonly, a hormone name in medicine: atrial natriuretic peptide.","zh":"一个会因语境不同而代表不同含义的缩写；最常见的一种（医学中）指“心房利钠肽”（atrial natriuretic peptide）。"},"examples":[{"en":"The doctor said ANP helps the body get rid of extra salt and water.","zh":"医生说 ANP 会帮助身体排出多余的盐和水。"},{"en":"Researchers measured ANP levels in the patient’s blood.","zh":"研究人员测量了病人血液中的 ANP 水平。"}]},{"partOfSpeech":"n.","definition":{"en":"A set of initials that may refer to an organization or agency name (for example, a news agency), depending on country and topic.","zh":"一组首字母缩写，也可能指某个组织或机构名称（例如新闻通讯社等），具体含义取决于国家与话题。"},"examples":[{"en":"The report was first published by ANP.","zh":"这篇报道最早由 ANP 发布。"},{"en":"In this article, ANP refers to a national agency.","zh":"在这篇文章里，ANP 指的是一个国家机构。"}]}],"phonetic":"/ˌeɪɛnˈpiː/","extraExplanation":["“ANP”通常按字母逐个读作 /ˌeɪɛnˈpiː/。因为它是缩写，准确含义高度依赖上下文（医学、新闻、政府机构等）。如果你告诉我它出现在哪句话或哪个领域，我可以给出最贴切的释义。"]}
{"word":"ANPA","summary":{"en":"ANPA most commonly refers to the former American Newspaper Publishers Association, a U.S. newspaper-industry trade group.","zh":"ANPA 最常指“美国报业出版商协会”，一个曾经的美国报纸行业组织。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"American Newspaper Publishers Association; a former U.S. trade organization for newspaper publishers (now reorganized under a different name).","zh":"美国报业出版商协会；美国报纸出版商的行业组织（后来改组并更名）。"},"examples":[{"en":"The ANPA once represented many major U.S. newspapers on industry issues.","zh":"ANPA 曾在行业事务上代表许多美国大型报纸。"},{"en":"Some older documents use ANPA as the organization’s abbreviation.","zh":"一些较早的文件会用 ANPA 作为该组织的缩写。"}]}],"synonyms":["American Newspaper Publishers Association"],"phonetic":"/ˌæn.piːˈeɪ/","extraExplanation":["ANPA 最常见的含义是 American Newspaper Publishers Association（美国报业出版商协会）。该组织后来经历重组与更名，相关历史名称在不同年代的资料里可能不一致。","缩写在不同领域也可能有其他含义；如果你是在特定语境（例如医学、政府机构、学校或技术文档）里看到 ANPA，可以告诉我原句，我可以帮你锁定最准确的释义。"]}
{"word":"Anpu","summary":{"en":"“Anpu” is usually a name (not a standard English word).","zh":"“Anpu”通常是名字（不是标准英语词汇）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name or romanized spelling (often from Chinese/Japanese) used as a personal name, place name, brand, or username; it is not a standard English vocabulary word with a fixed dictionary meaning.","zh":"一个专有名词或音译拼写（常见于中文/日文罗马字），可用作人名、地名、品牌名或用户名；它不是一个在英语词典里有固定含义的常见词汇。"},"examples":[{"en":"Anpu is my username online.","zh":"Anpu 是我的网名。"},{"en":"We met someone named Anpu at the conference.","zh":"我们在会议上认识了一位名叫 Anpu 的人。"}]}],"phonetic":"/ˈɑnpu/","extraExplanation":["“Anpu”在英语语境里通常被当作名字来用，因此读音可能会因个人或原语言而不同。若你能告诉我它来自哪种语言/想表达哪个汉字（如“安普/安浦”等），我可以给出更贴近来源的含义、文化背景和更自然的用法。"]}

