{"word":"ans","summary":{"en":"“ans” most commonly means the informal abbreviation of “answer”; “ANS” can also mean “Autonomic Nervous System.”","zh":"“ans”最常见是“answer（答案/回答）”的非正式缩写；大写“ANS”也可指“自主神经系统”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal, abbreviation) “answer”; used in texting, notes, or forms.","zh":"（非正式，缩写）“answer”的缩写，表示“答案/回答”，常见于短信、笔记或表格。"},"examples":[{"en":"Q: Where are you?  Ans: At home.","zh":"问：你在哪儿？答（Ans）：在家。"},{"en":"Please write your ans in the box below.","zh":"请把你的答案（ans）写在下面的框里。"}]},{"partOfSpeech":"other","definition":{"en":"(abbreviation) “Autonomic Nervous System,” a medical term.","zh":"（缩写）“自主神经系统”（Autonomic Nervous System），医学术语。"},"examples":[{"en":"Stress can affect the ANS and raise your heart rate.","zh":"压力会影响自主神经系统（ANS），让心率升高。"},{"en":"The doctor explained how the ANS controls breathing and digestion.","zh":"医生解释了自主神经系统（ANS）如何控制呼吸和消化。"}]}],"synonyms":["answer (for meaning 1)","reply (for meaning 1)","Autonomic Nervous System (for meaning 2)"],"phonetic":"/ænz/","extraExplanation":["在日常英语里，小写“ans”多见于题目/表格的“Ans:”格式；聊天中也有人用，但更常见的是直接用“answer”或“reply”。","大写“ANS”在专业语境（尤其医学、生理学）里更常见；是否大写通常能帮助你判断意思。"]}
{"word":"ansa","summary":{"en":"Ansa means a loop- or handle-shaped structure, especially in anatomical terms.","zh":"Ansa 指环状/把手状结构，尤用于解剖学术语中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a loop or handle-shaped structure; often used in anatomy to name loop-like nerves or parts (e.g., ansa cervicalis).","zh":"环状或把手状的结构；常用于解剖学中指环形的神经或部位（如颈袢 ansa cervicalis）。"},"examples":[{"en":"The diagram labels the ansa cervicalis as a loop of nerves in the neck.","zh":"图示把颈袢标注为颈部的一段环形神经。"},{"en":"In medical terminology, an ansa often refers to a loop-shaped connection.","zh":"在医学术语中，ansa 常指环形的连接结构。"}]}],"synonyms":["loop","ring","handle (shape)"],"phonetic":"/ˈæn.sə/","extraExplanation":["“Ansa”来自拉丁语，原意是“把手/环”。因此在医学英语里，它经常用来给“像环或袢一样的结构”命名。","常见搭配：ansa cervicalis（颈袢，一组控制部分颈部肌肉的神经环）、ansa lenticularis（豆状袢，神经纤维束的一部分）。不同专业语境下具体指代会不同，通常需要结合解剖位置来理解。"]}
{"word":"ansae","summary":{"en":"Ansae means “handles” or handle-like parts; it is the plural of ansa and is used especially in anatomy/biology and astronomy (e.g., the ‘handles’ of Saturn’s rings).","zh":"Ansae 意为“把手/把手状部分”，是 ansa 的复数；常用于解剖学、生物学与天文学（如土星环两侧的“把手状亮边”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plural form of ansa: handle-like parts or loop-shaped projections; often used in anatomy or biology to name structures shaped like a handle or loop.","zh":"ansa（“把手、环状突起”）的复数：指像把手一样的部分或环状突起；常用于解剖学、生物学中描述“把手/环形”结构。"},"examples":[{"en":"The diagram labels the ansae as two handle-like extensions on the structure.","zh":"图中把这些把手状的延伸部分标注为 ansae。"},{"en":"In anatomy, some small loop-shaped regions are described as ansae because of their shape.","zh":"在解剖学中，一些小的环状区域因为形状像“把手”，会被称为 ansae。"}]},{"partOfSpeech":"n.","definition":{"en":"in astronomy, the two “handles” (bright extensions) seen at the sides of a ring system—especially Saturn’s rings—when viewed from Earth.","zh":"【天文学】指环状系统（尤其是土星环）从地球观察时两侧看起来像“把手”的亮边/延伸部分。"},"examples":[{"en":"Early astronomers described Saturn’s rings as having ansae on both sides of the planet.","zh":"早期天文学家描述土星的环在行星两侧有 ansae（把手状亮边）。"},{"en":"As the viewing angle changed, the ansae appeared longer and brighter.","zh":"随着观测角度变化，ansae 看起来更长、更亮。"}]}],"synonyms":["handles","projections","extensions","loops"],"phonetic":"/ˈænsiː/","extraExplanation":["“Ansa”来自拉丁语，原意是“把手（handle）”。因此 ansae 常被用来给“形状像把手/环”的结构命名。","读写提示：ansae 是复数形式；单数是 ansa。学术文章里更常见于解剖学/天文学等语境。"]}
{"word":"Ansar","summary":{"en":"Ansar most commonly refers to the Medinan Muslims who supported the Prophet Muhammad and early Muslims; more generally it can mean “supporters/helpers” in group names.","zh":"Ansar 最常指伊斯兰历史上麦地那的“援助者”群体；更广义上也可用于团体名称中表示“支持者 / 帮助者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Islam, history) The Muslims of Medina who welcomed and supported the Prophet Muhammad and the early Muslim migrants (the Muhajirun) after the Hijra.","zh":"（伊斯兰历史）指麦地那的穆斯林“援助者”，在“迁徙”（Hijra）后接纳并支持先知穆罕默德及早期移民穆斯林（穆哈吉伦）。"},"examples":[{"en":"In Islamic history, the Ansar played a key role in supporting the early Muslim community in Medina.","zh":"在伊斯兰历史中，安萨尔在支持麦地那的早期穆斯林社群方面发挥了关键作用。"},{"en":"The Qur’an often praises the Muhajirun and the Ansar for their solidarity.","zh":"《古兰经》常称赞穆哈吉伦与安萨尔之间的团结。"}]},{"partOfSpeech":"n.","definition":{"en":"A name used by various organizations or groups (often in Arabic-based names) meaning “supporters” or “helpers.”","zh":"（用于一些组织或团体名称中）意为“支持者 / 援助者 / 帮助者”。"},"examples":[{"en":"Some groups use the word Ansar in their names to suggest they are “supporters” of a cause.","zh":"一些团体会在名称中使用 Ansar，表示自己是某项事业的“支持者”。"}]}],"synonyms":["helpers","supporters"],"phonetic":"/ɑnˈsɑr/","extraExplanation":["“Ansar”（أنصار）在阿拉伯语里本义是“援助者、支持者”，是“nasara（帮助）”这一词根的复数形式。","在伊斯兰史语境中，它特指麦地那的支持者，与从麦加迁徙而来的“穆哈吉伦（Muhajirun）”相对；两者常被并列提及，强调互助与共同体精神。","大小写方面：写作“the Ansar”多指历史群体；出现在现代团体名称里时，通常作为专名的一部分。"]}
{"word":"ansar","summary":{"en":"Ansar means “helpers/supporters,” especially the Medinan Muslims who supported Muhammad after the Hijra; it can also be used in modern group names.","zh":"Ansar意为“援助者/支持者”，特指希吉来后支持先知穆罕默德的麦地那穆斯林；也可用于现代团体名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Islam, history) The “Helpers”: the people of Medina (Yathrib) who supported the Prophet Muhammad and the early Muslims after the Hijra (migration).","zh":"（伊斯兰历史）“辅士/援助者”：指在迁徙（希吉来）后支持先知穆罕默德与早期穆斯林的麦地那（雅斯里卜）居民。"},"examples":[{"en":"In Islamic history, the Ansar welcomed the مهاجرون (Muhajirun) who migrated from Mecca to Medina.","zh":"在伊斯兰历史中，安萨尔（辅士）欢迎从麦加迁徙到麦地那的穆哈吉伦（迁士）。"},{"en":"Many lessons about community support are drawn from the Ansar’s generosity.","zh":"人们常从安萨尔的慷慨中总结关于互助与团结的启示。"}]},{"partOfSpeech":"n.","definition":{"en":"(Modern usage) A group name meaning “supporters” or “helpers,” used by various communities or organizations (sometimes with political or military associations, depending on the region).","zh":"（现代用法）意为“支持者/援助者”的团体名称；可指不同地区的组织或社群名称（在某些语境下可能带有政治或军事色彩）。"},"examples":[{"en":"The word ansar is sometimes used in group names to mean “supporters.”","zh":"“ansar”有时会出现在团体名称中，表示“支持者”。"},{"en":"Be careful with context: “Ansar” can refer to the historical Medinan Helpers or to a modern organization.","zh":"注意语境：“Ansar”既可能指历史上的麦地那辅士，也可能指现代某个组织。"}]}],"synonyms":["helpers","supporters","allies"],"phonetic":"/ɑnˈsɑr/","extraExplanation":["“Ansar”（阿拉伯语：أنصار）是“nāṣir（援助者）”的复数形式，词根与“帮助、支援”相关。","在经典伊斯兰叙事中，“Muhajirun（迁士）”与“Ansar（辅士）”常成对出现：前者离开麦加迁往麦地那，后者在麦地那提供庇护与资源。","作为专有名词使用时常写作 Ansar（首字母大写）。在新闻语境里若指现代组织，含义会因地区与组织性质而变化，阅读时应结合具体背景判断。"]}
{"word":"Ansari","summary":{"en":"Ansari is a common surname; it can also mean “of the Ansar,” referring to the early Islamic “Helpers” in Medina.","zh":"Ansari 是常见的姓氏；也可表示“属于安萨尔”，指伊斯兰早期在麦地那的“援助者/帮助者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname) used by people in many countries; it is common among Muslims and people of South Asian or Middle Eastern background.","zh":"一个姓氏（家族姓），在许多国家都有人使用；在穆斯林以及南亚或中东背景的人群中较常见。"},"examples":[{"en":"My doctor’s last name is Ansari.","zh":"我医生的姓是 Ansari。"},{"en":"Sara Ansari presented the research at the conference.","zh":"Sara Ansari 在会议上展示了这项研究。"}]},{"partOfSpeech":"n.","definition":{"en":"a title/name meaning “of the Ansar” (the “Helpers” in early Islamic history in Medina), often adopted as a surname or community name.","zh":"一个表示“属于安萨尔（Ansar）”的称号/名字；安萨尔是伊斯兰早期历史中麦地那的“援助者”，该称号常被用作姓氏或群体名称。"},"examples":[{"en":"In some contexts, Ansari indicates a family’s historical association with the Ansar.","zh":"在某些语境中，Ansari 表示一个家族与安萨尔在历史上的关联。"},{"en":"He explained that his surname, Ansari, reflects a traditional community identity.","zh":"他解释说，他的姓 Ansari 反映了一种传统的群体身份。"}]}],"synonyms":["(surname)","(nisba/title)"],"phonetic":"/ænˈsɑːri/","extraExplanation":["“Ansari”源自阿拉伯语的“Ansar（安萨尔）”，意为“帮助者/援助者”。在伊斯兰历史中，安萨尔指在麦地那支持先知穆罕默德及其追随者的人们，因此“Ansari”可作为族称或姓氏，表示与安萨尔相关或象征这种身份。","在南亚语境中，“Ansari”也常见于某些穆斯林社群名称与姓氏体系中；具体含义会因地区与家族传统而不同。"]}
{"word":"Ansarian","summary":{"en":"“Ansarian” most often means “related to the Ansar (the early Helpers in Medina)” and can also mean “a member of the Ansar.” It may also appear as a surname.","zh":"“Ansarian”最常指“与辅士（Ansar，伊斯兰早期麦地那的支持者/帮助者）有关的”，也可指“辅士成员”。此外它也可能只是一个姓氏。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Ansar—the early supporters (“Helpers”) of the Prophet Muhammad in Medina—or to their descendants/traditions","zh":"与“辅士（Ansar）”有关的——指伊斯兰早期在麦地那支持先知穆罕默德的群体，或与其后裔/传统相关"},"examples":[{"en":"Some historians describe certain Medina tribes as Ansarian allies in early Islamic society.","zh":"一些历史学者把麦地那的某些部族描述为伊斯兰早期社会中的“辅士”盟友。"},{"en":"The text uses “Ansarian” to emphasize the community’s role as helpers and protectors.","zh":"这篇文本用“Ansarian（辅士的）”来强调该群体作为援助者与保护者的角色。"}]},{"partOfSpeech":"n.","definition":{"en":"a member of the Ansar, or someone identified with that group (historical/religious context)","zh":"辅士的一员；（历史/宗教语境中）被认同为辅士群体的人"},"examples":[{"en":"He is described as an Ansarian who welcomed the emigrants to Medina.","zh":"他被描述为一位辅士，曾欢迎迁徙者来到麦地那。"},{"en":"In the narrative, the Ansarian families share their homes and food.","zh":"在叙述中，辅士家庭分享他们的住所与食物。"}]},{"partOfSpeech":"n.","definition":{"en":"a surname (family name), found in several communities; meaning depends on the family’s background","zh":"姓氏（家族名）；见于不同社群，具体含义取决于家族背景"},"examples":[{"en":"Dr. Ansarian will speak at the conference tomorrow.","zh":"Ansarian 博士将于明天在会议上发言。"}]}],"synonyms":["Ansar (more common in everyday use)"],"phonetic":"/ænˈsɑriən/","extraExplanation":["“Ansar”在阿拉伯语里常被解释为“帮助者/援助者”。在伊斯兰历史中，“辅士（Ansar）”特指麦地那的支持者，他们在先知穆罕默德与“迁士（Muhajirun，迁徙者）”到来后提供庇护与支持。","作为形容词时，“Ansarian”多见于历史、宗教研究或较正式的英文写作；日常英语里更常直接用“Ansar”。","如果你是在姓名/作者名中看到“Ansarian”，它很可能只是姓氏，并不一定在句子里有“辅士相关”的含义，需要结合上下文判断。"]}
{"word":"ansarian","summary":{"en":"Ansarian is mainly used as a surname; it can also describe something related to the early Islamic “Ansar.”","zh":"Ansarian 主要用作姓氏；也可指与伊斯兰早期“安萨尔”（支持者）相关的事物。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname), especially common among people of Iranian/Persian background.","zh":"（姓氏）常见于伊朗/波斯背景人群的姓。"},"examples":[{"en":"Dr. Ansarian will speak at the conference tomorrow.","zh":"Ansarian 医生明天将在会议上发言。"},{"en":"I met someone named Ansarian in my English class.","zh":"我在英语课上认识了一个姓 Ansarian 的人。"}]},{"partOfSpeech":"adj.","definition":{"en":"Of or relating to the “Ansar” (“helpers/supporters”) in early Islamic history; sometimes used as a variant form of Ansari.","zh":"（形容词/名词用法）与伊斯兰早期历史中的“安萨尔”（帮助者/支持者）有关；有时作为 Ansari 的变体形式。"},"examples":[{"en":"The text mentions Ansarian supporters in Medina.","zh":"这段文字提到了麦地那的 Ansarian（安萨尔）支持者。"},{"en":"Some sources use “Ansari,” while others use “Ansarian.”","zh":"有些资料用“Ansari”，也有些用“Ansarian”。"}]}],"synonyms":["Ansari","of the Ansar"],"phonetic":"/ænˈsɑːriən/","extraExplanation":["“Ansar”（الأنصار）在伊斯兰历史中指麦地那（Yathrib）的支持者，他们在先知穆罕默德迁徙（Hijra）后提供援助与保护。","“Ansarian”在英语里更常见的是姓氏；与“Ansari/Ansarī”这种更常见的拼写相比，“Ansarian”多见于不同的音译或家族拼写习惯。"]}
{"word":"Ansarie","summary":{"en":"Ansarie is mainly a surname, often a variant spelling of Ansari, and can historically mean “related to the Ansar (Helpers) of Medina.”","zh":"Ansarie 主要是一个姓氏，常见为 Ansari 的拼写变体；历史上可含“与麦地那的 Ansar（辅士/援助者）有关”之意。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), often a spelling variant of Ansari, used by people from various countries (especially in South Asia and the Middle East).","zh":"一个姓氏，常见为 Ansari 的另一种拼写形式；在南亚和中东等地的人名中较常见。"},"examples":[{"en":"Ms. Ansarie will lead the meeting today.","zh":"Ansarie 女士今天将主持会议。"},{"en":"I’m emailing Dr. Ansarie about the results.","zh":"我正在给 Ansarie 医生发邮件询问结果。"}]},{"partOfSpeech":"n.","definition":{"en":"a name form meaning “related to the Ansar,” referring historically to the “Helpers” of Medina in early Islamic history (seen especially in forms like al-Ansari / Ansari; spelling may vary as Ansarie).","zh":"一种姓名形式，含义为“与 Ansar（辅士）有关”；Ansar 指伊斯兰早期在麦地那支持先知穆罕默德的“辅士/援助者”（常见形式为 al-Ansari / Ansari，Ansarie 属于拼写变体）。"},"examples":[{"en":"His last name appears as al-Ansari in older records, but as Ansarie in newer documents.","zh":"在旧档案中他的姓写作 al-Ansari，而在新证件上写作 Ansarie。"},{"en":"The surname Ansari/Ansarie can connect to historical identity labels used in Arabic and Persian naming traditions.","zh":"Ansari/Ansarie 这个姓可能与阿拉伯语、波斯语命名传统中的历史身份称谓有关。"}]}],"synonyms":["Ansari","al-Ansari"],"phonetic":"/ænˈsɑːri/","extraExplanation":["“Ansarie”更常见于人名拼写而不是英语词汇；不同国家/机构在拉丁字母转写（transliteration）上会有差异，所以同一个姓可能出现 Ansari、Ansarie、Al-Ansari 等多种写法。","在正式写作中，如果你不确定对方偏好的拼写，最好以证件/署名为准，或礼貌询问对方希望你如何拼写与称呼。"]}
{"word":"ansarie","summary":{"en":"“Ansarie” is usually a variant spelling of “Ansari,” meaning (1) a member of the historical Ansar of Medina, or (2) a surname.","zh":"“ansarie”通常是“Ansari”的变体拼写，可指（1）历史上麦地那的“援助者”（安萨尔）成员，或（2）常见姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Ansar (“helpers”), the people of Medina who supported the Prophet Muhammad and the early Muslim community (historical/Islamic context).","zh":"（历史/伊斯兰语境）“援助者”（Ansar）之一：指麦地那当地支持先知穆罕默德及早期穆斯林社群的人。"},"examples":[{"en":"In Islamic history, the Ansar welcomed the Muslims who migrated to Medina.","zh":"在伊斯兰历史中，“援助者”（Ansar）欢迎迁徙到麦地那的穆斯林。"},{"en":"Some historical texts mention the Ansari families of Medina.","zh":"一些史料会提到麦地那的安萨尔（Ansari）家族。"}]},{"partOfSpeech":"n.","definition":{"en":"a common surname (family name), especially among people from South Asia and the Middle East; sometimes spelled “Ansari,” and “ansarie” may be a variant spelling.","zh":"常见姓氏（家族名），在南亚与中东地区较常见；常拼作“Ansari”，“ansarie”可能是变体拼写。"},"examples":[{"en":"Her last name is Ansari.","zh":"她的姓是 Ansari。"},{"en":"You may see it spelled as Ansari or, less commonly, Ansarie.","zh":"你可能会看到它拼作 Ansari，较少见的拼法是 Ansarie。"}]}],"synonyms":["Ansari","al-Ansari","Ansar"],"phonetic":"/ænˈsɑri/","extraExplanation":["“Ansar”（安萨尔）在阿拉伯语里有“帮助者、援助者”的意思；“al-Ansari”常见于名字中，表示“来自安萨尔/与安萨尔有关的人”。","如果你是在查某个人名或品牌名，最好提供句子或来源（例如一段文字/截图），因为“ansarie”也可能是特定拼写、用户名或专有名词。"]}
{"word":"ansate","summary":{"en":"Ansate describes something that has a handle or handle-like parts, mainly used in scientific descriptions.","zh":"Ansate 指“有把手/把状突起的”，主要用于科学描述（生物、植物、化石等）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially in biology/botany) having a handle or handle-like projections; shaped like a cup or vessel with handles.","zh":"（尤用于生物/植物学）有把手的；具把状突起的；形似带柄或带把的器皿。"},"examples":[{"en":"Under the microscope, the seed looked ansate, with two small handle-like lobes.","zh":"在显微镜下，这颗种子看起来呈“有把状”（ansate），两侧有两个像把手的小叶状突起。"},{"en":"Some fossils are described as ansate because of their paired projections.","zh":"有些化石会被描述为 ansate，因为它们有一对突起。"}]}],"synonyms":["handled","handle-shaped","with projections"],"phonetic":"/ˈænseɪt/","extraExplanation":["“ansate”来自拉丁语 ansa（“把手、柄”）。它主要用于学术写作（如植物形态学、动物学、古生物学）来描述形状，不常用于日常英语。"]}
{"word":"ansated","summary":{"en":"“Ansated” means “having handles,” used mainly in art history and archaeology.","zh":"“ansated”表示“有把手的”，多用于艺术史与考古语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having one or more handles (especially used to describe cups, vases, or other vessels).","zh":"有把手的；带柄的（尤指杯子、花瓶等器皿）。"},"examples":[{"en":"The museum displayed an ansated jar from ancient Egypt.","zh":"博物馆展出了一只来自古埃及的带把手陶罐。"},{"en":"In the catalog, the ansated cup is listed as a ceremonial object.","zh":"在目录中，这只带把手的杯子被列为礼仪器物。"}]}],"synonyms":["handled","with a handle","ansate"],"phonetic":"/ænˈseɪtɪd/","extraExplanation":["“ansated”来自拉丁语 ansa（意为“把手、柄”），在考古、艺术史、博物馆图录里更常见。日常英语里通常会说 “handled” 或 “with a handle”。","相关词：ansate（同义形容词，更常见）；也可见于术语如 “ansate cross”（安萨特十字，又称埃及“生命之符”ankh 的一种称呼）。"]}
{"word":"ansation","summary":{"en":"“Sensation” means a physical/mental feeling, or a big wave of public excitement/interest (a ‘buzz’).","zh":"“sensation”指（身心的）感觉/感受，也可指引发公众强烈关注的“轰动”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feeling you get in your body or mind (for example, pain, warmth, hunger, or excitement)","zh":"（身体或心理的）感觉；感受（如疼痛、温暖、饥饿、兴奋等）"},"examples":[{"en":"I had a strange sensation in my left hand.","zh":"我左手有一种奇怪的感觉。"},{"en":"The cold water caused a sharp sensation in my teeth.","zh":"冷水让我的牙齿产生一阵刺痛的感觉。"}]},{"partOfSpeech":"n.","definition":{"en":"a strong reaction of interest or excitement among many people; something that causes it","zh":"（引起公众强烈关注的）轰动；轰动性事件/人物"},"examples":[{"en":"The singer became an overnight sensation.","zh":"这位歌手一夜之间成了轰动人物。"},{"en":"The video was a sensation on social media.","zh":"这段视频在社交媒体上引起了轰动。"}]}],"synonyms":["feeling","perception","tingle","excitement","buzz","furore"],"phonetic":"/sɛnˈseɪʃən/","extraExplanation":["“ansation”不是常见的英语单词，最可能是拼写错误，常见目标词是“sensation”。如果你想查的是别的词（例如“annotation / anastasia / ansatz”等），把完整句子发我，我可以根据上下文确定。"]}
{"word":"Anschauung","summary":{"en":"Anschauung is a German term meaning direct perception or “intuition,” especially in Kant’s philosophy; more generally it can mean a way of viewing or contemplating something.","zh":"Anschauung 是一个德语词，常指“直观/直接感知”（尤见于康德哲学）；广义也可指“观看方式、观照或看法”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Philosophy, especially Kant) intuition; immediate, direct perception of something (often translated as “intuition” or “direct intuition”).","zh":"（哲学，尤指康德）直观；对对象的直接、即时的把握（常译为“直观/直觉式的直观”）。"},"examples":[{"en":"In Kant’s philosophy, knowledge begins with Anschauung (intuition) and is shaped by concepts.","zh":"在康德哲学中，知识始于“Anschauung（直观）”，并由概念加以塑形。"},{"en":"He argued that space and time are forms of Anschauung rather than properties of things themselves.","zh":"他主张空间与时间是直观的形式，而非事物自身的属性。"}]},{"partOfSpeech":"n.","definition":{"en":"(General) a way of seeing or viewing; contemplation or perception of something through direct observation.","zh":"（一般用法）观看方式；通过直接观察得到的感知/观照；沉思式的观看。"},"examples":[{"en":"Her Anschauung of nature came from years of careful observation.","zh":"她对自然的“Anschauung（观照/看法）”来自多年的细致观察。"},{"en":"Different cultures may have different Anschauungen about what counts as polite.","zh":"不同文化对何为礼貌，可能有不同的“Anschauungen（看法/观念）”。"}]}],"synonyms":["intuition","direct perception","perception","contemplation","sense-impression","way of seeing"],"phonetic":"/ˈɑnʃaʊʊŋ/","extraExplanation":["这个词是德语，在英语学术写作里常保留原文（斜体 *Anschauung*），因为它在康德体系中有比较精确的技术含义，常译为“直观”。它强调“直接给出/呈现”的经验内容，与由概念进行的“思维/理解”相对。","在康德那里，*Anschauung* 并不等同于日常英语的 “intuition（直觉）”那种“凭感觉猜到”，而更接近“直接呈现于心智的表象”。因此翻译和理解时要注意语境。"]}
{"word":"anschauung","summary":{"en":"Anschauung is a German loanword used mainly in philosophy to mean direct perception or intuition (especially in Kant).","zh":"Anschauung 是德语借词，主要在哲学语境中指“直观/直觉的直接感知”（尤见于康德）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In philosophy, especially Kant) direct perception or intuition—knowledge that comes from immediate sensory experience rather than from abstract reasoning.","zh":"（哲学用语，尤指康德）直观／直觉——来自直接感官经验的认识，而不是抽象推理。"},"examples":[{"en":"Kant uses Anschauung to describe how we receive sensations before we form concepts.","zh":"康德用 Anschauung 来说明：在形成概念之前，我们如何先接受感官印象。"},{"en":"Her argument separates pure reasoning from Anschauung, or what we can directly perceive.","zh":"她的论证把纯粹推理与 Anschauung（我们能直接感知到的东西）区分开来。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common in English) a way of viewing something; a perspective or outlook (often used in academic writing).","zh":"（英语中较少见）看待事物的方式；观点／视角（多见于学术写作）。"},"examples":[{"en":"From a historical Anschauung, the event looks less like a sudden break and more like a long process.","zh":"从历史的 Anschauung（历史视角）来看，这件事不像突然断裂，更像长期演变。"}]}],"synonyms":["intuition","direct perception","perception","immediate experience","outlook (less common)"],"phonetic":"/ˈɑnʃaʊ.ʊŋ/","extraExplanation":["Anschauung 是德语词，直译接近“观看、直观”。它在英语里多作为学术借词出现，常见于讨论康德哲学（如“感性直观”）。","不要把 Anschauung 和 Weltanschauung 混淆：Weltanschauung（世界观）在英语里更常见，而 Anschauung 更偏“直接直观/直觉的感知”。","读哲学英文时常会遇到 intuition（直观）与 perception（知觉）来解释 Anschauung；有的译者会把它译作“直观表象/直观”。"]}
{"word":"Anschluss","summary":{"en":"“Anschluss” most commonly refers to Nazi Germany’s 1938 annexation of Austria.","zh":"“Anschluss”最常指纳粹德国于1938年吞并奥地利的历史事件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the 1938 annexation of Austria by Nazi Germany; often used to refer specifically to that historical event","zh":"（特指历史事件）1938年纳粹德国吞并奥地利；常专指这一事件"},"examples":[{"en":"Many history textbooks describe the Anschluss as a key step toward World War II.","zh":"许多历史教材把“德奥合并（Anschluss）”描述为通向第二次世界大战的关键一步。"},{"en":"After the Anschluss, Austria was incorporated into the German Reich.","zh":"德奥合并之后，奥地利被并入德意志帝国（第三帝国）。"}]},{"partOfSpeech":"n.","definition":{"en":"annexation or political union (a less common, more general meaning in English, borrowed from German)","zh":"吞并；（政治上的）合并、联合（英语中较少见的泛指用法，源自德语借词）"},"examples":[{"en":"In English, “Anschluss” is rarely used for other unions; people usually just say “annexation.”","zh":"在英语里，“Anschluss”很少用来指其他合并；人们通常直接说“annexation（吞并）”。"}]}],"synonyms":["annexation","incorporation","takeover","political union (general sense)"],"phonetic":"/ˈænʃlʊs/","extraExplanation":["“Anschluss”是德语词，字面意思接近“连接、并入、合并”。在英语语境中，它几乎总是作为专有名词，指1938年德国对奥地利的吞并，因此带有强烈的历史与政治色彩。","写作时通常大写（the Anschluss），并常与“appeasement（绥靖政策）”“plebiscite（公投，常被认为在当时缺乏自由公平条件）”等二战前外交史主题一起出现。"]}
{"word":"anschluss","summary":{"en":"“Anschluss” is a German noun meaning “connection,” and in history it can specifically mean the 1938 annexation of Austria by Nazi Germany.","zh":"“Anschluss”是德语名词，常指“连接/衔接”；在历史语境中也特指1938年纳粹德国吞并奥地利的“德奥合并”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a connection, link, or joining point (often used in German contexts, e.g., a transport connection or a technical connector)","zh":"连接；衔接；接点（常见于德语语境，如交通换乘或技术接口）"},"examples":[{"en":"In Germany, “Anschluss” can mean a train connection, like a transfer to another line.","zh":"在德国，“Anschluss”可以指火车的“衔接/换乘”，例如换乘到另一条线路。"},{"en":"Please check the Anschluss for this cable before turning the device on.","zh":"开机前请检查这根电缆的连接接口（Anschluss）。"}]},{"partOfSpeech":"n.","definition":{"en":"the annexation of Austria by Nazi Germany in 1938 (a specific historical meaning)","zh":"“德奥合并”：1938年纳粹德国吞并奥地利（特定历史含义）"},"examples":[{"en":"The Anschluss of 1938 changed Austria’s political future dramatically.","zh":"1938年的“德奥合并”（Anschluss）极大改变了奥地利的政治命运。"},{"en":"Many history books discuss the Anschluss as a key step toward World War II.","zh":"许多历史书把“德奥合并”（Anschluss）视为走向二战的重要一步。"}]}],"synonyms":["connection","link","junction","annexation (historical sense)"],"phonetic":"/ˈænʃlʊs/","extraExplanation":["“Anschluss”是德语词，字面核心是“连接/衔接”。在日常德语里常见于交通（换乘、接驳）和技术语境（接口、端口）。","历史专名“the Anschluss”通常特指1938年纳粹德国对奥地利的吞并；英文里常加定冠词 the，并大写 A（Anschluss）以表专指。"]}
{"word":"Anse","summary":{"en":"Anse is a rare noun meaning a loop/handle-like structure (often medical) or a small bay/cove (often in French-influenced place names).","zh":"Anse 是较少见的名词，可指（多为医学语境）环状/把手状结构，也可指小海湾/小港湾（常见于受法语影响的地名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a loop or handle-shaped part, especially in anatomy or surgery (a loop of tissue, a handle-like structure).","zh":"（尤用于解剖学/外科）环状或把手状的结构；（组织的）一段环、袢。"},"examples":[{"en":"The surgeon identified an anse of intestine that had twisted.","zh":"外科医生发现一段肠袢发生了扭转。"},{"en":"In older medical writing, anse can refer to a handle-like loop of tissue.","zh":"在较早的医学文献里，anse 可指把手状的组织环/袢。"}]},{"partOfSpeech":"n.","definition":{"en":"a small bay or cove (used especially in place names influenced by French).","zh":"小海湾；小港湾（多见于受法语影响的地名中）。"},"examples":[{"en":"They stayed near Anse Lazio, a famous beach cove.","zh":"他们住在著名海湾沙滩“Anse Lazio”附近。"},{"en":"Many coastal towns include “Anse” in their names to mean a cove.","zh":"许多海边城镇的名称里含有“Anse”，表示“小海湾”。"}]}],"synonyms":["loop","handle","cove","small bay"],"phonetic":"/æns/","extraExplanation":["“Anse”源自法语，原意与“把手/弯曲处”相关，因此在英语里既可能出现在（较少见的）医学用语中，也常见于法语地区或曾受法语影响地区（如加勒比、塞舌尔等）的地名，表示“海湾/小港”。在日常英语里这个词不常用。"]}
{"word":"Anseis","summary":{"en":"“Anseis” isn’t standard English; it’s probably a misspelling (often of “anxiety,” “anxious,” or “answers”) or a name.","zh":"“Anseis” 不是标准英语词；多半是拼写错误（常见是 “anxiety / anxious / answers”）或人名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a name/username; common intended words include “anxiety,” “anxious,” or “answers.”","zh":"不是标准英语单词。更可能是拼写错误或名字/用户名；常见的可能目标词包括 “anxiety（焦虑）”、“anxious（焦虑的）” 或 “answers（答案）”。"},"examples":[{"en":"I couldn’t find “anseis” in an English dictionary—did you mean “anxiety”?","zh":"我在英语词典里找不到 “anseis”——你是不是想写 “anxiety（焦虑）”？"},{"en":"If you meant “answers,” the correct spelling is a-n-s-w-e-r-s.","zh":"如果你想写 “answers（答案）”，正确拼写是 a-n-s-w-e-r-s。"}]}],"phonetic":"/ænˈseɪz/","extraExplanation":["“Anseis”也可能来自其他语言：例如在西班牙语里有带重音符号的形式 “anséis”（来自动词 ansiar，表示“你们渴望/你们盼望”）。如果你是在读西语文本或歌词里看到的，请告诉我上下文，我可以按西语用法解释。","如果你把它当作人名/网名使用，一般不需要“词义”；更需要的是读音和拼写确认。你可以发一句完整句子或截图，我可以帮你判断你真正想查的词。"]}
{"word":"anseis","summary":{"en":"“anseis” isn’t a recognized English word; it’s probably a misspelling (often of “anise” or “anxious”).","zh":"“anseis”不是常见英语单词；多半是拼写错误（常见可能是“anise”或“anxious”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. “anseis” is likely a misspelling. Common possibilities include “anise” (a spice) or “anxious” (worried).","zh":"不是标准英语单词。“anseis”很可能是拼写错误。常见可能是“anise”（茴香/八角茴香味的香料）或“anxious”（焦虑的、担心的）。"},"examples":[{"en":"Did you mean anise? It’s often used in cookies and tea.","zh":"你是不是想写 anise？它常用于饼干和茶里。"},{"en":"Did you mean anxious? She felt anxious before the exam.","zh":"你是不是想写 anxious？她在考试前感到焦虑。"}]}],"synonyms":["anise","anxious"],"phonetic":"/əˈnaɪs/","extraExplanation":["如果你能告诉我你看到“anseis”的句子或语境（比如一整句话/来源语言），我可以更准确判断它是否是：①拼写错误；②专有名词（人名/地名/品牌）；③其他语言的词（如西语/葡语等）。"]}
{"word":"Ansel","summary":{"en":"Ansel is mainly a male first name; it can also refer to famous people named Ansel (e.g., Ansel Adams).","zh":"Ansel 主要是男性名字；也可用来指代同名名人（如安塞尔·亚当斯）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A male given name, used mainly in Europe and North America.","zh":"男性名字，主要在欧洲和北美使用。"},"examples":[{"en":"Ansel introduced himself and shook my hand.","zh":"Ansel 自我介绍并和我握手。"},{"en":"Ansel is taking photography classes this semester.","zh":"Ansel 这学期在上摄影课。"}]},{"partOfSpeech":"n.","definition":{"en":"A name sometimes used in reference to notable people with this name (for example, Saint Anselm, a medieval theologian, or Ansel Adams, an American photographer).","zh":"有时用来指代同名名人（例如中世纪神学家“圣安瑟伦”Saint Anselm，或美国摄影师“安塞尔·亚当斯”Ansel Adams）。"},"examples":[{"en":"She wrote a report on Ansel Adams and his black-and-white landscape photos.","zh":"她写了一份关于安塞尔·亚当斯及其黑白风景摄影的报告。"},{"en":"In philosophy class, we briefly discussed Saint Anselm’s argument for God’s existence.","zh":"在哲学课上，我们简要讨论了圣安瑟伦关于上帝存在的论证。"}]}],"synonyms":["Anselm"],"phonetic":"ˈæn.səl","extraExplanation":["“Ansel”多被视为“Anselm”的简称或变体；“Anselm”来自古日耳曼语，常被解释为与“神（ans）/保护（helm）”相关，含义可理解为“受到神保护（的）”。","英语里人名一般首字母大写；在正式场合更常写全名（如 Ansel Adams），日常交流中直接用 Ansel 也很自然。"]}
{"word":"ansel","summary":{"en":"Ansel is mainly a male first name; it can also refer to Saint Anselm or the photographer Ansel Adams.","zh":"Ansel 主要是男性名字；也可指圣安瑟尔姆或摄影师安塞尔·亚当斯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name).","zh":"男性名字（名）。"},"examples":[{"en":"Ansel is a popular name in some Catholic families.","zh":"Ansel 在一些天主教家庭中是比较常见的名字。"},{"en":"My friend Ansel moved to California for work.","zh":"我的朋友 Ansel 为了工作搬到了加州。"}]},{"partOfSpeech":"n.","definition":{"en":"Saint Anselm (1033–1109), a Christian theologian and philosopher, later Archbishop of Canterbury.","zh":"圣安瑟尔姆（1033–1109），基督教神学家与哲学家，后任坎特伯雷大主教。"},"examples":[{"en":"In philosophy class, we read about Saint Anselm’s argument for God’s existence.","zh":"在哲学课上，我们学习了圣安瑟尔姆关于上帝存在的论证。"}]},{"partOfSpeech":"n.","definition":{"en":"Ansel Adams (1902–1984), a famous American photographer known for black-and-white landscapes of the American West.","zh":"安塞尔·亚当斯（1902–1984），美国著名摄影师，以拍摄美国西部黑白风景照闻名。"},"examples":[{"en":"The museum exhibited photographs by Ansel Adams.","zh":"博物馆展出了安塞尔·亚当斯的摄影作品。"}]}],"synonyms":["Anselm (related name)"],"phonetic":"/ˈæn.səl/","extraExplanation":["“Ansel”这个名字来自日耳曼语系，常被解释为与“神（ans）”和“保护/头盔（helm）”有关，整体有“神的保护”之类的含义。","在英语里它通常作为专有名词使用，所以一般不加复数，也不当作普通动词/形容词使用。"]}
{"word":"Ansela","summary":{"en":"Ansela is usually used as a personal name (and sometimes a surname) in English, but it is relatively uncommon.","zh":"Ansela 通常用作人名（有时也作姓氏），但在英语中相对少见。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a feminine given name (a personal name). It is uncommon in English and may be used as a variant spelling influenced by names like Angela or Ansel/Anselm.","zh":"女性名字（人名）。在英语中较少见，可能是受 Angela 或 Ansel/Anselm 等名字影响的变体拼写。"},"examples":[{"en":"Ansela is my cousin’s name.","zh":"Ansela 是我表妹的名字。"},{"en":"In the novel, Ansela is a quiet but determined character.","zh":"在那本小说里，Ansela 是个安静但很坚定的角色。"}]},{"partOfSpeech":"other","definition":{"en":"a family name (surname).","zh":"姓氏（家族名）。"},"examples":[{"en":"Dr. Ansela will speak at the conference.","zh":"Ansela 医生将在会议上发言。"}]}],"synonyms":["Angela","Ansel","Anselm","Anselma"],"phonetic":"/ænˈsɛlə/","extraExplanation":["“Ansela”更常见于特定家庭、地区或作品人物命名，并不是英语里非常固定、广泛使用的传统名字。","发音在英语中可能会有差异；如果这是某位具体人物/品牌/地名的拼写，最好参考其本人或官方的读法。"]}
{"word":"Anseline","summary":{"en":"Anseline is a rare proper name, usually a feminine form/variant of Anselm/Ansel, and it can also be a surname.","zh":"Anseline 是一个较少见的专有名词，通常作为 Anselm/Ansel 的女性形式或变体，也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare female given name (proper name), often seen as a French feminine form/variant of Anselm/Ansel","zh":"一个较少见的女性名字（专有名词），常被视为 Anselm/Ansel 的法语阴性形式或变体"},"examples":[{"en":"Anseline moved to Chicago for graduate school.","zh":"Anseline 为了读研究生搬去了芝加哥。"},{"en":"In the novel, Anseline is portrayed as calm and determined.","zh":"在小说里，Anseline 被刻画得冷静而坚定。"}]},{"partOfSpeech":"n.","definition":{"en":"a surname (family name), uncommon in modern English-speaking contexts","zh":"一个姓氏（家族姓），在现代英语语境中不太常见"},"examples":[{"en":"Dr. Anseline will present the research results tomorrow.","zh":"Anseline 博士将于明天展示研究结果。"}]}],"synonyms":["Ansel","Anselm","Anseline (variant spellings may exist)"],"phonetic":"/ˈæn.səˌliːn/","extraExplanation":["“Anseline”多被认为与“Ansel/Anselm”同源：源自日耳曼语元素 *ans*（神）与 *helm*（保护、头盔），整体含义可理解为“受神庇护/神之保护”。在法语传统里，-ine 常见于女性名词或女性名字的后缀，因此 Anseline 可看作更偏女性化的形式。","由于这是专有名词，实际读音会因地区与家庭习惯而变化；在英语环境中常按拼写读成类似“AN-suh-leen”。"]}
{"word":"Ansell","summary":{"en":"Ansell is usually a surname, and it can also refer to the safety-products brand/company Ansell.","zh":"Ansell 通常是一个姓氏；也可指以防护用品闻名的品牌/公司 Ansell（安思尔/安塞尔）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name).","zh":"一个姓氏（家族姓）。"},"examples":[{"en":"Dr. Ansell will see you now.","zh":"安塞尔医生现在要见你。"},{"en":"I met someone named Ansell at the conference.","zh":"我在会议上遇到一位姓安塞尔的人。"}]},{"partOfSpeech":"n.","definition":{"en":"a brand/company name, especially Ansell (Ansell Limited), known for making protective gloves and safety products.","zh":"一个品牌/公司名称，尤指 Ansell（安思尔/安塞尔公司），以生产防护手套和安全用品而知名。"},"examples":[{"en":"Please use Ansell gloves in the lab.","zh":"请在实验室使用安思尔（Ansell）手套。"},{"en":"The hospital закуп ordered Ansell surgical gloves.","zh":"医院采购了安思尔（Ansell）的外科手套。"}]}],"phonetic":"/ˈæn.səl/","extraExplanation":["“Ansell”常见于英语国家的人名（姓）。在实际阅读里，如果前后出现 Mr./Ms./Dr. 等称呼，多半是姓氏用法。","在医疗、实验室、工业安全等语境中，“Ansell”也常被当作品牌名使用，指该公司生产的防护手套、一次性用品等。遇到大写且后面跟着 product/gloves 等词时，通常是品牌含义。"]}
{"word":"Anselm","summary":{"en":"Anselm is a male given name; it is also used to refer to Saint Anselm, a major medieval theologian and philosopher.","zh":"Anselm 是一个男性名字；也常用来指圣安瑟尔姆——重要的中世纪神学家与哲学家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A male given name (first name), used in several European languages and in English.","zh":"男性名字（名），在多种欧洲语言中使用，英语里也可见。"},"examples":[{"en":"Anselm is a popular name in his family because it belonged to his grandfather.","zh":"安瑟姆是他家族里很受欢迎的名字，因为那是他祖父的名字。"},{"en":"She met Anselm during a summer program in Boston.","zh":"她在波士顿的暑期项目中认识了安瑟姆。"}]},{"partOfSpeech":"n.","definition":{"en":"Saint Anselm (c. 1033–1109), an Italian-born Christian theologian and philosopher who became Archbishop of Canterbury; known for influential writings on faith and reason.","zh":"圣安瑟尔姆（约1033–1109）：意大利出生的基督教神学家与哲学家，后任坎特伯雷大主教；以探讨信仰与理性关系的著作闻名。"},"examples":[{"en":"In class, we read a short passage by Anselm about faith and understanding.","zh":"课堂上，我们读了一段安瑟尔姆关于信仰与理解的短文。"},{"en":"The professor mentioned Anselm when introducing medieval philosophy.","zh":"教授在介绍中世纪哲学时提到了安瑟尔姆。"}]}],"synonyms":["Ansel"],"phonetic":"/ˈæn.sɛlm/","extraExplanation":["“Anselm”来自日耳曼语系人名，常被解释为与“神（或神圣）”与“保护/头盔”相关的词根组合，因此常见引申含义为“受神保护的人”。","在英语语境里，这个名字最常因“Saint Anselm（圣安瑟尔姆）”而被认识；他常与中世纪思想传统相联系。"]}
{"word":"anselm","summary":{"en":"Anselm is a male given name, and it often refers to Saint Anselm of Canterbury, a major medieval theologian and philosopher.","zh":"Anselm 是男性人名，也常特指坎特伯雷的圣安瑟伦——重要的中世纪神学家与哲学家。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A male given name (a personal name), used especially in European contexts.","zh":"男性名字（人名），在欧洲语境中较常见。"},"examples":[{"en":"Anselm is a traditional name that appears in medieval history.","zh":"Anselm 是一个传统名字，常见于中世纪历史中。"},{"en":"In this novel, Anselm is portrayed as a quiet scholar.","zh":"在这部小说里，Anselm 被刻画成一位安静的学者。"}]},{"partOfSpeech":"other","definition":{"en":"Most commonly refers to Saint Anselm of Canterbury (1033–1109), a Christian theologian and philosopher known for influential arguments about the existence of God.","zh":"最常指“坎特伯雷的圣安瑟伦”（Saint Anselm of Canterbury，1033–1109），基督教神学家与哲学家，以关于上帝存在的有影响力论证而闻名。"},"examples":[{"en":"In philosophy class, we discussed Anselm’s ontological argument.","zh":"在哲学课上，我们讨论了安瑟伦的“本体论论证”。"},{"en":"Anselm served as the Archbishop of Canterbury.","zh":"安瑟伦曾担任坎特伯雷大主教。"}]}],"phonetic":"/ˈæn.sɛlm/","extraExplanation":["“Anselm”源自中古拉丁语/日耳曼语人名元素，常被解释为与“神（ans-）”和“护具/头盔（-helm）”相关，因此有时会被民间理解为“神之护佑/保护”。","在英语学术语境里，“Anselm”经常直接用来指代安瑟伦本人或他的观点（如“Anselm’s argument”）。在写作中要注意大小写：作为人名必须大写。"]}
{"word":"Anselm-related","summary":{"en":"“Anselm-related” means connected with St. Anselm (or his ideas/writings), usually in academic discussion.","zh":"“Anselm-related”指与圣安瑟伦（及其思想或著作）有关，常用于学术讨论。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with Anselm—usually St. Anselm of Canterbury (1033–1109), his life, writings, or ideas (especially in philosophy and Christian theology).","zh":"与“安瑟伦（Anselm）”有关的——通常指坎特伯雷的圣安瑟伦（1033–1109）及其生平、著作或思想（尤其在哲学与基督教神学中）。"},"examples":[{"en":"The lecture focused on Anselm-related arguments about the existence of God.","zh":"这场讲座聚焦于与安瑟伦相关的上帝存在论证。"},{"en":"She is writing a paper on Anselm-related medieval theology.","zh":"她正在写一篇关于安瑟伦相关的中世纪神学的论文。"},{"en":"The library has several Anselm-related manuscripts and translations.","zh":"图书馆里有几份与安瑟伦相关的手稿与译本。"}]}],"synonyms":["related to Anselm","Anselmian","Anselmic (rare)"],"phonetic":"ˈæn.sɛlm rɪˈleɪ.tɪd","extraExplanation":["“Anselm-related”多见于学术语境（论文题目、课程描述、书目分类），表示“与安瑟伦的思想/文本/传统相关”。日常英语更常说“related to Anselm”或直接用“Anselmian（安瑟伦式的）”。","圣安瑟伦最常被提到的两点：①“本体论论证（ontological argument）”讨论上帝存在；②《为何上帝成了人》（Cur Deus Homo）中关于救赎与赎罪的思考。因此你在哲学、神学或中世纪史的材料里更容易看到这个表达。"]}
{"word":"Anselma","summary":{"en":"Anselma is a rare feminine first name related to Anselm.","zh":"Anselma 是一个较少见的女性名字，与 Anselm 相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feminine given name; a less common form related to the name Anselm","zh":"女性名字；较少见，与 Anselm（安瑟尔姆）相关的一种形式"},"examples":[{"en":"Anselma introduced herself at the meeting and wrote her name on the board.","zh":"Anselma 在会议上自我介绍，并把名字写在白板上。"},{"en":"In the novel, Anselma is a calm, thoughtful character.","zh":"在这部小说里，Anselma 是一个沉着、爱思考的角色。"}]}],"synonyms":["Anselm","Anselme"],"phonetic":"/ænˈsɛlmə/","extraExplanation":["“Anselma”通常被视为男性名“Anselm”的女性形式或变体。“Anselm”源自日耳曼语系姓名元素，常被解释为与“神（或神圣）”和“保护/头盔”相关的含义，因此可引申为“受神庇护”“神圣的保护”。","在英语语境中它相对少见，更可能在德语、意大利语或西班牙语等受欧洲姓名传统影响的地区或家庭中出现。作为名字使用时，通常不翻译含义，只音译或直接使用原拼写。"]}
{"word":"Anselme","summary":{"en":"Anselme is a French male given name (and sometimes a surname), equivalent to the English name Anselm.","zh":"Anselme 是法语男性名字（有时也作姓氏），相当于英文名 Anselm。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (especially French), equivalent to the English name Anselm.","zh":"男性名字（尤其常见于法语环境），相当于英文名 Anselm。"},"examples":[{"en":"Anselme is a common French form of the name Anselm.","zh":"Anselme 是 Anselm 这个名字在法语中的常见形式。"},{"en":"Anselme moved to Montreal and kept the French spelling of his name.","zh":"Anselme 搬到蒙特利尔后仍保留了自己名字的法语拼写。"}]},{"partOfSpeech":"n.","definition":{"en":"a surname (family name) found in some French-speaking regions.","zh":"姓氏（家族姓），在一些法语地区可见。"},"examples":[{"en":"The paper was written by Dr. Anselme.","zh":"这篇论文由 Anselme 博士撰写。"}]}],"synonyms":["Anselm"],"phonetic":"/ænˈsɛlm/","extraExplanation":["Anselme 源自中古法语/拉丁语传统，对应的英文形式是 Anselm。名字常被解释为“受神庇护/有神圣保护”的含义（常见拆解为 *ans* “神” + *helm* “头盔、保护”）。","历史与文化上，较知名的相关人物是中世纪神学家与哲学家“坎特伯雷的安瑟伦”（Saint Anselm of Canterbury）。法语语境中可能写作 Anselme，而英语语境更常见 Anselm。"]}
{"word":"Anselmi","summary":{"en":"Anselmi is most commonly an Italian-origin surname used as a proper name.","zh":"Anselmi 通常是意大利语来源的姓氏，用作专有名词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), most commonly Italian in origin","zh":"（常见为意大利语来源的）姓氏"},"examples":[{"en":"Professor Anselmi will lead today’s seminar.","zh":"安塞尔米教授将主持今天的研讨课。"},{"en":"I saw the name Anselmi on the mailbox.","zh":"我在信箱上看到了“Anselmi”这个姓。"}]},{"partOfSpeech":"n.","definition":{"en":"a name used in references to people, families, or organizations with the surname Anselmi","zh":"用于指代姓为 Anselmi 的个人、家族或机构的名称"},"examples":[{"en":"The Anselmi family has lived here for generations.","zh":"安塞尔米家族在这里住了好几代。"}]}],"phonetic":"/ænˈsɛlmi/","extraExplanation":["“Anselmi”多见于意大利姓氏体系，形式上像是从名字“Anselmo”的家族姓演变而来（意为“某某的后代/家族”这一类用法在意大利姓氏中很常见）。","在英语语境里，它通常不翻译意义，而是按原拼写音译或直接保留拼写（如人名、作者名、公司名）。"]}
{"word":"Anselmian","summary":{"en":"Connected with Saint Anselm or his philosophical/theological ideas; sometimes meaning a follower of Anselm.","zh":"与圣安瑟伦及其哲学/神学思想有关；有时也指安瑟伦思想的追随者。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Saint Anselm (Anselm of Canterbury) or his ideas, especially his work in Christian theology and philosophy (such as the ontological argument for God’s existence).","zh":"与圣安瑟伦（坎特伯雷的安瑟伦）或其思想有关的，尤指其在基督教神学与哲学中的观点（如“本体论证明”）。"},"examples":[{"en":"The professor assigned an Anselmian reading on faith and reason.","zh":"教授布置了一篇关于信仰与理性的安瑟伦式（安瑟伦相关）阅读材料。"},{"en":"Anselmian arguments are often discussed in philosophy of religion.","zh":"安瑟伦式论证常见于宗教哲学讨论中。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who follows or supports Saint Anselm’s theological or philosophical views.","zh":"支持或追随圣安瑟伦神学/哲学观点的人。"},"examples":[{"en":"Some Anselmians defend the ontological argument in modern form.","zh":"一些安瑟伦主义者用现代形式为本体论证明辩护。"}]}],"synonyms":["Anselm-related","Anselmian (ontological)","Scholastic (broader, not exact)"],"phonetic":"ænˈsɛlmiən","extraExplanation":["“Anselmian”来自拉丁化的人名 Anselm（安瑟伦）+ 形容词后缀 -ian，表示“与……有关/属于……的人”。","圣安瑟伦（约1033–1109）是中世纪重要的神学家与哲学家，常与“信仰寻求理解”（faith seeking understanding）这一思路联系在一起。","在学术写作中，Anselmian 常用于宗教哲学、神学、以及中世纪哲学语境；日常英语里很少使用。"]}
{"word":"anselmian","summary":{"en":"Anselmian means “connected with St. Anselm,” especially his philosophical and theological ideas.","zh":"Anselmian 指“与圣安瑟伦相关”，尤指他在哲学与神学中的思想与论证。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to St. Anselm (Anselm of Canterbury) or to his ideas, especially in philosophy and theology (for example, his arguments about God’s existence).","zh":"与圣安瑟伦（坎特伯雷的安瑟伦）或其思想有关的，尤指哲学与神学领域（如他关于上帝存在的论证）。"},"examples":[{"en":"The professor assigned a reading on Anselmian arguments for the existence of God.","zh":"教授布置了关于安瑟伦式（Anselmian）上帝存在论证的阅读材料。"},{"en":"Some students find the Anselmian approach to faith and reason challenging but influential.","zh":"一些学生觉得安瑟伦式（Anselmian）的信仰与理性观很难，但影响深远。"}]}],"synonyms":["Anselmic"],"phonetic":"/ænˈsɛlmiən/","extraExplanation":["“Anselmian”来自中世纪神学家与哲学家圣安瑟伦（St. Anselm, 1033–1109）。他最常被提到的是“本体论论证（ontological argument）”，试图用纯粹概念推理来说明上帝必然存在。","在学术写作里，“Anselmian”常用来标记一种思想来源（“出自安瑟伦/符合安瑟伦传统”），比日常英语更常见。也有人用较少见的同义形容词 “Anselmic”。"]}
{"word":"Anselmic","summary":{"en":"Anselmic means “connected with St. Anselm or his philosophical/theological ideas.”","zh":"Anselmic 指“与圣安瑟伦或其哲学/神学思想有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Saint Anselm of Canterbury (11th century) or his ideas, especially in philosophy and theology.","zh":"（形容词）与坎特伯雷的圣安瑟伦（11世纪）或其思想相关的，尤指哲学与神学领域。"},"examples":[{"en":"The professor assigned an Anselmic reading on the ontological argument.","zh":"教授布置了一篇关于“本体论证明”的安瑟伦式（Anselmic）阅读材料。"},{"en":"Her paper compares Anselmic theology with later medieval writers.","zh":"她的论文把安瑟伦式神学与后来的中世纪作家进行比较。"}]}],"synonyms":["Anselmian"],"phonetic":"/ænˈsɛlmɪk/","extraExplanation":["“Anselmic”主要用于学术语境，指向中世纪思想家圣安瑟伦（St. Anselm, 1033–1109）。他最常被提及的观点之一是“上帝存在的本体论证明”（ontological argument），因此在哲学史/神学史里常见到“Anselmic argument / Anselmic proof”等搭配。","更常见的近义形容词是“Anselmian”。在非学术写作中一般较少使用“Anselmic”。"]}
{"word":"Anselmo","summary":{"en":"Anselmo is a male given name, especially in Spanish/Italian usage, and can also refer to Saint Anselm.","zh":"Anselmo 是男性人名（西/意语常见），也可指圣安瑟尔姆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (a personal name), used especially in Spanish and Italian contexts; in English it’s the same name as “Anselm.”","zh":"男性名字（人名），在西班牙语和意大利语语境中常见；英语里相当于“Anselm”（安瑟尔姆）。"},"examples":[{"en":"Anselmo moved to California with his family when he was ten.","zh":"安塞尔莫十岁时和家人搬到了加州。"},{"en":"I met Anselmo at a community volunteer event.","zh":"我在一次社区志愿活动上认识了安塞尔莫。"}]},{"partOfSpeech":"n.","definition":{"en":"(often capitalized) a reference to Saint Anselm (1033–1109), a medieval Christian theologian and philosopher; “Anselmo” is the Spanish/Italian form of his name.","zh":"（常大写）指“圣安瑟尔姆”（1033–1109），中世纪基督教神学家与哲学家；“Anselmo”是其名字的西班牙语/意大利语形式。"},"examples":[{"en":"In class we briefly discussed Saint Anselm and his arguments about faith and reason.","zh":"课上我们简单讨论了圣安瑟尔姆以及他关于信仰与理性的论证。"},{"en":"The church was named after San Anselmo.","zh":"这座教堂以圣安塞尔莫命名。"}]}],"synonyms":["Anselm"],"phonetic":"/ɑnˈsɛlmoʊ/","extraExplanation":["“Anselmo/Anselm”源自日耳曼语系名字，常被解释为由表示“神/神明”的成分（ans）与表示“头盔/保护”的成分（helm）组合而成，因此常被引申为“受神保护的人”等含义。","在英语里更常见的拼法是 Anselm；在西班牙语和意大利语里常见 Anselmo。美国加州也有地名“San Anselmo”（圣安塞尔莫）。"]}
{"word":"Anser","summary":{"en":"Anser is the scientific genus name for certain geese.","zh":"Anser 是某些雁类的属名（学名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of large geese (family Anatidae), including species such as the greylag goose","zh":"（生物分类）雁属：一种大型雁类的属名（鸭科），包括灰雁等物种"},"examples":[{"en":"The greylag goose belongs to the genus Anser.","zh":"灰雁属于雁属（Anser）。"},{"en":"In older field guides, several geese were listed under Anser.","zh":"在较早的野外图鉴中，有几种雁被列在雁属（Anser）之下。"}]}],"synonyms":["goose (general term)","genus of geese"],"phonetic":"/ˈænsər/","extraExplanation":["“Anser”是拉丁语来源的学名用法，常见于生物学/观鸟语境，日常英语里不常用。","如果你想输入的是常用词“answer（回答）”，拼写应为 answer（/ˈænsər/）。两者发音相同但含义完全不同。"]}
{"word":"anser","summary":{"en":"Anser is a scientific word meaning a genus of geese; it can also mean “goose” in older/literary usage.","zh":"Anser 是一个科学用词，指雁属/鹅属；在较古或文学语境中也可指“鹅/雁”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of geese (scientific name used in biology) and, by extension, a goose in older or literary English","zh":"（生物学）雁属/鹅属（Anser，学名）；引申为（较古或文学用法）“鹅/雁”"},"examples":[{"en":"In biology class, we learned that the greylag goose is Anser anser.","zh":"在生物课上，我们学到灰雁的学名是 Anser anser。"},{"en":"The old poem mentions an anser by the river.","zh":"那首古诗里提到河边有一只“anser”（鹅/雁）。"}]}],"synonyms":["goose","wild goose","waterfowl"],"phonetic":"/ˈænsər/","extraExplanation":["“Anser”来自拉丁语，意思是“鹅”。它常见于学名（拉丁名）中，例如 Anser anser（灰雁）。","很多学习者把 anser 和 answer 混淆：answer（/ˈænsər/）是“回答”，而 anser 是“鹅/雁”（多见于科学或文学语境）。"]}
{"word":"anserated","summary":{"en":"Anserated is a rare adjective meaning “having a serrated edge shaped like a goose’s bill.”","zh":"Anserated 是一个罕见的形容词，意思是“边缘呈锯齿状且形似鹅喙的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, technical) Having a serrated or toothed edge shaped like a goose’s bill; goose-billed.","zh":"（罕见/术语）边缘呈锯齿状或具齿状突起，形似鹅喙的；鹅喙状的。"},"examples":[{"en":"In older botanical descriptions, a leaf margin may be called anserated when the teeth resemble a goose’s bill.","zh":"在较早的植物学描写中，如果叶缘的齿状突起像鹅喙，可能会用 anserated 来形容。"},{"en":"The shell was described as anserated along the rim, with small beak-like notches.","zh":"这枚贝壳的边缘被描述为 anserated，周缘有一些像喙一样的小缺刻。"}]}],"synonyms":["serrated","toothed","dentate","beaked"],"phonetic":"/ˈæn.səˌreɪ.tɪd/","extraExplanation":["这个词非常少见，多见于较旧的博物学/植物学文献。","词源来自拉丁语 anser（“鹅”）+ -ated（“具有……的”）。现代更常用的近义术语通常是 serrated（锯齿状的）、toothed（有齿的）或 beaked（喙状的，视语境而定）。"]}
{"word":"Anseres","summary":{"en":"Anseres is an older scientific term for the waterfowl group (ducks, geese, swans), now usually called Anseriformes.","zh":"Anseres 是较旧的科学分类名称，指鸭、鹅、天鹅等水禽类群，如今多用 Anseriformes（雁形目）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former scientific name for an order of birds that includes ducks, geese, and swans; essentially the waterfowl (now usually called Anseriformes).","zh":"鸟类分类学中曾用的一个“目”名，指鸭、鹅、天鹅等水禽；如今通常用名称为 Anseriformes（雁形目）。"},"examples":[{"en":"In older biology books, Anseres is used for the group that includes ducks, geese, and swans.","zh":"在较早的生物学教材里，Anseres 用来指包含鸭、鹅、天鹅的那一类。"},{"en":"Many birds people call “waterfowl” were classified under Anseres in some earlier systems.","zh":"人们常说的“水禽”里，有许多在一些早期分类系统中被归入 Anseres。"}]}],"synonyms":["waterfowl","Anseriformes"],"phonetic":"/ænˈsɛriz/","extraExplanation":["“Anseres”源自拉丁语 anser（“鹅”）。在现代鸟类分类中更常见的名称是 Anseriformes（雁形目）。你在论文或书籍里见到 Anseres，往往意味着该资料较旧，或是在讨论历史分类体系。"]}
{"word":"anseres","summary":{"en":"Answer (plural: answers) means a response or solution, and it can also be the verb meaning to respond.","zh":"Answer（复数 answers）指“回答/答案/解决办法”，也可作动词表示“回答、接（电话）、回复”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A response to a question, problem, or request.","zh":"对问题、难题或请求的回答；答案。"},"examples":[{"en":"What’s the answer to question 3?","zh":"第3题的答案是什么？"},{"en":"We finally found an answer to the problem.","zh":"我们终于找到了这个问题的解决办法。"}]},{"partOfSpeech":"v.","definition":{"en":"To respond to someone by speaking, writing, or acting.","zh":"回答（某人）；回应（说话、写作或行动）。"},"examples":[{"en":"Please answer the phone.","zh":"请接电话。"},{"en":"She didn’t answer my message.","zh":"她没有回复我的消息。"}]}],"synonyms":["reply","response","solution"],"phonetic":"/ˈæn.sɚ/","extraExplanation":["你输入的“anseres”很可能是拼写错误，正确拼法通常是 “answers”（answer 的复数）或 “answer”（原形）。如果你想查的是别的词，也可以告诉我上下文句子。"]}
{"word":"anseriform","summary":{"en":"Anseriform means “goose-like” or “related to ducks, geese, and swans (Anseriformes),” and it can also refer to a bird in that order.","zh":"anseriform 指“像鹅的”或“与鸭、鹅、天鹅等雁形目（Anseriformes）相关的”，也可作名词指雁形目鸟类。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(zoology) Related to, resembling, or characteristic of geese and their close relatives (the group that includes ducks, geese, and swans).","zh":"（动物学）与雁形目（包括鸭、鹅、天鹅等）有关的；像鹅类的；具有鸭鹅天鹅等特征的。"},"examples":[{"en":"Ducks, geese, and swans are anseriform birds.","zh":"鸭、鹅和天鹅都是雁形目（anseriform）的鸟类。"},{"en":"The scientist compared the fossil’s beak to modern anseriform species.","zh":"科学家把这块化石的喙与现代雁形目物种作了比较。"}]},{"partOfSpeech":"n.","definition":{"en":"An anseriform bird (a member of the order Anseriformes).","zh":"雁形目鸟类；雁形目（Anseriformes）的一员。"},"examples":[{"en":"Anseriforms are often found near lakes and wetlands.","zh":"雁形目鸟类常见于湖泊和湿地附近。"}]}],"synonyms":["anserine","goose-like","waterfowl (contextual)"],"phonetic":"/ænˈsɛrɪfɔrm/","extraExplanation":["“anseriform”常见于生物学/鸟类学的正式语境；日常英语更常说“duck/goose/swan”或“waterfowl（水禽）”。","词源：来自拉丁语“anser”（鹅）+ “-form”（形状/类型），字面意思是“像鹅的/鹅形的”。"]}
{"word":"Anseriformes","summary":{"en":"Anseriformes is the scientific name for the bird order that includes ducks, geese, and swans.","zh":"Anseriformes 是雁形目（鸟类“目”级分类）的学名，包含鸭、鹅、天鹅等水禽。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A scientific (Latin) name for an order of birds that includes ducks, geese, swans, and some related waterfowl.","zh":"（拉丁学名）鸟类的一个“目”（分类等级），包括鸭、鹅、天鹅等多种水禽及其近缘类群。"},"examples":[{"en":"Ducks, geese, and swans belong to the order Anseriformes.","zh":"鸭、鹅和天鹅属于雁形目（Anseriformes）。"},{"en":"Many Anseriformes are adapted to life on lakes and wetlands.","zh":"许多雁形目鸟类适应在湖泊和湿地生活。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A way to refer collectively to animals in that bird order, especially in biology or ecology writing.","zh":"（较少见）在生物学或生态学语境中，用来统称“雁形目”这一类群的动物。"},"examples":[{"en":"The researchers compared the diets of several Anseriformes during migration.","zh":"研究人员比较了多种雁形目鸟类在迁徙期间的食性。"}]}],"synonyms":["waterfowl (general term)","order Anseriformes","anseriform birds"],"phonetic":"/ˌæn.sə.rɪˈfɔːr.miːz/","extraExplanation":["“Anseriformes”是拉丁化的科学名称，常用于学术写作与分类学：其中“anser-”与拉丁语“鹅”有关。英文里经常把它当作一个整体名词使用（即使形式看起来像复数）。","在生物分类中，“目（order）”高于“科（family）”、低于“纲（class）”。因此你可能会在科普或论文中看到它用来归类许多水禽。"]}
{"word":"anseriformes","summary":{"en":"Anseriformes is the scientific order that includes ducks, geese, and swans.","zh":"Anseriformes（雁形目）是包括鸭、鹅、天鹅等在内的鸟类“目”级科学分类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific order of birds that includes ducks, geese, and swans (typically waterfowl with webbed feet).","zh":"雁形目：鸟类的一个科学分类“目”，包括鸭、鹅和天鹅等（多为有蹼的水鸟）。"},"examples":[{"en":"Ducks and geese belong to the order Anseriformes.","zh":"鸭和鹅属于雁形目（Anseriformes）。"},{"en":"The museum’s exhibit compares Anseriformes with other waterfowl groups.","zh":"博物馆的展览将雁形目与其他水鸟类群作比较。"}]}],"synonyms":["waterfowl (general term)","duck-and-goose order (informal)"],"phonetic":"/ˌæn.sɚ.ɪˈfɔɹ.miːz/","extraExplanation":["“Anseriformes”是拉丁化的科学名称：anser- 与“鹅”有关（源自拉丁语 anser，意为“鹅”），-formes 表示“形态/类型”。在日常英语中更常用的是 waterfowl（水禽）或 ducks and geese（鸭和鹅）来表达。","在生物分类中，order（目）是一个比 family（科）更大的层级；因此 Anseriformes 指的是一个较大的分类群，而不是某一种具体鸟。"]}
{"word":"anserin","summary":{"en":"Anserine means “related to geese,” and figuratively (often in literary use) “goose-like, silly or foolish.”","zh":"Anserine 意为“与鹅有关的”，也可作比喻（常见于文学语境）指“像鹅一样的、愚蠢可笑的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to geese (the bird family that includes geese).","zh":"与鹅有关的；鹅的。"},"examples":[{"en":"The wetland is home to many anserine birds, especially geese in winter.","zh":"这片湿地是许多鹅类鸟类的栖息地，尤其在冬天有很多鹅。"},{"en":"Researchers recorded anserine migration patterns along the river.","zh":"研究人员记录了沿河的鹅类迁徙模式。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative, often literary) Silly, clumsy, or foolish in a way that suggests a goose.","zh":"（比喻义，常见于文学语境）愚蠢的；笨拙可笑的（像鹅一样）。"},"examples":[{"en":"He made an anserine remark that broke the serious mood.","zh":"他讲了一句愚蠢可笑的话，打破了严肃的气氛。"},{"en":"The novel mocks the character’s anserine pride.","zh":"小说嘲讽了这个角色愚蠢的自尊。"}]}],"synonyms":["goose-like","foolish","silly","clumsy"],"phonetic":"/ˈænsəˌraɪn/","extraExplanation":["“anserine”来自拉丁语 anser（鹅）。在科学写作里多用于“与鹅有关的”；在较文学或带批评的语境里，可引申为“像鹅一样傻/笨拙”。","你输入的“anserin”常被当作“anserine”的拼写变体或缩写；标准英文拼写通常是 anserine。"]}
{"word":"Anserinae","summary":{"en":"Anserinae is a taxonomic subfamily within Anatidae, covering geese (and often swans).","zh":"Anserinae 指鸭科中的一个分类“亚科”，主要涵盖雁/鹅（在一些体系中也包含天鹅）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a subfamily of the duck family (Anatidae) that includes the geese (and, in many classifications, the swans)","zh":"雁亚科（鸭科的一亚科），包括各类“雁/鹅”；在不少分类体系中也包括天鹅"},"examples":[{"en":"Many field guides place geese in the subfamily Anserinae.","zh":"许多野外鸟类图鉴把雁/鹅归入雁亚科（Anserinae）。"},{"en":"In some modern taxonomies, swans are also treated as part of Anserinae.","zh":"在一些现代分类法中，天鹅也被视为雁亚科（Anserinae）的一部分。"}]}],"synonyms":["goose subfamily","Anatidae: Anserinae"],"phonetic":"/ˌænsəˈraɪni/","extraExplanation":["“Anserinae”来自拉丁语 anser（意为“鹅/雁”）+ 动物分类学常用后缀 -inae（表示“亚科”）。","不同学术体系对“雁亚科”的范围划分略有差异：有的仅指雁/鹅，有的会把天鹅也并入其中；写作时可根据你采用的分类参考来源注明。"]}
{"word":"anserinae","summary":{"en":"Anserinae is the taxonomic subfamily that includes swans and true geese.","zh":"Anserinae 指包含天鹅与真雁的“雁亚科”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific (taxonomic) subfamily of the duck family (Anatidae) that includes swans and the “true geese.”","zh":"（生物分类）雁亚科：鸭科（Anatidae）中的一个亚科，包含天鹅和“真雁”（常见的雁类）。"},"examples":[{"en":"Swans are commonly placed in the subfamily Anserinae in traditional classifications.","zh":"在传统分类中，天鹅常被归入雁亚科（Anserinae）。"},{"en":"The paper compares feeding behavior across Anatidae, including Anserinae.","zh":"这篇论文比较了鸭科（Anatidae）不同类群的取食行为，包括雁亚科（Anserinae）。"}]}],"synonyms":["goose-and-swan subfamily","subfamily Anserinae"],"phonetic":"/ˌæn.səˈriː.niː/","extraExplanation":["“Anserinae”是拉丁化的分类名称：anser 意为“鹅/雁”，后缀 -inae 用于动物分类学中的“亚科”。在不同分类体系里，其范围与内部划分可能会有调整，但通常都与天鹅、雁类相关。"]}
{"word":"anserine","summary":{"en":"Anserine means “goose-related/goose-like,” and it can also mean “silly or foolish” in a formal, literary way.","zh":"Anserine 的常见意思是“与鹅有关/像鹅的”，也可作较书面的贬义词表示“愚蠢的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a goose or geese; goose-like.","zh":"与鹅有关的；像鹅的。"},"examples":[{"en":"The museum displayed an anserine figure carved from bone.","zh":"博物馆展出了一件用骨头雕刻的鹅形（anserine）雕像。"},{"en":"In anatomy, “pes anserinus” refers to a tendon area named for its goose-foot shape.","zh":"在解剖学中，“pes anserinus（鹅足）”指因形似鹅脚而得名的一处肌腱区域。"}]},{"partOfSpeech":"adj.","definition":{"en":"Silly or foolish, especially in a dull or awkward way.","zh":"愚蠢的；傻的（常指笨拙、迟钝的那种）。"},"examples":[{"en":"His anserine comments made the discussion feel pointless.","zh":"他那些愚蠢的评论让讨论显得毫无意义。"},{"en":"She apologized for the anserine joke that offended people.","zh":"她为那个冒犯他人的愚蠢玩笑道了歉。"}]},{"partOfSpeech":"n.","definition":{"en":"A plant also known as silverweed (Potentilla anserina).","zh":"银委陵菜（又称银草；学名 Potentilla anserina）。"},"examples":[{"en":"Anserine grows in damp ground near rivers and paths.","zh":"银委陵菜（anserine）常生长在河边或小路旁的潮湿地带。"}]}],"synonyms":["goose-like","foolish","silly","inane"],"phonetic":"/ˈænsəˌraɪn/","extraExplanation":["“Anserine”来自拉丁语 anser（鹅）。因此它既可以指“与鹅有关/像鹅”，也能引申为“像鹅一样傻”（带有贬义、较书面）。","医学里常见的相关术语是 pes anserinus（鹅足），用于描述形状像鹅脚的结构；在阅读医学或运动损伤资料时会遇到。"]}
{"word":"anserines","summary":{"en":"Anserine means “goose-like” or “related to geese,” and more rarely it can mean “silly or foolish.”","zh":"Anserine 意为“像鹅的/与鹅有关的”，较少情况下也可比喻“愚蠢的、傻气的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to, resembling, or characteristic of a goose.","zh":"与鹅有关的；像鹅的；具有鹅特征的。"},"examples":[{"en":"The illustrator gave the bird an anserine neck and waddling walk.","zh":"插画家把那只鸟画成了鹅一样的脖子和摇摆的步态。"},{"en":"The museum displayed anserine bones from several waterfowl species.","zh":"博物馆展出了几种水禽的鹅类骨骼。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative, rare) Silly, foolish, or awkward—like a goose.","zh":"（比喻，较少用）愚蠢的；傻气的；笨拙的（像鹅一样）。"},"examples":[{"en":"He made an anserine remark that stopped the conversation for a moment.","zh":"他一句傻气的评论让谈话一度停住了。"},{"en":"The critic called the plot anserine and predictable.","zh":"评论家说情节又蠢又老套。"}]},{"partOfSpeech":"other","definition":{"en":"In anatomy, “anserine” can refer to the “goose’s foot” area where several tendons join near the knee (often in the phrase “pes anserinus”).","zh":"（解剖）可指膝盖附近多条肌腱汇合的“鹅足”区域（常见于短语 pes anserinus）。"},"examples":[{"en":"The doctor mentioned pain near the pes anserinus (anserine) region.","zh":"医生提到他在鹅足（anserine）区域附近有疼痛。"}]}],"synonyms":["goose-like","goosy","foolish (figurative sense)","silly (figurative sense)"],"phonetic":"/ˈænsəˌraɪn/","extraExplanation":["“anserine”来自拉丁语 anser（鹅）。因此它既可作字面意义“与鹅有关”，也偶尔被用作比喻，表达“像鹅一样傻气/笨拙”的语感。","你输入的“anserines”通常是复数形式：例如 anserine features（鹅类特征）→ anserines 在特定语境中指“多种鹅类特征/多处与鹅相关的东西”。更常见的词形还是 anserine（形容词单数）。"]}
{"word":"Ansermet","summary":{"en":"Ansermet is the surname of Ernest Ansermet, a notable Swiss conductor associated with major recordings of French and Russian classical music.","zh":"Ansermet 指瑞士著名指挥家埃内斯特·安塞美的姓氏，常见于法俄古典音乐的重要录音与乐评中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Ernest Ansermet (1883–1969), a Swiss conductor best known for leading L’Orchestre de la Suisse Romande and for his influential recordings of French and Russian music (especially Debussy, Ravel, and Stravinsky).","zh":"埃内斯特·安塞美（Ernest Ansermet，1883–1969），瑞士指挥家，以长期执掌“瑞士罗曼德管弦乐团”及录制法俄作品（尤以德彪西、拉威尔、斯特拉文斯基）而闻名。"},"examples":[{"en":"I’ve been listening to Ansermet’s recordings of Debussy to learn how French orchestral colors can sound.","zh":"我一直在听安塞美指挥录制的德彪西作品，想体会法式管弦乐的色彩感。"},{"en":"The library has an old Stravinsky album conducted by Ansermet.","zh":"图书馆里有一张安塞美指挥的斯特拉文斯基老唱片。"}]}],"synonyms":["Ernest Ansermet"],"phonetic":"/ˈɑːnsərmeɪ/","extraExplanation":["“Ansermet”常见于古典音乐语境：唱片封面、曲目表、乐评里会写“Ansermet conducts …（安塞美指挥……）”。","他与斯特拉文斯基关系密切，早期曾频繁演出并推广其作品；因此在20世纪录音史与现代音乐传播中很有地位。","英文里这是姓氏，首字母大写；中文常译为“安塞美”。"]}
{"word":"anserous","summary":{"en":"Anserous means “goose-related” or “goose-like,” used mostly in scientific contexts.","zh":"Anserous 指“与鹅有关/像鹅的”，多用于科学或生物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to, resembling, or characteristic of geese (the genus *Anser*).","zh":"与鹅有关的；像鹅的；具有鹅特征的（源自鹅属 *Anser*）。"},"examples":[{"en":"The museum displayed an anserous bird from the Arctic.","zh":"博物馆展出了一只来自北极地区、形态像鹅的鸟。"},{"en":"The lake attracts many anserous species during migration season.","zh":"迁徙季节，这个湖吸引了许多鹅类（似鹅的）物种。"}]}],"synonyms":["goose-like","of geese","anserine"],"phonetic":"/ænˈsɪrəs/","extraExplanation":["“anserous”来自拉丁语 *anser*（鹅）。它是一个比较罕见、偏学术/生物学用语，日常英语里通常更常说“goose-like”（像鹅的）或直接说“related to geese”（与鹅有关的）。","在鸟类学（ornithology）语境中，它可能用来概括与鹅有关的特征或类群，但普通写作中不常用。"]}
{"word":"Ansgar","summary":{"en":"Ansgar is a male given name; it can also refer to Saint Ansgar, a key early missionary in Scandinavia.","zh":"Ansgar 是男性名字；也可指圣安斯加尔——在斯堪的纳维亚早期传教史上很重要的人物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A masculine given name (first name), used mainly in Northern Europe.","zh":"男性名字（名），主要见于北欧等地区。"},"examples":[{"en":"Ansgar is a common-sounding Scandinavian name, though it’s not as widespread as Erik or Lars.","zh":"Ansgar 听起来很有斯堪的纳维亚风格，不过没有 Erik 或 Lars 那么常见。"},{"en":"Ansgar introduced himself and spelled his name for the class.","zh":"Ansgar 做自我介绍时，还给全班拼读了自己的名字。"}]},{"partOfSpeech":"n.","definition":{"en":"Ansgar (Saint Ansgar, c. 801–865): a Christian missionary and archbishop known for early missions in Denmark and Sweden; sometimes called the “Apostle of the North.”","zh":"安斯加尔（圣安斯加尔，约801–865）：基督教传教士与大主教，以在丹麦、瑞典的早期传教活动闻名，有时被称为“北方的使徒”。"},"examples":[{"en":"In medieval history, Saint Ansgar is remembered for bringing Christianity to parts of Scandinavia.","zh":"在中世纪历史中，圣安斯加尔因将基督教带到斯堪的纳维亚部分地区而被人们记住。"},{"en":"The book mentions Ansgar’s travels between the Frankish Empire and Sweden.","zh":"书中提到安斯加尔在法兰克帝国与瑞典之间的旅行。"}]}],"phonetic":"/ˈænzɡɑr/","extraExplanation":["“Ansgar”常被认为来自日耳曼语源：ans-（神、神祇）+ -gar（矛），整体有“神之矛”的含义。","作为历史人物的圣安斯加尔在英语写作里常出现于“medieval Europe（中世纪欧洲）”“missionary work（传教活动）”“Scandinavia（斯堪的纳维亚）”等主题中。"]}
{"word":"Ansgarius","summary":{"en":"Ansgarius is a Latinized name for Ansgar, especially referring to Saint Ansgar, an early missionary to Scandinavia.","zh":"Ansgarius 是 Ansgar 的拉丁化名字，尤指“圣安斯加尔”，一位早期前往斯堪的纳维亚的传教士。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper name) The Latinized form of Ansgar, especially used for Saint Ansgar (801–865), a Christian missionary and archbishop known as the “Apostle of the North” for helping spread Christianity in Scandinavia.","zh":"（专有名词）Ansgar 的拉丁化形式，尤指“圣安斯加尔”（801–865）：一位基督教传教士与大主教，因推动基督教在斯堪的纳维亚传播而被称为“北方使徒”。"},"examples":[{"en":"Ansgarius is the Latin name often used in medieval church writings for Saint Ansgar.","zh":"Ansgarius 是中世纪教会文献中常用来指“圣安斯加尔”的拉丁名字。"},{"en":"In some histories, Ansgarius is described as a key missionary to Denmark and Sweden.","zh":"在一些历史著作中，Ansgarius 被描述为前往丹麦与瑞典的重要传教士。"}]}],"synonyms":["Ansgar","Saint Ansgar"],"phonetic":"/ænˈskɛriəs/","extraExplanation":["“Ansgarius”常见于拉丁文史料或教会文献中；现代英文更常写作“Ansgar”或“Saint Ansgar”。","他与汉堡—不来梅教会体系的早期历史有关，常被提及于北欧基督教化（Christianization of Scandinavia）的叙述中。","若你是在某本书、碑铭、或家谱里看到该词，它很可能是人名（圣名/洗礼名）的拉丁写法，而不是普通英文词汇。"]}
{"word":"Anshan","summary":{"en":"Anshan is a city in Liaoning, China; it’s also the pinyin spelling of 鞍山 (“Saddle Mountain”).","zh":"Anshan 是中国辽宁省的一座城市；也可指“鞍山（鞍山=马鞍形的山）”这一地名的拼音写法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in Liaoning Province, northeastern China, known historically for its steel industry.","zh":"（中国）辽宁省的一个城市，位于东北地区，历史上以钢铁工业闻名。"},"examples":[{"en":"Anshan is in Liaoning Province, not far from Shenyang.","zh":"鞍山在辽宁省，离沈阳不远。"},{"en":"Many people associate Anshan with China’s early steel development.","zh":"很多人会把鞍山和中国早期的钢铁发展联系在一起。"}]},{"partOfSpeech":"n.","definition":{"en":"A common romanization (pinyin) for the Chinese place name “鞍山,” meaning “Saddle Mountain.”","zh":"“鞍山”的常见拼音写法，字面意思是“马鞍形的山”。"},"examples":[{"en":"The Chinese name for Anshan is written as 鞍山.","zh":"Anshan 的中文写法是“鞍山”。"},{"en":"In pinyin, 鞍山 is written as Anshan.","zh":"按拼音，“鞍山”写作 Anshan。"}]}],"synonyms":["鞍山","An-shan (older hyphenated style)"],"phonetic":"ˈɑnˌʃɑn","extraExplanation":["“鞍山”常被称为“钢都”，与“鞍钢（Ansteel）”关系密切；在近现代工业史语境里经常出现。","在英文写作中，Anshan 通常作为专有名词首字母大写；如果指“鞍山钢铁公司”，常见写法为 Ansteel 或 Anshan Iron and Steel。"]}
{"word":"Anshanite","summary":{"en":"Anshanite means a person from Anshan, or something related to Anshan (Liaoning, China).","zh":"Anshanite 指“鞍山人”，也可作形容词表示“鞍山的/与鞍山有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Anshan (a city in Liaoning Province, China).","zh":"鞍山人；来自中国辽宁省鞍山市的人。"},"examples":[{"en":"She’s an Anshanite who moved to Beijing for college.","zh":"她是鞍山人，后来去北京上大学。"},{"en":"Many Anshanites are familiar with the city’s steel industry history.","zh":"很多鞍山人都很熟悉这座城市的钢铁工业历史。"}]},{"partOfSpeech":"adj.","definition":{"en":"from or related to Anshan.","zh":"鞍山的；与鞍山有关的。"},"examples":[{"en":"We tried an Anshanite restaurant that serves Liaoning-style dishes.","zh":"我们去了一家鞍山风味的餐馆，主打辽宁菜。"},{"en":"Anshanite culture reflects the broader traditions of Northeast China.","zh":"鞍山的文化体现了中国东北更广泛的传统。"}]}],"synonyms":["(n.) Anshan resident","(n.) person from Anshan","(adj.) of Anshan","(adj.) from Anshan"],"phonetic":"ænˈʃæn.aɪt","extraExplanation":["“Anshanite”是按英语常见的“地名 + -ite”构词方式形成的“居民称呼/所属形容词”（类似 Beijing → Beijinger/Beijingite）。不过在实际英语里，这个词并不算常见；更常见的说法是 “a person from Anshan” 或 “an Anshan resident”。","鞍山（Anshan）在英语语境中常因钢铁工业而被提及，有时也会看到 “the steel city” 之类的称呼。"]}
{"word":"Anshar","summary":{"en":"Anshar is a spelling variant of “Ansar,” meaning “the Helpers,” especially the people of Medina who supported the Prophet Muhammad and early Muslims.","zh":"Anshar 是 “Ansar（安萨尔）” 的一种拼写变体，意为“辅士/援助者”，尤指在伊斯兰史中支持穆罕默德先知与早期穆斯林的麦地那人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Islam, history) The Ansar: the people of Medina who supported and protected the Prophet Muhammad and the early Muslim community after the migration (Hijra) from Mecca.","zh":"（伊斯兰史）“辅士/援助者”（安萨尔）：指麦地那的居民，他们在穆罕默德先知及早期穆斯林从麦加迁徙（希吉拉）后，给予支持与保护。"},"examples":[{"en":"The Ansar welcomed the migrants from Mecca and helped them settle in Medina.","zh":"安萨尔欢迎来自麦加的迁徙者，并帮助他们在麦地那安顿下来。"},{"en":"In Islamic history lessons, you may read about the Muhajirun and the Ansar.","zh":"在伊斯兰历史课中，你可能会读到“穆哈吉伦”（迁士）和“安萨尔”（辅士）。"}]},{"partOfSpeech":"n.","definition":{"en":"A transliteration variant of “Ansar,” sometimes used as a personal name or in group names.","zh":"“Ansar”的一种音译写法（Anshar），有时用作人名或组织/团体名称的一部分。"},"examples":[{"en":"His name is Anshar, a spelling variant of Ansar.","zh":"他叫 Anshar，这是 Ansar 的一种拼写变体。"},{"en":"Some organizations use “Anshar” in their name to suggest “supporters” or “helpers.”","zh":"有些组织在名称中使用 “Anshar”，用来表达“支持者/援助者”的含义。"}]}],"synonyms":["Ansar","the Helpers"],"phonetic":"/ɑnˈsɑr/","extraExplanation":["“安萨尔”（الأنصار al-Anṣār）在阿拉伯语里本义是“帮助者/支持者”。在伊斯兰传统中，它特指麦地那的两大部族（奥斯与哈兹拉季）及其成员对早期穆斯林的支持。","英文里常见拼写是 Ansar；Anshar 属于另一种转写方式（不同语言/地区会用不同字母组合来表示同一阿拉伯语发音）。"]}
{"word":"ANSI","summary":{"en":"ANSI most commonly means the American National Standards Institute, and by extension its standards; in computing it can also refer to ANSI terminal/escape-code conventions.","zh":"ANSI 通常指美国国家标准学会及其标准；在计算机领域也常指 ANSI 终端/转义码等规范。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the American National Standards Institute, a U.S. organization that develops and coordinates voluntary standards (rules and specifications) for products, services, and technology","zh":"美国国家标准学会（ANSI），一个制定并协调美国各行业自愿性标准（规则与规范）的机构"},"examples":[{"en":"This monitor is ANSI-compliant for color and brightness testing.","zh":"这款显示器在色彩与亮度测试方面符合 ANSI 标准。"},{"en":"The company follows ANSI safety standards in its factories.","zh":"这家公司在工厂里遵循 ANSI 安全标准。"}]},{"partOfSpeech":"n.","definition":{"en":"a general label for standards published by ANSI (often seen in names like “ANSI standard” or “ANSI X3.4”)","zh":"ANSI 发布的标准的统称（常见于“ANSI 标准”或“ANSI X3.4”等名称中）"},"examples":[{"en":"The manual references an ANSI standard for electrical wiring.","zh":"这本手册引用了一项关于电气布线的 ANSI 标准。"},{"en":"Some tools are designed to meet ANSI specifications.","zh":"一些工具的设计是为了满足 ANSI 规范。"}]},{"partOfSpeech":"n.","definition":{"en":"in computing, a common way to refer to text/terminal conventions such as ANSI escape codes (control codes that change colors, cursor position, etc.)","zh":"（计算机）常用来指终端文本规范，如 ANSI 转义码（用于改变颜色、移动光标等的控制码）"},"examples":[{"en":"Turn on ANSI colors to make the log output easier to read.","zh":"开启 ANSI 颜色可以让日志输出更易读。"},{"en":"The terminal supports ANSI escape sequences.","zh":"这个终端支持 ANSI 转义序列。"}]}],"synonyms":["American National Standards Institute","ANSI standard","ANSI escape codes"],"phonetic":"/ˈænsi/","extraExplanation":["在英文里人们通常把它读作“AN-see”。写作时多用全大写（ANSI）。","ANSI 本身不是政府机构；它更多是协调与认可标准制定的组织。很多标准会以“ANSI/…”的形式出现，表示由 ANSI 认可、与其他组织共同制定或发布。","在计算机语境中，“ANSI”有时会被宽泛地用来指“非 Unicode 的本地编码/传统编码”或“ANSI 颜色/控制码”。不同软件里的叫法可能不严格，需要结合上下文理解。"]}
{"word":"ansi","summary":{"en":"ANSI most commonly refers to the American National Standards Institute, and by extension to widely used technical standards like ANSI SQL or ANSI escape codes.","zh":"ANSI 最常指“美国国家标准协会”，也常引申指相关的技术标准，如 ANSI SQL 或 ANSI 转义码。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"American National Standards Institute: a U.S. organization that creates and approves standards so products, services, and technology can work consistently and safely.","zh":"美国国家标准协会：美国的一个机构，负责制定与认可标准，使产品、服务与技术能一致、安全地运作。"},"examples":[{"en":"The keyboard layout follows ANSI standards.","zh":"这个键盘布局符合 ANSI 标准。"},{"en":"Our company uses ANSI guidelines for workplace safety.","zh":"我们公司采用 ANSI 的工作场所安全指南。"}]},{"partOfSpeech":"adj.","definition":{"en":"A standard format or system commonly associated with ANSI (especially in computing), such as ANSI SQL or ANSI escape codes.","zh":"指与 ANSI 相关的通用标准格式或体系（尤指计算机领域），如 ANSI SQL 或 ANSI 转义码。"},"examples":[{"en":"This database supports ANSI SQL.","zh":"这个数据库支持 ANSI SQL。"},{"en":"The terminal can display colors using ANSI escape codes.","zh":"这个终端可以用 ANSI 转义码显示颜色。"},{"en":"Save the file in ANSI encoding if the program can’t read UTF-8.","zh":"如果程序读不了 UTF-8，就把文件保存为 ANSI 编码。"}]}],"synonyms":["American National Standards Institute","standard","specification","ANSI standard"],"phonetic":"/ˈæn.si/","extraExplanation":["在中文语境里，“ANSI”有时被用来泛指“非 Unicode 的本地代码页编码”（如 Windows 的 CP1252、GBK 等），所以你会看到“ANSI 编码”这种说法；但它并不是一个单一、统一的编码标准，具体含义取决于系统区域设置。","ANSI 转义码（ANSI escape codes）最早与早期终端标准相关，用来控制光标、颜色等显示效果；如今在许多命令行环境（如终端/控制台）仍很常见。"]}
{"word":"Ansilma","summary":{"en":"“Ansilma” is usually used as a personal name, not a standard English word.","zh":"“Ansilma”通常是人名用法，不是标准的英语单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A personal name (proper noun). It is not a common English vocabulary word; most often it appears as someone’s given name, username, or a name in a specific community or story.","zh":"人名（专有名词）。它不是常见的英语词汇，通常作为某人的名字、网名，或出现在特定社群/故事中的名字。"},"examples":[{"en":"Ansilma is my classmate from Peru.","zh":"Ansilma 是我来自秘鲁的同学。"},{"en":"I saw the name Ansilma in the credits of the film.","zh":"我在电影的演职员表里看到了 Ansilma 这个名字。"}]}],"synonyms":["(no direct synonyms; proper name)"],"phonetic":"/ænˈsɪlmə/","extraExplanation":["“Ansilma”在英语词典中一般不作为普通词条出现，更可能是某种语言中的人名或拼写变体。常见的接近形式有 Anselma / Anselm 等（多与日耳曼语系名字传统相关），但具体来源要看当事人或文本的背景语言与地区。","如果你是在某本书、歌曲、游戏或一段对话中看到“Ansilma”，告诉我上下文句子（或它来自哪里），我可以帮你判断它是人名、地名、品牌名，还是可能的拼写错误。"]}
{"word":"Ansilme","summary":{"en":"“Ansilme” doesn’t appear to be a standard English word; it may be a misspelling or a proper noun.","zh":"“Ansilme”不像是标准英语单词，可能是拼写错误或专有名词。"},"extraExplanation":["“Ansilme”在常见英语词典中不是标准拼写，可能是拼错了或是专有名词（人名/品牌/用户名）。","你可以告诉我：1) 你在哪看到它（句子/截图）？2) 你想表达的中文意思？我就能更准确判断。","一些可能的接近拼写（仅供核对）：anxiety（焦虑）、aniline（苯胺）、enslave（奴役）、anathema（令人厌恶的人/事，或“诅咒”）、anime（日本动画）。如果你能提供上下文，我可以帮你确认是哪一个。"]}
{"word":"Ansley","summary":{"en":"Ansley is a personal name used as a first name or a surname.","zh":"Ansley 是人名，可作名字或姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (first name), used mostly in English-speaking countries.","zh":"人名（名字），主要见于英语国家。"},"examples":[{"en":"Ansley is starting at our school next week.","zh":"Ansley 下周要来我们学校了。"},{"en":"My friend Ansley loves hiking on weekends.","zh":"我的朋友 Ansley 周末喜欢徒步。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"姓氏。"},"examples":[{"en":"Ms. Ansley will lead today’s meeting.","zh":"Ansley 女士将主持今天的会议。"},{"en":"The article was written by Jordan Ansley.","zh":"这篇文章由 Jordan Ansley 撰写。"}]}],"phonetic":"/ˈænzli/","extraExplanation":["“Ansley”常被用作名字或姓氏。在英语里它也与英国地名有关（如英格兰沃里克郡的 Ansley 村）。","名字里的“-ley”常见于英语地名/姓氏中，源自古英语，常表示“空地、草地、林间开阔地”之类的意思。"]}
{"word":"Anson","summary":{"en":"Anson is mainly used as a personal name (first name or surname) and sometimes as a U.S. place name.","zh":"Anson 主要用作人名（名或姓），有时也用作美国地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name); also used as a surname","zh":"男性名字（名）；也可作姓氏"},"examples":[{"en":"Anson is my classmate from Seattle.","zh":"Anson 是我来自西雅图的同学。"},{"en":"Please ask Anson to email the report by Friday.","zh":"请让 Anson 在周五前把报告发邮件过来。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name found in the U.S. (for example, Anson County in North Carolina)","zh":"美国的一些地名（例如北卡罗来纳州的安森县 Anson County）"},"examples":[{"en":"She grew up in Anson County, North Carolina.","zh":"她在北卡罗来纳州的安森县长大。"}]}],"phonetic":"/ˈænsən/","extraExplanation":["“Anson”在英语里常见于人名与地名。作为姓氏时，常被解释为“Ann/Anne 的儿子”（Ann’s son 的变体），属于英语里常见的父称姓氏类型（类似 Johnson = John’s son）。","著名人物包括18世纪英国海军将领 George Anson（乔治·安森），其姓名也常出现在历史读物中。"]}
{"word":"Ansonia","summary":{"en":"Ansonia is a proper name best known as a city in Connecticut, and it can also refer to certain U.S. landmarks with the same name.","zh":"Ansonia 是一个专有名词，最常指康涅狄格州的安索尼亚市，也可指美国一些同名地标或建筑。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a city in western Connecticut, USA (in the Naugatuck Valley).","zh":"（美国）康涅狄格州西部的一个城市（位于瑙加塔克河谷地区）。"},"examples":[{"en":"She grew up in Ansonia, Connecticut, before moving to New York.","zh":"她在康涅狄格州的安索尼亚长大，后来搬去了纽约。"},{"en":"Ansonia is part of the Lower Naugatuck Valley region.","zh":"安索尼亚属于瑙加塔克河谷下游地区。"}]},{"partOfSpeech":"other","definition":{"en":"a proper name used for several places and landmarks (for example, buildings) in the United States.","zh":"一个专有名词，在美国也用于一些地名或地标（例如建筑物）的名称。"},"examples":[{"en":"They met for lunch near the Ansonia building on the Upper West Side.","zh":"他们在上西区安索尼亚大楼附近见面吃午饭。"}]}],"phonetic":"/ænˈsoʊniə/","extraExplanation":["“Ansonia”常被认为源自“Anson”（一个英语姓氏/人名）+ “-ia”（常见于地名的后缀，表示“……之地”）。","纽约市上西区的“Ansonia”（安索尼亚大楼）是一座历史悠久的公寓/酒店式建筑，因此在电影、文学或城市文化语境中也可能指代这座建筑，而不一定是康州的城市。"]}
{"word":"Ansonville","summary":{"en":"Ansonville is a place name, most commonly referring to a community in Anson County, North Carolina.","zh":"Ansonville 是一个地名，最常见指美国北卡罗来纳州安森县的一个社区。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A small town/community name; Ansonville is an unincorporated community in Anson County, North Carolina, USA.","zh":"一个小镇/社区名称；Ansonville 是美国北卡罗来纳州安森县（Anson County）的一个非建制社区。"},"examples":[{"en":"She grew up near Ansonville, North Carolina.","zh":"她在北卡罗来纳州的 Ansonville 附近长大。"},{"en":"We drove through Ansonville on our way to Charlotte.","zh":"我们去夏洛特的路上开车经过了 Ansonville。"}]}],"phonetic":"/ˈæn.sənˌvɪl/","extraExplanation":["“Ansonville”是专有名词（地名），通常不翻译，直接音译或保留英文拼写即可。","在美国语境中，“unincorporated community”指没有独立市政府建制、通常由县级政府管理的社区。"]}
{"word":"anspessade","summary":{"en":"“Anspessade” is not recognized as an English word; please provide context so I can identify the intended word.","zh":"“anspessade”不是英语词；请提供语境，我才能判断你真正想要的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name/word from another language.","zh":"不是标准英语单词。很可能是拼写错误，或是来自其他语言的人名/词。"},"examples":[{"en":"I can’t find “anspessade” in English dictionaries—could you share the sentence where you saw it?","zh":"我在英语词典里找不到“anspessade”——你能把它所在的句子发我吗？"},{"en":"If you meant “assassinated,” the spelling is different.","zh":"如果你想写的是“assassinated（被暗杀）”，拼写不一样。"}]}],"extraExplanation":["“anspessade”看起来像是拼写误差。你可以告诉我：\n1）它出现的上下文句子；\n2）你想表达的中文意思；\n3）它是否来自游戏ID、地名、人名或其他语言（如瑞典语/法语/西班牙语）。\n我就能更准确地判断你想找的词。","我也可以根据常见拼写接近度帮你猜可能的目标词（例如 assassinated, aspersed, embossed 等），但需要你提供语境来避免误导。"]}
{"word":"Ansted","summary":{"en":"“Ansted” is mainly used as a proper noun: a town in West Virginia or a surname.","zh":"“Ansted”主要作为专有名词使用：西弗吉尼亚州的地名或一个姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A small town/community in West Virginia, USA (Fayette County).","zh":"美国西弗吉尼亚州费耶特县的一个小镇/社区（Ansted）。"},"examples":[{"en":"We stopped in Ansted on our way to New River Gorge.","zh":"我们去新河峡谷（New River Gorge）的路上在 Ansted 停了一下。"},{"en":"Ansted is known for its nearby state parks and scenic views.","zh":"Ansted 因附近的州立公园和风景而出名。"}]},{"partOfSpeech":"other","definition":{"en":"A family name (surname).","zh":"姓氏：Ansted（人名）。"},"examples":[{"en":"Dr. Ansted published a report on local geology.","zh":"Ansted 博士发表了一份关于当地地质的报告。"},{"en":"I met someone named Ansted at the conference.","zh":"我在会议上遇到一位姓 Ansted 的人。"}]}],"phonetic":"/ˈæn.stɛd/","extraExplanation":["“Ansted”常被认为源于英文姓氏；西弗吉尼亚州的 Ansted 据说以19世纪英国地质学家 David Thomas Ansted 命名，这也让它在当地旅游与地质文化介绍中经常出现。","作为地名时，通常需要大写（Ansted）；作为普通词汇它不常用。"]}
{"word":"Ansteel","summary":{"en":"Ansteel: a major Chinese steel company (Anshan Iron and Steel Group).","zh":"Ansteel：指中国大型钢铁企业——鞍山钢铁（鞍钢集团）的英文简称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A major Chinese steel company; short for Anshan Iron and Steel Group Corporation (also called Angang), headquartered in Anshan, Liaoning.","zh":"中国大型钢铁企业；“Anshan Iron and Steel（鞍山钢铁/鞍钢集团）”的简称，总部在辽宁鞍山。"},"examples":[{"en":"Ansteel is one of the key steel producers in China.","zh":"Ansteel 是中国重要的钢铁生产企业之一。"},{"en":"The report said Ansteel will increase output next quarter.","zh":"报告称 Ansteel 下个季度将提高产量。"},{"en":"She applied for a job at Ansteel after graduation.","zh":"她毕业后申请了 Ansteel 的工作。"}]}],"synonyms":["Anshan Iron and Steel Group","Angang"],"phonetic":"/ˈænˌstiːl/","extraExplanation":["“Ansteel”是企业英文简称，来自“Anshan（鞍山）+ steel（钢铁）”。正式名称常见为“Anshan Iron and Steel Group / Anshan Iron & Steel Group Corporation”，中文多称“鞍钢”或“鞍钢集团”。","在新闻和商务语境中也可能写作“Angang”（源自拼音“An(g)ang/鞍钢”），两者通常指同一集团或其相关公司。","作为专有名词，通常首字母大写；在句中可像公司名一样直接作主语或宾语使用。"]}
{"word":"Anstice","summary":{"en":"Anstice is mainly a British personal name (sometimes a surname), related to Anastasia.","zh":"Anstice 主要是英国人名（有时为姓），与 Anastasia 相关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a female given name (and sometimes a surname), used mainly in the UK; a variant of names related to “Anastasia.”","zh":"女性名字（有时也作姓氏），主要见于英国；与“Anastasia（阿纳斯塔西娅）”相关的变体。"},"examples":[{"en":"Anstice moved to London after university.","zh":"安斯蒂斯特大学毕业后搬去了伦敦。"},{"en":"In the novel, Anstice is portrayed as quiet but determined.","zh":"在这部小说里，安斯蒂斯特被刻画得安静但很坚定。"}]}],"synonyms":["Anastasia","Ann","Ana"],"phonetic":"ˈænstɪs","extraExplanation":["“Anstice”在英语里通常被当作专有名词（人名）使用，因此一般不翻译成固定中文词义，而是音译为“安斯蒂斯特/安斯蒂丝”等，具体译法可按个人或出版物习惯调整。","词源上常被认为与拉丁语名字“Anastasia”有关，历史上经由法语形式演变为英语中的较短变体。该名字在现代并不常见，所以在阅读中遇到时，多半是角色名或作者/真实人物的名字。"]}
{"word":"anstoss","summary":{"en":"Anstoss is a German loanword meaning either a soccer kickoff/restart or a motivating impulse.","zh":"Anstoss 是德语借词，可指足球的开球/重新开球，也可指促使行动的推动力或动因。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from German) a “kickoff” or restart in soccer (football); the opening kick that begins play.","zh":"（源自德语）足球中的“开球/重新开球”；比赛开始时的第一脚开球。"},"examples":[{"en":"The match began with an Anstoss at midfield.","zh":"比赛以中圈开球开始。"},{"en":"After the goal, the referee signaled for Anstoss.","zh":"进球后，裁判示意重新开球。"}]},{"partOfSpeech":"n.","definition":{"en":"(from German) an impulse, stimulus, or push that motivates action; a prompting cause.","zh":"（源自德语）推动力、刺激、动因；促使行动的契机。"},"examples":[{"en":"Her teacher’s comment gave her the Anstoss to apply for the program.","zh":"老师的一句评价给了她申请该项目的动力。"},{"en":"The debate provided an Anstoss for new research.","zh":"这场辩论为新的研究提供了契机。"}]}],"synonyms":["kickoff","restart","impetus","stimulus","prompt"],"phonetic":"/ˈɑnʃtoʊs/","extraExplanation":["“Anstoss”常见于英语语境中讨论德国足球或引用德语时；德语原拼写为“Anstoß”（ß 读作 /s/），在不便输入 ß 时常写作“ss”。","在德语里，“Anstoß”既可指足球的开球，也可指抽象意义上的“推动/刺激”，所以在学术或新闻翻译中有时会保留该词以强调德语背景。"]}
{"word":"anstosse","summary":{"en":"“anstosse” is usually a non-umlaut spelling of German anstoßen: used to mean “Cheers!” or “to clink glasses / bump against.”","zh":"“anstosse”通常是德语 anstoßen（含 ö）的无变音写法：可表示“干杯！”或“碰杯/撞到”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(German; used as a toast) “Cheers!” / “Let’s clink glasses.”","zh":"（德语；祝酒用语）“干杯！”/“来碰杯吧。”"},"examples":[{"en":"At the wedding, everyone raised their glasses and said, “Anstoße!”","zh":"在婚礼上，大家举杯说：“Anstoße！”（干杯！）"},{"en":"We’re celebrating—Anstoße!","zh":"我们在庆祝——干杯！"}]},{"partOfSpeech":"v.","definition":{"en":"(German verb; to bump/knock against something; or to clink glasses in a toast)","zh":"（德语动词）撞到/碰到某物；或（祝酒时）碰杯。"},"examples":[{"en":"He bumped into the table corner. (German: Er stieß an die Tischecke an.)","zh":"他撞到了桌角。（德语：Er stieß an die Tischecke an.）"},{"en":"They clinked glasses to toast the new year. (German: Sie stießen auf das neue Jahr an.)","zh":"他们碰杯庆祝新年。（德语：Sie stießen auf das neue Jahr an.）"}]}],"synonyms":["cheers","toast","clink glasses","raise a glass"],"phonetic":"/ˈɑnʃtoʊsə/","extraExplanation":["“anstosse”常见于把德语 anstoßen（含变音符号 ö）打成纯字母的写法；更标准的拼写是 anstoßen。","在德语文化里，祝酒常说“Prost!”或“Zum Wohl!”；动词用法常见结构是“auf + 祝酒对象”＝为……干杯（如：auf dich＝为你干杯）。"]}
{"word":"Anstus","summary":{"en":"“Anstus” isn’t a common English word; it’s likely a misspelling or a name.","zh":"“Anstus”不是常见英文词，可能是拼写错误或人名/专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a proper name (e.g., a username/surname). Please share the sentence or what you meant to type.","zh":"不是常见的英文单词，可能是拼写错误或专有名词（如用户名/姓氏）。请提供句子或你原本想输入的词。"},"examples":[{"en":"I can’t find “Anstus” in major English dictionaries—can you give a sentence with it?","zh":"我在主要英文词典里找不到“Anstus”——你能给一个包含它的句子吗？"},{"en":"Did you mean “anxious” (worried) or another word?","zh":"你是不是想写“anxious”（焦虑的/担心的）或别的词？"}]}],"extraExplanation":["“Anstus”很可能是拼写误差。常见的相近拼写可能有：anxious（焦虑的）、Anastasia/Anastasius（人名的一部分）、angst（焦虑/惆怅，名词）。如果你把它出现的上下文发我（整句/段落），我可以更准确判断你要找的词并给出解释与例句。"]}
{"word":"ansu","summary":{"en":"“Ansu” is mainly used as a person’s name or nickname in English contexts.","zh":"“Ansu”在英语语境中主要作为人名或昵称使用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name (often a nickname), used especially for some West African or Spanish athletes (e.g., Ansu Fati).","zh":"人名（常作昵称），在一些西非或西班牙语语境中可见（例如球员 Ansu Fati）。"},"examples":[{"en":"Ansu scored a goal in the second half.","zh":"Ansu 在下半场进了一球。"},{"en":"His teammates call him Ansu for short.","zh":"队友们简称他为 Ansu。"}]}],"synonyms":["(proper name)"],"phonetic":"/ˈæn.suː/","extraExplanation":["“Ansu”在英语里最常见的是作为人名出现，而不是常用词汇。比如足球运动员 Ansu Fati 的“Ansu”据报道与其本名（如 Anssumane/Ansumane 等形式）有关，属于昵称或名字的一部分。","如果你想查的其实是别的词（例如“answer”的缩写、某个缩略语、或其他语言的词），告诉我你看到它的句子/场景，我可以按那个意思解释。"]}
{"word":"ansulate","summary":{"en":"“Ansulate” is not a standard English word; you probably mean “insulate,” meaning to prevent heat/sound/electricity from passing through, or to protect from negative influence.","zh":"“ansulate”不是标准英文词；你大概率想表达“insulate”，指隔热/隔音/绝缘，或引申为使免受负面影响。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Usually written as) insulate: to protect something by covering it with a material that prevents heat, cold, sound, or electricity from passing through easily.","zh":"（通常写作）insulate：用隔热/隔音/绝缘材料覆盖或保护某物，使热、冷、声音或电流不易通过。"},"examples":[{"en":"We need to insulate the attic to keep the house warm in winter.","zh":"我们需要给阁楼做隔热，这样冬天房子会更暖和。"},{"en":"These wires are insulated to prevent electric shocks.","zh":"这些电线做了绝缘处理，以防触电。"},{"en":"Thick curtains can help insulate a room from street noise.","zh":"厚窗帘可以帮助房间隔绝街道噪音。"}]},{"partOfSpeech":"vt.","definition":{"en":"To protect someone or something from an unpleasant experience, influence, or criticism.","zh":"使某人/某物免受不愉快的经历、影响或批评的冲击；“保护、隔离”在抽象意义上使用。"},"examples":[{"en":"Parents sometimes try to insulate their children from stress.","zh":"父母有时会尽量让孩子免受压力影响。"},{"en":"The company tried to insulate itself from public criticism.","zh":"这家公司试图让自己免受公众批评的影响。"}]}],"synonyms":["protect","shield","isolate","separate"],"phonetic":"/ˈɪnsəˌleɪt/","extraExplanation":["“ansulate”在英语里不是常见拼写；最可能是你想写 **insulate**（隔热/隔音/绝缘；或抽象意义上的“保护不受影响”）。","词根小提示：**insulate** 来自拉丁语 *insula*（岛）。原意有“使成为孤立的、像岛一样隔开”，所以既能指物理上的隔绝（热、声、电），也能指心理/社会层面的“隔离、保护”。"]}
{"word":"answer","summary":{"en":"“Answer” means to respond (verb) or the response itself (noun).","zh":"“answer”既可作动词表示“回答/应答”，也可作名词表示“答案/回答”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To respond to a question, request, or situation by speaking or acting.","zh":"回答；回应（问题、请求或情况），用语言或行动作出反应。"},"examples":[{"en":"Please answer the question in complete sentences.","zh":"请用完整的句子回答这个问题。"},{"en":"She didn’t answer my email until Friday.","zh":"她直到周五才回复我的邮件。"}]},{"partOfSpeech":"v.","definition":{"en":"To pick up (a phone call, door, etc.) and respond.","zh":"接（电话/门等）；应答。"},"examples":[{"en":"Can you answer the phone?","zh":"你能接一下电话吗？"},{"en":"No one answered the door.","zh":"没有人应门。"}]},{"partOfSpeech":"n.","definition":{"en":"A spoken or written response to a question or problem.","zh":"答案；解答（对问题或难题的回应）。"},"examples":[{"en":"What’s the answer to number five?","zh":"第五题的答案是什么？"},{"en":"Her answer was honest and clear.","zh":"她的回答诚实而清楚。"}]}],"synonyms":["reply","respond","response","solution"],"phonetic":"/ˈæn.sɚ/","extraExplanation":["“answer”既可以作动词也可以作名词。学习时可记两个核心搭配：answer a question（回答问题）与 answer the phone/door（接电话/应门）。","常见近义表达：reply 通常强调“回复信息/言语”；respond 更正式，强调“对事件/批评作出反应”。口语里也常说 get back to someone（稍后回复某人）。"]}
{"word":"answerability","summary":{"en":"Answerability means being responsible and expected to explain your actions; in some contexts it also means how easily something can be answered.","zh":"Answerability 指需要对行为负责并作出解释（问责性）；在某些语境中也指某事是否“可被回答/可被回应”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being responsible for your actions and expected to explain or justify them; accountability","zh":"（对行为结果）需要负责并要作出解释或说明的性质；问责性"},"examples":[{"en":"In a healthy workplace, leaders show answerability for their decisions.","zh":"在健康的工作环境里，领导者会对自己的决定表现出问责性。"},{"en":"The report calls for greater answerability in how public money is spent.","zh":"该报告呼吁在公共资金的使用方式上加强问责性。"}]},{"partOfSpeech":"n.","definition":{"en":"the extent to which something can be answered or addressed (for example, a question or a claim)","zh":"（问题、主张等）可被回答、可被回应或可被处理的程度"},"examples":[{"en":"The answerability of the question depends on how much evidence we have.","zh":"这个问题是否能回答，取决于我们有多少证据。"},{"en":"They challenged the answerability of the accusation without any proof.","zh":"他们质疑在没有证据的情况下，这项指控是否站得住、是否能被回应。"}]}],"synonyms":["accountability","responsibility","liability","answerableness"],"phonetic":"/ˌæn.sɚ.əˈbɪl.ə.ti/","extraExplanation":["“answerability”常见于正式语境（政治、法律、组织管理）。它和“accountability”很接近，但语感上更强调“必须向他人作出解释/交代（answer to someone）”。","构词：answer + -ability（表示“……的能力/性质”）。注意它不等于“ability to answer a question”（答题能力）；在公共治理/职场语境里多指“问责/负责”。"]}
{"word":"answerable","summary":{"en":"“Answerable” means either (1) able to be answered, or (2) responsible/accountable to someone or for something.","zh":"“answerable”既可指“能被回答/回应”，也可指“需要负责、要向……交代”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be answered or responded to (for example, a question, request, or criticism).","zh":"（问题、请求、批评等）可以回答的；有回应空间的。"},"examples":[{"en":"Your question is answerable, but I need a bit more context first.","zh":"你的问题是可以回答的，但我需要你先提供一点背景。"},{"en":"Most customer complaints are answerable within 24 hours.","zh":"大多数客户投诉都能在24小时内得到回应。"}]},{"partOfSpeech":"adj.","definition":{"en":"Able to be held responsible or accountable (often used with “to” or “for”).","zh":"（常与 to/for 连用）需要负责的；要向……交代的。"},"examples":[{"en":"The manager is answerable to the board for the company’s results.","zh":"经理要向董事会对公司的业绩负责。"},{"en":"As a public official, she is answerable for how the money is spent.","zh":"作为公职人员，她必须为资金如何使用负责。"}]}],"synonyms":["accountable","responsible","replyable","respondable"],"phonetic":"/ˈæn.sɚ.ə.bəl/","extraExplanation":["“answerable”有两条常见语义：一是“能被回答/回应”，二是“要负责、要向上级交代”。第二种在职场与政府语境里很常见，常见搭配：answerable to (someone)（向某人负责）、answerable for (something)（为某事负责）。","与其相近但语气更正式的词有 accountable（可追责的、要负责的）。日常口语里也常用 responsible（负责的）。"]}
{"word":"answerableness","summary":{"en":"Answerableness means the quality of being answerable—either responsible/accountable, or (less commonly) capable of being answered.","zh":"Answerableness 指“应答性/可追责性”：要对事情负责并需解释交代；较少见的意思是“可回答性”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being answerable: being responsible for something and expected to explain or justify it.","zh":"可追责性；应答责任：对某事负有责任，并应当作出解释或交代的性质。"},"examples":[{"en":"Good governance depends on the answerableness of public officials.","zh":"良好的治理依赖于公职人员的可追责性。"},{"en":"The report questioned the answerableness of the company’s leaders for the accident.","zh":"这份报告质疑公司领导对事故的可追责程度。"}]},{"partOfSpeech":"n.","definition":{"en":"The quality of being able to be answered (of a question or objection).","zh":"可回答性：问题或质疑能够被回答、回应的性质。"},"examples":[{"en":"The reviewer doubted the answerableness of the question because it was too vague.","zh":"评论者怀疑这个问题的可回答性，因为它太含糊了。"},{"en":"Try to improve the answerableness of your survey items by making them more specific.","zh":"让问卷题目更具体，以提高它们的可回答性。"}]}],"synonyms":["accountability","responsibility","answerability","liability","responsibleness"],"phonetic":"/ˈæn.sɚ.ə.bəl.nəs/","extraExplanation":["“answerableness”是由形容词“answerable”（应负责的/可回答的）加名词后缀“-ness”构成，表示“……的性质/状态”。在现代英语中较少单独使用，常见替代表达包括“accountability（问责/可追责性）”“responsibility（责任）”以及“answerability（可回答性/可追责性）”。在法律、公共管理或学术写作中偶尔会出现，用来强调“需要被解释与交代”的属性。"]}
{"word":"answerably","summary":{"en":"Answerably means either “in a way that can be answered” or (more formally) “in a responsible, accountable way.”","zh":"answerably 表示“以可回答的方式”，也可（较正式）表示“以负责任、可被追责的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that can be answered; so that a reply or explanation is possible.","zh":"以可回答的方式；使人能够回应或解释。"},"examples":[{"en":"Please phrase your question answerably, with clear details.","zh":"请把问题表述得可回答一些，信息要清楚。"},{"en":"The survey was written answerably, so most people could respond quickly.","zh":"这份问卷设计得很“可回答”，所以大多数人能很快作答。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a responsible or accountable way; in a manner for which one can be held answerable (often formal or old-fashioned).","zh":"以负责任/可被追责的方式；以需要对结果负责的方式（常见于正式或较旧的用法）。"},"examples":[{"en":"Officials must act answerably in the use of public funds.","zh":"官员在使用公共资金时必须以可被追责的方式行事。"},{"en":"He tried to manage the project answerably, keeping careful records.","zh":"他尽量负责任地管理项目，认真保存记录。"}]}],"synonyms":["responsibly","accountably","clearly","in a way that can be answered"],"phonetic":"/ˈæn.sɚ.ə.bli/","extraExplanation":["“answerably”在现代英语中比较少见，很多情况下人们会用更常见的表达替代：\n- 表示“可回答”：use words like “clearly,” “in a way that can be answered,” “so that it’s answerable.”\n- 表示“负责任/可被追责”：use “responsibly,” “accountably,” or “in an accountable way.”\n它和“answerable（adj.）”同源：answerable to someone 表示“对某人负责/向某人交代”。"]}
{"word":"answered","summary":{"en":"“Answered” usually means “replied” (to a question/message), or “picked up” (a phone/door). It can also describe something “fulfilled,” as in “an answered prayer.”","zh":"answered 通常表示“作出回答/回复”，也可指“接听电话/应门”。作形容词时可表示“得到满足/实现”，如 an answered prayer（如愿以偿）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “answer”: gave a reply (spoken, written, or by action) to a question, request, or message.","zh":"“answer”的过去式/过去分词：对问题、请求或信息作出回答（口头、书面或用行动）。"},"examples":[{"en":"She answered my email within an hour.","zh":"她在一小时内回复了我的邮件。"},{"en":"He answered the teacher’s question correctly.","zh":"他正确回答了老师的问题。"},{"en":"No one answered when I asked for help.","zh":"我求助时没有人回应。"}]},{"partOfSpeech":"v.","definition":{"en":"(phone/door) responded by picking up the phone or opening the door.","zh":"（电话/门）接听电话或开门回应。"},"examples":[{"en":"I called twice, but nobody answered.","zh":"我打了两次电话，但没人接。"},{"en":"She went to the door and answered it.","zh":"她走到门口去开门应门。"}]},{"partOfSpeech":"adj.","definition":{"en":"(figurative, often in phrases) having been responded to or fulfilled.","zh":"（引申，常用于短语）得到回应或实现的。"},"examples":[{"en":"It felt like an answered prayer.","zh":"这感觉就像祈祷得到了回应。"},{"en":"After weeks of searching, their needs were finally answered.","zh":"找了几周之后，他们的需求终于得到了满足。"}]}],"synonyms":["replied","responded","returned (a call)","picked up","addressed"],"phonetic":"/ˈæn.sɚd/","extraExplanation":["“answered prayer(s)”是常见表达，源自宗教语境（祈祷得到上天回应），现代英语里也常用于日常生活，表示“盼望已久的好事终于发生/问题终于解决”。"]}
{"word":"answerer","summary":{"en":"“Answerer” means a person who responds or gives an answer.","zh":"“answerer”指“回答的人；应答者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who answers a question, message, or request; someone who responds.","zh":"回答者；应答者（指回答问题、信息或请求的人）"},"examples":[{"en":"She was the first answerer in the Q&A session.","zh":"在问答环节中，她是第一个回答者。"},{"en":"The answerer explained the steps clearly.","zh":"回答者把步骤解释得很清楚。"}]}],"synonyms":["responder","respondent","replying person"],"phonetic":"/ˈæn.sɚ.ɚ/","extraExplanation":["“answerer”由动词 answer（回答）+ 表示“人”的后缀 -er 构成，意思直观：做“回答”这件事的人。","在英语里更常见的说法通常是 the person who answered / respondent（尤用于问卷、调查）/ responder（常用于邮件、紧急服务或技术场景）。在正式写作中，“answerer”相对少见，但在问答社区、测验或课堂场景里很容易理解。"]}
{"word":"answerers","summary":{"en":"“Answerers” means people who answer; it’s the plural form of “answerer.”","zh":"“Answerers”指回答问题的人；是“answerer”的复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who answer (questions, messages, or calls); the plural of “answerer.”","zh":"回答者；作答的人（“answerer”的复数）。"},"examples":[{"en":"We need more answerers to help in the Q&A session.","zh":"我们需要更多回答者来协助问答环节。"},{"en":"The fastest answerers got a small prize.","zh":"回答最快的人获得了一个小奖品。"}]}],"synonyms":["respondents","repliers","people who answer","contributors"],"phonetic":"ˈæn.sɚ.ɚz","extraExplanation":["“answerer”是由动词 answer + 表示“做某事的人”的后缀 -er 构成（如 teacher, runner）。复数形式是 answerers。","在网络社区（如问答网站、论坛）里，answerers 常指“回答问题的人/答主”，语气中性。"]}
{"word":"answering","summary":{"en":"“Answering” means responding to someone (or picking up a call), and it can also describe things used for answering, like an answering machine.","zh":"“Answering”指“回答/回应”或“接听电话”，也可作定语表示“用于应答的”，如答录机。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"responding to a question, message, request, or call","zh":"回答（问题/信息/请求）；接听（电话）"},"examples":[{"en":"She is answering questions from the audience.","zh":"她正在回答观众的问题。"},{"en":"I’m answering emails right now—can I call you back later?","zh":"我正在回邮件——我晚点再回电话可以吗？"},{"en":"He stopped to answer the phone.","zh":"他停下来接电话。"}]},{"partOfSpeech":"adj.","definition":{"en":"used before a noun to describe something meant for answering, especially phone calls (e.g., “answering machine,” “answering service”)","zh":"（作定语）用于“接听/应答”的，尤指电话相关（如“answering machine”“answering service”）"},"examples":[{"en":"Leave a message after the beep on the answering machine.","zh":"哔声后请在答录机上留言。"},{"en":"The company uses an answering service at night.","zh":"这家公司晚上使用电话代接服务。"}]}],"synonyms":["responding","replying","returning (a call)","picking up (the phone)"],"phonetic":"/ˈæn.sɚ.ɪŋ/","extraExplanation":["“answering”是动词 answer 的现在分词/动名词形式：可表示“正在回答/接听”（进行时），也可像名词一样表示“回答这件事”（如：Answering takes time. 回答需要时间）。","在电话语境里，“answering”常作定语修饰名词：answering machine（答录机/语音信箱设备）、answering service（电话代接服务）。","常见搭配：answering a question/email/call（回答问题/回邮件/接电话）；answering to sb.（对某人负责/听命于某人，较正式）。"]}
{"word":"answering machine","summary":{"en":"An answering machine records callers’ voice messages when you can’t answer the phone.","zh":"“answering machine”指在你无法接听电话时用来录下对方语音留言的答录机/语音留言装置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device (or phone feature) that records voice messages from callers when you cannot answer the phone.","zh":"（电话）答录机；语音留言装置：在你无法接听时记录来电者留言的设备或功能。"},"examples":[{"en":"I wasn’t home, so please leave a message on the answering machine.","zh":"我不在家，所以请在答录机上留言。"},{"en":"Her answering machine picked up after the third ring.","zh":"响到第三声时，她的答录机就自动接听了。"}]}],"synonyms":["voicemail","voice mail","message machine"],"phonetic":"/ˈæn.sɚ.ɪŋ məˌʃin/","extraExplanation":["“answering machine”最常指传统座机用的录音设备；现在很多情况下也泛指手机或运营商的“voicemail（语音信箱）”。日常口语里，如果是手机上的功能，更常说“voicemail”或“voice mail”。","文化背景：在智能手机普及前，答录机是家庭常见电器；许多电影/小说里会用“听答录机留言”推动剧情（例如误会、告白、线索）。"]}
{"word":"answeringly","summary":{"en":"“Answeringly” means “in a responding/answering way,” and it’s a somewhat rare, literary-sounding adverb.","zh":"“Answeringly”表示“以回应/作答的方式”，是较少见、略带文学色彩的副词。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that answers or responds; responsively.","zh":"以回答或回应的方式；应答地。"},"examples":[{"en":"She nodded answeringly when I asked if she understood.","zh":"我问她是否明白时，她点头应答。"},{"en":"He smiled answeringly, as if replying without words.","zh":"他应答般地笑了笑，仿佛在用无声的话回应。"}]}],"synonyms":["responsively","in response","in reply","reactively"],"phonetic":"ˈæn.sɚ.ɪŋ.li","extraExplanation":["“answeringly”在现代英语里比较少见，读起来略带文学或旧式口吻。日常表达更常用：“in response / responsively / in reply”。","它常用来描写一种“像在回答一样”的动作或表情（如点头、微笑、目光等），强调对前一句话、问题或情境的回应感。"]}
{"word":"answerless","summary":{"en":"Answerless means “not answered” or “without a response,” and it can also describe someone who refuses or fails to answer.","zh":"answerless 表示“未被回答的、没有回应的”，也可形容某人不作答或无法回答。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not answered; having no reply or response.","zh":"未被回答的；没有回应的。"},"examples":[{"en":"My email has been answerless for three days.","zh":"我的邮件三天都没人回复。"},{"en":"She left his question answerless and changed the subject.","zh":"她没有回答他的问题，而是转移了话题。"}]},{"partOfSpeech":"adj.","definition":{"en":"Without providing answers; unable or unwilling to answer (often describing a person or voice).","zh":"不作答的；无法或不愿回答的（常形容人或说话方式）。"},"examples":[{"en":"He gave an answerless smile when asked about the rumor.","zh":"被问到那个传闻时，他只是露出一个不置可否的微笑。"},{"en":"The witness stayed answerless under pressure.","zh":"证人在压力下始终不作答。"}]}],"synonyms":["unanswered","unresponded","without a reply","unreplied","silent"],"phonetic":"/ˈæn.sɚ.ləs/","extraExplanation":["“answerless”并不算非常常用的日常词，更常见的替代说法有 “unanswered”（未回复的）或 “without an answer / no response”（没有回应）。","在文学或较正式的写作里，“answerless”常用来强调一种“沉默、悬而未决”的感觉，例如“answerless questions”（无解的问题）。"]}
{"word":"answerlessly","summary":{"en":"“Answerlessly” means ‘without an answer’ or ‘in a speechless way.’","zh":"“Answerlessly”表示“无答案地”或“无言以对地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that has no answer or solution; without any possible reply.","zh":"以无答案、无解的方式；到了无法回应的程度。"},"examples":[{"en":"The question hung in the air, answerlessly.","zh":"这个问题悬在空气中，无人能答。"},{"en":"She stared at the notice answerlessly, not knowing what to do next.","zh":"她无助地盯着那张通知，看得出一时不知该怎么办。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that shows you cannot answer (because you are confused, shocked, or speechless).","zh":"以答不上来（因困惑、震惊或说不出话）的方式。"},"examples":[{"en":"He looked at me answerlessly when I asked about the missing money.","zh":"我问起丢失的钱时，他一脸答不上来的样子看着我。"},{"en":"The child smiled answerlessly, too shy to speak.","zh":"孩子害羞得说不出话，只是无言地笑了笑。"}]}],"synonyms":["without an answer","unanswered","speechlessly","wordlessly","silently"],"phonetic":"ˈæn.sɚ.ləs.li","extraExplanation":["“answerlessly”不是日常高频词，更常见的表达是“without an answer / with no answer / speechlessly / wordlessly”。它由 answer（回答）+ -less（没有…的）+ -ly（副词后缀）构成，常用于较文学或刻意强调“无解/无言”的语气。"]}
{"word":"answerphone","summary":{"en":"An answerphone is a system that records messages when you can’t answer a call.","zh":"answerphone 指无人接听时自动录音留言的系统（类似答录机/语音信箱）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device or service that records phone messages when you cannot answer (similar to an answering machine or voicemail)","zh":"（无人接听时）自动录音留言装置/服务；类似“电话答录机/语音信箱”"},"examples":[{"en":"Sorry I missed your call—leave a message on the answerphone.","zh":"不好意思我没接到你的电话——请在答录机上留言。"},{"en":"The answerphone picked up after four rings.","zh":"响了四声后就转到了自动留言。"},{"en":"She checked the answerphone for new messages.","zh":"她查看答录机有没有新留言。"}]}],"synonyms":["answering machine","voicemail","message machine"],"phonetic":"/ˈæn.sɚˌfoʊn/","extraExplanation":["“answerphone”更常见于英式英语（BrE），美式英语里通常说“answering machine”或“voicemail”。","在现代语境中，许多人的留言功能由手机运营商或应用提供，因此“answerphone”也可泛指“语音留言系统”，不一定是实体机器。"]}
{"word":"answers","summary":{"en":"“Answers” can mean the plural noun “responses/solutions,” or the verb form “responds” (third-person singular).","zh":"“answers”可作名词复数，表示“答案/回应”；也可作动词第三人称单数，表示“回答/回复”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Responses to questions, problems, or requests for information.","zh":"对问题、难题或信息请求的回答；答案。"},"examples":[{"en":"Please write your answers on the form.","zh":"请把你的答案写在表格上。"},{"en":"I don’t know the answer to that question.","zh":"我不知道那个问题的答案。"}]},{"partOfSpeech":"v.","definition":{"en":"To respond to someone by speaking, writing, or acting; to reply.","zh":"回答（某人）；回应（用言语、文字或行动）。"},"examples":[{"en":"He didn’t answer my email.","zh":"他没有回复我的邮件。"},{"en":"She answered quickly and clearly.","zh":"她回答得又快又清楚。"}]}],"synonyms":["replies","responses","solutions"],"phonetic":"/ˈæn.sɚ/","extraExplanation":["“answer”既可以作名词（an answer / the answer），也可以作动词（to answer）。作动词时常见搭配有：answer a question（回答问题）、answer the phone/door（接电话/应门）、answer an email/message（回复邮件/消息）。","名词“answers”是“answer”的复数形式；动词“answers”则多用于第三人称单数（He answers… 他回答……）。"]}

