{"word":"Ant","summary":{"en":"An ant is a small social insect that lives and works in colonies.","zh":"Ant 指“蚂蚁”，是一种群居、分工合作的昆虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small insect that lives in highly organized groups (colonies), often in nests; many ants work together to gather food and care for the young","zh":"蚂蚁；一种生活在高度组织化群体（蚁群）中的小昆虫，常在蚁巢里生活；许多蚂蚁分工合作觅食、照顾幼虫"},"examples":[{"en":"Ants are carrying crumbs back to their nest.","zh":"蚂蚁正把面包屑搬回蚁巢。"},{"en":"We saw an ant colony under the stone.","zh":"我们在石头下面看到了一个蚁群。"},{"en":"An ant bit me on the ankle.","zh":"一只蚂蚁咬了我的脚踝。"}]}],"synonyms":["insect","worker ant","garden ant"],"phonetic":"/ænt/","extraExplanation":["在美式英语里，ant /ænt/ 和 aunt（“阿姨/姑妈”）在很多地区发音相同或很接近，所以口语中要靠上下文区分。","英语里常用 ant 来做比喻，强调“勤劳、团队合作”，例如：busy as an ant（像蚂蚁一样忙/勤快）。"]}
{"word":"ant","summary":{"en":"An “ant” is a small social insect; it can also describe someone very hardworking and detail-focused.","zh":"“ant”指蚂蚁；也可比喻勤劳、重细节的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small insect that lives in organized groups (colonies), often in nests, and works together to find food and care for the colony","zh":"蚂蚁；一种小型昆虫，常群居成“蚁群/蚁巢”，分工合作觅食并照顾群体"},"examples":[{"en":"Ants work together to carry food back to their nest.","zh":"蚂蚁会合作把食物搬回蚁巢。"},{"en":"We saw a line of ants marching across the sidewalk.","zh":"我们看到一队蚂蚁沿着人行道行进。"},{"en":"If you leave sugar out, ants may come quickly.","zh":"如果把糖放在外面，蚂蚁可能很快就会来。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who works hard, is patient, and pays attention to small tasks (often in the phrase “as busy as an ant”)","zh":"勤劳、耐心、做事细致的人（常见于短语“as busy as an ant”意为“忙得像蚂蚁一样”）"},"examples":[{"en":"She’s as busy as an ant, always doing something helpful.","zh":"她忙得像蚂蚁一样，总是在做些有帮助的事。"},{"en":"He’s an ant when it comes to organizing details.","zh":"在整理细节方面，他特别勤快细致。"}]}],"synonyms":["insect","worker (figurative)"],"phonetic":"/ænt/","extraExplanation":["“ant”常出现在英语文化里作为勤劳、团队合作的象征，因为蚂蚁在自然界里以分工明确、协作搬运而著名。","相关常见表达：a colony（蚁群/群体）, an anthill（蚁丘）, a nest（巢）, to swarm（成群出现）。"]}
{"word":"ant intelligence","summary":{"en":"collective problem-solving ability emerging from ant colonies","zh":"蚁群通过简单规则涌现出的群体协作与解决问题能力"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"the cognitive abilities and complex collective behavior of ants, especially their problem-solving through simple individual rules (often discussed as “swarm intelligence”)","zh":"蚂蚁的“智慧/智能”，指蚂蚁个体简单行为规则在群体层面产生的复杂协作与解决问题能力（常与“群体智能/蜂群智能”相关）"},"examples":[{"en":"Researchers study ant intelligence to understand how colonies find the shortest path to food.","zh":"研究人员研究蚂蚁智能，以了解蚁群如何找到通往食物的最短路径。"},{"en":"Ant intelligence shows that a group can solve problems even if each individual has limited information.","zh":"蚂蚁智能说明：即使每个个体信息有限，群体也能解决问题。"},{"en":"Some computer algorithms are inspired by ant intelligence, using many simple agents to search for good solutions.","zh":"一些计算机算法受蚂蚁智能启发，用许多简单的“代理”一起寻找更优解。"}]}],"synonyms":["swarm intelligence","collective intelligence","colony behavior","emergent behavior","ant colony optimization"],"phonetic":"/ænt ɪnˈtɛlədʒəns/","extraExplanation":["学习里常把它和“swarm intelligence（群体智能）”一起理解：蚂蚁通过信息素（pheromones）等简单信号在环境中“留下线索”，群体据此形成路线选择、分工协作等复杂行为。","在工程与AI领域，“Ant Colony Optimization（蚁群优化）”就是受此启发的一类算法，用来做路径规划、组合优化等问题。"],"etymology":"“ant intelligence”由 ant（蚂蚁）+ intelligence（智能/智力）构成。它常用于生物学与复杂系统研究语境，强调蚂蚁个体并不“聪明”，但群体协作能涌现出看似高水平的决策与组织能力。","mnemonic":["把它想成“蚂蚁=小个体，智能=大能力”：单只不强，但“蚁多力量大”，合起来就像有“集体大脑”。","联想中文常说的“蚁群协作/蚁群算法”，看到 intelligence 就想到“智能体很多、规则很简单、结果很聪明”。"]}
{"word":"ant-associated","summary":{"en":"Ant-associated means “related to ants” or “living/working with ants,” especially in scientific contexts.","zh":"ant-associated 指“与蚂蚁有关的”或“与蚂蚁共生/互动的”，尤其常见于科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with ants, or involving ants (often used in biology/ecology to describe species, behaviors, or chemicals related to ants).","zh":"与蚂蚁有关的；涉及蚂蚁的（常用于生物学/生态学，描述与蚂蚁相关的物种、行为或化学物质）。"},"examples":[{"en":"Researchers found an ant-associated fungus living inside the nest.","zh":"研究人员发现一种与蚂蚁有关的真菌生活在蚁巢里。"},{"en":"Some plants produce ant-associated nectar to attract ants for protection.","zh":"一些植物会分泌与蚂蚁相关的花外蜜，以吸引蚂蚁来保护自己。"}]},{"partOfSpeech":"adj.","definition":{"en":"Living with ants or regularly interacting with them (e.g., insects that share ant nests or depend on ants).","zh":"与蚂蚁共生或经常与蚂蚁互动的（例如住在蚁巢里或依赖蚂蚁的昆虫）。"},"examples":[{"en":"The beetle is ant-associated and can move through the colony without being attacked.","zh":"这种甲虫是与蚂蚁共生的，能在蚁群中活动而不被攻击。"},{"en":"Many ant-associated species avoid predators by staying close to ants.","zh":"许多与蚂蚁共生的物种通过靠近蚂蚁来躲避捕食者。"}]}],"synonyms":["ant-related","ant-linked","myrmecophilous (technical)"],"phonetic":"/ænt əˈsoʊʃiˌeɪtɪd/","extraExplanation":["“ant-associated”常见于学术写作（生态学、昆虫学）。更专业的词有 myrmecophilous（嗜蚁/与蚁共生的）和 myrmecophyte（蚁栖植物），但日常或科普文章里用“ant-associated”更直观。","连字符（ant-associated）强调这是一个复合形容词：意思是“与蚂蚁相关的”。在名词前使用较多，如 ant-associated bacteria / ant-associated behavior。"]}
{"word":"ant-bathing","summary":{"en":"Ant-bathing is when a bird uses ants on its feathers or body, likely for feather care or parasite control.","zh":"Ant-bathing（蚁浴）指鸟类把蚂蚁擦在羽毛上或让蚂蚁爬到身上，常被认为与清洁羽毛或驱除寄生虫有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A behavior in which a bird (or sometimes another animal) rubs ants on its feathers, or sits among ants, often thought to help with feather care or parasite control.","zh":"（多指鸟类的）“蚁浴”：把蚂蚁擦在羽毛上，或坐在蚁群中，让蚂蚁爬到身上；一般认为与清洁羽毛、驱虫等有关。"},"examples":[{"en":"We watched a robin ant-bathing on the lawn, spreading its wings while ants crawled over its feathers.","zh":"我们看到一只知更鸟在草地上蚁浴，张开翅膀让蚂蚁爬过它的羽毛。"},{"en":"Some field guides mention ant-bathing as one possible way birds reduce mites.","zh":"一些野外观察手册提到，蚁浴可能是鸟类减少螨虫的一种方式。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of doing this behavior; the process of rubbing ants onto the body or feathers.","zh":"进行蚁浴的动作/过程；把蚂蚁擦到身体或羽毛上的行为本身。"},"examples":[{"en":"Ant-bathing can last only a few minutes, but it looks very deliberate.","zh":"蚁浴可能只持续几分钟，但看起来非常有目的性。"},{"en":"The researcher recorded each bout of ant-bathing and what type of ants were used.","zh":"研究者记录了每一次蚁浴以及鸟使用了哪种蚂蚁。"}]}],"synonyms":["anting"],"phonetic":"/ˈænt ˌbeɪðɪŋ/","extraExplanation":["“蚁浴”常被认为与蚂蚁分泌的化学物质有关，尤其是一些蚂蚁会释放蚁酸（formic acid），可能帮助驱除寄生虫或清洁羽毛油脂。不过科学界对其确切功能仍有讨论：除了“驱虫/清洁”，也有人认为与舒缓皮肤不适、处理羽毛等有关。","写法上常见连字符 ant-bathing，也可见作 ant bathing。作为动词用法时通常写作 be ant-bathing / go ant-bathing（例如：The sparrow was ant-bathing.）。"]}
{"word":"ant-dispersed","summary":{"en":"Ant-dispersed describes seeds (or plants) whose spread happens because ants carry them to new places.","zh":"Ant-dispersed 指种子（或植物）通过蚂蚁搬运而实现传播、扩散。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Ecology) Dispersed by ants, especially referring to seeds or fruits that ants carry away and move to new places.","zh":"（生态学）由蚂蚁传播的，尤指种子或果实被蚂蚁搬运到别处，从而扩散到新地点。"},"examples":[{"en":"These wildflowers have ant-dispersed seeds that often end up in nutrient-rich soil.","zh":"这些野花的种子由蚂蚁传播，常常被带到养分丰富的土壤里。"},{"en":"Ant-dispersed plants can form small clusters near ant nests.","zh":"由蚂蚁传播的植物可能会在蚁巢附近形成小片群落。"},{"en":"Researchers compared wind-dispersed and ant-dispersed species in the same forest.","zh":"研究人员在同一片森林中比较了风传播物种和蚂蚁传播物种。"}]}],"synonyms":["myrmecochorous","ant-carried","dispersed by ants"],"phonetic":"/ænt dɪˈspɝst/","extraExplanation":["“ant-dispersed”常见于生态学/植物学写作，对应更专业的术语是 **myrmecochorous**（蚁播的）和 **myrmecochory**（蚁播现象）。","很多蚁播植物的种子带有富含油脂的“食物小体” **elaiosome**（诱饵体），蚂蚁会把种子搬回巢穴取食诱饵体，剩下的种子被丢弃在较安全、较肥沃的位置，从而提高发芽与存活率。","写作中它通常作定语：**ant-dispersed seeds/fruits/plants**。也可用同义表达：**ant-carried**（蚂蚁搬运的）、**dispersed by ants**（由蚂蚁传播的）。"]}
{"word":"ant-eating","summary":{"en":"Ant-eating describes animals that mainly eat ants.","zh":"ant-eating 用来形容主要以蚂蚁为食的动物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of an animal) feeding mainly on ants; specialized for eating ants.","zh":"（指动物）以蚂蚁为主要食物的；专门吃蚂蚁的。"},"examples":[{"en":"The anteater is an ant-eating mammal with a long snout and sticky tongue.","zh":"食蚁兽是一种以蚂蚁为食的哺乳动物，长鼻子、舌头黏黏的。"},{"en":"Some ant-eating animals use strong claws to break open ant nests.","zh":"一些食蚁动物会用强壮的爪子撕开蚁巢。"}]}],"synonyms":["antivorous","ant-eater (as a related noun)","insectivorous (broader)"],"phonetic":"/ˈænt ˌiːtɪŋ/","extraExplanation":["“ant-eating”常用于动物学或自然科普写作，描述一种饮食习性（diet）。类似表达还有“insect-eating（食虫的）”“fish-eating（食鱼的）”。","在英文里它通常作为复合形容词，用连字符（hyphen）放在名词前：an ant-eating animal；若放在系动词后也可写成不加连字符的短语：The animal is ant eating（较少见），更常见仍是用连字符保持清晰。","常见的“食蚁”动物包括：anteater（食蚁兽）、pangolin（穿山甲）、aardvark（土豚）等。它们往往有长舌头、强爪子等适应性特征。"]}
{"word":"ant-like","summary":{"en":"“Ant-like” means resembling an ant, often suggesting something very small or moving/working in a line like ants.","zh":"“ant-like”表示“像蚂蚁的”，常暗示“非常小”或“像蚂蚁一样排队移动/勤奋工作”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling an ant in appearance or behavior (for example, very small, moving in a line, or working tirelessly).","zh":"像蚂蚁的；在外形或行为上类似蚂蚁（例如很小、排成一列移动、或勤劳不停）。"},"examples":[{"en":"From the hilltop, the people below looked ant-like.","zh":"从山顶看下去，下面的人看起来像蚂蚁一样小。"},{"en":"A line of ant-like robots marched across the floor carrying parts.","zh":"一排像蚂蚁一样的机器人在地板上行进，搬运零件。"}]}],"synonyms":["antish","insect-like","tiny","minute"],"phonetic":"/ˈæntˌlaɪk/","extraExplanation":["“ant-like”是由名词“ant（蚂蚁）+ -like（像……一样）”构成的复合形容词，常用来强调“非常小（从远处看）”或“像蚂蚁般成队移动/勤奋工作”的画面感。","写作中它带有强烈的视觉效果：用来描写远景中密集的人群、车辆，或强调群体协作（有时也暗示个体渺小）。","相近表达：“antsy”（坐立不安的）不等于“ant-like”；“ant-like”强调“像蚂蚁”，而“antsy”强调“焦躁/不安”。"]}
{"word":"ant-lion","summary":{"en":"An insect (especially its larva) known for trapping ants in sand pits.","zh":"一种昆虫（尤指幼虫），以在沙地挖坑设陷阱捕捉蚂蚁而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small insect (especially its larva) that digs a cone-shaped pit in sand to trap ants and other small insects.","zh":"蚁狮（尤指其幼虫）：会在沙地挖漏斗状陷阱来捕捉蚂蚁等小昆虫的昆虫。"},"examples":[{"en":"An ant-lion larva hides under the sand and waits for ants to fall into its pit.","zh":"蚁狮幼虫会藏在沙子下面，等蚂蚁掉进它挖的陷阱里。"},{"en":"We found ant-lion pits near the edge of the playground where the ground was dry and sandy.","zh":"我们在操场边上干燥的沙地附近发现了蚁狮挖的漏斗坑。"}]},{"partOfSpeech":"n.","definition":{"en":"The adult form of this insect, which looks similar to a dragonfly.","zh":"蚁狮的成虫：外形有点像蜻蜓的昆虫。"},"examples":[{"en":"The adult ant-lion has delicate wings and flies at night.","zh":"蚁狮成虫翅膀很薄，常在夜间飞行。"}]}],"synonyms":["antlion","doodlebug"],"phonetic":"/ˈæntˌlaɪən/","extraExplanation":["蚁狮最有名的行为是“漏斗陷阱”：在松软干沙里挖出圆锥坑，昆虫滑下去后很难爬出。中文里也常叫“蚁蛉幼虫”。","拼写上也常见作 antlion（合写）；ant-lion 属于带连字符的写法。"],"etymology":"源自英语复合词 ant + lion，字面意思是“蚂蚁的狮子”，用来形容幼虫捕食蚂蚁时像“狮子”一样凶猛。","mnemonic":["把它想成“蚂蚁的狮子”：专门吃蚂蚁、捕食很厉害。","联想画面：沙地里的“漏斗坑”= 蚁狮的招牌陷阱。"]}
{"word":"ant-lover","summary":{"en":"An ant-lover is someone who likes or is very interested in ants.","zh":"ant-lover 指喜欢蚂蚁或对蚂蚁很感兴趣的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who likes, keeps, or is especially interested in ants","zh":"喜欢蚂蚁、饲养蚂蚁或对蚂蚁特别感兴趣的人"},"examples":[{"en":"My brother is an ant-lover who keeps a small ant farm on his desk.","zh":"我弟弟是个蚂蚁爱好者，在桌上养了一个小型蚂蚁农场。"},{"en":"The museum talk is perfect for ant-lovers and other insect fans.","zh":"这场博物馆讲座很适合蚂蚁爱好者和其他昆虫迷。"}]},{"partOfSpeech":"adj.","definition":{"en":"used to describe someone or something that shows affection for ants","zh":"用来形容对蚂蚁友好、喜爱蚂蚁的人或事物"},"examples":[{"en":"She has an ant-lover attitude—she gently moves them outside instead of killing them.","zh":"她对蚂蚁很友好——她会把蚂蚁轻轻移到室外，而不是把它们杀掉。"}]}],"synonyms":["ant lover","insect lover","myrmecophile"],"phonetic":"/ˈænt ˌlʌvər/","extraExplanation":["“ant-lover”不是非常固定的词，更常见的写法是“ant lover”（不加连字符）。加连字符时更像一个整体的称呼或标签，用在名词前更自然：an ant-lover club / an ant-lover community。","如果你想用更正式或更专业的词，可以说“myrmecophile”（蚁类爱好者/研究或偏好蚂蚁的人），但日常口语里用“ant lover”更容易懂。"]}
{"word":"ant-loving","summary":{"en":"Ant-loving describes something that likes ants or lives closely with them; it can also mean being friendly toward ants in a humorous way.","zh":"ant-loving 指“亲蚁的/爱蚂蚁的”，可指与蚂蚁相伴生，也可幽默地表示对蚂蚁很友善。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person, animal, or plant) liking, attracted to, or living in association with ants.","zh":"（人、动物或植物）喜欢蚂蚁的；被蚂蚁吸引的；与蚂蚁共生/相伴生的。"},"examples":[{"en":"Some butterflies have ant-loving larvae that are protected by ants.","zh":"有些蝴蝶的幼虫很“亲蚁”，会被蚂蚁保护。"},{"en":"The scientist studied ant-loving insects that hide inside ant nests.","zh":"这位科学家研究那些“亲蚁”的昆虫，它们会躲在蚁巢里。"}]},{"partOfSpeech":"adj.","definition":{"en":"showing a friendly or positive attitude toward ants (often humorous or descriptive).","zh":"对蚂蚁抱有友善或积极态度的（常带幽默或描写意味）。"},"examples":[{"en":"He’s ant-loving—he gently moves ants outside instead of killing them.","zh":"他很“爱蚂蚁”——会把蚂蚁轻轻移到室外，而不是弄死它们。"},{"en":"Her ant-loving posts make people notice how organized ants are.","zh":"她那些“爱蚂蚁”的帖子让人注意到蚂蚁有多么有组织。"}]}],"synonyms":["myrmecophilous","ant-friendly","ant-associated"],"phonetic":"/ˈæntˌlʌvɪŋ/","extraExplanation":["“ant-loving”常见于科普或描写性文字，也可以是比较口语/幽默的自造形容词；写作时常用连字符表示两个词合起来修饰名词（如 ant-loving insects）。","在生物学里，更正式的对应词是 myrmecophilous（“亲蚁的/与蚂蚁共生的”），常用于描述与蚂蚁共生的昆虫（如某些甲虫、蝴蝶幼虫等）。"]}
{"word":"ant-phobic","summary":{"en":"Ant-phobic means extremely afraid of or strongly disgusted by ants.","zh":"ant-phobic 指“对蚂蚁非常害怕或非常反感”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having an extreme fear or strong dislike of ants.","zh":"对蚂蚁极度害怕或强烈反感的。"},"examples":[{"en":"She’s ant-phobic, so she won’t eat outside if there might be ants.","zh":"她很怕蚂蚁，所以如果可能有蚂蚁，她就不愿意在户外吃东西。"},{"en":"I’m a bit ant-phobic—I know they’re tiny, but they make me panic.","zh":"我有点“怕蚂蚁”——我知道它们很小，但会让我紧张到慌。"}]}],"synonyms":["afraid of ants","fearful of ants","myrmecophobic"],"phonetic":"/ænt ˈfoʊbɪk/","extraExplanation":["“ant-phobic”由 ant（蚂蚁）+ -phobic（恐惧的/排斥的）构成；-phobic 常用于描述对某事物的强烈恐惧或厌恶，如 spider-phobic（怕蜘蛛的）、claustrophobic（幽闭恐惧的）。","日常英语里更常见的说法是 “afraid of ants” 或 “has a fear of ants”。“ant-phobic”较口语化、带点夸张的自我描述，也可用于轻松语境。"]}
{"word":"ant-plant","summary":{"en":"An ant-plant is a plant that offers living space to ants, and the ants often protect and help the plant in return.","zh":"蚁栖植物是为蚂蚁提供居住空间的植物；蚂蚁通常会反过来保护并帮助该植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical plant (often an epiphyte) that provides special living spaces (hollow stems, swollen parts, or cavities) for ants; in return, ants often protect the plant from insects or animals and may bring nutrients.","zh":"（多见于热带、常为附生植物的）蚁栖植物：植物提供中空茎、膨大的结构或洞穴给蚂蚁居住；作为回报，蚂蚁常保护植物免受害虫或动物侵害，并可能为植物带来养分。"},"examples":[{"en":"Some ant-plants have hollow stems where ants live and raise their young.","zh":"有些蚁栖植物的茎是中空的，蚂蚁会在里面居住并繁殖。"},{"en":"The ant-plant benefits because the ants attack insects that try to eat its leaves.","zh":"蚁栖植物受益于蚂蚁会攻击试图啃食叶子的昆虫。"},{"en":"In the rainforest, an ant-plant can grow on a tree without taking nutrients directly from the soil.","zh":"在雨林里，蚁栖植物可以附生在树上生长，而不必直接从土壤获取养分。"}]}],"synonyms":["myrmecophyte","ant plant"],"phonetic":"/ˈænt ˌplænt/","extraExplanation":["“ant-plant”属于生态学里的互利共生（mutualism）例子：植物提供“住处”（常叫 domatia，意为“家”），蚂蚁提供“保镖”和“清洁/施肥”。","常见于热带地区，例如某些茜草科（如 Hydnophytum、Myrmecodia）或金合欢与蚂蚁的共生系统（有时也被归到类似概念里）。","写法上常用连字符 ant-plant，也可写作 ant plant；复数通常为 ant-plants。"]}
{"word":"ant-related","summary":{"en":"“Ant-related” means connected with or involving ants.","zh":"“ant-related”指“与蚂蚁有关的；涉及蚂蚁的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with, about, or involving ants.","zh":"与蚂蚁有关的；涉及蚂蚁的。"},"examples":[{"en":"The museum has an ant-related exhibit about how colonies work.","zh":"博物馆有一个与蚂蚁有关的展览，介绍蚁群如何运作。"},{"en":"Researchers recorded ant-related behavior, like trail-following and food sharing.","zh":"研究人员记录了与蚂蚁有关的行为，例如沿着信息素路径行走和分享食物。"}]}],"synonyms":["ant-associated","ant-connected","related to ants","pertaining to ants"],"phonetic":"/ænt rɪˈleɪtɪd/","extraExplanation":["“ant-related”是由名词ant（蚂蚁）+ related（相关的）组成的复合形容词，常用连字符（-）来把它作为一个整体修饰后面的名词，尤其在名词前使用时更常见：ant-related research / ant-related problems。","在更正式或学术写作中，也可用更具体的表达来替换：related to ants / pertaining to ants / myrmecological（意为“研究蚂蚁的”但更专业）。","注意不要与“aunt-related”（与阿姨/姑妈等亲属相关）混淆；两者发音不同：ant /ænt/，aunt 在美式英语中常见 /ænt/ 或 /ɑnt/，需结合语境判断。"]}
{"word":"ant-resistant","summary":{"en":"Ant-resistant means designed to prevent ants from entering or living in something.","zh":"ant-resistant 指“防蚂蚁的”，即设计用来阻止蚂蚁进入或筑巢。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to prevent ants from getting in or living somewhere; designed to resist ants (often by materials, coatings, or construction)","zh":"防蚂蚁的；能阻止蚂蚁进入或筑巢的（常指材料、涂层或结构设计）"},"examples":[{"en":"We bought an ant-resistant container to store sugar and flour.","zh":"我们买了一个防蚂蚁的容器来装糖和面粉。"},{"en":"This ant-resistant seal helps keep insects out of the pantry.","zh":"这种防蚂蚁的密封设计能帮助把昆虫挡在储藏柜外。"},{"en":"Some outdoor fabrics are ant-resistant and easier to clean.","zh":"有些户外面料具有防蚂蚁性能，而且更容易清洁。"}]}],"synonyms":["insect-resistant","pest-resistant","ant-proof"],"phonetic":"/ænt rɪˈzɪstənt/","extraExplanation":["“ant-resistant”是常见的英文复合形容词（名词 + resistant），多用于产品说明或功能描述（如容器、门窗密封条、涂料、织物等）。通常带连字符是为了让读者把它当作一个整体来理解。","它强调“抗/防蚂蚁”的效果，但不一定表示“完全不会有蚂蚁”。在实际语境中常和“to / against ants（防蚂蚁）”含义接近。"]}
{"word":"ant-shaped","summary":{"en":"“Ant-shaped” describes something that looks like an ant in shape.","zh":"“ant-shaped”用来形容某物外形像蚂蚁。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape or appearance of an ant; resembling an ant in form.","zh":"蚂蚁形的；外形像蚂蚁的。"},"examples":[{"en":"Under the microscope, the tiny robot looked ant-shaped, with a narrow waist and six legs.","zh":"在显微镜下，这个微型机器人看起来像蚂蚁一样，有细腰和六条腿。"},{"en":"The ant-shaped icon on the screen shows where the insect mode is turned on.","zh":"屏幕上的蚂蚁形图标表示昆虫模式已开启。"}]}],"synonyms":["antlike","ant-like","formic (technical)"],"phonetic":"/ˈænt ˌʃeɪpt/","extraExplanation":["“ant-shaped”是由名词 + -shaped 组成的复合形容词，常用连字符：star-shaped（星形的）、heart-shaped（心形的）、egg-shaped（蛋形的）。通常用于描述外观而不是功能或行为。"]}
{"word":"ant-sized","summary":{"en":"Ant-sized means extremely small, about the size of an ant.","zh":"Ant-sized 指“极小的，像蚂蚁那么大”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Extremely small—about the size of an ant; used to emphasize how tiny something is.","zh":"极小的——像蚂蚁那么大；用来强调某物非常微小。"},"examples":[{"en":"The robot was ant-sized and could crawl through narrow pipes.","zh":"这个机器人只有蚂蚁大小，可以爬进很窄的管道。"},{"en":"From the top of the mountain, the cars looked ant-sized.","zh":"从山顶看下去，汽车看起来像蚂蚁那么小。"},{"en":"She found an ant-sized chip inside the toy.","zh":"她在玩具里发现了一块蚂蚁大小的芯片。"}]}],"synonyms":["tiny","minuscule","microscopic","small","minute"],"phonetic":"/ˈænt.saɪzd/","extraExplanation":["“ant-sized”是由名词“ant”和“sized”（……大小的）组成的复合形容词，常用连字符连接，尤其在名词前作定语时更常见：an ant-sized robot。","它多用于口语或科普/新闻写作中，用生动的比喻来强调“非常小”。"]}
{"word":"ant-symbiotic","summary":{"en":"Ant-symbiotic describes an organism that lives in close association with ants, often benefiting from (and sometimes benefiting) the ants.","zh":"ant-symbiotic 指与蚂蚁形成紧密共生关系的生物，通常从蚂蚁获得（也可能给予）好处。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) Living in a close relationship with ants, often so that both benefit; associated with ant symbiosis.","zh":"（生物）与蚂蚁形成紧密共生关系的；与“蚁共生”有关的（常常彼此受益）。"},"examples":[{"en":"Some butterflies have ant-symbiotic larvae that are protected by ants.","zh":"有些蝴蝶的幼虫与蚂蚁共生，蚂蚁会保护它们。"},{"en":"The researcher studied ant-symbiotic plants that offer nectar in exchange for defense.","zh":"研究人员研究了与蚂蚁共生的植物：植物提供花外蜜，换取蚂蚁防御。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Broader) Adapted to living with ants or relying on ants for survival (e.g., for food, shelter, or protection).","zh":"（广义）适应与蚂蚁共同生活或依赖蚂蚁生存的（如依赖蚂蚁获取食物、住所或保护）。"},"examples":[{"en":"This beetle is ant-symbiotic and can live inside an ant nest.","zh":"这种甲虫与蚂蚁共生，可以住在蚁巢里。"},{"en":"Ant-symbiotic species often evolve chemical signals to avoid being attacked.","zh":"蚁共生物种常常进化出化学信号，以避免被蚂蚁攻击。"}]}],"synonyms":["myrmecophilous","ant-associated","ant-dependent","symbiotic with ants"],"phonetic":"/ˌænt saɪmˈbaɪɑtɪk/","extraExplanation":["“ant-symbiotic”是由 ant（蚂蚁）+ symbiotic（共生的）构成的复合形容词，多见于生态学/昆虫学写作。它描述的是与蚂蚁形成稳定互动的生物（昆虫、植物、真菌等）。","相关概念：myrmecophilous（嗜蚁的/与蚂蚁共栖的，较学术）、myrmecophyte（蚁栖植物）。有些关系是互利共生（mutualism），也可能偏“寄居/利用”（如某些昆虫借蚁巢庇护）。"]}
{"word":"ant-thrush","summary":{"en":"An ant-thrush is a tropical forest-floor bird that often follows army ants to catch insects; it isn’t a true thrush.","zh":"ant-thrush 指一种热带林下鸟，常跟随行军蚁捕食昆虫；并非真正的鸫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical bird (especially in Central and South America) that lives on the forest floor and often follows army ants to catch insects the ants flush out; it is not a true thrush.","zh":"一种热带林下鸟类（多见于中南美洲），常跟随行军蚁（军蚁）捕食被蚂蚁惊出的昆虫；它并非真正的“鸫（thrush）”。"},"examples":[{"en":"We saw an ant-thrush walking quietly along the leaf litter, hunting insects.","zh":"我们看到一只蚁鸫在落叶层上安静地走动，捕捉昆虫。"},{"en":"In some forests, ant-thrushes may follow army ants for easy prey.","zh":"在一些森林里，蚁鸫可能会跟随行军蚁，以更容易获得猎物。"}]}],"synonyms":["antbird","antpitta (related term)","Formicariid (technical)"],"phonetic":"/ˈænt ˌθrʌʃ/","extraExplanation":["“ant-thrush”是一个常见俗名（common name），通常指蚁鸫科（Formicariidae）或相关类群的林下鸟。名字里有“thrush”主要因为外形或习性像鸫，但分类上并不属于真正的鸫科（Turdidae）。","写作中常用复数：ant-thrushes。也常见更宽泛的相关俗名如“antbird（蚁鸟）”“antpitta（蚁鴷/蚁鸫类近缘）”，具体物种要看地区与语境。"]}

