{"word":"ANTA","summary":{"en":"“ANTA” most commonly refers to the Chinese sportswear brand Anta; it can also be an acronym whose meaning depends on context.","zh":"“ANTA”最常指中国运动品牌“安踏”；也可能是缩略词，具体含义取决于语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Chinese sportswear brand (Anta Sports), known for athletic shoes and clothing; often written as “ANTA.”","zh":"中国运动品牌（安踏体育），以运动鞋服闻名；常写作“ANTA”。"},"examples":[{"en":"He bought a pair of ANTA running shoes online.","zh":"他在网上买了一双安踏跑鞋。"},{"en":"ANTA is a popular sportswear brand in China.","zh":"安踏在中国是很受欢迎的运动品牌。"}]},{"partOfSpeech":"other","definition":{"en":"An acronym with multiple possible meanings depending on context (e.g., names of organizations).","zh":"一个缩略词，含义会随语境而变化（例如某些机构名称）。"},"examples":[{"en":"In this document, ANTA refers to a professional association.","zh":"在这份文件里，ANTA指的是一个专业协会。"},{"en":"Always check what ANTA stands for in the specific context.","zh":"一定要在具体语境中确认ANTA代表什么。"}]}],"synonyms":["Anta (brand name)"],"phonetic":"/ˈæntə/","extraExplanation":["全大写“ANTA”常见于品牌标识或缩略词。若你是在某篇文章/报告里看到的，最好提供一句原文，我可以帮你准确判断这里的ANTA到底指哪一个机构或含义。"]}
{"word":"Anta","summary":{"en":"“Anta” most often refers to the Chinese sportswear brand; lowercase “anta” can mean “tapir” in Spanish/Portuguese contexts.","zh":"“Anta”多指中国运动品牌安踏；小写“anta”在西/葡语语境中可指“貘”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Anta (usually capitalized): a Chinese sportswear and athletic-shoe brand/company. \nExamples: (1) EN: Anta makes basketball shoes.  ZH: 安踏生产篮球鞋。 (2) EN: She bought an Anta jacket online.  ZH: 她在网上买了一件安踏夹克。","zh":"Anta（通常大写）：中国的运动服装与运动鞋品牌/公司（安踏）。\n例句：(1) EN: Anta makes basketball shoes.  ZH: 安踏生产篮球鞋。 (2) EN: She bought an Anta jacket online.  ZH: 她在网上买了一件安踏夹克。"},"examples":[{"en":"Anta makes basketball shoes.","zh":"安踏生产篮球鞋。"},{"en":"She bought an Anta jacket online.","zh":"她在网上买了一件安踏夹克。"}]},{"partOfSpeech":"n.","definition":{"en":"anta (lowercase, rare in English): a tapir; used mainly in Spanish/Portuguese contexts. \nExamples: (1) EN: In some regions, people call a tapir an “anta.”  ZH: 在一些地区，人们把貘叫作“anta”。","zh":"anta（小写，英语中较少见）：貘（tapir）；主要出现在西班牙语/葡萄牙语语境中。\n例句：(1) EN: In some regions, people call a tapir an “anta.”  ZH: 在一些地区，人们把貘叫作“anta”。"},"examples":[{"en":"In some regions, people call a tapir an “anta.”","zh":"在一些地区，人们把貘叫作“anta”。"}]}],"synonyms":["(brand) ANTA Sports","(animal) tapir"],"phonetic":"/ˈæntə/","extraExplanation":["大小写很重要：写作 **Anta** 时，通常指品牌“安踏”；写作 **anta** 时，才可能是外来词（在西/葡语里指“貘”）。","品牌读音在英语里常近似 /ˈæntə/；若你指的是安踏（ANTA Sports），在中文里常读“ān tà”。"]}
{"word":"anta","summary":{"en":"“anta” can mean a tapir (mainly from Spanish/Portuguese), or it can be a proper name such as ANTA (an acronym) or Anta/ANTA (a sportswear brand).","zh":"“anta”可指“貘”（多来自西/葡语语境），也可作专有名词，如 ANTA（缩写）或 Anta/ANTA（运动品牌名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tapir (a large plant-eating mammal with a short trunk), especially in South American usage; the word comes from Spanish/Portuguese.","zh":"貘（tapir，一种大型食草哺乳动物，鼻子像短短的小象鼻），多见于南美语境；该词来自西班牙语/葡萄牙语。"},"examples":[{"en":"In some South American regions, people may call a tapir an anta.","zh":"在南美一些地区，人们可能把貘称为 anta。"},{"en":"The wildlife guide mentioned the anta as an important seed-spreading animal in the rainforest.","zh":"野生动物向导提到，貘（anta）在雨林里是重要的“传播种子”的动物。"}]},{"partOfSpeech":"n.","definition":{"en":"Anta (often written ANTA): an acronym used in names of organizations (e.g., the former American National Theatre and Academy).","zh":"Anta（常写作 ANTA）：用于某些机构名称中的缩写（例如已停办的“美国国家戏剧与学院”）。"},"examples":[{"en":"The play was once recognized by ANTA (the American National Theatre and Academy).","zh":"这部戏曾得到 ANTA（美国国家戏剧与学院）的认可。"}]},{"partOfSpeech":"n.","definition":{"en":"Anta: a proper name, commonly known as a Chinese sportswear brand name (ANTA).","zh":"Anta：专有名词，常指中国运动品牌“安踏”（ANTA）。"},"examples":[{"en":"He bought a pair of Anta running shoes.","zh":"他买了一双安踏（Anta）的跑鞋。"},{"en":"ANTA is a well-known sportswear company in China.","zh":"ANTA 是中国知名的运动服饰公司。"}]}],"synonyms":["tapir"],"phonetic":"/ˈæn.tə/","extraExplanation":["在英语里，“anta”本身不算高频词：如果你在动物/自然纪录片或南美语境读物里看到，多半指“貘（tapir）”。","如果你是在新闻或购物场景看到大写“ANTA/Anta”，通常是品牌名或机构缩写；是否需要按缩写读字母（A-N-T-A）取决于具体场景与写法。"]}
{"word":"Antabus","summary":{"en":"Antabuse is a brand-name medicine (disulfiram) used to support treatment of alcohol dependence by causing unpleasant effects if alcohol is consumed.","zh":"Antabuse（安他布斯）是双硫仑的商品名，用于辅助治疗酒精依赖；饮酒会引发不适反应以帮助戒酒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand name for disulfiram, a medicine used to help treat alcohol dependence by causing unpleasant reactions if alcohol is consumed","zh":"安他布斯（商品名）：即“双硫仑”，用于辅助治疗酒精依赖；饮酒时会引发不适反应以帮助戒酒"},"examples":[{"en":"The doctor prescribed Antabuse to help him stay sober.","zh":"医生开了安他布斯来帮助他保持戒酒状态。"},{"en":"If you take Antabuse, you must avoid alcohol completely.","zh":"如果你在服用安他布斯，就必须完全避免酒精。"},{"en":"She asked the pharmacist how long Antabuse stays in the body.","zh":"她问药师安他布斯在体内会停留多久。"}]}],"synonyms":["disulfiram","disulfiram (generic name)"],"phonetic":"/ænˈtæb.juːs/","extraExplanation":["“Antabuse/安他布斯”是商标名，通用名是 disulfiram（双硫仑）。在学习或写作中，更正式/学术的表达常用 disulfiram。","它通过抑制酒精代谢中的一种酶，使人在饮酒后出现脸红、恶心、心悸等不适反应；因此服药期间（以及停药后一段时间内）都应避免含酒精的饮品、药品或某些含酒精产品。","医学用药需遵医嘱；不同国家/地区对用法与安全提醒可能略有差异。"]}
{"word":"Antabuse","summary":{"en":"Antabuse is a brand-name medicine (disulfiram) used to discourage drinking by causing unpleasant reactions if alcohol is consumed.","zh":"Antabuse（安他布司）是双硫仑的商品名，用于通过“饮酒会不适”的反应来帮助戒酒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand name for disulfiram, a medicine used to help treat alcohol use disorder by causing unpleasant symptoms if alcohol is consumed","zh":"（商标名）安他布司；双硫仑，一种用于辅助治疗酒精使用障碍的药物：一旦饮酒会引发强烈不适，从而起到“阻酒/戒酒”作用"},"examples":[{"en":"He started Antabuse as part of a treatment plan for alcohol use disorder.","zh":"他开始服用安他布司，作为酒精使用障碍治疗计划的一部分。"},{"en":"If you drink while taking Antabuse, you can become very sick.","zh":"服用安他布司期间饮酒可能会让你非常难受。"},{"en":"Her doctor explained the risks and asked her to avoid all alcohol, even in some cough syrups.","zh":"医生解释了风险，并让她避免所有含酒精的东西，甚至包括某些止咳糖浆。"}]}],"synonyms":["disulfiram","alcohol-deterrent medicine"],"phonetic":"/ænˈtæb.juːs/","extraExplanation":["Antabuse 是药物“disulfiram（双硫仑）”的常见商品名之一。它并不是“消除酒瘾”的药，而是一种“行为威慑”类药物：让饮酒变得不舒服，从而帮助人坚持不喝。","服药期间不只要避免酒精饮料，也要注意含酒精的食物、漱口水、药物（如部分止咳糖浆）等，避免出现不良反应。具体用药与禁忌应遵医嘱。"]}
{"word":"antacid","summary":{"en":"An antacid is a medicine (or something with an antacid effect) that reduces stomach acid to relieve heartburn and indigestion.","zh":"antacid 指抗酸药/制酸剂，或“抗酸的”，用于减少胃酸、缓解烧心与消化不良。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medicine that reduces stomach acid to relieve heartburn, indigestion, or an upset stomach","zh":"抗酸药；制酸剂（中和或降低胃酸，用于缓解烧心、消化不良或胃部不适）"},"examples":[{"en":"I took an antacid after dinner because I had heartburn.","zh":"晚饭后我烧心，所以吃了一片抗酸药。"},{"en":"Some antacids work quickly, but the relief may not last long.","zh":"有些抗酸药起效很快，但缓解可能不持久。"},{"en":"If you need an antacid every day, talk to a doctor.","zh":"如果你每天都需要吃抗酸药，建议咨询医生。"}]},{"partOfSpeech":"adj.","definition":{"en":"able to prevent or reduce acidity (especially in the stomach)","zh":"抗酸的；制酸的（尤指抑制或中和胃酸）"},"examples":[{"en":"Milk is sometimes described as having an antacid effect, though it may not help everyone.","zh":"牛奶有时被说成有“抗酸作用”，但并非对每个人都有帮助。"}]}],"synonyms":["acid reducer","heartburn medicine","indigestion remedy"],"phonetic":"/æntˈæsɪd/","extraExplanation":["“antacid”由“anti-（反、抗）+ acid（酸）”组成，字面意思就是“对抗酸的”。","常见类型包括：含碳酸钙（calcium carbonate）、氢氧化镁/铝（magnesium/aluminum hydroxide）等；有的还会加入“alginate（海藻酸盐）”形成保护层，减少反流不适。","学习提醒：heartburn（烧心）不等于“心脏痛”，而是胃酸反流刺激食道导致的灼热感。若症状频繁或严重，应就医而不是长期自行用药。"]}
{"word":"antacids","summary":{"en":"Antacids are medicines that neutralize or reduce stomach acid to relieve heartburn and indigestion.","zh":"Antacids 指抗酸剂/制酸药，用来中和或减少胃酸，缓解烧心和消化不良。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medicine that reduces or neutralizes stomach acid, used to relieve heartburn, acid indigestion, or an upset stomach.","zh":"抗酸剂；制酸药（用来中和或减少胃酸，缓解烧心、胃酸过多或消化不良）"},"examples":[{"en":"I took an antacid after dinner because I had heartburn.","zh":"晚饭后我烧心，所以吃了一片抗酸剂。"},{"en":"Some antacids work fast but don’t last very long.","zh":"有些抗酸剂起效很快，但持续时间不长。"},{"en":"If you need antacids every day, talk to a doctor.","zh":"如果你每天都需要吃抗酸剂，建议咨询医生。"}]}],"synonyms":["acid reducer","heartburn medicine","stomach soother"],"phonetic":"/æntˈæsɪdz/","extraExplanation":["“Antacid”由 anti-（反、对抗）+ acid（酸）构成；“antacids”是复数形式，表示“多种抗酸剂”或“多片/多剂”。","常见成分包括碳酸钙（calcium carbonate）、氢氧化镁（magnesium hydroxide）等；不同成分可能导致不同反应（例如便秘或腹泻）。","在日常英语里，“antacid”常指非处方药（OTC）。如果症状频繁，医生可能会建议其他药物类别，比如 H2 blockers 或 PPIs。"]}
{"word":"antacrid","summary":{"en":"Antacrid means reducing or preventing irritating, acrid effects (a rare, old-fashioned term), often used about remedies for stomach irritation.","zh":"Antacrid 指减轻或防止“刺激性/辛辣灼痛感”的（较罕见、偏旧式用法），常用于描述缓解胃部刺激的不适或药物作用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) preventing or relieving acridity (sharp, bitter, or irritating qualities), especially in medicines for an upset or overly acidic stomach.","zh":"（罕见）防止或缓解“辛辣/刺激性（酸腐、灼痛感）”的；尤指用于缓解胃部酸刺激或不适的药物/作用。"},"examples":[{"en":"The old medical text mentions an antacrid mixture to calm stomach irritation.","zh":"那本旧医学书提到一种“antacrid（抗刺激/缓酸刺激）”的混合剂，用来缓解胃部刺激。"},{"en":"Some herbs were described as antacrid because they reduced the burning feeling after meals.","zh":"有些草药被描述为 antacrid，因为它们能减轻饭后的灼热感。"}]}],"synonyms":["anti-irritant","soothing","non-irritating","antacid (related, not identical)"],"phonetic":"/ˌæntiˈækrɪd/","extraExplanation":["“antacrid”是较少见、偏旧式/专业的词，常见于早期药学或医学语境中；现代更常用的表达通常是“antacid（抗酸剂）”或“soothing/anti-irritant（舒缓/抗刺激）”。","词源可拆为“anti-（反、抗）+ acrid（辛辣刺喉的；刺激性的）”。注意：它不等同于“antacid（抗酸）”，但在胃部不适的语境里含义可能接近。"]}
{"word":"antadiform","summary":{"en":"Antadiform means “duck-like in shape,” mainly used in scientific descriptions.","zh":"antadiform 意为“鸭形的/像鸭子的”，多用于科学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Duck-like in form; resembling a duck (used mainly in biology/zoology).","zh":"鸭形的；像鸭子的（主要用于生物学/动物学）。"},"examples":[{"en":"The fossil has an anatidiform bill, suggesting it fed like a duck.","zh":"这块化石有鸭形的喙，暗示它的取食方式像鸭子。"},{"en":"Some early waterfowl show antadiform features in the skull.","zh":"一些早期水禽的头骨显示出鸭形特征。"}]}],"synonyms":["anatiform","ducklike","anatid"],"phonetic":"/ˌænəˈtædɪˌfɔrm/","extraExplanation":["“antadiform”在现代英语里很少见，很多情况下你可能想写的是更常见的“anatiform”（意为“鸭形的”）。","词源上与拉丁语/科学用语中表示“鸭”的成分有关（如 *Anatidae* 表示鸭科），常见于动物分类与形态描述。"]}
{"word":"antae","summary":{"en":"Antae is the plural of anta: square, wall-connected pillars at the ends of a classical building’s facade.","zh":"Antae 是 anta 的复数，指古典建筑立面两端与墙相连的方形端柱/壁柱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"projecting square pillars (the plural of anta) built as an extension of a wall, especially at the ends of a classical building’s facade (often framing a doorway or porch).","zh":"（anta 的复数）壁柱、端柱：从墙体向外突出的方形柱状结构，常见于古典建筑立面两端，用于框出门口或门廊。"},"examples":[{"en":"The temple’s entrance is framed by two antae and a pair of columns.","zh":"这座神庙的入口由两根端柱（antae）和一对圆柱共同框出。"},{"en":"In the plan, the antae mark the ends of the front wall.","zh":"在平面图中，端柱标示出前墙的两端。"}]}],"synonyms":["anta","pilasters","wall pillars"],"phonetic":"/ˈæn.tiː/","extraExplanation":["“Antae”主要用于建筑学语境，尤其是描述古希腊/古罗马的神庙与公共建筑。它和“pilaster（壁柱）”相近，但“anta（端柱）”通常特指位于墙端、与墙体连成一体、用于“收边/框定”立面的那种壁柱。","在阅读艺术史或建筑史材料时，常见搭配有“in antis（在端柱之间）”，如“a porch in antis（端柱式门廊）”，表示门廊的柱子位于两根端柱之间。"]}
{"word":"Antaea","summary":{"en":"Antaea is a Greek-mythology queen (also called Anteia/Stheneboea) famous for falsely accusing Bellerophon.","zh":"Antaea 是希腊神话中的王后（亦称 Anteia/Stheneboea），以诬陷柏勒洛丰而著名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Greek mythology) The queen of Tiryns (also called Anteia or Stheneboea), wife of King Proetus, known for falsely accusing the hero Bellerophon after he rejected her.","zh":"（希腊神话）提林斯（Tiryns）的王后，又作 Anteia 或 Stheneboea，为普罗托斯（Proetus）之妻；因被英雄柏勒洛丰（Bellerophon）拒绝后诬陷他而知名。"},"examples":[{"en":"In the myth, Antaea accuses Bellerophon, which sets the tragedy in motion.","zh":"在神话中，安塔埃娅（Antaea）诬告柏勒洛丰，从而推动了悲剧的发展。"},{"en":"Some translations call her Anteia instead of Antaea.","zh":"有些译本用 Anteia 来称呼她，而不是 Antaea。"}]}],"synonyms":["Anteia","Stheneboea"],"phonetic":"/ænˈtiːə/","extraExplanation":["“Antaea”多见于古典神话与文学改写作品中，属于专名而非日常词汇。她的故事常被用来讨论“被拒后的报复”“诬告”与“权力关系”等主题。","人物名在英译中拼法不一（Antaea/Anteia/Stheneboea），阅读时可把它们视为同一人物的不同转写；在不同版本（荷马之后的传统、悲剧改写、现代小说）中细节也可能略有差异。"]}
{"word":"Antaean","summary":{"en":"Antaean means ‘drawing strength from the earth or one’s roots,’ from the myth of Antaeus.","zh":"Antaean 指“从大地或自身根源汲取力量的”，源自安泰俄斯的神话意象。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Literary) Relating to Antaeus, the giant in Greek myth who drew his strength from contact with the earth; by extension, gaining power from one’s native land, roots, or direct contact with the ground.","zh":"（文学用语）与希腊神话中的巨人安泰俄斯（Antaeus）有关；引申为从大地、故土或自身根源中汲取力量的。"},"examples":[{"en":"The poet describes the farmer as Antaean, renewed each day by the soil under his feet.","zh":"诗人把农夫描写成“安泰俄斯式”的人：脚下的泥土让他每天都重新获得力量。"},{"en":"After months abroad, she felt an Antaean surge of energy when she returned home.","zh":"在国外待了几个月后，她回到家时感到一种“安泰俄斯式”的力量涌上心头。"}]}],"synonyms":["earthborn","rooted","grounded","soil-bound"],"phonetic":"/ænˈtiːən/","extraExplanation":["“Antaean”来自希腊神话人物 Antaeus（安泰俄斯）：他只要一接触大地就会变强，因此英雄赫拉克勒斯（Heracles/Hercules）把他举离地面才击败他。英语里用 Antaean 形容“与土地相连就更强”、或“从故土/根源获得力量”的意象，常见于诗歌、评论与修辞性写作。"]}
{"word":"antaean","summary":{"en":"Antaean means “like Antaeus,” suggesting strength renewed by contact with the earth or one’s roots.","zh":"Antaean 指“如安泰俄斯般的”，常比喻力量来自与大地或根源（故土、传统）的联系并因此得以恢复。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Antaeus (a giant in Greek myth), or suggesting great strength—especially strength renewed by contact with the earth or one’s homeland.","zh":"与（希腊神话中的巨人）安泰俄斯有关的；也指“如安泰俄斯般的”，尤指力量来自与大地或故土的联系、并能因此恢复或增强。"},"examples":[{"en":"The poet describes the farmers’ Antaean strength, rising again after every hardship.","zh":"诗人描写农民“安泰俄斯般的力量”，每次困苦之后都能重新振作。"},{"en":"After walking barefoot on the grass, she felt Antaean—calmer and strangely energized.","zh":"在草地上赤脚走了一会儿后，她感觉自己仿佛拥有“安泰俄斯式”的力量——更平静，也莫名更有精神。"},{"en":"He draws Antaean confidence from returning to his hometown.","zh":"他从回到家乡中获得一种“安泰俄斯式”的自信与力量。"}]}],"synonyms":["earth-born","Herculean (similar idea of great strength, but not the same source)","giantlike"],"phonetic":"/ænˈtiːən/","extraExplanation":["“Antaean”来自希腊神话人物安泰俄斯（Antaeus）：他只要接触大地（其母盖娅 Gaia），力量就会不断恢复。英雄赫拉克勒斯（Heracles）将他抱离地面才击败他。因此在文学或评论中，Antaean 常被用来比喻“从土地、根源、传统或故土中汲取力量”，带有较强的修辞色彩，较少用于日常口语。"]}
{"word":"Antaeus","summary":{"en":"Antaeus is a Greek mythological giant who gained strength from the earth; the name is also used as an allusion to strength renewed by returning to one’s roots.","zh":"Antaeus（安泰俄斯）是希腊神话中靠大地获得力量的巨人；其名也常作典故，指回到根源/家乡后恢复力量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, a giant (son of Poseidon and Gaia) who became stronger whenever he touched the earth, and was defeated by Heracles (Hercules) when lifted off the ground.","zh":"（希腊神话）安泰俄斯：巨人（海神波塞冬与大地女神盖娅之子），一接触地面就会变得更强，后来被赫拉克勒斯（Hercules）举离地面而击败。"},"examples":[{"en":"In the myth, Antaeus challenged travelers to wrestling matches and killed those he defeated.","zh":"在神话里，安泰俄斯常向过路人发起摔跤挑战，并杀死被他打败的人。"},{"en":"Heracles defeated Antaeus by holding him in the air so he could not draw strength from the earth.","zh":"赫拉克勒斯把安泰俄斯举到空中，使他无法从大地获得力量，从而击败了他。"}]},{"partOfSpeech":"n.","definition":{"en":"A literary or cultural reference to someone who seems renewed or empowered by returning to their home, roots, or familiar environment (like gaining strength from ‘the ground’).","zh":"（文学/文化典故）指一个人回到家乡、根源或熟悉环境后仿佛“充电”般恢复力量、精神更强。"},"examples":[{"en":"After weeks of travel, she felt like Antaeus the moment she stepped back into her neighborhood.","zh":"旅行数周后，她一踏回自己的社区就像安泰俄斯一样立刻恢复了精神。"},{"en":"He draws confidence from his community—an Antaeus-like strength.","zh":"他从自己的社群中汲取自信——一种“安泰俄斯式”的力量。"}]}],"synonyms":["giant","mythological figure","earthborn (poetic)","allusion (in writing)"],"phonetic":"/ænˈtiːəs/","extraExplanation":["“安泰俄斯的力量来自大地”常被用来隐喻：人与土地、故乡、传统、社群的连接会带来心理与精神上的支撑。写作时可用作形象化的比喻，但通常需要读者对古典神话有一定了解。","在英文写作中，Antaeus 常作为典故出现于散文、诗歌或评论里，用来强调“离地（脱离根基）就会变弱”的主题；与其相关的英雄是 Heracles（Hercules）。"]}
{"word":"antaeus","summary":{"en":"Antaeus is a mythological giant who gained strength from the earth; in writing, it can symbolize renewed strength from one’s roots or being grounded.","zh":"Antaeus（安泰俄斯）是希腊神话中“触地更强”的巨人；在写作中常比喻从根源/故土或脚踏实地中获得再生力量。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"In Greek mythology, a giant (son of Gaia, the Earth) who became stronger whenever he touched the ground; he was defeated by Heracles/Hercules, who lifted him into the air.","zh":"（希腊神话）安泰俄斯：大地女神盖娅之子、力大无穷的巨人；只要接触地面就会变得更强，最终被赫拉克勒斯/海格力斯举离地面而击败。"},"examples":[{"en":"In the myth, Antaeus could not be beaten as long as his feet touched the earth.","zh":"在神话里，只要安泰俄斯的脚还踩在地上，他就几乎无法被打败。"},{"en":"Hercules defeated Antaeus by lifting him off the ground and crushing him.","zh":"海格力斯把安泰俄斯举离地面并将其制服，从而打败了他。"}]},{"partOfSpeech":"other","definition":{"en":"(Literary) A person who draws strength from their homeland, roots, or direct contact with what supports them; someone who is ‘stronger when grounded.’","zh":"（文学/比喻）指从故土、根源或“支撑自己的事物”中获得力量的人；越“脚踏实地”越强大的人。"},"examples":[{"en":"After months away, she returned home like Antaeus, stronger the moment she felt grounded again.","zh":"离家数月后，她回到家仿佛安泰俄斯一般，一重新“落地生根”就更有力量。"},{"en":"The poet uses Antaeus as a symbol of strength renewed by contact with the earth.","zh":"诗人用安泰俄斯象征“与大地接触便重新获得力量”的意象。"}]}],"synonyms":["mythological giant","symbol of being grounded","earth-strength figure"],"phonetic":"/ænˈtiːəs/","extraExplanation":["安泰俄斯（Antaeus）常被用来解释“根基/连接感带来力量”的主题：他每次被摔倒、触地，反而会因大地之母盖娅而恢复或增强力量。","在英语写作里，Antaeus 作为典故（allusion）常出现在文学、演讲或评论中，用来比喻“回到土地、传统、社群或初心就变强”。","拼写提示：Antaeus 是专有名词，通常首字母大写。常见对应名：Heracles（希腊名）/ Hercules（罗马名）。"]}
{"word":"antagonisable","summary":{"en":"Antagonisable means “able to be opposed or blocked,” especially in scientific/medical contexts.","zh":"Antagonisable 指“可被对抗或阻断的”，尤其常用于科学/医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be antagonized; able to be opposed, blocked, or counteracted (often used in scientific or medical writing).","zh":"可被拮抗的；可被对抗、阻断或抵消的（常见于科学或医学语境）。"},"examples":[{"en":"The pain response is partly antagonisable by this medication.","zh":"这种疼痛反应可被这种药物在一定程度上拮抗（减弱/阻断）。"},{"en":"Researchers looked for an antagonisable pathway so they could stop the signal.","zh":"研究人员寻找一种可被拮抗的通路，以便阻断该信号。"}]},{"partOfSpeech":"adj.","definition":{"en":"Able to be made hostile or annoyed (rare; usually replaced by “provokable” or “liable to be antagonized”).","zh":"可被激怒或引起敌意的（较少见；常用“provokable”或“liable to be antagonized”替代）。"},"examples":[{"en":"In such debates, even calm people can seem antagonisable.","zh":"在这种辩论中，即使冷静的人也可能显得容易被激怒。"}]}],"synonyms":["antagonizable","blockable","counteractable","inhibitable","opposable"],"phonetic":"/ænˈtæɡəˌnaɪzəbəl/","extraExplanation":["“antagonisable”多见于英式拼写（-ise），美式更常写作“antagonizable”（-ize）。","在药理学里，常说某种效应/受体/通路是“antagonisable”，意思是可以被“拮抗剂（antagonist）”阻断或抵消。日常英语中很少用这个词，常改用更普通的表达如“can be blocked/counteracted”。"]}
{"word":"antagonisation","summary":{"en":"Antagonisation means making someone hostile or opposed; it can also mean blocking an effect in science/medicine.","zh":"Antagonisation 指引发敌意/对立；在科学或医学中也可指拮抗、抵消某种作用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of antagonizing someone; making a person or group feel angry, opposed, or hostile","zh":"使（某人/某群体）产生敌意或反感的行为或过程；激化对立"},"examples":[{"en":"His constant sarcasm led to the antagonisation of the whole team.","zh":"他不断的讽刺导致整个团队对他产生了敌意。"},{"en":"The policy caused antagonisation between local residents and the company.","zh":"这项政策加剧了当地居民与公司之间的对立。"}]},{"partOfSpeech":"n.","definition":{"en":"(also in science/medicine) the blocking or counteracting of an effect, especially one chemical or drug opposing another","zh":"（亦用于科学/医学）拮抗作用；（一种物质或药物）阻断或抵消另一种作用"},"examples":[{"en":"Researchers studied the antagonisation of the receptor by the new drug.","zh":"研究人员研究了这种新药对受体的拮抗作用。"},{"en":"The paper describes antagonisation between two signaling pathways.","zh":"论文描述了两条信号通路之间的拮抗关系。"}]}],"synonyms":["antagonism","provocation","alienation","hostilization","counteraction","inhibition"],"phonetic":"/ænˌtæɡənaɪˈzeɪʃən/","extraExplanation":["“antagonisation”更常见于英式拼写；美式更常写作“antagonization”。两者意思相同。","词根来自希腊语“antagonistēs”（对手、竞争者）。词形上：antagonize（使对立）→ antagonisation/antagonization（名词：使对立的过程/结果）。"]}
{"word":"antagonise","summary":{"en":"Antagonise means to make someone hostile or to oppose/counteract something.","zh":"Antagonise 指“惹怒/得罪某人”或“与……对抗、抵消（作用）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone angry or unfriendly toward you; to provoke opposition","zh":"使（某人）生气或产生敌意；激起对立/反对"},"examples":[{"en":"His rude comments antagonised his classmates.","zh":"他粗鲁的评论惹恼了同学。"},{"en":"Try not to antagonise your neighbors over small issues.","zh":"不要因为小事去得罪邻居。"}]},{"partOfSpeech":"vt.","definition":{"en":"to act in opposition to (a person, plan, or force); to hinder or counteract","zh":"与……对抗；阻挠；抵消（作用）"},"examples":[{"en":"Some members of the committee antagonised the new policy.","zh":"委员会里有些成员反对这项新政策。"},{"en":"This medicine can antagonise the effects of another drug.","zh":"这种药可能会抵消另一种药的作用。"}]}],"synonyms":["provoke","irritate","alienate","offend","oppose","counteract","thwart"],"phonetic":"/ænˈtæɡəˌnaɪz/","extraExplanation":["英式拼写是 antagonise，美式更常写作 antagonize，但发音与用法基本相同。","词根来自 Greek（希腊语）antagonist（对手、反对者）。在写作中，antagonise 常带有“把矛盾激化/把人惹毛”的语气；如果只是“不同意”，用 disagree / oppose 往往更中性。"]}
{"word":"antagonised","summary":{"en":"“Antagonised” means someone was made angry/hostile, or was opposed/worked against.","zh":"“antagonised”表示“惹怒/使产生敌意”，也可表示“反对/对抗/作对”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “antagonise”: to make someone feel angry, annoyed, or hostile toward you","zh":"“antagonise”的过去式/过去分词：使某人生气、恼火或对你产生敌意"},"examples":[{"en":"His rude comments antagonised the staff.","zh":"他粗鲁的评论惹恼了员工。"},{"en":"She didn’t mean to antagonise anyone, but her tone sounded harsh.","zh":"她并不想惹恼任何人，但她的语气听起来很刺耳。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “antagonise”: to oppose or work against someone or something","zh":"“antagonise”的过去式/过去分词：反对；与……作对；阻挠"},"examples":[{"en":"The new policy antagonised local businesses by increasing costs.","zh":"新政策因提高成本而引起当地企业的反对。"},{"en":"He antagonised his teammates by refusing to cooperate.","zh":"他拒绝合作，等于在和队友作对。"}]}],"synonyms":["angered","irritated","offended","provoked","alienated","opposed","resisted"],"phonetic":"/ænˈtæɡəˌnaɪzd/","extraExplanation":["英式拼写是 antagonise / antagonised；美式拼写更常见 antagonize / antagonized，意思相同。","词根来自希腊语 anti-（反对）+ agon（竞争、斗争），所以既可表示“惹怒”，也可表示“对抗/反对”。"]}
{"word":"antagonising","summary":{"en":"Antagonising means making someone angry or actively opposing them; it’s the -ing form of antagonise (UK spelling).","zh":"antagonising 指“惹恼/激怒”或“对抗/作对”；是 antagonise（英式拼写）的 -ing 形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"making someone annoyed or angry, often by saying or doing something unkind or challenging","zh":"惹恼；激怒（常因言行不友善或挑衅）"},"examples":[{"en":"He kept antagonising his sister by taking her things without asking.","zh":"他老是不先问就拿妹妹的东西，把她惹恼了。"},{"en":"Try not to antagonise your classmates with rude jokes.","zh":"尽量别用无礼的玩笑去惹恼同学。"}]},{"partOfSpeech":"v.","definition":{"en":"actively opposing or working against someone or something","zh":"对抗；与……作对（积极反对或阻碍）"},"examples":[{"en":"The two groups were antagonising each other during the debate.","zh":"辩论中两组人彼此对抗。"},{"en":"He worried that the new policy was antagonising local businesses.","zh":"他担心新政策会与本地企业对立起来。"}]}],"synonyms":["irritating","provoking","annoying","alienating","opposing"],"phonetic":"/ænˈtæɡəˌnaɪzɪŋ/","extraExplanation":["“antagonising”是英式拼写（antagonising）；美式更常写作“antagonizing”。两者意思相同。","语气提示：这个词通常带负面含义，暗示“故意或反复惹人不快/制造对立”。如果只是“不同意”，更中性可以用“disagree (with)”或“oppose”。"]}
{"word":"antagonism","summary":{"en":"Antagonism means strong hostility or opposition; in science/medicine it can mean one force or drug working against another.","zh":"Antagonism 指强烈的敌意或对立；在科学/医学语境中也可指拮抗作用（相互抵消、削弱效果）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"active hostility or opposition toward someone or something; a feeling of being against them.","zh":"对某人或某事的敌意或对立；强烈的反对情绪。"},"examples":[{"en":"There was clear antagonism between the two teams after the argument.","zh":"争吵之后，两支队伍之间明显产生了敌意。"},{"en":"Years of unfair policies created antagonism toward the government.","zh":"多年的不公平政策引发了民众对政府的反感与对立。"}]},{"partOfSpeech":"n.","definition":{"en":"(in biology/medicine) an interaction in which one force, drug, or muscle works against another, reducing its effect.","zh":"（生物/医学）拮抗作用：一种力量、药物或肌肉与另一种相对抗，从而削弱其效果。"},"examples":[{"en":"Some drugs should not be mixed because antagonism can reduce the treatment’s effect.","zh":"有些药物不应混用，因为拮抗作用会降低疗效。"},{"en":"In human movement, antagonism between muscle groups helps control motion.","zh":"在人体运动中，肌群之间的拮抗作用有助于控制动作。"}]}],"synonyms":["hostility","opposition","animosity","conflict","rivalry"],"phonetic":"/ænˈtæɡəˌnɪzəm/","extraExplanation":["词源提示：antagonism 来自希腊语“对抗者、敌手”（antagonist）。在文学与影视中常说 protagonist（主角）与 antagonist（反派/对手），antagonism 就是两者之间的“对立冲突”。","语气辨析：antagonism 通常比 dislike（不喜欢）更强，接近 hostility（敌意）或 opposition（反对）。常见搭配有：feel/express antagonism toward…（对……怀有/表达敌意），create/heighten antagonism（制造/加剧对立）。"]}
{"word":"antagonisms","summary":{"en":"“Antagonisms” means multiple cases of hostility or active opposition between people, groups, or ideas.","zh":"“antagonisms”指多种敌意或对抗关系，常用于描述人与人、群体或观念之间的对立。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"strong dislike, hostility, or tension between people, groups, or countries (plural form of “antagonism”).","zh":"人与人、团体或国家之间的强烈反感、敌意或紧张对立（“antagonism”的复数）。"},"examples":[{"en":"Long-standing antagonisms between the two communities made cooperation difficult.","zh":"两个社群之间长期的敌对情绪让合作变得困难。"},{"en":"The movie explores family antagonisms that have lasted for generations.","zh":"这部电影探讨了延续数代的家族矛盾与对立。"}]},{"partOfSpeech":"n.","definition":{"en":"active opposition between ideas, interests, or forces; a situation where one side works against another.","zh":"观念、利益或力量之间的对抗；一方积极抵制或反对另一方的状态。"},"examples":[{"en":"The policy debate revealed deep antagonisms between economic growth and environmental protection.","zh":"这场政策辩论暴露了经济增长与环境保护之间的深层对立。"},{"en":"Their goals were in antagonism, so the partnership quickly fell apart.","zh":"他们的目标相互对立，所以合作很快就破裂了。"}]}],"synonyms":["hostilities","conflicts","tensions","opposition","rivalries"],"phonetic":"/ænˈtæɡənɪzəmz/","extraExplanation":["“antagonisms”是名词复数，单数是“antagonism”。在正式写作中常用来强调“多种/多方面的对立与矛盾”。","词根上与“antagonist（反派；对手）”“antagonize（使对立；激怒）”有关。","搭配常见：political/social antagonisms（政治/社会对立）、racial antagonisms（种族对立）、antagonisms between A and B（A与B之间的对立）。"]}
{"word":"antagonist","summary":{"en":"An antagonist is the main opponent in a story or someone who strongly opposes another person or idea.","zh":"antagonist 指故事中的主要对手/反派力量，或现实中强烈反对他人或某观点的人（或团体）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In a story, movie, or play, the main character or force that opposes the hero (the protagonist).","zh":"（故事/电影/戏剧中）与主角（protagonist）对立、制造冲突的主要人物或力量。"},"examples":[{"en":"In many superhero films, the antagonist tries to stop the hero from saving the city.","zh":"在许多超级英雄电影里，反派（antagonist）会试图阻止英雄拯救城市。"},{"en":"The antagonist isn’t always a person; sometimes it’s an illness, society, or nature.","zh":"反派不一定是一个人；有时也可能是疾病、社会制度或大自然。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or group that strongly opposes someone or something (often in politics, business, or debate).","zh":"（在政治、商业、辩论等中）强烈反对某人或某事的人或团体。"},"examples":[{"en":"He became an antagonist of the new policy and spoke against it at every meeting.","zh":"他成了这项新政策的反对者（antagonist），在每次会议上都发言反对。"},{"en":"The two companies have been antagonists for years, competing for the same customers.","zh":"这两家公司多年来一直是对手（antagonists），争夺同一批顾客。"}]}],"synonyms":["opponent","rival","adversary","enemy"],"phonetic":"/ænˈtæɡənɪst/","extraExplanation":["词源小提示：antagonist 来自希腊语词根，含义接近“对抗的人/对手”。英语里常与 protagonist（主角）成对出现。","阅读/影视中常见误区：antagonist 不一定等同于“坏人”。有些作品里反派动机复杂，甚至可能让人同情；关键在于“与主角目标对立”而不是“道德上邪恶”。","相关词：antagonize（vt. 激怒；与……对抗）、antagonistic（adj. 对立的；敌对的）、antagonism（n. 对立；敌意）。"]}
{"word":"antagonistic","summary":{"en":"Antagonistic means hostile or strongly opposed—either between people/groups or between ideas/forces.","zh":"Antagonistic 表示“敌对/对抗的”，可形容人与人（或团体）之间的敌意，也可形容观点、力量等彼此对立。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"showing active opposition, hostility, or dislike; against someone or something","zh":"敌对的；对抗的；怀有敌意的；与……相反的"},"examples":[{"en":"The two teams have an antagonistic relationship, especially during playoffs.","zh":"两支球队关系很敌对，尤其是在季后赛期间。"},{"en":"His antagonistic comments made the meeting tense.","zh":"他那些带敌意的评论让会议气氛变得紧张。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of forces, ideas, or substances) working against each other; opposing","zh":"（力量、观点或物质）相互对立的；相抗的"},"examples":[{"en":"In the debate, two antagonistic viewpoints competed for attention.","zh":"在辩论中，两种对立观点争夺关注。"}]}],"synonyms":["hostile","opposed","adversarial","combative","conflicting"],"phonetic":"/ænˌtæɡəˈnɪstɪk/","extraExplanation":["词根提示：antagonistic 来自 Greek（希腊语）agōn（比赛、斗争）。anti- 表示“反对”，-agon- 与“斗争/竞争”有关，所以整体含义是“处于对抗/敌对状态”。","语气差异：antagonistic 通常比“different/against”更强，带有明显的敌意或对抗情绪；如果只是“意见不一致”，更中性可用 conflicting / opposing。"]}
{"word":"antagonistic to","summary":{"en":"strongly opposed or hostile toward; (in science) blocking an effect","zh":"强烈反对或敌对；（科学中）阻断/拮抗某种作用"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"hostile or strongly opposed to (a person, idea, plan, or effect)","zh":"对……怀有敌意或强烈反对；与……对立"},"examples":[{"en":"He was antagonistic to any changes in the schedule.","zh":"他强烈反对日程上的任何改动。"},{"en":"Some viewers are antagonistic to the new policy because it feels unfair.","zh":"一些观众反对这项新政策，因为他们觉得不公平。"},{"en":"The article is antagonistic to the idea of remote work.","zh":"这篇文章对远程办公的观点持反对态度。"}]},{"partOfSpeech":"phrase","definition":{"en":"(biology/medicine) acting against or blocking (a process, substance, or effect)","zh":"（生物/医学）对抗、抑制或阻断（某种过程/物质/作用）"},"examples":[{"en":"This drug is antagonistic to the receptor and reduces the response.","zh":"这种药物对该受体具有拮抗作用，从而降低反应。"},{"en":"The two chemicals can be antagonistic to each other when mixed.","zh":"这两种化学物质混合时可能会相互拮抗。"}]}],"synonyms":["opposed to","hostile to","against","averse to","counter to","in opposition to"],"phonetic":"/ænˌtæɡəˈnɪstɪk tu/","extraExplanation":["常见搭配与语气：be antagonistic to + 名词/动名词，语气通常比 “not in favor of” 更强，带有“对立、敌意”的感觉。","易混点：antagonistic to（对……敌对/反对）不同于 “antagonistic toward(s)”（对……的态度敌对）。两者都常见，但 to 更强调“对立关系/相反效果”。"],"etymology":"“antagonistic”来自希腊语 antagonistes（对手、敌手），由 anti-（对抗）+ agon（比赛、斗争）构成；后在英语中发展为“敌对的、对立的”。“antagonistic to”是常见搭配，用 to 引出反对/对抗的对象。","mnemonic":["把 anti- 记成“反、抗”（中文就有“反”），看到 anti- 就想到“反对”。","联想“agon”像“竞技/斗争”（可联想到中文“角逐”），anti+agon=“反着斗争”→对抗、敌对。"]}
{"word":"antagonistical","summary":{"en":"Antagonistical means hostile or strongly opposed; it’s a less common form of antagonistic.","zh":"antagonistical 表示“敌对的、强烈对立的”；它是 antagonistic 的较少见形式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Showing strong opposition, hostility, or conflict toward someone or something; unfriendly and argumentative.","zh":"表现出强烈对立、敌意或冲突的；不友好、好争辩的。"},"examples":[{"en":"His antagonistical attitude made teamwork difficult.","zh":"他那种对立、敌对的态度让团队合作变得很困难。"},{"en":"The interview turned antagonistical when they started blaming each other.","zh":"当他们开始互相指责时，采访气氛变得对立起来。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Biology/medicine) Acting against another force or substance; producing an opposite effect.","zh":"（生物/医学）与另一种力量或物质相对抗的；产生相反作用的。"},"examples":[{"en":"These two muscles have antagonistical functions: one bends the arm and the other straightens it.","zh":"这两块肌肉的功能相互对抗：一块使手臂弯曲，另一块使其伸直。"}]}],"synonyms":["antagonistic","hostile","opposed","adversarial","combative","contentious"],"phonetic":"/ænˌtæɡəˈnɪstɪkəl/","extraExplanation":["“antagonistical”是“antagonistic”的较少见变体；在现代英语中更常用的是“antagonistic”。写作或考试中一般建议用“antagonistic”。","词根来自希腊语“antagonistēs”（对手、竞争者）。在文学与戏剧里，“antagonist”指“反派/对立角色”，因此“antagonistic/antagonistical”常用来形容“对立、敌对”的关系或态度。"]}
{"word":"antagonistically","summary":{"en":"Antagonistically means “in a hostile or opposing way,” and it can also describe opposing effects in biology/medicine.","zh":"antagonistically 指“以敌对或对立的方式”，也可用于生物/医学语境表示“产生拮抗作用”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a hostile, opposing, or argumentative way; as an enemy or rival.","zh":"以敌对、对立或挑衅的方式；像敌人或对手一样。"},"examples":[{"en":"He responded antagonistically to even polite questions.","zh":"即使是礼貌的问题，他也以敌对的态度回应。"},{"en":"The two groups acted antagonistically during the negotiations.","zh":"谈判期间，这两个团体表现得彼此对立。"}]},{"partOfSpeech":"adv.","definition":{"en":"(In biology/medicine) In a way that works against something else, reducing or blocking its effect.","zh":"（生物/医学）以拮抗的方式；通过对抗来减弱或阻断另一事物的作用。"},"examples":[{"en":"The drug interacts antagonistically with alcohol.","zh":"这种药与酒精会产生拮抗性相互作用。"},{"en":"These hormones can act antagonistically in the body.","zh":"这些激素在体内可能会产生拮抗作用。"}]}],"synonyms":["hostilely","oppositionally","adversarially","confrontationally"],"phonetic":"/ænˌtæɡəˈnɪstɪkli/","extraExplanation":["词源提示：antagonistically 来自 antagonist（对手、反派）+ -ic（……的）+ -ally（以……方式）。在小说、电影或戏剧评论里，常用 antagonistically 描述角色或阵营“站在对立面”的行动或态度。","学习提醒：日常交流中更常见的说法是 “in a hostile way / in an oppositional way”。antagonistically 语气偏书面，也常出现在学术写作或新闻评论中。"]}
{"word":"antagonists","summary":{"en":"“Antagonists” are opponents or, in stories, the forces/characters that oppose the main character; it can also mean a blocking substance in medicine/biology.","zh":"“antagonists”指对手/反对者；在故事中指与主角对立、制造冲突的角色或力量；在医学/生物中也可指拮抗物（阻断剂）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person (or group) who opposes someone else, especially the main character or a cause.","zh":"对手；反对者（尤指与某人或某种事业作对的人/群体）。"},"examples":[{"en":"In the debate, she treated him like an antagonist instead of a partner.","zh":"在辩论中，她把他当成对手，而不是合作伙伴。"},{"en":"The reformers faced many antagonists who wanted to keep the old system.","zh":"改革者面对许多反对者，他们想维持旧制度。"}]},{"partOfSpeech":"n.","definition":{"en":"In stories, movies, and plays, the main character’s enemy or the force that creates the central conflict.","zh":"（文学/影视/戏剧中）反派；对立角色（制造主要冲突的人或力量）。"},"examples":[{"en":"The antagonist in the film isn’t a person—it’s fear itself.","zh":"这部电影里的反派不是某个人，而是“恐惧”本身。"},{"en":"Many novels give the antagonist a complex backstory.","zh":"很多小说会给反派设置复杂的背景故事。"}]},{"partOfSpeech":"n.","definition":{"en":"A substance that blocks or reduces the effect of another substance (common in biology/medicine).","zh":"（生物/医学）拮抗物；阻断剂（阻断或减弱另一种物质作用的物质）。"},"examples":[{"en":"This drug acts as a receptor antagonist.","zh":"这种药物起受体拮抗剂的作用。"}]}],"synonyms":["opponents","adversaries","rivals","enemies","villains","counterforces"],"phonetic":"/ænˈtæɡənɪsts/","extraExplanation":["“antagonist”来自希腊语词根：anti-（对抗）+ agon（比赛、斗争）。因此它既可指现实中的“反对者”，也常用于叙事作品中指“制造冲突的一方”。","在写作/阅读里，antagonist 不一定是“坏人”。它也可以是制度、自然环境、社会偏见，甚至是主角自身的弱点。"]}
{"word":"antagonizable","summary":{"en":"Antagonizable means “able to be opposed or blocked,” especially by an antagonist in pharmacology.","zh":"Antagonizable 指“可被对抗或阻断的”，尤其用于药理学中“可被拮抗剂拮抗”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to be opposed, blocked, or counteracted by an antagonist (often used in pharmacology).","zh":"可被拮抗的；可被对抗/阻断/抵消的（常用于药理学）。"},"examples":[{"en":"The drug’s effects are antagonizable by naloxone.","zh":"这种药物的作用可以被纳洛酮拮抗（阻断）。"},{"en":"Researchers tested whether the receptor response was antagonizable at low doses.","zh":"研究人员测试该受体反应在低剂量下是否可被拮抗。"}]},{"partOfSpeech":"adj.","definition":{"en":"capable of being treated as an opponent or resisted.","zh":"可被当作对手来对抗的；可抵制的。"},"examples":[{"en":"In debates, some arguments seem antagonizable, while others are harder to answer.","zh":"在辩论中，有些论点看起来容易反驳（可对抗），而另一些更难回应。"}]}],"synonyms":["blockable","counteractable","inhibitable","opposable","susceptible to antagonism"],"phonetic":"/ænˈtæɡəˌnaɪzəbəl/","extraExplanation":["“antagonizable”比较少见，最常出现在科学/药理语境里，意思接近“可被拮抗剂阻断”。日常英语里更常用的是“can be blocked / can be counteracted / can be antagonized”。","构词：antagonize（对抗/拮抗）+ -able（能够……的）→ antagonizable（可被……的）。在药理学中，“antagonist（拮抗剂）”指能减弱或阻断某种药物或受体反应的物质。"]}
{"word":"antagonization","summary":{"en":"Antagonization means the act of making someone hostile or opposed—creating antagonism.","zh":"Antagonization 指“使人敌对或对立”的行为/过程，即制造对抗与敌意。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of making someone angry, opposed, or hostile; causing antagonism","zh":"使人反感、对立或敌对的行为或过程；引起对抗/敌意"},"examples":[{"en":"The manager’s antagonization of the staff led to high turnover.","zh":"经理对员工的激怒与对立做法导致人员流失很高。"},{"en":"Constant antagonization can damage trust in a relationship.","zh":"持续的挑衅/激化对立会破坏关系中的信任。"}]}],"synonyms":["provocation","hostility","aggravation","alienation","antagonism"],"phonetic":"/ænˌtæɡənaɪˈzeɪʃən/","extraExplanation":["“antagonization”较少见，更常用的是“antagonism（对立/敌意）”“antagonizing behavior（惹人反感的行为）”或动词“to antagonize（激怒；使对立）”。正式写作中也可用“provocation（挑衅）”“alienation（疏远）”来表达更具体的语气。","英式拼写常见为“antagonisation”。"]}
{"word":"antagonize","summary":{"en":"Antagonize means to deliberately provoke someone or to act in a way that creates hostility or opposition.","zh":"Antagonize 指故意激怒、挑衅某人，或以对立/敌对的方式行事从而引发反感。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone angry or upset on purpose; to provoke someone","zh":"故意惹恼、激怒某人；挑衅某人"},"examples":[{"en":"Don’t antagonize your sister by teasing her in front of her friends.","zh":"别在你姐姐朋友面前取笑她来惹恼她。"},{"en":"His rude comments antagonized the audience.","zh":"他粗鲁的评论激怒了观众。"},{"en":"Try not to antagonize your coworkers during a stressful week.","zh":"在压力大的这一周尽量别去惹恼同事。"}]},{"partOfSpeech":"vt.","definition":{"en":"to act in a way that opposes someone or something; to be hostile toward","zh":"与……对立；对……抱敌意；与……作对"},"examples":[{"en":"The new policy may antagonize local communities.","zh":"新政策可能会引起当地社区的反感与对立。"},{"en":"He didn’t mean to antagonize the team; he was just asking questions.","zh":"他并不是想与团队作对；他只是提问而已。"}]}],"synonyms":["provoke","irritate","anger","offend","alienate"],"phonetic":"/ænˈtæɡəˌnaɪz/","extraExplanation":["“antagonize”源于希腊语词根“antagonist”（对手、反对者）。在日常英语里，它常带有“明知会惹人生气却仍去做”的语气；比“annoy”（惹烦）更强烈，更接近“provoke”（挑衅、激怒）。","常见搭配：antagonize someone（惹恼某人）、antagonize the public（引起公众反感）、antagonize your neighbors（得罪/惹怒邻居）。写作或新闻语境里，也常用来描述政策或言论“引发对立/反感”。"]}
{"word":"antagonized","summary":{"en":"“Antagonized” means made someone angry/hostile, or opposed them in a conflict-producing way.","zh":"“antagonized”指使人恼火、产生敌意，或以对抗方式反对某人/某事。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To make someone angry, upset, or hostile (often by repeatedly doing something they dislike).","zh":"使某人生气、恼火或产生敌意（常指反复做对方不喜欢的事）。"},"examples":[{"en":"He was antagonized by the constant criticism at work.","zh":"他因工作中不断的批评而感到恼火。"},{"en":"Don’t antagonize your neighbors by playing loud music late at night.","zh":"别在深夜大声放音乐来惹恼邻居。"},{"en":"Her remarks antagonized the audience instead of persuading them.","zh":"她的话不但没说服观众，反而激怒了他们。"}]},{"partOfSpeech":"vt.","definition":{"en":"To oppose or act against someone or something in a way that creates conflict.","zh":"与……对立；反对或对抗（导致冲突）。"},"examples":[{"en":"Several members felt antagonized by the new policy and spoke out against it.","zh":"一些成员觉得新政策是在与他们作对，于是公开反对。"},{"en":"The two groups have antagonized each other for years.","zh":"这两个团体多年来一直互相对立。"}]}],"synonyms":["angered","provoked","irritated","alienated","opposed"],"phonetic":"/ænˈtæɡəˌnaɪzd/","extraExplanation":["“antagonized”是动词antagonize的过去式/过去分词。常见搭配：be antagonized by…（被……惹恼/激怒）。","词根antagon-来自希腊语，和“antagonist（反派/对手）”同源，核心概念是“对立、对抗”。在现代英语里既可指“激怒”，也可指“形成对立”。","语气通常比“annoy”更强，带有“引发敌意/冲突”的感觉；如果只是轻微烦扰，用“annoy/irritate”更合适。"]}
{"word":"antagonizer","summary":{"en":"An antagonizer is someone who intentionally provokes, annoys, or opposes others; in fiction it can mean a conflict-causing character (less common than “antagonist”).","zh":"antagonizer 指故意挑衅、惹恼或与人作对的人；在小说戏剧中也可指制造冲突的角色（但不如 antagonist 常用）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who deliberately annoys, provokes, or opposes others; someone who antagonizes","zh":"故意惹恼、挑衅或与他人作对的人；对立者"},"examples":[{"en":"He was a constant antagonizer in meetings, always interrupting and challenging everyone.","zh":"他在会议中一直是个爱挑衅的人，总是打断别人、处处质疑。"},{"en":"Don’t be an antagonizer—ask questions politely if you disagree.","zh":"别当“挑衅者”——如果你不同意，可以礼貌地提问。"}]},{"partOfSpeech":"n.","definition":{"en":"in stories or drama: a character who creates conflict for the main character (similar to “antagonist,” but less common)","zh":"（故事/戏剧中）制造冲突的角色（类似 antagon​ist，但较少用）"},"examples":[{"en":"In the novel, the antagonizer pressures the hero to make a difficult choice.","zh":"在小说里，这个对立角色逼迫主人公做出艰难的选择。"}]}],"synonyms":["provoker","agitator","instigator","troublemaker","antagonist"],"phonetic":"/ænˈtæɡəˌnaɪzər/","extraExplanation":["“antagonizer”在日常英语里不如“antagonist”（对手/反派）常见，更口语、更强调“故意惹人”的行为。正式写作中常用“antagonist”（人物/力量）或“provocateur / instigator”（挑事者）来替代。","词根提示：antagonize（使对立/使恼怒）+ -er（做……的人）。"]}
{"word":"antagonizes","summary":{"en":"Antagonizes means “makes someone angry or hostile” or “actively opposes.”","zh":"antagonizes 表示“惹恼/激怒（使产生敌意）”或“与……对抗/反对”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make someone angry, annoyed, or hostile by what you do or say","zh":"（言行）惹恼、激怒某人；使某人产生敌意"},"examples":[{"en":"His constant sarcasm antagonizes his coworkers.","zh":"他不断的讽刺会惹恼同事。"},{"en":"Try not to antagonize the customer—listen first and stay calm.","zh":"尽量别激怒顾客——先倾听并保持冷静。"}]},{"partOfSpeech":"v.","definition":{"en":"to oppose someone or something actively; to work against","zh":"与……对抗；反对；阻挠"},"examples":[{"en":"The policy antagonizes local communities by ignoring their needs.","zh":"这项政策忽视当地需求，从而引起社区的反对。"},{"en":"In biology, one substance can antagonize the effect of another.","zh":"在生物学中，一种物质可以拮抗另一种物质的作用。"}]}],"synonyms":["angers","irritates","provokes","offends","opposes","counteracts"],"phonetic":"/ænˈtæɡəˌnaɪzɪz/","extraExplanation":["“antagonizes” 是动词 “antagonize” 的第三人称单数现在时（he/she/it antagonizes）。常见搭配：antagonize someone（惹恼某人）、antagonize people against…（使人们反对……，较正式）。","词根来自 “antagonist”（对手、反派），写作或影评里常说：The antagonist antagonizes the hero（反派与主角对抗）。"]}
{"word":"antagonizing","summary":{"en":"Antagonizing means provoking anger or hostility, or actively making someone oppose you.","zh":"Antagonizing 指“激怒、挑衅，使人产生敌意或对立”，也可指正在做这种事。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"making someone feel angry, annoyed, or hostile; provoking conflict","zh":"使人生气、恼火或敌对的；挑起冲突的"},"examples":[{"en":"His antagonizing comments turned a small disagreement into an argument.","zh":"他那些挑衅的评论把小分歧变成了争吵。"},{"en":"Try not to use antagonizing language during a negotiation.","zh":"谈判时尽量不要使用容易激怒对方的措辞。"}]},{"partOfSpeech":"v.","definition":{"en":"the act of making someone angry or hostile; provoking opposition (present participle of “antagonize”)","zh":"激怒或引起敌意；招致对立（动词“antagonize”的现在分词）"},"examples":[{"en":"She realized she was antagonizing her coworkers by correcting them in public.","zh":"她意识到自己在公开纠正同事会惹恼他们。"},{"en":"The policy is antagonizing many local residents.","zh":"这项政策正在激怒许多当地居民。"},{"en":"Stop antagonizing your brother and talk calmly.","zh":"别再挑衅你弟弟了，冷静谈谈。"}]}],"synonyms":["provoking","irritating","aggravating","inflaming","alienating","needling"],"phonetic":"/ænˈtæɡəˌnaɪzɪŋ/","extraExplanation":["“antagonizing”比“annoying”更强烈：不只是“烦”，而是容易让人产生敌意或对抗情绪，常见于较正式的语境（如政治、职场、人际冲突）。","在沟通建议中常见搭配：antagonizing remarks/comments/tone（挑衅性的言论/评论/语气）。"]}
{"word":"antagony","summary":{"en":"“Antagony” is a rare, informal blend meaning painful hostility or conflict; in formal English, use “antagonism,” “hostility,” or “agony.”","zh":"“Antagony”是少见的非正式合成词，指“让人痛苦的敌意/冲突”；正式表达建议用“antagonism / hostility / agony”等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard/rare) A humorous blend of “antagonism” and “agony,” meaning a painful conflict, bitter hostility, or drama that causes suffering.","zh":"（非标准/少见）“antagonism（对立、敌意）”与“agony（痛苦）”的幽默合成词，指让人痛苦的冲突、强烈敌意或折磨人的“戏剧性矛盾”。"},"examples":[{"en":"The meeting turned into pure antagony—everyone was angry and nobody listened.","zh":"这场会议简直成了“antagony”——大家都很生气，谁也不听谁的。"},{"en":"Their breakup was weeks of antagony for the whole friend group.","zh":"他们分手让整个朋友圈经历了好几周的“antagony”。"}]}],"synonyms":["antagonism","hostility","conflict","agony","drama"],"phonetic":"/ænˈtæɡəni/","extraExplanation":["“antagony”不是常见的标准英语词，更像网络/口语里为了强调“既对立又痛苦”的感觉而造出来的词。如果你是在正式写作中使用，通常建议改用更标准的词：\n- antagonism：敌意、对立（更中性/学术）\n- hostility：敌意（更直接）\n- agony：痛苦、煎熬（更偏情感/身体痛）\n- bitter conflict：激烈冲突（更书面）"]}
{"word":"Antagoras","summary":{"en":"Antagoras: an ancient Greek (Hellenistic) poet from Rhodes, remembered for witty epigrams and court-related anecdotes.","zh":"Antagoras：古希腊（希腊化时期）罗得岛诗人，以机智的警句诗与宫廷相关轶事而为人所知。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient Greek poet (from Rhodes), active in the 3rd century BCE, known for witty epigrams and for writing about everyday life and food; often mentioned in stories about the Hellenistic royal courts.","zh":"安塔戈拉斯（Antagoras），古希腊诗人（罗得岛人），活跃于公元前3世纪，以机智的短诗（警句诗）以及描写日常生活与食物等题材而闻名；常出现在与希腊化时代王室宫廷相关的轶事中。"},"examples":[{"en":"Antagoras is sometimes cited as a Hellenistic poet famous for playful epigrams.","zh":"安塔戈拉斯有时被引用为以诙谐警句诗闻名的希腊化时代诗人。"},{"en":"In one anecdote, Antagoras appears at a royal court, showing how poets depended on patrons.","zh":"在一则轶事中，安塔戈拉斯出现在王室宫廷里，体现了诗人对赞助人的依赖。"}]}],"synonyms":["a Hellenistic Greek poet","an epigrammatist"],"phonetic":"ænˈtæɡərəs","extraExplanation":["“Antagoras”主要是专有名词（人名），在英文文本里多用于古典学/文学史语境；日常英语中很少出现。","他常与“epigram（警句诗）”一起被提到。警句诗通常短小、机智，结尾往往有“反转”或“点题”。","不同资料对他与哪位君主/赞助人交往的细节可能略有差异；学习时可把握核心：他是希腊化时期的诗人代表之一。"]}
{"word":"Antaimerina","summary":{"en":"Antaimerina refers to people from Imerina, often meaning members of the Merina ethnic group in Madagascar.","zh":"Antaimerina 指来自马达加斯加伊梅里纳地区的人，常用于指梅里纳族人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Imerina (the central highlands region of Madagascar); a member of the Merina people.","zh":"伊梅里纳（马达加斯加中部高地区域）的人；梅里纳族人。"},"examples":[{"en":"Many Antaimerina traditions developed in Madagascar’s central highlands.","zh":"许多安泰梅里纳（伊梅里纳人/梅里纳人）的传统形成于马达加斯加中部高地。"},{"en":"She said her grandparents were Antaimerina and spoke Malagasy at home.","zh":"她说祖父母是安泰梅里纳人，在家里说马拉加斯语。"}]}],"synonyms":["Merina","Imerina people"],"phonetic":"/ˌæn.taɪ.məˈriː.nə/","extraExplanation":["“Antaimerina”常见于人类学、历史或族群研究语境，指“来自 Imerina 的人”。在马拉加斯语中，类似的构词常用前缀表示“……的人/族群”。","在英文写作里有时也会直接写作 “Merina (people)” 或 “people of Imerina”。如果你是在某本书/论文里看到该词，具体含义可能会跟历史时期（王国、殖民时期、现代）有关。"]}
{"word":"antaimerina","summary":{"en":"Antaimerina is most likely a Malagasy-related proper name (community/ethnic group or place); the exact meaning depends on context.","zh":"Antaimerina 很可能是与马达加斯加语境相关的专有名词（社群/族群或地名），具体含义需结合上下文确认。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Antaimerina: a proper name (from Madagascar), used for an ethnic/community name or a place name in Malagasy contexts. (Usage varies; please confirm your intended meaning.)","zh":"Antaimerina：一个专有名词（与马达加斯加相关），在马达加斯加语语境中可用作族群/社群名称或地名。（用法不一，请确认你想表达的含义。）"},"examples":[{"en":"She is researching the Antaimerina community in Madagascar.","zh":"她正在研究马达加斯加的 Antaimerina 社群。"},{"en":"The report mentions Antaimerina as a local name, but it does not define it clearly.","zh":"报告里提到 Antaimerina 是一个当地名称，但没有清楚说明它的意思。"}]}],"synonyms":["(no direct English synonym; may relate to Malagasy ethnonyms/toponyms depending on context)"],"phonetic":"ˌæn.taɪ.məˈriː.nə","extraExplanation":["这个词不像常见英语词汇，更像马达加斯加（Malagasy）相关的专名（可能是族群名、地名或姓氏）。由于不同资料的拼写与指代可能不同（也可能有拼写误差），如果你能告诉我：你在哪里看到它（句子/文章/地图/家族谱系等），或你想查的是“人群/地名/语言/姓氏”，我可以给出更准确的释义、来源背景与相关词。"]}
{"word":"Antaios","summary":{"en":"Antaios is a giant from Greek mythology (Antaeus) who drew strength from the earth and was defeated by Heracles.","zh":"Antaios（安泰俄斯/Antaeus）是希腊神话中的巨人，靠接触大地增强力量，最终被赫拉克勒斯击败。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a giant in Greek mythology (also spelled Antaeus), the son of Poseidon and Gaia, who gained strength from contact with the earth and was defeated by Heracles (Hercules).","zh":"希腊神话中的巨人（也拼作 Antaeus/安泰俄斯），波塞冬与大地女神盖娅之子；只要接触大地就会变得更强，最终被赫拉克勒斯（海格力斯）击败。"},"examples":[{"en":"In the myth, Antaios becomes stronger whenever he touches the ground.","zh":"在神话中，安泰俄斯只要一触地就会变得更强。"},{"en":"Heracles defeats Antaios by lifting him into the air so he cannot draw strength from the earth.","zh":"赫拉克勒斯把安泰俄斯举到空中，使他无法从大地获得力量，从而击败了他。"},{"en":"Some writers use Antaios as a symbol of power that comes from one’s roots or homeland.","zh":"一些作家用“安泰俄斯”象征力量来自根源或故土。"}]}],"synonyms":["Antaeus"],"phonetic":"/ænˈtiːəs/","extraExplanation":["“Antaios”常见于学术或文学拼写，英语里更常用“Antaeus”。中文常译作“安泰俄斯/安泰奥斯”。","他的故事常被用来比喻：一个人从“脚踏实地”、与土地/传统/社区保持联系中获得力量；相反，一旦与这些联系被切断，就会变弱。","如果你在艺术、心理学或文学评论中看到他，通常是在谈“根源”“归属感”或“土地与身份”的象征意义。"]}
{"word":"antaios","summary":{"en":"Antaios is a mythological giant (Antaeus) whose strength comes from touching the earth; it can also symbolize power drawn from one’s roots or homeland.","zh":"Antaios 指希腊神话中的巨人（英语常作 Antaeus），力量来自接触大地；也可引申为来自根源或故土的力量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a figure in Greek mythology (better known in English as Antaeus): a giant wrestler, son of Poseidon and Gaia, who became stronger when he touched the earth","zh":"希腊神话人物（英语中更常见作 Antaeus）：巨人摔跤手，波塞冬与大地女神盖娅之子；只要脚踏大地就会更强壮"},"examples":[{"en":"In the myth, Antaios grows stronger every time he touches the ground.","zh":"在神话中，Antaios 每次接触地面都会变得更强。"},{"en":"Hercules defeats Antaios by lifting him off the earth.","zh":"赫拉克勒斯通过把 Antaios 举离地面而击败他。"}]},{"partOfSpeech":"n.","definition":{"en":"a name used in literature, art, or modern writing to symbolize strength drawn from one’s roots, homeland, or “the earth”","zh":"文学、艺术或现代写作中用作象征：力量来自根源、故土或“大地”"},"examples":[{"en":"The poet compares the farmer to Antaios, powerful because he stays close to the soil.","zh":"诗人把农夫比作 Antaios：因为亲近土地而强大。"},{"en":"In the essay, Antaios represents a community that regains strength by returning to its traditions.","zh":"在文章中，Antaios 象征一个回归传统后重获力量的社群。"}]}],"synonyms":["Antaeus","Anteus"],"phonetic":"/ænˈteɪ.oʊs/","extraExplanation":["“Antaios”常被视为希腊名字的另一种转写（transliteration），对应更常见的英语形式“Antaeus”。不同拼法多来自希腊语字母与拉丁字母之间的转写习惯差异。","这个人物最有名的情节是与赫拉克勒斯（Heracles/Hercules）摔跤：因为他一接触大地就会恢复/增强力量，所以赫拉克勒斯把他举起来使其无法“借力于地”。因此在写作里常被引申为“与土地/根源相连就更有力量”。"]}
{"word":"Antaiva","summary":{"en":"“Antaiva” is not a common English vocabulary word; it is most likely a proper name or coined term.","zh":"“Antaiva”不是常见英语词汇，更可能是专有名词或自造词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare or nonstandard term in English; most often seen as a proper name (e.g., a person, username, brand, or place) rather than a common dictionary word.","zh":"英语中较少见、非标准的词；更常见于专有名词（如人名、用户名、品牌或地名），而不是常用词典词汇。"},"examples":[{"en":"I couldn’t find “Antaiva” in standard English dictionaries—do you mean a brand or a person’s name?","zh":"我在常见英语词典里找不到“Antaiva”——你指的是某个品牌还是人名吗？"},{"en":"Antaiva is my online username.","zh":"Antaiva 是我的网名。"}]}],"synonyms":["(none—likely a proper name)"],"phonetic":"/ænˈtaɪvə/","extraExplanation":["“Antaiva”看起来更像是自造词/音译词或专有名词，而不是英语里固定有含义的词汇。要更准确解释它的意思，最好提供：1）出现的句子或语境；2）它来自哪种语言或领域（游戏、公司名、地名、人名等）；3）你想确认的是发音、含义还是拼写。","如果你是在找某个相近的英文词，也可能是拼写接近：例如“Antigua（安提瓜）”“atavistic（返祖的）”等；但需要语境才能判断。"]}
{"word":"antaiva","summary":{"en":"“antaiva” isn’t recognized as a standard English word; it likely needs context or corrected spelling.","zh":"“antaiva”不是标准英语词，可能需要上下文或修正拼写才能确定意思。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a brand/name, or a word from another language.","zh":"不是标准英语词汇；可能是拼写错误、品牌/人名/地名，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “antaiva” in an English dictionary—could you share a sentence with it?","zh":"我在英语词典里找不到“antaiva”，你能提供一个包含它的句子吗？"},{"en":"Is “antaiva” a name (a person, place, or company)?","zh":"“antaiva”是名字吗（人名、地名或公司名）？"}]}],"phonetic":"/ænˈtaɪvə/","extraExplanation":["我目前无法确认“antaiva”的准确含义与词性，因为它不常见于英语语料/词典中。最常见的情况是：1）拼写接近的英语词（例如你可能想写的是其他单词）；2）专有名词（人名、品牌、游戏/小说里的设定名）；3）来自其他语言的词。","如果你把它出现的上下文（完整句子、来源链接、或你想表达的中文意思）发我，我可以帮你：校对拼写、判断它是否是专有名词、并给出最可能的正确英文词与用法。"]}
{"word":"Antakiya","summary":{"en":"Antakya is a city in southern Turkey, historically known as Antioch.","zh":"安塔基亚是土耳其南部城市，历史上称为安条克。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Antakya: a city in southern Turkey (Hatay Province), near the Syrian border; historically known as Antioch, an important ancient Greek and Roman city.","zh":"安塔基亚（土耳其语：Antakya）：土耳其南部哈塔伊省的一座城市，靠近叙利亚边境；历史上称为“安条克（Antioch）”，是古希腊和古罗马时期的重要城市。"},"examples":[{"en":"Antakya is in southern Turkey, close to the Mediterranean region.","zh":"安塔基亚位于土耳其南部，靠近地中海地区。"},{"en":"In ancient texts, Antakya is often referred to as Antioch.","zh":"在古代文献中，安塔基亚常被称为“安条克（Antioch）”。"},{"en":"Many travelers visit Antakya for its history and multicultural food traditions.","zh":"许多游客来到安塔基亚，是为了体验它的历史与多元饮食文化。"}]}],"synonyms":["Antioch"],"phonetic":"/ɑnˈtɑːkjɑː/","extraExplanation":["“Antakya”是现代土耳其地名；英文里谈历史时常用“Antioch（安条克）”，谈现代城市与地理位置时用“Antakya”。","安条克在早期基督教史中很有名：据《使徒行传》，门徒在安条克首次被称为“Christians（基督徒）”。","你写的“Antakiya”更像是拼写变体；标准拼写通常是“Antakya”。"]}
{"word":"Antakya","summary":{"en":"Antakya is a city in southern Turkey, historically known as Antioch.","zh":"安塔基亚是土耳其南部的一座城市，历史上称为安提阿（Antioch）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in southern Turkey (Hatay Province), near the Syrian border, known historically as Antioch.","zh":"土耳其南部哈塔伊省的一座城市，靠近叙利亚边境；历史上以“安提阿（Antioch）”闻名。"},"examples":[{"en":"Antakya is close to the Mediterranean coast and the Syrian border.","zh":"安塔基亚靠近地中海沿岸，也靠近叙利亚边境。"},{"en":"Many history books refer to Antakya by its older name, Antioch.","zh":"许多历史书会用安塔基亚的旧名“安提阿（Antioch）”来称呼它。"}]}],"synonyms":["Antioch"],"phonetic":"/ɑnˈtɑːkjə/","extraExplanation":["“Antakya”是现代土耳其语名称；在古希腊语、拉丁语与英语历史语境中常见旧称“Antioch（安提阿）”。因此阅读宗教史、罗马史或早期基督教相关材料时，常会看到两个名字指同一地区。","安塔基亚长期是多文化、多宗教交汇之地（例如伊斯兰教、基督宗教等传统并存），也以古城与考古遗产闻名。"]}
{"word":"Antal","summary":{"en":"Antal is most commonly a Hungarian given name (like Anthony) and can also be a surname.","zh":"Antal 最常见是匈牙利男性名（类似 Anthony/安东尼），也可作姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Hungarian male given name (equivalent to “Anthony” in English).","zh":"（匈牙利）男性名字，相当于英文名“Anthony（安东尼）”。"},"examples":[{"en":"Antal is a common Hungarian first name.","zh":"Antal 是一个常见的匈牙利名字。"},{"en":"My classmate Antal moved to the U.S. last year.","zh":"我的同学 Antal 去年搬到了美国。"}]},{"partOfSpeech":"other","definition":{"en":"a family name (surname), especially in Hungary and nearby regions.","zh":"姓氏（尤其常见于匈牙利及周边地区）。"},"examples":[{"en":"Her last name is Antal.","zh":"她的姓是 Antal。"},{"en":"I found several authors named Antal in the library catalog.","zh":"我在图书馆目录里找到几位姓 Antal 的作者。"}]}],"synonyms":["Anthony (equivalent English given name)"],"phonetic":"/ˈɑnˌtɑl/","extraExplanation":["“Antal”主要是匈牙利语中的人名，常被视为英文名“Anthony”的对应形式；在跨文化交流中，别人可能会把它误当作英文单词，但它通常是专有名词（姓名）。","在英语语境里，遇到“Antal”时常见于人名、作者名、运动员名或公司/品牌名；书写时通常首字母大写。"]}
{"word":"antal","summary":{"en":"Antal is mainly a Hungarian male name (also a surname). In Scandinavian languages, “antal” means “number/amount,” but this is not standard English.","zh":"Antal 主要是匈牙利男性名（也可作姓）。在斯堪的纳维亚语言中，“antal”表示“数量/人数”，但这不是标准英语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a masculine given name (especially in Hungarian), also used as a surname","zh":"男性名（尤见于匈牙利语中），也可作姓氏"},"examples":[{"en":"Antal is a common Hungarian given name, similar in meaning to Anthony.","zh":"Antal 是常见的匈牙利男性名，含义上类似于 Anthony（安东尼）。"},{"en":"The composer Antal Doráti conducted many famous orchestras.","zh":"指挥家 Antal Doráti 曾指挥过许多著名乐团。"}]},{"partOfSpeech":"n.","definition":{"en":"(not standard English) “number; amount,” used in Swedish and some other Scandinavian languages (often seen in phrases like “antal personer”)","zh":"（非标准英语）“数量；人数”，为瑞典语等斯堪的纳维亚语言用法（常见于如“antal personer”等短语）"},"examples":[{"en":"In Swedish, “antal” means “number,” as in “antal elever” (“number of students”).","zh":"在瑞典语里，“antal”表示“数量/人数”，如“antal elever”（学生人数）。"},{"en":"If you see “antal” on a Scandinavian form, it usually asks for a quantity.","zh":"如果你在斯堪的纳维亚语的表格上看到“antal”，通常是在询问数量。"}]}],"synonyms":["Anthony (as a related English name)"],"phonetic":"/ˈɑnˌtɑl/","extraExplanation":["“Antal”作为人名主要来自匈牙利语，相当于英语名“Anthony”的对应形式之一；在英语文本中多以专有名词出现（人名/姓氏），不当作普通词使用。","“antal=数量”这一义项并非英语，而是北欧语言（尤其瑞典语）里的常用词；在英语环境中看到它，往往说明材料原本是瑞典语/北欧语，或是未翻译的字段名。"]}
{"word":"antalgesic","summary":{"en":"“Analgesic” means pain-relieving (adj.) or a pain-relieving medicine (n.).","zh":"“Analgesic”表示“镇痛的”（形容词）或“镇痛药/止痛药”（名词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"A drug or treatment that reduces pain (a painkiller), without necessarily causing loss of consciousness.","zh":"镇痛的；止痛的（指减轻疼痛的药物或治疗方式，不一定会使人失去意识）。"},"examples":[{"en":"The doctor prescribed an analgesic to relieve her back pain.","zh":"医生开了镇痛药来缓解她的背痛。"},{"en":"After the surgery, he was given a mild analgesic instead of a strong opioid.","zh":"手术后，他用的是较温和的镇痛药，而不是强效阿片类药物。"}]},{"partOfSpeech":"n.","definition":{"en":"A pain-relieving medicine; a painkiller.","zh":"镇痛药；止痛药。"},"examples":[{"en":"Common over-the-counter analgesics include acetaminophen and ibuprofen.","zh":"常见的非处方镇痛药包括对乙酰氨基酚（扑热息痛）和布洛芬。"},{"en":"Take the analgesic with food to reduce stomach upset.","zh":"随餐服用镇痛药可减少胃部不适。"}]}],"synonyms":["painkiller","pain-reliever","antipain (less common)"],"phonetic":"/ˌæn.əlˈdʒiː.zɪk/","extraExplanation":["词源：来自希腊语 an-（“不、无”）+ algos（“疼痛”），字面意思是“无痛”。","用法小提示：analgesic 常用于医学或较正式语境；日常口语更常说 painkiller（止痛药）。","注意区分：analgesic（镇痛）主要强调“减轻疼痛”；anesthetic（麻醉）强调“使感觉消失/麻木”，常用于手术麻醉。"]}
{"word":"antalgic","summary":{"en":"Antalgic means pain-relieving, or (especially in “antalgic gait”) avoiding pain by changing the way you move.","zh":"Antalgic 指“镇痛的”，也常指（尤其在“antalgic gait”中）为避开疼痛而改变动作/走路方式的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Relieving pain; used to reduce or prevent pain.","zh":"（医学）镇痛的；用于减轻或防止疼痛的。"},"examples":[{"en":"The doctor prescribed an antalgic medication after the surgery.","zh":"手术后医生开了镇痛药。"},{"en":"This cream has a mild antalgic effect for muscle soreness.","zh":"这种乳膏对肌肉酸痛有轻微的镇痛作用。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Often in “antalgic gait”) Showing a movement or walking pattern that avoids pain.","zh":"（常见于“antalgic gait”）为躲避疼痛而形成的动作/步态。"},"examples":[{"en":"He walked with an antalgic gait to avoid pressure on his injured ankle.","zh":"他走路呈现躲避疼痛的跛行步态，以避免受伤的脚踝承重。"},{"en":"An antalgic posture can be a clue that a certain movement causes pain.","zh":"为躲避疼痛而形成的姿势可能提示某个动作会引发疼痛。"}]}],"synonyms":["analgesic","pain-relieving","painkilling"],"phonetic":"/ænˈtældʒɪk/","extraExplanation":["“antalgic”多用于医疗语境，来自希腊语词根：anti-（反、对抗）+ algos（疼痛）。","它和“analgesic（止痛的）”意思接近，但“antalgic”在临床记录里常用来描述“因疼痛而改变的步态/姿势”（如 antalgic gait）。"]}
{"word":"antalgics","summary":{"en":"Antalgics are pain-relieving medicines (painkillers); the adjective antalgic can also describe a movement or gait used to avoid pain.","zh":"antalgics 指止痛药；antalgic 也可作形容词，指为避痛/减痛而采取的动作或步态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"pain-relieving medicines; analgesics (painkillers).","zh":"止痛药；镇痛药（缓解疼痛的药物）。"},"examples":[{"en":"After the surgery, the doctor prescribed antalgics to control the pain.","zh":"手术后，医生开了止痛药来控制疼痛。"},{"en":"Some antalgics can cause drowsiness, so read the label carefully.","zh":"有些止痛药会引起嗜睡，所以要仔细阅读说明。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) describing a posture, movement, or gait used to reduce pain.","zh":"（较少见）指为减轻疼痛而采取的姿势、动作或步态。"},"examples":[{"en":"He walked with an antalgic gait because his knee hurt.","zh":"因为膝盖疼，他走路呈现疼痛性跛行。"},{"en":"The therapist noted an antalgic posture when she bent her back.","zh":"治疗师注意到她弯腰时采用了减痛的姿势。"}]}],"synonyms":["analgesics","painkillers","pain relievers"],"phonetic":"/ænˈtæl.dʒɪks/","extraExplanation":["“antalgic(s)”主要用于医学语境；日常英语更常说“painkillers”或“analgesics”。","常见止痛药包括对乙酰氨基酚（acetaminophen）与布洛芬（ibuprofen）；不同药物适应症与风险不同，尤其要注意剂量与与酒精/其他药物的相互作用。"]}
{"word":"antalgol","summary":{"en":"“Antalgol” is mainly used as a brand name for a pain reliever, not a common dictionary word.","zh":"“Antalgol”主要作为止痛药的商品名使用，并非常见词典词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a brand name for a pain-relieving medicine (an analgesic); not a common everyday English word, and it may refer to different products in different countries.","zh":"一种止痛药（镇痛药）的商品名；不是常见英语词，在不同国家可能指不同配方的产品。"},"examples":[{"en":"The label says “Antalgol,” but you should check the active ingredient and dosage.","zh":"标签上写着“Antalgol”，但你应查看有效成分和剂量。"},{"en":"Ask a pharmacist whether Antalgol is safe to take with your other medications.","zh":"问问药师 Antalgol 是否能与其他药物一起安全使用。"}]}],"synonyms":["painkiller","analgesic","pain reliever"],"phonetic":"/ænˈtælɡɔl/","extraExplanation":["“Antalgol”更像商品名（brand name）而不是通用名（generic name）。在医疗语境中，最好用通用说法如 painkiller / analgesic，或直接说具体成分（例如 acetaminophen/ibuprofen 等）。","不同地区的同名商品可能成分不同；如果你是在药盒、处方或说明书上看到该词，建议提供国家/包装照片或成分列表，才能更准确解释。"]}
{"word":"antalkali","summary":{"en":"“Antalkali” (more commonly written “anti-alkali/antialkali”) means alkali-resistant or something used to counteract alkali.","zh":"“antalkali”（更常写作“anti-alkali/antialkali”）指“抗碱的”，或“用于对抗/减弱碱性影响的东西”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon) Designed to resist or neutralize alkali (basic) substances; alkali-resistant.","zh":"（不常用）抗碱的；能抵抗或中和碱性物质的。"},"examples":[{"en":"The factory used antalkali gloves to protect workers from caustic chemicals.","zh":"工厂使用抗碱手套来保护工人免受腐蚀性化学品伤害。"},{"en":"Choose an antalkali coating if the surface will be cleaned with strong alkaline solutions.","zh":"如果表面将用强碱性溶液清洗，应选择抗碱涂层。"}]},{"partOfSpeech":"n.","definition":{"en":"(Uncommon) A substance or treatment used to counteract alkali effects; an anti-alkali agent.","zh":"（不常用）用于对抗碱性影响的物质或处理方法；抗碱剂/抗碱处理。"},"examples":[{"en":"They added an antalkali agent to reduce damage from alkaline water.","zh":"他们加入抗碱剂以减少碱性水造成的损害。"}]}],"synonyms":["alkali-resistant","anti-alkali","antialkali","alkali-proof","neutralizing agent (context-dependent)"],"phonetic":"/ˌæntiˈælkəlaɪ/","extraExplanation":["“antalkali”更常见的写法是 **anti-alkali** 或 **antialkali**。在工程/材料语境里，实际更常用的表达是 **alkali-resistant**（抗碱的），例如 *alkali-resistant glass fiber*（耐碱玻纤）。","如果你是在化学里想表达“中和碱”，更自然的说法通常是 **neutralize an alkali**（中和碱）或使用 **acid**（酸）/ **neutralizing agent**（中和剂）。"]}
{"word":"antalkalies","summary":{"en":"“Antalkalies” is the plural of an older term meaning substances that neutralize alkali; today “antacid” is more common.","zh":"antalkalies 是较旧用语的复数形式，指中和碱性的物质；现代更常用 antacid（抗酸剂/制酸剂）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural) substances used to counteract or neutralize excess alkali (base), especially in medicine; an older/less common term similar to “antacid.”","zh":"（复数）用于对抗或中和过多碱性物质（碱）的物质，尤用于医学语境；较旧/不常用的说法，意思接近“抗酸剂/制酸剂”。"},"examples":[{"en":"The doctor prescribed antalkalies to relieve the patient’s stomach discomfort.","zh":"医生开了抗碱药（制酸剂）来缓解病人的胃部不适。"},{"en":"Before modern antacids became common, some texts referred to these medicines as antalkalies.","zh":"在现代抗酸药普及之前，有些文献会把这类药称为 antalkalies。"}]}],"synonyms":["antacids","alkali-neutralizers","neutralizing agents"],"phonetic":"/ˌæntˈæl.kəˌlaɪ/","extraExplanation":["“antalkalies”通常被视为“antalkali”的复数形式，是较早期的用语；现代英语里更常见、更好懂的词是 **antacid**（抗酸剂/制酸剂）。","构词上可理解为 **anti-**（反、对抗）+ **alkali**（碱）。在医学语境中多指用来中和酸或调节体内酸碱度的药物，但实际使用时建议优先用更常见的表达（如 antacid）。"]}
{"word":"antalkaline","summary":{"en":"Antalkaline means “against alkalinity,” used to describe something that counteracts or reduces an alkaline condition.","zh":"Antalkaline 指“抗碱的”，用来描述能对抗或降低碱性的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry/biology) Preventing, counteracting, or reducing alkalinity; acting against an alkaline condition.","zh":"（化学/生物）抗碱的；用来防止、对抗或降低碱性（偏碱状态）的。"},"examples":[{"en":"Some skin-care formulas include mild antalkaline ingredients to help keep the product’s pH balanced.","zh":"一些护肤配方会加入温和的抗碱成分，帮助维持产品的酸碱度平衡。"},{"en":"An antalkaline buffer can be used to stop a solution from becoming too alkaline.","zh":"抗碱缓冲剂可用于防止溶液变得过于偏碱。"}]}],"synonyms":["anti-alkaline","alkalinity-reducing","alkalinity-neutralizing"],"phonetic":"/ˌæntˈæl.kəˌlaɪn/","extraExplanation":["“ant-”是表示“反对、对抗”的前缀（如 antibiotic 抗生素），alkaline 指“碱性的”。因此 antalkaline 字面意思就是“对抗碱性”。","该词在日常英语中很少见，更常见的表达是 anti-alkaline（加连字符）或用“neutralizing alkalinity / reducing alkalinity（中和/降低碱性）”来描述具体作用。"]}
{"word":"antalkalis","summary":{"en":"“Antalkalis” (usually “antialkalis/anti-alkalis”) means substances used to neutralize alkalis; it’s a rare term today.","zh":"“Antalkalis”（多作“antialkalis/anti-alkalis”）指用于中和碱性物质的物质；现代用法较少见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"substances used to counteract or neutralize an alkali (a basic substance); a rare/old-fashioned term, usually written as “anti-alkalis” or “antialkalis.”","zh":"用于对抗或中和“碱性物质（alkali）”的物质；较少见/较旧的用法，常写作“anti-alkalis”或“antialkalis”。"},"examples":[{"en":"The lab added antialkalis to bring the solution closer to neutral pH.","zh":"实验室加入抗碱剂，使溶液的 pH 更接近中性。"},{"en":"In wastewater treatment, acids can act as antialkalis when the water is too alkaline.","zh":"在污水处理里，当水过于碱性时，酸可充当抗碱剂。"}]}],"synonyms":["neutralizing agents","acids (in context)","pH adjusters"],"phonetic":"/ˌæn(t)iˈæl.kə.laɪz/","extraExplanation":["这个词在现代英语里非常少见，更多时候会直接说“acids (酸)”或“neutralizing agents (中和剂)”来表达“用来中和碱”的东西。","词形上可以理解为 anti-（反、对抗）+ alkali（碱）。你输入的“antalkalis”很可能是“antialkalis/anti-alkalis”的简写或拼写变体。","如果你想表达“胃酸过多吃的药”，更常用的词是 antacids（抗酸药），不是 antalkalis。"]}
{"word":"Antalya","summary":{"en":"Antalya is a major Mediterranean coastal city in southwestern Turkey, and it can also refer to the surrounding province/region.","zh":"Antalya 指土耳其西南部地中海沿岸的重要城市，也可指周边的安塔利亚省／地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A coastal city in southwestern Turkey on the Mediterranean Sea, known for beaches, a historic old town (Kaleiçi), and tourism.","zh":"土耳其西南部地中海沿岸的城市，以海滩、老城区（Kaleiçi）和旅游业闻名。"},"examples":[{"en":"We flew to Antalya for a week of swimming and sightseeing.","zh":"我们飞到安塔利亚，度过一周的游泳和观光。"},{"en":"Antalya’s old town has narrow streets and Ottoman-era houses.","zh":"安塔利亚的老城区有狭窄的街道和奥斯曼时期的房屋。"}]},{"partOfSpeech":"n.","definition":{"en":"The province/region around the city of Antalya in Turkey (often mentioned in travel, geography, or administration).","zh":"土耳其的安塔利亚省／安塔利亚地区（常用于旅行、地理或行政语境）。"},"examples":[{"en":"Many resorts are located along the coast of Antalya Province.","zh":"许多度假村坐落在安塔利亚省的海岸线上。"}]}],"synonyms":["Attaleia (historical)","Antalya Province"],"phonetic":"/ænˈtæljə/","extraExplanation":["“Antalya”是土耳其语地名；英文中常按土耳其拼写写作 Antalya，重音通常落在第二个音节（an-TAL-ya）。","该城在古代希腊—罗马时期曾被称为 Attaleia（阿塔利亚/阿塔莱亚），与城市的历史渊源有关；现代常被归入“土耳其里维埃拉（Turkish Riviera）”的旅游线路。"]}
{"word":"antambulacral","summary":{"en":"A zoological adjective meaning “opposite the ambulacral (tube-foot) area” in echinoderms.","zh":"动物学形容词：指棘皮动物中“位于步带（管足区）对侧/远离步带”的部位。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an echinoderm body part) Located opposite or away from the ambulacral area (the part with tube feet).","zh":"（棘皮动物解剖）指位于步带（具管足的区域）相对侧或远离步带的；反步带的。"},"examples":[{"en":"In sea urchins, antambulacral plates lie opposite the ambulacral zones that bear tube feet.","zh":"在海胆中，反步带骨板位于长有管足的步带区的相对侧。"},{"en":"The paper compares ambulacral and antambulacral structures in several starfish species.","zh":"该论文比较了几种海星的步带结构与反步带结构。"}]}],"synonyms":["interambulacral"],"phonetic":"/ˌæn.tæmˈbjuː.lə.krəl/","extraExplanation":["这是一个较少见的专业术语，多见于动物学/无脊椎动物学（尤其棘皮动物：海星、海胆等）的形态描述。","ambulacral 指“步带/步带区”（通常与管足、步带沟相关）；ant- 表示“相对、对侧”。在一些资料里，它与 interambulacral（“步带间的”）在用法上可能接近，但具体是否完全等同取决于作者的解剖分区方式。"]}
{"word":"antanacathartic","summary":{"en":"A rare medical adjective meaning “antidiarrheal; counteracting a laxative (cathartic) effect.”","zh":"一个罕见的医学形容词，意思是“止泻的；抵消泻药（通便）作用的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medical, rare) Preventing or counteracting a cathartic effect; stopping or reducing bowel movements (antidiarrheal).","zh":"（医学用语，罕见）抑制或抵消“泻药/通便（cathartic）”作用的；止泻的、减少排便的。"},"examples":[{"en":"The doctor prescribed an antanacathartic medicine to control the patient’s diarrhea.","zh":"医生开了止泻药来控制病人的腹泻。"},{"en":"After taking a strong laxative, he needed an antanacathartic treatment to calm his stomach.","zh":"服用强力泻药后，他需要止泻治疗来缓解肠胃不适。"}]}],"synonyms":["antidiarrheal","constipating","astringent"],"phonetic":"/ˌæntænə kəˈθɑrtɪk/","extraExplanation":["这个词非常少见，多见于较旧的医学英语或词典条目中。现代英语里更常用 antidiarrheal（止泻的/止泻药）、antidiarrhoeal（英式拼写）、constipating（导致便秘的）、astringent（收敛的，在某些场景下有“止泻”含义）。","词形上可以理解为“反（anti-）+ 通便/泻下（cathartic）”，因此核心意思就是“与泻下作用相反：抑制排便”。"]}
{"word":"antanaclasis","summary":{"en":"Antanaclasis is the repetition of the same word or phrase with a different meaning each time.","zh":"Antanaclasis 指重复同一个词/短语但每次含义不同的修辞手法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rhetorical device where the same word or phrase is repeated, but with a different meaning each time (often for wit, irony, or emphasis).","zh":"（修辞）同语异义：重复同一个词或短语，但每次表达的意义不同，常用于机智、讽刺或强调。"},"examples":[{"en":"“If you aren’t fired with enthusiasm, you will be fired with enthusiasm.”","zh":"“如果你不被热情点燃，你就会被‘热情’解雇。”"},{"en":"“We must all hang together, or we shall all hang separately.”","zh":"“我们必须团结一致，否则就会被分别‘吊死/处死’。”"},{"en":"“Time flies like an arrow; fruit flies like a banana.”","zh":"“时间飞逝如箭；果蝇喜欢香蕉。”"}]}],"synonyms":["pun","wordplay"],"phonetic":"/ˌæn.tə.nəˈklæ.sɪs/","extraExplanation":["词源：来自希腊语 *antanaklasis*，意为“反复折回”。在英语修辞学里，它常通过一个词的多义性（polysemy）或同形异义（同一个拼写/发音但意义不同）来制造“转折感”。","与相关概念区分：\n- *Pun*（双关）是更宽泛的“玩文字”手法；antanaclasis 通常强调“同一词的重复”且意义发生转换。\n- *Polyptoton* 是同一词根的不同词形反复（如 *strong, stronger*），不一定是同词异义。\n- *Antimetabole* 是词序反转（如 “Ask not what your country can do for you…”），不要求同词变义。","文学与演讲中常见：莎士比亚作品中经常用到（例如围绕 *grave*、*light* 等多义词制造讽刺或机智效果）。写作时要确保“第二次出现的意义”能被读者清楚理解，否则容易显得生硬。"]}
{"word":"antanagoge","summary":{"en":"Antanagoge is a rhetorical device that admits something negative, then counters it with something positive to soften the impact.","zh":"Antanagoge 是一种修辞手法：先承认负面点，再用正面点抵消或缓和语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rhetorical strategy in which a negative point is acknowledged and then balanced with a positive one (often to soften criticism or change the mood)","zh":"一种修辞策略：先承认负面之处，再用正面内容加以平衡（常用于缓和批评或转变语气）"},"examples":[{"en":"The review used antanagoge: “The plot is slow, but the characters feel real.”","zh":"这篇评论用了 antanagoge：“情节节奏慢，但人物很真实。”"},{"en":"She practiced antanagoge to give kinder feedback: “Your idea needs clearer steps, but your goal is excellent.”","zh":"她用 antanagoge 来更温和地反馈：“你的想法需要更清晰的步骤，但你的目标很棒。”"}]}],"synonyms":["concession (rhetorical)","silver lining","balanced critique","turn to the positive"],"phonetic":"/ˌæn.təˈnæɡ.ə.dʒi/","extraExplanation":["词源来自希腊语修辞传统，常见于演讲、辩论、写作与日常沟通中，作用是“先给出不利信息，再用有利信息缓冲”，让听者更容易接受。","与 “but” 结构经常一起出现（A is bad, but B is good），但关键不只是语法，而是“先负后正”的沟通策略。","在文学与公共表达中，它可以制造更复杂的语气：既诚实地承认缺点，又保留希望或赞许。"]}
{"word":"Antananarivo","summary":{"en":"Antananarivo is the capital city of Madagascar (often called “Tana”).","zh":"Antananarivo 是马达加斯加的首都（常简称为“Tana”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The capital and largest city of Madagascar, located in the central highlands; often shortened to “Tana.”","zh":"安塔那那利佛：马达加斯加的首都和最大城市，位于中部高地；常简称为“Tana（塔纳）”。"},"examples":[{"en":"Antananarivo is the political and economic center of Madagascar.","zh":"安塔那那利佛是马达加斯加的政治与经济中心。"},{"en":"Many travelers start their Madagascar trip in Antananarivo, then fly or drive to the coast.","zh":"许多旅行者从安塔那那利佛开始马达加斯加之旅，然后再飞往或开车前往海岸。"}]}],"synonyms":["Tana"],"phonetic":"/ˌænˌtænəˈniːrəvoʊ/","extraExplanation":["“Antananarivo”来自马拉加什语（Malagasy）。在英语里也常见法语影响下的旧拼法“Antananarive”。","发音提示：英语中重音通常落在倒数第三个音节附近；日常交流里，很多人会直接说简称“Tana”。"]}
{"word":"Antanandro","summary":{"en":"Antanandro is a Malagasy word meaning “daytime/daylight,” and sometimes “midday/noon.”","zh":"Antanandro 是马达加斯加语，意为“白天/日间（天亮时）”，有时也可指“正午/中午”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"daytime; daylight (the time when the sun is up).","zh":"白天；日间（太阳在天空、天亮的时间）。"},"examples":[{"en":"We traveled during antanandro and rested at night.","zh":"我们在白天（antanandro）赶路，晚上休息。"},{"en":"It’s safer to go in antanandro than after dark.","zh":"白天（antanandro）去比天黑后更安全。"}]},{"partOfSpeech":"n.","definition":{"en":"midday; noon (in some contexts, referring to the sun being high).","zh":"正午；中午（在一些语境中指太阳高挂的时候）。"},"examples":[{"en":"Let’s meet around antanandro.","zh":"我们大约在中午（antanandro）见面吧。"}]}],"synonyms":["daytime","daylight","noon","midday"],"phonetic":"/ˌɑn.təˈnɑn.droʊ/","extraExplanation":["“Antanandro”是马达加斯加语（Malagasy）词汇，常用来指“白天/日间”，有时也可延伸到“中午、日正当中”的感觉。","它在日常叙述里经常与“alina”（夜晚）形成对比，用来表达行动发生在白天还是夜晚。"]}
{"word":"antanandro","summary":{"en":"Antanandro is a Malagasy word meaning “today” or “daytime,” depending on context.","zh":"Antanandro 是马达加斯加语词，可表示“今天”或“白天”，具体看语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Malagasy) today; this day (used to refer to the present day).","zh":"（马达加斯加语）今天；今日（指当前这一天）。"},"examples":[{"en":"Antanandro is hot, so let’s stay in the shade.","zh":"今天很热，所以我们待在阴凉处吧。"},{"en":"I can’t meet tomorrow—only antanandro.","zh":"我明天见不了——只能今天。"}]},{"partOfSpeech":"n.","definition":{"en":"(Malagasy) daytime; in the daytime (as opposed to night).","zh":"（马达加斯加语）白天；在白天（与夜晚相对）。"},"examples":[{"en":"We travel antanandro and rest at night.","zh":"我们白天赶路，晚上休息。"},{"en":"The market is busiest antanandro.","zh":"集市白天最热闹。"}]}],"synonyms":["(Malagasy) androany (today)","(English) today","(English) daytime"],"phonetic":"/ˌɑn.təˈnæn.droʊ/","extraExplanation":["“antanandro”来自马达加斯加语（Malagasy）。在学习资料或口语记录里，它常被用来表示“今天/白天”。不同地区与拼写体系中，你也可能看到更常见的“androany”（今天）。","如果你是在歌词、谚语或宗教文本中看到该词，语境有时更偏“白昼/日间”，而不是日历意义上的“今天”。"]}
{"word":"antanemic","summary":{"en":"Antianemic (often misspelled as “antanemic”) means preventing or treating anemia.","zh":"Antianemic（常被误拼为“antanemic”）意为“抗贫血的；用于预防或治疗贫血的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medical) Preventing or treating anemia (a condition in which the blood has too few healthy red blood cells or too little hemoglobin).","zh":"（医学）抗贫血的；用于预防或治疗贫血的（贫血指红细胞或血红蛋白不足）。"},"examples":[{"en":"Iron supplements are often used as an antianemic treatment.","zh":"铁剂常被用作抗贫血治疗。"},{"en":"The doctor prescribed an antianemic medicine after the blood test showed low hemoglobin.","zh":"血检显示血红蛋白偏低后，医生开了抗贫血药物。"}]}],"synonyms":["anti-anemic","hematinic (more specific: helps form blood, e.g., iron/folate/B12)","anti-anemia"],"phonetic":"/ˌæn.ti.əˈniː.mɪk/","extraExplanation":["“antanemic”更常见的拼写是 **antianemic**（也可写作 **anti-anemic**）。前缀 **anti-** 表示“对抗/抵抗”，**anemic** 表示“贫血的”。因此该词多用于医学语境，常见搭配有 antianemic drug / treatment / agent。"]}
{"word":"antapex","summary":{"en":"Antapex is the point opposite an apex—most commonly, the point opposite the solar apex in astronomy.","zh":"Antapex 指与 apex 相对的点，最常见于天文学中：与太阳向点相对的反向点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Astronomy) The point in the sky directly opposite the “apex,” especially opposite the solar apex (the direction the Sun is moving through the local stars).","zh":"（天文学）与“顶点”（apex）方向正相反的天空点，尤指与太阳向点（太阳在本地恒星背景中运动的方向）相对的反向点。"},"examples":[{"en":"Astronomers can describe the Sun’s motion by giving both the solar apex and the antapex.","zh":"天文学家可以通过给出太阳向点和反向点来描述太阳的运动。"},{"en":"If you face the solar apex, the antapex lies directly behind you.","zh":"如果你正面朝向太阳向点，那么反向点就在你身后正相反的位置。"}]},{"partOfSpeech":"n.","definition":{"en":"(General, less common) A point opposite an apex or tip.","zh":"（一般用法，较少见）与某个顶点或尖端相对的点。"},"examples":[{"en":"In some technical descriptions, the antapex is used to name the point opposite the tip.","zh":"在一些技术性描述中，antapex 用来指称与尖端相对的点。"}]}],"synonyms":["opposite point","antipode (general “opposite point,” not astronomy-specific)"],"phonetic":"/ˌæntˈeɪpɛks/","extraExplanation":["词源上可理解为 ant-（表示“相对/相反”）+ apex（“顶点/向点”）。在天文学里最常见的搭配是 solar apex（太阳向点）与 solar antapex（太阳反向点），用于描述太阳相对于附近恒星的运动方向。","在不同资料里也可能写作 antapex / antiapex；如果你是在某篇论文或教材里看到该词，可以把原句发来，我可以帮你确认它在该领域的具体指法。"]}
{"word":"antapexes","summary":{"en":"Antapexes are the points opposite the apexes on ovoid (egg-shaped) objects.","zh":"Antapexes 指卵形（卵状）物体上与尖端（apex）相对的那些点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of antapex: the point on an egg-shaped (ovoid) object that is opposite the apex (the tip).","zh":"antapex 的复数：指卵形（卵状）物体上与顶端（apex，尖端）相对的那一点，即“反顶点/对顶点”。"},"examples":[{"en":"In an ovoid shape, the antapexes lie opposite the apexes.","zh":"在卵形结构中，antapexes 位于 apexes（尖端）的对侧。"},{"en":"The biologist noted small scars near the antapexes of several eggs.","zh":"生物学家注意到几枚卵在 antapexes（反顶点）附近有细小的痕迹。"}]}],"synonyms":["opposite end (in an ovoid shape)","opposite pole (general)"],"phonetic":"/ˌæntəˈpɛks/","extraExplanation":["“antapex”常见于描述卵、种子、孢子或卵形几何体的形态学写作中，用来更精确地定位“尖端的相反端”。相比日常英语，它更偏学术与技术语境。","词素上可以理解为 anti-（相对、反向）+ apex（顶点、尖端），因此含义直观：与 apex 相对的端点。"]}
{"word":"antaphrodisiac","summary":{"en":"An anaphrodisiac is something that reduces sexual desire or kills the mood.","zh":"anaphrodisiac 指“抑制性欲的东西/因素”，也可形容“让人没兴致、毫无情调”的。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance, food, medicine, or influence believed to reduce sexual desire (the opposite of an aphrodisiac).","zh":"（被认为）能降低性欲的物质、食物、药物或因素；与“催情剂（aphrodisiac）”相反。"},"examples":[{"en":"Some people consider heavy meals an anaphrodisiac because they make you feel sleepy.","zh":"有些人认为吃得太饱是一种“抑制性欲的因素”，因为会让人犯困。"},{"en":"The medication may act as an anaphrodisiac for some patients.","zh":"这种药对一些患者可能会起到抑制性欲的作用。"}]},{"partOfSpeech":"adj.","definition":{"en":"reducing sexual desire; not sexually stimulating.","zh":"降低性欲的；不具性刺激作用的。"},"examples":[{"en":"The harsh lighting gave the room an anaphrodisiac feel.","zh":"刺眼的灯光让房间显得毫无情调、让人提不起兴致。"},{"en":"Stress can be strongly anaphrodisiac.","zh":"压力可能会明显抑制性欲。"}]}],"synonyms":["antiaphrodisiac","libido-suppressant","desire-reducing agent","turn-off (informal)"],"phonetic":"/ˌænˌæfɹəˈdɪziˌæk/","extraExplanation":["常见拼写是 **anaphrodisiac**（你写的 *antaphrodisiac* 多半是拼写误差）。","词源上来自希腊语：**an-**（否定、缺乏）+ **aphrodisiac**（与爱神阿佛洛狄忒 Aphrodite 相关、催情的）。","在日常英语里，这个词较正式或偏书面；口语中更常说 *kills the mood*（扫兴/破坏气氛）或 *turn-off*（让人瞬间没兴趣的事/人）。"]}
{"word":"antaphroditic","summary":{"en":"Antaphroditic (rare) means reducing sexual desire; it’s often treated as a misspelling of antiaphrodisiac/antiaphrodisiacal.","zh":"Antaphroditic（罕见）指“抑制性欲的”；常被视为 antiaphrodisiac/antiaphrodisiacal 的误拼。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare; often a misspelling of **antiaphrodisiac/antiaphrodisiacal**) reducing sexual desire or sexual arousal.","zh":"（罕见；常被视为 **antiaphrodisiac/antiaphrodisiacal** 的误拼）抑制性欲或性唤起的；使性冲动减弱的。"},"examples":[{"en":"Some medications can have an antaphroditic effect, lowering libido as a side effect.","zh":"一些药物可能有“antaphroditic（抑制性欲）”的作用，作为副作用让性欲下降。"},{"en":"Stress is often described as antaphroditic because it can reduce interest in sex.","zh":"压力常被形容为“antaphroditic”，因为它会降低对性生活的兴趣。"}]}],"synonyms":["antiaphrodisiacal","libido-reducing","anaphrodisiac (rare)"],"phonetic":"/ˌæn.tiˌæf.rəˈdɪt.ɪk/","extraExplanation":["更常见、较标准的拼写是 **antiaphrodisiac**（名词：抑制性欲的东西）与 **antiaphrodisiacal**（形容词：抑制性欲的）。你输入的 **antaphroditic** 在词典中较少见，很多情况下会被当作非标准拼写。","词源上与爱与美的希腊女神 **Aphrodite（阿佛洛狄忒）**有关：**aphrodisiac** 指“催情/助性”的；加上 **anti-**（反、抑制）就变成“抑制性欲的”。"]}
{"word":"antapices","summary":{"en":"Antapices = the plural of antapex: points opposite an apex, used mainly in technical writing (e.g., astronomy).","zh":"Antapices 是 antapex 的复数：指与顶点相对的点，主要见于技术/学术写作（如天文学）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of antapex: points directly opposite an apex (the “top” point), especially in technical contexts such as astronomy or geometry.","zh":"antapex 的复数：与顶点（apex，“尖端/顶端”）正相对的点，常用于天文学或几何等专业语境。"},"examples":[{"en":"In astronomy, the Sun’s antapex is the point in the sky opposite the direction of its motion; there are also antapices for different reference frames.","zh":"在天文学中，太阳的“反向点”(antapex)是天空中与其运动方向相对的点；在不同参考系下也会有不同的 antapices。"},{"en":"A double cone has two opposite tips; you can think of them as apex and antapex, or two antapices relative to different choices of “top.”","zh":"一个双圆锥有两个相对的尖端；可以把它们看作 apex 和 antapex，或在不同“顶端”选择下称为两个 antapices。"}]}],"synonyms":["opposite points","antapex (singular)","counterpoint (context-dependent)"],"phonetic":"/ˌæntəˈpɪsiːz/","extraExplanation":["“antapices”是非常少见的学术用词，通常你更常见的是“antapex”（单数）以及更常用的词“apex / apices”。","词根上，“anti-”表示“相对、相反”，所以 antapex/antapices 可以直观理解为“与顶点相对的点”。"]}
{"word":"antapocha","summary":{"en":"“Antapocha” is not a recognized English vocabulary word; it is likely a proper name or a misspelling.","zh":"“antapocha”不是常见/标准英语词汇；更可能是专有名词或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most likely a proper name (a person/place name) or a misspelling of another word.","zh":"不是标准英语词；更可能是专有名词（人名/地名）或其他词的拼写错误。"},"examples":[{"en":"I couldn’t find “antapocha” in an English dictionary—could you share the sentence you saw it in?","zh":"我在英文词典里找不到“antapocha”，你能把它出现的句子发我吗？"},{"en":"Antapocha might be a family name or a place name in some communities.","zh":"Antapocha 可能是在某些地区/社群里使用的姓氏或地名。"}]}],"phonetic":"ˌæn.təˈpoʊ.tʃə","extraExplanation":["“antapocha”在主流英语语料和词典中几乎没有收录，因此很难给出可靠词义。最常见的情况是：①人名/地名（可能来自西班牙语区或安第斯地区语言的转写）；②拼写变体或打字错误。","如果你告诉我它来自哪里（例如：一篇文章、歌词、游戏、聊天）以及上下文句子，我可以更准确地判断它是专有名词、外来词，还是你想查的其实是另一个英语单词。"]}
{"word":"antapodosis","summary":{"en":"Antapodosis is a rhetorical term for the emphatic “then” part of a conditional sentence (If…, then…).","zh":"antapodosis 指条件句中强调性的“那么/就……”结果从句（If…, then…）的修辞用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rhetoric) A figure of speech where the second part of a conditional sentence (the “then” clause) is stated clearly and forcefully—often as a strong result, warning, or threat.","zh":"（修辞）对句式：在条件句中把后半部分（“那么/就……”的结果从句）明确、有力地说出来，常用来强调结果、警告或威胁。"},"examples":[{"en":"If you lie to me again, then you’re out of the team.","zh":"如果你再对我撒谎，那么你就被踢出队伍。"},{"en":"If we don’t act now, then we will regret it later.","zh":"如果我们现在不行动，那么以后一定会后悔。"},{"en":"If you choose power over kindness, then don’t be surprised when you end up alone.","zh":"如果你选择权力而不是善良，那么你最终孤独也别感到惊讶。"}]}],"synonyms":["apodosis (related term)","conditional result clause (description)"],"phonetic":"/ˌæn.tə.pəˈdoʊ.sɪs/","extraExplanation":["词源来自希腊语，常见于修辞学与文学分析中；日常英语里人们会自然使用这种句式，但很少用“antapodosis”这个术语来命名。","它通常出现在“If …, then …”结构中；“then”有时会省略（If you touch that, you’re in trouble.），但修辞分析里仍可视为一种对句式，用来让结果更有冲击力。","相关术语：apodosis 指条件句的结果从句本身；protasis 指条件从句（If 从句）。antapodosis 强调把结果从句说得特别明确、有力。"]}
{"word":"antapology","summary":{"en":"“antapology” isn’t a standard English word; it most likely means “an apology” (saying sorry). If you meant a fake/insincere apology, the usual term is “non-apology.”","zh":"“antapology”不是标准英文词；多半是想写“an apology”（道歉）。如果想表达不真诚的道歉，常用说法是“non-apology”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Likely a typo for) “an apology”: a statement where you say you are sorry for something you did or for a problem you caused.","zh":"（很可能是拼写错误）“an apology”：道歉；为自己做错的事或造成的问题表示歉意的说法。"},"examples":[{"en":"I owe you an apology for being late.","zh":"我迟到了，应该向你道歉。"},{"en":"She wrote an apology to her teacher.","zh":"她给老师写了一封道歉信。"}]},{"partOfSpeech":"n.","definition":{"en":"(If you meant “anti-apology”) a message that sounds like an apology but does not truly accept responsibility, often used to avoid blame.","zh":"（如果你想写的是“anti-apology”）“反道歉/假道歉”：听起来像道歉但并不真正承担责任，常用来回避过错。"},"examples":[{"en":"“I’m sorry you feel that way” is often seen as an anti-apology.","zh":"“很抱歉你会这样想”常被认为是一种假道歉。"},{"en":"People criticized his anti-apology because he never admitted what he did.","zh":"人们批评他的假道歉，因为他从未承认自己做了什么。"}]}],"synonyms":["an apology","apology","non-apology","insincere apology"],"phonetic":"/ən əˈpɑlədʒi/","extraExplanation":["“antapology”本身不是常见英文单词。最常见的情况是你想输入的是“an apology”（中间有空格）。","如果你其实想表达“假道歉/不真诚的道歉”，英语里更常写作“non-apology”或“anti-apology”。其中“non-apology”更常见。"]}
{"word":"antapoplectic","summary":{"en":"Ant(a)poplectic (usually spelled antiapoplectic) is a rare adjective meaning “preventing or treating apoplexy/stroke,” mostly found in older medical writing.","zh":"ant(a)poplectic（通常拼作 antiapoplectic）是一个很少见的形容词，意为“预防或治疗卒中/中风（旧称 apoplexy）”，多见于旧式医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Preventing or treating apoplexy (a sudden stroke or loss of consciousness).","zh":"（罕用）用于预防或治疗“卒中/中风”（旧称 apoplexy，指突发性中风或昏厥）的。"},"examples":[{"en":"In older medical texts, some herbs were described as antiapoplectic remedies.","zh":"在较早的医学文献里，有些草药被称为“抗中风（antiapoplectic）”的疗法。"},{"en":"The book lists antiapoplectic measures such as rest and avoiding extreme stress.","zh":"这本书列出一些“抗中风（antiapoplectic）”的措施，比如休息和避免极度压力。"}]}],"synonyms":["antistroke (rare)","stroke-preventing (descriptive)","preventive (general)"],"phonetic":"/ˌæn.taˌæp.əˈplɛk.tɪk/","extraExplanation":["“antapoplectic”本身非常少见，很多情况下是把更常见的拼写 “antiapoplectic” 写错或印刷错误。","“apoplexy”是较旧的医学用语，现代英语更常用 “stroke（中风）”“cerebral hemorrhage（脑出血）”等；因此 “antiapoplectic”多见于历史/古典医学语境，而不常用于当代日常英语。","另一个常见的 “apoplectic” 还有比喻义：形容人“气得发抖、暴怒”（比如：He was apoplectic with rage）。但 “antiapoplectic”通常只用于医学意义。"]}
{"word":"Antar","summary":{"en":"Antar most commonly means “to deliver/to take (someone or something) somewhere” in Indonesian/Malay; it can also be used as a personal name.","zh":"Antar 最常见于印尼语/马来语，意思是“递送/带某人某物去某地”；也可能是人名。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Indonesian/Malay) to deliver; to take someone/something to a place; to send off (often used in daily speech).","zh":"（印尼语/马来语）送；递送；带某人/某物去某地；送行（口语常用）。"},"examples":[{"en":"Can you antar this package to the post office?","zh":"你能把这个包裹送到邮局吗？"},{"en":"I will antar my friend to the station.","zh":"我要送朋友去车站。"},{"en":"They antar the guests to the door when the party ends.","zh":"聚会结束时，他们把客人送到门口。"}]},{"partOfSpeech":"n.","definition":{"en":"(Name/word form) “Antar” can also be a personal name (common in Arabic-speaking cultures), but as a name it doesn’t have one fixed English meaning.","zh":"（名字/词形）“Antar”也可作人名（在阿拉伯语文化中较常见），但作为名字在英语里没有唯一固定含义。"},"examples":[{"en":"Antar is a character’s name in some stories.","zh":"Antar 是一些故事里的人物名字。"}]}],"synonyms":["deliver","take","escort","send","drop off"],"phonetic":"/ˈɑn.tɑr/","extraExplanation":["“antar”在印尼语里非常常见，常与方向或地点搭配：antar ke + 地点（送到……）。也常见作“mengantar”（更正式/更完整的动词形式），如：mengantar anak ke sekolah（送孩子去上学）。","如果你是在英语语境中看到“Antar”，很可能是人名；如果是在东南亚语境（印尼/马来）里看到，多半就是“递送、护送”的动词。"]}
{"word":"antar","summary":{"en":"“Antar” is usually a Malay/Indonesian word meaning “to deliver or take (someone/something) somewhere,” not a standard English word.","zh":"“antar”通常是马来语/印尼语借词，表示“递送或送（人/物）到某处”，并非标准英语词汇。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Not standard English) A Malay/Indonesian verb meaning “to deliver; to take (someone/something) to a place,” often seen in phrases like “antar jemput” (drop off and pick up).","zh":"（非标准英语）马来语/印尼语动词，意思是“递送；送（人/物）到某地”，常见于“antar jemput”（接送）等表达。"},"examples":[{"en":"I’ll antar the package to your office after lunch.","zh":"我午饭后把包裹送到你办公室。"},{"en":"The driver will antar you to the hotel.","zh":"司机会送你去酒店。"},{"en":"This app offers antar-jemput service for students.","zh":"这个应用提供学生接送服务。"}]}],"synonyms":["deliver","take","bring","drop off","escort"],"phonetic":"/ˈæn.tɑr/","extraExplanation":["“antar”在英语里不是常见词汇；如果你是在英文文章/对话里看到它，往往是因为内容与印尼/马来西亚有关（例如外卖、物流、接送服务的语境），作者直接借用了当地词。","容易混淆的英文词：\n- anther（花药）\n- antarctic / Antarctica（南极的 / 南极洲）\n如果你能给我一句原文，我可以帮你判断到底是哪一个。"]}
{"word":"Antara","summary":{"en":"Antara is commonly a personal name or the name of Indonesia’s national news agency (ANTARA). In some South/Southeast Asian languages, it relates to the meaning “between; among.”","zh":"Antara 常见作人名或印尼国家通讯社（ANTARA）的名称；在部分南亚/东南亚语言中也与“在……之间；在……之中”的含义相关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name (often used in South and Southeast Asia); used for both men and women depending on culture","zh":"人名（在南亚与东南亚较常见）；在不同文化中可作男性或女性名字"},"examples":[{"en":"Antara is my colleague in the marketing team.","zh":"Antara 是我们市场团队的同事。"},{"en":"They named their daughter Antara to honor their family heritage.","zh":"他们给女儿取名 Antara，以纪念家族传统。"}]},{"partOfSpeech":"other","definition":{"en":"(ANTARA) Indonesia’s national news agency, a major source of official and general news","zh":"（ANTARA）印度尼西亚国家通讯社，是重要的新闻来源之一"},"examples":[{"en":"According to ANTARA, the government announced new travel guidelines.","zh":"据 ANTARA 报道，政府公布了新的旅行指南。"},{"en":"Many international outlets cite ANTARA for updates from Indonesia.","zh":"许多国际媒体引用 ANTARA 获取来自印尼的最新消息。"}]},{"partOfSpeech":"other","definition":{"en":"in Sanskrit and in modern Indonesian/Malay, a word meaning “between; among” (often seen in names and titles)","zh":"在梵语以及现代印尼语/马来语中意为“在……之间；在……之中”（常见于人名或称号中）"},"examples":[{"en":"In some contexts, antara can mean “between,” as in “between two places.”","zh":"在某些语境中，antara 可以表示“在两地之间”。"},{"en":"The name Antara is sometimes explained as connected to the idea of “in-between” or “among.”","zh":"名字 Antara 有时被解释为与“之间/之中”的概念相关。"}]}],"synonyms":["(as a news agency) Indonesian National News Agency (ANTARA)"],"phonetic":"/ænˈtɑːrə/","extraExplanation":["“Antara”多为专有名词（人名、机构名），在英语里通常不翻译含义，而是按原拼写使用。","作为印尼国家通讯社时，写作大写“ANTARA”更常见；引用新闻时可写“ANTARA News”或直接写“ANTARA”。","如果你是在阅读某个国家或地区的文本（如印尼语/马来语或梵语相关内容）遇到“antara”，它也可能是普通词，意思接近英语的“between/among”。"]}
{"word":"antara","summary":{"en":"Antara most commonly means “between/among” in Indonesian and Malay; it can also name the second main section of an Indian classical music composition.","zh":"Antara 最常见是印尼语/马来语的“在……之间/当中”；也可指印度古典音乐作品的第二个主要段落名称。"},"definitions":[{"partOfSpeech":"prep.","definition":{"en":"(Indonesian/Malay) between; among; in the space or period separating two things.","zh":"（印尼语/马来语）在……之间；在……当中；（两者之间的）间隔/期间。"},"examples":[{"en":"The café is antara the station and the river.","zh":"那家咖啡馆在车站和河流之间。"},{"en":"Please choose antara these two options.","zh":"请在这两个选项之间选择。"}]},{"partOfSpeech":"n.","definition":{"en":"(Indian classical music) the second main section of a composition (often following the sthāyī), typically moving to a higher register and developing the melody.","zh":"（印度古典音乐）乐曲的第二个主要段落（常在 sthāyī 之后），通常进入更高音域并发展旋律。"},"examples":[{"en":"After the sthāyī, the singer moved into the antara.","zh":"在唱完 sthāyī 后，歌手进入了 antara 段落。"},{"en":"The antara gives the composition a sense of lift and expansion.","zh":"antara 段落让作品有一种上扬与展开的感觉。"}]}],"synonyms":["between","among"],"phonetic":"/ɑnˈtɑːrə/","extraExplanation":["“antara”最常见于印尼语和马来语，意思相当于英语的 between/among。若你在东南亚旅行或看当地新闻、社交媒体，很容易遇到这个词。","在印度古典音乐语境里，“antara”是术语，常用于描述声乐或器乐作品结构中的段落名称（与 sthāyī 相对）。"]}
{"word":"antarala","summary":{"en":"Antarala is a Sanskrit-derived noun meaning an interval or gap; it can also mean an in-between or intermediate state in a more literary sense.","zh":"Antarala 源自梵语，主要表示“间隔/空隙/停顿”，也可引申为更文学性的“过渡的中间状态”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Sanskrit and some Indian languages) an interval, gap, or pause between things (time, space, events, sounds).","zh":"（梵语及部分印度语言中）间隔、空隙、停顿（指时间、空间、事件或声音之间的距离）。"},"examples":[{"en":"In classical Indian music, the teacher explained the antarala between two notes.","zh":"在印度古典音乐课上，老师讲解了两个音之间的 antarala（音程/间隔）。"},{"en":"We took a short antarala before continuing the ceremony.","zh":"我们在仪式继续之前作了短暂的 antarala（停顿/间歇）。"}]},{"partOfSpeech":"n.","definition":{"en":"A more literary/abstract sense: an inner space, in-between state, or intermediate stage.","zh":"较文学/抽象的用法：内在空间、过渡状态或中间阶段。"},"examples":[{"en":"Meditation can feel like an antarala—a quiet in-between place in the mind.","zh":"冥想有时像一种 antarala——心中安静的“中间地带”。"}]}],"synonyms":["interval","gap","pause","interlude","space"],"phonetic":"/ˌɑn.təˈrɑ.lə/","extraExplanation":["“antarala”常见于梵语语境（如古典音乐理论、哲学/宗教文本），字面有“中间、内里、间隔”的感觉。英语里一般不作为日常词汇使用，多出现在学术、翻译或文化介绍中。","若你是在音乐语境看到它，它有时可对应“interval（音程/间隔）”；在叙事或哲思语境里，可对应“pause / interlude（间歇/插曲）”或“in-between state（过渡状态）”。"]}
{"word":"antaranga","summary":{"en":"Antaranga means “inner/internal” and can also mean “a close confidant,” especially in South Asian religious or literary contexts.","zh":"Antaranga 表示“内在的/内部的”，也可指“亲信、心腹”，常见于南亚宗教或文学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"inner; internal; relating to what is inside (feelings, meaning, spiritual life).","zh":"内在的；内部的；与内心（感受、含义、灵性生活）有关的。"},"examples":[{"en":"In some Hindu writings, antaranga devotion means loving God from the heart, not just through outer rituals.","zh":"在一些印度教著作中，antaranga devotion 指发自内心的奉爱，而不仅是外在仪式。"},{"en":"She spoke about the antaranga meaning of the poem—the emotions beneath the words.","zh":"她谈到这首诗的 antaranga 含义——文字之下的情感。"}]},{"partOfSpeech":"n.","definition":{"en":"a close, intimate person; someone in one’s inner circle (a confidant).","zh":"亲近的人；心腹；自己“核心圈子”里的密友。"},"examples":[{"en":"Only his antaranga were told about the plan.","zh":"只有他的心腹（antaranga）才被告知这个计划。"},{"en":"Over time, the student became an antaranga of the teacher, trusted with important tasks.","zh":"随着时间推移，这位学生成了老师的亲信（antaranga），被托付重要任务。"}]}],"synonyms":["inner","internal","inmost","intimate","confidant","inner circle"],"phonetic":"/ˌʌn.təˈrʌŋ.ɡə/","extraExplanation":["这是一个源自梵语的词，常见构词可理解为 antar-（在内、内部）+ aṅga（部分、肢体），合起来有“内在部分、内部圈层”的感觉。","在某些宗教/哲学语境（如奉爱传统）里，它常用来对比 bahiranga（外在的）：antaranga 更强调内心动机、内在体验与亲密关系。"]}
{"word":"antarchism","summary":{"en":"Anarchism is a political belief rejecting centralized government, and it can also mean extreme disorder in casual use.","zh":"Anarchism 指反对集中化政府权威的政治思想；在口语中也可指极度混乱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a political belief or movement that rejects government and other forms of centralized authority, often arguing that society should be organized through voluntary cooperation","zh":"无政府主义：一种政治思想或运动，反对政府及其他集中化权威，主张社会应通过自愿合作来组织"},"examples":[{"en":"Some anarchists believe communities can govern themselves through mutual aid instead of a state.","zh":"一些无政府主义者认为，社区可以通过互助而不是国家来实现自我治理。"},{"en":"The novel explores anarchism as an alternative to authoritarian rule.","zh":"这部小说探讨了无政府主义，作为对抗专制统治的一种选择。"}]},{"partOfSpeech":"n.","definition":{"en":"a situation of extreme lack of order or control (common in everyday speech, sometimes used loosely)","zh":"（口语中常用，常较宽泛）混乱、无秩序的状态"},"examples":[{"en":"After the power outage, it felt like anarchism in the streets.","zh":"停电之后，街上感觉一片混乱。"},{"en":"The teacher warned that without rules, the classroom would turn into anarchism.","zh":"老师警告说，没有规则教室就会变得一团乱。"}]}],"synonyms":["libertarianism (in some contexts)","anti-authoritarianism","anarchy (casual use: disorder)"],"phonetic":"/ˈænərˌkɪzəm/","extraExplanation":["你输入的“antarchism”很可能是拼写错误；常见的正确拼写是“anarchism”。","在新闻与日常对话中，anarchism 有时被误用为“混乱”，但在政治思想语境里，它更具体地指一种反对国家权力、强调自愿协作的理论与实践。","相关词：anarchist（无政府主义者）；anarchy（既可指“无政府状态/混乱”，也可在理论语境中指“没有国家权威的社会状态”。）"]}
{"word":"antarchist","summary":{"en":"An anarchist is a person who supports anarchism, the belief that society should be organized without government or forced authority; it can also describe things related to anarchism.","zh":"anarchist 指“无政府主义者”，也可作形容词表示“无政府主义的/支持无政府主义的”，强调反对强制权威、主张自愿合作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who believes that government and all forms of forced authority should be abolished, and that society should be organized through voluntary cooperation","zh":"无政府主义者；主张废除政府与强制权威、以自愿合作来组织社会的人"},"examples":[{"en":"Some anarchists argue that communities can manage themselves through cooperation instead of a state.","zh":"一些无政府主义者认为，社区可以通过合作而不是国家来实现自我治理。"},{"en":"In history class, we discussed anarchists in late 19th-century Europe.","zh":"在历史课上，我们讨论了19世纪末欧洲的无政府主义者。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or supporting anarchism","zh":"无政府主义的；支持无政府主义的"},"examples":[{"en":"She reads anarchist essays about mutual aid and community organizing.","zh":"她阅读关于互助与社区组织的无政府主义文章。"},{"en":"The group published an anarchist newspaper.","zh":"该团体出版了一份无政府主义报纸。"}]}],"synonyms":["libertarian (sometimes, depending on context)","anti-authoritarian","radical (general, not exact)"],"phonetic":"/ˈænərkɪst/","extraExplanation":["你输入的 **antarchist** 很可能是拼写错误；常见正确拼写是 **anarchist**。","**anarchist** 不等于“喜欢混乱的人”。在政治语境里，它更常指一种反对强制统治的思想与运动；当然也有人会在日常口语中把它误用为“制造混乱的人”，需要结合上下文判断。","词源上，**anarchy** 来自希腊语，原意是“没有统治者/没有权力中心”。在文学与历史写作中，它常与劳工运动、互助（mutual aid）等主题一起出现。"]}
{"word":"antarchistic","summary":{"en":"“Anarchistic” means related to anarchism or opposing government authority, sometimes suggesting disorder.","zh":"“anarchistic”指与无政府主义相关或反对政府权威，有时带“混乱无序”的含义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Usually spelled “anarchistic”) relating to anarchism or to people who support anarchism; opposing government authority, especially in a way that seems disorderly or rebellious.","zh":"（通常拼作“anarchistic”）与无政府主义或支持无政府主义的人有关；反对政府权威（常带有“无秩序、叛逆”的含义）。"},"examples":[{"en":"Some critics called the protest anarchistic, but the organizers said it was peaceful and carefully planned.","zh":"一些批评者称这场抗议“无政府式的”，但组织者表示它是和平且精心策划的。"},{"en":"The novel portrays an anarchistic group that rejects all formal rules.","zh":"这部小说描写了一个拒绝一切正式规则的无政府主义团体。"}]}],"synonyms":["anarchic","anti-authoritarian","rebellious","lawless"],"phonetic":"/ˌæn.ɚˈkɪs.tɪk/","extraExplanation":["“antarchistic”很可能是拼写错误；标准拼写是 **anarchistic**（来自 *anarchy* “无政府状态/混乱”）。","在日常语境里，**anarchistic** 有时不严格指政治理论，而是泛指“像无政府状态一样混乱、无法无天”的感觉；正式讨论政治思想时更偏向“无政府主义的”。","相关词：**anarchist**（无政府主义者，n.），**anarchism**（无政府主义，n.），**anarchy**（无政府状态/混乱，n.）。"]}
{"word":"antarchistical","summary":{"en":"Anarchistical means “related to anarchy/anarchism,” and can also mean “disorderly or lawless.”","zh":"anarchistical 表示“与无政府状态/无政府主义有关”，也可指“混乱、无法无天的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to anarchy or anarchism; opposing centralized government or formal authority (often used to describe ideas, movements, or behavior).","zh":"无政府状态的；无政府主义的；反对集中政府或正式权威的（常用来形容思想、运动或行为）。"},"examples":[{"en":"Some critics called the protest movement anarchistical, but many participants had clear goals and organization.","zh":"一些批评者称这场抗议运动是“无政府主义的”，但许多参与者其实有明确目标和组织。"},{"en":"His anarchistical opinions made him distrust any institution with too much power.","zh":"他的无政府主义观点让他不信任任何权力过大的机构。"}]},{"partOfSpeech":"adj.","definition":{"en":"(More general/critical use) Wild, lawless, or lacking order and control.","zh":"（更一般或带批评色彩）混乱的；无法无天的；缺乏秩序与控制的。"},"examples":[{"en":"The meeting became anarchistical when everyone talked at once.","zh":"当所有人同时发言时，会议变得一片混乱。"},{"en":"Without clear rules, the discussion can turn anarchistical very quickly.","zh":"没有明确规则，讨论很快就会失控变得混乱。"}]}],"synonyms":["anarchic","anarchistic","lawless","disorderly","chaotic"],"phonetic":"/ˌænɑrˈkɪstɪkəl/","extraExplanation":["“antarchistical”很可能是拼写错误；标准拼写通常是 **anarchistical** 或更常见的 **anarchistic / anarchist**。","**anarchistical**偏少见，写作中更自然的选择通常是 **anarchic**（更偏“混乱、无政府状态的”语气）或 **anarchistic**（更偏“无政府主义思想/立场”）。","在英语里把人或事件说成“anarchic/anarchistical”有时带负面评价（暗示失控、混乱），描述政治理念时建议搭配更中性的语境说明。"]}
{"word":"antarchy","summary":{"en":"Anarchy means a state of no effective government (often chaos), and it can also refer to the political idea of having no government.","zh":"Anarchy 指缺乏有效政府管理的状态（常伴随混乱），也可指“无政府主义”这一政治思想。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A situation in a country or group where there is no government or no effective control, leading to disorder and confusion.","zh":"（国家或团体中）没有政府或缺乏有效管理的状态，常导致混乱与无序。"},"examples":[{"en":"After the war, the country fell into anarchy.","zh":"战争结束后，这个国家陷入了无政府状态。"},{"en":"Without rules, the classroom quickly turned into anarchy.","zh":"没有规则，教室很快变得一团混乱。"}]},{"partOfSpeech":"n.","definition":{"en":"The political belief (anarchism) that society should have no government, and that people can organize themselves freely.","zh":"无政府主义（政治思想）：主张社会不需要政府，人们可以自我组织。"},"examples":[{"en":"She studied anarchy and other radical political ideas in college.","zh":"她在大学里研究无政府主义等激进政治思想。"},{"en":"He wrote essays defending anarchy as a form of freedom.","zh":"他写文章为无政府主义辩护，认为它是一种自由形式。"}]}],"synonyms":["chaos","disorder","lawlessness","turmoil"],"phonetic":"/ˈænərki/","extraExplanation":["你输入的“antarchy”通常是拼写错误，常见正确拼法是“anarchy”。","“anarchy”在日常英语里更常被用来表示“混乱、失控”，不一定是在支持“无政府主义”这种政治立场；语境很重要。"]}
{"word":"Antarctalia","summary":{"en":"“Antarctalia” is not standard English; it is most likely a misspelling of “Antarctica” (the continent at the South Pole).","zh":"“Antarctalia”不是标准英语用词；它很可能是“Antarctica（南极洲）”的误拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or mistaken spelling of “Antarctica,” the continent around the South Pole.","zh":"“Antarctica（南极洲）”的非标准或误拼写形式，指围绕南极点的大陆。"},"examples":[{"en":"I think you mean Antarctica, not “Antarctalia.”","zh":"我想你是想说 Antarctica（南极洲），不是“Antarctalia”。"},{"en":"Antarctica is the coldest continent on Earth.","zh":"南极洲是地球上最寒冷的大陆。"}]}],"synonyms":["Antarctica"],"phonetic":"/ænˈtɑrktɪkə/","extraExplanation":["“Antarctalia”并不是英语里常见或标准的地名拼写。更常用、正确的形式是 **Antarctica**（南极洲）。如果你是在小说、游戏、品牌或用户名里看到“Antarctalia”，它也可能是作者刻意创造的名称；如果你愿意，告诉我出现的语境（句子/截图/出处），我可以帮你判断它是否是专有名词或有特定设定。"]}
{"word":"antarctalia","summary":{"en":"“Antarctalia” is not a standard English word; it likely refers to “Antarctica” or “Antarctic.”","zh":"“Antarctalia”不是标准英语词；多半是指“Antarctica（南极洲）”或“Antarctic（南极的）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard word; it is most likely a misspelling of “Antarctica” (the continent around the South Pole) or a mistaken form of “Antarctic” (relating to Antarctica).","zh":"不是标准英语单词；很可能是把“Antarctica”（南极洲）拼错了，或误写成与“Antarctic”（南极的、与南极洲有关的）相关的形式。"},"examples":[{"en":"I think you meant “Antarctica,” the icy continent at the South Pole.","zh":"我猜你想写的是“Antarctica”，也就是南极点附近的冰雪大陆（南极洲）。"},{"en":"Scientists study climate change in Antarctica and the surrounding Antarctic Ocean.","zh":"科学家在南极洲以及周围的南大洋研究气候变化。"}]}],"synonyms":["Antarctica","Antarctic"],"phonetic":"/ˌæn.tɑrkˈteɪ.li.ə/","extraExplanation":["“Antarctica”是地名；“Antarctic”是形容词（也可作名词，指与南极有关的人或事物）。如果你是在看小说、游戏或品牌名，“Antarctalia”也可能是作者/商家自造词或虚构地名。","常见正确拼写：Antarctica（南极洲）；Antarctic（南极的）。如果你告诉我你看到“antarctalia”的句子或来源（书名/网页/游戏），我可以更准确判断它指什么。"]}
{"word":"Antarctalian","summary":{"en":"A rare word meaning “Antarctic,” or (in stories) a person from Antarctica.","zh":"一个很少见的词，意为“南极的”，或（多用于小说/科幻中）“南极人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Relating to Antarctica; Antarctic.","zh":"（罕见）与南极洲有关的；南极的。"},"examples":[{"en":"The novel imagines an Antarctalian research outpost surviving a long winter.","zh":"这部小说想象了一个“Antarctalian”（南极的）科考前哨在漫长冬季中生存。"},{"en":"They described the Antarctalian winds as brutal and unrelenting.","zh":"他们形容南极的风残酷而不停歇。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) A person (or imagined inhabitant) from Antarctica.","zh":"（罕见）南极人；来自南极洲的人（也常指文学/科幻中虚构的南极居民）。"},"examples":[{"en":"In the story, an Antarctalian teaches the crew how to travel safely on the ice.","zh":"在故事里，一位“Antarctalian”（南极人）教船员如何在冰上安全行走。"},{"en":"Few Antarctalians live there year-round—most are visiting scientists.","zh":"几乎没有人全年居住在南极——大多数是短期驻留的科学家。"}]}],"synonyms":["Antarctic","Antarctican"],"phonetic":"/ˌæntɑrkˈteɪliən/","extraExplanation":["“Antarctalian”在现实英语中非常少见，更多出现在科幻、奇幻或幽默语境里，用来创造“南极居民/南极国度”的感觉。日常表达中更常用：\n- “Antarctic” 作形容词：Antarctic ice, Antarctic research\n- “Antarctican” 作名词/形容词（也较少见）：an Antarctican station\n另外，南极没有原住民与公民身份，因此把某人称作“Antarctalian”通常带有文学化或戏谑色彩。"]}
{"word":"antarctalian","summary":{"en":"Antarctalian is a rare word meaning “a person from Antarctica” or “relating to Antarctica,” often used in fiction or playful contexts.","zh":"Antarctalian 是个较罕用的词，表示“南极洲人”或“与南极有关”，多见于虚构或较轻松的语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) A person from Antarctica; an inhabitant or (more often) an imagined resident of Antarctica.","zh":"（罕用）南极洲人；南极的居民（更多时候指想象中的“南极居民”）。"},"examples":[{"en":"In the story, the hero meets an Antarctalian who lives in an underground base.","zh":"在这个故事里，主角遇到了一位住在地下基地的“南极洲人”。"},{"en":"The comic calls its penguin characters “Antarctalians,” even though penguins aren’t people.","zh":"这部漫画把企鹅角色称为“Antarctalians（南极居民）”，尽管企鹅并不是人类。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to Antarctica (especially used playfully or in fiction).","zh":"（尤用于轻松或虚构语境）与南极洲有关的；南极的。"},"examples":[{"en":"They designed an Antarctalian research station for the sci‑fi game.","zh":"他们为这款科幻游戏设计了一座“南极风格”的研究站。"},{"en":"The film uses Antarctalian landscapes to create a feeling of isolation.","zh":"电影用“南极般”的景色来营造孤独感。"}]}],"synonyms":["Antarctican","Antarctic","Antarctic resident"],"phonetic":"/ænˌtɑrktæliən/","extraExplanation":["“Antarctalian”在真实新闻或学术写作中很少见；更常见的说法是“Antarctic”（作形容词）或“Antarctican/Antarctic resident”（指人）。","因为南极没有原生常住人口，“Antarctalian”作名词时往往出现在小说、游戏、漫画等虚构或幽默语境里，用来塑造“来自南极的人物/族群”。","词形上常见后缀“-ian/-an”用于表示“某地的人/与某地有关”（如 Canadian, Brazilian）。"]}
{"word":"Antarctic","summary":{"en":"Antarctic means “related to the South Pole/Antarctica,” and it can also refer to the Antarctic region itself.","zh":"Antarctic 指“与南极/南极洲有关的”，也可作名词表示“南极地区”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the South Pole or the region around it, especially the continent of Antarctica","zh":"（与）南极或其周边地区有关的，尤指南极洲的"},"examples":[{"en":"Antarctic winds can be extremely strong and cold.","zh":"南极的风可能非常强劲而寒冷。"},{"en":"Scientists study Antarctic ice to learn about Earth’s past climate.","zh":"科学家研究南极冰层来了解地球过去的气候。"}]},{"partOfSpeech":"n.","definition":{"en":"the Antarctic region; the area around the South Pole","zh":"南极地区；南极点周边区域"},"examples":[{"en":"Few people have traveled deep into the Antarctic.","zh":"很少有人深入到南极地区。"}]}],"synonyms":["polar","southern polar"],"phonetic":"/ænˈtɑrktɪk/","extraExplanation":["“Antarctic”来自希腊语词根：anti-（“相对、对面”）+ arktikos（“北方的、北极的”）。因此它字面意思是“与北极相对的”。","常见搭配：Antarctic Circle（南极圈）、Antarctic Peninsula（南极半岛）、Antarctic Treaty（《南极条约》）、Antarctic expedition（南极探险）。","常见易混：Antarctica（n. 南极洲，指具体大陆） vs. Antarctic（adj. 南极的/ n. 南极地区）。例如：Antarctica is a continent. / Antarctic research is important."]}
{"word":"antarctic","summary":{"en":"Antarctic usually means “related to Antarctica/the South Pole region,” and can also mean the South Pole region itself.","zh":"Antarctic 通常表示“与南极洲/南极地区有关的”，也可作名词表示“南极地区”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Antarctica (the continent around the South Pole) or the region near the South Pole; extremely cold","zh":"与南极洲（南极点附近的大陆）或南极地区有关的；（也可泛指）极寒的"},"examples":[{"en":"Scientists study Antarctic ice to learn about Earth’s past climate.","zh":"科学家研究南极冰层来了解地球过去的气候。"},{"en":"An Antarctic expedition requires special clothing and careful planning.","zh":"一次南极探险需要特殊装备和周密计划。"}]},{"partOfSpeech":"n.","definition":{"en":"the region around the South Pole; Antarctica and nearby seas","zh":"南极地区；指南极洲及其周边海域"},"examples":[{"en":"Few people have traveled deep into the Antarctic.","zh":"很少有人深入到南极腹地。"}]}],"synonyms":["southern polar","polar","Antarctica-related"],"phonetic":"/ænˈtɑrktɪk/","extraExplanation":["“Antarctic” 来自希腊语：anti-（相对、对立）+ arktikos（北方的、北极的），字面意思是“与北极相对的”。","在地理与科学写作中，通常会把 “Antarctic” 用于“南极地区”（包括海洋、岛屿与冰盖），而 “Antarctica” 特指“南极洲”这块大陆本身。"]}
{"word":"Antarctic Circumpolar Current","summary":{"en":"a strong eastward ocean current that circles Antarctica","zh":"环绕南极洲自西向东流动的强大洋流"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A powerful ocean current that flows eastward around Antarctica, linking the Atlantic, Pacific, and Indian Oceans and helping drive global ocean circulation.","zh":"环绕南极洲自西向东流动的强大洋流，连接大西洋、太平洋和印度洋，并推动全球海洋环流。"},"examples":[{"en":"The Antarctic Circumpolar Current is the strongest current on Earth by volume transport.","zh":"按输送的水量计算，南极绕极流是地球上最强的洋流。"},{"en":"Scientists study the Antarctic Circumpolar Current to understand how the ocean stores heat and carbon.","zh":"科学家研究南极绕极流，以了解海洋如何储存热量和碳。"},{"en":"Changes in winds can speed up or slow down the Antarctic Circumpolar Current.","zh":"风场变化会使南极绕极流加速或减速。"}]}],"synonyms":["ACC","Antarctic Current","circumpolar current"],"phonetic":"/ænˈtɑrktɪk sɝˈkʌmpələr ˈkɝənt/","extraExplanation":["常见缩写是 ACC（Antarctic Circumpolar Current）。","它几乎不被大陆阻挡，能把不同大洋连成一体，对全球气候（热量输送、碳循环）、海冰范围以及海洋生态系统都有重要影响。","在地理与气候学语境中常见搭配：ACC front(s)（绕极流锋面）、ACC transport（输运量）、westerly winds（西风带）等。"],"etymology":"“Antarctic”来自希腊语 anti-（相对、对立）+ arktikos（北方的、北极的），字面是“北极的对面”，即南极。“circumpolar”由 circum-（环绕）+ polar（极地的）组成，表示“绕极”。“current”指“水流/洋流”。合起来就是“南极绕极洋流”。","mnemonic":["把词拆开记：circum（环绕）+ polar（极地）= 绕极；current= 洋流，所以整体就是“南极绕极洋流”。","想象“南极外圈有一条不停绕圈跑的‘电流/水流’”：current=流动，circum=绕圈。"]}
{"word":"Antarctic Ocean","summary":{"en":"The ocean around Antarctica; often called the Southern Ocean.","zh":"环绕南极洲的海洋；常称南大洋。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"The ocean surrounding Antarctica; commonly called the Southern Ocean.","zh":"环绕南极洲的海洋；常称为“南大洋”。"},"examples":[{"en":"Scientists study currents in the Antarctic Ocean to understand global climate.","zh":"科学家研究南极洋的洋流，以了解全球气候。"},{"en":"Many penguins and seals live around the Antarctic Ocean.","zh":"许多企鹅和海豹生活在南极洋周边。"}]}],"synonyms":["Southern Ocean"],"phonetic":"/ænˈtɑrktɪk ˈoʊʃən/","extraExplanation":["在很多教材、地图与新闻里，正式名称更常见的是 “Southern Ocean”。“Antarctic Ocean”也会被使用，但有时被视为较少见或较旧的说法。","南大洋的范围在不同机构/地图上可能略有差异；有些以南纬60度附近作为大致界线。"],"etymology":"“Antarctic”来自希腊语 antarktikos，意为“与北极相对、在南方的”；“ocean”来自希腊语 okeanos，后来经拉丁语与法语进入英语。现代地理上，这片海域更常被称为 Southern Ocean（南大洋）。","mnemonic":["记忆法：Arctic=北极；加前缀 ant- 表“相反/对立”，Antarctic=与北极相对→南极。","联想：看到 “anti-” 就想到“反着来”，所以不是北极那边，就是南极这边。"]}
{"word":"Antarctic-surrounding","summary":{"en":"“Antarctic-surrounding” means “around/surrounding Antarctica,” usually describing nearby waters, seas, or regions.","zh":"“Antarctic-surrounding”指“在南极周围/环绕南极的”，多用于描述周边海域、海洋或地区。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Located around Antarctica; surrounding the Antarctic continent (often used to describe the Southern Ocean, seas, islands, or waters near Antarctica).","zh":"位于南极洲周围的；环绕南极的（常用来描述南大洋、海域、岛屿或靠近南极的水域）。"},"examples":[{"en":"Scientists monitor Antarctic-surrounding waters to track changes in sea ice.","zh":"科学家监测南极周边海域，以追踪海冰的变化。"},{"en":"Many Antarctic-surrounding islands are important breeding sites for seabirds.","zh":"许多南极周边岛屿是海鸟重要的繁殖地。"},{"en":"The expedition focused on Antarctic-surrounding ecosystems rather than the continent itself.","zh":"这次考察重点研究南极周边生态系统，而不是南极大陆本身。"}]}],"synonyms":["surrounding Antarctica","around Antarctica","circum-Antarctic","Antarctic-adjacent"],"phonetic":"/ænˈtɑːrktɪk səˈraʊndɪŋ/","extraExplanation":["“Antarctic-surrounding”不是最常见的固定词条，更自然的表达通常是：**surrounding Antarctica**（环绕南极）、**around Antarctica**（在南极周围）、或 **the waters/seas around Antarctica**（南极周边海域）。","这个复合形容词用连字符（hyphen）主要是为了让修饰关系更清楚：它整体一起修饰后面的名词（如 *Antarctic-surrounding waters*）。在正式写作里，也可以改写为更常见的结构以提高可读性。","相关常见词：**circum-Antarctic**（环南极的，较学术/地理用法）、**subantarctic**（亚南极的，指更靠北、但仍接近南极的地区）。"]}
{"word":"Antarctica","summary":{"en":"Antarctica is Earth’s southernmost continent, covered in ice and home mainly to scientific research stations.","zh":"南极洲是地球最南端的大陆，冰雪覆盖，主要有科研站而无永久居民。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the southernmost continent of Earth, centered on the South Pole, almost completely covered by ice and with no permanent residents","zh":"南极洲：地球最南端的大陆，以南极点为中心，几乎完全被冰雪覆盖，没有永久居民"},"examples":[{"en":"Antarctica is the coldest continent on Earth.","zh":"南极洲是地球上最寒冷的大陆。"},{"en":"Scientists travel to Antarctica to study climate and wildlife.","zh":"科学家前往南极洲研究气候与野生动物。"},{"en":"Few people visit Antarctica, and most trips are for research or carefully managed tourism.","zh":"去南极洲的人很少，大多数行程是科研或受严格管理的旅游。"}]}],"synonyms":["the Antarctic (region)"],"phonetic":"/ænˈtɑrktɪkə/","extraExplanation":["“Antarctica”来自希腊语 *antarktikos*，意思是“与北极相对的（南方的）”。英语里常与“the”连用：*the Antarctic*（南极地区）或 *Antarctica*（南极洲，大陆本身）。","常见搭配：*Antarctic ice*, *Antarctic research station*, *Antarctic Treaty*（《南极条约》：规定南极用于和平与科学研究，禁止军事活动和核试验等）。","区分：*Antarctica*（南极洲，名词） vs. *Antarctic*（南极的，形容词；也可作名词指“南极地区”）。"]}
{"word":"antarctica","summary":{"en":"Antarctica is Earth’s southernmost continent, mostly covered in ice.","zh":"Antarctica 指地球最南端的大陆——南极洲，绝大部分被冰雪覆盖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The southernmost continent of Earth, centered on the South Pole, mostly covered by thick ice and surrounded by the Southern Ocean.","zh":"南极洲：地球最南端、以南极点为中心的一块大陆，绝大部分被厚厚的冰层覆盖，周围为南大洋。"},"examples":[{"en":"Antarctica is the coldest continent on Earth.","zh":"南极洲是地球上最寒冷的大陆。"},{"en":"Researchers travel to Antarctica to study climate change and wildlife like penguins.","zh":"研究人员前往南极洲研究气候变化以及企鹅等野生动物。"},{"en":"Few people live in Antarctica year-round, but many scientists stay at research stations.","zh":"几乎没有人全年居住在南极洲，但许多科学家会在科考站驻留。"}]}],"synonyms":["the Antarctic (region)"],"phonetic":"/ænˈtɑrktɪkə/","extraExplanation":["“Antarctica”来自希腊语：anti-（相对、对面）+ arktikos（北方的、北极的），字面意思是“与北极相对的地方”，即“南极”。","常见区别：Antarctica（南极洲，大陆） vs. the Arctic（北极地区，主要是海洋与周边陆地）。","文学与文化中，南极常被用来象征“极端、纯净、未知”。例如雪莱（Shelley）诗歌中常出现冰雪意象，虽不一定直接写到南极，但英语读者容易把这种“冰原”意象与南极联系起来。"]}
{"word":"Antarctica-related","summary":{"en":"“Antarctica-related” means connected with or about Antarctica.","zh":"“Antarctica-related”表示“与南极洲有关/相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with or about Antarctica (the southern polar continent) or things found there","zh":"与南极洲（南极大陆）或那里的事物有关的；南极洲相关的"},"examples":[{"en":"Scientists are studying Antarctica-related climate changes.","zh":"科学家正在研究与南极洲相关的气候变化。"},{"en":"The museum has an Antarctica-related exhibit with penguins and ice-core samples.","zh":"博物馆有一个南极洲相关的展览，包含企鹅和冰芯样本。"},{"en":"We read an Antarctica-related article for class.","zh":"我们为了上课读了一篇南极相关的文章。"}]}],"synonyms":["Antarctic","Antarctica-associated","connected to Antarctica","related to Antarctica"],"phonetic":"/ænˈtɑrktɪkə rɪˈleɪtɪd/","extraExplanation":["“Antarctica-related”是由“Antarctica + related”构成的复合形容词，常见于新闻、学术或报告写作中。作定语放在名词前时通常加连字符：an Antarctica-related project。放在系动词后作表语时常不加连字符也可以：The project is Antarctica related（更常见写法：Antarctica-related）。","更自然、更常用的替代表达包括：Antarctic（南极的；南极地区的）、related to Antarctica（与南极有关的）、about Antarctica（关于南极）。其中“Antarctic”更简洁，但语气更“固定/正式”，而“Antarctica-related”强调“与……相关”这一关系。"]}
{"word":"antarctical","summary":{"en":"“antarctical” is a nonstandard form; the standard word is “Antarctic,” meaning “related to Antarctica/the South Pole region,” or “the Antarctic” as a place.","zh":"“antarctical”属于非标准形式；标准用法是“Antarctic”，表示“南极的/与南极地区有关”，也可用“the Antarctic”指“南极地区”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard) Intended meaning: “Antarctic”—relating to Antarctica or the region around the South Pole.","zh":"（非标准用法）通常想表达的是“Antarctic（南极的）”—与南极洲或南极地区有关。"},"examples":[{"en":"Scientists study Antarctic ice to understand climate change.","zh":"科学家研究南极的冰层来了解气候变化。"},{"en":"An Antarctic expedition can be dangerous because of extreme cold and storms.","zh":"南极探险可能很危险，因为天气极寒且风暴频繁。"}]},{"partOfSpeech":"n.","definition":{"en":"(Nonstandard) Intended meaning: “the Antarctic”—the region around the South Pole, including Antarctica and nearby seas.","zh":"（非标准用法）通常想表达的是“the Antarctic（南极地区）”—指南极点周围的区域，包括南极洲及其附近海域。"},"examples":[{"en":"Few people live in the Antarctic year-round.","zh":"很少有人全年居住在南极地区。"},{"en":"Many penguins are native to the Antarctic.","zh":"许多企鹅原产于南极地区。"}]}],"synonyms":["Antarctic (standard)","southern polar (less common)"],"phonetic":"/ænˈtɑrktɪk/","extraExplanation":["“antarctical”在现代英语里很少见，通常被视为拼写或用词不自然。更常用、标准的形式是：\n- Antarctic（形容词/名词）：Antarctic animals（南极动物），the Antarctic（南极地区）\n- Antarctica（名词）：指“南极洲”这块大陆本身\n另外注意拼写：Antarctic 中间有 “ct”（…arct…），很多学习者容易漏掉或写成 “antarctical”。"]}
{"word":"antarctically","summary":{"en":"An adverb meaning “in or related to Antarctica.”","zh":"表示“在南极（地区）或与南极有关”的副词。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to Antarctica; in the Antarctic region or conditions.","zh":"以与南极有关的方式；在南极地区或在南极的环境/条件下。"},"examples":[{"en":"The research team worked antarctically, dealing with extreme cold and long periods of darkness.","zh":"研究团队以“南极式”的方式工作，要应对极端寒冷和漫长的黑暗。"},{"en":"Some seabirds travel antarctically during the southern summer to feed.","zh":"有些海鸟在南半球夏季会前往南极附近觅食。"}]}],"synonyms":["in Antarctica","in the Antarctic","Antarcticly (rare)"],"phonetic":"/ænˈtɑrktɪkli/","extraExplanation":["“antarctically”较少单独使用，更常见的是用“in Antarctica / in the Antarctic”来表达地点，或用“Antarctic”作形容词（如：Antarctic waters 南极海域）。","构词上它是“Antarctic + -ally（副词后缀）”，表示“以……的方式/在……方面”。在学术写作中偶尔出现，用来概括“与南极相关的（现象/行为）”。"]}
{"word":"Antarctican","summary":{"en":"Antarctican means a person associated with Antarctica, or something related to Antarctica.","zh":"Antarctican 指与南极有关的人（多为在南极工作/停留者），或指与南极相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who lives in or is associated with Antarctica (especially someone working there, such as a scientist or support staff).","zh":"南极人；与南极有关的人（多指在南极工作或长期停留的人，如科研人员或后勤人员）。"},"examples":[{"en":"Most Antarcticans are scientists, engineers, or support workers stationed at research bases.","zh":"大多数“南极人”是驻扎在科研基地的科学家、工程师或后勤人员。"},{"en":"She spent two winters on the ice, so her friends jokingly called her an Antarctican.","zh":"她在冰原上度过了两个冬季，所以朋友们开玩笑叫她“南极人”。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Antarctica or to people working/living there.","zh":"南极的；与南极或在南极工作/生活的人有关的。"},"examples":[{"en":"The museum has an Antarctican exhibit about life at polar research stations.","zh":"这家博物馆有一个关于极地科考站生活的南极主题展览。"},{"en":"They shared Antarctican stories about blizzards and months of darkness.","zh":"他们分享了关于暴风雪和数月极夜的南极经历。"}]}],"synonyms":["Antarctic (adj.)","Antarctic researcher","polar researcher","Antarctic resident"],"phonetic":"ænˈtɑrktɪkən","extraExplanation":["“Antarctican”在英语里并不常见，因为南极没有原住民或固定国籍人口，也不属于任何单一国家。这个词多用于口语、媒体或写作中，指在南极基地工作或长期停留的人。更常见的表达是“someone in Antarctica / Antarctic researcher / Antarctic resident（南极科考人员/居住者）”。"]}
{"word":"Antarcticly","summary":{"en":"“Antarcticly” means “in a way related to Antarctica” or “in an Antarctic-like manner,” often emphasizing extreme cold or icy conditions.","zh":"“Antarcticly”表示“以与南极有关的方式”或“以南极般的方式”，常用来强调极端寒冷、冰雪环境等特征。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to Antarctica (the Antarctic region), or in a manner typical of Antarctica.","zh":"以与南极（南极地区）有关的方式；或以典型的南极式方式。"},"examples":[{"en":"The research team worked Antarcticly harsh hours in subzero temperatures.","zh":"研究团队在零下温度中以“南极般”的严酷节奏工作了很长时间。"},{"en":"Antarcticly cold winds swept across the ice field.","zh":"南极般寒冷的风席卷了冰原。"},{"en":"The penguins are adapted to live Antarcticly—on ice, in extreme cold, and with strong winds.","zh":"企鹅适应了“南极式”的生活——在冰上、极端寒冷中以及强风环境里生存。"}]}],"synonyms":["in Antarctica","in the Antarctic","in an Antarctic way","Antarctic-like (as an adverbial phrase)"],"phonetic":"/ænˈtɑrktɪkli/","extraExplanation":["“Antarcticly”由“Antarctic（南极的）+ -ly（……地）”构成，但在真实语料中相对少见。更常见、更自然的表达通常是：“in Antarctica / in the Antarctic”或“in an Antarctic way / in an Antarctic climate”。","在学术或科普写作里，有时会用它来强调“带有南极特征的程度”（如极端寒冷、荒凉、冰雪覆盖等），但日常英语中用得不多。"]}
{"word":"Antarctogaea","summary":{"en":"Antarctogaea is a mostly historical biogeography term for the southern (Antarctic-linked) realm of life and land connections.","zh":"Antarctogaea 是生物地理学中的旧称，指与古代南方大陆联系相关的“南极系/南方生物地理界”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historical term in biogeography for the southern “Antarctic” realm/kingdom, referring to lands and ecosystems linked by ancient southern-continent connections (often discussed with Gondwana and southern hemisphere flora and fauna)","zh":"生物地理学中的旧称，指“南极系/南方生物地理界（或生物地理王国）”，用于谈论与古代南方大陆联系相关的陆地与生态系统（常与冈瓦纳古陆及南半球动植物分布一起讨论）"},"examples":[{"en":"Some older biogeography texts use Antarctogaea to group southern hemisphere regions with related plant and animal lineages.","zh":"一些较早的生物地理学文献用 Antarctogaea 来归纳南半球中动植物谱系相关的地区。"},{"en":"In this framework, parts of South America, New Zealand, and subantarctic islands may be discussed as elements of Antarctogaea.","zh":"在这种框架下，南美部分地区、新西兰以及亚南极岛屿可能被作为 Antarctogaea 的组成要素来讨论。"}]}],"synonyms":["Antarctic realm","southern biogeographic realm","Gondwanan realm (related concept)"],"phonetic":"/ænˌtɑrktəˈɡiːə/","extraExplanation":["该词多见于较旧或偏历史脉络的生物地理分区讨论中，不是现代最常用的标准分区名称；现代文献更常见的相关概念包括“Gondwana（冈瓦纳古陆）”、“Antarctic realm/region（南极生物地理界/区）”等。","词形上可理解为“Antarcto-（与南极相关）+ -gaea（大地/陆地）”。在讨论古大陆漂移、隔离与物种谱系分化时可能出现。"]}
{"word":"antarctogaea","summary":{"en":"Antarctogaea is an older term for the southern ancient landmass (Gondwana) and its shared biogeographic patterns.","zh":"Antarctogaea 是一个较旧的术语，指远古南方陆块（冈瓦纳古陆）及其共同的生物地理分布特征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historical biogeographic term for the southern landmass and its related fauna/flora, roughly corresponding to the ancient supercontinent Gondwana (including regions such as Antarctica, Australia, South America, Africa, and India in deep geological time).","zh":"一个历史性的生物地理学术语，指“南方陆块”及其相关动植物区系，大致对应远古的冈瓦纳古陆（在深地质时期包括南极洲、澳大利亚、南美洲、非洲和印度等地区）。"},"examples":[{"en":"Some older biogeography texts describe shared species patterns as evidence of an Antarctogaea connection.","zh":"一些较早的生物地理学著作把物种分布的共同模式描述为“南方陆块（Antarctogaea）”联系的证据。"},{"en":"The distribution of certain plant families was once explained using the concept of Antarctogaea.","zh":"某些植物科的分布曾经用“Antarctogaea（南方陆块）”这一概念来解释。"}]}],"synonyms":["Gondwana","Notogaea"],"phonetic":"/ænˌtɑrktəˈdʒiə/","extraExplanation":["这是一个比较“老派/历史性”的术语，多见于早期动物地理学或植物地理学讨论中；现代写作更常用 Gondwana（冈瓦纳古陆）或 “Gondwanan distribution（冈瓦纳式分布）”。","词形可理解为 Antarctica（南极）+ -gaea（源自希腊语 Gaia/gaia，意为“大地/陆地”），强调“南方的陆地整体”。"]}
{"word":"Antarctogaean","summary":{"en":"A rare, formal adjective meaning “Antarctic; related to the southern polar region.”","zh":"一个罕见、较正式的形容词，意为“南极的；与南极地区相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Antarctica (the southern polar region), especially its land, climate, plants, animals, or scientific study.","zh":"与南极（南极地区）有关的，尤指其陆地、气候、动植物或科学研究。"},"examples":[{"en":"Antarctogaean winds can be extremely cold and dry.","zh":"南极地区的风可能极其寒冷而干燥。"},{"en":"The team collected Antarctogaean ice cores to study past climates.","zh":"团队采集了南极冰芯来研究过去的气候。"}]}],"synonyms":["Antarctic","southern polar"],"phonetic":"/ænˌtɑrktəˈdʒiːən/","extraExplanation":["“Antarctogaean”是非常罕见、偏学术/文学的用词。它由“Antarcto-（南极的）”+“-gaean（与大地/地球有关，源自希腊语 gaia）”构成，整体意思接近“南极的、南极地区的”。在现代英语中更常见的表达是“Antarctic”。","写作或科普中如果想显得更古典或更具书面色彩，可能会用“Antarctogaean”；但日常交流与大多数论文中通常用“Antarctic”更自然。"]}
{"word":"antarctogaean","summary":{"en":"Antarctogaean is a rare academic term for the southern (Antarctic-linked) biogeographic region and its organisms.","zh":"Antarctogaean 是较少见的学术用语，指与南极相关的南半球生物地理区及其动植物群。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the southern (Antarctic) biogeographic region, especially the flora and fauna of southern South America, Australia, New Zealand, and nearby islands.","zh":"与南极—南半球生物地理区有关的，尤指南美南部、澳大利亚、新西兰及周边岛屿的动植物群。"},"examples":[{"en":"Many beech species in South America and New Zealand are discussed as part of an Antarctogaean pattern.","zh":"南美和新西兰的许多山毛榉物种常被用来讨论“南极古陆系（Antarctogaean）”的分布格局。"},{"en":"The paper compares Gondwanan history with Antarctogaean biota.","zh":"该论文将冈瓦纳古陆的历史与南极古陆系生物群进行比较。"}]},{"partOfSpeech":"n.","definition":{"en":"a plant or animal associated with the southern (Antarctogaean) biogeographic region.","zh":"指属于（或典型分布于）南极古陆系生物地理区的动植物。"},"examples":[{"en":"Some botanists call these subantarctic shrubs classic Antarctogaeans.","zh":"一些植物学家把这些亚南极灌木称为典型的“南极古陆系物种（Antarctogaeans）”。"}]}],"synonyms":["Gondwanan","subantarctic","southern temperate"],"phonetic":"/ænˌtɑrk.təˈdʒiː.ən/","extraExplanation":["这是一个较少见、偏学术的词，常出现在生物地理学与古生物学语境中，用来强调“南半球共同来源/共同历史”的分布格局。现代文献中更常见的相关词包括 Gondwanan（冈瓦纳的）、southern temperate（南温带的）、Subantarctic（亚南极的）。","构词上可理解为 Antarctic（南极的）+ -o-（连接元音）+ -gaean（类似“地域/世界”的形容词后缀），整体强调“与南极—南半球区域有关”。"]}
{"word":"Antares","summary":{"en":"Antares is the bright red star Alpha Scorpii in the constellation Scorpius, and it’s sometimes used as a name inspired by the star.","zh":"Antares 是天蝎座的亮红星——天蝎座α（Alpha Scorpii），也偶尔被借用作人名或作品名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bright red supergiant star in the constellation Scorpius; the star’s official designation is Alpha Scorpii.","zh":"天蝎座中的一颗明亮红色超巨星；其正式编号为天蝎座α（Alpha Scorpii）。"},"examples":[{"en":"Antares is often called “the heart of the Scorpion” because of its position in Scorpius.","zh":"由于在天蝎座中的位置，Antares 常被称为“蝎心”（天蝎的心脏）。"},{"en":"On a clear summer night, you can spot Antares as a reddish star low in the southern sky.","zh":"在晴朗的夏夜，你可以在南方低空看到 Antares，它呈现偏红的颜色。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name (less common), used for people, characters, ships, or projects, often inspired by the star.","zh":"（较少见）人名/作品名等专有名称，常取自这颗恒星的名字。"},"examples":[{"en":"The sci-fi novel named its spaceship Antares to suggest power and mystery.","zh":"这本科幻小说把飞船命名为 Antares，以营造力量与神秘感。"}]}],"synonyms":["Alpha Scorpii","α Scorpii"],"phonetic":"/ænˈtɛəriz/","extraExplanation":["“Antares”源自希腊语，常被解释为“像阿瑞斯（战神）一样/与火星相对”（anti-Ares），因为它颜色偏红，容易让人联想到火星。","在天文学中，Antares 是一颗著名的红色超巨星，也是夜空中非常显眼的亮星之一；在不同文化的星空故事里，它常与“天蝎”的形象联系在一起。"]}
{"word":"antares","summary":{"en":"Antares is the bright red star Alpha Scorpii in the constellation Scorpius; the name is also used for people, ships, and projects.","zh":"Antares 指天蝎座中明亮的红色恒星——心宿二（天蝎座α星）；该名称也常被用作人名、舰船或项目名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Antares: a very bright red star (a red supergiant) in the constellation Scorpius; it is the star Alpha Scorpii and is sometimes called “the Heart of the Scorpion.”","zh":"心宿二：天蝎座中一颗非常明亮的红色恒星（红超巨星），即天蝎座α星（Alpha Scorpii），也常被称为“天蝎之心”。"},"examples":[{"en":"In the summer sky, Antares looks like a reddish point near the tail of Scorpius.","zh":"在夏季的夜空中，心宿二看起来像天蝎座附近一个偏红的亮点。"},{"en":"The planet was visible close to Antares last night.","zh":"昨晚那颗行星出现在心宿二附近。"}]},{"partOfSpeech":"n.","definition":{"en":"A given name or name used for ships, projects, and fictional characters, taken from the star Antares.","zh":"源自恒星“心宿二”的名字，可用作人名，也常用于舰船、项目或虚构角色的命名。"},"examples":[{"en":"The mission was code-named Antares to suggest brightness and prominence.","zh":"这次任务代号取名为 Antares，寓意“明亮”和“醒目”。"},{"en":"In the novel, Antares is the name of a powerful spacecraft.","zh":"在那部小说里，Antares 是一艘强大宇宙飞船的名字。"}]}],"synonyms":["Alpha Scorpii","Heart of the Scorpion"],"phonetic":"ænˈtɛriz","extraExplanation":["“Antares”来自古希腊语，常被解释为“与阿瑞斯（Ares，战神）相对/相敌”，因为它的红色外观常让人联想到火星（Mars）。因此它也常被称为“火星的对手（rival of Mars）”。","在不同文化中，心宿二常被视为“天蝎之心”，在观星与神话叙事中很常见。学习时可以把它当作专有名词：首字母大写（Antares），常见于天文学、科幻作品和命名场景。"]}
{"word":"antarthritic","summary":{"en":"Antarthritic means used to treat or relieve arthritis.","zh":"antarthritic 指“用于治疗或缓解关节炎的；抗关节炎的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"used to prevent, relieve, or treat arthritis (joint inflammation and pain)","zh":"用于预防、缓解或治疗关节炎（关节发炎与疼痛）的；抗关节炎的"},"examples":[{"en":"The doctor prescribed an antarthritic drug to reduce joint pain and swelling.","zh":"医生开了一种抗关节炎药物来减轻关节疼痛和肿胀。"},{"en":"Gentle exercise is often recommended along with antarthritic medication.","zh":"通常会建议在使用抗关节炎药物的同时进行温和运动。"}]}],"synonyms":["antiarthritic","anti-inflammatory (related)","antirheumatic (related)"],"phonetic":"/ˌæn.tɑrˈθrɪ.tɪk/","extraExplanation":["这是一个较少见、偏医学的形容词：anti-（抗、对抗）+ arthritic（关节炎的）。在日常英语里更常见的表达是“anti-inflammatory”（抗炎的）或直接说“arthritis medication/drug”（关节炎药物）。"]}
{"word":"antartic","summary":{"en":"Antarctic means “of or near the South Pole,” and it can also refer to the Antarctic region itself.","zh":"Antarctic 表示“南极的/靠近南极的”，也可指“南极地区”本身。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the region around the South Pole (Antarctica).","zh":"与南极（南极洲及其周边地区）有关的；南极的。"},"examples":[{"en":"Scientists study Antarctic ice to learn about past climates.","zh":"科学家研究南极冰层来了解过去的气候。"},{"en":"Antarctic winds can be extremely strong and cold.","zh":"南极的风可能非常强劲而且寒冷。"}]},{"partOfSpeech":"n.","definition":{"en":"The Antarctic region (the area around the South Pole).","zh":"南极地区（指南极点周边的区域）。"},"examples":[{"en":"Few people have traveled deep into the Antarctic.","zh":"很少有人深入到南极腹地旅行。"}]}],"synonyms":["southern polar","polar"],"phonetic":"ænˈtɑrktɪk","extraExplanation":["你输入的 **antartic** 常见拼写错误，正确拼写是 **Antarctic**（中间有 **-arct-**）。","**Antarctic** 和 **Arctic** 容易混淆：**Arctic** 是“北极的/北极地区”，**Antarctic** 是“南极的/南极地区”。记忆法：**Antarctic = anti-（相对/相反）+ Arctic**，表示“与北极相对的南极”。"]}
{"word":"antas","summary":{"en":"“antas” is the plural form of “anta,” meaning tapirs (large herbivorous mammals).","zh":"“antas”是“anta”的复数，指貘（tapir）这种大型草食性哺乳动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of anta: a large, plant-eating mammal (a type of tapir) found in Central and South America and Southeast Asia.","zh":"anta 的复数：一种大型草食性哺乳动物（即“貘”的一种/常指貘类），分布于中南美洲与东南亚部分地区。"},"examples":[{"en":"The researchers tracked antas through the rainforest using camera traps.","zh":"研究人员用红外相机在雨林里追踪这些貘。"},{"en":"In some regions, antas are important seed dispersers for many tree species.","zh":"在一些地区，貘对许多树种的种子传播很重要。"}]}],"synonyms":["tapirs"],"phonetic":"/ˈæntə/","extraExplanation":["“anta”在英语里较少见，更常见的说法是“tapir（貘）”。在巴西葡萄牙语中，anta很常指“巴西貘（tapir）”，所以你可能会在南美相关的自然纪录片、文章或地名/文化语境中看到“antas”。","如果你本来想查的是别的词（例如拼写接近的“aunties / antes / ants”等），告诉我你看到它的句子，我可以帮你精确判断。"]}
{"word":"antasphyctic","summary":{"en":"Antiasphyctic (often misspelled as “antasphyctic”) means preventing or treating asphyxia; it can describe a measure or refer to an agent used for that purpose.","zh":"Antiasphyctic（常被误拼为“antasphyctic”）指“防止或治疗窒息/缺氧”的；既可作形容词，也可指用于该目的的药物/物质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Preventing or relieving asphyxia (lack of oxygen); used to describe a drug, treatment, or device intended to restore breathing.","zh":"（罕用）防止或缓解“窒息/缺氧”（asphyxia）的；用于描述旨在恢复呼吸的药物、疗法或装置。"},"examples":[{"en":"In older medical writing, oxygen was sometimes described as an antiasphyctic agent.","zh":"在较早的医学文献中，氧气有时被称为“抗窒息剂”。"},{"en":"The manual recommended antiasphyctic measures such as clearing the airway and providing fresh air.","zh":"手册建议采取抗窒息措施，例如清理气道并提供新鲜空气。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A medicine or substance used to prevent or treat asphyxia.","zh":"（罕用）抗窒息剂；用于预防或治疗窒息/缺氧的药物或物质。"},"examples":[{"en":"The text listed ammonia as an antiasphyctic, though this is not common in modern practice.","zh":"该文本把氨列为“抗窒息剂”，不过在现代实践中并不常见。"}]}],"synonyms":["resuscitative","life-saving","reviving","restorative"],"phonetic":"/ˌæn.ti.æsˈfɪk.tɪk/","extraExplanation":["你输入的拼写“antasphyctic”很少见；更常见的形式是 **antiasphyctic**（anti- “反/抗” + asphyxia “窒息/缺氧” + -tic “……的/……剂”）。","该词多见于较旧的医学或急救语境；现代英语更常用 **resuscitative**（复苏的）、**life-saving**（救命的）、或直接说 **airway/oxygen/CPR measures**（气道/供氧/心肺复苏措施）。"]}
{"word":"antasthenic","summary":{"en":"Antiasthenic means “counteracting weakness or fatigue,” a term mostly seen in older medical contexts.","zh":"Antiasthenic 指“抗虚弱、抗疲劳的”，多见于较旧的医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Counteracting weakness or fatigue; intended to strengthen the body or restore energy (often used in older medical or pharmacy contexts).","zh":"抗虚弱的；用于对抗乏力、疲劳、体虚的（常见于较旧的医学/药学语境）。"},"examples":[{"en":"The label described the tonic as an antiasthenic remedy for tired patients.","zh":"标签把这种滋补剂描述为用于疲劳患者的抗虚弱疗法。"},{"en":"In older medical writing, certain herbs were called antiasthenic because they were thought to boost strength.","zh":"在较早的医学写作中，一些草药被称为“抗虚弱的”，因为人们认为它们能增强体力。"}]}],"synonyms":["restorative","tonic","strengthening","anti-fatigue"],"phonetic":"/ˌæn.ti.æsˈθɛn.ɪk/","extraExplanation":["你输入的“antasthenic”不太常见，更标准的拼写通常是 **antiasthenic**（anti- ‘反…’ + asthenic ‘虚弱的’）。在现代英语里，这个词比较少用，更常见的表达是 *anti-fatigue*（抗疲劳的）、*strengthening*（增强体力的）或 *restorative*（恢复性的）。","**asthenic** 来自希腊语词根 *a-*（无、不）+ *sthenos*（力量），字面意思是“无力的、虚弱的”。因此 **antiasthenic** 就是“对抗虚弱的”。"]}
{"word":"antasthmatic","summary":{"en":"Antiasthmatic means used to prevent or relieve asthma symptoms.","zh":"antiasthmatic 指“用于预防或缓解哮喘症状的；抗哮喘的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medicine) Preventing, relieving, or used to treat asthma; anti-asthmatic.","zh":"（医学）预防、缓解或用于治疗哮喘的；抗哮喘的。"},"examples":[{"en":"The doctor prescribed an antiasthmatic inhaler for quick relief during attacks.","zh":"医生开了一种抗哮喘吸入剂，用于发作时快速缓解。"},{"en":"Some herbs are studied for possible antiasthmatic effects, but evidence varies.","zh":"一些草药被研究是否具有抗哮喘作用，但证据强弱不一。"},{"en":"Antiasthmatic treatment often includes both fast-acting and long-term medicines.","zh":"抗哮喘治疗通常包括速效药和长期控制药。"}]}],"synonyms":["anti-asthmatic","antiasthma","bronchodilating (context-dependent)"],"phonetic":"/ˌæn.ti.æsˈmætɪk/","extraExplanation":["“antasthmatic”更常见的拼写是“anti-asthmatic”或“不带连字符的 antiasthmatic”。其中 anti- 表示“反/抗”，asthmatic 表示“哮喘的”。在医学语境里多用来描述药物、疗法或作用（如 antiasthmatic drug/effect）。"]}
{"word":"antatrophic","summary":{"en":"“Antatrophic” is not standard; it is most likely a misspelling of “anatropic,” a botany term meaning an inverted ovule.","zh":"“antatrophic”并非常见规范词，最可能是“anatropic”的误拼；“anatropic”是植物学术语，指倒生（倒转）的胚珠。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended) In botany, describing an ovule that becomes inverted during development so the micropyle ends up close to the funiculus (the stalk).","zh":"（很可能是你想写的词）【植物学】指“倒生胚珠”：胚珠在发育过程中发生倒转，使珠孔（micropyle）最终靠近珠柄（funiculus，胚珠的柄）。"},"examples":[{"en":"Most angiosperms have anatropic ovules.","zh":"大多数被子植物都有倒生胚珠。"},{"en":"In an anatropic ovule, the micropyle lies near the point of attachment.","zh":"在倒生胚珠中，珠孔靠近与珠柄相连的部位。"}]}],"synonyms":["inverted (botany context)","anatropic"],"phonetic":"/ˌænəˈtrɑːpɪk/","extraExplanation":["“antatrophic”不是常见或规范的英语词形，学习资料与词典中更常见的是 **anatropic**（倒生的）或 **orthotropic**（直生的，未倒转）。如果你是在生物/植物学课本里看到“antatrophic”，很可能是拼写误差或排版错误。","词根提示：**ana-**（向后/再）+ **-tropic**（转向的，与“turn”相关）。在植物学里它描述的是“胚珠的转向/倒转”。"]}

