{"word":"antbear","summary":{"en":"Antbear is a common (often older) name for the aardvark, an African animal that eats ants and termites.","zh":"Antbear 多指土豚（一种非洲动物），以蚂蚁和白蚁为食；这个叫法偏旧或偏口语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large nocturnal African mammal (the aardvark) that eats ants and termites and digs burrows; a common name based on its diet and appearance.","zh":"食蚁兽（通常指土豚）：一种非洲大型夜行哺乳动物，以蚂蚁和白蚁为食，会挖洞筑巢；名称来自其食性与外形联想。"},"examples":[{"en":"An antbear uses its long tongue to lick up termites from a mound.","zh":"食蚁兽会用它的长舌从白蚁丘里舔食白蚁。"},{"en":"In some older books about Africa, the aardvark is called an antbear.","zh":"在一些较早的非洲题材书籍里，土豚会被称为“食蚁兽（antbear）”。"}]}],"synonyms":["aardvark"],"phonetic":"/ˈæntˌbɛr/","extraExplanation":["“antbear”不是现代科学写作中最常用的名称，更常见、也更明确的说法是“aardvark（土豚）”。“antbear”多见于旧式或口语化表达，强调它“吃蚂蚁/白蚁（ant）”的习性，以及外形给人的“像熊（bear）”的联想。","注意：英语里还有别的动物也可能被误称为“antbear”，但在非洲语境中最常指土豚。写作或正式场合建议用“aardvark”。"]}
{"word":"antbird","summary":{"en":"An antbird is a tropical American forest songbird, often noted for following army ant swarms to catch insects.","zh":"antbird 指热带美洲森林中的蚁鴷类鸟，常因（部分种类）跟随行军蚁群捕食昆虫而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of small to medium-sized songbird found mainly in tropical Central and South America, known for living in forests and (in some species) following army ant swarms to catch insects flushed out by the ants.","zh":"一种主要分布在中美洲与南美洲热带地区的林栖鸣禽；部分种类会跟随行军蚁群，捕食被蚂蚁惊出的昆虫。"},"examples":[{"en":"Antbirds are common in Amazon rainforest understory.","zh":"蚁鴷常见于亚马逊雨林的下层植被中。"},{"en":"Some antbirds follow army ants to grab insects trying to escape.","zh":"有些蚁鴷会跟随行军蚁，抓住试图逃跑的昆虫。"}]}],"synonyms":["antbird (general term for Thamnophilidae)"],"phonetic":"/ˈæntˌbɝd/","extraExplanation":["“antbird”是俗名，指蚁鴷科（Thamnophilidae）的一大类鸟，并不表示它们主要吃蚂蚁；很多“跟蚁”的种类主要捕食被蚁群惊扰而逃出的昆虫、蜘蛛等。","常见于热带雨林的林下环境（understory），观鸟或生态文章中常提到它们与“army ants（行军蚁）”的共生式觅食关系。"]}
{"word":"antbird-like","summary":{"en":"Antbird-like means “similar to an antbird,” especially in look or behavior.","zh":"antbird-like 指“像蚁鴷的”，多用于描述外形或行为特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling an antbird (a tropical songbird in the family Thamnophilidae), especially in appearance or behavior.","zh":"像蚁鴷（热带的一类鸣禽，属蚁鴷科）的；尤指外形或行为上相似。"},"examples":[{"en":"The researcher described the call as antbird-like—short, sharp notes from the understory.","zh":"研究者把这种叫声描述为“蚁鴷式的”——来自林下层的短促尖锐音符。"},{"en":"In the dim rainforest, a small antbird-like bird flicked its tail and stayed close to the ground.","zh":"在昏暗的雨林里，一只像蚁鴷的小鸟轻甩尾巴，贴近地面活动。"}]}],"synonyms":["antbirdlike","antbirdish (rare)"],"phonetic":"/ˈæntˌbɝdˌlaɪk/","extraExplanation":["“antbird-like”是由名词“antbird（蚁鴷）+ -like（像……的）”构成的形容词，常见于鸟类学/自然写作中。连字符多用于强调临时组合或作定语时（如 antbird-like call）；写作中也可能见到不加连字符的“antbirdlike”。","蚁鴷多分布于中南美洲雨林，常在林下层活动；有些物种会跟随行军蚁捕食被惊扰出来的昆虫，因此“antbird-like”有时也可暗示这种生态行为（但具体要看语境）。"]}
{"word":"antbirds","summary":{"en":"Antbirds are tropical forest birds (mainly in the Americas), often known for catching insects and sometimes following army-ant swarms.","zh":"蚁鹟是主要分布在美洲热带森林的鸟类，多捕食昆虫，有些会跟随军蚁群觅食。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small, mostly insect-eating tropical birds from Central and South America, many of which live in forests and some of which follow army-ant swarms to catch insects that the ants disturb.","zh":"一种生活在中美洲与南美洲的热带小型鸟类，多以昆虫为食，常见于森林；其中一些会跟随行军蚁（军蚁）群，捕捉被蚂蚁惊扰出来的昆虫。"},"examples":[{"en":"Antbirds often stay in the shade of the rainforest understory.","zh":"蚁鹟常常待在雨林下层的阴影里。"},{"en":"Some antbirds follow army ants to pick off insects that try to escape.","zh":"有些蚁鹟会跟随军蚁，捕食试图逃跑的昆虫。"},{"en":"The guidebook lists several antbirds found in the Amazon.","zh":"这本指南列出了亚马逊地区能见到的多种蚁鹟。"}]}],"synonyms":["antbird","thamnophilids"],"phonetic":"/ˈæntˌbɝdz/","extraExplanation":["“antbirds”是复数形式，单数是“antbird”。它们在分类上主要属于蚁鹟科（Thamnophilidae）。","名字里的“ant-”通常不是因为它们吃蚂蚁本身，而是因为部分种类会“跟随军蚁群”觅食：军蚁驱赶出昆虫和小动物，蚁鹟趁机捕食。"]}

