{"word":"antihaemolysin","summary":{"en":"Antihaemolysin is an antibody that counteracts haemolysin, a substance that can destroy red blood cells.","zh":"antihaemolysin 指一种能对抗（中和）溶血素、从而防止其破坏红细胞的抗体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An antibody (or substance) that neutralizes a haemolysin/hemolysin—toxin that can destroy red blood cells.","zh":"一种能中和溶血素（会破坏红细胞的毒素）的抗体（或物质）。"},"examples":[{"en":"The lab measured antihaemolysin levels to evaluate the patient’s immune response.","zh":"实验室测量抗溶血素水平，以评估患者的免疫反应。"},{"en":"Antihaemolysin can reduce the harmful effects of haemolysins released by certain bacteria.","zh":"抗溶血素可以减轻某些细菌释放的溶血素所造成的有害影响。"}]}],"synonyms":["antihemolysin","anti-haemolysin"],"phonetic":"/ˌæntaɪhiːˈmɑːlɪsɪn/","extraExplanation":["“anti-”表示“反、对抗”。“haemolysin”=“溶血素”，指能导致红细胞溶解（破裂）的物质；因此“antihaemolysin”就是“抗溶血素”。","拼写上“haemo-”更常见于英式英语（haemolysin），美式英语通常写作“hemo-”（hemolysin），含义相同。"]}
{"word":"antihalation","summary":{"en":"Antihalation is a light-absorbing layer or treatment that prevents halo-like glow around bright areas in photos, especially in film.","zh":"Antihalation 指防晕光层/处理，用来减少摄影中亮部周围的光晕，尤其常见于胶片。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a coating or layer used in photographic film, sensors, or optical systems to prevent “halation” (a glowing halo or blurred edge) caused by light reflecting and scattering inside the material.","zh":"（摄影胶片、感光材料或光学系统中的）防晕光层/防光晕处理，用来减少因内部反射与散射造成的“光晕”（边缘发亮、发糊）。"},"examples":[{"en":"Some black-and-white films have an antihalation layer to keep highlights from blooming.","zh":"有些黑白胶片带有防晕光层，用来避免高光“溢出”变成一圈光晕。"},{"en":"The manufacturer improved antihalation to make bright streetlights look cleaner at night.","zh":"厂家改进了防晕光处理，让夜景里明亮的路灯边缘更干净。"},{"en":"After development, the antihalation backing washes out, leaving the image clearer.","zh":"冲洗后，防晕光背涂层会被洗掉，使影像更清晰。"}]}],"synonyms":["anti-halation (variant spelling)","anti-halation layer","anti-halation backing","anti-halation coating"],"phonetic":"/ˌæn.ti.həˈleɪ.ʃən/","extraExplanation":["“Halation（光晕）”常见于胶片或某些强逆光场景：亮部的光穿透感光层后在基底或背面反射，再返回感光层，导致亮部边缘出现一圈发亮、发糊的“光环”。“Antihalation”通常指在胶片背面或层间加入深色吸光染料/涂层来吸收多余光线。","在数字摄影里，人们也会用“antihalation”泛指减少内部反射或眩光的设计（如消光涂层、遮光结构），但它最经典的用法仍来自胶片工艺。"]}
{"word":"antiharmonist","summary":{"en":"An antiharmonist is someone who is against harmony or “harmonizing” approaches, especially in music or argument.","zh":"antiharmonist 指反对和声或反对“把不同观点调和成一致”的做法的人，尤其用于音乐或争论语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposes the use of harmony in music, or who argues against a “harmonist” approach (trying to make different parts fit together smoothly).","zh":"反对（音乐）和声的人；或反对“调和/协调主义”（主张把不同部分尽量解释得一致、和谐）的人。"},"examples":[{"en":"Some early critics were antiharmonists who preferred simple melodies without rich chords.","zh":"一些早期的批评者是反和声者，他们更喜欢没有复杂和弦的简单旋律。"},{"en":"In the debate, she took an antiharmonist stance and insisted the contradictions should remain visible.","zh":"在辩论中，她采取反调和的立场，坚持矛盾应该被保留下来、不要被“抹平”。"}]}],"synonyms":["opponent of harmony","anti-harmony critic","dissenter","contrarian"],"phonetic":"/ˌæn(t)iˈhɑrmənɪst/","extraExplanation":["这个词非常少见，多见于特定评论语境（如音乐美学、思想史或学术争论）。构词法很直观：anti-（反对）+ harmonist（主张和声/调和的人）。在音乐里它通常指反对复杂和声、偏好单旋律或更“纯粹”音响的人；在更抽象的讨论中，也可指反对把冲突解释为一致的人。"]}
{"word":"antihectic","summary":{"en":"Antihectic is a rare, old-fashioned medical word meaning “preventing or relieving persistent fever,” and it can also mean a fever-reducing remedy.","zh":"antihectic 是较罕见的旧式医学词，意为“预防或缓解持续性发热的”，也可指“退久热药/解热药”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical, formal) Used to prevent or relieve a persistent fever (especially an old term for the long-lasting “hectic” fever once associated with tuberculosis).","zh":"（医学/正式）用于预防或缓解持续性发热的；（尤指旧时所说与肺结核相关的“消耗热/弛张热”）。"},"examples":[{"en":"The old medical text recommended an antihectic mixture for patients with long-lasting fever.","zh":"那本旧医学书建议给长期发热的病人使用一种退久热（antihectic）的配方。"},{"en":"Today, doctors don’t usually use the word “antihectic”; they would describe the exact antipyretic (fever-reducing) treatment instead.","zh":"如今医生通常不怎么用“antihectic”这个词，而是会直接说明具体的退烧（antipyretic）治疗。"}]},{"partOfSpeech":"n.","definition":{"en":"A medicine or remedy believed to reduce or prevent a persistent fever (an old-fashioned medical term).","zh":"退久热药；用于缓解或预防持续发热的药物（较旧式的医学用语）。"},"examples":[{"en":"Herbalists once sold various antihectics, though many had no proven effect.","zh":"过去草药师曾出售多种“退久热药”（antihectics），但很多并无确切疗效。"}]}],"synonyms":["antipyretic","febrifuge","fever-reducing"],"phonetic":"/ˌæn.tiˈhɛk.tɪk/","extraExplanation":["“hectic fever（消耗热/弛张热）”是历史上对长期、反复发热的一种称呼，常与肺结核等慢性消耗性疾病联系在一起。因此 antihectic 多见于旧医学文献或文学中的“古风”医疗描写。","现代英语中更常用的对应表达是 antipyretic（退烧的/解热药），或直接说 fever-reducing medicine / treat the fever。"]}
{"word":"antihelices","summary":{"en":"“Antihelices” means the inner curved ridges of cartilage in the outer ears (plural of antihelix).","zh":"“Antihelices”指外耳内侧弯曲的软骨隆起（antihelix 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of antihelix: the inner, curved ridge of cartilage in the outer ear (pinna) that runs roughly parallel to the helix (the outer rim).","zh":"antihelix 的复数：外耳（耳廓）里侧的一条弯曲软骨隆起，走向大致与耳轮（外缘）平行。"},"examples":[{"en":"The doctor examined both ears and noted redness along the antihelices.","zh":"医生检查了双耳，并记录耳对轮（antihelix）处有发红。"},{"en":"In this portrait, the artist carefully shaded the antihelices to give the ears more depth.","zh":"在这幅肖像里，画家细致地给耳对轮加阴影，使耳朵更有立体感。"}]}],"synonyms":["antihelix (singular)","inner ear ridge (informal)","auricular ridge (technical)"],"phonetic":"/ˌæntiˈhiːlɪks/","extraExplanation":["“antihelix”（耳对轮/对耳轮）是解剖学用词，常见于医学、护理、法医学（身份识别）、以及美术/素描对耳朵结构的描述。","记忆法：helix 是耳朵最外圈的“耳轮”；anti- 有“对着/相对”的感觉，antihelix 就是与耳轮相对、在内侧的一道弧形隆起。"]}
{"word":"antiheliotropic","summary":{"en":"Antiheliotropic describes plant parts that turn or grow away from the sun.","zh":"Antiheliotropic 指植物器官背向太阳转动或生长（背日性）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Turning or growing away from the sun; oriented opposite to the sun’s direction.","zh":"（植物学）背日性的；朝向或生长方向与太阳相反的。"},"examples":[{"en":"Some leaves become antiheliotropic during extreme heat to reduce water loss.","zh":"在极端高温时，一些叶片会表现出背日性，以减少水分流失。"},{"en":"The plant showed antiheliotropic movement, keeping its leaf surface out of direct sunlight.","zh":"这株植物出现背日性运动，使叶面避开直射阳光。"}]}],"synonyms":["away-from-the-sun","anti-solar (rare)","opposed to heliotropic"],"phonetic":"/ˌæn.tiˌhiː.li.oʊˈtrɑː.pɪk/","extraExplanation":["词源提示：anti- 表示“反、对抗”，helio- 来自希腊语 hēlios（太阳），-tropic 与“转向/趋向”有关（如 phototropic 向光性）。合起来就是“朝向与太阳相反的转向”。","意义对比：heliotropic（向日性）指朝着太阳转动（如向日葵常被这样描述）；antiheliotropic（背日性）常见于炎热、干旱环境中，有助于降低叶温、减少蒸腾失水。"]}
{"word":"antihelix","summary":{"en":"Antihelix is the inner curved ridge of cartilage in the outer ear, parallel to the helix.","zh":"antihelix 指外耳内侧与耳轮平行的一条弯曲软骨隆起（对耳轮）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A curved ridge of cartilage inside the outer ear (auricle), running roughly parallel to the helix (the outer rim).","zh":"外耳（耳廓）内侧一条弯曲的软骨隆起，大致与耳轮（外缘）平行。"},"examples":[{"en":"The piercer checked her antihelix to see whether a rook piercing would fit well.","zh":"穿孔师检查了她的对耳轮，看看是否适合做耳廓内穿孔（rook piercing）。"},{"en":"In anatomy class, we learned to identify the helix, antihelix, and tragus on the ear.","zh":"在解剖课上，我们学习辨认耳轮、对耳轮和耳屏。"}]}],"synonyms":["inner ear ridge (informal)","anti-helix (variant spelling)"],"phonetic":"/ˌæn.tiˈhiː.lɪks/","extraExplanation":["“anti-”在这里表示“与……相对/相对应”，不是“反对”的意思；antihelix 指的是与 helix（耳轮）相对的一条内侧隆起。","在耳部穿孔文化中，antihelix 常用于描述具体穿孔位置（如 rook、snug 等），因此在日常语境里你可能更常在穿孔介绍或解剖说明中见到这个词。"]}
{"word":"antihelixes","summary":{"en":"“Antihelixes” are the inner curved ridges of the outer ear (plural of “antihelix”).","zh":"“Antihelixes” 指外耳内侧的弯曲隆起（内侧耳轮），是 “antihelix” 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of antihelix: the curved inner ridges of the outer ear (pinna) that run roughly parallel to the helix (the ear’s outer rim).","zh":"antihelix 的复数：外耳（耳廓）内侧的一条弯曲隆起（内侧耳轮），大致与外缘的 helix（耳轮）平行。"},"examples":[{"en":"The piercer marked the antihelixes before placing the jewelry.","zh":"穿孔师在放置饰品前先标记了耳廓的 antihelixes（内侧耳轮）。"},{"en":"The doctor checked both antihelixes for swelling after the injury.","zh":"受伤后，医生检查了两侧的 antihelixes（内侧耳轮）是否肿胀。"}]}],"synonyms":["antihelices","antihelix (singular)"],"phonetic":"/ˌæntiˈhiːlɪksɪz/","extraExplanation":["这是解剖学/医学用词，常见于耳部检查、耳廓整形（otoplasty）或耳部穿孔（piercing）等语境。","复数形式 antihelixes 也可写作 antihelices（较偏学术/医学拼写传统），两者都表示“一个人两只耳朵的内侧耳轮”或“多个个体的内侧耳轮”。"]}
{"word":"antihelminthic","summary":{"en":"Antihelminthic means a drug (or something medicinal) used to kill or expel parasitic worms.","zh":"antihelminthic 指用于杀死或驱除体内寄生蠕虫的药物或药用成分。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medicine) Used to kill or expel parasitic worms (helminths) from the body.","zh":"（医药）用于杀死或驱除体内寄生虫（蠕虫、线虫等）的；驱虫的。"},"examples":[{"en":"The doctor prescribed an antihelminthic drug to treat the child’s roundworm infection.","zh":"医生开了驱虫药来治疗孩子的蛔虫感染。"},{"en":"Some antihelminthic medicines are taken as a single dose, while others require several days.","zh":"有些驱虫药一次服用即可，有些则需要连续服用数天。"}]},{"partOfSpeech":"n.","definition":{"en":"A medicine (drug) that kills or removes parasitic worms.","zh":"驱虫药；抗蠕虫药（用于杀死或排出寄生虫的药物）。"},"examples":[{"en":"Albendazole is a commonly used antihelminthic.","zh":"阿苯达唑是一种常用的驱虫药。"},{"en":"The pharmacist explained how to take the antihelminthic safely.","zh":"药剂师说明了如何安全服用驱虫药。"}]}],"synonyms":["anthelmintic","deworming medicine","vermifuge"],"phonetic":"/ˌæn.ti.hɛlˈmɪn.θɪk/","extraExplanation":["词源上，anti- 表示“反/抗”，helminth 来自希腊语，意为“蠕虫”。因此 antihelminthic 直译就是“抗蠕虫的”。","在医学语境中常与寄生虫感染（如蛔虫、钩虫、绦虫等）一起出现；日常口语更常说 deworming medicine（驱虫药）。"]}
{"word":"antihemagglutinin","summary":{"en":"An antibody that blocks hemagglutination, often by neutralizing hemagglutinin (e.g., influenza HA).","zh":"一种可抑制血凝现象的抗体，常指中和血凝素（如流感HA）的抗体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an antibody (immune protein) that prevents or blocks hemagglutination—especially by neutralizing a hemagglutinin (for example, influenza virus hemagglutinin).","zh":"抗血凝素抗体；一种能阻止或抑制血细胞凝集（血凝现象）的抗体，常指通过中和“血凝素”（如流感病毒血凝素）来发挥作用。"},"examples":[{"en":"The lab measured antihemagglutinin levels to estimate the patient’s immune response after vaccination.","zh":"实验室测量抗血凝素抗体水平，以评估患者接种疫苗后的免疫反应。"},{"en":"High antihemagglutinin titers can indicate prior exposure to a similar influenza strain.","zh":"较高的抗血凝素抗体滴度可能提示曾接触过相似的流感毒株。"}]}],"synonyms":["anti-HA antibody","hemagglutination-inhibiting antibody","HAI antibody"],"phonetic":"/ˌæn.ti.hiˌmæɡ.luːˈtɪ.nɪn/","extraExplanation":["“Hemagglutinin（血凝素）”常见于流感病毒表面，是病毒黏附并进入细胞的重要蛋白；因此“antihemagglutinin”多出现在流感研究、疫苗评估与血清学检测中。","在一些文献里会用“anti-HA antibody（抗HA抗体）”或通过“HAI test（血凝抑制试验）”间接表示/测量这种抗体水平；日常英语中不常用，主要用于医学与科研语境。"]}
{"word":"antihemisphere","summary":{"en":"An antihemisphere is the opposite half of a sphere—often the half of Earth opposite a given location.","zh":"antihemisphere 指球体的相对半球，常指与某地位于地球另一侧的半球。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the opposite hemisphere (half of a sphere), especially the half of Earth on the other side from a given place; an antipodal hemisphere","zh":"对半球；（尤指）与某地相对的地球半球、对跖半球"},"examples":[{"en":"From Europe, much of the antihemisphere is in the Pacific Ocean.","zh":"从欧洲看，许多“对半球”的区域位于太平洋上。"},{"en":"Astronomers sometimes talk about the antihemisphere of a planet when comparing day and night sides or opposite views.","zh":"天文学家有时会用“对半球”来比较行星的昼夜两侧或相对视角。"}]}],"synonyms":["opposite hemisphere","antipodal hemisphere"],"phonetic":"/ˌæntiˈhɛməsfɪr/","extraExplanation":["“anti-”表示“相对、相反”，hemisphere 表示“半球”。antihemisphere 不是日常英语里的常用词，更常见的说法是 opposite hemisphere 或 antipodal hemisphere（对跖半球）。","在地理语境中，它常指“从某个地点出发，地球另一侧的半球”。例如以英国为参照，其对半球很大一部分落在海洋上，这也解释了为什么“陆地对半球”和“水半球”的分布会不均衡。"]}
{"word":"antihemoglobin","summary":{"en":"An antibody that binds to hemoglobin, mainly used in lab testing and research.","zh":"与血红蛋白结合的抗体，主要用于实验室检测与研究。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an antibody (or antiserum) that reacts against hemoglobin (Hb), used in immunology or laboratory tests to detect or study hemoglobin.","zh":"抗血红蛋白抗体（或抗血清）；一种会与血红蛋白（Hb）发生免疫反应的抗体，用于实验室检测或研究血红蛋白。"},"examples":[{"en":"The lab used antihemoglobin to confirm the presence of hemoglobin in the sample.","zh":"实验室使用抗血红蛋白抗体来确认样本中是否存在血红蛋白。"},{"en":"Antihemoglobin antibodies can help identify red-blood-cell components during immunostaining.","zh":"抗血红蛋白抗体可在免疫染色中帮助识别红细胞相关成分。"}]}],"synonyms":["anti-hemoglobin antibody","antihemoglobin antibody","anti-Hb (antibody)"],"phonetic":"/ˌæn.tiˈhiː.məˌɡloʊ.bɪn/","extraExplanation":["这个词更常见于科研/检验语境（如免疫印迹 Western blot、ELISA、免疫组化/免疫荧光等），日常英语中很少使用。","书写上也常见带连字符或缩写：anti-hemoglobin / anti-Hb（Hb = hemoglobin 的常用缩写）。"]}
{"word":"antihemolysin","summary":{"en":"Antihemolysin is an antibody that counteracts hemolysin and helps prevent red blood cell destruction.","zh":"抗溶血素是能对抗溶血素、帮助防止红细胞被破坏的抗体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an antibody that neutralizes hemolysin (a toxin that can destroy red blood cells), preventing or reducing hemolysis","zh":"抗溶血素：一种能中和溶血素（可破坏红细胞的毒素）的抗体，从而预防或减少溶血现象"},"examples":[{"en":"The lab detected antihemolysin in the patient’s serum.","zh":"实验室在患者的血清中检测到了抗溶血素。"},{"en":"Antihemolysin can help block the red-blood-cell–damaging effects of certain bacterial toxins.","zh":"抗溶血素可以帮助阻断某些细菌毒素对红细胞的破坏作用。"}]}],"synonyms":["anti-haemolysin (UK spelling)","antibody to hemolysin"],"phonetic":"ˌæn.ti.hiˈmɑl.ɪ.sɪn","extraExplanation":["这是一个医学/免疫学术语，常见于实验室检验或研究文章中，一般日常英语很少使用。","词形可拆解理解：anti-（“抗、对抗”）+ hemolysin（“溶血素”）。hemolysin 指能导致红细胞破裂（hemolysis，溶血）的物质，常与某些细菌毒素相关。","临床与科研中有时会通过检测相关抗体（如“抗溶血素”）来了解机体对特定毒素或病原体的免疫反应。"]}
{"word":"antihemolytic","summary":{"en":"Antihemolytic describes something that prevents or reduces the breakdown of red blood cells.","zh":"antihemolytic 用来形容能防止或减轻红细胞溶解（溶血）的作用或性质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Preventing or reducing hemolysis (the breaking apart of red blood cells).","zh":"抗溶血的；防止或减轻溶血（红细胞破裂）的。"},"examples":[{"en":"The researchers tested whether the compound had antihemolytic effects in the lab.","zh":"研究人员在实验室测试这种化合物是否具有抗溶血作用。"},{"en":"An antihemolytic agent can help protect red blood cells from damage under certain conditions.","zh":"在某些条件下，抗溶血剂可以帮助保护红细胞免受损伤。"}]}],"synonyms":["antihemolytic (preferred technical term)","anti-hemolytic","hemolysis-inhibiting"],"phonetic":"/ˌæn.ti.hiː.məˈlɪt.ɪk/","extraExplanation":["词形拆解：anti-（反、抗）+ hemolytic（溶血的）。其中 hemolysis 指红细胞破裂并释放血红蛋白的过程。","该词多见于医学、生物化学与药理学语境，常用于描述某种物质、蛋白或处理方式对“溶血”现象的抑制作用。"]}
{"word":"antihemophilic","summary":{"en":"Antihemophilic means ‘related to or used to treat hemophilia,’ especially factor VIII that helps blood clot.","zh":"antihemophilic 指“与血友病有关或用于治疗血友病的”，尤常指帮助凝血的凝血因子VIII（抗血友病因子）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to or used to treat hemophilia, especially by helping blood clot normally (often referring to clotting factor VIII).","zh":"与血友病有关的；用于治疗血友病、帮助血液正常凝固的（常指凝血因子VIII）。"},"examples":[{"en":"The patient received antihemophilic factor to control the bleeding.","zh":"病人接受了抗血友病因子来控制出血。"},{"en":"Doctors checked his factor VIII level before giving antihemophilic medicine.","zh":"医生在给予抗血友病药物前检查了他的凝血因子VIII水平。"}]},{"partOfSpeech":"n.","definition":{"en":"An antihemophilic substance, especially antihemophilic factor (factor VIII), used to help blood clot.","zh":"抗血友病物质；尤指抗血友病因子（凝血因子VIII），用于帮助凝血。"},"examples":[{"en":"The hospital keeps antihemophilic on hand for emergencies.","zh":"医院备有抗血友病制剂以应对紧急情况。"}]}],"synonyms":["antihemophilic factor","factor VIII","clotting factor VIII"],"phonetic":"/ˌæn.tiˌhiː.məˈfɪl.ɪk/","extraExplanation":["词源拆解：anti-（对抗/用于治疗）+ hemophilia（血友病）+ -ic（形容词后缀）。因此它通常出现在医学语境，尤其在“antihemophilic factor（抗血友病因子）”这个固定搭配中。","常见搭配：antihemophilic factor A = factor VIII（凝血因子VIII），主要用于血友病A。日常英语里较少见，多用于病历、药品说明或医学论文。","学习提示：不要把它理解成“反对血友病的人/事”。这里的 anti- 更像“用于对抗疾病、用于治疗”的意思。"]}
{"word":"antihemorrhagic","summary":{"en":"Antihemorrhagic means stopping or preventing bleeding, especially in medical contexts.","zh":"antihemorrhagic 指“止血的、防出血的”，多用于医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Preventing or stopping bleeding (hemorrhage).","zh":"止血的；防出血的（用于预防或停止出血）。"},"examples":[{"en":"The doctor gave an antihemorrhagic medicine after the surgery.","zh":"手术后，医生给了止血药。"},{"en":"Pressure bandages can have an antihemorrhagic effect in emergencies.","zh":"在紧急情况下，加压绷带可以起到止血作用。"}]}],"synonyms":["hemostatic","antibleeding"],"phonetic":"/ˌæn.ti.hɛ.məˈrædʒɪk/","extraExplanation":["这是医学用词，常用于药物、治疗或措施的描述，如 antihemorrhagic drug（止血药）、antihemorrhagic therapy（止血治疗）。","词形上：anti- 表示“反、抗”，hemorrhagic 来自 hemorrhage（出血）。在英式拼写中也常见 haemorrhagic /ˌhiːməˈrædʒɪk/，美式多写 hemorrhagic。"]}
{"word":"antihemorrheidal","summary":{"en":"Antihemorrhoidal means used to prevent or treat hemorrhoids.","zh":"Antihemorrhoidal 指用于预防或治疗痔疮的（抗痔疮的）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Especially in medicine) used to prevent, relieve, or treat hemorrhoids (swollen veins in or near the anus/rectum).","zh":"（尤用于医学）用于预防、缓解或治疗痔疮（肛门或直肠附近静脉肿胀）的。"},"examples":[{"en":"The doctor recommended an antihemorrhoidal cream for the itching and pain.","zh":"医生建议用抗痔疮药膏来缓解瘙痒和疼痛。"},{"en":"Many antihemorrhoidal ointments contain a mild anesthetic to reduce discomfort.","zh":"许多抗痔疮软膏含有温和的麻醉成分，以减轻不适。"}]}],"synonyms":["hemorrhoid-relieving","hemorrhoid-treating","anti-piles (BrE)"],"phonetic":"/ˌæn.ti.hɛ.məˈrɔɪ.dəl/","extraExplanation":["你输入的拼写 **antihemorrheidal** 较少见；更常见、也更标准的拼写是 **antihemorrhoidal**（美式常写 *hemorrhoid*；英式常见 *haemorrhoid*）。","该词多见于药品说明或医疗语境（如 *antihemorrhoidal cream/ointment/suppository*），日常口语里更常直接说 *hemorrhoid cream*（痔疮膏）。"]}
{"word":"antihero","summary":{"en":"An antihero is a main character who doesn’t fit the traditional image of a perfect hero but is still the story’s central figure.","zh":"antihero 指“不符合传统完美英雄形象”的主角：有缺点、道德灰色，但仍是故事核心人物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A main character who lacks traditional heroic qualities (such as perfect morality, bravery, or selflessness) but is still the central figure of the story.","zh":"（文学/影视中的）反英雄；主角不具备传统英雄的高尚品德或完美勇敢，但仍是故事的核心人物。"},"examples":[{"en":"In the film, the antihero breaks the law, but the audience still understands his reasons.","zh":"在这部电影里，反英雄会违法，但观众仍能理解他的理由。"},{"en":"Many modern novels prefer an antihero because he feels more realistic than a perfect hero.","zh":"许多现代小说更偏爱反英雄，因为他比完美英雄更贴近真实。"},{"en":"Batman is sometimes described as an antihero because he works outside the legal system.","zh":"蝙蝠侠有时被称为反英雄，因为他在法律体系之外行事。"}]},{"partOfSpeech":"n.","definition":{"en":"A person (in real life or in a story) who is strongly opposed to a hero or heroic ideals, not necessarily a villain.","zh":"（较少见）反英雄人物；强烈反对英雄或英雄主义理想的人（不一定是反派）。"},"examples":[{"en":"He acts as an antihero in the debate, challenging the idea that one person can ‘save’ everyone.","zh":"在这场辩论中，他扮演“反英雄”的角色，质疑“一个人就能拯救所有人”的观念。"}]}],"synonyms":["flawed hero","morally gray protagonist","reluctant hero"],"phonetic":"/ˌæntiˈhiroʊ/","extraExplanation":["“antihero”常被误解为“反派（villain）”。区别是：反派通常是故事的对立面、做坏事并造成伤害；反英雄则多是主角，可能自私、冷酷、道德灰色，但观众仍会跟随他的视角。","常见相关词：flawed hero（有缺陷的英雄）、morally gray character（道德灰色人物）、reluctant hero（不情愿的英雄）。","在现代影视与小说中，反英雄流行的原因之一是更贴近现实：人物既有优点也有缺点，动机更复杂。"]}
{"word":"antiheroes","summary":{"en":"“Antiheroes” is the plural of “antihero,” meaning main characters who are flawed or morally mixed rather than traditionally heroic.","zh":"antiheroes是antihero的复数，指缺乏传统英雄品质、道德较灰或有明显缺点的主角。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An antihero: a main character who is not traditionally heroic—often flawed, cynical, morally mixed, or rule-breaking, but still central to the story.","zh":"反英雄：指故事中的主角，但不具备传统英雄的高尚品质，常有缺点、冷嘲感、道德灰色地带或不守规矩，却仍是剧情核心。"},"examples":[{"en":"Many modern TV dramas feature antiheroes who lie or break rules to get results.","zh":"许多现代电视剧都塑造了反英雄：他们为了达到目的会撒谎或违法。"},{"en":"Walter White is often discussed as an antihero rather than a classic hero.","zh":"沃尔特·怀特常被视为反英雄，而不是传统意义上的英雄。"},{"en":"She likes stories where the antihero slowly learns to care about others.","zh":"她喜欢那种反英雄逐渐学会关心他人的故事。"}]}],"synonyms":["flawed protagonist","morally gray protagonist","unconventional hero","unlikely hero"],"phonetic":"/ˈæn.tiˌhɪr.oʊ/","extraExplanation":["“anti-”表示“反、非”，antihero并不是“反派/坏人”(villain)，而是“主角但不够正面”。反派通常与主角对立；反英雄则常是观众跟随的主要视角。","反英雄常见于黑色小说(noir)、犯罪题材、反乌托邦作品等，体现对“完美英雄”叙事的反思：人物更真实，但也更矛盾。","词形提示：antiheroes是antihero的复数形式；单数是antihero。相关词：antiheroic（反英雄式的，不够英雄气概的）。"]}
{"word":"antiheroic","summary":{"en":"“Antiheroic” describes an attitude, tone, or story that rejects traditional heroic ideals and highlights ordinary, flawed, or unglamorous realities.","zh":"“antiheroic”指一种反英雄式的态度/语气/叙事：拒绝传统英雄理想，强调普通、缺陷或不光鲜的真实。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposing or rejecting traditional heroic ideals such as glory, noble self-sacrifice, or grand moral certainty; showing a deliberately un-hero-like style or attitude.","zh":"反英雄式的；反对或拒绝传统英雄理想（如荣耀、崇高牺牲、明确的道德确定性）；刻意呈现“不像英雄”的风格或态度。"},"examples":[{"en":"The novel takes an antiheroic view of war, focusing on fear and confusion instead of glory.","zh":"这部小说以反英雄式的视角描写战争，关注恐惧与混乱，而不是荣耀。"},{"en":"His antiheroic humor undercuts the usual tale of a brave conqueror.","zh":"他那种反英雄式的幽默削弱了常见的“勇敢征服者”故事套路。"}]}],"synonyms":["unheroic","unsentimental","anti-glorifying","deflationary"],"phonetic":"/ˌænti hɪˈroʊɪk/","extraExplanation":["“antiheroic”常用来形容作品的主题或叙事角度（如对战争、英雄主义的反思），不一定等同于“antihero”（反英雄，指人物类型）。它强调的是对“英雄叙事/英雄理想”的抵抗或拆解。","常见搭配：an antiheroic view/tone/stance（反英雄式的观点/语气/立场），antiheroic narrative（反英雄叙事）。与“unheroic”相比，antiheroic更有“有意反对、批判”的意味，而unheroic更多是“缺乏英雄气概”的描述。"]}
{"word":"antiheroism","summary":{"en":"Antiheroism is the theme or attitude of focusing on a flawed main character (an antihero) and questioning traditional hero ideals.","zh":"反英雄主义指以有缺陷的主角为中心的主题或态度，并反思传统英雄理想与英雄崇拜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or theme of stories that focus on an antihero— a main character who lacks traditional heroic qualities (such as moral purity, bravery, or selflessness) but is still central to the story.","zh":"“反英雄主义”：以“反英雄”（不具备传统英雄美德的人物）为主角的气质或主题；强调主角的缺陷、矛盾与灰色道德，但仍推动故事核心。"},"examples":[{"en":"The novel’s antiheroism makes the main character feel more human than heroic.","zh":"这部小说的反英雄主义让主角显得更像普通人，而不是传统英雄。"},{"en":"Modern crime dramas often explore antiheroism through flawed detectives and morally ambiguous choices.","zh":"现代犯罪剧常通过有缺陷的侦探和道德暧昧的选择来呈现反英雄主义。"}]},{"partOfSpeech":"n.","definition":{"en":"A viewpoint that questions or resists the idea of hero-worship, highlighting the limits of “heroes” and the complexity of real life.","zh":"一种反思或抵制“英雄崇拜”的观点：强调“英雄”概念的局限，以及现实生活的复杂性。"},"examples":[{"en":"Her essay argues for antiheroism by showing how famous leaders can be both inspiring and harmful.","zh":"她的文章用名人领袖既可鼓舞人心也可能带来伤害来论证反英雄主义。"},{"en":"The film’s antiheroism challenges the audience to rethink what a ‘good’ person looks like.","zh":"电影中的反英雄主义迫使观众重新思考“好人”应当是什么样。"}]}],"synonyms":["antiheroic theme","antiheroic stance","moral ambiguity","hero deconstruction"],"phonetic":"/ˌæn.tiˈhɪr.oʊˌɪz.əm/","extraExplanation":["“antiheroism”常见于文学与影视评论，用来描述一种叙事风格：主角可能自私、冷酷、软弱或犯错，但仍让观众理解甚至共情。它并不等于“反派主义”（villainy），反英雄通常不是纯粹作恶的人。","常见相关词：antihero（反英雄）、antiheroic（反英雄式的）。在流行文化中，黑色电影（film noir）、反乌托邦作品、以及部分超级英雄“黑化”叙事都常被认为带有反英雄主义色彩。"]}
{"word":"antiheterolysin","summary":{"en":"An antibody that neutralizes heterolysins (hemolytic toxins targeting red blood cells of another species).","zh":"可中和异溶血素（针对异种红细胞的溶血性毒素/因子）的抗体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an antibody (or antiserum) that neutralizes a heterolysin—i.e., a toxin/hemolysin that destroys red blood cells from a different species.","zh":"抗异溶血素；一种抗体（或抗血清），可中和“异溶血素”（heterolysin）——即能溶解/破坏其他物种红细胞的毒素或溶血因子。"},"examples":[{"en":"Researchers measured antiheterolysin levels to see whether the animals had developed immunity to the toxin.","zh":"研究人员测量抗异溶血素水平，以判断动物是否对该毒素产生了免疫。"},{"en":"The lab reported that antiheterolysin activity increased after repeated exposure to heterolysins.","zh":"实验室报告称，在反复接触异溶血素后，抗异溶血素活性上升。"}]}],"synonyms":["anti-hemolysin","antihaemolysin","heterolysin antibody"],"phonetic":"/ˌæntaɪˌhɛtərəˈlaɪsɪn/","extraExplanation":["这个词多见于免疫学/微生物学语境，属于较少在日常英语中使用的专业术语。","词形结构：anti-（“抗、对抗”）+ hetero-（“异、不同物种/不同来源”）+ lysin（“溶解因子”，常指可破坏细胞的物质）。","相关概念：hemolysin（溶血素）是能破坏红细胞的物质；heterolysin 特别强调“对异种（不同物种）红细胞”的溶解作用。antiheterolysin 指能中和这种作用的抗体/抗血清。"]}
{"word":"antihidrotic","summary":{"en":"Antihidrotic means “reducing or preventing sweating,” and it can also refer to a product or medicine used for that purpose.","zh":"antihidrotic 表示“减少或抑制出汗的（止汗的）”，也可指用于止汗的药物或产品。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a medicine or substance) reducing or preventing sweating.","zh":"（药物或物质）减少或抑制出汗的；止汗的。"},"examples":[{"en":"This cream contains an antihidrotic ingredient to control excessive sweating.","zh":"这款乳霜含有止汗成分，用来控制过度出汗。"},{"en":"Doctors may recommend an antihidrotic treatment for severe hyperhidrosis.","zh":"对于严重的多汗症，医生可能会建议使用止汗治疗。"}]},{"partOfSpeech":"n.","definition":{"en":"a drug or product that reduces sweating.","zh":"止汗药；抑制出汗的产品。"},"examples":[{"en":"The pharmacist suggested an antihidrotic for sweaty palms.","zh":"药剂师建议用一种止汗产品来改善手汗。"},{"en":"Some antihidrotics can irritate sensitive skin.","zh":"有些止汗产品可能会刺激敏感皮肤。"}]}],"synonyms":["antiperspirant","antisudorific","sweat-reducing"],"phonetic":"/ˌæn.taɪ.haɪˈdrɑː.tɪk/","extraExplanation":["词源上可拆为 anti-（反、抑制）+ hidr(o)-（汗、水；来自希腊语）+ -tic（与……有关的）。常见于医学或产品说明书里。","日常英语中更常见的说法是 antiperspirant（止汗剂，常见于除臭止汗产品）或 “to reduce sweating”（减少出汗）。","注意不要和 anhidrotic 混淆：anhidrotic 通常指“无汗的/不能出汗的”（常用于病理状态），而 antihidrotic 指“抑汗的（用来减少出汗）”。"]}
{"word":"antihierarchal","summary":{"en":"Antihierarchal means “against hierarchy,” favoring equality and non-ranked, non-top-down structures.","zh":"Antihierarchal 意为“反对等级/层级制度”，强调平等、非上下级化与非自上而下的结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to hierarchy (a system where some people or groups have more power, status, or authority than others); favoring equal or non-ranked relationships.","zh":"反对等级制度的；反对层级结构的（主张关系更平等、非上下级化）。"},"examples":[{"en":"Many activists support antihierarchal decision-making in community groups.","zh":"许多行动者支持社区团体采用反等级的决策方式。"},{"en":"The cooperative has an antihierarchal culture where everyone’s voice matters.","zh":"这家合作社有一种反等级的文化，每个人的声音都很重要。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing ideas, art, or politics that resist strict rankings, titles, or top-down control.","zh":"（用于思想、艺术或政治）反对严格排名、头衔或自上而下控制的。"},"examples":[{"en":"Her novel presents an antihierarchal world with fluid social roles.","zh":"她的小说呈现了一个反等级的世界，社会角色更灵活。"},{"en":"The organization’s antihierarchal approach avoids rigid job titles.","zh":"该组织的反等级做法避免使用僵硬的职位头衔。"}]}],"synonyms":["anti-hierarchical","non-hierarchical","egalitarian","anti-authoritarian"],"phonetic":"/ˌæntiˌhaɪˈɛrərkəl/","extraExplanation":["“antihierarchal”也常写作“anti-hierarchical”。它多见于政治理论、组织管理（如扁平化管理）、社会运动与学术写作中。","常搭配：antihierarchal structure / culture / politics / decision-making。语气偏正式；日常口语中也可用“anti-authoritarian（反权威）”“non-hierarchical（非层级化）”“egalitarian（平等主义的）”视语境替换。"]}
{"word":"antihierarchic","summary":{"en":"Antihierarchic means opposing hierarchy or aiming to reduce ranked power structures.","zh":"antihierarchic 指“反对等级制度”或“旨在减少层级权力结构”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to hierarchies or rigid ranking systems; favoring equality and non-ranked organization.","zh":"反对等级制度的；反对严格上下级排序的；倾向平等、去阶层化组织方式的。"},"examples":[{"en":"The group had an antihierarchic culture, so decisions were made by consensus.","zh":"这个团体有一种反等级的文化，所以决策通常通过共识来达成。"},{"en":"Her antihierarchic view challenged the idea that leaders should always have the final say.","zh":"她的反等级观点挑战了“领导总该有最终决定权”的想法。"}]},{"partOfSpeech":"adj.","definition":{"en":"Designed or structured to reduce hierarchy and distribute power more evenly.","zh":"（制度/结构）为减少层级、让权力更平均分配而设计的。"},"examples":[{"en":"They experimented with an antihierarchic management model that rotated responsibilities.","zh":"他们尝试了一种反等级的管理模式，轮换分工与职责。"},{"en":"Some online communities use antihierarchic rules to limit moderator power.","zh":"一些线上社群用反等级规则来限制版主的权力。"}]}],"synonyms":["anti-hierarchical","non-hierarchical","egalitarian","anti-authoritarian"],"phonetic":"/ˌæntiˌhaɪəˈrɑrkɪk/","extraExplanation":["这个词相对少见，学术或讨论组织形态、政治理念时更常用；日常英语里更常见的替代说法包括 anti-hierarchical、non-hierarchical、egalitarian（强调平等）。","构词：anti-（反对）+ hierarchic（等级的）。也常见拼写 antihierarchical（更常用）。"]}
{"word":"antihierarchical","summary":{"en":"Antihierarchical means opposing hierarchical rank and authority, favoring equality and shared decision-making.","zh":"antihierarchical 指反对等级与权威的层级结构，强调平等与共同决策。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to a hierarchy (a system where some people or things have more power or rank than others); favoring equal status and shared power.","zh":"反对等级制度（上下级分明的体系）的；主张平等地位与权力共享的。"},"examples":[{"en":"The group has an antihierarchical culture, so decisions are made by consensus.","zh":"这个团体有反等级的文化，所以决策通常通过共识来达成。"},{"en":"Her antihierarchical approach encouraged interns to speak up in meetings.","zh":"她的反等级做法鼓励实习生在会议上大胆发言。"}]}],"synonyms":["egalitarian","nonhierarchical","anti-authoritarian","anti-elitist"],"phonetic":"/ˌæntiˌhaɪəˈrɑrkɪkəl/","extraExplanation":["“antihierarchical”由 anti-（反对）+ hierarchical（等级制的）构成，常用于讨论组织文化、政治理念或社会结构。","语气通常偏正式/学术，用来强调“反对权力或地位的垂直分层”，接近“anti-authoritarian（反威权）”“egalitarian（平等主义的）”，但不完全等同：antihierarchical 更聚焦“结构上的层级”。"]}
{"word":"antihierarchically","summary":{"en":"“Antihierarchically” means doing something in a way that resists or rejects hierarchical ranking and top-down authority.","zh":"“antihierarchically”表示以抵制或否定等级排序与自上而下权威的方式行事。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that opposes hierarchy (a system where some people or roles have more power or higher rank than others).","zh":"以反对等级制度（按权力或地位高低排列的体系）的方式；反等级地。"},"examples":[{"en":"The collective tried to make decisions antihierarchically, so everyone had an equal voice.","zh":"这个团体试图以反等级的方式做决定，让每个人都有同等的发言权。"},{"en":"They organized antihierarchically, rotating leadership roles each month.","zh":"他们以反等级方式组织，每个月轮换领导角色。"}]}],"synonyms":["non-hierarchically","anti-authoritarianly","egalitarianly"],"phonetic":"ˌæntihaɪˈrɑrkɪkli","extraExplanation":["构词法：anti- 表示“反对/抵制”，hierarchy 表示“等级制度/层级”，-ally/-ically 常把形容词变成副词。antihierarchically 常用于讨论组织结构、政治理念、教育方式或工作文化。","语用提示：它属于较正式/学术或社运语境的词，在日常口语里更常用“in a non-hierarchical way / without hierarchy / with a flat structure”。"]}
{"word":"antihierarchies","summary":{"en":"“Antihierarchies” means systems or practices that resist strict ranking and promote shared or decentralized power.","zh":"“antihierarchies”指反对严格等级制度、提倡共享或去中心化权力的体系或做法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of anti-hierarchy: systems, beliefs, or practices that oppose rigid ranks of authority and favor equality, shared power, or decentralized organization.","zh":"anti-hierarchy 的复数：指反对严格等级制度的体系、观念或做法，强调平等、共享权力或去中心化的组织方式。"},"examples":[{"en":"Many modern volunteer groups build antihierarchies to keep decision-making shared.","zh":"许多现代志愿者团体会建立反等级结构，让决策由大家共同参与。"},{"en":"In the essay, the author compares corporate chains of command with social antihierarchies.","zh":"在那篇文章里，作者把企业的指挥链和社会中的反等级结构作了比较。"}]}],"synonyms":["anti-hierarchical systems","nonhierarchical structures","egalitarian structures","decentralized organization","flat organization"],"phonetic":"/ˌæntiˈhaɪəˌrɑrˌkiz/","extraExplanation":["这个词多见于社会学、政治学、组织管理或文化研究语境，常用来讨论“权力如何分配”。它并不一定表示“没有组织”，而更常指“减少固定上下级”“用协商/共识/轮流负责”等方式来运作。","常见搭配：anti-hierarchical (adj. 反等级的)、anti-hierarchical structure（反等级结构）、decentralized decision-making（去中心化决策）。","写作时更常用带连字符的形式 anti-hierarchies；不加连字符也能见到，但在学术写作里加连字符更清晰。"]}
{"word":"antihierarchism","summary":{"en":"Antihierarchism means opposing strict hierarchies and preferring more equal, non-ranked relationships or organizations.","zh":"Antihierarchism 指反对严格的等级结构，倾向于更平等、非层级化的关系或组织方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to strict social or organizational ranking (hierarchy), especially the belief that people should relate as equals rather than through layers of authority.","zh":"反对严格的社会或组织等级制度（阶级/层级）的观点；强调人们应以平等关系相处，而不是通过层层权威来组织。"},"examples":[{"en":"Antihierarchism is common in groups that prefer shared decision-making.","zh":"反等级主义在偏好共同决策的团体中很常见。"},{"en":"Their antihierarchism made them avoid titles like “boss” or “manager.”","zh":"他们的反等级主义让他们避免使用“老板”或“经理”之类的头衔。"}]}],"synonyms":["anti-authoritarianism","egalitarianism","horizontalism"],"phonetic":"/ˌæn.tiˈhaɪ.ɚˌkɪ.zəm/","extraExplanation":["这个词常见于政治与社会思想语境，尤其与无政府主义（anarchism）、水平组织（horizontal organization）和反威权（anti-authoritarianism）讨论有关，但它不一定等同于“反一切规则”；更强调减少不必要的上下级结构与特权。","构词上：anti-（反对）+ hierarchy（等级制度）+ -ism（主义/观念）。写作中也常见带连字符的形式：anti-hierarchism。"]}
{"word":"antihierarchist","summary":{"en":"Someone (or something) that opposes hierarchical rank and prefers more equal, flat structures.","zh":"指反对等级/层级权力结构、偏好更平等“扁平化”结构的人或立场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposes hierarchy (systems where some people have more rank or power than others), especially in organizations, politics, or social life","zh":"反对等级制度的人；反对层级/等级权力结构的人（尤指在组织、政治或社会生活中）"},"examples":[{"en":"As an antihierarchist, she prefers teams that make decisions together instead of following strict ranks.","zh":"作为反对等级制度的人，她更喜欢集体决策的团队，而不是严格按级别服从的结构。"},{"en":"Many antihierarchists argue that flatter workplaces can be more creative and fair.","zh":"许多反对等级制度的人认为，更“扁平化”的职场可能更有创造力也更公平。"}]},{"partOfSpeech":"adj.","definition":{"en":"opposing hierarchy; favoring flatter, more equal relationships and decision-making","zh":"反对等级制度的；主张更平等、更扁平的关系与决策方式的"},"examples":[{"en":"The group has an antihierarchist culture, so leadership roles rotate.","zh":"这个团体有反等级文化，所以领导角色会轮换。"},{"en":"He takes an antihierarchist approach to teaching and encourages students to challenge ideas respectfully.","zh":"他采取反等级式的教学方式，鼓励学生礼貌地质疑观点。"}]}],"synonyms":["anti-authoritarian","egalitarian","anti-elitist","anti-hierarchy"],"phonetic":"/ˌæntiˈhaɪrərɑrkɪst/","extraExplanation":["这个词由 anti-（反对）+ hierarch(y)（等级制度/层级）+ -ist（……主义者/……者）构成，常见于政治理论、组织管理与社会运动语境。它不一定等同于“反对一切领导”，更常指反对固定的权力等级与特权，倾向于更平等、协作式的结构。"]}
{"word":"antihierarchy","summary":{"en":"Antihierarchy means opposition to hierarchical rank and top-down authority.","zh":"Antihierarchy 指反对等级与自上而下权威的观念或做法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to hierarchy; the belief or practice of avoiding or dismantling rigid rank and top-down power structures.","zh":"反对等级制度；主张避免或拆除僵硬的层级与自上而下的权力结构的观念或做法。"},"examples":[{"en":"Many cooperative workplaces are based on antihierarchy, where decisions are shared rather than imposed from the top.","zh":"许多合作社式的工作场所建立在反等级理念之上，决策由大家共同参与，而不是由上层强加。"},{"en":"Her antihierarchy values showed in the way she treated interns and managers with the same respect.","zh":"她的反等级价值观体现在：她对实习生和经理都一视同仁、同样尊重。"}]}],"synonyms":["anti-hierarchical stance","anti-authoritarianism","egalitarianism","nonhierarchical organization","horizontalism"],"phonetic":"/ˌæn.tiˈhaɪ.əˌrɑr.ki/","extraExplanation":["这个词在日常英语中不算常见，更多见于政治理论、组织管理、教育理念等语境，用来表达“反对等级化/去层级化”的立场。","相关思想常与 anarchism（无政府主义）、egalitarianism（平等主义）、horizontal organization（扁平/水平式组织）等讨论相邻，但 antihierarchy 更强调“反对层级本身”，不一定等同于完全没有组织或规则。"]}
{"word":"antihijack","summary":{"en":"“Antihijack/anti-hijack” means preventing hijacking, or a system/device that helps stop hijacking.","zh":"“antihijack/anti-hijack”表示“防劫持的”，也可指用于防止劫持的系统或装置。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to prevent hijacking (especially of a vehicle or aircraft).","zh":"用于防止劫持的（尤指车辆或飞机）。"},"examples":[{"en":"The plane is equipped with an anti-hijack security system.","zh":"这架飞机配备了防劫持安全系统。"},{"en":"Some cars include anti-hijack features that can disable the engine remotely.","zh":"一些汽车带有防劫持功能，可以远程使发动机失效。"}]},{"partOfSpeech":"n.","definition":{"en":"A device, feature, or system that prevents hijacking.","zh":"防劫持装置／功能／系统。"},"examples":[{"en":"The manufacturer added an antihijack to its new model.","zh":"制造商在新款车型上加入了防劫持系统。"},{"en":"They tested the antihijack before shipping the vehicles.","zh":"他们在车辆出厂前测试了防劫持装置。"}]}],"synonyms":["anti-hijacking","anti-theft (related, not identical)","security system (general)"],"phonetic":"/ˌæntiˈhaɪdʒæk/","extraExplanation":["更常见的写法是连字符形式 anti-hijack（如：anti-hijack system / anti-hijack measures）。不带连字符的 antihijack 也能见到，但更偏技术文档或产品命名。","常见搭配：anti-hijack system（防劫持系统）、anti-hijack alarm（防劫持警报）、anti-hijack measures（防劫持措施）。"]}
{"word":"antihistamine","summary":{"en":"An antihistamine is a medicine used to relieve allergy symptoms by blocking histamine.","zh":"antihistamine 指“抗组胺药”，通过阻断组胺来缓解过敏症状。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medicine that reduces the effects of histamine in the body, used especially to treat allergy symptoms like sneezing, itching, or a runny nose","zh":"抗组胺药；一种减少体内组胺作用的药物，常用于缓解过敏症状（如打喷嚏、发痒、流鼻涕）"},"examples":[{"en":"This antihistamine helps with my seasonal allergies.","zh":"这种抗组胺药能缓解我的季节性过敏。"},{"en":"Some antihistamines can make you sleepy, so be careful before driving.","zh":"有些抗组胺药会让人犯困，所以开车前要小心。"}]}],"synonyms":["allergy medicine","anti-allergy medication","histamine blocker"],"phonetic":"/ˌæn.taɪˈhɪs.tə.miːn/","extraExplanation":["“Histamine（组胺）”是人体在过敏反应中会释放的一种物质，会引起鼻塞、流泪、皮肤瘙痒等症状；“antihistamine”字面意思就是“对抗组胺的”。","常见类别：第一代抗组胺药更容易嗜睡；第二代通常更不容易嗜睡。用药时如果有慢性病、正在怀孕/哺乳或在用其他药，最好先咨询医生或药师。"]}
{"word":"antihistamines","summary":{"en":"Antihistamines are medicines used to relieve allergy symptoms by blocking the effects of histamine.","zh":"抗组胺药是通过阻断组胺作用来缓解过敏症状的一类药物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Medicines that reduce the effects of histamine in the body, especially to relieve allergy symptoms like sneezing, itching, runny nose, and hives.","zh":"抗组胺药；一种减少体内组胺作用的药物，常用于缓解过敏症状，如打喷嚏、瘙痒、流鼻涕和荨麻疹。"},"examples":[{"en":"I take antihistamines in the spring because my pollen allergies get worse.","zh":"春天花粉过敏更严重时，我会吃抗组胺药。"},{"en":"The doctor suggested over-the-counter antihistamines for my itchy skin.","zh":"医生建议我用非处方抗组胺药来缓解皮肤瘙痒。"},{"en":"Some antihistamines can make you feel sleepy, so don’t drive if you’re drowsy.","zh":"有些抗组胺药会让人犯困；如果你昏昏欲睡，就不要开车。"}]}],"synonyms":["allergy medicine","antiallergic medication"],"phonetic":"/ˌæn.tiˈhɪs.tə.minz/","extraExplanation":["“Antihistamines”通常以复数形式出现，指“一类药物”。单数是“an antihistamine”。","常见区分：第一代抗组胺药更容易嗜睡（有的也用于晕车）；第二代通常更不易嗜睡。具体用药与剂量应按说明或医生建议。","词源构成：anti-（反、抗）+ histamine（组胺）。组胺是人体在过敏反应中释放的一种物质，会引起瘙痒、打喷嚏、流鼻涕等症状。"]}
{"word":"antihistaminic","summary":{"en":"Antihistaminic means an antihistamine drug or relating to it—used to reduce allergy symptoms by blocking histamine.","zh":"Antihistaminic 指抗组胺药或与其相关，通过阻断组胺来减轻过敏症状。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"A medicine (or relating to a medicine) that reduces the effects of histamine in the body, often used to treat allergies like sneezing, itching, or runny nose.","zh":"抗组胺（药）的；指能减少体内组胺作用的药物（或与之相关），常用于缓解打喷嚏、瘙痒、流鼻涕等过敏症状。"},"examples":[{"en":"I took an antihistaminic for my hay fever, and my sneezing improved.","zh":"我吃了抗组胺药来治花粉过敏，打喷嚏好多了。"},{"en":"Some antihistaminic medicines can make you sleepy, so don’t drive if you feel drowsy.","zh":"有些抗组胺药会让人犯困，如果觉得困就不要开车。"}]},{"partOfSpeech":"n.","definition":{"en":"An antihistamine drug; a substance used to block histamine and relieve allergy symptoms.","zh":"抗组胺药；用于阻断组胺、缓解过敏症状的药物。"},"examples":[{"en":"The pharmacist recommended an antihistaminic for the itching.","zh":"药剂师推荐了一种抗组胺药来止痒。"},{"en":"If the rash gets worse, stop the antihistaminic and contact a doctor.","zh":"如果皮疹加重，停止服用抗组胺药并联系医生。"}]}],"synonyms":["antihistamine","anti-allergy medicine"],"phonetic":"/ˌæn.ti.hɪs.təˈmɪn.ɪk/","extraExplanation":["“Antihistaminic”在医学/药学语境中常见，日常英语里更常说“antihistamine”（名词）或“antihistamine medicine”。","常见类别：第一代抗组胺药更容易嗜睡；第二代一般较少嗜睡（但个体差异存在）。用药请遵医嘱或按说明书。"]}
{"word":"antihistorical","summary":{"en":"Antihistorical describes ideas or interpretations that reject or ignore historical context and historical explanation.","zh":"Antihistorical 指否定或忽视历史背景与历史解释的重要性的观点或解读。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to, or rejecting, the importance of history or historical explanation; not considering events in their historical context.","zh":"反历史的；反对或否定历史（解释）的重要性；不把事物放在历史背景中来看。"},"examples":[{"en":"Some critics call the film antihistorical because it ignores the period’s real social conflicts.","zh":"一些评论家说这部电影很“反历史”，因为它无视那个时期真实的社会矛盾。"},{"en":"Reading the novel without its historical background can lead to an antihistorical interpretation.","zh":"不结合历史背景来读这部小说，可能会得出一种反历史的解读。"}]}],"synonyms":["ahistorical","unhistorical","context-blind"],"phonetic":"/ˌæn.taɪ.hɪˈstɔr.ɪ.kəl/","extraExplanation":["这个词常见于学术写作（历史学、文学批评、政治理论）中，用来批评一种“脱离时代语境”的看法。它并不一定表示“讨厌历史”，更多是指分析方式不重视历史条件或因果。","构词：anti-（反对）+ historical（历史的）。与它意思接近的批评用语还有：ahistorical（非历史化的/脱离历史的），但 antihistorical 通常语气更强，带“反对或排斥历史解释”的意味。"]}
{"word":"antiholiday","summary":{"en":"Antiholiday means an alternative or anti-traditional way of spending a holiday, often low-key or rejecting typical customs.","zh":"antiholiday 指“反节日/非传统过节”的做法或活动，常强调低调或拒绝常规节日习俗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An alternative celebration or activity held at the same time as a major holiday, often meant to be low-key, ironic, or a protest against holiday commercialism.","zh":"在重要节日期间举行的“反节日/非节日”式替代活动或聚会，常带有低调、反讽或反商业化的意味。"},"examples":[{"en":"They hosted an antiholiday dinner on Christmas Eve with simple food and no gift exchange.","zh":"他们在平安夜办了一个“反节日”晚餐，吃得很简单，也不互送礼物。"},{"en":"Some people organize an antiholiday party to avoid the stress of the season.","zh":"有些人会办“反节日”派对，以避开节日期间的压力。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not celebrating a holiday in the usual way; opposing or rejecting typical holiday customs.","zh":"不按传统方式过节的；反对或拒绝常见节日习俗的。"},"examples":[{"en":"Her antiholiday attitude surprised her family, but they respected it.","zh":"她那种“不想过节”的态度让家人吃惊，但大家也尊重她。"},{"en":"We took an antiholiday approach this year and kept things quiet.","zh":"今年我们采取了“反节日”的方式，尽量低调。"}]}],"synonyms":["anti-holiday","alternative holiday","low-key holiday","nontraditional celebration"],"phonetic":"/ˌæn.tiˈhɑː.ləˌdeɪ/","extraExplanation":["“antiholiday”不是非常常见的标准词，更常见的写法是“anti-holiday”（加连字符）。它常出现在媒体、社交网络或活动宣传中，用来表达：不想跟随节日仪式感、拒绝送礼与消费压力、或只是想用更轻松的方式度过假期。","语气通常带一点幽默或反讽，但也可能表示认真立场（例如反对节日过度商业化）。使用时注意场合：正式写作里可改用更中性的表达，如“a low-key holiday”或“an alternative holiday gathering”。"]}
{"word":"antihomosexual","summary":{"en":"“Antihomosexual” means opposed to homosexuality or prejudiced against gay/lesbian people.","zh":"“antihomosexual”指反对同性恋或对同性恋者抱有偏见、歧视。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to homosexuality or to gay/lesbian people; expressing prejudice or discrimination against them.","zh":"反对同性恋的；对同性恋者（男同/女同）抱有偏见或歧视的。"},"examples":[{"en":"Some countries still have antihomosexual laws that criminalize same-sex relationships.","zh":"一些国家仍有反同性恋法律，将同性关系定为犯罪。"},{"en":"The group’s antihomosexual rhetoric led to protests and public criticism.","zh":"该组织的反同性恋言论引发了抗议和公众批评。"}]}],"synonyms":["anti-gay","anti-LGBTQ","homophobic (often used; slightly different nuance)"],"phonetic":"/ˌæn.ti.hoʊ.məˈsɛk.ʃu.əl/","extraExplanation":["“antihomosexual”多用于描述法律、政策、言论或态度，语气通常较强，常带批判或负面评价。","在日常表达中，如果你想更中性、更具体地说明立场或内容，可以用“anti-gay（反同性恋）”“anti-LGBTQ（反LGBTQ）”或更精准的描述（例如“discriminatory against gay people / 对同性恋者有歧视的”）。","在讨论这类话题时，注意区分“对某种行为/政策的看法”与“对一群人的偏见”，并尊重当事人用词偏好（如 gay, lesbian, LGBTQ）。"]}
{"word":"antihormone","summary":{"en":"An antihormone is a substance that counteracts or blocks a hormone’s effects.","zh":"antihormone 指能对抗或阻断某种激素作用的物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance that blocks, neutralizes, or reduces the effect of a hormone in the body (often by opposing the hormone’s action or binding to it).","zh":"抗激素；一种能阻断、中和或减弱体内某种激素作用的物质（常通过对抗该激素的作用或与其结合来实现）。"},"examples":[{"en":"Some cancers are treated with drugs that act as antihormones to reduce hormone-driven growth.","zh":"一些癌症会用具有抗激素作用的药物治疗，以减少激素驱动的生长。"},{"en":"The researcher tested an antihormone to see whether it could block the hormone’s effects in cells.","zh":"研究人员测试了一种抗激素，看看它是否能在细胞中阻断该激素的作用。"}]}],"synonyms":["hormone antagonist","anti-hormonal agent","hormone blocker"],"phonetic":"/ˌæn.tiˈhɔr.moʊn/","extraExplanation":["“antihormone”是生物医学语境里的词，日常英语中不常用。更常见、更标准的表达通常是“hormone antagonist（激素拮抗剂）”或在具体治疗中用“anti-estrogen / anti-androgen（抗雌激素/抗雄激素）”等更明确的说法。","构词上：anti-（反、对抗）+ hormone（激素）。在科学写作中，它可能指药物、受体拮抗剂，或能中和激素的抗体/蛋白质，具体含义取决于上下文。"]}
{"word":"antihuff","summary":{"en":"“Antihuff” means anti-huffing: meant to prevent or reduce inhalant abuse.","zh":"“Antihuff”指反“huffing”（反吸入剂滥用）：用于预防或减少吸入挥发性化学品的危险行为。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"intended to prevent or discourage “huffing” (the dangerous practice of inhaling fumes from solvents or aerosols to get high).","zh":"用于预防或阻止“huffing”（吸入溶剂、喷雾等挥发性气体以获取致幻效果的危险行为）。"},"examples":[{"en":"The school started an antihuff campaign to warn students about inhalant abuse.","zh":"学校发起了一个 antihuff（反吸入剂滥用）宣传活动，提醒学生远离吸入剂滥用。"},{"en":"Some stores keep certain sprays behind the counter as an antihuff measure.","zh":"一些商店把某些喷雾放在柜台后面，作为 antihuff（防止被拿去吸入）的措施。"}]},{"partOfSpeech":"n.","definition":{"en":"a program, policy, rule, or device meant to reduce inhalant abuse (anti-huffing efforts).","zh":"旨在减少吸入剂滥用的项目、政策、规定或装置（反“huffing”的措施）。"},"examples":[{"en":"The community funded an antihuff initiative for teens.","zh":"社区资助了一个面向青少年的 antihuff（反吸入剂滥用）项目。"},{"en":"They installed locking caps as a simple antihuff solution.","zh":"他们安装了可上锁的瓶盖，作为一种简单的 antihuff（防吸入滥用）方案。"}]}],"synonyms":["anti-huffing","anti–inhalant abuse","inhalant-abuse prevention"],"phonetic":"/ˌæntaɪˈhʌf/","extraExplanation":["“Antihuff”不是特别标准、常见的词，更多时候会写成“anti-huffing”或“anti-inhalant abuse”。其中 huff 在这里指“吸入挥发性化学品的气体来获得快感”，属于物质滥用语境，不是“生气地喘气/哼气”的那个常见含义。"]}
{"word":"antihum","summary":{"en":"“Antihum” describes something that reduces or prevents unwanted hum noise (especially electrical hum in audio equipment); it can also mean an anti-hum feature/device.","zh":"“antihum”指用于减少或防止不需要的嗡声（尤指音响设备中的交流电干扰声）的；也可指抗嗡声功能/装置。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"designed to reduce or prevent a low continuous noise (“hum”), especially unwanted electrical hum in audio equipment.","zh":"（尤指音响设备中）用于减少或防止“嗡嗡声/交流电干扰声（hum）”的；抗嗡声的；抑制嗡声的。"},"examples":[{"en":"This amplifier has an antihum circuit that cuts down background noise.","zh":"这台功放有抗嗡声电路，可以减少背景噪音。"},{"en":"Use an antihum filter if you hear a constant hum from the speakers.","zh":"如果你从音箱里听到持续的嗡声，可以用抗嗡声滤波器。"}]},{"partOfSpeech":"n.","definition":{"en":"a feature or device used to reduce unwanted hum (especially in audio or electrical systems).","zh":"（尤指音频/电气系统中）用于抑制嗡声的功能或装置。"},"examples":[{"en":"The technician added an antihum to the old record player.","zh":"技术员给那台旧唱机加装了一个抗嗡声装置。"}]}],"synonyms":["anti-hum","hum-reducing","noise-suppressing","hum filter","ground-loop isolator"],"phonetic":"ˌæn.taɪˈhʌm","extraExplanation":["“hum”在日常英语里可以指人哼唱的声音，但在音频/电气语境中更常指交流电引入的低频持续噪声（常见为50/60Hz）。所以“antihum”多见于产品说明、维修或电子工程语境，表示“抑制这种嗡声的”。","写法上常见连字符：anti-hum；也可能写作一个词 antihum，属于较偏专业的用法。"]}
{"word":"antihuman","summary":{"en":"Antihuman means hostile to humans or human values, or lacking humane compassion (often in formal contexts).","zh":"antihuman 指反人类、反人类价值，或缺乏人道精神（多用于较正式语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to humans, human values, or human welfare; hostile to people.","zh":"反人类的；反对人类、人类价值或人类福祉的；对人不友善的。"},"examples":[{"en":"The group’s antihuman ideology encouraged violence against civilians.","zh":"该组织的反人类意识形态助长了对平民的暴力。"},{"en":"Many critics call the policy antihuman because it ignores basic dignity.","zh":"许多批评者称这项政策“反人类”，因为它无视基本尊严。"}]},{"partOfSpeech":"adj.","definition":{"en":"Lacking humane qualities; cruel or inhuman (used less commonly, often in formal or philosophical writing).","zh":"缺乏人道精神的；残忍的、不人道的（较少见，多用于正式或哲学语境）。"},"examples":[{"en":"The novel portrays an antihuman world where compassion has disappeared.","zh":"这部小说描绘了一个同情心消失的非人道世界。"},{"en":"He condemned the torture as antihuman behavior.","zh":"他谴责酷刑是非人道的行为。"}]}],"synonyms":["anti-human","inhuman","inhumane","cruel","brutal","heartless","misanthropic"],"phonetic":"/ˌæntiˈhjumən/","extraExplanation":["“anti-”表示“反对、抵制”，加在“human（人类/人性的）”前形成“antihuman”。日常英语里更常用的近义词是“inhuman（不人道的）”“inhumane（残忍的）”。“antihuman”常带有更强的“反人类立场/意识形态”色彩，常见于政治、哲学或批评写作中。"]}
{"word":"antihumanism","summary":{"en":"Antihumanism is a critical stance against traditional humanism, questioning the idea that humans (and a universal “human nature”) are the center of meaning and value; in casual use it can also mean a negative attitude toward humanity.","zh":"反人文主义是一种对传统人文主义的批判立场，质疑“人类/普遍人性”是意义与价值中心的观念；在非学术语境中也可指对人类的消极否定态度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A set of ideas (often in philosophy, literary theory, or social thought) that criticizes or rejects traditional humanism—especially the belief that humans are the central, most important beings and that “human nature” is stable and universal.","zh":"一种思想立场（常见于哲学、文学理论与社会思想中），用来批评或否定传统人文主义——尤其是否定“人类是世界中心/最重要存在”以及“人性稳定且普遍”的观念。"},"examples":[{"en":"Some post-structuralist writers are linked to antihumanism because they question the idea of a universal human subject.","zh":"一些后结构主义作家常与反人文主义联系在一起，因为他们质疑“普遍的人类主体”这一观念。"},{"en":"The article presents an antihumanism that challenges the idea that reason alone defines what it means to be human.","zh":"这篇文章提出一种反人文主义立场，挑战“理性 alone 就定义了人之为人”的观点。"}]},{"partOfSpeech":"n.","definition":{"en":"In a broader, less academic sense, a strongly negative attitude toward humanity or human values.","zh":"在更宽泛、较不学术的用法中：对人类或人类价值的强烈否定或厌弃态度。"},"examples":[{"en":"Calling the novel “antihumanism” is controversial; many readers see it as criticizing society, not humanity itself.","zh":"把这部小说称为“反人文主义”是有争议的；许多读者认为它是在批判社会，而不是否定人类本身。"},{"en":"His speech was criticized for sounding like antihumanism rather than constructive reform.","zh":"他的演讲因听起来像反人文主义而非建设性改革而受到批评。"}]}],"synonyms":["anti-humanism","critique of humanism","posthumanism (related, not identical)","misanthropy (different: hatred of humans)"],"phonetic":"/ˌæn.tiˈhjuː.məˌnɪz.əm/","extraExplanation":["“反人文主义（antihumanism）”常出现在20世纪法国思想语境中，常与结构主义/后结构主义相关；其重点往往不是“讨厌人类”，而是反对把“人”当作一切意义、真理与价值的中心。","在学术讨论里，它常批评传统人文主义对“自主理性个体”的强调，转而关注语言、制度、历史、无意识等如何塑造“主体”。因此它更像是对“人”的位置与定义的反思，而不必然是否定人的尊严。","使用时要注意语境：在课堂或论文里通常是哲学/理论术语；在日常语境里可能被误解为“反人类”。如需更中性的表达，可用“critique of humanism（对人文主义的批判）”。"]}
{"word":"antihumanist","summary":{"en":"Antihumanist describes ideas (or people) that oppose humanism and question human-centered views of meaning, history, or values.","zh":"Antihumanist 指反对人文主义、质疑“以人为中心”的意义/历史/价值观的思想或持这种观点的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to humanism; rejecting the idea that human beings, human reason, or human values should be the central focus for understanding the world.","zh":"反人文主义的；反对“以人及人的理性/价值为中心”的观点。"},"examples":[{"en":"Some philosophers describe certain structuralist theories as antihumanist because they downplay individual agency.","zh":"一些哲学家把某些结构主义理论称为反人文主义的，因为它们弱化了个人能动性。"},{"en":"The essay takes an antihumanist stance, arguing that people are shaped more by systems than by free choice.","zh":"这篇文章采取反人文主义立场，认为人更多被制度与结构塑造，而非由自由选择决定。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who holds antihumanist views.","zh":"反人文主义者；持反人文主义观点的人。"},"examples":[{"en":"He was labeled an antihumanist by critics who preferred traditional humanist ethics.","zh":"偏好传统人文伦理的批评者给他贴上了“反人文主义者”的标签。"},{"en":"Not every antihumanist rejects compassion; many simply question human-centered assumptions.","zh":"并非每个反人文主义者都否定同情心；很多人只是质疑“以人为中心”的预设。"}]}],"synonyms":["anti-humanist","anti-humanistic","anti-anthropocentric","anti-human-centered"],"phonetic":"/ˌæn.tiˈhjuː.mə.nɪst/","extraExplanation":["“反人文主义（antihumanism）”常见于20世纪欧洲思想讨论，尤其与结构主义、后结构主义相关。它并不等同于“反人类/厌世”，更常指反对把“人”当作历史与意义的唯一中心或最终尺度。","在学术语境中，它常用来批评某些“人本主义”的看法：例如强调自主主体、普遍理性、固定的人性等。反人文主义者可能更关注语言、制度、权力、社会结构如何塑造个体。"]}
{"word":"antihumanistic","summary":{"en":"Antihumanistic means opposing humanism or showing little concern for human dignity and welfare.","zh":"Antihumanistic 指反对人文主义，或缺乏对人的尊严与福祉的关怀。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to humanism (the belief that human values, dignity, and agency are central).","zh":"反人文主义的；反对以人的价值、尊严与主体性为核心的人文主义。"},"examples":[{"en":"Some critics describe the novel’s worldview as antihumanistic because it treats people as replaceable parts of a system.","zh":"一些评论家认为这部小说的世界观是反人文主义的，因为它把人当作系统中可替换的零件。"},{"en":"In philosophy, certain theories are called antihumanistic when they downplay individual human agency.","zh":"在哲学中，有些理论被称为反人文主义，因为它们淡化个人的人类能动性。"}]},{"partOfSpeech":"adj.","definition":{"en":"Showing little concern for human welfare; harsh or cruel toward people.","zh":"缺乏人性关怀的；对人的福祉漠视、冷酷甚至残忍的。"},"examples":[{"en":"The report condemned the antihumanistic treatment of workers.","zh":"该报告谴责了对工人的不人道对待。"},{"en":"Rules that ignore basic needs can feel antihumanistic.","zh":"忽视基本需求的规定会让人觉得缺乏人性关怀。"}]}],"synonyms":["anti-humanist","inhumane","callous","dehumanizing","anti-human-centered"],"phonetic":"/ˌæntiˌhjuːməˈnɪstɪk/","extraExplanation":["“antihumanistic”常见于学术/批评语境（文学批评、哲学、社会理论）。它不一定等同于“反人类（anti-human）”，更常指反对“以人为中心”的人文主义传统。","在20世纪理论中，一些与结构主义、后结构主义相关的观点会被评论者贴上“反人文主义”的标签，因为它们强调结构/语言/制度对人的塑造，而不是强调个人主体性。"]}
{"word":"antihumanity","summary":{"en":"Antihumanity means hostility to humanity or an extremely inhumane attitude that denies human dignity.","zh":"Antihumanity 指对人类/人性与人类价值的敌视，或极端不人道、否定人的尊严的态度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to humanity or to human values; hostility toward people as a whole.","zh":"反人类；反人性：对人类或人类价值的反对与敌视。"},"examples":[{"en":"The author uses the word antihumanity to describe a system that treats people as disposable.","zh":"作者用“antihumanity（反人类）”来形容一种把人当作一次性消耗品的制度。"},{"en":"Many readers saw the policy as antihumanity because it ignored basic human dignity.","zh":"许多读者认为这项政策是反人类的，因为它无视基本的人类尊严。"}]},{"partOfSpeech":"n.","definition":{"en":"A quality or attitude that is deeply inhumane, showing a lack of compassion for human suffering.","zh":"反人性倾向：极端不人道、对人的痛苦缺乏同情的态度或特质。"},"examples":[{"en":"The film contrasts small acts of kindness with the antihumanity of war.","zh":"这部电影把微小的善意与战争的反人性形成对比。"},{"en":"He criticized the antihumanity behind the jokes that mocked victims.","zh":"他批评那些嘲笑受害者的笑话背后的反人性。"}]}],"synonyms":["inhumanity","anti-human sentiment","brutality","cruelty"],"phonetic":"/ˌæn.ti.hjuˈmæn.ə.ti/","extraExplanation":["“antihumanity”不是特别常见的日常词，更常见的是形容词“anti-human(反人类的)”或“inhuman(不人道的)”。写作中用它会显得更正式、更强烈。","注意区分：法律/国际新闻里常见“crimes against humanity（反人类罪/危害人类罪）”，而“antihumanity”更偏抽象概念，用来讨论思想、制度或氛围对“人”的否定。"]}
{"word":"antihumbuggist","summary":{"en":"An antihumbuggist is someone who strongly opposes deception, hypocrisy, or fake show (“humbug”).","zh":"antihumbuggist 指强烈反对欺骗、伪善或虚假作秀（humbug）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposes “humbug” (dishonest talk, hypocrisy, or fake show), often by criticizing people who try to deceive others.","zh":"反对“哄骗/虚伪作秀（humbug）”的人；常指批评虚假宣传、伪善或骗人把戏的人。"},"examples":[{"en":"He became known as an antihumbuggist who called out false advertising.","zh":"他以反对虚假宣传的“反哄骗者”而出名。"},{"en":"The journalist wrote in an antihumbuggist style, attacking hypocrisy in public life.","zh":"这位记者以“反虚伪作秀”的风格写作，抨击公共生活中的伪善。"}]}],"synonyms":["skeptic","debunker","critic","anti-hypocrite"],"phonetic":"/ˌæn(t)iˈhʌmˌbʌɡɪst/","extraExplanation":["“antihumbuggist”是由 anti-（反对）+ humbug（骗局、虚伪作秀、哄骗）+ -ist（……主义者/……的人）构成的较少见词，多见于19世纪英语语境或带讽刺意味的写法。","humbug 在英语文化里常与狄更斯《圣诞颂歌》（A Christmas Carol）中斯克鲁奇的名句 “Bah! Humbug!” 相关；不过 antihumbuggist 并不等同于“反圣诞的人”，更偏向“反对虚伪与欺骗的人”。"]}
{"word":"antihunting","summary":{"en":"“Antihunting” means opposed to hunting.","zh":"“antihunting”表示“反对狩猎的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to hunting, or supporting actions/policies that discourage or ban hunting.","zh":"反对狩猎的；支持限制或禁止狩猎的（立场/政策）。"},"examples":[{"en":"She joined an antihunting group to campaign against trophy hunting.","zh":"她加入了一个反狩猎团体，反对“战利品狩猎”。"},{"en":"The city council heard both hunting and antihunting voices at the meeting.","zh":"市议会在会议上听取了支持狩猎和反狩猎双方的意见。"},{"en":"Antihunting laws are controversial in some rural areas.","zh":"在一些农村地区，反狩猎相关法律颇具争议。"}]}],"synonyms":["anti-hunting","opposed to hunting","anti–trophy hunting"],"phonetic":"/ˌæntiˈhʌntɪŋ/","extraExplanation":["这个词常见写法有连字符的“anti-hunting”和不带连字符的“antihunting”，两者含义相同；在正式写作中带连字符更常见，因为更清楚地显示“anti-（反对）+ hunting（狩猎）”的构词关系。","语境里它通常修饰“campaign / group / activists / laws / sentiment（运动/团体/活动人士/法律/社会情绪）”，用来描述“反对狩猎”的立场，而不一定代表反对所有形式的动物管理或野生动物保护。"]}
{"word":"antihydrogen","summary":{"en":"Antihydrogen is the antimatter version of a hydrogen atom (an antiproton + a positron).","zh":"反氢是氢原子的反物质版本（反质子 + 正电子）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A form of antimatter made of an antiproton with a positron (the antimatter version of an electron); it is the opposite of a hydrogen atom.","zh":"一种由反质子与正电子（电子的反物质对应物）组成的反物质原子，是氢原子的“反版本”。"},"examples":[{"en":"Scientists created antihydrogen to test whether antimatter follows the same physical laws as matter.","zh":"科学家制造反氢，用来检验反物质是否遵循与普通物质相同的物理定律。"},{"en":"If antihydrogen touches normal matter, both can annihilate and release energy.","zh":"如果反氢接触普通物质，二者可能发生湮灭并释放能量。"}]}],"synonyms":["anti-hydrogen"],"phonetic":"/ˌæn.taɪˈhaɪ.drə.dʒən/","extraExplanation":["反氢通常在大型实验室（如 CERN）中以极少量、短时间被制造出来。由于会与容器材料接触而湮灭，研究人员常用电磁场把带电粒子先“困住”，再形成中性的反氢，并用磁阱在真空中短暂束缚。","在科幻作品中“反物质燃料”常被夸张使用；现实中反氢的制造成本极高、保存困难，且现阶段不具备可行的工程化应用。"]}
{"word":"antihydrophobic","summary":{"en":"Antihydrophobic describes a surface/material that is not water-repelling and tends to be water-attracting (hydrophilic).","zh":"Antihydrophobic 指不排斥水、容易被水润湿的表面/材料，语义上接近“亲水的（hydrophilic）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not hydrophobic; tending to attract water or become easily wet (often describing a surface or material).","zh":"不疏水的；趋向于吸水或容易被润湿的（常用来形容表面或材料）。"},"examples":[{"en":"After the treatment, the plastic became antihydrophobic, so water spread across it instead of beading up.","zh":"经过处理后，塑料变得不疏水，水不再成珠，而是铺展开来。"},{"en":"Researchers designed an antihydrophobic coating to reduce fogging on glasses.","zh":"研究人员设计了一种不疏水的涂层，用来减少眼镜起雾。"}]}],"synonyms":["hydrophilic","water-wettable","wettable","nonhydrophobic"],"phonetic":"ˌæn.ti.haɪ.droʊˈfoʊ.bɪk","extraExplanation":["“antihydrophobic”不是日常高频词，更常见的替代说法是“hydrophilic（亲水的）”或“water-wettable（易润湿的）”。在材料科学里，它通常用来强调“通过处理/涂层把表面从疏水变成更亲水”的变化过程，而不只是描述一种天然属性。","构词：anti-（反、对抗）+ hydro-（水）+ -phobic（恐惧/排斥的）。字面意思是“反疏水”，所以语义上接近“anti-fog（防雾）”“anti-static（防静电）”这类功能性描述。"]}
{"word":"antihydropic","summary":{"en":"Antihydropic means “anti-edema”: helping prevent or reduce abnormal fluid buildup (dropsy).","zh":"antihydropic 指“抗水肿的”：帮助预防或减轻异常积液（水肿/旧称 dropsy）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"preventing or treating edema (an abnormal buildup of fluid in the body); formerly used especially for “dropsy.”","zh":"抗水肿的；治疗或预防水肿的（旧时常用于指“dropsy/水肿病”）。"},"examples":[{"en":"The doctor prescribed an antihydropic medicine to reduce the swelling in his legs.","zh":"医生开了抗水肿的药来减轻他腿部的肿胀。"},{"en":"Older medical texts sometimes describe diuretics as antihydropic remedies.","zh":"较旧的医学文献有时把利尿剂描述为抗水肿的疗法。"}]}],"synonyms":["anti-edema","diuretic","decongestant (medical, less exact)"],"phonetic":"/ˌæn.taɪ.haɪˈdrɑː.pɪk/","extraExplanation":["“antihydropic”是比较少见、偏旧式的医学用词：anti-（反/抗）+ hydropic（与积液、水肿有关）。","“dropsy”是历史上对“全身或局部异常积液”的常用称呼，现代医学更常用“edema（水肿）”。因此当你在现代英语中表达时，更常见的说法是“anti-edema”或直接说“diuretic（利尿的）/a diuretic drug（利尿药）”。"]}
{"word":"antihydropin","summary":{"en":"“Antihydropin” is not standard English; it likely refers (by word parts) to something against fluid buildup, or it may be a misspelling of “antihydropic.”","zh":"“antihydropin”不是标准英语；按构词可能表示“抗积液/抗水肿”，也可能是把“antihydropic”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it does not appear in common dictionaries. It may be a misspelling or a coined term.","zh":"不是标准英语词；常见词典中一般查不到。可能是拼写错误或自造词。"},"examples":[{"en":"I can’t find “antihydropin” in a dictionary—did you mean “antihydropic” or “antidiuretic”?","zh":"我在词典里找不到“antihydropin”——你是不是想写“antihydropic”或“antidiuretic”（抗利尿/相关）？"}]},{"partOfSpeech":"other","definition":{"en":"(Rare/medical-looking formation) Something intended to prevent or reduce fluid buildup in the body (by meaning: anti- + hydrop- ‘water’).","zh":"（非常罕见/看起来像医学构词）指“防止或减少体内积液”的东西（按构词理解：anti- ‘反’ + hydrop- ‘水’）。"},"examples":[{"en":"The label uses a nonstandard term, calling the herb an “antihydropin” remedy for swelling.","zh":"标签用了不规范的词，把这种草药称为治疗肿胀的“antihydropin”疗法。"},{"en":"In older-style writing, people sometimes invent medicine-like words from Greek roots.","zh":"在较老或较随意的写法里，人们有时会用希腊词根“拼”出看起来像药名的词。"}]}],"synonyms":["antihydropic (likely intended)","anti-edema","diuretic (related)"],"phonetic":"/ˌæn.taɪ.haɪˈdrɑp.ɪn/","extraExplanation":["更常见、可能更接近你想表达的词有：\n1）antihydropic（抗水肿的；旧式医学用语，指“反对/治疗水肿或积液”）；\n2）diuretic（利尿的/利尿剂）与 antidiuretic（抗利尿的，常用于激素 ADH 的作用）；\n3）anti-edema（抗水肿的，现代更直观的说法）。\n如果你能提供出现它的句子或来源（药品说明、小说、游戏等），我可以更准确判断含义。"]}
{"word":"antihygienic","summary":{"en":"“Antihygienic” means not hygienic; dirty or unsafe in a way that can spread germs.","zh":"antihygienic 意为“不卫生的”；肮脏或不安全，可能传播细菌。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not hygienic; likely to spread germs or cause illness because it is dirty or handled in an unsafe way.","zh":"不卫生的；可能传播细菌或因肮脏/不安全处理而导致疾病的。"},"examples":[{"en":"Sharing razors is antihygienic and can spread infections.","zh":"共用剃刀很不卫生，可能传播感染。"},{"en":"Leaving cooked rice at room temperature for hours can be antihygienic.","zh":"把煮熟的米饭在室温下放好几个小时可能不卫生。"},{"en":"The inspector reported antihygienic conditions in the kitchen.","zh":"检查员报告说厨房环境不卫生。"}]}],"synonyms":["unhygienic","unsanitary","dirty","unclean"],"phonetic":"/ˌæn.ti.haɪˈdʒiː.nɪk/","extraExplanation":["“anti-”表示“反……/不……”（如 antiwar 反战），hygienic 表示“卫生的”。合在一起，antihygienic 多用于评价行为、习惯或环境“不符合卫生要求”。","这个词在日常口语中不算常见，更常见的说法是 unhygienic（不卫生的）或 unsanitary（不卫生的，常用于官方/检查报告）。","注意搭配：antihygienic habits/conditions/practices（不卫生的习惯/环境/做法）。"]}
{"word":"antihygienically","summary":{"en":"“Antihygienically” means doing something in an unhygienic, germ-spreading, or contamination-risk way.","zh":"“antihygienically”指“以不卫生、可能传播细菌或造成污染的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not hygienic; in an unclean or unsafe way that can spread germs or cause contamination.","zh":"以不卫生的方式；不干净或不安全、可能传播细菌或造成污染的方式。"},"examples":[{"en":"The food was prepared antihygienically, with the same cutting board used for raw chicken and vegetables.","zh":"食物的准备方式很不卫生：生鸡肉和蔬菜用了同一块砧板。"},{"en":"If you store leftovers antihygienically, they may spoil quickly and make you sick.","zh":"如果你以不卫生的方式保存剩菜，它们可能很快变质并让你生病。"},{"en":"The clinic was criticized for operating antihygienically during the inspection.","zh":"在检查中，这家诊所因操作不卫生而受到批评。"}]}],"synonyms":["unhygienically","unsanitarily","uncleanly"],"phonetic":"/ˌæn.ti.haɪˈdʒiː.nɪ.kli/","extraExplanation":["“antihygienically”由 anti-（反/不）+ hygienic（卫生的）+ -ally（副词结尾）组成，意思是“以不卫生的方式”。日常英语里更常见的说法是 “in an unhygienic way” 或直接用 “unsafely/uncleanly”（视语境而定）。","它常出现在正式或技术性语境（如检查报告、医学/食品安全写作）中；口语里通常会说 “That’s not hygienic / That’s really unhygienic.”"]}
{"word":"antihylist","summary":{"en":"Antihylist is a rare term for someone who opposes hylism/materialism (the idea that reality is fundamentally matter).","zh":"antihylist 是一个很少见的词，指反对质料论/唯物主义（认为现实根本是物质）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, philosophical) A person who rejects hylism (the view that reality is fundamentally matter) or who argues against materialism.","zh":"（罕见，哲学）反对“质料论/物质本体论”（认为现实根本上是物质）的观点的人；反物质主义者。"},"examples":[{"en":"Some anti-hylists argue that consciousness cannot be fully explained by matter alone.","zh":"一些反质料论者认为，意识无法仅用物质来完全解释。"},{"en":"In that debate, she described herself as an anti-hylist rather than a strict materialist.","zh":"在那场辩论中，她称自己是反质料论者，而不是严格的唯物主义者。"}]}],"synonyms":["anti-materialist","idealist","spiritualist","dualist"],"phonetic":"/ˌæntiˈhaɪlɪst/","extraExplanation":["“hyl- / hyle”源自希腊语，意为“物质、质料”。“hylism”常被用来指一种把“物质/质料”视为最根本的立场（在现代语境里常与“materialism/唯物主义”相关）。因此“anti-hylist”字面意思就是“反对以质料为根本的人”。","这个词在日常英语里几乎不用，更常见的表达是“anti-materialist（反唯物主义者）”“idealist（唯心主义者）”或“dualist（二元论者）”。如果你是在文献里看到它，也可能是作者自造或非常小众的术语。"]}
{"word":"antihyperglycemic","summary":{"en":"Antihyperglycemic describes medicines or treatments that reduce high blood sugar.","zh":"antihyperglycemic 指“抗高血糖的”，用于描述降低高血糖的药物或治疗。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Used to lower high blood sugar (glucose) levels; used to treat hyperglycemia, especially in diabetes.","zh":"（医学）抗高血糖的；用于降低血糖（葡萄糖）过高的水平，常用于治疗高血糖，尤其是糖尿病相关的高血糖。"},"examples":[{"en":"Metformin is a common antihyperglycemic drug for people with type 2 diabetes.","zh":"二甲双胍是治疗2型糖尿病常用的抗高血糖药物。"},{"en":"The doctor adjusted her antihyperglycemic therapy after reviewing her A1C results.","zh":"医生在查看她的糖化血红蛋白（A1C）结果后，调整了她的抗高血糖治疗方案。"},{"en":"Some antihyperglycemic medicines can cause low blood sugar if not taken correctly.","zh":"一些抗高血糖药如果使用不当，可能会导致低血糖。"}]}],"synonyms":["blood sugar–lowering","glucose-lowering","antidiabetic (broader)"],"phonetic":"/ˌæn.taɪˌhaɪ.pɚ.ɡlaɪˈsiː.mɪk/","extraExplanation":["词形拆解：anti-（反、抗）+ hyper-（过高）+ glyc-（糖）+ -emic（与血液有关的）→ “抗血糖过高的”。","常见搭配：antihyperglycemic drug/medication（抗高血糖药）、antihyperglycemic therapy（抗高血糖治疗）。","语域提示：这是医学/药学用词，日常英语里更常说 “diabetes medicine” 或直接说具体药名。"]}
{"word":"antihypertensive","summary":{"en":"Antihypertensive refers to a drug or treatment used to lower high blood pressure.","zh":"Antihypertensive 指用于降低高血压的药物或治疗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medicine or treatment that lowers high blood pressure","zh":"降压药；抗高血压的药物或治疗（用于降低高血压）"},"examples":[{"en":"The doctor prescribed an antihypertensive to help control her blood pressure.","zh":"医生开了一种降压药来帮助控制她的血压。"},{"en":"Some antihypertensive drugs may cause dizziness when you stand up quickly.","zh":"有些降压药在你快速站起来时可能会引起头晕。"}]},{"partOfSpeech":"adj.","definition":{"en":"used to describe a drug or treatment that lowers high blood pressure","zh":"抗高血压的；降压的（形容药物或治疗能降低血压）"},"examples":[{"en":"He started antihypertensive therapy after several high readings.","zh":"在多次测得血压偏高后，他开始接受降压治疗。"},{"en":"She takes an antihypertensive medication every morning.","zh":"她每天早上服用降压药。"}]}],"synonyms":["blood-pressure medicine","antihypertension drug","hypotensive (less common in everyday medical use)"],"phonetic":"/ˌæn.ti.haɪ.pɚˈtɛn.sɪv/","extraExplanation":["“anti-”表示“反、抗”，而“hypertensive”来自“hypertension（高血压）”。所以 antihypertensive 字面意思就是“抗高血压的”。","常见的降压药类别包括：ACE 抑制剂、ARB、β受体阻滞剂、钙通道阻滞剂、利尿剂等；具体用药需由医生根据个人情况决定。"]}
{"word":"antihypertensives","summary":{"en":"Antihypertensives are medicines or treatments that lower high blood pressure.","zh":"Antihypertensives 指用于降低高血压的降压药或相关治疗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"medicines (drugs) used to lower high blood pressure (hypertension).","zh":"用于降低高血压的药物（降压药）。"},"examples":[{"en":"My doctor prescribed antihypertensives to control my blood pressure.","zh":"医生给我开了降压药来控制血压。"},{"en":"Some people need more than one antihypertensive to reach their target blood pressure.","zh":"有些人需要不止一种降压药才能达到目标血压。"},{"en":"Antihypertensives can sometimes cause dizziness when you stand up quickly.","zh":"降压药有时会导致起身太快时头晕。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to drugs or treatments that lower high blood pressure.","zh":"与降低高血压的药物或治疗有关的；降压的。"},"examples":[{"en":"She is taking antihypertensive medication every morning.","zh":"她每天早上服用降压药。"},{"en":"The nurse reviewed his antihypertensive therapy.","zh":"护士复核了他的降压治疗方案。"}]}],"synonyms":["blood-pressure medications","antihypertensive drugs","BP meds"],"phonetic":"/ˌæn.ti.haɪ.pɚˈtɛn.sɪvz/","extraExplanation":["“antihypertensives”通常以复数形式出现，指“一类降压药”。单数形式是 antihypertensive（一个降压药/一种降压治疗）。","常见降压药类别包括：ACE 抑制剂、ARB、β受体阻滞剂、钙通道阻滞剂、利尿剂等。不同类别机制不同，医生会根据病因、年龄、合并症（如糖尿病、心衰）来选择。","学习用法提示：在医疗语境里常说 “take antihypertensives / antihypertensive medication / blood-pressure meds”。“BP”是 blood pressure 的常见缩写。"]}
{"word":"antihyperuricemic","summary":{"en":"Antihyperuricemic describes a medicine or treatment that lowers uric acid in the blood.","zh":"antihyperuricemic 指能降低血液尿酸水平的药物或治疗（抗高尿酸血症的）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to reduce the level of uric acid in the blood (used to describe medicines or treatments).","zh":"（用于描述药物或治疗）能够降低血液中尿酸水平的。"},"examples":[{"en":"Allopurinol is an antihyperuricemic drug used to help prevent gout attacks.","zh":"别嘌醇是一种抗高尿酸血症药物，可用于帮助预防痛风发作。"},{"en":"The doctor prescribed antihyperuricemic therapy to bring his uric acid down.","zh":"医生开了抗高尿酸血症治疗来把他的尿酸降下来。"}]}],"synonyms":["urate-lowering","hypouricemic","uric acid–lowering"],"phonetic":"/ˌæn.taɪˌhaɪ.pɚ.jʊˈrɪ.siː.mɪk/","extraExplanation":["词形拆解：anti-（反、对抗）+ hyper-（过高）+ uric（尿酸的）+ -emic（血液中的）。合起来就是“对抗血尿酸过高的”。","常见语境：多出现在医学论文、药品说明书或临床记录中；日常交流里更常说“urate-lowering (medicine/therapy)”或直接说“medicine to lower uric acid（降尿酸药）”。","相关疾病背景：高尿酸血症常与痛风（gout）有关，但“尿酸高”不一定立刻有症状；控制尿酸是长期管理的一部分。","常见药物类别举例：抑制尿酸生成的药物（如 allopurinol, febuxostat）与促进尿酸排泄的药物（如 probenecid）都可称为 antihyperuricemic（按广义用法）。"]}
{"word":"antihypnotic","summary":{"en":"Antihypnotic means “opposing or counteracting hypnosis or sleep-inducing (hypnotic) effects,” especially in medical contexts.","zh":"antihypnotic 指“抗催眠的/抗安眠镇静作用的”，多见于医学或药理学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"A drug or substance that reduces, prevents, or counteracts hypnosis or hypnotic (sleep-inducing/sedative) effects.","zh":"抗催眠的；用于减弱、预防或抵消催眠或催眠性（安眠/镇静）作用的药物或物质。"},"examples":[{"en":"The researcher tested an antihypnotic agent to see if it could block the sedative effect of the medication.","zh":"研究人员测试了一种抗催眠剂，看看它是否能阻断该药物的镇静作用。"},{"en":"Caffeine is sometimes discussed as having mild antihypnotic effects because it promotes alertness.","zh":"咖啡因有时被认为具有轻微的抗催眠作用，因为它能让人更清醒。"}]},{"partOfSpeech":"n.","definition":{"en":"A medication or agent used to oppose or reverse hypnosis or sleep-inducing states.","zh":"抗催眠药（或抗催眠剂）；用于对抗或逆转催眠或诱导睡眠状态的药物/制剂。"},"examples":[{"en":"In older medical writing, an antihypnotic might be given to help a patient stay awake.","zh":"在较早的医学文献中，可能会使用抗催眠药来帮助病人保持清醒。"},{"en":"The label described the compound as an antihypnotic rather than a hypnotic.","zh":"标签将该化合物描述为抗催眠剂，而不是催眠剂。"}]}],"synonyms":["anti-sedative","stimulant (context-dependent)","wakefulness-promoting (agent)"],"phonetic":"/ˌæn.taɪ.hɪpˈnɑː.tɪk/","extraExplanation":["“anti-”表示“反、抗”， “hypnotic”指“催眠的/安眠镇静的”。因此 antihypnotic 直译就是“抗催眠的”。","这是偏医学或药理学用词，日常英语中不常用。更常见的相关表达有 “stimulant（兴奋剂）”“wakefulness-promoting agent（促醒剂）” 或 “reverse the sedative effect（逆转镇静作用）”。","在医学语境里，hypnotic 通常指“安眠镇静类药物”，不一定与“舞台催眠”那种心理暗示有关。"]}
{"word":"antihypnotically","summary":{"en":"Antihypnotically means “in a way that counteracts hypnosis or hypnotic effects.”","zh":"antihypnotically 意为“以对抗催眠或催眠样作用的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that prevents, resists, or counteracts hypnosis or hypnotic effects (such as trance, suggestion, or sedation).","zh":"以一种防止、抵抗或对抗催眠（或催眠样作用，如恍惚、暗示、镇静效果）的方式。"},"examples":[{"en":"The clinician chose a stimulus that worked antihypnotically to keep the patient alert.","zh":"临床人员选择了一种能起到抗催眠作用的刺激，让病人保持清醒。"},{"en":"Caffeine can act antihypnotically for some people, reducing drowsiness.","zh":"咖啡因对一些人可能具有抗催眠作用，减少困倦。"}]}],"synonyms":["counter-hypnotically","anti-sedatively","in an alerting way"],"phonetic":"/ˌænti hɪpˈnɑtɪkli/","extraExplanation":["“antihypnotically”较少出现在日常英语中，更常见于医学、心理学或药理学语境，用来描述“对抗催眠/镇静效果”的作用或方式。","词形结构：anti-（反、对抗）+ hypnotic（催眠的）+ -ally（以……方式）。在更自然的表达里，人们也常说 “in an antihypnotic way / with an antihypnotic effect”。"]}
{"word":"antihypochondriac","summary":{"en":"An antihypochondriac is someone (or an attitude) that is the opposite of a hypochondriac—rarely worried about illness and not likely to imagine being sick.","zh":"antihypochondriac 指与“疑病症”相反的人或态度：很少担心生病，也不太会臆想自己患病。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is the opposite of a hypochondriac—someone who rarely worries about illness and does not easily believe they are sick","zh":"反疑病症者；与“疑病症患者”相反的人——很少担心生病、也不容易认为自己患病的人"},"examples":[{"en":"He’s an antihypochondriac: even with a fever, he assumes he’ll be fine after some rest.","zh":"他是个反疑病症者：就算发烧，也觉得休息一下就会好。"},{"en":"As an antihypochondriac, she ignores small aches unless they last for days.","zh":"作为反疑病症者，她会忽略小疼小痛，除非持续好几天。"}]},{"partOfSpeech":"adj.","definition":{"en":"not prone to health anxiety; unlikely to imagine illnesses; unusually unconcerned about symptoms","zh":"不易产生健康焦虑的；不太会臆想自己得病的；对症状异常不紧张的"},"examples":[{"en":"He has an antihypochondriac attitude toward minor symptoms.","zh":"他对轻微症状抱着一种反疑病症式的态度。"},{"en":"Her antihypochondriac calm can be helpful, but it sometimes delays doctor visits.","zh":"她那种反疑病症式的冷静有时很有帮助，但也可能导致看医生变晚。"}]}],"synonyms":["non-anxious about health","unworried","unconcerned","stoic (about illness)"],"phonetic":"/ˌæn.taɪˌhaɪ.pəˈkɑn.dri.æk/","extraExplanation":["这是一个较少见、带幽默色彩的构词：anti-（反对、相反）+ hypochondriac（疑病症患者）。常用来形容“完全不担心健康”的人或态度，有时带轻微批评意味：不是不理性担心，而是“太不当回事”。","写作中常与对比手法一起使用：把“hypochondriac（过度担心）”和“antihypochondriac（过度淡定/忽视）”放在同一段里，突出人物性格差异。"]}
{"word":"antihypophora","summary":{"en":"Antihypophora is a rhetorical question left unanswered to prompt the audience to reflect.","zh":"Antihypophora 指提出问题但不直接回答，用来引发听众/读者思考的修辞手法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rhetorical device in which a speaker asks a question and deliberately does not answer it (or leaves the answer to the audience), to create emphasis, suspense, or reflection.","zh":"一种修辞手法：说话者提出问题，但刻意不直接回答（或把答案留给听众/读者），以加强语气、制造悬念或引发思考。"},"examples":[{"en":"What kind of future do we want—and what are we willing to change today?","zh":"我们想要怎样的未来——而今天我们又愿意改变什么？"},{"en":"Who can you trust in a crisis? (The speaker pauses, letting the audience think.)","zh":"在危机中你能相信谁？（说话者停顿，让听众自己思考。）"}]}],"synonyms":["rhetorical question","aporia","erotesis"],"phonetic":"/ˌæn.taɪ.haɪˈpɑː.fə.rə/","extraExplanation":["“antihypophora”非常罕见，常见的近似表达通常直接用“rhetorical question（反问/设问式提问）”或用“aporia（故作疑惑、提出疑问而不解答）”。","构词上：anti- 表示“相反/对立”，hypophora 指“自问自答（先提问再立即回答）”；因此 antihypophora 可理解为“提问但不自答，把答案留给听众”。在实际写作中，多数风格指南并不强调这个术语。"]}
{"word":"antihysteric","summary":{"en":"Antihysteric means calming or used to treat what older medicine called “hysteria,” and it can also refer to such a drug.","zh":"antihysteric 指“抗歇斯底里/镇静”的，也可指用于治疗旧式医学所称“歇斯底里”的药物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medical, somewhat old-fashioned) Used to prevent or relieve hysteria or severe nervous anxiety.","zh":"（医学用语，略显旧式）用于预防或缓解“歇斯底里”或严重紧张焦虑的；镇静的。"},"examples":[{"en":"The doctor prescribed an antihysteric medicine to calm her nerves.","zh":"医生开了抗歇斯底里的药物来安抚她的情绪。"},{"en":"In older texts, some sedatives were described as antihysteric remedies.","zh":"在较早的文献中，一些镇静剂被称为抗歇斯底里的疗法。"}]},{"partOfSpeech":"n.","definition":{"en":"(medical, somewhat old-fashioned) A drug or remedy used to prevent or treat hysteria or severe nervous anxiety.","zh":"（医学用语，略显旧式）抗歇斯底里的药物；用于预防或治疗歇斯底里/严重紧张焦虑的药剂。"},"examples":[{"en":"The pharmacy stocked several antihysterics, including mild sedatives.","zh":"药房备有几种抗歇斯底里的药物，包括一些温和的镇静剂。"},{"en":"Today, doctors rarely use the word “antihysteric” in prescriptions.","zh":"如今医生在处方中很少使用“antihysteric”这个词。"}]}],"synonyms":["anti-anxiety","calming","sedative","tranquilizing","tranquilizer (for the noun sense)"],"phonetic":"ˌæntiˈhɪstərɪk","extraExplanation":["“hysteria（歇斯底里）”一词在历史上常被用于描述情绪激动、焦虑、失控等症状，尤其在19世纪常被不公平地贴在女性身上；现代医学更倾向用更具体、较中性的说法，如“anxiety（焦虑）”“panic disorder（惊恐障碍）”“conversion disorder（转换障碍）”等。","因此“antihysteric”也显得偏旧式或带历史色彩。现代更常见的表达是“anti-anxiety (anxiolytic) medication（抗焦虑药）”“sedative（镇静剂）”“tranquilizer（安定剂）”。"]}

