{"word":"antiface","summary":{"en":"Antiface means a grotesque/comic face or mask, or an exaggerated grimace.","zh":"Antiface 指滑稽怪诞的脸/面具，也可指夸张做作的鬼脸（表情）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a grotesque or comic face, especially a mask or face made to look strange","zh":"（尤指面具上）滑稽、怪诞的脸；丑角式的脸"},"examples":[{"en":"The actor wore an antiface to look like a mischievous clown.","zh":"演员戴着一张怪诞的面具，让自己看起来像个调皮的小丑。"},{"en":"In the old play, the villain appeared with an exaggerated antiface.","zh":"在那出老戏里，反派带着夸张的怪脸登场。"}]},{"partOfSpeech":"n.","definition":{"en":"an unnatural facial expression; a grimace made to amuse or mock","zh":"做作的表情；为了逗乐或嘲弄而做的鬼脸（狰狞表情）"},"examples":[{"en":"Don’t pull an antiface in the photo—just smile naturally.","zh":"拍照别做鬼脸——自然笑就好。"},{"en":"He answered with an antiface, showing he didn’t take the comment seriously.","zh":"他做了个鬼脸作为回应，表示他没把那句话当回事。"}]}],"synonyms":["grimace","pull a face","mask","grotesque face","antic face"],"phonetic":"/ˈæn.tɪˌfeɪs/","extraExplanation":["“antiface”是较少见、带文学/古英语色彩的词，常见于较早的戏剧或诗歌语境。","它与“antic/antique”（滑稽的、怪诞的）有关，历史上常指舞台上的夸张面具或小丑式表情；现代日常英语更常用“grimace”“pull a face”“make a face”。"]}
{"word":"antifaction","summary":{"en":"Antifaction (rare) means a group formed to oppose another faction.","zh":"Antifaction（罕见）指为了反对某一派系而形成的团体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, often written with a hyphen: anti-faction) A group or movement formed to oppose another faction, especially in politics or organizations.","zh":"（罕见，常写作 anti-faction）为反对某一派系而形成的团体或运动，尤用于政治或组织内部。"},"examples":[{"en":"Within the party, an antifaction emerged to challenge the leadership.","zh":"在党内，一个反派系团体出现了，来挑战领导层。"},{"en":"The committee split into a faction and an antifaction, each pushing a different plan.","zh":"委员会分裂成一个派系和一个反派系，各自推动不同的方案。"}]}],"synonyms":["opposition","opposing faction","counterfaction","anti-group"],"phonetic":"/ˌæn.tiˈfæk.ʃən/","extraExplanation":["“antifaction / anti-faction”并不是很常见的标准词；更常见的表达是“an opposing faction（对立派系）”“a counterfaction（对抗派系）”或直接说“the opposition（反对派）”。","在英文里，前缀“anti-”接在名词前时，常用连字符更清楚（如 anti-war, anti-government）。因此写作“anti-faction”更符合常见拼写习惯。"]}
{"word":"antifame","summary":{"en":"“Antifame” most often means negative fame (notoriety), and sometimes means a desire to avoid fame and public attention.","zh":"“Antifame”通常指“以负面方式出名（恶名）”，有时也指“排斥成名、想避开公众关注”的态度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being known in a negative way; bad publicity or notoriety (often used humorously or in modern writing)","zh":"以负面方式出名的状态；恶名、坏名声（常带幽默或现代写作语气）"},"examples":[{"en":"After the scandal, the celebrity gained antifame instead of respect.","zh":"丑闻之后，这位名人得到的不是尊重，而是“恶名”。"},{"en":"The company’s unsafe product launch brought it instant antifame online.","zh":"这家公司不安全的产品发布让它在网上立刻“出名（但很难看）”。"}]},{"partOfSpeech":"n.","definition":{"en":"a preference for avoiding public attention; being “anti-fame” (wanting privacy rather than celebrity)","zh":"对成名或公众关注的排斥；更想要隐私、不想当名人"},"examples":[{"en":"She chose a quiet career out of antifame.","zh":"她因为不想成名而选择了更安静的职业道路。"},{"en":"His antifame attitude keeps him off social media.","zh":"他不追求名气的态度让他远离社交媒体。"}]}],"synonyms":["notoriety","infamy","bad publicity","bad press","negative fame","disgrace"],"phonetic":"ˌæntiˈfeɪm","extraExplanation":["“antifame”不是非常常见的标准词汇，更常见的表达是“notoriety（恶名）”“infamy（臭名）”“bad press（负面报道）”，或说某人“doesn’t want fame / values privacy（重视隐私、不想出名）”。","构词上可理解为“anti-（反对）+ fame（名声）”。在口语、媒体评论或网络写作中，有时用它来强调“出名但不是好名声”，或强调“刻意避开名气”的生活态度。"]}
{"word":"antifanatic","summary":{"en":"Antifanatic means opposed to fanaticism or someone who opposes extreme zeal.","zh":"antifanatic 指“反对狂热主义的”，也可指“反对极端狂热的人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to fanaticism; strongly against extreme or unreasoning devotion to an idea, religion, or cause.","zh":"反对狂热主义的；反对对某种观点、宗教或事业的极端与不理性的迷恋。"},"examples":[{"en":"She took an antifanatic approach, urging everyone to listen before judging.","zh":"她采取了反狂热的态度，主张大家先倾听再下结论。"},{"en":"The essay is antifanatic in tone, warning that certainty can become dangerous.","zh":"这篇文章的语气反对狂热，警告“过度确信”可能变得危险。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who opposes fanaticism or extreme ideological/religious zeal.","zh":"反对狂热主义的人；反对极端思想或宗教狂热的人。"},"examples":[{"en":"As an antifanatic, he argued for moderation and civil debate.","zh":"作为一名反狂热主义者，他主张温和与文明辩论。"}]}],"synonyms":["anti-extremist","anti-fundamentalist","opposed to fanaticism","moderate","anti-zealotry"],"phonetic":"/ˌænti fəˈnætɪk/","extraExplanation":["“antifanatic”较少见，更常见的写法是“anti-fanatic”（带连字符）或用更常用的表达：anti-extremist（反极端主义的）、anti-fundamentalist（反原教旨主义的）、opposed to fanaticism（反对狂热主义）。","词缀提示：anti- 表示“反对/对立”；fanatic 指“狂热者/狂热的”。组合后表达“反对狂热（主义）”。使用时注意语境：它通常强调反对“极端与不理性”，不一定是否定热情或坚定信念本身。"]}
{"word":"antifascism","summary":{"en":"Antifascism means opposition to fascism, often expressed through political action or advocacy.","zh":"Antifascism 指反对法西斯主义，常通过政治行动或倡议来体现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to fascism (a far-right, authoritarian political ideology), especially through political action, organizing, or advocacy.","zh":"反法西斯主义；反对法西斯主义（极右翼、威权主义政治思想），尤其通过政治行动、组织或倡议来反对。"},"examples":[{"en":"After the war, antifascism became a major theme in public memorials and education.","zh":"战后，反法西斯成为公共纪念活动和教育中的重要主题。"},{"en":"The group described its mission as antifascism and community defense.","zh":"该团体将其使命描述为反法西斯与社区防卫。"},{"en":"Many artists used antifascism in their work to warn against dictatorship.","zh":"许多艺术家在作品中融入反法西斯主题，以警惕独裁。"}]}],"synonyms":["anti-fascism","opposition to fascism","anti-authoritarian activism"],"phonetic":"/ˌæn.tiˈfæʃ.ɪ.zəm/","extraExplanation":["“antifascism”常写作“anti-fascism”（有连字符）或“antifascism”（合写）。","它既可以指一种政治立场/理念，也可以指历史中的社会运动（如二战时期及之后的反法西斯运动）。","当代语境中该词有时带有强烈政治色彩，不同国家和媒体可能用它指非常不同的团体或行动；理解时最好结合具体背景与来源。"]}
{"word":"antifascist","summary":{"en":"Antifascist means opposing fascism; it can also mean a person who opposes fascism.","zh":"antifascist 指“反法西斯的”，也可指“反法西斯人士”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to fascism (a far-right, authoritarian political ideology); supporting actions or movements that resist fascist ideas or groups.","zh":"反法西斯的；反对法西斯主义（极右翼、威权政治意识形态）的；支持抵制法西斯思想或团体的行动/运动。"},"examples":[{"en":"Many antifascist activists organize rallies against neo-Nazi groups.","zh":"许多反法西斯活动人士会组织集会，反对新纳粹团体。"},{"en":"The museum exhibit highlights antifascist resistance during World War II.","zh":"这场博物馆展览聚焦二战期间的反法西斯抵抗。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who is opposed to fascism; someone who takes part in antifascist organizing or activism.","zh":"反法西斯人士；反对法西斯主义并参与反法西斯组织/行动的人。"},"examples":[{"en":"He identifies as an antifascist and volunteers with community groups.","zh":"他认同自己是反法西斯人士，并在社区团体做志愿者。"},{"en":"Some antifascists focus on education, while others focus on protests.","zh":"一些反法西斯人士侧重教育宣传，另一些则侧重抗议行动。"}]}],"synonyms":["anti-fascist","anti-authoritarian (context-dependent)","anti-Nazi (in some contexts)"],"phonetic":"/ˌæn.tiˈfæʃ.ɪst/","extraExplanation":["“antifascist”由前缀 anti-（反对）+ fascist（法西斯主义者/法西斯的）构成。","在英语新闻与社交媒体中常见缩写“anti-fascist”或“antifa”（更口语、更具争议色彩）。注意不同国家语境里，它既可能泛指“反法西斯立场”，也可能特指某些松散的行动网络，因此写作时最好说明你指的是“立场/理念”还是“特定群体/活动”。"]}
{"word":"antifascists","summary":{"en":"Antifascists are people who oppose fascism, often through activism or organizing.","zh":"Antifascists 指反对法西斯主义的人，常通过行动或组织活动来表达反对。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who oppose fascism (an extreme authoritarian political ideology), often through activism, organizing, or public protest.","zh":"反对法西斯主义的人（法西斯主义是一种极端威权的政治意识形态），常通过行动主义、组织活动或公开抗议来表达反对。"},"examples":[{"en":"During World War II, many antifascists joined resistance movements in Europe.","zh":"在第二次世界大战期间，许多反法西斯人士加入了欧洲的抵抗运动。"},{"en":"The city saw clashes between antifascists and far-right demonstrators.","zh":"这座城市发生了反法西斯人士与极右翼示威者之间的冲突。"},{"en":"Some antifascists focus on community support and education rather than street protests.","zh":"一些反法西斯人士更关注社区互助与教育，而不是街头抗议。"}]}],"synonyms":["anti-fascists","opponents of fascism","anti-Nazi activists (context-dependent)"],"phonetic":"/ˌæntiˈfæʃɪsts/","extraExplanation":["“antifascists”是“antifascist”的复数。历史上，“反法西斯”常指20世纪30—40年代反对意大利法西斯与德国纳粹的人群与联盟，例如各地的抵抗组织。","当代语境里，该词有时用于泛指反对极右翼与种族主义的行动者；在不同国家与媒体中也可能带有不同的政治立场色彩，使用时最好说明具体语境（例如“反对新纳粹团体的抗议者”）。","相关文学与文化语境：英语里常见“anti-fascist resistance（反法西斯抵抗）”“the Resistance（抵抗运动）”等表述，二战题材作品中会用来描述地下组织与反占领行动。"]}
{"word":"antifat","summary":{"en":"Antifat means “against fat,” either in diet/nutrition (anti–high-fat foods) or in attitudes toward fat bodies (anti–fat acceptance).","zh":"Antifat 表示“反对脂肪”，可指营养层面的“反高脂饮食”，也可指社会文化层面的“反胖/反对接纳胖体型”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Against fat (especially body fat or high-fat foods); opposing fatness or the use/consumption of fat.","zh":"反对脂肪（尤其指身体脂肪或高脂食物）；反对肥胖或反对摄入/使用脂肪。"},"examples":[{"en":"Some older diet advice was strongly anti-fat and encouraged people to avoid oil and butter.","zh":"一些较早的饮食建议非常“反脂肪”，鼓励人们避免食用油和黄油。"},{"en":"She followed an anti-fat eating plan and chose low-fat yogurt instead of full-fat yogurt.","zh":"她遵循一种“反脂肪”的饮食方案，选择低脂酸奶而不是全脂酸奶。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing policies, campaigns, or attitudes that discourage or stigmatize fat bodies; opposed to fat acceptance.","zh":"形容政策、宣传或态度：打压或污名化胖体型；与“接纳胖体型”相对。"},"examples":[{"en":"The article criticized anti-fat attitudes in the workplace.","zh":"这篇文章批评了职场中的反胖（反脂肪）态度。"},{"en":"Some activists argue that anti-fat messaging can harm mental health.","zh":"一些倡议者认为，反胖（反脂肪）的宣传可能损害心理健康。"}]}],"synonyms":["low-fat","anti–high-fat","fatphobic"],"phonetic":"/ˌæn.taɪˈfæt/","extraExplanation":["“antifat”更常见的写法是带连字符的“anti-fat”。在营养语境里通常指“低脂/反高脂”的饮食观念；在社会文化语境里则可能指“反胖”或“对胖人不友好”的态度。阅读时要根据上下文判断是哪一种含义。","在当代英语写作中，讨论身体与身份时更常用的表达包括“fatphobic / fatphobia（恐胖/反胖偏见）”和“body positivity（身体积极）”，语气与立场更明确。"]}
{"word":"antifatigue","summary":{"en":"Anti-fatigue describes something made to reduce tiredness, especially from standing or walking for long periods; it can also refer to the product itself (like a mat or insole).","zh":"Anti-fatigue 指“防疲劳的”，多用于描述能减轻久站或久走疲劳的设计；也可指这类产品本身（如防疲劳垫、鞋垫）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"designed to reduce tiredness (fatigue), especially from standing or working for a long time","zh":"用于减轻疲劳的（尤其指长时间站立或工作带来的疲劳）"},"examples":[{"en":"The cashier stands on an anti-fatigue mat during long shifts.","zh":"收银员在长时间轮班时站在防疲劳垫上。"},{"en":"These anti-fatigue insoles make walking all day more comfortable.","zh":"这种防疲劳鞋垫让全天走路更舒服。"}]},{"partOfSpeech":"n.","definition":{"en":"a product (such as a mat or insole) that reduces tiredness from long periods of standing or walking","zh":"防疲劳用品（如防疲劳垫或鞋垫，能减轻久站或久走造成的疲劳）"},"examples":[{"en":"We bought an anti-fatigue for the kitchen where we stand while cooking.","zh":"我们买了一个厨房用的防疲劳垫，因为做饭时要站很久。"}]}],"synonyms":["fatigue-reducing","comfort","supportive"],"phonetic":"/ˌæn.ti.fəˈtiːɡ/","extraExplanation":["“anti-fatigue”在美式英语里最常见于工作场景和家居用品广告，如 anti-fatigue mat（防疲劳垫）、anti-fatigue floor mat（防疲劳地垫）、anti-fatigue insoles（防疲劳鞋垫）。实际写法常见两种：anti-fatigue（带连字符）和 antifatigue（不带连字符）；带连字符更常见、更清晰。","它通常不是指“提神/抗困”的药物或饮料，而是指通过支撑、缓冲、分散压力等方式减少腿部和脚部疲劳的设计。"]}
{"word":"antifebrile","summary":{"en":"Antifebrile means fever‑reducing; used to describe medicines or effects that lower body temperature.","zh":"Antifebrile 指“退热的”，形容能降低体温、减轻发烧的药物或作用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"used to reduce a fever; fever‑reducing (antipyretic).","zh":"退热的；用于降低发烧的（同 antipyretic）"},"examples":[{"en":"The doctor gave an antifebrile medicine to bring down her temperature.","zh":"医生给了她退热药来降低体温。"},{"en":"Paracetamol (acetaminophen) is commonly used for its antifebrile effect.","zh":"对乙酰氨基酚（扑热息痛）常用于其退热作用。"}]}],"synonyms":["antipyretic","fever-reducing","febrifuge"],"phonetic":"/ˌæn.tiˈfiː.braɪl/","extraExplanation":["“antifebrile”在现代日常英语中相对少见，更常见的医学/药学用词是“antipyretic（退烧的/解热的）”。在说明书、论文或较正式的医学语境里可能会见到。","词源上可拆为 anti-（反、对抗）+ febrile（发热的）。因此字面意思就是“对抗发热的”。"]}
{"word":"antifebrin","summary":{"en":"Antifebrin is an old name for acetanilide, once used to reduce fever and pain but now largely obsolete due to safety concerns.","zh":"Antifebrin 是乙酰苯胺的旧称，曾用于退烧止痛，但因安全性问题如今基本已淘汰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An old brand name for acetanilide, a pain-relieving and fever-reducing drug that is now rarely used because of safety risks.","zh":"乙酰苯胺（acetanilide）的旧商品名；一种止痛、退烧药，如今因安全风险而很少使用。"},"examples":[{"en":"In older medical texts, Antifebrin is listed as a medicine to reduce fever.","zh":"在较早的医学文献中，Antifebrin 被列为用于退烧的药物。"},{"en":"Antifebrin was later replaced by safer fever reducers.","zh":"后来 Antifebrin 被更安全的退烧药所取代。"}]}],"synonyms":["acetanilide"],"phonetic":"/ˌæn.tiˈfiː.brɪn/","extraExplanation":["Antifebrin 是 19 世纪末出现的商品名，主要成分是乙酰苯胺（acetanilide）。它曾用于退烧与止痛，但后来发现可能引起严重不良反应（如高铁血红蛋白血症、肝肾损害等），因此逐渐被更安全的药物（如对乙酰氨基酚/扑热息痛）取代。","词源提示：anti- 表示“反/对”，-febr- 来自拉丁语 febris（“发热”），整体含义是“抗发热的”。在现代英语中更多作为历史或药学语境中的词出现。"]}
{"word":"antifebrine","summary":{"en":"Antifebrine is an outdated name for acetanilide, once used to reduce fever and pain.","zh":"Antifebrine 是乙酰苯胺（acetanilide）的旧称，曾用于退烧和止痛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an old name (trade name) for acetanilide, a medicine once used to reduce fever and relieve pain","zh":"（旧称/商品名）退热冰，即“乙酰苯胺（acetanilide）”，过去曾用于退烧和止痛的药物"},"examples":[{"en":"In some 19th‑century medical texts, antifebrine was recommended for high fever.","zh":"在一些19世纪的医学文献中，antifebrine 被推荐用于高烧。"},{"en":"Because of safety concerns, doctors today use safer fever reducers instead of antifebrine.","zh":"由于安全性问题，如今医生会使用更安全的退烧药，而不是 antifebrine。"}]}],"synonyms":["acetanilide","analgesic","antipyretic"],"phonetic":"/ˌæn.taɪˈfiː.briːn/","extraExplanation":["Antifebrine 是 acetanilide（乙酰苯胺）的旧商品名，属于早期的解热镇痛药。后来发现它可能引起高铁血红蛋白血症等不良反应，因此逐渐被更安全的药物（如对乙酰氨基酚等）取代。","词源提示：anti- 表示“反/抗”，febr- 来自拉丁语 febris（“发热”），整体字面意思接近“抗发热的（药）”。"]}
{"word":"antifederal","summary":{"en":"Antifederal means opposing strong central federal power, or (in U.S. history) relating to the Anti-Federalists who pushed for stronger rights protections.","zh":"antifederal 指反对强势联邦中央权力的；或（美国历史）与反联邦党人相关，他们推动更强的权利保障。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to a strong federal (central) government; favoring more power for local or state governments.","zh":"反对强势联邦（中央）政府的；主张更多权力下放给州或地方政府的。"},"examples":[{"en":"Some voters take an antifederal position when they worry that the national government has too much power.","zh":"当一些选民担心联邦政府权力过大时，他们会采取反联邦的立场。"},{"en":"The proposal was criticized as antifederal because it limited national control over public policy.","zh":"该提案被批评为反联邦的，因为它限制了国家层面对公共政策的控制。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to the U.S. Anti-Federalists (late 1700s), who opposed ratifying the U.S. Constitution without stronger protections for individual rights.","zh":"（美国历史）与“反联邦党人”（18世纪末）相关的；指他们反对在缺乏更强个人权利保障的情况下批准《美国宪法》。"},"examples":[{"en":"Antifederal arguments helped push for the Bill of Rights.","zh":"反联邦党人的论点推动了《权利法案》的出台。"},{"en":"In class, we read antifederal essays alongside the Federalist Papers.","zh":"课堂上，我们把反联邦党人的文章和《联邦党人文集》一起阅读。"}]}],"synonyms":["anti-federal","states’ rights","decentralist","anti-centralization"],"phonetic":"/ˌæn.tiˈfɛd.ɚ.əl/","extraExplanation":["“Anti-Federalist（反联邦党人）”最常出现在美国建国史语境中（约1787–1788）。他们担心新宪法会让中央政府过强、威胁个人自由，因此主张加入明确的权利保障。后来《权利法案》（Bill of Rights）在一定程度上回应了这些担忧。","拼写与用法提示：常见写法有 anti-federal（更直观的“反联邦”）、Anti-Federalist（指特定历史群体或思想），以及 antifederal（较少见的合写，作形容词用）。"]}
{"word":"Antifederalism","summary":{"en":"Antifederalism is the U.S. political movement that opposed a strong federal government, especially during the debates over ratifying the Constitution.","zh":"反联邦主义是美国的一种政治思潮与运动，反对过强的联邦中央政府，尤指宪法批准时期的反对立场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(U.S. history/politics) A movement and set of ideas opposing a strong national (federal) government, especially the opposition to ratifying the U.S. Constitution in the late 1780s.","zh":"（美国历史/政治）反联邦主义：主张反对过强的中央（联邦）政府的政治思潮与运动，尤指18世纪80年代末反对批准《美国宪法》的立场。"},"examples":[{"en":"Antifederalism played a major role in the debate over whether the Constitution should be ratified.","zh":"反联邦主义在“是否应批准宪法”的辩论中起了重要作用。"},{"en":"Many Antifederalists feared that a powerful federal government would threaten individual liberties.","zh":"许多反联邦主义者担心强大的联邦政府会威胁个人自由。"},{"en":"Some of their concerns helped lead to the Bill of Rights.","zh":"他们的一些担忧促成了《权利法案》的出现。"}]}],"synonyms":["Anti-Federalism","states’ rights movement (context-dependent)","opposition to federal power"],"phonetic":"/ˌæn.tiˈfɛd.ə.rəˌlɪz.əm/","extraExplanation":["反联邦主义者（Antifederalists）常主张：权力应更多保留给各州与地方；没有明确保障个人权利的条款，中央政府可能走向专断。与之相对的是联邦主义者（Federalists），他们支持更强的中央政府来改善治理与统一。","历史上常见的相关文本包括《联邦党人文集》（The Federalist Papers，用来支持宪法）以及被称为“反联邦党人文集”（Anti-Federalist Papers，反对或质疑宪法的一系列文章）。","词形提示：Anti-（反对）+ federal（联邦的）+ -ism（主义/思潮）。在现代语境中，antifederalism 有时也可泛指反对中央集权的倾向，但最核心的用法仍指美国建国时期的政治争论。"]}
{"word":"antifederalism","summary":{"en":"Antifederalism is opposition to a strong central government, especially the U.S. movement that opposed the Constitution and supported stronger state power.","zh":"反联邦主义指反对强势中央政府的观点，尤指美国18世纪末反对宪法、强调州权的政治思潮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to a strong central (federal) government; especially the U.S. political movement in the late 1700s that resisted the U.S. Constitution and favored stronger state power and local control.","zh":"反对强大的中央（联邦）政府；尤指18世纪末美国的“反联邦主义”政治思潮，反对《美国宪法》，主张州权更强、地方自治更多。"},"examples":[{"en":"Antifederalism influenced early American politics and helped push for a Bill of Rights.","zh":"反联邦主义影响了早期美国政治，并推动了《权利法案》的诞生。"},{"en":"In class, we compared antifederalism with the Federalists’ vision of a stronger national government.","zh":"课堂上我们把反联邦主义与联邦党人主张的强大国家政府理念作了比较。"}]}],"synonyms":["Anti-Federalism","states’ rights (context-dependent)","opposition to centralized government"],"phonetic":"/ˌæn.tiˈfɛdərəlˌɪzəm/","extraExplanation":["“反联邦主义者”（Anti-Federalists）担心中央政府过强会威胁个人自由与各州自主权，因此要求在通过宪法前加入对公民权利的明确保障，这直接促成了美国宪法前十条修正案——《权利法案》（Bill of Rights）。","注意大小写：作为历史语境中的特定派别或思潮，常写作 Anti-Federalism / Anti-Federalists；作为一般概念时可写作 antifederalism。"]}
{"word":"Antifederalist","summary":{"en":"An Antifederalist was someone who opposed the U.S. Constitution as originally written and wanted stronger state power and a Bill of Rights.","zh":"反联邦党人指在美国建国初期反对当时版本《美国宪法》、主张州权更强并要求加入《权利法案》的人（也可作形容词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person in the late 1700s United States who opposed the U.S. Constitution as written and argued for stronger state governments and a Bill of Rights","zh":"（18世纪末美国）反联邦党人：反对当时制定的《美国宪法》版本，主张州政府更强、并要求加入《权利法案》的人"},"examples":[{"en":"Many Antifederalists feared the new national government would become too powerful.","zh":"许多反联邦党人担心新的中央政府会变得过于强大。"},{"en":"Antifederalists supported adding a Bill of Rights to protect individual freedoms.","zh":"反联邦党人支持加入《权利法案》来保护个人自由。"}]},{"partOfSpeech":"adj.","definition":{"en":"opposing a strong central (federal) government, especially in the historical debate over the U.S. Constitution","zh":"（尤指美国制宪历史语境中）反对强势联邦（中央）政府的"},"examples":[{"en":"Patrick Henry is often described as an Antifederalist leader.","zh":"帕特里克·亨利常被称为反联邦党领袖。"},{"en":"The newspaper printed several Antifederalist arguments against the Constitution.","zh":"这家报纸刊登了几篇反联邦党人反对宪法的论述。"}]}],"synonyms":["opponent of ratification","states’ rights advocate"],"phonetic":"/ˌæn.tiˈfɛd.ɚ.ə.lɪst/","extraExplanation":["反联邦党人（Antifederalists）与联邦党人（Federalists）是美国建国初期围绕《美国宪法》是否应被批准（ratified）的两大阵营。反联邦党人担忧中央政府权力过大、可能侵犯公民自由，因此强调“州权”（states’ rights）并推动加入《权利法案》（Bill of Rights）。","常见历史文本：联邦党人的观点多见于《联邦党人文集》（The Federalist Papers）；反联邦党人的文章常以不同笔名发表，后被汇编为《反联邦党人文集》（Anti-Federalist Papers）。阅读时可注意其常谈的主题：权力制衡、代表性、税收与军队、个人权利保障。"]}
{"word":"antifederalist","summary":{"en":"An Antifederalist was a late-1700s American who opposed the proposed U.S. Constitution, fearing an overly strong federal government; the word can also describe ideas in that tradition.","zh":"Antifederalist 指18世纪末反对最初《美国宪法》、担心联邦政府过强的人；也可作形容词表示反联邦思想或立场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person in the late 1700s who opposed the U.S. Constitution as first proposed, usually because they feared a too-powerful national (federal) government and wanted stronger protection for individual rights and states’ powers.","zh":"（18世纪末）反联邦党人：反对最初版本《美国宪法》的人，通常因为担心联邦政府权力过大，并希望更强的个人权利保障与州权。"},"examples":[{"en":"Many Antifederalists argued that the new Constitution needed a Bill of Rights.","zh":"许多反联邦党人认为新宪法必须加入《权利法案》。"},{"en":"In some states, Antifederalists worried that the federal government would overpower local decision-making.","zh":"在一些州，反联邦党人担心联邦政府会压过地方的决策权。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to or expressing the ideas of the Antifederalists (especially suspicion of centralized power and support for states’ rights).","zh":"反联邦党人的；体现反联邦思想的（尤指对中央集权的警惕、支持州权）。"},"examples":[{"en":"The pamphlet took an Antifederalist tone, warning against centralized authority.","zh":"这本小册子带有反联邦党人的语气，警告要警惕中央集权。"},{"en":"Some historians describe certain speeches as Antifederalist in spirit.","zh":"一些历史学家认为某些演讲在精神上属于反联邦派。"}]}],"synonyms":["anti-Constitution (historical context)","states’ rights advocate (overlapping idea)"],"phonetic":"/ˌæntiˈfɛd(ə)rəlɪst/","extraExplanation":["“Antifederalist”常见于美国建国史语境，尤其是1787–1788年围绕宪法批准（ratification）的辩论。反联邦党人并非完全“反对联邦”，而是反对当时设想的强中央政府模式。","他们的主要诉求之一是加入明确保障自由的条款，这直接推动了1791年《权利法案》（Bill of Rights）的通过。","常与“Federalist（联邦党人）”对照；《联邦党人文集》（The Federalist Papers）是支持宪法的一方写的，而反联邦派也写过许多文章与小册子（常被后人汇编为“Antifederalist Papers”）。"]}
{"word":"antifelon","summary":{"en":"“Antifelon” (more often “anti-felon”) describes an attitude, policy, or person opposed to felons or to restoring felons’ rights.","zh":"“antifelon”（更常写作“anti-felon”）指反对重罪犯或反对恢复重罪犯相关权利的立场、政策或人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to people convicted of serious crimes (felons), or favoring policies that restrict felons’ rights or opportunities.","zh":"反对重罪犯（felon）或主张限制重罪犯权利、机会的（立场/政策）。"},"examples":[{"en":"Some voters supported an anti-felon law that limited voting rights after prison.","zh":"一些选民支持一项反重罪犯的法律，限制出狱后的投票权。"},{"en":"The group criticized what it called an anti-felon attitude in the media.","zh":"该团体批评媒体中所谓的“反重罪犯”态度。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or group that is strongly opposed to felons or to giving felons certain rights.","zh":"强烈反对重罪犯、或反对给予重罪犯某些权利的人（或团体）。"},"examples":[{"en":"Anti-felons argued against restoring voting rights.","zh":"反重罪犯者反对恢复投票权。"}]}],"synonyms":["anti-criminal (context-dependent)","tough-on-crime (sometimes related)","opposed to felon re-enfranchisement (specific)"],"phonetic":"ˌæntaɪˈfiːlən","extraExplanation":["“antifelon / anti-felon”并不是非常常见的标准词条，更常见的写法是加连字符的“anti-felon”，多见于新闻评论、政治讨论或标签式用法。","构词上由前缀“anti-（反对）”+“felon（重罪犯）”组成。它通常带有立场色彩，语气可能偏强或带评价。更中性表达可用“opposed to felons’ rights（反对重罪犯权利）”或具体说明“opposed to restoring voting rights for felons（反对恢复重罪犯投票权）”。"]}
{"word":"antifelony","summary":{"en":"“Antifelony” means opposing felony charges or supporting policies that reduce crimes from felonies to less serious offenses.","zh":"“Antifelony”指反对重罪指控/重罪化，或支持把某些行为从重罪降为较轻的罪名。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to felonies, felony charges, or policies that treat crimes as felonies; supporting reducing or avoiding felony-level punishment (often used in legal/political writing).","zh":"反对重罪（felony）或反对以重罪定罪/处罚的政策；支持降低为非重罪或避免重罪化（多见于法律或政治语境）。"},"examples":[{"en":"Some advocates promote antifelony reforms for low-level drug possession.","zh":"一些倡议者推动对低量毒品持有的“反重罪化”改革。"},{"en":"The group took an antifelony stance, arguing that the offense should be a misdemeanor.","zh":"该团体持反重罪立场，主张该行为应定为轻罪（misdemeanor）。"}]}],"synonyms":["anti-felony","opposed to felony prosecution","anti-felonization","favoring misdemeanor treatment","against felony charges"],"phonetic":"/ˌæn.tiˈfɛl.ə.ni/","extraExplanation":["“antifelony”不是非常常见的标准词，更多属于由前缀 anti-（反对）+ felony（重罪）临时组合出来的写法；实际文本中也常见成对的表达，如“anti-felony legislation / anti-felony reforms”。","在美国法律语境里，felony（重罪）与 misdemeanor（轻罪）区分会影响刑期、是否入狱、是否成为重罪犯记录，以及就业、投票权等后续影响；因此“antifelony”常隐含“反对过度重罪化（over-felonization）”的立场。","写作中更常见的替代表达包括：“anti-felony charging,” “opposed to felony prosecution,” 或更明确的 “in favor of reducing felonies to misdemeanors”。"]}
{"word":"antifemale","summary":{"en":"“Antifemale” means against women or showing prejudice/hostility toward females; it can also refer to a thing or message that harms women’s rights or status.","zh":"“antifemale”指“反女性的、对女性有偏见/敌意的”，也可指“反女性的言论/观念/政策”等对女性权利或地位不利的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to women or girls; showing prejudice or hostility toward females.","zh":"反女性的；对女性抱有偏见或敌意的。"},"examples":[{"en":"Some people criticized the ad as antifemale because it portrayed women as less capable than men.","zh":"一些人批评这则广告“反女性”，因为它把女性描绘得不如男性有能力。"},{"en":"Policies that restrict women’s education are widely seen as antifemale.","zh":"限制女性受教育的政策通常被认为是反女性的。"}]},{"partOfSpeech":"n.","definition":{"en":"Something (an idea, rule, message, etc.) that is against women or harms women’s status or rights.","zh":"反女性的事物（如观念、规则、言论等）；对女性地位或权利不利的内容。"},"examples":[{"en":"She called the comment an antifemale message that encourages discrimination.","zh":"她称这条评论是在传播反女性的信息，会助长歧视。"}]}],"synonyms":["anti-woman","anti-women","misogynistic","sexist (against women)"],"phonetic":"/ˌæntiˈfiːmeɪl/","extraExplanation":["“antifemale”在日常英语里不算常见，更常见、更自然的说法是“anti-woman / anti-women”或“misogynistic（厌女的）”。其中“misogynistic”语气更强，通常指对女性的系统性贬低、仇视或歧视。","这是一个带强烈价值判断的词，用于指出性别偏见时要注意语境与证据：可以描述“a comment/ad/policy is antifemale”，并说明哪里不公平，以避免变成单纯的攻击。"]}
{"word":"antifeminine","summary":{"en":"Antifeminine can mean either “anti-feminist” (against women’s equality) or “not traditionally feminine” in style; context matters.","zh":"antifeminine 可指“反女权”（反对女性平等），也可指风格上“不传统女性化”；需看语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to feminism, women’s rights, or ideas that support women’s equality.","zh":"反对女权主义、女性权利或支持性别平等的观点。"},"examples":[{"en":"Some people criticized the policy as antifeminine because it limited women’s opportunities.","zh":"一些人批评该政策“反女权”，因为它限制了女性的机会。"},{"en":"The author was accused of writing antifeminine comments online.","zh":"这位作者被指责在网上发表反女权的言论。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not traditionally feminine in style or appearance; deliberately masculine or gender-neutral.","zh":"（风格或外观）不符合传统“女性化”特征的；刻意偏男性化或中性化的。"},"examples":[{"en":"Her outfit had an antifeminine look—simple, dark, and tailored.","zh":"她的穿搭看起来很“不女性化”——简洁、深色、剪裁利落。"},{"en":"The brand promoted an antifeminine aesthetic to challenge stereotypes.","zh":"该品牌主打“不女性化”的审美，以挑战刻板印象。"}]}],"synonyms":["anti-feminist","unfeminine","masculine","androgynous","gender-neutral"],"phonetic":"/ˌæntiˈfɛmənɪn/","extraExplanation":["“anti-”表示“反对/抵制”，而“feminine”既可指“女性气质/女性化风格”，也可能被引申到与“女权/女性议题”相关的语境。现实使用中，前一种（外观或风格“不女性化”）与第二种（反女权）容易混淆，写作时最好用更明确的词：例如用 “anti-feminist” 表示“反女权”，用 “masculine,” “androgynous,” 或 “not traditionally feminine” 表示风格。","这个词可能带有价值判断或冒犯性，尤其当它被用来评价某个人“不像女人”。在讨论性别表达时，更中性的说法通常更礼貌、更准确。"]}
{"word":"antifeminism","summary":{"en":"Antifeminism means opposition to feminism and to movements for gender equality.","zh":"Antifeminism 指反对女权主义及推动性别平等的运动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to feminism, or to feminist ideas and movements that seek political, economic, and social equality for women and other genders.","zh":"反对女权主义；反对以性别平等为目标的女权思想或女权运动。"},"examples":[{"en":"The article criticizes antifeminism in politics and calls for equal pay.","zh":"这篇文章批评政治中的反女权主义，并呼吁同工同酬。"},{"en":"Some people confuse antifeminism with simply disagreeing on one issue, but the term usually refers to broader opposition to feminism.","zh":"有些人把反女权主义误解为只是对某个议题有不同意见，但这个词通常指对女权主义更广泛的反对。"}]}],"synonyms":["opposition to feminism","anti-feminist ideology"],"phonetic":"/ˌæn.tiˈfɛm.əˌnɪ.zəm/","extraExplanation":["“anti-”表示“反对”，加上“feminism（女权主义）”构成“antifeminism”。在讨论中要注意区分：对某项具体政策的批评（例如某个法律条文）不一定等同于“反女权主义”，但若否定性别平等目标或系统性反对女权运动，往往会被称为“antifeminism”。","语境上，这是一个带强烈立场色彩的词，常用于政治、媒体与社会评论。写作时可以根据需要选择更中性的表达，如“opposition to feminism（反对女权主义）”或更具体地说明反对的对象与理由。"]}
{"word":"antifeminist","summary":{"en":"“Antifeminist” describes someone or something opposed to feminism; it can also mean a person who opposes feminism.","zh":"antifeminist 指“反女权主义的”，也可指“反女权主义者”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to feminism or to feminist ideas, movements, or policies; believing that women should not pursue (or should not be supported in pursuing) equal rights and opportunities in society.","zh":"反女权主义的；反对女权主义或女权理念/运动/政策的；认为女性不应追求（或不应被支持追求）社会中的平等权利与机会的。"},"examples":[{"en":"Some people criticized the article as antifeminist because it blamed women for workplace inequality.","zh":"有人批评那篇文章带有反女权主义色彩，因为它把职场不平等归咎于女性。"},{"en":"He said he supports equal pay, so he doesn’t consider himself antifeminist.","zh":"他说他支持同工同酬，所以不认为自己是反女权主义者。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who opposes feminism or feminist movements.","zh":"反女权主义者；反对女权主义或女权运动的人。"},"examples":[{"en":"In the debate, an antifeminist argued that traditional gender roles should be protected.","zh":"在辩论中，一位反女权主义者主张应该保护传统性别角色。"},{"en":"Calling someone an antifeminist can be a strong accusation, so it’s important to be precise about what they said or did.","zh":"把某人称为反女权主义者可能是很强烈的指控，所以最好准确说明对方具体说了什么或做了什么。"}]}],"synonyms":["anti-feminist","opposed to feminism","anti–women’s rights (context-dependent)"],"phonetic":"/ˌæntiˈfɛmənɪst/","extraExplanation":["“anti-”表示“反对/对抗”，因此 antifeminist 字面意思就是“反对女权主义的人或事”。在公共讨论中，这个词常带有批评色彩；有些人会用更中性的说法来区分立场，比如 “critical of some feminist ideas（对某些女权观点持批评态度）”。","相关词可对比：feminist（女权主义者/女权的）、anti-feminism（反女权主义，名词）、misogynistic（厌女的，强调对女性的憎恶/偏见，不等同于 antifeminist 但有时会被混用）。"]}
{"word":"antifeministic","summary":{"en":"“Antifeministic” means against feminism or feminist efforts for gender equality.","zh":"“antifeministic”指反对女权主义或反对推动性别平等的女权努力。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to feminism, feminist ideas, or efforts to achieve gender equality.","zh":"反女权的；反对女权主义、女权观点或推动性别平等的努力。"},"examples":[{"en":"Some commentators described his remarks as antifeministic.","zh":"一些评论员把他的言论称为反女权的。"},{"en":"The article takes an antifeministic stance on workplace equality policies.","zh":"这篇文章对职场平等政策持反女权立场。"}]}],"synonyms":["anti-feminist","anti-feminism","opposed to feminism","counterfeminist"],"phonetic":"/ˌæn.tiˈfɛm.əˌnɪs.tɪk/","extraExplanation":["“antifeministic”常见于媒体评论或学术讨论中，用来概括“反对女权/反对性别平等倡议”的立场。日常表达里更常见的是“anti-feminist”。","使用时注意区分：批评某一位女权作者或某一项具体政策（policy critique）不一定等同于“反女权”；但如果是否定女性争取平等的整体目标或价值，才更符合该词的核心含义。","语气与礼貌：这个词通常带有明显评价色彩（多为负面），在讨论中可用更中性的说法来避免贴标签，例如“critical of feminism（对女权持批评态度）”或“opposed to some feminist ideas（反对某些女权观点）”。"]}
{"word":"antiferment","summary":{"en":"Antiferment means a substance that prevents or slows fermentation; it’s a rare/older term often replaced by ‘preservative’ or ‘fermentation inhibitor.’","zh":"antiferment 指“抗发酵剂”，即抑制或减缓发酵的物质；该词较少见/偏旧，常用 preservative 或 fermentation inhibitor 替代。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance that prevents or slows fermentation (the process where yeast or bacteria turn sugars into alcohol, acids, or gas).","zh":"抗发酵剂；抑制或减缓发酵过程（如酵母或细菌把糖转化为酒精、酸或气体）的物质。"},"examples":[{"en":"Salt can act as an antiferment in some foods by slowing bacterial activity.","zh":"盐在某些食物中可以起到抗发酵剂的作用，因为它能减缓细菌活动。"},{"en":"The recipe uses an antiferment to keep the mixture from fermenting during storage.","zh":"这个配方使用了抗发酵剂，以防止混合物在储存期间发生发酵。"}]},{"partOfSpeech":"n.","definition":{"en":"(older or technical) an agent used to stop unwanted microbial growth, often similar in function to a preservative or antiseptic.","zh":"（较旧或技术性用法）用于阻止不需要的微生物生长的药剂，功能常类似防腐剂或消毒剂。"},"examples":[{"en":"In older medical writing, certain chemicals were described as antiferments.","zh":"在较早的医学文献中，一些化学物质被称为“抗发酵剂”。"}]}],"synonyms":["preservative","fermentation inhibitor","antiseptic","inhibitor"],"phonetic":"/ˌæntiˈfɝːmənt/","extraExplanation":["“antiferment”在现代英语中较少见，常见的替代说法是“preservative（防腐剂）”“fermentation inhibitor（发酵抑制剂）”或在医学语境中用“antiseptic（消毒剂）”。","词形上由“anti-（反、抗）+ ferment（发酵/发酵剂）”构成。早期化学与医学写作里，有时把“腐败/发酵”与微生物活动联系在一起，因此用该词泛指抑制这类过程的物质。"]}
{"word":"antifermentative","summary":{"en":"Antifermentative means “able to stop or slow down fermentation.”","zh":"antifermentative 指“能抑制或减缓发酵的（抗发酵的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology/medicine) Preventing or reducing fermentation, especially by inhibiting the growth or activity of microorganisms that ferment sugars.","zh":"（生物/医学）抗发酵的；抑制或减少发酵（常指抑制能发酵糖类的微生物生长或活性）。"},"examples":[{"en":"The lab tested whether the extract had antifermentative effects on yeast.","zh":"实验室测试这种提取物是否对酵母有抗发酵作用。"},{"en":"Some preservatives are used for their antifermentative action in beverages.","zh":"某些防腐剂用于饮料中，因为它们具有抑制发酵的作用。"}]}],"synonyms":["anti-fermentative","fermentation-inhibiting","antimicrobial (in some contexts)"],"phonetic":"/ˌæn.ti.fərˈmɛn.tə.tɪv/","extraExplanation":["这个词多出现在微生物学、药理学和食品科学语境中，强调“抑制发酵过程”而不是“改变风味”。常见搭配有 antifermentative effect / action（抗发酵作用）。","构词法：anti-（反、抗）+ ferment（发酵）+ -ative（形容词后缀），字面意思就是“反发酵的/抗发酵的”。"]}
{"word":"antiferroelectric","summary":{"en":"Antiferroelectric describes materials whose electric dipoles align oppositely and largely cancel out, giving little net polarization unless a strong electric field is applied.","zh":"Antiferroelectric（反铁电）指材料中电偶极相邻反向排列、整体极化基本相互抵消；通常需外加强电场才会出现明显极化。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Materials science) describing a material in which neighboring electric dipoles align in opposite directions, so the net electric polarization is close to zero unless an external electric field is applied.","zh":"（材料科学）指一种材料中相邻的电偶极矩以相反方向排列，因此整体（净）电极化接近于零；在外加电场作用下才可能出现明显极化。"},"examples":[{"en":"Some perovskite ceramics show antiferroelectric behavior at room temperature.","zh":"一些钙钛矿结构陶瓷在室温下表现出反铁电行为。"},{"en":"Under a strong electric field, an antiferroelectric material may switch to a highly polarized state.","zh":"在强电场下，反铁电材料可能会转变到高度极化的状态。"}]},{"partOfSpeech":"n.","definition":{"en":"a material that has antiferroelectric properties.","zh":"反铁电材料；具有反铁电性质的物质。"},"examples":[{"en":"Researchers tested an antiferroelectric for high-energy-density capacitors.","zh":"研究人员测试了一种反铁电材料，用于高能量密度电容器。"}]}],"synonyms":["antiferroelectric material","antipolar (in materials context)"],"phonetic":"/ˌæn.tiˌfɛr.oʊ.ɪˈlɛk.trɪk/","extraExplanation":["“antiferroelectric（反铁电）”常与“ferroelectric（铁电）”对比理解：铁电材料在无外电场时也能保持自发极化并可翻转，而反铁电材料的偶极多为“相邻相反”，整体抵消，因此通常没有明显的自发极化。","反铁电材料在强电场下可能出现“场致相变”（从反铁电到类似铁电的高极化状态），这也是它们常用于高能量密度电容器、储能器件研究的原因之一。","词形上：anti- 表示“反、对立”，ferro- 源自拉丁语 ferrum（铁），但在“铁电/反铁电”中并不意味着材料一定含铁，而是一种历史命名沿用。"]}
{"word":"antiferromagnet","summary":{"en":"An antiferromagnet is a material whose neighboring spins point in opposite directions, resulting in almost no net magnetization.","zh":"antiferromagnet（反铁磁体）指相邻自旋方向相反排列、整体磁化几乎为零的材料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of magnetic material in which neighboring atomic magnets (spins) align in opposite directions, so the material has little or no overall magnetism.","zh":"一种磁性材料：相邻原子磁矩（自旋）方向相反排列，因此整体几乎没有或只有很弱的磁性。"},"examples":[{"en":"Many transition-metal oxides are antiferromagnets at low temperatures.","zh":"许多过渡金属氧化物在低温下表现为反铁磁体。"},{"en":"In an antiferromagnet, the spins cancel each other out overall.","zh":"在反铁磁体中，自旋总体上相互抵消。"}]}],"synonyms":["antiferromagnetic material"],"phonetic":"/ˌæn.tiˌfɛr.oʊˈmæɡ.nɪt/","extraExplanation":["“anti-”表示“相反/对立”，“ferromagnet”指“铁磁体”。反铁磁体与铁磁体（自旋大体同向、磁性强）相对；也与“顺磁体/抗磁体”不同，它强调的是自旋的“有序但相反”排列。","反铁磁材料在自旋电子学（spintronics）中很重要：因为它们整体磁化很小，不易被外界磁场干扰，同时内部自旋结构仍可用来存储/传输信息。"]}
{"word":"antiferromagnetic","summary":{"en":"Antiferromagnetic describes a material whose neighboring magnetic moments point in opposite directions, producing little or no net magnetism.","zh":"antiferromagnetic 指材料中相邻磁矩反向排列、彼此抵消，因此整体磁性很弱或几乎没有。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(In physics/materials) having a magnetic structure in which neighboring atoms’ magnetic moments line up in opposite directions, so the material has little or no overall magnetism.","zh":"（物理/材料）反铁磁性的：相邻原子的磁矩（小磁针方向）彼此反向排列，因此整体磁性很弱或几乎为零。"},"examples":[{"en":"Nickel oxide (NiO) is an antiferromagnetic material at room temperature.","zh":"氧化镍（NiO）在室温下是一种反铁磁性材料。"},{"en":"Below the Néel temperature, the crystal becomes antiferromagnetic.","zh":"低于尼尔温度后，晶体会变成反铁磁性状态。"}]}],"synonyms":["antiferromagnetic (ordered)","AFM (abbr., in context)"],"phonetic":"/ˌæn.taɪˌfɛr.oʊ.mæɡˈnɛtɪk/","extraExplanation":["词形拆解：anti-（反、对抗）+ ferro-（铁；也常用来指“铁磁”相关）+ magnetic（磁的）。这里的“ferro”更多是历史命名沿用，不表示一定含铁。","对比记忆：ferromagnetic（铁磁/强磁，磁矩大致同向排列，整体磁性强）；antiferromagnetic（反铁磁，相邻反向，整体抵消）；paramagnetic（顺磁，外磁场下才弱弱被吸引）。","常见搭配：antiferromagnetic order（反铁磁有序）、antiferromagnetic coupling（反铁磁耦合）、Néel temperature（尼尔温度，反铁磁有序消失的临界温度）。"]}
{"word":"antiferromagnetism","summary":{"en":"Antiferromagnetism is magnetism where neighboring spins point in opposite directions and cancel out, giving little or no net magnetization.","zh":"反铁磁性指相邻自旋反向排列并相互抵消，使材料几乎没有净磁化的磁性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of magnetism in which neighboring atomic “spins” align in opposite directions with equal strength, so the material has (almost) no overall magnetization.","zh":"一种磁性：相邻原子的“自旋”以相反方向、且强度相当的方式排列，因此材料整体（几乎）没有净磁化。"},"examples":[{"en":"Antiferromagnetism is common in some transition-metal oxides.","zh":"反铁磁性常见于一些过渡金属氧化物中。"},{"en":"Below a certain temperature, the crystal shows antiferromagnetism instead of ferromagnetism.","zh":"低于某个温度时，这种晶体表现出反铁磁性而不是铁磁性。"}]},{"partOfSpeech":"n.","definition":{"en":"The field of study or set of phenomena related to antiferromagnetic ordering in materials.","zh":"与材料中反铁磁有序相关的一类现象或研究领域。"},"examples":[{"en":"Modern spintronics has renewed interest in antiferromagnetism.","zh":"现代自旋电子学重新激发了人们对反铁磁性的兴趣。"}]}],"synonyms":["antiferromagnetic order","antiferromagnetic ordering"],"phonetic":"/ˌænˌtaɪˌfɛroʊˈmæɡnəˌtɪzəm/","extraExplanation":["“anti-”表示“反、对立”；“ferro-”源自拉丁语 ferrum（铁），历史上最早研究的强磁性材料多与铁有关，所以很多磁学术语沿用这一词根。反铁磁并不等于“完全没有磁性”，而是微观上有序、宏观上净磁化相互抵消。","常见相关概念：Néel temperature（尼尔温度，反铁磁有序消失的临界温度）；ferrimagnetism（亚铁磁性，方向相反但强度不等，因此仍有净磁化）。"]}
{"word":"antifertility","summary":{"en":"Antifertility means ‘preventing pregnancy or reducing fertility,’ and it can also refer to a drug or method used to do this.","zh":"antifertility 指“抗生育/避孕的（降低生育力、阻止受孕的）”，也可指用于避孕的药物或方法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Preventing pregnancy or reducing fertility; used for methods, medicines, or substances that stop conception.","zh":"抗生育的；避孕的；用于指阻止受孕或降低生育能力的方法、药物或物质。"},"examples":[{"en":"The clinic provides antifertility medication as part of family planning services.","zh":"这家诊所提供抗生育（避孕）药物，作为计划生育服务的一部分。"},{"en":"Some antifertility methods require a doctor’s advice to use safely.","zh":"一些抗生育（避孕）方法需要在医生指导下安全使用。"}]},{"partOfSpeech":"n.","definition":{"en":"A method, drug, or substance that prevents pregnancy or reduces fertility.","zh":"抗生育剂；避孕药（或方法、物质）；指能阻止受孕或降低生育能力的东西。"},"examples":[{"en":"The researchers tested a new antifertility in animal studies.","zh":"研究人员在动物实验中测试了一种新的抗生育剂。"},{"en":"Access to safe antifertility options can affect public health outcomes.","zh":"获得安全的抗生育选择会影响公共卫生结果。"}]}],"synonyms":["contraceptive","birth-control","anti-conception"],"phonetic":"/ˌæn.ti.fɚˈtɪl.ə.t̬i/","extraExplanation":["“antifertility”常见于医学、公共卫生和学术写作中；日常英语里更常用的是“contraceptive”（避孕的/避孕药）或“birth control”（避孕）。","构词：anti-（反、抗）+ fertility（生育力）。因此它是比较“书面/技术性”的表达。使用时注意语境与语气，避免对个人生育选择作价值判断。"]}
{"word":"antifertilizer","summary":{"en":"An uncommon term for something that prevents fertilization or reduces fertility (in animals/humans or plants).","zh":"不太常见的词，指阻止受精或降低生育/繁殖能力的物质或方法（用于人/动物或植物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A substance or treatment that prevents or reduces fertilization (the joining of egg and sperm), especially in biology or medicine.","zh":"抗受精剂；抑制受精的物质或处理方式（阻止或降低精子与卵子的结合），多用于生物学或医学语境。"},"examples":[{"en":"Researchers tested an antifertilizer to block sperm from attaching to the egg.","zh":"研究人员测试了一种抗受精剂，以阻止精子附着到卵子上。"},{"en":"The paper discusses possible antifertilizer compounds for non-hormonal contraception.","zh":"论文讨论了可用于非激素避孕的潜在抗受精化合物。"}]},{"partOfSpeech":"n.","definition":{"en":"A substance that reduces fertility in plants (e.g., by preventing pollination or seed formation); used mainly in technical or experimental contexts.","zh":"抑制植物结实/繁殖的物质（如阻止授粉或种子形成）；多见于技术或实验语境。"},"examples":[{"en":"In the experiment, an antifertilizer spray was applied to prevent seed production.","zh":"在实验中，研究人员喷洒了抗受精剂以防止产生种子。"},{"en":"Some invasive species are controlled by methods that act like an antifertilizer.","zh":"一些入侵物种会用类似“抗受精”的方法来控制其繁殖。"}]}],"synonyms":["contraceptive (common in human context)","anti-fertility agent","fertility inhibitor","sterilant (sometimes, depending on context)"],"phonetic":"/ˌæn.tiˈfɝː.təlˌaɪ.zɚ/","extraExplanation":["“antifertilizer”不是非常常见的日常词，更常见的说法是 contraception（避孕）、contraceptive（避孕的/避孕药具）、anti-fertility agent（抗生育剂）、fertility inhibitor（生育/繁殖抑制剂）。","构词上：anti-（反、抑制）+ fertilizer（使受精/使能繁殖的东西；也常指“肥料”）。在农业里如果你想表达“抑制植物繁殖/结籽”，用 fertility inhibitor 或 seed-set inhibitor 往往更清晰，避免与“肥料 fertilizer（肥料）”混淆。"]}
{"word":"antifeudal","summary":{"en":"Antifeudal describes opposition to feudalism or efforts to abolish feudal social hierarchies.","zh":"antifeudal 指“反封建的”，即反对封建制度或致力于废除封建等级结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to feudalism (a social and political system based on lords, vassals, and peasants) or working to end it.","zh":"反封建的；反对封建制度的（封建制度指以领主—附庸—农民等等级关系为基础的社会与政治体系）。"},"examples":[{"en":"The novel includes antifeudal themes, criticizing rigid social hierarchies.","zh":"这部小说包含反封建主题，批判僵化的社会等级。"},{"en":"Many reformers supported antifeudal movements to reduce landlord power.","zh":"许多改革者支持反封建运动，以削弱地主权力。"}]}],"synonyms":["anti-feudal","anti-feudalist","anti-feudalism","anti-aristocratic","egalitarian"],"phonetic":"/ˌæn.taɪˈfjuː.dəl/","extraExplanation":["“antifeudal”常见于历史、政治与文学评论语境，用来描述反对或批判“封建制度/封建思想”的立场。英语里更常见的拼写是 **anti-feudal**（加连字符）或更常用的同义表达 **anti-feudalism / anti-feudalist**（指思想或人）。","在中文语境里“封建”有时被扩展为“守旧、家长制、等级观念”等泛指含义；但在英语学术语境中，**feudalism**通常更偏向中世纪欧洲的具体制度背景。阅读时可根据上下文判断是“历史制度”还是“思想/社会等级”的批判。"]}
{"word":"antifeudalism","summary":{"en":"Antifeudalism means opposition to feudal systems and feudal privileges.","zh":"antifeudalism 指反对封建制度及封建特权的思想或立场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to feudalism (a social and political system where landowning nobles control land and peasants/serfs work it), and support for ending feudal privileges and hierarchy.","zh":"反封建主义；反对封建制度（地主贵族掌控土地、农民/农奴依附劳动的社会政治体系），主张废除封建特权与等级关系。"},"examples":[{"en":"Many reformers promoted antifeudalism to abolish hereditary privileges.","zh":"许多改革者倡导反封建主义，以废除世袭特权。"},{"en":"The movement’s antifeudalism focused on land reform and legal equality.","zh":"该运动的反封建主义主要聚焦于土地改革与法律平等。"}]}],"synonyms":["anti-feudalism","opposition to feudalism","anti-aristocratic movement"],"phonetic":"/ˌæn.tiˈfjuː.dəlˌɪz.əm/","extraExplanation":["该词由前缀 anti-（“反对”）+ feudalism（“封建主义/封建制度”）构成，常见于历史、政治学与社会运动语境中。","不同国家语境下，“封建”所指可能不完全相同：在欧洲通常指中世纪的领主—附庸与庄园制度；在东亚语境里，有时也泛指宗法等级、土地占有不平等或旧式特权结构。阅读史料时可留意作者采用的是哪种定义。"]}
{"word":"antifeudalist","summary":{"en":"Antifeudalist means opposing feudalism or someone who works to end feudal systems and privileges.","zh":"antifeudalist 指反对封建制度（或主张废除封建特权）的人或立场。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to feudalism (a social system where powerful lords control land and people), or working to end feudal privileges and landlord power.","zh":"反对封建制度的；主张消除封建特权与地主势力的。"},"examples":[{"en":"Many antifeudalist movements called for land reform and equal rights.","zh":"许多反封建运动呼吁土地改革与平等权利。"},{"en":"The novel portrays an antifeudalist hero who challenges an unjust landlord.","zh":"这部小说塑造了一位反封建的英雄，敢于挑战不公的地主。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who opposes feudalism or supports ending feudal systems and privileges.","zh":"反封建者；反对封建制度、支持废除封建特权的人。"},"examples":[{"en":"She was remembered as an antifeudalist who spoke for poor farmers.","zh":"人们记得她是一位为贫苦农民发声的反封建者。"},{"en":"The antifeudalists organized meetings to discuss education and land rights.","zh":"反封建者组织集会讨论教育与土地权利。"}]}],"synonyms":["anti-feudal","anti-feudalism","reformist (context-dependent)","egalitarian (context-dependent)"],"phonetic":"/ˌæn.tiˈfjuː.də.lɪst/","extraExplanation":["“antifeudalist / anti-feudalist”常见于历史、政治与文学评论语境，尤其在讨论土地制度、地主阶层、等级特权与农民处境时使用。","构词法：anti-（反对）+ feudal（封建的）+ -ist（……主义者/……者）。","在中文语境里，“反封建”有时也被广泛用来指反对旧式家长制、包办婚姻等传统压迫结构；而英文里的 antifeudalist 更常聚焦于“封建制度/领主-农民关系/土地与特权”的社会经济含义。"]}
{"word":"antifeudalistic","summary":{"en":"Antifeudalistic means opposing feudalism; it’s a formal, academic way to describe anti-feudal ideas, movements, or themes.","zh":"antifeudalistic 意为“反封建的；反对封建制度的”，偏正式、学术，用来描述反封建的思想、运动或主题。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to feudalism (a social system where people owe labor or loyalty to powerful landowners).","zh":"反封建的；反对封建制度的（封建制度指人们对掌握土地与权力的领主承担劳役或效忠的社会制度）。"},"examples":[{"en":"The revolution included strong antifeudalistic demands, such as ending forced labor.","zh":"这场革命提出了强烈的反封建诉求，比如废除强迫劳役。"},{"en":"Some novels portray antifeudalistic heroes who challenge unjust landlords.","zh":"有些小说塑造了反封建的英雄，去挑战不公正的地主。"}]}],"synonyms":["anti-feudal","opposed to feudalism","anti-feudalism (related noun/idea)"],"phonetic":"/ˌæn.tiˌfjuː.dəˈlɪs.tɪk/","extraExplanation":["“antifeudalistic”常见于历史、政治与文学批评语境，尤其在讨论革命、社会改革、或“反封建斗争”时出现。日常英语里更常用的说法是“anti-feudal”或“anti-feudalism”（如：anti-feudal reforms 反封建改革）。","构词法：anti-（反对）+ feudal（封建的）+ -istic（……性质的）。因此它强调“具有反封建倾向/性质”，比单纯说“anti-feudal”更书面、更学术。","在文学/历史写作中，它常用来描述主题或立场：an antifeudalistic movement（反封建运动）、antifeudalistic sentiment（反封建情绪）、antifeudalistic satire（反封建讽刺）。"]}
{"word":"antifeudalization","summary":{"en":"Antifeudalization means opposing feudalism or working to eliminate feudal systems and privileges.","zh":"antifeudalization 指反对封建制度，或推动消除封建体系与特权的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to, or the process/policy of preventing, reversing, or ending feudalism (a system where land and power are controlled by lords and inherited privilege).","zh":"反封建化；指反对封建制度，或防止、扭转、结束封建制度的过程/政策（封建制度指土地与权力由领主和世袭特权掌控）。"},"examples":[{"en":"The reform program was described as a step toward antifeudalization in the countryside.","zh":"这项改革计划被形容为农村反封建化的一步。"},{"en":"Historians debate whether the movement’s antifeudalization goals were achieved.","zh":"历史学家争论该运动的反封建化目标是否实现。"}]}],"synonyms":["anti-feudalism","de-feudalization","abolition of feudalism","anti-feudal reform"],"phonetic":"/ˌæn.tiˌfjuː.də.laɪˈzeɪ.ʃən/","extraExplanation":["“antifeudalization”是较少见、偏学术或政治讨论的名词，常出现在历史研究、社会理论、革命史或政策分析中。","它通常与“废除封建特权/地租/人身依附关系、土地改革、限制世袭权力”等主题连用；在某些语境里也会与马克思主义史观中的“反封建斗争”相近。","更常见的表达包括：anti-feudalism（反封建主义/反封建立场）、the abolition of feudalism（废除封建制度）、anti-feudal reforms（反封建改革）。"]}
{"word":"antifibrinolysin","summary":{"en":"An antifibrinolysin is something that inhibits the breakdown of blood clots (fibrinolysis).","zh":"antifibrinolysin 指能抑制纤溶、使血栓不易被分解、从而帮助止血的物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance (such as a drug, antibody, or protein) that prevents or reduces fibrinolysis—the breakdown of blood clots by dissolving fibrin","zh":"抗纤溶物（质）：一种能阻止或减少纤溶作用（即纤维蛋白被分解、血栓被溶解）的物质，可为药物、抗体或蛋白等"},"examples":[{"en":"Doctors may use an antifibrinolysin to help control heavy bleeding during surgery.","zh":"医生可能会使用抗纤溶药来帮助控制手术中的大量出血。"},{"en":"Tranexamic acid is an antifibrinolysin commonly used to reduce bleeding.","zh":"氨甲环酸是一种常用的抗纤溶药，可减少出血。"}]}],"synonyms":["antifibrinolytic","fibrinolysis inhibitor"],"phonetic":"ˌæn.tiˌfaɪ.brəˈnɑl.ə.sɪn","extraExplanation":["这是医学/生理学术语：fibrinolysis（纤溶）是人体用来“清理”血栓的一套机制；antifibrinolysin 的作用就是让血栓更不容易被分解，从而帮助止血，但也可能增加血栓风险，需要在医生评估下使用。","常见相关药物类别叫“抗纤溶药”（antifibrinolytic drugs），其中比较常见的例子是 tranexamic acid（氨甲环酸）和 aminocaproic acid（氨基己酸）。"]}
{"word":"antifibrinolysis","summary":{"en":"Antifibrinolysis means stopping or slowing the breakdown of blood clots to reduce bleeding.","zh":"Antifibrinolysis 指抑制血栓（血块）的分解过程，以减少出血。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the prevention or reduction of fibrinolysis (the body’s process of breaking down blood clots).","zh":"抗纤溶（抑制或减少纤维蛋白溶解，即身体分解血栓的过程）。"},"examples":[{"en":"Antifibrinolysis can help reduce bleeding during major surgery.","zh":"抗纤溶可帮助在大型手术中减少出血。"},{"en":"Tranexamic acid is commonly used for antifibrinolysis in trauma care.","zh":"氨甲环酸常用于创伤救治中的抗纤溶治疗。"}]}],"synonyms":["antifibrinolytic effect","antifibrinolytic therapy","inhibition of fibrinolysis"],"phonetic":"/ˌæn.tiˌfaɪ.brəˈnɑː.lə.sɪs/","extraExplanation":["“fibrinolysis”指“纤维蛋白溶解”，是机体把血块（血栓）逐步分解的自然机制；“anti-”表示“反/抑制”，因此“antifibrinolysis”字面意思就是“抑制纤溶”。","临床上常见的抗纤溶药物包括氨甲环酸（tranexamic acid, TXA）和氨甲苯酸（aminocaproic acid）。它们常用于手术、外伤大出血、月经过多等情境，以降低出血风险。","学习提示：该词多用于医学论文、用药说明和临床记录中；日常英语里更常见的表达是“antifibrinolytic therapy”（抗纤溶治疗）或直接说具体药名。"]}
{"word":"antifibrinolytic","summary":{"en":"Antifibrinolytic means a medicine/agent that prevents blood clots from breaking down, helping reduce bleeding.","zh":"antifibrinolytic 指“抗纤溶的/抗纤溶药”，即抑制血栓（凝块）分解以帮助止血、减少出血。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine) A drug or substance that reduces or prevents the breakdown of blood clots by inhibiting fibrinolysis, helping stop or reduce bleeding.","zh":"（医学）抗纤溶的；指通过抑制纤维蛋白溶解（纤溶）来减少或防止血栓/凝块被分解，从而帮助止血或减少出血的药物或物质。"},"examples":[{"en":"Tranexamic acid is an antifibrinolytic used to reduce heavy bleeding.","zh":"氨甲环酸是一种抗纤溶药，用于减少大量出血。"},{"en":"The surgeon prescribed an antifibrinolytic to help control bleeding after the procedure.","zh":"外科医生开了抗纤溶药，以帮助控制术后出血。"}]},{"partOfSpeech":"n.","definition":{"en":"An antifibrinolytic drug or agent.","zh":"抗纤溶药；抗纤溶制剂。"},"examples":[{"en":"The patient was given an antifibrinolytic before surgery.","zh":"患者在手术前使用了抗纤溶药。"}]}],"synonyms":["anti-fibrinolytic","fibrinolysis inhibitor","antiplasmin"],"phonetic":"/ˌæn.tiˌfaɪ.brəˈnɑː.lɪ.tɪk/","extraExplanation":["词构成：anti-（反、抗）+ fibrinolysis（纤维蛋白溶解/纤溶）+ -tic（表示“与……有关/起作用的”）。因此字面意思是“抗（抑制）纤溶的”。","常见相关药物包括 tranexamic acid（氨甲环酸）和 aminocaproic acid（ε-氨基己酸）。它们常用于控制出血（如手术、外伤、月经过多等）——具体使用需由医生评估，因为过度抑制纤溶在某些人群可能增加血栓风险。"]}
{"word":"antifideism","summary":{"en":"Antifideism means opposing the idea that faith alone is enough; it emphasizes reason and evidence in addition to faith.","zh":"Antifideism 指反对“只凭信仰即可”的观点，强调信仰之外还要重视理性与证据。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to fideism; the view that religious belief should not rest on faith alone, and that reason, evidence, or argument also matters in forming or justifying belief.","zh":"反信仰主义；反对“只凭信仰即可成立”的立场，主张宗教信念不应仅靠信仰，还应重视理性、证据或论证。"},"examples":[{"en":"In the philosophy of religion seminar, antifideism was presented as a call for rational arguments alongside faith.","zh":"在宗教哲学研讨课上，反信仰主义被介绍为：信仰之外也需要理性论证。"},{"en":"Her antifideism made her skeptical of claims that faith alone can justify belief.","zh":"她的反信仰主义让她对“仅凭信仰就能证明信念合理”的说法持怀疑态度。"}]}],"synonyms":["rejection of fideism","anti-fideism","rationalism (in religious contexts)"],"phonetic":"/ˌæntiˈfaɪdiˌɪzəm/","extraExplanation":["“fideism（信仰主义）”通常指：在宗教问题上，把信仰置于理性之上，甚至认为理性无法或不必为信仰提供依据。因而“antifideism（反信仰主义）”常出现在神学与宗教哲学讨论中，用来强调信仰与理性/证据之间的配合。","该词较少用于日常英语，更常见于学术写作；写作中也常用更直白的表达，如“a rejection of fideism（拒斥信仰主义）”或“the view that faith should be supported by reason（信仰应由理性支撑的观点）”。"]}
{"word":"antifilarial","summary":{"en":"Antifilarial describes (or names) medicine used against filarial worm infections.","zh":"antifilarial 指（或指代）用于对抗丝虫感染的药物或治疗。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a drug or treatment) used to kill or stop the growth of filarial worms (parasites) that can cause diseases like lymphatic filariasis.","zh":"（药物或治疗）用于杀死或抑制丝虫（寄生虫）的生长；丝虫可引起如淋巴丝虫病等疾病。"},"examples":[{"en":"The doctor prescribed an antifilarial medicine after the blood test confirmed filarial infection.","zh":"血液检查证实丝虫感染后，医生开了抗丝虫药。"},{"en":"Mass drug administration programs often include antifilarial treatment to reduce transmission in communities.","zh":"大规模药物发放项目常包含抗丝虫治疗，以降低社区传播。"}]},{"partOfSpeech":"n.","definition":{"en":"An antifilarial drug or agent.","zh":"抗丝虫药；抗丝虫制剂。"},"examples":[{"en":"Diethylcarbamazine is a commonly used antifilarial in some regions.","zh":"乙胺嗪在一些地区是常用的抗丝虫药。"},{"en":"The clinic ran out of antifilarials during the outreach campaign.","zh":"外展活动期间诊所的抗丝虫药用完了。"}]}],"synonyms":["anti-filarial","filaricidal","anthelmintic (broader)"],"phonetic":"/ˌæn.ti.faɪˈlɛr.i.əl/","extraExplanation":["“filarial”来自“filaria（丝状虫）”，词根与拉丁语“filum（线）”有关，强调这种寄生虫像“线”一样细长；“anti-”表示“对抗/抵抗”。","这个词多见于医学、公共卫生和热带病语境中，日常英语里不常用。常与“drug / treatment / therapy / medicine”搭配，如“antifilarial drug”。"]}
{"word":"antifire","summary":{"en":"Antifire means fire-resistant or intended to prevent fire; it can also refer to a fireproofing treatment.","zh":"Antifire 指“防火的／阻燃的”，也可指“防火处理剂或涂层”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to prevent fire or reduce how easily something burns; fire-resistant or flame-retardant.","zh":"用于防火或降低可燃性；耐火的／阻燃的。"},"examples":[{"en":"The workers installed antifire doors in the stairwell.","zh":"工人在楼梯间安装了防火门。"},{"en":"Choose antifire materials for the kitchen area.","zh":"厨房区域要选择阻燃材料。"}]},{"partOfSpeech":"n.","definition":{"en":"A fire-prevention or flame-retardant substance or treatment applied to materials.","zh":"用于防火的材料、涂层或阻燃处理剂。"},"examples":[{"en":"The fabric was treated with an antifire coating.","zh":"这块布料做了阻燃涂层处理。"},{"en":"Some antifire chemicals can change the color of the wood slightly.","zh":"有些阻燃药剂会让木材颜色略有变化。"}]}],"synonyms":["fire-resistant","flame-retardant","fireproof (often stronger in meaning)"],"phonetic":"/ˌæn.tiˈfaɪɚ/","extraExplanation":["“anti-”是常见前缀，表示“反对／防止”（如: antibacterial 抗菌的，anti-theft 防盗的）。因此 antifire 字面意思就是“防火”。在日常英语里，更常见的说法是 fire-resistant（耐火的）或 flame-retardant（阻燃的）。","建筑与安全语境中，常见搭配有 antifire door（防火门）、antifire coating/paint（防火涂层／防火漆）、antifire insulation（防火保温材料）。不同国家/地区的消防规范会用更标准化的术语与等级标识。"]}
{"word":"antiflash","summary":{"en":"Antiflash means ‘against a sudden bright flash,’ especially in military/civil-defense contexts (protective clothing, coatings, etc.).","zh":"antiflash 指“防闪光的”，多用于军事/民防语境（如防护服、涂料等），用来减轻强光闪光造成的伤害。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to reduce or prevent harm from a sudden bright flash of light (especially the flash from a nuclear explosion).","zh":"用于减少或防止强光闪光伤害的（尤其指核爆闪光）。"},"examples":[{"en":"The crew wore antiflash hoods and gloves during the drill.","zh":"演习期间，机组人员戴着防闪光头罩和手套。"},{"en":"Some military aircraft used antiflash paint to reflect heat and light.","zh":"一些军用飞机使用防闪光涂料来反射热和强光。"}]},{"partOfSpeech":"n.","definition":{"en":"A protective item or measure used to reduce injury or glare from a flash (such as special clothing or coatings).","zh":"防闪光用品或措施（例如特殊防护服或涂层），用于减轻闪光造成的伤害或眩光。"},"examples":[{"en":"Antiflash clothing became standard in certain Cold War safety kits.","zh":"在冷战时期，某些安全装备包中防闪光服装成为标准配置。"},{"en":"The manual lists antiflash gear for emergency response.","zh":"手册列出了用于应急响应的防闪光装备。"}]}],"synonyms":["anti-flash","flash-protective","glare-reducing","protective"],"phonetic":"/ˌæntiˈflæʃ/","extraExplanation":["“antiflash”常见于军事与民防语境，尤其和“anti-flash hood / gloves / suit（防闪光头罩/手套/防护服）”“anti-flash paint（防闪光涂料）”搭配使用，强调降低强光与热辐射带来的灼伤与瞬间致盲风险。","拼写上也常见连字符形式“anti-flash”。在摄影领域更常说“anti-flash mode/feature（防红眼/抑制闪光效果）”或“anti-reflective coating（防反射涂层）”，而不是单独用“antiflash”。"]}
{"word":"antiflattering","summary":{"en":"“Antiflattering” means not flattering—making someone or something look or sound less attractive or less favorable.","zh":"“antiflattering”指“不奉承/不美化”，让人或事物看起来或听起来不那么好或不那么讨喜。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not flattering; showing no attempt to praise or make someone or something look better than it really is (sometimes even making it look worse).","zh":"不奉承的；不美化的；不讨好人的（有时甚至显得更难看/更不体面）。"},"examples":[{"en":"The photo was antiflattering because of the harsh lighting.","zh":"这张照片因为光线太刺眼而显得不太好看。"},{"en":"She gave an antiflattering description of the project’s early failures.","zh":"她对项目早期的失败做了不太好听、毫不美化的描述。"},{"en":"The dress looked antiflattering on me, so I chose a different style.","zh":"这条裙子穿在我身上不显身材，所以我换了别的款式。"}]}],"synonyms":["unflattering","unkind","disparaging","critical"],"phonetic":"/ˌæntiˈflætərɪŋ/","extraExplanation":["“anti-”是前缀，表示“反对、抵制、不……”；“flattering”意为“讨人喜欢的/奉承的/显得更好看的”。合在一起，“antiflattering”常用来形容照片、衣服、角度、光线、描写等让人看起来或听起来“不占便宜”。","日常更常见的说法是“unflattering”。“antiflattering”也能用，但更偏强调“刻意不讨好/不美化”的感觉。"]}
{"word":"antiflatulent","summary":{"en":"“Antiflatulent” means anti-gas: something that prevents or relieves intestinal gas; it can be an adjective or a noun.","zh":"“antiflatulent”意为“抗胀气的/抗胀气药”，指预防或缓解肠胃气体（胀气）的东西，可作形容词或名词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to preventing or reducing flatulence (gas in the stomach or intestines).","zh":"与防止或减少肠胃胀气（放屁/肠道气体）有关的；抗胀气的。"},"examples":[{"en":"Peppermint tea is sometimes used as an antiflatulent remedy.","zh":"薄荷茶有时被用作抗胀气的缓解方法。"},{"en":"The doctor recommended an antiflatulent medicine after meals.","zh":"医生建议饭后服用抗胀气药物。"}]},{"partOfSpeech":"n.","definition":{"en":"A medicine or substance used to prevent or relieve flatulence.","zh":"抗胀气药；用于预防或缓解胀气的物质。"},"examples":[{"en":"Simethicone is a common antiflatulent.","zh":"西甲硅油（simethicone）是一种常见的抗胀气药。"},{"en":"They asked the pharmacist for an antiflatulent for bloating.","zh":"他们向药师询问有没有缓解腹胀的抗胀气药。"}]}],"synonyms":["anti-gas","carminative (formal)","gas-relieving"],"phonetic":"/ˌæn.tiˈflætʃ.ə.lənt/","extraExplanation":["词源上可拆为 anti-（“反/抗”）+ flatulent（“胀气的”）。在日常英语里更常见的说法是 “anti-gas” 或 “for gas/bloating”。","属于偏医学/药学用语，常见于药品说明、医生建议或健康文章中。","相关词：flatulence（名词：胀气/屁）、bloating（腹胀）、carminative（驱风的/助排气的，较正式）。"]}
{"word":"antiflux","summary":{"en":"“Antiflux” means preventing or counteracting flux (flow), or a thing used to reduce such flow.","zh":"“antiflux”指“防止/对抗通量或流动”的，或指用于减少这类流动的材料/装置。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Preventing or reducing a flow (flux), especially in electronics or physics; counteracting flux.","zh":"防止或减少“流动/通量（flux）”的；（尤指电子学或物理学中）用于对抗通量的。"},"examples":[{"en":"An antiflux coating was applied to slow the movement of ions.","zh":"涂上了一层防通量涂层，以减缓离子的移动。"},{"en":"The design includes an antiflux barrier to limit heat transfer.","zh":"该设计包含一道防通量屏障，用来限制热量传递。"}]},{"partOfSpeech":"n.","definition":{"en":"Something (a material, layer, device, or measure) used to prevent or reduce flux or flow.","zh":"用于防止或减少通量/流动的东西（如材料、涂层、装置或措施）。"},"examples":[{"en":"Engineers tested several antiflux materials under high temperatures.","zh":"工程师在高温条件下测试了几种防通量材料。"},{"en":"This sealant acts as an antiflux in the system.","zh":"这种密封剂在系统中起到防通量材料的作用。"}]}],"synonyms":["counter-flux","flux barrier","flux inhibitor","anti-reflux (medical context)"],"phonetic":"/ˌæntiˈflʌks/","extraExplanation":["“antiflux”不是日常英语里的高频词，更常见的表达会根据领域改用更具体的词：\n- 医学上常说“anti-reflux（抗反流）”，而不是“antiflux”。\n- 工程/材料语境里可能会看到“flux barrier（通量屏障）”“flux inhibitor（通量抑制剂）”“counter-flux（反向通量）”等更常用说法。\n如果你能提供出现它的句子或领域（医学/电子/材料/化学），我可以帮你确定最贴切的对应意思。"]}
{"word":"antifoam","summary":{"en":"Antifoam is a chemical or additive used to reduce or prevent foam in liquids.","zh":"Antifoam 指用于减少或防止液体产生泡沫的化学品或添加剂（消泡剂）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance added to a liquid to stop or reduce foam (bubbles) from forming.","zh":"消泡剂；一种加入液体中用来防止或减少泡沫产生的物质。"},"examples":[{"en":"Add a small amount of antifoam to prevent excessive foaming during fermentation.","zh":"在发酵过程中加入少量消泡剂，以防泡沫过多。"},{"en":"The technician used antifoam so the mixture wouldn’t overflow the tank.","zh":"技术员使用消泡剂，避免混合液溢出罐体。"}]}],"synonyms":["defoamer","antifoaming agent","foam inhibitor"],"phonetic":"/ˈæn.ti.foʊm/","extraExplanation":["“antifoam”常见于食品加工、制药、化工、水处理与实验室操作中，用于控制泡沫（例如搅拌、加热或发酵时产生的泡沫）。","词形上由前缀 anti-（“反、抑制”）+ foam（“泡沫”）构成；相关词还有 defoamer（除泡剂/消泡剂），在不同领域两者常可互换使用。"]}
{"word":"antifoaming","summary":{"en":"Antifoaming means preventing foam, or it can refer to a substance used to reduce foam (an antifoaming agent).","zh":"antifoaming 指“防泡/消泡的”，也可指“消泡剂（抑泡剂）”这种用来减少泡沫的物质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Preventing or reducing foam from forming in a liquid or process.","zh":"防止或减少液体或工艺过程中产生泡沫的；消泡的。"},"examples":[{"en":"The factory added an antifoaming agent to the tank to stop bubbles from building up.","zh":"工厂在罐中加入消泡剂，防止气泡不断积累。"},{"en":"Antifoaming chemicals are common in wastewater treatment and food processing.","zh":"消泡化学品常用于污水处理和食品加工。"}]},{"partOfSpeech":"n.","definition":{"en":"A substance (an antifoaming agent) used to prevent or break down foam.","zh":"消泡剂；抑泡剂（用来防止或破坏泡沫的物质）。"},"examples":[{"en":"A small amount of antifoaming can improve the efficiency of fermentation.","zh":"少量消泡剂可以提高发酵效率。"},{"en":"Check the label to see whether the antifoaming is food-grade.","zh":"查看标签确认该消泡剂是否为食品级。"}]}],"synonyms":["antifoam","defoaming","foam-suppressing","antifoaming agent"],"phonetic":"/ˌæn.tiˈfoʊ.mɪŋ/","extraExplanation":["在工业与食品领域里更常见的说法是“antifoam / antifoaming agent（消泡剂）”。“Antifoaming”常作形容词修饰名词（如 antifoaming agent/solution），也可在技术语境中当名词使用，指“消泡剂”这一类产品。"]}
{"word":"antifoggant","summary":{"en":"Antifoggant means a substance or coating that prevents lenses or other surfaces from fogging up, and it can also describe products made for that purpose.","zh":"Antifoggant 指防止镜片或其他表面起雾的防雾剂/防雾涂层，也可作形容词表示“防雾的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance or coating that prevents fog from forming on a surface (especially glass or plastic lenses).","zh":"防雾剂；防雾涂层（用于防止表面，尤指玻璃或塑料镜片起雾的物质或涂层）。"},"examples":[{"en":"Apply an antifoggant to your goggles before swimming.","zh":"游泳前在护目镜上涂一点防雾剂。"},{"en":"The lab uses an antifoggant on safety glasses to keep them clear.","zh":"实验室会在护目镜上使用防雾涂层，保持视野清晰。"}]},{"partOfSpeech":"adj.","definition":{"en":"preventing fogging; designed to reduce or stop condensation on a surface.","zh":"防雾的；用于减少或阻止表面结雾（凝结水汽）的。"},"examples":[{"en":"These are antifoggant wipes for camera lenses.","zh":"这是用于相机镜头的防雾湿巾。"},{"en":"He bought an antifoggant spray for his helmet visor.","zh":"他买了防雾喷雾，用在头盔面罩上。"}]}],"synonyms":["anti-fog agent","anti-fog coating","defogger","defogging solution"],"phonetic":"/ˌæn.tiˈfɑː.ɡənt/","extraExplanation":["“Antifoggant”由 anti-（反、抗）+ fog（雾）+ -ant（表示“起作用的东西/物质”）构成。日常更常见的说法是“anti-fog (spray/coating/wipes)”或“defogger/defogging solution”。在潜水、滑雪、骑行、医护护目镜等场景很常用。"]}
{"word":"antifogmatic","summary":{"en":"Antifogmatic means “anti-fog”: preventing surfaces like lenses or goggles from fogging up, often as a product-style term.","zh":"Antifogmatic 意为“防雾的”：防止镜片、护目镜等表面起雾，常带有产品命名/广告用语色彩。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to prevent fog from forming on a surface (especially lenses, goggles, mirrors, or windshields).","zh":"用于防止表面起雾（尤其是镜片、护目镜、镜子或挡风玻璃）的。"},"examples":[{"en":"These are antifogmatic goggles, so they stay clearer when you breathe heavily.","zh":"这是防雾护目镜，所以你大口呼吸时也不容易起雾。"},{"en":"I use an antifogmatic spray on my glasses in winter.","zh":"冬天我会在眼镜上喷防雾喷雾。"}]},{"partOfSpeech":"n.","definition":{"en":"A product or coating marketed as anti-fog (often used as a brand-style or informal term).","zh":"指被宣传为“防雾”的产品或涂层（常见于品牌式写法或非正式用法）。"},"examples":[{"en":"Do you carry any antifogmatic for diving masks?","zh":"你们有潜水面镜用的防雾剂吗？"}]}],"synonyms":["anti-fog","fog-resistant","anti-fogging"],"phonetic":"/ˌæntiˈfɔɡmætɪk/","extraExplanation":["“antifogmatic”不是非常常见的标准词，更常见的说法是“anti-fog”或“anti-fogging”。它看起来像把“anti-fog（防雾）”加上带有“装置/产品感”的后缀“-matic”（常见于产品命名，如“automatic”里的-matic）来形成一种“产品名/广告用语”。","在说明书、商品页面、潜水/滑雪装备或眼镜配件语境中更可能看到这种写法；正式写作中通常用“anti-fog coating/spray/wipe（防雾涂层/喷雾/湿巾）”。"]}
{"word":"antifolate","summary":{"en":"An antifolate is a drug or effect that blocks folate (vitamin B9), often used in cancer or immune-related treatments.","zh":"antifolate 指“抗叶酸药/抗叶酸作用”，阻断叶酸（维生素B9）功能，常用于肿瘤或免疫相关治疗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a drug or substance that blocks the action of folate (vitamin B9) in the body, often used to treat cancer or certain inflammatory diseases by slowing cell growth.","zh":"抗叶酸药；一种阻断叶酸（维生素B9）作用的药物或物质，常用于治疗癌症或某些炎症性疾病，通过减缓细胞生长来起效。"},"examples":[{"en":"Methotrexate is an antifolate used in some cancer treatments.","zh":"甲氨蝶呤是一种用于某些癌症治疗的抗叶酸药。"},{"en":"Because antifolate drugs can affect healthy cells too, patients may need careful monitoring.","zh":"由于抗叶酸药也可能影响健康细胞，患者通常需要密切监测。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing a drug or effect that prevents folate from working normally.","zh":"抗叶酸的；形容阻止叶酸正常发挥作用的（药物或作用）。"},"examples":[{"en":"The therapy has an antifolate effect on rapidly dividing cells.","zh":"这种疗法对快速分裂的细胞具有抗叶酸作用。"},{"en":"Doctors may discuss antifolate side effects such as mouth sores or low blood counts.","zh":"医生可能会讨论抗叶酸类副作用，例如口腔溃疡或血细胞计数偏低。"}]}],"synonyms":["folate antagonist","antimetabolite (broader category)"],"phonetic":"/ˌæn.taɪˈfoʊ.leɪt/","extraExplanation":["“anti-”表示“反、抗”， “folate”指“叶酸（维生素B9）”。抗叶酸药常通过抑制与叶酸有关的代谢途径（例如影响DNA合成）来抑制细胞增殖，因此对“分裂快”的细胞影响更明显。","在临床语境中，antifolate 常与化疗药物联系在一起（如 methotrexate、pemetrexed 等）。有时会配合“叶酸/亚叶酸（leucovorin）补救”来减轻副作用；具体用法需由医生决定。"]}
{"word":"antiforeign","summary":{"en":"“Antiforeign/anti-foreign” describes opposition or hostility toward foreigners or foreign influence.","zh":"“antiforeign/anti-foreign”指对外国人或外来影响的反对或敌视（排外）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to foreign people, countries, or influence; showing prejudice or hostility toward outsiders","zh":"反对外国人、外国国家或外来影响的；带有排外或敌意的"},"examples":[{"en":"The politician used anti-foreign language to gain support.","zh":"这位政治人物用排外的言辞来争取支持。"},{"en":"Anti-foreign protests broke out after the rumor spread online.","zh":"谣言在网上传播后，爆发了反外（排外）抗议。"},{"en":"The report warns that anti-foreign attitudes can lead to discrimination.","zh":"报告警告说，排外态度可能导致歧视。"}]}],"synonyms":["xenophobic","anti-immigrant","nationalistic (often in this sense)"],"phonetic":"/ˌæn.tiˈfɔr.ən/","extraExplanation":["常见写法是加连字符的“anti-foreign”（作定语：anti-foreign sentiment/attacks），也可写成不加连字符的“antiforeign”，但在新闻与学术写作里前者更常见、更清晰。","语气上通常偏负面，常用来描述“排外主义/仇外”的社会情绪或政治立场。表达更中性的“对外来影响持怀疑态度”时，可考虑用“skeptical of foreign influence”。","相关名词常搭配：anti-foreign sentiment（反外情绪）、anti-foreign protests（排外抗议）、anti-immigrant（反移民，含义更具体）。"]}
{"word":"antiforeigner","summary":{"en":"“Antiforeigner” means opposed to foreigners; it can describe attitudes, rhetoric, or a person who holds such views.","zh":"“antiforeigner”指“反外国人的/排外的”，也可指持这种观点的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to foreigners or showing hostility or prejudice toward foreigners.","zh":"反外国人的；排外的（对外国人持敌意或偏见）。"},"examples":[{"en":"Some politicians used anti-foreigner rhetoric during the campaign.","zh":"一些政客在竞选期间使用了排外言论。"},{"en":"The policy was criticized as anti-foreigner and discriminatory.","zh":"该政策被批评为排外且带有歧视性。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who is opposed to foreigners or who holds anti-foreigner views.","zh":"排外者；反外国人的人（对外国人抱有敌意或偏见的人）。"},"examples":[{"en":"Local leaders spoke out against antiforeigners who targeted immigrants.","zh":"当地领导人公开反对那些针对移民的排外者。"}]}],"synonyms":["xenophobic","anti-immigrant","nativist","anti-outsider"],"phonetic":"/ˌæntiˈfɔrənɚ/","extraExplanation":["“antiforeigner”由前缀 anti-（反对）+ foreigner（外国人）构成，更常见的写法是连字符形式“anti-foreigner”。在新闻与学术语境里，常用“anti-immigrant / anti-foreigner sentiment（反移民/排外情绪）”“xenophobic（仇外的）”等表达。","该词带有强烈负面评价色彩，使用时需要注意语境与礼貌；描述社会现象时可用更中性、更常见的“anti-immigrant sentiment（反移民情绪）”或“hostility toward foreigners（对外国人的敌意）”。"]}
{"word":"antiforeignism","summary":{"en":"Antiforeignism means hostility or opposition toward foreign people or foreign influence.","zh":"Antiforeignism 指对外国人或外来影响的敌视或反对。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to, fear of, or hostility toward foreign people, cultures, or influence (often used in political or social discussions).","zh":"反外主义；排外倾向：对外国人、外国文化或外来影响的反对、恐惧或敌意（常用于政治或社会讨论）。"},"examples":[{"en":"The historian argued that antiforeignism increased during the economic crisis.","zh":"这位历史学家认为，经济危机期间反外主义有所加剧。"},{"en":"The government tried to calm antiforeignism by promoting cultural exchange programs.","zh":"政府试图通过推动文化交流项目来缓解排外情绪。"},{"en":"Antiforeignism can lead to discrimination against immigrants and international students.","zh":"反外主义可能导致对移民和国际学生的歧视。"}]}],"synonyms":["xenophobia","anti-foreign sentiment","anti-immigrant sentiment","nativism"],"phonetic":"/ˌæntiˈfɔrənˌɪzəm/","extraExplanation":["“antiforeignism”在日常英语中不算常见，更常见的表达是“xenophobia（排外/仇外）”“anti-immigrant sentiment（反移民情绪）”“anti-foreign sentiment（反外国情绪）”“nativism（本土主义）”。","语气上，“xenophobia”通常更强烈，带有恐惧与仇恨色彩；“anti-foreign sentiment/antiforeignism”更偏向政治立场或社会态度的描述。写作时可根据语境选择更常用、更准确的词。"]}
{"word":"antiformant","summary":{"en":"An antiformant is an antiresonance—a strong reduction at certain frequencies in a sound spectrum, common in nasal sounds.","zh":"Antiformant 指反共振：在频谱中某些频率能量明显降低的现象，鼻音中很常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an antiresonance in speech or acoustics—a frequency region where energy is strongly reduced (a “dip” in the spectrum), often caused by sound cancelling itself in parts of the vocal tract","zh":"（语音/声学中的）反共振；指某些频率处能量被显著削弱（频谱中的“凹陷/谷”），常由声道某部分的声波相互抵消造成"},"examples":[{"en":"Nasal consonants often show antiformants because the side cavities of the vocal tract create cancellations.","zh":"鼻音常出现反共振（antiformants），因为声道的旁支腔会造成声波抵消。"},{"en":"In the spectrum, you can see formants as peaks and antiformants as deep valleys.","zh":"在频谱里，共振峰（formants）像“峰”，反共振（antiformants）像很深的“谷”。"}]}],"synonyms":["antiresonance","spectral zero"],"phonetic":"/ˌæntiˈfɔrmənt/","extraExplanation":["“Antiformant”常见于语音学与语音信号处理（如LPC线性预测）领域：当声道出现“旁支腔/分流通道”（例如鼻腔通道）时，会在某些频率产生反共振，表现为频谱的“零点/强衰减区”。","在实际分析里，人们常用更通用的词“antiresonance”或“spectral zero”。“Formant（共振峰）”与“antiformant（反共振）”经常成对讲解：一个是增强某些频率，一个是抑制某些频率。"]}
{"word":"antiformin","summary":{"en":"Antiformin is an older term for a strong hypochlorite-based disinfectant used in labs to dissolve organic material and kill microbes.","zh":"Antiformin 是较旧的术语，指一种以次氯酸盐为主的强力消毒液，常在实验室中用于溶解有机物并杀灭微生物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a disinfectant solution (historically used in laboratories), typically a strong alkaline hypochlorite mixture used to break down organic material and kill germs.","zh":"（历史上用于实验室的）一种消毒溶液，通常为强碱性的次氯酸盐混合液，用于分解有机物并杀灭病菌。"},"examples":[{"en":"The lab used antiformin to digest the sputum sample before testing for bacteria.","zh":"实验室在检测细菌前用 antiformin 分解痰液样本。"},{"en":"Because antiformin is highly caustic, it must be handled with proper protective equipment.","zh":"由于 antiformin 腐蚀性很强，必须佩戴适当的防护装备操作。"}]}],"synonyms":["disinfectant","hypochlorite solution","bleach solution"],"phonetic":"/ˌæn.tiˈfɔr.mɪn/","extraExplanation":["Antiformin 多见于早期医学与微生物学文献，常指含次氯酸钠（漂白液成分）并呈强碱性的消毒/溶解液，用来“消化”含黏液或蛋白质的样本（如痰液）以便观察或培养细菌。","在现代英语中它较少作为通用词出现，更可能出现在历史资料、旧式实验流程或特定领域文章里。读到时可理解为“强力碱性含氯消毒液/样本消化液”。"]}
{"word":"antifouler","summary":{"en":"An antifouler is an antifouling coating/paint used to stop marine growth from sticking to underwater surfaces.","zh":"antifouler 指防污涂料/防污漆，用来防止海洋生物附着在水下表面。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a coating (usually paint) put on a ship’s hull or other underwater surface to prevent organisms like algae and barnacles from sticking to it (biofouling).","zh":"（通常指油漆）防污涂料；用于船体或其他水下表面，防止藻类、藤壶等生物附着（生物污损）。"},"examples":[{"en":"The boat owner applied a new antifouler before launching for the season.","zh":"船主在本季下水前刷了新的防污漆。"},{"en":"Using antifouler helps reduce drag and improves fuel efficiency.","zh":"使用防污涂料有助于减少阻力并提高燃油效率。"}]}],"synonyms":["antifouling paint","antifouling coating","anti-fouling paint","bottom paint"],"phonetic":"/ˌæn.tiˈfaʊ.lɚ/","extraExplanation":["“Antifouler”多用于航运、游艇与海洋工程语境，和“antifouling paint/coat(ing)”意思接近；其中“fouling”指水下生物在表面聚集造成的“污损”，会让船更费油、速度变慢。","一些传统防污漆含铜等成分以抑制生物附着；不同地区对成分和环保要求可能不同，购买与使用时常需遵循当地法规。"]}
{"word":"antifouling","summary":{"en":"Antifouling means preventing marine growth from sticking to underwater surfaces, especially on ships; it can also mean the coating used for this purpose.","zh":"antifouling 指“防污（防海洋生物附着）”，多用于船体等水下表面；也可指用于防污的涂料/涂层。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Used to prevent marine organisms (like algae and barnacles) from sticking to a ship’s hull or other surfaces in the water.","zh":"（涂料或材料）防污的；防止海洋生物（如藻类、藤壶）附着在船体或水下表面的。"},"examples":[{"en":"The ship was coated with antifouling paint to reduce barnacle growth.","zh":"这艘船涂了防污漆，以减少藤壶生长。"},{"en":"Antifouling coatings can improve fuel efficiency by keeping the hull smooth.","zh":"防污涂层能让船体更光滑，从而提高燃油效率。"}]},{"partOfSpeech":"n.","definition":{"en":"A coating or treatment, especially paint, that prevents marine growth from attaching to surfaces underwater.","zh":"防污涂料；防污处理（尤指防止水下表面附着海洋生物的涂层或油漆）。"},"examples":[{"en":"They applied a new antifouling before the boat went back into the water.","zh":"船重新下水前，他们涂了一层新的防污涂料。"},{"en":"This antifouling is designed for saltwater conditions.","zh":"这种防污涂料专为海水环境设计。"}]}],"synonyms":["anti-biofouling","fouling-resistant","anti-fouling"],"phonetic":"/ˌæn.tiˈfaʊ.lɪŋ/","extraExplanation":["“antifouling”常见于航运、游艇保养与海洋工程领域。词由 anti-（反、抗）+ fouling（弄脏、结垢；此处指“生物污损/附着”）构成。","防污涂层与环保法规关系密切：一些早期防污漆含有对海洋生态有害的成分（如有机锡），许多国家已限制或禁用；现代产品更强调低毒或无毒配方。","学习时可一起记：biofouling（生物污损/生物附着）、foul（弄脏；（绳索）缠住）、fouling organisms（附着生物）。"]}
{"word":"antifowl","summary":{"en":"Antifowl (more commonly written anti-fowl) means “anti-bird”: meant to keep birds away or prevent bird damage.","zh":"antifowl（更常写作 anti-fowl）表示“防鸟的/驱鸟的”：用于阻止鸟类停落、进入或造成破坏。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"designed to prevent birds (especially poultry or wild birds) from entering, landing, nesting, or causing damage","zh":"用于防鸟（尤其是家禽或野鸟）进入、停落、筑巢或造成破坏的；防鸟的"},"examples":[{"en":"The farm installed anti-fowl netting to keep ducks out of the vegetable beds.","zh":"农场装了防鸟网，防止鸭子进入菜地。"},{"en":"Anti-fowl spikes were added to the roof to stop pigeons from landing.","zh":"屋顶加装了防鸟刺，防止鸽子停落。"}]},{"partOfSpeech":"n.","definition":{"en":"an anti-bird product or measure (such as netting, spikes, or repellent) used to keep birds away","zh":"防鸟措施或产品（如防鸟网、防鸟刺或驱鸟剂）"},"examples":[{"en":"They tested several antifowls before choosing a humane repellent.","zh":"他们测试了几种防鸟方案后，选择了更人道的驱避剂。"}]}],"synonyms":["bird-proof","bird-deterrent","bird-repellent","pigeon-proof"],"phonetic":"ˌæntiˈfaʊl","extraExplanation":["“antifowl/anti-fowl”并不是常见的标准词汇，更多时候会写成带连字符的“anti-fowl”，或直接用更常见的说法：bird-proof（防鸟的）、bird deterrent（驱鸟装置/措施）、pigeon spikes（防鸽刺）、bird netting（防鸟网）。","构词上是前缀“anti-（反…/防…）”+“fowl（家禽/鸟类）”。在实际语境里通常指“防鸟”，不一定是“反对家禽”的态度。"]}
{"word":"antifraud","summary":{"en":"“Antifraud” refers to actions or tools that prevent or fight fraud, often in banking, payments, and online security.","zh":"“antifraud”指用于预防或打击欺诈的工具、措施或相关工作，常见于银行、支付与网络安全场景。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to prevent, detect, or stop fraud (dishonest or illegal tricking to get money, information, or power).","zh":"用于预防、识别或阻止欺诈（用不诚实或违法手段骗取金钱、信息或权力）的。"},"examples":[{"en":"The bank added antifraud checks to protect customers from scams.","zh":"银行增加了反欺诈检查，以保护客户免受诈骗。"},{"en":"We use antifraud software to flag unusual transactions.","zh":"我们使用反欺诈软件来标记异常交易。"}]},{"partOfSpeech":"n.","definition":{"en":"Measures, systems, or efforts used to prevent or fight fraud.","zh":"反欺诈措施、系统或行动。"},"examples":[{"en":"The company strengthened its antifraud after a data breach.","zh":"在数据泄露后，公司加强了反欺诈措施。"},{"en":"Antifraud is a key part of online payments.","zh":"反欺诈是线上支付的重要组成部分。"}]}],"synonyms":["anti-fraud","fraud-prevention","fraud control","fraud detection"],"phonetic":"/ˌæn.tiˈfrɔd/","extraExplanation":["“antifraud”多用于商业、金融与互联网安全语境（如银行、支付平台、电商、保险）。更常见的写法是带连字符的“anti-fraud”，尤其在正式文件或标题中。","常见搭配：antifraud system（反欺诈系统）、antifraud policy（反欺诈政策）、antifraud team/unit（反欺诈团队/部门）、antifraud controls（反欺诈控制措施）、antifraud checks（反欺诈核验/检查）。"]}
{"word":"antifreeze","summary":{"en":"Antifreeze is a liquid used in vehicle cooling systems to prevent freezing (and often overheating). It can also mean adding that liquid.","zh":"Antifreeze 指用于车辆冷却系统的防冻液，用来防止结冰（也常防止过热）；也可作动词表示“加防冻液”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a liquid added to a car’s radiator or cooling system to stop the engine coolant from freezing (and often to help prevent overheating)","zh":"（汽车）防冻液；加入散热器/冷却系统以防止冷却液结冰（也常有助于防止过热）的液体"},"examples":[{"en":"Make sure the car has enough antifreeze before winter.","zh":"冬天来临前，要确保车里的防冻液足够。"},{"en":"The mechanic checked the antifreeze level during the service.","zh":"保养时，技师检查了防冻液液位。"}]},{"partOfSpeech":"v.","definition":{"en":"to add antifreeze to a vehicle’s cooling system","zh":"给（车辆冷却系统）加防冻液；进行防冻处理"},"examples":[{"en":"We antifreeze the truck every fall.","zh":"我们每年秋天都会给卡车加防冻液。"}]}],"synonyms":["engine coolant","coolant"],"phonetic":"/ˈæn.tiˌfriz/","extraExplanation":["“Antifreeze”直译是“反结冰”。日常使用中多指汽车发动机冷却液的一种（常见成分为乙二醇或丙二醇）。它有毒，尤其对宠物危险；如果洒漏应尽快清理并妥善处理。","在北美语境里，很多人会把“engine coolant（发动机冷却液）”和“antifreeze（防冻液）”混用；严格来说，coolant通常是“防冻液+水”的混合液。购买时可留意包装上是否写“premixed（已预混）”或需要自行按比例加水。"]}
{"word":"antifreezes","summary":{"en":"“Antifreezes” usually means different kinds or multiple amounts of antifreeze (engine coolant) that prevent freezing.","zh":"“Antifreezes”通常指多种或多份防冻液（发动机冷却液），用于防止结冰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of antifreeze: a liquid added to a car’s cooling system to stop the engine coolant (water) from freezing in cold weather.","zh":"antifreeze（防冻液）的复数：加入汽车冷却系统的液体，用来在寒冷天气防止冷却液（通常是水）结冰。"},"examples":[{"en":"Before winter, the mechanic checked the level of antifreezes in several company vehicles.","zh":"入冬前，技师检查了公司几辆车的防冻液液位。"},{"en":"Different antifreezes are made for different engines, so read the label carefully.","zh":"不同发动机需要不同类型的防冻液，所以要仔细看标签。"}]},{"partOfSpeech":"vt.","definition":{"en":"Third-person singular of antifreeze (rare): to add antifreeze to a cooling system or treat a liquid so it won’t freeze.","zh":"antifreeze 的第三人称单数（较少见）：给冷却系统添加防冻液，或对液体进行防冻处理。"},"examples":[{"en":"He antifreezes the truck’s radiator every fall.","zh":"他每年秋天都会给卡车的散热器加防冻液。"}]}],"synonyms":["coolants","engine coolants","radiator fluids"],"phonetic":"/ˌæntiˈfriːzɪz/","extraExplanation":["在日常英语里更常说“antifreeze”（不可数或可数）或“coolant（冷却液）”。“antifreezes”多出现在强调“不同种类的防冻液”或“多辆车分别使用的防冻液”时。","很多汽车用防冻液含乙二醇（ethylene glycol），对人和宠物有毒；英语安全提示常见：Keep antifreeze out of reach of children and pets（把防冻液放在儿童和宠物接触不到的地方）。"]}
{"word":"antifreezing","summary":{"en":"“Antifreezing” means preventing freezing or the process of preventing freezing, often used to describe agents, coatings, or features that stop ice from forming.","zh":"“antifreezing”表示“防冻的”或“防冻的过程”，常用于描述防冻剂、涂层或能防止结冰的特性。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Preventing something from freezing; designed or used to stop liquids (especially in machines) from turning into ice.","zh":"防冻的；用于防止（尤其是机器中的液体）结冰的。"},"examples":[{"en":"We added an antifreezing agent to the water to protect the pipes in winter.","zh":"我们在水里加入了防冻剂，以保护冬天的管道。"},{"en":"This antifreezing coating helps keep the road surface safer in icy weather.","zh":"这种防冻涂层有助于在结冰天气下让路面更安全。"}]},{"partOfSpeech":"n.","definition":{"en":"The action or process of preventing freezing.","zh":"防冻（的过程或行为）。"},"examples":[{"en":"Antifreezing is essential for equipment that operates outdoors in sub-zero temperatures.","zh":"对在零下温度户外运行的设备来说，防冻非常重要。"}]}],"synonyms":["freeze-resistant","anti-icing","frost-proof"],"phonetic":"/ˌæntiˈfriːzɪŋ/","extraExplanation":["“antifreezing”在日常英语里不如“antifreeze”常见：\n- antifreeze（名词）通常指汽车冷却液/防冻液；\n- antifreezing（形容词）更像描述性质或用途（如 antifreezing agent/coating）。","在科学语境中也可能遇到“antifreezing proteins/compounds”（防冻蛋白/化合物），指生物体内帮助在低温下避免结冰损伤的物质。"]}
{"word":"antifriction","summary":{"en":"Antifriction means “reducing friction,” especially in engineering, and can also refer to something used to reduce friction.","zh":"antifriction 指“减少摩擦的（防摩擦的）”，多用于工程领域，也可指“用于减摩的材料/装置/处理”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Engineering) Designed to reduce friction between moving parts.","zh":"（工程）用于减少运动部件之间摩擦的；防摩擦的。"},"examples":[{"en":"The motor uses antifriction bearings to run smoothly.","zh":"这台电机使用防摩擦轴承来平稳运转。"},{"en":"Antifriction coatings can extend the life of machine parts.","zh":"防摩擦涂层可以延长机器零件的寿命。"}]},{"partOfSpeech":"n.","definition":{"en":"A material, device, or treatment used to reduce friction (often in phrases like “antifriction bearing/oil/agent”).","zh":"用于减少摩擦的材料、装置或处理方式（常见于“防摩擦轴承/防摩擦润滑油/防摩擦剂”等搭配）。"},"examples":[{"en":"They added an antifriction agent to the lubricant.","zh":"他们在润滑剂中加入了防摩擦剂。"},{"en":"Antifriction is important in high-speed machinery.","zh":"在高速机械中，防摩擦非常重要。"}]}],"synonyms":["low-friction","anti-friction","friction-reducing","lubricating"],"phonetic":"ˌæn(t)iˈfrɪkʃən","extraExplanation":["“anti-”表示“反、抗”，friction 表示“摩擦”，合起来就是“抗摩擦/减少摩擦”。在日常英语中更常见的说法是 low-friction（低摩擦的）或 anti-friction（更常用的拼写形式，带连字符）。","常见搭配：antifriction bearing（防摩擦轴承，通常指滚珠/滚柱轴承，相对滑动轴承而言摩擦更小）；antifriction coating（减摩涂层）；antifriction additive/agent（减摩添加剂/剂）。"]}
{"word":"antifrictional","summary":{"en":"Antifrictional describes something made to reduce friction and help parts move smoothly.","zh":"antifrictional 指“抗摩擦的/减摩的”，用于减少摩擦并使部件运转更顺畅。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to reduce friction (rubbing resistance) between surfaces, often by helping parts move smoothly.","zh":"用于减少摩擦（表面之间的阻力），常指帮助零件更顺畅运转的。"},"examples":[{"en":"The machine uses an antifrictional coating to protect moving parts.","zh":"这台机器使用抗摩擦涂层来保护运动部件。"},{"en":"Antifrictional bearings can extend the life of an engine.","zh":"抗摩擦轴承可以延长发动机的寿命。"}]}],"synonyms":["low-friction","friction-reducing","anti-friction"],"phonetic":"/ˌæn.tiˈfrɪk.ʃə.nəl/","extraExplanation":["该词多见于工程、机械与材料领域（如“antifrictional coating/antifrictional bearing”）。日常英语里更常用的说法通常是“low-friction”（低摩擦的）或“friction-reducing”（减摩的）。"]}
{"word":"antifrost","summary":{"en":"Antifrost is an anti-freezing substance (or something designed) that helps liquids, pipes, or materials resist freezing in cold weather.","zh":"Antifrost 指防冻剂（或防冻装置/材料），用于在寒冷天气中防止液体、管道或材料结冰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance added to a liquid (or a mixture) to prevent it from freezing at low temperatures; an anti-freezing agent","zh":"防冻剂；用于降低液体冰点、避免结冰的添加剂"},"examples":[{"en":"Add antifrost to the cooling system before winter to prevent the water from freezing.","zh":"冬天前在冷却系统里加入防冻剂，防止水结冰。"},{"en":"The construction crew used an antifrost additive so the concrete could set in cold weather.","zh":"施工队使用了防冻添加剂，让混凝土能在寒冷天气中凝固。"}]},{"partOfSpeech":"adj.","definition":{"en":"designed to prevent freezing","zh":"防冻的；用于防止结冰的"},"examples":[{"en":"They installed an antifrost valve to protect the pipes.","zh":"他们安装了防冻阀来保护管道。"}]}],"synonyms":["antifreeze","deicer","anti-icing agent"],"phonetic":"/ˌæn.tiˈfrɔst/","extraExplanation":["“antifrost”在一些行业（如建筑材料、工业流体）里会被用来指“防冻添加剂”，但在日常英语中更常见的说法是“antifreeze”。","在汽车语境中，“antifreeze”通常指发动机冷却液中的防冻成分（常见为乙二醇或丙二醇），不仅防冻，也能帮助防沸并减少腐蚀。"]}
{"word":"antifundamentalism","summary":{"en":"Antifundamentalism means opposition to strict, absolute fundamentalist beliefs, especially in religion or politics.","zh":"Antifundamentalism 指反对宗教或政治中严格、绝对化的原教旨主义信念。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to fundamentalism (especially strict religious or political beliefs), often emphasizing openness, critical thinking, and pluralism.","zh":"反对原教旨主义（尤指严格的宗教或政治信念），常强调开放、批判性思维与多元主义。"},"examples":[{"en":"In the article, antifundamentalism is presented as a defense of pluralism in a diverse society.","zh":"文章把反原教旨主义描述为在多元社会中对多元主义的捍卫。"},{"en":"Her antifundamentalism makes her cautious about any movement that claims it has the only truth.","zh":"她的反原教旨主义立场让她对任何声称“唯一真理”的运动都很谨慎。"}]},{"partOfSpeech":"n.","definition":{"en":"A social or political stance that resists fundamentalist influence in public life (for example, in education, law, or culture).","zh":"一种社会或政治立场：抵制原教旨主义对公共生活（如教育、法律或文化）的影响。"},"examples":[{"en":"The group’s antifundamentalism shaped its campaign for secular schools.","zh":"该团体的反原教旨主义立场影响了他们推动世俗学校的运动。"},{"en":"Debates about censorship sometimes become debates about antifundamentalism versus religious conservatism.","zh":"关于审查制度的争论有时会演变为“反原教旨主义”与“宗教保守主义”的对立。"}]}],"synonyms":["anti-fundamentalism","opposition to fundamentalism","anti-extremism (partial overlap)","anti-dogmatism (related)"],"phonetic":"ˌæntiˌfʌndəˈmɛntəlˌɪzəm","extraExplanation":["“antifundamentalism”通常用于学术写作、新闻评论或政治讨论中，比日常口语更常见。","“fundamentalism（原教旨主义）”最初多指基督教内部强调按字面理解《圣经》的运动，后来也扩展用于形容各种宗教或意识形态上的“极端教条化”。因此，“antifundamentalism”并不一定是“反宗教”，而更常指反对教条主义、排他性与极端化。","在一些语境中，这个词可能带有立场色彩：支持者把它理解为维护理性与自由；批评者可能把它理解为对传统信仰的不尊重。阅读时要注意作者态度与语境。"]}
{"word":"antifundamentalist","summary":{"en":"“Antifundamentalist” describes someone or something opposed to strict, rigid fundamentalist beliefs; it can also mean a person who holds that opposition.","zh":"“antifundamentalist”指反对原教旨主义（严格、僵化信条）的人或立场；也可作名词指“反原教旨主义者”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to fundamentalism, especially strict, literal, or rigid religious or ideological beliefs.","zh":"反对原教旨主义的；反对（宗教或意识形态上）严格字面化、僵化信条的。"},"examples":[{"en":"She is an antifundamentalist who supports a more flexible interpretation of religious texts.","zh":"她反对原教旨主义，支持对宗教文本更灵活的解读。"},{"en":"The article takes an antifundamentalist stance toward politics based on absolute certainty.","zh":"这篇文章对建立在“绝对确定性”之上的政治立场持反原教旨主义态度。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who opposes fundamentalism.","zh":"反对原教旨主义的人。"},"examples":[{"en":"As an antifundamentalist, he argues for dialogue between different groups.","zh":"作为一名反对原教旨主义的人，他主张不同群体之间进行对话。"}]}],"synonyms":["anti-dogmatic","anti-extremist","nonfundamentalist","anti-fundamentalist"],"phonetic":"/ˌæn.tiˌfʌn.dəˈmɛn.tə.lɪst/","extraExplanation":["“anti-”表示“反对/抵制”。“fundamentalist（原教旨主义者）”常指在宗教或政治/社会议题上坚持“唯一正确、必须照字面执行”的立场。把两者合在一起，“antifundamentalist”通常用于描述反对这种僵硬、排他态度的人或观点。","这个词在学术写作、新闻评论中更常见；日常口语里，人们也可能用“anti-fundamentalist”带连字符，或改用更具体的说法，如“opposed to religious extremism（反对宗教极端主义）”。","近义表达会因语境不同而变化：在宗教语境中可能接近“anti-extremist（反极端主义）”；在思想/政治语境中可能接近“anti-dogmatic（反教条的）”。注意这些词的力度与指向不完全相同。"]}
{"word":"antifungal","summary":{"en":"Antifungal means a medicine or property that kills fungi or stops fungal growth.","zh":"Antifungal 指“抗真菌的/抗真菌剂”，用于杀灭或抑制真菌生长。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medicine or substance that kills fungi or stops them from growing (used for infections like athlete’s foot or yeast infections).","zh":"抗真菌剂；用于杀死真菌或抑制真菌生长的药物/物质（常用于脚气、念珠菌等感染）。"},"examples":[{"en":"The doctor prescribed an antifungal cream for my athlete’s foot.","zh":"医生给我的脚气开了抗真菌药膏。"},{"en":"This shampoo has antifungal ingredients to help with dandruff caused by yeast.","zh":"这款洗发水含有抗真菌成分，有助于改善由酵母菌引起的头皮屑。"}]},{"partOfSpeech":"adj.","definition":{"en":"Designed to kill fungi or prevent fungal growth.","zh":"抗真菌的；用于杀灭或抑制真菌生长的。"},"examples":[{"en":"Use an antifungal spray in your shoes to reduce odor and infection risk.","zh":"在鞋里使用抗真菌喷雾可以减少异味和感染风险。"},{"en":"Tea tree oil is sometimes described as having antifungal properties.","zh":"茶树精油有时被认为具有抗真菌作用。"}]}],"synonyms":["antimycotic","fungicide"],"phonetic":"/ˌæn.tiˈfʌŋ.ɡəl/","extraExplanation":["在日常健康语境里，antifungal常见搭配有：antifungal cream（抗真菌药膏）、antifungal ointment（药膏/软膏）、antifungal spray（喷剂）、oral antifungal（口服抗真菌药）。","词形结构：anti- 表示“反对/对抗”，fungal 来自 fungus（真菌），合起来就是“对抗真菌的”。","区分：antibiotic（抗生素）主要对细菌有效；antifungal 对真菌有效。真菌感染常见于皮肤、脚趾缝、指甲等潮湿部位。"]}
{"word":"antifungals","summary":{"en":"Antifungals are medicines used to treat or prevent fungal infections.","zh":"Antifungals 指用于治疗或预防真菌感染的药物（抗真菌药）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Medicines (drugs) used to treat or prevent infections caused by fungi (such as athlete’s foot, ringworm, or yeast infections).","zh":"抗真菌药；用于治疗或预防由真菌引起的感染（如脚气/足癣、体癣/金钱癣、念珠菌感染等）的药物。"},"examples":[{"en":"The doctor prescribed antifungals for the skin infection.","zh":"医生开了抗真菌药来治疗皮肤感染。"},{"en":"Some antifungals come as creams, while others are pills.","zh":"有些抗真菌药是外用乳膏，也有的是口服药片。"},{"en":"Use the antifungals for the full course, even if you feel better.","zh":"即使感觉好转，也要按疗程把抗真菌药用完。"}]}],"synonyms":["antifungal drugs","antimycotics"],"phonetic":"/ˌæn.tiˈfʌŋ.ɡəlz/","extraExplanation":["“Antifungals”通常是复数用法，指“一类抗真菌药”。单数是“an antifungal”。","常见类型包括外用（cream/ointment/spray）和口服（pills/tablets）。学习时可留意常搭配：antifungal cream（抗真菌乳膏）、antifungal medication（抗真菌药物）、antifungal treatment（抗真菌治疗）。","日常用药表达里，英语常说“prescribe antifungals”（开抗真菌药），“apply antifungal cream”（涂抗真菌药膏），“take an antifungal”（服用抗真菌药）。"]}
{"word":"antifungin","summary":{"en":"Antifungin means an antifungal substance or medicine that stops fungi from growing.","zh":"antifungin 指“抗真菌剂/抗真菌药”，用于抑制或杀死真菌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance or medicine that kills fungi or stops them from growing (an antifungal agent)","zh":"抗真菌剂；抑制或杀死真菌生长的物质或药物（即“抗真菌药/抗真菌剂”）"},"examples":[{"en":"The doctor prescribed an antifungin to treat the skin infection.","zh":"医生开了抗真菌药来治疗皮肤感染。"},{"en":"This cream contains an antifungin that helps control athlete’s foot.","zh":"这种乳膏含有抗真菌成分，有助于控制脚气（足癣）。"}]}],"synonyms":["antifungal","fungicide","antimycotic"],"phonetic":"/ˌæn.tiˈfʌn.dʒɪn/","extraExplanation":["“antifungin”在现代英语中不算常见，更常见、也更标准的说法是 **antifungal**（抗真菌的/抗真菌药）。在医学或药品说明里，你更可能看到 *antifungal cream/ointment/medication*。","词形提示：anti-（反、抗）+ fungus（真菌）。因此含义通常就是“抗真菌的/抗真菌剂”。"]}
{"word":"antifungus","summary":{"en":"Antifungus refers to something that kills or prevents fungi; in everyday English, “antifungal” is more common.","zh":"antifungus 指“抗真菌的/抗真菌药”，但日常英语中更常用 antifungal。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medicine or substance that prevents fungal growth or kills fungi (often used to treat infections like athlete’s foot or yeast infections).","zh":"抗真菌药；抗霉菌剂（用于抑制或杀死真菌，常用于治疗脚气、念珠菌感染等）。"},"examples":[{"en":"The doctor prescribed an antifungus cream for my athlete’s foot.","zh":"医生给我的脚气开了抗真菌药膏。"},{"en":"Keep the area dry and use an antifungus powder if needed.","zh":"保持患处干燥，必要时使用抗真菌粉。"}]},{"partOfSpeech":"adj.","definition":{"en":"Preventing fungal growth; used to describe products or treatments designed to fight fungi.","zh":"抗真菌的；防霉的（用于描述具有抑制或对抗真菌作用的产品或治疗）。"},"examples":[{"en":"This antifungus spray is used for shoes to reduce odor and fungus.","zh":"这种抗真菌喷雾用于鞋子，能减少异味和真菌滋生。"},{"en":"Some soaps contain antifungus ingredients.","zh":"有些肥皂含有抗真菌成分。"}]}],"synonyms":["antifungal","fungicide","antimycotic"],"phonetic":"/ˌæn.tiˈfʌŋ.ɡəs/","extraExplanation":["在更常见、更标准的英语里，通常说 **antifungal**（抗真菌的/抗真菌药），比 **antifungus** 更常用、更自然。你在药品说明或医学语境中经常会看到：*antifungal cream/ointment/medication*。"]}

