{"word":"antiobesity","summary":{"en":"Antiobesity describes something designed to prevent or treat obesity.","zh":"antiobesity 指“用于预防或治疗肥胖的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"intended to prevent, reduce, or treat obesity; used to describe medicines, programs, policies, or products that target obesity.","zh":"用于预防、减少或治疗肥胖的；常用来形容针对肥胖的药物、项目、政策或产品。"},"examples":[{"en":"The clinic offers an antiobesity program that combines nutrition counseling and exercise.","zh":"这家诊所提供一个抗肥胖项目，把营养咨询和运动结合起来。"},{"en":"Researchers are developing antiobesity drugs to help patients manage their weight safely.","zh":"研究人员正在开发抗肥胖药物，帮助患者更安全地管理体重。"},{"en":"Some cities promote antiobesity policies such as healthier school meals.","zh":"一些城市推动抗肥胖政策，例如提供更健康的校餐。"}]}],"synonyms":["anti-obesity","weight-loss (more general)","anti-obesity medication","obesity-prevention"],"phonetic":"/ˌæn.taɪ.oʊˈbiː.si.ti/","extraExplanation":["“antiobesity”在学术与医疗语境中很常见，也常写作“anti-obesity”（加连字符）。两种写法通常都能接受；在正式写作中，跟在名词前作定语时用连字符更常见（如 anti-obesity drug）。","它一般是中性、技术性的词，多用于公共卫生（public health）、医学研究（clinical research）和政策讨论中；日常口语里更常说“weight-loss (减重的)”或“to help with weight (帮助控制体重)”。"]}
{"word":"Antioch","summary":{"en":"Antioch is the name of a historically important ancient city and also the name of several modern places, especially in the U.S.","zh":"Antioch（安提阿）既指一座在历史与早期基督教中很重要的古城，也可指多个现代地名（尤其在美国）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient city (near modern Antakya in Turkey), famous in Greek and Roman history and especially important in early Christianity.","zh":"安提阿（古城，靠近今土耳其安塔基亚），在希腊罗马史中著名，也因早期基督教发展而尤为重要。"},"examples":[{"en":"In the Book of Acts, Antioch becomes a major center for early Christian missionaries.","zh":"在《使徒行传》中，安提阿成为早期基督教宣教的重要中心。"},{"en":"Paul and Barnabas taught in Antioch for a long time.","zh":"保罗和巴拿巴在安提阿教导了很长时间。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name used for several modern towns and cities, especially in the United States (often named after the ancient Antioch).","zh":"安提阿（地名）：现代有多个城镇/城市使用这个名称，尤其在美国（多以古安提阿命名）。"},"examples":[{"en":"She lives in Antioch, California, near the San Francisco Bay Area.","zh":"她住在加州的安提阿（Antioch），靠近旧金山湾区。"},{"en":"They drove through Antioch on their way to Nashville.","zh":"他们开车去纳什维尔的路上经过了安提阿（Antioch）。"}]}],"synonyms":["Antakya (modern name for the ancient city)"],"phonetic":"ˈæn.ti.ɑːk","extraExplanation":["“Antioch/安提阿”这个名字源自希腊化时期的王名“Antiochus（安条克/安提阿古）”。塞琉古帝国的一些统治者常以此命名城市，因此历史上不止一座“Antioch”。","在英语里它通常被当作专有名词使用，首字母大写；具体指哪一个“Antioch”，要看上下文（如国家、州名或宗教/历史语境）。"]}
{"word":"Antiochene","summary":{"en":"Antiochene means “from or related to Antioch,” and can also refer to a person from Antioch or the Antioch tradition (especially in early Christianity).","zh":"Antiochene 指“安条克的/与安条克有关的”，也可指安条克人或（尤指早期基督教中的）安条克传统成员。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Antioch (an important ancient city in the eastern Mediterranean, now near Antakya in Turkey) or to its people, culture, or traditions","zh":"与安条克（古代东地中海重要城市，今土耳其安塔基亚附近）有关的；安条克的（指其人民、文化或传统）"},"examples":[{"en":"Antiochene Christians played an early role in the spread of Christianity.","zh":"安条克的基督徒在基督教早期传播中扮演了重要角色。"},{"en":"The museum has an Antiochene mosaic from the Roman period.","zh":"博物馆里有一件罗马时期的安条克马赛克作品。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Antioch, or someone belonging to the Antioch tradition (especially in early Christianity)","zh":"安条克人；（尤指早期基督教背景中的）安条克传统的追随者/成员"},"examples":[{"en":"As an Antiochene, he was familiar with the city’s diverse languages and trade.","zh":"作为安条克人，他熟悉这座城市多元的语言与贸易。"},{"en":"Some writers contrast Antiochenes with Alexandrians in early Christian theology.","zh":"一些作者在早期基督教神学中把安条克派与亚历山大派作对比。"}]}],"synonyms":["Antiochian","Syrian (context-dependent)"],"phonetic":"/ˌæn.tiˈɑː.kiːn/","extraExplanation":["“Antiochene”来自“Antioch（安条克）”。安条克在古代是重要的希腊化与罗马城市，也是早期基督教中心之一；《使徒行传》里提到门徒在安条克首次被称为“基督徒”。","在学术语境中常见“Antiochene school（安条克学派）”，多指早期基督教释经/神学传统，常被概括为较重视历史语境与字面意义的解读方式（与“Alexandrian school”常被并列比较）。","拼写上也可能见到“Antiochian”，意义接近；具体用哪个常取决于写作传统或学术领域。"]}
{"word":"antiochene","summary":{"en":"Antiochene means “of Antioch,” and it is also used in Christian studies for the tradition known as the School of Antioch.","zh":"Antiochene 意为“安条克的”；在基督教研究中也指“安条克学派”的神学与释经传统。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Antioch (an ancient city in the Near East) or to its people, culture, or history.","zh":"与安条克（近东古城）有关的；安条克的（人、文化或历史）。"},"examples":[{"en":"Antiochene merchants helped connect the Mediterranean world with inland trade routes.","zh":"安条克的商人帮助把地中海世界与内陆贸易路线连接起来。"},{"en":"We studied Antiochene art from the early Christian period.","zh":"我们学习了早期基督教时期的安条克艺术。"}]},{"partOfSpeech":"adj.","definition":{"en":"In Christianity, relating to the theological tradition sometimes called the School of Antioch, known for careful, more literal interpretation of scripture and a strong emphasis on Christ’s humanity.","zh":"（基督教）与“安条克学派”相关的；指一种神学传统，常以较为谨慎、偏向字面（历史语境）的释经方式著称，并强调基督的人性。"},"examples":[{"en":"The Antiochene approach often contrasts with the Alexandrian approach to biblical interpretation.","zh":"安条克学派的释经方式常与亚历山大学派形成对比。"},{"en":"Her paper compares Antiochene and Alexandrian Christology.","zh":"她的论文比较了安条克与亚历山大两种基督论。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Antioch, or someone associated with Antiochene Christianity or theology.","zh":"安条克人；或与安条克基督教/安条克神学传统有关的人。"},"examples":[{"en":"Ancient sources describe him as an Antiochene who later moved to Constantinople.","zh":"古代史料称他是安条克人，后来迁往君士坦丁堡。"},{"en":"Some writers call Theodore of Mopsuestia an influential Antiochene.","zh":"一些作者称摩普绥提亚的狄奥多若是有影响力的安条克学派人物。"}]}],"synonyms":["Antiochian","of Antioch","Syrian (historical context)"],"phonetic":"/ænˌtiˈɑːkin/","extraExplanation":["“Antiochene”在学术语境里常见于教会史与神学史（尤其是晚期古代与早期基督教）。在日常英语里更常见的拼写是“Antiochian”（如：Antiochian Orthodox Church）。","安条克（Antioch）历史上是罗马帝国的重要城市之一（今土耳其哈塔伊省一带），在早期基督教传播与教会发展中占有关键地位。"]}
{"word":"Antiochian","summary":{"en":"Antiochian means “related to Antioch” or “related to the Antiochian Orthodox Church,” and it can also mean a member of that church.","zh":"Antiochian 表示“与安提阿有关”或“与安提阿东正教会有关”，也可指该教会的成员。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Antioch (an ancient city in today’s Turkey/Syria region), or to the Christian traditions connected with Antioch.","zh":"与安提阿（古城，位于今土耳其/叙利亚一带）有关的；或与安提阿相关的基督教传统有关的。"},"examples":[{"en":"Antiochian history played an important role in early Christianity.","zh":"安提阿的历史在早期基督教中扮演了重要角色。"},{"en":"She studies Antiochian theology and early church writings.","zh":"她研究安提阿传统的神学与早期教会著作。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the Antiochian Orthodox Church (one of the Eastern Orthodox churches).","zh":"与安提阿东正教会有关的（东正教诸教会之一）。"},"examples":[{"en":"They attend an Antiochian Orthodox parish on Sundays.","zh":"他们周日去安提阿东正教会的堂区参加礼拜。"},{"en":"The community celebrates Antiochian liturgical traditions.","zh":"这个团体庆祝安提阿传统的礼仪。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Antioch, or (more commonly today) a member of the Antiochian Orthodox Church.","zh":"安提阿人；或（现代更常见）安提阿东正教会的成员。"},"examples":[{"en":"He identifies as Antiochian Orthodox.","zh":"他自认属于安提阿东正教会。"},{"en":"Several Antiochians in the diaspora keep the old customs alive.","zh":"一些侨居海外的安提阿人仍在延续旧有风俗。"}]}],"synonyms":["Antiochene","Syrian Orthodox (context-dependent)","Eastern Orthodox (broader)"],"phonetic":"ˌæn.tiˈoʊ.ki.ən","extraExplanation":["“Antiochian”常见于宗教与历史语境。这里的“Antioch（安提阿）”通常指古代重要城市（古称安提阿，曾是罗马帝国时期的大都会），在基督教史上地位突出。","在英语里谈到“Antiochian Orthodox”时，一般特指“Antiochian Orthodox Christian Archdiocese”等相关机构/群体；实际成员可能来自不同民族背景，不一定来自安提阿这座城市本身。"]}
{"word":"antiochian","summary":{"en":"Antiochian means “from or relating to Antioch,” and can also mean a person from Antioch.","zh":"Antiochian 表示“安提阿的/与安提阿有关的”，也可指“安提阿人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to Antioch (an important ancient city; today near Antakya in Turkey) or to people/culture from there.","zh":"与安提阿（古代重要城市，今土耳其安塔基亚附近）有关的；安提阿的；安提阿人的/文化的。"},"examples":[{"en":"The museum has Antiochian mosaics from the Roman period.","zh":"这家博物馆收藏了罗马时期的安提阿马赛克作品。"},{"en":"She studies Antiochian history and early Christianity in Syria.","zh":"她研究安提阿历史以及叙利亚地区的早期基督教。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Antioch.","zh":"安提阿人；来自安提阿的人。"},"examples":[{"en":"In the story, an Antiochian travels to Alexandria for trade.","zh":"在故事里，一位安提阿人前往亚历山大港做生意。"}]}],"synonyms":["Antiochene"],"phonetic":"/ˌæn.tiˈɑː.ki.ən/","extraExplanation":["“Antiochian”多见于历史、考古、宗教研究语境：古代安提阿是希腊化与罗马时期的重要城市，也是早期基督教的重要中心之一。","容易与宗教用语混淆：你可能还会看到“Antiochene”（也指与安提阿相关，尤其在神学/教会传统中更常见）、“Antiochian Orthodox”（通常指安提阿宗主教区的东正教传统）。"]}
{"word":"Antiochianism","summary":{"en":"Antiochianism refers to a theological style from the early Church’s Antiochene tradition, especially known for literal-historical Bible interpretation and a distinctive Christological emphasis.","zh":"Antiochianism 指早期教会安提阿传统的一种神学风格，尤以字面—历史语境的解经方法与特定的基督论侧重点而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A theological approach linked to the early Christian “School of Antioch,” known for emphasizing the plain (literal) and historical meaning of biblical texts and a careful distinction between Christ’s human and divine natures.","zh":"与早期基督教“安提阿学派”相关的一种神学取向，强调对《圣经》文本的字面与历史语境解读，并倾向于在基督论上更清楚地区分基督的人性与神性。"},"examples":[{"en":"Some historians describe Antiochianism as favoring a historical reading of Scripture over allegory.","zh":"一些历史学者把“安提阿主义”描述为更偏向以历史语境来解读《圣经》，而不是寓意式解读。"},{"en":"In surveys of early Christology, Antiochianism is often contrasted with Alexandrian approaches.","zh":"在早期基督论的概述中，“安提阿主义”常被拿来与“亚历山大传统/取向”作对比。"}]}],"synonyms":["Antiochene theology","the Antiochene School","Antiochene tradition"],"phonetic":"/ˌæn.tiˈoʊ.ki.əˌnɪ.zəm/","extraExplanation":["“Antiochianism”较少见，更多时候会用“the Antiochene School（安提阿学派）/ Antiochene theology（安提阿传统神学）”来表达。","“安提阿学派”常被概括为：重视文本的语法与历史背景（grammatical-historical reading），相对不那么偏好把经文大量解释成象征或寓意。","在基督论讨论中，它常与“亚历山大取向”并举：安提阿传统更强调基督真实的人性与历史性；亚历山大传统更强调神性与合一性。这里是概括性说法，具体作者与时期差异很大。","注意不要与“Antiochian Orthodox（安提阿正教会传统/安提阿宗主教区）”简单等同：它们在历史上有关联，但“Antiochianism”作为术语通常指一种早期解经与神学风格。"]}
{"word":"antiochianism","summary":{"en":"Antiochianism is a theological tradition linked to the early Christian School of Antioch, especially known for literal, historically grounded interpretation of Scripture and associated doctrinal tendencies.","zh":"安提阿主义指与早期基督教安提阿学派相关的神学传统，尤以强调字面、历史语境的圣经解释以及相应的教义倾向而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A theological approach associated with the early Christian School of Antioch, known for emphasizing the literal (historical-grammatical) meaning of Scripture rather than heavy allegory.","zh":"与早期基督教“安提阿学派”相关的一种神学取向，强调圣经的字面（历史—语法）解释，而非大量寓意化解读。"},"examples":[{"en":"In his paper, he contrasts Antiochianism with the allegorical style often linked to Alexandria.","zh":"在论文中，他把安提阿主义与常被认为源自亚历山大学派的寓意式解经作了对比。"},{"en":"Antiochianism tends to read biblical narratives as grounded in real historical contexts.","zh":"安提阿主义往往把圣经叙事理解为扎根于真实的历史语境之中。"}]},{"partOfSpeech":"n.","definition":{"en":"More broadly, the set of doctrines or tendencies identified with Antiochene theology, especially in Christology (how Christians understand the nature of Christ).","zh":"更广义地指被归为“安提阿神学”的一组教义或倾向，尤其涉及基督论（对基督本性的理解）。"},"examples":[{"en":"The course covers Antiochianism and Alexandrian theology as two major streams of early Christian thought.","zh":"这门课讲解安提阿主义与亚历山大神学这两条早期基督教思想的重要脉络。"},{"en":"Some debates about Antiochianism focus on how it describes the relationship between Christ’s humanity and divinity.","zh":"一些关于安提阿主义的争论，聚焦于它如何描述基督的人性与神性之间的关系。"}]}],"synonyms":["Antiochene theology","the Antiochene school (tradition)","Antiochene exegesis"],"phonetic":"/ˌæntiˈoʊkiəˌnɪzəm/","extraExplanation":["“Antiochianism”来自叙利亚地区的安提阿（Antioch）这一早期基督教中心城市。安提阿学派常与“亚历山大学派”并举：前者偏向文本的历史语境与语法意义，后者更常用寓意式（allegorical）解读。","在教会史与神学史写作中，这个词多用于概括一种“倾向”而非单一教条；不同作者对其边界与代表人物的归类可能略有差异。","相关人物常被提到的有狄奥多若（Theodore of Mopsuestia）与若望·金口（John Chrysostom，尤其在解经风格上）。在基督论争中也常作为背景框架出现。"]}
{"word":"Antiochus","summary":{"en":"Antiochus is a historical male name, especially used by several Seleucid kings in the Hellenistic era.","zh":"Antiochus 是一个历史上的男性名字，尤其指希腊化时代塞琉古帝国多位国王的名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name best known from ancient history, used by several kings of the Seleucid Empire (a Greek-ruled kingdom in the Middle East after Alexander the Great).","zh":"一个男性名字，最常见于古代史；塞琉古帝国（亚历山大大帝之后的希腊化王国）中有多位国王使用此名。"},"examples":[{"en":"Antiochus IV Epiphanes is a famous Seleucid king mentioned in historical and religious texts.","zh":"安条克四世（“神显者”）是一位著名的塞琉古国王，在历史与宗教文献中常被提及。"},{"en":"The name Antiochus appears often when studying the Hellenistic period.","zh":"学习希腊化时代时，常会看到“Antiochus/安条克”这个名字。"}]}],"synonyms":["Antiochus IV Epiphanes","Seleucid king","Hellenistic ruler"],"phonetic":"/ænˈtaɪ.ə.kəs/","extraExplanation":["“Antiochus”是拉丁化的拼写形式，中文常译为“安条克”。同名者很多，常见编号如Antiochus I、II、III、IV等，具体指谁要看上下文。","在《圣经·但以理书》及后来的犹太历史（如马加比起义相关记载）中，最常被讨论的是Antiochus IV Epiphanes（安条克四世），因为其宗教政策引发强烈冲突。","读历史文章时可以注意：Antiochus（人名）与Antioch（安提阿/安条克，地名）很像，但一个是“人”，一个是“城”。"]}
{"word":"antiodont","summary":{"en":"An antio dont is an opposing tooth in the other jaw that contacts another tooth when you bite.","zh":"antiodont 指对颌牙：位于另一颌、在咬合时与某牙接触的牙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an opposing tooth; a tooth in the opposite jaw that meets or bites against another tooth when you close your mouth.","zh":"对颌牙；位于相对颌、在咬合时与另一颗牙相接触（对咬）的牙。"},"examples":[{"en":"The dentist checked whether the filling was hitting the antio dont too early.","zh":"牙医检查补牙后的牙是否过早接触到对颌牙。"},{"en":"Pain can occur when a damaged tooth keeps rubbing against its antio dont during chewing.","zh":"咀嚼时受损牙反复与对颌牙摩擦，可能会引起疼痛。"}]}],"synonyms":["opposing tooth","antagonist tooth"],"phonetic":"/ˌæn.taɪˈoʊ.dɑnt/","extraExplanation":["这个词比较少见，更多出现在牙科/解剖学语境中。词源上可理解为 anti-（相对、对面的）+ odont（牙，见于 orthodontics「正畸」等词根）。日常英语里更常用的说法是 “opposing tooth/antagonist tooth（对颌牙）”。"]}
{"word":"antiodontalgic","summary":{"en":"A rare medical adjective meaning “relieving or preventing toothache.”","zh":"一个较少见的医学形容词，意思是“止牙痛的；缓解或预防牙痛的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Relieving or preventing toothache; used to reduce dental pain.","zh":"（医学）止牙痛的；用于缓解或预防牙齿疼痛的。"},"examples":[{"en":"The dentist prescribed an antiodontalgic gel to ease the toothache.","zh":"牙医开了一种止牙痛凝胶来缓解牙痛。"},{"en":"Clove oil is sometimes used as an antiodontalgic home remedy, but you should still see a dentist.","zh":"丁香油有时被当作家庭止牙痛方法使用，但你仍然应该去看牙医。"}]}],"synonyms":["analgesic (for toothache)","pain-relieving","dental analgesic"],"phonetic":"/ˌæn.taɪ.oʊ.dɑnˈdæl.dʒɪk/","extraExplanation":["这个词非常少见，多用于医学/药学语境。词形可拆为 anti-（反、对抗）+ odont-（牙，源自希腊语 odous/odont-）+ -algic（疼痛的，和 pain 相关）。合起来就是“对抗牙痛的”。","日常英语里更常说 toothache medicine / pain reliever / dental analgesic。你也可能在说明书或旧式医学文献中看到 antiodontalgic。"]}
{"word":"antioncogene","summary":{"en":"An anti-oncogene is a gene that protects against cancer by controlling cell growth and repairing damage (tumor suppressor gene).","zh":"抑癌基因是通过控制细胞生长与修复损伤来预防癌症的基因（肿瘤抑制基因）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a gene that helps prevent cancer by slowing cell division, repairing DNA damage, or causing damaged cells to die; also called a tumor suppressor gene","zh":"抑癌基因；通过减缓细胞分裂、修复DNA损伤或促使受损细胞死亡来预防癌症的基因；也称“肿瘤抑制基因”"},"examples":[{"en":"Mutations in an anti-oncogene can remove the “brakes” on cell growth and increase cancer risk.","zh":"抑癌基因发生突变可能会失去对细胞生长的“刹车”作用，从而增加癌症风险。"},{"en":"Scientists study anti-oncogenes to understand why some tumors form and how to stop them.","zh":"科学家研究抑癌基因，以了解肿瘤为何形成以及如何阻止它们。"}]}],"synonyms":["tumor suppressor gene","tumour suppressor gene"],"phonetic":"/ˌæntiˈɑːnkədʒiːn/","extraExplanation":["“anti-oncogene”在现代生物医学里常与“tumor suppressor gene（肿瘤抑制基因）”互换使用；日常科普与学术论文中，“tumor suppressor gene”更常见。","常见例子包括TP53（p53）、RB1（视网膜母细胞瘤基因）、BRCA1/BRCA2（与DNA修复相关）。它们并不是“杀死癌细胞”的基因，而是维持细胞正常秩序的关键调控因子。","理解时可对比“oncogene（致癌基因）”：致癌基因像“油门卡住”，而抑癌基因更像“刹车失灵”。两者失衡都可能导致细胞异常增殖。"]}
{"word":"Antiope","summary":{"en":"Antiope is best known as an Amazon queen in Greek mythology, and it is also used as a female given name.","zh":"Antiope 最常指希腊神话中的亚马逊女王“安提俄珀”，也可用作女性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) An Amazon queen, often said to be the sister of Hippolyta; in many stories she becomes connected with the hero Theseus (through marriage or abduction, depending on the version).","zh":"（希腊神话）安提俄珀：亚马逊女王，常被说是希波吕忒的姐妹；许多故事中她与英雄忒修斯有关（有的版本说结婚，有的说被掳走）。"},"examples":[{"en":"In Greek myth, Antiope is sometimes portrayed as an Amazon who marries Theseus.","zh":"在希腊神话中，安提俄珀有时被描写为嫁给忒修斯的亚马逊人。"},{"en":"Different retellings describe Antiope’s fate in different ways.","zh":"不同的改写版本对安提俄珀的结局有不同描写。"}]},{"partOfSpeech":"n.","definition":{"en":"A female given name used in English and other languages, taken from the mythological figure.","zh":"女性名字：源自神话人物“安提俄珀”，在英语等语言中用作人名。"},"examples":[{"en":"Antiope is an uncommon but recognizable name in literature-inspired families.","zh":"在受文学与神话影响的家庭里，Antiope 是个少见但可辨识的名字。"},{"en":"Her middle name is Antiope, chosen for its mythological history.","zh":"她的中间名是 Antiope，是因为其神话背景而选的。"}]}],"synonyms":["(myth-related) Amazon queen","(related figures) Hippolyta","Theseus"],"phonetic":"/ænˈtaɪ.ə.pi/","extraExplanation":["“Antiope”的故事在古典文献与后世改写中有多种版本：有时她被称为忒修斯的妻子，有时被描述为被掳走；也有人把她与另一位亚马逊（如 Hippolyta / Hippolyte）混用或替换。阅读时可留意作者采用的是哪一条传统。","词源常解释为来自希腊语成分 anti-（对抗）+ ops/ōps（面貌、眼睛、外观）等的组合，因此在文化解读上常被联想到“对抗、相对”的含义，但作为人名时通常更强调其神话联想。"]}
{"word":"antiope","summary":{"en":"Antiope is a name from Greek mythology (several women share it, including a Theban princess and an Amazon) and also the name of an asteroid (90 Antiope).","zh":"Antiope（安提俄珀）是希腊神话中的名字（可指不同女性，如底比斯公主或亚马逊女战士），也可指小行星“第90号安提俄珀”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) A Theban princess loved by Zeus; in many versions she is the mother of the twins Amphion and Zethus.","zh":"（希腊神话）底比斯的公主，宙斯的恋人；许多版本中她是双胞胎安菲翁（Amphion）和泽托斯（Zethus）的母亲。"},"examples":[{"en":"In Greek myth, Antiope is linked to Thebes and the birth of Amphion and Zethus.","zh":"在希腊神话中，安提俄珀与底比斯以及安菲翁和泽托斯的诞生有关。"},{"en":"Some retellings describe Antiope’s suffering before she is finally rescued.","zh":"一些改写版本描写安提俄珀在最终获救前经历了许多苦难。"}]},{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) An Amazon (warrior woman) in some traditions, sometimes described as a queen of the Amazons.","zh":"（希腊神话）在某些传统中指一位亚马逊（女战士），有时被描述为亚马逊女王之一。"},"examples":[{"en":"Antiope is sometimes named as an Amazon connected with Theseus in later stories.","zh":"在较晚的故事里，安提俄珀有时被说成与忒修斯（Theseus）有关的亚马逊女战士。"},{"en":"Different sources use the name Antiope for different mythic women.","zh":"不同的资料会用“安提俄珀”这个名字指代不同的神话女性。"}]},{"partOfSpeech":"n.","definition":{"en":"(Astronomy) 90 Antiope, a main-belt asteroid known for being a nearly equal-sized binary pair.","zh":"（天文学）小行星带中的第90号小行星“安提俄珀”，以几乎等大、成双的小行星系统而著名。"},"examples":[{"en":"90 Antiope is famous because it is a binary asteroid system.","zh":"第90号小行星“安提俄珀”因其双小行星系统而闻名。"}]}],"synonyms":["(proper name)"],"phonetic":"/ænˈtaɪ.ə.pi/","extraExplanation":["“Antiope/安提俄珀”是专有名词，在英文里通常当作人名或天体名称使用。因为古典资料版本很多，同名人物可能有不同身份（如底比斯公主或亚马逊女战士），阅读时可根据上下文（底比斯、宙斯、双胞胎；或亚马逊、忒修斯等线索）判断指的是哪一位。"]}
{"word":"antiopelmous","summary":{"en":"“antiopelmous” is not recognized as a standard English word; it is likely a misspelling or a rare specialized term.","zh":"“antiopelmous”不是标准英语单词；更可能是拼写错误或极少见的专业词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It appears to be a misspelling or a very rare/technical term that is not found in common dictionaries.","zh":"不是标准英语单词。看起来像拼写错误，或是非常罕见/专业的术语，常见词典中一般查不到。"},"examples":[{"en":"I couldn’t find “antiopelmous” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里查不到“antiopelmous”——你能把它出现的句子发给我吗？"},{"en":"It might be a typo; checking the original source can help confirm the correct spelling.","zh":"它可能是拼写错误；回到原始出处核对拼写会更准确。"}]}],"synonyms":["unknown word","possible typo","antiwar (if the intended meaning is ‘against war’)"],"extraExplanation":["如果你是想表达“反战/反对战争”，英语里最常见的是 antiwar（反战的）。也可能你想找的是 antipolemos（源自希腊语，意为“反战的”，但在英语里非常少见，多见于学术/特定语境）。","也有可能是把某个专有名词拼错了（例如人名、地名、作品名）。把上下文句子或更接近的拼写（比如你想表达的意思、读音、来源语言）发我，我可以帮你定位最可能的正确词。"]}
{"word":"antiophthalmic","summary":{"en":"Antiophthalmic describes something used to prevent or treat eye inflammation or disease.","zh":"antiophthalmic 指用于预防或治疗眼部炎症或疾病的（医学用语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"preventing or treating inflammation or disease of the eyes (used mainly in medical contexts).","zh":"抗眼炎的；用于预防或治疗眼部炎症或疾病的（多用于医学语境）。"},"examples":[{"en":"The doctor prescribed an antiophthalmic ointment for the eye infection.","zh":"医生开了抗眼炎的眼膏来治疗眼部感染。"},{"en":"The label says the drops are antiophthalmic and should be used twice a day.","zh":"标签上写着这种滴眼液具有抗眼炎作用，应每天使用两次。"}]}],"synonyms":["ophthalmic (context-dependent)","anti-inflammatory (for the eyes, context-dependent)","eye-related medicinal"],"phonetic":"/ˌæn.tiˌɑfˈθæl.mɪk/","extraExplanation":["这个词由前缀 anti-（“反、抗”）+ ophthalmic（“眼科的/与眼有关的”）组成，通常出现在药品说明、医学论文或较正式的医疗语境里；日常英语中更常见的说法是 “for eye inflammation/infection”（用于眼部炎症/感染）或直接说 “eye drops/eye ointment”（滴眼液/眼膏）。","注意：antiophthalmic 是描述“作用/用途”的形容词，并不指某一种特定药物成分。实际用药需遵医嘱。"]}
{"word":"antiopium","summary":{"en":"Anti-opium means opposing opium or the opium trade, and it can also refer to people or movements that fight against opium.","zh":"anti-opium 表示“反对鸦片或鸦片贸易的”，也可指“反鸦片人士/团体/运动”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to the use, sale, or spread of opium; supporting efforts to restrict or ban opium.","zh":"反对鸦片（使用、贩卖或传播）的；支持限制或禁止鸦片的。"},"examples":[{"en":"The newspaper ran an anti-opium campaign to warn people about addiction.","zh":"这家报纸发起了反鸦片运动，提醒人们警惕成瘾。"},{"en":"Some groups formed anti-opium societies in the late 1800s.","zh":"19世纪末，一些团体成立了反鸦片社团。"}]},{"partOfSpeech":"n.","definition":{"en":"a person, group, or movement that opposes opium.","zh":"反鸦片的人（或团体、运动）。"},"examples":[{"en":"The anti-opium argued that the trade harmed public health.","zh":"反鸦片人士认为鸦片贸易危害公共健康。"},{"en":"Anti-opium activists pushed for stricter laws.","zh":"反鸦片活动人士推动更严格的法律。"}]}],"synonyms":["opposed to opium","anti-drug (broader)","prohibitionist (context-dependent)"],"phonetic":"ˌæntiˈoʊpiəm","extraExplanation":["“anti-opium”更常见的写法是带连字符的 anti-opium；写成一个词“antiopium”较少见，通常出现在历史讨论或特定文本中。","在历史语境里，“anti-opium”常与19世纪的禁烟/禁毒改革、传教士与社会改良运动、以及与鸦片贸易相关的国际争议联系在一起；中文语境中也常让人联想到近代“禁烟”与鸦片战争前后的社会问题。"]}
{"word":"antiopiumist","summary":{"en":"An antiopiumist is someone who opposes opium use or the opium trade, especially in historical discussions.","zh":"antiopiumist 指反对鸦片使用或鸦片贸易的人，尤用于历史讨论。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is strongly opposed to the use, sale, or trade of opium (often in a historical context).","zh":"反对鸦片的人；反鸦片主义者（常见于历史语境中）。"},"examples":[{"en":"Some antiopiumists argued that the opium trade harmed both public health and society.","zh":"一些反鸦片主义者认为鸦片贸易损害了公共健康与社会。"},{"en":"In the late 1800s, antiopiumists published articles calling for strict laws against opium.","zh":"在19世纪末，一些反鸦片主义者发表文章，呼吁制定严厉的禁鸦片法律。"}]}],"synonyms":["opponent of the opium trade","anti-opium activist","anti-drug reformer"],"phonetic":"/ˌæn.tiˈoʊ.pi.əm.ɪst/","extraExplanation":["这个词比较少见，结构是 anti-（反对）+ opium（鸦片）+ -ist（……主义者/……者）。通常用于讨论19世纪与20世纪初的“反鸦片运动”，例如中国的禁烟主张、以及英美一些宗教与社会改革团体对鸦片贸易的批评。","在历史写作中，它可能出现在关于“鸦片战争”背景、国际贸易争议、公共卫生与道德改革的讨论里。现代英语里更常见的表达是 anti-opium campaigners（反鸦片运动者）或 opponents of the opium trade（反对鸦片贸易的人）。"]}
{"word":"antiopiumite","summary":{"en":"A rare historical term for someone who opposed opium use or, especially, the opium trade.","zh":"较少见的历史用词，指反对鸦片使用或（尤指）反对鸦片贸易的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposed the use of opium, especially the opium trade (often in 19th-century political and moral debates)","zh":"反对鸦片使用的人；尤指反对鸦片贸易的人（常见于19世纪的政治与道德争论语境）"},"examples":[{"en":"Some antiopiumites campaigned to end the opium trade on moral grounds.","zh":"一些反对鸦片者以道德理由发起运动，要求终止鸦片贸易。"},{"en":"In newspapers of the time, antiopiumites argued that opium harmed families and society.","zh":"在当时报纸上，反对鸦片者主张鸦片危害家庭与社会。"}]}],"synonyms":["anti-opium activist","opponent of the opium trade","anti-opium campaigner","opium prohibitionist"],"phonetic":"ˌæntiˈoʊpiəˌmaɪt","extraExplanation":["“antiopiumite”是较少见的历史用词，通常出现在19世纪英语出版物中，用来指反对鸦片制度（尤其是贸易与输入）的人或团体。它常与英帝国贸易政策、传教士与社会改革者的倡议、以及与东亚相关的鸦片历史背景一起出现。","构词上可拆为 anti-（反对）+ opium（鸦片）+ -ite（表示“……的人/支持者或参与者”）。更常见的现代说法会用“anti-opium activist / anti-opium campaigner / opponent of the opium trade”等。"]}
{"word":"antioptimism","summary":{"en":"Antioptimism is an attitude that rejects optimism and tends to expect negative outcomes.","zh":"Antioptimism 指一种反对或不信任乐观、倾向于预期负面结果的态度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A general attitude or belief that rejects or distrusts optimism; a tendency to expect that things will not turn out well (often close to “pessimism”).","zh":"反乐观主义；一种排斥或不信任乐观的态度；倾向于认为事情不会有好结果（常接近“悲观主义”）。"},"examples":[{"en":"Her antioptimism made it hard for her to celebrate small successes.","zh":"她的反乐观倾向让她很难为一些小成就感到开心。"},{"en":"In tough economic times, antioptimism can spread quickly through a community.","zh":"在经济困难时期，反乐观情绪可能会在社区里迅速蔓延。"}]}],"synonyms":["pessimism","cynicism","skepticism","negative outlook"],"phonetic":"/ˌæn.taɪˈɑp.təˌmɪz.əm/","extraExplanation":["这个词不算常见，更常用的标准表达是 pessimism（悲观主义）或 skepticism about optimism（对乐观持怀疑态度）。","构词上是 anti-（反对）+ optimism（乐观主义）。在写作中用 antioptimism 往往带有“刻意反对过度乐观/鸡汤式乐观”的意味，而不一定是全面消极。"]}
{"word":"antioptimist","summary":{"en":"An antioptimist is someone who expects negative outcomes; basically a pessimist.","zh":"antioptimist 指总预期负面结果的人，基本等同于“悲观者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who tends to expect bad outcomes or doubts that things will improve; an anti-optimist (similar to a pessimist).","zh":"一个倾向于预期坏结果、怀疑事情会变好的人；反乐观主义者（意思接近“悲观主义者”）。"},"examples":[{"en":"He’s an antioptimist—he assumes every plan will fail.","zh":"他是个反乐观主义者——总觉得每个计划都会失败。"},{"en":"Don’t be an antioptimist; the team has improved a lot this year.","zh":"别那么反乐观了；这个团队今年进步很大。"},{"en":"She sounds like an antioptimist when she talks about the future.","zh":"她谈到未来时听起来很反乐观。"}]}],"synonyms":["pessimist","doomster","cynic"],"phonetic":"/ˌæntiˈɑptəmɪst/","extraExplanation":["“antioptimist”不是非常常见的标准词，更常用的是“pessimist（悲观者）”。如果你想表达“反对那种不切实际的乐观”，也可以说“skeptical of optimism（对乐观持怀疑态度）”或“cautiously pessimistic（谨慎悲观）”。","构词法：anti-（反对）+ optimist（乐观主义者）。在写作中用它会带一点“刻意造词/强调对立”的语气。"]}
{"word":"antioptimistic","summary":{"en":"“Antioptimistic” means not optimistic or opposed to optimism; it describes a negative or doubtful outlook.","zh":"antioptimistic 指“不乐观的/反乐观主义的”，形容消极或怀疑的态度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not optimistic; opposed to optimism; expecting negative outcomes rather than positive ones.","zh":"不乐观的；反对乐观主义的；倾向于预期负面结果的。"},"examples":[{"en":"After the market crash, his tone became openly antioptimistic.","zh":"股市崩盘后，他的语气变得明显不乐观。"},{"en":"The report takes an antioptimistic view of the economy, focusing on risks instead of growth.","zh":"这份报告对经济持不乐观的看法，强调风险而不是增长。"},{"en":"She wasn’t trying to be rude—just antioptimistic about the plan’s chances.","zh":"她并不是想无礼，只是对这个计划成功的可能性不乐观。"}]}],"synonyms":["pessimistic","downbeat","negative","not optimistic","doubtful"],"phonetic":"/ˌæntaɪˌɑptəˈmɪstɪk/","extraExplanation":["“anti-”是常见前缀，表示“反对、抵制、与……相反”。因此 antioptimistic 直译就是“反乐观的/与乐观相反的”。","这个词在日常英语里不算常见；更自然、更常用的表达通常是 pessimistic（悲观的）或 not optimistic（不乐观）。如果你想强调“立场上反对‘盲目乐观’”，antioptimistic 会更贴近“反乐观主义”的语气。"]}
{"word":"antioptimistical","summary":{"en":"“Antioptimistical” means anti-optimistic—expecting negative outcomes; it’s uncommon, so “anti-optimistic” or “pessimistic” is usually better.","zh":"“antioptimistical”指“反乐观的/不乐观的”；该词不常用，通常用“anti-optimistic”或“pessimistic（悲观的）”更自然。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to optimism; tending to expect negative outcomes rather than hopeful ones. (This word is understandable but uncommon; “anti-optimistic” is more typical.)","zh":"反对乐观的；倾向于预期不好的结果而不是抱有希望的。（这个词能被理解，但不常用；更常见的是“anti-optimistic”。）"},"examples":[{"en":"His antioptimistical attitude made it hard for the team to stay motivated.","zh":"他那种反乐观的态度让团队很难保持动力。"},{"en":"The report sounded antioptimistical about the economy for the next year.","zh":"这份报告对明年经济的语气听起来相当不乐观。"},{"en":"Try not to be antioptimistical—prepare for problems, but also look for solutions.","zh":"尽量别太不乐观——可以为问题做准备，但也要寻找解决办法。"}]}],"synonyms":["pessimistic","anti-optimistic","gloomy","negative","downbeat"],"phonetic":"/ˌæn.taɪˌɑp.təˈmɪs.tɪ.kəl/","extraExplanation":["“antioptimistical”在现代英语里很少见，更自然的写法通常是“anti-optimistic”或更常用的“pessimistic（悲观的）”。如果你在正式写作中使用，读者可能会觉得生造或过于罕见。","构词上：anti-（反对）+ optimistic（乐观的）+ -al（形容词后缀），意思清楚，但不如常见词简洁。"]}
{"word":"antioptimistically","summary":{"en":"Antioptimistically means “in a not-optimistic or anti-optimism way,” often sounding pessimistic or critical of optimism.","zh":"antioptimistically 指“以不乐观/反乐观主义的方式”，语气常偏悲观，或用来批判过度乐观。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not optimistic; expecting negative outcomes or emphasizing problems rather than hope.","zh":"以不乐观的方式；倾向于预期负面结果，强调问题而非希望。"},"examples":[{"en":"He spoke antioptimistically about the project, focusing on what could go wrong.","zh":"他对这个项目的发言很不乐观，主要在强调可能出错的地方。"},{"en":"The report reads antioptimistically, predicting more layoffs next year.","zh":"这份报告的语气偏悲观，预测明年会有更多裁员。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that argues against optimism as an attitude (often in critique or analysis).","zh":"以反对“乐观主义”这种态度的方式（常用于评论或分析中的批判语气）。"},"examples":[{"en":"The essay discusses progress antioptimistically, questioning the idea that things naturally get better.","zh":"这篇文章以反乐观主义的角度讨论“进步”，质疑事情会自然变好的观念。"}]}],"synonyms":["pessimistically","gloomily","bleakly","cynically","not very optimistically"],"phonetic":"/ˌæn.taɪˌɑp.təˈmɪs.tɪ.kli/","extraExplanation":["这个词不算常见，更常见的说法是 pessimistically（悲观地）或 not very optimistically（不太乐观地）。","构词法：anti-（反对、对立）+ optimistically（乐观地）。因此它带有“反乐观/不认同乐观叙事”的语气，常用于评论、写作或较正式的语境。"]}
{"word":"antioptionist","summary":{"en":"Antioptionist is a rare word for a person (or stance) opposed to options—often executive stock options or option-based policies.","zh":"Antioptionist 是一个较罕见的词，指（某人或立场）反对“期权/选择权”，常见于反对高管股票期权或以期权为核心的政策语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) A person who opposes “options,” especially stock options or option-based policies; someone against optionism.","zh":"（罕见）反对“期权/选择权”（尤其是股票期权或以期权为核心的制度/政策）的人；反对“期权主义/选择权政策”的人。"},"examples":[{"en":"Some antioptionists argue that executive stock options encourage short-term decisions.","zh":"一些反对期权的人认为，高管股票期权会刺激短期决策。"},{"en":"The proposal was criticized by antioptionists as unfair to ordinary employees.","zh":"该提案被反对期权的人批评为对普通员工不公平。"}]},{"partOfSpeech":"adj.","definition":{"en":"Opposed to options, especially stock-option compensation or option-based systems.","zh":"（罕见）反对期权（尤指以股票期权作为薪酬或制度核心）的。"},"examples":[{"en":"She took an antioptionist stance during the compensation debate.","zh":"在薪酬争论中，她采取了反对期权的立场。"},{"en":"The group published an antioptionist report on equity pay.","zh":"该团体发布了一份反对股权期权薪酬的报告。"}]}],"synonyms":["opponent of stock options","anti–stock option","critic of option-based pay","anti-option"],"phonetic":"/ˌæntiˈɑpʃənɪst/","extraExplanation":["这个词非常少见，多为临时造词（anti- + option + -ist）。实际阅读中更常见的表达包括：anti–stock option（反对股票期权的）、opposed to stock options（反对股票期权）、critic of option-based pay（批评以期权为基础的薪酬）。","语境通常出现在公司治理与薪酬讨论里：支持者认为期权能激励业绩，反对者担心会导致短期主义、激励与风险不对称、以及收入差距扩大。"]}
{"word":"antioral","summary":{"en":"Antioral means “not by mouth; non-oral,” usually in medical contexts.","zh":"Antioral 指“非经口的/非口服的”，多用于医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not involving the mouth; not taken or given by mouth (the opposite of oral).","zh":"非口腔的；非经口服用/给药的（与 oral 相反）。"},"examples":[{"en":"The doctor chose an antioral route because the patient was vomiting.","zh":"因为病人在呕吐，医生选择了非经口的给药途径。"},{"en":"Some medicines are effective only in antioral forms such as injections.","zh":"有些药物只在非经口形式（如注射）下才有效。"}]},{"partOfSpeech":"adj.","definition":{"en":"Opposed to oral practices or oral communication (rare).","zh":"反对口头方式/口头交流的（较少见）。"},"examples":[{"en":"In that strict setting, the rules felt almost antioral, discouraging any spoken discussion.","zh":"在那种严格的环境里，规则几乎像是反口头的，抑制任何口头讨论。"}]}],"synonyms":["non-oral","parenteral","not by mouth"],"phonetic":"/ˌæntaɪˈɔrəl/","extraExplanation":["“antioral”不是日常常用词，更多见于医学/药学语境，用来强调“不是经口（by mouth）”。更常见的替代说法包括：non-oral（非经口）、parenteral（肠外的，通常指注射等非消化道途径）、topical（外用的）。","构词上：anti-（反、非）+ oral（口的/口服的）。在正式写作中，很多场合用“non-oral”会更自然、更常见。"]}
{"word":"antiorgastic","summary":{"en":"Antiorgastic describes something that inhibits or prevents orgasm.","zh":"Antiorgastic 指“抑制或阻止性高潮”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical/sexual health) Preventing orgasm, or reducing the ability to reach orgasm.","zh":"（医学/性健康）抑制或阻止性高潮的；降低达到性高潮能力的。"},"examples":[{"en":"Some medications can have antiorgastic side effects.","zh":"有些药物可能会带来抑制性高潮的副作用。"},{"en":"They asked the doctor whether the new prescription might be antiorgastic.","zh":"他们询问医生这种新处方是否可能会抑制性高潮。"}]}],"synonyms":["orgasm-inhibiting","orgasm-suppressing","anorgasmic (related)"],"phonetic":"/ˌæn.ti.ɔrˈɡæ.stɪk/","extraExplanation":["“antiorgastic”在英语中非常少见，更常见的说法是 **anorgasmic**（无法达到性高潮的）或 **orgasm-inhibiting** / **orgasm-suppressing**（抑制性高潮的）。在正式或医疗语境中，建议优先使用这些更常见、更清晰的表达。","词形上可理解为 **anti-（反/抑制）+ orgasm（性高潮）+ -ic（形容词后缀）**。不过在出版物和医学写作里，“antiorgastic”不算标准常用词，因此可能会被认为是拼写变体或不地道用法。"]}
{"word":"antiorthodox","summary":{"en":"Antiorthodox means opposing orthodox (traditional or officially accepted) beliefs or practices.","zh":"antiorthodox 指“反正统的”，即反对传统或官方认可的信念与做法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to orthodox (traditional or officially accepted) beliefs, teachings, or practices.","zh":"反正统的；反传统或反官方认可教义/做法的。"},"examples":[{"en":"His antiorthodox views challenged the church’s traditional teachings.","zh":"他反正统的观点挑战了教会的传统教义。"},{"en":"The book takes an antiorthodox approach to history, questioning the standard story.","zh":"这本书以反正统的方式看待历史，质疑主流叙事。"}]},{"partOfSpeech":"n.","definition":{"en":"(of a person) someone who rejects or resists orthodox ideas or practices.","zh":"（指人）反对正统观念或做法的人。"},"examples":[{"en":"In the debate, she was seen as an antiorthodox who refused to follow the established rules.","zh":"在辩论中，她被视为反正统者，拒绝遵循既定规则。"}]}],"synonyms":["unorthodox","heterodox","nonconformist","anti-establishment"],"phonetic":"/ˌæntiˈɔrθəˌdɑks/","extraExplanation":["“antiorthodox”不是非常常见的日常词，更常见的表达包括：unorthodox（非正统的，偏中性）、heterodox（异端的/非正统的，常用于宗教或学术语境）、anti-establishment（反建制的）。","前缀 anti- 表示“反对/对立”，orthodox 表示“正统的/传统认可的”。合在一起强调“明确反对正统”，语气通常比 unorthodox 更强、更带立场色彩。"]}
{"word":"antiorthodoxly","summary":{"en":"Antiorthodoxly means “in an anti-orthodox way,” opposing traditional or commonly accepted ideas.","zh":"antiorthodoxly 意为“以反正统的方式”，指反对传统或普遍接受的观念。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that opposes orthodox (traditional or generally accepted) beliefs, practices, or opinions.","zh":"以反正统（反传统或反普遍认可）的方式；以反主流观点或做法的方式。"},"examples":[{"en":"The artist spoke antiorthodoxly about what counts as “good taste.”","zh":"这位艺术家以反正统的方式谈论什么才算“好品味”。"},{"en":"She wrote antiorthodoxly, challenging the rules of her genre.","zh":"她写作时很反正统，挑战了该体裁的规则。"}]}],"synonyms":["unorthodoxly","iconoclastically","heretically","nonconformingly"],"phonetic":"/ˌæntiˈɔrθədɑksli/","extraExplanation":["这个词很少见，写作中更常用的表达是：in an unorthodox way（以非正统的方式）或 against orthodox views（反对正统观点）。","构词上是 anti-（反对）+ orthodox（正统的）+ -ly（副词后缀）。注意：antiorthodoxly 强调“反正统/对抗正统”，而 unorthodoxly 更中性，强调“非传统/不按常规”。"]}
{"word":"antiorthodoxy","summary":{"en":"Antiorthodoxy means rejecting or opposing established orthodox beliefs or practices.","zh":"antiorthodoxy 指对既有“正统”信仰或做法的反对与拒绝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to or rejection of orthodox (traditional, officially accepted) beliefs, rules, or practices.","zh":"反正统（指反对或拒绝传统的、被官方/主流认可的信仰、规则或做法）。"},"examples":[{"en":"His essays argue for antiorthodoxy in religion and politics, encouraging people to question authority.","zh":"他的文章主张在宗教与政治领域保持反正统立场，鼓励人们质疑权威。"},{"en":"The movement’s antiorthodoxy made it unpopular with established institutions.","zh":"该运动的反正统倾向使它不受既有机构欢迎。"}]}],"synonyms":["heterodoxy","nonconformity","dissent","iconoclasm","unorthodoxy"],"phonetic":"/ˌæn.ti ɔrˈθɑdək.si/","extraExplanation":["这个词比较少见，常用于学术写作或评论语境。结构上由 anti-（反对）+ orthodoxy（正统观念/传统教义）组成，强调“与主流正统对立”的态度或倾向。","在宗教语境里，orthodoxy 常指“正统教义”；在政治、艺术、思想史中，则更广义地指“主流/正统的观念与做法”。","相关常见替代表达包括：anti-orthodox views（反正统观点）、heterodoxy（异端/非正统观点，语气更中性或学术）、nonconformity（不从众/不墨守成规，范围更广）。"]}
{"word":"antioxidant","summary":{"en":"An antioxidant is a substance—or a quality—that helps prevent damage from oxidation (often mentioned in nutrition and skincare).","zh":"antioxidant 指“抗氧化剂”或“抗氧化的（作用/特性）”，常用于营养与护肤语境，强调减少氧化造成的损伤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance (often in foods or supplements) that helps protect the body’s cells from damage caused by oxidation, especially from free radicals","zh":"抗氧化剂；（常见于食物或保健品中的）一种物质，帮助减轻/预防氧化作用，尤其是自由基对细胞造成的损伤"},"examples":[{"en":"Blueberries and green tea are often described as rich in antioxidants.","zh":"蓝莓和绿茶常被说富含抗氧化剂。"},{"en":"Vitamin C acts as an antioxidant in the body.","zh":"维生素C在体内起到抗氧化剂的作用。"},{"en":"Some skincare products include antioxidants to help protect the skin from environmental stress.","zh":"一些护肤品添加抗氧化剂，帮助皮肤抵御环境压力。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or having the effect of preventing or slowing oxidation","zh":"抗氧化的；具有防止或减缓氧化作用效果的"},"examples":[{"en":"This plant oil has antioxidant properties.","zh":"这种植物油具有抗氧化特性。"},{"en":"Researchers studied the antioxidant effect of the extract.","zh":"研究人员研究了该提取物的抗氧化作用。"}]}],"synonyms":["free-radical scavenger","anti-oxidative"],"phonetic":"/ˌæn.tiˈɑːk.sə.dənt/","extraExplanation":["“Antioxidant”常出现在营养与护肤语境中，通常与“free radicals（自由基）”和“oxidative stress（氧化应激）”一起出现。日常英语里它既可指“物质”（名词），也可用来修饰“作用/特性”（形容词，如 antioxidant effect / antioxidant properties）。","在健康传播中，“富含抗氧化剂”常被用作营销表达；科学上更强调“整体饮食结构与生活方式”而不仅是单一成分。"]}
{"word":"antioxidants","summary":{"en":"Antioxidants are substances that help protect cells from oxidative damage.","zh":"Antioxidants 指帮助保护细胞免受氧化损伤的抗氧化物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Substances that help protect the body’s cells from damage caused by oxidation (harmful chemical reactions often linked to “free radicals”).","zh":"抗氧化物质；帮助保护身体细胞免受氧化造成的损伤（常与“自由基”有关）。"},"examples":[{"en":"Fruits and vegetables are rich in antioxidants.","zh":"水果和蔬菜富含抗氧化物质。"},{"en":"Some people take antioxidants as supplements, but a balanced diet is usually recommended first.","zh":"有些人会把抗氧化剂当作补充剂服用，但通常更建议先从均衡饮食做起。"},{"en":"Green tea is often mentioned as a drink with antioxidants.","zh":"绿茶常被提到含有抗氧化成分。"}]}],"synonyms":["free-radical scavengers","protective compounds"],"phonetic":"/ˌæn.tiˈɑk.sɪ.dənts/","extraExplanation":["在营养学语境里，常见的抗氧化物质包括维生素C、维生素E、多酚（如茶多酚）、类胡萝卜素（如β-胡萝卜素）等。","日常英语中，antioxidants 常用于健康与食品宣传；但“抗氧化=一定抗衰老/防病”的说法可能被简化或夸大，真实效果与剂量、来源（食物或补充剂）、个人健康状况有关。","词形提示：antioxidant（单数）/ antioxidants（复数）；也常作形容词用：antioxidant-rich foods（富含抗氧化物的食物）。"]}
{"word":"antioxidase","summary":{"en":"Antioxidase is a rare term for an enzyme that helps protect cells by reducing oxidation (often called an antioxidant enzyme).","zh":"Antioxidase（较少见）指能通过降低氧化反应来保护细胞的酶，常用说法是 antioxidant enzyme（抗氧化酶）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an enzyme (a type of protein) that helps prevent or slow oxidation in cells by breaking down reactive oxygen compounds","zh":"抗氧化酶；一种帮助防止或减缓细胞氧化作用的酶（蛋白质），通过分解活性氧相关物质来起作用"},"examples":[{"en":"Some researchers measure antioxidase activity to see how plants respond to stress.","zh":"一些研究人员会测量抗氧化酶活性，以了解植物如何应对压力。"},{"en":"Higher antioxidase levels can help protect cells from oxidative damage.","zh":"较高的抗氧化酶水平可能有助于保护细胞免受氧化损伤。"}]}],"synonyms":["antioxidant enzyme","protective enzyme"],"phonetic":"/ˌæntiˈɑːksɪˌdeɪs/","extraExplanation":["“antioxidase”在日常英语中非常少见，更常见的说法是“antioxidant enzyme（抗氧化酶）”，并会具体指某种酶，例如：catalase（过氧化氢酶）、superoxide dismutase/SOD（超氧化物歧化酶）、glutathione peroxidase/GPx（谷胱甘肽过氧化物酶）。","词尾“-ase”常用于酶类名称（如 lactase, amylase），看到“-ase”通常可判断它是“某种酶”。"]}
{"word":"antioxidation","summary":{"en":"Antioxidation is the process of preventing or slowing oxidation.","zh":"Antioxidation 指防止或减缓氧化的过程，即“抗氧化”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process of preventing or slowing oxidation (a chemical reaction that can damage cells, food, or materials).","zh":"抗氧化；防止或减缓氧化的过程（氧化会损伤细胞、使食物变质或使材料老化）。"},"examples":[{"en":"Vitamin C is often used for antioxidation in foods to keep them fresh longer.","zh":"维生素C常用于食品的抗氧化，以延长保鲜时间。"},{"en":"The cream claims to support antioxidation and protect the skin from damage.","zh":"这款面霜宣称能帮助抗氧化，保护皮肤免受损伤。"},{"en":"Researchers tested the antioxidation effects of green tea compounds.","zh":"研究人员测试了绿茶化合物的抗氧化作用。"}]}],"synonyms":["anti-oxidation","prevention of oxidation","oxidation inhibition"],"phonetic":"/ˌæn.tiˌɑk.səˈdeɪ.ʃən/","extraExplanation":["“antioxidation”在日常英语中不如“antioxidant(s)”常见：更常说“antioxidant activity/effect/properties（抗氧化活性/作用/性质）”或“anti-oxidation（抗氧化）”。在科研或说明书里会见到“antioxidation/anti-oxidation”。","注意区分：oxidation（氧化）是过程；antioxidation/anti-oxidation（抗氧化）是抑制该过程；antioxidant（抗氧化剂）是起抗氧化作用的物质（如维生素C、维生素E、多酚等）。"]}
{"word":"antioxidative","summary":{"en":"“Antioxidative” means ‘anti-oxidation’: able to prevent or slow oxidation and related damage, especially in health, food, and skincare contexts.","zh":"“antioxidative”意为“抗氧化的”：能预防或减缓氧化及其相关损伤，常用于健康、食品与护肤等语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to prevent or slow down oxidation (a chemical process that can damage cells, oils, or materials).","zh":"抗氧化的；能预防或减缓氧化（可能损伤细胞、油脂或材料的化学过程）。"},"examples":[{"en":"Blueberries are known for their antioxidative effects.","zh":"蓝莓以其抗氧化作用而闻名。"},{"en":"The cream contains antioxidative ingredients to help protect the skin.","zh":"这款面霜含有抗氧化成分，有助于保护皮肤。"},{"en":"Researchers measured the antioxidative activity of the plant extract.","zh":"研究人员测量了这种植物提取物的抗氧化活性。"}]}],"synonyms":["antioxidant","anti-oxidative","oxidation-inhibiting"],"phonetic":"/ˌæn.tiˈɑk.səˌdeɪ.tɪv/","extraExplanation":["“antioxidative”常见于营养学、药学、食品科学与护肤品宣传语境，意思和更常见的“antioxidant（抗氧化的/抗氧化剂）”非常接近。日常英语里通常说“antioxidant foods / antioxidant properties”。","构词理解：anti-（反、抗）+ oxidative（氧化的）。因此它直观地表示“对抗氧化过程带来的影响”。","注意搭配：antioxidative effect/activity（抗氧化作用/活性）、antioxidative properties（抗氧化特性）、antioxidative capacity（抗氧化能力）。"]}
{"word":"antioxidatively","summary":{"en":"“Antioxidatively” means “in a way that prevents or slows oxidation.”","zh":"“antioxidatively”表示“以抗氧化（抑制或减缓氧化）的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an antioxidant way; by preventing or slowing oxidation (chemical damage often caused by free radicals).","zh":"以抗氧化的方式；通过防止或减缓氧化（常由自由基引起的化学损伤）。"},"examples":[{"en":"Blueberries can act antioxidatively because they contain polyphenols.","zh":"蓝莓由于含有多酚，可能具有抗氧化作用。"},{"en":"The researchers tested whether the extract worked antioxidatively in human cells.","zh":"研究人员测试该提取物在人体细胞中是否具有抗氧化效果。"}]}],"synonyms":["as an antioxidant","in an antioxidant manner","antioxidantly"],"phonetic":"/ˌæn.tiˌɑk.səˈdeɪ.tɪv.li/","extraExplanation":["“antioxidatively”是由形容词“antioxidative / antioxidant”（抗氧化的）加副词后缀“-ly”构成，多用于科研或营养学写作；日常英语更常说“has antioxidant effects / works as an antioxidant / acts as an antioxidant”。","在科学语境中，“oxidation”常与细胞损伤、食物变质（油脂酸败）、金属生锈等相关；“antioxidatively”强调“以对抗氧化反应的方式”这一作用机制。"]}
{"word":"antioxidizer","summary":{"en":"An antioxidizer is a substance (or agent) that prevents oxidation and slows spoilage or material damage; it’s a less common term than “antioxidant.”","zh":"antioxidizer 指抗氧化剂/抗氧化作用因子，用于防止氧化、减缓变质或材料老化；该词不如 antioxidant 常用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A substance added to a product (especially food, oils, rubber, or plastics) to prevent oxidation and slow spoilage or damage.","zh":"（尤指添加到食品、油脂、橡胶或塑料中的）抗氧化剂；用于防止氧化、减缓变质或材料老化的物质。"},"examples":[{"en":"The manufacturer added an antioxidizer to keep the oil from going rancid.","zh":"厂家加入了抗氧化剂，防止油脂酸败。"},{"en":"Some plastics include an antioxidizer to reduce cracking and discoloration over time.","zh":"有些塑料会加入抗氧化剂，以减少长期使用后的开裂和变色。"}]},{"partOfSpeech":"n.","definition":{"en":"Something (or someone) that reduces oxidation in a system; a general term for an agent that counteracts oxidizers.","zh":"（泛指）能减少系统中氧化作用的事物（或人）；与氧化剂作用相对的“抗氧化”作用者。"},"examples":[{"en":"In this formula, vitamin E acts as an antioxidizer.","zh":"在这个配方中，维生素E起到抗氧化作用。"}]}],"synonyms":["antioxidant","oxidation inhibitor","anti-oxidant agent"],"phonetic":"/ˌæn.tiˈɑk.sɪˌdaɪ.zɚ/","extraExplanation":["“antioxidizer”在现代英语里不如“antioxidant”常见；在食品、营养与医学语境中几乎总是用“antioxidant”（抗氧化剂/抗氧化物）。在材料与工业配方（如塑料、橡胶、润滑油添加剂）里，偶尔也会见到“antioxidizer”或“antioxidiser”（英式拼写）。","构词理解：anti-（反、抗）+ oxidizer（氧化剂/促氧化物）。因此它强调“用来对抗氧化”的添加剂或作用因子。"]}
{"word":"antioxidizing","summary":{"en":"Antioxidizing means preventing oxidation or having an antioxidant effect; it can also mean treating something with antioxidants (less common).","zh":"antioxidizing 指“抗氧化的/防止氧化的”，也可指“用抗氧化剂进行处理”（较少见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Preventing oxidation (a chemical reaction that can cause damage or spoilage); having the effect of an antioxidant.","zh":"抗氧化的；防止氧化（可能导致损伤或变质）的；具有抗氧化剂作用的。"},"examples":[{"en":"Many berries contain antioxidizing compounds that help protect cells from damage.","zh":"许多浆果含有抗氧化成分，有助于保护细胞免受损伤。"},{"en":"The label claims the cream has an antioxidizing effect on the skin.","zh":"标签宣称这款面霜对皮肤有抗氧化作用。"}]},{"partOfSpeech":"v.","definition":{"en":"(Less common) Causing something to act against oxidation; treating or processing with antioxidants.","zh":"（较少见）使……具有抗氧化作用；用抗氧化剂处理/加工。"},"examples":[{"en":"The manufacturer is antioxidizing the oil to extend its shelf life.","zh":"厂家正在对这种油进行抗氧化处理，以延长保质期。"},{"en":"Antioxidizing the formula can help prevent color changes over time.","zh":"对配方进行抗氧化处理有助于防止颜色随时间变化。"}]}],"synonyms":["antioxidant","anti-oxidative","oxidation-resistant","protective against oxidation"],"phonetic":"ˌæn.tiˈɑk.sɪˌdaɪ.zɪŋ","extraExplanation":["“antioxidizing”常见于食品、保健品、护肤品的说明中，意思接近“抗氧化的/具有抗氧化作用”。日常英语里更常用的相关词是“antioxidant”（抗氧化剂/抗氧化的）以及表达“has antioxidant properties”（具有抗氧化特性）。拼写上也可能看到带连字符的“anti-oxidizing”。"]}
{"word":"antioxygen","summary":{"en":"Antioxygen is a rare term meaning a substance that prevents oxidation—basically an antioxidant.","zh":"Antioxygen 是个较少见的词，指防止氧化的物质，本质上就是抗氧化剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance that prevents or slows oxidation (damage caused by oxygen), especially in foods, oils, or industrial materials; a rare/older term for an antioxidant","zh":"（较少用/较旧的说法）抗氧化剂；指能防止或减缓氧化（由氧引起的变质或损伤）的物质，常用于食品、油脂或工业材料中"},"examples":[{"en":"This oil contains an antioxygen to keep it from going rancid.","zh":"这种油加入了抗氧化剂，以防止变哈喇（酸败）。"},{"en":"Manufacturers sometimes add antioxygen agents to protect rubber from aging.","zh":"制造商有时会添加抗氧化剂来保护橡胶不易老化。"}]}],"synonyms":["antioxidant","anti-oxidizing agent","oxidation inhibitor"],"phonetic":"/ˌæntiˈɑksɪdʒən/","extraExplanation":["“antioxygen”在现代英语里非常少见，日常与学术写作更常用的是“antioxidant（抗氧化剂）”。如果你在配料表、化工或旧文献中看到“antioxygen”，通常可以理解为“antioxidant/anti-oxidizing agent”。"]}
{"word":"antioxygenating","summary":{"en":"Antioxygenating means preventing or reducing oxygenation/oxidation, mainly used in technical contexts.","zh":"antioxygenating 指抑制或减少氧合/氧化，多用于技术或专业语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Preventing or reducing oxygenation (the adding of oxygen) or oxidation (reaction with oxygen).","zh":"抑制或减少“氧合”（加入氧）或“氧化”（与氧反应）的。"},"examples":[{"en":"The packaging film has antioxygenating properties that help keep the food fresh longer.","zh":"这种包装膜具有抗氧化/抗氧合的特性，能让食物保鲜更久。"},{"en":"An antioxygenating additive was mixed into the oil to slow down rancidity.","zh":"在油中加入了一种抗氧化添加剂，以减缓酸败。"}]},{"partOfSpeech":"n.","definition":{"en":"The process of acting to prevent oxygenation/oxidation (used in technical writing).","zh":"抑制氧合/氧化的过程或作用（多见于技术性写作）。"},"examples":[{"en":"The antioxygenating of the solution was necessary before the next step.","zh":"在下一步之前，有必要对该溶液进行抗氧化处理。"}]}],"synonyms":["anti-oxidizing","antioxidant","deoxygenating","oxygen-blocking"],"phonetic":"/ˌæntiˈɑksɪdʒəˌneɪtɪŋ/","extraExplanation":["“antioxygenating”并不是日常英语里常见的标准词，更常见的表达是 **antioxidant / anti-oxidizing**（抗氧化的）或 **deoxygenating**（去氧的）。在科研、材料或食品保存语境中，有时作者会用“anti- + oxygenating”这种构词方式来强调“阻止氧进入/阻止被氧化”。","含义上要区分：**oxygenating**偏“使含氧/供氧”，常用于医学或化学；而“抗氧化”多指防止氧化变质（如油脂酸败、金属腐蚀）。因此在翻译或写作中，常根据具体语境选择“抗氧化”或“去氧/抑氧”。"]}
{"word":"antioxygenation","summary":{"en":"Antioxygenation is a rare term meaning the prevention of oxygenation (or oxygen-related chemical change).","zh":"Antioxygenation 是个较少见的词，表示防止氧合或与氧有关的化学变化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process or action of preventing oxygen from being added to something (inhibiting oxygenation or oxygen-driven chemical change)","zh":"防止氧被加入某物的过程或作用（抑制氧合或与氧有关的化学变化）"},"examples":[{"en":"Antioxygenation treatments are used to protect certain metals from reacting with oxygen during storage.","zh":"为防止某些金属在储存期间与氧发生反应，会使用抗氧合处理。"},{"en":"The report describes an antioxygenation step to keep the solution stable.","zh":"报告描述了一个抗氧合步骤，用来保持溶液稳定。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, medical) an effect or approach intended to reduce or oppose oxygenation in tissue or blood","zh":"（罕见，医学）旨在降低或对抗组织或血液氧合的作用或方法"},"examples":[{"en":"In modern medical writing, doctors would usually avoid the term antioxygenation and use more specific wording.","zh":"在现代医学写作中，医生通常会避免使用 antioxygenation，而改用更具体的表述。"}]}],"synonyms":["oxidation inhibition","antioxidant action","oxygenation prevention"],"phonetic":"/ˌæntiˌɑksɪdʒəˈneɪʃən/","extraExplanation":["这个词非常少见，多数情况下人们会用更常见、更明确的词：如果强调“防止氧化”，更常见说法是 antioxidant action（抗氧化作用）、oxidation inhibition（抑制氧化）；如果强调“去除氧”，常用 deoxygenation（脱氧）。","构词上是 anti-（反/抗）+ oxygenation（氧合/加氧），因此字面意思是“反氧合/抗氧合”，但在学术或工业语境里往往需要根据具体反应来选用更精确的术语。"]}
{"word":"antioxygenator","summary":{"en":"A rare term for something that reduces oxygenation or prevents oxidation; usually replaced by “antioxidant” or “deoxygenator.”","zh":"一个罕见词，指降低氧合或防止氧化的东西；通常用“antioxidant（抗氧化剂）”或“deoxygenator（脱氧剂/除氧器）”替代。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A substance, device, or treatment that reduces oxygenation or removes oxygen; also used loosely for something that prevents oxidation (contact with oxygen).","zh":"（罕见）指降低氧合或去除氧气的物质、装置或处理方法；也可泛指防止氧化（与氧接触）的东西。"},"examples":[{"en":"In some older technical writing, an antioxygenator was described as a chemical added to slow oxidation in a mixture.","zh":"在一些较旧的技术文献中，antioxygenator 被描述为加入混合物中以减缓氧化的化学品。"},{"en":"The term is uncommon today; most modern texts use words like “antioxidant” or “deoxygenator.”","zh":"这个词如今并不常见；现代文本更常用“antioxidant（抗氧化剂）”或“deoxygenator（脱氧剂/除氧器）”。"}]}],"synonyms":["antioxidant","deoxygenator","deoxidizer","oxygen scavenger"],"phonetic":"/ˌæn.tiˈɑk.sɪ.dʒəˌneɪ.tɚ/","extraExplanation":["这个词在现代英语里非常少见，很多情况下属于临时造词或旧文献用法。表达“防止氧化”时，最自然的是 antioxidant（抗氧化剂）；表达“去除氧气/脱氧”时，常用 deoxygenator 或 deoxidizer。","构词上 anti-（反、抗）+ oxygen + -ator（做某事的东西/装置），所以可从字面理解为“反氧/去氧的东西”，但在实际写作中建议用更标准的术语以避免歧义。"]}
{"word":"antioxygenic","summary":{"en":"Antioxygenic means “anti-oxidation by oxygen,” similar in meaning to antioxidant.","zh":"antioxygenic 意为“抗氧的/抑制氧化的”，含义接近 antioxidant（抗氧化的/抗氧化剂的）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Preventing or reducing oxidation caused by oxygen; acting against oxygen-driven chemical reactions (similar to “antioxidant”).","zh":"抗氧的；抑制或减缓由氧引起的氧化反应的（类似“抗氧化的/抗氧化剂的”）。"},"examples":[{"en":"Vitamin C has antioxygenic effects that help slow oxidation in some foods.","zh":"维生素C具有抗氧作用，在一些食物中能帮助减缓氧化。"},{"en":"The coating is designed to be antioxygenic, protecting the metal surface from rust.","zh":"这种涂层被设计为抗氧的，用来保护金属表面防锈。"}]}],"synonyms":["antioxidant","antioxidative","anti-oxidative","oxidation-inhibiting"],"phonetic":"/ˌæn.tiˌɑk.sɪˈdʒɛn.ɪk/","extraExplanation":["“antioxygenic”不是日常英语常用词，更常见的表达是“antioxidant”（抗氧化剂）或“antioxidative/antioxidative effect”（抗氧化的/抗氧化作用）。","词形上可拆为 anti-（反、抗）+ oxygen（氧）+ -ic（形容词后缀），常见于化学、材料、食品保存等语境。"]}
{"word":"antiozonant","summary":{"en":"An antiozonant is a chemical additive used to protect rubber from ozone damage and cracking.","zh":"antiozonant 指用于保护橡胶、防止臭氧造成老化与龟裂的化学添加剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical added to rubber (especially tires) to prevent damage and cracking caused by ozone in the air","zh":"（尤指轮胎等）添加到橡胶中的一种化学物质，用来防止空气中的臭氧造成老化与龟裂"},"examples":[{"en":"Many tires contain an antiozonant to reduce ozone cracking.","zh":"许多轮胎含有防臭氧剂，以减少臭氧龟裂。"},{"en":"Without an antiozonant, rubber parts may crack faster outdoors.","zh":"如果没有防臭氧剂，橡胶零件在户外可能更快出现裂纹。"}]}],"synonyms":["ozone protectant","antiozone additive"],"phonetic":"/ˌæn(t)iˈoʊzənənt/","extraExplanation":["臭氧会攻击橡胶中的双键结构，导致表面出现细小裂纹（常见于轮胎侧壁）。防臭氧剂常与抗氧化剂（antioxidant）一起使用，但两者作用对象不同：前者主要对抗“臭氧”，后者主要减缓“氧化/热老化”。","在材料与化工语境中，这个词更常见；日常英语里较少使用。"]}

