{"word":"antiq","summary":{"en":"“antiq” is a common abbreviation for “antique” (old and often valuable; or a valuable old object).","zh":"“antiq”常见为“antique（古董）”的缩写：表示古老且常有价值的；或指一件古董。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often written as “antiq.”) antique; old and usually valuable because of age, rarity, or craftsmanship.","zh":"（常写作“antiq.”）古董；古老且通常因年代久远、稀有或工艺精良而有价值的东西。"},"examples":[{"en":"The listing says “antiq. table,” meaning an antique table.","zh":"商品信息写着“antiq. table”，意思是“古董桌”。"},{"en":"She collects antique jewelry from the 1920s.","zh":"她收藏20世纪20年代的古董首饰。"}]},{"partOfSpeech":"n.","definition":{"en":"an antique object, especially furniture, art, or jewelry.","zh":"古董（尤指家具、艺术品或首饰等）。"},"examples":[{"en":"The shop sells antiques from Europe.","zh":"这家店卖欧洲的古董。"},{"en":"That vase looks like an antique.","zh":"那个花瓶看起来像古董。"}]}],"synonyms":["antique","antiquity (context-dependent)","old (basic)","vintage (related but not the same)"],"phonetic":"/ænˈtik/","extraExplanation":["“antiq”通常不是标准的完整单词，而是目录、拍卖行或商品标签里把“antique”缩写成“antiq.”（有时带句号）。如果你是在古董/二手平台看到“antiq”，一般就是在提示“古董风格/古董品”。购买时可留意它是“真正古董”（antique）还是“仿古/复古”（vintage/antique-style）。"]}
{"word":"antiqua","summary":{"en":"Antiqua most often means a Roman-style serif typeface; more rarely, it’s Latin for “ancient/old” in scholarly or title contexts.","zh":"Antiqua 最常指“罗马体”风格的衬线字体；较少情况下作为拉丁词表示“古老的/古代的”，多见于学术或标题语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Typography) A serif typeface in the “Roman” style (as opposed to Gothic/blackletter styles), common in modern printed text.","zh":"（排版）一种“罗马体”风格的衬线字体（与哥特体/黑体字母风格相对），常见于现代印刷文本。"},"examples":[{"en":"The publisher chose Antiqua for the body text because it’s easy to read.","zh":"出版社选择用 Antiqua 来排正文，因为它更易读。"},{"en":"In German typographic history, Antiqua is often contrasted with Fraktur.","zh":"在德国排版史中，Antiqua 常与 Fraktur（德式黑体/哥特体）相对。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common in English) “Ancient; old,” used mainly in Latin titles, names, or scholarly contexts.","zh":"（英语中较少见）“古老的；古代的”，主要用于拉丁语标题、人名或学术语境中。"},"examples":[{"en":"The manuscript’s title includes the Latin word antiqua.","zh":"这份手稿的标题中包含拉丁词 antiqua。"},{"en":"She studies historia antiqua (ancient history) in her classics program.","zh":"她在古典学项目中研究 historia antiqua（古代史）。"}]}],"synonyms":["Roman (type)","serif typeface","Antiquity-related (Latin sense: ancient)"],"phonetic":"/ænˈtiːkwə/","extraExplanation":["Antiqua 在德语与欧洲排版语境里很常见：它指“罗马体/衬线体”传统（例如 Times New Roman 一类的阅读型字体）。历史上，德语地区曾长期使用 Fraktur（黑体/哥特体）作为正文印刷字体；后来逐渐转向 Antiqua，因此会看到“Antiqua–Fraktur 之争/对比”的说法。","词源上，antiqua 来自拉丁语，意思是“古老的（阴性形式）”。在英语里单独作为形容词用并不常见，更多作为标题、名称或排版术语出现。"]}
{"word":"antiquarian","summary":{"en":"An antiquarian is someone who studies or deals in antiques and historical items; it can also describe things connected to that study.","zh":"antiquarian 指研究或经营古董、古书和史料的人，也可作形容词表示与古物研究相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who studies, collects, or deals in old objects (antiques), books, or historical documents.","zh":"古物研究者；古董（或古书、史料）收藏/研究/经销者。"},"examples":[{"en":"The antiquarian showed us Roman coins and explained where they were found.","zh":"那位古物研究者给我们看了罗马钱币，并解释了它们的出土地点。"},{"en":"She works as an antiquarian, specializing in rare books and manuscripts.","zh":"她从事古书商/古籍研究工作，专门研究并经营珍本书和手稿。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the study or collection of ancient things; old-fashioned in a scholarly way.","zh":"（与）古物研究有关的；偏好考据旧物的（带学术色彩）；有点复古考究的。"},"examples":[{"en":"The museum’s antiquarian catalog includes detailed notes on each artifact.","zh":"博物馆的那本古物研究目录对每件文物都有详细注释。"},{"en":"He has an antiquarian interest in local history and old maps.","zh":"他对地方史和古地图有一种“考据式”的兴趣。"}]}],"synonyms":["antique dealer","collector","historian","archivist","bibliophile"],"phonetic":"/ˌæn.tɪˈkwɛr.i.ən/","extraExplanation":["“antiquarian”常与“antique（古董）”相关，但语气更偏向“研究、考据、收藏与文献”的领域；如果只是说“喜欢古董的人”，英语里更常用“antique collector”。","在文学或评论中，“antiquarian”有时带一点轻微的褒贬：既可表示学识渊博、重视史料细节，也可能暗示过分沉迷旧事、忽视现实。"]}
{"word":"antiquarianism","summary":{"en":"Antiquarianism is a strong interest in old objects and the detailed study/collection of the past, sometimes seen as overly focused on facts rather than broader meaning.","zh":"Antiquarianism 指对古旧事物的浓厚兴趣与细致的研究/收藏；有时也被认为过于重视细节事实而忽略更宏观的意义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong interest in old things (such as ancient books, artifacts, buildings, or customs), especially studying or collecting them as part of history.","zh":"对古旧事物（如古书、文物、建筑或习俗）的浓厚兴趣，尤指以历史研究或收藏的方式来关注它们。"},"examples":[{"en":"Her antiquarianism led her to collect early printed books and handwritten letters.","zh":"她的古物兴趣使她开始收藏早期印刷书籍和手写书信。"},{"en":"The museum’s new exhibit reflects a careful antiquarianism, focusing on everyday objects from the past.","zh":"博物馆的新展览体现了细致的古物研究取向，聚焦于过去的日常用品。"}]},{"partOfSpeech":"n.","definition":{"en":"A way of studying the past that focuses on detailed facts and relics, sometimes criticized for paying less attention to big ideas or social meaning.","zh":"一种研究过去的方法，强调细节事实与遗存；有时被批评为较少关注宏观思想或社会意义。"},"examples":[{"en":"Some critics say his writing is pure antiquarianism—accurate, but not very interpretive.","zh":"一些批评者说他的写作只是“古物式考据”——准确，但缺乏阐释。"},{"en":"The debate was between antiquarianism and a more theory-driven approach to history.","zh":"争论发生在古物式考据与更偏理论的历史研究方法之间。"}]}],"synonyms":["antiquarian study","antiquity collecting","antiquarian scholarship","archaeological interest","historical collecting"],"phonetic":"/ænˌtɪˌkwɛriəˈnɪzəm/","extraExplanation":["“antiquarianism”来自“antiquarian”（古物学者、古董收藏者）。在学术语境里它常是中性词，表示重视史料、器物与细节；但在评论中也可能带轻微贬义，暗示“只顾考据与收藏、缺少大历史视角”。","相关文化背景：18—19世纪欧洲有一股对古代遗迹、铭文、钱币与古书的热潮，推动了博物馆、考古与历史文献整理的发展；因此这个词也常出现在艺术史、考古学与地方史研究的讨论里。"]}
{"word":"antiquarianize","summary":{"en":"Antiquarianize means to make something seem antiquarian or to handle it with a strong focus on antiques and the distant past (a rare word).","zh":"antiquarianize 指“使……带有古物研究/恋旧色彩”或“以偏重古董与久远历史的方式处理（某事）”，属罕见用词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make something or someone seem like an antiquarian (old-fashioned, focused on antiques or the distant past), or to treat something with an antiquarian attitude","zh":"使（某物/某人）带有古物研究者（或古董爱好者）的气质；以“考古物/恋旧”的方式看待或处理（某事物）"},"examples":[{"en":"The museum’s new labels antiquarianize the collection by focusing only on dates and owners.","zh":"博物馆的新标签只强调年代和收藏者，把整个馆藏“古物化”了。"},{"en":"He tends to antiquarianize local history, praising the past while ignoring present problems.","zh":"他常把地方史“恋旧化”，一味称颂过去，却忽视当下的问题。"}]},{"partOfSpeech":"v.","definition":{"en":"to study, collect, or write about old objects, documents, and the distant past in an antiquarian way (rare)","zh":"（罕用）以古物研究的方式研究、收藏或撰写关于古器物/旧文献与久远历史的内容"},"examples":[{"en":"In retirement, she began to antiquarianize, cataloging coins and handwritten letters.","zh":"退休后，她开始做古物研究式的整理，把硬币和手写信件编目归档。"},{"en":"The author antiquarianized for years before turning the notes into a book.","zh":"作者以古物研究的方式积累多年笔记，后来才整理成书。"}]}],"synonyms":["make old-fashioned","historicize","romanticize the past","treat in an antiquarian way","antiquate (rare)"],"phonetic":"/ænˌtɪkˈwɛriənˌaɪz/","extraExplanation":["这个词非常少见，通常是由 antiquarian（古物研究者；好古的）+ -ize（使……化）构成，用来带一点评论意味：强调“过度沉迷旧事物/把事物包装得很古旧”，不一定是褒义。日常英语里更常用的表达是 “treat (something) in an antiquarian way / make (something) seem old-fashioned”。"]}
{"word":"antiquarianly","summary":{"en":"“Antiquarianly” means “in an antiquarian way,” showing a scholarly or collector’s focus on old objects and historical details.","zh":"“antiquarianly”意为“以古物研究/收藏的方式”，带有对古董与历史细节的学术式关注。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an antiquarian way; showing strong interest in old objects, ancient history, or the careful study/collecting of antiques.","zh":"以古物研究者的方式；带有对古董、古代历史或对古物细致研究/收藏的浓厚兴趣。"},"examples":[{"en":"He wrote antiquarianly, focusing on dates, inscriptions, and minor historical details.","zh":"他的写作带有古物研究式的风格，专注于年代、铭文和细碎的历史细节。"},{"en":"The museum was arranged antiquarianly, with labels that emphasized provenance and rarity.","zh":"博物馆的陈列带有“古物学式”的取向，说明牌强调来源（流传）和稀有性。"}]}],"synonyms":["archaeologically","historically","scholarly","in an antiquarian way"],"phonetic":"/ˌæntɪˈkwɛriənli/","extraExplanation":["“antiquarianly”在现代英语中比较少见，更常见的表达是“in an antiquarian way”或用形容词“antiquarian”来修饰名词（如 antiquarian interests / an antiquarian approach）。","“antiquarian”原指研究古代遗物、碑铭、手稿等的人（古物学者），语气通常中性；但在某些语境里也可能带一点点“过于沉迷旧物/细节、忽视大局”的暗示，需结合上下文判断。"]}
{"word":"antiquarians","summary":{"en":"Antiquarians are people interested in studying or collecting antiques and the history of earlier times.","zh":"Antiquarians 指对古董与古代历史进行研究或收藏的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who study or collect old objects (antiques) and the history of past times, often in a careful, detailed way.","zh":"研究或收藏古物（古董）以及过去历史的人，常带有细致考证的特点。"},"examples":[{"en":"Local antiquarians helped identify the age of the coins found at the site.","zh":"当地的古物研究者帮助鉴定了遗址出土硬币的年代。"},{"en":"The museum invited antiquarians to speak about life in the 1700s.","zh":"博物馆邀请古物研究者来讲解18世纪的生活。"}]}],"synonyms":["historians (informal overlap)","collectors","antique dealers (related, but more business-focused)","scholars"],"phonetic":"/ˌæn.tɪˈkwɛr.i.ənz/","extraExplanation":["“antiquarian”常给人一种“重细节考据、偏学术或偏收藏”的感觉；有时语气会带一点点“过于怀旧、钻故纸堆”的轻微调侃，但在学术或博物馆语境中通常是中性或正面的。","词根与“antique（古董）/antiquity（古代）”相关。复数形式为 antiquarians。","常见搭配：local antiquarians（当地古物研究者）、antiquarian books（古旧书/古籍）、antiquarian interests（对古物/古史的兴趣）。"]}
{"word":"antiquaries","summary":{"en":"Antiquaries are people who study or collect antiques and historical objects/documents.","zh":"antiquaries 指研究或收藏古董、历史遗物与文献的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who study or collect old objects, documents, and the history of past times (plural of antiquary).","zh":"研究或收藏古代文物、古书文献并关注旧时代历史的人（antiquary 的复数）。"},"examples":[{"en":"The museum invited local antiquaries to help identify the artifacts.","zh":"博物馆邀请当地的古物研究者来协助鉴定这些文物。"},{"en":"In the 1800s, many antiquaries kept detailed notes about Roman ruins in Britain.","zh":"在19世纪，许多古物研究者详细记录了英国的罗马遗址。"}]}],"synonyms":["antiquarians","historians (general)","collectors","archaeologists (related, but different)"],"phonetic":"/ˈæn.tɪˌkwɛr.iz/","extraExplanation":["“antiquary”带有较传统、略显旧式的语感，现代更常用的是“antiquarian”（古物研究者；古籍/古玩的收藏者或研究者）。","词根与“antique（古董、古老的）”同源；在文学或历史类文章中，“antiquaries”常用来指对旧物与古代遗迹极有兴趣的人。"]}
{"word":"antiquarism","summary":{"en":"Antiquarism means an interest in studying or collecting old/ancient things, and sometimes an overly old-fashioned focus on the past.","zh":"Antiquarism 指对古物与旧事物的研究或收藏兴趣；也可指过度迷恋过去、显得守旧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The study, collection, or love of ancient objects, old books, and things from the past; antiquarian interests.","zh":"对古物、旧书与历史遗物的研究、收藏或热爱；古物癖（古董研究/嗜好）。"},"examples":[{"en":"Her antiquarism led her to spend weekends browsing secondhand bookshops for rare editions.","zh":"她的古物癖让她周末常去二手书店淘稀有版本。"},{"en":"The museum’s early catalogues were shaped by nineteenth-century antiquarism.","zh":"这座博物馆早期的目录编撰深受19世纪古物研究风潮影响。"}]},{"partOfSpeech":"n.","definition":{"en":"A narrow or overly nostalgic focus on the past, sometimes suggesting that old details matter more than present needs.","zh":"对过去的狭隘或过度怀旧的关注（有时带贬义：过分看重旧细节而忽视现实需求）。"},"examples":[{"en":"The critic argued that the novel’s antiquarism weakened its message for modern readers.","zh":"评论家认为小说的“古旧癖”削弱了它对现代读者的表达力量。"},{"en":"In policy debates, antiquarism can sound like resisting change simply because “that’s how it used to be.”","zh":"在政策辩论中，“古旧癖”可能听起来像是仅因为“以前就是这样”而抗拒改变。"}]}],"synonyms":["antiquarianism","antiquarian interest","archaeology (related but more scientific)","nostalgia (related, not the same)"],"phonetic":"/ænˈtɪk.wəˌrɪz.əm/","extraExplanation":["“antiquarism”在现代英语里相对少见，更常见的是“antiquarianism”。两者意思非常接近：都指对古物/古籍/历史遗存的研究、收藏或偏爱。","词根来自拉丁语“antiquus”（古老的）。在文化语境中，它既可以是中性（学术研究、收藏与保护），也可能带轻微贬义（过度迷恋旧事物、忽视当下）。"]}
{"word":"antiquarium","summary":{"en":"A (rare, bookish) word for a place or collection of antiques/antiquities.","zh":"（较少见、偏书面）指陈列/收藏/出售古董或古物的地方，或古物收藏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place (such as a room, museum corner, or shop) where antiques or ancient objects are kept, displayed, or sold; a collection of antiquities","zh":"收藏、陈列或出售古董/古物的地方；古物收藏（较少见用法）"},"examples":[{"en":"The old house had an antiquarium filled with coins, maps, and broken pottery.","zh":"那栋老房子里有一间古物室，摆满了硬币、地图和破碎的陶器。"},{"en":"We wandered into a small antiquarium near the cathedral to look at Roman-era artifacts.","zh":"我们走进大教堂附近的一家小古物店，去看罗马时期的器物。"}]}],"synonyms":["antique shop","antiques store","collection of antiquities","cabinet of curiosities","antiquarian collection"],"phonetic":"/ˌæn.təˈkwɛr.i.əm/","extraExplanation":["“antiquarium”是一个比较少见、偏书面/学术气的词，常见于历史、考古、博物馆或旅行语境。日常英语里，人们更常说“antique shop / antiques store（古董店）”“museum（博物馆）”“collection of antiquities（古物收藏）”。","词源上它与拉丁语“antiquarius（研究或处理古物的人）”有关，意义上接近“antiquary（古物研究者，较旧式）/ antiquarian（古物研究的；古物收藏者的）”。"]}
{"word":"antiquartan","summary":{"en":"Antiquarian means a person interested in studying or collecting old things, or something related to antiques and the distant past.","zh":"Antiquarian 指研究或收藏古物的人，或指与古董、古代及对过去的研究相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who studies, collects, or is very interested in old objects, documents, and the past (especially history and archaeology).","zh":"古物研究者；古董收藏家；（尤指对历史、考古）极感兴趣的人。"},"examples":[{"en":"The antiquarian spent years collecting maps from the 1700s.","zh":"这位古物研究者花了多年时间收藏18世纪的地图。"},{"en":"In the novel, an antiquarian discovers a forgotten letter in an old library.","zh":"在小说中，一位古物研究者在旧图书馆里发现了一封被遗忘的信。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to or dealing with antiques, ancient times, or the study of the past, sometimes in a way that focuses on small details.","zh":"与古董或古代有关的；（对过去的研究）偏重细枝末节的。"},"examples":[{"en":"She wrote an antiquarian article about medieval seals.","zh":"她写了一篇关于中世纪印章的考据文章。"},{"en":"His antiquarian interests include old coins and inscriptions.","zh":"他的考据兴趣包括古钱币和铭文。"}]}],"synonyms":["collector","historian","archaeologist","antique dealer","antique"],"phonetic":"/ˌæn.təˈkwer.i.ən/","extraExplanation":["你输入的“antiquartan”很可能是拼写错误，正确拼写通常是 **antiquarian**。","常见搭配：**antiquarian bookshop**（古旧书店）、**antiquarian dealer**（古董商）。在一些语境里，*antiquarian* 也可能带一点“过度考据、拘泥琐碎细节”的语气。"]}
{"word":"antiquary","summary":{"en":"An antiquary is a person who studies or collects old/historical objects; a literary/older word for “antiquarian.”","zh":"antiquary 指研究或收藏古物的人；是较文学化、较旧的说法，现代多用 antiquarian。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who studies or collects antiques, old books, historical documents, coins, or other objects from the past; an antiquarian.","zh":"古物研究者；古董收藏家；古文物学者（研究或收藏古董、古书、历史文献、钱币等旧物的人）。"},"examples":[{"en":"The local antiquary helped the museum identify the age of the coins.","zh":"当地的古物研究者帮助博物馆鉴定了这些钱币的年代。"},{"en":"In the novel, an antiquary spends his days searching for manuscripts in dusty libraries.","zh":"在小说里，一位古物学者整天在满是灰尘的图书馆里寻找手稿。"}]}],"synonyms":["antiquarian","collector","historian","archaeologist (related, not the same)"],"phonetic":"/ˈæn.tɪˌkwɛr.i/","extraExplanation":["“antiquary”是较旧或带文学色彩的用法，现代更常用“antiquarian”。","文学中常见用法：Sir Walter Scott 有小说《The Antiquary》（《古物家》），使这个词带有“痴迷旧物、研究古代遗迹的人”的文化联想。"]}
{"word":"antiquate","summary":{"en":"Antiquate means to make something outdated or (less commonly) to become outdated.","zh":"Antiquate 指“使过时/淘汰”，也可（较少见）指“变得过时”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something seem old-fashioned, outdated, or no longer suitable for modern use; to render obsolete","zh":"使（某物）显得过时、陈旧；使变得不再适用（使淘汰）"},"examples":[{"en":"New technology can quickly antiquate older devices.","zh":"新技术会很快让旧设备变得过时。"},{"en":"The policy was antiquated by changes in the law.","zh":"由于法律变化，这项政策被淘汰了。"}]},{"partOfSpeech":"vi.","definition":{"en":"(less common) to become outdated or obsolete","zh":"（较少见）变得过时；被淘汰"},"examples":[{"en":"Some skills antiquate if you don’t practice them.","zh":"有些技能如果不练习就会逐渐过时。"}]}],"synonyms":["outdate","obsolete","date","supersede","phase out"],"phonetic":"/ˈæn.tɪ.kweɪt/","extraExplanation":["“antiquate”在现代英语中比较少见、偏正式；更常用的是形容词“antiquated（过时的）”或动词短语“make … obsolete / become outdated”。","词源与“antique（古董/古老的）”同源，来自拉丁语词根，核心感觉是“变得像古老之物一样不合时宜”。","使用建议：日常写作中，表达“过时/淘汰”更自然的说法有“outdate”“obsolete”“phase out”。"]}
{"word":"antiquated","summary":{"en":"Antiquated means old-fashioned and no longer suitable or commonly used today.","zh":"Antiquated 指“过时的、陈旧的”，强调不再合时宜或不再常用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Old-fashioned and no longer commonly used; out of date.","zh":"过时的；陈旧的；不再常用的。"},"examples":[{"en":"Some people think the rule is antiquated and should be changed.","zh":"有些人认为这条规定已经过时，应该修改。"},{"en":"The hotel’s antiquated heating system barely worked in winter.","zh":"那家旅馆陈旧的供暖系统在冬天几乎不起作用。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of language or style) belonging to an earlier time and sounding old or unnatural today.","zh":"（指语言/文体）带有旧时代色彩，如今听起来古旧或不自然。"},"examples":[{"en":"The translation uses antiquated words that modern readers don’t say.","zh":"这篇译文用了很多古旧词汇，现代读者平时不这么说。"}]}],"synonyms":["outdated","old-fashioned","obsolete","archaic","outmoded"],"phonetic":"/ˈæn.təˌkweɪ.tɪd/","extraExplanation":["“Antiquated”常带轻微负面评价：强调“已经不合时宜”，不只是“很老”。如果你想更中性地说“古老但有价值/有魅力”，可用“vintage / classic / old-fashioned”（视语境而定）。","词源上与“antique（古董、古老的）”同源，核心意思是“来自过去的时代”。"]}
{"word":"antiquatedly","summary":{"en":"Antiquatedly means “in an old-fashioned, outdated way.”","zh":"antiquatedly 表示“以过时、老派的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that is old-fashioned and no longer common or suitable for modern times","zh":"以过时的方式；老派地（不再常见或不适合现代）"},"examples":[{"en":"The website is designed antiquatedly, with tiny text and confusing menus.","zh":"这个网站的设计很过时，字体很小、菜单也让人困惑。"},{"en":"Some workplaces still operate antiquatedly, relying on paper forms for everything.","zh":"有些工作场所仍以过时的方式运作，什么都依赖纸质表格。"}]}],"synonyms":["old-fashionedly","outdatedly","anachronistically"],"phonetic":"/ænˈtɪkweɪtɪdli/","extraExplanation":["“antiquatedly”来自形容词“antiquated（过时的）”加副词后缀“-ly”，表示“以……的方式”。在实际英语中更常用的说法是：“in an antiquated way / in an old-fashioned way”。","语气通常带有轻微批评或不赞同：强调某种做法“跟不上时代”。在较正式或批评性的写作（评论、社论、学术讨论）里更常见。"]}
{"word":"antiquatedness","summary":{"en":"Antiquatedness means the quality or degree of being old-fashioned or out of date.","zh":"Antiquatedness 指“过时/陈旧”的状态或程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being antiquated (old-fashioned, no longer in common use, or out of date)","zh":"过时；陈旧；不合时宜（指老派、已不再常用或落伍的状态）"},"examples":[{"en":"The antiquatedness of the software made it hard to run on modern computers.","zh":"这款软件的过时性使它很难在现代电脑上运行。"},{"en":"Critics pointed out the antiquatedness of the law and called for reform.","zh":"批评者指出这条法律已经陈旧过时，并呼吁改革。"},{"en":"Some people enjoy the antiquatedness of handwritten letters because it feels personal.","zh":"有些人喜欢手写信的“老派感”，因为它更有人情味。"}]},{"partOfSpeech":"n.","definition":{"en":"the degree to which something feels old-fashioned or outdated","zh":"陈旧程度；过时程度"},"examples":[{"en":"We debated the antiquatedness of the dress code compared with other companies.","zh":"我们讨论了这项着装规定相比其他公司有多过时。"},{"en":"The design’s charm depends on its antiquatedness.","zh":"这种设计的魅力在于它带有一定的复古陈旧感。"}]}],"synonyms":["outdatedness","old-fashionedness","obsolescence","datedness"],"phonetic":"/ænˈtiːkweɪtɪdnəs/","extraExplanation":["“antiquatedness”来自形容词“antiquated”（过时的）加名词后缀“-ness”（……的性质/状态）。在写作中它偏正式、偏学术，日常口语更常用“how outdated it is / how old-fashioned it is”。","注意区分：\n- “antique”多指“古董/古老而有价值的”，带正面或中性意味；\n- “antiquated”多指“过时落伍的”，常带负面意味（不再适用）。"]}
{"word":"antiquates","summary":{"en":"“Antiquates” means “makes something obsolete or old-fashioned.”","zh":"“antiquates”表示“使某物过时/淘汰”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something old-fashioned or no longer used; to make something obsolete","zh":"使（某物）过时；使（某物）变得不再使用；使淘汰"},"examples":[{"en":"New technology quickly antiquates older devices.","zh":"新技术很快就会让旧设备过时。"},{"en":"The updated law antiquates the previous regulation.","zh":"这项更新后的法律使之前的规定失效。"}]},{"partOfSpeech":"vi.","definition":{"en":"(rare) to become old-fashioned or no longer useful","zh":"（较少用）变得过时；变得不再有用"},"examples":[{"en":"Certain customs antiquate as society changes.","zh":"随着社会变化，一些习俗会逐渐过时。"}]}],"synonyms":["make obsolete","outdate","supersede","render obsolete"],"phonetic":"/ˈæn(t)ɪˌkweɪt/","extraExplanation":["“antiquates”是动词“antiquate”的第三人称单数形式（he/she/it antiquates）。","词源来自拉丁语 *antiquus*（古老的）。在现代英语中更常见、更自然的表达通常是 **make obsolete**（使过时）或 **outdate**（使过时）。"]}
{"word":"antiquating","summary":{"en":"“Antiquating” means making something outdated or obsolete (or, less commonly, becoming outdated).","zh":"“antiquating”指使某物变得过时/淘汰（较少见也可指逐渐变得过时）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(present participle of **antiquate**) making something old-fashioned or no longer used; causing something to become obsolete.","zh":"（**antiquate** 的现在分词）使某物变得过时、陈旧；使某物不再被使用（变得淘汰）。"},"examples":[{"en":"Rapid technological change is **antiquating** many older devices.","zh":"技术快速发展正在让许多旧设备变得过时。"},{"en":"New laws may be **antiquating** some traditional business practices.","zh":"新法律可能正在让一些传统商业做法变得不再适用。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common) becoming old-fashioned or no longer used.","zh":"（较少见）变得过时；逐渐不再被使用。"},"examples":[{"en":"Some formal expressions are **antiquating** in everyday speech.","zh":"一些正式说法在日常口语中正逐渐过时。"}]}],"synonyms":["outdating","making obsolete","rendering obsolete","making outdated","superseding"],"phonetic":"ˈæn(t)əˌkweɪtɪŋ","extraExplanation":["“antiquate / antiquating”在现代英语中较偏正式、学术化，也带一点“古旧”“被淘汰”的语感。日常更常用的替代说法有：**make obsolete**, **outdate**, **become outdated**, **fall out of use**。","词源上与拉丁语 *antiquus*（古老的）相关，和 **antique**（古董/古老的）同源。注意区分：**antiquate**（使过时）≠ **antique**（古董/古老的）。"]}
{"word":"antiquation","summary":{"en":"Antiquation is a formal, rare noun meaning (1) the process of becoming obsolete, or (2) the state of being ancient.","zh":"Antiquation 是一个正式且少见的名词，主要指（1）变得过时/被淘汰的过程，或（2）古老的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making something old-fashioned or no longer used; becoming obsolete","zh":"使某物变得过时、废弃的过程；（某物）逐渐被淘汰"},"examples":[{"en":"New technology can lead to the antiquation of older machines.","zh":"新技术可能会导致旧机器的过时与淘汰。"},{"en":"The law fell into antiquation after years of non-enforcement.","zh":"这项法律多年未被执行，逐渐沦为废置。"}]},{"partOfSpeech":"n.","definition":{"en":"a state or quality of being ancient; great age (rare)","zh":"古老的状态或性质；年代久远（较少见）"},"examples":[{"en":"The manuscript’s antiquation made it valuable to historians.","zh":"这份手稿的古老年代使它对历史学家很有价值。"}]}],"synonyms":["obsolescence","disuse","outdating","supersession","antiquity (for the “ancientness” sense)"],"phonetic":"/ænˌtɪkwˈeɪʃən/","extraExplanation":["“antiquation”在现代英语中非常少见，更常用的表达是：\n- “obsolescence / becoming obsolete”（变得过时、被淘汰）\n- “antiquity”（古代、古物、古老）\n因此写作时如果想表达“过时/淘汰”，用“obsolescence”通常更自然；如果想表达“古代/古老之物”，用“antiquity”更常见。","词源上与拉丁语“antiquus（古老的）”有关，语气偏正式、书面，常见于学术或历史类语境。"]}
{"word":"antique","summary":{"en":"“Antique” means an old (often 100+ years) object, or describes something old and valuable because of its age or history.","zh":"“antique”指古董/古物（常指约100年以上），也可作形容词表示“古老且因年代或历史而珍贵的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an old and often valuable object (such as furniture, jewelry, or art), usually at least about 100 years old","zh":"古董；古物（通常指约100年以上、常因稀有而有价值的物品，如家具、珠宝或艺术品）"},"examples":[{"en":"They collect antiques and display them in their home.","zh":"他们收藏古董，并把它们陈列在家里。"},{"en":"This chair looks like an antique, but it’s actually a modern copy.","zh":"这把椅子看起来像古董，但其实是现代仿制品。"}]},{"partOfSpeech":"adj.","definition":{"en":"old and often valuable because of age, design, or historical importance","zh":"古老的；古董的（因年代、设计或历史意义而常显得珍贵）"},"examples":[{"en":"She bought an antique mirror at a small shop.","zh":"她在一家小店买了一面古董镜子。"},{"en":"The room is decorated with antique furniture.","zh":"这个房间用古董家具装饰。"}]}],"synonyms":["antiquity","heirloom","relic","vintage (related, not identical)","old-fashioned (adj., related)"],"phonetic":"/ænˈtiːk/","extraExplanation":["在英语语境里，antique 常有“大约100年以上”的含义，但不同领域标准不完全一致：比如车迷会说 antique car（老爷车/古董车），可能按特定年代划分；而店铺里也会用 vintage（复古/老物件）来指“有年代感但不一定够‘古董’标准”的物品。","常见搭配：antique shop（古董店）、antique dealer（古董商）、antique furniture（古董家具）。与之相关的表达还有 reproduction/copy（复制品）、fake（赝品）。"]}
{"word":"antique-looking","summary":{"en":"Antique-looking means “having the appearance of an antique; styled to look old.”","zh":"Antique-looking 指“外观像古董的；带仿古/复古风格的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made to look old and valuable, like an antique (often intentionally styled or aged).","zh":"看起来像古董的；仿古的（常指刻意做旧或采用复古风格）。"},"examples":[{"en":"She bought an antique-looking mirror for her apartment.","zh":"她买了一面看起来像古董的镜子放在公寓里。"},{"en":"The café has antique-looking lamps that create a warm, cozy feeling.","zh":"那家咖啡馆有一些仿古的灯，营造出温暖舒适的感觉。"},{"en":"The drawer handles are antique-looking, but the table is actually new.","zh":"抽屉把手看起来像古董，但这张桌子其实是新的。"}]}],"synonyms":["vintage-looking","old-fashioned-looking","retro-looking","antique-style","antiqued"],"phonetic":"/ænˈtiːk ˌlʊkɪŋ/","extraExplanation":["“antique-looking”是复合形容词，常用连字符（hyphen）放在名词前作定语：an antique-looking chair。放在系动词后作表语时也可不加连字符：The chair looks antique.","语气上它通常表示“外观像古董”，不一定是真的古董；若要强调“真古董”，更常说：an antique chair / a genuine antique."]}
{"word":"antique-style","summary":{"en":"“Antique-style” describes something new or modern that is designed to look old and classic, like an antique.","zh":"“antique-style”指“仿古/古董风格的”，形容新的物品被设计成看起来像古董、经典旧式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made to look like an antique; designed with an old-fashioned, classic appearance (often inspired by earlier historical periods).","zh":"仿古的；古董风格的；带有旧式、经典外观（常受早期历史时期启发）。"},"examples":[{"en":"They decorated the cafe with antique-style lamps and wooden chairs.","zh":"他们用仿古风格的灯和木椅来装饰这家咖啡馆。"},{"en":"I bought an antique-style mirror, even though it’s brand-new.","zh":"我买了一面仿古镜子，虽然它是全新的。"}]}],"synonyms":["antique-look","antique-inspired","old-world","classic-style","period-style","vintage-style"],"phonetic":"/ænˈtik staɪl/","extraExplanation":["“antique-style”常用来强调“看起来像古董，但不一定真的是古董”。如果是真古董，英语更常说“an antique (n.)”或“antique furniture”。","写法上可用连字符（antique-style）放在名词前作定语：an antique-style clock；也可不用连字符放在名词后：The clock is antique style（更常见的自然表达是“The clock is in an antique style / has an antique look.”）。","相关近义表达：vintage-style（复古风、偏近几十年流行元素）、retro（怀旧、常指特定年代如70/80年代）、old-fashioned（老派/过时，可能带贬义）。"]}
{"word":"antiqued","summary":{"en":"Antiqued means “made to look old like an antique,” and it can also be the past form of the verb meaning “to make something look antique.”","zh":"antiqued 表示“仿古的、做旧的”，也可作动词 antique 的过去式/过去分词，意为“使呈现仿古效果”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made to look old or like an antique (often by using special finishing techniques).","zh":"做成旧式外观的；仿古的（常用特殊工艺让物品看起来像古董）。"},"examples":[{"en":"They bought an antiqued mirror for the hallway.","zh":"他们买了一面仿古镜子放在走廊。"},{"en":"The table has an antiqued finish that gives it a warm, worn look.","zh":"这张桌子做了仿古涂装，呈现出温暖、使用过的旧感。"}]},{"partOfSpeech":"vt.","definition":{"en":"To make something look old or like an antique.","zh":"使（某物）呈现旧化效果；做成仿古风格。"},"examples":[{"en":"The artist antiqued the frame to match the painting.","zh":"艺术家把画框做旧，以便与画作相配。"},{"en":"The metal was antiqued with a dark patina.","zh":"金属通过做出深色包浆来呈现仿古效果。"}]}],"synonyms":["antique-style","vintage-looking","distressed","aged","weathered"],"phonetic":"/ænˈtiːkt/","extraExplanation":["“antiqued”常见于家居与工艺语境（如antiqued wood/antiqued silver/antiqued mirror）。它强调“人为做旧/仿古效果”，不等于“真正的古董”。真正的古董通常用 antique（名词/形容词）来表达。","常见做旧手法包括：打磨边角制造磨损感、上深色釉/蜡突出纹理、制造“包浆（patina）”、或在镜面上做出轻微斑驳感。"]}
{"word":"antiquely","summary":{"en":"“Antiquely” means “in an antique, old-fashioned style.”","zh":"“antiquely”表示“以古董/复古的旧式风格”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an antique style; in a way that looks old-fashioned or from an earlier historical period.","zh":"以古董风格；以看起来古老、具有旧时代特色的方式。"},"examples":[{"en":"The hotel lobby was antiquely decorated, with dark wood and brass lamps.","zh":"酒店大堂以古典旧式风格装饰，有深色木材和黄铜灯。"},{"en":"She wore an antiquely cut dress that looked like it came from the 1920s.","zh":"她穿着一条剪裁很复古的裙子，看起来像是20世纪20年代的。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Rare) In a quaint or oddly old-fashioned way.","zh":"（少见）以古怪而又带点旧式的方式；古雅而奇特地。"},"examples":[{"en":"His letters were written antiquely, with formal greetings and long closings.","zh":"他的信写得很古雅旧式：正式的问候语和很长的结尾敬语。"}]}],"synonyms":["old-fashionedly","in a vintage style","quaintly","in an antique manner"],"phonetic":"ænˈtiːkli","extraExplanation":["“antiquely”来自形容词“antique（古董的/古老而有价值的）”。注意不要和“antiquated（过时的、陈旧落伍的）”混淆：antique/antiquely常带欣赏的“复古、有质感”，而antiquated更偏负面，表示“老掉牙、不合时代”。"]}
{"word":"antiqueness","summary":{"en":"Antiqueness means the quality of being very old, or an old-fashioned, from-the-past feeling in style.","zh":"Antiqueness指“非常古老的性质”，也可指风格上带有“旧时代、复古”的感觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of being very old; great age, especially in relation to history or the past.","zh":"古老；久远（指非常久的年代或历史上的久远性）。"},"examples":[{"en":"The museum protects the vase because of its antiqueness.","zh":"博物馆保护这只花瓶，因为它非常古老。"},{"en":"Researchers study the antiqueness of the ruins to understand early civilizations.","zh":"研究人员通过研究遗址的古老程度来了解早期文明。"}]},{"partOfSpeech":"n.","definition":{"en":"An old-fashioned or outdated quality in style or manner; a sense of being from an earlier time.","zh":"古旧的风格；过时感（指带有旧时代气息的特点）。"},"examples":[{"en":"The house has a charming antiqueness, with wooden floors and classic lamps.","zh":"这栋房子有一种迷人的古旧气息：木地板和复古灯具。"},{"en":"Some readers enjoy the antiqueness of the language in older novels.","zh":"有些读者喜欢老小说里语言的古旧感。"}]}],"synonyms":["age","great age","antiquity","ancientness","oldness","old-fashionedness"],"phonetic":"/ænˈtiːk.nəs/","extraExplanation":["“antiqueness”由形容词“antique（古老的/古董的）”加名词后缀“-ness（……的性质/状态）”构成，意思是“……的性质”。","日常英语里更常见的表达是“age”“great age”“antiquity（古代/古老）”或“an antique look/feel（复古的感觉）”。“antiqueness”较偏书面或描述风格的用法。","注意区分：antiqueness（古老这一“性质”）≠ antiques（古董，复数名词）≠ antiquity（古代；古老的时代，常指历史时期）。"]}
{"word":"antiquer","summary":{"en":"An antiquer is someone who deals in or collects antiques.","zh":"antiquer 指从事古董买卖或收藏古董的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who deals in, collects, or is knowledgeable about antiques","zh":"古董商；古董收藏家；古董行家"},"examples":[{"en":"The antiquer bought a set of 19th-century chairs at an estate sale.","zh":"那位古董商在遗产拍卖会上买下了一套19世纪的椅子。"},{"en":"As an antiquer, she can spot a real antique from a reproduction quickly.","zh":"作为一名古董行家，她能很快分辨真古董和仿制品。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a person who is interested in old things, styles, or historical objects","zh":"（较少用）喜爱古旧事物或历史物件的人"},"examples":[{"en":"He’s an antiquer who loves browsing flea markets on weekends.","zh":"他是个喜欢旧物的人，周末爱逛跳蚤市场。"}]}],"synonyms":["antique dealer","antiquarian","collector","antiques expert"],"phonetic":"/ænˈtiːkər/","extraExplanation":["“antiquer”常见于较传统或特定语境；现代英语里更常说“antique dealer”（古董商）、“antique collector”（古董收藏家）或“antiques expert”（古董专家）。","“antique”通常指“有一定年代且具有收藏价值的物品”（很多地方习惯以100年以上为“古董”的参考标准，但各国与各领域标准不同）。"]}
{"word":"antiquers","summary":{"en":"“Antiquers” means people who buy, sell, collect, or restore antiques.","zh":"“antiquers”指从事古董买卖、收藏或修复的人（“antiquer”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who deal in antiques (buying, selling, collecting, or restoring old valuable objects).","zh":"古董商；古董收藏／修复爱好者（从事古董的买卖、收藏或修复的人）。"},"examples":[{"en":"Local antiquers set up booths at the weekend market to sell vintage furniture.","zh":"当地的古董商在周末集市摆摊出售复古家具。"},{"en":"The museum consulted antiquers to verify the age of the porcelain.","zh":"博物馆请古董行家协助鉴定瓷器的年代。"},{"en":"Antiquers often look for maker’s marks and original hardware.","zh":"古董从业者常会寻找工匠印记和原装配件。"}]}],"synonyms":["antique dealers","antique collectors","dealers","collectors"],"phonetic":"/ˈæn.ti.kwɚz/","extraExplanation":["“antiquers”是“antiquer”的复数形式。日常英语里更常见的说法是“antique dealers（古董商）”或“collectors（收藏家）”。“antiquer”带有口语或行业内自称的感觉。"]}
{"word":"antiques","summary":{"en":"“Antiques” means old, often valuable objects (commonly 100+ years old). It can also be used humorously to mean something very old-fashioned.","zh":"“antiques”指古董、古玩（常指约100年以上且有价值的老物件）；也可引申为“非常过时的东西”（带调侃/批评）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Old and usually valuable objects (like furniture, jewelry, or art), especially ones that are at least about 100 years old.","zh":"古董；古玩（通常指年代久远且有价值的物品，如家具、珠宝或艺术品；常见标准约为至少100年历史）。"},"examples":[{"en":"They spent the weekend browsing antiques at a small market.","zh":"他们周末在一个小市集逛古董。"},{"en":"Her grandmother’s clock is one of the family’s most treasured antiques.","zh":"她祖母的钟是家里最珍贵的古董之一。"}]},{"partOfSpeech":"n.","definition":{"en":"Old-fashioned and not suitable for modern needs (often used humorously or critically).","zh":"老旧过时的；不适合现代需求的（常带调侃或批评意味）。"},"examples":[{"en":"Their computer system is an antique compared to what we use now.","zh":"他们的电脑系统跟我们现在用的比起来简直是“古董”。"},{"en":"This policy feels like an antique from another era.","zh":"这项政策感觉像是另一个年代留下来的“古董”。"}]}],"synonyms":["antiquities","collectibles","heirlooms","old treasures"],"phonetic":"/ænˈtiːks/","extraExplanation":["在英语里，antique（名词）常见搭配有：antique shop（古董店）、antique market/fair（古董市集/展会）、antique dealer（古董商）、antique furniture（古董家具）。","“至少100年”是常见的行业/通行标准之一，但不同国家、拍卖行或品类会有不同口径；有些场景中只要“年代久、有收藏价值”也会被口语上称为 antiques。","antique 作形容词时表示“古董的/古老的”，例如: an antique vase（一个古董花瓶）。你输入的 antiques 是复数名词，更常指“一批古董”。"]}
{"word":"antiquing","summary":{"en":"Antiquing means shopping for or searching for antiques as a hobby or activity.","zh":"Antiquing 指“淘古董/逛古董店”，是一种寻找或购买古董的活动或爱好。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the hobby or activity of looking for, buying, or selling antiques (old and valuable objects), often by visiting antique shops, markets, or fairs","zh":"“淘古董；逛古董店”的活动或爱好：寻找、购买或出售古董（古老且有价值的物品），常见于逛古董店、跳蚤市场或古董展"},"examples":[{"en":"We went antiquing on Saturday and found a vintage mirror.","zh":"我们周六去淘古董，找到了一面复古镜子。"},{"en":"Antiquing is popular in small towns with historic main streets.","zh":"在有历史老街的小镇上，逛古董店很受欢迎。"}]},{"partOfSpeech":"v.","definition":{"en":"to go shopping for antiques; to look for antiques for fun or business","zh":"去淘古董；为了兴趣或生意去寻找古董"},"examples":[{"en":"They like to antique when they travel.","zh":"他们旅行时喜欢去淘古董。"},{"en":"We spent the afternoon antiquing at a local flea market.","zh":"我们下午在当地跳蚤市场淘古董。"}]}],"synonyms":["shopping for antiques","antique hunting","browsing antique shops"],"phonetic":"/ænˈtiːkɪŋ/","extraExplanation":["“Antiquing”在美式英语里很常见，通常带有休闲、周末出游的感觉。很多人会把它和“road trip（公路旅行）”“flea market（跳蚤市场）”联系在一起。","注意区分：antique（名词）是“古董”；antique（形容词）是“古董的/古老而有价值的”。而“antiquing”更强调“去找/去逛/去淘”的活动。"]}
{"word":"antiquist","summary":{"en":"Antiquist means a person interested in or dealing with antiques or ancient objects (rare word).","zh":"antiquist 指研究或经营古董、古物的人（较罕见的词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who studies, collects, or deals in antiques or ancient objects; an antiquarian (rare, old-fashioned).","zh":"研究、收藏或经营古董/古物的人；古物学者（较罕见、偏旧式用法）。"},"examples":[{"en":"The local museum hired an antiquist to identify the age of the pottery.","zh":"当地博物馆聘请了一位古物学者来鉴定陶器的年代。"},{"en":"As an antiquist, she spent weekends searching flea markets for early maps and coins.","zh":"作为一名古物收藏研究者，她周末常去跳蚤市场寻找早期地图和硬币。"}]}],"synonyms":["antiquarian","antique dealer","collector"],"phonetic":"/ænˈtiːkwɪst/","extraExplanation":["“antiquist”在现代英语中非常少见，更常用的词是“antiquarian”（古物学者；研究古代事物的人）或“antique dealer”（古董商）。","词根来自拉丁语“antiquus”（古老的）。在写作或正式场合，用“antiquarian”通常更自然。"]}
{"word":"antiquitarian","summary":{"en":"Antiquitarian means a person (or an adjective) connected with studying or collecting ancient and historical objects and records; it is a less common form of antiquarian.","zh":"antiquitarian 指研究或收藏古代与历史物件、文献的人（或相关的形容词）；它是较少见的 antiquarian 变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who studies or collects things from the past (especially ancient objects, old books, or historical records); an antiquarian.","zh":"研究或收藏古代事物（尤指古董、旧书或历史文献）的人；古物研究者。"},"examples":[{"en":"The museum hired an antiquitarian to catalog its collection of Roman coins.","zh":"博物馆雇了一位古物研究者来为馆藏的罗马硬币编目。"},{"en":"As an antiquitarian, she spends weekends searching flea markets for rare manuscripts.","zh":"作为古物收藏与研究者，她周末常去跳蚤市场寻找罕见手稿。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to the study, collecting, or careful interest in ancient or historical things.","zh":"与古物研究、收藏或对古代/历史事物的细致兴趣有关的；考古旧物的。"},"examples":[{"en":"His antiquitarian notes focused on small details in medieval handwriting.","zh":"他的古物研究笔记专注于中世纪书写中的细微特征。"},{"en":"They met at an antiquitarian society devoted to local history.","zh":"他们在一个致力于地方史的古物研究学会相识。"}]}],"synonyms":["antiquarian","historian","archaeologist","collector"],"phonetic":"/ˌæn.tɪ.kwɪˈtɛr.i.ən/","extraExplanation":["“antiquitarian”在现代英语里较少见，更常用的词是“antiquarian”。两者含义非常接近。","在文学或评论语境中，这类词有时带一点“过分迷恋旧物、拘泥琐碎史料”的意味，具体褒贬取决于上下文。"]}
{"word":"antiquities","summary":{"en":"Antiquities are ancient objects (and sometimes the academic field) valued for their history and culture.","zh":"Antiquities 指具有历史文化价值的古代文物（有时也指研究古代的学术领域）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ancient objects (such as statues, coins, pottery, or tools), especially those studied or collected because of their historical value.","zh":"古物；古代文物（如雕像、钱币、陶器或工具等），尤指因其历史价值而被研究或收藏的物品。"},"examples":[{"en":"The museum’s new exhibit features Roman antiquities.","zh":"博物馆的新展览展出了罗马古代文物。"},{"en":"Police recovered stolen antiquities and returned them to the country of origin.","zh":"警方找回了被盗文物，并将其归还给原属国。"}]},{"partOfSpeech":"n.","definition":{"en":"The study or subject area dealing with the ancient past and ancient cultures (often used in academic contexts).","zh":"古代研究；古代学（常用于学术语境，指研究古代历史与文化的领域）。"},"examples":[{"en":"She specializes in Greek antiquities at the university.","zh":"她在大学里专攻希腊古代研究。"},{"en":"The course introduces students to the antiquities of the Near East.","zh":"这门课向学生介绍近东地区的古代文明与遗存。"}]}],"synonyms":["ancient artifacts","relics","cultural heritage objects","antique objects"],"phonetic":"/ænˈtɪkwətiz/","extraExplanation":["“antiquities”通常以复数形式出现，表示“成批的古代文物”。单数“antiquity”更多指“古代/古代时期”或“古老”。","在新闻中常见搭配：“looted/stolen antiquities（被掠夺/被盗的文物）”“illegal antiquities trade（非法文物交易）”。","在文化与法律语境里，文物来源（provenance）非常重要：指文物的出土、流转与收藏记录，用来判断是否合法与是否应归还。"]}
{"word":"antiquity","summary":{"en":"Antiquity means the ancient past, great age, or ancient objects (often plural: antiquities).","zh":"Antiquity 指“古代/远古时期”、或“年代久远的古老感”，也可指“古物/文物”（常用复数 antiquities）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the ancient past; the period of history long ago (especially ancient Greece and Rome)","zh":"古代；远古时期（尤指古希腊、古罗马等古典时代）"},"examples":[{"en":"Many ideas about democracy come from antiquity, especially from ancient Greece.","zh":"许多关于民主的思想源自古代，尤其是古希腊。"},{"en":"Historians study texts from antiquity to understand how people lived.","zh":"历史学家研究古代文献，以了解人们如何生活。"}]},{"partOfSpeech":"n.","definition":{"en":"great age; the state of being very old","zh":"年代久远；古老（作为“很古老”的状态）"},"examples":[{"en":"The building’s antiquity is part of its charm.","zh":"这座建筑的古老感正是它迷人之处。"}]},{"partOfSpeech":"n.","definition":{"en":"an ancient object, especially a valuable work of art from the past (often used in the plural: antiquities)","zh":"古物；古代文物（常用复数 antiquities 指文物、古董）"},"examples":[{"en":"The museum returned several antiquities to their country of origin.","zh":"博物馆将几件古代文物归还给其原属国。"},{"en":"Buying looted antiquities can support illegal trade.","zh":"购买被盗掘的文物可能助长非法交易。"}]}],"synonyms":["ancient times","the ancient world","the distant past","old age","antiquities (ancient artifacts)"],"phonetic":"/ænˈtɪkwəti/","extraExplanation":["词源：antiquity 来自拉丁语 antiquus（“古老的、从前的”）。英语里常与 classical antiquity（“古典古代”，大致指古希腊罗马时期）搭配出现。","用法提示：antiquity 多指“古代时期/古老状态”；若强调“具体文物”，更常用复数 antiquities。与 antique（“古董/古老的”）不同：antique 常指一件老物件（不一定是古代文明的文物）。","文化语境：谈到 antiquities（文物）时，英语新闻与学术写作常涉及“文物归还（repatriation）”“非法盗掘（looting）”等议题。"]}
{"word":"Antiquity-related","summary":{"en":"“Antiquity-related” means connected with the ancient past, especially ancient civilizations, history, art, or artifacts.","zh":"“Antiquity-related”意为“与古代（远古时期）相关的”，常指古代文明、历史、艺术或遗物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with or about antiquity (the ancient past), especially ancient civilizations, art, history, or objects from ancient times","zh":"与古代（远古时期）有关的；尤指与古代文明、艺术、历史或古代遗物相关的"},"examples":[{"en":"The museum is hiring a researcher for antiquity-related collections.","zh":"这家博物馆正在为与古代相关的馆藏招聘研究员。"},{"en":"She wrote an antiquity-related article about Roman coins.","zh":"她写了一篇与古代相关的文章，主题是罗马硬币。"},{"en":"The course covers antiquity-related myths and early Mediterranean cultures.","zh":"这门课涵盖与古代相关的神话以及早期地中海文化。"}]}],"synonyms":["related to antiquity","ancient-world-related","classical","ancient-history-related","of the ancient world"],"phonetic":"/ænˈtɪkwəti rɪˌleɪtɪd/","extraExplanation":["“antiquity-related”是较现代、偏说明性的复合形容词，常用于学术、博物馆、出版、课程介绍等语境。日常口语里更常说“related to antiquity / about the ancient world / ancient-history-related”。","注意“antiquity”通常指“古代/古典时代”（如希腊罗马、古埃及等），不等同于“antique（古董）”。如果你想表达“古董相关”，更自然的是“antique-related”或“antiques-related”。"]}
{"word":"antiquum","summary":{"en":"*Antiquum* is Latin for “the old/ancient (thing),” seen mostly in scholarly or motto-style phrases.","zh":"*Antiquum* 是拉丁语，意为“古老的／旧的（事物）”，多见于学术或格言式拉丁短语中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin; used in English mainly in scholarly, legal, or motto contexts) “ancient/old (thing),” the neuter singular form of *antiquus* (“ancient, former”). Often appears in Latin phrases contrasting the old with the new.","zh":"（拉丁语；在英语中多见于学术、法律或格言语境）“古老的／从前的（事物）”，源自 *antiquus*（“古老的、以前的”）的中性单数形式。常用于拉丁短语中表达“新与旧”的对照。"},"examples":[{"en":"The inscription contrasts *novum* and *antiquum* (the new and the old).","zh":"这段铭文对照了 *novum* 与 *antiquum*（新的与旧的）。"},{"en":"In a classics seminar, we discussed how *antiquum* can mean “the old way” in certain phrases.","zh":"在古典学研讨课上，我们讨论了 *antiquum* 在某些短语里如何表示“旧的做法”。"}]}],"synonyms":["ancient","old","former","traditional"],"phonetic":"ænˈtiːkwəm","extraExplanation":["在拉丁语里，*antiquum* 通常是形容词 *antiquus* 的中性单数形式（常见作宾格，也可能作主格/表语视句子而定）。因此它本身更像“古老的（东西）/旧事物”而不是英语里常见的独立词。","如果你在句子或铭文中看到 *antiquum*，通常需要结合上下文判断它修饰或指代的对象（例如“旧法、旧习、旧制度”等）。"]}
{"word":"antiquus","summary":{"en":"Antiquus is a Latin-derived word meaning “ancient/very old,” occasionally used in English academic or historical writing.","zh":"Antiquus 源自拉丁语，意为“古老的/远古的”，偶尔用于英语的学术或历史语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Ancient or very old; from long ago (a Latin word sometimes used in English, especially in academic or historical contexts).","zh":"古老的；远古的（拉丁语词，有时在英语学术或历史语境中借用）。"},"examples":[{"en":"The manuscript uses several Latin terms, including *antiquus*, to describe ancient customs.","zh":"这份手稿使用了几个拉丁术语，包括 *antiquus*，来描述古代习俗。"},{"en":"In the lecture, the professor contrasted *antiquus* (ancient) with *novus* (new).","zh":"在讲座中，教授把 *antiquus*（古老的）与 *novus*（新的）作对比。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A person from ancient times; an ancient (used mainly in scholarly or playful Latin-in-English writing).","zh":"（较少见）古人；古代的人（多见于学术写作或带戏谑意味的“夹拉丁语”表达）。"},"examples":[{"en":"The author jokingly called Homer an *antiquus* among poets.","zh":"作者开玩笑地称荷马是诗人中的一位 *antiquus*（古代人）。"}]}],"synonyms":["ancient","old","antique","age-old","archaic"],"phonetic":"/ænˈtiːkwəs/","extraExplanation":["【词源与联系】*antiquus* 是拉丁语“古老的、从前的”，和英语的 *antique*（古董/古老的）、*antiquity*（古代/古物）、*antiquarian*（古物研究者/古董迷）同源。","【使用场景】英语里更常用 *ancient* 或 *old*；*antiquus* 多出现在古典学、历史学、法律拉丁语、铭文/格言引用等语境，用来营造“古典/学术”风格。","【小提示】如果你是在读拉丁语原文，*antiquus* 也常带“从前的、旧制度/旧习惯的”含义，不一定是“非常非常古老”的那种史前感。"]}

