{"word":"Antia","summary":{"en":"Antia is most commonly used as a proper name (surname or given name), often seen as an Indian surname.","zh":"Antia 最常见用法是人名（姓或名），常见于印度姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name or given name (a proper noun), used in several cultures—especially as a surname in India.","zh":"一个人名/姓氏（专有名词），在多种文化中使用，尤其常见于印度的姓氏。"},"examples":[{"en":"Dr. Antia will speak at the conference tomorrow.","zh":"安提亚医生明天将在会议上发言。"},{"en":"I met someone named Antia in Mumbai.","zh":"我在孟买遇到过一位叫 Antia 的人。"}]}],"phonetic":"/ˈæntiə/","extraExplanation":["“Antia”通常作为专有名词使用（人名/姓氏），因此在英文句子里一般首字母大写：Antia。","在印度（尤其部分帕西/Parsi 社群）中可见该姓氏；具体来源和含义会因家族与地区而异。"]}
{"word":"antiabolitionist","summary":{"en":"Antiabolitionist means a person or position opposed to ending slavery, especially in U.S. history.","zh":"antiabolitionist 指反对废除奴隶制的人或立场，尤常用于美国历史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposed the movement to end slavery (especially in the U.S. in the 1700s–1800s).","zh":"反对废除奴隶制运动的人（尤指18–19世纪美国的历史语境）。"},"examples":[{"en":"Many antiabolitionists argued that ending slavery would harm the economy.","zh":"许多反废奴主义者认为废除奴隶制会损害经济。"},{"en":"The newspaper published speeches by antiabolitionists during the heated debate.","zh":"在激烈的争论时期，那家报纸刊登了反废奴主义者的演讲。"}]},{"partOfSpeech":"adj.","definition":{"en":"opposed to abolishing slavery; supporting the continuation of slavery or the anti-abolition movement.","zh":"反对废除奴隶制的；支持维持奴隶制或反废奴立场的。"},"examples":[{"en":"He held antiabolitionist views in the years before the Civil War.","zh":"在内战前的那些年里，他持反废奴的观点。"},{"en":"The group circulated antiabolitionist pamphlets.","zh":"该团体散发反废奴的小册子。"}]}],"synonyms":["proslavery","anti-abolitionist","slavery supporter"],"phonetic":"/ˌæn.tiˌæb.əˈlɪʃ.ə.nɪst/","extraExplanation":["“antiabolitionist”常见于美国历史语境，特别是19世纪围绕废奴运动（abolitionism）的政治与社会冲突。它不仅指个人，也可形容言论、组织或出版物的立场。","拼写上常见两种：antiabolitionist（较常见）与 anti-abolitionist（带连字符，更强调构词结构）。","学习时注意它与“proslavery（亲奴隶制）”有重叠但不完全等同：有些人反对“立即废奴”或废奴运动方式，也可能被称为 antiabolitionist。"]}
{"word":"antiabortion","summary":{"en":"Antiabortion means “against abortion,” and can describe people, groups, views, or laws that oppose abortion.","zh":"antiabortion 指“反对堕胎的/反堕胎者”，可用于描述个人、团体、观点或法律。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to abortion; against the right or practice of ending a pregnancy.","zh":"反对堕胎的；反对终止妊娠（堕胎）的。"},"examples":[{"en":"Many antiabortion groups organize marches and educational events.","zh":"许多反堕胎团体会组织游行和宣讲活动。"},{"en":"The senator is known for her antiabortion views.","zh":"这位参议员以其反堕胎立场而闻名。"},{"en":"They debated antiabortion laws in the state legislature.","zh":"他们在州议会讨论反堕胎相关法律。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or group that opposes abortion.","zh":"反堕胎者；反对堕胎的个人或团体。"},"examples":[{"en":"Antiabortion advocates and abortion-rights supporters held separate rallies.","zh":"反堕胎倡议者和支持堕胎权的人分别举行了集会。"},{"en":"She identifies as antiabortion for religious reasons.","zh":"她因宗教原因自认是反堕胎者。"}]}],"synonyms":["anti-abortion","pro-life (often used)","opposed to abortion"],"phonetic":"/ˌæn.ti.əˈbɔr.ʃən/","extraExplanation":["在美国公共语境中，“antiabortion”常与“pro-life（反堕胎/拥护胎儿生命）”并用，但两者并不完全等同：有人用“pro-life”强调道德立场，也有人偏好“antiabortion”作为较中性的描述。与之相对的常见说法是“pro-choice（支持选择权，通常指支持堕胎权）”。","写作与讨论时这是高度敏感的议题：如果目标是客观表述立场，常用“opposes abortion / supports abortion rights”来避免带有标签化色彩。"]}
{"word":"antiabrasion","summary":{"en":"“Antiabrasion” means abrasion-resistant—made to reduce wear from rubbing or scraping.","zh":"antiabrasion 表示“耐磨/抗磨损”，指能减少摩擦或刮擦造成的磨损。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resistant to wear or damage caused by rubbing or scraping; designed to reduce abrasion.","zh":"耐磨的；抗磨损的；用于减少摩擦/刮擦造成的损伤。"},"examples":[{"en":"The workers wore antiabrasion gloves to protect their hands from rough surfaces.","zh":"工人戴上耐磨手套，保护双手不被粗糙表面磨伤。"},{"en":"This antiabrasion coating helps the paint last longer on metal parts.","zh":"这种抗磨涂层能让金属零件上的油漆更耐久。"}]},{"partOfSpeech":"n.","definition":{"en":"A feature, material, or treatment intended to prevent abrasion.","zh":"（统称）防磨损性能/材料/处理工艺。"},"examples":[{"en":"The jacket’s antiabrasion is important for cycling and outdoor work.","zh":"这件夹克的防磨损性能对骑行和户外工作很重要。"},{"en":"The product description highlights antiabrasion for high-friction areas.","zh":"产品说明强调它在高摩擦区域的防磨损特点。"}]}],"synonyms":["abrasion-resistant","wear-resistant","scuff-resistant","durable"],"phonetic":"/ˌæntiəˈbreɪʒən/","extraExplanation":["在实际英文里更常见的拼写是带连字符的 **anti-abrasion**，尤其出现在材料、涂层、手套、工作服、防护装备等产品参数中；也会看到合写 **antiabrasion**（多见于技术文档或型号/标签）。","构词很好理解：**anti-**（“反/抗”）+ **abrasion**（“磨损、擦伤”）。其中 **abrasion** 也常用于皮肤表面的“擦伤”（如 road abrasion）。"]}
{"word":"antiabrin","summary":{"en":"Antiabrin is an antibody/antiserum used to counter or detect the toxin abrin.","zh":"Antiabrin 指用于对抗或检测强毒性植物毒素 abrin 的抗体/抗血清。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An antibody or antiserum that acts against abrin (a highly poisonous plant toxin).","zh":"抗蓖麻毒素A（abrin）的抗体或抗血清，用于中和或检测这种强毒性植物毒素。"},"examples":[{"en":"Researchers tested antiabrin to see whether it could neutralize abrin in the lab.","zh":"研究人员测试了 antiabrin，观察它是否能在实验室中中和 abrin。"},{"en":"Antiabrin antibodies can be used in assays to detect traces of abrin.","zh":"Antiabrin 抗体可用于检测实验（assay）中识别微量的 abrin。"}]}],"synonyms":["anti-abrin antibody","abrin antitoxin","antiabrin antiserum"],"phonetic":"/ˌæntiˈeɪbrɪn/","extraExplanation":["Abrin 是一种来自相思子（jequirity bean / rosary pea, Abrus precatorius）种子的蛋白毒素，毒性极强；antiabrin 一般出现在毒理学、免疫学或生物安全相关语境中，而不是日常英语。","构词上 anti- 表示“对抗/反…”，abrin 是毒素名；因此 antiabrin 字面意思就是“抗 abrin 的（抗体/血清）”。"]}
{"word":"antiabsolutist","summary":{"en":"Antiabsolutist means opposing absolutism or absolute monarchy; it can also refer to a person who holds that view.","zh":"antiabsolutist 指反对专制主义/君主专制的（形容词），也可指反专制主义者（名词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to absolutism (the idea that a ruler or government should have unlimited power); against absolute monarchy or unrestricted authority.","zh":"反对专制主义（认为统治者或政府拥有无限权力的主张）的；反对君主专制或不受限制权力的。"},"examples":[{"en":"Many antiabsolutist writers argued for constitutional limits on the king’s power.","zh":"许多反专制主义作家主张用宪法来限制国王的权力。"},{"en":"The antiabsolutist movement supported stronger parliaments and civil rights.","zh":"反专制主义运动支持更强的议会权力与公民权利。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who opposes absolutism or absolute monarchy.","zh":"反专制主义者；反对君主专制的人。"},"examples":[{"en":"As an antiabsolutist, he believed the ruler should be accountable to the law.","zh":"作为一名反专制主义者，他认为统治者应当对法律负责。"},{"en":"Antiabsolutists often formed alliances with reformers and liberals.","zh":"反专制主义者常与改革派和自由派结盟。"}]}],"synonyms":["anti-authoritarian","anti-monarchist","constitutional","liberal (historical context)"],"phonetic":"/ˌæn.tiˈæb.sə.luː.tɪst/","extraExplanation":["“anti-”表示“反对”，后接“absolutist（专制主义者/专制的）”。这个词多见于历史与政治语境，尤其用于描述17—19世纪欧洲关于“君权是否应受宪法与议会约束”的争论。","与日常口语相比，它更偏学术/历史写作；在一般新闻或日常表达中，更常用“anti-authoritarian（反威权的）”或“opposed to absolute power（反对绝对权力）”。"]}
{"word":"antiacademic","summary":{"en":"“Antiacademic” describes attitudes or actions that oppose or distrust academia and academic values.","zh":"“antiacademic”指反对或不信任学术界/大学及其学术价值的态度或做法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to academic institutions, academic values, or scholarly ways of thinking; showing dislike or distrust of academia.","zh":"反学术的；反对大学/学界或学术价值的；对学术界不信任或不以为然的。"},"examples":[{"en":"Some voters respond to antiacademic messages that criticize universities as out of touch.","zh":"一些选民会对反学术的论调产生共鸣，这些论调批评大学脱离现实。"},{"en":"His antiacademic attitude made him dismiss research even when it was carefully done.","zh":"他的反学术态度使他即使面对严谨的研究也一概否定。"},{"en":"The film uses an antiacademic tone to poke fun at professors and theory.","zh":"这部电影用反学术的语气来调侃教授和理论。"}]}],"synonyms":["anti-academic","anti-intellectual","anti-elitist","anti-scholarly","anti-university"],"phonetic":"/ˌæntaɪˌækəˈdɛmɪk/","extraExplanation":["“antiacademic”并不是特别常见的标准词，更常见的表达是“anti-academic”（加连字符）或用更具体的词来说明反对什么，例如“anti-intellectual（反智）”“anti-elitist（反精英）”。","语气上它常带批评或政治社会含义：可能是在反对学术圈的“象牙塔”、精英主义或过度理论化，但不一定等于反对学习本身。"]}
{"word":"antiacid","summary":{"en":"An antacid is a medicine (or something described as antacid) that reduces stomach acidity to relieve heartburn or indigestion.","zh":"antiacid 指用于中和胃酸、缓解胃灼热或消化不良的抗酸剂；也可作形容词表示“抗酸的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medicine that neutralizes stomach acid to relieve heartburn, indigestion, or an upset stomach.","zh":"抗酸剂；制酸药（中和胃酸，用于缓解胃灼热、消化不良或胃部不适）"},"examples":[{"en":"I took an antacid after dinner because I had heartburn.","zh":"晚饭后我因为胃灼热吃了一片抗酸剂。"},{"en":"This antacid works quickly, but you should still read the label.","zh":"这种抗酸剂起效很快，但你仍然应该先读说明书。"}]},{"partOfSpeech":"adj.","definition":{"en":"Able to prevent or reduce acidity (especially in the stomach).","zh":"抗酸的；制酸的（能预防或减少酸性，尤其指胃酸）"},"examples":[{"en":"Some people choose antacid tablets for fast relief.","zh":"有些人会选择抗酸药片来快速缓解不适。"}]}],"synonyms":["acid reducer","heartburn medicine","stomach antacid"],"phonetic":"/ˌæn.tiˈæs.ɪd/","extraExplanation":["“Antacid”由“anti-（反、对抗）+ acid（酸）”组成，意思直观：对抗酸。常见成分包括碳酸钙、氢氧化镁、氢氧化铝等，用于短期缓解。若经常需要服用或症状持续，通常建议咨询医生以排除胃食管反流等问题。"]}
{"word":"antiadiaphorist","summary":{"en":"An antiadiaphorist is someone who rejects the idea that certain religious practices are merely “indifferent” and insists they matter.","zh":"antiadiaphorist 指反对“某些宗教做法只是可有可无”的观点、强调这些做法具有重要性的（多用于宗教史/神学语境的）人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposes adiaphorism—the belief that certain religious practices are “indifferent” (not essential) and may be accepted or rejected without harming faith.","zh":"反对“无关紧要论/可有可无论”（adiaphorism）的人；即反对认为某些宗教礼仪或做法在信仰上并非关键、可自由取舍的观点的人。"},"examples":[{"en":"Some Lutheran antiadiaphorists argued that accepting certain church ceremonies would compromise the Reformation.","zh":"一些路德宗的反无关紧要论者认为，接受某些教会仪式会损害宗教改革的原则。"},{"en":"In his writing, he took an antiadiaphorist stance, insisting that public worship practices mattered.","zh":"在他的著作中，他采取反无关紧要论者的立场，坚持公共礼拜的做法很重要。"}]}],"synonyms":["opponent of adiaphorism","critic of adiaphorism"],"phonetic":"/ˌæn.tiˌæd.iˈæf.ə.rɪst/","extraExplanation":["这个词非常罕见，多见于宗教史/神学语境，尤其与16世纪宗教改革时期（如“无关紧要之事/adiaphora”争论）相关。","词形可拆为 anti-（反对）+ adiaphorist（主张“有些事在信仰上属非本质、可自由处理的人”）。adiaphora 源自希腊语，意为“无差别的/无关紧要的事”。"]}
{"word":"antiaditis","summary":{"en":"“antiaditis” is not a standard English word; it’s probably a misspelling.","zh":"“antiaditis”不是标准英文单词，可能是拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling of another word (for example, “antacid” or a medical term ending in “-itis” such as “appendicitis”).","zh":"这不是一个标准的英文单词。它很可能是拼写错误（例如你可能想写“antacid（抗酸药）”，或某个以“-itis（炎症）”结尾的医学词，如“appendicitis（阑尾炎）”）。"},"examples":[{"en":"I can’t find “antiaditis” in standard English dictionaries—did you mean “antacid”?","zh":"我在常见英文词典里找不到“antiaditis”——你是不是想写“antacid”？"},{"en":"Many medical conditions end in “-itis,” which means inflammation.","zh":"很多医学名词以“-itis”结尾，表示“炎症”。"}]}],"phonetic":"N/A","extraExplanation":["“antacid”常见于日常英语，指缓解胃酸/胃灼热的药物；而“-itis”是医学后缀，表示“某部位的炎症”。如果你告诉我你想表达的中文意思（比如“胃酸药/某种炎症/某个器官发炎”）或给出一句上下文，我可以帮你锁定正确拼写并给出完整释义与例句。"]}
{"word":"antiadministration","summary":{"en":"Against a particular political administration (the current government/leadership).","zh":"反对某一届政府/当政领导班子的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to a particular government or leadership team (“the administration”), especially in politics.","zh":"反对某一届政府或领导班子（“当局/政府班子”）的，尤用于政治语境。"},"examples":[{"en":"The senator gave an antiadministration speech criticizing the president’s policies.","zh":"这位参议员发表了反对政府的演讲，批评总统的政策。"},{"en":"Antiadministration groups organized protests after the new law was announced.","zh":"新法律宣布后，反对政府的团体组织了抗议活动。"},{"en":"The newspaper was seen as antiadministration because it ran negative editorials every week.","zh":"这家报纸被认为是反对政府的，因为它每周都刊登批评性的社论。"}]}],"synonyms":["anti-government","anti-regime","oppositional","anti-establishment"],"phonetic":"/ˌænti ədˌmɪnəˈstreɪʃən/","extraExplanation":["这个词在新闻与政治评论中更常见的写法是加连字符：anti-administration。也常用作名词性用法（如“the anti-administration”指“反对派/反对政府的人或力量”），但核心意思是“反对某一届政府（the administration）”。","administration 在美式英语里常特指“某位总统/州长/市长任内的政府班子与政策团队”，因此 antiadministration 往往是“反对某一届当政团队”，不一定等同于“反政府（anti-government）”这种更广泛、更激烈的立场。"]}
{"word":"antiadrenergic","summary":{"en":"Antiadrenergic means “blocking or reducing the effects of adrenaline-related (adrenergic) activity,” often describing certain drugs.","zh":"antiadrenergic 指“阻断或减弱肾上腺素相关（肾上腺素能）作用的”，常用于描述某些药物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Reducing or blocking the effects of adrenergic nerves or hormones (especially adrenaline/epinephrine and noradrenaline/norepinephrine).","zh":"（医学）减弱或阻断肾上腺素能神经或激素（尤其是肾上腺素/epinephrine 与去甲肾上腺素/norepinephrine）作用的。"},"examples":[{"en":"Beta blockers have antiadrenergic effects that can slow the heart rate.","zh":"β受体阻滞剂具有抗肾上腺素能作用，可减慢心率。"},{"en":"The doctor chose an antiadrenergic drug to help control high blood pressure.","zh":"医生选择了抗肾上腺素能药物来帮助控制高血压。"}]},{"partOfSpeech":"n.","definition":{"en":"An antiadrenergic drug or agent (a medicine that blocks adrenergic activity).","zh":"抗肾上腺素能药物；抗肾上腺素能作用的制剂（阻断肾上腺素能活动的药物）。"},"examples":[{"en":"This antiadrenergic is sometimes used to treat tremor.","zh":"这种抗肾上腺素能药物有时用于治疗震颤。"}]}],"synonyms":["adrenergic antagonist","sympatholytic","anti-sympathetic (less common)"],"phonetic":"/ˌæn.taɪ.ədˈrɛn.ɚ.dʒɪk/","extraExplanation":["“anti-”表示“反、抗”；“adrenergic”指“肾上腺素能的”，与交感神经系统的“战或逃（fight-or-flight）”反应相关。","常见的抗肾上腺素能药物包括β受体阻滞剂（beta blockers）和某些α受体阻滞剂（alpha blockers），常用于高血压、心律失常、焦虑引起的心悸、偏头痛预防等。具体用药需遵医嘱。"]}
{"word":"antiae","summary":{"en":"Antiae is a classical (Latin/Roman) term linked to Antium (modern Anzio), used in historical/literary contexts meaning “of/from Antium.”","zh":"Antiae 是古典（拉丁/罗马）用语，和安提乌姆（今安齐奥）相关，多用于历史/文学语境，含义类似“属于/来自安提乌姆”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an ancient Latin/Roman name associated with Antium (modern Anzio, Italy); used especially in historical or literary contexts, sometimes as a place-name or as an epithet meaning “of Antium.”","zh":"与古拉丁/古罗马的“安提乌姆”（Antium，今意大利安齐奥 Anzio）相关的名称；多见于历史或文学语境，可指地名，或作“来自/属于安提乌姆”的称号（类似形容词用法）。"},"examples":[{"en":"Some Roman texts mention Antiae in connection with the coastal town of Antium.","zh":"一些罗马文献会在提到海滨城镇安提乌姆时出现 Antiae 这个名称。"},{"en":"In literature, “Venus Antiae” can mean Venus worshiped at Antium.","zh":"在文学中，“Venus Antiae”可指在安提乌姆受崇拜的维纳斯。"}]}],"synonyms":["Antium","Anzio"],"phonetic":"/ˈæn.ti.aɪ/","extraExplanation":["“Antiae”更常见于古典学/拉丁语相关材料，而不是现代日常英语。它可能作为地名的古称形式出现，也可能出现在宗教与神话语境里（如某位神祇的地域性称号）。","如果你原本想查的是英语前缀“anti-”（表示“反对/相反”）或别的拼写（如“Anzio/Antium/antie”），告诉我上下文句子，我可以帮你定位正确词条。"]}
{"word":"antiaesthetic","summary":{"en":"Antiaesthetic means rejecting or deliberately avoiding traditional ideas of beauty, often as an artistic or cultural choice.","zh":"Antiaesthetic 指反对或刻意回避传统审美标准的，常见于艺术、建筑与文化评论语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to, rejecting, or deliberately avoiding traditional ideas of beauty or artistic taste.","zh":"反美学的；反对或刻意回避传统“美”的标准或审美趣味的。"},"examples":[{"en":"The designer chose an antiaesthetic style, using raw concrete and exposed pipes.","zh":"这位设计师选择了反美学风格，使用裸露的混凝土和外露的管道。"},{"en":"Some punk album covers are intentionally antiaesthetic to challenge mainstream taste.","zh":"一些朋克专辑封面故意做得“反美学”，用来挑战主流审美。"}]},{"partOfSpeech":"adj.","definition":{"en":"Showing an unpleasant or unattractive appearance; very unattractive in a way that seems intentional or principled.","zh":"（外观）不讨喜的、缺乏美感的；有时带有“刻意如此”的意味。"},"examples":[{"en":"He described the room as antiaesthetic, but it felt honest and functional.","zh":"他形容这个房间很“反美学”，但它让人觉得诚实又实用。"},{"en":"The film’s antiaesthetic lighting makes the story feel harsher and more real.","zh":"这部电影的反美学打光让故事显得更残酷、更真实。"}]}],"synonyms":["anti-aesthetic","antiartistic","anti-beauty (informal)","deliberately ugly (informal)"],"phonetic":"/ˌænti.iːsˈθɛtɪk/","extraExplanation":["“antiaesthetic”常用于艺术评论、建筑、时尚与文化研究语境，强调一种“反精致、反装饰、反漂亮”的立场：不是单纯“不好看”，而是用不迎合的形式表达态度（如反消费主义、反传统权威）。","与“unaesthetic”不同：unaesthetic更偏“缺乏美感/不美”，而“antiaesthetic”更偏“反对美学标准/刻意反美”。"]}
{"word":"antiageing","summary":{"en":"Anti-ageing means intended to reduce or delay signs of aging (especially in skincare); also used as a noun for anti-ageing products or treatments.","zh":"anti-ageing 指“抗老/延缓老化（尤指护肤）”；也可作名词，指抗老产品或护理。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to reduce or delay the visible effects of aging, especially on the skin.","zh":"抗老的；延缓（皮肤等）老化迹象的（尤指护肤品/护理）。"},"examples":[{"en":"She uses an anti-ageing cream at night.","zh":"她晚上会用抗老面霜。"},{"en":"The clinic offers anti-ageing treatments.","zh":"这家诊所提供抗老护理/疗程。"}]},{"partOfSpeech":"n.","definition":{"en":"A type of product or treatment intended to reduce signs of aging.","zh":"抗老产品；抗老护理（统称）。"},"examples":[{"en":"This brand is known for its anti-ageing.","zh":"这个品牌以抗老系列闻名。"},{"en":"I’m comparing different anti-ageing options.","zh":"我在比较不同的抗老方案/选择。"}]}],"synonyms":["anti-aging","age-defying","anti-wrinkle"],"phonetic":"/ˌæn.tiˈeɪ.dʒɪŋ/","extraExplanation":["拼写与地区差异：anti-ageing 常见于英式英语；美式更常写作 anti-aging。两者意思相同。","常见搭配：anti-ageing cream/serum/treatment/routine（抗老面霜/精华/护理/流程）。","语境提示：在广告语里常和“reduce wrinkles / firm skin / improve elasticity（淡化皱纹/紧致/提升弹性）”一起出现。"]}
{"word":"antiager","summary":{"en":"“Antiager” usually means an anti-aging product or treatment; less commonly, it can mean a person who tries to stay youthful.","zh":"“antiager”通常指抗老/抗衰老产品或护理；较少情况下也可指努力保持年轻状态的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a product, treatment, or ingredient that is intended to slow, reduce, or hide signs of aging (especially in skincare).","zh":"抗老产品／抗衰老护理（指用来减缓、减少或遮盖衰老迹象的产品、疗程或成分，尤指护肤）。"},"examples":[{"en":"She bought an antiager to reduce fine lines around her eyes.","zh":"她买了一款抗老产品来淡化眼周细纹。"},{"en":"This cream is marketed as an antiager, but results vary from person to person.","zh":"这款面霜被宣传为抗老产品，但效果因人而异。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who tries to look or stay young by using anti-aging habits or products.","zh":"抗老人士／抗衰老者（指通过习惯或产品努力保持年轻外貌的人）。"},"examples":[{"en":"He’s a dedicated antiager—sunscreen, sleep, and a simple routine every day.","zh":"他是个很自律的抗老人：每天防晒、睡眠充足、护肤步骤也很简单。"}]}],"synonyms":["anti-aging product","anti-aging cream","age-defying product","anti-wrinkle product"],"phonetic":"/ˌæn.taɪˈeɪ.dʒɚ/","extraExplanation":["“antiager”在日常英语里不算最常见写法，更常见的是 **anti-aging**（形容词：抗老的）或 **anti-aging product/cream**（名词短语：抗老产品/面霜）。写作时用连字符 **anti-ager** 也很常见，语气更自然。","在广告与美妆语境中常见搭配：anti-aging serum（抗老精华）、anti-wrinkle（抗皱）、firming（紧致）、age-defying（逆龄/抗老）。"]}
{"word":"antiagglutinant","summary":{"en":"An antiagglutinant is a substance used to prevent cells or particles—especially red blood cells—from clumping together.","zh":"antiagglutinant 指用于防止细胞或颗粒（尤指红细胞）发生凝集结块的物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance that prevents agglutination (the clumping together of cells or particles, especially red blood cells)","zh":"抗凝集剂；防止（细胞或颗粒，尤指红细胞）发生凝集、结块的物质"},"examples":[{"en":"In the lab, an antiagglutinant can keep red blood cells from clumping during testing.","zh":"在实验室里，抗凝集剂可以在检测过程中防止红细胞结块。"},{"en":"The technician added an antiagglutinant to improve the accuracy of the blood sample results.","zh":"技术员加入抗凝集剂，以提高血样结果的准确性。"}]}],"synonyms":["agglutination inhibitor","anti-clumping agent"],"phonetic":"/ˌæn.ti.əˈɡluː.tə.nənt/","extraExplanation":["这个词多见于医学检验、免疫学与血液学语境。所谓“凝集（agglutination）”常由抗体与抗原反应引起，导致红细胞或细菌等颗粒聚集；抗凝集剂用于抑制这种聚集，帮助样本保持分散状态，便于观察与测量。","注意不要把 antiagglutinant 和 anticoagulant（抗凝血剂，防止血液凝固）混为一谈：凝集是“颗粒/细胞因免疫反应而聚集”，凝固是“血液形成凝块”。两者在实验中可能都出现，但机制不同。"]}
{"word":"antiagglutinating","summary":{"en":"Antiagglutinating means preventing cells or particles (especially red blood cells) from clumping together.","zh":"antiagglutinating 指“抗凝集的”，即防止细胞或颗粒（尤指红细胞）结团。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Preventing agglutination (the clumping together of cells or particles, especially red blood cells), usually in a medical or laboratory context.","zh":"（多用于医学或实验室语境）抗凝集的；防止（细胞或颗粒，尤其是红细胞）发生凝集（聚集成团）的。"},"examples":[{"en":"The lab added an antiagglutinating agent to keep the red blood cells from clumping.","zh":"实验室加入了抗凝集剂，以防止红细胞结团。"},{"en":"Antiagglutinating antibodies can interfere with some blood-typing tests.","zh":"抗凝集抗体可能会干扰某些血型鉴定测试。"}]}],"synonyms":["anti-clumping","agglutination-inhibiting","nonagglutinating"],"phonetic":"/ˌæn.ti.əˈɡluː.tə.neɪ.tɪŋ/","extraExplanation":["“agglutination”在生物医学里常指红细胞等在抗体或化学物质作用下发生“凝集/结团”。“anti-”表示“反对/抑制”，因此 antiagglutinating 通常用于描述能抑制这种结团现象的物质（如试剂、药物成分）或作用。","这个词偏专业，日常英语里更常见的表达是 “prevent clumping / prevent agglutination”（防止结团/凝集）。"]}
{"word":"antiagglutination","summary":{"en":"Antiagglutination means preventing or inhibiting cell clumping (agglutination), mainly in immunology and lab testing.","zh":"Antiagglutination 指抑制或防止细胞凝集（结团）的作用，主要用于免疫学与实验室检测语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Immunology/biology) The prevention or inhibition of agglutination (clumping), especially of cells like red blood cells or bacteria, often due to antibodies or chemical agents.","zh":"（免疫学/生物学）抗凝集作用；指防止或抑制凝集（结团/聚集），尤其是红细胞或细菌等细胞的凝集，常与抗体或化学试剂有关。"},"examples":[{"en":"In the lab, we added a reagent that showed antiagglutination, so the red blood cells did not clump.","zh":"在实验室里，我们加入了一种具有抗凝集作用的试剂，所以红细胞没有结团。"},{"en":"Antiagglutination can interfere with some blood-typing tests if conditions are not controlled.","zh":"如果条件控制不当，抗凝集作用可能会干扰某些血型鉴定测试。"}]}],"synonyms":["inhibition of agglutination","anti-clumping effect","agglutination inhibition"],"phonetic":"/ˌæn.ti.əˌɡluː.təˈneɪ.ʃən/","extraExplanation":["这个词非常专业，常见于血清学（serology）和输血检验。与之相对的是 agglutination（凝集反应），例如用抗体让红细胞出现“结团”来判断血型；而 antiagglutination 描述的是让这种结团不发生或减弱的现象。","词形可拆解理解：anti-（反、抗）+ agglutination（凝集、结团）。因此它不是日常英语词汇，更多出现在科研论文、检验报告或专业教材中。"]}
{"word":"antiagglutinative","summary":{"en":"Antiagglutinative means ‘preventing clumping (agglutination),’ most often in medical/lab use; less commonly, it can mean ‘not agglutinative’ in linguistics.","zh":"antiagglutinative 指“抗凝集的/阻止结团的”，多用于医学与实验室语境；较少见地也可指语言学里的“非黏着（构词）型”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposing or preventing agglutination (the clumping together of cells or particles), especially in medical or laboratory contexts","zh":"抗凝集的；阻止凝集的（凝集指细胞或颗粒黏在一起成团），常用于医学或实验室语境"},"examples":[{"en":"The lab added an antiagglutinative agent to prevent the red blood cells from clumping.","zh":"实验室加入了抗凝集剂，以防止红细胞发生凝集成团。"},{"en":"Antiagglutinative properties can be important when preparing blood samples for testing.","zh":"在制备血液样本用于检测时，抗凝集特性可能很重要。"}]},{"partOfSpeech":"adj.","definition":{"en":"not agglutinative; tending not to form words by adding many clear-cut affixes (used in linguistics, less common)","zh":"（语言学，较少见）非黏着（屈折/黏着）型的；不倾向通过不断叠加清晰的词缀来构词"},"examples":[{"en":"Some writers describe certain languages as relatively antiagglutinative compared with strongly agglutinative ones like Turkish.","zh":"有些作者会说某些语言相对“反黏着”，与土耳其语这类强黏着语相比不那么依赖词缀串联。"}]}],"synonyms":["anti-agglutinating","anti-clumping","non-agglutinative (linguistics)"],"phonetic":"/ˌæn.ti.əˈɡluː.təˌneɪ.tɪv/","extraExplanation":["这个词由 anti-（反、抗）+ agglutinative（黏着的/凝集的）构成。医学里 agglutination 常指红细胞、细菌或乳胶颗粒在抗体等作用下“结团”；因此 antiagglutinative 多出现在检验、免疫学或样本处理的描述中。","语言学里的“黏着语（agglutinative language）”指用一串词缀把语法信息一个个“粘”到词根上（如土耳其语、日语在某些分析里常被提及）。antiagglutinative 在这层意思上很少用，更常见的说法是 non-agglutinative 或 analytic（分析型）等。"]}
{"word":"antiagglutinin","summary":{"en":"An antiagglutinin is a substance (often an antibody) that blocks or neutralizes an agglutinin, preventing cell clumping.","zh":"antiagglutinin 指能阻断或中和凝集素、从而防止细胞（常为红细胞）凝集的物质（通常为抗体）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An antibody or substance that neutralizes an agglutinin (something that causes cells, especially red blood cells, to clump together).","zh":"抗凝集素；一种抗体或物质，可中和“凝集素”（使细胞，尤其是红细胞，发生凝集/聚集的物质）。"},"examples":[{"en":"In some lab tests, an antiagglutinin is used to prevent unwanted clumping of red blood cells.","zh":"在一些实验室检测中，会使用抗凝集素来防止红细胞出现不需要的凝集。"},{"en":"The presence of an antiagglutinin can interfere with agglutination-based diagnostic results.","zh":"抗凝集素的存在可能会干扰基于凝集反应的诊断结果。"}]}],"synonyms":["anti-agglutinin","agglutinin inhibitor"],"phonetic":"/ˌæn.ti.əˈɡluː.tə.nɪn/","extraExplanation":["该词多见于免疫学与血清学语境，常与“凝集反应（agglutination）”“血型鉴定（blood typing）”“抗体（antibody）”等概念一起出现。它不是日常英语词汇，通常出现在科研论文、检验报告或专业教材中。","构词提示：anti-（反、抗）+ agglutinin（凝集素）→ antiagglutinin（抗凝集素）。与“agglutination（凝集）”同词根。"]}
{"word":"antiaggression","summary":{"en":"Antiaggression means opposing aggression (especially military invasion) or the policy/movement to prevent it.","zh":"antiaggression 指“反侵略的”，或指防止侵略的政策/主张/运动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposing aggression, especially military attack or violent force (often used to describe policies, alliances, or actions).","zh":"反侵略的；反对侵略或暴力攻击的（常用于政策、联盟或行动）。"},"examples":[{"en":"The countries formed an antiaggression pact to discourage invasion.","zh":"这些国家签署了反侵略条约，以阻止入侵。"},{"en":"The speech called for antiaggression measures to protect civilians.","zh":"这次演讲呼吁采取反侵略措施来保护平民。"}]},{"partOfSpeech":"n.","definition":{"en":"The idea, policy, or movement that aims to resist or prevent aggression.","zh":"反侵略的理念、政策或运动；抵制或防止侵略的主张。"},"examples":[{"en":"Antiaggression became a central theme in the group’s foreign policy.","zh":"反侵略成为该团体外交政策的核心主题。"},{"en":"They organized public talks promoting antiaggression and peaceful cooperation.","zh":"他们组织了公开讲座，宣传反侵略与和平合作。"}]}],"synonyms":["anti-aggression","nonaggression","defensive","anti-invasion"],"phonetic":"/ˌæn.ti.əˈɡrɛʃ.ən/","extraExplanation":["“antiaggression”由前缀 anti-（反对）+ aggression（侵略/攻击）构成。英语中更常见的写法是加连字符的 “anti-aggression”，尤其在新闻、外交与法律语境里（如 anti-aggression pact/coalition/measures）。","语境差异：在国际关系中 aggression 往往指“军事侵略”；在日常人际关系中更常用 “anti-violence（反暴力）/anti-bullying（反霸凌）/nonaggression（互不侵犯）” 来表达类似但更自然的含义。"]}
{"word":"antiaggressionist","summary":{"en":"Antiaggressionist means opposing aggression (especially military aggression), or a person who holds that view.","zh":"antiaggressionist 指反对（尤其是军事）侵略的（人）或持这种立场的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposes aggression (especially military attack or expansion) and supports resisting or preventing aggressive actions","zh":"反对侵略者；反对（尤其是军事）侵略行为的人；主张防止或抵制侵略的人"},"examples":[{"en":"During the war debate, he spoke as an antiaggressionist, arguing that nations should not invade their neighbors.","zh":"在战争辩论中，他以反侵略者的立场发言，认为国家不应入侵邻国。"},{"en":"Many antiaggressionists supported international agreements to stop acts of aggression.","zh":"许多反侵略者支持通过国际协定来制止侵略行为。"}]},{"partOfSpeech":"adj.","definition":{"en":"opposing aggression; supporting policies meant to prevent or resist aggressive acts","zh":"反侵略的；反对侵略行为的；主张防止或抵制侵略的"},"examples":[{"en":"The group published an antiaggressionist statement calling for collective security.","zh":"该组织发表了一份反侵略声明，呼吁集体安全。"},{"en":"Her antiaggressionist views shaped how she talked about foreign policy.","zh":"她的反侵略观点影响了她谈论外交政策的方式。"}]}],"synonyms":["anti-aggression","anti-war (context-dependent)","pacifist (not identical)","opponent of aggression","non-aggression advocate"],"phonetic":"/ˌæntiəˈɡrɛʃənɪst/","extraExplanation":["这个词在现代日常英语里非常少见，更常见的表达是 anti-aggression（反侵略）、anti-war（反战）、pacifist（和平主义者），或用 oppose aggression / resist aggression 这样的动词短语。","antiaggressionist 常出现在政治、历史或国际关系讨论中，强调“反对侵略行为（aggression）”，不一定等同于“绝对反战”（pacifism），因为它也可能支持对侵略的防卫或集体安全。"]}
{"word":"antiaggressive","summary":{"en":"Anti-aggressive means against aggression and aimed at reducing aggressive behavior or actions.","zh":"Anti-aggressive 指反对攻击性/侵略性，并以减少攻击性行为或行动为目标。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to aggression; intended to reduce, prevent, or respond to aggressive behavior or policies.","zh":"反对侵略或攻击性的；旨在减少、预防或应对攻击性行为或政策的。"},"examples":[{"en":"The school adopted an anti-aggressive policy to reduce bullying.","zh":"学校采用了反攻击性的政策来减少霸凌。"},{"en":"Some trainers teach anti-aggressive techniques for handling conflicts calmly.","zh":"一些培训师教授反攻击性的技巧，以冷静处理冲突。"}]}],"synonyms":["nonaggressive","peaceful","de-escalatory","anti-violent"],"phonetic":"/ˌæntiəˈɡrɛsɪv/","extraExplanation":["“antiaggressive”更常见的写法是带连字符的“anti-aggressive”。在正式写作中，连字符通常更清晰，尤其当前缀 anti- 修饰形容词时。","这个词多用于教育（反霸凌）、心理与行为训练（冲突降温/去激化）、以及政治与国际关系语境（反侵略、反军事挑衅）。"]}
{"word":"antiaggressively","summary":{"en":"Antiaggressively means doing something without aggression, or in a way that actively discourages aggression.","zh":"antiaggressively 指“非攻击性地”，也可指“以反对/降低攻击性的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a non-aggressive way; without hostility, threats, or force.","zh":"以非攻击性的方式；不带敌意、威胁或强迫。"},"examples":[{"en":"She responded antiaggressively, keeping her voice calm even when criticized.","zh":"即使被批评，她也以非攻击性的方式回应，语气始终很平静。"},{"en":"The coach asked the team to play hard but antiaggressively—no dirty fouls.","zh":"教练要求球队拼得很凶但要非攻击性——不要恶意犯规。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that opposes or reduces aggression (especially in behavior, language, or policy).","zh":"以反对或降低攻击性的方式（尤指行为、语言或政策）。"},"examples":[{"en":"The program teaches teens to handle conflict antiaggressively.","zh":"这个项目教青少年以反攻击性的方式处理冲突。"},{"en":"The company rewrote its guidelines to communicate more antiaggressively with customers.","zh":"公司重写了指南，要求与客户沟通更“反攻击性”、更温和。"}]}],"synonyms":["non-aggressively","peacefully","calmly","without hostility","in a nonthreatening way"],"phonetic":"/ˌæntiəˈɡrɛsɪvli/","extraExplanation":["“anti-”是前缀，表示“反对/对抗/防止”，加在“aggressively（带攻击性地）”前面就形成“antiaggressively”。这个词在日常英语中不算常见，更常用的表达是“non-aggressively（非攻击性地）”“calmly（冷静地）”“without hostility（不带敌意地）”。在心理学、冲突管理或某些写作语境中，作者可能会用“antiaggressively”来强调“主动降低攻击性/反对攻击性”，语气比单纯的“non-aggressively”更强一点。"]}
{"word":"antiaggressiveness","summary":{"en":"Antiaggressiveness means a non-aggressive attitude or policy—avoiding hostility or the use of force.","zh":"Antiaggressiveness 指不具攻击性或反侵略的态度/政策，强调避免敌意与使用武力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or policy of not being aggressive; an attitude that avoids hostility, threats, or force","zh":"反侵略性；不具攻击性（指避免敌意、威胁或使用武力的态度或政策）"},"examples":[{"en":"The country promoted antiaggressiveness in its foreign policy and emphasized negotiation.","zh":"该国在外交政策上强调反侵略性，主张通过谈判解决问题。"},{"en":"In the classroom, the teacher encouraged antiaggressiveness and respectful discussion.","zh":"在课堂上，老师鼓励不具攻击性的态度和彼此尊重的讨论。"},{"en":"His antiaggressiveness made him a calming presence during conflicts.","zh":"他不具攻击性的性格让他在冲突中显得很能安抚人心。"}]}],"synonyms":["nonaggression","peacefulness","restraint","nonviolence","conciliatory stance"],"phonetic":"/ˌæn.ti.əˈɡrɛsɪvnəs/","extraExplanation":["“antiaggressiveness”不是很常见的标准词，更常见的写法有“anti-aggressiveness”，或用更自然的表达如“non-aggression”“nonaggression”“peacefulness”“nonviolent stance”。在国际关系语境里，“non-aggression”尤其常见（如“non-aggression pact”互不侵犯条约）。"]}
{"word":"antiaging","summary":{"en":"Antiaging means meant to slow or reduce the visible effects of aging, especially in skincare; it can also refer to antiaging products or treatments as a category.","zh":"Antiaging 指旨在减缓或减少衰老可见迹象（尤指皮肤）的；也可泛指抗衰老产品或疗程这一类。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of products, treatments, or habits) intended to slow, reduce, or hide the visible effects of getting older, especially on the skin.","zh":"（指产品、疗程或生活习惯）旨在减缓、减少或掩盖衰老的可见迹象，尤指皮肤老化。"},"examples":[{"en":"She started using an antiaging cream to reduce fine lines.","zh":"她开始用抗衰老面霜来淡化细纹。"},{"en":"Regular sunscreen is one of the simplest antiaging habits.","zh":"规律使用防晒是最简单的抗衰老习惯之一。"}]},{"partOfSpeech":"n.","definition":{"en":"A general term for products or treatments marketed to slow or reduce signs of aging.","zh":"抗衰老产品或疗程的统称（常用于营销语境）。"},"examples":[{"en":"The clinic offers a range of antiaging services.","zh":"这家诊所提供一系列抗衰老服务。"},{"en":"Antiaging is a big trend in the beauty industry.","zh":"抗衰老是美容行业的一大趋势。"}]}],"synonyms":["anti-aging","age-defying","anti-wrinkle","youthful-looking"],"phonetic":"/ˌæntiˈeɪdʒɪŋ/","extraExplanation":["在英语里更常见的写法是带连字符的 anti-aging；也常见写作 antiaging（尤其在广告、产品标签或公司命名中）。","语域提示：anti-aging/antiaging 常用于护肤与医美营销；在医学或科普讨论中，也会用 healthy aging（健康老龄化）、age-related changes（与年龄相关的变化）等更中性表达。","相关搭配：antiaging cream/serum（抗衰老面霜/精华）、antiaging treatment（抗衰老疗程）、antiaging skincare routine（抗衰老护肤步骤）。"]}
{"word":"antiaircraft","summary":{"en":"Antiaircraft means “for defending against enemy aircraft,” or the weapons/units used to do that.","zh":"“Antiaircraft”指“防空的”，也可指“防空武器/防空部队”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to weapons, systems, or actions used to defend against enemy aircraft (including planes, helicopters, or missiles).","zh":"与防空有关的；用于对付敌方飞机（也可包括直升机或导弹）的。"},"examples":[{"en":"The base installed new antiaircraft radar.","zh":"基地安装了新的防空雷达。"},{"en":"Antiaircraft guns were positioned along the coastline.","zh":"海岸线沿线部署了防空炮。"}]},{"partOfSpeech":"n.","definition":{"en":"Weapons or military units designed to shoot down or stop enemy aircraft.","zh":"防空武器；防空部队（用于击落或阻止敌方飞机）。"},"examples":[{"en":"The ship carried antiaircraft to protect the fleet.","zh":"这艘军舰配备了防空武器来保护舰队。"},{"en":"They called in antiaircraft when the air raid began.","zh":"空袭开始时，他们呼叫了防空部队支援。"}]}],"synonyms":["anti-aircraft","AA (abbr.)","air-defense (often used more broadly)"],"phonetic":"/ˌæn.tiˈɛr.kræft/","extraExplanation":["“antiaircraft”常缩写为“AA”，在军事新闻或游戏里很常见，如“AA guns”（防空炮），“AA missile”（防空导弹）。","拼写上也常见带连字符的形式“anti-aircraft”，两者意思相同；英式英语里“anti-aircraft”更常见一些。","相关常用搭配：antiaircraft fire（防空火力）、antiaircraft defense（防空防御/防空体系）、antiaircraft artillery（防空炮兵）。"]}
{"word":"antialbumid","summary":{"en":"Antialbumid is a rare scientific term meaning an anti-albumin substance, especially an antibody/antiserum against albumin.","zh":"antialbumid 是罕见的科学用语，指“抗白蛋白”的物质，尤指针对白蛋白的抗体/抗血清。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(very rare/technical) A substance—especially an antibody or antiserum—directed against albumin (sometimes called “albumid” in older scientific writing).","zh":"（非常罕见／技术用语）指针对白蛋白（albumin；旧式文献有时称 albumid）的物质，尤指抗体或抗血清。"},"examples":[{"en":"The lab raised antialbumid antibodies to test whether the protein sample contained albumin.","zh":"实验室制备了抗白蛋白（antialbumid）抗体，用来检测蛋白样本是否含有白蛋白。"},{"en":"In older papers, antialbumid serum was used to identify albumin by immune reaction.","zh":"在较早的论文中，会用抗白蛋白血清通过免疫反应来鉴定胆白蛋白。"}]}],"synonyms":["anti-albumin","antialbumin"],"phonetic":"/ˌæn.ti.ælˈbjuː.mɪd/","extraExplanation":["这个词在现代英语里几乎不使用，更多见于早期/旧式生物化学或免疫学语境。现在更常见、更规范的说法通常是 anti-albumin（抗白蛋白的）。","拼写上也可能是你想查 anti-albumin / antialbumin；如果你能提供原句或出处，我可以帮你确认具体指哪一种物质（抗体、抗血清，或其他“抗某蛋白”的制剂）。"]}
{"word":"antialbumin","summary":{"en":"Antialbumin means an antibody against albumin.","zh":"Antialbumin 指“抗白蛋白抗体”，即针对白蛋白的抗体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an antibody that reacts against albumin (a major blood protein); also used more generally for something that opposes or neutralizes albumin in a biological or laboratory context.","zh":"抗白蛋白抗体；（更广义）在生物或实验环境中对抗、结合或中和白蛋白（血液中的主要蛋白质）的一类物质。"},"examples":[{"en":"The lab tested the serum for antialbumin to check for antibodies against albumin.","zh":"实验室检测血清中的 antialbumin，以确认是否存在针对白蛋白的抗体。"},{"en":"Antialbumin antibodies can interfere with some immunoassays that use albumin-based reagents.","zh":"抗白蛋白抗体可能会干扰一些使用白蛋白相关试剂的免疫检测。"}]}],"synonyms":["anti-albumin antibody","albumin antibody","anti-albumin"],"phonetic":"/ˌæn.tiˈæl.bjə.mɪn/","extraExplanation":["这是一个偏医学/免疫学的罕见词，常见写法也包括连字符形式 anti-albumin。词形由 anti-（“抗、反对”）+ albumin（“白蛋白”）组成，整体意思通常指“针对白蛋白的抗体”。在临床或检验语境中，是否有实际意义取决于具体疾病、检测方法与报告标准。"]}
{"word":"antialbumose","summary":{"en":"A rare, historical biochemistry term for an albumose believed to resist further enzymatic digestion.","zh":"一个少见的旧式生物化学术语，指过去认为不易被消化酶进一步分解的白蛋白胨成分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biochemistry, historical) A type of albumose (a protein digestion product) thought to resist further breakdown by digestive enzymes.","zh":"（生物化学／旧术语）一种“白蛋白胨”（蛋白质消化产物）成分，过去认为它能抵抗消化酶进一步分解。"},"examples":[{"en":"Early physiology texts sometimes mention antialbumose as a resistant product of protein digestion.","zh":"早期的生理学教材有时会把 antialbumose 说成是蛋白质消化过程中较“耐消化”的产物。"},{"en":"The term antialbumose is rarely used in modern biochemistry.","zh":"antialbumose 这个词在现代生物化学里很少使用。"}]}],"synonyms":["(no common modern synonym)","related: albumose","related: peptone","related: proteose"],"phonetic":"/ˌæn.tiˌælˈbjuː.moʊs/","extraExplanation":["这是较早期的蛋白质化学术语：过去会把蛋白质被胃蛋白酶等消化后的中间产物分成不同“albumose/peptone（白蛋白胨／蛋白胨）”类别。随着蛋白质与肽的结构分析方法进步，这类旧分类和名词在现代文献中多被更精确的“peptides（肽）”“protein fragments（蛋白片段）”等说法取代。","词形上 anti- 常见义为“反／抗”，在这里更多体现“抗进一步消化、较难再分解”的旧式理解，而不是现代免疫学里“抗体”那种“抗”。"]}
{"word":"antialcoholic","summary":{"en":"“Antialcoholic” means opposed to drinking alcohol or promoting abstinence.","zh":"“antialcoholic”表示反对饮酒或主张戒酒的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to drinking alcohol; promoting abstinence from alcohol (often used in public health, education, or social movements).","zh":"反对饮酒的；主张戒酒的（常用于公共卫生、教育或社会运动语境）。"},"examples":[{"en":"The school runs an antialcoholic campaign during prom season.","zh":"学校在舞会季会开展反对饮酒（倡导不饮酒）的宣传活动。"},{"en":"Some antialcoholic groups push for stricter rules on alcohol advertising.","zh":"一些反对饮酒的团体推动对酒类广告实行更严格的规定。"},{"en":"He chose an antialcoholic lifestyle after seeing how addiction harmed his family.","zh":"看到成瘾如何伤害家人后，他选择了戒酒、不饮酒的生活方式。"}]}],"synonyms":["anti-alcohol","anti-drinking","anti-alcoholism","temperance (related)"],"phonetic":"/ˌæntiˌæl.kəˈhɑl.ɪk/","extraExplanation":["这个词更常见的写法是 **anti-alcohol**（反对酒精/饮酒的）或 **anti-alcoholism**（反酗酒的）；**antialcoholic** 属于较少见、偏正式的用法，有时也会写成 **anti-alcoholic**（带连字符）。在日常表达里，更自然的说法常是 **against drinking**（反对饮酒）或 **alcohol-free**（不含酒精的/无酒精的，注意含义不同）。"]}
{"word":"antialcoholism","summary":{"en":"Antialcoholism means opposition to alcohol use, often as a belief, policy, or social movement.","zh":"Antialcoholism 指反对酒精使用的观念、政策或社会运动，常与戒酒/禁酒相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to drinking alcohol or to alcohol use in society; the belief or movement that promotes avoiding alcohol.","zh":"反对饮酒或反对社会中的酒精使用；提倡戒酒/禁酒的观念或运动。"},"examples":[{"en":"The school adopted an antialcoholism policy for student events.","zh":"学校为学生活动制定了反酗酒/禁酒政策。"},{"en":"Antialcoholism campaigns often focus on the health risks of heavy drinking.","zh":"反酗酒宣传常常强调大量饮酒的健康风险。"}]}],"synonyms":["temperance","anti-alcohol movement","alcohol abstinence","teetotalism"],"phonetic":"/ˌæn.tiˈæl.kəˌhɔˌlɪz.əm/","extraExplanation":["“antialcoholism”在现代英语中相对少见，更常见的表达是“anti-alcohol movement / anti-alcohol campaign / temperance (movement)”或“alcohol abstinence”。写作时也常见带连字符的形式“anti-alcoholism”。","历史语境中与19世纪至20世纪初的“Temperance Movement（禁酒/节酒运动）”有关；在美国文化史里，该运动与后来“Prohibition（禁酒令）”的社会背景有一定关联。"]}
{"word":"antialcoholist","summary":{"en":"An antialcoholist is someone who opposes alcohol or drinking alcohol, often supporting temperance or prohibition.","zh":"antialcoholist 指反对酒精或饮酒的人，常与禁酒/节酒立场相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who is opposed to alcohol or alcohol drinking, often someone who supports temperance (reducing or banning alcohol).","zh":"反对饮酒（或反对酒精）的⼈；常指支持禁酒或节酒（节制饮酒）的人。"},"examples":[{"en":"In the early 1900s, many antialcoholists campaigned for stricter alcohol laws.","zh":"在20世纪初，许多反对饮酒的人为更严格的酒类法律而奔走。"},{"en":"He became an antialcoholist after seeing how addiction hurt his family.","zh":"看到酒瘾如何伤害家人后，他成了一个反对饮酒的人。"}]}],"synonyms":["teetotaler","temperance advocate","abstainer","anti-alcohol campaigner"],"phonetic":"/ˌæn.tiˈæl.kə.hɑː.lɪst/","extraExplanation":["“antialcoholist”不是现代英语中最常见的词，更常见的表达是“teetotaler”（完全戒酒者）、“temperance advocate”（禁酒/节酒倡导者）或“anti-alcohol campaigner”（反酒精运动人士）。","在英语文化史中，19世纪到20世纪初的“Temperance Movement（禁酒/节酒运动）”影响很大，美国的“Prohibition（禁酒令时期，1920–1933）”常与这类人群的社会运动联系在一起。写作时用这些更常见的词会更自然。"]}
{"word":"antialdoxime","summary":{"en":"An antialdoxime is an aldoxime stereoisomer where –OH and the aldehydic hydrogen are on opposite sides of the C=N bond (often the E form).","zh":"antialdoxime 指醛肟的一种立体异构体：–OH 与醛碳上的氢位于 C=N 双键两侧相对（常对应 E 构型）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of aldoxime stereoisomer in which the hydroxyl group (–OH) is positioned opposite (anti) to the hydrogen on the carbon–nitrogen double bond; often corresponds to the E configuration.","zh":"一种“醛肟（aldoxime）”的立体异构体，其中羟基（–OH）在碳氮双键两侧与氢原子呈相对（anti）位置；通常对应 E 构型。"},"examples":[{"en":"In an antialdoxime, the –OH group lies on the opposite side of the C=N bond from the hydrogen.","zh":"在 antialdoxime 中，–OH 基团位于 C=N 双键的另一侧，与氢原子相对。"},{"en":"Chemists may separate syn- and antialdoximes because the two isomers can have different melting points.","zh":"化学家可能会分离 syn- 与 antialdoxime，因为这两种异构体的熔点可能不同。"}]}],"synonyms":["anti aldoxime","E-aldoxime"],"phonetic":"/ˌæntiˈældɑːksiːm/","extraExplanation":["“anti-”在这里不是“反对”的意思，而是立体化学用语，表示在双键（这里是 C=N）两侧“相对/相反侧”的空间排列。","醛肟（aldoxime）一般可写作 R–CH=NOH；当比较 H（在醛基碳上）与 –OH（在氮上）在 C=N 两侧的位置时，可分为 syn（同侧）与 anti（相对侧）。在较新的命名中常用 E/Z 表示，与 syn/anti 大致对应但需按 CIP 优先级规则判断。"]}
{"word":"antialexin","summary":{"en":"Antialexin is an older immunology term for an antibody that blocks complement (alexin).","zh":"Antialexin 是免疫学旧术语，指能阻断补体（旧称 alexin）的抗体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an antibody that neutralizes or blocks alexin (complement), reducing complement’s ability to lyse cells or help destroy microbes","zh":"抗补体素；一种能中和或阻断“alexin（补体）”作用的抗体，使补体较难溶解细胞或协助清除微生物"},"examples":[{"en":"In early immunology papers, researchers described antialexin as a substance that could stop complement from destroying red blood cells.","zh":"在早期免疫学论文中，研究者把 antialexin 描述为一种能阻止补体破坏红细胞的物质。"},{"en":"The serum contained antialexin activity, so complement-mediated lysis was weaker.","zh":"该血清具有抗补体素活性，因此补体介导的溶解作用更弱。"}]}],"synonyms":["anti-complement antibody","complement-inhibiting antibody"],"phonetic":"/ˌæn.ti.əˈlɛk.sɪn/","extraExplanation":["“Antialexin”是较早期的免疫学用语：alexin 是19世纪末对“补体（complement）”的旧称。现代文献更常用的表达是“anti-complement antibody（抗补体抗体）”或直接描述为“complement-inhibiting antibody（抑制补体的抗体）”。","词形拆解：anti-（反/抗）+ alexin（补体的旧称）。因此它并不是日常英语词汇，主要出现在历史性或专门的免疫学语境中。"]}
{"word":"antialien","summary":{"en":"Antialien means opposed to aliens—most often foreign nationals/non-citizens (immigrants) in politics or law—and it can also refer to a person or policy with that view.","zh":"antialien 指“反外侨/排外的”，多用于政治或法律语境中针对外国人、非公民（移民）；也可指持这种立场的人或政策。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to aliens, especially foreign nationals (non-citizens) in a country; showing hostility toward immigrants.","zh":"反外侨的；排外（尤指针对外国人、非公民/移民）的。"},"examples":[{"en":"The candidate used antialien rhetoric to win votes.","zh":"这位候选人用排外言论来争取选票。"},{"en":"Some antialien laws limited non-citizens’ right to own land.","zh":"一些反外侨法律限制非公民拥有土地的权利。"}]},{"partOfSpeech":"n.","definition":{"en":"a person, policy, or idea that is opposed to aliens (foreign nationals/immigrants).","zh":"反外侨者；反外侨政策/主张。"},"examples":[{"en":"Local antialiens organized protests against new migrant housing.","zh":"当地的反外侨人士组织抗议新建的移民住房。"},{"en":"The paper criticized antialiens for spreading fear.","zh":"这家报纸批评排外者散布恐惧。"}]}],"synonyms":["anti-immigrant","xenophobic","nativist","anti-foreigner"],"phonetic":"/ˌæntiˈeɪliən/","extraExplanation":["“alien”在英语里既可指“外星人”，也可指法律语境中的“外国人/非公民”。在“antialien”里，最常见的是后者（政治、法律与社会议题）。","拼写上常见带连字符的形式“anti-alien”，更清晰易读；不带连字符的“antialien”也能见到，但较少。","语体与敏感度：用于描述对移民/外国人的敌意时，往往带批评色彩；写作中可视需要改用更中性的表达，如“anti-immigrant（反移民的）”或“nativist（本土主义/排外的）”。"]}
{"word":"antialkali","summary":{"en":"Antialkali means something (or a substance) that counteracts or neutralizes alkali, reducing alkalinity.","zh":"antialkali 指“抗碱的/抗碱剂”，用于中和碱性、降低碱度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"counteracting or neutralizing alkali (basic) substances; used to reduce alkalinity.","zh":"抗碱的；中和碱性物质的；用于降低碱性。"},"examples":[{"en":"The lab used an antialkali solution to bring the mixture back to a neutral pH.","zh":"实验室使用了抗碱溶液，把混合物的酸碱度调回接近中性。"},{"en":"Some shampoos include antialkali ingredients to protect hair from high-alkaline damage.","zh":"有些洗发水含有抗碱成分，用来保护头发免受高碱性造成的伤害。"}]},{"partOfSpeech":"n.","definition":{"en":"a substance or agent that counteracts alkali; an alkalinity-neutralizing material.","zh":"抗碱剂；用于中和碱性的物质或制剂。"},"examples":[{"en":"Add the antialkali slowly and test the pH as you go.","zh":"慢慢加入抗碱剂，并在过程中检测酸碱度。"}]}],"synonyms":["acidifying","acidifying agent","pH reducer","neutralizer"],"phonetic":"/ˌæn.taɪˈæl.kə.laɪ/","extraExplanation":["“anti-”表示“反、抗”，而“alkali”指“碱/碱性物质”。因此 antialkali 字面意思就是“抗碱的/抗碱剂”。在实际英语中，这个词相对少见，更常见的表达是“acidifying agent（酸化剂）”“pH reducer（降pH剂）”或直接说“a substance that neutralizes alkali（中和碱性的物质）”。"]}
{"word":"antiamboceptor","summary":{"en":"A rare, historical immunology term meaning an antibody that blocks an amboceptor.","zh":"罕见的历史性免疫学术语：指能阻断（使失活）amboceptor 的抗体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An antibody (or similar immune substance) that neutralizes an amboceptor by binding to it and blocking its action.","zh":"一种抗体（或类似免疫物质），可与“amboceptor（溶血素/双结合体）”结合并抑制其作用，从而使其失活。"},"examples":[{"en":"In early immunology texts, an antiamboceptor was described as preventing hemolysis by inactivating the amboceptor.","zh":"在早期免疫学文献中，antiamboceptor 被描述为通过使 amboceptor 失活来阻止溶血。"},{"en":"The researcher suggested that antiamboceptor could interfere with complement-dependent reactions.","zh":"研究者认为 antiamboceptor 可能干扰补体依赖的反应。"}]}],"synonyms":["anti-amboceptor (variant spelling)","anti-antibody (rough modern paraphrase)"],"phonetic":"/ˌæn.tiˌæm.boʊˈsɛp.tɚ/","extraExplanation":["这个词多见于20世纪早期的免疫学（尤其是补体学说的发展阶段），属于历史性术语，现代教材与论文中较少使用。","“Amboceptor”是旧称，常对应今天更常说的“抗体/溶血素”等概念；因此“antiamboceptor”可以理解为“针对该类抗体的抗体”，即一种“抗抗体（anti-antibody）”的想法。","阅读旧文献时，可把它放到“补体（complement）参与的溶血反应”框架下理解：antiamboceptor通过阻断关键结合步骤，使后续补体介导的效应无法发生。"]}
{"word":"antiamoebic","summary":{"en":"Antiamoebic describes a drug or treatment that fights amoeba infections; it can also mean the drug itself.","zh":"antiamoebic 指“抗阿米巴（变形虫）感染的”，也可指“抗阿米巴药物”本身。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Used to treat or prevent infection by amoebas (especially amoebic dysentery).","zh":"用于治疗或预防阿米巴（变形虫）感染（尤其是阿米巴痢疾）的。"},"examples":[{"en":"Metronidazole is an antiamoebic drug often used to treat amoebiasis.","zh":"甲硝唑是一种常用于治疗阿米巴病的抗阿米巴药物。"},{"en":"The doctor prescribed antiamoebic medication after the stool test results.","zh":"粪便检查结果出来后，医生开了抗阿米巴药物。"}]},{"partOfSpeech":"n.","definition":{"en":"A medicine that treats infections caused by amoebas.","zh":"治疗阿米巴（变形虫）感染的药物；抗阿米巴药。"},"examples":[{"en":"This clinic keeps several antiamoebics in stock for travelers’ infections.","zh":"这家诊所备有几种抗阿米巴药，用于旅行者感染的治疗。"}]}],"synonyms":["antiamebic","amebicidal","antiprotozoal"],"phonetic":"/ˌæn.ti.əˈmiː.bɪk/","extraExplanation":["“antiamoebic”= anti-（抗、对抗）+ amoebic（阿米巴的）。英式拼法常见为“antiamoebic”，美式也常见“antiamebic”（省略 o）。","常见相关词：amoeba（阿米巴/变形虫），amoebiasis（阿米巴病），amoebic dysentery（阿米巴痢疾）。在医疗语境中多用于处方、药理或检验报告。"]}
{"word":"antiamusement","summary":{"en":"Antiamusement means opposition to entertainment or leisure activities.","zh":"Antiamusement 指反对娱乐或消遣活动的态度/思潮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to amusement or entertainment; the attitude or movement that considers amusements harmful, immoral, or a distraction from serious duties.","zh":"反娱乐；反对娱乐消遣的态度或思潮，认为娱乐有害、不道德，或会分散对正事的注意力。"},"examples":[{"en":"Some religious groups historically promoted an antiamusement stance, discouraging dancing and theater.","zh":"历史上一些宗教团体提倡反娱乐立场，劝人避免跳舞和看戏。"},{"en":"Her antiamusement comments made the party feel awkward and tense.","zh":"她那些反娱乐的评论让聚会气氛变得尴尬紧张。"}]}],"synonyms":["anti-entertainment","against amusements","puritanical attitude","moralistic opposition"],"phonetic":"/ˌæntiəˈmjuzmənt/","extraExplanation":["“antiamusement”不是常见标准词，更多是临时造词（nonce word）或学术/评论语境中的用法。它由前缀 anti-（反对）+ amusement（娱乐）构成。更常见的表达有：anti-entertainment（反娱乐/反娱乐业）、anti-recreation（反休闲）、against amusements（反对娱乐活动）。","在历史文化语境中，这类“反娱乐”态度常与某些宗教改革、道德运动或社会规训有关（例如反对剧院、舞会、赌博等）。"]}
{"word":"antiamylase","summary":{"en":"Antiamylase is a substance—often an antibody—that blocks or targets the enzyme amylase.","zh":"Antiamylase 指一种物质（常为抗体），用来抑制或特异性识别淀粉酶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance (often an antibody) that inhibits the enzyme amylase or reacts against it in tests","zh":"抗淀粉酶物质（常指抗体），可抑制淀粉酶的作用或在检测中与淀粉酶发生特异性反应"},"examples":[{"en":"The lab used antiamylase to detect amylase in the patient’s sample.","zh":"实验室使用抗淀粉酶来检测病人样本中的淀粉酶。"},{"en":"Adding antiamylase reduced amylase activity in the experiment.","zh":"在实验中加入抗淀粉酶降低了淀粉酶的活性。"}]}],"synonyms":["anti-amylase antibody","amylase inhibitor"],"phonetic":"/ˌæntiˈæməˌleɪs/","extraExplanation":["“antiamylase”多见于医学检验、免疫学或生化实验语境：\n1）若指“抗体”，通常用于检测/定位淀粉酶（如免疫测定、免疫染色）。\n2）若指“抑制剂”，则强调它会降低淀粉酶分解淀粉的能力。\n阅读论文时可通过搭配词判断：如“antiamylase antibody（抗淀粉酶抗体）”“amylase inhibitor（淀粉酶抑制剂）”。"]}
{"word":"antianaphylactogen","summary":{"en":"A rare, mostly historical medical term for a substance thought to prevent or counteract anaphylaxis.","zh":"一个罕见、偏历史的医学术语，指被认为可预防或对抗过敏性休克的物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A substance (often a serum or drug) that was believed to prevent or counteract anaphylaxis (a severe allergic reaction).","zh":"一种（常指血清或药物）被认为可预防或对抗过敏性休克（严重过敏反应）的物质。"},"examples":[{"en":"Early researchers tested various antianaphylactogens to reduce dangerous allergic reactions.","zh":"早期研究人员测试了多种“抗过敏性休克物质”，以降低危险的过敏反应。"},{"en":"The paper discussed an antianaphylactogen used before exposure to horse serum.","zh":"这篇论文讨论了一种在接触马血清前使用的抗过敏性休克物质。"}]}],"synonyms":["anti-anaphylactic agent","anaphylaxis inhibitor"],"phonetic":"/ˌæn.ti.əˌnæf.ɪlæk.təˈdʒɑː.dʒən/","extraExplanation":["这是一个较少见、偏历史性的医学术语，常出现在19世纪末到20世纪早期的免疫学文献中。现代临床更常用的是具体药物或措施的名称（如“epinephrine/肾上腺素”“antihistamine/抗组胺药”“desensitization/脱敏治疗”等），而不是用“antianaphylactogen”作为通用词。","词形构成：anti-（反、对抗）+ anaphylaxis（过敏性休克）+ -gen（产生……的东西/因子）。这里的“-gen”不一定表示“产生过敏”的意思，而是表示“某种因子/物质”，所以整体意义是“对抗过敏性休克的因子/物质”。"]}
{"word":"antianaphylaxis","summary":{"en":"Antianaphylaxis means reduced sensitivity after repeated exposure, which can prevent severe allergic reactions; essentially desensitization.","zh":"Antianaphylaxis 指反复暴露后敏感性降低，从而减少严重过敏反应的发生，本质上接近“脱敏/耐受”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine) A decrease or loss of sensitivity to a substance (such as an allergen) after repeated exposure, making a strong allergic reaction (anaphylaxis) less likely; desensitization.","zh":"（医学）机体在反复接触某种物质（如过敏原）后敏感性降低或消失，使严重过敏反应（过敏性休克）不太容易发生；亦可理解为“脱敏”。"},"examples":[{"en":"Repeated tiny doses of the allergen may lead to antianaphylaxis in some patients.","zh":"对一些患者来说，反复给予极小剂量的过敏原可能会导致抗过敏性休克（脱敏）效应。"},{"en":"The paper discusses antianaphylaxis as an early concept related to allergy desensitization.","zh":"这篇论文将抗过敏性休克作为与过敏脱敏相关的早期概念进行讨论。"}]}],"synonyms":["desensitization","tolerance (in an immunology sense)","hyposensitization"],"phonetic":"/ˌænˌtiˌænəfəˈlæksɪs/","extraExplanation":["这是一个较少见、偏历史性的免疫学术语，常见于早期过敏学/免疫学文献中。现代医学表达里更常用的是“desensitization（脱敏）”“tolerance（耐受）”或更具体的“allergen immunotherapy（过敏原免疫治疗）”。","词形可拆解为 anti-（反、抗）+ anaphylaxis（过敏性休克）。在多数日常英语语境中几乎不会用到，通常只出现在专业论文或教材里。"]}
{"word":"antianarchic","summary":{"en":"Antianarchic means “against anarchy,” favoring law and order.","zh":"antianarchic 指“反对无政府状态”，倾向于法律与秩序。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to anarchy or anarchism; supporting law, order, or stable government.","zh":"反对无政府状态或无政府主义的；主张法律、秩序或稳定政府的。"},"examples":[{"en":"The new constitution was designed to be antianarchic and to prevent political chaos.","zh":"这部新宪法旨在反无政府、避免政治混乱。"},{"en":"Some leaders used antianarchic rhetoric to justify stricter policing.","zh":"一些领导人用反无政府的言辞为更严格的执法辩护。"}]}],"synonyms":["anti-anarchist","anti-anarchism","law-and-order","orderly","anti-revolutionary"],"phonetic":"/ˌænti æˈnɑrkɪk/","extraExplanation":["构词：anti-（反对）+ anarchic（无政府的）。这个词比较少见，写作或学术语境中偶尔出现；日常英语更常用的说法是 “anti-anarchist/anti-anarchism” 或 “pro-law-and-order”。","语境提示：在政治讨论里，“antianarchic”通常强调“反混乱、反无政府状态”，不一定等同于“支持威权”；具体立场要看上下文。"]}
{"word":"antianarchist","summary":{"en":"“Anti-anarchist” means opposed to anarchism or to anarchists.","zh":"“Anti-anarchist”指反对无政府主义或反对无政府主义者。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to anarchism (the belief that society should have no government or rulers).","zh":"反对无政府主义（主张社会不应有政府或统治者的思想）的。"},"examples":[{"en":"The newspaper published an anti-anarchist editorial after the bombing.","zh":"爆炸事件之后，这家报纸发表了一篇反无政府主义的社论。"},{"en":"In the early 1900s, some laws were written with anti-anarchist aims.","zh":"在20世纪初，一些法律带有反无政府主义的目的。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who opposes anarchists or anarchism.","zh":"反对无政府主义者或无政府主义的人。"},"examples":[{"en":"He described himself as an anti-anarchist who still supported free speech.","zh":"他形容自己是反无政府主义者，但仍支持言论自由。"}]}],"synonyms":["anti-anarchism","anti-anarchist","anti-radical (context-dependent)"],"phonetic":"/ˌæntiˈænərkɪst/","extraExplanation":["这个词由前缀 anti-（“反对”）+ anarchist（“无政府主义者/无政府主义的”）构成，常见于政治讨论或历史语境（如19世纪末至20世纪初一些国家对“无政府主义运动/暴力行动”的反应）。","注意：anti-anarchist 不一定等于“亲威权/支持强政府”，也可能只是反对“无政府状态”或反对以无政府主义名义的暴力；具体立场需要结合上下文理解。"]}
{"word":"antiandrogen","summary":{"en":"An antiandrogen is a drug/substance that blocks the action of male sex hormones like testosterone.","zh":"antiandrogen 指“抗雄激素”，即阻断或减弱睾酮等雄性激素作用的药物或物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medicine or substance that blocks or reduces the effects of androgens (male sex hormones such as testosterone) in the body","zh":"抗雄激素；一种药物或物质，用来阻断或减弱雄激素（如睾酮等男性性激素）在体内的作用"},"examples":[{"en":"Spironolactone is sometimes prescribed as an antiandrogen for acne.","zh":"螺内酯有时会作为抗雄激素用于治疗痤疮。"},{"en":"Some gender-affirming hormone regimens include an antiandrogen to lower testosterone effects.","zh":"一些性别肯定（性别肯认）激素方案会加入抗雄激素，以降低睾酮的作用。"}]}],"synonyms":["androgen blocker","antiandrogenic agent"],"phonetic":"/ˌæn.tiˈæn.drə.dʒən/","extraExplanation":["词源与构词：anti- 表示“反/抗”，androgen 表示“雄激素”。合起来就是“对抗雄激素作用的（物质/药物）”。","常见相关词：androgen（雄激素），antiandrogen therapy（抗雄激素治疗），androgen blocker（雄激素阻断剂，较口语/通俗）。","使用场景：医学语境中常用于前列腺癌、痤疮、多毛症、以及部分性别肯定医疗中。不同药物的作用机制与副作用差异较大，属于专业医疗用语。"]}
{"word":"antiangular","summary":{"en":"“Antiangular” means not angular—more rounded and without sharp corners.","zh":"“antiangular”指“不呈棱角状”，更圆润、没有明显尖角。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not angular; having few or no sharp corners; rounded in shape.","zh":"非棱角状的；不呈角状的；形状较圆润、没有明显尖角的。"},"examples":[{"en":"The designer chose an antiangular table with smooth, rounded edges for safety.","zh":"设计师选择了一张边缘圆滑、没有尖角的桌子以确保安全。"},{"en":"In some descriptions of shells and leaves, “antiangular” means the outline is more rounded than pointed.","zh":"在一些对贝壳和叶片的描述中，“antiangular”表示轮廓更圆润而不是尖锐。"}]}],"synonyms":["rounded","curved","smooth-edged","nonangular","not angular"],"phonetic":"/ˌæntiˈæŋɡjələr/","extraExplanation":["“antiangular”由前缀 anti-（表示“反…/非…”）+ angular（“有角的；呈角状的”）构成，字面意思是“非角状的”。它比较少见，更多出现在较正式或技术性的形态描述里（如设计、植物学/动物学的外形描写）。日常英语里更常用 rounded、smooth-edged、not angular。"]}
{"word":"antiannexation","summary":{"en":"Antiannexation means opposing annexation, or a person/group that opposes annexation.","zh":"antiannexation 指“反对吞并/兼并的”，也可指“反吞并者/反吞并立场”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to annexation (the act of one country or region taking control of another area and making it part of itself).","zh":"反对吞并/并吞的；反对兼并的（指反对一个国家或地区把另一地区纳入自身统治）。"},"examples":[{"en":"The antiannexation movement argued that the island should remain independent.","zh":"反吞并运动主张该岛应保持独立。"},{"en":"Antiannexation activists organized petitions and public meetings.","zh":"反吞并人士组织请愿与公开集会。"}]},{"partOfSpeech":"n.","definition":{"en":"a person, group, or political position that opposes annexation.","zh":"反吞并者；反吞并立场/派别（指反对吞并的人、团体或政治主张）。"},"examples":[{"en":"Antiannexation leaders warned that annexation would weaken local self-government.","zh":"反吞并领袖警告说，吞并会削弱地方自治。"},{"en":"He was an antiannexation voice in the debate.","zh":"他是在辩论中反吞并的一方声音。"}]}],"synonyms":["anti-annexation","opposed to annexation","anti-expansionist","anti-imperialist"],"phonetic":"/ˌæntiˌænekˈseɪʃən/","extraExplanation":["“anti-”表示“反对”，加在名词或动名词前形成形容词或名词（如 antiwar 反战、antislavery 反奴隶制）。因此 antiannexation 直译就是“反对 annexation（吞并/兼并）”。","该词常见于历史与政治语境，尤其在讨论领土并入、殖民扩张或主权争议时（例如19世纪美国国内关于吞并某些地区的争论）。","拼写上也可能见到带连字符的形式 anti-annexation；含义相同，主要是排版与风格差异。"]}
{"word":"antiannexationist","summary":{"en":"Someone (or something) that opposes annexation.","zh":"反对吞并的人或立场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who opposes annexation (the act of adding a territory or region to a country or state).","zh":"反对吞并（把某地区并入一国或一州）的人。"},"examples":[{"en":"In the 1800s, some antiannexationists argued that expanding U.S. territory could lead to more conflict.","zh":"在19世纪，一些反对吞并者认为扩张美国领土可能带来更多冲突。"},{"en":"The antiannexationists organized meetings and published pamphlets to persuade voters.","zh":"反对吞并者组织集会并出版小册子来劝说选民。"}]},{"partOfSpeech":"adj.","definition":{"en":"Opposing annexation.","zh":"反对吞并的。"},"examples":[{"en":"She wrote an antiannexationist editorial in the local newspaper.","zh":"她在当地报纸上写了一篇反对吞并的社论。"},{"en":"The group took an antiannexationist stance during the debate.","zh":"该团体在辩论中采取了反对吞并的立场。"}]}],"synonyms":["anti-annexationist","opponent of annexation","anti-expansionist"],"phonetic":"/ˌæn.tiˌæn.ɛkˈseɪ.ʃə.nɪst/","extraExplanation":["这个词常见于历史与政治语境，尤其是讨论领土扩张时。例如美国历史上关于吞并得克萨斯（Texas annexation, 1845）或夏威夷（Hawaii annexation, 1898）的争论中，都能看到“反吞并”立场。","构词法：anti-（反对）+ annexation（吞并，并入）+ -ist（……主义者/……者）。因此它的意思很透明：反对吞并的人/立场。"]}
{"word":"antianopheline","summary":{"en":"Antianopheline means designed to prevent or control Anopheles mosquitoes, especially to reduce malaria transmission.","zh":"antianopheline 指“抗按蚊的/防治按蚊的”，多用于与疟疾防控相关的公共卫生语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"intended to prevent or control Anopheles mosquitoes (the mosquitoes that can transmit malaria).","zh":"用于预防或控制按蚊（可传播疟疾的蚊子）的；抗按蚊的。"},"examples":[{"en":"The clinic distributed antianopheline bed nets to reduce malaria risk.","zh":"诊所发放抗按蚊蚊帐，以降低疟疾风险。"},{"en":"Drainage of standing water was part of an antianopheline program.","zh":"清除积水是抗按蚊项目的一部分。"}]}],"synonyms":["anti-malarial mosquito-control","anti-Anopheles","mosquito-control (general)"],"phonetic":"/ˌæn.ti.əˈnɑː.fəˌlaɪn/","extraExplanation":["该词由 anti-（“反/抗”）+ anopheline（“按蚊的”）构成。按蚊（Anopheles）是疟疾最主要的传播媒介之一，所以在公共卫生语境里会出现 antianopheline measures（抗按蚊措施），例如：使用蚊帐、室内滞留喷洒（IRS）、清除积水、投放灭幼剂等。","它是较偏专业/学术的词；在一般新闻或日常表达中，更常见的说法是 “mosquito control” 或 “malaria prevention.”"]}
{"word":"antianthrax","summary":{"en":"Antianthrax means ‘against anthrax,’ describing medicines or measures that prevent or treat the infection.","zh":"antianthrax 意为“抗炭疽的/防治炭疽的”，常用于描述预防或治疗炭疽感染的药物、疫苗或措施。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"preventing, treating, or protecting against anthrax (a serious bacterial infection).","zh":"防治炭疽（由细菌引起的严重感染）的；抗炭疽的。"},"examples":[{"en":"The lab tested an antianthrax vaccine for emergency use.","zh":"实验室测试了一种用于紧急情况的抗炭疽疫苗。"},{"en":"After exposure, doctors may prescribe antianthrax antibiotics.","zh":"在可能暴露之后，医生可能会开具抗炭疽抗生素。"}]},{"partOfSpeech":"n.","definition":{"en":"a drug or vaccine used to prevent or treat anthrax.","zh":"抗炭疽药物；抗炭疽疫苗。"},"examples":[{"en":"Hospitals keep antianthrax supplies for high-risk incidents.","zh":"医院会储备抗炭疽物资以应对高风险事件。"}]}],"synonyms":["anti-anthrax","anthrax-preventing","anthrax-fighting"],"phonetic":"/ˌæn.tiˈæn.θræks/","extraExplanation":["“antianthrax”更常见的写法是“anti-anthrax”（带连字符），在新闻、公共卫生和生物安全语境中更常出现。","炭疽（anthrax）并不是“炭”相关的中毒，而是一种由炭疽芽孢杆菌引起的感染；提到“抗炭疽”时，常搭配vaccine（疫苗）、antibiotics（抗生素）、countermeasures（应对措施）等词。"]}
{"word":"antianthropocentric","summary":{"en":"Antianthropocentric means “not human-centered” and describes ideas that challenge treating humans as the main focus or measure of value.","zh":"antianthropocentric 意为“非人类中心的”，用于描述反对把人类当作价值与关注中心的观点。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not centered on humans; opposing the idea that humans are the most important beings or the main measure of value (the opposite of anthropocentric).","zh":"非人类中心的；反对“以人类为中心”的观点（与 anthropocentric 相反）。"},"examples":[{"en":"An antianthropocentric ethic considers the well-being of animals, plants, and ecosystems, not just humans.","zh":"一种非人类中心的伦理会考虑动物、植物和生态系统的福祉，而不只考虑人类。"},{"en":"The novel takes an antianthropocentric view by describing the world through the rhythms of weather and the sea.","zh":"这部小说以非人类中心的视角描写世界，关注天气与海洋的节律。"},{"en":"Some environmental philosophers argue for an antianthropocentric approach to climate policy.","zh":"一些环境哲学家主张气候政策应采取非人类中心的取向。"}]}],"synonyms":["non-anthropocentric","anti-anthropocentric","ecocentric","biocentric"],"phonetic":"/ˌæn.tiˌænθrə.poʊˈsɛn.trɪk/","extraExplanation":["这个词比较少见，常见于环境哲学、生态批评（ecocriticism）、动物研究（animal studies）等学术语境。日常表达里更常用：non-anthropocentric（非人类中心的）、anti-anthropocentrism（反人类中心主义）。","构词可拆解为：anti-（反对）+ anthropo-（人类）+ centric（中心的）。意思直观，但因为词很长，写作中常用连字符或改用更短的同义表达。"]}
{"word":"antianthropomorphism","summary":{"en":"Antianthropomorphism means avoiding human-like descriptions of nonhuman things.","zh":"Antianthropomorphism 指“反拟人化”，即避免用人的方式去解释或描写非人事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The belief, attitude, or practice of avoiding anthropomorphism (not describing animals, objects, or gods as if they were human).","zh":"反拟人化；一种观点/态度/做法：刻意避免把动物、事物或神明描写得像人一样（避免赋予人类情感、意图或行为）。"},"examples":[{"en":"The documentary follows an antianthropomorphism rule: it describes the wolves’ behavior without calling them “jealous” or “cruel.”","zh":"这部纪录片遵循反拟人化原则：它描述狼的行为时，不把它们说成“嫉妒”或“残忍”。"},{"en":"In science writing, antianthropomorphism helps keep explanations focused on evidence rather than feelings.","zh":"在科普写作中，反拟人化有助于让解释更专注于证据，而不是情绪化的想象。"}]}],"synonyms":["anti-anthropomorphism","non-anthropomorphic approach","avoidance of anthropomorphism"],"phonetic":"/ˌæn.tiˌæn.θɹə.pəˈmɔɹ.fɪ.zəm/","extraExplanation":["这个词很少见，更常见的说法是“anti-anthropomorphism（反拟人化）”。结构上是 anti-（反对）+ anthropomorph-（拟人化：anthropo- 人 + -morph 形态）+ -ism（主义/倾向）。","常见使用场景包括动物行为学、科普写作、哲学与宗教研究：强调不要用人类的心理词（如“故意”“报复”“善良”）去直接解释非人类对象的行为。","注意它并不等于“dehumanization（非人化/去人性化）”。反拟人化是避免“把非人当成人”；而 dehumanization 是“把人当成非人”来贬低。"]}
{"word":"antiantibody","summary":{"en":"An antibody that targets another antibody.","zh":"一种以另一种抗体为靶标的抗体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An antibody that binds to another antibody (often to its antigen‑binding site), sometimes called an anti‑idiotype antibody.","zh":"一种会结合（识别）另一种抗体的抗体，常常结合在其抗原结合位点上；也常称为“抗独特型抗体”。"},"examples":[{"en":"Researchers produced an anti‑antibody to detect human antibodies in a blood test.","zh":"研究人员制备了一种抗抗体，用来在血液检测中识别人类抗体。"},{"en":"Some anti‑antibodies can block an antibody from binding to its target antigen.","zh":"有些抗抗体会阻止某种抗体与其靶抗原结合。"}]}],"synonyms":["anti‑idiotype antibody","anti‑Ig antibody","anti‑immunoglobulin antibody"],"phonetic":"/ˌæn.tiˈæn.tɪˌbɑː.di/","extraExplanation":["“antiantibody”更常写作 **anti‑antibody**。在免疫学中，常用更精确的术语 **anti‑idiotype antibody（抗独特型抗体）**，指针对“另一抗体的特异性结构（独特型/idiotype）”产生的抗体。它可用于实验检测（例如识别某类抗体）、研究免疫调控机制，或在特定研究场景中作为“模拟抗原”的工具。"]}
{"word":"antiantidote","summary":{"en":"Antiantidote is a rare word meaning something that counteracts an antidote.","zh":"antiantidote 是个罕见词，指“抵消解毒剂作用的东西”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A substance or action that cancels, blocks, or reverses the effect of an antidote (so the poison or harmful effect returns).","zh":"（罕见）能抵消、阻断或逆转“解毒剂/对抗药（antidote）”效果的物质或做法，使毒性或不良作用重新出现。"},"examples":[{"en":"In theory, an antiantidote would undo the protection provided by an antidote.","zh":"理论上，antiantidote 会抵消解毒剂提供的保护作用。"},{"en":"The report warned that mixing drugs could act like an antiantidote and reduce the antidote’s benefit.","zh":"报告警告说，混用药物可能像 antiantidote 一样，削弱解毒剂的效果。"}]}],"synonyms":["antidote blocker","antagonist (context-dependent)","inhibitor (context-dependent)"],"phonetic":"/ˌæntiˈæntɪˌdoʊt/","extraExplanation":["这是一个非常少见、偏学术/构词法式的词：anti-（反、对抗）+ antidote（解毒剂）。在真实医学语境里，人们更常说“antagonist（拮抗剂）”“inhibitor（抑制剂）”或“something that blocks the antidote”。","词形上也可写作 anti-antidote（加连字符），用来强调“反解毒剂/对解毒剂的对抗物”的概念，而不是一个常用的标准术语。"]}
{"word":"antiantienzyme","summary":{"en":"An antiantienzyme is something that counteracts an antienzyme (an enzyme inhibitor).","zh":"antiantienzyme 指能抵消“抗酶”（酶抑制物）作用的物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A substance (often an antibody) that neutralizes or counteracts an antienzyme (an inhibitor of an enzyme), thereby restoring or protecting the enzyme’s activity.","zh":"反抗酶物质（常为抗体）：能中和或抵消“抗酶”（抑制酶活性的物质）的作用，从而恢复或保护酶的活性。"},"examples":[{"en":"In some experiments, an antiantienzyme was used to block the antienzyme and recover enzyme activity.","zh":"在一些实验中，会使用反抗酶来阻断抗酶，从而恢复酶活性。"},{"en":"Researchers tested whether the antiantienzyme could reduce inhibition caused by the antienzyme.","zh":"研究人员测试反抗酶是否能减弱抗酶造成的抑制作用。"}]}],"synonyms":["anti-antienzyme","antibody against an antienzyme","neutralizing antibody (context-dependent)"],"phonetic":"/ˌæn.tiˌæn.tiˈɛn.zaɪm/","extraExplanation":["这个词非常罕见，多见于较早期或较专门的生物化学/免疫学语境。构词上是 anti-（反对）+ antienzyme（抗酶/酶抑制物），意思是“反过来对付抗酶的东西”。","在现代文献里，更常用更具体的说法来表达同一概念，例如“an antibody against the inhibitor（针对抑制物的抗体）”或直接说“neutralizing antibody（中和抗体）”，而不一定写成 antiantienzyme。"]}
{"word":"antiantitoxin","summary":{"en":"An antiantitoxin is an antibody that targets an antitoxin, potentially reducing the antitoxin’s effectiveness.","zh":"antiantitoxin 指“抗抗毒素”：一种针对抗毒素的抗体，可能使抗毒素疗效下降。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an antibody that reacts against an antitoxin (an “anti-anti” substance), which can reduce or neutralize the effect of the antitoxin in the body","zh":"抗抗毒素（针对“抗毒素”的抗体），可在体内降低或中和抗毒素的作用"},"examples":[{"en":"In rare cases, repeated injections can lead to antiantitoxin formation, making the treatment less effective.","zh":"在少数情况下，反复注射可能产生抗抗毒素，使治疗效果变差。"},{"en":"Researchers measured antiantitoxin levels to see whether the antitoxin would still work.","zh":"研究人员测量抗抗毒素水平，以判断抗毒素是否仍然有效。"}]}],"synonyms":["anti-antitoxin","antibody to antitoxin","anti-drug antibody (broader term)"],"phonetic":"/ˌæntiˌæntɪˈtɑksɪn/","extraExplanation":["这个词结构是 anti- + antitoxin：前一个 anti- 表示“反对/针对”，后面的 antitoxin 指“抗毒素”（用于中和毒素的物质，常见于免疫学与血清治疗语境）。合起来就是“针对抗毒素的抗体”。","在现代医学语境中，更常用更宽泛的说法是 “anti-drug antibodies (ADA)”（抗药物抗体）：身体对外源性治疗性蛋白（如抗体、血清制剂）产生免疫反应，从而降低药效或引发不良反应。"]}
{"word":"antianxiety","summary":{"en":"Anti-anxiety means “reducing anxiety,” often describing medication or treatment; it can also refer to the medicine itself.","zh":"Anti-anxiety 表示“缓解焦虑的”，常用来形容药物或治疗；也可指抗焦虑药本身。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to reduce anxiety; relating to medicine or treatment that helps you feel less anxious.","zh":"用于减轻焦虑的；与能缓解焦虑的药物或治疗有关的。"},"examples":[{"en":"The doctor prescribed an anti-anxiety medication for short-term use.","zh":"医生开了一种抗焦虑药，建议短期使用。"},{"en":"Some people find anti-anxiety breathing exercises helpful before public speaking.","zh":"有些人觉得在公开演讲前做抗焦虑的呼吸练习很有帮助。"}]},{"partOfSpeech":"n.","definition":{"en":"A drug or treatment used to reduce anxiety.","zh":"抗焦虑药；用于减轻焦虑的治疗（统称）。"},"examples":[{"en":"She asked about non-addictive anti-anxiety options.","zh":"她询问有没有不易成瘾的抗焦虑选择。"},{"en":"Anti-anxiety drugs should be taken only as directed by a professional.","zh":"抗焦虑药应在专业人士指导下使用。"}]}],"synonyms":["anxiolytic","calming","sedative"],"phonetic":"/ˌæn.taɪˈæŋk.ʃə.ti/","extraExplanation":["“anti-anxiety”常见写法是带连字符的形容词（anti-anxiety medication）。不带连字符写成“antianxiety”也能见到，但较少、也更不正式。","在日常英语里，“anti-anxiety medication/drug”常指苯二氮䓬类等处方药，但更广义也可指任何帮助缓解焦虑的治疗方式（如心理治疗、放松训练）。医学用药请遵循医生建议。"]}
{"word":"antiapartheid","summary":{"en":"Anti-apartheid means opposing apartheid or referring to the movement to end it, especially connected to South Africa.","zh":"anti-apartheid 指“反对种族隔离制度”，也可指“反种族隔离运动”，尤其与南非历史相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposing apartheid (a system of racial segregation), especially in South Africa; supporting efforts to end racial segregation and inequality.","zh":"反对种族隔离制度（尤其指南非的“apartheid”）；支持结束种族隔离与不平等的。"},"examples":[{"en":"She joined an anti-apartheid student group in college.","zh":"她在大学加入了一个反种族隔离的学生团体。"},{"en":"The museum has an anti-apartheid exhibit about protest movements.","zh":"这家博物馆有一个关于抗议运动的反种族隔离展览。"}]},{"partOfSpeech":"n.","definition":{"en":"The movement, actions, or campaigns aimed at ending apartheid.","zh":"反种族隔离运动；旨在终结种族隔离制度的行动与运动。"},"examples":[{"en":"Anti-apartheid grew into an international cause in the 1980s.","zh":"在20世纪80年代，反种族隔离运动发展成一项国际性的事业。"},{"en":"Many artists used music and film to support anti-apartheid.","zh":"许多艺术家用音乐和电影来支持反种族隔离运动。"}]}],"synonyms":["opposed to apartheid","anti-segregation","civil-rights (related context)"],"phonetic":"/ˌæn.ti əˈpɑr.t(h)eɪt/","extraExplanation":["“anti-”是英语里常见的前缀，表示“反对……”。“apartheid”来自南非荷兰语（Afrikaans），原意与“分离/隔离”有关，因此“anti-apartheid”字面就是“反对种族隔离”。","常见搭配：anti-apartheid movement（反种族隔离运动）、anti-apartheid activist（反种族隔离活动家）、anti-apartheid protests（反种族隔离抗议）、anti-apartheid legislation/sanctions（反种族隔离立法/制裁）。","文化语境上，它常与南非20世纪的政治史相关，也常出现在讨论公民权利、人权、国际制裁与社会正义的文本中。"]}
{"word":"antiaphrodisiac","summary":{"en":"An antiaphrodisiac is something that reduces sexual desire (libido).","zh":"antiaphrodisiac 指能降低性欲（libido）的物质、药物或因素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance, medication, or thing that reduces sexual desire (libido)","zh":"抑制性欲的物质／药物／因素；降低性欲的东西"},"examples":[{"en":"Some medications can act as an antiaphrodisiac and lower libido.","zh":"有些药物会起到抑制性欲的作用，从而降低性欲。"},{"en":"Stress is often an antiaphrodisiac for many people.","zh":"对很多人来说，压力常常会抑制性欲。"}]}],"synonyms":["libido suppressant","sexual desire reducer","anaphrodisiac"],"phonetic":"/ˌæn.tiˌæf.roʊˈdɪz.i.æk/","extraExplanation":["词源上可拆解为 anti-（反、抑制）+ aphrodisiac（催情剂、助兴的东西）。aphrodisiac 来自希腊爱神 Aphrodite（阿佛洛狄忒）的名字，因此 antiaphrodisiac 字面意思就是“反催情的”。","在日常英文里，这个词相对学术/医学/正式；更口语的表达常用 “kills the mood”（扫兴、破坏气氛）或直接说 “reduces libido”（降低性欲）。"]}
{"word":"antiaphrodisiacal","summary":{"en":"Antiaphrodisiacal means “reducing sexual desire or arousal.”","zh":"antiaphrodisiacal 指“抑制性欲或降低性兴奋的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Reducing sexual desire or sexual arousal; tending to lessen libido.","zh":"抑制性欲的；降低性兴奋或性欲的。"},"examples":[{"en":"Some medications can have antiaphrodisiacal side effects.","zh":"一些药物可能有抑制性欲的副作用。"},{"en":"After the stressful week, the constant fatigue felt antiaphrodisiacal.","zh":"经历了压力很大的一周后，持续的疲劳让人感觉性欲下降。"},{"en":"The author describes the cold, sterile room as antiaphrodisiacal.","zh":"作者把那间寒冷、毫无生气的房间描写得“很败兴、让人提不起性欲”。"}]}],"synonyms":["desire-reducing","libido-suppressing","anaphrodisiac (less common)","unromantic (weaker/less medical)"],"phonetic":"ˌæntiˌæfrəˌdɪziˈækəl","extraExplanation":["词形拆解：anti- 表示“反、抑制”，aphrodisiac 指“催情的、增进性欲的”（源自希腊爱神 Aphrodite 的名字）。所以 antiaphrodisiacal 就是“反催情的／抑制性欲的”。","使用场景：常见于医学、心理学或较正式的写作中，描述药物副作用、压力与疲劳对性欲的影响；在日常口语里更常说 “kills the mood”（很扫兴/破坏气氛）或 “lowers libido”（降低性欲）。"]}
{"word":"antiaphthic","summary":{"en":"Antiaphthic describes something used to prevent or treat mouth ulcers (canker sores).","zh":"antiaphthic 指用于预防或治疗口腔溃疡（口疮/阿弗他溃疡）的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"preventing or treating aphthae (small painful mouth ulcers, often called canker sores).","zh":"用于预防或治疗口腔溃疡（阿弗他溃疡，俗称“口疮/口腔溃疡”）的。"},"examples":[{"en":"This gel is marketed as an antiaphthic treatment for canker sores.","zh":"这款凝胶被宣传为治疗口腔溃疡的抗口疮产品。"},{"en":"The dentist recommended an antiaphthic mouth rinse to reduce discomfort.","zh":"牙医建议使用抗口疮漱口水来减轻不适。"}]}],"synonyms":["antiaphthous","anti-aphthous","for canker sores","for mouth ulcers"],"phonetic":"/ˌæntiˈæfθɪk/","extraExplanation":["“anti-”表示“反、抗”，而“aphth-”来自“aphtha”（阿弗他溃疡，口腔黏膜上的小溃疡）。这个词在日常英语里不常见，更常见的说法是“for canker sores / for mouth ulcers”或“anti-aphthous/antiaphthous”。"]}
{"word":"antiaphthous","summary":{"en":"Antiaphthous means used to prevent or treat canker sores (aphthous ulcers).","zh":"Antiaphthous 指用于预防或治疗口疮（阿弗他溃疡/口腔溃疡）的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Preventing, relieving, or used to treat aphthae (aphthous ulcers/canker sores) in the mouth.","zh":"（医学）抗口疮的；用于预防、缓解或治疗口腔阿弗他溃疡（口疮/口腔溃疡）的。"},"examples":[{"en":"The dentist recommended an antiaphthous mouth rinse to reduce pain from canker sores.","zh":"牙医建议使用抗口疮漱口水来减轻口腔溃疡的疼痛。"},{"en":"Some gels are labeled antiaphthous because they help protect the ulcer and promote healing.","zh":"有些凝胶标注为“抗口疮”，因为它们能保护溃疡面并促进愈合。"}]}],"synonyms":["anti-ulcer (mouth)","for canker sores","anti-aphthous"],"phonetic":"/ˌæntaɪˈæfθəs/","extraExplanation":["“anti-”表示“反对/抑制”，而“aphthous”指“口腔阿弗他溃疡（canker sores）”。因此 antiaphthous 多见于药品说明、口腔护理产品标签或医学文献中，日常口语里更常说 “for canker sores / for mouth ulcers”。","注意：该词通常描述“产品/药物/漱口水”等的用途，而不是描述人的状态。"]}
{"word":"antiapoplectic","summary":{"en":"Anti­apoplectic means “preventing or treating apoplexy,” an older term connected to stroke.","zh":"antiapoplectic 指“预防或治疗 apoplexy（旧称，与中风相关）”的，较偏文献用语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"preventing or relieving apoplexy (an old term for a sudden stroke or loss of consciousness due to bleeding in the brain).","zh":"抗中风的；预防或缓解“猝中”（apoplexy，旧称：中风/脑溢血导致的突然昏倒等）的。"},"examples":[{"en":"In older medical writing, some herbs were described as antiapoplectic remedies.","zh":"在较早的医学著作中，有些草药被描述为“抗中风”的疗法。"},{"en":"The doctor recommended lifestyle changes rather than any so-called antiapoplectic medicine.","zh":"医生建议改变生活方式，而不是所谓的“抗中风”药物。"}]}],"synonyms":["preventive","prophylactic","stroke-preventing"],"phonetic":"/ˌæn.tiˌæp.əˈplɛk.tɪk/","extraExplanation":["“apoplexy”在现代英语医学中多已不用，常用更具体的词如“stroke（中风）”“cerebral hemorrhage（脑出血）”。因此“antiapoplectic”属于较少见、偏历史/文献用语。","构词法：anti-（反；防）+ apoplectic（中风的；突然昏厥的）。在现代语境里更自然的说法常是“stroke-preventing / preventive for stroke（预防中风的）”。"]}
{"word":"antiapostle","summary":{"en":"An “antiapostle” is someone seen as opposing or undermining an apostle or the apostles.","zh":"“antiapostle”指被认为反对或削弱使徒（或使徒群体）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposes, criticizes, or works against an apostle or the apostles (often used in religious or polemical writing).","zh":"反使徒者；反对、批评或抵制使徒（或使徒群体）的人（多见于宗教或论战语境）。"},"examples":[{"en":"In the pamphlet, the author calls his rivals “antiapostles” who distort the original teaching.","zh":"在那本小册子里，作者称对手为“反使徒者”，说他们歪曲了原始教义。"},{"en":"Some readers felt the label “antiapostle” was more insult than argument.","zh":"一些读者觉得“反使徒者”这个称呼更像辱骂而不是论证。"}]}],"synonyms":["opponent of the apostles","anti-apostolic figure","adversary","critic"],"phonetic":"/ˌæntaɪəˈpɑsəl/","extraExplanation":["这个词非常少见，通常是由前缀 anti-（“反对、对立”）+ apostle（“使徒”）构成的临时造词或修辞性称呼，用来强调“与使徒权威对立的人”。在现代英语中更常见、更自然的表达包括: opponent of the apostles（使徒的反对者）、anti-Christian preacher（反基督教传道者，视具体语境而定）、false apostle（假使徒，带有特定神学指控）。","注意与 anti-apostolic（反使徒的/反使徒传统的，形容词）区分：antiapostle 更像“某一类人”的称呼，而 anti-apostolic 更像“立场/思想”的描述。"]}
{"word":"antiaquatic","summary":{"en":"Antiaquatic means “against or strongly not liking water-related things or activities.”","zh":"Antiaquatic 指“反对或很不喜欢与水有关的事物或活动”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to water, aquatic life, or activities that happen in water; not favoring being in or around water.","zh":"反对水上事物的；不喜欢水域/水上活动的；（态度上）反“水生/水上”的。"},"examples":[{"en":"He has an antiaquatic attitude and refuses to join any swimming activities.","zh":"他对水上活动很排斥，拒绝参加任何游泳项目。"},{"en":"The group’s antiaquatic policies focus on reducing new development along the lake.","zh":"该团体的“反水域”政策重点是减少湖边的新开发项目。"}]}],"synonyms":["water-averse","anti-swimming","land-oriented"],"phonetic":"/ˌæntiəˈkwætɪk/","extraExplanation":["这个词很少见，更多时候人们会直接说“doesn’t like water / avoids swimming（不喜欢水/避免游泳）”或用更常见的词如“land-based（偏陆地的）”。","构词上是 anti-（反对）+ aquatic（与水有关的），通常用于描述态度、偏好或政策立场，而不是描述物体的物理属性。"]}
{"word":"antiar","summary":{"en":"Antiar is a poisonous Southeast Asian tree whose sap was historically used as arrow poison.","zh":"Antiar 指一种东南亚的有毒树（见血封喉），其汁液曾被用于制作箭毒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a poisonous tree (Antiaris toxicaria) from Southeast Asia and nearby regions; its sap/latex has been used to make arrow poison","zh":"见血封喉（学名 Antiaris toxicaria），一种东南亚等地的有毒树木；其汁液/乳汁曾被用来制作箭毒"},"examples":[{"en":"In the story, hunters tipped their arrows with antiar sap.","zh":"在故事里，猎人用 antiar 的汁液给箭头上毒。"},{"en":"Researchers studied compounds found in the antiar tree.","zh":"研究人员分析了 antiar 树中含有的化合物。"}]}],"synonyms":["Antiaris toxicaria","upas tree"],"phonetic":"/ˈæn.tiˌɑr/","extraExplanation":["“Antiar”这个词在英语里较少见，更常见的说法是用学名 **Antiaris toxicaria**，或与其相关的民间称呼 **upas tree**（乌帕斯毒树）。","它与中文常说的“见血封喉”常被对应起来：这种树的乳汁含有强心苷等毒性成分，历史上在部分地区被用作箭毒，但相关传说也常被文学作品夸张化。"]}
{"word":"antiarch","summary":{"en":"An antiarch is an extinct armored placoderm fish, especially common in the Devonian period.","zh":"antiarch 指一种已灭绝的有装甲的盾皮鱼类，尤其在泥盆纪常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of extinct armored fish (a placoderm) that lived mainly in the Devonian period, known for heavy bony plates and often for having jointed, armor-covered front fins.","zh":"一种已经灭绝的有甲胄的鱼类（盾皮鱼类中的一支），主要生活在泥盆纪，以厚重的骨板装甲著称，常见特征是前部鳍（或前肢状结构）也被装甲覆盖并可能具有关节。"},"examples":[{"en":"Antiarchs were common in Devonian freshwater environments.","zh":"反甲鱼类在泥盆纪的淡水环境中很常见。"},{"en":"The fossil shows an antiarch with thick armor plates around its head and body.","zh":"这块化石显示了一种反甲鱼类，头部和身体周围有厚厚的装甲骨板。"}]}],"synonyms":["antiarch placoderm","Antiarchi"],"phonetic":"/ˈæn.ti.ɑrk/","extraExplanation":["“antiarch”来自古生物分类名称 Antiarchi（反甲鱼目/反甲鱼类群）。它们属于盾皮鱼（placoderms），是非常早期、带有骨质装甲的脊椎动物之一，对理解早期鱼类与有颌脊椎动物的演化很重要。","常见代表包括 Bothriolepis（沟鳞鱼属，中文译名可能因资料不同而略有差异）。在科普或学术文章里，你也可能看到写作“antiarch placoderm（反甲盾皮鱼）”来强调它是盾皮鱼的一支。"]}
{"word":"Antiarcha","summary":{"en":"Antiarcha: an extinct group of armored placoderm fishes, mainly from the Devonian.","zh":"Antiarcha：泥盆紀為主的一類已滅絕的有甲胄盾皮魚類。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group (order) of extinct armored fishes (placoderms) that lived mainly in the Devonian Period; members are often called antiarchs.","zh":"反甲魚類：一類已滅絕的有甲胄魚（盾皮魚類），主要生活在泥盆紀；其成員常稱為“反甲魚/反甲盾皮魚”。"},"examples":[{"en":"Antiarcha were heavily armored placoderms common in Devonian freshwater habitats.","zh":"反甲魚類是全身覆有厚重甲胄的盾皮魚，在泥盆紀的淡水環境中很常見。"},{"en":"The fossil museum has a display on Antiarcha and other early jawed fishes.","zh":"那座化石博物館有一個展區介紹反甲魚類與其他早期有頜魚。"}]}],"synonyms":["antiarch","antiarchs","antiarch placoderms"],"phonetic":"/ˌæntaɪˈɑːrkə/","extraExplanation":["“Antiarcha”是古生物學/分類學用語，常作為一個分類群名稱（有時被處理為“目”）。日常英文中更常見的是成員名稱“antiarch(s)”。","詞源通常被解釋為由希臘語構詞而來（anti- 表“相對/相反”），但其命名背景屬於早期古生物分類史的一部分，不同資料對細節表述可能略有差異；學習時重點掌握它指“泥盆紀的有甲胄盾皮魚類”即可。"]}
{"word":"antiarcha","summary":{"en":"Antiarcha: extinct armored placoderm fishes, especially common in the Devonian.","zh":"Antiarcha：已灭绝的披甲盾皮鱼类类群，主要见于泥盆纪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group (order/subclass) of extinct armored jawed fishes (placoderms) that lived mainly in the Devonian period; known for heavy bony plates and a box-like head-and-body shield.","zh":"反甲鱼类（又称反关节类）：一种已灭绝的有颌披甲鱼类（盾皮鱼类）类群，主要生活在泥盆纪；以厚重骨甲、箱状的头躯护盾而闻名。"},"examples":[{"en":"Antiarcha were armored fishes that lived hundreds of millions of years ago.","zh":"反甲鱼类是生活在数亿年前的披甲鱼。"},{"en":"Fossils of Antiarcha help scientists understand early vertebrate evolution.","zh":"反甲鱼类的化石帮助科学家理解早期脊椎动物的演化。"}]}],"synonyms":["placoderms (broader term)","armored fishes (general description)"],"phonetic":"/ˌæntiˈɑrkə/","extraExplanation":["“Antiarcha”是古生物学/鱼类学中的分类名称，常见于学术文章和博物馆展牌，不属于日常英语词汇。","词源上，anti- 有“相对/相反”的意思，-archa 与“关节/结构（如关节的起始部分）”相关；名称与其特殊的装甲与结构特征有关。","在科普语境中，你也可能看到它与“placoderms（盾皮鱼类）”“Devonian（泥盆纪）”“armored fish（披甲鱼）”一起出现。"]}
{"word":"Antiarchi","summary":{"en":"Antiarchi are extinct armored placoderm fish, best known from Devonian fossils.","zh":"Antiarchi 指泥盆纪常见的一类已灭绝的有甲盾皮鱼化石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an order (group) of extinct armored fish (placoderms) that lived mainly in the Devonian period; antiarchs were bottom-dwelling and had heavy bony plates, often with limb-like armored fins.","zh":"反盾鱼目（或反盾鱼类）：一种已灭绝的有甲鱼类（盾皮鱼），主要生活在泥盆纪；它们多为底栖，身体覆盖厚重骨甲，胸鳍常呈“像肢体一样”的装甲结构。"},"examples":[{"en":"Antiarchi fossils are common in Devonian rock layers.","zh":"反盾鱼目的化石在泥盆纪地层中很常见。"},{"en":"Many Antiarchi species had strong armor that protected them on the seafloor.","zh":"许多反盾鱼目物种拥有坚硬的骨甲，有助于它们在海底生存。"}]}],"synonyms":["antiarchs","placoderms","Bothriolepis"],"phonetic":"/ˌæn.tiˈɑr.kaɪ/","extraExplanation":["“Antiarchi”来自希腊语词根：anti-（反、对）+ archi-（与“肛门/臀部”区域有关的词根），指这一类鱼在骨甲与身体结构上的特征（与其他盾皮鱼类相对）。","常见的反盾鱼类代表是 Bothriolepis（沟鳞鱼属），在古生物学与地史研究中常用来指示泥盆纪淡水或近岸环境。"]}
{"word":"antiarchi","summary":{"en":"Antiarchi are an extinct group of heavily armored Devonian fishes (placoderms).","zh":"Antiarchi 指泥盆纪时期的一类已灭绝的重甲装甲鱼（盾皮鱼类）类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group (order) of extinct armored fishes (placoderms) that lived mainly in the Devonian period; the name is often treated as a taxonomic plural.","zh":"反关节鱼类（Antiarchi）：一种已灭绝的装甲鱼类（盾皮鱼类）类群/目，主要生活在泥盆纪；该词常作为分类学上的复数使用。"},"examples":[{"en":"Fossils of Antiarchi are common in Devonian rock layers.","zh":"反关节鱼类的化石在泥盆纪岩层中很常见。"},{"en":"In the museum, the Antiarchi specimens show heavy armor plates around the head and body.","zh":"在博物馆里，反关节鱼类的标本显示头部和身体周围有厚重的甲板。"}]}],"synonyms":["antiarchs","antiarch (singular, common name)"],"phonetic":"/ˌæntiˈɑrki/","extraExplanation":["“Antiarchi”来自希腊语成分：anti-（反、相对）+ archē（关节/结构的起点之类的概念，在此与其胸鳍结构相关）。这类鱼的胸鳍被厚甲包裹，外观像“关节方向相反/结构特殊”，因此得名。","在英文里它常直接作为一个分类名使用（像“Canidae”“Felidae”那样的学名风格），所以你会看到它既可指“这一类群”，也可泛指“这一类群的成员”。若要强调单个成员，常写“an antiarch”（反关节鱼）。"]}
{"word":"antiarchs","summary":{"en":"Antiarchs are extinct armored prehistoric fish (placoderms), especially known from Devonian fossils.","zh":"Antiarchs 指已灭绝的披甲史前鱼类（盾皮鱼类），尤其以泥盆纪化石而知名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of antiarch) An extinct group of heavily armored prehistoric fish (placoderms), known especially from the Devonian period.","zh":"（antiarch 的复数）一种已灭绝的、全身披甲的史前鱼类类群（盾皮鱼），尤其常见于泥盆纪的化石记录中。"},"examples":[{"en":"Antiarchs are often identified by their bony armor plates in fossils.","zh":"antiarchs 常因化石中明显的骨质甲片而被辨认出来。"},{"en":"In the Devonian seas, antiarchs lived alongside many other early vertebrates.","zh":"在泥盆纪的海洋中，antiarchs 与许多其他早期脊椎动物共同生活。"}]}],"synonyms":["antiarch placoderms","armored placoderms","armored fish (general)"],"phonetic":"ˈæntiˌɑrk","extraExplanation":["词源提示：antiarch 来自古生物分类名 Antiarchi（反背甲类），常用于学术或科普语境；日常英语中很少出现，多见于古生物学、地质学、博物馆展牌与科普文章。","学习建议：在阅读中你可能会看到更常用的上位词 placoderms（盾皮鱼类）或 armored fish（披甲鱼/装甲鱼）来帮助理解 antiarchs 属于“有骨甲的早期鱼类”。"]}
{"word":"Antiaria","summary":{"en":"Antiaria is a genus of tropical trees, especially known for toxic latex in some species.","zh":"Antiaria 是一种热带树木属，部分物种以有毒乳胶著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical trees in the mulberry family (Moraceae), especially known for species whose milky sap (latex) can be highly toxic","zh":"一种热带树木属（桑科 Moraceae），尤以部分物种的乳白色树汁（乳胶）具有强毒性而闻名"},"examples":[{"en":"Antiaria trees grow in tropical parts of Africa and Southeast Asia.","zh":"Antiaria 属的树生长在非洲和东南亚的热带地区。"},{"en":"The latex of Antiaria toxicaria was historically used to poison arrow tips.","zh":"Antiaria toxicaria 的乳胶在历史上曾被用来给箭头涂毒。"}]}],"synonyms":["Antiaria toxicaria (a notable species)","upas tree (common name for A. toxicaria)"],"phonetic":"/ˌæn.tiˈɛə.ri.ə/","extraExplanation":["“Antiaria” 是植物学中的属名，常见于学术文章、植物志或自然纪录片语境；日常英语里更常听到具体物种名（如 Antiaria toxicaria）或俗名（如 upas tree，“乌帕斯毒箭树/毒树”的说法）。","与“有毒”相关的文化叙述在殖民时期旅行记与文学中被放大过；现代观点更强调其毒性来源于乳胶中的强心苷类成分，以及其传统用途与生态学背景。"]}
{"word":"antiarin","summary":{"en":"Antiarin is a very strong poison from the upas tree, historically used as arrow poison.","zh":"Antiarin 是一种来自乌帕斯树（毒箭树）的强效毒素，历史上常用于制作箭毒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a powerful poison (cardiac glycoside) found in the sap of the upas tree (Antiaris toxicaria), historically used to make arrow poison.","zh":"（名词）一种强效毒素（强心苷类），存在于“乌帕斯树/毒箭树”（Antiaris toxicaria，常译作安替阿里斯毒箭木）的乳汁中；历史上常被用来涂抹箭头制作箭毒。"},"examples":[{"en":"In some historical accounts, antiarin was used to poison arrow tips for hunting.","zh":"在一些历史记载中，人们用 antiarin 给箭头上毒，用于狩猎。"},{"en":"Because antiarin affects the heart, it is extremely dangerous in uncontrolled doses.","zh":"由于 antiarin 会影响心脏功能，在无法控制剂量的情况下极其危险。"}]}],"synonyms":["arrow poison toxin","upas-tree toxin","cardiac glycoside (class)"],"phonetic":"/ˌæn.tiˈer.ɪn/","extraExplanation":["antiarin 主要与东南亚的“upas tree（乌帕斯树/毒箭树）”传说有关：欧洲早期旅行文献曾把它描写得非常夸张（例如“树周围寸草不生”之类），但现代研究认为这些说法多为误传或文学化渲染。","它属于强心苷类（cardiac glycosides）这类化学物质的一员，同类物质在医学上也可能有用途，但 antiarin 本身更多出现在毒物学、民族植物学或历史叙述中；在现实语境中应避免把它当作可接触或可实验的东西。"]}
{"word":"antiarins","summary":{"en":"Antiarins are extremely poisonous chemicals from the upas tree, historically used as arrow poison.","zh":"Antiarins 是来自见血封喉树的剧毒化学物质，历史上常用于箭毒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a poisonous cardiac glycoside (natural chemical) found in the upas tree (Antiaris toxicaria), historically used as an arrow poison; “antiarins” is the plural form.","zh":"一种有毒的强心苷（天然化学物质），存在于见血封喉树/毒箭木（Antiaris toxicaria）中，历史上常被用作箭毒；“antiarins”为其复数形式。"},"examples":[{"en":"Researchers studied antiarin and other antiarins for their effects on the heart.","zh":"研究人员研究了 antiarin 以及其他 antiarins 对心脏的影响。"},{"en":"In historical accounts, people used sap from the upas tree, containing antiarins, as a poison for hunting.","zh":"在一些历史记载中，人们用含有 antiarins 的见血封喉树树汁作为狩猎毒药。"}]}],"synonyms":["cardiac glycosides","arrow poison (contextual)"],"phonetic":"/ˌæntiˈærɪn/","extraExplanation":["“Antiarin”属于“强心苷（cardiac glycoside）”这一类物质，和“洋地黄毒苷（digitalis glycosides）”在作用类型上有相似之处：都会影响心脏节律与收缩，但 antiarin 毒性极强，不可接触或误食。","“upas tree”常被译为“见血封喉/毒箭木”，在东南亚文化与殖民时期文献中常被提及，因其树汁可用于涂抹箭头而出名。现代资料里有些传闻被夸大，但其毒性确实存在。"]}
{"word":"Antiaris","summary":{"en":"Antiaris is a genus of tropical trees, known especially for toxic latex and traditional uses of its bark.","zh":"Antiaris 是一种热带树木属，尤其以有毒乳汁以及树皮的传统用途而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical trees in the mulberry family (Moraceae), best known for species whose sap (latex) has been used historically as arrow poison and for making bark cloth.","zh":"一种热带树木属（桑科，Moraceae），最著名的是其中一些物种的树液（乳汁）曾被用于制作箭毒，也可用于制作树皮布。"},"examples":[{"en":"Antiaris toxicaria is sometimes called the upas tree and is the best-known species in the genus Antiaris.","zh":"Antiaris toxicaria 有时被称为“乌帕斯树”（upas tree），也是 Antiaris 属中最广为人知的物种。"},{"en":"Researchers studied the latex of Antiaris to understand why it is toxic to animals.","zh":"研究人员研究了 Antiaris 的乳汁，以了解它为何对动物有毒。"},{"en":"In some regions, bark from Antiaris trees has been used to make traditional cloth.","zh":"在一些地区，人们会用 Antiaris 树的树皮来制作传统布料。"}]}],"synonyms":["upas tree (common name for certain species)"],"phonetic":"/ˌæn.tiˈer.ɪs/","extraExplanation":["“Antiaris”是拉丁化的植物学名称，日常英语中不常单独使用，多出现在植物学、药理学或生态学文本里。","与它相关的常见俗名是“upas tree（乌帕斯树）”，但这个俗名通常特指某些物种（尤其是 Antiaris toxicaria），而不是整个属。"]}
{"word":"antiaris","summary":{"en":"Antiaria is a tropical tree genus (notably the upas tree) known for poisonous sap historically used for arrow or dart poison.","zh":"Antiaria 指一种热带乔木属（著名者为毒箭木/乌帕斯树），以有毒树汁闻名，历史上曾用作箭毒或吹箭毒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical trees (especially Antiaria toxicaria, the “upas tree”) in the mulberry family, known for its poisonous milky sap historically used to make dart or arrow poison.","zh":"一种热带乔木属（尤指“毒箭木”Antiaria toxicaria，俗称“爪哇毒树/乌帕斯树”），属桑科，以其有毒乳汁著称，历史上曾用于制作吹箭或箭毒。"},"examples":[{"en":"The explorer recorded that Antiaria sap was used to poison hunting darts.","zh":"探险者记载说，人们用 Antiaria（毒箭木）的树汁给狩猎吹箭上毒。"},{"en":"Antiaria toxicaria grows in parts of Southeast Asia and produces a toxic latex.","zh":"Antiaria toxicaria 分布在东南亚部分地区，会分泌有毒乳汁。"}]}],"synonyms":["Antiaria","Antiaria toxicaria","upas tree"],"phonetic":"/ˌæntiˈærɪs/","extraExplanation":["“Antiaria toxicaria”常被称为“upas tree（乌帕斯树）”。在欧洲早期旅行文学里，它一度被夸张描写成“树下寸草不生”的致命毒树；现代植物学认为这种说法有传奇成分，但其乳汁确实含强心苷类毒素（如 antiarin），可致严重中毒。"]}
{"word":"antiaristocracies","summary":{"en":"“Antiaristocracies” is a rare plural noun meaning opposition to aristocratic rule or multiple aristocratic systems viewed as things to oppose.","zh":"“antiaristocracies”是较少见的复数名词，指反对贵族统治的思想/行动，或指被视为反对对象的多个贵族体系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to aristocracies or to aristocratic rule; beliefs or actions that resist the power of hereditary nobles (often used in political or historical writing).","zh":"反对贵族阶层或贵族统治的思想/行动；抵制世袭贵族权力（多见于政治或历史语境）。"},"examples":[{"en":"Many revolutionary movements were driven by strong antiaristocracies.","zh":"许多革命运动都受到强烈反贵族思想的推动。"},{"en":"The pamphlet’s antiaristocracies criticized inherited privilege.","zh":"这本小册子的反贵族立场批评了世袭特权。"}]},{"partOfSpeech":"n.","definition":{"en":"(Plural) Multiple aristocratic systems or elite noble classes in different countries or periods, viewed as things to oppose.","zh":"（复数）不同国家或不同时期的多个贵族体系/贵族阶层，被视为反对对象。"},"examples":[{"en":"He compared European antiaristocracies across the 18th and 19th centuries.","zh":"他比较了18到19世纪欧洲各地的反贵族思潮。"},{"en":"Their speeches attacked old antiaristocracies and demanded equal rights.","zh":"他们的演讲抨击旧的贵族体系并要求平等权利。"}]}],"synonyms":["anti-aristocracy","anti-aristocratic sentiment","anti-nobility movement","egalitarianism (related)"],"phonetic":"/ˌæn.taɪ.əˈrɪs.təˌkrə.siz/","extraExplanation":["这个词非常少见，写作中更常见的是 anti-aristocracy（反贵族制度/反贵族思想）或 anti-aristocratic（反贵族的，形容词）。","构词：anti-（反对）+ aristocracy（贵族统治/贵族阶层）。你输入的 antiaristocracies 是复数形式。正式写作里常见带连字符：anti-aristocracies。"]}
{"word":"antiaristocracy","summary":{"en":"Anti-aristocracy: opposition to aristocratic rule or privilege.","zh":"antiaristocracy：反对贵族统治或贵族特权。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to an aristocracy (rule or influence of nobles), or a movement/attitude against aristocratic privilege and social class power.","zh":"反对贵族统治或贵族特权的立场、情绪或运动；反贵族主义。"},"examples":[{"en":"In some revolutions, antiaristocracy grew as people demanded equal rights for everyone.","zh":"在一些革命中，随着人们要求人人平等，反贵族主义情绪不断增强。"},{"en":"The novel reflects strong antiaristocracy, criticizing inherited wealth and titles.","zh":"这部小说体现出强烈的反贵族主义，批判世袭的财富与头衔。"}]}],"synonyms":["anti-aristocratic sentiment","egalitarianism","anti-elitism"],"phonetic":"/ˌæntiəˈrɪstəkrəsi/","extraExplanation":["这个词由前缀 anti-（“反对”）+ aristocracy（“贵族统治/贵族阶层”）构成，常见于政治史或社会批评语境。它强调反对“靠出身获得权力与特权”，不一定等同于反对所有富人或精英。","更常见的表达是 anti-aristocratic（形容词，“反贵族的”）或 anti-aristocracy sentiment（“反贵族情绪”）。"]}
{"word":"antiaristocrat","summary":{"en":"Anti(aristocrat) describes someone or something opposed to aristocrats and aristocratic privilege.","zh":"antiaristocrat 指“反贵族的/反对贵族特权的”，也可指“反贵族者”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to aristocrats or to the power and privileges of an aristocracy; favoring more equal or democratic society.","zh":"反贵族的；反对贵族阶层及其特权的；倾向平等或民主的。"},"examples":[{"en":"The pamphlet used strongly antiaristocrat language to criticize inherited privilege.","zh":"这本小册子用强烈的反贵族措辞来批评世袭特权。"},{"en":"In the novel, the hero’s antiaristocrat beliefs put him in conflict with the local nobles.","zh":"在小说里，男主的反贵族信念让他与当地贵族发生冲突。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who opposes aristocrats or aristocratic rule and privilege.","zh":"反贵族者；反对贵族统治与特权的人。"},"examples":[{"en":"He was known as an antiaristocrat who argued for broader voting rights.","zh":"他以反贵族者闻名，主张扩大选举权。"}]}],"synonyms":["anti-aristocratic","anti-aristocracy","anti-elitist","egalitarian"],"phonetic":"/ˌæntiəˈrɪstəˌkræt/","extraExplanation":["这个词在现代英语里不算常见，更常用的表达是 anti-aristocratic（反贵族的）或 anti-aristocracy（反对贵族制度的）。写作中也会用 anti-elitist（反精英的）来表达更广义的“反特权/反精英阶层”立场。","常见语境：法国大革命、英国议会改革、19世纪民主运动等讨论“世袭特权 vs. 平等权利”的历史或政治文本中。"]}
{"word":"antiaristocratic","summary":{"en":"Antiaristocratic means opposing the aristocracy or aristocratic privilege.","zh":"antiaristocratic 指“反贵族的”，反对贵族阶层或贵族特权。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to the aristocracy (the hereditary noble class) or to aristocratic privilege and social rank.","zh":"反贵族的；反对贵族阶层或贵族特权与等级制度的。"},"examples":[{"en":"The novel has an antiaristocratic tone, criticizing inherited wealth and titles.","zh":"这部小说带有反贵族的基调，批判世袭的财富与头衔。"},{"en":"Many revolutionaries adopted antiaristocratic ideas to challenge the old social order.","zh":"许多革命者采纳反贵族思想，以挑战旧的社会秩序。"},{"en":"His speech was openly antiaristocratic and called for equal rights.","zh":"他的演讲公开反贵族，并呼吁平等权利。"}]}],"synonyms":["anti-elitist","egalitarian","anti-nobility","anti-establishment"],"phonetic":"ˌæntiəˌrɪstəˈkrætɪk","extraExplanation":["“anti-”表示“反对/对抗”，“aristocratic”与贵族阶层、上流社会礼仪或特权有关。这个词常用于政治、历史或文学评论中，形容一种立场或语气（tone），而不一定是对某个具体个人的厌恶。","近似语境中也会看到带连字符的写法：anti-aristocratic（两者都可见，连字符更清晰）。"]}
{"word":"antiaristocratical","summary":{"en":"Anti-aristocratical means “against aristocrats or aristocratic privilege; pro-equality/democracy.”","zh":"antiaristocratical 指“反贵族（特权/统治）的；倾向平等或民主的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to aristocrats or aristocratic rule; favoring equality or democracy rather than inherited privilege.","zh":"反贵族的；反对贵族阶层或贵族统治的；主张平等/民主而非世袭特权的。"},"examples":[{"en":"The pamphlet used strongly antiaristocratical language to attack inherited privilege.","zh":"这本小册子用强烈的反贵族措辞来抨击世袭特权。"},{"en":"His antiaristocratical views made him popular with working-class voters.","zh":"他的反贵族观点让他在工人阶层选民中很受欢迎。"}]}],"synonyms":["anti-aristocratic","anti-elitist","egalitarian","democratic"],"phonetic":"/ˌæn.ti.əˌrɪs.təˈkræt.ɪ.kəl/","extraExplanation":["这个词非常少见，现代英语里更常用 anti-aristocratic（反贵族的）或 anti-aristocracy（反对贵族制度）。","词形可拆解为 anti-（反对）+ aristocrat（贵族）+ -ical（形容词后缀），整体意思就是“反贵族的/反贵族制度的”。在历史或政治写作（如讨论革命、平民主义、民主化）中更可能见到。"]}
{"word":"antiaristocratically","summary":{"en":"Anti-aristocratically means “in a way that opposes aristocracy or aristocratic privilege.”","zh":"antiaristocratically 意为“以反对贵族或贵族特权的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that opposes aristocracy (the idea or power of a hereditary upper class) or supports more equal, non-elite social and political systems.","zh":"以反贵族的方式；以反对世袭上层阶级特权、支持更平等社会与政治制度的方式。"},"examples":[{"en":"The pamphlet argued antiaristocratically, calling for laws that applied equally to everyone.","zh":"这本小册子以反贵族的立场论证，主张法律应对所有人一视同仁。"},{"en":"Some writers portrayed the revolution antiaristocratically by mocking titles and inherited wealth.","zh":"一些作家以反贵族的角度描写革命，通过嘲讽头衔与继承财富来表达立场。"}]}],"synonyms":["anti-aristocratically","in an anti-aristocratic way","egalitarianly","democratically"],"phonetic":"/ˌæn.ti.əˌrɪs.təˈkræt.ɪ.kli/","extraExplanation":["这个词很少在日常英语中使用，常见于历史、政治或学术语境。更常见的表达是：in an anti-aristocratic way / in opposition to the aristocracy。","构词：anti-（反对）+ aristocratic（贵族的）+ -ally（以……方式）。也可见形容词 antiaristocratic（反贵族的）。"]}
{"word":"antiarrhythmia","summary":{"en":"An antiarrhythmia is a medicine/treatment used to correct abnormal heart rhythms.","zh":"antiarrhythmia 指用于纠正异常心律的抗心律失常药或治疗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medicine or treatment used to prevent or correct an abnormal heart rhythm (arrhythmia).","zh":"抗心律失常（药）；用于预防或纠正异常心律（心律失常）的药物或治疗。"},"examples":[{"en":"The doctor prescribed an antiarrhythmia to control his irregular heartbeat.","zh":"医生开了抗心律失常药来控制他不规律的心跳。"},{"en":"Some antiarrhythmias can cause side effects, so patients need regular checkups.","zh":"有些抗心律失常药可能有副作用，因此患者需要定期复查。"}]}],"synonyms":["antiarrhythmic (drug)","antiarrhythmic agent"],"phonetic":"/ˌæn.ti.əˈrɪð.mi.ə/","extraExplanation":["构词帮助：anti- 表示“反、抗”，arrhythmia 表示“心律失常”。合在一起就是“抗心律失常”。","医学语境中更常见的写法是 antiarrhythmic（形容词/名词），例如：an antiarrhythmic drug（抗心律失常药）。antiarrhythmia 作为名词也可用，但相对少见。"]}
{"word":"antiarrhythmic","summary":{"en":"Antiarrhythmic describes medicines that treat abnormal heart rhythms, and it can also mean the medicine itself.","zh":"antiarrhythmic 指“抗心律失常的”，也可指“抗心律失常药”本身。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"a medicine (or drug) used to prevent, reduce, or correct abnormal heart rhythms (arrhythmias)","zh":"抗心律失常的；用于预防、减轻或纠正心律失常的（药物/治疗）"},"examples":[{"en":"The doctor prescribed an antiarrhythmic to control her irregular heartbeat.","zh":"医生开了抗心律失常药来控制她不规则的心跳。"},{"en":"Some antiarrhythmic drugs can affect blood pressure, so monitoring is important.","zh":"一些抗心律失常药可能影响血压，所以监测很重要。"}]},{"partOfSpeech":"n.","definition":{"en":"an antiarrhythmic drug; a medicine used to treat abnormal heart rhythms","zh":"抗心律失常药；用于治疗心律失常的药物"},"examples":[{"en":"Amiodarone is a powerful antiarrhythmic used for certain serious rhythm problems.","zh":"胺碘酮是一种较强的抗心律失常药，用于某些较严重的心律问题。"},{"en":"He asked about side effects before starting the new antiarrhythmic.","zh":"他在开始使用新的抗心律失常药之前询问了副作用。"}]}],"synonyms":["antiarrhythmia","antiarrhythmic drug","antiarrhythmia medication"],"phonetic":"/ˌæn.ti.əˈrɪð.mɪk/","extraExplanation":["词形拆解：anti-（反、抗）+ arrhythmia（心律失常）+ -ic（形容词后缀）。既可作形容词（antiarrhythmic drug 抗心律失常药），也常在医学语境中直接作名词指“抗心律失常药”。","发音提示：中间的 rhythm 在拼写上有 th，但发音更接近 /ˈrɪð- /，整体重音通常落在“rhyth-”附近：an-ti-ar-RHYTH-mic。"]}
{"word":"antiars","summary":{"en":"Antiars are tropical poison trees (or the poison from their sap), historically linked to dart/arrow poisons.","zh":"Antiars 指一种热带毒树（或其树汁制成的毒药），历史上常与箭毒/吹箭毒相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of tropical tree (Antiaris toxicaria) whose sap contains a strong poison; also the poison made from its latex (often used on darts or arrows).","zh":"一种热带树（见于学名 Antiaris toxicaria，常译“见血封喉树/毒箭树”）及其乳汁所含的强毒；也可指由其乳汁制成的箭毒/吹箭毒。"},"examples":[{"en":"Early travelers wrote frightening stories about antiars and their deadly sap.","zh":"早期旅行者写过一些关于 antiars 及其致命树汁的可怕故事。"},{"en":"The hunter coated the dart with poison traditionally made from antiar sap.","zh":"猎人把飞镖涂上了传统上用 antiar 树汁制成的毒药。"}]}],"synonyms":["Antiaris","upas tree","arrow poison"],"phonetic":"/ænˈtiːɑrz/","extraExplanation":["“antiars”通常是“antiar”的复数；在较旧的英语资料里，它常和“upas tree（见血封喉树）”的传闻联系在一起。历史上欧洲人对这种树的描述夹杂了夸张与误传，但它的乳汁确实含有强心苷类毒性成分，东南亚一些地区曾用于箭毒或捕猎。"]}
{"word":"antiarthritic","summary":{"en":"“Antiarthritic” describes medicines or treatments that help prevent or treat arthritis.","zh":"antiarthritic 指“抗关节炎的”，常用来形容预防或治疗关节炎的药物或疗法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or used to prevent or treat arthritis (joint inflammation and pain).","zh":"抗关节炎的；用于预防或治疗关节炎（关节发炎与疼痛）的。"},"examples":[{"en":"The doctor prescribed an antiarthritic medication to reduce joint pain.","zh":"医生开了抗关节炎药物来减轻关节疼痛。"},{"en":"Some antiarthritic drugs can take weeks to show full benefit.","zh":"有些抗关节炎药物可能需要几周才能显现完整疗效。"}]}],"synonyms":["antirheumatic","arthritis-fighting"],"phonetic":"/ˌæn.ti.ɑrˈθrɪt̬.ɪk/","extraExplanation":["词形拆解有助记忆：anti-（反/抗）+ arthr-（关节，源自希腊语 arthron）+ -itic/-itic（与炎症相关）→ antiarthritic = “抗关节炎的”。","这是医学/药学用语，日常英语里更常说 “arthritis medicine/drug” 或直接说具体药名（如 NSAIDs、DMARDs 等类别名称）。"]}
{"word":"antiartistic","summary":{"en":"Antiartistic means opposed to art or artistic expression, or intentionally not aiming for an artistic look or style.","zh":"antiartistic 指“反艺术的”，可表示反对艺术/艺术表达，或刻意不追求艺术化的外观与风格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to art, artistic expression, or artistic values; showing dislike for art or artists.","zh":"反艺术的；反对艺术、艺术表达或艺术价值的；对艺术或艺术家抱有反感的。"},"examples":[{"en":"Some people call the policy antiartistic because it cuts funding for music and theater.","zh":"有人称这项政策“反艺术”，因为它削减了音乐和戏剧的经费。"},{"en":"His antiartistic comments upset the students in the art club.","zh":"他那些反艺术的言论让艺术社的学生很不开心。"},{"en":"The film uses an antiartistic style—plain, rough, and intentionally unglamorous.","zh":"这部电影采用一种反艺术的风格——朴素、粗粝、刻意不追求美化。"}]}],"synonyms":["anti-art","unartistic","philistine","anti-cultural"],"phonetic":"/ˌænti ɑrˈtɪstɪk/","extraExplanation":["“anti-”是英语里很常见的前缀，表示“反对、抵制”。因此 antiartistic 通常用来描述态度（反对艺术）或风格取向（刻意不追求“艺术感”）。","它不是特别常见的日常词；更常见、更自然的表达有 anti-art（反艺术的）、anti-artistic attitude（反艺术的态度）、not artistic（不够有艺术感）。","语境上要注意区分：antiartistic 可以是价值立场上的“反对艺术”，也可以只是美学选择上的“反精致、反装饰”。"]}
{"word":"antiascetic","summary":{"en":"Antiascetic means opposed to ascetic self-denial and more accepting of comfort and everyday pleasures.","zh":"antiascetic 指“反禁欲/反苦行”的，倾向认可舒适与日常乐趣，而非严格自我克制。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to asceticism; favoring comfort, pleasure, or ordinary enjoyment rather than strict self-denial.","zh":"反禁欲主义的；反对苦行/清修式自我克制的；倾向于享受舒适与生活乐趣的。"},"examples":[{"en":"His antiascetic attitude showed in his love of rich food and long vacations.","zh":"他反禁欲的态度体现在他喜欢美食和长假。"},{"en":"The novel celebrates an antiascetic view of life—music, friendship, and good wine.","zh":"这部小说赞美一种反禁欲的生活观——音乐、友谊和美酒。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who rejects ascetic practices or ideals.","zh":"反对禁欲/苦行的人；不认同清修式生活方式的人。"},"examples":[{"en":"As an antiascetic, she found the strict rules of the retreat unnecessary.","zh":"作为反禁欲者，她觉得静修营的严格规定没有必要。"}]}],"synonyms":["anti-ascetic","nonascetic","unascetic","hedonistic (stronger)","pleasure-loving"],"phonetic":"/ˌænti əˈsɛtɪk/","extraExplanation":["这个词较少见，更常见的写法是带连字符的 **anti-ascetic**。构词上是 **anti-（反对）+ ascetic（禁欲的、苦行的）**。","语境上它不一定等于“放纵/纵欲”（hedonistic），很多时候只是表示“不赞成把自我克制当作最高美德”，强调对日常快乐与舒适的认可。"]}
{"word":"antiasthma","summary":{"en":"Antiasthma means relating to medicine or treatment that prevents or relieves asthma; it can also mean an antiasthma drug.","zh":"antiasthma 指与预防或缓解哮喘相关的药物或治疗；也可指抗哮喘药物本身。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Used to describe medicine or treatment that helps prevent or relieve asthma symptoms.","zh":"用于描述可预防或缓解哮喘症状的药物或治疗（抗哮喘的）。"},"examples":[{"en":"The doctor prescribed an antiasthma inhaler for use during attacks.","zh":"医生开了一种抗哮喘吸入器，用于发作时使用。"},{"en":"Some antiasthma drugs reduce inflammation in the airways.","zh":"一些抗哮喘药物可以减轻气道炎症。"}]},{"partOfSpeech":"n.","definition":{"en":"An antiasthma drug or remedy.","zh":"抗哮喘药物；抗哮喘疗法。"},"examples":[{"en":"This syrup is marketed as an antiasthma for children.","zh":"这种糖浆以儿童抗哮喘药的名义销售。"},{"en":"Always ask a pharmacist before taking an antiasthma with other medicines.","zh":"在把抗哮喘药与其他药物同服前，务必先咨询药师。"}]}],"synonyms":["anti-asthma","asthma medication","asthma medicine","bronchodilator (type)","anti-inflammatory (related)"],"phonetic":"/ˌæntaɪˈæzmə/","extraExplanation":["“antiasthma”多见于医学或药品说明书中，日常英语里更常写作“anti-asthma”（加连字符）或直接说“asthma medication / asthma medicine”。","前缀“anti-”表示“对抗、抑制”，加在疾病名词前，常构成与治疗相关的形容词（如 anti-inflammatory 抗炎的）。"]}
{"word":"antiasthmatic","summary":{"en":"Antiasthmatic refers to something (especially a medicine) that prevents or relieves asthma, and it can also mean an asthma-treating drug.","zh":"Antiasthmatic 指用于预防或缓解哮喘的（尤指药物/治疗），也可作名词表示“抗哮喘药”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a medicine or treatment) used to prevent or relieve asthma symptoms by helping the airways open and reducing breathing difficulty.","zh":"（指药物或治疗）用于预防或缓解哮喘症状，帮助气道打开、减轻呼吸困难。"},"examples":[{"en":"The doctor prescribed an antiasthmatic inhaler for sudden wheezing.","zh":"医生开了一种抗哮喘吸入剂，用于突然喘鸣时使用。"},{"en":"Some antiasthmatic drugs relax the muscles around the airways.","zh":"一些抗哮喘药物可以放松气道周围的肌肉。"}]},{"partOfSpeech":"n.","definition":{"en":"An antiasthmatic drug; a medicine used to treat asthma.","zh":"抗哮喘药；用于治疗哮喘的药物。"},"examples":[{"en":"She keeps an antiasthmatic in her bag in case her symptoms return.","zh":"她包里常备抗哮喘药，以防症状复发。"},{"en":"Different antiasthmatics work in different ways, so follow your doctor’s instructions.","zh":"不同的抗哮喘药作用机制不同，所以要遵医嘱。"}]}],"synonyms":["asthma medication","bronchodilator (specific type)","anti-asthma"],"phonetic":"/ˌæn.ti.æzˈmæt.ɪk/","extraExplanation":["“anti-”表示“反、抗”，与“asthmatic（哮喘的）”组合形成“antiasthmatic（抗哮喘的/抗哮喘药）”。在医学语境中常用于描述吸入剂、支气管扩张剂或其他缓解哮喘的治疗。日常英语里更常说“asthma medicine/medication”或直接说具体药名（如inhaler）。"]}
{"word":"antiastronomical","summary":{"en":"Antiastronomical means “against astronomy” or “not consistent with astronomical standards.”","zh":"antiastronomical 指“反对天文学的”或“与天文学标准/解释不一致的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to astronomy or rejecting ideas, methods, or evidence from astronomy.","zh":"反对天文学的；否认或排斥天文学观点、方法或证据的。"},"examples":[{"en":"The article was criticized for its antiastronomical claims about the Moon.","zh":"这篇文章因其关于月球的反天文学说法而受到批评。"},{"en":"She avoided antiastronomical arguments and focused on observations and data.","zh":"她避开反天文学的论调，把重点放在观测和数据上。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not suitable for or inconsistent with astronomical standards, measurements, or explanations.","zh":"不符合天文学标准/测量/解释的；与天文学不一致的。"},"examples":[{"en":"Using that ruler for star positions would be antiastronomical and inaccurate.","zh":"用那把尺子来测恒星位置既不符合天文学要求，也不准确。"},{"en":"The model gives antiastronomical results, so the assumptions need to be checked.","zh":"这个模型得出的结果不符合天文学常识，所以需要检查它的假设。"}]}],"synonyms":["anti-astronomy","anti-scientific","contrary to astronomical evidence"],"phonetic":"/ˌæntiˌæstrəˈnɑmɪkəl/","extraExplanation":["这是一个非常少见的词，常见写法也会带连字符：anti-astronomical。","前缀 anti- 表示“反对/对立/抵制”。因此 antiastronomical 通常带有“反科学/反证据”的语气，尤其在讨论阴谋论或否认天文学发现时会出现。","在日常英语中更常用的表达是: anti-science（反科学的）、anti-astronomy（反天文学的，较少见）、contrary to astronomical evidence（与天文证据相悖）。"]}
{"word":"antiatheism","summary":{"en":"Anti-atheism: opposition to atheism; arguments or attitudes defending belief in God against atheism.","zh":"反无神论：反对无神论的立场；以论证或态度为有神信仰辩护、反驳无神论。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to atheism; the belief, movement, or attitude that argues against atheism or tries to defend belief in God (or gods) from atheist criticism.","zh":"反无神论；反对无神论的立场、运动或态度，通常旨在为对上帝（或诸神）的信仰辩护、反驳无神论观点。"},"examples":[{"en":"His book is a work of antiatheism that tries to answer common atheist arguments.","zh":"他的书是一部反无神论作品，试图回应常见的无神论论证。"},{"en":"In some debates, antiatheism focuses on defending faith rather than attacking atheists personally.","zh":"在一些辩论中，反无神论更侧重于捍卫信仰，而不是针对无神论者进行人身攻击。"}]}],"synonyms":["anti-atheism","opposition to atheism","arguments against atheism","defense of theism"],"phonetic":"/ˌæntaɪˈeɪθiˌɪzəm/","extraExplanation":["“antiatheism”在实际英语中比较少见，更常见的写法是带连字符的“anti-atheism”，或用更自然的表达：“opposition to atheism / arguments against atheism / defenses of theism”。","注意区分：antiatheism（反对无神论）不一定等同于theism（有神论）。一个人可能反对无神论，但在宗教立场上更复杂（例如不可知论者也可能反对某些无神论主张）。","在公共讨论中，用词上建议强调“ideas”而不是“people”，例如“arguments against atheism”往往比“antiatheist views”更中性、更容易被接受。"]}
{"word":"antiatheist","summary":{"en":"Anti-atheist/antiatheist means opposed to atheism or atheists; it can be an adjective or a noun.","zh":"antiatheist（也常写作 anti-atheist）指反对无神论或无神论者；可作形容词或名词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person, group, or attitude) strongly opposed to atheism or to atheists.","zh":"（指人、团体或态度）强烈反对无神论或无神论者的。"},"examples":[{"en":"Some online comments were openly antiatheist and mocked anyone who didn’t believe in God.","zh":"一些网络评论公开反无神论，嘲讽任何不信上帝的人。"},{"en":"The campaign used antiatheist language to suggest atheists could not be trusted.","zh":"这场运动使用反无神论的措辞，暗示无神论者不可信。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who is opposed to atheism or to atheists.","zh":"反对无神论或反对无神论者的人。"},"examples":[{"en":"He described himself as an antiatheist and argued that atheism harms society.","zh":"他称自己为反无神论者，并认为无神论会伤害社会。"},{"en":"In the discussion, atheists and antiatheists kept talking past each other.","zh":"在讨论中，无神论者和反无神论者一直各说各话。"}]}],"synonyms":["anti-atheist","opposed to atheism","anti-atheism (related)","anti-secular (sometimes related, but not the same)"],"phonetic":"/ˌæntaɪˈiːθiɪst/","extraExplanation":["这个词由前缀 anti-（“反对”）+ atheist（“无神论者”）构成，属于较少见、偏评论/社科语境的用法。更常见的表达包括 “anti-atheist”/“anti-atheism”（常写作带连字符的形式）。","使用时要注意语境与礼貌：它通常带有强烈立场色彩，可能被理解为对特定群体的不友善或偏见。"]}
{"word":"antiatheistic","summary":{"en":"“Anti-atheistic” means opposed to atheism or atheistic beliefs.","zh":"“antiatheistic”指“反对无神论或无神论观点的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to atheism or to atheistic beliefs; supporting the idea that belief in God (or gods) is important or correct.","zh":"反对无神论或无神论观点的；主张信神（或诸神）的信念更重要或更正确。"},"examples":[{"en":"The article took an antiatheistic tone and argued that faith can be reasonable.","zh":"这篇文章带有反无神论的语气，认为信仰也可以是理性的。"},{"en":"Some antiatheistic writers focus on responding to common atheist arguments.","zh":"一些反无神论的作者会专门回应常见的无神论论点。"}]}],"synonyms":["opposed to atheism","anti-atheist","anti-atheism","critical of atheism"],"phonetic":"/ˌæntiˌeɪθiˈɪstɪk/","extraExplanation":["“antiatheistic”由前缀 anti-（反对）+ atheistic（无神论的）构成，意思直观，但在日常英语里比较少见。更常见的表达是 “anti-atheist” 或 “opposed to atheism”。","注意语气：它通常出现在宗教、哲学或公共辩论的语境中。描述他人立场时，尽量保持中性，例如用 “critical of atheism / opposed to atheism” 以避免引发对立。"]}
{"word":"antiatheistical","summary":{"en":"“Anti atheistical” means “against atheism.”","zh":"antiatheistical 的意思是“反对无神论的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to atheism; arguing against the belief that no gods exist.","zh":"反对无神论的；主张反驳“没有神存在”这一信念的。"},"examples":[{"en":"The speaker gave an antiatheistical argument, claiming that the universe shows signs of design.","zh":"演讲者提出了一套反无神论的论证，声称宇宙呈现出被设计的迹象。"},{"en":"Some older religious writings use strongly antiatheistical language when discussing faith and doubt.","zh":"一些较早的宗教著作在讨论信仰与怀疑时，会使用强烈的反无神论措辞。"}]}],"synonyms":["anti-atheistic","anti-atheist","opposed to atheism"],"phonetic":"/ˌæntiˌeɪθiˈɪstɪkəl/","extraExplanation":["这个词非常少见，更多见的是 anti-atheist / anti-atheistic（反无神论的）或 theistic/apologetic writing（有神论/护教写作）。在正式写作中，通常用 “anti-atheistic arguments” 或 “arguments against atheism” 更自然。"]}
{"word":"antiatheistically","summary":{"en":"Anti atheistically means “in an anti-atheistic (against atheism) way.”","zh":"antiatheistically 意为“以反无神论（反对无神论）的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is opposed to atheism or argues against atheistic beliefs.","zh":"以反无神论的方式；以反对或批判无神论观点的方式。"},"examples":[{"en":"The speaker argued antiatheistically, claiming that belief in God is reasonable.","zh":"演讲者以反无神论的方式论证，声称相信上帝是合理的。"},{"en":"Some essays respond antiatheistically to modern secular ideas.","zh":"一些文章以反无神论的立场回应现代世俗观念。"}]}],"synonyms":["against atheism","in an anti-atheistic way","from an anti-atheist perspective"],"phonetic":"/ˌæn.tiˌeɪ.θiˈɪs.tɪ.kli/","extraExplanation":["这个词非常少见，通常出现在较正式或学术性的语境中。更常见的表达是：“in an anti-atheistic way / from an anti-atheist perspective / against atheism”。","构词上可拆为 anti-（反对）+ atheistic（无神论的）+ -ally（……地），意思就是“以反无神论的方式”。"]}
{"word":"antiatherosclerotic","summary":{"en":"Antiatherosclerotic means “working against atherosclerosis (plaque buildup in arteries).”","zh":"antiatherosclerotic 指“抗动脉粥样硬化的”，即对抗或预防动脉内斑块堆积。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"preventing, reducing, or working against atherosclerosis (the buildup of fatty plaques in arteries).","zh":"抗动脉粥样硬化的；用于预防、减轻或对抗动脉粥样硬化（动脉内脂质斑块堆积）的。"},"examples":[{"en":"Regular exercise and a healthy diet can have antiatherosclerotic effects.","zh":"规律运动和健康饮食可能具有抗动脉粥样硬化的作用。"},{"en":"Statins are widely studied for their antiatherosclerotic benefits.","zh":"他汀类药物因其抗动脉粥样硬化的益处而被广泛研究。"}]}],"synonyms":["anti-atherosclerotic","anti-atherogenic","atheroprotective"],"phonetic":"/ˌæn.taɪ.əˌθɪr.oʊ.skliˈrɑː.tɪk/","extraExplanation":["这是一个医学/科研用语，常见于论文或药品说明中；日常英语里更常说“helps prevent plaque buildup / reduces atherosclerosis risk（有助于预防斑块堆积/降低动脉粥样硬化风险）”。","构词：anti-（反/抗）+ atherosclerotic（动脉粥样硬化的）。有时也会写作 anti-atherosclerotic（加连字符），意思相同。","动脉粥样硬化与“斑块（plaque）”“胆固醇（cholesterol）”“动脉（artery）”等词经常一起出现，理解这些搭配有助于读医学文章。"]}
{"word":"antiatom","summary":{"en":"An antiatom is an atom made of antimatter.","zh":"antiatom 指“由反物质构成的原子（反原子）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An atom made of antimatter, with an antinucleus (made of antiprotons and antineutrons) and orbiting positrons (anti-electrons).","zh":"由反物质组成的原子：含有由反质子和反中子构成的反原子核，并由正电子（反电子）环绕。"},"examples":[{"en":"Scientists have produced antiatoms in particle accelerators for short periods of time.","zh":"科学家在粒子加速器中曾短暂制备出反原子。"},{"en":"If an antiatom touches a normal atom, they annihilate and release energy.","zh":"如果反原子接触到普通原子，它们会发生湮灭并释放能量。"}]}],"synonyms":["antimatter atom","anti-atom"],"phonetic":"/ˌæn.tiˈæt.əm/","extraExplanation":["“anti-”表示“相反的/对立的”，因此antiatom就是“由反物质构成的原子”。在科普与新闻中更常见的说法是“antimatter atom”或更具体的“antihydrogen（反氢）”。","反原子在实验中通常需要用电磁场“困住”（例如在磁阱中），因为一旦接触普通物质就会立即湮灭。","“antiatom”属于物理学术语，日常英语中很少使用；写作时可根据读者选择更常见的表达。"]}
{"word":"antiatoms","summary":{"en":"“Antiatoms” are atoms made of antimatter (the plural of antiatom).","zh":"“antiatoms”是“antiatom（反原子）”的复数，指由反物质组成的原子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An atom made of antimatter: it has an antiproton and, usually, one or more positrons (the antimatter versions of protons and electrons).","zh":"由反物质组成的原子：含有反质子，并通常带有一个或多个正电子（分别是质子与电子的反物质对应物）。"},"examples":[{"en":"Scientists have created and trapped antiatoms for a short time in laboratory experiments.","zh":"科学家在实验室实验中成功制造并短暂捕获了反原子。"},{"en":"If an antiatom touches ordinary matter, they can annihilate each other and release energy.","zh":"如果反原子接触普通物质，二者可能会发生湮灭并释放能量。"}]}],"synonyms":["antiatoms (plural form)","antimatter atoms"],"phonetic":"/ˈæntiˌætəm/","extraExplanation":["“antiatom”常见于科普与粒子物理语境，最常见的例子是“antihydrogen（反氢）”，由一个反质子和一个正电子组成。","反原子之所以难以研究，是因为它们一旦接触到容器壁等普通物质就会湮灭；因此实验上常用电磁场（磁阱）在真空中“悬浮”并隔离它们。","在英语里，anti- 是表示“反、相对”的前缀；antiatom 的复数是 antiatoms。"]}
{"word":"antiatonement","summary":{"en":"Anti-atonement: opposition to (or rejecting) the doctrine or language of atonement, mainly in Christian theology.","zh":"antiatonement：主要用于基督教神学中，指反对或否定“赎罪/代赎”教义或相关话语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to the idea of atonement (the belief that wrongdoing can be “made right,” often through sacrifice or reconciliation), especially in Christian theology.","zh":"反对“赎罪/救赎”（认为过错可以被“补偿、弥补”，在基督教神学中常与牺牲或和好有关）的观点。"},"examples":[{"en":"Some critics describe his argument as antiatonement because it rejects the idea that guilt can be removed by sacrifice.","zh":"一些批评者把他的论证称为“反赎罪论”，因为它否认“牺牲可以消除罪责”的观念。"},{"en":"The essay takes an antiatonement stance and focuses on personal responsibility rather than divine payment for sin.","zh":"这篇文章采取反赎罪的立场，强调个人责任，而不是“神为罪付代价”的观念。"}]},{"partOfSpeech":"adj.","definition":{"en":"Against atonement; rejecting the doctrine or language of atonement (often used before a noun).","zh":"反赎罪的；反对赎罪教义或赎罪话语的（常作定语修饰名词）。"},"examples":[{"en":"The author’s antiatonement theology challenges traditional teachings about salvation.","zh":"作者的反赎罪神学挑战了关于救赎的传统教导。"},{"en":"They criticized what they called antiatonement rhetoric in the debate.","zh":"他们批评辩论中所谓的“反赎罪”言论。"}]}],"synonyms":["anti-atonement","opposition to atonement","non-atonement (context-dependent)"],"phonetic":"/ˌæntiəˈtoʊnmənt/","extraExplanation":["这个词通常写作 **anti-atonement**（加连字符更常见），多出现在神学论文、宗教史研究或教义争论中，日常英语里很少用。","**atonement** 在基督教语境里常指“基督为人的罪作出补赎/替代性牺牲、使人与上帝和好”的教义；因此 **antiatonement** 往往指反对这类“代赎、补偿式赎罪”理解的人或观点（并不一定反对‘和好/修复关系’这一更宽泛的意义）。"]}
{"word":"antiattrition","summary":{"en":"Antiattrition means intended to prevent or reduce attrition, especially employee turnover.","zh":"antiattrition 指“防流失的”，尤指用于降低员工离职率。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to prevent or reduce attrition (people leaving a job, program, or organization), especially employee turnover.","zh":"用于防止或减少“流失”（如员工离职、项目参与者退出等），尤指降低员工离职率。"},"examples":[{"en":"The company introduced antiattrition bonuses to keep experienced engineers from leaving.","zh":"公司推出了防流失奖金，以留住有经验的工程师。"},{"en":"An antiattrition strategy often includes better pay, clearer career paths, and supportive management.","zh":"防流失策略通常包括更好的薪酬、更清晰的晋升路径以及更支持性的管理。"}]}],"synonyms":["retention","anti-turnover","employee-retention","turnover-reducing"],"phonetic":"/ˌæn.ti.əˈtrɪʃ.ən/","extraExplanation":["这个词在商业与人力资源（HR）语境中更常见，通常写作 anti-attrition（加连字符）也很常见，意思是“反流失/防流失”的政策、措施或方案。","attrition 在职场里多指员工自然流失或离职；在其他领域也可指“损耗/消耗”（例如资源或兵力的逐渐减少），antiattrition 也可相应表示“减少损耗”。"]}
{"word":"antiauthoritarian","summary":{"en":"Antiauthoritarian means opposing authoritarian control and favoring freedom and limits on power.","zh":"Antiauthoritarian 指反对威权控制，主张自由与对权力的制衡。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to authoritarian power, strict top-down control, or leaders who demand obedience without accountability; supportive of individual freedom and democratic limits on power.","zh":"反对威权统治或强硬的自上而下控制；支持个人自由与对权力的民主制衡。"},"examples":[{"en":"Many students in the movement held strongly antiauthoritarian views and demanded more transparency.","zh":"运动中的许多学生立场强烈反威权，并要求更高的透明度。"},{"en":"Her antiauthoritarian attitude makes her question rules that seem unfair or arbitrary.","zh":"她的反威权态度让她会质疑那些看起来不公平或武断的规定。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who holds antiauthoritarian beliefs.","zh":"持反威权观点的人；反对威权的人。"},"examples":[{"en":"As an antiauthoritarian, he distrusts leaders who concentrate power in one office.","zh":"作为反威权者，他不信任把权力集中在一个职位上的领导人。"}]}],"synonyms":["anti-authoritarian","libertarian (sometimes, depending on context)","democratic","anti-totalitarian"],"phonetic":"/ˌæn.ti.əˌθɔːr.əˈter.i.ən/","extraExplanation":["“antiauthoritarian”常用于政治与社会语境，描述反对“权力高度集中、压制异议、要求无条件服从”的制度或作风。它不一定等同于“反对所有规则”，更常见的含义是主张权力要被监督、决策要更透明、个人权利要被尊重。","相关概念可对比：authoritarian（威权的）强调服从与集中控制；antiauthoritarian（反威权的）强调分权、问责与公民自由。"]}
{"word":"antiauthoritarianism","summary":{"en":"Antiauthoritarianism is opposition to authoritarian power and blind obedience, favoring limits on authority and protection of rights.","zh":"反威权主义指反对威权力量与盲目服从，主张限制权力并保护权利。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to authoritarian rule or to the idea that people should obey leaders without question; support for limiting concentrated power and protecting individual freedoms.","zh":"反对威权统治或反对“必须无条件服从权威”的观念；主张限制权力过度集中、保护个人自由。"},"examples":[{"en":"Her antiauthoritarianism made her suspicious of leaders who demanded loyalty above all else.","zh":"她的反威权主义让她对那些要求“忠诚高于一切”的领导者保持警惕。"},{"en":"The movement’s antiauthoritarianism shaped its focus on free speech and civil rights.","zh":"这场运动的反威权主义塑造了它对言论自由与公民权利的重视。"},{"en":"In class discussions, he expressed antiauthoritarianism by questioning unfair rules respectfully.","zh":"在课堂讨论中，他以尊重的方式质疑不公平的规定，表达了反威权主义。"}]}],"synonyms":["anti-authoritarianism","opposition to authoritarianism","anti-tyranny sentiment","anti-dictatorship stance"],"phonetic":"/ˌænti əˌθɔrɪˈtɛriəˌnɪzəm/","extraExplanation":["“antiauthoritarianism”常用于政治与社会讨论，强调反对把权力集中在少数人手中，以及反对以恐惧、审查、强制服从来治理社会。","它不一定等同于“反对一切权威”。很多反威权者接受合理的规则与公共机构，但主张权力应受法律、监督与公民权利的约束。","词形结构：anti-（反对）+ authoritarian（威权的）+ -ism（主义/思想）。","在文学与文化语境中，它常与反压迫、反审查、反独裁等主题一起出现，也可能与“libertarianism（自由意志主义）”“anarchism（无政府主义）”等概念相邻，但含义与立场并不完全相同。"]}
{"word":"antiautolysin","summary":{"en":"Antiautolysin means a substance (often an antibody) that blocks an autolysin and prevents self-lysis.","zh":"Antiautolysin 指抑制自溶素、阻止细胞自溶的物质（常为抗体）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An antibody or other substance that inhibits an autolysin (an enzyme that can break down a cell’s own wall or tissues), thereby preventing self-lysis (self-digestion) of the cell.","zh":"抗自溶素；指能抑制自溶素（可分解细胞自身细胞壁或组织的酶）的抗体或物质，从而防止细胞发生自溶（自我分解）。"},"examples":[{"en":"Researchers tested an antiautolysin to see whether it could reduce bacterial self-lysis in culture.","zh":"研究人员测试了一种抗自溶素，观察它是否能减少培养条件下细菌的自溶。"},{"en":"In theory, an antiautolysin could change how quickly cells break down after death or injury.","zh":"理论上，抗自溶素可能会改变细胞在死亡或损伤后分解的速度。"}]}],"synonyms":["autolysin inhibitor","anti-autolysin antibody","autolysin-blocking antibody"],"phonetic":"ˌæn.tiˌɔ.toʊˈlaɪ.sɪn","extraExplanation":["这个词非常少见，更多出现在早期免疫学/细菌学文献里。构词上是 anti-（反、抑制）+ autolysin（自溶素）。在细菌中，autolysin 常指参与细胞壁重塑、分裂的酶；抑制它可能影响细胞分裂或导致细胞壁相关变化。","现代写作中更常用更直观的说法，如 “autolysin inhibitor（自溶素抑制剂）” 或 “antibody against autolysin（针对自溶素的抗体）”。"]}
{"word":"antiauxin","summary":{"en":"An antiauxin is a substance that blocks or opposes the plant hormone auxin.","zh":"antiauxin 指“抗生长素”，即阻断或对抗植物激素生长素作用的物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance (natural or synthetic) that counteracts or blocks the action of auxin, a plant growth hormone, thereby reducing or preventing auxin-driven growth responses.","zh":"抗生长素；一种（天然或合成的）物质，用来对抗或阻断植物生长素（auxin）的作用，从而减弱或阻止由生长素引发的生长反应。"},"examples":[{"en":"Researchers applied an antiauxin to test whether auxin was responsible for the bending of the seedlings.","zh":"研究人员施用抗生长素，以检验幼苗弯曲是否由生长素引起。"},{"en":"An antiauxin can reduce root formation by interfering with auxin signaling.","zh":"抗生长素可以通过干扰生长素信号来减少生根。"}]}],"synonyms":["auxin antagonist","auxin inhibitor"],"phonetic":"/ˌæn.tiˈɔk.sɪn/","extraExplanation":["“Auxin（生长素）”是植物体内重要的生长调节物质，参与向光性、顶端优势、生根等过程；“antiauxin（抗生长素）”常用于植物生理学实验，用来验证某个生长现象是否由生长素介导。","词形结构：anti-（反、抗）+ auxin（生长素）。在科研写作中也可作形容词使用（如 antiauxin compound/antiauxin effect），但最常见用法是名词指“抗生长素类物质”。"]}
{"word":"antiavoidance","summary":{"en":"Antiavoidance refers to rules or measures meant to prevent people from sidestepping regulations—most commonly tax laws—through loopholes or artificial arrangements.","zh":"antiavoidance 指为防止通过漏洞或人为安排来规避规则（最常见是税法）而制定的反规避措施或条款。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to stop people or companies from avoiding a rule (especially a tax rule) by using loopholes or artificial arrangements.","zh":"为防止个人或公司通过漏洞或人为安排来规避规则（尤指税法）而设立的；反规避的。"},"examples":[{"en":"The new antiavoidance rule targets transactions that exist mainly to reduce tax.","zh":"新的反规避规则针对那些主要目的是减税的交易。"},{"en":"Companies must document their structure to show it isn’t an antiavoidance scheme.","zh":"公司必须记录其架构，以证明这不是一种反规避所针对的规避方案。"}]},{"partOfSpeech":"n.","definition":{"en":"A rule, law, or policy intended to prevent avoidance of regulations, especially tax avoidance.","zh":"（尤指税务）反规避条款/反规避规则：用来防止规避监管的法律或政策。"},"examples":[{"en":"The court applied an antiavoidance provision to deny the claimed benefit.","zh":"法院适用反规避条款，否定了所主张的优惠。"},{"en":"Antiavoidance is a core concept in modern tax systems.","zh":"反规避是现代税制中的核心概念。"}]}],"synonyms":["anti-avoidance","anti-abuse","anti-circumvention","anti-tax-avoidance"],"phonetic":"/ˌæn.ti.əˈvɔɪ.dəns/","extraExplanation":["“antiavoidance”多见于税法与合规语境，常与 GAAR（General Anti-Avoidance Rule，一般反避税规则）或 SAAR（Specific Anti-Avoidance Rule，特定反避税规则）一起出现。其核心是：即使形式上符合条文，只要交易的主要目的在于获取不当税收利益、缺乏真实商业目的，税务机关或法院也可能重新定性。","拼写上也常写作“anti-avoidance”（带连字符）。在英美法律写作中，“avoidance”（避税/规避）通常指利用规则漏洞的合法或灰色安排；而“evasion”（逃税）是违法行为。"]}

