{"word":"Antikamnia","summary":{"en":"Antikamnia is a historical U.S. brand name for an old-fashioned pain-relief medicine.","zh":"Antikamnia 是美国早期一种止痛药的商标名，带有明显的历史年代感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand name for an early (late 1800s–early 1900s) proprietary pain-relief medicine, sold mainly in the U.S.; it was typically used for headaches and other aches and pains","zh":"（Antikamnia）一种早期（19世纪末至20世纪初）在美国流行的止痛药商标名，常用于缓解头痛及其他疼痛"},"examples":[{"en":"In some U.S. medical history exhibits, you can still see old Antikamnia tablets and advertisements.","zh":"在一些美国医学史展览中，你仍能看到旧时的 Antikamnia 药片和广告。"},{"en":"The novel mentioned a character taking Antikamnia for a headache, which helps date the story to the early 1900s.","zh":"小说里提到角色用 Antikamnia 治头痛，这个细节能帮助读者把故事年代定位在20世纪初。"}]}],"synonyms":["(historical) proprietary analgesic","(historical) patent medicine"],"phonetic":"/ˌæn.tiˈkæm.ni.ə/","extraExplanation":["Antikamnia 来自希腊语元素 anti-（“反、对抗”）+ kamnia（与“疼痛”相关的构词），字面可理解为“对抗疼痛”。","它是“专利药/成药（patent medicine）”时代的代表性产品之一，早期配方常含乙酰苯胺（acetanilide）及咖啡因等成分；后来因安全性与监管加强，这类配方逐渐被更安全的止痛药取代。","在阅读历史文本或看老广告时，Antikamnia 往往不仅指“止痛药”，也带有“旧式药品营销文化”的时代感。"]}
{"word":"antikamnia","summary":{"en":"Antikamnia is a historical U.S. brand name for a patented pain-relief medicine.","zh":"Antikamnia 是美国历史上一个专利止痛药的品牌名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former brand name for a patent pain-relief medicine (an analgesic), popular in the late 1800s and early 1900s in the U.S.","zh":"（美国）旧时的一种止痛药专利品牌名，19世纪末到20世纪初较流行。"},"examples":[{"en":"The museum display included an Antikamnia advertisement from the 1890s.","zh":"博物馆展柜里有一张19世纪90年代的 Antikamnia 广告。"},{"en":"In that novel, a character reaches for Antikamnia to ease a headache.","zh":"在那部小说里，有个角色拿起 Antikamnia 来缓解头痛。"}]}],"synonyms":["painkiller","analgesic","patent medicine"],"phonetic":"ˌæn.tiˈkæm.ni.ə","extraExplanation":["Antikamnia 是历史上的“专利药（patent medicine）”之一，常以夸张广告宣传“快速止痛”。它的配方在不同时期有所变化，曾含有当时常见的镇痛成分（例如 acetanilide 一类），后来因安全性与监管加强等原因逐渐退出主流。","词形上常被解释为由 anti-（“反/对抗”）加上与“疼痛/疲劳”相关的希腊语词根构成，用来传达“对抗疼痛”的含义。"]}
{"word":"antikathode","summary":{"en":"An anticathode is the target/anode in an X‑ray tube that electrons hit to generate X‑rays.","zh":"反阴极是 X 射线管中被电子束轰击、用来产生 X 射线的靶（阳极）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(physics) The target electrode in an X‑ray tube that is hit by the cathode-ray (electron) beam; effectively the anode (positive electrode).","zh":"（物理）X 射线管中被阴极射线（电子束）轰击的靶电极；实质上就是阳极（正极）。"},"examples":[{"en":"In a simple X‑ray tube, electrons from the cathode strike the anticathode and produce X‑rays.","zh":"在简单的 X 射线管中，来自阴极的电子撞击反阴极并产生 X 射线。"},{"en":"Cooling the anticathode helps prevent overheating during high-power operation.","zh":"在高功率工作时给反阴极散热有助于防止过热。"}]}],"synonyms":["anticathode","anode (in an X-ray tube)","target","target anode"],"phonetic":"/ˌæn.tiˈkæθ.oʊd/","extraExplanation":["“antikathode”常见拼写是 **anticathode**（反阴极）。它之所以叫“反阴极”，是因为它位于与阴极相对、用来承受电子束轰击的位置。","在现代术语里，很多教材更直接用 **anode**（阳极/靶）来称呼这一部件；在 X 射线管语境下，anticathode ≈ target anode（靶阳极）。"]}
{"word":"antikenotoxin","summary":{"en":"Antikenotoxin is a rare, historical term for something believed to counteract a proposed “fatigue toxin” (kenotoxin).","zh":"Antikenotoxin 是一个罕见的历史用语，指被认为能对抗一种假设的“疲劳毒素（kenotoxin）”的物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a (rare, mostly historical) substance—especially an antiserum—thought to neutralize or counteract a “kenotoxin” (a proposed fatigue-producing toxin).","zh":"（罕见，多见于历史文献）一种被认为能中和或对抗“kenotoxin（疲劳毒素）”的物质，尤其指抗血清。"},"examples":[{"en":"In early physiology writing, some researchers mentioned an antikenotoxin that could reduce signs of fatigue.","zh":"在早期生理学著作中，有研究者提到一种 antikenotoxin，认为它能减轻疲劳表现。"},{"en":"The term antikenotoxin is rarely used in modern medical English.","zh":"antikenotoxin 这个词在现代医学英语中很少使用。"}]}],"synonyms":["antitoxin","antiserum"],"phonetic":"ˌæntiˌkinoʊˈtɑksɪn","extraExplanation":["这个词不是现代英语里的常用词，通常出现在早期（19—20世纪初）关于“疲劳是否由某种毒素引起”的理论讨论中。","词形可以拆开理解：anti-（反、抗）+ keno-（源自希腊语 *kenos*，意为“空、匮乏”，在相关理论里借来命名“kenotoxin”）+ toxin（毒素）。","现代科学语境中更常见的相关词是 **antitoxin**（抗毒素，泛指中和细菌毒素的抗体/血清）或针对蛇毒等的 **antivenom**。"]}
{"word":"antiketogen","summary":{"en":"Antiketogen means “antiketogenic”—it prevents or reduces ketone production in the body.","zh":"antiketogen 指“抗生酮的”，即防止或减少人体产生酮体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medicine) Preventing or reducing the production of ketone bodies (ketogenesis); helping stop ketosis.","zh":"（医学）抗生酮的；抑制或减少酮体生成（酮生成），帮助防止酮症/酮酸中毒的。"},"examples":[{"en":"In diabetic ketoacidosis, insulin is an antiketogenic hormone because it stops the body from making ketones.","zh":"在糖尿病酮症酸中毒中，胰岛素是一种抗生酮激素，因为它会阻止机体生成酮体。"},{"en":"Doctors may give glucose as an antiketogenic measure when the body is breaking down too much fat for energy.","zh":"当身体过度分解脂肪供能时，医生可能会给予葡萄糖作为抗生酮的措施。"}]}],"synonyms":["antiketogenic","anti-ketogenic"],"phonetic":"/ˌæntiˈkiːtoʊdʒən/","extraExplanation":["“antiketogen/antiketogenic”多见于医学或生理学语境，尤其与糖尿病、饥饿状态、代谢紊乱相关。与之相对的概念是“ketogenic（生酮的）”。","词形拆解：anti-（反、抗）+ keto-（酮/与酮体相关）+ -gen（产生、生成）。因此含义直观：抑制或阻止酮体的生成。","常见搭配：antiketogenic effect（抗生酮作用）、antiketogenic hormone（抗生酮激素，常指胰岛素）、antiketogenic therapy/measure（抗生酮治疗/措施）。"]}
{"word":"antiketogenesis","summary":{"en":"Antiketogenesis means inhibiting the body’s production of ketone bodies (ketogenesis).","zh":"Antiketogenesis 指抑制身体产生酮体（酮体生成）的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the prevention or inhibition of ketogenesis (the body’s production of ketone bodies, mainly in the liver)","zh":"抗酮体生成；抑制酮体生成（指阻止或降低身体——主要是肝脏——产生酮体的过程）"},"examples":[{"en":"Insulin has an antiketogenesis effect because it suppresses the liver’s production of ketone bodies.","zh":"胰岛素具有抗酮体生成作用，因为它会抑制肝脏产生酮体。"},{"en":"In diabetic ketoacidosis, restoring antiketogenesis is a key treatment goal.","zh":"在糖尿病酮症酸中毒中，恢复抗酮体生成是治疗的重要目标。"}]}],"synonyms":["inhibition of ketogenesis","anti-ketogenic effect"],"phonetic":"/ˌæn.taɪˌkiː.toʊˈdʒɛn.ə.sɪs/","extraExplanation":["词形拆解有助记忆：anti-（反、抑制）+ keto-（酮/酮体）+ genesis（生成）。","相关概念对比：ketogenesis（酮体生成）是正常代谢的一部分（如饥饿、低碳饮食时会增加）；antiketogenesis指让这一过程“降下来”，临床上常见于胰岛素或摄入足够碳水后。","注意它不是日常英语词汇，多见于医学/生理学/药理学论文或教材。"]}
{"word":"antiketogenic","summary":{"en":"Antiketogenic means “reducing or preventing ketone production in the body.”","zh":"antiketogenic 指“减少或预防体内酮体生成（抗生酮）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medicine, nutrition) Preventing or reducing the formation of ketone bodies (ketogenesis) in the body.","zh":"（医学/营养）抗生酮的；能预防或减少体内酮体生成（生酮作用）的。"},"examples":[{"en":"Insulin has an antiketogenic effect because it suppresses ketone production.","zh":"胰岛素具有抗生酮作用，因为它能抑制酮体生成。"},{"en":"Doctors may use antiketogenic treatment to help manage diabetic ketoacidosis.","zh":"医生可能会用抗生酮治疗来帮助处理糖尿病酮症酸中毒。"},{"en":"Some carbohydrates are described as antiketogenic because they reduce ketosis.","zh":"有些碳水化合物被称为抗生酮的，因为它们能减少酮症。"}]}],"synonyms":["anti-ketogenic","antiketonemic","ketogenesis-inhibiting"],"phonetic":"/ˌæn.tiˌkiː.təˈdʒɛn.ɪk/","extraExplanation":["“anti-”表示“反/抗”，“ketogenic”表示“生酮的”（产生酮体）。因此 antiketogenic 直译就是“抗生酮的”。","该词多见于医学与营养学语境，常与“diabetic ketoacidosis（糖尿病酮症酸中毒）”“insulin（胰岛素）”“ketone bodies（酮体）”“ketosis（酮症）”一起出现。","在代谢学里，葡萄糖供能充足、胰岛素作用足够时，通常更“抗生酮”；而饥饿、极低碳饮食或胰岛素不足时更容易“生酮”。"]}
{"word":"antiketonemic","summary":{"en":"Antiketonemic means “reducing or preventing ketones in the blood.”","zh":"Antiketonemic 指“降低或预防血液中酮体升高（酮血症）的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medical) Preventing or reducing ketones in the blood (ketonemia), often by improving the body’s use of glucose and lowering fat breakdown.","zh":"（医学）抗酮血症的；用于预防或降低血液中的酮体（酮血症），通常通过改善葡萄糖利用、减少脂肪分解来实现。"},"examples":[{"en":"Insulin has an antiketonemic effect in people with uncontrolled diabetes.","zh":"在糖尿病控制不佳的人群中，胰岛素具有抗酮血症作用。"},{"en":"The doctor explained that the treatment is antiketonemic and helps stop dangerous ketoacidosis.","zh":"医生解释说，这种治疗具有抗酮血症作用，有助于阻止危险的酮症酸中毒。"}]}],"synonyms":["antiketogenic","ketone-lowering","anti-ketotic"],"phonetic":"/ˌæn.taɪˌkiː.toʊˈniː.mɪk/","extraExplanation":["这个词多见于医学或药理学语境，日常英语里很少用。常见相关场景包括糖尿病（尤其是胰岛素不足时）导致酮体升高；具“antiketonemic”作用的措施/药物通常能抑制酮体生成，从而降低发生酮症酸中毒（ketoacidosis）的风险。","词形上可拆解为 anti-（反、抗）+ keton(e)（酮/酮体）+ -emic（与血液有关的，类似于 “anemic/ischemic” 里的 -emic）。"]}
{"word":"antikinase","summary":{"en":"Antikinase means a kinase inhibitor, or something that acts against kinase enzymes.","zh":"Antikinase 指激酶抑制剂，或“抗/抑制激酶”的作用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance (especially a drug) that blocks or reduces the activity of a kinase enzyme; a kinase inhibitor.","zh":"（尤指药物）抑制或阻断激酶（kinase）酶活性的物质；激酶抑制剂。"},"examples":[{"en":"Some cancer treatments use antikinase drugs to slow down abnormal cell growth.","zh":"一些癌症治疗会使用抗激酶药物来减缓异常细胞生长。"},{"en":"The lab tested an antikinase compound to see whether it could stop the signaling pathway.","zh":"实验室测试了一种抗激酶化合物，看看它是否能阻断该信号通路。"}]},{"partOfSpeech":"adj.","definition":{"en":"acting against kinases; inhibiting kinase activity.","zh":"抗激酶的；抑制激酶活性的。"},"examples":[{"en":"Researchers reported an antikinase effect at low doses.","zh":"研究人员报告称在低剂量下出现了抗激酶作用。"},{"en":"They designed antikinase therapy for patients with this mutation.","zh":"他们为携带这种突变的患者设计了抗激酶治疗方案。"}]}],"synonyms":["kinase inhibitor","anti-kinase agent","kinase-blocking drug"],"phonetic":"/ˌæntiˈkaɪneɪs/","extraExplanation":["“antikinase”更常见的写法是带连字符的“anti-kinase”，在医学与药理语境里通常指“激酶抑制剂”（kinase inhibitor）。激酶是一类通过“磷酸化”来调控细胞信号的酶；当这些信号过度活跃（如某些癌症），抑制激酶就可能帮助控制疾病。","相关常见表达：kinase inhibitor（激酶抑制剂）、targeted therapy（靶向治疗）、signal transduction pathway（信号转导通路）。"]}
{"word":"antiking","summary":{"en":"An antiking is a rival king set up to oppose the recognized monarch during a disputed reign.","zh":"antiking 指在王位争议中被拥立来对抗公认君主的“对立国王／反王”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rival claimant to a throne chosen or supported in opposition to the recognized king (often during a civil conflict or disputed succession)","zh":"在内战或继承争议中，被推举来对抗公认君主的“对立国王／反王”（与现任或公认国王相对的王位竞争者）"},"examples":[{"en":"During the succession crisis, the nobles backed an antiking to challenge the reigning monarch.","zh":"在继承危机中，贵族们支持一位“反王”来挑战在位君主。"},{"en":"The kingdom was split between the king’s supporters and those loyal to the antiking.","zh":"王国在国王的支持者与效忠反王的人之间分裂了。"},{"en":"Some chronicles call him an antiking because he was crowned by a rival faction.","zh":"一些编年史称他为“反王”，因为他是被对立派系加冕的。"}]}],"synonyms":["rival king","counter-king","pretender (to the throne)"],"phonetic":"ˈæntiˌkɪŋ","extraExplanation":["“antiking”常写作“anti-king”，在历史语境里更常见于中世纪与神圣罗马帝国相关的王位争夺（德语常用对应概念Gegenkönig，意为“对立国王”）。它通常不是泛指“反对君主制的人”，而是指具体的“对立加冕者／竞争君主”。","与“usurper（篡位者）”不同：antiking强调“有另一套拥立体系与政治阵营、与现王并立竞争”；而usurper强调“非法夺权”的评价色彩，未必存在并立的另一位“公认国王”。"]}
{"word":"antikings","summary":{"en":"Antikings are rival claimants set up to oppose a reigning king.","zh":"Antikings 指被拥立来反对在位国王、争夺王位的对立国王。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rival or opposing claimant to the throne, set up against a reigning king (plural: antikings).","zh":"（与在位国王对立的）对立国王／对抗国王；被拥立来与现任国王竞争王位的人（复数：antikings）。"},"examples":[{"en":"During the civil war, nobles backed two antikings at the same time.","zh":"在内战期间，贵族同时支持了两位对立国王。"},{"en":"He was declared an antiking by a faction that rejected the current ruler.","zh":"由于某个派系拒绝承认现任统治者，他被宣布为对立国王。"}]}],"synonyms":["rival king","pretender","counter-king","claimant","usurper (sometimes)"],"phonetic":"/ˌæntiˈkɪŋ/","extraExplanation":["“antiking”常用于欧洲中世纪史语境，尤其与德语“Gegenkönig”（对立国王）概念接近：当部分选侯或贵族不承认既定君主时，会另立一位“国王”与之竞争合法性。","词形结构：anti-（反对、对立）+ king（国王）。现代英语中不算常用词，多见于历史写作、学术讨论或严肃叙述文体。"]}
{"word":"Antikleia","summary":{"en":"Antikleia is a figure in Greek mythology, best known as Odysseus’s mother in Homer’s *Odyssey*.","zh":"Antikleia（安提克勒亚）是希腊神话人物，最著名的身份是荷马《奥德赛》中奥德修斯的母亲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology (especially Homer’s *Odyssey*), the mother of Odysseus (Ulysses), wife of Laertes.","zh":"希腊神话人物（尤其见于《奥德赛》）：奥德修斯（Odysseus/尤利西斯）的母亲，拉厄耳忒斯（Laertes）的妻子。"},"examples":[{"en":"In the *Odyssey*, Odysseus meets Antikleia in the Underworld.","zh":"在《奥德赛》中，奥德修斯在冥界遇见了安提克勒亚。"},{"en":"Antikleia tells her son that she died from grief while he was away.","zh":"安提克勒亚告诉儿子，她在他离家期间因悲伤而去世。"}]}],"synonyms":["Anticleia"],"phonetic":"/ˌæn.tɪˈkliː.ə/","extraExplanation":["“Antikleia”常见于英文古典文学与神话研究中，是希腊语专名的拉丁字母转写；在不同译名体系里也可能写作“Anticleia”。","在《奥德赛》第11卷（“冥府之行”）中，她的出场具有强烈的情感与叙事功能：通过母亲之口交代伊萨卡（Ithaca）家中近况，也强化了英雄长期漂泊带来的代价。"]}
{"word":"antiknock","summary":{"en":"Antiknock means preventing engine knock; it can also refer to an additive put in gasoline to reduce knock.","zh":"Antiknock 指“防爆震的”，也可指加入汽油中用来减少爆震的添加剂。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of gasoline or an additive) preventing or reducing engine “knock” (a knocking/pinging sound caused by uncontrolled early burning in the engine).","zh":"（汽油或添加剂）防爆震的；用于减少或防止发动机“爆震/敲缸”（因燃烧过早或不受控而产生的敲击/爆鸣声）。"},"examples":[{"en":"This fuel contains antiknock additives to help the engine run smoothly.","zh":"这种燃料含有防爆震添加剂，能让发动机运转更平稳。"},{"en":"High-octane gas has better antiknock performance.","zh":"高辛烷值汽油的抗爆震性能更好。"}]},{"partOfSpeech":"n.","definition":{"en":"A substance added to gasoline to reduce engine knock.","zh":"防爆震剂；（加入汽油中以减少爆震的）添加剂。"},"examples":[{"en":"In the past, lead compounds were used as antiknock agents, but they are now restricted for health and environmental reasons.","zh":"过去曾用含铅化合物作防爆震剂，但出于健康与环保原因如今已被限制。"},{"en":"Modern refineries use different antiknock chemicals to meet emissions standards.","zh":"现代炼油厂使用不同的防爆震化学品以满足排放标准。"}]}],"synonyms":["anti-knock","antiknock additive","antiknock agent","octane booster"],"phonetic":"/ˌæn.tiˈnɑk/","extraExplanation":["“Knock”（爆震/爆鸣）指发动机气缸内的燃油混合气在点火火花之前或燃烧过程中发生不受控的自燃与冲击，产生金属敲击声并可能损伤发动机。抗爆震能力常与“octane rating（辛烷值）”相关：辛烷值越高，越不容易爆震。","在英语里也常写作“anti-knock”或“anti-knock additive/agent”。"]}
{"word":"antiknocks","summary":{"en":"Antiknocks are fuel additives (or the additives collectively) that reduce engine knock.","zh":"Antiknocks 指用于减少发动机爆震/敲缸的燃油添加剂（或这些添加剂的统称）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance (additive) mixed into gasoline/petrol to reduce engine “knock” (unwanted knocking sounds and vibration caused by abnormal combustion).","zh":"（汽油中的）抗爆剂；抗震剂（为减少发动机“爆震/敲缸”而加入的添加剂）。"},"examples":[{"en":"Modern gas contains antiknocks that help engines run smoothly.","zh":"现代汽油里含有抗爆剂，有助于发动机平稳运转。"},{"en":"The mechanic explained that higher-octane fuel often works because it resists knock better than regular fuel.","zh":"修理工解释说，高辛烷值燃油往往更有效，因为它比普通燃油更抗爆震。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) the antiknock additives or agents used in fuel.","zh":"（复数）多种抗爆添加剂；抗爆成分（统称）。"},"examples":[{"en":"Refineries adjust antiknocks to meet different fuel standards.","zh":"炼油厂会调整抗爆添加剂，以符合不同的燃油标准。"}]}],"synonyms":["antiknock additive","anti-knock agent","octane booster"],"phonetic":"/ˈæn.tiˌnɑk/","extraExplanation":["“knock”在发动机语境里常译为“爆震/敲缸”，指燃油在气缸内非正常燃烧引起的金属敲击声与震动。","“antiknock”常与“octane rating（辛烷值）”一起出现：辛烷值越高，燃油越不容易爆震。","历史上常见的抗爆剂之一是含铅添加剂（tetraethyl lead），但由于健康与环境危害，许多国家已禁用，改用其他配方提高抗爆性能。"]}
{"word":"Antikythera","summary":{"en":"Antikythera is a small Greek island, and it is also famous for the “Antikythera mechanism,” an ancient device found in a nearby shipwreck.","zh":"Antikythera 指希腊的一座小岛，也常因附近沉船出土的“安提基西拉装置”而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small Greek island in the Aegean Sea (between Kythera and Crete), best known for the ancient shipwreck found nearby.","zh":"希腊爱琴海中的一座小岛（位于基西拉岛与克里特岛之间），最著名的是其附近发现的古代沉船遗址。"},"examples":[{"en":"Antikythera is a quiet Greek island, but it became world-famous because of an ancient shipwreck.","zh":"安提基西拉岛是一座安静的希腊小岛，但因为一处古代沉船遗址而闻名世界。"},{"en":"The divers found treasures in the waters near Antikythera.","zh":"潜水员在安提基西拉岛附近海域发现了宝物。"}]},{"partOfSpeech":"n.","definition":{"en":"(often in “the Antikythera mechanism”) a famous ancient Greek device recovered from a shipwreck near the island, widely believed to have been used to predict astronomical positions and calendars.","zh":"（常见于“安提基西拉装置/机械”）从该岛附近沉船中打捞出的著名古希腊装置，普遍认为用于预测天体位置与历法等。"},"examples":[{"en":"The Antikythera mechanism is sometimes called the first analog computer.","zh":"安提基西拉装置有时被称为“第一台模拟计算机”。"},{"en":"Researchers used modern scans to study the gears inside the Antikythera mechanism.","zh":"研究人员使用现代扫描技术研究安提基西拉装置内部的齿轮结构。"},{"en":"In museum exhibits, the Antikythera mechanism shows how advanced ancient engineering could be.","zh":"在博物馆展览中，安提基西拉装置展示了古代工程技术可以有多么先进。"}]}],"synonyms":["Anticythera (variant spelling)"],"phonetic":"/ˌæntiˈkɪθərə/","extraExplanation":["“Antikythera”来自希腊语：anti-（“对面/相对”）+ Kythera（基西拉岛），大意是“在基西拉对面的地方”。","安提基西拉沉船（约公元前1世纪）于1900—1901年间被海绵潜水员发现；装置的发现推动了人们对古代科技史的认识。","相关常见搭配：Antikythera mechanism（安提基西拉装置/机械）、Antikythera shipwreck（安提基西拉沉船）。"]}

