{"word":"antiuating","summary":{"en":"“Attenuating” means reducing or becoming weaker in strength or intensity.","zh":"“attenuating”表示“（使）强度或程度减弱、削弱、降低”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Usually of an effect, force, sound, light, pain, etc.) becoming weaker; reducing something’s strength or intensity.","zh":"（通常指影响、力量、声音、光、疼痛等）变弱的；使某物的强度或程度减弱的。"},"examples":[{"en":"The curtains are attenuating the sunlight, making the room cooler.","zh":"窗帘在减弱阳光的强度，让房间更凉快。"},{"en":"Wearing earplugs helps in attenuating loud noise at concerts.","zh":"戴耳塞有助于在音乐会上减弱刺耳的噪音。"},{"en":"The medicine is attenuating the pain, but it hasn’t gone away completely.","zh":"药物正在减轻疼痛，但还没有完全消失。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “attenuate”: to make something weaker or less intense; to reduce.","zh":"“attenuate”的现在分词：使某物变弱、减轻；削弱；降低。"},"examples":[{"en":"Engineers are attenuating the signal to prevent distortion.","zh":"工程师正在衰减信号以防止失真。"},{"en":"The speaker kept attenuating his criticism to avoid hurting anyone’s feelings.","zh":"演讲者不断弱化自己的批评，以免伤到任何人的感情。"}]}],"synonyms":["weakening","reducing","diminishing","softening","mitigating","dampening"],"phonetic":"/əˈtɛnjueɪtɪŋ/","extraExplanation":["你输入的 **antiuating** 很可能是 **attenuating** 的拼写错误（常见混淆：-tiu- vs. -tenu-）。标准拼写是 **attenuate / attenuating**。","词根 **tenu-** 来自拉丁语，和 *thin*（薄、细）有关，所以 *attenuate* 有“变薄/变弱”的核心感觉，常用于科学与日常表达：*attenuate a signal/noise/light/pain*（衰减/减弱信号、噪音、光、疼痛）。"]}
{"word":"antiulcer","summary":{"en":"Antiulcer describes (or names) a medicine or treatment used to prevent or treat stomach/peptic ulcers.","zh":"antiulcer 指（或名词化表示）用于预防或治疗胃/消化性溃疡的药物或治疗。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a medicine or treatment) preventing or treating stomach/peptic ulcers.","zh":"（药物或治疗）用于预防或治疗（胃/消化性）溃疡的；抗溃疡的。"},"examples":[{"en":"The doctor prescribed an antiulcer drug to reduce stomach acid.","zh":"医生开了抗溃疡药来减少胃酸。"},{"en":"Some painkillers can irritate the stomach, so an antiulcer medicine may be added.","zh":"一些止痛药会刺激胃部，所以可能会加用抗溃疡药。"}]},{"partOfSpeech":"n.","definition":{"en":"an antiulcer drug; a medicine used to prevent or treat ulcers.","zh":"抗溃疡药；用于预防或治疗溃疡的药物。"},"examples":[{"en":"This antiulcer works best when taken before meals.","zh":"这种抗溃疡药在饭前服用效果最好。"}]}],"synonyms":["anti-ulcer","antiulcerative","ulcer-preventing"],"phonetic":"/ˌæntiˈʌlsɚ/","extraExplanation":["“anti-”表示“反/抗/预防”，ulcer 是“溃疡”。antiulcer 常见于医学语境，尤其指抑酸或保护胃黏膜的一类药物（如质子泵抑制剂、H2受体拮抗剂等）。"]}
{"word":"antiulcerative","summary":{"en":"Antiulcerative describes something that prevents or treats ulcers.","zh":"antiulcerative 表示“抗溃疡的”，指能预防或治疗溃疡的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Preventing, relieving, or treating ulcers (especially stomach or duodenal ulcers).","zh":"抗溃疡的；用于预防、缓解或治疗溃疡（尤指胃或十二指肠溃疡）。"},"examples":[{"en":"This medicine has antiulcerative effects and helps protect the stomach lining.","zh":"这种药物具有抗溃疡作用，并有助于保护胃黏膜。"},{"en":"Doctors may prescribe an antiulcerative drug for people with chronic indigestion.","zh":"医生可能会为长期消化不良的人开具抗溃疡药物。"}]}],"synonyms":["anti-ulcer","ulcer-preventing","antiulcer","gastroprotective"],"phonetic":"/ˌæn.tiˈʌl.sɚ.ə.tɪv/","extraExplanation":["“anti-”表示“反对/抗/防”，而“ulcer”是“溃疡”。把它们合在一起，antiulcerative 就是“抗溃疡的”。","这是医学/药学语境中更常见的用词；日常英语里更常说“anti-ulcer drug（抗溃疡药）”或直接说“ulcer medicine（治溃疡的药）”。","常见的抗溃疡药物类别包括：抑酸药（如质子泵抑制剂 PPI、H2 受体阻断剂）以及胃黏膜保护剂等。"]}
{"word":"Antium","summary":{"en":"Antium is the ancient name of a Roman-era coastal town in Italy, now called Anzio.","zh":"Antium 是意大利一座古罗马时期海滨城镇的古称，今称安齐奥（Anzio）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An ancient coastal town in central Italy (in Latium), famous in Roman history; today it is the modern Italian town of Anzio.","zh":"意大利中部拉丁姆地区的古代海滨城镇，罗马史上著名；今为意大利的安齐奥（Anzio）。"},"examples":[{"en":"In Roman times, Antium was known for its seaside villas.","zh":"在罗马时代，Antium 以海边别墅闻名。"},{"en":"The story mentions Antium as a place of exile and political intrigue.","zh":"故事中提到 Antium 是一个与流放和政治阴谋相关的地方。"}]}],"synonyms":["Anzio"],"phonetic":"ˈæn.ti.əm","extraExplanation":["Antium 是拉丁语地名，后来与意大利语地名 Anzio 对应；在英语历史与文学作品中常用 Antium 来强调“古罗马背景”。","在罗马共和国与帝国时期，Antium 是富人度假与建造别墅的海滨胜地；也常出现在描写罗马政治、权力斗争或流放生活的叙述里。","英语中有时会提到“rostra（演讲台）”上的船首装饰，据说与罗马在 Antium 一带的海战战利品有关，因此 Antium 偶尔在历史文化讨论中被提及。"]}
{"word":"antiumbral","summary":{"en":"Antiumbral means “related to the antumbra,” especially the eclipse shadow region that produces an annular eclipse.","zh":"antiumbral 指“与反本影有关”，尤指会产生日环食的那种食影区域。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the antumbra (the lighter, outer part of a shadow), especially the region in an eclipse where the light source is not completely blocked.","zh":"与“反本影/半影外侧的较亮区域（antumbra）”有关的；尤指日食等现象中遮挡物无法完全遮住光源时形成的区域。"},"examples":[{"en":"During an annular solar eclipse, observers in the antumbral zone see a bright “ring of fire.”","zh":"在日环食中，位于反本影区域的观察者会看到明亮的“火环”。"},{"en":"The satellite mapped the antumbral shadow path across the ocean.","zh":"这颗卫星绘制了反本影穿过海洋的阴影路径。"}]}],"synonyms":["antumbral","shadow-related (general)"],"phonetic":"/ˌæntiˈʌmbrəl/","extraExplanation":["“Umbra”来自拉丁语，意为“影子/阴影”。在天文现象中，影子常分为：本影（umbra，完全遮住）、半影（penumbra，部分遮住）和反本影（antumbra）。当遮挡物看起来比光源小（例如月亮在远地点时），就可能出现反本影，对应的日食类型通常是“日环食（annular eclipse）”。","拼写提示：antiumbral 来自 antumbra + -al（形容词后缀）。它是较少见的技术词，多用于天文学、光学或科普写作。"]}
{"word":"antiunemployment","summary":{"en":"Antiunemployment describes policies or actions designed to reduce unemployment.","zh":"antiunemployment 用来形容旨在减少失业的政策或行动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"intended to reduce unemployment or prevent people from being unemployed; aimed against unemployment","zh":"旨在减少失业或防止失业的；反失业的"},"examples":[{"en":"The government announced an antiunemployment program focused on job training.","zh":"政府宣布了一项以职业培训为重点的反失业计划。"},{"en":"Antiunemployment policies often include subsidies for hiring new workers.","zh":"反失业政策常包括对雇用新员工的补贴。"}]}],"synonyms":["anti-unemployment","job-creation","employment-boosting","pro-employment"],"phonetic":"/ˌæntiʌnɪmˈplɔɪmənt/","extraExplanation":["这个词在英语里不算常见，更常见的写法是加连字符的 **anti-unemployment**（尤其在正式写作中）。也经常用更自然的表达：**job-creation**（创造就业的）、**employment-supporting**（支持就业的）、**measures to reduce unemployment**（减少失业的措施）。","构词上是 **anti-**（反对、对抗）+ **unemployment**（失业）。发音时重音通常落在 *employment* 的核心部分。"]}
{"word":"antiunion","summary":{"en":"“Antiunion” means opposed to labor unions or union organizing.","zh":"antiunion 指“反对劳工工会或工会组织活动”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to labor unions or union activity (for example, against organizing a union at a workplace).","zh":"反对工会或工会活动的（例如反对在公司组织工会）。"},"examples":[{"en":"The company was accused of using antiunion tactics during the election.","zh":"这家公司被指控在选举期间使用反工会的手段。"},{"en":"Some workers saw the new policy as antiunion and unfair.","zh":"一些工人认为新政策反工会、不公平。"}]}],"synonyms":["anti-union","union-busting","anti-labor (context-dependent)"],"phonetic":"/ˌæntiˈjuːnjən/","extraExplanation":["在美国语境里，union 通常指“劳工工会”（labor union），不是“联盟/联合”。antiunion 常见于新闻与职场话题，如 antiunion campaign（反工会宣传/活动）、antiunion consultant（反工会顾问）。拼写上也常见 anti-union（加连字符）。"]}
{"word":"antiunionist","summary":{"en":"Antiunionist describes someone or something opposed to labor unions or unionization; it can be an adjective or a noun.","zh":"antiunionist 指反对劳工工会或工会化的立场或人，可作形容词或名词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to labor unions or to the idea of workers organizing in unions.","zh":"反对工会的；反对工人组织成工会的。"},"examples":[{"en":"The company hired an antiunionist consultant to discourage union organizing.","zh":"公司雇了一位反工会顾问来阻止工会组织活动。"},{"en":"Some workers felt the new policy was openly antiunionist.","zh":"一些工人觉得新政策明显带有反工会倾向。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who is opposed to labor unions or unionization.","zh":"反工会的人；反对工会化的人。"},"examples":[{"en":"He became known as an antiunionist during the factory strike.","zh":"在工厂罢工期间，他被认为是一个反工会的人。"},{"en":"The debate included union leaders and antiunionists.","zh":"辩论中既有工会领袖，也有反工会人士。"}]}],"synonyms":["anti-union","anti-labor","union-busting (informal)","anti–trade union (BrE)"],"phonetic":"/ˌæntiˈjuːnjənɪst/","extraExplanation":["“anti-”表示“反对/对抗”，加在名词或形容词前形成新词：antiwar（反战）、antihero（反英雄）。因此 antiunionist 字面就是“反对 union（工会）的人/立场”。","在美国语境中，这个词多和劳工关系、工会组织（union organizing）、罢工（strike）、集体谈判（collective bargaining）等话题一起出现。","在某些政治语境里，尤其是涉及爱尔兰历史时，Unionist/anti-Unionist 也可能指对“与英国联合（Union）”的态度；但 antiunionist 更常见的理解仍是“反工会（labor union）”。阅读时可根据上下文判断。"]}
{"word":"antiuniversity","summary":{"en":"Antiuniversity means an alternative educational group that challenges traditional university structures; it can also refer to specific protest-era movements like the 1960s Antiuniversity projects.","zh":"antiuniversity 指挑战传统大学制度的替代性教育组织；也可特指如20世纪60年代“反大学”项目等抗议时代的相关运动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an alternative, nontraditional educational group or school that criticizes or rejects the usual structure of universities (such as formal degrees, exams, or rigid departments).","zh":"反大学；一种非传统的教育组织或学校，批评或拒绝传统大学的制度（如学位、考试或僵化的院系结构）。"},"examples":[{"en":"She took classes at an antiuniversity where anyone could teach or learn.","zh":"她在一所反大学上课，在那里任何人都可以教，也都可以学。"},{"en":"The antiuniversity focused on community learning instead of grades and diplomas.","zh":"这所反大学重视社区式学习，而不是分数和文凭。"}]},{"partOfSpeech":"n.","definition":{"en":"(often capitalized) a specific movement or organization—especially the 1960s “Antiuniversity” projects—created as a protest against mainstream higher education.","zh":"（常大写）特指某些“反大学”运动或组织，尤其是20世纪60年代以反对主流高等教育为目的的“反大学”项目。"},"examples":[{"en":"The Antiuniversity of London became a symbol of radical education in the 1960s.","zh":"伦敦反大学成为20世纪60年代激进教育的象征。"},{"en":"Their reading group described itself as part of the Antiuniversity tradition.","zh":"他们的读书会自称属于“反大学”传统的一部分。"}]}],"synonyms":["alternative school","free school","countercultural education","nontraditional education"],"phonetic":"/ˌæntaɪˌjuːnəˈvɝsəti/","extraExplanation":["“anti-”表示“反对、抵制”，与“university”组合成“antiuniversity”，常用于讨论替代教育（alternative education）与反体制学习（countercultural learning）。","历史上较有名的是1960年代末的“Antiuniversity of London”，受当时学生运动与反文化思潮影响，强调开放课程、共同学习、反对精英化与官僚化的教育体系。","在现代语境中，这个词也可更宽泛地指没有正式学位体系、以社群实践为核心的学习空间（例如某些自由学校、社区学院项目或自组织研讨班）。"]}
{"word":"antiuratic","summary":{"en":"“Antiuratic” is a medical adjective meaning “uric-acid/urate-lowering,” often related to gout treatment.","zh":"“antiuratic”是医学形容词，意为“降尿酸/抗尿酸盐的”，常与痛风治疗相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Reducing or preventing excess uric acid (urate) in the body; used especially in the context of gout or high uric acid levels.","zh":"（医学）降低或预防体内尿酸（尿酸盐）过多的；尤用于痛风或高尿酸相关语境。"},"examples":[{"en":"Allopurinol is often described as an antiuratic drug because it lowers uric acid.","zh":"别嘌醇常被称为抗尿酸药，因为它能降低尿酸水平。"},{"en":"The doctor recommended an antiuratic treatment plan to help prevent gout attacks.","zh":"医生建议采用抗尿酸的治疗方案，以帮助预防痛风发作。"}]}],"synonyms":["urate-lowering","antihyperuricemic","anti-gout (informal)"],"phonetic":"/ˌæn.ti.jʊˈræt.ɪk/","extraExplanation":["“antiuratic”在现代英语中相对少见，更常见的说法是“urate-lowering”（降尿酸的）或“antihyperuricemic / antihyperuricaemic”（抗高尿酸的）。","词形拆解：anti-（反、对抗）+ uratic（与尿酸/尿酸盐有关）。常用于医学或药学文献，而日常交流中通常会直接说“lower uric acid（降低尿酸）”。"]}
{"word":"antiurban","summary":{"en":"Antiurban means opposed to cities or urban development, often favoring rural/suburban life or criticizing cities.","zh":"antiurban 指反对城市或城市发展的立场，常偏好乡村/郊区生活或批判城市。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to cities, city life, or urban development; favoring non-urban (especially rural or suburban) ways of living.","zh":"反城市的；反对城市生活或城市发展（常偏好乡村或郊区的生活方式）。"},"examples":[{"en":"The group has an antiurban attitude and wants to limit new high-rise construction downtown.","zh":"这个团体持反城市态度，想限制市中心新建高层建筑。"},{"en":"Some novels describe an antiurban dream: leaving the crowded city for a quiet village.","zh":"一些小说描写一种反城市的梦想：离开拥挤的都市，去安静的村庄。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to beliefs, policies, or movements that criticize cities as unhealthy, unsafe, or morally harmful.","zh":"与批判城市“有害”（如不健康、不安全或道德败坏）的观念、政策或运动有关的。"},"examples":[{"en":"Antiurban policies can discourage public transit investment and push growth outward.","zh":"反城市政策可能打击对公共交通的投资，并把发展推向城市外缘。"},{"en":"The speech used antiurban language, portraying cities as places of crime and decay.","zh":"这场演讲用了反城市的措辞，把城市描绘成犯罪和衰败之地。"}]}],"synonyms":["anti-urban","anti-city","nonurban","counter-urban","urban-skeptical"],"phonetic":"/ˌæntiˈɝbən/","extraExplanation":["“antiurban”常写作“anti-urban”，其中前缀 anti- 表示“反对/抵制”。该词多见于社会学、城市规划、政治评论等语境。","它通常描述一种立场或话语，而不一定指“讨厌住在城市的人”。在写作中可与具体对象搭配更清楚：anti-urban development（反城市开发）、anti-urban bias（反城市偏见）。"]}
{"word":"antiurease","summary":{"en":"Antiurease means a urease inhibitor—something that slows the enzyme urease from breaking down urea.","zh":"antiurease 指“脲酶抑制剂”，即抑制脲酶分解尿素的物质或作用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance that inhibits urease (the enzyme that breaks down urea), used to slow urea breakdown and reduce ammonia release.","zh":"抑制脲酶（分解尿素的酶）的物质，用于减缓尿素分解并减少氨的释放。"},"examples":[{"en":"Some fertilizers include an antiurease to reduce nitrogen loss as ammonia.","zh":"一些肥料会加入脲酶抑制剂（antiurease），以减少氮以氨的形式流失。"},{"en":"Researchers tested a new antiurease to control urease activity in soil.","zh":"研究人员测试了一种新的脲酶抑制剂，用来控制土壤中的脲酶活性。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or having the effect of inhibiting urease.","zh":"（形容）与抑制脲酶有关的；具有抑制脲酶作用的。"},"examples":[{"en":"The product claims antiurease effects under field conditions.","zh":"该产品宣称在田间条件下具有抑制脲酶的效果。"}]}],"synonyms":["urease inhibitor","urease-inhibiting agent"],"phonetic":"/ˌæn.tiˈjʊr.i.eɪs/","extraExplanation":["这个词多见于农业与生物化学语境，尤其是“尿素肥料+脲酶抑制剂”的组合。常见表达还有“urease inhibitor（脲酶抑制剂）”，在实际英文中比 antiurease 更常用。"]}
{"word":"antiusurious","summary":{"en":"Anti-usurious; opposed to charging unfairly high interest (usury).","zh":"反高利贷的；反对收取不合理高利息的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to usury (the practice of charging unfairly high interest on loans); against usurious lending.","zh":"反对高利贷的；反对收取不合理高利息的。"},"examples":[{"en":"The senator gave an antiusurious speech supporting stronger consumer loan protections.","zh":"这位参议员发表了反高利贷的演讲，支持更强的消费者贷款保护。"},{"en":"Some religious groups have historically taken an antiusurious position.","zh":"一些宗教团体在历史上一直持反高利贷立场。"},{"en":"The new rules were designed to be antiusurious by capping interest rates.","zh":"新规通过设定利率上限来体现反高利贷的目的。"}]}],"synonyms":["anti-usury","opposed to usury","against usurious lending","anti-predatory lending"],"phonetic":"/ˌæn.taɪˈjuː.ʒə.ri.əs/","extraExplanation":["“antiusurious”由 anti-（反对）+ usurious（高利贷的）构成，是比较少见、偏正式/法律或历史语境的词。更常见的说法包括 “anti-usury” 或 “opposed to usury”。","在英语世界里，“usury”在不同时期含义有所变化：早期常指“任何利息”都被视为不当；现代更常指“过高、剥削性的利息”。因此 antiusurious 往往出现在讨论利率上限、放贷监管、宗教伦理或经济史的语境中。"]}
{"word":"antiutilitarian","summary":{"en":"Antiutilitarian means opposing utilitarianism or someone who rejects it.","zh":"antiutilitarian 指“反对功利主义的”，也可指“反功利主义者”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to utilitarianism (the idea that the best action is the one that produces the greatest overall happiness or welfare).","zh":"反对功利主义/效益主义（认为“最好的行动”是能带来最大总体幸福或福利的行动）的。"},"examples":[{"en":"Her antiutilitarian view says some actions are wrong even if they lead to good results.","zh":"她的反功利主义观点认为：即使能带来好结果，有些行为仍然是错误的。"},{"en":"Antiutilitarian ethics often emphasizes rights and duties rather than outcomes.","zh":"反功利主义伦理常强调权利与义务，而不是结果。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who rejects utilitarianism as a moral or political theory.","zh":"反对功利主义（作为道德或政治理论）的人。"},"examples":[{"en":"In the debate, the antiutilitarian argued that individual rights should not be sacrificed for the majority.","zh":"在辩论中，那位反功利主义者主张：不应为了多数人的利益牺牲个人权利。"}]}],"synonyms":["nonutilitarian","anti-consequentialist","deontological (often related)"],"phonetic":"/ˌæn.ti.juˌtɪl.əˈtɛr.i.ən/","extraExplanation":["“anti-”表示“反对……”，而“utilitarian”来自“utility（效用）”。在哲学讨论中，antiutilitarian 常与强调“原则/义务/权利”的立场相关，例如康德主义（Kantian ethics）或权利论（rights-based ethics）。","常见对立：utilitarian（功利主义的） vs. antiutilitarian（反功利主义的）。在政治与公共政策讨论里，它也可能指反对“只看成本效益/最大化总福利”的决策方式。"]}
{"word":"antiutilitarianism","summary":{"en":"Antiutilitarianism is the belief that morality is not just about maximizing overall happiness; some principles (like rights or justice) can outweigh outcomes.","zh":"反功利主义认为，道德不只看是否“最大化总体幸福”；某些原则（如权利、正义）可能比结果更重要。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to utilitarianism (the ethical view that the right action is the one that produces the greatest overall happiness or well-being).","zh":"反功利主义；反对“功利主义”（认为正确的行为应带来最大整体幸福/福祉的伦理观点）。"},"examples":[{"en":"Antiutilitarianism argues that some actions are wrong even if they increase overall happiness.","zh":"反功利主义认为，有些行为即使能增加总体幸福，也依然是错误的。"},{"en":"Many rights-based theories are forms of antiutilitarianism.","zh":"许多以权利为核心的理论都属于反功利主义的形式。"}]}],"synonyms":["non-utilitarian ethics","rights-based ethics","deontological ethics (often related)"],"phonetic":"/ˌæn.ti.juˌtɪl.əˈtɛr.i.əˌnɪz.əm/","extraExplanation":["“antiutilitarianism”常见于伦理学/政治哲学讨论中，强调“结果最大化”不是唯一标准；例如它可能主张：个人权利、正义、公平、人的尊严等价值不能为了总体效用而被牺牲。","它并不一定反对“追求幸福/利益”，而是反对把“最大化总体效用”当作最高、唯一或压倒性的道德原则。常与义务论（deontology）、权利论（rights-based ethics）、康德式伦理、罗尔斯的正义论等思路相关。","词形上可理解为：anti-（反对）+ utilitarianism（功利主义）。在写作中也常见相关词：anti-utilitarian（反功利主义的，形容词）。"]}

