{"word":"antis","summary":{"en":"“Antis” is an informal plural noun meaning people who are against something or who attack/criticize someone online.","zh":"“Antis”是非正式复数名词，指反对某事的人，或在网上攻击/批评某人的人（类似“黑粉”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) People who are strongly against a person, group, idea, or policy; opponents.","zh":"（非正式）强烈反对某个人、群体、观点或政策的人；反对者。"},"examples":[{"en":"The mayor says the antis are spreading rumors online.","zh":"市长说那些反对者正在网上散布谣言。"},{"en":"She avoided arguing with the antis at the meeting.","zh":"她在会议上避免和反对者争吵。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, especially online) People who actively criticize or attack someone (often a celebrity, creator, or public figure).","zh":"（非正式，尤用于网络）经常批评或攻击某人的人（常指明星、创作者或公众人物的“黑粉”）。"},"examples":[{"en":"Every popular streamer has antis in the comments.","zh":"每个受欢迎的主播评论区里都会有黑粉。"},{"en":"He stopped reading messages because the antis were too loud.","zh":"他不再看留言了，因为黑粉太吵了。"}]}],"synonyms":["opponents","critics","detractors","haters","naysayers"],"phonetic":"ˈæn.tiz","extraExplanation":["“antis”通常是“anti-（反……的）”或“anti(s)”的口语/网络缩写，用来指“反对者”。它更偏非正式，正式写作里一般用“opponents / critics”。","语气可能带点对立或贬义（尤其在粉丝文化里接近“黑粉”），使用时注意场合与礼貌。"]}
{"word":"antisabbatarian","summary":{"en":"Antisabbatarian means opposing strict Sabbath/Sunday observance or related restrictive laws; it can also refer to a person with that view.","zh":"antisabbatarian 指反对严格守安息日/主日或反对相关限制性法律；也可指持这种观点的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to strict Sabbath (usually Sunday) observance or to laws/rules that restrict activities on the Sabbath.","zh":"反对严格遵守安息日（通常指周日）或反对以法律/规章限制安息日活动的。"},"examples":[{"en":"The group was openly antisabbatarian and campaigned against Sunday closing laws.","zh":"这个团体公开反对“守主日”，并反对要求周日停业的法律。"},{"en":"In the 1800s, some newspapers argued from an antisabbatarian viewpoint that leisure on Sunday should be allowed.","zh":"在19世纪，一些报纸从反对严格守主日的立场出发，主张周日应允许休闲娱乐。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who opposes strict Sabbath observance or Sabbath-restricting laws.","zh":"反对严格守安息日或反对安息日限制性法律的人。"},"examples":[{"en":"Local ministers debated with an antisabbatarian about whether Sunday markets should be legal.","zh":"当地牧师与一位反对严格守主日的人辩论周日集市是否应合法。"}]}],"synonyms":["anti-Sabbath","opposed to Sunday closing laws","anti-blue-law"],"phonetic":"/ˌæn.tiˌsæb.əˈtɛr.i.ən/","extraExplanation":["这个词由 anti-（反对）+ sabbatarian（主张守安息日的人/与守安息日相关的）构成。Sabbath 源自希伯来传统的“安息日”，在英语历史语境中常指基督教文化里的周日宗教性休息与禁娱禁商等规范。","antisabbatarian 常见于18–19世纪有关“Sunday laws/blue laws（周日禁令/蓝法）”的社会争论中，因此带有明显的历史与宗教—社会政策语境；日常口语里不常用。"]}
{"word":"antisacerdotal","summary":{"en":"Antisacerdotal means opposed to priests or clerical authority.","zh":"antisacerdotal 指反对神职人员或神职权威。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to priests, priestly power, or the influence of organized religion (especially the authority of clergy).","zh":"反对神职人员、反对神职权威或反对有组织宗教影响（尤指反对教士权力）。"},"examples":[{"en":"The writer’s antisacerdotal views show up in his sharp criticism of church leaders.","zh":"这位作家的反神职观点体现在他对教会领袖的尖锐批评中。"},{"en":"Some reformers were antisacerdotal, arguing that faith should not depend on priests.","zh":"一些改革者反对神职主义，认为信仰不应依赖神父/牧师。"},{"en":"The film uses antisacerdotal humor to challenge religious authority.","zh":"这部电影用反神职色彩的幽默来质疑宗教权威。"}]}],"synonyms":["anticlerical","anti-clerical","anti-priestly","anti-ecclesiastical"],"phonetic":"/ˌæn.tiˌsæs.ɚˈdoʊ.t̬əl/","extraExplanation":["这个词较少见，语气偏正式/学术，常用于讨论宗教史、政治思想或文学批评。比起泛泛的“反宗教（anti-religious）”，它更聚焦于“反对神职人员/教士阶层的权力”。","词源可拆为：anti-（反对）+ sacerdotal（与祭司/神职有关的，来自拉丁语 sacerdos “祭司”）。因此它强调“反神职（clergy）”，不一定等于“反信仰”。"]}
{"word":"antisacerdotalist","summary":{"en":"“Antisacerdotalist” means someone (or something) against the idea that priests have special spiritual authority, especially in sacraments.","zh":"“antisacerdotalist”指反对司铎主义的人或立场，即反对认为神职人员在宗教仪式（尤其圣礼）中具有特殊属灵权威。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposes sacerdotalism (the belief that priests have special spiritual authority, especially in rituals like the sacraments).","zh":"反对“司铎主义/祭司权威主义”（认为神职人员在宗教仪式，尤其圣礼上具有特殊属灵权威）的人。"},"examples":[{"en":"In some church debates, an antisacerdotalist argues that all believers have equal access to God.","zh":"在一些教会争论中，反司铎主义者主张所有信徒都能平等地亲近上帝。"},{"en":"He was labeled an antisacerdotalist because he rejected the idea that priests must mediate salvation.","zh":"他因否定“必须由神父/牧师居中才能得救”的观念而被贴上反司铎主义者的标签。"}]},{"partOfSpeech":"adj.","definition":{"en":"opposing sacerdotalism or priestly control in religion.","zh":"反对司铎主义或反对宗教中由神职人员垄断权威与仪式的。"},"examples":[{"en":"The pamphlet takes an antisacerdotalist stance against priestly dominance.","zh":"这本小册子采取反司铎主义立场，反对神职人员的支配地位。"},{"en":"Some Protestant movements are strongly antisacerdotalist in tone.","zh":"一些新教运动在语气上非常反司铎主义。"}]}],"synonyms":["anti-clerical (near)","anti-priestly (near)","non-sacerdotal (near)"],"phonetic":"/ˌæn.tiˌsæs.ɚˈdoʊ.t̬əl.ɪst/","extraExplanation":["这是一个非常少见、偏学术/宗教史语境的词，常用于讨论宗教改革、教会治理与“圣礼是否必须由神职人员主持”等议题。","构词：anti-（反对）+ sacerdotal（祭司的、司铎的）+ -ist（……主义者/……者）。sacerdotal 源自拉丁语 sacer（神圣的）。"]}
{"word":"antisag","summary":{"en":"Anti-sag means “preventing sagging/drooping,” often used for clothing, bras, or materials.","zh":"Anti-sag 指“防下垂/防松垮”，常用于衣物、内衣或材料的功能描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"designed to prevent something (especially fabric, breasts, or parts of clothing) from drooping or hanging down over time","zh":"防下垂的；防松垮的（尤指衣物、胸部或布料随时间下垂）"},"examples":[{"en":"This bra has an anti-sag design for better support.","zh":"这款胸罩采用防下垂设计，支撑性更好。"},{"en":"Anti-sag fabric helps the knees of jeans keep their shape.","zh":"防松垮面料能让牛仔裤膝盖处更不容易变形。"}]},{"partOfSpeech":"n.","definition":{"en":"a feature, product, or treatment meant to stop sagging","zh":"防下垂功能／产品／处理方式"},"examples":[{"en":"The jacket includes anti-sag stitching at the elbows.","zh":"这件夹克在肘部加入了防松垮缝线。"},{"en":"Look for anti-sag support in the product description.","zh":"在产品描述里找“防下垂支撑”等信息。"}]}],"synonyms":["supportive","non-sag","anti-sagging","reinforced"],"phonetic":"/ˌæntaɪˈsæɡ/","extraExplanation":["“anti-”表示“反、抗、防”；“sag”表示“下垂、松垮”。“anti-sag”常见于服装、内衣、家具材料等产品文案里，属于偏商业/功能性的合成词。","如果你想查的是别的词（例如拼写想写成 anti-sag / anti sagging / antisocial 等），告诉我具体语境或整句，我可以帮你确认。"]}
{"word":"antisaloon","summary":{"en":"Antisaloon means opposed to saloons/alcohol sales, especially in the historical temperance (Prohibition) context.","zh":"Antisaloon 指反对酒馆/酒精销售的，尤用于美国历史上的禁酒（节制饮酒）语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to saloons (bars), especially in connection with the temperance movement and efforts to restrict or ban alcohol.","zh":"反对酒馆（酒吧）的；尤指与禁酒/节制饮酒运动相关、主张限制或禁止酒精的。"},"examples":[{"en":"The town passed an anti-saloon ordinance that limited where alcohol could be sold.","zh":"该镇通过了一项反酒馆条例，限制酒精的销售地点。"},{"en":"Anti-saloon activists argued that bars harmed families and public morals.","zh":"反酒馆的活动人士认为酒吧会伤害家庭并败坏社会风气。"}]},{"partOfSpeech":"n.","definition":{"en":"a person, group, or movement that opposes saloons and alcohol sales; often used historically.","zh":"反对酒馆与酒精销售的人、团体或运动（多为历史用法）。"},"examples":[{"en":"He became an antisaloon after seeing how drinking affected his neighborhood.","zh":"看到酗酒对社区的影响后，他成了反酒馆（禁酒）人士。"},{"en":"The antisaloon groups organized petitions and election campaigns.","zh":"这些反酒馆团体组织请愿并参与选举活动。"}]}],"synonyms":["temperance","prohibitionist","dry (politics)","anti-alcohol"],"phonetic":"/ˌænti səˈlun/","extraExplanation":["“antisaloon/anti-saloon”常见于19世纪末到20世纪初的美国语境，和“禁酒运动（temperance movement）”密切相关。最著名的组织是“Anti-Saloon League（反酒馆联盟）”，它在推动美国《第十八修正案》（全国禁酒）过程中影响很大。","在当时的社会讨论中，“saloon”不仅指喝酒的地方，也常被视为政治动员、赌博等活动的聚集点，因此“anti-saloon”往往带有道德改革与社会治理的色彩。"]}
{"word":"antisalooner","summary":{"en":"An antisalooner is someone who opposed saloons and alcohol sales, especially in the U.S. temperance and Prohibition era.","zh":"antisalooner 指反对酒馆与售酒的人，尤用于美国禁酒运动与禁酒令时期的历史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who opposed saloons (places selling alcohol), especially during the U.S. temperance movement and the period leading up to Prohibition.","zh":"反酒馆者；反对酒馆（售酒场所）的人，尤指美国禁酒运动与禁酒令前后时期的人。"},"examples":[{"en":"Many antisalooners campaigned for laws to limit or ban the sale of alcohol.","zh":"许多反酒馆者为限制或禁止售酒的法律而奔走呼吁。"},{"en":"In the early 1900s, antisalooners often worked with temperance organizations.","zh":"在20世纪初，反酒馆者常与戒酒/禁酒团体合作。"}]}],"synonyms":["prohibitionist","temperance advocate","anti-alcohol activist"],"phonetic":"/ˌæn.taɪ.səˈluː.nɚ/","extraExplanation":["“antisalooner”主要是历史语境用词：19世纪末到20世纪初在美国很常见，和“temperance（节制饮酒/禁酒）”“Prohibition（禁酒令）”密切相关。这里的“saloon”指当时常见的酒馆/小酒吧，也是政治动员、社交聚会的场所，因此反对者往往认为它带来酗酒、家庭问题与社会治安问题。","词形上是 anti-（反对）+ saloon + -er（…的人）。现代英语里更常用“temperance advocate”“prohibitionist”或更中性的“opponent of alcohol sales/ bars”。"]}
{"word":"Antisana","summary":{"en":"Antisana is a volcano in Ecuador near Quito, famous for its glaciers and nearby protected area.","zh":"Antisana 指厄瓜多尔基多附近的安蒂萨纳火山，以冰川与周边保护区闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a snow-capped volcano in Ecuador’s Andes, east of Quito, known for its glaciers and as a landmark near the Antisana Ecological Reserve","zh":"安蒂萨纳火山（厄瓜多尔安第斯山脉的一座终年积雪的火山，位于基多以东，以冰川与周边的安蒂萨纳生态保护区而闻名）"},"examples":[{"en":"Antisana is a prominent volcano east of Quito in Ecuador.","zh":"安蒂萨纳火山是厄瓜多尔基多以东的一座著名火山。"},{"en":"Many people visit the area around Antisana for hiking and wildlife watching.","zh":"许多人前往安蒂萨纳周边地区徒步、观赏野生动物。"}]}],"synonyms":["Antisana Volcano"],"phonetic":"/ˌæntiˈsɑːnə/","extraExplanation":["“Antisana”在英语中通常作为专有名词使用，指火山本体，也常延伸指其周边地区（例如安蒂萨纳生态保护区 Antisana Ecological Reserve）。","该地区以高海拔环境、冰川景观与安第斯高原生态系统闻名；阅读旅游与自然纪录类英文材料时，常会看到与其并列的词如 volcano（火山）、glacier（冰川）、Andes（安第斯山脉）、reserve（保护区）。"]}
{"word":"antisavage","summary":{"en":"Antisavage means “opposed to savagery/cruelty,” but in older writing it can carry colonial, offensive implications.","zh":"antisavage 可指“反对野蛮/残暴”，但在旧语境中可能带有殖民与冒犯含义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to savagery or extreme cruelty; meant to prevent or reduce brutal, violent behavior.","zh":"反对野蛮或极端残忍的；旨在防止或减少暴力残酷行为的。"},"examples":[{"en":"The group promoted antisavage laws to punish acts of extreme cruelty.","zh":"该团体推动反野蛮法律，以惩治极端残酷的行为。"},{"en":"Her antisavage message focused on compassion and human dignity.","zh":"她的“反野蛮”主张强调同情心与人的尊严。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Dated, often offensive) Used to describe policies or attitudes that aimed to “civilize” people labeled as “savages,” especially Indigenous peoples.","zh":"（过时且常具冒犯性）用来描述试图“教化/文明化”被贴上“野蛮人”标签的人群（尤其原住民）的政策或态度。"},"examples":[{"en":"Some older texts use antisavage language to justify colonial policies.","zh":"一些旧文本会用“反野蛮”的措辞来为殖民政策辩护。"}]}],"synonyms":["anti-cruelty","humane","against brutality","civilizing (context-dependent)"],"phonetic":"/ˌæntiˈsævɪdʒ/","extraExplanation":["这个词在现代英语里很少作为固定词条出现，更常见写法是带连字符的“anti-savage”。实际使用时要注意语境：因为 “savage” 过去常被用来贬低原住民等群体，相关搭配在历史语境中可能带有殖民/歧视意味。","如果你想表达“反对残暴/虐待”，更中性的说法通常是：anti-cruelty（反虐待）、humane（人道的）、against brutality（反对暴行）。"]}
{"word":"antiscabious","summary":{"en":"Antiscabious means “against scabies,” describing a treatment (or sometimes the treatment itself).","zh":"antiscabious 意为“抗/治疥疮的”，可作形容词指治疗用的，也可作名词指该药物本身。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"used to prevent or treat scabies (a contagious skin infestation that causes intense itching)","zh":"用于预防或治疗疥疮（会引起剧烈瘙痒的传染性皮肤寄生感染）"},"examples":[{"en":"In older medical texts, some ointments were described as antiscabious remedies.","zh":"在较早的医学文献中，一些药膏被描述为“抗疥疮”的药物。"},{"en":"The doctor prescribed an antiscabious cream to stop the itching and kill the mites.","zh":"医生开了抗疥疮的乳膏，用来止痒并杀死螨虫。"}]},{"partOfSpeech":"n.","definition":{"en":"a medicine or preparation used to treat scabies","zh":"治疗疥疮的药物或制剂"},"examples":[{"en":"The pharmacy used to stock several antiscabious products.","zh":"这家药房过去常备几种治疥疮的产品。"}]}],"synonyms":["scabicidal","scabicide (common in medical use)","scabies treatment"],"phonetic":"/ˌæn.tiˈskeɪ.bi.əs/","extraExplanation":["“antiscabious”由 anti-（反、抗）+ scabious（与疥疮/疥癣相关的）构成。这个词在现代日常英语里不常见，医学语境更常用的是 “scabicide”（杀疥螨的药）或直接说 “scabies treatment”。","疥疮（scabies）由疥螨引起，常通过密切皮肤接触传播；公共卫生与家庭护理语境里，除了用药，也常强调同时清洗衣物寝具、处理密接者等。"]}
{"word":"antiscale","summary":{"en":"Antiscale means preventing or reducing mineral scale (limescale) buildup, especially in water-heating or water-flow systems.","zh":"Antiscale 指“防垢/阻垢”，用于防止或减少水系统与加热设备中的矿物水垢沉积。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to prevent or reduce mineral “scale” (hard, chalky deposits) from forming on surfaces, especially in pipes, boilers, kettles, and industrial equipment.","zh":"用于防止或减少“水垢/结垢”（矿物质形成的坚硬沉积物）在表面生成，常见于管道、锅炉、水壶和工业设备。"},"examples":[{"en":"This antiscale additive helps keep the boiler efficient.","zh":"这种防垢添加剂有助于保持锅炉的效率。"},{"en":"Many dishwashers use an antiscale program to reduce limescale buildup.","zh":"许多洗碗机会使用防垢程序来减少水垢堆积。"}]}],"synonyms":["scale-inhibiting","anti-limescale","scale-resistant","descaling (related)"],"phonetic":"/ˌæn.tiˈskeɪl/","extraExplanation":["“Scale”在这里不是“尺度/规模”，而是指硬水中的钙、镁等矿物质在加热或蒸发后留下的沉积物，常见说法是“limescale（水垢）”。因此 antiscale 常出现在清洁用品、工业水处理、锅炉维护等场景里。","写法上也常见连字符：anti-scale；在产品说明中也可能看到类似表达：anti-limescale、descaling（除垢）、scale inhibitor（阻垢剂）。"]}
{"word":"antisceptic","summary":{"en":"Antiseptic means preventing infection, or a substance used to stop germs from growing.","zh":"Antiseptic 指“防感染的；消毒的”，也可作名词表示“消毒剂”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Preventing infection by stopping the growth of germs (especially on skin or wounds).","zh":"（形容词）防止感染的；（尤指在皮肤或伤口上）抑制细菌生长的；消毒的。"},"examples":[{"en":"Use an antiseptic wipe before you put on a bandage.","zh":"贴创可贴之前先用消毒湿巾擦一下。"},{"en":"The nurse cleaned the cut with an antiseptic solution.","zh":"护士用消毒液清洗了伤口。"}]},{"partOfSpeech":"n.","definition":{"en":"(n.) A substance used to prevent infection by killing or slowing the growth of germs.","zh":"（名词）消毒剂；防腐剂（用于杀灭或抑制细菌以预防感染的物质）。"},"examples":[{"en":"Alcohol is a common antiseptic in first-aid kits.","zh":"酒精是急救包里常见的消毒剂。"},{"en":"Apply an antiseptic to the wound to reduce the risk of infection.","zh":"在伤口上涂消毒剂以降低感染风险。"}]}],"synonyms":["germ-killing","disinfecting","sterilizing (informal)","disinfectant (related)"],"phonetic":"/ˌæntəˈsɛptɪk/","extraExplanation":["你输入的 **antisceptic** 更常见的标准拼写是 **antiseptic**（中间是 **-septic**，不是 **-sceptic**）。在医学与日常护理语境中通常用 **antiseptic**。","区分：**antiseptic** 多指用于“活组织”（皮肤、伤口）的消毒；**disinfectant** 通常用于“物体表面”（桌面、器械）的消毒。"]}
{"word":"antisceptical","summary":{"en":"“Antisceptical” (rare spelling) means “not skeptical; opposed to skepticism.”","zh":"“antisceptical”（罕见拼写）意思是“并不怀疑的；反对怀疑主义的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not skeptical; opposed to skepticism (showing trust rather than doubt).","zh":"不怀疑的；反怀疑主义的（更倾向于相信而不是质疑）。"},"examples":[{"en":"She took an anti-skeptical view and accepted the report without questioning it.","zh":"她采取了不怀疑的态度，没有质疑就接受了这份报告。"},{"en":"His anti-skeptical tone made the audience feel reassured.","zh":"他不怀疑的语气让听众感到安心。"}]}],"synonyms":["not skeptical","trusting","unskeptical","credulous"],"phonetic":"/ˌæntiˈskɛptɪkəl/","extraExplanation":["“antisceptical” 这个拼写很少见，更常见的是 “anti-skeptical”（美式）或 “anti-sceptical”（英式）。在日常英语中，人们也常用更自然的表达：如 “not skeptical / unskeptical / trusting”。","词根上，anti- 表示“反对”，skeptical/sceptical 表示“怀疑的”。因此 anti-skeptical 指“反对怀疑态度/反怀疑主义”，但在普通对话里不如 “trusting” 或 “not skeptical” 常用。"]}
{"word":"antiscepticism","summary":{"en":"Antiscepticism (also written anti-skepticism) is the philosophical stance that rejects radical doubt and argues that knowledge is possible.","zh":"Antiscepticism（也可写作 anti-skepticism）指反对激进怀疑、主张知识是可能的哲学立场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to skepticism; the view that skeptical doubt (especially about knowledge or truth) should be rejected.","zh":"反怀疑论；主张应当反对（尤其是关于知识或真理的）怀疑态度与怀疑论的观点。"},"examples":[{"en":"In epistemology, anti-scepticism argues that we can have genuine knowledge of the world.","zh":"在认识论中，反怀疑论主张我们能够对世界拥有真正的知识。"},{"en":"Her paper defends anti-scepticism by explaining why doubt has limits.","zh":"她的论文通过说明怀疑的界限来为反怀疑论辩护。"}]}],"synonyms":["anti-skepticism","anti-sceptical view","anti-skeptical stance"],"phonetic":"/ˌæntiˈskɛptɪˌsɪzəm/","extraExplanation":["拼写提示：英式英语常写作 scepticism（带 c），美式更常见 skepticism（不带 c）。因此你也会看到 anti-skepticism 这一更常用的写法。","使用场景：这是一个偏学术的哲学术语，常出现在认识论（epistemology）讨论里，用来回应“我们是否能确定自己知道某些事情”的怀疑论挑战。"]}
{"word":"antischolastic","summary":{"en":"Antischolastic means opposing scholastic, authority-based, abstract academic reasoning.","zh":"Antischolastic 指反对经院式、依赖权威与抽象推理的学术思维。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to scholasticism (a traditional academic style that relies on formal logic, fixed authorities, and abstract debate).","zh":"反经院哲学的；反对经院式（依赖形式逻辑、权威文本与抽象辩论的传统学术风格）的。"},"examples":[{"en":"His antischolastic attitude favored observation and experiment over abstract argument.","zh":"他反经院式的态度更重视观察与实验，而不是抽象的争辩。"},{"en":"The essay is antischolastic in tone, criticizing rigid classroom logic-chopping.","zh":"这篇文章的语气带有反经院色彩，批评课堂里僵化的“抠逻辑”式辩论。"}]}],"synonyms":["anti-scholastic","anti-authoritarian (in academic style)","anti-dogmatic","empirical (context-dependent)"],"phonetic":"/ˌæn.ti.skəˈlæs.tɪk/","extraExplanation":["“经院哲学（scholasticism）”常指中世纪欧洲大学里盛行的一种学术传统，强调用严格的逻辑推演来调和宗教权威与哲学问题（如托马斯·阿奎那的体系常被提及）。因此 antischolastic 往往用于描述更倾向经验、实验、人文或批判权威的思想取向。","构词：anti-（反对）+ scholastic（经院的/学校式的）。在文学或思想史语境里，它常与文艺复兴人文主义、近代科学方法等“反权威、重经验”的潮流相呼应。"]}
{"word":"antischolastically","summary":{"en":"Antischolastically means “in an anti-scholastic way,” opposing the traditional scholastic academic style.","zh":"antischolastically 指“以反经院式的方式”，即反对传统经院式学术风格。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that opposes or criticizes scholasticism (a traditional academic style that relies on formal logic, authoritative texts, and fine distinctions).","zh":"以反对或批评“经院哲学/经院式学术”（一种依赖形式逻辑、权威文本与细微概念区分的传统学术风格）的方式。"},"examples":[{"en":"The essay argues antischolastically, preferring clear observation over debates about abstract categories.","zh":"这篇文章以反经院式的方式论证，更重视清晰的观察，而不是围绕抽象范畴的争辩。"},{"en":"Some early modern thinkers wrote antischolastically to challenge university traditions.","zh":"一些近代早期思想家以反经院式的写法来挑战大学里的传统。"}]}],"synonyms":["anti-scholastically","in an anti-scholastic manner","non-scholastically"],"phonetic":"ˌæntiˌskəˈlæstɪkli","extraExplanation":["“Scholasticism（经院哲学）”常指中世纪欧洲大学中盛行的哲学与神学方法，强调用严格的逻辑推理来协调权威文本（如亚里士多德与神学著作）之间的矛盾。","“Antischolastically”多见于学术写作或思想史语境，用来描述一种写作/论证姿态：反对过度的概念细分与纯形式推理，转而强调经验观察、自然科学方法或更直接清晰的表达。","相关词：antischolastic（adj. 反经院式的）、scholastic（adj. 经院式的；n. 学者/学生，较少用）。"]}
{"word":"antischolasticism","summary":{"en":"Antischolasticism is opposition to scholastic (medieval, highly formal, logic-driven) academic philosophy and theology.","zh":"Antischolasticism 指反对经院哲学（中世纪高度形式化、以逻辑辩难为主的学术传统）的思想立场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to scholasticism (the medieval school tradition that relied heavily on formal logic and disputation), especially the view that this style of reasoning is unhelpful for understanding reality or faith.","zh":"反经院哲学；反对经院哲学（中世纪以形式逻辑与辩难为核心的学术传统），尤其认为这种推理方式不利于理解现实或信仰的立场。"},"examples":[{"en":"Some Renaissance humanists were associated with antischolasticism and criticized university debates as empty wordplay.","zh":"一些文艺复兴时期的人文主义者常被视为反经院哲学者，批评大学里的辩论只是空洞的文字游戏。"},{"en":"His essay shows antischolasticism by favoring observation and clear prose over technical argument.","zh":"他的文章体现出反经院哲学倾向：更重视观察与清晰表达，而非技术性的论证。"}]}],"synonyms":["anti-scholastic thought","anti-scholasticism","opposition to scholasticism"],"phonetic":"/ˌæn.ti.skəˈlæs.tɪˌsɪz.əm/","extraExplanation":["“经院哲学（scholasticism）”常指中世纪欧洲大学传统中的神学与哲学方法，强调对权威文本（如亚里士多德、教父著作）的细密诠释与逻辑推演。","“反经院哲学（antischolasticism）”并不一定反对理性或哲学本身，而多是反对过度形式化、脱离经验与语言实际的辩难风格；在文艺复兴人文主义、宗教改革以及近代经验主义兴起的语境中更常见。","相关表达可见于“anti-scholastic”作形容词，用来描述某位思想家或作品的立场与写作风格。"]}
{"word":"antischool","summary":{"en":"Antischool means opposed to school or formal schooling, often describing a negative attitude toward school.","zh":"Antischool 指“反学校的”，常用来形容对学校或正规教育持反对/负面态度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to school, formal schooling, or school culture; showing a negative attitude toward school.","zh":"反学校的；反对正规学校教育或学校文化的；对上学持负面态度的。"},"examples":[{"en":"He had an antischool attitude and refused to do homework.","zh":"他有一种反学校的态度，拒绝写作业。"},{"en":"The movie’s antischool message worries some parents.","zh":"这部电影的反学校信息让一些家长担心。"},{"en":"She joined an antischool online group that complains about teachers.","zh":"她加入了一个反学校的网络群组，里面常抱怨老师。"}]},{"partOfSpeech":"n.","definition":{"en":"A person, group, or idea that is against school or formal education (informal, less common).","zh":"反学校的人/团体/观点（非正式用法，较少见）。"},"examples":[{"en":"Some critics called the movement antischool, but supporters said it was pro-learning.","zh":"一些批评者称这场运动是“反学校”，但支持者说它是“支持学习”。"}]}],"synonyms":["anti-school","anti-education","school-averse","anti-establishment (context-dependent)"],"phonetic":"/ˌæn.tiˈskuːl/","extraExplanation":["“antischool”更常见的写法是“anti-school”（带连字符），意思更清楚：anti-（反对）+ school（学校）。在正式写作中通常建议用“anti-school”。","它并不一定等于“反学习”。有时只是反对传统学校制度或学校氛围，但仍然支持通过其他方式学习（例如在家自学、项目式学习等）。"]}
{"word":"antiscia","summary":{"en":"antiscia: “shadow” mirror points in the zodiac, equally distant from the solstices.","zh":"antiscia：黄道上与至点等距、互为“影子镜像”的点（影点）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Astronomy/astrology) Two points (often two degrees of the zodiac) that are equally distant from the solstices (0° Cancer and 0° Capricorn), traditionally thought to have a hidden or “shadow” relationship.","zh":"（天文学/占星术）指两个点（常指黄道十二宫中的两个度数），它们分别与夏至点（巨蟹座0°）和冬至点（摩羯座0°）等距；传统上认为它们之间有一种隐蔽的“影子”关联。"},"examples":[{"en":"In traditional astrology, some practitioners compare a planet’s position to its antiscia to look for subtle connections.","zh":"在传统占星术中，有些从业者会把行星位置与其 antiscia（影点）对照，以寻找微妙的关联。"},{"en":"Two degrees that mirror each other around the solstice axis are called antiscia.","zh":"围绕至点轴互为镜像的两个度数称为 antiscia。"}]}],"synonyms":["shadow points","antiscium (singular)"],"phonetic":"/ænˈtɪʃiə/","extraExplanation":["antiscia 常被称为“shadow points（影点）”。它不是日常英语词汇，主要出现在古典/传统占星文本或相关研究中。","词形上 antiscia 常被当作复数使用；对应的单数形式是 antiscium（较少见）。"]}
{"word":"antiscian","summary":{"en":"Antiscian is an astrology term meaning “related to (or itself being) an antiscion,” a mirrored zodiac point thought to show a hidden connection.","zh":"Antiscian 是占星学用语，指“与对映点有关（或作为对映点本身）”，即黄道上的镜像对称点，被认为象征一种隐性联系。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Astrology) relating to an antiscion: a “mirror” point of a planet or degree across the Cancer–Capricorn axis, traditionally considered to have a hidden or indirect connection.","zh":"（占星学）与“对映点/反照点”（antiscion）有关的：指把某个行星或黄道度数沿巨蟹—摩羯轴线作镜像对称得到的点，传统上认为与原点有一种隐性或间接的联系。"},"examples":[{"en":"In traditional astrology, an antiscian contact can suggest a subtle, behind-the-scenes influence.","zh":"在传统占星学中，“对映点”形成的联结可能暗示一种细微、幕后式的影响。"},{"en":"The astrologer checked whether Venus had an antiscian relationship with the Moon.","zh":"占星师检查了金星是否与月亮存在对映点关系。"}]},{"partOfSpeech":"n.","definition":{"en":"an antiscion point or one of the pair of points linked by antiscia (often used in the plural).","zh":"对映点；（常用复数）指通过对映关系（antiscia）相互对应的一对点中的一个。"},"examples":[{"en":"Some practitioners compare a planet’s position with its antiscians for additional chart clues.","zh":"一些从业者会把行星位置与其对映点进行比较，以获得更多星盘线索。"}]}],"synonyms":["antiscion","antiscia (plural)","mirror point (informal)"],"phonetic":"ænˈtɪʃiən","extraExplanation":["“antiscian”来自希腊语词根 anti-（相对）+ skia（影子），核心意象是“影子的对称”。在古典占星里，它不是现代天文学的常用术语，而更像一种象征性的“镜像”对应：把黄道度数按夏至/冬至轴（巨蟹/摩羯）对称过去，得到的点被认为与原点有某种隐蔽的相似性或互补关系。","相关词：antiscion（单数）、antiscia（复数/概念名词）。不同传统或流派在计算与解释上可能略有差异。"]}
{"word":"antiscians","summary":{"en":"Antiscians are people living on the same longitude as you but in the opposite hemisphere at the same distance from the equator, so they have opposite seasons.","zh":"Antiscians 指与你同经线、在赤道另一侧且离赤道等距的人，因此季节与您相反。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who live on the same meridian (line of longitude) as you but at the same distance from the equator in the opposite hemisphere—so their seasons are opposite to yours.","zh":"（天文学/地理学）与你在同一条经线（同一条经度线）上、但在赤道另一侧且离赤道距离相同的人；因此他们与您的季节相反。"},"examples":[{"en":"In classical geography, someone in Chile could be considered the antiscian of a person in the United States on the same meridian.","zh":"在古典地理学里，如果两人处在同一条经线上，那么住在智利的人可能被视为美国那个人的“对日居人”（antiscian）。"},{"en":"Writers used the term antiscians to describe distant peoples who experience winter when we have summer.","zh":"一些作者用 antiscians 来指那些“我们是夏天时他们是冬天”的遥远人群。"}]}],"synonyms":["antiscian (singular)","people with opposite seasons","opposite-hemisphere counterparts"],"phonetic":"/ænˈtɪʃiənz/","extraExplanation":["“Antiscians”源自希腊语构词：anti-（相对、相反）+ skia（影子）。在古代天文学/地理学里，它和“太阳影子方向相反”的概念有关，因此用来指在地球上相对于赤道对称位置的人。","这是一个非常罕见、偏学术/古典的词。现代英语中更常用的说法是：people on the same meridian in opposite hemispheres / people with opposite seasons。"]}
{"word":"antiscience","summary":{"en":"“Antiscience” describes attitudes or movements that reject science and scientific evidence.","zh":"“antiscience”指反对或否定科学与科学证据的态度或思潮。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to science, scientific methods, or scientific evidence; showing distrust of scientists or research.","zh":"反科学的；反对科学、科学方法或科学证据的；对科学家或研究持不信任态度的。"},"examples":[{"en":"Some online posts spread antiscience ideas about vaccines.","zh":"一些网络帖子传播关于疫苗的反科学观点。"},{"en":"Calling climate change a hoax is often described as antiscience.","zh":"把气候变化说成骗局常被形容为反科学。"}]},{"partOfSpeech":"n.","definition":{"en":"A general attitude, movement, or position that rejects or attacks science and scientific authority.","zh":"反科学立场或思潮；拒绝或攻击科学与科学权威的态度/运动。"},"examples":[{"en":"The book warns about the rise of antiscience in public debate.","zh":"这本书警告公共讨论中反科学思潮的兴起。"},{"en":"Education can help reduce antiscience by teaching how evidence works.","zh":"通过教授证据如何发挥作用，教育可以帮助减少反科学倾向。"}]}],"synonyms":["anti-science","anti-intellectual","science-denying","anti-rational"],"phonetic":"/ˌæn.tiˈsaɪ.əns/","extraExplanation":["“antiscience”常用于公共议题（如疫苗、气候变化、进化论等）的讨论中，带有强烈批评色彩，指对科学证据与科学共同体的系统性否定，而不只是对某一项研究结果的质疑。","日常表达中也可用更中性的说法，如“skeptical of scientific consensus（对科学共识持怀疑态度）”；而“antiscience”通常暗示忽视证据、依赖阴谋论或意识形态立场。"]}
{"word":"antiscientific","summary":{"en":"“Antiscientific” describes ideas or attitudes that oppose science or ignore evidence-based reasoning.","zh":"“antiscientific”指反对科学或无视证据与科学方法的观点或态度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to science, scientific methods, or scientific ways of thinking; rejecting evidence-based reasoning.","zh":"反科学的；反对科学、科学方法或科学思维方式；拒绝以证据为基础的推理。"},"examples":[{"en":"The article promotes antiscientific ideas and ignores basic evidence.","zh":"这篇文章宣扬反科学观点，并无视基本证据。"},{"en":"Vaccines are sometimes attacked with antiscientific arguments online.","zh":"疫苗有时会在网上遭到反科学论点的攻击。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not consistent with established scientific knowledge or standards.","zh":"不符合既有科学知识或科学标准的；缺乏科学依据的。"},"examples":[{"en":"The claim that the Earth is flat is antiscientific.","zh":"“地球是平的”这种说法是反科学的。"},{"en":"He criticized the report for using antiscientific language instead of data.","zh":"他批评这份报告用缺乏科学依据的措辞，而不是用数据。"}]}],"synonyms":["anti-science","unscientific","pseudoscientific","evidence-denying"],"phonetic":"/ˌæn.taɪ.saɪˈɛn.tɪ.fɪk/","extraExplanation":["“anti-”表示“反对/抵制”，加在“scientific（科学的）”前面就构成“antiscientific”。它通常带有强烈的批评色彩，暗示对方在系统性地忽视证据、方法或专家共识。","语境上要注意区分：对某项研究提出质疑（skeptical/critical）不一定是反科学；而“反科学”往往指反对科学方法本身或传播明显违背证据的观点。"]}
{"word":"antiscientifically","summary":{"en":"“Antiscientifically” means doing or arguing in a way that rejects or goes against science and evidence.","zh":"“antiscientifically”指以反科学、违背科学证据或方法的方式行事或论证。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is opposed to science, scientific methods, or scientific evidence; in an unscientific or science-denying manner.","zh":"以反科学的方式；违背科学方法或科学证据地；以否认科学的方式。"},"examples":[{"en":"The article argues antiscientifically, ignoring basic data and peer-reviewed research.","zh":"这篇文章用反科学的方式论证，忽视了基本数据和同行评审研究。"},{"en":"Some claims spread online antiscientifically by presenting opinions as facts.","zh":"一些说法在网上以反科学的方式传播，把观点包装成事实。"}]}],"synonyms":["unscientifically","against scientific evidence","in a science-denying way"],"phonetic":"/ˌæn.ti.saɪ.ənˈtɪ.fɪ.kli/","extraExplanation":["“antiscientifically”常用于批评语境，带有明显的否定评价，意思接近“违背科学证据/方法地”。日常口语中更常说“in an unscientific way”或“in a way that denies science”。","构词：anti-（反对）+ scientific + -ally（副词）。有时也会看到带连字符的写法“anti-scientifically”，但不带连字符更常见。"]}
{"word":"antiscii","summary":{"en":"“anti-ASCII” (often misspelled as “antiscii”) usually means text or data that includes non-ASCII characters, especially in computing contexts.","zh":"“anti-ASCII”（常被误写成“antiscii”）通常指包含非 ASCII 字符的数据/文本，常见于计算机语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(computing, informal) Not limited to ASCII; containing or using non-ASCII characters (for example, accented letters, Chinese characters, emoji).","zh":"（计算机/非正式）不局限于 ASCII；包含或使用非 ASCII 字符（如重音字母、中文字符、表情符号等）。"},"examples":[{"en":"This filename is anti-ASCII, so the old system can’t display it correctly.","zh":"这个文件名是 anti-ASCII（含非 ASCII 字符），所以旧系统无法正确显示。"},{"en":"We need anti-ASCII support because our users type in many languages.","zh":"我们需要支持 anti-ASCII（多语言字符），因为用户会输入很多种语言。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) Opposed to ASCII as a standard, or rejecting ASCII-only restrictions.","zh":"（较少见）反对 ASCII 作为标准，或拒绝“只能用 ASCII”的限制。"},"examples":[{"en":"The project took an anti-ASCII approach and moved everything to Unicode.","zh":"这个项目采取了 anti-ASCII 的做法，把所有内容都迁移到 Unicode。"}]}],"synonyms":["non-ASCII","Unicode (in practice)","not ASCII-only"],"phonetic":"/ˌænti ˈæski/","extraExplanation":["“antiscii”很可能是把 **anti-ASCII**（反/非 ASCII）拼在一起写了，或把 “ASCII” 误拼成 “SCII”。","**ASCII** 是早期英语为主的字符编码（如 A–Z、0–9、常用标点）。现代软件通常用 **Unicode（如 UTF-8）** 来表示全球多种文字，所以在实际开发里，说某段文本“anti-ASCII”往往就是指“含有非 ASCII 字符”。","常见相关说法：**non-ASCII characters（非 ASCII 字符）**、**ASCII-only（仅限 ASCII）**、**Unicode/UTF-8 support（支持 Unicode/UTF-8）**。"]}
{"word":"antiscion","summary":{"en":"An astrological “mirror point” on the zodiac, paired with another point equally distant from the solstices.","zh":"占星术中的“镜像/对照点”：与另一点在至点两侧等距成对出现的黄道位置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Astrology) One of two points on the zodiac that are equally distant from the solstices (0° Cancer or 0° Capricorn). Each point is considered a “mirror” of the other, and the pair is thought to have a special relationship.","zh":"（占星术）对照点；黄道上距至点（巨蟹座0°或摩羯座0°）等距的两点之一。两点彼此如“镜像”，在传统占星中被认为有特殊关联。"},"examples":[{"en":"In traditional astrology, a planet may be interpreted as influencing its antiscion, as if the two points echoed each other.","zh":"在传统占星里，行星有时会被解读为也影响它的对照点，好像两处位置彼此呼应。"},{"en":"The astrologer calculated the antiscion of the Moon to look for hidden connections in the chart.","zh":"占星师计算月亮的对照点，用来寻找星盘中的隐性关联。"}]}],"synonyms":["antiscium (rare)","antiscia (plural form)"],"phonetic":"/ænˈtɪʃiən/","extraExplanation":["该词多见于古典/传统占星（traditional astrology），现代日常英语里非常少用。复数常写作 antiscia。","词源来自希腊语：anti-（相对、对立）+ skia（影子），字面意思是“对影/影子的对面”，所以在概念上常被比喻为“镜像点”。","在一些占星体系里，对照点常被用来象征“隐藏的相似性、暗中的联系”，类似于把某个位置在至点两侧做对称映射。"]}
{"word":"antiscium","summary":{"en":"Antiscium is a specialized term for a “mirror” point on the ecliptic that shares the same declination as another point, reflected across a solstice.","zh":"Antiscium 是一个较专业的术语，指黄道上与另一点赤纬相同、并以至日为轴线对称的“镜像/对映点”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Astronomy/Astrology) A point on the ecliptic that has the same declination as another point but lies on the opposite side of a solstice (so the two points are “mirror images” across the solstitial line).","zh":"（天文学/占星学）黄道上与另一点赤纬相同、但位于至日点另一侧的对应点；可理解为以至日轴线为“镜面”的对称点。"},"examples":[{"en":"In traditional astrology, two planets can be linked if one lies at the antiscium of the other.","zh":"在传统占星学里，如果两颗行星互为 antiscium（对映点），有时会被认为存在关联。"},{"en":"The chart notes the antiscium point as a kind of solstice-based mirror position on the ecliptic.","zh":"星盘把 antiscium 标注为一种以至日为基准的“镜像位置”，位于黄道上。"}]}],"synonyms":["antiscia (plural)"],"phonetic":"/ænˈtɪsiəm/","extraExplanation":["词源来自希腊语：anti-（相对、对面）+ skia（影子）。因此在一些占星写作中，antiscium 常被解释为“影子的对映点/影子关系”。","更常见的复数形式是 antiscia，用来指一组成对的对映点。这个词属于较专业、偏古典的术语，在现代日常天文学里不太常用。"]}
{"word":"antiscolic","summary":{"en":"Antiscolic describes something that prevents or relieves colic (cramping abdominal pain).","zh":"antiscolic 指“防治或缓解肠绞痛（腹部痉挛性疼痛）的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"preventing or relieving colic (severe cramping pain in the abdomen, especially in infants or animals).","zh":"防治或缓解肠绞痛（腹部剧烈痉挛性疼痛，尤指婴儿或动物）。"},"examples":[{"en":"The vet prescribed an antiscolic medicine to ease the horse’s abdominal cramps.","zh":"兽医开了防肠绞痛的药来缓解马的腹部痉挛。"},{"en":"Some herbal teas are traditionally used as antiscolic remedies for mild stomach cramps.","zh":"有些草本茶在传统上被当作缓解轻度胃痉挛的防肠绞痛疗法。"}]}],"synonyms":["antispasmodic","anticolic","carminative (often related)"],"phonetic":"/ˌæn.tiˈskɑː.lɪk/","extraExplanation":["“Antiscolic”多见于医学与兽医学语境，构词为 anti-（反、抗）+ colic（绞痛）。日常英语里更常说 “for colic / to relieve colic” 或直接用具体药名。","“Colic”在英语里既可指婴儿不明原因的持续哭闹（infant colic），也常指动物（尤其马）的腹痛；因此相关药物与护理建议在兽医领域更常见。"]}
{"word":"antiscorbutic","summary":{"en":"Antiscorbutic means ‘preventing/curing scurvy,’ or something (food/medicine) used to prevent or treat scurvy.","zh":"antiscorbutic 指“抗坏血病的”，也可指用于预防或治疗坏血病的食物或药物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Preventing or curing scurvy (a disease caused by lack of vitamin C).","zh":"抗坏血病的；用于预防或治疗坏血病（通常因缺乏维生素C而致）。"},"examples":[{"en":"Citrus fruits are antiscorbutic because they provide vitamin C.","zh":"柑橘类水果具有抗坏血病作用，因为它们能提供维生素C。"},{"en":"Sailors once carried antiscorbutic foods like lemons on long voyages.","zh":"过去水手在长途航行时会携带柠檬等抗坏血病食物。"}]},{"partOfSpeech":"n.","definition":{"en":"A medicine or food that prevents or treats scurvy.","zh":"抗坏血病药（或食物）；用于预防或治疗坏血病的东西。"},"examples":[{"en":"The ship’s doctor recommended an antiscorbutic for the crew.","zh":"船医建议给船员使用抗坏血病药（或食物）。"}]}],"synonyms":["antiscorbutic agent","vitamin C–rich","ascorbic (related)"],"phonetic":"/ˌæn.ti.skɔrˈbjuː.tɪk/","extraExplanation":["词源小提示：anti- 表示“反、抗”，scorbutic 与 scurvy（坏血病）有关，合起来就是“抗坏血病的”。","历史文化背景：坏血病在大航海时代的远洋航行中很常见，因为船上缺少新鲜蔬果。后来人们发现柠檬/酸橙等富含维生素C的食物能预防坏血病，因此“antiscorbutic”常出现在早期医学、海军和航海相关的英文文献里。"]}
{"word":"antiscorbutical","summary":{"en":"An older adjective meaning “preventing or curing scurvy.”","zh":"较古旧的形容词，意为“防治坏血病的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Preventing or curing scurvy (a disease caused by vitamin C deficiency).","zh":"防治坏血病的；抗坏血病的（坏血病由维生素C缺乏引起）。"},"examples":[{"en":"Sailors once relied on antiscorbutical foods like lemons to avoid scurvy on long voyages.","zh":"过去水手在长途航行中会依靠柠檬等抗坏血病食物来预防坏血病。"},{"en":"The ship’s doctor recommended an antiscorbutical diet rich in fresh fruit.","zh":"船医建议采用富含新鲜水果的抗坏血病饮食。"}]}],"synonyms":["antiscorbutic","vitamin C–rich","anti-scurvy"],"phonetic":"/ˌæn.ti.skɔrˈbju.tɪ.kəl/","extraExplanation":["这是较为古旧、学术/医学色彩浓的词，现代更常用 **antiscorbutic**（抗坏血病的）或直接说 “vitamin C–rich / rich in vitamin C”（富含维生素C的）。","词源可拆为 **anti-**（反、抗）+ **scorbutic**（坏血病的；与scurvy相关），整体意思就是“对抗坏血病的”。在航海史语境中常见，因为远洋航行缺乏新鲜蔬果容易导致坏血病。"]}
{"word":"antiscriptural","summary":{"en":"Antiscriptural means contrary to the Bible or not supported by Scripture.","zh":"Antiscriptural 指与《圣经》相违背或缺乏《圣经》依据的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to, contrary to, or not supported by the Bible (Scripture).","zh":"反《圣经》的；与《圣经》教义相违背的；不符合《圣经》依据的。"},"examples":[{"en":"Some church leaders criticized the teaching as antiscriptural.","zh":"一些教会领袖批评这种教导是反《圣经》的。"},{"en":"He argued that the practice was antiscriptural and should be avoided.","zh":"他认为这种做法违背《圣经》，应当避免。"}]}],"synonyms":["unscriptural","unbiblical","contrary to Scripture"],"phonetic":"/ˌæn.tiˈskrɪp.tʃɚ.əl/","extraExplanation":["“antiscriptural”常见于基督教语境，尤其在神学讨论、讲道或教会争议中，用来评价某个观点/做法是否与《圣经》文本或传统解释一致。","构词：anti-（反对）+ scriptural（《圣经》的）。在写作中常见同义表达还有 “unscriptural”（不符合《圣经》的）。"]}
{"word":"antiscripturism","summary":{"en":"Antiscripturism is a rare term meaning opposition to making scripture the main or only religious authority.","zh":"Antiscripturism（较少见）指反对把经文/经典当作主要或唯一宗教权威的立场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to scripturalism; the view that religious authority should not be based primarily or solely on sacred scriptures (especially the Bible).","zh":"反对“唯经论/圣经至上主义”；认为宗教权威不应主要或完全建立在（尤其是《圣经》等）经典文本之上。"},"examples":[{"en":"Some theologians criticized antiscripturism because they felt it weakened the role of the Bible in doctrine.","zh":"一些神学家批评反唯经论，因为他们认为这会削弱《圣经》在教义中的作用。"},{"en":"Her essay argues against antiscripturism and defends careful, contextual reading of scripture.","zh":"她的文章反对反唯经论，并为对经文进行谨慎、重视语境的解读辩护。"}]}],"synonyms":["opposition to scripturalism","rejection of sola scriptura","anti-biblicism (context-dependent)"],"phonetic":"/ˌæn.taɪˈskrɪp.tʃəˌrɪz.əm/","extraExplanation":["这个词非常少见，多见于宗教史、神学争论或学术写作中，用来指“反对以经典文本作为最高/唯一权威”的立场。它通常出现在讨论“传统（tradition）—理性（reason）—经验（experience）—经典（scripture）”这些权威来源如何排序或如何平衡的语境里。","构词上可拆为 anti-（反对）+ scripture（经典/经文）+ -ism（主义/立场）。日常英语里更常见的表达通常是“opposition to biblical authority / rejection of sola scriptura（拒绝‘唯独圣经’）”，视具体宗派与语境而定。"]}
{"word":"antiscrofulous","summary":{"en":"Antiscrofulous means intended to prevent or cure scrofula (TB-related swollen lymph glands), a term mostly found in older medical writing.","zh":"Antiscrofulous 指“抗瘰疬的”，用于预防或治疗瘰疬（与结核相关的淋巴结病变），多见于较旧的医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"used to prevent or treat scrofula (a form of tuberculosis affecting lymph glands, especially in the neck).","zh":"用于预防或治疗瘰疬（常指结核感染导致的淋巴结肿大，尤以颈部为多）。"},"examples":[{"en":"The old medical text described iodine as an antiscrofulous remedy.","zh":"那本旧医学书把碘描述为一种抗瘰疬的疗法。"},{"en":"In the 1800s, some mineral waters were advertised as antiscrofulous.","zh":"在19世纪，一些矿泉水被宣传为具有抗瘰疬作用。"}]}],"synonyms":["anti-scrofulous","antitubercular (broader/modern)","anti-TB (informal, broader)"],"phonetic":"/ˌæn.tiˈskroʊ.fjə.ləs/","extraExplanation":["“antiscrofulous”是较少见、偏历史的医学用语：anti-（“反、抗”）+ scrofulous（“瘰疬的”）。现代医学更常用“treatments for tuberculous lymphadenitis / TB-related lymph node infection（结核性淋巴结炎的治疗）”来表达。","“scrofula（瘰疬）”在欧洲历史上很常见，过去人们甚至把某些疗法（如碘制剂、温泉疗养）称为“抗瘰疬”，但这些说法多见于旧医书或历史语境。"]}
{"word":"antisecretory","summary":{"en":"Antisecretory describes something (usually a medicine) that reduces bodily secretions, especially stomach acid.","zh":"Antisecretory 指（通常是药物）能减少体内分泌、尤其是抑制胃酸分泌的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Reducing or preventing secretion (the release of fluids or substances) in the body, especially stomach acid or other digestive secretions.","zh":"（医学）抑制或减少体内分泌（释放液体或物质）的，尤指抑制胃酸或其他消化液分泌的。"},"examples":[{"en":"Proton pump inhibitors have strong antisecretory effects on stomach acid.","zh":"质子泵抑制剂对胃酸有很强的抑酸（抗分泌）作用。"},{"en":"The doctor prescribed an antisecretory drug to help with acid reflux.","zh":"医生开了抑制分泌的药物来缓解胃食管反流。"}]}],"synonyms":["anti-secretory","acid-suppressing","antacid (broader/less precise)","antisecretory agent (phrase)"],"phonetic":"/ˌæn.ti.sɪˈkriː.tə.ri/","extraExplanation":["这个词常见于药理学/消化科语境，通常与“gastric antisecretory therapy（胃抑酸/抗分泌治疗）”搭配使用，用来描述抑制胃酸分泌的治疗策略。常见相关药物类别包括PPI（质子泵抑制剂）和H2受体拮抗剂。","构词法：anti-（反、抗）+ secretory（分泌的）。理解前缀anti-有助于记忆：antibacterial（抗菌）、anti-inflammatory（抗炎）等。"]}
{"word":"antisegregation","summary":{"en":"Antisegregation means opposing segregation, especially racial segregation, or the movement/policy that fights it.","zh":"Antisegregation 指反对（尤其是种族）隔离的，或指反隔离的运动、政策与行动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposing racial segregation (the policy or practice of keeping groups, especially races, separated).","zh":"反对种族隔离的；反隔离的（指反对把不同群体，尤其不同种族，分开对待的政策或做法）。"},"examples":[{"en":"The court issued an antisegregation ruling that required schools to admit students of all races.","zh":"法院作出反隔离裁决，要求学校接纳所有种族的学生。"},{"en":"Antisegregation laws helped end legally enforced separation in public places.","zh":"反隔离法律帮助结束了公共场所中法律强制的隔离。"}]},{"partOfSpeech":"n.","definition":{"en":"the movement, policy, or action that fights against segregation.","zh":"反隔离运动；反隔离政策或行动。"},"examples":[{"en":"Antisegregation became a major goal of the civil rights movement.","zh":"反隔离成为民权运动的重要目标之一。"},{"en":"Local leaders organized antisegregation efforts in transportation and housing.","zh":"当地领袖在交通与住房领域组织了反隔离行动。"}]}],"synonyms":["anti-segregation","desegregation (related)","integrationist (related)","anti-discrimination (broader)"],"phonetic":"/ˌæntiˌsɛɡrəˈɡeɪʃən/","extraExplanation":["“antisegregation”常见于美国历史与法律语境，尤其与20世纪中期的民权运动相关。它常用来修饰判决（ruling）、法律（law）、政策（policy）、抗议（protest）或行动（efforts）。","词形上由前缀 anti-（反对）+ segregation（隔离）构成，意思直观，但在日常口语中更常见的说法是“anti-segregation”（带连字符）或直接说“desegregation / desegregation efforts（取消隔离/废除隔离的努力）”。"]}
{"word":"antiseismic","summary":{"en":"Antiseismic describes buildings or designs made to resist earthquake damage.","zh":"antiseismic 指为抵抗地震破坏而设计的建筑或结构，意为“抗震的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed or built to reduce damage from earthquakes; earthquake-resistant.","zh":"抗震的；防震的（指为减少地震破坏而设计或建造的）。"},"examples":[{"en":"The hospital was rebuilt with antiseismic features after the earthquake.","zh":"地震后，这家医院采用了抗震设计进行重建。"},{"en":"Japan has strict antiseismic building codes in many cities.","zh":"日本许多城市都有严格的抗震建筑规范。"},{"en":"Engineers tested the antiseismic structure on a shaking table.","zh":"工程师在振动台上测试这座抗震结构。"}]}],"synonyms":["earthquake-resistant","quake-resistant","seismic-resistant"],"phonetic":"/ˌæn.tiˈsaɪz.mɪk/","extraExplanation":["词源提示：anti- 表示“反、抗”，seismic 来自希腊语 seismos（“地震”）。合起来就是“抗地震的”。","使用场景：常见于工程、建筑、城市规划语境。日常口语里更常说 earthquake-resistant。","相关词：seismic（地震的）、aseismic（无地震活动的）、seismology（地震学）。"]}
{"word":"antiseizure","summary":{"en":"Antiseizure means used to prevent or control seizures, or a drug that does this.","zh":"antiseizure 指用于预防或控制癫痫发作的（药物），也可指抗癫痫药本身。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a medicine) used to prevent or control seizures (sudden episodes of abnormal brain activity).","zh":"（指药物）用于预防或控制癫痫发作（大脑异常放电导致的突然发作）。"},"examples":[{"en":"The doctor prescribed an antiseizure medication to reduce her seizure frequency.","zh":"医生开了抗癫痫药来降低她发作的频率。"},{"en":"Some antiseizure drugs can cause sleepiness, especially at the beginning.","zh":"一些抗癫痫药可能会引起嗜睡，尤其在刚开始服用时。"},{"en":"He takes an antiseizure medicine every day and sees his neurologist regularly.","zh":"他每天服用抗癫痫药，并定期复诊神经科医生。"}]},{"partOfSpeech":"n.","definition":{"en":"A medicine that prevents or controls seizures; an antiseizure drug.","zh":"抗癫痫药；用于预防或控制癫痫发作的药物。"},"examples":[{"en":"Valproate is one antiseizure used for certain types of epilepsy.","zh":"丙戊酸是用于某些癫痫类型的一种抗癫痫药。"},{"en":"They switched to a different antiseizure because of side effects.","zh":"由于副作用，他们换用了另一种抗癫痫药。"}]}],"synonyms":["anti-seizure","antiepileptic","anticonvulsant"],"phonetic":"/ˌæn.tiˈsiː.ʒɚ/","extraExplanation":["“antiseizure”常见于医学语境，也常写作“anti-seizure”。在日常英语中，医生或科普文章也会用更传统的说法“antiepileptic (drug)”或缩写“AED”。需要注意：并非所有“antiseizure medications”只用于癫痫，它们有时也用于偏头痛、神经性疼痛或情绪相关问题，但用途取决于具体药物与医生判断。"]}
{"word":"antiselene","summary":{"en":"Antiselene is the point in the sky directly opposite the Moon.","zh":"Antiselene 指天空中与月亮位置正相对的点（反月点）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Astronomy) The point in the sky directly opposite the Moon (the anti-lunar point), i.e., about 180° away from the Moon along the sky.","zh":"（天文学）与月亮在天空中位置正相对的点（反月点/对月点），也就是与月亮相隔约180度的方向。"},"examples":[{"en":"When the Moon is near the horizon, the antiselene is roughly on the opposite horizon.","zh":"当月亮靠近地平线时，反月点大致在对面的地平线附近。"},{"en":"Some atmospheric effects are described relative to the Moon and the antiselene.","zh":"一些大气现象会用月亮与反月点之间的位置关系来描述。"}]}],"synonyms":["anti-lunar point","opposition point (of the Moon)"],"phonetic":"/ˌæn.ti.səˈliːni/","extraExplanation":["这是一个相对少见的天文学术语，构词为 anti-（反、相对）+ Selene（塞勒涅，希腊神话中的月亮女神名，常用来指“月亮”）。","在观测与“背向光源方向”有关的现象时（例如与月光方向相反的天空区域），可能会用到这个概念；更常见的近义表达是 anti-lunar point（反月点）。"]}
{"word":"antisemite","summary":{"en":"An antisemite is a person who hates, distrusts, or discriminates against Jewish people.","zh":"antisemite 指反犹太主义者，即对犹太人抱有偏见、仇恨或进行歧视的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who has prejudice against Jewish people, or who hates or discriminates against Jewish people","zh":"反犹太主义者；对犹太人抱有偏见、仇恨或歧视的人"},"examples":[{"en":"The organization condemned the antisemite’s hateful remarks.","zh":"该组织谴责那名反犹太主义者的仇恨言论。"},{"en":"Schools should teach students how to recognize and challenge antisemitic stereotypes.","zh":"学校应教学生如何识别并反驳反犹太主义刻板印象。"}]}],"synonyms":["anti-Jewish bigot","Jew-hater","racist (in this context)"],"phonetic":"/ˌæn.tiˈsɛmaɪt/","extraExplanation":["这个词带有强烈的负面评价，通常用于谴责仇恨与歧视行为。在正式写作或新闻语境中很常见，但在日常对话里使用时要注意语境与措辞，以避免把复杂问题简化为标签。","“antisemite / antisemitic”与“anti-Jewish（反犹太的）”常可互换，但前者更常指一种意识形态或偏见体系。历史上，反犹主义与欧洲近代民族主义、阴谋论以及纳粹德国的种族迫害密切相关，因此具有沉重的历史背景。","拼写上你可能会看到 antisemite 和 anti-Semite 两种；当代学术与媒体越来越倾向使用不带连字符或大写的 antisemitism/antisemite，以强调它指的是针对犹太人的偏见，而不是对“闪米特人（Semites）”这一语言/族群概念的泛指。"]}
{"word":"antisemitic","summary":{"en":"Antisemitic describes prejudice, hatred, or discrimination against Jewish people.","zh":"antisemitic 指对犹太人抱有偏见、仇恨或歧视的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Showing hatred, prejudice, or discrimination against Jewish people.","zh":"反犹太人的；对犹太人抱有仇恨、偏见或歧视的。"},"examples":[{"en":"The newspaper was criticized for publishing an antisemitic cartoon.","zh":"那家报纸因刊登反犹太人的漫画而受到批评。"},{"en":"Schools teach students to recognize and reject antisemitic stereotypes.","zh":"学校教育学生识别并拒绝反犹太人的刻板印象。"},{"en":"The politician apologized for using language that many people considered antisemitic.","zh":"那位政客为使用被许多人认为反犹太的措辞而道歉。"}]}],"synonyms":["anti-Jewish","Jew-hating","prejudiced (against Jews)"],"phonetic":"/ˌæn.tiˈsɛm.ɪ.tɪk/","extraExplanation":["“antisemitic”是一个严肃且带有强烈负面评价的词，常用于讨论仇恨言论、偏见与歧视。使用时要谨慎，避免把对某个政府政策（例如对以色列政府政策的批评）与对犹太人这个群体的偏见混为一谈。","拼写上常见两种：antisemitic 与 anti-Semitic。现代学术与媒体中“antisemitic”更常见，因为它强调这是对犹太人的偏见，而不是对某个名为“Semitic”的种族的反对。"]}
{"word":"antisemitism","summary":{"en":"Antisemitism means prejudice, hostility, or discrimination against Jewish people.","zh":"Antisemitism 指对犹太人的偏见、敌意或歧视（反犹太主义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Hostility, prejudice, or discrimination against Jewish people as a group.","zh":"对犹太人群体的敌意、偏见或歧视。"},"examples":[{"en":"The school has a zero-tolerance policy for racism and antisemitism.","zh":"学校对种族主义和反犹太主义实行零容忍政策。"},{"en":"It’s important to recognize antisemitism in jokes, stereotypes, and online harassment.","zh":"识别笑话、刻板印象和网络骚扰中的反犹太主义很重要。"},{"en":"Many countries have laws and education programs aimed at preventing antisemitism.","zh":"许多国家制定了法律并开展教育项目以预防反犹太主义。"}]}],"synonyms":["anti-Jewish prejudice","anti-Jewish hatred","Jew-hatred"],"phonetic":"/ˌæn.tiˈsɛm.əˌtɪz.əm/","extraExplanation":["“antisemitism/anti-Semitism”指针对犹太人的偏见与歧视。拼写上既常见连字符形式（anti-Semitism）也常见不加连字符、全小写形式（antisemitism）；一些机构更偏好“antisemitism”，以强调这是对犹太人的仇恨，而不是对“闪米特人（Semites）”这一语言/族群概念的笼统“反对”。","它既可以表现为个人层面的言语与行为（侮辱、刻板印象、排斥），也可以是制度或社会层面的不平等对待；还可能以阴谋论（把社会问题归咎于犹太人、夸大控制力）等形式出现。","该词在英语中常见于新闻、历史与社会议题讨论（如大屠杀/纳粹迫害相关语境）。在表达时建议聚焦“对犹太人的偏见/歧视/仇恨”这一核心含义，并避免使用可能延续刻板印象的例子。"]}
{"word":"antisense","summary":{"en":"Antisense refers to a complementary nucleic-acid sequence used to bind RNA and often block gene expression.","zh":"antisense 指与RNA互补的核酸序列/分子，常用于结合RNA并抑制基因表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Molecular biology) Related to or using a nucleotide sequence that is complementary to an mRNA (sense) sequence, often used to block gene expression.","zh":"（分子生物学）指与mRNA（正义链/有义链）序列互补的核酸序列相关的；常用于抑制基因表达。"},"examples":[{"en":"Researchers used an antisense oligonucleotide to reduce the production of a harmful protein.","zh":"研究人员使用反义寡核苷酸来减少有害蛋白的产生。"},{"en":"Antisense therapy can target a specific gene without changing the entire genome.","zh":"反义疗法可以针对特定基因，而不必改变整个基因组。"}]},{"partOfSpeech":"n.","definition":{"en":"An antisense sequence or molecule (such as an antisense RNA or antisense oligonucleotide) that binds to a target RNA by base pairing.","zh":"反义序列/反义分子（如反义RNA或反义寡核苷酸），通过碱基配对与目标RNA结合。"},"examples":[{"en":"The team designed an antisense that binds tightly to the virus’s RNA.","zh":"团队设计了一段能与病毒RNA紧密结合的反义分子。"},{"en":"Adding antisense prevented the cell from translating the message into protein.","zh":"加入反义分子阻止细胞将该信息翻译成蛋白质。"}]}],"synonyms":["complementary","antisense oligonucleotide","antisense RNA"],"phonetic":"/ˌæn.tiˈsɛns/","extraExplanation":["“sense（正义/有义）”通常指与mRNA序列相同（除T/U差异）的DNA链或能被翻译的方向；“antisense（反义）”与其互补，能通过配对阻断翻译或影响剪接等过程。","常见搭配：antisense RNA（反义RNA）, antisense oligonucleotide/ASO（反义寡核苷酸）, antisense strand（反义链）。"]}
{"word":"antisensitivity","summary":{"en":"Antisensitivity means reduced sensitivity—reacting less strongly to stimuli or changes (sometimes used in technical contexts).","zh":"Antisensitivity 指“敏感度降低”，对刺激或变化的反应变弱（有时用于技术语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being less sensitive or reacting less strongly to something; reduced sensitivity","zh":"对某事物不那么敏感、反应较弱的性质；敏感度降低"},"examples":[{"en":"The medication can cause antisensitivity to pain, so be careful not to injure yourself.","zh":"这种药可能会导致对疼痛的反应变弱，所以要小心别让自己受伤。"},{"en":"Long-term exposure sometimes leads to antisensitivity to certain smells.","zh":"长期接触有时会让人对某些气味变得不那么敏感。"}]},{"partOfSpeech":"n.","definition":{"en":"(technical) a measure or tendency in a system to resist responding to small changes in input; low responsiveness","zh":"（技术）系统对输入的小变化不易作出反应的程度；低响应性"},"examples":[{"en":"Engineers adjusted the settings to increase antisensitivity to minor electrical noise.","zh":"工程师调整了设置，让系统对轻微电噪声更不容易受影响。"}]}],"synonyms":["reduced sensitivity","low sensitivity","insensitivity","low responsiveness","desensitization (context-dependent)"],"phonetic":"/ˌæntiˌsɛnsəˈtɪvəti/","extraExplanation":["“antisensitivity”在日常英语里很少见，更常见的表达是“reduced sensitivity / lower sensitivity（敏感度降低）”或在医学语境中用“desensitization（脱敏）”。","写作中如果你想表达“对批评不那么敏感/不易受伤”，通常用“less sensitive to criticism”或“thick-skinned（脸皮厚、不容易受伤）”，而不是“antisensitivity”。"]}
{"word":"antisensitizer","summary":{"en":"An antisensitizer is a chemical that reduces the light sensitivity of photographic or other light‑sensitive materials.","zh":"antisensitizer 指用于降低摄影等感光材料感光度的化学添加剂（抗增感剂）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance added to a light‑sensitive material (especially photographic film or paper) to reduce its sensitivity, often to prevent unwanted fogging or exposure during handling.","zh":"（尤指摄影胶片/相纸中加入的）抗增感剂；用于降低感光材料的感光度，避免操作时产生雾化或意外曝光的化学物质。"},"examples":[{"en":"In the darkroom, an antisensitizer can help protect photographic paper from accidental stray light.","zh":"在暗房里，抗增感剂可以帮助保护相纸不被意外杂光影响。"},{"en":"The technician added an antisensitizer to reduce the emulsion’s sensitivity during processing.","zh":"技术员加入抗增感剂，以在处理过程中降低乳剂的感光度。"}]}],"synonyms":["desensitizer","anti-fogging agent","desensitizing agent"],"phonetic":"/ˌæn.tiˈsɛn.səˌtaɪ.zɚ/","extraExplanation":["这个词多见于摄影化学与感光材料领域，属于较专业的术语，日常英语里不常用。","构词上是 anti-（反、抗）+ sensitizer（增感剂/敏化剂），字面意思就是“反增感的东西”，即用于“降低感光/敏化效果”的添加剂。"]}
{"word":"antisensitizing","summary":{"en":"Antisensitizing means preventing sensitization, often used in medical contexts to reduce or prevent allergic/immune sensitivity.","zh":"Antisensitizing 指“抗致敏的/防致敏的”，多用于医学语境，表示降低或预防过敏或免疫敏感化。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Preventing someone or something from becoming sensitized (especially in medicine: reducing or preventing an allergic or immune sensitization).","zh":"防止（人或物）产生“致敏”的；尤指医学上降低或预防过敏/免疫致敏的。"},"examples":[{"en":"The doctor prescribed an antisensitizing treatment to reduce the risk of an allergic reaction.","zh":"医生开了抗致敏治疗，以降低发生过敏反应的风险。"},{"en":"Researchers are testing antisensitizing strategies to prevent sensitization to a new drug.","zh":"研究人员正在测试抗致敏策略，以防止对一种新药产生致敏。"}]}],"synonyms":["desensitizing","anti-allergic","non-sensitizing"],"phonetic":"/ˌæntiˈsɛnsəˌtaɪzɪŋ/","extraExplanation":["“antisensitizing”多见于医学、药理学或免疫学语境，日常英语更常用的是“desensitizing（脱敏的/使不敏感的）”。两者常常意思接近，但“anti-”更强调“预防致敏发生”，而“de-”更常强调“把已经形成的敏感状态减弱”。"]}
{"word":"antisensuality","summary":{"en":"Antisensuality means opposition to sensual pleasure and bodily desires, often for moral or spiritual reasons.","zh":"antisensuality 指反对感官享乐与肉体欲望的观念或态度，常出于道德或精神/宗教原因。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to sensuality; the belief or attitude that physical pleasure and bodily desires should be avoided or controlled (often for moral, religious, or philosophical reasons).","zh":"反感官享乐；主张应避免或严格控制肉体快感与欲望的观念或态度（常见于道德、宗教或哲学语境）。"},"examples":[{"en":"Some religious traditions emphasize antisensuality, encouraging modest living and self-control.","zh":"一些宗教传统强调反感官享乐，鼓励简朴生活与自我克制。"},{"en":"His writing shows antisensuality, treating pleasure as a distraction from spiritual growth.","zh":"他的写作带有反感官享乐的倾向，把享乐视为灵性成长的干扰。"}]}],"synonyms":["asceticism","puritanism","austerity","self-denial"],"phonetic":"/ˌæn.tiˌsɛnʒuˈæl.ə.ti/","extraExplanation":["构词理解：anti-（反对）+ sensual（感官的/肉欲的）+ -ity（名词后缀，表示“性质/状态”），整体就是“反对感官享乐的状态/观念”。","使用提示：该词较少见，更常见的相关表达是 asceticism（禁欲主义）、austere morality（严苛的道德观）、anti-pleasure attitude（反享乐态度）等。"]}
{"word":"antisensuous","summary":{"en":"Antisensuous means opposed to sensory pleasure, often favoring restraint, intellect, or spirituality over bodily enjoyment.","zh":"Antisensuous 指反对感官享乐、强调克制，常偏向理性或灵性而非身体愉悦。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to sensuous pleasure or enjoyment of physical/sensory experience; tending to distrust or reject pleasure from the senses (often linked with strict morality or ascetic attitudes).","zh":"反对感官享乐的；不赞成或排斥由身体/感官带来的愉悦（常与严苛道德观或禁欲倾向相关）。"},"examples":[{"en":"Some critics describe his early poetry as antisensuous, avoiding images of taste, touch, and desire.","zh":"一些评论家认为他早期的诗歌具有反感官倾向，刻意回避味觉、触觉与欲望意象。"},{"en":"Her upbringing was antisensuous, treating comfort and pleasure as distractions from duty.","zh":"她的成长环境带有反感官色彩，把舒适与享乐视为对责任的干扰。"},{"en":"The movement promoted an antisensuous ideal of simplicity in art and life.","zh":"该运动推崇一种反感官的“简朴”理想，贯穿艺术与生活。"}]},{"partOfSpeech":"adj.","definition":{"en":"(In art, religion, or philosophy) Emphasizing intellect, spirituality, or discipline over sensory beauty and bodily feeling.","zh":"（用于艺术、宗教或哲学语境）强调理性、灵性或自律高于感官之美与身体感受。"},"examples":[{"en":"The essay contrasts a sensual style of painting with an antisensuous, symbolic one.","zh":"这篇文章对比了感官化的绘画风格与反感官、象征性的风格。"},{"en":"His antisensuous worldview valued contemplation more than physical experience.","zh":"他的反感官世界观更重视沉思而非身体体验。"}]}],"synonyms":["ascetic","austere","puritanical","unsensual","anti-hedonistic"],"phonetic":"/ˌæn.tiˈsɛn.tʃu.əs/","extraExplanation":["“antisensuous”由 anti-（反对）+ sensuous（感官的、带来感官愉悦的）构成，常见于文学批评、艺术史或宗教/伦理讨论中，用来描述一种对“身体欲望、感官美感”保持警惕甚至排斥的态度。","它并不等同于 “insensitive（不敏感的）”。antisensuous 关注的是对感官享受的价值判断（认为不应沉溺/应克制），而不是感觉能力的强弱。"]}
{"word":"antisensuously","summary":{"en":"“Antisensuously” means “in a way that avoids or opposes sensuous (sense-pleasing) effects.”","zh":"“antisensuously”意为“以避免或反对感官愉悦效果的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is opposed to sensuousness (the enjoyment or stimulation of the physical senses); without appealing to the senses.","zh":"以反感官享受的方式；不诉诸感官刺激地；刻意避免感官快感地。"},"examples":[{"en":"The director filmed the love story antisensuously, focusing on quiet conversation rather than physical intimacy.","zh":"导演以一种反感官刺激的方式拍这段爱情故事，更强调安静的对话而非身体亲密。"},{"en":"The room was decorated antisensuously—plain colors, hard lines, and no soft lighting.","zh":"这个房间的装饰刻意反感官享受——素色、硬朗线条，没有柔和灯光。"}]}],"synonyms":["austerely","plainly","unsensually","without sensual appeal","ascetically"],"phonetic":"/ˌæn.tiˈsɛnʃuəsli/","extraExplanation":["“antisensuously”非常少见，多用于评论艺术、文学或审美风格。更常见的表达包括：“in an unsensual way / without sensual appeal / austerely（朴素克制地）”。","构词：anti-（反对）+ sensuous（感官的、带来感官愉悦的）+ -ly（副词后缀）。注意 sensuous ≠ sensual：sensuous更偏“感官体验/审美”，sensual更偏“性欲/肉欲”语境。"]}
{"word":"antisensuousness","summary":{"en":"Antisensuousness means a dislike of sensual pleasure, or a preference for restraint and intellect over sensory richness (often in art or moral attitudes).","zh":"antisensuousness 指对感官享受的反感/回避，或在审美与观念上更推崇克制与理性而非浓厚的感官体验。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tendency to dislike, distrust, or avoid sensual pleasure (things experienced through the senses, such as taste, touch, smell, music, or physical comfort).","zh":"反感官享受；对感官乐趣（如味觉、触觉、嗅觉、音乐或身体舒适等）的不喜、戒备或回避倾向。"},"examples":[{"en":"His antisensuousness made him suspicious of any art that tried to be purely pleasurable.","zh":"他的反感官享受倾向让他对任何只追求愉悦的艺术都抱有怀疑。"},{"en":"The group’s antisensuousness showed in their strict rules about food, dress, and entertainment.","zh":"这个团体在饮食、穿着和娱乐方面的严格规定体现了他们的反感官享受倾向。"}]},{"partOfSpeech":"n.","definition":{"en":"In art, literature, or philosophy, an attitude that values restraint, moral purity, or intellect over rich sensory imagery and physical feeling.","zh":"（艺术/文学/哲学中）反感官主义：强调克制、道德纯净或理性胜过浓烈的感官描写与身体感受的态度。"},"examples":[{"en":"Some critics described the novel’s style as a kind of antisensuousness, avoiding lush descriptions of color and scent.","zh":"一些评论家认为这部小说的风格带有反感官主义色彩，刻意回避对颜色与气味等的浓艳描写。"},{"en":"Her essays argue that antisensuousness can limit how deeply we respond to poetry.","zh":"她的文章认为反感官主义会限制我们对诗歌产生深层共鸣的能力。"}]}],"synonyms":["asceticism","austerity","puritanism","restraint","anti-sensuality"],"phonetic":"/ˌæn.tiˈsɛn.ʃu.əs.nəs/","extraExplanation":["这个词比较少见，结构是 anti-（反对）+ sensuous（感官的、给感官带来愉悦的）+ -ness（名词后缀），字面意思就是“反感官性”。","注意它通常不是指“反性感”（anti-sexual），而是更广义地指对“感官愉悦/感官审美”的不信任或回避，常出现在宗教禁欲、道德主义或某些审美批评的语境中。"]}
{"word":"antisepalous","summary":{"en":"A botanical adjective meaning “opposite a sepal,” often describing the position of stamens in a flower.","zh":"植物学形容词，意为“与萼片相对”，常用来描述花中雄蕊的位置。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Positioned opposite a sepal (one of the outer leaf-like parts of a flower). Often used to describe stamens that stand in front of sepals rather than petals.","zh":"（植物学）与萼片相对（位于萼片的正对位置）。常用来描述雄蕊的位置：雄蕊在萼片前方，而不是在花瓣前方。"},"examples":[{"en":"In this species, the stamens are antisepalous, alternating with the petals.","zh":"在这种植物中，雄蕊为对萼（antisepalous），与花瓣交错排列。"},{"en":"The diagram shows five antisepalous stamens, each opposite a sepal.","zh":"图示显示有五枚对萼雄蕊，每一枚都与一片萼片相对。"}]}],"synonyms":["opposite the sepals","(related) antipetalous"],"phonetic":"/ˌæn.tiˈsɛp.ə.ləs/","extraExplanation":["“anti-”在这里表示“相对、对着”，不是“反对”的意思。","花的器官通常按“轮”（whorls）排列：萼片（sepals）在最外轮，花瓣（petals）在内一轮；若雄蕊与萼片相对称为antisepalous，若与花瓣相对则称为antipetalous。","该词多见于植物形态学描述、植物志（flora）和分类学文献中，日常英语很少使用。"]}
{"word":"antisepsin","summary":{"en":"Antisepsin is a rare, historical word for an antiseptic preparation used to prevent infection.","zh":"Antisepsin 是一个罕见的历史用词，指用于预防感染的消毒/防腐制剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, historical) An antiseptic substance or preparation used to prevent infection by killing or stopping the growth of germs.","zh":"（罕见／历史用语）一种“防腐/杀菌剂”或消毒制剂，用来抑制或杀死细菌以预防感染。"},"examples":[{"en":"The label claimed the solution contained antisepsin to keep wounds from becoming infected.","zh":"标签宣称该溶液含有 antisepsin，可防止伤口感染。"},{"en":"In older medical advertisements, antisepsin was promoted as a household antiseptic.","zh":"在早期的医药广告中，antisepsin 被宣传为家庭常备的消毒用品。"}]}],"synonyms":["antiseptic","disinfectant","germicide"],"phonetic":"/ˌæn.tiˈsɛp.sɪn/","extraExplanation":["这个词在现代英语中非常少见，常见于旧式文献、广告或产品名/商标语境中。实际指代的具体化学成分可能因时代或品牌不同而不同；现代更常用的通用词是 antiseptic（消毒剂/防腐剂）或 disinfectant（消毒剂，用于物体表面）。"]}
{"word":"antisepsis","summary":{"en":"Antisepsis means preventing infection by killing or inhibiting germs, especially by using antiseptics on living tissue.","zh":"Antisepsis 指通过杀灭或抑制病菌来预防感染，尤指在皮肤或伤口等活体组织上使用消毒/防腐药剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The prevention of infection by stopping or killing germs (microorganisms), especially by using antiseptic chemicals on living tissue (like skin or wounds).","zh":"通过抑制或杀灭病菌（微生物）来预防感染，尤指在活体组织（如皮肤或伤口）上使用消毒/防腐药剂。"},"examples":[{"en":"Handwashing and alcohol gel are basic antisepsis methods in hospitals.","zh":"洗手和酒精免洗凝胶是医院里最基础的防感染消毒措施。"},{"en":"The nurse cleaned the cut to ensure proper antisepsis before bandaging it.","zh":"护士在包扎前先清洁伤口，以确保良好的消毒防感染处理。"}]}],"synonyms":["infection control","disinfection (general use)","use of antiseptics"],"phonetic":"/ˌæn.tiˈsɛp.sɪs/","extraExplanation":["“antisepsis”常与“asepsis”一起出现：antisepsis 指用化学方法在“活体组织”上减少/杀灭细菌；asepsis 更强调“无菌操作/环境”（如无菌手术器械与手术室流程），目标是尽量不让细菌进入。","词源提示：anti-（反对、对抗）+ sepsis（感染、腐败/败血症相关）。历史上，外科医生 Joseph Lister 推广用石炭酸（carbolic acid）进行手术消毒，被视为现代消毒理念的重要里程碑。"]}
{"word":"antiseptic","summary":{"en":"“Antiseptic” means a germ-killing substance used on skin/tissue, or something that prevents infection.","zh":"“antiseptic”指用于皮肤/组织的消毒剂（防腐剂），也可作形容词表示“防感染、杀菌的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A substance (or product) used on living skin or tissue to prevent infection by killing or stopping the growth of germs.","zh":"（用于活体皮肤或组织的）消毒剂；防腐剂，用来杀灭或抑制细菌以预防感染。"},"examples":[{"en":"Clean the cut with an antiseptic before you put on a bandage.","zh":"贴绷带之前先用消毒剂把伤口清洁一下。"},{"en":"The nurse applied antiseptic to the wound.","zh":"护士在伤口上涂了消毒剂。"},{"en":"Hand sanitizer is a common antiseptic for quick cleaning.","zh":"免洗洗手液是常见的快速清洁用消毒品。"}]},{"partOfSpeech":"adj.","definition":{"en":"Preventing infection; able to kill or control germs (especially when used on skin).","zh":"防感染的；杀菌的；消毒的（尤指用于皮肤）。"},"examples":[{"en":"Use an antiseptic cream on minor burns.","zh":"轻微烫伤可以用杀菌的药膏。"},{"en":"The doctor recommended an antiseptic solution for daily cleaning.","zh":"医生建议用消毒溶液每天清洁。"}]}],"synonyms":["germicide","antibacterial","sterilizing","sanitizer (common use)"],"phonetic":"/ˌæn.tiˈsɛp.tɪk/","extraExplanation":["“antiseptic”常和“disinfectant（消毒剂）”对比：antiseptic通常用于活体皮肤/组织（如伤口、皮肤），而disinfectant多用于非活体表面（如桌面、地板）。","词源：anti-（反、对抗）+ septic（与感染/腐败有关）。所以字面意思是“对抗感染的”。","日常搭配：antiseptic wipe（消毒湿巾）, antiseptic cream（杀菌膏）, antiseptic solution（消毒液）。"]}
{"word":"antiseptic-treated","summary":{"en":"Treated with an antiseptic to prevent infection.","zh":"经消毒/杀菌剂处理的，用于预防感染。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Describing something (such as a bandage, wipe, or surface) that has been treated with an antiseptic to prevent infection by killing or stopping the growth of germs.","zh":"（如绷带、湿巾或表面）经过消毒/杀菌剂处理的，用于杀灭或抑制细菌等病原体生长，从而预防感染。"},"examples":[{"en":"Use an antiseptic-treated wipe to clean the cut before you apply a bandage.","zh":"在贴创可贴之前，用消毒处理过的湿巾清洁伤口。"},{"en":"The nurse placed an antiseptic-treated dressing over the wound.","zh":"护士在伤口上覆盖了消毒处理过的敷料。"},{"en":"Antiseptic-treated pads can help reduce the risk of infection.","zh":"消毒处理过的棉片可以帮助降低感染风险。"}]}],"synonyms":["disinfectant-treated","antimicrobial-treated","germ-killing (treated)"],"phonetic":"/ˌæn.t̬iˈsɛp.tɪk ˈtriː.tɪd/","extraExplanation":["这是一个复合形容词（antiseptic + treated），常用连字符连接，尤其放在名词前作定语：an antiseptic-treated bandage。放在名词后作表语时有时也可不用连字符：The bandage is antiseptic treated（较少见，更常见仍保留连字符或改写为 treated with an antiseptic）。","antiseptic 指“抑菌/杀菌的消毒剂或消毒作用”，常用于医疗与急救用品包装说明。不要与 antibiotic（抗生素，主要对抗细菌感染的药物）混淆。"]}
{"word":"antiseptical","summary":{"en":"Antiseptical means preventing infection by killing or stopping the growth of bacteria; it’s a less common form of “antiseptic.”","zh":"Antiseptical 指防感染、消毒杀菌的；它是不如 antiseptic 常见的表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Preventing infection by stopping the growth of harmful bacteria; having the effect of an antiseptic.","zh":"（通过抑制细菌生长而）防止感染的；具有杀菌/防腐作用的。"},"examples":[{"en":"The nurse cleaned the cut with an antiseptical solution.","zh":"护士用消毒溶液清洗了伤口。"},{"en":"Use an antiseptical wipe before you apply the bandage.","zh":"贴绷带前先用消毒湿巾擦拭。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative, less common) Making something “cleaner” or safer by removing harmful influences.","zh":"（比喻，用法较少）净化的；去除有害影响使之更安全的。"},"examples":[{"en":"Some people see honest public debate as an antiseptical force in politics.","zh":"有些人认为坦诚的公共辩论能在政治中起到“净化”的作用。"}]}],"synonyms":["antiseptic","disinfecting","germ-killing","sterilizing"],"phonetic":"/ˌæn.tiˈsɛp.tɪ.kəl/","extraExplanation":["“antiseptical”在现代英语里不如“antiseptic”常见；很多情况下用“antiseptic”更自然（例如：an antiseptic wipe / antiseptic cream）。","词源上可理解为 anti-（反、对抗）+ septic（与腐败/感染有关）。在医学护理语境中多指消毒、防感染。"]}
{"word":"antiseptically","summary":{"en":"“Antiseptically” means “in a germ-killing, infection-preventing way.”","zh":"“antiseptically”表示“以消毒杀菌、预防感染的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that prevents infection by killing or stopping the growth of germs; using antiseptic methods (sterile/clean technique).","zh":"以消毒杀菌的方式；用防止感染的（抗菌/消毒）方法。"},"examples":[{"en":"The nurse cleaned the wound antiseptically before applying a bandage.","zh":"护士在包扎前用消毒方式清洁了伤口。"},{"en":"Please handle the equipment antiseptically to reduce the risk of contamination.","zh":"请以无菌/消毒方式操作设备，以降低污染风险。"},{"en":"The piercing was done antiseptically, and the studio explained aftercare clearly.","zh":"穿刺在消毒条件下进行，工作室也清楚说明了术后护理。"}]}],"synonyms":["sterilely","aseptically","sanitarily","hygienically"],"phonetic":"/ˌæn.təˈsɛp.tɪ.kli/","extraExplanation":["“antiseptically”来自“antiseptic（消毒的/防腐的）+ -ally（以……方式）”。日常写作中更常见的表达是“using antiseptic techniques / in a sterile way”。","它通常出现在医疗、护理、实验室、穿刺/纹身等强调“防感染、避免污染”的语境中。注意它不一定等于“完全无菌（sterile）”，但都强调减少细菌/病原体。"]}
{"word":"antisepticise","summary":{"en":"A verb meaning to disinfect or treat something with an antiseptic.","zh":"动词，指用消毒剂处理，使……杀菌或防感染。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something antiseptic (free from germs), especially by adding or using an antiseptic substance; to disinfect","zh":"使……具有杀菌/防感染作用（使无菌），尤指用消毒剂处理；消毒"},"examples":[{"en":"The nurse antisepticized the wound before putting on a bandage.","zh":"护士在包扎前先给伤口做了消毒处理。"},{"en":"All instruments must be antisepticized between patients.","zh":"所有器械在不同病人之间都必须消毒。"}]}],"synonyms":["disinfect","sanitize","sterilize","decontaminate"],"phonetic":"/ˌæn.tiˈsep.təˌsaɪz/","extraExplanation":["“antisepticise”更常见的美式拼写是 **antisepticize**；英式英语里常见 **-ise** 结尾（如 organise），但在很多词上 **-ize** 也同样被英式接受。","这个词在日常英语中相对少见；更常用的说法通常是 **disinfect**（消毒）、**sanitize**（清洁消毒/卫生处理）、或 **apply antiseptic to ...**（给……涂抹消毒剂）。"]}
{"word":"antisepticised","summary":{"en":"“Antisepticised” means disinfected or treated with an antiseptic; it’s also the past form of “antisepticise/antisepticize.”","zh":"“antisepticised”表示“已消毒的/经防腐（抗菌）剂处理的”，也可作“antisepticise/antisepticize”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"treated with an antiseptic to reduce or prevent infection; disinfected","zh":"经过消毒/杀菌处理的；用防腐（抗菌）剂处理以减少或预防感染的"},"examples":[{"en":"The nurse cleaned the cut and covered it with an antisepticised dressing.","zh":"护士清洁了伤口，并用经过消毒处理的敷料覆盖。"},{"en":"Make sure the instruments are antisepticised before use.","zh":"使用前务必把器械消毒处理。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “antisepticise/antisepticize”: to treat something with an antiseptic; to disinfect","zh":"“antisepticise/antisepticize”的过去式/过去分词：用防腐（抗菌）剂处理；消毒"},"examples":[{"en":"They antisepticised the wound before bandaging it.","zh":"他们在包扎前先对伤口进行了消毒处理。"}]}],"synonyms":["disinfected","sanitized","sterilized","decontaminated"],"phonetic":"/ˌæn.təˈsep.tə.saɪzd/","extraExplanation":["“antisepticised”多见于英式拼写（-ise）。美式更常写作“antisepticized”（-ize）。两者意思相同。","在现代医学英语里，更常用的表达是“disinfected”（消毒）或“sterilized”（灭菌，程度更彻底）。“antiseptic”强调使用抗菌/防腐药剂来抑制或杀灭微生物。"]}
{"word":"antisepticising","summary":{"en":"“Antisepticising” means disinfecting or treating something with an antiseptic to prevent infection (UK spelling).","zh":"“antisepticising”指用抗菌/消毒处理以预防感染（英式拼写）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"making something antiseptic; disinfecting or treating with an antiseptic to prevent infection","zh":"使……具有防腐/杀菌作用；用消毒剂处理以预防感染"},"examples":[{"en":"The nurse is antisepticising the wound before applying a bandage.","zh":"护士在包扎前先对伤口进行消毒处理。"},{"en":"Antisepticising surgical tools helps reduce the risk of infection.","zh":"对手术器械进行消毒有助于降低感染风险。"},{"en":"They spent extra time antisepticising the treatment room after each patient.","zh":"他们在每位病人之后都会花额外时间对诊疗室进行消毒。"}]}],"synonyms":["disinfecting","sanitizing","sterilizing","decontaminating"],"phonetic":"/ˌæn(t)iˈsɛptəˌsaɪzɪŋ/","extraExplanation":["“antisepticising”是英式拼写；美式更常写作“antisepticizing”。两者意思相同。","在日常英语里更常用更简单的说法，如“disinfecting（消毒）”“sanitizing（清洁消毒）”。“antisepticising/antisepticizing”更偏医学或正式语境。","注意区分：antiseptic（抗菌/防腐剂）通常用于活体组织（如皮肤、伤口）；disinfectant（消毒剂）更多用于物体表面。"]}
{"word":"antisepticism","summary":{"en":"Antisepticism means the practice of preventing infection by using antiseptic methods to control germs.","zh":"Antisepticism 指通过消毒/防腐方法控制病菌、预防感染的原则或做法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the practice or principle of preventing infection by killing or stopping the growth of harmful germs (especially in medical or hygiene settings)","zh":"（尤指医疗或卫生环境中的）防腐/消毒原则或做法：通过杀灭或抑制有害细菌来预防感染"},"examples":[{"en":"Antisepticism became standard in hospitals to reduce infections after surgery.","zh":"防腐消毒原则在医院中逐渐成为标准做法，以减少手术后的感染。"},{"en":"Good antisepticism includes cleaning the wound and using an antiseptic solution when needed.","zh":"良好的防腐消毒做法包括清洁伤口，并在需要时使用消毒溶液。"},{"en":"The clinic emphasized antisepticism: clean hands, sterile tools, and careful wound care.","zh":"这家诊所强调防腐消毒：手部清洁、器械无菌以及谨慎处理伤口。"}]}],"synonyms":["antisepsis","asepsis (related)","sterile technique","infection control (broader)"],"phonetic":"/ˌæn.tiˈsɛp.təˌsɪz.əm/","extraExplanation":["“antisepticism”多见于较正式或学术语境，日常更常说“antiseptic technique（消毒操作）”“infection control（感染控制）”。","常与19世纪外科消毒的发展联系在一起，尤其是约瑟夫·李斯特（Joseph Lister）推广用消毒剂降低术后感染率的做法。","注意区分：antiseptic（用于活体组织的消毒剂/防腐剂）与 disinfectant（用于物体表面的消毒剂）。"]}
{"word":"antisepticist","summary":{"en":"An antisepticist is someone who advocates or practices antiseptic methods to prevent infection, especially in medical settings.","zh":"antisepticist 指主张或实践抗菌消毒（防腐）方法以预防感染的人，尤用于医学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who supports or practices antisepsis (methods that prevent infection by killing or stopping the growth of germs), especially in medicine and surgery.","zh":"主张或实践“防腐/抗菌处理”（通过杀灭或抑制细菌来预防感染）的人，尤指医学与外科领域。"},"examples":[{"en":"In the late 1800s, many antisepticists argued that cleaner operating rooms could save lives.","zh":"在19世纪末，许多主张防腐法的人认为更干净的手术室能挽救生命。"},{"en":"The hospital hired surgeons who were known as strict antisepticists.","zh":"这家医院聘用了以严格执行抗菌消毒而闻名的外科医生。"}]}],"synonyms":["practitioner of antisepsis","infection-control practitioner","antisepsis advocate"],"phonetic":"/ˌæn.təˈsɛp.tɪ.sɪst/","extraExplanation":["“antisepticist”在现代英语中非常少见，更常见的说法是“a practitioner of antisepsis（防腐/无菌实践者）”或直接说“a surgeon who uses antiseptic techniques（使用防腐技术的外科医生）”。","历史语境里常与19世纪外科消毒革命相关，尤其是约瑟夫·李斯特（Joseph Lister）推广的“antiseptic”理念；后来医学更常谈“aseptic（无菌）”技术。"]}
{"word":"antisepticize","summary":{"en":"Antisepticize means to disinfect something or treat it with an antiseptic to prevent infection.","zh":"antisepticize 指对某物进行消毒或用消毒剂处理，以预防感染。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something antiseptic; to disinfect or treat to prevent infection by killing or stopping the growth of germs","zh":"使……具有杀菌/防感染作用；给……消毒（通过杀灭或抑制细菌等微生物）"},"examples":[{"en":"The nurse antisepticized the wound before applying a bandage.","zh":"护士在包扎前先给伤口消毒。"},{"en":"In the lab, tools must be antisepticized to avoid contamination.","zh":"在实验室里，器具必须消毒以避免污染。"}]}],"synonyms":["disinfect","sanitize","sterilize","decontaminate","apply antiseptic to"],"phonetic":"/ˌæn.tiˈsɛp.tɪˌsaɪz/","extraExplanation":["“antisepticize”在现代英语中不算常见；更常用的表达是“disinfect”“sanitize”“antiseptic (something)”或“apply antiseptic to (something)”。","拼写上，“-ize”在美式英语更常见；英式英语里也常见“-ise”（如“antisepticise”），但含义相同。"]}
{"word":"antisepticized","summary":{"en":"Antisepticized means treated with an antiseptic (disinfected), or having been made antiseptic.","zh":"Antisepticized 指“经过消毒/杀菌处理的”，也可作动词表示“对……进行消毒”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"treated with an antiseptic; made free from (or protected against) infection-causing germs.","zh":"用杀菌剂/消毒剂处理过的；经过消毒的（以减少或防止致病菌感染）。"},"examples":[{"en":"The nurse antisepticized the wound before applying a bandage.","zh":"护士在包扎前先给伤口做了消毒处理。"},{"en":"All instruments must be antisepticized to reduce the risk of infection.","zh":"所有器械都必须消毒处理，以降低感染风险。"}]},{"partOfSpeech":"vt.","definition":{"en":"to treat (something) with an antiseptic; to disinfect.","zh":"用杀菌剂/消毒剂处理（某物）；消毒。"},"examples":[{"en":"They antisepticized the skin with iodine prior to the injection.","zh":"注射前他们用碘伏给皮肤消毒。"},{"en":"Make sure the area is antisepticized after cleaning.","zh":"清洁后要确保该区域已消毒。"}]}],"synonyms":["disinfected","sterilized","sanitized","decontaminated"],"phonetic":"/ˌæn.təˈsɛp.tɪ.saɪzd/","extraExplanation":["“antisepticized”是动词“antisepticize”的过去式/过去分词，也常当形容词用，表示“已被消毒的”。","英式拼写常见“antisepticise”，美式多用“-ize”。在日常英语里，更常见的说法是“disinfected / sterilized / sanitized”，而“antisepticized”偏医学或较正式语境。"]}
{"word":"antisepticizes","summary":{"en":"“Antisepticizes” means “treats with an antiseptic; disinfects,” and it can also be used figuratively for making something overly “sanitized.”","zh":"“antisepticizes”表示“用消毒剂处理、消毒”，也可比喻“把内容过度‘消毒’得很安全但乏味”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(3rd person singular) to treat something with an antiseptic; to make it antiseptic or germ-free.","zh":"（第三人称单数）用消毒剂处理某物；使其具有消毒/杀菌作用、变得无菌。"},"examples":[{"en":"The nurse antisepticizes the wound before applying a bandage.","zh":"护士在包扎前先给伤口消毒。"},{"en":"In the lab, the technician antisepticizes the tools between tests.","zh":"在实验室里，技术员在每次测试之间对工具进行消毒。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) to remove “dangerous” or “offensive” parts from something, making it feel too clean, safe, or bland.","zh":"（比喻）把某事物中“有风险/有冒犯性”的部分去掉，使其变得过于安全、干净而显得乏味。"},"examples":[{"en":"Some readers feel the movie antisepticizes the story by avoiding messy emotions.","zh":"一些观众觉得电影回避了复杂情绪，把故事“消毒”得过于干净。"},{"en":"The article antisepticizes history, leaving out uncomfortable details.","zh":"这篇文章把历史“消毒”了，删去了令人不适的细节。"}]}],"synonyms":["disinfects","sterilizes","sanitizes","cleanses"],"phonetic":"/ˌæn.tɪˈsɛp.təˌsaɪ.zɪz/","extraExplanation":["“antisepticizes”是动词“antisepticize”的第三人称单数（he/she/it antisepticizes）。美式英语常用拼写为 -ize；英式拼写常见为 “antisepticise”。","词根提示：anti-（反、对抗）+ septic（感染的/腐败的）→ antiseptic（抗菌的、消毒的）→ antisepticize（使之消毒）。"]}
{"word":"antisepticizing","summary":{"en":"“Antisepticizing” means disinfecting something—especially skin or a wound—to prevent infection.","zh":"“antisepticizing”指给皮肤/伤口或物体进行消毒处理，以预防感染。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"making something antiseptic; disinfecting a wound, surface, or tool by applying an antiseptic or using methods that prevent infection","zh":"使……具有防腐/抗菌作用；用消毒剂等处理伤口、表面或器具以预防感染"},"examples":[{"en":"The nurse is antisepticizing the skin before the injection.","zh":"护士在注射前正在给皮肤消毒。"},{"en":"Antisepticizing the cut quickly can help prevent infection.","zh":"迅速给伤口消毒有助于预防感染。"},{"en":"They spent the morning antisepticizing the equipment after the procedure.","zh":"手术/操作后他们花了一上午给器械消毒。"}]}],"synonyms":["disinfecting","sanitizing","sterilizing","decontaminating"],"phonetic":"/ˌæn.tɪˈsɛp.tɪˌsaɪ.zɪŋ/","extraExplanation":["“antisepticizing”是动词“antisepticize”的现在分词/动名词形式。在日常英语里更常见的说法是“disinfecting（消毒）”或“cleaning/sterilizing（清洁/灭菌）”，而“antisepticize”偏医疗或较正式的语境。","区分：antiseptic通常用于“活体组织”（如皮肤、伤口）以抑制细菌；disinfectant多用于“物体表面”（如桌面、器械）。sterilize则表示“灭菌”，强调把微生物几乎全部清除。"]}
{"word":"antiseptics","summary":{"en":"Antiseptics are substances used on living tissue to prevent infection; “antiseptic” can also describe something that prevents germs.","zh":"Antiseptics 指用于皮肤/伤口等活体组织以预防感染的消毒剂；antiseptic 也可作形容词表示“防感染的/杀菌的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance that kills or stops the growth of germs on living tissue (like skin) to prevent infection","zh":"（用于活体组织如皮肤的）消毒剂、防腐剂；用于杀死或抑制细菌以预防感染"},"examples":[{"en":"The nurse cleaned the cut with an antiseptic before putting on a bandage.","zh":"护士先用消毒剂清洁伤口，然后再贴上绷带。"},{"en":"Alcohol wipes are common antiseptics for small cuts.","zh":"酒精棉片是处理小伤口常见的消毒用品。"}]},{"partOfSpeech":"adj.","definition":{"en":"able to prevent infection by killing or stopping the growth of germs","zh":"防感染的；杀菌的；抑制细菌生长的"},"examples":[{"en":"Use an antiseptic cream to reduce the risk of infection.","zh":"使用消毒膏可以降低感染风险。"},{"en":"The clinic has a clean, antiseptic smell.","zh":"诊所有一种干净的消毒水气味。"}]}],"synonyms":["germicide","antibacterial agent","sanitizer (informal)"],"phonetic":"/ˌæn.t̬iˈsɛp.tɪks/","extraExplanation":["“antiseptic”与“disinfectant”常被混用，但学习时可这样区分：antiseptic通常用于活体组织（皮肤、伤口），disinfectant多用于物体表面（桌面、门把手）。","词源提示：anti- 表示“反/对抗”，-septic 与“腐败/感染”有关，合起来就是“对抗感染/腐败”。"]}
{"word":"antiseption","summary":{"en":"“Antiseption” is a rare/nonstandard term meaning the prevention of infection by controlling germs; the standard word is “antisepsis.”","zh":"“antiseption”较少见且不太规范，意思是通过控制病菌来预防感染；更规范的词是“antisepsis”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard/rare) The practice of preventing infection by stopping the growth of germs (microorganisms), especially by using antiseptic chemicals. (More standard word: “antisepsis.”)","zh":"（非标准/少见）指通过抑制或杀灭病菌（微生物）来预防感染的做法，常用消毒/杀菌药剂。更常用、规范的词是“antisepsis（抗菌防腐）”。"},"examples":[{"en":"Proper handwashing is a basic step in antiseption before surgery.","zh":"手术前正确洗手是基础的抗菌防感染步骤。"},{"en":"The clinic follows strict antiseption procedures to reduce infection risk.","zh":"诊所遵循严格的抗菌防感染流程以降低感染风险。"}]}],"synonyms":["antisepsis","disinfection","infection control"],"phonetic":"/ˌæn.tiˈsɛp.ʃən/","extraExplanation":["“antiseption”在现代英语中很少见，很多时候是把“antisepsis”拼错或误写出来的。正式写作（医学、护理、说明书等）通常用“antisepsis”。","相关词对比：\n- antisepsis：抗菌防感染（过程/原则）。\n- antiseptic（n./adj.）：消毒剂；抗菌的。\n- aseptic（adj.）：无菌的（强调“没有微生物”，常用于手术环境）。"]}
{"word":"antiseptize","summary":{"en":"“Antiseptize” means to apply an antiseptic to prevent infection, especially on wounds or medical tools.","zh":"“antiseptize”指用抗菌/防腐剂进行处理以预防感染，常用于伤口或医疗器具。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to treat something with an antiseptic to prevent infection or the growth of germs","zh":"用防腐剂/抗菌剂处理（某物），以防感染或抑制细菌生长"},"examples":[{"en":"The nurse antiseptized the wound before putting on a bandage.","zh":"护士在包扎前先给伤口做了消毒处理。"},{"en":"Make sure all tools are antiseptized between patients.","zh":"确保所有工具在不同病人之间都要消毒。"}]}],"synonyms":["disinfect","sanitize","sterilize (stronger)","cleanse"],"phonetic":"/ˌæn.tɪˈsɛp.taɪz/","extraExplanation":["“antiseptize”在现代英语中相对少见，更常用的是“disinfect”（消毒）或“sanitize”（清洁/消毒）。“antiseptic”通常更强调用于皮肤或伤口的抑菌处理，而“disinfectant”更常用于物体表面。","构词提示：anti-（反、抗）+ sept（与腐败/感染相关，来自希腊语中“使腐败”的词根）+ -ize（使……化/使成为……）。"]}
{"word":"antiseptizing","summary":{"en":"“Antiseptizing” means treating something with an antiseptic to prevent infection.","zh":"“antiseptizing”指用消毒剂处理以预防感染。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"treating something (such as a wound, skin, or a surface) with an antiseptic to kill or stop the growth of germs and reduce infection risk","zh":"用消毒剂/抗菌剂处理（如伤口、皮肤或表面），以杀灭或抑制细菌生长，降低感染风险"},"examples":[{"en":"The nurse is antiseptizing the cut before applying a bandage.","zh":"护士正在给伤口消毒，然后再贴上绷带。"},{"en":"Antiseptizing your hands before changing the dressing helps prevent infection.","zh":"更换敷料前给手部消毒有助于预防感染。"},{"en":"In field clinics, water may be scarce, so antiseptizing wipes are often used.","zh":"在野外诊所，水可能很缺乏，所以常用消毒湿巾来清洁。"}]}],"synonyms":["disinfecting","sanitizing","sterilizing (in some contexts)","applying antiseptic"],"phonetic":"/ˌæn.tɪˈsɛp.tɪˌzaɪ.zɪŋ/","extraExplanation":["“antiseptizing”是动词“antiseptize”的现在分词/动名词形式，在日常英语里相对少见；更常见的表达是“disinfecting（消毒）”或“sanitizing（清洁消毒）”。在医疗语境中也常用“clean the wound”或“apply antiseptic（涂抹消毒剂）”。","词根提示：anti-（反、抗）+ septic（与感染/腐败有关，源自希腊语与“使腐败”相关的词根）。理解这个构词有助于记忆：antiseptic/antiseptize 都与“抗感染、消毒”有关。"]}
{"word":"antisera","summary":{"en":"Antisera are antibody-containing sera used for passive immunity or treatment.","zh":"Antisera 指含抗体的抗血清，用于被动免疫或治疗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of antiserum: blood serum that contains antibodies and is used to provide immediate (passive) immunity or to treat certain poisonings/infections.","zh":"antiserum（抗血清）的复数：含有抗体的血清，用于提供快速的（被动）免疫，或用于治疗某些中毒/感染。"},"examples":[{"en":"Doctors administered antisera after the snakebite to neutralize the venom.","zh":"被蛇咬伤后，医生注射了抗血清来中和毒液。"},{"en":"The lab compared different antisera to see which one reacted with the virus.","zh":"实验室比较了不同的抗血清，以观察哪一种会与该病毒发生反应。"}]}],"synonyms":["antiserums","antibody sera","immune sera"],"phonetic":"/ˌæn.tiˈsɪr.ə/","extraExplanation":["“antiserum”来自 anti-（对抗）+ serum（血清）。临床上常见的例子包括抗蛇毒血清、抗狂犬病免疫球蛋白等，属于“被动免疫”（直接给予现成抗体），通常起效快但持续时间相对短。","在科研中，antisera 也常指用于识别特定抗原的“多克隆抗体血清”，用于检测或鉴定（如免疫反应、血清学实验）。"]}
{"word":"antiserum","summary":{"en":"Antiserum is antibody-rich serum used for rapid, short-term protection or treatment against specific toxins or infections.","zh":"antiserum 指含抗体的抗血清，用于对特定毒素或感染提供快速但短期的保护或治疗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A blood serum that contains antibodies, used to provide quick, short-term protection or treatment against a specific toxin, virus, or venom.","zh":"抗血清：含有特异性抗体的血清，用于对某种毒素、病毒或蛇毒等提供快速但短期的保护或治疗。"},"examples":[{"en":"After the snakebite, the doctor gave him antiserum to neutralize the venom.","zh":"被蛇咬后，医生给他注射了抗血清来中和毒液。"},{"en":"Antiserum can be life-saving, but it may cause allergic reactions in some people.","zh":"抗血清可能救命，但有些人可能会出现过敏反应。"}]}],"synonyms":["antitoxin","antivenom","immune serum"],"phonetic":"/ˌæn.tiˈsɪr.əm/","extraExplanation":["抗血清通常来自已被免疫的动物（如马）或人类捐献者的血浆/血清，因此属于“被动免疫”（直接给你现成抗体），起效快但维持时间较短。","在现代医学中，一些传统“抗血清”已被更纯化的“免疫球蛋白制剂（antibody/immune globulin）”替代或改良，以降低过敏等风险；但在蛇咬伤等紧急情况，抗血清/抗蛇毒血清仍非常关键。","词源提示：anti-（反、对抗）+ serum（血清）。注意 antiserum（抗血清）与 vaccine（疫苗，主动免疫）概念不同。"]}
{"word":"antiserums","summary":{"en":"Antiserums are antibody-containing blood serums used for immediate, short-term protection or treatment against specific toxins or infections.","zh":"Antiserums（抗血清复数）是含抗体的血清，用于对特定毒素或感染进行立即但短期的保护或治疗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A plural form of antiserum: blood serum that contains antibodies and is used to provide immediate, short-term protection or treatment against a specific toxin or infection.","zh":"antiserum（抗血清）的复数形式：含有抗体的血清，用于针对特定毒素或感染提供立即但短期的保护或治疗。"},"examples":[{"en":"Doctors administered antiserums to treat the snakebite quickly.","zh":"医生迅速注射抗血清来治疗蛇咬伤。"},{"en":"Different antiserums are needed for different types of venom.","zh":"不同种类的毒液需要不同的抗血清。"}]}],"synonyms":["antisera","immune serum","antitoxin (for toxin-related cases)"],"phonetic":"/ˌæn.tiˈsɪr.əmz/","extraExplanation":["“antiserums”是较常见的规则复数；在医学/生物学写作中也常见拉丁式复数“antisera”。两者通常都被接受，但学术语境里“antisera”更常出现。","抗血清属于“被动免疫”（直接给抗体），起效快但持续时间通常较短；与疫苗（主动免疫）不同。"]}
{"word":"antiserumsera","summary":{"en":"Antiserum is antibody-rich blood serum used for immediate medical protection or treatment.","zh":"Antiserum 指含特异性抗体的血清，用于即时预防或治疗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a blood serum that contains specific antibodies and is used to provide immediate protection or treatment against a toxin or infection","zh":"（含特异性抗体的）抗血清；用于对抗毒素或感染的即时预防或治疗"},"examples":[{"en":"The patient was given antiserum after possible exposure to the snake’s venom.","zh":"患者在可能接触蛇毒后被注射了抗血清。"},{"en":"Doctors used antiserum to neutralize the toxin quickly.","zh":"医生使用抗血清来快速中和毒素。"}]}],"synonyms":["antisera (plural form)","antitoxin (related, often toxin-focused)","immune serum"],"phonetic":"/ˌæn.taɪˈsɪr.əm/","extraExplanation":["“antiserum”由 anti-（反、对抗）+ serum（血清）构成，常见于医学/免疫学语境，强调“带有针对性抗体的血清”。","拼写提示：antiserum 的复数常见为 “antisera”（不规则复数，来自拉丁语用法）；你输入的 “sera” 是 serum 的复数（= 多份血清/多种血清），但单独 “sera” 不等于 “antiserum”。","常见搭配：antiserum injection（抗血清注射）、administer antiserum（施用/注射抗血清）、antiserum against rabies/tetanus（抗狂犬病/破伤风抗血清）。"]}
{"word":"antisex","summary":{"en":"“Antisex” means opposed to sex or sexual expression, or an attitude/policy against sexuality.","zh":"“antisex”指反对性或性表达的，或指反性/反性的态度与政策。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to sexual activity, sexual expression, or sexual content; against sex (often used in social, moral, or political discussions).","zh":"反对性行为、性表达或色情内容的；反性（常用于社会、道德或政治讨论中）。"},"examples":[{"en":"Some parents prefer an antisex approach in sex education, focusing only on abstinence.","zh":"有些家长在性教育上偏向“反性”的做法，只强调禁欲。"},{"en":"The group criticized what it called an antisex message that treated desire as shameful.","zh":"该团体批评他们所谓的“反性”信息，把欲望当成羞耻。"}]},{"partOfSpeech":"n.","definition":{"en":"A general attitude or policy that is against sex or sexuality.","zh":"反对性或性欲的态度或政策；反性观念。"},"examples":[{"en":"The novel portrays the town’s antisex as part of its rigid social control.","zh":"这部小说把小镇的“反性观念”描写成严苛社会控制的一部分。"}]}],"synonyms":["anti-sex","sex-negative","puritanical","prudish"],"phonetic":"/ˌæntiˈsɛks/","extraExplanation":["“antisex”更常写作“anti-sex”（带连字符），在正式写作中这样更清晰。它通常带有评价色彩，暗示对性采取压抑、否定或道德化的立场。","注意区分：anti-sex（反对性/性表达）≠ asexual（无性恋/缺乏性吸引）≠ sex-negative（对性持负面态度，常用于性学/社会讨论中）。"]}
{"word":"antisexist","summary":{"en":"Anti-sexist means opposing sexism and supporting gender equality.","zh":"anti-sexist 指反对性别歧视、支持性别平等。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to sexism; supporting equal rights and fair treatment for all genders.","zh":"反性别歧视的；主张所有性别平等与公平对待的。"},"examples":[{"en":"The company introduced anti-sexist training to reduce gender bias at work.","zh":"公司推出反性别歧视培训，以减少职场中的性别偏见。"},{"en":"She is known for her anti-sexist activism on campus.","zh":"她因在校园里推动反性别歧视行动而出名。"}]}],"synonyms":["gender-equal","pro-equality","egalitarian"],"phonetic":"/ˌæn.tiˈsɛk.sɪst/","extraExplanation":["你写的“antisexist”更常见的拼写是 **anti-sexist**（带连字符）或 **antisexist**（较少见）。在正式写作中通常用 **anti-sexist**。","构词法：**anti-** 表示“反对”，**sexist** 表示“性别歧视的/有性别偏见的”。因此 anti-sexist = 反对性别歧视的。"]}
{"word":"antisexual","summary":{"en":"Antisexual means opposed to sex or sexual expression; it can also (less commonly) mean nonsexual or removing sexual content.","zh":"Antisexual指“反对性或性表达的”；较少见时也可指“非性的/去性化的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to sex or sexual activity; showing disapproval of sexual expression or sexual matters.","zh":"反对性或性行为的；对性表达或性话题持否定/反感态度的。"},"examples":[{"en":"Some critics called the policy antisexual because it punished any discussion of contraception.","zh":"一些批评者称这项政策“反性”，因为它惩罚任何关于避孕的讨论。"},{"en":"His antisexual attitude made it hard for him to talk openly about relationships.","zh":"他反性的态度让他很难坦诚地谈论亲密关系。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Not sexual in nature; removing or minimizing sexual content.","zh":"（较少见）非性的；去除或弱化性内容的。"},"examples":[{"en":"The director released an antisexual cut of the film for younger audiences.","zh":"导演为更年轻的观众发布了一个去性化的版本。"}]}],"synonyms":["anti-sex","sex-negative","prudish (informal)","puritanical","nonsexual (in the less common sense)"],"phonetic":"/ˌæn.tiˈsɛk.ʃu.əl/","extraExplanation":["“antisexual”通常带有价值判断，强调“反对/压制性”，语气可能较强或带批评色彩。","注意与“asexual（无性恋/无性倾向）”不同：asexual描述个人缺少性吸引或性欲，不一定反对性；antisexual更像一种立场或态度，可能反感或抵制性行为、性话题或性表达。","在学术、社会评论或文化批评语境中更常见（例如讨论性教育、审查制度、社会道德规范），日常对话里相对少用。"]}
{"word":"antish","summary":{"en":"“Antish” is informal and nonstandard, meaning “kind of anti- / somewhat opposed.”","zh":"“antish”是非正式且不太标准的说法，意思是“有点反……/有点不赞同”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal, nonstandard) Somewhat “anti-” or against something; having a mildly oppositional attitude. Often used jokingly or vaguely, like adding “-ish” (“kind of”) to “anti.”","zh":"（非正式、非标准用法）有点“反对……”的、带一点抵触态度的；常带玩笑或含糊语气，相当于把“anti-（反……）”加上“-ish（有点、像……一样）”。"},"examples":[{"en":"I’m antish social media—I use it, but I don’t really like it.","zh":"我有点反社交媒体——会用，但其实不太喜欢。"},{"en":"He sounded antish about the new policy, not fully against it.","zh":"他听起来对新政策有点抵触，但也不是完全反对。"}]},{"partOfSpeech":"other","definition":{"en":"(rare) A misspelling or casual spelling of “anti-” (a prefix meaning “against”).","zh":"（少见）“anti-（反……）”的拼写错误或随意拼写。"},"examples":[{"en":"Did you mean anti-inflammatory, not antish inflammatory?","zh":"你是想写 anti-inflammatory（抗炎的），不是 antish inflammatory 吗？"}]}],"synonyms":["somewhat opposed","mildly against","skeptical","not a fan of","anti-"],"phonetic":"/ˈæn.tiʃ/","extraExplanation":["“antish”不是常见的标准词典词，更像网络口语/随手拼出来的表达：anti + -ish。-ish 表示“有点、差不多、带点……的感觉”，所以 antish 往往表示“没那么强烈的反对，只是有点不赞同/不喜欢”。","正式写作中建议用 clearer 的表达：somewhat opposed to…, mildly against…, skeptical about…, not a fan of… 等。"]}
{"word":"antiship","summary":{"en":"“Antiship” means intended to attack ships, or a weapon used against ships.","zh":"“antiship”指“反舰的”，也可指“反舰武器（如反舰导弹）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to attack, damage, or destroy ships (especially used in military contexts).","zh":"（尤用于军事语境）反舰的；用于攻击、破坏或摧毁舰船的。"},"examples":[{"en":"The navy deployed an antiship missile system along the coast.","zh":"海军在海岸部署了反舰导弹系统。"},{"en":"Antiship weapons are meant to stop enemy vessels from approaching.","zh":"反舰武器旨在阻止敌方舰船接近。"}]},{"partOfSpeech":"n.","definition":{"en":"A weapon (such as a missile) used to attack ships.","zh":"反舰武器（如反舰导弹）。"},"examples":[{"en":"Several antiships were loaded onto the aircraft for the mission.","zh":"执行任务前，飞机装载了数枚反舰武器。"},{"en":"The report focuses on new antiships and coastal defenses.","zh":"该报告聚焦于新型反舰武器与岸防体系。"}]}],"synonyms":["anti-ship","anti-naval","ship-killing (informal)"],"phonetic":"/ˌæntiˈʃɪp/","extraExplanation":["拼写上常见两种形式：antiship（合写）与 anti-ship（带连字符）。在新闻、军事报告里两者都能见到；更正式的写法往往用连字符。","这是一个由前缀 anti-（反对/对抗）+ ship（舰船）构成的复合词，常与 missile（导弹）、weapon（武器）、strike（打击）等词搭配，如 antiship missile（反舰导弹）。"]}
{"word":"antishipping","summary":{"en":"Anti-shipping usually means either “against enemy ships” (military) or “against shipping/pairing characters” (fandom).","zh":"Anti-shipping 通常有两种意思：军事上的“反舰”，或同人圈里“反对磕CP/配对”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Military) Designed to attack or stop enemy ships, especially with weapons like missiles or aircraft.","zh":"（军事）用于攻击或阻止敌方舰船的，尤指使用导弹或飞机等武器。"},"examples":[{"en":"The navy deployed anti-shipping missiles along the coast.","zh":"海军在海岸部署了反舰导弹。"},{"en":"They trained for anti-shipping operations in the strait.","zh":"他们在海峡进行反舰作战训练。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Fandom / online) Opposing or criticizing “shipping” (supporting a romantic pairing of characters or real people).","zh":"（同人圈/网络）反对或批评“磕CP/配对”（支持某对角色或真人的恋爱组合）。"},"examples":[{"en":"She posted an anti-shipping thread about that pairing.","zh":"她发了一个反对那对CP的帖子。"},{"en":"The community has rules to reduce fights between shippers and anti-shipping fans.","zh":"社区制定了规则，减少支持配对者与反对配对者之间的争吵。"}]}],"synonyms":["antisurface (military, less common)","anti-ship","anti-shipping missile","anti-ship warfare","anti-shipping stance (fandom)"],"phonetic":"ˌæntiˈʃɪpɪŋ","extraExplanation":["这个词常见两种写法：anti-shipping（更常见、清晰）和 antishipping（较少见）。军事语境里几乎总是指“反舰”；同人/社媒语境里则多指“反对某种配对文化或某个CP”。看上下文（navy, missile vs. fandom, pairing）通常就能判断是哪一种。"]}
{"word":"antishoplifting","summary":{"en":"Anti-shoplifting means intended to prevent shoplifting, or the measures/devices used to do so.","zh":"antishoplifting 指“防止商店行窃的”，也可指用于防盗的措施或装置。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to prevent or reduce shoplifting (stealing from stores).","zh":"用于防止或减少商店行窃（顺手牵羊）的；防盗的。"},"examples":[{"en":"The store installed anti-shoplifting cameras near the entrance.","zh":"这家店在入口附近安装了防盗摄像头。"},{"en":"Employees received anti-shoplifting training before the holiday season.","zh":"员工在假日购物季前接受了防盗培训。"}]},{"partOfSpeech":"n.","definition":{"en":"A method, device, or program used to prevent shoplifting.","zh":"防盗措施；防盗装置；防盗计划（用于预防商店行窃）。"},"examples":[{"en":"Anti-shoplifting is a major part of the store’s security plan.","zh":"防盗是这家店安保计划的重要部分。"},{"en":"They invested in anti-shoplifting to cut losses.","zh":"他们投资防盗措施来减少损失。"}]}],"synonyms":["anti-theft","shoplifting prevention","loss-prevention","security (measures)"],"phonetic":"/ˌæn.tiˈʃɑpˌlɪf.tɪŋ/","extraExplanation":["在英文里更常见的写法是带连字符的 **anti-shoplifting**（作形容词），如 *anti-shoplifting measures/devices/training*。也常用更自然的表达：**loss-prevention**（零售“防损”）、**anti-theft**（防盗）、**shoplifting prevention**（防偷窃预防）。","常见的 anti-shoplifting 手段包括：防盗标签/感应门（security tags/alarms）、监控摄像（CCTV）、防损人员（loss-prevention staff）、陈列与动线设计（store layout）、员工培训（staff training）。"]}
{"word":"Antisi","summary":{"en":"“Antisi” isn’t standard English; you probably mean “anti” (against/opposed) or “antis” (opponents, informal online).","zh":"“Antisi” 不是标准英语；你可能想写 “anti”（反对的）或 “antis”（反对者，常见于网络）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling of “anti” or “antis.”","zh":"不是标准英语单词，可能是把 “anti” 或 “antis” 拼错了。"},"examples":[{"en":"I’m not sure what “Antisi” means—did you mean “anti”?","zh":"我不太确定 “Antisi” 是什么意思——你是不是想写 “anti”？"}]},{"partOfSpeech":"adj.","definition":{"en":"Opposed to someone or something; against.","zh":"反对（某人或某事）的；对立的。"},"examples":[{"en":"She is anti-war and supports peaceful solutions.","zh":"她反对战争，支持和平解决方案。"},{"en":"They are anti-smoking policies in many public places.","zh":"许多公共场所有反吸烟政策。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who is strongly opposed to someone or something (often used in informal online contexts as “antis”).","zh":"强烈反对某人或某事的人（在网络语境中常用复数 “antis”）。"},"examples":[{"en":"Online, some antis try to start arguments in fan communities.","zh":"在网上，一些反对者会在粉丝社群里挑起争吵。"}]}],"synonyms":["against","opposed","anti-"],"phonetic":"/ˈænti/","extraExplanation":["“anti-” 也是一个很常见的前缀，意思是“反……/抗……”，比如 anti-virus（杀毒的/防病毒的）、anti-inflammatory（抗炎的）。如果你说的 “Antisi” 是某个专有名词、名字、品牌或特定圈子用语，请给我一句上下文，我可以更准确解释。"]}
{"word":"antisi","summary":{"en":"“Antisi” is often an informal shorthand (in Indonesian/Malay contexts) meaning “anticipate / prepare in advance.” In English, the common word is “anticipate.”","zh":"“antisi”常见于印尼语/马来语语境的口语缩写，意思接近“提前预期/提前准备”。英语里常用词是“anticipate”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to expect something and think about or prepare for it before it happens","zh":"预期；预料；事先考虑并准备"},"examples":[{"en":"We anticipated heavy traffic, so we left early.","zh":"我们预料到会堵车，所以提前出发了。"},{"en":"Try to anticipate what your customer will need next.","zh":"尽量预判顾客接下来会需要什么。"}]},{"partOfSpeech":"vt.","definition":{"en":"to do something before it is officially allowed or before someone else does it","zh":"抢先做；提前做（在正式允许或他人行动之前）"},"examples":[{"en":"The company anticipated the new rules and updated its policy early.","zh":"公司提前预判新规定，早早就更新了政策。"},{"en":"Don’t anticipate the results before the final report is published.","zh":"最终报告发布前不要抢先下结论。"}]}],"synonyms":["expect","predict","foresee","prepare for"],"phonetic":"/ænˈtɪsəˌpeɪt/","extraExplanation":["“antisi”常见于印尼语/马来语网络用语里，通常是“antisipasi（预防、提前准备）”的口语缩写。英语里对应更常用的是 **anticipate**（预期/提前准备）或 **prepare for**（为……做准备）。"]}
{"word":"antisialagogue","summary":{"en":"An antisialagogue is a drug that reduces saliva production.","zh":"antisialagogue 指“抑制唾液分泌的药物（抑涎药）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medicine that reduces or prevents the production of saliva (often used before anesthesia or certain medical/dental procedures)","zh":"抑制或减少唾液分泌的药物（常用于麻醉前或某些医疗/牙科操作前）"},"examples":[{"en":"Before surgery, the anesthesiologist may give an antisialagogue to reduce saliva and airway secretions.","zh":"手术前，麻醉医生可能会给予抑涎药以减少唾液和气道分泌物。"},{"en":"The dentist used an antisialagogue to help keep the mouth dry during the procedure.","zh":"牙医使用抑涎药来帮助在操作过程中保持口腔干燥。"}]}],"synonyms":["anticholinergic (when used to reduce secretions)","drying agent","antisialorrheic agent"],"phonetic":"/ˌæn.tiˌsaɪˈæl.əˌɡɑɡ/","extraExplanation":["这是一个医学用语：anti- 表示“对抗/抑制”，sialo- 与“唾液”有关（来自希腊语），-agogue 表示“促使/引起……的东西”。合起来就是“抑制唾液分泌的药”。","常见的抑涎药包括 atropine（阿托品）和 glycopyrrolate（格隆溴铵/格隆溴酸盐）；它们也可能减少其他分泌物。使用时需由专业人员评估副作用与禁忌症。"]}
{"word":"antisialic","summary":{"en":"Antisialic means “reducing saliva,” usually in medical contexts.","zh":"antisialic 指“减少唾液分泌的”，多用于医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"reducing or preventing the flow of saliva; used to describe a drug or effect that decreases salivation.","zh":"（药物或作用）抑制或减少唾液分泌的；抗流涎的。"},"examples":[{"en":"The doctor prescribed an antisialic medication before surgery to reduce saliva.","zh":"医生在手术前开了抗唾液分泌的药，以减少唾液。"},{"en":"Some anticholinergic drugs have an antisialic effect and can cause a dry mouth.","zh":"一些抗胆碱药有抑制唾液分泌的作用，可能会导致口干。"}]}],"synonyms":["antisialagogue","antisialorrheic","saliva-reducing"],"phonetic":"/ˌæn.taɪ.saɪˈæl.ɪk/","extraExplanation":["这个词多见于医学/药理学语境。词根 sial- 来自希腊语，意为“唾液”，anti- 表示“对抗/抑制”。临床上常用于术前减少分泌物、或治疗流涎（如某些神经系统疾病相关的流涎）。日常英语更常说“reduce saliva / dry up saliva（减少唾液/使口干）”。"]}
{"word":"antisialorrheic","summary":{"en":"A medical adjective meaning “reducing saliva/drooling.”","zh":"医学形容词：指“减少唾液分泌/缓解流口水的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medical) Reducing or preventing the flow of saliva; used to describe a drug or treatment that helps stop excessive drooling.","zh":"（医学）抑制或减少唾液分泌的；形容药物或治疗用于减轻流涎/口水过多。"},"examples":[{"en":"The doctor prescribed an antisialorrheic medication to help with severe drooling.","zh":"医生开了抑涎药物来帮助缓解严重流涎。"},{"en":"Some antisialorrheic drugs may cause dry mouth as a side effect.","zh":"一些抑涎药可能会引起口干等副作用。"}]}],"synonyms":["antisialagogue","antidroling (informal)","saliva-reducing (plain)"],"phonetic":"/ˌæn.tiˌsaɪ.əˈlɔr.i.ɪk/","extraExplanation":["词源可拆解理解：anti-（反、抑制）+ sialo-（唾液）+ -rrhea（流出、流动）+ -ic（……的）。所以整体意思就是“抑制唾液流出/流涎的”。","这是偏专业的医学用词，日常英语里更常说：reduce drooling（减少流口水）、drying medication（使分泌物变少的药）。","常见相关机制/药物类别包括“抗胆碱能药（anticholinergic drugs）”，它们可能同时减少唾液，但也可能带来口干、便秘、视物模糊等副作用；用药应遵医嘱。"]}
{"word":"antisiccative","summary":{"en":"Antisiccative means “anti-drying”—an additive that prevents or slows drying, especially in paints or inks.","zh":"antisiccative 意为“防干的/抗干燥的”，指能防止或减缓干燥的添加剂（常用于油漆、油墨等）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an additive, especially in paint, ink, or varnish) preventing or slowing drying; used to keep a product from forming a skin or hardening too quickly.","zh":"（尤指油漆、油墨或清漆中的添加剂）防止或减缓干燥的；用于避免表面结皮或过快硬化。"},"examples":[{"en":"This paint contains an antisiccative to keep it workable longer in the can.","zh":"这种油漆含有防干剂，可以让它在罐中更久保持可用。"},{"en":"Adding a small amount of antisiccative can reduce skin formation on stored varnish.","zh":"加入少量防干剂可以减少清漆存放时表面结皮。"}]}],"synonyms":["anti-drying","drying retarder","anti-skinning (agent)"],"phonetic":"/ˌæn.tiˈsɪk.ə.tɪv/","extraExplanation":["“antisiccative”由“anti-（反、抑制）+ siccative（促干剂）”构成。siccative 指能加速油类涂料干燥的物质（如某些金属盐），antisiccative 则相反，用来延缓干燥或防止表面结皮。","该词多见于涂料、油墨、清漆等工业/技术语境，日常英语中较少使用；在说明书或配方里也可能写作“anti-siccative”。"]}
{"word":"antisideric","summary":{"en":"Antisideric means ‘counteracting iron buildup or iron-dust staining in tissues,’ used mainly in medical/technical contexts.","zh":"antisideric 指“抗铁沉着的”，主要用于医学或技术语境，描述对抗铁（或铁尘）在组织中沉积/染色的作用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical/technical) Preventing or counteracting siderosis—harmful buildup or staining from iron (especially iron dust) in body tissues.","zh":"（医学/技术）抗铁沉着的；用于预防或对抗铁（尤其是铁粉尘）在组织中沉积或染色所造成的损害。"},"examples":[{"en":"Workers exposed to iron dust may need antisideric measures such as better ventilation and masks.","zh":"接触铁粉尘的工人可能需要采取抗铁沉着措施，例如改善通风并佩戴口罩。"},{"en":"The report discussed antisideric treatment to reduce iron-related lung changes.","zh":"报告讨论了用于减轻与铁相关的肺部变化的抗铁沉着治疗。"}]}],"synonyms":["anti-siderosis","anti-siderotic","iron-chelating (context-dependent)"],"phonetic":"/ˌæn.ti.saɪˈdɛr.ɪk/","extraExplanation":["这个词非常少见，多用于医学或职业卫生语境。词根来自希腊语：anti-（反、对抗）+ sider-（铁，见于 siderosis“铁尘沉着症/铁沉着”）。在现代英语里，更常见的表达是 “anti-siderosis” 或直接说 “to prevent/treat siderosis”。"]}
{"word":"antisilverite","summary":{"en":"antisilverite: a mineralogical term for a mineral with an inverse (“anti-”) crystal structure related to silverite.","zh":"antisilverite：矿物学术语，指晶体结构为与 silverite 对应的“反结构（anti-）”类型的矿物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Mineralogy) A mineral name used for a species whose crystal structure is the “anti-” (inverse) structural type of a related mineral called silverite.","zh":"（矿物学）一种矿物名称，指其晶体结构属于与“silverite（银矿物名）”相对应的“反结构（anti-，结构中离子位置对调/互换）”类型。"},"examples":[{"en":"Antisilverite is discussed mainly in mineral-structure classification rather than in everyday geology.","zh":"“Antisilverite”主要出现在矿物结构分类的讨论中，而不是日常地质语境里。"},{"en":"The paper compares the silverite and antisilverite structural types.","zh":"这篇论文比较了 silverite 与 antisilverite 两种结构类型。"}]}],"synonyms":["anti-silverite (variant spelling)","inverse silverite structure (descriptive)"],"phonetic":"ˌæntiˈsɪlvəˌraɪt","extraExplanation":["“anti-”在矿物学/晶体化学命名里常表示“反结构（anti-structure）”：与某一已知结构类型相比，正负离子（或不同组分）在晶格中的占位关系发生对调，因此整体拓扑相似但“谁坐在哪个位置”相反。","该词非常专业，更多见于矿物数据库、结构类型（structure type）或学术论文的分类描述中；在一般词典里往往查不到。"]}
{"word":"antisimoniacal","summary":{"en":"“Antisimoniacal” describes actions, rules, or attitudes that oppose simony—the buying or selling of church offices or spiritual benefits.","zh":"“antisimoniacal”指反对“买卖圣职”（用金钱等交易教会职位或属灵利益）的行为、规定或态度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to simony (the buying or selling of church offices, religious roles, or spiritual benefits).","zh":"反对买卖圣职（即“买卖圣职罪/西摩尼主义”：用金钱等交换教会职位或属灵利益）的。"},"examples":[{"en":"The bishop issued an antisimoniacal decree to stop the sale of church positions.","zh":"主教发布了一项反对买卖圣职的法令，以制止出售教会职位的行为。"},{"en":"Reformers promoted antisimoniacal rules to protect the integrity of the clergy.","zh":"改革者推动反对买卖圣职的规定，以维护神职人员体系的纯洁性。"}]}],"synonyms":["anti-simony","opposed to simony","reformist (in church context)"],"phonetic":"/ˌæn.taɪ.sɪˈmoʊ.ni.ə.kəl/","extraExplanation":["“antisimoniacal”来自“simony（买卖圣职）”。“simony”一词与《圣经·使徒行传》中西门（Simon Magus）试图用钱购买属灵能力的故事相关，因此在基督教传统里用来指以金钱交易宗教职务或恩惠。该词多见于宗教史、教会法或学术写作，日常英语中较少使用。"]}
{"word":"antisine","summary":{"en":"Antisine means the inverse sine (arcsin), used to find an angle from its sine value.","zh":"Antisine 指反正弦（arcsin），用来由正弦值求对应的角度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(mathematics) the inverse sine function; arcsine (written as arcsin). It gives the angle whose sine is a given number.","zh":"（数学）反正弦函数；arcsine（写作 arcsin）。它表示“正弦值为某个数的角”。"},"examples":[{"en":"The antisine of 0.5 is 30 degrees (or π/6 radians).","zh":"0.5 的反正弦是 30 度（或 π/6 弧度）。"},{"en":"Use the antisine to find the angle from a known sine value.","zh":"当你已知正弦值时，可以用反正弦来求角度。"}]}],"synonyms":["arcsine","inverse sine","arcsin"],"phonetic":"/ˈæntiˌsaɪn/","extraExplanation":["“antisine”在现代英语里不如“arcsine / inverse sine / arcsin”常见，更多见于较旧或较少使用的术语。","学习时要注意：inverse sine（反函数）≠ reciprocal of sine（倒数）。sin 的倒数是 cosecant（csc），而不是 antisine。"]}
{"word":"antisiphon","summary":{"en":"Antisiphon means “preventing siphoning/backflow,” or it can refer to the device that does this.","zh":"antisiphon 指“防虹吸/防倒流的”，也可指具体的防虹吸装置。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"designed to prevent siphoning (the unwanted backward flow of liquid), especially in plumbing or fluid systems","zh":"防虹吸的；用于防止液体因虹吸作用而倒流（常见于管道或流体系统）"},"examples":[{"en":"An anti-siphon valve helps stop dirty water from flowing back into the clean water supply.","zh":"防虹吸阀可以防止污水倒流回干净的供水系统。"},{"en":"Building codes often require anti-siphon protection on outdoor faucets.","zh":"建筑规范常要求室外水龙头安装防虹吸保护装置。"}]},{"partOfSpeech":"n.","definition":{"en":"a device (such as a valve or fitting) that prevents siphoning/backflow","zh":"防虹吸装置（如阀门或接头），用于防止虹吸/倒流"},"examples":[{"en":"The plumber replaced the old antisiphon with a new one.","zh":"水管工把旧的防虹吸装置换成了新的。"},{"en":"Some irrigation systems include an antisiphon to protect the drinking water line.","zh":"一些灌溉系统会配备防虹吸装置来保护饮用水管线。"}]}],"synonyms":["anti-siphon","backflow-preventing","vacuum-breaker","check-valve"],"phonetic":"/ˌæn.tiˈsaɪ.fən/","extraExplanation":["“antisiphon”常写作带连字符的“anti-siphon”。它多用于管道、灌溉系统（sprinkler/irrigation）、室外水龙头（hose bibb），以及部分医疗输液/抽吸装置中，用来避免污染液体回流。","相关概念：backflow（回流/倒流）、vacuum breaker（真空破坏器，常见的一种防虹吸结构）、check valve（止回阀）。"]}
{"word":"antisiphonal","summary":{"en":"Antisiphonal means “preventing siphoning or backflow,” often used for valves or devices in plumbing and fuel systems.","zh":"antisiphonal 指“防虹吸/防倒流的”，常用于管路或燃油系统中的阀门或装置。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to prevent siphoning (a liquid being pulled or drained by suction), especially to stop unwanted backflow or leakage.","zh":"防虹吸的；防止液体因虹吸作用被吸走或倒流的（常用于管路、燃油系统等）。"},"examples":[{"en":"The fuel tank has an antisiphonal valve to reduce the risk of fuel theft and leaks.","zh":"这个油箱装有防虹吸阀，以降低燃油被偷抽和泄漏的风险。"},{"en":"Install an antisiphonal device to prevent contaminated water from flowing back into the clean supply.","zh":"安装防虹吸装置，防止受污染的水倒流回清洁供水系统。"}]}],"synonyms":["anti-siphon","backflow-preventing","non-siphoning"],"phonetic":"/ˌæn.tiˈsaɪ.fə.nəl/","extraExplanation":["“antisiphonal / anti-siphonal”常见于工程与设备说明书中，尤其是燃油管路、马桶水箱、喷淋系统或需要“防倒流”的场景。它强调的是通过阀门或结构设计来“打断虹吸”，避免液体被持续抽走或把脏水带回上游。"]}
{"word":"antisiphylitic","summary":{"en":"Antisiphylitic means “against syphilis,” referring to a treatment or medicine (or describing something used to treat syphilis).","zh":"antisiphylitic 表示“抗梅毒的”，可形容用于治疗梅毒的东西，也可指抗梅毒药/疗法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medicine) Used to prevent or treat syphilis.","zh":"（医学）用于预防或治疗梅毒的；抗梅毒的。"},"examples":[{"en":"Before antibiotics, doctors tried several antisiphylitic treatments, some of which were harmful.","zh":"在抗生素出现之前，医生尝试过多种抗梅毒治疗，其中一些其实有害。"},{"en":"The museum label describes an old antisiphylitic drug used in the early 1900s.","zh":"博物馆的说明牌介绍了一种20世纪初使用过的旧式抗梅毒药物。"}]},{"partOfSpeech":"n.","definition":{"en":"A medicine or treatment used against syphilis.","zh":"抗梅毒药；用于对抗梅毒的疗法。"},"examples":[{"en":"Arsenic-based compounds were once used as antisiphylitics.","zh":"含砷化合物曾一度被用作抗梅毒药。"}]}],"synonyms":["antisyphilitic","anti-syphilitic"],"phonetic":"/ˌæn.tiˌsɪf.əˈlɪt.ɪk/","extraExplanation":["这个词更常见的拼写是 **antisyphilitic**（也写作 anti-syphilitic）。由 **anti-**（“反/抗”）+ **syphilitic**（“梅毒的”）构成。","在历史语境中常见：现代临床上梅毒主要用青霉素等抗生素治疗，因此这个词在日常英语里较少出现。阅读医学史或旧文献时更可能遇到。"]}
{"word":"antiskeptic","summary":{"en":"Antiskeptic means opposed to skepticism (especially in philosophy), or a person who holds that view.","zh":"Antiskeptic 指“反怀疑论的”（尤用于哲学），也可指“反怀疑论者”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Opposed to skepticism; believing that knowledge or truth is possible and rejecting extreme doubt.","zh":"（罕见）反怀疑论的；主张人能够获得知识或真理，反对极端怀疑。"},"examples":[{"en":"Her antiskeptic view is that we can know some things with certainty, like basic math.","zh":"她的反怀疑论观点是：有些事情我们可以确定知道，比如基础数学。"},{"en":"The book defends an antiskeptic position against the idea that nothing can be known.","zh":"这本书为反怀疑论立场辩护，反对“什么都无法知道”的观点。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who is opposed to skepticism, especially in philosophy.","zh":"（尤指哲学中）反对怀疑论的人；反怀疑论者。"},"examples":[{"en":"As an antiskeptic, he argues that evidence can justify belief.","zh":"作为反怀疑论者，他认为证据可以使信念成立。"},{"en":"Some antiskeptics focus on everyday knowledge, like knowing you have hands.","zh":"一些反怀疑论者关注日常知识，比如“知道自己有手”。"}]}],"synonyms":["anti-skeptical","anti-sceptical","non-skeptical","anti-doubt (contextual)"],"phonetic":"/ˌæn.tiˈskɛp.tɪk/","extraExplanation":["这个词由前缀 anti-（反对）+ skeptic（怀疑者/怀疑论的）构成，常见于哲学语境，尤其讨论“我们是否可能真正知道某事”。在一般英语中更常见的表达是 anti-skeptical（带连字符）或 anti-sceptical（英式拼写）。"]}
{"word":"antiskeptical","summary":{"en":"Antiskeptical means “not skeptical,” or inclined to believe rather than doubt.","zh":"antiskeptical 意为“非怀疑的”，指更倾向于相信而非质疑。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not skeptical; showing belief or trust rather than doubt.","zh":"不怀疑的；非怀疑论的；更倾向于相信而不是质疑的。"},"examples":[{"en":"She took an antiskeptical view of the new research and assumed the results were reliable.","zh":"她对这项新研究持不怀疑的态度，认为结果是可靠的。"},{"en":"An antiskeptical audience accepted the story without asking many questions.","zh":"不太怀疑的听众几乎没怎么追问就接受了这个故事。"}]}],"synonyms":["anti-skeptical","not skeptical","trusting","credulous (often negative)"],"phonetic":"/ˌæn.tiˈskɛp.tɪ.kəl/","extraExplanation":["“antiskeptical”也常写作“anti-skeptical”（带连字符），在学术或正式写作中更常见。","这个词在日常英语里不算常用；更自然的表达常是“not skeptical”“trusting”“uncritical”（但“uncritical”含有“缺乏批判性”的负面意味）。","在哲学语境里，skepticism（怀疑论）是一种强调质疑与证据的立场；“antiskeptical”可用于描述反对怀疑论、主张我们能够获得知识或确定性的观点。"]}
{"word":"antiskepticism","summary":{"en":"Anti-skepticism is the philosophical position that pushes back against skepticism and argues that knowledge (or justified belief) is possible.","zh":"Anti-skepticism（反怀疑论）是一种反对怀疑论的哲学立场，主张知识（或有充分根据的信念）是可能的。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"opposition to skepticism; the view that we can have knowledge or justified beliefs (rather than doubting that knowledge is possible).","zh":"反怀疑论；反对“知识不可能/无法确定”的怀疑论立场，主张人类能够获得知识或有充分理由的信念。"},"examples":[{"en":"In philosophy class, we compared skepticism with anti-skepticism about the external world.","zh":"在哲学课上，我们比较了关于外部世界的怀疑论与反怀疑论。"},{"en":"Her anti-skepticism is based on the idea that everyday perception usually gives reliable information.","zh":"她的反怀疑论基于这样一种观点：日常感知通常能提供可靠信息。"}]}],"synonyms":["anti-skeptical view","anti-skeptical position","epistemic realism (context-dependent)"],"phonetic":"/ˌæntiˈskɛptəˌsɪzəm/","extraExplanation":["该词多见于哲学语境，常与“skepticism（怀疑论）”成对出现，讨论我们是否能确定外部世界、他人心灵、因果关系等问题。","在写作中更常见的拼写是“anti-skepticism”（带连字符）；也可能写作“antiscepticism/anti-scepticism”（英式拼写把 skeptic 写成 sceptic）。","相关经典问题包括“我怎么知道自己不是在做梦？”“我怎么知道眼前的世界不是幻觉？”反怀疑论通常试图证明这些极端怀疑不成立，或指出我们仍然有足够理由相信日常知识。"]}
{"word":"antiskid","summary":{"en":"Antiskid means “preventing slipping or skidding,” or a coating/material used for that purpose.","zh":"antiskid 指“防滑的”，也可指“防滑涂层/材料/装置”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to prevent slipping or skidding by providing better grip or friction.","zh":"防滑的；防止打滑的（通过增加抓地力或摩擦力）。"},"examples":[{"en":"These antiskid tires help the car stay stable on icy roads.","zh":"这些防滑轮胎能帮助汽车在结冰的路面上保持稳定。"},{"en":"The stairs have an antiskid surface for safety.","zh":"楼梯有防滑表面以确保安全。"}]},{"partOfSpeech":"n.","definition":{"en":"A material, coating, or device used to prevent slipping or skidding.","zh":"防滑材料；防滑涂层；防滑装置。"},"examples":[{"en":"We added antiskid to the ramp to reduce accidents.","zh":"我们在坡道上加了防滑层来减少事故。"},{"en":"Apply an antiskid coating to the bathroom floor.","zh":"在浴室地面涂一层防滑涂层。"}]}],"synonyms":["non-slip","skid-resistant","slip-resistant","anti-skid"],"phonetic":"/ˌæn(t)iˈskɪd/","extraExplanation":["“anti-”表示“反、抗、防”，而“skid”表示“打滑、侧滑”。因此 antiskid 字面意思就是“防止打滑”。","在美式英语里也常写作“anti-skid”。工程、交通安全与产品说明（如轮胎、地板涂层、楼梯踏面）中很常见。"]}
{"word":"antiskidding","summary":{"en":"Antiskidding means made to prevent slipping or skidding, or a system/feature that reduces skidding.","zh":"antiskidding 指“防滑/防打滑的”，也可指“防滑装置或系统”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to prevent slipping or skidding (especially for tires, roads, shoes, or surfaces).","zh":"防滑的；防打滑的（尤指轮胎、路面、鞋底或表面具有防止打滑的设计）。"},"examples":[{"en":"These boots have an antiskidding sole, so they’re safer on wet floors.","zh":"这双靴子有防滑鞋底，所以在湿滑的地面上更安全。"},{"en":"The city used antiskidding material on the bridge during winter.","zh":"冬天时，市政在桥面铺了防滑材料。"}]},{"partOfSpeech":"n.","definition":{"en":"A feature or system that helps stop a vehicle or object from skidding.","zh":"防滑装置；防打滑系统（帮助车辆或物体减少/避免打滑的功能或系统）。"},"examples":[{"en":"Some cars include antiskidding to improve control on icy roads.","zh":"有些汽车配备防滑系统，以便在结冰路面上更好地控制车辆。"}]}],"synonyms":["anti-skid","non-slip","skid-resistant","anti-skidding"],"phonetic":"ˌæntiˈskɪdɪŋ","extraExplanation":["“antiskidding”也常写作“anti-skid / anti-skidding”（更常见，尤其在说明书和工程语境中）。日常生活里更常用的近义表达有“non-slip”“skid-resistant”。","在汽车领域，相关概念常见于“anti-lock braking system (ABS)”和“traction control”，它们都与减少打滑、提高抓地力有关，但具体功能不完全相同。"]}
{"word":"antislavery","summary":{"en":"Antislavery describes opposition to slavery or refers to the movement and ideas against slavery.","zh":"Antislavery 指“反对奴隶制的”，也可指“反奴隶制运动/思想”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to slavery; supporting the ending of slavery","zh":"反对奴隶制的；支持废除奴隶制的"},"examples":[{"en":"She joined an antislavery group that worked to end slavery.","zh":"她加入了一个致力于结束奴隶制的反奴隶制团体。"},{"en":"Antislavery activists published newspapers to spread their ideas.","zh":"反奴隶制活动家出版报纸来传播他们的理念。"}]},{"partOfSpeech":"n.","definition":{"en":"the movement or ideas that oppose slavery","zh":"反奴隶制运动；反对奴隶制的思想与主张"},"examples":[{"en":"Antislavery grew stronger in the United States in the 1800s.","zh":"19世纪时，反奴隶制思潮在美国日益壮大。"},{"en":"His speeches helped shape antislavery in his community.","zh":"他的演讲推动并塑造了当地的反奴隶制思潮。"}]}],"synonyms":["abolitionist","anti-slavery","anti-slavery movement","opposed to slavery"],"phonetic":"/ˌæn.tiˈsleɪ.vɚ.i/","extraExplanation":["“antislavery”常用于美国历史语境，尤其与19世纪的“abolitionist（废奴主义者）”运动相关。两者意思接近，但abolitionist更强调积极主张并推动“废除”奴隶制的人或立场。","拼写上也常见作“anti-slavery”（加连字符），尤其在较正式或需要清晰分词时；现代用法中不加连字符的“antislavery”也很常见。","文学与历史写作里常会提到《Uncle Tom’s Cabin》（《汤姆叔叔的小屋》）等作品，它们在当时被认为推动了公众对奴隶制的反思与反奴隶制情绪。"]}
{"word":"antislaveryism","summary":{"en":"Antislaveryism means opposition to slavery, often referring to historical movements to end slavery.","zh":"Antislaveryism 指反对奴隶制，常用于指历史上的反奴隶制/废奴思潮与运动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to slavery; the belief, movement, or policy that slavery should be ended.","zh":"反对奴隶制度；主张废除奴隶制的信念、运动或政策。"},"examples":[{"en":"Antislaveryism grew rapidly in the Northern states during the 1800s.","zh":"19世纪时，反奴隶制思想在美国北方各州迅速发展。"},{"en":"Many writers used speeches and newspapers to spread antislaveryism.","zh":"许多作家通过演讲和报纸传播反奴隶制思想。"},{"en":"Her family supported antislaveryism even when it was unpopular.","zh":"即使在不受欢迎的时候，她的家人也支持反奴隶制立场。"}]}],"synonyms":["abolitionism","anti-slavery","emancipationism"],"phonetic":"/ˌæn.tiˈsleɪ.vəˌrɪ.zəm/","extraExplanation":["“antislaveryism”常见于历史写作，尤其与19世纪英语世界的“abolitionism（废奴主义）”密切相关；两者意思接近，但abolitionism更常用、也更直接指向“废除奴隶制”的政治与社会运动。","在美国语境中，反奴隶制思想与废奴运动与内战前后的社会冲突、宗教团体、人权理念、以及报刊出版（例如废奴报纸）有深刻联系。","词形上是 anti-（反对）+ slavery（奴隶制）+ -ism（主义/思想/运动），所以它强调的是一种“立场/思潮/运动”。"]}
{"word":"antislickens","summary":{"en":"“Antislickens” is not a standard English word; it likely means “anti-slip/anti-slick,” or it may be a misspelling of the geology term “slickensides.”","zh":"“antislickens”不是标准英语词；可能想表达“防滑/防打滑”，也可能是地质术语“slickensides（擦痕面）”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard/rare) Likely intended to mean “anti-slick” or “anti-slip”: designed to prevent a surface from becoming slippery.","zh":"（非标准/罕见）多半想表达“防滑/防打滑”：用于防止表面变得很滑。"},"examples":[{"en":"The label says the coating is anti-slick, but I’m not sure if “antislickens” is the right word.","zh":"标签上写的是防滑涂层，但我不确定“antislickens”这个词用得对不对。"},{"en":"We need an anti-slip mat for the bathroom floor, not something described as “antislickens.”","zh":"我们需要浴室防滑垫，而不是用“antislickens”这种说法来描述的东西。"}]},{"partOfSpeech":"other","definition":{"en":"Possible misspelling related to geology: “slickensides” (polished, grooved rock surfaces along a fault).","zh":"也可能是与地质学相关的拼写错误：应为“slickensides”（断层面上被磨光并带有条痕的岩面）。"},"examples":[{"en":"In the field guide, look for slickensides on the fault surface.","zh":"在野外指南里，可以在断层面上寻找slickensides（擦痕面）。"},{"en":"The geologist pointed out slickensides that showed the direction of movement.","zh":"地质学家指出擦痕面，用来显示岩层移动的方向。"}]}],"synonyms":["anti-slip","non-slip","slip-resistant","anti-skid"],"phonetic":"/ˌæntiˈslɪkənz/","extraExplanation":["“antislickens”不是常见英语词，字典里通常查不到。它看起来像把“anti-（反/防）+ slick（光滑、打滑）”硬拼在一起再加了复数结尾“-s”。如果你想表达“防滑”，更自然的说法是 anti-slip（最常用）、non-slip、slip-resistant。","如果你的语境是地质学，最接近的正规术语是 slickensides（擦痕面），常用于描述断层滑动造成的抛光与条纹。建议你提供一句原文，我可以帮你判断到底想写哪个词。"]}
{"word":"antislip","summary":{"en":"Anti-slip means made to prevent slipping by adding grip or traction; it’s common in product descriptions.","zh":"Anti-slip（antislip）指“防滑的/防滑设计”，通过增加摩擦力来减少打滑，常见于产品说明。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to reduce slipping; providing extra grip or traction.","zh":"防滑的；用于减少打滑、增加摩擦力（抓地力）的。"},"examples":[{"en":"These shoes have an anti-slip sole for rainy days.","zh":"这双鞋有防滑鞋底，适合雨天穿。"},{"en":"Use an anti-slip mat under the rug to keep it from sliding.","zh":"在地毯下面垫一张防滑垫，防止它滑动。"},{"en":"The bathroom floor has an anti-slip coating.","zh":"浴室地面有防滑涂层。"}]},{"partOfSpeech":"n.","definition":{"en":"A feature, coating, or material meant to prevent slipping (common in product descriptions).","zh":"防滑设计/防滑层/防滑材质（常见于产品说明中）。"},"examples":[{"en":"This phone case includes anti-slip on the sides for a steadier hold.","zh":"这个手机壳两侧有防滑设计，握起来更稳。"},{"en":"The gloves have anti-slip for better control.","zh":"这款手套带防滑设计，控制更稳。"}]}],"synonyms":["non-slip","slip-resistant","anti-skid","traction"],"phonetic":"/ˌæntiˈslɪp/","extraExplanation":["“anti-slip”常见于商品标签与说明书中，表示“防滑”。书写上既可写作 anti-slip（带连字符），也可写作 antislip（合写），在广告与包装上合写更常见；正式写作中带连字符更清晰。"]}
{"word":"antismog","summary":{"en":"Anti-smog means intended to reduce or protect against smog (air pollution), or a measure/product used to fight smog.","zh":"anti-smog 指“用于减少或抵御雾霾（空气污染）的”，也可指“治理雾霾的措施/产品”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to reduce, prevent, or protect against smog (air pollution).","zh":"用于减少、预防或抵御雾霾（空气污染）的；防雾霾的。"},"examples":[{"en":"The city introduced an anti-smog plan to cut vehicle emissions.","zh":"这座城市推出了防雾霾计划来减少车辆排放。"},{"en":"She wears an anti-smog mask on high-pollution days.","zh":"在污染严重的日子里，她会戴防雾霾口罩。"}]},{"partOfSpeech":"n.","definition":{"en":"A product or measure intended to fight smog.","zh":"用于治理雾霾的产品或措施。"},"examples":[{"en":"New anti-smog devices were installed in several factories.","zh":"多家工厂安装了新的治霾设备。"}]}],"synonyms":["anti-pollution","smog-fighting","smog-reducing"],"phonetic":"/ˌæntiˈsmɑɡ/","extraExplanation":["“anti-smog”常写作带连字符的形式（anti-smog），尤其在修饰名词时（anti-smog mask / anti-smog measures）。在口语或新闻里也会看到写成一个词“antismog”，但带连字符更常见、更清晰。","“smog”来自 smoke（烟）+ fog（雾）的混成词，常指城市中由尾气、工业排放等造成的空气污染。"]}
{"word":"antismoking","summary":{"en":"Antismoking describes opposition to smoking or efforts to discourage it, and can also refer to the movement or policies against smoking.","zh":"antismoking 表示“反对吸烟/劝阻吸烟的”，也可指反吸烟的运动或政策。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to smoking, or intended to discourage people from smoking.","zh":"反吸烟的；反对吸烟的；旨在劝阻人们吸烟的。"},"examples":[{"en":"Many cities have launched antismoking campaigns to protect public health.","zh":"许多城市发起了反吸烟宣传活动，以保护公众健康。"},{"en":"The school has strict antismoking rules on campus.","zh":"学校在校园内有严格的禁烟规定。"},{"en":"She works for an antismoking organization.","zh":"她在一家反吸烟组织工作。"}]},{"partOfSpeech":"n.","definition":{"en":"an idea, policy, campaign, or movement that opposes smoking.","zh":"反吸烟主张（或政策、宣传活动、运动）。"},"examples":[{"en":"The government announced new antismoking measures.","zh":"政府宣布了新的反吸烟措施。"},{"en":"Antismoking has become a major public-health focus in recent decades.","zh":"近几十年来，反吸烟已成为公共卫生的重要关注点。"}]}],"synonyms":["anti-smoking","anti-tobacco","smoke-free (related)"],"phonetic":"/ˌæn.tiˈsmoʊ.kɪŋ/","extraExplanation":["“anti-”是常见前缀，表示“反对、抵制”（如 antiwar 反战、antivirus 防病毒）。因此 antismoking 常用来修饰 campaign（宣传活动）、law（法律）、measure（措施）、message（信息）等。","写法上也常见 anti-smoking（带连字符）。在正式写作中两种都可见，按你所用的风格指南或机构惯例选择即可。","相关常用表达：smoke-free（无烟的，如 smoke-free restaurant 无烟餐厅）、no-smoking（禁止吸烟的，如 no-smoking sign 禁烟标志）、tobacco control（控烟）。"]}
{"word":"antismuggling","summary":{"en":"Anti-smuggling means preventing or fighting illegal smuggling, often used for patrols, campaigns, or policies.","zh":"anti-smuggling 指“反走私/打击走私”，常用于描述巡逻、行动或政策。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Intended to stop or prevent illegal smuggling (the secret transport of goods or people across borders).","zh":"用于打击或防止走私（秘密将货物或人员跨境非法运输）的。"},"examples":[{"en":"The coast guard increased anti-smuggling patrols along the shoreline.","zh":"海岸警卫队加强了沿海的反走私巡逻。"},{"en":"The government announced an anti-smuggling campaign at major ports.","zh":"政府在主要港口宣布开展反走私行动。"}]},{"partOfSpeech":"n.","definition":{"en":"Actions, policies, or operations that aim to stop smuggling.","zh":"旨在制止走私的行动、政策或执法措施。"},"examples":[{"en":"The agency coordinates anti-smuggling with neighboring countries.","zh":"该机构与邻国协调反走私工作。"},{"en":"Anti-smuggling efforts focused on drugs and counterfeit goods.","zh":"反走私工作重点打击毒品和假冒商品。"}]}],"synonyms":["counter-smuggling","anti-contraband","smuggling-prevention","anti-trafficking (related, broader)"],"phonetic":"/ˌæn.tiˈsmʌɡ.lɪŋ/","extraExplanation":["“anti-smuggling”更常见的写法是带连字符的形式（anti-smuggling）。在新闻、政府公告和执法语境中很常用；不带连字符的“antismuggling”也能见到，但较少、也更像合成写法。"]}
{"word":"antismut","summary":{"en":"“Antismut” is a rare/older form meaning antimony (Sb).","zh":"“antismut”是较少见/较旧的形式，意思是“锑”（Sb）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare or nonstandard term for the chemical element antimony (symbol Sb), a brittle, silvery-gray metalloid used in alloys and flame retardants","zh":"一种较少见/非标准的说法，指化学元素“锑”（符号 Sb）；锑是一种脆的银灰色类金属，常用于合金和阻燃材料"},"examples":[{"en":"Some older technical notes use “antismut” to refer to antimony in metal alloys.","zh":"一些较早的技术笔记会用“antismut”来指合金中的锑。"},{"en":"Antimony (sometimes written as antismut in older sources) can harden lead.","zh":"锑（在较旧的资料里有时写作 antismut）可以使铅更坚硬。"}]}],"synonyms":["antimony","Sb","stibium (historical/technical)"],"phonetic":"/ˌæn.tiˈmʌt/","extraExplanation":["“antismut”在现代英语中非常少见，通常不被视为标准拼写；更常见、规范的词是 antimony。","在德语里 Antismut 指“锑”，你可能是在多语言材料、旧书、或工业/冶金语境中看到这个形式。","锑的英文 antimony 来自拉丁语与希腊语的历史传承；化学符号 Sb 则源于拉丁语 stibium（与古代“锑”的名称有关）。"]}
{"word":"antisnapper","summary":{"en":"Antisnapper means a device or feature that prevents sudden snapping or dangerous snap-back; it can also be used as an adjective for such products.","zh":"antisnapper 指用于防止突然断裂或危险回弹的装置/设计，也可作形容词表示“防断裂/防回弹的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device, feature, or material designed to prevent something from snapping (breaking suddenly) or snapping back dangerously","zh":"防断裂／防回弹装置（或设计、材料），用于防止物体突然断裂或危险地回弹"},"examples":[{"en":"The cable has an antisnapper sleeve to reduce snap-back risk if it breaks.","zh":"这根钢缆有防回弹套筒，能在断裂时降低回弹伤人风险。"},{"en":"We added an antisnapper guard around the strap where it bends the most.","zh":"我们在背带最容易折弯的位置加了一个防断裂护罩。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing something made to prevent snapping or snap-back","zh":"（形容词）用于防断裂或防回弹的"},"examples":[{"en":"Use an antisnapper clip for heavy loads.","zh":"重载时请使用防断裂夹扣。"},{"en":"They replaced the old line with an antisnapper rope design.","zh":"他们把旧绳更换成了防回弹设计的绳子。"}]}],"synonyms":["anti-snap device","snap-back protector","protective sleeve","safety guard","reinforcement"],"phonetic":"/ˌæn.tiˈsnæp.ɚ/","extraExplanation":["“anti-”是常见前缀，表示“反对、抗、防”。“snap”指“突然断裂/啪地折断”或“突然回弹”。因此 antisnapper 多用于技术或产品语境（如钢缆、绳索、扣件、防护套），属于较不常见、偏行业的说法。更常见的替代表达有：anti-snap device / anti-snap sleeve / snap-back protection。"]}
{"word":"antisnob","summary":{"en":"Antisnob means against snobbery and social status pretension; it can describe an attitude or a person.","zh":"Antisnob 指反对势利与身份崇拜；既可形容一种态度，也可指这样的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to snobbery; not impressed by social rank, wealth, or “status,” and treating people as equals.","zh":"反势利的；不看重社会地位、财富或“身份”，倾向于平等对待他人。"},"examples":[{"en":"She has an antisnob attitude and chats with everyone the same way.","zh":"她很反势利，对每个人的聊天方式都一样。"},{"en":"The magazine tries to be stylish without becoming antisnob or snobbish.","zh":"这本杂志想走时尚路线，但又不想显得反势利或势利。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who is antisnob; someone who dislikes snobbery and social pretension.","zh":"反势利的人；不喜欢势利与装腔作势的人。"},"examples":[{"en":"He’s an antisnob who avoids elite clubs and prefers simple gatherings.","zh":"他是个反势利的人，避开精英俱乐部，更喜欢简单的聚会。"}]}],"synonyms":["unsnobbish","down-to-earth","unpretentious","egalitarian"],"phonetic":"/ˌæntiˈsnɑb/","extraExplanation":["“antisnob”通常带有评价色彩：它可以是正面的（强调平等、朴实），也可能被用来批评某人“刻意”反精英、为了显得亲民而贬低品味或专业性。使用时要注意语境，避免把“反势利”误解为“反高品质”。"]}
{"word":"antisocial","summary":{"en":"“Antisocial” can mean (1) not wanting to socialize, or (2) behavior harmful to society (a more serious, formal meaning).","zh":"antisocial 可指（1）不爱社交/不想应酬；也可指（2）反社会的行为（更严肃、正式的含义）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not enjoying or seeking the company of other people; preferring to be alone or avoiding social interaction.","zh":"不爱社交的；不喜欢与人来往的；倾向独处的。"},"examples":[{"en":"He’s quiet and a bit antisocial at parties, but he’s friendly one-on-one.","zh":"他在派对上很安静、有点不合群，但一对一相处时很友好。"},{"en":"After a long week, I feel antisocial and just want to stay home.","zh":"忙了一周后，我有点不想社交，只想待在家里。"}]},{"partOfSpeech":"adj.","definition":{"en":"Harmful to society or showing behavior that goes against social rules (often used in psychology/law).","zh":"反社会的；危害社会的；违背社会规范的（常用于心理学/法律语境）。"},"examples":[{"en":"The report discussed antisocial behavior like vandalism and repeated harassment.","zh":"报告讨论了破坏公物、反复骚扰等反社会行为。"},{"en":"In clinical contexts, “antisocial” can refer to patterns of disregard for others’ rights.","zh":"在临床语境中，“antisocial”可指一贯无视他人权利的行为模式。"}]}],"synonyms":["unsociable","not very social","withdrawn","asocial","delinquent (in the behavior sense)","disruptive (in the behavior sense)"],"phonetic":"/ˌæn.tiˈsoʊ.ʃəl/","extraExplanation":["日常口语里，antisocial 往往只是“社交电量不足、不想应酬/不太合群”的意思，不一定表示“反社会犯罪”。而在专业语境（如 antisocial behavior / antisocial personality disorder）中，它更接近“危害他人、违反社会规则”。为避免误会，可以用：not very social / introverted / a homebody 来表达“只是不爱社交”。"]}
{"word":"antisocialist","summary":{"en":"Opposed to socialism; also a person who opposes socialism.","zh":"反对社会主义的；也可指反社会主义者。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to socialism or socialist ideas, policies, or parties.","zh":"反对社会主义或社会主义思想、政策、政党的。"},"examples":[{"en":"The senator took an antisocialist position during the election.","zh":"这位参议员在选举期间采取了反社会主义的立场。"},{"en":"Some newspapers published antisocialist editorials after the reforms were proposed.","zh":"在改革方案被提出后，一些报纸发表了反社会主义的社论。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who is opposed to socialism.","zh":"反对社会主义的人；反社会主义者。"},"examples":[{"en":"In the debate, he identified himself as an antisocialist.","zh":"在辩论中，他表明自己是反社会主义者。"}]}],"synonyms":["anti-socialist","anti-Marxist","anti-communist (sometimes, depending on context)","opposed to socialism"],"phonetic":"/ˌæn.tiˈsoʊ.ʃə.lɪst/","extraExplanation":["“antisocialist”通常用于政治与意识形态讨论，语气可能比较强，带有立场色彩。学术或新闻写作中更常见；日常口语里，人们也可能说“anti-socialism/anti-socialist views”（反社会主义/反社会主义观点）。","注意不要与“antisocial（反社会的，不合群的）”混淆：antisocialist 是“反社会主义的”，而 antisocial 是“反社会的/不爱社交的”。"]}
{"word":"antisocialistic","summary":{"en":"Antisocialistic means opposed to socialism or policies seen as socialist.","zh":"antisocialistic 指“反社会主义的”，反对社会主义或被认为带有社会主义色彩的政策。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to socialism or socialist policies; not supporting socialistic ideas.","zh":"反社会主义的；反对社会主义或社会主义政策的。"},"examples":[{"en":"The newspaper published an antisocialistic editorial criticizing government ownership.","zh":"这家报纸发表了一篇反社会主义的社论，批评政府所有制。"},{"en":"Some voters see higher taxes as an antisocialistic threat to the free market.","zh":"一些选民把更高的税收视为对自由市场的反社会主义威胁。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) Opposed to social reform or public welfare programs, especially when viewed as “socialistic.”","zh":"（较少见）反对社会改革或公共福利项目的，尤其当这些项目被视为“社会主义式”的时候。"},"examples":[{"en":"He called the healthcare plan antisocialistic, arguing it was too close to socialism.","zh":"他称这项医疗计划为反社会主义的，认为它太接近社会主义。"}]}],"synonyms":["anti-socialist","anti-socialism","anti-communist (context-dependent)","pro-capitalist (context-dependent)"],"phonetic":"/ˌæn.tiˌsoʊ.ʃəˈlɪs.tɪk/","extraExplanation":["“antisocialistic”在现代英语里不算常用，更常见的是“anti-socialist”（反社会主义者/反社会主义的）或“antisocialism”（反社会主义）。注意不要和“antisocial”（反社会的、不合群的）混淆：前者多是政治经济立场，后者多指性格或行为。","在政治语境中，这个词往往带有强烈的立场色彩，使用时要注意场合与语气，避免把对方的政策简单贴上标签。"]}
{"word":"antisocialistically","summary":{"en":"“Antisocialistically” means “in an antisocial way,” but it is very rare; “antisocially” is much more common.","zh":"“antisocialistically”意为“以反社会的方式”，但非常罕见；更常用的是“antisocially”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is antisocial—showing or encouraging behavior that avoids other people or goes against accepted social behavior.","zh":"以反社会的方式；表现出回避他人或违背普遍社会规范的行为方式。"},"examples":[{"en":"He answered the question antisocialistically, refusing to join the discussion.","zh":"他用一种反社会的方式回答问题，拒绝加入讨论。"},{"en":"The group acted antisocialistically, ignoring basic rules of respect in public.","zh":"那群人行为很反社会，在公共场合无视基本的尊重规则。"}]}],"synonyms":["antisocially","unsociably","asocially"],"phonetic":"/ˌæn(t)iˌsoʊʃəˈlɪstɪkli/","extraExplanation":["“antisocialistically”非常少见，多用于刻意夸张或学术/评论语气。更常见的表达是“antisocially（反社会地/不合群地）”。","构词：anti-（反对）+ social（社会的）+ -istic（……的特征）+ -ally（副词）。整体强调“带有反社会特征的方式”。","注意区分：日常口语里说“antisocial”常指“不爱社交、不合群”；而法律/心理学语境里“antisocial”也可指“反社会人格/危害他人的行为”。语境不同，语气强度差别很大。"]}
{"word":"antisociality","summary":{"en":"Antisociality is a tendency toward behavior that violates social norms or harms others, and it can also mean disruptive “antisocial behavior” in a community.","zh":"antisociality 指违背社会规范、伤害他人的反社会性；也可指社区语境中的扰民/反社会行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A pattern or tendency of behaving in ways that go against social rules or harm other people, such as repeated lying, aggression, or ignoring others’ rights.","zh":"反社会性；指一种倾向或行为模式，常表现为违背社会规范、伤害他人或无视他人权利（如反复撒谎、攻击、漠视规则等）。"},"examples":[{"en":"Researchers study antisociality to understand why some people repeatedly break rules and hurt others.","zh":"研究人员研究反社会性，以了解为什么有些人会反复违规并伤害他人。"},{"en":"The program aims to reduce antisociality by teaching empathy and conflict-resolution skills.","zh":"该项目旨在通过教授同理心与冲突解决技巧来减少反社会性。"}]},{"partOfSpeech":"n.","definition":{"en":"Behavior that disturbs a community or public space, such as vandalism, harassment, or persistent noise (often used in “antisocial behavior”).","zh":"扰民/危害社区的行为（常用于“反社会行为”），如破坏公物、骚扰他人或长期制造噪音。"},"examples":[{"en":"The neighborhood meeting focused on antisociality in the park after repeated vandalism.","zh":"在公园发生多次破坏事件后，社区会议讨论了该地的反社会行为问题。"},{"en":"New lighting was installed to discourage antisociality around the station at night.","zh":"车站周边安装了新照明，以减少夜间的反社会行为。"}]}],"synonyms":["antisocial behavior","social deviance","delinquency","rule-breaking","vandalism"],"phonetic":"/ˌæn.tiˌsoʊ.ʃiˈæl.ə.ti/","extraExplanation":["“antisociality/反社会性”通常指“对他人有害、违背规范”的倾向；不要和“asocial/不合群（更偏好独处、未必伤害他人）”混淆。","在心理学与精神医学语境中，它可能与“反社会型人格障碍（antisocial personality disorder, ASPD）”相关，但日常用法不一定表示临床诊断。","英式英语里常见搭配是“antisocial behaviour（反社会/扰民行为）”，用于社区治理、警方通报等语境。"]}
{"word":"antisocially","summary":{"en":"Antisocially means either ‘in a socially withdrawn way’ or ‘in a disruptive, rule-breaking way that harms others,’ depending on context.","zh":"antisocially 既可指“退缩、不爱社交地”，也可指“扰乱、违反规范并伤害他人的反社会地”，具体含义取决于语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that avoids or dislikes social interaction; not wanting to be with other people.","zh":"以一种回避或不喜欢社交互动的方式；不想与他人来往地。"},"examples":[{"en":"He acted antisocially at the party and spent most of the night on his phone.","zh":"他在派对上表现得很反社交，大部分时间都在玩手机。"},{"en":"She withdrew antisocially after the argument and stopped replying to messages.","zh":"争吵后她反社交地退缩起来，不再回复消息。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that goes against society’s rules or harms other people; involving behavior that is disruptive or hostile.","zh":"以一种违反社会规范或伤害他人的方式；带有扰乱性或敌意的行为地。"},"examples":[{"en":"The teens were behaving antisocially, vandalizing public property.","zh":"那些青少年在做反社会行为，破坏公共财物。"},{"en":"The policy aims to reduce antisocially loud behavior in residential areas.","zh":"该政策旨在减少居民区里反社会式的喧闹行为。"}]}],"synonyms":["unsociably","withdrawnly","disruptively","hostilely"],"phonetic":"/ˌæn.tiˈsoʊ.ʃəl.i/","extraExplanation":["在日常英语里，antisocially 常有两种用法：一种偏“内向/不爱社交”（不太想跟人来往），另一种偏“反社会行为”（扰乱、挑衅、破坏等）。在正式语境（新闻、法律、社区公告）里，第二种更常见。","学习时可留意搭配：behave/act antisocially（行为反社会/不合群）、antisocially loud/noisy（扰民式喧闹）、antisocially toward others（对他人表现出敌意）。"]}
{"word":"antisociobiologist","summary":{"en":"An antisociobiologist is someone who criticizes or rejects sociobiology and its explanations of social behavior in biological/evolutionary terms.","zh":"antisociobiologist 指批评或否定社会生物学、反对用生物/进化来解释社会行为的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who opposes sociobiology (the idea that social behavior can be partly explained by evolution and genetics), often criticizing it as overly biological or politically/ethically risky.","zh":"反社会生物学者；指反对“社会生物学”（用进化与遗传解释社会行为的学说）的人，常批评其过度生物决定论或具有政治/伦理风险。"},"examples":[{"en":"Some antisociobiologists argued that sociobiology downplays the role of culture and history.","zh":"一些反社会生物学者认为，社会生物学淡化了文化与历史的作用。"},{"en":"The debate between sociobiologists and antisociobiologists shaped discussions in biology and the social sciences.","zh":"社会生物学者与反社会生物学者之间的争论影响了生物学与社会科学的讨论方向。"}]}],"synonyms":["critic of sociobiology","opponent of sociobiology","anti-sociobiology thinker"],"phonetic":"/ˌæn.tiˌsoʊ.si.oʊ.baɪˈɑː.lə.dʒɪst/","extraExplanation":["“antisociobiologist”多见于学术争论语境，尤其与20世纪70—90年代围绕E. O. Wilson《Sociobiology》引发的讨论有关。反对者常担心：把复杂的人类行为过度归因于基因会忽视教育、制度与文化，也可能被误用来为不平等或歧视辩护。","词形结构：anti-（反对）+ sociobiology（社会生物学）+ -ist（从事者/支持者）→ 指“反对社会生物学的人”。在写作中也可用更常见的表达，如 “critic of sociobiology（社会生物学批评者）”。"]}
{"word":"antisolar","summary":{"en":"Antisolar means ‘opposite the Sun’ or ‘pointing away from the Sun,’ mainly used in astronomy.","zh":"antisolar 指“与太阳相对/背向太阳的”，主要用于天文学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposite the Sun in the sky; directed away from the Sun.","zh":"在天空中与太阳方向相反的；背向太阳的。"},"examples":[{"en":"The comet’s tail points in an antisolar direction, away from the Sun.","zh":"彗星的尾巴指向反太阳方向，也就是背离太阳。"},{"en":"Astronomers looked for a faint glow near the antisolar point after midnight.","zh":"天文学家在午夜后寻找位于反太阳点附近的微弱光辉。"}]}],"synonyms":["opposite the Sun","sun-opposed","away from the Sun"],"phonetic":"/ˌæntiˈsoʊlər/","extraExplanation":["“antisolar point（反太阳点）”是天文学常用说法，指在天球上与太阳位置正相对的点。某些微弱天象（如“Gegenschein/对日光”）常被描述为出现在反太阳点附近。","在行星科学里也会用“antisolar”描述现象的方向性：例如尘埃、等离子体或彗尾通常受太阳风与辐射压影响，呈现“背向太阳”的结构。"]}
{"word":"antisophism","summary":{"en":"Antisophism means opposition to misleading reasoning (sophism) and support for honest, clear argumentation.","zh":"antisophism 指反对诡辩、支持诚实清晰的论证方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to sophism (misleading or deceptive reasoning), especially the effort to argue honestly and clearly instead of using tricky logic.","zh":"反诡辩；反对用诡辩（似是而非、带误导性的推理）来论证，强调用诚实清晰的逻辑进行讨论。"},"examples":[{"en":"The teacher encouraged antisophism in debates, asking students to avoid clever tricks and focus on evidence.","zh":"老师在辩论中鼓励反诡辩，要求学生避免耍小聪明，专注于证据。"},{"en":"Her antisophism made the discussion calmer and more productive.","zh":"她的反诡辩态度让讨论更冷静、更有效。"}]}],"synonyms":["opposition to sophistry","anti-sophistry","clear reasoning","intellectual honesty"],"phonetic":"/ˌæn.tiˈsɑː.fɪ.zəm/","extraExplanation":["词源上由 anti-（反对）+ sophism（诡辩）构成。sophism 与古希腊的“智者派（Sophists）”有关：他们以修辞和论辩技巧著名，但也常被批评为重胜负、轻真理，因此 sophism 在现代英语里多指“貌似有理但实则误导”的论证。","这个词在日常英语中非常少见；更常见的说法是 anti-sophistry（反诡辩/反诡辩术）或 simply “opposition to sophistry / clear, honest reasoning”。"]}
{"word":"antisophist","summary":{"en":"Antisophist means a person (or an approach) that opposes sophistry—clever-sounding but misleading argumentation.","zh":"Antisophist 指反对诡辩术的人（或反诡辩的立场/做法），强调用证据与清晰逻辑而不是话术取胜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposes sophists or sophistry (arguments that sound clever but are misleading).","zh":"反对诡辩家或诡辩术的人（反对那种听起来很聪明、但其实误导人的论证）。"},"examples":[{"en":"In the debate, she played the antisophist, asking for evidence instead of clever wordplay.","zh":"在辩论中，她扮演“反诡辩者”的角色，要求证据而不是花巧的措辞。"},{"en":"He wrote as an antisophist, criticizing arguments that hid weak logic behind fancy language.","zh":"他以反诡辩者的立场写作，批评那些用华丽语言掩盖薄弱逻辑的论点。"}]},{"partOfSpeech":"adj.","definition":{"en":"opposing sophistry; anti-sophistical.","zh":"反诡辩的；反对诡辩术的。"},"examples":[{"en":"The article takes an antisophist approach: define terms clearly, then test claims with facts.","zh":"这篇文章采取反诡辩的方式：先清晰定义术语，再用事实检验主张。"},{"en":"His antisophist tone is direct and skeptical of rhetorical tricks.","zh":"他反诡辩的语气很直接，对修辞花招保持怀疑。"}]}],"synonyms":["opponent of sophistry","anti-sophistical","logic-minded critic","skeptic of rhetoric"],"phonetic":"/ˌæn.tiˈsɑ.fɪst/","extraExplanation":["“sophist”源自古希腊，最初可指“智者/教师”，但在柏拉图等哲学家的批评中逐渐带上贬义，常指擅长用话术取胜、却不一定追求真理的人。因而“antisophist”多用于强调：反对以辞藻或技巧掩盖逻辑漏洞，主张以证据与清晰定义来讨论。","这个词在现代英语中较少见，写作里更常用的表达是“anti-sophistry / anti-sophistical”或直接说“someone who rejects sophistry”。"]}
{"word":"antisophistic","summary":{"en":"Antisophistic means against sophistry—favoring clear, honest reasoning instead of clever but misleading arguments.","zh":"antisophistic 指“反诡辩的”，强调用清晰、诚实的推理而不是貌似聪明却误导人的论证。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to sophistry (clever but misleading reasoning) or to the Sophists; aiming to be straightforward, honest, and not misleading in argument.","zh":"反诡辩的；反对“诡辩/似是而非的论证”的；主张论证应直接、诚实、不误导。"},"examples":[{"en":"The editor asked for an antisophistic tone—clear claims, clear evidence, no tricks.","zh":"编辑要求采用反诡辩的语气——观点清晰、证据明确、不耍花招。"},{"en":"Her antisophistic style makes complex issues easier for beginners to follow.","zh":"她反诡辩的表达方式让初学者更容易理解复杂问题。"}]}],"synonyms":["anti-sophistic","anti-sophistical","anti-sophistry","straightforward","plainspoken","unsophistical"],"phonetic":"/ˌæn.ti.səˈfɪs.tɪk/","extraExplanation":["“antisophistic”非常少见，更常见的写法是“anti-sophistic”或“antisophistical”。它来自：anti-（反对）+ sophistic（与诡辩/智辩相关）。\n在英语里，“sophistry”常指“看似聪明但实际上误导人的论证”。因此“antisophistic”通常用于学术写作、评论或辩论训练中，强调不玩文字游戏、避免偷换概念。"]}
{"word":"antisophistication","summary":{"en":"Antisophistication means opposition to sophistication, favoring a simple, plain, unpretentious style.","zh":"antisophistication 指反对“精致/复杂/世故”的倾向，强调简单、朴素、不矫饰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"opposition to sophistication; a preference for simplicity, plainness, or “unsophisticated” style, especially in taste, culture, language, or design.","zh":"反对“精致/世故/复杂化”的倾向；偏好简单、朴素或“不矫饰”的风格（常用于审美、文化、语言或设计等语境）。"},"examples":[{"en":"The brand’s antisophistication is part of its appeal: simple packaging, simple message.","zh":"这个品牌的“反精致化”正是它的吸引力：包装简单、信息也简单。"},{"en":"In her writing, antisophistication shows up as short sentences and plain words.","zh":"在她的写作里，“反精致化”表现为短句和朴素的用词。"},{"en":"Some critics saw the movement as antisophistication rather than innovation.","zh":"一些评论家认为这场运动是“反精致化”，而不是创新。"}]}],"synonyms":["plainness","simplicity","unpretentiousness","anti-elitism","anti-intellectualism"],"phonetic":"/ˌænti səˌfɪstɪˈkeɪʃən/","extraExplanation":["这个词非常少见，很多词典不收录；更常见的表达是 anti-intellectualism（反智主义）、anti-elitism（反精英主义）、anti-aesthetic（反审美）、preference for simplicity（偏好简约）等。","构词上是 anti-（反对）+ sophistication（精致、复杂、世故、老练）。因此它的含义会随语境在“反精致风格/反复杂化/反世故”之间移动；用于写作或评论时，建议先用更常见的说法，并在括号里解释。"]}
{"word":"antisophistry","summary":{"en":"Antisophistry means resisting or refuting sophistry—misleading but persuasive-sounding reasoning.","zh":"antisophistry 指反对或驳斥诡辩——那些具有迷惑性、听起来有说服力但逻辑不成立的论证。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to sophistry; the practice or attitude of resisting, exposing, or refuting misleading arguments that sound clever but are not logically sound.","zh":"反诡辩；指反对、揭露或驳斥那些听起来聪明却不合逻辑、以误导为目的的论证的做法或态度。"},"examples":[{"en":"In debate class, her antisophistry focused on pointing out hidden assumptions and false dilemmas.","zh":"在辩论课上，她的“反诡辩”主要是指出隐藏前提和虚假的两难选择。"},{"en":"The essay is an exercise in antisophistry: it values clear definitions over flashy rhetoric.","zh":"这篇文章是一种“反诡辩”的练习：它重视清晰的定义，而不是花哨的修辞。"}]}],"synonyms":["anti-sophistry","critical reasoning","logical refutation","debunking"],"phonetic":"/ˌæn.tiˈsɑː.fɪ.stri/","extraExplanation":["这个词比较少见，多见于哲学、修辞学或批判性思维语境。它由前缀 anti-（反对）+ sophistry（诡辩）构成。","sophistry 常指“表面有道理、实际站不住脚”的论证，往往依赖偷换概念、选择性证据、情绪煽动等；antisophistry 强调用清晰的定义、有效推理和证据来拆穿这些手法。"]}
{"word":"antisoporific","summary":{"en":"Antisoporific means “keeping you awake; not sleep-inducing.”","zh":"antisoporific 指“提神的、让人不困的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Keeping you awake; preventing sleep (the opposite of “soporific”).","zh":"使人清醒的；防止入睡的（与 soporific“催眠的”相反）。"},"examples":[{"en":"The speaker’s antisoporific jokes kept the audience awake during the long meeting.","zh":"演讲者那些提神的笑话让听众在漫长的会议中保持清醒。"},{"en":"I need something antisoporific—strong tea or a quick walk—before I start studying.","zh":"我需要点提神的东西——浓茶或快走一下——再开始学习。"}]}],"synonyms":["stimulating","invigorating","energizing","bracing","wakeful"],"phonetic":"/ˌæntiˌsɑpəˈrɪfɪk/","extraExplanation":["这个词比较少见，常见于较正式或幽默的语境中，用来夸张地说“很提神、绝不催眠”。","词源结构很直观：anti-（反对/抵抗）+ soporific（催眠的；使人想睡的，来自拉丁语 sopor“睡眠”】【-ic 为形容词后缀】。"]}
{"word":"antispace","summary":{"en":"Antispace usually means a fictional dimension beyond normal space; less commonly, it can mean a design concept similar to negative space.","zh":"Antispace 通常指科幻中“正常空间之外的维度”；较少见时也可指类似“负空间/留白”的设计概念。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Science fiction, speculative writing) A hypothetical realm or dimension “outside” normal space, often used for faster-than-light travel or unusual physics.","zh":"（科幻/设定用语）一种假想的“正常空间之外”的领域或维度，常用于解释超光速旅行或异常物理现象。"},"examples":[{"en":"In the novel, the ship enters antispace to cross the galaxy in minutes.","zh":"在小说里，飞船进入“反空间”，几分钟就穿越了整个星系。"},{"en":"The author describes antispace as silent and lightless, like an ocean without air.","zh":"作者把反空间写得寂静无光，像一片没有空气的海。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) The opposite of “space” in a design sense; an area defined by what is removed or blocked (similar to negative space).","zh":"（较少见）在设计语境中指“空间”的对立概念：由被去除、遮挡或留白所形成的区域（近似“负空间”）。"},"examples":[{"en":"The logo relies on antispace to form a hidden shape between the letters.","zh":"这个标志利用“反空间/负空间”，在字母之间形成一个隐藏的图形。"},{"en":"Try sketching the antispace around the object instead of the object itself.","zh":"试着画出物体周围的“反空间/留白”，而不是直接画物体本身。"}]}],"synonyms":["hyperspace","subspace","other dimension","negative space"],"phonetic":"/ˈæntiˌspeɪs/","extraExplanation":["“antispace”并不是日常英语里的常用词，更常见的对应表达是科幻中的“hyperspace / subspace”，以及设计中的“negative space（负空间）”。","如果你是在阅读某部作品或某个游戏设定里看到它，含义通常由作者设定决定：可能强调“与常规空间相反的规则/属性”，而不一定是科学术语。"]}
{"word":"antispadix","summary":{"en":"A botanical term for a sterile, spadix-like structure in some aroid plants, near/opposite the true spadix.","zh":"植物学术语：部分天南星科植物中，靠近或与真正肉穗花序相对的不育“类肉穗”结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany) A sterile, spadix-like structure found in some aroid plants (family Araceae), typically positioned opposite or alongside the true spadix inside the spathe.","zh":"（植物）一种见于部分天南星科植物的“不育的、类似肉穗花序（spadix）的结构”，通常位于佛焰苞（spathe）内，靠近或与真正的肉穗花序相对。"},"examples":[{"en":"In some Araceae, the antispadix sits near the spadix and may help guide insects.","zh":"在一些天南星科植物中，antispadix 位于肉穗花序附近，可能帮助引导昆虫。"},{"en":"The diagram labels the spathe, spadix, and a small antispadix at the base.","zh":"图示标注了佛焰苞、肉穗花序，以及基部一个小的 antispadix。"}]}],"synonyms":["pseudospadix","sterile spadix-like appendage"],"phonetic":"/ˌæn.taɪˈspeɪ.dɪks/","extraExplanation":["词源：anti-（“相对、对立”）+ spadix（“肉穗花序”）。因此 antispadix 字面含义可理解为“与肉穗花序相对的结构”。","这是偏专业的植物形态学术语，多见于分类描述、形态图解或植物学论文中；在日常英语里很少使用。"]}
{"word":"antispam","summary":{"en":"“Antispam” refers to something that prevents spam, or a tool/system used to block unwanted messages.","zh":"antispam 指“反垃圾信息的”，也可指用于过滤/拦截垃圾邮件、垃圾留言等的工具或系统。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to prevent or reduce spam (unwanted, often mass, messages), especially in email or online comments.","zh":"用于防止或减少垃圾信息（常见于群发邮件、广告留言等）的；反垃圾信息的。"},"examples":[{"en":"Our mail server has strong antispam protection.","zh":"我们的邮件服务器有很强的反垃圾邮件保护。"},{"en":"The blog added antispam tools to stop fake comments.","zh":"这个博客添加了反垃圾工具来阻止虚假评论。"}]},{"partOfSpeech":"n.","definition":{"en":"A system, feature, or tool that blocks or filters spam.","zh":"反垃圾系统/功能/工具；垃圾信息过滤工具。"},"examples":[{"en":"Please turn on the antispam in your email settings.","zh":"请在你的邮箱设置里开启反垃圾功能。"},{"en":"We upgraded our antispam to reduce phishing emails.","zh":"我们升级了反垃圾系统来减少钓鱼邮件。"}]}],"synonyms":["spam filter","anti-spam","spam protection","junk-mail filter"],"phonetic":"/ˌæn.tiˈspæm/","extraExplanation":["“anti-”表示“反对/防止”，例如: antivirus（杀毒/防病毒）、antifraud（反欺诈）。因此 antispam 很直观：防垃圾信息。","在技术语境中常见搭配：antispam filter（反垃圾过滤器）、antispam rules（反垃圾规则）、antispam protection（反垃圾防护）。","注意：spam 原义来自一种罐头肉品牌（SPAM），后在英语文化中逐渐被用来指“重复、铺天盖地的内容”，再引申为网络“垃圾信息”。"]}
{"word":"antispasis","summary":{"en":"Antispasis is a rhetorical device: using a word in a deliberately unusual or opposite sense, often to create irony or a twisted interpretation.","zh":"Antispasis 是一种修辞手法：故意把词用成不寻常或相反的意思，常用来制造反讽或曲解效果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a figure of speech where a word or phrase is used in an unusual or “wrong” sense (often deliberately), sometimes implying the opposite meaning or a twisted interpretation","zh":"（修辞）反转/误解用词：把词或短语故意用成不寻常或“误解”的意思，有时带有反讽或扭转原意的效果"},"examples":[{"en":"Calling a strict teacher “a real angel” can be antispasis, because the word is used with an opposite, ironic sense.","zh":"把很严格的老师称作“真正的天使”，可能属于 antispasis，因为这是用反讽的方式把词用成相反的意思。"},{"en":"In debates, speakers sometimes use antispasis to twist an opponent’s key word into a less favorable meaning.","zh":"在辩论中，说话者有时会用 antispasis，把对手的关键词“拧”成对其不利的含义。"}]}],"synonyms":["irony (in effect)","semantic reversal","(related) antanaclasis","(related) antiphrasis"],"phonetic":"/ˌæn.tiˈspeɪ.sɪs/","extraExplanation":["这是较少见的修辞术语，常出现在文学批评、修辞学教材中。它强调“把词义用歪/用反”所产生的效果，常带反讽或刻意曲解的意味。","容易与 antanaclasis（同词复用但词义不同，如“Time flies like an arrow; fruit flies like a banana.”）混淆：antanaclasis 更强调“重复同一个词并换义”，而 antispasis 更强调“故意用错/反用”造成的扭转。"]}
{"word":"antispasmodic","summary":{"en":"“Antispasmodic” means a drug or substance (or an adjective describing it) that prevents or relieves muscle spasms, often in the digestive system.","zh":"antispasmodic 指“解痉/抗痉挛的（药物或物质）”，常用于缓解胃肠等部位的肌肉痉挛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medicine or substance that prevents or relieves muscle spasms (sudden, involuntary muscle tightening), especially in the stomach or intestines","zh":"解痉药；抗痉挛药（用于预防或缓解肌肉痉挛，尤其是胃肠道痉挛）"},"examples":[{"en":"The doctor prescribed an antispasmodic to ease her stomach cramps.","zh":"医生开了抗痉挛药来缓解她的胃痉挛。"},{"en":"Some antispasmodic drugs can make you feel sleepy, so avoid driving at first.","zh":"有些解痉药可能会让人犯困，所以一开始要避免开车。"}]},{"partOfSpeech":"adj.","definition":{"en":"preventing or relieving muscle spasms","zh":"抗痉挛的；解痉的（能预防或缓解肌肉痉挛的）"},"examples":[{"en":"Peppermint oil is sometimes used for its antispasmodic effects on the gut.","zh":"薄荷油有时因其对肠道的解痉作用而被使用。"},{"en":"The label says the product has antispasmodic properties.","zh":"标签上写着该产品具有解痉特性。"}]}],"synonyms":["antispasmotic (less common)","spasmolytic (more technical)"],"phonetic":"/ˌæn.ti.spæzˈmɑː.dɪk/","extraExplanation":["词源：anti-（反、对抗）+ spasm（痉挛）+ -odic（表示“……的/与……有关的”）。因此 antispasmodic 字面意思是“对抗痉挛的”。","常见使用场景：医学语境里常用于描述“肠胃痉挛/绞痛（cramps）”“膀胱痉挛”等；也可见于成分说明（如某些草本或精油被描述为具有 antispasmodic effect）。","学习提示：spasm 常指“突然的、非自主的抽搐/痉挛”；cramp 更常用于日常表达“抽筋/绞痛”。两者在症状描述上有重叠，但 spasm 更偏医学或更正式。"]}
{"word":"antispasmodics","summary":{"en":"Antispasmodics are medicines used to prevent or relieve muscle spasms, often in the digestive system.","zh":"Antispasmodics 指“解痉药”，用于预防或缓解肌肉痉挛，常见于消化系统等部位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Medicines that prevent or relieve muscle spasms (sudden, involuntary tightening), especially in the stomach, intestines, bladder, or other smooth muscles.","zh":"解痉药；用于预防或缓解肌肉痉挛（突然、不由自主的收缩），尤其常见于胃肠道、膀胱等平滑肌。"},"examples":[{"en":"The doctor prescribed antispasmodics to reduce her stomach cramps.","zh":"医生开了解痉药来减轻她的胃痉挛/胃部绞痛。"},{"en":"Some antispasmodics may cause dry mouth or drowsiness, so read the label carefully.","zh":"有些解痉药可能会引起口干或嗜睡，所以要仔细阅读说明。"},{"en":"Antispasmodics are sometimes used to help manage symptoms of irritable bowel syndrome (IBS).","zh":"解痉药有时用于帮助控制肠易激综合征（IBS）的症状。"}]}],"synonyms":["antispasmodic drugs","antispasm agents","spasmolytics"],"phonetic":"/ˌæn.ti.spæzˈmɑd.ɪks/","extraExplanation":["“Antispasmodics”常以复数形式出现，指“一类药物”。单数形式是“an antispasmodic”。","词源上可拆分理解：anti-（反、对抗）+ spasm（痉挛）+ -ic（形容词后缀，表示“……的”），字面意思就是“对抗痉挛的”。","在英语医疗语境中，antispasmodics通常指作用于平滑肌的药物（如胃肠道绞痛、膀胱痉挛相关），不同药物的适应症与副作用可能差异很大。"]}
{"word":"antispasmotic","summary":{"en":"Antispasmodic means something (or a medicine) that prevents or relieves muscle spasms.","zh":"Antispasmodic 指“防止或缓解肌肉痉挛的（或解痉药）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Preventing or relieving muscle spasms (sudden tight contractions).","zh":"（医学）防痉挛的；缓解肌肉痉挛（突然的紧缩收缩）的。"},"examples":[{"en":"The doctor prescribed an antispasmodic to reduce the stomach cramps.","zh":"医生开了抗痉挛药来减轻胃痉挛。"},{"en":"Peppermint oil is sometimes used as a mild antispasmodic for digestive discomfort.","zh":"薄荷油有时被用作温和的抗痉挛剂来缓解消化不适。"}]},{"partOfSpeech":"n.","definition":{"en":"A drug or substance used to prevent or relieve spasms.","zh":"抗痉挛药；解痉剂（用于预防或缓解痉挛的药物或物质）。"},"examples":[{"en":"This antispasmodic may cause drowsiness, so don’t drive until you know how you react.","zh":"这种解痉药可能会引起嗜睡，所以在你确定自己的反应前不要开车。"},{"en":"Some antispasmodics help with irritable bowel syndrome (IBS) symptoms.","zh":"一些解痉药能帮助缓解肠易激综合征（IBS）的症状。"}]}],"synonyms":["antispastic","spasmolytic","muscle relaxant"],"phonetic":"/ˌæntiˌspæzˈmɑdɪk/","extraExplanation":["你输入的拼写“antispasmotic”常见于误拼；标准拼写更常见的是 **antispasmodic**（中间有 -smo-）。","该词多用于医疗语境，常与 **cramps（抽筋/绞痛）**、**spasm（痉挛）**、**muscle（肌肉）**、**intestinal/stomach（肠胃）** 等搭配出现。"]}
{"word":"antispast","summary":{"en":"Antispast is a poetry term for a four-syllable metrical foot with the pattern unstressed–stressed–stressed–unstressed (˘ ´ ´ ˘).","zh":"Antispast 是诗歌韵律术语，指四音节音步，重音模式为轻—重—重—轻（˘ ´ ´ ˘）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a metrical foot in poetry with the stress pattern unstressed–stressed–stressed–unstressed (˘ ´ ´ ˘).","zh":"（诗歌韵律）一种“音步”，重音模式为：轻—重—重—轻（˘ ´ ´ ˘）。"},"examples":[{"en":"In classical prosody, an antispast is written as ˘ ´ ´ ˘.","zh":"在古典韵律学中，antispast 常写作 ˘ ´ ´ ˘。"},{"en":"The teacher asked us to find an antispast-like rhythm in the line.","zh":"老师让我们在那一行诗里找一个类似 antispast 的节奏。"}]}],"synonyms":["metrical foot","prosodic foot"],"phonetic":"/ˈæn.tiˌspæst/","extraExplanation":["词源上来自希腊语，意思大致是“反向拉扯/反向对抗”，用在韵律里强调这种音步两端轻、中间重的“张力”。","它多见于古典（希腊/拉丁）韵律术语的讲解中；在现代英语诗歌分析里不算常用，但在学习格律（meter）时会遇到。"]}
{"word":"antispastic","summary":{"en":"Antispastic means “reducing or preventing muscle spasms,” and it can also refer to a drug that does this.","zh":"Antispastic 指“减轻或预防肌肉痉挛的”，也可指“抗痉挛药”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"used to prevent or reduce muscle spasms (sudden, tight muscle contractions), often in medical treatment","zh":"（药物/治疗）用于预防或减轻肌肉痉挛（肌肉突然紧绷收缩）的；抗痉挛的"},"examples":[{"en":"The doctor prescribed an antispastic medicine to help relax his muscles.","zh":"医生开了抗痉挛药来帮助他的肌肉放松。"},{"en":"Antispastic drugs are sometimes used to manage spasticity in conditions like multiple sclerosis.","zh":"抗痉挛药有时用于控制多发性硬化等疾病引起的肌张力增高（痉挛）。"}]},{"partOfSpeech":"n.","definition":{"en":"a medicine that reduces muscle spasms","zh":"抗痉挛药（用于减轻肌肉痉挛的药物）"},"examples":[{"en":"She takes an antispastic twice a day for muscle stiffness.","zh":"她每天服用两次抗痉挛药来缓解肌肉僵硬。"}]}],"synonyms":["antispasmodic","muscle-relaxing","spasmolytic"],"phonetic":"/ˌæn.tiˈspæs.tɪk/","extraExplanation":["词源上，anti- 表示“反、对抗”，spastic 来自“痉挛/痉挛性的”。在医疗语境里常与 spasticity（痉挛、肌张力增高）一起出现。","日常英语中更常见的相关词是 muscle relaxant（肌肉松弛剂）或 antispasmodic（解痉药；多用于胃肠道痉挛等），antispastic 更偏向神经系统相关的“痉挛/肌张力增高”管理。"]}
{"word":"antispectroscopic","summary":{"en":"Antispectroscopic means “against spectroscopy” or, more rarely, “not suitable for spectroscopic analysis.”","zh":"antispectroscopic 指“反对光谱学/光谱方法的”，更少见时也指“（某对象）不适合做光谱分析的/光谱表现不明显的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to spectroscopy or to the use of spectroscopic methods.","zh":"反对光谱学（或反对使用光谱方法）的。"},"examples":[{"en":"The author takes an antispectroscopic stance, arguing that spectra can mislead researchers.","zh":"作者采取反光谱学的立场，认为光谱可能会误导研究者。"},{"en":"In the debate, one group was strongly antispectroscopic and preferred classical wet-chemistry tests.","zh":"在这场争论中，有一派强烈反对光谱方法，更偏好传统的湿化学测试。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not suitable for, or not well explained by, spectroscopic analysis; showing weak, unclear, or unexpected spectral behavior (rare use).","zh":"不适合用光谱分析（或难以用光谱解释）的；光谱表现很弱、不清晰或异常的（少见用法）。"},"examples":[{"en":"The sample was described as antispectroscopic because it produced no clear signal under the available instruments.","zh":"该样品被描述为“antispectroscopic”，因为在现有仪器条件下几乎没有清晰信号。"},{"en":"Some early reports called the phenomenon antispectroscopic, though later studies provided a spectral explanation.","zh":"一些早期报告把这种现象称为“antispectroscopic”，但后续研究给出了光谱学解释。"}]}],"synonyms":["anti-spectroscopic","non-spectroscopic","spectroscopically silent"],"phonetic":"/ˌæn.tiˌspɛk.trəˈskɑ.pɪk/","extraExplanation":["这个词非常少见，多见于学术写作或评论中。结构上是 anti-（反对/相反）+ spectroscopic（光谱学的）。在正式论文里，更常用的替代表达包括 non-spectroscopic（非光谱的）、not amenable to spectroscopic analysis（不适用于光谱分析）、spectroscopically silent（在光谱上“沉默”的/信号极弱的，具体依语境）。"]}
{"word":"antispeculation","summary":{"en":"Antispeculation means opposition to speculation, especially in financial or housing markets; it can also mean avoiding unsupported guesswork.","zh":"antispeculation 指反对投机（常见于金融/房地产语境），也可指反对缺乏依据的臆测。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to speculation, especially to risky buying and selling meant to profit from price changes (often in markets like housing, land, or stocks).","zh":"反对投机（尤其指反对在住房、土地、股票等市场中，为了从价格波动中获利而进行的高风险买卖）。"},"examples":[{"en":"The city introduced anti-speculation rules to discourage quick house flipping.","zh":"这座城市推出了反投机规定，以遏制快速炒房。"},{"en":"Anti-speculation measures can help stabilize prices, but they may also reduce trading volume.","zh":"反投机措施能帮助稳定价格，但也可能减少交易量。"}]},{"partOfSpeech":"n.","definition":{"en":"A viewpoint or principle that distrusts guesswork and prefers decisions based on clear evidence or practical results.","zh":"一种立场或原则：不信任臆测与推测，偏好基于明确证据或实际效果来做决定。"},"examples":[{"en":"His anti-speculation attitude made him careful about making claims without data.","zh":"他反对臆测的态度让他在没有数据时很谨慎，不轻易下结论。"}]}],"synonyms":["anti-speculation","opposition to speculation","anti-profiteering","market regulation","evidence-based approach"],"phonetic":"/ˌæn.tiˌspɛk.jəˈleɪ.ʃən/","extraExplanation":["“antispeculation”更常见的写法是带连字符的“anti-speculation”，用于政策、金融、房地产等语境（如 anti-speculation tax 反投机税）。在一般写作中，直接说“opposition to speculation / anti-speculation measures”更自然。"]}
{"word":"antispending","summary":{"en":"Antispending describes people or policies that oppose (especially government) spending and prefer lower budgets.","zh":"Antispending 指反对（尤其是政府）支出的立场或政策，倾向于更低的预算与更少的开支。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to spending (especially government spending); favoring cutting budgets or keeping expenditures low.","zh":"反对支出（尤指政府开支）的；主张削减预算或控制花费的。"},"examples":[{"en":"The governor ran on an antispending platform, promising to reduce the budget deficit.","zh":"州长以反对开支的政纲参选，承诺削减预算赤字。"},{"en":"Some voters support antispending measures, while others worry about cuts to schools and hospitals.","zh":"一些选民支持反开支措施，而另一些人担心学校和医院被削减经费。"}]},{"partOfSpeech":"n.","definition":{"en":"The position or movement of opposing spending, especially public spending.","zh":"（尤指对公共开支的）反开支立场；反开支主张。"},"examples":[{"en":"Antispending can be popular during economic downturns.","zh":"在经济不景气时，反开支立场可能更受欢迎。"}]}],"synonyms":["anti-spending","fiscally conservative","budget-cutting","austere","spending-averse"],"phonetic":"/ˌæntiˈspɛndɪŋ/","extraExplanation":["“antispending”常见于美国政治与财政讨论中，通常和“balanced budget（平衡预算）”“tax cuts（减税）”“austerity（紧缩政策）”等话题一起出现。它不一定反对所有花钱，更常见的是反对“增加政府开支”或“扩大公共项目”。","写作上它多作定语：antispending voters / antispending agenda。也可以用更常见的表达替换，如 “opposed to government spending” 或 “fiscally conservative（财政保守的）”。"]}
{"word":"antispermotoxin","summary":{"en":"An antispermotoxin is a substance that damages or disables sperm.","zh":"antispermotoxin 指会损害或使精子失去活力的物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance (often an antibody or chemical) that harms, kills, or disables sperm cells, reducing their ability to move or fertilize an egg","zh":"抗精子毒素；一种（常为抗体或化学物质）会伤害、杀死或使精子失去活力，从而降低其运动能力或受精能力的物质"},"examples":[{"en":"Researchers studied an antispermotoxin that could reduce sperm motility in the lab.","zh":"研究人员在实验室中研究一种可降低精子运动能力的抗精子毒素。"},{"en":"In some cases, the immune system can produce antispermotoxin-like antibodies after injury or infection.","zh":"在某些情况下，受伤或感染后免疫系统可能产生类似抗精子毒素作用的抗体。"}]}],"synonyms":["spermatotoxin","sperm toxin","substance toxic to sperm"],"phonetic":"/ˌæn.tiˌspɝː.moʊˈtɑːk.sɪn/","extraExplanation":["这是一个较少见、偏学术的词：anti-（反、对抗）+ sperm（精子）+ toxin（毒素）。在医学与免疫学语境里，有时会用来泛指“对精子有毒/抑制精子功能的物质”，也可能与“抗精子抗体（antisperm antibodies）”的概念相关，但两者不完全等同。","它多出现在研究、论文或专业讨论中（如免疫性不育、避孕机制研究）。日常英语里更常见的说法是：substance toxic to sperm / spermicide（杀精剂，用于避孕的制剂）。"]}
{"word":"antispiral","summary":{"en":"Antispiral means “spiraling the opposite way,” and it can also refer to the fictional “Anti-Spirals” from *Gurren Lagann*.","zh":"Antispiral 可指“反向螺旋的”，也可指动画《天元突破 红莲螺岩》中的虚构势力“反螺旋族/反螺旋”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(geometry/description) Spiraling in the opposite direction to another spiral; counter-spiraling.","zh":"（几何/描述）与另一条螺旋方向相反的；反向螺旋的。"},"examples":[{"en":"The two currents formed a spiral and an antispiral pattern in the water.","zh":"两股水流在水中形成了螺旋与反向螺旋的图案。"},{"en":"If you draw a spiral clockwise, an antispiral would turn the other way.","zh":"如果你画的是顺时针螺旋，那么反向螺旋就会朝相反方向旋转。"}]},{"partOfSpeech":"n.","definition":{"en":"(popular culture) A fictional enemy group/species called the Anti-Spirals (especially in the anime *Tengen Toppa Gurren Lagann*).","zh":"（流行文化）虚构的敌对团体/种族“反螺旋族/反螺旋”（尤其指动画《天元突破 红莲螺岩》中的 Anti-Spirals）。"},"examples":[{"en":"In the story, the Anti-Spirals fear the spread of Spiral power.","zh":"在故事里，反螺旋族害怕螺旋力量的扩张。"},{"en":"Many fans refer to the main antagonists simply as the Antispiral.","zh":"许多粉丝会把主要反派直接称作“Antispiral”。"}]}],"synonyms":["counter-spiraling","opposite-direction spiral","anti-spiral"],"phonetic":"ˌæn.taɪˈspaɪ.rəl","extraExplanation":["“anti-”是英语里非常常见的前缀，表示“反对、相反、对抗”。所以 antispiral 字面意思就是“与螺旋相反/对抗螺旋”。","在正式写作中更常见的写法是连字符形式 anti-spiral（尤其当它只是临时的形容词用法时）；而在动漫语境中通常作为专有名词写作 Anti-Spiral(s)。"]}
{"word":"antispiritual","summary":{"en":"Antispiritual means opposed to spirituality or lacking a spiritual/reflective quality.","zh":"Antispiritual 指反对灵性/灵性信仰，或缺乏灵性与精神反思的特质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to spirituality, spiritual beliefs, or organized religious/spiritual practices","zh":"反对灵性、灵性信仰或宗教/灵修实践的"},"examples":[{"en":"His writing takes an antispiritual stance and treats religion as a social tool.","zh":"他的写作采取反灵性的立场，把宗教当作一种社会工具来讨论。"},{"en":"Some critics called the film antispiritual because it mocks sacred rituals.","zh":"一些评论家称这部电影“反灵性”，因为它嘲讽神圣仪式。"}]},{"partOfSpeech":"adj.","definition":{"en":"lacking a spiritual or reflective quality; focused only on the material or practical side of life","zh":"缺乏灵性/精神反思气质的；只重物质或功利层面的"},"examples":[{"en":"The discussion felt antispiritual—numbers mattered more than values.","zh":"这场讨论显得缺乏精神层面的关怀——数字比价值更重要。"},{"en":"He described the city as noisy and antispiritual, with little room for quiet reflection.","zh":"他形容这座城市喧闹而缺乏灵性，让人很难安静反思。"}]}],"synonyms":["anti-spiritual","anti-religious","irreligious","materialistic","worldly"],"phonetic":"/ˌæntiˈspɪrɪtʃuəl/","extraExplanation":["“antispiritual”不是最常见的日常词，更常见的说法是“anti-religious（反宗教的）”“anti-spiritual（反灵性/反灵修的）”或“materialistic（物质主义的）”。选用哪个取决于你是反对信仰体系，还是在描述一种只重物质、不重精神的气质。","语气上它可能带有批评色彩；在讨论宗教、哲学或文化作品（电影、文学、艺术）时更常见。写作中可用来表达立场（stance/attitude）或风格（tone）。"]}
{"word":"antispiritualism","summary":{"en":"Antispiritualism means opposition to spiritualism, especially the belief in communicating with spirits.","zh":"antispiritualism 指反对通灵主义（尤其是否认与灵界沟通的说法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to spiritualism (the belief that spirits can communicate with the living) or to spiritual/religious beliefs in general.","zh":"反对招魂术/通灵主义（认为灵魂能与活人沟通的信仰），也可泛指反对精神性或宗教信仰。"},"examples":[{"en":"His book was a strong statement of antispiritualism, criticizing séances and spirit messages.","zh":"他的书强烈表达了反通灵主义，批评降神会和所谓的“灵讯”。"},{"en":"In that period, antispiritualism grew as scientists challenged claims of supernatural communication.","zh":"在那个时期，随着科学家质疑超自然沟通的说法，反通灵主义逐渐兴起。"}]}],"synonyms":["opposition to spiritualism","skepticism about spirit communication","anti-occultism (broader)"],"phonetic":"/ˌæn.tiˈspɪr.ɪ.tʃu.əˌlɪz.əm/","extraExplanation":["“Spiritualism”常特指19世纪英美流行的“通灵主义”运动（如降神会、灵媒等）。因此 antispiritualism 往往出现在历史、宗教研究或怀疑论语境中，强调对灵媒与“灵界沟通”主张的反对或批判。"]}
{"word":"antispiritualist","summary":{"en":"Opposed to spiritualism (especially spirit-communication beliefs); or a person who opposes it.","zh":"反对唯灵论（尤其是“通灵/招魂”信仰）的；或指反唯灵论者。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to spiritualism (especially the belief that spirits of the dead can communicate with the living), or rejecting spiritualist ideas.","zh":"反对唯灵论（尤其指相信亡灵能与生者沟通的思想）或否定灵学/招魂等唯灵论观念的。"},"examples":[{"en":"Some scientists at the time took an antispiritualist stance and demanded controlled experiments.","zh":"当时有些科学家采取反唯灵论立场，要求进行可控实验。"},{"en":"Her antispiritualist views made her skeptical of séances and fortune-telling.","zh":"她的反唯灵论观点使她对降神会和算命持怀疑态度。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who opposes spiritualism or spiritualist movements.","zh":"反对唯灵论或唯灵论运动的人。"},"examples":[{"en":"He was an antispiritualist who wrote essays criticizing mediumship.","zh":"他是反唯灵论者，写文章批评通灵行为。"}]}],"synonyms":["anti-spiritualist","skeptic (in spiritualism contexts)","anti-occult (broader)"],"phonetic":"/ˌæn.tiˈspɪr.ɪ.tʃu.ə.lɪst/","extraExplanation":["“spiritualism”在英语里常特指19世纪兴起的“唯灵论/招魂运动”（séance、medium 等），而不一定等同于广义的“spiritual（精神/灵性层面的）”。因此 antispiritualist 往往是“反对唯灵论”的意思，而不是简单的“反对灵性/宗教”。","构词：anti-（反对）+ spiritualist（唯灵论者/灵学信奉者）。在学术或历史语境中更常见，在日常口语里相对少用。"]}
{"word":"antispiritualistic","summary":{"en":"Antispiritualistic means opposed to spiritualism—especially beliefs about communicating with spirits—and sometimes (less commonly) opposed to emphasizing spirituality in general.","zh":"antispiritualistic 指反对唯灵论（通灵、招魂等与灵体沟通的信仰与活动），较少见时也可泛指不强调灵性价值。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to spiritualism or to beliefs/practices that emphasize communication with spirits, séances, or supernatural spiritual forces.","zh":"反对唯灵论（招魂等与“与灵体沟通”相关的信仰与实践）的；反灵性主义的。"},"examples":[{"en":"The scientist wrote an antispiritualistic essay criticizing séances and spirit mediums.","zh":"这位科学家写了一篇反唯灵论的文章，批评降神会和通灵媒。"},{"en":"Her antispiritualistic views made her skeptical of claims about ghosts.","zh":"她反唯灵论的观点让她对“闹鬼”的说法非常怀疑。"}]},{"partOfSpeech":"adj.","definition":{"en":"more generally, opposed to emphasizing spirituality or spiritual values in life or art (less common).","zh":"（更泛、较少见）反对强调精神性/灵性价值的；不重视灵性层面的。"},"examples":[{"en":"Some critics called his early work antispiritualistic because it focused only on material success.","zh":"一些评论家说他早期的作品偏反灵性，因为只关注物质成功。"}]}],"synonyms":["anti-spiritualist","anti-spiritualism","skeptical of spiritualism","materialistic (in outlook)"],"phonetic":"/ˌæn.taɪˌspɪr.ɪ.tʃu.əˈlɪs.tɪk/","extraExplanation":["这个词比较少见，写作中更常用 spiritualism 的反义表达（如 anti-spiritualism / anti-spiritualist）。在语境里，spiritualism 通常特指19世纪兴起的“唯灵论/通灵运动”（séance、medium 等），而不是泛指“灵性（spirituality）”。读到 antispiritualistic 时，优先理解为“反唯灵论/反通灵运动”。"]}
{"word":"antispiritually","summary":{"en":"Antispiritually means “in a way that opposes or rejects spirituality.”","zh":"antispiritually 表示“以反对或否定灵性的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that opposes or rejects spirituality, spiritual beliefs, or spiritual values.","zh":"以反灵性（反宗教/反精神性）的方式；以排斥或否定灵性、宗教信念或精神价值的方式。"},"examples":[{"en":"Some critics say the film portrays religion antispiritually, focusing only on hypocrisy.","zh":"一些评论者认为这部电影以反灵性的方式呈现宗教，只聚焦于虚伪的一面。"},{"en":"He spoke antispiritually about prayer, treating it as meaningless habit.","zh":"他谈论祈祷时带着反灵性的态度，把它当作毫无意义的习惯。"},{"en":"The essay argues that modern life is organized antispiritually, around profit rather than purpose.","zh":"这篇文章认为现代生活在结构上是反灵性的：围绕利润而不是意义来运转。"}]}],"synonyms":["secularly","materialistically","irreligiously","anti-spiritually","nonspiritually"],"phonetic":"/ˌæntiˈspɪrɪtʃuəli/","extraExplanation":["“antispiritually”并不常见，更自然的表达常是：\"in an anti-spiritual way\"、\"anti-spiritual\"（形容词）或用更具体的副词如 \"secularly\"（世俗地）、\"materialistically\"（物质主义地）。","前缀 anti- 表示“反对、抵制”。因此该词通常用于评论、批评语境（如文化评论、宗教讨论），强调“立场上的反对”，而不仅仅是“缺乏灵性”。"]}
{"word":"antispirochetic","summary":{"en":"Antispirochetic means effective against spirochetes (spiral-shaped bacteria), especially in medical contexts.","zh":"Antispirochetic 指“抗螺旋体的”，即对螺旋体（螺旋状细菌）有效，多用于医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medicine) Able to kill or stop the growth of spirochetes (a type of spiral-shaped bacteria).","zh":"（医学）抗螺旋体的；能杀灭或抑制螺旋体（呈螺旋状的一类细菌）生长的。"},"examples":[{"en":"Penicillin is a classic antispirochetic treatment for syphilis.","zh":"青霉素是治疗梅毒的经典抗螺旋体药物。"},{"en":"The doctor chose an antispirochetic antibiotic after the lab results.","zh":"化验结果出来后，医生选择了抗螺旋体抗生素。"}]}],"synonyms":["antitreponemal","antiborreliacidal","antibacterial (general)"],"phonetic":"/ˌæn.taɪˌspaɪ.roʊˈkiː.tɪk/","extraExplanation":["“spirochete（螺旋体）”是一类细菌，常见相关疾病包括梅毒（Treponema pallidum）和莱姆病（Borrelia burgdorferi）。因此“antispirochetic”多出现在医学、药理学或临床用药语境中。","构词法：anti-（反、抗）+ spirochet-（螺旋体）+ -ic（形容词后缀），意思直译就是“抗螺旋体的”。"]}
{"word":"antispit","summary":{"en":"Antispit (more commonly written anti-spit) means “preventing spitting or spray,” or a device/product that reduces spray.","zh":"antispit（更常写作 anti-spit）指“防喷溅/防飞沫的”，也可指用于减少喷溅的装置或产品。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to prevent spitting (spraying or scattering of saliva, liquid, or small particles).","zh":"用于防止“飞溅/喷溅”（如唾液、液体或细小颗粒喷出或四散）的。"},"examples":[{"en":"The studio installed an anti-spit shield in front of the microphone.","zh":"录音室在麦克风前安装了防喷溅（防口水）挡板。"},{"en":"Use an anti-spit valve to reduce back-spray in the system.","zh":"使用防回喷阀来减少系统中的回喷/飞溅。"}]},{"partOfSpeech":"n.","definition":{"en":"A product or device used to prevent spitting or spray (for example, a shield, filter, or valve).","zh":"防喷溅用品/装置（例如挡板、滤网或阀门）。"},"examples":[{"en":"They added an antispit to the setup to keep the surface clean.","zh":"他们在装置上加了一个防喷溅装置来保持表面清洁。"}]}],"synonyms":["anti-spatter","splash-proof","spatter-resistant","spray guard"],"phonetic":"/ˌæn.tiˈspɪt/","extraExplanation":["“antispit”并不是非常常见的标准词；更常见的写法是带连字符的 **anti-spit**。在不同领域它指的“spit”也可能不同：口语里多指唾液飞溅（例如麦克风防喷罩/挡板），工程或设备语境里也可能指液体或颗粒的“喷溅/回喷”。","如果你是在某个特定产品说明、论文或零件名称里看到这个词，可以告诉我原句/领域（如音频设备、工业管路、混凝土外加剂等），我可以帮你更精确地解释。"]}
{"word":"antisplasher","summary":{"en":"Antisplasher means a splash-preventing device or something designed to stop liquid from splashing.","zh":"antisplasher 指“防止液体飞溅的装置/部件”，也可作形容词表示“防溅的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device, part, or cover designed to prevent liquid from splashing (for example, on a sink, faucet, or machine).","zh":"防溅装置；防溅盖（用于防止液体飞溅的零件或罩子，例如水槽、水龙头或机器上的部件）。"},"examples":[{"en":"The faucet came with an antisplasher to keep water from spraying everywhere.","zh":"这个水龙头配了防溅装置，能防止水喷得到处都是。"},{"en":"Install an antisplasher on the mixing tank to reduce spills and mess.","zh":"在搅拌罐上安装防溅盖，可以减少溢出和脏乱。"}]},{"partOfSpeech":"adj.","definition":{"en":"designed to prevent splashing; splash-resistant (often used before a noun).","zh":"防溅的；防飞溅的（常作定语修饰名词）。"},"examples":[{"en":"They added an antisplasher shield to the machine.","zh":"他们给机器加了一个防溅挡板。"},{"en":"Use an antisplasher attachment when you rinse the brush.","zh":"冲洗刷子时用防溅配件。"}]}],"synonyms":["splash guard","splash shield","splashback protector","splatter guard","anti-splash guard"],"phonetic":"/ˌæn.tiˈsplæʃ.ɚ/","extraExplanation":["“antisplasher”不是非常常见的标准词，更常见的说法有 **splash guard / splash shield / splashback protector**（防溅挡板/防溅罩）。它由前缀 **anti-（防止）** + **splash（飞溅）** + **-er（…的东西/人）** 构成，含义通常能被母语者理解，但在正式产品名称中可能会被其他更固定的词替代。"]}
{"word":"antisplenetic","summary":{"en":"Antisplenetic describes something used to counteract or treat disorders of the spleen.","zh":"antisplenetic 指用于对抗或治疗脾脏疾病的（医学用语，较少见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Used to prevent, relieve, or treat problems of the spleen.","zh":"（医学）用于预防、缓解或治疗脾脏问题的；抗脾（疾患）的。"},"examples":[{"en":"The old text lists several antisplenetic herbs for an enlarged spleen.","zh":"那本旧医书列出了一些用于脾肿大的抗脾草药。"},{"en":"This remedy was once described as antisplenetic, though modern evidence is limited.","zh":"这种疗法曾被描述为抗脾的，不过现代证据有限。"}]}],"synonyms":["splenic remedy","for spleen disorders","spleen-protective (context-dependent)"],"phonetic":"/ˌæn.ti.spləˈnɛtɪk/","extraExplanation":["词源：anti-（“反对、对抗”）+ splen（“脾脏”，源自希腊语 splēn）+ -etic（构成形容词）。","用法提示：这是非常罕见且偏医学/古典药学的词；现代英语里更常用的表达是 “used to treat spleen problems / for spleen disorders（用于治疗脾脏疾病）”。","文化小背景：在较早期的欧洲医学与草药学传统中，人们常把某些草药归类为“对某器官有益/有作用”的药性，因此会出现像 antisplenetic 这样的描述性术语。"]}
{"word":"antisplitting","summary":{"en":"Antisplitting means opposing a split—especially the breakup of a group into factions.","zh":"antisplitting 指反对分裂，尤其是反对团体或组织分裂成不同派别。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to splitting (especially the division of a group, party, or organization into separate factions).","zh":"反对分裂（尤指反对团体、政党或组织分成不同派别）。"},"examples":[{"en":"The union leaders took an antisplitting stance during the negotiations.","zh":"工会领导人在谈判中采取了反对分裂的立场。"},{"en":"Their antisplitting message emphasized unity and compromise.","zh":"他们反分裂的讯息强调团结与妥协。"}]}],"synonyms":["anti-split","anti-division","pro-unity","unifying"],"phonetic":"/ˌæntiˈsplɪtɪŋ/","extraExplanation":["“anti-”表示“反对/抵制”，“splitting”表示“分裂、分裂行为”。“antisplitting”常见于政治或组织语境，用来描述“反对内部分裂、主张团结”的立场或政策。也可写作“anti-splitting”。"]}
{"word":"antispreader","summary":{"en":"“Antispreader” means something or someone that helps stop something from spreading.","zh":"“Antispreader”指帮助阻止某事扩散的人或事物（更常写作 anti-spreader）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person, policy, or tool meant to prevent something (such as disease, misinformation, or harmful influence) from spreading.","zh":"用来防止某事（如疾病、谣言或负面影响）扩散的人、政策或工具。"},"examples":[{"en":"Mask-wearing and good ventilation were described as simple antispreaders during flu season.","zh":"在流感季，戴口罩和良好通风被认为是简单有效的“防扩散措施”。"},{"en":"Some people called fact-checkers antispreaders because they reduce the spread of false news.","zh":"有人把事实核查者称为“防扩散者”，因为他们能减少假新闻的传播。"}]}],"synonyms":["anti-spreader","preventive measure","containment measure","spread-prevention measure","fact-checker"],"phonetic":"/ˌæntiˈsprɛdɚ/","extraExplanation":["“antispreader”不是非常常见的标准词，更多时候会写成 **anti-spreader**（加连字符）或用更自然的表达，如 **preventive measure**（预防措施）、**containment measure**（遏制措施）、**fact-checker**（事实核查者）等。","在公共卫生语境里，更常见的说法是 **anti-spread measures**（防扩散措施）或 **contain the spread**（遏制传播），而不是把“antispreader”当作固定名词广泛使用。"]}
{"word":"antispreading","summary":{"en":"Antispreading means preventing something from spreading.","zh":"antispreading 指“防止扩散/蔓延的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to prevent something from spreading (for example, liquid, bacteria, a fire, or a stain).","zh":"用于防止某物扩散/蔓延的（如液体、细菌、火势或污渍）。"},"examples":[{"en":"The lab uses an antispreading mat to keep spills from reaching other work areas.","zh":"实验室使用防扩散垫，防止溢出物蔓延到其他工作区域。"},{"en":"This cream is marketed as antispreading, meaning it won’t run easily after you apply it.","zh":"这种乳霜主打“防扩散”，意思是涂上后不容易流淌开。"},{"en":"The city built an antispreading barrier to slow the fire from moving toward homes.","zh":"市政府修建了防蔓延隔离带，以减缓火势向民宅方向扩散。"}]}],"synonyms":["anti-spread","spill-resistant","non-spreading","containment"],"phonetic":"/ˌæn.tiˈsprɛd.ɪŋ/","extraExplanation":["该词更常见的写法是带连字符的 **anti-spreading**，尤其在产品说明、科研或工程语境中（如 anti-spreading coating/barrier/mat）。不带连字符的写法也能见到，但在正式写作里连字符更清晰。","构词：**anti-**（反、阻止）+ **spreading**（扩散的）。因此它通常是“功能性/用途性”形容词，用来修饰具体名词（coating 涂层、barrier 屏障、mat 垫子、agent 药剂等）。"]}
{"word":"antisquama","summary":{"en":"Antisquama is a rare zoological term for an accessory or counter-scale— a small scale-like plate opposite or behind another scale.","zh":"Antisquama 是一个罕见的动物学术语，指位于另一片鳞片对侧或其后方的附加小鳞/对鳞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology, rare) A small scale or scale-like plate that lies opposite or behind another scale; an accessory or “counter-” scale mentioned in detailed descriptions of fish or other animals’ surface structures.","zh":"（动物学，罕用）位于另一片鳞片的对侧或其后方的较小鳞片/鳞状小板；在对鱼类等动物体表结构作细致描述时，指一种“附加鳞/对鳞”。"},"examples":[{"en":"In some older zoological descriptions, an antisquama is noted as an accessory scale near the main scale.","zh":"在一些较早的动物学描写中，antisquama 被记为主鳞附近的附加鳞片。"},{"en":"The researcher recorded the presence of an antisquama behind the larger scale as a diagnostic detail.","zh":"研究者把大鳞后方出现的 antisquama 记录为一个鉴别细节。"}]}],"synonyms":["accessory scale","counter-scale","secondary scale"],"phonetic":"/ˌæntiˈskweɪmə/","extraExplanation":["这个词非常少见，多见于较早的动物学或形态学文献。词源上可拆为 anti-（“相对/对向/对抗”）+ squama（拉丁语“鳞片”），整体意思就是“与鳞片相对的（小）鳞/附加鳞”。在现代写作里，作者更常直接用 accessory scale（附加鳞）或类似的更通用表达。"]}
{"word":"antisquatting","summary":{"en":"Antisquatting refers to actions or policies that prevent squatting—illegally occupying vacant property.","zh":"Antisquatting 指为防止“非法占屋/占地（squatting）”而采取的措施、政策或相关服务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Measures, policies, or services used to prevent people from illegally occupying an empty building or piece of land (squatting).","zh":"用于防止他人非法占用空置建筑或土地（非法占屋/占地）的措施、政策或服务。"},"examples":[{"en":"The landlord installed stronger locks as an antisquatting measure.","zh":"房东加装更坚固的锁，作为防非法占屋的措施。"},{"en":"The city introduced antisquatting rules for abandoned properties.","zh":"市政府为废弃房产推出了反非法占屋的规定。"}]},{"partOfSpeech":"adj.","definition":{"en":"Designed to discourage or stop squatting; intended to protect vacant property from being occupied without permission.","zh":"用于阻止或减少非法占屋的；旨在保护空置房产不被擅自入住的。"},"examples":[{"en":"They put up antisquatting signage to warn trespassers.","zh":"他们竖起反非法占屋的告示牌来警告擅闯者。"},{"en":"The building was fitted with antisquatting doors and alarms.","zh":"这栋楼安装了防非法占屋的门和警报器。"}]}],"synonyms":["anti-squatting","anti-squat","squat-prevention","property protection"],"phonetic":"/ˌæn.tiˈskwɑtɪŋ/","extraExplanation":["“antisquatting”多见于英国/欧洲的房产管理语境。现实中还可能指“property guardianship（物业看护）”这类安排：让受雇的居住者以较低费用住进空置楼，以降低被非法占用、破坏或盗窃的风险；但其法律与居住权利保障因国家与合同不同而差异很大。"]}
{"word":"antistadholder","summary":{"en":"“Antistadholder/anti-stadtholder” is a historical term for someone who opposed the Dutch stadtholder and stadtholder rule.","zh":"“Antistadholder/anti-stadtholder”是历史用语，指反对荷兰共和国“执政（Stadtholder）”及其统治的人或派别。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or group opposed to the stadtholder (the chief executive position in the Dutch Republic); an opponent of stadtholder rule","zh":"反对“执政（Stadtholder，荷兰共和国的最高行政首长）”的人或派别；反执政派"},"examples":[{"en":"The anti-stadtholders argued for reducing the power of the House of Orange.","zh":"反执政派主张削弱奥兰治家族的权力。"},{"en":"In the late eighteenth century, anti-stadtholder politics grew stronger in several Dutch cities.","zh":"在18世纪末，反执政派政治在一些荷兰城市变得更强势。"}]}],"synonyms":["opponent of the stadtholder","anti-Orange (historical)","republican (historical context-dependent)"],"phonetic":"/ˌæntiˈstɑtˌhoʊldər/","extraExplanation":["“Stadtholder”是荷兰共和国时期的政治头衔，常与奥兰治家族联系在一起；“anti-stadtholder”通常指反对该职位或反对其集权倾向的政治力量。","这个词多见于历史语境（如17—18世纪荷兰政治斗争、爱国者运动等），在现代日常英语中很少使用。","拼写提示：更常见的写法是加连字符的 **anti-stadtholder**。如果你想表达更一般的“反对某位领导/制度的人”，现代英语更常用 **opponent**, **anti-monarchist**, **republican**, **anti-government** 等，视具体语境而定。"]}
{"word":"antistadholderian","summary":{"en":"Anti-Stadtholderian = opposed to the Dutch Stadtholder system; favoring a more republican government in Dutch history.","zh":"Anti-Stadtholderian＝反对荷兰“执政/总督”体制、倾向共和派立场的历史用语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(historical) Opposed to the Stadtholder (the Dutch hereditary chief executive) and supporting a more republican, regent-led government in the Netherlands, especially in the 17th–18th centuries.","zh":"（历史）反对“执政”（Stadtholder，荷兰共和国时期的世袭最高行政长官/总督），主张更偏共和、由摄政寡头/地方执政者（regents）主导的荷兰政体，尤指17—18世纪。"},"examples":[{"en":"Anti-Stadtholderian politicians argued that too much power in one family threatened the Republic’s liberties.","zh":"反执政派政治人物认为，把过多权力集中在一个家族手里会威胁共和国的自由。"},{"en":"The pamphlet was written from an anti-Stadtholderian viewpoint during a period of political tension.","zh":"这本小册子写于政治紧张时期，立场是反执政派。"}]}],"synonyms":["republican (in Dutch historical context)","anti-Orangist","anti-monarchic (roughly, context-dependent)"],"phonetic":"/ˌænti ˌstɑtˈhoʊldəriən/","extraExplanation":["“Stadtholder”（荷兰语 stadhouder）常译作“执政”“总督”或“执政官”，在荷兰共和国并非国王，但往往由奥兰治家族（House of Orange）担任，权力在不同时期强弱不一。","“Anti‑Stadtholderian”常与“共和派/反奥兰治派”立场接近；而支持执政权力、支持奥兰治家族者常被称为“Orangist（奥兰治派）”。","这个词多见于历史写作，现代英语里较少使用；拼写上常见带连字符的形式：anti‑Stadtholderian。"]}
{"word":"antistalling","summary":{"en":"Anti-stalling means preventing an engine or system from stalling (stopping unexpectedly).","zh":"Anti-stalling 指“防熄火/防停转”，用于避免发动机或系统意外停止。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed or used to prevent an engine, vehicle, or system from stopping unexpectedly (stalling).","zh":"用于防止发动机、车辆或系统意外熄火/停转（stall）的；防熄火的。"},"examples":[{"en":"This motorcycle has an anti-stalling system that helps beginners avoid stalling at low speed.","zh":"这辆摩托车有防熄火系统，能帮助新手在低速时不容易熄火。"},{"en":"The car’s anti-stalling feature keeps the engine running smoothly when you start moving uphill.","zh":"这辆车的防熄火功能能让你上坡起步时发动机更平稳、不易熄火。"}]},{"partOfSpeech":"n.","definition":{"en":"A feature or setting that prevents stalling (for example, by raising idle speed or adjusting fuel/air control).","zh":"防熄火功能/设置（例如通过提高怠速或调整燃油/进气控制来避免熄火）。"},"examples":[{"en":"Turn on anti-stalling if the engine keeps dying at traffic lights.","zh":"如果你在红绿灯处总是熄火，就把防熄火功能打开。"},{"en":"The technician updated the anti-stalling to reduce stop-and-go stalling.","zh":"技师更新了防熄火设置，减少走走停停时的熄火。"}]}],"synonyms":["stall-prevention","anti-stall","stall-resistant"],"phonetic":"/ˌæn.tiˈstɔl.ɪŋ/","extraExplanation":["“Anti-stalling”通常写作带连字符的“anti-stalling”。常见于汽车、摩托车、工程机械等领域，指通过控制系统（如电子节气门、怠速控制、燃油喷射策略）来避免低转速或负载变化时熄火。","注意与航空里的“anti-stall（防失速）”区分：飞机的“stall”更多指机翼失速（升力不足），而车辆里的“stall”多指发动机熄火/停转。"]}
{"word":"antistaphylococcal","summary":{"en":"Antistaphylococcal means ‘working against Staphylococcus (staph) bacteria,’ especially describing antibiotics or treatments.","zh":"antistaphylococcal 指“抗葡萄球菌的”，常用于描述针对葡萄球菌（staph）的抗生素或治疗。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to medicines (especially antibiotics) that work against Staphylococcus bacteria, including staph infections.","zh":"（尤指抗生素等药物）抗葡萄球菌的；用于对抗葡萄球菌（staph）感染的。"},"examples":[{"en":"The doctor prescribed an antistaphylococcal antibiotic for the skin infection.","zh":"医生为这次皮肤感染开了抗葡萄球菌的抗生素。"},{"en":"Antistaphylococcal treatment is important when Staphylococcus aureus is suspected.","zh":"当怀疑是金黄色葡萄球菌感染时，抗葡萄球菌治疗很重要。"}]}],"synonyms":["anti-staph","antistaphylococcic (less common)"],"phonetic":"/ˌæn.taɪˌstæf.ə.ləˈkɑː.kəl/","extraExplanation":["“anti-”表示“反对/抗……”，而“staphylococcal”来自“Staphylococcus（葡萄球菌）”。因此 antistaphylococcal 常见于医学语境，描述“针对葡萄球菌”的药物或疗法。","在临床上常见搭配：antistaphylococcal antibiotic（抗葡萄球菌抗生素）、antistaphylococcal therapy/treatment（抗葡萄球菌治疗）。","注意它描述的是“作用对象/针对的细菌”，并不等同于“所有皮肤感染都适用”。是否使用取决于医生对病原体与耐药性的判断（例如是否可能是 MRSA）。"]}
{"word":"antistaphylococcic","summary":{"en":"Antistaphylococcic means ‘effective against or related to staphylococcal bacteria.’","zh":"antistaphylococcic 指“抗葡萄球菌的；与葡萄球菌相关或对其有效的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or effective against staphylococci (a group of bacteria that can cause infections).","zh":"抗葡萄球菌的；与葡萄球菌相关或对其有效的（葡萄球菌是一类可引起感染的细菌）。"},"examples":[{"en":"The doctor prescribed an antistaphylococcic antibiotic for the skin infection.","zh":"医生为这种皮肤感染开了抗葡萄球菌的抗生素。"},{"en":"Strict hand hygiene helps prevent the spread of antistaphylococcic-resistant strains.","zh":"严格的手部卫生有助于防止对抗葡萄球菌药物耐药菌株的传播。"}]}],"synonyms":["anti-staphylococcal","antistaphylococcal"],"phonetic":"/ˌæn.tiˌstæf.ɪˌlɑː.kɑː.kɪk/","extraExplanation":["这个词多用于医学与药学语境，常见搭配有：antistaphylococcic antibiotic（抗葡萄球菌抗生素）、antistaphylococcic activity/agent（抗葡萄球菌活性/药物）。","词形结构：anti-（反对、抗）+ staphylococc-（葡萄球菌）+ -ic（形容词后缀）。在临床上常用于强调药物/治疗对“葡萄球菌”这一类细菌的针对性。","相关概念：MRSA 指“耐甲氧西林金黄色葡萄球菌”，属于对多种常见抗生素耐药的葡萄球菌类型，因此有时会看到更具体的表达（例如针对 MRSA 的治疗）。"]}
{"word":"antistasis","summary":{"en":"Antistasis is a rhetorical device where the same word is repeated with a different meaning each time.","zh":"Antistasis 指一种修辞：同一词反复出现，但每次意思不同。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rhetoric) Repeating the same word or phrase but with a different meaning each time, often creating a clever contrast or a pun-like effect.","zh":"（修辞）重复同一个词或短语，但每次使用的意义不同，常用来制造对比或带有双关效果。"},"examples":[{"en":"In the line “We must all hang together, or we shall all hang separately,” the word “hang” shifts meaning between “stay united” and “be executed.”","zh":"在“我们必须团结一致，否则就会各自被绞死”这句话里，“hang”一词的含义从“团结在一起”转为“被绞死”。"},{"en":"The slogan plays with antistasis: “Let’s address the issue before it addresses us.”","zh":"这句标语运用了 antistasis：“在问题‘找上门’之前，先去‘解决’问题。”"}]}],"synonyms":["antanaclasis","pun","wordplay"],"phonetic":"/ˌæntiˈstæsɪs/","extraExplanation":["词源来自希腊语：anti-（“相对、反向”）+ stasis（“站立、位置”）。在修辞学里强调“同词异义”的转折效果。","它常被归到“文字游戏/双关”一类的修辞手法中；有的教材会把它与 antanaclasis（同词异义反复）并列或近似处理，实际使用中两者常被混用。"]}
{"word":"antistat","summary":{"en":"Antistat means an antistatic product/agent or something designed to reduce static electricity.","zh":"Antistat 指抗静电产品/抗静电剂，或表示“抗静电的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an antistatic agent or product used to reduce or prevent static electricity (especially on plastics, fabrics, or electronic parts)","zh":"抗静电剂；用于减少或防止静电的产品（常用于塑料、织物或电子零件）"},"examples":[{"en":"The factory adds an antistat to the plastic to stop parts from clinging together.","zh":"工厂在塑料里加入抗静电剂，防止零件互相黏住。"},{"en":"Use an antistat spray before cleaning the screen to reduce dust attraction.","zh":"清洁屏幕前先用抗静电喷雾，减少吸附灰尘。"}]},{"partOfSpeech":"adj.","definition":{"en":"antistatic; designed to reduce or prevent static electricity","zh":"抗静电的；用于减少或防止静电的"},"examples":[{"en":"These bags have an antistat lining to protect sensitive electronics.","zh":"这些袋子有抗静电内衬，用来保护敏感电子元件。"},{"en":"Wear antistat gloves when handling circuit boards.","zh":"处理电路板时要戴抗静电手套。"}]}],"synonyms":["antistatic","anti-static","antistatic agent","static-control agent"],"phonetic":"/ˌæntiˈstæt/","extraExplanation":["“antistat”在工业与产品说明中常见，通常是“antistatic（抗静电）”的简写，或指“antistatic agent（抗静电剂）”。在日常英语里更常见的说法是“antistatic”或“anti-static”。"]}
{"word":"antistate","summary":{"en":"“Antistate” describes ideas, actions, or groups that oppose the state or government authority.","zh":"“antistate”指反对国家或政府权威的思想、行为或团体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to the authority, actions, or existence of the state (government), especially in politics or ideology.","zh":"反国家的；反对国家（政府）权威、政策或国家存在的（常用于政治或意识形态语境）。"},"examples":[{"en":"The group was accused of spreading antistate propaganda.","zh":"该团体被指控散布反国家宣传。"},{"en":"Some antistate movements reject centralized government entirely.","zh":"一些反国家运动完全拒绝中央集权政府。"},{"en":"In the novel, the hero’s antistate speech sparks a public debate.","zh":"在小说中，主角的反国家演讲引发了公众讨论。"}]}],"synonyms":["anti-government","anti-regime","subversive","anti-authority"],"phonetic":"/ˌæn.tiˈsteɪt/","extraExplanation":["“antistate”更常见的写法是带连字符的“anti-state”，尤其在新闻、学术或正式写作中；不带连字符也能见到，但可能显得更口语或更像合成词。","这个词在不同国家/语境里带有强烈政治色彩：在一些官方叙事中常用于指控“危害国家”的言论或组织；在政治理论讨论中也可能较中性，用来描述“反对国家干预/反对国家机器”的立场（如某些无政府主义或反国家极权的观点）。使用时注意语境与立场差异。"]}
{"word":"antistater","summary":{"en":"Antistater (more commonly “anti-stater”) means someone who opposes the state/government, or describes ideas that oppose government control.","zh":"antistater（更常写作“anti-stater”）指反对国家/政府权力的人，也可形容反对政府控制的观点或立场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposes the state (government) or rejects state power, especially in politics","zh":"反国家主义者；反对国家（政府）权力的人（尤用于政治语境）"},"examples":[{"en":"Some anti-staters argue that the government should have far less power.","zh":"一些反国家主义者主张政府的权力应该小得多。"},{"en":"He’s an anti-stater who distrusts most state institutions.","zh":"他是个反国家主义者，不太信任大多数国家机构。"}]},{"partOfSpeech":"adj.","definition":{"en":"opposed to the state or to government control","zh":"反国家的；反对政府控制的"},"examples":[{"en":"They took an anti-stater stance on education policy.","zh":"他们在教育政策上采取了反国家（反对政府干预）的立场。"},{"en":"The group’s anti-stater message spread online quickly.","zh":"该团体的反国家信息很快在网上传播开来。"}]}],"synonyms":["anti-statist","anti-government (general)","state-skeptic (informal)","anarchist (overlapping, not identical)"],"phonetic":"/ˌæn.taɪˈsteɪ.tɚ/","extraExplanation":["“antistater”更常见的写法是带连字符的“anti-stater”。在英语里，“anti-”作前缀时经常与名词连写或用连字符连接，但用于“the state（国家/政府）”这种抽象概念时，连字符能让结构更清晰。","在现实语境中，它多见于政治讨论或网络评论，带有立场色彩；与“anarchist（无政府主义者）”有重叠但不完全等同：反国家不一定主张完全取消政府，也可能只是强烈反对政府干预。","更常见、也更标准的对应词是“anti-statist”（反国家干预/反国家主义的），学术或正式写作里更常用它。"]}
{"word":"antistatic","summary":{"en":"Antistatic means made to prevent or reduce static electricity.","zh":"antistatic 指“防静电的”，用于减少或防止静电产生与积累。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to reduce or prevent the buildup of static electricity.","zh":"防静电的；用于减少或防止静电积累的。"},"examples":[{"en":"Wear antistatic gloves when handling sensitive electronics.","zh":"处理敏感电子元件时要戴防静电手套。"},{"en":"This antistatic bag protects the computer part during shipping.","zh":"这个防静电袋能在运输过程中保护电脑零件。"},{"en":"Antistatic spray can help keep clothes from clinging.","zh":"防静电喷雾可以帮助衣服避免粘身。"}]}],"synonyms":["static-free","ESD-safe","nonstatic"],"phonetic":"/ˌæn.tiˈstæt.ɪk/","extraExplanation":["“anti-”表示“反、抗”，static指“静电/静止的”。在电子制造与维修中，人体或衣物产生的静电可能损坏芯片（ESD：静电放电），因此常见“antistatic wrist strap（防静电手环）”“antistatic mat（防静电垫）”“antistatic bag（防静电袋）”。","日常生活里也常见于衣物护理（防静电喷雾、柔顺剂等），用来减少干燥环境下的静电吸附与“噼啪”放电。"]}
{"word":"antistatism","summary":{"en":"Antistatism means opposing extensive government control, favoring a limited role for the state.","zh":"Antistatism 指反对政府（国家）过度控制或干预，主张国家角色有限。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to strong government control or influence in society and the economy; the belief that the state (government) should have a limited role.","zh":"反国家主义；反对政府（国家）过度干预社会与经济，主张政府角色应较为有限。"},"examples":[{"en":"Antistatism is common in political movements that argue for lower taxes and fewer regulations.","zh":"在主张减税和减少监管的政治运动中，反国家主义很常见。"},{"en":"Her antistatism makes her skeptical of large public programs run by the federal government.","zh":"她的反国家主义让她对联邦政府运营的大型公共项目持怀疑态度。"}]}],"synonyms":["anti-statism","limited-government ideology","anti-government interventionism"],"phonetic":"/ˌæn.tiˈsteɪ.tɪz.əm/","extraExplanation":["“antistatism”由前缀 anti-（反对）+ statism（国家主义/国家干预主义）构成。它描述的是一种政治观念光谱上的立场，常与“limited government（小政府）”“individual liberty（个人自由）”“free-market ideas（自由市场理念）”等讨论放在一起。","注意区分：antistatism（反对政府权力过强或过度干预）不等于“反政府”或“无政府主义（anarchism）”。很多反国家主义者仍支持政府在国防、司法、基本公共服务等方面的功能，只是反对政府扩张到过多领域。","相关词：statism（国家干预主义），anti-government（反政府，语气更强也更笼统），libertarianism（自由意志主义，常与反国家主义相关但不完全等同）。"]}
{"word":"antistatist","summary":{"en":"Antistatist means opposed to strong government control or intervention; it can also refer to a person with those views.","zh":"antistatist 指反对强政府控制或政府干预的（也可指持此观点的人）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to a powerful government or to government control/intervention (especially in the economy or people’s private lives).","zh":"反对强政府或反对政府干预/控制（尤指经济或个人生活）的。"},"examples":[{"en":"The candidate ran on an antistatist platform, promising fewer regulations.","zh":"这位候选人以反政府干预的平台参选，承诺减少监管。"},{"en":"Some antistatist thinkers argue that markets work best with minimal state involvement.","zh":"一些反政府干预的思想家认为，国家参与越少，市场越能有效运作。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who holds antistatist views.","zh":"反政府干预者；反强政府主义者。"},"examples":[{"en":"He describes himself as an antistatist who prefers local solutions over federal programs.","zh":"他自称是反政府干预者，更偏好地方方案而不是联邦项目。"},{"en":"Antistatists often debate how much public power is necessary for safety and fairness.","zh":"反政府干预者常讨论：为了安全与公平，公共权力需要到什么程度才合适。"}]}],"synonyms":["anti-government","anti-regulation","small-government","libertarian (often related)"],"phonetic":"/ˌæntiˈsteɪtɪst/","extraExplanation":["“anti-”表示“反对”，加上“statist（主张国家权力/国家干预的人或观点）”形成“antistatist”。它常出现在政治、经济与公共政策讨论中，尤其涉及“政府规模”“监管”“税收”“福利”“隐私”等议题。","注意它并不等同于“无政府主义（anarchist）”。antistatist 通常只是主张政府权力应更小或更有限；而无政府主义则可能主张取消国家或政府结构。"]}
{"word":"antisteapsin","summary":{"en":"Antisteapsin is a rare, older scientific term meaning something that inhibits steapsin (pancreatic lipase).","zh":"Antisteapsin 是一个较罕见的旧科学术语，指能抑制 steapsin（胰脂肪酶/脂肪分解酶）的物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance (or antibody) that inhibits steapsin, an older name for pancreatic lipase (a fat-digesting enzyme).","zh":"抗脂肪酶（旧称“steapsin/胰脂肪酶”）物质：一种能抑制 steapsin（胰脂肪酶，分解脂肪的酶）的物质或抗体。"},"examples":[{"en":"In early physiology texts, researchers described an antisteapsin that reduced fat digestion in experimental samples.","zh":"在早期生理学教材中，研究者描述过一种 antisteapsin，可在实验样本中降低脂肪分解。"},{"en":"The term antisteapsin is now rare, and modern writing usually says “lipase inhibitor.”","zh":"“antisteapsin” 这个词现在很少见，现代文献通常写作“lipase inhibitor（脂肪酶抑制剂）”。"}]}],"synonyms":["lipase inhibitor","anti-lipase agent"],"phonetic":"/ˌæntaɪˈstiːpsɪn/","extraExplanation":["这是一个较少见、偏历史性的生理学/医学术语：steapsin 是“胰脂肪酶（pancreatic lipase）”的旧称，负责把脂肪分解成更容易吸收的成分。antisteapsin 字面就是“反 steapsin 的东西”，多出现在早期研究或旧文献中。","现代更常用的表达是 lipase inhibitor（脂肪酶抑制剂）或 anti-lipase agent。"]}
{"word":"antisterility","summary":{"en":"Antisterility refers to preventing or reducing sterility, or something that helps protect fertility; it can also describe an effect that preserves fertility.","zh":"Antisterility 指“抗不育/防止不育”，可指保护生育力的作用或措施，也可作形容词表示“具有抗不育作用的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the prevention or reduction of sterility (inability to produce offspring), or something used to prevent sterility","zh":"抗不育；防止或减少不育（无法生育）的作用或用于防止不育的物质/措施"},"examples":[{"en":"Scientists tested an antisterility drug to help protect fertility after chemotherapy.","zh":"科学家测试了一种抗不育药物，以帮助在化疗后保护生育力。"},{"en":"The paper discusses possible antisterility effects of the treatment in male mice.","zh":"论文讨论了该处理在雄性小鼠中可能产生的抗不育作用。"}]},{"partOfSpeech":"adj.","definition":{"en":"acting to prevent or reduce sterility","zh":"具有抗不育作用的；用于防止或减少不育的"},"examples":[{"en":"The researchers reported antisterility activity in the plant extract.","zh":"研究人员报告称这种植物提取物具有抗不育活性。"},{"en":"They are studying antisterility methods to preserve endangered species.","zh":"他们正在研究抗不育方法，以保护濒危物种的繁殖能力。"}]}],"synonyms":["fertility-preserving","anti-infertility","fertility protection","pro-fertility"],"phonetic":"/ˌæntaɪstəˈrɪləti/","extraExplanation":["“Antisterility”多见于医学、生殖生物学与兽医学等学术语境，日常英语里很少使用。更常见、更通用的表达是“fertility-preserving / fertility protection（保留/保护生育力）”或“anti-infertility（抗不孕不育）”。","构词上：anti-（反、抗）+ sterility（不育）。它可能指药物、营养因子、治疗手段或任何“帮助保持生育能力”的因素。"]}
{"word":"antistes","summary":{"en":"Antistes is a rare, formal word meaning a high-ranking religious leader (such as a high priest or bishop), or more generally an overseer.","zh":"antistes 是一个罕见而正式的词，指高级宗教领袖（如大祭司或主教），也可泛指监督者/主管者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, formal) A high priest, bishop, or other chief religious leader; an overseer.","zh":"（罕见、正式）大祭司、主教或其他宗教最高领袖；（引申）监督者、主管者。"},"examples":[{"en":"In some Latin texts, the word antistes refers to a leading priest who presides over sacred rites.","zh":"在一些拉丁文文献中，antistes 指主持宗教仪式的主要祭司。"},{"en":"The historian described the bishop as the antistes of the local church.","zh":"历史学家把那位主教称为当地教会的 antistes（宗教领袖）。"}]}],"synonyms":["high priest","bishop","prelate","cleric","overseer"],"phonetic":"/ænˈtɪsˌtiːz/","extraExplanation":["antistes 源自拉丁语，字面含义接近“站在前面的人”，常用来指“主持者/在前领导的人”，尤其用于宗教语境（如主持祭礼的祭司、主教等）。","这个词在现代英语里非常少见，多见于拉丁文献的翻译、古典学/教会史写作或具有古典风格的表达；日常英语通常用 priest、bishop、high priest、prelate、clergy leader 等更常见的词。"]}
{"word":"Antisthenes","summary":{"en":"Antisthenes was a Socratic Greek philosopher and an early founder of Cynicism, teaching that virtue and self-control are more important than wealth.","zh":"安提斯泰尼是苏格拉底学派的古希腊哲学家、犬儒学派早期奠基者之一，强调德性与自制胜过财富。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A Greek philosopher (c. 445–365 BCE), a follower of Socrates and an early founder of Cynicism, known for teaching that virtue and self-control matter more than wealth or social status.","zh":"安提斯泰尼（约公元前445—365年），古希腊哲学家，苏格拉底的追随者、犬儒学派的早期奠基者之一，主张德性与自制比财富或社会地位更重要。"},"examples":[{"en":"Antisthenes studied with Socrates and later emphasized a simple, disciplined life.","zh":"安提斯泰尼师从苏格拉底，后来强调简朴而自律的生活。"},{"en":"Some historians see Antisthenes as a key bridge between Socratic ethics and later Cynic ideas.","zh":"一些历史学者认为安提斯泰尼是苏格拉底伦理学与后来的犬儒思想之间的重要纽带。"}]}],"synonyms":["Socratic philosopher","Cynic philosopher"],"phonetic":"/ænˈtɪsθəˌniːz/","extraExplanation":["“犬儒学派”（Cynicism）并非单纯指现代英语里“cynical（愤世嫉俗的）”那种消极讥讽，而更接近一种强调节制、独立与蔑视虚荣的生活哲学。","安提斯泰尼常被认为对第欧根尼（Diogenes）等犬儒派人物有影响；犬儒思想也在一定程度上影响了后来的斯多葛学派（Stoicism）。","名字 Antisthenes 源自希腊语人名；英语学术写作里常直接用该拼写，中文多译作“安提斯泰尼”。"]}
{"word":"antistimulant","summary":{"en":"Antistimulant means something that counteracts stimulation, helping to calm down; it can be a noun (a calming substance) or an adjective (having a calming effect).","zh":"antistimulant 指“抗兴奋的/镇静的”，可作名词（抗兴奋物质/药物）或形容词（具有镇静作用的）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A substance or medicine that reduces stimulation, calming the body or mind (opposite effect of a stimulant).","zh":"一种能减少兴奋、使身心更平静的物质或药物（作用与兴奋剂相反）。"},"examples":[{"en":"After too much coffee, some people look for an antistimulant to help them relax.","zh":"咖啡喝太多后，有些人会找一种“抗兴奋”的东西来帮助放松。"},{"en":"The doctor warned that combining a stimulant with an antistimulant can be risky.","zh":"医生警告说，把兴奋剂和抗兴奋药一起用可能有风险。"}]},{"partOfSpeech":"adj.","definition":{"en":"Counteracting stimulation; tending to calm or reduce nervous energy.","zh":"抗兴奋的；使人镇静或降低紧张/兴奋的。"},"examples":[{"en":"The medication has an antistimulant effect for many patients.","zh":"这种药对很多病人有抗兴奋（镇静）的效果。"},{"en":"They chose an antistimulant routine before bed: dim lights and quiet music.","zh":"他们睡前选择了一套“抗兴奋”的放松流程：调暗灯光、听轻音乐。"}]}],"synonyms":["depressant","sedative","calming agent","tranquilizer"],"phonetic":"/ˌæntiˈstɪmjələnt/","extraExplanation":["这个词在日常英语里比较少见；更常见、更自然的说法是 depressant（抑制剂/镇静类）或 sedative（镇静剂）。","构词：anti-（反、对抗）+ stimulant（兴奋剂/刺激物），字面意思就是“对抗兴奋的东西/作用”。医学语境中更常见用“CNS depressant（中枢神经抑制剂）”来表达类似概念。"]}
{"word":"antistimulation","summary":{"en":"Antistimulation means reducing or blocking stimulation, often to help the body or mind calm down.","zh":"Antistimulation 指“反刺激/减刺激”，即减少或阻断刺激，常用于让身心更平静。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or practice of reducing, avoiding, or blocking stimulation (especially sensory or nervous-system stimulation).","zh":"反刺激；减少、避免或阻断刺激（尤指感官或神经系统刺激）的做法。"},"examples":[{"en":"The clinic recommended antistimulation before bedtime to help with insomnia.","zh":"诊所建议睡前进行“反刺激”（减少刺激），以帮助改善失眠。"},{"en":"In a migraine episode, antistimulation—dim lights and no loud sounds—can reduce discomfort.","zh":"偏头痛发作时，反刺激（调暗灯光、避免噪音）能减轻不适。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing something designed to reduce stimulation or prevent an over-stimulated state.","zh":"（作定语）反刺激的；用于降低刺激或防止过度兴奋的。"},"examples":[{"en":"She set up an antistimulation room with soft lighting and minimal noise.","zh":"她布置了一个反刺激房间：柔和灯光、尽量安静。"},{"en":"Some people benefit from antistimulation routines after a stressful day.","zh":"有些人在压力大的一天后会从反刺激的放松流程中受益。"}]}],"synonyms":["reduced stimulation","sensory reduction","sensory deprivation (stronger)","minimizing stimulation","low-stimulation"],"phonetic":"/ˌæntiˌstɪmjəˈleɪʃən/","extraExplanation":["“antistimulation”不是非常常见的标准词条，更常见的写法是带连字符的“anti-stimulation”，或用更常用的表达如“reduced stimulation / minimizing stimulation（减少刺激）”“sensory reduction（感官减刺激）”。","在健康与心理语境中，它常与“过度刺激（overstimulation）”、偏头痛、焦虑、失眠、感官敏感等话题相关：核心意思是“把环境刺激降下来”，例如降低光线、声音、信息输入与社交互动强度。"]}
{"word":"antistock","summary":{"en":"Antistock means being against holding inventory, or a strategy/policy that aims to keep inventory very low.","zh":"Antistock 指“反库存/低库存”，即反对囤货或主张将库存保持在很低水平的策略或政策。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Business, manufacturing) Opposed to keeping inventory (“stock”); aiming to reduce or avoid holding products or materials in storage.","zh":"（商业/制造业）反对囤货或持有库存；主张减少或避免把产品/材料长期存放在仓库里。"},"examples":[{"en":"The company took an antistock approach and produced items only after customers ordered them.","zh":"这家公司采取反库存策略，只有在客户下单后才开始生产。"},{"en":"Antistock policies can lower storage costs, but they may increase the risk of running out of goods.","zh":"反库存政策可以降低仓储成本，但也可能增加缺货风险。"}]},{"partOfSpeech":"n.","definition":{"en":"A policy, attitude, or strategy that discourages building or holding inventory.","zh":"反对建立/持有库存的政策、态度或策略。"},"examples":[{"en":"Their antistock is basically a just-in-time system.","zh":"他们的反库存策略基本上就是准时制（JIT）系统。"},{"en":"In a crisis, strict antistock can make supply shortages worse.","zh":"在危机时期，过于严格的反库存可能会让供应短缺更严重。"}]}],"synonyms":["anti-stock","low-inventory","no-inventory","lean inventory","just-in-time (JIT)"],"phonetic":"/ˌæntiˈstɑk/","extraExplanation":["“antistock”不是非常常见的标准词，更常见的写法是“anti-stock”（带连字符），或直接说“low-inventory / no-inventory strategy”（低库存/零库存策略）。","它常出现在精益生产（lean manufacturing）和供应链管理语境中，和“just-in-time (JIT)”密切相关：尽量不囤货，用更快的补货与更准确的预测来降低库存。","使用时要注意语境：在零售、制造业中“stock”通常指“库存”；在金融语境里“stock”更常指“股票”，因此“antistock”若不说明可能会引起歧义。"]}
{"word":"antistreptococcal","summary":{"en":"An adjective meaning “against Streptococcus bacteria,” often used in medical contexts.","zh":"形容词，表示“抗（针对）链球菌的”，多用于医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to preventing, fighting, or acting against Streptococcus bacteria (often in reference to medicines, antibodies, or treatments).","zh":"与预防、对抗或针对链球菌（Streptococcus）有关的（常用于药物、抗体或治疗）。"},"examples":[{"en":"The doctor prescribed an antistreptococcal antibiotic for the throat infection.","zh":"医生为喉咙感染开了抗链球菌的抗生素。"},{"en":"Researchers tested antistreptococcal antibodies in the lab.","zh":"研究人员在实验室里检测了抗链球菌抗体。"}]}],"synonyms":["anti-streptococcal","streptococcus-targeting (less common)"],"phonetic":"/ˌæn.tiˌstrɛp.təˈkɑː.kəl/","extraExplanation":["这是一个医学/生物学术语，由 anti-（反、抗）+ streptococcal（链球菌的）构成。常见搭配有 antistreptococcal antibiotic（抗链球菌抗生素）、antistreptococcal serum/antibodies（抗链球菌血清/抗体）。","在日常英语中不常用，更多出现在医疗记录、科研论文或药品说明里。若只是一般表达“抗感染/抗菌”，更常说 antibacterial 或 antibiotics，只有在明确针对链球菌时才用 antistreptococcal。"]}
{"word":"antistreptococcic","summary":{"en":"An adjective meaning “anti-streptococcal,” used for treatments that act against Streptococcus bacteria.","zh":"形容词，意为“抗链球菌的”，常用于描述对抗链球菌的治疗或制剂。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to work against Streptococcus bacteria (used especially of serums, vaccines, or medicines).","zh":"抗链球菌的；用于对抗链球菌感染（多用于描述血清、疫苗或药物）。"},"examples":[{"en":"The doctor mentioned an antistreptococcic serum as part of early treatment.","zh":"医生提到早期治疗的一部分可能包括抗链球菌血清。"},{"en":"In older medical texts, you may see “antistreptococcic” used to describe specific therapies for streptococcal infections.","zh":"在较早的医学文献中，你可能会看到“antistreptococcic”用来描述针对链球菌感染的特定疗法。"}]}],"synonyms":["anti-streptococcal","antistreptococcal"],"phonetic":"/ˌæn.tiˌstrɛp.təˈkɑː.kɪk/","extraExplanation":["这个词主要出现在较旧或较专业的医学语境里。现代临床写作更常见的表达是“anti-streptococcal”（抗链球菌的）或直接说“treatment for streptococcal infection”（治疗链球菌感染）。","构词理解：anti-（反、抗）+ streptococc-（链球菌）+ -ic（形容词后缀）。掌握这种构词法有助于读懂医学英语里的类似词汇。"]}
{"word":"antistreptococcin","summary":{"en":"An old medical term for an antibody/serum used against streptococcal bacteria.","zh":"旧式医学术语：用于对抗链球菌的抗体制剂/免疫血清。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An antibody preparation (or immune serum) used to act against Streptococcus bacteria; an older term for an antistreptococcal antiserum/antitoxin.","zh":"一种用于对抗链球菌（Streptococcus）的抗体制剂或免疫血清；较旧的术语，指抗链球菌血清/抗毒素。"},"examples":[{"en":"Before antibiotics were widely available, doctors sometimes used antistreptococcin to treat severe streptococcal infections.","zh":"在抗生素尚未普及时，医生有时会用 antistreptococcin 来治疗严重的链球菌感染。"},{"en":"The paper described experiments comparing antistreptococcin with other immune sera.","zh":"这篇论文描述了将 antistreptococcin 与其他免疫血清进行比较的实验。"}]}],"synonyms":["antistreptococcal serum","antistreptococcal antiserum","streptococcal antiserum"],"phonetic":"/ˌæn.tiˌstrɛp.təˈkɑk.sɪn/","extraExplanation":["这个词多见于早期医学/细菌学文献。现代英语里更常用的表达是 antistreptococcal serum（抗链球菌血清）或 antiserum（抗血清），临床治疗如今主要依赖抗生素与针对性治疗，因此该词带有明显的历史色彩。","构词提示：anti-（反/抗）+ streptococc-（链球菌）+ -in（名词后缀），整体意思就是“抗链球菌的制剂”。"]}
{"word":"antistreptococcus","summary":{"en":"Antistreptococcus means “against streptococcus,” describing treatments or substances used to fight streptococcal bacteria.","zh":"antistreptococcus 表示“抗链球菌的/抗链球菌制剂”，用于指对抗链球菌的治疗或物质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Acting against streptococci; used to prevent, fight, or neutralize infections caused by streptococcus bacteria.","zh":"（医学）抗链球菌的；用于预防、对抗或中和由链球菌引起的感染。"},"examples":[{"en":"The doctor prescribed an antistreptococcus antibiotic for the throat infection.","zh":"医生为这次咽喉感染开了抗链球菌的抗生素。"},{"en":"Antistreptococcus treatment may be necessary if tests confirm a streptococcal infection.","zh":"如果检测证实为链球菌感染，可能需要进行抗链球菌治疗。"}]},{"partOfSpeech":"n.","definition":{"en":"A substance (such as an antibody, serum, or medicine) that works against streptococcus bacteria.","zh":"（医学）抗链球菌制剂；指可对抗链球菌的物质（如抗体、血清或药物）。"},"examples":[{"en":"Researchers studied an antistreptococcus serum to reduce severe complications.","zh":"研究人员研究一种抗链球菌血清，以减少严重并发症。"}]}],"synonyms":["antistreptococcal","anti-streptococcal","anti-streptococcus"],"phonetic":"/ˌæn.tiˌstrɛp.təˈkɑː.kəs/","extraExplanation":["该词多见于医学/科研语境，日常英语里更常用 antistreptococcal（或 anti-streptococcal）来表达“抗链球菌的”。","构词：anti-（反对/抗）+ streptococcus（链球菌）。有时会写作带连字符的 anti-streptococcus，用于强调“针对链球菌”。"]}
{"word":"antistreptolysin","summary":{"en":"Antistreptolysin is an antibody measured to help indicate a recent streptococcal infection.","zh":"antistreptolysin 指一种抗体，常通过检测其水平来帮助提示近期是否有链球菌感染。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an antibody in the blood that reacts to streptolysin (a toxin made by streptococcal bacteria); its level is often measured to help show a recent streptococcal infection (such as strep throat)","zh":"一种血液中的抗体，会与链球菌溶血素（由链球菌产生的毒素）发生反应；其水平常用于帮助提示近期是否有链球菌感染（如链球菌性咽喉炎）"},"examples":[{"en":"The doctor ordered an antistreptolysin (ASO) test to check for a recent strep infection.","zh":"医生开了抗链球菌溶血素（ASO）检查，用来判断是否近期有链球菌感染。"},{"en":"High antistreptolysin levels can support the idea that symptoms followed a streptococcal infection.","zh":"抗链球菌溶血素水平偏高，可能支持“症状是在链球菌感染之后出现”的推断。"}]}],"synonyms":["ASO (antistreptolysin O)","antistreptolysin O"],"phonetic":"/ˌæn.tiˌstrɛp.təˈlaɪ.sɪn/","extraExplanation":["ASO（antistreptolysin O，抗链球菌溶血素O）是临床更常见的写法；很多时候医生会说“ASO滴度”。它通常用于辅助判断近期A组β溶血性链球菌感染，常见于评估风湿热或链球菌感染后肾小球肾炎等情况，但结果需要结合症状、体检和其他化验一起看。","构词法：anti-（抗、反对）+ streptolysin（链球菌溶血素）。其中 strepto- 与“链状”的细菌形态相关（streptococcus＝链球菌），-lysin 与“溶解/裂解”有关。"]}
{"word":"antistrike","summary":{"en":"“Antistrike” describes something that opposes or aims to prevent labor strikes; it can also refer to an anti-strike measure or policy.","zh":"“antistrike”指反对或防止劳工罢工的（形容词），也可指反罢工措施或政策（名词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposing or intended to prevent labor strikes (work stoppages by employees).","zh":"反对或旨在防止（工会/员工）罢工的；反罢工的。"},"examples":[{"en":"The company adopted an antistrike policy to discourage walkouts.","zh":"公司采取了反罢工政策来阻止员工停工。"},{"en":"Antistrike laws can limit when workers are allowed to strike.","zh":"反罢工法律可能会限制工人何时可以罢工。"}]},{"partOfSpeech":"n.","definition":{"en":"A measure, policy, or action taken to oppose or stop a strike.","zh":"反罢工措施；制止罢工的行动或政策。"},"examples":[{"en":"Management announced several antistrike steps during negotiations.","zh":"管理层在谈判期间宣布了几项反罢工措施。"},{"en":"The union criticized the antistrike as unfair to workers.","zh":"工会批评这些反罢工措施对工人不公平。"}]}],"synonyms":["anti-strike","strikebreaking","anti-union (context-dependent)","no-strike (agreement)"],"phonetic":"/ˌæn.tiˈstraɪk/","extraExplanation":["“antistrike”多见于新闻、政治与劳资关系语境，常用来描述政府或企业为减少罢工而采取的法律、制度或策略。日常英语里更常见的表达是“anti-strike (laws/measures/policy)”。"]}
{"word":"antistriker","summary":{"en":"“Antistriker” means a person or stance that opposes a workers’ strike.","zh":"“antistriker”指反对工人罢工的人或反罢工立场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or group that opposes a strike or the workers who are striking; someone who supports continuing work during a strike.","zh":"反对罢工的人或团体；支持在罢工期间继续工作的人（或势力）。"},"examples":[{"en":"The union criticized the company for hiring antistrikers during the walkout.","zh":"工会批评公司在罢工期间雇用反罢工者来顶替。"},{"en":"Local newspapers portrayed the antistrikers as defending the economy.","zh":"当地报纸把反罢工者描绘成在维护经济。"}]},{"partOfSpeech":"adj.","definition":{"en":"Opposing a strike or opposing the people who are striking.","zh":"反罢工的；反对罢工者的。"},"examples":[{"en":"The mayor took an antistriker position and urged everyone to return to work.","zh":"市长采取反罢工立场，敦促大家复工。"},{"en":"The antistriker message angered many workers.","zh":"这番反罢工言论激怒了许多工人。"}]}],"synonyms":["anti-striker","anti-strike","strikebreaker","scab"],"phonetic":"/ˌæntiˈstraɪkər/","extraExplanation":["“antistriker”更常写作 **anti-striker**（带连字符），也常见表达：**anti-strike**（反对罢工的）或 **strikebreaker/scab**（罢工破坏者/替工者，语气更强、常带贬义）。","在英语语境中与劳资关系密切：当工人发起罢工（strike）争取条件时，反罢工立场通常来自企业管理方、部分政府官员或不支持罢工的社会群体。不同新闻或历史叙述中，该词可能带有明显立场色彩。"]}
{"word":"antistroke","summary":{"en":"Anti-stroke means intended to prevent a stroke, or a medicine/treatment used for stroke prevention.","zh":"Anti-stroke 指用于预防中风的（措施/药物），也可泛指预防中风的药物或治疗。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to help prevent a stroke (for example, by reducing clotting or controlling risk factors).","zh":"用于帮助预防中风（例如通过减少血栓、控制风险因素等）。"},"examples":[{"en":"The doctor prescribed an anti-stroke medicine to lower his risk of another stroke.","zh":"医生开了抗中风药物，以降低他再次中风的风险。"},{"en":"Regular exercise and blood-pressure control are key anti-stroke measures.","zh":"规律运动和控制血压是重要的抗中风措施。"}]},{"partOfSpeech":"n.","definition":{"en":"A medicine or treatment used to help prevent stroke (often used informally).","zh":"（非正式用法）用于预防中风的药物或治疗。"},"examples":[{"en":"She takes an anti-stroke every day as part of her heart-health plan.","zh":"作为心血管健康计划的一部分，她每天都会服用一种预防中风的药物。"}]}],"synonyms":["stroke-preventing","stroke-prevention","preventive (for stroke)"],"phonetic":"/ˌæntiˈstroʊk/","extraExplanation":["“antistroke”更常见的写法是带连字符的“anti-stroke”。在医学或健康语境中，人们也更常说“stroke prevention”（中风预防）、“antiplatelet/anticoagulant therapy”（抗血小板/抗凝治疗）或直接说具体药名。"]}
{"word":"antistrophal","summary":{"en":"Antistrophal means “related to an antistrophe,” the answering counterpart to a strophe in Greek choral poetry or drama.","zh":"antistrophal 指“与反歌/对歌（antistrophe）有关”，即古希腊合唱诗或戏剧中对前歌（strophe）的回应段。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an antistrophe: the responding or counter-movement part of a choral ode in ancient Greek drama (traditionally sung while the chorus moved back in the opposite direction).","zh":"与“对歌/反歌（antistrophe）”有关的：指古希腊戏剧合唱颂歌中回应前段（strophe）的一段，传统上合唱队会向相反方向移动演唱。"},"examples":[{"en":"The poem’s antistrophal section mirrors the rhythm of the opening lines.","zh":"这首诗的反歌段在节奏上呼应了开头的诗行。"},{"en":"In the tragedy, the chorus shifts into an antistrophal pattern, answering the strophe.","zh":"在这部悲剧中，合唱队转入反歌式结构，回应前歌段。"}]}],"synonyms":["antistrophic","responsive","counterposed"],"phonetic":"/ˌæn.tɪˈstroʊ.fəl/","extraExplanation":["“antistrophal”来自“antistrophe（反歌/对歌）”。在古希腊合唱颂歌中常见“strophe（前歌）—antistrophe（反歌）—epode（尾歌）”的结构：前歌与反歌常在节奏与句式上成对出现，反歌像“对称的回应”。","现代英语里这个词比较学术化，多出现在文学研究、古典学、戏剧研究或音乐分析中；日常交流更常用“antistrophe”本身，或说“a response/counterpart section（回应/对应段）”。"]}
{"word":"antistrophe","summary":{"en":"Antistrophe is (1) a rhetorical end-of-line repetition (epistrophe) and (2) a Greek drama term for the chorus’s responding section after the strophe.","zh":"Antistrophe 指（1）句末重复的修辞（也叫 epistrophe），也指（2）古希腊戏剧中合唱颂歌在 strophe 之后的回应段落。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rhetorical device in which the same word or phrase is repeated at the end of successive clauses or sentences (also called epistrophe).","zh":"一种修辞手法：在连续的分句或句子末尾重复相同的词语或短语（也称 epistrophe，尾词重复）。"},"examples":[{"en":"In the speech, the speaker ended several lines with “for the people,” creating an antistrophe.","zh":"在演讲中，演讲者用“for the people”作为好几句话的结尾，形成了尾词重复（antistrophe）。"},{"en":"She wrote: “I believed in hope, I lived for hope, I fought with hope.” That repetition at the end is antistrophe.","zh":"她写道：“我相信希望，我为希望而活，我与希望并肩而战。”这种句末重复就是 antistrophe。"}]},{"partOfSpeech":"n.","definition":{"en":"In ancient Greek drama, the second part of a choral ode, sung or spoken in response to the strophe, often with matching rhythm and structure.","zh":"（古希腊戏剧中）合唱颂歌的第二段：对“strophe（转歌）”的回应部分，常在节奏和结构上与之对应。"},"examples":[{"en":"The chorus moved one way during the strophe and answered during the antistrophe.","zh":"合唱队在 strophe 时朝一个方向移动，在 antistrophe 时作出回应。"},{"en":"When reading Greek tragedy, you may see headings like “Strophe” and “Antistrophe” marking the choral sections.","zh":"阅读古希腊悲剧时，你可能会看到“Strophe”和“Antistrophe”等标题来标示合唱段落。"}]}],"synonyms":["epistrophe","end repetition","choral response"],"phonetic":"/ænˈtɪstrəfi/","extraExplanation":["词源来自希腊语：anti-（对着、回应）+ strophē（转向、转歌）。因此它既可以指“回应的合唱段落”，也可以引申为修辞上的“在句末回应式重复”。","文学与演说中常用 antistrophe 来增强节奏感与情绪力量；例如马丁·路德·金（Martin Luther King Jr.）等演说家的句末重复常被分析为 antistrophe/epistrophe 的经典用法（具体例句需看原文语境）。"]}
{"word":"antistrophic","summary":{"en":"Antistrophic means “related to an antistrophe,” especially a stanza that answers a strophe in Greek choral poetry; more rarely, it can describe a rhetorical echoing/repetitive pattern.","zh":"antistrophic 意为“与反歌（应歌）有关”，尤指古希腊合唱诗中回应正歌的对应段落；较少见时也可指修辞上的回扣式重复。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an antistrophe: the part of a Greek chorus song (or poem) that answers the strophe, often with a matching rhythm or structure.","zh":"与“反歌/应歌”（antistrophe）有关：在古希腊合唱诗中回应“正歌”（strophe）的段落，常与正歌在节奏或结构上相对应。"},"examples":[{"en":"The poem’s antistrophic section mirrors the earlier strophe in meter and tone.","zh":"这首诗的反歌段在格律与语气上呼应了前面的正歌段。"},{"en":"In classical drama, antistrophic lines were sung as the chorus moved back across the stage.","zh":"在古典戏剧中，合唱队回走时会唱出反歌的诗句。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rhetoric, less common) Characterized by a form of repetition or “turning back” in expression, echoing earlier words or structures.","zh":"（修辞学，较少见）带有回环式重复的表达特征：在措辞或结构上回扣、呼应前文。"},"examples":[{"en":"The speech uses an antistrophic pattern, returning to the same key phrase at the end of each paragraph.","zh":"这篇演讲采用回环式的重复结构，每段结尾都回到同一句关键短语。"}]}],"synonyms":["antistrophal","responsive","corresponding","echoing"],"phonetic":"ˌæntɪˈstroʊfɪk","extraExplanation":["“antistrophic”来自希腊语传统的合唱抒情诗结构：strophe（正歌）与antistrophe（反歌）成对出现。舞台表演中常解释为合唱队一边唱正歌一边向一侧移动，再唱反歌时“折返”移动，因此带有“回应、回转”的意象。","现代文学评论里用它来描述诗歌/戏剧中与前段在形式上对称、相互呼应的段落；修辞意义上的用法相对少见。"]}
{"word":"antistrophically","summary":{"en":"“Antistrophically” means “using end-repetition (antistrophe) as a rhetorical style.”","zh":"“antistrophically”指“以结尾重复（交错反复）的修辞方式来表达”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that uses **antistrophe** (a rhetorical pattern where the same word or phrase is repeated at the **end** of successive clauses or sentences).","zh":"以“**交错反复（antistrophe）**”的方式；指在连续的分句或句子**结尾**重复同一词语或短语的修辞手法。"},"examples":[{"en":"The poet writes antistrophically, ending each line with “in the dark.”","zh":"这位诗人用交错反复的方式写作，每一行都以“在黑暗中”结尾。"},{"en":"Her speech was structured antistrophically to make the final words stick in the audience’s mind.","zh":"她的演讲采用结尾重复的结构，让观众更容易记住最后的关键词。"}]}],"synonyms":["with antistrophe","with end repetition","epistrophically"],"phonetic":"/ˌæn.tɪˈstrɑː.fɪ.kli/","extraExplanation":["“antistrophically”来自修辞术语 **antistrophe**，源于希腊语，常用于诗歌、演讲和文学分析中。它与 **anaphorically（首语重复）**相对：anaphora 重复在开头，antistrophe 重复在结尾。因为这个词较学术，日常交流中更常说 “with repetition at the end” 或直接说 “using antistrophe”。"]}
{"word":"antistrophize","summary":{"en":"A rare verb meaning “to use or compose in antistrophe (responsive/repeated) form.”","zh":"一个罕见动词，指“用对歌/应答段（antistrophe）的形式来写作或表达”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(rare) To compose, arrange, or speak in the form of an antistrophe; to use an antistrophic (responsive or repeated) pattern in verse or rhetoric.","zh":"（罕见）以“对歌/应答段（antistrophe）”的形式来创作、编排或表达；在诗歌或修辞中使用“应答/重复对应”的结构。"},"examples":[{"en":"The poet antistrophized the chorus so each stanza answered the one before it.","zh":"诗人把合唱部分写成了应答段结构，让每一节都回应前一节。"},{"en":"In the performance, the singers antistrophized, trading lines back and forth.","zh":"演出中，歌手们用应答方式来回对唱、互相接句。"}]}],"synonyms":["use an antistrophic structure","compose in antistrophes","write responsively","alternate responsively"],"phonetic":"/ænˈtɪstrəˌfaɪz/","extraExplanation":["这个词非常少见，常见的相关词是 antistrophe（n. 对歌/应答段）和 antistrophic（adj. 应答式的）。它多出现在讨论古希腊戏剧合唱（chorus）或诗歌结构的语境里：strophe（正歌）与 antistrophe（反歌/应答段）往往成对出现。","词源上可理解为“antistrophe + -ize（使……化/以……方式表达）”，意思就是“用 antistrophe 的方式来写/说”。日常英语几乎不用，写作中更常用的表达是 “write in antistrophes / use an antistrophic structure”。"]}
{"word":"antistrophon","summary":{"en":"Antistrophon is a rare form, usually meaning antistrophe: repetition at the ends of successive clauses, or the answering choral section in Greek drama.","zh":"Antistrophon 属少见形式，通常指 antistrophe：连续分句末尾的重复修辞，或古希腊戏剧合唱中与正歌相对的反歌段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A misspelling or uncommon variant of antistrophe: a rhetorical or poetic repetition of a word or phrase at the end of successive clauses or sentences; also, in ancient Greek drama, the second part of a choral song that answers the strophe.","zh":"（罕见）常被视为 antistrophe 的误拼或少见变体：指修辞/诗歌中在连续分句或句子末尾重复同一词语或短语的手法；也可指古希腊戏剧合唱歌中与 strophe（正歌）相对的第二段（反歌）。"},"examples":[{"en":"In her speech, the repeated ending “for the people” functions like an antistrophe.","zh":"在她的演讲中，反复以“为了人民”收尾的结构起到 antistrophe（尾语重复）的作用。"},{"en":"The chorus moved into the antistrophe, echoing the rhythm of the earlier strophe.","zh":"合唱队进入了 antistrophe（反歌）段落，呼应了前面 strophe（正歌）的节奏。"}]}],"synonyms":["antistrophe","epistrophe"],"phonetic":"/ænˈtɪstrəfi/","extraExplanation":["“antistrophe”源自希腊语：anti-（对应、相对）+ strophē（转向）。在古希腊合唱抒情诗中，strophe 与 antistrophe 往往在节奏上对应，合唱队会在舞台上向相反方向移动，形成“对唱/对应”的效果。","在英语修辞学里，antistrophe（也常叫 epistrophe）指“句末重复”，与 anaphora（句首重复）相对。莎士比亚和《圣经》英译本等作品中都能看到类似的重复结构，用来增强节奏感和强调。"]}
{"word":"antistrumatic","summary":{"en":"A rare medical adjective meaning ‘preventing or treating goiter/scrofula (struma).’","zh":"一个较少见的医学形容词，表示“用于预防或治疗甲状腺肿/瘰疬等（struma）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Preventing or treating struma (especially a goiter or scrofula); anti-scrofulous.","zh":"用于预防或治疗“struma”（常指甲状腺肿/大脖子病，或旧称的瘰疬/结核性淋巴结肿大）；抗瘰疬的/抗甲状腺肿的。"},"examples":[{"en":"In older medical texts, iodine was described as an antistrumatic remedy for goiter.","zh":"在一些较早的医学文献中，碘被描述为治疗甲状腺肿的 antistrumatic（抗甲状腺肿）疗法。"},{"en":"The paper compared antistrumatic treatments used before modern thyroid medicine.","zh":"这篇论文比较了现代甲状腺医学出现之前使用过的 antistrumatic（抗甲状腺肿）治疗方法。"}]}],"synonyms":["anti-goiter","anti-scrofulous","antiscrofulous"],"phonetic":"/ˌæn.tiˈstruː.mə.tɪk/","extraExplanation":["“antistrumatic”属于较少见、偏历史/医学用语的形容词。词根来自 struma（拉丁语，意为“肿块/腺体肿大”），在旧医学语境里常用来指“甲状腺肿（goiter）”，也可能指“瘰疬/结核性淋巴结肿大（scrofula）”。现代英文更常直接说 anti-goiter / antithyroid-related treatment，或用更具体的医学术语（如 iodine supplementation 等）。"]}
{"word":"antistrumous","summary":{"en":"Antistrumous means “against scrofula,” an old medical term used in historical writing.","zh":"antistrumous 指“抗瘰疬的”，多见于旧式医学文献。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical, old-fashioned) Preventing or counteracting scrofula (a form of tuberculosis affecting the lymph nodes, especially in the neck).","zh":"（医学，旧式用法）抗瘰疬的；用于预防或对抗瘰疬（结核病的一种表现，常累及颈部淋巴结）。"},"examples":[{"en":"In older medical texts, iodine was sometimes described as an antistrumous remedy.","zh":"在一些较早的医学文献中，碘有时被描述为一种抗瘰疬的疗法。"},{"en":"The physician prescribed a tonic once believed to have antistrumous effects.","zh":"医生开了一种补剂，过去人们曾认为它具有抗瘰疬的作用。"}]}],"synonyms":["anti-scrofulous","antitubercular (context-dependent)"],"phonetic":"/ˌæntiˈstruːməs/","extraExplanation":["“antistrumous”由 anti-（反、抗）+ strumous（瘰疬的）构成。strumous 源自 struma（拉丁语，指颈部肿大/甲状腺肿或相关腺体肿大），历史上常与“瘰疬”联系在一起。","该词多见于19世纪至20世纪早期的医学写作，如今更常用的表达会是“anti-scrofulous”或直接描述为“用于治疗结核性淋巴结炎的/抗结核的”。"]}
{"word":"antistudent","summary":{"en":"Antistudent means opposed to students or not supportive of students’ interests; it can describe a policy/decision or refer to something seen as against students.","zh":"Antistudent 指“反学生的、不利于学生利益的”，可用来形容政策/决定，也可指被认为反对学生的一类人或做法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to students’ interests, needs, or rights; not supportive of students.","zh":"反学生的；不支持学生利益、需求或权利的。"},"examples":[{"en":"Many students criticized the policy as antistudent because it raised fees without improving services.","zh":"许多学生批评这项政策“反学生”，因为它在不改善服务的情况下提高了费用。"},{"en":"She argued that cutting library hours was an antistudent decision.","zh":"她认为削减图书馆开放时间是一个反学生的决定。"}]},{"partOfSpeech":"n.","definition":{"en":"a person, policy, or attitude that is against students or student interests.","zh":"反对学生（利益）的人、政策或态度。"},"examples":[{"en":"Students called the new rule an antistudent and demanded changes.","zh":"学生们称新规定是“反学生”的，并要求修改。"}]}],"synonyms":["anti-student","student-unfriendly","against students","unsupportive of students"],"phonetic":"/ˌæn.tiˈstuː.dənt/","extraExplanation":["“antistudent”并不是非常常见的标准词，更常见的写法是带连字符的“anti-student”，意思是“反对学生/不利于学生”。","前缀“anti-”表示“反对、抵制、与……相反”（如: anti-war 反战，anti-smoking 反吸烟）。在正式写作中，通常用“anti-student policy/measure”（反学生的政策/措施）来表达更清楚。"]}
{"word":"antisubmarine","summary":{"en":"“Antisubmarine” means related to finding or fighting submarines, especially in naval/military contexts.","zh":"“antisubmarine”指“反潜的”，与探测或对抗潜艇有关，多用于海军/军事语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"designed to detect, track, or destroy submarines (used for weapons, aircraft, ships, and operations).","zh":"反潜的；用于探测、跟踪或摧毁潜艇的（用于武器、飞机、舰船或行动等）。"},"examples":[{"en":"The navy deployed antisubmarine aircraft to search for the submarine.","zh":"海军部署了反潜巡逻机来搜索那艘潜艇。"},{"en":"They carried antisubmarine weapons such as torpedoes and depth charges.","zh":"他们携带了鱼雷、深水炸弹等反潜武器。"},{"en":"The ship’s antisubmarine systems include sonar and a helicopter.","zh":"这艘舰的反潜系统包括声呐和直升机。"}]},{"partOfSpeech":"n.","definition":{"en":"an antisubmarine weapon, unit, or operation (often used as a modifier, as in “antisubmarine warfare”).","zh":"反潜武器/部队/行动（常作修饰语，如“反潜作战”）。"},"examples":[{"en":"Antisubmarine warfare became a major focus during the Cold War.","zh":"冷战时期，反潜作战成为重要重点。"},{"en":"The commander requested more antisubmarine support for the convoy.","zh":"指挥官请求为护航船队提供更多反潜支援。"}]}],"synonyms":["anti-submarine","submarine-hunting","ASW-related"],"phonetic":"/ˌæntiˈsʌbməˌrin/","extraExplanation":["常见拼写有带连字符的 anti-submarine（更正式/出版物常见）和不带连字符的 antisubmarine（合写也可见）。","该词多出现在军事与海事语境，尤其是“antisubmarine warfare（ASW，反潜作战）”“antisubmarine helicopter（反潜直升机）”“antisubmarine sonar（反潜声呐）”。"]}
{"word":"antisubstance","summary":{"en":"A rare, mostly coined noun meaning either an “opposite/non-material substance” (often in philosophy or sci-fi) or something that counteracts another substance.","zh":"一个罕见、偏造词的名词：可指“与物质相反/非物质的实体”（常见于哲学或科幻），也可泛指“用来对抗或抵消另一种物质的东西”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare / nonstandard) Something imagined or described as the opposite of a physical substance; a non-material or “negative” substance used in philosophical discussion or science fiction.","zh":"（罕见／非标准用法）被想象或描述为与“物质/实体”相反的东西；常见于哲学讨论或科幻语境中，指一种“非物质的/负向的实体”。"},"examples":[{"en":"In the novel, the void is filled with an antisubstance that dissolves metal on contact.","zh":"在小说里，虚空被一种“反物质/反实体”填满，它一接触金属就会把金属溶解。"},{"en":"Some writers use “antisubstance” to talk about what is not material but still seems to have effects.","zh":"有些作者用“antisubstance”来讨论那些并非物质、却似乎仍会产生影响的东西。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A substance or agent that counteracts another substance; an anti-substance (not a fixed scientific term).","zh":"（罕见）用来抵消另一种物质的物质或作用因素；可理解为“反……的物质/对抗物质”（但不是固定的科学术语）。"},"examples":[{"en":"The report loosely called the neutralizing chemical an antisubstance.","zh":"报告里比较随意地把这种中和化学品称作“antisubstance”。"},{"en":"They searched for an antisubstance to block the toxin’s effects.","zh":"他们在寻找一种“对抗物质”来阻断毒素的作用。"}]}],"synonyms":["anti-substance","counteragent","neutralizer","antidote","antimatter (different meaning)"],"phonetic":"/ˌæntiˈsʌbstəns/","extraExplanation":["“antisubstance”并不是常见词，也不是像“antimatter（反物质）”那样的标准科学术语。它更像是由前缀 anti-（反、对抗）+ substance（物质、实体）拼出来的“造词”。","如果你想表达物理学中的“反物质”，更自然的词是 antimatter；如果想表达“对抗某种物质/作用的物质”，更常见说法是 antidote（解毒剂）、neutralizer（中和剂）或 inhibitor（抑制剂），取决于具体场景。"]}
{"word":"antisubversion","summary":{"en":"Antisubversion means opposing or preventing subversion, often in government or national-security contexts.","zh":"antisubversion 指“反颠覆”，即反对或防止颠覆行为，常用于政府与国家安全语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"intended to prevent or fight subversion (secret actions meant to weaken or overthrow a government or system)","zh":"反颠覆的；用来防止或打击“颠覆”活动（暗中削弱或推翻政府/制度的行为）"},"examples":[{"en":"The country passed new anti-subversion laws after the coup attempt.","zh":"政变未遂后，该国通过了新的反颠覆法律。"},{"en":"The agency runs anti-subversion training for public officials.","zh":"该机构为政府官员提供反颠覆培训。"}]},{"partOfSpeech":"n.","definition":{"en":"policies, actions, or laws that aim to stop subversion","zh":"反颠覆措施；反颠覆政策/行动/法律"},"examples":[{"en":"The report reviews the government’s anti-subversion efforts.","zh":"这份报告回顾了政府的反颠覆行动。"},{"en":"Critics argued that anti-subversion can be used to limit political speech.","zh":"批评者认为，反颠覆可能被用来限制政治言论。"}]}],"synonyms":["counter-subversion","anti-sedition","security-related","anti-insurgent"],"phonetic":"/ˌæn.ti səbˈvɝː.ʒən/","extraExplanation":["“anti-”表示“反对/对抗”，subversion 指“颠覆、破坏（既有政治或社会秩序）”。因此 anti-subversion 常出现在政治、国家安全、情报与法律语境中。","在新闻与历史写作里，这个词往往带有立场与争议性：支持者强调维护安全与秩序，反对者担心它被扩大解释、影响公民自由。阅读时可以留意搭配词，如 law/measure/campaign/crackdown（法律/措施/运动/打击）。","更常见的写法是连字符形式：anti-subversion；也常见相关表达：counter-subversion（反颠覆）、anti-sedition（反煽动/反叛乱）。"]}
{"word":"antisubversive","summary":{"en":"“Antisubversive” means opposing or preventing subversion—secret attempts to undermine or overthrow a system.","zh":"“antisubversive”指“反颠覆的”，即反对或防止秘密破坏、削弱或推翻某种制度的行为。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to subversion (secret efforts to weaken or overthrow a government, system, or organization); intended to prevent such activities.","zh":"反颠覆的；反破坏（指反对或防止秘密削弱、推翻政府/制度/组织的活动）。"},"examples":[{"en":"The new antisubversive law increased surveillance of extremist groups.","zh":"新的反颠覆法加强了对极端组织的监控。"},{"en":"Some critics said the antisubversive measures limited free speech.","zh":"一些批评者说这些反颠覆措施限制了言论自由。"},{"en":"The organization adopted antisubversive policies to protect its internal security.","zh":"该组织采取反颠覆政策以保护内部安全。"}]}],"synonyms":["anti-subversive","counter-subversive","anti-insurgency (related)","security-minded (broader)"],"phonetic":"ˌænti səbˈvɝsɪv","extraExplanation":["“antisubversive”常见于政治与法律语境，尤其与20世纪冷战时期的“反颠覆法案/反颠覆运动”相关。当时一些国家以国家安全为由打击被认为会“渗透、颠覆”的团体或思想，因此这个词有时带有争议色彩：支持者强调安全与稳定，反对者则担心侵犯公民自由。"]}
{"word":"antisudoral","summary":{"en":"Antisudoral means “reducing or preventing sweating.”","zh":"antisudoral 意为“止汗的；减少或防止出汗的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"preventing or reducing sweating; used to describe products or medicines that stop perspiration.","zh":"止汗的；减少出汗的（用于描述止汗产品或抑制出汗的药物）。"},"examples":[{"en":"This deodorant is antisudoral, so it helps keep your underarms dry.","zh":"这款除臭剂具有止汗作用，能帮助保持腋下干爽。"},{"en":"The doctor prescribed an antisudoral treatment for excessive sweating.","zh":"医生开了止汗治疗来处理多汗问题。"}]}],"synonyms":["antiperspirant","anhidrotic","anti-sweat"],"phonetic":"/ˌæn.ti.suːˈdɔr.əl/","extraExplanation":["词源小提示：anti- 表示“反、对抗”，sudor 来自拉丁语，意思是“汗”。因此 antisudoral 字面意思就是“对抗出汗的”。","在日常英语里更常见的说法是 antiperspirant（止汗剂/止汗的）或 anti-sweat（不太正式）。医学语境中也可能看到 anhidrotic（抑制出汗的）。"]}
{"word":"antisudorific","summary":{"en":"Antisudorific means ‘reducing or stopping sweating,’ especially in medical or formal contexts.","zh":"antisudorific 表示“止汗的/减少出汗的”，多用于医学或较正式语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"preventing or reducing sweating; used for products or medicines that stop perspiration.","zh":"止汗的；减少出汗的（常用于药物或产品，表示能抑制汗液分泌）。"},"examples":[{"en":"This antisudorific lotion helps reduce sweating in hot weather.","zh":"这种止汗乳液可以在炎热天气里帮助减少出汗。"},{"en":"The doctor prescribed an antisudorific treatment for severe underarm sweating.","zh":"医生开了止汗治疗来处理严重的腋下多汗。"}]}],"synonyms":["antiperspirant","sweat-reducing","anhidrotic"],"phonetic":"/ˌæn.tiˌsuː.dəˈrɪf.ɪk/","extraExplanation":["词源：anti-（反、抑制）+ sudor（拉丁语“汗”）+ -ific（“使……的/产生……的”）。字面意思就是“使不出汗的”。","使用场景：多见于医学或较正式的说明文字；日常英语更常说 antiperspirant（止汗剂）或 “sweat-reducing”。","注意区分：deodorant（除臭剂）主要遮盖/减少体味，不一定减少出汗；antiperspirant/antisudorific 才强调“减少汗”。"]}
{"word":"antisuffrage","summary":{"en":"Antisuffrage means opposition to granting voting rights, especially opposition to women’s suffrage.","zh":"antisuffrage 指反对赋予投票权，尤指反对妇女选举权（女性参政权）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to extending the right to vote (especially the movement opposing women’s suffrage).","zh":"反对扩大选举权（尤指反对女性参政/妇女选举权的运动）。"},"examples":[{"en":"Anti-suffrage groups argued that women should not have the right to vote.","zh":"反选举权团体主张女性不应拥有投票权。"},{"en":"The museum exhibit included posters from the anti-suffrage movement.","zh":"博物馆展览中包括反妇女选举权运动的海报。"}]},{"partOfSpeech":"adj.","definition":{"en":"Against suffrage; opposing the right to vote (often describing people, ideas, or campaigns).","zh":"反对选举权的；反对投票权的（常用来形容人、观点或宣传活动）。"},"examples":[{"en":"An anti-suffrage campaign tried to stop the voting-rights amendment.","zh":"一场反选举权的宣传活动试图阻止有关选举权的修正案。"},{"en":"She studied anti-suffrage arguments in early 20th-century newspapers.","zh":"她研究了20世纪初报纸上的反妇女选举权论点。"}]}],"synonyms":["anti-suffrage","opposition to suffrage","anti–women’s suffrage","anti-suffragist (person)"],"phonetic":"/ˌæn.tiˈsʌf.rɪdʒ/","extraExplanation":["“anti-suffrage”最常见的历史语境是19世纪末到20世纪初英美社会围绕“妇女是否应拥有投票权”的争论。反对者常以“传统家庭角色”“女性不适合政治”“社会秩序会被打乱”等为理由组织宣传、游说与集会。","拼写上更常见的是带连字符的 anti-suffrage；不带连字符的 antisuffrage 也能见到，但相对少。相关人物/团体在史料中也常被称为 anti-suffragists（反参政权人士）。"]}
{"word":"antisuffragist","summary":{"en":"An antisuffragist is a person who opposed women’s right to vote, especially during the historical women’s suffrage movement.","zh":"antisuffragist 指反对妇女投票权的人，常见于妇女参政权运动的历史语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposed women’s suffrage (the right for women to vote), especially in the late 19th and early 20th centuries","zh":"反对妇女参政权（妇女投票权）的人，尤指19世纪末至20世纪初的反妇女选举权运动参与者"},"examples":[{"en":"Some antisuffragists argued that politics would harm women’s traditional roles.","zh":"一些反妇女参政权者认为，政治会伤害女性的传统角色。"},{"en":"The newspaper quoted an antisuffragist who claimed women did not need the vote.","zh":"报纸引用了一位反妇女参政权者的话，声称女性不需要投票权。"}]}],"synonyms":["opponent of women's suffrage","anti-suffrage campaigner"],"phonetic":"/ˌæn.tiˈsʌf.rə.dʒɪst/","extraExplanation":["构词很好理解：anti-（反对）+ suffrage（选举权/投票权）+ -ist（……主义者/支持者/从事者）。因此 antisuffragist 指“反对（妇女）投票权的人”。","该词常出现在美国与英国的历史语境中，尤其与 1920 年美国宪法第十九修正案（赋予妇女投票权）前后的社会争论有关。阅读历史材料时，也常看到反对者组织、演讲、社论等内容使用此词。"]}
{"word":"antisuicide","summary":{"en":"Antisuicide means “intended to prevent suicide.”","zh":"antisuicide 指“旨在预防自杀的；与自杀预防相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"intended to prevent suicide; related to suicide prevention (often used to describe programs, policies, or medications).","zh":"旨在预防自杀的；与自杀预防相关的（常用于描述项目、政策或药物）。"},"examples":[{"en":"The hospital launched an antisuicide screening program in the emergency department.","zh":"医院在急诊科启动了一个预防自杀的筛查项目。"},{"en":"Some researchers are studying antisuicide effects of certain treatments.","zh":"一些研究人员正在研究某些治疗手段的抗自杀（预防自杀）作用。"}]}],"synonyms":["suicide-prevention","anti-suicide","suicide-preventive","anti-self-harm"],"phonetic":"/ˌæntiˈsuːəˌsaɪd/","extraExplanation":["“antisuicide”在实际英语中相对少见，更常见的写法是加连字符的“anti-suicide”，或更自然的表达“suicide-prevention”（如 suicide-prevention hotline / suicide-prevention program）。","在医学与公共卫生语境里，“antisuicide”有时用来概括某种治疗或干预对“降低自杀风险”的作用，但正式写作中常会改成更明确的说法（例如 “reduces suicide risk” / “prevents suicide attempts”）。"]}
{"word":"antisun","summary":{"en":"Antisun most commonly means the point opposite the Sun in the sky (a technical term in atmospheric optics). Rarely, it can describe something that protects against sunlight.","zh":"Antisun最常指大气光学中的“反日点”（与太阳方向相反的天空点）。很少情况下也可表示“防晒/遮阳的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Atmospheric optics) The point in the sky directly opposite the Sun from the observer; a reference point where some optical effects may appear.","zh":"（大气光学）“反日点”：从观察者位置看，与太阳在天空中方向正相反的点；一些光学现象可能会出现在这一方向附近。"},"examples":[{"en":"A faint glow appeared near the antisun just above the horizon.","zh":"地平线上方、接近反日点的位置出现了一道微弱的光辉。"},{"en":"Rainbow features are often described relative to the Sun and the antisun.","zh":"彩虹的特征常常会用太阳与反日点的位置来描述。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) Describing something designed to block or reduce the Sun’s effect (similar in meaning to “sun-protective”).","zh":"（少见）指用于阻挡或减弱阳光影响的（类似“防晒的/遮阳的”）。"},"examples":[{"en":"She wore an anti-sun hat to keep her face shaded.","zh":"她戴了一顶防晒帽，让脸部保持在阴影里。"},{"en":"Anti-sun clothing is often labeled as UV-protective.","zh":"防晒衣物通常会标注为具有防紫外线功能。"}]}],"synonyms":["antisolar point","antisolar direction","sun-protective (rare sense)","UV-protective (related)"],"phonetic":"/ˌæn.tiˈsʌn/","extraExplanation":["“antisun”在日常英语里非常少见；谈“防晒”更常用：sunscreen（防晒霜）、sunblock（防晒剂/防晒霜，较口语）、sun-protective / UV-protective（防晒的/防紫外线的）。","在大气光学中，“antisun（反日点）”是一个技术性用词，与彩虹、辉光等现象的几何关系有关：很多与彩虹相关的弧和光点，都以“太阳—观察者—反日点”的方向关系来描述。"]}
{"word":"antisupernatural","summary":{"en":"“Antisupernatural” means opposed to the supernatural or rejecting supernatural explanations.","zh":"antisupernatural 指“反超自然的；不接受超自然解释的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to belief in, explanations involving, or portrayals of the supernatural (such as magic, ghosts, miracles, or divine intervention).","zh":"反对超自然信仰或超自然解释的；不赞成（或不采用）鬼神、魔法、奇迹、神力介入等超自然观念的。"},"examples":[{"en":"The author takes an antisupernatural approach, explaining every “mystery” through psychology and coincidence.","zh":"这位作者采取反超自然的立场，把每个“谜团”都用心理学和巧合来解释。"},{"en":"Her antisupernatural views make her skeptical of fortune-telling and ghost stories.","zh":"她反超自然的观点让她对算命和鬼故事都很怀疑。"}]}],"synonyms":["skeptical","rationalist","naturalistic","non-supernatural","materialist"],"phonetic":"/ˌæn.tiˌsuː.pɚˈnætʃ.ɚ.əl/","extraExplanation":["“antisupernatural”由前缀 anti-（反对）+ supernatural（超自然的）构成，属于较少见、偏学术或评论语境的用词。日常英语里更常见的表达是 “skeptical of the supernatural（对超自然持怀疑态度）”“anti-supernatural（加连字符）”，或根据语境用 “naturalistic / rationalist（自然主义/理性主义）”。","在文学评论或影视评论中，它常用来描述作品的风格：故事看似灵异，但最终给出非超自然的解释（例如误会、骗局、心理暗示）。"]}
{"word":"antisupernaturalism","summary":{"en":"Antisupernaturalism means rejecting supernatural explanations or beliefs.","zh":"antisupernaturalism 指拒绝或反对超自然解释与信念。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to supernaturalism; the view that supernatural beings, miracles, or divine intervention should not be accepted as real or as valid explanations.","zh":"反超自然主义；反对把神灵、奇迹或神圣干预当作真实存在或合理解释的观点。"},"examples":[{"en":"Her writing reflects antisupernaturalism, explaining unusual events through psychology rather than spirits.","zh":"她的作品体现了反超自然主义：用心理学而不是鬼魂来解释离奇事件。"},{"en":"In the debate, antisupernaturalism was linked to scientific skepticism and secular thinking.","zh":"在辩论中，反超自然主义与科学怀疑论和世俗思想联系在一起。"}]}],"synonyms":["anti-supernaturalism","skepticism","naturalism","rationalism","secularism"],"phonetic":"/ˌæn.tiˌsuː.pɚˈnætʃ.ɚ.əˌlɪz.əm/","extraExplanation":["这个词很少见，通常出现在哲学、宗教研究或批判性写作中。构词上由 anti-（反对）+ supernaturalism（超自然主义）组成，强调“反对以超自然作为解释框架”。","在文学和文化讨论里，它常与 rationalism（理性主义）、skepticism（怀疑论）、naturalism（自然主义）一起出现；注意它不一定等同于 atheism（无神论），有些人可能有宗教信仰，但仍反对“奇迹/超自然干预”作为解释。"]}
{"word":"antisupernaturalist","summary":{"en":"“Antisupernaturalist” means someone (or something) that opposes belief in supernatural forces or explanations.","zh":"“antisupernaturalist”指反对超自然信仰或超自然解释的人，或指持这种立场的（反超自然主义的）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is against belief in supernatural forces or explanations (such as miracles, magic, or spirits).","zh":"反对超自然信仰或解释（如神迹、魔法、灵魂等）的人。"},"examples":[{"en":"As an antisupernaturalist, she argues that unusual events should be explained by science first.","zh":"作为一名反超自然主义者，她认为不寻常的事件应先用科学来解释。"},{"en":"The debate included believers, skeptics, and an outspoken antisupernaturalist.","zh":"这场辩论包括信徒、怀疑论者，以及一位直言不讳的反超自然主义者。"}]},{"partOfSpeech":"adj.","definition":{"en":"opposing supernaturalism; rejecting supernatural explanations or claims.","zh":"反对超自然主义的；否定超自然解释或主张的。"},"examples":[{"en":"He takes an antisupernaturalist approach to religion, focusing on ethics rather than miracles.","zh":"他对宗教采取反超自然主义的立场，更关注伦理而非神迹。"},{"en":"The essay offers an antisupernaturalist reading of the legend.","zh":"这篇文章以反超自然主义的角度解读该传说。"}]}],"synonyms":["anti-supernatural","skeptic","rationalist","naturalist","materialist"],"phonetic":"/ˌæn.tiˌsuː.pɚˈnætʃ.ɚ.ə.lɪst/","extraExplanation":["这个词在日常英语里非常少见，更多出现在哲学、宗教学或思想史讨论中。写作时更常用的表达包括：anti-supernatural（反超自然的）、skeptical of the supernatural（对超自然持怀疑态度）、naturalistic（自然主义的）。","构词上：anti-（反对）+ supernatural（超自然的）+ -ist（…主义者/…派的人）。有时也会写成带连字符的 anti-supernaturalist。"]}
{"word":"antisupernaturalistic","summary":{"en":"Antisupernaturalistic means opposed to supernatural explanations or styles.","zh":"antisupernaturalistic 表示反对超自然解释或超自然风格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to beliefs, explanations, or artistic styles that rely on the supernatural (such as gods, miracles, ghosts, or magic).","zh":"反超自然主义的；反对以神、奇迹、鬼魂或魔法等“超自然”来解释世界或进行创作的。"},"examples":[{"en":"His essays take an antisupernaturalistic view of religion, focusing on social history instead of miracles.","zh":"他的文章采取反超自然主义的宗教观，更关注社会历史而不是奇迹。"},{"en":"The film is antisupernaturalistic: every strange event gets a realistic explanation.","zh":"这部电影是反超自然主义的：每个离奇事件最终都有现实的解释。"}]}],"synonyms":["anti-supernatural","non-supernatural","naturalistic","skeptical","rationalistic"],"phonetic":"/ˌæn.tiˌsuː.pɚˌnæ.tʃɚ.əˈlɪs.tɪk/","extraExplanation":["这个词比较少见，属于可拆解的构词：anti-（反对）+ supernatural（超自然的）+ -istic（……倾向/风格的）。常见替代说法有 anti-supernatural、non-supernatural、skeptical of the supernatural、naturalistic（强调自然/现实解释）。","在写作中它常用来描述“立场/方法/风格”（例如 an antisupernaturalistic approach/view/reading），表示拒绝把现象归因于超自然力量。"]}
{"word":"antisurface","summary":{"en":"Antisurface means intended to act against surface targets, especially ships (e.g., antisurface warfare, antisurface missiles).","zh":"Antisurface 指“针对水面目标（尤指舰船）的”，常见于反舰/反水面作战与武器装备语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Military) Designed to detect, target, or destroy things on the surface (especially ships), not submarines or aircraft.","zh":"（军事）用于侦测、瞄准或摧毁水面目标（尤指舰船）的；非反潜或防空。"},"examples":[{"en":"The frigate was upgraded for antisurface warfare in coastal waters.","zh":"这艘护卫舰为近海的反舰/反水面作战进行了升级。"},{"en":"Antisurface missiles are used to attack enemy ships.","zh":"反舰导弹用于攻击敌方舰船。"},{"en":"The helicopter carried sensors for antisurface search and tracking.","zh":"这架直升机携带了用于反水面搜索与跟踪的传感器。"}]}],"synonyms":["anti-ship","surface-targeting","surface-attack"],"phonetic":"/ˌæntiˈsɝfɪs/","extraExplanation":["“antisurface”最常见于军事复合词里，尤其是 **antisurface warfare (ASuW)**（反舰/反水面作战）与 **antisurface missile**（反舰导弹）。写作时常加连字符 **anti-surface**，也可写作一个词 **antisurface**。","语义上它与 **anti-ship**（反舰）高度接近；区别是“surface”强调“水面/地面上的目标”这一类别，而“ship”更明确指舰船。实际用法中两者常互换。"]}
{"word":"antisurplician","summary":{"en":"Antisurplician means “against wearing a surplice” in church services, especially in Anglican contexts.","zh":"Antisurplician 指“反对在礼拜中穿白袍（surplice）”，尤多见于英国国教语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to the wearing of a surplice (a white liturgical robe) in Christian worship, especially in the Church of England.","zh":"反对在基督教礼拜中穿着白袍（surplice，一种白色礼仪袍），尤指英国国教传统中的做法。"},"examples":[{"en":"In the 19th century, some antisurplician clergy refused to wear a surplice during services.","zh":"在19世纪，一些反对白袍的神职人员在礼拜中拒绝穿着白袍。"},{"en":"The parish debate turned tense when an antisurplician group protested changes to vestments.","zh":"当一个反对白袍的团体抗议更改礼仪服饰时，教区的争论变得紧张。"}]}],"synonyms":["anti-vestment (contextual)","opposed to vestments (contextual)"],"phonetic":"/ˌæn.ti.sɝˈplɪʃ.ən/","extraExplanation":["“surplice”是西方教会常见的一种白色外袍；“anti-”表示“反对”。因此 antisurplician 字面意思就是“反对白袍的”。","该词多见于英国宗教与教会史语境，常与19世纪英国国教内部关于礼仪、服饰与“高教会/低教会”风格的争论相关。"]}
{"word":"antisymmetric","summary":{"en":"Antisymmetric means “not symmetric,” and in math it specifically means a relation (or matrix) with a special one-way symmetry rule.","zh":"antisymmetric 意为“非对称的”；在数学中专指“反对称”的关系或矩阵，满足特定的对称规则。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not symmetric; not the same on both sides or in both directions (often used in science and design).","zh":"不对称的；两侧或两个方向不相同的（常用于科学与设计语境）。"},"examples":[{"en":"The shell has an antisymmetric shape, with one side slightly larger than the other.","zh":"这个贝壳的形状不对称，一侧比另一侧稍大。"},{"en":"The artist chose an antisymmetric pattern to make the image feel more dynamic.","zh":"艺术家选择了不对称图案，让画面更有动感。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Math) Describes a relationship where if A is related to B and B is related to A, then A and B must be the same element.","zh":"（数学）反对称的：若A与B互相关联（A关系到B且B关系到A），则必须有A=B。"},"examples":[{"en":"“Less than or equal to” (≤) is antisymmetric: if a ≤ b and b ≤ a, then a = b.","zh":"“小于等于”(≤) 是反对称的：如果 a ≤ b 且 b ≤ a，那么 a = b。"},{"en":"In a partially ordered set, the order relation is antisymmetric.","zh":"在偏序集中，序关系是反对称的。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Linear algebra) Describes a matrix whose transpose equals its negative (Aᵀ = −A); also called “skew-symmetric.”","zh":"（线性代数）反对称（斜对称）矩阵：转置等于其相反数（Aᵀ = −A）。"},"examples":[{"en":"If A is antisymmetric, then all diagonal entries of A are zero.","zh":"如果矩阵 A 是反对称的，那么 A 的对角线元素全为 0。"},{"en":"The cross product in 3D can be represented using an antisymmetric matrix.","zh":"三维中的叉乘可以用反对称矩阵来表示。"}]}],"synonyms":["asymmetric","non-symmetric","skew-symmetric (matrix)"],"phonetic":"/ˌænti sɪˈmɛtrɪk/","extraExplanation":["在日常英语里更常用的是 asymmetric（不对称的）。antisymmetric 更偏学术/数学语境。","数学里 antisymmetric（反对称）和 asymmetric（不对称）不是一回事：asymmetric 通常表示“aRb 则不可能 bRa”；而 antisymmetric 允许 bRa，但要求因此推出 a=b。","线性代数中 antisymmetric matrix 常与 skew-symmetric 互为同义；很多教材更常用 skew-symmetric。"]}
{"word":"antisymmetrical","summary":{"en":"Antisymmetrical describes something where swapping parts reverses the sign or direction (common in math/physics).","zh":"Antisymmetrical（反对称的）指交换对应部分会使符号或方向相反（常见于数学/物理）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a relation, matrix, or figure) having a kind of “opposite symmetry”: swapping two elements (or reflecting across a line/diagonal) reverses the sign or direction.","zh":"（多用于数学/物理）指一种“反对称”：交换两个元素（或沿某条线/对角线反射）会使符号或方向相反。"},"examples":[{"en":"In an antisymmetrical matrix, the entry aᵢⱼ equals −aⱼᵢ.","zh":"在反对称矩阵中，元素 aᵢⱼ 等于 −aⱼᵢ。"},{"en":"The force pair is antisymmetrical: what one object gains, the other loses in the opposite direction.","zh":"这对力是反对称的：一个物体在某方向上得到多少，另一个就在相反方向上失去多少。"}]}],"synonyms":["antisymmetric","skew-symmetric"],"phonetic":"/ˌæn.ti.saɪˈmɛt.rɪ.kəl/","extraExplanation":["在英语里更常见的数学术语是 **antisymmetric**（反对称的）。**antisymmetrical** 也会出现，含义通常相同，但在教材与论文中频率略低。","常见对比：**symmetric**（对称）：aᵢⱼ = aⱼᵢ；**antisymmetric**（反对称）：aᵢⱼ = −aⱼᵢ，且对角线元素通常为 0。"]}
{"word":"antisymmetry","summary":{"en":"Antisymmetry is a math/physics concept: in relations it means mutual relating implies equality; in matrices/tensors it often means swapping inputs makes the sign flip.","zh":"反对称性是数学/物理概念：在“关系”中表示互相关系会推出相等；在矩阵/张量等结构中常指交换输入会变号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Math) the property of a relation where if A is related to B and B is related to A, then A and B must be the same object (A = B).","zh":"（数学）反对称性：一种关系的性质，若 A 与 B 有关系且 B 与 A 也有关系，则 A 与 B 必须是同一个对象（A = B）。"},"examples":[{"en":"In a partial order like “≤”, antisymmetry means if a ≤ b and b ≤ a, then a = b.","zh":"在“≤”这样的偏序关系中，反对称性表示：如果 a ≤ b 且 b ≤ a，那么 a = b。"},{"en":"“Is a subset of” (⊆) is antisymmetric: if A ⊆ B and B ⊆ A, then A = B.","zh":"“是……的子集”（⊆）具有反对称性：若 A ⊆ B 且 B ⊆ A，则 A = B。"}]},{"partOfSpeech":"n.","definition":{"en":"(Math/Physics) the property of an object (such as a matrix, function, or tensor) that changes sign when two inputs/indices are swapped.","zh":"（数学/物理）反对称性：某些对象（如矩阵、函数或张量）在交换两个输入/指标时会变号的性质。"},"examples":[{"en":"An antisymmetric matrix satisfies Aᵀ = −A.","zh":"反对称矩阵满足 Aᵀ = −A。"},{"en":"For an antisymmetric tensor, swapping two indices flips the sign.","zh":"对于反对称张量，交换两个指标会使符号变为相反数。"}]}],"synonyms":["anti-symmetry (variant spelling)","skew-symmetry (common for matrices/tensors)"],"phonetic":"/ˌæntiˈsɪmətri/","extraExplanation":["“antisymmetry”在数学里常见于“关系”的语境（如偏序）：它和“对称性（symmetry）”不同——对称性是“互相关系”仍成立，而反对称性是“一旦互相关系都成立，就只能是同一个东西”。","在物理与线性代数中，antisymmetry更常指“交换会变号”的结构（如反对称矩阵、反对称张量）。注意这与“asymmetry（不对称）”不同：asymmetry只是“不是对称”，并不必然有“变号”或“推出相等”的规则。"]}
{"word":"antisyndicalism","summary":{"en":"Antisyndicalism is opposition to syndicalism and to the idea that unions should use collective action to control industry.","zh":"Antisyndicalism 指反工团主义，即反对工团主义及其主张工会通过集体行动掌控工业的理念。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to syndicalism (a political and labor movement that argues workers’ unions should use collective action—sometimes including strikes—to gain control of industry and society).","zh":"反工团主义；反对“工团主义”的立场或思想（工团主义是一种政治与劳工运动，主张工会通过集体行动——有时包括罢工——争取对工业乃至社会的控制）。"},"examples":[{"en":"The minister’s speech signaled a new wave of antisyndicalism in government policy.","zh":"部长的讲话表明政府政策中出现了新一波反工团主义倾向。"},{"en":"In the early 1900s, antisyndicalism often shaped laws aimed at limiting strike actions.","zh":"在20世纪初，反工团主义常常影响一些旨在限制罢工行动的法律。"},{"en":"The article compares syndicalism with antisyndicalism to explain the era’s labor conflicts.","zh":"这篇文章通过对比工团主义与反工团主义来解释那个时代的劳资冲突。"}]}],"synonyms":["anti-unionism","opposition to syndicalism","anti-labor militancy"],"phonetic":"/ˌæn.tiˈsɪn.dɪ.kəˌlɪ.zəm/","extraExplanation":["“Syndicalism（工团主义）”一词源自法语 syndicat（工会）。因此 antisyndicalism 多见于讨论19世纪末到20世纪初的欧洲劳工史、工会运动与政治冲突的语境。","在英美语境里，这个词通常带有历史或学术色彩，常见于对“反激进工会/反罢工”的立法、舆论与政治运动的描述。"]}
{"word":"antisyndicalist","summary":{"en":"Antisyndicalist means opposing syndicalism, or a person who opposes it.","zh":"antisyndicalist 指“反工团主义的”，也可指“反工团主义者”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to syndicalism (a labor movement that seeks to give workers and unions control of industry, often through direct action such as strikes).","zh":"反工团主义的；反对工团主义（主张由工人和工会控制产业、常通过罢工等直接行动实现的劳工运动）。"},"examples":[{"en":"The newspaper took an antisyndicalist stance during the strike.","zh":"这家报纸在罢工期间采取了反工团主义立场。"},{"en":"Antisyndicalist laws were used to limit certain union activities.","zh":"一些反工团主义法律被用来限制某些工会活动。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who opposes syndicalism or syndicalist organizations.","zh":"反工团主义者；反对工团主义或工团主义组织的人。"},"examples":[{"en":"He was known as an antisyndicalist in local politics.","zh":"在地方政治中，他以反工团主义者而闻名。"},{"en":"Antisyndicalists argued that unions should not run industries.","zh":"反工团主义者认为工会不应当经营产业。"}]}],"synonyms":["anti-union (context-dependent)","anti-labor (context-dependent)","anti-syndicalism (related)"],"phonetic":"/ˌæntiˈsɪndɪkəlɪst/","extraExplanation":["“工团主义”(syndicalism)在19—20世纪初的欧洲与美洲劳工运动中较常见，强调以工会为核心，通过罢工、抵制等“直接行动”争取经济与政治权力；因此“反工团主义”常出现在关于劳工法、罢工、政治意识形态（如社会主义、无政府主义、保守主义）冲突的历史语境中。","英语中 anti- 表“反对”，syndicalist 来自 syndicate（工会/同业公会/联合组织）相关词根；在一些国家历史上也出现过“反工团主义法”(anti-syndicalist laws)，用于打压或限制激进劳工组织。"]}
{"word":"antisyndication","summary":{"en":"Antisyndication means opposing or restricting the syndication (resale/distribution) of media content to multiple outlets.","zh":"Antisyndication 指反对或限制媒体内容（尤其电视节目）进行辛迪加发行/转售给多个渠道。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"opposition to or policies intended to prevent syndication (the selling or distributing of media content—especially TV programs—to multiple outlets or stations).","zh":"反对“辛迪加发行/联合发行”（将媒体内容，尤其是电视节目，卖给或分发给多个渠道/电视台）的立场或政策。"},"examples":[{"en":"The network’s antisyndication policy limited how its shows could be sold to local stations.","zh":"该电视网的反辛迪加政策限制了其节目向地方电视台出售的方式。"},{"en":"Some producers argued that antisyndication rules reduced competition and hurt creative risk-taking.","zh":"一些制片人认为反辛迪加规则减少了竞争，打击了创作上的冒险精神。"}]}],"synonyms":["anti-syndication policy","anti-syndication rules","restriction on syndication","anti-syndication regulation"],"phonetic":"/ˌæn.tiˌsɪn.dɪˈkeɪ.ʃən/","extraExplanation":["“antisyndication”不是特别常见的日常词，更常见的说法是“anti-syndication rules / policy（反辛迪加规则/政策）”。在美国电视史上，它常与20世纪70年代的“Fin-Syn rules（financial interest and syndication rules，利益与辛迪加规则）”相关：当时监管机构限制大型电视网同时制作并掌控节目在辛迪加市场的转售权，以避免垄断与利益冲突。后来这些规则在90年代逐步放松/取消，所以现代语境里多用于讨论当年的监管或类似的反垄断政策。"]}
{"word":"antisynod","summary":{"en":"Antisynod means opposed to a church synod, or a person/group opposing one.","zh":"antisynod 指反对教会宗教会议的（立场/态度），也可指反对该会议的人或团体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to a synod (a church council or meeting), or resisting the authority/decisions of such a council.","zh":"反对宗教会议（教会会议/主教会议）的；抵制该类会议权威或决议的。"},"examples":[{"en":"Some local leaders took an antisynod position and refused to attend the synod.","zh":"一些地方领袖采取反宗教会议的立场，拒绝出席会议。"},{"en":"The pamphlet was openly antisynod, arguing that councils should not control local churches.","zh":"这本小册子公开反对宗教会议，主张教会会议不应控制地方教会。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or group that opposes a synod.","zh":"反对宗教会议的人；反对宗教会议的团体。"},"examples":[{"en":"The antisynods organized protests outside the meeting hall.","zh":"反宗教会议者在会场外组织了抗议。"}]}],"synonyms":["anti-synodal","anti-council","anti-conciliar"],"phonetic":"/ˌæn.tiˈsɪn.əd/","extraExplanation":["“synod”常见于基督教语境，指主教或教会代表召开的正式会议，用来讨论教义、纪律或行政事务；“antisynod”属于较罕见/专门用语，多见于历史争论、宗派冲突或宗教政治讨论中。","构词法：anti-（反对）+ synod（宗教会议）。阅读中若遇到，也可能写作 anti-synod。"]}
{"word":"antisyphilis","summary":{"en":"Antisyphilis means “against syphilis,” describing prevention/treatment or referring to an anti-syphilis therapy.","zh":"antisyphilis 表示“抗梅毒的/用于治疗梅毒的”，可作形容词或指抗梅毒治疗（名词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the prevention or treatment of syphilis (a sexually transmitted infection).","zh":"与梅毒（性传播感染）的预防或治疗有关的；抗梅毒的。"},"examples":[{"en":"The clinic promoted antisyphilis education and testing.","zh":"这家诊所推广抗梅毒的健康教育与检测。"},{"en":"Before antibiotics, doctors looked for antisyphilis medicines that were safer and more effective.","zh":"在抗生素出现之前，医生一直在寻找更安全、更有效的抗梅毒药物。"}]},{"partOfSpeech":"n.","definition":{"en":"An antisyphilis drug or therapy; a treatment used against syphilis.","zh":"抗梅毒药物或疗法；用于治疗梅毒的治疗手段。"},"examples":[{"en":"Penicillin became the standard antisyphilis treatment in the mid-20th century.","zh":"20世纪中期，青霉素成为标准的抗梅毒治疗。"},{"en":"The museum display described early antisyphilis remedies.","zh":"博物馆展览介绍了早期的抗梅毒疗法。"}]}],"synonyms":["antisyphilitic","anti-syphilis","anti-syphilitic"],"phonetic":"/ˌæn.tiˈsɪf.ə.lɪs/","extraExplanation":["“antisyphilis”较少见，更常见的形式是“antisyphilitic”（抗梅毒的）或“antisiphylitic”（较旧/少见拼写）。在医学史语境中，它可能用来指“抗梅毒治疗/药物”。","在抗生素普及前，历史上曾使用过一些有毒副作用较大的疗法（如含汞制剂、砷剂等）；后来青霉素成为治疗梅毒的经典方案。因此该词常出现在医学史或旧文献中。"]}
{"word":"antisyphilitic","summary":{"en":"Antisyphilitic means “against syphilis,” describing a treatment or referring to a medicine used to treat syphilis.","zh":"antisyphilitic 意为“抗梅毒的”，可作形容词指用于治疗梅毒，也可作名词指抗梅毒药物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medicine) Preventing, curing, or used to treat syphilis.","zh":"（医）抗梅毒的；用于预防、治疗或抑制梅毒的。"},"examples":[{"en":"Penicillin is an effective antisyphilitic treatment.","zh":"青霉素是一种有效的抗梅毒治疗方法。"},{"en":"The doctor prescribed an antisyphilitic drug after the diagnosis.","zh":"确诊后，医生开了抗梅毒药物。"}]},{"partOfSpeech":"n.","definition":{"en":"A medicine or agent used to treat syphilis.","zh":"抗梅毒药；治疗梅毒的药物或制剂。"},"examples":[{"en":"Before antibiotics, some antisyphilitics were toxic and risky.","zh":"在抗生素出现之前，一些抗梅毒药物毒性较大、风险更高。"},{"en":"The clinic stocked several antisyphilitics for different stages of infection.","zh":"诊所备有多种抗梅毒药物，用于不同感染阶段。"}]}],"synonyms":["antisiphylitic (less common spelling)","anti-syphilitic","antisyphilis (rare)"],"phonetic":"/ˌæntiˌsɪfəˈlɪtɪk/","extraExplanation":["这个词由 anti-（“反、抗”）+ syphilitic（“梅毒的”）构成，常见于医学或历史文本，日常英语中较少使用。","历史上“抗梅毒”治疗曾包含汞剂、砷剂等（疗效有限且副作用大）；20世纪后青霉素成为经典且更安全有效的治疗。"]}
{"word":"antisyphillis","summary":{"en":"Antisyphillis (usually spelled antisyphilis or, more commonly, antisyphilitic) means “against syphilis; used to treat syphilis.”","zh":"antisyphillis（常为拼写错误；更常见 antisyphilis 或更常用 antisyphilitic）指“抗梅毒的；用于治疗梅毒的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Intended to prevent, treat, or work against syphilis; more commonly written as antisyphilitic.","zh":"（罕见）用于预防、治疗或对抗梅毒的；更常见写法为 antisyphilitic（抗梅毒的）。"},"examples":[{"en":"Before antibiotics, doctors tried various antisyphilis remedies, many of which were unsafe.","zh":"在抗生素出现之前，医生曾尝试多种“抗梅毒”疗法，但其中不少并不安全。"},{"en":"This museum label mentions an early antisyphilis treatment used in the 1800s.","zh":"这块博物馆说明牌提到了一种19世纪使用的早期抗梅毒治疗方法。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) A medicine or treatment used to fight syphilis.","zh":"（罕见）用于对抗梅毒的药物或治疗方法。"},"examples":[{"en":"They recorded the patient’s response to the antisyphilis drug.","zh":"他们记录了病人对抗梅毒药物的反应。"}]}],"synonyms":["antisyphilitic","anti-syphilis (rare)","syphilis treatment (common phrasing)"],"phonetic":"/ˌæn.tiˈsɪf.ə.lɪs/","extraExplanation":["“antisyphillis” 很可能是拼写错误。常见拼法有：antisyphilis（较少见）以及 antisyphilitic（更常用，意为“抗梅毒的”）。","在现代英语里，医学语境通常不会用 antisyphilis 这种形式，而是直接说 “syphilis treatment”（梅毒治疗）、“antibiotics for syphilis”（治疗梅毒的抗生素）等。","梅毒是性传播感染之一；在健康与性教育语境中，英文表达通常会强调检测（testing）、治疗（treatment）与预防（prevention），用语相对中性、尊重。"]}

