{"word":"antijam","summary":{"en":"Antijam (usually written “anti-jam”) means designed to resist or reduce signal jamming, or the technology used to do that.","zh":"Antijam（常写作“anti-jam”）指“抗干扰”的，或指用于抗干扰的技术/能力。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Usually written with a hyphen: anti-jam) designed to prevent or reduce signal jamming; resistant to interference that tries to block a radio/GPS/communication signal.","zh":"（通常写作 anti-jam）用于防止或减少“干扰/阻塞信号（jamming）”；能抵抗蓄意电磁干扰的（常指无线电、GPS或通信信号）。"},"examples":[{"en":"The military tested an anti-jam GPS receiver during the exercise.","zh":"军方在演习中测试了一种抗干扰的 GPS 接收机。"},{"en":"We need anti-jam protection so the drone can keep its link in a noisy environment.","zh":"我们需要抗干扰保护，这样无人机在电磁环境很“吵”的地方也能保持通信链路。"}]},{"partOfSpeech":"n.","definition":{"en":"anti-jam capability or technology (equipment, software, or methods) used to defend against jamming.","zh":"抗干扰能力或技术（指设备、软件或方法），用于对抗蓄意干扰。"},"examples":[{"en":"The system includes anti-jam as part of its navigation package.","zh":"该系统的导航套件中包含抗干扰功能。"},{"en":"They invested in anti-jam to make the network more reliable.","zh":"他们投入抗干扰技术，让网络更可靠。"}]}],"synonyms":["jam-resistant","anti-jamming","interference-resistant","jamming protection"],"phonetic":"/ˌæntiˈdʒæm/","extraExplanation":["“Jam/jamming”在通信领域指故意发射强噪声或干扰信号，让对方收不到或误判信号；因此“anti-jam”常见于军事通信、卫星导航（如GPS）、无人机链路等语境。","拼写上更常见的是带连字符的“anti-jam”。在正式技术写作里也常见更具体的说法，如“anti-jamming (technology)”或“jam-resistant”。"]}
{"word":"antijamming","summary":{"en":"Antijamming means resisting or countering signal jamming (intentional interference), especially in GPS and communications.","zh":"Antijamming 指“抗干扰/反制干扰”，用于抵抗蓄意的信号压制，常见于 GPS 和通信系统。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to prevent, reduce, or resist signal jamming (intentional interference) in communications or navigation systems.","zh":"用于防止、减轻或抵抗（蓄意）信号干扰/压制的；抗干扰的（常用于通信或导航系统）。"},"examples":[{"en":"The military upgraded its GPS receivers with antijamming technology.","zh":"军方用抗干扰技术升级了他们的 GPS 接收机。"},{"en":"Antijamming antennas help keep the link stable even under interference.","zh":"抗干扰天线有助于在受到干扰时仍保持链路稳定。"}]},{"partOfSpeech":"n.","definition":{"en":"The set of methods or equipment used to counter jamming in a system.","zh":"（某系统中的）抗干扰技术/设备/措施（统称）。"},"examples":[{"en":"The drone’s antijamming improved after a software update.","zh":"软件更新后，这架无人机的抗干扰能力提升了。"},{"en":"They tested antijamming in a simulated electronic-attack environment.","zh":"他们在模拟电子攻击环境中测试了抗干扰措施。"}]}],"synonyms":["anti-jamming","jam-resistant","interference-resistant","counter-jamming"],"phonetic":"/ˌæn.tiˈdʒæm.ɪŋ/","extraExplanation":["“jamming”在通信领域指用噪声或更强的信号去“压住”原本的信号，使对方无法接收或定位；“antijamming”常见于GPS/GNSS（卫星导航）、无线电通信、数据链等场景。","写法上也常见作“anti-jamming”（加连字符）或“anti jamming”（分开），意思相同，工程与军用文件里很常见。"]}

