{"word":"Antiidiotypic","summary":{"en":"Antiidiotypic describes (or refers to) an antibody that targets another antibody’s idiotype (its antigen-binding identity).","zh":"Antiidiotypic（抗独特型）指针对另一种抗体独特型（抗原结合位点相关特征）的抗体或其性质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an antibody that binds to the specific antigen-binding region (idiotype) of another antibody, often used to regulate or mimic immune responses.","zh":"（免疫学）指能与另一种抗体的特异性抗原结合位点（独特型/表位型，idiotype）结合的抗体或其性质，常用于调节或模拟免疫反应。"},"examples":[{"en":"Researchers developed an antiidiotypic antibody to block the harmful autoantibody.","zh":"研究人员开发了一种抗独特型抗体来阻断有害的自身抗体。"},{"en":"Antiidiotypic antibodies can sometimes act like an “internal image” of the antigen.","zh":"抗独特型抗体有时可以像抗原的“内在影像”一样发挥作用。"}]},{"partOfSpeech":"n.","definition":{"en":"An antiidiotypic antibody (an antibody directed against another antibody’s idiotype).","zh":"抗独特型抗体：针对另一种抗体的独特型（idiotype）而产生的抗体。"},"examples":[{"en":"The team purified an antiidiotypic from mouse serum for further testing.","zh":"团队从小鼠血清中纯化出一种抗独特型抗体以做进一步测试。"},{"en":"Antiidiotypics were studied as potential vaccine-like agents in early experiments.","zh":"在早期实验中，人们研究抗独特型抗体作为潜在“类疫苗”制剂的可能性。"}]}],"synonyms":["anti-idiotype","idiotype-specific (in context)"],"phonetic":"/ˌæn.tiˌɪd.i.oʊˈtɪp.ɪk/","extraExplanation":["“idiotype（独特型）”指抗体可变区上具有特异性的结构特征，可被免疫系统当作“抗原”来识别；因此“anti-idiotypic”就是“针对这种独特型的”。","在免疫网络理论中，抗独特型抗体可能参与免疫调控；某些抗独特型抗体还能在功能上“模仿”原始抗原（常被称为 antigen 的“internal image”概念），因此在疫苗研究史上出现过相关尝试。","该词主要用于免疫学/生物医学论文与实验语境，日常英语中很少使用。"]}
{"word":"antiinflammatories","summary":{"en":"Antiinflammatories are medicines that reduce inflammation and related pain or swelling.","zh":"Antiinflammatories 指能减轻炎症及相关疼痛、肿胀的药物（抗炎药/消炎药）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Medicines or drugs that reduce inflammation (swelling, redness, pain), often used for injuries, arthritis, or other inflammatory conditions.","zh":"抗炎药；消炎药（用于减轻炎症，如肿胀、发红和疼痛，常用于扭伤、关节炎等炎症相关情况）。"},"examples":[{"en":"The doctor prescribed antiinflammatories to reduce the swelling in her knee.","zh":"医生开了抗炎药来减轻她膝盖的肿胀。"},{"en":"Some people take antiinflammatories after a sports injury, but you should follow the label instructions.","zh":"有些人在运动受伤后会服用抗炎药，但应按照说明书使用。"},{"en":"Because of his stomach problems, he asked whether antiinflammatories were safe for him.","zh":"因为他有胃部问题，他询问抗炎药对他是否安全。"}]}],"synonyms":["anti-inflammatory drugs","anti-inflammatories","NSAIDs","anti-inflammatory medicines"],"phonetic":"/ˌæn.ti.ɪnˈflæm.əˌtɔriz/","extraExplanation":["“antiinflammatories”是“anti-inflammatory（抗炎的/抗炎药）”的复数名词形式。写法上常见变体包括：anti-inflammatories（更常见的带连字符拼写）和 antiinflammatories（不带连字符）。","日常英语里，人们常用“anti-inflammatories”泛指两大类：NSAIDs（非甾体抗炎药，如 ibuprofen/布洛芬、naproxen/萘普生）和类固醇抗炎药（如 prednisone/泼尼松）；但具体药物作用和风险不同。","用药安全提示：部分抗炎药可能刺激胃、影响肾功能或与其他药物相互作用；有胃溃疡史、肾病、正在用抗凝药或孕期等情况应先咨询医生/药师。"]}
{"word":"antiinflammatory","summary":{"en":"Anti-inflammatory means reducing inflammation; it can also refer to a drug that does so.","zh":"anti-inflammatory 表示“抗炎的/消炎的”；也可指“抗炎药/消炎药”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Reducing inflammation (swelling, redness, pain) in the body.","zh":"抗炎的；消炎的（能减轻身体的炎症，如肿胀、发红、疼痛）。"},"examples":[{"en":"Ibuprofen is an anti-inflammatory drug often used for pain and swelling.","zh":"布洛芬是一种常用于缓解疼痛和肿胀的抗炎药。"},{"en":"The doctor recommended an anti-inflammatory cream for her sore knee.","zh":"医生建议她用消炎药膏来缓解膝盖疼痛。"},{"en":"Some people follow an anti-inflammatory diet to help manage chronic inflammation.","zh":"有些人会采用抗炎饮食来帮助控制慢性炎症。"}]},{"partOfSpeech":"n.","definition":{"en":"A medicine or substance that reduces inflammation.","zh":"抗炎药；消炎药（能减轻炎症的药物或物质）。"},"examples":[{"en":"Take the anti-inflammatory with food to avoid stomach upset.","zh":"抗炎药要随餐服用，以免刺激胃部。"},{"en":"The pharmacist suggested an over-the-counter anti-inflammatory for the sprain.","zh":"药师建议扭伤可以用非处方的消炎药。"}]}],"synonyms":["anti-inflammatory agent","NSAID (in many cases)","antiinflammatory"],"phonetic":"/ˌæn.ti.ɪnˈflæm.əˌtɔːr.i/","extraExplanation":["常见拼写是 anti-inflammatory（带连字符）；也可以写作 antiinflammatory（不带连字符），但在医学与日常写作中前者更常见。","在医学语境里常见搭配：anti-inflammatory drug/medicine（抗炎药）、nonsteroidal anti-inflammatory drug (NSAID)（非甾体抗炎药，如 ibuprofen）。","注意 anti-inflammatory 主要指“减轻炎症反应”，不等同于 antibiotic（抗生素，针对细菌感染）。"]}
{"word":"antiinstitutionalist","summary":{"en":"Antiinstitutionalist: against (or distrusting) powerful institutions; also a person with that view.","zh":"antiinstitutionalist：反对或不信任强势机构/体制的（也可指持这种观点的人）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to powerful institutions (especially the government, schools, churches, or big organizations), or favoring reducing their control and influence.","zh":"反对强势机构（尤指政府、学校、教会或大型组织）的；主张削弱其控制力和影响力的。"},"examples":[{"en":"Some voters describe themselves as antiinstitutionalist because they distrust both big government and big corporations.","zh":"一些选民称自己是“反体制/反机构主义者”，因为他们既不信任大政府，也不信任大公司。"},{"en":"Her antiinstitutionalist views make her skeptical of long-term careers inside large bureaucracies.","zh":"她的反机构主义观点使她对在大型官僚体系里长期工作持怀疑态度。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who is opposed to powerful institutions or who distrusts institutional authority.","zh":"反对强势机构的人；不信任体制权威的人。"},"examples":[{"en":"He’s an antiinstitutionalist who prefers community-led solutions to social problems.","zh":"他是个反机构主义者，更偏好由社区主导来解决社会问题。"}]}],"synonyms":["anti-establishment","institution-skeptical","anti-bureaucratic","anti-authoritarian"],"phonetic":"/ˌæntiˌɪnstɪˈtuʃənəlɪst/","extraExplanation":["“anti-”表示“反对”；“institutionalist”指“支持/强调制度与机构作用的人”。合在一起多用于政治与社会讨论，接近“反体制（anti-establishment）”，但侧重点更偏向“机构/制度”本身（如官僚系统、传统组织）。","这个词相对少见，日常表达里更常用“anti-establishment”或直接说“skeptical of institutions / distrusts institutions（对机构不信任）”。"]}
{"word":"antiinstitutionalists","summary":{"en":"Antiinstitutionalists are people who oppose large established institutions and the power they hold.","zh":"antiinstitutionalists 指反对大型既有机构及其权力影响的人（反建制者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who oppose institutions (especially large, established organizations such as governments, universities, churches, or psychiatric hospitals) and their power or influence","zh":"反对制度/机构的人；反建制者（尤其反对政府、大学、教会或精神病院等大型既有机构及其权力影响）"},"examples":[{"en":"The antiinstitutionalists argued that big institutions often ignore individual needs.","zh":"反建制者认为，大型机构常常忽视个人需求。"},{"en":"In the debate, antiinstitutionalists pushed for community-based care instead of long-term hospitalization.","zh":"在辩论中，反建制者主张以社区照护取代长期住院。"}]}],"synonyms":["anti-establishment activists","institution critics","dissenters"],"phonetic":"/ˌæntiˌɪnstəˈtuʃənəlɪsts/","extraExplanation":["“antiinstitutionalists”是复数形式；单数是“antiinstitutionalist”。也常写作“anti-institutionalists”（加连字符），意思不变。","这个词常出现在社会运动与公共政策语境：例如20世纪后期关于精神卫生“去机构化”（deinstitutionalization）的讨论中，反对把大量人长期安置在精神病院等机构里，转而支持社区服务与更小规模的照护体系。","注意它不一定等同于“反对一切规则/组织”。很多“反建制者”是反对“权力过度集中、缺乏问责或不人性化的制度运作方式”，而不一定否定所有机构本身。"]}
{"word":"antiinsurrectionally","summary":{"en":"“Antiinsurrectionally” means “in a way that opposes an insurrection or uprising.”","zh":"“antiinsurrectionally”表示“以反对起义/暴动（叛乱）的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that opposes an insurrection (an organized attempt to overthrow a government or authority).","zh":"以反叛乱的方式；以反对暴动/起义的方式。"},"examples":[{"en":"The senator spoke antiinsurrectionally, urging calm and rejecting any violent uprising.","zh":"这位参议员以反叛乱的立场发言，呼吁保持冷静并反对任何暴力起义。"},{"en":"The policy was framed antiinsurrectionally, focusing on preventing organized rebellion.","zh":"该政策以反叛乱为导向制定，重点在于防止有组织的叛乱。"}]}],"synonyms":["against an uprising","anti-rebellion","anti-uprising","counterinsurgently"],"phonetic":"/ˌæn.tiˌɪn.səˈrɛk.ʃə.nə.li/","extraExplanation":["这是一个非常罕见、偏学术或法律语体的副词，常见于政治学、历史、法律评论等语境；日常英语里更常用表达是：in opposition to an insurrection / against an uprising / anti-rebellion.","构词法：anti-（反对）+ insurrection（起义、暴动）+ -al（形容词后缀）+ -ly（副词后缀）。理解它的关键是先掌握 insurrection（起义）与 anti-（反对）。","近义词选择要看语境：如果强调“反对暴力起义”，可用 anti-rebellion / anti-uprising；如果强调“反对叛乱者”，可用 counterinsurgent（更偏军事/反叛乱行动）。"]}
{"word":"antiinsurrectionists","summary":{"en":"Antiinsurrectionists are people who oppose insurrections or violent uprisings against a government or authority.","zh":"Antiinsurrectionists 指反对叛乱或反政府暴力起义的人（反叛乱派）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who oppose an insurrection (a violent uprising against a government or authority)","zh":"反对叛乱（反政府武装起义）的人；反叛乱派"},"examples":[{"en":"The antiinsurrectionists called for calm and urged people to solve disputes through elections, not violence.","zh":"反叛乱派呼吁保持冷静，主张通过选举而不是暴力来解决争端。"},{"en":"In the debate, antiinsurrectionists argued that breaking the law would only deepen the crisis.","zh":"在辩论中，反叛乱派认为违法只会加深危机。"}]}],"synonyms":["opponents of insurrection","anti-rebellion activists","anti-uprising groups"],"phonetic":"/ˌæntiˌɪnsəˈrɛkʃənɪsts/","extraExplanation":["这个词是由三部分构成：anti-（反对）+ insurrection（叛乱、起义）+ -ist（……主义者/……派的人），再加复数 -s。多用于政治、历史或新闻语境，强调立场：反对以暴力推翻或挑战既有政权的行动。","insurrection 通常指针对政府或权威的“武装起义/暴动”，语气比 rebellion 更正式，也常带有法律或政治评价。"]}

