{"word":"antirabic","summary":{"en":"Antirabic means used to prevent or treat rabies, especially a rabies vaccine or serum.","zh":"antirabic 指用于预防或治疗狂犬病的（尤指狂犬病疫苗或免疫血清）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to preventing or treating rabies (especially by vaccination or serum).","zh":"与预防或治疗狂犬病有关的（尤指通过疫苗或免疫血清）。"},"examples":[{"en":"The clinic offers antirabic vaccination after animal bites.","zh":"诊所在被动物咬伤后提供抗狂犬病疫苗接种。"},{"en":"He received an antirabic shot as a precaution.","zh":"他为了预防打了抗狂犬病的针。"}]}],"synonyms":["anti-rabies","rabies-preventing","rabies vaccine (common wording)","anti-rabies vaccine"],"phonetic":"/ˌæn.tiˈreɪ.bɪk/","extraExplanation":["“antirabic”比较偏医学/正式用语，日常更常说“rabies vaccine / rabies shot（狂犬病疫苗/针）”或“post-exposure prophylaxis, PEP（暴露后预防）”。","词形上：anti- 表示“反、抗”，rabic 来自 rabies（狂犬病）。"]}
{"word":"antirabies","summary":{"en":"Antirabies means ‘against rabies,’ especially describing a vaccine or treatment.","zh":"antirabies 指“抗/预防狂犬病的”，多用于疫苗或治疗。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Preventing or protecting against rabies (often used to describe a vaccine, serum, or treatment).","zh":"预防狂犬病的；抗狂犬病的（常用于描述疫苗、血清或治疗）。"},"examples":[{"en":"The dog received an antirabies vaccine after its annual checkup.","zh":"那只狗在年度体检后接种了抗狂犬病疫苗。"},{"en":"After the bite, the doctor started antirabies treatment immediately.","zh":"被咬后，医生立刻开始进行抗狂犬病治疗。"}]},{"partOfSpeech":"n.","definition":{"en":"An antirabies vaccine or treatment (less common; often written with a hyphen as “anti-rabies”).","zh":"抗狂犬病疫苗或治疗（较少见；常写作带连字符的“anti-rabies”）。"},"examples":[{"en":"The clinic ran out of antirabies for a few days.","zh":"诊所的抗狂犬病疫苗断货了几天。"}]}],"synonyms":["rabies vaccine","anti-rabies vaccine","rabies shot","rabies prophylaxis","post-exposure prophylaxis (PEP)"],"phonetic":"ˌæntaɪˈreɪbiz","extraExplanation":["这个词在日常英语里不算常见，更常见的表达是“rabies vaccine（狂犬病疫苗）”、“rabies shot（狂犬病针）”或“post-exposure prophylaxis/PEP（暴露后预防）”。","拼写上常见“anti-rabies”（带连字符），尤其在医学、公共卫生或说明书/公告中；不带连字符“antirabies”也能见到，但频率更低。"]}
{"word":"antiracemate","summary":{"en":"A rare chemistry term for a racemic mixture that crystallizes as separate enantiomer crystals (a racemic conglomerate), not a single racemic compound crystal.","zh":"一个较少用的化学术语：指1:1对映体混合物更倾向分别结晶为各自对映体晶体（外消旋集合体），而不是形成单一外消旋化合物晶体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry, rare) A racemic mixture (a 1:1 mix of two enantiomers) that does *not* form a single “racemic compound” crystal, but instead tends to separate into crystals of the individual enantiomers (a racemic conglomerate).","zh":"（化学，较少用）外消旋混合物（两种对映体按1:1混合）的一种情形：它不形成单一的“外消旋化合物”晶体，而更倾向于分别结晶为各自的对映体晶体（即外消旋集合体/外消旋聚集体）。"},"examples":[{"en":"The sample behaved like an antiracemate, giving separate crystals of each enantiomer.","zh":"该样品表现得像抗外消旋体，分别生成了两种对映体的独立晶体。"},{"en":"Antiracemate crystallization can make chiral resolution easier in some cases.","zh":"在某些情况下，抗外消旋体式的结晶会让手性拆分更容易。"}]}],"synonyms":["racemic conglomerate","conglomerate (in chiral crystallization)"],"phonetic":"ˌæn.tiˈreɪ.sə.meɪt","extraExplanation":["这是一个非常专业且不常见的术语，不同作者/领域用法可能略有差异。更常见的说法是“racemic conglomerate（外消旋集合体/聚集体）”。","对比记忆：racemate 强调“1:1的对映体混合”；racemic compound 指两种对映体在同一晶格中共同结晶；而这里的 antiracemate 强调“更倾向分开结晶”。"]}
{"word":"antiracer","summary":{"en":"“Antiracer” means a person or attitude that opposes racing or racing culture (often street racing).","zh":"“antiracer”指反对赛车/竞速或相关文化（常见于反对街头飙车）的个人或立场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is against racing (such as car racing or running races), or who dislikes the culture of racing","zh":"反对（汽车、赛跑等）比赛的人；不喜欢“赛车/竞赛文化”的人"},"examples":[{"en":"Some antiracers argue that street racing is too dangerous for local communities.","zh":"一些反对赛车的人认为，飙车对当地社区来说太危险了。"},{"en":"He’s an antiracer—he thinks racing wastes money and encourages risky behavior.","zh":"他反对赛车——他认为赛车浪费钱，还会助长冒险行为。"}]},{"partOfSpeech":"adj.","definition":{"en":"opposed to racing; meant to discourage racing or racing culture","zh":"反对比赛的；用来抑制赛车/竞赛风气的"},"examples":[{"en":"The city launched an antiracer campaign to reduce illegal street races.","zh":"这座城市发起了反飙车宣传活动，以减少非法街头赛车。"},{"en":"They proposed antiracer rules, like stricter noise limits at night.","zh":"他们提出了反飙车规定，比如夜间更严格的噪音限制。"}]}],"synonyms":["anti-racing","against racing","opponent of racing"],"phonetic":"/ˌæntiˈreɪsər/","extraExplanation":["“antiracer”不是一个非常常见的标准词，更多时候会写成带连字符的“anti-racer”。在新闻或社交媒体里，它通常指反对街头飙车、反对赛车文化或反对竞速活动的人/立场。","注意不要和“anti-racist（反种族主义的）”混淆：两者拼写和发音相近，但含义完全不同。"]}
{"word":"antirachitic","summary":{"en":"Antirachitic means ‘preventing or treating rickets,’ often referring to vitamin D–related nutrition or medicine.","zh":"antirachitic 指“抗佝偻病的”，常用于描述与维生素D相关、可预防或治疗佝偻病的营养或药物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Preventing or treating rickets (a childhood bone disease caused mainly by vitamin D deficiency).","zh":"抗佝偻病的；用于预防或治疗佝偻病（多由维生素D缺乏引起的儿童骨骼疾病）。"},"examples":[{"en":"Doctors may prescribe an antirachitic vitamin D supplement for infants at risk.","zh":"医生可能会给有风险的婴儿开具抗佝偻病的维生素D补充剂。"},{"en":"Fortified milk is considered antirachitic because it helps prevent rickets.","zh":"强化牛奶被认为具有抗佝偻病作用，因为它有助于预防佝偻病。"}]}],"synonyms":["anti-rickets","vitamin D–fortified","vitamin D-rich"],"phonetic":"/ˌæn.ti.rəˈkɪtɪk/","extraExplanation":["“antirachitic”较常见于医学或营养学语境，日常英语里更常说“vitamin D supplement”“rickets prevention”“fortified with vitamin D”等。","词源上可拆解理解：anti-（反/抗）+ rachitic（佝偻病的；与rickets相关）。","佝偻病多与维生素D不足、日照不足或钙/磷代谢问题相关，因此“antirachitic”常指含维生素D（有时也包括钙、磷）并能改善骨骼矿化的措施或制剂。"]}
{"word":"antirachitically","summary":{"en":"Antirachitically means “in a way that prevents or treats rickets,” often by providing vitamin D.","zh":"antirachitically 意为“以预防或治疗佝偻病的方式”，常指通过补充维生素D等。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that prevents or treats rickets (a childhood bone-softening disease).","zh":"以预防或治疗佝偻病（儿童常见的骨骼软化疾病）的方式。"},"examples":[{"en":"The cereal is fortified antirachitically with vitamin D.","zh":"这种麦片添加了维生素D，以预防佝偻病。"},{"en":"Cod-liver oil was once used antirachitically for children who lacked sunlight.","zh":"过去，鳕鱼肝油常用于缺少日照的儿童，以预防佝偻病。"}]}],"synonyms":["antirachiticly","in a vitamin-D-providing way","to prevent rickets"],"phonetic":"/ˌæn.ti.rəˈkɪt.ɪ.kli/","extraExplanation":["“antirachitically”来自 anti-（反、预防）+ rachitic（佝偻病的）+ -ally（副词后缀）。在现代日常英语中较少见，更常见的表达是 “to prevent/treat rickets” 或 “with vitamin D to prevent rickets”。","佝偻病常与维生素D缺乏有关；因此与“日照、维生素D强化食品、补充剂”相关的语境中更可能看到该词或其形容词形式 “antirachitic”。"]}
{"word":"antirachiticly","summary":{"en":"“Antirachiticly” means “in a way that prevents or treats rickets,” used mainly in medical or nutrition contexts.","zh":"“antirachiticly”表示“以预防或治疗佝偻病的方式”，主要用于医学或营养学语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that prevents or treats rickets (a childhood bone disease caused mainly by vitamin D deficiency).","zh":"以预防或治疗佝偻病（主要由维生素D缺乏引起的儿童骨骼疾病）的方式。"},"examples":[{"en":"Vitamin D helps the body absorb calcium, working antirachiticly to support healthy bone growth in children.","zh":"维生素D帮助身体吸收钙，从而以抗佝偻病的方式支持儿童健康的骨骼生长。"},{"en":"In early nutrition research, cod-liver oil was described as acting antirachiticly.","zh":"在早期营养研究中，鱼肝油常被描述为具有抗佝偻病的作用。"}]}],"synonyms":["antirachitically","in an antirachitic way","in a way that prevents rickets"],"phonetic":"/ˌæn.ti.rəˈkɪt.ɪ.kli/","extraExplanation":["“antirachiticly”更常见的拼写是 **antirachitically**（-ically 结尾更符合英语构词习惯）；你输入的 **antirachiticly** 可以理解，但较少见。","词根拆解：anti-（反、抗）+ rachitic（佝偻病的；来自 rickets）+ -ly（副词后缀），整体意思就是“以抗佝偻病的方式”。","这个词多见于医学、营养学或药理学语境（例如描述维生素D、钙、鱼肝油或强化食品对佝偻病的预防作用），日常英语中较少使用。"]}
{"word":"antiracial","summary":{"en":"Antiracial means opposing racism or racial discrimination; less commonly, it can mean avoiding race-based categories.","zh":"antiracial 指反对种族主义或种族歧视；较少见时也可指避免以种族分类为依据。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposing racism or racial discrimination; supporting equal treatment across races.","zh":"反对种族主义或种族歧视的；主张不同种族平等对待的。"},"examples":[{"en":"The school adopted an antiracial policy to prevent discrimination in admissions.","zh":"学校采用了反种族歧视的政策，以防止招生中的歧视。"},{"en":"She joined an antiracial campaign promoting equal rights for all communities.","zh":"她参加了一项反种族主义的倡议活动，推动所有社群的平等权利。"}]},{"partOfSpeech":"adj.","definition":{"en":"not based on race; aiming to reduce the importance of race in decisions or identity (less common).","zh":"不以种族为依据的；试图降低“种族”在决策或身份认同中的重要性（较少见）。"},"examples":[{"en":"They argued for an antiracial approach that focuses on individual needs rather than racial categories.","zh":"他们主张一种“不以种族为依据”的方法，关注个体需求而不是种族类别。"},{"en":"In some discussions, antiracial language is used to describe policies that avoid race-based labels.","zh":"在一些讨论中，“antiracial”用来描述避免使用基于种族标签的政策。"}]}],"synonyms":["antiracist","anti-racist","anti-discriminatory","egalitarian"],"phonetic":"/ˌæntiˈreɪʃəl/","extraExplanation":["“antiracial”在现实英语里不如“anti-racist / antiracist（反种族主义的）”常见。很多写作与学术/公共讨论更倾向用“antiracist”，因为它强调主动反对并改变种族不平等的行动，而“antiracial”有时会被理解为“尽量不谈种族/不以种族为框架”。具体用哪个词，取决于你想强调的是“反歧视行动”还是“减少种族分类的使用”。","构词法：anti-（反对）+ racial（种族的）。常见拼写有 antiracial 和 anti-racial，两者都可见，但在正式写作中可参考目标期刊/机构的写作规范。"]}
{"word":"antiracially","summary":{"en":"Antiracially means “in an anti-racist way,” opposing racism or refusing to judge people by race.","zh":"antiracially 指“以反种族主义的方式”，即反对种族主义/种族歧视，或拒绝以种族来评判与区别对待他人。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an anti-racist way; opposing racism or racial discrimination.","zh":"以反种族主义的方式；反对种族歧视或种族主义。"},"examples":[{"en":"The organization trains teachers to respond antiracially to bias in the classroom.","zh":"该组织培训教师在课堂上以反种族主义的方式应对偏见。"},{"en":"She spoke antiracially, challenging stereotypes without attacking anyone personally.","zh":"她以反种族主义的立场发言，质疑刻板印象，同时不进行人身攻击。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that rejects using race as a basis for judging, separating, or treating people differently.","zh":"以拒绝“以种族作为评判、区分或差别对待依据”的方式。"},"examples":[{"en":"The policy was rewritten antiracially so that decisions could not be based on racial categories.","zh":"这项政策以反种族划分的原则重新撰写，确保决策不能依据种族类别。"},{"en":"They try to think antiracially when discussing history, focusing on systems rather than blaming groups.","zh":"他们在讨论历史时尽量以反种族化的方式思考，关注制度而不是指责某个群体。"}]}],"synonyms":["anti-racistly","without racial bias","in an anti-racist way","against racial discrimination"],"phonetic":"ˌæn.tiˈreɪ.ʃə.li","extraExplanation":["“antiracially”较少见，更常见的写法是“anti-racially”或用更常用的表达如“in an anti-racist way”。在现实语境里，人们更常用“anti-racist/antiracism（反种族主义）”来强调主动反对歧视与不平等，而“nonracial/color-blind（不谈种族/色盲式）”有时被批评为忽视现实差异。选择哪种表达取决于你想强调‘主动对抗’还是‘避免以种族作依据’。"]}
{"word":"antiracing","summary":{"en":"Anti-racing means opposing racing or intended to prevent street racing.","zh":"antiracing 指反对赛车或用于防止（街头）飙车的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to racing (especially illegal street racing) or intended to discourage it.","zh":"反对赛车（尤指非法飙车）或用于遏制飙车的。"},"examples":[{"en":"The city installed anti-racing barriers on the road to stop street racing at night.","zh":"市政府在道路上安装了反飙车的隔离设施，以制止夜间飙车。"},{"en":"Local residents asked for anti-racing measures after several loud races disturbed the neighborhood.","zh":"几次噪音很大的飙车扰民后，当地居民要求采取反飙车措施。"},{"en":"The new policy is anti-racing and focuses on safer driving.","zh":"新政策反对飙车，重点是更安全的驾驶。"}]}],"synonyms":["anti–street racing","against racing","race-prevention","traffic-calming (related)"],"phonetic":"/ˌæn.tiˈreɪ.sɪŋ/","extraExplanation":["“anti-”表示“反对/防止”，所以“anti-racing”常用于公共安全与交通语境，尤其指“遏制街头飙车”的设施、法规或行动。","这个词不算非常固定的词典词条，更常见写法是带连字符的“anti-racing”。在正式写作中，你也可以用更常见表达：“anti–street racing measures”（反街头飙车措施）或“measures to prevent street racing”（防止街头飙车的措施）。"]}
{"word":"antiracism","summary":{"en":"Antiracism is the active effort to oppose racism and reduce racial inequality in everyday life and institutions.","zh":"Antiracism 指积极反对种族主义，并在日常生活与制度层面减少种族不平等的努力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The belief and practice of actively opposing racism and changing policies, behaviors, and systems that create racial inequality.","zh":"反种族主义：积极反对种族主义，并致力于改变造成种族不平等的政策、行为与制度的理念与行动。"},"examples":[{"en":"The school started antiracism training for teachers and staff.","zh":"学校为教师和员工开展了反种族主义培训。"},{"en":"Antiracism means not only avoiding racist language but also challenging unfair rules.","zh":"反种族主义不仅是不说带有种族歧视的语言，也包括质疑并改变不公平的规则。"},{"en":"Many companies now publish antiracism commitments and goals.","zh":"许多公司如今会公开发布反种族主义的承诺与目标。"}]}],"synonyms":["racial justice","anti-discrimination"],"phonetic":"/ˌæn.tiˈreɪ.sɪ.zəm/","extraExplanation":["“antiracism”常与“not racist（不种族主义）”对比：前者强调“主动做什么”（识别并减少不公平），后者更偏向“没有做什么”（不使用歧视言行）。在当代英语公共讨论中，“antiracism”常用于教育、职场与公共政策语境。","该词多写作一个词（antiracism），也常见写法为“anti-racism”（带连字符），两者意思相同；美式写作中两种都能见到，以机构或出版物风格指南为准。"]}
{"word":"antiracist","summary":{"en":"Antiracist means actively opposing racism; it can describe a person or an approach that works for racial equality.","zh":"Antiracist 指积极反对种族主义、推动种族平等；既可形容人也可形容做法/立场。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to racism and actively supporting fair treatment and equal opportunities for people of all races.","zh":"反对种族主义，并积极支持不同种族的人获得公平对待与平等机会的。"},"examples":[{"en":"Our school started an antiracist training program for teachers.","zh":"我们学校为老师开设了反种族主义培训项目。"},{"en":"She tries to be antiracist by speaking up when she hears a racist joke.","zh":"她努力做到反种族主义：听到带有种族歧视的玩笑时会站出来制止。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who opposes racism and works to reduce or end it.","zh":"反种族主义者；致力于反对并减少或消除种族主义的人。"},"examples":[{"en":"Many antiracists joined the march for racial justice.","zh":"许多反种族主义者参加了争取种族正义的游行。"},{"en":"He describes himself as an antiracist, not just ‘not racist.’","zh":"他称自己是反种族主义者，而不只是“没有种族歧视”。"}]}],"synonyms":["anti-racist","anti-racism","racial-justice-focused","egalitarian"],"phonetic":"/ˌæn.tiˈreɪ.sɪst/","extraExplanation":["“antiracist”常与“not racist（不种族歧视）”对比：前者强调主动行动与持续反思（例如支持公平政策、指出偏见言行），而后者可能只是被动不参与。","该词在美国公共讨论中较常见，尤其在教育、职场培训与社会正义议题里；使用时注意语境，避免把复杂议题简化为贴标签。"]}
{"word":"antiracketeering","summary":{"en":"Anti-racketeering means aimed at stopping or punishing organized criminal money-making activities, especially in legal contexts.","zh":"Anti-racketeering 指“反敲诈勒索/反有组织犯罪牟利活动的”，多用于法律与执法语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"intended to prevent, control, or punish organized criminal activities such as illegal business schemes, extortion, or fraud (often used about laws and enforcement).","zh":"旨在预防、控制或惩治有组织犯罪活动（如非法敛财、勒索、诈骗等）的；常用来形容法律或执法行动。"},"examples":[{"en":"The company strengthened its compliance program to meet anti-racketeering requirements.","zh":"这家公司加强了合规项目，以满足反敲诈勒索相关要求。"},{"en":"Prosecutors brought anti-racketeering charges against the group for running a long-term fraud scheme.","zh":"检方以反敲诈勒索相关罪名起诉该团伙，指控其长期实施诈骗计划。"}]}],"synonyms":["anti-extortion","anti-organized-crime","crime-control"],"phonetic":"ˌæntiˌrækəˈtɪrɪŋ","extraExplanation":["“Racketeering”常指有组织犯罪通过一系列非法“营生”持续获利（如勒索、洗钱、诈骗、非法赌博等）。因此“anti-racketeering”多用于法律与执法语境。","在美国语境中，这个词经常和“RICO”一起出现：RICO（Racketeer Influenced and Corrupt Organizations Act，反有组织犯罪法）允许检方用“持续的犯罪模式”来起诉组织或个人，而不只针对单一犯罪行为。"]}
{"word":"antiradiant","summary":{"en":"Antiradiant means “not radiant”—not shining or giving off light/energy.","zh":"Antiradiant 指“非发光的/不放射的”，即不闪耀或不向外发出光（或能量）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not radiant; not shining or sending out light or energy (rare in everyday English).","zh":"不发光的；不放射的；不耀眼的（在日常英语中较少见）。"},"examples":[{"en":"The painting uses an antiradiant palette to create a quiet, somber mood.","zh":"这幅画用了一种不耀眼的色调来营造安静、沉郁的氛围。"},{"en":"Under the cloud cover, the sky looked flat and almost antiradiant.","zh":"在云层覆盖下，天空显得平淡，几乎不发光。"}]}],"synonyms":["nonradiant","unradiant","not radiant","dim","dull"],"phonetic":"/ˌæntiˈreɪdiənt/","extraExplanation":["这个词由前缀 anti-（“反……、非……”）+ radiant（“发光的、光芒四射的”）构成，字面意思就是“非发光的/不放射的”。它不是高频词，更常见的表达是 nonradiant（不发光的）或 not radiant（不发光的）。","在科学语境里，radiant 常与“辐射/辐射能（radiant energy）”相关；因此 antiradiant 有时也可被理解为“非辐射性的/不产生辐射的”，但实际写作中更常用 nonradiative、non-radiating 等更标准的术语。"]}
{"word":"antiradiating","summary":{"en":"Antiradiating means made to protect against radiation or reduce radiation exposure.","zh":"antiradiating 指“防辐射的”，用于阻挡或降低辐射暴露。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to reduce, block, or protect against radiation (such as X-rays, nuclear radiation, or electromagnetic radiation).","zh":"用于减少、阻挡或防护辐射（如X射线、核辐射或电磁辐射）的。"},"examples":[{"en":"The technician wore antiradiating gloves during the X-ray procedure.","zh":"在进行X光操作时，技术员戴着防辐射手套。"},{"en":"Hospitals use antiradiating shields to protect patients and staff.","zh":"医院使用防辐射屏蔽装置来保护病人和工作人员。"}]}],"synonyms":["anti-radiation","radiation-shielding","radiation-resistant","radiation-proof","EMF-shielding"],"phonetic":"/ˌæn.taɪˈreɪ.diˌeɪ.tɪŋ/","extraExplanation":["“antiradiating”由 anti-（反、抗、防）+ radiating（辐射的/放射的）构成，更常见、更地道的表达通常是“radiation-proof / radiation-resistant / radiation-shielding / anti-radiation”。在正式技术或产品语境中，建议优先用这些更常用的搭配。","使用场景多见于医学影像（X光、CT）、核工业、防护服/屏蔽材料、以及对电磁辐射的日常讨论。注意：日常生活里谈手机等设备时，英语里更常说“EMF shielding（电磁屏蔽）”或“radiation shielding”，而不是“antiradiating”。"]}
{"word":"antiradiation","summary":{"en":"Antiradiation means designed to protect against radiation or to counter radiation-emitting threats.","zh":"antiradiation 指“用于防护辐射的”或“用于对抗辐射源威胁的（常见于军事语境）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to protect against harmful radiation (such as from nuclear sources) or to reduce its effects.","zh":"用于防护有害辐射（如核辐射）或减轻其影响的；抗辐射的。"},"examples":[{"en":"The lab requires antiradiation clothing when handling radioactive materials.","zh":"实验室在处理放射性材料时要求穿戴抗辐射防护服。"},{"en":"They stored the medicine in an antiradiation container to prevent exposure during transport.","zh":"他们把药品放在抗辐射容器里，以防运输途中受到辐射影响。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to destroying, blocking, or countering radiation-emitting threats (especially in military contexts).","zh":"与摧毁、阻断或对抗辐射源威胁有关的（尤指军事语境）。"},"examples":[{"en":"The aircraft can carry an antiradiation missile to target enemy radar systems.","zh":"这架飞机可携带反辐射导弹，用于攻击敌方雷达系统。"},{"en":"Antiradiation measures were discussed during the emergency planning meeting.","zh":"在应急规划会议上讨论了反辐射措施。"}]}],"synonyms":["anti-radiation","radiation-protective","radiation-shielding","anti-radar (military-specific)"],"phonetic":"/ˌæn.tiˌreɪ.diˈeɪ.ʃən/","extraExplanation":["“antiradiation”也常写作“anti-radiation”（带连字符），两种写法都常见；在军事领域里，“antiradiation missile”通常指通过追踪雷达等电磁辐射源来攻击目标的“反辐射导弹”。","词缀提示：anti- 表示“反、对抗”；radiation 是“辐射”。合在一起更容易记忆。"]}
{"word":"antiradical","summary":{"en":"Antiradical means ‘against radicals’: either opposed to radical political change, or (in chemistry) able to inhibit free-radical reactions.","zh":"antiradical 意为“反激进/抗自由基”：可指反对激进政治变革，也可指（化学）抑制自由基反应。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to political or social radical ideas; against radical change.","zh":"反对（政治或社会）激进思想的；反激进的。"},"examples":[{"en":"The newspaper took an antiradical position during the protests.","zh":"这家报纸在抗议期间采取了反激进立场。"},{"en":"Some leaders used antiradical rhetoric to call for stability.","zh":"一些领导人用反激进的言辞呼吁稳定。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Preventing or reducing free-radical reactions; acting against radicals (often by stopping chain reactions).","zh":"（化学）抑制或减少自由基反应的；抗自由基的（常指阻断链式反应）。"},"examples":[{"en":"Antioxidants have antiradical activity that helps slow oxidation.","zh":"抗氧化剂具有抗自由基活性，有助于减缓氧化。"},{"en":"Researchers tested the antiradical effect of the plant extract.","zh":"研究人员测试了该植物提取物的抗自由基效果。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who opposes radicals or radical movements.","zh":"反对激进派的人；反激进者。"},"examples":[{"en":"In the debate, he presented himself as an antiradical.","zh":"在辩论中，他把自己塑造成反激进者。"}]}],"synonyms":["anti-radical","counter-radical","anti-extremist (context-dependent)","radical-scavenging (chemistry)"],"phonetic":"/ˌæntiˈrædɪkəl/","extraExplanation":["“antiradical”在日常英语里不算高频词：政治语境中更常见的是“anti-radical”或“anti-radicalization（反极端化/反激进化）”。","在化学与食品/材料科学里，“antiradical activity”常用来描述某物清除自由基或抑制自由基链式反应的能力，和“antioxidant（抗氧化）”相关但不完全等同。"]}
{"word":"antiradicalism","summary":{"en":"Antiradicalism means opposition to radical ideas or radical change, especially in politics and society.","zh":"Antiradicalism 指反对激进思想或激进变革（尤指政治与社会领域）的立场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to radical ideas or radical political/social change; a tendency to defend moderate or traditional approaches instead.","zh":"反激进主义；反对激进思想或激进的政治/社会变革的立场或倾向，通常主张温和或维持传统做法。"},"examples":[{"en":"After the revolution, antiradicalism became stronger among people who wanted stability.","zh":"革命之后，许多希望社会稳定的人更倾向于反激进主义。"},{"en":"His writings show antiradicalism: he argues for gradual reform rather than sudden change.","zh":"他的文章体现出反激进主义：他主张渐进改革，而不是突然的剧变。"},{"en":"The party’s antiradicalism appealed to voters worried about protests turning violent.","zh":"该党派的反激进主义吸引了担心抗议会演变成暴力的选民。"}]}],"synonyms":["opposition to radicalism","anti-extremism","moderation","conservatism (sometimes, depending on context)"],"phonetic":"/ˌæn.tiˈræd.ɪ.kəˌlɪz.əm/","extraExplanation":["这个词常出现在政治史与思想史语境中，用来描述对“激进派/激进改革”的反对态度。它不一定等同于“保守主义”（conservatism），但在某些历史阶段二者可能有重叠：反激进更强调“反对过于剧烈的变革”，而保守主义更强调“维护既有传统与秩序”。","构词法：anti-（反对）+ radicalism（激进主义）。在学术写作里，有时也会看到 related forms，如 antiradical（反激进的）或 anti-radicalism（加连字符的写法）。"]}
{"word":"antiradically","summary":{"en":"Antiradically means ‘in an anti-radical way,’ either opposing political extremism or (in science) counteracting free radicals.","zh":"antiradically 表示“以反激进的方式”，可指反对政治极端/激进，也可（科学中）指以清除自由基的方式（抗氧化）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that opposes radical or extreme political/social change; in an anti-radical manner.","zh":"以反对激进（政治/社会）变革的方式；以反激进的立场。"},"examples":[{"en":"The party governed antiradically, preferring gradual reform over sudden change.","zh":"该党以反激进的方式执政，更偏好渐进改革而不是突变。"},{"en":"Some newspapers argued antiradically during the unrest.","zh":"动荡期间，一些报纸以反激进的立场发表评论。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Science) In a way that neutralizes or reduces free radicals; with an antioxidant/anti–free-radical effect.","zh":"（科学）以清除或减少自由基的方式；具有抗自由基（抗氧化）作用地。"},"examples":[{"en":"The compound acts antiradically in laboratory tests.","zh":"该化合物在实验室测试中表现出抗自由基作用。"},{"en":"Researchers measured how strongly the extract works antiradically.","zh":"研究人员测量了该提取物抗自由基作用的强度。"}]}],"synonyms":["conservatively","moderately","anti-extremist","antioxidatively","as an antiradical agent"],"phonetic":"ˌæn.tiˈræd.ɪ.kli","extraExplanation":["“antiradically”很少在日常英语中出现，更常见于两类语境：①政治评论里表示“反激进地”；②科研写作里表示“抗自由基地/以抗氧化方式”。在科学语境中，你也会更常看到形容词“antiradical”或名词短语“antiradical activity（抗自由基活性）”。"]}
{"word":"antiradicals","summary":{"en":"Antiradicals are things that counter radicals—especially free radicals in chemistry/health; it can also mean anti-radical (opposed to radical politics).","zh":"antiradicals 指对抗“radical”的事物：常指化学/健康中的“抗自由基物质”；也可指政治上的“反激进（反激进派的）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Substances (often antioxidants) that neutralize free radicals and help prevent oxidative damage in the body or in materials.","zh":"（常指抗氧化剂等）能中和自由基、帮助减少氧化损伤的物质。"},"examples":[{"en":"Many fruits and vegetables contain antiradicals that protect cells from oxidative stress.","zh":"许多水果和蔬菜含有抗自由基成分，可帮助细胞抵抗氧化压力。"},{"en":"The skincare label claims the cream is rich in antiradicals.","zh":"这款护肤品的标签宣称它富含抗自由基成分。"}]},{"partOfSpeech":"adj.","definition":{"en":"Opposed to radical political or social change; against radicals.","zh":"反对激进的政治或社会变革；反激进派的。"},"examples":[{"en":"The group took an antiradical position during the protests.","zh":"在抗议期间，这个团体采取了反激进的立场。"},{"en":"Some newspapers published antiradical editorials calling for gradual reform.","zh":"一些报纸发表反激进的社论，呼吁渐进式改革。"}]}],"synonyms":["antioxidants","free-radical scavengers","radical inhibitors","anti-radical"],"phonetic":"/ˌæntaɪˈrædɪkəlz/","extraExplanation":["“antiradicals”更常见于科学/营销语境，意思接近“antioxidants（抗氧化剂）”，但“antiradical”强调“对抗自由基”这一点。","拼写上也常见带连字符的形式：anti-radical(s)。在政治语境里通常写作“anti-radical”。"]}
{"word":"antirailwayist","summary":{"en":"An antirailwayist is someone who opposes railways or railway expansion.","zh":"antirailwayist 指反对铁路或铁路扩张的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposes railways or railway building/expansion","zh":"反对铁路（修建或扩张）的人"},"examples":[{"en":"Some antirailwayists argued that new rail lines would ruin the countryside.","zh":"一些反对铁路的人认为，新铁路线路会破坏乡村景观。"},{"en":"In the debate, antirailwayists raised concerns about noise and land rights.","zh":"在辩论中，反对铁路的人提出了关于噪音和土地权利的担忧。"}]}],"synonyms":["anti-railway campaigner","railway opponent","anti-rail activist","opponent of railway expansion"],"phonetic":"/ˌæntiˈreɪlˌweɪɪst/","extraExplanation":["这是一个较少见的词，常见于19世纪铁路迅速扩张时期的历史语境（尤其在英国、美国等地）。当时有人因土地征收、噪音、安全、对传统生活方式与自然景观的影响而反对修铁路。","构词法：anti-（反对）+ railway（铁路）+ -ist（……主义者/……的人）。在现代语境里，更常用的表达是“anti-rail/anti-railway campaigner（反铁路人士）”或“opponent of railway expansion（反对铁路扩张者）”。"]}
{"word":"antirape","summary":{"en":"Anti-rape means opposing rape and supporting prevention or survivor-focused efforts.","zh":"antirape（常写作anti-rape）指反对强奸、支持预防与援助幸存者的行动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to rape; intended to prevent rape or support efforts against sexual violence.","zh":"反对强奸的；旨在预防强奸或支持反性暴力行动的。"},"examples":[{"en":"The city launched an anti-rape education program for high school students.","zh":"这座城市为高中生推出了反强奸教育项目。"},{"en":"She volunteered with an anti-rape organization that supports survivors.","zh":"她在一家反强奸组织做志愿者，为幸存者提供支持。"}]}],"synonyms":["anti–sexual violence","against rape","rape-prevention"],"phonetic":"/ˌæn.tiˈreɪp/","extraExplanation":["“anti-rape”更常见的拼写是加连字符的形式（anti-rape），也可写作“anti rape”。在正式写作中建议用连字符。","这是一个敏感话题相关词汇：在学习或表达时，常与“sexual assault（性侵）”“consent（同意）”“survivor（幸存者）”等词搭配；公共沟通中也常用“anti–sexual violence（反性暴力）”来涵盖更广。"]}
{"word":"antirational","summary":{"en":"Antirational means opposed to reason or not based on logic, often used in philosophy or cultural criticism.","zh":"Antirational 指“反理性的/不基于逻辑的”，常用于哲学或文化批评语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to or skeptical of reason and logical thinking as the best way to understand truth or make decisions.","zh":"反理性的；反对或怀疑“理性与逻辑思考”是理解真理或做决定的最佳方式。"},"examples":[{"en":"Some critics describe the movement as antirational because it values emotion over evidence.","zh":"一些批评者称该运动是反理性的，因为它重视情绪多于证据。"},{"en":"His antirational view rejects the idea that science can answer every human question.","zh":"他的反理性观点否认科学能回答所有人类问题。"}]},{"partOfSpeech":"adj.","definition":{"en":"not based on reason; ignoring logic or facts.","zh":"不合乎理性的；不基于逻辑或事实的。"},"examples":[{"en":"The policy was attacked as antirational and inconsistent with the data.","zh":"该政策被批评为反理性，与数据不一致。"},{"en":"Fear can lead to antirational decisions in a crisis.","zh":"在危机中，恐惧可能导致反理性的决定。"}]}],"synonyms":["anti-intellectual","anti-reason","illogical","nonrational"],"phonetic":"/ˌæntiˈræʃənəl/","extraExplanation":["“anti-”表示“反对”，加在“rational（理性的）”前构成“antirational（反理性的）”。","在哲学与文化讨论中，它常用来描述某些思潮强调直觉、信仰、传统或情感，认为“纯理性”不足以解释人生、宗教或艺术体验。它不一定等于“愚蠢”，更多是在讨论价值取向（例如反对把科学理性当作唯一标准）。","与“irrational（非理性的）”相比：irrational更常指“缺乏理性/不合逻辑”的行为或想法；antirational更常指“立场上反对理性至上”的态度或思想。"]}
{"word":"antirationalism","summary":{"en":"Antirationalism is the belief that reason alone cannot fully explain or justify truth, especially in human, moral, or religious matters.","zh":"反理性主义认为：仅靠理性无法充分解释或证明真理，尤其在人文、道德或宗教问题上。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A philosophical view that questions or rejects the idea that human reason is the main or most reliable way to gain truth, especially about life, meaning, morality, or religion.","zh":"反理性主义：一种哲学观点，质疑或否定“人类理性是获得真理的主要或最可靠途径”，尤其在生命意义、道德或宗教等问题上。"},"examples":[{"en":"Romantic writers are sometimes linked to antirationalism because they valued emotion and imagination over cold logic.","zh":"浪漫主义作家有时会被认为与反理性主义有关，因为他们更重视情感与想象，而不是冷冰冰的逻辑。"},{"en":"The movement was not against thinking; its antirationalism was a critique of reason as the only judge of truth.","zh":"这个运动并非反对思考；它的反理性主义是在批评“理性是评判真理的唯一标准”。"}]}],"synonyms":["irrationalism","anti-intellectualism (often used loosely, not always accurate)","anti-Enlightenment thought (context-dependent)"],"phonetic":"/ˌæn.tiˈræʃ.ə.nəˌlɪz.əm/","extraExplanation":["“反理性主义”不等于“反科学”或“反智”。它通常是在说：理性（推理、逻辑）有边界，某些领域还需要直觉、信仰、传统、体验或情感等其他认识方式。","在西方思想史中，它常与浪漫主义、存在主义，以及对启蒙时代“理性至上”态度的反动联系在一起。常被讨论的相关人物/思潮包括基尔凯郭尔（强调信仰的跳跃）、尼采（批判理性与道德体系）、柏格森（强调直觉）。","常见对立词是 rationalism（理性主义）。但两者不是简单的“对/错”，更多是关于“理性应扮演多大角色”的立场差异。"]}
{"word":"antirationalist","summary":{"en":"Antirationalist: someone (or something) opposed to the idea that reason is the main guide to truth, often emphasizing faith, emotion, tradition, or intuition.","zh":"Antirationalist：反理性主义者/反理性主义的，反对把理性当作通向真理的主要依据，常强调信仰、情感、传统或直觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who rejects or strongly doubts that human reason should be the main guide for knowledge, belief, or decision-making, often favoring faith, emotion, tradition, or intuition instead.","zh":"反理性主义者；指拒绝或强烈怀疑“人类理性应当是获取知识、形成信念或做决定的主要依据”的人，常更强调信仰、情感、传统或直觉。"},"examples":[{"en":"Some critics called him an antirationalist because he trusted intuition more than logical argument.","zh":"一些批评者称他为反理性主义者，因为他更相信直觉而不是逻辑论证。"},{"en":"In the debate, the antirationalist argued that faith can be deeper than reason.","zh":"在辩论中，这位反理性主义者认为信仰可以比理性更深刻。"}]},{"partOfSpeech":"adj.","definition":{"en":"Opposed to rationalism or to the idea that reason is the most reliable path to truth.","zh":"反理性主义的；反对理性主义或反对“理性是通向真理最可靠途径”的观点。"},"examples":[{"en":"His antirationalist tone made the essay feel more emotional than analytical.","zh":"他反理性主义的语气让这篇文章更像情绪表达而非分析论述。"},{"en":"The movement had an antirationalist streak, celebrating mystery and the unknown.","zh":"这个运动带有反理性主义倾向，赞美神秘与未知。"}]}],"synonyms":["anti-intellectual","anti-rational","irrationalist","fideist"],"phonetic":"/ˌæn.tiˈræʃ.ə.nə.lɪst/","extraExplanation":["“antirationalist”常用于哲学、神学与思想史语境，尤其在讨论启蒙运动（强调理性）之后的反动或反思时会出现。它不一定等于“反科学”，但常与“对理性/逻辑的限制、对非理性因素的强调”有关。","相关对比：rationalist（理性主义者）强调理性；empiricist（经验主义者）强调经验与观察；irrational（非理性的）更像对行为/想法的评价，而 antirationalist 更像一种立场或思想取向。"]}
{"word":"antirationalistic","summary":{"en":"Antirationalistic means opposing the view that reason should be the main guide, favoring intuition, emotion, or faith instead.","zh":"Antirationalistic 指反对以理性为主要依据，转而更强调直觉、情感或信仰。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to the idea that reason and logic should be the main guide in understanding truth, knowledge, or human behavior; emphasizing intuition, emotion, faith, or instinct instead.","zh":"反理性主义的：反对“理性与逻辑应当是理解真理、知识或人类行为的主要依据”的观点；更强调直觉、情感、信仰或本能等。"},"examples":[{"en":"Some critics describe the movement as antirationalistic because it values emotion over logic.","zh":"一些评论家认为这一运动是反理性主义的，因为它更重视情感而非逻辑。"},{"en":"He rejected purely mathematical models of society as too cold and antirationalistic in spirit.","zh":"他认为纯粹用数学模型解释社会过于冷冰冰，并在精神上带有反理性主义倾向。"},{"en":"In the novel, the villain’s antirationalistic thinking leads him to distrust science and experts.","zh":"在小说里，反派的反理性主义思维使他不信任科学与专家。"}]}],"synonyms":["anti-rational","irrationalist","nonrational","anti-intellectual (context-dependent)"],"phonetic":"/ˌæn.tiˌræʃ.ə.nəˈlɪs.tɪk/","extraExplanation":["“antirationalistic”常见于哲学、文学批评与思想史语境，用来描述对启蒙理性（Enlightenment rationalism）的反动或质疑。它并不一定等于“反科学”，更常指认为理性有局限、人生意义不能只靠逻辑推导。","词形拆解：anti-（反对）+ rational（理性的）+ -istic（……主义/倾向的）。写作中多用来概括一种“倾向/思潮”，语气往往偏批评，但也可能是中性描述。"]}
{"word":"antirationality","summary":{"en":"Antirationality means rejecting or distrusting reason and logic as guides for belief or action.","zh":"Antirationality 指拒绝或不信任理性与逻辑，把它们视为不应主导信念或行动的依据。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to, distrust of, or rejection of reason and logical thinking as the best way to understand the world or make decisions.","zh":"反理性；对理性与逻辑思维的反对、不信任或拒绝，认为它们并非理解世界或做决定的最佳方式。"},"examples":[{"en":"The article criticizes antirationality in public debates, where feelings replace evidence.","zh":"这篇文章批评公共辩论中的反理性现象——情绪取代了证据。"},{"en":"She worried that rising antirationality would weaken support for science and education.","zh":"她担心反理性的上升会削弱社会对科学与教育的支持。"},{"en":"In times of crisis, antirationality can spread quickly through rumors and fear.","zh":"在危机时期，反理性可能通过谣言与恐惧迅速蔓延。"}]}],"synonyms":["anti-intellectualism","rejection of reason","anti-scientific thinking","irrationalism"],"phonetic":"/ˌæn.tiˌræʃ.əˈnæl.ə.ti/","extraExplanation":["“antirationality”常见于学术或评论写作，尤其涉及哲学、政治传播与社会文化批评时。它不一定等同于“反科学”，但经常与反科学、阴谋论、以及对专家与证据的不信任同时出现。","与“irrationality（非理性）”不同：irrationality更像描述“缺乏理性”的状态或行为；antirationality强调一种更主动的态度或立场——对理性本身的排斥或贬低。","构词法：anti-（反对）+ rationality（理性）。在写作中也可见“anti-rational”作形容词，或用更常见的表达如“anti-intellectualism（反智主义）”“rejection of reason（拒绝理性）”。"]}
{"word":"antirationally","summary":{"en":"“Antirationally” means doing or speaking in a way that rejects logic or reason.","zh":"“antirationally”表示以反对理性、拒绝逻辑推理的方式行事或表达。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that opposes rational thinking, logic, or reasoning; in a manner that rejects the use of reason as a guide.","zh":"以反理性（反对理性、逻辑或推理）的方式；以拒绝用理性作为指导的方式。"},"examples":[{"en":"Some movements criticized the modern world and spoke antirationally about science and progress.","zh":"一些运动批评现代世界，并以反理性的方式谈论科学与进步。"},{"en":"He argued antirationally, insisting that feelings matter more than evidence.","zh":"他用反理性的方式辩论，坚持认为感受比证据更重要。"}]}],"synonyms":["irrationally","unreasonably","illogically","without reason","in an anti-rational way"],"phonetic":"/ˌæn.tiˈræʃ.ən.əl.i/","extraExplanation":["“antirationally”在日常英语中比较少见，更常见的表达是“in an anti-rational way / in an irrational way / without reasoning”。需要注意区分：anti-rational（反对理性作为原则）强调“立场/态度”，irrational（不理性）更常描述“行为/想法缺乏逻辑”。","词形结构：anti-（反、对抗）+ rational（理性的）+ -ly（副词后缀）。写作中有时会见到带连字符的形式“anti-rationally”。"]}
{"word":"antirattler","summary":{"en":"An antirattler is something (often a clip, pad, or device) that prevents parts from rattling and making noise.","zh":"antirattler 指用于防止零件晃动产生异响的卡扣、垫片或装置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device, pad, or modification designed to stop something (often metal parts) from shaking and making a rattling noise","zh":"防止零件晃动并发出“咔嗒/哐啷”响声的装置、垫片或改装件（常用于金属部件）"},"examples":[{"en":"The mechanic installed an antirattler on the exhaust heat shield.","zh":"修理工在排气管的隔热板上装了一个防松防响装置。"},{"en":"I added a rubber antirattler so the license plate wouldn’t buzz on bumpy roads.","zh":"我加了一个橡胶防响垫，这样车牌在颠簸路面就不会嗡嗡作响。"}]},{"partOfSpeech":"adj.","definition":{"en":"made or intended to prevent rattling noise","zh":"用于防止晃动异响的；防响的"},"examples":[{"en":"These antirattler clips keep the panel from vibrating.","zh":"这些防响卡扣能防止面板振动。"}]}],"synonyms":["anti-rattle clip","anti-rattle pad","noise-dampening clip","rattle preventer"],"phonetic":"/ˌæntiˈrætlər/","extraExplanation":["这个词通常写作 **anti-rattler / anti rattle**（更常见），多见于汽车、摩托车、自行车、家居五金等场景。意思不是“反对响尾蛇（rattler）”，而是“防止 rattling（咔嗒作响）”。","构词：**anti-**（防止、对抗）+ **rattler**（会发出 rattling 声的东西）。口语或产品名里常把它连写成 *antirattler*。"]}
{"word":"antireacting","summary":{"en":"Antireacting means “preventing or resisting a reaction,” usually in technical/chemical contexts.","zh":"Antireacting 指“抗反应、抑制反应”，多用于技术或化学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/technical) Designed to prevent or reduce a reaction (especially a chemical reaction), or to resist reacting.","zh":"（较少见/技术用语）用于防止或降低反应（尤其是化学反应），或表示“抗反应、不易起反应”的。"},"examples":[{"en":"The container has an antireacting coating to keep the metal from corroding.","zh":"这个容器有一层抗反应涂层，用来防止金属腐蚀。"},{"en":"They added an antireacting agent so the mixture would stay stable during storage.","zh":"他们加入了抗反应剂，让混合物在储存期间保持稳定。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle/gerund of the very rare verb “antireact” (to act against or prevent a reaction).","zh":"非常少见动词 antireact 的现在分词/动名词形式：指“对抗或阻止（某种）反应”。"},"examples":[{"en":"The additive is antireacting with the acid under normal conditions.","zh":"在正常条件下，这种添加剂会对抗酸的反应（阻止其反应）。"}]}],"synonyms":["nonreactive","inert","reaction-resistant","stabilizing"],"phonetic":"/ˌæn.ti.riˈæk.tɪŋ/","extraExplanation":["“antireacting”更常见的写法是加连字符的 **anti-reacting**，意思来自构词：**anti-（反、抗）+ reacting（反应的）**。在日常英语里，人们更常用 **nonreactive**（不易反应的）、**inert**（惰性的）、**reaction-resistant**（耐反应的）来表达类似意思。","如果你想表达“（人）不过度反应”，英语通常说 **not overreacting** 或 **calm**，而不是 *antireacting*。"]}
{"word":"antireaction","summary":{"en":"Antireaction means opposition to a reaction—especially a political/social conservative backlash—or, less commonly, a counter-reaction.","zh":"Antireaction 指对某种“反应”的反对，尤指对政治/社会层面的保守回潮（反动）的反对；较少见时也指“反作用/反向反应”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to a reaction (often a political or social “reaction,” meaning a conservative pushback against change).","zh":"对“反动/保守回潮”的反对（常指政治或社会层面，反对对变革的保守性回击）。"},"examples":[{"en":"The student group organized an antireaction movement after the government tightened controls.","zh":"政府收紧管控后，学生团体组织了一场反对反动回潮的运动。"},{"en":"Her speech argued that antireaction voices were essential for protecting civil rights.","zh":"她在演讲中强调，反对反动回潮的声音对保护公民权利至关重要。"}]},{"partOfSpeech":"n.","definition":{"en":"A counter-reaction; a response that works against an earlier reaction (less common, sometimes used in technical or general writing).","zh":"反作用；抵消先前反应的反应（较少见，可用于技术或一般写作）。"},"examples":[{"en":"The policy change triggered a strong public reaction—and an antireaction from groups who supported the original plan.","zh":"政策调整引发强烈公众反应——支持原方案的团体也出现了反作用/反向回应。"},{"en":"In the discussion, his antireaction calmed the situation instead of escalating it.","zh":"在讨论中，他的反向回应让局面降温，而不是升级。"}]}],"synonyms":["counterreaction","opposition","pushback","anti-backlash"],"phonetic":"ˌæntaɪriˈækʃən","extraExplanation":["“anti-”是英语常见前缀，意思是“反对、对抗”。“reaction”除了“反应”，在政治语境里还常指“反动、保守回潮（对进步改革的抵制）”。因此 antireaction 在社会政治文本里更容易理解为“反反动/反保守回潮”。","这个词在日常英语中不算常用，更常见的表达有：anti-conservative backlash（反对保守性反扑）、counterreaction（反作用/反向反应）、opposition to the reactionaries（反对反动派）。"]}
{"word":"antireactionaries","summary":{"en":"Antireactionaries are people who oppose reactionary politics and efforts to return to older social or political orders.","zh":"Antireactionaries 指反对反动政治与“恢复旧秩序”倾向的人（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who oppose reactionaries (those who want to return society to older, more conservative political or social systems)","zh":"反对反动派的人；反反动派（反对想让社会回到更旧、更保守制度的人）"},"examples":[{"en":"The antireactionaries argued for expanding voting rights and social reforms.","zh":"反反动派主张扩大选举权并推动社会改革。"},{"en":"In the debate, antireactionaries criticized policies that would roll back civil liberties.","zh":"在辩论中，反反动派批评会削弱公民自由的政策。"}]}],"synonyms":["anti-reactionists","progressives (context-dependent)","reformers (context-dependent)"],"phonetic":"/ˌæn.ti.rɪˈæk.ʃəˌnɛr.iz/","extraExplanation":["“antireactionaries”是复数形式；单数是“antireactionary”。","“reactionary（反动的/反动派）”常用于政治语境，指反对进步改革、希望恢复旧秩序的人；因此“anti-”+“reactionary”表示“反对反动（倾向）的人/立场”。","该词多见于政治评论、历史叙述或意识形态讨论中，语气往往带有立场色彩，使用时要注意语境与中立性。"]}
{"word":"antireactionary","summary":{"en":"Antireactionary means opposing reactionary (anti-reform, backward-looking) politics or ideas.","zh":"antireactionary 指反对反动（反改革、倒退倾向）政治或思想。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to reactionary politics or ideas (ideas that resist social or political change and favor a return to older systems).","zh":"反对反动政治或反动思想的（反动常指抵制社会/政治改革、倾向回到旧制度）。"},"examples":[{"en":"The group described itself as antireactionary and supportive of democratic reforms.","zh":"该团体称自己反对反动势力，并支持民主改革。"},{"en":"Her antireactionary stance made her a target of criticism from conservative hardliners.","zh":"她反对反动的立场使她成为保守强硬派批评的对象。"}]}],"synonyms":["anti-reactionary","opposed to reactionary ideas","anti-authoritarian (sometimes related)"],"phonetic":"/ˌæn.ti.riˈæk.ʃəˌnɛr.i/","extraExplanation":["“reactionary（反动的）”在英语里常用于政治语境，指强烈反对社会改革、希望恢复过去某种秩序的人或观点；因此“antireactionary”多见于政治评论、历史写作或意识形态讨论中。","构词法：anti-（反对）+ reactionary（反动的）。在日常英语里，更常用的表达是“anti-conservative”（反保守，语义不完全等同）或直接说“opposed to reactionary forces/ideas（反对反动势力/思想）”。"]}
{"word":"antireactive","summary":{"en":"Antireactive describes something designed to reduce or prevent a reaction, especially in medical or chemical contexts.","zh":"antireactive 指用于降低或预防某种“反应”的（尤用于医学或化学语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially in medicine or chemistry) reducing, preventing, or counteracting a reaction; intended to make something less reactive.","zh":"（尤用于医学或化学）降低、预防或抵消“反应”的；用于使某物不那么敏感/易反应的。"},"examples":[{"en":"The coating is antireactive, so the metal is less likely to corrode in salty air.","zh":"这种涂层具有抗反应性，因此金属在含盐空气中不太容易被腐蚀。"},{"en":"Some labs use antireactive additives to reduce unwanted chemical reactions during storage.","zh":"一些实验室会使用抗反应添加剂，以减少储存过程中不需要的化学反应。"},{"en":"The doctor chose an antireactive treatment to calm the patient’s allergic response.","zh":"医生选择了抗反应性治疗来缓解患者的过敏反应。"}]}],"synonyms":["nonreactive","reaction-inhibiting","inert","stabilizing"],"phonetic":"/ˌæntiɹiˈæktɪv/","extraExplanation":["“antireactive”在日常英语中不常见，更常见的表达包括：nonreactive（不反应的/惰性的）、anti-inflammatory（抗炎的）、anti-allergic/antihistamine（抗过敏的/抗组胺的）、reaction-inhibiting（抑制反应的）。","书写上有时会见到带连字符的形式“anti-reactive”。在学术或技术文本里，两者通常意思相近，具体以作者或期刊/行业写法为准。"]}
{"word":"antirealism","summary":{"en":"Antirealism is the view that reality or truth is not fully independent of human minds, language, or conceptual frameworks, especially in debates about science, math, or morality.","zh":"反實在論主張「現實／真理」不完全獨立於人類心靈、語言或概念框架，常見於科學、數學與道德等領域的討論。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A philosophical view that rejects or doubts the idea that reality (or truth) exists completely independent of our minds, language, or conceptual frameworks.","zh":"反實在論；一種哲學立場，否認或懷疑「現實／真理」能完全獨立於人類心靈、語言或概念框架而存在。"},"examples":[{"en":"In philosophy of science, antirealism says that scientific theories are mainly useful tools, not necessarily true descriptions of an unseen world.","zh":"在科學哲學中，反實在論認為科學理論主要是有用的工具，不一定是真正在描述一個看不見的世界。"},{"en":"She leans toward antirealism, arguing that what we call “facts” depends on how we describe and measure them.","zh":"她傾向反實在論，主張我們所謂的「事實」取決於我們如何描述與測量它們。"}]},{"partOfSpeech":"n.","definition":{"en":"More specifically, the view (common in debates about science, mathematics, morality, or art) that certain entities—like electrons, numbers, or moral facts—may not exist as mind-independent objects, even if talking about them is useful.","zh":"更具體地說（常見於科學、數學、道德或藝術的討論），認為某些事物——如電子、數字或道德事實——即使談論它們很有用，也未必作為「獨立於心靈」的客觀對象而存在。"},"examples":[{"en":"Mathematical antirealism treats numbers as products of human rules and practices rather than objects we discover.","zh":"數學反實在論把數字看作人類規則與實踐的產物，而不是我們「發現」到的客觀物。"},{"en":"Some forms of moral antirealism deny that moral truths exist independently of human values.","zh":"某些道德反實在論否認道德真理能獨立於人類價值而存在。"}]}],"synonyms":["anti-realism","instrumentalism (related)","constructivism (related)","nonrealism (related)"],"phonetic":"/ˌæn.tiˈriːəˌlɪzəm/","extraExplanation":["反實在論（antirealism）通常是用來對比「實在論（realism）」：實在論主張世界的某些結構或事實（例如自然定律、未觀測的粒子）即使沒有人類也仍然以同樣方式存在；反實在論則會說，我們對它們的「真／存在」的理解離不開觀測、語言、模型或社會實踐。","在英文學術語境中，antirealism 常出現在三個領域：科學哲學（是否相信理論中的不可觀測實體真的存在）、數學哲學（數字是否為客觀存在）、以及元倫理學（道德真理是否客觀）。不同領域的 antirealism 內部也有很多版本，並非單一主張。","常見相關術語：instrumentalism（工具論：理論重在「能用」）、constructivism（建構論：知識/意義由人類建構）、verificationism（可驗證論：意義/真理與可驗證性關聯）。"]}
{"word":"antirealist","summary":{"en":"Antirealist: opposing realism; believing that some kinds of truth or existence depend on minds, language, or practice rather than being fully mind-independent.","zh":"反实在论的／反实在论者：反对“实在论”，认为某些真理或存在在某种程度上依赖心灵、语言或实践，而非完全独立于人类。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(philosophy) Not believing that something (such as moral values, mathematical objects, or the external world as we describe it) exists independently of human minds, language, or conceptual schemes.","zh":"（哲学）反实在论的；认为某些事物（如道德价值、数学对象，或我们所描述的外部世界）不独立于人类心灵、语言或概念框架而存在。"},"examples":[{"en":"In metaethics, an antirealist may say moral facts are not objective features of the world.","zh":"在元伦理学中，反实在论者可能会说，道德事实不是世界中客观存在的属性。"},{"en":"She takes an antirealist view of scientific theories, treating them as useful models rather than literal descriptions of reality.","zh":"她对科学理论采取反实在论观点，把理论当作有用的模型，而非对现实的字面描述。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who holds antirealist views, especially in philosophy (for example, about truth, science, or morality).","zh":"反实在论者；持反实在论立场的人（尤指在真理、科学或道德等哲学议题上）。"},"examples":[{"en":"As an antirealist, he argues that truth depends on our ways of verifying or justifying claims.","zh":"作为反实在论者，他主张真理取决于我们验证或论证主张的方式。"},{"en":"The debate between the realist and the antirealist shaped the entire seminar.","zh":"实在论者与反实在论者的争论贯穿了整个研讨课。"}]}],"synonyms":["anti-realist","nonrealist","instrumentalist (in science contexts)","constructivist (in some contexts)"],"phonetic":"/ˌæntiˈriːəlɪst/","extraExplanation":["“antirealist”常见于分析哲学语境，相关话题包括：科学反实在论（把理论看作预测工具而非“揭示本体”）、道德反实在论（否认独立客观的道德事实）、数学反实在论（对抽象对象的独立存在持怀疑态度）。","不要把“反实在论”简单理解为“否认世界存在”。很多反实在论立场并不否认有外部世界，而是质疑：我们的语言/理论是否能以“独立于人类”的方式准确对应世界，或认为“真/实在”的标准与人类实践（证成、可验证性、语用价值等）有关。"]}
{"word":"antirealistic","summary":{"en":"“Antirealistic” describes art, writing, or style that deliberately avoids realism.","zh":"antirealistic 指在艺术、文学等表达上刻意避免写实（现实主义）的风格或倾向。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not realistic; not aiming to show life exactly as it appears.","zh":"反现实主义的；不追求按真实生活原样呈现的。"},"examples":[{"en":"The director chose an antirealistic style with dreamlike colors and exaggerated acting.","zh":"导演选择了反现实主义的风格，用梦幻般的色彩和夸张的表演。"},{"en":"In antirealistic art, the goal is often to express emotion rather than everyday reality.","zh":"在反现实主义艺术中，目标常常是表达情感，而不是日常现实。"}]},{"partOfSpeech":"adj.","definition":{"en":"Opposed to realism as an artistic or literary approach.","zh":"（在艺术或文学上）反对现实主义流派/手法的。"},"examples":[{"en":"Some critics call the novel antirealistic because it ignores ordinary details of time and place.","zh":"一些评论家称这部小说反现实主义，因为它忽略了时间与地点的日常细节。"},{"en":"His antirealistic preferences pushed him toward symbolism and surreal imagery.","zh":"他反现实主义的偏好让他转向象征主义与超现实意象。"}]}],"synonyms":["nonrealistic","anti-realistic","unrealistic (often different in nuance)","surreal","symbolic"],"phonetic":"/ˌæn.ti.riˈlɪs.tɪk/","extraExplanation":["“anti-”表示“反对、对立”，加在“realistic（现实的）”前形成“antirealistic（反现实的）”。常见于艺术、电影、戏剧、文学批评中，用来描述一种刻意不按“现实主义”规则来呈现世界的风格。","它不一定等同于“unrealistic（不现实的、不切实际的）”。“unrealistic”常用于评价想法或计划不可能实现；而“antirealistic”更偏向“审美与表达方式的选择”，强调“有意不写实”。"]}
{"word":"antirealistically","summary":{"en":"Antirealistically means “in a way that goes against realism,” especially as an intentional style in art or writing.","zh":"antirealistically 指“以反现实主义（不写实）的方式”，多用于艺术或写作风格，强调刻意不追求真实再现。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that rejects or goes against realism; not aiming to show things as they are in real life (often in art, literature, film, or philosophy).","zh":"以反现实主义的方式；不追求如实呈现现实生活中的样子（常用于艺术、文学、电影或哲学语境）。"},"examples":[{"en":"The director used color and lighting antirealistically to create a dreamlike mood.","zh":"导演以反现实主义的方式运用色彩和灯光，营造出梦境般的氛围。"},{"en":"The novel describes the city antirealistically, making it feel more like a symbol than a real place.","zh":"这部小说以反现实主义的方式描写城市，使它更像一个象征而非真实地点。"}]},{"partOfSpeech":"adv.","definition":{"en":"In an unrealistic or implausible way (emphasizing deliberate opposition to realism rather than simple inaccuracy).","zh":"以不真实或不合常理的方式（强调“刻意反现实”，而不只是“说得不准确”）。"},"examples":[{"en":"Some critics argue the characters behave antirealistically, but the exaggeration is intentional.","zh":"一些评论家认为人物行为反现实、不够真实，但这种夸张是刻意为之。"}]}],"synonyms":["unrealistically","nonrealistically","surreally","stylizedly"],"phonetic":"/ˌæn.ti.riˈə.lɪs.tɪk.li/","extraExplanation":["“antirealistically”比较少见，更常见的相关词是“anti-realistic / anti-realism / antirealism”。在评论艺术作品时，它通常带有“有意不写实”的意思，而不是单纯“写错了、不像真的”。","常见搭配语境：theatrical/visual style（戏剧化/视觉风格）、surreal or symbolic effects（超现实/象征效果）、philosophical realism（哲学上的实在论）等。"]}
{"word":"antireality","summary":{"en":"Antireality means rejecting or denying what is real, or using an intentionally unrealistic style in art and storytelling.","zh":"Antireality 指否认/逃避现实的倾向，也可指艺术或叙事中刻意不写实的风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to, denial of, or rejection of what is real; a mindset or style that treats reality as unimportant, unreal, or something to be escaped.","zh":"反现实（观念）；否认、排斥或逃避现实的态度或风格。"},"examples":[{"en":"Some critics say the film’s glossy fantasy is a kind of antireality, designed to help viewers forget everyday problems.","zh":"一些评论家说，这部电影华丽的幻想是一种“反现实”，旨在让观众忘记日常问题。"},{"en":"Her posts promote antireality by spreading conspiracy stories instead of checking facts.","zh":"她的帖子通过传播阴谋故事而不是核查事实来鼓吹反现实。"}]},{"partOfSpeech":"n.","definition":{"en":"In art or literature, an approach that intentionally breaks from realistic depiction and emphasizes the artificial, surreal, or dreamlike.","zh":"（艺术/文学）反写实倾向；刻意偏离真实再现，强调人为、超现实或梦境感的创作方式。"},"examples":[{"en":"The novel mixes daily life with antireality, so you’re never sure what is memory and what is imagination.","zh":"这部小说把日常生活与反现实混在一起，让你分不清哪些是记忆，哪些是想象。"},{"en":"Avant‑garde theater often uses antireality to question what we call “normal.”","zh":"前卫戏剧常用反现实来质疑我们所谓的“正常”。"}]}],"synonyms":["denial of reality","escapism","unreality","anti-realism"],"phonetic":"/ˌæn.ti.riˈæl.ə.ti/","extraExplanation":["“anti-”表示“反、对抗”，“reality”表示“现实”。因此 antireality 常用于批评语境，指“逃避/否认现实”的倾向（例如虚假信息、阴谋论、过度粉饰的媒体内容）。","这不是一个非常常用的日常词，更常见的替代说法有：denial of reality（否认现实）、escapism（逃避现实）、anti-realism（反实在论/反写实，偏学术或艺术语境）。"]}
{"word":"antirebating","summary":{"en":"Antirebating means forbidding or opposing undisclosed rebates or special incentives, especially in insurance sales.","zh":"Antirebating 指（尤指保险销售中）禁止或反对未披露的返利、回扣或特殊优惠。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Especially in insurance) prohibiting or opposing the practice of giving rebates—such as returning part of a premium, paying a customer’s fees, or offering special discounts—not clearly stated in the official policy terms.","zh":"（尤指保险行业）反回扣的；禁止或反对“返利/回扣”做法的——例如退还部分保费、替客户支付费用或提供未写入正式保单条款的特殊优惠。"},"examples":[{"en":"The company adopted strict antirebating rules to ensure every customer was treated fairly.","zh":"公司采用严格的反回扣规定，以确保每位客户都被公平对待。"},{"en":"Some states have antirebating laws that limit what gifts an agent can offer.","zh":"一些州有反回扣法律，限制代理人可以赠送的礼品范围。"},{"en":"The regulator investigated whether the “free months” promotion violated antirebating requirements.","zh":"监管机构调查“免费几个月”的促销是否违反反回扣要求。"}]}],"synonyms":["anti-rebate","non-rebating","rebate-prohibiting"],"phonetic":"/ˌæn.tiˈreɪ.bə.tɪŋ/","extraExplanation":["“antirebating”常见于美国保险监管语境。许多州的反回扣规定（anti-rebating laws）旨在防止代理人用未披露的返利或赠品诱导投保，从而减少误导销售与不公平竞争，并维护“同类客户同等费率与条款”的原则。具体允许的赠品价值、折扣形式与例外情况因州而异。"]}
{"word":"antirecession","summary":{"en":"“Antirecession” describes policies or actions meant to fight an economic downturn.","zh":"“antirecession”指旨在对抗或缓解经济衰退的（政策、措施等）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Intended to prevent or reduce a recession (an economic downturn).","zh":"用于防止或减轻经济衰退（经济下行）的；抗衰退的。"},"examples":[{"en":"The government introduced antirecession measures to support jobs and small businesses.","zh":"政府推出了抗衰退措施，以支持就业和小企业。"},{"en":"Some analysts say the central bank needs a stronger antirecession policy this year.","zh":"一些分析人士认为央行今年需要更强有力的抗衰退政策。"}]},{"partOfSpeech":"n.","definition":{"en":"A policy, plan, or action designed to prevent or lessen a recession.","zh":"旨在预防或缓解经济衰退的政策、方案或行动；抗衰退举措。"},"examples":[{"en":"Tax cuts and public spending can be used as antirecession tools.","zh":"减税和公共支出可以作为抗衰退工具。"},{"en":"The package was marketed as an antirecession, pro-growth program.","zh":"该方案被宣传为抗衰退、促增长的项目。"}]}],"synonyms":["anti-recession","counter-recession","recession-fighting","recession-proof (related)"],"phonetic":"/ˌæn.ti.rɪˈsɛʃ.ən/","extraExplanation":["“antirecession”由前缀 anti-（反对、对抗）+ recession（经济衰退）构成，常见于新闻与经济评论中，多用作形容词修饰 policy/measures/plan/package 等。","更常见、更自然的说法包括：anti-recession（带连字符）、counter-recession、recession-fighting，以及更口语的 recession-proof（偏“耐衰退/抗冲击”的含义）。"]}
{"word":"antirecruiting","summary":{"en":"Antirecruiting means opposing recruiting—most often military recruiting—or actions meant to discourage people from joining.","zh":"Antirecruiting 指反对招募（多指军队招募/征兵），或旨在劝阻他人加入的行动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to recruiting (especially military recruiting), or intended to discourage people from joining.","zh":"反对招募（尤指军队征兵或军队招募）的；旨在劝阻人们加入的。"},"examples":[{"en":"The group organized an antirecruiting campaign outside the high school.","zh":"该组织在高中校外发起了一场反招募活动。"},{"en":"She handed out antirecruiting flyers near the military recruiting office.","zh":"她在征兵/招募办公室附近分发反招募传单。"},{"en":"The documentary takes an antirecruiting stance by focusing on veterans’ stories.","zh":"这部纪录片通过聚焦退伍军人的经历，呈现出反招募立场。"}]},{"partOfSpeech":"n.","definition":{"en":"the act, policy, or movement of opposing recruiting; efforts to discourage recruitment.","zh":"反招募行为/政策/运动；旨在阻止或劝阻招募的行动。"},"examples":[{"en":"Antirecruiting became more visible on campuses during the war.","zh":"战争期间，校园里的反招募行动更为显眼。"},{"en":"The city debated whether antirecruiting protests should be allowed at public events.","zh":"该市就公共活动中是否应允许反招募抗议进行了讨论。"}]}],"synonyms":["anti-recruitment","anti-enlistment","counter-recruitment","anti-draft (related, not identical)"],"phonetic":"/ˌæn.ti.rɪˈkruː.tɪŋ/","extraExplanation":["“antirecruiting”常见于美国社会语境，尤其与军方在高中、大学设点招募有关；相关讨论常涉及言论自由、校园政策、以及对服役风险与福利的不同看法。","拼写上也常见“anti-recruiting”（加连字符），表示同一概念；在正式写作里加连字符更常见。"]}
{"word":"antired","summary":{"en":"“Antired” is mainly a cosmetic term meaning anti-redness (reduces skin redness).","zh":"“antired”主要是护肤品用语，意思是“抗泛红/减红（减少皮肤发红）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Not a standard dictionary word) Used mainly in skincare/cosmetics to mean “anti-redness”: designed to reduce or prevent skin redness.","zh":"（非标准词，常见于护肤/化妆品用语）指“抗泛红/减红”：用于减少或预防皮肤发红。"},"examples":[{"en":"This cream has an antired formula to calm sensitive skin.","zh":"这款面霜含有抗泛红配方，用来舒缓敏感肌。"},{"en":"Look for antired ingredients like niacinamide or centella.","zh":"可以找含烟酰胺或积雪草等抗泛红成分的产品。"}]}],"synonyms":["anti-redness","redness-reducing","soothing","calming"],"phonetic":"/ˌæntaɪ ˈrɛd/","extraExplanation":["“antired”多见于产品标签或营销文案，正式写法更常见的是“anti-redness”或“anti-red (redness)”。","如果你想表达“（人）不疲倦/不累”，英语通常说“untired”或“not tired”，而不是“antired”。"]}
{"word":"antiredeposition","summary":{"en":"Antiredeposition means preventing removed dirt from settling back onto a surface, especially in washing or cleaning.","zh":"Antiredeposition 指在清洗/洗涤过程中防止已去除的污垢再次沉积回表面或衣物上。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the prevention of removed dirt or particles from settling back onto a surface, especially during washing","zh":"防再沉积；防止已去除的污垢/颗粒在清洗过程中再次沉回到表面（尤指洗涤时）"},"examples":[{"en":"Modern laundry detergents are designed to improve antiredeposition so clothes don’t look gray after washing.","zh":"现代洗衣粉/洗衣液会强化防再沉积性能，让衣物洗后不发灰。"},{"en":"Good antiredeposition helps keep soil suspended in the wash water until it is rinsed away.","zh":"良好的防再沉积能让污垢保持悬浮在洗涤水中，直到被漂洗带走。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing an ingredient or feature that prevents dirt from redepositing (used mainly in product and technical descriptions)","zh":"防再沉积的；指能防止污垢再次沉积的成分或特性（多用于产品/技术描述）"},"examples":[{"en":"The formula includes an antiredeposition polymer to reduce soil back-transfer.","zh":"该配方含有防再沉积聚合物，以减少污垢回迁。"}]}],"synonyms":["soil-suspending (property)","anti-redeposition (variant spelling)","anti-grayness (marketing term)"],"phonetic":"/ˌæn.tiˌriː.də.pəˈzɪʃ.ən/","extraExplanation":["这个词常见于洗涤剂、纺织品清洗和表面清洁的说明书或论文。核心概念是：把污垢“抓下来”只是第一步，还要让它在水里保持分散/悬浮，避免又黏回衣物或表面。","实现方式常与“分散剂/聚合物”有关（例如某些纤维素衍生物或其他聚合物），它们会在纤维表面形成保护层，或把污垢颗粒包裹起来，降低再次附着的机会。","相关常见表达：antiredeposition agent（防再沉积剂）、soil redeposition（污垢再沉积）、anti-grayness（防发灰，偏商品文案用法）。"]}
{"word":"antireducer","summary":{"en":"An antireducer is something that prevents or counteracts chemical reduction.","zh":"antireducer 指防止或抵消化学“还原反应”的物质或手段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance or agent that prevents reduction (gain of electrons) or counteracts a reducing agent; in practice, often something that protects materials from being chemically reduced.","zh":"抗还原剂；防还原物质：指防止发生“还原反应”（获得电子）或抵消还原剂作用的物质/手段；实际使用中常指用于防止材料被化学还原的保护剂。"},"examples":[{"en":"The coating contains an antireducer to protect the metal surface during storage.","zh":"这种涂层含有抗还原剂，用来在储存期间保护金属表面。"},{"en":"In some processes, an antireducer is added to slow unwanted reduction reactions.","zh":"在一些工艺中，会加入抗还原剂来减缓不希望发生的还原反应。"}]}],"synonyms":["antireductant","oxidizing agent (context-dependent)","reduction inhibitor"],"phonetic":"/ˌæn.ti.rɪˈduː.sɚ/","extraExplanation":["“antireducer”不是日常英语常用词，更常见的相关词是“oxidizing agent（氧化剂）”“antioxidant（抗氧化剂）”或更学术的“antireductant（抗还原剂）”。它的构词很直观：anti-（反/抗）+ reducer（还原剂/使…还原的东西）。具体含义会随学科语境（化学、材料、工业工艺等）而变化。"]}
{"word":"antireducing","summary":{"en":"Antireducing means resisting or preventing chemical reduction (or lowering a material’s reducing power).","zh":"antireducing 指“抗还原的”，即防止化学还原发生（或降低材料的还原性）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Preventing or resisting reduction (a chemical process in which a substance gains electrons or loses oxygen).","zh":"抗还原的；防止或抑制“还原”（一种化学过程：物质得电子或失氧）的。"},"examples":[{"en":"The coating has antireducing properties that help protect the metal surface.","zh":"这种涂层具有抗还原性能，有助于保护金属表面。"},{"en":"Researchers tested an antireducing additive to keep the compound from being reduced during storage.","zh":"研究人员测试了一种抗还原添加剂，以防止该化合物在储存过程中被还原。"}]},{"partOfSpeech":"adj.","definition":{"en":"(In a looser, practical sense) Designed to reduce the “reducing power” of a material, limiting its ability to act as a reducing agent.","zh":"（较宽泛的用法）用于降低材料的“还原性/还原能力”，限制其作为还原剂的作用的。"},"examples":[{"en":"An antireducing treatment can stabilize pigments that are sensitive to reducing conditions.","zh":"抗还原处理可以稳定那些对还原环境敏感的颜料。"},{"en":"The formula includes antireducing ingredients to improve shelf life.","zh":"该配方包含抗还原成分，以提高保质期。"}]}],"synonyms":["anti-reduction","reduction-resistant","oxidizing (context-dependent)"],"phonetic":"/ˌæntaɪ rɪˈdusɪŋ/","extraExplanation":["“anti-”表示“反、抗”。“reducing”来自“reduce（还原）”。因此 antireducing 常见于化学、材料、涂层、颜料与工业配方语境，意思不是“减少”，而是“防止发生还原反应”。","在氧化还原反应里，“还原”与“氧化”成对出现。实际文本中 antireducing 往往暗示该物质/工艺倾向于维持氧化态或抑制还原环境，但是否等同于“氧化性强”要看具体体系与条件。"]}
{"word":"antireductant","summary":{"en":"Antireductant means an oxidizing agent that prevents reduction by accepting electrons.","zh":"antireductant 指“抗还原剂”，也就是通过接受电子来阻止还原发生的氧化剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance or agent that prevents reduction (gain of electrons) by acting as an oxidizing agent; an oxidant.","zh":"（化学）抗还原剂；通过充当氧化剂来阻止“还原（得电子）”发生的物质；氧化剂。"},"examples":[{"en":"In this reaction, oxygen acts as an antireductant, pulling electrons away from the metal.","zh":"在这个反应中，氧气充当抗还原剂，把电子从金属那里“拉走”。"},{"en":"Chemists may add an antireductant to keep a solution from being reduced during storage.","zh":"化学家可能会加入抗还原剂，以防溶液在储存过程中被还原。"}]}],"synonyms":["oxidant","oxidizing agent","electron acceptor"],"phonetic":"/ˌæntaɪrɪˈdʌktənt/","extraExplanation":["这个词在英文里非常少见；实际写作与教材中更常用的是 oxidant / oxidizing agent（氧化剂）。","理解方式：reductant（还原剂）= 提供电子、让别的物质被还原；antireductant（抗还原剂）≈ oxidant（氧化剂）= 接受电子、让别的物质被氧化。"]}
{"word":"antireduction","summary":{"en":"Antireduction means preventing a substance from undergoing chemical reduction, often used in scientific contexts.","zh":"Antireduction 指“抗还原/防止还原反应”，多用于化学与材料等学术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the prevention of reduction (a chemical process in which a substance gains electrons or loses oxygen), or a property/process designed to stop something from being reduced","zh":"抗还原；防止“还原反应”的作用或性质（还原指物质得电子或失氧的化学过程）"},"examples":[{"en":"The coating provides antireduction protection, helping the metal resist chemical changes.","zh":"这种涂层具有抗还原保护作用，帮助金属抵抗化学变化。"},{"en":"In battery research, antireduction strategies can improve the stability of the electrode surface.","zh":"在电池研究中，抗还原策略可以提高电极表面的稳定性。"}]},{"partOfSpeech":"adj.","definition":{"en":"(as a modifier) intended to prevent reduction","zh":"（作定语）用于防止发生还原反应的"},"examples":[{"en":"They developed an antireduction layer to protect the catalyst.","zh":"他们开发了一层抗还原层来保护催化剂。"}]}],"synonyms":["reduction prevention","reduction resistance","anti-reducing"],"phonetic":"/ˌæntiɹɪˈdʌkʃən/","extraExplanation":["这个词在日常英语中很少见，更常出现在化学、材料、电池与催化等学术语境里。写作中也常见带连字符的形式：anti-reduction。","理解时可对照“oxidation（氧化）/ reduction（还原）”。“抗还原”并不等同于“抗氧化（antioxidation/antioxidant）”，两者方向不同：一个强调防止被还原，另一个强调防止被氧化。"]}
{"word":"antireductive","summary":{"en":"Antireductive means opposing reductionist explanations and emphasizing that some things can’t be fully explained by their parts alone.","zh":"Antireductive 指反对还原论式解释，强调有些事物不能只靠其组成部分来完全说明。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposing reductionism; insisting that something (like a mind, society, or artwork) cannot be fully explained by breaking it down into simpler parts alone.","zh":"反对还原论的；认为某些事物（如心智、社会或艺术）不能仅靠拆分为更简单的部分就被完全解释。"},"examples":[{"en":"Her antireductive view of mental health considers biology, relationships, and culture together.","zh":"她对心理健康的反还原论观点会把生物因素、人际关系和文化一起考虑。"},{"en":"The paper argues for an antireductive approach to language learning, not just memorizing grammar rules.","zh":"这篇论文主张用反还原论的方法看待语言学习，而不只是死记语法规则。"},{"en":"Many readers find poetry antireductive because its meaning can’t be reduced to one clear paraphrase.","zh":"很多读者觉得诗歌是反还原论的，因为它的意义无法被化约成一种明确的改写。"}]}],"synonyms":["nonreductive","anti-reductionist","holistic","integrative"],"phonetic":"/ˌæn.ti.rɪˈdʌk.tɪv/","extraExplanation":["“antireductive”常见于哲学、心理学、社会科学与文学批评语境，常与“reductionism（还原论）”对比：还原论倾向用更底层、更简单的机制（例如基因、神经元、经济动机）来解释复杂现象；反还原论强调“整体层面”的性质（意义、意识、文化、价值）可能无法被完全等同为底层之和。","词形结构：anti-（反对）+ reductive（还原性的、化约的）。写作中也可见近义表达如“non-reductive（非还原的）”。"]}
{"word":"antireflective","summary":{"en":"Antireflective means “made to reduce reflections/glare,” often describing coatings on glasses, lenses, or screens.","zh":"Antireflective 指“防反射/减少反光与眩光的”，常用于描述眼镜、镜头或屏幕的涂层。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to reduce reflections and glare from a surface (especially glass), so you can see through it more clearly.","zh":"（尤指玻璃表面）防反射的；减少反光和眩光，使透过更清晰。"},"examples":[{"en":"These glasses have an antireflective coating, so computer screens look clearer.","zh":"这副眼镜有防反射涂层，所以看电脑屏幕更清楚。"},{"en":"The camera lens uses antireflective glass to reduce glare in bright light.","zh":"这个相机镜头使用防反射玻璃，在强光下能减少眩光。"}]}],"synonyms":["anti-reflective","non-reflective","anti-glare","low-reflectance"],"phonetic":"/ˌæn.ti.rɪˈflɛk.tɪv/","extraExplanation":["在日常使用中更常见的写法是 hyphenated（带连字符）形式：anti-reflective。也常见同义表达：anti-glare（防眩光的）、AR coating（防反射涂层，AR=anti-reflective）。","在眼镜行业里，antireflective coating 指镜片表面的多层薄膜涂层，能减少镜片前后表面的反射，让别人更容易看到你的眼睛，也能提高夜间行车或看屏幕时的清晰度。"]}
{"word":"antireflexive","summary":{"en":"Antireflexive means “not able to refer back to the subject,” especially for pronouns in linguistics.","zh":"Antireflexive 指“不能回指主语（不能指向自己）”，多用于语言学中描述代词等形式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Linguistics) describing a pronoun or form that cannot refer back to the subject of the same clause; the opposite of reflexive.","zh":"（语言学）指一种代词或形式不能回指同一分句的主语；与“反身（reflexive）”相对。"},"examples":[{"en":"In English, \"him\" is antireflexive in \"John saw him\"—it normally cannot mean John saw himself.","zh":"在英语里，“John saw him”中的“him”通常是反反身的——一般不能表示“John看见了他自己”。"},{"en":"Some languages have special antireflexive pronouns that must refer to someone else, not the subject.","zh":"有些语言有专门的反反身代词，必须指向“别人”而不是主语。"}]}],"synonyms":["non-reflexive","anti-reflexive"],"phonetic":"/ˌæntiɹɪˈflɛksɪv/","extraExplanation":["“antireflexive”主要用于语言学讨论（尤其是代词指代与句法约束）。它关注的是“同一小句内是否允许回指主语”。例如英语里，反身代词（reflexive）如 himself 明确回指主语；而普通宾格代词 him 通常不用于回指主语（除非在特定结构或语境下）。","相关概念常与“反身（reflexive）/非反身（non-reflexive）”“指代（coreference）”“约束理论（binding）”等一起出现。初学者可先把它理解为：一种形式“必须指别人，不能指自己”。"]}
{"word":"antireform","summary":{"en":"Antireform means opposing reform, or a person/group that resists reform.","zh":"antireform 指“反改革的”，也可指“反对改革的人或势力”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to political, social, or institutional reform; resisting changes meant to improve a system.","zh":"反改革的；反对（政治、社会或制度）改革的；抵制改良措施的。"},"examples":[{"en":"The proposal faced strong antireform arguments from some lawmakers.","zh":"这项提案遭到一些立法者强烈的反改革论调。"},{"en":"In times of crisis, antireform voices may call for keeping things the way they are.","zh":"在危机时期，反改革的声音可能会主张维持现状。"}]},{"partOfSpeech":"n.","definition":{"en":"A person, group, policy, or movement that opposes reform.","zh":"反改革者；反改革的团体/政策/运动。"},"examples":[{"en":"Antireform forces tried to block the new education law.","zh":"反改革势力试图阻止新的教育法。"},{"en":"The debate became polarized between reformers and antireform groups.","zh":"这场争论在改革派与反改革团体之间变得两极化。"}]}],"synonyms":["anti-reform","reactionary","conservative","status-quo","counterreform"],"phonetic":"/ˌæn.ti.rɪˈfɔrm/","extraExplanation":["“anti-”是常见前缀，表示“反对、抵制”，因此 antireform 通常用于政治与公共政策语境，指反对制度性改变的一方或立场。","在新闻与评论写作中，这个词往往带有评价色彩（暗示“阻挠进步”或“保守”），使用时可根据语境改用更中性的说法，如 “skeptical of reform（对改革持怀疑态度）”。"]}
{"word":"antireformer","summary":{"en":"An antireformer is a person (or viewpoint) that opposes reforms and resists change aimed at improving a system.","zh":"antireformer 指反对改革、抵制旨在改进制度的变革的人（或立场）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposes political or social reforms; someone who resists change meant to improve a system","zh":"反改革者；反对政治或社会改革的人；抵制旨在改进制度的变革者"},"examples":[{"en":"The antireformers argued that the proposed law would weaken tradition.","zh":"反改革者认为这项拟议法律会削弱传统。"},{"en":"In the debate, she was labeled an antireformer because she rejected any changes to the voting system.","zh":"在辩论中，她因拒绝对投票制度作任何改变而被贴上“反改革者”的标签。"}]},{"partOfSpeech":"adj.","definition":{"en":"opposing reform; resistant to reform efforts","zh":"反改革的；反对改革努力的"},"examples":[{"en":"An antireformer faction in the party blocked the policy update.","zh":"党内的反改革派系阻止了政策更新。"}]}],"synonyms":["opponent of reform","reactionary","conservative"],"phonetic":"/ˌæntiˈrɪˌfɔrmər/","extraExplanation":["这个词常见于政治与历史语境，带有一定评价色彩：说某人是 antireformer 往往暗示其“阻碍进步/拒绝必要改变”。更中性时可用 “opponent of reform（改革反对者）”或直接说明其立场。","构词法：anti-（反对）+ reformer（改革者）。在写作中常与 “reformer / progressive / conservative / reactionary（改革者/进步派/保守派/反动派）”等词对照使用。"]}
{"word":"antireforming","summary":{"en":"Antireforming means opposing reforms, or (historically) resisting religious reform movements.","zh":"antireforming 指“反对改革的”；在历史语境中也指“抵制宗教改革的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to making reforms (changes meant to improve a system), or working to stop or reverse reforms.","zh":"反对改革的；阻止或扭转改革的。"},"examples":[{"en":"Some lawmakers took an antireforming stance and voted against the new transparency rules.","zh":"一些立法者采取反对改革的立场，投票反对新的透明度规定。"},{"en":"The report warns that antireforming policies can weaken public trust.","zh":"报告警告说，反改革政策会削弱公众信任。"}]},{"partOfSpeech":"adj.","definition":{"en":"In historical writing, describing forces that resisted religious reform, especially during or after the Protestant Reformation.","zh":"（历史语境）指抵制宗教改革的力量，尤指新教改革时期及其后。"},"examples":[{"en":"The essay contrasts reforming and antireforming movements in sixteenth-century Europe.","zh":"这篇文章对比了16世纪欧洲的改革派与反改革派运动。"},{"en":"Some antireforming leaders tried to preserve older church practices.","zh":"一些反改革派领袖试图保留更早的教会做法。"}]}],"synonyms":["anti-reform","reactionary","reform-resistant","counterreform (historical)"],"phonetic":"/ˌæntaɪrɪˈfɔrmɪŋ/","extraExplanation":["“antireforming”常见写法也会加连字符作“anti-reforming”，意思更直观：anti-（反）+ reform（改革）+ -ing（形容词/分词形式）。在学术或新闻文本里，多用于描述“反改革”的立场、政策或势力。"]}
{"word":"antireformist","summary":{"en":"Antireformist means ‘opposed to reform’ or ‘a person who opposes reform.’","zh":"antireformist 指“反对改革的（人/立场）”，也可指“反改革者”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to reform (changes meant to improve a system), especially in politics, religion, or institutions.","zh":"反改革的；反对（旨在改进制度的）改革，尤指政治、宗教或机构中的改革。"},"examples":[{"en":"The senator took an antireformist position and voted against the election law changes.","zh":"这位参议员采取反改革立场，投票反对选举法的修改。"},{"en":"Some antireformist voices argued that the old system should be preserved exactly as it was.","zh":"一些反改革的声音认为旧制度应当原封不动地保留。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who opposes reform.","zh":"反改革者；反对改革的人。"},"examples":[{"en":"Reformers and antireformists debated for hours in the city council meeting.","zh":"在市议会会议上，改革派与反改革者辩论了好几个小时。"}]}],"synonyms":["anti-reform","reactionary","conservative","traditionalist","status-quo"],"phonetic":"/ˌæn.ti.rɪˈfɔr.mɪst/","extraExplanation":["“antireformist”由前缀 anti-（反对）+ reform（改革）+ -ist（……主义者/……者）构成，常用于描述在政治或社会议题上倾向维持现状（status quo）的人或立场。","在历史与新闻语境中，它常带有评价色彩：支持改革的一方可能用它来批评阻挠改变的人；而被称为 antireformist 的人也可能自称是在“维护传统/稳定”。阅读时可留意说话者立场与语气。"]}
{"word":"antireligion","summary":{"en":"Antireligion means opposition to religion or to religion’s influence.","zh":"antireligion 指反对宗教或反对宗教影响社会的立场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to religion, or the belief that religion is harmful or should not influence society.","zh":"反宗教；反对宗教的立场，或认为宗教有害/不应影响社会的观点。"},"examples":[{"en":"His essays were criticized for their antireligion tone.","zh":"他的文章因带有反宗教的语气而受到批评。"},{"en":"Some people confuse antireligion with simple nonbelief.","zh":"有些人把反宗教和单纯的不信宗教混为一谈。"}]}],"synonyms":["anti-religiousness","opposition to religion","anti-clericalism (related)"],"phonetic":"/ˌæn.t̬i.rɪˈlɪdʒ.ən/","extraExplanation":["“antireligion”由前缀 anti-（反对）+ religion（宗教）构成，常见于政治、社会学与公共讨论语境。它通常比“atheism（无神论）”更强调“反对宗教本身或其社会影响”，而不仅是“个人不相信”。","使用时要注意语气与场合：在学术写作里可用来描述某种立场；在日常交流中可能显得对宗教群体不够尊重，更中性的说法有“critical of religion（对宗教持批判态度）”。"]}
{"word":"antireligionist","summary":{"en":"An antireligionist is someone who actively opposes religion, especially organized religion or its influence.","zh":"antireligionist 指积极反对宗教（尤其是有组织的宗教或其社会影响）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who is opposed to religion, especially to organized religion or religious influence in society.","zh":"反宗教者；（尤指）反对宗教组织或宗教在社会中影响的人。"},"examples":[{"en":"Some antireligionists argue that public policy should be based only on secular reasoning.","zh":"一些反宗教者认为公共政策应当只建立在世俗理性之上。"},{"en":"He was labeled an antireligionist after criticizing the role of the church in politics.","zh":"他批评教会在政治中的作用后，被贴上了反宗教者的标签。"}]}],"synonyms":["anti-religious person","opponent of religion","secularist (sometimes, depending on context)"],"phonetic":"/ˌæn.taɪ.rɪˈlɪ.dʒən.ɪst/","extraExplanation":["“antireligionist”通常用于较正式或批评性的语境，带有“明确反对宗教”的含义，语气往往比“nonreligious（无宗教信仰的）”或“irreligious（不虔诚/不信教的）”更强。","词形结构：anti-（反对）+ religion（宗教）+ -ist（……主义者/……者）。","相关区分：anti-religion（反宗教立场）强调“反对宗教本身”；anti-clerical（反教权/反教士）更强调反对宗教机构或神职人员的权力；atheist（无神论者）强调“不相信神”，不一定反对宗教。"]}
{"word":"antireligiosity","summary":{"en":"Antireligiosity means being strongly opposed to religion or religious institutions.","zh":"antireligiosity 指强烈反对宗教或宗教机构的态度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to religion, religious beliefs, or religious institutions; an attitude of being strongly against religion.","zh":"反宗教；对宗教信仰或宗教机构的反对态度（强烈不认同或敌对）。"},"examples":[{"en":"The article discusses antireligiosity in modern politics.","zh":"这篇文章讨论了现代政治中的反宗教情绪。"},{"en":"His antireligiosity grew after negative experiences with a strict church.","zh":"在对一个严格的教会有过不好的经历后，他的反宗教态度更强烈了。"},{"en":"The group’s antireligiosity led them to protest outside places of worship.","zh":"该团体的反宗教立场促使他们在宗教场所外抗议。"}]}],"synonyms":["anti-religion","anti-religious sentiment","irreligion","secularism (sometimes, context-dependent)"],"phonetic":"/ˌæn.ti.rɪˌlɪdʒ.iˈɑː.sə.ti/","extraExplanation":["“antireligiosity”通常带有更强的对立色彩，强调“反对宗教本身或宗教机构”。它不一定等同于“atheism（无神论）”：无神论主要表示“不相信神”，而反宗教可能包含对宗教实践、教会权力或宗教影响社会的反对。","词形结构：anti-（反对）+ religiosity（宗教性/宗教虔诚）。在正式写作中较常见；日常口语里更常说 “anti-religious attitudes/feelings（反宗教态度/情绪）”。"]}
{"word":"antireligious","summary":{"en":"Antireligious means opposed to religion, religious beliefs, practices, or institutions.","zh":"Antireligious 指“反宗教的”，即反对宗教信仰、宗教实践或宗教机构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to religion or to religious beliefs, practices, or institutions.","zh":"反宗教的；反对宗教信仰、宗教实践或宗教机构的。"},"examples":[{"en":"Some critics called the novel antireligious because it questions traditional beliefs.","zh":"一些评论家称这部小说“反宗教”，因为它质疑传统信仰。"},{"en":"He denies being antireligious; he says he only opposes certain religious institutions.","zh":"他否认自己反宗教；他说他只是反对某些宗教机构。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to actions, speech, or policies that oppose religion in public life.","zh":"（言论/行动/政策）带有反宗教倾向的；在公共生活中反对宗教的。"},"examples":[{"en":"The proposal was attacked as antireligious by some community leaders.","zh":"这项提案被一些社区领袖批评为反宗教。"},{"en":"The country has a history of antireligious laws during certain periods.","zh":"这个国家在某些时期曾有反宗教法律的历史。"}]}],"synonyms":["anti-religion","irreligious (often milder)","nonreligious (neutral)","anti-clerical (related but narrower)"],"phonetic":"/ˌæn.ti.rɪˈlɪ.dʒəs/","extraExplanation":["“anti-”表示“反对/对抗”，加在名词或形容词前构成新词，如 antiwar（反战）、antismoking（反吸烟）。因此 antireligious 直观地表示“反对宗教”。","语气与立场：antireligious 往往带有较强的对立色彩，常用于政治、社会争论或评论中。若只是“不信宗教/没有宗教信仰”，英语里更中性常用 irreligious（不信教的）或 nonreligious（无宗教信仰的）。","相关表达：anti-clerical 通常指“反对教士阶层/教会势力”，不一定反对所有宗教信仰；secular（世俗的/政教分离的）也不等同于 antireligious。"]}
{"word":"antireligiously","summary":{"en":"“Antireligiously” means “in an anti-religious way,” showing opposition to religion.","zh":"“antireligiously”意为“以反宗教的方式”，表达对宗教的反对立场。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that opposes religion or religious beliefs and practices.","zh":"以反宗教的方式；以反对宗教信仰或宗教实践的方式。"},"examples":[{"en":"He spoke antireligiously about organized religion in class.","zh":"他在课堂上以反宗教的口吻谈论有组织的宗教。"},{"en":"The article was criticized for being written antireligiously rather than neutrally.","zh":"这篇文章因写作立场偏反宗教、而非中立而受到批评。"},{"en":"Some groups campaigned antireligiously, calling for religion to be removed from public schools.","zh":"一些团体以反宗教的立场进行倡议，呼吁将宗教从公立学校中移除。"}]}],"synonyms":["anti-religiously","irreverently","hostilely (toward religion)","oppositionally (to religion)"],"phonetic":"/ˌæn.ti.rɪˈlɪ.dʒəs.li/","extraExplanation":["“antireligiously”由 anti-（反对）+ religious（宗教的）+ -ly（副词后缀）构成，语气往往带有立场性，常用于评论、政治或社会议题写作中。","与“secularly（世俗地）/ nonreligiously（非宗教地）”不同，“antireligiously”通常不只是“没有宗教”，而是“反对宗教”。在正式写作里，如果想表达中立的“与宗教无关”，更常用 nonreligiously 或 secularly。"]}
{"word":"Antiremonstrant","summary":{"en":"Antiremonstrant refers to a person (or viewpoint) opposing the Remonstrants/Arminians in the early Dutch Reformed Church, typically supporting strict Calvinism.","zh":"Antiremonstrant 指反对荷兰归正教会中“抗辩派/阿民念派”的人或立场，通常支持严格的加尔文主义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposed the Remonstrants (the followers of Arminius) in the Dutch Reformed Church, especially in the early 1600s; a supporter of strict Calvinist doctrine","zh":"反对“抗辩派/申诉派（Remonstrants，阿民念派）”的人；特指17世纪初荷兰归正教会中支持严格加尔文主义立场者"},"examples":[{"en":"The Antiremonstrants argued for a strict interpretation of predestination.","zh":"反抗辩派主张以严格方式解释“预定论”。"},{"en":"In Dutch church history, the Antiremonstrants and Remonstrants were central to major debates about salvation.","zh":"在荷兰教会史中，反抗辩派与抗辩派围绕“救恩”展开了重要争论。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or supporting the Antiremonstrants or their theological position","zh":"与反抗辩派有关的；支持反抗辩派神学立场的"},"examples":[{"en":"An Antiremonstrant minister preached against Arminian ideas.","zh":"一位反抗辩派牧师讲道时反对阿民念主义观点。"}]}],"synonyms":["Counter-Remonstrant","Calvinist (historical context)","orthodox Reformed (context-dependent)"],"phonetic":"/ˌæn.taɪ.rɪˈmɑn.strənt/","extraExplanation":["“Remonstrants（抗辩派/申诉派）”源于1610年的《抗辩书（Remonstrance）》，主张人的自由意志在救恩中有作用；“Antiremonstrants（反抗辩派）”则反对这一立场，强调上帝主权与预定论。","这一争论与1618–1619年的“多特会议（Synod of Dort）”密切相关；会议最终支持反抗辩派立场，并形成了后来常被概括为加尔文主义“要点”的教义框架。","该词主要用于历史、神学语境，现代日常英语中很少见；写作时通常需要简单交代背景（Dutch Reformed Church, Arminianism, Synod of Dort）以帮助读者理解。"]}
{"word":"antiremonstrant","summary":{"en":"An antiremonstrant is a historical term for someone who opposed the Remonstrants (Arminians), especially strict Calvinists in the early Dutch Reformed Church.","zh":"antiremonstrant 是历史用语，指反对抗辩派（亚米念派）的人，尤指17世纪初荷兰改革宗中立场较严格的加尔文主义者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposed the Remonstrants (Arminians), especially a strict Calvinist in the Dutch Reformed Church in the early 1600s; also called a Contra-Remonstrant","zh":"（尤指17世纪初荷兰改革宗教会中）反对“抗辩派”（Remonstrants／亚米念派）的人；多指立场更严格的加尔文主义者；也称“反抗辩派／保抗辩派”（Contra-Remonstrant）"},"examples":[{"en":"In Dutch church history, the Antiremonstrants defended strict Calvinist doctrine.","zh":"在荷兰教会史中，反抗辩派（Antiremonstrants）捍卫严格的加尔文主义教义。"},{"en":"The Synod of Dort addressed the conflict between Remonstrants and Antiremonstrants.","zh":"多特主教会议处理了抗辩派与反抗辩派之间的冲突。"}]}],"synonyms":["Contra-Remonstrant","Calvinist (in this historical context)"],"phonetic":"/ˌæn.taɪ.rɪˈmɑn.strənt/","extraExplanation":["这个词主要出现在宗教史语境，尤其与17世纪初尼德兰（荷兰）改革宗的争论有关。Remonstrants 通常指亚米念主义者（强调人的自由意志在得救中的作用），而 Antiremonstrants/Contra-Remonstrants 则强调更传统、更严格的加尔文主义立场（如“预定论”等）。","常见拼写与用法：Contra-Remonstrant 更常见；antiremonstrant 也可见但较少用，阅读史料或学术文章时更可能遇到。"]}
{"word":"antirenin","summary":{"en":"Antirenin is a substance—often an antibody—that neutralizes renin and can reduce renin’s effects on blood pressure regulation.","zh":"Antirenin 指一种（常为抗体的）物质，可中和肾素，从而削弱肾素在血压调节中的作用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An antibody (or substance) that blocks or neutralizes renin, an enzyme involved in regulating blood pressure.","zh":"抗肾素（抗体或物质）：可阻断或中和“肾素”（一种参与调节血压的酶）的作用。"},"examples":[{"en":"In early research, antirenin was studied for its potential effect on blood pressure control.","zh":"在早期研究中，人们研究了抗肾素对血压控制的潜在影响。"},{"en":"Scientists measured antirenin activity to see whether renin could be inhibited in the lab.","zh":"科学家测量抗肾素活性，以观察在实验室中是否能抑制肾素。"}]}],"synonyms":["anti-renin antibody","renin-neutralizing antibody","renin inhibitor (broader)"],"phonetic":"/ˌæn.tiˈriː.nɪn/","extraExplanation":["“renin（肾素）”是肾脏分泌的一种酶，属于“肾素-血管紧张素-醛固酮系统（RAAS）”的一部分，和血压、体液平衡密切相关。","“anti-”是常见前缀，表示“反对/抑制/抗……”。因此 antirenin 字面意思就是“抗肾素”。","该词多见于生理学/免疫学/药理学语境；在现代临床用药中，更常见的是直接抑制RAAS其他环节的药物（如ACE抑制剂、ARB等），而“antirenin”更多偏研究或特定专业讨论。"]}
{"word":"antirennet","summary":{"en":"Antirennet is an antibody/antiserum that neutralizes or reacts against rennet (milk-clotting enzyme).","zh":"Antirennet 指能中和或对抗凝乳酶（使牛奶凝固的酶）的抗体或抗血清。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an antibody or antiserum that reacts against rennet (rennin/chymosin), used to neutralize or measure rennet’s activity in laboratory or dairy-science contexts","zh":"抗凝乳酶（抗凝乳剂）：指针对凝乳酶（rennet/rennin/chymosin）的抗体或抗血清，常用于实验或乳品科学中以中和或测定凝乳酶活性"},"examples":[{"en":"The lab added antirennet to stop the rennet enzyme from clotting the milk.","zh":"实验室加入抗凝乳酶来阻止凝乳酶使牛奶凝固。"},{"en":"Researchers measured rennet strength by observing how much antirennet was needed to neutralize it.","zh":"研究人员通过观察需要多少抗凝乳酶才能中和凝乳酶来测定胆凝乳酶的强度。"}]}],"synonyms":["anti-rennet serum","antirennin","anti-chymosin"],"phonetic":"ˌæntiˈrɛnɪt","extraExplanation":["“Rennet（凝乳酶）”是一种用于奶酪制作的酶，主要成分常指 chymosin。它能让牛奶中的蛋白质凝固成凝乳。","“Antirennet”不是日常英语词汇，更多见于乳品工艺、食品科学或免疫学相关文献；写作中也常见连字符形式 anti-rennet。"]}
{"word":"antirennin","summary":{"en":"Antirennin is an antibody against renin, mainly used in medical research and lab testing.","zh":"antirennin 指“抗肾素抗体”，主要用于医学研究与实验室检测。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An antibody that acts against renin (a kidney enzyme/hormone involved in blood-pressure control), used mainly in medical research and laboratory testing.","zh":"抗肾素抗体；一种针对肾素（与血压调节有关的肾脏酶/激素）的抗体，主要用于医学研究与实验室检测。"},"examples":[{"en":"The lab used antirennin to measure renin levels in the blood sample.","zh":"实验室使用抗肾素抗体来测量血样中的肾素水平。"},{"en":"Antirennin is mostly discussed in research papers, not everyday conversation.","zh":"抗肾素抗体多见于科研论文中，而不是日常用语。"}]}],"synonyms":["anti-renin antibody","antirenin"],"phonetic":"/ˌæn.tiˈriː.nɪn/","extraExplanation":["“antirennin”由 anti-（抗、反对）+ rennin/renin 组成。这里指的是 renin（肾素，调节血压的肾素-血管紧张素系统的一部分），不要和 rennin（凝乳酶，和奶酪制作有关）混淆。","在现代医学语境中，更常见的写法是 anti-renin antibody（抗肾素抗体）；“antirennin”属于较专业、较少见的单词。"]}
{"word":"antirent","summary":{"en":"Anti-rent means opposing rent (or rent increases), and it can also refer to or describe the 19th-century Anti-Rent movement in New York.","zh":"antirent/anti-rent 指反对租金（或涨租），也可指或形容19世纪纽约州的“反租运动”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to rent (especially high or unfair rent), or aimed at reducing/abolishing rent payments.","zh":"反对租金的（尤指反对过高或不公平的租金），或旨在降低/取消租金支付的。"},"examples":[{"en":"The group organized an anti-rent campaign after rents rose sharply.","zh":"房租大幅上涨后，这个团体组织了反对涨租的行动。"},{"en":"Some cities discussed anti-rent policies like stronger tenant protections.","zh":"一些城市讨论了“反房租”政策，比如加强对租客的保护。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or group that opposes rent payments, especially in a political or protest context.","zh":"反对缴纳租金的人或团体（尤指在政治或抗议语境中）。"},"examples":[{"en":"Local newspapers called the protesting farmers “anti-rents.”","zh":"当地报纸把抗议的农民称为“反租派”。"},{"en":"The anti-rents demanded fairer land contracts.","zh":"反租派要求更公平的土地契约。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to the Anti-Rent movement in 19th-century New York State (also written “Anti-Rent”).","zh":"与19世纪美国纽约州“反租运动”（Anti-Rent movement）有关的（也可写作 Anti-Rent）。"},"examples":[{"en":"She is writing a paper on Anti-Rent history in upstate New York.","zh":"她正在写一篇关于纽约州北部反租运动历史的论文。"},{"en":"Anti-Rent leaders pushed for legal reforms in land tenancy.","zh":"反租运动的领导者推动了土地租佃制度的法律改革。"}]}],"synonyms":["anti-tenant-rent (contextual)","rent-control (related, not identical)","tenant-rights (related)"],"phonetic":"/ˌæn.tiˈrɛnt/","extraExplanation":["“Anti-Rent”最有名的历史用法来自19世纪纽约州的“反租运动”（Anti-Rent War/Anti-Rent Movement）。当时一些农民反对大地主制度下的长期租佃契约与高额“地租”，通过集会、抵制缴租等方式争取改革，后来也影响了当地土地与租佃相关的法律与政治。","现代语境里，anti-rent 更常作为一般性形容词使用，表示“反对（某种）租金制度/涨租”的立场；具体含义需要看上下文，可能是温和的政策主张，也可能是激进的抗议口号。"]}
{"word":"antirenter","summary":{"en":"Antirenter (often written anti-renter) means against renters or against policies that protect/support renters.","zh":"Antirenter（常写作 anti-renter）指反对租客，或反对保护/支持租客的政策。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is opposed to renters or to policies that protect renters (for example, rent control or stronger tenant rights).","zh":"反对租客或反对保护租客政策（如租金管制、加强租户权利）的人。"},"examples":[{"en":"Some activists criticized the council member as an antirenter for voting against tenant protections.","zh":"一些倡议者批评那位市议员是“反租客派”，因为他投票反对租户保护措施。"},{"en":"The article describes an antirenter campaign that blames rising prices on renters rather than on housing shortages.","zh":"这篇文章描述了一场“反租客”宣传，把涨价归咎于租客而不是住房短缺。"}]},{"partOfSpeech":"adj.","definition":{"en":"opposed to renters or to policies that support renters.","zh":"反对租客或反对支持租客的政策的。"},"examples":[{"en":"They accused the proposal of being antirenter and unfair to people who can’t afford to buy a home.","zh":"他们指责该提案“反租客”，对买不起房的人不公平。"},{"en":"An antirenter attitude can make it harder for newcomers to find stable housing.","zh":"一种“反租客”的态度会让新来的人更难找到稳定住房。"}]}],"synonyms":["anti-renter","anti-tenant (less common)","anti–rent control"],"phonetic":"/ˌæn.tiˈrɛn.tɚ/","extraExplanation":["“antirenter”通常更常见的写法是“anti-renter”（加连字符），由前缀“anti-（反对）”+“renter（租客）”构成。它不是非常固定的标准词汇，更常出现在政治评论、住房议题或社交媒体语境中，用来表达立场或批评。正式写作中也可用更明确的表达，如“opposed to tenant protections（反对租户保护）”。"]}
{"word":"antirentism","summary":{"en":"Antirentism means opposing rent payments or landlord rent systems, often as a protest or political movement.","zh":"Antirentism 指反对支付租金或反对房东/地主收租制度的思潮或运动，常带有抗议与政治色彩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to paying rent, or a political/social movement against landlord rent systems (especially very high or unfair rents).","zh":"反租主义；反对支付租金或反对地主/房东收租制度的社会或政治立场（尤指认为租金过高或不公时）。"},"examples":[{"en":"The tenant group’s antirentism grew as rents rose faster than wages.","zh":"随着房租上涨速度超过工资，这个租户团体的反租主义情绪越来越强。"},{"en":"In some rural areas, antirentism became a form of protest against powerful landlords.","zh":"在一些乡村地区，反租主义成为反抗强势地主的一种抗议形式。"}]}],"synonyms":["anti-rent movement","tenant protest","anti-landlordism","rent resistance"],"phonetic":"/ˌæn.tiˈrɛn.tɪ.zəm/","extraExplanation":["“antirentism”多用于历史或政治语境，指反对收租制度或拒付租金的运动/思潮，而不是日常抱怨“房租太贵”。","历史上较常被提到的案例包括美国纽约州哈德逊河谷的“反租战争（Anti-Rent War, 19世纪）”，以及与土地改革相关的反地主、反高租金运动（在不同国家语境下用法会略有差异）。","构词：anti-（反对）+ rent（租金）+ -ism（主义/思潮）。在现代讨论中，也可能与“tenant rights（租户权利）”“housing justice（住房正义）”等议题并列出现。"]}
{"word":"antirepublican","summary":{"en":"Antirepublican means opposed to republican government/ideas, or (in U.S. politics) opposed to the Republican Party; it can also refer to a person with that stance.","zh":"antirepublican 指反对共和政体/共和主义思想的；在美国政治语境中也可指反对共和党的；也可作名词指持这种立场的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to republican government or republican ideas (the belief that a country should be governed by elected representatives, not a monarch).","zh":"反共和政体的；反对共和主义思想的（主张国家应由民选代表治理，而非君主统治）。"},"examples":[{"en":"The movement was strongly antirepublican and supported restoring the monarchy.","zh":"这场运动强烈反共和，并支持恢复君主制。"},{"en":"Some writers called the new constitution antirepublican because it concentrated too much power in one office.","zh":"一些作者称新宪法“反共和”，因为它把过多权力集中在一个职位上。"}]},{"partOfSpeech":"adj.","definition":{"en":"Opposed to the U.S. Republican Party (political sense).","zh":"反对美国共和党的（政治语境）。"},"examples":[{"en":"The newspaper’s editorial page had an openly antirepublican tone during the election.","zh":"选举期间，这家报纸的社论版明显带有反共和党的语气。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who is opposed to republican government or, in U.S. politics, opposed to the Republican Party.","zh":"反共和主义者；（美国政治语境）反共和党者。"},"examples":[{"en":"In that debate, he was labeled an antirepublican by his opponents.","zh":"在那场辩论中，他被对手贴上“反共和主义者”的标签。"}]}],"synonyms":["anti-republican","anti-monarchist (context-dependent)","anti-GOP (U.S. politics, informal)"],"phonetic":"/ˌæntaɪrɪˈpʌblɪkən/","extraExplanation":["注意大小写：republican（小写）通常指“共和政体/共和主义”的概念；Republican（大写）常指美国的共和党。antirepublican 也会因此出现两种常见解读，具体要看语境。","构词法：anti- 表示“反对”，republican 表示“共和主义的/共和党的”，合起来就是“反共和（主义/共和党）的”。"]}
{"word":"antirepublicanism","summary":{"en":"Antirepublicanism means opposition to a republic as a form of government.","zh":"antirepublicanism 指反对共和政体的一种政治立场或思想。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to republicanism; the belief that a republic (a country without a monarch, led by elected representatives) is not a good or desirable form of government.","zh":"反共和主义；反对共和政体（没有君主、由民选代表执政的国家体制）的立场或思想。"},"examples":[{"en":"In some political debates, antirepublicanism appears as support for restoring a monarchy.","zh":"在一些政治辩论中，反共和主义会以支持恢复君主制的形式出现。"},{"en":"The historian traced antirepublicanism in the region to fears of instability after revolution.","zh":"这位历史学家把该地区的反共和主义追溯到革命后对动荡的担忧。"}]}],"synonyms":["anti-republican sentiment","anti-republican ideology","opposition to republicanism"],"phonetic":"/ˌæn.taɪ.rɪˈpʌb.lɪ.kəˌnɪ.zəm/","extraExplanation":["“republicanism”在这里是政治概念（共和政体/共和主义），不等同于美国政党意义上的“Republican（共和党）”。因此“antirepublicanism”通常指反对共和政体，而不是“反共和党”。","这个词更常见于历史或政治学写作中，用来描述某一时期或群体对建立共和国的抵制（例如偏好君主制、神权体制或其他非共和形式）。"]}
{"word":"antireservationist","summary":{"en":"Antireservationist describes someone (or an idea) opposing the Native American reservation system.","zh":"antireservationist 指反对（美洲原住民）保留地制度的人或立场。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to the policy of keeping Native Americans living on reservations, often supporting assimilation or other alternatives.","zh":"反对（美洲原住民）保留地制度的；常主张同化或其他替代政策的。"},"examples":[{"en":"Some lawmakers were openly antireservationist and argued that reservations should be dismantled.","zh":"一些立法者公开反对保留地制度，认为应当废除保留地。"},{"en":"Her essay critiques the antireservationist ideas common in federal policy at the time.","zh":"她的文章批评了当时联邦政策中常见的反保留地主张。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who opposes the reservation system for Native Americans.","zh":"反对（美洲原住民）保留地制度的人；反保留地主义者。"},"examples":[{"en":"The debate featured antireservationists and defenders of tribal sovereignty.","zh":"这场辩论中既有反保留地主义者，也有维护部落主权的人。"},{"en":"As an antireservationist, he promoted programs meant to move people off reservations.","zh":"作为反保留地主义者，他推动一些旨在让人们离开保留地的项目。"}]}],"synonyms":["anti-reservation","anti-reservation advocate","reservation opponent"],"phonetic":"/ˌæn.tiˌrɛz.ɚˈveɪ.ʃə.nɪst/","extraExplanation":["这个词多见于美国历史与政治语境，尤其与19世纪末到20世纪的“印第安政策”讨论相关：一方强调部落主权与保留地作为土地与文化的保障，另一方（常被称为anti-reservationist）则主张取消保留地、推动“同化”、分配土地（allotment）或将服务并入一般行政体系。","使用时要注意文化敏感性：保留地制度既与殖民历史、条约、强制迁移有关，也可能是当代部落自治与社区延续的基础，因此该词往往带有强烈的政治立场色彩。"]}
{"word":"antiresonance","summary":{"en":"Antiresonance is a frequency condition where a system’s vibration or response becomes unusually small due to cancellation, opposite to resonance.","zh":"反共振是指在某个频率下因相互抵消而使系统振动或响应异常变小的现象，和“共振”相对。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Physics/engineering) A condition in a vibrating system where the response becomes very small (a “dip” in amplitude) at a particular frequency because waves or modes cancel each other out.","zh":"（物理/工程）反共振：在某个特定频率下，由于波或振动模态相互抵消，使系统的响应（振幅）变得很小（出现“低谷”）的状态。"},"examples":[{"en":"The graph shows an antiresonance around 1.2 kHz where the vibration amplitude drops sharply.","zh":"图中在约 1.2 kHz 处出现反共振，振动幅度急剧下降。"},{"en":"Engineers adjust the design to move the antiresonance away from the operating frequency.","zh":"工程师会调整设计，把反共振频率避开设备的工作频率。"}]},{"partOfSpeech":"n.","definition":{"en":"A frequency at which a system’s impedance or transfer behavior indicates strong cancellation (often contrasted with resonance, where response is large).","zh":"反共振频率：系统的阻抗或传递特性显示出强烈抵消效应的频率（常与“共振”对比：共振时响应很大）。"},"examples":[{"en":"At the antiresonance frequency, the circuit’s current can become minimal even though the voltage is present.","zh":"在反共振频率下，即使有电压，电路电流也可能变得很小。"},{"en":"The loudspeaker’s response has a resonance peak and an antiresonance notch.","zh":"扬声器的响应曲线既有共振峰，也有反共振凹口。"}]}],"synonyms":["cancellation frequency","antiresonant frequency","notch (in a response curve)"],"phonetic":"/ˌæn.tiˈrɛz.ə.nəns/","extraExplanation":["“反共振”常出现在耦合系统（例如两个相连的质量-弹簧、结构件与阻尼器、或含寄生参数的电路）中：一个部分的运动/电流与另一个部分在某频率上相位相反，导致整体输出被抵消。","在工程上，反共振有时是好事（可用来抑制某频段振动或噪声），但也可能带来问题（例如音频系统出现“缺口”、控制系统某频段响应过低）。"]}
{"word":"antiresonator","summary":{"en":"An antiresonator is a component designed to suppress resonance at a specific frequency.","zh":"antiresonator 指用来在特定频率抑制共振的部件/装置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device, structure, or circuit element designed to reduce or cancel resonance at a particular frequency (often by creating an “anti-resonance” that blocks vibration or signal flow).","zh":"一种装置、结构或电路元件，用来在特定频率上减弱或抵消共振（通常通过产生“反共振/抗共振”来阻断振动或信号传递）。"},"examples":[{"en":"Engineers added an antiresonator to the exhaust system to reduce an annoying low-frequency noise.","zh":"工程师在排气系统中加装了一个抗共振器，以降低恼人的低频噪声。"},{"en":"In the filter design, the antiresonator creates a notch that blocks a narrow band of frequencies.","zh":"在滤波器设计中，抗共振器会形成一个“陷波”，阻挡一小段频带。"}]}],"synonyms":["anti-resonator","notch resonator","trap (circuit)","resonance suppressor"],"phonetic":"/ˌæn.tiˈrɛz.əˌneɪ.tɚ/","extraExplanation":["“Antiresonator”常见于声学、振动控制与射频/微波电路等领域。它与“resonator（谐振器）”相对：谐振器强调在某频率增强响应，而抗共振器强调在某频率抑制响应（如形成陷波/notch）。","写法上也常见连字符形式“anti-resonator”。在专业文献里，“antiresonance（反共振/抗共振）”多指某些频率点系统响应极小，而“antiresonator”更偏向实现这种效果的具体部件或结构。"]}
{"word":"antirestoration","summary":{"en":"Antirestoration means opposition to restoring a former ruler or old political system; it can also describe movements or views that oppose such a return.","zh":"antirestoration 指反对旧政权/旧制度“复辟、复位”；也可作形容词，描述反复辟的立场或运动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to a “restoration,” especially the return of a former ruler, monarchy, government, or old system of power.","zh":"反对“复辟/复位”（尤其指反对旧王朝、君主制、旧政权或旧制度重新上台）。"},"examples":[{"en":"After the revolution, several parties formed around restoration and antirestoration ideas.","zh":"革命之后，一些政党围绕“复辟”和“反复辟”的理念形成。"},{"en":"His antirestoration stance made him popular with voters who feared a return to the old regime.","zh":"他的反复辟立场让那些担心旧政权回归的选民很支持他。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Attributive) Describing a person, group, or policy that opposes restoration.","zh":"（作定语）指反对复辟/复位的人、团体或政策。"},"examples":[{"en":"The antirestoration movement organized rallies in the capital.","zh":"反复辟运动在首都组织了集会。"},{"en":"They published antirestoration pamphlets calling for a new constitution.","zh":"他们发表反复辟的小册子，呼吁制定新宪法。"}]}],"synonyms":["anti-restoration","opposition to restoration","anti-monarchist (context-dependent)","anti-regime (context-dependent)"],"phonetic":"ˌæn.tiˌrɛs.təˈreɪ.ʃən","extraExplanation":["这个词比较少见，常见于历史或政治讨论。这里的 restoration 往往指“旧势力的恢复”，例如某个王朝/君主制在被推翻后再次回归（如不同国家历史上出现过的“复辟”）。因此 antirestoration 通常带有明确的政治立场色彩。","构词上是 anti-（反对）+ restoration（恢复、复辟）。在更日常的英语里，人们更常说 anti-restoration movement / opposition to restoration，或直接用 anti-monarchist（反君主制）等更具体的表达。"]}
{"word":"antireticular","summary":{"en":"Antireticular describes something (usually in medicine) that acts against or targets reticular tissue/the reticular system.","zh":"Antireticular 指（多用于医学）“抗网状组织的/针对网状系统的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Acting against, inhibiting, or targeting reticular tissue or the reticular (mesh-like) system in the body (especially the reticuloendothelial/immune-related system).","zh":"（医学）抗网状组织的；抑制或针对网状组织或网状（网格状）系统的（尤指与网状内皮/免疫相关的系统）。"},"examples":[{"en":"Researchers tested an antireticular serum to see how it affected immune-cell activity.","zh":"研究人员测试了一种抗网状组织血清，以观察它对免疫细胞活性的影响。"},{"en":"The report mentioned antireticular antibodies associated with changes in lymphoid tissue.","zh":"报告提到与淋巴组织变化相关的抗网状组织抗体。"}]}],"synonyms":["anti-reticular","anti-reticuloendothelial"],"phonetic":"/ˌæn.ti.rəˈtɪk.jə.lɚ/","extraExplanation":["该词较少用于日常英语，主要见于医学/免疫学文献。reticular 指“网状的”，在解剖学里常与 reticular tissue（网状组织）或 reticuloendothelial system（网状内皮系统，旧称，现多与单核吞噬细胞系统相关）一起出现。anti- 表“反对/抗”，因此 antireticular 通常描述“针对网状组织/网状系统的（抗体、血清、作用等）”。","构词理解：anti-（抗、反）+ reticular（网状的）。读文献时常见搭配：antireticular antibodies/serum/effect（抗网状组织抗体/血清/作用）。"]}
{"word":"antiretroviral","summary":{"en":"Antiretroviral refers to drugs (or treatment) that fight retroviruses—most commonly HIV—by preventing the virus from multiplying.","zh":"Antiretroviral 指用于对抗逆转录病毒（最常见为 HIV）的药物或治疗，通过抑制病毒复制来控制病情。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"a medicine used to treat infection with a retrovirus (especially HIV) by stopping the virus from multiplying in the body","zh":"抗逆转录病毒的（药物）；用于治疗逆转录病毒感染（尤其是 HIV），通过抑制病毒在体内复制来控制病情"},"examples":[{"en":"Antiretroviral drugs help people with HIV live longer and healthier lives.","zh":"抗逆转录病毒药物帮助 HIV 感染者活得更久、更健康。"},{"en":"She takes antiretroviral therapy every day to keep the virus under control.","zh":"她每天接受抗逆转录病毒治疗，以控制病毒。"}]},{"partOfSpeech":"n.","definition":{"en":"an antiretroviral drug or medication","zh":"抗逆转录病毒药（药物）"},"examples":[{"en":"The clinic provided antiretrovirals at low cost.","zh":"诊所提供低价的抗逆转录病毒药。"},{"en":"Do not stop your antiretrovirals without talking to your doctor.","zh":"未与医生沟通前不要擅自停用抗逆转录病毒药。"}]}],"synonyms":["ARV","anti-HIV medication","antiretroviral drug","antiretroviral therapy (ART)"],"phonetic":"/ˌæn.tiˌrɛt.roʊˈvaɪ.rəl/","extraExplanation":["“anti-”表示“反/抗”；“retroviral”与“逆转录病毒”有关（这类病毒会用“逆转录”把RNA信息转成DNA，例如HIV）。因此 antiretroviral 字面意思就是“抗逆转录病毒的”。","医学语境里常见搭配是 **antiretroviral therapy (ART)**（抗逆转录病毒治疗）。日常交流中也常简称为 **ARVs**（抗逆转录病毒药）。用词时注意：这类药物通常是“长期规律服用、控制病毒”，并不等同于“治愈”。"]}
{"word":"antirevisionist","summary":{"en":"“Antirevisionist” means opposing revisionism—especially resisting changes to an established political doctrine—or a person who holds that stance.","zh":"“antirevisionist”指反对修正主义（尤指反对改变既定政治理论/路线），也可指持此立场的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to revisionism, especially in politics (often Marxist or communist contexts); rejecting attempts to change or “soften” an established doctrine or party line.","zh":"反修正主义的；（尤指政治上、常见于马克思主义或共产主义语境）反对“修正主义”，反对改变或“淡化”既定理论/路线。"},"examples":[{"en":"The group described itself as antirevisionist and criticized the party’s new reforms.","zh":"该团体自称反修正主义，并批评该党新的改革。"},{"en":"In Cold War debates, antirevisionist writers argued that the original doctrine should not be rewritten.","zh":"在冷战时期的争论中，反修正主义的作者认为不应改写原有理论。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who is opposed to revisionism; someone who rejects changing an established ideology or official interpretation (often used in communist political disputes).","zh":"反修正主义者；反对修正主义的人（常用于共产主义政治分歧中的称呼）。"},"examples":[{"en":"He was labeled an antirevisionist by his opponents in the movement.","zh":"在该运动中，他被对手贴上“反修正主义者”的标签。"},{"en":"Antirevisionists in the organization wanted to keep the original platform unchanged.","zh":"该组织中的反修正主义者希望保持原有纲领不变。"}]}],"synonyms":["anti-revisionist","orthodox (in ideology)","hardline"],"phonetic":"/ˌæntiɹɪˈvɪʒənɪst/","extraExplanation":["“revisionism（修正主义）”在一般英语里可指对既有观点/历史解释进行修订，但在20世纪左翼政治语境中常带强烈立场色彩，指被认为“背离正统”的理论调整或政策转向；因此“antirevisionist”多出现在党派斗争、意识形态批评、冷战时期文献中。","构词上：anti-（反对）+ revision（修订）+ -ist（……主义者/……者）。在非政治语境中较少见，用时通常需要给出具体背景，以免读者误解为单纯“反对修订”。"]}
{"word":"antirevolution","summary":{"en":"“Antirevolution” means opposing a revolution (adj.), or a person/group that opposes revolutionary change (n.).","zh":"“antirevolution”指反对革命的（形容词），也可指反革命者或反革命团体（名词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to a revolution or to revolutionary change, especially in politics or society.","zh":"反革命的；反对革命（或革命性变革）的，尤指政治或社会领域。"},"examples":[{"en":"The government arrested several antirevolution activists.","zh":"政府逮捕了几名反革命活动人士。"},{"en":"Some newspapers used antirevolution language to criticize the protest movement.","zh":"一些报纸使用反革命的措辞来批评抗议运动。"}]},{"partOfSpeech":"n.","definition":{"en":"A person, group, or movement that opposes a revolution or tries to stop/reverse revolutionary change.","zh":"反革命者；反革命团体（或运动）：反对革命或试图阻止／逆转革命变革的人或组织。"},"examples":[{"en":"The rebels called anyone who resisted them an antirevolution.","zh":"叛军把任何反抗他们的人都称为“反革命”。"},{"en":"In the novel, the antirevolution becomes a convenient label for political enemies.","zh":"在小说中，“反革命”成了给政治敌人贴标签的方便用语。"}]}],"synonyms":["counterrevolutionary","anti-revolutionary","reactionary (often critical)"],"phonetic":"/ˌæn.tiˌrɛv.əˈluː.ʃən/","extraExplanation":["“antirevolution / anti-revolution”常见于政治语境，带有强烈立场色彩。在某些历史时期，它不仅描述“反对革命”的立场，也常被当作指控或污名化对手的标签，因此在正式写作中要注意语气与证据。","拼写上既可写作连写 antirevolution，也常见 hyphen 形式 anti-revolution；含义相同。"]}
{"word":"antirevolutionaries","summary":{"en":"“Antirevolutionaries” means people who oppose a revolution or revolutionary change.","zh":"“antirevolutionaries”指反对革命或革命性变革的人（反革命者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who oppose a revolution or revolutionary changes, often supporting the existing government or social order.","zh":"反革命者；反对革命或革命性变革的人，常支持现有政府或社会秩序。"},"examples":[{"en":"The new government arrested suspected antirevolutionaries after the uprising.","zh":"起义后，新政府逮捕了被怀疑的反革命者。"},{"en":"In the novel, antirevolutionaries are portrayed as defending the old aristocracy.","zh":"在这部小说里，反革命者被描写成在维护旧贵族阶层。"},{"en":"The movement labeled its critics as antirevolutionaries, even when they simply wanted a slower pace of reform.","zh":"该运动把批评者称为反革命者，即使他们只是希望改革节奏慢一点。"}]}],"synonyms":["counterrevolutionaries","reactionaries","opponents of the revolution"],"phonetic":"/ˌæn.tiˌrɛv.əˈluː.ʃəˌnɛr.iz/","extraExplanation":["“antirevolutionary”常见于政治与历史语境（如法国大革命、俄国革命等），有时会被当作政治标签使用，带有强烈立场与情绪色彩。阅读史料或新闻时，注意是谁在使用这个词、用于指称哪些人，以及是否存在夸大或污名化。","构词：anti-（反对）+ revolutionary（革命的/革命者）。复数形式为 antirevolutionaries。"]}
{"word":"antirevolutionary","summary":{"en":"“Antirevolutionary” describes someone or something opposed to a revolution; it can also mean a person who opposes a revolution.","zh":"“antirevolutionary”指反对革命的（形容词），也可指反对革命的人或团体（名词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to a revolution or to revolutionary political change.","zh":"反革命的；反对革命或反对革命性政治变革的。"},"examples":[{"en":"The government arrested several antirevolutionary groups.","zh":"政府逮捕了几个反革命团体。"},{"en":"In the novel, the hero is accused of having antirevolutionary ideas.","zh":"在这部小说里，主人公被指控有反革命思想。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or group that opposes a revolution; a counterrevolutionary.","zh":"反革命分子；反对革命的人或团体。"},"examples":[{"en":"They labeled anyone who disagreed as an antirevolutionary.","zh":"他们把任何不同意见的人都贴上“反革命”的标签。"},{"en":"The speech warned citizens to watch for antirevolutionaries.","zh":"演讲警告民众要提防反革命分子。"}]}],"synonyms":["counterrevolutionary","anti-revolutionary","reactionary"],"phonetic":"/ˌæn.tiˌrɛv.əˈluː.ʃəˌnɛr.i/","extraExplanation":["这个词由 anti-（“反对”）+ revolutionary（“革命的”）构成，常见于政治语境。实际使用中带有很强的立场色彩：在某些历史时期，它不仅是描述性词汇，也可能成为指控或污名化的标签，使用时要注意语境与语气。","相关词：counterrevolutionary（更常见、相对中性一些）；revolutionary（革命的/革命者）；reactionary（反动的，强调反对社会进步或改革，不一定特指反革命）。"]}
{"word":"antirevolutionist","summary":{"en":"An antirevolutionist is someone (or something) that opposes a revolution or revolutionary change.","zh":"antirevolutionist 指反对革命或革命性变革的人，或形容反革命的立场与事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposes a revolution or revolutionary political change","zh":"反革命者；反对革命或革命性政治变革的人"},"examples":[{"en":"After the uprising, the new government arrested several antirevolutionists.","zh":"起义之后，新政府逮捕了几名反革命者。"},{"en":"He was labeled an antirevolutionist because he defended the old monarchy.","zh":"他因为为旧君主制辩护而被贴上“反革命者”的标签。"}]},{"partOfSpeech":"adj.","definition":{"en":"opposing a revolution or revolutionary political ideas","zh":"反革命的；反对革命或革命思想的"},"examples":[{"en":"The party called the newspaper’s editorial antirevolutionist propaganda.","zh":"该党称这家报纸的社论是反革命宣传。"},{"en":"Antirevolutionist forces tried to restore the previous system.","zh":"反革命势力试图恢复旧制度。"}]}],"synonyms":["counterrevolutionary","anti-revolutionary","reactionary (often negative)"],"phonetic":"/ˌæntiˌrɛvəˈluʃənɪst/","extraExplanation":["“anti-”表示“反对”，revolutionist 表示“革命者/革命主义者”。因此 antirevolutionist 直译为“反对革命的人/事物”。","这个词常见于政治或历史语境，语气往往带有强烈立场色彩；在某些时期还可能被当作指控或标签使用，而不一定是中性描述。"]}
{"word":"antirheumatic","summary":{"en":"Antirheumatic means “against rheumatic disease,” describing medicines/treatments used to relieve or treat conditions like rheumatoid arthritis.","zh":"antirheumatic 意为“抗风湿的/抗风湿药（的）”，指用于缓解或治疗类风湿关节炎等风湿性疾病的药物或治疗。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"A medicine or treatment used to reduce symptoms of rheumatic diseases (such as rheumatoid arthritis), especially pain, swelling, and inflammation in joints.","zh":"抗风湿的；用于缓解风湿性疾病（如类风湿关节炎）症状的药物或治疗，尤其是减轻关节疼痛、肿胀和炎症。"},"examples":[{"en":"The doctor prescribed an antirheumatic drug to help control joint inflammation.","zh":"医生开了抗风湿药来帮助控制关节炎症。"},{"en":"Some antirheumatic medicines can take weeks to show full effects.","zh":"一些抗风湿药可能需要数周才能显现充分疗效。"}]},{"partOfSpeech":"n.","definition":{"en":"A drug used to treat rheumatic diseases (commonly used for rheumatoid arthritis and related conditions).","zh":"抗风湿药；用于治疗风湿性疾病的药物（常见于类风湿关节炎及相关疾病）。"},"examples":[{"en":"Methotrexate is a common antirheumatic used in rheumatoid arthritis.","zh":"甲氨蝶呤是治疗类风湿关节炎的常用抗风湿药。"},{"en":"The patient started a new antirheumatic after other treatments failed.","zh":"在其他治疗无效后，患者开始使用一种新的抗风湿药。"}]}],"synonyms":["antirheumatic drug","DMARD","anti-inflammatory (broader)"],"phonetic":"/ˌæn.ti.ruˈmæt.ɪk/","extraExplanation":["“antirheumatic”由“anti-（抗、反）+ rheumatic（风湿的）”构成，医学语境中常见。","临床上常把抗风湿治疗分为缓解疼痛炎症的药物（如NSAIDs）和“改善病情抗风湿药”（DMARDs，如甲氨蝶呤、生物制剂等）；具体用药需医生评估副作用与监测。","拼写提示：英式与美式拼写通常一致；注意不要写成 *anti-rheumatic*（虽偶见，但不如合写常见）。"]}
{"word":"antiricin","summary":{"en":"Antiricin is an antibody or antiserum used to neutralize ricin toxin.","zh":"Antiricin 指用于中和蓖麻毒素（ricin）的抗体或抗血清。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An antibody or antiserum that works against ricin (a highly poisonous toxin), used in research or potential treatment.","zh":"抗蓖麻毒素（ricin）的抗体或抗血清，用于研究或潜在治疗。"},"examples":[{"en":"Researchers tested antiricin antibodies to see if they could block the toxin’s effects.","zh":"研究人员测试了抗蓖麻毒素抗体，看看能否阻断毒素的作用。"},{"en":"In animal studies, antiricin serum helped reduce the severity of ricin exposure when given early.","zh":"在动物实验中，若尽早使用抗蓖麻毒素血清，可帮助降低蓖麻毒素暴露的严重程度。"}]}],"synonyms":["anti-ricin antibody","ricin antitoxin","antiserum to ricin"],"phonetic":"/ˌæn.tiˈraɪ.sɪn/","extraExplanation":["“Antiricin”由“anti-（抗、对抗）+ ricin（蓖麻毒素）”构成。ricin 来自蓖麻（castor bean）中，毒性很强，因此相关的“抗毒素/抗体”常见于生物医学研究与应急防护语境中。","该词较少出现在日常英语里，更常见于专业写作；更常用的表达包括“anti-ricin antibody/antibodies（抗蓖麻毒素抗体）”或“ricin antitoxin（蓖麻毒素抗毒素）”。"]}
{"word":"antirickets","summary":{"en":"Antirickets means preventing or treating rickets, often referring to vitamin D or vitamin D–rich foods/supplements.","zh":"Antirickets 指“抗佝偻病的”，常用来形容维生素D或富含/补充维生素D的食物与制剂。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a medicine, vitamin, or food) preventing or treating rickets (a childhood bone disease caused mainly by vitamin D deficiency).","zh":"（指药物、维生素或食物）抗佝偻病的；用于预防或治疗佝偻病（多因维生素D缺乏导致的儿童骨骼疾病）。"},"examples":[{"en":"Milk is often fortified with vitamin D for its antirickets effect.","zh":"牛奶常添加维生素D，以发挥其抗佝偻病作用。"},{"en":"The doctor recommended an antirickets supplement during winter when sunlight is limited.","zh":"在冬季日照不足时，医生建议补充抗佝偻病的营养补充剂。"}]}],"synonyms":["antirachitic","anti-rachitic","vitamin D (in context)"],"phonetic":"/ˌæntiˈrɪkɪts/","extraExplanation":["“antirickets”较少单独使用，更常见于医学或营养学语境（如“antirickets factor/antirickets vitamin”）。它指向的核心通常是维生素D及其作用：帮助钙、磷吸收并促进骨骼矿化，从而预防佝偻病。","历史上“antirickets factor（抗佝偻病因子）”曾是对维生素D的早期称呼之一；后来随着营养学发展，逐渐被更常用的“vitamin D”或“antirachitic”取代。"]}
{"word":"antiriot","summary":{"en":"Anti-riot means intended to prevent or control riots, often describing police, equipment, or tactics.","zh":"Anti-riot 指“防暴的”，常用来形容警察、装备或措施，用于预防或控制骚乱。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"designed to prevent, control, or stop riots (large, violent public disturbances).","zh":"用于预防、控制或制止骚乱（大规模、带暴力的公共混乱）的。"},"examples":[{"en":"The city deployed anti-riot police near the stadium.","zh":"市政府在体育场附近部署了防暴警察。"},{"en":"Officers wore anti-riot gear, including helmets and shields.","zh":"警员穿戴防暴装备，包括头盔和盾牌。"},{"en":"The protest remained peaceful, so anti-riot measures were not needed.","zh":"抗议保持和平，所以不需要采取防暴措施。"}]}],"synonyms":["riot-control","crowd-control"],"phonetic":"/ˌæn.taɪˈraɪ.ət/","extraExplanation":["“anti-” 是一个常见前缀，表示“反对/防止……”。“anti-riot” 多用于新闻与公共安全语境，常见搭配有 anti-riot police（防暴警察）、anti-riot gear（防暴装备）、anti-riot unit（防暴部队）。","拼写上常见两种：anti-riot（更常见，带连字符）和 anti riot（较少见，分开写）。作为单词连写 antiriot 也能被理解，但不如前两种标准。"]}
{"word":"antiritual","summary":{"en":"Antiritual describes an attitude or approach that rejects or opposes rituals and formal ceremonies.","zh":"Antiritual 用来形容反对或拒绝仪式与正式礼仪的态度或做法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to rituals or formal ceremonial practices; rejecting traditional ritual behavior (especially in religion, culture, or institutions).","zh":"反仪式的；反对或拒绝传统仪式/礼仪行为的（常见于宗教、文化或制度语境）。"},"examples":[{"en":"Some modern spiritual groups are intentionally antiritual, focusing on personal experience instead of ceremonies.","zh":"一些现代灵修团体刻意采取反仪式的做法，更强调个人体验而非仪式。"},{"en":"His antiritual attitude made him uncomfortable with formal greetings and titles.","zh":"他反仪式的态度让他对正式的问候和头衔感到不自在。"}]}],"synonyms":["anti-ritual","non-ritualistic","anti-ceremonial","against formalities"],"phonetic":"/ˌæn.tiˈrɪtʃ.u.əl/","extraExplanation":["“antiritual”由前缀 anti-（反对）+ ritual（仪式）构成，意思通常是“反对仪式化/形式化”。在英语里更常见的表达是“anti-ritual”（加连字符）或用短语如 “against ritual” / “non-ritualistic”。","该词多用于讨论宗教改革、现代文化与制度批评：强调“去形式化、反程式化”，但不一定等于“反宗教”或“反传统”，要看上下文。"]}
{"word":"antiritualism","summary":{"en":"Antiritualism means opposition to elaborate religious ritualism, favoring simpler practice.","zh":"Antiritualism 指反对（宗教中）过度强调礼仪形式，主张更简朴的实践。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to ritualism—especially in religion—preferring simpler worship or practice without many formal ceremonies.","zh":"反仪式主义；（尤指宗教中）反对繁琐的礼仪形式，主张更简朴、少仪式的崇拜或实践。"},"examples":[{"en":"The minister’s antiritualism emphasized plain sermons over elaborate ceremonies.","zh":"这位牧师的反仪式主义强调朴素的讲道，而不是繁复的仪式。"},{"en":"In the debate, antiritualism was linked to the idea that faith should be personal rather than theatrical.","zh":"在辩论中，反仪式主义与“信仰应当是个人的，而不是表演性的”这一观点联系在一起。"}]}],"synonyms":["anti-ritualism","opposition to ritualism","low-church attitude"],"phonetic":"/ˌæntiˈrɪtʃuəˌlɪzəm/","extraExplanation":["这个词由 anti-（反对）+ ritualism（仪式主义）构成，常见于宗教史与教会讨论中，用来描述对“过度强调礼仪、形式、外在仪式”的反对立场。","在英语语境里，antiritualism 往往不是反对“所有仪式”，而是反对“过度仪式化”（too much ritual）或把形式看得比信仰本身更重要。"]}
{"word":"antiritualist","summary":{"en":"Anti-ritualist means opposing religious rituals or the people who oppose them.","zh":"antiritualist 指反对宗教仪式（礼拜的形式化仪式）的人或立场。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to religious ritual (especially formal ceremonies in worship), or preferring simpler, less ceremonial practice.","zh":"反对宗教仪式（尤指正式礼拜仪式）的；主张更简朴、少仪式化的。"},"examples":[{"en":"Some anti-ritualist groups preferred simple prayer meetings instead of formal ceremonies.","zh":"一些反仪式主义团体更偏好简朴的祷告聚会，而不是正式的仪式。"},{"en":"His anti-ritualist views shaped how the church designed its services.","zh":"他的反仪式主义观点影响了教会如何安排礼拜程序。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who opposes religious ritual or ceremonial worship.","zh":"反对宗教仪式或礼拜仪式化的人；反仪式主义者。"},"examples":[{"en":"In that debate, anti-ritualists argued that faith matters more than ceremony.","zh":"在那场辩论中，反仪式主义者认为信仰比仪式更重要。"},{"en":"The anti-ritualist criticized the use of incense and elaborate robes.","zh":"这位反仪式主义者批评使用香和华丽法衣。"}]}],"synonyms":["anti-ceremonial","non-ritualistic","anti-liturgical"],"phonetic":"/ˌæn.tiˈrɪtʃuə.lɪst/","extraExplanation":["这个词常见于19世纪英国教会语境，尤其与英国国教内部关于“高教会（更重仪式）”与“低教会（更简朴）”的争论有关；因此它带有一定历史与宗派背景。"]}
{"word":"antiritualistic","summary":{"en":"Anti-ritualistic means against strict rituals and formal ceremonies.","zh":"Anti-ritualistic 指反对严格的仪式和形式化典礼。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to strict rituals or formal ceremonies; preferring simple, direct, or non-ceremonial ways of doing things (often in religion, politics, or organizations).","zh":"反对严格仪式或形式化典礼的；偏好简单、直接、非仪式化做法的（常用于宗教、政治或组织语境）。"},"examples":[{"en":"Some Protestant groups are strongly anti-ritualistic and keep worship services simple.","zh":"一些新教团体非常反仪式化，礼拜形式比较简朴。"},{"en":"Her anti-ritualistic attitude made her uncomfortable with long formal ceremonies.","zh":"她反仪式化的态度让她对冗长的正式典礼感到不自在。"},{"en":"The movement promoted an anti-ritualistic style, focusing on action rather than symbols.","zh":"该运动提倡反仪式化风格，强调行动而非象征。"}]}],"synonyms":["non-ritualistic","unceremonious","informal","anti-ceremonial"],"phonetic":"/ˌæn.tiˌrɪtʃ.u.əˈlɪs.tɪk/","extraExplanation":["这个词由前缀 anti-（反对）+ ritualistic（仪式化的）构成，常见于宗教史与社会文化讨论：比如某些改革运动会批评“过度仪式”导致形式大于内容，从而主张更朴素、更个人化的表达方式。","语气通常是中性到批评，取决于说话者立场：对支持传统仪式的人来说，它可能带有“缺乏庄重/传统”的暗示；对反对繁文缛节的人来说，它则是积极的。"]}
{"word":"antirobbery","summary":{"en":"Anti-robbery means designed to prevent robbery or protect against robbery.","zh":"antirobbery 指“防抢劫的；用于预防抢劫、保护安全的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Intended to prevent robbery; designed to protect people or property from theft (often used before a noun).","zh":"防抢劫的；用于预防抢劫、保护人或财物免遭盗窃的（常作定语）。"},"examples":[{"en":"The bank installed anti-robbery glass at each teller window.","zh":"银行在每个出纳窗口安装了防抢劫玻璃。"},{"en":"Many convenience stores use anti-robbery cameras and silent alarms.","zh":"许多便利店使用防抢劫摄像头和无声警报器。"},{"en":"The cashier followed the anti-robbery training during the incident.","zh":"收银员在事件中按防抢劫培训流程操作。"}]}],"synonyms":["robbery-prevention","robbery-resistant","security","protective","anti-theft"],"phonetic":"/ˌæn.tiˈrɑː.bɚ.i/","extraExplanation":["“anti-robbery”由前缀“anti-（反/防）”+“robbery（抢劫）”构成，常见于安保与商业场景，多作复合形容词放在名词前（如 anti-robbery system/training/measure）。在更口语或更常见的表达里，也常说“robbery prevention（防抢劫/防劫案预防）”或“anti-theft（防盗）”，其中 anti-theft 更偏“偷窃/盗窃”，而 robbery 强调“用暴力或威胁的抢劫”。"]}
{"word":"antirobin","summary":{"en":"“Antirobin” is an informal label meaning “against Robin,” often used online; it can be an adjective or a noun.","zh":"“antirobin”多为非正式网络用语，表示“反对/针对Robin”，可作形容词或名词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to or against someone or something named “Robin” (often used in online discussions or fandom contexts).","zh":"反对或针对名为“Robin”的人或事物（常见于网络讨论或同人圈语境）。"},"examples":[{"en":"Some fans are antirobin because they dislike Robin’s storyline.","zh":"有些粉丝是“antirobin”，因为他们不喜欢Robin的剧情线。"},{"en":"The article took an antirobin stance toward the candidate Robin Smith.","zh":"那篇文章对候选人Robin Smith持反对立场。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who is against “Robin” (a label used in informal or online contexts).","zh":"反对“Robin”的人（多为非正式或网络用语的标签）。"},"examples":[{"en":"I’m not an antirobin; I just disagree with one decision Robin made.","zh":"我不是“antirobin”，我只是不同意Robin做的一个决定。"},{"en":"The debate turned into fans versus antirobins.","zh":"那场争论变成了粉丝对“antirobins”（反对者）。"}]}],"synonyms":["anti-Robin","against Robin","opposed to Robin"],"phonetic":"/ˌæn.taɪˈrɑːbɪn/","extraExplanation":["“antirobin”不是常见的标准英语词，更多是由前缀 anti-（反对）+ Robin（人名/角色名/团体名）临时组合出来的标签，用法类似于“anti-hero”（反英雄）里的 anti-。","更常见的拼写是带连字符的“anti-Robin”，尤其当Robin是专有名词（人名、角色名、作品名）时：anti-Robin comments / an anti-Robin group。","如果你指的是“反对知更鸟（robin 这种鸟）”，通常会写成“anti-robin measures”（反知更鸟的措施）或更具体地说“measures to keep robins away”（让知更鸟远离的措施）。"]}
{"word":"antiroll","summary":{"en":"Antiroll means preventing or reducing side-to-side tilting (roll), often referring to an anti-roll bar/system in vehicles.","zh":"antiroll 指“防侧倾/减少横摇”，常指汽车的防侧倾杆或相关系统。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to prevent or reduce rolling (side-to-side tilting), especially in a vehicle or ship.","zh":"用于防止或减少“侧倾/横摇”（左右倾斜），尤指车辆或船舶的。"},"examples":[{"en":"Many cars use an antiroll bar to reduce body roll in corners.","zh":"很多汽车使用防侧倾杆来减少过弯时的车身侧倾。"},{"en":"The engineer checked the antiroll system for wear and noise.","zh":"工程师检查了防侧倾系统是否磨损、是否有异响。"}]},{"partOfSpeech":"n.","definition":{"en":"A device or system (often a bar) that reduces rolling, especially in a vehicle suspension.","zh":"防侧倾装置/系统（常指防侧倾杆），用于减少悬架侧倾。"},"examples":[{"en":"He replaced the antiroll after noticing excessive leaning on turns.","zh":"他发现转弯时倾斜过大后，更换了防侧倾装置。"},{"en":"Upgrading the antiroll can make the car feel more stable.","zh":"升级防侧倾装置能让车开起来更稳。"}]}],"synonyms":["anti-roll","roll-stabilizing","sway-bar (common US term for anti-roll bar)","stabilizer bar"],"phonetic":"ˌæn.tiˈroʊl","extraExplanation":["“antiroll”更常见的写法是 **anti-roll**（带连字符），在汽车领域最常见的固定搭配是 **anti-roll bar**（英式也常说 **anti-roll bar**，美式常见同义词 **sway bar**）。","“roll”在这里不是“滚动”，而是指车辆或船舶绕纵向轴的“横向摇摆/侧倾”（roll motion）。"]}
{"word":"antiromance","summary":{"en":"“Antiromance” describes a work or attitude that rejects or subverts traditional romantic ideals.","zh":"“antiromance”指反对或颠覆传统浪漫理想的作品或态度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a story, film, or artwork that deliberately avoids, criticizes, or subverts the usual ideas of romance (for example, happy endings, idealized love, or “meant-to-be” relationships).","zh":"（文学/影视/艺术中的）反浪漫作品：刻意回避、批评或颠覆常见浪漫叙事的作品，例如不走幸福结局、不理想化爱情或否定“命中注定”的爱情观。"},"examples":[{"en":"The movie is an antiromance: the couple doesn’t end up together, and no one calls it a tragedy.","zh":"这部电影是一部反浪漫作品：男女主没有在一起，但也没人把它当作悲剧。"},{"en":"She likes antiromance novels because they feel more honest about everyday relationships.","zh":"她喜欢反浪漫小说，因为它们对日常关系的描写更真实。"}]},{"partOfSpeech":"adj.","definition":{"en":"showing an attitude against romantic idealization; not romantic in style or expectations.","zh":"反浪漫的；不崇尚浪漫理想化的；对“浪漫化期待”持反对态度的。"},"examples":[{"en":"His antiromance view is that love is built through work, not fate.","zh":"他的反浪漫观点是：爱情靠经营，而不是靠命运。"},{"en":"The book takes an antiromance approach to dating culture.","zh":"这本书以反浪漫的方式讨论约会文化。"}]}],"synonyms":["anti-romance","anti-romantic","unromantic","de-romanticized"],"phonetic":"/ˌænti roʊˈmæns/","extraExplanation":["“anti-”是表示“反对/对立”的前缀，所以 antiromance 字面上是“反（传统）浪漫”。在评论文学和电影时，它常用来指一种叙事策略：不把爱情当作人生唯一答案，也不把结局是否在一起当作衡量成功与否的标准。"]}
{"word":"antiromantic","summary":{"en":"Antiromantic means not romantic or opposed to romantic ideals; it can also mean opposed to Romanticism in art and literature.","zh":"antiromantic 指“不浪漫/反浪漫”，也可指“反浪漫主义（文艺思潮）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not romantic; opposed to romantic feelings, gestures, or ideals (often practical, matter-of-fact, or skeptical about love).","zh":"不浪漫的；反对或不认同浪漫情感、举动或理想（常指更务实、冷静，或对爱情抱怀疑态度）。"},"examples":[{"en":"He’s not cold—he’s just antiromantic and prefers simple plans.","zh":"他不是冷漠，只是比较不浪漫，更喜欢简单的安排。"},{"en":"Her antiromantic view of love comes from watching too many messy breakups.","zh":"她对爱情的“不浪漫”看法，来自看过太多混乱的分手。"},{"en":"The movie is intentionally antiromantic, showing how love can be inconvenient.","zh":"这部电影刻意走反浪漫路线，呈现爱情可能带来的不便。"}]},{"partOfSpeech":"adj.","definition":{"en":"Opposed to Romanticism (the artistic/literary movement) or its typical style of emotion, idealization, and nature-worship.","zh":"反浪漫主义的；反对浪漫主义（文艺思潮）或其常见风格，如强调情感、理想化与对自然的崇拜。"},"examples":[{"en":"Some critics call his early poems antiromantic because they reject idealized nature.","zh":"一些评论家称他早期的诗是反浪漫主义的，因为它们拒绝对自然的理想化。"},{"en":"The novel’s antiromantic tone favors realism over passion.","zh":"这部小说的反浪漫主义语气更偏向现实主义，而非激情。"}]}],"synonyms":["unromantic","unsentimental","matter-of-fact","pragmatic","cynical","anti-sentimental"],"phonetic":"/ˌæn.ti.roʊˈmæn.tɪk/","extraExplanation":["在日常英语里，antiromantic多用来形容一个人或作品“不走浪漫路线”，比unromantic更强调“反对/抗拒”浪漫表达，而不只是“缺乏浪漫”。","在文学语境中，Romanticism（浪漫主义）常与18—19世纪的欧洲文艺思潮相关，强调强烈情感、个人体验、想象力与自然；antiromantic则常指对这些特征的反拨，更倾向冷静、克制或现实。"]}
{"word":"antiromanticism","summary":{"en":"Antiromanticism means opposition to Romanticism or, more generally, a skeptical attitude toward idealized romance.","zh":"Antiromanticism 指反浪漫主义（反对浪漫主义思潮）或更广义上对理想化浪漫/爱情的怀疑态度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to Romanticism (a major artistic and literary movement that emphasized emotion, imagination, nature, and individual freedom), or a preference for more realistic, rational, or restrained styles.","zh":"反浪漫主义：反对浪漫主义（强调情感、想象、自然与个人自由的文艺思潮），或更偏好现实、理性、克制的风格。"},"examples":[{"en":"In her essay, she argues that modern fiction often shows antiromanticism by focusing on ordinary life instead of heroic passion.","zh":"在她的文章中，她认为现代小说常以反浪漫主义的方式聚焦日常生活，而不是英雄式的激情。"},{"en":"The film’s antiromanticism comes through in its unsentimental ending.","zh":"这部电影的反浪漫主义体现在它不煽情的结局里。"}]},{"partOfSpeech":"n.","definition":{"en":"In everyday talk, a skeptical or rejecting attitude toward idealized love and romance.","zh":"（日常用语）对“理想化的爱情/浪漫”持怀疑或拒绝的态度。"},"examples":[{"en":"His antiromanticism makes him uncomfortable with grand romantic gestures.","zh":"他的反浪漫主义让他对夸张的浪漫举动感到不自在。"},{"en":"Her humor has a touch of antiromanticism: she laughs at clichés about love.","zh":"她的幽默带点反浪漫主义：她会嘲笑关于爱情的陈词滥调。"}]}],"synonyms":["anti-Romanticism","anti-romantic attitude","skepticism about romance","realism"],"phonetic":"/ˌæn.ti.roʊˈmæn.tɪ.sɪz.əm/","extraExplanation":["“anti-”表示“反对、抵制”，加在“romanticism（浪漫主义）”前面构成“antiromanticism”。它既可指文艺史中的审美立场（例如强调现实主义、讽刺、理性或社会批判），也可指日常语境里对“浪漫爱情神话”的不买账。","在文学语境中，可把它理解为对“把情感与想象抬到最高位置”的一种反拨：更重视事实、社会结构、普通人的生活与后果。"]}
{"word":"antiromanticist","summary":{"en":"Antiromanticist means someone (or something) that opposes Romanticism or rejects romantic, idealized attitudes.","zh":"antiromanticist 指反对浪漫主义（尤其艺术文学思潮）或排斥浪漫、理想化态度的人（或观点）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposes Romanticism (especially in art, literature, or cultural attitudes) or dislikes romantic/idealized ways of thinking.","zh":"反浪漫主义者；反对浪漫主义（尤指艺术、文学或文化态度）或不喜欢浪漫、理想化思维的人。"},"examples":[{"en":"As an antiromanticist, he preferred clear facts over emotional, idealized stories.","zh":"作为一个反浪漫主义者，他更偏好清晰的事实，而不是情绪化、理想化的故事。"},{"en":"Some critics called her an antiromanticist because she rejected the Romantic poets’ dramatic style.","zh":"一些评论家称她为反浪漫主义者，因为她拒绝浪漫主义诗人那种戏剧化的风格。"}]},{"partOfSpeech":"adj.","definition":{"en":"opposing Romanticism or rejecting romantic, sentimental, or idealized attitudes.","zh":"反浪漫主义的；反对浪漫主义或排斥浪漫、感伤、理想化态度的。"},"examples":[{"en":"His antiromanticist view of history focused on economics and everyday life, not heroic legends.","zh":"他对历史的反浪漫主义观点关注经济与日常生活，而不是英雄传说。"},{"en":"The essay takes an antiromanticist tone, warning readers about unrealistic fantasies.","zh":"这篇文章带有反浪漫主义的语气，提醒读者警惕不切实际的幻想。"}]}],"synonyms":["anti-Romantic","anti-sentimental","unsentimental","realist"],"phonetic":"/ˌæn.ti.roʊˈmæn.tə.sɪst/","extraExplanation":["“Romanticism（浪漫主义）”通常指18世纪末到19世纪中期的艺术与文学思潮，强调情感、想象、自然与个人体验。antiromanticist 常用于学术或评论语境，表示反对这种审美取向或思维方式。","拼写上也常见连字符形式 anti-Romanticist（更强调与“Romanticism”这场思潮相关），不带连字符的 antiromanticist 则更像一般用法。"]}
{"word":"antiroyal","summary":{"en":"Antiroyal means opposed to monarchy or royal power; it can also refer to a person who holds that view.","zh":"antiroyal 指“反君主制/反王室权力的”，也可指持这种立场的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to a monarchy or to royal power; favoring limiting or abolishing the authority of a king or queen.","zh":"反君主制的；反对王室或王权的；主张限制或废除君主权力的。"},"examples":[{"en":"Many antiroyal activists demanded a republic instead of a monarchy.","zh":"许多反君主制的活动人士要求建立共和国，而不是君主制。"},{"en":"The newspaper took an antiroyal position after the scandal.","zh":"丑闻发生后，这家报纸采取了反王室的立场。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or group that is opposed to monarchy or royal rule.","zh":"反君主制者；反对王室统治的人或团体。"},"examples":[{"en":"The antiroyals organized protests in the capital.","zh":"反君主制者在首都组织了抗议活动。"}]}],"synonyms":["anti-monarchy","republican (in the sense of supporting a republic)","anti-royalist","anti-monarchist"],"phonetic":"/ˌæntiˈrɔɪəl/","extraExplanation":["“antiroyal”常见于政治、历史或新闻语境，尤其在讨论君主制国家（如英国、西班牙、泰国等）内部对王室角色的争议时。它通常是立场描述词，不一定表示仇恨个人，而是反对“君主制/王权”这一制度或其影响。","写作中也常用更具体的词来避免误解，例如：anti-monarchy（反君主制）、republican（主张共和制的，注意在英/美语境中含义不同）、anti-royalist（反保皇派/反王室派，较少见）。"]}
{"word":"antiroyalism","summary":{"en":"Antiroyalism means opposition to monarchy or royal authority.","zh":"Antiroyalism 指反对君主制或王室权威的立场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to monarchy or royal power; the belief that a country should not be ruled by a king or queen.","zh":"反王室主义；反君主制：反对君主或王室权力，主张国家不应由国王或女王统治的立场。"},"examples":[{"en":"Antiroyalism grew after the scandal, and public support for the monarchy fell.","zh":"丑闻之后，反王室主义情绪增长，民众对君主制的支持下降。"},{"en":"The party’s platform includes strong antiroyalism and calls for a republic.","zh":"该党的政纲包含强烈的反王室立场，并呼吁建立共和国。"}]}],"synonyms":["anti-monarchism","republicanism","anti-monarchy"],"phonetic":"/ˌæn.tiˈrɔɪ.əˌlɪz.əm/","extraExplanation":["“antiroyalism”由前缀 anti-（反对）+ royal（王室的）+ -ism（主义/思想体系）组成，常用于政治与历史语境。","在英国、法国、西班牙等有君主制或曾经有君主制的国家讨论政治改革时，这个词较常见；它指的是反对“君主制/王室权威”的立场，不一定等同于反对某个具体个人。"]}
{"word":"antiroyalist","summary":{"en":"Antiroyalist means opposing the monarchy or royal power, or a person who holds that view.","zh":"antiroyalist 指反对君主制或王室权力的（立场），也可指持这种立场的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to a king/queen, the monarchy, or royal rule; not supporting the royal family’s political power.","zh":"反对君主制或王室统治的；不支持王室政治权力的。"},"examples":[{"en":"Many antiroyalist groups called for an elected head of state instead of a monarch.","zh":"许多反君主制团体主张由民选国家元首取代君主。"},{"en":"Her antiroyalist views became stronger after the political scandal.","zh":"那场政治丑闻之后，她的反王室观点变得更坚定。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who opposes a monarchy or royal authority.","zh":"反对君主制或王室权威的人；反君主制者。"},"examples":[{"en":"The protest included republicans, reformers, and antiroyalists.","zh":"这场抗议包含共和派、改革派和反君主制者。"},{"en":"He was labeled an antiroyalist by newspapers that supported the crown.","zh":"支持王室的报纸给他贴上了“反君主制者”的标签。"}]}],"synonyms":["anti-monarchist","republican (in the sense of opposing a monarchy)","anti-crown","anti-monarchy"],"phonetic":"/ˌæn.tiˈrɔɪ.ə.lɪst/","extraExplanation":["“anti-”是常见前缀，表示“反对/对抗”；“royalist”指“支持王室/君主制的人或立场”。因此 antiroyalist 字面意思就是“反王室/反君主制”。","在不同国家语境中，它常与“republican（共和主义者）”相关，但不完全相同：反君主制的人通常支持废除君主制，但未必在所有政策上都与某一共和政党一致。"]}
{"word":"Antirrhinum","summary":{"en":"Antirrhinum = the plant genus known as snapdragons.","zh":"Antirrhinum 指“金鱼草属”，也就是常说的 snapdragon（龙口花/金鱼草）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants commonly called snapdragons, known for their colorful, “dragon-mouth” shaped flowers.","zh":"金鱼草属（Antirrhinum），一种常见观赏开花植物，因花形像“龙嘴”而得名，花色丰富。"},"examples":[{"en":"Antirrhinum is popular in gardens because it blooms in many bright colors.","zh":"金鱼草属植物在花园里很受欢迎，因为它能开出许多鲜艳的颜色。"},{"en":"The florist used Antirrhinum (snapdragon) to add height to the arrangement.","zh":"花艺师用金鱼草（snapdragon）来增加花束的层次和高度。"}]}],"synonyms":["snapdragon","Antirrhinum majus"],"phonetic":"/ˌæn.tɪˈraɪ.nəm/","extraExplanation":["词源来自希腊语：anti-（像、类似）+ rhis/rhinos（鼻子），指花朵形状像鼻子或动物的口鼻；英语常用名 snapdragon 形象地描述了花被轻捏时像“龙嘴”开合的样子。","在园艺与花艺语境中，Antirrhinum 通常特指常见的园艺金鱼草（Antirrhinum majus），多用于花坛、切花与盆栽。"]}
{"word":"antirrhinum","summary":{"en":"Antirrhinum is the botanical name for the snapdragon, a colorful garden flower with a “mouth-like” bloom.","zh":"Antirrhinum 是“金鱼草（snapdragon）”的植物学名称，花朵颜色丰富、花形像“嘴”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a garden plant with tall stems and colorful flowers shaped like a “mouth,” commonly called a snapdragon","zh":"一种花园植物，花序直立、花朵色彩丰富，花形像“嘴”，常见俗名为“金鱼草（snapdragon）”"},"examples":[{"en":"Antirrhinum (snapdragon) is often planted in spring gardens for bright color.","zh":"金鱼草（Antirrhinum，snapdragon）常被种在春季花园里增添鲜艳色彩。"},{"en":"She cut a few antirrhinums and put them in a vase by the window.","zh":"她剪了几枝金鱼草，插在窗边的花瓶里。"}]}],"synonyms":["snapdragon"],"phonetic":"/ˌæn.tɪˈraɪ.nəm/","extraExplanation":["Antirrhinum 是拉丁化的植物学属名，常见园艺用语里更常说 snapdragon（“金鱼草/龙口花”）。之所以叫 snapdragon，是因为花冠两片“嘴唇”状的结构轻轻一捏会像“张嘴/咬合”一样开合，像会“咬人”的小龙口。","在园艺语境中，你可能会看到复数 antirrhinums（英式拼写也常见 antirrhinum 作复数不变，视写作者而定）。"]}
{"word":"antirumor","summary":{"en":"An antirumor is a message meant to counter a rumor by correcting it or denying it with facts.","zh":"antirumor 指用事实更正或否认来对抗谣言的澄清信息。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Information or a message spread to stop, correct, or weaken a rumor by giving the true facts (or an official denial).","zh":"用来阻止、纠正或削弱谣言的信息或消息（通常是澄清事实或官方否认）。"},"examples":[{"en":"The company released an antirumor to calm customers after the false story spread online.","zh":"在虚假消息在网上扩散后，公司发布了反谣言澄清来安抚顾客。"},{"en":"Good antirumors are specific: they explain what happened and provide evidence.","zh":"好的反谣言澄清要具体：说明发生了什么，并提供证据。"}]}],"synonyms":["rumor control","counter-rumor","denial","correction","rebuttal","fact-check"],"phonetic":"/ˌæn.tiˈru.mɚ/","extraExplanation":["“antirumor”在日常英语里不算常见，更常见的说法有“rumor control”（谣言管控/辟谣机制）、“a denial”（否认声明）、“a correction”（更正）、“a fact-check”（事实核查）或“a rebuttal”（反驳/驳斥）。","这个词有时会写成“anti-rumor”。多用于新闻传播、公共关系、危机公关等语境，强调“针对谣言的对冲信息”。"]}
{"word":"antirun","summary":{"en":"Anti-run describes fabric (especially hosiery) made to resist runs/laddering; it can also refer to the feature or finish that prevents runs from spreading.","zh":"Anti-run 指（尤指丝袜等针织物）防抽丝/不易跑线的；也可指防跑线的功能或处理工艺。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of fabric, especially stockings/tights) designed to prevent or reduce runs (long tears caused by pulled threads).","zh":"（指布料，尤指长袜/连裤袜）防抽丝的；不易“跑线”（被勾到后出现纵向长裂口）的。"},"examples":[{"en":"These tights are anti-run, so they’re less likely to ladder if you snag them.","zh":"这款连裤袜是防抽丝的，所以就算勾到也不太容易跑线。"},{"en":"She bought anti-run stockings for work because she walks a lot during the day.","zh":"她上班要走很多路，所以买了防抽丝的长袜。"}]},{"partOfSpeech":"n.","definition":{"en":"A product feature or treatment intended to stop runs from spreading in fabric.","zh":"（产品）防跑线功能；（处理工艺）防抽丝处理。"},"examples":[{"en":"The label says it has an anti-run finish.","zh":"标签上写着它有防跑线的处理。"}]}],"synonyms":["run-resistant","ladder-resistant","snag-resistant"],"phonetic":"/ˌæn.tiˈrʌn/","extraExplanation":["“antirun”更常见的写法是带连字符的“anti-run”。这里的run不是“跑步”，而是指丝袜、针织物被勾丝后出现的纵向裂口；英式英语里也常用“ladder”描述这种现象（如：laddered tights）。"]}
{"word":"antirust","summary":{"en":"Antirust means preventing rust, or a product used to stop metal from rusting.","zh":"antirust 指“防锈的”，也可指“防锈剂/防锈产品”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a substance or treatment) preventing rust from forming on metal.","zh":"（指物质或处理方式）防锈的；防止金属生锈的。"},"examples":[{"en":"Use an antirust spray on the hinges to keep them from corroding.","zh":"在铰链上喷防锈喷剂，防止它们腐蚀。"},{"en":"The bike frame has an antirust coating.","zh":"这辆自行车车架有防锈涂层。"}]},{"partOfSpeech":"n.","definition":{"en":"a product (such as a paint, oil, or spray) used to prevent rust.","zh":"防锈剂；防锈产品（如防锈漆、防锈油或喷剂）。"},"examples":[{"en":"This antirust works well for tools stored in a humid garage.","zh":"这种防锈剂对存放在潮湿车库里的工具很有效。"},{"en":"Apply a thin layer of antirust before winter.","zh":"入冬前涂一层薄薄的防锈剂。"}]}],"synonyms":["rustproof","rust-resistant","anticorrosive","anti-corrosion"],"phonetic":"/ˌæn.tiˈrʌst/","extraExplanation":["拼写上常见三种：antirust、anti-rust、anti rust。作为定语修饰名词时（如 anti-rust paint）更常见带连字符的写法。日常英语里也常用更直接的说法：rustproof / rust-resistant（防锈的）。"]}
{"word":"antirusts","summary":{"en":"“Antirusts” are products or treatments that prevent rust; “antirust” can also describe something rust-resistant.","zh":"“antirusts”指多种防锈产品或处理方法；“antirust”也可作形容词，表示防锈/抗锈。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance, coating, or treatment used to prevent metal from rusting (plural form: antirusts)","zh":"防锈剂；防锈涂层；防锈处理（复数：antirusts）"},"examples":[{"en":"The mechanic applied an antirust to the car’s underbody before winter.","zh":"修理工在冬天来临前在汽车底盘喷涂了防锈剂。"},{"en":"Different antirusts work better on different kinds of metal.","zh":"不同的防锈剂对不同种类的金属效果更好。"}]},{"partOfSpeech":"adj.","definition":{"en":"designed to prevent rust; rust-resistant","zh":"防锈的；抗锈的"},"examples":[{"en":"We chose antirust paint for the outdoor gate.","zh":"我们给室外大门选了防锈漆。"},{"en":"Antirust coating helps tools last longer in humid weather.","zh":"防锈涂层能让工具在潮湿天气里更耐用。"}]}],"synonyms":["rust inhibitor","rustproofing (treatment)","anti-corrosion coating","protective coating"],"phonetic":"/ˌæntiˈrʌst/","extraExplanation":["“Antirusts”通常表示多种防锈产品/配方（例如底漆、喷雾、防锈油、涂层）。日常写法里也常见带连字符的形式：anti-rust。","常见搭配：antirust paint（防锈漆）、antirust coating（防锈涂层）、antirust spray（防锈喷雾）、apply antirust（涂/喷防锈剂）。"]}

