{"word":"antieavesdropping","summary":{"en":"Anti-eavesdropping means preventing secret listening or interception, or the tools and measures used to stop it.","zh":"anti-eavesdropping 指“防止窃听/截听”，也可指用于反窃听的工具与措施。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to prevent someone from secretly listening to (or intercepting) private conversations or communications.","zh":"用于防止他人暗中窃听或截获私密谈话/通信的。"},"examples":[{"en":"The meeting room has anti-eavesdropping equipment to keep negotiations private.","zh":"会议室配备了反窃听设备，以确保谈判内容保密。"},{"en":"They use anti-eavesdropping measures like encrypted calls and secure rooms.","zh":"他们采取了反窃听措施，比如加密通话和安全房间。"}]},{"partOfSpeech":"n.","definition":{"en":"Methods, tools, or technology used to stop eavesdropping (for example, encryption, sound masking, or bug detection).","zh":"用于阻止窃听的方法、工具或技术（如加密、声音掩蔽、反窃听检测等）。"},"examples":[{"en":"The company invested in anti-eavesdropping to protect customer data.","zh":"公司投入反窃听技术来保护客户数据。"},{"en":"Anti-eavesdropping is important when discussing trade secrets.","zh":"讨论商业机密时，反窃听非常重要。"}]}],"synonyms":["counter-eavesdropping","anti-surveillance","secure communication","bug detection","encryption"],"phonetic":"/ˌæn.ti ˈiːvzˌdrɑː.pɪŋ/","extraExplanation":["“anti-”表示“反对/防止”，eavesdropping 指“偷听、窃听”。在信息安全语境里常见的相关词还有：encryption（加密）、counter-surveillance（反监视）、bug sweep（排查窃听器）。","这个词更常见的写法是带连字符的 “anti-eavesdropping”。在正式写作中也可以用更常见的表达：anti-eavesdropping measures（反窃听措施）或 anti-eavesdropping devices（反窃听设备）。"]}
{"word":"antiecclesiastic","summary":{"en":"Antiecclesiastic means opposed to the church or clergy, or a person who holds that opposition.","zh":"Antiecclesiastic 指反对教会或神职人员的（形容词），也可指反教会者（名词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to the church, clergy, or organized religious authority (especially in political or social matters).","zh":"反教会的；反对教会、神职人员或有组织宗教权威的（尤指政治或社会事务中）。"},"examples":[{"en":"The newspaper took an antiecclesiastic stance during the debate on church influence in schools.","zh":"在关于教会对学校影响的辩论中，这家报纸采取了反教会的立场。"},{"en":"Some reforms were seen as antiecclesiastic because they reduced the power of the clergy.","zh":"一些改革被视为反教会的，因为它们削弱了神职人员的权力。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who is opposed to the church or clergy.","zh":"反教会者；反对教会或神职人员的人。"},"examples":[{"en":"In the novel, he is portrayed as an antiecclesiastic who distrusts religious institutions.","zh":"在小说中，他被描写成一个不信任宗教机构的反教会者。"}]}],"synonyms":["anticlerical","anti-church","anti-clerical","anti-religious (context-dependent)"],"phonetic":"/ˌæntiɪˌkliːziˈæstɪk/","extraExplanation":["这个词比较少见、偏正式，常出现在历史、政治或社会评论语境中，讨论“教会权力”“政教关系”“反神职主义（anticlericalism）”等议题。","词形由 anti-（反对）+ ecclesiastic（教会的；神职人员的）构成。日常英语里更常用的相关词是 anticlerical（反神职人员的）或 anti-church（反教会的，较口语）。"]}
{"word":"antiecclesiastical","summary":{"en":"Antiecclesiastical means opposed to the church—especially to an established church’s power or influence in public life.","zh":"Antiecclesiastical 指“反教会的”，尤其指反对国教或教会在公共生活中的权力与影响。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to the church or to church influence in society and government (especially the authority of an established church).","zh":"反教会的；反对教会（尤其是反对国教或教会在社会与政府中的影响力/权威）的。"},"examples":[{"en":"Some politicians took an antiecclesiastical stance and argued for a clear separation of church and state.","zh":"一些政治人物持反教会立场，主张政教明确分离。"},{"en":"The movement was strongly antiecclesiastical, criticizing church control over education.","zh":"该运动强烈反教会，批评教会对教育的控制。"}]}],"synonyms":["anti-clerical","anti-church","anticlerical","antiestablishment (context-dependent)"],"phonetic":"/ˌæn.ti.ɪˌkli.ziˈæs.tɪ.kəl/","extraExplanation":["这个词由 anti-（反对）+ ecclesiastical（教会的，尤指基督教会的）构成，常用于历史或政治语境，描述“反对教会权力/特权”的立场，而不一定是反对宗教信仰本身。","ecclesiastical 来自希腊语 ekklēsia（集会、教会）。在英语历史中，讨论国教（established church）、神职人员特权、教会在教育/税收/政治中的影响时，可能会看到 antiecclesiastical 这类词。","拼写较长、偏正式，学术写作或历史研究中更常见；日常表达里更常用 anti-church、anti-clerical（反教权/反教士）等更短的说法。"]}
{"word":"antiecclesiastically","summary":{"en":"“Antiecclesiastically” means “in an anti-church (anti-clergy) way.”","zh":"“Antiecclesiastically”意为“以反教会/反神职权威的方式（行事或表达）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is opposed to the church, clergy, or church authority (ecclesiastical matters).","zh":"以反对教会、神职人员或教会权威（教会事务）的方式。"},"examples":[{"en":"The pamphlet argued antiecclesiastically, criticizing the power of the clergy in politics.","zh":"这本小册子以反教会的立场论述，批评神职人员在政治中的权力。"},{"en":"Some writers spoke antiecclesiastically during the reform movement, calling for limits on church influence.","zh":"在改革运动中，一些作家以反教会的口吻发声，呼吁限制教会影响力。"}]}],"synonyms":["anti-church","anti-clerical","anti-ecclesiastical"],"phonetic":"/ˌæntiɪˌkliːziˈæstɪkli/","extraExplanation":["这个词很少在日常英语中使用，更常见的是 anti-ecclesiastical（形容词，“反教会的”）。","构词：anti-（反对）+ ecclesiastical（教会的、神职的）+ -ly（副词后缀），因此意思就是“以反教会的方式”。","ecclesiastical 来自希腊语 ekklēsia，意为“集会、教会”；在历史与政治语境中常指“教会机构/教会权力”。"]}
{"word":"antiecclesiasticism","summary":{"en":"Antiecclesiasticism means opposition to church or clergy influence, especially in politics and public life.","zh":"Antiecclesiasticism 指反对教会或神职人员在政治与公共生活中拥有影响力的立场或情绪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"opposition to the power, influence, or involvement of the Christian Church (especially established churches) and clergy in politics or public life; anti-clerical sentiment.","zh":"反教会主义；反教权主义：反对基督教会（尤其是国教/既定教会）及神职人员在政治或公共生活中的权力与影响的立场或情绪。"},"examples":[{"en":"In the late nineteenth century, antiecclesiasticism grew as people pushed for a clearer separation of church and state.","zh":"在19世纪末，随着人们推动政教更清晰的分离，反教会主义逐渐增强。"},{"en":"His speech was criticized for stirring antiecclesiasticism rather than debating policy details.","zh":"他的演讲被批评是在煽动反教会主义情绪，而不是讨论政策细节。"},{"en":"The reform movement included strong antiecclesiasticism aimed at reducing clerical control over education.","zh":"该改革运动包含强烈的反教会主义，目的是削弱神职人员对教育的控制。"}]}],"synonyms":["anticlericalism","anti-clericalism","anti-church sentiment","secularism (related, broader)"],"phonetic":"/ˌæn.ti.ɪˌkli.ziˈæs.tɪˌsɪz.əm/","extraExplanation":["这个词比较学术/历史语境常见，常与欧洲近代史中的“反教权（anticlericalism）”相关：例如争议点包括教会是否应影响立法、教育、婚姻登记、税收与公共资源分配等。","构词上：anti-（反对）+ ecclesiastic（教会的/神职人员的）+ -ism（主义/倾向）。在实际写作中，更多人会用更常见的 anticlericalism 来表达类似意思。"]}
{"word":"antiedemic","summary":{"en":"Antiedemic (more commonly written anti-epidemic) means ‘related to preventing or fighting an epidemic.’","zh":"antiedemic（更常写作 anti-epidemic）指“与预防或对抗流行病有关的；防疫/抗疫的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) intended to prevent, control, or fight an epidemic; anti-epidemic.","zh":"（罕用）用于预防、控制或对抗流行病的；抗疫的；防疫的。"},"examples":[{"en":"Vaccination is one of the most effective anti-epidemic measures.","zh":"接种疫苗是最有效的防疫措施之一。"},{"en":"Hospitals increased anti-epidemic supplies such as masks and disinfectant.","zh":"医院增加了口罩、消毒剂等防疫物资。"}]}],"synonyms":["anti-epidemic","preventive","prophylactic","disease-control"],"phonetic":"/ˌæn.taɪˌɛp.əˈdɛm.ɪk/","extraExplanation":["“antiedemic”在英语里非常少见，更常见、也更自然的写法是 **anti-epidemic**（常用连字符）。在日常表达中，人们也常说 **preventive measures**（预防措施）、**epidemic control**（疫情防控）、或直接用 **public health measures**（公共卫生措施）。","词形提示：**anti-** 表示“反对/抵抗”，**epidemic** 表示“流行病/疫情的”。把两者合在一起就是“抗（流行病）的”。"]}
{"word":"antieducation","summary":{"en":"“Anti-education” describes attitudes or policies that oppose education or discourage learning.","zh":"anti-education 指反对教育、打压学习或削弱受教育机会的态度或政策。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to education or to a particular kind of education; discouraging learning or schooling.","zh":"反对教育的；反对某种教育形式的；抑制学习或上学的。"},"examples":[{"en":"The mayor criticized the cuts as an anti-education policy.","zh":"市长批评这些削减预算是“反教育”的政策。"},{"en":"Some people call it anti-education when leaders spread misinformation about schools.","zh":"当领导者散布关于学校的虚假信息时，有人称之为“反教育”。"}]},{"partOfSpeech":"n.","definition":{"en":"Ideas, actions, or attitudes that oppose education or reduce opportunities to learn.","zh":"反对教育或减少学习机会的观念、行为或态度。"},"examples":[{"en":"The report describes anti-education as a threat to equal opportunity.","zh":"报告将“反教育”描述为对平等机会的威胁。"},{"en":"They organized a campaign against anti-education and for better libraries.","zh":"他们发起了一场反对“反教育”、支持更好图书馆的运动。"}]}],"synonyms":["anti-intellectual","anti-academic","anti-learning","anti-school"],"phonetic":"/ˌænti ˌɛdʒəˈkeɪʃən/","extraExplanation":["“anti-education”更常见的写法是带连字符的 anti-education；也可写作 antieducation，但在正式写作中建议用连字符以增强可读性。","这个词多用于政治、社会评论语境，带有强烈的评价色彩，通常用来批评某些政策（如削减教育经费、限制课程内容、打压教师/学术自由）或反智倾向。","与之相关的常见表达有 anti-intellectual（反智的）、anti-academic（反学术的）、anti-science（反科学的）。"]}
{"word":"antieducational","summary":{"en":"“Antieducational” means opposed to education or harmful to learning.","zh":"“antieducational”表示反教育的，或对学习/教育有害的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to education, learning, or the goals of schooling; likely to reduce learning or discourage people from being educated.","zh":"反教育的；反对教育、学习或学校教育目标的；可能削弱学习或打击人们受教育意愿的。"},"examples":[{"en":"Cutting library funding is seen by many teachers as an antieducational policy.","zh":"许多老师认为削减图书馆经费是一项反教育的政策。"},{"en":"The film critic said the show’s message was antieducational because it mocked curiosity and reading.","zh":"影评人说这档节目的信息是反教育的，因为它嘲笑好奇心和阅读。"},{"en":"Rules that punish students for asking questions can create an antieducational classroom atmosphere.","zh":"惩罚学生提问的规定会造成一种反教育的课堂氛围。"}]}],"synonyms":["anti-education","anti-intellectual","anti-learning","educationally harmful","countereducational"],"phonetic":"/ˌæntaɪˌɛdʒəˈkeɪʃənəl/","extraExplanation":["“antieducational”由前缀 anti-（反对）+ educational（教育的）构成，常用于讨论政策、制度、社会风气或媒体内容对学习的负面影响。","这个词在日常口语中不算常见，更常见的替代说法有“against education / harmful to education / discouraging learning”等；写作中用它能更直接、批判性地表达立场。"]}
{"word":"antieducationalist","summary":{"en":"An antieducationalist is someone (or something) opposed to education or formal schooling.","zh":"antieducationalist 指反对教育或正规学校教育的人（或反教育的立场/做法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposes education or formal schooling, or who argues that education is harmful or unnecessary","zh":"反教育主义者；反对教育或正规学校教育的人（认为教育有害或不必要的人）"},"examples":[{"en":"The columnist was criticized as an antieducationalist after arguing that schools do more harm than good.","zh":"这位专栏作家因主张“学校弊大于利”而被批评为反教育主义者。"},{"en":"Calling her an antieducationalist is unfair—she supports learning, just not expensive private schools.","zh":"说她是反教育主义者并不公平——她支持学习，只是不支持昂贵的私立学校。"}]},{"partOfSpeech":"adj.","definition":{"en":"opposed to education or formal schooling","zh":"反教育的；反对教育或正规学校教育的"},"examples":[{"en":"Some people described the policy as antieducationalist because it reduced funding for public libraries.","zh":"有人把这项政策称为反教育的，因为它削减了公共图书馆的经费。"}]}],"synonyms":["anti-education","anti-intellectual","anti-school","anti-academic"],"phonetic":"/ˌæn.tiˌɛdʒ.əˈkeɪ.ʃə.nə.lɪst/","extraExplanation":["这个词比较少见，通常写作 anti-educationalist（也可写成 antieducationalist）。由 anti-（反对）+ educational（教育的）+ -ist（……主义者/从业者/拥护者）构成。","在实际英语中，更常见的表达是 anti-education、anti-intellectual（反智的）、anti-school（反对学校教育的）。使用 antieducationalist 往往带有批评或讽刺的语气。"]}
{"word":"antieducationally","summary":{"en":"Antieducationally means “in a way that is against education or learning.”","zh":"antieducationally 的意思是“以反教育、反学习的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that opposes education, learning, or educational goals; against what is educational.","zh":"以反教育的方式；反对教育、学习或教育目标地。"},"examples":[{"en":"The policy was criticized for acting antieducationally by cutting library funding.","zh":"这项政策因削减图书馆经费而被批评为带有反教育倾向。"},{"en":"If we punish curiosity, we are behaving antieducationally.","zh":"如果我们惩罚好奇心，我们就是在做反教育的事。"}]}],"synonyms":["anti-educationally","in an anti-educational way","against education","counterproductively (in learning contexts)"],"phonetic":"/ˌæntiˌɛdʒəˈkeɪʃənəli/","extraExplanation":["“antieducationally”由 anti-（反对）+ educational（教育的）+ -ly（副词后缀）构成，用来描述行为或做法“以反教育的方式”。这个词在日常英语中较少见，更常见的表达是 “in an anti-educational way” 或直接用形容词 “anti-educational”。","拼写上也可能看到带连字符的形式 “anti-educationally”，更清晰易读。"]}
{"word":"antieducationist","summary":{"en":"Antieducationist means a person—or a viewpoint—that opposes education, especially the expansion of public schooling.","zh":"Antieducationist 指反对教育（尤指反对公共教育的普及与扩张）的人或立场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposes education or expanded public schooling (especially reforms that increase access to education)","zh":"反对教育者；反对扩大教育（尤指反对普及或改革公共教育）的人"},"examples":[{"en":"In the 1800s, some antieducationists argued that mass schooling would disrupt social order.","zh":"在19世纪，一些反对教育者认为普及教育会破坏社会秩序。"},{"en":"She criticized antieducationists for trying to cut funding for public schools.","zh":"她批评那些反对教育者试图削减公立学校经费。"}]},{"partOfSpeech":"adj.","definition":{"en":"opposed to education or to expanding educational opportunities","zh":"反对教育的；反对扩大受教育机会的"},"examples":[{"en":"The group took an antieducationist stance toward free secondary education.","zh":"该团体对免费中等教育采取反对立场。"},{"en":"His antieducationist views were unpopular among young voters.","zh":"他的反教育观点在年轻选民中并不受欢迎。"}]}],"synonyms":["opponent of education","anti-schooling","education critic","anti–public education"],"phonetic":"/ˌæn.tiˌɛdʒəˈkeɪ.ʃə.nɪst/","extraExplanation":["这个词通常出现在历史或社会议题语境中，用来描述反对“普及教育/公共教育扩张”的立场或人群。在英语写作里，它常与特定历史时期（如19世纪关于公立学校的争论）或政策争议（教育预算、义务教育、教育改革）相关。","构词上是 anti-（反对）+ education（教育）+ -ist（……主义者/……者），因此语气往往带有批评或对立意味；正式写作中也可能用更中性的说法，如 “opponent of public education expansion”。"]}
{"word":"antiegoism","summary":{"en":"Antiegoism means opposition to egoism or self-interest as the main guide for action.","zh":"Antiegoism 指反对利己主义/自我中心，把只为自身利益行事视为不当。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to egoism; the belief that people should not act only for their own self-interest.","zh":"反对利己主义（自我中心主义）；主张人不应只为自己的利益行事。"},"examples":[{"en":"In ethics class, we compared egoism with antiegoism, which emphasizes concern for others.","zh":"在伦理课上，我们比较了利己主义和反利己主义；后者强调对他人的关怀。"},{"en":"Her volunteer work reflected a kind of antiegoism: she put community needs first.","zh":"她的志愿服务体现了一种反利己主义：把社区的需要放在第一位。"}]}],"synonyms":["anti-egoism","anti-selfishness","opposition to egoism"],"phonetic":"/ˌæntiˈiɡoʊˌɪzəm/","extraExplanation":["“antiegoism”较少见，更常见的写法是“anti-egoism”（带连字符），意思是“反对利己主义/自我中心”。在哲学语境中常与“altruism（利他主义）”一起讨论，但两者不完全等同：反利己主义强调“不应只为自己”，而利他主义更强调“应当为他人”。"]}
{"word":"antiegoist","summary":{"en":"Anti-egoist means opposing egoism (self-interest first), or a person who holds that view.","zh":"anti-egoist 指反对利己主义（把自身利益放在第一位）的；也指持这种观点的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to egoism; against putting one’s own interests first (often used in ethics or philosophy).","zh":"反对利己主义的；主张不应把个人利益放在第一位（常用于伦理学或哲学语境）。"},"examples":[{"en":"Her anti-egoist values led her to volunteer regularly.","zh":"她的反利己主义价值观促使她经常做志愿服务。"},{"en":"Some moral theories are strongly anti-egoist and emphasize duty to others.","zh":"一些道德理论强烈反对利己主义，强调对他人的义务。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who opposes egoism; someone who believes people should not act mainly for self-interest.","zh":"反利己主义者；主张人不应主要为了个人私利而行动的人。"},"examples":[{"en":"He described himself as an anti-egoist who tries to share credit with the whole team.","zh":"他形容自己是反利己主义者，会把功劳分享给整个团队。"},{"en":"In the debate, the anti-egoists argued that cooperation benefits everyone.","zh":"在辩论中，反利己主义者认为合作对所有人都有益。"}]}],"synonyms":["altruistic","selfless","unselfish","other-regarding","anti-selfish"],"phonetic":"/ˌæntiˈiɡoʊɪst/","extraExplanation":["“anti-”意为“反对/对抗”，加在“egoist（利己主义者）”前形成“anti-egoist”。在日常英语里更常见的表达是“anti-egoism”（反对利己主义）或直接说“altruistic（利他的）/ anti-selfish（反自私的）”。","在哲学讨论中，“egoism”常指伦理利己主义（ethical egoism）：认为人应当追求自身利益；“anti-egoist”则表示反对这种观点，强调关怀他人、义务或公共利益。","拼写上更常见带连字符：anti-egoist；不带连字符（antiegoist）较少见，但含义相同。"]}
{"word":"antiegoistic","summary":{"en":"“Antiegoistic” means opposing egoism and being unselfish or altruistic.","zh":"“Antiegoistic”表示反对自我主义，强调不自私、利他。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to egoism; not driven by self-interest or self-centeredness.","zh":"反自我主义的；反对利己/自我中心的。"},"examples":[{"en":"Her antiegoistic attitude made her share credit with the whole team.","zh":"她反自我主义的态度让她把功劳与整个团队分享。"},{"en":"The group promotes antiegoistic values such as generosity and empathy.","zh":"这个团体提倡慷慨与同理心等反自我主义的价值观。"}]}],"synonyms":["unselfish","altruistic","selfless","other-centered","non-egotistical"],"phonetic":"/ˌæntiˌiɡoʊˈɪstɪk/","extraExplanation":["“antiegoistic”较少见，更常见的写法是“anti-egoistic”或用更常用的词替代，如“unselfish / altruistic”。","构词：anti-（反对）+ egoistic（利己的、自我中心的）。在学术或哲学语境中更可能出现，用来讨论“egoism（自我主义）”与其相反的道德立场。"]}
{"word":"antiegoistical","summary":{"en":"“Antiegoistical” means “not egotistical,” describing someone humble and not self-centered.","zh":"“Antiegoistical”指“不自我中心/不自大”，形容一个人谦逊、不以自我为中心。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not egotistical; not centered on your own importance. Humble or self-effacing in attitude.","zh":"不自我中心的；不自大自负的；谦逊、不张扬的。"},"examples":[{"en":"She’s talented, but her antiegoistical attitude makes her easy to work with.","zh":"她很有才华，但她不自我中心的态度让她很容易合作。"},{"en":"He accepted the award in an antiegoistical way, thanking the whole team first.","zh":"他以不张扬的方式接受奖项，先感谢了整个团队。"},{"en":"The leader’s antiegoistical style helped build trust in the group.","zh":"这位领导不自大的风格帮助团队建立了信任。"}]}],"synonyms":["humble","unassuming","self-effacing","modest","not egotistical"],"phonetic":"/ˌæn.tiˌiː.ɡəˈtɪs.tɪ.kəl/","extraExplanation":["这个词比较少见，更常见的表达是 not egotistical、unassuming、humble、self-effacing。","拼写上你写的 antiegoistical 也可以见到写作 anti-egoistical；与 egoistical（自我中心的）相对，前缀 anti- 表示“反对/不…”。"]}
{"word":"antiegotism","summary":{"en":"Antiegotism means opposing egotism—resisting being overly self-centered or self-important.","zh":"antiegotism 指反对自我中心/自我夸大，强调克制过度的自我重要感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to egotism; an attitude or principle of resisting self-centeredness and excessive self-importance.","zh":"反对自我中心（自我夸大）；指抵制过度自我重要感的一种态度或原则。"},"examples":[{"en":"Her antiegotism showed in the way she listened more than she spoke.","zh":"她更愿意倾听而不是抢着发言，这体现了她的反自我中心态度。"},{"en":"The group’s culture of antiegotism encouraged members to share credit for success.","zh":"这个团队的反自我中心文化鼓励成员把成功归功于大家。"}]}],"synonyms":["humility","selflessness","modesty","anti-egotism","anti-egoism"],"phonetic":"/ˌæntaɪˈiɡəˌtɪzəm/","extraExplanation":["这个词比较少见，更常见的写法是 **anti-egotism**（常带连字符）。其中 **ego**（自我）+ **-tism / -ism**（某种倾向或主义）构成 **egotism**（自我中心、自我夸大），再加前缀 **anti-** 表示“反对”。","语境上它常用于强调“谦逊、把功劳归于集体、避免抢风头”等价值观；在日常英语中，人们更常用 **humility**（谦逊）、**selflessness**（无私）、或说 **not being egotistical**（不自我中心）来表达。"]}
{"word":"antiegotist","summary":{"en":"An antiegotist is someone who opposes egotism and promotes humility over self-centeredness.","zh":"antiegotist 指反对自我中心（自我主义/自我夸耀）并强调谦逊的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposes egotism (excessive self-focus) or argues against people who talk about themselves too much","zh":"反自我主义者；反对自我中心/自我夸耀的人（也指批评爱谈论自己的人）"},"examples":[{"en":"She’s an antiegotist who believes good leadership starts with humility.","zh":"她反对自我中心，认为好的领导力应从谦逊开始。"},{"en":"In the debate, he played the antiegotist, criticizing the speaker’s constant “I, I, I.”","zh":"在辩论中，他扮演反自我主义者的角色，批评发言者不断强调“我、我、我”。"}]}],"synonyms":["opponent of egotism","anti-ego person","humility advocate","critic of self-centeredness"],"phonetic":"/ˌæntiˈiːɡəˌtɪst/","extraExplanation":["“antiegotist”是由前缀 anti-（反对）+ egotist（自我主义者/自我中心的人）构成的派生词，整体意思就是“反对自我中心的人”。","这个词在现代英语中相对少见，日常更常用的表达包括：anti-ego、against egotism、someone who values humility（重视谦逊的人）等。"]}
{"word":"antiegotistic","summary":{"en":"“Antiegotistic” means not self-centered—showing opposition to egotism and a selfless attitude.","zh":"“antiegotistic”表示不以自我为中心、反对自我主义，强调无私的态度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to egotism; not self-centered; showing a selfless attitude.","zh":"反自我中心的；反对自我主义的；表现出无私态度的。"},"examples":[{"en":"Her antiegotistic approach made the group feel heard and respected.","zh":"她那种反自我中心的做法让团队感到被倾听和尊重。"},{"en":"The essay praises antiegotistic virtues like humility and service.","zh":"这篇文章赞扬了谦逊与服务他人等反自我中心的美德。"}]}],"synonyms":["selfless","unselfish","humble","modest","altruistic","other-centered"],"phonetic":"/ˌæntiˌiɡoʊˈtɪstɪk/","extraExplanation":["“antiegotistic”比较少见；更常见的写法是 **anti-egotistic**（带连字符）或直接用 **selfless / humble / unselfish** 来表达。","词根提示：**anti-**（反对）+ **ego**（自我）+ **-istic**（……的）。","注意拼写：英语里更常见的是 **egotistic**（以自我为中心的），而不是 *egotistical* 的这种派生形式在这里使用。"]}
{"word":"antiegotistical","summary":{"en":"Antiegotistical means not egotistical—modest and not self-centered.","zh":"antiegotistical 指“不自我中心、谦虚低调”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not egotistical; modest or humble, showing little concern for one’s own importance.","zh":"不自我中心的；谦虚的、低调的；不把自己看得过于重要。"},"examples":[{"en":"Despite the praise, she stayed antiegotistical and thanked the whole team.","zh":"尽管被表扬，她仍然很谦虚，把功劳归给整个团队。"},{"en":"His antiegotistical attitude made him easy to work with.","zh":"他不自我中心的态度让人很容易与他合作。"},{"en":"The best leaders can be confident without losing an antiegotistical spirit.","zh":"最好的领导者能自信，但不失谦逊的精神。"}]}],"synonyms":["humble","modest","unassuming","non-egotistical","unegotistical"],"phonetic":"/ˌæn.tiˌiː.ɡəˈtɪs.tɪ.kəl/","extraExplanation":["这个词不算常见，更常见的表达是“non-egotistical / unegotistical / humble / modest”。写法上也常见带连字符的“anti-egotistical”，意思不变。","构词上：anti-（反对）+ egotistical（自我中心的）。它强调“反自我膨胀/反自恋式自夸”，语气比单纯的“humble”更像是在反对“自我夸耀”的倾向。"]}
{"word":"antiegotistically","summary":{"en":"“Antiegotistically” means “in a non-self-centered, humble way.”","zh":"“antiegotistically”表示“以不自我为中心、谦逊的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not self-centered; with humility or without emphasizing oneself.","zh":"以不自我为中心的方式；谦逊地、不强调自我的方式。"},"examples":[{"en":"She spoke antiegotistically, giving credit to the whole team instead of herself.","zh":"她说话很不自我，以整个团队的功劳为先，而不是强调自己。"},{"en":"The essay is written antiegotistically, focusing on the community rather than the author’s personal success.","zh":"这篇文章写得不以自我为中心，重点放在社区而不是作者个人的成功。"}]}],"synonyms":["humbly","modestly","selflessly","unselfishly","without self-importance"],"phonetic":"ˌæntiˌiɡəˈtɪstɪkli","extraExplanation":["这是一个非常少见、偏书面甚至带点“造词感”的副词：anti-（反、对抗）+ egotistic（自我中心的）+ -ally（副词形式，等同于 -ly）。更常见的表达是：“humbly（谦虚地）”“without being self-centered（不以自我为中心地）”“in a selfless way（以无私的方式）”。","在实际写作里，用它往往有强调意味：不是中性描述，而是刻意突出“反自我中心”的态度。"]}
{"word":"antiejaculation","summary":{"en":"A rare term meaning the prevention or inhibition of ejaculation; more commonly expressed as inhibited/delayed ejaculation.","zh":"一个较少见的词，指“抑制/阻止射精”；更常见的说法是“射精受抑制/延迟射精”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the prevention or inhibition of ejaculation (the release of semen), especially as a goal in sexual medicine or sexual techniques","zh":"抑制或阻止射精（精液排出），尤其指在性医学或相关技巧中以“不射精/延迟射精”为目标"},"examples":[{"en":"Some medications can cause anti‑ejaculation effects as a side effect.","zh":"某些药物可能会产生抑制射精的副作用。"},{"en":"In clinical writing, doctors usually describe this as inhibited or delayed ejaculation rather than “antiejaculation.”","zh":"在临床写作中，医生通常会用“射精受抑制”或“延迟射精”来描述，而不是用“antiejaculation（抑制射精）”。"}]}],"synonyms":["inhibited ejaculation","delayed ejaculation","anejaculation"],"phonetic":"/ˌæntiɪˌdʒækjəˈleɪʃən/","extraExplanation":["这个词在英文里比较少见，也不算标准、常用的医学术语；更常见的表达包括：inhibited ejaculation（射精受抑制）、delayed ejaculation（延迟射精）、anejaculation（无射精）。","如果你是在讨论“早泄”的治疗，英文通常用 premature ejaculation（早泄）以及 its treatment/management（治疗/管理），而不是用 antiejaculation。","书写时常见形式也可能带连字符：anti‑ejaculation（更清楚地表示“反/抑制射精”）。"]}
{"word":"antielectron","summary":{"en":"An antielectron is a positron—the electron’s antiparticle with a positive charge.","zh":"反电子指正电子——电子的反粒子，带正电荷。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a positron; the antiparticle of an electron, with the same mass as an electron but a positive electric charge","zh":"正电子；电子的反粒子，质量与电子相同，但带正电荷"},"examples":[{"en":"In PET scans, antielectrons (positrons) are used to produce images of the body.","zh":"在PET扫描中，会使用反电子（正电子）来生成人体图像。"},{"en":"When an electron meets an antielectron, they can annihilate and release energy.","zh":"当电子遇到反电子时，它们可能发生湮灭并释放能量。"}]}],"synonyms":["positron"],"phonetic":"/ˌæntiɪˈlɛktrɑn/","extraExplanation":["“antielectron”是较少见的写法，更常用的标准术语是“positron（正电子）”。","正电子通常在高能物理与宇宙射线研究中出现；在医学影像中，PET（正电子发射断层扫描）利用放射性核素发射正电子，正电子与电子湮灭后产生伽马射线，从而成像。"]}
{"word":"antielectrons","summary":{"en":"“Antielectrons” means positrons: the positively charged antiparticles of electrons.","zh":"“Antielectrons”指正电子：电子的反粒子，带正电。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An antielectron; the antiparticle of the electron, with the same mass as an electron but a positive electric charge (also called a positron).","zh":"反电子；电子的反粒子，质量与电子相同但带正电（也称“正电子”）。"},"examples":[{"en":"In PET scans, antielectrons (positrons) are emitted and then annihilate with electrons, producing gamma rays.","zh":"在 PET（正电子发射断层扫描）中，会发射反电子（正电子），它们与电子湮灭后产生伽马射线。"},{"en":"When an antielectron meets an electron, they can destroy each other and release energy.","zh":"当反电子遇到电子时，它们可能相互湮灭并释放能量。"}]}],"synonyms":["positrons","antielectron"],"phonetic":"/ˌæntiɪˈlɛktrɑːn/","extraExplanation":["“Antielectron(s)”在科普或教学语境中偶尔用来强调它是“电子的反物质对应物”，但在物理与工程领域更常用的标准术语是“positron(s)（正电子）”。","正电子最早由卡尔·安德森（Carl Anderson）在 1932 年通过宇宙射线实验发现；这是反物质存在的关键证据之一。"]}
{"word":"antiemetic","summary":{"en":"Anti-emetic means “against vomiting”: a drug or substance that prevents or reduces nausea and vomiting.","zh":"antiemetic 指“止吐的/止吐药”：用于预防或减轻恶心与呕吐。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medicine or substance that prevents or relieves nausea and vomiting.","zh":"止吐的；用于预防或缓解恶心与呕吐的药物（或物质）。"},"examples":[{"en":"The doctor prescribed an antiemetic to help with nausea after surgery.","zh":"医生开了止吐药来缓解术后恶心。"},{"en":"Some antiemetics can make you sleepy, so avoid driving if you feel drowsy.","zh":"有些止吐药会让人犯困，如果觉得嗜睡就不要开车。"}]},{"partOfSpeech":"adj.","definition":{"en":"Preventing or relieving nausea and vomiting.","zh":"止吐的；防止或减轻恶心与呕吐的。"},"examples":[{"en":"Ginger is often used for its mild antiemetic effects.","zh":"姜常被用来发挥温和的止吐作用。"},{"en":"They chose an antiemetic drug with fewer side effects.","zh":"他们选择了副作用更少的止吐药。"}]}],"synonyms":["anti-nausea drug","anti-sickness medicine","anti-vomiting medication"],"phonetic":"/ˌæn.ti.iˈmɛ.tɪk/","extraExplanation":["词源：anti- 表示“反、对抗”，-emetic 与“催吐/引起呕吐”有关（emesis=呕吐）。所以 antiemetic 字面意思就是“反呕吐的”。","常见场景：用于晕车、术后、化疗相关恶心等。不同止吐药作用机制不同，可能有嗜睡等副作用；用药请遵医嘱。"]}
{"word":"antiemetics","summary":{"en":"Antiemetics are medicines (or treatments) that prevent or relieve nausea and vomiting.","zh":"Antiemetics 指用于预防或缓解恶心与呕吐的药物（或治疗方法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medicine that prevents or relieves nausea and vomiting (often used in plural: antiemetics)","zh":"止吐药；抗恶心药（常用复数 antiemetics）"},"examples":[{"en":"The doctor prescribed antiemetics to control her nausea after surgery.","zh":"医生开了止吐药来控制她术后的恶心。"},{"en":"Some antiemetics can make you sleepy, so avoid driving at first.","zh":"有些止吐药会让人犯困，所以刚开始服用时要避免开车。"},{"en":"They gave him antiemetics before chemotherapy.","zh":"化疗前他们给他使用了止吐药。"}]},{"partOfSpeech":"adj.","definition":{"en":"preventing or reducing nausea and vomiting","zh":"止吐的；抗恶心的"},"examples":[{"en":"She was given an antiemetic injection in the emergency room.","zh":"她在急诊室打了止吐针。"},{"en":"Ginger tea is sometimes used as an antiemetic remedy for mild nausea.","zh":"姜茶有时被当作缓解轻微恶心的止吐方法。"}]}],"synonyms":["anti-nausea drugs","anti-vomiting drugs","antiemetic drugs"],"phonetic":"/ˌæntiəˈmɛtɪks/","extraExplanation":["词源拆解：anti- 表示“反、对抗”，emetic 表示“催吐的/引起呕吐的”。所以 antiemetic 字面意思就是“对抗呕吐的”。","在英语里，antiemetics 常指一类药物（如手术后、晕车、孕吐、化疗相关恶心等情况使用）。具体用药需遵医嘱，因为不同止吐药的副作用和适用人群差异很大。"]}
{"word":"antiemperor","summary":{"en":"An antiemperor is a rival claimant to the imperial throne, set up in opposition to a recognized emperor.","zh":"antiemperor 指与公认皇帝对立、被拥立出来争夺帝位的“对立皇帝／反皇帝”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rival or opposing claimant to the title of emperor, set up against a recognized emperor (often during a civil war or political crisis).","zh":"“对立皇帝／反皇帝”：在内战或政治危机中，被推举来对抗公认皇帝的竞争性皇帝称号持有者。"},"examples":[{"en":"During the power struggle, a general was proclaimed antiemperor by his supporters.","zh":"在权力斗争中，一位将领被支持者拥立为“反皇帝”。"},{"en":"The chronicler described him as an antiemperor who never controlled the capital.","zh":"史官把他记为“反皇帝”，因为他从未控制首都。"}]}],"synonyms":["rival emperor","pretender (to the throne)","usurper (context-dependent)"],"phonetic":"/ˌæn.tiˈɛm.pɚ.ɚ/","extraExplanation":["这个词是仿照 *antipope*（对立教皇）这种构词方式形成的：*anti-* 表示“对立、反对”，因此 *antiemperor* 强调“与正统皇帝相对立的皇帝称号竞争者”。它不是日常词，更常见于历史写作、学术讨论或架空/奇幻设定中。","历史语境里，类似概念常出现在帝位争夺、分裂政权或“拥立”事件中（例如不同派系各自拥立一位“皇帝”）。中文翻译常见“对立皇帝”“僭称皇帝”“伪帝”（语气更贬）等，选择哪一种取决于写作者立场。"]}
{"word":"antiempiric","summary":{"en":"Antiempiric means “against empiricism,” describing ideas or people that reject knowledge based on observation or experience.","zh":"antiempiric 指“反经验主义的/反对经验主义的”，形容观点或人不认可基于观察与经验的知识。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to empiricism; not believing that knowledge should be based mainly on observation, experiment, or experience.","zh":"反经验主义的；反对以观察、实验或经验作为主要知识来源的。"},"examples":[{"en":"Some critics call the theory antiempiric because it ignores experimental results.","zh":"一些批评者称这个理论是反经验主义的，因为它无视实验结果。"},{"en":"His approach felt antiempiric: he trusted pure logic more than data.","zh":"他的做法显得反经验主义：他更相信纯逻辑而不是数据。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who opposes empiricism or rejects experience-based evidence.","zh":"反经验主义者；反对经验主义或拒绝以经验为依据的人。"},"examples":[{"en":"In the debate, she was labeled an antiempiric for dismissing the field studies.","zh":"在辩论中，因为她否定实地研究，有人给她贴上“反经验主义者”的标签。"}]}],"synonyms":["anti-empirical","anti-empiricist","nonempirical","a priori (in some contexts)"],"phonetic":"/ˌæn.ti.ɛmˈpɪr.ɪk/","extraExplanation":["这个词非常少见，更常见的表达是 anti-empiric / anti-empirical（反经验的）或 anti-empiricist（反经验主义者）。","历史上在医学语境里，empiric 曾指“凭经验行医的人（不依理论体系）”；因此 antiempiric 也可能出现在旧文献中，用来批评“只讲理论、不重临床观察”的倾向。"]}
{"word":"antiempirical","summary":{"en":"Antiempirical describes ideas or approaches that reject or do not rely on observation and evidence.","zh":"antiempirical 用来形容排斥或不依赖观察与证据的观点或方法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to empiricism; not based on observation, experiments, or real-world evidence.","zh":"反经验主义的；不以观察、实验或现实证据为基础的。"},"examples":[{"en":"The author makes an antiempirical claim that cannot be tested by experiments.","zh":"作者提出了一个反经验的主张，无法通过实验检验。"},{"en":"Some critics say the theory is antiempirical because it ignores available data.","zh":"一些批评者说这个理论反经验，因为它无视现有数据。"}]}],"synonyms":["anti-empirical","nonempirical","unempirical","speculative","a priori"],"phonetic":"/ˌæn.ti.ɛmˈpɪr.ɪ.kəl/","extraExplanation":["“anti-”表示“反、 против（反对）”，“empirical”来自“experience（经验）”，在学术语境里常指“依靠观察与实验的数据”。因此 antiempirical 常用于哲学、社会科学或理论争论中，表示立场或方法“反对以证据为核心”。","它常与 a priori（先验的）、speculative（思辨的）、dogmatic（教条的）等词出现在相近语境，但 antiempirical 更强调“反对/排斥经验与证据”这一态度。"]}
{"word":"antiempirically","summary":{"en":"Antiempirically means ‘in a way that opposes or ignores empirical evidence (data, observation, experiment).’","zh":"antiempirically 指“以反经验主义/忽视实证证据（数据、观察、实验）的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that goes against empiricism; not based on observation, measurement, or experiment.","zh":"以反经验主义的方式；不以观察、测量或实验为依据。"},"examples":[{"en":"The claim was argued antiempirically, relying on pure logic rather than data.","zh":"这个主张是以反经验主义的方式论证的，依靠纯逻辑而不是数据。"},{"en":"Some critics say the theory is built antiempirically and cannot be tested in the real world.","zh":"一些批评者认为该理论是反经验主义地建立起来的，无法在现实世界中检验。"}]},{"partOfSpeech":"adv.","definition":{"en":"(More general) In a way that rejects evidence from experience; contrary to what experiments or facts suggest.","zh":"（更泛）以否定经验性证据的方式；与实验或事实所显示的结果相反。"},"examples":[{"en":"If you reason antiempirically, you may ignore what repeated trials show.","zh":"如果你以反经验主义的方式推理，你可能会忽视反复试验所显示的结果。"},{"en":"The policy was defended antiempirically, despite clear statistics.","zh":"尽管统计数据很清楚，这项政策仍被以反经验主义的方式辩护。"}]}],"synonyms":["nonempirically","without empirical support","a priori","theoretically (without data)"],"phonetic":"/ˌæntaɪɪmˈpɪrɪkli/","extraExplanation":["这个词比较少见，常出现在哲学或学术写作中，用来批评一种“不是从数据/经验出发”的论证方式。日常英语里更常用的表达是：not based on evidence/data、without empirical support、in a non-empirical way。","构词上是 anti-（反、对抗）+ empirical（经验的）+ -ly（副词后缀）。与之相关的词还有：empirically（经验地/凭实证地）、nonempirically（非经验地）。"]}
{"word":"antiempiricism","summary":{"en":"Antiempiricism is opposition to the idea that knowledge is mainly based on sensory experience.","zh":"Antiempiricism 指反对“知识主要源自感官经验”的经验主义立场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A philosophical view that criticizes or rejects empiricism (the idea that knowledge comes mainly from sensory experience), often emphasizing reason, innate ideas, or non-sensory sources of knowledge.","zh":"一种反对或批判经验主义的哲学立场（经验主义认为知识主要来自感官经验），常强调理性、先天观念或非感官的知识来源。"},"examples":[{"en":"Kant is sometimes discussed as responding to empiricism, and parts of his project can be read as antiempiricism.","zh":"康德常被视为在回应经验主义，他的一些思想计划也可被理解为一种反经验主义。"},{"en":"In the debate about science, antiempiricism argues that observation alone cannot justify all theories.","zh":"在关于科学的争论中，反经验主义认为仅靠观察不足以证明所有理论。"}]}],"synonyms":["anti-empiricism","anti-empiricist thought","opposition to empiricism"],"phonetic":"/ˌæn.ti.ɛmˈpɪr.əˌsɪz.əm/","extraExplanation":["“anti-”表示“反对、对立”，加在“empiricism（经验主义）”前，构成“antiempiricism（反经验主义）”。在学术写作中更常见的搭配是“anti-empiricism（加连字符）”或直接说“anti-empiricist views（反经验主义观点）”。","注意：反经验主义不一定等于“反科学”。很多立场是认为“经验/观察重要但不充分”，强调理论结构、数学推理、先天范畴或理性论证在知识形成中的作用。","相关对比词：empiricism（经验主义），rationalism（理性主义），a priori（先验的/先天的），innate ideas（先天观念）。"]}
{"word":"antiempiricist","summary":{"en":"An antiempiricist is someone (or something) that rejects empiricism and stresses reason or theory over observation.","zh":"antiempiricist 指反对经验主义、强调理性或理论而非观察经验的人（或立场/观点）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposes empiricism—the view that knowledge comes mainly from sensory experience and observation.","zh":"反经验主义者：反对“经验主义”（认为知识主要来自感官经验与观察）的人。"},"examples":[{"en":"Some antiempiricists argue that reason can give us knowledge independent of experience.","zh":"一些反经验主义者认为，理性可以在不依赖经验的情况下带来知识。"},{"en":"In the seminar, she described Kant as a critic of simple empiricism rather than a strict antiempiricist.","zh":"在研讨课上，她把康德描述为对朴素经验主义的批评者，而不是严格的反经验主义者。"}]},{"partOfSpeech":"adj.","definition":{"en":"opposed to empiricism; emphasizing reason, innate ideas, or theory over observation and experiment.","zh":"反经验主义的：反对经验主义的；更强调理性、先天观念或理论，而不是观察与实验。"},"examples":[{"en":"His antiempiricist stance made him skeptical of drawing conclusions from small data sets.","zh":"他的反经验主义立场使他对从小样本数据得出结论持怀疑态度。"},{"en":"The article presents an antiempiricist critique of purely evidence-based ethics.","zh":"这篇文章提出了对纯粹“证据导向”伦理学的反经验主义批评。"}]}],"synonyms":["rationalist (often related, not identical)","anti-empiric","antiempirical"],"phonetic":"/ˌæn.ti.ɛmˈpɪr.ə.sɪst/","extraExplanation":["这个词多见于哲学语境，尤其在“经验主义（empiricism） vs. 理性主义（rationalism）”的讨论中。反经验主义者往往认为：仅靠观察与实验不足以解释某些知识（如数学、逻辑、因果性、道德原则），需要诉诸理性结构、先天概念或理论框架。","注意：anti-empiricist 并不一定“反科学”。很多学者只是反对把经验当作唯一来源，主张经验与理论/理性应共同发挥作用。"]}
{"word":"antiendotoxin","summary":{"en":"Antiendotoxin refers to something that neutralizes or counteracts endotoxin, especially in medical or research contexts.","zh":"Antiendotoxin 指用于中和或抵消内毒素作用的物质或治疗方式，多见于医学与科研语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance (such as an antibody, antiserum, or drug) that neutralizes or counteracts an endotoxin.","zh":"抗内毒素物质（如抗体、抗血清或药物），用于中和或抵消内毒素的作用。"},"examples":[{"en":"Researchers tested an antiendotoxin therapy to reduce inflammation in severe infections.","zh":"研究人员测试了一种抗内毒素疗法，以降低重症感染中的炎症反应。"},{"en":"The lab developed antiendotoxin antibodies for experimental use.","zh":"实验室开发了用于实验的抗内毒素抗体。"}]},{"partOfSpeech":"adj.","definition":{"en":"counteracting endotoxin; designed to neutralize endotoxin activity.","zh":"抗内毒素的；用于中和内毒素活性的。"},"examples":[{"en":"The patient received antiendotoxin treatment in the ICU.","zh":"患者在重症监护室接受了抗内毒素治疗。"},{"en":"They reported antiendotoxin effects in an animal study.","zh":"他们在动物研究中报告了抗内毒素效果。"}]}],"synonyms":["endotoxin-neutralizing agent","anti-endotoxin antibody","endotoxin inhibitor"],"phonetic":"/ˌæntiˌɛndoʊˈtɑksɪn/","extraExplanation":["“endotoxin（内毒素）”通常指革兰阴性菌细胞壁成分（如脂多糖，LPS），可引发强烈炎症反应、发热甚至脓毒症。理解这一点有助于把握“antiendotoxin”主要用于感染/炎症相关语境。","该词更常见于医学与科研文献；在日常英语中，人们更可能说“anti-endotoxin antibody/therapy”或直接用“endotoxin-neutralizing (agent)”等表达。"]}
{"word":"antiendowment","summary":{"en":"Antiendowment means “against an endowment,” especially opposing long-term or state financial support for an institution (often a church).","zh":"antiendowment 指“反对捐赠基金/固定拨款”，尤指反对国家或长期为某些机构（常为教会）提供资金支持。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to an endowment (especially public or permanent financial support for an institution, often a church or school).","zh":"反对“捐赠基金/固定拨款”（尤指反对给机构——常见为教会或学校——提供长期、公共或永久性的资金支持）。"},"examples":[{"en":"The candidate took an antiendowment position and argued that churches should not receive state funding.","zh":"这位候选人持反对固定拨款的立场，主张教会不应获得国家资助。"},{"en":"An antiendowment campaign formed to stop the proposed endowment of the new religious college.","zh":"一个反对设立捐赠基金的运动组织起来，试图阻止为新宗教学院设立基金。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or group holding an antiendowment view.","zh":"持反对固定拨款观点的人或团体。"},"examples":[{"en":"Antiendowments organized meetings and published pamphlets during the debate.","zh":"在争论期间，反对固定拨款的人组织集会并发行小册子。"}]}],"synonyms":["anti-endowment","opposed to endowments","against state endowments","anti-subsidy"],"phonetic":"/ˌæn.ti.ɛnˈdaʊ.mənt/","extraExplanation":["这个词非常少见，多出现在历史或政治语境里，来源于 anti-（反对）+ endowment（捐赠基金/永久资助/（教会）“国教拨款”）。","在19世纪英国与爱尔兰的公共讨论中，endowment 常指国家对某些教会或宗教机构的财政“拨款/供养”；antiendowment 则指反对这种制度的人或立场。","现代英语里更常用的表达是 anti-endowment（带连字符）、opposed to endowments、against state endowments / against public funding。"]}
{"word":"antienergistic","summary":{"en":"“Antienergistic” means energy-reducing or vitality-sapping.","zh":"“antienergistic”意为“削弱能量/活力的；让人没劲的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposing or reducing energy, vitality, or energetic activity; inhibiting energy-related processes.","zh":"反能量的；削弱精力/活力的；抑制能量相关活动或过程的。"},"examples":[{"en":"After the long, stressful week, the constant bad news felt antienergistic and made it hard to stay motivated.","zh":"经历了漫长又压力很大的那一周后，接连不断的坏消息让人感觉很“反能量”，很难保持动力。"},{"en":"Some researchers described the chemical’s effect on cells as antienergistic because it slowed down energy production.","zh":"一些研究者把这种化学物质对细胞的影响描述为“反能量的”，因为它减缓了能量产生。"}]}],"synonyms":["energy-sapping","draining","debilitating","inhibitory","demotivating"],"phonetic":"/ˌæn.tiˌɛn.ɚˈdʒɪs.tɪk/","extraExplanation":["这个词非常罕见，多见于较专业或临时造词的语境。构词上是 anti-（反对）+ energistic（与能量/活力有关的）。在日常英语里，人们更常说 low-energy、draining、energy-sapping、demotivating 等。"]}
{"word":"antient","summary":{"en":"Antient is an archaic spelling of ancient, meaning very old or from long ago.","zh":"Antient 是 ancient 的古体拼写，意思是“古老的、久远的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic spelling) ancient; very old, from a long time ago.","zh":"（古体拼写）ancient 的旧拼法；古老的，年代久远的。"},"examples":[{"en":"In older books you may see antient instead of ancient.","zh":"在较早的书里，你可能会看到 antient 来代替 ancient。"},{"en":"They spoke of antient customs passed down for centuries.","zh":"他们谈到流传了几个世纪的古老习俗。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, archaic) an ancient person; someone from ancient times.","zh":"（罕见，古语）古人；古代的人。"},"examples":[{"en":"The poem compares modern life with the wisdom of the antients.","zh":"这首诗把现代生活与古人的智慧作比较。"}]}],"synonyms":["ancient","age-old","old","antique (context-dependent)"],"phonetic":"/ˈeɪnʃənt/","extraExplanation":["antient 多见于中古英语到近代早期英语文本，是 ancient 的历史拼写变体。现代英语中一般不用 antient，写作与考试也应使用 ancient。","你可能会在莎士比亚及同时代作品、旧版圣经注释或历史文献中遇到该拼写。阅读时把它当作 ancient 理解即可。"]}
{"word":"antienthusiasm","summary":{"en":"Antienthusiasm means a lack of enthusiasm or an attitude that resists enthusiasm.","zh":"Antienthusiasm 指缺乏热情或抗拒热情的态度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lack of enthusiasm or an attitude that opposes enthusiasm; skepticism or resistance toward excited support for something","zh":"缺乏热情；反对（或抗拒）热情的态度；对某事的热烈支持持怀疑或抵触"},"examples":[{"en":"His antienthusiasm about the project made the team lose energy.","zh":"他对这个项目的“反热情”让团队失去了干劲。"},{"en":"The campaign struggled because voters felt more antienthusiasm than hope.","zh":"这场竞选推进困难，因为选民感到更多的是“反热情”，而不是希望。"},{"en":"She spoke with calm caution—almost antienthusiasm—when everyone else was celebrating.","zh":"当其他人都在庆祝时，她说话冷静而谨慎，几乎带着一种“反热情”。"}]}],"synonyms":["apathy","indifference","skepticism","cynicism","lack of enthusiasm","coolness"],"phonetic":"/ˌænti ɪnˈθuːziæzəm/","extraExplanation":["“antienthusiasm”并不是常见的标准词，更常见的写法是带连字符的“anti-enthusiasm”。在正式写作中，通常用更自然的词来表达同样意思，比如“lack of enthusiasm”（缺乏热情）、“apathy”（冷漠/无兴趣）、“skepticism”（怀疑）、“cynicism”（愤世嫉俗）。","构词上，“anti-”表示“反对/对立”，“enthusiasm”表示“热情”。因此它常用于强调：不仅是“没兴趣”，而是对他人的兴奋或热烈支持本身有抵触或反感。"]}
{"word":"antienthusiast","summary":{"en":"“Anti-enthusiast” is an uncommon compound meaning a person (or attitude) opposed to enthusiasm or hype.","zh":"“anti-enthusiast”是不太常见的组合词，指反热情的人或反感炒作、狂热的态度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is against, skeptical of, or tired of enthusiasm—someone who doesn’t share (or even dislikes) excited, fan-like support for something.","zh":"反热情者；反“粉丝式热爱”的人：对某事的兴奋、狂热支持持反对、怀疑或厌倦态度的人。"},"examples":[{"en":"I’m an anti-enthusiast when it comes to celebrity news—I just don’t care.","zh":"在八卦明星新闻这件事上，我算是个“反热情者”——我真的不在乎。"},{"en":"The campaign needed enthusiasm, but he acted like an anti-enthusiast and cooled everyone down.","zh":"这场活动需要热情，但他却像个反热情者，把大家的劲头都浇灭了。"}]},{"partOfSpeech":"adj.","definition":{"en":"showing opposition to excitement or fan-like enthusiasm; not easily impressed or motivated by hype.","zh":"反热情的；不吃“炒作”那一套的：对激动、狂热或过度宣传持反感或冷淡态度的。"},"examples":[{"en":"Her anti-enthusiast reaction made the big announcement feel awkward.","zh":"她那种反热情的反应，让这个重大宣布显得有点尴尬。"},{"en":"He took an anti-enthusiast tone toward the product launch.","zh":"他用一种反热情的语气评价这次新品发布。"}]}],"synonyms":["skeptic","cynic","not a fan","killjoy","critic"],"phonetic":"/ˌænti ɪnˈθuːziˌæst/","extraExplanation":["“anti-enthusiast”并不是非常常见的标准词，更像是把前缀 anti-（反对）和 enthusiast（热情者/爱好者）临时组合出来的表达。写作中更常见的替代说法有：“not a fan”（不喜欢/不买账）、“skeptic”（怀疑者）、“cynic”（愤世嫉俗的人）、“killjoy”（扫兴的人，语气更强）。","如果你原本想输入的是“an enthusiast”（一个爱好者/热心者），拼写应为 enthusiast；如果想表达“反对者”，也可以用 “opponent” 或 “critic” 来更自然。"]}
{"word":"antienthusiastic","summary":{"en":"Anti-enthusiastic means not enthusiastic or even negative toward excitement or hype.","zh":"Anti-enthusiastic 指“不热情、兴致不高”，也可指“对兴奋或炒作持反感/泼冷水的态度”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not enthusiastic; showing little interest or excitement (often about a plan, idea, or activity)","zh":"不热情的；缺乏兴趣或兴奋的（常用于形容对计划、想法或活动的态度）"},"examples":[{"en":"She was anti-enthusiastic about the new schedule and didn’t want to change her routine.","zh":"她对新时间表很不热情，不想改变自己的日常。"},{"en":"He sounded anti-enthusiastic when we suggested going hiking this weekend.","zh":"我们提议这周末去徒步时，他听起来兴致不高。"}]},{"partOfSpeech":"adj.","definition":{"en":"opposed to other people’s enthusiasm; reacting negatively to excitement or hype","zh":"反感他人的热情；对兴奋或“炒作”持负面态度的"},"examples":[{"en":"Her anti-enthusiastic comments made the team’s celebration feel awkward.","zh":"她那些反热情的评论让团队的庆祝变得有点尴尬。"},{"en":"He’s not trying to be rude—he’s just anti-enthusiastic about big announcements.","zh":"他并不是想无礼——他只是对大型“官宣”不太买账。"}]}],"synonyms":["unenthusiastic","lukewarm","indifferent","apathetic","reluctant","skeptical"],"phonetic":"/ˌæntiɪnˌθuːziˈæstɪk/","extraExplanation":["“anti-enthusiastic”并不是非常常见的标准词，写作中更常见的是用更自然的表达，如：unenthusiastic（不热情的）、not enthusiastic（不怎么热情）、lukewarm（兴致平平的）。","前缀 anti- 表示“反对/相反/抵制”。因此 anti-enthusiastic 往往带有“和大家的兴奋情绪相反、甚至有点泼冷水”的语气。根据语境，有时会显得偏口语或带一点讽刺。"]}
{"word":"antienthusiastically","summary":{"en":"“Antienthusiastically” is a rare/nonstandard adverb meaning “without enthusiasm,” sometimes implying opposition to enthusiasm; “unenthusiastically” is the common choice.","zh":"“antienthusiastically”是罕见/非标准副词，表示“缺乏热情地”，有时还含“反感热情”的意思；更常用的说法是“unenthusiastically”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Rare/nonstandard) In a way that shows a lack of enthusiasm, or even opposition to enthusiasm; without eager interest.","zh":"（罕见/非标准用法）以缺乏热情、甚至反感热情的方式；不情愿地、冷淡地。"},"examples":[{"en":"He responded antienthusiastically, as if the good news were a burden.","zh":"他冷淡地回应，仿佛好消息成了负担。"},{"en":"She spoke antienthusiastically about the plan, warning everyone not to get too excited.","zh":"她用不太热情的语气谈这个计划，还提醒大家别太兴奋。"}]}],"synonyms":["unenthusiastically","reluctantly","halfheartedly","apathetically"],"phonetic":"/ˌæn.ti.ɪnˌθuː.ziˈæs.tɪk.li/","extraExplanation":["“antienthusiastically”在现代英语里非常少见，很多情况下可能是拼写或造词：更常见的表达是 **unenthusiastically**（不热情地）或 **without enthusiasm**（毫无热情）。","前缀 **anti-** 通常表示“反对/对抗”。所以如果按字面理解，*anti-enthusiastically* 可能带有“刻意压制或反对热情”的意味，而不只是“没劲/不太想做”。","写作时建议优先用常见词：**unenthusiastically**, **reluctantly**, **halfheartedly**（敷衍地/不认真地），以避免读者困惑。"]}
{"word":"antienvironmentalism","summary":{"en":"Antienvironmentalism is opposition to environmental protection policies or movements.","zh":"Antienvironmentalism 指反对环保政策或环保运动的立场或思潮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to environmental protection efforts, policies, or movements (often arguing they harm the economy, personal freedom, or traditional industries).","zh":"反对环境保护的立场或思潮；反对环保政策或环保运动（常认为这些会损害经济、个人自由或传统产业）。"},"examples":[{"en":"The senator’s speech was criticized as antienvironmentalism because it dismissed climate science.","zh":"那位参议员的演讲因否认气候科学而被批评为反环保主义。"},{"en":"Some communities see new regulations as antienvironmentalism versus jobs, but the issue is often more complex.","zh":"有些社区把新法规看成“反环保”与“保就业”的对立，但问题往往更复杂。"}]}],"synonyms":["opposition to environmentalism","anti-green politics","anti-regulation (in environmental context)"],"phonetic":"/ˌæn.ti.ɪnˌvaɪ.rənˈmɛn.t̬əl.ɪz.əm/","extraExplanation":["这个词常用于政治与公共政策讨论，带有一定评价色彩（多为批评）。写作中如果想更中性，可以用“opposition to environmental regulation（反对环境监管）”或具体说明反对的政策类型。","构词：anti-（反对）+ environmental（环境的）+ -ism（主义/思潮）。也可见到拼写为“anti-environmentalism”。"]}
{"word":"antienvironmentalist","summary":{"en":"Antienvironmentalist describes a person or view that opposes environmental protection policies.","zh":"antienvironmentalist 指反对环境保护政策的个人或观点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who opposes environmental protection efforts or policies (such as laws to reduce pollution, protect wildlife, or limit climate change).","zh":"反对环境保护行动或政策的人（例如反对减少污染、保护野生动物或应对气候变化的法规）。"},"examples":[{"en":"Some antienvironmentalists argue that environmental regulations hurt the economy.","zh":"一些反环保人士认为环境法规会伤害经济。"},{"en":"The group was labeled antienvironmentalist after it campaigned against clean-water rules.","zh":"该团体因反对清洁水源法规而被贴上“反环保”的标签。"}]},{"partOfSpeech":"adj.","definition":{"en":"Opposing environmental protection efforts or policies.","zh":"反对环境保护行动或政策的。"},"examples":[{"en":"The candidate took an antienvironmentalist stance on climate policy.","zh":"这位候选人在气候政策上采取了反环保立场。"},{"en":"Critics called the proposal antienvironmentalist because it weakened pollution limits.","zh":"批评者称该提案“反环保”，因为它削弱了污染限制。"}]}],"synonyms":["anti-green","anti-environment","opponent of environmental regulation","anti-conservation"],"phonetic":"/ˌæn.ti.ɪnˌvaɪ.rənˈmɛn.t̬ə.lɪst/","extraExplanation":["“anti-”表示“反对”，加在“environmentalist（环保主义者）”前形成“antienvironmentalist”。写作中也常见带连字符的形式：anti-environmentalist。","这个词往往带有评价色彩（批评意味较强），在正式讨论中也可以用更中性的说法，如“opposed to environmental regulation（反对环境监管）”。"]}
{"word":"antienvironmentalists","summary":{"en":"People who oppose environmentalism or environmental protection policies.","zh":"反对环保主义或环境保护政策的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who oppose environmentalism or policies meant to protect the environment","zh":"反对环保主义或反对保护环境政策的人"},"examples":[{"en":"Some antienvironmentalists argue that environmental rules hurt the economy.","zh":"一些反环保人士认为环保法规会伤害经济。"},{"en":"The debate became heated between environmentalists and antienvironmentalists at the town meeting.","zh":"在镇民大会上，环保人士与反环保人士的争论变得很激烈。"}]}],"synonyms":["opponents of environmentalism","anti-green activists","environmental regulation critics"],"phonetic":"/ˌænti ɪnˈvaɪrənmən(t)əlɪsts/","extraExplanation":["这个词由前缀 anti-（“反对”）+ environmentalist（“环保主义者/环保人士”）构成，常见于政治、公共政策与媒体讨论中。","在写作中它往往带有评价色彩（偏负面或对立立场的标记）；更中性的表达有 “people skeptical of environmental regulations”（对环保法规持怀疑态度的人）或 “opponents of certain environmental policies”（反对某些环保政策的人）。"]}
{"word":"antienzymatic","summary":{"en":"“Antienzymatic” means inhibiting enzymes or reducing their activity, mainly used in scientific contexts.","zh":"“antienzymatic”意为“抑制酶或降低酶活性”，主要用于科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a substance or effect) preventing or reducing the activity of enzymes; inhibiting enzymes.","zh":"（指物质或作用）抑制酶的活性；阻止或减弱酶的作用。"},"examples":[{"en":"Some preservatives have antienzymatic effects that slow food spoilage.","zh":"一些防腐剂具有抗酶（抑酶）作用，可以减慢食物变质。"},{"en":"Researchers tested an antienzymatic compound to block a key enzyme in the disease pathway.","zh":"研究人员测试了一种抑酶化合物，以阻断该疾病通路中的关键酶。"}]}],"synonyms":["enzyme-inhibiting","enzymatic inhibitory","anti-enzymatic"],"phonetic":"/ˌæn.tiˌɛn.zaɪˈmætɪk/","extraExplanation":["“antienzymatic”多用于科学/医学语境（如生物化学、药理学、食品科学），日常英语里更常见的表达是“enzyme inhibitor / inhibitory (to) enzymes（酶抑制剂/对酶有抑制作用的）”。","构词上：anti-（反对、抑制）+ enzymatic（酶的、与酶有关的），因此含义直观地指“对酶起抑制作用”。"]}
{"word":"antienzyme","summary":{"en":"An antienzyme is a substance that inhibits an enzyme’s activity (sometimes an antibody against an enzyme).","zh":"antienzyme 指能抑制酶活性的物质（有时特指针对酶的抗体）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A substance that stops or reduces the activity of an enzyme (often by binding to it); an enzyme inhibitor, sometimes specifically an antibody against an enzyme.","zh":"一种能阻止或降低酶活性的物质（常通过与酶结合）；即酶抑制剂，有时特指“抗酶抗体”（针对某种酶的抗体）。"},"examples":[{"en":"Researchers tested an antienzyme to see whether it could block the virus’s key enzyme.","zh":"研究人员测试了一种抗酶物质，看看它是否能阻断病毒的关键酶。"},{"en":"In some experiments, an antienzyme can be an antibody designed to bind a specific enzyme.","zh":"在一些实验中，抗酶物质可以是为结合某种特定酶而设计的抗体。"}]}],"synonyms":["enzyme inhibitor","anti-enzyme","antienzymatic agent"],"phonetic":"/ˌæntiˈɛnzaɪm/","extraExplanation":["“antienzyme”多见于生物化学、免疫学或药理学语境，日常英语里不常用；更常见的表达是“enzyme inhibitor（酶抑制剂）”。","词形上由anti-（反/抗）+ enzyme（酶）构成；有些文献中会用连字符写作“anti-enzyme”。"]}
{"word":"antienzymic","summary":{"en":"Antienzymic means enzyme-inhibiting—able to prevent or reduce enzyme activity.","zh":"antienzymic 指“抗酶的/抑制酶活性的”，能阻止或降低酶的作用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(biochemistry) Preventing or reducing the activity of an enzyme; enzyme-inhibiting.","zh":"（生物化学）抗酶的；抑制酶活性的。"},"examples":[{"en":"Some plant compounds have antienzymic effects that slow down digestion.","zh":"一些植物化合物具有抗酶作用，可以减缓消化过程。"},{"en":"The researchers tested whether the extract was antienzymic against amylase.","zh":"研究人员测试该提取物是否对淀粉酶具有抗酶（抑制）作用。"},{"en":"Antienzymic additives can protect certain foods by reducing spoilage reactions.","zh":"抗酶添加剂可通过降低变质反应来保护某些食品。"}]}],"synonyms":["enzyme-inhibiting","anti-enzymatic","inhibitory (to enzymes)","antienzymatic"],"phonetic":"/ˌæn.ti.ɛnˈzaɪ.mɪk/","extraExplanation":["这是一个较少见、偏专业的词，常见于生物化学、药理学或食品科学文献中，意思接近“enzyme-inhibiting（抑制酶的）”。","构词：anti-（反、抗）+ enzym(e)（酶）+ -ic（形容词后缀）。有时也会写作 anti-enzymic（带连字符），含义相同。","日常英语里更常用的表达是“enzyme inhibitor（酶抑制剂，名词）”或“inhibits enzyme activity（抑制酶活性，动词短语）”。"]}
{"word":"antiepicenter","summary":{"en":"The point on Earth directly opposite an earthquake’s epicenter.","zh":"地球表面上与某次地震震中正相对的点（对震中/对跖点）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Geology) The point on Earth’s surface directly opposite an earthquake’s epicenter (the epicenter’s antipode).","zh":"（地质/地震学）与某次地震的震中在地球表面上正相对（相隔约180°）的点；震中的对跖点。"},"examples":[{"en":"Scientists looked for unusual seismic effects near the earthquake’s antiepicenter.","zh":"科学家在那次地震的对震中附近寻找异常的地震效应。"},{"en":"If an epicenter is in Chile, its antiepicenter will be in the region on the opposite side of the globe.","zh":"如果震中在智利，那么对震中会在地球另一侧的相对区域。"}]}],"synonyms":["antipode (of the epicenter)","antipodal point","opposite point"],"phonetic":"ˌæn.tiˈɛp.ɪˌsɛn.tɚ","extraExplanation":["“antiepicenter”在日常英语中非常少见，更常用的表达是“the antipode (of the epicenter)”或“the epicenter’s antipodal point”。","对震中是一个几何位置概念：它不一定会发生强烈震动，但在地震学研究中可用于讨论地震波穿过地球后的传播与聚焦等现象。"]}
{"word":"antiepileptic","summary":{"en":"Antiepileptic means a drug, or something related to treatment, that prevents or controls epileptic seizures.","zh":"Antiepileptic 指抗癫痫的（形容词），也指抗癫痫药（名词），用于预防或控制癫痫发作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medicine used to prevent or control epileptic seizures.","zh":"抗癫痫的；用于预防或控制癫痫发作的（药物）。"},"examples":[{"en":"The doctor prescribed an antiepileptic to reduce her seizures.","zh":"医生开了抗癫痫药来减少她的癫痫发作。"},{"en":"Some antiepileptic drugs can cause drowsiness at first.","zh":"一些抗癫痫药在刚开始服用时可能会引起嗜睡。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to preventing or controlling epileptic seizures.","zh":"抗癫痫的；与预防或控制癫痫发作有关的。"},"examples":[{"en":"This treatment has antiepileptic effects.","zh":"这种治疗有抗癫痫的效果。"},{"en":"Researchers are studying antiepileptic activity in new compounds.","zh":"研究人员正在研究新化合物的抗癫痫活性。"}]}],"synonyms":["anticonvulsant","anti-seizure"],"phonetic":"/ˌæn.ti.ɛp.ɪˈlɛp.tɪk/","extraExplanation":["在医学语境里，antiepileptic 常指“抗癫痫药”（也常写作 antiepileptic drug / AED）。有些药也会用于其他用途，例如情绪稳定、神经性疼痛或偏头痛预防（具体取决于药物种类与医生判断）。","词形上由 anti-（反、抗）+ epileptic（癫痫的）构成，因此字面意思就是“抗癫痫的”。常见相关词：anticonvulsant（抗惊厥药，常与 antiepileptic 近义）。"]}
{"word":"antiepiscopal","summary":{"en":"Antiepiscopal describes opposition to bishops or to bishop-led church government.","zh":"Antiepiscopal 指反对主教或反对主教制（由主教领导的教会治理）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to bishops or to a church system governed by bishops (episcopacy).","zh":"反对主教或反对由主教治理的教会制度（主教制）的。"},"examples":[{"en":"Some early Presbyterian writers took an antiepiscopal position.","zh":"一些早期的长老会作者持反对主教制的立场。"},{"en":"The pamphlet argues for church governance without bishops and is strongly antiepiscopal.","zh":"这本小册子主张没有主教的教会治理方式，立场强烈反主教制。"}]}],"synonyms":["anti-episcopal","anti-bishop","anti-hierarchical (in church context)"],"phonetic":"/ˌæn.ti.ɪˈpɪs.kə.pəl/","extraExplanation":["“episcopal”来自希腊语词根，意为“监督者”，在基督教语境中指“主教”。因此 antiepiscopal 常见于宗教史、英国宗教改革及清教徒/长老会传统相关讨论中，用来描述反对主教阶层或反对以主教为核心的教会治理结构的观点。"]}
{"word":"antiepiscopist","summary":{"en":"An antiepiscopist is someone who opposes bishops or an episcopal form of church government.","zh":"antiepiscopist 指反对主教或反对主教制教会治理的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is opposed to bishops or the system of church government led by bishops (episcopacy).","zh":"反对主教或反对由主教领导的教会体制（主教制）的人。"},"examples":[{"en":"Some antiepiscopists argued that local congregations should govern themselves without bishops.","zh":"一些反主教制者主张地方会众应当自治，不需要主教管理。"},{"en":"In that debate, he was labeled an antiepiscopist because he rejected the authority of bishops.","zh":"在那场辩论中，他因否认主教权威而被称为反主教制者。"}]}],"synonyms":["opponent of episcopacy","anti-episcopacy advocate","anti-bishop (informal)"],"phonetic":"/ˌæn.ti.ɪˈpɪs.kə.pɪst/","extraExplanation":["这个词多出现在宗教史或教会政治的语境中，尤其与英国宗教改革后英国国教（Anglican）以及清教徒（Puritans）等群体的争论有关：他们围绕“教会应由主教治理（episcopacy）还是由长老/会众治理（presbyterianism / congregationalism）”发生分歧。","构词上：anti-（反对）+ episcop-（主教，源自希腊语 episkopos“监督者”）+ -ist（……主义者/……者）。","语体提示：在现代日常英语中非常罕见，写作中常用更常见的表达，如 “opposed to episcopacy” 或 “anti-bishop” （较口语、也较不正式）。"]}
{"word":"antiepithelial","summary":{"en":"Antiepithelial describes something that works against epithelial tissue, usually in medical/scientific writing.","zh":"Antiepithelial 指“抗上皮的”，多用于医学/科研语境，表示对上皮组织有抑制或破坏作用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposing, destroying, or inhibiting epithelial tissue (the layer of cells that covers surfaces and lines organs), especially in medical or laboratory contexts.","zh":"抗上皮的；抑制、破坏或对抗上皮组织的（上皮是覆盖体表并衬里器官的细胞层），多用于医学或实验语境。"},"examples":[{"en":"The researchers tested an antiepithelial agent to see how it affected the skin’s surface cells.","zh":"研究人员测试了一种抗上皮药剂，以观察它对皮肤表层细胞的影响。"},{"en":"Some anticancer drugs have antiepithelial effects, which can lead to mouth sores or skin irritation.","zh":"一些抗癌药物具有抗上皮作用，可能导致口腔溃疡或皮肤刺激。"},{"en":"In vitro results suggested the compound was strongly antiepithelial at higher doses.","zh":"体外实验结果显示，该化合物在较高剂量下具有很强的抗上皮作用。"}]}],"synonyms":["anti-epithelial","epitheliotoxic (less common)","toxic to epithelial cells (phrase)"],"phonetic":"/ˌæn.tiˌɛp.əˈθi.li.əl/","extraExplanation":["该词较少出现在日常英语中，主要见于病理学、药理学与细胞生物学文献。通常用来描述某种药物、抗体或处理方式对“上皮细胞/上皮组织”的不利影响（如抑制生长、引起损伤）。","词形上可拆解为 anti-（反对/抗）+ epithelial（上皮的）。在论文里也可能用更常见的表达替代，例如 “toxic to epithelial cells”（对上皮细胞有毒）或 “epithelial-inhibiting”（抑制上皮的）。"]}
{"word":"antierosion","summary":{"en":"Anti-erosion means intended to prevent or reduce erosion, especially of soil or coastlines.","zh":"anti-erosion 指“防侵蚀的/防止水土流失的”，常用于土壤或海岸防护。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to prevent or reduce erosion (the gradual wearing away of soil, land, or rock by water, wind, or other natural forces).","zh":"用于防止或减少侵蚀（如水、风等造成的土壤、土地或岩石逐渐被冲刷、磨损）。"},"examples":[{"en":"The city installed anti-erosion mats on the hillside after the heavy rains.","zh":"暴雨后，市政府在山坡上铺设了防侵蚀垫。"},{"en":"Farmers plant trees as an anti-erosion measure to protect topsoil.","zh":"农民种树作为防侵蚀措施来保护表土。"},{"en":"Anti-erosion barriers help keep sand from washing away along the coast.","zh":"防侵蚀屏障有助于防止海岸的沙子被冲走。"}]}],"synonyms":["erosion-control","anti-scour","soil-conserving","protective"],"phonetic":"/ˌæntaɪ ɪˈroʊʒən/","extraExplanation":["这个词更常见的写法是带连字符的 anti-erosion，也可能写作 antierosion（较少见）。在实际英语中，它通常作为定语放在名词前：anti-erosion measures / anti-erosion mats / anti-erosion barrier。","多用于环境工程、农业与水土保持语境，强调“减少水土流失/海岸侵蚀”等。"]}
{"word":"antierosive","summary":{"en":"Antierosive means “preventing or resisting erosion,” often used in environmental and engineering contexts.","zh":"Antierosive 表示“防侵蚀/抗冲刷的”，常用于环境与工程语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to prevent or reduce erosion (especially of soil or surfaces).","zh":"防侵蚀的；抗冲刷的（尤指防止或减少土壤/表面被水、风等侵蚀）。"},"examples":[{"en":"Farmers planted antierosive grasses on the hillside to protect the soil.","zh":"农民在山坡上种了防侵蚀的草来保护土壤。"},{"en":"The project uses antierosive materials to stabilize the riverbank.","zh":"该项目使用抗冲刷材料来加固河岸。"}]}],"synonyms":["anti-erosion","erosion-resistant","erosion-control"],"phonetic":"/ˌæn.ti.ɪˈroʊ.sɪv/","extraExplanation":["该词常见于环境科学、土木工程与水土保持语境；更常用的表达包括：anti-erosion（防侵蚀的）、erosion-resistant（抗侵蚀的）、anti-erode/anti-erosive measures（防侵蚀措施）。","构词：anti-（“反；防”）+ erosive（“侵蚀性的”）。在技术写作中多作定语，如 antierosive coating（防侵蚀涂层）、antierosive vegetation（保土植被）。"]}
{"word":"antierysipelas","summary":{"en":"A medical adjective meaning “against erysipelas.”","zh":"医学形容词，意为“抗丹毒的/用于治疗丹毒的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Used to prevent or treat erysipelas (a bacterial skin infection).","zh":"用于预防或治疗丹毒（由细菌引起的皮肤感染）的。"},"examples":[{"en":"The doctor prescribed an antierysipelas antibiotic after confirming the diagnosis.","zh":"医生在确认诊断后开了用于治疗丹毒的抗生素。"},{"en":"In older medical texts, you may see antierysipelas ointments mentioned.","zh":"在较早的医学文献中，你可能会看到“抗丹毒软膏”的说法。"}]}],"synonyms":["anti-erysipelas","anti-streptococcal (in context)","antibacterial (general)"],"phonetic":"/ˌæn.ti.ˌɛr.ɪˈsɪp.ə.ləs/","extraExplanation":["这是较少见、偏医学书面语的词，常见于药理学或旧式医学文献。现代临床写作里更常直接说“antibiotics for erysipelas（治疗丹毒的抗生素）”或“anti-streptococcal therapy（抗链球菌治疗）”，因为丹毒多由A组链球菌引起。","词形可拆解理解：anti-（反、抗）+ erysipelas（丹毒）。注意它主要是“形容词用法”，用来修饰药物、治疗或措施（如 antierysipelas treatment）。"]}
{"word":"antiestablishment","summary":{"en":"Anti(establishment) describes opposition to the dominant institutions or elites in society, especially in politics.","zh":"anti(establishment)指反对社会中占主导地位的机构或精英势力，尤用于政治语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to the established political or social institutions (the “establishment”).","zh":"反建制的；反对既有权力体系（“建制派”）的。"},"examples":[{"en":"The candidate ran on an antiestablishment message.","zh":"这位候选人以反建制的主张参选。"},{"en":"In the novel, the hero is an antiestablishment journalist who challenges corruption.","zh":"在小说中，主角是一位反建制记者，揭露并挑战腐败。"}]},{"partOfSpeech":"n.","definition":{"en":"A person, movement, or attitude that opposes the establishment.","zh":"反建制的人（或运动、态度）。"},"examples":[{"en":"The party attracted antiestablishments who felt ignored by elites.","zh":"该政党吸引了那些觉得被精英忽视的反建制人士。"}]}],"synonyms":["anti-establishment","anti-elite","anti-authority","anti-government (context-dependent)","countercultural"],"phonetic":"/ˌæn.ti.ɪˈstæb.lɪʃ.mənt/","extraExplanation":["“antiestablishment”更常见的写法是带连字符的“anti-establishment”。它在新闻与政治语境中很常用，尤其用来描述反对主流政党、传统媒体、官僚体系或社会精英的立场。","“establishment”在英语里常指“既得利益集团/主流权力结构”，不一定只指政府，也可能包括商业、文化或社会层面的主导力量。"]}
{"word":"antiestrogen","summary":{"en":"Antiestrogen means a drug/therapy (or something) that blocks or reduces estrogen’s effects, commonly used for hormone-sensitive conditions like some breast cancers.","zh":"Antiestrogen 指“抗雌激素”，即阻断或降低雌激素作用的药物/治疗，常用于某些激素敏感疾病（如部分乳腺癌）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A substance (drug or hormone therapy) that blocks estrogen’s effects in the body or lowers estrogen activity, often used to treat certain hormone-sensitive conditions (especially some breast cancers).","zh":"抗雌激素；一种能阻断雌激素在体内作用或降低雌激素活性的物质（药物/激素治疗），常用于治疗某些对激素敏感的疾病（尤其是部分乳腺癌）。"},"examples":[{"en":"Tamoxifen is a well-known antiestrogen used in some types of breast cancer treatment.","zh":"他莫昔芬是常见的抗雌激素药物，用于某些类型的乳腺癌治疗。"},{"en":"Her doctor discussed whether an antiestrogen therapy was appropriate after surgery.","zh":"术后，医生与她讨论是否适合使用抗雌激素治疗。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to blocking or reducing the effects of estrogen.","zh":"抗雌激素的；与阻断或降低雌激素作用有关的。"},"examples":[{"en":"The report described the drug’s antiestrogen effects on breast tissue.","zh":"报告描述了该药物对乳腺组织的抗雌激素作用。"}]}],"synonyms":["anti-estrogen","estrogen blocker","antiestrogenic"],"phonetic":"/ˌæn.tiˈɛs.trə.dʒən/","extraExplanation":["在医学语境里，antiestrogen 常指两大类策略：①阻断雌激素受体（如 SERM：他莫昔芬；SERD：氟维司群），②降低体内雌激素水平（如芳香化酶抑制剂：来曲唑、阿那曲唑，严格说更常被称为“抗雌激素/抑制雌激素”治疗的一部分）。具体用药需由医生根据绝经状态、肿瘤受体情况和副作用风险决定。","词形上 anti- 表示“反对/抑制”，estrogen 是“雌激素”。写作中常见连字符形式 anti-estrogen，也常写作 antiestrogen。"]}
{"word":"antiestrogenic","summary":{"en":"“Antiestrogenic” describes something that blocks or reduces estrogen’s effects in the body.","zh":"“Antiestrogenic”指能阻断或减弱体内雌激素作用的（抗雌激素的）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Preventing or reducing the effects of estrogen in the body (for example, by blocking estrogen receptors or lowering estrogen activity).","zh":"抗雌激素的；抑制或减弱体内雌激素作用的（例如阻断雌激素受体或降低雌激素活性）。"},"examples":[{"en":"Tamoxifen is an antiestrogenic drug often used in some types of breast cancer treatment.","zh":"他莫昔芬是一种抗雌激素药物，常用于某些类型的乳腺癌治疗。"},{"en":"Researchers studied whether the compound has antiestrogenic effects in lab tests.","zh":"研究人员在实验室测试中研究这种化合物是否具有抗雌激素作用。"}]}],"synonyms":["anti-estrogen","estrogen-blocking","antiestrogen"],"phonetic":"/ˌæn.tiˌiːˈstroʊ.dʒə.nɪk/","extraExplanation":["这个词多见于医学与生物学语境（如肿瘤学、内分泌学、药理学）。需要注意：antiestrogenic（抗雌激素的）是描述“作用/性质”的形容词；antiestrogen（抗雌激素）更常作名词，指一类药物或物质。","常见相关词：estrogen receptor（雌激素受体）、estrogen-blocking（阻断雌激素的）、selective estrogen receptor modulator / SERM（选择性雌激素受体调节剂，如他莫昔芬）。在不同组织里，同一种药物可能表现出不同程度的“抗”或“类”雌激素效应，具体取决于受体与组织环境。"]}
{"word":"Antietam","summary":{"en":"Antietam refers to a creek in Maryland and, more commonly, to the Battle of Antietam (1862), a key and very deadly Civil War battle.","zh":"Antietam既指马里兰州的安提坦溪，也更常指1862年的安提坦战役——美国内战中关键且伤亡惨重的一战。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a creek in Maryland, U.S., best known because it gave its name to the Battle of Antietam (1862) during the American Civil War.","zh":"美国马里兰州的一条小溪，因1862年美国内战中的“安提坦战役”（Battle of Antietam）而广为人知。"},"examples":[{"en":"Antietam Creek runs through western Maryland.","zh":"安提坦溪流经马里兰州西部。"},{"en":"The battlefield near Antietam Creek is now a national historical park.","zh":"安提坦溪附近的战场如今是一座国家历史公园。"}]},{"partOfSpeech":"n.","definition":{"en":"the Battle of Antietam: a major American Civil War battle fought on September 17, 1862, often described as the bloodiest single day in U.S. history.","zh":"安提坦战役：1862年9月17日爆发的美国内战重大战役，常被称为“美国历史上最血腥的一天”。"},"examples":[{"en":"In history class, we studied Antietam and its impact on the war.","zh":"在历史课上，我们学习了安提坦战役及其对战争的影响。"},{"en":"After Antietam, Lincoln moved forward with the Emancipation Proclamation.","zh":"安提坦战役之后，林肯推进了《解放宣言》。"}]}],"synonyms":["Battle of Antietam","Antietam Creek"],"phonetic":"/ˌæntiˈtæm/","extraExplanation":["“Antietam”是专有名词，常见写法为大写。英语中人们可能用“Antietam”直接指代这场战役（类似用地名代指事件）。","在美国文化语境中，提到“Antietam”往往与内战、林肯、解放宣言、以及战争伤亡等主题相关。","词源上一般认为来自当地原住民语言（常被解释为与“急流/湍流”之意相关），但具体说法在不同资料中会有差异。"]}
{"word":"antietam","summary":{"en":"Antietam is a Maryland place name best known for the 1862 Battle of Antietam in the U.S. Civil War.","zh":"Antietam 是马里兰州的地名，最广为人知的是 1862 年美国内战中的“安提坦战役”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper noun) A creek and place name in western Maryland; most commonly known because it is the site of a major U.S. Civil War battle.","zh":"（专有名词）美国马里兰州西部的一条溪流及地名；最常见的用法是指与美国内战的一场重要战役相关的地点。"},"examples":[{"en":"Antietam Creek runs near Sharpsburg, Maryland.","zh":"安提坦溪（Antietam Creek）流经马里兰州的夏普斯堡（Sharpsburg）附近。"},{"en":"They visited Antietam to learn about Civil War history.","zh":"他们去安提坦参观，了解美国内战历史。"}]},{"partOfSpeech":"other","definition":{"en":"(Proper noun) Short for the Battle of Antietam (1862), a major battle of the American Civil War.","zh":"（专有名词）“安提坦战役”的简称（1862年），美国内战中的一场重大战役。"},"examples":[{"en":"Antietam is remembered as one of the bloodiest single days in American history.","zh":"安提坦战役常被认为是美国历史上最血腥的单日战斗之一。"},{"en":"After Antietam, President Lincoln issued the preliminary Emancipation Proclamation.","zh":"安提坦战役之后，林肯总统发布了《解放奴隶宣言》初步公告。"}]}],"synonyms":["Battle of Antietam","Antietam Creek","Sharpsburg (Battle of Sharpsburg)"],"phonetic":"/ˌæntiˈtiːəm/","extraExplanation":["“Antietam”一词来自当地原住民语言（常被认为与阿尔冈昆语系有关），大意与“急流/奔流的水”相关；具体词源在不同资料中略有差异。","历史书写中你也会看到“Battle of Sharpsburg（夏普斯堡战役）”这一名称：南方邦联更常用城镇名“Sharpsburg”，而北方联邦常用溪流名“Antietam”。","在文学与文化记忆中，“Antietam”常作为美国内战惨烈程度与社会转折点的象征地名出现，尤其与战地摄影、战争报道和废奴政策转向相关。"]}
{"word":"antiethnic","summary":{"en":"Antiethnic describes attitudes, speech, or policies that oppose or show hostility toward ethnic groups or ethnic identity.","zh":"antiethnic 指对族群（民族）群体或族群认同持反对、敌视态度的言行或政策。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to or hostile toward ethnic groups, ethnic identity, or ethnic diversity.","zh":"反对或敌视族群（民族）群体、族群认同或族群多样性的。"},"examples":[{"en":"The report criticized several antiethnic policies that limited minority language education.","zh":"报告批评了几项反族群政策，它们限制了少数族裔语言教育。"},{"en":"Antiethnic rhetoric can make immigrant communities feel unsafe.","zh":"反族群言论会让移民社区感到不安全。"}]}],"synonyms":["anti-ethnic","xenophobic","ethnophobic","racist (often related, but not identical)"],"phonetic":"/ˌæntaɪˈɛθnɪk/","extraExplanation":["“antiethnic”在实际英语中比较少见，更常见的写法是带连字符的“anti-ethnic”。在学术或新闻语境里也常用“anti-immigrant”（反移民）、“anti-minority”（反少数群体）、“xenophobic”（排外的）来表达更具体的含义。","注意区分：批评“ethnic politics / ethnic favoritism”（族群政治/族群偏袒）不一定是“anti-ethnic”；只有当立场指向反对或敌视族群群体/认同本身时，才更接近“antiethnic”。"]}
{"word":"antieugenic","summary":{"en":"“Antieugenic” means opposed to eugenics and to policies or ideas that try to control reproduction to ‘improve’ a population.","zh":"“Antieugenic”指反对优生学，以及反对通过控制生育来“改良”人口的理念或政策。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to eugenics (the idea or practice of “improving” a population by controlling who can have children, often through discriminatory or coercive policies).","zh":"反优生学的；反对优生学的（优生学指通过控制谁可以生育来“改良”人口的思想或做法，常与歧视或强制政策相关）。"},"examples":[{"en":"Many disability-rights advocates take an anti-eugenic position and argue for equal dignity and support for all lives.","zh":"许多残障权利倡导者持反优生学立场，主张所有生命都应被平等尊重并获得支持。"},{"en":"The article criticizes forced sterilization laws as anti-eugenic arguments gained public attention.","zh":"随着反优生学观点受到关注，这篇文章批评了强制绝育法。"}]}],"synonyms":["anti-eugenics","opposed to eugenics","anti-discriminatory (in this context)"],"phonetic":"/ˌæn.ti.juˈdʒɛn.ɪk/","extraExplanation":["“优生学（eugenics）”一词在19世纪末由英国学者弗朗西斯·高尔顿（Francis Galton）推广。20世纪早期，部分国家出现了以优生学为名的政策与运动，包括限制移民、禁止通婚与强制绝育等，后来与纳粹德国的种族主义暴行联系更紧密，因此当代语境中常带有强烈的伦理与历史负面含义。","“anti-eugenic/antieugenic”常用于伦理学、公共政策、医学与残障研究等领域，用来强调反对以遗传“优劣”来评判人群、反对强迫或隐性强迫的生殖控制，并主张以人权与平等为中心的立场。"]}
{"word":"antievangelical","summary":{"en":"“Antievangelical” means opposed to or strongly critical of evangelical Christianity.","zh":"“Antievangelical”指反对或强烈批评（基督教）福音派的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to, critical of, or rejecting evangelical Christianity (the evangelical movement or its beliefs and influence).","zh":"反福音派的；反对、批评或拒绝（基督教）福音派运动及其信仰或社会影响的。"},"examples":[{"en":"Some commentators described the article as antievangelical because it attacked evangelical leaders as a group.","zh":"一些评论者称那篇文章是反福音派的，因为它把福音派领袖作为一个群体来攻击。"},{"en":"He denied being antievangelical and said his criticism was aimed at a specific policy, not at believers.","zh":"他否认自己反福音派，并表示批评针对的是某项具体政策，而不是信徒。"}]}],"synonyms":["anti-evangelical","anti-evangelism","critical of evangelicalism","opposed to evangelicalism"],"phonetic":"/ˌæn.taɪˌiː.vænˈdʒɛl.ɪ.kəl/","extraExplanation":["“anti-”表示“反对/抵制”，加在“evangelical（福音派的）”前形成“antievangelical”。该词多见于政治评论、媒体报道或宗教社会议题讨论中，语气往往带有立场色彩。","使用时注意区分：批评某些福音派组织/领袖/政治立场，不一定等同于“反基督教”或“反宗教”；在正式写作中可更具体地说“critical of evangelical politics/leadership（批评福音派政治/领导层）”以避免过度概括。"]}
{"word":"antievolution","summary":{"en":"Antievolution means opposing evolution (the scientific theory), or refers to a person or movement that opposes it.","zh":"antievolution 指“反对进化论的”，也可指“反进化论者/反进化论运动或观点”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to the theory of evolution, especially in education, science discussion, or public policy.","zh":"反对进化论的；尤指在教育、科学讨论或公共政策中反对进化理论的。"},"examples":[{"en":"Some antievolution groups campaign to limit how evolution is taught in schools.","zh":"一些反进化论团体会发起运动，试图限制学校里进化论的教学方式。"},{"en":"The documentary explains the history of antievolution arguments in the United States.","zh":"这部纪录片介绍了美国反进化论观点的历史。"}]},{"partOfSpeech":"n.","definition":{"en":"A person, movement, or idea that opposes the theory of evolution.","zh":"反进化论者；反对进化论的运动或观点。"},"examples":[{"en":"The article interviews both scientists and antievolution speakers.","zh":"这篇文章采访了科学家和反进化论演讲者。"},{"en":"In public debates, antievolution often overlaps with religious or political concerns.","zh":"在公共辩论中，反进化论常常与宗教或政治关切交织在一起。"}]}],"synonyms":["anti-evolutionary","anti-Darwinian","creationist (often related, not identical)"],"phonetic":"/ˌæn.tiˌɛv.əˈluː.ʃən/","extraExplanation":["“antievolution”常见于美国社会语境，尤其与“创造论（creationism）”“智能设计（intelligent design）”等相关争议相连，常出现在教育课程标准、学校董事会决策和公共辩论中。","拼写上也常见作“anti-evolution”（带连字符），意思相同。作为更常用的替代表达，英语里更频繁看到“anti-evolutionary（反进化论的）”或“anti-evolutionism（反进化论立场/运动）”。"]}
{"word":"antievolutional","summary":{"en":"“Antievolutional” means opposed to evolution, especially the scientific theory of biological evolution.","zh":"“antievolutional”表示反对进化（尤指反对生物进化的科学理论）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to the idea of evolution (especially biological evolution by natural selection).","zh":"反对进化论的（尤指反对生物进化与自然选择理论的）。"},"examples":[{"en":"The museum removed an antievolutional pamphlet from its science display.","zh":"博物馆把一份反进化论的小册子从科学展区撤下。"},{"en":"In some communities, antievolutional views influence what gets taught in school.","zh":"在一些社区，反进化论的观点会影响学校教授的内容。"}]}],"synonyms":["anti-evolution","anti-evolutionary","antievolution"],"phonetic":"/ˌæntiˌɛvəˈluʃənəl/","extraExplanation":["“antievolutional”较少见，更常用的词是“anti-evolution”或“antievolution”（作形容词/名词）以及“anti-evolutionary”。在正式写作中，常见搭配有：anti-evolution laws（反进化论相关法律）、anti-evolution activism（反进化论运动）。","这个词通常出现在教育、宗教与科学传播的语境中，描述对进化论的反对立场；在学术或新闻写作里，用词时要区分“质疑某些证据/机制”与“反对进化论整体框架”，以免表达过于笼统。"]}
{"word":"antievolutionally","summary":{"en":"“Antievolutionally” means “in a way that opposes evolution or the theory of evolution.”","zh":"“antievolutionally”表示“以反对进化或进化论的方式（立场）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that opposes the theory of evolution (or the idea that living things change over time through evolution).","zh":"以反对进化论（或反对生物通过进化而变化这一观点）的方式。"},"examples":[{"en":"The speaker argued antievolutionally, insisting that species never change.","zh":"演讲者以反进化论的方式辩论，坚持物种从不改变。"},{"en":"Some groups campaign antievolutionally to remove evolution from science classes.","zh":"一些团体以反进化论的立场活动，试图把“进化”从科学课程中移除。"}]}],"synonyms":["antievolutionarily","against evolution","anti-evolution (informal)"],"phonetic":"/ˌæntiˌɛvəˈluʃənəli/","extraExplanation":["这个词很少见，更多时候人们会用 antievolution 或 antievolutionary（反进化的）来表达同样的意思。antievolutionally 主要出现在较正式或学术/辩论语境中，用来描述“以反进化立场来做某事/论证某事”的方式。","构词上是 anti-（反对）+ evolution（进化）+ -al（……的）+ -ly（……地）。相关更常见的表达：in an antievolutionary way（以反进化的方式）、from an antievolutionary perspective（从反进化的角度）。"]}
{"word":"antievolutionarily","summary":{"en":"“Antievolutionarily” means “in a way that opposes evolution or evolutionary theory.”","zh":"“antievolutionarily”表示“以反对进化或进化论的方式；反进化地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that opposes evolution or evolutionary theory (especially biological evolution)","zh":"以反对进化或进化论（尤指生物进化）的方式；反进化地"},"examples":[{"en":"Some groups argue antievolutionarily and reject the teaching of evolution in schools.","zh":"一些团体以反进化的立场进行辩论，并反对在学校教授进化论。"},{"en":"The article uses antievolutionarily framed language to question modern biology.","zh":"这篇文章用反进化的措辞来质疑现代生物学。"}]}],"synonyms":["anti-evolutionarily","in an anti-evolution way","against evolution"],"phonetic":"/ˌæntiˌɛvəˈluʃəˌnɛrəli/","extraExplanation":["这是一个非常少见、偏学术/辩论语境的副词，常出现在讨论“反进化论（anti-evolution）”或“反进化主义（antievolutionism）”的文章中。日常英语里更常见的表达是：“oppose evolution / argue against evolution / take an anti-evolution stance”。"]}
{"word":"antievolutionary","summary":{"en":"“Antievolutionary” means opposed to evolution or to teaching/accepting evolutionary explanations.","zh":"“Antievolutionary”指反对进化论，或反对教授/接受以进化解释生命发展的观点。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to the theory of evolution or to teaching/accepting evolutionary explanations of life’s development.","zh":"反对进化论的；反对用进化来解释生命发展（或反对教授/接受进化论）的。"},"examples":[{"en":"Some antievolutionary groups argue that evolution should not be taught in public schools.","zh":"一些反进化论团体认为公立学校不应教授进化论。"},{"en":"The article discusses antievolutionary arguments and how scientists respond to them.","zh":"这篇文章讨论了反进化论的论点，以及科学家如何回应。"}]}],"synonyms":["anti-evolution","creationist (context-dependent)","evolution-denying (often stronger/critical)"],"phonetic":"/ˌæn.tiˌɛv.əˈluː.ʃəˌnɛɹ.i/","extraExplanation":["“antievolutionary”常见于教育、宗教与公共政策的语境中，尤其在讨论“是否在学校教授进化论”、或“科学与宗教信仰的关系”时出现。","词形结构：anti-（反对）+ evolutionary（进化的）。也常见写法：anti-evolutionary（加连字符）。","语气与使用建议：在描述观点/立场时较中性，但在争论性文章中可能带有批判色彩。若想更中性，可用“critical of evolution（对进化论持批评态度）”。"]}
{"word":"antievolutionist","summary":{"en":"An antievolutionist is someone who opposes the scientific theory of evolution.","zh":"antievolutionist 指反对科学进化论的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposes the scientific theory of evolution (especially evolution by natural selection), often supporting creationism or other non-evolution explanations of life’s origins","zh":"反进化论者；反对（科学）进化论的人（尤指反对自然选择进化），常支持创造论或其他非进化的生命起源解释"},"examples":[{"en":"The textbook debate became heated when an antievolutionist group asked the school board to remove evolution lessons.","zh":"当一个反进化论团体要求学区董事会删除进化论课程时，关于教材的争论变得很激烈。"},{"en":"Some antievolutionists argue that evolution conflicts with their religious beliefs.","zh":"一些反进化论者认为进化论与他们的宗教信仰相冲突。"}]}],"synonyms":["anti-evolutionist","creationist (often, but not always)","opponent of evolution"],"phonetic":"/ˌæn.tiˌɛv.əˈluː.ʃə.nɪst/","extraExplanation":["这个词常出现在美国教育与公共政策语境中，尤其与“是否在公立学校教授进化论”相关的争议有关。","拼写上也常见作 anti-evolutionist（加连字符）。与之相对的表达是 evolutionist（进化论支持者/研究者）；在学术语境里更常用的是 biologist（生物学家）或 evolutionary biologist（进化生物学家）。","语气与立场：antievolutionist 往往带有“反对科学共识”的评价色彩；在正式写作中，如需中性表达，可用 “opponent of evolution” 或说明其具体立场（如 creationist）。"]}
{"word":"antievolutionistic","summary":{"en":"Antievolutionistic means strongly opposed to evolutionary theory.","zh":"Antievolutionistic 指“反对进化论的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to the theory of evolution, especially in discussions about biology, education, or religion.","zh":"反对进化论的（尤指在生物学、教育或宗教相关讨论中）。"},"examples":[{"en":"Some antievolutionistic groups argue that evolution should not be taught in public schools.","zh":"一些反进化论团体认为公立学校不应教授进化论。"},{"en":"The speaker’s antievolutionistic views were clear during the debate on science education.","zh":"在关于科学教育的辩论中，这位演讲者的反进化论观点非常明显。"}]}],"synonyms":["anti-evolution","anti-evolutionary","creationist (context-dependent)"],"phonetic":"/ˌæntiˌɛvəˌluʃəˈnɪstɪk/","extraExplanation":["“antievolutionistic”比较少见、略显书面或带批判色彩；更常见、更自然的表达是“anti-evolution”或“anti-evolutionary”。","这个词常出现在英语国家关于“进化论 vs. 创造论/智能设计（creationism / intelligent design）”的社会与教育争论中。"]}
{"word":"antiexpansion","summary":{"en":"Anti-expansion means opposing expansion, or a stance/policy that resists growth or enlargement (territorial, military, business, etc.).","zh":"Antiexpansion/anti-expansion 指“反对扩张”，也可指“反扩张的立场或政策”，适用于领土、军事、商业等语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to expansion (for example, opposing the growth of a country’s territory, a business, or a policy influence).","zh":"反对扩张的（例如反对国家领土、企业规模或政策影响力的扩大）。"},"examples":[{"en":"Some voters took an anti-expansion position on overseas military bases.","zh":"一些选民在海外军事基地问题上采取了反对扩张的立场。"},{"en":"The newspaper published an anti-expansion editorial about the company’s rapid growth.","zh":"这家报纸发表了一篇反对该公司快速扩张的社论。"}]},{"partOfSpeech":"n.","definition":{"en":"a viewpoint, movement, or policy that opposes expansion.","zh":"反扩张的观点、运动或政策。"},"examples":[{"en":"Anti-expansion grew stronger after the war ended.","zh":"战争结束后，反扩张思潮变得更强。"},{"en":"The party’s anti-expansion shaped its foreign policy.","zh":"该党的反扩张立场影响了它的外交政策。"}]}],"synonyms":["anti-imperialist","anti-annexation","anti-growth","opposed to expansion","nonexpansionist"],"phonetic":"/ˌæn.ti ɪkˈspæn.ʃən/","extraExplanation":["“anti-”是常见前缀，表示“反对、抵制”（如 anti-war 反战，anti-smoking 反吸烟）。“anti-expansion”常以连字符写作 anti-expansion，用来让结构更清晰，尤其在作定语（放在名词前）时更常见。","在历史与政治语境中，它常指“反对领土/帝国扩张”的立场（如反对吞并、殖民或军事扩张）。在商业或组织语境中，则更偏向“反对规模扩张、反对扩建/扩招”。"]}
{"word":"antiexpansionism","summary":{"en":"Antiexpansionism is the political belief or movement that opposes national expansion, especially through territorial annexation or imperial control.","zh":"Antiexpansionism 指反对国家扩张（尤其是通过吞并或帝国式控制）的政治立场或运动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to a country expanding its territory, power, or influence—especially through annexation, colonies, or military control.","zh":"反对扩张主义；指反对国家通过吞并、殖民或军事控制来扩大领土、权力或影响力的立场。"},"examples":[{"en":"In U.S. history, antiexpansionism was a key argument against annexing overseas territories.","zh":"在美国历史中，反对扩张主义曾是反对吞并海外领土的重要理由。"},{"en":"Her antiexpansionism came from a belief that empire often harms local peoples.","zh":"她的反对扩张主义源于一种信念：帝国扩张常常会伤害当地人民。"}]}],"synonyms":["anti-imperialism","nonexpansionism","opposition to expansion"],"phonetic":"/ˌæntiɪkˈspænʃəˌnɪzəm/","extraExplanation":["这个词通常出现在政治与历史语境中，尤其常用来描述19世纪末到20世纪初美国国内对“对外扩张/帝国主义”（如吞并菲律宾、波多黎各等）的反对立场。","构词法：anti-（反对）+ expansion（扩张）+ -ism（主义/立场），因此常用于描述一种政治立场或思想，而不只是个人情绪上的“反对”。"]}
{"word":"antiexpansionist","summary":{"en":"Antiexpansionist means opposing a country’s territorial or imperial expansion; it can also refer to a person who holds that view.","zh":"Antiexpansionist 指反对国家领土或帝国扩张；也可指持这种立场的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to a country expanding its territory or political control (especially through colonization, annexation, or empire-building).","zh":"反对国家扩张领土或政治控制（尤指通过殖民、吞并或建立帝国）的。"},"examples":[{"en":"Many antiexpansionist leaders argued that overseas colonies would drag the country into unnecessary wars.","zh":"许多反扩张主义领导人认为，海外殖民地会把国家拖入不必要的战争。"},{"en":"Her antiexpansionist views shaped how she voted on foreign policy.","zh":"她的反扩张主义观点影响了她在外交政策上的投票。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who opposes a nation’s territorial or imperial expansion.","zh":"反对国家领土扩张或帝国扩张的人；反扩张主义者。"},"examples":[{"en":"The antiexpansionists protested the annexation and called for self-rule for the local people.","zh":"反扩张主义者抗议吞并，并呼吁让当地人民自治。"},{"en":"In class we read speeches by both expansionists and antiexpansionists.","zh":"课堂上我们阅读了扩张主义者和反扩张主义者双方的演讲。"}]}],"synonyms":["anti-imperialist","noninterventionist (sometimes)","isolationist (sometimes)"],"phonetic":"ˌæn.tiɪkˈspæn.ʃə.nɪst","extraExplanation":["这个词在美国历史语境中较常见，尤其与19世纪末的“反帝国主义/反扩张”争论有关（例如美西战争后关于菲律宾、波多黎各等地位的争论）。常与 anti-imperialist（反帝国主义者）意义接近，但 antiexpansionist 更强调“反对领土/势力范围扩大”这一点。","拼写上也常见作 anti-expansionist（加连字符），含义相同；写作 antiexpansionist 属于合写形式。"]}
{"word":"antiexporting","summary":{"en":"Anti-exporting means opposing or discouraging exports.","zh":"anti-exporting 指“反对或抑制出口的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to exporting goods or services, or intended to reduce/stop exports (often describing a policy, rule, or attitude).","zh":"反对出口的；旨在减少/阻止出口的（常用来形容政策、规定或态度）。"},"examples":[{"en":"The new regulation was criticized as anti-exporting because it made shipping overseas much harder.","zh":"这项新规定被批评为“反出口的”，因为它让海外运输变得更困难。"},{"en":"Some businesses say anti-exporting measures hurt local jobs that depend on foreign sales.","zh":"一些企业表示，反出口措施会伤害依赖海外销售的本地工作岗位。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of being against exporting; opposition to exports (less common, often treated as an idea rather than a formal noun).","zh":"反对出口的行为或立场；对出口的抵制（较少见，常表示一种观点）。"},"examples":[{"en":"There was strong anti-exporting sentiment during the period of high domestic shortages.","zh":"在国内严重短缺时期，反对出口的情绪很强。"}]}],"synonyms":["anti-export","export-restricting","anti-trade (context-dependent)"],"phonetic":"/ˌæn.tiˈɛkˌspɔr.tɪŋ/","extraExplanation":["“anti-”是英语中常见前缀，表示“反对、抵制”。“anti-exporting”通常更常写作“anti-export”或“anti-export policy/measures”（反出口政策/措施），也常用连字符“anti-exporting”来强调“与出口相关的做法或倾向”。","在正式写作中，如果你要描述“阻止出口的政策”，更自然的搭配是：anti-export regulations/measures/tariffs（反出口的规定/措施/关税）。"]}
{"word":"antiexpressionism","summary":{"en":"Antiexpressionism means opposition to Expressionism, especially in art, favoring clarity, restraint, and less emotional distortion.","zh":"Antiexpressionism 指反对表现主义（尤指艺术上），倾向清晰、克制、较少情绪化变形的取向。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to Expressionism in art (the belief that art should not focus on intense personal emotion or distorted forms, and may instead prefer realism, order, or traditional styles).","zh":"（艺术领域）反表现主义：反对表现主义的观点/立场（不赞成用强烈主观情绪或夸张变形来表现，而更偏好写实、秩序或传统风格）。"},"examples":[{"en":"Some critics saw the movement as a kind of antiexpressionism, arguing that art should return to clarity and structure.","zh":"一些评论家把这一潮流视为一种反表现主义，认为艺术应该回到清晰与结构。"},{"en":"His later paintings show antiexpressionism: fewer dramatic colors and less distortion.","zh":"他后期的绘画呈现出反表现主义特征：戏剧化色彩更少、变形也更少。"}]},{"partOfSpeech":"n.","definition":{"en":"A political or cultural attitude that rejects emotional, highly subjective expression in writing, film, or public art, favoring restraint and neutrality.","zh":"（文化/写作/影视等）反（强烈）表达主义：拒绝情绪化、强主观的表达方式，倾向克制与中性。"},"examples":[{"en":"The director’s antiexpressionism is clear in the film’s calm camera work and realistic dialogue.","zh":"导演的反表达主义很明显：镜头克制、对白写实。"},{"en":"In that period, antiexpressionism was linked to calls for “objective” art.","zh":"在那个时期，反表达主义常与对“客观”艺术的呼吁联系在一起。"}]}],"synonyms":["opposition to Expressionism","anti-Expressionism","reaction against Expressionism","anti-emotional style"],"phonetic":"/ˌæntiɪkˈsprɛʃəˌnɪzəm/","extraExplanation":["“Antiexpressionism”常见于艺术史或评论写作中，用来描述对20世纪初“表现主义（Expressionism）”的反动或反拨。表现主义强调主观感受、情绪张力与夸张变形；而“反表现主义”往往推崇更冷静、清晰、可读性更强的风格（例如更写实或更古典的形式）。","它不是一个像“Impressionism（印象主义）/Surrealism（超现实主义）”那样固定、统一的流派名称；很多时候只是批评家用于概括某些艺术家或时期审美取向的标签。"]}
{"word":"antiexpressionist","summary":{"en":"Antiexpressionist means opposing Expressionism or an Expressionist style; it can also mean a person who holds that view.","zh":"Antiexpressionist 指反对表现主义或表现主义风格；也可指持这种观点的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to Expressionism (the art/literary movement that emphasizes strong emotion and subjective experience), or rejecting Expressionist styles.","zh":"反对表现主义（强调强烈情感与主观体验的艺术/文学运动）的；拒绝表现主义风格的。"},"examples":[{"en":"Some critics took an antiexpressionist stance, arguing that the paintings were too emotional and distorted.","zh":"一些评论家采取反表现主义立场，认为这些画作过于情绪化、变形太严重。"},{"en":"The gallery promoted a more realistic style in an antiexpressionist reaction to earlier trends.","zh":"画廊推动更写实的风格，作为对早期潮流的反表现主义反动。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who opposes Expressionism or prefers non-Expressionist artistic approaches.","zh":"反对表现主义的人；偏好非表现主义艺术方式的人。"},"examples":[{"en":"As an antiexpressionist, he favored clear lines and everyday subjects.","zh":"作为反表现主义者，他更偏好清晰的线条和日常题材。"},{"en":"The debate set antiexpressionists against artists who wanted freer, more emotional forms.","zh":"这场争论让反表现主义者与追求更自由、更情绪化形式的艺术家对立起来。"}]}],"synonyms":["anti-Expressionist","non-Expressionist","anti-modernist (context-dependent)","realist (often related, not identical)"],"phonetic":"/ˌæntiɪkˈsprɛʃənɪst/","extraExplanation":["“anti-”表示“反对/抵制”，后面接“Expressionist（表现主义者/表现主义的）”。因此 antiexpressionist 常用于艺术史、评论或文学批评语境，描述一种审美立场：更强调客观再现、清晰结构或理性克制，而不是夸张变形与强烈情绪表达。","相关概念：Expressionism（表现主义）常与 20 世纪初的德国绘画、戏剧和电影联系紧密；在英文评论中，anti-expressionist 有时也指“反对某种表现主义倾向”的写作或舞台风格。"]}
{"word":"antiexpressionistic","summary":{"en":"Anti-expressionistic means opposing or avoiding Expressionism’s emotionally exaggerated, distorted style.","zh":"antiexpressionistic 指反对或回避表现主义那种情绪强烈、夸张变形的风格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to Expressionism (especially in art, film, music, or literature), or rejecting the emotional, distorted, highly subjective style typical of Expressionism.","zh":"反表现主义的；反对（艺术、电影、音乐或文学中的）表现主义，或拒绝其夸张、变形、强烈主观情绪的风格。"},"examples":[{"en":"The director chose an antiexpressionistic visual style, avoiding harsh shadows and exaggerated angles.","zh":"导演选择了反表现主义的视觉风格，避免强烈阴影和夸张的镜头角度。"},{"en":"Her antiexpressionistic approach focuses on calm observation instead of emotional distortion.","zh":"她的反表现主义方法强调冷静观察，而不是情绪化的变形表达。"}]}],"synonyms":["anti-expressionist","non-expressionistic","anti-stylized","restrained","naturalistic"],"phonetic":"/ˌæntiɪkˌsprɛʃəˈnɪstɪk/","extraExplanation":["“Expressionism（表现主义）”常指20世纪初在德国兴起的重要艺术思潮，强调主观感受与情绪强度，常用夸张、扭曲、强烈对比来呈现内心世界（例如绘画中的变形人物、电影中的尖锐布景与强烈光影）。因此“antiexpressionistic”常用于评论某作品刻意走向更克制、更写实或更客观的审美方向。","构词法：anti-（反对）+ expressionistic（表现主义的）。写作时常见连字符形式：anti-expressionistic；也可不加连字符：antiexpressionistic。"]}
{"word":"antiexpressive","summary":{"en":"Antiexpressive means intentionally not showing strong emotion or personal expression, especially in art, writing, or design.","zh":"Antiexpressive 指刻意避免强烈情绪或个人抒情的（尤用于艺术、写作或设计）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of art, design, writing, or behavior) deliberately avoiding personal emotion, dramatic expression, or an expressive style; intentionally neutral or restrained.","zh":"（指艺术、设计、写作或行为）刻意避免个人情感、戏剧化表达或“表现性”风格；强调中性、克制。"},"examples":[{"en":"The director chose an antiexpressive style, using long, quiet shots and minimal music.","zh":"导演选择了反表现的风格，使用长时间的安静镜头和极少的配乐。"},{"en":"Her antiexpressive prose reports events plainly, without emotional commentary.","zh":"她的反表现性文风平实地叙述事件，不加情绪化评论。"}]},{"partOfSpeech":"adj.","definition":{"en":"opposed to the idea that art or language should mainly express inner feelings; preferring structure, clarity, or function over self-expression.","zh":"反对“艺术或语言主要应当表达内心情感”的观点；更重视结构、清晰或功能，而不是自我抒情。"},"examples":[{"en":"Some critics call the movement antiexpressive because it values order more than individual feeling.","zh":"一些评论家称这个流派为反表现的，因为它更重视秩序而非个人情感。"},{"en":"In class, we discussed antiexpressive attitudes in modern architecture.","zh":"课堂上我们讨论了现代建筑中的反表现倾向。"}]}],"synonyms":["restrained","understated","impersonal","neutral","unemotional","austere"],"phonetic":"/ˌæntiɪkˈsprɛsɪv/","extraExplanation":["“antiexpressive”不是日常高频词，更常见于艺术评论、文学批评、建筑与设计语境，用来形容一种“刻意不煽情/不抒情”的审美取向。","构词：anti-（反、对抗）+ expressive（表现性的）。含义通常不是“完全没有感情”，而是“把情绪放到更隐蔽、更节制的位置”，强调客观、冷静、功能性或形式感。","相关对比：expressive（富有表现力的）/ emotive（情绪强烈的） vs. restrained, understated, impersonal, neutral（克制、含蓄、非个人化、中性）。"]}
{"word":"antiexpressively","summary":{"en":"Antiexpressively means “in a restrained, non-expressive way,” or “in a way that opposes expressiveness.”","zh":"antiexpressively 指“克制、不富于表情地”，也可指“以反对表现力的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that avoids showing feelings, thoughts, or style openly; not expressively.","zh":"以一种避免公开表达情感、想法或风格的方式；不富于表情地。"},"examples":[{"en":"He answered antiexpressively, keeping his face and voice neutral.","zh":"他不露声色地回答，表情和语气都很平淡。"},{"en":"The actor played the role antiexpressively to suggest emotional numbness.","zh":"演员用克制、几乎无表情的方式来演这个角色，以暗示情感麻木。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that opposes or resists expressive language, art, or performance.","zh":"以一种反对或抵制富于表现力的语言、艺术或表演的方式。"},"examples":[{"en":"The group spoke antiexpressively about modern poetry, preferring plain speech.","zh":"这个团体对现代诗采取反表现主义态度，更偏好朴素的表达。"},{"en":"Some critics read the novel as antiexpressively written—deliberately dry and restrained.","zh":"一些评论家认为这部小说的写法是反表现性的——刻意干涩、克制。"}]}],"synonyms":["unexpressively","impassively","restrainedly","flatly","without expression"],"phonetic":"/ˌæntiɪkˈsprɛsɪvli/","extraExplanation":["这个词不常见，通常是由前缀 anti-（“反对/抑制”）+ expressively（“富于表现力地”）构成，多见于评论、文学分析或正式写作中。日常英语里更常用的说法是 without expression, unemotionally, in a restrained way, flatly。"]}
{"word":"antiexpressiveness","summary":{"en":"“Antiexpressiveness” means a lack of expressiveness or a deliberate choice to avoid showing feelings, especially as a style in art or communication.","zh":"“Antiexpressiveness”指缺乏表达性，或刻意避免表现情感，尤其可作为艺术或交流中的一种风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or tendency of being not expressive; a deliberate lack of emotional or personal expression (often discussed in art, writing, or communication).","zh":"缺乏（或刻意避免）表达性；不表露情感或个人表达的倾向（常用于艺术、写作或交流语境）。"},"examples":[{"en":"Some minimalist poems create power through antiexpressiveness rather than strong emotion.","zh":"一些极简诗通过“反表达性”来产生力量，而不是依靠强烈情绪。"},{"en":"His public speaking style is marked by antiexpressiveness, with very little facial movement.","zh":"他的公开演讲风格带有明显的反表达性，面部表情很少变化。"}]}],"synonyms":["inexpressiveness","restraint","emotional reserve","impassivity"],"phonetic":"/ˌæntiɪkˈsprɛsɪvnəs/","extraExplanation":["这个词较少见，多用于评论性语境（如文学批评、艺术理论、传播研究）。它由前缀 anti-（反对、抵制）+ expressiveness（表达性）+ -ness（名词后缀）构成，强调“对表达性的抑制或反向选择”，不一定等于冷漠，也可能是一种风格策略。"]}
{"word":"antiextreme","summary":{"en":"Anti-extreme means opposed to extremes and supportive of moderation.","zh":"anti-extreme 指反对极端、支持温和中庸的态度或立场。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to extreme ideas, actions, or positions; favoring moderation.","zh":"反对极端（思想、行为或立场）的；主张温和、中庸的。"},"examples":[{"en":"The group took an anti-extreme stance and encouraged calm discussion.","zh":"该团体采取反极端的立场，鼓励冷静讨论。"},{"en":"Her anti-extreme views made her a popular mediator during the debate.","zh":"她反极端的观点使她在辩论中成为受欢迎的调解者。"}]}],"synonyms":["moderate","anti-extremist","centrist","temperate"],"phonetic":"/ˌænti ɪkˈstriːm/","extraExplanation":["“antiextreme”更常见的写法是“anti-extreme”（带连字符），尤其在正式写作中更清晰。作为构词方式，“anti-”表示“反对……”。","这个词在政治评论、社会议题或媒体语境中更常见，用来描述“反极端主义/反激进化”的态度或政策。需要注意：它通常指反对“极端化”，不一定等同于支持某一方立场。"]}
{"word":"antieyestrain","summary":{"en":"“Anti-eye-strain” means made to reduce eye fatigue, often for screens (also used as a noun for a related feature/filter).","zh":"“anti-eye-strain”指“防眼疲劳/抗眼疲劳”的，多用于屏幕相关设置或功能，也可作名词指该功能/滤镜。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to reduce tiredness or discomfort in the eyes, especially when looking at screens for a long time.","zh":"用于减轻眼睛疲劳或不适（尤其是长时间看屏幕时）的。"},"examples":[{"en":"This monitor has an anti-eye-strain mode for night reading.","zh":"这款显示器有夜间阅读的抗眼疲劳模式。"},{"en":"I bought anti-eye-strain glasses for online classes.","zh":"我买了防眼疲劳眼镜用来上网课。"},{"en":"Try turning on the anti-eye-strain filter to make the screen warmer.","zh":"试着开启防眼疲劳滤镜，让屏幕色调更暖一些。"}]},{"partOfSpeech":"n.","definition":{"en":"A feature, filter, or product that reduces eye strain.","zh":"（产品/功能）防眼疲劳功能；抗眼疲劳滤镜/产品。"},"examples":[{"en":"The app includes an anti-eye-strain filter.","zh":"这个应用带有防眼疲劳滤镜。"},{"en":"Many e-readers advertise anti-eye-strain technology.","zh":"很多电子阅读器宣传有防眼疲劳技术。"}]}],"synonyms":["eye-friendly","reduce eye strain","low blue light","blue-light filter","anti-glare"],"phonetic":"/ˌæn.ti ˈaɪ ˌstreɪn/","extraExplanation":["“anti-eye-strain”常见于广告或产品参数（显示器、手机、阅读灯、眼镜镜片等）。有时也写作“anti eye strain”或“anti–eye strain”。","它通常指降低屏幕亮度/闪烁、调整色温更偏暖、减少眩光等设置；有些产品也会提到“blue light filter（蓝光过滤）”。注意：这些功能可能让眼睛更舒服，但不一定等同于“护眼/治疗”。更通用的表达还有“reduce eye strain（减轻眼疲劳）”。"]}

