{"word":"antivaccination","summary":{"en":"Antivaccination means opposing or strongly doubting vaccines, or the movement/ideas that discourage vaccination.","zh":"antivaccination 指反对或强烈质疑疫苗接种，或指抵制疫苗的观念/运动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposing or strongly skeptical of vaccination; relating to beliefs, movements, or actions that discourage vaccines.","zh":"反对或强烈质疑疫苗接种的；与抵制疫苗的观点、运动或行为有关的。"},"examples":[{"en":"Antivaccination claims spread quickly on social media.","zh":"反疫苗的说法在社交媒体上传播得很快。"},{"en":"Some communities are working to address antivaccination misinformation.","zh":"一些社区正在努力应对反疫苗的错误信息。"}]},{"partOfSpeech":"n.","definition":{"en":"A set of beliefs or a movement that opposes vaccination.","zh":"反对疫苗接种的一套观念或运动。"},"examples":[{"en":"The article examines the rise of antivaccination in recent years.","zh":"这篇文章探讨了近年来反疫苗思潮的兴起。"}]}],"synonyms":["anti-vaccination","anti-vax","vaccine skepticism","vaccine hesitancy"],"phonetic":"/ˌæn.tiˌvæk.səˈneɪ.ʃən/","extraExplanation":["“antivaccination”常见于公共卫生与新闻语境，也常写作“anti-vaccination”或缩写为“anti-vax”。其中“vax”是“vaccine/ vaccination”的口语缩写（来自词首音节）。","在写作中可以用更中性的表达来描述现象，例如：vaccine skepticism（对疫苗的怀疑）、vaccine hesitancy（疫苗犹豫）。如果需要强调“传播错误信息”，可用 vaccine misinformation/disinformation（疫苗错误信息/蓄意误导信息）。"]}
{"word":"antivaccinationist","summary":{"en":"An antivaccinationist is a person who opposes vaccines or promotes anti-vaccine views.","zh":"antivaccinationist 指反对疫苗或宣传反疫苗观点的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who is opposed to vaccination or who actively campaigns against vaccines.","zh":"反对疫苗接种的人；积极宣传反疫苗观点的人。"},"examples":[{"en":"Some antivaccinationists share misleading stories online about vaccine safety.","zh":"一些反疫苗人士会在网上分享关于疫苗安全性的误导性说法。"},{"en":"The doctor answered questions patiently, even from antivaccinationists.","zh":"医生很耐心地回答问题，甚至也回应反疫苗者的疑问。"}]}],"synonyms":["anti-vaxxer","vaccine skeptic (broader/softer)","vaccine opponent"],"phonetic":"/ˌæn.tiˌvæk.səˈneɪ.ʃə.nɪst/","extraExplanation":["这个词常出现在公共卫生与社会议题语境中，带有较强立场色彩；在正式写作中也可用较中性的表达如 “people who oppose vaccination（反对接种疫苗的人）”。","构词上可拆为 anti-（反对）+ vaccination（疫苗接种）+ -ist（……主义者/从业者/支持者，表示某类人）。"]}
{"word":"antivaccinator","summary":{"en":"An antivaccinator is someone who opposes vaccines or promotes not getting vaccinated.","zh":"antivaccinator 指反对疫苗或宣传不接种疫苗的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposes vaccination or encourages others not to get vaccinated","zh":"反对接种疫苗的人；鼓动他人不接种疫苗的人（反疫苗者）"},"examples":[{"en":"Some antivaccinators spread misinformation online about vaccine safety.","zh":"一些反疫苗者在网上散布有关疫苗安全性的错误信息。"},{"en":"Doctors try to answer questions patiently when families have been influenced by antivaccinators.","zh":"当家庭受到反疫苗者影响时，医生会尽量耐心解答疑问。"}]}],"synonyms":["anti-vaxxer","vaccine opponent"],"phonetic":"/ˌæn.tiˈvæk.səˌneɪ.tɚ/","extraExplanation":["“antivaccinator”由前缀 anti-（反对）+ vaccinator（接种疫苗的人/施行疫苗接种者）构成，也常写作 anti-vaccinator。","在公共讨论中，这是一个带有立场色彩、常见于新闻与社交媒体的词。描述观点时也可用更中性的表达，如 “vaccine-hesitant (对疫苗犹豫的)” 或 “vaccine skeptic (疫苗怀疑者)”，但它们不一定等同于明确反对疫苗的人。"]}
{"word":"antivaccinist","summary":{"en":"“Antivaccinist” means a person who is against vaccines or vaccination.","zh":"“antivaccinist”指反对疫苗或反对接种疫苗的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposes vaccination or believes vaccines are unsafe or unnecessary","zh":"反对接种疫苗的人；认为疫苗不安全或没必要的人"},"examples":[{"en":"Some antivaccinists spread misinformation online about vaccine safety.","zh":"一些反疫苗者在网上传播有关疫苗安全性的错误信息。"},{"en":"Doctors try to answer antivaccinists’ questions with clear evidence and empathy.","zh":"医生会用清晰的证据并以同理心回应反疫苗者的疑问。"}]}],"synonyms":["anti-vaxxer","vaccine opponent","anti-vaccination advocate"],"phonetic":"/ˌæn.tiˈvæk.sə.nɪst/","extraExplanation":["“antivaccinist”常见近义说法是“anti-vaxxer”（更口语、媒体常用）。在正式写作中也会用“vaccine hesitancy”（疫苗犹豫）来描述更广的态度范围：不一定完全反对，而是担心、副作用顾虑或对制度缺乏信任。实际交流时，使用更中性的表述（如“vaccine-hesitant people”）往往更利于沟通。","该词带有明显立场色彩，可能让对方感到被贴标签。讨论公共卫生议题时，注意区分“反对疫苗本身”与“对某一种疫苗/政策有疑虑”，并尽量基于可靠来源。"]}
{"word":"antivagal","summary":{"en":"Antivagal means counteracting or reducing the effects of the vagus nerve, especially to prevent a slow heart rate or low blood pressure.","zh":"antivagal 指“抗迷走神经的”，用于抵消迷走神经作用，常为预防心率变慢或血压下降。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Counteracting, blocking, or reducing the effects of the vagus nerve (which can slow the heart rate and lower blood pressure).","zh":"（医学）抗迷走神经的；用于抵消、阻断或减弱迷走神经作用的（迷走神经可能使心率变慢、血压下降）。"},"examples":[{"en":"The doctor gave an antivagal drug to prevent the patient’s heart rate from dropping during the procedure.","zh":"医生在手术过程中使用抗迷走神经药物，以防患者心率下降。"},{"en":"Antivagal medications are sometimes used when a person has strong vasovagal reactions.","zh":"当一个人出现强烈的血管迷走性反应时，有时会使用抗迷走神经药物。"}]}],"synonyms":["anti-vagal","vagolytic","anticholinergic (often related)"],"phonetic":"/ˌæntiˈveɪɡəl/","extraExplanation":["“anti-”表示“反、抗”；“vagal”来自“vagus nerve（迷走神经）”。临床语境中常见于麻醉、手术或处理“血管迷走性晕厥（vasovagal syncope）/迷走神经反射”时，强调“避免心动过缓（bradycardia）或低血压（hypotension）”。","日常英语中较少使用，多见于医学论文、病历或药理学语境。常见相关词：vagal（迷走神经的）、vasovagal（血管迷走性的）、anticholinergic（抗胆碱能的，常用于抑制迷走神经效应）。"]}
{"word":"antivandalism","summary":{"en":"“Antivandalism” means preventing or resisting vandalism, or the measures taken to stop it.","zh":"“antivandalism”表示“防破坏/反破坏”，既可指具有防破坏功能的设计，也可指防止破坏行为的措施。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Intended to prevent vandalism (deliberate damage or defacement), or designed to resist it.","zh":"用于防止破坏（故意损坏或涂污），或具有抗破坏设计的。"},"examples":[{"en":"The city installed anti-vandalism lights in the subway station.","zh":"市政府在地铁站安装了防破坏照明设备。"},{"en":"The school chose anti-vandalism paint that is easier to clean.","zh":"学校选择了更容易清理的防涂鸦（防破坏）涂料。"}]},{"partOfSpeech":"n.","definition":{"en":"Measures, policies, or actions taken to stop vandalism.","zh":"为阻止破坏行为而采取的措施、政策或行动。"},"examples":[{"en":"The park announced new anti-vandalism rules and added security cameras.","zh":"公园公布了新的反破坏规定，并加装了监控摄像头。"},{"en":"Community groups organized anti-vandalism campaigns to protect public art.","zh":"社区团体组织了反破坏宣传活动来保护公共艺术。"}]}],"synonyms":["vandal-resistant","anti-vandal","damage-resistant","tamper-resistant","protective measures"],"phonetic":"/ˌæn.tiˈvæn.dəˌlɪ.zəm/","extraExplanation":["“anti-”是常见前缀，表示“反对／防止”。因此 anti-vandalism 多用于公共设施、交通系统、学校等场景，常与 lights（灯）、coating/paint（涂层/涂料）、hardware（五金/设备）、measures（措施）等搭配。","拼写上也常见连字符写法 anti-vandalism；作形容词时更常出现在名词前（anti-vandalism glass/paint/camera）。"]}
{"word":"antivariolous","summary":{"en":"“Antivariolous” means “against smallpox,” especially describing vaccination or prevention.","zh":"“antivariolous”指“抗天花的/用于预防天花的”，尤用于描述疫苗接种或预防措施。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to preventing or protecting against smallpox (variola), especially through vaccination.","zh":"（尤指通过接种疫苗）与预防天花（variola）有关的；抗天花的。"},"examples":[{"en":"Edward Jenner’s work led to the first effective antiviral—more precisely, antivariolous—vaccination.","zh":"爱德华·詹纳的研究带来了第一种有效的抗病毒——更准确地说，是抗天花——疫苗接种方法。"},{"en":"In old medical writings, you may see “antivariolous inoculation” used to describe early smallpox prevention.","zh":"在较早的医学文献中，你可能会看到“antivariolous inoculation（抗天花接种）”用来指早期的天花预防方式。"}]}],"synonyms":["anti-smallpox","smallpox-preventing","protective against smallpox"],"phonetic":"/ˌæn.ti.vəˈraɪ.ə.ləs/","extraExplanation":["“antivariolous”较为少见，主要出现在历史或专业语境中。现代英语更常说 smallpox vaccine（天花疫苗）、smallpox vaccination（天花疫苗接种）或 anti-smallpox（抗天花的）。","词源可拆解为 anti-（反/抗）+ variol-（来自 variola，天花）+ -ous（形容词后缀）。与此相关的词还有 variolation（人痘接种，一种早于疫苗的预防方式；风险较高）。"]}
{"word":"antivenefic","summary":{"en":"Antivenefic means “anti-venom” or “able to counteract venom,” but it is a rare word in modern English.","zh":"antivenefic 指“抗毒/解毒（尤其针对毒液）”，但在现代英语中较罕用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Preventing, counteracting, or treating the effects of venom; antidotal against snakebite or other poisons.","zh":"（罕用）抗毒的；能预防、抵消或治疗毒液（如蛇毒）作用的；解毒的。"},"examples":[{"en":"Antivenefic serum can reduce the effects of a snake’s venom if given quickly.","zh":"如果及时注射，抗毒血清可以减轻蛇毒的影响。"},{"en":"The clinic stocked antivenefic medicine for emergencies in rural areas.","zh":"这家诊所为乡村地区的紧急情况储备了抗毒药物。"}]}],"synonyms":["antidotal","antivenom","antivenin (older term)","anti-venomous"],"phonetic":"/ˌæn.ti.vəˈnɛf.ɪk/","extraExplanation":["这个词非常少见，日常英语里更常用的是 **antivenom**（抗蛇毒血清/抗毒素）或 **antivenin**（旧称）。","词根提示：**anti-** 表“反、抗”；**-venefic** 与拉丁语 *venenum*（毒、毒药）有关，含义与“毒/施毒”相关。"]}
{"word":"antivenene","summary":{"en":"Antivenene is a medicine used to counteract venom from bites or stings (more commonly called antivenom or antivenin).","zh":"Antivenene 指用于对抗毒液叮咬/蜇伤的药（更常见说法是 antivenom 或 antivenin）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medicine (antibody serum) used to treat venomous bites or stings, such as from snakes, spiders, or scorpions; antivenom.","zh":"抗蛇毒血清／抗毒血清：用来治疗毒蛇、毒蜘蛛、蝎子等毒液叮咬或蜇伤的药物（含抗体的血清）；也叫 antivenom。"},"examples":[{"en":"The doctor gave her antivenene after the snake bite.","zh":"被蛇咬后，医生给她注射了抗蛇毒血清。"},{"en":"Hospitals in rural areas often keep antivenene for emergencies.","zh":"乡村地区的医院常备抗毒血清以应对紧急情况。"}]}],"synonyms":["antivenom","antivenin","antiserum"],"phonetic":"ˌæntiˈvɛnɪn","extraExplanation":["“antivenene”在现代英语里较少见，更多时候写作 **antivenin**（美式）或 **antivenom**（更常见、也更通用）。在新闻与科普语境中，**antivenom**最常用。","词源上：**anti-** 表示“反、对抗”，**venom** 表示“毒液”。因此 antivenom 字面意思就是“对抗毒液的药”。","使用上通常强调：抗毒血清需要与特定动物的毒液相匹配（例如不同蛇种的毒液不同），所以医疗人员会尽量确认咬伤/蜇伤来源。"]}
{"word":"antivenereal","summary":{"en":"An uncommon adjective meaning “preventing or protecting against sexually transmitted diseases.”","zh":"一个不常用的形容词，意思是“预防或防护性传播疾病的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Preventing or protecting against sexually transmitted diseases (especially syphilis); not commonly used in everyday English.","zh":"抗性病的；预防或防护性传播疾病（尤其指梅毒等）的；日常英语中很少使用。"},"examples":[{"en":"The doctor discussed antivenereal measures, including condoms and regular STI testing.","zh":"医生讨论了抗性病措施，包括使用安全套和定期进行性病检测。"},{"en":"In older medical writing, some drugs were described as antivenereal treatments.","zh":"在较早的医学著作中，一些药物被描述为抗性病的治疗手段。"}]}],"synonyms":["anti-STD","STI-preventing","prophylactic (in sexual-health contexts)"],"phonetic":"/ˌæn.ti.vəˈnɪr.i.əl/","extraExplanation":["“venereal”来自拉丁语 Venus（维纳斯，爱与美之神），历史上用来指与性传播有关的疾病；现代更常用的中性说法是 “sexually transmitted disease (STD)” 或 “sexually transmitted infection (STI)”。","“antivenereal”多见于旧式医学文献或正式医学语境，日常交流里通常会直接说 “STI prevention” 或 “STD prevention”。"]}
{"word":"antivenin","summary":{"en":"Antivenin is a treatment that neutralizes venom after a poisonous bite or sting.","zh":"Antivenin 指用于中和毒液、治疗毒蛇或毒虫叮咬的抗毒素/抗蛇毒血清。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medicine made from antibodies that is used to treat venomous bites or stings (such as from snakes or spiders) by neutralizing the venom","zh":"抗蛇毒血清／抗毒素：由抗体制成，用来治疗毒蛇或其他毒虫叮咬，通过中和毒液来救治"},"examples":[{"en":"The doctor gave her antivenin after the snakebite.","zh":"她被蛇咬后，医生给她注射了抗蛇毒血清。"},{"en":"Antivenin should be given as soon as possible in serious envenomation cases.","zh":"在严重中毒（毒液进入体内）的情况下，应尽快使用抗毒素。"}]}],"synonyms":["antivenom","antiserum"],"phonetic":"/ˌæn.tiˈvɛn.ɪn/","extraExplanation":["“Antivenin”在美式英语中很常见，也常拼作“antivenom”。两者意思相同：都指用于中和毒液的治疗药物。","这类药物通常是用动物（如马或羊）产生的抗体制成，因此可能引发过敏反应；临床上会在监测下使用。","与“vaccine（疫苗）”不同：疫苗是预防用，帮助身体提前建立免疫；antivenin/antivenom 是被咬伤后用于治疗的“解毒”药物。"]}
{"word":"antivenine","summary":{"en":"Antivenin is a medicine used to counteract venom from bites or stings; it’s also called antivenom.","zh":"Antivenin 指用于中和毒液的药物（抗毒素/抗蛇毒血清），也称 antivenom。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medicine (antibody serum) used to treat venomous bites or stings, such as from snakes, spiders, or scorpions; also called antivenom","zh":"抗蛇毒血清；抗毒素（用于治疗蛇、蜘蛛、蝎子等毒性咬伤或蜇伤的药物；也叫 antivenom）"},"examples":[{"en":"The doctor gave him antivenin after the snake bite.","zh":"他被蛇咬后，医生给他注射了抗蛇毒血清。"},{"en":"Hospitals in rural areas often keep antivenin in case of emergencies.","zh":"偏远地区的医院常备抗毒素以应对紧急情况。"}]}],"synonyms":["antivenom","antivenom serum"],"phonetic":"/ˌæntɪˈvɛnɪn/","extraExplanation":["你输入的 **antivenine** 通常是 **antivenin** 的误拼。现代英语里更常见的词是 **antivenom**，意思相同。","抗毒素一般由免疫后的动物（如马或羊）血浆中提取抗体制成；使用时需要尽快就医，并在医生监测下给药，因为少数人可能出现过敏反应。"]}
{"word":"antivenins","summary":{"en":"Antivenins are medicines (antibody-based) used to treat venomous bites or stings.","zh":"Antivenins 指用于治疗毒蛇等有毒动物咬伤/蜇伤的抗毒血清（抗体类药物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Medicines made from antibodies that are used to treat venomous bites or stings (for example, from snakes, spiders, or scorpions).","zh":"由抗体制成、用于治疗毒蛇或其他有毒动物咬伤/蜇伤中毒的药物（如蛇、蜘蛛、蝎子等）。"},"examples":[{"en":"The hospital keeps several antivenins in stock for snakebite emergencies.","zh":"医院备有多种抗蛇毒血清，以应对蛇咬伤急诊。"},{"en":"Doctors chose the antivenin that matches the type of snake in the area.","zh":"医生选择与当地蛇种相匹配的抗蛇毒血清。"}]}],"synonyms":["antivenom","antivenin (singular)"],"phonetic":"/ˌæn.tɪˈvɛn.ɪnz/","extraExplanation":["“Antivenins”是复数形式；单数是“antivenin”。在现代医学与新闻报道中，也常用同义词“antivenom”（更口语、更常见）。","抗毒血清通常需要“对症”使用：不同动物的毒液成分不同，因此会有针对特定蛇种/蛛种的制剂；临床上也会考虑过敏反应等风险。"]}
{"word":"antivenom","summary":{"en":"Antivenom is a medicine used to treat venomous bites or stings.","zh":"Antivenom 指用于治疗毒蛇等有毒动物咬伤或蜇伤的抗毒血清。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medicine made from antibodies that is used to treat venomous bites or stings (such as from snakes, spiders, or scorpions)","zh":"抗毒血清；抗蛇毒血清：由抗体制成，用于治疗毒蛇、蜘蛛或蝎子等有毒动物咬伤或蜇伤的药物"},"examples":[{"en":"The doctor gave him antivenom after the snakebite.","zh":"他被蛇咬后，医生给他注射了抗毒血清。"},{"en":"Antivenom works best when it is given as soon as possible.","zh":"抗毒血清越早使用效果越好。"}]}],"synonyms":["antivenin","antidote (general word)"],"phonetic":"/ˌæn.t̬iˈvɛn.əm/","extraExplanation":["“Antivenom”和“antivenin”都表示“抗毒血清”。“Antivenom”在现代英语里更常见，也更符合“venom（毒液）”这个词的构词逻辑；“antivenin”是较早期的用法，在一些国家或旧文献中仍会见到。","抗毒血清通常是用少量毒液让动物（常见是马或羊）产生免疫反应，再从其血浆中提取并纯化抗体制成；不同毒物需要不同配方，所以“对症”的抗毒血清很重要。","日常英语里更常说“get antivenom”或“receive antivenom（接受抗毒血清治疗）”。“Venom”特指动物注入人体的毒液；而“poison”更广，包含误食或接触的毒物。"]}
{"word":"antivenomous","summary":{"en":"Antivenomous means “counteracting venom,” especially describing treatments used for venomous bites or stings.","zh":"antivenomous 指“抗毒液的/能中和毒液的”，常用于描述对付毒蛇咬伤或毒虫蜇伤的治疗。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to counteract or neutralize venom; used to describe a substance or treatment (such as antivenom) that works against snake or other animal venom.","zh":"抗蛇毒的；能中和或抵消毒液的（常指抗蛇毒血清/抗毒素等治疗手段）。"},"examples":[{"en":"The clinic keeps antivenomous drugs on hand for snakebite emergencies.","zh":"这家诊所备有抗蛇毒药物，以应对蛇咬伤的紧急情况。"},{"en":"Rapid access to antivenomous treatment can save a patient’s life.","zh":"快速获得抗蛇毒治疗可能挽救患者生命。"}]}],"synonyms":["antivenomous","anti-venom","antivenom","antivenin","antitoxic"],"phonetic":"/ˌæn.tiˈvɛn.ə.məs/","extraExplanation":["“antivenomous”在日常英语中较少见，更常用的词是“antivenom”（名词：抗蛇毒血清/抗毒素）或“anti-venom/antivenin”。在医学与新闻报道里，通常会说“antivenom treatment/antivenom therapy”（抗蛇毒治疗）。","“antivenin”是较旧的拼法，现代更常用“antivenom”。此外，“antivenomous”通常用于较正式或技术性的语境。"]}
{"word":"antivermicular","summary":{"en":"“Antivermicular” means anthelmintic—used to prevent or remove parasitic worms.","zh":"“antivermicular”指“驱虫的/抗蠕虫的”，用于预防或清除寄生虫（蠕虫）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"preventing, killing, or expelling parasitic worms (especially intestinal worms); anthelmintic.","zh":"（尤指肠道）驱除、杀灭或预防寄生虫（蠕虫）的；驱虫的。"},"examples":[{"en":"The doctor prescribed an antivermicular medicine for the child’s pinworm infection.","zh":"医生给孩子的蛲虫感染开了驱虫药。"},{"en":"Some herbal remedies are marketed as antivermicular treatments, but evidence varies.","zh":"一些草药疗法被宣传为驱虫治疗，但证据强弱不一。"},{"en":"In older medical writing, “antivermicular” was used for drugs that expel worms.","zh":"在较早的医学文献中，“antivermicular”常用来指能驱除寄生虫的药物。"}]}],"synonyms":["anthelmintic","vermifuge","antihelminthic"],"phonetic":"/ˌæn.ti.vɝˈmɪk.jə.lɚ/","extraExplanation":["这个词比较少见，多用于较旧或较专业的医学语境；更常见的对应词是 **anthelmintic**（驱虫的、抗蠕虫的）。","词源可拆解为 **anti-**（反、抗）+ **vermicular**（与虫/蠕虫有关的；源自拉丁语 *vermis* “虫”）。"]}
{"word":"Antivert","summary":{"en":"“Antivert” is an informal, not widely standard term for someone who strongly avoids socializing (or describing that behavior).","zh":"“Antivert”是较口语、非标准的说法，指（或形容）强烈回避社交、非常偏好独处的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A person who strongly avoids social interaction; someone extremely introverted or openly opposed to being socially involved.","zh":"（非正式用语）指非常回避社交的人；极度内向、甚至对社交参与持抗拒态度的人。"},"examples":[{"en":"After a long week of meetings, I turn into a total antivert on weekends.","zh":"开了一周的会以后，我周末就会变成彻底的“antivert”（超级不社交的人）。"},{"en":"He joked that he’s an antivert because parties make him exhausted.","zh":"他开玩笑说自己是“antivert”，因为聚会会让他精疲力尽。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) Describing someone who avoids socializing or prefers being alone most of the time.","zh":"（非正式用语）形容某人很不爱社交，或大多数时候更喜欢独处。"},"examples":[{"en":"I’m feeling antivert today—can we text instead of calling?","zh":"我今天很“antivert”——我们发短信别打电话好吗？"},{"en":"She has an antivert vibe in big crowds, but she’s warm one-on-one.","zh":"她在人多的场合给人一种很“antivert”的感觉，但一对一时很温暖。"}]}],"synonyms":["introvert","asocial","recluse","solitary"],"phonetic":"/ˌæntiˈvɝt/","extraExplanation":["“antivert”不是标准词典里很常见的正式词，更像网络/口语里的自创词（neologism）。在正式写作中，通常用“introvert（内向的人）”“asocial（不爱社交的）”“reclusive（隐居式的）”等更自然。","很多人会把它和“ambivert（既内向也外向、介于两者之间的人）”混淆；“anti-”前缀有“反对/对立”的感觉，所以“antivert”听起来更像“反社交/强烈抗拒社交”，语气也更夸张。"]}
{"word":"antivibrating","summary":{"en":"Antivibrating means “made to reduce or prevent vibration.”","zh":"antivibrating 指“用于减少或防止振动的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed or used to reduce, absorb, or prevent vibration (for comfort, safety, or protecting equipment).","zh":"用于减少、吸收或防止振动的（以提高舒适度、安全性或保护设备）。"},"examples":[{"en":"The machine is mounted on antivibrating pads to protect the floor and reduce noise.","zh":"这台机器安装在防振垫上，以保护地面并降低噪音。"},{"en":"Antivibrating gloves can help reduce hand fatigue when using power tools.","zh":"防振手套在使用电动工具时能帮助减轻手部疲劳。"},{"en":"They installed antivibrating supports under the bridge components.","zh":"他们在桥梁部件下安装了防振支座。"}]}],"synonyms":["anti-vibration","vibration-damping","vibration-reducing","shock-absorbing"],"phonetic":"/ˌæn.tiˈvaɪ.breɪ.tɪŋ/","extraExplanation":["“anti-”表示“反/防”，vibrating 表示“振动的”，合起来常见于工程与工业语境：antivibrating pad（防振垫）、antivibrating mount（防振支架/减振安装件）、antivibrating gloves（防振手套）。在更正式的技术写作中也常用 vibration-damping（减振的）或 anti-vibration（防振的）来表达类似意思。"]}
{"word":"antivibrator","summary":{"en":"An antivibrator is something that reduces or prevents vibration, especially in machines.","zh":"antivibrator 指用于减少或防止振动的装置/部件，多用于机器或工程场景。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device, material, or part designed to reduce, absorb, or prevent vibration in a machine or structure (a vibration damper).","zh":"（机器或结构中的）减振装置；防振器；用于减少、吸收或防止振动的部件/材料。"},"examples":[{"en":"The engineer installed an antivibrator on the motor mount to cut down noise and shaking.","zh":"工程师在电机支架上安装了减振装置，以减少噪音和抖动。"},{"en":"Rubber pads can work as simple antivibrators under a washing machine.","zh":"橡胶垫可以作为简单的防振装置放在洗衣机下面。"}]}],"synonyms":["vibration damper","damper","shock absorber","anti-vibration mount","vibration isolator"],"phonetic":"/ˌæn.tiˈvaɪ.breɪ.tɚ/","extraExplanation":["“antivibrator”不是日常英语常用词，更常见的说法是“vibration damper / damper（减振器）”、“shock absorber（减震器）”或“anti-vibration mount（防振支座）”。","在工程语境中，它通常指通过橡胶、弹簧、阻尼材料或结构设计来降低共振与传递振动，从而减少噪声、磨损与疲劳破坏。"]}
{"word":"antivibratory","summary":{"en":"Antivibratory means “made to reduce or prevent vibration,” mainly used in technical contexts.","zh":"antivibratory 指“用于减少或防止振动的”，多用于工程技术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to reduce or prevent vibration (shaking), especially in machines, tools, or building structures.","zh":"用于减少或防止振动（抖动）的，尤指机器、工具或建筑结构中的减振/防振设计。"},"examples":[{"en":"The engineer added antivibratory mounts to keep the motor from shaking the frame.","zh":"工程师加装了防振支座，防止电机把机架震得发抖。"},{"en":"Antivibratory pads under the washing machine can make it much quieter.","zh":"在洗衣机下面垫上减振垫可以明显更安静。"}]}],"synonyms":["anti-vibration","vibration-damping","vibration-reducing","anti-vibrational"],"phonetic":"/ˌæn.tiˈvaɪ.brəˌtɔːr.i/","extraExplanation":["这是一个偏工程/技术领域的形容词：anti-（反、抑制）+ vibratory（振动的）。日常英语里更常见的说法是 anti-vibration 或 vibration-damping（减振的）。","常见搭配：antivibratory mount/support（减振支座）、antivibratory pad（减振垫）、antivibratory system/device（防振系统/装置）。"]}
{"word":"antivice","summary":{"en":"Antivice means opposing or fighting vice, especially illegal or immoral activities such as prostitution, gambling, or drug-related crime.","zh":"Antivice 指“反恶习/打击不良或违法活动的”，常用于打击卖淫、赌博、涉毒等行为的语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to vice (immoral or illegal behavior), especially efforts to prevent or control activities like prostitution, illegal gambling, or drug-related crime.","zh":"反对“恶习/不良风气”（不道德或违法行为）的；尤指打击或管制卖淫、非法赌博、涉毒等活动的。"},"examples":[{"en":"The city created an antivice task force to crack down on illegal gambling.","zh":"该市成立了反恶习（扫黄打非/打击非法活动）特别小组来打击非法赌博。"},{"en":"Antivice laws were used to regulate adult entertainment businesses.","zh":"反恶习法规被用来规范成人娱乐行业。"}]}],"synonyms":["anti-vice","vice-control","anti-prostitution (context-specific)","anti-gambling (context-specific)"],"phonetic":"/ˌæntiˈvaɪs/","extraExplanation":["“antivice”更常见的写法是带连字符的“anti-vice”，尤其在新闻与官方语境中（如：anti-vice unit/squad“扫黄打非/治安打击小队”）。","“vice”在这里不是“副职/夹具”的意思，而是“恶习、不良行为”，有时也泛指某些非法的“风化/治安类”行业。"]}
{"word":"antiviolence","summary":{"en":"“Antiviolence” describes people, policies, or actions that oppose violence and aim to prevent it.","zh":"“antiviolence”指反对暴力、致力于预防和减少暴力的个人、政策或行动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to violence; supporting nonviolent actions and solutions","zh":"反对暴力的；主张以非暴力方式解决问题的"},"examples":[{"en":"The organization runs antiviolence programs in local schools.","zh":"该组织在当地学校开展反暴力项目。"},{"en":"She joined an antiviolence march after the attack.","zh":"袭击事件后，她参加了一场反暴力游行。"},{"en":"The city launched an antiviolence campaign to reduce street fights.","zh":"该市发起反暴力运动以减少街头斗殴。"}]}],"synonyms":["anti-violence","nonviolent","violence-prevention","peace-oriented","pacifist"],"phonetic":"/ˌæn.tiˈvaɪ.ə.ləns/","extraExplanation":["“antiviolence”常用于社会议题与公共政策语境（如社区安全、校园霸凌、家庭暴力防治、枪支暴力等）。它强调“预防与减少暴力”，不一定等同于“完全反对使用武力”的哲学立场；若要表达更明确的“非暴力主义”，英语中也常用“nonviolent / pacifist”。","拼写上也常见连字符形式“anti-violence”（更常用），尤其在正式写作或标题中。"]}
{"word":"antiviral","summary":{"en":"“Antiviral” means a drug that treats viral infections or describes something that works against viruses.","zh":"“Antiviral”指抗病毒药物，或形容“能对抗病毒的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medicine (or substance) that prevents a virus from growing or helps treat a viral infection","zh":"抗病毒的药物（或物质）；用于抑制病毒复制或治疗病毒感染"},"examples":[{"en":"The doctor prescribed an antiviral to reduce the severity of the flu.","zh":"医生开了抗病毒药来减轻流感的严重程度。"},{"en":"Antiviral drugs work best when taken early in the illness.","zh":"抗病毒药在疾病早期服用效果最好。"}]},{"partOfSpeech":"adj.","definition":{"en":"able to stop or reduce the activity of viruses","zh":"抗病毒的；能抑制或降低病毒活性的"},"examples":[{"en":"Researchers are testing an antiviral treatment for COVID-19.","zh":"研究人员正在测试一种用于新冠的抗病毒治疗。"},{"en":"This cream has antiviral properties.","zh":"这种乳膏具有抗病毒特性。"}]}],"synonyms":["anti-viral drug","virus-fighting","virus-inhibiting"],"phonetic":"/ˌæn.taɪˈvaɪ.rəl/","extraExplanation":["词形拆解：anti-（反、抗）+ viral（病毒的）。所以 antiviral 字面意思就是“抗病毒的”。","易混淆点：antiviral（抗病毒）≠ antibiotic（抗生素，抗细菌）。感冒/流感等由病毒引起的疾病，抗生素通常无效；细菌感染才可能需要抗生素。"]}
{"word":"antiviral medication","summary":{"en":"Medicine used to treat viral infections.","zh":"用于治疗病毒感染的药物。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A drug used to treat viral infections by stopping a virus from multiplying or helping control its activity in the body.","zh":"用于治疗病毒感染的药物，通过抑制病毒复制或控制其在体内的活动来起效。"},"examples":[{"en":"The doctor prescribed antiviral medication to reduce the severity of the flu.","zh":"医生开了抗病毒药物来减轻流感的严重程度。"},{"en":"Antiviral medication works best when taken early in the infection.","zh":"抗病毒药物在感染早期服用效果最好。"},{"en":"Some people need antiviral medication to manage outbreaks of herpes.","zh":"有些人需要用抗病毒药物来控制疱疹的复发。"}]},{"partOfSpeech":"phrase","definition":{"en":"In everyday use, any medicine commonly described as “anti-virus,” including treatments for specific viruses such as influenza, HIV, hepatitis, or herpes.","zh":"日常用法中泛指被称为“抗病毒”的各类药物，包括用于流感、HIV、肝炎或疱疹等特定病毒的治疗药物。"},"examples":[{"en":"Not every cold needs antiviral medication because many colds get better on their own.","zh":"并不是每次感冒都需要抗病毒药物，因为很多感冒会自行好转。"},{"en":"HIV treatment usually includes antiviral medication taken daily.","zh":"HIV 的治疗通常包括每日服用的抗病毒药物。"}]}],"synonyms":["antiviral drug","antiviral medicine","antiviral therapy","virus-fighting medication"],"phonetic":"/ˌæn.taɪˈvaɪ.rəl ˌmɛd.ɪˈkeɪ.ʃən/","extraExplanation":["antiviral 通常指“抗病毒药”，不同于 antibiotic（抗生素），后者主要针对细菌而不是病毒。","很多抗病毒药对“尽早使用”更敏感，因为它们常通过抑制病毒复制来发挥作用；感染后期病毒复制减少时，效果可能下降（具体因疾病和药物而异）。"],"etymology":"由 anti-（“反、对抗”）+ viral（“病毒的”）+ medication（“药物/用药”）构成的现代医学表达，用于指“对抗病毒的用药”。","mnemonic":["记前缀 anti- = “反/抗”，viral = “病毒的”，合起来就是“抗病毒的”。","把 antiviral 想成“anti + virus（病毒）”，medication 就是“药”，合起来=“抗病毒药”。"]}
{"word":"antivirotic","summary":{"en":"Antivirotic means ‘antiviral’: working against viruses, especially in medicine.","zh":"antivirotic 意为“抗病毒的”（更常用 antivir​al），多用于医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine) acting against viruses; preventing a virus from growing or spreading in the body.","zh":"（医学）抗病毒的；抑制病毒生长或在体内传播的。"},"examples":[{"en":"The doctor prescribed an antivirotic drug to treat the infection.","zh":"医生开了抗病毒药来治疗感染。"},{"en":"Antivirotic treatment works best when started early.","zh":"尽早开始抗病毒治疗效果最好。"},{"en":"Researchers are testing new antivirotic medicines for respiratory viruses.","zh":"研究人员正在测试针对呼吸道病毒的新型抗病毒药物。"}]}],"synonyms":["antiviral","anti-viral"],"phonetic":"/ˌæn.taɪ.vaɪˈrɑː.tɪk/","extraExplanation":["“antivirotic”在现代英语里比较少见，更常用、更标准的说法是“antiviral”。在医疗与新闻报道中，你通常会看到“antiviral drugs / antiviral therapy”。","词形上由“anti-（反/抗）+ viral（病毒的）”构成；有时也会与“virucidal（杀灭病毒的）”混用，但两者不完全一样：antiviral/antivirotic偏“抑制病毒复制”，virucidal更强调“直接杀死/灭活病毒”。"]}
{"word":"antivirus","summary":{"en":"Antivirus is software (or a protective tool) that helps prevent, detect, and remove computer viruses and other malware.","zh":"Antivirus 指用于预防、检测并清除计算机病毒及其他恶意软件的“杀毒/防病毒”工具或软件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Software that detects, blocks, and removes computer viruses and other malicious programs (malware).","zh":"杀毒软件；用于检测、拦截并清除计算机病毒及其他恶意软件（malware）的程序。"},"examples":[{"en":"Make sure your antivirus is up to date before you download any files.","zh":"在下载任何文件之前，先确保你的杀毒软件是最新的。"},{"en":"The antivirus found malware and quarantined it.","zh":"杀毒软件发现了恶意软件，并将其隔离了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Serving to prevent or protect against computer viruses (used before a noun).","zh":"防病毒的；用于预防或防护计算机病毒的（作定语）。"},"examples":[{"en":"Your company may require antivirus protection on every laptop.","zh":"你的公司可能要求每台笔记本电脑都安装防病毒保护。"},{"en":"He installed an antivirus app on his phone.","zh":"他在手机上安装了一个防病毒应用。"}]}],"synonyms":["anti-malware","virus scanner","security software"],"phonetic":"/ˌæn.tiˈvaɪ.rəs/","extraExplanation":["在日常英语里，名词用法最常见：antivirus (software/program)。“病毒”并不只指 computer virus，也常泛指更广的“恶意软件”malware（如 trojan 木马、ransomware 勒索软件、spyware 间谍软件）。","常见搭配：antivirus software/program；install/uninstall antivirus；update antivirus definitions（更新病毒库）；real-time protection（实时防护）；scan (your computer/files)（扫描）；quarantine（隔离）；remove/clean（清除）。"]}
{"word":"antivirus program","summary":{"en":"software that protects a computer from viruses and other malware","zh":"用于防护并清除计算机病毒及其他恶意软件的软件"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Software designed to detect, block, and remove computer viruses and other malicious programs.","zh":"用于检测、阻止并清除计算机病毒及其他恶意程序的软件。"},"examples":[{"en":"Make sure your antivirus program is up to date before you download files.","zh":"在下载文件之前，确保你的杀毒软件已更新到最新。"},{"en":"The antivirus program found malware and quarantined it.","zh":"杀毒软件发现了恶意软件，并将其隔离。"}]},{"partOfSpeech":"phrase","definition":{"en":"A security tool that scans files, emails, and websites to prevent infections in real time.","zh":"一种会扫描文件、邮件和网站、并进行实时防护以防感染的安全工具。"},"examples":[{"en":"An antivirus program can scan your email attachments automatically.","zh":"杀毒软件可以自动扫描你的邮件附件。"},{"en":"Real-time protection helps stop threats before they run.","zh":"实时防护能在威胁运行之前将其拦截。"}]}],"synonyms":["antivirus software","antivirus","AV","security software","malware protection","virus scanner"],"phonetic":"/ˈæn.tiˌvaɪ.rəs ˈproʊ.ɡræm/","extraExplanation":["日常英语里更常说 antivirus software 或 antivirus (简写 AV)。","和 anti-malware / endpoint protection 有重叠：现代“杀毒”通常也防木马、勒索软件、间谍软件等，不只“virus”。"],"etymology":"“anti-”意为“反、对抗”， “virus”原指生物病毒，后借用于“计算机病毒”；“program”指计算机程序。合起来就是“对抗（计算机）病毒的程序”。","mnemonic":["anti- = 反；virus = 病毒：把它理解成“反病毒的程序”→杀毒软件。","把 AV 记成“Anti-Virus”的首字母缩写：装 AV = 装杀毒。"]}
{"word":"antivitalist","summary":{"en":"Antivitalist means opposing vitalism, or a person who rejects the idea of a special life force and explains life through physical and chemical processes.","zh":"Antivitalist 指反对生命力论（或指反生命力论者），认为生命现象可由物理与化学过程解释，而非源于特殊“生命力”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to vitalism (the idea that living things are governed by a special life force beyond physical and chemical processes).","zh":"反生命力论的；反对“生命力论”（认为生命现象由超出物理化学过程的特殊生命力支配的观点）。"},"examples":[{"en":"Many modern biologists take an antivitalist view of life, explaining it through chemistry and physics.","zh":"许多现代生物学家持反生命力论观点，用化学和物理来解释生命现象。"},{"en":"The paper argues for an antivitalist explanation of development.","zh":"这篇论文主张用反生命力论来解释发育过程。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who rejects vitalism and supports purely physical/chemical explanations of life.","zh":"反生命力论者；主张用物理/化学过程解释生命的人。"},"examples":[{"en":"As an antivitalist, he believed there was no mysterious life force in organisms.","zh":"作为反生命力论者，他认为生物体中不存在神秘的生命力。"}]}],"synonyms":["anti-vitalist","mechanistic","materialist (in biology/philosophy contexts)"],"phonetic":"/ˌæntiˈvaɪtəˌlɪst/","extraExplanation":["“Vitalism（生命力论）”在18—19世纪影响很大，常用来解释当时难以用实验化学说明的生命现象；随着有机化学与生物化学的发展（例如尿素的人工合成、代谢途径研究），主流科学逐渐转向机制论/物理化学解释，因此“antivitalist”多见于科学史、哲学与生物学方法论语境。","词形结构：anti-（反对）+ vitalism（生命力论）+ -ist（…主义者/…者）。在学术写作中常与“mechanistic（机制论的）”“materialist（唯物论的）”“naturalistic（自然主义的）”等概念一起出现，但它并不等同于“反生命/反生命价值”。"]}
{"word":"antivitalistic","summary":{"en":"Antivitalistic means rejecting vitalism and explaining life in terms of physical, chemical, and biological mechanisms rather than a special life force.","zh":"Antivitalistic 指反对生命力论，认为生命现象应以物理、化学与生物机制解释，而非依靠特殊“生命力”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to vitalism—the belief that living things have a special “life force” beyond physical and chemical processes.","zh":"反生命力论的；反对“生命力论”（认为生命体除了物理化学过程之外还有一种特殊“生命力”的观点）。"},"examples":[{"en":"The paper takes an antivitalistic approach, explaining metabolism using chemistry rather than a life force.","zh":"这篇论文采取反生命力论的立场，用化学而不是“生命力”来解释新陈代谢。"},{"en":"Many modern biologists hold an antivitalistic view of life.","zh":"许多现代生物学家对生命持反生命力论的看法。"}]},{"partOfSpeech":"adj.","definition":{"en":"More generally, skeptical of explanations that rely on mysterious inner energy or spiritual life-principles instead of scientific mechanisms.","zh":"（更广义）怀疑用神秘的内在能量或精神性的生命原则来解释现象，而倾向用科学机制来说明。"},"examples":[{"en":"Her antivitalistic attitude made her question claims about “healing energy” without evidence.","zh":"她的反生命力论态度让她对没有证据的“治愈能量”说法保持质疑。"}]}],"synonyms":["anti-vitalist","non-vitalistic","mechanistic (in biology/philosophy)","materialistic (in a scientific/philosophical sense)"],"phonetic":"/ˌæn.tiˌvaɪ.tlˈɪs.tɪk/","extraExplanation":["“vitalism（生命力论）”在18—19世纪影响较大，认为生命现象不能完全由物理与化学解释；随着生理学、生物化学与分子生物学发展，这种观点逐渐式微。“antivitalistic”常见于哲学、生物学史与科学思想史的语境中。","构词：anti-（反对）+ vitalistic（生命力论的）。该词较学术，日常英语中更常见的表达是“non-vitalistic（非生命力论的）”或直接说“rejects vitalism（反对生命力论）”。"]}
{"word":"antivitamin","summary":{"en":"An antivitamin is a substance that blocks or weakens the effect of a vitamin.","zh":"antivitamin 指“抗维生素”，即阻断或削弱维生素作用的物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A substance that reduces or blocks the normal action of a vitamin in the body (for example, by preventing its absorption or by interfering with how it works).","zh":"抗维生素；一种会降低或阻断维生素在体内正常作用的物质（例如阻碍吸收，或干扰其发挥功能）。"},"examples":[{"en":"Some compounds act as antivitamins, so they can increase the risk of vitamin deficiency.","zh":"有些化合物具有抗维生素作用，因此可能增加维生素缺乏的风险。"},{"en":"Researchers studied an antivitamin to understand how vitamin B6 works in cells.","zh":"研究人员通过研究一种抗维生素来了解维生素B6在细胞中如何发挥作用。"}]}],"synonyms":["vitamin antagonist"],"phonetic":"/ˌæn.tiˈvaɪ.tə.mɪn/","extraExplanation":["“抗维生素”常见于营养学、生物化学和药理学语境，不是日常英语高频词。","它可能来自天然食物成分、某些药物或实验用化学物质；并不等同于“有毒”，但可能在特定条件下导致相应维生素缺乏。","常见相关表达：antivitamin activity（抗维生素活性）、antivitamin effect（抗维生素效应）。"]}
{"word":"antivivisection","summary":{"en":"Antivivisection is the opposition to experiments on living animals.","zh":"Antivivisection 指反对在活体动物身上进行实验（活体解剖）的立场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to vivisection (experiments on living animals), especially when it is seen as cruel or unethical.","zh":"反对活体解剖（在活体动物身上做实验）的立场，尤指认为其残忍或不道德时。"},"examples":[{"en":"Antivivisection groups campaign for alternatives to animal testing.","zh":"反活体解剖团体倡导用替代方法取代动物实验。"},{"en":"The debate over antivivisection often focuses on balancing medical progress and animal welfare.","zh":"关于反活体解剖的争论常聚焦在医学进步与动物福祉之间的平衡。"}]}],"synonyms":["opposition to vivisection","anti–animal testing (in some contexts)"],"phonetic":"/ˌæn.tiˌvɪv.ɪˈsɛk.ʃən/","extraExplanation":["“antivivisection”由 anti-（反对）+ vivisection（活体解剖）构成。vivisection 来自拉丁语：vivi-（活的）+ sectio（切割）。","该词常见于动物权益与医学伦理讨论中，尤其与“animal testing（动物实验）”“cruelty-free（无虐待/不伤害动物）”等话题相关。"]}
{"word":"antivivisectionism","summary":{"en":"Antivivisectionism is the belief or movement that opposes experiments on live animals (vivisection), mainly for ethical reasons.","zh":"Antivivisectionism 指反对在活体动物身上进行实验（活体解剖/活体实验）的立场或运动，主要出于伦理原因。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to vivisection (performing scientific experiments on live animals), especially on ethical grounds.","zh":"反对活体解剖（在活体动物身上进行科学实验），尤指出于伦理原因。"},"examples":[{"en":"Antivivisectionism grew alongside early animal welfare movements.","zh":"反活体解剖主义与早期动物福利运动一同发展起来。"},{"en":"Her antivivisectionism led her to campaign for stricter rules on animal experiments.","zh":"她的反活体解剖立场促使她呼吁对动物实验制定更严格的规定。"}]}],"synonyms":["anti-vivisection","opposition to vivisection","anti-animal-testing activism"],"phonetic":"/ˌæn.tiˌvɪv.ɪˈsɛk.ʃənˌɪz.əm/","extraExplanation":["这个词很长，但结构很清晰：anti-（反对）+ vivisection（活体解剖/活体实验）+ -ism（主义/思想/立场）。因此它通常指一种“主张或社会运动”，而不仅仅是个人的一次反对。","历史上，19世纪英国等地的反活体解剖运动与动物保护、公共道德辩论以及医学研究的发展密切相关。相关争议常涉及：动物痛苦、科学收益、替代方法（如体外实验、计算机模拟）与监管制度。","在写作中，这个词语气偏正式、学术或社会议题讨论中常见；日常口语里更常说 anti-vivisection (movement) 或 against animal testing（反对动物实验）。"]}
{"word":"antivivisectionist","summary":{"en":"An antivivisectionist is someone who opposes experiments on living animals.","zh":"antivivisectionist 指反对在活体动物身上做实验（活体解剖/活体实验）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposes vivisection (performing experiments on living animals), often for ethical reasons","zh":"反对活体解剖（在活体动物身上做实验）的人，通常出于伦理原因"},"examples":[{"en":"She is an antivivisectionist who campaigns against animal testing in laboratories.","zh":"她是一名反对活体解剖的人，致力于反对实验室里的动物实验。"},{"en":"In the debate, antivivisectionists argued that scientific progress should not require animal suffering.","zh":"在辩论中，反对活体解剖的人认为，科学进步不应以动物痛苦为代价。"}]}],"synonyms":["opponent of vivisection","anti–animal-testing activist","animal rights advocate (in this context)"],"phonetic":"/ˌæn.tiˌvɪv.ɪˈsɛk.ʃə.nɪst/","extraExplanation":["“antivivisectionist”由 anti-（反对）+ vivisection（活体解剖/活体实验）+ -ist（……主义者/……者）组成，常见于伦理学、动物权利与医学研究相关讨论中。","历史上，19世纪英国等地出现过反对活体实验的社会运动；现代语境中也常与“animal testing（动物实验）”“animal welfare（动物福利）”等话题一起出现。","用法上带有立场色彩（表明反对态度），在正式写作或辩论中较常见；日常口语里更常用“opponent of animal testing（反对动物实验的人）”。"]}
{"word":"antivivisectionists","summary":{"en":"Antivivisectionists are people who oppose vivisection and often campaign against painful or invasive experiments on living animals.","zh":"antivivisectionists 指反对活体解剖/活体实验的人，常主张限制或停止对活体动物进行痛苦或侵入性实验。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who oppose vivisection (doing experiments on living animals, especially when it involves surgery or causes suffering)","zh":"反对活体解剖（在活体动物身上做实验，尤指手术或造成痛苦）的人"},"examples":[{"en":"In the late 1800s, antivivisectionists organized public campaigns against animal experimentation.","zh":"在19世纪末，反对活体解剖的人组织了公众运动来反对动物实验。"},{"en":"Some antivivisectionists argue that medical research should use non-animal alternatives whenever possible.","zh":"一些反对活体解剖的人认为，医学研究应尽可能使用非动物替代方法。"}]}],"synonyms":["animal-rights activists (sometimes)","opponents of animal experimentation","anti-vivisection advocates"],"phonetic":"/ˌæn.tiˌvɪv.əˈsɛk.ʃən.ɪsts/","extraExplanation":["“antivivisectionists”是复数形式，单数是“antivivisectionist”。","词源结构：anti-（反对）+ vivisection（活体解剖/活体实验）。该词常出现在关于动物权利、科研伦理与法规监管的讨论中。","历史上英国等地在19世纪出现反活体解剖运动，推动了对动物实验的限制与监管（例如更严格的许可制度）。"]}
{"word":"antivolition","summary":{"en":"Antivolition means a severe lack of will or motivation to start and complete goal-directed actions, often in clinical contexts.","zh":"Antivolition 指严重的意志/动机缺乏，难以启动并完成有目标的行为，多用于临床语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong lack of motivation or inability to start and carry out purposeful actions, even when someone understands what they should do (often used in clinical psychology/psychiatry).","zh":"（常用于心理学/精神病学）意志力或动机显著缺乏，难以启动并完成有目标的行动，即使明白自己“应该做什么”。"},"examples":[{"en":"In the clinical notes, the doctor mentioned antivolition as a reason he couldn’t follow through on daily tasks.","zh":"在临床记录中，医生提到“意志缺乏（antivolition）”是他无法完成日常事务的原因之一。"},{"en":"Antivolition is not the same as laziness; it can be part of a mental health condition.","zh":"意志缺乏并不等同于懒惰；它可能是某些心理健康问题的一部分。"},{"en":"With support and structure, some people learn strategies to manage antivolition in everyday life.","zh":"在支持与结构化安排下，有些人能学会策略来应对日常生活中的意志缺乏。"}]}],"synonyms":["avolition","lack of motivation","reduced drive","apathy"],"phonetic":"/ˌæn.tiˌvoʊˈlɪʃ.ən/","extraExplanation":["“antivolition”由“anti-（反、对）”+“volition（意志、意愿）”构成，意思是“与意志相对/缺乏意志”。","它常出现在精神科或临床心理学语境，尤其与“意志减退/动机缺乏（avolition）”相关；日常英语里非常少见。更常见的表达包括：lack of motivation / difficulty initiating tasks / reduced drive。"]}
{"word":"antivorous","summary":{"en":"Antivorous means “ant-eating; feeding mainly on ants.”","zh":"antivorous 指“食蚁的；以蚂蚁为主食的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of an animal) feeding mainly on ants.","zh":"（动物）以蚂蚁为主食的；食蚁的。"},"examples":[{"en":"The anteater is an antivorous mammal that uses its long tongue to catch ants.","zh":"食蚁兽是一种食蚁的哺乳动物，会用长舌头捕捉蚂蚁。"},{"en":"In dry seasons, some birds become more antivorous when other insects are scarce.","zh":"在旱季，当其他昆虫变少时，一些鸟会更偏向以蚂蚁为主食。"}]}],"synonyms":["myrmecophagous","ant-eating","insectivorous"],"phonetic":"ænˈtɪvərəs","extraExplanation":["“antivorous”比较少见，学习和写作中更常用的词是“myrmecophagous”（更正式/学术）或“ant-eating”（更口语）。","词形上由 ant（蚂蚁）+ -vorous（“吃……的”，同根于 Latin *vorare* “吞食”）构成，和 carnivorous（食肉的）、herbivorous（食草的）同一构词模式。"]}

