{"word":"antidactyl","summary":{"en":"Antidactyl means “having backward-pointing toes,” a rare zoological adjective.","zh":"antidactyl 指“脚趾朝后（反趾）”，是较少见的动物学形容词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Zoology, rare) Having one or more toes (digits) directed backward; reversed-toed.","zh":"（动物学，较少用）脚趾（趾骨）有一根或多根朝后；“反趾”的。"},"examples":[{"en":"Some birds have antidactyl feet that help them grip branches.","zh":"有些鸟类有“反趾”的脚型，能更好地抓握树枝。"},{"en":"The researcher noted an antidactyl toe arrangement in the specimen.","zh":"研究者记录到该标本具有反向脚趾的排列方式。"}]}],"synonyms":["reversed-toed","backward-toed","(related) zygodactyl"],"phonetic":"/ˌæn.tiˈdæk.təl/","extraExplanation":["词源上可拆为 anti-（反、对）+ dactyl（手指/脚趾），因此字面意思是“反向的趾”。该词很少在日常英语中出现，多见于鸟类等动物足部结构的描述。不同资料对它与其他更常见术语（如 zygodactyl/异趾型等）的对应关系可能有差异；写作时若需精确分类，建议同时给出更常用的足趾类型术语。"]}
{"word":"antidancing","summary":{"en":"Antidancing means opposed to dancing; more commonly written as anti-dancing.","zh":"antidancing 表示“反对跳舞的”；更常见写法是 anti-dancing。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to dancing; against dancing (often for moral, religious, or cultural reasons).","zh":"反对跳舞的；不赞成跳舞的（常因道德、宗教或文化原因）。"},"examples":[{"en":"Some communities had anti-dancing rules at school events.","zh":"有些社区在学校活动中有反对跳舞的规定。"},{"en":"Her grandparents were anti-dancing, so parties at home were quiet and formal.","zh":"她的祖父母反对跳舞，所以家里的聚会比较安静、正式。"}]}],"synonyms":["anti-dancing","against dancing","anti-dance"],"phonetic":"/ˌæntiˈdænsɪŋ/","extraExplanation":["“antidancing”更常见的写法是“anti-dancing”（带连字符），表示“反对某种活动”的“anti- + 动名词”结构，例如 anti-smoking（反吸烟）、anti-gambling（反赌博）。","在历史与文化语境中，“anti-dancing”有时会出现在关于舞厅管制、学校舞会禁令、或某些宗教团体的讨论里。具体含义通常要结合语境：是反对“社交舞”、反对“某类舞蹈”，还是反对“在某场合跳舞”。"]}
{"word":"antidandruff","summary":{"en":"“Anti-dandruff” describes products that help prevent or reduce dandruff.","zh":"“anti-dandruff”表示“防头屑/去屑的”，常用来形容洗发水等产品。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"made to prevent or reduce dandruff (small white flakes of dead skin from the scalp)","zh":"防头屑的；去屑的（用于减少或预防头皮屑）"},"examples":[{"en":"I bought an anti-dandruff shampoo because my scalp gets flaky in winter.","zh":"我买了去屑洗发水，因为冬天我的头皮容易起屑。"},{"en":"Use an anti-dandruff product twice a week if you have mild dandruff.","zh":"如果你只有轻微头屑，可以每周用两次去屑产品。"}]}],"synonyms":["anti-flake","dandruff-fighting","anti-dandruff (shampoo/treatment)"],"phonetic":"/ˌæn.taɪˈdæn.drəf/","extraExplanation":["“anti-dandruff”常作定语，放在名词前：anti-dandruff shampoo/conditioner/treatment。也常写成 anti dandruff（少连字符）或 antidandruff（更少见），在产品包装上可能出现不同拼写。","dandruff 指“头皮屑”，是头皮表层皮肤细胞脱落形成的细小白色皮屑；不是头发本身的问题。"]}
{"word":"antidecalogue","summary":{"en":"Antidecalogue means an opposing or alternative “ten commandments,” often used humorously or critically toward traditional morality.","zh":"Antidecalogue 指“反十诫/替代十诫”的一套准则，常用于幽默或批判传统道德的语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a set of principles or “commandments” meant to oppose, challenge, or replace the Ten Commandments (the Decalogue).","zh":"（反十诫）用来反对、挑战或取代《十诫》（Decalogue）的另一套“戒律/准则”。"},"examples":[{"en":"The writer jokingly called his list of rules for rebels an antidecalogue.","zh":"作者开玩笑地把他那份“叛逆者守则”称为一份 antidecalogue（反十诫）。"},{"en":"In the essay, the antidecalogue is used to criticize traditional morality.","zh":"在这篇文章里，antidecalogue 被用来批评传统道德观。"}]}],"synonyms":["counter-commandments","anti-commandments","opposing code","satirical commandments"],"phonetic":"/ˌæn.tiˈdɛk.ə.lɔɡ/","extraExplanation":["这个词非常少见，多见于讽刺、文学或哲学语境。构词上由 anti-（反对）+ decalogue（十诫）组成；decalogue 源自希腊语 deka（十）+ logos（言语/训诫）。","使用时要注意语气：它常带有戏谑、挑衅或批判意味，并不一定指一套正式、被广泛接受的“反宗教”教义。"]}
{"word":"antideflation","summary":{"en":"Antideflation means policies or actions used to fight deflation and stop prices from falling overall.","zh":"Antideflation 指用于对抗通货紧缩、阻止整体物价下跌的政策或行动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Economics) Measures or policies intended to prevent or reverse deflation (a general fall in prices), often by increasing demand or the money supply.","zh":"（经济学）反通货紧缩：为防止或扭转通货紧缩（整体物价下跌）而采取的措施或政策，常通过刺激需求或增加货币供给来实现。"},"examples":[{"en":"The central bank introduced antideflation policies by lowering interest rates and buying government bonds.","zh":"央行通过降息并购买政府债券来推出反通缩政策。"},{"en":"Some economists argue that antideflation measures should be used early, before prices keep falling.","zh":"一些经济学家认为，反通缩措施应尽早使用，以免物价持续下跌。"}]}],"synonyms":["anti-deflation measures","deflation-fighting policy","reflation policy","stimulus"],"phonetic":"/ˌæntiˌdiːˈfleɪʃən/","extraExplanation":["“antideflation”在日常英语里不算常见，更常见的说法是“anti-deflation measures/policies（反通缩措施/政策）”或直接说“measures to fight deflation（对抗通缩的措施）”。","反通缩政策常见工具包括：降息、量化宽松（QE，购买债券以注入流动性）、财政刺激（增加政府支出/减税）等。具体选择取决于经济是否陷入“流动性陷阱”、通胀预期是否偏低等。","注意区分“disinflation（通胀放缓）”与“deflation（通缩）”：前者是物价仍在上涨但涨得更慢；后者是物价整体下降。反通缩针对的是后者。"]}
{"word":"antidegradation","summary":{"en":"Antidegradation is an environmental policy that prevents existing water quality from being degraded by new or increased pollution.","zh":"Antidegradation 指一种环境政策，旨在防止因新增或增加的污染而导致现有水质退化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Environmental law) a policy or requirement that prevents water quality (or another environmental quality) from getting worse, especially by limiting new or increased pollution.","zh":"（环境法）反退化（政策/要求）：防止水质（或其他环境质量）变差，尤其通过限制新增或增加的污染来维持或提升现有环境质量。"},"examples":[{"en":"The permit must comply with the state’s antidegradation policy to protect high-quality streams.","zh":"该许可必须符合州的反退化政策，以保护高水质溪流。"},{"en":"Antidegradation reviews are required when a project could increase pollutant loads.","zh":"当项目可能增加污染物排放负荷时，需要进行反退化审查。"},{"en":"The company proposed additional treatment so the discharge would not violate antidegradation standards.","zh":"公司提出增加处理措施，以确保排放不违反反退化标准。"}]}],"synonyms":["non-degradation policy","water quality protection policy","anti-pollution safeguard"],"phonetic":"/ˌæntiˌdɛɡrəˈdeɪʃən/","extraExplanation":["“Antidegradation”常见于美国《清洁水法》（Clean Water Act）相关水质管理中：其核心思想不是只达到最低标准，而是要保护已经“很干净/高质量”的水体，避免因新开发或扩建排放而退步。","在实践中，它常通过“反退化审查”（antidegradation review）体现：评估新增污染是否必要、是否有更少污染的替代方案，以及是否需要更严格的处理与监测。"]}
{"word":"antidemocracies","summary":{"en":"“Antidemocracies” means multiple systems or movements that oppose or undermine democracy.","zh":"“antidemocracies”指多个反对或削弱民主的体制/政权/运动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of antidemocracy: political systems, governments, or movements that oppose democracy or work to weaken democratic rights and institutions.","zh":"antidemocracy 的复数：反对民主、或致力于削弱民主权利与制度的政治体制、政府或运动。"},"examples":[{"en":"Several antidemocracies in the region restrict free elections and independent courts.","zh":"该地区的几个反民主政体限制自由选举和独立司法。"},{"en":"The report warns that antidemocracies often silence journalists and opposition parties.","zh":"报告警告说，反民主势力常常打压记者和反对党。"}]}],"synonyms":["anti-democratic regimes","authoritarian regimes","dictatorships","autocracies"],"phonetic":"/ˌæn.ti.dɪˈmɑː.krə.siz/","extraExplanation":["“anti-”表示“反对/抵制”，加在“democracy（民主）”前形成“antidemocracy（反民主）”。“antidemocracies”是其复数形式，多用于政治评论或学术写作中，指多个反民主政体/势力。","日常表达里更常见的说法是“authoritarian regimes（威权政权）”或“anti-democratic regimes（反民主政权）”。"]}
{"word":"antidemocracy","summary":{"en":"Antidemocracy means opposing democracy or democratic principles; it can also refer to an anti-democratic belief or movement.","zh":"Antidemocracy 指反对民主或民主原则；也可指反民主的信念或运动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to democracy or to democratic principles (such as free elections, equal political rights, and government accountability).","zh":"反对民主或民主原则（如自由选举、平等政治权利、政府问责）。"},"examples":[{"en":"Some critics called the new voting restrictions antidemocracy.","zh":"一些批评者称新的投票限制是反民主的。"},{"en":"An antidemocracy ideology often favors strong centralized control over public participation.","zh":"反民主的意识形态往往更偏好强力的中央控制，而不是公众参与。"}]},{"partOfSpeech":"n.","definition":{"en":"A belief, policy, or movement that opposes democracy.","zh":"反对民主的信念、政策或运动。"},"examples":[{"en":"The group’s antidemocracy grew after the economic crisis.","zh":"经济危机后，该团体的反民主倾向加剧。"},{"en":"The article warns about the rise of antidemocracy in public discourse.","zh":"这篇文章警告公共讨论中反民主思潮的上升。"}]}],"synonyms":["anti-democratic","undemocratic","authoritarian","anti-popular rule"],"phonetic":"/ˌæn.ti.dɪˈmɑː.krə.si/","extraExplanation":["这个词常见于政治评论与学术写作中，多用于批评性语境。也常写作“anti-democracy”（加连字符），尤其在作形容词修饰名词时（如 anti-democracy measures）。","词义上要与“authoritarian（威权的）/ autocratic（独裁的）/ illiberal（非自由主义的）”区分：它们可能相关，但“antidemocracy”强调“反对民主程序与原则”这一点。"]}
{"word":"antidemocrat","summary":{"en":"Antidemocrat usually means someone (or something) opposed to democracy; it can also (less commonly) mean opposed to the U.S. Democratic Party.","zh":"antidemocrat通常指反对民主制度/民主原则的人（或反民主的）；较少情况下也可指反对美国民主党的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who opposes democracy or democratic principles.","zh":"反对民主制度或民主原则的人。"},"examples":[{"en":"Some activists criticized the proposal as the work of antidemocrats.","zh":"一些行动者批评这项提案是反民主者推动的。"},{"en":"He argued that censoring the press is antidemocrat behavior.","zh":"他认为审查新闻是反民主的行为。"}]},{"partOfSpeech":"n.","definition":{"en":"A person opposed to the Democratic Party (U.S. politics), though this use is less common and can be unclear.","zh":"（美国政治语境中）反对民主党的人；但这种用法较少见，也可能引起歧义。"},"examples":[{"en":"In the article, “antidemocrat” seemed to mean someone who was strongly against the Democratic Party.","zh":"在那篇文章里，“antidemocrat”似乎指强烈反对民主党的人。"},{"en":"To avoid confusion, the writer used “anti–Democratic Party” instead.","zh":"为避免混淆，作者改用“反对民主党（anti–Democratic Party）”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Opposed to democracy; anti-democratic (less common than “anti-democratic”).","zh":"反民主的；反对民主的（不如“anti-democratic”常用）。"},"examples":[{"en":"They warned that the new rules were antidemocrat.","zh":"他们警告说新规是反民主的。"},{"en":"Many editors prefer “anti-democratic” in formal writing.","zh":"在正式写作中，许多编辑更偏好用“anti-democratic”。"}]}],"synonyms":["anti-democratic","undemocratic","opponent of democracy","anti–Democratic Party"],"phonetic":"/ˌæn.tiˈdɛm.əˌkræt/","extraExplanation":["“antidemocrat”在英语中不如“anti-democratic（反民主的）”常见；如果你是在写文章或论文，通常用“anti-democratic laws/policies（反民主的法律/政策）”会更自然、更清晰。","拼写上常见有连字符的形式“anti-democrat”，尤其当强调“反对民主制度/民主派”时；是否大写也会影响含义：Democrat（大写）多指美国民主党成员，democrat（小写）更偏向“民主主义者/支持民主的人”。","这是政治评价色彩很强的词，使用时最好配合具体行为或政策来说明理由（例如：censor the press, restrict voting rights），避免变成单纯的标签化指责。"]}
{"word":"antidemocratic","summary":{"en":"“Antidemocratic” means opposing democracy or democratic systems and values.","zh":"antidemocratic 指“反民主的”，即反对民主制度或民主价值观。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to democracy or to democratic ideas, processes, and institutions.","zh":"反民主的；反对民主或民主制度、民主理念与民主程序的。"},"examples":[{"en":"Some critics called the new law antidemocratic because it reduced voting access.","zh":"一些批评者称这项新法律是反民主的，因为它减少了投票机会。"},{"en":"Concentrating too much power in one leader can be seen as antidemocratic.","zh":"把过多权力集中在一个领导人手中可能被视为反民主的。"}]}],"synonyms":["undemocratic","authoritarian","anti-democratic"],"phonetic":"/ˌæn.taɪˌdɛm.əˈkræt.ɪk/","extraExplanation":["词形拆解：anti- 表示“反对”，democratic 表示“民主的”。合起来就是“反民主的”。","语气与使用场景：antidemocratic 常用于政治评论或新闻写作，语气偏批评。用于描述制度、政策、行为或态度（如 antidemocratic measures / practices / policies）。","近义表达（语气相近或更强）：undemocratic（不民主的，较常用、较中性），authoritarian（威权的），anti-democratic（也常写作带连字符的形式）。"]}
{"word":"antidemocratical","summary":{"en":"Antidemocratical means “anti-democratic”: against democracy or not following democratic principles.","zh":"antidemocratical 意为“反民主的 / 不民主的”：反对民主或不符合民主原则。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to democracy or democratic values; supporting rule by a small group or limiting people’s political rights.","zh":"反民主的；反对民主或民主价值观的；支持少数人统治或限制人民政治权利的。"},"examples":[{"en":"Many critics said the new law was antidemocratical because it reduced press freedom.","zh":"许多批评者说这项新法律是反民主的，因为它削弱了新闻自由。"},{"en":"He called the decision antidemocratical since citizens were not allowed to vote on it.","zh":"他称这个决定是反民主的，因为公民不被允许就此投票。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not done in a democratic way (for example, not fair, not transparent, or not decided by voting).","zh":"不民主的（例如不公平、不透明，或不是通过投票等民主方式决定的）。"},"examples":[{"en":"The process felt antidemocratical, with meetings closed to the public.","zh":"这个流程让人感觉不民主，因为会议不向公众开放。"},{"en":"They argued that the rules were antidemocratical and needed reform.","zh":"他们认为这些规则不民主，需要改革。"}]}],"synonyms":["anti-democratic","antidemocratic","undemocratic","authoritarian"],"phonetic":"/ˌæntaɪˌdɛməˈkrætɪk/","extraExplanation":["“antidemocratical”在现代英语中较少见，更常用的是“anti-democratic”（常加连字符）或“antidemocratic”（不加连字符）。写作时用更常见的形式会更自然、更符合新闻与学术文体。"]}
{"word":"antidemocratically","summary":{"en":"“Antidemocratically” means “in a way that is against democracy or democratic procedures.”","zh":"“antidemocratically”意为“以反民主、违背民主程序的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that goes against democratic principles or processes (for example, limiting fair voting, representation, or public participation).","zh":"以反民主的方式；违背民主原则或程序（例如限制公平选举、代表性或公众参与）。"},"examples":[{"en":"The law was passed antidemocratically, without a public debate or a fair vote.","zh":"这项法律以反民主的方式通过，没有公开辩论或公平表决。"},{"en":"Critics say the leader acted antidemocratically by silencing opposing voices.","zh":"批评者说这位领导人通过压制反对声音来反民主地行事。"}]}],"synonyms":["undemocratically","authoritarianly","illegitimately","arbitrarily"],"phonetic":"/ˌæn.taɪˌdɛm.əˈkræt.ɪ.kli/","extraExplanation":["“anti-”是前缀，意思是“反对/对抗”；“democratic”指“民主的”；“-ly”把形容词变成副词，表示“以……的方式”。所以 antidemocratically 字面上就是“以反民主的方式”。","在新闻与政治语境中很常见，常用于批评某种做法缺乏透明度、程序正义或民意授权（如绕过议会、操控选举、打压媒体等）。"]}
{"word":"antidemoniac","summary":{"en":"Antidemoniac refers to someone (or a viewpoint) that rejects the idea of demonic possession.","zh":"antidemoniac 指否认或反对“恶魔附身”观念的人（或这种立场）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who denies or argues against the idea of demonic possession (being a “demoniac”).","zh":"反对或否认“被恶魔附身/鬼附”（demoniac）观念的人。"},"examples":[{"en":"In the debate, the antidemoniac insisted the patient needed medical care, not an exorcism.","zh":"在辩论中，这位反附魔论者坚持病人需要医疗照护，而不是驱魔。"},{"en":"Some antidemoniacs read the Gospel stories as metaphors for illness rather than literal possession.","zh":"一些反附魔论者把福音书中的相关故事解读为疾病的隐喻，而不是字面意义上的附身。"}]},{"partOfSpeech":"adj.","definition":{"en":"opposed to, or rejecting, the belief in demonic possession.","zh":"反对或否认恶魔附身观念的；反附魔论的。"},"examples":[{"en":"Her antidemoniac approach favored psychological explanations for strange behavior.","zh":"她的反附魔论立场更倾向用心理学来解释怪异行为。"},{"en":"The article took an antidemoniac stance toward reports of possession.","zh":"这篇文章对“附身”报道采取了反附魔论立场。"}]}],"synonyms":["skeptic of demonic possession","anti-possession (rare)","rationalist (context-dependent)"],"phonetic":"/ˌæn.ti.diˈmoʊ.ni.æk/","extraExplanation":["这个词非常少见，多出现在宗教史/神学争论语境中，用来指反对“确有恶魔附身”这种解释的人或立场。构词上是 anti-（反对）+ demoniac（被认为被恶魔附身的人）。","在英语写作里，更常见、更易懂的表达是：“someone who denies demonic possession（否认附身的人）”或“skeptic of demonic possession（对附身持怀疑态度的人）”。"]}
{"word":"antidepressant","summary":{"en":"An antidepressant is a medication (or something with a mood-lifting effect) used to treat depression.","zh":"antidepressant 指抗抑郁药（也可作形容词，表示“抗抑郁的/改善情绪的”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medicine used to treat depression (and sometimes anxiety or other mood-related conditions)","zh":"抗抑郁药：用于治疗抑郁症（有时也用于焦虑或其他情绪相关问题）的药物"},"examples":[{"en":"My doctor prescribed an antidepressant to help with my depression.","zh":"医生给我开了抗抑郁药来帮助缓解抑郁症状。"},{"en":"It can take a few weeks for an antidepressant to start working.","zh":"抗抑郁药可能需要几周时间才会开始起效。"},{"en":"Never stop an antidepressant suddenly without medical advice.","zh":"不要在没有医生建议的情况下突然停用抗抑郁药。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to reducing depression; helping to improve mood","zh":"抗抑郁的；有助于减轻抑郁、改善情绪的"},"examples":[{"en":"Regular exercise can have an antidepressant effect for some people.","zh":"规律运动对一些人可能有抗抑郁的效果。"},{"en":"Light therapy is sometimes used for its antidepressant benefits in winter.","zh":"光照疗法有时在冬季因其抗抑郁益处而被使用。"}]}],"synonyms":["depression medication","antidepressive","mood-lifting"],"phonetic":"/ˌæn.ti.dɪˈprɛs.ənt/","extraExplanation":["“Antidepressant”最常指药物类别（如 SSRIs、SNRIs 等）。它们并不等同于“让人立刻开心的药”，通常需要时间起效，且可能有副作用；用药与停药应在专业医护指导下进行。","词源上由 anti-（反、抗）+ depress（使低落/压抑）+ -ant（…的/…物）组成，字面意思是“对抗抑郁的（东西）”。"]}
{"word":"antidepressants","summary":{"en":"Antidepressants are medicines used to treat depression (and sometimes anxiety) by influencing brain chemistry related to mood.","zh":"抗抑郁药是用于治疗抑郁症（有时也用于焦虑等）的药物，通过影响与情绪有关的大脑化学物质发挥作用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Medicines used to treat depression and some related conditions (such as anxiety), usually by affecting brain chemicals involved in mood.","zh":"抗抑郁药：用于治疗抑郁症及一些相关问题（如焦虑）的药物，通常通过影响与情绪有关的大脑化学物质来起作用。"},"examples":[{"en":"Her doctor prescribed antidepressants to help manage her depression.","zh":"医生给她开了抗抑郁药来帮助控制抑郁症状。"},{"en":"Antidepressants can take a few weeks to start working.","zh":"抗抑郁药可能需要几周时间才开始显效。"},{"en":"Some people experience side effects when they first begin antidepressants.","zh":"有些人在刚开始服用抗抑郁药时会出现副作用。"}]}],"synonyms":["antidepressant drugs","antidepressant medication"],"phonetic":"/ˌæn.ti.dɪˈprɛs.ənts/","extraExplanation":["“antidepressant”是单数，“antidepressants”是复数。也可以作形容词用：antidepressant medication（抗抑郁药物）、an antidepressant effect（抗抑郁作用）。","常见类别包括SSRI、SNRI、三环类等；不同类型适应症与副作用不同，用药与停药通常需要在医生指导下进行，避免自行突然停药。"]}
{"word":"antidepression","summary":{"en":"“Antidepression” means anti-depression—intended to prevent or reduce depression or low mood; it’s less common than “antidepressant.”","zh":"“antidepression”指“抗抑郁的/抗抑郁的方式”，但在英语中不如“antidepressant（抗抑郁药/抗抑郁的）”常用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Intended to prevent or reduce depression (low mood) or clinical depression.","zh":"用于预防或减轻抑郁（情绪低落）或临床抑郁症的；抗抑郁的。"},"examples":[{"en":"The doctor discussed antidepression treatment options, including therapy and medication.","zh":"医生讨论了抗抑郁的治疗选择，包括心理治疗和药物。"},{"en":"Some people use light therapy as an antidepression method during winter.","zh":"有些人在冬季用光照疗法作为抗抑郁的方法。"}]},{"partOfSpeech":"n.","definition":{"en":"A product, action, or approach that aims to fight depression or low mood.","zh":"旨在对抗抑郁或情绪低落的产品、做法或方法。"},"examples":[{"en":"Regular exercise is often recommended as an antidepression strategy.","zh":"规律运动常被推荐作为抗抑郁的策略。"},{"en":"She built a daily routine as her personal antidepression.","zh":"她建立了日常作息作为自己的“抗抑郁方法”。"}]}],"synonyms":["antidepressant (more common)","mood-lifting","anti-depressive","uplifting"],"phonetic":"/ˌæn.ti.dɪˈprɛʃ.ən/","extraExplanation":["“antidepression”在日常英语中不如“antidepressant（抗抑郁药/抗抑郁的）”常见；在医学语境里，指药物时更标准的说法通常是“an antidepressant”或“antidepressant medication”。","构词上，anti- 表示“反/抗”，depression 表示“抑郁；压抑；（经济）萧条”。因此它字面意思就是“抗抑郁”。在广告或非正式表达中可能会见到带连字符的写法“anti-depression”。"]}
{"word":"antidepressive","summary":{"en":"Antidepressive means an antidepressant drug, or something that reduces depression.","zh":"antidepressive 指“抗抑郁药”，也可作形容词表示“抗抑郁的/减轻抑郁的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medicine used to treat depression by improving mood and related symptoms.","zh":"抗抑郁药；用于治疗抑郁症、改善情绪及相关症状的药物。"},"examples":[{"en":"The doctor prescribed an antidepressive to help manage her depression.","zh":"医生开了抗抑郁药来帮助控制她的抑郁症。"},{"en":"It may take a few weeks for an antidepressive to have its full effect.","zh":"抗抑郁药可能需要几周才能达到最佳效果。"}]},{"partOfSpeech":"adj.","definition":{"en":"Preventing or reducing depression; related to the treatment of depression.","zh":"抗抑郁的；减轻或预防抑郁的；与抑郁治疗相关的。"},"examples":[{"en":"Regular exercise can have an antidepressive effect for some people.","zh":"规律运动对一些人可能有抗抑郁的效果。"},{"en":"She is studying the antidepressive properties of the new compound.","zh":"她正在研究这种新化合物的抗抑郁特性。"}]}],"synonyms":["antidepressant","mood-lifting","antidepression"],"phonetic":"/ˌæn.ti.dɪˈprɛs.ɪv/","extraExplanation":["在日常英语里更常见的说法是 **antidepressant**（抗抑郁药）。**antidepressive** 也能用，但听起来更偏学术或较少见。","“抗抑郁药”有不同类别（如 SSRI、SNRI 等）。学习英语时更重要的是掌握常见搭配：**take an antidepressant**（服用抗抑郁药）、**prescribe**（开药）、**side effects**（副作用）、**therapy/counseling**（心理治疗/咨询）。"]}
{"word":"antiderivative","summary":{"en":"An antiderivative is a function whose derivative equals a given function (often written as an indefinite integral).","zh":"antiderivative 指“原函数”：其导数等于给定函数（常对应不定积分）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A function whose derivative is a given function; an antiderivative of f(x) is a function F(x) such that F′(x)=f(x).","zh":"（微积分）原函数：如果函数F(x)的导数是f(x)，即F′(x)=f(x)，那么F(x)就是f(x)的原函数。"},"examples":[{"en":"An antiderivative of 2x is x² + C.","zh":"2x 的一个原函数是 x² + C。"},{"en":"Because the derivative of sin(x) is cos(x), an antiderivative of cos(x) is sin(x) + C.","zh":"因为 sin(x) 的导数是 cos(x)，所以 cos(x) 的一个原函数是 sin(x) + C。"},{"en":"We found an antiderivative to compute the area under the curve.","zh":"我们通过求原函数来计算曲线下的面积。"}]}],"synonyms":["indefinite integral (closely related)","primitive function"],"phonetic":"/ˌæn.ti.dəˈrɪv.ə.tɪv/","extraExplanation":["在微积分里，antiderivative 常与 **indefinite integral（不定积分）** 几乎同义：\\n\\n- “F is an antiderivative of f” 强调 **函数之间的关系**（F′=f）。\\n- “∫ f(x) dx” 强调 **运算/过程**（积分）。\\n\\n“+ C” 代表 **任意常数**，因为同一个函数会有无穷多个原函数（彼此只差一个常数）。"]}
{"word":"antiderivatives","summary":{"en":"Antiderivatives are functions whose derivatives equal a given function (indefinite integrals).","zh":"antiderivatives 指反导函数：导数等于给定函数的函数（不定积分）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In calculus, functions whose derivative is a given function; they represent an “indefinite integral.”","zh":"（微积分）反导函数：其导数等于某个已知函数的函数；也就是“（不定）积分”的结果。"},"examples":[{"en":"The antiderivatives of f(x)=2x include x^2 + C.","zh":"f(x)=2x 的反导函数包括 x^2 + C。"},{"en":"We found an antiderivative and then used limits to compute the definite integral.","zh":"我们先求出一个反导函数，再用上下限计算定积分。"}]}],"synonyms":["indefinite integrals","primitives"],"phonetic":"/ˌæn.ti.dɪˈrɪv.ə.tɪvz/","extraExplanation":["“antiderivative”常见于美式数学课程，也常与“indefinite integral（不定积分）”互换使用：∫f(x)dx 表示 f(x) 的一族反导函数。","反导函数通常不唯一，因为任意常数 C 的加入不会改变导数，所以常写成 F(x)+C。"]}
{"word":"antidetonant","summary":{"en":"An antidetonant is a fuel additive (or something described as such) that helps prevent engine knocking by reducing detonation.","zh":"antidetonant 指“抗爆剂/抗爆的”，用于减少燃料在发动机中的爆震（敲缸）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance added to fuel to prevent detonation (engine knocking) and help the fuel burn smoothly","zh":"（燃料）抗爆剂；加入燃油中以防止爆震（发动机敲缸）并使燃烧更平稳的物质"},"examples":[{"en":"Some gasoline contains an antidetonant to reduce engine knocking.","zh":"有些汽油含有抗爆剂，用来减少发动机敲缸。"},{"en":"High-performance engines may require fuel with stronger antidetonant additives.","zh":"高性能发动机可能需要含有更强抗爆添加剂的燃料。"}]},{"partOfSpeech":"adj.","definition":{"en":"preventing detonation (especially in engines)","zh":"抗爆的；防止爆震的（尤指发动机中）"},"examples":[{"en":"The additive has antidetonant properties.","zh":"这种添加剂具有抗爆性能。"}]}],"synonyms":["anti-knock additive","antiknock agent","octane booster"],"phonetic":"/ˌæn.tiˈdɛt.ə.nənt/","extraExplanation":["“Detonation”在发动机语境里常指燃烧室内的“爆震/爆燃”，会产生尖锐的敲击声（knocking/pinging），长期可能损伤发动机。抗爆剂通过提高燃料的抗爆性（常与辛烷值更高相关）来降低这种现象。","该词多见于化学、燃料与航空/汽车工程资料中；日常英语里更常说“anti-knock additive（抗爆添加剂）”或直接提“octane booster（辛烷值提升剂）”。"]}
{"word":"antidetonating","summary":{"en":"Antidetonating means preventing detonation, especially preventing engine knock by making fuel burn more smoothly.","zh":"Antidetonating 指“防爆震/抗爆”的，尤指让燃油更平稳燃烧、减少发动机爆震。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Preventing detonation (an uncontrolled explosion), especially in an engine by reducing “knock.”","zh":"防爆震的；抗爆的（尤指通过减少发动机“爆震/爆燃”来防止不受控的爆炸）。"},"examples":[{"en":"Modern gasoline contains antidetonating additives to help prevent engine knock.","zh":"现代汽油常含有抗爆添加剂，以帮助防止发动机爆震。"},{"en":"Using an antidetonating fuel can protect high-compression engines under heavy load.","zh":"使用抗爆燃料可以在高负荷下保护高压缩比发动机。"}]},{"partOfSpeech":"adj.","definition":{"en":"Reducing the chance of sudden explosive reaction in a broader scientific or industrial context.","zh":"（更广义）降低突然爆炸性反应风险的；抑制爆轰的。"},"examples":[{"en":"The lab chose an antidetonating formulation for safer transport of the compound.","zh":"实验室选择了抑爆配方，以便更安全地运输该化合物。"},{"en":"Engineers tested antidetonating materials for use in hazardous environments.","zh":"工程师测试了用于危险环境的抑爆材料。"}]}],"synonyms":["anti-knock","knock-resistant","detonation-resistant","non-detonating"],"phonetic":"/ˌænˌtiˈdiːtəˌneɪtɪŋ/","extraExplanation":["“detonation”常指爆轰或发动机中的“爆震（knock）”，而“antidetonating”多用于燃油/添加剂语境，强调让燃烧更平稳、按设计时机发生。","在汽车文化里，“anti-knock”与“octane rating（辛烷值）”关系密切：辛烷值越高，燃料越不容易在压缩条件下提前自燃，从而更“antidetonating”。"]}
{"word":"antidiabetic","summary":{"en":"Antidiabetic means “used to treat diabetes,” especially by lowering blood sugar; it can describe a drug or be the name of such a drug.","zh":"antidiabetic 指“用于治疗糖尿病（尤其降血糖）的”，既可作形容词也可作名词（抗糖尿病药）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Used to prevent, control, or treat diabetes by lowering blood sugar levels.","zh":"用于预防、控制或治疗糖尿病，帮助降低血糖的。"},"examples":[{"en":"Metformin is a widely used antidiabetic drug for type 2 diabetes.","zh":"二甲双胍是一种广泛用于2型糖尿病的抗糖尿病药物。"},{"en":"Some antidiabetic medicines can cause low blood sugar if you skip meals.","zh":"有些抗糖尿病药物如果你不吃饭，可能会导致低血糖。"}]},{"partOfSpeech":"n.","definition":{"en":"A medicine or substance used to treat diabetes, especially by lowering blood glucose.","zh":"抗糖尿病药；用于治疗糖尿病、尤其用于降低血糖的药物或物质。"},"examples":[{"en":"Insulin is an essential antidiabetic for many people with type 1 diabetes.","zh":"胰岛素对许多1型糖尿病患者来说是一种必需的抗糖尿病药。"},{"en":"Your doctor may change your antidiabetic if your blood sugar goals are not met.","zh":"如果你的血糖目标没有达成，医生可能会更换你的抗糖尿病药。"}]}],"synonyms":["blood sugar–lowering","glucose-lowering","antihyperglycemic","diabetes medicine"],"phonetic":"/ˌæn.tiˌdaɪ.əˈbɛt.ɪk/","extraExplanation":["这个词由 anti-（“对抗/抗”）+ diabetic（“糖尿病的”）组成，常见于医学语境。日常对话里更常说 diabetes medicine（糖尿病药）或 blood sugar–lowering medicine（降糖药）。","医学上 antidiabetic drugs（抗糖尿病药）可以包括不同类别，如 metformin、insulin、GLP-1 agonists 等；不同药物作用机制与副作用（如低血糖、胃肠不适）差异很大，使用需遵医嘱。"]}
{"word":"antidiarrheal","summary":{"en":"Antidiarrheal means a medicine (or something described as) used to prevent or treat diarrhea.","zh":"antidiarrheal 指“止泻药”，也可作形容词表示“止泻的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medicine used to prevent or treat diarrhea.","zh":"止泻药；用于预防或治疗腹泻的药物。"},"examples":[{"en":"The doctor recommended an antidiarrheal to help control the diarrhea.","zh":"医生建议用止泻药来帮助控制腹泻。"},{"en":"Do not give an antidiarrheal to a child unless a healthcare professional tells you to.","zh":"除非医护人员指示，否则不要给孩子使用止泻药。"},{"en":"If you have a fever or blood in your stool, seek medical care before using an antidiarrheal.","zh":"如果发烧或大便带血，请在使用止泻药前先就医。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used to describe a medicine or effect that helps stop diarrhea.","zh":"（形容词）止泻的；具有缓解或抑制腹泻作用的。"},"examples":[{"en":"This product has antidiarrheal properties.","zh":"这种产品具有止泻作用。"},{"en":"Some antidiarrheal drugs can cause constipation.","zh":"有些止泻药可能导致便秘。"}]}],"synonyms":["antidiarrhoeal","anti-diarrheal","antidiarrhea medicine","antidiarrhea drug"],"phonetic":"/ˌæn.tiˌdaɪ.əˈri.əl/","extraExplanation":["词源小提示：anti- 表示“反/对抗”，diarrhea 表示“腹泻”，合起来就是“对抗腹泻的（药物）”。","使用情境：在美国药店常见的非处方止泻药有 loperamide（洛哌丁胺，商品名如 Imodium）和 bismuth subsalicylate（次水杨酸铋，商品名如 Pepto-Bismol）。不同原因引起的腹泻处理方式不同：如果怀疑感染、食物中毒或出现高热/便血/严重脱水，应先就医而不是自行止泻。","搭配用法：take an antidiarrheal（服用止泻药）、over-the-counter antidiarrheal（非处方止泻药）、antidiarrheal medication/drug（止泻药物）。"]}
{"word":"antidiarrhoeal","summary":{"en":"Antidiarrhoeal means “for treating diarrhea,” and it can also refer to a diarrhea-fighting medicine.","zh":"antidiarrhoeal 表示“用于治疗腹泻的”，也可指“止泻药”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"used to prevent or treat diarrhea (loose, frequent bowel movements).","zh":"用于预防或治疗腹泻（大便稀、次数增多）的。"},"examples":[{"en":"The doctor recommended an antidiarrhoeal medicine to relieve her symptoms.","zh":"医生建议使用一种止泻药来缓解她的症状。"},{"en":"Avoid alcohol while taking antidiarrhoeal tablets unless your pharmacist says it’s OK.","zh":"除非药师确认可以，否则服用止泻片期间应避免饮酒。"}]},{"partOfSpeech":"n.","definition":{"en":"a medicine or drug that prevents or treats diarrhea.","zh":"止泻药；抗腹泻药。"},"examples":[{"en":"He took an antidiarrhoeal after a mild stomach bug.","zh":"他肠胃不适后服用了一种止泻药。"},{"en":"Some antidiarrhoeals can cause constipation if you take too much.","zh":"有些止泻药如果服用过量可能会导致便秘。"}]}],"synonyms":["antidiarrheal","antidiarrhoeic","antidiarrheic","antidiarrhea medicine","antidiarrheal drug"],"phonetic":"/ˌæn.tiˌdaɪ.əˈri.əl/","extraExplanation":["拼写提示：antidiarrhoeal 常见于英式英语；美式更常写作 antidiarrheal，意思相同。","用药小提醒：腹泻如果伴随高烧、血便、严重脱水或持续多天，通常不适合只靠止泻药压症状，建议就医以排除感染等原因。"]}
{"word":"antidiastase","summary":{"en":"Antidiastase is a rare rhetorical term for clarifying meaning by contrasting similar words or ideas.","zh":"antidiastase 是一个罕见的修辞术语，指通过对比来澄清并区分相近的词语或观念。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rhetorical device that distinguishes between similar or related words/ideas by contrasting them (often to clarify meaning or defend a choice of words).","zh":"（修辞）“反差辨析法”：通过对比来区分相近或相关的词语/观念（常用于澄清含义或为用词辩护）。"},"examples":[{"en":"The writer uses antidiastase to separate “firm” from “stubborn,” praising one and criticizing the other.","zh":"作者用反差辨析法把“坚定”和“顽固”区分开：前者褒扬，后者贬评。"},{"en":"In the speech, antidiastase helps explain why “discipline” is not the same as “punishment.”","zh":"在演讲中，反差辨析法帮助说明“纪律”不等同于“惩罚”。"}]}],"synonyms":["antidiastasis","distinction","contrast","antithesis"],"phonetic":"/ˌæn.ti.daɪˈæs.tə.siːz/","extraExplanation":["这个词非常少见；英语里更常见的形式是 **antidiastasis**，意思基本相同，都是修辞学术语。","词源来自希腊语：*anti-*（对立、相反）+ *diastasis*（分开、区分）。它常用于“为某个词的选择辩护”或“把两个容易混淆的概念拉开距离”，例如强调某人是“谨慎”而不是“胆小”。","相关（但不完全相同）的修辞概念包括 **antithesis**（对偶/对照）、**distinction**（辨析）。"]}
{"word":"antidiastasis","summary":{"en":"A rhetorical device where the same word is repeated but meant in different senses to clarify or contrast.","zh":"一种修辞手法：重复同一个词，但每次用不同的意思来澄清或对比。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rhetoric) The repetition of a word or phrase but with a different meaning each time (often to clarify, redefine, or contrast meanings).","zh":"（修辞）重复同一个词或短语，但每次使用时意思不同（常用来澄清、重新界定或形成对比）。"},"examples":[{"en":"\"I’m a fan of your work—but I’m not a fan, meaning an obsessed follower.\"","zh":"“我很欣赏你的作品——但我不是那种‘粉丝’，也就是痴迷追随者。”"},{"en":"\"We need a real leader—not a leader in title only.\"","zh":"“我们需要真正的领导者——而不是只有头衔的‘领导者’。”"}]}],"synonyms":["rhetorical redefinition","semantic contrast","repetition with a shift in meaning"],"phonetic":"/ˌæn.ti.daɪˈæs.tə.sɪs/","extraExplanation":["这是一个比较学术的修辞术语，来源于希腊语，常见于文学批评、演讲分析或写作课堂。说话者会故意用同一个词做“重新定义”，让听众注意到这个词可能有不止一种理解。","和“pun（双关语）”不同：双关更强调同时触发两种意思带来幽默或机智；antidiastasis更强调把同一个词“分开用、改着用”，以便纠正、强调或建立对照。","读到这种手法时，可以问自己：作者第二次重复这个词时，是否在缩小/扩大含义，或在否定一种常见理解、换成另一种更精确的理解？"]}
{"word":"Antidicomarian","summary":{"en":"Antidicomarian refers to someone (or something) that denies Mary’s perpetual virginity, mainly used in historical/theological contexts.","zh":"Antidicomarian指否认“玛利亚终身童贞”的人或相关观点，主要见于历史/神学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person (especially in early Christian history) who denied the doctrine that Mary remained a virgin for her whole life, arguing that she had other children after Jesus.","zh":"（尤指早期基督教历史中的）反对“玛利亚终身童贞”教义的人，主张玛利亚在耶稣之后还生了其他孩子。"},"examples":[{"en":"Some church writers mention the Antidicomarians when discussing debates about Mary’s perpetual virginity.","zh":"一些教会作者在讨论“玛利亚终身童贞”的争论时会提到反终身童贞派（Antidicomarians）。"},{"en":"The term “Antidicomarian” is rare today and is mostly used in historical or theological writing.","zh":"“Antidicomarian”这个词现在很少见，多用于历史或神学写作中。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or expressing the view that Mary was not perpetually virginal (that she had marital relations and additional children).","zh":"与否认“玛利亚终身童贞”有关的；表达“玛利亚并非终身童贞（后来有夫妻生活并生了其他孩子）”这一观点的。"},"examples":[{"en":"The article contrasts Antidicomarian arguments with later Catholic and Orthodox teaching.","zh":"这篇文章把反终身童贞派的论证与后来的天主教、东正教教义作对比。"}]}],"synonyms":["Antidicomarianite","anti–perpetual-virginity (of Mary)"],"phonetic":"/ˌæn.taɪˌdɪk.oʊˈmɛr.i.ən/","extraExplanation":["这个词常见的更长形式是 **Antidicomarianite(s)**，常被用来指4世纪左右被部分教会作者提及的一类观点（或群体），核心争点是“玛利亚是否终身保持童贞”。","词源可拆为 **anti-**（反对）+ 与“玛利亚（Mary）”相关的构词成分；属于历史神学术语，日常英语几乎不会用到。"]}
{"word":"antidicomarian","summary":{"en":"“Antidicomarian” is not a recognized standard English word; it likely needs context or is a misspelling/coinage.","zh":"“antidicomarian”不是公认的标准英语词汇；很可能需要语境判断，或是拼写错误/临时造词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard or widely recognized English word; it is likely a misspelling, a very rare/technical coinage, or a made-up term. Without context, its meaning cannot be confirmed.","zh":"这不是一个标准或常见的英语单词；很可能是拼写错误、极少见的专业造词，或是临时杜撰的词。缺少语境时无法确认其确切含义。"},"examples":[{"en":"I can’t find “antidicomarian” in major dictionaries—could you share the sentence you saw it in?","zh":"我在主流词典里找不到“antidicomarian”，你能把你看到它的句子发我吗？"},{"en":"If you meant “anti-DICOM,” that could refer to being against the DICOM medical imaging standard.","zh":"如果你想表达“anti-DICOM”，可能是指反对医学影像标准 DICOM。"}]}],"phonetic":"ˌæn.taɪˌdaɪ.koʊˈmɛr.i.ən","extraExplanation":["从构词上看，它像是由 anti-（“反对/抵制”）+ DICOM（医学影像通讯标准）+ -arian（常见于表示“某种立场/阵营的人”，如 vegetarian）拼出来的“新词”。但这只是基于构词的猜测，不等于它在英语里有固定、公认的定义。","也可能是拼写误差：例如把某个以 anti- 开头、以 -arian 结尾的词（如 anti-______arian）打错了。给出原句或领域（医学影像/宗教/政治/网络梗等）我才能更准确判断。"]}
{"word":"Antidicomarianite","summary":{"en":"“Antidicomarianite” is not a recognized English word; it’s likely a misspelling of “antidisestablishmentarianism/antidisestablishmentarian.”","zh":"“Antidicomarianite” 不是规范英语词；很可能是把 “antidisestablishmentarianism/antidisestablishmentarian” 拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or invented form; many people who type something similar are aiming for “antidisestablishmentarianism” (a famous long word) or “antidisestablishmentarian.”","zh":"这不是标准英语单词。它很可能是拼写错误或临时造词；很多人输入类似形式时，想表达的其实是 “antidisestablishmentarianism”（著名的超长词）或 “antidisestablishmentarian”。"},"examples":[{"en":"I couldn’t find “antidicomarianite” in major dictionaries; did you mean “antidisestablishmentarianism”?","zh":"我在主流词典里找不到 “antidicomarianite”；你是不是想写 “antidisestablishmentarianism”？"},{"en":"If you tell me the sentence you saw it in, I can help identify the intended word.","zh":"如果你把它出现的句子发给我，我可以帮你判断原本想写的词是什么。"}]},{"partOfSpeech":"n.","definition":{"en":"antidisestablishmentarianism: opposition to ending an established church’s official status or state support (often used as a playful example of a very long word).","zh":"antidisestablishmentarianism：反对取消“国教/官方教会”地位或国家支持的主张（也常被当作“超长单词”的玩笑示例）。"},"examples":[{"en":"In class, the teacher used “antidisestablishmentarianism” as an example of how prefixes and suffixes build meaning.","zh":"课堂上老师用 “antidisestablishmentarianism” 举例说明前缀和后缀如何组合出含义。"},{"en":"People often mention antidisestablishmentarianism when talking about unusually long English words.","zh":"人们谈到特别长的英语单词时，经常会提到 antidisestablishmentarianism。"}]}],"phonetic":"ˌæn.tiˌdɪs.ɪsˌtæb.lɪʃ.mənˈtɛr.i.əˌnɪz.əm","extraExplanation":["“antidisestablishmentarianism”可以拆开理解：anti-（反对）+ dis-（去除）+ establishment（既有制度/国教体制）+ -arian（支持某立场的人）+ -ism（主义/主张）。它最初与英国“国教（Church of England）是否应保持官方地位”相关的政治宗教讨论有关。","你输入的结尾“-ite”在英语里常见于矿物名（如 graphite 石墨）或表示“某派/某地的人”（如 Israelite 以色列人），但与该词源体系不匹配，所以更像是拼写混杂。","如果你提供：1）看到它的上下文句子；2）你想表达的中文意思；我可以给出最可能的正确单词与更贴切的用法。"]}
{"word":"antidicomarianite","summary":{"en":"“Antidicomarianite” isn’t a standard English word; it’s likely a misspelling of “antidisestablishmentarianism,” meaning opposition to ending state support for an established church (especially in Britain).","zh":"“antidicomarianite” 不是标准英语词；很可能是 “antidisestablishmentarianism” 的误拼，指反对取消国教地位或反对国家撤回对既定教会的支持（尤指英国）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard/unknown word in modern English; it is likely a misspelling of “antidisestablishmentarianism.”","zh":"现代英语中不常见/未收录的词；很可能是 “antidisestablishmentarianism” 的拼写错误。"},"examples":[{"en":"I couldn’t find “antidicomarianite” in a dictionary—did you mean “antidisestablishmentarianism”?","zh":"我在词典里找不到 “antidicomarianite”——你是不是想写 “antidisestablishmentarianism”？"}]},{"partOfSpeech":"n.","definition":{"en":"(antidisestablishmentarianism) Opposition to the withdrawal of state support from an established church, especially the Church of England.","zh":"（antidisestablishmentarianism）反对取消“国教”地位或反对国家撤回对既定教会的支持（尤指英国国教会）。"},"examples":[{"en":"In history class, we learned that antidisestablishmentarianism was debated in 19th-century Britain.","zh":"在历史课上，我们学到 19 世纪英国曾讨论过 antidisestablishmentarianism（反对撤销国教）。"},{"en":"The term is often used today mainly as a famous example of a very long English word.","zh":"如今这个词更多被用作“英语超长单词”的经典例子。"}]}],"phonetic":"/ˌæn(t)iˌdɪsɪˌstæblɪʃmənˈtɛriənˌɪzəm/","extraExplanation":["“antidisestablishmentarianism” 由多段词素组合：anti-（反对）+ dis-（去除/取消）+ establishment（既定体制/国教地位）+ -arian（某种立场的人）+ -ism（主义/思想）。它与英国历史上“国教（established church）是否应保留国家支持”的争论有关。","在文学与文化中，这个词常被当作“又长又难拼”的趣味例子出现，用来测试拼写或展示构词法；但在日常交流里很少需要使用。"]}
{"word":"antidictionary","summary":{"en":"Antidictionary is a rare term for a tool that helps you find words from ideas (like a reverse dictionary) or a guide that helps you avoid weak, overused words.","zh":"Antidictionary 是较少见的说法，可指从意思找单词的工具（类似反向词典），也可指帮助避免空泛、陈词滥调用词的写作指南。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A reference book or tool that helps you find the right word by starting from an idea or description (often similar to a “reverse dictionary” or a thesaurus used from meaning → word).","zh":"（较少见）一种从“意思/描述”出发来找“对应词”的工具或书（常类似“反向词典/逆向词典”，或从意义→词语来用的同义词工具）。"},"examples":[{"en":"When I couldn’t remember the word “nostalgic,” I used an antidictionary to search by meaning.","zh":"我想不起“nostalgic（怀旧的）”这个词时，用了“antidictionary”按意思去找。"},{"en":"Writers sometimes keep an antidictionary nearby to choose more precise words.","zh":"写作者有时会把“antidictionary”放在手边，用来挑更准确的词。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A book or guide that encourages you to avoid overused, vague, or “bad” words and replace them with clearer choices.","zh":"（较少见）一种指导你避免使用陈词滥调、含糊或“糟糕”用词，并用更清晰表达替代的书或指南。"},"examples":[{"en":"The editor recommended an antidictionary to help me cut clichés from my essays.","zh":"编辑建议我看一本“antidictionary”，帮助我在文章里删掉陈词滥调。"},{"en":"Some antidictionaries focus on business writing and suggest simpler alternatives.","zh":"有些“antidictionary”专注于商务写作，并给出更简单的替代表达。"}]}],"synonyms":["reverse dictionary","thesaurus","usage guide","style guide"],"phonetic":"/ˌæn.tiˈdɪk.ʃəˌnɛr.i/","extraExplanation":["“antidictionary”不是日常英语里的常见词，更常见的说法是 **reverse dictionary**（从意思找单词的“反向词典”）或 **thesaurus**（同义词词典）。","在出版物中它有时会作为书名或概念性用法出现，强调“对抗”两类问题：一类是“想表达但想不起词”；另一类是“用词空泛、套话太多”。","学习写作时，如果你看到作者说用“antidictionary”，往往是在强调写作工具的功能，而不是一个固定标准化的词典类别。"]}
{"word":"antidiffuser","summary":{"en":"Antidiffuser is a technical noun for something that reduces diffusion; in fluid dynamics it can mean a converging section that speeds up flow (often called a nozzle).","zh":"antidiffuser 是技术名词，指“抑制扩散/弥散的装置或结构”；在流体力学中也可指让流体加速的收缩段（更常称为喷嘴/收缩管道）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Technical) A device or design feature that counteracts or reduces diffusion (the spreading/mixing of particles, light, heat, or fluid flow).","zh":"（技术用语）用于抵消或减弱“扩散/弥散”（如颗粒、光、热或流体的扩散与混合）的装置或设计结构。"},"examples":[{"en":"Engineers added an antidiffuser to limit unwanted mixing in the airflow.","zh":"工程师加装了一个抗扩散结构，以减少气流中的非预期混合。"},{"en":"The lab used an antidiffuser barrier to slow the spread of dye in the solution.","zh":"实验室使用了抗扩散屏障来减缓染料在溶液中的扩散。"}]},{"partOfSpeech":"n.","definition":{"en":"(Fluid dynamics) A converging section (opposite of a diffuser) that speeds up a fluid by narrowing the flow area; often called a nozzle or converging duct.","zh":"（流体力学）一种收缩流道（与扩压器 diffuser 相反），通过缩小流通面积使流体加速；常更直接称为“喷嘴/收缩管道”。"},"examples":[{"en":"In the test rig, the antidiffuser increased the air velocity before it entered the chamber.","zh":"在测试装置中，这个收缩段让空气在进入腔体前速度提高。"},{"en":"Some manuals avoid the term “antidiffuser” and simply say “converging nozzle.”","zh":"有些手册会避免用“antidiffuser”，而直接写“converging nozzle（收缩喷嘴）”。"}]}],"synonyms":["anti-diffuser","diffusion barrier","nozzle","converging duct"],"phonetic":"/ˌæn.ti.dɪˈfjuːzɚ/","extraExplanation":["“antidiffuser”不是日常英语里的常见词，更常见的写法是带连字符的“anti-diffuser”。在不同领域它可能有不同指向：有时泛指“抑制扩散的装置/结构”，在流体领域则常被更标准的术语（如 nozzle, converging duct）替代。阅读论文或说明书时，建议根据上下文确认它指的是“抑制混合/扩散”还是“收缩加速流动的部件”。"]}
{"word":"antidinic","summary":{"en":"Antidynic means pain-relieving; it can also refer to a painkilling drug.","zh":"antidynic 指“止痛的”，也可指“止痛药/镇痛剂”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medicine) Relieving pain; painkilling (an analgesic effect).","zh":"（医学）止痛的；镇痛的（有缓解疼痛作用的）。"},"examples":[{"en":"The doctor prescribed an antidynic medication after the surgery.","zh":"手术后医生开了止痛药。"},{"en":"This cream has mild antidynic properties for sore muscles.","zh":"这种药膏对肌肉酸痛有轻微的止痛作用。"}]},{"partOfSpeech":"n.","definition":{"en":"A drug or agent that relieves pain; a painkiller.","zh":"止痛药；镇痛剂。"},"examples":[{"en":"Ibuprofen is often used as an antidynic for headaches.","zh":"布洛芬常用作头痛的止痛药。"}]}],"synonyms":["analgesic","pain-relieving","painkiller"],"phonetic":"/ˌæn.tiˈdɪn.ɪk/","extraExplanation":["“antidinic”很可能是“antidynic”的拼写误写/少见变体。在医学英语里更常见的是“analgesic（镇痛的/止痛药）”。","词源上可拆为 anti-（反、对抗）+（与疼痛有关的词根，源自希腊语表示“痛”）。因此整体含义就是“对抗疼痛的”。"]}
{"word":"antidip","summary":{"en":"Antidip (often written anti-dip) means a design or system that prevents something from dipping or dropping, especially a vehicle’s front end when braking.","zh":"antidip（常写作 anti-dip）指防止“下沉/下跌”的设计或系统，尤其指车辆刹车时防车头下沉（抗点头）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially in vehicles) Designed to reduce or prevent the front of a vehicle from dipping downward when braking.","zh":"（尤指车辆）用于减少或防止刹车时车头下沉的；抗点头的。"},"examples":[{"en":"This motorcycle has an anti-dip system to keep the front end stable during hard braking.","zh":"这辆摩托车有抗点头系统，能在急刹时让车头更稳定。"},{"en":"Anti-dip suspension can make braking feel smoother on uneven roads.","zh":"抗点头悬挂能让车辆在不平路面刹车时感觉更平顺。"}]},{"partOfSpeech":"n.","definition":{"en":"A feature or system that prevents a sudden drop in level or performance (e.g., suspension movement, voltage, or output).","zh":"防止水平或性能突然下降的装置/功能（如悬挂行程、电压或输出的下跌）。"},"examples":[{"en":"The engineer added an antidip circuit to reduce voltage sag under load.","zh":"工程师加了一个防下跌电路，用来减少负载时的电压下滑。"},{"en":"The new model includes antidip technology to maintain consistent output.","zh":"新型号包含防下跌技术，以保持输出稳定。"}]}],"synonyms":["anti-dive","stability control (context-dependent)","voltage sag protection (context-dependent)"],"phonetic":"/ˌæn.tiˈdɪp/","extraExplanation":["“antidip”更常见的写法是带连字符的“anti-dip”。它多出现在汽车/摩托车领域（刹车时抑制“点头”现象），在工程语境中也可泛指“防下滑/防下跌”的设计（例如防止电压下陷）。如果你是在某个特定产品说明或论文里看到它，含义可能更专业、也更具体。"]}
{"word":"antidiphtheria","summary":{"en":"“Antidiphtheria” means used to prevent or treat diphtheria (often describing a vaccine, antitoxin, or serum).","zh":"“antidiphtheria”指用于预防或治疗白喉的（常修饰疫苗、抗毒素或血清）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medicine) Used to prevent or treat diphtheria, especially by referring to a vaccine, antitoxin, or serum.","zh":"（医学）用于预防或治疗白喉的，尤指白喉疫苗、抗毒素或血清。"},"examples":[{"en":"The clinic stored antidiphtheria vaccine in a refrigerated cabinet.","zh":"诊所把白喉预防疫苗（antidiphtheria vaccine）存放在冷藏柜里。"},{"en":"In older medical texts, “antidiphtheria serum” refers to an antitoxin used to treat diphtheria.","zh":"在较早的医学文献中，“antidiphtheria serum（抗白喉血清）”指用于治疗白喉的抗毒素。"}]},{"partOfSpeech":"n.","definition":{"en":"An antidiphtheria antitoxin/serum (a medicine used to counter diphtheria toxin).","zh":"抗白喉毒素／抗白喉血清（用于中和白喉毒素的药物）。"},"examples":[{"en":"The doctor administered antidiphtheria to neutralize the toxin.","zh":"医生使用抗白喉毒素来中和毒素。"}]}],"synonyms":["diphtheria antitoxin","antidiphtheritic","antitoxin"],"phonetic":"/ˌæn.ti.dɪfˈθɪr.i.ə/","extraExplanation":["“antidiphtheria”多见于较正式或较旧的医学表达中，常作定语放在名词前（如 antidiphtheria serum / antidiphtheria antitoxin / antidiphtheria vaccine）。现代常用说法更倾向于 diphtheria antitoxin（白喉抗毒素）或 diphtheria vaccine（白喉疫苗）。","白喉（diphtheria）是一种由白喉杆菌产生毒素引起的严重感染；历史上“抗毒素（antitoxin）”的出现显著降低了死亡率，后来与常规免疫接种一起成为防治关键。"]}
{"word":"antidiphtheric","summary":{"en":"Antidiphtheric means “against diphtheria,” especially describing vaccines, serum, or treatment.","zh":"antidiphtheric 意为“抗白喉的”，多用于描述疫苗、血清或治疗手段。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"preventing, treating, or protecting against diphtheria.","zh":"抗白喉的；用于预防、治疗或防护白喉的。"},"examples":[{"en":"The doctor administered an antidiphtheric serum to help neutralize the toxin.","zh":"医生注射了抗白喉血清来帮助中和毒素。"},{"en":"Antidiphtheric vaccination dramatically reduced deaths from diphtheria.","zh":"抗白喉疫苗接种显著降低了白喉死亡率。"}]},{"partOfSpeech":"n.","definition":{"en":"a medicine or substance used to prevent or treat diphtheria (less common usage).","zh":"抗白喉药物或制剂（较少见用法）。"},"examples":[{"en":"In older medical texts, an “antidiphtheric” often refers to antitoxin preparations.","zh":"在较早的医学文献中，“antidiphtheric”常指抗毒素制剂。"}]}],"synonyms":["anti-diphtheria","diphtheria-preventive","antitoxic (context-dependent)"],"phonetic":"/ˌæn.ti.dɪfˈθɪr.ɪk/","extraExplanation":["“antidiphtheric”常见于较旧或较正式的医学语境。现代英语里更常说：diphtheria vaccine（白喉疫苗）、diphtheria antitoxin（白喉抗毒素）、anti-diphtheria serum（抗白喉血清）。","白喉（diphtheria）是由白喉杆菌产生毒素引起的感染，历史上可致命；“antidiphtheric”常与“serum/antitoxin”连用，强调对抗“毒素（toxin）”。"]}
{"word":"antidiphtherin","summary":{"en":"Antidiphtherin is an older term for diphtheria antitoxin, a serum used to treat diphtheria by neutralizing its toxin.","zh":"antidiphtherin 是较旧的说法，指白喉抗毒素（抗白喉血清），用于中和白喉毒素以治疗白喉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an antitoxin (antibody-rich serum) used to treat diphtheria by neutralizing the diphtheria toxin (historical/medical term).","zh":"抗白喉血清（抗毒素）：一种用于治疗白喉、通过中和白喉毒素的抗体血清（偏历史/医学用语）。"},"examples":[{"en":"Before modern vaccination programs, doctors sometimes treated severe diphtheria with antidiphtherin.","zh":"在现代疫苗普及之前，医生有时会用抗白喉血清来治疗严重的白喉。"},{"en":"The museum label described early antidiphtherin as a life-saving serum therapy from the late 1800s.","zh":"博物馆说明牌将早期抗白喉血清描述为19世纪末的救命血清疗法。"}]}],"synonyms":["diphtheria antitoxin","antitoxin","anti-diphtheria serum"],"phonetic":"/ˌæn.tiˈdɪf.θə.rɪn/","extraExplanation":["“antidiphtherin”是较旧的医学词，常指“diphtheria antitoxin（白喉抗毒素）”。现代医学更常说“diphtheria antitoxin”。","它主要用于治疗而不是预防；预防白喉的关键手段是白喉类毒素疫苗（常见于DTaP/Tdap等联合疫苗）。","该词由“anti-（抗、对抗）+ diphther-（与白喉相关）+ -in（旧式名词后缀）”构成，常见于老文献或历史语境。"]}
{"word":"antidiphtheritic","summary":{"en":"Antidiphtheritic means “used to prevent or treat diphtheria,” usually referring to antitoxin or related immune protection.","zh":"antidiphtheritic 指“用于预防或治疗白喉的”，多用于指白喉抗毒素或相关免疫防护。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Preventing or treating diphtheria, especially by using an antitoxin (a medicine made from antibodies).","zh":"用于预防或治疗白喉的，尤指使用白喉抗毒素（由抗体制成的药物）。"},"examples":[{"en":"The clinic stocked antidiphtheritic serum for emergency cases.","zh":"诊所储备了白喉抗毒素血清，以应对紧急病例。"},{"en":"Before widespread vaccination, antidiphtheritic treatment saved many children.","zh":"在疫苗普及之前，白喉抗毒素治疗拯救了许多儿童。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to diphtheria or to measures against it (such as vaccines or antitoxin).","zh":"与白喉或防治白喉的措施（如疫苗或抗毒素）有关的。"},"examples":[{"en":"Researchers compared the antidiphtheritic response after different vaccine schedules.","zh":"研究人员比较了不同接种方案后的抗白喉免疫反应。"},{"en":"The paper described antidiphtheritic antibodies in the blood sample.","zh":"论文描述了血样中的抗白喉抗体。"}]}],"synonyms":["anti-diphtheria","against diphtheria","diphtheria-preventive","diphtheria-protective"],"phonetic":"/ˌæn.tiˌdɪf.θəˈrɪt.ɪk/","extraExplanation":["“antidiphtheritic”常见于医学或公共卫生语境，日常英语里更常用的说法是“diphtheria antitoxin（白喉抗毒素）”“diphtheria vaccine（白喉疫苗）”或“against diphtheria（预防/对抗白喉）”。","词形拆解：anti-（对抗）+ diphther-（白喉）+ -itic（…的）。因此它字面意思就是“对抗白喉的”。"]}
{"word":"antidisciplinarian","summary":{"en":"Antidisciplinarian describes a person or idea that opposes strict discipline and rigid rules.","zh":"antidisciplinarian 指反对严格纪律与僵化规则的人或观点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposes strict discipline or traditional rules, especially in education, parenting, or institutions","zh":"（尤指在教育、养育或机构管理中）反对严格纪律或传统规训的人"},"examples":[{"en":"Some teachers saw him as an antidisciplinarian because he rejected punishments and strict classroom rules.","zh":"一些老师认为他是反纪律主义者，因为他反对惩罚和严格的课堂规则。"},{"en":"As an antidisciplinarian, she supported student freedom and flexible learning.","zh":"作为反纪律主义者，她支持学生的自由与更灵活的学习方式。"}]},{"partOfSpeech":"adj.","definition":{"en":"opposing strict discipline or rigid rule-following","zh":"反对严格纪律的；反对僵化守规的"},"examples":[{"en":"The school adopted an antidisciplinarian approach that emphasized trust and autonomy.","zh":"这所学校采用了一种反纪律主义的方式，强调信任与自主。"},{"en":"His antidisciplinarian views clashed with the administration’s zero-tolerance policy.","zh":"他的反纪律主义观点与管理层的零容忍政策发生了冲突。"}]}],"synonyms":["anti-authoritarian","nonpunitive","permissive (context-dependent)","libertarian (education context)"],"phonetic":"/ˌæn.tiˌdɪs.əˈplɪn.əˌri.ən/","extraExplanation":["这个词由 anti-（反对）+ disciplinarian（纪律/规训的支持者）构成，语体偏正式、学术讨论中更常见，日常口语里更常说 “anti-authoritarian”（反权威的）或 “against strict discipline”（反对严厉管教）。","在教育语境中，它常与“进步教育”“非惩罚性管教”等理念一起出现；但并不一定等同于“放任”，有时指反对惩罚式纪律、强调内在动机与自我管理。"]}
{"word":"antidiscrimination","summary":{"en":"Antidiscrimination means opposing discrimination and promoting fair treatment, often through laws or policies.","zh":"antidiscrimination 指“反歧视”，强调反对歧视、促进公平对待，常见于法律或政策语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposing unfair treatment of people based on protected characteristics (such as race, sex, religion, disability, age, or nationality), especially through laws and policies.","zh":"反歧视的；反对基于受保护特征（如种族、性别、宗教、残疾、年龄、国籍等）的不公平对待，尤指通过法律与政策来防止歧视。"},"examples":[{"en":"The company updated its antidiscrimination policy and trained all managers.","zh":"公司更新了反歧视政策，并对所有经理进行了培训。"},{"en":"Antidiscrimination laws aim to protect workers from unfair hiring practices.","zh":"反歧视法旨在保护劳动者免受不公平的招聘做法。"},{"en":"Students reported the incident under the school’s antidiscrimination rules.","zh":"学生按照学校的反歧视规定报告了该事件。"}]},{"partOfSpeech":"n.","definition":{"en":"The principles, measures, or laws designed to prevent discrimination.","zh":"反歧视措施；反歧视法规（用于防止歧视的原则、制度或法律）。"},"examples":[{"en":"The new bill strengthens antidiscrimination in housing.","zh":"这项新法案加强了住房领域的反歧视措施。"},{"en":"Community groups pushed for stronger antidiscrimination protections.","zh":"社区团体推动更强的反歧视保护。"}]}],"synonyms":["anti-discrimination","nondiscrimination","equal-opportunity (related)"],"phonetic":"/ˌæn.ti.dɪˌskrɪməˈneɪʃən/","extraExplanation":["“antidiscrimination”常见于法律、政策与职场/校园规定中。美式英语里也常写作“anti-discrimination”（加连字符），两者意思相同。","与之相关的常见搭配：antidiscrimination policy（反歧视政策）、antidiscrimination law（反歧视法）、antidiscrimination training（反歧视培训）。","近义表达：non-discrimination（不歧视原则，语气更正式/国际文件常用）；反义概念：discrimination（歧视）。"]}
{"word":"antidisestablishmentarian","summary":{"en":"A person (or viewpoint) opposing the removal of an official church’s privileged status; often used humorously as a very long word.","zh":"指反对取消国教（官方教会）特权地位的人或立场；也常被当作“超长英语单词”的趣味例子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often humorous) Opposed to the removal of an official church’s special status (especially in 19th‑century Britain).","zh":"（常带幽默色彩）反对取消国教（官方教会）特权地位的人；尤指19世纪英国反对“政教分离/撤销国教地位”的人。"},"examples":[{"en":"In a history class, the teacher mentioned antidisestablishmentarians who fought to keep the Church of England’s privileges.","zh":"在历史课上，老师提到一些反对取消英国国教特权的 antidisestablishmentarians。"},{"en":"He joked that he was an antidisestablishmentarian—mainly because he liked saying the word.","zh":"他开玩笑说自己是 antidisestablishmentarian——主要是因为他喜欢念这个词。"}]},{"partOfSpeech":"adj.","definition":{"en":"Opposed to disestablishment (the separation of church and state, or the removal of an official church’s privileged status).","zh":"反对“撤销国教地位/政教分离”的；反建制教会的。"},"examples":[{"en":"Her antidisestablishmentarian views were shaped by her family’s strong ties to the church.","zh":"她反对撤销国教地位的观点受到家族与教会紧密关系的影响。"},{"en":"The article traced antidisestablishmentarian arguments in 19th‑century political debates.","zh":"这篇文章梳理了19世纪政治辩论中反对撤销国教地位的论点。"}]}],"synonyms":["anti-disestablishment","opponent of disestablishment","pro-established church (contextual)"],"phonetic":"/ˌæn.ti.dɪs.əˌstæb.lɪʃ.mənˈtɛr.i.ən/","extraExplanation":["这个词常被拿来当“超长英语单词”的趣味例子，但它本来是有明确历史语境的政治/宗教用语：disestablishment 指“撤销国教地位、取消官方教会特权”，anti- 是否定/反对前缀，因此 antidisestablishmentarian 就是“反对 disestablishment 的人/立场”。","相关名词更常见的是 antidisestablishmentarianism（反对撤销国教地位的主张/运动）。在现代日常生活中，这个词多用于玩笑、文字游戏或历史讨论，而不是常用表达。"]}
{"word":"antidisestablishmentarianism","summary":{"en":"Antidisestablishmentarianism means opposition to ending state support for an established church (especially in Britain), and it’s also famously used as a humorous example of an extremely long word.","zh":"Antidisestablishmentarianism 指反对废除国教制度（尤指英国语境下反对政教分离/取消国教地位），也常作为“超长英语单词”的幽默例子被提及。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to disestablishment—especially the idea that the government should stop supporting an established state church (historically, the Church of England).","zh":"反对“政教分离/废除国教制度”的主张，尤指反对政府停止支持既定的国教（历史上多指英格兰教会）。"},"examples":[{"en":"In 19th-century Britain, antidisestablishmentarianism was tied to debates about the Church of England’s role in the state.","zh":"在19世纪的英国，反反国教分离主义与关于英格兰教会在国家中的角色之争密切相关。"},{"en":"He studied antidisestablishmentarianism to understand how religion and politics influenced each other.","zh":"他研究反反国教分离主义，以理解宗教与政治如何相互影响。"}]},{"partOfSpeech":"n.","definition":{"en":"(Often humorous) A very long word used to show off vocabulary or talk about extremely complex political positions.","zh":"（常带幽默）用来“秀词汇”的超长单词，或用来指代极其复杂、绕口的政治立场。"},"examples":[{"en":"People sometimes mention antidisestablishmentarianism as a classic example of a ridiculously long English word.","zh":"人们有时会提到 antidisestablishmentarianism，把它当作英语里“长得离谱”的经典例子。"},{"en":"The teacher joked that antidisestablishmentarianism wasn’t on the test—unless you could spell it.","zh":"老师开玩笑说考试不考 antidisestablishmentarianism——除非你能拼对。"}]}],"synonyms":["opposition to disestablishment","pro-establishment (church) sentiment"],"phonetic":"/ˌæn.ti.dɪs.əˌstæb.lɪʃ.mənˈtɛr.i.əˌnɪ.zəm/","extraExplanation":["这个词可以拆开来理解：anti-（反对）+ dis-（去除/否定）+ establishment（既定体制/国教制度）+ -arian（表示支持某种立场的人）+ -ism（主义/思想）。整体意思就是“反对取消国教制度”。","历史语境里，“establishment”常指“国教体制”（如英国国教与国家权力的绑定）。因此它不只是“反对建制”，而是与“国教是否应与国家绑定”相关的政治与宗教议题。","现代英语中它也常被当作“超长单词梗”使用，很多时候并不是真的在讨论宗教政策。"]}
{"word":"antidiuretic","summary":{"en":"“Antidiuretic” means reducing urine production (often referring to ADH) or a substance/drug that does so.","zh":"“antidiuretic”指“抗利尿的”，即减少尿液生成（常指抗利尿激素ADH），也可指抗利尿的药物/物质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"A substance (especially a hormone) that reduces the amount of urine the body makes by helping the kidneys keep (reabsorb) water.","zh":"抗利尿的物质（尤其是激素），通过帮助肾脏保留（重吸收）水分来减少尿量。"},"examples":[{"en":"Antidiuretic hormone (ADH) helps your body keep water when you are dehydrated.","zh":"抗利尿激素（ADH）会在你脱水时帮助身体保留水分。"},{"en":"If the body does not make enough antidiuretic hormone, a person may urinate too much.","zh":"如果身体分泌的抗利尿激素不足，可能会出现排尿过多。"}]},{"partOfSpeech":"n.","definition":{"en":"An antidiuretic substance or drug.","zh":"抗利尿剂；抗利尿的药物或物质。"},"examples":[{"en":"The doctor prescribed an antidiuretic to reduce nighttime urination.","zh":"医生开了抗利尿剂来减少夜间排尿。"}]}],"synonyms":["water-retaining","urine-reducing","vasopressin (for ADH)"],"phonetic":"/ˌænˌtiˌdaɪ.jəˈrɛtɪk/","extraExplanation":["词源提示：anti- 表示“反对/抑制”，diuretic 表示“利尿的/利尿剂”，合起来就是“抑制利尿的”。","常见搭配：antidiuretic hormone（抗利尿激素）也常写作 ADH，医学上也称 vasopressin（加压素）。","学习提醒：与 diuretic（利尿的/利尿剂）意义相反；diuretic 会让尿量增加，而 antidiuretic 会让尿量减少。"]}
{"word":"antidivine","summary":{"en":"“Antidivine” means opposed to God or the sacred; anti-religious in tone.","zh":"“antidivine”指反对上帝或神圣事物，带有反宗教/反神性的含义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to God, the divine, or religious belief; against the sacred.","zh":"反神的；反对上帝或神圣事物的；反宗教信仰的。"},"examples":[{"en":"Some critics called the novel’s message antidivine because it rejects any idea of God.","zh":"一些评论家称这部小说的主旨“反神”，因为它否定任何上帝的概念。"},{"en":"The play was accused of using antidivine imagery to shock the audience.","zh":"这出戏被指责使用“反神”的意象来震撼观众。"}]}],"synonyms":["anti-religious","godless","blasphemous","impious","profane"],"phonetic":"/ˌæntiˈdɪvaɪn/","extraExplanation":["“antidivine”是较少见的词，常见于批评、神学讨论或文学评论中，用来强调“与神圣/神性相对立”。更常用的近义表达包括“anti-religious（反宗教的）”“godless（不敬神的/无神的）”“blasphemous（亵渎神的）”，但这些词的语气和强度不完全相同。","构词：anti-（反对）+ divine（神圣的）。在正式写作里，使用时最好说明你反对的是“宗教制度”“信仰内容”还是“神圣权威”，以避免歧义。"]}
{"word":"antidivorce","summary":{"en":"Anti-divorce means opposed to divorce or to policies that make divorce easier.","zh":"anti-divorce 指反对离婚，或反对让离婚更容易的政策与做法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to divorce; supporting laws, policies, or beliefs that discourage or restrict divorce.","zh":"反对离婚的；主张用法律、政策或观念来阻止或限制离婚的。"},"examples":[{"en":"Some religious groups take an anti-divorce position.","zh":"一些宗教团体持反对离婚的立场。"},{"en":"The bill was promoted by anti-divorce activists.","zh":"这项法案由反对离婚的活动人士推动。"},{"en":"Her writing often criticizes anti-divorce laws that trap people in unsafe marriages.","zh":"她的文章常批评那些让人被困在不安全婚姻中的反离婚法律。"}]}],"synonyms":["anti-divorce","opposed to divorce","pro-marriage (in some contexts)","anti-separation (less common)"],"phonetic":"/ˌæntaɪ dɪˈvɔrs/","extraExplanation":["“anti-”是英语中常见前缀，表示“反对/抵制”。“anti-divorce”多用于社会议题、宗教立场或政策讨论中；写作时常用连字符（anti-divorce），也可写作不加连字符的“antidivorce”（较少见）。","语气通常是中性描述某种立场，但在具体语境中可能带有批评或支持的态度色彩，建议通过上下文判断。"]}
{"word":"Antido","summary":{"en":"Antidote means a substance that counteracts poison, or (figuratively) something that helps fix a bad situation or feeling.","zh":"Antidote 指“解毒剂”，也可比喻为缓解负面情绪或扭转不良局面的“良方”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medicine or substance that stops or reduces the effects of a poison or harmful drug","zh":"（解）解毒剂；能减轻或阻止毒物/有害药物作用的药物或物质"},"examples":[{"en":"The doctor gave her an antidote for the snakebite.","zh":"医生给她注射了蛇咬伤的解毒剂。"},{"en":"There is no antidote for this type of poison.","zh":"这种毒没有解毒剂。"}]},{"partOfSpeech":"n.","definition":{"en":"something that prevents or corrects a bad situation or feeling (used figuratively)","zh":"（比喻）对抗坏局面或负面情绪的“解药”；补救办法"},"examples":[{"en":"Laughter can be a good antidote to stress.","zh":"笑是缓解压力的良药。"},{"en":"A long walk was her antidote to a bad day at work.","zh":"长时间散步是她应对糟糕工作日的“解药”。"}]}],"synonyms":["remedy","cure","treatment","counteragent"],"phonetic":"/ˈæn.təˌdoʊt/","extraExplanation":["你输入的“Antido”很可能是“antidote”的拼写未完成或简写；标准拼写是 antidote。","词源来自希腊语：anti-（对抗）+ didonai（给予），原意接近“给出用来对抗（毒物）的东西”。在现代英语中既可指真正的解毒剂，也常用作比喻，表示“解决烦恼的良方”。"]}
{"word":"antidoctrine","summary":{"en":"Antidoctrine describes opposition to fixed doctrines or a stance that rejects rigid belief systems.","zh":"Antidoctrine 指反对固定教义或拒绝僵化信仰体系的立场。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to established doctrines or formal systems of belief (especially in religion, politics, or philosophy).","zh":"反对既定教义或正式信仰体系的（尤指宗教、政治或哲学中的）。"},"examples":[{"en":"The essay takes an antidoctrine stance, questioning rigid religious rules.","zh":"这篇文章采取反教义立场，质疑僵化的宗教规则。"},{"en":"Some readers saw his antidoctrine views as a call for personal freedom of thought.","zh":"一些读者认为他的反教义观点是在呼吁思想的个人自由。"}]},{"partOfSpeech":"n.","definition":{"en":"An attitude, movement, or position that rejects doctrine or distrusts fixed beliefs.","zh":"反教义主义；对“教义”持排斥或不信任态度的立场、思潮或观点。"},"examples":[{"en":"Her antidoctrine was not anti-religion; it was a refusal to accept unquestioned authority.","zh":"她的反教义并非反宗教，而是拒绝接受不加质疑的权威。"},{"en":"In the debate, antidoctrine appealed to people tired of ideological labels.","zh":"在辩论中，反教义主义吸引了厌倦意识形态标签的人。"}]}],"synonyms":["anti-dogmatic","non-dogmatic","anti-ideological","anti-orthodox"],"phonetic":"/ˌæn.tiˈdɑk.trən/","extraExplanation":["这个词比较少见，通常由前缀 anti-（反对）+ doctrine（教义、信条）构成，常见写法也可能是带连字符的 anti-doctrine。","语境上多用于批评“教条主义”（dogmatism）或强调独立思考；它不一定等于“反宗教”，更常表达“反对僵化、不可质疑的教义”。"]}
{"word":"antidogmatic","summary":{"en":"Antidogmatic means not rigidly accepting doctrines; open to questioning and evidence.","zh":"Antidogmatic 指不僵化地接受教条，愿意质疑并依据证据保持开放。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not accepting ideas as unquestionably true; willing to question doctrines, rules, or established beliefs","zh":"反教条的；不把某些观点当作绝对真理、愿意质疑教义/规则/既定信念的"},"examples":[{"en":"Her antidogmatic approach encourages students to ask “why,” not just memorize answers.","zh":"她的反教条式方法鼓励学生问“为什么”，而不只是死记答案。"},{"en":"The book is antidogmatic: it presents several viewpoints and lets readers judge.","zh":"这本书反教条：它呈现多种观点，让读者自己判断。"},{"en":"In science, an antidogmatic attitude helps us change our minds when new evidence appears.","zh":"在科学中，反教条的态度能帮助我们在新证据出现时改变看法。"}]}],"synonyms":["non-dogmatic","open-minded","skeptical","unorthodox"],"phonetic":"/ˌænti dɔɡˈmætɪk/","extraExplanation":["“anti-”表示“反对/对抗”，“dogmatic”来自“dogma（教条、教义）”。因此 antidogmatic 常用于学术、教育、哲学或公共讨论场景，强调开放、怀疑与以证据为依据。","注意它通常是褒义（开放与理性），但在语境中也可能被用来暗示“缺乏立场/过度相对主义”。"]}
{"word":"antidogmatical","summary":{"en":"Antidogmatical means “anti-dogma”: willing to question fixed beliefs rather than accept them as absolute truth.","zh":"antidogmatical 意为“反教条的”：倾向于质疑固定信条，而不是把它们当作绝对真理。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to dogma; not accepting fixed beliefs as unquestionable, especially in religion, philosophy, or politics.","zh":"反教条的；反对把某种信条当作不可质疑的真理（尤指宗教、哲学或政治中的教条主义）。"},"examples":[{"en":"She takes an antidogmatical approach to religion and prefers open discussion to strict rules.","zh":"她对宗教持反教条的态度，更喜欢开放讨论而不是严格的规定。"},{"en":"An antidogmatical teacher encourages students to question ideas and examine evidence.","zh":"反教条的老师会鼓励学生质疑观点并检视证据。"}]}],"synonyms":["anti-dogmatic","non-dogmatic","skeptical","open-minded","unorthodox"],"phonetic":"/ˌæn.taɪ.dɔɡˈmætɪkəl/","extraExplanation":["“antidogmatical”较少见，更常用的是“anti-dogmatic / antidogmatic”。词根“dogma”指“教义、教条”，前缀“anti-”表示“反对”。在学术写作中常用来描述一种强调怀疑、讨论与证据的立场，而非盲从权威或固定信条。"]}
{"word":"antidogmatically","summary":{"en":"Antidogmatically means “in an open-minded, non-dogmatic way.”","zh":"antidogmatically 意为“以开放、非教条（不武断）的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that avoids strict, unquestioned beliefs (dogma); open-mindedly and not rigidly.","zh":"以反教条的方式；不拘泥于既定教义或权威观点，保持开放与不武断。"},"examples":[{"en":"She approached the debate antidogmatically, asking questions instead of defending a fixed position.","zh":"她以反教条的方式参与辩论，更多提问而不是死守固定立场。"},{"en":"The teacher encouraged students to read antidogmatically and consider multiple interpretations.","zh":"老师鼓励学生以反教条的方式阅读，考虑多种解读。"}]}],"synonyms":["open-mindedly","non-dogmatically","flexibly","critically"],"phonetic":"/ˌæntaɪdɔɡˈmætɪkli/","extraExplanation":["“dogma”常指宗教或意识形态中被当作“不可质疑的真理”的教条；“antidogmatically”强调反对这种不加思考的服从，更重视证据、讨论与多元观点。","词形提示：anti-（反对）+ dogmatic（教条的）+ -ly（副词）。也常见形容词形式“antidogmatic / antidogmatical”（反教条的）。"]}
{"word":"antidogmatism","summary":{"en":"Antidogmatism means resisting rigid, unquestioned beliefs and staying open to evidence and revision.","zh":"Antidogmatism 指反对僵化、不可质疑的信念，主张基于证据保持开放并随时修正观点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to rigidly accepting ideas or beliefs as unquestionably true; an attitude that stays open-minded and critical.","zh":"反教条主义；反对把某种观点或信念当作不可质疑的真理，强调保持开放与批判思考的态度。"},"examples":[{"en":"In science, antidogmatism encourages researchers to question old theories when new evidence appears.","zh":"在科学中，反教条主义鼓励研究者在出现新证据时质疑旧理论。"},{"en":"Her antidogmatism made class discussions more open and respectful.","zh":"她的反教条主义让课堂讨论更开放、更互相尊重。"}]},{"partOfSpeech":"n.","definition":{"en":"A philosophical or intellectual approach that values flexibility, skepticism, and revising beliefs rather than following fixed doctrines.","zh":"一种哲学/思想立场：重视灵活性、怀疑精神与修正观点，而不是遵循固定教义。"},"examples":[{"en":"Pragmatism is often linked with antidogmatism because it focuses on what works in practice.","zh":"实用主义常与反教条主义相关，因为它关注实践中是否有效。"},{"en":"The writer’s antidogmatism shows in the way he presents multiple sides of an issue.","zh":"这位作家的反教条主义体现在他呈现问题多个角度的方式上。"}]}],"synonyms":["open-mindedness","non-dogmatism","skepticism","critical thinking"],"phonetic":"/ˌæn.tiˈdɔɡ.məˌtɪ.zəm/","extraExplanation":["“dogmatism（教条主义）”通常指不加质疑地坚持某种信条或权威观点；“anti-”表示“反对”。因此 antidogmatism 多用于学术写作、哲学讨论、教育与公共讨论语境。","它并不等于“没有立场”或“什么都对”（相对主义）。更常见的意思是：愿意根据证据与理由调整看法，避免把某一套观点当作永远正确。"]}
{"word":"antidogmatist","summary":{"en":"An antidogmatist is someone who resists rigid, unquestionable beliefs and prefers open-minded, evidence-based thinking.","zh":"antidogmatist 指反对僵化、不可质疑的教条，倾向于开放、基于证据思考的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposes dogmatism and prefers open-minded, evidence-based thinking rather than fixed, unquestionable beliefs","zh":"反教条主义者；反对武断与不容质疑的信条、主张开放与基于证据思考的人"},"examples":[{"en":"As an antidogmatist, she welcomed questions and changed her mind when new evidence appeared.","zh":"作为一名反教条主义者，她欢迎质疑，并在出现新证据时愿意改变想法。"},{"en":"The professor was known as an antidogmatist who encouraged debate instead of repeating one “correct” view.","zh":"那位教授以反教条主义者著称，他鼓励辩论，而不是重复某一种“唯一正确”的观点。"}]}],"synonyms":["non-dogmatist","skeptic","free thinker","open-minded person"],"phonetic":"/ˌæn.tiˈdɑɡ.mə.tɪst/","extraExplanation":["词源结构：anti-（反对）+ dogma（教条、信条）+ -ist（……主义者/从事者）。","用法提示：这个词偏正式、学术或评论性语境，日常更常见的表达是 “open-minded person（思想开放的人）” 或 “non-dogmatic thinker（不教条的思考者）”。","语义对比：antidogmatist 不是“没有原则”，而是强调观点应当可以被讨论、检验与修正；与 dogmatist（教条主义者）形成对照。"]}
{"word":"antidomestic","summary":{"en":"Antidomestic means “against home/family-centered life,” and more rarely “not domesticated.”","zh":"antidomestic 指“反家庭/反居家生活的”；更少见时也可指“非驯化的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to domestic life, home-centered values, or household concerns; favoring ideas or activities that reject the home as the main focus.","zh":"反家庭（生活）的；反对以家庭/居家为中心价值的。"},"examples":[{"en":"Her antidomestic attitude made her avoid settling down or focusing on household routines.","zh":"她反家庭的态度让她避免安定下来，也不愿把精力放在家务日常上。"},{"en":"In the novel, the hero’s antidomestic impulses push him to keep traveling instead of building a home.","zh":"在小说中，主人公反家庭的冲动促使他不断远行，而不是建立一个家。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not domesticated; not suited to living with humans (used rarely, usually in academic or specialized writing).","zh":"（很少用）非驯化的；不适合与人类共同生活的（多见于学术/专业语境）。"},"examples":[{"en":"Some species remain effectively antidomestic because they do not breed well in captivity.","zh":"有些物种实际上仍属于“非驯化”的，因为它们在圈养环境中不易繁殖。"}]}],"synonyms":["anti-domestic","against domesticity","non-domestic","undomesticated","unsettled"],"phonetic":"/ˌæn.ti.doʊˈmɛs.tɪk/","extraExplanation":["“antidomestic”不是常见日常词，更常用的表达有：anti-domestic、against domesticity、non-domestic（强调“非家用/非本土”）、undomesticated（强调“未驯化”）。写作时可根据语境选择更自然的词。","词根拆分：anti-（反对）+ domestic（家庭的/国内的）。在文学评论里，它有时用来描述人物或主题对“安家、婚姻、家庭角色”的抗拒。"]}
{"word":"antidomestically","summary":{"en":"“Antidomestically” means “in a way that goes against domestic (home-country or home-life) interests or concerns,” and it is a rare word.","zh":"“antidomestically”意为“以反对国内（本国或家庭）事务/利益的方式”，属于较少见的用词。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is opposed to domestic interests, domestic policy, or things within one’s own country/home; not domestically.","zh":"以反对国内（本国/本土/家庭）利益或国内事务的方式；非国内地。"},"examples":[{"en":"Some critics argued that the proposal would act antidomestically by hurting local workers.","zh":"一些批评者认为该提案会以“反国内”的方式运作，损害本地工人。"},{"en":"The company’s decision was seen as antidomestically focused, prioritizing overseas expansion over the home market.","zh":"该公司的决定被视为偏向“反国内”的取向，即优先海外扩张而非本国市场。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that goes against domestic life or home-centered values (rare).","zh":"以违背家庭生活或“以家为中心”的价值观的方式（较少见）。"},"examples":[{"en":"He spoke antidomestically, dismissing the importance of home life.","zh":"他以反家庭生活的口吻说话，贬低家庭生活的重要性。"}]}],"synonyms":["against domestic interests","anti-domestic","non-domestically","oppositionally toward domestic policy"],"phonetic":"/ˌæn.ti.dəˈmɛs.tɪ.kli/","extraExplanation":["这个词非常少见，多用于学术/评论语境。更常见的表达是：“against domestic interests/policy（反对国内利益/政策）”“anti-domestic（反国内的）”或“non-domestically（在国内之外/非在国内地）”。","构词上是 anti-（反对）+ domestically（在国内地/在家地）。注意：domestic 在不同语境可指“国内的/本国的”或“家庭的/家务的”，因此 antidomestically 也会随语境变化。"]}
{"word":"antidominican","summary":{"en":"“Antidominican/anti-Dominican” means opposed to Dominicans or the Dominican Republic, often implying prejudice or hostility.","zh":"“antidominican/anti-Dominican”指反对多米尼加人或多米尼加共和国，常带有偏见或敌意的含义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to Dominicans or the Dominican Republic; showing prejudice or hostility toward Dominican people, culture, or interests.","zh":"反多米尼加的；反对多米尼加人或多米尼加共和国的；对多米尼加人/文化/利益抱有偏见或敌意的。"},"examples":[{"en":"The report condemned anti-Dominican rhetoric during the campaign.","zh":"报告谴责了竞选期间的反多米尼加言论。"},{"en":"She spoke out against anti-Dominican discrimination in her community.","zh":"她公开反对社区中的反多米尼加歧视。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who is opposed to Dominicans or the Dominican Republic, especially in a prejudiced way.","zh":"反多米尼加的人；（尤指带偏见地）反对多米尼加人或多米尼加共和国的人。"},"examples":[{"en":"He was criticized for being an anti-Dominican and spreading stereotypes online.","zh":"他因成为反多米尼加者并在网上传播刻板印象而受到批评。"}]}],"synonyms":["anti-Dominican","anti–Dominican Republic","anti-DR (informal)","anti-immigrant (context-dependent)","xenophobic (context-dependent)"],"phonetic":"/ˌænti dəˈmɪnɪkən/","extraExplanation":["“anti-”表示“反对/抵制”，常用连字符写作 anti-Dominican。该词往往用于讨论偏见、排外或政治立场等敏感话题；在描述他人或群体时，最好基于事实与具体行为，避免给人贴标签或造成污名化。","注意区分：anti-Dominican（反对或敌视多米尼加人/多米尼加共和国）≠ anti-domestic（反家务/反国内的）等形近词。"]}
{"word":"antidora","summary":{"en":"Antidora is blessed bread distributed after an Eastern Orthodox service, especially to people who did not take Communion.","zh":"Antidora 指东正教礼仪后分发的祝福面包，常给未领圣体者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Eastern Orthodox Christianity) Blessed bread given to worshippers after the Divine Liturgy, especially to those who did not receive Holy Communion; also used as a sign of fellowship and blessing.","zh":"（东正教）礼仪后分发给信众的祝福面包，尤其给未领圣体者；也象征团契与祝福。"},"examples":[{"en":"After the service, she received antidora from the priest at the end of the line.","zh":"礼拜结束后，她在队伍末尾从神父那里领到了 antidora（祝福面包）。"},{"en":"Visitors are often offered antidora as a welcoming gesture, even if they are not Orthodox.","zh":"即使不是东正教徒，访客也常会被赠予 antidora 作为欢迎的表示。"},{"en":"He explained that antidora is blessed bread, not the same as receiving Communion.","zh":"他解释说，antidora 是被祝福的面包，并不等同于领圣体。"}]}],"synonyms":["antidoron","blessed bread"],"phonetic":"/ˌæn.tiˈdɔr.ə/","extraExplanation":["“Antidora”在英语里常被用作“antidoron”的复数形式或变体写法，来源于希腊语，字面意思是“代替礼物/回赠”。在东正教传统中，它通常是由献礼面包（prosphora）中未被祝圣为圣体的部分切下并祝福后分发。","文化语境上，antidora 常与“Divine Liturgy（神圣礼仪）”“Communion（领圣体）”一起出现：它是祝福与友爱的分享，但不被视为圣体本身。"]}
{"word":"Antidorcas","summary":{"en":"Antidorcas is the scientific genus name for the antelopes that include the springbok.","zh":"Antidorcas 是包含跳羚在内的一类非洲羚羊的科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of African antelopes best known for the springbok (Antidorcas marsupialis).","zh":"（动物）羚羊属；非洲羚羊的一个属，最著名的是跳羚（Antidorcas marsupialis）。"},"examples":[{"en":"The springbok belongs to the genus Antidorcas.","zh":"跳羚属于羚羊属（Antidorcas）。"},{"en":"Researchers tracked Antidorcas populations across the dry grasslands of southern Africa.","zh":"研究人员追踪了南部非洲干旱草原上的羚羊属（Antidorcas）种群。"}]}],"synonyms":["springbok (common name for the best-known species)"],"phonetic":"/ˌæntiˈdɔrkəs/","extraExplanation":["“Antidorcas”是学名（拉丁化的科学命名），常见于动物学、生态学和自然纪录片的文字说明中；日常英语里更常说“springbok（跳羚）”。","跳羚（springbok）是南非的国家象征之一；因此在体育与文化语境中，你更可能看到“Springboks”（南非橄榄球队昵称）而不是“Antidorcas”。"]}
{"word":"antidorcas","summary":{"en":"Antidorcas is the scientific genus name for the springbok and related antelopes in Africa.","zh":"Antidorcas 是非洲跳羚及其近缘羚羊的科学属名（属名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of African antelopes, best known for the species called the springbok (Antidorcas marsupialis).","zh":"一种非洲羚羊属（羚羊类动物的一个属），最著名的物种是跳羚（Antidorcas marsupialis）。"},"examples":[{"en":"The springbok belongs to the genus Antidorcas.","zh":"跳羚属于 Antidorcas（跳羚属）。"},{"en":"In older zoology books, you may see Antidorcas used as a scientific name.","zh":"在较早的动物学书籍里，你可能会看到 Antidorcas 作为学名出现。"}]}],"synonyms":["springbok (common name for Antidorcas marsupialis)"],"phonetic":"/ˌæn.tiˈdɔr.kəs/","extraExplanation":["Antidorcas 是拉丁化的动物学属名，常见于科学分类（属—种）体系中；日常英语里更常用 springbok（跳羚）来指具体动物。","在写作中，这类属名通常用斜体（Antidorcas），首字母大写；种名（如 Antidorcas marsupialis）第二个词小写。"]}
{"word":"antidoron","summary":{"en":"Antidoron is blessed (not consecrated) bread given out after an Eastern Orthodox liturgy, often to those who did not receive Communion.","zh":"Antidoron 指东正教礼拜后分发的祝福面包（非圣体），常给未领圣餐者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In the Eastern Orthodox Church, small pieces of blessed (but not consecrated) bread given to people after the Divine Liturgy, especially to those who did not receive Communion.","zh":"（东正教）礼拜后分发给会众的祝福面包小块（未被祝圣为圣体），常给未领圣餐者领取。"},"examples":[{"en":"After the service, the priest offered antidoron to the congregation at the door.","zh":"礼拜结束后，神父在门口把 antidoron 分发给会众。"},{"en":"She did not take Communion, but she received antidoron as a blessing.","zh":"她没有领圣餐，但领了 antidoron 作为祝福。"}]}],"synonyms":["blessed bread"],"phonetic":"ˌæn.tiˈdɔr.ɑn","extraExplanation":["antidoron 源自希腊语 anti-（“代替/作为替代”）+ doron（“礼物”），意思接近“代替的礼物”。它不是圣餐（圣体圣血），而是从献上的供饼中切下、被祝福后分给大家的一部分。","不同地区或堂区的具体做法可能略有差异；有些地方也会在礼拜之外的场合分发或让人带回家。称呼上也常与“blessed bread（祝福面包）”并用，帮助英语学习者理解其宗教语境。"]}
{"word":"antidotal","summary":{"en":"Antidotal means “related to an antidote” or “having the power to counteract harm,” literally or figuratively.","zh":"antidotal 指“与解毒剂有关的”或“具有对抗、缓解伤害作用的”，可用于字面或比喻含义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an antidote; able to prevent or counteract the effects of a poison, disease, or harmful influence.","zh":"与解毒剂有关的；具有解毒、对抗毒素/疾病或有害影响作用的。"},"examples":[{"en":"The doctor gave him an antidotal treatment after the snakebite.","zh":"被蛇咬伤后，医生给他进行了具有解毒作用的治疗。"},{"en":"Some activated charcoal products are used for their antidotal effects in certain poisonings.","zh":"某些活性炭产品在特定中毒情况下因其解毒效果而被使用。"},{"en":"In a more figurative sense, her kindness felt antidotal to the harsh criticism online.","zh":"更比喻地说，她的善意像是对网络严厉批评的一剂“解药”。"}]}],"synonyms":["antidote","antidote-like","counteracting","protective","remedial"],"phonetic":"/ˌæn.təˈdoʊ.t̬əl/","extraExplanation":["“antidotal”来自“antidote（解毒剂/解药）”。在医学语境中常搭配 treatment/therapy/effect（解毒治疗/疗法/作用）；在文学或日常表达中也可引申为“对某种负面事物起到对抗、缓解作用”的“解药式的”。"]}
{"word":"antidotally","summary":{"en":"“Anecdotally” means “according to personal stories or individual experience, not strong evidence.”","zh":"“anecdotally”表示“根据个人经历/个别例子（非严谨证据）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Based on personal stories or individual examples rather than on careful study, statistics, or solid proof.","zh":"基于个人故事或个别例子，而不是基于严谨研究、统计数据或可靠证据。"},"examples":[{"en":"Anecdotally, many students say they learn faster with short daily practice.","zh":"据传闻（或以个人经验来看），很多学生说每天短时间练习学得更快。"},{"en":"The medicine seems to help, but the evidence is mostly anecdotal.","zh":"这种药似乎有效，但证据大多只是轶事性的（缺乏严谨验证）。"}]}],"synonyms":["from personal experience","informally","according to reports","by word of mouth"],"phonetic":"/ˌænəkˈdoʊtəli/","extraExplanation":["“antidotally”通常被认为是拼写错误；你可能想写的是 **anecdotally**。","**anecdotally** 来自 *anecdote*（轶事、趣闻），强调“个案/听说/个人经验层面”。不要和 **antidote**（解药）混淆：*antidote* → *antidotal* 才与“解毒”相关。"]}
{"word":"antidotary","summary":{"en":"Antidotary is a rare, historical word meaning a collection/book of antidote recipes, and sometimes an adjective meaning ‘antidote-related.’","zh":"Antidotary 是较罕见的历史用语，主要指“解毒药方书/解毒处方集”，有时也作形容词表示“与解毒有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, historical) A book or collection of antidotes and medicinal recipes, especially for poisons.","zh":"（罕见／历史用语）解毒药方书；汇集解毒剂与药方的书（尤指针对毒物的处方集）。"},"examples":[{"en":"In the medieval library, the physician kept an antidotary alongside other medical texts.","zh":"在中世纪的藏书中，医师把一本解毒药方书和其他医学典籍放在一起。"},{"en":"The apothecary copied recipes from an antidotary to prepare remedies for poisoning.","zh":"药剂师从解毒药方书里抄录配方，用来配制中毒的解药。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) Relating to antidotes; used for counteracting poison.","zh":"（罕见）与解毒剂有关的；用于解毒的。"},"examples":[{"en":"The text describes several antidotary mixtures made from herbs and minerals.","zh":"这部文本描述了几种由草药和矿物配成的解毒混合剂。"}]}],"synonyms":["antidote book","pharmacopoeia (historical/near)","dispensatory (near)"],"phonetic":"/ˌæn.tiˈdoʊ.tə.ri/","extraExplanation":["“antidotary”多见于历史语境，尤其是中世纪与文艺复兴时期的医学传统，指收录解毒配方的“处方集/药典”。拉丁语中也常见相关形式“antidotarium”。现代英语里更常用的是“antidote（解药）”。"]}
{"word":"antidote","summary":{"en":"Antidote means a substance that counteracts poison, and figuratively, something that offsets a harmful influence.","zh":"Antidote 指“解毒剂/解毒药”，也可比喻为抵消负面影响的“解药”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medicine or substance that stops or reduces the harmful effects of a poison.","zh":"解毒剂；解毒药（用于阻止或减轻毒物的危害）"},"examples":[{"en":"There is no antidote for this snake’s venom, so doctors give supportive care.","zh":"这种蛇毒没有特效解毒剂，所以医生主要进行支持性治疗。"},{"en":"The doctor gave her an antidote to counteract the poisoning.","zh":"医生给了她解毒剂来对抗中毒。"}]},{"partOfSpeech":"n.","definition":{"en":"Something that prevents or corrects a bad situation, feeling, or influence (used figuratively).","zh":"（比喻）矫正或抵消不良影响的事物；“良药/解药”"},"examples":[{"en":"Laughter can be a good antidote to stress.","zh":"笑声可以是缓解压力的良药。"},{"en":"For loneliness, community is often the best antidote.","zh":"对抗孤独，社群往往是最好的“解药”。"}]}],"synonyms":["remedy","cure","counteragent","corrective"],"phonetic":"/ˈæn.təˌdoʊt/","extraExplanation":["“antidote”常用于医学与新闻语境，常见搭配有：an antidote for/to poison（某种毒的解毒剂）、administer/give an antidote（施用解毒剂）、no known antidote（暂无已知解毒剂）。","词源上来自希腊语，核心含义是“用来对抗（poison/害处）的东西”。因此它很自然地发展出比喻用法：把能抵消负面影响的事物称为“解药”。"]}
{"word":"antidote-like","summary":{"en":"“Antidote-like” means “like an antidote”—something that counteracts harm, literally or metaphorically.","zh":"“antidote-like”指“像解毒剂/解药一样”，能抵消或缓解不良影响，可字面也可比喻。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like an antidote; able to counteract or reduce a harmful effect (sometimes used metaphorically for emotional or social problems).","zh":"像解毒剂一样的；能抵消或减轻有害影响的（也常用于比喻情绪或社会问题的“对症之物”）。"},"examples":[{"en":"Fresh air and rest had an antidote-like effect on his exhaustion.","zh":"新鲜空气和休息对他的疲惫起到了“像解毒剂一样”的缓解作用。"},{"en":"Her humor was antidote-like in a tense meeting.","zh":"在紧张的会议中，她的幽默像“解毒剂”一样化解了气氛。"},{"en":"The policy is described as an antidote-like response to rising misinformation.","zh":"这项政策被形容为应对日益严重的虚假信息的“解药式”措施。"}]}],"synonyms":["curative","remedial","restorative","soothing","counteracting"],"phonetic":"/ˈæn.t̬əˌdoʊt laɪk/","extraExplanation":["“antidote-like”是由名词“antidote（解毒剂/解药）+ -like（像……一样）”构成的复合形容词。写作中常用来制造强调效果，表示“有对症、缓解、抵消之效”，尤其适合比喻压力、恐惧、偏见等非实体的“毒”。","连字符（-）常见于这种临时组合的形容词，尤其在名词后接“-like”时，用来让结构更清晰：antidote-like effect / antidote-like response。口语里也可能直接说“like an antidote”。"]}
{"word":"antidoted","summary":{"en":"“Antidoted” means “was counteracted/neutralized,” especially like treating poison with an antidote.","zh":"“antidoted”表示“被抵消/被中和”，常带“像用解药解毒那样对治”的意思。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense / past participle of “antidote”) to counteract the bad effects of something; to neutralize a poison, harm, or negative influence.","zh":"（动词“antidote”的过去式/过去分词）抵消、解除某事的不良影响；（尤指）中和毒素或危害。"},"examples":[{"en":"The poison was quickly antidoted with the right medicine.","zh":"用对了药，毒素很快被中和了。"},{"en":"Any bitterness in the story is antidoted by moments of humor.","zh":"故事里的苦涩被一些幽默片段冲淡了。"},{"en":"They tried to antidote the damage caused by the false rumor.","zh":"他们试图弥补这则谣言造成的伤害。"}]}],"synonyms":["counteracted","neutralized","offset","remedied","undid"],"phonetic":"ˈæn.tɪˌdoʊ.tɪd","extraExplanation":["“antidoted”作动词形式在现代英语里比较少见；更常用的说法是“counteracted / neutralized / offset / remedied”。在正式或文学表达中，用“antidote”作动词有一种“以解药对治”的修辞色彩。"]}
{"word":"antidotes","summary":{"en":"Antidotes are substances that counteract poisons, and the word can also mean a helpful remedy for a negative situation or feeling.","zh":"Antidotes 指“解毒剂/解药”，也可比喻为对抗负面情况或情绪的“良方”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medicine or substance that stops or reduces the harmful effects of a poison, drug, or toxin.","zh":"（解）解毒剂；用于抵消毒药、药物或毒素有害作用的药物/物质。"},"examples":[{"en":"The doctor gave her an antidote for the snake bite.","zh":"医生给她用了蛇咬伤的解毒剂。"},{"en":"There is an antidote to this poison, but it must be given quickly.","zh":"这种毒有解药，但必须尽快使用。"}]},{"partOfSpeech":"n.","definition":{"en":"Something that prevents a bad situation or feeling, or makes it less harmful (a figurative “cure”).","zh":"（比喻）对抗坏情况或负面情绪的办法；“良方”。"},"examples":[{"en":"Laughter can be an antidote to stress.","zh":"笑可以成为缓解压力的良方。"},{"en":"For many people, exercise is an antidote to anxiety.","zh":"对很多人来说，运动是对抗焦虑的办法。"}]}],"synonyms":["remedy","cure","counteragent","treatment","corrective"],"phonetic":"/ˈæn.təˌdoʊt/","extraExplanation":["“antidote”源自希腊语，含义接近“对抗（毒）之物”。在英语里既可指真正的“解毒剂”，也常用于比喻（如 antidote to fear/stress）。","你输入的“antidotes”是复数形式：one antidote / two antidotes。常见搭配：an antidote for poison；an antidote to boredom/stress。"]}
{"word":"antidotical","summary":{"en":"“Antidotical” is a rare/nonstandard form meaning “antidotal” (related to an antidote).","zh":"“antidotical”是罕见/不规范形式，意思相当于“antidotal”（与解毒剂有关、解毒的）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard/rare) Relating to an antidote; able to prevent or reduce the effects of a poison or harm. (More common: “antidotal.”)","zh":"（不标准/罕见）与解毒剂有关的；可起到解毒或减轻毒害作用的。（更常用拼写：antidotal。）"},"examples":[{"en":"The doctor administered an antidotal treatment after the snakebite.","zh":"医生在蛇咬伤后进行了抗毒/解毒治疗。"},{"en":"Activated charcoal is sometimes used for its antidotal effect in certain poisonings.","zh":"在某些中毒情况下，有时会使用活性炭来发挥其解毒作用。"}]}],"synonyms":["antidotal","antivenomous (specific to snake/spider venom)","counteractive"],"phonetic":"/ˌæn.tɪˈdoʊ.t̬ɪ.kəl/","extraExplanation":["“antidotical”在现代英语里很少见，通常被认为是拼写不规范或旧式用法。你更可能想写的是：\n- “antidotal” = 解毒的、与解毒剂有关的\n- “anecdotal” = 轶事性的、基于个人经历的（意思完全不同，写作中很常见）\n如果你告诉我你的句子语境，我可以帮你判断到底该用哪一个。"]}
{"word":"antidotically","summary":{"en":"Antidotically means “in a way that acts as an antidote,” usually in medical or scientific contexts.","zh":"antidotically 指“以解毒/对抗伤害的方式”，多见于医学或科学语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that serves as an antidote; counteracting a poison, harm, or negative effect.","zh":"以解毒（或对抗伤害）的方式；起到“解药/对策”作用地。"},"examples":[{"en":"The drug works antidotically against certain snake venoms.","zh":"这种药对某些蛇毒起解毒作用。"},{"en":"In theory, the treatment acts antidotically by blocking the toxin’s effect.","zh":"理论上，这种治疗通过阻断毒素作用来发挥解毒效果。"}]}],"synonyms":["as an antidote","counteractively","as a countermeasure"],"phonetic":"/ˌæn.təˈdɑː.tɪ.kli/","extraExplanation":["“antidotically”非常少见，多用于医学/药理学语境。日常英语里更常见的说法是“as an antidote”“as a countermeasure”或“to counteract…”。","很多人会把它拼成/看成“anecdotally（根据轶事地）”。两者意思完全不同：anecdotally=基于个人故事或零散例子；antidotically=像解药一样对抗有害影响。"]}
{"word":"antidoting","summary":{"en":"“Antidoting” means giving an antidote or counteracting a harmful effect (rare as a verb form).","zh":"“antidoting”指给予解毒剂或抵消有害影响（作为动词形式较少见）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(rare) Giving an antidote to treat poison or a harmful substance; counteracting a harmful effect.","zh":"（罕见）给予解毒剂以治疗中毒；抵消有害影响。"},"examples":[{"en":"The doctor focused on antidoting the poison as quickly as possible.","zh":"医生专注于尽快用解毒剂处理毒物。"},{"en":"Good ventilation can help with antidoting the effects of strong chemical fumes.","zh":"良好通风有助于减轻（抵消）强烈化学烟雾的影响。"}]}],"synonyms":["counteracting","neutralizing","treating (with an antidote)","mitigating"],"phonetic":"/ˈæn.tɪˌdoʊ.tɪŋ/","extraExplanation":["“antidoting”是动词“to antidote”的现在分词/动名词形式，但在现代英语里“antidote”更常用作名词（an antidote）。要表达“给解毒剂/用解毒剂治疗”，更自然的说法是“give/administer an antidote”或“treat with an antidote”。","在引申义上，英语更常用“counteract / offset / mitigate”来表示“抵消不良影响”，因此写作或口语中很少用“antidote”作动词。"]}
{"word":"antidotism","summary":{"en":"Antidotism is a rare word meaning the practice of using antidotes—counteracting poison or harm with a remedy.","zh":"Antidotism 是个很少见的词，意思是“解毒的做法/原理”，即用解毒剂或补救办法来对抗毒性或伤害。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the practice or principle of using an antidote; counteracting poison or harm with a remedy.","zh":"使用解毒剂（或解药）的做法或原理；用补救办法来对抗毒性或伤害。"},"examples":[{"en":"In cases of poisoning, antidotism focuses on giving the correct antidote as quickly as possible.","zh":"在中毒情况下，antidotism 强调尽快使用正确的解毒剂。"},{"en":"The report discussed modern antidotism for pesticide exposure.","zh":"报告讨论了针对农药暴露的现代解毒治疗（antidotism）。"}]}],"synonyms":["antidotal treatment","detoxification","counteraction"],"phonetic":"/ænˈtɪdətɪzəm/","extraExplanation":["这个词非常少见，多见于较旧的医学/毒理学语境。日常英语里更常用的是 antidote（解毒剂/解药）或 antidotal treatment（解毒治疗）。","词形结构：antidote（解毒剂）+ -ism（表示“主义/做法/体系”）。因此 antidotism 表示“解毒的做法/体系”，而不是某一种具体药物。"]}
{"word":"antidraft","summary":{"en":"Antidraft means preventing cold air drafts, or a device/material used to block drafts around doors or windows.","zh":"antidraft 指“防穿堂风的”，也可指“用于堵风的装置或材料”，常见于门窗缝隙处。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"designed to stop or reduce cold air coming in through gaps (for example around doors or windows).","zh":"用于阻止或减少冷风（穿堂风）从缝隙（如门窗边）进入的；防穿堂风的。"},"examples":[{"en":"We installed an antidraft strip under the front door to keep the hallway warm.","zh":"我们在前门下面装了防穿堂风密封条，让走廊更暖和。"},{"en":"Antidraft windows can make a room quieter and more energy-efficient.","zh":"防穿堂风的窗户能让房间更安静，也更节能。"}]},{"partOfSpeech":"n.","definition":{"en":"a thing or material used to block drafts, such as a seal, strip, or stopper.","zh":"用于堵风、防穿堂风的物品或材料（如密封条、挡风条、门缝挡风器）。"},"examples":[{"en":"A simple antidraft can reduce heating costs in winter.","zh":"一个简单的防风装置就能在冬天减少取暖费用。"},{"en":"She put an antidraft at the bottom of the window frame.","zh":"她在窗框底部放了一个挡风的东西。"}]}],"synonyms":["draft-proof","draughtproof","weatherproof","sealed"],"phonetic":"/ˌæn.tiˈdræft/","extraExplanation":["这个词更常见的写法是带连字符的“anti-draft”。在英式英语里也常写作“anti-draught”，其中 draught = draft（穿堂风）。在日常表达中，人们更常说“draft-proof / draught-proof”“weatherstripping（门窗密封条）”或“draft stopper（门缝挡风器）”。"]}
{"word":"antidrag","summary":{"en":"“Antidrag” means drag-reducing; it can describe something designed to cut air/water resistance or refer to a drag-reducing feature.","zh":"“antidrag”表示“减阻/抗阻力的”；可作形容词描述减少空气/水阻的设计，也可作名词指减阻结构或技术。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"designed to reduce drag (air or water resistance) and help something move more easily through air or water.","zh":"用于减少阻力（空气或水的阻力），让物体更顺畅地在空气或水中运动的。"},"examples":[{"en":"The bike’s antidrag frame shape helps the rider go faster with less effort.","zh":"这辆自行车的抗阻力车架造型能让骑手用更少的力骑得更快。"},{"en":"Engineers tested an antidrag coating to reduce friction on the ship’s hull.","zh":"工程师测试了一种抗阻力涂层，用来减少船体的摩擦阻力。"}]},{"partOfSpeech":"n.","definition":{"en":"a feature, part, or technology that reduces drag.","zh":"用于降低阻力的结构、部件或技术。"},"examples":[{"en":"The new spoiler is an antidrag that improves airflow around the car.","zh":"这个新扰流板是一种减阻装置，能改善汽车周围的气流。"},{"en":"They added several antidrag elements to the drone to extend its battery life.","zh":"他们给无人机加了几处减阻设计，以延长续航。"}]}],"synonyms":["drag-reducing","low-drag","aerodynamic","streamlined"],"phonetic":"/ˌæntiˈdræɡ/","extraExplanation":["“antidrag”不是最常见的标准词形；更常见的写法是带连字符的“anti-drag”，或直接用“drag-reducing / low-drag / aerodynamic（空气动力学的）”。在工程、车辆与运动装备语境里更常见。"]}
{"word":"antidromal","summary":{"en":"Antidromal means a nerve signal traveling in the opposite (reverse) direction from normal.","zh":"Antidromal 指神经信号沿着与正常相反的方向（逆行）传导。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a nerve impulse or signal) traveling in the opposite direction from the usual or normal pathway, especially from the axon toward the cell body.","zh":"（指神经冲动或信号）以与通常方向相反的方式传导，尤指从轴突向细胞体方向传导。"},"examples":[{"en":"The researcher recorded antidromal spikes by stimulating the peripheral nerve.","zh":"研究人员通过刺激周围神经记录到了逆行（antidromal）放电。"},{"en":"Antidromal conduction can help confirm whether a pathway is intact.","zh":"逆行传导有助于确认某条通路是否完整。"}]}],"synonyms":["reverse-direction","retrograde","antidromic"],"phonetic":"/ˌæn.tɪˈdroʊ.məl/","extraExplanation":["词源上，antidromal 来自 anti-（“反向、相对”）+ dromos（希腊语，意为“跑道/奔跑”），合起来有“朝相反方向跑”的感觉。","在神经科学/生理学里，它常与 orthodromal（顺行、正常方向传导）对比使用：orthodromal 通常指从细胞体→轴突末梢；antidromal 则指从轴突末梢→细胞体。","这个词在日常英语中很少见，主要出现在医学、神经电生理、研究论文和实验记录里。"]}
{"word":"antidromic","summary":{"en":"Antidromic means moving or conducted in the opposite direction from normal, especially for nerve signals.","zh":"Antidromic 指“逆向的”，尤指神经信号等以与正常方向相反的方式传导。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Especially in neuroscience) moving or conducted in the opposite direction to what is usual or expected.","zh":"（尤用于神经科学）以与通常或预期相反的方向移动或传导的；逆行的。"},"examples":[{"en":"The researchers measured antidromic impulses traveling from the axon back toward the cell body.","zh":"研究人员测量了沿轴突从末梢向细胞体逆向传播的（antidromic）神经冲动。"},{"en":"Antidromic stimulation can help identify which neurons connect to a specific pathway.","zh":"逆行刺激（antidromic stimulation）可帮助确认哪些神经元与某一特定通路相连接。"}]},{"partOfSpeech":"adj.","definition":{"en":"More generally: going against a normal route, flow, or sequence; counter-directional.","zh":"更广义：逆着常规路线、流向或顺序进行的；反向的。"},"examples":[{"en":"In the diagram, the antidromic arrows mark the return flow back to the source.","zh":"在图示中，标为 antidromic 的箭头表示回流方向，即回到源头。"}]}],"synonyms":["reverse","backward","counter-directional","retrograde"],"phonetic":"/ˌæn.tiˈdrɑː.mɪk/","extraExplanation":["词源：anti-（反、逆）+ dromos（希腊语“跑道/行进路线”），字面意思是“沿相反的路线行进”。","常见搭配：antidromic conduction（逆行传导）、antidromic impulse（逆行冲动）、antidromic stimulation（逆行刺激）。与 orthodromic（顺行的、按正常方向的）相对。","该词偏学术/技术用语，日常英语中较少见，多出现在神经生理学、医学或技术图解语境中。"]}
{"word":"antidromically","summary":{"en":"Antidromically means “in the opposite direction,” especially describing backward nerve-signal travel.","zh":"antidromically 指“向相反方向地”，尤指神经信号的逆行传导。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In the opposite direction (especially used in biology/medicine for signals that travel backward from the usual direction).","zh":"向相反方向地（尤用于生物/医学，指信号或传导方向与通常方向相反）。"},"examples":[{"en":"In some experiments, the nerve impulse can travel antidromically toward the cell body.","zh":"在一些实验中，神经冲动可以以逆行（antidromically）的方式朝细胞体方向传导。"},{"en":"The researchers stimulated the pathway and recorded antidromically evoked responses.","zh":"研究人员刺激该通路并记录了逆行诱发的反应。"}]}],"synonyms":["in reverse","backward","oppositely"],"phonetic":"/ˌæn.tiˈdrɑː.mɪk.li/","extraExplanation":["“antidromically”来自 anti-（反、对立）+ dromos（希腊语“跑道/运行路线”），字面意思是“沿相反路线运行”。在神经科学里常与 orthodromically（顺行地）成对出现：顺行通常指从神经元胞体→轴突末梢的正常传导方向；逆行则指从轴突末梢→胞体的方向。"]}
{"word":"antidromous","summary":{"en":"Antidromous means “going in the opposite direction,” especially used for nerve impulses traveling backward.","zh":"antidromous 指“逆向的/反向传导的”，尤用于描述神经冲动沿相反方向传播。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology, especially neuroscience) Moving or conducted in the opposite direction to what is normal or expected (for example, a nerve impulse traveling backward along a nerve).","zh":"（生物学，尤指神经科学）与正常或预期方向相反地移动或传导（例如神经冲动沿神经纤维“逆向”传播）。"},"examples":[{"en":"Researchers recorded an antidromous action potential traveling back toward the cell body.","zh":"研究人员记录到一个逆向（antidromous）的动作电位向细胞体方向回传。"},{"en":"Antidromous stimulation can help identify which neuron a nerve fiber belongs to.","zh":"逆向刺激可帮助确认某条神经纤维属于哪一个神经元。"}]}],"synonyms":["antidromic","reverse-direction","backward-conducting"],"phonetic":"/ænˈtɪdrəməs/","extraExplanation":["词源上，anti- 表示“反/逆”，-dromous 来自希腊语 dromos（“跑道、奔跑”），合起来就是“逆向奔跑/逆向传导”的意思。","在神经生理学里更常见的形式是 antidromic（同义形容词），常与 orthodromic（顺向、正常方向）成对出现。"]}
{"word":"antidromy","summary":{"en":"Antidromy means nerve signals traveling in the opposite direction from normal.","zh":"Antidromy 指神经信号以与正常相反的方向进行传导。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Physiology/neurology) The conduction of a nerve impulse in the reverse (opposite) direction from normal.","zh":"（生理/神经学）神经冲动沿着与正常方向相反的方向传导。"},"examples":[{"en":"Researchers used electrical stimulation to trigger antidromy in sensory nerves.","zh":"研究人员用电刺激在感觉神经中诱发逆行传导（antidromy）。"},{"en":"In most pathways, signals travel one way, but antidromy can be produced experimentally.","zh":"在大多数通路中，信号单向传播，但逆行传导可以在实验中被诱导出来。"}]}],"synonyms":["antidromic conduction","reverse conduction"],"phonetic":"/ˌæn.tɪˈdrɑː.mi/","extraExplanation":["该词较少见，多见于神经生理学文献。词源来自希腊语：anti-（“反、相对”）+ dromos（“跑道、运行”），字面可理解为“反向运行”。常与 antidromic（形容词，“逆行的”）以及 orthodromic（“顺行的”）对照使用。"]}
{"word":"antidrug","summary":{"en":"“Antidrug” describes actions, programs, or attitudes that oppose or prevent illegal drug use.","zh":"“antidrug”指反对或预防非法毒品使用的行为、项目或态度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposing or intended to prevent the use, sale, or effects of illegal drugs.","zh":"反毒的；旨在反对或预防非法毒品的使用、贩卖或危害的。"},"examples":[{"en":"Our school runs an antidrug education program.","zh":"我们学校开展反毒教育项目。"},{"en":"The city launched an antidrug campaign on social media.","zh":"该市在社交媒体上发起了反毒宣传活动。"},{"en":"They work with antidrug groups to help teens stay safe.","zh":"他们与反毒团体合作，帮助青少年远离毒品。"}]}],"synonyms":["anti-drug","drug-prevention","drug-free (context-dependent)"],"phonetic":"/ˌæn.tiˈdrʌɡ/","extraExplanation":["“antidrug”由前缀 anti-（反对、抵制）+ drug（毒品/药物）构成，常见于新闻与公共政策语境。更常见的拼写是带连字符的 “anti-drug”。","搭配很常见：anti-drug campaign（反毒宣传活动）、anti-drug education（反毒教育）、anti-drug policy/law（反毒政策/法律）、anti-drug program（反毒项目）。在正式写作中通常建议用连字符让结构更清晰。"]}
{"word":"antiduke","summary":{"en":"“Antiduke” means someone who opposes a duke or a duke’s power (often written as “anti-duke”).","zh":"“antiduke”指反对公爵或公爵权力的人/势力（常写作“anti-duke”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or group that opposes a duke (or the power of a duke), especially in political or historical discussion; an anti-duke figure.","zh":"反对公爵（或公爵权力）的人或团体；尤用于政治或历史语境中的“反公爵”人物/势力。"},"examples":[{"en":"During the succession dispute, the antiduke faction tried to limit the duke’s authority.","zh":"在继承权争端中，反公爵派试图限制公爵的权力。"},{"en":"In the novel, the antiduke becomes a symbol of resistance to the old nobility.","zh":"在小说里，“反公爵”成了反抗旧贵族的象征。"}]}],"synonyms":["anti-duke","opponent of the duke","anti-aristocrat"],"phonetic":"/ˌæn.tiˈduk/","extraExplanation":["“antiduke”并不是常见词，更常见的写法是带连字符的“anti-duke”。它多见于历史评论、政治写作，或奇幻/架空作品里，用来指“反对某位公爵或其统治的人”。","构词法：anti- 表示“反对/对抗”，duke 表示“公爵”。类似结构还有 anti-king（反对国王的）、anti-monarchist（反君主主义者）。"]}
{"word":"antidumping","summary":{"en":"Antidumping refers to laws or measures that stop or punish unfairly low-priced exports (“dumping”), often through extra import duties.","zh":"Antidumping（反倾销）指用法律或措施制止/惩罚不公平低价出口（倾销），常通过加征反倾销税实现。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(International trade) A policy or legal action used to prevent or respond to “dumping,” when a company exports goods at an unfairly low price (often below the home-market price or even below cost) to gain market share.","zh":"（国际贸易）“反倾销”的政策或法律行动，用来防止或应对“倾销”：企业以不公平的低价（常低于本国市场价格，甚至低于成本）向国外出口商品以抢占市场。"},"examples":[{"en":"The government imposed antidumping duties on imported steel after an investigation found unfair pricing.","zh":"在调查发现存在不公平定价后，政府对进口钢铁征收了反倾销税。"},{"en":"Local producers filed an antidumping complaint, arguing that the low-priced imports were hurting their business.","zh":"本地生产商提出反倾销申诉，称低价进口商品正在损害他们的生意。"}]},{"partOfSpeech":"n.","definition":{"en":"A type of trade measure, such as an antidumping duty (extra tax) added to imports found to be dumped.","zh":"一种贸易救济措施，例如对被认定为倾销的进口商品加征反倾销税（额外关税）。"},"examples":[{"en":"Antidumping measures can raise the final price of imported goods.","zh":"反倾销措施可能会抬高进口商品的最终价格。"},{"en":"The company adjusted its pricing to avoid triggering antidumping actions.","zh":"该公司调整定价以避免触发反倾销行动。"}]}],"synonyms":["anti-dumping","antidumping duty","trade remedy"],"phonetic":"/ˌæn.tiˈdʌm.pɪŋ/","extraExplanation":["“dumping（倾销）”并不只是“便宜卖”。在贸易法语境里，通常要通过调查来判定是否存在：①低于正常价值（如本国市场价）销售；②对进口国相关产业造成“实质损害”（material injury）。满足这些条件时，才可能征收“antidumping duties（反倾销税）”。","常见搭配：antidumping duty（反倾销税）；antidumping investigation（反倾销调查）；antidumping petition/complaint（反倾销申请/申诉）；countervailing duty（反补贴税，针对补贴而非低价倾销）。"]}
{"word":"antidynamic","summary":{"en":"“Antidynamic” means not dynamic, or tending to reduce/oppose movement or change.","zh":"“antidynamic”指“非动态的”，或“抑制/抵消运动与变化的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not dynamic; not changing, moving, or developing much.","zh":"非动态的；不怎么变化、运动或发展的。"},"examples":[{"en":"The interface feels antidynamic because nothing reacts when you click.","zh":"这个界面让人感觉很“非动态”，因为你点击时几乎没有反馈。"},{"en":"Her antidynamic routine stayed the same every day.","zh":"她的日常很“非动态”，每天都差不多。"}]},{"partOfSpeech":"adj.","definition":{"en":"(technical) designed to reduce or oppose movement, change, or force in a system.","zh":"（专业用语）用于减少或抵消系统中的运动、变化或作用力的。"},"examples":[{"en":"Engineers added an antidynamic element to limit vibration.","zh":"工程师加入了一个“抑制动态”的部件来限制振动。"},{"en":"The policy was criticized as antidynamic because it discouraged innovation.","zh":"该政策被批评为“抑制活力/抑制变化”，因为它打击创新。"}]}],"synonyms":["static","non-dynamic","unchanging","inert","rigid"],"phonetic":"/ˌænti daɪˈnæmɪk/","extraExplanation":["“antidynamic”不是日常高频词，更常见的表达是“static / non-dynamic / unchanging（静态的/非动态的/不变的）”。在学术或评论语境中，它也可带有评价色彩，暗示“缺乏活力、抑制变化或创新”。","构词法：anti-（反、对抗）+ dynamic（动态的、有活力的）。在写作中加连字符“anti-dynamic”更常见一些，尤其在较正式或技术性的文本里。"]}
{"word":"antidynastic","summary":{"en":"Antidynastic means opposed to a dynasty or dynastic (hereditary) rule.","zh":"antidynastic 指“反对王朝或世袭统治的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to a dynasty or dynastic rule (government passed down through a ruling family).","zh":"反对王朝或世袭统治的（反对由统治家族世代相传的政权）。"},"examples":[{"en":"The revolutionaries published antidynastic pamphlets calling for an elected government.","zh":"革命者发表了反王朝的小册子，呼吁建立民选政府。"},{"en":"Her antidynastic views made her critical of royal succession.","zh":"她的反世袭观点使她对王位继承制度持批评态度。"}]}],"synonyms":["anti-monarchical","anti-monarchy","anti-royalist","republican (in the sense of favoring a republic)"],"phonetic":"/ˌæn.ti.daɪˈnæs.tɪk/","extraExplanation":["这个词非常少见、偏学术或历史写作中使用。日常英语更常说 anti-monarchy（反君主制的）、anti-royalist（反保皇/反王党）、anti-dynasty 或 simply “against dynastic rule”（反对世袭统治）。","词形构成：anti-（反对）+ dynastic（王朝的/世袭的）。常出现在讨论法国大革命、清末民初、或其他反对世袭体制的政治运动的语境中。"]}
{"word":"antidynastical","summary":{"en":"Antidynastical means against dynasties or hereditary family rule.","zh":"antidynastical 指“反对王朝或世袭家族统治的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to dynasties or dynastic rule (rule passed down through a family, such as a monarchy).","zh":"反对王朝（或家族世袭）统治的；反对以家族继承为基础的政权的。"},"examples":[{"en":"The group’s antidynastical platform called for elected leaders instead of hereditary rulers.","zh":"该团体的反王朝纲领主张由选举产生的领导人取代世袭统治者。"},{"en":"Some antidynastical writers criticized politics that treated power like a family inheritance.","zh":"一些反王朝的作家批评把权力当作家族遗产来传承的政治做法。"}]}],"synonyms":["anti-dynastic","anti-monarchical","anti-hereditary","republican (in some contexts)"],"phonetic":"ˌæn.ti.daɪˈnæs.tɪ.kəl","extraExplanation":["这个词比较少见，常用于政治或历史语境。构词上是 anti-（反对）+ dynastic（王朝的、世袭的）+ -al（形容词后缀），意思与 “anti-monarchical（反君主制的）/ anti-hereditary（反世袭的）” 接近，但更强调“王朝/家族传承的统治结构”。","使用时通常修饰抽象名词，如 antidynastical movement（反王朝运动）、antidynastical sentiment（反王朝情绪）、antidynastical politics（反王朝政治）。"]}
{"word":"antidynastically","summary":{"en":"“Antidynastically” means “in a way that opposes dynastic (hereditary) rule.”","zh":"“antidynastically”表示“以反对王朝/世袭统治的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that opposes dynasties—especially hereditary monarchy or hereditary political rule.","zh":"以反对王朝（尤其是世袭君主制或世袭政治统治）的方式；反王朝地。"},"examples":[{"en":"The pamphlet argued antidynastically, calling for elected leaders instead of hereditary rulers.","zh":"这本小册子以反王朝的立场论述，呼吁由选举产生的领导人取代世袭统治者。"},{"en":"Many reformers wrote antidynastically during periods of revolution.","zh":"在革命时期，许多改革者以反王朝的观点写作。"}]}],"synonyms":["anti-monarchically","anti-hereditarily (rare)","republicanly (context-dependent)"],"phonetic":"/ˌæn.ti.daɪˈnæs.tɪ.kli/","extraExplanation":["这是一个很少见、偏书面/学术的副词：anti-（反对）+ dynastic（王朝的、世袭统治的）+ -ally（副词后缀）。通常用于讨论政治制度（如君主制、世袭政权）或历史运动（革命、共和主义）。日常英语里更常说：in an anti-monarchist / anti-dynasty way，或直接用 anti-dynastic（形容词）来修饰名词。"]}
{"word":"antidynasty","summary":{"en":"“Antidynasty” means opposing a dynasty or dynastic (hereditary) rule; it can also refer to a person or movement that opposes such rule.","zh":"“antidynasty”指反对王朝或世袭统治的（形容词），也可指反对王朝统治的人/派别/运动（名词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to a dynasty or dynastic rule (hereditary monarchy).","zh":"反对王朝或世袭统治的；反对君主世袭制度的。"},"examples":[{"en":"The pamphlet argued for an antidynasty government chosen by elections.","zh":"这本小册子主张建立一个反对王朝统治、由选举产生的政府。"},{"en":"Some antidynasty activists called for an end to hereditary power.","zh":"一些反对王朝统治的活动人士呼吁终结世袭权力。"}]},{"partOfSpeech":"n.","definition":{"en":"a person, movement, or idea that opposes dynastic rule.","zh":"反王朝统治者；反对王朝统治的运动或观点。"},"examples":[{"en":"He was labeled an antidynasty during the political turmoil.","zh":"在政治动荡时期，他被贴上“反王朝统治者”的标签。"},{"en":"The antidynasty demanded constitutional limits on the royal family.","zh":"反王朝派要求对王室权力进行宪法限制。"}]}],"synonyms":["anti-dynastic","anti-monarchy","anti-royalist","republican (context-dependent)"],"phonetic":"/ˌæn.tiˈdaɪ.nə.sti/","extraExplanation":["“antidynasty”不是日常英语里的常用词，更常见的表达是：anti-monarchy（反君主制）、anti-dynastic（反王朝的）、republican（主张共和的，视语境而定）。","构词法：anti-（反对）+ dynasty（王朝/世袭统治）。在历史、政治评论或翻译语境中可能出现，用来强调“反对世袭政权/王朝正统性”。"]}
{"word":"antidyscratic","summary":{"en":"“Antidyscratic” is not a standard word; you probably mean “idiosyncratic,” meaning uniquely peculiar to a person or group.","zh":"“antidyscratic”不是标准英语词；你可能想写“idiosyncratic”，意思是某个人或群体特有的、独特而有点特别的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended: idiosyncratic) Having a person’s own unusual habits, style, or characteristics; peculiar in a way that is specific to one person or group.","zh":"（可能想写：idiosyncratic）指某个人或群体特有的、与众不同的习惯、风格或特点；独特而有点“怪”的。"},"examples":[{"en":"Her writing style is idiosyncratic—full of short, unexpected sentences.","zh":"她的写作风格很有个人特色——句子短而出人意料。"},{"en":"The company has an idiosyncratic way of doing meetings, but it works for them.","zh":"这家公司开会的方式很特别，但对他们来说很有效。"},{"en":"He’s known for his idiosyncratic sense of humor.","zh":"他以自己独特的幽默感而出名。"}]}],"synonyms":["peculiar","distinctive","quirky","unusual","characteristic"],"phonetic":"/ˌɪdioʊsɪŋˈkrætɪk/","extraExplanation":["“antidyscratic”不是常见英语单词，通常是把 **idiosyncratic** 拼错了（常见错拼：*idiosyncractic / idiosyncratic*）。","**idiosyncratic** 来自 *idiosyncrasy*（个人癖好/特性）。在语气上多为中性，有时带一点轻微的调侃，表示“很有个人特色、与众不同”。"]}
{"word":"antidysenteric","summary":{"en":"Antidysenteric means “against dysentery”—describing or referring to a drug used to prevent or treat dysentery.","zh":"antidysenteric 意为“抗痢疾的/抗痢疾药”，用于描述或指代预防或治疗痢疾的药物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Used to prevent or treat dysentery (a serious intestinal infection that causes severe diarrhea, often with blood).","zh":"用于预防或治疗痢疾（严重的肠道感染，可导致剧烈腹泻，常伴血便）。"},"examples":[{"en":"The clinic stocked antidysenteric medicines for outbreaks of severe diarrhea.","zh":"诊所储备了抗痢疾药物，以应对严重腹泻的暴发。"},{"en":"In older medical texts, some herbal remedies were described as antidysenteric.","zh":"在较早的医学文献中，一些草药疗法被描述为抗痢疾的。"}]},{"partOfSpeech":"n.","definition":{"en":"A medicine or substance that prevents or treats dysentery.","zh":"抗痢疾药；用于预防或治疗痢疾的药物或物质。"},"examples":[{"en":"Oral rehydration is essential, and an antidysenteric may be added if a doctor recommends it.","zh":"口服补液很关键；若医生建议，也可能加用抗痢疾药。"}]}],"synonyms":["anti-dysentery","antidiarrheal (broader)","antimicrobial (sometimes, depending on cause)"],"phonetic":"/ˌæn.ti.dɪs.ənˈtɛr.ɪk/","extraExplanation":["这是一个较少见、偏医学/药学的词，多见于旧式医学写作或药品分类中。现代临床语境里更常直接说“treatment for dysentery（痢疾治疗）”或具体药名。","构词法：anti-（反、抗）+ dysentery（痢疾）+ -ic（形容词后缀），字面意思就是“抗痢疾的”。"]}
{"word":"antidysrhythmic","summary":{"en":"Antidysrhythmic means “used to prevent or treat abnormal heart rhythms.”","zh":"antidysrhythmic 指“用于预防或治疗心律失常的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Preventing, correcting, or treating an abnormal heart rhythm (arrhythmia).","zh":"（医学）用于预防、纠正或治疗心律失常（心律不齐）的。"},"examples":[{"en":"Amiodarone is an antidysrhythmic drug used to control certain dangerous arrhythmias.","zh":"胺碘酮是一种抗心律失常药，用于控制某些危险的心律失常。"},{"en":"The doctor prescribed an antidysrhythmic medication after the patient’s irregular heartbeat was confirmed.","zh":"在确认患者心律不齐后，医生开了抗心律失常药物。"}]}],"synonyms":["antiarrhythmic","anti-dysrhythmic"],"phonetic":"/ˌæn(t)iˌdɪsˈrɪðmɪk/","extraExplanation":["“antidysrhythmic”主要见于临床或药理学语境，日常与考试中更常见、更标准的同义词是“antiarrhythmic（抗心律失常的）”。","词形拆解有助记忆：anti-（反、抗）+ dys-（不正常）+ rhythmic（有节律的）→“对抗不正常节律”。","这类药物通常指用于处理心脏节律问题的药（如β受体阻滞剂、钠/钾/钙通道阻滞剂、胺碘酮等）；具体用药需严格遵医嘱，因为可能有副作用或相互作用。"]}
{"word":"antidysuric","summary":{"en":"Antidysuric means ‘used to relieve or prevent painful/difficult urination.’","zh":"antidysuric 指“用于缓解或预防尿痛/排尿困难”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relieving or preventing dysuria (painful or difficult urination).","zh":"缓解或预防排尿困难/排尿疼痛（尿痛，dysuria）的。"},"examples":[{"en":"The doctor prescribed an antidysuric medication to reduce burning during urination.","zh":"医生开了抗尿痛药物来减轻排尿时的灼痛感。"},{"en":"Some herbal teas are advertised as antidysuric, but evidence varies.","zh":"有些草本茶被宣传为“抗尿痛”，但证据强弱不一。"}]}],"synonyms":["urinary analgesic","pain-relieving for urination","anti-dysuria (rare)"],"phonetic":"ˌæntiˌdɪˈzjʊrɪk","extraExplanation":["这是医学用词，通常出现在药理学或处方说明中：anti-（对抗/抑制）+ dysuria（尿痛、排尿困难）+ -ic（……的）。日常英语里更常说“medicine for painful urination / to relieve urinary burning”。","“antidysuric”描述的是作用或用途，不指具体某一种药；常见相关治疗可能包括镇痛、抗炎或针对感染的抗生素（是否使用取决于病因）。"]}

