{"word":"antilabor","summary":{"en":"“Antilabor” describes actions or ideas that oppose workers, unions, or pro-worker policies.","zh":"“antilabor”指反对工人/工会或亲劳工政策、对劳工不利的立场或做法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to workers, labor unions, or pro-worker policies; favoring employers over labor.","zh":"反对工人、劳工/工会或亲劳工政策的；偏向雇主、对劳工不利的。"},"examples":[{"en":"The union called the new law an antilabor measure.","zh":"工会称这项新法律为反劳工措施。"},{"en":"Critics say the company has an antilabor culture that discourages organizing.","zh":"批评者说这家公司有一种反劳工的文化，阻止员工组织起来。"},{"en":"He was accused of taking antilabor positions during the campaign.","zh":"他在竞选期间被指责采取反劳工立场。"}]}],"synonyms":["anti-union","pro-management","anti-worker"],"phonetic":"/ˌæntiˈleɪbɚ/","extraExplanation":["“antilabor”常见于美国政治与新闻语境：用来批评某些法律、政客或企业的做法被认为削弱工会力量、降低劳工谈判权，或减少福利与保护。","写作上常见两种拼写：连字符形式“anti-labor”更常见；合写“antilabor”也能见到。","注意语气：该词通常带有评价色彩（偏贬义），使用时要留意立场与语境。"]}
{"word":"antilaborist","summary":{"en":"Antilaborist means against labor unions or labor movements (or a person who is against them).","zh":"antilaborist 指反对工会或劳工运动的（也可指反对者本人）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to labor unions, worker organizing, or pro-worker policies (often used in politics or business).","zh":"反对工会、工人组织或亲劳工政策的（常用于政治或商业语境）。"},"examples":[{"en":"The senator was criticized for taking an antilaborist stance on collective bargaining.","zh":"这位参议员因在集体谈判问题上采取反劳工立场而受到批评。"},{"en":"Some newspapers described the new law as antilaborist because it made strikes harder to organize.","zh":"一些报纸称这项新法律“反劳工”，因为它让组织罢工变得更困难。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who opposes labor unions or labor movements.","zh":"反对工会或劳工运动的人。"},"examples":[{"en":"During the dispute, he was labeled an antilaborist by union leaders.","zh":"在这场争端中，他被工会领袖贴上了“反劳工人士”的标签。"}]}],"synonyms":["anti-labor","anti-union","anti–organized labor","union-busting (informal/critical)"],"phonetic":"/ˌæntiˈleɪbərɪst/","extraExplanation":["“antilaborist”通常出现在政治评论、劳资谈判、新闻报道中，带有一定立场色彩，可能被用作批评性标签。更中性的说法可以是“critical of unions（对工会持批评态度）”或“opposed to organized labor（反对有组织的劳工力量）”。","拼写与用法提示：美式英语里常见写法还有“anti-labor”（带连字符）作形容词；在英式语境中也可能看到“anti-labour”。"]}
{"word":"antilacrosse","summary":{"en":"“Antilacrosse” (more commonly written “anti-lacrosse”) means opposed to the sport of lacrosse.","zh":"“antilacrosse”（更常见写法为“anti-lacrosse”）指“反对长曲棍球这项运动/相关文化”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to lacrosse (the sport), or against lacrosse culture, rules, teams, or participation.","zh":"反长曲棍球的；反对长曲棍球（这项运动）或其文化、规则、队伍、参与等。"},"examples":[{"en":"Some students started an antilacrosse petition to stop the school from cutting other sports’ budgets.","zh":"一些学生发起了“反长曲棍球”的请愿，要求学校不要为了长曲棍球而削减其他运动的预算。"},{"en":"He isn’t antilacrosse—he just thinks the field schedule should be shared more fairly.","zh":"他并不是反长曲棍球；他只是觉得场地安排应该更公平地共享。"}]}],"synonyms":["anti-lacrosse","opposed to lacrosse"],"phonetic":"ˌæntiˈlækrɔs","extraExplanation":["“antilacrosse”不是常见的标准词，更常见的写法是 **anti-lacrosse**（加连字符），意思是“反对长曲棍球”。\n\n构词法：**anti-**（反对）+ **lacrosse**（长曲棍球）。在英文里，anti- 常与名词/概念组合，表示立场或态度（如 anti-war 反战，anti-smoking 反吸烟）。\n\n语用提示：在正式写作中建议用 **anti-lacrosse**；在社交媒体或标题中也可能看到不加连字符的拼写。"]}
{"word":"antilacrosser","summary":{"en":"An informal, uncommon word meaning someone who is anti-lacrosse or dislikes lacrosse players.","zh":"一个非正式且不常见的词，指反对长曲棍球或不喜欢长曲棍球运动员的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is against lacrosse or dislikes lacrosse players (informal, nonstandard word)","zh":"反对长曲棍球或不喜欢长曲棍球运动员的人（非正式、非标准用词）"},"examples":[{"en":"The new school policy upset some antilacrossers who didn’t want funding for lacrosse.","zh":"新的校方政策让一些反长曲棍球的人不满，因为他们不想把经费花在长曲棍球上。"},{"en":"He joked that he was an antilacrosser after getting hit by a stray ball.","zh":"他被飞来的球砸到后开玩笑说自己成了“反长曲棍球的人”。"}]}],"synonyms":["anti-lacrosse person","lacrosse hater (informal)"],"phonetic":"/ˌæntaɪˈlæk.rɔsɚ/","extraExplanation":["“antilacrosser”不是常见词，更多是临时造词或玩笑用法。它由前缀 anti-（“反对”）+ lacrosser（“长曲棍球运动员/打长曲棍球的人”）构成。更自然的表达通常是：anti-lacrosse person / someone who is anti-lacrosse / someone who doesn’t like lacrosse。"]}
{"word":"antilactase","summary":{"en":"Antilactase refers to something (often an antibody) that inhibits or targets the enzyme lactase.","zh":"Antilactase 指抑制或针对乳糖酶（lactase）的物质，常指抗乳糖酶抗体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an antibody or other substance that works against (inhibits or targets) the enzyme lactase","zh":"抗乳糖酶物质；抗乳糖酶抗体（指抑制或针对乳糖酶 lactase 的抗体或其他物质）"},"examples":[{"en":"Researchers tested for antilactase antibodies in patients with suspected immune-related gut problems.","zh":"研究人员在疑似免疫相关肠道问题的患者中检测抗乳糖酶抗体。"},{"en":"An antilactase agent could reduce lactase activity in a lab experiment.","zh":"在实验室实验中，抗乳糖酶制剂可能会降低乳糖酶活性。"}]},{"partOfSpeech":"adj.","definition":{"en":"working against lactase; inhibiting or targeting lactase","zh":"抗乳糖酶的；抑制或针对乳糖酶的"},"examples":[{"en":"The paper describes antilactase immune responses in a small sample.","zh":"该论文描述了一个小样本中的抗乳糖酶免疫反应。"},{"en":"They measured antilactase effects on enzyme activity over time.","zh":"他们测量了抗乳糖酶作用对酶活性的时间变化。"}]}],"synonyms":["anti-lactase antibody","lactase inhibitor"],"phonetic":"ˌæn.tiˈlæk.teɪs","extraExplanation":["“anti-”表示“反对/抗”，lactase 是分解乳糖（lactose）的消化酶，主要存在于小肠刷状缘。","这个词在日常英语中非常罕见，更多见于医学或免疫学语境。它不等同于“lactose intolerance（乳糖不耐受）”：乳糖不耐受通常是乳糖酶不足，而不是体内出现“抗乳糖酶”的抗体。"]}
{"word":"antilapsarian","summary":{"en":"A theological word meaning “before the Fall,” describing humanity’s state before the first sin.","zh":"一个神学用词，意为“堕落之前”，描述人类第一次犯罪之前的状态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Theology) relating to the state of humans before the Fall of Adam and Eve (before humanity’s first sin).","zh":"（神学）与“堕落之前”的人类状态有关的；指亚当和夏娃犯罪之前（人类第一次犯罪之前）的。"},"examples":[{"en":"Some theologians discuss the antilapsarian condition as one of innocence and direct fellowship with God.","zh":"一些神学家讨论“堕落前”的状态，认为那是一种无罪并与上帝直接相交的状态。"},{"en":"The book contrasts antilapsarian humanity with life after the Fall.","zh":"这本书把“堕落前”的人类与“堕落后”的生活作了对比。"}]}],"synonyms":["prelapsarian","before the Fall"],"phonetic":"/ˌæn.tiˌlæpˈsɛr.i.ən/","extraExplanation":["“antilapsarian”由 anti-（在……之前/反……）+ lapsarian（与“堕落”相关）组成。这里的“laps-”来自拉丁语 *lapsus*，意为“跌倒、失足”，在基督教语境中特指“堕落（the Fall）”。","它常出现在系统神学讨论中，用来区分“堕落前（antilapsarian）”与“堕落后（postlapsarian）”的人性、自由意志、罪与恩典等议题。","相关术语：infralapsarian（下堕落论：上帝的拣选/预定在逻辑上被放在“允许堕落”之后）与 supralapsarian（上堕落论：在逻辑上放在“允许堕落”之前）。这些属于加尔文主义内部关于预定论次序的讨论。"]}
{"word":"antilapse","summary":{"en":"“Antilapse” is a rare/nonstandard term meaning “preventing a lapse,” often written as “anti-lapse.”","zh":"“antilapse”较少见，通常指“防止失误/中断”，常写作“anti-lapse”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare / nonstandard) Designed to prevent a lapse (a temporary failure, pause, or slip), especially in technical descriptions (often written with a hyphen: anti-lapse).","zh":"（罕见/非标准用法）用于防止“失误/中断/疏忽”（lapse）的；尤见于技术描述中（常写作 anti-lapse）。"},"examples":[{"en":"The system includes an anti-lapse mechanism to prevent brief signal dropouts.","zh":"该系统包含防中断（anti-lapse）机制，以防止短暂的信号掉线。"},{"en":"An anti-lapse device reduces the risk of the valve closing unexpectedly.","zh":"防误闭（anti-lapse）装置降低了阀门意外关闭的风险。"}]},{"partOfSpeech":"n.","definition":{"en":"(As a label/name) A feature, device, or setting intended to prevent lapses.","zh":"（作名称/标签）用于防止失误或中断的功能、装置或设置。"},"examples":[{"en":"Turn on Antilapse in the settings to avoid timeouts.","zh":"在设置中开启 Antilapse，以避免超时。"}]}],"synonyms":["anti-lapse","fail-safe","prevent lapses","anti-dropout"],"phonetic":"/ˌæn.tiˈlæps/","extraExplanation":["“antilapse”并不是常见的标准英语词条；更自然的写法通常是带连字符的 **anti-lapse**，或直接用更常见的表达：**prevent lapses**, **fail-safe**, **anti-dropout**, **no-timeout**（视具体语境而定）。","如果你是在某个产品说明、论文或代码里看到它，它很可能是厂商/作者自造的功能名（feature name）或术语缩写；建议你给我一句原文，我可以帮你判断它在该语境中的准确含义与更地道的替代表达。"]}
{"word":"antileague","summary":{"en":"Antileague means a person/group or an attitude that opposes a league or alliance.","zh":"antileague 指反对某个联盟/同盟/团体的人、组织或立场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often capitalized in history/politics) A person or group that opposes a particular league (an organized association, alliance, or political movement).","zh":"（常用于历史/政治语境，且常大写）反对某个“联盟/同盟/团体”的人或组织。"},"examples":[{"en":"The newspaper described the protesters as an antileague organization that wanted the coalition to dissolve.","zh":"这家报纸把抗议者称为反联盟组织，主张解散该联盟。"},{"en":"In local politics, an antileague candidate ran on a platform of leaving the regional league.","zh":"在地方政治中，一位反联盟候选人以退出地区联盟为政纲参选。"}]},{"partOfSpeech":"adj.","definition":{"en":"Opposed to a league or alliance; working against a league’s goals.","zh":"反对联盟/同盟的；与联盟目标对立的。"},"examples":[{"en":"They launched an antileague campaign to block the agreement.","zh":"他们发起了一场反联盟运动来阻止该协议。"},{"en":"Antileague sentiment grew after the league raised membership fees.","zh":"该联盟提高会费后，反联盟情绪加剧。"}]}],"synonyms":["anti-league","anti-alliance","anti-coalition","opposition group"],"phonetic":"/ˌæn.tiˈliːɡ/","extraExplanation":["“anti-”是常见前缀，表示“反对、对抗”。“league”在这里通常指“组织起来的联盟/团体/同盟”，不一定是体育联赛。","该词在现代英语中不算常用，更常见的表达是“anti-league”（带连字符）或更具体的说法，比如“anti-coalition / anti-alliance / anti-union”。在历史材料里也可能作为专有名词出现（如某个时期反对某个特定联盟的阵营），因此有时会大写。"]}
{"word":"antileak","summary":{"en":"Antileak (often written anti-leak) means designed to prevent leaks, or a leak-preventing feature/product.","zh":"antileak（常写作 anti-leak）指“防漏的”，也可指“防漏功能/产品”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"designed to prevent leaks (of liquid, air, gas, or information); leak-proof.","zh":"防漏的；防渗漏的（液体、空气、气体或信息等）"},"examples":[{"en":"This bottle has an anti-leak cap, so it won’t spill in your bag.","zh":"这个瓶子有防漏瓶盖，所以放在包里不会漏出来。"},{"en":"The plumber installed an anti-leak valve to stop the pipe from dripping.","zh":"水管工安装了一个防漏阀门来防止管道滴水。"},{"en":"Some companies use anti-leak software to protect confidential files.","zh":"一些公司使用防泄密软件来保护机密文件。"}]},{"partOfSpeech":"n.","definition":{"en":"a feature, coating, or product intended to stop leaks.","zh":"防漏功能；防漏涂层/产品"},"examples":[{"en":"The ad says the phone case includes an anti-leak layer around the ports.","zh":"广告说这个手机壳在接口周围有一层防漏（防水密封）结构。"},{"en":"Apply the anti-leak around the joint before you tighten it.","zh":"拧紧之前先在接缝处涂上防漏材料。"}]}],"synonyms":["leak-proof","leak-resistant","sealed","spill-proof","anti-leakage"],"phonetic":"/ˌæn.tiˈlik/","extraExplanation":["“anti-leak”更常见的写法是带连字符的 anti-leak（或两个词 anti leak）。在产品说明里也常见更标准的表达：leak-proof（防漏的）、leak-resistant（耐漏的/不易漏的）、anti-leakage（防渗漏的，较正式）。","语境上，“leak”既可以指“漏水/漏气”等物理渗漏，也可以指“泄露信息”。因此 anti-leak 在不同领域可能分别对应“防漏”或“防泄密”。"]}
{"word":"antileft","summary":{"en":"“Antileft” (more commonly “anti-left”) describes opposition to left-wing politics, or the people/attitudes that oppose the political left.","zh":"“antileft”（更常写作“anti-left”）指反对左翼政治的，或指反对左派的人/立场。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to left-wing politics or ideas; critical of leftist movements or policies.","zh":"反对左翼政治或思想的；批评左派运动或政策的。"},"examples":[{"en":"The candidate ran an anti-left campaign focused on small government and tradition.","zh":"这位候选人发起了一场反左翼的竞选活动，强调小政府与传统价值。"},{"en":"Some newspapers took an anti-left stance during the protests.","zh":"在抗议期间，一些报纸采取了反左翼立场。"}]},{"partOfSpeech":"n.","definition":{"en":"People, groups, or attitudes that oppose the political left (often used in political discussion).","zh":"反对政治左派的人、团体或立场（常用于政治讨论）。"},"examples":[{"en":"In online debates, anti-left voices often clashed with progressive activists.","zh":"在网络辩论中，反左翼的声音常与进步派活动人士发生冲突。"},{"en":"The article compares the anti-left and pro-labor arguments.","zh":"这篇文章比较了反左翼与支持劳工的论点。"}]}],"synonyms":["anti-left","right-wing","conservative","anti-progressive","anti-socialist"],"phonetic":"/ˌæntiˈlɛft/","extraExplanation":["“antileft”更常见的写法是带连字符的“anti-left”。在正式写作中，建议使用“anti-left”或更具体的表达（如“anti-progressive”“anti-socialist”），以避免含义过于笼统。","这是带有政治立场色彩的词，语气往往偏对立或批判；在中立叙述中可用更客观的说法，如“critical of the left（对左派持批评态度）”。"]}
{"word":"antilegalist","summary":{"en":"Antilegalist means against legalism—especially the idea that strict rule‑keeping is the core of religion or morality.","zh":"Antilegalist 指反对律法主义/过度守规条，尤指反对把宗教或道德简化为严格守规则。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to legalism (the idea that strict rule‑keeping is the main measure of goodness, especially in religion or morality).","zh":"反对“律法主义/形式主义守规条”（认为严格守规则才算善良，尤指宗教或道德领域）。"},"examples":[{"en":"Her antilegalist approach emphasizes compassion over strict rule‑keeping.","zh":"她的反律法主义立场强调怜悯，而不是死守规条。"},{"en":"Some readers found the book antilegalist because it focuses on grace rather than punishment.","zh":"一些读者觉得这本书反律法主义，因为它强调恩典而非惩罚。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who opposes legalism, especially in religious teaching or practice.","zh":"反对律法主义的人（尤指在宗教教义或实践中）。"},"examples":[{"en":"He describes himself as an antilegalist who worries about religion becoming only a set of rules.","zh":"他自称是反律法主义者，担心宗教沦为一套规矩而已。"}]}],"synonyms":["anti-legalistic","anti-pharisaical","nonlegalistic"],"phonetic":"/ˌæntiˈliɡəlɪst/","extraExplanation":["该词多见于基督教语境，讨论“legalism（律法主义）”时使用：即把信仰/道德简化为遵守外在规定、用规条衡量人的价值。antilegalist 往往强调“恩典、内在动机、爱与怜悯”高于“形式上的守法”。","注意区分：antilegalist（反对律法主义）不一定等同于“反律法/无法无天”。有些讨论会把它与 antinomian（反律法主义，主张不受道德律约束）对比；antilegalist 更常是批评“过度守规条”的倾向。"]}
{"word":"antilegomena","summary":{"en":"Antilegomena are writings—especially biblical books—whose acceptance or authenticity was historically disputed.","zh":"Antilegomena 指（尤指《圣经》书卷）在历史上曾被质疑其权威或真伪的“争议经卷/争议文本”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in biblical studies) Books or passages whose authority or authorship was disputed or “spoken against,” often contrasted with universally accepted texts.","zh":"（尤用于《圣经》研究）指权威性或作者归属曾受到质疑、被“反对/争议”的书卷或段落，常与公认的正典文本相对。"},"examples":[{"en":"In early church history, some letters were counted among the antilegomena for a time.","zh":"在早期教会历史中，有些书信曾一度被归为“有争议的经卷”（antilegomena）。"},{"en":"The scholar compared the homologoumena and the antilegomena when discussing the formation of the canon.","zh":"这位学者在讨论正典形成时，对比了公认经卷（homologoumena）与争议经卷（antilegomena）。"}]}],"synonyms":["disputed writings","contested books","disputed texts"],"phonetic":"/ˌæn.tɪ.ləˈɡɑː.mə.nə/","extraExplanation":["antilegomena 来自希腊语，字面意思接近“被反对而提出异议的（事物）”。在基督教文献与正典研究里，它常指早期教会中并非各地一致接纳、曾被讨论是否应纳入《新约》的一些书卷。","常见的对照术语是 homologoumena（“公认的经卷”）。另外也会见到单数形式 antilegomenon（指某一卷/某一段争议文本）。"]}
{"word":"antilemic","summary":{"en":"“Antilemic” is not standard English; it’s usually a mistaken form of “antiemetic” or “antileukemic,” depending on context.","zh":"“antilemic”不是标准英语词；多半是把“antiemetic（止吐的）”或“antileukemic（抗白血病的）”写错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in modern usage; often a misspelling or mistaken form. In medical contexts, people usually mean “antileukemic” (against leukemia) or “antiemetic” (prevents nausea/vomiting).","zh":"现代英语中不是常见或标准用词；常见于拼写或用词错误。在医学语境里，人们通常想表达的是 antileukemic（抗白血病的）或 antiemetic（止吐的）。"},"examples":[{"en":"I couldn’t find “antilemic” in a dictionary; did you mean “antiemetic” for nausea?","zh":"我在词典里查不到“antilemic”；你是不是想说治疗恶心的“antiemetic（止吐的）”？"},{"en":"The paper describes antileukemic drugs, not “antilemic” drugs.","zh":"这篇论文描述的是 antileukemic（抗白血病的）药物，而不是“antilemic”药物。"}]}],"synonyms":["(likely) antiemetic","(likely) antileukemic"],"phonetic":"/ˌæn.tiˈliː.mɪk/","extraExplanation":["“anti-”表示“反对/对抗”，后面接不同词根会变成不同医学含义：\n- antiemetic：anti-（对抗）+ emetic（催吐/引起呕吐的）→ “止吐的”。\n- antileukemic：anti-（对抗）+ leukemic（白血病的）→ “抗白血病的”。\n如果你能提供句子或出处（书名/论文/药名），我可以帮你判断它具体想表达哪个词。"]}
{"word":"antilens","summary":{"en":"An antilens is an optical element used to counteract or reverse a lens’s focusing effect (often by making light diverge).","zh":"antilens 指一种用来抵消或反转透镜聚焦效果的光学元件（常通过让光线发散来实现）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Optics) A device or optical element designed to cancel or reverse the focusing (lensing) effect of a lens, so light rays are made to spread out or the image distortion is reduced.","zh":"（光学）一种用来抵消或反向“透镜聚焦效应”的装置/光学元件，使光线发散或减少成像畸变。"},"examples":[{"en":"Engineers added an antilens to cancel the unwanted focusing caused by the protective cover.","zh":"工程师加了一个 antilens，用来抵消防护罩带来的意外聚焦效应。"},{"en":"In the lab, the antilens helped reduce distortion and made the image edges clearer.","zh":"在实验室里，这个 antilens 帮助降低畸变，让图像边缘更清晰。"}]},{"partOfSpeech":"n.","definition":{"en":"(Looser use) A diverging (negative) lens used to counteract the effect of a converging lens in an optical system.","zh":"（较宽泛用法）用于抵消会聚透镜效果的发散（负）透镜。"},"examples":[{"en":"If the camera focuses too strongly, a small antilens can pull the focus back.","zh":"如果相机聚焦过强，一个小的“antilens”（发散透镜）可以把焦点拉回来。"},{"en":"They paired a convex lens with an antilens to fine-tune the focal length.","zh":"他们把凸透镜和“antilens”搭配来微调焦距。"}]}],"synonyms":["diverging lens","negative lens","compensating lens"],"phonetic":"/ˈæn.tiˌlɛnz/","extraExplanation":["“antilens”不是日常英语词汇，更常见的说法会用“diverging lens / negative lens（发散/负透镜）”或“compensating lens（补偿透镜）”，具体用哪个取决于你是在强调“发散”还是强调“抵消/校正”。","在一些较前沿的光学/材料语境里，antilens 也可能指用特殊结构（如超材料）实现“抵消透镜效应”的器件；阅读论文时要结合作者定义。"]}
{"word":"antilepsis","summary":{"en":"Antilepsis is a rhetorical move that repeats an opponent’s words while changing their meaning to rebut or gain advantage.","zh":"Antilepsis 指一种修辞反击：重复对方用词，但通过重新解释来反驳或取得优势。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rhetoric) A technique where you repeat someone’s word or phrase but twist its meaning (often by redefining it) to answer back, criticize, or gain an advantage in an argument.","zh":"（修辞）把对方的话“接过来”再换个角度解释或重新定义，用来反驳、讽刺或在论辩中占上风的手法。"},"examples":[{"en":"A: “You’re being childish.” B: “Childish? If caring about fairness is childish, then fine—I’m childish.”","zh":"甲：“你太幼稚了。”乙：“幼稚？如果在乎公平就算幼稚，那我就幼稚。”"},{"en":"When the critic called her work “simple,” she replied, “Yes—simple enough for anyone to understand.”","zh":"评论家说她的作品“简单”，她回敬道：“是的——简单到任何人都看得懂。”"}]}],"synonyms":["redefinition","verbal turnabout","semantic reversal","antanaclasis (related)"],"phonetic":"/ˌæn.tɪˈlɛp.sɪs/","extraExplanation":["这个词来自希腊语词根：anti-（反、对）+ lepsis（拿取、接住），可以理解为“把对方的话接住再反用”。","学习时可把 antilepsis 当作一种“反击式改写”：不是直接否认对方，而是借用对方用词，通过重新界定（redefine）让它变成对自己有利的意思。","它常见于辩论、讽刺写作、政治语言或机智对话中；效果可能显得犀利，使用时注意语境与礼貌。"]}
{"word":"antileptic","summary":{"en":"Antileptic usually refers to antiepileptic (antiseizure) medicines—drugs that prevent or control epileptic seizures.","zh":"antileptic 通常指 antiepileptic（抗癫痫/抗发作的）药物，用于预防或控制癫痫发作。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Usually: antiepileptic) relating to medicines used to prevent or control epileptic seizures.","zh":"（通常指 antiepileptic）与用于预防或控制癫痫发作的药物有关的。"},"examples":[{"en":"The doctor prescribed an antiepileptic drug to reduce her seizures.","zh":"医生开了一种抗癫痫药来减少她的发作。"},{"en":"Some antiepileptic medicines can cause drowsiness at first.","zh":"一些抗癫痫药在刚开始使用时可能会引起嗜睡。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) an antiepileptic medicine; an antiseizure drug.","zh":"（较少见）抗癫痫药；抗发作药。"},"examples":[{"en":"He takes an antiepileptic every day as part of his treatment plan.","zh":"他每天服用抗癫痫药，作为治疗方案的一部分。"}]}],"synonyms":["antiepileptic","antiseizure"],"phonetic":"/ˌæn.ti.ˌɛp.əˈlɛp.tɪk/","extraExplanation":["“antileptic”在现代英语里不太常见，很多时候是把更标准的医学词“antiepileptic（抗癫痫的）”简写或误写了。日常交流与医学写作中，更推荐用“antiepileptic”或“antiseizure”。"]}
{"word":"antilepton","summary":{"en":"An antilepton is the antiparticle of a lepton (for example, a positron is the antilepton of an electron).","zh":"antilepton 指轻子的反粒子（例如：正电子是电子的反轻子）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Physics) A type of antiparticle that corresponds to a lepton; it has the same mass as the lepton but opposite electric charge and other quantum numbers (such as lepton number).","zh":"（物理）与轻子对应的一类反粒子；它与对应轻子质量相同，但电荷及其他量子数（如轻子数）相反。"},"examples":[{"en":"A positron is the antilepton of the electron.","zh":"正电子是电子对应的反轻子。"},{"en":"In high-energy collisions, a lepton–antilepton pair can be created from energy.","zh":"在高能碰撞中，能量可以产生一对轻子—反轻子。"},{"en":"Researchers look for antilepton signals to study how particles behave under the Standard Model.","zh":"研究人员通过寻找反轻子信号来研究粒子在标准模型下的行为。"}]}],"synonyms":["anti-lepton"],"phonetic":"/ˌæn.tiˈlɛp.tɑn/","extraExplanation":["“anti-”表示“反的/相对的”，与“lepton（轻子）”合成。常见反轻子包括：正电子（电子的反粒子）、反μ子、反τ子，以及反中微子。","在粒子物理里，“反粒子”并不等于“反物质一定很危险”；它是自然界中与普通粒子成对出现的一类粒子。反轻子常出现在宇宙射线、粒子加速器实验、以及某些放射性衰变过程中。","轻子数（lepton number）是描述轻子家族守恒规律的量子数之一；反轻子的轻子数与对应轻子相反，因此常用于判断反应是否符合守恒定律。"]}
{"word":"antilethargic","summary":{"en":"Antilethargic means “anti-tiredness”—something that keeps you from feeling lethargic and helps you feel more alert.","zh":"antilethargic 意为“抗倦怠/提神的”，指能防止昏沉、让人更清醒更有精神的东西。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposing tiredness or sluggishness; intended to prevent or reduce lethargy and increase energy or alertness.","zh":"抗倦怠的；提神的；用于防止或减轻嗜睡、懒散并提升精力或警觉性的。"},"examples":[{"en":"A brisk walk and bright sunlight can be surprisingly antilethargic in the afternoon.","zh":"下午时分，快走和明亮的阳光会有出人意料的提神效果。"},{"en":"She made a cup of strong tea for an antilethargic boost before studying.","zh":"她泡了一杯浓茶，在学习前用来提神。"}]}],"synonyms":["invigorating","energizing","stimulating","reviving","bracing"],"phonetic":"/ˌæn.ti.ləˈθɑr.dʒɪk/","extraExplanation":["词形拆解：anti-（反、对抗）+ lethargic（昏沉的、无精打采的）。整体意思就是“对抗昏沉/倦怠”。","使用提示：这是较少见、偏书面或幽默的词。日常更常用 energetic（精力充沛的）、invigorating（提神的）、stimulating（刺激/提神的）、wake-up（提神的）等表达。","语域与搭配：常用来修饰 coffee/tea、fresh air、exercise、music、conversation 等“能让人不犯困”的事物。"]}
{"word":"antileukaemic","summary":{"en":"Antileukaemic describes drugs or treatments that act against leukemia.","zh":"Antileukaemic 指“抗白血病的”，常用于描述药物或治疗手段。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Used to prevent, treat, or fight leukemia (cancer of the blood-forming tissues).","zh":"用于预防、治疗或对抗白血病（造血组织的癌症）。"},"examples":[{"en":"The patient was started on an antileukaemic drug as part of induction therapy.","zh":"病人作为诱导治疗的一部分开始使用抗白血病药物。"},{"en":"Researchers tested a new antileukaemic compound in the lab.","zh":"研究人员在实验室中测试了一种新的抗白血病化合物。"}]}],"synonyms":["antileukemic","anti-leukemia","leukemia-fighting"],"phonetic":"/ˌænti luːˈkiːmɪk/","extraExplanation":["“antileukaemic”是英式拼写；美式更常写作“antileukemic”。两者意思相同，差别主要来自“leukaemia/leukemia（白血病）”的拼写习惯。","构词法：anti-（反、抗）+ leukaemic/leukemic（与白血病有关的）。常用于医学语境，如“antileukaemic drugs/therapy（抗白血病药物/治疗）”。"]}
{"word":"antileukemic","summary":{"en":"Antileukemic describes drugs or treatments that act against leukemia.","zh":"antileukemic 用来形容“抗白血病的”药物或治疗方法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to prevent, slow down, or treat leukemia (a cancer of the blood and bone marrow).","zh":"抗白血病的；能预防、减缓或治疗白血病（血液与骨髓的癌症）的。"},"examples":[{"en":"The doctor prescribed an antileukemic drug as part of the patient’s treatment plan.","zh":"医生开具了一种抗白血病药物，作为患者治疗方案的一部分。"},{"en":"Researchers are testing new antileukemic therapies to improve survival rates.","zh":"研究人员正在测试新的抗白血病疗法，以提高存活率。"}]}],"synonyms":["anti-leukemia","leukemia-fighting","antineoplastic (broader, adj.)"],"phonetic":"/ˌæn.ti.luˈkiː.mɪk/","extraExplanation":["构词法：anti- 表示“反对/对抗”，leukemic 来自 leukemia（白血病），合起来就是“对抗白血病的”。","使用场景：多见于医学或科研语境（药物、疗法、作用机制等），日常英语中较少使用。写作中也常用更常见的表达，如 anti-leukemia drug / leukemia treatment。"]}
{"word":"antileveling","summary":{"en":"Antileveling (often written anti-leveling) means opposing efforts to make people more equal in wealth, status, or social rank.","zh":"Antileveling（常写作 anti-leveling）指反对缩小财富、地位或社会等级差异的“平均化/平等化”努力。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to leveling—especially policies or actions that reduce social, economic, or status differences (for example, redistributing wealth or making everyone the “same” in rank).","zh":"反对“拉平/平均化”的；尤指反对缩小社会、经济或地位差异的政策或做法（例如再分配财富、让阶层差距变小）。"},"examples":[{"en":"Some critics called the new tax plan antileveling because it mainly benefited high earners.","zh":"一些批评者称这项新税收方案是“反平均化”的，因为它主要让高收入者受益。"},{"en":"The essay argues that antileveling attitudes can protect privilege.","zh":"这篇文章认为，反平均化的态度可能会维护既得特权。"}]}],"synonyms":["anti-leveling","anti-egalitarian","anti-redistribution","anti-equalizing"],"phonetic":"/ˌæn.tiˈlɛv.əl.ɪŋ/","extraExplanation":["“antileveling”通常写作带连字符的 **anti-leveling**。其中 **leveling** 在政治与社会语境里常指“拉平差距、趋于平等”的倾向（例如减少贫富差距或阶层差异）；因此 **anti-leveling** 常带有“反对平等化/反对平均主义”的含义。","相关词：**leveling**（拉平差距、平均化）、**egalitarian**（平等主义的）、**anti-egalitarian**（反平等主义的）。使用时要注意语气：它多出现在评论或学术/政治写作中，可能带批评色彩。"]}
{"word":"antilevelling","summary":{"en":"“Antilevelling” means opposing levelling—especially political or social moves toward equality (often linked to the 17th-century English Levellers).","zh":"“Antilevelling”指反对“拉平差距/走向平等”的主张，常与17世纪英国的“平等派（Levellers）”相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to “levelling,” especially the political idea of reducing social and economic inequality; against the Levellers or similar egalitarian movements.","zh":"反对“平等化/拉平差距”的（尤指反对缩小社会与经济不平等的政治主张）；反对“平等派（Levellers）”或类似平等主义运动的。"},"examples":[{"en":"The pamphlet takes an antilevelling stance, warning that equality would threaten property rights.","zh":"这本小册子采取反平等化立场，警告平等会威胁财产权。"},{"en":"Some landowners supported antilevelling policies to keep traditional hierarchies in place.","zh":"一些地主支持反平等化政策，以维持传统等级秩序。"}]},{"partOfSpeech":"n.","definition":{"en":"A policy, argument, or movement that opposes levelling (egalitarian change).","zh":"反对平等化（平等主义改革）的政策、论点或运动。"},"examples":[{"en":"Antilevelling was common in the newspapers of the time.","zh":"当时的报纸上常见反平等化言论。"},{"en":"The debate shifted from levelling to antilevelling, focusing on the defense of privilege.","zh":"争论从平等化转向反平等化，重点变成了为特权辩护。"}]}],"synonyms":["anti-egalitarian","anti-equality","anti-leveling","anti-Leveller"],"phonetic":"/ˌæn.tiˈlɛv.əl.ɪŋ/","extraExplanation":["“Levellers（平等派）”是17世纪英国内战时期的政治运动之一，主张更广泛的政治参与与权利保障。因而 antilevelling 常见于历史写作或学术语境，指反对这类“拉平阶层/缩小差距”的主张。","拼写上也常见作 anti-levelling（英式拼法 levelling；美式常写 leveling）。"]}
{"word":"Antilia","summary":{"en":"Antilia is a legendary “phantom island” that appeared on some old Atlantic maps but was never proven to exist.","zh":"Antilia（安提利亚岛）是旧时大西洋地图上常见的一座传说“幻影岛”，从未被证实真实存在。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a legendary or mythical island shown on some medieval and early Renaissance maps of the Atlantic Ocean, often described as a “phantom island.”","zh":"（地图传说中的）安提利亚岛：中世纪至文艺复兴早期一些地图上标出的传说岛屿，常被称为“幽灵岛/幻影岛”。"},"examples":[{"en":"Antilia appeared on several 15th‑century nautical charts, even though no explorer could confirm it.","zh":"安提利亚岛曾出现在一些15世纪的航海图上，尽管没有探险家能证实它的存在。"},{"en":"In historical fiction, sailors may speak of Antilia as a distant refuge beyond the known sea.","zh":"在历史题材小说里，水手们可能把安提利亚岛说成是已知海域之外的避难之地。"}]}],"synonyms":["phantom island","mythical island"],"phonetic":"/ænˈtɪliə/","extraExplanation":["“Antilia”常见的拼写也有“Antillia”。它在中世纪欧洲的海图传统中很有名，被当作大西洋中的一座神秘岛屿，有时与“七城传说（Seven Cities）”相连：据说伊比利亚半岛的主教与居民为躲避战乱逃到海外，建立了七座城市。","它与“the Antilles（安的列斯群岛）”在名称上常被联系：有人认为“Antilia/Antillia”的地图传说可能影响了后来对加勒比岛群的命名或联想，但二者并不等同。"]}
{"word":"antilia","summary":{"en":"Antilia is a mythical Atlantic island shown on some medieval maps.","zh":"Antilia（安提利亚）是中世纪地图上出现过的传说大西洋岛屿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a legendary (mythical) island in the Atlantic Ocean that appeared on some medieval European maps, often described as lying west of Portugal or Spain.","zh":"安提利亚岛：传说中的大西洋岛屿，曾出现在一些中世纪欧洲地图上，常被说位于葡萄牙或西班牙以西。"},"examples":[{"en":"On several medieval maps, Antilia is drawn as a large island far out in the Atlantic.","zh":"在一些中世纪地图上，安提利亚被画成大西洋深处的一座大岛。"},{"en":"Stories about Antilia reflect how Europeans imagined unknown lands before the Age of Exploration.","zh":"关于安提利亚的故事反映了欧洲人在大航海时代之前如何想象未知之地。"}]}],"synonyms":["mythical island","legendary island"],"phonetic":"/ænˈtɪliə/","extraExplanation":["“Antilia”常被称为“岛屿七城（Island of Seven Cities）”的传说所在地之一：据说伊比利亚半岛有人为躲避入侵航向大西洋，在岛上建立了七座城市。这类传说与中世纪到早期近代的航海想象有关，并不对应一座被证实存在的真实岛屿。","在文学和历史讨论中，Antilia经常用来举例说明：地图不仅记录地理，也会记录当时的传闻、信仰与政治想象。"]}
{"word":"antiliberal","summary":{"en":"“Antiliberal” means opposed to liberal political ideas or policies; it can also refer to a person who opposes liberalism.","zh":"“Antiliberal”指反自由主义的（反对自由派政治理念或政策）；也可指反自由主义者。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to liberal political ideas or policies (for example, supporting less individual freedom, less social reform, or more traditional/authoritarian control).","zh":"反自由主义的；反对自由派政治理念或政策的（例如较少强调个人自由、较少社会改革，或更偏向传统/权威式治理）。"},"examples":[{"en":"The party adopted an antiliberal platform and criticized free speech protections.","zh":"该党采取了反自由主义的政纲，并批评对言论自由的保护。"},{"en":"Some voters see the new law as antiliberal because it limits independent media.","zh":"一些选民认为这项新法律是反自由主义的，因为它限制了独立媒体。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or group that opposes liberalism.","zh":"反自由主义者；反对自由主义的人或团体。"},"examples":[{"en":"Antiliberals argued that the reforms threatened social stability.","zh":"反自由主义者认为这些改革威胁社会稳定。"}]}],"synonyms":["illiberal","anti-progressive","conservative (in some contexts)","reactionary (often stronger/negative)"],"phonetic":"/ˌæn.tiˈlɪb.ɚ.əl/","extraExplanation":["“antiliberal”里的前缀 anti- 表示“反对”，liberal 在政治语境中通常指“自由主义/自由派”。需要注意，不同国家语境里 liberal 的含义会变化：在美国常与偏进步的政策相关；在欧洲语境里也可能更接近“经济自由主义/古典自由主义”。因此 antiliberal 的具体立场要结合语境（反对社会自由、反对经济自由，或两者都反对）。","在写作中它常用于描述“立场/政策/运动”（an antiliberal agenda/movement），用来评价时语气可能较强，最好配合具体理由说明反对的是什么。"]}
{"word":"antiliberalism","summary":{"en":"Antiliberalism means opposition to liberalism, especially political liberalism centered on individual freedoms and democratic reforms.","zh":"Antiliberalism 指反对自由主义（尤指强调个人自由与民主改革的政治自由主义）的立场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to liberalism, especially to political ideas that emphasize individual rights, personal freedoms, and democratic reform; often favoring stronger authority, tradition, or social hierarchy instead.","zh":"反自由主义：反对自由主义的立场，尤指反对强调个人权利、个人自由与民主改革的政治理念；往往更支持强权、传统或社会等级秩序。"},"examples":[{"en":"In the early 20th century, some movements mixed nationalism with antiliberalism and rejected parliamentary democracy.","zh":"在20世纪初，一些运动把民族主义与反自由主义结合起来，并拒绝议会民主。"},{"en":"The article argues that the party’s antiliberalism shows in its limits on free speech and independent media.","zh":"这篇文章认为，该政党的反自由主义体现在它对言论自由和独立媒体的限制上。"},{"en":"Not every critique of liberal policies is antiliberalism; sometimes it is a call to reform liberalism rather than abolish it.","zh":"并非每一种对自由主义政策的批评都是反自由主义；有时只是呼吁改革自由主义，而不是废除它。"}]}],"synonyms":["anti-liberalism","illiberalism","anti-democratic politics (context-dependent)"],"phonetic":"/ˌæn.tiˈlɪb.ɚ.əlˌɪz.əm/","extraExplanation":["“反自由主义”在不同国家语境中指向不尽相同：在欧美政治史里常与反对议会制、反对公民自由或怀疑民主制度有关；在某些语境中也可能指反对“经济自由主义/新自由主义”（如反私有化、反市场化）。阅读时要留意它具体反对的是哪一种“liberalism”。","构词：anti-（反对）+ liberalism（自由主义）。常见搭配：antiliberal movement/party/ideas（反自由主义运动/政党/思想）、antiliberal backlash（反自由主义反弹）。"]}
{"word":"antiliberalist","summary":{"en":"“Antiliberalist” means opposing liberalism (adj.) or a person who opposes liberal ideas or policies (n.).","zh":"“antiliberalist”指“反自由主义的”（形容词）或“反自由主义者”（名词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to liberalism or liberal political/social ideas; favoring less individual freedom, less social change, or more traditional/authoritarian control (depending on context).","zh":"反自由主义的；反对自由主义或自由派政治/社会理念的（具体立场可能因语境而异，可能更强调传统、秩序或更强的权威控制）。"},"examples":[{"en":"Some commentators describe the party’s new platform as antiliberalist because it restricts press freedom.","zh":"一些评论员把该党新纲领称为反自由主义的，因为它限制新闻自由。"},{"en":"Her antiliberalist views made her skeptical of expanding civil rights protections.","zh":"她的反自由主义观点使她对扩大公民权利保护持怀疑态度。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who opposes liberalism or liberal policies.","zh":"反自由主义者；反对自由主义或自由派政策的人。"},"examples":[{"en":"In the debate, he presented himself as an antiliberalist who prioritizes national unity over individual rights.","zh":"在辩论中，他把自己塑造成一名反自由主义者，强调国家统一高于个人权利。"},{"en":"The book traces how antiliberalists influenced the constitution-making process.","zh":"这本书追溯了反自由主义者如何影响制宪过程。"}]}],"synonyms":["anti-liberal","illiberal","anti-progressive","reactionary"],"phonetic":"/ˌæn.tiˈlɪb.ɚ.ə.lɪst/","extraExplanation":["“antiliberalist”多用于政治写作或评论中，语气可能较强。它不一定等同于“保守主义”(conservative)：在不同国家，“liberal”指的内容不同（例如美国常偏“进步派/左倾”的社会政策；欧洲语境里“liberal”也常与市场自由、个人自由相关）。因此理解时要结合具体议题（言论自由、市场监管、少数群体权利等）。","构词：anti-（反对）+ liberal（自由主义的）+ -ist（…主义者/…派）。也常见拼写为“anti-liberal”或“antiliberal”，更口语/更常用。"]}
{"word":"antiliberalistic","summary":{"en":"“Antiliberalistic” means opposed to liberalism or liberal ideas, especially in political or social contexts.","zh":"“antiliberalistic”意为“反自由主义的”，多用于政治或社会语境，表示反对自由主义理念或取向。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to liberalism or liberal ideas (especially in politics, society, or culture).","zh":"反自由主义的；反对自由主义（尤指政治、社会或文化观念）的。"},"examples":[{"en":"Some groups take an antiliberalistic stance on immigration and social policy.","zh":"一些团体在移民与社会政策上采取反自由主义立场。"},{"en":"The article criticizes what it calls antiliberalistic trends in public debate.","zh":"这篇文章批评公共讨论中所谓的反自由主义趋势。"}]}],"synonyms":["anti-liberal","illiberal","anti-progressive (context-dependent)"],"phonetic":"/ˌæn.tiˌlɪb.ɚ.əˈlɪs.tɪk/","extraExplanation":["这个词比较少见，常见写法也可能是 anti-liberal 或 antiliberal（是否加连字符取决于写作风格）。在学术、评论或政治语境中出现更多，日常口语里通常会直接说 “anti-liberal”。","注意区分：anti-liberal（反对“自由主义”理念）不等同于 anti-liberty（反对“自由/自由权利”本身）。前者针对一套政治哲学或政策取向，后者语气更强、含义也更极端。"]}
{"word":"antiliberally","summary":{"en":"“Antiliberally” means doing or expressing something in a way that opposes liberal ideas or liberal people.","zh":"“antiliberally”表示以反自由主义/反自由派的方式行事或表达观点。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in an anti-liberal way; opposing liberal ideas, policies, or people who are considered liberal","zh":"以反自由主义的方式；反对自由主义思想、政策或被认为自由派的人"},"examples":[{"en":"Some commentators argued that the new law was written antiliberally and restricted personal freedoms.","zh":"一些评论员认为这项新法律带有反自由主义倾向，限制了个人自由。"},{"en":"He spoke antiliberally about immigration, calling for much stricter rules.","zh":"他在谈到移民时态度反自由派，主张制定更严格的规定。"},{"en":"The group campaigned antiliberally, criticizing social and cultural reforms.","zh":"该团体以反自由派的方式开展竞选，批评社会与文化改革。"}]}],"synonyms":["anti-liberally","conservatively (in some contexts)","reactionarily"],"phonetic":"/ˌæntiˈlɪbərəli/","extraExplanation":["“antiliberally”在日常英语中不算常见，更常见的表达是“in an anti-liberal way”或直接用形容词“anti-liberal”。在政治语境里，“liberal”在美国往往指偏进步/左倾的立场，在其他国家也可能指强调个人自由与市场经济的“自由主义”，理解时要结合具体语境。","拼写上也常见带连字符的形式“anti-liberally”，尤其在较正式或需要强调构词结构的写作中。"]}
{"word":"antiliberalness","summary":{"en":"Antiliberalness means an attitude or tendency of being against liberal ideas or policies, especially in politics.","zh":"Antiliberalness 指反对自由主义/自由派思想或政策的态度或倾向（尤用于政治语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or attitude of being opposed to liberal ideas, liberal policies, or liberal values (especially in politics).","zh":"反自由主义的特质或态度；反对自由派思想、政策或价值观（尤指政治语境）。"},"examples":[{"en":"Some critics argue that the new law reflects antiliberalness toward free speech.","zh":"一些批评者认为这项新法律体现了对言论自由的反自由主义态度。"},{"en":"Her essay examines how antiliberalness can grow during times of crisis.","zh":"她的文章探讨了反自由主义在危机时期如何滋长。"},{"en":"The debate became polarized, with accusations of antiliberalness on one side and elitism on the other.","zh":"这场辩论变得两极化：一方被指责反自由主义，另一方被指责精英主义。"}]}],"synonyms":["anti-liberalism","illiberalism","anti-liberal attitude","opposition to liberalism"],"phonetic":"/ˌæn.tiˈlɪb.ɚ.əl.nəs/","extraExplanation":["“antiliberalness”是由 anti-（反对）+ liberal（自由主义/自由派的）+ -ness（名词后缀，表示“性质/状态”）构成的抽象名词。","该词在正式写作中不算常见，更常见的表达是“anti-liberalism”（反自由主义）或形容词“anti-liberal”。“-ness”形式往往更强调一种“态度/倾向”。","注意“liberal”在不同国家语境含义可能不同：在美国常指偏进步的政治立场；在更广泛的政治理论中也可指强调个人自由、法治与权利的“自由主义”。因此“antiliberalness”具体指向需结合上下文。"]}
{"word":"antiliberals","summary":{"en":"“Antiliberals” means people who oppose liberalism or liberal policies.","zh":"“Antiliberals”指反对自由主义或自由派政策的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who oppose liberal ideas or liberal political policies (such as individual rights, political reform, or free-market/social liberal values, depending on context).","zh":"反自由主义者；反对自由主义思想或自由派政治政策的人（具体所反对的内容会因语境而异，如个人权利、政治改革、自由市场/社会自由等）。"},"examples":[{"en":"Some antiliberals argue that liberal reforms weaken traditional social values.","zh":"一些反自由主义者认为，自由派改革会削弱传统社会价值观。"},{"en":"In the debate, liberals and antiliberals disagreed about how much the government should regulate the economy.","zh":"在辩论中，自由派与反自由主义者对政府应在多大程度上监管经济存在分歧。"}]}],"synonyms":["opponents of liberalism","anti-liberal people","illiberals"],"phonetic":"/ˌæntiˈlɪbərəlz/","extraExplanation":["“antiliberals”是复数形式，单数是“antiliberal”。常见构词法：anti-（反对）+ liberal（自由主义的/自由派的）。","“liberal”在不同国家语境含义可能不同：在美国常指偏进步的政治立场；在欧洲语境里也可能更接近“自由市场/古典自由主义”。因此“antiliberal”具体反对什么，往往要看历史与政治背景。","该词常出现在政治评论或历史写作中，语气可能带有立场色彩；更中性的说法可用“opponents of liberalism（自由主义的反对者）”。"]}
{"word":"antilibration","summary":{"en":"Antilibration is a rare noun meaning “counterbalancing” or “something that balances another force.”","zh":"antilibration 是一个罕用名词，意思是“对抗平衡/抵消”，或“用于平衡另一力量的东西”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) the act of counterbalancing; a force or weight that balances another.","zh":"（罕用）对抗平衡、抵消；用于平衡另一力量或重量的作用（或配重）。"},"examples":[{"en":"Engineers added antilibration to keep the structure steady in strong winds.","zh":"工程师加入“对抗平衡”的设计，让结构在强风中保持稳定。"},{"en":"In practice, people usually say “counterbalance” instead of “antilibration.”","zh":"在实际使用中，人们通常说“counterbalance（抵消/平衡）”，而不说“antilibration”。"}]}],"synonyms":["counterbalance","offset","equilibrium","counterweight"],"phonetic":"/ˌæn.ti.laɪˈbreɪ.ʃən/","extraExplanation":["这个词非常少见，多见于旧书或专门语境。构词可理解为 anti-（反、对抗）+ libration（与“天平/平衡”相关的词根 liber-/libr-，如 library 原义也与“书卷”有关，但 libr- 在许多词里和“平衡、重量”更相关，如 equilibrium）。","如果你想表达日常“平衡/抵消”，更自然的选择是 counterbalance, offset, balance, equilibrium；如果是“配重”，可以用 counterweight。"]}
{"word":"antilife","summary":{"en":"Antilife describes something that opposes or destroys life, or (in sci‑fi) a deadly force or concept.","zh":"Antilife指“反生命的/毁灭生命的”，也可指（科幻中）使生命消亡的力量或概念。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to life or to the value of living; hostile to life and living things.","zh":"反生命的；否定生命价值的；对生命有敌意的。"},"examples":[{"en":"The film’s villain has an antilife philosophy: everything should be destroyed.","zh":"这部电影的反派奉行一种反生命的理念：一切都该被毁灭。"},{"en":"Some critics called the policy antilife because it increased pollution and illness.","zh":"一些批评者称这项政策“反生命”，因为它加剧了污染和疾病。"}]},{"partOfSpeech":"n.","definition":{"en":"A force, idea, or power that destroys life or makes life impossible (common in science fiction and fantasy).","zh":"（常见于科幻/奇幻）反生命力量；使生命消亡或无法存在的力量/观念。"},"examples":[{"en":"In the novel, antilife spreads across the planet like a black fog.","zh":"在小说里，反生命像黑雾一样蔓延整个星球。"},{"en":"The heroes search for a cure before antilife reaches the city.","zh":"英雄们在反生命抵达城市前寻找解药。"}]}],"synonyms":["life-destroying","deadly","destructive","anti-human","deathly"],"phonetic":"/ˌæn.taɪˈlaɪf/","extraExplanation":["“antilife”常写作“anti-life”，由前缀anti-（反对）+ life（生命）构成。它在新闻评论中多用于强烈谴责（如“反人性/反生命”的政策或思想），在科幻作品里则常被当作一种抽象的邪恶力量或概念设定。","流行文化里较知名的相关用法是DC漫画中的“Anti-Life Equation（反生命方程式）”，指一种能剥夺自由意志、让生命失去意义的力量设定。"]}
{"word":"antilift","summary":{"en":"“Antilift/anti-lift” means preventing something from being lifted or removed, or a device that does this (often in security hardware).","zh":"“antilift/anti-lift”指“防止被抬起或拆走”，也可指具体的防抬装置（多见于门窗安防五金）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"designed to prevent something from being lifted up, removed, or pulled out (often for security or safety).","zh":"用于防止某物被抬起、掀起、拆下或拔出（常见于防盗/安全用途）。"},"examples":[{"en":"The window has an anti-lift device so it can’t be lifted out from the outside.","zh":"这扇窗户装了防抬装置，从外面无法把窗扇抬起来拆走。"},{"en":"Install anti-lift brackets on the gate to reduce the risk of theft.","zh":"在大门上安装防抬支架，以降低被盗风险。"}]},{"partOfSpeech":"n.","definition":{"en":"a feature or part (such as a pin, bracket, or device) that prevents lifting or removal.","zh":"防抬结构/装置（如插销、支架或零件），用于防止被抬起或拆除。"},"examples":[{"en":"The technician replaced the worn anti-lift on the sliding door.","zh":"技术员更换了滑动门上磨损的防抬装置。"},{"en":"Make sure the anti-lifts are aligned before tightening the screws.","zh":"拧紧螺丝前，确保防抬件对齐。"}]}],"synonyms":["anti-theft","tamper-resistant","security","retaining","hold-down"],"phonetic":"ˌæntiˈlɪft","extraExplanation":["“anti-”表示“反…/防…”，所以 anti-lift 直译就是“防抬”。它多用于门窗五金、围栏、设备固定等场景，含义偏工程/安防，而不是日常口语。","常见写法是带连字符的 **anti-lift**；在产品说明或型号中也可能写成 **antilift**（更像品牌/型号拼写）。"]}
{"word":"antilipase","summary":{"en":"Antilipase means “against lipase”—a substance or effect that inhibits the fat-digesting enzyme lipase.","zh":"Antilipase 指“抗/抑制脂肪酶”的物质或作用，即对分解脂肪的酶 lipase 起抑制作用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance (such as an antibody or medicine) that blocks, reduces, or works against the enzyme lipase (an enzyme that breaks down fats).","zh":"抗脂肪酶的物质（例如抗体或药物），可阻断、降低或对抗脂肪酶（分解脂肪的酶）的作用。"},"examples":[{"en":"The researchers tested an antilipase compound to see whether it could reduce fat absorption.","zh":"研究人员测试了一种抗脂肪酶化合物，观察它是否能减少脂肪吸收。"},{"en":"In the lab report, antilipase activity was measured to evaluate how strongly the drug inhibited lipase.","zh":"在实验报告中，测量了抗脂肪酶活性，以评估该药物对脂肪酶的抑制强度。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing an action or effect that inhibits lipase.","zh":"（形容）具有抑制脂肪酶作用的；抗脂肪酶的。"},"examples":[{"en":"They observed an antilipase effect after adding the new inhibitor to the sample.","zh":"将新抑制剂加入样本后，他们观察到了抗脂肪酶效应。"},{"en":"The team compared antilipase properties across several candidate molecules.","zh":"团队比较了几种候选分子的抗脂肪酶特性。"}]}],"synonyms":["lipase inhibitor","anti-lipase antibody","lipase-blocking agent"],"phonetic":"/ˌæn.tiˈlaɪ.peɪs/","extraExplanation":["“anti-”表示“反、抗、抑制”；“lipase”是“脂肪酶”。因此 antilipase 常见于医学/生物化学语境，既可指“抗脂肪酶的物质”（名词），也可作形容词描述“抑制脂肪酶的”。","日常英语里很少用到这个词；更常见的说法包括“lipase inhibitor（脂肪酶抑制剂）”或在免疫学语境下说“anti-lipase antibody（抗脂肪酶抗体）”。"]}
{"word":"antilipid","summary":{"en":"“Antilipid” means anti-fat (lipid) in a medical sense—something that reduces or counteracts blood lipids like cholesterol.","zh":"“Antilipid”指医学意义上的“抗脂质/降脂”，即降低或对抗血脂（如胆固醇等）的作用或物质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medical) Reducing, preventing, or acting against lipids (fats) in the body, especially blood lipids like cholesterol and triglycerides.","zh":"（医学）抗脂质的；降低、抑制或对抗体内脂质（脂肪）的，尤指血脂如胆固醇与甘油三酯。"},"examples":[{"en":"Some medications have an antilipid effect and help lower LDL cholesterol.","zh":"有些药物具有抗脂质作用，可以帮助降低低密度脂蛋白（LDL）胆固醇。"},{"en":"Doctors may recommend an antilipid drug for people with high triglycerides.","zh":"医生可能会为甘油三酯偏高的人推荐抗脂质药物。"}]},{"partOfSpeech":"n.","definition":{"en":"A substance or drug that reduces or counteracts lipids (fats), especially in the blood.","zh":"抗脂质物质；降脂药（指能降低或对抗脂质，尤指血脂的物质或药物）。"},"examples":[{"en":"The patient was started on an antilipid to manage high cholesterol.","zh":"为控制高胆固醇，患者开始使用一种降脂药。"}]}],"synonyms":["lipid-lowering","hypolipidemic","antihyperlipidemic"],"phonetic":"/ˌæn.tiˈlɪp.ɪd/","extraExplanation":["“antilipid”在日常英语里不常见，更常见的相关术语是 **lipid-lowering**（降脂的）、**antihyperlipidemic**（抗高脂血症的）、**hypolipidemic**（降脂的），以及名词 **statin**（他汀类药物）。在阅读医学资料时，如果看到“antilipid therapy”，通常可理解为“降脂治疗/调脂治疗”。"]}
{"word":"antilipoid","summary":{"en":"Antilipoid is a rare term meaning “anti-lipoid”: something opposed to or acting against fat-like substances (lipoids), mainly in older medical/biochemical contexts.","zh":"Antilipoid 是较罕见的词，意为“反类脂的/对抗类脂的”，多见于较早的医学或生化语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to, acting against, or designed to prevent the effects/formation of lipoids (fat-like substances) in the body; anti-fat-like.","zh":"反脂类的；对抗或抑制脂类（类脂）作用或形成的。"},"examples":[{"en":"Some early papers described antilipoid factors in blood that seemed to react against fat-like substances.","zh":"一些早期论文描述了血液中的“反脂类”因素，似乎会与类脂物质发生反应。"},{"en":"The term antilipoid is rare today and is mostly seen in older medical or biochemical writing.","zh":"“antilipoid”这个词如今较少见，多出现在较早的医学或生化文献中。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a substance (such as an antibody or factor) that acts against lipoids.","zh":"（罕见）反脂类物质（如抗体或某种因子），可对抗类脂。"},"examples":[{"en":"Researchers once searched for an antilipoid to explain certain immune reactions.","zh":"研究者曾寻找某种“反脂类物质”来解释某些免疫反应。"}]}],"synonyms":["anti-lipid","antilipid"],"phonetic":"/ˌæn.tiˈlɪpɔɪd/","extraExplanation":["这个词由前缀 anti-（“反对、对抗”）+ lipoid（“类脂的；类脂”）组成。现代英语里更常见的表达是 anti-lipid、antilipid 或直接用更具体的术语（例如“抗脂质抗体”anti-lipid antibodies），所以 antilipoid 常给人一种“旧式/早期文献用语”的感觉。"]}
{"word":"antiliquor","summary":{"en":"Antiliquor means opposed to alcohol, especially its sale or use, often in political or social contexts.","zh":"Antiliquor 指反对酒精饮料（尤其反对其销售或使用），常见于政治或社会运动语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to alcoholic drinks or to the selling/serving of alcohol (often used in politics or social movements).","zh":"反对酒类（饮用或销售/供应酒精饮料）的；常用于政治或社会运动语境。"},"examples":[{"en":"The senator ran an antiliquor campaign and promised stricter alcohol laws.","zh":"这位参议员以反酒类为竞选主题，承诺出台更严格的酒精法规。"},{"en":"Some antiliquor groups argue that alcohol causes serious public health problems.","zh":"一些反酒类团体认为酒精会带来严重的公共健康问题。"}]}],"synonyms":["anti-alcohol","dry","temperance","prohibitionist"],"phonetic":"/ˌæn.tiˈlɪk.ɚ/","extraExplanation":["“antiliquor”在美国英语中多见于历史或政治语境，常与“禁酒/节酒（temperance）运动”相关。美国在1920—1933年曾实行全国性禁酒（Prohibition），当时的相关团体和立法常被描述为“antiliquor”。现代更常见的说法包括“anti-alcohol”或“anti-drinking”（语气和语境略不同）。"]}
{"word":"antilithic","summary":{"en":"Antilithic means helping prevent or treat stone formation, especially kidney/gall stones.","zh":"antilithic 指“抗结石的”，用于预防或治疗（肾/胆等）结石形成。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medicine) Preventing the formation of stones (especially kidney or gall stones), or helping to dissolve/remove them.","zh":"（医学）防止结石形成（尤指肾结石或胆结石），或帮助溶解/排出结石的。"},"examples":[{"en":"Some herbal teas are marketed as antilithic remedies for kidney stones.","zh":"一些草本茶被宣传为具有防治肾结石的“抗结石”功效。"},{"en":"The doctor warned that evidence for antilithic supplements is limited.","zh":"医生提醒说，许多所谓抗结石补充剂的证据有限。"}]}],"synonyms":["anti-lithic","litholytic (related)","stone-preventing"],"phonetic":"ˌæn.tiˈlɪθ.ɪk","extraExplanation":["这是一个相对少见、偏医学/药学语境的词，常出现在说明书、成分介绍或学术写作中。","构词上：anti-（反、抗）+ lith-（“石”，来自希腊语 lithos），因此字面意思是“抗石/抗结石”。在更常见的表达里，你也可能看到 anti-lithic（带连字符）或用更通俗的说法：prevents kidney stones（预防肾结石）。"]}
{"word":"antilitter","summary":{"en":"Anti-litter means “against littering; designed to stop people from dropping trash in public.”","zh":"Anti-litter 指“反对乱丢垃圾的；旨在防止人们在公共场所丢弃垃圾的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"intended to prevent or discourage littering; supporting keeping public places clean.","zh":"旨在防止或反对乱丢垃圾的；支持保持公共场所整洁的。"},"examples":[{"en":"The city launched an anti-litter campaign to keep parks clean.","zh":"这座城市发起了反乱丢垃圾的宣传活动，以保持公园整洁。"},{"en":"Anti-litter signs remind people to put trash in the bin.","zh":"反乱丢垃圾的标志提醒人们把垃圾丢进垃圾桶。"}]}],"synonyms":["anti-littering","litter-prevention","anti-trash (informal)"],"phonetic":"/ˌænti ˈlɪtɚ/","extraExplanation":["“anti-litter”常用连字符，表示“反对乱丢垃圾的”。也可以写作“antilitter”，但较少见，写作“anti-litter”更标准、更清晰。","常见搭配：anti-litter campaign（反乱丢垃圾宣传活动）、anti-litter law（反乱丢垃圾法规）、anti-littering measures（防止乱丢垃圾的措施）。"]}
{"word":"antilittering","summary":{"en":"Anti-littering means preventing or opposing littering (dropping trash in public).","zh":"Anti-littering 指“反乱扔垃圾”，用于描述防止或制止在公共场所丢垃圾的宣传、法规或措施。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"intended to prevent people from dropping trash in public places; relating to stopping littering.","zh":"用于防止人们在公共场所乱扔垃圾的；与制止乱扔垃圾有关的。"},"examples":[{"en":"The city launched an anti-littering campaign in parks and on beaches.","zh":"这座城市在公园和海滩发起了反乱扔垃圾宣传活动。"},{"en":"There are anti-littering signs near the river to protect wildlife.","zh":"河边有反乱扔垃圾的标志，用来保护野生动物。"},{"en":"Schools often teach anti-littering habits, like putting waste in a bin.","zh":"学校常常教导反乱扔垃圾的习惯，比如把垃圾扔进垃圾桶。"}]}],"synonyms":["litter-prevention","anti-trash (informal)"],"phonetic":"/ˌæn.tiˈlɪtɚ.ɪŋ/","extraExplanation":["在英文里，anti- 是常见前缀，表示“反对/防止”。因此 anti-littering 的核心意思是“反（乱扔垃圾）”。","常见搭配：anti-littering campaign（宣传活动）、anti-littering law（法规）、anti-littering sign/poster（标志/海报）、anti-littering measures（措施）。"]}
{"word":"antiliturgic","summary":{"en":"Antiliturgic means “against liturgy” or “non‑liturgical.”","zh":"antiliturgic 指“反礼仪的”或“非礼仪用途的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to, critical of, or rejecting religious liturgy (formal public worship and its rituals).","zh":"反礼仪的；反对、批评或拒绝宗教礼仪（正式公共敬拜及其仪式）的。"},"examples":[{"en":"Some reformers promoted an antiliturgic style of worship, preferring spontaneous prayer over set forms.","zh":"一些改革者提倡反礼仪的敬拜方式，更偏好自发祷告而不是固定仪式。"},{"en":"The article takes an antiliturgic stance, arguing that rituals can become empty habits.","zh":"这篇文章采取反礼仪立场，认为仪式可能会变成空洞的习惯。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not used in or not suitable for liturgy; non‑liturgical.","zh":"非礼仪用的；不用于或不适合礼仪场合的。"},"examples":[{"en":"The church newsletter included an antiliturgic announcement about the community picnic.","zh":"教会通讯里有一则非礼仪用途的公告，内容是社区野餐活动。"},{"en":"He wrote an antiliturgic song intended for private reflection rather than Sunday service.","zh":"他写了一首非礼仪歌曲，适合个人默想而非主日礼拜。"}]}],"synonyms":["anti-liturgical","nonliturgical","non-liturgical","anti-ritualistic"],"phonetic":"/ˌæn.ti.lɪˈtɝː.dʒɪk/","extraExplanation":["“antiliturgic”在现实英语中相对少见，更常见的对应词是“anti-liturgical”（反礼仪的）或“nonliturgical / non-liturgical”（非礼仪的）。写作时可根据语气选择：anti- 更强调“反对/批评”，non- 更中性，表示“不是礼仪用途”。","词根提示：anti- 表示“反对”，liturgy 指“礼仪、礼拜仪式”，-ic 表示“……的”。多见于神学、宗教史、礼拜学（worship studies）等语境。"]}
{"word":"antiliturgical","summary":{"en":"“Antiliturgical” describes something that rejects or criticizes formal, set religious worship rituals.","zh":"“antiliturgical”指反对或批评固定、正式的宗教敬拜礼仪（礼拜仪式）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to, critical of, or rejecting liturgy (fixed, formal public worship), especially in a Christian context.","zh":"反对礼仪的；批判或拒绝（尤其指基督教）固定、正式的公共敬拜仪式的。"},"examples":[{"en":"Some early reform movements had an antiliturgical attitude, preferring spontaneous prayer to set forms.","zh":"一些早期改革运动带有反礼仪的态度，更偏好自发祷告而不是固定仪式。"},{"en":"The group’s antiliturgical style meant there were no scripted readings or formal responses.","zh":"该团体的反礼仪风格意味着没有预先写好的读经或正式的应答。"}]}],"synonyms":["anti-ritual","anti-ceremonial","nonliturgical","opposed to formal worship"],"phonetic":"ˌæn.ti.lɪˈtɝː.dʒə.kəl","extraExplanation":["“liturgical”源自与“礼拜/礼仪次序”相关的传统（常见于天主教、东正教与部分新教）。因此“antiliturgical”通常不是单纯“反宗教”，而更具体地指反对“固定文本、仪式流程、圣礼礼制”等敬拜形式，强调更自由、即兴或个人化的敬拜。","这是一个较少见、偏学术或宗教研究语境的词；日常英语里更常用的表达有 “anti-ritual” 或 “opposed to formal worship”。"]}
{"word":"antiliturgically","summary":{"en":"Antiliturgically means “in a way that opposes or rejects formal religious liturgy.”","zh":"antiliturgically 指“以反对或拒绝正式宗教礼仪的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is opposed to (or rejecting) liturgy or formal religious worship practices.","zh":"以反礼仪的方式；以反对（或拒绝）宗教礼仪/正式崇拜仪式的方式。"},"examples":[{"en":"The group spoke antiliturgically, criticizing fixed prayers and formal ceremonies.","zh":"该团体以反礼仪的方式发言，批评固定祷文和正式仪式。"},{"en":"Some writers argue antiliturgically that spirituality should be spontaneous rather than scripted.","zh":"一些作者从反礼仪角度主张，灵性体验应当是自发的，而不是照本宣科的。"}]}],"synonyms":["anti-liturgically","in an anti-liturgical way","nonliturgically","against liturgy"],"phonetic":"/ˌæn.ti.ləˈtɝː.dʒɪ.kli/","extraExplanation":["这个词很少见，通常出现在神学、教会史或宗教批评语境中。结构上是 anti-（反对）+ liturgical（礼仪的）+ -ly（副词后缀），意思就是“以反对礼仪的方式”。","liturgical 指“与礼仪/礼拜仪式有关的”，并不等同于“宗教的”全部范围；因此 antiliturgically 更具体地针对“形式化、固定流程的崇拜方式”。"]}
{"word":"antiliturgist","summary":{"en":"An antiliturgist is someone who opposes formal, set liturgical worship in a church.","zh":"antiliturgist 指反对教会中固定、正式礼仪崇拜形式的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who opposes liturgy (set, formal forms of public worship), or who argues against using fixed liturgical services in a church.","zh":"反对礼仪（固定、正式的公共敬拜仪式）的人；主张反对在教会中使用固定礼拜仪式的人。"},"examples":[{"en":"Some antiliturgists prefer spontaneous prayer over a written service.","zh":"一些反礼仪者更偏好即兴祷告，而不是照本宣科的礼拜程序。"},{"en":"The debate between liturgists and antiliturgists shaped the church’s worship style.","zh":"礼仪派与反礼仪派之间的争论塑造了这间教会的敬拜风格。"}]}],"synonyms":["anti-ritualist","opponent of liturgy","nonliturgical advocate"],"phonetic":"/ˌæntiˈlɪtərdʒɪst/","extraExplanation":["这个词比较少见，多出现在宗教史、神学写作或教会礼仪改革的讨论中。liturgy 指“礼仪/礼拜仪式（尤其是固定文本与程序的崇拜形式）”。反礼仪立场常见的理由包括：担心形式化导致缺乏真诚、希望敬拜更自由或更符合某种教义传统。","构词很好理解：anti-（反对）+ liturgy（礼仪）+ -ist（……的人）。"]}
{"word":"antiliturgy","summary":{"en":"Antiliturgy means rejecting formal liturgy, or creating a parody/critical imitation of liturgical forms.","zh":"Antiliturgy 指对正式礼仪的拒绝/反对，也可指用礼仪形式进行戏仿或批判的作品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to formal religious liturgy, or a deliberate rejection of set prayers and ritual worship.","zh":"对正式宗教礼仪（礼拜仪式）的反对，或刻意拒绝固定祈祷与仪式化崇拜的做法。"},"examples":[{"en":"Some reformers promoted an antiliturgy because they felt fixed prayers made worship less sincere.","zh":"一些改革者主张“反礼仪”，因为他们觉得固定祷文会让敬拜显得不够真诚。"},{"en":"The group’s services were antiliturgy: no scripted readings, just spontaneous prayer and discussion.","zh":"这个团体的聚会带有“反礼仪”色彩：没有照本宣科的诵读，只有即兴祷告与讨论。"}]},{"partOfSpeech":"n.","definition":{"en":"A work (such as a poem, performance, or protest ritual) that imitates or parodies a liturgy in order to criticize it.","zh":"一种作品（如诗歌、表演或抗议仪式）：模仿或戏仿礼仪以进行批评。"},"examples":[{"en":"The playwright wrote an antiliturgy that mirrored church language to question authority.","zh":"这位剧作家写了一部“反礼仪”作品，借用教会语言来质疑权威。"},{"en":"Their antiliturgy used a call-and-response style, but the words were political instead of sacred.","zh":"他们的“反礼仪”采用呼应式朗诵，但内容是政治性的而非神圣的。"}]}],"synonyms":["anti-ritualism","anti-ceremonialism","parody liturgy","counter-liturgy"],"phonetic":"ˌæntiˈlɪtərdʒi","extraExplanation":["“antiliturgy”并不是日常高频词，更常见于宗教史、礼仪研究、文学与戏剧评论等语境。它由前缀 anti-（反对、对抗）+ liturgy（礼仪）构成。","在一些宗教传统中，“反礼仪”不一定是否定信仰本身，而可能是反对“过度形式化的崇拜方式”，强调即兴、个人体验或更平等的参与。","在文学/艺术里，“antiliturgy”常指借用礼仪的结构（如宣告、回应、诵读、祝祷）来产生讽刺或批判效果的作品。"]}
{"word":"Antillean","summary":{"en":"Antillean means “from or related to the Antilles (Caribbean islands)” and can also refer to a person from there.","zh":"Antillean 指“来自/与安的列斯群岛（加勒比海岛屿）有关的”，也可指“安的列斯群岛人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Antilles (a group of islands in the Caribbean), or to their people, cultures, or languages.","zh":"（与）安的列斯群岛（加勒比海的一组岛屿）有关的；（与）其人民、文化或语言有关的。"},"examples":[{"en":"Antillean music blends African, European, and Indigenous influences.","zh":"安的列斯群岛的音乐融合了非洲、欧洲和原住民的影响。"},{"en":"She is studying Antillean history in the colonial period.","zh":"她正在研究殖民时期的安的列斯群岛历史。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from the Antilles, or someone with Antillean heritage.","zh":"安的列斯群岛人；具有安的列斯群岛血统的人。"},"examples":[{"en":"Many Antilleans speak French, Spanish, English, or Creole, depending on the island.","zh":"许多安的列斯群岛居民会说法语、西班牙语、英语或克里奥尔语，取决于所在岛屿。"},{"en":"The festival welcomed Antilleans from across the Caribbean diaspora.","zh":"这个节日欢迎来自加勒比侨民社区的安的列斯群岛人。"}]}],"synonyms":["Caribbean (broader)","West Indian (sometimes broader/older)"],"phonetic":"/ˌæn.tɪˈliː.ən/","extraExplanation":["“Antillean”来自“Antilles（安的列斯群岛）”。地理上常分为Greater Antilles（大安的列斯：如古巴、海地/多米尼加、牙买加、波多黎各等）和Lesser Antilles（小安的列斯：东加勒比的一串岛屿）。在不同语境中，“Antillean”可能指法属安的列斯（如马提尼克、瓜德罗普）或更广义的加勒比安的列斯地区，因此在写作或研究中常需要根据上下文 уточ明指向。"]}
{"word":"antillean","summary":{"en":"Antillean means “from or relating to the Antilles (Caribbean islands),” and it can also mean a person from that region.","zh":"Antillean 指“安的列斯群岛（加勒比海岛群）的；与其有关的”，也可指“安的列斯群岛人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Antilles (the island groups in the Caribbean, including the Greater and Lesser Antilles).","zh":"安的列斯群岛的；与加勒比海安的列斯群岛（大安的列斯与小安的列斯）有关的。"},"examples":[{"en":"Antillean music blends African, European, and Indigenous influences.","zh":"安的列斯音乐融合了非洲、欧洲与原住民的影响。"},{"en":"She studies Antillean history in the context of colonialism and migration.","zh":"她在殖民与移民的背景下研究安的列斯群岛的历史。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from the Antilles.","zh":"安的列斯群岛人；来自安的列斯群岛的人。"},"examples":[{"en":"Many Antilleans speak French, Spanish, English, or Dutch, depending on the island.","zh":"许多安的列斯群岛人会说法语、西班牙语、英语或荷兰语，取决于所在岛屿。"},{"en":"The festival highlighted Antilleans living in New York and their community traditions.","zh":"这个节日聚焦居住在纽约的安的列斯群岛人及其社区传统。"}]}],"synonyms":["West Indian (often broader)","Caribbean (broader)"],"phonetic":"/ˌæn.tɪˈliː.ən/","extraExplanation":["“Antillean”常见于地理、历史、人类学与文化研究语境。它指“安的列斯群岛”这一地区，并不等同于某一个国家或单一民族。","与其相关的常见表达有：Greater Antilles（大安的列斯）、Lesser Antilles（小安的列斯），以及 French Antilles / Dutch Antilles（法属/荷属安的列斯；其中“荷属安的列斯”作为政治实体已变更，但在历史语境中仍会出现）。"]}
{"word":"Antilles","summary":{"en":"The Antilles are a group of Caribbean islands, divided into the Greater and Lesser Antilles.","zh":"安的列斯群岛是加勒比海的一组岛屿，分为大安的列斯与小安的列斯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of islands in the Caribbean Sea, including the Greater Antilles (e.g., Cuba, Hispaniola, Jamaica, Puerto Rico) and the Lesser Antilles (a chain of smaller islands to the east).","zh":"安的列斯群岛：加勒比海的一组岛屿，包括大安的列斯群岛（如古巴、伊斯帕尼奥拉岛〔海地/多米尼加所在〕、牙买加、波多黎各）和小安的列斯群岛（东部一串较小的岛屿）。"},"examples":[{"en":"Hurricanes often affect the Antilles during late summer and early fall.","zh":"飓风常在夏末初秋影响安的列斯群岛。"},{"en":"The cruise itinerary includes several ports in the Lesser Antilles.","zh":"这条邮轮航线包括小安的列斯群岛的几个港口。"},{"en":"Many cultures in the Antilles reflect African, European, and Indigenous influences.","zh":"安的列斯群岛的许多文化都体现了非洲、欧洲与原住民的影响。"}]}],"synonyms":["Caribbean islands"],"phonetic":"/ænˈtɪliz/","extraExplanation":["“Antilles”常作为地理专名使用，通常用复数形式，指整个群岛地区，而不是单一岛屿。","词源与西班牙语有关（Antillas）。历史上在欧洲航海与殖民时期，这一名称逐渐固定，用来指代加勒比的一系列岛屿。"]}
{"word":"antilles","summary":{"en":"The Antilles are a Caribbean island group, including the Greater and Lesser Antilles.","zh":"安的列斯群岛是加勒比海的岛屿群，包括大安的列斯和小安的列斯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of islands in the Caribbean Sea, divided into the Greater Antilles and the Lesser Antilles","zh":"安的列斯群岛（加勒比海的一组岛屿，分为“大安的列斯”和“小安的列斯”）"},"examples":[{"en":"Cuba and Jamaica are part of the Greater Antilles.","zh":"古巴和牙买加属于大安的列斯群岛。"},{"en":"Many cruises stop at ports in the Lesser Antilles.","zh":"许多邮轮会停靠小安的列斯群岛的港口。"}]}],"synonyms":["the Caribbean islands","West Indies (overlapping term)"],"phonetic":"/ænˈtɪliz/","extraExplanation":["“Antilles”通常以复数形式出现（the Antilles），因为它指的是一整片岛屿群。常见地理分法：Greater Antilles（古巴、伊斯帕尼奥拉岛〔海地与多米尼加〕、牙买加、波多黎各等）与 Lesser Antilles（从维尔京群岛一路到特立尼达和多巴哥附近的弧形岛链）。","在历史与文化语境里，“the Antilles”常与殖民史、甘蔗种植园、跨大西洋贸易以及多语言文化（西班牙语、法语、英语、荷兰语与克里奥尔语等）联系在一起。"]}
{"word":"antilobium","summary":{"en":"Antilobium is a rare anatomy term for the antitragus, a small cartilage bump on the outer ear above the earlobe.","zh":"Antilobium 是较少见的解剖学词，指外耳的“对耳屏”（antitragus），位于耳垂上方的小软骨突起。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small bump of cartilage on the outer ear, opposite the tragus and just above the earlobe; the antitragus.","zh":"外耳上一小块软骨突起，位于耳屏（tragus）对面、耳垂上方；即“对耳屏”（antitragus）。"},"examples":[{"en":"The piercer checked the antilobium to make sure it had enough cartilage for the jewelry.","zh":"穿孔师检查了对耳屏（antilobium），确认软骨厚度足够佩戴饰品。"},{"en":"In ear anatomy diagrams, the antilobium is often labeled as the antitragus.","zh":"在耳部解剖图中，antilobium 常被标注为 antitragus（对耳屏）。"}]}],"synonyms":["antitragus"],"phonetic":"/ˌæn.tɪˈloʊ.bi.əm/","extraExplanation":["这是一个较少见、偏医学/解剖学的词，在现代英语里更常用 antitragus 来指代同一结构。"]}
{"word":"Antilocapra","summary":{"en":"Antilocapra is the scientific genus name for the pronghorn, a North American animal often miscalled an antelope.","zh":"Antilocapra 是叉角羚的属名（学名），叉角羚是北美动物，常被误称为羚羊。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of North American mammals that includes the pronghorn (Antilocapra americana), often mistakenly called an “antelope.”","zh":"北美哺乳动物的一个属，包含叉角羚（Antilocapra americana）。它常被误称为“羚羊（antelope）”。"},"examples":[{"en":"Antilocapra is best known for the single living species, the pronghorn.","zh":"Antilocapra 最有名的是它唯一现存的物种——叉角羚。"},{"en":"Scientists use the genus name Antilocapra in taxonomy and research papers.","zh":"科学家在分类学和研究论文中会使用属名 Antilocapra。"}]}],"synonyms":["pronghorn (common name)","Antilocapra americana (species name)"],"phonetic":"/ˌæn.tɪ.loʊˈkæp.rə/","extraExplanation":["“Antilocapra”是拉丁化的学名，用于生物分类；日常英语里更常说“pronghorn（叉角羚）”。","叉角羚并不是真正的“antelope（羚羊）”，而是北美特有的一支，和非洲、亚洲的真羚羊并非同一类群；但因为外形相似，早期英语使用者常把它叫作“American antelope（美洲羚羊）”。","词源上可拆成“anti-（类似/对照）+ locapra（与羊/山羊相关的元素）”，大意是“像山羊/羚羊那样的动物”。"]}
{"word":"antilocapra","summary":{"en":"Antilocapra is the scientific genus name for the pronghorn of North America.","zh":"Antilocapra 是北美叉角羚的科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of North American mammals; it includes the pronghorn (Antilocapra americana).","zh":"北美哺乳动物的一个属；包含叉角羚（学名 Antilocapra americana）。"},"examples":[{"en":"Antilocapra americana is commonly called the pronghorn.","zh":"Antilocapra americana 通常被称为叉角羚。"},{"en":"In older scientific writing, Antilocapra appears as the genus name for the pronghorn.","zh":"在较早的科学文献中，Antilocapra 常作为叉角羚的属名出现。"}]}],"synonyms":["pronghorn","Antilocapra americana (species name)"],"phonetic":"/ˌæn.tɪ.loʊˈkæp.rə/","extraExplanation":["“Antilocapra”是拉丁化的动物学属名，主要用于生物分类（如论文、科普、博物馆标牌）。日常英语更常说“pronghorn”。","叉角羚常被误称为“antelope（羚羊）”，但它并不是真正的旧大陆羚羊；它属于独特的叉角羚科（Antilocapridae），是北美特有谱系。"]}
{"word":"Antilocapridae","summary":{"en":"Antilocapridae is the scientific family name for the pronghorn (North America’s unique pronghorn family).","zh":"Antilocapridae 指叉角羚科，是北美叉角羚所属的科学分类科名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific family of mammals that includes the pronghorn (the only living species in this family), native to North America.","zh":"偶蹄目中的一个哺乳动物科（叉角羚科）；现存仅有叉角羚这一种，原产北美洲。"},"examples":[{"en":"The pronghorn belongs to the family Antilocapridae.","zh":"叉角羚属于叉角羚科（Antilocapridae）。"},{"en":"In North American wildlife studies, Antilocapridae is often discussed alongside deer and bovids.","zh":"在北美野生动物研究中，叉角羚科（Antilocapridae）常与鹿科和牛科一起被讨论。"}]}],"synonyms":["pronghorn family"],"phonetic":"/ˌæn.tɪ.loʊˈkæp.rɪ.di/","extraExplanation":["“Antilocapridae”是拉丁化的动物分类学名称，常见于学术论文、博物馆说明牌、动物志等正式语境；日常英语更常说“the pronghorn”或“the pronghorn family”。","叉角羚（pronghorn）外形像羚羊，但并不属于真正的羚羊（多在牛科 Bovidae）；它在北美是独特的一支，因此“Antilocapridae”常被用来强调其分类上的独立性。"]}
{"word":"antilocapridae","summary":{"en":"Antilocapridae is the scientific family name for the pronghorn and its relatives (now only the pronghorn survives).","zh":"Antilocapridae 是叉角羚科的学名，指叉角羚及其近亲（现生仅存叉角羚）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the mammal family that includes the pronghorn (Antilocapra americana), a fast-running hoofed animal native to North America","zh":"叉角羚科：包含叉角羚（Antilocapra americana）的哺乳动物科，原产北美、善于奔跑的有蹄类动物"},"examples":[{"en":"The Antilocapridae are represented today by only one living species: the pronghorn.","zh":"现生的叉角羚科如今只剩下一种：叉角羚。"},{"en":"In North American grasslands, the pronghorn is the best-known member of Antilocapridae.","zh":"在北美草原上，叉角羚是叉角羚科中最广为人知的成员。"}]}],"synonyms":["pronghorn family"],"phonetic":"/ˌæn.tɪ.loʊˈkæp.rɪ.di/","extraExplanation":["“Antilocapridae”是动物分类学中的“科（family）”名称，常见于生物学、动物学与自然史写作中；日常英语里更常说“the pronghorn”或“the pronghorn family”。","叉角羚并不是“羚羊（antelope）”的真正成员（羚羊多分布于非洲与欧亚，属牛科 Bovidae）；它是北美特有的一支独立谱系，因此用科名 Antilocapridae 来强调其分类地位更准确。"]}
{"word":"Antilochus","summary":{"en":"Antilochus is a hero from Greek mythology connected to the Trojan War, known for loyalty and bravery; it can also be used as a male name.","zh":"安提洛科斯是希腊神话中与特洛伊战争相关的英雄，以忠诚与勇敢著称；也可作男性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Trojan War hero in Greek mythology, the son of Nestor and a close companion of Achilles; he is best known for his loyalty and for dying while protecting his father.","zh":"希腊神话与特洛伊战争中的英雄人物：涅斯托耳（Nestor）之子、阿基里斯（Achilles）的亲密伙伴；以忠诚著称，并因保护父亲而战死最为人熟知。"},"examples":[{"en":"In some retellings of the Trojan War, Antilochus brings crucial news to Achilles.","zh":"在一些特洛伊战争的改写版本中，安提洛科斯给阿基里斯带来关键消息。"},{"en":"Antilochus is often portrayed as brave, loyal, and devoted to his family.","zh":"安提洛科斯常被描写为勇敢、忠诚且重视家庭。"}]},{"partOfSpeech":"n.","definition":{"en":"A male given name taken from the mythological figure.","zh":"源自该神话人物的男性名字。"},"examples":[{"en":"The author named a character Antilochus to suggest a heroic, classical background.","zh":"作者把角色取名为安提洛科斯，以暗示英雄气质与古典背景。"}]}],"synonyms":["(mythology) Nestor’s son","Trojan War hero","Greek mythological figure"],"phonetic":"/ænˈtɪləkəs/","extraExplanation":["“Antilochus”属于希腊古典文化常见的专有名词，多出现在史诗、悲剧、神话改写与古典文学研究中。","他与父亲涅斯托耳的关系常被用来体现“孝爱/护亲”的主题；与阿基里斯的关系则体现战友情与忠诚。"]}
{"word":"antilochus","summary":{"en":"Antilochus is a heroic figure from Greek mythology (the Iliad), known as Nestor’s son and a loyal companion of Achilles.","zh":"安提洛科斯是《伊利亚特》中的希腊神话英雄人物，涅斯托尔之子，因对阿喀琉斯的忠诚而闻名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A warrior in Greek mythology: the son of Nestor and a companion of Achilles in Homer’s Iliad, remembered for bravery and loyalty.","zh":"希腊神话人物：涅斯托尔（Nestor）之子，《伊利亚特》中阿喀琉斯的同伴之一，以勇敢与忠诚著称。"},"examples":[{"en":"In the Iliad, Antilochus fights alongside the Greek forces during the Trojan War.","zh":"在《伊利亚特》中，安提洛科斯在特洛伊战争期间与希腊联军并肩作战。"},{"en":"Antilochus is often described as loyal and quick to act.","zh":"安提洛科斯常被描写为忠诚、行动迅速的人。"}]}],"synonyms":["(proper name)"],"phonetic":"/ænˈtɪləˌkəs/","extraExplanation":["“Antilochus（安提洛科斯）”主要出现在荷马史诗《伊利亚特》及相关希腊神话传统中，常被用作“忠诚的年轻战士”的典型形象。","在部分版本的故事里，他与父亲涅斯托尔的关系也很重要：涅斯托尔是智慧与经验的象征，而安提洛科斯则体现青年勇气与孝亲/忠义。","现代英语里，这个词通常作为专有名词出现在文学、神话、古典学研究或改写作品中，不是日常通用词。"]}
{"word":"antiloemic","summary":{"en":"A medical adjective meaning “against leukemia.”","zh":"医学形容词，意为“抗白血病的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Acting against leukemia; used to describe drugs or treatments that fight leukemia.","zh":"（医学）抗白血病的；用于描述对抗白血病的药物或治疗方法。"},"examples":[{"en":"The patient started an antileukemic drug as part of chemotherapy.","zh":"病人开始使用抗白血病药物，作为化疗的一部分。"},{"en":"Researchers are testing new antileukemic therapies for children.","zh":"研究人员正在测试新的儿童抗白血病疗法。"}]}],"synonyms":["antileukaemic","anti-leukemia"],"phonetic":"/ˌæn.ti.luˈki.mɪk/","extraExplanation":["“antiloemic”不是常见标准拼写。你可能想写的是 **antileukemic**（美式）或 **antileukaemic**（英式），意思是“抗白血病的”。","词缀帮助记忆：**anti-** = “反对/对抗”，**leukemia** = “白血病”，合起来就是“对抗白血病的”。","这个词主要用于医学语境（论文、病历、药物说明）。日常英语里更常说 “a drug for leukemia / leukemia treatment”。"]}
{"word":"antilog","summary":{"en":"“Antilog” means the inverse of a logarithm—the number obtained by raising a base to a power.","zh":"“Antilog”指“反对数”，即对数的逆运算：把底数提升到某个指数得到的数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Math) The inverse of a logarithm; the number you get by raising a base to a given power. For example, the antilog of 3 (base 10) is 10³ = 1000.","zh":"（数学）对数的逆运算；把某个底数提高到给定指数后得到的数。例如（以10为底）3的反对数是10³ = 1000。"},"examples":[{"en":"If log10(x) = 2, then the antilog (base 10) is x = 100.","zh":"如果log10(x) = 2，那么（以10为底）的反对数就是x = 100。"},{"en":"Many calculators have an antilog function to undo a logarithm.","zh":"很多计算器都有反对数功能，用来把对数运算“还原”。"}]}],"synonyms":["antilogarithm","inverse logarithm"],"phonetic":"/ˈæn.t̬i.lɑːɡ/","extraExplanation":["“antilog”常被当作“antilogarithm（反对数）”的简写，尤其在旧教材、工程计算或口语里更常见。","反对数必须说明“底”（base），常见的是以10为底（log10）或以e为底（ln）。例如：若ln(x)=1，则x=e（这可以看作以e为底的反对数）。","在计算器上常见的对应按键是：10^x（对应log10的反函数）和e^x（对应ln的反函数）。"]}
{"word":"antilogarithm","summary":{"en":"An antilogarithm is the inverse of a logarithm: it converts a log value back to the original number (x=b^y).","zh":"反对数是对数的逆：把对数值还原成原来的数（x=b^y）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A number that is the inverse result of a logarithm; if log_b(x)=y, then the antilogarithm of y (base b) is x (that is, x=b^y).","zh":"对数的逆运算结果；若 log_b(x)=y，则 y（以 b 为底）的反对数是 x（即 x=b^y）。"},"examples":[{"en":"The antilogarithm of 2 in base 10 is 100, because 10^2 = 100.","zh":"以 10 为底，2 的反对数是 100，因为 10^2 = 100。"},{"en":"To undo a logarithm, we take the antilogarithm (raise the base to the given power).","zh":"要“抵消”对数运算，我们取反对数（用底数的幂来还原）。"}]}],"synonyms":["inverse logarithm","exponential (result)"],"phonetic":"/ˌæn.tiˈlɔɡ.əˌrɪð.əm/","extraExplanation":["“反对数（antilogarithm）”在现代数学课本里更常用“exponential form（指数形式）”来表达：与其说“取反对数”，不如直接说“把底数 b 提到 y 次方得到 b^y”。","历史上有“antilog tables（反对数表）”，用于在没有计算器时快速从对数值查回原数；现在多由计算器/电脑完成。","注意：反对数必须说明“底（base）”。不说底时，在很多科学场景里 log 常默认是以 10 为底，ln 则是以 e 为底。"]}
{"word":"antilogarithmic","summary":{"en":"Antilogarithmic means “related to reversing a logarithm,” used for finding the original number from its log.","zh":"antilogarithmic 表示“与反对数（对数的逆运算）有关”，用于从对数值还原出原数。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to an antilogarithm; used to describe a number or operation that reverses a logarithm (i.e., finds the original number from its logarithm).","zh":"反对数的；与反对数有关的；用于描述“把对数还原成原数”的数或运算。"},"examples":[{"en":"To get the original value, you apply an antilogarithmic operation to the logarithm.","zh":"要得到原来的数值，你需要对该对数进行反对数运算。"},{"en":"The calculator has an antilogarithmic function to undo log calculations.","zh":"这台计算器有反对数功能，用来“撤销”对数计算。"}]}],"synonyms":["antilog","exponential (in context)"],"phonetic":"/ˌæn.taɪˌlɔː.ɡəˈrɪð.mɪk/","extraExplanation":["“antilogarithmic”在数学学习中常见，但日常英语里很少用；更常见的说法是“antilog”或直接说“raise the base to the power”。例如：如果 log10(x)=2，那么 x=10^2=100，这一步就是取反对数。","注意区分：antilogarithm（反对数，名词）指结果/原数；antilogarithmic（形容词）描述与反对数相关的性质或过程。"]}
{"word":"antilogarithms","summary":{"en":"Antilogarithms are the original numbers you get when you reverse a logarithm (the inverse of a logarithm).","zh":"反对数（复数）指把对数运算反过来后得到的原始数，即对数的逆运算结果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Numbers that are the result of reversing a logarithm; if log10(x)=y, then x is the antilogarithm of y (base 10).","zh":"（复数）反对数：对数运算的“逆结果”；如果 log10(x)=y，那么 x 就是 y 的反对数（以10为底）。"},"examples":[{"en":"To find the antilogarithm of 2 (base 10), calculate 10^2, which equals 100.","zh":"要求 2 的反对数（以10为底），计算 10^2，结果是 100。"},{"en":"Older textbooks sometimes use antilogarithm tables to convert logarithms back to ordinary numbers.","zh":"较早的教材有时会用反对数表把对数值换回普通数字。"}]}],"synonyms":["antilogs","inverse logarithms","exponentials (in context)"],"phonetic":"/ˌæn.tiˈlɔː.ɡəˌrɪð.əmz/","extraExplanation":["“antilogarithm”常缩写为“antilog”。在现代数学与科学计算中，人们更常直接说“take 10 to the power of y”（算 10 的 y 次方）或更一般地说“exponentiate”（做指数运算），而不是单独强调“反对数”。","注意“反对数”不是“负对数”。“anti-”在这里表示“逆运算/相反过程”，即把对数值还原成原来的数。"]}
{"word":"antilogic","summary":{"en":"Antilogic means something that goes against logic—either illogical reasoning (noun) or an illogical quality (adjective).","zh":"antilogic 指“反逻辑、违背逻辑”的内容：可作名词表示不合逻辑的推理，也可作形容词表示“不合逻辑的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often informal) Reasoning, language, or an idea that goes against logic; illogical thinking.","zh":"（常为非正式用法）反逻辑的推理、说法或观点；不合逻辑的思维。"},"examples":[{"en":"The argument is pure antilogic: it contradicts itself in the first two sentences.","zh":"这个论证完全是反逻辑的：前两句话就自相矛盾。"},{"en":"Superstitions can feel comforting, but they are usually antilogic.","zh":"迷信可能让人觉得安心，但通常是不合逻辑的。"}]},{"partOfSpeech":"adj.","definition":{"en":"Opposed to logic; illogical or self-contradictory.","zh":"反逻辑的；不合逻辑的；自相矛盾的。"},"examples":[{"en":"His antilogic explanation only made the situation more confusing.","zh":"他那套反逻辑的解释只让情况更混乱。"},{"en":"It’s antilogic to demand honesty while rewarding lying.","zh":"一边要求诚实一边奖励撒谎，这是反逻辑的。"}]}],"synonyms":["illogical","irrational","nonsensical","contradictory","counterintuitive"],"phonetic":"ˌæn.taɪˈlɑː.dʒɪk","extraExplanation":["“antilogic”不是日常高频词，更常见的表达是“illogical / irrational / contrary to logic”。它通常带有批评意味，用来指出某种说法或推理不讲道理、前后矛盾。","构词上：anti- 表示“反对、对立”，logic 表示“逻辑”。因此字面意思就是“反逻辑”。"]}
{"word":"antilogical","summary":{"en":"“Antilogical” means illogical—against or inconsistent with logic.","zh":"“antilogical”指“不合逻辑的”，与逻辑相违背或不一致。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Contrary to logic; not following reasonable or consistent thinking; irrational.","zh":"反逻辑的；不合逻辑的；不理性的。"},"examples":[{"en":"It’s antilogical to ignore clear evidence just because you don’t like the conclusion.","zh":"因为不喜欢结论就忽视明显证据，这是不合逻辑的。"},{"en":"Her argument sounds emotional, but parts of it are antilogical and don’t connect well.","zh":"她的论点听起来很情绪化，但其中有些部分不合逻辑，衔接不够严密。"}]}],"synonyms":["illogical","irrational","inconsistent","unreasonable","contrary to logic"],"phonetic":"ˌæn.tiˈlɑː.dʒɪ.kəl","extraExplanation":["“antilogical”由前缀 anti-（反对、相反）+ logical（合逻辑的）构成，意思直观，但在现代英语里相对少见。日常写作中更常用的替代表达有：illogical, irrational, contrary to logic。","它常用于批评推理或论证方式（argument/reasoning），语气偏正式。"]}
{"word":"antilogies","summary":{"en":"Antilogies are contradictions or inconsistencies—either between ideas or within a single statement.","zh":"Antilogies 指各种矛盾与不一致，既可发生在不同观点之间，也可指一句话中的自相矛盾。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a contradiction between two statements or ideas; an inconsistency.","zh":"（两种说法或观点之间的）矛盾；不一致。"},"examples":[{"en":"There is an antilogy between the report’s introduction and its conclusion.","zh":"这份报告的引言和结论之间存在矛盾。"},{"en":"The judge noted an antilogy in the witness’s testimony.","zh":"法官指出证人的证词前后不一致。"}]},{"partOfSpeech":"n.","definition":{"en":"self-contradiction within a single statement (saying something that cancels itself).","zh":"（同一句话中的）自相矛盾。"},"examples":[{"en":"“I always lie” is often discussed as an antilogy.","zh":"“我总是在说谎”常被拿来讨论为一种自相矛盾。"},{"en":"His explanation contained an antilogy: he said he was never late, but also that he missed the meeting.","zh":"他的解释自相矛盾：他说自己从不迟到，却又说错过了会议。"}]}],"synonyms":["contradiction","inconsistency","self-contradiction","paradox","discrepancy"],"phonetic":"/ænˈtɪlədʒi/","extraExplanation":["“antilogy”的词源来自希腊语：anti-（反对）+ logos（言语/论证），字面意思是“反对的言辞”。在修辞与哲学讨论中，它可指两种相反论证的对立，也可指话语内部的自我抵触。","你输入的是复数“antilogies”，单数是“antilogy”。写作中更常见的近义表达有“contradiction”“inconsistency”“self-contradiction”。"]}
{"word":"antilogism","summary":{"en":"An antilogism is a contradiction or inconsistency within reasoning or statements.","zh":"antilogism 指推理或陈述中的矛盾与不一致（自相抵触）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a contradiction or inconsistency in reasoning, statements, or ideas (especially within the same argument or text).","zh":"（尤指同一论证或文本中的）矛盾、不一致、自相抵触。"},"examples":[{"en":"The essay contains an antilogism: it argues for free speech but supports banning unpopular opinions.","zh":"这篇文章里有一个自相矛盾之处：它一方面主张言论自由，一方面又支持禁止不受欢迎的观点。"},{"en":"When we compared the two reports, we found an antilogism in the timeline.","zh":"我们对比两份报告后，发现时间线存在不一致（自相抵触）。"}]}],"synonyms":["contradiction","inconsistency","self-contradiction","antinomy"],"phonetic":"/ænˈtɪlədʒɪzəm/","extraExplanation":["这个词来自希腊语词根 anti-（反对、相对）+ logos（言语、理性、论证），常用于指出“论证内部的矛盾”。在实际英语中，它比较少见，更常用的日常说法是 contradiction / inconsistency；学术或修辞语境中也常见相关词 antilogy（更常见）。"]}
{"word":"antilogistic","summary":{"en":"Antilogistic means “illogical” or “opposed to logical reasoning.”","zh":"antilogistic 指“反逻辑的/不合逻辑的”，强调与逻辑推理相违背。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to logic; not based on clear reasoning; illogical.","zh":"反逻辑的；不合逻辑的；缺乏清晰推理依据的。"},"examples":[{"en":"The article makes an antilogistic jump from one idea to another without evidence.","zh":"这篇文章在没有证据的情况下从一个观点跳到另一个观点，推理很反逻辑。"},{"en":"Her antilogistic conclusion confused the audience because it didn’t follow from her facts.","zh":"她的结论不合逻辑，让听众困惑，因为它并非由她列出的事实推导出来。"}]}],"synonyms":["illogical","unreasonable","irrational","incoherent","not logical"],"phonetic":"ˌæn.ti.ləˈdʒɪs.tɪk","extraExplanation":["这个词很少见，多用于较正式或学术化的语境。词根来自希腊语：anti-（“反对”）+ logic（“逻辑/推理”）。日常英语里更常用的说法是 illogical、unreasonable、not logical。"]}
{"word":"antilogistically","summary":{"en":"Antilogistically means “in a way that argues against or contradicts something.”","zh":"antilogistically 指“以反驳或与之相矛盾的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that contradicts or argues against something; using counter-arguments.","zh":"以反驳、对立论证的方式；用反面论据来争辩。"},"examples":[{"en":"The reviewer responded antilogistically, pointing out evidence that directly challenged the author’s claim.","zh":"评论者以反驳的方式回应，提出直接挑战作者观点的证据。"},{"en":"Instead of agreeing, she spoke antilogistically and offered a different interpretation of the data.","zh":"她没有赞同，而是以反对论证的方式发言，并对数据提出不同解读。"}]}],"synonyms":["contradictorily","oppositely","contentiously","adversarially","in rebuttal"],"phonetic":"/ˌæn.ti.ləˈdʒɪs.tɪk.li/","extraExplanation":["这个词很少见，通常出现在哲学、修辞或学术语境中。它来自 antilogism（“反驳/对立论证”）+ -ically（“以……方式”）。词根 anti- 表示“反对”，log- 与“言说/推理（logic）”相关。","实际写作里更常用的替代表达是: “in a contradictory way / in opposition / to argue against / to refute”。"]}
{"word":"antilogous","summary":{"en":"“Antilogous” is a rare/nonstandard adjective meaning “not analogous; dissimilar,” and it is often a mistaken form of “analogous” or related to “antilog(arit hm)” in math.","zh":"“Antilogous”是罕见且多被视为非标准的形容词，可表示“不类似/不可类比”；但常见情况是把“analogous（相似的）”拼错，或与数学中的“antilog/antilogarithm（反对数）”混淆。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare / nonstandard) Not analogous; not comparable in a clear way; dissimilar.","zh":"（罕见/非标准用法）不相似的；不具可比性的；不同类的。"},"examples":[{"en":"These two cases are antilogous, so the comparison is misleading.","zh":"这两个案例并不相似，因此这种比较会产生误导。"},{"en":"The author treats the situations as antilogous and avoids drawing a direct parallel.","zh":"作者认为这些情境不具可比性，因此避免直接类比。"}]}],"synonyms":["dissimilar","unlike","incomparable","nonanalogous"],"phonetic":"/ænˈtɪləɡəs/","extraExplanation":["“antilogous”在现代英语中非常少见，也常被视为拼写或用词错误。你可能想写的是：\n1) analogous（相似的、可类比的）：The two problems are analogous.\n2) antilogarithm / antilog（反对数）：在数学里指“对数的逆运算结果”。\n如果你告诉我你看到它的句子语境，我可以更准确判断应当用哪个词。"]}
{"word":"antilogs","summary":{"en":"“Antilogs” is the plural of “antilog,” most commonly meaning the antilogarithm (the inverse of a logarithm).","zh":"“antilogs”是“antilog”的复数，最常见含义是“反对数”（对数的逆运算）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Math) The antilogarithm: the number you get when you reverse a logarithm (the inverse operation of taking a logarithm).","zh":"（数学）反对数：对数运算的逆运算所得的数。"},"examples":[{"en":"The antilog of 2 (base 10) is 100.","zh":"以10为底时，2的反对数是100。"},{"en":"Use the antilog to convert a log value back to the original number.","zh":"用反对数把对数值转换回原来的数。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A statement or argument that contradicts another; a contradiction.","zh":"（较少见）与他人说法相反的陈述或论点；反驳；矛盾。"},"examples":[{"en":"In the debate, he offered an antilog to challenge the main claim.","zh":"在辩论中，他提出了反驳来挑战主要观点。"}]}],"synonyms":["antilogarithm","inverse logarithm","(rare) contradiction"],"phonetic":"/ˈæntiˌlɔɡ/","extraExplanation":["“antilogs”是名词复数，单数是“antilog”。在数学里更常用的完整说法是“antilogarithm（反对数）”。","常见场景：如果log10(x)=2，那么x=10^2=100；因此“antilog(2)”（以10为底）就是100。不同底数时，要先确认底（base）。","在现代英语里，“antilog”表示“反对数”较常见；表示“反驳/矛盾”的用法较少见，多见于较旧或较学术的语境。"]}
{"word":"antilogy","summary":{"en":"Antilogy means a contradiction, especially when someone (or a text) contradicts itself.","zh":"Antilogy 指“矛盾（尤指自相矛盾）”，常用于修辞或文学分析。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rhetoric, literature) A contradiction between two statements, ideas, or parts of a text; especially a self-contradiction.","zh":"（修辞/文学）两种说法、观点或文本部分之间的矛盾；尤指“自相矛盾”。"},"examples":[{"en":"The speaker’s argument contains an antilogy: he says freedom is essential, then argues people should never choose for themselves.","zh":"这位演讲者的论证里有一处 antilogy：他先说自由至关重要，随后又主张人们永远不该自己做选择。"},{"en":"Readers sometimes point out antilogy in the novel when a character describes the same event in two incompatible ways.","zh":"读者有时会指出小说中的 antilogy：某个角色用两种互不相容的方式描述同一件事。"}]}],"synonyms":["contradiction","inconsistency","self-contradiction"],"phonetic":"/ænˈtɪlədʒi/","extraExplanation":["这个词较少见，常出现在文学批评、修辞分析或学术写作中。词源来自希腊语：anti-（反对/相反）+ logos（言语/论述），字面含义接近“相反的说法”。","它和 paradox（悖论）不同：paradox 往往“表面矛盾但可能有深意/为真”，而 antilogy 更偏向“前后说法互相打架”，通常被视为逻辑或叙述上的不一致。"]}
{"word":"antiloimic","summary":{"en":"Antiloimic means “preventing or stopping infectious disease,” especially in older medical writing.","zh":"antiloimic 指“防止或抑制传染病的”，多见于较旧的医学文献（尤指瘟疫/流行病）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"preventing or stopping infectious disease (especially a plague or epidemic); anti-infective.","zh":"防止或抑制传染病（尤指瘟疫或流行病）的；抗感染的。"},"examples":[{"en":"Doctors once used various antiloimic measures to reduce the spread of plague.","zh":"过去医生会使用各种抗疫（防瘟）的措施来减少瘟疫传播。"},{"en":"Good sanitation was considered an antiloimic strategy long before modern antibiotics.","zh":"在现代抗生素出现之前，良好卫生就被视为一种防止传染病的策略。"}]}],"synonyms":["anti-infective","antimicrobial","prophylactic","antiseptic"],"phonetic":"/ˌæn.tiˈlɔɪ.mɪk/","extraExplanation":["该词非常罕见，多见于旧式医学/公共卫生语境。词源可拆为 anti-（反、抗）+ loim-（与“瘟疫/疫病”相关，源自希腊语 loimos，意为 plague）。现代英语里更常用的表达是 anti-infective（抗感染的）、antimicrobial（抗微生物的）或 prophylactic（预防性的），具体用哪个取决于语境。"]}
{"word":"Antilope","summary":{"en":"An antelope is a fast, slender hoofed animal, often found in Africa or Asia.","zh":"antelope 指“羚羊”，是一类常见于非洲或亚洲、奔跑很快的有蹄动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fast, slender hoofed animal (often living in Africa or Asia) that looks like a deer and usually has horns","zh":"羚羊：一种奔跑很快、身形纤细的有蹄动物（多生活在非洲或亚洲），外形类似鹿，通常长角"},"examples":[{"en":"We saw an antelope running across the grassland.","zh":"我们看到一只羚羊跑过草原。"},{"en":"Antelopes can move quickly to escape predators.","zh":"羚羊能快速奔跑以躲避捕食者。"}]}],"synonyms":["gazelle","buck"],"phonetic":"/ˈæntəˌloʊp/","extraExplanation":["你输入的拼写是“Antilope”，标准拼写通常是“antelope”。两者读音相近，但写作和正式场合建议用 antelope。","“antelope”不是指单一一种动物，而是对多种类似的有角有蹄动物的统称（常见于非洲草原生态语境）。"]}
{"word":"antilope","summary":{"en":"Antilope is a common misspelling of antelope, meaning a fast-running hoofed animal (a kind of deer-like animal) often found in Africa and Asia.","zh":"antilope 常见为 antelope 的拼写错误；antelope 指“羚羊”，一种奔跑很快的有蹄动物，常见于非洲和亚洲部分地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common misspelling) Intended word: antelope — a fast-running hoofed animal, usually with horns, found in Africa and parts of Asia.","zh":"（常见拼写错误）想表达的词通常是 antelope（羚羊）——一种奔跑很快的有蹄动物，通常有角，主要分布在非洲及部分亚洲地区。"},"examples":[{"en":"I saw an antelope on the safari.","zh":"我在野外观光（safari）时看到了一只羚羊。"},{"en":"Antelopes can run very fast to escape predators.","zh":"羚羊能跑得很快来躲避捕食者。"}]}],"synonyms":["antelope","gazelle"],"phonetic":"/ˈæntəˌloʊp/","extraExplanation":["“antilope”通常不是标准英语拼写，标准拼写是 **antelope**。在写作或考试中建议用 antelope。","发音里常见的重音在第一个音节：**AN**-tuh-lohp。","“antelope”在英文里既可泛指“羚羊类动物”，也常在科普/旅行语境中出现（如非洲草原、野生动物纪录片、safari）。"]}
{"word":"Antilopinae","summary":{"en":"Antilopinae is a scientific name for a subfamily of Bovidae that includes many antelopes such as gazelles.","zh":"Antilopinae 是一个科学分类名，指牛科下的羚羊亚科，包含瞪羚等多种羚羊类动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a taxonomic subfamily of the family Bovidae that includes many “true antelopes,” such as gazelles and related species","zh":"（动物分类）牛科（Bovidae）下的一个亚科，包含许多常说的“羚羊类”，如瞪羚（gazelles）及其近缘种"},"examples":[{"en":"Gazelles are commonly placed in the subfamily Antilopinae.","zh":"瞪羚通常被归入羚羊亚科（Antilopinae）。"},{"en":"In one classification, Antilopinae includes several small, fast-running antelopes adapted to open grasslands.","zh":"在一种分类体系中，羚羊亚科（Antilopinae）包含多种体型较小、奔跑迅速、适应开阔草原环境的羚羊。"}]}],"synonyms":["antelope subfamily","true antelopes (informal)"],"phonetic":"/ænˌtɪləˈpaɪni/","extraExplanation":["“Antilopinae”是拉丁化的科学分类名称，结尾“-inae”表示“亚科”（subfamily）。在不同的动物分类研究中，哪些物种被纳入Antilopinae可能会有调整；阅读科普或论文时，最好同时查看其所采用的分类体系（taxonomy）。"]}
{"word":"antilopinae","summary":{"en":"Antilopinae is the scientific name for a bovid subfamily that includes many antelopes (e.g., gazelles).","zh":"Antilopinae 是牛科中的“羚羊亚科”的学名，包含许多羚羊类动物（如瞪羚）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a subfamily of bovids (family Bovidae) that includes many antelopes, such as gazelles and related species.","zh":"牛科（Bovidae）中的一个亚科，包含许多羚羊类动物，例如瞪羚及其近缘物种。"},"examples":[{"en":"Gazelles are often classified within Antilopinae.","zh":"瞪羚通常被归类在羚羊亚科（Antilopinae）中。"},{"en":"In the museum display, the label read “Bovidae: Antilopinae.”","zh":"在博物馆展柜里，标签写着“牛科：羚羊亚科（Antilopinae）”。"}]}],"synonyms":["antelope subfamily","bovid subfamily (Antilopinae)"],"phonetic":"/ænˌtɪləˈpaɪni/","extraExplanation":["“Antilopinae”是拉丁化的科学名称，用于生物分类学（属、科、亚科等层级）。日常英语里更常说“antelopes（羚羊）”或更具体的名称（如“gazelle 瞪羚”）。","不同分类体系可能对哪些动物算作Antilopinae有细微差异；在学术文章中通常会给出所用分类参考。"]}
{"word":"antilopine","summary":{"en":"“Antilopine” describes something that looks or moves like an antelope.","zh":"“antilopine”用来形容外形或动作像羚羊的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like an antelope in appearance or movement; relating to antelopes.","zh":"像羚羊的；与羚羊有关的。"},"examples":[{"en":"The dancer’s light, antilopine leaps impressed the audience.","zh":"舞者轻盈、如羚羊般的跳跃令观众印象深刻。"},{"en":"The sculpture shows an antilopine creature with slender legs and a narrow head.","zh":"这座雕塑刻画了一种羚羊般的生物：细长的腿和狭长的头部。"}]}],"synonyms":["antelope-like","gazelle-like","graceful","fleet"],"phonetic":"/ænˈtɪləˌpaɪn/","extraExplanation":["词源上来自“antelope（羚羊）+ -ine（……的，具有……性质的）”。常见于文学描写、动物学或艺术评论，用来强调“轻快、敏捷、身形修长”的感觉。","使用提示：它比常见的“deerlike（像鹿的）”更强调速度与灵巧，也更带一点书面、修辞色彩。"]}
{"word":"antiloquy","summary":{"en":"Antiloquy is a rare noun meaning verbal contradiction or speaking against someone.","zh":"Antiloquy 是一个罕见名词，指用言语反驳、顶嘴或表示反对。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) speech or talk that contradicts, talks back, or speaks against someone; contradiction or opposition in words.","zh":"（罕见）反驳性的言语；顶嘴；用言语表示反对或矛盾。"},"examples":[{"en":"His antiloquy during the meeting slowed the discussion to a crawl.","zh":"他在会议上的一再反驳让讨论进展得非常缓慢。"},{"en":"The essay is full of antiloquy, challenging the author’s main claims line by line.","zh":"这篇文章充满了反驳，逐条质疑作者的主要论点。"}]}],"synonyms":["contradiction","opposition","rebuttal","backtalk","counterargument"],"phonetic":"/ænˈtɪləkwɪ/","extraExplanation":["“antiloquy”非常少见，写作中更常用的是“contradiction / opposition / rebuttal”。","词源上可理解为“anti-（反对）+ loqu-（说话）”，字面就是“反着说/对着说”。","它和更常见的词“antilogy”（自相矛盾、逻辑矛盾）在形式和意义上相近，但“antiloquy”更偏“与人对话时的反驳/顶撞”。"]}
{"word":"antilottery","summary":{"en":"Antilottery means opposing lotteries, or a person/group that opposes them.","zh":"antilottery 指“反对彩票的”，也可指“反对彩票的人或团体”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to lotteries or the promotion of lotteries.","zh":"反对彩票（抽奖）或反对推广彩票的。"},"examples":[{"en":"Some antilottery groups argue that lotteries encourage gambling addiction.","zh":"一些反对彩票的团体认为彩票会助长赌博成瘾。"},{"en":"The senator took an antilottery stance during the campaign.","zh":"这位参议员在竞选期间采取了反对彩票的立场。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or group that opposes lotteries.","zh":"反对彩票的人；反彩票团体。"},"examples":[{"en":"The antilottery organized a petition to stop new lottery ads.","zh":"反彩票团体组织请愿，要求停止新的彩票广告。"},{"en":"Antilotteries often focus on consumer protection and public ethics.","zh":"反彩票人士常常关注消费者保护与公共伦理。"}]}],"synonyms":["anti-lottery","anti-gambling","anti-lottery campaigner"],"phonetic":"/ˌæntiˈlɑtəri/","extraExplanation":["“anti-”是常见前缀，表示“反对、抵制”。“antilottery”在实际写作中也常写作“anti-lottery”（加连字符），尤其在新闻或政策语境里。","在英语国家，反彩票讨论常围绕：对低收入人群的影响、成瘾风险、以及政府用彩票收入资助公共项目（教育等）是否合理。"]}
{"word":"antiluetic","summary":{"en":"Antiluetic means “antisyphilis”—used in medicine for things that treat or combat syphilis.","zh":"Antiluetic 指“抗梅毒的”，用于医学语境中描述治疗或对抗梅毒的药物或疗法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Used to prevent, treat, or counteract syphilis.","zh":"（医学）用于预防、治疗或对抗梅毒的；抗梅毒的。"},"examples":[{"en":"Before modern antibiotics, doctors used various antiluetic treatments for syphilis.","zh":"在现代抗生素出现之前，医生会使用各种抗梅毒疗法来治疗梅毒。"},{"en":"The chart notes an antiluetic drug regimen in the patient’s history.","zh":"病历中记录了患者曾接受抗梅毒药物方案。"}]}],"synonyms":["antisyphilitic","antisiphylitic"],"phonetic":"/ˌæn.ti.luˈi.tɪk/","extraExplanation":["“antiluetic”较为罕见，多见于较旧的医学文献或正式医学语境。词根来自拉丁语“lues”，意为“瘟疫/传染病”，在医学上常特指“梅毒”（syphilis），因此“antiluetic”就是“抗梅毒的”。现代更常用的说法通常是“antisyphilitic”。"]}
{"word":"antiluetin","summary":{"en":"“Antiluetin” is a rare technical term meaning “anti-lutein”: something (often an antibody) that targets or opposes lutein.","zh":"“Antiluetin”是少见的专业用语，大意为“抗叶黄素/针对叶黄素”，常指用于实验检测的抗体或相关试剂。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/technical) Relating to blocking, opposing, or reacting against lutein (a yellow pigment found in plants and in the human eye).","zh":"（少见/专业）与“阻断、对抗或针对叶黄素（存在于植物及人眼中的黄色色素）”有关的。"},"examples":[{"en":"Researchers tested an antilutein antibody to measure lutein levels in samples.","zh":"研究人员测试了一种抗叶黄素抗体，用来测量样本中的叶黄素含量。"},{"en":"The paper mentions antilutein activity in an experimental assay.","zh":"论文提到在实验测定中观察到了抗叶黄素活性。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare/technical) A substance—often an antibody—used to bind to or counteract lutein in laboratory research.","zh":"（少见/专业）一种用于在实验室研究中结合或对抗叶黄素的物质——常见为抗体。"},"examples":[{"en":"They added antilutein to the reaction to detect lutein more precisely.","zh":"他们在反应中加入抗叶黄素试剂，以更精确地检测叶黄素。"}]}],"synonyms":["anti-lutein","anti-lutein antibody","lutein antagonist"],"phonetic":"/ˌæntiˈluːtiɪn/","extraExplanation":["“antiluetin”不是日常英语词汇，也不常见于通用词典；更常见的写法可能是带连字符的“anti-lutein”。如果你是在论文、检测报告或产品说明里看到它，很可能是指“抗叶黄素（的）”，尤其出现在免疫学/生物化学检测（例如抗体用于识别或定量叶黄素）的语境。","如果你能提供原句或来源领域（营养补充剂？免疫检测？化学品目录？），我可以帮你确认它是否为拼写变体、商品名，或应改为更标准的术语。"]}
{"word":"antilynching","summary":{"en":"Anti-lynching means opposing lynching or relating to efforts and laws that aim to stop lynching and punish those responsible.","zh":"anti-lynching 指“反对私刑处死”，或与制止私刑处死、追究施暴者责任的运动与法律相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposing lynching (the illegal public killing of someone, especially by a mob).","zh":"反对私刑处死（由暴民非法公开杀人，尤指在历史上针对特定群体的暴力）。"},"examples":[{"en":"The newspaper published an anti-lynching editorial.","zh":"这家报纸发表了一篇反对私刑处死的社论。"},{"en":"She joined an anti-lynching campaign to demand justice and due process.","zh":"她参加了反对私刑处死的运动，要求司法公正与正当程序。"}]},{"partOfSpeech":"n.","definition":{"en":"A movement, law, or campaign aimed at stopping lynching and punishing those who commit it.","zh":"反私刑处死的运动／法律／行动（旨在制止私刑处死并惩罚施暴者）。"},"examples":[{"en":"The anti-lynching movement pushed for stronger federal protection of civil rights.","zh":"反私刑处死运动推动加强联邦层面的民权保护。"},{"en":"Activists fought for an anti-lynching law for decades.","zh":"活动人士为争取一部反私刑处死法案奋斗了几十年。"}]}],"synonyms":["against lynching","anti-mob violence","civil-rights (related)","anti-racist (related)"],"phonetic":"/ˌæn.ti ˈlɪn.tʃɪŋ/","extraExplanation":["“anti-lynching”常与美国历史中的种族暴力语境相关，尤其是19世纪末到20世纪中期针对非裔美国人的私刑处死。","在美国民权史上，艾达·B·威尔斯（Ida B. Wells）等人通过调查报道与公众倡议揭露私刑处死的真相，推动反私刑处死运动。","历史上多次推动联邦“反私刑法案”未能通过；直到近年，美国才通过以“反私刑”为核心的联邦立法（如2022年的 Emmett Till Antilynching Act），将私刑相关行为作为联邦仇恨犯罪处理。","书面语中常见拼写为“anti-lynching”，也可见连写“antilynching”。两者意思相同，但带连字符更常见、更规范。"]}
{"word":"antilysin","summary":{"en":"Antily sin is an antibody that neutralizes a lysin (often a hemolysin).","zh":"Antily sin 指能中和溶素（常为溶血素）的抗体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An antibody (or antiserum) that neutralizes a lysin—especially a toxin that breaks red blood cells (a hemolysin).","zh":"抗溶素；能中和“溶素”的抗体（或抗血清），尤其指能中和溶血素、阻止红细胞被破坏的抗体。"},"examples":[{"en":"The lab measured antilysin levels to see whether the serum could block the hemolysin.","zh":"实验室测量抗溶素水平，以判断血清是否能阻断溶血素。"},{"en":"After immunization, the animal produced antilysin that reduced red blood cell damage in the assay.","zh":"免疫后，动物产生了抗溶素，在实验测定中减少了红细胞损伤。"}]}],"synonyms":["antihemolysin","neutralizing antibody (to a lysin)"],"phonetic":"/ˌæn.tiˈlaɪ.sɪn/","extraExplanation":["“antily sin”属于免疫学/微生物学里的专业词：lysin（溶素）是一类可破坏细胞（常指红细胞）的物质；antily sin就是能“对抗/中和”这类物质的抗体。词形由 anti-（反、抗）+ lysin（溶素）构成，多见于较旧或较专业的文献。"]}
{"word":"antilysis","summary":{"en":"“Antilysis” is not standard; it is usually a misspelling of “analysis.”","zh":"“antilysis”不是标准用词，通常是把“analysis（分析）”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or incorrect spelling; most often a typo for “analysis.”","zh":"非标准或错误拼写；最常见是把“analysis（分析）”拼错成“antilysis”。"},"examples":[{"en":"“Antilysis” isn’t a standard English word—did you mean “analysis”?","zh":"“antilysis”不是标准英语单词——你是不是想写“analysis（分析）”？"},{"en":"Please check the spelling: write “analysis,” not “antilysis.”","zh":"请检查拼写：应写“analysis”，不是“antilysis”。"}]}],"synonyms":["analysis"],"phonetic":"/əˈnæləsɪs/","extraExplanation":["“analysis”常见拼写点：a-n-a-l-y-s-i-s；发音重音在第二音节（a-NAL-y-sis）。如果你能提供句子语境，我也可以帮你确认你真正想表达的是“analysis（分析）”、还是其他词（例如“antithesis 对立/对照”）。"]}
{"word":"antilyssic","summary":{"en":"Antilyssic means “anti‑rabies”—used to describe vaccines or treatments for preventing or treating rabies.","zh":"Antilyssic 意为“抗狂犬病的”，用于描述预防或治疗狂犬病的疫苗或相关治疗。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, medical) Preventing or treating rabies; anti‑rabies. Example: “The clinic stocked antilyssic vaccines to protect people after animal bites.”","zh":"（罕见，医学）用于预防或治疗狂犬病的；抗狂犬病的。例： “诊所备有抗狂犬病疫苗，用于动物咬伤后的保护。”"},"examples":[{"en":"After the dog bite, she received an antilyssic shot series.","zh":"被狗咬伤后，她接种了一系列抗狂犬病疫苗。"},{"en":"Older medical texts sometimes describe rabies serum as antilyssic.","zh":"较早的医学文献有时会把狂犬病血清称为“抗狂犬病的（antilyssic）”。"}]}],"synonyms":["anti-rabies","rabies-preventive","rabies prophylactic"],"phonetic":"/ˌæn.tiˈlɪs.ɪk/","extraExplanation":["“antilyssic”非常少见，更多现代英语会说“anti-rabies”或直接用“rabies vaccine / rabies immunoglobulin”。","词根来自希腊语“lyssa”（狂犬病、疯犬般的狂怒）。因此 antilyssic = anti-（反、抗）+ lyssic（与狂犬病相关）。","如果你是在科学/医学材料里看到它，通常指“狂犬病暴露后预防（PEP）”相关的疫苗或血清。"]}
{"word":"antilytic","summary":{"en":"Antilytic means preventing or reducing cell lysis, especially hemolysis (red blood cell rupture).","zh":"Antilytic 指“抗溶解的”，即防止或减少细胞溶解，尤指防止红细胞溶血。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"preventing or reducing lysis (the breaking down of cells), especially the rupture of red blood cells (hemolysis).","zh":"抗溶解的；防止或减少细胞溶解（细胞破裂/被破坏）的，尤指防止红细胞溶血。"},"examples":[{"en":"The lab used an antilytic agent to help protect red blood cells during the experiment.","zh":"实验室使用了抗溶解剂，以在实验过程中帮助保护红细胞。"},{"en":"Researchers looked for antilytic properties in the compound to reduce hemolysis.","zh":"研究人员考察该化合物是否具有抗溶解特性，以减少溶血。"}]}],"synonyms":["antihemolytic","protective","stabilizing"],"phonetic":"/ˌæn.tiˈlɪt.ɪk/","extraExplanation":["“antilytic”多见于医学或生物实验语境：lytic来自“lysis（溶解/裂解）”，表示细胞被破坏或破裂；anti-表示“反…/抗…”。因此它通常用来描述某种物质或作用能“抗溶血、抗细胞裂解”。","它在日常英语中非常少见；更常见的相关词包括“hemolysis（溶血）”“lysis（裂解/溶解）”“protective/stabilizing effect（保护/稳定作用）”。"]}

