{"word":"antiwar","summary":{"en":"Antiwar means opposing war (often a specific war) and favoring peace; it can also refer to people or movements that oppose war.","zh":"antiwar 指“反战的”，常指反对某一场战争、主张和平；也可指反战者或反战运动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to war or to a particular war; supporting peace and non-violence instead of military action.","zh":"反战的；反对战争或某一场战争的；主张和平与非暴力、反对军事行动的。"},"examples":[{"en":"She joined an antiwar protest after the invasion began.","zh":"入侵开始后，她参加了反战抗议活动。"},{"en":"The movie became famous for its antiwar message.","zh":"这部电影因其反战主题而闻名。"},{"en":"Many students held antiwar signs on campus.","zh":"许多学生在校园里举着反战标语牌。"}]},{"partOfSpeech":"n.","definition":{"en":"A person, group, or movement that opposes war or a particular war.","zh":"反战者；反战团体；反战运动（指反对战争或某一场战争的人/组织/运动）。"},"examples":[{"en":"Antiwar groups organized marches in several cities.","zh":"反战团体在多个城市组织了游行。"},{"en":"He was labeled an antiwar activist in the press.","zh":"媒体把他称为反战活动人士。"}]}],"synonyms":["against the war","peace-oriented","pacifist (related)","nonviolent (related)"],"phonetic":"/ˌæn.tiˈwɔɹ/","extraExplanation":["anti- 是常见前缀，意思是“反对/与……相对”（如: anti-smoking 反吸烟，anti-racist 反种族主义）。antiwar 常见于新闻和政治语境，可写作 anti-war 或 antiwar；不同媒体有不同拼写习惯。","在英语里，antiwar 不一定等于“反对所有战争”（这更接近 pacifist / pacifism），很多时候是“反对某一场战争或某种军事行动”。表达观点时可以更具体：antiwar protesters（反战抗议者）、antiwar sentiment（反战情绪）、antiwar movement（反战运动）。"]}
{"word":"antiwarlike","summary":{"en":"Antiwar-like means opposed to war or not militaristic in tone; today, “anti-war” is more common.","zh":"antiwarlike 指反战或语气不尚武；如今更常用的表达是 anti-war。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to war; expressing a desire to prevent war or avoid military conflict.","zh":"反战的；反对战争的；主张避免军事冲突的。"},"examples":[{"en":"The group released an antiwarlike statement calling for peace talks.","zh":"该团体发表了反战声明，呼吁开展和平谈判。"},{"en":"Her antiwarlike views shaped the way she voted in parliament.","zh":"她的反战立场影响了她在议会中的投票选择。"}]},{"partOfSpeech":"adj.","definition":{"en":"not warlike in style or tone; not aggressive or militaristic.","zh":"（语气、风格）不尚武的；不带侵略性或军国主义色彩的。"},"examples":[{"en":"The article took an antiwarlike tone, focusing on diplomacy instead of threats.","zh":"这篇文章语气不尚武，强调外交而非威胁。"}]}],"synonyms":["anti-war","pacifist","peace-minded","anti-militarist"],"phonetic":"/ˌæn.taɪˈwɔrˌlaɪk/","extraExplanation":["“antiwarlike”由前缀 anti-（反对）+ warlike（尚武的、好战的）构成，意思直观，但在现代英语中更常见的写法和用词是 anti-war（反战的）或 anti-militarist（反军国主义的）。在正式写作中，用 anti-war 往往更自然。"]}
{"word":"antiwaste","summary":{"en":"“Antiwaste” means preventing or reducing waste, or an effort that aims to stop waste.","zh":"“antiwaste”指“防止/减少浪费的”，也可指“反浪费的行动或运动”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to prevent waste or reduce the amount of waste (especially food, materials, or resources).","zh":"旨在防止浪费或减少浪费（尤指食物、材料或资源）的。"},"examples":[{"en":"The cafeteria started an antiwaste program to cut food leftovers.","zh":"食堂启动了一个反浪费项目，以减少剩饭剩菜。"},{"en":"Anti-waste packaging uses less plastic and is easier to recycle.","zh":"反浪费包装使用更少的塑料，也更容易回收。"}]},{"partOfSpeech":"n.","definition":{"en":"A policy, campaign, or movement that aims to stop waste.","zh":"反浪费政策、行动或运动。"},"examples":[{"en":"The city launched an antiwaste to reduce landfill trash.","zh":"这座城市发起了一项反浪费行动，以减少填埋垃圾。"}]}],"synonyms":["waste-reducing","waste-preventing","low-waste","zero-waste","resource-saving"],"phonetic":"/ˌæn.tiˈweɪst/","extraExplanation":["“anti-”是常见前缀，表示“反对、抵制”。“antiwaste”在环保与可持续发展语境中更常见；写作时也常见连字符形式“anti-waste”。"]}
{"word":"antiwear","summary":{"en":"“Antiwear” (often written “anti-wear”) means made to reduce or prevent wear from friction or repeated use.","zh":"“antiwear”（常写作“anti-wear”）指用于减少或防止因摩擦或反复使用造成的磨损。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"designed to reduce or resist wear (damage from friction, rubbing, or repeated use).","zh":"防磨损的；耐磨的（用于减少或抵抗因摩擦、反复使用造成的磨损）。"},"examples":[{"en":"These antiwear additives help protect the engine under high heat and pressure.","zh":"这些抗磨添加剂有助于在高温高压下保护发动机。"},{"en":"The company developed an antiwear coating for industrial tools.","zh":"这家公司为工业工具开发了一种耐磨涂层。"},{"en":"Use antiwear gear when you work with rough materials all day.","zh":"如果你整天处理粗糙材料，就要使用耐磨装备。"}]}],"synonyms":["wear-resistant","abrasion-resistant","durable","hard-wearing"],"phonetic":"/ˌæntiˈwɛr/","extraExplanation":["“antiwear”更常见的写法是“anti-wear”，多用于工程、机械与润滑领域（如anti-wear additives 抗磨添加剂；anti-wear coating 耐磨涂层）。日常英语里也常用“wear-resistant / abrasion-resistant（耐磨的）”来表达同类意思。"]}
{"word":"antiwedge","summary":{"en":"Anti(w)edge means “preventing wedging/jamming,” or a feature that stops parts from getting stuck.","zh":"antiwedge 指“防楔/防卡”的，或指防止零件被楔住、卡死的结构/装置。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"designed to prevent something from becoming wedged, jammed, or stuck (often used in engineering or design).","zh":"（常用于工程或设计）用于防止物体被楔住、卡住或夹死的；防楔的。"},"examples":[{"en":"The drawer runners have an antiwedge shape, so the drawer won’t jam when you pull it out.","zh":"这个抽屉滑轨做成防楔形状，所以拉出来时不会卡住。"},{"en":"We added an antiwedge feature to stop the panels from locking under pressure.","zh":"我们加了防楔结构，防止面板在受压时越压越紧而锁死。"}]},{"partOfSpeech":"n.","definition":{"en":"a part or feature that prevents wedging or jamming.","zh":"防楔装置；防卡结构（用于避免楔入或卡死的部件/设计）。"},"examples":[{"en":"Install the antiwedge near the hinge to reduce binding.","zh":"把防楔装置装在铰链附近，可以减少卡滞。"},{"en":"This clip acts as an antiwedge to keep the two pieces aligned.","zh":"这个夹子起到防楔作用，让两块零件保持对齐。"}]}],"synonyms":["anti-jam","jam-resistant","anti-binding","non-binding"],"phonetic":"/ˌæn.tiˈwɛdʒ/","extraExplanation":["“antiwedge”不是日常高频词，更常见写法是带连字符的“anti-wedge”。它多出现在机械结构、夹具、门窗五金、抽屉滑轨等语境里，意思是“避免越卡越紧”的几何形状或机构。"]}
{"word":"antiweed","summary":{"en":"“Antiweed” means anti-weed: intended to prevent/remove weeds, or a weed-killing product.","zh":"“antiweed”表示“防/除杂草的”，也可指“除草剂/除草产品”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to weeds or intended to prevent/remove weeds (often used for products, policies, or methods).","zh":"反杂草的；用于防止或清除杂草的（常用于产品、政策或方法）。"},"examples":[{"en":"They used an antiweed fabric under the gravel to stop weeds from growing.","zh":"他们在碎石下面铺了防杂草布，防止杂草生长。"},{"en":"The city adopted an antiweed plan for public parks.","zh":"市政府为公共公园制定了除杂草方案。"}]},{"partOfSpeech":"n.","definition":{"en":"A product or chemical used to kill or control weeds; a weed killer.","zh":"除草剂；用于杀灭或控制杂草的产品。"},"examples":[{"en":"Choose an antiweed that is safe for pets and children.","zh":"选择对宠物和儿童安全的除草剂。"},{"en":"Farmers often apply antiweed in early spring.","zh":"农民常在早春施用除草剂。"}]}],"synonyms":["herbicide","weed killer","anti-weed"],"phonetic":"/ˌæntiˈwid/","extraExplanation":["“anti-”是英语中很常见的前缀，表示“反对/对抗/防止”（如 antiwar 反战、antivirus 杀毒）。因此 antiweed 字面意思就是“对抗杂草”。","这个词在正式英语里不算最常见，更常见的说法是 herbicide（除草剂）或 weed killer（除草药/除草剂）。做定语时也常写成 anti-weed（带连字符），例如 anti-weed fabric（防草布）。"]}
{"word":"antiwhite","summary":{"en":"Antiwhite means biased or hostile toward white people.","zh":"antiwhite 指对（被视为）白人群体抱有偏见或敌意（“反白人”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Showing prejudice, hostility, or discrimination against white people.","zh":"对（被视为）白人群体抱有偏见、敌意或歧视的。"},"examples":[{"en":"He claimed the policy was antiwhite, but others argued it was meant to address unequal outcomes.","zh":"他声称这项政策是“反白人”的，但也有人认为它旨在改善不平等的结果。"},{"en":"Be careful with the word antiwhite—it often appears in heated political debates.","zh":"使用“antiwhite（反白人）”这个词要谨慎，它经常出现在激烈的政治争论中。"}]}],"synonyms":["biased against white people","anti-White (variant spelling)"],"phonetic":"/ˌæn.tiˈwaɪt/","extraExplanation":["“anti-”是英语中常见前缀，表示“反对/抵制/对立”。因此 antiwhite 的字面结构就是 “anti- + white（白人/白人的）”。","这个词在公共讨论中带有强烈立场色彩，常用于指控他人“对某群体不公平”。在写作或正式场合，若要更中性表达，可以根据语境改用 more neutral 的说法，例如：“biased against white people（对白人有偏见）”或“discriminatory toward white people（对白人有歧视）”。","与“种族议题”相关的词汇很容易引发误解。区分“个人偏见（prejudice）”“制度层面的歧视（discrimination）”以及“讨论不平等的政策（equity policies）”有助于更准确表达。"]}
{"word":"antiwhitism","summary":{"en":"Antiwhitism means prejudice or discrimination directed at white people.","zh":"antiwhitism 指针对白人群体的偏见或歧视。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Prejudice, hostility, or discrimination directed at white people (often discussed in social or political contexts).","zh":"针对白人群体的偏见、敌意或歧视（常出现在社会或政治讨论语境中）。"},"examples":[{"en":"Some people argue that certain comments show antiwhitism, while others see them as criticism of power structures rather than of individuals.","zh":"有些人认为某些言论体现了反白情绪/反白歧视，而另一些人则认为那是在批评权力结构而不是针对个体。"},{"en":"The speaker was accused of antiwhitism after making sweeping statements about white people.","zh":"这位演讲者因对所有白人一概而论而被指责存在反白情绪/反白歧视。"}]}],"synonyms":["anti-White bias","anti-white sentiment","anti-White racism"],"phonetic":"/ˌæn.tiˈwaɪ.tɪz.əm/","extraExplanation":["“antiwhitism”并不是特别常见或标准化的词，更多见于媒体与政治争论中；写作时也常写作“anti-White bias / anti-White racism / anti-white sentiment”。","该词在不同语境里含义可能被拉得很宽：有时指对“白人个体”的偏见或歧视；有时则被用来指对“白人作为主导群体/白人特权”的批评。为了避免误解，正式写作中建议说明你指的是哪一种。","涉及种族话题较敏感，讨论时尽量用具体、可核实的例子（某项政策、某句言论、某次待遇差异），避免对任何群体做笼统概括。"]}
{"word":"antiwiretapping","summary":{"en":"“Antiwiretapping” means intended to prevent secret listening/recording of communications.","zh":"antiwiretapping 指“用于防止通信被秘密窃听/监听的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to prevent or reduce secret listening/recording of communications (wiretapping), especially phone calls or electronic data.","zh":"用于防止或降低他人秘密监听/录音通信（窃听）的；尤指电话或电子通讯。"},"examples":[{"en":"The company upgraded its antiwiretapping systems after the data leak.","zh":"数据泄露后，公司升级了反窃听系统。"},{"en":"They held meetings in an antiwiretapping room with encrypted phones.","zh":"他们在一个防窃听的房间里用加密电话开会。"},{"en":"New antiwiretapping measures were added to protect customer calls.","zh":"新增了反窃听措施来保护客户通话。"}]}],"synonyms":["anti-eavesdropping","anti-surveillance","secure (communications)"],"phonetic":"/ˌæntiˈwaɪərˌtæpɪŋ/","extraExplanation":["“anti-”表示“反对/防止”；“wiretapping”指对电话线或通信进行秘密监听（也可泛指对电子通信的窃听）。因此 antiwiretapping 常用于“技术/设备/措施/法规”语境，如 antiwiretapping device（防窃听设备）、antiwiretapping measures（反窃听措施）。","在美国语境里，wiretapping 涉及隐私与执法边界，常与“需要法院授权的监听令（warrant）”等法律概念一起出现。日常写作中也常用更常见的表达：anti-eavesdropping（防窃听）、anti-surveillance（反监控）。"]}
{"word":"antiwit","summary":{"en":"“Antiwit” is a rare noun meaning a person lacking wit or intelligence, often used humorously or as an insult.","zh":"“antiwit”是个较少见的名词，指缺乏机智或智慧的人，常用于幽默或带侮辱的说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who seems to have no wit or intelligence; someone who is notably stupid (often used humorously or insultingly).","zh":"反机智的人；显得毫无机智或智慧的人；很蠢的人（常带幽默或侮辱意味）。"},"examples":[{"en":"Stop acting like an antiwit and read the instructions first.","zh":"别像个反机智的人一样，先把说明书读一遍。"},{"en":"The novel’s narrator calls himself an antiwit to emphasize how clueless he feels.","zh":"小说里的叙述者称自己为“反机智的人”，用来强调他有多么茫然无措。"}]}],"synonyms":["dimwit","fool","idiot","dunce","blockhead"],"phonetic":"/ˌæn.tiˈwɪt/","extraExplanation":["“anti-”表示“反、对立”，加上“wit（机智）”，字面意思就是“反机智”。这个词非常少见，更多时候人们会用更常见的词来表达，如“idiot / fool / dimwit”。","语气上通常偏贬义，或带一点夸张的自嘲/讽刺效果；不适合正式写作或礼貌场合。"]}
{"word":"antiwoman","summary":{"en":"“antiwoman” means anti-woman: opposed to women or women’s rights, or someone/something that holds such views.","zh":"“antiwoman”意为“反女性的/反对女性权利的”，也可指持这种观点的人或论调。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to women or to women’s rights; showing prejudice against women (often written as anti-woman).","zh":"反女性的；反对女性或女性权利的；带有厌女/歧视女性倾向的（常写作 anti-woman）。"},"examples":[{"en":"Some critics called the ad anti-woman because it portrayed women as incompetent.","zh":"一些评论者说这则广告反女性，因为它把女性描绘得很无能。"},{"en":"She spoke out against anti-woman attitudes at work.","zh":"她发声反对职场中的反女性态度。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or idea that is strongly opposed to women or to women’s rights.","zh":"反对女性或女性权利的人（或观点）。"},"examples":[{"en":"He was labeled an antiwoman after he argued that women should not vote.","zh":"他主张女性不应投票，因此被贴上“反女性者”的标签。"},{"en":"The article analyzes antiwoman arguments in politics.","zh":"这篇文章分析了政治中的反女性论点。"}]}],"synonyms":["anti-woman","misogynistic","sexist (toward women)","anti-feminist"],"phonetic":"/ˌæntiˈwʊmən/","extraExplanation":["“antiwoman”不是非常常见的单词形式，更常见的写法是加连字符的“anti-woman”，或用更明确的词如“misogynistic（厌女的）”“anti-feminist（反女权的）”。在使用时要注意语境：有时是描述对女性群体的偏见，有时是反对某项女性权益政策。由于带有强烈负面评价，适合用于批评性分析或引用他人观点时保持谨慎与准确。"]}
{"word":"antiworld","summary":{"en":"Antiword means a hypothetical antimatter world, or more broadly an imagined opposite world with reversed rules and values.","zh":"antiworld 指假想的“反物质世界”，也可泛指规则与价值观颠倒的“对立世界/反世界”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Science, sci‑fi) A hypothetical world or region made of antimatter, imagined as the opposite of our matter-based world.","zh":"（科学/科幻）假想中的“反物质世界”；被想象为与我们由普通物质构成的世界相对立的世界或区域。"},"examples":[{"en":"In the novel, the spaceship accidentally enters an antiworld where even a small collision could be deadly.","zh":"在小说里，宇宙飞船意外进入了一个反物质世界，哪怕很小的碰撞都可能致命。"},{"en":"Scientists sometimes use “antiworld” informally to talk about the idea of large regions of antimatter in the universe.","zh":"科学家有时会非正式地用“antiworld”来讨论宇宙中存在巨大反物质区域的设想。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, literary) An imagined “opposite world” that reflects or reverses the rules, values, or everyday logic of normal life.","zh":"（比喻/文学）“反世界/对立世界”；指一个在规则、价值观或日常逻辑上与现实相反的想象世界。"},"examples":[{"en":"Online anonymity can feel like an antiworld where people say things they would never say face to face.","zh":"网络匿名性有时像一个反世界，人们会说出当面绝不会说的话。"},{"en":"The story builds an antiworld to question what we call ‘normal.’","zh":"这个故事构建了一个反世界，用来质疑我们所谓的“正常”。"}]}],"synonyms":["antimatter world","mirror world","opposite world"],"phonetic":"/ˈæntiˌwɝːld/","extraExplanation":["“antiworld”不是非常常见的标准词，更常见的表达是“antimatter world（反物质世界）”“mirror world（镜像世界）”。在科幻语境中，它常用来营造“规则相反/一切颠倒”的世界观。","从科学角度：反物质与普通物质相遇会发生“湮灭（annihilation）”，释放大量能量，所以科幻作品里常把“antiworld”写成极其危险或需要特殊屏障的区域。"]}

