{"word":"Antin","summary":{"en":"“Antin” is mainly used as a surname (proper noun) rather than a common English word.","zh":"“Antin”主要作为姓氏（专有名词）使用，而不是常见英语词汇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname). It is not a common English vocabulary word by itself and is mainly seen as a person’s last name.","zh":"一个姓氏（英文里并不是常见的普通词汇，更多作为人名/姓氏出现）。"},"examples":[{"en":"Mary Antin was an immigrant writer in the early 1900s.","zh":"玛丽·安廷（Mary Antin）是20世纪初的一位移民作家。"},{"en":"I met Dr. Antin at the conference.","zh":"我在会议上见到了安廷博士。"}]}],"phonetic":"/ˈæntɪn/","extraExplanation":["“Antin”在英语里通常是专有名词（人名/姓氏），不像常见单词那样有固定词义。若你其实想查的是前缀“anti-”（表示“反对/抗/防”），或某个更长的词（如 antineutrino, antinuclear 等），把完整拼写发我，我可以按词汇义详细解释。"]}
{"word":"antinarcotic","summary":{"en":"Antinarcotic describes efforts opposing narcotics, or refers to people/agencies fighting drug trafficking.","zh":"antinarcotic 指“反毒/禁毒的”，也可指“缉毒人员或机构”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to the use, sale, or effects of narcotics (illegal drugs or strong painkillers), especially in policy or law enforcement.","zh":"反对使用、贩卖或其影响的（关于麻醉品/毒品的），常用于政策或执法语境。"},"examples":[{"en":"The city announced a new antinarcotic campaign to reduce drug trafficking.","zh":"该市宣布了一项新的反毒运动，以减少毒品贩运。"},{"en":"Antinarcotic officers worked with local communities to prevent youth drug use.","zh":"缉毒人员与当地社区合作，预防青少年吸毒。"}]},{"partOfSpeech":"n.","definition":{"en":"A person, group, or agency that fights against narcotics, especially drug trafficking.","zh":"反毒者；缉毒机构/团体（尤指打击毒品贩运者或单位）。"},"examples":[{"en":"International antinarcotics shared intelligence across borders.","zh":"国际缉毒机构在跨境范围内共享情报。"}]}],"synonyms":["anti-drug","drug enforcement","counter-narcotics","antidrug"],"phonetic":"/ˌæn.ti.nɑrˈkɑtɪk/","extraExplanation":["“antinarcotic”常见于新闻、政府报告和执法语境（如 antinarcotic unit/operations）。日常英语里更常说“anti-drug”或“drug enforcement”。","词形结构：anti-（反对）+ narcotic（麻醉品/毒品）。在医学语境中，narcotic 有时指强效止痛药（如阿片类），在执法语境中更多指非法毒品。"]}
{"word":"antinarcotics","summary":{"en":"Antinarcotics means related to opposing illegal drugs or drug trafficking, especially in law enforcement and government contexts.","zh":"Antinarcotics 指“禁毒/反毒的”，多用于执法与政府语境，表示打击非法毒品或贩毒的行动与政策。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposing illegal drugs or drug trafficking; relating to efforts, laws, or agencies that fight narcotics.","zh":"反毒的；反对非法毒品或贩毒的；与禁毒行动、法律或机构有关的。"},"examples":[{"en":"The police launched an antinarcotics operation at the port.","zh":"警方在港口展开了一次禁毒行动。"},{"en":"She works for an antinarcotics unit in the federal government.","zh":"她在联邦政府的禁毒部门工作。"}]},{"partOfSpeech":"n.","definition":{"en":"Work, policies, or enforcement activities aimed at stopping illegal drugs (often used as a noun in context, especially in government or media).","zh":"禁毒工作；禁毒政策或执法行动（在政府或媒体语境中常作名词用）。"},"examples":[{"en":"Funding for antinarcotics increased this year.","zh":"今年对禁毒工作的经费增加了。"},{"en":"The report focuses on antinarcotics and border security.","zh":"该报告重点讨论禁毒与边境安全。"}]}],"synonyms":["drug enforcement","counterdrug","anti-drug","drug-control"],"phonetic":"/ˌæntiˌnɑrˈkɑtɪks/","extraExplanation":["“antinarcotics”常见于新闻、政府文件与执法语境，也常写作“anti-narcotics”（带连字符）或“anti-narcotic”。在现代英语中，不带连字符的写法也越来越常见。","“narcotics”在法律与执法语境里常泛指非法毒品（不一定只指麻醉性药物）。因此“antinarcotics”通常可理解为“禁毒/反毒”。"]}
{"word":"antinarrative","summary":{"en":"Antinarrative describes a style or work that resists traditional, plot-driven storytelling.","zh":"Antinarrative 指一种抵制传统“情节推进式”讲故事的风格或作品。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposing or rejecting a traditional story structure (with a clear plot, cause-and-effect, climax, and resolution), often focusing instead on fragments, mood, ideas, or disruption.","zh":"反叙事的；反对或拒绝传统故事结构（清晰情节、因果推进、高潮与结局），常转而强调碎片、氛围、观念或对叙事的打断。"},"examples":[{"en":"The film is deliberately antinarrative, moving through images and sounds instead of a clear plot.","zh":"这部电影刻意采取反叙事方式，用影像与声音推进，而不是清晰的情节。"},{"en":"Her antinarrative style makes readers work harder to connect the scenes.","zh":"她的反叙事风格让读者需要更费力地把各个场景串联起来。"}]},{"partOfSpeech":"n.","definition":{"en":"A work, approach, or technique that rejects conventional storytelling; an anti-plot form.","zh":"反叙事作品／手法；拒绝常规讲故事方式的创作方法（反情节）。"},"examples":[{"en":"Some critics call the novel an antinarrative rather than a traditional story.","zh":"一些评论家认为这部小说与其说是传统故事，不如说是反叙事。"},{"en":"The performance used antinarrative to question what counts as a ‘story.’","zh":"这场表演用反叙事来追问什么才算“故事”。"}]}],"synonyms":["nonlinear","fragmentary","anti-plot","experimental","plotless"],"phonetic":"/ˌæn.tiˈnær.ə.tɪv/","extraExplanation":["“anti-”表示“反对/逆向”，“narrative”是“叙事/故事”。“antinarrative”常用于文学、电影、当代艺术评论，尤其与现代主义/后现代主义语境相关。","反叙事并不等于“没有故事”，而是常见于：打散时间顺序、弱化因果、刻意留白、用片段与重复制造体验感，让观众/读者主动建构意义。"]}
{"word":"antinatalist","summary":{"en":"Antinatalist means a person or viewpoint that holds having children is morally wrong or undesirable.","zh":"Antinatalist 指反生育主义者或反生育主义的观点，认为生育在道德上不应当或不理想。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who believes it is morally wrong or undesirable to have children (to create new human life)","zh":"反生育主义者；主张生育在道德上是错误或不应当的人"},"examples":[{"en":"As an antinatalist, he believes bringing a child into a world full of suffering is unethical.","zh":"作为一名反生育主义者，他认为把孩子带到充满痛苦的世界是不道德的。"},{"en":"Some antinatalists choose not to have children for ethical reasons rather than financial ones.","zh":"一些反生育主义者选择不生孩子是出于伦理原因，而不是经济原因。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the belief that having children is morally wrong or undesirable","zh":"（观点/立场）反生育主义的；认为生育在道德上不应当或不理想的"},"examples":[{"en":"She wrote an antinatalist essay arguing for fewer births to reduce suffering.","zh":"她写了一篇反生育主义的文章，主张减少出生以降低痛苦。"},{"en":"The film presents an antinatalist theme, questioning whether life should be created at all.","zh":"这部电影呈现了反生育主义主题，质疑生命是否应当被创造出来。"}]}],"synonyms":["anti-natalist","antinatalism (related noun)","anti-birth (informal)"],"phonetic":"/ˌæn.tiˈneɪ.t̬əl.ɪst/","extraExplanation":["“antinatalist”来自“anti-（反对）+ natal（出生的/生育的）+ -ist（……主义者/……者）”。“natal”常见于正式词汇，如“prenatal（产前的）”“postnatal（产后的）”。","反生育主义（antinatalism）是一种伦理/哲学立场，常讨论“生育是否会不可避免地带来痛苦”“是否有权让他人进入世界”等问题。讨论时容易涉及宗教、家庭与个人选择，现实交流中建议用中性、尊重的措辞。","相关表达：“be childfree（选择不生育）”强调生活方式选择，不一定带有道德判断；而“antinatalist”通常包含明确的伦理立场。"]}
{"word":"antinational","summary":{"en":"“Antinational” means opposed to a nation or seen as against national interests, often used as a political label.","zh":"“Antinational”指反对国家或被认为损害国家利益的，常带政治指责色彩。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to a nation, its government, or its interests; considered not supportive of national unity or patriotism.","zh":"反国家的；反民族（主义）的；被认为不支持国家利益或国家团结的。"},"examples":[{"en":"Some politicians labeled the protesters as antinational.","zh":"一些政客把抗议者称为“反国家的”。"},{"en":"The journalist denied writing anything antinational and argued it was fair criticism.","zh":"这位记者否认自己写了任何反国家的内容，并表示那只是合理批评。"}]}],"synonyms":["anti-national","unpatriotic","anti-state","anti-government"],"phonetic":"/ˌæn.tiˈnæʃ(ə)nəl/","extraExplanation":["“antinational”常写作“anti-national”（带连字符），尤其在政治或新闻语境中更常见。","在某些国家的公共话语里，“anti-national”可能被用作指责或贴标签的词，含强烈情绪色彩；在学术语境中则更中性，可能仅表示“反对民族主义/国家主义（nationalism）”。","构词：anti-（反对）+ national（国家的/民族的）。相关词：anti-nationalist（反民族主义者/反国家主义者）、antinationalism（反民族主义/反国家主义）。"]}
{"word":"antinationalism","summary":{"en":"Antinationalism is opposition to nationalism, often emphasizing international or cosmopolitan values over national loyalty.","zh":"Antinationalism 指反民族主义：反对把国家认同与利益置于一切之上的民族主义，常强调国际主义或世界主义价值。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to strong nationalism, especially the idea that a nation’s interests or identity should come before others.","zh":"反民族主义；反对强烈民族主义，尤其是认为国家利益或国家认同应高于其他一切的观念。"},"examples":[{"en":"Her antinationalism came from seeing how extreme nationalism can lead to discrimination.","zh":"她的反民族主义源于看到极端民族主义如何导致歧视。"},{"en":"The essay argues for cooperation across borders and criticizes nationalism from an antinationalist perspective.","zh":"这篇文章主张跨国合作，并从反民族主义立场批评民族主义。"}]},{"partOfSpeech":"n.","definition":{"en":"A political or cultural stance that favors internationalism, cosmopolitan values, or shared human identity over national loyalty.","zh":"一种政治或文化立场：更强调国际主义/世界主义价值或共同的人类身份，而非对单一国家的忠诚。"},"examples":[{"en":"In the novel, the protagonist’s antinationalism makes him feel like an outsider during wartime.","zh":"在这部小说中，主人公的反民族主义让他在战时感到格格不入。"},{"en":"Some activists link antinationalism with global justice movements.","zh":"一些活动人士将反民族主义与全球正义运动联系起来。"}]}],"synonyms":["anti-nationalism","opposition to nationalism","internationalism","cosmopolitanism"],"phonetic":"/ˌæn.tiˈnæʃ.ə.nəˌlɪz.əm/","extraExplanation":["词形结构：anti-（反对）+ nationalism（民族主义）。通常用于政治思想讨论。","语气与使用：antinationalism 多用于学术、新闻或评论写作；日常口语中更常说 “opposition to nationalism（反对民族主义）”。","注意区分：antinationalism 并不一定等于反爱国（anti-patriotism）；很多人是反对“排外、扩张、至上”的民族主义，而不否定对自己国家的合理关心。"]}
{"word":"antinationalist","summary":{"en":"Antinationalist means opposed to nationalism; it can also refer to a person who holds that view.","zh":"antinationalist 指“反民族主义的”，也可指“反民族主义者”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to nationalism, especially the belief that one nation’s interests are more important than others’ or that the nation should be culturally/politically “pure.”","zh":"反民族主义的；反对民族主义（尤其反对把本国利益凌驾于他国之上，或主张文化/政治“纯粹化”的思想）。"},"examples":[{"en":"She wrote an antinationalist essay arguing that cooperation across borders matters more than slogans.","zh":"她写了一篇反民族主义的文章，主张跨国合作比口号更重要。"},{"en":"The group has an antinationalist stance and supports international student exchanges.","zh":"该团体立场反民族主义，支持国际学生交流。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who is opposed to nationalism.","zh":"反民族主义者；反对民族主义的人。"},"examples":[{"en":"As an antinationalist, he criticized politicians who blamed immigrants for economic problems.","zh":"作为反民族主义者，他批评那些把经济问题归咎于移民的政客。"}]}],"synonyms":["anti-nationalist","internationalist","cosmopolitan","anti-chauvinist"],"phonetic":"/ˌæn.tiˈnæʃ.ə.nə.lɪst/","extraExplanation":["“anti-”表示“反对”，加在“nationalist（民族主义者/民族主义的）”前构成“antinationalist”。在新闻与学术语境中，这个词常用于讨论政治意识形态、国际主义（internationalism）、世界主义（cosmopolitanism）与排外主义（xenophobia）之间的张力。","注意区分：antinationalist（反民族主义）不一定等于 unpatriotic（不爱国）。很多人反对民族主义的排他性，但仍可能关心本国公共利益与社会福祉。"]}
{"word":"antinationalistic","summary":{"en":"‘Antinationalistic’ means opposing or criticizing nationalism.","zh":"“antinationalistic”意为反对或批判民族主义的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to nationalism, or critical of the belief that a nation’s interests and identity should come first.","zh":"反对民族主义的；批判“国家利益与民族身份应优先”的观念的。"},"examples":[{"en":"Her essay takes an antinationalistic view of the war and questions patriotic slogans.","zh":"她的文章以反民族主义的角度看待这场战争，并质疑爱国口号。"},{"en":"Some artists use antinationalistic themes to warn against prejudice and exclusion.","zh":"一些艺术家用反民族主义主题来警惕偏见与排他。"}]}],"synonyms":["anti-nationalist","anti-nationalistic","anti-nationalism","cosmopolitan (in some contexts)","internationalist (often related)"],"phonetic":"/ˌæntiˌnæʃənəˈlɪstɪk/","extraExplanation":["“antinationalistic”常见于较正式或学术语境；日常表达里更常说“anti-nationalist / anti-nationalism”。","注意它并不一定等于“反爱国”：它主要针对极端或排他的民族主义（例如把外来者视为威胁、否认多元），而不是反对对国家的健康认同。","拼写上可见连字符形式“anti-nationalistic”，尤其在出版物中更常见。"]}
{"word":"antinationalistically","summary":{"en":"“Antinationalistically” means “in an anti-nationalist way,” opposing nationalism or putting national pride above everything.","zh":"“antinationalistically”表示“以反民族主义的方式”，指反对民族主义或反对把民族/国家自豪感置于一切之上。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that opposes nationalism (the idea that one nation’s interests and identity should come first).","zh":"以反民族主义的方式；以反对民族主义（强调本国利益与身份至上）的态度。"},"examples":[{"en":"The group argued antinationalistically, warning that extreme patriotism can harm democracy.","zh":"该团体以反民族主义的立场辩论，警告极端爱国情绪可能伤害民主。"},{"en":"Some writers speak antinationalistically when they emphasize shared human rights over national pride.","zh":"一些作家在强调共同人权高于民族自豪感时，会以反民族主义的方式表达。"}]}],"synonyms":["anti-nationalistically","in an anti-nationalist way","from an anti-nationalist perspective"],"phonetic":"/ˌæntiˌnæʃənəˈlɪstɪkli/","extraExplanation":["这个词比较少见，通常出现在学术写作或政治评论中。","构词上可拆为 anti-（反对）+ national（国家/民族的）+ -istic（……主义/倾向的）+ -ally（副词形式）。","在实际表达中，人们更常用：in an anti-nationalist way / from an anti-nationalist perspective（以反民族主义的方式/视角）。"]}
{"word":"antinationalists","summary":{"en":"“Antinationalists” are people who oppose nationalism and often support more internationalist or inclusive politics.","zh":"“Antinationalists”指反对民族主义的人，常倾向支持更国际化或更包容的政治立场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who oppose nationalism (the belief that a nation’s interests and identity should come first), often criticizing strong patriotic or nationalist politics","zh":"反民族主义者：反对民族主义（认为国家利益与身份应置于首位的观念）的人，常批评强烈的爱国或民族主义政治"},"examples":[{"en":"The antinationalists argued that the new policy would increase hostility toward immigrants.","zh":"反民族主义者认为这项新政策会加剧对移民的敌意。"},{"en":"In the debate, antinationalists emphasized international cooperation over national pride.","zh":"在辩论中，反民族主义者强调国际合作胜过民族自豪感。"},{"en":"Some antinationalists joined the march to protest extremist slogans.","zh":"一些反民族主义者参加游行，抗议极端口号。"}]}],"synonyms":["anti-nationalists","internationalists (sometimes)","anti-chauvinists (sometimes)"],"phonetic":"/ˌæntiˈnæʃənəlɪsts/","extraExplanation":["“antinationalists”是复数形式；单数是“antinationalist”。在新闻与政治语境中，这个词常用于描述反对“把国家利益绝对化、排外或极端民族情绪”的人或团体，但不一定意味着反对“爱国”本身。","前缀“anti-”表示“反对”，与“nationalist（民族主义者）”组合而成。写作时也可见连字符形式“anti-nationalists”。"]}
{"word":"antinationalization","summary":{"en":"Antinationalization means opposition to nationalization—government takeover/ownership of private industries or assets.","zh":"Antinationalization 指反对国有化（政府接管或拥有私营产业/资产）的立场或行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to the act or policy of nationalization (making private property or industry owned/controlled by the government).","zh":"反对“国有化/收归国有”的行为或政策。"},"examples":[{"en":"The business community organized a campaign of antinationalization after the government announced plans to take over the mines.","zh":"政府宣布接管矿山后，商界组织了反国有化运动。"},{"en":"His antinationalization stance appealed to voters who favored free markets.","zh":"他反国有化的立场吸引了支持自由市场的选民。"}]}],"synonyms":["opposition to nationalization","anti-nationalization","pro-privatization"],"phonetic":"/ˌæn.tiˌnæʃ.ə.nəl.aɪˈzeɪ.ʃən/","extraExplanation":["这个词在新闻与政治经济讨论中更常见，尤其与“privatization（私有化）/ nationalization（国有化）”成对出现。它通常指一种立场（反对国有化），而不一定指某个具体组织。","构词法：anti-（反对）+ nationalization（国有化）。在实际写作中，更常见的表达是“opposition to nationalization”或“anti-nationalization”（带连字符的形容词用法）。"]}
{"word":"antinationally","summary":{"en":"“Antinationally” means “in an anti-nationalist or anti-national way,” mainly in political contexts.","zh":"“antinationally”意为“以反民族主义/反国家的方式”，主要用于政治语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is opposed to nationalism or to the interests, identity, or policies of a nation (often used in political or historical discussion).","zh":"以反民族主义的方式；以反国家利益、国家认同或国家政策的方式（常用于政治或历史语境）。"},"examples":[{"en":"The pamphlet was criticized for speaking antinationally during wartime.","zh":"这本小册子因在战时发表“反国家立场”的言论而受到批评。"},{"en":"Some activists argued that the law punished people for thinking antinationally.","zh":"一些活动人士认为这项法律是在惩罚持“反民族主义”观点的人。"},{"en":"He wrote antinationally about empire and called for local self-rule.","zh":"他以反民族主义的立场批判帝国，并呼吁地方自治。"}]}],"synonyms":["anti-nationally","against nationalism","unpatriotically (often stronger/biased)"],"phonetic":"/ˌæn.tiˈnæʃ.ə.nə.li/","extraExplanation":["“antinationally”由 anti-（反对）+ national（国家的/民族的）+ -ly（副词后缀）构成，语气通常较强，常见于政治争论、战时宣传、民族主义相关批评中。","它往往带有评价色彩：说某人/某言论“antinationally”可能是在指责其“不爱国”或“反国家”，因此在正式写作中要注意语境与立场。"]}
{"word":"antinatural","summary":{"en":"Antinatural means “not natural” or “against nature,” and it can also mean opposing the idea that nature is the standard for what is right or good.","zh":"Antinatural 指“不自然的/反自然的”，也可指“反对以自然作为对错或善恶标准”的立场。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not natural; contrary to what is normal in nature or in typical human behavior.","zh":"不自然的；反自然的；违背自然常态（或常见人类行为）的。"},"examples":[{"en":"The bright green dye gave the food an antinatural color.","zh":"亮绿色的染料让食物呈现出不自然的颜色。"},{"en":"Some critics said the acting felt antinatural and forced.","zh":"一些评论家说表演显得不自然、很生硬。"}]},{"partOfSpeech":"adj.","definition":{"en":"Against the idea that nature is the standard for what is right or good; opposing “natural” explanations or values.","zh":"反对以“自然”为标准的（道德/价值）观；反对“自然解释”的。"},"examples":[{"en":"He argued that the rule was antinatural because it treated nature as the only guide to morality.","zh":"他认为这条规则是反自然的，因为它把自然当作道德的唯一指南。"},{"en":"In the essay, the author takes an antinatural stance toward “natural law.”","zh":"在这篇文章里，作者对“自然法”采取了反自然的立场。"}]}],"synonyms":["unnatural","against nature","artificial","contrary to nature","abnormal"],"phonetic":"/ˌæntiˈnætʃɚəl/","extraExplanation":["“antinatural”相对少见，更常见的表达是“unnatural”或“against nature”。在正式写作（哲学、神学、伦理学）中，它有时用来讨论“自然法（natural law）”“自然秩序”等概念，语气可能更强、更带立场。","词形上是 anti-（反对）+ natural（自然的）。在谈论人群或身份时要谨慎使用，因为“unnatural/antinatural”在某些语境中可能带有贬义或价值评判。"]}
{"word":"antinaturalism","summary":{"en":"Antinaturalism is opposition to naturalism, often meaning a rejection of purely natural/scientific explanations or a rejection of strict realism in art and literature.","zh":"反自然主义：反对自然主义，常指拒绝“纯自然/纯科学”的解释，或在艺术文学中拒绝严格写实。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to naturalism (the idea that nature and physical causes explain everything), especially in philosophy, art, or literature.","zh":"反自然主义（反对“自然主义”——认为自然与物理原因足以解释一切的观点），常见于哲学、艺术或文学讨论中。"},"examples":[{"en":"In philosophy of mind, antinaturalism argues that consciousness cannot be fully explained by physical science alone.","zh":"在心灵哲学中，反自然主义认为意识无法只靠自然科学（物理主义解释）来完全说明。"},{"en":"Some critics describe the novel’s symbolism as a form of antinaturalism because it rejects strict realistic description.","zh":"有些评论家把这部小说的象征主义视为一种反自然主义，因为它拒绝严格的写实描写。"}]},{"partOfSpeech":"n.","definition":{"en":"(In art and literature) A tendency or movement that rejects strictly realistic, “life-as-it-is” representation and favors stylization, symbolism, or spiritual/ideal themes.","zh":"（艺术与文学）一种倾向或流派：拒绝严格的写实与“如实再现生活”，而偏好风格化、象征手法或精神/理念主题。"},"examples":[{"en":"The painter’s antinaturalism is visible in the unreal colors and exaggerated proportions.","zh":"这位画家的反自然主义体现在不真实的色彩和夸张的比例上。"},{"en":"Modernist theater often shows antinaturalism through fragmented dialogue and non-realistic staging.","zh":"现代主义戏剧常通过碎片化对白与非写实舞台呈现反自然主义。"}]}],"synonyms":["anti-naturalism","non-naturalism","supernaturalism (in some contexts)","anti-realism (related, not identical)"],"phonetic":"/ˌæntiˈnætʃ(ə)rəlˌɪzəm/","extraExplanation":["“antinaturalism”通常出现在学术语境里：哲学中多与“naturalism（自然主义）”对立，讨论心灵、价值、意义、宗教或规范性是否能被纯科学方法还原；艺术/文学中则常与“naturalism（自然主义写实/自然派）”相对，强调不按现实原样复制，而用象征、夸张、抽象等方式表达观念或情感。","词形结构：anti-（反对）+ naturalism（自然主义）。有时也写作“anti-naturalism”（带连字符），含义基本一致。"]}
{"word":"antinaturalist","summary":{"en":"Antinaturalist means opposing naturalism, or a person who rejects naturalism in philosophy or art.","zh":"Antinaturalist 指“反自然主义的”，也可指“反自然主义者”（在哲学或艺术中反对自然主义的人）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to naturalism (the idea or style that explains or represents things as purely natural, realistic, or based on nature).","zh":"反自然主义的；反对自然主义（把事物解释或呈现为纯粹自然/写实/基于自然的一种观点或风格）。"},"examples":[{"en":"Some modern painters were openly antinaturalist and preferred distortion over realistic detail.","zh":"一些现代画家公开反自然主义，更喜欢变形而不是写实细节。"},{"en":"His essay takes an antinaturalist position, arguing that moral values cannot be reduced to biology.","zh":"他的文章采取反自然主义立场，认为道德价值不能被简化为生物学。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who rejects naturalism in philosophy, art, or criticism.","zh":"反自然主义者（在哲学、艺术或批评中拒绝自然主义的人）。"},"examples":[{"en":"As an antinaturalist, she challenged the idea that science alone can answer every question.","zh":"作为一名反自然主义者，她质疑“仅靠科学就能回答所有问题”的想法。"}]}],"synonyms":["anti-naturalistic","anti-realist","nonrealist","symbolist (in some art contexts)"],"phonetic":"/ˌæn.tiˈnætʃ.ə.rə.lɪst/","extraExplanation":["“antinaturalist”常见于学术语境，尤其是哲学与艺术史：在哲学里多指反对“自然主义”那种把心灵、意义、道德等都还原为自然科学解释的立场；在艺术里则常指反对写实/仿自然的表现方式，强调夸张、象征、抽象等手法。"]}
{"word":"antinaturalistic","summary":{"en":"“Antinaturalistic” describes something (especially art or storytelling) that rejects realistic, life-like representation.","zh":"“Antinaturalistic”指（尤在艺术叙事中）拒绝写实、逼真再现的风格或手法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to naturalism; not aiming to copy real life exactly, especially in art, literature, film, or theater.","zh":"反自然主义的；（尤指艺术、文学、电影或戏剧中）不追求对现实生活的逼真再现的。"},"examples":[{"en":"The director chose an antinaturalistic style, using bright colors and exaggerated gestures.","zh":"导演选择了反自然主义的风格，使用鲜艳的色彩和夸张的动作。"},{"en":"In antinaturalistic fiction, characters may speak in poetic or unrealistic ways.","zh":"在反自然主义小说中，人物可能用诗意或不真实的方式说话。"}]},{"partOfSpeech":"adj.","definition":{"en":"Contrary to what is considered “natural,” normal, or in accordance with nature (less common).","zh":"违背所谓“自然”的；不合常态或不符合自然规律的（较少用）。"},"examples":[{"en":"Some critics called the experiment antinaturalistic, though others saw it as innovative.","zh":"一些评论者称这项实验“反自然”，但也有人认为它很创新。"}]}],"synonyms":["nonrealistic","stylized","expressionistic","anti-realist","unnatural"],"phonetic":"/ˌæn.tiˌnætʃ.ə.rəˈlɪs.tɪk/","extraExplanation":["“Antinaturalistic”常用于艺术批评语境，和“naturalistic（自然主义的）”形成对比：自然主义强调像真实生活一样的细节与心理动机；反自然主义则可能采用象征、夸张、打破第四面墙、非写实布景等手法，让观众意识到“这是艺术呈现”。","在戏剧与电影中，它常与“expressionistic（表现主义的）”“stylized（风格化的）”“surreal（超现实的）”等概念相近；例如某些现代戏剧会用旁白、投影字幕或抽象舞台来达到反自然主义效果。"]}
{"word":"antinaturally","summary":{"en":"Antinaturally means “in an unnatural or against-nature way,” often implying something looks or feels forced or contrary to normal nature.","zh":"Antinaturally 表示“以不自然、违背自然规律的方式”，常含“刻意、别扭”的感觉。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that goes against what is natural or normal; unnaturally.","zh":"以违背自然或常态的方式；不自然地。"},"examples":[{"en":"His smile looked antinaturally wide, as if forced.","zh":"他的笑容宽得不自然，像是硬挤出来的。"},{"en":"The flowers were arranged antinaturally, with bright colors mixed at random.","zh":"花被摆放得很不自然，把鲜艳的颜色随意混在一起。"}]}],"synonyms":["unnaturally","artificially","forcedly","abnormally"],"phonetic":"/ˌæntiˈnætʃ(ə)rəli/","extraExplanation":["这个词由前缀 anti-（“反……、对抗……”）+ naturally（“自然地”）构成，语气通常比“unnaturally”更强，带有“刻意反自然、违背本性/规律”的评价色彩。","在现代英语里它不算高频，更常见的表达是 “unnaturally” 或 “in an unnatural way”。在描写风格、行为、艺术效果（如“反自然的姿态/色彩/光线”）时会更容易见到。"]}
{"word":"antinaturalness","summary":{"en":"Antinaturalness means the quality of being against nature or unnatural.","zh":"Antinaturalness 指“反自然性/不自然”，即违背自然或显得不自然的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being against nature or not natural; unnaturalness","zh":"反自然性；不自然（的状态或特质）"},"examples":[{"en":"Some critics complained about the antinaturalness of the dialogue, saying no one speaks that way in real life.","zh":"一些评论家抱怨对白太不自然，说现实生活中没人那样说话。"},{"en":"The designer tried to reduce the antinaturalness of the lighting to make the room feel warmer.","zh":"设计师试图降低灯光的不自然感，让房间更温暖。"}]}],"synonyms":["unnaturalness","artificiality","contrivance"],"phonetic":"/ˌæn.tiˈnætʃ.ɚ.əl.nəs/","extraExplanation":["“antinaturalness”由前缀 anti-（反对）+ natural（自然的）+ -ness（名词后缀，表示“性质/状态”）组成，意思就是“反自然/不自然的性质”。","在日常英语里更常见的词是 “unnaturalness” 或直接用形容词 “unnatural”。“antinaturalness”更偏正式或批评性语境（如艺术评论、伦理/哲学讨论）。"]}
{"word":"antinegro","summary":{"en":"“Antinegro” means anti-Black; it describes prejudice, discrimination, or hostility toward Black people, and is mainly seen in historical/academic contexts.","zh":"“antinegro”意为“反黑人/反黑”，指对黑人的偏见、歧视或敌意，多见于历史或学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to Black people; showing prejudice or discrimination against Black people (anti-Black).","zh":"反黑人（的）；对黑人抱有偏见或歧视（的）。"},"examples":[{"en":"The report documented antinegro violence in the region during that period.","zh":"报告记录了该地区在那一时期的反黑人暴力事件。"},{"en":"Many writers now avoid the term and prefer “anti-Black racism” for clarity.","zh":"许多作者现在避免使用这个词，而更倾向用“反黑种族主义”来表达得更清楚。"}]},{"partOfSpeech":"n.","definition":{"en":"Anti-Black prejudice or discrimination.","zh":"反黑人偏见；对黑人的歧视。"},"examples":[{"en":"The study examined antinegro attitudes in older newspaper editorials.","zh":"这项研究分析了旧报纸社论中的反黑人态度。"}]}],"synonyms":["anti-Black","anti-Black racism","anti-Black prejudice","anti-Black discrimination"],"phonetic":"/ˌæntaɪˈniːɡroʊ/","extraExplanation":["“antinegro”在英语中较少见，常出现在历史文献、社会学研究或引用旧材料时。现代写作更常用、也更尊重的表达是“anti-Black”或“anti-Black racism”。","注意：词中的“negro”在当代英语里通常被视为过时且可能冒犯（尤其在不带引号或非历史语境中）。如果你是在写作或翻译，建议根据语境改用更中性的说法。"]}
{"word":"antinegroism","summary":{"en":"Antinegroism means prejudice or discrimination against Black people (using an older term).","zh":"Antinegroism 指针对黑人群体的偏见或歧视（使用较旧称呼的说法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Hostility, prejudice, or discrimination directed against Black people (often using the older term “Negro”).","zh":"反黑人主义；针对黑人群体的敌意、偏见或歧视（常使用较旧的“Negro”一词）。"},"examples":[{"en":"The report documented antinegroism in housing and employment practices.","zh":"这份报告记录了住房与就业中的反黑人歧视现象。"},{"en":"Activists organized to challenge antinegroism in local schools.","zh":"活动人士组织起来，反对当地学校中的反黑人偏见。"}]}],"synonyms":["anti-Black racism","anti-Blackness","racism against Black people","racial discrimination"],"phonetic":"/ˌæn.tiˈniː.ɡroʊˌɪzəm/","extraExplanation":["“Negro”在当代英语中多被视为过时且可能冒犯的称呼（尤其由非黑人使用时）。因此，antinegroism 这个词也比较少见，现代写作与媒体更常用更明确的表达，如 “anti-Black racism”（反黑人种族主义）或 “anti-Blackness”（反黑人倾向/结构性反黑）。","在阅读历史文献或旧报道时，可能会遇到该词；理解其含义有助于把握当时的社会语境，但在现实交流与写作中建议使用更尊重、更常用的现代术语。"]}
{"word":"antineologian","summary":{"en":"An antineologian is someone who objects to or dislikes new words and newly invented expressions.","zh":"antineologian 指反对或不喜欢新词、新造表达的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposes or dislikes neologisms (newly coined words or expressions).","zh":"反对或不喜欢新词（新造词/新表达）的人。"},"examples":[{"en":"As an antineologian, he complained whenever social media created a new slang term.","zh":"作为一个反新词的人，只要社交媒体造出新俚语，他就会抱怨。"},{"en":"The editor sounded like an antineologian, urging writers to avoid trendy coinages.","zh":"那位编辑听起来很反新词，劝作者不要用时髦的新造词。"}]}],"synonyms":["language purist","purist","traditionalist"],"phonetic":"/ˌæntaɪniəˈloʊdʒiən/","extraExplanation":["这个词非常少见，结构上是 anti-（反对）+ neologian（与 neologism“新词”相关的人）。neologism 常指“新造词/新用法”，而 antineologian 指“反对引入新词或新用法的人”，语气有时带一点调侃。","可对比：neologist（喜欢或创造新词的人）；purist（语言纯粹主义者，常更广泛地反对外来词或“非规范”用法）。"]}
{"word":"antineoplastic","summary":{"en":"“Antineoplastic” means anti-cancer: a drug (noun) or something related to cancer treatment (adjective).","zh":"antineoplastic 指“抗肿瘤/抗癌”：既可作名词表示抗肿瘤药，也可作形容词表示抗肿瘤的（与抗癌治疗相关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medicine or treatment that prevents, slows, or stops the growth of tumors (cancer).","zh":"抗肿瘤药；抗癌治疗（用于预防、减缓或阻止肿瘤/癌细胞生长的药物或疗法）。"},"examples":[{"en":"The oncologist prescribed an antineoplastic drug to shrink the tumor.","zh":"肿瘤科医生开了抗肿瘤药来缩小肿瘤。"},{"en":"Antineoplastic therapies often have side effects like nausea and fatigue.","zh":"抗肿瘤治疗常见副作用包括恶心和乏力。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to or used to prevent, slow, or stop the growth of tumors (cancer).","zh":"抗肿瘤的；抗癌的（与预防、减缓或阻止肿瘤/癌细胞生长有关或用于此目的）。"},"examples":[{"en":"She is receiving antineoplastic chemotherapy.","zh":"她正在接受抗肿瘤化疗。"},{"en":"The lab studies antineoplastic agents and how they work.","zh":"该实验室研究抗肿瘤药物及其作用机制。"}]}],"synonyms":["anticancer","antitumor","chemotherapeutic"],"phonetic":"/ˌæn.taɪˌni.oʊˈplæs.tɪk/","extraExplanation":["词源提示：anti- 表示“反对/对抗”，neoplastic 来自 neoplasm（新生物、肿瘤；字面含义是“新形成的生长”）。因此 antineoplastic 字面就是“对抗肿瘤生长的”。","使用场景：这是医学/药学中的正式用词，日常交流中更常说 cancer drug（抗癌药）、chemotherapy drug（化疗药）或 anti-cancer treatment（抗癌治疗）。"]}
{"word":"antinephritic","summary":{"en":"“Antinephritic” means preventing or treating kidney inflammation or disease (often used in medical contexts).","zh":"antinephritic 指“抗肾炎的/治疗肾脏炎症或肾病的”，多用于医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"preventing or relieving kidney inflammation or kidney disease; related to treatment for the kidneys","zh":"抗肾炎的；预防或缓解肾脏炎症/肾脏疾病的；与肾脏治疗有关的"},"examples":[{"en":"The doctor prescribed an antinephritic medication to help reduce inflammation in the kidneys.","zh":"医生开了抗肾炎药物，帮助减轻肾脏的炎症。"},{"en":"Some herbal remedies are marketed as antinephritic, but you should check the evidence and safety first.","zh":"一些草药被宣传为“抗肾炎”，但应先确认其证据与安全性。"}]},{"partOfSpeech":"n.","definition":{"en":"a substance or medicine used to prevent or treat kidney inflammation or kidney disease","zh":"抗肾炎药；用于预防或治疗肾脏炎症/肾脏疾病的物质或药物"},"examples":[{"en":"In older medical texts, various antinephritics are listed alongside diuretics.","zh":"在较早的医学文献中，各类抗肾炎药常与利尿剂一起被列出。"}]}],"synonyms":["renal-protective","kidney-protective","anti-inflammatory (renal context)"],"phonetic":"/ˌæntiˌnəˈfrɪtɪk/","extraExplanation":["词源提示：anti- 表示“反、抗”，nephritic 与希腊语 nephros（肾）有关，合起来就是“抗（肾炎/肾病）的”。","使用场景：antinephritic 属于医学/药学用词，在日常英语里较少见；日常更常说 kidney medicine（肾脏用药）或 medicine for kidney inflammation（治疗肾脏炎症的药）。"]}
{"word":"antinepotic","summary":{"en":"Antinepotic means opposed to nepotism—favoring relatives or friends unfairly.","zh":"antinepotic 指“反对裙带关系的”，反对不公平地优待亲友。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to nepotism (the unfair practice of giving jobs or advantages to family members or close friends).","zh":"反对裙带关系（指不公平地把工作或好处给亲属或熟人）的；反裙带的。"},"examples":[{"en":"The company introduced antinepotic hiring rules to ensure fairness.","zh":"公司引入反裙带的招聘规定，以确保公平。"},{"en":"She supports antinepotic policies in government appointments.","zh":"她支持政府任命中的反裙带政策。"},{"en":"An antinepotic code of conduct helps prevent conflicts of interest.","zh":"反裙带的行为准则有助于防止利益冲突。"}]}],"synonyms":["anti-nepotism","anti-cronyism","impartial","merit-based"],"phonetic":"/ˌæn.ti.nəˈpɑtɪk/","extraExplanation":["“antinepotic”由前缀 anti-（反对）+ “nepotism”（裙带关系）构成，常见于正式/书面语，尤其在公司治理、公共部门用人制度、学术机构等语境中。","与“anti-nepotism”相比，“antinepotic”更像形容词，用来修饰“policy/rule/law/practice（政策/规定/法律/做法）”。"]}
{"word":"antineural","summary":{"en":"Antineural describes something that counters or suppresses nervous-system (neural) activity.","zh":"antineural 指“抗神经的”，描述对抗或抑制神经系统活动的事物（多见于科研/医学语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Against neural (nerve or brain) activity; intended to reduce, block, or counteract signals in the nervous system.","zh":"抗神经的；用于减弱、阻断或对抗神经系统（神经/大脑）活动或信号的。"},"examples":[{"en":"The researchers tested an antineural compound to see if it could reduce pain signals.","zh":"研究人员测试了一种抗神经化合物，看看它能否减少疼痛信号。"},{"en":"Some lab reports describe antineural effects, meaning the drug suppresses nerve signaling.","zh":"一些实验报告提到“抗神经效应”，意思是该药物抑制神经信号传递。"}]}],"synonyms":["anti-neural","neuroinhibitory","nerve-blocking"],"phonetic":"/ˌæntiˈnjʊrəl/","extraExplanation":["“antineural”不是日常英语里的常见词，更常见的写法与表达包括：anti-neural（带连字符）、neuroinhibitory（神经抑制的）、neurotoxic（神经毒性的，强调损伤）、antineuropathic（抗神经病理性疼痛的）。具体该用哪一个取决于语境：是“抑制神经信号”、还是“对神经有毒”、还是“治疗神经痛”。","词形结构：anti-（反对、抵抗）+ neural（神经的）。在医学/药理学论文中，作者有时会用它来概括“对神经活动起抑制作用”的性质，但在临床沟通中更倾向用更精确的术语。"]}
{"word":"antineuralgic","summary":{"en":"Antineuralgic describes something that helps relieve neuralgia (nerve pain).","zh":"antineuralgic 指“止神经痛的”，用于缓解神经痛（nerve pain）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to relieve or reduce neuralgia (sharp nerve pain).","zh":"（药物/疗法）止神经痛的；用于缓解神经痛（刺痛、剧痛）的。"},"examples":[{"en":"The doctor prescribed an antineuralgic medicine for her facial nerve pain.","zh":"医生给她开了止神经痛的药，用来缓解面部神经痛。"},{"en":"Warm compresses can feel antineuralgic for some people with mild neuralgia.","zh":"对一些轻度神经痛的人来说，热敷可能有止痛效果。"}]}],"synonyms":["pain-relieving","analgesic (for nerve pain)","antineuralgic agent"],"phonetic":"/ˌæn.ti.nuˈræl.dʒɪk/","extraExplanation":["这个词多见于医学或药学语境，日常英语里更常说“pain-relieving (for nerve pain)”“for neuralgia”，或直接用更具体的药物类别（如“analgesic 止痛药”“anticonvulsant 抗癫痫药（有时用于神经痛）”等）。","构词法：anti-（反、对抗）+ neuralgic（神经痛的）。neuralgia 指“神经痛”。","在非专业写作中使用时，最好明确具体症状或部位（如 facial neuralgia 三叉神经痛/面部神经痛），以免读者不熟悉该术语。"]}
{"word":"antineuritic","summary":{"en":"Antineuritic means helping prevent or treat neuritis, often related to vitamin B1 (thiamine).","zh":"antineuritic 指“抗神经炎的”，常与维生素B1（硫胺素）的预防或治疗作用相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"preventing or relieving neuritis (inflammation of nerves), especially problems caused by vitamin B1 (thiamine) deficiency.","zh":"抗神经炎的；预防或缓解神经炎（神经发炎）的，尤指由维生素B1（硫胺素）缺乏引起的问题。"},"examples":[{"en":"Thiamine is an antineuritic vitamin that helps protect the nervous system.","zh":"硫胺素是一种抗神经炎的维生素，有助于保护神经系统。"},{"en":"Doctors may recommend antineuritic supplements when a patient is at risk of deficiency.","zh":"当病人有缺乏风险时，医生可能会建议使用抗神经炎的补充剂。"}]}],"synonyms":["anti-neuritic","neuroprotective (broader)","thiamine-related (contextual)"],"phonetic":"/ˌæn.ti.nuˈrɪtɪk/","extraExplanation":["“antineuritic”常见于医学与营养学语境，历史上常用来指“具有预防脚气病（beriberi）相关神经损伤作用的”，因为脚气病与维生素B1缺乏有关。","词形结构：anti-（反、抗）+ neuritic（神经炎的）。在现代更常见的表达是“thiamine (vitamin B1) prevents neuritis/neuropathy（预防神经炎/神经病变）”，而不是在日常英语中频繁使用该词。"]}
{"word":"antineurotoxin","summary":{"en":"Antineurotoxin means a substance (or something described as such) that neutralizes a neurotoxin, a toxin that affects the nervous system.","zh":"Antineurotoxin 指“抗神经毒素（的）”，即能中和或对抗神经毒素（影响神经系统的毒素）的物质或特性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance (such as an antitoxin or antibody) that counteracts the effects of a neurotoxin (a toxin that harms the nervous system).","zh":"抗神经毒素；一种（如抗毒素或抗体）用来中和/抵消神经毒素（损害神经系统的毒素）作用的物质。"},"examples":[{"en":"Researchers are testing an antineurotoxin to reduce nerve damage after venom exposure.","zh":"研究人员正在测试一种抗神经毒素，以减少接触毒液后的神经损伤。"},{"en":"In theory, an effective antineurotoxin could block the toxin before it reaches nerve receptors.","zh":"理论上，有效的抗神经毒素可以在毒素到达神经受体之前将其阻断。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing something that works against or neutralizes a neurotoxin.","zh":"（形容）具有抗神经毒素作用的；能够对抗或中和神经毒素的。"},"examples":[{"en":"The team developed an antineurotoxin antibody for lab studies.","zh":"该团队开发了一种用于实验室研究的抗神经毒素抗体。"}]}],"synonyms":["antitoxin","neutralizing antibody","antivenom (in venom-related contexts)"],"phonetic":"/ˌæn.tiˌnʊr.oʊˈtɑk.sɪn/","extraExplanation":["这是一个偏专业、较少见的词，多用于医学/毒理学语境。结构上由 anti-（反/抗）+ neurotoxin（神经毒素）组成，字面意思就是“对抗神经毒素的（物质）”。","在真实语料中，更常见、更标准的表达往往是 antitoxin（抗毒素）、antivenom/antivenin（抗蛇毒血清）或 monoclonal antibody（单克隆抗体），具体用哪个取决于毒素来源与治疗方式。"]}
{"word":"antineutral","summary":{"en":"Antineutral means ‘opposed to neutrality’ (most common), and more rarely ‘not electrically neutral’ in chemistry.","zh":"antineutral 常指“反对中立”（最常见）；在化学中较少见，可指“非电中性/带电的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to neutrality or the idea of staying neutral (in politics, conflict, or opinion).","zh":"反对中立的；主张不保持中立的（政治、冲突或立场上）。"},"examples":[{"en":"The group took an antineutral stance and openly supported one side in the conflict.","zh":"该团体采取了反中立立场，公开支持冲突中的一方。"},{"en":"Some commentators criticized the policy as antineutral and likely to increase tensions.","zh":"一些评论员批评该政策“反中立”，可能会加剧紧张局势。"}]},{"partOfSpeech":"adj.","definition":{"en":"(chemistry, less common) not neutral; having an overall positive or negative charge (not electrically neutral).","zh":"（化学，较少见）非中性的；带电的（整体带正电或负电）。"},"examples":[{"en":"In this reaction, an antineutral species forms briefly before stabilizing.","zh":"在该反应中，会短暂形成一种非中性粒子，然后趋于稳定。"}]}],"synonyms":["anti-neutral","against neutrality","nonneutral","non-neutral","charged"],"phonetic":"/ˌæn.tiˈnuː.trəl/","extraExplanation":["“antineutral”不是日常高频词，更常见的表达是“anti-neutral”（加连字符）或直接说“against neutrality / opposed to neutrality”。","前缀“anti-”表示“反对、对立”，与“neutral（中立的）”组合，字面意思就是“反中立”。在政治语境中，常用来描述某人或某政策不支持保持中立的路线。","化学语境里若要表达“非电中性”，更常用“charged”“ionic”“nonneutral / non-neutral”。"]}
{"word":"antineutralism","summary":{"en":"Antineutralism means opposition to staying neutral, especially in international conflicts.","zh":"antineutralism 指反对保持中立（多用于国际冲突或外交政策语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to neutrality, especially the belief that a country should not stay neutral in a conflict but should take sides or become involved.","zh":"反中立主义：反对保持中立，尤其指认为一国在冲突中不应置身事外，而应选边站或介入。"},"examples":[{"en":"During the early years of the war, antineutralism grew as more people argued the country should join the fight.","zh":"战争初期，反中立主义逐渐抬头，更多人主张国家应参战。"},{"en":"The senator’s antineutralism was clear: he believed neutrality only helped the aggressor.","zh":"这位参议员的反中立主义立场很明显：他认为中立只会帮到侵略者。"}]}],"synonyms":["anti-neutrality","interventionism (sometimes, depending on context)","anti-isolationism (related)"],"phonetic":"/ˌæntiˈnuːtrəˌlɪzəm/","extraExplanation":["这个词多出现在政治史与国际关系的语境里，常用来描述国内关于“是否保持中立”的争论（例如第一次、第二次世界大战期间，或冷战时期对不结盟/中立政策的批评）。","构词上：anti-（反对）+ neutral（中立）+ -ism（主义/倾向），因此语气往往偏“立场/理念”，而不是单次行为。"]}
{"word":"antineutrality","summary":{"en":"Antineutrality means opposition to neutrality—believing one should not remain neutral and should take a side, especially in politics or conflict.","zh":"Antineutrality 指“反中立”：反对保持中立，认为在政治或冲突中应当选边站。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to neutrality, especially the belief that a person or country should not stay neutral in a conflict and should take a side.","zh":"反中立（主义）；反对保持中立，尤指认为在冲突中个人或国家不应中立、应选边站的立场或主张。"},"examples":[{"en":"During the debate, his antineutrality was clear: he argued the country must support its allies.","zh":"在辩论中，他的反中立立场很明显：他主张国家必须支持盟友。"},{"en":"The newspaper’s antineutrality pushed readers to see neutrality as a kind of moral failure.","zh":"这家报纸的反中立主张促使读者把“中立”看作一种道德上的失败。"}]}],"synonyms":["opposition to neutrality","anti-neutral stance","nonneutralism"],"phonetic":"/ˌæntiˌnuːˈtrælɪti/","extraExplanation":["“antineutrality”是一个较少见的名词，常出现在政治、外交或战争相关的讨论中，表示“反对中立”的态度。它由 anti-（反对）+ neutrality（中立）构成。","在英语语境里，它常与历史上的“中立政策/是否参战”争论相关（例如围绕国家是否应保持中立、是否应介入战争的公共讨论）。"]}
{"word":"antineutrally","summary":{"en":"Antineutrally means “in a way that opposes neutrality,” often showing a clear side or bias.","zh":"antineutrally 表示“以反中立的方式”，常指明显站队或带有偏向。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is opposed to neutrality; taking sides rather than staying neutral (often in politics, conflict, or debate).","zh":"以反中立的方式；不保持中立、而是明确站队（常用于政治、冲突或辩论语境）。"},"examples":[{"en":"The newspaper reported the dispute antineutrally, clearly favoring one party.","zh":"这家报纸以反中立的方式报道争端，明显偏向其中一方。"},{"en":"He spoke antineutrally about the war, arguing that neutrality was irresponsible.","zh":"他以反中立的立场谈论那场战争，认为保持中立是不负责任的。"}]}],"synonyms":["partisanly","biasedly","non-neutrally"],"phonetic":"/ˌæntiˈnuːtrəli/","extraExplanation":["“antineutrally”来自 anti-（反对）+ neutral（中立的）+ -ly（副词后缀）。它不常见，更常用的表达是 “in an anti-neutral way / in a partisan way / non-neutrally”。","在写作中它通常带有评价色彩：暗示说话者或写作者没有保持客观中立，而是在立场上偏向某一方。"]}
{"word":"antineutrino","summary":{"en":"An antineutrino is the antimatter counterpart of a neutrino, produced in nuclear processes and very hard to detect because it rarely interacts with matter.","zh":"反中微子是中微子的反物质对应粒子，常由核过程产生；因与物质相互作用极弱而难以探测。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tiny, electrically neutral particle produced in some nuclear reactions and radioactive decay; it is the antimatter partner of a neutrino.","zh":"一种极小、无电荷的粒子，常在某些核反应与放射性衰变中产生；它是中微子的反物质对应物。"},"examples":[{"en":"Nuclear reactors release large numbers of antineutrinos.","zh":"核反应堆会释放大量反中微子。"},{"en":"Scientists detect antineutrinos using huge tanks of liquid deep underground.","zh":"科学家用深埋地下的大型液体探测器来探测反中微子。"},{"en":"The antineutrino interacts so weakly that it can pass through the Earth.","zh":"反中微子的相互作用非常弱，甚至可以穿过地球。"}]}],"synonyms":["anti-neutrino"],"phonetic":"/ˌæn.ti.nuˈtri.noʊ/","extraExplanation":["“antineutrino”由前缀 anti-（反……）+ neutrino（中微子）构成，表示“中微子的反粒子”。","反中微子几乎不与物质发生作用，因此探测很困难；物理学中常用它们来研究核反应、粒子物理与天体物理过程。"]}
{"word":"antineutrinos","summary":{"en":"Antineutrinos are neutrinos’ antiparticles—tiny neutral particles produced in nuclear processes that rarely interact with matter.","zh":"反中微子是中微子的反粒子：在核过程里产生、几乎不与物质相互作用的微小中性粒子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Antiparticles of neutrinos: extremely small, electrically neutral particles that are produced in some nuclear reactions (such as radioactive decay and nuclear reactors) and interact only very weakly with matter.","zh":"中微子的反粒子：一种极其微小、没有电荷的粒子，常在某些核反应（如放射性衰变、核反应堆）中产生，与物质的相互作用非常弱。"},"examples":[{"en":"Nuclear reactors release large numbers of antineutrinos that pass through the Earth almost without stopping.","zh":"核反应堆会释放大量反中微子，它们几乎不受阻碍地穿过地球。"},{"en":"Scientists built underground detectors to measure antineutrinos from the Sun and from distant explosions in space.","zh":"科学家在地下建造探测器，用来测量来自太阳以及遥远太空爆炸的反中微子。"}]}],"synonyms":["anti-neutrinos (variant spelling)","neutrinos (related term, not a synonym)"],"phonetic":"/ˌæn.tiˈnuː.triː.noʊz/","extraExplanation":["“antineutrinos”是复数形式，单数是“antineutrino”。在科普文章里常见于核能监测（用反中微子“看”反应堆是否在运行）与天体物理（例如超新星会产生大量中微子/反中微子）。","反中微子通常与“beta decay（β 衰变）”一起出现：在某些β衰变中会放出反中微子。它们几乎不与物质反应，所以需要非常大的探测器（如装满液体的巨大水箱）才能“捕捉”到少量信号。"]}
{"word":"antineutron","summary":{"en":"An antineutron is the neutron’s antiparticle.","zh":"antineutron 指“反中子”，即中子的反粒子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A subatomic particle that is the antiparticle of the neutron, with the same mass but opposite quantum numbers (such as baryon number); it is made of antiquarks.","zh":"反中子：中子的反粒子，质量相同，但量子数（如重子数等）相反；由反夸克组成。"},"examples":[{"en":"In high-energy collisions, an antineutron can be created together with other antiparticles.","zh":"在高能碰撞中，反中子可能与其他反粒子一起产生。"},{"en":"An antineutron is neutral overall, so it is harder to detect than an antiproton.","zh":"反中子整体不带电，因此比反质子更难探测。"}]}],"synonyms":["neutron antiparticle"],"phonetic":"/ˌæntaɪˈnuːtrɑn/","extraExplanation":["“anti-”（反、对立）+ “neutron”（中子）构成“antineutron”。它属于“反物质”概念的一部分：与普通物质粒子对应的反粒子相遇时，通常会发生湮灭并释放能量。","因为反中子不带电，实验中常通过它与物质相互作用后的产物（如湮灭或散射产生的粒子）来间接识别。"]}
{"word":"antineutrons","summary":{"en":"“Antineutrons” are antimatter versions of neutrons (plural).","zh":"“Antineutrons”指“反中子”（复数），即中子的反物质对应粒子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of antineutron: particles of antimatter that have the same mass as neutrons but opposite quantum properties (such as baryon number).","zh":"antineutron（反中子）的复数：一种反物质粒子，质量与中子相同，但量子性质相反（如重子数相反）。"},"examples":[{"en":"In high-energy collisions, antineutrons can be produced together with antiprotons.","zh":"在高能碰撞中，反中子可能与反质子一起产生。"},{"en":"Scientists detect antineutrons indirectly by observing the particles created when they annihilate with matter.","zh":"科学家通常通过观察反中子与物质湮灭后产生的粒子来间接探测它们。"}]}],"synonyms":["antineutron (singular)"],"phonetic":"/ˌæn.tiˈnuː.trɑːnz/","extraExplanation":["“antineutrons”主要出现在粒子物理/宇宙线等语境中。因为反中子不带电，不能像带电粒子那样被电场或磁场直接“弯曲轨迹”来测量，所以实验上常依靠其与普通物质湮灭后的产物来识别。","词形上，antineutron = anti-（反、对立）+ neutron（中子）；复数按规则加 -s。"]}
{"word":"anting","summary":{"en":"“Anting” most commonly refers to a bird grooming behavior involving ants; less commonly it can mean “ants moving” as the -ing form of “ant.”","zh":"“anting”最常指鸟类用蚂蚁梳理羽毛的“蚁浴”行为；较少情况下也可作“ant”的 -ing 形式，表示蚂蚁在爬行/活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Of birds) the behavior of rubbing ants on the feathers or letting ants crawl through the feathers, often thought to help clean feathers or reduce parasites.","zh":"（鸟类）“蚁浴”行为：用蚂蚁摩擦羽毛，或让蚂蚁在羽毛间爬行；一般认为可能有助于清洁羽毛或减少寄生虫。"},"examples":[{"en":"We watched a robin anting on the lawn, spreading its wings as ants crawled over its feathers.","zh":"我们看见一只知更鸟在草地上“蚁浴”，它展开翅膀让蚂蚁爬过羽毛。"},{"en":"Some birds use anting as part of their grooming routine.","zh":"一些鸟会把“蚁浴”当作梳理羽毛的一部分。"}]},{"partOfSpeech":"v.","definition":{"en":"The -ing form of “ant”; used to describe the action of ants moving or working.","zh":"“ant”的 -ing 形式；表示蚂蚁在移动或工作（较少用，通常出现在描写性语境）。"},"examples":[{"en":"In the heat, she noticed ants anting along the cracks in the pavement.","zh":"天气很热，她注意到蚂蚁沿着人行道的裂缝爬行。"}]}],"synonyms":["ant-bathing","grooming behavior (in birds)","preening (related)"],"phonetic":"ˈæn.tɪŋ","extraExplanation":["“anting”最常见的用法是鸟类学术语，中文常译作“蚁浴”。鸟可能会用会分泌蚁酸的蚂蚁来帮助驱赶寄生虫或舒缓皮肤不适，但科学界对其具体原因仍有不同解释。","在自然写作里，常见搭配是“a bird was anting”或“to observe anting behavior”。"]}
{"word":"antinganting","summary":{"en":"“antinganting” is not a standard English word; it likely refers to Indonesian “anting-anting,” meaning “earring(s).”","zh":"“antinganting”不是标准英语词；很可能指印尼语“anting-anting”，意思是“耳环”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Not standard English) An Indonesian/Malay word meaning an earring; often written “anting-anting.”","zh":"（非标准英语）印尼语/马来语词，意思是“耳环”，常写作“anting-anting”。"},"examples":[{"en":"She bought a pair of anting-anting at the market in Jakarta.","zh":"她在雅加达的市场买了一对耳环（anting-anting）。"},{"en":"In Indonesian, “anting-anting” means “earrings.”","zh":"在印尼语里，“anting-anting”意思是“耳环”。"}]}],"synonyms":["earring","earrings"],"phonetic":"/ˈɑn.tɪŋ ˌɑn.tɪŋ/","extraExplanation":["“anting-anting”主要出现在印尼语/马来语语境中，不是英语常用词；如果你想用英语表达，一般说“earring(s)”。","印尼语里常见“重叠”（reduplication）的写法（如 a-b a-b），有时用于构成名词或表达类别/强调；“anting-anting”通常就是固定说法。","如果你原本想查的是英语单词（比如“anting”相关），请告诉我句子或你想表达的意思，我可以帮你找到最接近的英文词。"]}
{"word":"antings","summary":{"en":"“Antings” is the plural of “anting,” a bird behavior of rubbing ants on feathers, possibly to help with parasites or irritation.","zh":"“Antings”是“anting”的复数，指鸟类的“蚁浴”行为：把蚂蚁擦到羽毛上，可能用于驱虫或缓解不适。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually plural: antings) a behavior in which a bird rubs ants on its feathers or sits on an ant nest, apparently to help remove parasites or soothe the skin.","zh":"（常用复数：antings）“蚁浴”：鸟类把蚂蚁擦到羽毛上，或坐在蚁窝上，让蚂蚁爬到身上；一般认为可能有驱虫、缓解皮肤不适等作用。"},"examples":[{"en":"The researcher recorded several antings by starlings in the grass.","zh":"研究人员记录到椋鸟在草地上进行了几次“蚁浴”。"},{"en":"Some birds do antings after rain, when ants are active on the ground.","zh":"有些鸟会在雨后进行“蚁浴”，因为那时蚂蚁在地面更活跃。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of doing anting; the process of rubbing ants on feathers.","zh":"进行“蚁浴”的动作/过程；把蚂蚁擦到羽毛上的行为。"},"examples":[{"en":"Anting is a kind of self-care behavior seen in many bird species.","zh":"“蚁浴”是一种在多种鸟类中都能看到的自我护理行为。"}]}],"synonyms":["bird preening behavior","self-care behavior (in birds)"],"phonetic":"/ˈæn.tɪŋ/","extraExplanation":["“anting/antings”在日常英语里并不常见，更多出现在自然观察、鸟类学（ornithology）或纪录片解说中。","关于作用，常见解释包括：蚂蚁分泌的甲酸（formic acid）可能帮助杀死/驱赶羽毛上的寄生虫；也可能只是让皮肤感觉舒缓。目前并非所有细节都有一致结论。","如果你原本想表达“paintings（绘画/画作）”，请告诉我语境，我可以帮你对比这两个词的拼写与用法。"]}
{"word":"antinial","summary":{"en":"Antimonial usually means “related to or containing antimony.”","zh":"Antimonial 通常表示“与锑有关或含锑的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended: **antimonial**) relating to, containing, or made from **antimony** (a chemical element).","zh":"（可能想写：**antimonial**）与**锑**（一种化学元素）有关的；含锑的；由锑制成的。"},"examples":[{"en":"The lab stored antimonial compounds in a locked cabinet.","zh":"实验室把含锑化合物存放在上锁的柜子里。"},{"en":"Antimonial alloys have been used historically in some types of metalwork.","zh":"含锑合金在历史上曾用于某些金属加工。"}]},{"partOfSpeech":"n.","definition":{"en":"An antimonial substance or compound (less common).","zh":"含锑物质；含锑化合物（较少见用法）。"},"examples":[{"en":"The pharmacist recorded the amount of antimonial used in the preparation.","zh":"药剂师记录了配制过程中使用的含锑物质的用量。"}]}],"synonyms":["antimony-related","antimony-containing"],"phonetic":"/ˌæn.təˈmoʊ.ni.əl/","extraExplanation":["你输入的 **antinial** 不是常见英文单词；最接近、最常用的拼写通常是 **antimonial**（与“antimony/锑”相关）。如果你想表达的是别的词（例如某个专业术语或人名/品牌），可以给我一句上下文，我可以帮你确认。","历史上“锑剂（antimonial compounds）”曾出现在医学与炼金术文献中，但现代语境多用于化学/材料领域；涉及毒性与安全规范时要以专业资料为准。"]}
{"word":"antinicotine","summary":{"en":"Antinicotine means opposing nicotine use or smoking, often used for campaigns, policies, or education.","zh":"antinicotine 指反对尼古丁使用或吸烟，常用于宣传、政策或教育等语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to nicotine use or tobacco smoking; intended to reduce or prevent nicotine addiction.","zh":"反对尼古丁使用或吸烟的；旨在减少或预防尼古丁成瘾的。"},"examples":[{"en":"The school launched an antinicotine campaign to discourage vaping among teens.","zh":"学校发起了反尼古丁宣传活动，劝阻青少年吸电子烟。"},{"en":"Some cities passed antinicotine policies that limit where people can smoke.","zh":"一些城市通过了反尼古丁政策，限制人们在哪些地方可以吸烟。"}]}],"synonyms":["anti-smoking","tobacco-control","smoke-free"],"phonetic":"/ˌæn.tiˈnɪk.ə.tiːn/","extraExplanation":["“anti-”是表示“反对、抵制”的常见前缀，因此 antinicotine 多用于公共卫生、教育与政策语境，指“反对尼古丁/控烟”的立场、宣传或措施。","在更常见的日常英语中，人们也会说 anti-smoking（反吸烟的）、tobacco-control（控烟的）、smoke-free（无烟的）。"]}
{"word":"antinihilism","summary":{"en":"Antinihilism means opposition to nihilism—the belief that life can have meaning and values matter.","zh":"Antinihilism 指反虚无主义：反对“一切皆无意义”的观点，主张生命可有意义、价值很重要。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to nihilism; the view that life, values, or meaning are real or can be affirmed (sometimes used for philosophies or movements that reject nihilistic conclusions).","zh":"反虚无主义；反对“虚无主义”的立场，认为生命、价值或意义是真实存在或可以被肯定（有时用来指拒绝虚无主义结论的哲学观点或思潮）。"},"examples":[{"en":"His writing is a kind of antinihilism: even in suffering, he insists that life can have meaning.","zh":"他的写作带有一种反虚无主义：即使在痛苦中，他仍坚持生命可以有意义。"},{"en":"Some religious and humanist thinkers are described as antinihilist because they reject the idea that nothing matters.","zh":"一些宗教或人文主义思想家被称为反虚无主义者，因为他们拒绝“什么都不重要”的看法。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to or expressing opposition to nihilism.","zh":"反虚无主义的；表达对虚无主义反对的。"},"examples":[{"en":"The novel ends on an antinihilist note, suggesting that compassion is still possible.","zh":"这部小说以一种反虚无主义的基调收尾，暗示同情心依然可能存在。"},{"en":"Her antinihilist arguments focus on responsibility and community.","zh":"她的反虚无主义论证聚焦于责任与共同体。"}]}],"synonyms":["anti-nihilism","opposition to nihilism","meaning-affirming philosophy","value-affirmation"],"phonetic":"/ˌæn.tiˈnaɪ.əˌlɪz.əm/","extraExplanation":["“antinihilism”并不是特别常见的标准词形；更常见的表达是“anti-nihilism”（加连字符）或直接说“opposition to nihilism（反对虚无主义）”。","词源上可以拆成：anti-（反对）+ nihilism（虚无主义）。与“nihilism（认为一切没有意义/价值）”相对，反虚无主义常强调：价值可建立、意义可追求、道德或信念有根据。","在文学与哲学语境中，人们有时会用更具体的词来表达类似立场，如“humanism（人文主义）”“existentialism（存在主义，常与对抗虚无相关）”“faith-based meaning（信仰赋予的意义）”。"]}
{"word":"antinihilist","summary":{"en":"Antinihilist means a person (or viewpoint) that opposes nihilism and supports the idea that life can have meaning and value.","zh":"Antinihilist 指反对虚无主义的人或观点，强调人生仍可有意义与价值。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposes nihilism (the belief that life has no meaning or that nothing has real value)","zh":"反虚无主义者；反对虚无主义（认为人生无意义或一切都无真实价值的观点）的人"},"examples":[{"en":"He calls himself an antinihilist and argues that moral values still matter.","zh":"他自称是反虚无主义者，并主张道德价值依然重要。"},{"en":"Some writers became antinihilists after seeing the harm caused by extreme cynicism.","zh":"一些作家在看到极端犬儒带来的伤害后，转而成为反虚无主义者。"}]},{"partOfSpeech":"adj.","definition":{"en":"opposed to nihilism; supporting meaning, value, or moral purpose","zh":"反虚无主义的；主张意义、价值或道德目的存在的"},"examples":[{"en":"Her antinihilist message is that even small acts of kindness have meaning.","zh":"她的反虚无主义信息是：即使微小的善举也有意义。"},{"en":"The novel takes an antinihilist turn near the end, offering hope instead of emptiness.","zh":"这部小说在结尾处转向反虚无主义，给出希望而非虚无。"}]}],"synonyms":["anti-nihilist","opponent of nihilism","anti-cynical (contextual)","value-affirming (contextual)"],"phonetic":"/ˌæntiˈnaɪəlɪst/","extraExplanation":["“antinihilist”更常见的写法是带连字符的“anti-nihilist”。它多出现在哲学、文学评论或社会思想讨论中，用来描述对“虚无、犬儒、价值崩塌”立场的反对者。","“nihilism（虚无主义）”在英语语境里常与19世纪俄国思想讨论、以及现代文化中的“cynicism（犬儒/冷嘲式不信任）”联系在一起；“antinihilist”往往强调：意义可以被建立，价值可以被捍卫。"]}
{"word":"antinihilistic","summary":{"en":"Antinihilistic means opposing nihilism and affirming that meaning or values can exist.","zh":"Antinihilistic 指反对虚无主义，认为意义或价值仍然可能存在。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to nihilism; believing that life, values, or meaning are real (or can be real), rather than rejecting them as pointless.","zh":"反虚无主义的；反对认为人生/价值/意义皆毫无意义的观点。"},"examples":[{"en":"Her antinihilistic attitude helped the group stay hopeful during difficult times.","zh":"她反虚无主义的态度帮助团队在困难时期保持希望。"},{"en":"The novel ends on an antinihilistic note, suggesting that small acts of kindness matter.","zh":"这部小说以反虚无主义的基调收尾，暗示微小的善意也很重要。"}]},{"partOfSpeech":"adj.","definition":{"en":"Showing or expressing resistance to cynical despair or the belief that nothing matters.","zh":"表现出对犬儒式绝望的抵抗；不认同“什么都不重要”的态度。"},"examples":[{"en":"His antinihilistic humor makes serious topics feel bearable.","zh":"他那种反虚无的幽默让严肃话题变得更能承受。"},{"en":"Many coming-of-age films have an antinihilistic message about finding purpose.","zh":"许多成长题材电影都有一种反虚无的信息：人可以找到自己的目标。"}]}],"synonyms":["anti-nihilistic","life-affirming","meaning-affirming","hopeful","anti-cynical"],"phonetic":"ˌæn.tiˈnaɪ.əˌlɪs.tɪk","extraExplanation":["“antinihilistic”并不是非常常见的标准词形，更常见的是 **anti-nihilistic**（带连字符）或 **antinnihilism / antinihilism** 的相关表达。","词根拆分：**anti-**（反对）+ **nihil**（拉丁语“无、虚无”）+ **-istic**（……主义的/……风格的）。","在文学或影评里，它常用来形容作品的结尾或主题“不是虚无的”，即使承认痛苦与荒诞，也仍然肯定某种价值（例如爱、责任、同情、行动）。"]}
{"word":"antinion","summary":{"en":"“Antinion” isn’t a recognized English word; it’s likely a misspelling (often of “antinomy”).","zh":"“antinion” 不是常见或规范的英语词；很可能是拼写错误（常见情况是想写 “antinomy”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling (for example, of “antinomy”).","zh":"不是标准英语单词。很可能是拼写错误（例如把 “antinomy” 拼成了它）。"},"examples":[{"en":"I can’t find “antinion” in a dictionary—did you mean “antinomy”?","zh":"我在词典里找不到 “antinion”——你是不是想写 “antinomy”？"},{"en":"Please share the full sentence where you saw “antinion,” and I’ll help you identify the correct word.","zh":"请把你看到 “antinion” 的完整句子发出来，我可以帮你确认正确的词。"}]}],"phonetic":"/ænˈtɪniən/","extraExplanation":["“antinion” 很可能想写的是 **antinomy**（常见于哲学/逻辑语境），意思是“两条看似都合理但彼此矛盾的原则或结论之间的对立/矛盾”。例如：*a moral antinomy*（道德上的两难矛盾）。","如果你告诉我来源（书名/网页）或提供上下文句子，我也可以判断是否其实是专有名词、人名、地名，或其他相近拼写的词（如 *antonym* 反义词、*antimony* 锑）。"]}
{"word":"Antinoan","summary":{"en":"Antinoan means “connected with Antinous” and is used especially for the cult and artistic style linked to him in the Roman Empire.","zh":"Antinoan 意为“与安提诺乌斯相关的”，常用于指与他有关的崇拜与罗马帝国时期的艺术形象/风格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Antinous (a Greek youth beloved of the Roman emperor Hadrian) or to the cult, art, and imagery associated with him.","zh":"与安提诺乌斯（罗马皇帝哈德良宠爱的希腊青年）有关的；或与以他为中心的崇拜、艺术与形象相关的。"},"examples":[{"en":"The museum displayed several Antinoan statues from the 2nd century CE.","zh":"博物馆展出了几尊公元2世纪的安提诺乌斯题材雕像。"},{"en":"Scholars discuss how Antinoan imagery spread across the Roman Empire.","zh":"学者们讨论安提诺乌斯形象如何在罗马帝国各地传播。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or thing connected with Antinous or his cult (rare in modern use).","zh":"与安提诺乌斯或其崇拜相关的人或事物（现代用法较少）。"},"examples":[{"en":"The inscription may refer to an Antinoan honored in the local rites.","zh":"这段铭文可能指一位在当地仪式中受尊崇的“安提诺乌斯相关人物”。"}]}],"synonyms":["Antinous-related","Hadrianic (related context)"],"phonetic":"/ænˈtaɪnoʊən/","extraExplanation":["“Antinoan”常见于艺术史与古典学语境，尤其指哈德良时期（Hadrianic period）大量出现的安提诺乌斯肖像：卷发、理想化的年轻面容、带有希腊化风格的身体比例等。","安提诺乌斯在尼罗河溺亡后，哈德良推动了对他的纪念与神格化：建立城镇（如Antinoöpolis）、铸造钱币、设置祭祀与竞技，因此你会在“Antinoan coinage / Antinoan cult / Antinoan portrait”等搭配中看到该词。"]}
{"word":"antinociception","summary":{"en":"Antinociception means reducing pain signaling (nociception), often discussed in medical or research contexts.","zh":"Antinociception 指降低痛觉信号传导（伤害感受），常见于医学与科研语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) the process or effect of reducing the sensation of pain by blocking or dampening nociception (pain signaling).","zh":"（医学）抗伤害感受：通过阻断或减弱伤害感受（痛觉信号传导）来降低疼痛感觉的过程或作用。"},"examples":[{"en":"Opioids produce antinociception by reducing pain signals in the brain and spinal cord.","zh":"阿片类药物通过减少大脑和脊髓中的痛觉信号来产生抗伤害感受作用。"},{"en":"In the study, researchers measured antinociception using a heat-based pain test in mice.","zh":"在这项研究中，研究人员用基于热刺激的疼痛测试来测量小鼠的抗伤害感受。"}]}],"synonyms":["pain inhibition","antinociceptive effect","analgesia (related)"],"phonetic":"/ˌæn.tiˌnoʊ.sɪˈsɛp.ʃən/","extraExplanation":["构词拆解：anti-（“反、对抗”）+ nociception（来自拉丁语 nocere “伤害”，指机体对潜在伤害刺激的感受与信号传导）。因此 antinociception 强调“对抗痛觉信号”的生理/药理效应。","与 analgesia（镇痛）相比：analgesia 更偏向“主观疼痛体验减少”的结果；antinociception 更常用于科研语境，强调“伤害感受通路被抑制”的机制与测量。"]}
{"word":"antinodal","summary":{"en":"Antinodal means “at or related to an antinode,” a place in a standing wave where the motion is greatest.","zh":"Antinodal 指“与波腹有关的”，即驻波中振动（振幅）最大的点或区域。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Physics) Relating to an antinode—the point in a standing wave where the vibration (amplitude) is greatest.","zh":"（物理）与“波腹”有关的；指驻波中振幅最大的点或区域。"},"examples":[{"en":"The antinodal points on the string move the most during vibration.","zh":"弦上的波腹点在振动时移动得最大。"},{"en":"We placed the sensor near an antinodal region to measure the maximum amplitude.","zh":"我们把传感器放在波腹区域附近，以测量最大振幅。"},{"en":"In the second harmonic, there are two antinodal sections along the tube.","zh":"在第二谐波中，管内沿长度方向有两个波腹段。"}]}],"synonyms":["at an antinode","maximum-amplitude","peak-amplitude"],"phonetic":"/ˌæn.t̬iˈnoʊ.dəl/","extraExplanation":["“Antinodal”来自“antinode”（波腹）：前缀 anti- 在这里有“相对、对应”的感觉，强调它与“node（波节）”相对——波节处振幅为零，波腹处振幅最大。","常见搭配：antinodal point（波腹点）、antinodal region（波腹区）、antinodal displacement（波腹位移）、antinodal line/plane（波腹线/面，常见于振动模态分析）。"]}
{"word":"antinode","summary":{"en":"An antinode is a point of maximum vibration in a standing wave.","zh":"antinode 指驻波中振幅最大的“波腹”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In a standing wave, a point where the vibration (displacement or amplitude) is greatest; it is the opposite of a node.","zh":"（驻波中）振动（位移或振幅）最大的点；与“波节（node）”相对。"},"examples":[{"en":"In a vibrating string, antinodes form at the points with the largest motion.","zh":"在振动的弦上，波腹会出现在运动幅度最大的点上。"},{"en":"The simplest standing wave on a string has one antinode in the middle and nodes at both ends.","zh":"弦上最简单的驻波模式是：中间一个波腹，两端是波节。"},{"en":"On wind instruments, the position of antinodes affects which notes can resonate.","zh":"在管乐器中，波腹的位置会影响哪些音高能产生共鸣。"}]}],"synonyms":["loop","point of maximum amplitude"],"phonetic":"/ˈæn.tiˌnoʊd/","extraExplanation":["“antinode”常见于物理与音乐声学：驻波由两列反向传播的波叠加形成，固定不动的点叫“波节（node）”，振幅最大的点叫“波腹（antinode）”。弦或管中的不同驻波模式（基频与泛音/谐波）会产生不同数量与位置的波节和波腹。","词形上：anti- 表示“相对/相反”，node 表示“结点”，因此 antinode 字面意思就是“与结点相对的点”。"]}
{"word":"antinodes","summary":{"en":"Antinodes are points of maximum vibration or intensity in standing waves or interference patterns.","zh":"Antinodes（腹点）是驻波或干涉图样中振幅/强度最大的点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In a standing wave (like on a string or in an air column), a point where the vibration (amplitude) is greatest.","zh":"（物理）在驻波中（如弦或空气柱），振幅（振动幅度）最大的点。"},"examples":[{"en":"In the first harmonic on a string, the antinode is at the center.","zh":"在弦的基频（第一谐波）中，腹点在中间。"},{"en":"Place the microphone near an antinode to measure the loudest sound in the standing wave.","zh":"把麦克风放在腹点附近，可以测到驻波中最响的声音。"},{"en":"The diagram shows nodes at the ends and antinodes between them.","zh":"图中显示两端是波节，中间是腹点。"}]},{"partOfSpeech":"n.","definition":{"en":"A bright (maximum-intensity) point or region in an interference or diffraction pattern, where waves reinforce each other.","zh":"（干涉/衍射）波相互加强处形成的亮点或强度最大区域。"},"examples":[{"en":"The brightest rings in the pattern correspond to antinodes of the light wave.","zh":"图样中最亮的环对应光波的腹点（强度极大处）。"},{"en":"Where the two waves meet in phase, an antinode appears.","zh":"当两列波同相叠加时，会出现腹点。"}]}],"synonyms":["points of maximum amplitude","antinodal points","maxima"],"phonetic":"/ˈæn.ti.noʊd/","extraExplanation":["“antinode”由“anti-（相对）+ node（波节）”构成：node 是振幅为零的点；antinode 则是振幅最大的点。","在乐器中（如吉他弦、长笛/管风琴气柱），腹点位置会随“谐波/泛音”变化；理解腹点有助于判断哪里振动最强、声音最响。","复数形式为 antinodes，常在物理题和波动图像描述中出现。"]}
{"word":"antinoise","summary":{"en":"Antinoise is sound (or related technology) used to cancel unwanted noise by producing an opposite sound wave.","zh":"Antinoise（反噪声）是用相反声波来抵消不想要噪音的声音或相关技术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Sound (usually computer-generated) that is designed to cancel unwanted noise by being the opposite wave (used in active noise-canceling technology).","zh":"（通常由电脑生成的）用于抵消不想要的噪音的声音；通过产生“相反的声波”来实现消噪（用于主动降噪技术）。"},"examples":[{"en":"Noise-canceling headphones create antinoise to reduce airplane engine sound.","zh":"降噪耳机会产生反噪声来减弱飞机发动机的声音。"},{"en":"The system uses microphones to detect noise and then produces antinoise in real time.","zh":"该系统用麦克风检测噪音，然后实时产生反噪声。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to technology or methods that use opposite sound waves to cancel noise (often written as “anti-noise”).","zh":"与利用相反声波来抵消噪音的技术或方法有关的（常写作“anti-noise”）。"},"examples":[{"en":"They installed an anti-noise system in the ventilation ducts.","zh":"他们在通风管道里安装了反噪声系统。"},{"en":"Anti-noise control works best for steady, low-frequency sounds.","zh":"反噪声控制对稳定的低频噪音效果最好。"}]}],"synonyms":["anti-noise","noise cancellation","active noise control (ANC)","active noise cancellation"],"phonetic":"/ˌæn.tiˈnɔɪz/","extraExplanation":["“反噪声（antinoise/anti-noise）”的核心原理是“相消干涉”：当噪音声波与其相位相反、幅度相近的声波叠加时，会互相抵消，从而让你听到的噪音变小。","在日常语境中，人们更常说“noise-canceling（降噪的）”或“active noise cancellation (ANC)（主动降噪）”。“Antinoise”多见于工程、声学与技术说明文本。"]}
{"word":"antinome","summary":{"en":"Antinome (rare) means an antinomy: a clash or contradiction between two principles or rules that both seem valid.","zh":"Antinome（罕用）指“二律背反/对立”：两条看似都成立的原则或规则之间的冲突与矛盾。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) An antinomy: a direct contradiction between two rules, laws, or principles that both seem reasonable or valid.","zh":"（罕用）同“antinomy（对立/二律背反）”：指两条规则、法律或原则彼此直接矛盾，但看起来又都合理或成立。"},"examples":[{"en":"The essay points out an antinome in the policy: it promises privacy but requires constant monitoring.","zh":"这篇文章指出该政策中的一个“二律背反”：它承诺隐私，却要求持续监控。"},{"en":"In philosophy class, we discussed an antinome—two principles that clash when applied to real life.","zh":"在哲学课上，我们讨论了一个“二律背反”——两条原则一旦用于现实生活就会冲突。"}]}],"synonyms":["antinomy","contradiction","paradox","inconsistency"],"phonetic":"/ˈæn.təˌnoʊm/","extraExplanation":["“antinome”在现代英语里非常少见；更常用、更标准的拼写是“antinomy”。如果你想表达“反对法律/反律法主义者”，常用词是“antinomian”（名词/形容词）。","词源来自希腊语：anti-（对抗）+ nomos（法律/规则），核心含义与“规则之间的冲突”有关。"]}
{"word":"antinomian","summary":{"en":"Antinomian refers to a person or belief that rejects the need to obey moral or religious law, often arguing that faith or grace makes such rules unnecessary.","zh":"Antinomian（反律法主义者/反律法主义的）指拒绝遵守道德或宗教律法的人或观点，常主张信仰或恩典使这些规则变得不必要。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who believes that religious faith (especially “grace”) frees them from having to obey moral rules or religious law","zh":"（尤指基督教语境中）主张“因信称义/恩典”使人不必遵守道德规范或宗教律法的人"},"examples":[{"en":"Some critics called the group antinomians because they rejected strict religious rules.","zh":"一些批评者称那群人是反律法主义者，因为他们拒绝严格的宗教规条。"},{"en":"In the sermon, he warned against becoming an antinomian who uses faith as an excuse for harmful behavior.","zh":"在布道中，他警告不要变成反律法主义者，把信仰当作伤害他人的借口。"}]},{"partOfSpeech":"adj.","definition":{"en":"believing that moral laws or religious rules are not necessary, especially because faith is seen as more important than law","zh":"（观点或行为）反律法主义的；认为道德律或宗教规条并非必要的（尤指认为信仰高于律法）"},"examples":[{"en":"His antinomian reading of the text focused on inner faith rather than outward rules.","zh":"他对文本的反律法主义式解读强调内在信心，而非外在规条。"},{"en":"The novel portrays an antinomian character who refuses to be judged by conventional morality.","zh":"这部小说塑造了一个反律法主义色彩的人物，拒绝被传统道德评判。"}]}],"synonyms":["lawless","unrestrained","libertine","amoral","anti-legalistic"],"phonetic":"/ˌæn.tɪˈnoʊ.mi.ən/","extraExplanation":["词源：anti-（反对）+ nomos（希腊语“法律/规范”）+ -ian（表示“……的人/……的”）。","常见语境：多用于神学与宗教史讨论，尤其在基督教内部关于“恩典、信心与行为/律法关系”的争论中。它通常是批评性标签，暗示把“信仰自由”推到否定道德责任的程度。","文化/历史提示：英语史料中常提到17世纪英格兰及新英格兰清教徒社会中的“Antinomian Controversy（反律法主义之争）”，与宗教权威、社会秩序和个人良心的边界有关。"]}
{"word":"antinomianism","summary":{"en":"Antinomianism is the belief that faith or a principle frees people from obeying moral or religious law; more broadly, it can mean rejecting rules as unnecessary.","zh":"Antinomianism 指“反律法主义”：认为信仰或某种原则使人不必遵守道德/宗教律法；广义也可指否定规则的必要性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The belief that religious faith frees a person from having to obey moral law or religious rules (for example, saying “grace means rules don’t matter”).","zh":"反律法主义：一种认为有了宗教信仰（或“恩典”）就不必遵守道德律或宗教戒律的观点。"},"examples":[{"en":"Some critics accused the group of antinomianism, arguing that they treated moral rules as optional.","zh":"一些批评者指责该团体是反律法主义，认为他们把道德规范当作可有可无。"},{"en":"In church history, antinomianism often appears in debates about grace versus obedience.","zh":"在教会历史中，反律法主义常出现在“恩典”与“顺服”之间的争论里。"}]},{"partOfSpeech":"n.","definition":{"en":"More broadly, any view that rejects laws or rules as unnecessary, especially moral or social ones.","zh":"（广义）反对或否定法律/规则必要性的观点，尤指道德或社会规范。"},"examples":[{"en":"The novel portrays a kind of moral antinomianism in which the hero refuses all social norms.","zh":"这部小说描绘了一种道德反律法主义：主人公拒绝一切社会规范。"}]}],"synonyms":["lawlessness","moral license","rule rejection","libertinism (in some contexts)"],"phonetic":"/ˌæn.ti.noʊˈmiː.ni.ə.nɪ.zəm/","extraExplanation":["词源上，anti- 表“反对”，nomos 是希腊语“法律/规范”，-ism 表“主义/思潮”。","该词常见于基督教神学与宗教史语境（如宗教改革后关于“因信称义”与“行为/律法”的争论）。它通常是批评性标签，暗示“用信仰当借口忽视道德责任”。","不要把 antinomianism 简单等同于“无政府主义”。它重点是“否定（道德/宗教）律法的约束力”，不一定主张推翻政治国家。"]}
{"word":"antinomians","summary":{"en":"Antinomians are people (or ideas) that claim religious faith makes obeying moral law unnecessary, especially in Christian theology.","zh":"antinomians 指“反律法主义者”（或相关观点）：认为因信仰/恩典而不必遵守道德律法，常见于基督教神学讨论且常带批评意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who believes that, because of religious faith and God’s grace, Christians are not required to obey moral law in order to be saved (often used as a criticism).","zh":"反律法主义者：认为因信仰与上帝恩典，基督徒不必遵守道德律法也能得救的人（常带批评意味）。"},"examples":[{"en":"Some opponents accused the group of being antinomians who ignored moral rules.","zh":"一些反对者指责该团体是反律法主义者，认为他们无视道德规范。"},{"en":"The preacher insisted that grace does not make believers antinomians.","zh":"那位牧师强调：恩典并不会让信徒变成反律法主义者。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to or supporting antinomian beliefs.","zh":"与反律法主义有关的；主张反律法主义的。"},"examples":[{"en":"The debate centered on antinomian teachings in the early church.","zh":"这场争论聚焦于早期教会中的反律法主义教导。"},{"en":"Historians discuss antinomian controversies during the Reformation era.","zh":"历史学家会讨论宗教改革时期的反律法主义争议。"}]}],"synonyms":["lawless (in religious debate)","anti-legalist","free-grace (context-dependent)"],"phonetic":"/ˌæn.tiˈnoʊ.mi.ənz/","extraExplanation":["“Antinomian”源自希腊语 anti-（反对）+ nomos（法律/律法）。在基督教语境里，常与“律法（law）与恩典（grace）”的关系有关。","该词常出现在宗教改革及清教徒历史中，例如17世纪新英格兰的“反律法主义争议”（Antinomian Controversy）。在争论中，一方担心过度强调“因信称义”会被误解为不必追求道德生活。","现代英语里它多为学术或争论性用语，通常带评价色彩；使用时注意它往往是对他人的指控，而非自我认同的标签。"]}
{"word":"antinomic","summary":{"en":"Antinomic means ‘in conflict or logically contradictory,’ often used for opposing principles or philosophical paradoxes.","zh":"Antinomic 指“相互对立、逻辑上难以同时成立的”，常用于原则冲突或哲学中的二律背反。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"involving a contradiction between two rules, principles, or ideas; conflicting in a way that seems equally valid","zh":"（两条规则、原则或观念之间）相互矛盾的；对立且似乎各有道理的"},"examples":[{"en":"Some people see personal freedom and strict public safety laws as antinomic goals.","zh":"有些人认为个人自由与严格的公共安全法律是相互对立的目标。"},{"en":"Her duties as a lawyer and her loyalty to a friend felt antinomic.","zh":"她作为律师的职责和对朋友的忠诚让她感到彼此矛盾。"}]},{"partOfSpeech":"adj.","definition":{"en":"(philosophy) relating to an antinomy—a pair of statements that appear logically sound but lead to a contradiction","zh":"（哲学）与“二律背反”有关的；指两条看似都合乎逻辑却导向矛盾的命题"},"examples":[{"en":"Kant discusses antinomic problems that reason runs into when it goes beyond experience.","zh":"康德讨论了理性在超出经验范围时会陷入的二律背反问题。"},{"en":"The essay explores antinomic claims about whether the universe has a beginning.","zh":"这篇文章探讨了关于宇宙是否有开端的二律背反式主张。"}]}],"synonyms":["contradictory","incompatible","conflicting","paradoxical"],"phonetic":"/ˌæn.təˈnɑː.mɪk/","extraExplanation":["“antinomic”来自“antinomy”（二律背反）。常用于哲学与批判性写作，强调：冲突的两方并非简单的“对/错”，而是看似都能自圆其说，却无法同时成立。","日常写作里，它比“contradictory”更“书面”，也更强调“原则层面”的对立；如果只是普通矛盾，用“conflicting/contradictory”更自然。"]}
{"word":"antinomical","summary":{"en":"Antinomical means “mutually contradictory,” and in philosophy it describes contradictions that arise from equally plausible principles (an antinomy).","zh":"Antinomical 意为“相互矛盾的”；在哲学中指由同样看似合理的原则引发的“二律背反”式矛盾。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of ideas, statements, or rules) directly contradictory, so that they cannot both be true or valid at the same time.","zh":"（指观点、陈述或规则）相互矛盾的、对立的，以至于不可能同时为真或同时有效。"},"examples":[{"en":"Their antinomical arguments confused the audience because each side claimed to be completely correct.","zh":"他们相互矛盾的论点让观众很困惑，因为双方都声称自己完全正确。"},{"en":"The report contains antinomical conclusions: it says the plan is both necessary and impossible.","zh":"这份报告包含相互矛盾的结论：它说这个计划既必要又不可能实现。"}]},{"partOfSpeech":"adj.","definition":{"en":"(philosophy) relating to an antinomy—a pair of principles or conclusions that seem equally reasonable but contradict each other.","zh":"（哲学）与“二律背反”有关的；指两种看似同样合理却彼此矛盾的原则或结论。"},"examples":[{"en":"Kant discussed several antinomical problems to show the limits of pure reason.","zh":"康德讨论了若干二律背反式的问题，以展示纯粹理性的局限。"},{"en":"The essay explores an antinomical tension between individual freedom and social order.","zh":"这篇文章探讨了个人自由与社会秩序之间的二律背反式张力。"}]}],"synonyms":["contradictory","inconsistent","conflicting","paradoxical","self-contradictory"],"phonetic":"/ˌæntəˈnɑmɪkəl/","extraExplanation":["“antinomical”常见的同义词是“contradictory（矛盾的）”“inconsistent（前后不一致的）”。在哲学语境里，它更接近“paradoxical（似是而非、悖论式的）”，但重点不是“怪异/反直觉”，而是“看起来都成立却互相冲突”。","词源来自希腊语：anti-（相对、对立）+ nomos（法律、规则）。因此它也可用于描述“规则与规则之间的冲突”。"]}
{"word":"antinomies","summary":{"en":"Antinomies are (often philosophical) contradictions between principles or laws that each seem valid.","zh":"Antinomies 指（常带哲学色彩的）原则或规律之间的二律背反：双方看似都成立却相互矛盾。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of antinomy) a pair of ideas, principles, or laws that seem to contradict each other, even though each appears reasonable or true.","zh":"（antinomy 的复数）两种看似相互矛盾的思想、原则或规律；两者似乎都合理或为真。"},"examples":[{"en":"The article explores the antinomies between personal freedom and public safety.","zh":"这篇文章探讨了个人自由与公共安全之间的二律背反。"},{"en":"In ethics, we often face antinomies when two important values clash.","zh":"在伦理学中，当两种重要价值发生冲突时，我们常会遇到二律背反。"}]},{"partOfSpeech":"n.","definition":{"en":"In philosophy (especially in Immanuel Kant’s work), contradictions produced by pure reason when it goes beyond possible experience.","zh":"（哲学义，尤指康德）纯粹理性在超出经验可能范围时所产生的自相矛盾（理性悖论）。"},"examples":[{"en":"Kant argued that some classic metaphysical questions lead to antinomies.","zh":"康德认为，一些经典的形而上学问题会导致二律背反。"},{"en":"The lecture introduced four famous antinomies about the universe and causality.","zh":"讲座介绍了四个著名的二律背反，涉及宇宙与因果性。"}]}],"synonyms":["contradictions","paradoxes","inconsistencies","conflicts","dilemmas"],"phonetic":"/ænˈtɪnəˌmi/","extraExplanation":["“Antinomies”来自希腊语：anti-（相对、反对）+ nomos（法律、规则）。因此它常用来表达“规则对规则”的冲突，不只是普通的“矛盾”。","在日常写作中，若只是一般意义的“矛盾/冲突”，也常用更常见的词：contradictions, conflicts, paradoxes。使用“antinomy/antinomies”会显得更学术、哲学化。","“antinomies”是复数；单数是“antinomy”。"]}
{"word":"antinomist","summary":{"en":"An antinomist is someone who rejects the idea that moral or religious law must be obeyed, especially in discussions about salvation and faith.","zh":"antinomist 指反律法主义者，认为道德或宗教律法并非必须遵守，常用于讨论信仰与得救等议题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who believes that moral rules or religious law are not necessary for salvation (often used in Christian religious discussions); someone who rejects strict obedience to moral law","zh":"反律法主义者；认为得救不必遵守道德或宗教律法（常见于基督教语境）的人；反对严格遵守道德律法的人"},"examples":[{"en":"Some critics called the group antinomists because they taught that faith matters more than following rules.","zh":"一些批评者称这个团体为反律法主义者，因为他们教导“信心比守规矩更重要”。"},{"en":"In the debate, he was accused of being an antinomist who ignored traditional moral teaching.","zh":"在辩论中，他被指责为反律法主义者，忽视传统的道德教导。"}]}],"synonyms":["antinomian","law-rejecter","against moral law"],"phonetic":"/ænˈtɪnəˌmɪst/","extraExplanation":["“antinomist”与更常见的“antinomian”同源，来自希腊语：anti-（反对）+ nomos（法律/律法）。在英语中，它多用于神学与教会史讨论，也常带有批评意味。","在基督教历史中，“反律法主义（antinomianism）”常指一种争论：强调“因信称义/恩典”是否会被误解为“行为和道德律法不再重要”。17世纪新英格兰清教徒社会曾围绕此问题发生著名争论（如安妮·哈钦森相关事件）。","日常英语里更常用的近义表达是“rejecting moral rules / against strict moral laws”。如果要描述一般意义上的“无视法律”，通常用“lawless”或“outlaw”，而不太用“antinomist”。"]}
{"word":"antinomy","summary":{"en":"Antinomy means a strong contradiction between two principles or ideas that both seem valid but cannot both be true (often used in philosophy and formal writing).","zh":"Antinomy 指两种原则或观念之间的强烈对立：双方看似都成立，却无法同时为真（常见于哲学与较正式的写作）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A contradiction between two beliefs, principles, or rules that seem equally reasonable but cannot both be true at the same time.","zh":"（两种看似同样合理却不能同时成立的）对立、矛盾；二律背反。"},"examples":[{"en":"There is an antinomy between freedom and security in public policy debates.","zh":"在公共政策辩论中，自由与安全之间常存在一种二律背反。"},{"en":"The novel explores the antinomy between love and duty.","zh":"这部小说探讨了爱情与责任之间的对立。"}]},{"partOfSpeech":"n.","definition":{"en":"(Philosophy, especially Kant) A pair of arguments that lead to opposite conclusions, showing a deep tension in reason when thinking about the world as a whole.","zh":"（哲学，尤指康德）二律背反：两套推理各自看似成立，却得出相反结论，显示理性在整体性问题上出现根本张力。"},"examples":[{"en":"Kant described the antinomy of whether the universe has a beginning in time or is eternal.","zh":"康德提出了宇宙在时间上是否有开端、还是永恒存在的二律背反。"},{"en":"Students discussed how an antinomy can reveal limits of human reasoning.","zh":"学生们讨论了二律背反如何揭示人类理性的边界。"}]},{"partOfSpeech":"n.","definition":{"en":"(Law) A conflict between two legal rules or principles that apply to the same situation.","zh":"（法律）法律规范冲突：两条法律规则或原则对同一情形同时适用却彼此抵触。"},"examples":[{"en":"The court had to resolve an antinomy between privacy rights and public access laws.","zh":"法院必须解决隐私权与公众获取信息法律之间的冲突。"}]}],"synonyms":["contradiction","paradox","inconsistency","conflict","opposition"],"phonetic":"/ænˈtɪnəmi/","extraExplanation":["词源：来自希腊语 anti-（“相对、反对”）+ nomos（“法律、规范”），字面含义接近“对立的规范/法则”。","在日常英语中，antinomy 多用于书面或学术语境，强调“两边都讲得通却无法兼得”的结构性矛盾；比 contradiction 更强调“双方都有道理”。","常见搭配：the antinomy between A and B；resolve an antinomy；pose/present an antinomy。"]}
{"word":"antinoness","summary":{"en":"A very rare, literary word meaning “Antinous-like behavior or qualities,” often implying arrogant or predatory conduct.","zh":"一个非常罕见的文学用词，表示“安提诺式的行为或特质”，常暗含傲慢、蛮横或带侵略性的意味。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Very rare) The quality or state of being like Antinous—especially suggesting arrogant, spoiled, or predatory behavior (a literary allusion to Antinous in Homer’s *Odyssey*).","zh":"（非常罕见）“像安提诺俄斯（Antinous）那样的特质/状态”，常带有傲慢、骄纵或带侵略性的含义（源自荷马《奥德赛》中安提诺俄斯这一人物的典故）。"},"examples":[{"en":"Some critics describe the suitor’s cruelty as a kind of “antinoness.”","zh":"有些评论家把那位求婚者的残酷描述为一种“antinoness（安提诺式的特质）”。"},{"en":"The novel contrasts the hero’s restraint with the antinoness of the bullies around him.","zh":"小说把主角的克制与周围霸凌者的“antinoness（安提诺式的蛮横）”形成对照。"}]}],"synonyms":["arrogance","cruelty","predation","boorishness","entitlement"],"phonetic":"ˈæn.tɪ.noʊ.nəs","extraExplanation":["“antinoness”并不是常见英语词，更像是作者临时造词（nonce word）或拼写变体，用来指涉《奥德赛》里最嚣张、最无礼的求婚者之一 Antinous（安提诺俄斯）。在阅读中如果遇到它，通常需要结合上下文理解为“安提诺式的傲慢/恶意”。","如果你原本想查的是 **Antinous**（专有名词），它在文学与古典学讨论中更常见；也可能是把 **Antinous** 拼成了 *antinoness*。"]}
{"word":"antinormal","summary":{"en":"Antinormal means “against what’s normal,” and it can also be a technical term in science/math contexts.","zh":"Antinormal 表示“反常的/与正常相对的”，也可能在科学或数学语境中作为专业术语使用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to what is considered normal, typical, or standard.","zh":"反常的；与通常、典型或标准相对的。"},"examples":[{"en":"His antinormal sleep schedule made it hard to keep a regular job.","zh":"他反常的作息让他很难维持一份规律的工作。"},{"en":"The film celebrates antinormal characters who don’t fit social expectations.","zh":"这部电影赞美那些不符合社会期待的“反常”角色。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Technical) Related to an “antinormal” direction or ordering in some scientific fields (used in specialized contexts).","zh":"（专业）在某些科学领域中指“反法线/反常序”等概念（用于特定学科语境）。"},"examples":[{"en":"In this paper, the authors compare normal and antinormal ordering.","zh":"在这篇论文中，作者比较了常序与反常序。"},{"en":"The vector points in the antinormal direction relative to the surface.","zh":"该向量相对于曲面指向反法线方向。"}]}],"synonyms":["abnormal","atypical","unconventional","nonstandard","irregular"],"phonetic":"/ˌæntiˈnɔrməl/","extraExplanation":["“antinormal”不是日常高频词。普通英语里更常用的表达是“abnormal”（异常的）或“unconventional”（非传统的）。\n\n在学术写作中，“antinormal”往往带有明确的学科含义（例如物理/数学里的“ordering（序）”或几何中的“normal（法线）”相关概念），所以如果你是在论文里看到它，最好结合上下文或定义来理解。"]}
{"word":"antinormality","summary":{"en":"Antinormality means opposition to what is considered normal, or (less commonly) the state of being non-normal.","zh":"Antinormality 指对“正常/常规”的反对，或（较少见）非正常的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to what is considered normal or typical; the idea or attitude that rejects “normality.”","zh":"反常态；对“正常/常规”的反对或拒斥的观念（或态度）。"},"examples":[{"en":"The artist’s work celebrates antinormality by challenging everyday ideas of beauty.","zh":"这位艺术家的作品通过挑战日常的审美观来赞美反常态。"},{"en":"In that subculture, antinormality is seen as a form of freedom.","zh":"在那个亚文化中，反常态被视为一种自由。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common, specialized) The quality of being abnormal or nonstandard; non-normality.","zh":"（较少见/较专门）非正常性；非标准性。"},"examples":[{"en":"The report noted antinormality in the data and suggested checking the sensors.","zh":"报告指出数据存在非正常性，并建议检查传感器。"},{"en":"Researchers measured antinormality to detect unusual patterns.","zh":"研究人员通过测量非正常性来发现异常模式。"}]}],"synonyms":["abnormality","nonconformity","deviation","atypicality"],"phonetic":"/ˌæn.ti.nɔrˈmæl.ə.ti/","extraExplanation":["“antinormality”不是高频词，更常见的表达是“abnormality（异常/反常）”“nonconformity（不从众）”或“deviation from the norm（偏离常态）”。","构词上由前缀 anti-（反对）+ normality（正常状态）组成，常用于文化批评、艺术评论或讨论“反常规/反主流”的立场。"]}
{"word":"antinormalness","summary":{"en":"Antinormalness means being against what is considered normal; deliberate nonconformity (informal, uncommon).","zh":"Antinormalness 指反“正常”的状态或特质，即刻意不从众（非正式且不常见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon, informal) The quality or state of being against what is considered normal; deliberate nonconformity or rejection of typical standards.","zh":"（不常见、非正式）反“正常”的状态或特质；刻意不随大流、拒绝常规标准的倾向。"},"examples":[{"en":"His antinormalness showed in the way he dressed and spoke, refusing to follow trends.","zh":"他的“反正常”表现在穿着和说话方式上——他拒绝追随潮流。"},{"en":"The film celebrates antinormalness, making outsiders the heroes.","zh":"这部电影赞颂“反正常”，让边缘人物成为英雄。"}]}],"synonyms":["nonconformity","unconventionality","rebelliousness","contrariness","outsider mindset"],"phonetic":"/ˌæn.tiˈnɔr.məl.nəs/","extraExplanation":["“antinormalness”多见于口语或网络自造词，并不是常用标准词汇。更常见的表达有 nonconformity（不从众）、unconventionality（非传统）、anti-establishment attitude（反体制态度）、going against the norm（违背常规）。","构词法：anti-（反对）+ normal（正常）+ -ness（名词后缀，表示“……的状态/性质”）。因此它强调“反常规的性质/状态”。","使用建议：在正式写作中，通常避免使用该词；若想保留“刻意反常”的语气，可用 deliberately unconventional / intentionally nonconforming 等更自然的表达。"]}
{"word":"Antinos","summary":{"en":"Antinos usually refers to Antinous, the leading and most arrogant suitor in Homer’s *Odyssey*.","zh":"Antinos 通常指 Antinous（安提诺俄斯），荷马《奥德赛》中最傲慢、带头作乱的求婚者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A character in Homer’s *Odyssey*: the most arrogant and leading suitor who tries to marry Penelope while Odysseus is away.","zh":"（专有名词）荷马史诗《奥德赛》中的人物：最傲慢、最具带头作用的求婚者之一，趁奥德修斯离家期间企图娶佩涅洛佩。"},"examples":[{"en":"In *The Odyssey*, Antinous is the boldest of Penelope’s suitors.","zh":"在《奥德赛》中，Antinous 是佩涅洛佩的求婚者里最嚣张的一个。"},{"en":"Odysseus punishes Antinous for his cruelty and disrespect.","zh":"奥德修斯因 Antinous 的残忍与无礼而惩罚了他。"}]},{"partOfSpeech":"other","definition":{"en":"Less commonly, a spelling variation or mistaken form of “Antinous.”","zh":"较少见：可能是 “Antinous” 的拼写变体或误写形式。"},"examples":[{"en":"You may see “Antinos” online, but the standard English spelling is “Antinous.”","zh":"你可能在网上看到 “Antinos”，但标准英文拼写是 “Antinous”。"}]}],"synonyms":["Antinous"],"phonetic":"/ænˈtɪn.oʊ.əs/","extraExplanation":["“Antinous（安提诺俄斯）”是古希腊文学中典型的“傲慢之人（hubris）”形象：他不仅觊觎主人的妻子，还浪费主人家产、羞辱他人，因此常被用来象征无礼与自大。","文学提示：在《奥德赛》中，他的结局也强化了史诗的主题之一——对客人礼仪（xenia，待客之道）的破坏会招致严重后果。"]}
{"word":"antinosarian","summary":{"en":"“antinosarian” is a very rare/nonstandard word meaning “related to Antinous” or “an admirer of Antinous.”","zh":"“antinosarian”非常罕见且不算标准用语，通常可理解为“与安提诺乌斯有关的”或“安提诺乌斯的崇拜者/爱好者”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Very rare / nonstandard) Relating to Antinous (a famous youth in ancient Rome) or to admiration for him; sometimes used as if meaning “a follower/admirer of Antinous.”","zh":"（非常罕见／非标准用法）与安提诺乌斯（古罗马著名青年）有关的；也偶尔被当作“安提诺乌斯的崇拜者／追随者”来用。"},"examples":[{"en":"The essay uses an antinosarian tone, treating Antinous as an ideal of beauty.","zh":"这篇文章带有一种“antinosarian”的语气，把安提诺乌斯当作美的理想来描写。"},{"en":"In a few niche art circles, “antinosarian” appears as a label for Antinous-inspired imagery.","zh":"在一些小众艺术圈里，“antinosarian”会被用作“受安提诺乌斯启发的图像”的标签。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare / nonstandard) A person who strongly admires Antinous or collects/creates Antinous-related art.","zh":"（非常罕见／非标准用法）特别崇拜安提诺乌斯的人；或收藏／创作与安提诺乌斯相关艺术的人。"},"examples":[{"en":"He called himself an antinosarian, but the term isn’t common in English.","zh":"他自称是“antinosarian”，但这个词在英语里并不常见。"}]}],"synonyms":["Antinoan","Antinous-related","of/relating to Antinous"],"phonetic":"/ˌæn.taɪ.noʊˈsɛr.i.ən/","extraExplanation":["“antinosarian”不是英语里的常见标准词，更多像是个人造词或拼写变体。你可能想找的是 **Antinoan**（与安提诺乌斯相关的）或更直接的 **of/relating to Antinous**。","安提诺乌斯（Antinous）是罗马皇帝哈德良（Hadrian）宠爱的青年，死后被神格化并引发广泛的艺术与崇拜传统；因此在艺术史、古典研究或文学评论中，偶尔会出现围绕他形象的形容词用法。","如果你是在某段文本中看到这个词，发我原句我可以帮你判断它是否为拼写错误，或作者想表达的具体含义。"]}
{"word":"Antinous","summary":{"en":"Antinous is a mythological figure from Homer’s *Odyssey*, best known as the arrogant leader of Penelope’s suitors.","zh":"Antinous 是荷马《奥德赛》中的神话人物，以“佩涅洛佩求婚者的傲慢首领”而闻名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A character in Homer’s epic poem *The Odyssey*: the arrogant leader of the suitors who court Penelope (Odysseus’s wife) while Odysseus is away.","zh":"荷马史诗《奥德赛》中的人物：求婚者（追求奥德修斯之妻佩涅洛佩的人们）的首领，性格傲慢无礼。"},"examples":[{"en":"In *The Odyssey*, Antinous is the most disrespectful of the suitors.","zh":"在《奥德赛》中，Antinous 是求婚者里最无礼的一个。"},{"en":"Odysseus punishes Antinous first for his cruelty and arrogance.","zh":"奥德修斯因为 Antinous 的残忍与傲慢而首先惩罚他。"}]}],"synonyms":["(no direct synonym; related: suitor, usurper)"],"phonetic":"/ænˈtɪnoʊəs/","extraExplanation":["Antinous（安提诺俄斯）常被用作“傲慢的篡夺者/寄生者”的文学象征：他占用他人家产、蔑视主人、带头作恶，因此在故事结局中也最先遭到清算。","在英语文学与艺术评论中，提到 Antinous 往往是在借《奥德赛》的背景来影射“无礼的追求者”“不请自来的侵占者”这类角色类型。"]}
{"word":"antinous","summary":{"en":"Antinous is a proper name best known as (1) Penelope’s most arrogant suitor in Homer’s *Odyssey*, and (2) Hadrian’s beloved companion in Roman history and art.","zh":"Antinous 是专有名词，最常见的两种含义是：①《奥德赛》中珀涅罗珀最傲慢的求婚者；②罗马皇帝哈德良的伴侣安提诺乌斯（历史与艺术中常见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Greek mythology) The leading suitor of Penelope in Homer’s *Odyssey*, known for arrogance and cruelty toward Odysseus’s household.","zh":"（希腊神话）荷马《奥德赛》中珀涅罗珀（Penelope）的首席求婚者，以傲慢、残酷、欺压奥德修斯家族而著称。"},"examples":[{"en":"In the *Odyssey*, Antinous insults the disguised Odysseus and urges the suitors to drive him away.","zh":"在《奥德赛》中，安提诺俄斯侮辱伪装的奥德修斯，并怂恿求婚者把他赶走。"},{"en":"Antinous becomes a symbol of abusive power in many modern retellings of the epic.","zh":"在许多现代改写的史诗版本里，安提诺俄斯常被当作滥用权力的象征。"}]},{"partOfSpeech":"n.","definition":{"en":"A historical figure: Antinous (c. 110–130 CE), the beloved companion of the Roman emperor Hadrian, later honored and widely depicted in ancient art.","zh":"（历史人物）安提诺乌斯（约公元110–130年），罗马皇帝哈德良（Hadrian）的宠爱伴侣，死后被隆重纪念并在古代艺术中大量塑造。"},"examples":[{"en":"Museums often display statues of Antinous because his image was reproduced throughout the Roman Empire.","zh":"博物馆常展出安提诺乌斯的雕像，因为他的形象在罗马帝国各地被大量复制。"},{"en":"Some novels use Antinous to explore love, loss, and the politics of empire.","zh":"一些小说借安提诺乌斯来探讨爱情、失去，以及帝国政治。"}]}],"synonyms":["(Odyssey) suitor","(Roman history) Hadrian’s companion"],"phonetic":"/ænˈtɪn.oʊ.əs/","extraExplanation":["“Antinous”在英语里多指专有名词，所以通常要大写：Antinous。若看到小写 antinous，多半是拼写/大小写不规范，或在极少数语境中作为“像安提诺俄斯那样的（傲慢、放纵的）”的修辞用法。","文学语境里最常见的指代是《奥德赛》的求婚者领袖；艺术史语境里则常指哈德良的伴侣安提诺乌斯，尤其在谈论古罗马雕塑、神化与纪念文化时。"]}
{"word":"Antinous-related","summary":{"en":"Antinous-related means “connected with Antinous,” especially in contexts like classical history, art, or literature.","zh":"Antinous-related 指“与安提诺乌斯有关的”，常见于古典历史、艺术或文学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with Antinous (a specific person or character named Antinous), such as his life, story, images, or influence","zh":"与“安提诺乌斯”（名为 Antinous 的特定人物或角色）有关的；涉及其生平、故事、形象或影响的"},"examples":[{"en":"The museum displayed Antinous-related sculptures from the Roman period.","zh":"博物馆展出了罗马时期与安提诺乌斯有关的雕塑。"},{"en":"Her essay focuses on Antinous-related themes in imperial art.","zh":"她的文章聚焦于帝国艺术中与安提诺乌斯相关的主题。"}]}],"synonyms":["Antinous-associated","connected to Antinous","pertaining to Antinous"],"phonetic":"/ænˈtaɪnəs rɪˈleɪtɪd/","extraExplanation":["“Antinous”最常见的文化指向有两条：\n1) 罗马皇帝哈德良（Hadrian）的宠爱者安提诺乌斯（约公元111–130年）。他去世后被神化，留下大量雕像与钱币形象，因此在艺术史/古典学里常见“Antinous-related imagery / cult / statues（相关形象/崇拜/雕像）”。\n2) 荷马史诗《奥德赛》中求婚者之一 Antinous（常译“安提诺俄斯/安提诺乌斯”），是最傲慢、最具敌意的求婚者之一；文学研究里也可能出现“Antinous-related passages（相关段落）”。\n阅读时可根据语境判断指的是哪一位。","写法提示：英文里常用连字符构成形容词（Antinous-related），放在名词前作定语；也可用“related to Antinous”作后置说明。"]}
{"word":"antinovel","summary":{"en":"An experimental novel that intentionally rejects traditional plot and character-driven storytelling.","zh":"一种刻意拒绝传统情节与人物叙事的实验性小说（反小说）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of experimental novel that deliberately breaks or rejects traditional storytelling (for example, clear plot, stable characters, or a realistic style).","zh":"一种实验性小说，刻意打破或拒绝传统叙事方式（如明确情节、固定人物形象或写实风格）。"},"examples":[{"en":"The book is often described as an antinovel because it has almost no plot and focuses on fragmented thoughts.","zh":"这本书常被称为“反小说”，因为它几乎没有情节，而是关注碎片化的思绪。"},{"en":"In class we compared a classic realist novel with an antinovel to see how each shapes the reader’s experience.","zh":"课堂上我们把一部经典现实主义小说和一部反小说进行对比，看看它们如何塑造读者体验。"}]}],"synonyms":["experimental novel","metafiction (overlapping)","anti-romance (historical/related)"],"phonetic":"/ˌæn.tiˈnɑ.vəl/","extraExplanation":["“antinovel”常用于文学批评语境，强调一种“反传统小说”的写作策略：不以讲故事为中心，而更关注语言、结构、意识流、视角的不稳定等。","它常与20世纪的实验文学联系在一起，例如法国“新小说”（Nouveau Roman）的一些作品常被读者或评论者视为接近“反小说”的写法。","这个词带有评价色彩：有时是中性描述（指出形式实验），有时含批评意味（认为作品“不像小说”）。理解时要看上下文。"]}
{"word":"antinovelist","summary":{"en":"An antinovelist is a writer who intentionally breaks traditional novel conventions.","zh":"antinovelist 指有意打破传统小说写作惯例、创作“反小说”的作家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a writer who creates an anti-novel—fiction that deliberately breaks traditional novel rules (such as a clear plot, realistic characters, or a tidy ending).","zh":"反小说作家；创作“反小说”的作者——故意打破传统小说规则（如清晰情节、写实人物或完整结局）的小说写作者。"},"examples":[{"en":"Some antinovelists focus more on language and structure than on plot.","zh":"一些反小说作家更关注语言和结构，而不是情节。"},{"en":"In class we compared a classic realist novel with an antinovelist’s fragmented narrative.","zh":"课堂上我们把一部经典现实主义小说与一位反小说作家的碎片化叙事作了比较。"}]}],"synonyms":["anti-novelist","experimental novelist","avant-garde novelist","postmodern novelist"],"phonetic":"/ˌæn.tiˈnɑv.əl.ɪst/","extraExplanation":["“anti-”在这里不是“反对写小说”，而是“反传统小说形式”。反小说常见做法包括：弱化情节推进、人物不再像“真实的人”、大量内心片段/重复/断裂结构、让读者意识到“这是被写出来的文本”。","英语里更常见的说法是 anti-novelist（常带连字符）或 experimental novelist（实验小说家）。在法语文学语境中常会联系到 nouveau roman（“新小说”）的一些作家与观念。"]}
{"word":"antinovels","summary":{"en":"Antinovels are experimental novels that reject traditional storytelling rules.","zh":"Antinovels（反小说）是打破传统叙事规则的实验性小说。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"experimental novels that deliberately break or reject traditional novel conventions (such as a clear plot, stable narrator, or realistic character development).","zh":"反小说；一种故意打破或拒绝传统小说写作规范（如清晰情节、稳定叙述者、写实人物塑造等）的实验性小说。"},"examples":[{"en":"The course compared modernist fiction with antinovels that avoid conventional plot structure.","zh":"这门课把现代主义小说与避免传统情节结构的反小说作了比较。"},{"en":"Some antinovels focus more on language and form than on telling a straightforward story.","zh":"有些反小说更强调语言和形式，而不是讲一个直白的故事。"}]}],"synonyms":["anti-novels","experimental novels","metafiction (overlapping)","avant-garde fiction"],"phonetic":"/ˌæn.taɪˈnɑv.əlz/","extraExplanation":["“anti-novel（反小说）”常用于文学批评语境，指对“小说应该怎么写”的传统期待提出挑战的作品。它并不一定“反对阅读”，而是通过打碎情节、削弱人物心理、改变叙述角度等方式，让读者注意到写作本身的结构与语言。","这个概念常与20世纪法国的“新小说（Nouveau Roman）”一起被提到，例如阿兰·罗伯-格里耶（Alain Robbe-Grillet）等作家的作品常被视为反小说式的实验。"]}
{"word":"antinuclear","summary":{"en":"Antinuclear means opposing nuclear weapons, nuclear power, or nuclear policies.","zh":"Antinuclear 指反对核武器、核能或核相关政策。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to nuclear weapons, nuclear power, or nuclear policies; against nuclear development or use.","zh":"反核的；反对核武器、核能或核政策的；反对核发展或使用的。"},"examples":[{"en":"Many antinuclear activists protested against building a new nuclear power plant.","zh":"许多反核活动人士抗议建设新的核电站。"},{"en":"The group took an antinuclear stance after the accident.","zh":"事故发生后，这个团体采取了反核立场。"},{"en":"She joined an antinuclear campaign calling for disarmament.","zh":"她加入了呼吁裁军的反核运动。"}]}],"synonyms":["anti-nuclear","nuclear-free (context-dependent)","anti-atomic (less common)"],"phonetic":"/ˌæn.tiˈnuː.kli.ɚ/","extraExplanation":["“anti-”表示“反对/抵制”，加在名词或形容词前构成新词，如 antiwar（反战）、antismoking（反吸烟）。","“antinuclear”在新闻与社会议题中常见，可能指“反核武器”（disarmament/denuclearization）或“反核能发电”（nuclear power）。具体含义通常由上下文决定。"]}
{"word":"antinucleon","summary":{"en":"An antinucleon is the antiparticle of a proton or neutron (a nucleon).","zh":"反核子是质子或中子（核子）的反粒子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In particle physics, the antiparticle of a nucleon (a proton or neutron). An antinucleon has the same mass as a nucleon but opposite electric charge (for antiprotons) and opposite quantum numbers (such as baryon number).","zh":"（粒子物理）核子（质子或中子）的反粒子。反核子与核子质量相同，但电荷（如反质子）及一些量子数（如重子数）相反。"},"examples":[{"en":"An antinucleon can annihilate with a nucleon and produce energy and other particles.","zh":"反核子可以与核子发生湮灭，产生能量和其他粒子。"},{"en":"In experiments, scientists study antinucleons to learn more about matter–antimatter symmetry.","zh":"在实验中，科学家研究反核子，以了解更多关于物质—反物质对称性的信息。"}]}],"synonyms":["anti-proton (specific)","anti-neutron (specific)","antibaryon (broader)"],"phonetic":"/ˌæn.tiˈnuː.kli.ɑn/","extraExplanation":["“antinucleon”通常指两种粒子之一：反质子（antiproton）或反中子（antineutron）。它们都属于“反重子（antibaryons）”，重子数为 −1。","在高能物理里，反核子常由粒子加速器的碰撞产生；在日常环境中极其罕见，因为一旦遇到普通物质就会很快湮灭。","词形结构：anti-（反、对立）+ nucleon（核子）。在科普与学术写作中，这个词多用于讨论反物质、宇宙学、以及对称性（如CP对称性）等话题。"]}
{"word":"antinucleons","summary":{"en":"Antinucleons are antimatter versions of protons and neutrons (e.g., antiprotons and antineutrons).","zh":"反核子是质子和中子的反物质对应粒子（如反质子、反中子）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Particles of antimatter that correspond to nucleons (protons and neutrons), such as antiprotons and antineutrons.","zh":"与核子（质子和中子）对应的反物质粒子，例如反质子和反中子。"},"examples":[{"en":"In high-energy collisions, antinucleons can be produced together with other antiparticles.","zh":"在高能碰撞中，可能会产生反核子以及其他反粒子。"},{"en":"Scientists study antinucleons to better understand how matter and antimatter behave.","zh":"科学家研究反核子，以更好理解物质与反物质的行为。"}]}],"synonyms":["antiprotons and antineutrons","antimatter nucleons"],"phonetic":"/ˌæn.tiˈnuː.kliː.ənz/","extraExplanation":["“antinucleons”是复数形式；单数是“antinucleon”。常见的两种反核子是反质子（antiproton）和反中子（antineutron）。","反核子属于“反物质（antimatter）”的一部分：它们与普通核子的质量相同，但电荷等量相反（例如反质子带负电）。当反核子与对应的核子相遇时，可能发生湮灭（annihilation），释放能量。","这个词多用于粒子物理、核物理与宇宙线研究等语境，在日常英语中不常见。"]}
{"word":"antinuke","summary":{"en":"“Antinuke/anti-nuke” means opposed to nuclear weapons or nuclear power, or a person who holds that view.","zh":"“antinuke/anti-nuke”指反对核武器或核能的（人/立场）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to nuclear weapons or nuclear power; supporting policies that reduce or eliminate nuclear technology (especially weapons).","zh":"反核的；反对核武器或核能（尤指反对核武）。"},"examples":[{"en":"She joined an anti-nuke protest after the nuclear plant accident.","zh":"核电站事故之后，她参加了反核抗议活动。"},{"en":"The senator took an anti-nuke position and pushed for arms reduction.","zh":"这位参议员采取反核立场，推动削减核武。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or group that is opposed to nuclear weapons or nuclear power.","zh":"反核人士；反核团体。"},"examples":[{"en":"Local anti-nukes organized a town hall meeting about safety and energy policy.","zh":"当地反核人士组织了一场关于安全与能源政策的市政厅会议。"},{"en":"In the 1980s, many anti-nukes marched for nuclear disarmament.","zh":"在20世纪80年代，许多反核人士为核裁军而游行。"}]}],"synonyms":["anti-nuclear","anti-nuclear power","anti-nuclear weapons","nuclear disarmament (related)"],"phonetic":"/ˌæn.tiˈnuk/","extraExplanation":["“anti-nuke”更常见的写法是带连字符（anti-nuke），也可写作antinueke/antinuke（较口语、较非正式）。在正式写作中更推荐用“anti-nuclear”（反核的）或更具体地说“anti-nuclear power / anti-nuclear weapons”。","“nuke”本是口语缩写，来自“nuclear”（核的）。因此“anti-nuke”带有更强的口语和媒体表达色彩，常见于新闻标题、社交媒体或政治讨论。"]}

