{"word":"antitabetic","summary":{"en":"Antitabetic is a rare/nonstandard form meaning “antidiabetic” (for treating or preventing diabetes).","zh":"antitabetic 是少见且不规范的写法，通常指 antidiabetic（抗糖尿病的；用于治疗/预防糖尿病）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard/rare) relating to preventing or treating diabetes; usually written as **antidiabetic**.","zh":"（不规范/少见）与预防或治疗糖尿病有关的；通常写作 **antidiabetic（抗糖尿病的）**。"},"examples":[{"en":"Metformin is a commonly prescribed antidiabetic drug.","zh":"二甲双胍是一种常用的抗糖尿病药物。"},{"en":"The study tested antidiabetic effects in mice with high blood sugar.","zh":"该研究在高血糖小鼠身上测试了抗糖尿病效果。"}]}],"synonyms":["antidiabetic","hypoglycemic (drug)"],"phonetic":"ˌæn.ti.daɪ.əˈbɛt.ɪk","extraExplanation":["“antitabetic”在现代英语里非常少见，多数情况下是把 **antidiabetic** 拼错了。医学与药学语境中，标准用法是 **antidiabetic**（抗糖尿病的）。","另外，英语里有 **tabetic**（与脊髓痨 tabes dorsalis 相关的）这个词；理论上“anti-tabetic”可理解为“对抗脊髓痨的”，但这种用法极罕见，几乎不会在常见医学写作中看到。若你是在药物/降血糖的语境里遇到它，基本可按 **antidiabetic** 理解。"]}
{"word":"antitabloid","summary":{"en":"“Antitabloid” describes someone or something that rejects tabloid media and sensational, gossip-driven journalism.","zh":"“antitabloid”指反对小报媒体及其耸动、八卦化新闻风格的（也可指这种立场的人/团体）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to tabloids or tabloid-style journalism (sensational, gossip-focused reporting).","zh":"反对小报或反对“小报式”新闻（耸动、八卦导向的报道）的。"},"examples":[{"en":"The editor took an antitabloid approach and refused to publish celebrity rumors.","zh":"这位编辑采取了反小报的做法，拒绝刊登名人谣言。"},{"en":"Their antitabloid campaign called for more fact-checking and fewer clickbait headlines.","zh":"他们的反小报运动呼吁加强事实核查，减少标题党。"}]},{"partOfSpeech":"n.","definition":{"en":"a person, group, or stance that strongly rejects tabloid media or tabloid tactics.","zh":"强烈反对小报媒体或反对小报手法的人／团体／立场。"},"examples":[{"en":"As an antitabloid, she criticized outlets that profit from humiliation.","zh":"作为反小报派，她批评那些靠羞辱他人获利的媒体。"},{"en":"Antitabloids argue that privacy should matter more than entertainment value.","zh":"反小报派认为，隐私应比娱乐性更重要。"}]}],"synonyms":["anti-tabloid","anti-sensationalist","anti-gossip","against tabloid journalism"],"phonetic":"/ˌæn.taɪˈtæb.lɔɪd/","extraExplanation":["“antitabloid”并不是非常常见的词，更常见的写法是加连字符的 **anti-tabloid**。它常用于媒体评论语境，指反对“耸动化、八卦化、标题党”的新闻风格，而不一定只是反对某一种报纸。"]}
{"word":"antitangent","summary":{"en":"Antitangent most commonly means an internal common tangent line to two circles; in older trigonometry it can mean “cotangent.”","zh":"Antitangent 最常指两圆的内公切线；在较旧的三角学用法中也可指“余切（cotangent）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Geometry) A common tangent line that touches two circles (or similar curves) and crosses the line joining their centers; an internal common tangent.","zh":"（几何）同时与两个圆（或类似曲线）相切并且与两圆心连线相交的公切线；内公切线。"},"examples":[{"en":"The diagram shows two circles with an antitangent drawn between them.","zh":"图中画出了两个圆，并在它们之间画了一条内公切线（antitangent）。"},{"en":"An antitangent meets both circles at exactly one point each, without cutting through either circle.","zh":"内公切线分别在两个圆上各接触一个点，并不会切穿圆。"}]},{"partOfSpeech":"n.","definition":{"en":"(Trigonometry, old-fashioned) The cotangent of an angle.","zh":"（三角学，旧式用法）余切（cotangent）。"},"examples":[{"en":"In some older textbooks, “antitangent” is used where modern books say “cotangent.”","zh":"在一些较老的教材里，“antitangent”用来表示现代教材中的“cotangent（余切）”。"},{"en":"The antitangent of θ equals 1 divided by the tangent of θ.","zh":"θ 的“antitangent”（余切）等于 1 除以 θ 的正切。"}]}],"synonyms":["internal common tangent","cotangent (old use)"],"phonetic":"/ˌæn.tiˈtæn.dʒənt/","extraExplanation":["“antitangent”在现代英语数学语境里不算常用词：几何里偶尔用来指“两圆的内公切线”；三角学里则多见于旧书，表示“cotangent（余切）”。","注意不要和“arctangent（反正切，tan 的反函数）”混淆：arctangent 是 inverse tangent，而 antitangent 不是。"]}
{"word":"antitank","summary":{"en":"Antitank means ‘against tanks’ and refers to weapons or equipment used to destroy or stop tanks.","zh":"Antitank 指“反坦克的/用于对付坦克的”，也可指反坦克武器本身。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to stop, damage, or destroy tanks (armored fighting vehicles).","zh":"用于对付坦克（装甲战斗车辆）的；反坦克的。"},"examples":[{"en":"The soldiers carried antitank weapons to defend the bridge.","zh":"士兵携带反坦克武器来防守这座桥。"},{"en":"An antitank missile can disable a tank from a long distance.","zh":"反坦克导弹可以在远距离瘫痪坦克。"}]},{"partOfSpeech":"n.","definition":{"en":"An antitank weapon, such as a missile, rocket, mine, or gun.","zh":"反坦克武器（如导弹、火箭、地雷或火炮）。"},"examples":[{"en":"The unit set up an antitank near the road.","zh":"该部队在道路附近架设了一件反坦克武器。"},{"en":"They trained on how to use antitank safely and effectively.","zh":"他们训练如何安全且有效地使用反坦克武器。"}]}],"synonyms":["anti-armor","tank-killing","antitank weapon"],"phonetic":"/ˌæn.tiˈtæŋk/","extraExplanation":["英语里更常见的写法是加连字符的 **anti-tank**（尤其作形容词时：anti-tank missile / anti-tank mine）。在新闻、军事报告或技术资料中两种拼写都能见到，但加连字符更规范、也更易读。"]}
{"word":"antitarnish","summary":{"en":"Antitarnish means preventing metal (especially silver) from becoming dull or dark, or a material/treatment that does this.","zh":"Antitarnish 指防止金属（尤指银器）变暗失光的，或指用于防变色的材料/处理。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to prevent tarnish (a dull or dark coating) from forming on metal, especially silver.","zh":"防止（金属，尤指银器）氧化变暗/失去光泽的；防变色的。"},"examples":[{"en":"The necklace comes in an antitarnish pouch to keep it shiny.","zh":"这条项链配有防变色袋，用来保持光亮。"},{"en":"Use antitarnish paper when storing silverware.","zh":"存放银餐具时可以用防变色纸。"}]},{"partOfSpeech":"n.","definition":{"en":"A material or treatment (such as paper, cloth, coating, or additive) used to prevent metals from tarnishing.","zh":"防变色材料/处理（如防变色纸、布、涂层或添加剂）。"},"examples":[{"en":"The jeweler added an antitarnish strip inside the box.","zh":"珠宝商在盒子里放了一条防变色条。"},{"en":"Some antitarnish coatings are made for copper and brass, too.","zh":"有些防变色涂层也适用于铜和黄铜。"}]}],"synonyms":["tarnish-resistant","anti-tarnish","non-tarnishing","protective"],"phonetic":"/ˌæntiˈtɑrnɪʃ/","extraExplanation":["“tarnish”指金属表面因与空气中的氧气、硫化物等反应而变暗（银常见变黑）。因此“antitarnish”常见于珠宝包装（防变色袋/纸/条）、金属保护涂层或清洁护理产品说明中。"]}
{"word":"antitarnishing","summary":{"en":"Antitarnishing describes something that helps prevent metal (especially silver) from becoming dull or discolored.","zh":"Antitarnishing 指能帮助防止金属（尤指银）变暗、失去光泽的东西或特性。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Preventing or reducing tarnish (a dull, dark coating that forms on some metals, especially silver).","zh":"防止或减轻（金属，尤指银）失去光泽、变暗（生成“氧化/硫化”薄层）的；防变色的。"},"examples":[{"en":"The jeweler used an antitarnishing cloth to polish the silver necklace.","zh":"珠宝商用防变色布来擦亮那条银项链。"},{"en":"Store your earrings in an antitarnishing bag to keep them shiny.","zh":"把耳环放在防变色袋里保存，能让它们保持光亮。"}]}],"synonyms":["anti-tarnish","tarnish-resistant","protective"],"phonetic":"/ˌæntiˈtɑrnɪʃɪŋ/","extraExplanation":["“Tarnish（失去光泽/变暗）”常见于银，因为银容易与空气中的含硫物质反应，表面形成暗色层；常见的 antitarnishing 方法包括：防变色纸/布、密封袋、干燥剂，以及在首饰表面做保护性镀层或涂层。","拼写上也常见作 **anti-tarnish / anti-tarnishing**（加连字符更常见）。"]}
{"word":"antitartaric","summary":{"en":"Antitartaric means “preventing tartar (hard deposits) from forming,” mainly in chemical or industrial contexts.","zh":"Antitartaric 指“防止酒石/硬质沉积物形成”，多用于化学或工业语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Preventing the formation of tartar (a hard deposit), especially in wine casks, pipes, or similar containers; anti-tartaric.","zh":"（化学）防止形成酒石/水垢样硬质沉积物的；抗酒石的。"},"examples":[{"en":"The winery treated some barrels with an antitartaric coating to reduce tartar buildup.","zh":"酒庄给部分橡木桶做了抗酒石涂层，以减少酒石沉积。"},{"en":"An antitartaric additive may be used during processing to limit crystal deposits.","zh":"加工过程中可能会使用抗酒石添加剂来减少结晶沉积。"}]}],"synonyms":["anti-tartar","antitartaric agent","tartar-inhibiting"],"phonetic":"/ˌæn.taɪ.tɑrˈtɛr.ɪk/","extraExplanation":["“antitartaric”是非常少见的专业词，主要见于旧式化学/工艺语境。这里的“tartaric”并不是“酸”的意思本身，而是与“tartar（酒石）”有关：酒石常与酒中的酒石酸盐结晶相关，也可泛指容器内壁形成的硬质沉积物。","更常见、更现代的表达通常是“anti-tartar”或“antitartaric agent/coating”（抗酒石剂/涂层）；在口腔护理语境中则常说“anti-tartar toothpaste（防牙垢牙膏）”。"]}
{"word":"antitax","summary":{"en":"Antitax means opposed to taxes or tax increases, and it can also refer to people or groups with that view.","zh":"Antitax 指反对税收或反对加税，也可指持这种立场的人或团体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to taxes or to raising taxes; showing resistance to taxation.","zh":"反对征税或反对加税的；对税收持抵制态度的。"},"examples":[{"en":"The governor ran on an antitax platform.","zh":"州长以反对加税的政纲参选。"},{"en":"Antitax groups protested the new sales tax.","zh":"反对税收的团体抗议新的销售税。"},{"en":"There is strong antitax sentiment among small business owners.","zh":"小企业主中有强烈的反税情绪。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or group that opposes taxes or tax increases.","zh":"反对税收（或加税）的人；反税团体。"},"examples":[{"en":"The antitaxes organized a petition drive.","zh":"反税人士发起了请愿活动。"},{"en":"She’s known as an antitax in local politics.","zh":"在地方政坛，她以反税立场而出名。"}]}],"synonyms":["anti-tax","tax-resistant","anti-taxation","anti-revenue"],"phonetic":"/ˌæntiˈtæks/","extraExplanation":["“antitax”常见写法也包括“anti-tax”（带连字符），在新闻与政治语境中更常见；作定语时尤其常见，如“anti-tax campaign / anti-tax activists”。","这是由前缀“anti-（反对）”+“tax（税）”构成的合成词，常用于讨论税制改革、预算、政府支出等公共议题。"]}
{"word":"antitaxation","summary":{"en":"“Anti-taxation” describes people, ideas, or actions that oppose taxes or taxation policies.","zh":"“anti-taxation”用来形容反对税收或反对征税政策的人、观点或行动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to taxes or to the policy of taxation; against raising or collecting taxes.","zh":"反对税收或反对征税政策的；反对加税或征税的。"},"examples":[{"en":"The candidate ran on an anti-taxation platform.","zh":"这位候选人以反对税收的政纲参选。"},{"en":"Some residents organized an anti-taxation protest after the property tax increase.","zh":"房产税上调后，一些居民组织了反对征税的抗议活动。"}]}],"synonyms":["anti-tax","tax-resistant","anti-revenue (less common)"],"phonetic":"/ˌæn.ti.tækˈseɪ.ʃən/","extraExplanation":["“anti-”是英语中表示“反对、抵制”的常见前缀（如 antiwar 反战、antismoking 反吸烟）。因此 anti-taxation 通常表示一种政治或社会立场：反对征税本身，或反对某项具体税制/加税方案。","拼写上更常见的形式是连字符写法 anti-taxation；有时也会用更口语、更常见的形容词 anti-tax（例如 anti-tax voters 反对税收的选民）。"]}
{"word":"antitechnological","summary":{"en":"Antitechnological describes people, ideas, or works that oppose or strongly criticize modern technology or its social effects.","zh":"Antitechnological 用来形容反对或强烈批判现代科技（或其社会影响）的人、观点或作品。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to modern technology, or critical of how technology is used in society.","zh":"反科技的；反对现代科技，或批判科技在社会中的使用方式。"},"examples":[{"en":"Some people call the film antitechnological because it warns about smartphones taking over our lives.","zh":"有人说这部电影很反科技，因为它警告智能手机正在掌控我们的生活。"},{"en":"Her antitechnological views come from worries about privacy and addiction.","zh":"她的反科技观点来自对隐私和成瘾的担忧。"},{"en":"The article isn’t antitechnological; it supports technology but asks for stronger rules.","zh":"这篇文章并不是反科技；它支持科技，但呼吁更严格的规则。"}]}],"synonyms":["anti-technology","technophobic","anti-modern","Luddite (often negative/label)","skeptical of technology"],"phonetic":"/ˌæn.taɪˌtɛk.nəˈlɑː.dʒɪ.kəl/","extraExplanation":["“anti-”是英语里很常见的前缀，表示“反对、抵制”。例如：antiwar（反战）、antivirus（抗病毒）、anti-aging（抗衰老）。因此 antitechnological 直观意思就是“反对科技/技术的”。","这个词在日常口语中不算常见；更常见的表达是 “anti-technology” 或 “technophobic（恐惧科技的）”。另外要注意：antitechnological 不一定等于“讨厌一切科技”，也可能是对某些技术趋势（如监控、算法、社交媒体成瘾）的批评。"]}
{"word":"antitechnology","summary":{"en":"Antitechnology describes opposition to modern technology or the belief that technology is harmful; it can also refer to the ideology itself.","zh":"Antitechnology 指“反科技的/反对现代科技的”，也可指“反科技思想（或运动）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to modern technology, or believing that technology is harmful or should be limited.","zh":"反科技的；反对现代科技的，或认为科技有害、应受限制的。"},"examples":[{"en":"Some critics call the film antitechnology because it shows computers destroying human relationships.","zh":"一些评论家称这部电影“反科技”，因为它展现了电脑破坏人际关系。"},{"en":"Her antitechnology attitude comes from concerns about privacy and screen addiction.","zh":"她反科技的态度源于对隐私和沉迷屏幕的担忧。"}]},{"partOfSpeech":"n.","definition":{"en":"A belief or movement that rejects or strongly criticizes the use of modern technology.","zh":"反科技思想（或运动）：拒绝或强烈批评现代科技使用的观点。"},"examples":[{"en":"Antitechnology has appeared in different forms throughout history, especially during periods of rapid change.","zh":"反科技思想在历史上以不同形式出现过，尤其在快速变革时期。"},{"en":"The essay explores antitechnology in literature, from factory-era fears to today’s AI anxieties.","zh":"这篇文章探讨了文学中的反科技主题，从工厂时代的恐惧到当今对人工智能的焦虑。"}]}],"synonyms":["anti-technology","technophobic","anti-tech","Luddite (informal)","tech-skeptical"],"phonetic":"/ˌænti tɛkˈnɑlədʒi/","extraExplanation":["“anti-”是常见前缀，表示“反对、抵制”。“antitechnology”更常写作“anti-technology”（加连字符），尤其在正式写作中。","文化联想：英语里常用“Luddite（卢德分子）”来形容强烈反对新技术的人；也可用“tech-skeptical（对科技持怀疑态度的）”来表示较温和的立场。","在讨论中注意区分：反科技（反对技术本身）与批判性使用科技（强调监管、伦理与节制）并不完全相同。"]}
{"word":"antiteetotalism","summary":{"en":"Antiteetotalism means opposing total abstinence from alcohol and accepting moderate drinking.","zh":"Antiteetotalism 指反对完全戒酒，认为适度饮酒可以接受。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to teetotalism (the belief or practice of completely avoiding alcohol); the view that moderate drinking can be acceptable.","zh":"反对“戒酒主义”（完全不喝酒的信念或做法）；认为适度饮酒可以被接受的观点。"},"examples":[{"en":"His antiteetotalism made him argue that a glass of wine with dinner can be healthy.","zh":"他的反戒酒主义让他主张晚餐配一杯葡萄酒也可以很健康。"},{"en":"The club’s antiteetotalism showed up in its rules: alcohol was allowed, but drunkenness was not.","zh":"俱乐部的反戒酒主义体现在规定里：允许饮酒，但不允许酗酒。"}]}],"synonyms":["opposition to teetotalism","pro-drinking (in moderation)","anti-prohibition (context-dependent)"],"phonetic":"/ˌæn.tiˈtiːˌtoʊ.təlˌɪz.əm/","extraExplanation":["“teetotalism（戒酒主义）”来自 19 世纪的英语口语表达 “T-total”（完全、彻底），其中 “T” 被认为强调 “total（完全）”。“anti-” 是常见前缀，表示“反对/对抗”。因此 antiteetotalism 多见于讨论社会风俗、宗教立场、公共政策（如禁酒令）或健康观念的语境里。","拼写提示：你输入的 antiteetotalism 里多了一个 e（antiteetotalism），更常见的写法是 antiteetotalism（有时也写作 anti-teetotalism 加连字符）。"]}
{"word":"antitegula","summary":{"en":"An antitegula is a Roman-style curved cover tile placed over the joints between flat roof tiles.","zh":"antitegula 指罗马式屋顶中用来覆盖平瓦接缝的弧形盖瓦。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Architecture, archaeology) A curved cover tile used on Roman-style roofs to cover the seams between flat tiles (tegulae).","zh":"（建筑/考古）一种罗马式屋顶的弧形盖瓦，用来覆盖平瓦（tegulae）之间的接缝。"},"examples":[{"en":"Archaeologists found fragments of antitegulae scattered among the roof tiles.","zh":"考古学家在屋瓦碎片中发现了许多盖瓦（antitegula）的残片。"},{"en":"The roof was laid with flat tegulae, and each joint was sealed by an antitegula.","zh":"屋顶先铺平瓦（tegulae），再用盖瓦（antitegula）把每条接缝盖住。"}]}],"synonyms":["imbrex","cover tile","cap tile"],"phonetic":"/ˌæntiˈtɛɡjələ/","extraExplanation":["这个词来自拉丁语：anti-（在……对面/对应）+ tegula（瓦）。在罗马屋顶系统里，平瓦（tegula）负责排水的“底瓦”，而弧形盖瓦（常与拉丁词 imbrex 对应）负责把两片平瓦之间的缝盖住，减少渗漏。不同作者/地区的术语可能略有混用，但核心概念通常是“盖住接缝的弧形瓦”。"]}
{"word":"antitemperance","summary":{"en":"Anti-temperance means opposing temperance or alcohol bans, or describing people/groups who oppose them.","zh":"anti-temperance 指反对禁酒/节酒或反对禁酒令，也可指反禁酒的人或团体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to temperance (the movement or practice of avoiding alcohol), especially opposed to efforts to restrict or ban alcohol.","zh":"反对禁酒/节酒（节制饮酒）的人或立场，尤指反对限制或禁止酒类的运动与政策。"},"examples":[{"en":"Anti-temperance groups argued that banning alcohol would harm businesses.","zh":"反禁酒团体认为，禁止酒类会伤害商业。"},{"en":"In some newspapers, anti-temperance writers criticized the temperance movement as moral policing.","zh":"在一些报纸上，反禁酒的作者批评禁酒运动是在进行道德管控。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or group that opposes temperance or prohibition.","zh":"反对禁酒/节酒或反对禁酒令的人或团体。"},"examples":[{"en":"He was an anti-temperance speaker during the local debates.","zh":"在当地辩论中，他是一位反禁酒的演讲者。"},{"en":"Anti-temperance organizations campaigned against Prohibition.","zh":"反禁酒组织曾开展反对禁酒令的活动。"}]}],"synonyms":["anti-prohibition","pro-alcohol","wet (historical, U.S.)","anti-temperance (with hyphen)"],"phonetic":"/ˌæn.tiˈtɛm.pɚ.əns/","extraExplanation":["“antitemperance”更常见的拼写是 **anti-temperance**（常带连字符）。它与19世纪末到20世纪初英语世界的 **temperance movement（禁酒/节酒运动）** 密切相关；在美国背景中常会和 **Prohibition（禁酒令，尤其指1920–1933年）** 一起出现。","“temperance”在历史语境里往往不只是“少喝酒”，而是带有社会运动、宗教道德改革色彩；因此“anti-temperance”也常暗含“反对以道德为名的限制”。"]}
{"word":"antiterrorism","summary":{"en":"Antiterrorism refers to measures or policies aimed at preventing or fighting terrorism, and it can also describe things related to those efforts.","zh":"Antiterrorism 指为预防或打击恐怖主义而采取的措施或政策，也可作形容词表示“反恐相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"actions, laws, or strategies intended to prevent, respond to, or reduce terrorism.","zh":"旨在预防、应对或减少恐怖主义的行动、法律或策略。"},"examples":[{"en":"The government introduced new antiterrorism measures after the attack.","zh":"袭击事件后，政府推出了新的反恐措施。"},{"en":"Airports increased security as part of broader antiterrorism efforts.","zh":"作为更广泛反恐努力的一部分，机场加强了安检。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to efforts to prevent or fight terrorism.","zh":"与预防或打击恐怖主义的努力有关的；反恐的。"},"examples":[{"en":"They received antiterrorism training before traveling abroad.","zh":"出国前他们接受了反恐培训。"},{"en":"The company updated its antiterrorism policy for large events.","zh":"公司为大型活动更新了反恐政策。"}]}],"synonyms":["counterterrorism","anti-terrorism measures","security measures (in context)"],"phonetic":"/ˌæn.tiˈtɛr.əˌrɪz.əm/","extraExplanation":["“antiterrorism”常见于新闻、政府公告与法律语境，强调“预防与应对恐怖主义”的总体政策与措施。日常口语里更常用“counterterrorism”（反恐行动/反恐工作）来指具体执行层面的行动。","构词法：anti-（反对）+ terrorism（恐怖主义）。注意它通常写作一个词：antiterrorism。"]}
{"word":"antiterrorist","summary":{"en":"Antiterrorist means ‘against terrorism,’ and can describe measures or people who fight terrorism.","zh":"antiterrorist 表示“反恐的”，既可形容反恐措施/行动，也可指从事反恐工作的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"intended to prevent or fight terrorism; relating to actions, laws, or forces used against terrorism.","zh":"反恐的；旨在预防或打击恐怖主义的；与反恐行动、法律或力量有关的。"},"examples":[{"en":"The government introduced new antiterrorist measures at airports.","zh":"政府在机场推出了新的反恐措施。"},{"en":"Antiterrorist police increased patrols after the threat.","zh":"出现威胁后，反恐警察加强了巡逻。"},{"en":"The movie follows an antiterrorist unit trying to stop an attack.","zh":"这部电影讲述了一支反恐小队试图阻止袭击。"}]},{"partOfSpeech":"n.","definition":{"en":"a person (often a member of a police or military unit) who works to prevent or combat terrorism.","zh":"反恐人员（常指警察或军队成员），从事预防或打击恐怖主义工作的人。"},"examples":[{"en":"She trained as an antiterrorist for the national security service.","zh":"她接受训练，成为国家安全部门的反恐人员。"},{"en":"The antiterrorists quickly secured the building.","zh":"反恐人员迅速控制了大楼。"}]}],"synonyms":["counterterrorism","counter-terrorism","anti-terrorism","counterterrorist"],"phonetic":"/ˌæn.tiˈtɛr.ə.rɪst/","extraExplanation":["“antiterrorist”由前缀 anti-（反对、对抗）+ terrorist（恐怖分子/恐怖主义者）构成。新闻报道中更常见的是形容词用法，如 antiterrorist measures/operations/units。","在英语媒体里，“counterterrorism / counter-terrorism”（反恐）也非常常用，语气更偏正式、政策或军事领域；“antiterrorist”相对更直观，但使用频率通常低一些。"]}
{"word":"antitetanic","summary":{"en":"Antitetanic means ‘against tetanus,’ especially referring to vaccines, serum, or protection.","zh":"antitetanic 指“抗破伤风的”，尤用于描述疫苗、血清或防护作用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"preventing or counteracting tetanus (often describing a vaccine, serum, or immunity).","zh":"抗破伤风的；用于预防或对抗破伤风的（常用来形容疫苗、血清或免疫力）。"},"examples":[{"en":"The doctor gave him an antitetanic injection after the deep cut.","zh":"他被深深割伤后，医生给他注射了抗破伤风针。"},{"en":"Antitetanic immunity is important for people who work with soil or rusty metal.","zh":"对经常接触泥土或生锈金属的人来说，抗破伤风免疫很重要。"}]}],"synonyms":["anti-tetanus","tetanus-preventing","tetanus-protective"],"phonetic":"/ˌæntaɪtɪˈtænɪk/","extraExplanation":["“antitetanic”多见于医学语境，日常英语里更常说 tetanus shot（破伤风疫苗/加强针）或 tetanus booster（加强针）。","破伤风（tetanus）通常与伤口被土壤中的细菌污染有关，并不等同于“被铁锈划伤就一定会得”，铁锈更像是增加伤口被污染的风险因素。"]}
{"word":"antitetanolysin","summary":{"en":"Antitetanolysin is an antibody (or antiserum) that neutralizes tetanolysin, a toxin associated with the tetanus bacterium.","zh":"Antitetanolysin 指能中和破伤风溶血素（tetanolysin）的抗体或抗血清，属于较少见的专业用语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an antibody (or antiserum) that neutralizes tetanolysin, a toxin produced by the bacterium that causes tetanus","zh":"抗破伤风溶血素（能中和“破伤风溶血素”这种毒素的抗体或抗血清）"},"examples":[{"en":"In older laboratory reports, antitetanolysin may be listed as a protective antibody against tetanus toxins.","zh":"在较早的实验室报告中，antitetanolysin 可能被列为对抗破伤风毒素的保护性抗体。"},{"en":"Researchers measured antitetanolysin levels after immunization to see whether the serum could neutralize tetanolysin.","zh":"研究人员在免疫后测量 antitetanolysin 水平，以判断血清是否能中和破伤风溶血素。"}]}],"synonyms":["anti-tetanolysin","tetanolysin antiserum","tetanus antitoxin (broader/related)"],"phonetic":"/ˌæn.taɪˌtiː.təˈnɑː.lɪ.sɪn/","extraExplanation":["这个词比较少见，多出现在旧的免疫学/细菌毒素研究或检验语境中。更常见的临床说法是“tetanus antitoxin（破伤风抗毒素）”或讨论“tetanolysin（破伤风溶血素）”与“tetanospasmin（破伤风痉挛毒素）”两种毒素。","构词法：anti-（抗、对抗）+ tetanolysin（破伤风溶血素，一种能破坏红细胞的溶血毒素）。"]}
{"word":"antithalian","summary":{"en":"“Antithalian” is not standard; it likely means “antithetical” (directly opposite).","zh":"“antithalian”不是标准用词；很可能指“antithetical”（完全相反、对立）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “antithetical,” meaning completely opposed or in direct contrast.","zh":"不是标准英语单词。很可能是“antithetical”的拼写错误，意思是“完全相反的；形成鲜明对比的”。"},"examples":[{"en":"“Antithalian” isn’t found in most dictionaries; you may mean “antithetical.”","zh":"“antithalian”在大多数词典里找不到；你可能想写“antithetical”。"},{"en":"Their goals are antithetical: one wants to cut spending, the other wants to increase it.","zh":"他们的目标完全相反：一个想削减开支，另一个想增加开支。"}]}],"synonyms":["opposed","contrary","incompatible","diametrically opposed"],"phonetic":"/ˌæn.təˈθɛt̬.ɪ.kəl/","extraExplanation":["“Antithetical”来自希腊语词根 anti-（反对）+ thesis（论点、命题），常用于写作与辩论中，表示“在观点/性质上对立”。","如果你能提供你看到“antithalian”的原句或出处（书名/网页/截图），我可以帮你判断它是否是专有名词、拼写变体，或是某个小众术语。"]}
{"word":"antitheft","summary":{"en":"Antitheft describes something that prevents theft, or it can mean a theft-prevention device/system.","zh":"antitheft 指“防盗的”，也可指“防盗装置/系统”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to prevent theft or make stealing more difficult.","zh":"防盗的；用于防止偷窃或让偷窃更困难的。"},"examples":[{"en":"This backpack has an antitheft zipper and a hidden pocket.","zh":"这个背包有防盗拉链和隐藏口袋。"},{"en":"Many cars now come with antitheft systems.","zh":"很多汽车现在都配备了防盗系统。"}]},{"partOfSpeech":"n.","definition":{"en":"A device or system used to prevent theft.","zh":"防盗装置；防盗系统。"},"examples":[{"en":"The store installed new antitheft at the exits.","zh":"这家店在出口处安装了新的防盗装置。"},{"en":"The antitheft on my bike is a heavy U-lock.","zh":"我自行车的防盗装备是一把很重的U形锁。"}]}],"synonyms":["theft-proof","security","anti-theft"],"phonetic":"/ˌæn.tiˈθeft/","extraExplanation":["常见写法是连字符形式 anti-theft，意思更清晰：anti（反对/防止）+ theft（偷窃）。在商品说明里也常见写作 antitheft。","搭配很常见：anti-theft device（防盗装置）、anti-theft system（防盗系统）、anti-theft alarm（防盗报警器）、anti-theft tag（防盗标签/防盗磁扣）。"]}
{"word":"antitheism","summary":{"en":"Antitheism is active opposition to belief in God or gods, often arguing that theism is harmful.","zh":"反有神论是对相信神或诸神的主动反对，常主张有神论具有负面影响。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"opposition to the belief in God or gods; the view that theism is harmful or should be challenged, not merely untrue.","zh":"反有神论；反对相信神或诸神的立场，认为有神论不仅不真实，而且有害或应被抵制/批判。"},"examples":[{"en":"Antitheism argues that organized belief in gods can cause social harm.","zh":"反有神论认为，有组织的信神体系可能会造成社会危害。"},{"en":"She describes herself as an antitheist because she actively criticizes theism in public debates.","zh":"她自称反有神论者，因为她会在公开辩论中积极批评有神论。"}]}],"synonyms":["anti-theism","opposition to theism","anti-religious (sometimes, but not exact)"],"phonetic":"/ˌæn.tiˈθi.ɪ.zəm/","extraExplanation":["“antitheism”通常比“atheism（无神论）”更“主动/对抗”。无神论多指“缺乏对神的信仰”或“相信没有神”；反有神论则更强调“反对有神论”并可能主张其具有负面影响。","与“anti-religion（反宗教）”不完全相同：反有神论主要针对“神的存在/信仰”，而反宗教更常针对“宗教制度、教义或宗教实践”。有人可能反对宗教机构但仍相信神，反之亦然。","在讨论时要注意语境与礼貌：该词在宗教文化背景中可能带有强烈立场色彩，适合用于哲学、社会学或辩论语境。"]}
{"word":"antitheist","summary":{"en":"An antitheist is someone who actively opposes theism or religion, not just someone who lacks belief in God.","zh":"antitheist 指“积极反对有神论或宗教的人”，不只是“不相信神”的无神论者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who actively opposes belief in God or gods and often argues against religion (especially theism)","zh":"反神论者；积极反对对上帝/诸神的信仰、常常主张反对宗教（尤指有神论）的人"},"examples":[{"en":"She describes herself as an antitheist and often debates religion in public forums.","zh":"她称自己是反神论者，经常在公共论坛上就宗教展开辩论。"},{"en":"Some antitheists criticize organized religion for its influence on politics.","zh":"一些反神论者批评组织化宗教对政治的影响。"},{"en":"He is an atheist, but not an antitheist; he prefers not to campaign against religion.","zh":"他是无神论者，但不是反神论者；他更倾向于不去反宗教宣传。"}]}],"synonyms":["anti-religion","anti-theistic","opponent of theism"],"phonetic":"ˌæn.t̬iˈθiː.ɪst","extraExplanation":["“antitheist”通常比“atheist（无神论者）”语气更强：atheist 只是“不相信神”，而 antitheist 往往带有“反对有神论/反对宗教”的立场与行动色彩。","在讨论中这是一个带立场的标签，容易引发对立；在正式写作里常用来描述思想立场（例如“an antitheist critique of religion”），但用来称呼具体个人时要注意语境与礼貌。"]}
{"word":"antitheistic","summary":{"en":"“Antitheistic” describes someone or something that actively opposes belief in God or religion.","zh":"“antitheistic”指积极反对有神信仰或宗教的立场，语气比“atheistic（无神论的）”更强。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to belief in God or to religion; actively against theism.","zh":"反神论的；反对有神信仰或宗教的（带有积极反对的立场）。"},"examples":[{"en":"His writing is openly antitheistic and criticizes organized religion.","zh":"他的写作公开带有反神论立场，并批评有组织的宗教。"},{"en":"Some people confuse being atheistic with being antitheistic, but they are not the same.","zh":"有些人把无神论（atheistic）和反神论（antitheistic）混为一谈，但两者并不相同。"}]}],"synonyms":["anti-religious","anti-theist","irreligious (often weaker)"],"phonetic":"/ˌæntiθiˈɪstɪk/","extraExplanation":["词义对比很重要：atheistic（无神论的）通常只是“不相信神”；antitheistic（反神论的）强调“反对有神信仰/宗教”，语气更强、更带对立色彩。","构词：anti-（反对）+ theistic（有神论的）。在正式写作或讨论宗教/哲学议题时更常见。用在描述他人时可能显得尖锐，最好确保语境客观、中性。"]}
{"word":"antitheistical","summary":{"en":"Antitheistical means strongly opposed to theism or religious belief in God.","zh":"antitheistical 指强烈反对有神论或对上帝（宗教信仰）持敌视态度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to belief in God or gods; hostile to theism (religious belief).","zh":"反对有神论的；敌视对神（或诸神）信仰的。"},"examples":[{"en":"Some writers in the early 1900s were openly antitheistical in their essays.","zh":"一些20世纪初的作家在随笔中公开表现出反有神论的立场。"},{"en":"He criticized the policy for being antitheistical, arguing it unfairly targeted religious groups.","zh":"他批评这项政策带有反有神论倾向，认为它不公平地针对宗教团体。"}]}],"synonyms":["antitheistic","anti-religious","anti-theist"],"phonetic":"/ˌænθiθiˈɪstɪkəl/","extraExplanation":["“antitheistical”是较少见的拼写，更常见的是“antitheistic”。两者意思相同。","词义上它比“atheistic（无神论的）”更强调“反对/敌视宗教信仰（有神论）”，不一定只表示“自己不信”，也可能表示对宗教持强烈对立态度。"]}
{"word":"antitheistically","summary":{"en":"“Antitheistically” means “in an actively anti-theism way,” often criticizing or arguing against belief in God or gods.","zh":"“antitheistically”表示“以反有神论的方式”，常指积极批判或论证反对对神或诸神的信仰。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that opposes belief in God or gods (especially by actively arguing against theism).","zh":"以反有神论的方式；以积极反对对神或诸神信仰的方式（常指公开主张或论证反对有神论）。"},"examples":[{"en":"He wrote antitheistically, arguing that religion harms society.","zh":"他以反有神论的口吻写作，主张宗教会伤害社会。"},{"en":"The essay is antitheistically framed, treating theism as a problem to be challenged.","zh":"这篇文章以反有神论来构架，把有神论视为需要被质疑的问题。"}]}],"synonyms":["anti-theistically","in an antitheist way","against theism (context-dependent)"],"phonetic":"/ˌænθiθiˈɪstɪkli/","extraExplanation":["“antitheistically”来自“antitheism”（反有神论）+ -ically（副词后缀）。它通常比“atheistically（无神论地）”语气更强：无神论强调“不相信”，反有神论更强调“反对/批判有神论”。","使用时要注意语境与语气：在学术讨论（philosophy, ethics, sociology）里较常见；在日常对话中可能显得尖锐，容易引发宗教或文化敏感话题。"]}
{"word":"antithenar","summary":{"en":"Antithenar refers to the palm area opposite the thumb’s thenar eminence, often meaning the hypothenar (little‑finger side).","zh":"antithenar 指手掌上与拇指侧大鱼际相对的一侧，常用来指小指侧的小鱼际。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy) The area or muscle group on the palm opposite the thenar eminence (the thumb side); often used to mean the hypothenar eminence (the little‑finger side).","zh":"（解剖）手掌上与大鱼际（拇指侧）相对的一侧区域或肌群；常用来指小鱼际（小指侧）。"},"examples":[{"en":"She felt numbness along the antithenar side of her palm near the little finger.","zh":"她感觉手掌靠近小指的小鱼际（antithenar）一侧发麻。"},{"en":"The therapist tested grip strength and checked tenderness in the thenar and antithenar areas.","zh":"治疗师测试握力，并检查大鱼际与小鱼际（antithenar）区域是否压痛。"}]}],"synonyms":["hypothenar","hypothenar eminence"],"phonetic":"/ˌæn.tiˈθi.nɚ/","extraExplanation":["“antithenar”在现代英语解剖学里不算常见，更常见的标准术语是“hypothenar”（小鱼际）。有些资料会把“antithenar”当作“hypothenar”的近义或旧用法，意思是“与大鱼际相对的那一侧”。","词根提示：anti- 表示“相对/相反”，thenar 指“大鱼际（拇指根部肌隆起）”。因此 antithenar 字面意思是“在 thenar 的对面”。"]}
{"word":"antitheologian","summary":{"en":"An antitheologian is someone who opposes theology or argues against religious doctrine.","zh":"antitheologian 指反对神学或批评宗教教义的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposes theology or religious doctrine, or argues against theologians and their ideas","zh":"反对神学或宗教教义的人；与神学家观点对立、加以批评的人"},"examples":[{"en":"Some critics called him an antitheologian because he rejected all attempts to explain God through doctrine.","zh":"一些批评者称他为“反神学家”，因为他拒绝用教义来解释上帝的一切尝试。"},{"en":"In the debate, she was labeled an antitheologian for challenging traditional teachings.","zh":"在辩论中，她因质疑传统教义而被贴上“反神学家”的标签。"}]}],"synonyms":["critic of theology","opponent of theology","anti-theology writer","religious skeptic"],"phonetic":"/ˌæntiθiəˈloʊdʒən/","extraExplanation":["这个词很少见，通常出现在讨论宗教思想史、哲学批评或尖锐争论的语境中。日常英语里更常用：critic of theology（神学批评者）、opponent of theology（反对神学者）、anti-religious thinker（反宗教思想者，语气更强）。","构词法：anti-（反对）+ theologian（神学家）。因此它往往带有“立场对立/批判”的意味，但不一定等同于 atheist（无神论者）——无神论者是否反对神学取决于具体观点。"]}
{"word":"antitheological","summary":{"en":"“Antitheological” describes a viewpoint that is opposed to theology or religious doctrine/authority.","zh":"“antitheological”指反对神学或宗教教义/权威的立场。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to theology or to religious belief, teaching, or authority; anti-religious in viewpoint.","zh":"反神学的；反对宗教信仰、宗教教义或宗教权威的。"},"examples":[{"en":"Some Enlightenment writers were openly antitheological, arguing that religion should not guide public policy.","zh":"一些启蒙时代的作家公开持反神学立场，认为宗教不应指导公共政策。"},{"en":"The article takes an antitheological tone, criticizing churches as sources of power rather than spiritual care.","zh":"这篇文章语气反神学，批评教会更多是权力来源而非精神关怀。"}]}],"synonyms":["anti-religious","anti-theistic","irreligious"],"phonetic":"/ˌæn.taɪˌθi.əˈlɑː.dʒɪ.kəl/","extraExplanation":["构词：anti-（反对）+ theological（神学的）。常用于学术写作或思想史语境，带有“立场/倾向”的色彩。","语体与用法：比“atheistic（无神论的）”更强调“反对神学/宗教理论体系”，并不一定表示说话者否认上帝存在；但在实际语境中两者可能重叠。","相关词：anti-theology（n. 反神学立场/反神学思想，较少见）；antitheism（n. 反有神论，反对宗教/有神信仰）；theological（adj. 神学的）。"]}
{"word":"antitheologizing","summary":{"en":"Antitheologizing means opposing or removing a theological (religious) interpretation, often in academic or critical discussion.","zh":"antitheologizing 指反对或抽离神学（宗教）式解读，常见于学术或评论语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposing or resisting theological interpretation; trying to remove religious/theological meanings from a topic (such as history, literature, or politics).","zh":"反对或抵制神学式解读；试图把某个议题（如历史、文学、政治）中的宗教/神学意义抽离出来。"},"examples":[{"en":"Some scholars describe the film’s antitheologizing approach as a shift toward psychology rather than religion.","zh":"一些学者把这部电影的“反神学化”取向描述为从宗教转向心理学的变化。"},{"en":"The article takes an antitheologizing tone, treating the ritual mainly as a cultural practice.","zh":"这篇文章带有反神学化的语气，主要把仪式当作一种文化实践来讨论。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or process of arguing against theologizing, or of removing theological framing from something.","zh":"反对“神学化”的行为或过程；把某事从神学框架中抽离的过程。"},"examples":[{"en":"Antitheologizing can help readers focus on social factors, but it may also ignore believers’ perspectives.","zh":"反神学化能帮助读者关注社会因素，但也可能忽略信徒的视角。"},{"en":"In the debate, antitheologizing was presented as a method for making the discussion more secular.","zh":"在辩论中，“反神学化”被视为让讨论更世俗化的一种方法。"}]}],"synonyms":["de-theologizing","secularizing","anti-theological","non-theological"],"phonetic":"/ˌæntaɪθiˈɑlədʒaɪzɪŋ/","extraExplanation":["这个词非常少见，多见于学术写作或批评语境。结构上是 anti-（反对）+ theologize（作神学阐释、从神学角度解释）+ -ing（现在分词/动名词），因此既可作形容词（antitheologizing approach），也可指“反神学化的过程”（作名词）。","更常见、也更自然的表达包括：de-theologizing（去神学化）、secularizing（世俗化）、anti-theological（反神学的）。"]}
{"word":"antitheology","summary":{"en":"Antitheology means opposition to theology or writing that argues against theological claims.","zh":"antitheology 指反对神学，或批判、否定神学主张的论述。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to theology, or the study/writing that argues against religious theology and its claims about God or the divine.","zh":"反神学；反对神学的立场或著作，主张批评或否定神学关于上帝/神性的论述。"},"examples":[{"en":"The essay reads like antitheology, challenging the idea that divine revelation can be a reliable source of knowledge.","zh":"这篇文章很像反神学，质疑“神启示”能否作为可靠的知识来源。"},{"en":"In the seminar, students compared classical theology with modern antitheology in philosophy and literature.","zh":"在研讨课上，学生比较了传统神学与哲学、文学中的现代反神学。"}]}],"synonyms":["anti-theology","critique of theology","theological skepticism","anti-religious philosophy"],"phonetic":"ˌæntiθiˈɑlədʒi","extraExplanation":["“antitheology”由前缀 anti-（反对）+ theology（神学）构成，多见于哲学、宗教学、文学批评等语境，属于相对少见、较学术化的词。","它通常不是指“无神论（atheism）”本身：无神论是否认神的存在；而“反神学”更强调反对或批判“神学体系/神学论证/神学话语”。在写作中可根据语境区分两者。"]}
{"word":"antithermic","summary":{"en":"Antithermic means “fever-reducing; lowering body heat.”","zh":"Antithermic 指“退热的；降体温的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Reducing fever or body heat; used to lower an abnormally high temperature.","zh":"退热的；降体温的（用于降低异常升高的体温）。"},"examples":[{"en":"The doctor prescribed an antithermic medicine to bring down her fever.","zh":"医生开了退热药来降低她的发烧。"},{"en":"An antithermic effect can help patients feel more comfortable during a flu.","zh":"退热作用能帮助流感患者感觉更舒服。"}]}],"synonyms":["antipyretic","fever-reducing","febrifuge"],"phonetic":"/ˌæn.tiˈθɝː.mɪk/","extraExplanation":["“antithermic”在现代英语中相对少见，医学写作里更常用的同义词是“antipyretic”（退热的）。","词源上：anti- 表示“反、对抗”，therm- 与“热”有关（如 thermal 热的）。因此字面意思就是“对抗热”。","注意区分：antithermic/antipyretic 指“退烧（降低异常体温）”，不等同于“cooling”（清凉的、让人感觉凉快的）或“hypothermic”（低体温的/导致体温过低的）。"]}
{"word":"antithermin","summary":{"en":"“Antithermin” is not a recognized English word; it’s likely a misspelling (often of “antithrombin” or “antithetical”).","zh":"“antithermin”不是标准英语词，通常是拼写错误（常见可能是“antithrombin”或“antithetical”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling of another term (for example, “antithrombin” in medicine, or “antithetical” in general English). If you share the sentence where you saw it, I can identify the intended word and explain it clearly.","zh":"这不是一个标准英语单词。它可能是其他词的拼写错误（例如医学中的“antithrombin 抗凝血酶”，或日常英语中的“antithetical 对立的/相反的”）。如果你把它出现的句子发给我，我可以帮你确定原词并详细解释。"},"examples":[{"en":"I can’t find “antithermin” in a reliable dictionary—can you show me the context?","zh":"我在权威词典里找不到“antithermin”——你能给我看看它的上下文吗？"},{"en":"Did you mean “antithrombin,” a protein that helps prevent blood clots?","zh":"你是不是想写“antithrombin（抗凝血酶）”，一种帮助防止血栓的蛋白？"},{"en":"Did you mean “antithetical,” meaning completely opposite?","zh":"你是不是想写“antithetical（对立的/完全相反的）”？"}]}],"phonetic":"/ˌæn.tiˈθɝː.mɪn/","extraExplanation":["“antithermin”很可能是拼写误差。常见的相近词形包括：\n1) antithrombin（医学/生物）：血液中的一种蛋白质，作用是抑制凝血过程。\n2) antithetical（通用英语）：表示“对立的、截然相反的”。\n把你看到它的领域（医学、文学、科技、游戏等）和原句发来，我可以更准确判断。"]}
{"word":"antitheses","summary":{"en":"“Antitheses” means multiple direct opposites or strong contrasts, often used for emphasis in writing and speech.","zh":"“Antitheses”指多个“对立面/强烈对比”，常用于写作和演讲中以加强表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of antithesis: direct opposites or strong contrasts between two things (often used in writing or speech for emphasis).","zh":"antithesis 的复数：对立面；（常用于写作或演讲中）两者之间强烈的对比，用来强调观点。"},"examples":[{"en":"Hope and fear can be antitheses that shape how we make decisions.","zh":"希望和恐惧可能是一对对立面，会影响我们如何做决定。"},{"en":"In the essay, the author sets urban life and rural life as antitheses.","zh":"在文章中，作者把城市生活和乡村生活作为对照的对立面。"},{"en":"The speech relies on antitheses like “darkness and light” to sound more powerful.","zh":"这篇演讲依靠像“黑暗与光明”这样的对比来增强力度。"}]}],"synonyms":["opposites","contrasts","counterparts","polar opposites"],"phonetic":"/ænˈtɪθəˌsiz/","extraExplanation":["“antithesis”常见于修辞学（rhetoric）：把两个相反或强烈对照的概念并置，形成清晰的对比效果。经典结构如：A is not X; it is Y（不是X，而是Y）。","词形提示：单数是 antithesis；复数是 antitheses（拼写变化：-is → -es）。"]}
{"word":"antithesis","summary":{"en":"Antithesis means a strong contrast or opposite; in rhetoric, it also means a parallel structure that contrasts two ideas for emphasis.","zh":"Antithesis 指强烈的对比或对立面；在修辞中也指用平行结构并列相反观念以加强表达的“对照（法）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a direct contrast or complete opposite of someone or something","zh":"（人或事物的）对立面；完全相反的人/事"},"examples":[{"en":"Her calm attitude is the antithesis of his nervous energy.","zh":"她冷静的态度与他紧张的精力形成鲜明对比，简直是他的对立面。"},{"en":"The new policy is the antithesis of what we promised during the campaign.","zh":"新政策与我们竞选时的承诺完全相反。"}]},{"partOfSpeech":"n.","definition":{"en":"a rhetorical technique that places two contrasting ideas in parallel structure to create a strong effect","zh":"【修辞】对照（法）：用对称/平行结构并列相反观念，以增强表达效果"},"examples":[{"en":"“It was the best of times, it was the worst of times” is a famous example of antithesis.","zh":"“这是最好的时代，这是最坏的时代”是典型的对照（法）例子。"},{"en":"The speaker used antithesis to make the choice sound clear: “We must build, not break.”","zh":"演讲者用对照让选择更清晰：“我们必须建设，而不是破坏。”"}]}],"synonyms":["opposite","contrast","counterpart","reverse"],"phonetic":"/ænˈtɪθəsɪs/","extraExplanation":["词源来自希腊语 anti-（相对、反对）+ thesis（命题、观点），字面意思是“与某个观点相对的观点”。","在写作与演讲中，antithesis 常与 parallelism（排比/平行结构）一起出现：结构相似、意义相反，读起来更有力度、更易记。","常见搭配：the antithesis of + 名词/动名词（……的对立面）；use antithesis to + 动词（用对照来……）。"]}
{"word":"antithesism","summary":{"en":"Antithesis means a strong contrast between two ideas, or something that is the direct opposite of something else.","zh":"Antithesis 指两种观点的强烈对比，也可指某事物的直接对立面。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A direct contrast between two ideas, often used in writing or speech to highlight differences.","zh":"两种观点或概念的直接对比（常用于写作或演讲中，用来突出差异）。"},"examples":[{"en":"In his speech, he used antithesis: “We must learn from the past, not live in it.”","zh":"在演讲中，他用了对照法：“我们必须从过去学习，而不是活在过去里。”"},{"en":"The novel sets wealth against poverty as an antithesis to show social inequality.","zh":"这部小说把富裕与贫穷作对照，用来展现社会不平等。"}]},{"partOfSpeech":"n.","definition":{"en":"The exact opposite of something; a person or thing that strongly contrasts with another.","zh":"完全相反的事物；与另一人或事物形成强烈对照的人或物。"},"examples":[{"en":"Her calm attitude was the antithesis of his panic.","zh":"她的冷静与他的恐慌形成鲜明对比。"},{"en":"For him, the city was the antithesis of peace.","zh":"对他来说，城市是“宁静”的反面。"}]}],"synonyms":["contrast","opposite","counterpart","reverse","contradiction"],"phonetic":"/ænˈtɪθəsɪs/","extraExplanation":["你输入的“antithesism”很可能是拼写错误，正确拼写是 antithesis（复数 antitheses）。","antithesis 常见于修辞手法：把结构相似但意义相反的两部分并列，以加强表达效果（例如著名句式 “not A but B”）。"]}
{"word":"antithesize","summary":{"en":"Antithesize means to set opposing ideas in contrast, often for emphasis in speech or writing.","zh":"Antithesize 指把相反的观点并列对照，常用于演讲或写作中以加强表达效果。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to create or express an antithesis; to place two opposite ideas side by side for contrast","zh":"制造或表达“对照/对立”；把两种相反的观点并列起来以形成对比"},"examples":[{"en":"The speaker antithesized freedom and fear to highlight the choice the nation faced.","zh":"演讲者把“自由”和“恐惧”对照起来，强调国家所面临的选择。"},{"en":"In the poem, the writer antithesizes light with darkness to show hope against despair.","zh":"在这首诗中，作者用“光”对照“黑暗”，表现绝望中的希望。"}]}],"synonyms":["contrast","oppose","counterpose","set against"],"phonetic":"/ænˈtɪθəˌsaɪz/","extraExplanation":["“antithesize”在现代英语中不算常见拼写；更常见的是 **antithetize**（美式）或 **antithesise**（英式）。含义相同，都来自名词 **antithesis**（对照/对立）。","这是修辞与写作中的常用手法：把相反概念并列（如“war and peace”“rich and poor”），让对比更鲜明。写作里也常与词组 **set A against B**（把A与B对照）一起理解。"]}
{"word":"antithet","summary":{"en":"Antithet is a rare word meaning the direct opposite (an antithesis), or a rhetorical contrast used for emphasis.","zh":"Antithet 是个较少见的词，指“对立面/对照物”（同 antithesis），也可指修辞上的强烈对照。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) the direct opposite of someone or something; an antithesis.","zh":"（罕见）某人或某事的正相反；对立面；对照物。"},"examples":[{"en":"In the novel, the humble teacher is the antithet of the proud millionaire.","zh":"在小说里，那位谦逊的老师是傲慢百万富翁的对立面。"},{"en":"Her calm response was the antithet of his anger.","zh":"她冷静的回应与他的愤怒形成了鲜明对比。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, rhetoric) a sharp contrast in words or ideas used for emphasis.","zh":"（罕见，修辞）为了强调而用的强烈对照（在措辞或观念上形成对比）。"},"examples":[{"en":"The line uses antithet to contrast ‘war’ with ‘peace.’","zh":"这句话用对照把“战争”和“和平”形成强烈反差。"}]}],"synonyms":["antithesis","opposite","contrast","counterpart"],"phonetic":"/ænˈtɪθət/","extraExplanation":["“antithet”在现代英语中非常少见，多数情况下人们会用更常见的“antithesis”（对立/对照）或形容词“antithetical”（对立的）。","词根来自希腊语：anti-（相对、反对）+ thesis（论点、观点），核心意思是“把两种相反的东西放在一起对照”。"]}
{"word":"antithetic","summary":{"en":"Antithetic means strongly contrasting or directly opposite, and it can also describe writing that pairs opposites for emphasis (antithesis).","zh":"Antithetic 指强烈对比或完全相反；也可指写作中用“对照/对立并置”（antithesis）来增强表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"directly opposed in meaning, ideas, or character; strongly contrasting","zh":"（意义、观点或性质）正相反的；形成强烈对比的"},"examples":[{"en":"His optimistic view is antithetic to her pessimism.","zh":"他乐观的看法与她的悲观态度正相反。"},{"en":"The novel sets up antithetic pairs: city and countryside, youth and age.","zh":"这部小说设置了对立成对的元素：城市与乡村、青春与衰老。"}]},{"partOfSpeech":"adj.","definition":{"en":"(literature/poetry) using antithesis—placing contrasting ideas in parallel structures for emphasis","zh":"（文学/诗歌）使用对照（对偶、对立并置）手法，以并列结构突出反差"},"examples":[{"en":"The speech uses antithetic sentences like “We must learn to live together as brothers or perish together as fools.”","zh":"这篇演讲用了对照句，如“我们必须像兄弟一样共同生活，否则就会像傻瓜一样一起毁灭。”"},{"en":"Writers often use antithetic phrasing to make a point memorable.","zh":"作者常用对照式措辞让观点更易被记住。"}]}],"synonyms":["opposite","contrasting","counter","antithetical","diametrically opposed"],"phonetic":"/ˌæn.t̬əˈθɛ.tɪk/","extraExplanation":["“antithetic”来自“antithesis（对照/对立）”。常见于写作与修辞分析：把两种相反概念并置，产生强调、节奏感与说服力。","易混词：antithetical（更常见的形容词形式，意思相同）；antagonistic（敌对的、对抗的，强调冲突关系，不一定是概念上的对立）。"]}
{"word":"antithetical","summary":{"en":"Antithetical means strongly opposite or contrasting, often used for ideas, values, or rhetorical contrasts.","zh":"Antithetical 指“强烈对立/相反的”，常用于观点、价值观或修辞上的对照。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"directly opposite in meaning, ideas, or effects; contrasting strongly","zh":"在意义、观点或效果上正相反的；强烈对立的"},"examples":[{"en":"Her calm response was antithetical to his angry outburst.","zh":"她冷静的反应与他的愤怒爆发形成鲜明对立。"},{"en":"The film sets up two antithetical worldviews: hope versus despair.","zh":"这部电影对照了两种对立的世界观：希望与绝望。"}]},{"partOfSpeech":"adj.","definition":{"en":"using sharp contrast in wording or structure, especially in writing or speech","zh":"（尤指写作或演讲中）运用对照/对比的表达方式的"},"examples":[{"en":"The speaker used antithetical phrases like “ask not what you can get, but what you can give.”","zh":"演讲者使用了对照式表达，比如“不要问你能得到什么，而要问你能给予什么。”"},{"en":"Her essay style is antithetical, pairing short sentences with long, complex ones for emphasis.","zh":"她的文章风格擅长对照，通过短句与长复杂句搭配来强调重点。"}]}],"synonyms":["opposite","contrary","contrasting","counter","polar"],"phonetic":"/ˌæn.t̬əˈθɛt̬.ɪ.kəl/","extraExplanation":["词源提示：antithetical 来自 anti-（反对）+ thesis（论点）。thesis 可理解为“观点/主张”，所以 antithetical 常表示“与某观点相对立”。","常见搭配：antithetical to（与……相对立）；antithetical ideas/values（对立的想法/价值观）。","相关词对比：antithetical（强调“对立、相反”）≈ opposite/contrary；contradictory 更强调“自相矛盾、互相抵触（逻辑上不可能同时为真）”。"]}
{"word":"antithetically","summary":{"en":"“Antithetically” means “in a directly opposite/contrasting way,” especially in writing or argument.","zh":"“antithetically”表示“以直接对立/对比的方式”，常用于写作或论证。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a directly opposite or contrasting way (often when comparing two ideas, arguments, or characters).","zh":"以对立或对比的方式（常用于比较两个观点、论点或人物）。"},"examples":[{"en":"The article presents the two policies antithetically, showing how each would affect workers differently.","zh":"文章以对比的方式呈现两项政策，展示它们将如何以不同方式影响工人。"},{"en":"In the novel, the sisters are described antithetically: one is cautious, the other impulsive.","zh":"在小说中，姐妹被以对照的方式描写：一个谨慎，另一个冲动。"}]}],"synonyms":["contrastingly","oppositely","in contrast","conversely"],"phonetic":"/ˌæn.t̬əˈθe.t̬ɪ.kli/","extraExplanation":["“antithetically”来自“antithesis”（对照、对立）：anti-（反对）+ thesis（论题、主张）。在写作与修辞中常用于强调“强烈对比”，比如把两种价值观、两类人或两条论证路线并置，以突出差异。","常见搭配：present/pose/contrast … antithetically；be set antithetically to …。学术写作里较常见，日常口语中更常用“in contrast / oppositely”。"]}
{"word":"antithetics","summary":{"en":"Antithetics means “opposite or strongly contrasting,” and it can also describe a rhetorical style that emphasizes contrast through parallel phrasing.","zh":"Antithetics 表示“相对立、强烈对比的”，也可指一种通过平行句式强化对比的修辞风格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Adjective) Directly opposite in meaning, ideas, or effect; strongly contrasting.","zh":"（形容词）在意义、观点或效果上正相反的；强烈对比的。"},"examples":[{"en":"Their goals are antithetics: one wants strict control, the other wants complete freedom.","zh":"他们的目标是相互对立的：一个想要严格控制，另一个想要完全自由。"},{"en":"The report presents two antithetics views of the same event.","zh":"这份报告呈现了对同一事件的两种对立观点。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Adjective, rhetoric/literature) Using or involving antithesis—placing contrasting ideas in parallel structures for emphasis.","zh":"（形容词，修辞/文学）使用对照法（对偶/对比修辞）的；把对立思想用平行结构并列以加强表达效果的。"},"examples":[{"en":"The speech is famous for its antithetics style: “Ask not what your country can do for you—ask what you can do for your country.”","zh":"这篇演讲以对照式风格闻名：“不要问你的国家能为你做什么——要问你能为你的国家做什么。”"},{"en":"In the poem, antithetics images of light and shadow create tension.","zh":"在这首诗里，光与影的对照意象制造了张力。"}]},{"partOfSpeech":"n.","definition":{"en":"(Noun, plural) Opposites; contrasting elements or ideas (less common).","zh":"（名词，复数）对立面；相反的要素或观念（较少见）。"},"examples":[{"en":"The chapter compares several antithetics in the novel: duty versus desire, law versus love.","zh":"这一章比较了小说中的几组对立：责任与欲望、法律与爱情。"}]}],"synonyms":["opposite","contrasting","contrary","conflicting","polar","antagonistic"],"phonetic":"/ˌæntɪˈθɛtɪk/","extraExplanation":["“antithetics”多见于学术写作中，常用来描述两种观点/价值观/结论彼此冲突。更常见的词形是单数形容词“antithetic”。","修辞学中的“antithesis（对照）”是一种常见手法：把意义相反的内容放在相似句式里，让对比更强、节奏更有力。"]}
{"word":"antithrombic","summary":{"en":"Antithrombic describes something that helps prevent blood clots.","zh":"Antithrombic 指“有助于预防血栓（血液凝块）形成的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Preventing or reducing the formation of blood clots (thrombi).","zh":"（医学）抗血栓的；预防或减少血栓形成的。"},"examples":[{"en":"Aspirin can have an antithrombic effect at low doses.","zh":"阿司匹林在低剂量时可能具有抗血栓作用。"},{"en":"The doctor prescribed antithrombic therapy after the surgery to lower the risk of clotting.","zh":"医生在手术后开了抗血栓治疗，以降低形成血栓的风险。"},{"en":"People with certain heart conditions may need antithrombic medication.","zh":"有些心脏疾病患者可能需要使用抗血栓药物。"}]}],"synonyms":["antithrombotic","anticoagulant (related)","antiplatelet (related)"],"phonetic":"/ˌæn.tiˈθrɑm.bɪk/","extraExplanation":["“antithrombic”在英语医学语境中较少见，更常用的拼写是“antithrombotic”。两者含义通常相同：指“抗血栓、抗凝/抗血小板（取决于具体药物机制）”。在临床表达里，也常见“antithrombotic therapy（抗血栓治疗）”，涵盖抗凝药（如 warfarin、heparin、DOACs）与抗血小板药（如 aspirin、clopidogrel）。"]}
{"word":"antithrombin","summary":{"en":"Antithrombin is a blood protein that prevents excessive clotting, mainly by inhibiting thrombin.","zh":"抗凝血酶是血液中的一种蛋白质，主要通过抑制凝血酶来防止过度凝血。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A natural protein in the blood that helps prevent too much clotting by blocking (inhibiting) clotting enzymes, especially thrombin.","zh":"（血液中的）抗凝血酶：一种天然蛋白质，通过抑制凝血酶等凝血相关酶来防止血液过度凝固（形成血栓）。"},"examples":[{"en":"Antithrombin helps keep blood clotting under control.","zh":"抗凝血酶有助于把血液凝固控制在适当范围内。"},{"en":"Low antithrombin levels can increase the risk of developing blood clots.","zh":"抗凝血酶水平偏低可能会增加形成血栓的风险。"},{"en":"Doctors may check antithrombin in people with unexplained or repeated clots.","zh":"对原因不明或反复血栓的人，医生可能会检测抗凝血酶水平。"}]}],"synonyms":["antithrombin III","AT"],"phonetic":"/ˌæn.t̬iˈθrɑm.bɪn/","extraExplanation":["Antithrombin 常写作 “antithrombin III（抗凝血酶III）”，但现在临床上多简称 antithrombin。","它与肝素（heparin）的作用密切：肝素会显著增强 antithrombin 的抑制凝血能力，因此在解释肝素治疗效果或“肝素无效”时常会提到它。","这是医学/生物学术语，日常英语里不常用，更多出现在检验报告、医学论文或医生沟通中。"]}
{"word":"antithrombotic","summary":{"en":"Antithrombotic means “preventing blood clots” (used mainly in medical contexts).","zh":"antithrombotic 指“抗血栓的、预防血栓形成的”，主要用于医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Preventing the formation of blood clots (thrombi) or reducing their growth.","zh":"（医学）抗血栓的；防止血栓形成或抑制血栓增大的。"},"examples":[{"en":"The doctor prescribed an antithrombotic drug after the heart procedure.","zh":"心脏手术后，医生开了抗血栓药物。"},{"en":"Aspirin is sometimes used as an antithrombotic to lower the risk of stroke.","zh":"阿司匹林有时用作抗血栓药，以降低中风风险。"},{"en":"Antithrombotic therapy can increase bleeding risk, so follow medical advice carefully.","zh":"抗血栓治疗可能增加出血风险，因此要严格遵医嘱。"}]}],"synonyms":["anti-clotting","anticoagulant (related)","antiplatelet (related)"],"phonetic":"/ˌæn.ti.θrɑmˈbɑ.tɪk/","extraExplanation":["词形拆解：anti- 表示“反/抗”，thrombo- 来自 thrombus（血栓），-tic 表示“……的”。合起来就是“抗血栓的”。","常见搭配：antithrombotic therapy（抗血栓治疗）、antithrombotic agent/drug（抗血栓药物）。在医学语境中常与 anticoagulant（抗凝药）与 antiplatelet（抗血小板药）一起出现，但三者并不完全等同：antithrombotic 是更“总称”的概念。","使用场景：常见于心血管疾病、房颤、支架术后、深静脉血栓/肺栓塞等风险评估与用药说明中；日常英语里较少使用，更多出现在说明书、病历或科普文章中。"]}
{"word":"antithyroid","summary":{"en":"Antithyroid means “against the thyroid,” especially describing medicines or treatments that reduce thyroid activity.","zh":"antithyroid 指“抗（抑制）甲状腺的”，多用于描述降低甲状腺功能的药物或治疗。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Relating to, preventing, or reducing the activity of the thyroid gland; often used to describe drugs that treat hyperthyroidism (an overactive thyroid).","zh":"（医学）抗甲状腺的；与抑制或降低甲状腺功能有关的；常用于描述治疗甲亢（甲状腺功能亢进）的药物。"},"examples":[{"en":"The doctor prescribed an antithyroid drug to control her hyperthyroidism.","zh":"医生开了抗甲状腺药物来控制她的甲亢。"},{"en":"Antithyroid treatment can help reduce symptoms like rapid heartbeat and weight loss.","zh":"抗甲状腺治疗可以帮助减轻心跳过快、体重下降等症状。"}]}],"synonyms":["thyroid-suppressing","antithyroidal"],"phonetic":"/ˌæn.taɪˈθaɪ.rɔɪd/","extraExplanation":["“anti-”表示“反对/抑制”，“thyroid”指“甲状腺”，因此 antithyroid 字面意思是“抑制甲状腺的”。在医疗语境中更常见的搭配是 antithyroid drug（抗甲状腺药物）或 antithyroid therapy（抗甲状腺治疗）。","常见抗甲状腺药物包括 methimazole（甲巯咪唑）和 propylthiouracil/ PTU（丙硫氧嘧啶）。它们用于降低甲状腺激素生成；用药与剂量需要医生监测（如甲状腺功能、白细胞等）。"]}
{"word":"antithyroidal","summary":{"en":"Antithyroidal means reducing or blocking thyroid hormone production, usually for treating hyperthyroidism.","zh":"Antithyroidal 指抑制或阻断甲状腺激素生成，常用于治疗甲亢。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) preventing the thyroid gland from producing thyroid hormones; used to treat an overactive thyroid (hyperthyroidism).","zh":"（医学）抗甲状腺的；抑制甲状腺分泌甲状腺激素的；用于治疗甲状腺功能亢进。"},"examples":[{"en":"The doctor prescribed an antithyroidal drug to control her hyperthyroidism.","zh":"医生开了抗甲状腺药来控制她的甲亢。"},{"en":"Antithyroidal treatment may take several weeks to show clear effects.","zh":"抗甲状腺治疗可能需要几周才会出现明显效果。"}]}],"synonyms":["antithyroid","thyroid-inhibiting","thyroid-suppressing"],"phonetic":"/ˌæn.tiˈθaɪ.rɔɪ.dəl/","extraExplanation":["“antithyroidal”常见于医学语境，通常指“抗甲状腺药物/治疗”，例如 methimazole（甲巯咪唑）和 propylthiouracil/PTU（丙硫氧嘧啶）。它们用于降低甲状腺激素生成，常用于甲亢或甲状腺毒症相关治疗。"]}
{"word":"antitintinnabularian","summary":{"en":"Antitintinnabularian means a person (or idea) opposed to the ringing of bells, especially church bells, often used humorously or historically.","zh":"antitintinnabularian 指反对鸣钟（尤指教堂钟声）的人或立场，常用于幽默或历史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is opposed to the ringing of bells (especially church bells), often used humorously or in historical contexts","zh":"反对敲钟/鸣钟的人（尤指反对教堂钟声的人）；常带戏谑或历史语境"},"examples":[{"en":"The new neighbor turned out to be an antitintinnabularian who complained about the church bells every Sunday morning.","zh":"新搬来的邻居原来是个反对教堂鸣钟的人，每个周日早上都要投诉钟声。"},{"en":"In the local newspaper, an antitintinnabularian argued that late-night bell ringing disturbed the whole town.","zh":"在当地报纸上，一位反对鸣钟的人主张深夜敲钟会打扰全镇居民。"}]},{"partOfSpeech":"adj.","definition":{"en":"opposed to bell ringing; against the use or sound of bells","zh":"反对鸣钟的；反对使用或发出钟声的"},"examples":[{"en":"The council adopted an antitintinnabularian policy limiting bell ringing after 9 p.m.","zh":"市政会通过了一项限制晚上九点后鸣钟的“反鸣钟”政策。"},{"en":"His antitintinnabularian views were unpopular in a town that loved its bell tower traditions.","zh":"在一个热爱钟楼传统的小镇里，他反对鸣钟的观点并不受欢迎。"}]}],"synonyms":["anti-bell-ringing","bell-averse","anti-tintinnabulation"],"phonetic":"/ˌæn.tiˌtɪn.təˌnæb.jəˈlɛr.i.ən/","extraExplanation":["这个词以拉丁语词根和长串音节“堆叠”形成，属于带幽默感的“夸张长词”。核心词根来自 tintinnabulum（铃、钟），与英语 tintinnabulation（叮当作响的钟声）同源。","19世纪英国等地曾出现过被称为“Anti-Tintinnabulation Society（反鸣钟协会）”之类的组织或称呼，多与居民反对教堂频繁敲钟、影响休息有关。如今该词多见于趣味语言、历史轶闻或刻意使用的夸张表达中。"]}
{"word":"antitobacco","summary":{"en":"Antitobacco describes campaigns, messages, or policies that oppose tobacco use.","zh":"antitobacco 用来形容反对烟草使用的宣传、信息或政策。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to tobacco use; intended to discourage smoking or other tobacco consumption.","zh":"反对烟草使用的；旨在劝阻吸烟或其他烟草消费的。"},"examples":[{"en":"The city launched an antitobacco campaign in schools.","zh":"这座城市在学校发起了反烟草宣传活动。"},{"en":"Many antitobacco ads focus on the health risks of smoking.","zh":"许多反烟草广告强调吸烟的健康风险。"},{"en":"She supports antitobacco policies like higher cigarette taxes.","zh":"她支持提高香烟税等反烟草政策。"}]}],"synonyms":["anti-tobacco","anti-smoking","tobacco-control"],"phonetic":"/ˌæn.ti.təˈbækoʊ/","extraExplanation":["“antitobacco”由前缀“anti-（反对）+ tobacco（烟草）”构成，常见于公共卫生与政策语境，表示“反烟草/控烟”的立场或措施。","更常见的写法是加连字符的“anti-tobacco”，也常用近义词“anti-smoking（反吸烟）”。两者意思接近，但“anti-tobacco”范围更广，可包含电子烟、无烟烟草等。"]}
{"word":"antitobacconal","summary":{"en":"“Antitobacconal” means anti-tobacco/anti-smoking (rare; usually written as “anti-tobacco”).","zh":"“antitobacconal”意为“反烟草/反吸烟的”（较少见，通常写作“anti-tobacco”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to tobacco or smoking; intended to discourage tobacco use (often used to describe laws, campaigns, messages, or policies).","zh":"反对烟草/吸烟的；旨在劝阻使用烟草的（常用于形容法律、宣传活动、信息或政策）。"},"examples":[{"en":"The city launched an antitobacconal campaign to reduce teen smoking.","zh":"这座城市发起了一项反烟草宣传活动，以减少青少年吸烟。"},{"en":"Schools shared antitobacconal messages during health week.","zh":"学校在健康周期间分享了反烟草的信息。"}]}],"synonyms":["anti-tobacco","anti-smoking","smoke-free","tobacco-control"],"phonetic":"/ˌænti təˈbækoʊ/","extraExplanation":["“antitobacconal”很少见，更常见、更自然的写法是 **anti-tobacco** 或 **anti-smoking**。","构词上可理解为 **anti-（反对） + tobacco（烟草） + -al（形容词后缀）**，意思就是“反烟草的”。在正式写作中建议用更常用的 **anti-tobacco**。"]}
{"word":"antitobacconist","summary":{"en":"An antitobacconist is someone who opposes tobacco use or the tobacco trade.","zh":"antitobacconist 指反对吸烟或反对烟草贸易的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is opposed to tobacco use or the tobacco trade (often in public health or social activism contexts)","zh":"反对吸烟或反对烟草贸易的人（常见于公共卫生或社会倡议语境）"},"examples":[{"en":"The antitobacconist spoke at the city council meeting about raising cigarette taxes.","zh":"那位反烟人士在市议会会议上发言，主张提高香烟税。"},{"en":"Some antitobacconists campaign for smoke-free public spaces.","zh":"一些反烟人士倡导公共场所全面禁烟。"}]}],"synonyms":["anti-smoking advocate","tobacco-control activist","smoking opponent","anti-tobacco activist"],"phonetic":"ˌæntaɪtəˈbækənɪst","extraExplanation":["这个词比较少见，主要是由前缀 anti-（“反对”）+ tobacconist（“烟草商/烟草店店主”）构成，字面意思就是“反对烟草商/烟草行业的人”。日常英语里更常用的说法是 anti-smoking advocate（反烟倡导者）、tobacco-control activist（控烟活动人士）或 tobacco opponent（反对烟草的人）。"]}
{"word":"antitonic","summary":{"en":"Antitonic means having the opposite effect of a tonic—tending to weaken or relax rather than strengthen.","zh":"antitonic 指与强壮剂（tonic）作用相反的，倾向于让人变弱或放松。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposing or reducing bodily tone or tonic effects; tending to weaken or relax rather than strengthen.","zh":"抗强壮的；与“补药/强壮剂（tonic）”作用相反的；使机体张力下降、使人无力或放松的。"},"examples":[{"en":"Some sedative medicines can have an antitonic effect, making you feel less energetic.","zh":"一些镇静类药物可能有抗强壮作用，让你感觉更没精神。"},{"en":"The doctor avoided combining a tonic with an antitonic drug.","zh":"医生避免把强壮剂和抗强壮药物一起使用。"}]}],"synonyms":["weakening","relaxing","debilitating","sedative"],"phonetic":"/ˌæn.tiˈtɑːn.ɪk/","extraExplanation":["“antitonic”是一个相当少见、偏医学/生理学语境的词，通常用来描述与“tonic（强壮的、增强机体功能的）”相反的作用：降低体力、降低肌张力或使人更放松。","构词上：anti-（反对、对抗）+ tonic（强壮的/补益的）。日常英语里更常见的表达是“weakening / relaxing / sedative effect（使人变弱/放松/镇静的作用）”。"]}
{"word":"antitorpedo","summary":{"en":"Antitorpedo means “anti-torpedo”: designed to protect against torpedoes, or a device/structure that provides such protection.","zh":"antitorpedo 意为“反鱼雷的/防鱼雷的”，也可指用于防御鱼雷攻击的装置或结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"designed to prevent, reduce, or defend against damage from torpedoes (used especially for naval ships and equipment).","zh":"（尤指军舰与相关装备）用于防止、减轻或抵御鱼雷攻击造成损害的；反鱼雷的。"},"examples":[{"en":"The battleship was fitted with antitorpedo bulges along the hull.","zh":"这艘战列舰在船体两侧加装了反鱼雷鼓包。"},{"en":"Engineers tested antitorpedo protection systems in a controlled blast trial.","zh":"工程师在可控爆炸试验中测试反鱼雷防护系统。"}]},{"partOfSpeech":"n.","definition":{"en":"a protective device or structure intended to defend a ship against torpedoes.","zh":"用于保护军舰免受鱼雷攻击的防护装置或结构。"},"examples":[{"en":"Early designs used an antitorpedo structure to absorb the shock of an underwater explosion.","zh":"早期设计采用反鱼雷结构来吸收水下爆炸的冲击。"},{"en":"The report compared different antitorpedoes used in early 20th-century warships.","zh":"报告对比了20世纪初军舰上使用的不同反鱼雷装置。"}]}],"synonyms":["anti-torpedo","torpedo-resistant","torpedo-proof (informal)"],"phonetic":"/ˌæntiˈtɔrˌpiːdoʊ/","extraExplanation":["“antitorpedo”在现代更常见的写法是“anti-torpedo”（带连字符），多见于海军史、舰船设计与军事技术语境。","常见相关表达包括：anti-torpedo bulge（反鱼雷鼓包）、anti-torpedo net（反鱼雷网，历史上用于港口或停泊舰艇周围）。这些都是为减弱鱼雷爆炸冲击、分散破片或提前引爆而设计的防护手段。"]}
{"word":"antitotalitarian","summary":{"en":"Antitotalitarian means opposed to totalitarian rule or ideology.","zh":"antitotalitarian 意为“反对极权统治或极权思想的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to totalitarianism (a system where the state controls nearly all aspects of public and private life).","zh":"反对极权主义的（极权主义指国家几乎控制公共与私人生活的各个方面）。"},"examples":[{"en":"The writer’s antitotalitarian views shaped his novels and essays.","zh":"这位作家的反极权观点影响了他的小说和随笔。"},{"en":"Many antitotalitarian activists campaigned for free speech and fair elections.","zh":"许多反极权活动人士为言论自由和公平选举而奔走。"}]}],"synonyms":["anti-totalitarian","anti-authoritarian","pro-democracy"],"phonetic":"/ˌænˌtaɪˌtoʊˌtælɪˈtɛriən/","extraExplanation":["这个词由 anti-（反对）+ totalitarian（极权主义的）构成，常见于政治学、历史与评论写作中。","在文学语境里，它常用来描述反对“极权国家/警察国家”式控制的立场。英语世界中，讨论乔治·奥威尔（George Orwell）时经常会用到 antitotalitarian（如谈《一九八四》《动物农场》所表达的思想）。","近义表达包括 anti-authoritarian（反威权）与 pro-democracy（亲民主），但 antitotalitarian 更强调反对“全面控制社会”的极权体制。"]}
{"word":"antitoxic","summary":{"en":"Antitoxic means able to neutralize toxins, often used in medical contexts.","zh":"antitoxic意为“抗毒的/解毒的”，多用于医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to counteract or neutralize toxins (poisons), especially in the body or in medicine.","zh":"能对抗或中和毒素（毒物）的；尤指在人体或医学中具有解毒作用的。"},"examples":[{"en":"The doctor administered an antitoxic serum after the snakebite.","zh":"被蛇咬后，医生注射了抗毒血清。"},{"en":"Some antibodies have an antitoxic effect against bacterial toxins.","zh":"有些抗体对细菌毒素具有抗毒作用。"}]}],"synonyms":["antidotal","detoxifying","antivenomous"],"phonetic":"/ˌæn.tiˈtɑk.sɪk/","extraExplanation":["“antitoxic”常见于医学与生物学语境，常与serum（血清）、antibody（抗体）、effect（作用）等词搭配。","词源上由anti-（反、抗）+ toxic（有毒的）构成；比起日常英语，更偏正式与专业。"]}
{"word":"antitoxin","summary":{"en":"An antitoxin is a medical substance that neutralizes toxins in the body.","zh":"antitoxin 指能在体内中和毒素的医学用抗毒素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A substance (often an antibody) that neutralizes a toxin, especially one produced by bacteria, and is used to prevent or treat poisoning or certain infections.","zh":"抗毒素（通常为抗体）：能中和毒素（尤其是细菌产生的毒素）的物质，用于预防或治疗中毒或某些感染。"},"examples":[{"en":"The doctor gave the patient an antitoxin after a suspected tetanus exposure.","zh":"在怀疑接触破伤风后，医生给病人注射了抗毒素。"},{"en":"Antitoxins can stop a toxin’s effects if they are given early enough.","zh":"如果使用得足够早，抗毒素可以阻止毒素造成的影响。"}]}],"synonyms":["antiserum","antibody (general)","neutralizing antibody"],"phonetic":"/ˌæn.tiˈtɑk.sɪn/","extraExplanation":["“antitoxin”常见于医学语境，尤其与破伤风（tetanus）、白喉（diphtheria）等由细菌外毒素引起的疾病相关。它与“vaccine（疫苗）”不同：抗毒素用于中和已经产生的毒素（偏治疗/紧急预防），而疫苗主要用于让身体提前产生免疫反应（偏预防）。","构词法：anti-（反、对抗）+ toxin（毒素）。在新闻或科普文章里，你也会看到更具体的说法，如“tetanus antitoxin（破伤风抗毒素）”。"]}
{"word":"antitoxine","summary":{"en":"Antitoxine (more commonly spelled antitoxin) is a medicine that neutralizes a specific toxin in the body.","zh":"antitoxine（更常见拼写为 antitoxin）指抗毒素，即用于中和体内特定毒素的药物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medicine (usually an antibody preparation) that neutralizes a specific toxin in the body.","zh":"（通常为抗体制剂的）抗毒素；用于中和体内特定毒素的药物。"},"examples":[{"en":"The doctor gave the patient an antitoxin after a suspected tetanus infection.","zh":"医生在怀疑破伤风感染后给病人注射了抗毒素。"},{"en":"Antitoxins can stop toxins from causing further damage, but they may not reverse damage already done.","zh":"抗毒素可以阻止毒素继续造成伤害，但未必能逆转已经发生的损伤。"}]}],"synonyms":["antitoxin","antiserum"],"phonetic":"/ˌæn.tiˈtɑk.sɪn/","extraExplanation":["“antitoxine”多见于较早期或受法语影响的拼写；现代英语里更常用的标准拼写是 **antitoxin**。","抗毒素与“抗生素（antibiotic）”不同：抗毒素是针对“毒素（toxins）”的中和剂，而抗生素是用来抑制或杀死“细菌（bacteria）”的。"]}
{"word":"antitoxins","summary":{"en":"Antitoxins are substances (usually antibodies) that neutralize toxins in the body.","zh":"抗毒素是（通常为抗体的）物质，用于在体内中和毒素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Substances (often antibodies) that neutralize toxins, especially those produced by bacteria, to prevent or treat poisoning or infectious disease effects.","zh":"抗毒素；（通常是抗体）用来中和毒素，尤其是细菌产生的毒素，以预防或治疗中毒或感染造成的影响。"},"examples":[{"en":"Doctors gave the patient antitoxins to stop the toxin from spreading in the body.","zh":"医生给病人注射抗毒素，以阻止毒素在体内扩散。"},{"en":"Vaccines and antitoxins work differently, but both can protect people from serious illness.","zh":"疫苗和抗毒素的作用方式不同，但都能保护人们免于严重疾病。"}]}],"synonyms":["antibody (in some contexts)","antivenom (specific to venom)","serum (medical context)"],"phonetic":"/ˌæn.tiˈtɑk.sɪnz/","extraExplanation":["“antitoxin”常见于医学语境，尤其与白喉（diphtheria）和破伤风（tetanus）等由细菌毒素引起的疾病有关。抗毒素通常是从免疫动物或人血浆中获得的抗体制剂，用于“中和毒素”，而不是直接杀死细菌。","词形提示：antitoxins 是 antitoxin 的复数。词根 anti- 表示“反、对抗”，toxin 表示“毒素”。"]}
{"word":"antitrade","summary":{"en":"Antitrade most commonly refers to winds that blow opposite the trade winds; more rarely, it can mean “anti-trade,” opposed to trade policies.","zh":"Antitrade 最常指与信风方向相反的“反信风”；较少见时也可指“反贸易的”，即反对某种贸易政策。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Meteorology) blowing in the opposite direction to the trade winds, especially in the upper atmosphere.","zh":"（气象）与信风方向相反的（常指高空的反信风）。"},"examples":[{"en":"Pilots sometimes encounter antitrade winds at higher altitudes over the tropics.","zh":"飞行员在热带上空的较高高度有时会遇到反信风。"},{"en":"The chart shows antitrade flow above the low-level trade winds.","zh":"这张图显示了低层信风之上的反信风气流。"}]},{"partOfSpeech":"adj.","definition":{"en":"opposed to free trade or to a particular kind of trade (rare; usually written with a hyphen: anti-trade).","zh":"反对自由贸易或某种特定贸易的（较少见；常写作 anti-trade）。"},"examples":[{"en":"Some groups take an anti-trade stance on importing endangered-wood products.","zh":"一些团体对进口濒危木材制品持反贸易立场。"},{"en":"The proposal was criticized as anti-trade and harmful to small exporters.","zh":"该提案被批评为反贸易，会伤害小型出口商。"}]},{"partOfSpeech":"n.","definition":{"en":"an antitrade wind (rare; more common: antitrade winds).","zh":"反信风（较少见；更常用复数 antitrade winds）。"},"examples":[{"en":"The report mentions an antitrade over the equatorial Atlantic.","zh":"报告提到赤道大西洋上空出现反信风。"}]}],"synonyms":["anti-trade","counter-trade (meteorology: opposite-direction flow)","antitrade winds"],"phonetic":"/ˌæntiˈtreɪd/","extraExplanation":["“Antitrade / antitrade winds”主要出现在气象与航海语境：近地面热带地区常见的信风一般从东往西吹；而在更高空层，气流往往呈现相反方向（从西往东），因此称为“反信风”。","拼写上常见 antitrade、anti-trade、anti-trades 等变体；在“反对贸易”的一般含义中，英文里更常写作带连字符的 anti-trade。"]}
{"word":"antitrades","summary":{"en":"Antitrades are upper-level tropical winds that blow opposite to the trade winds.","zh":"Antitrades 指热带上空与地表信风方向相反的高空气流。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Upper-level winds in the tropics that blow opposite to the trade winds (often from west to east, above the surface easterly trades).","zh":"（热带）反信风：在高空吹拂、方向与地表信风相反的风（常指高空自西向东、与地表自东向西的信风相对）。"},"examples":[{"en":"Meteorologists described strong antitrades above the Atlantic trade winds.","zh":"气象学家描述了大西洋信风之上存在强劲的反信风。"},{"en":"Sailors noticed that weather patterns changed when the antitrades shifted.","zh":"水手们注意到，当反信风发生移动时，天气形势会随之变化。"}]}],"synonyms":["upper-level westerlies (in the tropics)","return trade winds"],"phonetic":"/ˌæntiˈtreɪdz/","extraExplanation":["“antitrades”通常以复数形式出现，对应单数“antitrade”。这是较偏气象/航海的术语，常与“trade winds（信风）”一起讲：地表多为东风（easterlies），而其上层可能出现方向相反的西风（westerlies），就被称为反信风。"]}
{"word":"antitradition","summary":{"en":"Antitradition means opposing tradition, or a movement/attitude that rejects established customs.","zh":"Antitradition 指“反传统的”，也可指“反传统的立场或倾向”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to tradition; rejecting established customs, beliefs, or ways of doing things.","zh":"反传统的；反对或拒绝既有习俗、信念或做事方式的。"},"examples":[{"en":"Her antitradition attitude surprised her grandparents, who value old customs.","zh":"她的反传统态度让重视老习俗的祖父母很惊讶。"},{"en":"The designer became known for an antitradition style that breaks the usual rules.","zh":"这位设计师以打破常规的反传统风格而出名。"}]},{"partOfSpeech":"n.","definition":{"en":"A stance, movement, or tendency that opposes tradition.","zh":"反传统立场；反传统的倾向或运动。"},"examples":[{"en":"In the 1960s, antitradition appeared in music, fashion, and social values.","zh":"在20世纪60年代，反传统在音乐、时尚和社会价值观中都有体现。"},{"en":"The novel explores the tension between tradition and antitradition in a small town.","zh":"这部小说探讨了小镇上“传统”与“反传统”之间的张力。"}]}],"synonyms":["anti-traditional","against tradition","iconoclastic","nonconformist"],"phonetic":"/ˌæn.taɪ.trəˈdɪʃ.ən/","extraExplanation":["“anti-”是常见前缀，表示“反对、对立”。因此 antitradition 直译为“反传统”。","拼写上常见两种：anti-tradition（更清晰、较常见）和 antitradition（较少见）。写正式文章时可优先用带连字符的形式。","语气上它通常比 nontraditional（“非传统的”）更强烈：nontraditional 只是“不按传统方式”，而 antitradition 更强调“反对传统本身”。"]}
{"word":"antitraditional","summary":{"en":"Antitraditional means against tradition or not following traditional ways.","zh":"antitraditional 指“反传统的；不按传统方式的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to traditional ideas, customs, styles, or ways of doing things; favoring change or new approaches.","zh":"反传统的；反对传统观念、习俗或做事方式的；倾向于新方法的。"},"examples":[{"en":"Her art is deliberately antitraditional, rejecting classic techniques.","zh":"她的艺术刻意反传统，拒绝使用经典技法。"},{"en":"The band’s antitraditional sound surprised longtime fans.","zh":"这支乐队反传统的风格让老粉丝很意外。"},{"en":"Some students take an antitraditional view of education and prefer self-directed learning.","zh":"一些学生对教育持反传统观点，更偏好自主学习。"}]}],"synonyms":["nontraditional","unconventional","antiestablishment","innovative"],"phonetic":"/ˌæntiˈtrəˌdɪʃənəl/","extraExplanation":["“anti-”是常见前缀，表示“反对、对抗”。“antitraditional”也常写作“anti-traditional”。它通常描述一种态度或风格（例如艺术、时尚、观念），语气多为中性；在不同语境中可能带有褒义（创新）或贬义（不尊重传统）。"]}
{"word":"antitraditionalist","summary":{"en":"Antitraditionalist refers to someone (or something) that opposes traditional ideas, customs, or styles.","zh":"Antitraditionalist 指（人或事物）反对传统观念、习俗或风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who opposes traditional ideas, customs, or styles, especially in art, culture, religion, or politics.","zh":"反传统主义者；反对传统观念、习俗或风格的人（常见于艺术、文化、宗教或政治语境）。"},"examples":[{"en":"The antitraditionalist criticized the ceremony as outdated and meaningless.","zh":"这位反传统主义者批评这场仪式过时而且没有意义。"},{"en":"In the 1960s, many young antitraditionalists challenged social rules and dress codes.","zh":"在20世纪60年代，许多年轻的反传统主义者挑战社会规范和着装规定。"}]},{"partOfSpeech":"adj.","definition":{"en":"Opposing or rejecting traditional beliefs, customs, or styles.","zh":"反传统的；拒绝或反对传统信念、习俗或风格的。"},"examples":[{"en":"Her antitraditionalist approach to teaching encourages students to question old methods.","zh":"她反传统的教学方式鼓励学生质疑旧方法。"},{"en":"The novel has an antitraditionalist tone, poking fun at rigid social etiquette.","zh":"这部小说带有反传统的语气，讽刺僵化的社交礼仪。"}]}],"synonyms":["nontraditional","unconventional","iconoclastic","antiestablishment"],"phonetic":"/ˌæntiˌtrəˈdɪʃənəlɪst/","extraExplanation":["构词理解：anti- 表示“反对”，traditional 表示“传统的”，-ist 常指“某种立场/主义的人”。所以 antitraditionalist 直译就是“反传统的人/反传统的”。","语用提示：它常用于描述对“传统权威”或“旧规矩”的反对立场，语气可中性也可带批评；如果想更中性，可以用 nontraditional（非传统的）或 unconventional（非传统的/不按常规的）。"]}
{"word":"antitraditionally","summary":{"en":"“Antitraditionally” means doing something in a way that opposes or rejects tradition.","zh":"“antitraditionally”表示“以反传统的方式”，即做事方式与传统或惯例相对立。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that goes against tradition or conventional customs.","zh":"以反传统的方式；以违背惯例或传统习俗的方式。"},"examples":[{"en":"She designed the wedding antitraditionally, skipping the formal ceremony and hosting a casual picnic instead.","zh":"她以反传统的方式筹办婚礼，跳过了正式仪式，改成轻松的野餐聚会。"},{"en":"The artist antitraditionally mixed classical techniques with street art to challenge viewers’ expectations.","zh":"这位艺术家以反传统的方式把古典技法与街头艺术混合，挑战观众的预期。"}]}],"synonyms":["nontraditionally","unconventionally","against tradition","in a nontraditional way"],"phonetic":"/ˌæntiˈtrædɪʃənəli/","extraExplanation":["“antitraditionally”由前缀 anti-（反对）+ traditionally（传统地）构成，属于较少见、偏书面或评论性的用词。日常表达里更常用 “in a nontraditional way / against tradition / unconventionally”。"]}
{"word":"antitragal","summary":{"en":"Antitragal means “related to the antitragus,” a small cartilage bump on the outer ear opposite the tragus.","zh":"antitragal 指“与对耳屏有关的”，对耳屏是外耳上与耳屏相对的一小块软骨隆起。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the antitragus (a small rounded bump of cartilage on the outer ear, opposite the tragus).","zh":"与“对耳屏”（外耳上与耳屏相对的一小块圆隆软骨突起）有关的；对耳屏的。"},"examples":[{"en":"The piercing studio refused to do an antitragal piercing because of my ear shape.","zh":"穿孔工作室因为我的耳型，拒绝给我做对耳屏（antitragal）穿孔。"},{"en":"The doctor noted mild swelling in the antitragal area of the ear.","zh":"医生记录到耳朵对耳屏区域有轻微肿胀。"}]}],"synonyms":["antitragic (less common)"],"phonetic":"/ˌæn.tiˈtreɪ.ɡəl/","extraExplanation":["“Antitragal”是解剖学/医学用语，来自 antitragus（对耳屏）+ -al（“……的/与……有关的”形容词后缀）。日常英语里很少单独使用，更多出现在耳部解剖描述、临床记录，或“antitragal piercing（对耳屏穿孔）”等语境中。","对耳屏（antitragus）位于耳廓下部、耳屏（tragus）对面，靠近耳垂上方；常用于描述疼痛点、红肿范围或穿孔位置。"]}
{"word":"antitragi","summary":{"en":"Antitragi refers to the antitragus—small cartilage bumps on the outer ear opposite the tragus (often discussed in anatomy or ear piercings).","zh":"Antitragi 指 antitragus（耳对屏）的复数/相关形式：外耳上与耳屏相对的小软骨隆起（常见于解剖或耳部穿孔话题）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy) A small bump of cartilage on the outer ear, opposite the tragus, just above the earlobe.","zh":"（解剖）外耳上一块小的软骨隆起，位于耳屏（tragus）的对侧、耳垂上方。"},"examples":[{"en":"The piercing studio said an antitragi piercing may take longer to heal than an earlobe piercing.","zh":"穿孔店说，耳对屏（antitragi）穿孔可能比耳垂穿孔愈合更慢。"},{"en":"The doctor examined the antitragi area for redness and swelling.","zh":"医生检查了耳对屏区域是否有发红和肿胀。"}]}],"synonyms":["antitragus","antitraguses"],"phonetic":"/ˌæn.tiˈtreɪ.ɡəs/","extraExplanation":["“antitragi”本身较少作为标准词条出现，通常是“antitragus”的复数形式（antitragi = antitraguses / antitragi），或是对“antitragus”的拼写误写。在解剖学与穿孔（piercing）语境里，更常见的是单数“antitragus”。","词根提示：anti- 表示“相对、对着”，tragus 指耳屏；因此 antitragus 字面意思是“与耳屏相对的部位”。"]}
{"word":"antitragic","summary":{"en":"Antitragic describes something that goes against a tragic tone or outcome, especially in literature or drama.","zh":"Antitragic 指“反悲剧的”，尤用于文学或戏剧中，表示不走悲剧情绪或结局。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to tragedy in tone, meaning, or artistic effect; tending to avoid or cancel tragic suffering (often in literature, drama, or criticism).","zh":"（语气、意义或艺术效果上）反悲剧的；倾向于回避、削弱或抵消悲剧式痛苦的（常用于文学、戏剧或评论中）。"},"examples":[{"en":"The director chose an antitragic ending so the audience would leave with relief rather than despair.","zh":"导演选择了一个反悲剧的结局，让观众带着宽慰而不是绝望离场。"},{"en":"Some critics call the novel antitragic because it turns misfortune into dark humor.","zh":"一些评论家称这部小说为反悲剧的，因为它把不幸转化成了黑色幽默。"},{"en":"Her antitragic outlook makes her focus on recovery and resilience after loss.","zh":"她反悲剧的看法让她在失去之后更关注复原与韧性。"}]}],"synonyms":["nontragic","untragic","comic","uplifting","redemptive"],"phonetic":"/ˌæntaɪˈtrædʒɪk/","extraExplanation":["“antitragic”多见于文学/戏剧批评语境，用来形容作品不按传统悲剧逻辑走：例如用喜剧化处理、提供修复与和解、或让悲剧后果被稀释。日常口语里较少用，更常见的表达是“not tragic”“more comic than tragic”“uplifting”等。"]}
{"word":"antitragicus","summary":{"en":"Antitragicus is a rare, formal word meaning “anti-tragic”: opposing tragedy or reducing a tragic effect; it can also refer to someone or something that argues against tragedy.","zh":"antitragicus 是一个罕见的正式用词，意思是“反悲剧的”：反对悲剧或减弱悲剧效果；也可指反对悲剧的人或作品。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, formal) Opposed to tragedy or tragic style; intended to counter, prevent, or “undo” tragic effect.","zh":"（罕见、正式）反悲剧的；与悲剧或悲剧风格相对的；旨在抵消、避免或“化解”悲剧效果的。"},"examples":[{"en":"The author described the final chapter as antitragicus, turning grief into reconciliation.","zh":"作者把最后一章称为“反悲剧的”，把悲伤转向和解。"},{"en":"Some critics read the play’s humor as an antitragicus device to soften the darkest scenes.","zh":"一些评论家认为剧中的幽默是一种“反悲剧”的手法，用来缓和最黑暗的场景。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or work that argues against tragedy (especially as a literary mode) or tries to oppose tragic outcomes.","zh":"（罕见）反对悲剧（尤其作为文学体裁）的人或作品；试图对抗悲剧结局者/物。"},"examples":[{"en":"In his essays, he positions himself as an antitragicus, insisting that art should offer hope.","zh":"在随笔里，他把自己定位为“反悲剧者”，坚持艺术应当提供希望。"}]}],"synonyms":["anti-tragic","nontragic","counter-tragic","tragicomical (context-dependent)"],"phonetic":"ˌæn.taɪˈtrædʒ.ɪ.kəs","extraExplanation":["这个词非常少见，更多像是学术场合或拉丁化的造词。词形可拆为 anti-（反、对抗）+ tragic(us)（悲剧的），整体表达“反悲剧/对抗悲剧”的意味。","如果你是在某本书名、论文标题或古典/新拉丁文本中看到 antitragicus，它也可能是作者刻意使用的拉丁语风格词；具体含义最好结合上下文（例如是在讨论戏剧体裁、叙事结局，还是修辞效果）。"]}
{"word":"antitragus","summary":{"en":"A cartilage bump on the outer ear opposite the tragus, just above the earlobe.","zh":"外耳上与耳屏相对、位于耳垂上方的一小块软骨突起。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small bump of cartilage on the outer ear, located above the earlobe and opposite the tragus (near the ear canal).","zh":"外耳上的一小块软骨突起，位于耳垂上方、与耳屏（tragus）相对，靠近耳道入口处。"},"examples":[{"en":"The piercer marked a spot on the antitragus for a cartilage piercing.","zh":"穿孔师在耳对耳屏（antitragus）处做了标记，准备打软骨穿孔。"},{"en":"In the diagram, the antitragus sits just above the earlobe.","zh":"在图示中，耳对耳屏位于耳垂的正上方。"}]}],"synonyms":["anti-tragus"],"phonetic":"/ˌæn.tiˈtreɪ.ɡəs/","extraExplanation":["“antitragus”由“anti-”（对、相对）+“tragus”（耳屏）组成，意思是“与耳屏相对的结构”。","它是外耳（耳廓）的一部分，常出现在解剖学、耳科医疗、以及“软骨耳钉/耳洞（cartilage piercing）”等语境中。"]}
{"word":"antitraguses","summary":{"en":"“Antitraguses” is the plural form of “antitragus,” a small cartilage bump on the outer ear opposite the tragus.","zh":"“Antitraguses” 是 “antitragus（对耳屏）” 的复数，指外耳上与耳屏相对的一小块软骨突起。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of antitragus: small rounded bumps of cartilage on the outer ear, opposite the tragus and just above the earlobe.","zh":"antitragus 的复数：外耳（耳廓）上一对小的圆形软骨突起，位于耳屏（tragus）的对侧、耳垂上方。"},"examples":[{"en":"Some people have more prominent antitraguses than others.","zh":"有些人的 antitraguses（对耳屏）比其他人更明显。"},{"en":"The piercer avoided the antitraguses while marking the ear.","zh":"穿孔师在耳朵做标记时避开了对耳屏的位置。"}]}],"synonyms":["antitragi (less common plural)","antitragus (singular form)"],"phonetic":"/ænˈtɪtrəɡəsɪz/","extraExplanation":["“Antitragus/antitragus” 是解剖学用语，日常英语里更常说 “the outer ear cartilage”（外耳软骨）或直接说 “this part of the ear”。","词源上 anti- 表示“对/相对”，tragus 指“耳屏”；antitragus 就是“与耳屏相对的那块（软骨）”。"]}
{"word":"antitreponemal","summary":{"en":"Antitreponemal means ‘acting against treponemes,’ especially the bacterium that causes syphilis.","zh":"antitreponemal 指“抗螺旋体的”，尤指对导致梅毒的梅毒螺旋体有效。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to act against treponemes (spiral-shaped bacteria), especially Treponema pallidum, which causes syphilis.","zh":"抗螺旋体的；能对抗螺旋体（尤其是导致梅毒的梅毒螺旋体 Treponema pallidum）的。"},"examples":[{"en":"Penicillin is the first-line antitreponemal treatment for syphilis.","zh":"青霉素是治疗梅毒的一线抗螺旋体药物。"},{"en":"The patient received antitreponemal therapy after the diagnosis was confirmed.","zh":"确诊后，患者接受了抗螺旋体治疗。"},{"en":"The lab report mentioned an antitreponemal antibody test.","zh":"化验报告提到了抗螺旋体抗体检测。"}]}],"synonyms":["anti-treponemal","antisyphilitic (context-dependent)"],"phonetic":"/ˌæn.ti.trəˈpiː.nə.məl/","extraExplanation":["这是医学/检验学用词，最常见于“antitreponemal therapy（抗螺旋体治疗）”和“antitreponemal test/antibody（抗螺旋体检测/抗体）”。在梅毒筛查中常见“treponemal tests（梅毒螺旋体特异性试验）”与“nontreponemal tests（非梅毒螺旋体特异性试验，如 RPR、VDRL）”的区分；前者更“特异”，后者常用于随访疗效。"]}
{"word":"antitrinitarian","summary":{"en":"Antitrinitarian describes a person or view that rejects the Christian doctrine of the Trinity.","zh":"Antitrinitarian 指反对或不接受基督教“三位一体”教义的人或观点。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Adj.) Opposed to the Christian doctrine of the Trinity (the belief that God is one being in three persons: Father, Son, and Holy Spirit).","zh":"（形容词）反对基督教“三位一体”教义的（即上帝为一体三位：圣父、圣子、圣灵）。"},"examples":[{"en":"Some early Christian groups held antitrinitarian views.","zh":"一些早期基督教群体持有反三位一体的观点。"},{"en":"The article discusses antitrinitarian debates in the Reformation era.","zh":"这篇文章讨论了宗教改革时期关于反三位一体的争论。"}]},{"partOfSpeech":"n.","definition":{"en":"(N.) A person who rejects or does not accept the doctrine of the Trinity.","zh":"（名词）反三位一体者；不接受“三位一体”教义的人。"},"examples":[{"en":"He was labeled an antitrinitarian by his opponents.","zh":"他的对手把他贴上“反三位一体者”的标签。"},{"en":"In some periods, antitrinitarians faced punishment for their beliefs.","zh":"在某些时期，反三位一体者因其信仰而遭受惩罚。"}]}],"synonyms":["nontrinitarian","anti-Trinitarian","Unitarian (context-dependent)"],"phonetic":"/ˌæn.tiˌtrɪn.ɪˈtɛr.i.ən/","extraExplanation":["这个词常用于宗教史、神学讨论或学术写作中，语气可能较为“分类/标签化”。在现实交流里，若谈及具体群体，使用对方自称（例如 Unitarian、Oneness Pentecostal 等）通常更尊重也更准确。","构词：anti-（反对）+ Trinitarian（三位一体论者/三位一体的）。因此它既可作形容词，也可作名词。","历史上，“反三位一体”立场在不同地区与时期常被视为异端，相关人物与运动在宗教改革前后尤其常见；阅读史料时要注意当时政治与宗教权力对用词的影响。"]}
{"word":"antitrismus","summary":{"en":"A medical term for a remedy or treatment that prevents or relieves trismus (lockjaw).","zh":"医学用语：指预防或缓解牙关紧闭（锁颌）的药物或治疗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medicine or treatment used to prevent or relieve trismus (lockjaw), especially muscle spasm that makes it hard to open the mouth","zh":"抗牙关紧闭（锁颌）药；用于预防或缓解牙关紧闭（张口困难、咀嚼肌痉挛）的药物或治疗"},"examples":[{"en":"The doctor prescribed an antitrismus medication to reduce the jaw spasm.","zh":"医生开了抗牙关紧闭的药来减轻下颌痉挛。"},{"en":"After the dental procedure, they monitored for signs of trismus and discussed possible antitrismus treatment.","zh":"牙科手术后，他们观察是否出现牙关紧闭的迹象，并讨论可能的抗牙关紧闭治疗。"}]}],"synonyms":["treatment for trismus","antispasmodic (in some contexts)","muscle relaxant (in some contexts)"],"phonetic":"/ˌæn.tiˈtrɪz.məs/","extraExplanation":["这是一个较少见、偏医学/牙科用语的词，来自 anti-（“反、对抗”）+ trismus（“牙关紧闭”）。日常英语里更常见的说法是 “treatment for trismus / to relieve trismus”（缓解牙关紧闭的治疗）。","trismus 常见于牙科感染、拔牙或放疗后、破伤风（tetanus）等情况。是否需要用药或其他处理应由医生评估。"]}
{"word":"antitrochanter","summary":{"en":"A pelvic bony projection in birds that supports/stabilizes the hip by contacting the femur’s trochanter.","zh":"鸟类骨盆上的骨性突起，通过与股骨转子接触来支撑并稳定髋关节。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy, mainly in birds) A bony projection on the pelvis (ilium) that articulates with the femur’s trochanter, helping stabilize the hip joint.","zh":"（解剖学，主要见于鸟类）骨盆（髂骨）上的一种骨性突起，与股骨的转子部位相接触/关节连接，用于稳定髋关节。"},"examples":[{"en":"In many birds, the antitrochanter helps keep the hip stable during walking and landing.","zh":"在许多鸟类中，antitrochanter 有助于在行走和着陆时保持髋部稳定。"},{"en":"The skeleton diagram labels the antitrochanter near the hip, just above the femur.","zh":"骨骼示意图在髋部、股骨上方标注了 antitrochanter。"}]}],"synonyms":["pelvic antitrochanter"],"phonetic":"/ˌæn.tiˈtrɑː.kæn.tɚ/","extraExplanation":["该词多用于鸟类骨骼学与古生物学研究；在人类解剖学里不常见。","构词上可理解为 anti-（对向/相对）+ trochanter（转子），表示“与转子相对配合的结构”。"]}
{"word":"antitropal","summary":{"en":"“Antitropal” is a rare adjective meaning “opposite a tropic on the globe; corresponding to a tropic in the other hemisphere.”","zh":"antitropal 是个罕见形容词，指“在地球上与某条回归线相对、在另一半球对应的位置/区域的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Located or occurring opposite a tropic (Cancer or Capricorn) on the globe; related to the region that corresponds to a tropic in the opposite hemisphere.","zh":"（地理）位于地球上某条回归线（北回归线或南回归线）在另一半球对应位置的；与“回归线对侧对应区域”有关的。"},"examples":[{"en":"Some older geography texts mention the antitropal latitude corresponding to the Tropic of Cancer in the Southern Hemisphere.","zh":"一些较早的地理教材会提到与北回归线在南半球对应的“antitropal（回归线对侧对应的）纬度”。"},{"en":"The island lies near an antitropal position relative to the opposite tropic, though the term is rarely used today.","zh":"这个岛大致位于与另一半球回归线相对应的 antitropal 位置附近，不过这个词如今很少用。"}]}],"synonyms":["antitropic","opposite-tropical","corresponding (in the opposite hemisphere)"],"phonetic":"/ˌæn.tiˈtroʊ.pəl/","extraExplanation":["词形上由 anti-（“相对、对立”）+ tropal（与回归线/热带相关）构成，意思类似“与回归线在地球另一侧对应的”。","这是非常罕见的词，多见于较旧或较专业的地理/天文语境；现代更常用 antitropic、opposite tropical latitude，或直接说 “the corresponding latitude in the opposite hemisphere”。"]}
{"word":"antitrope","summary":{"en":"Antitrope is a rare rhetorical term for using a word in the opposite of its usual sense, often for irony or satire.","zh":"Antitrope 是较少见的修辞术语，指用词语表达与其通常意义相反的意思，常用于反讽或讽刺。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rhetoric) A figure of speech in which a word or expression is used in a sense opposite to its usual meaning (similar to ironic reversal).","zh":"（修辞）反语式用法：用词语表达与其通常意义相反的意思（类似讽刺性的反转）。"},"examples":[{"en":"Calling a very slow worker “Speedy” can be an antitrope.","zh":"把动作很慢的人叫作“快手”，可以算作一种 antitrope（反语式反转）。"},{"en":"In satirical writing, antitrope often creates humor by saying the opposite of what is meant.","zh":"在讽刺写作里，antitrope 常通过“说反话”来制造幽默效果。"}]}],"synonyms":["antiphrasis","irony","verbal irony"],"phonetic":"/ˈæn.tiˌtroʊp/","extraExplanation":["这个词非常少见，多见于修辞学/文体学讨论中；在日常英语里更常用的说法是 “irony（反讽）”、或更具体的 “antiphrasis（反语）”。","词源上可理解为 anti-（相反）+ trope（修辞手法、比喻用法）。在文学里常见于讽刺（satire）与挖苦（sarcasm）语境。"]}
{"word":"antitropic","summary":{"en":"Antitropic describes something occurring on both sides of the tropics (temperate north and south) but not in the tropics; less commonly, it can mean moving/growing opposite to a tropic response.","zh":"Antitropic 指在南北半球温带都有、但在热带缺乏的“反热带式”分布；较少见时也可指与向性反应相反、远离刺激的运动/生长。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biogeography) Found in temperate regions of both the Northern and Southern Hemispheres but absent (or rare) in the tropics; having an “anti-tropical” distribution.","zh":"（生物地理学）分布于南、北半球的温带地区，但在热带缺乏（或很少）；具有“反热带式”分布。"},"examples":[{"en":"Some seabirds show an antitropic distribution, living in cool waters north and south of the equator.","zh":"一些海鸟呈现反热带式分布，生活在赤道以北和以南的冷水海域。"},{"en":"The study compared antitropic species pairs from both hemispheres.","zh":"这项研究比较了来自两个半球的反热带式物种对。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Biology, less common) Turning, growing, or moving in a direction opposite to a tropic response; directed away from a stimulus.","zh":"（生物学，较少见）与向性反应方向相反的；朝远离刺激的方向转向、生长或移动的。"},"examples":[{"en":"In some conditions, roots may show an antitropic response to light and grow away from it.","zh":"在某些条件下，根可能对光表现出反向性反应，朝远离光的方向生长。"}]}],"synonyms":["antitropical","anti-tropical","anti-tropic"],"phonetic":"/ˌæntiˈtrɑpɪk/","extraExplanation":["“antitropic”是较少见的学术用词，最常见于生物地理学写作中，常与“distribution（分布）”搭配；很多文献也会写作“anti-tropical”或用更常见的形容词“antitropical”。","在进化与气候历史讨论里，“反热带式分布”常用来解释：某些类群在赤道两侧的温带相似环境中出现，但在热带可能因温度、洋流或生态竞争而缺席。"]}
{"word":"antitropical","summary":{"en":"Antitropical describes species found in temperate/subtropical zones of both hemispheres but not in the tropics.","zh":"Antitropical 指物种在南北半球温带/亚热带都有分布，但在热带区缺失的一种分布格局。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(In biology/biogeography) describing a distribution pattern where related species or populations live in temperate or subtropical regions of both hemispheres but are absent or rare in the tropical zone between them.","zh":"（生物学/生物地理学）指一种“反热带”分布格局：近缘物种或种群分别分布在南、北半球的温带或亚热带地区，但在中间的热带地区缺失或很少见。"},"examples":[{"en":"Some marine fishes show an antitropical distribution, occurring in both the North Pacific and the South Pacific but not near the equator.","zh":"一些海洋鱼类呈现反热带分布：在北太平洋和南太平洋都有分布，但在赤道附近却没有。"},{"en":"Researchers used genetic data to test whether the species’ antitropical range resulted from past climate change.","zh":"研究人员用遗传数据检验该物种的反热带分布是否由过去的气候变化造成。"}]}],"synonyms":["antitropical distribution","antitropical pattern"],"phonetic":"/ˌæn.tiˈtrɑː.pɪ.kəl/","extraExplanation":["词形拆解：anti-（反、对立）+ tropical（热带的）。这里的“anti-”不是“反对热带”，而是指“与热带相对”的分布格局。","常见语境：多见于学术写作（生态学、海洋生物学、进化生物学）。日常英语里很少用。","常见成因假说（简述）：可能与冰期/气候变化导致物种向赤道以外迁移、海流与温度带限制、或曾经跨越热带后在热带灭绝等过程有关。","相关术语对比：tropical（热带的）；temperate（温带的）；bipolar distribution（两极分布，强调更靠近极地）；disjunct distribution（间断分布，强调中间断开但不特指热带）。"]}
{"word":"antitropous","summary":{"en":"Antitropous means “inverted/turned opposite” in botany, describing an ovule whose micropyle lies opposite the hilum.","zh":"antitropous 在植物学中指“反向/倒生”的胚珠：珠孔位置与种脐相对。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Turned or curved so that the ovule becomes inverted, with the micropyle positioned opposite the hilum (the scar where the seed was attached).","zh":"（植物学）反向（倒生）的；指胚珠弯曲或翻转，使珠孔（micropyle）位于与种脐（hilum，种子与胎座连接处的疤痕）相对的一端。"},"examples":[{"en":"In many flowering plants, the ovule is described as antitropous in its orientation.","zh":"在许多被子植物中，胚珠的方向常被描述为 antitropous（反向/倒生）。"},{"en":"Microscopic study showed an antitropous ovule, with the micropyle facing away from the hilum.","zh":"显微观察显示该胚珠为 antitropous（倒生），珠孔朝向远离种脐的一侧。"}]}],"synonyms":["inverted (botanical sense)","reversed (orientation)","anatropous (related, often-used term in ovule orientation)"],"phonetic":"/ˌæn.tɪˈtroʊ.pəs/","extraExplanation":["antitropous 是一个偏专业的植物学术语，多用于描述“胚珠（ovule）的姿态/方向”。学习时可把它和其他胚珠类型一起记：例如 anatropous（常见的“倒生胚珠”，胚珠反转约 180°）、orthotropous/atropous（直生）、campylotropous（弯生）等。不同教材对术语的细分与使用频率可能略有差异，建议结合配图理解珠孔（micropyle）、种脐（hilum）与珠柄（funiculus）的位置关系。"]}
{"word":"antitropy","summary":{"en":"Antitropy means a tendency to move or grow away from a stimulus; more rarely, it can refer to reversible switching between two forms of a substance.","zh":"Antitropy 指“远离刺激的趋向/反应”；较少见时也可指物质两种形态之间可逆的相互转变关系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) A response in which an organism, cell, or plant organ grows or moves away from a stimulus (the opposite of a tropism toward something).","zh":"（生物）一种反应：生物体、细胞或植物器官的生长或运动方向远离某种刺激（与“朝向刺激的向性”相反）。"},"examples":[{"en":"Some roots show antitropy to light, growing away from brighter areas.","zh":"有些根对光表现出反向性，朝较暗处生长。"},{"en":"The larvae’s antitropy to heat helped them avoid the hottest surface.","zh":"幼虫对热的反向反应帮助它们避开最热的表面。"}]},{"partOfSpeech":"n.","definition":{"en":"(Chemistry/Materials, rare) A relationship in which a substance can exist in two forms that can reversibly change into each other under different conditions (often discussed in polymorphism).","zh":"（化学/材料，较少见）指一种关系：同一物质可存在两种形态，并能在不同条件下可逆地相互转变（常在“多晶型”讨论中出现）。"},"examples":[{"en":"The paper described antitropy between two crystal forms across a temperature range.","zh":"论文描述了两种晶型在某一温度范围内的可逆转变关系。"}]}],"synonyms":["negative tropism","avoidance response","(rare) enantiotropy"],"phonetic":"/ˌænˈtɪtrəpi/","extraExplanation":["“antitropy”在现代英文里非常少见，生物学语境中更常用的说法是“negative tropism（负向性）”“avoidance response（回避反应）”。","材料/晶体学里更常见的术语是“enantiotropy（可逆多晶型关系）”与“monotropy（单向/不可逆关系）”。因此读到“antitropy”时，最好结合上下文判断作者想表达的是“负向性”还是“可逆晶型关系”。"]}
{"word":"antitrust","summary":{"en":"Antitrust refers to laws and actions that prevent monopolies and unfair cooperation, keeping market competition fair.","zh":"Antitrust 指反垄断法律与执法，用来防止垄断与不公平合谋，维持市场公平竞争。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Laws and government actions that prevent companies from becoming too powerful (for example, by stopping monopolies or unfair cooperation) so competition stays fair.","zh":"反垄断（法）：政府用来防止企业权力过大（如形成垄断或不公平合谋），以维持公平竞争的法律与执法行动。"},"examples":[{"en":"The government launched an antitrust investigation into the tech company.","zh":"政府对这家科技公司发起了反垄断调查。"},{"en":"Antitrust laws are meant to protect consumers by encouraging competition.","zh":"反垄断法旨在通过促进竞争来保护消费者。"},{"en":"The merger was blocked on antitrust grounds.","zh":"这次合并因反垄断原因被阻止。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to laws or actions that prevent monopolies and other unfair restraints on competition.","zh":"反垄断的；与防止垄断及其他限制竞争的不正当行为相关的。"},"examples":[{"en":"The company hired antitrust lawyers to review the deal.","zh":"公司聘请反垄断律师来审查这笔交易。"},{"en":"They faced antitrust penalties for price-fixing.","zh":"他们因价格串通而面临反垄断处罚。"}]}],"synonyms":["competition law","anti-monopoly"],"phonetic":"/ˌæntiˈtrʌst/","extraExplanation":["“Antitrust”在美国语境中很常见：核心是反对“trust”（托拉斯，一种历史上的企业联合/垄断形式）。19世纪末美国出现大型托拉斯后，政府通过《谢尔曼反托拉斯法》(Sherman Antitrust Act, 1890)等法律来打击垄断与串通。","常见搭配：antitrust investigation（反垄断调查）、antitrust enforcement（反垄断执法）、antitrust regulator（反垄断监管机构）、on antitrust grounds（基于反垄断理由）。","相关概念对比：monopoly（垄断，一家公司独占市场）、price-fixing（价格串通）、cartel（卡特尔/企业联盟）、merger review（并购审查）。"]}
{"word":"antitrust law","summary":{"en":"laws that prevent monopolies and protect fair competition","zh":"防止垄断、维护公平竞争的法律"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Laws and legal rules designed to prevent unfair competition, especially by stopping monopolies, price-fixing, or other practices that reduce competition in a market.","zh":"反垄断法：旨在防止不正当竞争的法律规则，尤其用来制止垄断、串通定价等削弱市场竞争的行为。"},"examples":[{"en":"The company was investigated under antitrust law for alleged price-fixing.","zh":"这家公司因涉嫌串通定价而接受反垄断法调查。"},{"en":"Antitrust law aims to protect consumers by keeping markets competitive.","zh":"反垄断法旨在通过维持市场竞争来保护消费者。"},{"en":"The merger was blocked because regulators said it would violate antitrust law.","zh":"这项合并被叫停，因为监管机构称它会违反反垄断法。"}]}],"synonyms":["competition law","antimonopoly law","antitrust regulation","fair competition law"],"phonetic":"/ˌæn.tiˈtrʌst lɔ/","extraExplanation":["在美国语境里，antitrust law 常与《谢尔曼法》（Sherman Act, 1890）、《克莱顿法》（Clayton Act, 1914）和联邦贸易委员会法（FTC Act, 1914）相关。","在欧盟更常说 competition law（竞争法），但两者核心目标相近：防止市场力量被滥用、维护公平竞争。","常见关注点包括：垄断（monopoly）、合并审查（merger review）、滥用市场支配地位（abuse of dominance）、横向串通/卡特尔（cartel）、纵向限制（vertical restraints）。"],"etymology":"由 anti-（“反、对抗”）+ trust（原指19世纪美国的大型企业托拉斯/企业联合体）组成；“反托拉斯法”最初针对托拉斯式垄断组织，后来泛指所有反垄断竞争法律。","mnemonic":["anti- = “反”，trust 可联想到“托拉斯（垄断联合体）”，合起来就是“反托拉斯/反垄断”。","记成“反 + 垄断大公司联盟（trust）”，用法律去“反”它。"]}
{"word":"antitruster","summary":{"en":"An antitruster is someone who supports or enforces antitrust (anti-monopoly) laws to protect competition.","zh":"antitruster 指支持或执行反托拉斯（反垄断）法律、主张防止垄断以保护市场竞争的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who supports or enforces antitrust laws (rules that prevent companies from becoming unfairly powerful through monopolies or anti-competitive behavior).","zh":"反托拉斯支持者或执行者；支持或推动反垄断法律的人（防止企业通过垄断或不正当竞争获得过度权力）。"},"examples":[{"en":"Many antitrusters argued that the merger would reduce competition and raise prices.","zh":"许多反托拉斯人士认为这次合并会减少竞争并抬高价格。"},{"en":"As an antitruster, she pushed for stronger rules to limit monopoly power.","zh":"作为反托拉斯支持者，她推动更严格的规定来限制垄断力量。"}]}],"synonyms":["antitrust advocate","trustbuster","competition regulator"],"phonetic":"/ˌæntiˈtrʌstɚ/","extraExplanation":["“Antitruster”主要见于美国政治与法律语境，和“antitrust（反托拉斯/反垄断）”紧密相关。美国的反托拉斯传统可追溯到《谢尔曼反托拉斯法》（Sherman Antitrust Act, 1890），常用来讨论对大型企业合并、定价合谋、市场支配地位等行为的监管。","在现代新闻中，更常见的说法是“antitrust advocate”（反垄断倡导者）、“antitrust enforcer”（反垄断执法者）或直接说“regulator”（监管者）。“Antitruster”带有较明显的立场色彩，强调“反对垄断、支持拆分或强监管”的态度。"]}
{"word":"antitrypsin","summary":{"en":"Antitrypsin is a blood protein that inhibits trypsin-like enzymes and helps protect tissues, especially the lungs.","zh":"抗胰蛋白酶是一种血液蛋白，可抑制胰蛋白酶样酶的作用，保护组织（尤其是肺部）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a protein in the blood that protects tissues by blocking (inhibiting) enzymes like trypsin; it helps prevent the body’s own enzymes from damaging organs, especially the lungs.","zh":"一种存在于血液中的蛋白质，可抑制（阻断）胰蛋白酶等酶的作用，帮助防止人体自身的酶损伤组织，尤其是肺部。"},"examples":[{"en":"Doctors measured her antitrypsin level to check whether her lungs were being protected properly.","zh":"医生测量了她的抗胰蛋白酶水平，以检查她的肺部是否得到了适当保护。"},{"en":"Low antitrypsin can increase the risk of early lung disease.","zh":"抗胰蛋白酶偏低可能会增加早发肺部疾病的风险。"}]}],"synonyms":["alpha-1 antitrypsin","AAT","α1-antitrypsin"],"phonetic":"/ˌæn.taɪˈtrɪp.sɪn/","extraExplanation":["在医学语境中，人们更常说 **alpha-1 antitrypsin（α1-抗胰蛋白酶，AAT）**。AAT 缺乏（AAT deficiency）是一种遗传相关问题，可能导致肺气肿/慢阻肺风险增加，也可能影响肝脏。","词形提示：**anti-**（反、抑制）+ **trypsin**（胰蛋白酶）→ 字面意思就是“抑制胰蛋白酶的物质”。"]}
{"word":"antitryptic","summary":{"en":"Antitryptic means inhibiting the digestive enzyme trypsin.","zh":"Antitryptic 指“抑制胰蛋白酶作用的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to prevent or reduce the action of trypsin (a digestive enzyme that breaks down proteins).","zh":"能抑制或减弱胰蛋白酶（trypsin，一种分解蛋白质的消化酶）作用的。"},"examples":[{"en":"Some foods contain antitryptic substances that can interfere with protein digestion.","zh":"有些食物含有抗胰蛋白酶物质，可能会干扰蛋白质的消化。"},{"en":"Researchers measured the antitryptic activity of the extract in the lab.","zh":"研究人员在实验室测量了该提取物的抗胰蛋白酶活性。"}]}],"synonyms":["trypsin-inhibiting","antitrypsin (related term)"],"phonetic":"/ˌæn.tiˈtrɪp.tɪk/","extraExplanation":["“antitryptic”多见于生物化学、营养学与食品科学语境，常与“trypsin inhibitor（胰蛋白酶抑制剂）”“antitryptic activity（抗胰蛋白酶活性）”连用。","某些豆类（如大豆）含有胰蛋白酶抑制剂；充分加热可降低这类“antitryptic”作用，因此在饮食与饲料加工中会讨论其影响。"]}
{"word":"antitubercular","summary":{"en":"Antitubercular means related to medicines or treatment that prevent or fight tuberculosis.","zh":"antitubercular 指“抗结核的”，多用于描述抗结核药物或治疗。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to preventing or treating tuberculosis (TB), especially describing medicines.","zh":"与预防或治疗结核病（TB）有关的，尤指抗结核药物。"},"examples":[{"en":"The doctor started antitubercular therapy after confirming tuberculosis.","zh":"确诊结核病后，医生开始了抗结核治疗。"},{"en":"Isoniazid and rifampin are common antitubercular drugs.","zh":"异烟肼和利福平是常见的抗结核药物。"},{"en":"Patients taking antitubercular medication should follow the schedule strictly.","zh":"服用抗结核药物的患者应严格按疗程和时间表用药。"}]}],"synonyms":["anti-TB","antituberculosis","tuberculostatic"],"phonetic":"/ˌæn.ti.tuˈbɝː.kjə.lɚ/","extraExplanation":["“Antitubercular”主要用于医学语境：anti- 表示“对抗/抗”，tubercular 与“结核（tuberculosis）”相关。日常英语里更常见的说法是 “anti-TB” 或 “antituberculosis medication/therapy”。"]}
{"word":"antituberculin","summary":{"en":"Antituberculin is a substance (often an antibody) that counteracts tuberculin, mainly seen in historical or technical medical contexts.","zh":"Antituberculin 指对抗/中和结核菌素的物质（常为抗体），主要见于较早期或专业医学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance (especially an antibody in blood serum) that neutralizes or counteracts tuberculin; used historically in tuberculosis research and immunology.","zh":"抗结核菌素；（尤指血清中的）能中和或对抗结核菌素的物质/抗体；多见于早期结核病研究与免疫学语境。"},"examples":[{"en":"Early laboratory reports described antituberculin in serum after repeated exposure to tuberculin.","zh":"早期的实验室报告描述了在反复接触结核菌素后，血清中出现抗结核菌素。"},{"en":"The paper discussed whether antituberculin could reduce reactions caused by tuberculin injections.","zh":"该论文讨论了抗结核菌素是否能减轻结核菌素注射引起的反应。"}]}],"synonyms":["anti-tuberculin","tuberculin antiserum"],"phonetic":"/ˌæn.ti.tuːˈbɝː.kjə.lɪn/","extraExplanation":["“tuberculin（结核菌素）”是从结核分枝杆菌相关成分中制备的提取物，历史上用于结核病的诊断试验（如皮试）与研究。因而“antituberculin”多出现在较早期或较专业的免疫学文献中，日常英语与现代临床交流里并不常见。","词形结构：anti-（反、抗）+ tuberculin（结核菌素）。阅读医学文献时，有时也会见到写作 anti-tuberculin（加连字符）的形式。"]}
{"word":"antituberculosis","summary":{"en":"Antituberculosis means ‘used to prevent or treat tuberculosis (TB),’ especially describing TB medicines.","zh":"antituberculosis 意为“抗结核的”，指用于预防或治疗结核病（TB）的，尤指抗结核药物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the prevention or treatment of tuberculosis (TB), especially describing medicines used against TB bacteria.","zh":"抗结核的；与结核病（TB）的预防或治疗有关的，尤指用于对抗结核分枝杆菌的药物。"},"examples":[{"en":"She started antituberculosis treatment after her TB diagnosis.","zh":"她在确诊结核后开始接受抗结核治疗。"},{"en":"The doctor prescribed antituberculosis drugs such as isoniazid and rifampin.","zh":"医生开了异烟肼和利福平等抗结核药物。"}]}],"synonyms":["anti-TB","antitubercular"],"phonetic":"/ˌæn.ti.tuːˌbɝː.kjəˈloʊ.sɪs/","extraExplanation":["“antituberculosis”常用于医学语境，修饰“drug(s)（药物）”“therapy/treatment（治疗）”“regimen（治疗方案）”。","在英语里也常见写法：anti-tuberculosis（加连字符）或anti-TB（更口语/更简写）。","结核病（tuberculosis, TB）是一种主要影响肺部的传染病，但也可能影响身体其他部位；“antituberculosis”强调的是对抗这种疾病的措施或药物。"]}
{"word":"antituberculotic","summary":{"en":"Antituberculotic means “anti-TB”: related to preventing or treating tuberculosis.","zh":"antituberculotic 意为“抗结核的/与结核病治疗或预防有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the prevention or treatment of tuberculosis (TB).","zh":"与结核病（TB）的预防或治疗有关的；抗结核的。"},"examples":[{"en":"The patient was started on antituberculotic therapy after the diagnosis of TB.","zh":"确诊结核病后，患者开始接受抗结核治疗。"},{"en":"Antituberculotic drugs must be taken regularly to avoid treatment failure.","zh":"抗结核药物必须规律服用，以避免治疗失败。"}]}],"synonyms":["antitubercular","anti-TB","tuberculostatic"],"phonetic":"/ˌæn.ti.tuˌbɝː.kjəˈlɑː.tɪk/","extraExplanation":["“antituberculotic”多见于医学或药学语境，属于较正式且偏专业的用词。更常见、也更口语化的同义表达是“antitubercular”或“anti-TB”。","词形结构：anti-（“对抗/反对”）+ tubercul-（来自 tuberculosis，“结核病”）+ -otic（形容词后缀，表示“与……有关的”）。在文献中也可能写作带连字符的“anti-tuberculotic”。"]}
{"word":"antituberculous","summary":{"en":"Antituberculous means “used to fight tuberculosis,” especially describing medications or treatment.","zh":"antituberculous 指“用于对抗结核病的”，多用于描述药物或治疗方案。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Used to prevent or treat tuberculosis (TB), especially describing medicines or drug regimens.","zh":"用于预防或治疗结核病（TB）的，尤指药物或用药方案。"},"examples":[{"en":"Isoniazid is an antituberculous drug commonly used to treat TB.","zh":"异烟肼是一种常用于治疗结核病的抗结核药。"},{"en":"The patient started antituberculous therapy after the diagnosis was confirmed.","zh":"确诊后，患者开始接受抗结核治疗。"}]}],"synonyms":["anti-TB","antitubercular","tuberculostatic"],"phonetic":"/ˌæn.ti.tuːˈbɝː.kjə.ləs/","extraExplanation":["构词法：anti-（“反/抗”）+ tuberculous（“结核的”）。在医学语境中更常见的同义表达是 anti-TB（抗结核）或 antitubercular。","常见搭配：antituberculous drugs（抗结核药物）、antituberculous therapy/treatment（抗结核治疗）、antituberculous regimen（抗结核方案）。","注意：这是专业医学用词，日常英语里通常会说 “TB medicine(s)” 或 “treatment for TB”。"]}
{"word":"antitumor","summary":{"en":"Antitumor describes something that fights or inhibits tumor growth, or (less commonly) a treatment/drug that does so.","zh":"antitumor 指“抗肿瘤的/抑制肿瘤生长的”，也可作名词表示“抗肿瘤药物或疗法”（较少见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Preventing, reducing, or stopping the growth of tumors (used especially in medicine).","zh":"抗肿瘤的；抑制或阻止肿瘤生长的（多用于医学语境）。"},"examples":[{"en":"The researchers tested an antitumor drug on mice.","zh":"研究人员在小鼠身上测试了一种抗肿瘤药物。"},{"en":"Some foods contain compounds with possible antitumor effects.","zh":"一些食物含有可能具有抗肿瘤作用的化合物。"},{"en":"The therapy showed antitumor activity in early clinical trials.","zh":"这种疗法在早期临床试验中显示出抗肿瘤活性。"}]},{"partOfSpeech":"n.","definition":{"en":"A substance or treatment that fights tumors; an antitumor agent.","zh":"抗肿瘤物质或疗法；抗肿瘤药物（抗肿瘤制剂/药剂）。"},"examples":[{"en":"The patient was given an antitumor to slow the cancer’s growth.","zh":"患者使用了一种抗肿瘤药物来减缓癌症生长。"},{"en":"Scientists are searching for safer antitumors with fewer side effects.","zh":"科学家正在寻找副作用更少、更安全的抗肿瘤药物。"}]}],"synonyms":["anticancer","tumor-fighting","tumor-suppressing","antineoplastic"],"phonetic":"/ˌæn.tiˈtuː.mɚ/","extraExplanation":["词源提示：anti- 表示“反/对抗”，tumor 表示“肿瘤”，合起来就是“对抗肿瘤的”。","用法提醒：在医学文章里更常见的是形容词用法（antitumor drug/therapy/activity/effect）。名词用法（an antitumor）也存在，但在临床/科普中常用 agent、drug、therapy 来表达更自然。","语体与文化语境：这是偏专业的医学词汇，日常英语中更常说 cancer drug（抗癌药）、cancer treatment（癌症治疗）。在写作时注意区分 tumor（肿瘤）与 cancer（癌症）；并非所有肿瘤都是恶性的。"]}
{"word":"antitumoral","summary":{"en":"Antitumoral means “acting against tumors,” especially describing cancer drugs or treatments.","zh":"antitumoral 意为“抗肿瘤的”，常用于描述抗癌药物或治疗。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine) able to prevent, slow down, or destroy tumors; used to describe drugs or treatments that work against cancer cells.","zh":"（医学）抗肿瘤的；指能预防、减缓或消灭肿瘤的药物或治疗手段（对抗癌细胞）。"},"examples":[{"en":"Researchers are testing an antitumoral drug in patients with advanced cancer.","zh":"研究人员正在晚期癌症患者中测试一种抗肿瘤药物。"},{"en":"The compound showed antitumoral activity in laboratory experiments.","zh":"该化合物在实验室研究中显示出抗肿瘤活性。"},{"en":"Doctors combined surgery with antitumoral therapy to reduce the risk of recurrence.","zh":"医生将手术与抗肿瘤治疗结合，以降低复发风险。"}]}],"synonyms":["antitumor","anticancer","antineoplastic"],"phonetic":"/ˌæn.ti.tuːˈmɔːr.əl/","extraExplanation":["“antitumoral”常见于医学论文与临床语境，较日常的说法是“anti-cancer（抗癌的）”或“antitumor（抗肿瘤的）”。","词形结构：anti-（反、对抗）+ tumor/tumour（肿瘤）+ -al（形容词后缀）。美式英语多写作“tumor”，英式常见“tumour”。","在科研中常搭配“antitumoral activity/effect（抗肿瘤活性/效果）”“antitumoral agent（抗肿瘤药物/制剂）”。注意：描述疗效时通常需要具体证据（体外、动物实验或临床试验）。"]}
{"word":"antiturnpikeism","summary":{"en":"Antiturnpikeism means opposition to toll roads or toll charges, often used in historical contexts.","zh":"antiturnpikeism 指反对收费公路或反对收取过路费的观点/运动，常用于历史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to turnpikes (toll roads) or to charging tolls for road use.","zh":"反对收费公路（收费道路）或反对收取道路通行费的观点/运动。"},"examples":[{"en":"In the 1800s, antiturnpikeism grew in some rural areas where people felt tolls were unfair.","zh":"在19世纪，一些农村地区出现了反收费公路运动，因为人们觉得过路费不公平。"},{"en":"The newspaper editorial criticized antiturnpikeism and argued that tolls helped pay for better roads.","zh":"那篇报纸社论批评了反收费公路思想，并认为收费有助于筹资修路。"}]}],"synonyms":["anti-toll-road sentiment","opposition to tolls","anti-toll movement"],"phonetic":"/ˌæntiˈtɝnˌpaɪˌkɪzəm/","extraExplanation":["这个词多见于历史语境（尤其与美国18—19世纪的“turnpike”收费道路有关），现代英语里很少用；今天更常说“opposition to toll roads / anti-toll movement”。","turnpike 最初指带横杆的路障/收费闸门，后来引申为“收费公路”。因此 antiturnpikeism 通常不仅是反对道路本身，而是反对“以收费方式建设和维护道路”的制度。"]}
{"word":"antitussive","summary":{"en":"Antitussive means “stopping or relieving cough,” and it can refer to a cough-suppressing medicine.","zh":"antitussive 表示“止咳的”，也可指“止咳药/镇咳剂”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medicine) A drug or treatment that helps prevent or relieve coughing.","zh":"（医学）止咳的；用于抑制或缓解咳嗽的（药物或治疗）。"},"examples":[{"en":"The doctor recommended an antitussive to help her sleep through the night.","zh":"医生建议使用止咳药，帮助她整晚睡得更好。"},{"en":"Some antitussive medicines can make you feel sleepy, so check the label before driving.","zh":"一些止咳药可能会让人犯困，所以开车前要看清药品说明。"}]},{"partOfSpeech":"n.","definition":{"en":"An antitussive medicine or agent (a cough suppressant).","zh":"止咳药；镇咳剂（抑制咳嗽的药物或成分）。"},"examples":[{"en":"Dextromethorphan is a common over-the-counter antitussive.","zh":"右美沙芬是一种常见的非处方止咳成分。"},{"en":"If your cough lasts more than a week, ask a pharmacist whether an antitussive is appropriate.","zh":"如果咳嗽持续超过一周，可以询问药师是否适合使用止咳药。"}]}],"synonyms":["cough suppressant","antitussive drug","cough medicine"],"phonetic":"/ˌæn.tiˈtʌs.ɪv/","extraExplanation":["词源提示：anti- 表示“反对/抑制”，tussis 是拉丁语“咳嗽”。所以 antitussive 字面意思就是“抑制咳嗽的”。","用法区分：英语里常把 antitussive（止咳）与 expectorant（祛痰）对比。前者更适合“干咳/刺激性咳嗽”，后者用于帮助把痰咳出来；是否适用应以症状与医嘱为准。"]}
{"word":"antitwilight","summary":{"en":"Antitwilight means the twilight glow/band in the sky opposite the Sun, especially the colored arch seen above Earth’s shadow at dawn or dusk.","zh":"antitwilight 指黎明或黄昏时出现在与太阳相对方向的暮光辉光/色带，常见为地影上方的彩色弧带。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the part of the sky opposite the Sun during twilight (especially the faint band/arch seen above Earth’s shadow).","zh":"与“反太阳方向的暮光”有关的；指黄昏/黎明时在天空中与太阳相对的一侧（尤指地影上方可见的微弱色带/弧）。"},"examples":[{"en":"At dusk, a pale pink antitwilight band appeared above the dark rising shadow of Earth.","zh":"傍晚时，地影上方出现了一条淡粉色的反暮光色带。"},{"en":"Photographers often look for antitwilight colors in the eastern sky after sunset.","zh":"摄影师常在日落后观察东方天空的反暮光色彩。"}]},{"partOfSpeech":"n.","definition":{"en":"the antitwilight band/arch itself—the glow or colored arc opposite the Sun at dawn or dusk.","zh":"反暮光（现象）；指黎明或黄昏时出现在与太阳相对方向的光辉/彩色弧带。"},"examples":[{"en":"We waited a few minutes for the antitwilight to form clearly.","zh":"我们等了几分钟，反暮光才清晰成形。"},{"en":"The antitwilight is easiest to see when the air is clear and dry.","zh":"空气清澈干燥时，反暮光最容易看见。"}]}],"synonyms":["antisolar twilight","antisolar arch","Belt of Venus","Earth’s shadow (contextually related)"],"phonetic":"/ˌæn.tiˈtwaɪˌlaɪt/","extraExplanation":["“antitwilight”常见于大气光学与风景摄影语境，和“anti-solar / antisolar”（反太阳方向）相关。它常被解释为地影（Earth’s shadow）上方的粉红色带，也常被称为“Belt of Venus（维纳斯带）”或“antisolar arch（反太阳拱）”。","构词法：anti-（反、对立、在……对面）+ twilight（暮光、晨昏微光）。它不是日常高频词，更像是描述特定自然现象的专业/文艺用语。"]}
{"word":"antitypal","summary":{"en":"Antitypal means the opposite of a typical model or stereotype—intentionally contrasting with what is expected.","zh":"Antitypal 指与典型模式或刻板印象相反、刻意形成对照的“反典型”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposite to, or serving as a contrasting counterpart of, a “type” or model; not typical; anti-typical.","zh":"与“典型/原型（type）”相对或形成对照的；非典型的；反典型的。"},"examples":[{"en":"Her antitypal hero is timid and uncertain, the opposite of the usual brave warrior.","zh":"她笔下的反典型英雄胆小而犹豫不决，和常见的勇士形象完全相反。"},{"en":"The film uses an antitypal family to challenge the audience’s expectations.","zh":"这部电影用一个反典型的家庭来挑战观众的固有期待。"}]}],"synonyms":["atypical","countertypical","untypical","nonstandard","unconventional"],"phonetic":"/ænˈtɪtɪpəl/","extraExplanation":["“antitypal”较为少见，常见于文学评论、修辞分析或学术写作中，用来说明某个人物/形象是对传统“典型（type）”的刻意反转或对照。","词源上：anti-（反对、相反）+ type（类型、典型）+ -al（形容词后缀）。","容易与“antitype”混淆：antitype（名词）在宗教/文学语境里可指“预表（type）的应验/对应物”，而“antitypal”强调“反典型、对照性”的意味，在普通写作里更接近“atypical（非典型的）”或“countertypical（反传统类型的）”。"]}
{"word":"antitype","summary":{"en":"Antitype means the real fulfillment or counterpart of an earlier “type,” especially in Christian biblical interpretation; more rarely, it can mean an opposite counterpart.","zh":"Antitype 指（尤在基督教圣经预表学中）对早先“预表”(type)的真实应验或对应实体；更少见时也可指对立的对应物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person, event, or thing in the New Testament (or later reality) that is seen as the fulfillment or “real counterpart” of an earlier biblical symbol (a “type”), especially in Christian theology.","zh":"（基督教神学中）“预表”的“对应实体/应验”：指《新约》中的人物、事件或事物，被视为对《旧约》中早先象征（预表，type）的实现或对应。"},"examples":[{"en":"In Christian typology, many writers describe Christ as the antitype of Adam.","zh":"在基督教预表学中，许多作者把基督称为亚当的“对应实体/应验”（antitype）。"},{"en":"The Passover lamb is often treated as a type, with Jesus understood as its antitype.","zh":"逾越节的羊羔常被视为“预表”（type），而耶稣被理解为其“应验/对应”（antitype）。"}]},{"partOfSpeech":"n.","definition":{"en":"More generally, the exact opposite or contrasting counterpart of something (less common).","zh":"（较少见）某物的相反者；对立的对应物。"},"examples":[{"en":"Some critics called the new hero the antitype of the classic detective—impulsive rather than methodical.","zh":"一些评论家称这位新英雄是经典侦探的“对立对应物”——冲动而不是一丝不苟。"}]}],"synonyms":["counterpart","fulfillment","correspondent","opposite (rare sense)"],"phonetic":"/ˈæn.tiˌtaɪp/","extraExplanation":["这个词最常出现在“biblical typology（圣经预表学）”里：type（预表）指《旧约》中被认为预示后来更完整现实的象征或模式；antitype（应验/对应实体）则是《新约》或后来的“实现”。例如《希伯来书》9:24 就使用了 antitype 的相关概念来讨论“天上的真帐幕”与地上礼仪之间的对应。","学习提示：在日常英语里 antitype 很少用；如果只是想表达“相反的人/事”，更常用 opposite, contrast, counterpart。"]}
{"word":"antitypes","summary":{"en":"Antitypes are later fulfillments or counterparts to earlier symbolic “types,” especially in biblical interpretation.","zh":"Antitypes 指对早先“预表（type）”的后期应验或对应物，尤用于圣经诠释。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Things or people in the New Testament (or a later reality) that fulfill and correspond to an earlier “type” (a symbolic pattern, person, event, or object), especially in Christian biblical interpretation.","zh":"（复数）“预表—应验”解释法中，后来（常指《新约》）所应验、对应早先“预表”（象征性的人物/事件/物件/模式）的事物或人物；尤用于基督教圣经诠释。"},"examples":[{"en":"In the sermon, the priest described baptism and the Eucharist as antitypes of Old Testament rituals.","zh":"在讲道中，牧师把洗礼与圣餐描述为《旧约》礼仪的“应验”（antitypes）。"},{"en":"Some readers see the Exodus story as a type, and freedom in Christ as its antitype.","zh":"有些读者把出埃及记看作“预表”，把在基督里的自由看作其“应验”。"}]}],"synonyms":["fulfillments","counterparts","correspondences"],"phonetic":"/ˈæn.ti.taɪps/","extraExplanation":["“antitype”主要出现在基督教神学与圣经释经传统中，常与“type（预表）”成对使用：type 是早期的象征性模式，antitype 是后来的实现或对应（常被视为更完整的意义）。该词在一般日常英语中很少用，更多见于宗教研究、神学文章或文学批评中。"]}
{"word":"antityphoid","summary":{"en":"Antityphoid means ‘against typhoid fever,’ especially referring to a vaccine or vaccination.","zh":"Antityphoid 意为“抗伤寒/预防伤寒的”，多指伤寒疫苗或疫苗接种。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"preventing or protecting against typhoid fever (often used to describe a vaccine or inoculation).","zh":"预防伤寒的；抗伤寒的（常用来形容疫苗或接种）。"},"examples":[{"en":"The clinic offered an antityphoid vaccine for travelers.","zh":"诊所为旅行者提供了抗伤寒疫苗。"},{"en":"He received an antityphoid shot before his trip.","zh":"他在出行前打了抗伤寒疫苗。"}]},{"partOfSpeech":"n.","definition":{"en":"an antityphoid vaccine or inoculation.","zh":"抗伤寒疫苗；抗伤寒接种。"},"examples":[{"en":"The doctor recommended an antityphoid before we left.","zh":"医生建议我们出发前接种抗伤寒疫苗。"}]}],"synonyms":["anti-typhoid","typhoid vaccine","typhoid vaccination"],"phonetic":"/ˌæn.tiˈtaɪ.fɔɪd/","extraExplanation":["“antityphoid”多见于较旧的医学/公共卫生语境；现代更常说“typhoid vaccine（伤寒疫苗）”或“typhoid vaccination（伤寒疫苗接种）”。","伤寒（typhoid fever）是一种由伤寒沙门氏菌引起的疾病，常与受污染的食物或饮水有关；因此旅行、卫生条件不稳定地区的防护语境中较常提到相关疫苗。","拼写上也可能看到带连字符的形式“anti-typhoid”。"]}
{"word":"antitypic","summary":{"en":"Antitypic means ‘related to the antitype,’ the real fulfillment of a symbolic type, especially in biblical interpretation.","zh":"Antitypic 指“与对型有关”，即某个象征性预表在后来的真实应验或完成（尤见于《圣经》解经）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an antitype (the real person/thing that fulfills or completes a symbolic “type,” especially in the Bible).","zh":"与“对型/本体”（实现或完成象征性“预表”的真实人物或事物，尤用于《圣经》解经）有关的；对型的。"},"examples":[{"en":"In Christian theology, Jesus is often described as the antitypic fulfillment of Old Testament types.","zh":"在基督教神学中，耶稣常被描述为旧约预表的“对型性/对型的”实现。"},{"en":"Some scholars read the flood story as a type and baptism as its antitypic meaning.","zh":"有些学者把洪水故事看作预表，而把洗礼看作其对型性的意义。"}]}],"synonyms":["antitypical","typological (context-dependent)","fulfilling (context-dependent)"],"phonetic":"/ˌæn.tiˈtɪp.ɪk/","extraExplanation":["“antitypic”较少见，更常见的是“antitypical”。两者意思相近，常出现在宗教研究、神学写作与《圣经》“预表（type）—对型（antitype）”的解释框架中。","在这种用法里：type=象征性的预表（如人物、事件、制度），antitype=后来出现的更完整、更真实的对应/应验。"]}
{"word":"antitypical","summary":{"en":"Antitypical is an uncommon adjective meaning either “not typical” or (in theology/literary symbolism) “relating to an antitype—the later fulfillment of an earlier type.”","zh":"Antitypical 是较少见的形容词，可指“不典型的”，也可指（神学/象征解读中）“与对型/应验体有关的——作为预表所指向的后来的真实实现”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not typical; opposite to what is usual or expected (rare).","zh":"不典型的；与通常情况相反的（较少见）。"},"examples":[{"en":"His response was antitypical for him—he stayed calm instead of arguing.","zh":"他的反应对他来说很不典型——他没有争辩，反而保持冷静。"},{"en":"The weather this week has been antitypical for February, with warm sunny days.","zh":"这周的天气对二月来说很不典型，连续都是温暖晴朗的日子。"}]},{"partOfSpeech":"adj.","definition":{"en":"In biblical or literary symbolism, relating to an antitype: the real fulfillment or later reality that a “type” (an earlier symbol or pattern) points to.","zh":"（圣经/文学象征）指“对型/应验体”的：作为“预表（type）”所指向的后来的真实实现或应验。"},"examples":[{"en":"Some theologians describe the New Testament event as antitypical of an earlier Old Testament story.","zh":"一些神学家认为新约中的某一事件是旧约故事的“对型/应验”。"},{"en":"In typological reading, the later character is seen as the antitypical figure of the earlier one.","zh":"在类型学解读中，后出现的人物被视为前者的“对型/应验体”。"}]}],"synonyms":["untypical","uncharacteristic","atypical","symbolic (in typology context)","fulfilling (in typology context)"],"phonetic":"/ˌæn.tiˈtɪp.ɪ.kəl/","extraExplanation":["“antitypical”主要出现在宗教研究（尤其是圣经类型学/预表解读）或较学术的写作中，日常英语里更常用的说法通常是 “not typical / unusual / uncharacteristic”。","词形来源：anti-（相对、对应）+ type（类型、预表）+ -ical（形容词后缀）。在类型学里，type 是“预表/影子”，antitype 是“应验/本体”。"]}
{"word":"antitypically","summary":{"en":"Antitypically means “in a way that interprets something as the later fulfillment (antitype) of an earlier symbol (type),” mainly in Christian theology.","zh":"Antitypically 指“按对型/反型关系来解读”，即把某事物解释为较早象征（type）的后来应验（antitype），多用于基督教神学语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to an antitype (the “real” person/thing believed to be foreshadowed by an earlier symbol, called a type), especially in Christian theology and biblical interpretation.","zh":"以“对型 / 反型（antitype）”的方式；指与对型有关（即被认为由较早的象征“预表/类型 type”所预示的真实人物或事物），尤用于基督教神学与圣经诠释。"},"examples":[{"en":"In some sermons, the Passover lamb is discussed antitypically as Christ.","zh":"在一些讲道中，逾越节的羊羔会被以“对型”的方式解释为基督。"},{"en":"The story is read antitypically, linking the Old Testament image to a later fulfillment.","zh":"这个故事被以“对型”的方式解读，把旧约的形象与后来的应验联系起来。"}]}],"synonyms":["in a typological way","as a fulfillment","symbolically"],"phonetic":"ˌæn.tiˈtɪp.ɪ.kli","extraExplanation":["“antitypically”来自“antitype（对型/反型）”。在基督教的“预表（typology）”传统里，type 指较早出现、象征性地“预告”的人/事/物；antitype 指后来出现、被认为是其真正实现或对应的对象。因此 antitypically 常见于神学写作、讲道或注释中，表示“按对型关系来解释/对应”。","这个词非常少见，日常英语里通常会用更直白的说法，例如：“as a fulfillment,” “as a foreshadowing of …,” 或 “symbolically as …”。"]}
{"word":"antitypous","summary":{"en":"Antitypous means “antitypical”: the real fulfillment that a symbolic earlier “type” is thought to point to (mainly in theology).","zh":"Antitypous 意为“对型的/对型式的”：指被认为是早先象征性“预型”所指向的真实应验（主要用于神学语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Theology, formal) Serving as an antitype; the real thing that a symbolic “type” in earlier scripture is believed to point to or foreshadow.","zh":"（神学/正式）作为“对型”（antitype）的；指早期经文中的象征性“预型”（type）所预示、指向的真实对应之事物（常见于基督教释经的预表体系）。"},"examples":[{"en":"In Christian typology, some writers call Christ the antitypous fulfillment of Old Testament figures.","zh":"在基督教的预表释经中，有些作者称基督为旧约人物与事件的“对型式”应验。"},{"en":"The sermon described baptism as the antitypous meaning behind a story of water and rescue.","zh":"那篇讲道把洗礼解释为某个“水与拯救”的故事背后的“对型式”含义。"}]}],"synonyms":["antitypical","typological","fulfilling (in context)"],"phonetic":"/ænˈtɪtɪpəs/","extraExplanation":["“antitypous”较罕见，多见于神学或古典/学术写作；现代英语更常用“antitypical”（对型的）或直接用名词“antitype”。","“type / antitype”常用于基督教“预表（typology）”传统：旧约中的人物/事件被视为“type（预型）”，新约中的应验被称为“antitype（对型）”。"]}
{"word":"antitypy","summary":{"en":"Antitypy is a rare word meaning the antitype relationship (or the antitype itself) in typology, especially in biblical or literary analysis.","zh":"Antitypy 是一个罕用词，指“预表—应验”的对型关系（或对型本身），多见于圣经研究或文学分析。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) The condition or concept of being an antitype; the relationship between a “type” (an earlier symbol or pattern) and its later, fuller reality.","zh":"（罕用）“对型/对应原型”的概念或状态；指“预表（type）”与其后来更完整实现（antitype）之间的对应关系。"},"examples":[{"en":"In biblical studies, antitypy describes how an earlier event can foreshadow a later one.","zh":"在圣经研究中，antitypy 用来描述较早的事件如何预示后来的事件。"},{"en":"The essay discusses the antitypy between the flood story and later ideas of renewal.","zh":"这篇文章讨论了洪水故事与后来“更新/重生”观念之间的 antitypy（对应关系）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A person, object, or event seen as the antitype—the later reality that fulfills a symbolic “type.”","zh":"（罕用）被视为“对型/应验者”的人、物或事件；即实现某种象征性“预表（type）”的后起实体。"},"examples":[{"en":"Some readers treat the hero as the antitypy of an older mythic figure.","zh":"有些读者把这位英雄看作更古老神话人物的 antitypy（后起对应者）。"}]}],"synonyms":["antitype","typology","fulfillment","counterpart","correspondence"],"phonetic":"/ˈænˌtaɪpi/","extraExplanation":["该词极少见，学术写作中更常用 antitype（对型/对应原型）或 typology（预表论）。","在基督教神学语境里：type 指“预表/象征”（如旧约事件或人物），antitype 指其在新约或后世中“实现/应验”的对应对象；antitypy 则更像在说“这种对应关系本身”。"]}
{"word":"antityrosinase","summary":{"en":"Antityrosinase describes or refers to a substance that inhibits tyrosinase, often discussed in skincare (dark spots) and food science (preventing browning).","zh":"Antityrosinase 指“抗酪氨酸酶”的：描述或指代抑制酪氨酸酶的物质，常见于护肤淡斑与食品防褐变语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Adj.) Able to inhibit tyrosinase, an enzyme involved in melanin (pigment) production and enzymatic browning.","zh":"（形容词）能抑制酪氨酸酶（tyrosinase）的；该酶参与黑色素生成与食物褐变过程。"},"examples":[{"en":"Kojic acid is often described as an antityrosinase ingredient in skincare.","zh":"曲酸常被称为护肤中的“抗酪氨酸酶（antityrosinase）”成分。"},{"en":"Researchers tested antityrosinase activity to see whether the extract could reduce browning in fruit.","zh":"研究人员测试了抗酪氨酸酶活性，以评估该提取物是否能减少水果褐变。"}]},{"partOfSpeech":"n.","definition":{"en":"(N.) A substance (a tyrosinase inhibitor) that reduces or blocks tyrosinase activity.","zh":"（名词）抗酪氨酸酶物质；即抑制酪氨酸酶活性的抑制剂。"},"examples":[{"en":"The formula contains an antityrosinase to help even out the look of dark spots.","zh":"该配方含有抗酪氨酸酶抑制剂，用于帮助改善色斑外观、让肤色看起来更均匀。"},{"en":"In food science, an antityrosinase can slow down enzymatic browning in cut produce.","zh":"在食品科学中，抗酪氨酸酶抑制剂可减缓切开的果蔬发生酶促褐变。"}]}],"synonyms":["tyrosinase inhibitor","anti-browning agent","depigmenting agent"],"phonetic":"/ˌænti taɪˈroʊsɪˌneɪs/","extraExplanation":["“tyrosinase（酪氨酸酶）”与皮肤黑色素生成相关，因此“antityrosinase”常见于美白/淡斑语境；同时它也用于食品领域（防止苹果、土豆切开后变褐）。","与皮肤相关的功效通常只能说“帮助改善色沉/色斑外观”，真实效果受浓度、配方、肤质与防晒等因素影响；某些强效抑制剂可能引起刺激，使用时应注意安全与合规。","该词在学术论文、成分说明中更常见，日常英语里更常说“tyrosinase inhibitor（酪氨酸酶抑制剂）”。"]}

