{"word":"antimacassar","summary":{"en":"An antimacassar is a protective cloth on a chair or sofa, originally used to stop hair oil from staining the fabric.","zh":"antimacassar 指铺在椅背或沙发靠头处的防污罩布，最初用于防止发油弄脏家具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small cloth put over the back or arms of a chair (or over a sofa headrest) to protect the fabric from hair oil or grease.","zh":"（椅背、椅臂或沙发靠头处的）防污罩布；用于防止头发油脂弄脏家具的布巾。"},"examples":[{"en":"My grandmother kept lace antimacassars on every armchair to protect the upholstery.","zh":"我祖母在每把扶手椅上都铺了蕾丝防污罩布，以保护家具面料。"},{"en":"The old theater seats still had antimacassars draped over the headrests.","zh":"那家老剧院的座椅靠头处仍然搭着防污罩布。"}]}],"synonyms":["chair doily","protective chair cover"],"phonetic":"/ˌæn.ti.məˈkæs.ɚ/","extraExplanation":["词源：anti- 表示“防、对抗”；Macassar 指“望加锡（印尼地名）”。19世纪流行一种叫 “Macassar oil（望加锡发油）” 的头发油，容易把椅背弄脏，于是出现了用来“防 Macassar 油”污染的布巾，称为 antimacassar。","文化语境：antimacassar 常见于维多利亚时代/19世纪英国家居描述中，很多是钩针或蕾丝制作，既实用也装饰性强；在小说或怀旧场景里出现时，常用来营造“老派、讲究、复古”的氛围。"]}
{"word":"antimacassars","summary":{"en":"Antimacassars are small protective cloths placed on chairs to prevent staining and wear, especially from hair oil.","zh":"Antimacassars 指铺在椅背或扶手上的小布巾，用来防污、防磨损（尤其是防头油弄脏）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small cloth or cover placed on the back or arms of a chair to protect it from hair oil, dirt, or wear; the plural form refers to more than one of these covers.","zh":"（椅背或扶手上的）防污巾／椅背巾，用来防止头油、污渍或磨损；复数形式表示多个椅背巾。"},"examples":[{"en":"The antique armchair still has lace antimacassars on its back.","zh":"那把古董扶手椅的椅背上仍铺着蕾丝椅背巾。"},{"en":"In the old photo, you can see antimacassars on nearly every chair in the parlor.","zh":"在那张老照片里，客厅里几乎每把椅子上都能看到椅背巾。"}]}],"synonyms":["chair back cover","chair doily","protective chair cover"],"phonetic":"/ˌæn.ti.məˈkæsɚz/","extraExplanation":["“antimacassar”这个词来自“anti-（防止）+ Macassar（望加锡）”。19世纪时，一种很流行的发油叫“Macassar oil（望加锡发油）”，容易把椅背弄脏，所以人们在椅子上加一块可拆洗的小布来“防Macassar（防发油污渍）”。","在英国家庭和维多利亚时代室内装饰中很常见，常见材质有钩针编织或蕾丝；在文学作品或描写“旧式客厅/老派家庭”的语境里出现时，往往带有怀旧、传统或“老派讲究”的氛围。"]}
{"word":"antimachination","summary":{"en":"Antimachination means a counter-action or counter-plan used to stop secret plotting or manipulation.","zh":"antimachination 指为反制他人暗中阴谋或操纵而采取的对策、计划或行动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plan, action, or effort meant to stop or counter someone else’s secret schemes or plotting","zh":"为阻止或反制他人暗中阴谋、诡计而采取的计划、行动或努力"},"examples":[{"en":"The committee’s antimachination kept the contract from being manipulated behind the scenes.","zh":"委员会的反制阴谋行动，阻止了合同在幕后被操纵。"},{"en":"Journalists sometimes act as an antimachination by exposing hidden political deals.","zh":"记者有时通过揭露隐秘的政治交易，起到“反制阴谋”的作用。"}]}],"synonyms":["counterplot","countermeasure","thwarting","prevention","foil"],"phonetic":"/ˌæntiˌmækəˈneɪʃən/","extraExplanation":["这是一个非常少见、偏书面且带“自造词”味道的词。结构上由 anti-（反对、对抗）+ machination（阴谋策划、诡计）组成，字面意思就是“反阴谋/反诡计”。日常英语中更常用的表达包括 counterplot（反制阴谋）、countermeasure（对策）、move to thwart the plot（挫败阴谋的举动）、effort to stop the scheme（阻止诡计的努力）。","machination 常带贬义，强调“暗中策划、操纵”；因此 antimachination 也往往出现在较正式或修辞性的语境，用来突出“以计制计/揭露并阻止暗箱操作”的意味。"]}
{"word":"antimachine","summary":{"en":"“Antimachine” means opposed to machines or automation, or someone/ideas that reject machine-based systems.","zh":"“antimachine”指反对机器或自动化的（态度/做法），也可指反机器的人或思想。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to machines, automation, or machine-based systems; favoring human labor, craft, or low-tech ways of working.","zh":"反机器的；反对机器、自动化或以机器为主的系统；偏好人工、手工或低科技的工作方式。"},"examples":[{"en":"Some artists take an anti-machine approach and make everything by hand.","zh":"一些艺术家采取反机器的做法，所有东西都用手工制作。"},{"en":"The novel shows an anti-machine attitude toward factory life.","zh":"这部小说展现了对工厂生活的反机器态度。"}]},{"partOfSpeech":"n.","definition":{"en":"A person, movement, or idea that rejects machines or automation.","zh":"反对机器或自动化的人、运动或观点。"},"examples":[{"en":"He wasn’t anti-technology, but people still labeled him an antimachine.","zh":"他并不反科技，但人们仍把他贴上“反机器派”的标签。"}]}],"synonyms":["anti-machine","anti-automation","anti-industrial","Luddite (often negative)","low-tech"],"phonetic":"/ˌænti məˈʃin/","extraExplanation":["这个词更常见的写法是带连字符的 anti-machine；不带连字符的 antimachine 较少见，通常出现在口语化写法、标签（tag）或标题里。","含义通常不是“讨厌所有技术”，而是特指反对“机器取代人”“过度自动化”“流水线式效率至上”等社会现象。相关语境常见于劳动议题、环保与可持续生活、手工艺与艺术创作等。"]}
{"word":"antimachinery","summary":{"en":"“Antimachinery” describes opposition to machines or mechanization, or the belief that machinery is harmful.","zh":"“antimachinery”指反对机器/机械化，或认为机器有害的一种态度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to machines or industrial technology; favoring handwork, traditional methods, or low-tech solutions.","zh":"反对机器或工业技术的；偏好手工、传统方法或低科技方案的。"},"examples":[{"en":"Some community groups take an antimachinery view and prefer local, handmade products.","zh":"一些社区团体持反机器的观点，更喜欢本地手工制作的产品。"},{"en":"The novel has an antimachinery tone, warning that machines can distance people from nature.","zh":"这部小说带有反机器的基调，警告机器可能让人远离自然。"}]},{"partOfSpeech":"n.","definition":{"en":"A belief or attitude that machines and mechanization are harmful or undesirable.","zh":"认为机器与机械化有害或不可取的一种信念或态度。"},"examples":[{"en":"His antimachinery comes from seeing factory work replace skilled crafts.","zh":"他的反机器观念源于亲眼看到工厂工作取代了熟练的手艺。"},{"en":"The essay criticizes antimachinery as unrealistic in a modern economy.","zh":"这篇文章批评反机器立场在现代经济中不切实际。"}]}],"synonyms":["anti-industrial","anti-technology","anti-mechanization","Luddite (informal)"],"phonetic":"/ˌæn.ti məˈʃiː.nɚ.i/","extraExplanation":["“antimachinery”更常见的写法是“anti-machinery”（加连字符），在学术写作中也可能用“anti-machine”或“anti-technology”。","它常与英国“卢德派（Luddites）”相关：19世纪早期一些工人反对纺织机器，因为机器威胁到他们的工作与手艺。现代语境里也可指对自动化、人工智能或大规模工业化的担忧。","在文学与文化评论中，“antimachinery”有时不是“讨厌工具”，而是批评“过度机械化”带来的去人性化（dehumanization）、环境破坏或社区关系变弱。"]}
{"word":"Antimachus","summary":{"en":"Antimachus is mainly the name of an ancient Greek poet (of Colophon), and sometimes a minor figure in Trojan War traditions.","zh":"Antimachus主要指古希腊诗人（科洛丰的安提马科斯），有时也指特洛伊战争传说中的次要人物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient Greek poet (Antimachus of Colophon, 5th–4th century BCE), known for learned, complex epic and elegiac poetry; his works survive mostly in fragments.","zh":"古希腊诗人（科洛丰的安提马科斯，公元前5—4世纪），以学问性强、结构复杂的史诗与哀歌闻名；其作品多已散佚，仅存残篇。"},"examples":[{"en":"Antimachus is often mentioned as a learned poet whose style is more difficult than Homer’s.","zh":"安提马科斯常被提到是一位“博学型”诗人，其文风被认为比荷马更难读。"},{"en":"In a class on Greek literature, we read fragments attributed to Antimachus of Colophon.","zh":"在希腊文学课上，我们读了归于科洛丰的安提马科斯的一些残篇。"}]},{"partOfSpeech":"n.","definition":{"en":"A personal name in Greek myth and history; in some traditions, Antimachus is a Trojan figure allied with Troy during the Trojan War.","zh":"希腊神话与历史中出现的人名；在某些传说里，安提马科斯是特洛伊战争中支持特洛伊的一位人物。"},"examples":[{"en":"Different retellings of the Trojan War may include minor characters such as Antimachus.","zh":"不同版本的特洛伊战争故事中，可能会出现安提马科斯这类较次要的人物。"}]}],"phonetic":"/æn'tɪməkəs/","extraExplanation":["“Antimachus”是拉丁化/英语化的拼写，对应希腊语名字“Antímakhos”，常见于古典学研究与英译本注释中。","文学史上提到的通常是“科洛丰的安提马科斯”。他与后来的“亚历山大学派/博学型写作”气质相近：引用典故多、结构繁复，因此在古代就有人觉得他不如荷马“流畅好读”，但也有人推崇其学识与用典。","如果你是在读《伊利亚特》或特洛伊题材作品时看到这个名字，需留意它可能指“人物”而非“诗人”；最好根据上下文（是否谈写作、作品、残篇）来判断。"]}
{"word":"antimagistratical","summary":{"en":"Antimagistratical means opposed to magistrates or their legal authority.","zh":"Antimagistratical 指反对治安官/地方官或其法律权威。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to magistrates (government officials such as judges) or to their legal authority; against government control or interference.","zh":"反对治安官/地方官（如法官等）或其法律权威的；反对政府控制或干预的。"},"examples":[{"en":"Some radical pamphlets of the period used strongly antimagistratical language.","zh":"那个时期的一些激进小册子使用了强烈的反官权措辞。"},{"en":"The group’s antimagistratical stance made local officials suspicious of its meetings.","zh":"该团体的反官权立场使地方官员对其集会起疑。"}]}],"synonyms":["anti-authority","anti-government","anti-establishment","opposed to the magistracy"],"phonetic":"/ˌæn.tiˌmædʒ.əˈstræt.ɪ.kəl/","extraExplanation":["这是一个非常罕见、带有历史色彩的词：anti-（反对）+ magistratical（与官员/司法行政有关的）。常见于早期近代英国的宗教与政治争论语境中，讨论“教会/个人良心”与“世俗官员权力”之间的边界。现代英语里更常用的表达是 anti-government、anti-authority、opposed to the magistracy 等。"]}
{"word":"antimagnetic","summary":{"en":"Antimagnetic means not affected by magnets or designed to resist magnetic interference.","zh":"antimagnetic 指不受磁铁影响的，或为抵抗磁性干扰而设计的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not affected by magnets; resisting or not showing magnetic attraction.","zh":"抗磁的；不受磁铁影响的；不表现出磁性吸引的。"},"examples":[{"en":"The watch uses an antimagnetic case to protect its movement.","zh":"这块手表使用抗磁表壳来保护机芯。"},{"en":"Some tools are made from antimagnetic materials to avoid interference near sensitive equipment.","zh":"有些工具用抗磁材料制成，以免在精密设备附近产生干扰。"}]}],"synonyms":["non-magnetic","magnet-resistant"],"phonetic":"/ˌæn.taɪ.mæɡˈnɛt.ɪk/","extraExplanation":["“antimagnetic”常见于钟表、工程和实验室语境，尤其是“antimagnetic watch（防磁手表）”。严格说，材料对磁场的反应有不同类型：一些是“非磁性（non-magnetic）”——几乎不被磁化；而“抗磁/抗磁性（diamagnetic）”在物理学里有更精确的含义（会产生微弱的反向磁化）。日常英语里，antimagnetic 常用来泛指“防磁/抗磁干扰”。","构词：anti-（反、抗）+ magnetic（磁的）。相关表达：magnetic（有磁性的）、non-magnetic（无磁性的/不易被磁化的）、magnet-resistant（耐磁的/抗磁干扰的）。"]}
{"word":"antimalaria","summary":{"en":"Antimalaria refers to something (especially a drug) used to prevent or treat malaria; more commonly written as “antimalarial.”","zh":"antimalaria 指用于预防或治疗疟疾的事物（尤指药物）；更常见的写法是 antimalarial。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Used to prevent or treat malaria (a disease spread by mosquitoes).","zh":"用于预防或治疗疟疾（由蚊子传播的疾病）。"},"examples":[{"en":"Travelers may take an antimalarial drug before visiting a malaria-risk area.","zh":"旅行者在前往疟疾风险地区前，可能会服用抗疟药。"},{"en":"The clinic provided antimalarial medication for children during the outbreak.","zh":"在疫情期间，诊所为儿童提供了抗疟药物。"}]},{"partOfSpeech":"n.","definition":{"en":"A medicine or drug that prevents or treats malaria; an antimalarial.","zh":"抗疟药；用于预防或治疗疟疾的药物。"},"examples":[{"en":"Chloroquine was once a common antimalaria, but resistance has increased in some regions.","zh":"氯喹曾经是常用的抗疟药，但在一些地区耐药性已增加。"},{"en":"The doctor prescribed an antimalaria for the trip.","zh":"医生为这次旅行开了抗疟药。"}]}],"synonyms":["antimalarial","antimalarial drug","anti-malarial (hyphenated)"],"phonetic":"/ˌæn.ti.məˈlɛr.i.əl/","extraExplanation":["“antimalaria”常见的更标准写法是 **antimalarial**（形容词/名词）。在医学与公共卫生语境里，多用“antimalarial drug/medication”。","疟疾相关表达：**malaria risk area**（疟疾风险地区）、**mosquito-borne disease**（蚊媒疾病）、**drug resistance**（耐药性）。"]}
{"word":"antimalarial","summary":{"en":"Antimalarial means a drug (or something related to a drug) that prevents or treats malaria.","zh":"antimalarial 指“抗疟（的）”，即用于预防或治疗疟疾的药物或相关治疗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a drug used to prevent or treat malaria","zh":"抗疟药；用于预防或治疗疟疾的药物"},"examples":[{"en":"Travelers to some tropical countries may need an antimalarial before and during their trip.","zh":"去一些热带国家旅行的人，可能需要在出发前及旅行期间服用抗疟药。"},{"en":"The doctor prescribed an antimalarial to treat the infection.","zh":"医生开了抗疟药来治疗感染。"}]},{"partOfSpeech":"adj.","definition":{"en":"used to describe a drug or treatment that prevents or treats malaria","zh":"抗疟的；用于预防或治疗疟疾的（药物/治疗）"},"examples":[{"en":"She was given antimalarial medication as a precaution.","zh":"作为预防措施，她服用了抗疟药物。"},{"en":"Researchers are developing new antimalarial drugs because resistance is increasing.","zh":"由于耐药性增加，研究人员正在研发新的抗疟药。"}]}],"synonyms":["antimalarial drug","malaria medicine","antimalarial medication"],"phonetic":"/ˌæn.ti.məˈler.i.əl/","extraExplanation":["“anti-”表示“反/抗”，malaria是“疟疾”，合起来就是“抗疟（的）”。","常见的抗疟药包括chloroquine（氯喹）、mefloquine（甲氟喹）、doxycycline（多西环素）、artemisinin-based therapies（青蒿素联合疗法）等；具体选择取决于目的地耐药情况与个人健康状况，应遵医嘱。","在旅行语境里，antimalarial常与“prophylaxis（预防性用药）”“mosquito bites（蚊虫叮咬）”“malaria risk（疟疾风险）”一起出现。"]}
{"word":"antimale","summary":{"en":"“Antimale” means against men/boys or seen as hostile to males, often used in social or political discussions.","zh":"“antimale”表示反男性/对男性不友好，常用于社会或政治讨论中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to men or boys; showing hostility or bias against males.","zh":"反男性的；对男性（男人或男孩）持敌意或偏见的。"},"examples":[{"en":"Some people labeled her comments as antimale, but she said she was criticizing specific behaviors, not all men.","zh":"有人把她的言论贴上“反男性”的标签，但她说自己批评的是具体行为，不是所有男性。"},{"en":"The group denied being antimale and emphasized equal rights for everyone.","zh":"该团体否认自己反男性，并强调人人平等的权利。"}]},{"partOfSpeech":"adj.","definition":{"en":"Designed to reduce male influence or participation in a space or activity (often used in discussions about policies or social trends).","zh":"（多用于讨论政策或社会趋势）旨在减少男性在某个空间或活动中的影响力或参与度的。"},"examples":[{"en":"Critics called the new rule antimale because it limited men’s roles in the program.","zh":"批评者称新规定“反男性”，因为它限制了男性在该项目中的角色。"},{"en":"Supporters argued the change wasn’t antimale; it was meant to correct a long-standing imbalance.","zh":"支持者认为这并非反男性，而是为了纠正长期存在的不平衡。"}]}],"synonyms":["anti-male","anti-men","male-hostile","misandric"],"phonetic":"/ˌæntiˈmeɪl/","extraExplanation":["“antimale”常写作“anti-male”。在公共讨论中，它往往带有强烈立场色彩，可能用来概括或指责他人观点。更清晰的表达方式是说明具体反对的是什么（某种行为、制度或政策），以避免把批评扩大到整个性别群体。"]}
{"word":"antimallein","summary":{"en":"Antimallein is a rare term for an anti-mallein antibody/antiserum used in older veterinary or diagnostic contexts.","zh":"Antimallein 是一个少见词，通常指“抗马鼻疽素（mallein）”的抗体或抗血清，多见于较早的兽医/诊断语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A biological substance (especially an antiserum/antibody preparation) used to counteract or neutralize the effects of mallein, or related reactions in diagnostic/veterinary contexts.","zh":"一种生物制剂（尤指抗血清/抗体制备物），用于对抗或中和“马鼻疽素（mallein）”的作用，或用于相关的诊断/兽医情境。"},"examples":[{"en":"The old veterinary notes mentioned antimallein being prepared to reduce adverse reactions to mallein testing.","zh":"那份早期的兽医笔记提到会制备 antimallein 来减轻马鼻疽素检测带来的不良反应。"},{"en":"Because the term is rare, modern papers often describe the product as an anti-mallein serum rather than antimallein.","zh":"由于这个词很少见，现代论文常把它写成“anti-mallein serum（抗马鼻疽素血清）”而不是 antimallein。"}]}],"synonyms":["anti-mallein serum","anti-mallein antibody","anti-mallein antiserum"],"phonetic":"/ˌæn.tiˈmæl.eɪn/","extraExplanation":["“mallein（马鼻疽素）”是由马鼻疽伯克霍尔德菌（Burkholderia mallei）相关成分制成的一种诊断试剂，历史上用于检测马鼻疽（glanders）。因此 antimallein 多见于较老的兽医/免疫学资料，用来指“抗马鼻疽素”的抗体或抗血清。","该词非常冷僻，检索与写作时常用更透明的表达：anti-mallein antibody / anti-mallein serum（抗马鼻疽素抗体/血清）。"]}
{"word":"antiman","summary":{"en":"“Antiman” means anti-male: someone hostile to men, or something described as opposing men.","zh":"“antiman”表示“反男性/厌男”：指厌恶男性的人，或形容带有反男性倾向的观点或内容。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who is hostile to men or strongly opposed to men/masculinity; someone with anti-male attitudes.","zh":"厌男者；反男性者：对男性或男性气质抱有敌意或强烈反对态度的人。"},"examples":[{"en":"Some commenters used the word “antiman” to accuse her of hating men.","zh":"一些评论者用“antiman”指责她厌男。"},{"en":"The article was criticized for sounding antiman and unfair to fathers.","zh":"这篇文章因听起来“反男性”、对父亲不公平而受到批评."}]},{"partOfSpeech":"adj.","definition":{"en":"Opposed to men, or portraying men as a group in a negative way.","zh":"反男性的；对男性整体持负面态度的。"},"examples":[{"en":"He called the movie’s message antiman.","zh":"他称这部电影传递的观点是反男性的。"},{"en":"Try to discuss the issue without using antiman stereotypes.","zh":"尽量在讨论这个问题时不要使用反男性的刻板印象。"}]}],"synonyms":["anti-man","misandrist","anti-male","male-bashing"],"phonetic":"/ˈæntiˌmæn/","extraExplanation":["“antiman”并不是非常常见的标准词，更多出现在网络讨论或带情绪色彩的指控中；更常见的写法是加连字符的“anti-man”。","它通常属于主观评价词，容易引发对立。正式写作中，若要更中性，可用“anti-male sentiment（反男性情绪）”“male-bashing（贬损男性）”等更具体的表达。"]}
{"word":"antimanagement","summary":{"en":"Antimanagement describes opposition to managers or managerial control; it can also mean a general anti-management viewpoint.","zh":"antimanagement 指反对管理层或管理控制；也可指一种“反管理”的观点或倾向。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to management or to the authority, ideas, or decisions of managers (often describing an attitude, style, or culture at work).","zh":"反管理的；反对管理层（常用来形容职场中的态度、风格或文化）。"},"examples":[{"en":"Some employees described the company’s culture as antimanagement after a series of unpopular rules.","zh":"在一系列不得人心的规定出台后，一些员工把公司的文化形容为“反管理”。"},{"en":"His comments sounded antimanagement, even though he said he supported the team.","zh":"尽管他说支持团队，他的评论听起来仍然有点反管理。"}]},{"partOfSpeech":"n.","definition":{"en":"a viewpoint or tendency that resists managerial control or formal corporate management, sometimes linked to anti-authority or anti-corporate ideas.","zh":"反管理倾向；抵制管理控制或正式公司管理的观点（有时与反权威、反企业的想法相关）。"},"examples":[{"en":"The protest mixed antimanagement with broader criticism of the company’s leadership.","zh":"这场抗议把反管理情绪和对公司领导层更广泛的批评交织在一起。"},{"en":"In some online forums, antimanagement has become a shorthand for rejecting traditional workplace power structures.","zh":"在一些网络论坛里，“反管理”成了拒绝传统职场权力结构的一种简写说法。"}]}],"synonyms":["anti-management","anti-authority (in workplace contexts)","manager-bashing (informal)","anti-corporate (related)"],"phonetic":"/ˌæntiˈmænɪdʒmənt/","extraExplanation":["“antimanagement”在实际写作中更常见的形式是“anti-management”（带连字符），读起来更清楚。","它通常用于讨论职场文化、劳资关系或公司治理；语气可能带批评色彩，使用时注意场合与立场。"]}
{"word":"antimaniac","summary":{"en":"Antimaniac means “anti-mania”: something (especially a medicine) that treats or controls mania.","zh":"Antimaniac 意为“抗躁狂的/抗躁狂药”：尤其指用于治疗或控制躁狂的药物或方法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine, psychiatry) Preventing, reducing, or treating mania (an abnormally excited or elevated mood state).","zh":"（医学/精神科）用于预防、减轻或治疗躁狂（异常兴奋或情绪高涨的状态）的。"},"examples":[{"en":"Lithium is a classic antimaniac medication used to stabilize mood.","zh":"锂盐是经典的抗躁狂药物，用于稳定情绪。"},{"en":"The doctor adjusted the antimaniac treatment after the patient’s sleep improved.","zh":"在患者睡眠改善后，医生调整了抗躁狂治疗方案。"}]},{"partOfSpeech":"n.","definition":{"en":"A drug or treatment used to control mania.","zh":"用于控制躁狂的药物或治疗方法；抗躁狂药。"},"examples":[{"en":"An effective antimaniac can reduce agitation and risky behavior.","zh":"有效的抗躁狂药可以减轻躁动和冒险行为。"},{"en":"They discussed whether to start an antimaniac or another mood stabilizer.","zh":"他们讨论是开始使用抗躁狂药还是换用其他情绪稳定剂。"}]}],"synonyms":["antimanic","mood-stabilizing (context-dependent)"],"phonetic":"/ˌæn.tiˈmeɪ.ni.æk/","extraExplanation":["“antimaniac”较少见，更常见的说法是“antimanic”。两者意思相同：anti-（反、对抗）+ manic（躁狂的）。在现代英文医学写作里，“antimanic”更标准、更常用。","在精神科语境中，“mania/躁狂”通常指双相情感障碍（Bipolar disorder）中的躁狂发作；相关治疗可能包括情绪稳定剂（如锂盐、丙戊酸盐）以及某些抗精神病药。"]}
{"word":"antimaniacal","summary":{"en":"Antimaniacal means anti-manic: preventing or reducing mania, often describing medication or treatment.","zh":"antimaniacal 意为“抗躁狂的/抗躁的”：用于预防或减轻躁狂，常形容药物或治疗。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"describing something (especially a medicine or treatment) that prevents or reduces mania; anti-manic.","zh":"（尤指药物或治疗）抗躁狂的；用于预防或减轻躁狂症状的。"},"examples":[{"en":"Lithium is a classic antimaniacal medication used to help control manic episodes.","zh":"锂盐是一种经典的抗躁狂药物，用于帮助控制躁狂发作。"},{"en":"The doctor adjusted the antimaniacal treatment to reduce the patient’s agitation and sleeplessness.","zh":"医生调整了抗躁狂治疗，以减轻患者的激动和失眠。"}]},{"partOfSpeech":"adj.","definition":{"en":"opposed to mania or manic behavior; aiming to calm extreme excitement or overactivity.","zh":"反对或抑制躁狂/躁狂式行为的；旨在让过度兴奋或过度活动冷静下来的。"},"examples":[{"en":"The clinic created an antimaniacal routine with regular sleep and reduced stimulation.","zh":"诊所制定了抗躁狂作息，包括规律睡眠并减少刺激。"},{"en":"His therapist recommended antimaniacal strategies like limiting caffeine and keeping a stable schedule.","zh":"治疗师建议采用抗躁狂策略，比如限制咖啡因摄入并保持稳定的日程。"}]}],"synonyms":["anti-manic","antimanic","mood-stabilizing (context-dependent)"],"phonetic":"/ˌæn.taɪ.məˈnaɪ.ə.kəl/","extraExplanation":["“antimaniacal”由“anti-（反/抗）+ maniacal（躁狂的）”构成，常见于精神医学语境；日常英语里更常用的是“anti-manic”。","“mania（躁狂）”通常指情绪异常高涨、精力过剩、睡眠需求减少、思维奔逸等症状，常与双相情感障碍相关；涉及健康问题时建议用中性、尊重的表达。"]}
{"word":"antimanic","summary":{"en":"Antimanic means used to prevent or treat mania, especially in bipolar disorder.","zh":"antimanic 指“抗躁狂的”，用于预防或治疗躁狂发作，常见于双相障碍相关语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or used to prevent or treat episodes of mania (an abnormally elevated or irritable mood).","zh":"与躁狂有关的；用于预防或治疗躁狂发作（情绪异常高涨或易怒）的。"},"examples":[{"en":"Lithium is a well-known antimanic medication.","zh":"锂盐是一种众所周知的抗躁狂药物。"},{"en":"The doctor adjusted her antimanic treatment to reduce side effects.","zh":"医生调整了她的抗躁狂治疗方案，以减少副作用。"}]}],"synonyms":["anti-manic","mood-stabilizing (context)","antimanic agent (medical)"],"phonetic":"/ˌæn.taɪˈmæn.ɪk/","extraExplanation":["“antimanic”常见于医学/精神健康语境，尤其与双相情感障碍（bipolar disorder）的躁狂期治疗有关。日常口语里更常说“mood stabilizer（情绪稳定剂）”或直接说“medicine for mania（治疗躁狂的药）”。","词形上：anti- 表示“反、抗”，manic 来自 mania（躁狂）。因此 antimanic 直观含义就是“抗躁狂的”。"]}
{"word":"Antimarian","summary":{"en":"Antimarian means against devotion to the Virgin Mary (or related doctrines); it can also refer to a person who holds that view.","zh":"Antimarian 指反对对圣母玛利亚的敬礼或相关教义；也可指持这种立场的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to (or criticizing) devotion to the Virgin Mary, Marian doctrines, or Marian practices in Christianity.","zh":"（基督宗教语境中）反对或批评对圣母玛利亚的敬礼、与圣母相关的教义或宗教实践的。"},"examples":[{"en":"Some Reformers were strongly antimarian and rejected prayers to Mary.","zh":"一些宗教改革者强烈反对圣母敬礼，拒绝向玛利亚祈祷。"},{"en":"The book takes an antimarian stance toward certain traditions.","zh":"这本书对某些传统采取反圣母立场。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who opposes Marian devotion or Marian doctrines.","zh":"反对圣母敬礼或圣母相关教义的人。"},"examples":[{"en":"In that debate, he was labeled an antimarian by his opponents.","zh":"在那场辩论中，他被对手贴上“反圣母者”的标签。"}]}],"synonyms":["anti-Marian","anti-Marist (rare)","anti-devotional (context-dependent)"],"phonetic":"/ˌæntaɪˈmɛriən/","extraExplanation":["“Antimarian”常写作“anti-Marian”（带连字符更常见），其中 Marian 指“与圣母玛利亚有关的”。","这个词多出现在神学讨论或教派历史语境里，尤其与宗教改革时期对圣母敬礼的争议相关。日常英语中很少用。"]}
{"word":"antimarian","summary":{"en":"Antimarian (often written anti-Marian) means opposing the Virgin Mary’s doctrines or devotion; it can also mean a person who holds that view.","zh":"antimarian（常写作 anti-Marian）指反对与圣母玛利亚有关的教义或崇敬；也可指持这种观点的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to Mary (the Virgin Mary) or to Marian doctrines/devotions, especially in Christian theology.","zh":"（尤指基督教神学中）反对圣母玛利亚或反对“圣母崇敬/圣母教义”的；反圣母的。"},"examples":[{"en":"Some Protestant writers made anti-Marian arguments against praying to Mary.","zh":"一些新教作者提出反圣母的论点，反对向玛利亚祈祷。"},{"en":"The essay criticizes anti-Marian attitudes in early polemical texts.","zh":"这篇文章批评早期论战性文本中的反圣母态度。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who opposes Marian doctrines or devotion.","zh":"反对圣母教义或圣母崇敬的人。"},"examples":[{"en":"He was labeled an anti-Marian by his opponents during the debate.","zh":"在辩论中，他被对手贴上“反圣母者”的标签。"}]}],"synonyms":["anti-Marian","anti-Marianist","anti-Marianism (related noun)"],"phonetic":"/ˌæntaɪˈmɛriən/","extraExplanation":["这个词更常见的写法是带连字符的 **anti-Marian**（也可见 **antimarian**），多出现在宗教史、神学讨论或宗派争论的语境中。","**Marian** 指“与圣母玛利亚有关的”（如 Marian devotion 圣母崇敬；Marian doctrine 圣母相关教义）。因此 anti-Marian 通常并不是“反对名叫 Mary 的人”，而是特指与圣母相关的信仰与实践。"]}
{"word":"antimark","summary":{"en":"“Antimark” usually means “non-marking”—made to prevent scuffs or stains, especially in product descriptions.","zh":"“antimark”通常指“防留痕/不留痕”，多见于产品描述，表示不易留下划痕或污迹。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to prevent leaving marks, scuffs, or stains on a surface; non-marking.","zh":"（用于物品/材料）防留痕的；不易在表面留下划痕、污迹或印痕的。"},"examples":[{"en":"These antimark shoes won’t leave black streaks on the gym floor.","zh":"这双防留痕的鞋不会在体育馆地板上留下黑色痕迹。"},{"en":"Use antimark pads to protect the table from scratches.","zh":"用防留痕垫来保护桌面不被刮花。"}]},{"partOfSpeech":"n.","definition":{"en":"A product feature or material type intended to prevent marking (common in product descriptions).","zh":"（产品描述用语）指“防留痕”这一特性或防留痕材料。"},"examples":[{"en":"The catalog lists an antimark finish for the chair legs.","zh":"目录上写椅子腿采用了防留痕处理。"},{"en":"Ask if the tires come with an antimark compound.","zh":"可以问问轮胎是否使用了防留痕配方。"}]}],"synonyms":["non-marking","anti-scuff","anti-stain","scuff-resistant"],"phonetic":"/ˈæntiˌmɑrk/","extraExplanation":["“antimark”不是非常常见的标准词典词条，更常见的写法是带连字符的“anti-mark”或更地道的“non-marking”。在鞋底、轮胎、家具脚垫、涂层等产品说明里更容易见到。","如果你指的是品牌名、用户名或某个专业领域术语（例如软件/游戏/生物学），告诉我具体语境，我可以按该领域给出更准确的解释与用法。"]}
{"word":"antimartyr","summary":{"en":"An antimartyr is someone (or something) that opposes martyrdom or the glorification of martyrs.","zh":"antimartyr 指反对殉道或反对美化殉道者（烈士）的人，或指“反殉道的”立场/观点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who rejects, criticizes, or works against the idea of martyrdom or the glorification of martyrs (especially in religion or politics).","zh":"反殉道者：指拒绝、批评或反对“殉道/烈士叙事”以及对殉道者（烈士）的崇拜的人（常见于宗教或政治语境）。"},"examples":[{"en":"In the debate, he positioned himself as an antimartyr, warning that celebrating death can encourage violence.","zh":"在辩论中，他把自己定位为反殉道者，警告美化死亡可能会助长暴力。"},{"en":"Some writers adopt an antimartyr stance, focusing on survival and everyday courage instead of heroic sacrifice.","zh":"一些作家采取反殉道立场，把重点放在生存与日常勇气上，而不是英雄式牺牲。"}]},{"partOfSpeech":"adj.","definition":{"en":"opposed to martyrdom or to making someone into a martyr.","zh":"反殉道的；反对把某人塑造成殉道者（烈士）的。"},"examples":[{"en":"Her antimartyr message stressed negotiation over sacrifice.","zh":"她的反殉道信息强调谈判而非牺牲。"},{"en":"The film offers an antimartyr interpretation of the historical event.","zh":"这部电影对那段历史事件给出了反殉道式的解读。"}]}],"synonyms":["anti-martyrdom","opponent of martyrdom","critic of martyrdom","demythologizer"],"phonetic":"/ˌæntiˈmɑrtər/","extraExplanation":["这个词并不常见，更多是由前缀 anti-（“反对”）+ martyr（“殉道者/烈士”）构成的概念性用词，常出现在讨论宗教冲突、政治宣传、极端主义叙事或文学批评时。","注意区分：antimartyr（反对殉道叙事）不一定等同于“反对某位烈士本人”，而是反对把死亡/牺牲当作最高道德范本来鼓励他人效仿。"]}
{"word":"antimask","summary":{"en":"“Antimask” describes someone or something opposed to wearing face masks, and it can also mean a person who is against masks.","zh":"“antimask”指反对戴口罩的（立场），也可指反对戴口罩的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to wearing face masks (especially in public health contexts).","zh":"反对戴口罩的（尤其指公共卫生语境中）。"},"examples":[{"en":"Some anti-mask groups protested outside the city hall.","zh":"一些反对戴口罩的团体在市政厅外抗议。"},{"en":"The school faced pressure from anti-mask parents.","zh":"学校面临来自反对戴口罩的家长的压力。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who opposes wearing face masks.","zh":"反对戴口罩的人。"},"examples":[{"en":"He’s an antimask who argues that mandates violate personal freedom.","zh":"他是个反对戴口罩的人，认为强制规定侵犯个人自由。"},{"en":"The meeting included doctors, teachers, and a few antimasks.","zh":"会议上有医生、老师，也有几位反对戴口罩的人。"}]}],"synonyms":["anti-mask","opposed to masks","against mask mandates"],"phonetic":"/ˌæntiˈmæsk/","extraExplanation":["“antimask”更常见的拼写是带连字符的“anti-mask”。该词在新冠疫情期间在新闻与社交媒体中迅速流行，通常用来描述反对口罩政策（如“mask mandates”口罩令）的人或立场。","语气与立场：在媒体报道中它常带有批评或对立色彩；如果想更中性，可以说“opposed to mask mandates（反对口罩令）”或“doesn’t support mask requirements（不支持口罩要求）”。"]}
{"word":"antimasker","summary":{"en":"An antimasker is someone who opposes wearing face masks, especially during public-health crises.","zh":"antimasker 指反对戴口罩的人，常用于公共卫生危机（如疫情）语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposes wearing face masks, especially in public-health situations (such as during a disease outbreak).","zh":"反对戴口罩的人（尤指在公共卫生情境中，如疫情期间）。"},"examples":[{"en":"During the pandemic, some antimaskers protested mask rules at city hall.","zh":"在疫情期间，一些反口罩者在市政厅抗议口罩规定。"},{"en":"She stopped arguing with antimaskers online and focused on sharing reliable health information.","zh":"她不再和网上的反口罩者争论，而是专注于分享可靠的健康信息。"}]}],"synonyms":["mask opponent","anti-mask person","person opposed to mask mandates"],"phonetic":"/ˌæntiˈmæskər/","extraExplanation":["“antimasker”常见于新冠疫情相关的新闻与社交媒体语境，带有一定评价色彩；在正式写作中也可用更中性的表达，如“people opposed to mask mandates”（反对口罩强制令的人）。","构词法：anti-（反对）+ masker（戴口罩的人/与口罩相关的人）。在英语里，anti- 常用来构成表示“反对某事”的词，如 antiwar（反战的）。"]}
{"word":"antimasks","summary":{"en":"“Antimasks” means people who oppose wearing face masks, especially in public-health contexts.","zh":"“antimasks”指反对佩戴口罩的人，尤用于公共卫生语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people or groups who oppose wearing masks (especially face masks worn for health reasons).","zh":"反对戴口罩的人（或团体），尤指反对出于健康原因佩戴的口罩。"},"examples":[{"en":"During the pandemic, antimasks organized protests against mask rules.","zh":"在疫情期间，反对戴口罩的人组织了抗议口罩规定的活动。"},{"en":"The school board meeting drew antimasks and supporters of mask policies.","zh":"学区董事会会议上既有反对戴口罩的人，也有支持口罩政策的人。"}]}],"synonyms":["anti-maskers","mask opponents","anti-mask activists"],"phonetic":"ˈæntiˌmæsk","extraExplanation":["“antimasks”常见于新闻和社交媒体语境，更多指一种立场或运动（反对口罩规定/强制令），而不只是单纯“不喜欢戴口罩”。","写作中更常见的拼写是带连字符的“anti-mask/anti-maskers”。“antimasks”多作为复数名词，指一群人。"]}
{"word":"Antimason","summary":{"en":"Antimason means someone opposed to Freemasonry, especially a supporter of the U.S. Anti-Masonic movement/party in the 1820s–1830s.","zh":"Antimason 指反对共济会的人，尤指19世纪20—30年代美国反共济会运动/反共济会党的支持者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposes Freemasonry; especially a supporter of the Anti-Masonic movement or the U.S. Anti-Masonic Party (mainly in the 1820s–1830s).","zh":"反共济会者；尤指支持反共济会运动或美国“反共济会党”（主要活跃于19世纪20—30年代）的人。"},"examples":[{"en":"In the 1830s, some Antimasons argued that secret societies threatened democracy.","zh":"在19世纪30年代，一些反共济会者认为秘密社团会威胁民主制度。"},{"en":"He wrote newspaper editorials as an Antimason, calling for more political transparency.","zh":"他以反共济会者的立场撰写报纸社论，呼吁更多政治透明。"}]}],"synonyms":["Anti-Mason","opponent of Freemasonry","anti-Freemasonry activist"],"phonetic":"/ˌæn.tiˈmeɪ.sən/","extraExplanation":["“Antimason / Anti-Mason”常与美国历史上的“反共济会运动”相关：1826年纽约州的威廉·摩根（William Morgan）失踪事件引发公众对共济会影响力与“秘密誓言”的强烈不安，随后出现了反共济会组织与政党。","反共济会党常被认为是美国最早的“第三党”之一，也较早使用全国代表大会来提名总统候选人（这后来成为美国政党政治的常见做法）。","现代英语中，这个词多用于历史语境；日常表达“反对共济会的人”也可说：someone who is anti‑Freemasonry / an opponent of Freemasonry。"]}
{"word":"antimason","summary":{"en":"Antimason means a person or idea that opposes the Freemasons (Freemasonry).","zh":"antimason 指反对共济会（共济会组织/共济会主义）的人或立场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is opposed to the Freemasons (a fraternal organization), or who supports anti-Masonic ideas or movements","zh":"反共济会者；反对共济会的人（或支持反共济会观念/运动的人）"},"examples":[{"en":"Some newspapers in the 1800s were openly antimason and warned readers about secret societies.","zh":"19世纪时，一些报纸公开反共济会，并提醒读者警惕秘密社团。"},{"en":"He described himself as an antimason because he distrusted the political influence of the Freemasons.","zh":"他称自己为反共济会者，因为他不信任共济会在政治中的影响力。"}]},{"partOfSpeech":"adj.","definition":{"en":"opposed to the Freemasons or to Freemasonry (their organization and practices)","zh":"反共济会的；反对共济会（及其组织与活动）的"},"examples":[{"en":"The candidate ran on an antimason platform during the campaign.","zh":"这位候选人在竞选中以反共济会立场作为纲领。"},{"en":"An antimason pamphlet accused the group of controlling local politics.","zh":"一份反共济会的小册子指控该团体操控地方政治。"}]}],"synonyms":["anti-Masonic","opponent of Freemasonry"],"phonetic":"/ˌæntiˈmeɪsən/","extraExplanation":["“Antimason”常与美国历史上的“反共济会党”（Anti-Masonic Party）相关，这是19世纪早期美国出现的政党之一，因反对共济会的秘密性与社会影响而兴起。如今该词多见于历史或政治语境。"]}
{"word":"Antimasonic","summary":{"en":"Antimasonic means opposed to Freemasonry or to the influence of Freemasons.","zh":"Antimasonic 指“反共济会的；反对共济会影响的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to Freemasons or Freemasonry; critical of Masonic groups, influence, or beliefs.","zh":"反共济会的；反对共济会或共济会组织与其影响的。"},"examples":[{"en":"The newspaper printed several antimasonic articles during the election.","zh":"这家报纸在选举期间刊登了几篇反共济会的文章。"},{"en":"He joined an antimasonic movement that called for more political transparency.","zh":"他加入了一个倡导更多政治透明度的反共济会运动。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who is opposed to Freemasonry (less common).","zh":"反对共济会的人（较少用）。"},"examples":[{"en":"In the 1800s, some antimasonics organized local meetings.","zh":"在19世纪，一些反共济会人士会组织地方集会。"}]}],"synonyms":["anti-Freemason","anti-Masonic","anti-Freemasonry"],"phonetic":"/ˌæn.ti.məˈsɑː.nɪk/","extraExplanation":["“Antimasonic”在美国历史语境中常与19世纪的“反共济会党（Anti-Masonic Party）”有关，这是美国早期的第三党之一，兴起于对共济会秘密结社与政治影响力的担忧。","词形上，anti- 表示“反对”，Masonic 源自 Mason（石匠）并与 Freemason（共济会会员）相关；因此 antimasonic 基本意思就是“反共济会的”。"]}
{"word":"antimasonic","summary":{"en":"Antimasonic means opposing Freemasonry or the Freemasons, or someone who opposes them.","zh":"antimasonic 指“反共济会的”，也可指“反对共济会的人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to the Freemasons or to Freemasonry (their organization, beliefs, or influence).","zh":"反共济会的；反对共济会（其组织、理念或影响）的。"},"examples":[{"en":"Some newspapers in the 1800s published antimasonic articles.","zh":"19世纪时，一些报纸刊登了反共济会的文章。"},{"en":"He studied antimasonic movements in early American politics.","zh":"他研究了美国早期政治中的反共济会运动。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who is opposed to the Freemasons or to Freemasonry.","zh":"反共济会者；反对共济会的人。"},"examples":[{"en":"The speaker was a well-known antimasonic in his town.","zh":"这位演讲者在镇上是个知名的反共济会者。"}]}],"synonyms":["anti-Masonic","anti-Freemason","anti-Freemasonry"],"phonetic":"/ˌæn.ti.məˈsɑ.nɪk/","extraExplanation":["“antimasonic”常见于历史与政治语境，尤其与19世纪美国的“反共济会运动（Anti-Masonic movement/Party）”有关。当时一些人担心共济会的秘密仪式与社会影响力，进而形成政治与社会上的反对力量。","写法上也常见为“anti-Masonic”（加连字符、M大写），更强调其与“Freemasons/Free Masonry（共济会/共济会组织）”的专名关系。"]}
{"word":"Antimasonry","summary":{"en":"Antimasonry is opposition to Freemasonry, especially as a social or political movement.","zh":"Antimasonry 指对共济会的反对立场或相关的社会、政治运动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to Freemasonry (the fraternal organization of Freemasons), often based on political, religious, or social concerns; also the movement or ideology that promotes such opposition.","zh":"反共济会主义；对共济会（共济会会员组成的兄弟会组织）的反对立场或运动，常出于政治、宗教或社会方面的担忧。"},"examples":[{"en":"Antimasonry grew in the United States after the disappearance of William Morgan in 1826.","zh":"1826年威廉·摩根失踪后，反共济会主义在美国迅速发展。"},{"en":"Some newspapers at the time used antimasonry to argue that secret societies threatened democracy.","zh":"当时一些报纸借助反共济会主义来主张秘密社团会威胁民主。"},{"en":"The Antimasonic Party was one of the first third parties in U.S. politics.","zh":"反共济会党是美国政治中最早的第三党之一。"}]}],"synonyms":["anti-Freemasonry","anti-Masonic movement","opposition to Freemasonry"],"phonetic":"/ˌæn.tiˈmeɪ.sən.ri/","extraExplanation":["“Antimasonry”在历史语境中常与19世纪美国的“反共济会运动”相关：人们担心共济会的秘密仪式与人脉网络会影响司法、公职任命与政治透明度。","著名事件是威廉·摩根（William Morgan）计划揭露共济会内幕后失踪，引发公众猜疑与舆论风暴，推动了反共济会党（Anti-Masonic Party）的兴起。","在不同国家与时期，反共济会主义也可能与宗教冲突、阴谋论叙事或反精英情绪交织；阅读相关材料时，注意区分有史料支持的批评与缺乏证据的指控。"]}
{"word":"antimasonry","summary":{"en":"Antimasonry means opposition to Freemasonry, and it can also describe ideas, speech, or actions against Freemasons.","zh":"Antimasonry 指“反共济会”，既可指反对共济会的思想/运动，也可作形容词表示“反共济会的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to Freemasonry (the organization of Freemasons), or a belief that it has harmful influence in society or politics.","zh":"反共济会；反对共济会（共济会组织）或认为其在社会、政治中有不良影响的观点/立场。"},"examples":[{"en":"In the 1800s, antimasonry became a powerful political movement in the United States.","zh":"在19世纪，反共济会在美国发展成一股强大的政治运动。"},{"en":"The article discusses how antimasonry shaped public distrust of secret societies.","zh":"这篇文章讨论了反共济会如何影响公众对秘密社团的不信任。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to or showing opposition to Freemasons or Freemasonry.","zh":"反共济会的；反对共济会（或共济会成员）的。"},"examples":[{"en":"He gave an antimasonry speech during the campaign.","zh":"他在竞选期间发表了一场反共济会的演讲。"},{"en":"Some newspapers at the time took an antimasonry tone.","zh":"当时一些报纸带有反共济会的基调。"}]}],"synonyms":["anti-Freemasonry","anti-Masonic sentiment","opposition to Freemasonry"],"phonetic":"/ˌæn.tiˈmeɪ.sə.nɹi/","extraExplanation":["“Antimasonry”在美国历史语境中特别常见：19世纪早期因“威廉·摩根事件”（William Morgan，1826年失踪，被认为与揭露共济会秘密有关）引发公众恐慌，推动了反共济会运动。","美国曾出现“反共济会党”（Anti-Masonic Party，约1828–1830年代），常被认为是美国最早的第三党之一，也与当时更广泛的“反秘密社团”情绪相关。","写作中常见搭配：antimasonry movement（反共济会运动）、antimasonic sentiment（反共济会情绪）。也常见拼写变体：anti-Masonry / anti-Masonic（带连字符、分开写）。"]}
{"word":"antimasque","summary":{"en":"An antimasque is a comic or grotesque dance-and-music interlude that contrasts with a formal court masque.","zh":"antimasque 指在正式宫廷假面剧前或间隙上演的滑稽/怪诞插演，用来与主假面剧形成对比。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A short comic or grotesque performance (often with dancing and music) presented before or between the parts of a formal court masque, contrasting with the main masque’s elegance.","zh":"（反面假面剧）一种短小的滑稽或怪诞表演（常含舞蹈与音乐），常在正式“假面剧”（masque）之前或间歇上演，用来与主假面剧的庄重华丽形成对比。"},"examples":[{"en":"The antimasque featured clowns and chaotic dancing before the noble masque began.","zh":"在高雅的假面剧开始前，反面假面剧先用小丑和混乱的舞蹈热场。"},{"en":"In some Jacobean productions, the antimasque mocked bad manners to highlight the masque’s ideal order.","zh":"在一些詹姆斯一世时期的作品中，反面假面剧讽刺失礼行为，以突出主假面剧所呈现的理想秩序。"}]}],"synonyms":["comic interlude","grotesque interlude","burlesque interlude"],"phonetic":"/ˌæn.tiˈmæsk/","extraExplanation":["“antimasque”主要用于英国16—17世纪的宫廷娱乐传统，尤其是伊丽莎白一世末期到詹姆斯一世（Jacobean）时期。它常用“混乱/怪诞/滑稽”的角色（如醉汉、妖怪、乡巴佬等）对照主假面剧中象征秩序、美德与和谐的主题。","文学与戏剧史中常提到本·琼森（Ben Jonson）的宫廷假面剧：他常在作品里安排 antimasque 作为“反衬”，让观众从混乱转入庄严的主场景。","与“masque”相比，antimasque更像“讽刺短场/插演”，强调对比效果；现代英语里偶尔会被借用来比喻“用反差来衬托正题”的开场或插段。"]}
{"word":"antimasquer","summary":{"en":"“Anti-masker” means a person (or viewpoint) against wearing face masks or mask rules.","zh":"“Anti-masker”指反对戴口罩或反对口罩规定的人（或立场）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposes wearing face masks (especially for public health reasons) and may resist mask rules","zh":"反对戴口罩的人（尤指出于公共卫生原因的口罩佩戴或规定）"},"examples":[{"en":"During the pandemic, some anti-maskers protested outside the city hall.","zh":"在疫情期间，一些反口罩人士在市政厅外抗议。"},{"en":"The store asked an anti-masker to leave for refusing to follow the mask policy.","zh":"商店因一名反口罩者拒绝遵守口罩规定而请他离开。"}]},{"partOfSpeech":"adj.","definition":{"en":"opposing face masks or mask requirements","zh":"反对口罩（或口罩规定）的"},"examples":[{"en":"He shared anti-masker posts on social media.","zh":"他在社交媒体上分享反口罩的帖子。"},{"en":"The meeting turned tense because of anti-masker comments.","zh":"由于反口罩的言论，会议气氛变得紧张。"}]}],"synonyms":["mask opponent","anti-mask person","mask skeptic"],"phonetic":"/ˌænti ˈmæskɚ/","extraExplanation":["“anti-masker”常见于英语媒体，尤其在新冠疫情（COVID-19）期间讨论公共卫生政策时。它通常带有批评或负面语气，使用时要注意语境与礼貌。","你输入的“antimasquer”更像拼写错误；常见写法是“anti-masker”（也可写作“anti masker”）。"]}
{"word":"antimasquerade","summary":{"en":"Antimasquerade means “against masquerading,” especially opposing or banning masks/disguises in public (often in laws or policies).","zh":"Antimasquerade 指“反化装/反戴面具”，尤用于形容反对或禁止在公共场合戴面具、伪装身份的法律或政策。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to masquerades or to wearing masks/disguises in public (often used to describe laws, rules, or attitudes).","zh":"反对化装舞会或反对在公共场合戴面具/伪装的（常用来形容法律、规定或态度）。"},"examples":[{"en":"The city passed an antimasquerade ordinance to discourage people from hiding their identities at rallies.","zh":"该市通过了反伪装条例，以阻止人们在集会中隐藏身份。"},{"en":"Some critics argue that antimasquerade policies can conflict with privacy or free-speech concerns.","zh":"一些批评者认为，反伪装政策可能与隐私或言论自由的考量发生冲突。"}]},{"partOfSpeech":"n.","definition":{"en":"A law, policy, or movement that bans or discourages mask-wearing or disguises in public.","zh":"禁止或限制公共场合戴面具/伪装的法律、政策或运动。"},"examples":[{"en":"The judge reviewed the antimasquerade before deciding whether it applied to the protest.","zh":"法官在裁定该规定是否适用于抗议活动前，审查了这项反伪装规定。"},{"en":"Historians note that some antimasquerades were written to target specific groups.","zh":"历史学者指出，一些反伪装法规的制定是为了针对特定群体。"}]}],"synonyms":["anti-masquerade","anti-mask (context-dependent)","anti-disguise","mask-ban","anti-masquerade law"],"phonetic":"/ˌæntiˈmæs.kəˌreɪd/","extraExplanation":["“antimasquerade”更常见的写法是带连字符的“anti-masquerade”。在美国语境中，它常出现在“anti-masquerade law”（反伪装法）里，指禁止在公共场合戴面具或遮挡身份的规定。","历史上，一些反伪装法与打击三K党（Ku Klux Klan）戴头罩活动有关；但在其他时期也可能被用来限制抗议者匿名，因此在公民自由（隐私、言论/集会自由）讨论中常被提到。","与“mask”（面具）有关的词还有：anti-mask（反口罩/反戴口罩，语境可能与防疫有关）、anti-disguise（反伪装），含义相近但使用场景不同。"]}
{"word":"antimaterialism","summary":{"en":"Antimaterialism means opposing materialism—valuing life beyond money and possessions; it can also mean a philosophical rejection of a purely material view of reality.","zh":"Antimaterialism 指反对物质主义：不把金钱与占有当作人生核心；在哲学语境中也可指反唯物论。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to materialism; the belief that material wealth and possessions should not be the main goal or measure of a good life.","zh":"反对物质主义；认为金钱与物质占有不应成为人生主要目标或衡量幸福与成功的标准。"},"examples":[{"en":"Her antimaterialism led her to buy fewer things and focus more on relationships.","zh":"她的反物质主义让她减少购物，把更多精力放在人际关系上。"},{"en":"The film is a critique of consumer culture and a call for antimaterialism.","zh":"这部电影批判消费文化，并呼吁反物质主义。"}]},{"partOfSpeech":"n.","definition":{"en":"In philosophy, a view that reality is not purely material and that mind, spirit, or ideas are fundamental in understanding the world.","zh":"（哲学）反唯物论：认为现实不只是物质构成，心灵、精神或观念在理解世界时同样根本。"},"examples":[{"en":"Some religious traditions are associated with philosophical antimaterialism.","zh":"一些宗教传统常与哲学上的反唯物论相关。"}]}],"synonyms":["anti-materialism","anti-consumerism","simple living","minimalism","spiritualism"],"phonetic":"/ˌæn(t)i məˈtɪriəˌlɪzəm/","extraExplanation":["词形上：anti- 表示“反对”，materialism 表示“物质主义/唯物主义”。因此 antimaterialism 通常指“反物质主义（生活态度）”，在学术语境中也可指“反唯物论（哲学立场）”。","在日常英语里更常见的说法是 anti-materialism / anti-materialist values，或直接说 a rejection of materialism、anti-consumerism（反消费主义，含义相近但更聚焦消费行为）。"]}
{"word":"antimaterialist","summary":{"en":"Antimaterialist means opposing materialism—valuing meaning, relationships, or ideas over money and possessions; it can also refer to a person with those beliefs.","zh":"Antimaterialist 指反对物质主义（物质至上），更重视意义、关系或理念而非金钱与财物；也可指持这种观念的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to materialism; believing that physical things, money, and possessions are not the most important values in life.","zh":"反对物质主义的；认为金钱、财物等物质并非人生最重要价值的。"},"examples":[{"en":"She has an antimaterialist attitude and prefers simple living.","zh":"她持反物质主义的态度，更喜欢简朴生活。"},{"en":"The film offers an antimaterialist message: relationships matter more than wealth.","zh":"这部电影传达了反物质主义的信息：关系比财富更重要。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who is opposed to materialism.","zh":"反物质主义者；反对物质主义的人。"},"examples":[{"en":"He describes himself as an antimaterialist who avoids luxury brands.","zh":"他形容自己是个反物质主义者，刻意避开奢侈品牌。"}]}],"synonyms":["anti-consumerist","nonmaterialistic","anti-materialistic","minimalist (often related)"],"phonetic":"/ˌæn.ti.məˈtɪr.i.ə.lɪst/","extraExplanation":["这个词通常用于社会价值观或生活方式的讨论（如“消费主义/成功等于财富”的观念）。注意它常见的含义是“反对把金钱与物质看得最重要”，不一定表示“反对一切物质”或“贫穷即美德”。","在哲学语境里，materialism 也可能指“唯物主义”（认为现实的基础是物质）。antimaterialist 有时也可指反对这种哲学立场，但在日常英语中更多指反对“物质至上”的生活态度。"]}
{"word":"antimaterialistic","summary":{"en":"Antimaterialistic means not valuing money and possessions as the most important things in life.","zh":"antimaterialistic 指不把金钱和财物视为人生最重要目标的“反物质主义的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to materialism; not focused on money, possessions, or physical goods as the main goal in life.","zh":"反物质主义的；不把金钱、财物或物质享受当作人生主要目标的。"},"examples":[{"en":"She has an antimaterialistic attitude and values experiences over expensive things.","zh":"她有一种反物质主义的态度，更重视经历而不是昂贵的东西。"},{"en":"The book promotes an antimaterialistic message: kindness matters more than wealth.","zh":"这本书传达了反物质主义的信息：善良比财富更重要。"}]}],"synonyms":["nonmaterialistic","anti-consumerist","unmaterialistic","minimalist (context-dependent)"],"phonetic":"/ˌæn.ti.məˌtɪr.i.əˈlɪs.tɪk/","extraExplanation":["“antimaterialistic”由前缀 anti-（反对）+ materialistic（物质主义的）构成，常用于描述价值观或生活方式。","它通常带有正面评价（如“朴素、重精神”），但在不同语境里也可能被用来批评“忽视现实需求”。","相关词：materialistic（物质至上的）、anti-consumerist（反消费主义的）、minimalist（极简主义的；强调减少物品）。"]}
{"word":"antimaterialistically","summary":{"en":"“Antimaterialistically” means “in an anti-materialistic way,” valuing non-material things over money and possessions.","zh":"“Antimaterialistically”意为“以反物质主义的方式”，强调重视非物质价值而非金钱与占有。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that opposes materialism (the idea that material possessions and wealth are the most important things).","zh":"以反物质主义（反对把财富与物质占有看得最重要）的方式；以不崇尚物欲的态度。"},"examples":[{"en":"They chose to live antimaterialistically, focusing on relationships and community service instead of buying new things.","zh":"他们选择以反物质主义的方式生活，把重心放在人际关系和社区服务上，而不是不断买新东西。"},{"en":"The film portrays the hero antimaterialistically, showing that happiness doesn’t come from luxury.","zh":"这部电影以反物质主义的角度塑造主角，强调幸福不来自奢华。"}]}],"synonyms":["non-materialistically","in an anti-materialistic way","with anti-materialist values"],"phonetic":"/ˌænti məˌtɪriəˈlɪstɪkli/","extraExplanation":["这个词比较少见，更多时候人们会说：in an anti-materialistic way / non-materialistically / with anti-materialist values。","构词法：anti-（反对）+ materialistic（物质主义的）+ -ally（以……方式）。","注意区分：material（物质的/材料）≠ materialistic（物欲重、崇尚物质的）。因此 antimaterialistically 指“反对物欲至上”，不是“反物质（反材料）”。"]}
{"word":"antimatrimonial","summary":{"en":"“Antimatrimonial” means opposed to marriage or matrimony.","zh":"“antimatrimonial”意为“反对婚姻（制度）或反对结婚的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to marriage or the institution of matrimony; expressing an attitude against getting married.","zh":"反对婚姻的；对结婚或婚姻制度持否定态度的。"},"examples":[{"en":"His antimatrimonial views made family dinners a bit tense.","zh":"他反婚姻的观点让家庭聚餐有点尴尬紧张。"},{"en":"The novel’s antimatrimonial heroine rejects every proposal and chooses independence.","zh":"小说里那位反婚姻的女主角拒绝了所有求婚，选择独立生活。"},{"en":"Some critics read the play as antimatrimonial satire rather than a simple love story.","zh":"一些评论家认为这部戏是反婚姻的讽刺作品，而不只是简单的爱情故事。"}]}],"synonyms":["anti-marriage","opposed to marriage","anti-matrimony"],"phonetic":"/ˌæntaɪˌmætrəˈmoʊniəl/","extraExplanation":["这个词非常少见，多用于较正式或带讽刺/批评色彩的语境（如评论文章、文学分析），日常英语里更常说：anti-marriage / opposed to marriage / not interested in marriage。","构词上：anti-（反对）+ matrimonial（婚姻的）。因此它强调的是“立场/态度上反对婚姻”，不一定等同于“反对恋爱”或“独身主义”。"]}
{"word":"antimatrimonialist","summary":{"en":"An antimatrimonialist is someone who opposes marriage or promotes anti-marriage views.","zh":"antimatrimonialist 指反对婚姻或主张反婚姻观点的人（也可作形容词表示“反婚姻的”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is opposed to marriage (especially as a social institution) or argues against people getting married","zh":"反对婚姻的人；主张不结婚（尤其反对婚姻作为一种社会制度）的人"},"examples":[{"en":"He called himself an antimatrimonialist and said marriage was an outdated institution.","zh":"他自称是反婚姻主义者，并说婚姻是一种过时的制度。"},{"en":"In the debate, the antimatrimonialists argued that people should not feel pressured to marry.","zh":"在辩论中，反婚姻主义者认为人们不应感到被迫结婚。"}]},{"partOfSpeech":"adj.","definition":{"en":"opposed to marriage; expressing anti-marriage views","zh":"反对婚姻的；表达反婚姻观点的"},"examples":[{"en":"Her essay takes an antimatrimonialist position on modern relationships.","zh":"她的文章对现代关系持反婚姻立场。"}]}],"synonyms":["anti-marriage advocate","opponent of marriage","marriage skeptic"],"phonetic":"/ˌæntiˌmætrəˈmoʊniəlɪst/","extraExplanation":["这个词非常少见，多见于学术讨论、辩论语境或带有讽刺/夸张的写法，日常英语里更常说 anti-marriage 或 opposed to marriage。","构词：anti-（反对）+ matrimonial（婚姻的）+ -ist（……主义者/信奉者）。matrimonial 来自拉丁语 matrimonium（婚姻）。"]}
{"word":"antimatter","summary":{"en":"Antimatter is matter made of antiparticles, which releases energy when it meets normal matter.","zh":"反物质是由反粒子组成的物质，与普通物质相遇会湮灭并释放能量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Material made of antiparticles; when it meets ordinary matter, both can be destroyed in a burst of energy.","zh":"由反粒子组成的物质；当它与普通物质相遇时，会发生湮灭并释放大量能量。"},"examples":[{"en":"Scientists can create tiny amounts of antimatter in particle accelerators.","zh":"科学家可以在粒子加速器中制造极少量的反物质。"},{"en":"When antimatter touches matter, they annihilate and release energy.","zh":"反物质接触普通物质时，会发生湮灭并释放能量。"},{"en":"In science fiction, antimatter is often used as a powerful fuel.","zh":"在科幻作品中，反物质常被当作强大的燃料。"}]}],"synonyms":["anti-matter"],"phonetic":"/ˈæn.tiˌmæt̬.ɚ/","extraExplanation":["在现代物理中，“反物质”并不是“反对物质”的意思，而是指与普通粒子对应、但电荷等量子数相反的“反粒子”（如电子的反粒子是正电子 positron）。","日常语境里 antimatter 多出现在科普、新闻或科幻中；在真实实验里只能产生极微量，储存也非常困难，因此并不是现实可行的能源。","词形上 anti- 表示“相反/对立”，matter 表示“物质”，合起来字面是“反向的物质”。常见相关词：antiparticle（反粒子）、annihilation（湮灭）、particle accelerator（粒子加速器）。"]}
{"word":"antimechanism","summary":{"en":"Anti-mechanism is the view that some things cannot be fully explained by machine-like, purely mechanical cause-and-effect models.","zh":"Antimechanism（反机械论）指认为某些事物无法完全用像机器一样的纯机械因果模型来解释的观点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to mechanistic explanations (the idea that something—especially life, mind, or society—can be fully explained as a machine-like system of parts and causes).","zh":"反机械论；反对“机械式解释”（认为某事物——尤其是生命、心灵或社会——可以完全用像机器一样的部件与因果来解释）的观点。"},"examples":[{"en":"Some philosophers argue for anti-mechanism when discussing human consciousness.","zh":"一些哲学家在讨论人类意识时主张反机械论。"},{"en":"In biology, anti-mechanism can include views that life cannot be reduced to chemistry alone.","zh":"在生物学中，反机械论可能包含“生命不能仅被还原为化学反应”的观点。"}]}],"synonyms":["anti-mechanistic view","anti-reductionism","non-mechanistic approach"],"phonetic":"/ˌæntiˈmɛkəˌnɪzəm/","extraExplanation":["这个词比较少见，更常见的写法是 **anti-mechanism**（带连字符）或直接用更常用的表达：**anti-mechanistic**（反机械论的/反机械主义的，形容词）以及 **anti-mechanistic view/approach**。","在学术语境中，它通常和 **mechanism / mechanistic explanation / reductionism（还原论）** 一起出现，强调“仅靠像机器一样的因果链与部件拼装”不足以解释某些现象（如意识、目的性、意义、复杂社会行为等）。"]}
{"word":"antimechanist","summary":{"en":"Antimechanist means opposing mechanistic (machine-like, purely physical) explanations, or a person who holds that view.","zh":"antimechanist 指反对机械论（把事物完全当作机器式、纯物理机制来解释）的；也可指反机械论者。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to mechanistic explanations (the idea that life, mind, or nature can be fully explained like a machine through physical parts and laws).","zh":"反对机械论解释的（认为生命、心灵或自然不能仅像机器一样用物质部件与规律完全解释）。"},"examples":[{"en":"Some philosophers take an antimachanist view of consciousness, arguing it cannot be reduced to brain mechanisms alone.","zh":"一些哲学家对意识持反机械论观点，认为意识不能仅被还原为大脑机制。"},{"en":"In early debates about evolution, a few thinkers were strongly antimachanist and favored vital forces.","zh":"在早期有关进化的争论中，有些思想家强烈反机械论，偏向生命力等观点。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who holds antimachanist views.","zh":"反机械论者；持反机械论观点的人。"},"examples":[{"en":"As an antimachanist, she criticized models that treated human behavior like a predictable machine.","zh":"作为反机械论者，她批评把人类行为当作可预测机器的模型。"}]}],"synonyms":["anti-mechanistic","nonmechanistic","vitalist (in some historical contexts)","holistic (related, not identical)"],"phonetic":"/ˌæn.ti.məˈkæn.ɪst/","extraExplanation":["这个词多见于哲学、科学史与心灵哲学/生物学语境，常与“mechanism（机械论）/mechanistic（机械论的）”对立。反机械论者通常强调：整体性、目的性（teleology）、主观体验（qualia）、或“生命是否仅是物理化学过程”的争议。","拼写上也常见变体：anti-mechanist / ant mechanist（加连字符更常见）。"]}
{"word":"antimechanistic","summary":{"en":"“Antimechanistic” means opposing purely machine-like (mechanistic) explanations, especially of life or mind.","zh":"“antimechanistic”指反对用纯机械论（像机器一样的因果机制）来解释生命或心灵等现象。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to the idea that living things, minds, or society can be fully explained as machine-like systems governed only by physical cause-and-effect (a “mechanistic” view).","zh":"反对“机械论”观点的；认为生命、心灵或社会不能仅用像机器一样的物理因果关系完全解释。"},"examples":[{"en":"Some early biologists were strongly antmechanistic and believed life required a special vital force.","zh":"一些早期生物学家强烈反机械论，认为生命需要一种特殊的“生命力”。"},{"en":"Her antmechanistic approach focuses on meaning and purpose, not just measurable processes.","zh":"她的反机械论方法强调意义与目的，而不只关注可测量的过程。"}]}],"synonyms":["anti-mechanistic","nonmechanistic","anti-reductionist","holistic","vitalistic"],"phonetic":"/ˌæn.taɪ.məˈkæn.ɪs.tɪk/","extraExplanation":["“antimechanistic”多见于哲学、科学史与生物学语境，常与“vitalism（生命力论）”“holism（整体论）”“teleology（目的论）”等思想相关，用来反对把生命或意识简化为纯粹的机械运作。","拼写上是 anti-（反对）+ mechanistic（机械论的）。在学术写作里，它常用来描述某种立场或解释框架，而不是日常口语常用词。"]}
{"word":"antimechanistically","summary":{"en":"“Antimechanistically” means “in a way that rejects mechanistic (machine-like, purely causal) explanations.”","zh":"“antimechanistically”表示“以反对机械论（把事物当作机器般纯因果系统来解释）的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an anti-mechanistic way; opposing or rejecting the idea that something (especially life, mind, or society) can be fully explained as a machine-like system of parts and causes.","zh":"以反机械论的方式；反对或拒绝把事物（尤其是生命、心灵或社会）完全解释为“像机器一样”的因果与部件系统。"},"examples":[{"en":"Some philosophers argue that consciousness cannot be explained entirely mechanistically, speaking antimechanistically about the mind.","zh":"一些哲学家认为意识无法完全用机械论解释，因此在谈论心灵时采取反机械论的观点。"},{"en":"The essay reads antimechanistically, emphasizing creativity and meaning over simple cause-and-effect models.","zh":"这篇文章带有反机械论色彩，更强调创造力与意义，而不是简单的因果模型。"}]}],"synonyms":["anti-mechanistically","nonmechanistically","holistically (sometimes, depending on context)"],"phonetic":"/ˌæn.taɪməˈkæn.ɪ.stɪ.kli/","extraExplanation":["“机械论（mechanism / mechanistic）”常见于科学与哲学语境，指用物理因果、可分解的部件、规律来解释复杂现象。相对地，“反机械论”常与强调目的、意义、整体性或生命/心灵的不可还原性等观点相关。","该词非常少见，多出现在学术写作（哲学史、科学史、心灵哲学、生物学理论）中。日常英语里通常会说：in an anti-mechanistic way 或 take an anti-mechanistic view。"]}
{"word":"antimechanization","summary":{"en":"Anti-mechanization means opposition to mechanization or being against the increased use of machines and automation.","zh":"antimechanization 指反对机械化（或反机械化的态度），即反对机器与自动化的扩张。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"opposition to mechanization (the increasing use of machines and automated processes), especially in work, industry, or society.","zh":"反机械化；反对机械化（指反对在工作、工业或社会中越来越多地使用机器与自动化流程）。"},"examples":[{"en":"The group’s anti-mechanization message focused on protecting traditional crafts.","zh":"该团体的反机械化主张强调保护传统手工艺。"},{"en":"Anti-mechanization protests began after factories introduced labor‑saving machines.","zh":"工厂引入节省劳力的机器后，反机械化抗议随之出现。"}]},{"partOfSpeech":"adj.","definition":{"en":"showing or expressing opposition to mechanization.","zh":"反机械化的；表达反对机械化的。"},"examples":[{"en":"She wrote an anti-mechanization essay criticizing the social cost of automation.","zh":"她写了一篇反机械化文章，批评自动化带来的社会成本。"},{"en":"The novel has an anti-mechanization tone, valuing human skill over machines.","zh":"这部小说带有反机械化的基调，推崇人类技能而非机器。"}]}],"synonyms":["anti-automation","anti-industrialization","anti-technology (context-dependent)","Luddite (often historical/figurative)"],"phonetic":"/ˌæntiˌmɛkənəˈzeɪʃən/","extraExplanation":["“anti-”意为“反对……”，而“mechanization”是“机械化”。这个词多用于社会评论、劳工史或文化批评语境。","在英语文化语境里，它常让人联想到19世纪初英国的卢德派（Luddites），他们反对某些机器取代工人工作；但“anti-mechanization”不一定等同于“反科技”，也可能只是反对某种机械化带来的劳动、审美或伦理后果。"]}
{"word":"antimediaeval","summary":{"en":"Antimedieval means opposed to medieval times or medieval ideas/styles, sometimes used more loosely to mean “anti–old-fashioned/backward.”","zh":"antimedieval 指反对中世纪（或中世纪的思想、风格、制度）；也可泛指反对被称为“中世纪式/落后”的旧传统。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to the Middle Ages (medieval times) or to medieval ideas, styles, or institutions; not favoring “medieval” approaches.","zh":"反中世纪的；反对（或不喜欢）中世纪时代及其中世纪思想、风格或制度的；不赞成“中世纪式”的做法。"},"examples":[{"en":"The author takes an antimedieval view of the church’s power in Europe.","zh":"这位作者对教会在欧洲的权力持反中世纪的观点。"},{"en":"Some critics call the law antimedieval because it rejects feudal privileges.","zh":"一些评论家称这部法律是反中世纪的，因为它否定封建特权。"}]},{"partOfSpeech":"adj.","definition":{"en":"(more loosely, sometimes used in debate) describing something seen as rejecting “old-fashioned” or “backward” traditions labeled as medieval.","zh":"（更宽泛、常用于争论中）形容被认为是在反对那些被贴上“中世纪式/落后”标签的旧传统。"},"examples":[{"en":"He argued that public education is an antimedieval force because it challenges inherited status.","zh":"他认为公共教育是一种反中世纪的力量，因为它挑战世袭地位。"},{"en":"The speech used “antimedieval” as a compliment, meaning modern and progressive.","zh":"那篇演讲把“反中世纪”当作褒义，意思是现代、进步。"}]}],"synonyms":["anti-medieval","nonmedieval","modernist (context-dependent)","anti-feudal (specific context)"],"phonetic":"/ˌæn.ti.mɛˈdiː.vəl/","extraExplanation":["这个词比较少见；更常见的拼写是 **anti-medieval**（带连字符）或 **anti-medievalism**（名词：反中世纪倾向/反中世纪主义）。","注意：英语里把“medieval（中世纪的）”当成“落后、残酷、不文明”的标签是常见修辞，但在历史语境中可能带有偏见；写作时最好说明你具体反对的是哪种制度或观念（例如封建制度、宗教审判、等级特权等）。"]}
{"word":"antimediaevalism","summary":{"en":"Anti-medievalism means negative attitudes toward the Middle Ages or stereotypes that treat “medieval” as an insult; it can also mean the scholarly study of such bias.","zh":"Anti-medievalism 指对中世纪的负面态度或把“中世纪式”当贬义的刻板印象；也可指研究这种偏见的学术视角。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to, distrust of, or negative attitudes toward the Middle Ages (medieval period) or things considered “medieval,” often portraying them as backward, violent, or irrational.","zh":"反中世纪主义；对中世纪（或被称为“中世纪式”的事物）的反感、不信任或负面态度，常把它描绘成落后、暴力或不理性。"},"examples":[{"en":"Some textbooks show anti-medievalism by describing the Middle Ages as a “dark” time with no progress.","zh":"一些教材用“黑暗时代”来描述中世纪，这体现了反中世纪主义。"},{"en":"The film’s anti-medievalism makes the period look only brutal, ignoring art and learning.","zh":"这部电影的反中世纪主义只呈现残酷的一面，忽视了艺术与学术。"}]},{"partOfSpeech":"n.","definition":{"en":"In academic writing, a critical approach that studies how modern culture stereotypes, rejects, or misuses images of the medieval past.","zh":"（学术用语）研究现代文化如何刻板化、排斥或滥用“中世纪形象”的批评视角。"},"examples":[{"en":"Her research on anti-medievalism examines how politicians use “medieval” as an insult.","zh":"她关于反中世纪主义的研究探讨了政治人物如何把“中世纪”当作侮辱词。"},{"en":"The article uses anti-medievalism to explain why certain museums avoid medieval themes.","zh":"这篇文章用反中世纪主义来解释为何某些博物馆回避中世纪主题。"}]}],"synonyms":["anti-medieval bias","anti-medieval sentiment","medieval stereotyping","anti-medieval prejudice"],"phonetic":"/ˌæn.ti məˈdi.vəlˌɪ.zəm/","extraExplanation":["这个词更常见的拼写是 **anti-medievalism**（有连字符）；你写的 **antimediaevalism** 属于较少见/变体拼写，其中 **mediaeval** 是英式拼写（对应美式 **medieval**）。","在英语里把某事称为 “medieval” 常带贬义（如“野蛮、落后”），这类用法本身就可能被学界视为一种反中世纪主义的表现。"]}
{"word":"antimediaevalist","summary":{"en":"An anti-mediaevalist is someone (or something) that opposes medievalism or rejects medieval-style ideas and aesthetics.","zh":"anti-mediaevalist 指反对中世纪主义、排斥中世纪式观念或审美的人（或立场/作品）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposes medievalism or rejects the ideas, styles, or values associated with the Middle Ages","zh":"反对“中世纪主义”的人；排斥或否定与中世纪（风格/观念/价值）相关事物的人"},"examples":[{"en":"Some anti-mediaevalists argued that society should move away from medieval symbols and traditions.","zh":"一些反中世纪主义者认为社会应该远离中世纪的象征与传统。"},{"en":"He became an anti-mediaevalist after reading critiques of romanticized medieval history.","zh":"读过对“浪漫化中世纪历史”的批评之后，他成了反中世纪主义者。"}]},{"partOfSpeech":"adj.","definition":{"en":"opposing medievalism or anything seen as “medieval” in style or thinking","zh":"反中世纪主义的；反对被视为“中世纪式”的风格或思维的"},"examples":[{"en":"Her anti-mediaevalist essay criticized the use of medieval imagery in politics.","zh":"她那篇反中世纪主义的文章批评了政治中使用中世纪意象的做法。"},{"en":"The group took an anti-mediaevalist stance toward the revival of medieval-style architecture.","zh":"该团体对复兴中世纪风格建筑持反中世纪主义立场。"}]}],"synonyms":["anti-medievalist","anti-medieval","opponent of medievalism","modernist (context-dependent)"],"phonetic":"/ˌæntaɪ miˈdiːvəlɪst/","extraExplanation":["“antimediaevalist”更常见的写法是“anti-mediaevalist”或“anti-medievalist”。其中“mediaeval”是英式拼写，“medieval”是更常见的现代拼写（尤其在美式英语中）。","这个词通常出现在历史写作、文化批评或艺术/建筑风格讨论中，表示反对把中世纪理想化（romanticize）或在现代社会中复兴中世纪风格与价值观的立场。"]}
{"word":"antimediaevally","summary":{"en":"Antimediaevally (more commonly spelled antimedievally) means “in an anti-medieval way.”","zh":"antimediaevally（更常见写法 antimedievally）意为“以反中世纪的方式/立场”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that opposes, criticizes, or rejects medieval (Middle Ages) ideas, styles, or values.","zh":"以反对、批评或拒绝中世纪（中古时期）观念、风格或价值观的方式。"},"examples":[{"en":"The architect argued antimedievally, insisting that modern buildings should avoid Gothic ornaments.","zh":"这位建筑师以反中世纪的立场主张，现代建筑应避免哥特式装饰。"},{"en":"Some writers speak antimedievally when they describe the Middle Ages as only dark and backward.","zh":"一些作家在把中世纪描述成只有黑暗与落后时，会以反中世纪的口吻在说话。"}]}],"synonyms":["anti-medievally","oppositionally","critically","dismissively"],"phonetic":"/ˌæntaɪməˈdiːvəli/","extraExplanation":["这个词非常少见，更常见的是形容词 anti-medieval（反中世纪的）或用更自然的表达：in an anti-medieval way / from an anti-medieval perspective。","拼写方面：medieval 与 mediaeval 都对；mediaeval 更偏英式传统拼法。你输入的“antimediaevally”相当于“anti- + mediaeval + -ly”（反中世纪地）。","使用语境多见于艺术史、建筑史或文学批评：用来形容某种观点/论述“反中世纪”，而不一定是一般日常英语。"]}
{"word":"antimedical","summary":{"en":"Antimedical means “against medicine/medical treatment” or “rejecting medical evidence.”","zh":"antimedical 指“反对医疗/医学治疗”或“否定医学证据”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to medicine or medical practice; against doctors, hospitals, or medical treatment (often describing an attitude or movement).","zh":"反医疗的；反对医学或医疗实践的（常指一种态度或社会思潮，反对医生、医院或治疗）。"},"examples":[{"en":"Some online communities promote an antimedical attitude and discourage people from seeing doctors.","zh":"一些网络社群宣扬反医疗的态度，劝人不要去看医生。"},{"en":"The documentary explores antimedical beliefs that grew during the pandemic.","zh":"这部纪录片探讨了疫情期间滋生的反医疗观念。"}]},{"partOfSpeech":"adj.","definition":{"en":"not based on medical science; rejecting medical explanations or evidence (often used critically).","zh":"非医学依据的；拒绝医学解释或证据的（常带批评意味）。"},"examples":[{"en":"The article criticized antimedical claims that had no supporting data.","zh":"文章批评了那些没有数据支持的反医学论断。"},{"en":"Be careful with antimedical advice from unverified sources.","zh":"要警惕来自不可靠来源的反医学建议。"}]}],"synonyms":["anti-medical","anti-medicine","anti-science (context-dependent)","anti-healthcare (sometimes)"],"phonetic":"/ˌæn.tiˈmɛd.ɪ.kəl/","extraExplanation":["“antimedical”在日常英语中不算常见，更常见的写法是带连字符的“anti-medical”。它通常用于描述对主流医疗体系的敌意或不信任。","注意区分：它不等于“alternative medicine（替代/另类疗法）”。“alternative medicine”强调不同于主流医疗的方法；而“anti-medical”强调反对或否定医疗本身。","在讨论社会议题时，这个词可能带有立场色彩；表达时可用更中性的说法，如“skeptical of modern medicine（对现代医学持怀疑态度）”。"]}
{"word":"antimedically","summary":{"en":"“Antimedically” means “in a way that opposes medicine or medical treatment.”","zh":"“antimedically”表示“以反对医学/医疗治疗的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is opposed to medical treatment, medical advice, or the medical profession.","zh":"以反对医疗治疗、医疗建议或医学界的方式；反医疗地。"},"examples":[{"en":"Some groups speak antimedically, arguing that modern medicine is harmful.","zh":"有些团体用反医疗的方式发言，声称现代医学有害。"},{"en":"The article presents vaccination antimedically, focusing only on fears instead of evidence.","zh":"这篇文章以反医疗的角度呈现疫苗接种，只强调恐惧而不谈证据。"}]}],"synonyms":["anti-medically (hyphenated form)","in an anti-medical way","opposed to medical advice"],"phonetic":"/ˌæn.tiˈmɛd.ɪ.kli/","extraExplanation":["“antimedically”由 anti-（反对）+ medical（医疗的）+ -ly（副词后缀）构成，意思直观，但在日常英语里非常少见。更常见的表达是：“in an anti-medical way / with an anti-medicine attitude / opposed to medical advice”。","在写作中使用该词时要注意语气：它往往带有批评意味，暗示说话者不信任或反对医学证据与治疗。"]}
{"word":"antimedication","summary":{"en":"Antimedication (more commonly anti-medication) means being against using medicines or having a stance opposed to medication.","zh":"antimedication（更常见写作 anti-medication）指“反对用药/反对服用药物”，也可指这种立场或观念。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to using medicines or medical drugs, especially as a general belief or attitude (often written with a hyphen: anti-medication).","zh":"反对用药的；反对服用药物的（常写作 anti-medication）。"},"examples":[{"en":"My aunt is very anti-medication and prefers home remedies.","zh":"我阿姨非常反对用药，更喜欢偏方/家庭疗法。"},{"en":"The article criticized an anti-medication attitude that discourages people from getting treatment.","zh":"这篇文章批评了那种反对用药、让人不去接受治疗的态度。"}]},{"partOfSpeech":"n.","definition":{"en":"the belief, movement, or stance of being against medication use (less common).","zh":"反对用药的观念/立场/倾向（较少见）。"},"examples":[{"en":"Anti-medication can be harmful when it leads people to refuse necessary treatment.","zh":"当“反对用药”导致人们拒绝必要治疗时，可能会有害。"}]}],"synonyms":["anti-medication","medication-averse","against medication","reluctant to take medication"],"phonetic":"/ˌæn.tiˌmɛd.əˈkeɪ.ʃən/","extraExplanation":["“antimedication” 作为一个连写的词不太常见；更自然、也更容易被读者理解的写法是带连字符的 “anti-medication”。","在正式写作中，如果你想表达“对药物治疗持怀疑/谨慎态度”，有时用 “medication-skeptical” 或 “reluctant to take medication” 会比 “anti-medication” 更中性。","注意区分：反对“滥用药物/过度处方”可以说 “against overmedication / opposed to overprescribing”，不等同于反对所有药物治疗。"]}
{"word":"antimedicative","summary":{"en":"“Antimedicative” is a rare adjective meaning opposed to medicine/medication, or (rarely) counteracting a medicine’s effects.","zh":"“Antimedicative”是个罕见形容词，意为反对医学/用药的；或（较罕见）抵消药物作用的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to medical treatment or the use of medicines; not medicinal.","zh":"反对医疗治疗或用药的；非药用的。"},"examples":[{"en":"Some people have an antimedicative attitude and prefer home care over prescription drugs.","zh":"有些人对用药持反感态度，更偏向居家照护而不是处方药。"},{"en":"The article criticizes an antimedicative mindset that rejects all modern medicine.","zh":"这篇文章批评一种一概排斥现代医学的反用药心态。"}]},{"partOfSpeech":"adj.","definition":{"en":"counteracting, reducing, or preventing the effects of a medicine (rare).","zh":"（罕见）抵消、减弱或阻止药物作用的。"},"examples":[{"en":"The doctor warned that mixing these supplements could have an antimedicative effect.","zh":"医生警告说，把这些补充剂混用可能会产生抵消药效的作用。"}]}],"synonyms":["anti-medication","anti-medicine","non-medicinal","counteracting","medication-resistant"],"phonetic":"/ˌæn.taɪˈmɛd.ɪ.kə.tɪv/","extraExplanation":["“antimedicative”在现代英语中非常少见，更多时候人们会用更自然的表达，例如：anti-medication（反用药的）、anti-medicine（反医学的）、non-medicinal（非药用的）、counteract the medication（抵消药效）。","前缀anti-通常表示“反对/抵抗”，medicative与medicate同源，和“治疗、药物”相关。因此这个词大致可理解为“反治疗/反药物的”或“抵消药效的”，但在正式写作中建议改用更常见的词组以避免读者不熟悉。"]}
{"word":"antimedicine","summary":{"en":"“Antimedicine” describes opposition to modern medical treatment or the beliefs that reject medical science.","zh":"“antimedicine”指反对现代医疗/医疗治疗，或否定医学科学的一套观念与言论。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to modern medicine or medical treatment; showing distrust of doctors, drugs, vaccines, or hospitals.","zh":"反对现代医学或医疗治疗的；对医生、药物、疫苗或医院不信任的。"},"examples":[{"en":"Some online communities spread antimedicine ideas and discourage people from seeing a doctor.","zh":"一些网络社群传播反医学的观念，劝人不要去看医生。"},{"en":"Her antimedicine attitude changed after she received proper treatment.","zh":"在接受合适的治疗后，她反医学的态度改变了。"}]},{"partOfSpeech":"n.","definition":{"en":"Belief, messaging, or activism that rejects or attacks modern medicine and medical science.","zh":"否定或攻击现代医学与医学科学的观念、言论或行动。"},"examples":[{"en":"The article warned about antimedicine misinformation during the outbreak.","zh":"这篇文章警告在疫情期间出现的反医学错误信息。"},{"en":"Teachers discussed how to respond to antimedicine claims with evidence and empathy.","zh":"老师们讨论如何用证据与同理心回应反医学的说法。"}]}],"synonyms":["anti-medical","anti-science","medical skepticism","anti-vaccine (specific)"],"phonetic":"/ˌæntiˈmɛdɪsən/","extraExplanation":["“antimedicine”不是特别常见的标准词，更常见的说法有“anti-medical”“anti-science”“anti-vaccine”“medical skepticism”等。具体语境不同，语气也不同：有时指对医疗体系的不信任（可能源于负面经历），有时指传播未经证实、反科学的观点。写作时可根据立场选择更中性的表达，如“medical skepticism（对医疗持怀疑态度）”。"]}
{"word":"antimedieval","summary":{"en":"Antimedieval means against or critical of medieval ideas, culture, or styles.","zh":"antimedieval 指“反中世纪的”，即反对或批评中世纪观念、文化或风格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to, rejecting, or criticizing medieval culture, values, art, or institutions; not in favor of “medieval” ideas or styles.","zh":"反中世纪的；反对、否定或批评中世纪文化、价值观、艺术或制度的；不赞同“中世纪式”观念或风格的。"},"examples":[{"en":"Some writers are antimedieval because they see the Middle Ages as a symbol of superstition and oppression.","zh":"一些作家带有反中世纪立场，因为他们把中世纪视为迷信与压迫的象征。"},{"en":"The film’s antimedieval tone focuses on how ordinary people suffered under strict systems.","zh":"这部电影带有反中世纪的基调，强调普通人在严苛制度下的苦难。"}]}],"synonyms":["anti-medieval","non-medieval (different meaning: not medieval)","anti-feudal (partly related)","anti-traditional (broader)"],"phonetic":"/ˌæn.ti.məˈdiː.vəl/","extraExplanation":["“anti-”表示“反对/抵制”，如 antiwar（反战）、antivirus（杀毒/抗病毒）。“medieval”指“中世纪的”。合起来 antimedieval 多用于学术写作、评论或观点表述，日常口语中较少见。","它通常不是说“发生在中世纪之前/之后”，而是表达态度：对“中世纪风格或价值”的反感或批判。若要表达“非中世纪时期的”，更常用 non-medieval。"]}
{"word":"antimedievalism","summary":{"en":"Antimedievalism is an attitude or critical stance that opposes, dislikes, or is biased against the Middle Ages, and it can also mean pushing back against romanticized images of the medieval past.","zh":"antimedievalism 指对中世纪（及其相关文化、观念）的反感/反对或偏见，也可指对“把中世纪浪漫化”的叙事进行批判与反驳。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to, dislike of, or bias against the Middle Ages (the medieval period) or things associated with it (ideas, culture, institutions, art, etc.).","zh":"反中世纪主义；对“中世纪/中世纪风格与观念”的反感、反对或带有偏见的态度。"},"examples":[{"en":"The article argues that some textbooks show antimedievalism by describing the Middle Ages as only a “dark age.”","zh":"这篇文章认为，一些教材把中世纪只写成“黑暗时代”，体现了反中世纪主义的偏见。"},{"en":"Her antimedievalism made her dismiss Gothic architecture as crude and irrational.","zh":"她的反中世纪主义让她把哥特式建筑一概视为粗糙而不理性。"}]},{"partOfSpeech":"n.","definition":{"en":"A critical stance that challenges idealized or romanticized views of the Middle Ages (opposing “medievalism,” the later re-imagining of the medieval past).","zh":"一种批判立场：反对把中世纪浪漫化、理想化的叙述（与“中世纪主义/中古风想象”相对）。"},"examples":[{"en":"In cultural studies, antimedievalism can be used to question why modern movies keep portraying knights as pure heroes.","zh":"在文化研究中，反中世纪主义可用来追问：为何现代电影总把骑士塑造成纯粹英雄。"},{"en":"The museum talk balanced medievalism and antimedievalism by showing both beauty and brutality in the period.","zh":"这场博物馆讲座在“中世纪浪漫化”和“反中世纪浪漫化”之间取得平衡，既呈现美，也呈现残酷。"}]}],"synonyms":["anti-medievalism","bias against the Middle Ages","anti-medieval bias","anti-medieval sentiment","critique of medievalism"],"phonetic":"/ˌænti məˈdiːviəˌlɪzəm/","extraExplanation":["这个词多见于学术写作（历史学、文学研究、文化研究）。它常用来批评一种“把中世纪当作落后、迷信、黑暗的刻板印象”（例如把所有问题都归结为宗教或无知），也可指对当代“中古风/中世纪幻想”的反驳。","与之相关的常见对立概念是 medievalism（后世对中世纪的想象与再创造，如新哥特风格、奇幻作品中的“骑士时代”形象）。在写作中要注意：批判浪漫化并不等于否认中世纪的成就（如大学制度、建筑、哲学与法律传统等）。"]}
{"word":"antimedievalist","summary":{"en":"“Antimedievalist” refers to someone (or a viewpoint) that opposes or criticizes the idealization or revival of the Middle Ages.","zh":"“Antimedievalist”指反对或批评对中世纪的浪漫化、美化或复兴的人（或观点）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is opposed to the Middle Ages being idealized or imitated (medievalism), or who strongly criticizes medieval culture, institutions, or values.","zh":"反中世纪主义者；反对把中世纪浪漫化/模仿（中世纪主义）的人，或强烈批评中世纪文化、制度或价值观的人。"},"examples":[{"en":"Some antimedievalists argue that romantic images of knights hide the violence of the period.","zh":"一些反中世纪主义者认为，对骑士的浪漫想象掩盖了那个时期的暴力。"},{"en":"In the debate, she spoke as an antimedievalist, warning against nostalgia for feudal society.","zh":"在辩论中，她以反中世纪主义者的立场发言，警惕对封建社会的怀旧。"}]},{"partOfSpeech":"adj.","definition":{"en":"opposed to medievalism or to the positive revival/celebration of medieval styles, ideas, or history.","zh":"反中世纪主义的；反对复兴/赞美中世纪风格、观念或历史的。"},"examples":[{"en":"The essay takes an antimedievalist position toward “back-to-the-castle” nostalgia.","zh":"这篇文章对“回到城堡时代”的怀旧采取反中世纪主义立场。"},{"en":"His antimedievalist critique focuses on how the era is marketed in pop culture.","zh":"他的反中世纪主义批评聚焦于流行文化如何包装那个时代。"}]}],"synonyms":["anti-medieval","critic of medievalism","anti-romantic medieval revival"],"phonetic":"/ˌæntaɪˌmɛdiˈivəlɪst/","extraExplanation":["这个词比较少见，多见于学术讨论或文化评论里，常用于批评把“中世纪”当作理想化黄金时代的叙事（比如把骑士精神、城堡生活过度浪漫化）。","构词上是 anti-（反对）+ medieval（中世纪的）+ -ist（…主义者/…派人士），也可写作 anti-medievalist。"]}
{"word":"antimedievally","summary":{"en":"“Antimedievally” means “in an anti-medieval way”—opposing or criticizing medieval ideas or styles.","zh":"“antimedievally”意为“以反中世纪的方式”，指反对或批评中世纪的观念或风格。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is opposed to, critical of, or rejecting medieval (Middle Ages) ideas, styles, or values.","zh":"以反中世纪的方式；以反对、批评或拒绝中世纪（中世纪时期）观念、风格或价值的方式。"},"examples":[{"en":"The essay reads the novel antimedievally, focusing on how it challenges chivalric ideals.","zh":"这篇文章以反中世纪的角度解读这部小说，重点讨论它如何挑战骑士精神的理想。"},{"en":"Some modern designers interpret castles antimedievally, turning dark fortresses into bright, open spaces.","zh":"一些现代设计师以反中世纪的方式诠释城堡，把阴暗的堡垒改造成明亮、开放的空间。"}]}],"synonyms":["anti-medievally","in an anti-medieval way","from an anti-medieval perspective"],"phonetic":"/ˌæntiˈmɛdiˌivəli/","extraExplanation":["“antimedievally”很少在日常英语中使用，多见于学术写作（文学研究、艺术史、建筑史）中，用来描述一种“反中世纪/去中世纪化”的解读或风格选择。","构词：anti-（反对）+ medieval（中世纪的）+ -ly（副词后缀）。有时也会看到更常用的表达，如 “in an anti-medieval way” 或 “from an anti-medieval perspective”。"]}
{"word":"antimelancholic","summary":{"en":"Antimelancholic means “counteracting or easing melancholy; mood-lifting.”","zh":"antimelancholic 指“对抗或缓解忧郁/悲伤情绪的；提振心情的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"preventing or relieving melancholy (deep sadness); mood-lifting.","zh":"抗忧郁的；减轻（深度）悲伤情绪的；使心情振作的。"},"examples":[{"en":"Some people find that daily sunlight and exercise have an antimelancholic effect.","zh":"有些人发现每天晒太阳和运动有抗忧郁的效果。"},{"en":"The doctor described the tonic as antimelancholic, meant to lift the patient’s spirits.","zh":"医生把这种补剂描述为抗忧郁的，旨在振奋病人的精神。"},{"en":"She chose music with an antimelancholic tone to get through the long winter evenings.","zh":"她选了带有抗忧郁氛围的音乐来度过漫长的冬夜。"}]}],"synonyms":["antidepressant","mood-lifting","cheering","uplifting"],"phonetic":"/ˌæn.tiˌmɛl.ənˈkɑː.lɪk/","extraExplanation":["这个词比较少见，常见于较老的医学/文学语境；现代更常用的表达是 “antidepressant（抗抑郁的/抗抑郁药）” 或 “mood‑boosting（提振情绪的）”。","构词上由 anti-（反、对抗）+ melancholic（忧郁的）组成；melancholy 源自古希腊医学“四体液”理论中的“黑胆汁（black bile）”，曾被认为与忧郁气质有关。"]}
{"word":"antimellin","summary":{"en":"“Antimellin” is not a recognized common English word; it likely needs context or is a misspelling/proper name.","zh":"“antimellin”不是常见标准英语词；很可能需要上下文确认，或是拼写错误/专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is likely a misspelling, a specialized scientific/medical term, or a brand/proper name. Please provide the sentence or context where you saw it.","zh":"这不是常见词典里的标准英语单词；更可能是拼写错误、某个专业术语（科学/医学等），或品牌/专有名词。建议提供你看到它的句子或上下文以便确认。"},"examples":[{"en":"I can’t find “antimellin” in major dictionaries—could you share the context?","zh":"我在主流词典里查不到“antimellin”——你能提供一下上下文吗？"},{"en":"If you meant “anti-melanin,” it could refer to something that reduces or blocks melanin (skin pigment).","zh":"如果你想写的是“anti-melanin”，它可能指“减少或阻断黑色素（皮肤色素）的东西”。"}]}],"phonetic":"/ˌæntiˈmɛlɪn/","extraExplanation":["“antimellin”看起来像由 anti-（反/抗）+ 某个词根组成，但 Mellin 本身也可能是人名/品牌名（如某些产品、论文作者）。如果你能告诉我它出现的领域（药品？化妆品？生物化学？游戏/小说？）以及原句，我可以帮你判断它到底指什么、是否应改成其他拼写（例如 anti-melanin / antimelanogenic 等）。"]}
{"word":"antimeningococcal","summary":{"en":"Antimeningococcal means ‘against meningococci,’ especially in vaccines, antibiotics, or immunity.","zh":"antimeningococcal 意为“抗脑膜炎球菌的”，常用于疫苗、抗生素或免疫相关语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the prevention or treatment of disease caused by meningococci (the bacteria that can cause meningitis and blood infections).","zh":"与预防或治疗由脑膜炎奈瑟菌（可引起脑膜炎和败血症等）导致的疾病有关的。"},"examples":[{"en":"The clinic offers antimeningococcal vaccination for students living in dormitories.","zh":"诊所为住校学生提供抗脑膜炎球菌疫苗接种。"},{"en":"During the outbreak, doctors recommended antimeningococcal antibiotics for close contacts.","zh":"在暴发期间，医生建议密切接触者使用抗脑膜炎球菌的抗生素。"}]}],"synonyms":["anti-meningococcal","meningococcal (in context of prevention/treatment)"],"phonetic":"/ˌæn.ti.məˌnɪn.dʒəˈkɑː.kəl/","extraExplanation":["词形拆解：anti-（“抗、对抗”）+ meningococcal（“脑膜炎球菌的”）。常见搭配有 antimeningococcal vaccine（抗脑膜炎球菌疫苗）、antimeningococcal antibodies（抗脑膜炎球菌抗体）。","该词多见于医学与公共卫生语境，日常英语里更常说 “meningococcal vaccine/shot（脑膜炎球菌疫苗/疫苗针）” 或直接说明 “to prevent meningococcal disease（预防脑膜炎球菌病）”。"]}
{"word":"antimeningococcic","summary":{"en":"An adjective meaning “against meningococcus,” especially in medical contexts (vaccines or treatments).","zh":"形容词，意为“抗脑膜炎球菌的”，多用于医学语境（疫苗或治疗）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to preventing or treating infection caused by meningococcus (the bacterium that can cause meningitis and blood infection).","zh":"与预防或治疗由脑膜炎奈瑟菌（可导致脑膜炎和败血症）引起的感染有关的；抗脑膜炎球菌的。"},"examples":[{"en":"The clinic offered an antimeningococcic vaccine to travelers.","zh":"诊所为旅行者提供了抗脑膜炎球菌疫苗。"},{"en":"Doctors started antimeningococcic treatment while waiting for lab results.","zh":"医生在等待化验结果时就开始了抗脑膜炎球菌治疗。"}]}],"synonyms":["antimeningococcal","meningococcal (more common, context-dependent)"],"phonetic":"/ˌæn.ti.məˌnɪn.dʒəˈkɑk.ɪk/","extraExplanation":["这个词主要出现在医学语境中，属于较正式、较少见的用法。日常英语里更常见的说法是 meningococcal（“脑膜炎球菌的”），如 meningococcal vaccine（脑膜炎球菌疫苗）。","“anti-”表示“反对/抗……”，“meningococcic”指“脑膜炎球菌的”。因此 antimeningococcic 字面意思就是“抗脑膜炎球菌的”。"]}
{"word":"antimenorrheic","summary":{"en":"A medical adjective meaning “reducing or preventing heavy menstrual bleeding,” and less commonly “suppressing menstruation.”","zh":"医学形容词，指“减轻或预防月经过多（经期异常大量出血）”；较少见时也可指“抑制月经”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medical) Used to prevent or reduce menorrhea (abnormally heavy menstrual bleeding).","zh":"（医学）用于预防或减轻月经过多（异常大量的经期出血）的。"},"examples":[{"en":"The doctor prescribed an antimenorrheic medicine to help control her heavy bleeding.","zh":"医生开了抗月经过多的药物来帮助控制她大量出血。"},{"en":"Some hormonal therapies can have antimenorrheic effects.","zh":"一些激素疗法可能具有抗月经过多的作用。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common, medical) Used to suppress or delay menstruation.","zh":"（较少见，医学）用于抑制或推迟月经来潮的。"},"examples":[{"en":"In rare cases, a treatment may be described as antimenorrheic if it suppresses menstruation.","zh":"在少数情况下，如果一种治疗能抑制月经来潮，也可能被描述为“抗经”的。"}]}],"synonyms":["anti-menorrhagic","menorrhea-reducing","hemostatic (context-dependent)"],"phonetic":"/ˌæn.tiˌmɛn.əˈriː.ɪk/","extraExplanation":["这是一个相当少见的医学用词，常见于药理或妇科相关文献中；日常英语更常说“to reduce heavy periods / to treat heavy menstrual bleeding（治疗月经过多）”。","词源结构：anti-（反/抗）+ menorrhea（月经过多）+ -ic（形容词后缀）。","交流中建议使用更温和、清晰的表达（如 heavy bleeding / heavy periods），并尊重对方对经期话题的舒适度与隐私。"]}
{"word":"antimensia","summary":{"en":"Antimensia are bishop-signed altar cloths with relics used in Eastern Christian liturgy.","zh":"Antimensia 指东仪基督宗教礼仪中由主教签署、内置圣髑、用于祭台的圣台布（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Eastern Orthodox and some Eastern Catholic churches, an altar cloth (plural) containing relics and signed by a bishop, placed on the altar and required for celebrating the Divine Liturgy.","zh":"（东正教及部分东仪天主教中）“圣台布/圣桌布”（复数）：内置圣髑并由主教签署的祭台布，铺在祭台上，举行圣礼仪时通常必需。"},"examples":[{"en":"The priest unfolded the antimensia on the altar before the Divine Liturgy began.","zh":"神父在圣礼仪开始前把圣台布（antimensia）展开铺在祭台上。"},{"en":"Without the antimensia, the community could not celebrate the service in that temporary chapel.","zh":"没有圣台布（antimensia），会众就无法在那间临时小堂举行礼仪。"}]}],"synonyms":["antimensions","antimension cloths","altar cloths (Eastern Christian context)"],"phonetic":"/ˌæntiˈmɛnsiə/","extraExplanation":["“Antimensia”常被视为“antimension”的复数形式，源自希腊语，意为“代替祭台的（东西）”。它象征主教对该礼仪的授权，因此在没有固定祝圣祭台、或在旅行/临时地点举行礼仪时尤其重要。","在英语宗教语境中也会见到拼写“antimension / antimension cloth”；不同译法可能写作“圣台布、圣桌布、反祭台布”等，具体取决于译者与教派传统。"]}
{"word":"antimension","summary":{"en":"A rare, nonstandard term used (especially in sci‑fi) for an opposite or mirror dimension.","zh":"一个罕见、非标准术语（多见于科幻），指“相反/镜像的维度”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, nonstandard) A hypothetical “opposite” or “anti-” dimension; sometimes used in science fiction to mean a mirror/negative version of a dimension or an alternate realm.","zh":"（罕见、非标准用法）一种假想的“相反/反向维度”；在科幻语境中有时指某个维度的镜像/负像版本或另一种异界。"},"examples":[{"en":"In the novel, the spaceship slips into an antimension where time runs backward.","zh":"在小说里，宇宙飞船滑入一个“反维度”，在那里时间倒流。"},{"en":"The writer uses “antimension” to describe a mirror world parallel to ours.","zh":"作者用“antimension”来描述一个与我们平行的镜像世界。"}]}],"synonyms":["mirror dimension","alternate dimension","parallel dimension","opposite dimension"],"phonetic":"/ˌænti dəˈmɛnʃən/","extraExplanation":["“antimension”不是英语里常见的标准词，更多见于自创术语或科幻设定。理解时可拆分为前缀 anti-（反、对立）+ dimension（维度）。在不同作品中含义可能不一致，阅读时最好结合上下文判断。"]}
{"word":"antimensions","summary":{"en":"“Antimensions” is not a standard everyday English word; it’s usually a sci‑fi-style term meaning an opposite or mirror dimension, or it may be a misspelling (often of “dimensions”).","zh":"“antimensions”不是常用标准英语词，多见于科幻语境，指“反/镜像维度”；也可能只是拼写错误（常见为“dimensions/维度”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare; mostly science fiction) An “opposite” or mirror dimension—an imagined realm or space that contrasts with ordinary dimensions.","zh":"（罕见；多见于科幻）“反维度/反次元”——一种想象中的与普通维度相对或镜像的空间/领域。"},"examples":[{"en":"In the novel, the ship slips into an antimensions where time runs backward.","zh":"在小说里，飞船滑入一个反维度，时间在那里倒流。"},{"en":"The game’s story mentions antimensions as parallel worlds with different physical laws.","zh":"游戏剧情把反维度描述为物理规律不同的平行世界。"}]},{"partOfSpeech":"other","definition":{"en":"Likely a misspelling of a more common word (often “dimensions”).","zh":"很可能是更常见单词的拼写错误（常见为“dimensions / 维度”）。"},"examples":[{"en":"Did you mean “dimensions” (the length, width, and height of something)?","zh":"你是不是想写“dimensions”（物体的长、宽、高等维度）？"}]}],"synonyms":["mirror dimension","counter-dimension","parallel dimension (context-dependent)"],"phonetic":"/ˌæntiˈmɛnʃənz/","extraExplanation":["“antimensions”不是标准英语里的常用词，词典中通常找不到。它更像是由前缀 anti-（反、对立）+ dimensions（维度）创造出来的“科幻/同人设定词”。","如果你是在作业或正式写作中看到/想用，建议先确认原文拼写；最常见的目标词是 dimensions。"]}
{"word":"antimensium","summary":{"en":"An antimensium is a consecrated altar cloth used in Eastern Christian liturgy, often containing relics and allowing services to be celebrated without a permanent consecrated altar.","zh":"antimensium 指东正教／东方礼传统中的祝圣祭台布，常含圣髑，用于在没有固定祝圣祭台时也能举行礼仪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Eastern Orthodox / Eastern Catholic) A consecrated altar cloth, usually with an image of Christ’s burial and relics sewn or placed inside, used on the altar so the Divine Liturgy can be celebrated (even where there is no permanent consecrated altar).","zh":"（东正教／东方礼天主教）一种祝圣过的祭台布，通常印有基督安葬（下葬）的圣像，并缝入或放入圣髑（遗物）；用于祭台上，使圣礼（如神圣礼仪）在没有固定、已祝圣祭台的地方也可举行。"},"examples":[{"en":"The priest unfolded the antimensium before beginning the Divine Liturgy.","zh":"司祭在开始神圣礼仪前展开了 antimensium（祝圣祭台布）。"},{"en":"Without an antimensium, the parish could not celebrate the Liturgy in that temporary chapel.","zh":"没有 antimensium，这个堂区就无法在那座临时小堂举行礼仪。"}]}],"synonyms":["antimension","altar cloth (context-dependent)"],"phonetic":"/ˌæntiˈmɛnziəm/","extraExplanation":["“antimensium”常被视为拉丁化形式；英语里更常见的拼写是 **antimension**。在东正教传统中，它通常由主教祝圣并签署，象征主教授权该处举行圣体礼仪；也反映早期教会在迫害或旅途中需要“可携带祭台”的历史背景。"]}
{"word":"antimephitic","summary":{"en":"“Antimephitic” means counteracting foul or poisonous air; it’s rare and mostly historical.","zh":"“antimephitic”指“防止或抵消恶臭/有毒空气的”，非常少见，偏历史用法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Preventing or counteracting foul, poisonous, or unhealthy air (especially from decay, sewers, or stagnant places).","zh":"用于防止或抵消恶臭、有毒或不健康的空气（尤指腐败物、下水道或污浊环境产生的气体）。"},"examples":[{"en":"The old building was treated with an antimephitic wash to reduce the stench from the basement.","zh":"这栋老楼用了一种防臭防毒的涂剂处理，以减轻地下室的臭味。"},{"en":"In early public-health writing, antimephitic methods included ventilation and the use of chemicals to purify air.","zh":"在早期公共卫生著作中，防臭防毒的方法包括通风以及用化学物质净化空气。"}]}],"synonyms":["antiseptic","deodorizing","air-purifying","ventilating"],"phonetic":"/ˌæn.tiˈmɛf.ɪ.tɪk/","extraExplanation":["这是一个非常少见、带有历史感的词，多见于18—19世纪关于“瘴气/坏空气”（miasma）与公共卫生的讨论。现代英语里更常用的表达是 antiseptic（消毒的）、deodorizing（除臭的）、air‑purifying（净化空气的）或 ventilation（通风）。","词形来源可拆为 anti-（反、对抗）+ mephitic（恶臭的、有毒的；指令人窒息的气体）。mephitic 源自拉丁语 mephitis（恶臭气）。"]}
{"word":"antimere","summary":{"en":"An antimere is one of two matching body parts on opposite sides of the body.","zh":"antimere 指身体左右两侧相互对应的一对结构中的任一侧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology/Anatomy) One of a pair of corresponding body parts located on opposite sides of the body (left vs. right).","zh":"（生物/解剖）位于身体左右两侧、彼此对应的一对结构中的任一侧（如左眼与右眼中的一个）。"},"examples":[{"en":"The left arm and the right arm are antimeres in a bilaterally symmetrical animal.","zh":"在两侧对称的动物中，左臂和右臂互为对称对应结构（antimeres）。"},{"en":"Damage to one antimere may be compared with the other to assess symmetry.","zh":"可以将一侧的损伤与另一侧对应部位比较，以评估对称性。"}]}],"synonyms":["contralateral counterpart","paired structure"],"phonetic":"/ˈæntɪmɪr/","extraExplanation":["这个词很少在日常英语中出现，多见于解剖学、动物学或形态学的学术语境，常与“bilateral symmetry（两侧对称）”一起出现。","词源上可理解为 anti-（相对/对向）+ -mere（部分），强调“在对侧与之对应的那一部分”。"]}
{"word":"antimeres","summary":{"en":"Antimeres are paired, corresponding body parts on the left and right sides of a bilaterally symmetrical organism.","zh":"Antimeres 指两侧对称生物体左右两边相互对应的一对身体部分（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy/Zoology) One of a pair of corresponding body parts on opposite sides of a bilaterally symmetrical organism (e.g., the left arm and the right arm are antimeres).","zh":"（解剖/动物学）两侧对称生物体中位于左右两侧、彼此对应的一对身体部分之一（如左臂与右臂互为对侧对应部分）。"},"examples":[{"en":"In humans, the left and right kidneys are antimeres.","zh":"在人类中，左肾和右肾是对侧对应部分（antimeres）。"},{"en":"The study compared injuries in both antimeres to check for symmetry.","zh":"这项研究比较了左右两侧对应部分的损伤情况，以检验对称性。"}]}],"synonyms":["bilateral counterparts","paired structures","left-right counterparts"],"phonetic":"/ˈæn.tɪ.mɪr/","extraExplanation":["“antimeres”是名词复数；单数形式是“antimere”。","该词多用于描述“两侧对称”（bilateral symmetry）的结构关系，强调“左右对应”。容易与“metameres（体节/节段）”混淆：metameres指沿身体前后方向重复排列的节段，而antimeres指左右成对的对应部分。"]}
{"word":"antimerger","summary":{"en":"“Antimerger” describes a stance against a business merger, or a person/group who opposes one.","zh":"“antimerger”指反对企业并购的立场，也可指反对并购的人或团体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to a merger (especially a business or corporate merger).","zh":"反对并购（尤指公司合并/企业并购）的。"},"examples":[{"en":"The senator took an antimerger position and urged regulators to block the deal.","zh":"这位参议员持反对并购的立场，并敦促监管机构阻止这笔交易。"},{"en":"Antimerger activists argued the merger would reduce competition and raise prices.","zh":"反并购的行动者认为这次合并会减少竞争并抬高价格。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or group that opposes a merger.","zh":"反对并购的人；反并购团体。"},"examples":[{"en":"The antimerger claimed the companies would have too much power after combining.","zh":"反并购者称两家公司合并后将拥有过大的权力。"},{"en":"Several antimergers organized a public campaign against the acquisition.","zh":"一些反并购人士发起了反对收购的公众运动。"}]}],"synonyms":["anti-merger","opposed to the merger","anti-acquisition","against the deal"],"phonetic":"/ˌæn.tiˈmɝː.dʒɚ/","extraExplanation":["“anti-”表示“反对/对抗”，merger 指“合并、并购”。在新闻与政策语境中，antimerger 常与“反垄断（antitrust）”“竞争（competition）”“监管审批（regulatory approval）”一起出现，用来描述反对某项合并的人或立场。","这个词更常见于商业报道、法律/监管讨论或政治评论中；日常口语里通常会说 “against the merger（反对这次合并）” 或 “opposed to the merger”。"]}
{"word":"antimerging","summary":{"en":"“Antimerging” means opposing or preventing a merge, especially in business (anti-merger) or in tech settings (“do not merge”).","zh":"“antimerging”指反对或阻止“合并”，常用于商业（反并购/反合并）或技术场景（不要合并/防止合并）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposing or preventing the merging of two or more things (especially companies, organizations, groups, or departments).","zh":"反对或阻止两个或多个事物（尤指公司、组织、团体或部门）合并的；反并购的。"},"examples":[{"en":"The union took an antimerging stance because it feared layoffs after consolidation.","zh":"工会采取反合并立场，因为担心整并后会裁员。"},{"en":"Antimerging rules can limit how much market power one company can gain.","zh":"反合并规定可能限制一家公司获得过大市场力量。"}]},{"partOfSpeech":"adj.","definition":{"en":"Designed to stop separate items from being combined into one (often used in tech or workflow contexts, meaning “do not merge”).","zh":"用于阻止把不同内容合并为一体的（常见于技术或工作流程语境，意为“不要合并”）。"},"examples":[{"en":"We added an antimerging check so conflicting code changes won’t be merged automatically.","zh":"我们加入了反合并检查，这样有冲突的代码修改就不会被自动合并。"},{"en":"The editor has an antimerging setting that keeps paragraphs separate.","zh":"这个编辑器有反合并设置，可以让段落保持分开。"}]}],"synonyms":["anti-merger","anti-merging","against merging","non-merging","merge-preventing"],"phonetic":"ˌæn.tiˈmɝː.dʒɪŋ","extraExplanation":["“antimerging”更常见的写法是带连字符的“anti-merging”，尤其在正式写作中更清晰。口语或非正式文本里也可能写作一个词。","词缀“anti-”表示“反对/对抗”，所以它通常描述一种立场（反合并）或一种功能（防止合并）。在商业语境中也常用“anti-merger（反并购）”“anti-merger policy（反并购政策）”。"]}
{"word":"antimerial","summary":{"en":"Antimerial means “relating to left–right corresponding parts” in bilaterally symmetrical organisms.","zh":"Antimerial 指“与双侧对称生物中左右对应的成对部分有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology/Anatomy) Relating to the two corresponding halves or paired parts of a bilaterally symmetrical organism (antimeres), such as the left and right arms.","zh":"（生物/解剖）与两侧对称的对应两半或成对结构（对称体/对侧体，如左臂与右臂）有关的。"},"examples":[{"en":"Humans have antimerial symmetry: the left and right sides of the body correspond closely.","zh":"人类具有对侧（antimerial）对称性：身体的左侧与右侧在结构上高度对应。"},{"en":"In anatomy class, we compared antimerial structures like the two kidneys.","zh":"在解剖课上，我们比较了对侧的结构，比如左右两个肾。"}]}],"synonyms":["bilateral","paired","contralateral (context-dependent)"],"phonetic":"/ˌæntiˈmɪriəl/","extraExplanation":["“antimerial”是非常少见、偏学术的词，多见于解剖学与动物形态学写作。它来自“antimere”（对侧体/对称体），指双侧对称动物中成对出现、左右相对应的部分。日常英语里更常用的表达是“left and right counterparts（左右对应部分）”或直接说“bilateral symmetry（双侧对称）”。"]}
{"word":"antimeric","summary":{"en":"Antimeric describes a rhetorical use where a word is used as a different part of speech than usual.","zh":"Antimeric 指一种修辞/语法现象：词被当作不同于其常见词性的词来使用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rhetoric/grammar) Using a word as a different part of speech than it normally is (for example, using a noun as a verb).","zh":"（修辞/语法）把一个词当作不同于其常见词性的词来用（例如把名词当动词用）。"},"examples":[{"en":"In the sentence “Let’s Google it,” “Google” is used antimerically as a verb.","zh":"在句子“Let’s Google it（我们去谷歌一下）”中，“Google”被反常规地当作动词使用，属于 antimeric 用法。"},{"en":"Calling a request “a big ask” uses “ask” antimerically as a noun.","zh":"把一个请求称为“a big ask（一个很大的请求/要求）”是把“ask”反常规地当名词用。"},{"en":"The slogan “Don’t just book it—Uber it” is antimeric because a brand name is used as a verb.","zh":"标语“Don’t just book it—Uber it（别只预约——用优步叫车）”把品牌名当动词用，属于 antimeric。"}]}],"synonyms":["functional shift","conversion","word-class shift","antimerial"],"phonetic":"/ˌæn.təˈmɛr.ɪk/","extraExplanation":["antimeric 这个形容词来自修辞术语 antimeria（词性替换/词类转换）。在现代语言学里，也常用 functional shift 或 conversion 来描述类似现象（比如 email 从名词变成动词 “to email”。）","来源上可追溯到希腊语：anti-（“替代/相对”）+ meros（“部分”），大意是“用一个‘部分/类别’去替代另一个”。","这种用法在广告、口语和网络英语里很常见，往往显得更简洁、有力度，甚至带一点幽默感。"]}
{"word":"Antimerina","summary":{"en":"Antimerina is an uncommon proper name, usually seen as a scientific (taxonomic) name; its meaning depends on context.","zh":"Antimerina 是不常见的专名，多见于科学（分类学）命名；含义需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare proper name used mainly in scientific Latin (taxonomy) as a genus or group name; its exact meaning depends on the field and the organism being discussed.","zh":"一个较少见的专有名称，主要出现在（生物）分类学的拉丁化命名中，常作为属名或类群名；具体指什么需看学科与语境（是哪一类生物）。"},"examples":[{"en":"In the paper, Antimerina is listed as a genus name in the classification table.","zh":"在那篇论文里，Antimerina 被列为分类表中的一个属名。"},{"en":"If you search for Antimerina, include the scientific context (insects, plants, etc.) to get accurate results.","zh":"如果你要检索 Antimerina，最好加上科学语境（昆虫、植物等），结果会更准确。"}]}],"phonetic":"/ˌæntiˌmɛˈriːnə/","extraExplanation":["“Antimerina”不是常见英语词汇，更像是拉丁化的专名（例如属名）。不同数据库/学科里可能对应不同生物类群，因此最可靠的做法是提供你看到它的句子或来源（论文、图鉴、网页链接）。","很多学习者会把它和“antimeridian（对跖子午线，约为本初子午线对面的180°经线）”混淆；如果你的语境与地理/经线有关，可能想问的是 antimeridian。"]}
{"word":"antimerina","summary":{"en":"Antimerina refers to non‑Merina people, or (in some contexts) opposition to Merina influence in Madagascar.","zh":"Antimerina 指非梅里纳人，或（在某些语境中）反对梅里纳影响的立场/情绪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or group that is not Merina (not belonging to the Merina people of Madagascar), especially in discussions that contrast Merina vs. other Malagasy groups","zh":"非梅里纳人（不属于马达加斯加梅里纳族的人/群体）；常用于把“梅里纳”与其他马达加斯加族群作对比的语境"},"examples":[{"en":"Some historical accounts describe tensions between Merina rule and antimerina communities in other regions.","zh":"一些历史记载描述了梅里纳统治与其他地区非梅里纳社群之间的紧张关系。"},{"en":"The policy was criticized as favoring Merina elites over antimerina populations.","zh":"该政策被批评为偏袒梅里纳精英、忽视非梅里纳人口。"}]},{"partOfSpeech":"adj.","definition":{"en":"opposed to the Merina people or to Merina political influence (used in political or historical contexts)","zh":"反梅里纳的；反对梅里纳族群或其政治影响（多用于政治/历史语境）"},"examples":[{"en":"An antimerina movement emerged in response to central control from the highlands.","zh":"为了反对高地的中央控制，一个反梅里纳运动出现了。"},{"en":"The author notes antimerina sentiment in the coastal towns at the time.","zh":"作者提到当时沿海城镇存在反梅里纳情绪。"}]}],"synonyms":["non-Merina","anti-Merina"],"phonetic":"/ˌænti məˈriːnə/","extraExplanation":["“Antimerina”通常由前缀 anti-（反对）+ Merina（梅里纳族）构成。在马达加斯加历史与政治讨论中，梅里纳族与其高地王国/政治中心曾在一定时期具有较大影响，因此“antimerina”可能既表示“非梅里纳”，也可能带有“反梅里纳（政治立场）”的含义。具体含义要看上下文。","写作时需注意语气：用来指族群差异时尽量保持中性（如“non‑Merina”），若强调政治对立再用“anti‑Merina/antimerina”。"]}
{"word":"antimerism","summary":{"en":"Antimerism is a rhetorical/grammatical move where a word is used as a different part of speech, often turning a noun into a verb for effect.","zh":"Antimerism 指把词当作另一种词类来用的修辞/语法现象，常见为名词动词化，以增强表达效果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rhetoric/grammar) The use of one part of speech in place of another, especially using a noun or adjective as a verb.","zh":"（修辞/语法）用一种词类替代另一种词类，尤其指把名词或形容词当作动词来用。"},"examples":[{"en":"In “Let’s Google it,” “Google” is a noun used as a verb—an example of antimerism.","zh":"在“Let’s Google it（我们去谷歌一下）”中，“Google”原是名词却当作动词用，这是 antimerism（词类转换）的一例。"},{"en":"The slogan “Don’t just book it—hotel it” uses antimerism to sound catchy.","zh":"标语“Don’t just book it—hotel it（别只订房，直接‘酒店一下’）”用词类转换来增强上口感。"}]}],"synonyms":["conversion","functional shift","anthimeria"],"phonetic":"/ˌæntiˈmɛrɪzəm/","extraExplanation":["该术语常见于修辞学与文体分析，强调“刻意的词类变化”带来的表达效果（更生动、口语化、强调动作感）。英语里很常见把名词动词化（to text, to email, to Google），但并非所有动词化都一定被当作修辞手法；当说话者/作者有意为之、并产生风格效果时，更容易被称为 antimerism。","相关术语：conversion / functional shift（词类转换，语言学里更常用、更中性）；anthimeria（常见拼写变体）。"]}
{"word":"antimeristem","summary":{"en":"A non-dividing, more mature plant tissue region opposite to a meristem.","zh":"与分生组织相对的、细胞不再分裂的较成熟植物组织区域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In plant biology, a region of tissue where cells are no longer actively dividing (the opposite of meristematic tissue), often referring to the more mature zone next to or away from a meristem.","zh":"（植物学）反分生组织；指细胞不再积极分裂、较成熟的组织区域（与分生组织相对），常指位于分生组织旁边或远离分生组织的成熟带。"},"examples":[{"en":"In a growing root, cells move from the meristem into the antimeristem as they mature.","zh":"在生长中的根里，细胞会从分生组织移动到反分生组织，并逐渐成熟。"},{"en":"Researchers compared gene activity in the meristem and the antimeristem to understand how growth is controlled.","zh":"研究人员比较了分生组织与反分生组织中的基因活性，以了解生长如何被调控。"}]}],"synonyms":["non-meristematic tissue","maturation zone"],"phonetic":"/ˌæntiˈmɛrɪstɛm/","extraExplanation":["“anti-”表示“相对、反对”，而“meristem”是“分生组织”（细胞快速分裂、推动植物生长的区域）。因此 antimeristem 常用来强调：与“不断分裂的生长区”相对的“停止分裂、开始分化成熟的区域”。这个词在一般英语中很少见，主要出现在植物解剖学/发育生物学的学术语境里。"]}
{"word":"antimesia","summary":{"en":"“Antimesia” is not a widely accepted standard English word; it is often a misspelling of a more common term.","zh":"“antimesia”通常不是标准英文词，更可能是常见词的误拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or very rare form in English; it is not widely recognized as an established word in major dictionaries. In many cases, it appears to be a misspelling or mistaken form of related terms (especially in rhetoric or literary theory).","zh":"英语中不规范或极为罕见的形式；在主流词典里通常不被视为正式词条。很多情况下它更像是拼写错误或误写，常与一些相近术语（尤其是修辞学或文学理论）混淆。"},"examples":[{"en":"I tried to look up “antimesia,” but I couldn’t find a standard dictionary entry—could it be a misspelling?","zh":"我查了“antimesia”，但在标准词典里找不到条目——会不会是拼写写错了？"},{"en":"If you mean a rhetoric term, you might be thinking of “antithesis” or “antimetabole.”","zh":"如果你想找的是修辞术语，你可能想的是“antithesis（对照/对比）”或“antimetabole（回环/交错法）”。"}]}],"synonyms":["(no standard synonyms)"],"phonetic":"/ˌæn.tiˈmiː.zi.ə/","extraExplanation":["“antimesia”很可能是把某个更常见的词写错了。你可以告诉我它出现的句子或上下文（例如：文章段落、书名、截图），我就能更准确判断你要找的词。","几个最常见、也最容易被混淆的相关词：\n1) antithesis（对照/对比）：把相反或对立的概念并列来强化表达。\n2) antimetabole（回环/交错法）：用A-B / B-A的结构回环（如“Eat to live, not live to eat.”）。\n3) antimimesis / anti-mimesis（反摹仿/反再现）：文学理论里较少见的概念，字面是“反对模仿/再现”。"]}
{"word":"antimeson","summary":{"en":"An antimeson is the antiparticle of a meson in particle physics.","zh":"反介子是粒子物理中“介子”的反粒子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Physics) The antiparticle of a meson; a meson made of an antiquark and a quark, with charges and other quantum properties opposite to those of the corresponding meson.","zh":"（物理）介子的反粒子；由“反夸克 + 夸克”组成、在电荷等量子数上与对应介子相反的粒子。"},"examples":[{"en":"In particle collisions, an antimeson can be produced together with a meson as a pair.","zh":"在粒子碰撞中，反介子常与介子成对产生。"},{"en":"Researchers studied how an antimeson decays into lighter particles.","zh":"研究人员研究了反介子如何衰变成更轻的粒子。"}]}],"synonyms":["anti-meson"],"phonetic":"/ˌæn.taɪˈmiː.zɑːn/","extraExplanation":["“antimeson”多用于粒子物理语境，属于比较专业的词汇。介子（meson）是强相互作用下的一类强子，典型结构是“夸克 + 反夸克”；而反介子（antimeson）对应的是“反夸克 + 夸克”。在日常英语中很少见，更多出现在教材、论文或科普文章里。"]}
{"word":"antimetabole","summary":{"en":"Antimetabole is a rhetorical device that repeats words in reverse order for emphasis (A–B, B–A).","zh":"Antimetabole 是一种将词语倒序重复（A–B, B–A）以强调或对比的修辞手法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rhetorical device in which words or ideas are repeated in reverse order (A–B, B–A) to create emphasis, contrast, or a memorable rhythm","zh":"一种修辞手法：将前后词语或观念以“前后倒置”的方式重复（A–B, B–A），用来加强语气、形成对比或增强节奏感与记忆点"},"examples":[{"en":"“Ask not what your country can do for you—ask what you can do for your country.”","zh":"“不要问你的国家能为你做什么——要问你能为你的国家做什么。”"},{"en":"She said, “We don’t live to work; we work to live.”","zh":"她说：“我们不是为了工作而活；我们是为了活而工作。”},{"}]}],"synonyms":["chiasmus","reversal","rhetorical inversion"],"phonetic":"/ˌæn.ti.məˈtæb.ə.li/","extraExplanation":["“antimetabole”常见于演讲、广告、政治口号和文学中，因为结构对称、节奏强，很容易被记住。","它与“chiasmus（交错配列）”相近，但antimetabole通常要求关键词在后半句“原词重复并倒序”，而chiasmus更强调结构交叉，不一定原词重复。","学习时可以用公式记：A B → B A。例如：“You like it; it likes you.” 这种倒装回环会制造一种“反转”的力量。"]}
{"word":"antimetabolic","summary":{"en":"Antimetabolic describes something—especially a medicine—that interferes with normal metabolism, often to stop cell growth.","zh":"antimetabolic 指（尤指药物）干扰正常代谢过程，常用于抑制细胞生长。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a drug or substance that blocks or interferes with normal metabolism (the body’s chemical processes), often to stop the growth of cells such as cancer cells or bacteria.","zh":"（药物/物质）抗代谢的；指阻断或干扰正常代谢过程（人体的化学反应），常用于抑制癌细胞或细菌等细胞的生长。"},"examples":[{"en":"Some chemotherapy medicines are antimetabolic and prevent cancer cells from making DNA.","zh":"一些化疗药属于抗代谢药，会阻止癌细胞合成 DNA。"},{"en":"The doctor explained that the antimetabolic effect can also affect healthy fast-growing cells.","zh":"医生解释说，抗代谢作用也可能影响生长较快的健康细胞。"}]}],"synonyms":["antimetabolite","metabolism-inhibiting","metabolic inhibitor"],"phonetic":"/ˌæn.ti.mɛ.təˈbɑl.ɪk/","extraExplanation":["“antimetabolic”常见于医学与药理学语境，尤其是“antimetabolic drugs / antimetabolites（抗代谢药/抗代谢物）”。这类药物常通过“假装成”细胞需要的原料（如叶酸、嘌呤或嘧啶的类似物），从而干扰 DNA/RNA 的合成。","词形结构：anti-（反、对抗）+ metabolic（代谢的）。写作中多用于专业说明，而日常英语中较少单独使用。"]}
{"word":"antimetabolite","summary":{"en":"An antimetabolite is a medicine that blocks or imitates substances cells need to make DNA/RNA, slowing cell growth; it’s often used in chemotherapy.","zh":"抗代谢药是一类通过阻断或模拟细胞合成DNA/RNA所需物质来减缓细胞生长的药物，常用于化疗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a drug that interferes with normal cell metabolism (especially DNA/RNA building) by mimicking or blocking the use of a natural substance; used mainly in cancer treatment and sometimes for immune-related diseases.","zh":"（尤指）通过“伪装”成细胞所需的天然物质或阻断其利用，从而干扰细胞正常代谢（特别是DNA/RNA合成）的药物；主要用于癌症治疗，有时也用于免疫相关疾病。"},"examples":[{"en":"Methotrexate is an antimetabolite used in some cancers and autoimmune conditions.","zh":"甲氨蝶呤是一种抗代谢药，可用于某些癌症和自身免疫性疾病。"},{"en":"Antimetabolites can slow the growth of rapidly dividing cells, which is why they are used in chemotherapy.","zh":"抗代谢药能减缓快速分裂细胞的生长，因此常用于化疗。"},{"en":"During treatment, doctors monitor blood counts because antimetabolites may also affect healthy fast-growing cells.","zh":"治疗期间医生会监测血细胞计数，因为抗代谢药也可能影响健康的快速生长细胞。"}]}],"synonyms":["antimetabolic drug","antimetabolite agent"],"phonetic":"/ˌæn.taɪ.məˈtæb.ə.laɪt/","extraExplanation":["词形拆解：anti-（反、对抗）+ metabolite（代谢产物/代谢相关物质）。这里的“对抗”不是指提高代谢，而是指干扰细胞利用关键“原料”。","常见类别与例子：叶酸拮抗剂（如 methotrexate）、嘌呤类似物（如 6-mercaptopurine）、嘧啶类似物（如 5-fluorouracil）。它们往往通过“假原料”或“卡住关键酶”来阻止DNA/RNA复制。","学习提示：antimetabolite 常见于医学语境（肿瘤科、血液科、药理学）。一般写作/口语里不会用来形容日常事物。"]}
{"word":"antimetathesis","summary":{"en":"Antimetathesis is a rare linguistic term meaning a reversal (undoing) of metathesis—swapping sounds/letters back into the opposite order.","zh":"Antimetathesis 是一个较罕见的语言学术语，指 metathesis（换位）的反向变化：把音或字母顺序换回去。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Linguistics, rare) The reversal or undoing of a metathesis—changing a word back (or toward) an earlier form by swapping sounds/letters into the opposite order.","zh":"（语言学，较少见）metathesis（音位/字母换位）的反向变化；通过把音或字母换回相反的顺序，使词形回到（或更接近）较早的形式。"},"examples":[{"en":"Some scholars describe the later spelling as an antimetathesis that restores the older sound order.","zh":"一些学者把较晚的拼写看作一种 antimetathesis，即把较早的语音顺序“恢复”回来。"},{"en":"In the manuscript tradition, the editor argues that the scribe’s change is antimetathesis rather than a simple typo.","zh":"在手稿传统中，编辑认为抄写员的改动属于 antimetathesis，而不只是简单的笔误。"}]}],"synonyms":["reverse metathesis","reversal of metathesis","retransposition"],"phonetic":"/ˌæntaɪˌmɛtəˈθisɪs/","extraExplanation":["这个词非常罕见，在一般英语词典里可能找不到。写作或学习中更常见、更实用的相关术语是 metathesis（换位，如把 sounds/letters 交换顺序）。","注意不要和 antimetabole（修辞：词语反向重复，如“Ask not what your country can do for you…”，常与 chiasmus 相关）混淆；antimetathesis 更偏向“音/字母顺序的逆向换位（纠正/回摆）”。"]}
{"word":"antimetathetic","summary":{"en":"Antimetathetic means “opposing or undoing metathesis (sound swapping)” in linguistics.","zh":"antimetathetic 指“与反换位有关的；反对或纠正音位换位（metathesis）”的（语言学用语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Linguistics, rare) Relating to or characterized by antimetathesis—keeping sounds in their expected order (or restoring them) rather than swapping them (metathesis).","zh":"（语言学，少见）与“反换位（antimetathesis）”有关的；指音位保持（或被纠正回）原本顺序，而不是发生音位交换（metathesis，换位）。"},"examples":[{"en":"Some editors treat the spelling as an antimetathetic correction, undoing an older sound swap.","zh":"一些编辑把这种拼写视为一种反换位的修正，用来“撤销”较早的音位交换。"},{"en":"In this dialect study, antimetathetic forms are recorded alongside metathetic ones.","zh":"在这项方言研究中，研究者同时记录了反换位形式与换位形式。"}]}],"synonyms":["anti-metathetic","non-metathetic","unmetathetic"],"phonetic":"/ˌæn.tiˌmɛ.təˈθɛ.tɪk/","extraExplanation":["这个词非常少见，通常只在语言学讨论里出现。理解它的关键是先知道 metathesis（换位）：指两个音（或音位）顺序对调的现象（比如把某些音“说反了”）。antimetathetic 则指“反过来”的情况：不发生对调、或把已经对调的形式改回更常规/更符合历史来源的顺序。","由于使用频率低，你更常见到的相关词是 metathesis（换位）与 metathetic（发生换位的）。如果你是在论文或词典注释里看到 antimetathetic，通常是在说某种形式被解释为“纠正换位/避免换位”。"]}
{"word":"antimeter","summary":{"en":"Antimeter is a rare term, mainly used in poetry to mean a rhythm or stress pattern that goes against the expected meter.","zh":"Antimeter 是个少见词，主要见于诗歌格律分析，指与常规格律相反的节奏或重音模式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Prosody) A metrical element (such as a stress pattern or foot) that runs against the expected or regular meter of a poem.","zh":"（诗歌格律）与诗的常规节奏/格律相反的韵律成分（如重音模式或音步），用来形成“逆格律”的效果。"},"examples":[{"en":"The poet uses an antimeter to disrupt the smooth rhythm and create tension.","zh":"诗人用 antimeter 打破流畅的节奏，制造紧张感。"},{"en":"That sudden strong stress is almost an antimeter in an otherwise regular line.","zh":"那一下突出的重音，在一行整体很规整的诗句里几乎就是一种 antimeter。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare) Something viewed as the opposite of a “meter,” i.e., something that resists measurement or regularity.","zh":"（非常少见）被看作“meter（测量/节奏单位）”的反面之物：指抗拒被测量、难以规整化的东西（多为比喻用法）。"},"examples":[{"en":"In his essay, he calls human emotion an antimeter—impossible to measure precisely.","zh":"在文章里，他把人的情感称为 antimeter——无法被精确测量。"}]}],"synonyms":["antimetrical stress","counter-meter","metrical disruption"],"phonetic":"/ˌæn.tiˈmiː.tɚ/","extraExplanation":["“antimeter”不是常用词，现代英语里更多会用“antimetrical (stress/foot)”来表达“逆格律/反常格律”的概念。","在诗歌分析中，它通常指刻意偏离既定节拍（meter）的重音或音步安排，用来造成顿挫、强调或不稳定感。若你是在某篇特定文本里看到它，提供上下文句子会更容易确认作者具体想表达哪一层含义。"]}
{"word":"antimethod","summary":{"en":"“Antimethod” means rejecting strict, fixed methods and working in a more flexible, improvisational way.","zh":"“antimethod”指反对僵硬固定的方法，强调更灵活、即兴的做法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An approach or attitude that rejects fixed rules, techniques, or step-by-step procedures, often favoring improvisation, flexibility, or learning by doing.","zh":"一种反对固定规则、技巧或按步骤操作的方法观，常强调即兴、灵活或在实践中摸索学习。"},"examples":[{"en":"In the workshop, the teacher encouraged an antimethod: try ideas freely and adjust as you go.","zh":"在工作坊里，老师鼓励一种“反方法”：自由尝试想法，并在过程中不断调整。"},{"en":"Some artists prefer an antimethod because strict formulas can limit creativity.","zh":"有些艺术家偏好“反方法”，因为严格的套路可能限制创造力。"}]},{"partOfSpeech":"n.","definition":{"en":"A deliberate refusal to use a particular established method (in a field such as acting, design, research, or teaching).","zh":"在表演、设计、研究或教学等领域中，有意拒绝采用某种既定方法或流派的做法。"},"examples":[{"en":"He called his acting style an antimethod—more observation and less technique.","zh":"他把自己的表演风格称为“反方法”——更重观察，少谈技巧。"},{"en":"Her writing process was almost an antimethod: no outline, just drafts and revisions.","zh":"她的写作过程几乎是一种“反方法”：不列大纲，只写草稿再反复修改。"}]}],"synonyms":["anti-method","nonmethod","rule-breaking approach","improvisational approach","anti-formula"],"phonetic":"/ˌæn.tiˈmɛθ.əd/","extraExplanation":["“antimethod”通常写作 anti-method（带连字符）更常见；它不是一个固定学派，而是强调“不要被单一方法绑住”的立场。","在思想史语境里，人们有时会用它来联想到科学哲学家费耶阿本德（Paul Feyerabend）的《Against Method》（《反对方法》），讨论“方法论的多元与反教条”。"]}
{"word":"antimethodic","summary":{"en":"Antimethodic means not methodical or organized.","zh":"Antimethodic 指“不按方法、缺乏条理”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not methodical; lacking a clear, organized way of doing things.","zh":"不讲方法的；不按步骤、不系统的。"},"examples":[{"en":"His notes were antimethodic, so it was hard to study from them.","zh":"他的笔记很不系统，所以很难拿来复习。"},{"en":"The team’s antimethodic approach led to repeated mistakes.","zh":"团队不按章法的做法导致错误一再发生。"}]}],"synonyms":["unmethodical","disorganized","haphazard","random","unsystematic"],"phonetic":"/ˌæn.ti.məˈθɑː.dɪk/","extraExplanation":["“antimethodic”由前缀 anti-（反……、对立）+ methodic（有条理的）构成，意思是“反条理/不讲方法”。实际使用中它比较少见，更常用的表达是 “unmethodical” 或 “not methodical”。","methodic 与 methodical 意义很接近；methodical 更常用，强调“按步骤、有系统”。因此在写作或正式场合，通常用 unmethodical / disorganized 来更自然。"]}
{"word":"antimethodical","summary":{"en":"Antimethodical describes a disorganized, unplanned way of doing things.","zh":"Antimethodical 指做事不按计划、缺乏条理与方法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not following a careful plan or orderly method; disorganized in the way you work or do things.","zh":"不按章法的；不讲求方法和步骤的；做事缺乏条理的。"},"examples":[{"en":"His antimethodical approach to studying made it hard for him to remember what he learned.","zh":"他用一种不讲方法的方式学习，导致很难记住所学内容。"},{"en":"The notes were antimethodical—ideas were scattered across the page with no clear order.","zh":"这些笔记毫无条理——想法散落在纸上，没有清晰顺序。"},{"en":"She’s creative, but her antimethodical working style sometimes slows the team down.","zh":"她很有创意，但她不按章法的工作方式有时会拖慢团队进度。"}]}],"synonyms":["unmethodical","disorganized","haphazard","unsystematic","random"],"phonetic":"/ˌæn.ti.məˈθɑː.dɪ.kəl/","extraExplanation":["前缀 anti- 表示“反……、与……相对”，methodical 表示“有条理的、按步骤的”。antimethodical 通常用来形容做事方式“随性、杂乱、缺乏系统”，语气多为批评或担忧，但也可能带一点“自由、不受拘束”的暗示（视语境而定）。","与 unmethodical（不讲方法的）意思接近；antimethodical 更强调“与有条理的方式相对、反其道而行”。"]}
{"word":"antimethodically","summary":{"en":"“Antimethodically” means doing something in an unorganized, non-systematic way.","zh":"“antimethodically”指做事不系统、没条理、缺乏计划。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not methodical; without an organized plan or regular order.","zh":"以不按部就班的方式；缺乏条理或计划地。"},"examples":[{"en":"She searched for her keys antimethodically, opening random drawers and forgetting where she had already looked.","zh":"她找钥匙找得毫无条理，随手打开抽屉，还忘了自己已经找过哪里。"},{"en":"The report was put together antimethodically, so important details were repeated while others were missing.","zh":"这份报告整理得很不系统，所以有的关键信息被重复，有的却缺失。"}]}],"synonyms":["haphazardly","randomly","unsystematically","disorganizedly","chaotically"],"phonetic":"/ˌænti məˈθɑdɪkli/","extraExplanation":["“antimethodically”由 anti-（反、非、对立）+ methodical（有条理的）+ -ly（副词后缀）组成，字面意思就是“以反（不）条理的方式”。","它在日常口语中不算常见，更常用的替代表达有：“in a disorganized way / without a plan / haphazardly / randomly”。在写作中用它能突出“刻意不按流程”或“完全缺乏系统”。"]}
{"word":"antimethodicalness","summary":{"en":"Antimethodicalness means a lack of methodical, organized way of doing things.","zh":"antimethodicalness 指缺乏条理、缺乏系统方法的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being not methodical; a lack of orderly, systematic planning or procedure.","zh":"不讲方法的状态；缺乏有条理、系统性的计划或做事方式。"},"examples":[{"en":"His antimethodicalness made the project harder, because tasks were started without a clear order.","zh":"他做事不讲方法，让项目更难推进，因为任务在没有明确顺序的情况下就开始了。"},{"en":"The notes were full of antimethodicalness—ideas everywhere, but no structure.","zh":"这些笔记非常缺乏条理——想法到处都是，但没有结构。"}]}],"synonyms":["disorganization","lack of method","unsystematicness","disorderliness","haphazardness"],"phonetic":"/ˌæn.ti.məˈθɑː.dɪ.kəl.nəs/","extraExplanation":["这个词非常少见，多用于“临时造词”来强调某人“特别不按步骤/不系统”。更常见、自然的表达是：disorganization（混乱）、lack of method（缺乏方法）、unsystematic approach（不系统的做法）。","构词上可以拆开理解：anti-（反/不）+ methodical（有条理的）+ -ness（名词后缀，表示“……的状态/性质”）。"]}
{"word":"antimetrical","summary":{"en":"Antimetrical means “not in a regular poetic meter” or “opposed to strict meter.”","zh":"antimetrical 指“非格律的”或“反对严格格律的（诗歌写法）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not metrical; not written in a regular poetic meter (rhythmic pattern).","zh":"非格律的；不符合诗歌固定韵律（节奏格局）的。"},"examples":[{"en":"The poet mixed metrical lines with antimetrical phrases to create a broken, uneasy rhythm.","zh":"诗人把格律诗行与非格律的短语混在一起，营造出断裂而不安的节奏。"},{"en":"Some of the chanting sounded antimetrical, more like speech than song.","zh":"有些吟诵听起来不合格律，更像说话而不是歌唱。"}]},{"partOfSpeech":"adj.","definition":{"en":"Opposed to meter or to the use of strict metrical rules (especially in poetry).","zh":"反对格律（或反对严格格律规则）的（尤用于诗歌语境）。"},"examples":[{"en":"Her antimetrical approach favored natural speech patterns over strict form.","zh":"她的反格律写法更偏向自然语流，而不是严格的形式。"},{"en":"The movement was seen as antimetrical, challenging the traditions of classical verse.","zh":"这一流派被视为反格律，挑战了古典诗体的传统。"}]}],"synonyms":["unmetrical","nonmetrical","free-verse","irregular","prose-like"],"phonetic":"/ˌæn(t)iˈmɛtrɪkəl/","extraExplanation":["这个词很少见，多出现在诗歌评论或文学研究里。它由 anti-（反对、对立）+ metrical（有格律的）组成，用来描述“故意不按固定节奏写”的风格，或评价某段文字“读起来不像有规律的诗行”。","在英语诗学里，meter 指重读与非重读的规律组合（如 iambic 等）。说某段文字 antimetrical，通常是在强调它更接近日常口语的节奏，或刻意打破传统诗行的整齐感。"]}
{"word":"antimetropia","summary":{"en":"Antimetropia is when one eye is nearsighted and the other is farsighted.","zh":"Antimetropia 指一眼近视、另一眼远视的屈光状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a vision condition in which the two eyes have opposite refractive errors—typically one eye is nearsighted (myopic) and the other is farsighted (hyperopic).","zh":"一种屈光状态：两只眼的屈光度数方向相反——通常一只眼近视（myopia），另一只眼远视（hyperopia）。"},"examples":[{"en":"The optometrist diagnosed her with antimetropia: her left eye was myopic and her right eye was hyperopic.","zh":"验光师诊断她为屈光参差的一种：左眼近视，右眼远视。"},{"en":"Antimetropia can make it harder for the brain to combine images from both eyes into one clear picture.","zh":"antimetropia 可能会让大脑更难把双眼的图像融合成清晰的单一画面。"}]}],"synonyms":["anisometropia (broader term)","unequal refractive error"],"phonetic":"/ˌæntiˌmɛˈtroʊpiə/","extraExplanation":["这是一个医学/验光用语，较少出现在日常英语里。常见相关概念是：anisometropia（屈光参差，指双眼度数不一样）；antimetropia 是其中一种特殊情况，强调“两眼一近一远”。","临床上可能需要分别为两眼配镜/隐形眼镜，或在医生评估下考虑其他矫正方式；若差异较大，有时会影响双眼视功能（如立体视觉）。"]}
{"word":"antimetropia-related","summary":{"en":"“Antimetropia-related” means related to antimetropia, a condition where the two eyes have opposite refractive errors.","zh":"“Antimetropia-related”意为“与antimetropia有关的”，指两眼屈光状态相反（常见为一眼近视、另一眼远视）的相关情况。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with or describing antimetropia (a vision condition in which the two eyes have opposite focusing errors—one is more nearsighted and the other more farsighted).","zh":"与“屈光参差性正负相反”（antimetropia）有关的；用于描述两眼屈光状态相反（通常一眼更近视、另一眼更远视）的情况。"},"examples":[{"en":"The optometrist discussed antimetropia-related symptoms like eyestrain and headaches.","zh":"验光师讨论了与 antimetropia 相关的症状，例如眼疲劳和头痛。"},{"en":"Antimetropia-related anisometropia can make it hard to tolerate some glasses prescriptions.","zh":"与 antimetropia 相关的屈光参差可能会让人难以适应某些眼镜处方。"},{"en":"The study focused on antimetropia-related differences in visual acuity between the two eyes.","zh":"这项研究关注与 antimetropia 相关的两眼视力差异。"}]}],"synonyms":["associated with antimetropia","antimetropic (technical)","related to opposite refractive errors"],"phonetic":"/ˌæntaɪməˈtroʊpiə rɪˈleɪtɪd/","extraExplanation":["“antimetropia”是眼科/视光学术语；在日常英语里更常见的说法是用一句话解释：one eye is nearsighted and the other is farsighted。","写作中“X-related”表示“与X相关的”，常用于学术或医疗语境；连字符多用于放在名词前作定语（antimetropia-related symptoms）。放在名词后作表语时有时也可不加连字符（symptoms related to antimetropia）。"]}
{"word":"antimetropic","summary":{"en":"Antimetropic means having opposite refractive errors in the two eyes (one nearsighted, the other farsighted).","zh":"antimetropic 指两眼屈光相反（如一眼近视、另一眼远视）的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to antimetropia: a vision condition where the two eyes have opposite refractive errors (for example, one eye is nearsighted and the other is farsighted).","zh":"与“对向屈光参差（antimetropia）”有关的：指两只眼的屈光状态相反（例如一只眼近视、另一只眼远视）。"},"examples":[{"en":"The optometrist diagnosed an antimetropic refractive pattern: my left eye was myopic and my right eye was hyperopic.","zh":"验光师诊断我属于对向屈光参差：左眼近视，右眼远视。"},{"en":"Antimetropic patients may find it difficult to get comfortable vision with standard glasses.","zh":"对向屈光参差的患者可能会觉得用普通眼镜不容易获得舒适的视力。"}]}],"synonyms":["antimetropia-related","anisometropic (broader term)"],"phonetic":"/ˌæntiˈmɛtrɑpɪk/","extraExplanation":["这是一个很少见、偏医学（眼科/视光学）的词。更常见的名词是 **antimetropia**（对向屈光参差），属于 **anisometropia**（屈光参差：两眼度数不一样）的一种特殊类型。","“anti-”表示“相反”，“metrop-”与“测量/屈光度”有关，整体意思就是“两眼屈光相反”。","临床上常讨论它与配镜不适、双眼视功能、隐形眼镜或屈光手术选择等问题的关系。"]}
{"word":"antimiasmatic","summary":{"en":"Antimiasmatic means “against miasma,” referring to old public-health ideas about preventing disease by removing bad air; often used in historical contexts.","zh":"Antimiasmatic意为“反瘴气/反恶气的”，指旧时代通过改善空气与环境卫生来防病的观念，多用于历史语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposing or intended to prevent the harmful effects of “miasma” (bad air once believed to cause disease); by extension, antiseptic or sanitary.","zh":"反“瘴气/恶气”（过去认为会致病的“坏空气”）的；引申为防疫的、消毒的、讲卫生的。"},"examples":[{"en":"In the 1800s, some doctors recommended antimiasmatic measures like cleaning streets and improving ventilation.","zh":"在19世纪，一些医生建议采取“抗瘴气”的措施，比如清理街道、改善通风。"},{"en":"The report praised the hospital’s antimiasmatic design, with wide windows and fresh airflow.","zh":"报告称赞医院的“抗瘴气”设计：大窗户和充足的新鲜空气流通。"}]}],"synonyms":["sanitary","hygienic","antiseptic","disinfecting"],"phonetic":"/ˌæn.taɪ.maɪˈzma.tɪk/","extraExplanation":["“Antimiasmatic”来自“miasma（瘴气、恶气）”这一旧医学理论：人们曾相信霍乱、疟疾等疾病由腐烂产生的“坏空气”引起，因此强调通风、清洁、排污等来“对抗瘴气”。后来细菌学（病菌致病理论）兴起，这个词更多出现在历史、公共卫生史或医学史的语境中。","词形结构：anti-（反对）+ miasma（瘴气）+ -tic（形容词后缀）。"]}
{"word":"antimicrobial","summary":{"en":"“Antimicrobial” means something that kills or stops the growth of microorganisms; it can be an adjective or a noun.","zh":"antimicrobial 指“杀灭或抑制微生物生长的”，既可作形容词，也可作名词指抗微生物剂。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to kill microorganisms (like bacteria, some fungi, or viruses) or stop them from growing.","zh":"能杀死微生物（如细菌、部分真菌或病毒）或抑制其生长的；抗微生物的。"},"examples":[{"en":"Hospitals use antimicrobial cleaners to reduce the spread of infection.","zh":"医院使用抗微生物清洁剂来减少感染传播。"},{"en":"This soap claims to be antimicrobial, but regular handwashing is still important.","zh":"这种肥皂宣称具有抗微生物作用，但规律洗手仍然很重要。"},{"en":"Some fabrics are treated with an antimicrobial coating to control odor.","zh":"有些布料会做抗微生物涂层处理来控制异味。"}]},{"partOfSpeech":"n.","definition":{"en":"A substance (such as a drug or chemical) that kills microorganisms or prevents their growth.","zh":"抗微生物剂；能杀死微生物或抑制其生长的物质（如药物或化学品）。"},"examples":[{"en":"The doctor prescribed an antimicrobial for the infection.","zh":"医生开了抗微生物药物来治疗感染。"},{"en":"Not every illness needs an antimicrobial—many colds are caused by viruses.","zh":"并不是每种疾病都需要抗微生物药物——很多感冒是由病毒引起的。"}]}],"synonyms":["germ-killing","germicidal","antiseptic","disinfectant"],"phonetic":"/ˌæn.ti.maɪˈkroʊ.bi.əl/","extraExplanation":["“antimicrobial”由 anti-（反、抗）+ microbial（微生物的）构成，是医学与日常卫生领域常见词。","易混词：antibiotic（抗生素，主要针对细菌）；antiviral（抗病毒）；antifungal（抗真菌）。antimicrobial 是更“总括”的上位词。","使用相关产品时常会提到“抗药性/耐药性（antimicrobial resistance, AMR）”：不恰当或过度使用抗微生物药物可能导致病原体产生耐药。"]}
{"word":"antimicrobials","summary":{"en":"Antimicrobials are agents that kill microbes or stop them from growing.","zh":"Antimicrobials 指能杀灭或抑制微生物生长的药物或化学制剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Substances (such as medicines or chemicals) that kill microorganisms or stop them from growing, including bacteria, viruses, fungi, and parasites.","zh":"抗微生物剂；能杀死或抑制微生物（包括细菌、病毒、真菌、寄生虫等）生长的物质（如药物或化学品）。"},"examples":[{"en":"Doctors may prescribe antimicrobials to treat certain infections.","zh":"医生可能会开抗微生物药来治疗某些感染。"},{"en":"This cleaner contains antimicrobials that reduce the growth of bacteria on surfaces.","zh":"这种清洁剂含有抗微生物成分，可以减少表面细菌的生长。"},{"en":"Using antimicrobials when they aren’t needed can contribute to drug resistance.","zh":"在不需要时使用抗微生物药可能会导致耐药性问题。"}]}],"synonyms":["antimicrobial drugs","antibiotics (for bacteria)","antiseptics","disinfectants"],"phonetic":"/ˌæn.ti.maɪˈkroʊ.bi.əlz/","extraExplanation":["“Antimicrobials”是“antimicrobial”的复数名词用法，常见于医疗与公共卫生语境。它是一个总称，范围通常比“antibiotics（抗生素）”更大：抗生素主要针对细菌，而抗微生物剂还可能包括抗病毒药、抗真菌药、抗寄生虫药，以及用于皮肤/环境消毒的某些化学制剂（如antiseptics/ disinfectants）。","学习中常见的搭配：antimicrobial resistance（抗微生物药物耐药性，AMR）、antimicrobial therapy（抗微生物治疗）、broad-spectrum antimicrobial（广谱抗微生物药）。"]}
{"word":"antimicrobic","summary":{"en":"Antimicrobic means “against microbes”—it describes something that kills microorganisms or stops their growth, or the substance that does so.","zh":"antimicrobic 意为“抗微生物的”，指能杀灭微生物或抑制其生长的（或指这类物质）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to kill microorganisms (such as bacteria) or stop their growth.","zh":"具有抗微生物作用的；能杀死微生物（如细菌）或抑制其生长的。"},"examples":[{"en":"The doctor prescribed an antimicrobic cream for the skin infection.","zh":"医生开了抗微生物药膏来治疗皮肤感染。"},{"en":"Alcohol-based hand sanitizer has antimicrobic effects.","zh":"酒精类免洗洗手液具有抗微生物作用。"}]},{"partOfSpeech":"n.","definition":{"en":"A substance (medicine or chemical) that kills microorganisms or inhibits their growth.","zh":"抗微生物剂；能杀死微生物或抑制其生长的物质（药物或化学品）。"},"examples":[{"en":"This cleaner contains an antimicrobic that helps reduce bacteria on surfaces.","zh":"这种清洁剂含有抗微生物成分，有助于减少表面细菌。"},{"en":"Hospitals choose antimicrobics carefully to prevent resistance.","zh":"医院会谨慎选择抗微生物药物，以防产生耐药性。"}]}],"synonyms":["antimicrobial","germicidal","antiseptic (context-dependent)","disinfecting (context-dependent)"],"phonetic":"/ˌæn.ti.maɪˈkroʊ.bɪk/","extraExplanation":["“antimicrobic”和“antimicrobial”意思非常接近；日常与医学写作中“antimicrobial”更常见。“antimicrobic”有时更强调“针对微生物（microbes）本身”的作用，但多数情况下可互换。","相关词对比：antibiotic（抗生素，主要针对细菌）；antiviral（抗病毒）；antifungal（抗真菌）；antiseptic（防腐剂，多用于皮肤或伤口，偏“预防感染”）；disinfectant（消毒剂，多用于物体表面，偏“清除/杀灭”。）"]}
{"word":"antimigraine","summary":{"en":"“Antimigraine” describes something (usually a medicine) used to prevent or treat migraines; it can also mean an antimigraine drug.","zh":"“antimigraine”指用于预防或治疗偏头痛的（通常指药物）；也可作名词表示抗偏头痛药。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"used to prevent or treat migraine headaches (especially describing a drug).","zh":"用于预防或治疗偏头痛（多用于描述药物）。"},"examples":[{"en":"She was prescribed an antimigraine medication to reduce the number of attacks.","zh":"医生给她开了抗偏头痛药，以减少发作次数。"},{"en":"This antimigraine drug works best when taken at the first sign of pain.","zh":"这种抗偏头痛药在疼痛刚出现时服用效果最好。"}]},{"partOfSpeech":"n.","definition":{"en":"an antimigraine drug or treatment.","zh":"抗偏头痛药；抗偏头痛治疗。"},"examples":[{"en":"Over-the-counter painkillers didn’t help, so the doctor suggested an antimigraine.","zh":"非处方止痛药没用，所以医生建议使用抗偏头痛药。"}]}],"synonyms":["anti-migraine","migraine medication","migraine medicine"],"phonetic":"/ˌæn.tiˈmaɪ.ɡreɪn/","extraExplanation":["这是医学/药学用词，日常对话中更常说“migraine medicine”“medicine for migraines”。“antimigraine”常见于药品说明、研究论文或处方分类。","常见抗偏头痛药物类别包括 triptans（曲普坦类，用于急性发作）、CGRP 抑制剂（较新的预防/治疗方向）、以及某些用于预防的 β 受体阻滞剂或抗癫痫药等；具体选择需由医生根据个人情况决定。"]}
{"word":"antimilitarism","summary":{"en":"Antimilitarism is opposition to militarism and to the expansion of military power or values in society.","zh":"Antimilitarism 指反对军国主义以及反对军事力量与军事价值在社会中的扩张。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to militarism—the belief that a country should rely strongly on military power and values; a view that criticizes war and military expansion.","zh":"反军国主义；反对以军事力量与军事价值为国家核心的思想与政策；批评战争与军备扩张的立场。"},"examples":[{"en":"Many artists and writers expressed antimilitarism after the war.","zh":"战争之后，许多艺术家和作家表达了反军国主义立场。"},{"en":"The protest movement was rooted in antimilitarism and a desire for peace.","zh":"这场抗议运动的根源是反军国主义以及对和平的追求。"}]}],"synonyms":["antiwar","pacifism","peace movement"],"phonetic":"/ˌæn.tiˈmɪl.əˌtɛr.ɪz.əm/","extraExplanation":["“antimilitarism”由前缀 anti-（反对）+ militarism（军国主义）构成。它通常是一种政治或社会立场，常与反战运动、和平主义（pacifism）有重叠，但不完全相同：反军国主义更强调反对军队在政治、文化与经济中的过度影响，而和平主义更强调反对一切战争与暴力。","在文学与文化语境中，反军国主义常见于描写战争创伤、批判宣传或揭示军队权力结构的作品与歌曲之中。"]}
{"word":"antimilitarist","summary":{"en":"Antimilitarist (n./adj.) describes a person or idea that opposes militarism and the political or social influence of the military.","zh":"antimilitarist（名词/形容词）指反对军国主义及军队对政治或社会产生过大影响的人或观点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who opposes militarism (the belief that a country should maintain strong armed forces and be ready to use them).","zh":"反军国主义者；反对军国主义（主张国家应保持强大军队并随时诉诸武力的人）"},"examples":[{"en":"Many antimilitarists protested against the expansion of the army.","zh":"许多反军国主义者抗议扩军。"},{"en":"As an antimilitarist, she argued that diplomacy should come before force.","zh":"作为反军国主义者，她主张应先以外交手段解决问题，而不是动用武力。"}]},{"partOfSpeech":"adj.","definition":{"en":"Opposing militarism or opposing a strong military influence on politics and society.","zh":"反军国主义的；反对军队在政治与社会中拥有过大影响的"},"examples":[{"en":"He published an antimilitarist essay criticizing war propaganda.","zh":"他发表了一篇反军国主义的文章，批评战争宣传。"},{"en":"The group held an antimilitarist rally in the city center.","zh":"该团体在市中心举行了反军国主义集会。"}]}],"synonyms":["antiwar","pacifist","demilitarist"],"phonetic":"/ˌæn.tiˈmɪl.ə.tə.rɪst/","extraExplanation":["词形结构：anti- 表示“反对”，militarist 与 militarism（军国主义、尚武主义）相关，所以 antimilitarist 可作名词或形容词。","语境提示：它通常用于政治讨论、历史叙述、社会运动等较正式语境；日常口语中更常说 anti-war（反战的）或 against war（反对战争）。","相关词对比：antimilitarist（反“军国主义/军队崇拜”与军事化倾向）不一定等同于 pacifist（和平主义者，原则上反对一切战争与暴力）。"]}
{"word":"antimilitaristic","summary":{"en":"Antimilitaristic means opposed to militarism, war, or excessive military influence.","zh":"antimilitaristic 指反军国主义、反战或反对军队影响力过大的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to militarism (the belief that a country should maintain strong armed forces and be ready to use them), or opposed to war and military influence in society and politics.","zh":"反军国主义的；反对战争或反对军队在社会与政治中拥有过大影响的。"},"examples":[{"en":"Many artists in the 1960s created openly antimilitaristic songs and posters.","zh":"许多20世纪60年代的艺术家创作了公开反军国主义的歌曲和海报。"},{"en":"Her antimilitaristic views made her skeptical of increasing the defense budget.","zh":"她反军国主义的观点让她对增加国防预算持怀疑态度。"}]}],"synonyms":["antiwar","pacifist","nonmilitaristic","dovish"],"phonetic":"/ˌæn.tiˌmɪl.ə.təˈrɪs.tɪk/","extraExplanation":["构词法：anti-（反对）+ militaristic（军国主义的）。常用于描述“态度、观点、作品、运动”（如 antimilitaristic novel / protest / message）。","语义提醒：antimilitaristic 不一定等同于 pacifist（绝对和平主义）。它更常指反对“军国主义、尚武文化、军方影响力过大”，但不一定反对所有形式的自卫或军队存在。","常见搭配：antimilitaristic sentiment（反军国主义情绪）、antimilitaristic literature/art（反战/反军国主义文学或艺术）、antimilitaristic protesters（反军国主义的抗议者）。"]}
{"word":"antimilitaristically","summary":{"en":"“Antimilitaristically” means “in an anti-militaristic way,” opposing militarism.","zh":"“antimilitaristically”意为“以反军国主义/反军事至上主义的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that opposes militarism (the belief that a country should maintain a strong military and be ready to use it).","zh":"以反对军国主义／军事至上主义（主张国家应维持强大军力并准备动用武力）的方式。"},"examples":[{"en":"The group spoke antimilitaristically, urging diplomacy instead of military action.","zh":"该团体以反军国主义的立场发言，主张以外交而非军事行动解决问题。"},{"en":"Her speech was antimilitaristically framed, focusing on peace and social investment.","zh":"她的演讲以反军国主义的角度来组织，强调和平与社会投入。"}]}],"synonyms":["anti-militaristically","in an anti-militaristic way","from an anti-militarist perspective"],"phonetic":"/ˌæn.ti.mɪˌlɪ.tə.rɪˈstɪ.kli/","extraExplanation":["这个词非常少见，常被当作“超长英语单词”的例子，用来展示英语可以把多个词缀层层叠加。","构词拆解：anti-（反对） + militar（军事） + -ist（…主义者/…派） + -ic（…的） + -al（…的） + -ly（副词：以…方式）。","在真实写作中，更自然的表达通常是：in an anti-militaristic way / from an anti-militarist perspective（以反军国主义的方式/立场）。"]}
{"word":"antimilitary","summary":{"en":"Antimilitary means opposing the military or the use of military force.","zh":"antimilitary 指“反军事的”，即反对军队或军事力量的使用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to the military, military values, or the use of military force (often in politics or activism).","zh":"反军事的；反对军队、军国主义价值观或使用军事力量（常用于政治或社会运动语境）。"},"examples":[{"en":"She joined an antimilitary protest against the new weapons program.","zh":"她参加了反军事的抗议活动，反对新的武器项目。"},{"en":"The novel has an antimilitary message and questions the cost of war.","zh":"这部小说带有反军事的信息，质疑战争的代价。"}]}],"synonyms":["antiwar","pacifist","anti-militarist","anti-military"],"phonetic":"/ˌæn.tiˈmɪl.əˌtɛr.i/","extraExplanation":["“antimilitary”常写作“anti-military”（加连字符），尤其在新闻与学术写作中更常见。两者意思相同。","它不一定等于“反对士兵个人”，更多是反对军事制度、军国主义（militarism）或用武力解决问题的倾向；在不同国家与语境中可能带有明显政治立场色彩。"]}
{"word":"antiministerial","summary":{"en":"Antiministerial means opposed to the government’s ministers or a ministry, often used in parliamentary political writing.","zh":"antiministerial 指“反内阁/反政府大臣的”，常见于议会政治或较正式的政论写作中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to the government’s ministers (especially in a parliamentary system), or against a particular ministry/administration.","zh":"反对（议会制国家中）政府内阁成员的；反对某一届政府/内阁的。"},"examples":[{"en":"The newspaper took an antiministerial stance and criticized the cabinet’s new tax plan.","zh":"这家报纸采取反内阁立场，批评内阁的新税收方案。"},{"en":"Antiministerial speeches grew louder as the corruption scandal spread.","zh":"随着腐败丑闻扩散，反内阁的演讲声势更大了。"}]}],"synonyms":["anti-government","anti-administration","oppositional","anti-cabinet"],"phonetic":"/ˌæn.taɪˌmɪn.ɪˈstɪr.i.əl/","extraExplanation":["这个词多见于较正式的政治语境，尤其是英国等议会制传统中：minister 指“内阁大臣/部长”，ministerial 指“内阁的/政府的”，加上反对前缀 anti- 就是“反内阁的/反政府大臣的”。","在现代日常英语里，更常见的表达是 anti-government（反政府的）、anti-administration（反某届政府的）、anti-cabinet（反内阁的），antiministerial 带有更“历史/报刊/议会辩论”风格。"]}
{"word":"antiministerialist","summary":{"en":"Antiministerialist means opposing (or someone who opposes) a ministerialist government or pro-ministry political faction.","zh":"antiministerialist 指反对内阁派（亲内阁/当局派）政治立场的人，或指“反内阁派的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who opposes a government led by ministers (the “ministry”) or opposes “ministerialist” politics","zh":"反对由内阁大臣（政府“内阁/官署”）主导的政府或反对“支持内阁派/部长派”政治立场的人"},"examples":[{"en":"In the election, antiministerialists criticized the ministry for concentrating too much power in the cabinet.","zh":"在那次选举中，反内阁派批评内阁把权力过度集中在政府核心。"},{"en":"The newspaper described him as an antiministerialist who wanted stronger limits on ministers.","zh":"报纸称他为反内阁派，主张对大臣权力设立更强的限制。"}]},{"partOfSpeech":"adj.","definition":{"en":"opposing a ministerialist government or politics","zh":"反对内阁派政府或支持内阁派的政治立场的"},"examples":[{"en":"She wrote an antiministerialist pamphlet calling for political reform.","zh":"她写了一本反内阁派的小册子，呼吁政治改革。"},{"en":"Antiministerialist arguments often focused on accountability and checks on executive power.","zh":"反内阁派的论点常强调问责与对行政权力的制衡。"}]}],"synonyms":["anti-government","oppositionist","anti-ministry (historical)"],"phonetic":"/ˌæntaɪˌmɪnəˈstɪriəlɪst/","extraExplanation":["这个词很少见，多见于历史或政治语境（尤其是英联邦或殖民地时期的政治讨论）。“ministerialist”通常指支持“内阁/政府当局（the ministry）”的一派，因此“antiministerialist”就是反对这一派或反对由部长/内阁主导的政治路线。","构词法上是 anti-（反对）+ ministerial（内阁的/部长的）+ -ist（某派人物/主义者）。实际阅读中，如果看到它，通常可以按“反内阁派/反当局派”来理解。"]}
{"word":"antiministerially","summary":{"en":"“Antiministerially” means “in a way that opposes government ministers,” mostly in parliamentary-political writing.","zh":"“antiministerially”表示“以反对政府部长/内阁的方式”，多用于议会政治类写作。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that opposes a minister or the government’s ministers (often in parliamentary politics).","zh":"以反对（政府）部长或内阁大臣的方式；带有反内阁/反大臣立场地（多用于议会政治语境）。"},"examples":[{"en":"The newspaper wrote antiministerially, criticizing the cabinet’s new tax plan.","zh":"这家报纸以反内阁的立场撰写文章，批评内阁的新税收计划。"},{"en":"Some members voted antiministerially and rejected the minister’s proposal.","zh":"一些议员以反对部长的立场投票，否决了部长的提案。"}]}],"synonyms":["anti-governmently","oppositionally","against the minister"],"phonetic":"/ˌæntiˌmɪnəˈstɪriəli/","extraExplanation":["这个词很少见，主要出现在英式/英联邦议会政治的写作里：minister 通常指“内阁大臣/政府部长”，antiministerial 表示“反对内阁（或某位部长）的”，-ly 变成副词。","构词拆解：anti-（反对）+ ministerial（部长的/内阁的）+ -ly（……地）。在现代英语中更常用的表达是: in opposition to the government / anti-government / against the minister."]}
{"word":"antimins","summary":{"en":"Antimins is an Eastern Orthodox consecrated altar cloth used for the Divine Liturgy.","zh":"Antimins 是东正教用于举行圣体礼仪的祝圣祭台布。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Eastern Orthodox Christianity) A consecrated altar cloth—often containing relics—used on the altar (or as a portable altar) for celebrating the Divine Liturgy.","zh":"（东正教）祝圣过的祭台布（常缝入圣髑/遗骨），用于祭台上（或作为可携式祭台）举行圣体礼仪。"},"examples":[{"en":"The priest unfolded the antimins before beginning the Divine Liturgy.","zh":"司祭在开始圣体礼仪前展开了 antimins（祝圣祭台布）。"},{"en":"In a temporary chapel, the antimins allowed the service to be celebrated without a fixed altar.","zh":"在临时小堂里，antimins 使得没有固定祭台也能举行礼仪。"}]}],"synonyms":["antimension","antimens"],"phonetic":"/ˌæntiˈmɪnz/","extraExplanation":["“antimins”常见于英文对东正教礼仪用品的转写，也可见拼法 antimension / antimens。它通常由主教祝圣，并作为教会合法举行圣体礼仪的象征之一。","这个词在日常英语里非常少见，多出现在宗教、历史或艺术（圣像与礼仪器物）相关语境中。"]}
{"word":"antiminsia","summary":{"en":"Antiminsia are consecrated altar cloths used in Eastern Orthodox liturgy, usually containing relics and placed on the altar for celebrating the Divine Liturgy.","zh":"Antiminsia 指东正教礼仪中使用的祝圣祭台布，通常内含圣髑并铺在祭台上，用于举行圣体礼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Eastern Orthodox and related churches, a consecrated altar cloth (usually containing relics) that is placed on the altar and used for celebrating the Divine Liturgy; also called an antimension.","zh":"（东正教及相关教会）一种已祝圣的祭台布（通常内含圣髑/圣人遗骨等遗物），铺在祭台上，用于举行圣礼/圣体礼；亦称 antimension（安提明西翁/安提明西亚）。"},"examples":[{"en":"Before the Divine Liturgy, the priest unfolded the antiminsia on the altar.","zh":"在举行圣体礼之前，司祭在祭台上展开了 antiminsia（祝圣祭台布）。"},{"en":"The bishop’s signature on the antiminsia shows it has been officially consecrated for use.","zh":"antiminsia 上主教的签名表明它已被正式祝圣并可用于礼仪。"}]}],"synonyms":["antimension","antimins"],"phonetic":"/ˌæn.tɪˈmɪn.si.ə/","extraExplanation":["“Antiminsia”常见为复数形式；单数常写作 “antimins” 或 “antimension”。该词源自希腊语，含义大致为“代替（祭台的）桌子/台面”：在没有固定祝圣祭台的情况下，也可在合规的基础上举行礼仪。","在东正教传统中，antiminsia 往往由主教祝圣并交付给堂区使用，具有“与主教共融/授权”的象征意义；平时多被折叠收藏于祭台上，礼仪时展开。","拼写在英文资料中可能不统一：你可能也会见到 “antimension / antimens / antiminsion”等变体；检索时可用这些拼写互相交叉查找。"]}
{"word":"antiminsion","summary":{"en":"Intermission means a break or pause between parts of a show or between stages of an activity.","zh":"Intermission 指演出或活动两个部分之间的休息/暂停时间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A break or pause in an event, performance, or activity (especially in a play, concert, or movie).","zh":"（尤指戏剧、音乐会、电影等的）幕间休息；中场休息；暂停。"},"examples":[{"en":"Let’s get some water during intermission.","zh":"我们在中场休息时去喝点水吧。"},{"en":"The show has a 15-minute intermission after the first act.","zh":"演出第一幕后有15分钟的幕间休息。"}]},{"partOfSpeech":"n.","definition":{"en":"A period of time between two events or stages, when things temporarily stop or slow down.","zh":"两件事或两个阶段之间的间歇期；短暂停顿期。"},"examples":[{"en":"After a short intermission in the talks, they resumed negotiations.","zh":"会谈短暂中断后，他们继续进行谈判。"},{"en":"The rainy days gave an intermission from the heat.","zh":"连日降雨让炎热天气暂时缓和了一下。"}]}],"synonyms":["break","pause","interval","recess"],"phonetic":"/ˌɪntərˈmɪʃən/","extraExplanation":["“antiminsion”不是常见英语单词，很可能是把 **intermission**（幕间休息/中场休息）拼错了。","词源提示：inter-（在……之间）+ mission（停止/间歇的含义来自较早用法），整体表示“在两段之间的间隔”。","相关表达：**intermission** 常见于剧院与电影院；类似词有 **break**（休息）、**pause**（暂停）、**interval**（间隔/间歇，英式更常用）。"]}
{"word":"antimiscegenation","summary":{"en":"Antimiscegenation refers to laws or policies that banned interracial marriage or relationships, especially in U.S. history.","zh":"antimiscegenation 指（尤指美国历史上）禁止跨种族婚姻或关系的法律或政策。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially in U.S. history) a law or policy that forbids marriage or sexual relationships between people of different races.","zh":"（尤指美国历史）禁止不同种族之间通婚或发生性关系的法律或政策。"},"examples":[{"en":"Many U.S. states once had antimiscegenation laws that banned interracial marriage.","zh":"美国许多州曾经有反异族通婚法，禁止跨种族婚姻。"},{"en":"The court case challenged an antimiscegenation statute on constitutional grounds.","zh":"该案件从宪法层面挑战了一项反异族通婚法条款。"}]}],"synonyms":["anti-interracial marriage","racially restrictive marriage laws"],"phonetic":"/ˌæn.tiˌmɪs.ə.dʒəˈneɪ.ʃən/","extraExplanation":["“antimiscegenation”由 anti-（反对）+ miscegenation（种族混合/异族通婚）构成，常用于法律与历史语境。","美国历史上著名的相关里程碑是 1967 年美国最高法院案件 Loving v. Virginia，该案推翻了禁止跨种族婚姻的法律，使此类法律在全美失效。","这是一个带有强烈历史与社会伤害背景的词，使用时通常用于批判、研究或描述制度性种族歧视，而非中性日常用语。"]}
{"word":"antimissile","summary":{"en":"Antimissile refers to technology, weapons, or systems used to stop incoming missiles.","zh":"antimissile 指用于拦截、摧毁来袭导弹的技术、武器或系统（反导）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to detect, intercept, and destroy incoming missiles (such as ballistic missiles).","zh":"用于探测、拦截并摧毁来袭导弹（如弹道导弹）的；反导的。"},"examples":[{"en":"The country deployed an antimissile defense system to protect major cities.","zh":"该国部署了反导防御系统来保护主要城市。"},{"en":"Antimissile technology is often discussed in international security talks.","zh":"反导技术常常出现在国际安全会谈中。"}]},{"partOfSpeech":"n.","definition":{"en":"A weapon or system intended to intercept and destroy incoming missiles.","zh":"用于拦截并摧毁来袭导弹的武器或系统；反导系统。"},"examples":[{"en":"The new antimissile can target short-range ballistic missiles.","zh":"这种新型反导武器可以针对短程弹道导弹。"},{"en":"Several antimissiles were launched during the test.","zh":"测试中发射了数枚反导拦截弹。"}]}],"synonyms":["missile defense","anti-ballistic (missile)","interceptor"],"phonetic":"/ˌæn.tiˈmɪs.aɪl/","extraExplanation":["“anti-”表示“反对/用于对抗”，与“missile（导弹）”组合成复合词。“antimissile”在新闻与军事语境里常与“defense system（防御系统）”“interceptor（拦截弹）”搭配出现。","相关常见表达：antimissile defense（反导防御）、missile defense shield（导弹防御盾/体系）、intercept an incoming missile（拦截来袭导弹）。"]}
{"word":"antimission","summary":{"en":"Antimission means opposition to religious missionary work or a movement/attitude against missions.","zh":"antimission 指反对宗教传教活动，或指反传教的运动/态度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to religious missionary work (especially Christian missions) or to the activities of missionaries.","zh":"反对宗教传教工作（尤指基督教传教）或反对传教士活动的。"},"examples":[{"en":"Some local leaders took an antimission stance after conflicts with foreign missionaries.","zh":"一些地方领袖在与外国传教士发生冲突后采取了反传教立场。"},{"en":"The newspaper published antimission articles criticizing the mission schools.","zh":"这家报纸发表了反传教文章，批评传教学校。"}]},{"partOfSpeech":"n.","definition":{"en":"A movement, policy, or attitude that opposes missionary work.","zh":"反传教运动、政策或态度。"},"examples":[{"en":"The region experienced a surge of antimission in the late nineteenth century.","zh":"该地区在19世纪末出现了反传教情绪/运动的高涨。"},{"en":"Antimission grew when people believed missions were tied to foreign power.","zh":"当人们认为传教与外国势力有关联时，反传教情绪就增强了。"}]}],"synonyms":["anti-mission","anti-missionary","anti-evangelical","opposed to missions"],"phonetic":"/ˌæntiˈmɪʃən/","extraExplanation":["“antimission”通常写作带连字符的 **anti-mission**，也可见作一个词，含义相同。","在历史语境中，它常用来描述19世纪末到20世纪初一些地区（例如东亚部分地区）对基督教传教活动的抵制或反感，这种态度有时与殖民扩张、治外法权、文化冲突等议题交织在一起。"]}
{"word":"antimissionary","summary":{"en":"Antimissionary describes someone or something opposed to missionaries or missionary work.","zh":"antimissionary 指反对传教士或反对传教活动的人或立场。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to missionaries or to missionary work (especially religious efforts to convert people).","zh":"反对传教士或反对传教活动的（尤指反对宗教传教、劝人改宗的行为）。"},"examples":[{"en":"The group took an antimissionary stance and asked missionaries to leave the area.","zh":"该团体采取反传教立场，要求传教士离开该地区。"},{"en":"Some local leaders were antimissionary because they feared cultural disruption.","zh":"一些当地领袖反对传教，因为他们担心文化会被破坏。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who is opposed to missionaries or missionary work.","zh":"反对传教士或反对传教活动的人。"},"examples":[{"en":"He described himself as an antimissionary after reading about colonial-era missions.","zh":"读到殖民时期的传教历史后，他把自己形容为反传教者。"}]}],"synonyms":["anti-missionary","opposed to missionary work","anti-evangelism"],"phonetic":"/ˌæn.tiˈmɪʃ.əˌnɛr.i/","extraExplanation":["这个词由前缀 anti-（“反对”）+ missionary（“传教士/传教的”）构成，常见于历史、政治或宗教讨论，尤其涉及殖民史、文化接触与宗教传播的语境。","在写作中要注意语气：antimissionary 往往指“反对传教活动本身”，不一定等同于反宗教（anti-religion）或反基督教（anti-Christian）；具体立场通常取决于上下文。"]}
{"word":"antimissioner","summary":{"en":"Anti-missionary means opposing missionary work, or a person who opposes it.","zh":"Anti-missionary 指反对传教活动的（或反对者）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to religious (especially Christian) missionary work or to the influence of missionaries.","zh":"反对宗教（尤其是基督教）传教活动或反对传教士影响的。"},"examples":[{"en":"Some local leaders were strongly anti-missionary and resisted the building of new churches.","zh":"一些当地领袖非常反传教，抵制修建新教堂。"},{"en":"The newspaper published anti-missionary articles during the colonial period.","zh":"在殖民时期，这家报纸发表过反传教文章。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who opposes missionary activity or missionaries.","zh":"反对传教活动（或传教士）的人。"},"examples":[{"en":"He became an anti-missionary after seeing how missions changed local customs.","zh":"他看到传教活动如何改变当地习俗后，成了反传教者。"},{"en":"Debates between missionaries and anti-missionaries shaped public opinion.","zh":"传教士与反传教者之间的辩论影响了公众舆论。"}]}],"synonyms":["anti-evangelism","anti-proselytizing","opposed to missionary work"],"phonetic":"/ˌæn.taɪˈmɪʃ.əˌnɛr.i/","extraExplanation":["“antimissioner”更常见的拼写是 **anti-missionary**（也可写作 **antimissionary**）。你输入的形式较少见，可能是拼写变体或旧用法。","这个词常出现在殖民史、宗教史与文化冲突的语境中。使用时要注意语气：它可能是中性描述（立场反对），也可能带有强烈批判意味，取决于上下文。","相关表达：**anti-missionary movement**（反传教运动）, **anti-missionary sentiment**（反传教情绪）。文学与历史写作里常用来描述某一时期的社会态度或政治立场。"]}
{"word":"antimitotic","summary":{"en":"Antimitotic means ‘stopping or inhibiting mitosis (cell division),’ often used for drugs that slow cancer cell growth.","zh":"antimitotic 指“抗有丝分裂的/抑制细胞分裂的”，常用于描述抑制癌细胞生长的药物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Preventing or stopping mitosis (cell division), often describing certain drugs used to slow or stop the growth of cancer cells.","zh":"抗有丝分裂的；抑制或阻止细胞有丝分裂（细胞分裂）的，常用于描述某些用于减缓或阻止癌细胞生长的药物。"},"examples":[{"en":"Many chemotherapy drugs have antimitotic effects to slow the growth of tumors.","zh":"许多化疗药物具有抗有丝分裂作用，用来减缓肿瘤生长。"},{"en":"The researchers tested an antimitotic compound on rapidly dividing cells.","zh":"研究人员在快速分裂的细胞上测试了一种抗有丝分裂化合物。"}]}],"synonyms":["anti-mitotic","mitosis-inhibiting","antiproliferative"],"phonetic":"/ˌæn.ti.maɪˈtɑt.ɪk/","extraExplanation":["词源拆解：anti- 表示“反/抑制”，mitotic 来自 mitosis（有丝分裂），合起来就是“抑制有丝分裂的”。","常见语境：多见于医学/生物学论文、药理学说明书（如“antimitotic agent/antimitotic activity”）。日常英语中不常用。","文学/修辞提示：这是高度技术性的科学词汇，通常不会出现在文学作品中；若出现，多用于科幻或医学相关叙述以营造专业感。"]}
{"word":"antimixing","summary":{"en":"“Antimixing” means opposing mixing or preventing different things or groups from mixing; it can also refer to such a policy or belief.","zh":"“antimixing”指反对混合、阻止不同事物或人群混在一起；也可指这种政策或观念。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to mixing or being combined; intended to prevent different things (or groups of people) from mixing.","zh":"反对混合的；用于阻止不同事物（或不同人群）混在一起的。"},"examples":[{"en":"Some clubs used antimixing rules to keep different groups of people apart.","zh":"一些俱乐部曾用“反混合”规定来把不同人群隔开。"},{"en":"The package includes an antimixing layer so the two chemicals don’t combine too early.","zh":"这个包装包含防混层，以免两种化学品过早混合。"}]},{"partOfSpeech":"n.","definition":{"en":"A policy, belief, or movement that opposes mixing (often social mixing).","zh":"反对混合（常指社会层面的融合或通婚）的政策、观念或运动。"},"examples":[{"en":"The politician was criticized for supporting antimixing.","zh":"这位政治人物因支持反融合（反混合）立场而受到批评。"},{"en":"Historians study antimixing in the context of segregation laws.","zh":"历史学家会在种族隔离法律的背景下研究“反融合/反混合”思潮。"}]}],"synonyms":["anti-integration","segregationist","anti-assimilation"],"phonetic":"/ˌæntiˈmɪksɪŋ/","extraExplanation":["“antimixing”不是最常见的标准词条，更常见的相关表达有：**anti-integration（反融合）**、**segregationist（主张隔离的）**，以及在特定历史语境下的 **anti-miscegenation（反异族通婚）**。若你写作涉及种族/族群议题，建议选用更明确、常见的词，以避免含义模糊或引发误解。"]}
{"word":"antimnemonic","summary":{"en":"Antimnemonic means “hard to remember; not helpful for memory,” the opposite of mnemonic.","zh":"Antimnemonic 指“难以记住、无助于记忆的”，与 mnemonic（助记的）相反。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"making something harder to remember; the opposite of “mnemonic.”","zh":"使事物更难记住的；与“mnemonic（助记的）”相反。"},"examples":[{"en":"Random letter strings like “QXRTZ” are antimnemonic for most learners.","zh":"像“QXRTZ”这种随机字母串对大多数学习者来说是反助记的（很难记）。"},{"en":"The interface uses antimnemonic icons, so new users struggle to learn it.","zh":"这个界面用了反助记的图标，所以新用户很难学会。"}]}],"synonyms":["non-mnemonic","hard to remember","not memorable","memory-hindering"],"phonetic":"/ˌæntiˈnɪˌmɑnɪk/","extraExplanation":["这个词很少见，通常出现在写作、教育学或认知心理学语境中，用来强调“没有任何提示、模式或联想可帮助记忆”。","构词法：anti-（反，对立）+ mnemonic（助记的）。在日常英语里，更常用的表达是 “hard to remember / not memorable / doesn’t help memory”。"]}
{"word":"antimodel","summary":{"en":"An antimodel is mainly a technical term for a counterexample that shows a claim does not always hold; less commonly, it can mean a “negative-case” model used for contrast in computing or ML.","zh":"antimodel 主要是技术用语，指用来表明某主张并非总成立的“反例/反模型”；较少见时也可指在计算或机器学习中用于对照的“负例模型”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Logic/Math) A structure or example used to show that a statement, theory, or set of rules is not always true; a counterexample that “fails” the conditions of a model.","zh":"（逻辑/数学）用来表明某个命题、理论或规则并非总为真的结构或例子；相当于“反例”，显示该命题在此情形下不成立。"},"examples":[{"en":"The researcher built an antimodel to show the proposed rule does not hold in all cases.","zh":"研究者构造了一个 antimodel，用来说明该规则并非在所有情况下都成立。"},{"en":"One antimodel is enough to disprove the claim.","zh":"一个 antimodel 就足以推翻这个主张。"}]},{"partOfSpeech":"n.","definition":{"en":"(Computing/ML, less common) A model designed to represent what should be rejected (negative cases), often used for contrast in training or evaluation.","zh":"（计算/机器学习，较少见）用于表示“应被排除/拒绝”的负例的模型，常用于训练或评估时的对照。"},"examples":[{"en":"They trained an antimodel on incorrect answers to help the system detect errors.","zh":"他们用错误答案训练了一个 antimodel，帮助系统识别错误。"},{"en":"The classifier improved after adding an antimodel for confusing inputs.","zh":"加入用于混淆输入的 antimodel 后，分类器表现有所提升。"}]}],"synonyms":["counterexample","disproof example","non-example","negative model"],"phonetic":"/ˈæntiˌmɑdəl/","extraExplanation":["“antimodel”不是日常高频词，更常见的表达是“counterexample（反例）”。在模型论（model theory）语境中，人们有时用“model（模型）”表示满足某些公理/句子的结构；相对地，“antimodel”可指用来展示“不满足”的结构，用于反驳或界定理论边界。","构词上由前缀 anti-（反、对立）+ model（模型）组成，通常重音在“an-”上。"]}
{"word":"antimodern","summary":{"en":"Antimodern describes attitudes or styles that oppose modern ways and prefer older traditions.","zh":"Antimodern 指反对现代方式或现代风格、偏好旧式传统的态度或风格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to modern ideas, styles, or social changes; favoring older traditions instead","zh":"反现代的；反对现代观念、风格或社会变革，倾向于更传统、旧式的做法"},"examples":[{"en":"Some people call the movement antimodern because it rejects new technology and urban life.","zh":"有人称这个运动为反现代，因为它拒绝新科技和城市生活。"},{"en":"His antimodern taste shows in his love of handwritten letters and classic furniture.","zh":"他反现代的品味体现在他喜欢手写信和经典家具。"}]}],"synonyms":["traditionalist","anti-modern","old-fashioned","conservative"],"phonetic":"/ˌæntiˈmɑdɚn/","extraExplanation":["“antimodern”常用于历史、艺术与社会评论语境，描述对“现代性”（如工业化、城市化、消费文化、世俗化等）的批评或反感。它不一定等同于“反科学”，更多是价值观与生活方式上的选择或立场。","近义表达可根据语气选择：中性可用“traditional / conservative（传统的/保守的）”，更强烈的否定可用“reactionary（反动的）”。但“antimodern”强调的是“反对现代化/现代风格”这一点。"]}
{"word":"antimodernism","summary":{"en":"Antimodernism is opposition to modernism or modern ways of thinking, often favoring traditional styles or values.","zh":"Antimodernism 指反对现代主义或现代观念，常倾向于传统的风格或价值观。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to modernism or to modern ideas, styles, and social changes (often in art, architecture, literature, religion, or politics).","zh":"反现代主义；对现代主义或现代观念、风格与社会变迁的反对（常见于艺术、建筑、文学、宗教或政治领域）。"},"examples":[{"en":"In architecture, antimodernism sometimes favors traditional materials and ornament over glass-and-steel minimalism.","zh":"在建筑领域，反现代主义有时偏好传统材料与装饰，而不是玻璃与钢结构的极简风格。"},{"en":"Some writers expressed antimodernism by criticizing industrial life and celebrating rural communities.","zh":"一些作家通过批评工业化生活、赞美乡村共同体来表达反现代主义立场。"}]},{"partOfSpeech":"n.","definition":{"en":"A movement, attitude, or set of works that rejects modernist principles and promotes older or more traditional forms.","zh":"一种运动或思想倾向；指拒斥现代主义原则、提倡更古老或更传统形式的一组作品或立场。"},"examples":[{"en":"The museum’s exhibit compared modernism with antimodernism in early 20th-century painting.","zh":"博物馆的展览对比了20世纪初绘画中的现代主义与反现代主义。"},{"en":"His poetry’s antimodernism shows up in its classical meter and themes of faith.","zh":"他诗歌中的反现代主义体现在古典格律以及信仰主题上。"}]}],"synonyms":["anti-modernism","traditionalism","reaction against modernism"],"phonetic":"/ˌæn.tiˈmɑd.ɚˌnɪz.əm/","extraExplanation":["“antimodernism”由前缀 anti-（反对）+ modernism（现代主义）构成。它通常不是单一学派，而是一类“反对现代性/现代主义”的立场：有时反对的是艺术上的现代主义（如实验性形式、抽象、打破传统），有时反对的是社会层面的现代化（如工业化、城市化、世俗化）。因此理解时要结合语境：在艺术史里多指对现代主义美学的反动；在社会思想里可能更接近对“现代生活方式”的批评。"]}
{"word":"antimodernist","summary":{"en":"Antimodernist describes a person, work, or attitude that opposes modernism and prefers traditional styles or values.","zh":"Antimodernist 指反对现代主义、偏好传统风格或价值的立场、作品或人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to modernism (especially in art, literature, architecture, or cultural ideas), often favoring traditional styles, values, or forms.","zh":"反现代主义的（尤指在艺术、文学、建筑或文化观念上反对现代主义），常倾向于传统风格、价值或形式。"},"examples":[{"en":"Some critics call the novel antimodernist because it rejects experimental style and returns to a traditional storyline.","zh":"一些评论家称这部小说是反现代主义的，因为它拒绝实验性写法，回到传统叙事。"},{"en":"His antimodernist taste shows in his preference for classical architecture over glass-and-steel buildings.","zh":"他偏好古典建筑而非玻璃钢结构大楼，体现了他的反现代主义品味。"}]}],"synonyms":["anti-modernist","traditionalist (context-dependent)","anti-modern (context-dependent)"],"phonetic":"/ˌæn.tiˈmɑː.dɚ.nɪst/","extraExplanation":["“antimodernist”常见于人文学科语境：modernism（现代主义）大致指19世纪末到20世纪中期在文学、艺术与思想中追求“打破传统、形式创新”的潮流；因此“反现代主义”不一定等于“反现代化（industrialization/technology）”，更常指反对现代主义的审美与观念。","在文学批评里，它可能描述偏好清晰叙事、道德秩序、宗教传统或“回到过去”主题的作品或立场。"]}
{"word":"antimodernistic","summary":{"en":"Antimodernistic means opposing modern ideas or modernist styles, often favoring tradition.","zh":"Antimodernistic 指反对现代观念或现代主义风格，常带有推崇传统的意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to modern ideas, styles, or social changes; favoring older or traditional ways","zh":"反现代的；反对现代思想、风格或社会变革的；偏向旧式或传统的"},"examples":[{"en":"His antimodernistic views made him suspicious of new technology and social reforms.","zh":"他的反现代观点让他对新技术和社会改革充满怀疑。"},{"en":"The novel portrays an antimodernistic community that rejects city life.","zh":"这部小说描绘了一个拒绝城市生活的反现代社群。"}]},{"partOfSpeech":"adj.","definition":{"en":"(art/literature) rejecting modernist movements and preferring more traditional artistic forms","zh":"（艺术/文学）反对现代主义流派，偏好更传统的艺术形式"},"examples":[{"en":"The critic called the painter’s work antimodernistic because it avoided modernist experimentation.","zh":"评论家称这位画家的作品为反现代主义的，因为它回避了现代主义的实验手法。"}]}],"synonyms":["anti-modern","anti-modernist","traditionalist","conservative","reactionary"],"phonetic":"/ˌæntiˌmɑdɚˈnɪstɪk/","extraExplanation":["“antimodernistic”比较少见，更常见的表达是“anti-modern”或“anti-modernist”。在正式写作中，如果谈的是艺术史/文学史里的“现代主义（modernism）”，用“anti-modernist”往往更准确；如果泛指反对现代化生活方式或现代观念，用“anti-modern”更自然。","构词上：anti-（反对）+ modern（现代的）+ -istic（带有……特征的）。语气通常偏批评或学术描述，暗示对“现代性”持抵触态度。"]}
{"word":"antimodernization","summary":{"en":"Antimodernization means opposition or resistance to modernization and its related changes.","zh":"Antimodernization 指反对或抵制现代化及其带来的相关变化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to modernization; resistance to social, cultural, economic, or technological changes associated with becoming more “modern.”","zh":"反对现代化；抵制与“变得更现代”相关的社会、文化、经济或技术变化。"},"examples":[{"en":"Some community leaders expressed antimodernization views and argued against rapid urban development.","zh":"一些社区领袖表达了反现代化的观点，反对快速的城市开发。"},{"en":"The novel portrays antimodernization as a fear of losing tradition and identity.","zh":"这部小说把反现代化描写成对失去传统与身份认同的担忧。"}]},{"partOfSpeech":"n.","definition":{"en":"(Broader) A movement, attitude, or ideology that criticizes modernity and promotes a return to older values or ways of life.","zh":"（更广义）一种批判现代性、倡导回归旧有价值观或生活方式的运动、态度或意识形态。"},"examples":[{"en":"In the essay, antimodernization is framed as a moral critique of consumer culture.","zh":"在这篇文章里，反现代化被描述为对消费文化的道德批判。"},{"en":"Their antimodernization stance included rejecting certain new media and technologies.","zh":"他们的反现代化立场包括拒绝某些新媒体和新技术。"}]}],"synonyms":["anti-modernization","resistance to modernization","opposition to modernization","anti-modernity (related)","traditionalism (related)"],"phonetic":"/ˌæn.tiˌmɑː.dɚ.nəˈzeɪ.ʃən/","extraExplanation":["“antimodernization”在实际写作中更常见的形式是带连字符的“anti-modernization”。也可以用更自然的表达，如“opposition to modernization / resistance to modernization”。","注意区分：反对“现代化”(modernization)不一定等于反对“现代性/现代社会”(modernity)；前者偏向过程与政策，后者偏向价值观与时代特征。"]}
{"word":"antimodernly","summary":{"en":"“Antimodernly” means “in a way that is against modern things or modern thinking.”","zh":"“antimodernly”表示“以反现代、反对现代事物或现代观念的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that rejects or opposes modern ideas, styles, technology, or social changes; in an anti-modern manner.","zh":"以反现代的方式；以反对现代观念、风格、技术或社会变化的态度。"},"examples":[{"en":"He wrote antimodernly, praising rural life and criticizing industrial cities.","zh":"他用反现代的语气写作，赞美乡村生活并批评工业城市。"},{"en":"The group spoke antimodernly about smartphones and social media.","zh":"这个团体以反现代的立场谈论智能手机和社交媒体。"}]}],"synonyms":["anti-modernly","in an anti-modern way","traditionally (in some contexts)","conservatively (in some contexts)"],"phonetic":"/ˌæn.tiˈmɑː.dɚn.li/","extraExplanation":["“antimodernly”由前缀 anti-（反对）+ modern（现代的）+ -ly（副词后缀）构成，常见于评论、历史或文化讨论中，用来描述一种立场或表达方式，而不是日常口语。","相关概念常出现在“反现代主义（anti-modernism）”的语境里，例如对工业化、城市化或某些现代价值观的抵制与批评。"]}
{"word":"antimodernness","summary":{"en":"Antimodernness means opposition to modernity or the quality of being antimodern, often favoring tradition over modern change.","zh":"Antimodernness 指对现代性/现代化的反对，或“反现代”的特质，常体现为偏好传统而不满现代变迁。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to modernity (modern ideas, lifestyles, technology, or social change), often based on a preference for tradition.","zh":"反现代性；对现代化（现代观念、生活方式、科技或社会变迁）的反对，通常源于对传统的偏好。"},"examples":[{"en":"Some writers express antimodernness by criticizing consumer culture and rapid technological change.","zh":"一些作家通过批评消费文化和快速的科技变化来表达反现代性。"},{"en":"The movement’s antimodernness was rooted in a desire to protect rural life and local customs.","zh":"该运动的反现代性源于保护乡村生活和地方习俗的愿望。"}]},{"partOfSpeech":"n.","definition":{"en":"The quality or state of being antimodern; an antimodern style, tone, or worldview.","zh":"反现代的特质或状态；一种反现代的风格、语气或世界观。"},"examples":[{"en":"There is a quiet antimodernness in the film’s focus on handmade objects and slow living.","zh":"这部电影聚焦手工制品与慢生活，带有一种安静的反现代气质。"},{"en":"Her essays balance antimodernness with admiration for certain scientific advances.","zh":"她的文章在反现代倾向与对某些科学进步的欣赏之间取得平衡。"}]}],"synonyms":["anti-modernity","traditionalism","reactionism","anti-modern sentiment","anti-modern attitude"],"phonetic":"/ˌæn.taɪˈmɑː.dɚn.nəs/","extraExplanation":["“antimodernness”常见于人文与社会科学语境（如文化批评、文学研究、历史研究），用来概括对“现代性/现代化”的怀疑或抵抗。它不一定等于“反科技”，也可能针对现代社会的价值观（如消费主义、效率至上、城市化、世俗化等）。","相关概念可对照：modernity（现代性：描述现代社会的总体特征）、modernization（现代化：更偏向经济与制度的过程）、modernism（现代主义：艺术/文学思潮）。不同领域里三者与“antimodernness”的关系不完全相同。"]}
{"word":"antimonarch","summary":{"en":"“Antimonarch” means opposing monarchy; it can describe a person or an idea that is against having a king or queen as head of state.","zh":"“antimonarch”指反对君主制；既可指反对君主制的人，也可形容反君主制的立场或言论。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who opposes having a monarch (a king or queen) as the head of state; someone against monarchy.","zh":"反对君主制的人；反对以国王或女王为国家元首的人。"},"examples":[{"en":"Some antimonarch activists campaign for an elected head of state.","zh":"一些反对君主制的活动人士呼吁由选举产生国家元首。"},{"en":"He described himself as an antimonarch who supports a republic.","zh":"他称自己是反对君主制的人，支持共和国体制。"}]},{"partOfSpeech":"adj.","definition":{"en":"Opposing monarchy or a monarch.","zh":"反君主制的；反对君主或君主制度的。"},"examples":[{"en":"The group published an antimonarch statement after the royal speech.","zh":"在王室演讲后，该组织发表了一份反君主制声明。"},{"en":"Antimonarch sentiment rose during the political crisis.","zh":"在政治危机期间，反君主制情绪上升。"}]}],"synonyms":["antimonarchist","anti-monarchy","republican (in the sense of favoring a republic)","anti-royalist"],"phonetic":"/ˌæn.tiˈmɑː.nɑːrk/","extraExplanation":["“antimonarch”不算常见，更常见的说法是 **anti-monarchy**（反君主制的/反对君主制）或 **antimonarchist**（反君主制者）。","构词法：**anti-**（反对）+ **monarch**（君主）。在新闻或政治讨论中，通常与 **republic**（共和国）等概念一起出现。"]}
{"word":"antimonarchal","summary":{"en":"Antimonarchal means “against monarchy or royal rule.”","zh":"antimonarchal 意为“反君主制的；反对君主统治的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to monarchy or to rule by a king or queen; favoring replacing a monarch with another form of government (such as a republic).","zh":"反君主制的；反对君主统治的；主张以共和国等其他政体取代君主。"},"examples":[{"en":"Many antimonarchal groups argued that political power should come from elections, not birth.","zh":"许多反君主制团体认为政治权力应来自选举，而不是出身。"},{"en":"The novel includes an antimonarchal journalist who criticizes the royal court.","zh":"这部小说里有一位反君主制的记者，批评王室宫廷。"}]}],"synonyms":["anti-monarchy","anti-monarchical","republican (in the sense of opposing monarchy)","anti-royalist"],"phonetic":"/ˌæn.tiˈmɑː.nɚ.kəl/","extraExplanation":["“antimonarchal”由前缀 anti-（反对）+ monarch（君主）+ -al（形容词后缀）构成，常用于政治史与政治观点的语境。","在现代英语中更常见的同义表达有 anti-monarchy、anti-monarchical；在描述历史事件（如革命、废黜王室）或政治立场时会出现。"]}
{"word":"antimonarchally","summary":{"en":"“Antimonarchally” means “in an anti-monarchy way; opposing rule by a monarch.”","zh":"“antimonarchally”意为“以反君主制的方式；反对君主统治地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that opposes monarchy (rule by a king or queen).","zh":"以反君主制（反对国王或女王统治）的方式；反对君主政体地。"},"examples":[{"en":"The group spoke antimonarchally, arguing that all political power should come from elections.","zh":"该组织以反君主制的立场发言，主张所有政治权力都应来自选举。"},{"en":"Some pamphlets from that era were written antimonarchally to criticize royal authority.","zh":"那个时期的一些小册子以反君主制的方式写作，用来批判王权。"}]}],"synonyms":["anti-monarchically","republicanly","anti-royalist (in tone)"],"phonetic":"/ˌæntiˈmɑnɚkəli/","extraExplanation":["这个词由 anti-（反对）+ monarch（君主）+ -al（形容词后缀）+ -ly（副词后缀）构成，意思是“以反君主制的方式”。","在现代英语中它比较少见，更常见的说法是 anti-monarchy / anti-monarchical（反君主制的）或 anti-monarchist（反君主制者）。"]}
{"word":"antimonarchial","summary":{"en":"Antimonarchial means opposed to monarchy or favoring ending a king/queen-led system.","zh":"antimonarchial 指“反君主制的”，即反对或主张废除由国王/女王统治的体制。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to monarchy (a system where a king or queen rules), or supporting the idea of ending monarchy.","zh":"反君主制的；反对君主政体（由国王或女王统治）的；主张废除君主制的。"},"examples":[{"en":"The party has a long antimonarchial tradition and supports a republic.","zh":"这个政党有悠久的反君主制传统，并支持共和国体制。"},{"en":"Antimonarchial protests broke out after the royal scandal.","zh":"王室丑闻之后爆发了反君主制抗议。"}]}],"synonyms":["anti-monarchical","antimonarchical","republican (in the sense of favoring a republic)"],"phonetic":"/ˌæn.taɪ.məˈnɑr.ki.əl/","extraExplanation":["“antimonarchial”在英语中较少见，更常见、也更标准的拼写是 **anti-monarchical** 或 **antimonarchical**。写作时如果想更自然，建议优先用这两种形式。","词缀拆解：**anti-**（反对）+ **monarch**（君主）+ **-ical / -ical**（…的）。","常见相关词：**monarchy**（君主制），**monarchist**（拥护君主制的人），**republican**（支持共和制的；注意不一定指美国政党）。","在历史与政治语境中，该词常用于讨论英国、西班牙等仍保留君主制国家的政治立场、社会运动或思想传统。"]}
{"word":"antimonarchic","summary":{"en":"“Antimonarchic” means opposed to monarchy or monarchs, often used in formal political or historical contexts.","zh":"“Antimonarchic”指反对君主制或君主统治，常用于较正式的政治或历史语境中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to a monarchy or to monarchical rule.","zh":"反君主制的；反对君主政体或君主统治的。"},"examples":[{"en":"The group’s antimonarchic views led them to call for a republic.","zh":"该团体的反君主制观点使他们呼吁建立共和国。"},{"en":"An antimonarchic movement gained support during the political crisis.","zh":"在政治危机期间，一个反君主制运动获得了更多支持。"}]}],"synonyms":["anti-monarchy","anti-monarchical","republican (in some contexts)"],"phonetic":"/ˌæntaɪməˈnɑrkɪk/","extraExplanation":["词源：anti-（“反对”）+ monarch（“君主”）+ -ic（形容词后缀），字面意思就是“反对君主的”。","用法提示：antimonarchic 多见于政治史、政治学或评论文章中，语气偏正式；日常口语里更常用 anti-monarchy 或 anti-monarchist。","相关词：monarchic（君主制的）、monarchical（君主的/君主制的）、antimonarchy（反君主制立场/运动）、antimonarchist（反君主制者）。"]}
{"word":"antimonarchical","summary":{"en":"Antimonarchical means opposed to monarchy or royal rule.","zh":"antimonarchical 意为“反君主制的、反对王权统治的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to monarchy or the rule of a king or queen; favoring ending or limiting royal power.","zh":"反对君主制或国王/女王统治的；主张结束或限制王权的。"},"examples":[{"en":"The party adopted an antimonarchical platform and called for a republic.","zh":"该政党采取了反君主制的纲领，并呼吁建立共和国。"},{"en":"Antimonarchical protests spread after the scandal weakened support for the crown.","zh":"丑闻削弱了对王室的支持后，反君主制抗议活动蔓延开来。"}]}],"synonyms":["anti-monarchic","antiroyalist","republican (often related, context-dependent)"],"phonetic":"/ˌæn.ti.məˈnɑr.kɪ.kəl/","extraExplanation":["这个词由前缀 anti-（“反对”）+ monarchical（“君主制的/王权的”）构成，常见于政治、历史与学术写作中，日常口语里较少用。","注意 antimonarchical 主要表示“反对君主制这种政治制度”，不一定等同于“反对某一个具体国王/女王”（那更接近 anti-royalist 或 anti-crown 的语境）。"]}
{"word":"antimonarchically","summary":{"en":"“Antimonarchically” means “in a way that opposes monarchy.”","zh":"antimonarchically 意为“以反对君主制的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that opposes monarchy (rule by a king or queen) or supports ending a monarchy.","zh":"以反对君主制（由国王或女王统治）或支持废除君主制的方式。"},"examples":[{"en":"The group spoke antimonarchically during the rally, calling for an elected head of state.","zh":"该团体在集会上以反君主制的立场发言，呼吁由选举产生国家元首。"},{"en":"Some newspapers wrote antimonarchically after the scandal, questioning the royal family’s role.","zh":"丑闻之后，一些报纸以反君主制的口吻撰文，质疑王室的作用。"}]}],"synonyms":["anti-monarchy","republicanly","against the monarchy"],"phonetic":"/ˌæn.taɪ.məˈnɑr.kɪ.kli/","extraExplanation":["这个词比较少见，更多时候人们会用更自然的表达，比如：in an anti-monarchy way / with anti-monarchy views / opposed to the monarchy。","构词法：anti-（反对）+ monarch（君主）+ -ic（……的）+ -al（……的）+ -ly（副词）。意思就是“以反君主制的方式”。","常见搭配语境：政治讨论、历史写作、共和主义（republicanism）与君主制的对比、革命或宪政改革相关文本。"]}
{"word":"antimonarchicalness","summary":{"en":"Antimonarchicalness means opposition to monarchy as a political system.","zh":"Antimonarchicalness 指反对君主政体（君主制）这种政治制度的立场或倾向。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to monarchy (rule by a king or queen), or the belief that a monarchy should not exist.","zh":"反君主制；反对君主政体（由国王或女王统治）的立场或信念。"},"examples":[{"en":"In the late 1700s, antimonarchicalness grew in parts of Europe and North America.","zh":"在18世纪末，欧洲和北美部分地区的反君主制情绪日益高涨。"},{"en":"His antimonarchicalness came from the belief that power should come from elections, not birth.","zh":"他的反君主制立场源于一种信念：权力应来自选举，而不是出身。"}]}],"synonyms":["anti-monarchism","anti-monarchical sentiment","republicanism (often related)"],"phonetic":"/ˌæntiˈmɑnɚkɪkəlnəs/","extraExplanation":["这是一个很少见、偏学术的抽象名词，通常在历史、政治理论或论文语境中出现。日常英语更常用 anti-monarchy / anti-monarchist / anti-monarchical sentiments（反君主制情绪/立场）。","构词法：anti-（反对）+ monarchical（君主制的）+ -ness（把形容词变成“性质/状态”的名词）。因此它强调“反君主制这一性质/倾向”。","语境提示：它不等同于反对某一位国王/女王个人（anti-king/anti-queen），而是反对“君主制这种制度”。"]}
{"word":"antimonarchism","summary":{"en":"Antimonarchism means opposition to monarchy as a form of government.","zh":"Antimonarchism 指反对君主制这一政府形式的立场或思想。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to monarchy as a political system; the belief that a country should not be ruled by a king or queen.","zh":"反君主制；反对以国王或女王为国家元首的政治制度，主张国家不应由君主统治。"},"examples":[{"en":"Antimonarchism grew after the revolution, and many people demanded an elected head of state.","zh":"革命之后，反君主制思潮兴起，许多人要求由选举产生国家元首。"},{"en":"Her essay explains antimonarchism in modern Europe without attacking individual royal families.","zh":"她的文章讨论了现代欧洲的反君主制观点，但并未针对具体王室家族进行攻击。"}]}],"synonyms":["anti-monarchism","republicanism (related)","anti-royalism (less formal/less precise)"],"phonetic":"/ˌæn.tiˈmɑːn.ɚ.kɪ.zəm/","extraExplanation":["词源结构：anti-（反对）+ monarch（君主）+ -ism（主义/思想）。因此它通常指“政治立场或意识形态”，而不只是单纯“不喜欢某个国王/女王”。","使用语境：在新闻与学术写作中常与 republicanism（共和主义）一起出现，但两者不完全相同：antimonarchism 强调“反对君主制”，republicanism 强调“建立共和国/民选元首的制度”。","文化提醒：在一些仍保留君主制（如英国、瑞典、日本等）的国家，反君主制讨论往往涉及宪政、历史传统与公共财政等议题；表达时区分“制度批评”与“人身攻击”会更得体。"]}
{"word":"antimonarchist","summary":{"en":"Antimonarchist means ‘against monarchy,’ either a person who opposes kings/queens or an adjective describing that view.","zh":"antimonarchist 指“反君主制的/反君主制者”，既可指反对君主政体的人，也可作形容词描述这种立场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who opposes monarchy (rule by a king or queen), often supporting a republic or other non-royal form of government.","zh":"反君主制者；反对君主政体（由国王或女王统治）的人，常支持共和国或其他非王室的政体。"},"examples":[{"en":"During the revolution, antimonarchists argued that the country should become a republic.","zh":"在革命期间，反君主制者主张国家应该成为共和国。"},{"en":"She comes from an antimonarchist tradition in politics and history.","zh":"她在政治与历史观念上来自反君主制的传统。"}]},{"partOfSpeech":"adj.","definition":{"en":"Opposing monarchy or supporting the removal/abolition of a monarchy.","zh":"反对君主制的；主张废除君主政体的。"},"examples":[{"en":"The party’s antimonarchist platform called for ending royal privileges.","zh":"该政党的反君主制纲领呼吁结束王室特权。"},{"en":"Antimonarchist protests broke out in several cities.","zh":"多个城市爆发了反君主制抗议活动。"}]}],"synonyms":["anti-monarchy","republican (in the pro-republic sense)","anti-royalist","anti-royal"],"phonetic":"/ˌæn.tiˈmɑː.nɚ.kɪst/","extraExplanation":["这个词由 anti-（“反对”）+ monarch（“君主”）+ -ist（“……主义者/……者”）组成。常见近义表达：anti-monarchy（形容词短语）、republican（在“支持共和制”意义上，但也可能指美国共和党人，语境要注意）。","语境上多见于历史与政治讨论（如法国大革命、俄国革命、英格兰内战及一些国家的共和运动）。使用时通常带有立场色彩，因此在中性描述中可用“anti-monarchy activist/critic”（反君主制活动者/批评者）等更具体说法。"]}
{"word":"antimonarchistic","summary":{"en":"Antimonarchistic means opposed to monarchy or supportive of removing/avoiding a monarch.","zh":"antimonarchistic 指“反君主制的”，反对君主统治或主张取消/不设君主。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to monarchy (rule by a king or queen), or supporting the idea that a country should not have a monarch.","zh":"反君主制的；反对由国王或女王统治，或主张国家不应设立君主的。"},"examples":[{"en":"Her antimonarchistic views came from a belief that leaders should be elected.","zh":"她的反君主制观点源于她认为领导人应由选举产生。"},{"en":"The group published antimonarchistic articles calling for a republic.","zh":"该团体发表反君主制文章，呼吁建立共和国。"}]}],"synonyms":["anti-monarchy","anti-monarchist","republican (in the anti-monarchy sense)"],"phonetic":"/ˌæn.ti.məˌnɑr.kɪs.tɪk/","extraExplanation":["“antimonarchistic”由前缀 anti-（反对）+ monarch（君主）+ -istic（……倾向/性质的）组成，语气偏正式，常见于政治学、历史写作或评论文章。","近义表达里更常用的是“anti-monarchy / anti-monarchist”或“republican”（在“主张共和国、反对君主制”的意义上；注意与美国政党“Republican”区分）。"]}
{"word":"antimonarchists","summary":{"en":"Antimonarchists are people who oppose monarchy and want to end or reduce royal power.","zh":"Antimonarchists 指反对君主制、主张废除或削弱王室权力的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who oppose monarchy (rule by a king or queen) and support ending or limiting royal power.","zh":"反君主制者；反对君主制（由国王或女王统治）并主张废除或限制王室权力的人。"},"examples":[{"en":"The antimonarchists called for replacing the king with an elected government.","zh":"反君主制者呼吁用民选政府取代国王。"},{"en":"In the debate, antimonarchists argued that no one should inherit political power.","zh":"在辩论中，反君主制者认为政治权力不应由继承获得。"}]}],"synonyms":["republicans (in the sense of pro-republic, anti-monarchy)","anti-royalists","anti-monarchists"],"phonetic":"/ˌæn.tiˈmɑn.ɚ.kɪsts/","extraExplanation":["“antimonarchists”是复数形式，单数是“an antimonarchist”。也可以作形容词用（antimonarchist views＝反君主制的观点）。","这个词常出现在讨论政治制度与历史变革的语境中，例如革命时期、共和制运动，或关于君主立宪制与共和制的公共辩论。"]}
{"word":"antimonarchy","summary":{"en":"Antimonarchy means opposition to monarchy; it can describe ideas or people who reject rule by a king or queen.","zh":"Antimonarchy 指反对君主制；可形容反对君主统治的观点，也可指反君主制的人或团体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to having a monarchy (a king or queen as head of state); supporting the idea that a country should not be ruled by a monarch.","zh":"反对君主制的；主张国家不应由国王或女王统治的。"},"examples":[{"en":"Many antimonarchy activists argue for an elected head of state.","zh":"许多反君主制的活动人士主张由选举产生国家元首。"},{"en":"The group published an antimonarchy statement after the royal scandal.","zh":"王室丑闻发生后，该团体发表了反君主制声明。"}]},{"partOfSpeech":"n.","definition":{"en":"a person, group, or viewpoint that opposes monarchy.","zh":"反君主制者；反君主制立场或观点。"},"examples":[{"en":"She has been an antimonarchy since college.","zh":"她从大学起就是反君主制者。"},{"en":"Antimonarchies often support a republic instead.","zh":"反君主制者通常转而支持共和制。"}]}],"synonyms":["anti-monarchy","antiroyalist","republican (in the sense of supporting a republic)","antiroyal"],"phonetic":"/ˌæn.tiˈmɑː.nɑr.ki/","extraExplanation":["“anti-”是表示“反对”的常见前缀；“monarchy”指君主制（由国王/女王等君主担任国家元首）。因此 antimonarchy 常见于政治讨论、媒体评论与社会运动语境。","在英语里更常见的拼写形式是带连字符的 “anti-monarchy”（尤其作形容词时），但不带连字符的 “antimonarchy” 也能见到。","相关概念：monarchist（君主制拥护者），republicanism（共和主义，这里指支持共和制的政治理念，不一定等同于美国政党）。"]}
{"word":"antimonate","summary":{"en":"Antimonate is a chemistry term for a compound (usually a salt) that contains antimony in an oxidized, oxygen-containing form.","zh":"Antimonate 是化学术语，指含有高价态、含氧形式锑的化合物（通常为锑酸盐）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A chemical compound (a salt or ester) containing antimony in a high oxidation state, usually derived from antimonic acid; antimonate ions commonly include forms like SbO4− or Sb(OH)6−.","zh":"（化学）锑酸盐；含有高价态锑的化合物（通常为锑酸的盐或酯）。常见的锑酸根/锑酸盐阴离子形式包括 SbO4− 或 Sb(OH)6− 等。"},"examples":[{"en":"Some minerals contain antimonate compounds formed under oxidizing conditions.","zh":"一些矿物在氧化条件下会形成锑酸盐化合物。"},{"en":"The lab analyzed the water sample for antimonate and other metal oxyanions.","zh":"实验室检测了水样中的锑酸盐以及其他金属含氧阴离子。"}]}],"synonyms":["antimony(V) salt","antimonic acid salt","antimonate salt"],"phonetic":"/ænˈtɪməˌneɪt/","extraExplanation":["“antimonate”来自“antimony（锑）+ -ate（盐类后缀）”。在无机化学里，-ate 常表示含氧酸根或其盐（如 sulfate 硫酸盐、nitrate 硝酸盐），因此 antimonate 通常指“含氧的锑酸根及其盐”。","在环境与分析化学中，锑的不同形态（如 antimonite vs. antimonate）常对应不同氧化态与迁移性；不同形态在水体中的行为、毒性与检测方法可能不同。"]}
{"word":"antimonial","summary":{"en":"Antimonial means “related to or containing antimony.”","zh":"antimonial 指“与锑有关的；含锑的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to antimony (a chemical element), or containing antimony.","zh":"与锑（化学元素）有关的；含锑的。"},"examples":[{"en":"The lab tested an antimonial compound used in glassmaking.","zh":"实验室检测了一种用于制玻璃的含锑化合物。"},{"en":"Antimonial salts were once used in older medical treatments, though many are now avoided for safety reasons.","zh":"含锑盐曾用于较早的医疗治疗，但出于安全原因，如今许多已不再使用。"}]}],"synonyms":["antimony-based","antimony-containing"],"phonetic":"/ˌæn.təˈmoʊ.ni.əl/","extraExplanation":["“antimonial”来自“antimony（锑）”。锑是一种化学元素（符号 Sb），在工业上可用于阻燃材料、合金、玻璃与半导体等领域。","在历史上，某些“antimonial”药剂（含锑制剂）曾被用作催吐剂或治疗寄生虫感染，但由于毒性与副作用风险，现代医学使用更谨慎或已被替代。"]}
{"word":"antimoniate","summary":{"en":"Antimoniate is a chemistry term for a salt or ester containing an antimoniate ion (related to antimonic acid).","zh":"Antimoniate 是化学用语，指含锑酸根的盐或酯（与锑酸相关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (a salt or ester) containing the antimoniate ion, derived from antimonic acid; used mainly in chemistry and materials contexts.","zh":"锑酸盐；含有“锑酸根（antimoniate）”的化合物（通常为锑酸的盐或酯），主要用于化学与材料相关语境。"},"examples":[{"en":"Sodium antimoniate is sometimes used in analytical chemistry to help separate certain metals.","zh":"锑酸钠有时用于分析化学中，帮助分离某些金属。"},{"en":"The sample contained traces of antimoniate, suggesting oxidation of antimony during processing.","zh":"样品中含有微量锑酸盐，说明加工过程中锑可能发生了氧化。"}]}],"synonyms":["antimonate","antimony(V) salt"],"phonetic":"/ˌæn.tɪˈmoʊ.ni.eɪt/","extraExplanation":["“antimoniate”是比较专业的化学词，日常英语里很少见。它通常出现在论文、实验记录、材料配方或安全数据表（SDS）中。","词形上：antimony（锑）+ -ate（常表示“某酸的盐/酯”），所以antimoniate通常可理解为“锑酸相关的盐/酯”。","阅读化学文本时，你可能也会看到更具体的名称，如“sodium antimoniate（锑酸钠）”“potassium antimoniate（锑酸钾）”，这些比单独的antimoniate更常见。"]}
{"word":"antimoniated","summary":{"en":"“Antimoniated” means containing or treated with antimony, especially in older chemistry/medicine contexts.","zh":"“antimoniated”指“含锑的/用锑处理过的”，多见于较早的化学或医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"containing antimony; made with or treated with antimony compounds (often in older scientific or medical writing).","zh":"含锑的；用锑（或锑化合物）制成的／处理过的（常见于较早的科学或医学文献）。"},"examples":[{"en":"The chemist prepared an antimoniated solution for the experiment.","zh":"化学家配制了一种含锑溶液用于实验。"},{"en":"In older medical texts, an antimoniated preparation was sometimes used as a remedy.","zh":"在较早的医学文献中，含锑制剂有时会被用作药物。"}]}],"synonyms":["antimony-containing","antimonial"],"phonetic":"/ænˌtɪˈmoʊniˌeɪtɪd/","extraExplanation":["“antimoniated”来自 antimony（锑）+ -ate（使……化/与……有关）+ -ed（形容词化），多见于旧式化学命名或历史医学语境。现代英语里更常见的表达是 “containing antimony” 或具体到某种化合物（如 antimony trioxide 等）。","锑化合物在历史上曾用于某些药物（例如“酒石酸锑钾”等含锑药），但因毒性和副作用问题，现代医学用途非常有限或已被替代。"]}
{"word":"antimonic","summary":{"en":"Antimonic means “containing or relating to antimony (Sb) or its compounds.”","zh":"antimonic 指“含锑的；与锑（Sb）或其化合物有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing, relating to, or made from antimony (Sb) or its compounds.","zh":"含锑的；与锑（化学元素 Sb）或其化合物有关的；由锑或其化合物制成的。"},"examples":[{"en":"The lab stored antimonic compounds in clearly labeled containers.","zh":"实验室把含锑化合物存放在贴有清晰标签的容器里。"},{"en":"Antimonic minerals can occur in ore deposits with other metals.","zh":"含锑矿物可能与其他金属一起出现在矿床中。"}]}],"synonyms":["antimony-containing","antimony-based"],"phonetic":"ˌæntɪˈmɑnɪk","extraExplanation":["“antimonic”是比较偏学术/技术的形容词，常见于化学、矿物学与材料科学语境，用来描述“含锑”或“与锑有关”的物质。","锑（antimony, 元素符号 Sb）在英语里来自拉丁语来源；在现代写作中更常见的搭配有 antimony compounds（锑化合物）、antimony oxide（三氧化二锑）等。","在安全与环保语境中，含锑物质可能涉及毒性与职业暴露问题，阅读相关资料时要注意其具体化学形态与剂量条件。"]}
{"word":"antimonid","summary":{"en":"An antimonid(e) is a chemical compound containing antimony, often discussed in semiconductor and materials contexts.","zh":"antimonid(e) 指含锑的化合物（锑化物），常用于半导体与材料科学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a compound in which antimony (Sb) is combined with a more electropositive element (such as a metal), often used in materials science (e.g., semiconductors).","zh":"锑化物：锑（Sb）与更电正的元素（如金属）形成的化合物，常见于材料科学领域（例如半导体材料）。"},"examples":[{"en":"Gallium antimonide is used to make infrared detectors.","zh":"锑化镓常用于制造红外探测器。"},{"en":"The lab analyzed antimonides to study their electrical properties.","zh":"实验室分析锑化物以研究其电学性质。"}]}],"synonyms":["antimonide","Sb compound (context-dependent)"],"phonetic":"/ænˈtɪməˌnaɪd/","extraExplanation":["“antimonid”在英文中更常见的标准拼写是 **antimonide**（锑化物）。在学术与工程文献里通常用 antimonide（如 *indium antimonide* 锑化铟、*gallium antimonide* 锑化镓）。","在化学命名里，后缀 **-ide** 常用于表示二元化合物或阴离子形式（如 oxide 氧化物、sulfide 硫化物），因此 antimonide 更符合常见构词规则。"]}
{"word":"antimonide","summary":{"en":"An antimonide is a compound that contains antimony combined with another element, often discussed in inorganic chemistry and semiconductor materials.","zh":"antimonide 指“锑化物”，即含锑并与其他元素结合的化合物，常见于无机化学与半导体材料语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound in which antimony (Sb) is combined with a more electropositive element (such as a metal), often containing antimony in a negative oxidation state (e.g., Sb³⁻).","zh":"锑化物：一种化合物，其中锑（Sb）与更电正的元素（如金属）结合，锑常呈负氧化态（如 Sb³⁻）。"},"examples":[{"en":"Indium antimonide (InSb) is used in infrared detectors.","zh":"锑化铟（InSb）用于红外探测器。"},{"en":"Some antimonides conduct electricity well and are studied as semiconductors.","zh":"一些锑化物导电性较好，被研究为半导体材料。"}]}],"synonyms":["antimony compound","antimonide ion (context-specific)"],"phonetic":"/ænˈtɪməˌnaɪd/","extraExplanation":["“antimonide”常见于材料科学与无机化学文献，尤其是半导体与热电材料领域（如 InSb、GaSb 等）。它不是日常用词，多在论文、教材、化学品名称或实验记录中出现。","词形上：antimony（锑）+ -ide（表示二元化合物或阴离子形式的后缀，如 chloride 氯化物、sulfide 硫化物）。因此看到“-ide”结尾，往往可以判断是“某某化物/某某阴离子相关”的化学术语。"]}
{"word":"antimonies","summary":{"en":"Antimonies is the plural of antimony, the chemical element Sb.","zh":"Antimonies 是 antimony 的复数，指化学元素“锑”（Sb）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical element (symbol Sb) used in alloys and some flame‑retardant materials; it is a shiny, brittle, gray metal-like substance.","zh":"锑（化学元素，符号 Sb），常用于合金及部分阻燃材料；呈银灰色、有光泽但易碎，类似金属。"},"examples":[{"en":"Antimony is sometimes added to lead to make the alloy harder.","zh":"锑有时会加入铅中，以使合金更坚硬。"},{"en":"The chemical symbol for antimony is Sb.","zh":"锑的化学符号是 Sb。"}]}],"synonyms":["Sb","stibium"],"phonetic":"ˈæn.təˌmoʊ.ni","extraExplanation":["“Antimonies”是“antimony”的复数形式；日常英语里更常见的是单数“antimony”，因为它多作为材料/元素名使用。","元素符号 Sb 来自拉丁语名称“stibium”。","锑及其化合物在工业与材料科学中较常见；部分锑化合物具有毒性，涉及安全或环境话题时常会被提及。"]}
{"word":"antimoniferous","summary":{"en":"Antimoniferous means “containing or producing antimony,” usually used in geology and mining.","zh":"antimoniferous 意为“含锑的/产锑的”，多用于地质与采矿语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing antimony, or producing antimony (said especially of ores or mineral deposits).","zh":"含锑的；产锑的（尤指矿石或矿床）。"},"examples":[{"en":"The report noted antimoniferous ores in the hillside mine.","zh":"报告指出山坡矿中有含锑矿石。"},{"en":"Workers mapped an antimoniferous vein running through the rock.","zh":"工人们绘制了穿过岩层的一条产锑矿脉。"}]}],"synonyms":["antimony-bearing","antimony-rich","containing antimony"],"phonetic":"/ˌæn.təˈmɑː.nə.fər.əs/","extraExplanation":["该词非常罕见，多见于地质学、采矿业或矿产报告等正式语境；日常英语更常说 “antimony-bearing” 或 “containing antimony”。","词形结构：anti(mon)y（锑）+ -ferous（“含有/产出……的”，来自拉丁语 ferre “携带”）。","发音提示：重音通常落在 “-mon-” 后的音节上，读起来像 “an-ti-MON-uh-fer-uhs”。"]}
{"word":"antimonioso","summary":{"en":"Antimonioso means “containing or related to antimony,” and is usually translated into English as “antimonial.”","zh":"antimonioso 指“含锑的/与锑有关的”，英文通常译作 antimonial。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Containing or relating to antimony; antimonial.","zh":"（化学）含锑的；与锑有关的；锑化的。"},"examples":[{"en":"The lab tested an antimonioso mineral sample for traces of antimony.","zh":"实验室检测了一份含锑的矿物样品，查看是否含有锑的痕量。"},{"en":"Antimonioso compounds must be handled with care because some antimony compounds are toxic.","zh":"含锑化合物需要小心处理，因为有些锑化合物具有毒性。"}]},{"partOfSpeech":"other","definition":{"en":"A term used mainly in Italian/Spanish scientific writing; in English, “antimonial” is more common.","zh":"主要见于意大利语/西班牙语的科学写作；英文中更常用“antimonial（含锑的）”。"},"examples":[{"en":"In the English version of the report, antimonioso was translated as antimonial.","zh":"在该报告的英文版本中，antimonioso 被译为 antimonial。"}]}],"synonyms":["antimonial","antimony-containing"],"phonetic":"/ˌæntɪməˈniːoʊsoʊ/","extraExplanation":["“antimonioso”并不是常见英文词，更像是意大利语/西班牙语中由“antimonio（锑）”构成的形容词，意思相当于英文的 antimonial。","锑（antimony, Sb）是一种化学元素；在材料、阻燃剂、合金等领域可能会提到“含锑/锑化”的描述。"]}
{"word":"antimonious","summary":{"en":"Antimonious means “containing or related to antimony,” mainly used in scientific contexts.","zh":"antimonious 指“含锑的/与锑有关的”，主要用于科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing or relating to antimony (Sb), a chemical element; used especially in chemistry and materials science.","zh":"含锑的；与锑（化学元素 Sb）有关的（多用于化学、材料等语境）。"},"examples":[{"en":"Some batteries use antimonious alloys to improve strength and durability.","zh":"一些电池会使用含锑合金来提高强度和耐用性。"},{"en":"The lab tested the sample for antimonious compounds.","zh":"实验室检测了样品中是否含有锑化合物。"}]}],"synonyms":["antimony-containing","antimonial"],"phonetic":"/ˌæn.təˈmoʊ.ni.əs/","extraExplanation":["“antimonious”来自“antimony（锑）”。在现代英语里它几乎只用于科技/学术语境，日常对话中更常见的说法是“containing antimony（含锑的）”或直接用名词“antimony”。","锑（Sb）常见于阻燃材料、合金（如增强硬度）、半导体等领域；在某些工业或环境话题中也会涉及其潜在毒性与限量标准。"]}
{"word":"antimonite","summary":{"en":"Antimonite is an antimony ore mineral, usually antimony trisulfide (Sb₂S₃), also known as stibnite.","zh":"Antimonite 指锑的矿石矿物，通常为三硫化二锑（Sb₂S₃），也叫 stibnite（辉锑矿）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mineral ore of antimony, mainly antimony trisulfide (Sb₂S₃), often found as gray to black crystals; also called stibnite.","zh":"辉锑矿；一种含锑的矿物矿石，主要成分为三硫化二锑（Sb₂S₃），常呈灰黑色晶体；也称 stibnite（辉锑矿）"},"examples":[{"en":"The mine’s main antimony ore was antimonite.","zh":"这座矿山的主要锑矿石是辉锑矿（antimonite）。"},{"en":"Antimonite can appear as shiny, needle-like crystals.","zh":"辉锑矿有时会呈现闪亮的针状晶体。"}]}],"synonyms":["stibnite","antimony ore"],"phonetic":"/ænˈtɪməˌnaɪt/","extraExplanation":["“antimonite”在矿物学里常与“stibnite”同义；日常英语中更常用“stibnite”来指辉锑矿。","锑（antimony）及其矿物曾用于合金、阻燃材料等工业领域；在现代语境中提到该矿物时，多与采矿、地质勘探或材料化学相关。"]}
{"word":"antimonium","summary":{"en":"Antimonium is an older Latin name for the element antimony.","zh":"Antimonium 是化学元素“锑（antimony）”的较旧拉丁名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Antimony; the Latin/older pharmaceutical and alchemical name for the chemical element antimony (symbol Sb).","zh":"锑；化学元素“锑”（符号 Sb）的拉丁文/较旧的药典与炼金术名称。"},"examples":[{"en":"In some old medical texts, antimonium appears as an ingredient in remedies.","zh":"在一些古老的医学文献中，antimonium 被写作某些药方的成分之一。"},{"en":"The label “Antimonium” is an older name for antimony.","zh":"“Antimonium” 是“锑（antimony）”的旧称。"}]}],"synonyms":["antimony","Sb (symbol)","stibium (Latin)"],"phonetic":"/ˌæn.təˈmoʊ.ni.əm/","extraExplanation":["“Antimonium”主要见于拉丁文、炼金术文献、以及旧式药典/处方中；现代英语日常与科学写作更常用 antimony。","元素符号 Sb 来自拉丁文 stibium，而不是 antimonium；因此你可能会在不同历史来源里看到多个相关的古称。"]}
{"word":"antimoniuret","summary":{"en":"A rare, old chemistry term for an antimony compound, especially an antimonide.","zh":"一个罕见的旧式化学术语，指锑的化合物，尤指锑化物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry, rare) A compound of antimony with another element; an older term roughly equivalent to an antimony compound, especially an antimonide.","zh":"（化学，较少用）锑与另一种元素形成的化合物；一种较旧的术语，大致相当于“锑的化合物”，尤指“锑化物（antimonide）”。"},"examples":[{"en":"The mineral was described in an older text as an antimoniuret of iron.","zh":"在一本文献较旧的书中，这种矿物被描述为“铁的锑化物（antimoniuret）”。"},{"en":"Modern papers usually replace the word antimoniuret with antimonide.","zh":"现代论文通常用 antimonide 来替代 antimoniuret 这个词。"}]}],"synonyms":["antimonide","antimony compound"],"phonetic":"/ænˌtɪməˈnjʊrɛt/","extraExplanation":["这是一个非常罕见、偏历史的化学用词，常见于19世纪或更早的矿物学/化学文献。现代英语里更常用 antimonide（锑化物）或直接说“antimony compound（锑的化合物）”。","词形中的 -uret 常见于旧式命名法（类似 sulfuret 之类的老写法），表达“与某元素形成化合物”的意思；因此 antimoniuret 可理解为“含锑的化合物/锑化物”。"]}
{"word":"antimoniureted","summary":{"en":"An archaic adjective meaning “containing or combined with antimony,” mainly found in older chemical terminology.","zh":"一个较古老的形容词，表示“含锑的/与锑结合的”，主要出现在旧式化学术语中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing or combined with antimony (an older chemistry term, often used in names of compounds).","zh":"含有锑或与锑结合的（较旧的化学用语，常见于旧式化合物名称中）。"},"examples":[{"en":"Older texts mention “antimoniureted hydrogen,” meaning a gas containing antimony.","zh":"旧教材里会写到“antimoniureted hydrogen”，意思是“含锑的氢气”（一种含锑的气体）。"},{"en":"The report described an antimoniureted compound formed during the reaction.","zh":"报告描述了反应过程中生成的一种“含锑化合物”。"}]}],"synonyms":["antimony-containing","antimonial (context-dependent)","stibine-related (specific contexts)"],"phonetic":"/ænˌtɪmoʊnjəˈrɛtɪd/","extraExplanation":["“antimoniureted / antimoniuretted”是19世纪及更早的化学命名风格，现代化学更常用“antimony- + 具体化学名”来表达，例如“stibine (SbH3)”常被称为旧式的“antimoniureted hydrogen”。","拼写上常见英式双写：antimoniuretted；你输入的“antimoniureted”属于同一词形的变体，但在当代英语中非常罕见，多见于历史文献、旧译本或古老实验记录。"]}
{"word":"antimoniuretted","summary":{"en":"An old chemistry adjective meaning “containing or combined with antimony,” often seen in older compound names.","zh":"旧式化学形容词，表示“含锑的/与锑化合的”，常见于早期化合物名称。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Old-fashioned chemistry) containing antimony; combined with antimony (especially used in names of chemical compounds).","zh":"（旧式化学用语）含锑的；与锑化合的（尤用于化合物名称中）。"},"examples":[{"en":"Older textbooks mention “antimoniuretted hydrogen,” which we now call stibine (SbH3).","zh":"较早的教材会写“antimoniuretted hydrogen（含锑氢）”，现代通常称为 stibine（锑化氢，SbH3）。"},{"en":"The lab note described an antimoniuretted compound produced during the reaction.","zh":"实验记录描述了反应过程中生成的一种含锑化合物。"}]}],"synonyms":["antimony-containing","antimonous (in some contexts)","antimonic (in some contexts)"],"phonetic":"/ˌæn.təˈmɪn.jəˌrɛtɪd/","extraExplanation":["“antimoniuretted”是19世纪到20世纪早期更常见的拼写与说法，意思接近“与锑形成化合物/被锑化”。现代化学写作通常改用更具体的名称（如 stibine 锑化氢、antimony-containing 含锑的、antimonide 锑化物等），因此这个词多见于旧文献或历史资料中。"]}
{"word":"antimonopolism","summary":{"en":"Antimonopolism is the belief in opposing monopolies and encouraging fair competition.","zh":"反垄断主义：主张反对垄断、鼓励公平竞争的理念。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to monopolies and support for laws or policies that promote competition in a market.","zh":"反对垄断、支持用法律或政策促进市场竞争的立场。"},"examples":[{"en":"Antimonopolism aims to prevent one company from controlling an entire industry.","zh":"反垄断主义旨在防止一家公司控制整个行业。"},{"en":"Her research focuses on antimonopolism in the tech sector.","zh":"她的研究聚焦于科技行业的反垄断主义。"}]}],"synonyms":["anti-monopoly","antitrust sentiment","pro-competition"],"phonetic":"/ˌæn.ti.məˈnɑp.əˌlɪ.zəm/","extraExplanation":["“antimonopolism”由 anti-（反对）+ monopoly（垄断）+ -ism（主义/主张）构成，常见于政治学、经济学与法律语境。","相关概念包括“反垄断法”（antitrust laws）。在美国语境中，常会提到《谢尔曼反托拉斯法》（Sherman Antitrust Act, 1890）等历史性立法，用来限制垄断与不公平竞争。","用法提示：这个词相对书面、学术；日常更常说“antitrust”或“anti-monopoly policies”。"]}
{"word":"antimonopolist","summary":{"en":"An antimonopolist is someone who opposes monopolies and favors market competition.","zh":"antimonopolist 指反对垄断、主张竞争的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who opposes monopolies (situations where one company controls a market) and supports competition and limits on monopoly power.","zh":"反对垄断者；主张限制垄断力量、支持市场竞争的人。"},"examples":[{"en":"As an antimonopolist, she argued that one company should not control the entire industry.","zh":"作为反垄断者，她认为不应由一家公司控制整个行业。"},{"en":"Many antimonopolists support stronger antitrust laws to protect consumers.","zh":"许多反垄断者支持更有力的反托拉斯法来保护消费者。"}]}],"synonyms":["anti-monopolist","trustbuster","antitrust advocate","competition advocate"],"phonetic":"/ˌænˌtaɪməˈnɑpəlɪst/","extraExplanation":["在美国语境中，antimonopolist 常与 “antitrust（反托拉斯）” 讨论连在一起，涉及政府如何通过法律与监管来防止企业滥用市场支配地位、操纵价格或排挤竞争对手。","历史上在19世纪末到20世纪初的“进步时代（Progressive Era）”，反对大型托拉斯（trusts）和垄断资本的声音很强，相关人物与媒体常可被称为 antimonopolists。"]}
{"word":"antimonopolistic","summary":{"en":"Antimonopolistic means “against monopolies,” supporting laws or actions that keep markets competitive.","zh":"antimonopolistic 指“反垄断的”，支持通过法律或措施维持市场竞争。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to monopolies; intended to prevent a single company (or a small group) from controlling a market and reducing competition.","zh":"反垄断的；旨在防止某家公司（或少数集团）控制市场、削弱竞争。"},"examples":[{"en":"The government introduced antimonopolistic laws to protect consumers and encourage fair competition.","zh":"政府推出反垄断法律，以保护消费者并促进公平竞争。"},{"en":"Critics argued that the merger would violate antimonopolistic regulations.","zh":"批评者认为这次合并将违反反垄断法规。"}]}],"synonyms":["antitrust","anti-monopoly","pro-competition","competitive"],"phonetic":"/ˌænˌtaɪməˌnɑpəˈlɪstɪk/","extraExplanation":["“antimonopolistic”常用于经济学、商业新闻与法律语境，尤其与“反垄断法（antitrust law）”相关。在美国语境中，常见说法是 antitrust（反垄断的），比 antimonopolistic 更常用。","构词法：anti-（反对）+ monopol-（垄断）+ -istic（……性质的/……相关的）。因此它强调“反对形成垄断、维持市场竞争”的立场或政策取向。"]}
{"word":"antimonopolization","summary":{"en":"Antimonopolization means actions or policies that prevent or weaken monopolies and encourage fair competition.","zh":"Antimonopolization 指防止或削弱垄断、促进公平竞争的行动或政策。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Efforts, policies, or actions intended to prevent or reduce monopolies and promote fair competition in a market.","zh":"旨在防止或削弱垄断、促进市场公平竞争的政策、措施或行动。"},"examples":[{"en":"The new regulations are part of the government’s antimonopolization program.","zh":"这些新规是政府反垄断计划的一部分。"},{"en":"Antimonopolization measures can include breaking up a dominant company or limiting unfair pricing.","zh":"反垄断措施可能包括拆分一家占主导地位的公司，或限制不公平定价。"}]},{"partOfSpeech":"n.","definition":{"en":"The process of making an industry or market less controlled by a single company, so that more competitors can enter and compete.","zh":"使某个行业或市场不再由单一公司控制、让更多竞争者进入并竞争的过程。"},"examples":[{"en":"After antimonopolization, smaller businesses found it easier to reach customers.","zh":"反垄断之后，小企业更容易接触到客户。"},{"en":"They debated whether antimonopolization would lead to lower prices or reduced innovation.","zh":"他们讨论反垄断是否会带来更低价格，还是会减少创新。"}]}],"synonyms":["antitrust","anti-monopoly policy","competition enforcement","market regulation","demonopolization"],"phonetic":"/ˌæn.ti.məˌnɑːn.ə.pə.laɪˈzeɪ.ʃən/","extraExplanation":["“antimonopolization”在日常英语里不算常见，更常用的说法是：\n- “antitrust” / “antitrust enforcement”（反垄断、反垄断执法）\n- “anti-monopoly regulation/law”（反垄断法规/法律）\n如果你在学术或政策语境中使用“antimonopolization”，建议搭配清晰的对象与措施，例如“antimonopolization policy/measures”。","相关文化/语境：美国常见用语是“antitrust”，与《谢尔曼法案》(Sherman Act)、《克莱顿法案》(Clayton Act) 等反垄断法律传统有关；欧盟则常说“competition law”（竞争法）与“abuse of dominance”（滥用市场支配地位）。"]}
{"word":"antimonopoly","summary":{"en":"Antimonopoly means opposing or preventing monopolies, often through laws and regulation to protect fair competition.","zh":"Antimonopoly 指“反垄断的/反垄断措施”，常通过法律与监管来防止垄断、保护公平竞争。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposing or aimed at preventing monopolies (a single company or group controlling a market), especially through laws and government action.","zh":"反垄断的；旨在防止或限制垄断（单一公司/集团控制市场）的，尤指通过法律与政府监管。"},"examples":[{"en":"The government introduced antimonopoly laws to promote fair competition.","zh":"政府出台反垄断法，以促进公平竞争。"},{"en":"The company is under investigation for possible antimonopoly violations.","zh":"该公司因可能违反反垄断规定而接受调查。"}]},{"partOfSpeech":"n.","definition":{"en":"A set of laws, policies, or actions intended to stop monopolies and protect competition.","zh":"反垄断法律、政策或措施；用来制止垄断、保护市场竞争的一整套规定或行动。"},"examples":[{"en":"Antimonopoly is a key part of modern market regulation.","zh":"反垄断是现代市场监管的重要组成部分。"},{"en":"Stronger antimonopoly can help smaller businesses compete.","zh":"更强的反垄断措施能帮助小企业参与竞争。"}]}],"synonyms":["antitrust","anti-monopoly","competition law (contextual)"],"phonetic":"/ˌæntiˌməˈnɑːpəli/","extraExplanation":["在美国语境里，常见相关词是 **antitrust（反托拉斯/反垄断）**，更常用于法律和新闻报道；而 **antimonopoly** 含义相近，但使用频率通常低一些。","反垄断并不一定反对“大公司”，重点是反对“滥用市场力量”（比如操纵价格、排挤竞争者、强制捆绑销售等）。"]}
{"word":"antimonous","summary":{"en":"Antimonous means “containing or relating to antimony.”","zh":"antimonous 指“含锑的；与锑有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing, made of, or relating to antimony (a chemical element, Sb).","zh":"含锑的；由锑构成的；与锑（化学元素 Sb）有关的。"},"examples":[{"en":"The lab stored antimonous compounds in clearly labeled containers.","zh":"实验室把含锑化合物放在贴有清晰标签的容器里保存。"},{"en":"Some older pigments and alloys may include antimonous materials.","zh":"一些较旧的颜料和合金可能含有锑相关材料。"},{"en":"The report compared antimonous residues with other metal contaminants.","zh":"报告把含锑残留物与其他金属污染物作了比较。"}]}],"synonyms":["antimony-containing","antimonial","antimonic (sometimes, depending on context)"],"phonetic":"/ænˈtɪməˌnoʊs/","extraExplanation":["“antimonous”是由“antimony（锑）+ -ous（表示‘含有……的/具有……性质的’）”构成的形容词，常见于化学、材料、环境检测等语境。","学习提示：不要把“antimonous”与“antimonious（反对一夫一妻制的）”混淆；两者拼写很像，但含义完全不同。","在化学命名中你也可能见到“antimonous”与“antimonic”对比：它们有时用来指不同价态的含锑化合物（具体依学科与语境而定）。"]}
{"word":"antimonsoon","summary":{"en":"Antimonsoon refers to winds or seasonal circulation opposite to the usual monsoon, often in the opposite season (commonly winter).","zh":"Antimonsoon 指与通常季风方向相反的风或季节性环流，常发生在相反季节（多为冬季）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of winds or seasonal airflow) blowing in the opposite direction to the usual monsoon, often occurring in the opposite season (commonly in winter).","zh":"（指风或季节性气流）与通常的季风方向相反的，常出现在相反的季节（多指冬季）。"},"examples":[{"en":"In parts of South Asia, the antimonsoon brings drier air and clearer skies.","zh":"在南亚的一些地区，反季风会带来更干燥的空气和更晴朗的天空。"},{"en":"Researchers compared summer monsoon rainfall with winter antimonsoon circulation patterns.","zh":"研究人员比较了夏季季风降雨与冬季反季风环流模式。"}]},{"partOfSpeech":"n.","definition":{"en":"An antimonsoon wind or season; the period or circulation pattern opposite to the monsoon.","zh":"反季风；与季风相反的风或季节（或相应的环流形势）。"},"examples":[{"en":"The region’s antimonsoon is usually linked to cooler temperatures and lower humidity.","zh":"该地区的反季风通常与更低的气温和更小的湿度有关。"},{"en":"Shipping routes were planned around the monsoon and the antimonsoon.","zh":"航线规划会考虑季风与反季风。"}]}],"synonyms":["reverse monsoon","winter monsoon (in some contexts)","counter-monsoon"],"phonetic":"/ˌæntiˈmɑnˌsun/","extraExplanation":["“antimonsoon”多见于气象/气候学语境，属于相对专业的用词。日常英语里更常说“winter monsoon（冬季季风）”“reverse monsoon（反向季风）”或直接描述“winds reverse in winter（冬季风向反转）”。","词缀拆解：anti- 表示“相反/对立”，monsoon 指“季风”。因此该词字面意思就是“与季风相反的（风/环流）”。"]}
{"word":"Antimony","summary":{"en":"Antimony (Sb) is a brittle, silvery-gray semimetal used in alloys, flame retardants, and electronics.","zh":"锑（Sb）是一种脆的银灰色类金属，用于合金、阻燃材料和电子等领域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A chemical element (symbol Sb) that is a brittle, silvery-gray semimetal, used in some alloys, flame retardants, and electronics.","zh":"锑（化学元素，符号 Sb）：一种脆的银灰色类金属，用于某些合金、阻燃剂和电子材料等。"},"examples":[{"en":"Antimony is often added to lead to make it harder for use in batteries.","zh":"锑常被加入铅中，使其更硬，用于电池等产品。"},{"en":"Some flame-retardant materials contain compounds of antimony.","zh":"一些阻燃材料含有锑的化合物。"}]}],"synonyms":["Sb","stibium"],"phonetic":"/ˈæn.təˌmoʊ.ni/","extraExplanation":["“antimony”的化学符号是 Sb，来自拉丁语名称 *stibium*（与古代用于化妆或眼线的“锑矿粉”有关）。因此你会看到拼写 antimony 但符号却是 Sb。","在日常英语里它主要出现在科学、材料、工业或环境健康相关语境中；一般对话里不常用。"]}
{"word":"antimony","summary":{"en":"Antimony is the chemical element Sb, a brittle silvery metalloid mainly used in alloys and industry; older medicinal uses are rare today due to toxicity.","zh":"锑是化学元素 Sb，一种银灰色易碎的类金属，主要用于合金和工业；过去的药用用途因毒性现已罕见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A chemical element (symbol Sb) that is a silvery-gray, brittle metalloid, used in alloys (especially to harden lead) and in some industrial materials.","zh":"锑（化学元素，符号 Sb）：一种银灰色、易碎的类金属，常用于合金（尤其用来使铅更坚硬）以及一些工业材料中。"},"examples":[{"en":"Antimony is added to lead to make it harder for use in batteries.","zh":"在铅中加入锑可以让铅更坚硬，用于电池等用途。"},{"en":"The chemical symbol for antimony is Sb.","zh":"锑的化学符号是 Sb。"}]},{"partOfSpeech":"n.","definition":{"en":"A substance made from antimony compounds, formerly used in medicine (now uncommon because of toxicity).","zh":"（旧时用法）含锑化合物的药物：过去曾用于医疗（因毒性而如今较少使用）。"},"examples":[{"en":"Historically, some antimony compounds were used as treatments, but they can be poisonous.","zh":"历史上某些含锑化合物曾被用作治疗，但它们可能有毒。"}]}],"synonyms":["Sb","stibium"],"phonetic":"/ˈæn.təˌmoʊ.ni/","extraExplanation":["“antimony”的元素符号 Sb 来自拉丁语名称 *stibium*（与古代用于化妆或药用的“锑矿粉”有关），所以符号看起来不像英文拼写。"]}
{"word":"antimony-based","summary":{"en":"“Antimony-based” describes something that is made with or contains antimony as an important component.","zh":"“antimony-based”表示某物以锑为重要成分或含有锑。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"made from, containing, or using antimony (Sb) as a key ingredient","zh":"以锑（Sb）为主要成分、含锑的，或以锑为基础制成的"},"examples":[{"en":"Researchers tested an antimony-based catalyst for cleaner chemical reactions.","zh":"研究人员测试了一种以锑为基础的催化剂，以实现更清洁的化学反应。"},{"en":"The factory switched to antimony-based alloys to improve hardness.","zh":"工厂改用含锑合金来提高硬度。"},{"en":"Some older products used antimony-based compounds as flame retardants.","zh":"一些较旧的产品曾使用含锑化合物作为阻燃剂。"}]}],"synonyms":["antimony-containing","antimonial"],"phonetic":"/ˈæn.təˌmoʊ.ni beɪst/","extraExplanation":["“antimony-based”常见于化学、材料科学与工业语境：如含锑合金（提高硬度/耐磨性）、含锑催化剂、半导体材料（如锑化物），以及部分阻燃体系。","锑及其化合物在职业与环境安全上可能有毒性风险；阅读文献或产品说明时，常会同时出现“exposure/handling precautions（暴露/操作注意事项）”。"]}
{"word":"antimony-bearing","summary":{"en":"Antimony-bearing describes something (especially rock or ore) that contains antimony.","zh":"antimony-bearing 指（尤指矿石或岩石）“含锑的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing antimony (Sb), usually in a mineral, ore, or rock.","zh":"含有锑（Sb）的；通常指矿物、矿石或岩石中含锑。"},"examples":[{"en":"The survey identified antimony-bearing veins near the old mine.","zh":"调查发现旧矿附近有含锑矿脉。"},{"en":"Workers separated antimony-bearing ore from the waste rock.","zh":"工人把含锑矿石与废石分开。"}]}],"synonyms":["antimony-containing","Sb-bearing","antimoniferous"],"phonetic":"/ˈæn.təˌmoʊ.ni ˌbɛrɪŋ/","extraExplanation":["“antimony-bearing”常见于地质、采矿与冶金语境，是由“antimony（锑）+ bearing（含有……的）”构成的复合形容词。这里的 bearing 表示“含有/携带”，类似的结构还有 gold-bearing（含金的）、copper-bearing（含铜的）。","锑在自然界常与硫化物矿物共生，例如辉锑矿（stibnite, Sb2S3）。在技术文本中，antimony-bearing 往往暗示该岩石/矿石具有可被分析、选矿或冶炼的锑含量。","安全与环境语境中也可能出现该词：含锑物质的粉尘或尾矿处理需遵守相关职业健康与污染控制要求。"]}
{"word":"antimony-containing","summary":{"en":"“Antimony-containing” describes something that has antimony (Sb) in it.","zh":"“Antimony-containing”指“含锑（Sb）的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a material, substance, or product) containing antimony (Sb), a chemical element, as an ingredient, impurity, or component.","zh":"（指材料、物质或产品）含有锑（Sb）这一化学元素，作为成分、杂质或组成部分。"},"examples":[{"en":"The lab flagged the sample as antimony-containing and stored it separately.","zh":"实验室将该样品标记为“含锑”，并单独存放。"},{"en":"Some older alloys and flame retardants can be antimony-containing.","zh":"一些较旧的合金和阻燃剂可能含锑。"}]}],"synonyms":["Sb-containing","containing antimony","antimony-bearing"],"phonetic":"/ˈæn.təˌmoʊ.ni kənˈteɪ.nɪŋ/","extraExplanation":["“antimony-containing”是由名词 antimony（锑）+ 现在分词/形容词 containing（含有……的）构成的复合形容词，常见于科研、材料、环保与法规文件中，用来描述“含锑”的性质。","锑的元素符号是 Sb（来自拉丁语 stibium），因此在说明书或检测报告中也可能看到“Sb含量/ Sb concentration”等表述。","在实际语境里，它常与“alloy（合金）”“glass（玻璃）”“catalyst（催化剂）”“flame retardant（阻燃剂）”“waste/wastewater（废弃物/废水）”“emissions（排放）”等词搭配出现。"]}
{"word":"antimony-related","summary":{"en":"“Antimony-related” means connected with or involving antimony (Sb), especially in technical contexts.","zh":"“antimony-related”意为“与锑（Sb）有关的/涉及锑的”，多用于技术或学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with, involving, or caused by antimony (Sb), a chemical element, especially in science, industry, or health contexts.","zh":"与锑（化学元素 Sb）有关的；涉及锑的（常用于科研、工业或健康语境）。"},"examples":[{"en":"The lab is studying antimony-related contamination in local soil.","zh":"实验室正在研究当地土壤中与锑有关的污染。"},{"en":"Workers must follow safety rules for antimony-related processes.","zh":"工人必须遵守涉及锑的工艺的安全规定。"},{"en":"The doctor asked about possible antimony-related exposure at work.","zh":"医生询问了是否在工作中可能接触到与锑有关的物质。"}]}],"synonyms":["antimony-associated","antimony-linked","Sb-related"],"phonetic":"/ˈæn.təˌmoʊ.ni rɪˈleɪ.tɪd/","extraExplanation":["“antimony-related”是由名词 antimony + related 组成的复合形容词，常见于学术或技术写作中，用来笼统表示“与锑有关的”，不一定说明具体是哪一种锑化合物或具体机制。","锑常出现在阻燃材料、合金、半导体等领域；在环境与职业健康文本中，“antimony-related”也可能指与锑或其化合物相关的暴露、风险或检测结果。具体含义通常要结合上下文（如 antimony-related dust / toxicity / emissions）。"]}
{"word":"antimony-rich","summary":{"en":"Antimony-rich means “containing a lot of antimony.”","zh":"antimony-rich 指“含锑量高、富含锑的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing a large amount of antimony (Sb) compared with other materials; high in antimony.","zh":"含有较高比例的锑（化学符号 Sb）；富含锑的。"},"examples":[{"en":"The lab identified antimony-rich particles in the dust sample.","zh":"实验室在灰尘样本中鉴定出了富含锑的颗粒。"},{"en":"Antimony-rich alloys are sometimes used to make lead harder.","zh":"富含锑的合金有时用于让铅更坚硬。"},{"en":"The mine produces antimony-rich ore that must be handled carefully.","zh":"该矿生产富含锑的矿石，必须谨慎处理。"}]}],"synonyms":["antimony-bearing","high-antimony","Sb-rich"],"phonetic":"/ˈæn.təˌmoʊ.ni rɪtʃ/","extraExplanation":["“antimony-rich”常见于矿业、材料科学与环境检测等语境，意思不是“营养丰富”，而是“某种成分含量高”。英语里常用“X-rich”表示“富含X”，如 iron-rich（富铁的）、oxygen-rich（富氧的）。","锑是一种化学元素（Sb），在一些合金、阻燃材料与某些工业过程中会出现；在环境与职业健康语境中也可能涉及暴露与安全管理（具体风险取决于化学形态与浓度）。"]}
{"word":"antimonyl","summary":{"en":"Antimony (Sb) is a brittle, silvery-gray chemical element used mainly in alloys and some industrial materials.","zh":"Antimony（Sb，锑）是一种脆的银灰色化学元素，主要用于合金及一些工业材料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical element (symbol Sb) that is a brittle, silvery-gray metalloid, used in alloys and in some flame-retardant and semiconductor materials","zh":"化学元素“锑”（符号 Sb），一种脆的银灰色类金属，常用于合金，以及部分阻燃材料与半导体材料中"},"examples":[{"en":"Antimony is often added to lead to make it harder for batteries and other products.","zh":"锑常被加入铅中以提高硬度，用于电池等产品。"},{"en":"The element antimony has the chemical symbol Sb.","zh":"锑的化学符号是 Sb。"}]},{"partOfSpeech":"n.","definition":{"en":"a substance containing antimony, especially in industrial or chemical contexts (less common)","zh":"含锑的物质（尤指工业或化学语境中；较不常用）"},"examples":[{"en":"Some older industrial processes used antimony compounds as additives.","zh":"一些较早的工业流程会使用锑化合物作为添加剂。"}]}],"synonyms":["Sb","stibium"],"phonetic":"/ˈæn.təˌmoʊ.ni/","extraExplanation":["你输入的“antimonyl”更常见是拼写错误；通常要找的词是 **antimony（锑）**。","**Sb** 来自拉丁语 *stibium*（锑的旧称），所以缩写看起来和英文单词 antimony 不一致。"]}
{"word":"antimoral","summary":{"en":"Antimoral means opposed to moral principles or hostile to accepted morality.","zh":"antimoral 指“反道德的”，强调反对或挑战公认的道德原则。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to moral principles; rejecting or attacking what is considered morally right.","zh":"反道德的；反对或否定被认为是“道德正确”的原则。"},"examples":[{"en":"Some critics call the novel antimoral because it refuses to reward “good” characters and punish “bad” ones.","zh":"有些评论家称这部小说“反道德”，因为它拒绝用“奖善罚恶”的方式来安排结局。"},{"en":"He argued that the policy is antimoral because it treats people as tools rather than as human beings.","zh":"他认为这项政策是反道德的，因为它把人当作工具而不是当作人。"}]}],"synonyms":["immoral","amoral","unethical","against morality","anti-ethical"],"phonetic":"/ˌæntiˈmɔrəl/","extraExplanation":["“antimoral”在现代英语里不算常见，更常用的是“immoral（不道德的）”或“amoral（不以道德评判的/与道德无关的）”。三者区别：immoral=违背道德；amoral=不考虑道德（不一定坏）；antimoral=立场上反对道德规范或反道德观念，语气更像“对道德本身的挑战/敌对”。","构词：anti-（反对）+ moral（道德的）。在文学批评、哲学或社会评论里偶尔出现，用来强调“对主流道德框架的反抗”而不仅是“做了坏事”。"]}
{"word":"antimoralism","summary":{"en":"Antimoralism means opposition to moralism—rejecting moral preaching or judging everything mainly by moral standards.","zh":"Antimoralism 指“反道德主义”：反对道德说教或把一切主要按道德标准来评判的做法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to moralism, especially the habit of judging people, art, or behavior by strict moral standards.","zh":"反道德主义：反对“道德主义”（用严格道德标准评判他人、艺术或行为）的倾向。"},"examples":[{"en":"His essay defends antimoralism in art criticism, arguing that a novel should not be judged only by its moral message.","zh":"他的文章为艺术批评中的反道德主义辩护，认为小说不应只按道德教训来评判。"},{"en":"Some comedians embrace antimoralism to push back against constant moral policing of jokes.","zh":"一些喜剧演员采取反道德主义立场，以反击对笑话持续不断的道德审查。"}]},{"partOfSpeech":"n.","definition":{"en":"A viewpoint (in philosophy or cultural debate) that rejects the idea that morality should be the main guide or ultimate authority in all areas of life.","zh":"（哲学/文化讨论中）一种立场：反对把道德当作所有领域的主要指南或最高权威。"},"examples":[{"en":"In that debate, antimoralism is presented as a way to separate ethics from social shaming.","zh":"在那场辩论中，反道德主义被视为把伦理与社会羞辱区分开的一种方式。"},{"en":"Her antimoralism does not deny right and wrong; it challenges moral preaching as a style of argument.","zh":"她的反道德主义并不否认是非，而是质疑道德说教式的论证方式。"}]}],"synonyms":["anti-moralism","anti-moralist stance","opposition to moralism","anti-moralizing"],"phonetic":"/ˌæntiˈmɔrəlɪzəm/","extraExplanation":["“antimoralism”通常出现在哲学、文艺批评或文化战争语境中，和“amorality（无道德/不涉道德）”不同：反道德主义不是没有道德，而是反对“道德化”的评判方式（moralizing、moral policing）。","构词：anti-（反对）+ moralism（道德主义/道德说教倾向）。在英文写作中常与“moralism / moralizing / moral panic”对比使用。"]}
{"word":"antimoralist","summary":{"en":"An antimoralist rejects moral principles or opposes moralistic judgment, especially in art and criticism.","zh":"antimoralist 指反道德主义者/反对道德化评判的人，常用于文学、艺术与批评语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who rejects moral principles or opposes “moralism” (the idea that art, behavior, or society should be judged mainly by moral standards)","zh":"反道德主义者；反对以道德标准评判一切（“道德说教/道德主义”）的人"},"examples":[{"en":"Some critics call him an antimoralist because he refuses to judge characters as simply “good” or “bad.”","zh":"一些评论家称他为反道德主义者，因为他拒绝把角色简单地分成“好人”和“坏人”。"},{"en":"In debates about censorship, an antimoralist may argue that art does not need to teach moral lessons.","zh":"在关于审查制度的辩论中，反道德主义者可能会主张艺术不必承担道德教化的任务。"}]},{"partOfSpeech":"adj.","definition":{"en":"rejecting or opposing moral rules or moralistic judgment","zh":"反道德主义的；反对道德规范或道德化评判的"},"examples":[{"en":"His antimoralist stance shocked some readers, but others found it honest.","zh":"他的反道德主义立场让一些读者震惊，但也有人觉得这很诚实。"},{"en":"The novel’s antimoralist tone focuses on desire and choice rather than lessons about virtue.","zh":"这部小说的反道德主义语气更关注欲望与选择，而不是宣扬美德的“教训”。"}]}],"synonyms":["amoralist","anti-moralist","immoralist","anti-moral","anti-moralistic"],"phonetic":"/ˌæntiˈmɔrəlɪst/","extraExplanation":["“anti-”表示“反对”，moralist 指“道德主义者/爱讲道德的人”。因此 antimoralist 常见于文学批评、艺术讨论或哲学语境，强调反对用道德去主导评价（例如评价小说、电影、社会现象）。","注意：antimoralist 不一定等于“没有道德的人”。很多时候它更接近“反对道德说教/反对用单一道德标准评判一切”。"]}
{"word":"antimoralistic","summary":{"en":"Antimoralistic means “not moralizing” or “against moral preaching/judgment,” especially in art or criticism.","zh":"antimoralistic 指“反道德说教/不灌输道德评判”，常用于文学、电影与评论语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to moralism—the habit of judging art, behavior, or ideas mainly by strict moral rules or preaching about what is “right.”","zh":"反道德说教的；反对“道德主义/道德说教”（即用严格的道德标准去评判艺术、行为或思想，或喜欢宣讲何为“正确”）。"},"examples":[{"en":"The director’s antimoralistic approach avoids preaching and lets the audience decide.","zh":"这位导演的反道德说教式手法避免灌输观点，让观众自己判断。"},{"en":"Some readers like the novel because it feels antimoralistic and honest.","zh":"有些读者喜欢这部小说，因为它反道德说教，显得更真实坦诚。"}]}],"synonyms":["non-moralizing","anti-preachy","nonjudgmental","anti-didactic"],"phonetic":"/ˌæntiˌmɔˈrælɪstɪk/","extraExplanation":["“antimoralistic”常用于谈论文学、电影、艺术批评或思想写作，意思不是“反对道德/不道德”，而是反对把作品或讨论变成居高临下的“道德教训”。","近义词常见有：non-moralizing（不说教的）、anti-preachy（反说教的）、nonjudgmental（不轻易评判的）；反义倾向可说 moralistic（道德说教的）、preachy（爱说教的）。"]}
{"word":"antimorality","summary":{"en":"Antimorality means opposition to or rejection of moral rules and values.","zh":"Antimorality 指对道德规则与价值的反对或否定。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to, or rejection of, traditional moral rules or moral values; a stance that argues morality is unnecessary, invalid, or should be resisted.","zh":"反道德；对传统道德规则或道德价值的反对或否定；一种主张道德不必要、无效或应被抵制的立场。"},"examples":[{"en":"Some critics accused the novel of promoting antimorality because its characters never face moral consequences.","zh":"一些评论家指责这部小说宣扬反道德，因为角色从不为自己的行为承担道德后果。"},{"en":"In online debates, antimorality is sometimes used to describe a rejection of “right and wrong” language altogether.","zh":"在网络辩论中，“反道德”有时用来形容对“对与错”这套语言的全面拒绝。"}]}],"synonyms":["anti-morality","rejection of morality","moral nihilism","anti-ethical stance"],"phonetic":"/ˌænti məˈræləti/","extraExplanation":["“antimorality”不是常见日常词，更常见的相关词是：immorality（不道德：做了被认为“错误”的事）、amoral（无道德/不以道德为考量：不从道德角度判断）、moral relativism（道德相对主义：认为道德标准因文化或情境而异）。\n\n“antimorality”通常用于批评或思想讨论（例如文学批评、哲学或文化评论），语气往往较强，暗示“主动反对/挑战道德体系”，而不仅仅是“行为不端”。"]}
{"word":"antimosquito","summary":{"en":"Antimosquito means “anti-mosquito”: used to repel or protect against mosquitoes, or a product that does so.","zh":"antimosquito 意为“防蚊/驱蚊的”，也可指防蚊用品。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"designed to prevent, repel, or protect against mosquitoes.","zh":"用于防蚊、驱蚊或防止蚊子叮咬的。"},"examples":[{"en":"We bought an antimosquito spray for our camping trip.","zh":"我们为露营买了防蚊喷雾。"},{"en":"Use an antimosquito net over the bed at night.","zh":"晚上在床上方用防蚊蚊帐。"}]},{"partOfSpeech":"n.","definition":{"en":"a product used to repel or kill mosquitoes (such as spray, coil, or lotion).","zh":"防蚊/驱蚊用品（如喷雾、蚊香或驱蚊乳液）。"},"examples":[{"en":"Pack some antimosquito if you’re going to the lakeside.","zh":"如果要去湖边，带点防蚊用品。"},{"en":"This antimosquito works for about six hours.","zh":"这种驱蚊用品大约能管六小时。"}]}],"synonyms":["anti-mosquito","mosquito-repellent","bug-repellent","insect repellent"],"phonetic":"/ˌæn.ti.məˈskiː.toʊ/","extraExplanation":["拼写上更常见的是带连字符的形式：anti-mosquito（也可写作 anti mosquito）。在说明书、商品包装或正式写作中，用 anti-mosquito 更清晰。","词根提示：anti- 表示“反对/防止”，mosquito 表示“蚊子”，合起来就是“防蚊的”。"]}
{"word":"antimuscarinic","summary":{"en":"Antimuscarinic means blocking muscarinic receptors; it also refers to drugs that do this.","zh":"antimuscarinic 指“抗毒蕈碱的（阻断M受体）”，也可指“抗毒蕈碱药物”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medicine) Blocking the action of acetylcholine at muscarinic receptors (often used to reduce spasms, nausea, overactive bladder symptoms, or Parkinson’s tremor).","zh":"（医学）抗毒蕈碱的；阻断乙酰胆碱在毒蕈碱型受体（M受体）上的作用（常用于缓解痉挛、恶心、膀胱过度活动症状或帕金森震颤等）。"},"examples":[{"en":"This medication has antimuscarinic effects, so it may cause dry mouth.","zh":"这种药有抗毒蕈碱作用，所以可能会引起口干。"},{"en":"Antimuscarinic drugs are often used to treat overactive bladder.","zh":"抗毒蕈碱药物常用于治疗膀胱过度活动。"}]},{"partOfSpeech":"n.","definition":{"en":"An antimuscarinic drug or substance.","zh":"抗毒蕈碱药物；抗毒蕈碱物质。"},"examples":[{"en":"The doctor prescribed an antimuscarinic to reduce bladder urgency.","zh":"医生开了一种抗毒蕈碱药来减轻尿急。"},{"en":"Some antihistamines also act as antimuscarinics.","zh":"一些抗组胺药也具有抗毒蕈碱作用。"}]}],"synonyms":["anticholinergic","muscarinic antagonist"],"phonetic":"/ˌæn.tiˌmʌs.kəˈrɪn.ɪk/","extraExplanation":["“Muscarinic（毒蕈碱型）受体”是副交感神经系统的重要受体之一；antimuscarinic（抗毒蕈碱）药通过阻断这些受体来减少“分泌、收缩、慢心率”等副交感效应。","常见不良反应可用口诀帮助记忆：口干（dry mouth）、便秘（constipation）、视物模糊（blurred vision）、尿潴留（urinary retention）、嗜睡或意识混乱（尤其老年人）。","常见相关药物类别/例子：治疗膀胱过度活动的药（如 oxybutynin）、治疗晕动病的 scopolamine、一些抗抑郁药/抗精神病药也可能带有抗毒蕈碱副作用。"]}
{"word":"antimusical","summary":{"en":"Antimusical means either “against music” or “not musical/pleasant to hear.”","zh":"antimusical 指“反对音乐的”，也可指“缺乏音乐性、听起来不悦耳的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to music or musical performance; not supportive of music.","zh":"反对音乐或音乐表演的；不支持音乐的。"},"examples":[{"en":"Some leaders once viewed certain styles of music as antimusical and tried to ban them.","zh":"一些领导人曾把某些音乐风格视为反音乐的，并试图禁止它们。"},{"en":"He came from an antimusical family, so he had to practice quietly.","zh":"他来自一个反音乐的家庭，所以只能悄悄练习。"}]},{"partOfSpeech":"adj.","definition":{"en":"Lacking musical qualities (such as pleasant rhythm or sound); harsh or unpleasant to hear.","zh":"缺乏音乐性（如悦耳的节奏或音色）的；刺耳难听的。"},"examples":[{"en":"The old machine made an antimusical screech every time it started.","zh":"那台旧机器每次启动都会发出一种毫无音乐性的刺耳尖叫。"},{"en":"Critics called the soundtrack antimusical, but others liked its rough energy.","zh":"评论家说这段配乐“反音乐、缺乏音乐性”，但也有人喜欢它粗粝的力量感。"}]}],"synonyms":["unmusical","against music","anti-music","harsh-sounding","discordant"],"phonetic":"ˌæntiˈmjuːzɪkəl","extraExplanation":["“anti-”是常见前缀，表示“反对、对立”。因此 antimusical 通常用于评论或写作中，强调“反对音乐”或“缺乏音乐性”。它不是特别常用的日常词，更常见的替代说法有 unmusical（不悦耳的/缺乏音乐性）或 anti-music（反音乐的观念/立场）。","在文学或评论语境里，antimusical 有时带有价值判断：不仅指“声音不好听”，还暗示“违背传统审美的音乐观”，例如讨论前卫音乐、噪音艺术或对某类音乐的文化抵制时。"]}
{"word":"antimusically","summary":{"en":"“Antimusically” means “in an unmusical or anti-music way.”","zh":"antimusically 指“以不合音乐性或反音乐的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that goes against music or musical qualities; unmusically or in a manner hostile to music.","zh":"以一种违背音乐性、缺乏音乐感或反音乐的方式；不合音乐地。"},"examples":[{"en":"The critics said the soundtrack was arranged antimusically, making the scenes feel awkward.","zh":"评论家说配乐的编排很不合音乐性，让场景显得尴尬。"},{"en":"He spoke antimusically—flat, rushed, and with no sense of rhythm.","zh":"他说话很不合音乐性——语调平、语速快，而且毫无节奏感。"}]}],"synonyms":["unmusically","inaudibly (in some contexts)","without rhythm","in an unmusical way"],"phonetic":"ˌæntiˈmjuːzɪkli","extraExplanation":["这个词非常少见，多用于评论写作或较正式的语境。更常见的表达是 unmusically（不合音乐地）或 in an unmusical way（以不合音乐的方式）。","构词：anti-（反、对抗）+ musical（音乐的）+ -ly（副词后缀），强调“反音乐/违背音乐性”的态度或效果。"]}
{"word":"antimusicalness","summary":{"en":"“Antimusicalness” means the quality of being anti-musical or unmusical.","zh":"“Antimusicalness”指“反音乐性”或“缺乏音乐感”的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being against music or lacking musical feeling; being unmusical","zh":"反音乐性；不具音乐感（对音乐缺乏兴趣、理解或表现力的特质）"},"examples":[{"en":"Some critics complained about the show’s antimusicalness, saying the songs felt forced.","zh":"一些评论家抱怨这部剧“反音乐性”很强，说歌曲显得很生硬。"},{"en":"He joked about his antimusicalness when he couldn’t keep the beat in class.","zh":"当他在课上怎么也跟不上节拍时，他开玩笑说自己“太不懂音乐了”。"}]}],"synonyms":["unmusicalness","lack of musicality","anti-musical attitude"],"phonetic":"/ˌæn.tiˈmjuː.zɪ.kəl.nəs/","extraExplanation":["这个词非常少见，多见于非正式或幽默/评论性的语境。它由 anti-（反、对抗）+ musical（音乐的）+ -ness（名词后缀，表示“……的性质/状态”）构成。日常表达里更常用 unmusicalness（不具音乐感）或 say someone is unmusical / not musical（不太有音乐细胞）。"]}
{"word":"antimutagen","summary":{"en":"An antimutagen is a substance (or effect) that helps prevent or reduce DNA mutations.","zh":"antimutagen 指能预防或减少DNA突变的物质（或作用）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance that reduces the rate of genetic mutations (changes in DNA), often by preventing DNA damage or helping cells repair it","zh":"抗诱变剂；一种能降低基因突变（DNA变化）发生率的物质，常通过减少DNA损伤或帮助细胞修复来发挥作用"},"examples":[{"en":"Some plant compounds have been studied as antimutagens in laboratory tests.","zh":"一些植物化合物在实验室测试中被研究为抗诱变剂。"},{"en":"Researchers tested whether the antioxidant could act as an antimutagen against UV damage.","zh":"研究人员测试这种抗氧化剂是否能作为抗诱变剂来对抗紫外线损伤。"}]},{"partOfSpeech":"adj.","definition":{"en":"having the effect of reducing genetic mutations","zh":"具有抗诱变作用的；能降低突变发生的"},"examples":[{"en":"The team reported an antimutagen effect in treated cells.","zh":"研究团队报告称在处理过的细胞中观察到了抗诱变效应。"}]}],"synonyms":["mutation inhibitor","antimutagenic agent","protective agent (in genetics/toxicology)"],"phonetic":"/ˌæn.tiˈmjuː.tə.dʒən/","extraExplanation":["“antimutagen”多见于生物学、毒理学与营养学文献，常用于讨论某种化学物质/食物成分是否能降低诱变物（mutagen）导致的DNA损伤与突变风险。","注意：抗诱变（antimutagenic）不等于“抗癌”。降低突变可能有助于降低某些风险，但是否能转化为临床上的癌症预防，需要更严格的人体证据。"]}
{"word":"antimycotic","summary":{"en":"Antimycotic means “anti-fungal”: something that kills fungi or stops their growth; it can also be the noun for such a drug.","zh":"antimycotic 意为“抗真菌的/抗霉菌的”；也可作名词指抗真菌药物或制剂。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"A medicine or substance that kills fungi or stops them from growing, used to treat fungal infections (such as athlete’s foot or yeast infections).","zh":"抗真菌药；抗霉菌药：用于杀死真菌或抑制其生长、治疗真菌感染（如脚气或念珠菌感染）的药物或物质。"},"examples":[{"en":"The doctor prescribed an antimycotic cream for the rash.","zh":"医生开了一种抗真菌乳膏来治疗皮疹。"},{"en":"Athlete’s foot often improves with an over-the-counter antimycotic medication.","zh":"脚气通常使用非处方抗真菌药就会好转。"}]},{"partOfSpeech":"n.","definition":{"en":"An antimycotic drug or agent.","zh":"抗真菌药物；抗真菌制剂。"},"examples":[{"en":"This antimycotic is taken once a day for two weeks.","zh":"这种抗真菌药每天服用一次，连续两周。"},{"en":"Ask a pharmacist which antimycotic is best for your symptoms.","zh":"可以问药剂师哪种抗真菌药最适合你的症状。"}]}],"synonyms":["antifungal","fungicidal","fungistatic"],"phonetic":"/ˌæn.ti.maɪˈkɑː.tɪk/","extraExplanation":["词源提示：anti- 表示“反、抗”，myc- 来自希腊语“真菌”（mykēs），-otic 表示“与……有关的”。合起来就是“抗真菌的”。","使用语境：这是偏医学/药学的词，日常更常说 antifungal（抗真菌的）。在说明书或医生处方中常见 antimycotic。","学习区分：antimycotic/antifungal 主要针对真菌；不是抗细菌（antibacterial）也不是抗病毒（antiviral）。若症状不确定，最好由医生判断。"]}
{"word":"antimystic","summary":{"en":"Antimystic describes someone or something opposed to mysticism; it can also mean a person who rejects mystical beliefs.","zh":"antimystic 指反对神秘主义的（形容词），也可指反神秘主义者（名词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to mysticism or mystical beliefs; emphasizing rational, practical, or non-spiritual explanations.","zh":"反神秘主义的；反对神秘信仰的；强调理性、务实或非灵性解释的。"},"examples":[{"en":"His antimystic approach focused on evidence rather than spiritual experiences.","zh":"他采取反神秘主义的方式，更重视证据而不是灵性体验。"},{"en":"The book presents an antimystic view of religion, treating it mainly as a social phenomenon.","zh":"这本书以反神秘主义的视角看待宗教，主要把它当作一种社会现象。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who rejects or argues against mysticism or mystical practices.","zh":"反神秘主义者；反对神秘主义或神秘修行的人。"},"examples":[{"en":"As an antimystic, she was skeptical of claims about secret powers and visions.","zh":"作为反神秘主义者，她对“隐秘力量”和“神启异象”的说法持怀疑态度。"},{"en":"Some antimystics criticize mystical language as too vague to be meaningful.","zh":"一些反神秘主义者批评神秘主义语言过于含糊，缺乏明确意义。"}]}],"synonyms":["anti-mystical","skeptical","rationalist","anti-spiritual (context-dependent)"],"phonetic":"ˌæntiˈmɪstɪk","extraExplanation":["“antimystic”在日常英语中不算常见，更常见的表达有“anti-mystical”“anti-mysticism”“skeptical of mysticism”。写作时有时会加连字符（anti-mystic），尤其在学术或评论语境中。","语境上它常出现在宗教研究、哲学、文学评论中，用来描述一种反对“神秘体验/超自然解释”的立场，并不一定等同于“反宗教”。"]}
{"word":"antimystical","summary":{"en":"Antimystical means opposed to mysticism and skeptical of mysterious or spiritual explanations.","zh":"antimystical 指“反神秘主义的”，不接受以神秘或灵性奥秘来解释事物的观点。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to mystical beliefs or practices; rejecting ideas that rely on spiritual mystery rather than reason or evidence.","zh":"反神秘主义的；反对神秘信仰或实践的；倾向于用理性与证据否定“神秘体验/奥秘解释”的。"},"examples":[{"en":"His antimystical approach to religion focused on ethics instead of miracles.","zh":"他对宗教采取反神秘主义的态度，把重点放在伦理而不是神迹上。"},{"en":"The book offers an antimystical reading of the poems, emphasizing history and language.","zh":"这本书以反神秘主义的方式解读这些诗，强调历史背景与语言本身。"},{"en":"She is antimystical in science discussions and asks for clear proof.","zh":"在科学讨论中她反神秘主义，总是要求清晰的证据。"}]}],"synonyms":["anti-mystical","skeptical of mysticism","anti-occult","rationalist"],"phonetic":"/ˌæn.tiˈmɪs.tɪ.kəl/","extraExplanation":["“anti-”表示“反对/抵制”，加在“mystical（神秘主义的）”前构成“antimystical”。常见于宗教研究、哲学、文学批评等语境，表示不接受以神秘体验、玄学或超自然解释为核心的观点。","它通常是书面语或学术语感较强的词；日常口语更常说“not mystical”“skeptical of mysticism（对神秘主义持怀疑态度）”。注意它不一定等同于“atheist（无神论的）”，而是强调反对“神秘化的解释方式”。"]}
{"word":"antimystically","summary":{"en":"An uncommon adverb meaning “in a way that rejects or opposes mystical explanations.”","zh":"不常见的副词，意为“以反对或否定神秘主义式解释的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that rejects or opposes mystical beliefs, mystical interpretation, or spiritual “mystery” as an explanation","zh":"以反神秘主义的方式；以否定或反对神秘信仰、神秘解读或用“灵性奥秘”来解释事物的方式"},"examples":[{"en":"The author reads the poem antimystically, focusing on history and politics instead of hidden spiritual meanings.","zh":"作者以反神秘主义的方式解读这首诗，把重点放在历史和政治上，而不是隐藏的灵性含义。"},{"en":"She spoke antimystically about the ritual, treating it as a cultural tradition rather than a supernatural event.","zh":"她谈到这个仪式时带着反神秘主义立场，把它当作一种文化传统，而不是超自然事件。"}]}],"synonyms":["skeptically","rationally","non-mystically","in a secular way"],"phonetic":"/ˌæntiˈmɪstɪkli/","extraExplanation":["“anti-”表示“反对、抵制”，“mystical”指“神秘的、带有灵性或超自然色彩的”。“antimystically”在日常英语里很少见，更常见的表达是：in a non-mystical way / in a skeptical way / from a rational perspective（以理性/怀疑的角度）。","它常用于学术或评论语境（文学批评、宗教史、哲学讨论），表示拒绝把作品或现象解释为“神秘启示、灵性象征或超自然力量”的结果。"]}
{"word":"antimysticalness","summary":{"en":"“Antimysticalness” means an anti-mystical attitude—the quality of rejecting mystical or supernatural explanations.","zh":"“antimysticalness”指反神秘倾向：拒绝神秘主义或超自然解释的特质/态度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or attitude of being opposed to mystical beliefs or interpretations (for example, rejecting spiritual, supernatural, or “mysterious” explanations).","zh":"反神秘主义（或反神秘倾向）：指反对神秘信仰或神秘式解读的态度/特质（例如拒绝灵性、超自然或“玄而又玄”的解释）。"},"examples":[{"en":"His writing shows a strong antimysticalness: he explains events through psychology and history, not miracles.","zh":"他的写作带有强烈的反神秘倾向：他用心理学和历史来解释事件，而不是用奇迹。"},{"en":"In some science-focused communities, antimysticalness is treated as a virtue.","zh":"在一些强调科学的社群里，反神秘倾向被视为一种优点。"}]}],"synonyms":["anti-mysticism","skepticism","rationalism","anti-supernaturalism"],"phonetic":"/ˌæn.tiˈmɪs.tɪ.kəl.nəs/","extraExplanation":["这是一个非常少见、带有“临时造词/自造词”感觉的名词：anti-（反对）+ mystical（神秘的）+ -ness（……性/特质）。日常英语中更常见的说法是 anti-mysticism（反神秘主义）或 an anti-mystical attitude（反神秘的态度）。","语气上它往往带评价色彩：可以是中性的“偏理性/反玄学”，也可能暗示“过度排斥宗教或灵性体验”。具体褒贬取决于语境。"]}
{"word":"antimysticism","summary":{"en":"Antimysticism means opposition to mysticism, favoring reason, doctrine, or evidence over mystical experience.","zh":"Antimysticism 指反对神秘主义，更偏向理性、教义或证据而非神秘体验。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Opposition to mysticism, especially the belief that spiritual truth should come from reason, doctrine, or observable evidence rather than direct mystical experience.","zh":"反神秘主义；反对“通过神秘体验直接获得灵性真理”的观点，强调理性、教义或可观察证据更可靠。"},"examples":[{"en":"Some Enlightenment thinkers are remembered for their antimysticism and emphasis on reason.","zh":"一些启蒙时代思想家因其反神秘主义立场和对理性的强调而被铭记。"},{"en":"His antimysticism made him skeptical of visions and miracles.","zh":"他的反神秘主义让他对异象和神迹持怀疑态度。"}]}],"synonyms":["anti-mysticism","skepticism toward mysticism","rationalism (in some contexts)"],"phonetic":"/ˌæn.tiˈmɪs.tɪ.sɪ.zəm/","extraExplanation":["“mysticism（神秘主义）”常指通过直觉、默观、与神合一等内在经验来认识终极真理；“antimysticism”则倾向认为这种方式不可靠，主张用理性推理、文本教义、科学方法或制度宗教来判断真伪。","这个词多出现在宗教学、哲学史或思想史语境中（如讨论启蒙运动对宗教的影响），日常口语中不常用。","词形结构：anti-（反对）+ mystic（神秘的/神秘主义者）+ -ism（主义/倾向）。相关词：anti-mystical（反神秘的，adj.）。"]}
{"word":"antimythic","summary":{"en":"Antimythic means “against myth-making,” describing ideas or art that demythologize heroic or sacred stories and treat them more realistically or skeptically.","zh":"antimythic 指“反神话/去神话化”，形容反对造神或神话式叙事、以更现实或怀疑的方式看待英雄或神圣故事的观点或作品。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Opposed to myths or myth-making; rejecting mythical explanations or heroic legends and favoring a more realistic, historical, or skeptical view.","zh":"反神话的；反对神话或“造神”的；拒绝用神话式解释或英雄传奇，而倾向于更现实、历史化或怀疑性的看法。"},"examples":[{"en":"The novel takes an antimythic approach, portraying the “hero” as an ordinary person with flaws.","zh":"这部小说采取反神话的写法，把“英雄”描写成一个有缺点的普通人。"},{"en":"Her antimythic reading of the legend focuses on politics and human motives rather than magic.","zh":"她对这个传说的反神话解读关注政治与人性动机，而不是魔法。"}]},{"partOfSpeech":"adj.","definition":{"en":"A style or tone (especially in art, literature, or criticism) that breaks down grand national, religious, or cultural stories and questions their authority.","zh":"（尤指艺术、文学或批评中的）反宏大叙事/反神圣化的风格或语气；拆解民族、宗教或文化的崇高故事并质疑其权威性。"},"examples":[{"en":"The film’s antimythic tone challenges the traditional story of the nation’s founding.","zh":"这部电影的反神话基调挑战了关于建国的传统叙事。"},{"en":"His essays are antimythic, warning against turning leaders into symbols beyond criticism.","zh":"他的文章带有反神话立场，警惕把领导者塑造成不可批评的象征。"}]}],"synonyms":["demythologizing","unromantic","skeptical","anti-heroic","revisionist"],"phonetic":"/ˌæntiˈmɪθɪk/","extraExplanation":["“antimythic”不是日常高频词，更常见于文学研究、文化评论与历史写作。它常用来描述一种“去神话化”（demythologizing）的态度：把被浪漫化、神圣化的故事还原为更复杂的人与社会现实。","在写作与批评中，它经常与 modernism / postmodernism 的倾向相关：反英雄、反史诗、反单一真理，强调多视角与对权力叙事的质疑。"]}
{"word":"antimythical","summary":{"en":"Antimythical means anti-myth: rejecting myth-based or legendary explanations, or presenting something in a non-legendary, down-to-earth way.","zh":"Antimythical 意为“反神话的/去神话化的”：反对神话式解释，或用不带传奇光环、更贴近现实的方式呈现人事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"opposed to myths or myth-based thinking; rejecting legendary or supernatural explanations in favor of factual or rational ones","zh":"反神话的；反对神话或神话式思维的；倾向于用事实或理性解释而非传奇/超自然解释"},"examples":[{"en":"Her essay takes an antimythical approach, checking each legend against historical records.","zh":"她的文章采取反神话的立场，把每个传说都拿去和史料对照核查。"},{"en":"The documentary is antimythical: it tries to separate what people wish were true from what evidence shows.","zh":"这部纪录片很反神话：它试图把人们希望为真的事情和证据所显示的事实区分开来。"}]},{"partOfSpeech":"adj.","definition":{"en":"not mythical; lacking the qualities of myth, legend, or a larger-than-life story","zh":"非神话式的；缺乏神话/传奇色彩的；不带“史诗化”叙事的"},"examples":[{"en":"He tells an antimythical version of the hero’s life—ordinary, flawed, and human.","zh":"他讲的是这位英雄人生的“非神话版”——平凡、有缺点、很有人味。"}]}],"synonyms":["demythologizing","anti-legend","non-mythical","skeptical","rational"],"phonetic":"/ˌæntiˈmɪθɪkəl/","extraExplanation":["这个词比较少见，多见于学术写作或评论（历史学、宗教学、文学批评等）。日常表达里更常用：anti-myth、demythologizing（去神话化）、non-mythical（非神话的）。","构词上是 anti-（反对）+ mythical（神话的）。它既可表示“反对神话叙事/神话思维”，也可表示“把某人某事从传奇光环中拉回现实”。"]}

