{"word":"antler","summary":{"en":"An antler is a deer’s branched bony horn that is usually shed and regrown each year.","zh":"antler 指鹿的分叉骨质鹿角，通常每年会脱落并再生。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a branched bony growth on the head of a male deer (and some related animals), usually shed and regrown each year","zh":"（雄鹿及部分相关动物头上的）鹿角；通常每年会脱落并再生"},"examples":[{"en":"A stag’s antlers can grow larger each year if it has enough food.","zh":"如果食物充足，雄鹿的鹿角每年可能会长得更大。"},{"en":"The deer shed its antlers in winter.","zh":"这只鹿在冬天脱落了鹿角。"},{"en":"We found a shed antler on the forest trail.","zh":"我们在森林小径上捡到一只脱落的鹿角。"}]},{"partOfSpeech":"adj.","definition":{"en":"(often used before another noun) relating to antlers, or made from antler","zh":"（常作定语）与鹿角有关的；由鹿角制成的"},"examples":[{"en":"He bought an antler handle knife as a souvenir.","zh":"他买了一把鹿角柄的小刀当纪念品。"},{"en":"The cabin had antler decorations on the walls.","zh":"小屋墙上有鹿角装饰。"}]}],"synonyms":["deer horn (informal)","rack (informal)"],"phonetic":"/ˈæntlər/","extraExplanation":["“antler”通常指鹿科动物的“真角”（骨质、会脱落再生）；不要和“horn（角）”混淆：很多有角动物（如牛、羊）的角外面有角质层，通常不会每年脱落。","文化语境里，鹿角常象征力量、自然与狩猎传统；也常见于北美乡村/小屋风格的装饰（如“antler chandelier 鹿角吊灯”）。"]}
{"word":"antler-bearing","summary":{"en":"Antler-bearing means “having antlers,” often used to describe a stag or an antlered figure.","zh":"antler-bearing 表示“长有鹿角的”，常用来形容雄鹿或带鹿角的形象。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having antlers (the branched bony growths on the heads of animals like deer), especially describing a male deer or a creature pictured with antlers.","zh":"长有鹿角的；（尤指）有角的雄鹿，或形象上带鹿角的生物。"},"examples":[{"en":"The antler-bearing stag stood still at the edge of the forest.","zh":"那只长着鹿角的雄鹿静静站在森林边缘。"},{"en":"In the painting, an antler-bearing figure symbolizes nature and wilderness.","zh":"在那幅画里，一个带鹿角的形象象征自然与荒野。"}]}],"synonyms":["antlered","horned (broader; not exact)","staglike (context-dependent)"],"phonetic":"/ˈæntlɚ ˌbɛrɪŋ/","extraExplanation":["“antler-bearing”是由名词 antler（鹿角）+ 现在分词 bearing（带着、拥有）构成的复合形容词，常见于描写自然、动物纪录片、狩猎/野生动物管理、以及神话或艺术作品（如“带鹿角的神祇/精灵”）中。","注意区分 antlers 和 horns：antlers（鹿角）通常会每年脱落再生，常见于鹿科动物；horns（角）一般不脱落，常见于牛、羊等。"]}
{"word":"antler-like","summary":{"en":"Antler-like means having a shape or branching form like a deer’s antlers.","zh":"antler-like 指“像鹿角的”，尤其强调“分叉、枝状”的外形。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling an antler (a branching bony growth on the head of a deer), especially in shape or branching form.","zh":"像鹿角的；形状或分叉结构类似鹿角的。"},"examples":[{"en":"The sculpture has antler-like branches reaching upward.","zh":"这座雕塑有像鹿角一样向上伸展的分叉。"},{"en":"She wore a headband with antler-like decorations for the winter festival.","zh":"她在冬季节庆上戴了一条有鹿角状装饰的发箍。"},{"en":"The tree’s antler-like limbs stood out against the snowy sky.","zh":"那棵树鹿角般的枝干在雪天的天空下格外显眼。"}]}],"synonyms":["branched","branching","antlered","hornlike (less precise)"],"phonetic":"/ˈæntlər laɪk/","extraExplanation":["“Antler-like”常用于描写“分叉、枝状”的外形，不一定真的与动物有关，也可用于树枝、珊瑚、装饰品或抽象图案。","小提示：antlers（鹿角）通常会分叉，并且许多鹿科动物会每年脱落再长；horns（角）通常不分叉，且多为终生生长。英文里用“antler-like”更强调“分叉的鹿角形”。"]}
{"word":"antlered","summary":{"en":"“Antlered” means having antlers, especially like a deer or stag.","zh":"“antlered”表示“有鹿角的”，常指像鹿或雄鹿那样长着鹿角。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having antlers (branched bony horns), like a deer or elk.","zh":"有鹿角的；长着（分叉的骨质）鹿角的（如鹿、麋鹿等）。"},"examples":[{"en":"An antlered deer stepped out of the forest at dawn.","zh":"一只长着鹿角的鹿在黎明时从森林里走了出来。"},{"en":"The artist painted an antlered stag on the cave wall.","zh":"画家在洞壁上画了一只长角的雄鹿。"}]}],"synonyms":["antler-bearing","horned"],"phonetic":"/ˈæntlɚd/","extraExplanation":["“antlered”多用于描写雄性鹿科动物，因为通常是雄性长鹿角（也有少数例外，如驯鹿雌雄都可能长角）。","词根提示：antler（鹿角）+ -ed（表示“具有……的”形容词后缀），类似：bearded（有胡子的）、winged（有翅膀的）。","在文学与神话题材中，“antlered”常用来营造原始、森林、自然之神等意象（如“antlered god”之类的表达）。"]}
{"word":"antlerite","summary":{"en":"Antlerite is a green secondary copper sulfate mineral found in oxidized copper deposits.","zh":"Antlerite 是一种绿色的次生硫酸铜矿物，常见于氧化带铜矿床中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a green mineral (a hydrated copper sulfate) that forms as a secondary mineral in the weathering/oxidation zones of copper deposits.","zh":"一种绿色矿物（含水的硫酸铜类矿物），常在铜矿床的风化/氧化带中作为次生矿物形成。"},"examples":[{"en":"Antlerite can appear as bright green crusts on rocks in old copper mines.","zh":"在旧铜矿中，antlerite 有时会以明亮的绿色结壳出现在岩石表面。"},{"en":"The geologist identified antlerite as a secondary copper mineral formed by oxidation.","zh":"地质学家将 antlerite 鉴定为由氧化作用形成的次生铜矿物。"}]}],"synonyms":["(no common everyday synonym; often described as a secondary copper sulfate mineral)"],"phonetic":"/ænˈtlɚˌaɪt/","extraExplanation":["antlerite 的名称来自美国亚利桑那州的 Antler Mine（安特勒矿），属于以产地/矿山命名的矿物名。","在实际阅读中，你更可能在地质报告、矿物学书籍或矿区介绍里看到 antlerite；日常英语中并不常用。"]}
{"word":"antlerless","summary":{"en":"Antlerless means “without antlers,” especially describing deer (often females or young).","zh":"antlerless 指“没有鹿角的”，常用于描述鹿等动物（通常指雌鹿或幼鹿）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a deer or similar animal) having no antlers.","zh":"（鹿或类似动物）无角的；没有鹿角的。"},"examples":[{"en":"The wildlife agency issued permits for antlerless deer to help control the population.","zh":"野生动物管理机构发放了可猎取无角鹿的许可证，以帮助控制数量。"},{"en":"In many species, females are usually antlerless.","zh":"在许多物种中，雌性通常是无角的。"}]}],"synonyms":["without antlers","hornless"],"phonetic":"/ˈæntlɚləs/","extraExplanation":["“antlerless”常用于野生动物管理与狩猎规定中，表示“没有鹿角的个体”。因为鹿角在多数鹿科动物中多见于雄性，所以“antlerless deer”在很多地区的管理语境里常常指雌鹿或幼鹿（但不同物种与个体情况会有例外）。","词形上：antler（鹿角）+ -less（无……的）。类似结构还有：fearless（无畏的）、homeless（无家可归的）。"]}
{"word":"antlerlike","summary":{"en":"Antlerlike means “shaped like an antler,” often with branching points.","zh":"antlerlike 指“像鹿角一样的”，常强调分叉的形状。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling an antler in shape (often branching like a deer’s antlers).","zh":"像鹿角的；形状类似鹿角（常指有分叉的外形）。"},"examples":[{"en":"The old tree had antlerlike branches reaching into the winter sky.","zh":"那棵老树的枝条像鹿角一样分叉，伸向冬天的天空。"},{"en":"In the fantasy novel, the forest spirits wore antlerlike crowns.","zh":"在那部奇幻小说里，森林精灵戴着鹿角般的王冠。"}]}],"synonyms":["antler-shaped","branching","branched","cervine-looking"],"phonetic":"/ˈæntlɚˌlaɪk/","extraExplanation":["“antlerlike”是由 antler（鹿角）+ -like（像……一样）组成的形容词，常用于描写自然景物（树枝、珊瑚）、装饰或奇幻形象。","小提醒：antlers（鹿角）通常会分叉，而且许多鹿科动物会每年脱落再长；horns（角，如牛羊的角）一般不分叉，且通常不会脱落。写作时想强调“分叉”的外形，用 antlerlike 很贴切。"]}
{"word":"Antlers","summary":{"en":"Antlers are the branched bony horns of deer, usually shed and regrown each year.","zh":"Antlers 指鹿等动物的分叉骨质鹿角，通常每年会脱落并重新生长。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The branched bony horns on the head of a deer (and some related animals), usually grown by males and shed each year.","zh":"（鹿等动物头上的）鹿角；多为雄性每年生长并会脱落再长。"},"examples":[{"en":"The stag lifted its head, showing large antlers.","zh":"那只雄鹿抬起头，露出巨大的鹿角。"},{"en":"In autumn, male deer use their antlers to compete for mates.","zh":"秋天，雄鹿会用鹿角争夺配偶。"},{"en":"We found a shed antler on the forest floor.","zh":"我们在森林地面上捡到一只脱落的鹿角。"}]},{"partOfSpeech":"vt.","definition":{"en":"To provide or decorate with antlers (rare; usually in descriptive or artistic contexts).","zh":"给……装上鹿角；用鹿角装饰（较少见，多用于描写或艺术语境）。"},"examples":[{"en":"The costume was antlered for the winter festival.","zh":"那套服装为了冬季庆典加上了鹿角装饰。"},{"en":"In the mural, the spirit is antlered like a deer.","zh":"在壁画里，那位灵体像鹿一样长着鹿角。"}]}],"synonyms":["deer antlers","rack (informal, especially for a deer’s antlers)"],"phonetic":"/ˈæntlɚz/","extraExplanation":["“Antlers（鹿角）”和“horns（角）”常被混淆：鹿角通常每年会脱落再长，主要见于鹿科；而牛羊等的角一般不会脱落，外层多为角质。","在文学和文化中，鹿角常象征自然、力量、野性或森林之灵；在某些神话形象（如“长鹿角的森林之神”）中也常出现。"]}
{"word":"antlers","summary":{"en":"Antlers are the branching bony horns of deer, often shed and regrown each year.","zh":"Antlers 指鹿等动物分叉的骨质鹿角，常会每年脱落再长。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The bony, usually branching horns grown (and typically shed each year) by male deer and some related animals.","zh":"（鹿等动物的）鹿角；通常为骨质、分叉状，多数每年会脱落再长（多见于雄性）。"},"examples":[{"en":"The stag lifted its head, showing wide antlers.","zh":"那只雄鹿抬起头，露出宽大的鹿角。"},{"en":"In winter, many deer have already shed their antlers.","zh":"冬天时，很多鹿已经脱落了鹿角。"},{"en":"We found a fallen antler on the hiking trail.","zh":"我们在徒步小径上捡到一只脱落的鹿角。"}]}],"synonyms":["deer horns","rack"],"phonetic":"/ˈæntlərz/","extraExplanation":["“Antlers”与“horns（角）”常被混淆：antlers（鹿角）通常是骨质、会分叉，并且多种鹿科动物每年会“脱落再生”；horns（如牛角、山羊角）一般是角质外壳包覆骨芯，通常不会每年脱落。","在英语文化里，antlers常出现在自然写作与狩猎语境中；也可用于装饰或比喻（如“antler chandelier 鹿角吊灯”）。"]}
{"word":"Antlia","summary":{"en":"Antlia is mainly the Latin name of a southern constellation, meaning “the Air Pump.”","zh":"Antlia 主要指南天的星座名（唧筒座），含义为“空气泵（Air Pump）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small southern constellation whose Latin name means “the Air Pump.”","zh":"（天文学）南天的一个小星座，拉丁名意为“空气泵（Air Pump）”。"},"examples":[{"en":"Antlia is a faint constellation in the southern sky.","zh":"Antlia（唧筒座）是南天一个较暗淡的小星座。"},{"en":"On star charts, Antlia lies near Hydra and Vela.","zh":"在星图上，Antlia 位于长蛇座（Hydra）和船帆座（Vela）附近。"}]},{"partOfSpeech":"n.","definition":{"en":"(biology, rare) a pump-like organ or structure; used especially in older scientific writing.","zh":"（生物学，较少用）“泵状”的器官或结构；多见于较早的科学文献。"},"examples":[{"en":"Some older texts use antlia to describe a pumping structure in an insect.","zh":"一些较早的文献会用 antlia 来指昆虫体内的泵状结构。"}]}],"synonyms":["the Air Pump","Antlia (constellation)"],"phonetic":"/ˈæntliə/","extraExplanation":["“Antlia”这个星座名来自拉丁语/希腊语词根，含义与“泵（pump）”相关。它由18世纪法国天文学家拉卡伊（Nicolas-Louis de Lacaille）在绘制南天星图时命名，体现了当时用科学仪器来给新星座命名的风格。","天文学语境中，它的英文常用名称是“The Air Pump”，中文通常译为“唧筒座”（也可见“气泵座”的说法）。"]}
{"word":"antlia","summary":{"en":"Antlia is mainly used as the name of a southern constellation; historically it can also mean an “air pump.”","zh":"Antlia 主要指南天星座「唧筒座」；在歷史用法中也可指「空氣幫浦／氣泵」。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a faint constellation in the southern sky, whose name means “air pump.”","zh":"南天的一個較暗的星座，名稱意為「空氣幫浦／氣泵」。"},"examples":[{"en":"Antlia is a small, faint constellation in the southern hemisphere.","zh":"Antlia（唧筒座）是南半球天空中一個較小、較暗的星座。"},{"en":"On clear nights, stargazers may look for Antlia near Hydra.","zh":"在晴朗的夜晚，觀星者可能會在長蛇座（Hydra）附近尋找 Antlia。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical, rare) an air pump; a device used to move or remove air.","zh":"（歷史用語，罕見）空氣幫浦／抽氣裝置；用來移動或抽走空氣的器具。"},"examples":[{"en":"Early science texts sometimes mention an antlia for creating a partial vacuum.","zh":"早期科學文本有時會提到 antlia，用來製造部分真空。"}]}],"synonyms":["air pump (for the historical sense)","the constellation Antlia"],"phonetic":"/ˈæntliə/","extraExplanation":["「Antlia」來自希臘／拉丁語，原義與「抽氣、幫浦」相關。天文學上它是18世紀法國天文學家拉卡伊（Nicolas-Louis de Lacaille）為紀念科學儀器而命名的星座之一，因此常被翻譯為「唧筒座」。","作為日常英文單字，「Antlia」幾乎只在天文語境中使用；表示「氣泵」的普通英文更常用 air pump。"]}
{"word":"Antliae","summary":{"en":"Antliae means “of Antlia” in Latin and is used in official astronomical star names (e.g., Alpha Antliae).","zh":"Antliae 是 Antlia（气泵座）的拉丁语属格，表示“气泵座的”，常用于恒星正式名称（如 Alpha Antliae）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"the Latin genitive form of Antlia, used in astronomy to mean “of Antlia” (Antlia = the constellation the Air Pump). Common in official star names like “Alpha Antliae.”","zh":"Antlia（气泵座）这个星座名称的拉丁语属格形式，天文学中表示“属于气泵座的”。常见于恒星正式名称，如“Alpha Antliae（气泵座α）”。"},"examples":[{"en":"Alpha Antliae is a star in the constellation Antlia.","zh":"Alpha Antliae 是气泵座中的一颗恒星。"},{"en":"In catalogs, “Antliae” tells you the star is “of Antlia.”","zh":"在星表里，“Antliae”表示这颗星“属于气泵座”。"}]}],"synonyms":["of Antlia (English equivalent)"],"phonetic":"/ænˈtli.aɪ/","extraExplanation":["在现代天文学的命名体系里，很多恒星名称沿用“希腊字母 + 拉丁语属格星座名”的格式（例如 Alpha Centauri）。因此你会看到 Antlia 的属格 Antliae，被用来表示“气泵座的”。","Antlia（气泵座）是一个较暗的南天星座，由18世纪的天文学家拉卡伊（Nicolas-Louis de Lacaille）命名，象征当时的新发明“空气泵（air pump）”。"]}
{"word":"antliate","summary":{"en":"“Antliate” is likely a misspelling of “annihilate,” meaning to destroy or defeat completely.","zh":"“antliate”很可能是“annihilate”的拼写错误，意思是“彻底摧毁”或“彻底击败”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Commonly spelled: annihilate) To completely destroy something or make it stop existing.","zh":"（常见拼写：annihilate）彻底摧毁；使不复存在。"},"examples":[{"en":"The fire nearly annihilated the entire village.","zh":"那场大火几乎把整个村庄都毁掉了。"},{"en":"We must not let hate annihilate our hope.","zh":"我们不能让仇恨摧毁希望。"}]},{"partOfSpeech":"vt.","definition":{"en":"To defeat someone or something completely.","zh":"彻底击败；完胜。"},"examples":[{"en":"Our team was annihilated in the final game.","zh":"我们队在决赛中被彻底击败了。"},{"en":"The champion annihilated his opponent in two rounds.","zh":"冠军两回合就完胜了对手。"}]}],"synonyms":["destroy","wipe out","obliterate","devastate","exterminate","crush"],"phonetic":"/əˈnaɪ.əˌleɪt/","extraExplanation":["你输入的“antliate”不是常见英语单词，最接近、最常见的对应词是 **annihilate**。如果你想查的是别的词（例如 *alienate* / *antidote* / *inflate*），告诉我上下文句子我可以帮你确认。","**annihilate** 常用于新闻、历史与文学语境（战争、灾难、毁灭性失败），语气很强；日常对话中要注意别用得过重。"]}
{"word":"Antlid","summary":{"en":"Antilid means an antelope or something relating to antelopes; it’s a rare/technical term, often seen in zoological contexts.","zh":"antilid 指“羚羊（类）”或“与羚羊有关的”，属于较少见、偏动物学/学术语境的词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology) An antelope, or a member of the antelope group (family Bovidae; older term: Antilopinae/Antilidae).","zh":"（动物学）羚羊；或指羚羊类群的成员（属牛科 Bovidae；较旧用法常写作 Antilopinae/Antilidae）。"},"examples":[{"en":"The museum displayed several antilid skulls from Africa.","zh":"博物馆展出了几件来自非洲的羚羊头骨。"},{"en":"Different antilids have adapted to deserts, grasslands, and mountains.","zh":"不同的羚羊类群适应了沙漠、草原和山地等环境。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to antelopes.","zh":"与羚羊有关的；羚羊的。"},"examples":[{"en":"Researchers compared antilid species by studying their horns.","zh":"研究人员通过研究角来比较不同的羚羊物种。"}]}],"synonyms":["antelope","bovid (broader)"],"phonetic":"/ˈæn.tɪ.lɪd/","extraExplanation":["你输入的 **Antlid** 很可能是拼写误差，更常见的拼法是 **antilid**（中间有一个 i）。","**antilid** 属于较偏学术、较旧的分类用语：现代英文更常直接说 **antelope**，或用更具体的分类名称（如 *antelopes in the family Bovidae*）。"]}
{"word":"antlid","summary":{"en":"“antlid” is not a standard English word; it’s likely a misspelling (often of “antler” or “eyelid”).","zh":"“antlid”不是标准英语单词；多半是拼写错误（常见可能是“antler”或“eyelid”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. If written as “antlid,” it is usually a misspelling or a mistaken form of another word.","zh":"不是标准英语单词。“antlid”通常是拼写错误或把别的词写错了。"},"examples":[{"en":"I couldn’t find “antlid” in a dictionary—did you mean “antler” or “eyelid”?","zh":"我在词典里找不到“antlid”——你是不是想写“antler（鹿角）”或“eyelid（眼睑）”？"},{"en":"Please check the spelling of “antlid” in your notes.","zh":"请检查你笔记里“antlid”的拼写。"}]}],"phonetic":"ˈæntlɪd","extraExplanation":["“antlid”看起来像是把两个常见词拼在一起或拼错了：\n- 可能想写 **antler**（鹿角）。\n- 也可能想写 **eyelid**（眼睑）。\n- 如果你想表达“防……的 / 反……的”，可能是 **anti-** 这个前缀（如 antiwar 反战）。\n把你看到它的句子发我，我可以根据语境帮你确认正确单词。"]}
{"word":"antlike","summary":{"en":"Antlike means “like an ant,” often describing something very small, busy, or moving in an orderly way.","zh":"antlike 表示“像蚂蚁一样”，常形容非常渺小、忙碌或成群有序地移动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling an ant in appearance, movement, or behavior—especially being very small, quick, or hardworking.","zh":"像蚂蚁的；形状、动作或行为类似蚂蚁的——尤指很小、行动迅速或勤劳。"},"examples":[{"en":"From far away, the hikers looked antlike on the huge mountain trail.","zh":"从远处看，徒步者在巨大的山路上显得像蚂蚁一样渺小。"},{"en":"An antlike line of workers moved steadily through the factory floor.","zh":"一队工人像蚂蚁队伍一样，在工厂车间里稳定前行。"},{"en":"I watched the antlike movements of the insects as they carried crumbs back to their nest.","zh":"我看着这些昆虫像蚂蚁一样搬运面包屑回巢的动作。"}]}],"synonyms":["antlike","ant-sized","tiny","minuscule","diligent"],"phonetic":"/ˈæntˌlaɪk/","extraExplanation":["“antlike”是由“ant（蚂蚁）+ -like（像……一样）”构成的形容词，常用于写作或描述性表达，强调“很小、成群移动、忙碌有序”等画面感。","它多用于比喻：形容远处的人群/车辆像蚂蚁一样小；也可形容某些行为“像蚂蚁般勤劳、持续”。语气通常中性，有时带一点赞叹或轻微的讽刺，取决于语境。"]}
{"word":"antling","summary":{"en":"Antling is a bird behavior (and verb) meaning rubbing ants on feathers or letting ants crawl through plumage, often linked to feather care.","zh":"Antling 指鸟类的“蚁浴/蚁擦”行为（也可作动词），即用蚂蚁擦拭羽毛或让蚂蚁在羽毛间爬行，常与羽毛护理有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Of a bird) the behavior of rubbing ants on its feathers or sitting among ants so the ants crawl through its plumage, often thought to help with parasites or feather care.","zh":"（鸟类）“蚁浴/蚁擦”行为：用蚂蚁在羽毛上摩擦，或坐在蚁群中让蚂蚁爬过羽毛，常被认为与驱虫或整理羽毛有关。"},"examples":[{"en":"We watched the robin antling on the lawn, spreading its wings as ants crawled through its feathers.","zh":"我们看到那只知更鸟在草地上进行蚁浴，张开翅膀让蚂蚁爬过羽毛。"},{"en":"Some observers think antling may help birds reduce mites.","zh":"一些观察者认为蚁浴可能有助于鸟类减少螨虫。"}]},{"partOfSpeech":"v.","definition":{"en":"To perform antling; to rub ants on the feathers or allow ants to crawl through the plumage.","zh":"进行蚁浴：用蚂蚁摩擦羽毛，或让蚂蚁在羽毛间爬行。"},"examples":[{"en":"The jay was antling under the tree, repeatedly picking up ants and brushing them on its wings.","zh":"那只松鸦在树下进行蚁浴，不断叼起蚂蚁在翅膀上擦。"}]}],"synonyms":["anting","ant-bathing"],"phonetic":"/ˈænt.lɪŋ/","extraExplanation":["“Antling”来自“ant（蚂蚁）+ -ling（表示动作/行为）”。它常出现在自然观察、鸟类行为学（ethology）和科普写作中。","有时会提到两种方式：主动式（鸟把蚂蚁叼起擦在羽毛上）与被动式（鸟坐在蚁群里让蚂蚁爬）。具体原因仍有争议，但常见解释包括利用蚂蚁分泌的蚁酸来抑制寄生虫或帮助清洁羽毛。"]}
{"word":"antlion","summary":{"en":"An antlion is an insect (especially its larva) known for making sand pits to trap ants.","zh":"蚁狮是一种昆虫（尤其指幼虫），以挖沙坑陷阱捕捉蚂蚁闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small insect (the larva of an antlion) that digs a cone-shaped sand pit to trap ants and other small insects; also used for the adult insect that looks like a slender, lacewing-like creature.","zh":"蚁狮（幼虫会在沙地挖漏斗状陷阱捕捉蚂蚁等小虫；也可指成虫，外形像细长的草蛉一类昆虫）。"},"examples":[{"en":"In the dry sand, an antlion larva waits at the bottom of its pit for an ant to slip in.","zh":"在干燥的沙地里，蚁狮幼虫在坑底等待蚂蚁滑落进去。"},{"en":"We saw tiny funnel-shaped holes and realized antlions were hunting nearby.","zh":"我们看到小小的漏斗形沙坑，才意识到附近有蚁狮在捕猎。"}]}],"synonyms":["ant lion","doodlebug (larva, informal)"],"phonetic":"/ˈæntˌlaɪən/","extraExplanation":["“antlion”这个名字来自它“像狮子一样捕食蚂蚁”的捕猎方式。幼虫常被称为“doodlebug”（美国口语），会在松软的沙土中挖出漏斗坑；猎物滑落时，它会抛沙让猎物更难爬出。","在文学与文化里，antlion常被用作“隐蔽的陷阱/耐心等待的捕食者”的意象。"]}
{"word":"antlion-like","summary":{"en":"Antlion-like means resembling an antlion, often suggesting a lurking, trap-setting hunting style.","zh":"antlion-like 指“像蚁蛉（幼虫挖沙坑设陷阱捕食）一样的”，常暗示潜伏、设陷与耐心捕猎的特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling an antlion (an insect whose larvae dig sand pits to trap ants), especially in appearance or behavior (e.g., lurking, trapping, patient hunting).","zh":"像蚁蛉（其幼虫会挖沙坑陷阱捕捉蚂蚁）的；尤指外形或行为上类似（如潜伏、设陷、耐心捕猎）。"},"examples":[{"en":"In the dune scene, the creature was described as antlion-like, waiting beneath the sand for prey to slip.","zh":"在沙丘那一幕里，那生物被形容为“蚁蛉般的”，潜伏在沙下等待猎物滑落。"},{"en":"His antlion-like patience made him a dangerous opponent in negotiations.","zh":"他那种“蚁蛉般的”耐心让他在谈判中成了危险的对手。"}]}],"synonyms":["antlionish","trap-setting","predatory","lurking"],"phonetic":"ˈæntˌlaɪən laɪk","extraExplanation":["“antlion-like”是合成形容词：antlion（蚁蛉）+ -like（像……一样）。常见于科幻、奇幻或自然描写，用来营造“埋伏、设陷阱、悄无声息等待”的画面感。","蚁蛉幼虫英文常叫“doodlebug”，会在沙地挖漏斗状陷阱，蚂蚁滑入后难以爬出；因此这个词也可带一点“狡猾、耐心、捕捉猎物”的隐喻色彩。"]}
{"word":"antlions","summary":{"en":"Antlions are insects best known for their larvae, which make sand pits to trap ants; the word can also refer to the adult flying insect.","zh":"antlions 指蚁蛉，最常见是会挖沙坑捕捉蚂蚁的幼虫；也可指其成虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small insect (especially the larva of an antlion) that digs a cone-shaped pit in sand to trap ants and other tiny insects.","zh":"蚁蛉（尤指其幼虫），会在沙地挖漏斗状陷阱来捕捉蚂蚁等小昆虫。"},"examples":[{"en":"We found antlions in the sandbox—tiny pits with loose sand around them.","zh":"我们在沙坑里发现了蚁蛉——一个个小漏斗坑，周围是松散的沙子。"},{"en":"The antlion waits at the bottom of the pit until an ant slips in.","zh":"蚁蛉会躲在坑底，等蚂蚁滑进去。"}]},{"partOfSpeech":"n.","definition":{"en":"The adult antlion, a delicate flying insect that looks somewhat like a damselfly.","zh":"蚁蛉成虫：一种外形纤细、会飞的昆虫，看起来有点像豆娘。"},"examples":[{"en":"An adult antlion rested on the wall near the porch light.","zh":"一只蚁蛉成虫停在门廊灯旁的墙上。"}]}],"synonyms":["antlion larvae","doodlebugs","Myrmeleontidae"],"phonetic":"/ˈæntˌlaɪənz/","extraExplanation":["“antlion”这个名字来自它的捕食方式：幼虫会挖出漏斗形沙坑，像“狮子”一样伏击“蚂蚁”。在中文里常称“蚁蛉”，幼虫也常被叫作“沙蚁狮”。"]}
{"word":"antlophobia","summary":{"en":"Antlophobia means a strong fear of floods or flooding.","zh":"Antlophobia 指对洪水或洪水泛滥的强烈恐惧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an intense fear of floods or being flooded (a very rare term).","zh":"对洪水或被淹没的强烈恐惧（非常少见的用语）。"},"examples":[{"en":"After a major storm, she developed antlophobia and avoided living near rivers.","zh":"经历一场大风暴后，她产生了 antlophobia，开始避免住在河边。"},{"en":"His antlophobia made him panic when he heard flood warnings.","zh":"他的 antlophobia 让他一听到洪水预警就惊慌。"}]}],"synonyms":["fear of floods","flood phobia","a phobia about flooding"],"phonetic":"/ˌæntləˈfoʊbiə/","extraExplanation":["这个词在日常英语里几乎不用，更多见于少量的“恐惧症词汇表”或冷门词条；更自然的说法通常是：a fear of floods / a phobia about flooding。","构词上，-phobia 表示“恐惧”；antlo- 常被解释为与“洪水/抽水、排水”相关的古希腊词根来源（不同资料的细节不完全一致），所以该词的核心意思仍是“对洪水（或被淹）感到强烈害怕”。"]}
{"word":"antluetic","summary":{"en":"Antiluetic is a rare medical adjective meaning “anti-syphilis; used to prevent or treat syphilis.”","zh":"Antiluetic 是较少见的医学形容词，意为“抗梅毒的；用于预防或治疗梅毒的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical, uncommon) Relating to the prevention or treatment of syphilis.","zh":"（医学用语，较少见）与梅毒的预防或治疗有关的；抗梅毒的。"},"examples":[{"en":"Before antibiotics, doctors used various antiluetic treatments for syphilis.","zh":"在抗生素出现之前，医生会使用多种抗梅毒疗法来治疗梅毒。"},{"en":"The textbook mentions mercury as a historical antiluetic remedy.","zh":"教材提到汞曾是历史上的一种抗梅毒药物。"}]}],"synonyms":["antisyphilitic","antisiphylitic (less common spelling)"],"phonetic":"/ˌæn.ti.luˈɛt.ɪk/","extraExplanation":["“luetic”来自拉丁语 lues，意为“瘟疫/毒害”，在医学史上常专指“梅毒”。因此 antiluetic（anti- + luetic）字面意思就是“对抗梅毒的”。","该词在现代英语中非常少用；更常见、更直接的说法是 antisyphilitic（抗梅毒的）或 simply “for syphilis”（用于梅毒治疗的）。"]}
{"word":"antly","summary":{"en":"“Antly” is a rare word meaning “like an ant,” usually describing antlike movement or behavior.","zh":"“Antly”是个罕见词，意思是“像蚂蚁一样”，常用来形容蚂蚁般的动作或行为。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Rare) In an antlike way; like an ant in movement or behavior.","zh":"（罕见）以蚂蚁般的方式；像蚂蚁那样移动或表现。"},"examples":[{"en":"The tiny workers moved antly across the leaf, each carrying a crumb.","zh":"小小的工蚁像蚂蚁一样在叶子上移动，每只都搬着一点碎屑。"},{"en":"She watched the crowd antly scatter into side streets.","zh":"她看着人群像蚂蚁般四散到小巷里。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) Antlike; resembling an ant.","zh":"（罕见）像蚂蚁的；具有蚂蚁特征的。"},"examples":[{"en":"In the story, the hero has an antly patience and strength.","zh":"在故事里，英雄有着蚂蚁般的耐心与力量。"}]}],"synonyms":["antlike","like ants","in an ant-like way"],"phonetic":"/ˈæntli/","extraExplanation":["“antly”非常少见，多出现在文学化或描写性的语境里，用来营造“像蚂蚁一样细小、忙碌、成群移动”的画面。日常英语里更常用的表达是：“like ants / ant-like / in an ant-like way”。"]}

