{"word":"antra","summary":{"en":"“Antra” is the plural of “antrum,” meaning body cavities (medical) or, in poetic use, caves/dens.","zh":"“antra”是“antrum”的复数，常指（医学上的）腔/窦，也可在文学中指洞穴/巢穴。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “antrum”: natural cavities or hollow spaces in the body (used especially in medical/anatomy contexts).","zh":"“antrum”的复数：指人体内的天然腔、窦或空腔（多用于医学/解剖学语境）。"},"examples":[{"en":"In anatomy class, we learned about the nasal antra (sinuses).","zh":"在解剖课上，我们学习了鼻窦等鼻腔周围的窦（antra）。"},{"en":"Inflammation can affect the antra and cause facial pressure.","zh":"炎症可能影响这些窦腔（antra），导致面部压迫感。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literary/poetic) Caves or dens; hollow places.","zh":"（文学/诗歌用法）洞穴、巢穴；空洞之处。"},"examples":[{"en":"The poem describes wild beasts hiding in dark antra.","zh":"诗中描写野兽藏身于幽暗的洞穴（antra）之中。"}]}],"synonyms":["cavities","sinuses","caves","dens"],"phonetic":"/ˈæntrə/","extraExplanation":["“antra”来自拉丁语：antrum（洞穴、洞窟）的复数形式。英语中它既保留了文学上的“洞穴”意味，也在医学里专指“窦/腔”（如上颌窦等）。","在现代日常英语里，“antra”多数出现在医学、解剖或较正式的文字中；普通场景更常用“caves”或“sinuses”。"]}
{"word":"antral","summary":{"en":"“Antral” means “related to an antrum,” especially in medical contexts (stomach or sinus).","zh":"“antral”意为“与窦（天然腔隙）有关的”，多用于医学语境，常指胃窦或鼻窦相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an antrum (a natural cavity in the body), especially the antrum of the stomach or a sinus cavity.","zh":"与“窦”（身体中的天然腔隙）有关的，尤指胃窦或鼻窦等腔隙。"},"examples":[{"en":"The doctor noted antral inflammation during the endoscopy.","zh":"医生在内镜检查中发现了胃窦部位的炎症。"},{"en":"Antral gastritis can cause upper stomach discomfort after meals.","zh":"胃窦炎可能导致饭后上腹不适。"},{"en":"The scan showed changes in the antral region of the sinus.","zh":"扫描显示鼻窦的窦部区域出现了变化。"}]}],"synonyms":["of the antrum","sinus-related (context-dependent)","gastric antrum–related (context-dependent)"],"phonetic":"/ˈæntrəl/","extraExplanation":["“antral”是医学/解剖学用语，来自“antrum”（窦、腔）。日常英语中很少用，常见于检查报告或论文。","常见搭配：antral gastritis（胃窦炎）、antral ulcer（胃窦溃疡）、antral follicle（窦卵泡，用于生殖医学中的卵巢评估）、antral sinus（上颌窦/相关窦腔）。","理解小提示：看到“antral + 身体部位/疾病名”时，通常表示“发生在（该）窦部/与窦相关的”。"]}
{"word":"antralgia","summary":{"en":"Antralgia is a medical term meaning pain in an antrum, especially the maxillary sinus.","zh":"antralgia 是医学术语，指窦腔（尤指上颌窦）的疼痛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"pain in an antrum (especially the maxillary sinus), often related to sinus inflammation or infection.","zh":"窦痛；指身体某个“窦腔”（尤指上颌窦）部位的疼痛，常与鼻窦炎或感染有关。"},"examples":[{"en":"The patient reported antralgia and pressure under the eyes, suggesting maxillary sinus involvement.","zh":"病人主诉上颌窦窦痛并伴有眼下压迫感，提示可能累及上颌窦。"},{"en":"After treatment for sinusitis, her antralgia gradually improved.","zh":"鼻窦炎治疗后，她的窦痛逐渐缓解。"}]}],"synonyms":["sinus pain","maxillary sinus pain"],"phonetic":"/ænˈtræl.dʒə/","extraExplanation":["这是医学用语，较少出现在日常英语中，更多见于病历、检查报告或医学文章。","词源结构：antr- 来自 antrum（“窦腔/洞”），-algia 来自希腊语 algos（“疼痛”）。类似构词还有 neuralgia（神经痛）、myalgia（肌痛）。","在更常见的临床表达里，英语可能会直接说 “sinus pain（鼻窦痛）” 或 “maxillary sinus pain（上颌窦痛）”。"]}
{"word":"antre","summary":{"en":"“antre” is informal Southeast Asian English meaning “a queue” or “to line up,” influenced by Indonesian.","zh":"“antre”多见于东南亚口语英语，受印尼语影响，表示“队伍/排队”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Informal, Southeast Asian English; from Indonesian) a line of people waiting for something; a queue.","zh":"（非正式，东南亚英语用法；源自印尼语）排队的人群；队伍。"},"examples":[{"en":"The cashier is busy—there’s a long antre at the counter.","zh":"收银台很忙——柜台前排了很长的队。"},{"en":"I joined the antre to buy concert tickets.","zh":"我加入队伍去买演唱会门票。"}]},{"partOfSpeech":"v.","definition":{"en":"(Informal, Southeast Asian English; from Indonesian) to line up; to queue (up).","zh":"（非正式，东南亚英语用法；源自印尼语）排队；排队等候。"},"examples":[{"en":"Please antre here; the service starts at 9 a.m.","zh":"请在这里排队；服务早上9点开始。"},{"en":"We had to antre for an hour to get in.","zh":"我们为了进去排了一个小时的队。"}]}],"synonyms":["queue","line","line up","wait in line"],"phonetic":"/ˈɑn.treɪ/","extraExplanation":["“antre”在标准英语里不常见，更多出现在新加坡/马来西亚等地的口语英语中，通常是受印尼语“antre/ antri”（排队）影响。正式写作或国际场合更建议用“queue / line / line up”。","容易与法语借词“entrée”（主菜/入场）混淆；两者拼写和读音相近，但意思不同。"]}
{"word":"antrectomy","summary":{"en":"Antrectomy is surgery to remove the lower part of the stomach (the antrum).","zh":"Antrectomy 指切除胃下部胃窦的手术（胃窦切除术）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation to remove the antrum (the lower part) of the stomach, usually to treat ulcers or stomach outlet blockage.","zh":"胃窦切除术：一种外科手术，切除胃的胃窦（胃的下部），常用于治疗消化性溃疡或胃出口梗阻等问题。"},"examples":[{"en":"The surgeon recommended an antrectomy because the ulcer kept bleeding.","zh":"由于溃疡反复出血，外科医生建议进行胃窦切除术。"},{"en":"After the antrectomy, he needed smaller meals and careful follow-up.","zh":"胃窦切除术后，他需要少量多餐并定期复查。"}]}],"synonyms":["antral resection","gastric antrectomy"],"phonetic":"/ænˈtrɛk.tə.mi/","extraExplanation":["词源提示：antr- 来自 antrum（“窦、腔”），-ectomy 表示“切除术”。因此 antrectomy 直译就是“胃窦切除术”。","临床背景：胃窦是胃下部，负责研磨食物并分泌胃泌素等激素；切除后可能影响胃排空和消化功能，所以术后常见的指导包括少量多餐、营养评估，以及监测倾倒综合征（dumping syndrome）等。"]}
{"word":"antres","summary":{"en":"“Antres” is the plural of “antre,” meaning caves or dens (often dark or dangerous), used mainly in literary or old-fashioned English.","zh":"“antres”是“antre”的复数，意为洞穴或巢穴（常含阴暗、危险之意），多见于文学或较古旧的表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) caves or dens, especially dark, hidden, or dangerous places where someone might live or hide.","zh":"（复数）洞穴；巢穴（尤指阴暗、隐蔽或危险、可能有人藏身或栖居的地方）。"},"examples":[{"en":"The old story describes bandits hiding in mountain antres.","zh":"老故事里写到强盗藏在山里的洞穴中。"},{"en":"In the novel, the detective follows the clues into the criminal’s antre.","zh":"在小说里，侦探顺着线索进入罪犯的巢穴。"}]}],"synonyms":["caves","dens","lairs","hideouts"],"phonetic":"ˈæn.tɚ","extraExplanation":["“antres”是名词“antre”的复数形式。“antre”在现代英语中较少见，带有文学色彩，常用于描写阴森、神秘的洞穴或“匪巢”。","常见文学用法：莎士比亚《奥赛罗》(Othello) 中有 “the Anthropophagi, and men whose heads / Do grow beneath their shoulders… and the Cannibals that each other eat, / The Anthropophagi… and antres vast…” 这类用法强化“辽阔、幽暗的洞穴/险地”的画面感。","学习提示：日常更常用的词是 “cave”（洞穴）、“den”（兽穴/藏身处）、“hideout”（藏身处）。"]}
{"word":"Antrim","summary":{"en":"Antrim is mainly a place name in Northern Ireland: either County Antrim or the town of Antrim.","zh":"Antrim 主要是北爱尔兰的地名：指安特里姆郡或安特里姆镇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a county in Northern Ireland, part of the historic province of Ulster (known for Belfast, the Giant’s Causeway, and the Antrim Coast).","zh":"（专有名词）北爱尔兰的一个郡，属于历史上的阿尔斯特省（以贝尔法斯特、巨人之路和安特里姆海岸等闻名）。"},"examples":[{"en":"We drove along the Antrim Coast to see the cliffs and small fishing villages.","zh":"我们沿着安特里姆海岸开车，去看悬崖和小渔村。"},{"en":"Belfast is in County Antrim, though it is also treated as its own local government area.","zh":"贝尔法斯特位于安特里姆郡，不过它在地方行政上也常被当作独立区域来管理。"}]},{"partOfSpeech":"n.","definition":{"en":"a town in Northern Ireland (the county town of County Antrim), near Lough Neagh.","zh":"（专有名词）北爱尔兰的一个城镇（安特里姆郡的郡治所在地），靠近内湖（Lough Neagh）。"},"examples":[{"en":"She stopped in Antrim for lunch on the way to the north coast.","zh":"她去北海岸的路上在安特里姆镇停下来吃午饭。"}]}],"synonyms":["County Antrim","Antrim (town)"],"phonetic":"/ˈæntrɪm/","extraExplanation":["“Antrim”源自爱尔兰语 **Aontroim**，常被解释为与“山脊/脊梁地形”相关的地名含义。英文里作为地名时通常不加冠词：说 **in Antrim / in County Antrim**。","文化与旅行语境里常见搭配：**the Antrim Coast**, **County Antrim**, **the Glens of Antrim**（安特里姆山谷群）。"]}
{"word":"antrin","summary":{"en":"“antrin” is not standard English; it’s likely Indonesian slang meaning “to queue/line up.”","zh":"“antrin”不是标准英语；多半是印尼语口语写法，意思是“排队/去排队”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; commonly seen as Indonesian/Malay texting/slang related to antri/antrian (“to line up; a queue”). In English, the closest equivalents are “queue (up),” “line up,” or “stand in line.”","zh":"不是标准英语词；常见于印尼语/马来语的口语或短信写法，来自 antri/antrian（“排队；队伍”）。英语里最接近的说法是 “queue (up) / line up / stand in line（排队）”。"},"examples":[{"en":"We have to queue up (stand in line) to buy tickets.","zh":"我们得排队买票。"},{"en":"There’s a long line at the café.","zh":"咖啡店那边排了很长的队。"}]}],"synonyms":["queue (up)","line up","stand in line"],"phonetic":"ˈɑn.trɪn","extraExplanation":["“antrin”很可能是把印尼语 antri（排队）口语化、动词化后的写法（类似“antri-in/antrein”这种网络拼法）。如果你想用英语表达，最自然的是：\n- 美式英语更常说 line up / stand in line\n- 英式英语更常用 queue / queue up\n如果你是在某个特定句子里看到 antrin，可以把原句发来，我可以帮你判断它具体想表达哪一种意思。"]}
{"word":"antritis","summary":{"en":"Antritis means inflammation of the antrum, most commonly the stomach’s antrum (antrum gastricum).","zh":"antritis 指窦部（最常见为胃窦）的炎症，常称“胃窦炎”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"inflammation of the antrum (especially the antrum of the stomach), often considered a type of gastritis.","zh":"窦部炎；（尤指）胃窦炎：指“窦部”（常指胃的胃窦）发生炎症，常被视为胃炎的一种。"},"examples":[{"en":"The doctor said the biopsy suggested antritis rather than a more widespread gastritis.","zh":"医生说活检提示更像是胃窦炎，而不是更广泛的胃炎。"},{"en":"Spicy food can sometimes make symptoms of antritis feel worse.","zh":"辛辣食物有时会让胃窦炎的症状更明显。"}]}],"synonyms":["antral gastritis","gastritis (broader term)"],"phonetic":"/ænˈtraɪtɪs/","extraExplanation":["“antritis”是医学用语：antrum（窦部）+ -itis（炎症）。日常英语里更常听到的是“gastritis（胃炎）”，而“antritis”更具体，强调炎症位置在胃窦。","如果你想找的是关节炎，正确拼写通常是“arthritis（关节炎）”，与“antritis（胃窦炎）”含义完全不同。"]}
{"word":"antrocele","summary":{"en":"An antrocele is a medical term for a cyst-like swelling or protrusion of the maxillary sinus (antrum).","zh":"antrocele 指上颌窦（窦腔）出现的囊样肿胀或类似疝出的膨出。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medicine) A cyst-like swelling or hernia-like protrusion involving the maxillary sinus (the antrum), sometimes bulging toward the nasal cavity.","zh":"（医学）上颌窦（上颌窦腔/上颌窦窦腔）的囊样肿胀或类似疝出的膨出，有时会向鼻腔方向隆起。"},"examples":[{"en":"The CT scan suggested an antrocele arising from the maxillary sinus.","zh":"CT 扫描提示上颌窦可能有 antrocele 形成。"},{"en":"Because an antrocele can mimic a nasal polyp, the doctor ordered imaging.","zh":"由于 antrocele 可能与鼻息肉相似，医生安排了影像检查。"}]}],"synonyms":["maxillary sinus mucocele","antral mucocele"],"phonetic":"/ˈæntrəˌsiːl/","extraExplanation":["词源上可拆解为 antr-（antrum，指“窦/腔”，常指上颌窦）+ -cele（源自希腊语，表示“疝、肿胀、膨出”）。因此它字面意思就是“窦的膨出/肿胀”。","这是较少见、偏专业的医学词；在临床语境中常与“上颌窦黏液囊肿/黏液囊胀（mucocele）”“鼻息肉”等鉴别相关。"]}
{"word":"antronasal","summary":{"en":"Antronasal describes something involving both the mouth and the nose, especially in speech sound production.","zh":"antronasal 指与口腔和鼻腔同时相关的，尤用于描述发音/共鸣同时经过口与鼻。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both the oral (mouth) and nasal (nose) passages, especially describing speech sounds produced with airflow/resonance through the mouth and nose.","zh":"与口腔（口）和鼻腔（鼻）同时有关的；尤指发音时气流/共鸣同时经过口腔与鼻腔的。"},"examples":[{"en":"Some languages have antronasal vowels that sound partly nasalized.","zh":"有些语言有口鼻同发的元音，听起来会带一点鼻化。"},{"en":"The singer was advised to reduce antronasal resonance to make the tone clearer.","zh":"老师建议这位歌手减少口鼻混合共鸣，让音色更清晰。"}]}],"synonyms":["oronasal","nasalized (in some contexts)"],"phonetic":"/ˌæn.troʊˈneɪ.zəl/","extraExplanation":["这是一个较少见的专业词，常出现在语音学、歌唱训练或医学/解剖学的讨论中。意思接近“口腔+鼻腔共同参与”。在语音学里，它常用来描述某些声音带有鼻腔共鸣（类似“鼻化”）但并非完全鼻音。"]}
{"word":"antrophore","summary":{"en":"“Antrophore” is probably a misspelling of “anthophore,” a botanical term for a small stalk that lifts flower parts.","zh":"“antrophore” 很可能是 “anthophore” 的误拼：植物学术语，指抬起花部的一段小柄状结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely a misspelling) anthophore: a short stalk or internode in some plants that lifts and separates the flower parts (often raising the petals and stamens above the ovary).","zh":"（很可能是拼写错误）anthophore（花托柄/花柄状节间）：在某些植物中，连接并抬起花的部分的一段短小“柄状”节间，常把花瓣和雄蕊抬到子房之上。"},"examples":[{"en":"In some passionflowers, the anthophore elevates the stamens above the ovary.","zh":"在一些西番莲中，anthophore 会把雄蕊抬到子房之上。"},{"en":"The botanist measured the length of the anthophore under a microscope.","zh":"植物学家在显微镜下测量了 anthophore 的长度。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare / not standard) If you meant “anthropophore,” it refers to something that bears or carries humans (a term seen in older scientific writing).","zh":"（非常罕见/非标准）如果你想写的是 “anthropophore”，它指“承载/携带人类的事物”，多见于较早的科学文献。"},"examples":[{"en":"Some older texts used “anthropophore” in discussions of human carriers in myth.","zh":"一些旧文献在讨论神话中的“人类承载者”时会用到 anthropophore。"}]}],"synonyms":["flower stalk (general)","internode (general, not exact)","anthophore"],"phonetic":"/ˈænθəˌfɔr/","extraExplanation":["“antrophore” 不是常见的英语单词拼写。最接近、最常用的专业词是植物学里的 **anthophore**（词源：antho- “花” + -phore “携带/承载”）。如果你告诉我你看到它的句子或领域（植物学/医学/其他），我可以帮你确认到底是哪一个词。"]}
{"word":"antrophose","summary":{"en":"“antrophose” is not a standard English word; it is likely a misspelling related to the Greek root for “human.”","zh":"“antrophose” 不是标准英语单词；很可能是与表示“人/人类”的希腊语词根相关的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling of **anthropose** or **anthropos** (Greek-based forms meaning “human / person”).","zh":"不是标准英语单词；很可能是 **anthropose** 或 **anthropos** 的拼写错误（源自希腊语词根，表示“人/人类”）。"},"examples":[{"en":"I couldn’t find **antrophose** in an English dictionary—did you mean **anthropos** (human) or **anthropo-** (human-related)?","zh":"我在英语词典里找不到 **antrophose**——你想写的是 **anthropos**（人）还是 **anthropo-**（与人/人类相关）吗？"},{"en":"Words like **anthropology** use the root **anthropo-**, meaning “human.”","zh":"像 **anthropology（人类学）** 这样的词使用词根 **anthropo-**，意思是“人/人类”。"}]}],"phonetic":"/ˈænθrəˌpoʊs/","extraExplanation":["**可能的目标词与用法提示：**\n1) **anthropos**：来自希腊语 *ánthrōpos*，意思是“人/人类”。在英语里多见于学术语境或作为词根来源被提及。\n2) **anthropo-**：常见构词成分（前缀式词根），表示“人类的/与人相关的”。例如：**anthropology**（人类学）、**anthropomorphic**（拟人化的）。\n\n如果你能提供看到这个词的句子或领域（例如生物、哲学、文学），我可以帮你确定最可能的正确拼写与含义。"]}
{"word":"antrorse","summary":{"en":"Antrorse means pointing or directed forward or toward the tip, especially in botanical and zoological descriptions.","zh":"antrorse 指“向前/向上、朝顶端”的方向性用语，常见于植物学与动物学形态描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany, zoology) Pointing or directed forward, upward, or toward the tip (apex) of an organ or body part.","zh":"（植物学/动物学）向前、向上或朝向末端（顶端）生长或指向的。"},"examples":[{"en":"The tiny hairs on the stem are antrorse, pointing toward the tip of the plant.","zh":"茎上的细小毛向前（向顶端）生长，属于向前生长的毛。"},{"en":"In this species, the spines are mostly antrorse rather than pointing backward.","zh":"在这个物种中，刺大多向前，而不是向后弯。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a forward or upward direction; toward the tip.","zh":"向前或向上；朝向末端（顶端）。"},"examples":[{"en":"The bristles lie antrorse along the surface.","zh":"这些刚毛沿着表面向前伏贴。"}]}],"synonyms":["forward-pointing","toward the apex","ascending (context-dependent)"],"phonetic":"/ænˈtrɔrs/","extraExplanation":["“antrorse”多见于学术写作（尤其是植物学形态描述），常用来对比“retrorse”（向后、向基部）。例如描述叶缘刺、茎毛、鳞片等是朝顶端还是朝基部。","词源来自拉丁语 antrorsus/antrorsum，意为“向前”。阅读形态学描述时，遇到它通常是在说明结构的指向或生长方向。"]}
{"word":"antrorsely","summary":{"en":"Antrorsely means “directed forward or upward (toward the front or the tip),” mainly in scientific descriptions.","zh":"antrorsely 指“向前或向上（朝前方或朝顶端）地”，主要用于科学描述。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a forward or upward direction; pointing or leaning toward the front or toward the tip (used mainly in biology/botany).","zh":"向前或向上地；朝向前方或朝向顶端地（多用于生物学/植物学语境）。"},"examples":[{"en":"The leaf hairs are antrorsely directed along the midrib.","zh":"叶片的毛沿着主脉呈向前（向顶端）生长的方向。"},{"en":"The tiny spines are arranged antrorsely, making the stem feel rough when you slide your fingers upward.","zh":"细小的刺呈向前（向上）排列，所以你把手指向上滑时会觉得茎很粗糙。"}]}],"synonyms":["forward","upward","toward the front","toward the tip","anteriorly (related, but not always identical)"],"phonetic":"/ænˈtrɔr.sli/","extraExplanation":["这是一个非常少见的词，常见于植物形态学或昆虫学等描述性写作中。相关形容词是 antrorse（“向前/向上指向的”）。","词源来自拉丁语 *anter-*（“前面”）的概念。实际阅读中更常看到的通用表达是 *forward/upward*，或解剖学里的 *anteriorly*（“向前地/在前侧”），但 *anteriorly* 更强调“在身体前侧”，不一定包含“朝向顶端”的意思。"]}
{"word":"antroscope","summary":{"en":"An antroscope is a device used to observe ants closely.","zh":"antroscope 指用来近距离观察蚂蚁的器具或观察装置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an instrument or viewing container used to observe ants closely (often like a small ant farm or magnifying viewer).","zh":"用于近距离观察蚂蚁的器具或观察盒（常见形式类似小型蚂蚁饲养观察箱或带放大功能的观察器）。"},"examples":[{"en":"The teacher brought an antroscope to class so students could watch how ants carry food.","zh":"老师把一个蚂蚁观察器带到课堂上，让学生观察蚂蚁如何搬运食物。"},{"en":"With the antroscope, we could see the ants’ tunnels and how they moved inside the nest.","zh":"通过蚂蚁观察器，我们能看到蚂蚁的隧道，以及它们在巢内如何活动。"}]}],"synonyms":["ant farm","ant viewer","insect viewer"],"phonetic":"/ˈæn.təˌskoʊp/","extraExplanation":["这个词在现代英语里比较少见，更多出现在较早的科普/自然观察语境中。构词很直观：ant（蚂蚁）+ -scope（观察器/镜）。实际生活中，人们更常说 ant farm（蚂蚁农场/蚂蚁观察箱）或 ant viewer（蚂蚁观察器）。"]}
{"word":"antroscopy","summary":{"en":"Antroscopy is an endoscopic examination of an antrum, most often referring to looking inside the maxillary sinus.","zh":"Antroscopy 指用内窥镜检查人体的窦/腔，最常用来指检查上颌窦内部。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical procedure that uses an endoscope to examine an antrum (a natural cavity), especially the maxillary sinus (the sinus behind the cheek).","zh":"一种用内窥镜检查“窦/腔”（antrum，指人体的天然腔隙）的医学检查，常指检查上颌窦（脸颊后方的鼻窦）。"},"examples":[{"en":"The ENT doctor recommended antroscopy to look inside the maxillary sinus.","zh":"耳鼻喉科医生建议做 antroscopy，以便观察上颌窦内部情况。"},{"en":"Antroscopy can help identify inflammation, polyps, or unusual tissue in the sinus.","zh":"Antroscopy 有助于发现鼻窦内的炎症、息肉或异常组织。"}]}],"synonyms":["sinus endoscopy","endoscopic sinus examination"],"phonetic":"/ænˈtrɑskəpi/","extraExplanation":["这是一个相对少见、偏专业的医学词。词根 antr- 来自 antrum（“窦/腔”），-scopy 表示“用镜检查/观察”（如 endoscopy 内窥镜检查）。","临床上更常见的相关说法包括 “sinus endoscopy / endoscopic sinus examination”（鼻窦内镜检查）。不同医院或文献对术式命名可能略有差异。"]}
{"word":"Antrostomus","summary":{"en":"Antrostomus is a scientific genus name for certain American nightjars.","zh":"Antrostomus 是某些美洲夜鹰类鸟的科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of nightjars (nocturnal birds) found in the Americas, including species such as the Eastern Whip-poor-will.","zh":"夜鹰科的一属（多为夜行性鸟类），分布于美洲，包括如“东部夜鹰/唤夜鸮（Eastern Whip-poor-will）”等物种。"},"examples":[{"en":"In some older field guides, the Eastern Whip-poor-will is listed under Antrostomus.","zh":"在一些较早的野外图鉴中，“东部夜鹰/唤夜鸮”会被列在 Antrostomus 这个属下。"},{"en":"Researchers compared Antrostomus calls to understand how different species communicate at night.","zh":"研究人员比较了 Antrostomus 属鸟类的叫声，以了解不同物种如何在夜间交流。"}]}],"synonyms":["nightjar genus","goatsucker (family-level common name)"],"phonetic":"/ænˈtrɑs.tə.məs/","extraExplanation":["这是一个拉丁化的学名（属名），日常英语中通常不会单独使用；更多出现在鸟类学、自然观察、科研论文或野外图鉴里。","词源常被解释为源自希腊语成分：antron（洞穴）+ stoma（嘴），可理解为“洞口般的嘴/大嘴”，呼应夜鹰类张口捕食昆虫的特征。","分类学上，部分物种在不同时期可能在 Caprimulgus 与 Antrostomus 等属之间调整；因此你在不同版本资料里可能看到不同的属名。"]}
{"word":"antrostomus","summary":{"en":"Antrostomus is a scientific genus name for certain American nightjars.","zh":"Antrostomus 是某些美洲夜鹰的属名（学名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of nightjars (nocturnal birds) found mainly in the Americas, known for their camouflage and insect-eating habits.","zh":"（鸟类）夜鹰属：主要分布于美洲的一属夜行性鸟类，以善于伪装、捕食昆虫而闻名。"},"examples":[{"en":"Scientists recorded the calls of Antrostomus at dusk to identify which species were present.","zh":"科学家在黄昏时录下夜鹰属（Antrostomus）的鸣叫，以确认有哪些物种出现。"},{"en":"The researcher compared Antrostomus with other nightjar genera using DNA data.","zh":"研究者用DNA数据将夜鹰属（Antrostomus）与其他夜鹰类属进行比较。"}]}],"synonyms":["nightjar (genus name context)","Antrostomus (scientific genus)"],"phonetic":"/ænˈstrɑːstəˌməs/","extraExplanation":["“Antrostomus”是一个拉丁化的学名（属名），常见于鸟类学与自然观察写作中。学名在英文里通常首字母大写并用斜体（Antrostomus）。","分类学研究中，一些传统上归入“Caprimulgus（夜鹰属）”的美洲物种，常被重新划入“Antrostomus”，因此你可能会在旧资料与新资料里看到不同属名。"]}
{"word":"antrotome","summary":{"en":"Antrotome means a surgical cutting instrument used to open an antrum, especially in mastoid (ear) surgery.","zh":"Antrotome 指用于切开窦腔的外科切割器械，尤用于耳科的乳突窦手术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical instrument used to cut into an antrum (especially the mastoid antrum in ear surgery).","zh":"用于切开窦腔的外科器械（尤指耳科手术中切开乳突窦的器械）。"},"examples":[{"en":"The surgeon selected an antrotome to open the mastoid antrum safely.","zh":"外科医生选择用乳突窦凿（antrotome）来安全地打开乳突窦。"},{"en":"In older surgical texts, the antrotome is listed among classic mastoid instruments.","zh":"在较早的外科教材中，antrotome 常被列为经典的乳突手术器械之一。"}]}],"synonyms":["mastoid chisel","surgical chisel","bone chisel"],"phonetic":"/ˈæntrəˌtoʊm/","extraExplanation":["这是一个较少见的专业医学词，多见于耳鼻喉科（ENT）或颅颌面相关的外科语境。词根来源可拆为 antr(o)-（“窦、窦腔”，如 antrum）+ -tome（“切割器械”，如 scalpel 同类概念但更偏“专用切割器/刀”）。","现代临床中可能更常用更具体的器械名称或以手术步骤描述来替代该词；在阅读旧版教材、器械清单或历史文献时更容易遇到。"]}
{"word":"antrotomy","summary":{"en":"Antrotomy is a surgical incision into an antrum, most commonly the mastoid antrum behind the ear.","zh":"Antrotomy 指对窦腔进行切开的外科手术，最常见的是耳后乳突窦切开。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation that makes an incision (a cut) into an antrum, especially the mastoid antrum (an air space in the skull behind the ear).","zh":"（外科）切开术；将某个窦腔（antrum）切开引流的手术，尤指乳突窦切开术（位于耳后颅骨内的含气腔）。"},"examples":[{"en":"The ENT surgeon performed an antrotomy to drain infection from the mastoid antrum.","zh":"耳鼻喉科医生进行了乳突窦切开术，以引流乳突窦内的感染。"},{"en":"In severe cases, antrotomy may be combined with other procedures to treat chronic ear disease.","zh":"在严重情况下，切开术可能会与其他手术联合，用于治疗慢性耳部疾病。"}]}],"synonyms":["mastoid antrotomy","antral incision","antral surgery"],"phonetic":"/ænˈtrɑtəmi/","extraExplanation":["这是一个比较少见、偏专业的医学词，常出现在耳鼻喉科（ENT）或颅骨相关手术的语境中。","词源构成：antr- 来自 antrum（窦腔、窦），-tomy 来自希腊语，表示“切开、切开术”（同类如 tracheotomy 气管切开术）。","不要把 antrum 简单理解为“鼻窦”或“上颌窦”专用词；它泛指体内某些“洞/腔/窦状空间”，但 antrotomy 在临床上常特指乳突窦相关操作。"]}
{"word":"antrotympanic","summary":{"en":"A medical adjective meaning “involving both the antrum (especially the mastoid antrum) and the middle ear/tympanum.”","zh":"医学形容词：指同时涉及（乳突）窦与鼓室/中耳（鼓膜区域）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both the antrum (a cavity, especially the mastoid antrum) and the tympanum (the middle ear/eardrum area).","zh":"与“窦（尤指乳突窦）”和“鼓室/鼓膜区域（中耳）”两者相关的。"},"examples":[{"en":"The CT report mentioned antrotympanic disease involving the mastoid antrum and middle ear.","zh":"CT 报告提到“窦-鼓室”病变，累及乳突窦和中耳。"},{"en":"The surgeon planned an antrotympanic approach to clear infection around the middle ear and antrum.","zh":"外科医生计划采用窦-鼓室入路，以清除中耳和乳突窦周围的感染。"}]}],"synonyms":["antral and tympanic (descriptive phrase)","mastoid antrum–middle ear (descriptive phrase)"],"phonetic":"/ˌæn.troʊ.tɪmˈpæn.ɪk/","extraExplanation":["这是一个医学/耳鼻喉科（ENT）术语，常见于影像学报告或手术记录中。词由两部分组成：antro-（antrum，“窦/腔”，在耳部语境多指乳突窦）+ tympanic（tympanum，“鼓室/鼓膜相关”）。它通常用来描述病变范围（同时涉及乳突窦与中耳），或描述手术入路与处理区域。"]}
{"word":"antrotympanitis","summary":{"en":"A medical term for inflammation involving both the middle ear (tympanum) and the mastoid antrum.","zh":"指同时累及中耳（鼓室）与乳突窦的炎症（医学用语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation of the mastoid antrum (a small air space in the mastoid bone behind the ear) and the tympanum/middle ear, usually related to severe or complicated middle-ear infection.","zh":"乳突窦（耳后乳突骨内的气腔）与鼓室/中耳的炎症，常与严重或并发性的中耳感染有关。"},"examples":[{"en":"The ENT specialist suspected antrotympanitis after the patient’s otitis media did not improve.","zh":"由于患者的中耳炎迟迟未好转，耳鼻喉科医生怀疑是乳突窦-鼓室炎（antrotympanitis）。"},{"en":"CT imaging was ordered to check for antrotympanitis and other mastoid complications.","zh":"医生安排了CT检查，以排查乳突窦-鼓室炎及其他乳突相关并发症。"}]}],"synonyms":["middle-ear and mastoid antrum inflammation","complicated otitis media (contextual)","mastoid involvement in otitis media (contextual)"],"phonetic":"/ˌæn.troʊˌtɪm.pəˈnaɪ.tɪs/","extraExplanation":["词源拆解：antro-（antrum，意为“窦/腔隙”）+ tympan-（tympanum，意为“鼓室/鼓膜相关”）+ -itis（“炎症”）。","这是较少见、偏医学专业的术语；日常就医中更常听到的是 otitis media（中耳炎）、mastoiditis（乳突炎）。当中耳感染向耳后乳突区域扩展或出现并发症时，医生可能会用到更精确的复合术语。"]}
{"word":"antroversion","summary":{"en":"Antroversion is a rare term (often meaning anteroversion): a forward tilt/rotation of an organ, especially the uterus.","zh":"Antroversion 很少见（常指 anteroversion）：器官向前的倾斜/旋转，尤指子宫前倾。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare; often a misspelling of **anteroversion**) a forward tilting or rotation of an organ, especially the uterus, so it points toward the front of the body.","zh":"（罕见；常被当作 **anteroversion** 的误拼）器官向身体前方的倾斜或旋转，尤指子宫向前倾。"},"examples":[{"en":"The ultrasound report described mild antroversion of the uterus.","zh":"超声报告描述子宫轻度前倾（antroversion）。"},{"en":"In anatomy, antroversion contrasts with retroversion (tilting backward).","zh":"在解剖学中，antroversion 常与 retroversion（后倾）相对。"}]}],"synonyms":["anteroversion"],"phonetic":"/ˌæntroʊˈvɝʒən/","extraExplanation":["“antroversion”在常见英语词典里并不常作为标准词条出现；医学/解剖学中更常用的拼写是 **anteroversion**（ante- = “前”）。如果你想表达性格上的“内向”，正确的词是 **introversion**。"]}
{"word":"antrovert","summary":{"en":"“Antrovert” is not standard English; it’s usually a misspelling of “introvert.”","zh":"“antrovert”不是标准英语用词；通常是把“introvert（内向的人）”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard word; most often a misspelling of “introvert” (a person who tends to be quiet, reflective, and enjoys spending time alone).","zh":"非标准用词；最常见是把 “introvert”（内向的人；偏安静、爱独处、喜欢自我思考）拼错了。"},"examples":[{"en":"I think you mean “introvert,” not “antrovert.”","zh":"你可能想说的是 “introvert”，不是 “antrovert”。"},{"en":"She’s an introvert and needs quiet time after social events.","zh":"她比较内向，社交活动后需要安静独处的时间。"}]}],"synonyms":["introvert","reserved person","quiet person"],"phonetic":"/ˈɪntrəvɝt/","extraExplanation":["“antrovert”在主流英语词典里通常不作为标准词条出现，所以在正式写作或考试中不建议使用。","常见的相关词：\n- introvert（内向的人）\n- extrovert（外向的人）\n- ambivert（介于内向与外向之间的人）\n如果你想表达“更偏内向/更偏外向”，也可以说: more introverted / more extroverted。"]}
{"word":"antrum","summary":{"en":"Antrum means a natural internal cavity, especially a sinus cavity or a part of the stomach.","zh":"Antrum 指身体内部的天然腔隙，尤指鼻窦腔或胃的胃窦（幽门窦）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hollow space (cavity) inside the body, especially in a bone or organ; often used for certain spaces in the skull (sinuses) or in the stomach.","zh":"（身体内的）腔、窦；尤指骨或器官中的空腔，常用来指颅骨的鼻窦或胃部的特定腔室。"},"examples":[{"en":"The dentist checked the maxillary antrum to see if a sinus infection might be causing the tooth pain.","zh":"牙医检查了上颌窦，看看是否是鼻窦感染引起的牙痛。"},{"en":"In anatomy class, we learned that an antrum is a natural cavity, not an abnormal hole.","zh":"在解剖课上，我们学到 antrum 指的是正常的天然腔隙，不是异常的孔洞。"}]}],"synonyms":["cavity","sinus","hollow"],"phonetic":"/ˈæntrəm/","extraExplanation":["antrum 源自拉丁语，意思是“洞穴、洞窟”。医学上常见搭配包括：maxillary antrum（上颌窦）、pyloric antrum / gastric antrum（幽门窦/胃窦）。日常英语里较少用，更多出现在医学、解剖学语境。"]}
{"word":"antrums","summary":{"en":"A tantrum is a sudden angry outburst; “tantrums” is the plural form.","zh":"tantrum 指突然的发脾气/情绪爆发；tantrums 是其复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sudden outburst of anger or frustration, often with shouting, crying, or refusing to cooperate (especially common in young children).","zh":"（突然的）发脾气；情绪爆发（常见于儿童，可能伴随哭闹、喊叫或不配合）。"},"examples":[{"en":"The toddler threw a tantrum when he couldn’t have the toy.","zh":"小孩因为拿不到玩具就大发脾气。"},{"en":"She had a tantrum and slammed the door.","zh":"她发了脾气，把门砰地一声关上了。"},{"en":"His tantrums at work made teamwork difficult.","zh":"他在工作中的情绪爆发让团队合作变得困难。"}]},{"partOfSpeech":"v.","definition":{"en":"to have an angry outburst; to behave in an uncontrolled, childish way when upset.","zh":"发脾气；（因不满而）失控地闹情绪（有时带“孩子气”的含义）。"},"examples":[{"en":"He tantrumed for a few minutes and then calmed down.","zh":"他闹了几分钟情绪，后来就冷静了。"},{"en":"Don’t tantrum—tell me what you need.","zh":"别闹脾气——告诉我你需要什么。"}]}],"synonyms":["outburst","fit","meltdown","temper tantrum","hissy fit"],"phonetic":"/ˈtæntrəm/","extraExplanation":["你输入的“antrums”很可能是拼写错误，正确拼写通常是“tantrums”（tantrum 的复数）。","“tantrum”常用于描述儿童哭闹式的情绪爆发；用于成人时往往带批评意味，暗示不成熟或不理性。"]}
{"word":"antrustion","summary":{"en":"Intrusion means an unwanted entry or an interruption that disturbs someone’s privacy or peace.","zh":"Intrusion 指不受欢迎的闯入，或对他人隐私/安宁的打扰、侵扰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of entering a place, situation, or conversation where you are not wanted or invited","zh":"（不受欢迎或未受邀请的）闯入；侵入；打扰"},"examples":[{"en":"The security guard reported an intrusion into the building at night.","zh":"保安报告说夜里有人闯入大楼。"},{"en":"Sorry for the intrusion—I didn’t mean to interrupt your meeting.","zh":"抱歉打扰了——我不是故意打断你们的会议。"}]},{"partOfSpeech":"n.","definition":{"en":"something that interrupts your peace, privacy, or normal life","zh":"对安宁/隐私/正常生活的干扰；侵扰之事"},"examples":[{"en":"She felt the phone call was an intrusion on her privacy.","zh":"她觉得那通电话侵犯了她的隐私。"},{"en":"The constant noise was an intrusion that made it hard to sleep.","zh":"持续的噪音成了干扰，让人很难入睡。"}]}],"synonyms":["invasion","trespass","interruption","interference"],"phonetic":"/ɪnˈtruʒən/","extraExplanation":["你输入的 **antrustion** 可能是拼写错误，更常见的正确拼写是 **intrusion**。","词根提示：**in-**（进入）+ **trude**（闯入/强行插入）→ **intrude**（闯入；打扰）→ **intrusion**（闯入；打扰）。","常见搭配：**an intrusion into** (闯入/侵入……)；**an intrusion on** (对……的打扰/侵犯)。"]}
{"word":"antrustionship","summary":{"en":"“Antrustionship” isn’t standard English; say “a trusting relationship” or “a relationship built on trust.”","zh":"“antrustionship”不是标准英语；建议用“trusting relationship（互信关系）”或“relationship built on trust（建立在信任上的关系）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a made-up blend of “trust” + “relationship.” A natural English phrase is “a trusting relationship” or “a relationship built on trust.”","zh":"不是标准英语单词。很可能是拼写错误或把 trust（信任）+ relationship（关系）拼在一起的自造词。更自然的表达是 “a trusting relationship（互相信任的关系）” 或 “a relationship built on trust（建立在信任上的关系）”。"},"examples":[{"en":"They have a trusting relationship, so they can talk honestly about problems.","zh":"他们有一种互相信任的关系，所以能坦诚地谈问题。"},{"en":"Building a relationship built on trust takes time and consistent actions.","zh":"建立在信任上的关系需要时间和持续一致的行动。"}]}],"synonyms":["trusting relationship","relationship built on trust","mutual trust","relationship of trust"],"phonetic":"ˌæntrʌsˈɪp","extraExplanation":["英语里更常用的搭配是：trusting relationship / relationship of trust / build trust / mutual trust（相互信任）。","如果你想表达“委托（把某事交给别人负责）产生的信任关系”，可以用：entrust (something) to (someone)（把……托付给……）或 a fiduciary relationship（受托关系，偏法律/金融语境）。"]}

