{"word":"ants","summary":{"en":"“Ants” is the plural of “ant,” meaning small social insects that live and work together in colonies.","zh":"“ants”是“ant”的复数，指成群生活、分工合作的社会性小昆虫——蚂蚁。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"small insects that live in organized groups (colonies), often building nests and working together to find food","zh":"蚂蚁：体型很小的昆虫，常以“群体/蚁群（巢穴）”形式生活，分工合作觅食、筑巢"},"examples":[{"en":"Ants carried crumbs back to their nest in a long line.","zh":"蚂蚁排成一长串，把面包屑搬回巢里。"},{"en":"We saw ants on the picnic blanket, so we moved the food.","zh":"我们看到野餐垫上有蚂蚁，于是把食物挪开了。"}]}],"synonyms":["ants (plural of ant)"],"phonetic":"/ænts/","extraExplanation":["“ants”是“ant”的复数形式。口语里也可用于夸张表达：There are ants everywhere.（到处都是蚂蚁。）","相关常见搭配：ant colony（蚁群/蚁群落）、anthill（蚁丘/蚂蚁窝）、worker ant（工蚁）、queen ant（蚁后）。"]}
{"word":"antship","summary":{"en":"Antship is a rare, often playful noun meaning “the state or life of being an ant,” sometimes referring to an ant colony or ant society.","zh":"Antship 是个罕见、常带幽默色彩的名词，表示“作为蚂蚁的状态/生活”，有时也指蚁群或蚂蚁社会。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, often humorous) The state, role, or imagined “identity” of being an ant; ant life or ant society as a concept.","zh":"（罕见，常带幽默）“作为蚂蚁的状态/身份”；泛指蚂蚁的生活或蚂蚁社会这一概念。"},"examples":[{"en":"In the story, the narrator dreams of antship—working, marching, and never being alone.","zh":"在故事里，叙述者梦见自己过着“蚂蚁式生活”——劳作、列队行进、从不孤单。"},{"en":"The poet uses antship to contrast human pride with tiny creatures’ teamwork.","zh":"诗人用“antship”来对比人类的自负与小生物的团队合作。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare) An ant colony or community; the collective life of ants.","zh":"（非常罕见）蚂蚁群体；蚁群/蚁群生活。"},"examples":[{"en":"We watched the antship rebuild after the rain flooded their tunnels.","zh":"我们看着蚁群在雨水淹没洞穴后重新建造。"}]}],"synonyms":["ant colony","ants’ society","ant life","ant community"],"phonetic":"/ˈæntˌʃɪp/","extraExplanation":["“-ship”是英语里常见的名词后缀，表示“身份/状态/关系”（如 friendship 友谊、leadership 领导力）。因此 antship 多半是仿造词（非标准常用词），用于文学、幽默或拟人化表达。","日常英语中更自然的说法通常是 ant colony（蚁群）、ants’ society（蚂蚁社会）或 life of ants（蚂蚁的生活）。"]}
{"word":"antshrike","summary":{"en":"An antshrike is a tropical American insect-eating bird that often hunts around ant swarms.","zh":"蚁鵙是一种生活在美洲热带地区的食虫鸟，常在蚂蚁群活动处附近觅食。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small insect-eating songbird from tropical Central and South America (family Thamnophilidae), known for hunting insects—often near ant swarms—and for strong, sharp calls.","zh":"（蚁鵙）一种生活在中美洲和南美洲热带地区的小型食虫鸣禽（蚁鵙科 Thamnophilidae），常在蚂蚁群附近捕食昆虫，并以响亮尖锐的叫声闻名。"},"examples":[{"en":"We spotted an antshrike in the understory, flicking its tail as it searched for insects.","zh":"我们在林下层看到一只蚁鵙，它一边摆动尾巴一边寻找昆虫。"},{"en":"The guide said antshrikes often follow army ants to catch prey that gets flushed out.","zh":"向导说蚁鵙常跟随行军蚁，捕捉被惊起逃出的猎物。"}]}],"synonyms":["bushshrike (not exact)","antbird (related group)"],"phonetic":"/ˈæntˌʃraɪk/","extraExplanation":["“antshrike”这个名字有点误导：它不是“shrike（伯劳）”的近亲。英语里用“shrike”多半是因为它们有较强的捕食性、叫声锐利，给早期观察者留下类似伯劳的印象。","蚁鵙常与“army ants（行军蚁）”的生态行为一起被提到：它们会利用蚁群驱赶昆虫和小动物逃窜的机会来捕食，这种关系更像“搭便车式觅食”，而不是吃蚂蚁本身。"]}
{"word":"antsier","summary":{"en":"“Antsier” means more antsy—more restless, nervous, or impatient.","zh":"“antsier”表示“更坐立不安/更紧张/更不耐烦”，是“antsy”的比较级。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"more restless, nervous, or impatient (comparative form of “antsy”)","zh":"更坐立不安的；更紧张或更不耐烦的（“antsy”的比较级）"},"examples":[{"en":"The longer we waited, the antsier I got.","zh":"我们等得越久，我就越坐立不安。"},{"en":"She became antsier as the interview time got closer.","zh":"面试时间越接近，她就越紧张不安。"},{"en":"Kids often get antsier right before a trip begins.","zh":"孩子们在旅行开始前常常会更兴奋又坐不住。"}]}],"synonyms":["more restless","more fidgety","more impatient","more jittery","more uneasy"],"phonetic":"/ˈæntsiɚ/","extraExplanation":["“antsy”是很口语的词，常用来形容像身上有蚂蚁在爬一样的“坐不住、心里发慌”的感觉；“antsier”就是“更……的”比较级形式。也可以用“more antsy”。"]}
{"word":"antsiest","summary":{"en":"“Antsiest” means “the most antsy”—the most restless, nervous, or impatient.","zh":"“antsiest”表示“最坐立不安/最紧张/最不耐烦”，是“antsy”的最高级。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative of “antsy”: feeling the most nervous, impatient, or unable to stay still among a group or compared to other times.","zh":"“antsy”的最高级：在一群人中（或与其他时候相比）最紧张、最不耐烦、最坐立不安的。"},"examples":[{"en":"On the morning of the exam, I was the antsiest person in the room.","zh":"考试那天早上，我是房间里最坐立不安的人。"},{"en":"The kids got antsiest when the bus was late.","zh":"公交车晚点时，孩子们变得最不耐烦、最躁动。"},{"en":"I’m always antsiest right before a big presentation.","zh":"我总是在重要演讲前最紧张、最不安。"}]}],"synonyms":["most restless","most fidgety","most jittery","most impatient","most uneasy"],"phonetic":"/ˈænt.si.əst/","extraExplanation":["“antsy”是很口语、很美式的表达，常用来形容“像有蚂蚁爬一样坐不住”的烦躁感（常见联想是短语“ants in your pants”）。一般用于轻松或日常语境，不适合非常正式的写作。"]}
{"word":"antsigne","summary":{"en":"“antsigne” isn’t a recognized English word; it’s probably a misspelling (e.g., “antigen,” “ensign,” or “assigned”).","zh":"“antsigne”不是常见英语词；很可能是拼写错误（如“antigen / ensign / assigned”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name/username. Common possibilities include “antigen” (biology), “ensign” (a military/naval rank or a flag), or “assigned.”","zh":"这不是标准英语单词。它很可能是拼写错误或专有名词/用户名。常见的可能词包括 antigen（抗原，生物学）、ensign（海军/军衔或旗帜），或 assigned（被分配的/已指派的）。"},"examples":[{"en":"I couldn’t find “antsigne” in a dictionary—did you mean “antigen” or “ensign”?","zh":"我在词典里查不到“antsigne”——你想写的是“antigen”还是“ensign”吗？"}]}],"extraExplanation":["如果你能提供一句包含这个词的例句，或说明它出现在什么场景（课文、游戏ID、学术文章、照片里的标识等），我可以更准确地判断你想查的真正单词，并给出发音、释义和用法。","拼写上最接近的高频英语词之一是 antigen（抗原）；如果你是在生物/医学语境里看到的，很可能就是它。"]}
{"word":"Antsiranana","summary":{"en":"Antsiranana is a city and regional capital in northern Madagascar (formerly Diego-Suarez).","zh":"Antsiranana 是马达加斯加北部的一座城市与大区首府（旧称 Diego-Suarez）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in northern Madagascar, also the capital of the Diana Region; formerly known as Diego-Suarez.","zh":"马达加斯加北部城市，也是迪亚纳大区（Diana Region）的首府；旧称 Diego-Suarez（迭戈-苏亚雷斯）。"},"examples":[{"en":"Antsiranana is a port city on the northern tip of Madagascar.","zh":"Antsiranana 是马达加斯加最北端的一座港口城市。"},{"en":"We flew from Antananarivo to Antsiranana to visit the bay.","zh":"我们从塔那那利佛飞到 Antsiranana 去看海湾。"}]}],"synonyms":["Diego-Suarez","Diego Suarez"],"phonetic":"ˌæntˌsɪrəˈnɑːnə","extraExplanation":["Antsiranana 是马达加斯加的地名（专有名词），英文里通常首字母大写。它在历史上常被写作 “Diego-Suarez”（法语/葡语背景的旧称），在一些较旧的地图、文章或旅行资料中仍会看到这一名称。","发音方面，英语使用者有时会把重音放在中间音节附近；如果你在交流中不确定，对方通常也能通过上下文理解这是马达加斯加北部的城市。"]}
{"word":"Antsirane","summary":{"en":"Antsirane usually refers to Antsiranana, a northern port city in Madagascar (historically: Diego-Suarez).","zh":"Antsirane 通常指马达加斯加北部港口城市安齐拉纳（旧称：迭戈苏亚雷斯）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A place name referring to Antsiranana, a port city in northern Madagascar (also historically known as Diego-Suarez).","zh":"地名：指马达加斯加北部的港口城市安齐拉纳（历史上也常被称为迭戈苏亚雷斯 Diego-Suarez）。"},"examples":[{"en":"We flew to Antsirane (Antsiranana) to start our trip around northern Madagascar.","zh":"我们飞到 Antsirane（安齐拉纳），开始在马达加斯加北部的旅行。"},{"en":"Antsirane is known for its bay and nearby beaches.","zh":"Antsirane 以它的海湾和附近的海滩而闻名。"}]}],"synonyms":["Antsiranana","Diego-Suarez","Diego Suarez"],"phonetic":"/ˌænt.sɪr.əˈnɑː.nə/","extraExplanation":["“Antsirane”更常见的标准拼写是 **Antsiranana**（英语与法语资料中也常见旧称 **Diego-Suarez**）。如果你是在地图、旅游攻略或历史文本里看到“Antsirane”，它很可能是拼写变体、简写或误拼。","安齐拉纳位于马达加斯加最北端附近，拥有天然良港（安齐拉纳湾）。殖民与历史背景使得它在不同语言/时期出现不同名称，这也是地名混用的主要原因。"]}
{"word":"antsy","summary":{"en":"Antsy means nervous, restless, or impatient—unable to sit still or wait calmly.","zh":"Antsy 表示紧张、坐立不安或不耐烦，难以安静等待或放松。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Feeling nervous, restless, or impatient; unable to relax or sit still.","zh":"感到紧张、坐立不安或不耐烦；很难放松或安静待着。"},"examples":[{"en":"I get antsy before exams because I worry about making mistakes.","zh":"考试前我会坐立不安，因为我担心会犯错。"},{"en":"The kids became antsy during the long flight.","zh":"在漫长的飞行中，孩子们变得坐不住了。"},{"en":"She was antsy to hear the interview results.","zh":"她迫不及待（有点焦躁）想听到面试结果。"}]}],"synonyms":["restless","fidgety","impatient","jittery","on edge"],"phonetic":"/ˈæntsi/","extraExplanation":["“antsy”多用于口语，语气比较轻松，常形容“坐不住/心里发毛”的状态，不一定是严重的焦虑（anxious）。","常见搭配：get antsy（变得坐立不安）、feel antsy（觉得坐立不安）、be antsy about/over sth（因某事而焦躁）、be antsy to do sth（急着做某事）。","词源上通常认为和“ants（蚂蚁）”有关，形象地比喻“像身上有蚂蚁爬一样”难以安静；因此它带有生动、口语化的感觉。"]}

