{"word":"ANTU","summary":{"en":"ANTU/Antu is usually a proper name rather than a common English word; it can refer to Antü, a sun deity in Mapuche mythology, or it may be an acronym depending on context.","zh":"ANTU/Antu 通常不是常见英语词，而更像专有名词；它可能指马普切神话中的太阳神 Antü，也可能是某个缩写，具体含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a proper name (often seen as Antu or Antü), especially referring to a sun deity/spirit in Mapuche (southern Chile/Argentina) mythology","zh":"专有名词（常见拼写 Antu 或 Antü），尤其指智利/阿根廷南部马普切（Mapuche）神话中的太阳神/太阳精灵"},"examples":[{"en":"In Mapuche stories, Antu is connected with the power of the sun.","zh":"在马普切的故事里，Antu 与太阳的力量有关。"},{"en":"The novel mentions Antu as a symbol of light and warmth.","zh":"这部小说把 Antu 提到作为光与温暖的象征。"}]}],"phonetic":"/ˈæn.tuː/","extraExplanation":["“ANTU/Antu”在英语里并不是常见词汇，更常见的情况是：①作为人名/神名（如马普切神话中的 Antü）；②作为缩写（acronym），但不同领域含义可能完全不同，需要具体上下文（例如你在哪篇文章、哪个专业或哪个国家/机构里看到）。如果你告诉我出处句子，我可以帮你准确解释那个缩写代表什么。"]}
{"word":"antu","summary":{"en":"“Antu” is most commonly a proper name linked to the Sun in Mapuche mythology; otherwise, “antu” isn’t standard English and may be a misspelling or a name in context.","zh":"“Antu” 多见为马普切神话中与“太阳”相关的专名；除此之外，“antu” 不是标准英语词，可能是拼写误差或特定语境中的名字。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Antu: a proper name used in Mapuche mythology for the Sun (often treated as a sun deity).","zh":"Antu：马普切（Mapuche）神话中指“太阳”的专名（常被视为太阳神/太阳之神格）。"},"examples":[{"en":"In some retellings of Mapuche myths, Antu represents the Sun and its power.","zh":"在一些马普切神话的转述中，Antu 象征太阳及其力量。"},{"en":"The story mentions Antu as a central figure connected to daylight.","zh":"故事里提到 Antu，作为与白昼相关的核心人物。"}]},{"partOfSpeech":"other","definition":{"en":"antu: not a standard English word; it may be a misspelling (for example, “aunt,” “aunty/auntie”) or a name/acronym in a specific context.","zh":"antu：不是标准英语词；可能是拼写误差（如 aunt、aunty/auntie），或是在特定语境中的名字/缩写。"},"examples":[{"en":"Did you mean “aunt” (my aunt) or “aunty/auntie” (Auntie Lisa)?","zh":"你想写的是 “aunt”（我的阿姨/姑姑）还是 “aunty/auntie”（Lisa 阿姨）吗？"},{"en":"“Antu” could also be a person’s name, depending on the context.","zh":"“Antu” 也可能是人名，具体要看语境。"}]}],"phonetic":"/ˈæn.tuː/","extraExplanation":["在马普切文化中，Antu 常与太阳、光与权威等意象相关；不同资料对其是否被明确视为“神祇”、以及与其他角色的关系描述会有差异（取决于版本与译写）。","如果你是在写作/聊天中看到 “antu”，请给我一句原句或说明语境（例如国家、语言、主题），我可以帮你判断它到底指什么。"]}
{"word":"Antum","summary":{"en":"Antum is an Arabic word meaning “you (plural),” commonly written in English as a transliteration.","zh":"Antum 是阿拉伯语词，意思是“你们（复数）”，在英文中常以音译形式出现。"},"definitions":[{"partOfSpeech":"pron.","definition":{"en":"(Arabic) “you” addressed to a group of men, or a mixed group (plural).","zh":"（阿拉伯语）“你们”：用于称呼一群男性，或男女混合的一群人（复数）。"},"examples":[{"en":"Antum min ayna? (Where are you all from?)","zh":"Antum min ayna?（你们从哪里来？）"},{"en":"Antum Tayyibun. (You all are fine.)","zh":"Antum ṭayyibūn.（你们很好。）"}]},{"partOfSpeech":"other","definition":{"en":"A transliterated Arabic form used in English writing (especially in Islamic studies or language learning) to represent the Arabic word أَنْتُمْ.","zh":"一种在英文写作中常见的阿拉伯语音译形式（尤其在伊斯兰研究或阿语学习中），用来表示阿拉伯词 أَنْتُمْ。"},"examples":[{"en":"The text uses “antum” for the plural ‘you’ in Arabic.","zh":"这段文字用 “antum” 表示阿拉伯语里复数的“你们”。"}]},{"partOfSpeech":"n.","definition":{"en":"A given name in some cultures (often influenced by Arabic transliteration).","zh":"在一些文化中可作人名（常受阿拉伯语音译影响）。"},"examples":[{"en":"Antum is my classmate’s name.","zh":"Antum 是我同学的名字。"}]}],"synonyms":["you (plural)","you all","y’all"],"phonetic":"/ˈæn.tʊm/","extraExplanation":["“antum / أَنْتُمْ”属于阿拉伯语人称代词系统：它是第二人称复数（你们）。更细分时常被称为“阳性复数”，但在实际使用里也常用于男女混合的一群人（类似很多语言里以阳性形式作“默认复数”）。","如果你想表达“你们（全是女性）”，常见形式是 “antunna / أَنْتُنَّ”。表达“你们两个人”则常见 “antumā / أَنْتُمَا”。","在英语语境中看到 antum，通常是音译（transliteration），读法会因说话者的语言背景不同而略有差异。"]}
{"word":"antum","summary":{"en":"“Antum” is usually not standard English; it’s most commonly a misspelling of “anthem,” or it may be a proper name.","zh":"“Antum” 通常不是标准英语；最常见是 “anthem” 的拼写错误，或用作专有名词（名字）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling of “anthem” (a song of praise or a national song).","zh":"不是标准英语单词；最常见是把 “anthem”（赞歌/国歌）拼错成 “antum”。"},"examples":[{"en":"I think you mean “anthem,” not “antum.”","zh":"我想你想写的是 “anthem”，不是 “antum”。"},{"en":"They sang the national anthem before the game.","zh":"比赛开始前他们唱了国歌。"}]},{"partOfSpeech":"other","definition":{"en":"A proper name in some cultures (e.g., a given name or place name); meaning depends on the specific language or community.","zh":"在一些文化中可作专有名词（人名或地名等）；含义取决于具体语言或社群。"},"examples":[{"en":"Antum appears as a name in this story.","zh":"“Antum” 在这个故事里是一个名字。"}]}],"synonyms":["anthem (likely intended)"],"phonetic":"/ˈæntəm/","extraExplanation":["“antum”本身在现代英语词典里通常不作为常用词条出现。如果你是在作业/歌词/聊天里看到的，它很可能是把 “anthem” 拼错了（发音相近）。","如果你能告诉我你看到 “antum” 的句子或上下文，我可以更准确判断它指的是 “anthem”、某个专有名词，还是其他语言的借词。"]}
{"word":"Antung","summary":{"en":"Antung is an older English spelling for Dandong (丹东), a city on the China–North Korea border.","zh":"Antung 是丹东（丹东市）的旧式英文拼写，位于中朝边境鸭绿江畔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an older romanization of Dandong (丹东), a city in Liaoning Province, northeastern China, on the Yalu River across from North Korea (Sinuiju).","zh":"“Antung / 安东”是“丹东（Dandong）”的旧式英文拼写/转写方式，指中国辽宁省东北部的城市，位于鸭绿江畔，与朝鲜新义州隔江相望。"},"examples":[{"en":"The memoir mentions working in Antung near the Yalu River.","zh":"回忆录提到在鸭绿江附近的安东（Antung）工作。"},{"en":"Old maps label the border city as Antung, not Dandong.","zh":"老地图上常把这座边境城市标为安东（Antung），而不是丹东。"}]}],"synonyms":["Dandong","Andong (安东)"],"phonetic":"/ænˈtʊŋ/","extraExplanation":["“Antung/安东”在20世纪的英文资料里较常见，尤其是旧式拼音/邮政式拼写及日本占领时期相关文献中。1965年左右城市更名为“丹东”，现代英文一般使用 Dandong。"]}

