{"word":"Antwerp","summary":{"en":"Antwerp: a major port city in northern Belgium, famous for shipping and diamonds.","zh":"Antwerp：比利时北部的重要港口城市，以航运与钻石贸易闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A port city in northern Belgium (in the Flanders region), known for its major harbor on the River Scheldt, diamond trade, and important role in European commerce and culture.","zh":"安特卫普（比利时北部弗拉芒地区的港口城市），以斯海尔德河港口、钻石贸易以及在欧洲商业与文化中的重要地位而闻名。"},"examples":[{"en":"Antwerp is one of Europe’s busiest ports.","zh":"安特卫普是欧洲最繁忙的港口之一。"},{"en":"She traveled from Brussels to Antwerp by train.","zh":"她乘火车从布鲁塞尔到安特卫普。"},{"en":"The diamond district in Antwerp attracts buyers from around the world.","zh":"安特卫普的钻石区吸引了来自世界各地的买家。"}]}],"synonyms":["Antwerpen"],"phonetic":"/ˈænt.wɝːp/","extraExplanation":["“Antwerp”的荷兰语名称是“Antwerpen”。英语里“Antwerp”是最常见的写法。","安特卫普在16世纪曾是欧洲最富裕、最国际化的城市之一；艺术史上与巴洛克画家鲁本斯（Peter Paul Rubens）联系紧密。","常见搭配：Port of Antwerp（安特卫普港）、Antwerp diamond district（安特卫普钻石区）、Antwerp Central Station（安特卫普中央火车站）。"]}
{"word":"Antwerpen","summary":{"en":"Antwerpen is the Dutch name for Antwerp, a major port city (and also a province) in northern Belgium.","zh":"Antwerpen 是比利时北部重要港口城市 Antwerp（安特卫普）的荷兰语名称，也可指安特卫普省。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in northern Belgium (Flanders), known for one of Europe’s largest ports and its historic role in trade and diamond cutting; the Dutch name for Antwerp.","zh":"比利时北部（弗拉芒地区）的一座城市，以欧洲最大港口之一、历史上的贸易中心和钻石加工闻名；也是英语“Antwerp（安特卫普）”的荷兰语名称。"},"examples":[{"en":"I’m taking the train from Brussels to Antwerpen this afternoon.","zh":"我今天下午要坐火车从布鲁塞尔去安特卫普（Antwerpen）。"},{"en":"Antwerpen is famous for its port and its diamond district.","zh":"安特卫普以港口和钻石区闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"(also) the Belgian province surrounding the city; in Dutch, Provincie Antwerpen.","zh":"（也可指）安特卫普省：环绕该城市的比利时一个省份（荷兰语：Provincie Antwerpen）。"},"examples":[{"en":"She lives in the province of Antwerpen, not in the city center.","zh":"她住在安特卫普省，但不在市中心。"}]}],"synonyms":["Antwerp","Anvers"],"phonetic":"ˈæntwɝːpən","extraExplanation":["“Antwerpen”是荷兰语写法；法语常写作“Anvers”，英语通常用“Antwerp”。在比利时，同一地点因语言（荷兰语/法语/英语）不同而有不同名称，这很常见。","安特卫普在英语语境里常被称为“diamond capital（钻石之都）”之一，也以鲁本斯（Peter Paul Rubens）等艺术史背景和港口经济闻名。"]}
{"word":"antwise","summary":{"en":"Antwise means “like an ant; in an ant-like way.”","zh":"antwise 指“像蚂蚁一样；以蚂蚁的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In the manner of an ant; like ants do, often describing movement or behavior.","zh":"以蚂蚁的方式；像蚂蚁那样（常用来形容移动或行为）。"},"examples":[{"en":"From the balcony, the commuters below moved antwise through the crosswalks.","zh":"从阳台望下去，下面的通勤者像蚂蚁一样穿过人行横道。"},{"en":"The workers carried boxes antwise—small loads, steady steps, no stopping.","zh":"工人们像蚂蚁一样搬箱子——每次拿一点，步子稳，不停歇。"}]}],"synonyms":["antlike","like ants","in an ant-like way"],"phonetic":"/ˈænt.waɪz/","extraExplanation":["“antwise”由“ant（蚂蚁）+ -wise（以……方式）”构成，属于较少见、略带文学色彩的副词。","常见近似表达有：“like ants / in an ant-like way / antlike”。在正式写作中更常用“antlike”，而“antwise”更偏描写性、画面感强。"]}
{"word":"antwren","summary":{"en":"An antwren is a small tropical American insect-eating songbird in the antbird family.","zh":"antwren 指热带美洲一种小型食虫鸣禽，属于蚁鸟科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small insect-eating songbird from tropical America (family Thamnophilidae), often found in forest understory and known for quick, active movement while hunting insects.","zh":"（蚁鹪鹩）一种生活在热带美洲的小型食虫鸣禽（蚁鸟科），常在森林下层活动，捕食昆虫时动作敏捷。"},"examples":[{"en":"We spotted an antwren flitting through the dense understory.","zh":"我们看到一只蚁鹪鹩在茂密的林下灌丛间快速穿梭。"},{"en":"Antwrens often forage in pairs, picking insects off leaves and branches.","zh":"蚁鹪鹩常常成对觅食，从叶片和枝条上啄食昆虫。"}]}],"synonyms":["antbird (broader term)","Thamnophilidae (scientific family name)"],"phonetic":"/ˈæntˌrɛn/","extraExplanation":["“antwren”是常见名（common name），并不是“ant + wren（鹪鹩）”的直系亲缘组合；它们并非真正的鹪鹩科鸟类，而是蚁鸟科（antbirds）的一支。名称里的“ant-”与它们常在森林里捕食昆虫、也可能跟随军蚁活动的生态形象有关。","常见于中美洲与南美洲的热带雨林与林缘地带；不同种的英文名会更具体，如 white-flanked antwren（白胁蚁鹪鹩）、checker-throated antwren 等。"]}

