{"word":"ANU","summary":{"en":"ANU most commonly means the Australian National University; less commonly, it may refer to the ancient god Anu (usually written “Anu”).","zh":"ANU最常指澳大利亚国立大学；较少情况下也可能指古代神祇Anu（通常写作“Anu”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Acronym) The Australian National University, a major public research university in Canberra, Australia.","zh":"（缩写）澳大利亚国立大学：位于澳大利亚首都堪培拉的一所著名公立研究型大学。"},"examples":[{"en":"She received a scholarship to study at ANU.","zh":"她获得了奖学金去澳大利亚国立大学（ANU）学习。"},{"en":"ANU is well known for research in politics and science.","zh":"ANU以政治学和科学研究闻名。"}]},{"partOfSpeech":"other","definition":{"en":"(Rare in modern English; usually written “Anu”) The sky god and chief deity in ancient Mesopotamian religion.","zh":"（现代英语中较少用此全大写形式；通常写作 Anu）古代美索不达米亚宗教中的天神、至高神之一。"},"examples":[{"en":"In Mesopotamian mythology, Anu is associated with the sky.","zh":"在美索不达米亚神话中，Anu与天空相关。"},{"en":"The text mentions Anu alongside other gods.","zh":"文献中提到Anu以及其他神祇。"}]}],"synonyms":["Australian National University","A.N.U."],"phonetic":"/ˌeɪ.enˈjuː/","extraExplanation":["在英语里，ANU通常被理解为学校名称的缩写，写作全大写；读法多为逐字母读“A-N-U”。","如果你想表达神名，常见写法是首字母大写的“Anu”（而不是全大写ANU），以避免与学校缩写混淆。"]}
{"word":"anubin","summary":{"en":"Anubis is an ancient Egyptian god linked to mummification and the afterlife, often depicted with a jackal head.","zh":"阿努比斯是古埃及神祇，与木乃伊制作和来世相关，常被描绘为豺狼头。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Anubis (often misspelled as “anubin”): the ancient Egyptian god associated with mummification, embalming, and guiding souls to the afterlife, usually shown with a jackal head.","zh":"阿努比斯（常被误拼为“anubin”）：古埃及神祇，与木乃伊制作、防腐处理以及引导亡灵进入来世有关，常被描绘为豺狼头人身。"},"examples":[{"en":"In ancient Egyptian art, Anubis is often shown with a black jackal head.","zh":"在古埃及艺术中，阿努比斯常被描绘成黑色豺狼头。"},{"en":"The priest prayed to Anubis to protect the body during mummification.","zh":"祭司向阿努比斯祈祷，希望他在制成木乃伊的过程中保护遗体。"},{"en":"In many stories, Anubis guides the dead safely into the afterlife.","zh":"在许多故事里，阿努比斯会引导亡者平安进入来世。"}]}],"synonyms":["jackal-headed god","Egyptian god of mummification"],"phonetic":"/əˈnuːbɪs/","extraExplanation":["“anubin”通常不是标准拼写；更常见、正确的英文是 **Anubis**。","阿努比斯在古埃及宗教中与“亡灵审判/灵魂引导”相关：他常被视为墓地与防腐（embalming）的守护者。","在现代文化中，Anubis 经常出现在电影、游戏和小说里，常用来营造“古埃及、神秘、来世”氛围。"]}
{"word":"anubing","summary":{"en":"“Anubing” isn’t a recognized English word; it’s probably a misspelling or a name.","zh":"“anubing”不是常见或标准英文词；更可能是拼写错误或名字。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word (likely a misspelling, a name/username, or a made-up term).","zh":"不是标准英文单词（可能是拼写错误、名字/用户名，或自造词）。"},"examples":[{"en":"I can’t find “anubing” in an English dictionary—did you mean another word?","zh":"我在英文词典里找不到“anubing”——你是不是想写别的词？"},{"en":"“Anubing” looks like a username rather than a common English word.","zh":"“Anubing”看起来更像用户名，而不是常见英文单词。"}]}],"phonetic":"/əˈnuːbɪŋ/","extraExplanation":["“anubing”最常见的可能是把 **Anubis**（埃及神话中的胡狼头神，亡灵与防腐相关）拼错了；**Anubis** 的美式 IPA 常见读音是 /əˈnuːbɪs/。","也可能你想写的是 **a new being**（“一个新的存在/新人”）这一短语；如果你告诉我上下文句子，我可以帮你确认最合适的词。"]}
{"word":"Anubis","summary":{"en":"Anubis is the ancient Egyptian god linked to mummification and guiding the dead.","zh":"阿努比斯是古埃及与防腐、木乃伊制作及引导亡者相关的神祇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient Egyptian god associated with mummification, embalming, and guiding the dead to the afterlife, often shown with the head of a jackal.","zh":"阿努比斯：古埃及神祇，与木乃伊制作、遗体防腐以及引导亡者进入来世有关，常被描绘为豺狼头人身。"},"examples":[{"en":"In many tomb paintings, Anubis stands beside the mummy as a protector.","zh":"在许多墓室壁画中，阿努比斯站在木乃伊旁边作为守护者。"},{"en":"The story mentions Anubis guiding a soul safely into the underworld.","zh":"故事提到阿努比斯引导灵魂安全进入冥界。"}]}],"synonyms":["Anpu","Inpw"],"phonetic":"/əˈnuːbɪs/","extraExplanation":["“Anubis”源自希腊语拼写的形式；在古埃及语中常写作“Inpw/Anpu”。因豺狼常在墓地附近出没，古埃及人把“豺狼”的形象与守护墓葬、处理遗体的神联系起来。","在常见神话体系中，阿努比斯与“称心仪式”（Weighing of the Heart）有关：他会陪同亡者，见证心脏与“真理之羽”（玛亚特之羽）的衡量。","现代英文里“Anubis”多用于神话、历史、文学与游戏影视作品中作文化指涉，常带有“死亡、审判、守护墓地/亡灵”的象征意味。"]}
{"word":"anucleate","summary":{"en":"Anucleate describes something—especially a cell—that does not have a nucleus.","zh":"anucleate 用来描述（尤指细胞）没有细胞核的状态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a cell or structure) lacking a nucleus.","zh":"（细胞或结构）无细胞核的；没有细胞核的。"},"examples":[{"en":"Mature human red blood cells are anucleate, which leaves more room for hemoglobin.","zh":"成熟的人类红细胞是无核的，这样能为血红蛋白腾出更多空间。"},{"en":"Under the microscope, the lab confirmed the cells were anucleate.","zh":"在显微镜下，实验室确认这些细胞是无核的。"}]}],"synonyms":["non-nucleated","without a nucleus","enucleated (related but different; often means the nucleus was removed)"],"phonetic":"/ˌæn.jəˈkliː.ət/","extraExplanation":["这是一个生物学/医学词汇，常用于细胞学与组织学。最常见的例子是哺乳动物成熟红细胞（RBC），它们在发育过程中“挤出”细胞核，从而提高携氧效率，但也因此不能分裂、修复能力有限。","构词上：a- 表示“无/缺少”，nucle- 来自 nucleus（细胞核），-ate 形成形容词。注意不要与 enucleate（把细胞核去除/摘除）混淆。"]}
{"word":"anucleated","summary":{"en":"Anucleated means “without a nucleus,” especially describing cells (like mature red blood cells).","zh":"anucleated 意为“无核的”，常用于描述细胞（如成熟红细胞）没有细胞核。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology/medicine) Lacking a nucleus; having no cell nucleus.","zh":"（生物/医学）无核的；没有细胞核的。"},"examples":[{"en":"Mature human red blood cells are anucleated.","zh":"成熟的人类红细胞是无核的。"},{"en":"The stain helps distinguish anucleated cells from nucleated ones under the microscope.","zh":"这种染色有助于在显微镜下区分无核细胞与有核细胞。"}]}],"synonyms":["without a nucleus","enucleated"],"phonetic":"/əˈnuːkliˌeɪtɪd/","extraExplanation":["词源上，a- 表示“无/缺少”，nucle- 来自 nucleus（细胞核），-ated 构成形容词，整体意思就是“没有细胞核的”。","在医学或病理学语境中，anucleated 常用于描述红细胞、角质层细胞或某些异常细胞形态；是否“无核”往往与细胞功能、成熟阶段或疾病诊断有关。"]}
{"word":"anukabiet","summary":{"en":"“anukabiet” isn’t recognized as an English word; it likely needs context or corrected spelling.","zh":"“anukabiet”不是可识别的英语单词；可能需要上下文或更正拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username/product name, or a word from another language.","zh":"不是标准英语单词。可能是拼写错误、用户名/产品名，或来自其他语言的词。"},"examples":[{"en":"I can’t find “anukabiet” in major English dictionaries—could you share the sentence where you saw it?","zh":"我在主要英语词典里找不到“anukabiet”——你能把它出现的句子发我吗？"},{"en":"If you meant a different word, a small spelling change can make it recognizable.","zh":"如果你想写的是另一个词，稍微改一下拼写就可能能查到。"}]}],"phonetic":"/ˌænjuːkəˈbiːt/","extraExplanation":["我查不到“anukabiet”作为常见英文词条（也不像常见英语词根组合）。更可能是：①拼写错误；②专有名词（人名、地名、品牌、游戏/网名）；③其他语言的转写。","你可以提供：它出现的上下文句子、来源（网站/书/游戏/论文）、以及你想表达的大概意思。我也可以据此帮你判断它可能对应的正确拼写（例如你是不是想写某个以 an- / -diet / -quiet / -cabinet 等结尾的词）。"]}
{"word":"Anukit","summary":{"en":"Anukit is most commonly used as a Thai personal name.","zh":"Anukit 最常见的用法是泰国人的名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a personal name (given name), commonly found in Thailand; used for people and sometimes as a brand or username.","zh":"人名（名字），在泰国较常见；也可能被用作品牌名或用户名。"},"examples":[{"en":"Anukit is my colleague from Bangkok.","zh":"Anukit 是我来自曼谷的同事。"},{"en":"Please ask Anukit to join the meeting at 3 p.m.","zh":"请让 Anukit 下午三点参加会议。"},{"en":"I’m not sure how to pronounce Anukit—could you say it slowly?","zh":"我不确定 Anukit 怎么发音——你能慢慢说一遍吗？"}]}],"synonyms":["(proper name) given name","personal name"],"phonetic":"/ˌɑːnuːˈkɪt/","extraExplanation":["“Anukit”通常是从泰语音译成拉丁字母的拼写，因此不同人可能会有不同的罗马化写法与发音细节。","泰国人名常见特点：名字与姓氏的组合较固定；日常交流中也很常使用昵称（短名），即使在正式名字较长的情况下也是如此。","如果你是在证件、邮件或社交媒体上看到这个名字，最稳妥的做法是直接询问对方偏好的英文拼写大小写、重音位置与称呼方式（例如是否有昵称）。"]}
{"word":"anukit","summary":{"en":"Anukit is usually a person’s name, not an English dictionary word.","zh":"Anukit 通常是人名，而不是英语词典里的常规词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A personal name (proper noun). It is not a standard English vocabulary word; it is most commonly used as a given name in some Asian cultures (e.g., Thai). Meanings can vary by language and spelling.","zh":"人名（专有名词）。它不是标准英语词汇；更常见的是作为一些亚洲文化（如泰语）中的名字使用。其含义会因语言与拼写而变化。"},"examples":[{"en":"Anukit introduced himself at the meeting.","zh":"Anukit 在会议上做了自我介绍。"},{"en":"Please check the spelling of Anukit on the passport.","zh":"请核对护照上 Anukit 的拼写。"}]}],"phonetic":"/ˈɑːnuːkɪt/","extraExplanation":["“Anukit”更像音译的人名而不是英语单词，所以在英语里通常不翻译，只保留原拼写。","不同地区可能有不同的发音与含义；如果你告诉我它来自哪种语言（例如泰语、印地语等）或给出原文字母/拼写来源，我可以更准确地说明含义与读音建议。"]}
{"word":"anuloma","summary":{"en":"Anuloma is a Sanskrit-based term meaning “following the natural order/with the grain,” often used in Hindu/Buddhist or yoga contexts and contrasted with pratiloma.","zh":"Anuloma 源自梵语，意为“顺着自然次序/顺势而行（顺纹）”，常见于印度教、佛教或瑜伽语境，并常与 pratiloma（逆势）对比。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(from Sanskrit) following the natural or regular order; “with the grain.”","zh":"（源自梵语）顺着自然或正常的次序；“顺纹/顺势而行”。"},"examples":[{"en":"In some yoga texts, anuloma breathing is described as moving in the natural direction of the breath.","zh":"在一些瑜伽文本中，anuloma 呼吸被描述为顺着呼吸的自然方向进行。"},{"en":"The teacher contrasted anuloma (with the grain) with pratiloma (against the grain).","zh":"老师把 anuloma（顺势）与 pratiloma（逆势）作了对比。"}]},{"partOfSpeech":"n.","definition":{"en":"a term used in Hindu/Buddhist contexts for a practice or process that proceeds step by step in a proper sequence (often contrasted with pratiloma).","zh":"（印度教/佛教语境）指按正确次第循序推进的修行、过程或方法（常与 pratiloma“逆次第”相对）。"},"examples":[{"en":"The commentary explains anuloma as a gradual process that aligns with the expected stages of practice.","zh":"注释把 anuloma 解释为符合修行阶段、循序渐进的过程。"},{"en":"Some translations keep anuloma as a loanword to preserve its technical meaning.","zh":"有些译本保留 anuloma 这个外来词，以保留其术语含义。"}]}],"synonyms":["with the grain","in regular order","in sequence","gradual (in context)"],"phonetic":"ˌɑːnuˈloʊmə","extraExplanation":["Anuloma（梵语：अनुलोम）字面含义与“顺着毛/顺着纹理”有关，所以常被用来表示“顺向、顺序、合乎常规的进程”。其反义概念常见为 pratiloma（逆纹、逆向）。","在瑜伽语境里，它常出现在复合词中（例如与呼吸练习相关的表达）。不同传统对术语细节的用法可能不完全一致，阅读时可结合具体流派或经典注释来理解。"]}
{"word":"Anunaki","summary":{"en":"Anunnaki (often misspelled Anunaki) refers to a group of gods in ancient Mesopotamian mythology; in modern pop culture it can also mean alleged “alien” beings (a non-scholarly claim).","zh":"Anunnaki（常被误拼为 Anunaki）指古代美索不达米亚神话中的一组神祇；在现代流行文化中也可指被称为“外星人”的传说（非主流学术观点）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In ancient Mesopotamian mythology) a group of powerful deities, often described as gods of the underworld or judges of fate.","zh":"（古代美索不达米亚神话中）一组强大的神祇，常被描述为冥界之神或命运的审判者。"},"examples":[{"en":"In some stories, the Anunnaki decide the fate of humans and kings.","zh":"在一些故事里，Anunnaki 会决定人类和君王的命运。"},{"en":"The Anunnaki appear in texts from Sumer, Akkad, Assyria, and Babylonia.","zh":"Anunnaki 出现在苏美尔、阿卡德、亚述和巴比伦的文献中。"}]},{"partOfSpeech":"n.","definition":{"en":"(In modern popular culture and conspiracy theories) supposed ancient “alien” beings said to have influenced human civilization; this claim is not supported by mainstream scholarship.","zh":"（现代流行文化与阴谋论中）被说成影响人类文明的“古代外星人”；这一说法不被主流学术支持。"},"examples":[{"en":"Some videos online claim the Anunnaki were aliens who built early cities.","zh":"一些网络视频声称 Anunnaki 是建造早期城市的外星人。"},{"en":"Most historians treat these alien-Anunnaki stories as pseudoscience, not evidence-based history.","zh":"大多数历史学者把“外星 Anunnaki”的说法视为伪科学，而非有证据的历史。"}]}],"synonyms":["Mesopotamian gods","Sumerian deities","ancient deities"],"phonetic":"/əˈnuːnɑːki/","extraExplanation":["拼写提示：更常见的英文拼写是 **Anunnaki**（也见 Anunaki 这种简写/误拼）。","词源/语境：该词来自古代美索不达米亚诸语言传统，常被解释为与“天空之神安（An）/安努（Anu）的后代”相关。不同城邦与时期的文献中，其角色会变化，有时与其他神祇群体（如 Igigi）并列或对照。","阅读与辨析：学术语境里它是神话宗教概念；在网络语境里常被借用到“古代外星人”叙事。遇到该词时，建议结合出处判断是历史神话讨论还是流行阴谋论表达。"]}
{"word":"anunder","summary":{"en":"“anunder” is not a standard English word; it’s probably a typo for “under” or “an under- …” + noun.","zh":"“anunder”不是标准英语单词；多半是把“under”或“an under-…”（加名词）的形式写错/连写了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a mistaken spacing of common words such as “under” or the phrase “an under-…” (e.g., “an underdog,” “an underpass,” “an undergraduate”).","zh":"不是标准英语单词。很可能是拼写错误，或把常见词/短语写在一起了，比如“under”，或“an under- …”（如：an underdog / an underpass / an undergraduate）。"},"examples":[{"en":"I can’t find “anunder” in a dictionary—did you mean “under” or “an underpass”?","zh":"我在词典里找不到“anunder”——你是想写“under”还是“an underpass（地下通道）”吗？"},{"en":"If you meant “under,” you could say: The keys are under the book.","zh":"如果你想写“under”，你可以说：The keys are under the book.（钥匙在书下面。）"}]}],"phonetic":"ˈænˌʌndər","extraExplanation":["“under”是非常常见的介词/副词，表示“在……下面；少于；在（某种状态/控制）之下”等。","如果你能告诉我你看到“anunder”的句子或上下文（前后各1句），我可以帮你准确判断你想表达的是哪个词或短语，并给出正确用法。"]}
{"word":"Anunnaki","summary":{"en":"Anunnaki refers either to a group of deities in ancient Mesopotamian mythology, or (in modern pop culture) to a claimed ancient alien race.","zh":"Anunnaki（阿努纳奇）既可指古代美索不达米亚神话中的一群神祇，也可指现代流行文化中所谓“古代外星人”的说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in ancient Mesopotamian religion) a group of powerful deities associated especially with the underworld and the authority of the gods.","zh":"（古代美索不达米亚宗教中）一群重要的神祇，常与冥界及诸神的权威相关。"},"examples":[{"en":"In some Mesopotamian myths, the Anunnaki help decide the fate of humans.","zh":"在一些美索不达米亚神话中，阿努纳奇会参与决定人类的命运。"},{"en":"The Anunnaki appear in texts from Sumerian and Akkadian traditions.","zh":"阿努纳奇出现在苏美尔和阿卡德传统的文献中。"}]},{"partOfSpeech":"n.","definition":{"en":"(in modern pop culture and pseudoscientific claims) a supposed race of ancient extraterrestrials said to have influenced early human civilization.","zh":"（现代流行文化与伪科学说法中）被称为“古代外星种族”的存在，据称影响了早期人类文明。"},"examples":[{"en":"Some conspiracy theories claim the Anunnaki built ancient monuments.","zh":"一些阴谋论声称阿努纳奇建造了古代遗迹。"},{"en":"It’s helpful to separate the historical Anunnaki of myth from modern fictional versions.","zh":"把神话中的历史性“阿努纳奇”和现代虚构版本区分开来会更有帮助。"}]}],"synonyms":["Mesopotamian deities","gods","(variant) Annunaki"],"phonetic":"əˈnuːnɑːki","extraExplanation":["“Anunnaki”常见于英语的历史/神话语境，指美索不达米亚（苏美尔、阿卡德等）文献中的神祇群体，并非单一神名。","现代大众文化里，“Anunnaki=外星人”的叙事多源自20世纪一些作者的再解释与二次创作，学术界通常不将其视为可靠的历史结论。","拼写也常见变体：Annunaki（双n）。在检索学术资料时可同时搜索不同拼写。"]}
{"word":"Anura","summary":{"en":"Anura is the scientific order that includes frogs and toads.","zh":"Anura 指“无尾目”，是包含青蛙和蟾蜍的两栖动物分类单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific order (group) of amphibians that includes frogs and toads; adult animals usually have no tail","zh":"（生物学）无尾目：两栖动物的一个“目”，包括青蛙和蟾蜍；成体通常没有尾巴"},"examples":[{"en":"Frogs and toads belong to the order Anura.","zh":"青蛙和蟾蜍属于无尾目（Anura）。"},{"en":"In biology class, we learned that Anura is different from salamanders, which keep a tail.","zh":"在生物课上我们学到，无尾目（Anura）不同于蝾螈类，因为蝾螈会保留尾巴。"}]}],"synonyms":["Salientia (older term)"],"phonetic":"/əˈnʊrə/","extraExplanation":["“Anura”来自希腊语：an-（无、没有）+ oura（尾巴），字面意思就是“没有尾巴”。这也解释了为什么无尾目成体通常无尾，而蝌蚪（幼体）阶段常有尾巴。","在较老的分类中，你可能会看到“Salientia”作为近义（或近似）用法，但现代教材与论文中更常用“Anura”。"]}
{"word":"anura","summary":{"en":"Anura is the scientific group (order) that includes all frogs and toads.","zh":"Anura 指包含所有青蛙与蟾蜍的科学分类（无尾目）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific order of amphibians that includes frogs and toads (the “tailless” amphibians).","zh":"【生物学】无尾目；两栖动物的一个目，包括青蛙和蟾蜍等“无尾”的两栖类。"},"examples":[{"en":"Frogs and toads belong to the order Anura.","zh":"青蛙和蟾蜍属于无尾目（Anura）。"},{"en":"Many Anura species depend on clean wetlands for breeding.","zh":"许多无尾目物种依赖干净的湿地进行繁殖。"}]}],"synonyms":["frogs and toads (general term)","tailless amphibians (description)"],"phonetic":"/əˈnʊrə/","extraExplanation":["Anura 是分类学用语（一个“目”）。词源来自希腊语：an-（无、没有）+ oura（尾巴），字面意思是“没有尾巴”，用来区别有尾的两栖类（如蝾螈）。","日常英语里更常直接说 frogs 和 toads；Anura 多见于科学文章、自然纪录片解说或生物课本。"]}
{"word":"Anuradhapura","summary":{"en":"Anuradhapura is an ancient, historically important city in Sri Lanka known for major Buddhist sites.","zh":"Anuradhapura（阿努拉德普勒）是斯里兰卡一座重要的古城，以著名的佛教遗址闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient city in north-central Sri Lanka, famous for its Buddhist heritage and archaeological sites; it was one of the country’s early capitals.","zh":"斯里兰卡中北部的一座古城，以佛教文化遗产与考古遗址闻名；曾是斯里兰卡早期的首都之一。"},"examples":[{"en":"We visited Anuradhapura to see the ancient stupas and temples.","zh":"我们去阿努拉德普勒参观古老的佛塔和寺庙。"},{"en":"Anuradhapura is a UNESCO World Heritage Site in Sri Lanka.","zh":"阿努拉德普勒是斯里兰卡的联合国教科文组织世界遗产地。"}]}],"synonyms":["Sacred City of Anuradhapura","Anuradhapura (Sri Lanka)"],"phonetic":"əˌnʊrɑːdəˈpʊrə","extraExplanation":["“Anuradhapura”常被称为斯里兰卡“古都”之一，与波隆纳鲁瓦（Polonnaruwa）等古城并列。这里以大型佛塔（stupa）、古寺院遗址，以及与佛教传统相关的圣地而著名。","在旅游与历史语境中，你可能会看到它和“sacred city（圣城）”“ancient capital（古都）”“Buddhist pilgrimage（佛教朝圣）”等词一起出现。"]}
{"word":"Anurag","summary":{"en":"Anurag is a common Indian male name, linked to the idea of love or affection.","zh":"Anurag 是常见的印度男性名字，含义常与“爱、喜爱/深情”相关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a masculine given name, commonly used in India; it comes from Sanskrit and is associated with meanings like “love,” “affection,” or “passion.”","zh":"一个男性名字，在印度很常见；源自梵语，常被理解为“爱、喜爱、深情/热情”等含义。"},"examples":[{"en":"Anurag is my classmate from India.","zh":"Anurag 是我来自印度的同学。"},{"en":"Please welcome Anurag to the team.","zh":"请欢迎 Anurag 加入团队。"},{"en":"I’m not sure how to pronounce Anurag—could you say it for me?","zh":"我不太确定 Anurag 怎么读——你可以读给我听吗？"}]}],"phonetic":"/ˈɑnʊˌrɑɡ/","extraExplanation":["在英语语境里，Anurag 通常作为专有名词（人名）使用，不翻译含义也完全可以；正式场合可直接按其本人习惯的拼写与读音来称呼。","不同地区/个人的读音可能略有差异；如果不确定，礼貌地询问对方“How do you pronounce your name?”很常见也很尊重。"]}
{"word":"anural","summary":{"en":"Anural means “having no external ears; earless,” usually describing animals.","zh":"anural 指“无外耳的、没有耳廓的”，多用于描述动物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of an animal) having no external ears; earless.","zh":"（多指动物）无外耳的；没有耳朵（外耳）的。"},"examples":[{"en":"Many seals look almost anural because they don’t have visible ear flaps.","zh":"许多海豹看起来几乎是“无外耳的”，因为它们没有明显的耳廓。"},{"en":"The snake is anural, but it can still sense vibrations in the ground.","zh":"蛇是无外耳的，但它仍能感知地面的震动。"}]}],"synonyms":["earless","without external ears"],"phonetic":"/æˈnjʊrəl/","extraExplanation":["“anural”主要用于生物学/动物学语境，强调“没有可见的外耳（ear flap / pinna）”。有些动物看起来像“anural”，但并不一定完全没有听觉能力，只是外耳结构不同或不明显。","词形结构：an-（表示“无、缺乏”）+ aural（与“耳/听觉”有关）。注意不要和“aural”（听觉的）或“oral”（口头的）混淆。"]}
{"word":"anuran","summary":{"en":"An “anuran” is a frog or toad, or anything related to them (order Anura).","zh":"“anuran”指无尾目动物（青蛙或蟾蜍），也可作形容词表示“与无尾目有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a frog or toad; any member of the amphibian order Anura (animals that are typically tailless as adults).","zh":"无尾目两栖动物；泛指青蛙或蟾蜍（成体通常没有尾巴）。"},"examples":[{"en":"Frogs and toads are both anurans, even though they look different.","zh":"青蛙和蟾蜍都属于无尾目，尽管它们看起来不一样。"},{"en":"The biologist recorded the calls of local anurans after sunset.","zh":"生物学家在日落后记录了当地无尾目动物的鸣叫。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to frogs and toads (the order Anura).","zh":"与青蛙和蟾蜍（无尾目）有关的；无尾目的。"},"examples":[{"en":"Anuran conservation is important because many species are sensitive to pollution.","zh":"无尾目动物的保护很重要，因为许多物种对污染很敏感。"},{"en":"The report focuses on anuran habitats in wetlands.","zh":"这份报告关注湿地中的无尾目动物栖息地。"}]}],"synonyms":["frog","toad","amphibian"],"phonetic":"əˈnʊrən","extraExplanation":["“Anuran”来自“Anura”，源于希腊语：an-（无）+ oura（尾），意思是“无尾”。因此它常用于学术或科普语境，比直接说 frog/toad 更偏“分类学/生物学”表达。","在英语里，toad（蟾蜍）并不是严格的分类学名称；很多“蟾蜍”其实仍属于无尾目，只是外形（如皮肤较粗糙、腮腺明显）和生活习性上常被俗称为 toad。"]}
{"word":"anurans","summary":{"en":"Anurans are frogs and toads (order Anura).","zh":"anurans 指无尾目动物，即青蛙和蟾蜍这一类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Frogs and toads as a group; amphibians in the scientific order Anura.","zh":"无尾目动物（青蛙和蟾蜍的统称）；两栖动物中“无尾目（Anura）”这一类群。"},"examples":[{"en":"Anurans include both frogs and toads.","zh":"无尾目动物既包括青蛙也包括蟾蜍。"},{"en":"Many anurans breed in ponds after heavy spring rains.","zh":"许多无尾目动物会在春季大雨后到池塘里繁殖。"},{"en":"Scientists monitor local anurans to understand wetland health.","zh":"科学家会监测当地的无尾目动物，以了解湿地的健康状况。"}]}],"synonyms":["frogs","toads","amphibians"],"phonetic":"/əˈnʊrænz/","extraExplanation":["“anuran”是生物学/动物学里的正式术语，日常英语中人们更常说frogs（青蛙）或toads（蟾蜍）。","词源来自希腊语：an-（无）+ oura（尾），字面意思是“没有尾巴的”，因为成体青蛙/蟾蜍没有尾巴。幼体（蝌蚪）有尾巴，但变态后消失。","写作中常见搭配：anuran species（无尾目物种）、anuran calls（蛙鸣）、anuran populations（无尾目种群）。"]}
{"word":"anureses","summary":{"en":"“Anureses” is the plural form of “anuresis,” meaning little or no urine production (a medical term).","zh":"“anureses”是“anuresis”的复数，指尿液产生极少或几乎没有（医学用语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of anuresis: a medical condition in which the kidneys produce little or no urine.","zh":"anuresis 的复数：一种医学状况，指肾脏产生的尿液极少或几乎没有。"},"examples":[{"en":"In severe dehydration or shock, anureses may occur and require emergency treatment.","zh":"在严重脱水或休克时，可能出现无尿/极少尿（anureses），需要紧急治疗。"},{"en":"The doctor monitored the patient’s fluid balance because of repeated anureses.","zh":"由于反复出现无尿/极少尿的情况，医生监测了患者的出入量平衡。"}]}],"synonyms":["anuria (common clinical term)","absence of urination (general wording)"],"phonetic":"/ˌæn.jʊˈriː.siːz/","extraExplanation":["“anureses”比较少见，多数情况下更常写单数“anuresis”，或直接用更常用的临床术语“anuria（无尿）”。","相关区分：anuria（几乎完全无尿，常见定义为24小时尿量＜约100 mL）；oliguria（少尿，尿量减少但未到无尿）；urinary retention（尿潴留，尿在膀胱里排不出来，不等于肾脏不产尿）。","这是医学用词，常出现在病历、研究文章或急诊场景；日常英语中不常用。"]}
{"word":"anuresis","summary":{"en":"Enuresis is the medical term for involuntary urination, especially bedwetting during sleep.","zh":"Enuresis 是“遗尿”的医学用语，常指睡眠时尿床。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) involuntary urination, especially during sleep; bedwetting.","zh":"（医学）遗尿；尤指睡眠时不自主排尿（常说“尿床”）。"},"examples":[{"en":"The doctor diagnosed the child with nocturnal enuresis (bedwetting).","zh":"医生诊断这个孩子患有夜间遗尿（尿床）。"},{"en":"Stress can sometimes make enuresis worse.","zh":"压力有时会让遗尿更严重。"}]}],"synonyms":["bedwetting","nocturnal enuresis","involuntary urination"],"phonetic":"/ˌɛn.jəˈriː.sɪs/","extraExplanation":["你输入的 **anuresis** 多半是把 **enuresis** 拼错了。英语里更常见、标准的医学词是 **enuresis**（遗尿/尿床）。","相关词：**nocturnal enuresis**（夜间遗尿）、**diurnal enuresis**（日间遗尿）。日常表达常说 **bedwetting**（尿床）。","这是常见的儿童问题，也可能与睡眠、发育、压力或泌尿系统因素有关；若影响生活或持续存在，通常建议咨询医生。"]}
{"word":"anuretic","summary":{"en":"Anuretic means medically “related to or causing anuria,” i.e., no urine output.","zh":"Anuretic 是医学用语，表示“与无尿有关或导致无尿”，即没有尿量。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medical) Related to, causing, or characterized by anuria (no urine production).","zh":"（医学）与无尿有关的；引起无尿的；表现为无尿的。"},"examples":[{"en":"After the surgery, the patient became anuretic and needed urgent evaluation.","zh":"手术后，病人出现无尿，需要紧急评估。"},{"en":"The doctor monitored for anuretic signs such as no urine output over several hours.","zh":"医生监测无尿的迹象，例如数小时内没有尿量。"}]}],"synonyms":["anuric","urine-free (less common)"],"phonetic":"/ˌæn.jəˈrɛt.ɪk/","extraExplanation":["在临床英语里更常见的词是 **anuric**（无尿的）。**anuretic** 也可见于医学写作，但使用频率较低。","不要和 **diuretic**（利尿的/利尿剂）混淆：diuretic 是“促进排尿”，anuretic 是“无尿/不排尿”。","相关概念：**oliguria**（少尿）指尿量明显减少，但不是完全没有。"]}
{"word":"anuria","summary":{"en":"Anuria means producing no urine (or almost none), often a sign of serious kidney problems or urinary blockage.","zh":"Anuria 指“无尿症”，即几乎不产生尿液，常提示严重肾脏问题或尿路梗阻。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical condition in which a person produces no urine, or almost none (typically less than about 100 mL per day), usually due to kidney failure or blockage","zh":"无尿症：几乎不产生尿液的医学状况（通常指每日少于约100毫升），常由肾功能衰竭或尿路梗阻引起"},"examples":[{"en":"The doctor suspected anuria because the patient had produced almost no urine for 24 hours.","zh":"医生怀疑是无尿症，因为患者在24小时内几乎没有排尿。"},{"en":"Severe dehydration or kidney damage can lead to anuria and requires urgent care.","zh":"严重脱水或肾损伤可能导致无尿症，需要紧急处理。"}]}],"synonyms":["absence of urine","suppression of urine"],"phonetic":"/æˈnjʊriə/","extraExplanation":["在临床上常与 oliguria（少尿）对比：少尿是尿量明显减少，但仍有尿；无尿则是几乎完全没有尿。","常见原因包括：急性肾损伤、严重休克导致肾灌注不足、双侧输尿管梗阻、膀胱出口梗阻等；出现无尿通常属于危急信号，应尽快就医。","词源：来自希腊语前缀 an-（“无、缺乏”）+ -uria（“尿”）。"]}
{"word":"anurias","summary":{"en":"“Anuria” (plural: anurias) means producing no urine or almost none—often a medical emergency.","zh":"“anuria”（复数 anurias）指无尿或几乎无尿，常提示紧急的医学问题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the absence of urine production (or almost none), usually a serious medical sign","zh":"无尿（几乎不产生尿液），通常是严重的医学征象"},"examples":[{"en":"The doctor suspected anuria after the patient produced almost no urine for 24 hours.","zh":"病人在24小时内几乎没有排尿，医生怀疑是无尿。"},{"en":"Anuria can be a sign of acute kidney failure and needs urgent care.","zh":"无尿可能是急性肾衰竭的信号，需要紧急处理。"}]}],"synonyms":["absence of urine output","suppression of urine (medical)"],"phonetic":"əˈnjʊriə","extraExplanation":["“anuria”的词根来自：an-（表示“没有”）+ -uria（与“尿、排尿”有关）。复数形式是“anurias”。","医学上常把“anuria（无尿）”与“oliguria（少尿）”区分：无尿强调几乎完全没有尿液产生；少尿则是尿量明显减少但仍有尿。","如果在日常语境中出现“anuria/anurias”，通常来自病历、医学文章或新闻报道，属于偏专业词汇。"]}
{"word":"anuric","summary":{"en":"Anuric describes a medical condition where someone produces almost no urine.","zh":"anuric 指医学上的“无尿/几乎无尿”的状态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Producing little or no urine.","zh":"无尿的；尿量极少或几乎没有尿排出的。"},"examples":[{"en":"The patient became anuric after severe dehydration.","zh":"严重脱水后，这位病人出现了无尿。"},{"en":"Doctors monitored her closely when she turned anuric, because it can signal kidney failure.","zh":"当她出现无尿时，医生密切监测，因为这可能提示肾衰竭。"}]}],"synonyms":["without urine output","not producing urine"],"phonetic":"/æˈnjʊrɪk/","extraExplanation":["“anuric”主要用于医学语境，常与“acute kidney injury（急性肾损伤）”“kidney failure（肾衰竭）”“dialysis（透析）”等话题一起出现。日常英语里较少用。","词源提示：前缀“an-”表示“无/缺乏”（如 anemia 贫血），词根与“ur- / urine（尿）”相关，因此整体含义可理解为“没有尿的”。","相关词：anuria（n. 无尿）；oliguria（n. 少尿，尿量减少但不是“无尿”）；urinary retention（尿潴留，尿在膀胱里排不出来，与“无尿”成因可能不同）。"]}
{"word":"anurous","summary":{"en":"Anurous means “tailless,” especially referring to frogs and toads (Anura).","zh":"anurous 表示“无尾的”，尤指青蛙、蟾蜍等无尾目（Anura）动物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of an amphibian) tailless; relating to frogs and toads (the group Anura).","zh":"（指两栖动物）无尾的；与青蛙、蟾蜍（无尾目 Anura）有关的。"},"examples":[{"en":"Adult frogs are anurous amphibians because they do not have tails.","zh":"成年青蛙属于无尾两栖动物，因为它们没有尾巴。"},{"en":"The researcher compared anurous calls to identify different frog species.","zh":"研究人员比较无尾类动物的鸣叫声来辨别不同的蛙类物种。"},{"en":"In the pond, we observed anurous larvae developing into tailless adults.","zh":"在池塘里，我们观察到无尾类的幼体发育成无尾的成体。"}]}],"synonyms":["tailless","anuran"],"phonetic":"əˈnʊrəs","extraExplanation":["词源来自希腊语：an-（“没有”）+ oura（“尾巴”），字面意思就是“没有尾巴的”。","常见于生物学/动物学语境，尤其用来描述“无尾目（Anura）”这一类群；日常英语里更常直接说 frogs/toads 或 tailless amphibians。"]}
{"word":"anury","summary":{"en":"Anury is a rare term meaning little or no urine production (more commonly called anuria).","zh":"anury 是较少见的说法，指“无尿/几乎不排尿”（更常用 anuria）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) A condition in which a person produces little or no urine; failure of the kidneys to make urine.","zh":"（医学）无尿；几乎不产生或不排出尿液的状况，常与肾功能严重受损有关。"},"examples":[{"en":"The doctor treated the patient urgently because anury can be a sign of acute kidney failure.","zh":"医生紧急处理，因为无尿可能是急性肾衰竭的信号。"},{"en":"If you have anury, seek medical help immediately rather than waiting at home.","zh":"如果出现无尿，应立即就医，不要在家等待。"}]}],"synonyms":["anuria","absence of urination","no urine output"],"phonetic":"/ˈæn.jə.ri/","extraExplanation":["“anury”在日常英语中非常少见；更常用、更标准的医学术语是“anuria”。如果你是在医学文章里看到的，通常指“无尿”，属于需要紧急评估的症状（可能与脱水、休克、尿路梗阻或肾脏损伤等有关）。","词源上，前缀“an-”表示“无/缺乏”，与“anemia（贫血）”“asymmetry（不对称）”里的否定含义相似。"]}
{"word":"anus","summary":{"en":"Anus: the anal opening where waste leaves the body.","zh":"Anus：肛门，排出粪便的开口。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The opening at the end of the digestive tract where solid waste leaves the body; the anal opening.","zh":"肛门；消化道末端排出粪便的开口。"},"examples":[{"en":"The doctor examined the patient’s anus to check for hemorrhoids.","zh":"医生检查了病人的肛门，以确认是否有痔疮。"},{"en":"Pain around the anus can have many causes, so it’s best to see a clinician.","zh":"肛门周围疼痛可能有很多原因，最好去看医生。"}]}],"synonyms":["anal opening","anal orifice"],"phonetic":"/ˈeɪnəs/","extraExplanation":["“anus”是医学/解剖学中的中性正式用词；日常对话里较少直接使用。很多口语或俚语会用更粗俗的词来指代这一部位，但在医疗、科普或正式写作中建议使用“anus/anal”。","相关形容词是“anal”（与肛门有关的），如“anal pain（肛门疼痛）”“anal exam（肛门检查）”。"]}
{"word":"anuses","summary":{"en":"“Anuses” is the plural form of “anus,” meaning the body’s anal opening.","zh":"“anuses”是“anus”的复数，指人体（或动物）的肛门开口。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of anus: the opening at the end of the digestive tract where stool leaves the body.","zh":"anus 的复数：消化道末端的开口，粪便从此排出体外。"},"examples":[{"en":"In anatomy class, we learned that humans have one anus, while some animals have different structures.","zh":"在解剖课上，我们学到人类只有一个肛门，而一些动物的结构有所不同。"},{"en":"The doctor examined the area around the patient’s anus for irritation.","zh":"医生检查了病人肛门周围是否有刺激或发炎。"}]}],"synonyms":["anal openings","rectal openings"],"phonetic":"/ˈeɪnəsɪz/","extraExplanation":["“anuses”是名词“anus”的规则复数形式（在词尾加 -es），读音也会变成 /-ɪz/ 的结尾音。","该词属于医学/解剖学用语；日常口语更常用“butt(ocks)”（比较口语）或“rear end”（较委婉），但在医疗场景中用“anus/anuses”更准确。"]}
{"word":"anusim","summary":{"en":"Anusim refers to Jews forced to convert—especially in Spain/Portugal—and sometimes their descendants reconnecting with Judaism.","zh":"Anusim指被迫改宗的犹太人（尤指西班牙/葡萄牙历史背景），也可指其后代重新连接犹太传统的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) Jews who were forced to convert to another religion—especially to Christianity in medieval Spain and Portugal—but often kept Jewish identity or practices in secret; also called “crypto-Jews” in some contexts.","zh":"（历史）被迫改信其他宗教的人，尤指中世纪西班牙与葡萄牙被迫改宗基督教的犹太人；其中一些人暗中保留犹太身份或习俗。"},"examples":[{"en":"Some historians study the Anusim to understand how forced conversion shaped family life and identity.","zh":"一些历史学家研究“Anusim”，以了解强制改宗如何影响家庭生活与身份认同。"},{"en":"In certain communities, people trace their ancestry to the Anusim of Iberia.","zh":"在一些社群中，人们追溯自己的祖先为伊比利亚半岛的“Anusim”。"}]},{"partOfSpeech":"n.","definition":{"en":"In modern usage, a term some people use for descendants of those forced converts who are reconnecting with Judaism.","zh":"（现代用法）一些人用来指被迫改宗者的后代，尤其是正在重新与犹太教建立联系的人。"},"examples":[{"en":"She joined a cultural group for descendants of the Anusim who are learning about Jewish traditions.","zh":"她加入了一个面向“Anusim”后代的文化团体，学习犹太传统。"},{"en":"The word Anusim is sometimes used in discussions about heritage and return.","zh":"“Anusim”一词有时会出现在关于族裔传承与回归的讨论中。"}]}],"synonyms":["forced converts","crypto-Jews (context-dependent)","conversos (related, broader)"],"phonetic":"/ˌɑːnuːˈsiːm/","extraExplanation":["“Anusim”源自希伯来语，单数常写作 *anus*（意为“被迫的人”），复数为 *anusim*。英语里多用于历史与族裔身份语境。","相关词：*Conversos*（西语/葡语，指改宗者，含自愿与被迫的复杂情况）、*Marranos*（历史上对一些改宗犹太人的旧称，现代常被视为带侮辱色彩，使用需谨慎）、*crypto-Jews*（“隐秘的犹太人”，强调暗中守传统）。","发音上英语通常按“ah-noo-SEEM”来读；作为外来词，大小写与拼写在不同资料中可能略有差异。"]}
{"word":"Anuska","summary":{"en":"Anuska is a female given name, often a variant spelling of Anushka.","zh":"Anuska 是一个女性名字，常被视为 Anushka 的拼写变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A feminine given name (first name). It is a less common spelling variant of “Anushka,” used in several cultures (especially South Asian and Slavic contexts).","zh":"女性名字（名）。是较少见的拼写形式，常被视为 “Anushka” 的变体，在一些文化中使用（尤其与南亚、斯拉夫语境相关）。"},"examples":[{"en":"Anuska introduced herself on the first day of class.","zh":"Anuska 在开学第一天做了自我介绍。"},{"en":"I met Anuska at a conference in Mumbai.","zh":"我在孟买的一场会议上认识了 Anuska。"}]}],"synonyms":["Anushka","Anoushka"],"phonetic":"/əˈnuʃkə/","extraExplanation":["“Anuska/Anushka”常被认为与“Anna/Anya”的昵称体系有关（在俄语等斯拉夫语境里，-shka 是一种亲昵称呼的后缀）；在南亚语境中也常见作人名，拼写可能因转写方式不同而变化（如 Anushka、Anuska）。","作为人名时，发音与拼写在不同地区会略有差异；英语语境中常见的读法接近“uh-NOOSH-kuh”。"]}
{"word":"anusvara","summary":{"en":"Anusvara is an Indic (especially Sanskrit) nasalization marker—often written as a dot ‘ं’—and it can also refer to the nasal sound it represents.","zh":"Anusvara 是印度语系（尤其梵语）中表示鼻音化的符号（常写作“ं”），也可指它所代表的鼻音。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Sanskrit and other Indic languages, a sound or sign that indicates nasalization, often written as a dot above a letter (e.g., Devanagari ‘ं’) and commonly transliterated as ‘ṃ’.","zh":"在梵语及其他印度语中，表示鼻音化的语音或符号，常写作字母上方的一个点（如天城文“ं”），拉丁转写常写作“ṃ”。"},"examples":[{"en":"In Devanagari, anusvara is usually shown as a dot above the line: ‘ं’.","zh":"在天城文中，anusvara 通常写作横线上方的一个点：“ं”。"},{"en":"The transliteration ‘saṃskṛta’ uses anusvara to show a nasal sound.","zh":"转写“saṃskṛta”用 anusvara 来表示一个鼻音。"}]},{"partOfSpeech":"n.","definition":{"en":"The actual nasal sound produced because of this marker, sometimes varying with the following consonant in pronunciation.","zh":"由该标记引起的实际鼻音（发音时有时会受后面辅音影响而变化）。"},"examples":[{"en":"In some contexts, the anusvara is pronounced more like the nasal of the next consonant.","zh":"在某些语境中，anusvara 的读音更接近后面辅音对应的鼻音。"}]}],"synonyms":["anusvāra","nasalization marker","nasal dot","ṃ (transliteration)"],"phonetic":"/ˌʌnʊˈsvɑrə/","extraExplanation":["“Anusvara”来自梵语：anu-（“跟随、随后”）+ svara（“声音”），字面意思接近“跟随的声音”。","在不同印度文字/语言里，anusvara 的规则不完全一致：有时表示纯粹的鼻化（类似把元音“鼻音化”），有时相当于一个具体的鼻音辅音（如 /m/ 或与后续辅音同部位的鼻音）。","在学术写作中常用带点的 m（ṃ）来转写；你也可能看到拼写为 anusvāra（长音标记 ā）。"]}
{"word":"anutraminosa","summary":{"en":"“anutraminosa” doesn’t appear to be a recognized English word; it’s likely a misspelling or a name/term from another context.","zh":"“anutraminosa”看起来不是英语常用词；更可能是拼写错误或来自其他语境的名称/术语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a brand/proper name, or a term from another language (for example, Latin-based scientific naming).","zh":"不是标准英语单词。可能是拼写错误、品牌/专有名词，或来自其他语言的词（例如拉丁语风格的科学命名）。"},"examples":[{"en":"I couldn’t find “anutraminosa” in an English dictionary—could you check the spelling?","zh":"我在英语词典里找不到“anutraminosa”——你能确认一下拼写吗？"},{"en":"Where did you see the word “anutraminosa” (a label, a paper, or a website)?","zh":"你是在哪里看到“anutraminosa”的（标签、论文还是网站）？"}]}],"phonetic":"/əˌnuːtrə mɪˈnoʊzə/","extraExplanation":["从拼写结构看（-minosa 这类结尾），它有点像拉丁语/医学或植物学术语，但在常用英语中不常见。","如果你能提供：①出现它的句子/图片；②你想表达的意思（例如“营养”“矿物质”“某种植物/药物/品牌”）；我可以更准确地判断它是不是某个英文词的拼写错误，并给出正确拼写与用法。","常见可能的相关词方向：nutrition（营养）、nutrient（营养物）、minerals（矿物质）、anatomy（解剖学）等，但需要上下文才能确定。"]}
