{"word":"anvasser","summary":{"en":"A canvasser is someone who visits people (often door to door) to ask for votes, support, signatures, or sales.","zh":"Canvasser 指走访他人（常挨家挨户）以争取选票、支持、签名或推销的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who goes from place to place (often door to door) to ask for something, especially votes, support, signatures, or sales","zh":"（常挨家挨户）走访拜访以争取某事的人，尤指拉票、争取支持、征集签名或推销的人"},"examples":[{"en":"The campaign hired canvassers to talk to voters in local neighborhoods.","zh":"竞选团队雇了拉票员去社区和选民交谈。"},{"en":"A canvasser knocked on our door to ask if we would sign the petition.","zh":"一位征集签名的人敲门问我们是否愿意在请愿书上签名。"},{"en":"She worked as a canvasser for a charity fundraiser during the summer.","zh":"她夏天在一次慈善筹款活动中做走访募捐人员。"}]}],"synonyms":["campaigner","solicitor","door-to-door representative","petitioner","sales representative"],"phonetic":"ˈkæn.və.sɚ","extraExplanation":["你输入的 **anvasser** 很可能是拼写错误；常见正确拼写是 **canvasser**。","**canvasser** 来自动词 **canvass**（走访、游说、征求意见/支持）。在美国语境里，它常与选举有关（door-to-door canvassing），也可指推销或民意调查的走访人员。"]}
{"word":"Anvers","summary":{"en":"Anvers is the French name for Antwerp in Belgium.","zh":"Anvers 是比利时城市安特卫普（Antwerp）的法语名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the French name for Antwerp, a major port city in Belgium","zh":"安特卫普（Antwerp）的法语名称，比利时的重要港口城市"},"examples":[{"en":"The train from Brussels to Anvers takes about an hour.","zh":"从布鲁塞尔到安特卫普（Anvers）的火车大约需要一小时。"},{"en":"In French, Antwerp is called Anvers.","zh":"在法语里，Antwerp 叫 Anvers。"}]}],"synonyms":["Antwerp","Antwerpen"],"phonetic":"/ˈæn.vərz/","extraExplanation":["“Anvers”常见于法语语境（如法国/比利时法语媒体、法语地图与车站指示）。在荷兰语中安特卫普叫“Antwerpen”，英语最常用“Antwerp”。","比利时的官方语言包括荷兰语与法语，因此同一城市常有不同语言的名称；旅行或读新闻时看到不同名称指的是同一地点。"]}
{"word":"Anvik","summary":{"en":"Anvik is the name of a small city/community in western Alaska on the Yukon River.","zh":"Anvik 是美国阿拉斯加州育空河畔的一个小城市／社区名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small city (community) in western Alaska, USA, located on the Yukon River.","zh":"（美国）阿拉斯加州西部育空河畔的一座小城市／社区，名为 Anvik。"},"examples":[{"en":"Anvik is a small community on the Yukon River in Alaska.","zh":"Anvik 是阿拉斯加育空河上的一个小社区。"},{"en":"She flew from Anchorage to Anvik on a small plane.","zh":"她从安克雷奇搭小飞机飞到 Anvik。"}]}],"phonetic":"/ˈæn.vɪk/","extraExplanation":["Anvik 是专有名词（地名），日常对话中多出现在旅游、地理、航班/交通、阿拉斯加原住民与北极地区生活等语境里。","这类地名在英语中通常不翻译含义，而是音译；写作时一般首字母大写：Anvik。"]}
{"word":"anvil","summary":{"en":"An anvil is a heavy metal block used for shaping metal; figuratively, it can mean something or someone that takes a lot of pressure or blame.","zh":"anvil 指铁匠用来敲打塑形金属的铁砧；也可比喻承受巨大压力或责难的对象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A heavy iron or steel block with a flat top (often with a horn-shaped end), used by blacksmiths as a surface for hammering and shaping hot metal.","zh":"（铁匠用的）铁砧；砧子：一种沉重的铁或钢块，上面平坦（常有角状凸起），用于敲打和塑形加热后的金属。"},"examples":[{"en":"The blacksmith heated the horseshoe and shaped it on the anvil.","zh":"铁匠把马蹄铁加热后，在铁砧上把它敲打成形。"},{"en":"The hammer struck the anvil with a loud ring.","zh":"铁锤敲在铁砧上，发出响亮的金属声。"}]},{"partOfSpeech":"n.","definition":{"en":"A situation or person that receives heavy pressure, blame, or repeated attacks; a target or burden.","zh":"（比喻）承受巨大压力/责难/反复打击的对象；“挨打的靶子”、负担。"},"examples":[{"en":"He became the anvil for everyone’s frustration at work.","zh":"他成了办公室里大家情绪发泄的“出气筒”。"},{"en":"Small businesses are often the anvil between rising costs and falling demand.","zh":"小企业常常夹在成本上升与需求下降之间，承受两头挤压。"}]}],"synonyms":["forge block","blacksmith’s anvil","target (figurative)","scapegoat (figurative)"],"phonetic":"/ˈæn.vɪl/","extraExplanation":["“anvil”常出现在习语“on the anvil”，意思是“正在制作中/正在筹备中”（像金属正在铁砧上被打造）。例如：A new plan is on the anvil.","文学与文化中，铁砧常与铁匠形象相关，象征“锻造、塑造、承受敲打后成形”。在一些诗歌或故事里，人生会被比作在铁砧上锤炼。"]}
{"word":"anviled","summary":{"en":"“Anviled” usually means “forged or hammered on an anvil,” and it can also describe something “anvil-shaped” (rare).","zh":"“Anviled”通常指“在铁砧上锻造/锤打成形”，也可形容“铁砧状的”（较少见）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense / past participle of “anvil”) to shape, forge, or hammer (metal) on an anvil.","zh":"（动词 anvil 的过去式/过去分词）在铁砧上锻造、锤打（金属）；使在铁砧上成形。"},"examples":[{"en":"The blacksmith anviled the hot iron into a horseshoe.","zh":"铁匠把烧红的铁放在铁砧上锻造成马蹄铁。"},{"en":"By noon, the blade had been anviled smooth and flat.","zh":"到中午时，刀刃已经在铁砧上锻打得光滑而平整。"}]},{"partOfSpeech":"adj.","definition":{"en":"Shaped like an anvil; having an anvil-like form (rare).","zh":"铁砧状的；形状像铁砧的（较少见）。"},"examples":[{"en":"The statue’s base looked anviled, broad and solid.","zh":"雕像的底座看起来像铁砧一样，宽厚而结实。"},{"en":"An anviled block of stone sat near the fireplace.","zh":"壁炉旁放着一块铁砧状的石块。"}]}],"synonyms":["forged","hammered","shaped"],"phonetic":"/ˈæn.vəld/","extraExplanation":["“anvil”本身更常见（铁砧）。把它当动词用（anvil / anviled）在现代英语里比较少见，写作中通常会用更常用的动词如“forge（锻造）”“hammer（锤打）”“shape（塑形）”。","相关词汇：anvil（铁砧）；blacksmith（铁匠）；forge（锻造/锻炉）；hammer out（反复敲打成形，也可引申为“敲定方案”）。"]}
{"word":"anviling","summary":{"en":"“Anviling” usually refers to a thunderstorm cloud spreading into an anvil shape, and less commonly to forging metal on an anvil.","zh":"“anviling”通常指雷暴云顶扩展成铁砧状；较少见时也指在铁砧上锻打金属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Meteorology) The process of a thunderstorm cloud spreading out at the top into a flat, anvil-like shape (an “anvil cloud”).","zh":"（气象）雷暴云（积雨云）顶部向外扩展，形成扁平的“铁砧状”云顶（铁砧云）的过程。"},"examples":[{"en":"Satellite images showed strong anviling from the storm as it reached the upper atmosphere.","zh":"卫星图像显示，这场风暴到达高空后出现了明显的铁砧化扩展。"},{"en":"By late afternoon, anviling covered much of the sky downwind of the thunderstorm.","zh":"到傍晚时分，雷暴下风向的天空大部分被铁砧状云扩展覆盖了。"}]},{"partOfSpeech":"n.","definition":{"en":"(Metalworking) The act of shaping or flattening hot metal on an anvil; forging on an anvil.","zh":"（金工）在铁砧上锻打、整形或压平加热金属的动作；铁砧锻造。"},"examples":[{"en":"The smith spent the morning anviling the heated steel into a curved blade.","zh":"铁匠一上午都在铁砧上锻打加热的钢材，把它打成弯曲的刀刃。"},{"en":"Good anviling requires steady hammer control and careful reheating.","zh":"好的铁砧锻打需要稳定的锤击控制和适时回炉加热。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “anvil” (to shape or work on an anvil).","zh":"“anvil”的现在分词（指在铁砧上加工、锻造）。"},"examples":[{"en":"He is anviling the metal to thin it out before bending it.","zh":"他正在铁砧上锻打金属，把它打薄后再弯折。"}]}],"synonyms":["anvil formation","anvil cloud development","spreading (aloft)","forging","hammering on an anvil"],"phonetic":"/ˈænvəlɪŋ/","extraExplanation":["“anviling”在日常英语里不算常见；最常见的专业用法在气象学：当强对流云（积雨云）顶端到达对流层顶附近时，因上方更稳定、难以继续向上发展，云体就会向外铺展，形成像铁砧一样的平顶外扩云盖，这个过程就常被称为anviling。","金工语境里更常见的表达是“forging on an anvil / hammering on an anvil”。“anviling”可以用，但更偏技术描述或文学化用法。"]}
{"word":"anvilled","summary":{"en":"“Anvilled” usually means “hammered/forged on an anvil,” and more rarely describes something as anvil-shaped or hardened as if by heavy blows.","zh":"“anvilled”通常指“在铁砧上锻打/锻造过”，较少见时作形容词，表示“铁砧形的”或“像被重击锻成般坚硬、方正”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “anvil”: to shape, forge, or flatten metal by hammering it on an anvil.","zh":"“anvil（在铁砧上锻打）”的过去式/过去分词：把金属放在铁砧上用锤子锻造、塑形或锤平。"},"examples":[{"en":"The blacksmith anvilled the hot iron into a rough blade.","zh":"铁匠把烧红的铁放在铁砧上锻打成粗坯刀刃。"},{"en":"The edge was anvilled flat before it was polished.","zh":"边缘先在铁砧上锤平，然后才抛光。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Literary/rare) Shaped like an anvil, or formed as if hammered on an anvil.","zh":"（文学/少见）呈铁砧形的；或像在铁砧上锻打出来的（有“坚硬、被重击塑成”的意象）。"},"examples":[{"en":"He had an anvilled jaw and a steady stare.","zh":"他下巴方硬如铁砧，目光沉稳。"},{"en":"Her voice sounded anvilled by hardship.","zh":"她的声音像是被苦难锻打过一般。"}]}],"synonyms":["forged","hammered","shaped","beaten","flattened"],"phonetic":"/ˈænvəld/","extraExplanation":["“anvilled”在现代英语里多见于文学描写或技艺语境（锻造、金工），日常对话里更常用“hammered/forged/shaped”。","作为形容词时带有很强的意象：坚硬、方正、经受重击后成形，常用于描写“jaw（下巴）/features（五官）/character（性格）”等。"]}
{"word":"anvilling","summary":{"en":"Anvilling means forging or shaping metal on an anvil.","zh":"anvilling 指在铁砧上锻打、塑形金属的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of shaping, forging, or working metal on an anvil; using an anvil in metalwork","zh":"在铁砧上锻打、成形金属的行为；使用铁砧进行金工"},"examples":[{"en":"The smith spent the morning anvilling hot iron into a hook.","zh":"铁匠花了一上午在铁砧上把烧红的铁锻打成一个钩子。"},{"en":"Good anvilling requires steady blows and careful timing.","zh":"好的铁砧锻打需要稳定的敲击和精准的时机。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of anvil: shaping or forging (metal) on an anvil","zh":"anvil 的现在分词：在铁砧上锻打、成形（金属）"},"examples":[{"en":"He is anvilling the steel while it’s still glowing.","zh":"他趁钢还在发红时在铁砧上锻打。"},{"en":"She learned by watching experienced workers anvilling tools for the workshop.","zh":"她通过观察熟练工人在铁砧上锻打车间工具来学习。"}]}],"synonyms":["forging","hammering","smithing","metalworking"],"phonetic":"/ˈæn.vəl.ɪŋ/","extraExplanation":["“anvilling”来自“anvil（铁砧）”。现代英语里更常见的说法是“forging（锻造）”“hammering on an anvil（在铁砧上敲打）”。“anvil”作动词相对少见，但在金工、铁匠语境中可以使用，显得更专业或更具画面感。"]}
{"word":"anvils","summary":{"en":"Anvils are heavy metal blocks used for hammering and shaping metal; figuratively, they can represent something very heavy or pressuring.","zh":"anvils 是用于敲打、锻造金属的沉重金属砧块；也可比喻沉重的压力或负担。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of anvil: a heavy metal block (usually iron or steel) used as a surface for hammering and shaping hot or cold metal.","zh":"anvil（铁砧/钢砧）的复数：一种沉重的金属块（通常为铁或钢），用作敲打、锻造和塑形金属的工作台面。"},"examples":[{"en":"The blacksmith lined up several anvils in the workshop for different jobs.","zh":"铁匠在作坊里摆了好几个铁砧，用于不同的活儿。"},{"en":"In the museum, you can see old anvils used to make horseshoes.","zh":"在博物馆里，你能看到过去用来打马蹄铁的旧铁砧。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) Heavy objects that can symbolize weight, pressure, or something hard and unmovable (often in stories or cartoons).","zh":"（比喻）象征沉重、压力或坚硬难移之物（常见于故事或卡通语境）。"},"examples":[{"en":"Deadlines can feel like anvils hanging over your head.","zh":"截止日期有时像铁砧一样压在你头上。"},{"en":"In cartoons, anvils comically fall from the sky to show sudden trouble.","zh":"在卡通里，铁砧从天而降常用来搞笑地表现“突然的麻烦”。"}]}],"synonyms":["forging block","smithing anvil","iron block (contextual)"],"phonetic":"/ˈæn.vɪl/","extraExplanation":["“anvil”常与“blacksmith（铁匠）”一起出现，是传统锻造文化中的核心工具。英语里也有比喻用法，如用沉重的铁砧来表达压力或负担。","相关常见搭配：“on the anvil”意为“在筹备中/正在酝酿（尤指计划、作品）”。"]}
{"word":"anvilsmith","summary":{"en":"An anvilsmith is a smith who makes or repairs anvils used in metalworking.","zh":"anvilsmith 指制作或修理锻造用铁砧的铁匠/金工匠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a blacksmith or metalworker who makes, repairs, or works with anvils (heavy iron blocks used as a surface for shaping metal).","zh":"铁砧匠；制作、修理或专门从事铁砧（锻打金属用的沉重铁块）的铁匠/金工匠。"},"examples":[{"en":"The anvilsmith repaired the cracked anvil so the blacksmith could keep working.","zh":"铁砧匠修好了开裂的铁砧，这样铁匠就能继续干活了。"},{"en":"In the old workshop, an anvilsmith’s tools hung beside the forge.","zh":"在那间老作坊里，铁砧匠的工具挂在炉火旁。"}]}],"synonyms":["blacksmith","smith","metalworker","anvil maker"],"phonetic":"/ˈæn.vəl.smɪθ/","extraExplanation":["“anvilsmith”是由“anvil（铁砧）+ smith（铁匠）”构成的复合词，但在现代英语里并不常见。现实中更常用的说法是“blacksmith（铁匠）”或更具体的“anvil maker / anvil maker and repairer（铁砧制作/修理者）”。","铁砧在传统锻造中非常关键：它提供坚硬而稳定的受力面，方便用锤子把加热后的金属敲打成形。因此在一些历史语境或工艺描写中，会出现这种更“细分职业”的称呼。"]}
{"word":"anviltop","summary":{"en":"“Anvil top” means the flat working surface on an anvil; “anviltop” is often just a nonstandard one-word spelling.","zh":"“anvil top”指铁砧的平坦工作面；“anviltop”常见为非标准的连写拼法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the flat working surface on the top of an anvil, where metal is placed and hammered","zh":"铁砧（anvil）的上表面/工作面，用来放置并锤打金属的平面"},"examples":[{"en":"Place the hot steel on the anvil top before you strike it.","zh":"把烧热的钢放在铁砧的上表面，然后再敲打。"},{"en":"The anvil top was smooth from years of use.","zh":"铁砧的上表面因为多年使用而变得很光滑。"}]},{"partOfSpeech":"other","definition":{"en":"(often written as one word in usernames or product names) a combined form of “anvil” + “top”; it is not a standard dictionary word by itself","zh":"（常见于用户名或产品名的连写形式）由“anvil（铁砧）+ top（顶部）”组成；本身不是标准词条"},"examples":[{"en":"I saw “anviltop” as a shop name, but the normal phrase is “anvil top.”","zh":"我看到“anviltop”被用作店名，但更常见的说法是“anvil top”。"}]}],"synonyms":["anvil face","face (of an anvil)"],"phonetic":"ˈæn.vəl tɑp","extraExplanation":["在金工/铁匠语境里，更常见的说法还有：the face of the anvil（铁砧面）。如果你是在某个特定领域（比如游戏、软件、品牌）里看到“anviltop”，可能是专有名词，需要结合上下文判断。"]}
{"word":"anviltops","summary":{"en":"“Anviltops” most likely means “anvil tops”: the working top surfaces of anvils used for hammering metal.","zh":"“anviltops”多半指“anvil tops（铁砧顶部）”：铁砧上用来锻打金属的平坦工作面。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the top surfaces (flat working faces) of anvils, where metal is hammered and shaped","zh":"铁砧的顶部工作面（平坦的敲打面），用于锻打和塑形金属"},"examples":[{"en":"Keep the anvil tops clean so the hot metal doesn’t pick up dirt.","zh":"把铁砧的工作面保持干净，这样烧红的金属就不会沾上脏东西。"},{"en":"The anviltops were worn smooth from years of use.","zh":"这些铁砧的顶部因为多年使用而被磨得很光滑。"}]},{"partOfSpeech":"other","definition":{"en":"(less common) a misspelling or run-together form of “anvil tops” or “anvil-top(s)”","zh":"（不太常见）把“anvil tops（铁砧顶部）”或“anvil-top(s)”拼写成一串的形式，可能是拼写/排版错误"},"examples":[{"en":"I think “anviltops” should be written as two words: “anvil tops.”","zh":"我觉得“anviltops”应写成两个词：“anvil tops”。"}]}],"synonyms":["anvil faces","anvil surfaces","anvil tops"],"phonetic":"ˈæn.vəl tɑps","extraExplanation":["“anvil”是“铁砧”，传统锻造里铁匠把加热后的金属放在铁砧的平面上敲打成形，因此“anvil top(s)”强调的是那块最常用、最平的工作面。","英语里也常用“anvil”做比喻：例如“between the hammer and the anvil”（在锤子和铁砧之间）可表达“两面受压/左右为难”的处境，类似中文的“两面夹击”。"]}
