{"word":"Anza","summary":{"en":"Anza is mainly a proper name (surname/place name), often linked to the explorer Juan Bautista de Anza and locations in the U.S. Southwest.","zh":"Anza 主要是专有名词（姓氏/地名），常与探险家胡安·包蒂斯塔·德·安萨以及美国西南部的相关地点命名有关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Spanish surname and a name used for several places and institutions (especially in the southwestern United States). It is often associated with the explorer Juan Bautista de Anza.","zh":"一个西班牙语姓氏，也用作一些地点与机构的名称（尤指美国西南部）。它常与探险家胡安·包蒂斯塔·德·安萨（Juan Bautista de Anza）相关。"},"examples":[{"en":"We drove on Anza Road toward the desert.","zh":"我们沿着安萨路（Anza Road）开车前往沙漠。"},{"en":"De Anza College is in Cupertino, California.","zh":"德安萨学院（De Anza College）位于加州库比蒂诺。"},{"en":"Juan Bautista de Anza led expeditions in the 1700s.","zh":"胡安·包蒂斯塔·德·安萨在18世纪率领探险队。"}]}],"phonetic":"/ˈɑn.zə/","extraExplanation":["在英语里，“Anza”通常作为专有名词出现（人名/地名/机构名），因此常见写法是首字母大写。","胡安·包蒂斯塔·德·安萨（Juan Bautista de Anza）是西班牙殖民时期的重要探险者，曾带队从今日墨西哥北部到加州一带开辟路线；因此美国西南部有不少以“Anza”命名的公园、道路与学校。"]}
{"word":"Anzac","summary":{"en":"Anzac refers to the Australian and New Zealand Army Corps and, by extension, their WWI soldiers; it’s also strongly associated with Anzac Day, a remembrance day on April 25.","zh":"Anzac 指澳新軍團及其一戰士兵；也與4月25日的澳新軍團日密切相關，是澳洲與紐西蘭的重要紀念日。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Australian and New Zealand Army Corps: a World War I military corps best known for the Gallipoli campaign; also used more broadly to refer to Australian and New Zealand soldiers, especially from WWI.","zh":"澳新軍團（Australian and New Zealand Army Corps）：第一次世界大戰期間的軍團，最著名與加里波利戰役相關；也可泛指澳洲與紐西蘭（尤其一戰時期）的士兵。"},"examples":[{"en":"Many Anzac soldiers landed at Gallipoli in 1915.","zh":"許多澳新軍團士兵在1915年於加里波利登陸。"},{"en":"The museum has letters written by Anzacs during the war.","zh":"那座博物館收藏了澳新軍團士兵在戰爭期間寫的信件。"}]},{"partOfSpeech":"n.","definition":{"en":"Anzac Day (April 25): a national day of remembrance in Australia and New Zealand honoring those who served and died in wars, conflicts, and peacekeeping operations.","zh":"澳新軍團日（4月25日）：澳洲與紐西蘭的紀念日，用來追思在戰爭、衝突與維和行動中服役與牺牲的人。"},"examples":[{"en":"We woke up early for the Anzac Day dawn service.","zh":"我們為了參加澳新軍團日的黎明紀念儀式而早起。"},{"en":"Schools often hold assemblies to mark Anzac Day.","zh":"學校常會舉行集會來紀念澳新軍團日。"}]}],"synonyms":["Australian and New Zealand Army Corps (ANZAC)"],"phonetic":"/ˈænzæk/","extraExplanation":["「ANZAC」原本是縮寫（Australian and New Zealand Army Corps），常以全大寫書寫；作為一般名詞使用時也常見「Anzac」。在澳洲與紐西蘭屬於高度尊重的歷史符號，商業用途（如商品命名）在部分地區可能受到法律或規範限制，使用時要留意語境與敬意。"]}
{"word":"Anzanian","summary":{"en":"Anzanian = connected with Anzan/Anshan (an ancient Elamite region in SW Iran), or a person from there.","zh":"Anzanian 指与古代安赞/安珊（今伊朗西南、埃兰范围内）有关的，或指安赞人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Anzan (also called Anshan), an ancient region/city in what is now southwestern Iran, especially in the context of Elamite and early Persian history.","zh":"与安赞（也作安珊，位于今伊朗西南部的古代地区/城市）有关的；尤指埃兰文明及早期波斯历史语境中的。"},"examples":[{"en":"Archaeologists study Anzanian sites to understand early Elamite culture.","zh":"考古学家研究安赞地区的遗址，以了解早期埃兰文化。"},{"en":"The inscription mentions an Anzanian ruler alongside rulers of Susa.","zh":"铭文中提到一位安赞统治者，并与苏萨的统治者并列。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Anzan (Anshan), or someone identified with that ancient region.","zh":"安赞人；来自安赞（安珊）的人，或被认为与该古代地区有关的人。"},"examples":[{"en":"Some texts distinguish between Susians and Anzanians.","zh":"一些文献区分“苏萨人”和“安赞人”。"}]}],"synonyms":["Anshan (related)","Elamite (related)"],"phonetic":"/ænˈzæniən/","extraExplanation":["“Anzan/Anshan（安赞/安珊）”常见于古近东史与考古学写作中：它是埃兰（Elam）范围内的重要中心之一，也与早期波斯（如阿契美尼德王朝早期）的称号与地理认同有关。","现代英语里“Anzanian”属于较学术/专门的用词，通常出现在历史、铭文学与考古学语境中；一般日常表达更常用“Elamite（埃兰的/埃兰人）”或直接说“from Anshan/Anzan（来自安珊/安赞）”。"]}
{"word":"anzanian","summary":{"en":"Tanzanian means “from Tanzania” (adjective) or “a person from Tanzania” (noun).","zh":"Tanzanian 指“来自坦桑尼亚的”（形容词）或“坦桑尼亚人”（名词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Tanzania (a country in East Africa) or its people, language, or culture","zh":"与坦桑尼亚（东非国家）或其人民、语言、文化有关的"},"examples":[{"en":"She studies Tanzanian history and politics.","zh":"她研究坦桑尼亚的历史与政治。"},{"en":"Tanzanian coffee and tea are popular exports.","zh":"坦桑尼亚的咖啡和茶是很受欢迎的出口产品。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Tanzania","zh":"坦桑尼亚人"},"examples":[{"en":"Many Tanzanians speak Swahili.","zh":"许多坦桑尼亚人讲斯瓦希里语。"},{"en":"He is a Tanzanian living in the U.S.","zh":"他是一位生活在美国的坦桑尼亚人。"}]}],"synonyms":["from Tanzania","Tanzania’s (informal)"],"phonetic":"/ˌtænzəˈniən/","extraExplanation":["你输入的“anzanian”通常是拼写缺少开头字母 **T**，正确形式多为 **Tanzanian**。","**Tanzania**（坦桑尼亚）这个国名来自 **Tanganyika** 和 **Zanzibar** 的合并，因此形容词/名词形式是 **Tanzanian**。","与之常见的相关词：**Swahili**（斯瓦希里语），**Zanzibar**（桑给巴尔）。"]}
{"word":"Anzanite","summary":{"en":"Anzanite means “from Anzan/Anshan” or “related to Anzan/Anshan,” an ancient Iranian region linked to Elamite and early Persian history.","zh":"Anzanite 指“安赞/安山的人”或“与安赞/安山有关的”，该古代地区与埃兰及早期波斯历史相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Anzan (also called Anshan), an ancient city/region in southwestern Iran associated with Elamite and early Persian history","zh":"安赞（亦作安山，今伊朗西南部的古城/地区）的人；安赞人"},"examples":[{"en":"Some scholars describe the early Persian rulers as Anzanites before the Achaemenid Empire fully formed.","zh":"一些学者在阿契美尼德帝国完全形成之前，把早期波斯统治者称为“安赞人”。"},{"en":"The inscription may reflect an Anzanite political identity tied to the highlands of Elam.","zh":"这段铭文可能反映了一种与埃兰高地相关的安赞政治身份。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Anzan/Anshan, its people, or its culture and history","zh":"与安赞/安山及其人民、文化或历史有关的；安赞的"},"examples":[{"en":"The museum display includes Anzanite-style seals and administrative tablets.","zh":"博物馆展柜中有安赞风格的印章和行政泥板。"},{"en":"Researchers compared Anzanite and Elamite material culture in the region.","zh":"研究者比较了该地区的安赞文化与埃兰文化的物质遗存。"}]}],"synonyms":["Anshanite"],"phonetic":"/ˈænzənaɪt/","extraExplanation":["“Anzan/Anshan（安赞/安山）”常见于古代近东研究与考古学语境，位于今伊朗法尔斯省一带，历史上与埃兰（Elam）文化圈关系密切。","在一些古代王衔与铭文研究中，会出现与“安赞之王/安山之王”相关的表述，因此形容词/名词形式 Anzanite 主要用于学术写作。","该词在日常英语中非常少见；写作时也可能见到拼写变体 Anshanite。"]}
{"word":"Anzengruber","summary":{"en":"Anzengruber refers to Ludwig Anzengruber, an Austrian realist playwright known for rural folk plays.","zh":"Anzengruber指奥地利写实主义剧作家路德维希·安岑格鲁伯，以描写乡村普通人的民间剧闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ludwig Anzengruber (1839–1889), an Austrian playwright and novelist known for realistic “folk plays” (plays about ordinary people), often set in rural Austria and written in a natural, everyday style.","zh":"路德维希·安岑格鲁伯（Ludwig Anzengruber，1839–1889），奥地利剧作家与小说家，以写实的“民间剧/乡土剧”（描写普通人的戏剧）闻名，作品常以奥地利乡村为背景，语言贴近日常口语。"},"examples":[{"en":"In our literature class, we read an Anzengruber play about village life and social pressure.","zh":"在文学课上，我们读了一部安岑格鲁伯的戏剧，内容讲乡村生活与社会压力。"},{"en":"Anzengruber is often discussed as a writer who brought realism to popular Austrian theatre.","zh":"安岑格鲁伯常被认为是把写实主义带入奥地利大众戏剧的重要作家。"}]}],"synonyms":["Ludwig Anzengruber"],"phonetic":"/ˈɑn(t)sənˌɡruːbər/","extraExplanation":["“Anzengruber”是德语姓氏，英语里多当作专有名词使用，通常不翻译，只在中文语境中音译为“安岑格鲁伯”。","他最常被提到的代表作为《Der Pfarrer von Kirchfeld》（《基希费尔德的牧师》），经常被用来讨论宗教、道德与乡村社会规范之间的冲突。"]}
{"word":"Anzio","summary":{"en":"Anzio is a town on Italy’s coast and is also well known as a WWII landing site and battle location in 1944.","zh":"安齐奥既是意大利沿海城镇名，也常指二战中1944年盟军登陆与安齐奥战役的地点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A coastal town in central Italy, south of Rome, on the Tyrrhenian Sea.","zh":"安齐奥（意大利中部台伯河尼亚海沿岸城镇，位于罗马以南）。"},"examples":[{"en":"Anzio is a seaside town not far from Rome.","zh":"安齐奥是一座离罗马不远的海滨小镇。"},{"en":"We took a day trip from Rome to Anzio to see the coast.","zh":"我们从罗马去安齐奥一日游，看海岸风景。"}]},{"partOfSpeech":"n.","definition":{"en":"In World War II history, the site of the Allied landing in 1944 and the ensuing Battle of Anzio (often discussed as the “Anzio beachhead”).","zh":"（二战史）1944年盟军登陆地点及随后发生的“安齐奥战役”（常称“安齐奥滩头阵地”）。"},"examples":[{"en":"The book describes the heavy fighting after the Allied landing at Anzio in 1944.","zh":"这本书描述了1944年盟军在安齐奥登陆后爆发的激烈战斗。"},{"en":"He studied how the Anzio beachhead affected the push toward Rome.","zh":"他研究了安齐奥滩头阵地如何影响盟军向罗马推进。"}]}],"synonyms":["Anzio beachhead","the Battle of Anzio"],"phonetic":"/ˈænzioʊ/","extraExplanation":["“Anzio”是意大利地名，英语里通常按意大利语读法的英语近似音来读。","二战背景：1944年盟军在安齐奥与内图诺（Nettuno）附近实施“雪崩行动/海鸥行动”（Operation Shingle）登陆，意图绕过德军防线、加速夺取罗马；相关叙述中常见搭配：the Battle of Anzio, the Anzio landings, the Anzio beachhead。"]}
{"word":"Anzovin","summary":{"en":"Anzovin is usually a surname or a proper name; it also commonly refers to Anzovin Studio, a U.S. media producer of educational/documentary content.","zh":"Anzovin 通常是姓氏或专有名词；也常指美国媒体公司 Anzovin Studio，制作教育类/纪录片风格内容。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A surname (family name), most often seen in American contexts; it may refer to individuals or organizations that carry this name (e.g., a company name).","zh":"一个姓氏（家族姓），在美国语境中较常见；也可指使用该名称的个人或机构（例如公司名称）。"},"examples":[{"en":"I found a book edited by Anzovin.","zh":"我找到了一本由 Anzovin 编辑的书。"},{"en":"Anzovin is listed as the producer in the credits.","zh":"片尾字幕中把 Anzovin 列为制作方。"}]},{"partOfSpeech":"other","definition":{"en":"(Common reference) Anzovin Studio: an American media company known for producing educational and documentary-style films and video content.","zh":"（常见所指）Anzovin Studio：一家美国媒体公司，以制作教育类与纪录片风格的影片、视频内容而知名。"},"examples":[{"en":"We watched an Anzovin Studio documentary in class.","zh":"我们在课上看了一部 Anzovin Studio 的纪录片。"},{"en":"The training video was produced by Anzovin Studio.","zh":"这段培训视频由 Anzovin Studio 制作。"}]}],"synonyms":["(no direct synonym; proper noun)"],"phonetic":"/ˈænzoʊvɪn/","extraExplanation":["“Anzovin”通常作为专有名词使用（人名/姓氏或机构名），因此在句中一般不加冠词，也不做复数变化。","如果你是在参考文献、片尾字幕或公司信息中看到它，常见写法包括 “Anzovin Studio” 或以姓氏形式出现。不同个人/机构的具体读音可能略有差异，但英语里常见的读法接近 /ˈænzoʊvɪn/。"]}
{"word":"ANZUS","summary":{"en":"ANZUS is a 1951 defense treaty linking Australia, New Zealand, and the United States for mutual security in the Pacific.","zh":"ANZUS是1951年澳大利亚、新西兰与美国签署的防务条约（同盟），用于维护太平洋地区的共同安全。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A defense treaty (and political-military alliance) between Australia, New Zealand, and the United States, signed in 1951, aimed at mutual security in the Pacific region.","zh":"《澳新美安全条约》（ANZUS）：澳大利亚、新西兰与美国于1951年签署的防务条约与政治军事同盟，旨在维护太平洋地区的共同安全。"},"examples":[{"en":"ANZUS is often discussed in the context of U.S. security strategy in the Pacific.","zh":"ANZUS常在讨论美国在太平洋地区的安全战略时被提及。"},{"en":"Australia frequently refers to ANZUS when describing its long-term alliance with the United States.","zh":"澳大利亚在描述其与美国的长期同盟关系时，常会提到ANZUS。"},{"en":"The ANZUS treaty shaped defense cooperation during the Cold War.","zh":"ANZUS条约在冷战时期塑造了防务合作。"}]}],"synonyms":["ANZUS Treaty","Australia–United States alliance","Pacific security alliance"],"phonetic":"/ˈæn.zʌs/","extraExplanation":["ANZUS是由Australia、New Zealand、United States三国名称首字母组成的缩写。正式名称常写作“ANZUS Treaty”。","历史背景：条约于1951年在旧金山签署，冷战早期各方希望在亚太地区建立集体安全安排。","使用场景：新闻与国际关系讨论中常用“the ANZUS alliance / the ANZUS treaty”。在日常口语中不常出现，更偏正式与政策语境。","补充：由于1980年代新西兰的反核政策，美新之间的安全合作曾明显降温，因此很多讨论会提到“ANZUS关系的变化”，但美澳同盟依然非常紧密。"]}

