{"word":"AO","summary":{"en":"AO is an abbreviation with multiple possible meanings; the correct meaning depends on context.","zh":"AO是一个多义缩写，具体含义需要根据语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation that can mean different things depending on context (for example, a job title, an organization, or a medical term).","zh":"一个缩写，具体含义取决于语境（例如职位名称、机构名称或医学术语等）。"},"examples":[{"en":"In this email, “AO” refers to the Administrative Officer who handles paperwork.","zh":"在这封邮件里，“AO”指负责文书工作的行政官（Administrative Officer）。"},{"en":"Some hospitals use “AO” to mean aortic (related to the aorta) in notes, but usage varies.","zh":"一些医院在病历记录中用“AO”表示“主动脉相关的”（aortic），但用法不统一。"}]},{"partOfSpeech":"other","definition":{"en":"(common workplace use) Administrative Officer.","zh":"（常见于职场）Administrative Officer：行政官／行政主管。"},"examples":[{"en":"Please submit the form to the AO by Friday.","zh":"请在周五前把表格交给AO（行政主管）。"}]},{"partOfSpeech":"other","definition":{"en":"(sports) Australian Open (tennis tournament).","zh":"（体育）Australian Open：澳大利亚网球公开赛（澳网）。"},"examples":[{"en":"She stayed up late to watch the AO finals.","zh":"她熬夜看澳网（AO）决赛。"}]},{"partOfSpeech":"other","definition":{"en":"(online) “AO” can be shorthand for “Archive of Our Own (AO3),” a fanfiction website.","zh":"（网络）“AO”有时是“Archive of Our Own（AO3）”的简称，一个同人作品网站。"},"examples":[{"en":"I posted the story on AO3, so you might see people call it “AO.”","zh":"我把故事发在AO3上，所以你可能会看到大家简称它为“AO”。"}]}],"synonyms":["abbrev.","initialism"],"phonetic":"/ˌeɪ ˈoʊ/","extraExplanation":["“AO”不是一个固定单词，更像是首字母缩写（initialism）。不同领域含义差异很大：职场邮件里常见Administrative Officer；体育新闻里常指Australian Open；同人圈里常与AO3相关。最好结合上下文（行业、句子内容、大小写与标点如A.O.）来判断。","如果你能提供一句包含“AO”的原句或说明你在哪看到的（邮件/医学/体育/游戏/网络），我可以帮你锁定最准确的意思。"]}
{"word":"ao","summary":{"en":"AO is usually an initialism. Common meanings include “Adults Only” (a rating), “Area of Operations” (military), and “Administrative Officer” (a job title).","zh":"AO 通常是首字母缩略词。常见含义包括“仅限成人”（分级）、“作战区域”（军事）以及“行政官/行政主管”（职务）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(initialism) Adults Only; a content rating meaning the material is intended only for adults (e.g., some video games or media).","zh":"（首字母缩略词）“仅限成人”；一种内容分级，表示作品仅适合成年人（如部分游戏或媒体）。"},"examples":[{"en":"This game was rated AO, so many stores refused to sell it.","zh":"这款游戏被评为 AO，所以很多商店拒绝售卖。"},{"en":"The film avoided an AO-style rating by cutting a few scenes.","zh":"这部电影通过删减一些镜头来避免被评为类似 AO 的成人级别。"}]},{"partOfSpeech":"other","definition":{"en":"(initialism, military) Area of Operations; the specific area where a military unit is assigned to work.","zh":"（首字母缩略词，军事）作战区域；某支部队被分配执行任务的特定区域。"},"examples":[{"en":"The unit returned to its AO before nightfall.","zh":"该部队在天黑前返回了作战区域（AO）。"},{"en":"Stay inside the AO and report any changes.","zh":"留在作战区域（AO）内，并报告任何变化。"}]},{"partOfSpeech":"other","definition":{"en":"(initialism, job title) Administrative Officer; a person responsible for office management and administrative tasks.","zh":"（首字母缩略词，职务）行政官/行政主管；负责办公室管理与行政事务的人。"},"examples":[{"en":"Ask the AO about travel reimbursements.","zh":"差旅报销的事可以问行政主管（AO）。"},{"en":"She worked as an AO in the city government.","zh":"她在市政府担任行政官（AO）。"}]}],"synonyms":["initialism","abbreviation"],"phonetic":"/ˌeɪˈoʊ/","extraExplanation":["在英语里“AO/ao”通常不是一个普通单词，而是把两个字母读出来的缩略词（initialism）。口语中多读作“ay-oh”。不同领域含义差别很大；如果你告诉我上下文（例如游戏分级、军队、公司职位、聊天缩写等），我可以给出最准确的解释。"]}
{"word":"AOA","summary":{"en":"AOA is a common acronym. Depending on context, it often means Age of Acquisition, Angle of Attack, or American Osteopathic Association.","zh":"AOA是常见缩写，含义取决于语境，常见指“习得年龄”“迎角”或“美国骨科医学协会”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation used in many fields; it most often means “Age of Acquisition” (the age when a person typically learns a word or skill) in linguistics/psychology.","zh":"一个在不同领域都可能出现的缩写；在语言学/心理学中最常见指“习得年龄”（通常学会某个词或技能的年龄）。"},"examples":[{"en":"Researchers studied the AOA of common English words in children.","zh":"研究人员研究了儿童对常见英语词汇的习得年龄（AOA）。"},{"en":"Words with earlier AOA are often recognized faster.","zh":"习得年龄更早的词通常被识别得更快。"}]},{"partOfSpeech":"other","definition":{"en":"“Angle of Attack” in aviation/engineering (the angle between a wing/blade and the oncoming airflow).","zh":"在航空/工程领域指“迎角”（机翼/叶片与来流气流之间的夹角）。"},"examples":[{"en":"If the AOA gets too high, the plane can stall.","zh":"如果迎角（AOA）过高，飞机可能会失速。"},{"en":"Pilots monitor AOA during takeoff and landing.","zh":"飞行员在起飞和降落时会监控迎角（AOA）。"}]},{"partOfSpeech":"other","definition":{"en":"“American Osteopathic Association,” a U.S. professional organization for osteopathic medicine (DOs).","zh":"“美国骨科医学协会”（American Osteopathic Association），美国骨科医学（DO）相关的专业组织。"},"examples":[{"en":"She checked the AOA website for licensing information.","zh":"她在AOA官网查询了执照相关信息。"},{"en":"The AOA publishes guidelines for osteopathic practice.","zh":"AOA会发布骨科医学实践指南。"}]}],"synonyms":["acronym","initialism"],"phonetic":"/ˌeɪ.oʊˈeɪ/","extraExplanation":["“AOA”几乎总是缩写，具体含义要看语境（学术论文、航空讨论、医学机构等）。在口语里通常逐个字母读作 “A-O-A”。如果你告诉我你在哪看到它（聊天、作业、游戏、论文、飞机相关内容等），我可以帮你锁定最准确的含义。"]}
{"word":"aob","summary":{"en":"AOB is an abbreviation most commonly meaning “any other business” in meetings; it can also mean “array of bytes” in computing.","zh":"AOB常见含义是会议中的“其他事项”；在计算机领域也可指“字节数组”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(BrE, meetings) “Any other business”: a time near the end of a meeting for extra topics that are not on the agenda.","zh":"（英式英语，会议用语）“Any other business”：会议接近结束时，用来讨论议程之外的其他事项。"},"examples":[{"en":"Before we finish, is there any AOB?","zh":"在结束之前，还有没有其他事项（AOB）？"},{"en":"We’ll take questions under AOB at the end of the meeting.","zh":"我们会在会议最后的“其他事项（AOB）”环节回答问题。"}]},{"partOfSpeech":"other","definition":{"en":"(Computing) “Array of bytes”: a sequence of bytes used to store or represent data.","zh":"（计算机）“Array of bytes”：用于存储或表示数据的一串字节序列。"},"examples":[{"en":"The file is read into an AOB before decoding.","zh":"文件会先读入一个字节数组（AOB）再进行解码。"},{"en":"Store the message as an AOB for efficient processing.","zh":"把消息存成字节数组（AOB），以便高效处理。"}]}],"synonyms":["any other business","other business","other matters","array of bytes","byte array"],"phonetic":"/ˌeɪ oʊ ˈbiː/","extraExplanation":["AOB是缩写/首字母缩略词，最常见于英式商务会议纪要（minutes）或会议议程（agenda）里；在美式会议中更常直接写“Any other business”或用“Other business / Other matters”。","因为是缩写，正式写作时第一次出现最好写全称：Any other business (AOB)。"]}
{"word":"AOCS","summary":{"en":"AOCS usually refers to the American Oil Chemists’ Society, a scientific organization and source of standards for fats and oils.","zh":"AOCS 通常指美国油脂化学家学会，是研究与标准方法的重要机构，常见于油脂相关领域。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"American Oil Chemists’ Society; a professional scientific organization focused on fats, oils, lipids, surfactants, and related analytical methods and industry standards.","zh":"美国油脂化学家学会；一个专注于油脂、脂类、表面活性剂及相关分析方法与行业标准的专业科学组织。"},"examples":[{"en":"She presented her lipid analysis research at the AOCS annual meeting.","zh":"她在 AOCS 年会上展示了自己的脂类分析研究。"},{"en":"Many labs follow AOCS methods for testing edible oils.","zh":"许多实验室会采用 AOCS 的方法来检测食用油。"}]}],"synonyms":["American Oil Chemists’ Society"],"phonetic":"/ˌeɪ.oʊˈsiː.ɛs/","extraExplanation":["AOCS 是缩写，日常阅读中通常按字母逐个读（A-O-C-S），在正式写作里第一次出现时常写全称 American Oil Chemists’ Society，后面再用 AOCS。","在油脂与食品、化工材料等领域，AOCS 也常指其发布的“标准方法/检测方法”（AOCS Methods），用于质量检测与科研对比。"]}
{"word":"Aoede","summary":{"en":"Aoede is a figure from Greek mythology—a Muse associated with song and voice.","zh":"Aoede 是希腊神话人物，一位与歌唱和声音相关的缪斯女神。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) A Muse connected with song and voice; sometimes listed among the three original Boeotian Muses.","zh":"（希腊神话）与歌唱与声音相关的缪斯女神之一；有时被列为波奥提亚地区“三位最初的缪斯”之一。"},"examples":[{"en":"In one tradition, Aoede is the Muse who embodies the human voice in song.","zh":"在某些传统里，Aoede 被视为体现“歌声与人声”的缪斯。"},{"en":"The poet invoked Aoede to bless the performance with clear, beautiful singing.","zh":"诗人祈求 Aoede 赐福演出，使歌声清澈动听。"}]}],"synonyms":["Muse of song","Muse of voice"],"phonetic":"/eɪˈiːdi/","extraExplanation":["“Aoede”源自古希腊语，含义与“歌/歌唱”相关。英语中多作为专有名词出现在神话、古典学、诗歌批评或艺术作品命名中。","关于缪斯的名单在不同时期与地区版本里会有差异：更常见的是九位奥林匹斯缪斯，而 Aoede 常见于较早或地方性的传统（如波奥提亚传统）。","学习提示：在英文文本里你可能会看到写作 Aoede（首字母大写），有时也会被用作乐团、专辑、文学角色或项目名称，以借用“歌声/灵感”的意象。"]}
{"word":"aogiri","summary":{"en":"Aogiri is a Japanese word meaning the aogiri (Chinese parasol) tree, and it’s also widely known as “Aogiri Tree,” a fictional group name in Tokyo Ghoul.","zh":"Aogiri 是日语词，意思是青桐（中国梧桐）这种树；同时它也因《东京喰种》中的虚构组织名 “Aogiri Tree” 而广为人知。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Japanese) the aogiri tree; the Chinese parasol tree (Firmiana simplex), a tall tree often planted in East Asia.","zh":"（日语）“青桐/梧桐”树；常指中国梧桐（Firmiana simplex），东亚常见的高大行道树。"},"examples":[{"en":"In Japanese, aogiri refers to a type of parasol tree often seen in parks.","zh":"在日语里，aogiri 指一种常见于公园的梧桐类树。"},{"en":"The aogiri’s large leaves provide shade in summer.","zh":"aogiri 的大叶子在夏天能遮阴。"}]},{"partOfSpeech":"other","definition":{"en":"(Pop culture, proper noun) “Aogiri Tree,” the name of a fictional organization in the manga/anime Tokyo Ghoul.","zh":"（流行文化，专有名词）“Aogiri Tree（青桐树）”，漫画/动画《东京喰种》中一个虚构组织的名称。"},"examples":[{"en":"Aogiri Tree appears as a major group in Tokyo Ghoul.","zh":"Aogiri Tree 在《东京喰种》中是一个重要势力。"},{"en":"Fans often shorten “Aogiri Tree” to just “Aogiri.”","zh":"粉丝常把 “Aogiri Tree” 简称为 “Aogiri”。"}]}],"synonyms":["Chinese parasol tree","Firmiana simplex","Aogiri Tree"],"phonetic":"/ɑoʊˈɡiːri/","extraExplanation":["“Aogiri”来自日语「あおぎり」（青桐）。日语罗马字写作 aogiri，发音更接近“a-o-gi-ri”（每个音节都较清晰）。在英文语境中它常作为专名出现（尤其指《东京喰种》的组织名），也可作为植物名使用。","与之相关的常见写法/词：Aogiri Tree（完整组织名）、あおぎり/青桐（假名/汉字写法）。"]}
{"word":"Aoide","summary":{"en":"Aoide is a rare mythological name meaning the Muse or personification of song.","zh":"Aoide 是较少见的神话名，指歌唱之缪斯（或歌声的拟人化）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) A Muse of song (often spelled Aoede), sometimes named among the earliest Muses associated with vocal music and lyric poetry.","zh":"（希腊神话）歌唱之缪斯（也常拼作 Aoede），有时被列为早期的缪斯之一，象征声乐、歌咏与抒情诗。"},"examples":[{"en":"In some sources, Aoide (Aoede) represents the pure art of singing.","zh":"在一些资料中，Aoide（Aoede）象征纯粹的歌唱艺术。"},{"en":"The poet invoked Aoide to bless the performance with clear, beautiful song.","zh":"诗人祈请 Aoide 赐予演出清澈动人的歌声。"}]}],"synonyms":["Aoede"],"phonetic":"/eɪˈɔɪdi/","extraExplanation":["Aoide 是拉丁化的希腊名字（常见变体 Aoede）。在神话传统里，缪斯的名单并不完全固定：最常见的是“九缪斯”，但也有更早或不同地区的版本把 Aoide 与“歌唱/声音”联系在一起。","词源上与希腊语中“歌、歌唱”的概念相关，因此在文学或艺术语境中常被用作“歌声的象征/拟人化”。"]}
{"word":"Aoife","summary":{"en":"Aoife is a common Irish female name, usually pronounced “EE-fuh,” often associated with the meaning “beauty/radiance.”","zh":"Aoife 是常见的爱尔兰女性名字，通常读作“EE-fuh（伊-芙）”，常被解释为“美丽/光彩”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feminine given name of Irish origin, commonly pronounced “EE-fuh” in English; it comes from Irish and is often explained as meaning “beauty” or “radiance.”","zh":"一个源自爱尔兰语的女性名字，英语中常读作“EE-fuh（伊-芙）”；通常被解释为“美丽”或“光彩/光辉”。"},"examples":[{"en":"Aoife is an Irish name that many people outside Ireland learn to pronounce as “EE-fuh.”","zh":"Aoife 是一个爱尔兰名字，很多爱尔兰以外的人会学着把它读作“EE-fuh”。"},{"en":"Aoife moved to New York and often has to spell her name for new classmates.","zh":"Aoife 搬到纽约后，经常需要给新同学拼写自己的名字。"}]},{"partOfSpeech":"n.","definition":{"en":"a figure in Irish legend (in some stories, a warrior woman or a rival), used as a character name in mythic or literary contexts.","zh":"爱尔兰传说中的人物名（一些故事里是女战士或对手角色），常作为神话或文学语境中的角色名。"},"examples":[{"en":"In Irish legends, Aoife appears as a powerful character in several well-known tales.","zh":"在爱尔兰传说中，Aoife 在多则著名故事里以强势角色出现。"}]}],"synonyms":["Aífe","Eva (similar-sounding in English contexts)"],"phonetic":"/ˈiːfə/","extraExplanation":["发音提示：Aoife 属于爱尔兰语（Irish Gaelic）拼写，字母组合“ao”常对应长音 /iː/，整体常被英语使用者读作“EE-fuh”。这类名字在英语环境里常需要解释读法与拼写。","文化/故事背景：Aoife 在凯尔特传说体系中多次出现；不同故事版本里角色设定会有差异（例如作为女战士或与英雄人物有关的角色）。因此在文学/游戏/影视中也常被借用。"]}
{"word":"aoife","summary":{"en":"Aoife is a common Irish female first name, usually pronounced “EE-fuh,” traditionally linked with meanings like beauty or radiance.","zh":"Aoife 是常见的爱尔兰女性名，通常读作“EE-fuh”，传统上与“美丽/光辉”有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name from Irish (Gaelic), commonly used in Ireland; it is traditionally connected with meanings like “beauty” or “radiance.”","zh":"女性名字，源自爱尔兰盖尔语，在爱尔兰很常见；传统上常与“美丽”“光辉/光彩”等含义相关。"},"examples":[{"en":"Aoife is an Irish name, often pronounced “EE-fuh.”","zh":"Aoife 是一个爱尔兰名字，常读作“EE-fuh”（大致相当于“伊-芙”）。"},{"en":"Aoife moved to Boston for graduate school.","zh":"Aoife 为了读研究生搬到了波士顿。"}]}],"synonyms":["Eva","Aoibhín","Éabha"],"phonetic":"/ˈiːfə/","extraExplanation":["Aoife 在爱尔兰神话与传说中也常出现（例如“Children of Lir/利尔之子”的故事中有名为 Aoife 的角色；在“Cú Chulainn/库丘林”相关传说中也有 Aoife 这一名字）。因此它不只是现代人名，也带有一定的文化与文学联想。","拼写中 “ao” 在爱尔兰英语里常对应 /iː/ 这一类音，所以 Aoife 的常见英语读音是 /ˈiːfə/。不同地区可能会有轻微口音差异，但通常都接近 “EE-fuh”。"]}
{"word":"Aoki","summary":{"en":"Aoki is a Japanese surname (often written 青木) and a romanized name meaning “blue/green tree.”","zh":"Aoki 是日本姓氏（常写作“青木”），罗马字拼写，含义可理解为“青/绿的树”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Japanese family name (surname); also used as a given name in some contexts.","zh":"日本姓氏（也可在少数情况下作为名字使用）。"},"examples":[{"en":"Haruka Aoki is my classmate from Japan.","zh":"青木晴香是我来自日本的同学。"},{"en":"In the credits, the director is listed as Mr. Aoki.","zh":"在片尾字幕里，导演被写作青木先生。"}]},{"partOfSpeech":"other","definition":{"en":"a romanized Japanese name often written with the kanji 青木, literally “blue/green tree,” and sometimes translated as “green tree.”","zh":"一个日语姓名的罗马字拼写，常写作汉字“青木”，字面意思是“青/绿的树”，有时可意译为“绿树”。"},"examples":[{"en":"The name Aoki is commonly written as 青木 in Japanese.","zh":"Aoki 这个名字在日语里常写作“青木”。"},{"en":"Aoki can be found in many Japanese surnames in books and films.","zh":"在书籍和电影里，你会看到很多日本姓氏叫 Aoki。"}]}],"synonyms":["(no direct English synonyms; related: Japanese surnames such as Tanaka, Suzuki, Sato)"],"phonetic":"/aʊˈki/","extraExplanation":["“Aoki”是日语的罗马字（rōmaji）写法，发音更接近日语“あおき”（三拍：a-o-ki）。英文语境中读法会因人而异，常见近似是 /aʊˈki/。","日语里的“青（ao）”既可指“蓝”也常指“绿”（比如“青信号”在日语里是绿灯），所以“青木”有时会被解释为“green tree/绿树”。","作为姓氏时，正式场合可说“Mr./Ms. Aoki”（英语）或“青木さん/青木先生”（日语）。"]}
{"word":"AOL","summary":{"en":"AOL usually means the company America Online; in older chat slang it can also mean “age/occupation/location.”","zh":"AOL 通常指公司 America Online（美国在线）；在较早的聊天用语中也可指“年龄/职业/所在地”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a US internet services and media company name; short for “America Online.”","zh":"美国的一家互联网服务与媒体公司名称；“America Online（美国在线）”的缩写。"},"examples":[{"en":"AOL was one of the biggest internet companies in the 1990s.","zh":"AOL 在 1990 年代曾是最大的互联网公司之一。"},{"en":"My family used AOL for email back then.","zh":"那时候我家用 AOL 收发邮件。"}]},{"partOfSpeech":"n.","definition":{"en":"(online chat, older usage) “age/occupation/location,” information someone shares about themselves.","zh":"（网络聊天，较旧用法）“年龄/职业/所在地”，指个人自我介绍的基本信息。"},"examples":[{"en":"ASL or AOL?","zh":"你是要问 ASL 还是 AOL（年龄/职业/所在地）？"},{"en":"He posted his AOL in the chat: 19 / student / Chicago.","zh":"他在聊天室里发了自己的 AOL：19 岁 / 学生 / 芝加哥。"}]}],"synonyms":["America Online"],"phonetic":"/ˌeɪ oʊ ˈɛl/","extraExplanation":["AOL 在英语文化里带有明显的“早期互联网”时代感：很多美国人会把它和拨号上网、光盘安装包、以及早期聊天室联系在一起。","第二个意思（age/occupation/location）主要见于较早的聊天室或论坛；现在更常见的是 ASL（age/sex/location）。"]}
{"word":"aoli","summary":{"en":"“Aoli” is mainly a romanized spelling from Chinese, often seen in the cheer “aoli gei/奥利给” meaning “Let’s go!/Awesome!”; it can also be a name or brand.","zh":"“aoli”主要是来自中文的罗马字网络拼写，常见于“aoli gei/奥利给”，表示“加油/冲呀/太棒了”；也可作为人名或品牌名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A Chinese romanization (pinyin-style spelling) often used online to represent the sound “Ao-li” (奥利). It may refer to a name or be used as part of the slang phrase “aoli gei/奥利给,” meaning an enthusiastic cheer like “Let’s go!” or “Awesome!”","zh":"一种常见的中文拟音式拼写（类似拼音的网络写法），用来表示“奥利（Ao-li）”的读音。既可指人名/名称，也常作为网络用语“aoli gei/奥利给”的一部分，表示打气、助威，类似“冲呀！/加油！/太棒了！”"},"examples":[{"en":"In some videos, people comment “aoli!” to cheer the creator on.","zh":"在一些视频里，网友会评论“aoli！”来给创作者打气。"},{"en":"The streamer ended the clip with “aoli gei!”","zh":"主播在结尾喊了一句“aoli gei！（奥利给！）”。"}]},{"partOfSpeech":"n.","definition":{"en":"A given name or brand name spelled “Aoli” (often from Chinese), used for people, places, or products.","zh":"拼作“Aoli”的人名或品牌/名称（常见于中文语境的音译/拼写），可用于人、地名或产品名。"},"examples":[{"en":"Aoli Li is speaking at the conference today.","zh":"奥利·李（Aoli Li）今天在会议上发言。"},{"en":"This shop sells Aoli tea drinks.","zh":"这家店卖“Aoli”牌的茶饮。"}]}],"synonyms":["let’s go","keep it up","you got this","awesome"],"phonetic":"/ˈaʊli/","extraExplanation":["“奥利给/ aoli gei”是中文互联网流行语之一，常用于表达鼓劲、振奋或“整活儿”的夸张气氛，接近英语里的“Let’s go!”“You got this!”“Awesome!”。它本身并不是标准英语单词，更像是中文口语的罗马字拼写。","在英文语境里直接写“aoli”可能会让人不理解；如果你想让英语读者看懂，可以改写成“Let’s go!”“Keep it up!”等，或在第一次出现时加一句解释（e.g., “a Chinese cheer meaning ‘Let’s go!’”)."]}
{"word":"Aomori","summary":{"en":"Aomori is a place name in northern Japan: it can mean either Aomori Prefecture or its capital city, Aomori (City).","zh":"Aomori（青森）是日本北部的地名，既可指“青森县”，也可指其首府“青森市”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a prefecture at the northern end of Honshu, Japan (part of the Tohoku region).","zh":"日本本州最北端的一个县（青森县，属于东北地区）。"},"examples":[{"en":"Aomori is famous in Japan for its apples.","zh":"青森在日本以苹果闻名。"},{"en":"It often snows heavily in Aomori in winter.","zh":"青森冬天经常会下很大的雪。"}]},{"partOfSpeech":"n.","definition":{"en":"the capital city of Aomori Prefecture, located on Mutsu Bay in northern Japan.","zh":"青森县的首府城市（青森市），位于日本北部的陆奥湾沿岸。"},"examples":[{"en":"We took a ferry from Aomori to Hokkaido.","zh":"我们从青森坐渡轮去北海道。"},{"en":"The Nebuta Festival is held in Aomori in summer.","zh":"青森夏天会举办睡魔祭。"}]}],"synonyms":["Aomori Prefecture","Aomori City"],"phonetic":"/ˌɑːmoʊˈriː/","extraExplanation":["“Aomori（青森）”在日语里常被解释为“蓝色的森林/青绿的森林”，与当地自然景观有关。","青森以寒冷多雪的气候、苹果产量高、以及夏季的“青森睡魔祭（Nebuta Festival）”而广为人知。","英语中它通常作为专有名词使用：Aomori Prefecture（青森县）与 Aomori City（青森市）。"]}
{"word":"aonach","summary":{"en":"A Gaelic word meaning a mountain ridge (common in Scottish place names), and historically also a gathering or fair.","zh":"盖尔语词，常指“山脊/高原”（多见于苏格兰地名），历史上也可指“集会/集市”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scottish Gaelic/Irish) a mountain ridge or high plateau; often seen in Scottish place names.","zh":"（苏格兰盖尔语/爱尔兰语）山脊；高原（常见于苏格兰地名中）。"},"examples":[{"en":"Aonach Eagach is a famous narrow ridge in Scotland.","zh":"Aonach Eagach 是苏格兰一条著名的狭窄山脊。"},{"en":"The word “aonach” appears in the name Aonach Mòr, a mountain near Fort William.","zh":"“aonach” 这个词出现在 Aonach Mòr（莫尔山）这个名字里，它位于威廉堡附近。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scottish Gaelic/Irish, traditional) a gathering or fair, especially one held outdoors.","zh":"（苏格兰盖尔语/爱尔兰语，传统用法）集会；（多指露天的）集市、庆典。"},"examples":[{"en":"In older usage, an aonach could be a community fair with games and trading.","zh":"在较早的用法里，aonach 可以指带有游戏和交易的社区集市。"},{"en":"They read about an aonach where people met to celebrate and settle disputes.","zh":"他们读到一种 aonach：人们聚在一起庆祝，也处理纠纷。"}]}],"synonyms":["ridge","high plateau","(historical) fair","(historical) gathering"],"phonetic":"/ˈɑːnək/","extraExplanation":["“Aonach” 来自盖尔语（在苏格兰和爱尔兰使用的凯尔特语言之一）。在现代英语语境里，它最常作为地名元素出现，尤其指山地地形（如 Aonach Mòr、Aonach Eagach）。","在英文文本中，这个词有时会保留原语言的文化意味：既可指“山脊”，也可指传统社会中的“集会/集市”。读到时可根据上下文判断：若出现在山名或地形描述中，多半是“山脊”；若出现在历史或民俗叙述中，可能是“集会/集市”。"]}
{"word":"Aonian","summary":{"en":"Aonian is a literary word meaning “connected with Aonia/Helicon and the Muses,” i.e., poetic or muse-inspired; rarely, it means a person from Aonia.","zh":"Aonian 是文学用语，指“与古希腊阿俄尼亚/赫利孔山及缪斯女神相关”，引申为“诗意的、受灵感启发的”；极少情况下也指阿俄尼亚人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Literary, uncommon) Relating to Aonia (an ancient region in Greece, near Mount Helicon), traditionally associated with the Muses and poetry; by extension, poetic or inspired by the Muses.","zh":"（文学用语，较少见）与阿俄尼亚（Aonia，古希腊地区，靠近赫利孔山）有关；该地传统上与缪斯女神和诗歌相联系，因此也可引申为“诗意的、受缪斯启发的”。"},"examples":[{"en":"The poet invokes Aonian inspiration before beginning his song.","zh":"诗人在开篇前祈求“阿俄尼亚式”的灵感。"},{"en":"Her verse carries an Aonian sweetness, as if blessed by the Muses.","zh":"她的诗句带着一种“阿俄尼亚”的甜美，仿佛受缪斯祝福。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A person from Aonia; an Aonian.","zh":"（罕见）阿俄尼亚人；来自阿俄尼亚的人。"},"examples":[{"en":"In the old tale, an Aonian guides the traveler to Helicon.","zh":"在古老的故事里，一位阿俄尼亚人带旅人前往赫利孔山。"}]}],"synonyms":["poetic","muse-inspired","Heliconian (rare)"],"phonetic":"/eɪˈoʊniən/","extraExplanation":["“Aonian”常见于英文诗歌或古典风格文本中，和“Helicon（赫利孔山）”“Muses（缪斯女神）”一起出现，用来营造“诗神降临、灵感涌现”的氛围。","在现代日常英语中几乎不使用；如果你是在姓名、品牌名或网名里看到“Aonian”，那更可能是专有名词（取其古典、诗意的联想），而不是常规词汇。"]}
{"word":"aonian","summary":{"en":"Aeonian means “lasting for an extremely long time” or “relating to an aeon (a very long age).”","zh":"Aeonian 指“持续极久、近乎永恒的”，也可指“与漫长年代（aeon/eon，尤指地质年代）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Lasting for a very long time; seeming eternal.","zh":"持续极长时间的；仿佛永恒的。"},"examples":[{"en":"They waited an aeonian time for the results.","zh":"他们仿佛等了“永恒那么久”才等到结果。"},{"en":"The desert’s aeonian silence made her feel small.","zh":"沙漠那近乎永恒的寂静让她觉得自己很渺小。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to an aeon (a unit of time meaning an age, especially in geology).","zh":"与“eon/aeon（漫长的年代；尤指地质年代）”有关的。"},"examples":[{"en":"Geologists study aeonian changes in Earth’s crust.","zh":"地质学家研究地壳在漫长年代中的变化。"}]}],"synonyms":["eternal","endless","timeless","age-long","everlasting"],"phonetic":"/iˈoʊniən/","extraExplanation":["“aonian”不是常见拼写，最可能是把 **aeonian**（也可拼作 **eonian**）写错了。","**aeonian** 来自 **aeon/eon**（“极其漫长的时代”）。在日常英语里，它常带有夸张或文学色彩，用来强调“久到像永远一样”。","相关词：**aeon/eon**（名词：永世；漫长年代）。常见搭配：*aeonian time/silence/changes*。"]}
{"word":"AOP","summary":{"en":"AOP most commonly means Aspect-Oriented Programming in software, but in business it can also mean Annual Operating Plan; the meaning depends on context.","zh":"AOP 最常见指软件中的“面向切面编程”，在商业语境中也可指“年度经营计划”，需结合上下文理解。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Aspect-Oriented Programming: a programming approach that separates cross-cutting concerns (like logging, security, or transactions) into reusable “aspects,” so core business code stays cleaner.","zh":"面向切面编程（AOP）：一种编程方法，把“横切关注点”（如日志、权限、安全、事务等）抽离成可复用的“切面”，让核心业务代码更简洁。"},"examples":[{"en":"In Spring, AOP is often used to add logging without changing the main service code.","zh":"在 Spring 里，AOP 常用来加日志，而不需要改动主要的业务代码。"},{"en":"We used AOP to enforce authentication checks around sensitive API calls.","zh":"我们用 AOP 在敏感 API 调用周围统一做身份验证检查。"}]},{"partOfSpeech":"other","definition":{"en":"Annual Operating Plan: a company’s plan for goals, budgets, and actions for the coming year.","zh":"年度经营计划（AOP）：公司对下一年度目标、预算与行动安排的计划。"},"examples":[{"en":"Marketing presented the AOP with the yearly budget and campaign calendar.","zh":"市场团队展示了 AOP，包括年度预算和活动排期。"},{"en":"The team adjusted the AOP after the sales forecast changed.","zh":"销售预测变化后，团队调整了 AOP。"}]}],"synonyms":["aspect-oriented programming","annual operating plan"],"phonetic":"/ˌeɪ.oʊˈpiː/","extraExplanation":["AOP 是缩写，具体含义高度依赖语境：在软件工程（尤其 Java/Spring）里最常见的是 Aspect-Oriented Programming；在企业管理/财务会议中更常见的是 Annual Operating Plan。","读法通常是按字母读 “A-O-P”（/ˌeɪ.oʊˈpiː/）。写作时第一次出现建议先写全称，再在括号里标注 (AOP)。"]}
{"word":"AOPA","summary":{"en":"AOPA most commonly means the Aircraft Owners and Pilots Association, a nonprofit group that supports general aviation pilots and aircraft owners.","zh":"AOPA 最常指“飞机拥有者与飞行员协会”，是支持通用航空飞行员与飞机拥有者的非营利组织。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Aircraft Owners and Pilots Association: a major nonprofit membership organization that represents and supports general aviation pilots and aircraft owners (especially in the U.S.).","zh":"（美国）飞机拥有者与飞行员协会：一个大型非营利会员组织，代表并支持通用航空的飞行员与飞机拥有者。"},"examples":[{"en":"AOPA offers safety courses and resources for student pilots.","zh":"AOPA 为飞行学员提供安全课程和学习资源。"},{"en":"She joined AOPA to stay updated on changes in aviation regulations.","zh":"她加入 AOPA，以便及时了解航空法规的变化。"},{"en":"AOPA advocated for the local airport when it faced closure.","zh":"当当地机场面临关闭时，AOPA 为其发声并推动倡议。"}]},{"partOfSpeech":"other","definition":{"en":"(General use) An abbreviation that may refer to different organizations in different countries (for example, AOPA UK), but most commonly refers to the aviation association above.","zh":"（泛用）在不同国家可能指不同机构（例如英国的 AOPA UK），但最常见通常指上述航空协会。"},"examples":[{"en":"In the UK, he contacted AOPA for guidance on private flying.","zh":"在英国，他联系了 AOPA 寻求私人飞行方面的指导。"}]}],"synonyms":["Aircraft Owners and Pilots Association","A-O-P-A","AOPA UK (context-dependent)"],"phonetic":"/ˌeɪ oʊ piː ˈeɪ/","extraExplanation":["AOPA 通常按字母逐个读：A-O-P-A。写作时常直接用全大写，属于缩略语（initialism）。","在航空语境里，AOPA 经常出现在飞行训练、法规解读、机场政策、飞行安全教育等话题中。不同国家的 AOPA 组织可能各自独立，但名称相似。"]}
{"word":"AOQ","summary":{"en":"AOQ is an abbreviation; in business analytics it often means “Average Order Quantity,” but the exact meaning depends on context.","zh":"AOQ 是缩写；在商业数据分析中常指“平均每单数量”，但具体含义需结合上下文判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation used in business/analytics for “Average Order Quantity” (the average number of items/units per order).","zh":"（商业/数据分析）“Average Order Quantity”的缩写，意为“平均每笔订单数量/平均订购量”。"},"examples":[{"en":"Our AOQ increased after we introduced bundle discounts.","zh":"推出捆绑折扣后，我们的 AOQ（平均每单数量）提高了。"},{"en":"Track AOQ and AOV to understand customer buying behavior.","zh":"跟踪 AOQ（平均每单数量）和 AOV（平均客单价）来了解顾客购买行为。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation that can have different meanings depending on the field or community (often used as a label in internal documents, forums, or technical notes).","zh":"一个在不同领域/社群里可能代表不同含义的缩写（常见于内部文件、论坛或技术笔记中的标签）。"},"examples":[{"en":"What does AOQ stand for in this report?","zh":"在这份报告里，AOQ 代表什么？"},{"en":"Please define AOQ the first time you use it in an email.","zh":"在邮件里第一次使用 AOQ 时请先写出全称并解释。"}]}],"synonyms":["Average Order Quantity (spelled out)","avg. order quantity"],"phonetic":"/ˌeɪ.oʊˈkjuː/","extraExplanation":["AOQ 不是日常英语里固定的“单词”，更常见的是一种缩写。遇到缩写时，最稳妥的做法是：看上下文（行业、文档主题、同一段里有没有相关指标如 AOV、CAC、SKU 等），或直接询问/查阅该组织的缩写表（glossary）。","如果你把 AOQ 出现的句子或截图发来，我可以根据上下文帮你确定它在你那里的具体含义。"]}
{"word":"aor","summary":{"en":"AOR is an acronym most commonly meaning “Area of Responsibility” (the area someone is responsible for), and in business it can mean “Agent of Record” (the officially recognized agent).","zh":"AOR是一个缩写，最常见指“责任区”（某人/单位负责的范围）；在商业语境中也可指“指定代理/备案代理”（被正式认可代表客户的代理）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(acronym) Area of Responsibility: a geographic or organizational area that a person, unit, or organization is in charge of (common in the military, security, and management).","zh":"（缩写）责任区：某个人、单位或组织负责管理的地理或组织范围（常见于军队、安保与管理语境）。"},"examples":[{"en":"The commander changed our AOR to include the northern villages.","zh":"指挥官把我们的责任区（AOR）调整为包含北部的几个村庄。"},{"en":"Please report any incidents in your AOR by 5 p.m.","zh":"请在下午5点前上报你责任区（AOR）内的任何事件。"}]},{"partOfSpeech":"other","definition":{"en":"(acronym, business) Agent of Record: the officially recognized agent or agency representing a client (often in insurance or advertising).","zh":"（缩写，商业）备案代理/指定代理：被正式认可、代表客户的代理人或代理机构（常见于保险或广告行业）。"},"examples":[{"en":"Our company is the AOR for their insurance policy.","zh":"我们公司是他们保险保单的指定代理（AOR）。"},{"en":"They switched AORs after the contract ended.","zh":"合同结束后，他们更换了指定代理（AOR）。"}]},{"partOfSpeech":"other","definition":{"en":"(acronym, finance/retail) Authorization or Approved on Receipt: a note showing a purchase/charge was authorized or approved (usage varies by company/system).","zh":"（缩写，财务/零售）授权/收据批准：表示某笔消费或费用已获授权或批准的标记（不同公司/系统用法可能不同）。"},"examples":[{"en":"The expense was marked AOR in the system.","zh":"这笔费用在系统里被标记为AOR（已授权/已批准）。"},{"en":"Ask accounting what AOR means on this receipt.","zh":"问一下财务这张收据上的AOR是什么意思。"}]}],"synonyms":["area","jurisdiction","responsibility area","coverage area","designated agent"],"phonetic":"/ˌeɪ oʊ ˈɑr/","extraExplanation":["“AOR”不是一个固定含义的普通单词，而是缩写，具体意思高度依赖领域与上下文。最常见的是军队/安保里的 Area of Responsibility（责任区）。在商务里也常见 Agent of Record（指定代理/备案代理）。","读法通常按字母读：A-O-R。写作时多用大写（AOR）。如果你把它贴在句子里，我可以根据上下文帮你确定最准确的含义。"]}
{"word":"Aorangi","summary":{"en":"Aorangi is a Māori proper name, closely associated with Aoraki / Mount Cook in New Zealand, and more broadly used in Māori place names connected with sky/cloud imagery.","zh":"Aorangi是毛利语专有名称，与新西兰的Aoraki / 库克山密切相关；更广泛地也可见于带有“天空/云”意象的毛利地名中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun, Māori) Another form of the name for Aoraki / Mount Cook, the highest mountain in New Zealand.","zh":"（专有名词，毛利语）Aoraki / 库克山（新西兰最高峰）的另一种写法/称呼。"},"examples":[{"en":"We could see Aorangi from the valley on a clear morning.","zh":"在一个晴朗的早晨，我们从山谷里看见了Aorangi。"},{"en":"Aorangi (Aoraki / Mount Cook) is a major symbol in New Zealand’s Southern Alps.","zh":"Aorangi（Aoraki / 库克山）是新西兰南阿尔卑斯山的重要象征。"}]},{"partOfSpeech":"n.","definition":{"en":"A Māori word used in place names; often understood as relating to “sky” and “cloud(s)” (commonly interpreted as “cloud in the sky”).","zh":"（毛利语）用于地名的词，常与“天空”和“云”有关（常被解释为“天空中的云”）。"},"examples":[{"en":"You may see ‘Aorangi’ in New Zealand place names, especially where Māori heritage is recognized.","zh":"在新西兰的一些地名中你可能会看到“Aorangi”，尤其是在重视毛利文化传承的地区。"},{"en":"The name Aorangi reflects how closely Māori place names connect to the natural world.","zh":"Aorangi这个名字体现了毛利地名与自然世界的紧密联系。"}]}],"synonyms":["Aoraki","Mount Cook"],"phonetic":"/ˌaʊəˈræŋi/","extraExplanation":["“Aoraki”是更常见的毛利语写法；“Aorangi”可视为相关/变体写法，在部分地名、机构或历史用法中会出现。","新西兰很多地名源自毛利语，常用自然意象来命名（山、风、云、河等），因此像“Ao（世界/白天/云/天空的意象）+ rangi（天空）”这样的组合，容易被理解为与“天空与云”相关。","关于最高峰的官方称呼：如今常见为双名制“Aoraki / Mount Cook”，反映了毛利文化与殖民时期英文命名并存的历史背景。"]}
{"word":"aorist","summary":{"en":"Aorist is a grammatical tense/aspect (common in Ancient Greek) that presents an action as a single whole; it also refers to forms related to that tense.","zh":"Aorist 指一种语法时态/体（常见于古希腊语），把动作作为一个整体来叙述；也可作形容词指相关形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a verb tense (especially in Ancient Greek) that expresses an action as a single whole, without focusing on whether it was ongoing or completed","zh":"（尤指古希腊语中的）“不定过去时/简过去体”：把动作当作一个整体来叙述，不强调动作是否持续或是否完成"},"examples":[{"en":"In Ancient Greek, the aorist often tells what happened as a simple event in the past.","zh":"在古希腊语中，不定过去时常用来把过去发生的事当作一个简单事件来叙述。"},{"en":"The teacher explained why the aorist is different from the imperfect.","zh":"老师解释了为什么不定过去时和未完成过去时不同。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the aorist tense or to aorist forms","zh":"与不定过去时有关的；不定过去时的（形式）"},"examples":[{"en":"We practiced aorist verb forms in class.","zh":"我们在课上练习了不定过去时的动词形式。"}]}],"synonyms":["simple past (approx.)","preterite (context-dependent)"],"phonetic":"ˈeɪəɹɪst","extraExplanation":["“aorist”来自希腊语 aóristos，意思是“未限定的/不具体说明的”。它强调的是“体（aspect，叙述动作的方式）”而不只是“时态（tense，时间）”。因此它常被理解为“把动作当作一个整体来讲述”。","在英语里没有完全对应的语法形式，所以学习希腊语、圣经希腊语或语言学时更常见。翻译时有时会用英语一般过去时表达，但两者并不总是严格等同。"]}
{"word":"aoristic","summary":{"en":"Aoristic means “related to the aorist,” a verb form (especially in Greek) that presents an action as a whole, without focusing on duration.","zh":"aoristic意为“与aorist（简单/不定过去）有关”，指一种（尤指希腊语中的）动词形式，把动作作为整体呈现，不强调持续过程。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the aorist (a verb form in Greek and some other languages) that typically presents an action as a single whole, often without focusing on its duration or completion.","zh":"与“简单过去/不定过去”（aorist）有关的；指希腊语等语言中的一种动词形式，通常把动作当作一个整体来叙述，不强调持续时间或是否完成。"},"examples":[{"en":"In Ancient Greek, the aoristic tense often narrates events as simple, complete actions.","zh":"在古希腊语中，aoristic（aorist）常用来把事件叙述为简单、整体的动作。"},{"en":"The translator chose an aoristic form to keep the story moving quickly.","zh":"译者选择了aoristic形式，让叙事节奏更快。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Extended, less common) Describing a style of telling or describing events as timeless or as a single, undivided whole.","zh":"（引申，较少见）形容一种叙述/描写方式：把事件写得像“整体发生”、不切分过程，带有某种“无时间段”的感觉。"},"examples":[{"en":"The poem has an aoristic quality, as if the moment happens outside ordinary time.","zh":"这首诗带有aoristic的气质，仿佛那一刻发生在日常时间之外。"}]}],"synonyms":["aorist","aoristical","perfective (approx.)"],"phonetic":"/eɪ.əˈrɪs.tɪk/","extraExplanation":["“aorist”来自希腊语，常见于语法学与《圣经》希腊语（Koine Greek）的讨论中。学习者容易把它等同于英语的simple past，但更准确的理解是：它强调“把事件当作一个整体来看”，而不是强调动作持续多久。","在英语里“aoristic”很少出现在日常对话，多见于语言学、古典学、神学/圣经研究等学术语境。"]}
{"word":"aoristically","summary":{"en":"“Aoristically” means ‘in an aorist/aoristic way,’ describing an action as a single whole without emphasis on duration or repetition (mainly a linguistics term).","zh":"“aoristically”意为“以简略体/无时态细节的方式”，把动作当作一个整体来表达，不强调持续或反复（主要是语言学术语）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an aoristic way—expressing an action as a simple whole (often “past” in form) without focusing on its duration, repetition, or completion; used mainly in linguistics and grammar discussions.","zh":"以“无时态细节/简略体（aorist）”的方式——把动作当作一个整体来表达（形式上常为过去时），不强调持续、反复或是否完成；主要用于语言学与语法讨论。"},"examples":[{"en":"In Ancient Greek, this verb is used aoristically to report the event as a whole.","zh":"在古希腊语中，这个动词以 aoristically 的方式使用，用来把事件当作整体来陈述。"},{"en":"The narrator sometimes speaks aoristically, stating what happened without highlighting how long it took.","zh":"叙述者有时会用 aoristically 的方式说话，只说发生了什么，而不强调用了多久。"}]}],"synonyms":["in the aorist","indefinitely","without focusing on duration","as a whole"],"phonetic":"/ˌeɪəˈrɪstɪkli/","extraExplanation":["“aoristically”非常少见，通常只在语法/语言学写作里出现。日常英语更常用的表达是：“in the aorist,” “in an aorist sense,” 或更通俗的 “without focusing on duration/as a whole.”","“aorist（简略体）”这个概念最常见于古希腊语语法，也可用于讨论某些语言中“把动作当作整体呈现”的动词体（aspect）用法；它更偏向“体”的视角，而不完全等同于英语的“时态”。"]}
{"word":"aorists","summary":{"en":"“Aorists” is the plural of “aorist,” a verb form in languages like Ancient Greek that describes an action as a whole (often in past narration).","zh":"“aorists”是“aorist”的复数，指古希腊语等语言中的一种动词形式，常用于叙述过去事件，把动作作为整体来表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of aorist: a verb form (especially in Ancient Greek and some other languages) that typically presents an action as a complete whole, without focusing on its duration or whether it was repeated.","zh":"aorist（不定过去时/简略过去时）的复数：一种动词形式，常见于古希腊语等语言，通常把动作当作“整体完成”来叙述，不强调持续时间或是否反复发生。"},"examples":[{"en":"In this chapter, the author compares Greek aorists with English simple past forms.","zh":"在这一章里，作者把希腊语的 aorists 和英语的一般过去时作比较。"},{"en":"Many verbs in the text appear in aorists to tell events in a straightforward sequence.","zh":"这篇文本里有很多动词用 aorists，以便按顺序直接叙述事件。"}]}],"synonyms":["aorist forms","aorist tense forms","simple past (approx.)"],"phonetic":"/ˈeɪ.ə.rɪsts/","extraExplanation":["“aorist”常见于语言学/古典语言学习中，尤其是古希腊语与《新约》希腊语。它常被解释为“把事件当作一个整体来看”的过去时态/体（aspect）形式，因此有时会译作“简略过去时”或“概括过去”。","英语里没有完全对应的单一形式：英语一般过去时（simple past）有时能表达类似感觉，但英语更常用语境、时间状语和上下文来体现“整体/完成”的视角。"]}
{"word":"Aornis","summary":{"en":"Aornis is a rare spelling of Aornos, an ancient rock-fort linked to Alexander the Great’s siege.","zh":"Aornis 是 Aornos 的少见拼写，指与亚历山大大帝围攻相关的古代岩堡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A rare spelling of **Aornos**, an ancient fortified rock/stronghold in the region of today’s northern Pakistan, famous for being besieged by **Alexander the Great** (327 BCE).","zh":"（专有名词）**Aornis** 是 **Aornos** 的少见拼写，指位于今巴基斯坦北部一带的古代岩堡/要塞，以公元前 327 年 **亚历山大大帝** 围攻此地而闻名。"},"examples":[{"en":"Some histories describe Alexander’s hardest siege as the capture of Aornis (Aornos).","zh":"一些史书把亚历山大最艰难的围城战描述为攻下 Aornis（Aornos）。"},{"en":"The name Aornis appears in older or inconsistent spellings of classical sources.","zh":"Aornis 这一写法常见于较旧或拼写不统一的古典文献中。"}]}],"synonyms":["Aornos"],"phonetic":"eɪˈɔrnɪs","extraExplanation":["“Aornos”源自古希腊语：a-（无、非）+ ornis（鸟），有“无鸟之地/鸟不到达的地方”的含义，传说该岩堡高峻险绝，因此得名。","现代学术写法更常见的是 **Aornos** 而非 **Aornis**；如果你是在文章/地图/书里看到 Aornis，通常可以把它理解为同一地点的异拼。"]}
{"word":"Aornum","summary":{"en":"“Aornum” isn’t a standard English word; it’s likely a misspelling or a proper name.","zh":"“Aornum”不是标准英语单词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. “Aornum” is likely a misspelling, a username, or a proper name. If you meant a different word, please share the sentence or the correct spelling.","zh":"不是标准英语单词。“Aornum”很可能是拼写错误、用户名或专有名词。如果你想查的是另一个词，请提供例句或正确拼写。"},"examples":[{"en":"I couldn’t find “Aornum” in an English dictionary—could you show me the sentence where you saw it?","zh":"我在英语词典里找不到“Aornum”——你能把你看到它的句子发我吗？"},{"en":"Did you mean “aurum” (gold) or “aorist” (a grammar term)?","zh":"你是不是想写“aurum”（金）或 “aorist”（语法术语：简单过去时态之一）？"}]}],"extraExplanation":["“Aornum”看起来像把两个部分拼在一起的形式（例如 A + or + num），但英语里没有常见词条是这样拼的。","如果你是在游戏名、账号名、品牌名或小说人物名里见到它，它可能是自造词（invented word）或拉丁/希腊词根的变体。","常见的相近拼写可能包括：aurum（拉丁语“黄金”）、aorist（语言学术语）、ornum（很少见，可能是专名/误拼）。把原句贴出来我就能更准确判断。"]}
{"word":"aorta","summary":{"en":"The aorta is the body’s main artery, carrying blood from the heart to the rest of the body.","zh":"aorta 指主动脉，是人体最大的动脉，将血液从心脏输送到全身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the main (largest) artery that carries blood from the heart to the rest of the body","zh":"主动脉：人体最大的一条动脉，把血液从心脏输送到全身"},"examples":[{"en":"The aorta carries oxygen-rich blood from the heart to the body.","zh":"主动脉把富含氧气的血液从心脏输送到全身。"},{"en":"Doctors checked his aorta during the heart exam.","zh":"医生在心脏检查时查看了他的主动脉。"}]}],"synonyms":["main artery"],"phonetic":"/eɪˈɔːrtə/","extraExplanation":["“aorta”来自希腊语，原意与“悬挂/提起”有关，早期解剖学家用它来指从心脏“发出”的大血管。","常见相关词：aortic（主动脉的），aortic valve（主动脉瓣），aortic aneurysm（主动脉瘤）。这些多见于医学语境。"]}
{"word":"aortae","summary":{"en":"“Aortae” means “aortas,” the plural of “aorta” (the body’s main artery).","zh":"“aortae”表示“主动脉”的复数，相当于“aortas”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of aorta: the main artery that carries oxygen-rich blood from the heart to the rest of the body.","zh":"aorta（主动脉）的复数：把含氧血液从心脏输送到全身的主要动脉。"},"examples":[{"en":"In most people, there is only one aorta, not multiple aortae.","zh":"大多数人只有一条主动脉，而不是多条主动脉（aortae）。"},{"en":"The diagram compares the aortae of different animals.","zh":"这张图比较了不同动物的主动脉（aortae）。"}]}],"synonyms":["aortas"],"phonetic":"/eɪˈɔrtiː/","extraExplanation":["“aortae”是源自拉丁语/希腊语传统的复数形式（类似formula → formulae）。在现代医学英语里，更常见、也更口语化的复数通常写作“aortas”。"]}
{"word":"aortal","summary":{"en":"Aortal means “related to the aorta,” the main artery from the heart.","zh":"aortal 意为“与主动脉有关的”，主动脉是从心脏发出的主要动脉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the aorta (the body’s main artery that carries blood from the heart to the rest of the body).","zh":"与主动脉有关的（主动脉是把血液从心脏输送到全身的主要动脉）。"},"examples":[{"en":"The doctor heard an aortal murmur during the exam.","zh":"医生在检查时听到了与主动脉有关的杂音。"},{"en":"Aortal pressure can change with exercise and stress.","zh":"主动脉压力会随着运动和压力而变化。"}]}],"synonyms":["aortic"],"phonetic":"/eɪˈɔrtəl/","extraExplanation":["“aortal”在医学英语里可见，但更常用的形容词是“aortic”（如：aortic valve 主动脉瓣，aortic aneurysm 主动脉瘤）。学习时优先记“aortic”，遇到“aortal”可理解为同义用法。"]}
{"word":"aortarctia","summary":{"en":"“Aortarctia” is not a standard English word; it usually refers to **coarctation of the aorta** (aortic narrowing).","zh":"“aortarctia”不是规范英语词，通常指**主动脉缩窄**（主动脉变窄）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) A misspelling or informal shortening referring to **coarctation of the aorta**—a congenital condition where the aorta (the main artery from the heart) is narrowed.","zh":"（医学）常见的拼写错误或非正式缩写，通常指**主动脉缩窄**——一种先天性疾病，主动脉（从心脏输出血液的主要动脉）出现狭窄。"},"examples":[{"en":"The chart likely meant *aortic coarctation*, not “aortarctia.”","zh":"病历里很可能是想写“主动脉缩窄（aortic coarctation）”，而不是“aortarctia”。"},{"en":"Coarctation of the aorta can cause high blood pressure in the arms.","zh":"主动脉缩窄可能导致上肢血压升高。"}]}],"synonyms":["coarctation of the aorta","aortic coarctation","CoA (medical abbreviation)"],"phonetic":"/ˌeɪɔrˈtɪk ˌkoʊɑrkˈteɪʃən/","extraExplanation":["“aortarctia”不是常见或标准的英语医学术语；更常见、规范的写法是 **coarctation of the aorta**（也写作 **aortic coarctation**）。","词源提示：**coarctation** 来自拉丁语，含义是“使变窄/收紧”。在医学语境中，它指血管或管道的“狭窄”。","如果你是在论文、病历或检验报告里看到这个词，建议回看原文是否其实是 **aorta coarctation / aortic coarctation**，或请医生/老师确认具体指代。"]}
{"word":"aortas","summary":{"en":"“Aortas” is the plural form of “aorta,” the main artery carrying blood from the heart.","zh":"“aortas”是“aorta（主动脉）”的复数，指把血液从心脏输送到全身的主要动脉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of aorta; the main arteries that carry blood from the heart to the rest of the body (one in each person or animal).","zh":"aorta（主动脉）的复数；把血液从心脏输送到全身的主要动脉（每个人或动物体内通常只有一条）。"},"examples":[{"en":"In anatomy class, we compared the aortas of different mammals.","zh":"在解剖课上，我们比较了不同哺乳动物的主动脉。"},{"en":"The diagram shows how the heart connects to the aortas in the fetus.","zh":"这张示意图展示了胎儿心脏与主动脉的连接方式。"}]}],"synonyms":["aorta (singular)","main artery","principal artery"],"phonetic":"/eɪˈɔrtəz/","extraExplanation":["“aorta”来自希腊语，原意与“悬挂、提起”有关，因为古人认为这条大血管像是从心脏“悬挂”出来的。","在日常英语中更常见的是单数 aorta；复数 aortas 多出现在医学、解剖学、比较生物学等语境中。"]}
{"word":"aortectasia","summary":{"en":"Aortectasia means a mild dilation (widening) of the aorta.","zh":"aortectasia 指主动脉轻度扩张（变宽）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mild widening (dilation) of the aorta that is larger than normal but not as severe as an aneurysm","zh":"主动脉轻度扩张：主动脉比正常更宽，但通常未达到“动脉瘤”那样明显的程度"},"examples":[{"en":"The CT report noted aortectasia, so the doctor recommended regular imaging follow-up.","zh":"CT报告提示主动脉轻度扩张，所以医生建议定期复查影像。"},{"en":"Aortectasia is often monitored over time to make sure it does not enlarge further.","zh":"主动脉轻度扩张常需要长期观察，以确保不会继续变大。"}]}],"synonyms":["aortic ectasia","aortic dilation","mild aortic enlargement"],"phonetic":"/eɪˌɔr.tɛkˈteɪ.ʒə/","extraExplanation":["这是医学影像报告中常见的术语，通常与“主动脉直径偏大/扩张”相关；是否需要处理取决于具体部位（胸主动脉或腹主动脉）、直径大小、增长速度及个人风险因素（如高血压、吸烟、家族史等）。","与 aneurysm（动脉瘤）不同：ectasia 往往指“轻度或中度扩张”；而 aneurysm 通常指更明显的局部扩张，临床上更关注破裂风险。具体界值会因部位与指南而异，应以医生解释为准。","词源上，ecto-/ectasia 来自希腊语，表示“扩张/拉伸”；aort- 指“主动脉”。"]}
{"word":"aortectasis","summary":{"en":"Aortectasis means an abnormal widening of the aorta (aortic dilatation).","zh":"aortectasis 指主动脉的异常扩张（主动脉扩张/主动脉扩张症）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"abnormal widening (dilatation) of the aorta, the body’s main artery","zh":"主动脉扩张（主动脉异常变宽/扩张）"},"examples":[{"en":"The CT scan showed mild aortectasis without signs of rupture.","zh":"CT 显示轻度主动脉扩张，但没有破裂迹象。"},{"en":"Doctors may monitor aortectasis over time with repeat imaging.","zh":"医生可能会通过复查影像来长期监测主动脉扩张。"}]}],"synonyms":["aortic ectasia","aortic dilatation","aortic dilation"],"phonetic":"/eɪˌɔr.tɛkˈteɪ.sɪs/","extraExplanation":["“aortectasis”常见于影像报告或病历中，属于医学用语，日常英语里不太常用。","它通常表示“扩张/变宽”，不一定达到“aneurysm（动脉瘤）”那种局部明显膨出、风险更高的程度；是否属于动脉瘤需要结合直径数值、部位和医生的诊断标准。","相关构词：aort-（主动脉）+ -ectasis（扩张）。"]}
{"word":"aortic","summary":{"en":"Aortic means “related to the aorta,” the main artery leaving the heart.","zh":"aortic 意为“与主动脉有关的”，主动脉是从心脏通往全身的主要动脉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the aorta (the body’s main artery that carries blood from the heart to the rest of the body).","zh":"与主动脉有关的（主动脉是把血液从心脏输送到全身的主要动脉）。"},"examples":[{"en":"The doctor heard an aortic murmur during the exam.","zh":"医生在检查时听到了主动脉区杂音。"},{"en":"He was diagnosed with aortic stenosis, which can reduce blood flow.","zh":"他被诊断为主动脉瓣狭窄，这可能会减少血流。"},{"en":"Aortic surgery may be needed if the aorta is severely damaged.","zh":"如果主动脉严重受损，可能需要做主动脉手术。"}]}],"synonyms":["aortal","of the aorta"],"phonetic":"/eɪˈɔːr.tɪk/","extraExplanation":["“aortic”来自“aorta（主动脉）”，常见于医学语境，常搭配：aortic valve（主动脉瓣）、aortic aneurysm（主动脉瘤）、aortic dissection（主动脉夹层）、aortic arch（主动脉弓）。日常英语里不常用，更多出现在医生沟通、体检报告或健康科普中。"]}
{"word":"aorticorenal","summary":{"en":"A medical adjective meaning “related to the aorta and the kidney,” often describing connecting vessels.","zh":"医学形容词，表示“与主动脉和肾脏相关”，常用于描述连接两者的血管等结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the aorta and the kidney (renal), especially to blood vessels connecting them (e.g., the aorticorenal arteries).","zh":"与主动脉和肾脏（肾的）有关的，尤指连接两者的血管（如“主动脉肾动脉”）。"},"examples":[{"en":"The scan showed narrowing near the aorticorenal region.","zh":"扫描显示主动脉—肾区域附近有狭窄。"},{"en":"The surgeon identified the aorticorenal artery before clamping the vessel.","zh":"外科医生在夹闭血管前确认了主动脉肾动脉。"}]}],"synonyms":["aorto-renal","aortorenal"],"phonetic":"/eɪˌɔrtoʊˈriːnəl/","extraExplanation":["这是医学解剖学用语，由 aortico-（与主动脉有关）+ renal（与肾有关）构成，多见于描述血管、神经或解剖位置（例如“aorticorenal arteries/lymph nodes”）。","在日常英语中几乎不会使用，主要出现在医学教材、影像学报告和手术记录里。"]}
{"word":"aortism","summary":{"en":"A rare medical term meaning a disease or abnormal condition of the aorta, mostly found in older usage.","zh":"一个较少见的医学词，指主动脉的疾病或异常状态，多见于旧式用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) A condition involving disease or abnormality of the aorta (the body’s main artery), especially as described in older medical writing.","zh":"（医学）指与主动脉（人体最大动脉）有关的疾病或异常状况；多见于较早期的医学文献表述。"},"examples":[{"en":"The doctor ruled out aortism after the imaging showed the aorta was normal.","zh":"影像检查显示主动脉正常后，医生排除了“aortism（主动脉病变）”的可能。"},{"en":"In older texts, “aortism” sometimes referred broadly to symptoms linked to aortic disease.","zh":"在较早的文献中，“aortism”有时被宽泛地用来指与主动脉疾病相关的一些症状。"}]}],"synonyms":["aortic disease","aortopathy","aorticism (rare)"],"phonetic":"/eɪˈɔr.tɪ.zəm/","extraExplanation":["“aortism”在现代英语医学中非常少见，很多情况下会改用更具体、标准的术语，例如：aortic disease（主动脉疾病）、aortopathy（主动脉病变）、aortic aneurysm（主动脉瘤）、aortic stenosis（主动脉瓣狭窄）等。","如果你是在报告、论文或病历里看到它，建议结合上下文（例如是否提到 aneurysm、stenosis、dissection 等）来确定更准确的现代对应词。"]}
{"word":"aortitis","summary":{"en":"Aortitis means inflammation of the aorta (the main artery).","zh":"aortitis 指“主动脉炎”，即主动脉发生炎症。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation of the aorta (the body’s main artery), which can cause chest/back pain and may lead to serious complications if not treated.","zh":"主动脉炎：主动脉（人体最主要的动脉）发生炎症，可能引起胸背部疼痛；若不治疗，可能导致严重并发症。"},"examples":[{"en":"The CT scan suggested aortitis, so the doctor ordered more blood tests.","zh":"CT 扫描提示可能是主动脉炎，因此医生又安排了更多血液检查。"},{"en":"Aortitis can be associated with autoimmune diseases.","zh":"主动脉炎可能与自身免疫性疾病有关。"},{"en":"After treatment, her symptoms improved and the aortitis gradually resolved.","zh":"治疗后，她的症状改善，主动脉炎也逐渐缓解。"}]}],"synonyms":["inflammation of the aorta"],"phonetic":"/eɪˌɔrˈtaɪtɪs/","extraExplanation":["词源提示：aort- 来自 aorta（主动脉），-itis 表示“炎症”（如 bronchitis 支气管炎、arthritis 关节炎）。","常见背景：主动脉炎可能与感染（如梅毒、结核等）、自身免疫/血管炎（如巨细胞动脉炎、Takayasu 动脉炎）相关。具体病因与治疗需要由医生通过影像学与化验综合判断。","使用场景：这是医学术语，日常英语中不常见；在病历、影像报告、研究论文中更常出现。"]}
{"word":"aortoclasia","summary":{"en":"Aortoclasia means a rupture of the aorta.","zh":"aortoclasia 指“主动脉破裂”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Rupture (tearing or breaking) of the aorta, often due to severe trauma or disease.","zh":"主动脉破裂（撕裂或断裂），常因严重外伤或疾病导致。"},"examples":[{"en":"The crash victim died from aortoclasia caused by blunt chest trauma.","zh":"这名车祸伤者因钝性胸部外伤导致主动脉破裂而死亡。"},{"en":"Doctors suspected aortoclasia after the patient suddenly collapsed and went into shock.","zh":"患者突然倒地并出现休克后，医生怀疑发生了主动脉破裂。"}]}],"synonyms":["aortic rupture","aortic tear"],"phonetic":"/eɪˌɔrtoʊˈkleɪʒə/","extraExplanation":["这个词较少见，更多时候医学写作会用更常见的表达，如 “aortic rupture”（主动脉破裂）或 “aortic tear”（主动脉撕裂）。","词根提示：aorto- 表示“主动脉”，-clasia 来自希腊语，表示“破碎、折断”。理解词根有助于猜测含义。"]}
{"word":"aortoclasis","summary":{"en":"A rare medical noun meaning the crushing or intentional rupture of the aorta, mostly found in historical surgical writing.","zh":"一个少见的医学名词，指对主动脉进行压碎或人为破裂，多见于历史外科文献。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine, surgery) The crushing or deliberate rupture of the aorta, historically described as a technique to stop severe bleeding during surgery (now extremely rare).","zh":"（医学/外科）对主动脉进行压碎或人为破裂的操作；历史上曾被描述为用于在手术中控制严重出血的方法（现已极少使用）。"},"examples":[{"en":"Aortoclasis is a historical term and is rarely encountered in modern surgical practice.","zh":"aortoclasis 是一个历史性术语，在现代外科实践中很少见到。"},{"en":"The textbook mentioned aortoclasis only in a section on older hemostatic techniques.","zh":"那本教材只在介绍旧式止血技术的章节里提到 aortoclasis。"}]}],"synonyms":["aortic rupture (related)","aortic injury (broader)"],"phonetic":"/ˌeɪɔrtoʊˈkleɪsɪs/","extraExplanation":["词源上可拆为 aorto-（主动脉）+ -clasis（“打碎、折断、破裂”，源自希腊语）。因此该词字面意思接近“主动脉的破裂/压碎”。","这类术语多见于较早期的外科或病理解剖文献；现代医学更常用更具体的表达（如 aortic rupture 主动脉破裂、aortic injury 主动脉损伤），并以血管修补/置换等方法处理。"]}
{"word":"aortographic","summary":{"en":"A medical adjective meaning “related to aortography (imaging of the aorta).”","zh":"医学形容词，意为“与主动脉造影（主动脉成像检查）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to aortography (a medical imaging test that uses contrast dye and X-rays/angiography to show the aorta).","zh":"与主动脉造影有关的（主动脉造影是一种使用造影剂与X光/血管造影来显示主动脉的影像检查）。"},"examples":[{"en":"The report describes an aortographic study showing a narrowing of the aorta.","zh":"报告描述了一项主动脉造影检查，显示主动脉有狭窄。"},{"en":"Aortographic images can help doctors evaluate an aneurysm.","zh":"主动脉造影图像可以帮助医生评估动脉瘤。"}]}],"synonyms":["aortography-related","angiographic (broader)"],"phonetic":"/ˌeɪɔrtoʊˈɡræfɪk/","extraExplanation":["这是一个医学/影像学用词，日常英语中很少见。更常见的相关名词是 aortography（主动脉造影）或 aortogram（主动脉造影图/结果）。","构词提示：aorto- 表示“主动脉”，-graphic 表示“记录/成像的、图像的”。","如果你是在论文或检查单上看到该词，也可能出现更常用的表达：aortographic imaging / aortographic findings（主动脉造影成像/发现）。"]}
{"word":"aortographies","summary":{"en":"“Aortographies” is the plural of “aortography,” a test that images the aorta using contrast dye and X‑ray-type imaging.","zh":"“aortographies”是“aortography”的复数，指用造影剂配合X光等影像对主动脉进行成像检查。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical imaging test in which contrast dye is injected and X‑rays (or similar imaging) are used to show the aorta (the body’s main artery).","zh":"（医学）主动脉造影：向血管注入造影剂后，用X光等影像检查来显示主动脉（人体最大动脉）的检查。"},"examples":[{"en":"The doctor ordered an aortography to check for narrowing in the aorta.","zh":"医生安排做主动脉造影，以检查主动脉是否有狭窄。"},{"en":"Aortography can help locate an aneurysm before surgery.","zh":"主动脉造影可以在手术前帮助定位动脉瘤。"}]}],"synonyms":["aortic angiography","angiography","aorta imaging"],"phonetic":"/ˌeɪɔrˈtɑɡrəfi/","extraExplanation":["“aortographies”是名词复数形式；单数是“aortography”。","词源上，aorto- 表示“主动脉”，-graphy 表示“记录/成像”。在现代医学中也常用更具体的说法，如“CT angiography (CTA)”或“MR angiography (MRA)”来描述采用CT或核磁的血管成像。"]}
{"word":"aortography","summary":{"en":"Aortography is an X-ray angiography test that uses contrast dye to image the aorta.","zh":"Aortography 指用造影剂配合X光血管造影来观察主动脉的检查。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical imaging test that uses X-rays (angiography) and contrast dye to show the aorta (the body’s main artery).","zh":"一种医学影像检查：通过注射造影剂并使用X光（血管造影）来显示主动脉（人体的主干动脉）。"},"examples":[{"en":"The cardiologist ordered an aortography to check for an aortic aneurysm.","zh":"心脏科医生安排做主动脉造影，以检查是否有主动脉瘤。"},{"en":"During aortography, a contrast dye is injected so the aorta can be seen clearly on X-ray images.","zh":"在主动脉造影过程中，会注射造影剂，让主动脉在X光影像上更清晰。"}]}],"synonyms":["aortic angiography","angiography of the aorta","aortogram"],"phonetic":"/ˌeɪɔrˈtɑɡrəfi/","extraExplanation":["“aortography”由 aorto-（主动脉）+ -graphy（记录、成像）构成，字面意思是“对主动脉进行成像/记录”。","在现代临床中，很多场景会改用更常见的检查名称或技术（如 CT angiography/CTA 主动脉CT血管造影，或 MRI/MRA），但“aortography”仍可用来指传统的X线导管造影方式。"]}
{"word":"aortoiliac","summary":{"en":"A medical adjective meaning “related to the aorta and the iliac arteries.”","zh":"医学形容词，表示“与主动脉及髂动脉有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the aorta (the body’s main artery) and the iliac arteries (major arteries in the pelvis that supply the legs).","zh":"与主动脉（人体主要动脉）及髂动脉（骨盆内通向下肢的重要动脉）有关的。"},"examples":[{"en":"The CT scan showed aortoiliac atherosclerosis.","zh":"CT 扫描显示存在主动脉-髂动脉粥样硬化。"},{"en":"He was treated for aortoiliac occlusive disease that reduced blood flow to his legs.","zh":"他接受了主动脉-髂动脉闭塞性疾病的治疗，该病会减少流向下肢的血流。"},{"en":"The surgeon planned an aortoiliac bypass to restore circulation.","zh":"外科医生计划进行主动脉-髂动脉旁路手术以恢复血液循环。"}]}],"synonyms":["aorto-iliac (variant spelling)","aortic and iliac (descriptive phrase)"],"phonetic":"/ˌeɪɔrtoʊˈɪliæk/","extraExplanation":["这是一个医学/解剖学术语，常用于血管疾病语境，尤其是“aortoiliac occlusive disease（主动脉-髂动脉闭塞性疾病）”和“aortoiliac atherosclerosis（主动脉-髂动脉粥样硬化）”。","词形结构：aorto- 表示“主动脉的”，iliac 表示“髂（骨盆区域）的”。临床上常指主动脉分叉处及两侧髂动脉这一段血管区域。","在日常英语里不常见，主要出现在影像学报告、血管外科记录和医学论文中。"]}
{"word":"aortolith","summary":{"en":"A rare medical term for a calcified, stone-like mass in the aorta.","zh":"一个少见的医学术语，指主动脉内结石样的钙化团块。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A calcified stone-like mass (a concretion) in the aorta, usually formed from hardened deposits such as calcium.","zh":"主动脉内的“结石样”钙化团块（结石/硬化物），通常由钙等沉积物硬化形成。"},"examples":[{"en":"The CT scan suggested an aortolith near the abdominal aorta.","zh":"CT 扫描提示腹主动脉附近可能有主动脉结石样钙化团块。"},{"en":"Aortoliths are rare and are usually discussed in specialized medical reports.","zh":"主动脉结石样钙化团块较少见，通常出现在专业医学报告中。"}]}],"synonyms":["aortic calculus","calcified aortic plaque (related)","vascular calcification (broader)"],"phonetic":"ˈeɪɔrtoʊˌlɪθ","extraExplanation":["这是医学/病理学用语，日常英语中几乎不用。词由 aorto-（主动脉）+ -lith（石、结石）构成，类似的词还有 nephrolith（肾结石）和 cholelith（胆结石）。","如果你是在检查报告或论文里看到它，很多时候指“明显钙化/硬化的沉积物”。是否需要处理取决于位置、大小与是否影响血流等因素，应由医生解读。"]}
{"word":"aortomalacia","summary":{"en":"Aortomalacia is a medical term meaning abnormal softening/weakening of the aorta.","zh":"aortomalacia 是医学术语，指主动脉的异常软化或变弱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine) Abnormal softening or weakening of the aorta (the body’s main artery).","zh":"（医学）主动脉软化：主动脉（人体最主要的动脉）组织异常变软或变弱。"},"examples":[{"en":"The report mentioned possible aortomalacia, so the doctor ordered more imaging tests.","zh":"报告提到可能存在主动脉软化，因此医生安排了更多影像检查。"},{"en":"Aortomalacia is a rare term and is usually discussed in specialized medical contexts.","zh":"“主动脉软化”这个词较少见，通常出现在较专业的医学语境中。"}]}],"synonyms":["aortic malacia","softening of the aorta"],"phonetic":"/eɪˌɔrtoʊməˈleɪʃə/","extraExplanation":["词源拆解：aorto- 表示“主动脉”，-malacia 表示“软化/变软”（常见于医学术语，如 osteomalacia“骨软化”）。","使用提示：该词在日常英语里几乎不会出现，更常见的是用更具体的诊断或描述来表达，如 “weakening of the aortic wall（主动脉壁变弱）”。","学习延伸：看到 -malacia 结尾的词，通常可以理解为“某组织/器官的软化”。"]}
{"word":"aortomalaxis","summary":{"en":"A rare medical term meaning abnormal softening of the aorta’s wall.","zh":"一个少见的医学词，指主动脉壁异常软化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) abnormal softening of the wall of the aorta (the body’s main artery).","zh":"（医学）主动脉壁的异常软化（主动脉是人体最主要的动脉）。"},"examples":[{"en":"Aortomalaxis is a rare finding and may increase the risk of an aortic tear.","zh":"主动脉软化是一种较少见的发现，可能增加主动脉撕裂的风险。"},{"en":"The doctor ordered imaging tests to check for signs of aortomalaxis.","zh":"医生安排了影像检查，以查看是否有主动脉软化的迹象。"}]}],"synonyms":["aortomalacia","softening of the aorta"],"phonetic":"/ˌeɪɔrtoʊməˈleɪksɪs/","extraExplanation":["这个词非常少见，临床与学术写作里更常见的形式是 **aortomalacia**（主动脉软化）。两者构词逻辑相同：**aorto-**（主动脉）+ **-malacia**（软化）。","属于高度专业的医学词汇，一般不会出现在日常英语中；常见于病理报告、影像学描述或相关研究文献中。"]}
{"word":"aortopathy","summary":{"en":"Aortopathy means any disease or abnormality of the aorta.","zh":"aortopathy 指“主动脉病变”，即主动脉的任何疾病或异常。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) any disease or abnormal condition affecting the aorta (the body’s main artery).","zh":"（医学）主动脉病变；泛指影响主动脉（人体主干动脉）的任何疾病或异常情况。"},"examples":[{"en":"The CT scan showed signs of aortopathy, so the doctor ordered closer follow-up.","zh":"CT 显示有主动脉病变的迹象，所以医生安排了更密切的随访。"},{"en":"In some patients, aortopathy can lead to an enlarged aorta and a higher risk of dissection.","zh":"在一些患者中，主动脉病变可能导致主动脉扩张，并增加主动脉夹层的风险。"},{"en":"People with certain genetic conditions may be screened regularly for aortopathy.","zh":"患有某些遗传性疾病的人可能需要定期筛查主动脉病变。"}]}],"synonyms":["aortic disease","aortic pathology"],"phonetic":"/eɪˈɔrtoʊˌpæθi/","extraExplanation":["词源构成：aorto- 表示“主动脉”，-pathy 表示“疾病/病变”。","临床上它常作为“总称”使用，可能包含主动脉扩张（aneurysm/ectasia）、主动脉壁结构异常、炎症性疾病，以及与遗传综合征（如马凡综合征等）相关的主动脉问题。","这是偏专业的医学术语，日常英语中更常见的说法是具体疾病名称，例如 aortic aneurysm（主动脉瘤）或 aortic dissection（主动脉夹层）。"]}
{"word":"aortoptosia","summary":{"en":"A rare medical term meaning abnormal downward displacement of the aorta.","zh":"一个少见的医学术语，指主动脉异常下移（下垂）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abnormal downward displacement (drooping) of the aorta (the body’s main artery).","zh":"主动脉下垂；指主动脉出现异常的向下移位（下坠）。"},"examples":[{"en":"The radiology report mentioned possible aortoptosia, so the doctor ordered further imaging.","zh":"影像报告提到可能存在主动脉下垂，因此医生安排了进一步检查。"},{"en":"Aortoptosia is a rare medical term and is usually discussed in specialist contexts.","zh":"“主动脉下垂”是较少见的医学术语，通常出现在专科语境中。"}]}],"synonyms":["aortoptosis","downward displacement of the aorta"],"phonetic":"/ˌeɪɔrtoʊpˈtoʊʒiə/","extraExplanation":["这个词非常罕见，临床与文献中更常见的形式是 **aortoptosis**（-ptosis 表示“下垂/下坠”，如 eyelid ptosis 眼睑下垂）。如果你是在论文、病历或影像报告里看到 **aortoptosia**，有可能是拼写变体或拼写错误，建议对照原始来源或询问专业人士。","构词理解：**aorto-** 表示“主动脉”，**-ptosis** 表示“下垂/下移”。掌握这些词根词缀有助于你读懂很多医学英语。"]}
{"word":"aortoptosis","summary":{"en":"A medical term meaning the aorta is abnormally drooped or displaced downward.","zh":"医学术语，指主动脉异常下垂或向下移位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) A drooping or downward displacement of the aorta (the body’s main artery).","zh":"（医学）主动脉下垂；主动脉向下移位（身体主要动脉的位置下降）。"},"examples":[{"en":"In older medical texts, aortoptosis was described as a downward displacement of the aorta.","zh":"在较早的医学文献中，aortoptosis 被描述为主动脉向下移位。"},{"en":"The report mentioned possible aortoptosis, but the clinician recommended further imaging to confirm the finding.","zh":"报告提到可能存在 aortoptosis，但临床医生建议进一步影像检查以确认。"}]}],"synonyms":["aortic displacement","downward displacement of the aorta"],"phonetic":"/ˌeɪɔrtoʊpˈtoʊsɪs/","extraExplanation":["这是一个相对少见、偏旧的医学术语，临床上更常见的表述通常会直接写“aortic displacement（主动脉移位）”或用影像学描述具体位置变化。","词源上由 aorto-（主动脉）+ -ptosis（下垂、脱垂）构成；-ptosis 也常见于医学词汇，如 ptosis（上睑下垂）、nephroptosis（肾下垂）。","若你在检查报告或文献中遇到该词，通常需要结合 CT/MRI/超声等影像所见与症状来理解其意义；单独出现不一定代表明确诊断。"]}
{"word":"aortorrhaphy","summary":{"en":"Aortorrhaphy means the surgical suturing of the aorta to repair it.","zh":"aortorrhaphy 指“主动脉缝合术”，即用缝线外科修补主动脉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical procedure to stitch (suture) the aorta, usually to repair an injury, tear, or incision in the aorta.","zh":"主动脉缝合术：一种外科手术，通过缝合（缝线）修补主动脉，常用于修复主动脉的损伤、撕裂或手术切口。"},"examples":[{"en":"After the traumatic rupture was found, the surgeon performed an aortorrhaphy to repair the aorta.","zh":"发现外伤性破裂后，外科医生进行了主动脉缝合术来修复主动脉。"},{"en":"The operative note described aortorrhaphy with careful control of bleeding.","zh":"手术记录描述了进行主动脉缝合术并仔细控制出血。"}]}],"synonyms":["aortic suturing","aortic repair (suturing)"],"phonetic":"/eɪˌɔrtoʊˈræfi/","extraExplanation":["这是一个医学术语，多用于外科/心血管外科语境。词源上可拆分为 aorto-（主动脉）+ -rrhaphy（缝合术；来自希腊语 rhaphē，意为“缝合”）。","临床上通常会在严重外伤、主动脉壁撕裂（如夹层相关情况）、或某些需要切开主动脉的手术后进行缝合修补；具体术式与风险需要由专业医生评估。"]}
{"word":"aortosclerosis","summary":{"en":"A medical term for hardening and thickening of the aorta’s wall.","zh":"医学术语：主动脉血管壁的硬化与增厚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Hardening and thickening of the wall of the aorta (the body’s main artery), usually due to aging or atherosclerosis.","zh":"主动脉硬化：主动脉（人体最大的动脉）血管壁变硬、变厚，常与衰老或动脉粥样硬化有关。"},"examples":[{"en":"The doctor said the scan showed mild aortosclerosis, so we should manage blood pressure and cholesterol.","zh":"医生说影像检查显示轻度主动脉硬化，所以要控制血压和胆固醇。"},{"en":"Aortosclerosis can reduce the aorta’s elasticity and increase strain on the heart.","zh":"主动脉硬化会降低主动脉的弹性，增加心脏负担。"}]}],"synonyms":["aortic sclerosis","arteriosclerosis of the aorta"],"phonetic":"/eɪˌɔrtoʊskləˈroʊsɪs/","extraExplanation":["词源上：aorto- 表示“主动脉”，-sclerosis 表示“硬化”。它是医学用语，日常英语里不常见。","常见相关检查包括超声心动图、CT/MRI 或血管影像；治疗通常围绕危险因素管理（如高血压、高血脂、吸烟、糖尿病）以及医生评估是否需要进一步干预。","容易混淆：aortosclerosis 是“主动脉壁变硬/增厚”的总体描述；atherosclerosis（动脉粥样硬化）更强调脂质斑块沉积，可发生在多种动脉；两者常有重叠。"]}
{"word":"aortostenosis","summary":{"en":"Aortic stenosis is a condition where the aortic valve becomes narrowed, making it harder for blood to leave the heart.","zh":"主动脉瓣狭窄是指主动脉瓣变窄，导致血液更难从心脏流向全身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a narrowing of the aortic valve opening, which reduces blood flow from the heart to the body.","zh":"主动脉瓣狭窄：主动脉瓣口变窄，导致心脏向全身泵血的血流受阻。"},"examples":[{"en":"The cardiologist diagnosed her with aortic stenosis after hearing a heart murmur.","zh":"心脏科医生在听到心脏杂音后诊断她患有主动脉瓣狭窄。"},{"en":"Severe aortic stenosis can cause chest pain, shortness of breath, or fainting during activity.","zh":"重度主动脉瓣狭窄可能在活动时引起胸痛、气短或晕厥。"},{"en":"He may need valve replacement if the aortic stenosis gets worse.","zh":"如果主动脉瓣狭窄加重，他可能需要进行瓣膜置换。"}]}],"synonyms":["aortic valve stenosis","valvular aortic stenosis","AS (medical abbreviation)"],"phonetic":"/eɪˈɔrtɪk stəˈnoʊsɪs/","extraExplanation":["你输入的“aortostenosis”更常见的标准拼写是 **aortic stenosis**（两个词）。医学写作中有时也会见到把词连写或用连字符的形式，但在临床与学术资料里最常用的是分开写。","“stenosis”表示“狭窄”，在医学里也常用于其他部位，如 **spinal stenosis**（椎管狭窄）和 **carotid stenosis**（颈动脉狭窄）。","如果你在读检查报告：常见评估包括超声心动图（echocardiogram）测量瓣口面积与压差；治疗从观察随访到经导管主动脉瓣置换（TAVR）或外科瓣膜置换不等。"]}
{"word":"aortotomy","summary":{"en":"Aortotomy means a surgical cut into the aorta.","zh":"aortotomy 指“主动脉切开术”，即在主动脉上做外科切口。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical incision (cut) made into the aorta, usually to allow repair, removal of a blockage, or other heart–blood vessel procedures.","zh":"主动脉切开术：在主动脉上进行的外科切口，通常用于修复、清除阻塞或进行其他心血管相关手术。"},"examples":[{"en":"The surgeon performed an aortotomy to remove the clot and restore blood flow.","zh":"外科医生进行了主动脉切开术以取出血栓并恢复血流。"},{"en":"During the operation, an aortotomy provided access to the aortic valve.","zh":"手术中，通过主动脉切开术可以进入主动脉瓣区域。"}]}],"synonyms":["aortic incision"],"phonetic":"/ˌeɪɔrˈtɑtəmi/","extraExplanation":["词源上可拆解为 aorto-（主动脉）+ -tomy（切开、切开术）。医学英语里，-tomy 通常表示“切开以进入或处理”，不同于 -ectomy（切除）。","该词多见于外科手术记录、医学论文或病历说明中，日常英语里很少使用；普通交流更常说“an incision in the aorta（在主动脉上的切口）”。"]}
{"word":"AOS","summary":{"en":"AOS is an abbreviation most commonly meaning “area of study” or, in business, “average order size”; in tech it may informally refer to Android Open Source (more often written AOSP).","zh":"AOS是一个缩写，最常见指“研究/学习领域（area of study）”，在商业中也可指“平均订单金额（average order size）”；在科技语境里有时非正式地指安卓开源（更常写作AOSP）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) area of study; a subject or field you focus on (common in school, training, or research).","zh":"（缩写）研究/学习领域；指你专注的学科或方向（常见于教育、培训或研究语境）。"},"examples":[{"en":"My AOS is computer science, especially cybersecurity.","zh":"我的AOS是计算机科学，尤其是网络安全。"},{"en":"Choose an AOS that matches your long-term career goals.","zh":"选择一个与你长期职业目标匹配的AOS方向。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., business/e-commerce) average order size; the average amount of money spent per purchase.","zh":"（缩写，商业/电商）平均订单金额；每笔订单平均花费的金额。"},"examples":[{"en":"We increased AOS by offering free shipping over $50.","zh":"我们通过“满50美元免运费”提高了AOS（平均订单金额）。"},{"en":"AOS went down this month because customers bought fewer items per order.","zh":"这个月AOS下降了，因为顾客每单购买的商品更少了。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., tech) Android Open Source (Project); Google’s open-source version of Android (often written as AOSP; some people informally say AOS).","zh":"（缩写，科技）Android 开源（项目）；指安卓的开源版本（更常写作 AOSP；口语里有人会简写成 AOS）。"},"examples":[{"en":"This phone is based on AOS, so it has fewer Google apps preinstalled.","zh":"这款手机基于AOS（安卓开源），所以预装的谷歌应用更少。"},{"en":"Developers can build custom ROMs using AOS/AOSP code.","zh":"开发者可以用AOS/AOSP代码制作定制ROM。"}]}],"synonyms":["area of study (when meaning 1)","field (meaning 1)","major (similar in education contexts)","average basket size (similar in e-commerce)"],"phonetic":"/ˌeɪ oʊ ˈɛs/","extraExplanation":["“AOS”是缩写，具体意思高度依赖语境：在学校/研究里常指 area of study；在电商数据里常指 average order size。科技语境中更标准的写法通常是“AOSP”（Android Open Source Project），如果你是在手机刷机、ROM、系统讨论里看到“AOS”，很可能是在指它。","如果你告诉我你在哪里看到“AOS”（课程表、论文、工作报表、手机论坛等），我可以帮你锁定最准确的含义并给更贴近场景的例句。"]}
{"word":"aosmic","summary":{"en":"“Aosmic” isn’t standard; it’s probably “cosmic,” meaning related to the universe or extremely vast (and informally, amazingly big).","zh":"“aosmic”不是标准词，可能是“cosmic”的拼写错误，意思是“宇宙的/极其巨大的”，口语里也可表示“非常震撼”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not a standard English word.) Likely a misspelling of “cosmic.”","zh":"（不是标准英语单词。）很可能是把“cosmic”拼错了。"},"examples":[{"en":"Did you mean “cosmic” (related to space or the universe)?","zh":"你是想说“cosmic”（与太空或宇宙有关的）吗？"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to the universe or outer space; extremely large in scale.","zh":"宇宙的；与外太空有关的；规模极其巨大的。"},"examples":[{"en":"Astronomers study cosmic rays from space.","zh":"天文学家研究来自太空的宇宙射线。"},{"en":"The movie shows cosmic battles between galaxies.","zh":"这部电影展示了星系之间的宇宙级大战。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) Amazing or impressive in a very big way.","zh":"（非正式）非常惊人、很厉害（带“夸张地大”的感觉）。"},"examples":[{"en":"That concert was cosmic!","zh":"那场演唱会太震撼了！"},{"en":"They made a cosmic mistake by ignoring the warning.","zh":"他们无视警告，犯了个大错。"}]}],"synonyms":["universal","astronomical","interstellar","galactic","immense"],"phonetic":"/ˈkɑzmɪk/","extraExplanation":["“cosmic”常见于科普与科幻语境：cosmic rays（宇宙射线）、cosmic dust（宇宙尘埃）、cosmic microwave background（宇宙微波背景）。","在口语里说“That’s cosmic!”带一点夸张和幽默感，表示“太牛了/太离谱了”，但不如“awesome”常用。"]}
{"word":"AOSS","summary":{"en":"“AOSS” is an initialism; its meaning depends on context.","zh":"“AOSS”是首字母缩略词，含义需要结合上下文确定。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An initialism (acronym) made from the letters A-O-S-S; it is not a standard dictionary word, and its exact meaning depends on the field or organization using it.","zh":"由字母 A-O-S-S 组成的首字母缩略词；它不是一个固定的词典词汇，具体含义取决于使用它的领域或机构。"},"examples":[{"en":"What does AOSS stand for in this document?","zh":"这份文件里 AOSS 是什么意思（全称是什么）？"},{"en":"AOSS can mean different things in different companies, so ask for the full name.","zh":"AOSS 在不同公司可能代表不同含义，所以最好询问全称。"}]}],"synonyms":["initialism","acronym (general term)"],"phonetic":"/ˌeɪoʊˌɛsˈɛs/","extraExplanation":["AOSS 这种写法通常需要“上下文”才能确定含义：它可能是某个部门名称、系统名称、课程项目、组织机构或内部缩写。","读法一般按字母逐个读（A-O-S-S），写作时常见于标题、表格、邮件主题或机构名。","如果你把它出现的句子/行业背景（例如学校、医疗、军事、软件、物流等）发我，我可以帮你更准确地还原它的全称与含义。"]}
{"word":"Aosta","summary":{"en":"Aosta is a city in northwestern Italy and is also used to refer to the Aosta Valley region in the Alps.","zh":"Aosta 指意大利西北部的奥斯塔市，也常用来指阿尔卑斯山区的奥斯塔山谷（自治大区）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in northwestern Italy, near the French and Swiss borders, known as the capital of the Aosta Valley region.","zh":"奥斯塔：意大利西北部的一座城市，靠近法国和瑞士边境，是奥斯塔山谷大区的首府。"},"examples":[{"en":"We stopped in Aosta on our way through the Alps.","zh":"我们穿越阿尔卑斯山时在奥斯塔停留了一下。"},{"en":"Aosta is famous for its Roman ruins and mountain views.","zh":"奥斯塔以罗马遗迹和山景闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"Short for the Aosta Valley (Valle d’Aosta), an autonomous region of Italy in the Alps.","zh":"（常指）奥斯塔山谷（Valle d’Aosta）：意大利阿尔卑斯山区的一个自治大区。"},"examples":[{"en":"The Aosta Valley is one of Italy’s smallest regions.","zh":"奥斯塔山谷是意大利最小的几个大区之一。"},{"en":"In Aosta, you’ll often see both Italian and French on signs.","zh":"在奥斯塔山谷，你常会看到标牌上同时使用意大利语和法语。"}]}],"synonyms":["Aosta Valley","Valle d’Aosta"],"phonetic":"/aʊˈɔstə/","extraExplanation":["“Aosta”源自拉丁名“Augusta Praetoria Salassorum”，是古罗马在此建立的城市名称演变而来，因此当地保存了明显的罗马时期遗迹（如凯旋门、城墙等）。","奥斯塔山谷因地理位置靠近法国与瑞士，历史与语言文化受多方影响；该地区在意大利享有自治地位，法语与意大利语都有官方地位。"]}
{"word":"Aotea","summary":{"en":"Aotea is a Māori proper name, most commonly the Māori name for Great Barrier Island in New Zealand, and it also appears in place names like Aotea Square.","zh":"Aotea是毛利语专有名词，最常指新西兰“大堡礁岛”（Great Barrier Island）的毛利语名称，也常见于地名如Aotea广场。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Māori, proper noun) The Māori name for Great Barrier Island, an island in the Hauraki Gulf northeast of Auckland, New Zealand.","zh":"（毛利语，专有名词）新西兰奥克兰东北豪拉基湾中的“大堡礁岛”（Great Barrier Island）的毛利语名称。"},"examples":[{"en":"We took a ferry from Auckland to Aotea for a hiking trip.","zh":"我们从奥克兰坐渡轮去Aotea徒步旅行。"},{"en":"Aotea is known for its beaches, walking tracks, and dark-sky stargazing.","zh":"Aotea以海滩、步道和适合观星的暗夜天空而闻名。"}]},{"partOfSpeech":"other","definition":{"en":"A name used in New Zealand place names and institutions, especially connected to Māori identity or heritage (e.g., Aotea Square in central Auckland).","zh":"（用于地名/机构名）在新西兰一些地名与机构名称中使用的名字，常与毛利文化认同或历史传承相关（如奥克兰市中心的Aotea Square）。"},"examples":[{"en":"The concert will be held at Aotea Square tonight.","zh":"今晚的音乐会将在Aotea广场举行。"},{"en":"She met her friends near Aotea Centre before the show.","zh":"演出前她在Aotea中心附近见朋友。"}]}],"synonyms":["Great Barrier Island (common English name)"],"phonetic":"/aʊˈteɪ.ə/","extraExplanation":["“Aotea”来自毛利语：ao（云、白昼、世界等语义）+ tea（白色、清亮）。常见解释是“白云/白色的云”。它也容易让学习者联想到“Aotearoa”（新西兰的毛利语名称，常译作“长白云之乡”）。","读音在英语环境里会有近似读法，但在毛利语中元音更清晰分开，接近“ah-oh-TEH-ah”。在正式场合使用毛利语地名通常被视为对当地文化的尊重。"]}
{"word":"aotea","summary":{"en":"Aotea is a Māori place name in New Zealand, most often referring to Great Barrier Island or appearing in local place names like Aotea Square.","zh":"Aotea是新西兰常见的毛利语地名，最常指大屏障岛，也常用于如Aotea广场等地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Māori place name used in New Zealand, most commonly referring to Great Barrier Island (near Auckland) and sometimes used in names of venues or areas (e.g., Aotea Square in Auckland).","zh":"毛利语地名，在新西兰使用；最常见指“大屏障岛”（靠近奥克兰），也常出现在地名/场馆名中（如奥克兰的Aotea Square）。"},"examples":[{"en":"We’re taking the ferry to Aotea (Great Barrier Island) for a few days of hiking.","zh":"我们要坐渡轮去Aotea（大屏障岛）待几天徒步。"},{"en":"Let’s meet at Aotea Square before the show.","zh":"演出前我们在Aotea广场见吧。"}]}],"phonetic":"/aʊˈteɪ.ə/","extraExplanation":["“Aotea”源自毛利语，常被解释为与“白色的云/雾”或“白色的黎明”之类的意象有关（不同部族与语境可能有不同解释）。在新西兰，许多公共空间与地名沿用毛利语名称，体现对毛利文化与语言的尊重与延续。","容易混淆的相关词：Aotearoa（新西兰的毛利语名称，常译作“长白云之乡”）与 Aotea（特定地点名）不是同一个词，但都常见于新西兰文化与地名中。"]}
{"word":"Aotearoa","summary":{"en":"Aotearoa is the Māori name for New Zealand and is widely used in New Zealand today.","zh":"Aotearoa 是新西兰的毛利语名称，如今在新西兰被广泛使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The Māori name for New Zealand, commonly used in New Zealand English and in official or semi-official contexts.","zh":"“新西兰”的毛利语名称，在新西兰英语及官方或半官方语境中常见。"},"examples":[{"en":"Many people in Aotearoa celebrate Matariki (the Māori New Year).","zh":"在奥特亚罗瓦（新西兰），很多人会庆祝“玛塔里基”（毛利新年）。"},{"en":"The museum exhibit explores the history of Aotearoa/New Zealand.","zh":"这个博物馆展览探讨奥特亚罗瓦/新西兰的历史。"},{"en":"You’ll often see the name Aotearoa alongside English place names.","zh":"你经常会看到“Aotearoa”和英文地名并列出现。"}]}],"synonyms":["New Zealand","NZ (informal abbreviation)"],"phonetic":"ˌaʊt.i.əˈroʊ.ə","extraExplanation":["“Aotearoa”在毛利语里常被解释为“长白云之乡”（Land of the Long White Cloud），与早期航海者远望新西兰时看到的云带有关。这种解释很流行，但不同部族与学者对词源与原始含义也有讨论。","在当代新西兰，“Aotearoa”常用于表达对毛利文化与《怀唐伊条约》（Treaty of Waitangi）语境的尊重；有时会写作“Aotearoa New Zealand”以同时呈现毛利语与英语名称。","发音上，英语使用者常读作“ah-oh-teh-ah-ROH-ah”，而更接近毛利语的读法会把每个元音更清晰地读出来。"]}
{"word":"aotearoa","summary":{"en":"“Aotearoa” is the Māori name for New Zealand.","zh":"“Aotearoa”是新西兰的毛利语名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Māori name for New Zealand; used in both Māori and English, especially in cultural, historical, and political contexts","zh":"新西兰的毛利语名称；在毛利语与英语中都常用，尤其常见于文化、历史与政治语境"},"examples":[{"en":"Many people in Aotearoa celebrate Matariki as the Māori New Year.","zh":"在奥特亚罗瓦（新西兰），许多人庆祝“马塔里基”（毛利新年）。"},{"en":"The museum explores the histories of Aotearoa New Zealand.","zh":"这座博物馆展示奥特亚罗瓦新西兰的历史。"},{"en":"She grew up in Aotearoa but now lives overseas.","zh":"她在奥特亚罗瓦长大，但现在住在海外。"}]}],"synonyms":["New Zealand","NZ (informal)"],"phonetic":"ˌaʊtɛəˈroʊə","extraExplanation":["“Aotearoa”常被解释为“长白云之乡”（Land of the Long White Cloud）。它源自毛利语传统叙事，现代英语中也越来越常见，尤其出现在“New Zealand / Aotearoa”或“Aotearoa New Zealand”等并列写法中，以体现对毛利文化与双文化（bicultural）背景的尊重。","在新西兰的公共场合（政府文件、学校、媒体、活动名称）中，你可能会看到“Aotearoa”单独使用或与“New Zealand”并用；选择哪种写法有时也反映身份认同与语境的正式程度。"]}
{"word":"Aotes","summary":{"en":"“Aotes” is not a common standard English word; it’s probably a misspelling or a proper name/acronym.","zh":"“Aotes”不是常见的标准英文词，更可能是拼写错误或专有名词/缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in most dictionaries; it is likely a misspelling (for example, “notes” or “aortas”) or a proper name/acronym in a specific context.","zh":"一般不被当作标准英文单词收录；更可能是拼写错误（如“notes”“aortas”），或在特定语境中的专有名词/缩写。"},"examples":[{"en":"I couldn’t find “Aotes” in a dictionary—did you mean “notes” (笔记) or “aortas” (主动脉，复数)?","zh":"我在词典里查不到“Aotes”——你想写的是“notes”（笔记）还是“aortas”（主动脉，复数）吗？"},{"en":"If “Aotes” is a name or acronym, please share the sentence where you saw it.","zh":"如果“Aotes”是名字或缩写，请把你看到它的句子发我。"}]}],"phonetic":"/eɪˈoʊts/","extraExplanation":["“Aotes”本身不常见，所以最有效的做法是提供上下文（整句、主题领域：医学/游戏/公司名/社交媒体等）。我就能判断它是拼写错误、专有名词，还是某个缩写（acronym），并给出准确释义。"]}
{"word":"aotes","summary":{"en":"“aotes” isn’t a common English word; it’s probably a typo or an acronym.","zh":"“aotes”不是常见英语词；更可能是拼写错误或缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a typo (often for “notes”) or an uncommon acronym/brand name that needs context.","zh":"不是标准英语单词。更可能是拼写错误（常见为“notes”），或某个不常见的缩写/品牌名，需要上下文才能确定。"},"examples":[{"en":"I can’t find “aotes” in a dictionary—did you mean “notes”?","zh":"我在词典里找不到“aotes”——你是不是想写“notes（笔记）”？"},{"en":"If “AOTES” is an acronym, please tell me what field it’s from (school, tech, medicine, etc.).","zh":"如果“AOTES”是缩写，请告诉我它属于哪个领域（学校、科技、医学等）。"}]}],"phonetic":"/ˌeɪ.oʊˈtiːz/","extraExplanation":["很多拼写检查会把相邻键位或漏字母造成的词当作“新词”。你可以把原句发我，我能根据上下文判断你想表达的是“notes”“votes”“quotes”等哪一个。"]}
{"word":"Aotus","summary":{"en":"Aotus is the scientific genus name for night (owl) monkeys in Central and South America.","zh":"Aotus 是夜猴（猫头鹰猴）的科学属名，分布于中南美洲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small nocturnal New World monkeys, commonly called night monkeys or owl monkeys, found in Central and South America","zh":"（动物学）夜猴属：一种生活在中南美洲的小型新世界猴类，夜行性，常称“夜猴/猫头鹰猴”"},"examples":[{"en":"Researchers studied Aotus to understand how nocturnal primates see in low light.","zh":"研究人员研究夜猴属（Aotus），以了解夜行灵长类如何在弱光下视觉工作。"},{"en":"Several Aotus species live in the forests of the Amazon basin.","zh":"夜猴属的多个物种生活在亚马孙流域的森林中。"}]}],"synonyms":["night monkey","owl monkey"],"phonetic":"/eɪˈoʊtəs/","extraExplanation":["“Aotus”来自希腊语词根：a-（无）+ ous/otos（耳朵），字面含义类似“无耳的”。这与其外形有关：夜猴的外耳廓不明显。","在英语科普与动物学语境中，Aotus 常与通用名一起出现：night monkey（夜猴）或 owl monkey（猫头鹰猴）。","首字母大写的 Aotus 通常指“属名”（genus）。指某个具体物种时，会写成双名法，如 *Aotus nancymaae*。"]}
{"word":"aotus","summary":{"en":"Aotus is the scientific genus name for night (owl) monkeys—nocturnal monkeys from Central and South America.","zh":"Aotus 是“夜猴属”的学名，指中南美洲的夜行性猴类（也称猫头鹰猴）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) A genus of nocturnal New World monkeys, commonly called night monkeys or owl monkeys.","zh":"（生物）夜猴属（Aotus）：一类夜行性的美洲新世界猴，常称“夜猴”或“猫头鹰猴”。"},"examples":[{"en":"Researchers observed Aotus monkeys to understand how primates adapt to life at night.","zh":"研究人员观察夜猴属（Aotus）的猴子，以了解灵长类如何适应夜间生活。"},{"en":"The genus Aotus is known for its large eyes and nighttime activity.","zh":"夜猴属（Aotus）以大眼睛和夜间活动而闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A scientific name used in taxonomy to label species within the night monkey group.","zh":"（较少见）分类学中的学名，用来标记夜猴这一类群中的不同物种。"},"examples":[{"en":"Aotus nancymaae is one species often mentioned in biomedical studies.","zh":"南希夜猴（Aotus nancymaae）是生物医学研究中常被提到的一个物种。"}]}],"synonyms":["night monkey","owl monkey"],"phonetic":"/əˈoʊtəs/","extraExplanation":["“Aotus”来自科学分类命名体系（拉丁化名称），常见于动物学、生态学与医学研究文献中。","如果你指的是网络缩写或社群用语（例如某个游戏/动漫圈的“AOTUS”），请告诉我上下文或全称，我可以按那个含义再解释。"]}
{"word":"AOU","summary":{"en":"AOU is an abbreviation whose meaning depends on context; common uses include “All of Us” (NIH research program) and, less commonly, “Agreement of Understanding.”","zh":"AOU 是一个含义依赖上下文的缩写；常见用法包括 “All of Us”（NIH 科研项目），以及较少见的 “Agreement of Understanding（理解协议）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation (acronym/initialism) that can stand for different phrases or organization names depending on context; often read as the letters “A-O-U.”","zh":"缩写词（首字母缩略/首字母拼读词），具体含义取决于上下文；通常按字母读作 “A-O-U”。"},"examples":[{"en":"What does AOU stand for in this email?","zh":"这封邮件里的 AOU 是什么意思（代表什么）？"},{"en":"AOU can mean different things in different fields, so check the context.","zh":"AOU 在不同领域可能代表不同内容，所以要看上下文。"}]},{"partOfSpeech":"other","definition":{"en":"(U.S.) “All of Us,” a common abbreviation for the NIH “All of Us Research Program” (a health research project).","zh":"（美国）“All of Us（我们所有人）”，常指美国国立卫生研究院（NIH）的“全美健康研究计划”（All of Us Research Program）。"},"examples":[{"en":"She enrolled in AOU to contribute her health data to research.","zh":"她参加了 AOU，为科研提供健康数据。"},{"en":"The AOU program aims to improve personalized medicine.","zh":"AOU 项目旨在推动个性化医疗。"}]},{"partOfSpeech":"other","definition":{"en":"(business/writing) “Agreement of Understanding,” used in some workplaces to mean a written understanding between people or teams (less standardized than “MOU”).","zh":"（商务/写作）“Agreement of Understanding（理解协议）”，一些机构用来指团队/个人之间的书面共识（不如 MOU 常见和规范）。"},"examples":[{"en":"They drafted an AOU outlining roles and deadlines.","zh":"他们起草了一份 AOU，写明分工和截止日期。"},{"en":"Our manager asked for an AOU before we start the project.","zh":"经理要求项目开始前先出一份 AOU。"}]}],"synonyms":["initialism","abbreviation"],"phonetic":"/ˌeɪ.oʊˈjuː/","extraExplanation":["AOU 不是一个“固定意思”的英文单词，更像缩写。最可靠的方法是：看它出现的领域（医疗、学校、公司文件等），或直接问对方 “What does AOU stand for?”","读音上通常按字母拼读 /ˌeɪ.oʊˈjuː/；有时在特定机构内部也可能像一个词那样读，但那属于内部习惯。","在正式商务文件里，更常见的是 MOU（Memorandum of Understanding，谅解备忘录）；如果你看到 AOU，建议确认是否等同于 MOU 或是公司内部模板。"]}
{"word":"aouad","summary":{"en":"“Aouad” is most commonly a surname, often from an Arabic-language background.","zh":"“Aouad”最常见的用法是姓氏，常见于阿拉伯语背景的人名中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A surname (family name), most commonly of Arabic origin; used as a personal or family name in some communities.","zh":"一个姓氏（家族名），多见于阿拉伯语背景的人名/姓氏中；在一些社群里作为个人或家族姓氏使用。"},"examples":[{"en":"Ms. Aouad will lead today’s meeting.","zh":"Aouad 女士将主持今天的会议。"},{"en":"I met Dr. Aouad at the conference.","zh":"我在会议上见到了 Aouad 博士。"}]},{"partOfSpeech":"other","definition":{"en":"Less commonly, a transliteration/spelling variant of an Arabic name that may appear differently in English (because Arabic sounds can be written in multiple ways).","zh":"较少见时，它也可能是某个阿拉伯语姓名的音译/拼写变体；由于阿拉伯语发音在英文里可有多种拼写方式，因此会出现不同写法。"},"examples":[{"en":"Her last name is spelled Aouad on her passport, but some records show a different spelling.","zh":"她的护照上姓氏拼作 Aouad，但有些记录里显示为不同拼写。"}]}],"synonyms":["(no true synonyms; it is a name)"],"phonetic":"/aʊˈɑːd/","extraExplanation":["“Aouad”通常出现在法语/英语环境中的拉丁字母拼写（尤其在北非或黎凡特地区移民社群的姓名里）。不同地区和登记系统可能导致同一阿拉伯语姓氏出现多种拼写（例如元音组合 ao/ou 等），这属于常见的音译差异。"]}
{"word":"aouads","summary":{"en":"“aouads” is not a recognized English word; it likely needs context (typo/name/acronym).","zh":"“aouads”不是可识别的英语单词；很可能需要语境（拼写错误/人名/缩写）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a typo, a surname, a username, or an acronym, so its meaning depends on context.","zh":"不是标准英语单词。它可能是拼写错误、姓氏、用户名或缩写，含义取决于具体语境。"},"examples":[{"en":"I couldn’t find “aouads” in an English dictionary—can you share the sentence where you saw it?","zh":"我在英语词典里找不到“aouads”——你能把你看到它的句子发给我吗？"},{"en":"If “aouads” is a name, the pronunciation and meaning may vary by language or family background.","zh":"如果“aouads”是人名，不同语言或家族背景下发音和含义可能不同。"}]}],"phonetic":"/aʊˈædz/","extraExplanation":["“aouads”看起来不像常见英语词形：既不符合常见词根/词缀组合，也不像常见缩写格式。最常见的情况是：1）打字误输入；2）来自另一种语言的转写（例如法语/阿拉伯语转写）；3）专有名词（姓氏、品牌、网名）。如果你提供来源（句子、网页、图片或你想表达的意思），我可以帮你判断它可能是哪一个词、应如何拼写，以及正确读法。"]}
{"word":"aoudad","summary":{"en":"An aoudad is a North African wild sheep, also called the Barbary sheep.","zh":"aoudad 指一种产于北非的野生羊类动物，也叫 Barbary sheep（巴巴里羊/北非鬣羊）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wild sheep-like animal from North Africa (also called the Barbary sheep), often found in rocky mountain areas; it has a shaggy mane and curved horns.","zh":"一种产于北非的野生羊类动物（又称“巴巴里羊/北非鬣羊”），常栖息在岩石山地；有披肩状的长毛和弯曲的角。"},"examples":[{"en":"We spotted an aoudad on the rocky slope during the hike.","zh":"徒步时，我们在岩石山坡上看见了一只北非鬣羊。"},{"en":"Some zoos keep aoudads because they adapt well to dry, rugged habitats.","zh":"一些动物园饲养北非鬣羊，因为它们能很好地适应干燥崎岖的环境。"}]}],"synonyms":["Barbary sheep","Ammotragus lervia"],"phonetic":"ˈaʊdæd","extraExplanation":["“aoudad”一词多见于动物学、自然纪录片、狩猎与野外观察语境；日常英语里更常用“Barbary sheep”。","它原产于北非，但在一些地区（如美国西南部）也有引入后形成的野外种群，因此在当地新闻或生态话题中偶尔会看到这个词。"]}
{"word":"aoudads","summary":{"en":"“Aoudads” means more than one aoudad (Barbary sheep), a wild sheep native to North Africa.","zh":"“aoudads”指多个 aoudad（巴巴里羊/北非盘羊），一种原产北非的野生羊。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of aoudad: wild sheep (Barbary sheep) from North Africa, also introduced in some other regions.","zh":"aoudad 的复数：一种野生羊（又称巴巴里羊/北非盘羊），原产北非，也被引入到其他地区。"},"examples":[{"en":"A group of aoudads was seen climbing the rocky hillside.","zh":"人们看到一群 aoudads 在岩石山坡上攀爬。"},{"en":"In some areas, aoudads are considered an introduced species.","zh":"在一些地区，aoudads 被认为是外来引入物种。"}]}],"synonyms":["Barbary sheep","oudads"],"phonetic":"/ˈaʊˌdædz/","extraExplanation":["“aoudad”也常写作“oudad”。中文常译为“巴巴里羊”“北非盘羊”。","这种动物以适应干旱、岩石地形著称，常见于沙漠与山地环境。","词源上多认为来自北非当地语言（如柏柏尔语）对这种动物的称呼，后进入法语/英语拼写体系。"]}
{"word":"Aouellimiden","summary":{"en":"Aouellimiden refers to a major Tuareg tribal confederation (and its people) in the Mali–Niger Sahara–Sahel region, often written with variant spellings in English/French sources.","zh":"Aouellimiden 指马里—尼日尔一带撒哈拉—萨赫勒地区的重要图阿雷格部族联盟及其族人；在英/法文资料中常见多种拼写变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Tuareg (Berber) tribal confederation historically based in the Sahara–Sahel region, especially in parts of present-day Mali and Niger; also the people belonging to it.","zh":"阿韦利米登（Aouellimiden）：撒哈拉—萨赫勒地区（主要在今马里、尼日尔一带）的图阿雷格（柏柏尔）部族联盟；亦指该联盟的族群成员。"},"examples":[{"en":"The Aouellimiden were one of several major Tuareg confederations in the central Sahara.","zh":"阿韦利米登是中部撒哈拉地区几个重要的图阿雷格部族联盟之一。"},{"en":"In some histories of Mali, the Aouellimiden are mentioned in connection with trans-Saharan trade routes.","zh":"在一些马里历史叙述中，阿韦利米登常与跨撒哈拉贸易路线相关联。"}]}],"synonyms":["Iwellemmeden","Iwellemeden","Awelimmiden"],"phonetic":"/aʊˌwɛləˈmiːdɛn/","extraExplanation":["这是一个专名，英语/法语文献中常见不同拼写：Aouellimiden（偏法语转写）、Iwellemmeden / Iwellemeden、Awelimmiden 等，都是对同一名称的不同拉丁字母转写。","读音会因转写系统与地区口音而变化；学术写作中通常保留原文拼写，并在首次出现时给出括注或说明其变体拼写，便于检索。"]}
{"word":"aouellimiden","summary":{"en":"Aouellimiden is a variant spelling for the Iwellemmeden, a major Tuareg confederation in Mali and Niger.","zh":"Aouellimiden 是 Iwellemmeden（图阿雷格重要部族联盟）的一个拼写变体，主要与马里、尼日尔地区相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A proper name that refers to the Iwellemmeden (also spelled Iwillimidan), a major Tuareg confederation (a large tribal alliance) in the Sahara and Sahel regions of West Africa, especially in present-day Mali and Niger.","zh":"专有名词，指撒哈拉与萨赫勒地区（西非）的图阿雷格人（Tuareg）一个重要部族联盟/部落联邦：Iwellemmeden（亦写作 Iwillimidan），主要分布在今马里与尼日尔一带。"},"examples":[{"en":"The Iwellemmeden (Aouellimiden) were one of the best-known Tuareg confederations in the Sahel.","zh":"Iwellemmeden（Aouellimiden）是萨赫勒地区最著名的图阿雷格部族联盟之一。"},{"en":"Some historical sources use different spellings, such as Aouellimiden or Iwillimidan.","zh":"一些历史资料会使用不同拼写，例如 Aouellimiden 或 Iwillimidan。"}]}],"synonyms":["Iwellemmeden","Iwillimidan"],"phonetic":"/ˌaʊ.ɛl.ɪˈmiː.dɛn/","extraExplanation":["“Aouellimiden”常见于法语或法语化转写（French transliteration）的资料中；同一个族名在英语、法语、阿拉伯语与塔马舍克语（Tuareg languages）之间转写时，拼法会出现较大差异。","在历史与人类学语境里，它通常不是指“一个人”，而是指一个大型政治—社会联盟（confederation），用于谈论撒哈拉贸易、游牧社会结构、以及殖民时期与现代国家形成过程中的区域政治。"]}
{"word":"Aoul","summary":{"en":"“Aoul” is likely a misspelling; the closest common English item is “AOL” (America Online), a well-known internet brand/company name.","zh":"“Aoul”很可能是拼写错误；最接近的常见英语词/名是“AOL”（America Online），一个知名的互联网品牌/公司名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"AOL: an American internet and media company, originally called America Online (often written as the acronym “AOL”).","zh":"AOL：美国一家互联网与媒体公司，原名 America Online（常写作缩写“AOL”）。"},"examples":[{"en":"My parents used AOL email years ago.","zh":"我父母多年前用过 AOL 邮箱。"},{"en":"AOL was one of the best-known internet brands in the early days of the web.","zh":"在互联网早期，AOL 是最知名的网络品牌之一。"}]}],"synonyms":["America Online"],"phonetic":"/ˌeɪ oʊ ˈɛl/","extraExplanation":["“Aoul”不是常见的英语单词拼写。你可能想输入的是“AOL”（公司/品牌名）或“awl”（锥子/打孔工具）。如果你告诉我你看到它的句子或语境，我可以帮你确认到底是哪一个。","AOL 在 1990 年代和 2000 年代初期很有代表性：拨号上网（dial-up）、即时通讯 AOL Instant Messenger（AIM）、以及 AOL 邮箱等都曾非常流行。"]}
{"word":"aoul","summary":{"en":"“aoul” is not a standard English word; it’s probably a misspelling.","zh":"“aoul” 不是标准英文单词，可能是拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a typo or a mistaken spelling of another word (for example, “a lot,” “soul,” “owl,” or “awful,” depending on what you meant).","zh":"不是标准英文单词。很可能是拼写错误或把别的词写错了（例如根据你想表达的意思，可能是 “a lot”“soul”“owl”“awful”等）。"},"examples":[{"en":"I couldn’t find “aoul” in a standard English dictionary—did you mean “soul” or “owl”?","zh":"我在常见英文词典里找不到 “aoul”——你是不是想写 “soul” 或 “owl”？"},{"en":"If you tell me the sentence you saw it in, I can help you identify the correct word.","zh":"如果你把它出现的句子发给我，我可以帮你判断正确的词。"}]}],"phonetic":"/aʊl/","extraExplanation":["“aoul”在英语里并不常见、也不是规范拼写，所以最好的做法是：\n1）把你看到它的完整句子贴出来；或\n2）告诉我你想表达的意思（例如“很多”“灵魂”“猫头鹰”“糟糕的/可怕的”等），我就能帮你匹配最可能的正确单词并解释用法。"]}
{"word":"AOW","summary":{"en":"AOW is an abbreviation that most often means “Art of War,” but it can also mean “as of writing” or refer to titles like “Age of Wonders,” depending on context.","zh":"AOW 是缩写，最常见指《孙子兵法/Art of War》，也可能表示“as of writing（截至写作时）”或指如《Age of Wonders》等标题，需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation most commonly used to mean “Art of War” (especially referring to Sun Tzu’s classic military/philosophy text, or to a work/game with that title).","zh":"常见缩写，表示《孙子兵法》（或泛指名为《Art of War/战争的艺术》的书、游戏等）。"},"examples":[{"en":"I’m rereading AOW for leadership lessons.","zh":"我在重读 AOW（《孙子兵法》）来学习领导力。"},{"en":"The podcast did an episode on AOW and modern strategy.","zh":"那个播客做了一期关于 AOW（《孙子兵法》）和现代战略的节目。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation used in some online communities for “as of writing,” meaning “at the time this message was written.”","zh":"在部分网络社区中表示 “as of writing”（截至我写下这段话时/就写这条消息时）。"},"examples":[{"en":"AOW, the update hasn’t been released yet.","zh":"AOW（截至我写这条时），更新还没发布。"},{"en":"AOW, the tickets are still available.","zh":"AOW（截至发帖时），票还有。"}]},{"partOfSpeech":"other","definition":{"en":"a shortened form used in some contexts for titles like “Age of Wonders” (a game series) or other names/organizations; meaning depends on context.","zh":"在某些语境里也可能是 “Age of Wonders（奇迹时代）” 等标题或机构名称的缩写；具体含义取决于上下文。"},"examples":[{"en":"I started playing AOW again this weekend.","zh":"我这周末又开始玩 AOW 了。"},{"en":"In this forum, AOW usually means the game, not the book.","zh":"在这个论坛里，AOW 通常指游戏，不是那本书。"}]}],"synonyms":["Art of War","Sun Tzu","as of writing","AOW (Age of Wonders)"],"phonetic":"/ˌeɪ oʊ ˈdʌbəl.juː/","extraExplanation":["“AOW”不是一个全网统一的固定缩写，最安全的做法是看上下文：如果在历史/战略/管理类话题里，往往指《孙子兵法》；如果在论坛发帖更新语境里，可能指“as of writing”。不确定时可以直接问：“What does AOW mean here?”"]}
