{"word":"AQ","summary":{"en":"“AQ” is usually an abbreviation for “air quality,” and less commonly it can mean “as quoted” in online/text contexts.","zh":"“AQ”通常是“空气质量”的缩写；较少情况下在网络/短信里表示“原文照引”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) air quality; a measure of how clean or polluted the air is in a particular place.","zh":"（缩写）空气质量；衡量某地空气干净或污染程度的指标。"},"examples":[{"en":"The AQ is unhealthy today, so I’m wearing a mask outside.","zh":"今天空气质量不健康，所以我出门戴口罩。"},{"en":"Schools canceled outdoor sports because the AQ dropped quickly.","zh":"因为空气质量迅速变差，学校取消了户外运动。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., online/text) as quoted; used to show you are repeating someone’s exact words.","zh":"（缩写，网络/短信）原文照引；表示你在重复某人的原话。"},"examples":[{"en":"AQ: “I never said that.” (copied exactly from the message)","zh":"AQ：“我从没说过那样的话。”（从消息里原文复制）"},{"en":"Please reply under the quote and mark the copied lines as AQ.","zh":"请在引用下面回复，并把复制的内容标为 AQ。"}]}],"synonyms":["air quality","AQI (related)","quoted (for the second meaning)"],"phonetic":"/ˌeɪˈkju/","extraExplanation":["“AQ”最常见于环保与健康语境，常与“AQI（Air Quality Index，空气质量指数）”一起出现；日常新闻里更常见的是 AQI，而 AQ 单独用时通常需要上下文。","网络语境中的 “AQ = as quoted” 并不如 “FYI/IMO” 常见，多出现在特定论坛、邮件或工作沟通格式里；不确定时可以直接写 “quoted” 或用引号更清晰。"]}
{"word":"aq","summary":{"en":"AQ is an abbreviation most commonly meaning “air quality.” Less commonly, it can mean “Achievement Quotient.”","zh":"AQ最常见是“air quality（空气质量）”的缩写；较少见也可指“Achievement Quotient（成就商数）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “air quality,” often used in environmental reports (e.g., AQ monitoring, AQ levels).","zh":"“air quality（空气质量）”的缩写，常用于环境报告中（如：AQ监测、AQ水平）。"},"examples":[{"en":"The city issued an AQ alert because pollution levels were high.","zh":"由于污染水平较高，城市发布了空气质量（AQ）警报。"},{"en":"AQ monitoring helps people decide whether it’s safe to exercise outdoors.","zh":"空气质量（AQ）监测能帮助人们判断是否适合在户外运动。"}]},{"partOfSpeech":"other","definition":{"en":"(less common) an abbreviation for “Achievement Quotient,” meaning a measure of how well someone turns potential into results.","zh":"（较少见）“Achievement Quotient（成就商数）”的缩写，指把潜力转化为成果的能力衡量。"},"examples":[{"en":"The article claims that AQ can matter more than IQ in the workplace.","zh":"这篇文章称，在职场中AQ可能比IQ更重要。"}]}],"synonyms":["air quality","AQI (air quality index)"],"phonetic":"/ˌeɪˈkjuː/","extraExplanation":["“AQ”通常读作字母：A-Q（/ˌeɪˈkjuː/）。在新闻、天气App、环保机构报告里更常见的是“air quality”的意思；如果看到与IQ、EQ并列讨论，则可能指“Achievement Quotient”。","在空气质量语境中，你也会常见到“AQI”（Air Quality Index，空气质量指数），比单独写“AQ”更具体。"]}
{"word":"Aqaba","summary":{"en":"Aqaba is a Jordanian port city on the Red Sea; it can also refer to the nearby Gulf of Aqaba.","zh":"Aqaba 指约旦红海沿岸的港口城市；也可指附近的亚喀巴湾。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A port city in southern Jordan on the Red Sea, known for beaches, diving, and as Jordan’s main seaport.","zh":"亚喀巴（Aqaba）：约旦南部红海沿岸的港口城市，以海滩、潜水和约旦主要海港而闻名。"},"examples":[{"en":"We flew to Aqaba and spent the weekend snorkeling in the Red Sea.","zh":"我们飞到亚喀巴，在红海浮潜度过了周末。"},{"en":"Aqaba is an important gateway for trade in Jordan.","zh":"亚喀巴是约旦贸易的重要门户。"}]},{"partOfSpeech":"n.","definition":{"en":"The Gulf of Aqaba, a narrow arm of the Red Sea between the Sinai Peninsula and western Arabia, bordering Jordan, Israel, Egypt, and Saudi Arabia.","zh":"亚喀巴湾：红海的狭长海湾，位于西奈半岛与阿拉伯半岛西部之间，毗邻约旦、以色列、埃及和沙特阿拉伯。"},"examples":[{"en":"The Gulf of Aqaba is famous for clear water and coral reefs.","zh":"亚喀巴湾以清澈海水和珊瑚礁闻名。"},{"en":"Several countries share coastlines along the Gulf of Aqaba.","zh":"多个国家共享亚喀巴湾的海岸线。"}]}],"synonyms":["Al-‘Aqabah (variant spelling)"],"phonetic":"/ˈɑːkəbə/","extraExplanation":["“Aqaba/亚喀巴”在旅行语境中常与佩特拉（Petra）一起出现：很多游客会先去佩特拉，再到亚喀巴看海、潜水放松。","发音提示：重音通常在第一个音节（AQ-uh-buh）。"]}
{"word":"AQL","summary":{"en":"AQL most commonly means Acceptable Quality Level in quality inspection; it can also mean ArangoDB Query Language in databases.","zh":"AQL 最常见指质量抽检中的“可接受质量水平”；在数据库领域也可指 ArangoDB 查询语言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Acceptable Quality Level: the maximum number (or percentage) of defective items considered acceptable in a batch of products during quality inspection.","zh":"可接受质量水平：在质量抽检中，一个批次产品中被认为“仍可接受”的最大不良品数量或比例。"},"examples":[{"en":"The buyer requires an AQL of 2.5 for major defects.","zh":"买方要求主要缺陷的 AQL 为 2.5。"},{"en":"If the sample fails the AQL test, the whole lot may be rejected.","zh":"如果样品未通过 AQL 抽检，整批货可能会被拒收。"}]},{"partOfSpeech":"n.","definition":{"en":"ArangoDB Query Language: the query language used to search and manage data in the ArangoDB database.","zh":"ArangoDB 查询语言：用于在 ArangoDB 数据库中查询与管理数据的查询语言。"},"examples":[{"en":"You can filter documents using an AQL query.","zh":"你可以用 AQL 查询来筛选文档数据。"},{"en":"Our backend team writes AQL to retrieve graph relationships.","zh":"我们的后端团队用 AQL 来获取图数据中的关系。"}]}],"synonyms":["Acceptable Quality Level","ArangoDB Query Language"],"phonetic":"/ˌeɪ kjuː ˈɛl/","extraExplanation":["AQL 通常以字母逐个念（A-Q-L）。在外贸、工厂验货、第三方检验报告里，AQL 最常见，常与“抽样方案/抽样检验（sampling inspection）”“缺陷等级（critical/major/minor defects）”一起出现。","在质量检验语境中，AQL 不是“保证不良率”，而是一个抽样验收标准：抽到的样本里不良数超过某个“允收数（acceptance number）”就判定该批不通过。"]}
{"word":"aqua","summary":{"en":"Aqua means “water” (often in names or scientific/poetic use) and also refers to a light blue-green color.","zh":"Aqua 表示“水”（常用于名称或较科学/文艺的表达），也可指“水蓝色/蓝绿色”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Water; the clear liquid that forms seas, rivers, rain, etc. (often used in names, branding, or a poetic/scientific style).","zh":"水；构成海洋、河流、雨水等的透明液体（常用于名称、品牌或较文艺/科学的表达）。"},"examples":[{"en":"The resort has an aqua pool and a spa.","zh":"这家度假村有一个水蓝色的泳池和水疗中心。"},{"en":"In chemistry class, we wrote “aqua” for water in Latin-based terms.","zh":"在化学课上，我们在拉丁语系术语里用“aqua”表示水。"}]},{"partOfSpeech":"adj.","definition":{"en":"A light blue-green color, like clear tropical water.","zh":"水蓝色/蓝绿色；像清澈热带海水那样的颜色。"},"examples":[{"en":"She chose an aqua dress for the summer party.","zh":"她为夏日派对选了一条水蓝色的裙子。"},{"en":"The bathroom tiles are aqua and white.","zh":"浴室瓷砖是水蓝色和白色的。"}]}],"synonyms":["water","light blue-green","turquoise (similar)"],"phonetic":"/ˈækwə/","extraExplanation":["“aqua”来自拉丁语，意思就是“水”。所以它常出现在与水有关的词里，比如：aquarium（水族箱/水族馆）、aquatic（水生的）、aqueduct（引水渠/高架水道）。","在艺术与设计语境里，aqua 通常指介于蓝与绿之间的清亮色调；与 turquoise（蓝绿色/绿松石色）接近，但 turquoise 往往更偏“宝石感”。"]}
{"word":"Aqua-Lung","summary":{"en":"An Aqua-Lung is scuba (self-contained underwater breathing) equipment, originally a brand name.","zh":"Aqua-Lung 指水肺（自给式水下呼吸装置），最初是一个品牌/商标名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device for underwater breathing; especially an early self-contained scuba system (often referring to the original Cousteau–Gagnan design or the trademarked brand name).","zh":"水肺（潜水用的自给式水下呼吸装置；尤指早期的 Cousteau–Gagnan 设计或其注册商标名）。"},"examples":[{"en":"She learned to dive using an Aqua-Lung and a mask.","zh":"她用水肺和面镜学习潜水。"},{"en":"The museum displays an early Aqua-Lung used by marine explorers.","zh":"博物馆展出了海洋探险者使用过的早期水肺装置。"}]}],"synonyms":["scuba","SCUBA (self-contained underwater breathing apparatus)","scuba gear","dive regulator"],"phonetic":"/ˈɑkwə lʌŋ/","extraExplanation":["“Aqua-Lung”最初是商标名（由雅克·伊夫·库斯托 Cousteau 与工程师 Émile Gagnan 的发明推广），后来在日常英语里常被当作普通名词使用，泛指“水肺/潜水呼吸器”。写作上常见连字符 Aqua-Lung，也可写作 Aqualung。","常见搭配：Aqua-Lung regulator（调节器/呼吸调节器）、Aqua-Lung gear（潜水装备）。另外，Jethro Tull 的专辑《Aqualung》(1971) 让这个词在流行文化中更广为人知。"]}
{"word":"aquabelle","summary":{"en":"Aquabelle is usually a brand/product name; it can also be an invented name meaning “beautiful water.”","zh":"Aquabelle 通常是品牌/产品名；也可能是表示“美丽的水”的自造名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A brand or product name (a proper noun), often used for water-, bath-, or beauty-related products; not a standard dictionary word in everyday English.","zh":"一个品牌名/产品名（专有名词），常用于与水、沐浴或美容相关的产品；并非日常英语里的标准词汇。"},"examples":[{"en":"Aquabelle is the name on the bottle, so it’s probably the brand.","zh":"瓶子上写着 Aquabelle，所以它很可能是品牌名。"},{"en":"I saw Aquabelle in an online shop, but the site didn’t explain what the product was.","zh":"我在网店里看到 Aquabelle，但网站没有说明那是什么产品。"}]},{"partOfSpeech":"other","definition":{"en":"A coined name meaning “beautiful water,” formed from Latin-based aqua (“water”) + French/Italian belle (“beautiful”)—used mainly as a stylistic or marketing name.","zh":"一个人为创造的名称，字面可理解为“美丽的水”，由 aqua（源自拉丁语，意为“水”）+ belle（法语/意大利语，意为“美丽的”）组成；多用于文艺或营销命名。"},"examples":[{"en":"The spa called its new mineral spring Aquabelle to suggest purity and beauty.","zh":"那家水疗中心把新的矿泉水源命名为 Aquabelle，以传达纯净与美感。"},{"en":"In the poem, “Aquabelle” feels like an invented word that makes the water sound magical.","zh":"在那首诗里，“Aquabelle”像是作者自造的词，让水听起来更有魔力。"}]}],"synonyms":["(as a marketing-style name) Aqua Bella","(general idea) “beautiful water”"],"phonetic":"/ˌɑkwəˈbɛl/","extraExplanation":["Aquabelle 不是常见英语词汇，所以准确含义通常取决于你看到它的场景（例如：瓶身标签、化妆品系列名、香水名、酒店/水疗项目名等）。如果你能提供一句原文或一张图片，我可以根据上下文判断它更接近“品牌名”还是“修辞性的自造词”。"]}
{"word":"aquabib","summary":{"en":"Aquabib means a water-drinker or a non-drinker, often in a humorous or old-fashioned way.","zh":"Aquabib 指“只喝水的人/不喝酒的人”，常带幽默或较旧式用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who drinks only water (or does not drink alcohol); a teetotaler (often humorous or old-fashioned).","zh":"只喝水的人；不喝酒的人、戒酒者（常带幽默或较旧式的语气）。"},"examples":[{"en":"While everyone else ordered beer, he joked that he was an aquabib.","zh":"大家都点了啤酒，他开玩笑说自己是个只喝水的“aquabib”。"},{"en":"The menu even has mocktails for aquabibs and designated drivers.","zh":"菜单上甚至有无酒精鸡尾酒，给不喝酒的人和指定司机准备的。"}]}],"synonyms":["teetotaler","non-drinker","abstainer"],"phonetic":"ˈɑkwəˌbɪb","extraExplanation":["“aquabib”由拉丁语词根组合而来：aqua（水）+ bibere（喝）。在现代英语中非常少见，更多出现在幽默、讽刺或较文学化的语境里，用来强调“只喝水/不喝酒”的姿态。","更常用、更自然的说法是：teetotaler（完全戒酒者）、non-drinker（不喝酒的人）或 someone who only drinks water（只喝水的人）。"]}
{"word":"aquacade","summary":{"en":"Aquacade means a big staged water show, or a famous named aquatic revue (often capitalized).","zh":"Aquacade 指大型水上表演，也可特指著名的《Aquacade》水上综艺秀（常大写）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, staged water show or aquatic performance, often with synchronized swimming, diving, music, and theatrical effects","zh":"大型水上表演/水上秀（常含花样游泳、跳水、音乐与舞台效果）"},"examples":[{"en":"The resort’s aquacade features dancers, divers, and a light show over the pool.","zh":"这家度假村的水上秀有舞者、跳水表演者，以及泳池上方的灯光秀。"},{"en":"They built a temporary stadium to host an aquacade during the summer festival.","zh":"他们搭建了临时看台，在夏季庆典期间举办水上表演。"}]},{"partOfSpeech":"n.","definition":{"en":"(often capitalized) a specific famous aquatic revue, especially Billy Rose’s Aquacade, staged at major events like the 1939 New York World’s Fair","zh":"（常大写）特指著名水上综艺秀，尤指比利·罗斯（Billy Rose）的《Aquacade》（曾在1939年纽约世界博览会等大型活动上演出）"},"examples":[{"en":"At the World’s Fair, Billy Rose’s Aquacade drew huge crowds.","zh":"在世界博览会上，比利·罗斯的《Aquacade》吸引了大量观众。"},{"en":"Old posters advertised ‘Aquacade’ as the must-see spectacle of the season.","zh":"老海报把《Aquacade》宣传成当季必看的奇观演出。"}]}],"synonyms":["water show","aquatic show","aquatic revue","water spectacle"],"phonetic":"/ˈɑkwəˌkeɪd/","extraExplanation":["词源上常被理解为 aqua（“水”）+ -cade（来自 cavalcade，“盛大游行/大型表演”之意），因此带有“水上盛典/水上大秀”的感觉。","在英语语境里它既可作普通名词指“水上表演”，也常作为专名指上世纪中期的经典水上综艺秀；写作时是否大写取决于是否在指特定节目名称。"]}
{"word":"aquacades","summary":{"en":"Aquacades are theatrical water shows—often synchronized swimming and diving—sometimes used as a famous show title.","zh":"Aquacades 指大型水上表演（如花样游泳、跳水等），也常作为知名水上秀的名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a staged water show or swimming spectacle, often featuring synchronized swimming, diving, and music; also used as a title/name for such productions (especially mid-20th-century American shows).","zh":"水上歌舞/水上表演；常指配合音乐的花样游泳、跳水等大型水上秀；也可作为特定演出/节目名称（尤指20世纪中期美国的水上秀）。"},"examples":[{"en":"The resort advertised nightly Aquacades with dancers and synchronized swimmers.","zh":"那家度假村宣传每晚都有水上歌舞秀，有舞者和花样游泳队。"},{"en":"In the 1950s, Aquacades-style shows were a popular form of family entertainment.","zh":"在20世纪50年代，类似“Aquacades”的水上秀是一种很受家庭欢迎的娱乐形式。"}]}],"synonyms":["water show","aquatic spectacle","swimming show","synchronized swimming show"],"phonetic":"/ˈɑːkwəˌkeɪdz/","extraExplanation":["“Aquacades”常被当作专有名词使用，历史上最有名的是美国的巡回水上综艺《Aquacade(s)》，与奥运游泳冠军、演员 Esther Williams（埃丝特·威廉斯）等人有关，带动了大众对花样游泳与“水上歌舞秀”这种表演形式的想象与流行。","拼写上常见 Aquacade（单数，指一场/一种水上秀）与 Aquacades（复数或节目名）。在现代语境里也可能被借用为品牌名或活动名。"]}
{"word":"aquacultural","summary":{"en":"Aquacultural means “related to aquaculture,” the farming of aquatic organisms.","zh":"aquacultural 意为“与水产养殖相关的”，指对水生生物进行养殖的活动或事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to aquaculture—the farming of fish, shellfish, seaweed, or other aquatic organisms.","zh":"与水产养殖有关的；指养殖鱼类、贝类、海藻或其他水生生物的。"},"examples":[{"en":"Aquacultural projects can provide local jobs and a steady supply of seafood.","zh":"水产养殖项目可以提供本地就业机会，并稳定供应海产品。"},{"en":"The government introduced new rules for aquacultural waste and water quality.","zh":"政府出台了关于养殖废弃物和水质的新规定。"},{"en":"Aquacultural ponds need careful monitoring to prevent disease outbreaks.","zh":"养殖池塘需要仔细监测，以防止疾病暴发。"}]}],"synonyms":["aquaculture-related","fish-farming (related)","mariculture (when specifically marine)"],"phonetic":"/ˌɑkwəˈkʌltʃərəl/","extraExplanation":["“aquacultural”比更常见的“aquaculture”（名词）和“aquaculture-related”（形容词短语）更偏正式，常见于政策文件、科研论文、行业报告中。","词根拆分有助记忆：aqua-（水）+ culture（培育/养殖）。因此它强调“在水中进行的培育/养殖”，而不是单纯的捕鱼（fishing）。"]}
{"word":"aquaculture","summary":{"en":"Aquaculture is the farming of fish, shellfish, or seaweed in water.","zh":"Aquaculture 指在水中养殖鱼类、贝类或海藻等水生生物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the farming of fish, shellfish, seaweed, or other aquatic organisms in water environments (such as ponds, rivers, lakes, or the ocean)","zh":"水产养殖；在水域环境（如池塘、河流、湖泊或海洋）中养殖鱼类、贝类、海藻等水生生物的产业"},"examples":[{"en":"Aquaculture provides a large share of the world’s farmed salmon and shrimp.","zh":"水产养殖提供了全球很大一部分的养殖三文鱼和虾。"},{"en":"The coastal town relies on aquaculture to create jobs and support local families.","zh":"这个沿海小镇依靠水产养殖创造就业并养活当地家庭。"},{"en":"Some aquaculture systems recycle water to reduce pollution.","zh":"一些水产养殖系统会循环用水以减少污染。"}]}],"synonyms":["fish farming","fish culture","mariculture"],"phonetic":"/ˈɑːkwəˌkʌltʃɚ/","extraExplanation":["“Aquaculture”常被称为“鱼类养殖/渔业养殖”，但它不只养鱼，也包括牡蛎、扇贝等贝类，以及海带等海藻。","和“fishing（捕捞）”不同，aquaculture强调“养殖/培育”；和“agriculture（农业）”相似，都是把生物当作可管理的生产对象。","常见搭配：aquaculture farm（养殖场）、aquaculture industry（养殖产业）、sustainable aquaculture（可持续养殖）、fish farming（鱼类养殖，较口语）。"]}
{"word":"aquadag","summary":{"en":"Aquadag is a water-based colloidal graphite coating used to make surfaces conductive or reduce static.","zh":"Aquadag 是一种水性胶体石墨涂层，用于让表面导电或减少静电。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand name for a water-based colloidal graphite coating, used to make a surface electrically conductive or lubricated (often in electronics, vacuum tubes, and laboratory work).","zh":"Aquadag（商标名）：一种以水为载体的胶体石墨涂层，用来让表面导电或起润滑作用（常用于电子、真空管与实验室工作）。"},"examples":[{"en":"The technician painted a thin layer of Aquadag inside the tube to provide a conductive coating.","zh":"技术员在管内刷了一层很薄的Aquadag，用来形成导电涂层。"},{"en":"In the lab, we used Aquadag to reduce static charge on the plastic surface.","zh":"在实验室里，我们用Aquadag来减少塑料表面的静电。"}]}],"synonyms":["colloidal graphite","graphite coating","conductive graphite paint"],"phonetic":"/ˈɑːkwəˌdæɡ/","extraExplanation":["Aquadag 常被当作“材料名”来用，但它原本是商标名（trade name）。泛指时，有时也会用更通用的说法：water-based colloidal graphite（以水为介质的胶体石墨）。","因为含有石墨（graphite），干燥后会留下黑色/深灰色的导电薄膜；写作中多见于工程、物理或电子相关语境。"]}
{"word":"aquaduct","summary":{"en":"An aqueduct is a built channel or bridge-like structure that carries water from one place to another.","zh":"aqueduct 指用于输送水的人工渠道或高架引水结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A structure (often a bridge-like channel) built to carry water from one place to another, especially to supply a city or farms.","zh":"导水渠；高架引水道（常呈桥状），用于把水从一处输送到另一处，尤其为城市或农田供水。"},"examples":[{"en":"The ancient Romans built aqueducts to bring fresh water into the city.","zh":"古罗马人修建引水道，把新鲜的水引入城市。"},{"en":"This aqueduct carries water across the valley to nearby farms.","zh":"这条高架引水道把水跨越山谷输送到附近的农场。"}]}],"synonyms":["waterway","canal","channel","conduit"],"phonetic":"/ˈæk.wə.dʌkt/","extraExplanation":["你输入的拼写是 aquaduct；标准拼写通常是 aqueduct。","词源来自拉丁语 aqua（“水”）+ ducere（“引导、带领”），字面意思是“引水”。","在英语里，aqueduct 常让人联想到罗马的拱券式高架水道（如 Pont du Gard），但它也可以指现代的输水渠或大型输水工程。"]}
{"word":"aquaducts","summary":{"en":"Aqueducts are structures or channels built to carry water over distance; it is the plural form of aqueduct.","zh":"Aqueducts 指“引水道/高架水渠/渡槽”等输水设施；是 aqueduct 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of aqueduct: a man‑made channel, bridge-like structure, or tunnel built to carry water from one place to another (often to a city or farmland).","zh":"aqueduct（引水道／高架水渠／渡槽）的复数：人为修建的水道、拱桥式水渠或隧道，用来把水从一处输送到另一处（常用于城市供水或灌溉）。"},"examples":[{"en":"The ancient aqueducts still bring water to parts of the city today.","zh":"这些古老的高架水渠直到今天仍为城市的部分地区输送水。"},{"en":"Engineers repaired the aqueducts after the earthquake to prevent water loss.","zh":"地震后工程师修复了引水道，以防止漏水。"}]}],"synonyms":["waterway","canal","conduit","water channel"],"phonetic":"/ˈæk.wəˌdʌkts/","extraExplanation":["“Aqueduct”常让人联想到古罗马：罗马人修建了大量拱券式渡槽，把远处的水源引到城市，用于饮用水、公共浴场等。很多遗迹至今仍可见。","词源上，aqueduct 来自拉丁语 aqua（水）+ ducere（引导/带领），意思就是“把水引过来”。","在现代，aqueduct 也可以指地面下的输水隧道或大型输水工程，不一定是你在照片里看到的那种“桥”。"]}
{"word":"aquae","summary":{"en":"Aquae is a Latin form meaning “waters” or “of water,” often seen in scientific, medical, or historical names.","zh":"Aquae 是拉丁語詞形，意為「眾水」或「水的」，常見於科學、醫學或歷史名稱中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin; used in English scientific, medical, and historical contexts) “waters”; also “of water.”","zh":"（拉丁語；常見於英語的科學、醫學與歷史語境）「水／眾水」；也可表示「水的／屬於水」。"},"examples":[{"en":"The label reads “Aquae destillatae,” meaning distilled water.","zh":"標籤上寫著「Aquae destillatae」，意思是「蒸餾水」。"},{"en":"In old texts, you may see “aquae” used in names of Roman baths, referring to springs or waters.","zh":"在一些古文獻中，你可能會在羅馬浴場的名稱裡看到「aquae」，用來指溫泉或水源。"}]}],"synonyms":["water","waters"],"phonetic":"/ˈæk.wiː/","extraExplanation":["「aquae」是拉丁語 aqua（意為「水」）的變化形式：它可以是複數主格/呼格（=「眾水、諸水」），也可以是單數所有格（=「水的、屬於水」）。因此在不同短語裡可能翻成「水」或「水的」。","在藥學/配方拉丁語裡，常見縮寫或詞形（如 aqua、aquae）用於成分標示；在地名或古羅馬浴場名稱中（如 Aquae Sulis），aquae 往往暗示「溫泉、浴場、泉水」。"]}
{"word":"aquaemanale","summary":{"en":"An aquamanile is a medieval hand-washing water vessel, often decorative and animal-shaped.","zh":"aquamanile 指中世纪用于洗手倒水的器皿，常具装饰性并做成动物等造型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medieval vessel (often shaped like an animal or a person) used for pouring water, especially for washing hands during meals or religious ceremonies.","zh":"（中世纪）洗手水壶／注水器（常做成动物或人物形状），用于倒水，尤指在用餐或宗教仪式中洗手。"},"examples":[{"en":"The museum displayed a bronze aquamanile shaped like a lion.","zh":"博物馆展出了一件狮子造型的青铜洗手水壶。"},{"en":"Before the feast, a servant poured water from an aquamanile so guests could wash their hands.","zh":"宴会前，仆人用洗手水壶倒水，让宾客洗手。"}]}],"synonyms":["ewer","hand-washing vessel","pitcher"],"phonetic":"/ˌɑːkwəˈmænɪli/","extraExplanation":["你输入的“aquaemanale”很可能是拼写误差；英语中更常见的词是 **aquamanile**。","词源来自拉丁语：**aqua**（水）+ **manus**（手），字面意思接近“用于洗手的水器”。","在欧洲中世纪，贵族宴会与教会礼仪中常用这种器物；许多精品以青铜铸造，并带有装饰性与象征意义。"]}
{"word":"aquaemanalia","summary":{"en":"Aquaman-related memorabilia or collectibles (a playful, nonstandard coinage).","zh":"与海王（Aquaman）相关的纪念品或收藏品（偏俏皮的非标准自造词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A nonstandard/rare coined word that likely means “Aquaman-related items or collectibles” (things connected to the DC superhero Aquaman).","zh":"一个非标准、较少见的自造词，通常可理解为“与 DC 超级英雄海王（Aquaman）有关的物品/收藏品”。"},"examples":[{"en":"His shelf is full of aquamanalia—old comics, posters, and action figures.","zh":"他的架子上摆满了“aquamanalia”——旧漫画、海报和手办。"},{"en":"The museum display mixed film costumes with fan-made aquamanalia.","zh":"博物馆展览把电影戏服和粉丝自制的“aquamanalia”放在一起展示。"}]}],"synonyms":["Aquaman memorabilia","Aquaman collectibles","Aquaman merch"],"phonetic":"/ˌɑkwəˌmænˈeɪliə/","extraExplanation":["这个词看起来是由 “Aquaman” + 后缀 “-alia” 拼成的自造词。英语里 “-alia” 常用来表示“与某主题相关的一堆物品/杂项/纪念品”，例如 “memorabilia（纪念品）”。所以 “aquamanalia” 读者通常会猜为“海王相关周边/收藏”。","它不是常见词，也不一定出现在正规词典中；更像粉丝圈、展览文案或幽默写法。正式写作里可改用 “Aquaman memorabilia/collectibles”。"]}
{"word":"aquafaba","summary":{"en":"Aquafaba is chickpea cooking liquid used as a vegan egg-white substitute.","zh":"Aquafaba 指鹰嘴豆豆汁，常用作纯素的蛋清替代品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The liquid from cooked chickpeas (or from a can of chickpeas), used in cooking and baking—especially as a plant-based substitute for egg whites.","zh":"煮熟鹰嘴豆后的汤汁（或罐装鹰嘴豆的豆汁），常用于烹饪与烘焙，尤其可作为蛋清的植物性替代品。"},"examples":[{"en":"She whipped aquafaba to make vegan meringues.","zh":"她把 aquafaba 打发，用来做纯素蛋白霜。"},{"en":"Don’t pour out the chickpea water—save the aquafaba for baking.","zh":"别把鹰嘴豆的豆汁倒掉——留着 aquafaba 来烘焙。"},{"en":"Aquafaba can help emulsify sauces, like a vegan mayonnaise.","zh":"Aquafaba 能帮助酱汁乳化，比如做纯素蛋黄酱。"}]}],"synonyms":["chickpea brine","chickpea liquid","bean-cooking liquid"],"phonetic":"/ˌɑːkwəˈfɑːbə/","extraExplanation":["这个词由拉丁语词根组合而来：aqua（“水”）+ faba（“豆”）。它在现代纯素烘焙圈中走红，因为其中的蛋白质和淀粉能“打发起泡”，做出接近蛋清泡沫的质地。使用时常见做法是将其冷藏后更容易打发；也可以加少量柠檬汁或塔塔粉帮助稳定泡沫。"]}
{"word":"aquafer","summary":{"en":"An aquifer is an underground layer that stores and carries groundwater.","zh":"aquifer 指储存并输送地下水的地下含水层。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A layer of rock, sand, or soil underground that holds and lets water flow through it (groundwater), often used as a water supply.","zh":"（地下）含水层：能储存并让水在其中流动的岩石、沙层或土层，常作为地下水水源。"},"examples":[{"en":"Many desert towns depend on an aquifer for drinking water.","zh":"许多沙漠城镇依靠含水层提供饮用水。"},{"en":"If an aquifer is polluted, it can take years to clean up.","zh":"如果含水层被污染，清理可能要花很多年。"},{"en":"Farmers pump groundwater from the aquifer during dry seasons.","zh":"干旱季节，农民从含水层抽取地下水。"}]}],"synonyms":["groundwater reservoir","water-bearing layer"],"phonetic":"/ˈækwəfɚ/","extraExplanation":["你输入的 **aquafer** 常见拼写是 **aquifer**。词源上可理解为：拉丁语 *aqua*（水）+ *-fer*（携带/承载），即“承载水的（地层）”。","在环保与水资源语境中，常见搭配有：**aquifer recharge**（含水层补给/回灌）、**confined aquifer**（承压含水层）、**unconfined aquifer**（潜水含水层）。"]}
{"word":"aquafortis","summary":{"en":"Aquafortis is an old term for nitric acid, often mentioned in historical metalworking and etching.","zh":"Aquafortis 是“硝酸”的旧称，常见于历史上的金属加工与蚀刻语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Nitric acid (HNO₃), especially the strong acid used historically in metalworking and etching.","zh":"硝酸（HNO₃）；尤指历史上用于金属加工与蚀刻的强酸。"},"examples":[{"en":"The engraver used aquafortis to etch lines into the metal plate.","zh":"版画师用“aquafortis（硝酸）”在金属版上蚀刻出线条。"},{"en":"Aquafortis can react strongly with metals, so it must be handled carefully.","zh":"“aquafortis（硝酸）”会与金属发生强烈反应，因此必须小心处理。"}]}],"synonyms":["nitric acid","HNO₃","spirit of nitre (historical)"],"phonetic":"/ˌækwəˈfɔrtɪs/","extraExplanation":["“aquafortis”来自拉丁语 aqua fortis，字面意思是“强水”。在早期化学与炼金术传统中，人们常用这种名字称呼强腐蚀性的酸液。","在艺术史里，它常与版画/蚀刻（etching）联系在一起：用酸在金属表面“咬”出凹槽，再上墨印刷。现代英语更常直接说 nitric acid（硝酸）。"]}
{"word":"aquafortist","summary":{"en":"An aquafortist is an etching artist who uses nitric acid (aqua fortis) to bite lines into a metal plate for printmaking.","zh":"aquafortist 指用硝酸（旧称强水 aqua fortis）进行蚀刻、制作版画的艺术家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a printmaker who creates etchings (engraved designs) using nitric acid, traditionally called aqua fortis.","zh":"使用硝酸（旧称“强水”aqua fortis）进行蚀刻创作的版画家。"},"examples":[{"en":"The museum displayed works by a 17th-century aquafortist known for delicate line etching.","zh":"博物馆展出了这位以精细线条蚀刻闻名的17世纪蚀刻版画家作品。"},{"en":"As an aquafortist, she draws on a metal plate, then uses acid to bite the lines into the surface.","zh":"作为一名蚀刻版画家，她先在金属版上作画，再用酸把线条“咬”进表面。"}]}],"synonyms":["etcher","printmaker","engraver (sometimes)"],"phonetic":"/ˌɑːkwəˈfɔːrtɪst/","extraExplanation":["“aquafortist”来自拉丁语/意大利语传统术语“aqua fortis”（字面义“强水”），历史上常用来指硝酸。蚀刻（etching）工艺里，酸会腐蚀（“咬刻”）金属版上暴露的部分，形成可上墨印刷的凹线。","现代英语里更常用的词是“etcher”（蚀刻版画家）或“printmaker”（版画家）；“aquafortist”较文学化、较少见，多见于艺术史或展览说明文本。"]}
{"word":"aquage","summary":{"en":"Aquage is most commonly a hair-care brand name; rarely, it can mean a water-related fee or toll in specialized/historical usage.","zh":"Aquage 最常见是护发品牌名；较少见的用法指与用水或水运相关的费用/通行费（多为专业或历史语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A brand name used for hair-care products (e.g., shampoos, conditioners, styling products).","zh":"（专有名词）Aquage：一个用于护发产品（如洗发水、护发素、造型产品等）的品牌名。"},"examples":[{"en":"She bought an Aquage conditioner for dry hair.","zh":"她买了一款 Aquage 的护发素，用来改善干燥发质。"},{"en":"Aquage styling spray is popular in some salons.","zh":"Aquage 的造型喷雾在一些美发沙龙里很受欢迎。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A fee or charge connected to water use or water transport (used mainly in specialized or historical contexts).","zh":"（罕见）与用水或水上运输相关的费用/税费（多见于专业或历史语境）。"},"examples":[{"en":"The document mentions an aquage charged for using the canal.","zh":"文件提到使用运河需要缴纳 aquage 费用。"},{"en":"In older records, aquage could refer to a water-related toll.","zh":"在较早的记录中，aquage 可指与水相关的通行费。"}]}],"synonyms":["(brand) hair-care brand","(rare sense) water toll","(rare sense) water fee"],"phonetic":"/ˈækwɪdʒ/","extraExplanation":["“aquage”在日常英语里极少作为普通词使用；大多数人遇到它通常是作为护发品牌名（商标）。","如果你是在合同、港口、运河、历史税费等文本里看到 aquage，它更可能是“水运/用水相关收费”的旧式或专业用法。"]}
{"word":"aquagreen","summary":{"en":"Aquagreen is a light blue-green color, often associated with seawater.","zh":"Aquagreen 指一种浅蓝绿色，常让人联想到海水的颜色。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"A color between aqua and green; a light blue-green (often like seawater).","zh":"介于水蓝色与绿色之间的颜色；浅蓝绿色（常见于海水般的颜色）。"},"examples":[{"en":"She painted the bathroom walls aquagreen to make it feel fresh and calm.","zh":"她把浴室墙壁刷成浅蓝绿色，让空间显得清新又平静。"},{"en":"The brand’s logo uses an aquagreen background.","zh":"这个品牌的标志使用浅蓝绿色作为背景。"}]},{"partOfSpeech":"n.","definition":{"en":"The aquagreen color.","zh":"浅蓝绿色（这种颜色本身）。"},"examples":[{"en":"Aquagreen is popular in summer fashion.","zh":"浅蓝绿色在夏季时尚中很受欢迎。"}]}],"synonyms":["aqua","turquoise","teal","seafoam (green)","blue-green"],"phonetic":"/ˌɑːkwəˈɡriːn/","extraExplanation":["“aquagreen”由“aqua（水蓝色/水）+ green（绿色）”组合而来，常用于时尚、室内设计、产品配色等领域。不同品牌或色卡体系里它的具体色值可能略有差异。"]}
{"word":"aquake","summary":{"en":"Aquake is a rare, nonstandard blend meaning an underwater earthquake (and sometimes, to quake underwater).","zh":"Aquake 是一个罕见的非标准混成词，通常指“海底地震”（有时也可作动词指在水下震动）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/created word) an underwater earthquake; a quake that happens beneath the sea or a large body of water.","zh":"（罕见/造词）海底地震；发生在海洋或大型水域下方的地震。"},"examples":[{"en":"The tsunami was triggered by an aquake off the coast.","zh":"这次海啸是由海岸外海底地震引发的。"},{"en":"Scientists placed sensors to detect an aquake along the trench.","zh":"科学家在海沟沿线放置传感器来探测海底地震。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare/created word) to shake or tremble like a quake, especially in water-related contexts.","zh":"（罕见/造词）（使）像地震般震动、颤动，尤用于与水相关的语境。"},"examples":[{"en":"The seafloor can aquake for minutes during a major event.","zh":"在重大事件中，海床可能会震动好几分钟。"}]}],"synonyms":["underwater earthquake","submarine earthquake","seafloor quake"],"phonetic":"/əˈkweɪk/","extraExplanation":["“aquake”并不是现代英语里的常用标准词，更常见、更规范的说法是“underwater earthquake”（海底地震）或“submarine earthquake”（海底地震）。","它看起来像是由“aqua-（水）”+“quake（地震）”拼合而成的混成词（blend），在科幻、新闻标题或非正式写作中可能为了简洁或修辞效果而出现。","如果你原本想查的是“awake”，拼写是 a-w-a-k-e（意为“醒着的/醒来”），发音与“aquake”会完全不同。"]}
{"word":"aqualung","summary":{"en":"An aqualung is scuba breathing equipment that supplies air to a diver underwater.","zh":"aqualung 指供潜水员在水下呼吸的水肺装备（气瓶与呼吸调节器等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A scuba diver’s breathing apparatus (a tank of compressed air plus a regulator), used for underwater diving.","zh":"水肺（潜水用的呼吸器材：压缩空气气瓶与调节器等的组合），用于水下潜水。"},"examples":[{"en":"She checked her aqualung before diving into the reef.","zh":"她在潜入珊瑚礁前检查了水肺装备。"},{"en":"The instructor explained how to breathe calmly through the aqualung.","zh":"教练讲解了如何通过水肺调节器保持平稳呼吸。"}]}],"synonyms":["scuba","scuba gear","breathing apparatus"],"phonetic":"/ˈɑːkwəˌlʌŋ/","extraExplanation":["“Aqualung”是一个较早的英文商品名/通用称呼，常指现代“scuba gear”（水肺装备）中的气瓶与呼吸调节器系统。","词源上可理解为“aqua（水）+ lung（肺）”，意思是“在水下像肺一样供气的装置”。","文化提示：英国摇滚乐队Jethro Tull在1971年发行了专辑《Aqualung》，因此这个词也常让人联想到该专辑/歌曲标题。"]}
{"word":"aqualunger","summary":{"en":"An aqualunger is a person who dives/swims underwater using scuba (an aqualung).","zh":"aqualunger 指使用水肺（scuba/aqualung）进行水下潜水的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who swims underwater using scuba equipment (an aqualung).","zh":"使用水肺（aqualung）等潜水装备进行水下游泳/潜水的人；水肺潜水者。"},"examples":[{"en":"The aqualunger checked his tank and regulator before diving.","zh":"这位水肺潜水者在下水前检查了气瓶和调节器。"},{"en":"A group of aqualungers explored the reef and recorded the fish they saw.","zh":"一群水肺潜水者探索了珊瑚礁，并记录他们看到的鱼类。"}]},{"partOfSpeech":"n.","definition":{"en":"(sometimes) a brand-related or informal reference connected to Aqualung/Aqua-Lung scuba gear.","zh":"（有时）与“Aqualung/Aqua-Lung（水肺/水肺品牌）”相关的非正式说法。"},"examples":[{"en":"He called himself an aqualunger because he used classic Aqua-Lung gear.","zh":"他因为使用经典的Aqua-Lung装备而自称“aqualunger”。"}]}],"synonyms":["scuba diver","diver","underwater diver"],"phonetic":"/ˈɑːkwəˌlʌŋər/","extraExplanation":["“aqualung”原指“水肺”（自带压缩空气的潜水呼吸装置），与雅克·库斯托（Jacques Cousteau）等人在20世纪推广的水肺潜水文化有关；“aqualunger”就是“使用水肺的人”。","拼写上更常见的是“aqualung”与“scuba diver（潜水员）”。“aqualunger”属于较少见的派生词，阅读时可按“scuba diver”来理解。"]}
{"word":"aquamanale","summary":{"en":"An aquamanale is a (often decorative) vessel for pouring water to wash hands, especially in medieval church or banquet settings.","zh":"Aquamanale 指用于倒水洗手的（常带装饰造型的）器皿，尤见于中世纪的教会礼仪或正式宴席场合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a vessel (often shaped like an animal or a person) used for pouring water for handwashing, especially in medieval Europe in churches or at formal meals.","zh":"（常做成动物或人物造型的）倒水洗手用的水壶/水器；尤指中世纪欧洲在教堂仪式或正式宴席上使用的洗手器。"},"examples":[{"en":"The museum displayed a bronze aquamanale shaped like a lion.","zh":"博物馆展出了一件狮子造型的青铜洗手水器（aquamanale）。"},{"en":"Before the banquet, a servant brought an aquamanale so guests could wash their hands.","zh":"宴会开始前，仆人端来洗手水器，让客人洗手。"}]}],"synonyms":["aquamanile","ewer (general)","handwashing vessel"],"phonetic":"/ˌɑkwəˈmænəl/","extraExplanation":["这个词更常见的拼写是 aquamanile；aquamanale 属于较少见的变体拼写。","词源来自拉丁语：aqua（“水”）+ manus（“手”），体现它的用途——“给手用的水”。","在中世纪的宗教礼仪中，神职人员在某些仪式前会进行象征性的洗手；在贵族宴席上也常见类似的“洗手礼”。","在艺术史/考古语境里，aquamanile 常指造型精美的金属器（如铜/青铜），动物造型很典型。"]}
{"word":"aquamanalia","summary":{"en":"Aquamanalia is a rare historical term for ritual washing vessels (plural), similar to aquamaniles.","zh":"Aquamanalia 是一个罕见的历史词，指（复数）用于仪式性洗手的盛水器/洗手水器，含义接近 aquamaniles。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, historical) Water vessels or washing implements, especially those used for ritual handwashing (for example, in medieval churches).","zh":"（罕见/历史用语）盛水或洗手用的器具，尤指用于仪式性洗手的水器（如中世纪教堂中使用的）。"},"examples":[{"en":"In the museum catalog, the bronze spouts were listed under aquamanalia used for ceremonial washing.","zh":"在博物馆目录里，这些青铜出水口被归为用于仪式性洗净的 aquamanalia。"},{"en":"The priest’s assistant brought the aquamanalia to the altar before the service began.","zh":"仪式开始前，司祭的助手把 aquamanalia 带到祭坛旁。"}]}],"synonyms":["aquamaniles","washing vessels","lavabo vessels"],"phonetic":"/ˌɑːkwəˈmeɪnəliə/","extraExplanation":["这个词非常少见，多出现在古物/博物馆目录或学术写作中。它常被当作拉丁化的复数形式来用，意义接近更常见的 aquamanile（中世纪常见的“倒水洗手壶/洗手器”，常做成动物造型）。","词形上可理解为与拉丁语 aqua（水）相关；在实际阅读中，如果你在讲“中世纪洗手水器”时看到 aquamanalia，通常可以把它当作“aquamaniles/洗手水器（复数）”来理解。"]}
{"word":"aquamanile","summary":{"en":"An aquamanile is a medieval decorative water-pouring vessel used for washing hands.","zh":"aquamanile 指中世纪用于洗手倒水的装饰性器具（常为动物造型）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A decorative vessel (often shaped like an animal or a rider) used for pouring water over the hands, especially in medieval Europe for handwashing at meals or in religious settings.","zh":"（常做成动物或骑士等造型的）倒水器/盛水器，用来给人洗手，尤见于中世纪欧洲的餐桌礼仪或宗教场合。"},"examples":[{"en":"The museum displayed a bronze aquamanile shaped like a lion.","zh":"博物馆展出了一件青铜狮形倒水器（aquamanile）。"},{"en":"Before the feast, a servant brought an aquamanile so guests could wash their hands.","zh":"宴会开始前，仆人端来一只倒水器，让宾客洗手。"},{"en":"In some churches, an aquamanile was used during ritual handwashing.","zh":"在一些教堂里，仪式性的洗手环节会使用倒水器（aquamanile）。"}]}],"synonyms":["ewer","handwashing vessel","water ewer"],"phonetic":"/ˌɑːkwəˈmænəl/","extraExplanation":["词源来自拉丁语：aqua（“水”）+ manus（“手”），字面意思就是“水+手”的器具，强调它与“洗手”有关。","aquamanile 常见于罗马式与哥特式时期的金属工艺品中，材质多为青铜；造型动物（狮子、马等）很常见，既实用也象征权力、守护或身份地位。","在英文博物馆说明牌或艺术史文章中你更容易遇到这个词；日常英语里通常会用更通俗的 ewer（有嘴的水壶）或 “handwashing vessel”。"]}
{"word":"aquamaniles","summary":{"en":"Aquamaniles are medieval handwashing vessels, often decorative and animal-shaped.","zh":"Aquamaniles 指中世纪用于净手的倒水器皿，常具装饰性并做成动物造型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A (usually metal) water vessel, often shaped like an animal or human figure, used in the Middle Ages for pouring water over the hands (especially before or during religious services and formal meals).","zh":"（通常为金属制、常做成动物或人物造型的）中世纪“洗手壶/净手器”，用于倒水给人洗手（常见于宗教仪式或正式宴席前后）。"},"examples":[{"en":"The museum displayed bronze aquamaniles shaped like lions and horses.","zh":"博物馆展出了做成狮子和马造型的青铜洗手壶（净手器）。"},{"en":"Before the meal, a servant brought an aquamanile so guests could wash their hands.","zh":"用餐前，仆人拿来净手器，让客人洗手。"}]}],"synonyms":["ewer","handwashing vessel","lavabo (in some church contexts)"],"phonetic":"/ˌɑkwəˈmænəlz/","extraExplanation":["“Aquamanile”来自拉丁语：aqua（水）+ manus（手），字面意思是“给手用的水”。","这类器物在欧洲中世纪较常见，既实用也具有装饰性；动物造型常带有象征意义（如狮子象征权力或守护）。","复数形式是 aquamaniles；单数是 aquamanile。"]}
{"word":"aquamanilia","summary":{"en":"Aquamanilia are medieval decorative handwashing vessels (plural of aquamanile).","zh":"Aquamanilia 指中世纪常见的装饰性净手器（aquamanile 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural) decorative handwashing vessels, often made of metal or ceramic and shaped like animals or people, used especially in medieval Europe for pouring water over the hands.","zh":"（复数）洗手壶／净手器（常为金属或陶制，常做成动物或人物造型），尤指中世纪欧洲用于倒水净手的器具。"},"examples":[{"en":"The museum displayed a collection of aquamanilia shaped like lions and horses.","zh":"博物馆展出了一批做成狮子和马造型的净手器（aquamanilia）。"},{"en":"Before the feast, servants brought aquamanilia so guests could wash their hands.","zh":"宴席开始前，仆人端来净手器（aquamanilia），让客人洗手。"}]}],"synonyms":["handwashing vessels","ewer(s) (context-dependent)","lavabo vessels (liturgical context)"],"phonetic":"/ˌɑkwəˈmeɪnɪliə/","extraExplanation":["“aquamanilia”是拉丁语复数形式；单数是“aquamanile”。英语中较常见的词形是单数 aquamanile，但在艺术史、博物馆说明文字里也会用复数 aquamanilia。","这类器物常见于中世纪的教堂礼仪（如弥撒前后）与贵族宴会场景，用于“倒水净手”，既实用也具有地位与审美象征；造型常见狮子、马、骑士等。"]}
{"word":"aquamarine","summary":{"en":"Aquamarine is a blue-green gemstone, and it can also describe a pale blue-green color.","zh":"Aquamarine 指海蓝宝石（蓝绿色宝石），也可形容海蓝色（浅蓝绿色）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bluish-green gemstone (a variety of beryl), used in jewelry","zh":"海蓝宝石；一种呈蓝绿色的宝石（绿柱石的一种），常用于珠宝"},"examples":[{"en":"She wore an aquamarine necklace to match her light blue dress.","zh":"她戴了一条海蓝宝石项链来搭配浅蓝色的裙子。"},{"en":"Aquamarine is often cut into clear, sparkling stones for rings.","zh":"海蓝宝石常被切割成透明闪亮的宝石，用来镶在戒指上。"}]},{"partOfSpeech":"adj.","definition":{"en":"having a pale blue-green color, like seawater","zh":"海蓝色的；浅蓝绿色的，像海水一样"},"examples":[{"en":"The room was painted aquamarine, making it feel calm and airy.","zh":"房间刷成了海蓝色，让人感觉宁静通透。"},{"en":"Her eyes looked aquamarine in the sunlight.","zh":"阳光下，她的眼睛看起来是海蓝色的。"}]}],"synonyms":["sea-blue","blue-green","beryl (gem type)"],"phonetic":"/ˌɑːkwə.məˈriːn/","extraExplanation":["“aquamarine”来自拉丁语 aqua（水）+ marina（海的），字面意思就是“海水”。因此它既指宝石，也常用来形容带一点绿色的浅蓝色。","在西方文化中，海蓝宝石常与“海洋、平静与清澈”联系在一起，也常被当作三月的诞生石（birthstone）。"]}
{"word":"aquamarines","summary":{"en":"Aquamarines are aquamarine gemstones (plural) or, more loosely, aquamarine blue-green shades.","zh":"Aquamarines 指海蓝宝石（复数），也可泛指海蓝色系的浅蓝绿色调。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Aquamarines (plural of aquamarine): light blue or blue-green gemstones (a type of beryl), often used in jewelry.","zh":"aquamarines（aquamarine 的复数）：海蓝宝石；一种浅蓝或蓝绿色的宝石（绿柱石的一种），常用于珠宝首饰。"},"examples":[{"en":"She wore a ring set with aquamarines that matched her dress.","zh":"她戴着一枚镶有海蓝宝石的戒指，和她的裙子很配。"},{"en":"The museum displayed aquamarines from Brazil and Madagascar.","zh":"博物馆展出了来自巴西和马达加斯加的海蓝宝石。"}]},{"partOfSpeech":"adj.","definition":{"en":"Aquamarine (color): a pale blue-green color like seawater; “aquamarines” can refer to shades of this color.","zh":"aquamarine（颜色）：像海水一样的浅蓝绿色；“aquamarines”也可指多种海蓝色系的色调。"},"examples":[{"en":"The designer used aquamarines and whites for a fresh, coastal feel.","zh":"设计师用海蓝色系和白色来营造清新海岸风格。"},{"en":"The water shifted through different aquamarines as the sun moved.","zh":"随着太阳移动，海水在不同的海蓝色调之间变化。"}]}],"synonyms":["beryl (type)","sea-green","blue-green","aqua"],"phonetic":"/ˌɑːkwə məˈriːn/","extraExplanation":["“aquamarine”来自拉丁语：aqua（水）+ marina（海的），字面意思是“海水”。因此它既可以指宝石，也常用来指一种“海水般的颜色”。","在英语里谈宝石时更常说单数“an aquamarine”或不可数用法“aquamarine jewelry”；复数“aquamarines”常见于收藏、展览、矿物学语境中。"]}
{"word":"aquameter","summary":{"en":"An aquameter is a device (water meter) that measures how much water flows through a system or how much water is used.","zh":"aquameter 指测量水流量或用水量的装置，也就是“水表”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device used to measure the amount of water flowing through a pipe; a water meter","zh":"用来测量管道中水流量或用水量的装置；水表"},"examples":[{"en":"The city worker checked the aquameter to record our monthly water use.","zh":"市政工作人员检查水表来记录我们每月的用水量。"},{"en":"If your bill suddenly rises, the aquameter can help detect a leak.","zh":"如果账单突然上涨，水表可以帮助发现漏水。"}]}],"synonyms":["water meter","flow meter","meter","water-use meter"],"phonetic":"/ˈɑːkwəˌmiːtər/","extraExplanation":["“aquameter”由拉丁词根 aqua（“水”）+ meter（“测量器”）构成。在日常英语里更常见的说法是 water meter；在工程或技术语境中也可能用 flow meter（更强调“流量计”）。"]}
{"word":"aquanaut","summary":{"en":"An aquanaut is an underwater explorer—often someone who lives and works in an underwater habitat for a long period.","zh":"aquanaut 指水下探索者，常指在水下栖息舱中长期生活并执行任务的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who works or explores underwater, especially someone who lives in an underwater habitat for an extended time.","zh":"水下宇航员；水下居住/探索者（尤指在水下栖息舱中长期生活或工作的人员）。"},"examples":[{"en":"The aquanaut spent two weeks living in an underwater lab to study marine life.","zh":"这位水下宇航员在水下实验室住了两周，以研究海洋生物。"},{"en":"Aquanauts test equipment that may later be used for space missions.","zh":"水下宇航员会测试一些设备，这些设备之后可能用于太空任务。"}]}],"synonyms":["underwater explorer","diver","saturation diver"],"phonetic":"/ˈɑːkwəˌnɔːt/","extraExplanation":["“aquanaut”由拉丁词根 aqua（“水”）+ -naut（“航行者/水手”，同源于 astronaut 的 -naut）组成，因此常被理解为“像宇航员一样在另一个环境中生活与探索的人”。","该词常与美国 NASA 的 NEEMO（在水下栖息舱进行训练的任务）等项目相关，用水下环境模拟太空任务中的隔离、失重感训练和团队协作。","近义表达包括 diver（潜水员，范围更广）与 underwater explorer（更口语）。与 scuba diver 相比，aquanaut 更强调“长期驻留/任务式探索”。"]}
{"word":"aquanauts","summary":{"en":"Aquanauts are people who explore or work underwater, especially in the ocean.","zh":"aquanauts 指在海洋等水下环境中进行探险或工作的人员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who explores or works underwater, especially in the ocean, often using special diving equipment or living in an underwater habitat.","zh":"水下探险者；海底工作者（尤指在海洋中使用特殊潜水设备，或在水下栖居设施中工作/生活的人）。"},"examples":[{"en":"The documentary follows aquanauts who spend days living in an underwater lab.","zh":"这部纪录片跟拍了一群“水下航天员”，他们在水下实验室里连续生活好几天。"},{"en":"Aquanauts collect samples from the seafloor to study marine life.","zh":"水下探险者从海底采集样本来研究海洋生物。"}]}],"synonyms":["underwater explorer","diver","ocean explorer","saturation diver"],"phonetic":"/ˈɑːkwəˌnɔːts/","extraExplanation":["“aquanaut”由拉丁词根 aqua（水）+ -naut（航行者/航海者）构成，类比 astronaut（宇航员）。因此它常被译作“水下航天员/水下宇航员”，带有“像太空任务一样在极端环境中执行任务”的感觉。","在真实语境中，它常用于海洋科研、深海工程或“水下栖居/饱和潜水”（saturation diving）相关项目，比如 NEEMO（NASA 的水下模拟任务）或早期的 Sealab 计划。"]}
{"word":"aquaphobia","summary":{"en":"Aquaphobia means an intense fear of water.","zh":"Aquaphobia 指对水的强烈恐惧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong fear of water (including swimming, deep water, or being in water)","zh":"恐水症；对水的强烈恐惧（包括游泳、深水或进入水中）"},"examples":[{"en":"She has aquaphobia, so she avoids swimming pools.","zh":"她有恐水症，所以会避开游泳池。"},{"en":"His aquaphobia started after a childhood accident near a river.","zh":"他对水的恐惧始于童年时一次靠近河边的意外。"}]}],"synonyms":["fear of water","hydrophobia (general meaning)"],"phonetic":"/ˌɑːkwəˈfoʊbiə/","extraExplanation":["“aqua-”来自拉丁语，意思是“水”；“-phobia”来自希腊语，表示“恐惧”。合在一起就是“对水的恐惧”。","日常英语里也常用更口语的说法：be afraid of water（怕水）或fear of water（对水的恐惧）。在心理学语境中，aquaphobia更正式。","不要和rabies（狂犬病）混淆：狂犬病曾被称为hydrophobia（恐水），因为患者可能会因吞咽困难而表现出“怕水”的症状，但这和一般意义的aquaphobia不同。"]}
{"word":"aquaplane","summary":{"en":"Aquaplane means a vehicle slides on a wet road because water prevents the tires from gripping (also called “hydroplane” in American English).","zh":"Aquaplane 指车辆在湿滑路面上因形成水膜而失去抓地力、发生打滑（美式英语常说 hydroplane）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to slide uncontrollably on a wet road because a layer of water builds up between a vehicle’s tires and the road surface (also called “hydroplane” in American English)","zh":"（车辆在湿滑路面上）因轮胎与路面之间形成水膜而失去抓地力、打滑（美式英语常说 hydroplane）"},"examples":[{"en":"The car aquaplaned and skidded into the next lane.","zh":"车发生了水滑，打滑冲进了隔壁车道。"},{"en":"If you drive too fast in heavy rain, you can aquaplane.","zh":"暴雨时车速太快，就可能发生水滑。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of sliding uncontrollably on a wet road in a vehicle; hydroplaning","zh":"（车辆）水滑现象；打滑（hydroplaning）"},"examples":[{"en":"Aquaplaning is more likely when your tires are worn.","zh":"轮胎磨损时更容易发生水滑。"},{"en":"The warning sign mentioned a risk of aquaplane on this stretch of road.","zh":"警示牌提示这段路有发生水滑的风险。"}]}],"synonyms":["hydroplane","skid","slide"],"phonetic":"/ˈɑːkwəˌpleɪn/","extraExplanation":["“Aquaplane”在英式英语里更常见；美式英语更常用“hydroplane”。两者意思基本相同，都是指轮胎在积水上“浮起来”导致失控。","驾驶语境里常见的搭配：aquaplane/hydroplane + on water；risk of aquaplaning；avoid aquaplaning（减速、保持胎纹和胎压、避免急刹/猛打方向）。"]}
{"word":"aquaplaned","summary":{"en":"Aquaplaned means a vehicle slid on water on the road and lost traction; less commonly, it means gliding over water.","zh":"Aquaplaned 指车辆在积水上打滑而失去抓地力；较少见时也指在水面上滑行。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(of a vehicle’s tires) to slide uncontrollably on a thin layer of water on the road, losing contact with the surface.","zh":"（指车辆轮胎）在湿路面的一层积水上打滑、失去抓地力而难以控制。"},"examples":[{"en":"The car aquaplaned on the highway and spun across two lanes.","zh":"汽车在高速公路上打滑失控，旋转着横跨了两条车道。"},{"en":"Slow down in heavy rain so you don’t aquaplane.","zh":"大雨时要减速，避免车辆打滑失控。"}]},{"partOfSpeech":"vi.","definition":{"en":"to glide smoothly over the surface of water (less common; often about boats, skis, or boards).","zh":"在水面上平稳滑行（较少见；常用于船、滑水板等）。"},"examples":[{"en":"The speedboat aquaplaned across the bay.","zh":"快艇在海湾水面上掠过。"}]}],"synonyms":["hydroplaned","skidded","slid","planed"],"phonetic":"/ˈɑkwəˌpleɪnd/","extraExplanation":["“aquaplaned”是动词 aquaplane 的过去式/过去分词。英式英语更常用 aquaplane；美式英语更常说 hydroplane（含义相同）。","在道路安全语境里，它通常指轮胎与路面之间形成“水膜”，导致方向和刹车反应变差；应对方式一般是减速、避免急刹和急打方向，并保持轮胎花纹与胎压良好。"]}
{"word":"aquaplaner","summary":{"en":"Aquaplaner means a vehicle (or driver) that slides on water on the road—i.e., hydroplaning.","zh":"Aquaplaner 指车辆（或司机）在积水上打滑、失去抓地力的情况，即“hydroplaning（水滑）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a vehicle (or its tires) that loses contact with the road and slides on a thin layer of water; something that is hydroplaning","zh":"（车辆或其轮胎）在积水上打滑、与路面失去抓地力的情况；发生“水滑/水上漂（hydroplaning）”的车辆"},"examples":[{"en":"In heavy rain, even a careful driver can become an aquaplaner if the tires are worn.","zh":"在大雨中，即使很小心的司机，如果轮胎磨损，也可能发生“水滑”而打滑。"},{"en":"The car turned into an aquaplaner for a moment and the steering felt useless.","zh":"那辆车有一瞬间在积水上打滑，方向盘几乎不听使唤。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who experiences aquaplaning (especially a driver whose vehicle is hydroplaning)","zh":"发生“水滑/水上漂”的人（尤指车辆在积水上打滑的司机）"},"examples":[{"en":"After the skid, the aquaplaner pulled over to calm down and check the tires.","zh":"打滑之后，那位司机把车靠边停下，先冷静一下并检查轮胎。"}]}],"synonyms":["hydroplaner"],"phonetic":"/ˈækwəˌpleɪnər/","extraExplanation":["“aquaplaner”在实际英语中不算常见，更常见的说法是动词/名词形式“aquaplane / aquaplaning”（英式）或“hydroplane / hydroplaning”（美式）。在美式驾驶语境里，人们更可能说：The car hydroplaned.","驾驶安全提示常见搭配：worn tires（磨损轮胎）、standing water（路面积水）、slow down（减速）、lose traction（失去抓地力）。"]}
{"word":"aquaplanes","summary":{"en":"Aquaplanes can mean water-gliding boards (plural noun) or vehicles sliding on wet roads due to water (verb, same as ‘hydroplane’).","zh":"Aquaplanes 可指（复数名词）水上滑行板，也可作动词指车辆在积水路面上“水滑”打滑失控（类似 hydroplane）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Flat boards that you stand or kneel on to glide over water, usually pulled by a boat (similar to water-skiing equipment).","zh":"（复数）水上滑行板；水上拖曳滑板（人站或跪在板上，由船拖行，在水面滑行，类似水上滑水的器材）。"},"examples":[{"en":"The resort rents aquaplanes for beginners.","zh":"那家度假村出租水上滑行板给初学者。"},{"en":"They tried aquaplanes before moving on to water skis.","zh":"他们先玩水上滑行板，后来才换成水上滑水。"}]},{"partOfSpeech":"v.","definition":{"en":"(of a vehicle) To slide uncontrollably across a wet road because a layer of water lifts the tires off the surface (to hydroplane).","zh":"（车辆）在湿滑路面上因积水形成水膜而打滑失控（即“水滑/漂滑”，也叫 hydroplane）。"},"examples":[{"en":"If you drive too fast in heavy rain, your car can aquaplane.","zh":"暴雨天如果车速太快，汽车可能会在积水上打滑失控。"},{"en":"The bus aquaplanes more easily when the tires are worn.","zh":"轮胎磨损时，公交车更容易在积水上“水滑”打滑。"},{"en":"Slow down—there’s standing water ahead, and you might aquaplane.","zh":"慢点——前面有积水，你可能会打滑失控。"}]}],"synonyms":["hydroplane","waterski (related)","skid"],"phonetic":"/ˈɑːkwəˌpleɪn/","extraExplanation":["在英式英语里更常用 aquaplane（名词/动词）；美式英语里谈车辆打滑更常说 hydroplane。道路安全语境中，它特指轮胎与路面之间被水隔开，导致转向和制动大幅变差的现象。"]}
{"word":"aquaplaning","summary":{"en":"Aquaplaning is when a vehicle slides on a wet road because water lifts the tires off the surface (also called hydroplaning).","zh":"Aquaplaning 指车辆在湿路面上因积水导致轮胎失去抓地力而打滑（也叫 hydroplaning）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(of a vehicle) sliding uncontrollably on a wet road because the tires lose contact with the ground due to a layer of water; hydroplaning.","zh":"（车辆）在湿滑路面上因轮胎与地面之间隔着一层水而失去抓地力、发生打滑失控；（同义）hydroplaning（滑水）。"},"examples":[{"en":"Drive slowly in heavy rain to reduce the risk of aquaplaning.","zh":"大雨时要慢速行驶，以降低车辆滑水（aquaplaning）的风险。"},{"en":"The car started aquaplaning on the highway, so she gently eased off the accelerator.","zh":"车在高速上开始滑水了，所以她轻轻松开油门。"}]}],"synonyms":["hydroplaning"],"phonetic":"/ˈɑːkwəˌpleɪnɪŋ/","extraExplanation":["aquaplaning 常见于英式英语；美式英语更常说 hydroplaning。两者意思基本相同。","常见诱因：车速过快、积水较深、轮胎胎纹磨损或胎压不当。遇到滑水时，一般建议稳住方向盘、缓慢松油门，避免猛打方向或急刹（具体以当地交通安全指南为准）。"]}
{"word":"aquapuncture","summary":{"en":"Aquapuncture is an alternative therapy that stimulates acupuncture points using water rather than needles.","zh":"Aquapuncture（“水针灸/水穴位刺激”）指用水来刺激穴位的一种替代疗法，而不是用针。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of alternative therapy that uses water (such as a pressurized jet or injection of sterile water) to stimulate acupuncture points, similar to acupuncture but using water instead of needles.","zh":"一种替代疗法，用水（如加压水流或无菌水注射）刺激穴位，类似针灸，但以“水”代替针。"},"examples":[{"en":"Some spas advertise aquapuncture as a gentle alternative to traditional acupuncture.","zh":"一些水疗中心把水针灸宣传为传统针灸的温和替代方式。"},{"en":"The therapist applied a focused water jet to pressure points—an approach sometimes called aquapuncture.","zh":"治疗师用集中的水柱作用于穴位——这种方法有时被称为水针灸。"}]}],"synonyms":["water acupuncture","hydroacupuncture","acupressure (related)"],"phonetic":"/ˌɑːkwəˈpʌŋktʃɚ/","extraExplanation":["“aquapuncture”不是非常常见或标准化的医学术语，在不同机构/国家可能指不同做法（例如：水柱按压穴位，或在穴位处进行少量无菌水注射等）。如果你在广告或诊所介绍里看到它，建议进一步询问具体操作方式、适应症与风险，并优先参考正规医疗建议。"]}
{"word":"aquaregia","summary":{"en":"Aqua regia is a powerful acid mixture that can dissolve gold and other noble metals.","zh":"王水是一种强酸混合液，能溶解黄金等贵金属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A highly corrosive mixture of concentrated nitric acid and hydrochloric acid, used in chemistry to dissolve noble metals such as gold and platinum.","zh":"王水；一种由浓硝酸与浓盐酸混合而成的强腐蚀性酸液，用于溶解金、铂等贵金属。"},"examples":[{"en":"Aqua regia can dissolve gold, which most acids cannot do.","zh":"王水能溶解金，而大多数酸做不到。"},{"en":"The lab used aqua regia to clean metal residues from glassware.","zh":"实验室用王水清除玻璃器皿上的金属残留。"},{"en":"Because aqua regia releases toxic fumes, it must be handled in a fume hood.","zh":"由于王水会释放有毒烟雾，必须在通风橱中操作。"}]}],"synonyms":["nitrohydrochloric acid","nitro-hydrochloric acid","royal water"],"phonetic":"/ˌɑːkwə ˈriːdʒiə/","extraExplanation":["“aqua regia”源自拉丁语，字面意思是“皇家之水/王者之水”，因为它能溶解“金属之王”——黄金。","它在炼金术与早期化学史中很常见；现代实验中主要用于溶解贵金属、制备含氯金酸等金盐溶液。","拼写提醒：常见写法是分开写作 aqua regia；“aquaregia”多被视为连写或误拼。"]}
{"word":"aquarelle","summary":{"en":"Aquarelle means a watercolor painting or the watercolor style/technique.","zh":"aquarelle 指水彩画，或水彩画的技法与风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a painting made with watercolor paints; the watercolor technique or style","zh":"水彩画；水彩画法／水彩风格"},"examples":[{"en":"She bought an aquarelle of a seaside town at a local market.","zh":"她在当地集市买了一幅海边小镇的水彩画。"},{"en":"The book includes aquarelles that show the plants in soft, transparent colors.","zh":"这本书收录了用柔和、透明色彩表现植物的水彩画作品。"}]}],"synonyms":["watercolor","watercolour painting"],"phonetic":"/ˌæk.wəˈrɛl/","extraExplanation":["“aquarelle”多用于艺术语境，尤其在英式或艺术写作中更常见；日常英语里更常说“watercolor (painting)”。","词源来自法语 aquarelle，与 aqua（拉丁语“水”）同源，因此带有“水＋颜料”的含义。"]}
{"word":"aquarelles","summary":{"en":"“Aquarelles” means watercolor paintings (plural), especially in a light, transparent style.","zh":"“aquarelles”指“水彩画作（复数）”，尤指清透、轻盈的水彩风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Watercolor paintings, especially ones in a delicate, transparent style (plural of aquarelle).","zh":"水彩画作（aquarelle 的复数），尤指色彩清透、层次轻盈的水彩画风格。"},"examples":[{"en":"The gallery displayed a series of aquarelles from the artist’s travel sketchbooks.","zh":"画廊展出了这位艺术家旅行速写本里的一系列水彩画。"},{"en":"Her aquarelles capture the morning light with soft, transparent washes.","zh":"她的水彩画用柔和、通透的晕染捕捉到了清晨的光线。"}]}],"synonyms":["watercolors","watercolor paintings"],"phonetic":"/ˌæk.wəˈrɛlz/","extraExplanation":["“aquarelle”源自法语，常用于艺术语境，强调透明水彩（watercolor washes）的轻薄与通透效果；在英文里既可指“水彩画作品”，也可指这种“水彩画法/风格”。","英语里更常见的日常说法是“watercolors”（水彩画/水彩作品）。在展览、画册、艺术评论等较正式的语境中，“aquarelle(s)”会显得更专业或更有文艺色彩。"]}
{"word":"aquarellist","summary":{"en":"An aquarellist is a watercolor painter (a watercolor artist).","zh":"aquarellist 指“水彩画家”（从事水彩绘画的人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who paints with watercolors; a watercolor painter","zh":"水彩画家；用水彩作画的人"},"examples":[{"en":"She trained as an aquarellist and now exhibits watercolor landscapes.","zh":"她受训成为一名水彩画家，现在展出水彩风景画。"},{"en":"The museum added several works by a nineteenth-century aquarellist.","zh":"博物馆新增了几幅一位19世纪水彩画家的作品。"},{"en":"As an aquarellist, he prefers light washes and soft edges.","zh":"作为水彩画家，他更偏好淡彩罩染和柔和的边缘。"}]}],"synonyms":["watercolorist","watercolor painter","watercolor artist"],"phonetic":"/ˈɑːkwəˌrɛlɪst/","extraExplanation":["“aquarellist”比较偏正式、带艺术圈/展览语境的用词，日常英语里更常说“watercolor artist / watercolor painter”。","词源上与法语/德语中的“aquarelle”（水彩画、水彩技法）相关；在艺术史或画展说明中更常见。"]}
{"word":"aquaria","summary":{"en":"“Aquaria” means more than one aquarium (tanks or aquarium buildings).","zh":"“aquaria”是“aquarium”的复数，指多个水族箱或多个水族馆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural form of “aquarium” (tanks or buildings where fish and other water animals/plants are kept and shown).","zh":"“aquarium（水族箱/水族馆）”的复数形式；指多个水族箱或多个水族馆。"},"examples":[{"en":"Many schools keep small aquaria in science classrooms.","zh":"很多学校在科学教室里放着小型水族箱。"},{"en":"The city’s aquaria attract tourists and teach visitors about ocean life.","zh":"这座城市的水族馆吸引游客，也让参观者了解海洋生物。"}]}],"synonyms":["aquariums","fish tanks (for the tank meaning)","public aquariums (for the building meaning)"],"phonetic":"/əˈkwɛriə/","extraExplanation":["“Aquaria”源自拉丁语的复数形式：aquarium → aquaria。现代英语中也常用规则复数“aquariums”，在口语和日常写作里更常见；“aquaria”更显正式或偏学术。","在一些语境里，“aquarium”也可指“水族馆（建筑/机构）”，因此“aquaria”既可能指多个水族箱，也可能指多个水族馆，需要看上下文。"]}
{"word":"aquarial","summary":{"en":"Aquarial means “related to an aquarium or to the keeping and display of aquatic life.”","zh":"Aquarial意为“与水族馆/水族箱有关的；与饲养和展示水生生物有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an aquarium (a tank or place where aquatic animals and plants are kept and displayed).","zh":"与水族馆或水族箱有关的；水族的（指饲养、展示水生动植物的地方或容器）。"},"examples":[{"en":"The museum built a new aquarial exhibit featuring coral reef fish.","zh":"博物馆新建了一个水族展示区，展出珊瑚礁鱼类。"},{"en":"Aquarial lighting needs to be adjusted so the plants can grow well.","zh":"水族用灯光需要调整，植物才能长得好。"}]},{"partOfSpeech":"adj.","definition":{"en":"Of or involving aquariums as a field, hobby, or industry.","zh":"与水族饲养/水族行业有关的；水族爱好或领域的。"},"examples":[{"en":"She joined an aquarial club to learn how to care for freshwater shrimp.","zh":"她加入了一个水族社团，学习如何饲养淡水虾。"},{"en":"Aquarial shops often test your water to help you choose the right fish.","zh":"水族店常常帮你检测水质，以便你选择合适的鱼。"}]}],"synonyms":["aquarium-related","aquatic (often close in meaning)","of the aquarium"],"phonetic":"/əˈkwɛriəl/","extraExplanation":["“aquarial”在现代英语里相对少见，更常见的说法是“aquarium (n.)”或“aquatic (adj.)”，以及“aquarium-related / aquarium hobby”。","注意不要和“Aquarian”混淆：Aquarian通常指“水瓶座的”或“水瓶座的人”，与水族箱/水族馆并非同一个词源用法。"]}
{"word":"Aquarian","summary":{"en":"Aquarian means connected to the zodiac sign Aquarius, or a person born under Aquarius.","zh":"Aquarian 指“与水瓶座有关的”，也可指“水瓶座的人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Aquarius (the zodiac sign), or to someone born under this sign (roughly January 20–February 18).","zh":"与水瓶座（黄道十二宫之一）有关的；或指水瓶座的人（通常指1月20日至2月18日出生的人）。"},"examples":[{"en":"She’s Aquarian, so she loves new ideas and independence.","zh":"她是水瓶座，所以很喜欢新点子，也很独立。"},{"en":"Aquarian traits are often described as original and forward-thinking.","zh":"水瓶座的特质常被形容为有创意、很有前瞻性。"}]},{"partOfSpeech":"n.","definition":{"en":"A person whose zodiac sign is Aquarius.","zh":"水瓶座的人。"},"examples":[{"en":"As an Aquarian, he tends to value freedom and friendship.","zh":"作为水瓶座的人，他往往重视自由和友谊。"},{"en":"Two Aquarians in a team can be very inventive.","zh":"团队里有两个水瓶座的人可能会非常有创造力。"}]}],"synonyms":["Aquarius (related)","Aquarius-born (informal)"],"phonetic":"/əˈkwɛriən/","extraExplanation":["“Aquarian”常见于占星语境（astrology），并不等同于天文学（astronomy）。日常聊天里，人们用它来轻松描述性格倾向，但不代表科学结论。","词形上，Aquarius（名词，水瓶座）→ Aquarian（形容词/名词）。类似构词还有：Sagittarius → Sagittarian，Capricorn → Capricornian。","文化小提示：英语里谈星座时，常说“an Aquarian”（以元音音素开头），而不是“a Aquarian”。"]}
{"word":"aquarian","summary":{"en":"Aquarian means “related to Aquarius,” or a person born under the sign Aquarius.","zh":"Aquarian 指“与宝瓶座有关的”，也可指“宝瓶座的人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Aquarius (the zodiac sign or the constellation Aquarius).","zh":"与宝瓶座（黄道十二宫的星座或水瓶座/宝瓶座星座）有关的；宝瓶座的。"},"examples":[{"en":"Aquarian people are often described as independent and curious.","zh":"宝瓶座的人常被形容为独立、好奇。"},{"en":"The Aquarian constellation is visible in the night sky in certain seasons.","zh":"在某些季节，夜空中可以看到宝瓶座的星座。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who is an Aquarius (born roughly between January 20 and February 18).","zh":"宝瓶座的人（大约出生于1月20日至2月18日之间）。"},"examples":[{"en":"She’s an Aquarian, so she follows astrology closely.","zh":"她是宝瓶座，所以很关注占星。"},{"en":"Two Aquarians in one team can lead to lots of creative ideas.","zh":"一个团队里有两个宝瓶座，常常会冒出很多创意。"}]}],"synonyms":["Aquarius (adj./n., common in astrology contexts)","zodiacal (broader)"],"phonetic":"/əˈkwɛriən/","extraExplanation":["“Aquarian”来自拉丁语 aquarius，意为“与水/持水者有关”。因此它既可指黄道十二宫的“宝瓶座/水瓶座”，也能指天文学上的“宝瓶座（Aquarius）”这个星座。","在流行文化里，The Age of Aquarius（“宝瓶时代”）常被用来象征理想主义、变革与新观念；这个用法更多是文化意象，并非科学概念。"]}
{"word":"aquarians","summary":{"en":"“Aquarians” means people whose zodiac sign is Aquarius.","zh":"“Aquarians”指水瓶座的人（或水瓶座的人们）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person whose zodiac (astrological) sign is Aquarius (typically born between about January 20 and February 18).","zh":"水瓶座的人（占星学里的星座，通常指出生在1月20日到2月18日左右的人）。"},"examples":[{"en":"She’s an Aquarian, so she says she values independence and originality.","zh":"她是水瓶座，所以她说自己很看重独立和原创。"},{"en":"Many Aquarians enjoy meeting new people and sharing unusual ideas.","zh":"很多水瓶座的人喜欢结识新朋友并分享新奇的想法。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of Aquarian; people who are Aquarians.","zh":"Aquarian 的复数；水瓶座的人们。"},"examples":[{"en":"The club has several Aquarians in it.","zh":"这个俱乐部里有好几位水瓶座。"}]}],"synonyms":["Aquarius (people)","Water Bearers (informal, poetic)"],"phonetic":"/əˈkwɛriənz/","extraExplanation":["“Aquarian / Aquarius”常见于英文的日常闲聊、社交媒体自我介绍与星座内容中，属于文化娱乐语境；并非科学分类。","在英文里可以说 “I’m an Aquarius.”（我是水瓶座。）或 “I’m an Aquarian.” 两者都常见；“Aquarian”更像“某星座的人”这种身份标签。"]}
{"word":"Aquarid","summary":{"en":"An Aquarid is a meteor shower associated with Aquarius, such as the Eta Aquariids or Delta Aquariids.","zh":"Aquarid 指与宝瓶座方向相关的流星雨，如宝瓶座η流星雨或宝瓶座δ流星雨。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a meteor (shooting-star) shower whose meteors seem to come from the direction of the constellation Aquarius; often used in names like the Eta Aquariids or Delta Aquariids","zh":"宝瓶座流星雨；指流星看起来从宝瓶座（Aquarius）的方向辐射出来的流星雨，常见于名称如“宝瓶座η流星雨（Eta Aquariids）”“宝瓶座δ流星雨（Delta Aquariids）”"},"examples":[{"en":"The Eta Aquarids are an Aquarid meteor shower that peaks in early May.","zh":"宝瓶座η流星雨是一种“宝瓶座流星雨”，通常在五月初达到极大。"},{"en":"We stayed up late to watch Aquarid meteors streak across the sky before dawn.","zh":"我们熬夜到凌晨前，看宝瓶座流星划过夜空。"}]}],"synonyms":["Aquariid (variant spelling)","meteor shower"],"phonetic":"/əˈkwɛrɪd/","extraExplanation":["“Aquarid”来自“Aquarius（宝瓶座）+ -id（表示‘属于/来自……的’）”。在天文学里，流星雨常按“辐射点所在星座”命名，所以“某某座 + -ids”很常见（如 Perseids 英仙座流星雨、Leonids 狮子座流星雨）。","常见的 Aquarid 流星雨有两种：Eta Aquariids（通常与哈雷彗星有关，北半球清晨更适合观测）和 Delta Aquariids（多在7月底到8月初活跃）。"]}
{"word":"aquarid","summary":{"en":"An aquarid is a meteor that appears to come from the constellation Aquarius.","zh":"aquarid 指看起来从宝瓶座方向射出的流星（宝瓶座流星）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a meteor belonging to a meteor shower whose apparent point of origin (radiant) is in the constellation Aquarius (often seen in showers like the Eta Aquariids or Delta Aquariids)","zh":"宝瓶座流星；指看起来从宝瓶座（Aquarius）方向射出的流星，常见于宝瓶座η流星雨或宝瓶座δ流星雨等流星雨中"},"examples":[{"en":"During the Eta Aquariids, you may spot an aquarid streaking across the sky before dawn.","zh":"在宝瓶座η流星雨期间，你可能在黎明前看到一颗宝瓶座流星划过夜空。"},{"en":"Astronomy clubs often count aquarids to estimate the shower’s peak activity.","zh":"天文社团常通过统计宝瓶座流星的数量来估计流星雨的极大强度。"}]}],"synonyms":["meteor","shooting star"],"phonetic":"/ˈæk.wə.rɪd/","extraExplanation":["“Aquarid”来自拉丁语 Aquarius（宝瓶座/水瓶座），后缀 -id 常用于表示“属于某个辐射点的流星”（例如 Leonid 狮子座流星、Perseid 英仙座流星）。","实际使用中更常见复数形式 aquariids，尤其在流星雨名称里：Eta Aquariids（宝瓶座η流星雨，主要母体与哈雷彗星有关）与 Delta Aquariids（宝瓶座δ流星雨，夏季常见）。"]}
{"word":"Aquarii","summary":{"en":"Aquarii is a Latin form meaning “of Aquarius,” commonly used in official astronomy names (e.g., Alpha Aquarii). Rarely, it can mean “Aquarians.”","zh":"Aquarii 是拉丁语形式，常用于天文学正式命名中，表示“宝瓶座的”（如 Alpha Aquarii）。较少情况下也可指“水瓶座的人”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin; used in astronomy) “of Aquarius,” the genitive form of *Aquarius*, used in formal star/constellation names.","zh":"（拉丁语；天文学用法）“宝瓶座的”，*Aquarius*（宝瓶座）的属格形式，用于恒星/星座的正式命名。"},"examples":[{"en":"Alpha Aquarii is a bright star in the constellation Aquarius.","zh":"Alpha Aquarii 是宝瓶座中的一颗亮星。"},{"en":"The meteor shower is sometimes labeled “Delta Aquariids” because it appears to radiate from Aquarius.","zh":"这场流星雨有时被标注为“Delta Aquariids（宝瓶座δ流星雨）”，因为它看起来像是从宝瓶座方向辐射而来。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare; astrology) plural form meaning “Aquarians,” people born under the sign Aquarius.","zh":"（较少见；占星）复数形式，指“水瓶座的人”，即出生在水瓶座星座/星象时期的人。"},"examples":[{"en":"Some Aquarii say they value independence and originality.","zh":"一些水瓶座的人说他们重视独立与原创性。"}]}],"synonyms":["of Aquarius","Aquarian"],"phonetic":"/əˈkwɛri.aɪ/","extraExplanation":["在天文学里，很多恒星的正式名称会用“希腊字母 + 拉丁属格”的格式：例如 **Alpha Aquarii** 直译就是“宝瓶座的α星”。这里的 **Aquarii** 不是现代英语的普通变形，而是沿用拉丁语语法，用来表示“属于某个星座/位于某个星座之中”。","你在资料中看到的 **Aquariids / Aquariid**（如 Delta Aquariids 流星雨）也来自同一个拉丁词根，意思是“与宝瓶座有关的（流星雨）”。"]}
{"word":"aquarii","summary":{"en":"Aquarii is mainly a Latin astronomy form meaning “of Aquarius,” used in star names like Delta Aquarii.","zh":"Aquarii 主要是天文学中使用的拉丁语形式，意为“宝瓶座之／属于宝瓶座的”，常见于如 Delta Aquarii 之类的恒星名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Astronomy; Latin form) “of Aquarius.” Used in star names to show a star belongs to the constellation Aquarius (the Water Bearer).","zh":"（天文学；拉丁语形式）“属于宝瓶座的／宝瓶座之”。用于恒星名称中，表示该恒星位于宝瓶座这个星座内。"},"examples":[{"en":"Delta Aquarii is a star in the constellation Aquarius.","zh":"Delta Aquarii 是宝瓶座中的一颗恒星。"},{"en":"In catalogs, “Aquarii” means the star is associated with Aquarius.","zh":"在星表里，“Aquarii”表示这颗星与宝瓶座有关（位于该星座中）。"}]},{"partOfSpeech":"other","definition":{"en":"(Rare; Latin plural) “water-carriers” or “Aquarius people.” Sometimes seen in Latin texts, not common as everyday English.","zh":"（罕见；拉丁语复数）“挑水者／持水者”，或“宝瓶座的人”。多见于拉丁语语境，不常作为日常英语使用。"},"examples":[{"en":"The Latin word aquarii can mean “water-carriers.”","zh":"拉丁词 aquarii 可表示“挑水者”。"}]}],"synonyms":["of Aquarius","Aquarius’s (in meaning)","Aquarians (for people, common English)"],"phonetic":"əˈkwɛəraɪ","extraExplanation":["“Aquarii”最常见于恒星的拜耳命名法（Bayer designation）或传统星名的拉丁属格形式：例如 Alpha Aquarii、Delta Aquarii。这里的 -ii 结尾相当于英语里的 “Aquarius’s / of Aquarius”。","在英语里如果你想表达“水瓶座的人（复数）”，更自然的说法通常是 Aquarians，而不是 aquarii。"]}
{"word":"aquariia","summary":{"en":"Aquaria means more than one aquarium (fish tanks or public aquarium buildings).","zh":"Aquaria 是 aquarium 的复数，指多个鱼缸/水族箱或多个水族馆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of “aquarium” (glass tanks for keeping fish/water plants, or buildings where aquatic animals are kept and shown to the public).","zh":"“aquarium”的复数：指（养鱼/水草的）鱼缸、水族箱；或指（展示水生动物的）水族馆。"},"examples":[{"en":"Many homes have small aquaria with tropical fish.","zh":"很多家庭都有养热带鱼的小鱼缸。"},{"en":"The city’s aquaria help educate visitors about ocean life.","zh":"这座城市的水族馆帮助游客了解海洋生物。"}]}],"synonyms":["aquariums","fish tanks (for the tank meaning)"],"phonetic":"əˈkwɛriə","extraExplanation":["“aquariia”通常是拼写错误；正确拼写多为 aquaria（aquarium 的复数）。","aquarium 源自拉丁语，复数常写作 aquaria（也有人在日常英语里用 aquariums，意思相同，更口语）。"]}
{"word":"aquariist","summary":{"en":"An aquarist is someone who keeps or studies aquarium life.","zh":"aquarist 指饲养、照料或研究水族箱里水生生物的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who keeps, cares for, or studies fish and other aquatic animals in an aquarium","zh":"水族箱爱好者；养鱼（水族）的人；研究或饲养水族动物的人"},"examples":[{"en":"The aquarist checks the water temperature and pH every morning.","zh":"这位水族箱爱好者每天早上都会检查水温和酸碱度。"},{"en":"A skilled aquarist can create a healthy reef tank with stable water conditions.","zh":"有经验的水族饲养者能把珊瑚礁缸养得很健康，水质也很稳定。"}]}],"synonyms":["fishkeeper","aquarium hobbyist"],"phonetic":"/əˈkwɛrɪst/","extraExplanation":["你输入的 **aquariist** 通常被视为拼写错误；更常见、标准的拼写是 **aquarist**。","词根提示：**aqua-** 表示“水”（如 aquatic, aquarium），后缀 **-ist** 表示“从事某事的人/爱好者”（如 pianist, scientist）。"]}
{"word":"aquariiums","summary":{"en":"Aquarium means a fish tank or a public place that displays sea life. Plural: aquariums (common) or aquaria (formal).","zh":"Aquarium 指鱼缸/水族箱或公共的水族馆。复数常用 aquariums，较正式可用 aquaria。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A glass or plastic tank filled with water where fish and other water animals (and sometimes plants) are kept and displayed.","zh":"（家用）水族箱；鱼缸（用来饲养和展示鱼类及其他水生动物，有时也有水草）"},"examples":[{"en":"We bought a small aquarium for our goldfish.","zh":"我们买了一个小鱼缸来养金鱼。"},{"en":"She cleans the aquarium every weekend.","zh":"她每个周末都会清理鱼缸。"}]},{"partOfSpeech":"n.","definition":{"en":"A public building or large place where many kinds of fish and other sea animals are kept for people to see.","zh":"水族馆（公共场所，展示多种鱼类和海洋生物）"},"examples":[{"en":"The children loved the sharks at the aquarium.","zh":"孩子们很喜欢水族馆里的鲨鱼。"},{"en":"We spent the afternoon at the aquarium downtown.","zh":"我们在市中心的水族馆待了一下午。"}]}],"synonyms":["fish tank","tank","aquarium (public facility)","aquaria (plural, formal)"],"phonetic":"/əˈkwɛriəm/","extraExplanation":["你输入的 **aquariiums** 常见原因是拼写把 **aquariums** 里的一个 i 多打了。标准拼写是 **aquariums**（更常用）或 **aquaria**（较正式/偏学术的复数）。","词源上来自拉丁语，和水（aqua）有关，所以拼写中有 **aqua-** 这一段。"]}
{"word":"aquarist","summary":{"en":"An aquarist is someone who keeps and cares for fish and other aquatic life, usually in an aquarium.","zh":"aquarist 指饲养并照料鱼类等水生生物的人，通常是在水族箱中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who keeps, cares for, or studies aquatic animals and plants, especially in an aquarium.","zh":"养鱼缸/水族箱的人；水族饲养者（也可指研究水生动植物的人）。"},"examples":[{"en":"The aquarist checks the water temperature and filters every day.","zh":"这位水族饲养者每天都会检查水温和过滤系统。"},{"en":"As a beginner aquarist, she started with a small tank and hardy fish.","zh":"作为新手养鱼的人，她从一个小鱼缸和耐养的鱼开始。"},{"en":"The aquarist added live plants to improve the tank’s ecosystem.","zh":"他/她加入了活水草来改善鱼缸的生态。"}]}],"synonyms":["fishkeeper","aquarium hobbyist","aquarium keeper"],"phonetic":"/əˈkwɛrɪst/","extraExplanation":["“aquarist”来自“aquarium（水族箱/水族馆）”。常见搭配：freshwater aquarist（淡水玩家/饲养者），saltwater/marine aquarist（海水/海洋玩家/饲养者），aquarist hobby（养鱼爱好）。","与“aquarium”不同：aquarium指“缸/馆”，aquarist指“人”。也不同于“aquatic（水生的）”，aquatic是形容词。"]}
{"word":"aquarists","summary":{"en":"Aquarists are people who keep and care for aquariums.","zh":"aquarists 指“饲养并照料水族箱/鱼缸的人”，即水族爱好者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who keeps and cares for an aquarium (a tank of fish or other aquatic animals and plants).","zh":"养鱼缸/水族箱的人；水族爱好者（饲养并照料鱼类或其他水生动物、植物的人）。"},"examples":[{"en":"Aquarists often test the water to keep fish healthy.","zh":"水族爱好者常常检测水质来保持鱼的健康。"},{"en":"Many aquarists enjoy growing live plants in their tanks.","zh":"许多养鱼缸的人喜欢在缸里种活水草。"}]}],"synonyms":["aquarium keeper","fishkeeper","aquarium hobbyist"],"phonetic":"/əˈkwɛrɪsts/","extraExplanation":["“aquarist”来自拉丁语 aqu(a)-（水）与后缀 -ist（从事者/爱好者）。复数是 aquarists。","在英语语境中，aquarist 常指把养鱼当作爱好或专业的人；更专业、偏商业的说法还有 “aquaculture farmer”（水产养殖者）或在水族馆工作的 “aquarium staff/biologist”。"]}
{"word":"aquarium","summary":{"en":"An aquarium is either a tank for keeping water animals at home or a public place where sea life is displayed.","zh":"Aquarium 指家用的水族箱/鱼缸，或用于展示海洋生物的公共水族馆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A glass tank (or similar container) where fish and other water animals are kept, usually as pets.","zh":"（通常为玻璃制的）鱼缸；水族箱（用来饲养观赏鱼或其他水生动物）。"},"examples":[{"en":"We have a small aquarium with goldfish in our living room.","zh":"我们客厅里有一个小鱼缸，里面养着金鱼。"},{"en":"Remember to clean the aquarium and change some of the water regularly.","zh":"记得定期清理鱼缸，并更换一部分水。"}]},{"partOfSpeech":"n.","definition":{"en":"A public building or place where many kinds of fish and sea animals are shown to visitors.","zh":"水族馆（向公众展示多种鱼类与海洋生物的场所）。"},"examples":[{"en":"The children loved the aquarium, especially the jellyfish exhibit.","zh":"孩子们很喜欢水族馆，尤其是水母展区。"},{"en":"We visited the aquarium to see sharks and sea turtles.","zh":"我们去水族馆看鲨鱼和海龟。"}]}],"synonyms":["fish tank","tank (home use)","public aquarium (place)"],"phonetic":"/əˈkwɛriəm/","extraExplanation":["“Aquarium”来自拉丁语 aquarius（与水有关的），核心概念就是“与水生环境相关的容器或场所”。","日常口语里：家里养鱼的多说 fish tank；更正式或强调生态环境与观赏性时更常用 aquarium。公共的通常说 (public) aquarium 或 aquarium as a place。"]}
{"word":"aquariums","summary":{"en":"“Aquariums” means more than one aquarium—either fish tanks at home or public aquarium buildings.","zh":"“aquariums” 是 aquarium 的复数，指多个鱼缸/水族箱，也可指多个公共水族馆场馆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of aquarium: a glass tank or container where fish and other water animals (and sometimes water plants) are kept, usually as pets or for display.","zh":"aquarium 的复数：水族箱/鱼缸，用玻璃容器饲养并展示鱼类等水生动物（有时也有水生植物）。"},"examples":[{"en":"We have two small aquariums at home, each with a few tropical fish.","zh":"我们家里有两个小鱼缸，每个里面养了几条热带鱼。"},{"en":"Clean the aquariums regularly to keep the water clear.","zh":"要定期清洁鱼缸，保持水清澈。"}]},{"partOfSpeech":"n.","definition":{"en":"Large public buildings or places where many fish and sea animals are kept and shown to visitors.","zh":"大型公共水族馆：向游客展示大量鱼类与海洋动物的场馆。"},"examples":[{"en":"The city’s aquariums attract families and school groups.","zh":"这座城市的水族馆吸引了很多家庭和学校团体。"},{"en":"Several aquariums work together to protect endangered sea turtles.","zh":"多家水族馆合作保护濒危海龟。"}]}],"synonyms":["fish tanks","aquaria (formal)","public aquariums"],"phonetic":"/əˈkwɛriəmz/","extraExplanation":["英语里 “aquarium” 的复数既可以是 aquariums（更常用、更口语），也可以是 aquaria（更偏正式/学术）。在日常交流中用 aquariums 很自然。"]}
{"word":"Aquarius","summary":{"en":"Aquarius can mean the zodiac sign, the constellation, or a person born under that sign.","zh":"Aquarius 可指水瓶座（占星）、宝瓶座（天文学星座），也可指水瓶座的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Astrology) The zodiac sign Aquarius, traditionally connected with the Water-Bearer and covering roughly January 20–February 18.","zh":"（占星术）黄道十二宫的“水瓶座”，传统上与“持水者/倒水者”形象相关，大致对应1月20日至2月18日。"},"examples":[{"en":"She’s an Aquarius, so she celebrates her birthday in early February.","zh":"她是水瓶座，所以她的生日在二月初。"},{"en":"In astrology, Aquarius is often described as independent and forward-thinking.","zh":"在占星里，水瓶座常被描述为独立、思想前卫。"}]},{"partOfSpeech":"n.","definition":{"en":"(Astronomy) The constellation Aquarius (“the Water-Bearer”) in the night sky.","zh":"（天文学）夜空中的“宝瓶座”（Aquarius，“持水者/倒水者”星座）。"},"examples":[{"en":"Aquarius is easier to spot on a clear autumn night.","zh":"在晴朗的秋夜里，宝瓶座更容易辨认。"},{"en":"The meteor shower’s radiant is near Aquarius this year.","zh":"今年这场流星雨的辐射点在宝瓶座附近。"}]},{"partOfSpeech":"n.","definition":{"en":"A person born under the zodiac sign Aquarius.","zh":"水瓶座的人（指出生在水瓶座日期范围内的人）。"},"examples":[{"en":"Two Aquarians in the same team can have lots of creative ideas.","zh":"同一个团队里如果有两个水瓶座，常常会冒出很多创意。"}]}],"synonyms":["Water-Bearer","Aquarian"],"phonetic":"/əˈkwɛriəs/","extraExplanation":["“Aquarius”来自拉丁语 aqua（“水”）相关词源，意象是“Water-Bearer（持水者/倒水者）”。因此中文有“宝瓶座”（天文学常用）与“水瓶座”（占星常用）两种译法。","在英语里它既可以指“星座”（constellation，天文学）也可以指“星座/星座日期范围”（zodiac sign，占星）。写作时如果要更科学严谨，可用 constellation 指天文学星座，用 zodiac sign 指占星星座。"]}
{"word":"aquarius","summary":{"en":"Aquarius can mean either the zodiac sign (Jan 20–Feb 18) or the constellation called the Water-Bearer.","zh":"Aquarius既可以指黄道十二宫的水瓶座（约1/20–2/18），也可以指天文学中的宝瓶座（持水者星座）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Aquarius: the zodiac sign traditionally linked with people born roughly from January 20 to February 18, often associated (in popular astrology) with independence, originality, and humanitarian ideas.","zh":"水瓶座：黄道十二宫之一，传统上对应大约1月20日至2月18日出生的人；在流行占星中常被认为与独立、创新、人道关怀等特质相关。"},"examples":[{"en":"She’s an Aquarius, so she jokes that she needs plenty of personal space.","zh":"她是水瓶座，所以她开玩笑说自己需要很多个人空间。"},{"en":"In horoscopes, Aquarius is often described as creative and forward-thinking.","zh":"在星座运势里，水瓶座常被描述为有创意、很有前瞻性。"}]},{"partOfSpeech":"n.","definition":{"en":"Aquarius: a constellation in the night sky (Latin for “the Water-Bearer”), located near Capricornus and Pisces.","zh":"宝瓶座（或水瓶座）：夜空中的一个星座（拉丁语意为“持水者/倒水者”），位于摩羯座与双鱼座附近。"},"examples":[{"en":"On clear winter nights, you may be able to spot Aquarius in the southern sky.","zh":"在晴朗的冬夜，你可能可以在南方天空看到宝瓶座。"},{"en":"The star chart shows Aquarius next to Pisces.","zh":"星图显示宝瓶座在双鱼座旁边。"}]}],"synonyms":["the Water-Bearer"],"phonetic":"/əˈkwɛriəs/","extraExplanation":["“Aquarius”来自拉丁语，意为“倒水者/持水者”（Water-Bearer）。在西方神话与艺术中常被画成手持水罐向外倒水的人形象。","星座（constellation）是天文学中的“星群区域”；而黄道十二宫的“星座/星座宫”（zodiac sign）是占星术体系中的概念。两者名字常相同（如Aquarius），但用途与含义不同。"]}
{"word":"aquarter","summary":{"en":"“A quarter” means one fourth; it can also mean a 25-cent U.S. coin or fifteen minutes.","zh":"“a quarter” 意为“四分之一”；也可指美国的 25 美分硬币，或 15 分钟（一刻钟）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"One of four equal parts; 1/4 (25%).","zh":"四等份中的一份；四分之一（25%）。"},"examples":[{"en":"I ate a quarter of the pizza.","zh":"我吃了四分之一块披萨。"},{"en":"A quarter of the class was absent today.","zh":"今天全班有四分之一缺席。"}]},{"partOfSpeech":"phrase","definition":{"en":"In the U.S., a quarter is a coin worth 25 cents.","zh":"在美国，quarter 指一枚价值 25 美分的硬币。"},"examples":[{"en":"Do you have a quarter for the parking meter?","zh":"你有一枚 quarter（25 美分硬币）投停车计时器吗？"},{"en":"The snack costs a quarter.","zh":"这个零食要 25 美分。"}]},{"partOfSpeech":"phrase","definition":{"en":"Fifteen minutes; 1/4 of an hour.","zh":"15 分钟；一小时的四分之一。"},"examples":[{"en":"I’ll be there in a quarter of an hour.","zh":"我一刻钟（15 分钟）后到。"},{"en":"Wait a quarter and then call me.","zh":"等 15 分钟再给我打电话。"}]}],"synonyms":["one fourth","one-quarter","a fourth","twenty-five cents (U.S.)","fifteen minutes"],"phonetic":"/ə ˈkwɔɹtɚ/","extraExplanation":["你输入的 “aquarter” 通常写作 “a quarter”（分开写）。在美式英语里更常见的表达是 “a quarter of …”（四分之一的……）或 “in a quarter of an hour”（15 分钟后）。","关于硬币：美国的 quarter 是 25 美分硬币（$0.25），日常中很常用；英式英语里也有 “quarter”，但不同国家硬币体系不一样，语境常指“四分之一”这个概念本身。"]}
{"word":"aquas","summary":{"en":"“Aquas” usually means multiple kinds of water/solutions (plural of “aqua”), and can also mean several aqua (blue‑green) shades.","zh":"“aquas”通常指多种“水/水溶液”（aqua 的复数），也可指多种水绿色（蓝绿色）色调。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"water; especially used in names of solutions, products, or in Latin-style contexts (plural of “aqua”).","zh":"水；尤用于溶液/产品名称或拉丁语风格语境中（aqua 的复数）"},"examples":[{"en":"The lab stored different aquas for cleaning and testing.","zh":"实验室存放了不同种类的“水/水溶液”用于清洁和测试。"},{"en":"Many skincare labels list “aqua” (water); “aquas” is just the plural form.","zh":"很多护肤品成分表写“aqua”（水）；“aquas”只是复数形式。"}]},{"partOfSpeech":"n.","definition":{"en":"the color aqua (a light blue-green); plural when talking about several shades or items.","zh":"水绿色/浅蓝绿色（aqua 这种颜色）；谈到多种色调或多件物品时用复数"},"examples":[{"en":"She compared two aquas to match the paint.","zh":"她对比了两种水绿色来匹配油漆颜色。"},{"en":"The designer used aquas and whites for a beachy look.","zh":"设计师用水绿色和白色营造海边风格。"}]}],"synonyms":["waters","solutions","aqua shades","blue-green tones"],"phonetic":"/ˈɑːkwəz/","extraExplanation":["“aqua”来自拉丁语，意思是“水”。因此在成分表、实验室用语、产品命名里常见“aqua”。日常英语里更常说“water”；“aquas”通常只在需要强调“多种水/多种水溶液”或“多种水绿色”的时候出现。"]}
{"word":"Aquasco","summary":{"en":"Aquasco is a place name for an unincorporated community in Maryland, USA.","zh":"Aquasco 是美国马里兰州的一个地名（非建制社区）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A small unincorporated community (place name) in Prince George’s County, Maryland, in the United States.","zh":"（地名）美国马里兰州乔治王子县的一个非建制社区（小聚落）。"},"examples":[{"en":"She grew up in Aquasco, Maryland, and later moved to Washington, D.C.","zh":"她在马里兰州的 Aquasco 长大，后来搬到了华盛顿特区。"},{"en":"Aquasco is a quiet area with a rural feel.","zh":"Aquasco 是个安静、带有乡村氛围的地方。"}]}],"phonetic":"əˈkwɑːskoʊ","extraExplanation":["“Aquasco”主要作为专有名词（地名）使用，因此一般不译成中文词义；中文里常用音译或直接保留英文拼写。","地名的词源常与当地早期原住民语言或殖民时期命名有关；若需要更准确的词源解释，通常要查阅当地历史或地名志资料。"]}
{"word":"aquascope","summary":{"en":"An aquascope is a tool for looking into water to see underwater things more clearly.","zh":"aquascope 指一种用来更清楚观察水下景物的工具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device (often a tube with a glass bottom) used to look into water and see underwater objects more clearly by reducing surface glare and ripples.","zh":"一种用来更清楚观察水下物体的装置（常见为带玻璃底的筒状器具），可减少水面反光与波纹干扰。"},"examples":[{"en":"The marine biologist used an aquascope to examine coral near the shore.","zh":"海洋生物学家用观水镜观察近岸的珊瑚。"},{"en":"With an aquascope, you can spot fish even when the sun is bright on the water.","zh":"用观水镜，即使阳光在水面很刺眼，也能更容易发现鱼。"}]}],"synonyms":["viewing tube","glass-bottom viewer","underwater viewer"],"phonetic":"/ˈɑːkwəˌskoʊp/","extraExplanation":["aquascope 由拉丁语词根 aqua（“水”）+ scope（“观察器/镜”）构成，字面意思是“看水的器具”。","它常用于浅水区观察（如礁石、鱼类、海草），在水面反光强或水面有细波时尤其有帮助。日常英语里不算高频词，更常见的相关说法有 viewing tube（观察筒）或 glass-bottom viewer（玻璃底观察器）。"]}
{"word":"aquascutum","summary":{"en":"Aquascutum is a British brand famous for classic trench coats and raincoats.","zh":"Aquascutum 是以经典风衣、雨衣著称的英国品牌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Aquascutum: a British clothing brand (best known for trench coats and raincoats).","zh":"Aquascutum：英国服装品牌（以风衣、雨衣最知名）。"},"examples":[{"en":"He wore an Aquascutum trench coat to the interview.","zh":"他穿着一件 Aquascutum 风衣去面试。"},{"en":"Aquascutum is often associated with classic British outerwear.","zh":"Aquascutum 常与经典英式外套联系在一起。"}]}],"synonyms":["British luxury brand (general)","trench-coat brand (general)"],"phonetic":"/ˌækwəˈskjuːtəm/","extraExplanation":["Aquascutum 常被当作专有名词使用，指品牌本身，也可引申指该品牌的外套或风衣（如 “an Aquascutum”）。","名称来自拉丁语 aqua（水）+ scutum（盾），大意是“防水之盾”，与其雨衣、防水外套的品牌形象相关。","它属于英伦经典着装文化语境：强调剪裁、质感与“传统、稳重”的风格；在写作或影视中常用来暗示角色的社会阶层或品味。"]}
{"word":"Aquashicola","summary":{"en":"Aquashicola is a scientific genus name for bacteria found in water-related environments.","zh":"Aquashicola 是一个细菌属的学名，常用于描述与水环境相关的细菌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific genus name for certain bacteria associated with aquatic (water) environments","zh":"一个细菌属的学名，用于指与水生（水环境）有关的一些细菌"},"examples":[{"en":"Aquashicola is a genus name used in microbiology papers.","zh":"Aquashicola 是微生物学论文中使用的一个属名。"},{"en":"Researchers isolated an Aquashicola strain from a freshwater sample.","zh":"研究人员从淡水样本中分离出一株 Aquashicola 细菌。"}]}],"phonetic":"/ˌɑːkwəˈʃɪkələ/","extraExplanation":["这是一个拉丁化的学名（属名），常见于分类学/微生物学语境；在英文句子里通常首字母大写并用斜体（Aquashicola）。","词形上可理解为 aqua-（水）+ -cola（居住者/栖居者），整体含义偏向“栖居于水中的”。具体特征需以相应物种/菌株的描述为准。"]}
{"word":"aquashow","summary":{"en":"Aquashow means a water-themed show (often fountains, lights, and music), and it can also be a branded event name.","zh":"Aquashow 指水主题表演（水景、喷泉、灯光音乐等），也可能是某场活动的品牌名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a water-themed performance or display, often featuring fountains, lights, music, and sometimes swimmers or aquatic animals (also written as “aqua show”).","zh":"水上表演；水景秀（常结合喷泉、灯光、音乐，有时也包括游泳表演或水生动物展示；也可写作 aqua show）。"},"examples":[{"en":"We stayed after dinner to watch the aquashow with music and dancing fountains.","zh":"晚餐后我们留下来看音乐喷泉的水景秀。"},{"en":"The park’s aquashow starts at 8 p.m., so arrive early for good seats.","zh":"公园的水上表演晚上八点开始，所以想坐好位置要早点到。"}]},{"partOfSpeech":"n.","definition":{"en":"a brand name or event title used by some venues for a specific water show (capitalization may vary: AquaShow, Aquashow).","zh":"（专有名词）一些场馆用于特定水上秀的品牌名或活动名（大小写可能写作 AquaShow / Aquashow）。"},"examples":[{"en":"Tickets for AquaShow are sold online only.","zh":"AquaShow 的门票只在网上出售。"},{"en":"The hotel advertises an Aquashow every weekend.","zh":"这家酒店宣传每周末都有一场 Aquashow。"}]}],"synonyms":["aqua show","water show","fountain show","water-and-light show"],"phonetic":"/ˈɑːkwəˌʃoʊ/","extraExplanation":["“aqua-” 来自拉丁语，意思是“水”；和 show 组合后通常指“以水为主题的表演/秀”。在英文里更常见的写法是两个词：aqua show。若在广告、门票或场馆宣传中看到连写 Aquashow/AquaShow，往往是为了品牌化或视觉设计。"]}
{"word":"aquate","summary":{"en":"A rare chemistry verb meaning “to replace ligands with water in a metal complex.”","zh":"一个较少见的化学动词，指“在金属配合物中用水分子取代配体（发生水合取代）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Chemistry) To replace one or more ligands in a metal complex with water molecules, forming an “aqua complex.”","zh":"（化学）使（金属）配合物发生“水合取代”：用水分子取代一个或多个配体，生成“水合（aqua）配合物”。"},"examples":[{"en":"In water, the chloride complex can aquate, replacing Cl− with H2O.","zh":"在水中，氯配合物可能发生 aquate，用 H2O 取代 Cl−。"},{"en":"Aquation is an important step in the activation of some platinum-based drugs.","zh":"“aquation（水合取代）”是一些铂类药物被激活过程中的重要步骤。"}]}],"synonyms":["aquation (n.)","form an aqua complex","undergo aquation"],"phonetic":"/ˈækweɪt/","extraExplanation":["“aquate”主要出现在无机/配位化学语境里，更常见的名词形式是“aquation（通常译作：水合取代/水合反应）”。","日常英语里几乎不用“aquate”。如果你本来想写的是“equate（把……等同；相等）”，拼写接近但意思完全不同。"]}
{"word":"aquatic","summary":{"en":"Aquatic means “related to water” or “living in water,” and it can also refer to a water-living plant or animal.","zh":"Aquatic 指“与水有关的”或“生活在水中的”，也可作名词指水生动植物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Living in, growing in, or relating to water (such as rivers, lakes, or the ocean).","zh":"水生的；生活在水中、在水中生长的；与水域（如河流、湖泊、海洋）有关的。"},"examples":[{"en":"Frogs are semi-aquatic animals because they live both on land and in water.","zh":"青蛙是半水生动物，因为它们既生活在陆地上也生活在水中。"},{"en":"The aquarium has many aquatic plants and colorful fish.","zh":"水族箱里有很多水生植物和色彩鲜艳的鱼。"}]},{"partOfSpeech":"n.","definition":{"en":"An aquatic animal or plant (something that lives in water).","zh":"水生动物或水生植物（生活在水中的生物）。"},"examples":[{"en":"The pond is full of aquatics like water lilies and small fish.","zh":"池塘里有很多水生生物，比如睡莲和小鱼。"}]}],"synonyms":["water","water-dwelling","marine (often specifically ocean-related)"],"phonetic":"/əˈkwætɪk/","extraExplanation":["“aquatic”来自拉丁语 aqua（意为“水”）。你会在很多与水有关的词里看到这个词根，比如 aquarium（水族箱/水族馆）、aqueduct（高架输水道）、aqueous（水的/含水的）。","常见搭配：aquatic life（水生生物）、aquatic plants（水生植物）、aquatic sports（水上运动）。注意 aquatic 和 marine 的区别：aquatic 更广，指任何水域（淡水或海水）；marine 更常指海洋相关。"]}
{"word":"aquatical","summary":{"en":"“Aquatical” means “related to water,” but it’s rare; “aquatic” is the common word.","zh":"aquatical 表示“与水有关/水生的”，但很少用；更常见的是 aquatic。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to water; living in, growing in, or happening in water (rare; usually use “aquatic”).","zh":"与水有关的；在水中生活/生长/发生的（较少见；通常用 aquatic）。"},"examples":[{"en":"Many “aquatical” animals, like fish, breathe using gills.","zh":"许多“aquatical”（水生的）动物，比如鱼，用鳃呼吸。"},{"en":"She studied aquatical plants in the lake for her biology project.","zh":"她为生物项目研究了湖里的水生植物。"}]}],"synonyms":["aquatic","marine","watery"],"phonetic":"/əˈkwætɪkəl/","extraExplanation":["“aquatical”在现代英语里非常少见，听起来偏旧或不自然；日常写作与考试中更常用也更标准的词是“aquatic”。","词源上都来自拉丁语 aqua（“水”）。如果你想表达“水生的/与水相关的”，优先选 aquatic：aquatic animals, aquatic sports, aquatic plants。"]}
{"word":"aquatically","summary":{"en":"Aquatically means “in a way related to water or life in water.”","zh":"aquatically 表示“以与水相关或水生的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to water or living/being in water; in an aquatic manner.","zh":"以与水有关的方式；以水生（在水中生活/活动）的方式。"},"examples":[{"en":"The turtle is adapted to live aquatically, spending most of its time in water.","zh":"这只乌龟适应水生生活，大部分时间都在水里。"},{"en":"These plants grow aquatically in shallow ponds.","zh":"这些植物在浅池塘里水生生长。"},{"en":"Some sports are practiced aquatically, such as swimming and water polo.","zh":"有些运动是在水上/水中进行的，比如游泳和水球。"}]}],"synonyms":["in water","in an aquatic way","water-based"],"phonetic":"/əˈkwætɪkli/","extraExplanation":["“aquatically”来自形容词“aquatic”（水的；水生的），其词根来自拉丁语“aqua”（水）。在学术或科普语境里更常见（如生物学、环境科学、运动训练），日常口语里更常用“in water”“in a water-based way”来表达。"]}
{"word":"aquatics","summary":{"en":"Aquatics usually means water sports/activities (especially swimming) and can also describe things related to water.","zh":"Aquatics通常指水上运动/水上活动（尤其游泳），也可作形容词表示“水生的、与水有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Sports or activities done in or on water, especially swimming.","zh":"水上运动；水中或水面进行的活动（尤指游泳）。"},"examples":[{"en":"The community center offers aquatics for all ages, including swim lessons and water aerobics.","zh":"社区中心提供适合各年龄的水上运动课程，包括游泳课和水中有氧。"},{"en":"She works in aquatics as a lifeguard during the summer.","zh":"她夏天在水上项目部门工作，担任救生员。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to water; living in or near water.","zh":"水生的；与水有关的；生活在水中或近水的。"},"examples":[{"en":"Frogs are semi-aquatic animals.","zh":"青蛙是半水生动物。"},{"en":"Aquatic plants help keep the pond clean.","zh":"水生植物有助于保持池塘清洁。"}]}],"synonyms":["water sports","swimming","aquatic activities"],"phonetic":"/əˈkwætɪks/","extraExplanation":["“aquatics”作名词时常见于课程或部门名称（如 Aquatics Center / Aquatics Program），表示“水上项目/水上运动”，在美式英语里很常用。","词根来自拉丁语 aqua（“水”）。常见同根词：aquarium（水族馆）、aquatic（水生的）、aquifer（含水层）。"]}
{"word":"aquatile","summary":{"en":"Aquatile means aquatic—living in or connected with water.","zh":"aquatile 意为“水生的；与水有关的”，相当于更常见的 aquatic。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"living in, relating to, or adapted for life in water; aquatic.","zh":"生活在水中；与水有关的；适应水中生活的；水生的。"},"examples":[{"en":"Frogs are not fully aquatile, but they spend a lot of time in water.","zh":"青蛙不算完全水生，但它们花很多时间待在水里。"},{"en":"The park protects aquatile plants and animals in its wetlands.","zh":"这座公园保护湿地里的水生动植物。"}]}],"synonyms":["aquatic","water-dwelling","of the water"],"phonetic":"/ˈɑːkwətaɪl/","extraExplanation":["“aquatile”比较少见，更常用的词是“aquatic”。它由拉丁语词根 aqua（“水”）构成，含义与 aquatic 非常接近。","在文学或较正式的描写中，有时会用 aquatile 来营造更“诗意/古典”的水域意象。"]}
{"word":"aquatint","summary":{"en":"Aquatint is a printmaking technique (and the print made by it) used to create soft tonal shading, often like watercolor washes.","zh":"Aquatint 指一种用于表现柔和明暗层次、常带水彩晕染感的版画技法，也可指用该技法印出的版画。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A printmaking method that creates tone (shaded areas) by etching a metal plate so it can hold ink, often producing effects similar to watercolor washes.","zh":"（版画）腐蚀凹版的一种技法：通过处理金属版使其形成可承墨的细微颗粒，从而印出大面积明暗层次，效果常类似水彩的晕染。"},"examples":[{"en":"The artist used aquatint to give the sky a soft, misty gradient.","zh":"艺术家用水彩腐蚀法（aquatint）让天空呈现柔和、雾状的渐层。"},{"en":"Many of Goya’s prints combine etching and aquatint for dramatic light and shadow.","zh":"戈雅的许多版画把蚀刻与水彩腐蚀法结合起来，营造强烈的明暗对比。"}]},{"partOfSpeech":"n.","definition":{"en":"A print made using the aquatint process.","zh":"用水彩腐蚀法（aquatint）印制出来的版画作品。"},"examples":[{"en":"We saw an aquatint in the gallery’s print room.","zh":"我们在画廊的版画室看到一幅水彩腐蚀版画。"}]}],"synonyms":["etching (related)","intaglio (category)","print (general)"],"phonetic":"/ˈɑːkwəˌtɪnt/","extraExplanation":["“Aquatint”源自拉丁语 aqua（“水”），因为它能做出类似水彩渲染的色调效果。常与 etching（蚀刻）一起使用：蚀刻更擅长线条，aquatint 更擅长大面积明暗与氛围。","在艺术史中，西班牙画家戈雅（Francisco Goya）以大量运用 aquatint 著名，例如《The Disasters of War》等系列，常用它来制造阴郁、戏剧性的灰度与质感。"]}
{"word":"aquatinta","summary":{"en":"Aquatinta is a tonal etching technique (and the resulting print), basically the same as aquatint.","zh":"Aquatinta 指一种制造明暗层次的蚀刻版画技法（及其作品），基本等同于 aquatint。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a printmaking technique (and the print made by it) that uses acid etching to create areas of tone, often resembling watercolor washes; essentially the same as “aquatint.”","zh":"一种版画技法（以及用此技法印出的作品），通过酸蚀制造大面积明暗层次，效果常像水彩晕染；基本等同于 aquatint（飞尘腐蚀/水彩铜版法）。"},"examples":[{"en":"The artist used aquatinta to produce soft gray shadows in the landscape.","zh":"艺术家用 aquatinta 在风景中做出柔和的灰色阴影。"},{"en":"This museum room includes aquatinta prints from the 18th century.","zh":"这个展厅里有一些18世纪的 aquatinta 版画作品。"}]}],"synonyms":["aquatint","etching (related term)","intaglio (broader term)"],"phonetic":"/ˌɑːkwəˈtɪntə/","extraExplanation":["“Aquatinta”常见于西班牙语、意大利语等语境中，英语里更常用拼写“aquatint”。它通常与蚀刻（etching）一起出现：先用树脂粉（或类似材料）在金属版上形成细小颗粒，再用酸腐蚀，得到连续的明暗调子，而不仅是线条。","在艺术史中，西班牙画家戈雅（Goya）常把蚀刻与 aquatint 结合，用来表现强烈的光影与氛围；因此在展览说明或画册里你可能会看到“etching and aquatint/aquatinta（蚀刻与飞尘腐蚀）”。"]}
{"word":"aquatinted","summary":{"en":"Aquatinted means “made with aquatint,” or it can be the past form of the verb aquatint (to create aquatint shading in printmaking).","zh":"aquatinted 指“用水彩蚀刻法制作的”，也可作动词 aquatint 的过去式/过去分词（用水彩蚀刻法做出柔和明暗层次）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made using aquatint, a printmaking technique that creates soft, watercolor-like tones.","zh":"以“水彩蚀刻法（aquatint）”制作的；呈现柔和、类似水彩的色调效果的（版画/印刷效果）。"},"examples":[{"en":"The museum displayed an aquatinted landscape with misty gray shadows.","zh":"博物馆展出了一幅以水彩蚀刻法制作的风景版画，灰色阴影朦胧柔和。"},{"en":"She prefers aquatinted prints because they look more atmospheric than sharp line etchings.","zh":"她更喜欢水彩蚀刻版画，因为它们比线条清晰的蚀刻画更有氛围感。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of aquatint: to create a print or image using the aquatint process.","zh":"aquatint 的过去式/过去分词：用水彩蚀刻法制作（版画/图像）。"},"examples":[{"en":"The artist aquatinted the plate to add soft shading behind the figures.","zh":"艺术家对金属版进行水彩蚀刻处理，为人物背后加上柔和的明暗层次。"},{"en":"After the plate was aquatinted, it was inked and printed on damp paper.","zh":"金属版完成水彩蚀刻处理后，上墨并在湿纸上印刷。"}]}],"synonyms":["aquatint (adj./n.)","etched (related)","engraved (related)","printed"],"phonetic":"/ˈæk.wə.tɪn.tɪd/","extraExplanation":["“Aquatint（水彩蚀刻法）”常用于铜版/金属版画：先在金属版上撒松香粉并加热使其附着，再用酸腐蚀出许多细小点状纹理，从而形成大面积、渐层式的明暗效果，视觉上很像水彩的晕染。它常与 etching（蚀刻线条）结合：线条由蚀刻完成，明暗与色调由 aquatint 完成。","在艺术史中，西班牙画家戈雅（Goya）的部分版画就大量使用 aquatint 来营造强烈的光影与氛围。"]}
{"word":"aquatinter","summary":{"en":"An aquatinter is a printmaker who creates aquatint etchings to produce soft tonal shading.","zh":"aquatinter 指制作水彩蚀刻（aquatint）版画、擅长做出柔和明暗层次的版画家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A printmaker or etcher who makes aquatint prints (images created by etching tonal areas onto a metal plate).","zh":"水彩蚀刻版画家；制作“水彩蚀刻（aquatint）”版画的人（通过在金属版上蚀刻出大面积明暗层次来成像）。"},"examples":[{"en":"Goya was a famous artist and aquatinter whose prints show rich light and shadow.","zh":"戈雅是一位著名的艺术家与水彩蚀刻版画家，他的版画呈现出丰富的明暗层次。"},{"en":"The aquatinter tested several resin dustings to create smoother gray tones.","zh":"这位水彩蚀刻版画家尝试了几次松香粉撒布，以做出更平滑的灰色调。"}]}],"synonyms":["aquatint artist","printmaker","etcher (related)"],"phonetic":"/ˈæk.wəˌtɪn.tɚ/","extraExplanation":["“Aquatinter”来自“aquatint（水彩蚀刻）”。Aquatint 是一种凹版版画技法：在金属版上撒松香粉并加热固定，再用酸液蚀刻，形成类似水洗或水彩的大片色调与层次。","在艺术史语境中，aquatint 常与 etching（蚀刻线条）结合使用：线条用蚀刻完成，明暗面用 aquatint 完成，因此不少版画家既是 etcher 也是 aquatinter。","相关词：aquatint（技法/作品），etcher（蚀刻版画家，更强调线条），printmaker（更广义的版画家）。"]}
{"word":"aquatinting","summary":{"en":"Aquatinting is the printmaking process of using aquatint to create soft tonal shading on a metal plate.","zh":"Aquatinting 指用水彩腐蚀（喷粉腐蚀）法在金属版上做出柔和的明暗层次的版画制作过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process or technique of making an aquatint print—an intaglio (etched) method that creates soft, tonal areas like watercolor washes.","zh":"水彩腐蚀（喷粉腐蚀）版画的制作过程／技法：一种凹版蚀刻方法，可印出类似水彩晕染的柔和明暗层次。"},"examples":[{"en":"Aquatinting is often used to add gentle shading to an etching.","zh":"水彩腐蚀常用于给蚀刻版添加柔和的明暗层次。"},{"en":"The artist experimented with aquatinting to create misty skies and smooth gradients.","zh":"这位艺术家尝试用水彩腐蚀来表现朦胧的天空与平滑的渐变。"}]},{"partOfSpeech":"v.","definition":{"en":"The act of creating tonal textures on a metal plate by aquatint (as part of printmaking).","zh":"（版画中）用水彩腐蚀法在金属版上制作明暗肌理的动作／步骤。"},"examples":[{"en":"She spent the afternoon aquatinting the plate before the final print run.","zh":"她花了一整个下午在正式印刷前对版面进行水彩腐蚀处理。"},{"en":"He is aquatinting over the etched lines to deepen the shadows.","zh":"他在蚀刻线条上方做水彩腐蚀，以加深阴影。"}]}],"synonyms":["aquatint (process)","intaglio shading","tonal etching"],"phonetic":"/ˈæk.wə.tɪn.tɪŋ/","extraExplanation":["“Aquatinting”来自“aquatint（意为‘像水彩一样的色调’）”。传统做法通常是在金属版上撒松香粉并加热使其附着，再用酸腐蚀形成细小点状孔隙，从而在印刷时产生连续的灰阶效果。","在艺术史上，西班牙画家戈雅（Goya）的版画常被提到与aquatint相关；学习时可把它理解为“让蚀刻不只画线条，还能‘铺出一片阴影/雾感’的技法”。"]}
{"word":"aquatintist","summary":{"en":"An aquatintist is an artist who makes aquatint prints.","zh":"aquatintist 指制作 aquatint（水彩凹版画/粉蚀法凹版画）的版画家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An artist or printmaker who creates aquatints (prints made using the aquatint etching technique).","zh":"（版画）凹版腐蚀制版中的“水彩凹版法”创作者；制作 aquatint（水彩凹版画）的艺术家/版画家。"},"examples":[{"en":"Goya is famous as an aquatintist, using aquatint to create soft shadows and dramatic contrasts.","zh":"戈雅以 aquatintist（制作水彩凹版画的版画家）闻名，他用这种技法营造柔和的阴影和强烈的对比。"},{"en":"The museum acquired works by a 19th-century aquatintist known for detailed landscapes.","zh":"博物馆收藏了一位19世纪 aquatintist 的作品，他以细致的风景版画著称。"}]}],"synonyms":["aquatint engraver","aquatint printmaker","printmaker"],"phonetic":"/ˈæk.wəˌtɪn.tɪst/","extraExplanation":["“Aquatint（中译常见为水彩凹版、粉蚀法）”是一种凹版版画技法：在金属版上撒松香粉并加热固定，再用酸腐蚀形成颗粒状的层次，从而能印出类似水彩洗染的大片明暗效果。因此 aquatintist 往往强调“调子（tone）”与渐变，而不仅是线条。"]}
{"word":"aquatints","summary":{"en":"Aquatints are prints made with the aquatint etching technique, known for soft, watercolor-like tones.","zh":"Aquatints 指用松香腐蚀法（aquatint）制作的版画，特点是柔和、类似水彩晕染的明暗层次。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Prints made using the aquatint technique (an etching method that creates soft tonal areas, like watercolor washes).","zh":"以“松香腐蚀法/水彩铜版法（aquatint）”制作的版画作品（能产生类似水彩晕染的柔和明暗层次）。"},"examples":[{"en":"The museum displayed a series of Goya’s aquatints.","zh":"博物馆展出了一组戈雅的松香腐蚀版画。"},{"en":"She collects aquatints because they have rich, atmospheric shading.","zh":"她收藏松香腐蚀版画，因为它们的明暗层次浓郁、氛围感强。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular form of “aquatint”: to make an aquatint print from a metal plate.","zh":"“aquatint”的第三人称单数：用松香腐蚀法在金属版上制版并印刷。"},"examples":[{"en":"The artist aquatints the background to create a misty tone.","zh":"艺术家用松香腐蚀法处理背景，营造出朦胧的明暗效果。"}]}],"synonyms":["etchings","prints","intaglio prints","aquatint prints"],"phonetic":"/ˈɑːkwəˌtɪnts/","extraExplanation":["“Aquatint（松香腐蚀法）”是铜版画（etching）的一种变体：在金属版上撒松香粉并加热固定，再用酸腐蚀，能得到大面积、柔和的灰阶与色调，而不是清晰的线条。常用来表现天空、阴影、雾气等。","在艺术史中，西班牙画家弗朗西斯科·戈雅（Francisco Goya）以结合蚀刻与aquatint的版画系列《战争的灾难》等闻名。"]}
{"word":"aquation","summary":{"en":"Aquation is a chemistry term for replacing ligands on a metal complex with water molecules.","zh":"Aquation 是化学术语，指金属配合物上的配体被水分子取代的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In chemistry, a reaction in which one or more ligands on a metal complex are replaced by water molecules, forming an “aqua complex.”","zh":"（化学）水合反应：金属配合物上一个或多个配体被水分子取代，生成“水配合物（aqua complex）”的反应。"},"examples":[{"en":"Aquation can make a metal complex more reactive in water.","zh":"水合反应会使某些金属配合物在水中更容易发生反应。"},{"en":"The chloride ligands undergo aquation, producing a complex with water bound to the metal.","zh":"氯配体发生水合取代，生成金属与水分子配位的新配合物。"}]}],"synonyms":["hydration (in some contexts)","aqua substitution"],"phonetic":"/ˌækwiˈeɪʃən/","extraExplanation":["“Aquation”是化学术语，和常见的“equation（方程式）”不是同一个词。很多人因为拼写相近而混淆：equation 指数学/物理里的“方程（式）”，而 aquation 专指配位化学里“被水取代”的过程。"]}
{"word":"aquativeness","summary":{"en":"Aquativeness means a fondness for water and water activities; historically, it was also a phrenology term for a supposed trait.","zh":"Aquativeness 指“喜爱水及水上活动的倾向”；历史上也曾是颅相学中表示某种特质的术语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A liking for water-related activities (such as swimming, boating, or spending time near water).","zh":"喜爱与水有关的活动（如游泳、划船或在水边活动）的倾向。"},"examples":[{"en":"Her aquativeness shows up every summer—she’s at the beach almost every weekend.","zh":"她的“爱水倾向”每到夏天就显现出来——几乎每个周末都去海边。"},{"en":"The camp is perfect for kids with strong aquativeness because it focuses on swimming and kayaking.","zh":"这个夏令营很适合特别爱水的孩子，因为主要项目是游泳和皮划艇。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical, uncommon) In phrenology, the supposed mental “faculty” linked to enjoying water, swimming, or traveling by water.","zh":"（历史用法，较少见）在颅相学中，被认为与喜爱水、游泳或水上旅行相关的“心理能力/倾向”。"},"examples":[{"en":"Old phrenology texts sometimes listed “aquativeness” as a separate trait.","zh":"旧时的颅相学书籍有时会把 aquativeness 列为一种独立性格特质。"}]}],"synonyms":["love of water","fondness for water","enjoyment of swimming","water-loving nature"],"phonetic":"ˈækwətɪvnəs","extraExplanation":["这个词在现代英语里非常少见，多见于较正式或带点幽默的写作；日常更常说：love of swimming / fondness for the water / enjoy water sports。","词形上来自拉丁词根 aqua（“水”）+ -iveness（表示“……的性质/倾向”），因此字面意思就是“对水的倾向”。","颅相学（phrenology）是一种19世纪流行、后来被认为缺乏科学依据的理论；所以与之相关的用法通常带有历史色彩。"]}
{"word":"aquatone","summary":{"en":"Aquatone is a technique/effect used in printing or reproduction to create soft, watercolor-like tonal shading.","zh":"Aquatone 指一种印刷/复制中的技法或效果，用来呈现柔和、类似水彩的明暗层次。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a printmaking or photo-reproduction method that creates soft, watercolor-like shading (continuous tones), often used to reproduce drawings or photographs in a way similar to aquatint","zh":"（版画/制版/影像复制中的）水彩调式（柔和明暗）效果或工艺；常用于产生类似“凹版水彩蚀刻（aquatint）”那样的连续色调与阴影"},"examples":[{"en":"The illustrator chose an aquatone process to keep the shadows soft and atmospheric.","zh":"插画师选择了 aquatone 工艺，让阴影保持柔和、富有氛围。"},{"en":"This book’s plates were printed with aquatone to reproduce the original wash drawings.","zh":"这本书的插图版使用 aquatone 印制，以再现原作的水洗画效果。"}]}],"synonyms":["aquatint","tonal printing","photo-etching (context-dependent)"],"phonetic":"ˈækwəˌtoʊn","extraExplanation":["“Aquatone”多见于印刷与图像制版语境，强调“连续色调/柔和层次”（不像一般线条版那么硬）。不同领域对它的具体工艺细节可能略有差异，但学习时抓住“像水彩一样的明暗过渡”这个核心意思最实用。","它常被拿来与“aquatint（凹版水彩蚀刻）”联系理解：两者都追求类似水彩渲染的阴影与质感。实际使用中，aqua-（水）+ tone（色调）也能帮助你记忆其含义。"]}
{"word":"aquatones","summary":{"en":"Aquatones are (rare) continuous‑tone printing/photographic reproductions, often linked to an Aquatone® screening process.","zh":"Aquatones（较少见）指与 Aquatone® 网屏相关的连续调影印/摄影复制品或其工艺，用于呈现平滑的明暗层次。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare; printing/photography) A continuous‑tone reproducing process or print made with an Aquatone® screen/film, used to create smooth gradations rather than obvious dots.","zh":"（罕见；印刷/摄影）一种使用 Aquatone® 网屏/胶片制作的连续调影印工艺或其成品，用来呈现平滑的明暗过渡，而不是明显的网点。"},"examples":[{"en":"The designer chose aquatones to keep the shadows smooth in the brochure photos.","zh":"设计师在宣传册照片中选用 aquatones 来保持阴影的平滑过渡。"},{"en":"Early magazines sometimes used aquatone prints for richer tonal range.","zh":"早期杂志有时会用 aquatone 印刷来获得更丰富的明暗层次。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural form of aquatone (the process or the resulting prints).","zh":"aquatone 的复数形式（指该工艺或印刷成品）。"},"examples":[{"en":"The archive includes several aquatones from the same photo session.","zh":"档案中包含同一次拍摄会话产生的多张 aquatones 作品。"}]}],"synonyms":["continuous-tone print","screened print","aquatint (related but not the same)"],"phonetic":"/ˈæk.wəˌtoʊn/","extraExplanation":["“Aquatone”常见于旧式印刷与摄影复制领域，也可能以商标/品牌名出现；因此在不同资料里含义会略有差异。","它容易与更常见的 “aquatint（飞尘腐蚀法，一种版画蚀刻技法）” 混淆：aquatint 属于版画蚀刻；aquatone 更偏向影像的连续调复制。"]}
{"word":"aquavalent","summary":{"en":"Aquavalent is a rare term meaning “water-equivalent,” used to describe something measured or compared as an equivalent amount/effect of water.","zh":"Aquavalent 是一个较罕见的词，意为“水当量的/等同于水的”，用来表示按与水等量或等效的方式来衡量或比较。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare, technical) Equivalent to water in amount, effect, or value; “water-equivalent.”","zh":"（罕见/技术用语）在数量、作用或价值上相当于水的；“等同于水的/水当量的”。"},"examples":[{"en":"The report converts different beverages into an aquavalent amount of water for comparison.","zh":"报告把不同饮料换算成等同于水的量，以便比较。"},{"en":"Use the aquavalent volume when you calculate hydration needs.","zh":"计算补水需求时，请使用“水当量”体积。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) Related to a term formed from aqua- (“water”) + -valent (“having a certain equivalence or combining capacity”).","zh":"（罕见）与由 aqua-（水）和 -valent（等价/价态、具有结合能力）构成的术语相关。"},"examples":[{"en":"Some writers use aquavalent as a nonstandard alternative to water-equivalent.","zh":"有些作者把 aquavalent 当作不太规范的 water-equivalent（等同于水的）的替代说法。"}]}],"synonyms":["water-equivalent","equivalent","aqueous (context-dependent)"],"phonetic":"/ˌɑːkwəˈveɪlənt/","extraExplanation":["这个词在通用英语里几乎不常见，多出现在小众技术写作或作为自造词使用。实际写作中更推荐用更标准、读者更容易理解的表达：water-equivalent（等同于水的/水当量的）、equivalent amount of water（等量的水）。","构词提示：aqua- 表示“水”，-valent 常见于 equivalent（等价的）、monovalent/divalent（化学中的一价/二价）等词里。aquavalent 通常就是“与水等价/按水来折算”的意思。"]}
{"word":"aquavit","summary":{"en":"Aquavit is a Scandinavian spirit typically flavored with caraway or dill.","zh":"Aquavit 是一种北欧烈酒，常以葛缕子或莳萝等香料调味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Scandinavian distilled alcoholic drink, usually flavored with caraway or dill.","zh":"一种斯堪的纳维亚（北欧）烈酒，通常用葛缕子（caraway）或莳萝（dill）调味。"},"examples":[{"en":"He ordered aquavit with pickled herring at the Nordic restaurant.","zh":"他在北欧餐厅点了腌鲱鱼配一杯阿夸维特（北欧香料烈酒）。"},{"en":"Aquavit is often served chilled in small glasses.","zh":"阿夸维特常常冰镇后用小杯饮用。"},{"en":"For a holiday toast, they brought out a bottle of aquavit.","zh":"节日举杯时，他们拿出了一瓶阿夸维特。"}]}],"synonyms":["Scandinavian spirit","caraway-flavored spirit"],"phonetic":"/ˈɑːkwəˌviːt/","extraExplanation":["“aquavit”来自拉丁语 *aqua vitae*，意为“生命之水”。在挪威、丹麦、瑞典等地较常见，常与腌渍鱼类、烟熏肉、节庆聚会等饮食文化联系在一起。"]}
{"word":"aquavits","summary":{"en":"Aquavits are Scandinavian spirits (aquavit), typically flavored with caraway or dill.","zh":"Aquavits 指北欧烈酒 aquavit，通常用葛缕子或莳萝等香料调味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Scandinavian distilled spirit, usually flavored with caraway or dill (often served chilled, especially with seafood).","zh":"一种斯堪的纳维亚（北欧）蒸馏烈酒，通常用葛缕子或莳萝等香料调味（常冷饮，尤其配海鲜）。"},"examples":[{"en":"In Norway, aquavit is often served cold during holiday meals.","zh":"在挪威，节日餐桌上常把 aquavit 冰镇后饮用。"},{"en":"She ordered smoked salmon with a small glass of aquavit.","zh":"她点了烟熏三文鱼，还配了一小杯 aquavit。"}]}],"synonyms":["aquavit","Scandinavian spirit","caraway-flavored schnapps"],"phonetic":"/ˈɑːkwəˌviːt/","extraExplanation":["“Aquavit”一词来自拉丁语 *aqua vitae*，意为“生命之水”。在北欧文化里，它常出现在圣诞节、复活节等聚会与祝酒场合。","拼写提示：常见单数是 **aquavit**，复数可说 **aquavits**；在北欧语言中也常写作 **akevitt/akvavit**（不同国家拼法不同）。"]}
{"word":"Aquebogue","summary":{"en":"Aquebogue is a small community (hamlet) on Long Island’s North Fork in New York.","zh":"Aquebogue 是美国纽约州长岛北叉上的一个小社区（村落）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hamlet (small community) on the North Fork of Long Island in Suffolk County, New York, USA.","zh":"美国纽约州萨福克县（长岛北叉）上的一个小社区/村落（Aquebogue）。"},"examples":[{"en":"Aquebogue is a quiet area on Long Island’s North Fork, known for farms and vineyards.","zh":"Aquebogue 位于长岛北叉，是一个安静的地区，以农场和葡萄园闻名。"},{"en":"We drove through Aquebogue on the way to the beaches and wineries nearby.","zh":"我们开车经过 Aquebogue，前往附近的海滩和酒庄。"}]}],"synonyms":["(no direct synonyms; it is a proper place name)"],"phonetic":"/ˈɑːkwəˌbɔːɡ/","extraExplanation":["“Aquebogue”是地名（专有名词），一般不翻译，常按英文拼写使用。","词源通常被认为与当地原住民语言（阿尔冈昆语族相关）有关，常被解释为与“河流/水”有关的含义；不过不同资料对精确词源与释义可能略有差异。","在日常英语中，你更可能在地址、旅游介绍、新闻或地理描述里见到它，而不是在普通词汇对话中。"]}
{"word":"aqueduct","summary":{"en":"An aqueduct is a man-made structure that carries water over distance, often into a city.","zh":"aqueduct 指人造的输水建筑，用于远距离输水，常把水引入城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A structure (often a bridge-like channel) built to carry water from one place to another, especially to supply cities or farmland.","zh":"引水道；渡槽（常为桥状水渠），用于把水从一处输送到另一处，尤指为城市或农田供水。"},"examples":[{"en":"The ancient Romans built aqueducts to bring fresh water into their cities.","zh":"古罗马人建造引水道，把淡水引入城市。"},{"en":"You can still see a stone aqueduct spanning the valley outside the town.","zh":"在城外你仍能看到一座横跨山谷的石质渡槽。"}]}],"synonyms":["waterway","water channel","conduit","canal"],"phonetic":"/ˈækwəˌdʌkt/","extraExplanation":["“aqueduct”来自拉丁语 aqua（水）+ ducere（引导/带领），字面意思是“引水”。","罗马引水道常被视为工程与城市文明的象征：它们利用重力让水持续流动，而不需要水泵。","在现代语境中，aqueduct 也可以指任何大型输水工程（不一定是古代那种拱桥式结构）。"]}
{"word":"aqueducts","summary":{"en":"Aqueducts are structures that carry water over distance, often on arched bridges.","zh":"Aqueducts 指用于远距离输水的结构，常见为拱形高架渡槽。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A structure (often a bridge-like channel) built to carry water from one place to another, usually across a valley or other gap.","zh":"（常见为桥状水道的）渡槽；高架水道，用来把水从一处输送到另一处，常跨越山谷或低洼地。"},"examples":[{"en":"The ancient Romans built aqueducts to bring fresh water into their cities.","zh":"古罗马人修建渡槽，把清洁的水引入城市。"},{"en":"You can still see the stone arches of the aqueducts outside the old town.","zh":"在老城区外你仍能看到渡槽的石拱。"}]}],"synonyms":["waterway","channel","conduit","watercourse"],"phonetic":"/ˈæk.wə.dʌkts/","extraExplanation":["“Aqueduct”来自拉丁语 aquaeductus（aqua=水，ducere=引导/带领），字面意思是“引水”。古罗马的渡槽系统非常著名，常用拱券结构抬高水道，利用重力让水持续流动。","英语里 aqueduct 的复数是 aqueducts（你输入的就是复数形式）。另外也有较少见的拉丁式复数 aqueducts / aqueductūs 的讨论，但现代英语写作最常用 aqueducts。"]}
{"word":"aqueintance","summary":{"en":"An acquaintance is someone you know a little (not a close friend), or your familiarity with something.","zh":"acquaintance 指“熟人/泛泛之交”，也可指对某事的“了解/熟悉”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person you know slightly, but not well enough to be a close friend.","zh":"熟人；相识的人（认识但不算亲密的朋友）"},"examples":[{"en":"She’s an acquaintance from my old job, not a close friend.","zh":"她是我以前工作时认识的熟人，不是亲密朋友。"},{"en":"I ran into an old acquaintance at the grocery store.","zh":"我在杂货店偶遇了一位老熟人。"}]},{"partOfSpeech":"n.","definition":{"en":"Knowledge or familiarity with something (often followed by “with”).","zh":"了解；熟悉（常与 with 连用）"},"examples":[{"en":"He has a good acquaintance with classical music.","zh":"他对古典音乐很熟悉。"},{"en":"My acquaintance with Japanese culture comes mostly from books.","zh":"我对日本文化的了解主要来自书本。"}]}],"synonyms":["contact","associate","friend (informal, often not as close)","familiarity","knowledge"],"phonetic":"əˈkweɪntəns","extraExplanation":["你输入的 “aqueintance” 常见拼写错误，正确拼写是 “acquaintance”。记忆法：中间有 “acquaint”（认识、结识），加上名词后缀 “-ance”。","“acquaintance” 和 “friend” 的差别：acquaintance 更强调“认识但不亲近”；friend 则有情感和更深的关系。","常见搭配：make someone’s acquaintance（与某人初次相识/结识某人），a casual acquaintance（泛泛之交），a mutual acquaintance（共同熟人）。"]}
{"word":"aqueity","summary":{"en":"Acuity means sharpness—especially sharp vision, hearing, or thinking.","zh":"Acuity 指“敏锐度/清晰度”，常用于视力、听力或思维的敏锐程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Sharpness or keenness of the senses or mind; the ability to notice small details clearly.","zh":"（感官或思维的）敏锐度；清晰分辨细微差别的能力。"},"examples":[{"en":"Her visual acuity is excellent, so she can read small print easily.","zh":"她的视力敏锐度很好，所以能轻松阅读小字。"},{"en":"The job requires mental acuity and careful attention to detail.","zh":"这份工作需要思维敏锐，并且要非常注意细节。"},{"en":"With age, hearing acuity may decrease.","zh":"随着年龄增长，听觉敏锐度可能会下降。"}]}],"synonyms":["sharpness","keenness","perceptiveness","clarity"],"phonetic":"/əˈkjuːəti/","extraExplanation":["你输入的“aqueity”很可能是拼写错误；正确拼写通常是 **acuity**（常用，指敏锐度）而不是 *aqueity*。","**acuity** 常见搭配：**visual acuity**（视力敏锐度）、**auditory/hearing acuity**（听觉敏锐度）、**mental acuity**（思维敏锐度）。医学或测量语境里尤其常见。"]}
{"word":"aquench","summary":{"en":"Aquench is an archaic/poetic form of “quench,” meaning to extinguish something (like fire) or to satisfy thirst.","zh":"Aquench 是“quench”的古语/诗歌用法，表示“扑灭（如火）”或“解渴”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic/poetic) To quench or extinguish (especially a fire); to put out.","zh":"（古语/诗歌用法）扑灭；熄灭（尤指火）。"},"examples":[{"en":"The rain came down to aquench the flames.","zh":"雨倾盆而下，把火焰熄灭了。"},{"en":"They tried to aquench the burning torches before entering the cave.","zh":"他们在进洞前试着把燃烧的火把熄灭。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Archaic/poetic) To satisfy (thirst); to drink enough so you no longer feel thirsty.","zh":"（古语/诗歌用法）解渴；止渴。"},"examples":[{"en":"He stopped at the stream to aquench his thirst.","zh":"他在小溪边停下脚步解渴。"},{"en":"Cool water can aquench thirst after a long walk.","zh":"走了很久之后，凉水能解渴。"}]}],"synonyms":["quench","extinguish","put out","douse","slake"],"phonetic":"/əˈkwɛntʃ/","extraExplanation":["“aquench”现在非常少见，多见于旧文学或诗歌，现代英语通常直接用“quench”。它里的前缀 a- 可理解为一种古老的加强/附加形式（类似 older forms 中的用法），所以整体意思并不新，就是“quench”的文雅或古风写法。"]}
{"word":"aqueo","summary":{"en":"“Aqueo” isn’t standard English; you probably want “aqueous” (water-related).","zh":"“aqueo” 不是标准英语；你可能想表达的是 “aqueous”（与水有关的）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or shortened form of “aqueous” (meaning related to water).","zh":"不是标准英语单词。很可能是 “aqueous”（与水有关的）的拼写错误或缩写。"},"examples":[{"en":"Did you mean “aqueous solution” (a solution made with water)?","zh":"你是不是想说 “aqueous solution”（水溶液）？"},{"en":"In chemistry class, we often describe reactions in an aqueous environment.","zh":"在化学课上，我们常说反应发生在水环境（aqueous environment）中。"}]}],"synonyms":["aqueous","watery","water-based"],"phonetic":"/əˈkwiəs/","extraExplanation":["在英语里更常见的是 **aqueous**（/əˈkwiəs/），来自拉丁语 *aqua*（水）。常用于科学语境：**aqueous solution**（水溶液）、**aqueous humor**（眼房水）。如果你是在西班牙语里看到 *aqueo*，那是西语形容词，意思也与水有关，但在英语里一般不用这个形式。"]}
{"word":"aqueoglacial","summary":{"en":"Aqueoglacial means ‘related to glaciers and their meltwater,’ especially deposits or landforms made by meltwater from ice.","zh":"aqueoglacial 指“与冰川及其融水有关的”，常用来描述由冰川融水形成的沉积物或地貌。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to water (especially meltwater) and glaciers; formed by, carried by, or occurring in meltwater associated with glacial ice.","zh":"与水（尤指冰川融水）和冰川有关的；由冰川融水形成、搬运或发生在冰川融水环境中的。"},"examples":[{"en":"Aqueoglacial sediments were deposited by streams flowing from the melting ice.","zh":"冰川融水河流沉积了这些水-冰川（aqueoglacial）沉积物。"},{"en":"The valley contains aqueoglacial sands and gravels left after the glacier retreated.","zh":"冰川退却后，这个山谷里留下了水-冰川砂和砾石沉积。"}]}],"synonyms":["glaciofluvial","meltwater (as an adjective: meltwater deposits)","proglacial (related term)"],"phonetic":"/ˌɑːkwi.oʊˈɡleɪʃəl/","extraExplanation":["“aqueo-”来自拉丁语 aqua（“水”），与“glacial”（“冰川的”）组合，常见于地质学/地貌学文献，用来强调“冰川融水”在搬运与沉积过程中的作用。","在英语中更常见的近义术语是“glaciofluvial”（冰川河流的）与“glaciolacustrine”（冰川湖相的）；“aqueoglacial”较少见，但含义相近，读到时可按“与冰川融水有关的”来理解。"]}
{"word":"aqueoigneous","summary":{"en":"A rare adjective meaning “related to both water and igneous (volcanic/heat) processes.”","zh":"一个罕见的形容词，表示“同时与水作用和火成（火山/热）作用有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/technical) Relating to both water (aqueous) and fire/volcanic heat (igneous); describing processes or rocks influenced by water and magma/heat.","zh":"（罕见/技术用语）同时与水（aqueous）和火成/火山热（igneous）有关；指受水与岩浆/热作用共同影响的过程或岩石。"},"examples":[{"en":"Some older geology texts used terms like “aqueoigneous” for rocks shaped by both hot water and volcanic heat.","zh":"一些较早的地质学文献会用类似“aqueoigneous”的词来指同时受热水与火山热影响的岩石。"},{"en":"An aqueoigneous environment could involve magma heating groundwater and changing nearby minerals.","zh":"所谓“aqueoigneous”的环境可能包含岩浆加热地下水，从而改变附近矿物的过程。"}]}],"synonyms":["hydrothermal","magmatic-hydrothermal","water-and-magma related"],"phonetic":"/əˌkwiːoʊˈɪɡniəs/","extraExplanation":["这个词在现代英语里几乎不常用，更多像是把 aqueous（含水的）+ igneous（火成的）拼合出来的“混成形容词”。如果你是在读地质/矿物学资料，现代更常见的表达是 hydrothermal（热液的）、magmatic-hydrothermal（岩浆—热液的）或 “influenced by both water and magma”（同时受水与岩浆影响的）。","拼写上也可能是误写：常见词是 aqueous（含水的）和 igneous（火成的）。如果你告诉我它出现的句子或出处，我可以帮你判断作者想表达哪一种。"]}
{"word":"aqueomercurial","summary":{"en":"A rare technical adjective meaning “involving both water (aqueous) and mercury/mercury compounds.”","zh":"一个罕见的技术形容词，表示“同时涉及水（含水/水相）与汞（或汞化合物）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare, technical) Relating to, containing, or produced by both water (an aqueous medium) and mercury or a mercury compound.","zh":"（罕见/技术用语）与水（水相/水溶液）和汞或汞化合物同时有关的；含水并含汞（或汞盐）的。"},"examples":[{"en":"The lab manual warned that an aqueomercurial mixture could release toxic mercury vapor if heated.","zh":"实验手册警告说，加热含水含汞的混合物可能释放有毒的汞蒸气。"},{"en":"In older chemistry notes, “aqueomercurial solutions” referred to aqueous solutions prepared with a mercuric salt.","zh":"在较早的化学笔记里，“aqueomercurial solutions”指用汞盐配制的水溶液。"}]}],"synonyms":["aqueous-mercurial","aqueous mercurial","mercury-containing aqueous"],"phonetic":"ˌækwi.oʊmɚˈkjʊriəl","extraExplanation":["这个词非常少见，多见于较旧或非常专门的化学语境。构词来自拉丁词根：aquo-/aqueo- 表“水”，mercurial 表“汞的/与汞有关的”（也可指“善变的”，但在该复合词里通常取化学意义）。","现代写作中更常用的表达是 aqueous mercurial 或 mercury-containing aqueous（含汞的水溶液/水相体系），以避免生僻复合词造成理解困难。"]}
{"word":"aqueous","summary":{"en":"Aqueous means “containing water” or “water-based,” especially in science; less commonly it can mean “related to living in water.”","zh":"aqueous 常指“含水的/水性的（以水为主要溶剂）”，多用于科学语境；较少情况下也可指“与水生有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing water; water-based, usually describing a solution or environment where water is the main liquid.","zh":"含水的；水性的（通常指以水为主要溶剂的溶液或环境）。"},"examples":[{"en":"Salt dissolves easily in an aqueous solution.","zh":"盐很容易溶解在水溶液中。"},{"en":"Many chemical reactions happen faster in an aqueous environment.","zh":"许多化学反应在水性环境中进行得更快。"},{"en":"The medicine comes in an aqueous form, not an oil-based one.","zh":"这种药是水剂型的，不是油剂型的。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to or living in water; found in water (less common, often replaced by “aquatic”).","zh":"与水有关的；生活在水中的；存在于水中的（较少用，常被 aquatic 取代）。"},"examples":[{"en":"The report describes aqueous organisms in the lake.","zh":"报告描述了湖中的水生生物。"},{"en":"They studied aqueous habitats along the river.","zh":"他们研究了河流沿岸的水生栖息地。"}]}],"synonyms":["water-based","watery","hydrous","(less common) aquatic"],"phonetic":"/ˈeɪkwiəs/","extraExplanation":["“aqueous”常见于科学/医疗英语，尤其搭配：aqueous solution（水溶液）、aqueous phase（水相）、aqueous humor（房水，眼球内的液体）。","与“aquatic”对比：aquatic更常用于“水生的（动植物/运动）”；aqueous更偏“含水、以水为溶剂/介质”。"]}
{"word":"aqueously","summary":{"en":"Aqueously means “in water” or “in an aqueous solution,” used mainly in scientific contexts.","zh":"aqueously 表示“在水中/在水溶液中”，主要用于科学语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that involves water; in water as the main liquid or medium (especially in science).","zh":"以水的方式；在水中、以水作为主要介质（尤用于科学语境）。"},"examples":[{"en":"The drug is more stable when stored aqueously.","zh":"这种药物在水溶液中保存时更稳定。"},{"en":"The reaction occurs aqueously at room temperature.","zh":"该反应在室温下于水相（在水溶液中）进行。"}]}],"synonyms":["in water","in an aqueous solution","in aqueous medium"],"phonetic":"/əˈkwiəsli/","extraExplanation":["“aqueously”主要见于化学、生物、医药等学术或技术写作中，日常英语更常说“in water”或“in an aqueous solution”。","词根来自拉丁语 aqua（“水”）；相关形容词是“aqueous”（水的、水溶液的）。在实验描述里，常用来区分“aqueously（在水相）”与“organically（在有机相）”。"]}
{"word":"aqueousness","summary":{"en":"Aqueousness means the quality of being watery or water-based, especially in scientific or chemical contexts.","zh":"Aqueousness 指“含水性/水状特性”，常用于科学或化学语境，表示物质呈水性或以水为基础的程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of being aqueous; a watery nature or water content.","zh":"含水性；水状特性；（物质）呈水性的状态或程度。"},"examples":[{"en":"The lab measured the aqueousness of the mixture before adding the solvent.","zh":"实验室在加入溶剂之前测量了混合物的含水性。"},{"en":"Because of its aqueousness, the gel spreads easily across the surface.","zh":"由于它很水状，这种凝胶很容易在表面铺开。"}]},{"partOfSpeech":"n.","definition":{"en":"In chemistry, the degree to which something is in, or behaves like, an aqueous (water-based) solution.","zh":"（化学）某物处于水溶液中或表现为水性（以水为基础）的程度。"},"examples":[{"en":"Higher aqueousness often improves the dissolution of certain salts.","zh":"更高的水性通常会提高某些盐的溶解度。"},{"en":"The drug’s performance changes with the aqueousness of its environment.","zh":"这种药物的表现会随环境的水性变化而改变。"}]}],"synonyms":["wateriness","watery quality","water content","hydration (context-dependent)"],"phonetic":"ˈeɪkwiəsnəs","extraExplanation":["“aqueousness”来自形容词“aqueous”（水的；含水的；水溶液的）加名词后缀“-ness”，多见于科研写作，用来描述“水性/含水程度”。日常英语里更常说“water content”（含水量）或“watery quality”（水状特性）。","在化学语境中，“aqueous”常缩写为“(aq)”，表示“水溶液中的”。例如：NaCl(aq) 表示氯化钠的水溶液。"]}
{"word":"aquerne","summary":{"en":"Aquerne is an archaic (mostly Scottish) word meaning “acorn.”","zh":"aquerne 是一个较古老（多见于苏格兰语境）的词，意思是“橡子”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic, chiefly Scottish) an acorn; the nut of an oak tree.","zh":"（古语，主要见于苏格兰英语）橡子；橡树的果实。"},"examples":[{"en":"Squirrels store aquernes for the winter.","zh":"松鼠会把橡子储存起来过冬。"},{"en":"The ground was covered with fallen aquernes beneath the oaks.","zh":"橡树下的地面铺满了掉落的橡子。"}]}],"synonyms":["acorn"],"phonetic":"/əˈkwɝn/","extraExplanation":["“aquerne”是较古老的拼写形式，主要出现在苏格兰及古英语/中古英语语境里；现代英语几乎都用“acorn”。在阅读苏格兰文学、民谣或旧文献时更可能遇到。"]}
{"word":"Aqueus","summary":{"en":"Aqueous means “water-based” or “dissolved in water,” especially in scientific contexts.","zh":"Aqueous 指“含水的/水性的；溶于水的”，常用于科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing water; made with water or dissolved in water (often used in science).","zh":"含水的；水溶的；以水为溶剂的（常用于科学语境）。"},"examples":[{"en":"Salt dissolves easily in an aqueous solution.","zh":"盐很容易溶解在水溶液中。"},{"en":"The medicine is available in aqueous form.","zh":"这种药有水剂（水溶液）形式。"}]}],"synonyms":["water-based","watery"],"phonetic":"/ˈeɪkwiəs/","extraExplanation":["你输入的 “Aqueus” 常见是拼写错误，正确拼写通常是 “aqueous”。","“aqueous” 多用于化学/生物等学科：aqueous solution（水溶液）指“以水为溶剂的溶液”。在化学方程式里常写作 (aq)，表示该物质处于水溶液状态。"]}
{"word":"aquiclude","summary":{"en":"An aquiclude is an underground layer that holds water but blocks its flow, so it usually cannot supply wells.","zh":"aquiclude 指能含水但几乎不透水、阻碍地下水流动的地下隔水层，通常无法供井稳定取水。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A low-permeability underground rock or soil layer that can store groundwater but does not let it flow easily enough to supply a well.","zh":"一种低渗透性的地下岩层或土层，能储存地下水，但水难以流动，通常不足以供井取水。"},"examples":[{"en":"Clay can act as an aquiclude, slowing the movement of groundwater.","zh":"黏土可以作为隔水层，减缓地下水的移动。"},{"en":"The aquifer was trapped between an aquiclude above and a confining layer below.","zh":"含水层被上方的隔水层和下方的隔水层（或隔水地层）夹在中间。"},{"en":"Because of the aquiclude, the well produced very little water.","zh":"由于隔水层的存在，这口井出水量很少。"}]}],"synonyms":["confining layer","impermeable layer","aquitard (related, not identical)"],"phonetic":"/ˈækwiˌkluːd/","extraExplanation":["“aquiclude”主要用于水文地质学。与之相关的常见术语有：aquifer（含水层，能较容易出水）、aquitard（弱透水层，能缓慢透水）、aquiclude（隔水层，几乎不透水但可能含水）、aquifuge（完全不含水也不透水的地层）。不同教材对这些词的界定有时会略有差异。","词源上可拆为拉丁语 aqua（“水”）+ claudere（“关闭、封闭”），意思是“把水封住的（地层）”。"]}
{"word":"aquicolous","summary":{"en":"Aquicolous means “living in water,” a rare, formal term used in biology.","zh":"Aquicolous 指“生活在水中（水生的）”，是生物学中较少见、较正式的用词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) living in or inhabiting water; water-dwelling.","zh":"（生物）生活在水中；水生的。"},"examples":[{"en":"Frogs are amphibians, but their tadpoles are aquicolous.","zh":"青蛙是两栖动物，但它们的蝌蚪是水生的。"},{"en":"The pond supports many aquicolous insects and larvae.","zh":"这个池塘养育了许多水生昆虫及其幼虫。"}]}],"synonyms":["aquatic","water-dwelling","hydrophilic (context-dependent)"],"phonetic":"/ˌæk.wɪˈkoʊ.ləs/","extraExplanation":["“aquicolous”比较少见，多用于生物学/生态学的书面语，意思接近更常见的“aquatic（水生的）”“water-dwelling（栖水的）”。","词源上可理解为 aqua（水）+ -colous（居住于……的），所以字面意思是“居住在水里的”。"]}
{"word":"aquicultural","summary":{"en":"Aquicultural means “related to aquaculture,” the farming of fish, shellfish, or aquatic plants.","zh":"aquicultural 意为“与水产养殖有关的”，指养殖鱼类、贝类或水生植物等。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to aquiculture (aquaculture): the farming of aquatic animals and plants, such as fish, shrimp, oysters, or seaweed.","zh":"与水产养殖有关的：指养殖水生动物和植物（如鱼、虾、牡蛎、海藻等）的活动或领域。"},"examples":[{"en":"The region is developing aquicultural projects to raise oysters and seaweed.","zh":"这个地区正在发展水产养殖项目来养殖牡蛎和海藻。"},{"en":"Aquicultural research focuses on keeping water clean and animals healthy.","zh":"水产养殖研究主要关注保持水质清洁和动物健康。"}]}],"synonyms":["aquacultural","aquaculture-related"],"phonetic":"/ˌɑːkwəˈkʌltʃərəl/","extraExplanation":["“aquicultural”在日常英语中不算常见，更常用的词是“aquaculture”（名词：水产养殖）和“aquaculture industry”（水产养殖业）。","词根提示：aqui- 来自拉丁语 aqua（“水”），-cultural 与 culture（“栽培/养殖/耕作”）相关，所以整体含义就是“水中的养殖/栽培”。"]}
{"word":"aquiculture","summary":{"en":"Aquiculture means aquaculture: raising aquatic plants or animals (like fish, oysters, or seaweed) in controlled water environments.","zh":"aquiculture 指水产养殖（同 aquaculture）：在可控水域中养殖鱼类、贝类或海藻等水生生物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the farming of fish, shellfish, seaweed, or other aquatic organisms in water (such as ponds, rivers, lakes, or the ocean), usually for food or commercial use","zh":"水产养殖；在水体（如池塘、河流、湖泊或海洋）中养殖鱼类、贝类、海藻等水生生物，通常用于食用或商业用途"},"examples":[{"en":"Many coastal communities depend on aquiculture to produce oysters and mussels.","zh":"许多沿海社区依靠水产养殖来生产牡蛎和贻贝。"},{"en":"Aquiculture can reduce pressure on wild fish populations when managed responsibly.","zh":"如果管理得当，水产养殖可以减轻对野生鱼类资源的压力。"},{"en":"The company invested in aquiculture projects like salmon farming and seaweed cultivation.","zh":"这家公司投资了水产养殖项目，比如三文鱼养殖和海藻栽培。"}]}],"synonyms":["aquaculture","fish farming","mariculture"],"phonetic":"/ˈæk.wəˌkʌl.tʃɚ/","extraExplanation":["“aquiculture”在英语里能用，但更常见、更标准的拼写是“aquaculture”。两者意思相同；在正式写作、新闻和学术语境中通常建议用“aquaculture”。","词源上，“aqui- / aqua-”与拉丁语“aqua（水）”有关，“-culture”表示“栽培/养殖”。因此它字面意思就是“在水中进行的养殖”。","常见相关概念：mariculture（海水养殖，水产养殖的一种）；fish farm（鱼场）；shellfish farming（贝类养殖）。讨论水产养殖时也常出现“sustainability（可持续性）”“feed（饲料）”“disease control（疾病防控）”等词。"]}
{"word":"aquiculturist","summary":{"en":"An aquiculturist is someone who raises aquatic animals or plants as part of aquaculture.","zh":"aquiculturist 指从事水产养殖的人，负责养殖水生动物或植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who works in aquaculture—raising fish, shellfish, seaweed, or other aquatic organisms for food, restoration, or research.","zh":"水产养殖从业者；从事水产养殖（养鱼、贝类、海藻等）的人，可用于食品生产、生态修复或科研。"},"examples":[{"en":"The aquiculturist monitors water quality every day to keep the fish healthy.","zh":"水产养殖员每天监测水质，以保证鱼类健康。"},{"en":"An aquiculturist helped the community start a small oyster farm.","zh":"一位水产养殖专家帮助社区建立了一个小型牡蛎养殖场。"},{"en":"Aquiculturists often work with biologists to prevent disease outbreaks.","zh":"水产养殖从业者常与生物学家合作，以预防疾病暴发。"}]}],"synonyms":["aquaculture farmer","fish farmer","shellfish farmer","aquaculture specialist"],"phonetic":"/ˌɑkwəˈkʌltʃərɪst/","extraExplanation":["词源提示：aqui- 来自拉丁语 aqua（“水”），-culture 表示“培育/养殖”，-ist 表示“从事某职业的人”。因此 aquiculturist 字面意思就是“进行水中养殖的人”。","用法区分：aquiculturist 更强调“从业者/技术人员/管理者（人）”；aquaculture 指“产业/活动（养殖本身）”；fish farmer 更口语，但范围常偏“养鱼”，不一定包含海藻或贝类。"]}
{"word":"aquifer","summary":{"en":"An aquifer is an underground layer that stores and transmits groundwater.","zh":"aquifer 指能储存并输送地下水的地下含水层。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A layer of rock, sand, or soil underground that holds and lets water move through it, so people can get groundwater from wells or springs.","zh":"（地下的）含水层；由岩石、沙或土组成，能储存并让水流动，从而提供地下水（可通过井或泉获取）。"},"examples":[{"en":"Many farms rely on an aquifer for irrigation water during dry seasons.","zh":"许多农场在旱季依靠含水层提供灌溉用水。"},{"en":"The city drilled a new well to reach the aquifer beneath the valley.","zh":"这座城市钻了一口新井，以到达山谷下方的含水层。"},{"en":"Pollution can seep down and contaminate an aquifer for decades.","zh":"污染物可能渗入地下，导致含水层在数十年内被污染。"}]}],"synonyms":["groundwater layer","water-bearing layer"],"phonetic":"/ˈækwəfɚ/","extraExplanation":["“aquifer”来自拉丁语：aqua（水）+ ferre（携带/运送），字面意思是“携水的”。","常见搭配：aquifer recharge（含水层补给/回灌）、aquifer depletion（含水层枯竭）、confined aquifer（承压含水层）、unconfined aquifer（潜水含水层）。","与“reservoir（水库）”不同，aquifer 是天然的地下储水层；与“water table（地下水位）”相关：地下水位通常是非承压（潜水）含水层的上表面。"]}
{"word":"aquiferous","summary":{"en":"Aquiferous means “water-bearing” or “containing water,” especially in geological contexts.","zh":"aquiferous 指“含水的/带水的”，尤其用于地质语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing water; carrying or yielding water (often used in geology to describe rocks or layers that hold groundwater).","zh":"含水的；带水的；出水的（常用于地质学，描述含有或能产出地下水的岩层）。"},"examples":[{"en":"The well was drilled into an aquiferous layer of sandstone.","zh":"这口井钻入了一层含水的砂岩层。"},{"en":"Engineers tested the aquiferous rocks before building the tunnel.","zh":"工程师在修建隧道前检测了含水岩层。"}]}],"synonyms":["water-bearing","groundwater-bearing","water-rich"],"phonetic":"/əˈkwɪfɚəs/","extraExplanation":["词源：来自拉丁语 aqua（“水”）+ -ferous（“携带、产生”），同类构词还有 carboniferous（含碳的/产煤的）、odoriferous（有气味的）。","用法提示：它属于较正式、偏专业的词，日常英语更常说 water-bearing（含水的）或 groundwater-bearing（含地下水的）。"]}
{"word":"aquifers","summary":{"en":"Aquifers are underground layers that store and carry groundwater, supplying wells and springs.","zh":"Aquifers（含水层）是地下储存并输送地下水的地层，为水井和泉水提供水源。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An underground layer of rock, sand, or gravel that holds water and lets it flow through, often used as a source of well water.","zh":"含水层：地下由岩石、沙或砾石组成、能储存并让地下水流动的地层，常用作井水来源。"},"examples":[{"en":"Many farms pump water from aquifers during dry seasons.","zh":"许多农场在旱季从含水层抽取地下水。"},{"en":"If an aquifer is overused, wells can run dry.","zh":"如果含水层被过度使用，水井可能会干涸。"}]}],"synonyms":["groundwater reservoir","water-bearing layer"],"phonetic":"/ˈækwəfɚz/","extraExplanation":["“Aquifer”由拉丁语词根组成：aqua（“水”）+ fer（“携带/承载”），字面意思是“承载水的地层”。","含水层主要分为两类：非承压含水层（靠近地表、较易被污染）和承压含水层（上方有隔水层覆盖、压力更大，打井后水位可能上升）。","在环境与公共政策语境中常见相关搭配：groundwater（地下水）、recharge（补给/回灌）、contamination/pollution（污染）、overpumping（过度抽水）、water table（地下水位）。"]}
{"word":"Aquifoliaceae","summary":{"en":"Aquifoliaceae is the holly family, a plant family that includes hollies (Ilex) and related shrubs and trees.","zh":"Aquifoliaceae 指冬青科，是包含冬青属（Ilex）等灌木和乔木的一类植物科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant family (the holly family) that includes hollies (Ilex) and related evergreen or deciduous shrubs and trees, often with glossy, spiny-edged leaves and red berries","zh":"冬青科；一个植物科（又称“冬青科/冬青属所在的科”），包含冬青属（Ilex）等植物，常见为常绿或落叶的灌木或乔木，叶片常有光泽、边缘可能带刺，果实常为红色浆果（植物学分类用语）"},"examples":[{"en":"Holly trees belong to the family Aquifoliaceae.","zh":"冬青树属于冬青科（Aquifoliaceae）。"},{"en":"In the field guide, Aquifoliaceae is listed under flowering plants.","zh":"在野外植物图鉴里，Aquifoliaceae（冬青科）被列在被子植物（开花植物）之下。"}]}],"synonyms":["holly family"],"phonetic":"ˌæk.wɪˌfoʊ.liˈeɪ.si.iː","extraExplanation":["词源提示：Aquifoliaceae 来自拉丁语 aquifolium（冬青），可拆为 acui-（“尖的、锋利的”，指叶缘的刺）+ folium（“叶子”）。","使用场景：这是植物分类学中的“科名”，常见于学术文章、植物志、标本标签、园艺或自然教育材料中；日常英语里更常说 holly family（冬青科/冬青类植物）。","注意：很多 Aquifoliaceae 的植物果实（“berries”）对鸟类有食用价值，但对人或宠物可能有毒性或刺激性；讨论食用/药用时应谨慎并参考可靠来源。"]}
{"word":"aquifoliaceae","summary":{"en":"Aquifoliaceae is the botanical family of hollies and their relatives.","zh":"Aquifoliaceae 指“冬青科”，是冬青及其近缘植物的植物学科名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant family that includes hollies (genus Ilex) and related evergreen shrubs or small trees, often with glossy, sometimes spiny leaves and red berries.","zh":"冬青科：一类植物科，包含冬青属（Ilex）及其近缘的常绿灌木或小乔木，常见特征有有光泽、（有时）带刺的叶片与红色浆果。"},"examples":[{"en":"Holly plants belong to the family Aquifoliaceae.","zh":"冬青植物属于冬青科（Aquifoliaceae）。"},{"en":"In this forest survey, several Aquifoliaceae species were recorded along the riverbanks.","zh":"在这次森林调查中，河岸附近记录到了几种冬青科植物。"}]}],"synonyms":["the holly family","holly family"],"phonetic":"/ˌæk.wə.foʊˌliˈeɪ.si.iː/","extraExplanation":["“Aquifoliaceae”来自拉丁语词根：aquifolium（意为“带刺的叶/冬青叶”），常用作植物分类学（科名）术语。","在英文里它多出现在植物学、园艺学、生态调查等语境中；日常交流更常说“the holly family（冬青科）”或直接说“holly（冬青）”。"]}
{"word":"aquifoliaceous","summary":{"en":"Aquifoliaceous describes plants with holly-like leaves, often shiny and spiny-edged.","zh":"Aquifoliaceous 指“冬青状的叶子”，常带光泽、叶缘具刺或锯齿。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having leaves like those of holly, often glossy with sharp or spiny edges.","zh":"（植物）叶子像冬青的；常指叶面有光泽、叶缘有刺或锯齿的。"},"examples":[{"en":"The shrub has aquifoliaceous leaves, so it looks a bit like holly from a distance.","zh":"这种灌木的叶子呈冬青状，所以远看有点像冬青。"},{"en":"Some plants develop aquifoliaceous foliage to discourage animals from eating them.","zh":"有些植物会长出冬青状的叶子，用来防止动物啃食。"}]}],"synonyms":["holly-like","spiny-leaved","spinose (botanical)"],"phonetic":"/ˌæk.wɪ.foʊˈleɪ.ʃəs/","extraExplanation":["这是一个较少见的植物学形容词，多用于学术写作或植物描述。词根来自拉丁语：aqui-（指冬青，Ilex aquifolium）+ -foli-（叶）+ -aceous（“……状的/具有……性质的”）。","注意它描述的是“叶形/叶缘的特征”，不等于“属于冬青科（Aquifoliaceae）”。前者是形态学描述，后者是分类学归属。"]}
{"word":"aquiform","summary":{"en":"Aquiform means “eagle-shaped” or “eagle-like.”","zh":"Aquiform 指“鹰形的”或“像鹰的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having the form of an eagle; eagle-shaped or eagle-like (often used to describe a nose or a design).","zh":"鹰形的；像鹰的（常用于形容鼻子或图案设计）。"},"examples":[{"en":"She had an aquiform nose that gave her face a strong profile.","zh":"她有一个鹰钩鼻，让她的侧脸轮廓很硬朗。"},{"en":"The statue’s aquiform wings were carved in sharp, clean lines.","zh":"雕像的鹰形翅膀用锐利、干净的线条刻出。"}]}],"synonyms":["aquiline","eagle-like","raptorial"],"phonetic":"/ˈækwɪˌfɔrm/","extraExplanation":["词源上可理解为“aqui-（拉丁语 aquila，鹰）+ -form（形状）”。虽然形式上像和 aqua（水）有关，但 aquiform 在此通常指“鹰的形状”，不是“水生形状”。","这个词很少见，实际写作中更常用 aquiline（鹰的，尤指鹰钩鼻）或 eagle-like。","可用于纹章学（家族徽章图案）、艺术描述或较文学化的外貌描写；在日常英语里不算常用词。"]}
{"word":"aquifuge","summary":{"en":"Aquifuge means a water-repellent coating or treatment, or describes something that repels liquid water.","zh":"Aquifuge 指防水/拒水处理剂（涂层），也可形容“拒水的、防水的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance (often a chemical coating) applied to materials like stone, brick, or concrete to make them repel liquid water","zh":"（常指化学涂层/处理剂）涂在石材、砖或混凝土等表面，使其防水、拒水的材料"},"examples":[{"en":"The contractor applied an aquifuge to the brick wall to reduce rainwater absorption.","zh":"承包商在砖墙上涂了防水剂，以减少雨水渗入。"},{"en":"We chose an aquifuge treatment for the stone façade to prevent staining.","zh":"我们为石材立面选择了拒水处理，以防止出现水渍和污渍。"}]},{"partOfSpeech":"adj.","definition":{"en":"water-repellent; able to keep liquid water from soaking in","zh":"拒水的；防水的（能阻止液态水渗透）"},"examples":[{"en":"After the treatment, the surface became aquifuge and dried more quickly after storms.","zh":"处理后，表面变得拒水，暴风雨后也干得更快。"},{"en":"Aquifuge coatings are common in building conservation.","zh":"拒水涂层在建筑保护中很常见。"}]}],"synonyms":["water repellent","waterproofing agent","sealant","hydrophobic coating"],"phonetic":"ˈækwəˌfjuːdʒ","extraExplanation":["词源上可拆为拉丁语 aqua（“水”）+ fugere（“逃离/躲开”），字面意思就是“让水跑开”。在建筑语境中，它通常指“让液态水不易进入材料孔隙”的处理，但不一定等同于完全密封；有些产品强调在拒水的同时仍允许水汽透出，因此具体效果要看产品说明。"]}
{"word":"Aquila","summary":{"en":"Aquila most commonly refers to the constellation “the Eagle,” and it can also mean “eagle” in Latin or refer to a biblical person named Aquila.","zh":"Aquila最常指星座“天鹰座”，也可指拉丁语中的“鹰”，或《新约》中名为亚居拉的人物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A constellation in the night sky; its name means “the Eagle.”","zh":"（天文学）天鹰座；其名意为“鹰”。"},"examples":[{"en":"Aquila is easiest to spot in summer, near the bright star Altair.","zh":"天鹰座在夏季较容易辨认，靠近亮星牛郎星（Altair）。"},{"en":"In many sky maps, Aquila appears as an eagle flying along the Milky Way.","zh":"在许多星图中，天鹰座像一只沿着银河飞行的鹰。"}]},{"partOfSpeech":"n.","definition":{"en":"A Latin word meaning “eagle,” used in names, symbols, and mottos.","zh":"（拉丁语）“鹰”；常用于姓名、标志或格言等。"},"examples":[{"en":"The name “Aquila” comes from Latin for “eagle.”","zh":"“Aquila”这个名字来自拉丁语，意思是“鹰”。"},{"en":"Some sports teams choose Aquila as a name to suggest strength and sharp vision.","zh":"一些运动队会用“Aquila”作名称，以表达力量与敏锐的象征意义。"}]},{"partOfSpeech":"n.","definition":{"en":"In the Bible (New Testament), a man named Aquila who, with his wife Priscilla, helped early Christian communities.","zh":"（《圣经·新约》）亚居拉（Aquila），与妻子百基拉（Priscilla）一同帮助早期基督徒群体的人物。"},"examples":[{"en":"In the New Testament, Aquila and Priscilla are mentioned as close co-workers of Paul.","zh":"在《新约》中，亚居拉和百基拉被提到是保罗的亲密同工。"}]}],"synonyms":["the Eagle","Aquila (constellation)","eagle"],"phonetic":"ˈækwɪlə","extraExplanation":["“Aquila”在英语里通常作为专有名词使用（星座名、人名），书写时首字母大写。","天鹰座的最亮恒星是Altair（牛郎星），与Vega（织女星）和Deneb共同构成著名的“夏季大三角”。","在罗马文化中，鹰（aquila）也与权力与军团象征有关，因此这个词常带有“威严、力量”的文化联想。"]}
{"word":"aquila","summary":{"en":"Aquila usually refers to the constellation “the Eagle,” and it is also the Latin word for “eagle.”","zh":"Aquila 通常指“天鹰座”，也可指拉丁语中的“鹰”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A constellation (star pattern) in the northern sky, known as “the Eagle.”","zh":"天鹰座（北天的一个星座，意为“鹰”）。"},"examples":[{"en":"Altair is the brightest star in Aquila.","zh":"牛郎星（Altair）是天鹰座中最亮的恒星。"},{"en":"In summer, you can often spot Aquila near Cygnus and Lyra.","zh":"夏季常常可以在天鹅座和天琴座附近看到天鹰座。"}]},{"partOfSpeech":"n.","definition":{"en":"The Latin word for “eagle,” sometimes used in poetic, historical, or scholarly contexts.","zh":"拉丁语中的“鹰”，有时用于诗歌、历史或学术语境。"},"examples":[{"en":"In Latin, aquila means “eagle.”","zh":"在拉丁语中，aquila 的意思是“鹰”。"},{"en":"Roman legions marched under the aquila as a powerful symbol.","zh":"罗马军团在“鹰旗（aquila）”这一强大象征下行军。"}]},{"partOfSpeech":"other","definition":{"en":"A given name or place name (a proper noun) used in various cultures and regions.","zh":"人名或地名（专有名词），在不同文化与地区中使用。"},"examples":[{"en":"Aquila is used as a personal name in some countries.","zh":"Aquila 在一些国家被用作人名。"}]}],"synonyms":["the Eagle (constellation)","Aquila (Latin: eagle)"],"phonetic":"/əˈkwɪlə/","extraExplanation":["“Aquila”来自拉丁语“鹰”。在罗马文化中，“aquila”也指军团的鹰旗（军旗），象征权力与荣誉，因此在历史写作中常见。","天鹰座最著名的恒星是 Altair（牛郎星），它与天琴座的 Vega（织女星）和天鹅座的 Deneb 组成“夏季大三角（Summer Triangle）”，在英文天文科普与文学描写里都很常见。"]}
{"word":"Aquilae","summary":{"en":"Aquilae is the Latin “of Aquila,” used in star names (e.g., Alpha Aquilae).","zh":"Aquilae 是拉丁语“属于天鹰座（Aquila）的”，常见于恒星名称（如 Alpha Aquilae）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A Latin form meaning “of Aquila,” used mainly in astronomy in star names to indicate a star belongs to the constellation Aquila (the Eagle).","zh":"拉丁语形式，意为“天鹰座（Aquila）的……/属于天鹰座的……”。主要用于天文学中的恒星命名，表示某颗星位于天鹰座。"},"examples":[{"en":"Altair is also called Alpha Aquilae, meaning the brightest star in the constellation Aquila.","zh":"牛郎星也叫 Alpha Aquilae，意思是天鹰座中最亮的恒星。"},{"en":"Astronomy catalogs often use Latin genitives like Aquilae to label stars by constellation.","zh":"天文学目录常用像 Aquilae 这样的拉丁语属格来按星座给恒星命名。"}]}],"synonyms":["of Aquila (meaning equivalent in English)"],"phonetic":"/əˈkwɪliˌaɪ/","extraExplanation":["在“拜耳命名法（Bayer designation）”里，恒星常写作“希腊字母 + 星座拉丁名的属格”。例如 Alpha Aquilae = 天鹰座α。这里的 Aquilae 就是 Aquila（天鹰座）的拉丁语属格，相当于英文的 “of Aquila / in Aquila”。"]}
{"word":"Aquilaria","summary":{"en":"Aquilaria is the plant genus of trees that can produce agarwood, a fragrant resinous wood used for incense and perfume.","zh":"Aquilaria 指沉香属，是能产沉香（芳香树脂木材）的树木属名，常用于制香与香水。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical trees (family Thymelaeaceae), some species of which can produce agarwood (a fragrant resinous wood) used in incense and perfume.","zh":"沉香属（瑞香科）的一类热带树木属名；其中一些物种会形成沉香（含香脂的木材），用于制香与香水。"},"examples":[{"en":"Aquilaria malaccensis is one of the best-known sources of agarwood.","zh":"Aquilaria malaccensis（马来沉香树）是最知名的沉香来源之一。"},{"en":"The fragrance industry values resin that forms in wounded Aquilaria trees.","zh":"香精香料行业重视受伤的沉香属树木形成的树脂。"}]}],"synonyms":["agarwood tree (common name)","eaglewood tree (common name)"],"phonetic":"/ˌæk.wɪˈlɛər.i.ə/","extraExplanation":["“Aquilaria”常见于与“agarwood（沉香）”相关的语境：当树木受伤或感染后，会产生芳香树脂并在木质部沉积，形成沉香。并非所有沉香属树都会产出沉香，也不是所有个体都会结香。","部分沉香属物种因过度采伐而受到保护；在国际贸易中常涉及CITES（濒危野生动植物种国际贸易公约）管制，因此在购买或进口相关产品时可能需要合规文件。","读到“Aquilaria”时通常指植物学的属名；日常英语里更常说“agarwood tree（沉香树）”或直接说“agarwood（沉香）”。"]}
{"word":"aquilaria","summary":{"en":"Aquilaria is a genus of tropical trees known for producing agarwood, a valuable fragrant resinous wood.","zh":"Aquilaria 指沉香属热带树木，以能形成珍贵芳香的沉香（伽罗木）而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical trees (in the laurel family) whose resinous wood can form agarwood, a fragrant material used for incense and perfume.","zh":"沉香属（樟科的一属热带树木）；其受伤或感染后可能形成含树脂的香木，即“沉香/伽罗木”，常用于熏香与香水。"},"examples":[{"en":"Aquilaria trees are famous because some of them can produce agarwood.","zh":"沉香属的树很有名，因为其中一些会形成沉香。"},{"en":"Perfume makers value the scent that comes from agarwood formed in Aquilaria wood.","zh":"制香师很看重沉香属木材形成的沉香所带来的香气。"}]}],"synonyms":["agarwood tree (informal)","aloe wood (trade term for agarwood)"],"phonetic":"ˌɑkwɪˈlɛriə","extraExplanation":["“Aquilaria”在日常英语里多见于植物学、香料与贸易语境。沉香（agarwood）通常不是每棵树都会形成，而是在树木受伤、虫害或真菌感染等情况下，树体产生树脂并逐渐沉积而成。","由于沉香具有较高经济价值，部分沉香属物种曾面临过度采伐压力；在国际贸易中常涉及濒危物种保护与管制（如CITES相关规定）。"]}
{"word":"aquilawood","summary":{"en":"Aquilawood is fragrant resinous agarwood used for incense and perfume.","zh":"Aquilawood 指芳香含树脂的沉香木，用于熏香与香水等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a dark, fragrant resinous wood (agarwood) from Aquilaria trees, used to make incense, perfume, and traditional medicines.","zh":"沉香木（又称伽罗木、沉香），来自瑞香科沉香属（Aquilaria）树木的含树脂芳香木材，用于制作香、香水和传统药材。"},"examples":[{"en":"Aquilawood is often burned as incense in religious ceremonies.","zh":"沉香木常在宗教仪式中作为熏香燃烧。"},{"en":"Some luxury perfumes use aquilawood for its deep, warm scent.","zh":"一些高端香水会用沉香木来营造深沉温暖的香气。"},{"en":"Because high-quality aquilawood is rare, it can be very expensive.","zh":"由于高品质沉香木稀少，它可能非常昂贵。"}]}],"synonyms":["agarwood","aloeswood","oud"],"phonetic":"/ˈɑː.kwɪ.ləˌwʊd/","extraExplanation":["“Aquilawood”在英语里较正式、偏商品/学术用法；日常更常见的词是“agarwood”，在香水领域也常见“oud/oudh”（乌木香/沉香香调）。","沉香的香气通常来自树木受伤或感染后产生的树脂（并非所有木头天然都有浓香），因此“有香的沉香”更稀少。","由于过度采伐与贸易影响，部分沉香属物种受保护（如受《濒危野生动植物种国际贸易公约》CITES 管制）。购买时常会看到“可持续来源/合法来源”等说明。"]}
{"word":"aquilege","summary":{"en":"Aquilegia is a garden flower also called columbine, famous for its spurred petals.","zh":"Aquilegia 指耧斗菜（columbine），以带“距”的独特花瓣著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flowering plant (genus Aquilegia), commonly called columbine, known for its distinctive spurred petals; often grown in gardens","zh":"耧斗菜属的开花植物（Aquilegia），英文常称 columbine（耧斗菜）；花瓣常有“距”（向后伸出的细长突起），常见于园艺栽培"},"examples":[{"en":"Aquilegia blooms in late spring in many temperate gardens.","zh":"在许多温带花园里，耧斗菜通常在晚春开花。"},{"en":"The gardener planted aquilegia near the fence for its delicate, nodding flowers.","zh":"园丁把耧斗菜种在篱笆旁，因为它的花朵精致、常微微下垂。"},{"en":"Columbine (aquilegia) can attract hummingbirds where they are native.","zh":"在其原生地区，耧斗菜（aquilegia）可能会吸引蜂鸟。"}]}],"synonyms":["columbine","granny's bonnet"],"phonetic":"/ˌæk.wəˈliː.dʒə/","extraExplanation":["“aquilege”常被当作拼写误差；更常见、标准的词形是 **aquilegia**（耧斗菜属），日常也常用俗名 **columbine**。","词源来自拉丁语 *aquila*（“鹰”），据说与花的“距”或整体形状让人联想到鹰的爪/喙有关。"]}
{"word":"Aquilegia","summary":{"en":"Aquilegia is the scientific name for columbines, popular garden flowers with distinctive spurred petals.","zh":"Aquilegia 是耧斗菜属的学名，常指园艺中常见、花瓣带“距”的观赏花卉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants (columbines) with distinctive, often spurred petals; also used to refer to these plants in gardens.","zh":"耧斗菜属（也常泛指“耧斗菜/鸽子花”这类花卉），一种花瓣常带“距”（向后伸出的管状突起）、外形独特的观赏开花植物。"},"examples":[{"en":"Aquilegia blooms in late spring and comes in many colors.","zh":"耧斗菜通常在晚春开花，颜色也有很多种。"},{"en":"The gardener planted Aquilegia near the path for a cottage-garden look.","zh":"园丁把耧斗菜种在小路旁，营造出乡村花园的感觉。"},{"en":"Some Aquilegia species are grown for their elegant, spurred flowers.","zh":"有些耧斗菜品种因其优雅、带距的花朵而被栽培。"}]}],"synonyms":["columbine","granny’s bonnet"],"phonetic":"/ˌæk.wɪˈliː.dʒə/","extraExplanation":["词源来自拉丁语 aquila（“鹰”）：传统解释认为花瓣/花距的形状让人联想到鹰爪或鹰的姿态。","园艺语境里，Aquilegia 常与 common name “columbine（耧斗菜）”互用；不过 columbine 更常见、也更口语。","注意：部分耧斗菜含有有毒成分，尤其不要随意食用；家有宠物或小孩时种植要留意安全。"]}
{"word":"aquilegia","summary":{"en":"Aquilegia is a columbine plant (or its flower), known for spurred blooms and often grown in gardens.","zh":"Aquilegia 指耧斗菜（或其花），以带距花形著称，常作园艺观赏植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant in the genus *Aquilegia* (also called **columbine**), grown for its distinctive, often spurred flowers; the flower of this plant.","zh":"耧斗菜属（*Aquilegia*）植物（也叫**耧斗菜/鸽子花 columbine**），以带距（像小角/小管状突起）的花朵著称；也可指这种花。"},"examples":[{"en":"Aquilegia blooms in late spring and attracts bees and hummingbirds.","zh":"耧斗菜通常在晚春开花，会吸引蜜蜂和蜂鸟。"},{"en":"She planted aquilegia along the shady edge of the garden.","zh":"她把耧斗菜种在花园里阴凉的边缘地带。"}]}],"synonyms":["columbine"],"phonetic":"/ˌæk.wɪˈliː.dʒə/","extraExplanation":["“Aquilegia”是学名，日常英语里更常说“columbine”。","词源常被解释为拉丁语 *aquila*（“鹰”）：花瓣后方的“距”形状像鹰爪/鹰喙。","不少耧斗菜品种含有一定毒性，园艺上常提醒不要食用，并注意儿童或宠物误食风险。"]}
{"word":"Aquileia","summary":{"en":"Aquileia is an ancient Roman city (now a town) in northeastern Italy, famous for its ruins and early Christian mosaics.","zh":"Aquileia（阿奎萊亞）是意大利東北部的古羅馬城市（現為小鎮），以遺址與早期基督教馬賽克聞名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient Roman city (and today a small town) in northeastern Italy, near the Adriatic Sea, historically important as a major trading and military center.","zh":"阿奎萊亞（Aquileia）：意大利東北部靠近亞得里亞海的一座古羅馬城市（現為小鎮），歷史上是重要的貿易與軍事重鎮。"},"examples":[{"en":"Aquileia was one of the Roman Empire’s key cities in the northeast of Italy.","zh":"阿奎萊亞曾是羅馬帝國在意大利東北部的重要城市之一。"},{"en":"Many visitors come to Aquileia to see the ancient ruins and mosaics.","zh":"許多遊客到阿奎萊亞參觀古代遺址與馬賽克。"}]}],"synonyms":["(no direct synonyms; proper place name)"],"phonetic":"/ˌɑːk.wəˈleɪ.ə/","extraExplanation":["Aquileia 建於公元前181年，位於戰略要地，曾是通往巴爾幹與中歐的門戶，繁榮時期是北意大利重要港口與商業中心之一。","此地以考古遺址聞名，特別是阿奎萊亞大教堂（Basilica of Aquileia）的早期基督教馬賽克地坪；整體遺址於1998年列入聯合國教科文組織世界遺產。","英文中它通常作為專有名詞使用，常見於歷史、考古、藝術史或羅馬帝國相關閱讀中。"]}
{"word":"aquilia","summary":{"en":"Aquilia is mainly a Latin/Roman proper name, especially known from Roman family names and from the legal term “Lex Aquilia.”","zh":"Aquilia 主要是拉丁/罗马的专名，常见于罗马氏族名，也常因法律术语“Lex Aquilia（阿奎利亚法）”而被提及。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper noun) An ancient Roman family name (gens Aquilia). It is also seen in Roman history and inscriptions.","zh":"（专有名词）古罗马的一个氏族/家族名（Aquilia 氏族）。在罗马史料与铭文中可见。"},"examples":[{"en":"The gens Aquilia appears in records from the Roman Republic.","zh":"Aquilia 氏族出现在罗马共和国时期的一些记载中。"},{"en":"In some inscriptions, “Aquilia” is used as part of a Roman person’s name.","zh":"在一些铭文里，“Aquilia”会作为罗马人姓名的一部分出现。"}]},{"partOfSpeech":"other","definition":{"en":"(Proper noun, law) In the phrase “Lex Aquilia,” the name linked to a famous Roman law about wrongful damage to property.","zh":"（专有名词，法律）在“Lex Aquilia（阿奎利亚法）”中出现的名字；该法以“财产被不法损害”的赔偿责任著称。"},"examples":[{"en":"Lex Aquilia influenced later legal thinking about compensation for damage.","zh":"《阿奎利亚法》影响了后世关于损害赔偿的法律思想。"},{"en":"Some textbooks mention Aquilia when explaining Roman delict law.","zh":"有些教材在讲罗马侵权法时会提到 Aquilia。"}]}],"synonyms":["Lex Aquilia (related term)"],"phonetic":"/əˈkwɪliə/","extraExplanation":["“Aquilia”常被当作拉丁来源的专名来用，不是现代英语里常见的普通词汇；在日常英语交流中更常见的是相关形式“Lex Aquilia”。","拼写提醒：很多人会把“Aquilia”与“Aquila”（拉丁语“鹰”，也指天鹰座）混淆；两者拼写相近，但指代不同。"]}
{"word":"Aquilian","summary":{"en":"Aquilian is a rare adjective meaning “related to Aquila (the eagle/constellation)” and is sometimes used (often mistakenly) for “eagle-like,” a sense usually written as aquiline.","zh":"Aquilian 是一个较少见的形容词，主要指“与 Aquila（拉丁语‘鹰’/天鹰座）有关”；有时也被用来表示“像鹰的（尤指鹰钩鼻）”，但这一含义通常写作 aquiline。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or associated with Aquila (a constellation), or something named Aquila (Latin for “eagle”).","zh":"与“天鹰座（Aquila）”有关的；或与名为 Aquila（拉丁语“鹰”）的事物相关的。"},"examples":[{"en":"In Aquilian mythology, the eagle is a powerful symbol.","zh":"在与天鹰座相关的神话意象中，鹰是一个强有力的象征。"},{"en":"The Aquilian stars are easiest to spot in summer skies.","zh":"天鹰座的星星在夏季夜空中更容易辨认。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare; often confused with “aquiline”) Describing an eagle-like look, especially a curved, prominent nose.","zh":"（罕见；常与 aquiline 混用）形容像鹰一样的外观，尤指鹰钩鼻、鼻梁高而略弯。"},"examples":[{"en":"He was described as having an Aquilian profile in the old report.","zh":"旧报告里形容他有“鹰一样的侧脸轮廓”。"},{"en":"Many writers use “aquiline” instead of “Aquilian” for this meaning.","zh":"许多作者在这个意思上会用 aquiline，而不是 Aquilian。"}]}],"synonyms":["Aquila-related","eagle-like (usually: aquiline)"],"phonetic":"/əˈkwɪliən/","extraExplanation":["“Aquilian”在现代英语里非常少见。你更常见到的是 **aquiline**（/ˈækwəˌlaɪn/），意思是“像鹰的，尤指鹰钩鼻”。如果你的语境是形容鼻子或面部轮廓，通常应写 **aquiline**。","Aquila 是拉丁语“鹰”，也是天鹰座的名称；因此在天文学或命名来源说明中，Aquilian 可能被用作“与天鹰座/鹰相关”。"]}
{"word":"aquilian","summary":{"en":"Aquilian is a rare adjective meaning “eagle-like” or “related to Aquila (the eagle/constellation).”","zh":"Aquilian 是较少见的形容词，意为“像鹰的”，或“与 Aquila（鹰/天鹰座）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an eagle; eagle-like (a rare/variant form, often seen in older or specialized writing).","zh":"与鹰有关的；像鹰的（较少见/变体形式，多见于较旧或专门的写作中）。"},"examples":[{"en":"In the poem, an aquilian shadow circles the cliffs above the sea.","zh":"在这首诗里，一道鹰般的影子在海边的悬崖上空盘旋。"},{"en":"The statue gives the hero an aquilian presence—sharp, watchful, and proud.","zh":"这座雕像让英雄呈现出一种鹰一般的气质——锐利、警觉而骄傲。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to Aquila (a Latin name meaning “eagle”), especially the constellation Aquila.","zh":"与“Aquila”（拉丁语意为“鹰”）有关的，尤指天鹰座。"},"examples":[{"en":"On clear summer nights, Aquila is easy to spot near the Milky Way.","zh":"在晴朗的夏夜，天鹰座在银河附近很容易找到。"},{"en":"The guidebook mentions aquilian stars as markers for navigation.","zh":"这本指南提到以“天鹰座的星”作为辨认方向的标记。"}]}],"synonyms":["eagle-like","aquiline (more common)","Aquila-related"],"phonetic":"/əˈkwɪliən/","extraExplanation":["“aquilian”比较少见；现代英语里更常用的是 **aquiline**（尤其用来形容“鹰钩鼻/鼻梁高而弯”的特征，如 *an aquiline nose*）。如果你是在描述人的鼻子或面部线条，通常应优先用 **aquiline**。","词根来自拉丁语 *aquila*（鹰）。在天文学语境中，Aquila 是“天鹰座”的拉丁名，因此 “aquilian” 也可能用于指与该星座相关的事物，但这种用法也不算常见。"]}
{"word":"Aquilid","summary":{"en":"Aquilid refers to a meteor (or meteor shower) linked to the constellation Aquila, or anything related to it.","zh":"Aquilid 指与天鹰座（Aquila）有关的流星（或流星雨），也可作形容词表示“与天鹰座流星相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Astronomy) A meteor (or meteor shower) that appears to come from the direction of the constellation Aquila (the Eagle).","zh":"（天文学）“天鹰座流星”（或“天鹰座流星雨”）；指看起来从天鹰座（Aquila，意为“鹰”）方向射出的流星（群）。"},"examples":[{"en":"The Aquilids are a minor meteor shower that can be seen in summer skies.","zh":"天鹰座流星雨属于较小型的流星雨，有时在夏季夜空中可见。"},{"en":"Astronomers tracked several Aquilids entering the atmosphere overnight.","zh":"天文学家追踪到夜间有数颗天鹰座流星进入大气层。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to Aquila or the Aquilids.","zh":"与天鹰座（Aquila）或天鹰座流星（Aquilids）有关的。"},"examples":[{"en":"The Aquilid radiant lies near the constellation Aquila.","zh":"天鹰座流星雨的辐射点位于天鹰座附近。"},{"en":"They planned an Aquilid viewing night for the astronomy club.","zh":"他们为天文社团安排了一个观测天鹰座流星的夜晚。"}]}],"synonyms":["Aquilids (plural)","Aquila (constellation name)"],"phonetic":"/ˈækwɪlɪd/","extraExplanation":["“Aquilid”来自拉丁语词根 aquila（鹰），Aquila 是“天鹰座”的拉丁名。流星雨名称常用“-id(s)”结尾（如 Perseids 英仙座流星雨），表示“与某个辐射点/星座相关的一群流星”。","使用上常见复数 Aquilids（指“流星群/流星雨”），单数 Aquilid 可指“一颗该流星群的流星”或作形容词。"]}
{"word":"aquilid","summary":{"en":"An Aquilid is a meteor from a shower whose radiant is in or near the constellation Aquila.","zh":"Aquilid 指来自辐射点位于（或接近）天鹰座的流星（常见复数 Aquilids 指该流星雨）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a meteor belonging to a meteor shower whose radiant point is in (or near) the constellation Aquila","zh":"（天文学）天鹰座流星：指辐射点位于（或接近）天鹰座（Aquila）的某个流星雨中的流星"},"examples":[{"en":"During the Aquilids, you may see a few Aquilids streaking away from the area of Aquila.","zh":"在天鹰座流星雨期间，你可能会看到几颗天鹰座流星从天鹰座附近的天空区域向外划过。"},{"en":"An Aquilid is identified by tracing its path back toward the Aquila radiant.","zh":"辨认一颗天鹰座流星，通常要把它的轨迹反向延长，看看是否指向天鹰座的辐射点。"}]}],"synonyms":["Aquilid meteor","Aquila meteor (rare)"],"phonetic":"/ˈækwɪlɪd/","extraExplanation":["“Aquilid”来自拉丁语 aquila（“鹰”），Aquila 是“天鹰座”的拉丁名；后缀 -id 常用于流星雨命名，表示“来自某辐射点（常以星座命名）的流星”。","日常表达中更常见的是复数形式 Aquilids，指“天鹰座流星雨/天鹰座流星群”。天文学资料里有时会细分为 June Aquilids、July Aquilids 等不同日期附近的弱流星雨。"]}
{"word":"aquiline","summary":{"en":"Aquiline means “eagle-like,” especially describing a curved, hooked nose.","zh":"Aquiline 表示“像鹰的”，最常用来形容弯曲、钩状的“鹰钩鼻”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like an eagle; most commonly describing a nose that is curved or hooked in a proud, sharp way.","zh":"鹰一般的；最常指“鹰钩鼻”，鼻梁突出、略弯曲/钩状，给人一种挺拔、锐利的感觉。"},"examples":[{"en":"He was described as tall and aquiline, with a sharply curved nose.","zh":"他被描写得高挑而有鹰般的轮廓，鼻子明显弯曲。"},{"en":"The portrait emphasizes her aquiline profile and strong jawline.","zh":"这幅肖像突出她的鹰钩侧脸轮廓和有力的下颌线。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to or resembling eagles (less common in everyday use).","zh":"与鹰有关的；像鹰的（较少用于日常口语）。"},"examples":[{"en":"The sculpture shows an aquiline creature with wide wings.","zh":"这座雕塑展现了一个鹰状生物，翅膀张开。"}]}],"synonyms":["hooked","eagle-nosed","beaked","curved"],"phonetic":"/ˈæk.wəˌlaɪn/","extraExplanation":["“aquiline”来自拉丁语 aquila（“鹰”）。英语里它常用于人物外貌描写，尤其是文学或较正式的语境：aquiline nose / aquiline profile。","语气通常是中性到带一点“威严、贵族气质”的联想，但在不同文化和语境中也可能被理解为单纯的外貌特征描述；写作时可根据场景搭配更明确的褒贬词（如 striking, elegant, severe）。"]}
{"word":"aquilinity","summary":{"en":"Aquilinity means the quality of being eagle-like in shape, especially having a hooked or curved nose.","zh":"Aquilinity 指“鹰状”的外形特征，尤指鼻子等呈钩状、弯曲的轮廓。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being aquiline (eagle-like), especially having a curved, hooked shape such as an “aquiline nose.”","zh":"鹰状特征；（尤指鼻子等）呈鹰嘴般弯曲、钩状的外形特征（如“鹰钩鼻”）。"},"examples":[{"en":"The portrait emphasizes his aquilinity, giving his face a sharp, commanding look.","zh":"这幅肖像刻意突出他的鹰状特征，让他的脸看起来锐利而有威严。"},{"en":"Her aquilinity was most noticeable in her nose, which curved slightly downward.","zh":"她的鹰状特征在鼻子上最明显——鼻梁略向下弯。"}]}],"synonyms":["aquiline quality","hookedness","curvature","prominence"],"phonetic":"/ˌæk.wəˈlɪn.ə.ti/","extraExplanation":["“aquilinity”来自拉丁语 aquila（鹰）。英语中更常见的形容词是 aquiline（如 aquiline nose “鹰钩鼻”）。“aquilinity”较少见，常用于描写外貌、肖像或文学性的刻画。","在描述外貌时要注意语境：在一些文化语境中，“aquiline nose”可能被用作中性描写（强调线条、轮廓），也可能带有审美或刻板印象色彩；写作时可搭配更中性的词，如 “prominent/curved nose”（高挺/弯曲的鼻子）。"]}
{"word":"aquilino","summary":{"en":"Aquilino is mainly a male name; in some Romance-language contexts it can also mean “eagle-like/aquiline,” but English usually uses aquiline.","zh":"Aquilino 主要是男性名字；在部分罗曼语语境中也可表示“像鹰的/鹰钩鼻的”，但英语通常用 aquiline。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a masculine given name (and sometimes a surname), common in Spanish-, Portuguese-, and Italian-speaking cultures.","zh":"男性名字（有时也作姓氏），在西班牙语、葡萄牙语和意大利语文化中较常见。"},"examples":[{"en":"Aquilino is my grandfather’s name.","zh":"Aquilino 是我祖父的名字。"},{"en":"The author Aquilino wrote under his full name on the cover.","zh":"作者 Aquilino 在封面上使用了全名。"}]},{"partOfSpeech":"adj.","definition":{"en":"(from Spanish/Portuguese/Italian) “eagle-like; aquiline,” often referring to a nose shape; in English, the more common word is aquiline.","zh":"（源自西/葡/意语）“像鹰的；鹰钩鼻的（aquiline）”，常用来形容鼻子的形状；英语中更常见的对应词是 aquiline。"},"examples":[{"en":"In older descriptions, he is said to have an aquilino nose (aquiline nose).","zh":"在较早的描写中，说他有 aquilino 的鼻子（即鹰钩鼻）。"},{"en":"English writers usually choose the word aquiline instead of aquilino.","zh":"英语写作者通常用 aquiline，而不是 aquilino。"}]}],"synonyms":["aquiline (more common in English)"],"phonetic":"/ˌɑːkwɪˈliːnoʊ/","extraExplanation":["Aquilino 来自拉丁语词根 aquila（“鹰”）。在罗曼语族里它既可作人名，也可作形容词（“像鹰的/鹰钩鼻的”）。英语里更常见的是 aquiline（同源词），而 Aquilino 作为英语词汇本身相对少见，更多出现在人名或外来语语境中。"]}
{"word":"Aquilla","summary":{"en":"Aquilla is usually a variant spelling of Aquila, used as a name; Aquila is also the Latin “eagle” and the name of a constellation.","zh":"Aquilla 通常是 Aquila 的变体拼写，可作人名；Aquila 在拉丁语中意为“鹰”，也是一个星座（天鹰座）的名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A given name or surname (a variant spelling of “Aquila”).","zh":"人名或姓氏（常见为 “Aquila” 的另一种拼写）。"},"examples":[{"en":"Aquilla is a rare name, but you may see it in older records.","zh":"Aquilla 是个比较少见的名字，但你可能会在较早的记录中看到。"},{"en":"Her great-grandfather was named Aquilla.","zh":"她的曾祖父名叫 Aquilla。"}]},{"partOfSpeech":"n.","definition":{"en":"(Often spelled “Aquila”) a constellation in the northern sky; its name means “eagle” in Latin.","zh":"（更常拼作 “Aquila”）北天的一个星座；名称来自拉丁语，意思是“鹰”。"},"examples":[{"en":"In summer, you can look for the Aquila constellation near the bright star Altair.","zh":"在夏季，你可以在明亮的牛郎星（Altair）附近寻找天鹰座（Aquila）。"},{"en":"The astronomy book labels it as Aquila, not Aquilla.","zh":"这本天文书把它标为 Aquila，而不是 Aquilla。"}]}],"synonyms":["Aquila"],"phonetic":"əˈkwɪlə","extraExplanation":["“Aquilla”在英文里更常被视为“Aquila”的变体拼写。“Aquila”源自拉丁语，意为“鹰”，因此天文学里通常写作Aquila（天鹰座）。","在文化与文学中，Aquila也常作为人名出现；例如《圣经·新约》中有一位名叫Aquila的人物（与妻子Priscilla相关）。如果你看到“Aquilla”出现在人名里，通常不需要纠正；但在天文语境下，一般建议用标准拼写“Aquila”。"]}
{"word":"Aquilo","summary":{"en":"Aquilo is a rare, classical word meaning the north wind, especially the Roman north-wind god.","zh":"Aquilo 是一个偏古典、少见的词，表示“北风”，尤指罗马神话中的北风之神。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Roman mythology) the god/personification of the north wind; often used in literature to mean “the north wind.”","zh":"（罗马神话）北风之神/北风的拟人化；文学中也常用来表示“北风”。"},"examples":[{"en":"In Roman myth, Aquilo brings the biting cold of winter.","zh":"在罗马神话中，Aquilo 带来冬季刺骨的寒冷。"},{"en":"The poet wrote that Aquilo swept across the hills at dawn.","zh":"诗人写道，黎明时分北风（Aquilo）掠过群山。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, literary) a cold wind from the north.","zh":"（少见，文学用法）来自北方的寒风、北风。"},"examples":[{"en":"An aquilo rattled the windows all night.","zh":"北方寒风（aquilo）整夜把窗户吹得咯咯作响。"}]}],"synonyms":["north wind","Boreas (Greek equivalent, in mythology)"],"phonetic":"/əˈkwaɪloʊ/","extraExplanation":["“Aquilo”来自拉丁语，原指“北风/北风之神”，与希腊神话中的 Boreas（玻瑞阿斯，北风之神）含义相近。在英文里它属于偏文学或古典典故用词，通常出现在诗歌、神话相关文本或风格化写作中。","注意不要与葡萄牙语/西班牙语里的 aquilo（“那个东西/那件事”）混淆；后者在英语中一般不会当作常用词来使用。"]}
{"word":"aquilon","summary":{"en":"Aquilon is a poetic word for the north wind (and sometimes the northern sky/region).","zh":"Aquilon 是指“北风”的诗歌/文学用词，也可指北方的天空或北方地区（较少见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the north wind (often a poetic or literary word); sometimes used as a name for the cold northern wind","zh":"北风（常用于诗歌或文学语境）；有时指寒冷的北方之风（拟人化称呼）"},"examples":[{"en":"In the poem, Aquilon sweeps across the fields and turns the air sharp.","zh":"在这首诗里，北风（Aquilon）掠过田野，让空气变得刺骨。"},{"en":"Sailors feared Aquilon when winter storms rolled in from the north.","zh":"当冬季风暴自北方袭来时，水手们会畏惧北风（Aquilon）。"}]},{"partOfSpeech":"n.","definition":{"en":"the northern sky or the northern part of the world (rare, literary)","zh":"北方的天空；北方地区（少见，偏文学用法）"},"examples":[{"en":"He looked toward Aquilon, where the clouds gathered above the hills.","zh":"他望向北方的天空（Aquilon），群山上方乌云聚集。"}]}],"synonyms":["north wind","Boreas","northerly wind"],"phonetic":"/ˈæk.wɪ.lən/","extraExplanation":["“Aquilon”来自拉丁语 Aquilo（意为“北风/北方”）。在英文里多见于诗歌、古典或带有古风的写作，不是日常口语常用词。","在古典传统中，它常被用来拟人化“北风”，类似于希腊神话里的北风之神 Boreas（博瑞阿斯）。如果你在文学作品里看到 Aquilon，通常是在营造寒冷、肃杀、冬季来临的氛围。"]}
{"word":"Aquinas","summary":{"en":"Aquinas refers to Thomas Aquinas, a major medieval Catholic philosopher-theologian, or to his writings and ideas.","zh":"Aquinas指中世纪重要的天主教哲学家/神学家托马斯·阿奎那，亦可指其著作与思想。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Thomas Aquinas (c. 1225–1274), an Italian Dominican friar, Catholic saint, and one of the most influential medieval philosophers and theologians.","zh":"托马斯·阿奎那（约1225–1274），意大利多明我会修士、天主教圣人，是中世纪最有影响力的哲学家与神学家之一。"},"examples":[{"en":"In philosophy class, we read excerpts from Aquinas on reason and faith.","zh":"在哲学课上，我们读了阿奎那关于理性与信仰的节选。"},{"en":"Aquinas argued that faith and reason can work together.","zh":"阿奎那认为信仰与理性可以相互协调。"}]},{"partOfSpeech":"other","definition":{"en":"Aquinas’s works or ideas, especially in theology, ethics, and natural law (used as a reference to his thought).","zh":"阿奎那的著作或思想（尤指神学、伦理学与自然法理论；常用来指代他的学说）。"},"examples":[{"en":"The essay compares Augustine and Aquinas on moral responsibility.","zh":"这篇文章比较了奥古斯丁与阿奎那对道德责任的看法。"},{"en":"Many debates about natural law cite Aquinas as a key source.","zh":"许多关于自然法的讨论都把阿奎那当作关键思想来源。"}]}],"synonyms":["St. Thomas Aquinas","Thomas Aquinas"],"phonetic":"/əˈkwaɪnəs/","extraExplanation":["“Aquinas”常见全称是“St. Thomas Aquinas（圣托马斯·阿奎那）”。他是“经院哲学（Scholasticism）”的代表人物之一，擅长用逻辑辩证的方式讨论神学问题。","他最著名的著作之一是《神学大全》（Summa Theologica），也常写作《神学大全/神学总论》。在英语学术写作中，提到“Aquinas”通常默认指这位思想家本人或其观点。","他在伦理学与政治哲学中的“自然法（natural law）”思想影响深远，常出现在法学、政治理论与宗教研究的语境里。"]}
{"word":"aquincubital","summary":{"en":"Aquincubital means “connected with Aquincum,” a Roman-era settlement in today’s Budapest, Hungary.","zh":"Aquincubital 指“与阿昆库姆有关的”，阿昆库姆是位于今匈牙利布达佩斯一带的古罗马城镇。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Aquincum, an important Roman settlement (in the province of Pannonia) located in what is now Budapest, Hungary.","zh":"（形容词）与阿昆库姆（Aquincum）有关的；阿昆库姆的（古罗马潘诺尼亚行省的重要城镇，位于今匈牙利布达佩斯一带）。"},"examples":[{"en":"The museum displays Aquincubital mosaics and everyday tools from Roman times.","zh":"博物馆展出了阿昆库姆的马赛克和罗马时期的日常工具。"},{"en":"Researchers studied Aquincubital inscriptions to learn about local soldiers and merchants.","zh":"研究人员通过阿昆库姆的碑铭来了解当地的士兵与商人。"}]}],"synonyms":["Aquincum-related","Pannonian (context-dependent)"],"phonetic":"ˌækwɪnˈkjuːbɪtəl","extraExplanation":["“Aquincubital”属于非常少见、带学术色彩的形容词，多见于考古、古典学或博物馆语境。日常英语里更常用“from Aquincum”“Aquincum (Roman) site”等表达。","Aquincum 是罗马帝国多瑙河边的重要军事与民政中心之一，遗址以公共浴场、马赛克、碑铭等著名；在英文资料中也常与“Pannonian（潘诺尼亚的）”一起出现。"]}
{"word":"aquincubitalism","summary":{"en":"Aquincubitalism is a rare, humorous word for reclining or lounging in water, especially soaking in a bath.","zh":"Aquincubitalism 是一个罕见且带幽默色彩的词，指躺在水里休息/浸泡，尤指泡澡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very rare or playful coined word meaning the act or habit of reclining in water (for example, soaking or lounging in a bath).","zh":"一种非常罕见、带玩笑/自造色彩的词，指“躺在水里”的行为或习惯（例如在浴缸里浸泡、躺着泡澡）。"},"examples":[{"en":"After a long hike, his favorite form of relaxation was pure aquincubitalism—just soaking in a hot bath for an hour.","zh":"长途徒步之后，他最喜欢的放松方式就是所谓的 aquincubitalism——在热水浴缸里泡上一小时。"},{"en":"The essay jokingly praised aquincubitalism as an art: doing nothing, but doing it in warm water.","zh":"那篇文章开玩笑地称 aquincubitalism 是一门艺术：什么也不做，只不过是在温水里什么也不做。"}]}],"synonyms":["soaking","bathing","lounging in a bath","immersion"],"phonetic":"/ˌæk.wɪnˈkjuː.bɪ.təˌlɪz.əm/","extraExplanation":["这个词不常见，通常不出现在主流词典里，更像是由词根拼出来的“自造词/玩笑词”。一般可拆成：aqui-（类似拉丁语 aqua“水”）+ cubital/recumbent（与“躺、倚靠”有关）+ -ism（表示“主义/习惯/行为方式”）。因此多用于幽默或夸张表达“泡澡、浸泡、在水里躺着休息”。"]}
{"word":"Aquinist","summary":{"en":"An Aquinist is a follower of Thomas Aquinas or someone who supports his ideas; basically a Thomist.","zh":"Aquinist 指阿奎那的追随者或支持其思想的人，基本等同于托马主义者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a follower of Thomas Aquinas (St. Thomas Aquinas) or someone who supports Aquinas’s philosophical and theological ideas; a Thomist","zh":"托马斯·阿奎那（圣托马斯·阿奎那）的追随者；支持其哲学与神学思想的人；托马主义者"},"examples":[{"en":"In medieval philosophy classes, an Aquinist is often contrasted with a Scotist.","zh":"在中世纪哲学课上，“阿奎那主义者”常常与“司各脱主义者”作对比。"},{"en":"The professor described her as an Aquinist because she defended Aquinas’s view of natural law.","zh":"教授称她为阿奎那主义者，因为她为阿奎那的自然法观点辩护。"}]}],"synonyms":["Thomist","follower of Aquinas"],"phonetic":"əˈkwaɪnɪst","extraExplanation":["“Aquinist”是较少见的用词，更常见的说法是“Thomist（托马主义者）”。两者通常都指继承或捍卫阿奎那的思想传统。","托马斯·阿奎那（Thomas Aquinas, 1225–1274）是中世纪经院哲学与天主教神学的重要人物，常以把亚里士多德哲学与基督教神学相结合而闻名。","在阅读哲学或神学英文文本时，看到“Aquinist/Thomist”通常意味着作者在讨论自然法、信仰与理性关系、存在论与形而上学等主题。"]}
{"word":"aquinist","summary":{"en":"An Aquinist is a follower of Thomas Aquinas, or something related to Aquinas’s thought.","zh":"Aquinist 指托马斯·阿奎那的追随者，或与其思想相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a follower of Thomas Aquinas’s philosophy or theology; a Thomist.","zh":"托马斯·阿奎那思想/神学的追随者；托马斯主义者。"},"examples":[{"en":"In medieval philosophy class, she wrote a paper comparing an Aquinist with an Augustinian.","zh":"在中世纪哲学课上，她写了一篇论文比较托马斯主义者与奥古斯丁主义者。"},{"en":"Some Aquinists argue that faith and reason can support each other.","zh":"一些托马斯主义者认为信仰与理性可以相互支撑。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the ideas, writings, or system of Thomas Aquinas.","zh":"与托马斯·阿奎那的思想、著作或体系有关的。"},"examples":[{"en":"The seminar focused on Aquinist views of natural law.","zh":"研讨课聚焦于托马斯主义的自然法观点。"},{"en":"You’ll see Aquinist influence in parts of Catholic moral theology.","zh":"你会在天主教道德神学的某些部分看到托马斯主义的影响。"}]}],"synonyms":["Thomist","Scholastic (often related)"],"phonetic":"/əˈkwaɪnɪst/","extraExplanation":["“Aquinist”来自 Thomas Aquinas（托马斯·阿奎那，13世纪神学家与哲学家）的姓名变体 Aquin-，常与 “Thomist/Thomism（托马斯主义）” 近义。","在学术语境中更常见的说法是 “Thomist（托马斯主义者）/Thomism（托马斯主义）”；“Aquinist”相对少见，多出现在讨论经院哲学、自然法、信仰与理性关系等主题时。"]}
{"word":"aquintocubital","summary":{"en":"A rare entomology term meaning ‘connected with the A5–Cu (fifth anal–cubital) crossvein’ in insect wing venation.","zh":"一个罕见的昆虫学术语，指昆虫翅脉中与 A5–Cu（第五肛脉—尺脉）横脉/连接有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Entomology, anatomy) Relating to the crossvein or connection between the fifth anal vein (A5) and a cubital vein (Cu) in an insect wing (often written as A5–Cu).","zh":"（昆虫学/解剖）指昆虫翅脉中“第五肛脉（A5）与尺脉（Cu）之间的横脉或连接”（常写作 A5–Cu）。"},"examples":[{"en":"The diagram labels the aquintocubital crossvein (A5–Cu) near the base of the wing.","zh":"图中在翅基部附近标出了 aquintocubital 横脉（A5–Cu）。"},{"en":"Species in this group can be separated by whether the aquintocubital vein is present or reduced.","zh":"这一类群的物种可通过 aquintocubital 脉是否存在或是否退化来区分。"}]}],"synonyms":["A5–Cu (notation)","aquintocubital crossvein (phrase)"],"phonetic":"/ˌeɪˌkwɪntoʊˈkjuːbɪtəl/","extraExplanation":["这个词非常少见，主要出现在昆虫翅脉（wing venation）的分类学描述里，属于“用字母+序号表示翅脉”的命名传统：a- 常指 anal（肛脉），quinto- 表示 fifth（第五），cubital 指 cubital（尺脉）。因此 aquintocubital 多用来指 A5 与 Cu 之间那条横脉/连接（相当于写作 A5–Cu）。"]}
{"word":"aquintocubitalism","summary":{"en":"“aquintocubitalism” appears to be a coined, nonstandard term rather than a recognized English word.","zh":"“aquintocubitalism”看起来更像是自造的非标准词，而不是被普遍承认的英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or extremely rare word that is not found in major English dictionaries; it is likely a coined/nonce term rather than established vocabulary.","zh":"一个非标准或极罕见的词，在主要英语词典中通常查不到；更可能是临时造词（nonce word），而非固定词汇。"},"examples":[{"en":"I couldn’t find “aquintocubitalism” in any dictionary, so it may be a made-up word.","zh":"我在词典里找不到“aquintocubitalism”，所以它可能是个编造出来的词。"},{"en":"If you tell me where you saw “aquintocubitalism,” I can help infer what the author meant from context.","zh":"如果你告诉我你在哪里看到“aquintocubitalism”，我可以根据上下文帮你推断作者想表达的意思。"}]}],"synonyms":["nonce word","coinage","neologism"],"phonetic":"/əˌkwɪn.toʊˈkjuː.bɪ.t̬əlˌɪz.əm/","extraExplanation":["从构词上看，它看起来像把多个拉丁/希腊词根拼在一起：-ism 常表示“主义/信仰/倾向”。“cubital”常见于 cubit（古代长度单位“肘尺”，约等于从肘到指尖的长度）。“quinto-”可能让人联想到 quint-（五）。因此它“可能”被用来戏仿一种与“五肘尺/肘尺测量”有关的“主义”。但这只是基于词形的猜测，必须结合原句上下文才能确定意思。","如果这是你在小说、游戏、梗图或社群里看到的词，它很可能是作者为了幽默或塑造世界观而自造的“假学术术语”。把原句/段落贴出来，我可以更准确地解释。"]}
{"word":"aquiparous","summary":{"en":"A rare biology adjective meaning ‘reproducing or giving birth in water.’","zh":"一个罕见的生物学形容词，意思是“在水中繁殖/产仔的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology, rare) Giving birth or producing offspring in water; water-bearing.","zh":"（生物学，罕用）在水中产仔/繁殖的；水生繁殖的。"},"examples":[{"en":"Some amphibians have aquiparous habits, laying eggs or producing young in ponds.","zh":"一些两栖动物有“水中繁殖”的习性，会在池塘里产卵或繁育幼体。"},{"en":"The report compared aquiparous species with those that reproduce on land.","zh":"这份报告比较了在水中繁殖的物种与在陆地上繁殖的物种。"}]}],"synonyms":["aquatic","water-borne","(related) oviparous","(related) viviparous"],"phonetic":"/ˌækwəˈpærəs/","extraExplanation":["这个词非常罕见，多见于较旧或较专业的生物学语境。词根可拆为 aqu-（水，来自拉丁语 aqua）+ -parous（“产/生/繁殖的”，常见于 oviparous 卵生、viviparous 胎生）。日常英语里更常用的表达是 aquatic reproduction（在水中繁殖）或 reproduce in water（在水中繁殖）。"]}
{"word":"Aquitaine","summary":{"en":"Aquitaine is a historic region in southwestern France, also referring to the medieval Duchy of Aquitaine.","zh":"Aquitaine 指法国西南部的历史地区，也可指中世纪的阿基坦公国。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a region in southwestern France, known today mainly as part of the administrative region Nouvelle-Aquitaine.","zh":"阿基坦（法国西南部的地区；现多指法国大区“新阿基坦”的一部分）"},"examples":[{"en":"Bordeaux, famous for wine, is in the historic region of Aquitaine.","zh":"波尔多以葡萄酒闻名，位于历史上的阿基坦地区。"},{"en":"They traveled through Aquitaine on their way to the Atlantic coast.","zh":"他们前往大西洋海岸的路上穿过了阿基坦。"}]},{"partOfSpeech":"n.","definition":{"en":"(history) a powerful medieval territory—often called the Duchy of Aquitaine—especially important in English and French history.","zh":"（历史）阿基坦公国：中世纪时期势力强大的领地，在英法历史中非常重要"},"examples":[{"en":"Eleanor of Aquitaine played a major role in medieval European politics.","zh":"阿基坦的埃莉诺在中世纪欧洲政治中扮演了重要角色。"},{"en":"The Duchy of Aquitaine became tied to the English crown through marriage.","zh":"阿基坦公国通过婚姻与英格兰王室产生了联系。"}]}],"synonyms":["Nouvelle-Aquitaine","Duchy of Aquitaine"],"phonetic":"/ˈæk.wɪ.teɪn/","extraExplanation":["“Aquitaine”常见于欧洲中世纪史：因阿基坦的埃莉诺（Eleanor of Aquitaine）先后成为法国王后与英格兰王后，阿基坦与英法王权纠缠在一起，也间接影响了英法长期冲突（如百年战争）的背景。","现代法国行政区叫“Nouvelle-Aquitaine（新阿基坦）”，范围比历史上的阿基坦更大；日常语境中提到 Aquitaine 往往带有历史或文化地理色彩。"]}
{"word":"Aquitania","summary":{"en":"Aquitania is the Latin/historical name for Aquitaine, a major region in southwestern France, especially important in Roman and medieval history.","zh":"Aquitania 是 Aquitaine（阿基坦）的拉丁/历史名称，指法国西南部的重要地区，在罗马与中世纪历史中尤为关键。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historical region in what is now southwestern France, famous in medieval European history (especially the Duchy of Aquitaine).","zh":"阿基坦（法国西南部的历史地区；在中世纪欧洲史中很有名，尤其与“阿基坦公国”相关）。"},"examples":[{"en":"Eleanor of Aquitaine was one of the most powerful women in medieval Europe.","zh":"阿基坦的埃莉诺是中世纪欧洲最有权势的女性之一。"},{"en":"The story is set in Aquitaine, a region known for its castles and vineyards.","zh":"故事发生在阿基坦，一个以城堡和葡萄园闻名的地区。"}]},{"partOfSpeech":"n.","definition":{"en":"a Roman province in Gaul (ancient France), whose borders changed over time.","zh":"阿基坦行省（罗马帝国时期在高卢/古代法国的一個行省；边界在不同时期有所变化）。"},"examples":[{"en":"Under Roman rule, Aquitania became an important part of Gaul.","zh":"在罗马统治下，阿基坦成为高卢的重要组成部分。"}]}],"synonyms":["Aquitaine (modern/English & French form)"],"phonetic":"/ˌæk.wɪˈteɪ.ni.ə/","extraExplanation":["英语里常见两种拼法：Aquitania（拉丁/历史语境更常见）与 Aquitaine（法语/现代地名更常见）。在阅读历史书时，看到 Aquitania 往往暗示“罗马时期”或“拉丁文称呼”。","在文学与历史叙述中，Aquitaine/Aquitania 经常与“Eleanor of Aquitaine（阿基坦的埃莉诺）”一起出现；她先后成为法国王后与英格兰王后，使该地区与英法王权、十字军和中世纪宫廷文化紧密相连。"]}
{"word":"Aquitanian","summary":{"en":"Aquitanian usually means “from Aquitaine (SW France),” and can also refer to an ancient Aquitanian language.","zh":"Aquitanian 通常指“来自法国西南部阿基坦地区的”，也可指一种古代的阿基坦语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Aquitaine, a region in southwestern France, or to its people or culture","zh":"与阿基坦（法国西南部地区）有关的；阿基坦的（人、文化等）"},"examples":[{"en":"Aquitanian wine regions are famous for their rich reds and crisp whites.","zh":"阿基坦的葡萄酒产区以醇厚的红酒和清爽的白葡萄酒闻名。"},{"en":"She is studying Aquitanian history in the Middle Ages.","zh":"她正在研究中世纪的阿基坦历史。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Aquitaine, France","zh":"阿基坦人（来自法国阿基坦地区的人）"},"examples":[{"en":"Many Aquitanians take pride in their local traditions and food.","zh":"许多阿基坦人以本地传统和美食为荣。"}]},{"partOfSpeech":"adj.","definition":{"en":"(historical linguistics) relating to Aquitanian, an ancient language once spoken in the Aquitaine area, often linked to early Basque","zh":"（历史语言学）阿基坦语的：古代在阿基坦地区使用的一种语言，常被认为与早期巴斯克语有关"},"examples":[{"en":"Some inscriptions contain Aquitanian names that resemble Basque words.","zh":"一些铭文中有阿基坦语人名，与巴斯克语词汇相似。"},{"en":"The Aquitanian language is mainly known through personal names recorded by Romans.","zh":"阿基坦语主要通过罗马人记录的人名而为人所知。"}]}],"synonyms":["of Aquitaine","Gascon (regional, not exact)"],"phonetic":"/ˌɑːkwɪˈteɪniən/","extraExplanation":["“Aquitanian”最常见的用法是地理/文化形容词（指法国阿基坦）。在学术语境中也会指“阿基坦语”，这是一种已消亡的古代语言，资料多来自罗马时期的铭文与人名。","阿基坦（Aquitaine）在历史上曾是重要的公国（如中世纪的阿基坦公国），英语历史材料中常出现该地区名称；因此你也可能在历史、葡萄酒、文学地理等话题里见到“Aquitanian”。"]}
{"word":"aquitanian","summary":{"en":"Aquitanian means related to Aquitaine/Aquitania, a person from there, or an extinct ancient language of the region.","zh":"Aquitanian 指与阿基坦/阿基塔尼亚有关、来自当地的人，或该地区已灭绝的古代语言（阿基坦语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Aquitaine (a region in southwestern France) or to Aquitania (the area in Roman times).","zh":"与阿基坦（法国西南部地区）或罗马时期的阿基塔尼亚（Aquitania）有关的。"},"examples":[{"en":"Bordeaux is often described as part of the Aquitanian region.","zh":"波尔多常被描述为属于阿基坦地区的一部分。"},{"en":"The museum has Aquitanian artifacts from the Roman period.","zh":"博物馆收藏了罗马时期的阿基坦文物。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Aquitaine (or ancient Aquitania).","zh":"阿基坦人；来自阿基坦（或古代阿基塔尼亚）的人。"},"examples":[{"en":"He is an Aquitanian who grew up near the Atlantic coast.","zh":"他是阿基坦人，在大西洋沿岸附近长大。"}]},{"partOfSpeech":"n.","definition":{"en":"an extinct ancient language once spoken in southwestern Gaul, thought to be related to Basque.","zh":"阿基坦语：古代在高卢西南部使用、现已灭绝的一种语言，通常认为与巴斯克语有亲缘关系。"},"examples":[{"en":"Some place names preserve traces of Aquitanian.","zh":"一些地名保留了阿基坦语的痕迹。"}]}],"synonyms":["of Aquitaine","from Aquitaine"],"phonetic":"/ˌæk.wɪˈteɪ.ni.ən/","extraExplanation":["“Aquitanian”来自拉丁语 Aquitania（阿基塔尼亚）。现代语境中，它多用于历史、考古、语言学或地区文化讨论，而日常对话里更常见的说法是“from Aquitaine / in Aquitaine”（来自阿基坦/在阿基坦）。","语言学里说的“阿基坦语（Aquitanian language）”主要通过古代碑铭与人名、地名被推测出来；很多学者认为它与巴斯克语同属更大的“巴斯克语族/巴斯克相关”体系，因此常在讨论巴斯克语起源时被提到。"]}
{"word":"aquiver","summary":{"en":"Aquiver means slightly trembling or shaking, often from emotion or a light movement like wind.","zh":"Aquiver 指“微微颤动/发抖”，常因情绪或轻微外力（如风）引起，偏文学描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"trembling or vibrating slightly, often because of strong feeling (excitement, fear, emotion) or a light physical movement.","zh":"微微颤动的；（常因激动、害怕、强烈情绪等而）轻轻发抖的。"},"examples":[{"en":"Her voice was aquiver with emotion.","zh":"她的声音因激动而微微颤抖。"},{"en":"The leaves were aquiver in the breeze.","zh":"树叶在微风中轻轻颤动。"},{"en":"He stood aquiver with anticipation before the interview.","zh":"面试前他满怀期待，身体微微发抖。"}]}],"synonyms":["trembling","quivering","shaking","vibrating","fluttering"],"phonetic":"/əˈkwɪvɚ/","extraExplanation":["“aquiver”里前缀 a- 表示“处于……状态”（类似 awake, asleep）。它多见于较文学/描写性的语境，用来营造细腻的画面或情绪氛围；日常口语里更常说 trembling / shaking / quivering。"]}
{"word":"aquo","summary":{"en":"A QUO means “from which,” often referring to a starting point; in law, it can mean the original court or decision being appealed.","zh":"A QUO 意为“从……开始/从……而来”，常指起点；在法律语境中也可指被上诉的原审法院或原审裁决。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Latin, used in English) from which; the starting point or source of something.","zh":"（拉丁语，英语中使用）“从……开始/从……而来”；指某事的起点或来源。"},"examples":[{"en":"From that moment a quo, her life changed completely.","zh":"从那个起点开始，她的人生彻底改变了。"},{"en":"We need to identify the date a quo for calculating the deadline.","zh":"我们需要确定起算日（a quo）来计算截止期限。"}]},{"partOfSpeech":"phrase","definition":{"en":"(Law) the court, judge, or decision from which an appeal is taken.","zh":"（法律）原审法院/原裁判者；指上诉所针对的“被上诉的”法院、法官或裁决。"},"examples":[{"en":"The appellate court reviewed the findings of the court a quo.","zh":"上诉法院审查了原审法院（court a quo）的认定。"},{"en":"The judgment a quo was affirmed on appeal.","zh":"原审判决在上诉中被维持。"}]}],"synonyms":["starting point","point of origin","source","lower court (legal sense)"],"phonetic":"/ˌɑː ˈkwoʊ/","extraExplanation":["“a quo”源自拉丁语，字面意思是“从……（地方/时间）”。在英语里多见于法律写作或较正式的语境，用来强调“起点/来源”。","常与拉丁语对应词“ad quem”（到……为止）成对出现：a quo 指起点，ad quem 指终点；在计算期限或讨论范围时很常见。","在法律英语中你会看到“court a quo”“judgment a quo”等搭配，专指被上诉的原审法院/原审裁判。日常英语中一般不用这个表达。"]}
{"word":"aquocapsulitis","summary":{"en":"A rare medical term meaning inflammation of an eye capsule (often the lens capsule), linked to the eye’s aqueous fluids.","zh":"较少见的医学词：指眼部囊膜（常为晶状体囊）发生炎症，概念上与房水等眼内液体相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) Inflammation of an eye capsule, especially involving the lens capsule and/or the surrounding tissues associated with the eye’s watery (aqueous) fluids.","zh":"（医学）眼部囊膜的炎症，常指晶状体囊或与房水（眼内液体）相关组织的囊膜发生炎症。"},"examples":[{"en":"The ophthalmologist considered aquocapsulitis because the patient had pain, redness, and signs of inflammation around the lens capsule.","zh":"眼科医生考虑“aquocapsulitis（眼囊膜炎）”，因为患者出现疼痛、发红，并有晶状体囊周围炎症的迹象。"},{"en":"Aquocapsulitis is a rare term today and may appear in older medical texts about eye inflammation.","zh":"“aquocapsulitis”如今较少使用，可能出现在较早的眼部炎症医学文献中。"}]}],"synonyms":["capsulitis","lens capsulitis"],"phonetic":"/ˌeɪkwoʊˌkæp.sjəˈlaɪ.tɪs/","extraExplanation":["这是一个较少见、偏旧式的医学用语，常见于眼科学语境。词源可拆解为：aquo-（与水/房水相关）+ capsule（囊/囊膜）+ -itis（炎症）。","在现代临床或文献中，更常用的表达通常会直接说明具体部位（如“lens capsulitis 晶状体囊炎”或更具体的眼内炎症诊断），因此遇到该词时建议结合上下文确认指的是哪一层“囊膜”。"]}
{"word":"aquocarbonic","summary":{"en":"Aquocarbonic means “related to carbonic acid in water.”","zh":"aquocarbonic 指“与水中的碳酸（碳酸体系）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or containing carbonic acid in water (i.e., carbon dioxide dissolved in water forming carbonic acid).","zh":"与水中的碳酸（即二氧化碳溶于水并形成碳酸）有关的；含有水合碳酸体系的。"},"examples":[{"en":"Aquocarbonic solutions are common in carbonated drinks and some natural springs.","zh":"含水碳酸体系的溶液在碳酸饮料和一些天然泉水中很常见。"},{"en":"The lab described an aquocarbonic environment to simulate CO₂-rich groundwater.","zh":"实验室描述了一种含水碳酸环境，用来模拟富含二氧化碳的地下水。"}]}],"synonyms":["aqueous carbonic","carbonic (in water)","CO₂-rich (water)"],"phonetic":"/ˌɑːkwoʊkɑːrˈbɑːnɪk/","extraExplanation":["“aquocarbonic”并不是日常英语常用词，更常见的表达是：carbonic acid (in water)（水中的碳酸）、carbonated water（碳酸水）、CO₂-rich water（富含二氧化碳的水）或 aqueous carbonic acid（含水碳酸/水溶碳酸）。","从化学上说，CO₂溶于水后会与水发生可逆反应形成H₂CO₃（碳酸），因此“aquocarbonic”通常用来强调“水相（aquo-/aqua-）+碳酸体系（carbonic）”这一环境或溶液条件。"]}
{"word":"aquocellolitis","summary":{"en":"“Aquocellolitis” is not recognized as a standard English word; it is probably a misspelling (often of “cellulitis”).","zh":"“aquocellolitis”不是标准英语词；很可能是拼写错误（常见目标词是“cellulitis/蜂窝织炎”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a non-English/technical term.","zh":"不是标准英语单词；很可能是拼写错误，或是非英语/专业领域用语。"},"examples":[{"en":"I can’t find “aquocellolitis” in major English dictionaries; could you check the spelling?","zh":"我在主要英语词典里查不到“aquocellolitis”；你能确认一下拼写吗？"},{"en":"Did you mean “cellulitis” (a skin infection)?","zh":"你是不是想写“cellulitis”（蜂窝织炎，一种皮肤感染）？"}]}],"synonyms":["(possible intended word) cellulitis","skin infection"],"phonetic":"/ˌɑːkwoʊˌsɛl.jəˈlaɪ.tɪs/","extraExplanation":["这个词看起来像把几个部分拼在一起：aquo-/aqua-（与“水”相关的前缀）+ cellulitis（蜂窝织炎）。但英语医学里常用的是“cellulitis”，并不会写成“aquocellolitis”。","如果你是在医疗/兽医/水产养殖或游戏设定里看到的词，请把原句贴出来，我可以根据上下文判断你真正想表达的概念，并给出正确拼写与用法。"]}
{"word":"Aquone","summary":{"en":"Aquone is mainly used as a U.S. place name (a small community/area in western North Carolina).","zh":"Aquone 主要用作美国地名（北卡罗来纳州西部的一个小社区/地区）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A place name (proper noun): an unincorporated community/area in western North Carolina, U.S., near the Nantahala National Forest (often seen in local names like Aquone Road or Aquone School).","zh":"地名（专有名词）：美国北卡罗来纳州西部的一个非建制社区/地区，靠近南塔哈拉国家森林（常见于当地名称，如 Aquone Road、Aquone School）。"},"examples":[{"en":"We drove through Aquone on the way to the mountains.","zh":"我们去山里路上开车经过了 Aquone。"},{"en":"The trailhead is a few miles past Aquone.","zh":"登山步道入口在 Aquone 再往前几英里。"}]}],"synonyms":["(no direct synonyms; it’s a proper place name)"],"phonetic":"əˈkwoʊn","extraExplanation":["Aquone 主要是“地名”，不是常见英语词汇；在地图、地址、学校/道路名称中更常遇到。","这类地名的读音在当地可能会有细微差异；如果你是在听力里遇到，建议结合具体州/县/道路名来确认。"]}
{"word":"aquopentamminecobaltic","summary":{"en":"A chemistry term for a cobalt(III) complex with five ammonia ligands and one water ligand.","zh":"化学术语：指含五个氨配体与一个水配体的钴(III)配合物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Describing a cobalt(III) coordination compound in which one water molecule (aquo) and five ammonia molecules (pentammine) are bonded to a cobalt ion; often referring to the complex ion [Co(NH3)5(H2O)]3+ or its salts.","zh":"（化学）指一种钴(III)配位化合物：一个水分子（aquo）和五个氨分子（pentammine）与钴离子配位；常指配合离子 [Co(NH3)5(H2O)]3+ 及其盐类。"},"examples":[{"en":"The sample was identified as an aquopentamminecobaltic chloride in the lab report.","zh":"实验报告中将该样品鉴定为“水合五氨合钴(III)氯化物”。"},{"en":"In coordination chemistry, aquopentamminecobaltic complexes can undergo ligand substitution reactions.","zh":"在配位化学中，水合五氨合钴(III)配合物可以发生配体取代反应。"}]}],"synonyms":["pentaammineaquocobalt(III)","aquo pentaammine cobalt(III)"],"phonetic":"/ˌækwoʊ pɛnˈtæmin koʊˈbɔltɪk/","extraExplanation":["这是较少见的旧式/描述性命名方式，常见于配位化学与经典文献中：\n- aquo- 表示“水分子作为配体（H2O）”\n- pentammine- 表示“五个氨配体（NH3）”\n- cobaltic 表示“钴处于 +3 价（Co(III)）”，相对的 cobalto- 常指 Co(II)。\n在现代 IUPAC 风格里，你也可能看到更常用的写法：pentaammineaquocobalt(III)（盐名再加上 chloride/nitrate 等）。"]}
{"word":"aquose","summary":{"en":"Aqueous means “related to water” or “water-based,” especially in chemistry for solutions dissolved in water.","zh":"Aqueous 指“与水有关的/含水的”，在化学中常指“水溶的、以水为溶剂的（溶液）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Commonly misspelled as “aquose”) relating to water; watery.","zh":"（常被拼错为 aquose）与水有关的；水状的；含水的。"},"examples":[{"en":"The skin cream has an aqueous base, so it feels light and non-greasy.","zh":"这款护肤霜是水性基底，所以摸起来清爽不油腻。"},{"en":"After the storm, the road became an aqueous mess.","zh":"暴风雨过后，道路变得一片湿漉漉的泥水。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) containing or dissolved in water; used to describe water-based solutions.","zh":"（化学）水溶的；水溶液的；以水为溶剂的。"},"examples":[{"en":"Add the salt to the aqueous solution and stir until it dissolves.","zh":"把盐加入水溶液中，搅拌直到完全溶解。"},{"en":"The lab stored the sample in an aqueous medium.","zh":"实验室把样品保存在水性介质中。"}]}],"synonyms":["watery","water-based","hydrous"],"phonetic":"/ˈeɪkwiəs/","extraExplanation":["“aquose”通常不是标准英文拼写，正确拼写是 **aqueous**。它来自拉丁语 *aqua*（水），所以看到词根 **aqu-** 往往能联想到 water，例如 *aquarium*（水族馆）、*aquatic*（水生的）。","发音里常见的拼写—读音对应：**aqueous** 里有 **-eous**（常读作 /iəs/ 或 /jəs/ 的感觉），所以整体读起来像 “AY-kwee-us”。"]}
{"word":"aquosity","summary":{"en":"Aquosity means “wateriness” or, in technical contexts, “water content.”","zh":"aquosity 指“水样/稀薄（多水）”，在技术语境中也可指“含水量”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being watery; wateriness.","zh":"水样的性质；稀薄、多水（的状态）。"},"examples":[{"en":"The soup’s aquosity made it taste bland.","zh":"这汤太稀薄（太多水）了，所以尝起来很淡。"},{"en":"After the ice melted, the drink lost its flavor and gained aquosity.","zh":"冰融化后，饮料味道变淡，变得更“水”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Technical) The amount or presence of water in a substance; water content.","zh":"（术语）物质中的含水量；水分含量。"},"examples":[{"en":"The lab measured the sample’s aquosity before storage.","zh":"实验室在储存前测量了样品的含水量。"},{"en":"Lower aquosity can help some powders stay free-flowing.","zh":"较低的含水量可以帮助某些粉末保持松散、易流动。"}]}],"synonyms":["wateriness","wateryness","thinness (of a liquid)","water content","moisture content"],"phonetic":"/ˌækˈwɑsəti/","extraExplanation":["“aquosity”在日常英语里很少用，更常见的表达是“wateriness”（稀薄/水分过多）或“water content / moisture content”（含水量/水分含量）。","词根来自拉丁语 aqua（“水”），所以看到 aqu- 常能联想到与“水”有关的意思（如 aquatic, aquarium）。"]}
{"word":"aquotization","summary":{"en":"A rare technical noun meaning the process of adapting to an aquatic (water) environment.","zh":"一个罕见的专业名词，指适应水生（水中）环境的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/technical) The process of adapting something or someone to life in water or an aquatic environment; making something more suited to water-based conditions.","zh":"（罕见/专业）使某物或某人适应水中或水生环境的过程；使其更适合水环境的过程。"},"examples":[{"en":"The rehabilitation center focused on the aquotization of injured seabirds before release.","zh":"这家康复中心在放生前重点进行受伤海鸟的“水生适应训练/水生化”。"},{"en":"Some researchers discuss aquotization when describing long-term physiological changes in aquatic mammals.","zh":"一些研究者在描述水生哺乳动物长期的生理变化时会提到“水生化（适应）”。"}]}],"synonyms":["aquatization","adaptation to aquatic life","aquatic adaptation"],"phonetic":"/ˌɑːkwətaɪˈzeɪʃən/","extraExplanation":["“aquotization”在现代英语中非常少见，很多时候你会看到更常用的拼写是“aquatization”（源于拉丁语 aqua=水），意思更明确，也更容易被读者理解。","它多出现在生物学、生态学、动物康复/训练等语境中，用来概括“逐步适应水环境”的过程；日常英语通常不会用这个词。"]}
{"word":"aquotize","summary":{"en":"A rare chemistry verb meaning to replace ligands with water to form an aquo complex.","zh":"一个很少见的化学动词，指用水取代配体形成水合（aquo）配合物。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Chemistry) to convert a coordination compound into an aquo form by replacing one or more ligands with water (H₂O).","zh":"（化学）使配位化合物发生“水合/水化配位”变化，用水（H₂O）取代一个或多个配体，形成水合配合物（aquo complex）。"},"examples":[{"en":"In the next step, the chloride ligand is aquotized, and water binds to the metal center.","zh":"在下一步中，氯配体被“aquotize”（发生水合配位取代），水与金属中心结合。"},{"en":"The researcher aquotized the complex to make it more reactive in solution.","zh":"研究人员将该配合物进行“aquotize”（水合配位处理），使其在溶液中更容易反应。"}]}],"synonyms":["aquate","(process) aquation"],"phonetic":"/əˈkwɑːtaɪz/","extraExplanation":["“aquotize”非常少见，主要出现在配位化学语境中；更常见的说法是“aquate”（使形成aquo配合物）或名词“aquation”（水合取代反应）。","如果你是在一般英语写作中看到/想用这个词，建议先确认原文是否是拼写错误（例如 aquatize / aquate / quote 等），因为在非专业场合几乎不用。"]}
