{"word":"arb","summary":{"en":"“arb” is an informal abbreviation for “arbitrage,” meaning a price-difference profit opportunity or the trade itself.","zh":"“arb”是“arbitrage（套利）”的非正式缩写，指利用价差获利的机会或具体交易。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Short for “arbitrage”: the practice of buying and selling the same (or very similar) asset in different markets to profit from a price difference.","zh":"（非正式）“arbitrage（套利）”的缩写：在不同市场买卖同一种（或非常相近的）资产，利用价差获利。"},"examples":[{"en":"There’s a small arb between the two exchanges, but fees might erase the profit.","zh":"两个交易所之间有一点套利空间，但手续费可能会把利润吃掉。"},{"en":"Some bots do arb automatically when prices diverge.","zh":"有些机器人会在价格出现偏离时自动做套利。"},{"en":"He made money from a quick arb trade after the news.","zh":"新闻出来后他做了一笔快速套利交易赚了钱。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) A specific arbitrage opportunity or trade.","zh":"（非正式）一笔套利交易；一个具体的套利机会。"},"examples":[{"en":"That arb closed in seconds once others noticed it.","zh":"一旦别人注意到，那个套利机会几秒钟就消失了。"},{"en":"I’m looking for low-risk arbs, not big gambles.","zh":"我在找低风险的套利机会，不是大赌博。"}]}],"synonyms":["arbitrage","spread trade","price-difference trade"],"phonetic":"/ɑrb/","extraExplanation":["“arb”常见于金融/加密货币/体育博彩等圈子里的口语或聊天（如Discord、Telegram、X）。正式写作里更常用完整词“arbitrage”。","在不同领域里“ARB/arb”也可能是首字母缩写（例如某些组织名、项目名、地名等）。遇到大写“ARB”时，最好结合上下文确认具体含义。"]}
{"word":"ARBA","summary":{"en":"ARBA is most commonly an acronym for the American Rabbit Breeders Association, but it can also refer to other organizations depending on context.","zh":"ARBA 最常见是“美国兔繁育者协会”的缩写，但在不同语境下也可能指其他机构名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"American Rabbit Breeders Association (a U.S. organization for rabbit breeders and rabbit shows).","zh":"美国兔繁育者协会（美国的兔子繁育与展览相关组织）。"},"examples":[{"en":"She joined ARBA to learn more about rabbit breeds and show rules.","zh":"她加入了 ARBA，以了解更多兔子品种和参展规则。"},{"en":"The rabbits were judged under ARBA standards.","zh":"这些兔子按照 ARBA 的标准进行评审。"}]},{"partOfSpeech":"n.","definition":{"en":"An acronym used in some places to mean “Animal Rescue, Benefiting All” or similar names for animal-rescue groups (meaning depends on the organization).","zh":"在一些地区作为缩写使用，可能指“动物救援，造福所有”等动物救援组织的名称（具体含义取决于该组织）。"},"examples":[{"en":"ARBA is hosting an adoption event this weekend.","zh":"ARBA 这周末将举办领养活动。"},{"en":"Check ARBA’s website to confirm what the letters stand for in your area.","zh":"查看 ARBA 的网站，以确认在你所在地区这个缩写具体代表什么。"}]}],"synonyms":["A-R-B-A (spelled out)"],"phonetic":"ˈɑrbə","extraExplanation":["“ARBA”通常是缩写而不是普通单词；在不同语境下可能指完全不同的机构。最常见、最固定的用法之一是“American Rabbit Breeders Association”。","读写时常按字母读作 A-R-B-A，也有人把它读成一个词“AR-buh”。正式场合建议第一次出现时写出全称并注明缩写（例如：American Rabbit Breeders Association (ARBA)）。"]}
{"word":"arba","summary":{"en":"“arba” is most commonly seen as ARBA (American Rabbit Breeders Association); it can also be a transliteration meaning “four” in some Semitic-language contexts.","zh":"“arba”最常见是 ARBA（美国兔业育种者协会）的缩写；在部分闪米特语系语言的转写语境中也可能表示“四”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(also ARBA) an abbreviation for the American Rabbit Breeders Association (a U.S. organization for rabbit breeders and shows).","zh":"（也写作 ARBA）美国兔业育种者协会（American Rabbit Breeders Association）的缩写，是美国与兔类繁育与展会相关的组织。"},"examples":[{"en":"She entered her rabbit in an ARBA-sanctioned show.","zh":"她带着自己的兔子参加了 ARBA 认可的展会。"},{"en":"ARBA standards describe how different rabbit breeds should look.","zh":"ARBA 的标准描述了不同兔子品种应有的外形特征。"}]},{"partOfSpeech":"other","definition":{"en":"a transliteration of a Semitic word meaning “four” (seen in some Arabic/Hebrew/Aramaic-based names or phrases, depending on the spelling system).","zh":"一种闪米特语系词语的音译形式，意思是“四”（在某些阿拉伯语/希伯来语/阿拉姆语相关的姓名或短语中可见，具体取决于转写方式）。"},"examples":[{"en":"In some transliterations, you may see “arba” used to represent “four.”","zh":"在某些音译体系里，你可能会看到用“arba”来表示“四”。"},{"en":"The exact spelling can change across languages and romanization systems.","zh":"不同语言与拉丁转写体系会导致拼写有所变化。"}]}],"synonyms":["ARBA"],"phonetic":"/ˈɑr.bə/","extraExplanation":["“arba/ARBA”在英语里最常见的是缩写（American Rabbit Breeders Association）。如果你是在学习阿拉伯语或希伯来语，表示“四”的形式在不同转写下可能写成arba、arbaʿ、arba‘等；具体含义要看原文语言与上下文。","如果你能告诉我你在哪里看到“arba”（例如句子、领域、国家/语言），我可以帮你判断是哪一种用法。"]}
{"word":"Arbacia","summary":{"en":"Arbacia is a scientific genus name for certain sea urchins.","zh":"Arbacia 是某些海胆的属名（科学分类名称）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of sea urchins (marine animals with hard, spiny shells), commonly found in coastal waters; used in biology and marine science contexts","zh":"海胆属（Arbacia），一种海胆的属名（海洋棘皮动物，外壳坚硬并带刺）；常见于生物学与海洋科学语境"},"examples":[{"en":"In the tide pools, the researcher recorded several Arbacia sea urchins under the rocks.","zh":"在潮池里，研究人员记录到岩石下有几只Arbacia属的海胆。"},{"en":"Arbacia punctulata is often studied in developmental biology because its eggs are easy to observe.","zh":"Arbacia punctulata（点纹海胆）常用于发育生物学研究，因为它的卵容易观察。"}]}],"synonyms":["sea urchin (general term)"],"phonetic":"/ɑrˈbeɪʃə/","extraExplanation":["Arbacia 是拉丁化的生物分类学名称（属名），通常不翻译，直接用拉丁名；写作时首字母大写并用斜体（Arbacia）。","你可能会在学术文章、海洋生态调查、或实验材料说明中看到它，比如“Arbacia punctulata”（一种常见研究对象的海胆）。"]}
{"word":"arbacia","summary":{"en":"Arbacia is a scientific genus name for certain sea urchins.","zh":"Arbacia 是某些海胆的属名（科学名称）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of sea urchins (spiny marine animals), used especially in biology; one well-known species is the Atlantic purple sea urchin (Arbacia punctulata).","zh":"（生物学）海胆属：一类海胆（多刺的海洋动物）的属名；较常见的物种之一是大西洋紫海胆（Arbacia punctulata）。"},"examples":[{"en":"In the lab, students observed Arbacia under a microscope to study early development.","zh":"在实验室里，学生用显微镜观察海胆属（Arbacia），以研究早期发育。"},{"en":"Arbacia punctulata is often used in classroom experiments on fertilization.","zh":"大西洋紫海胆（Arbacia punctulata）常用于课堂上的受精实验。"}]}],"synonyms":["sea urchin (general term)"],"phonetic":"/ɑrˈbeɪʃiə/","extraExplanation":["“Arbacia”是拉丁化的科学名称（属名），通常首字母大写并用斜体书写：*Arbacia*。在英语里它更多出现在生物学、海洋学、实验教材等语境中，而不是日常口语。","如果你想找的是拼写相近的普通词（比如某个英文单词或品牌名），可以告诉我你看到它的句子或上下文，我可以帮你确认是否拼写有误。"]}
{"word":"arbacin","summary":{"en":"“arbacin” is not a common standard English word; it’s likely a misspelling or a brand/specialized term. Provide context to identify it accurately.","zh":"“arbacin”不是常见的标准英语单词；更可能是拼写错误或品牌/专业用语。提供上下文才能准确判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries. It may be a misspelling, a brand name, or a specialized term (e.g., a product/medicine name). If you share the sentence or where you saw it, I can identify the intended word.","zh":"这不是常见英语词典里的标准单词。它可能是拼写错误、品牌名，或某个专业领域用语（例如产品/药品名）。如果你提供出现它的句子或来源，我可以帮你确认想表达的词。"},"examples":[{"en":"I couldn’t find “arbacin” in a standard dictionary—could it be “arabica” (a type of coffee bean)?","zh":"我在常见词典里找不到“arbacin”——你是不是想写“arabica”（一种咖啡豆）？"},{"en":"Can you paste the full sentence with “arbacin” so I can figure out what it means?","zh":"你可以把包含“arbacin”的完整句子贴出来吗？这样我能判断它的意思。"}]}],"extraExplanation":["如果你是在咖啡相关内容里看到它，最常见的可能是拼错了 **arabica**（阿拉比卡咖啡豆）。","如果是在药品、消毒、兽医或农药等场景里看到，它也可能是某种**商品名/音译名**；这类词在通用词典里不一定能查到，需要具体上下文（国家/品牌/包装照片/句子）。","你也可以告诉我：它出现在什么网站/书/包装上、是否首字母大写（Arbacin/ARBACIN）、以及大概属于什么领域。"]}
{"word":"arbalest","summary":{"en":"An arbalest is a large, powerful medieval crossbow.","zh":"arbalest 指一种中世纪的大型强力弩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large medieval crossbow, often used in war or hunting; also called an arbalest crossbow.","zh":"（中世纪的）重型弩；常用于战争或狩猎，也可称“arbalest crossbow”"},"examples":[{"en":"In the museum, you can see an arbalest beside a suit of armor.","zh":"在博物馆里，你可以看到一把重型弩摆在一套盔甲旁边。"},{"en":"The soldier loaded the arbalest slowly because it required great strength or a mechanical aid.","zh":"士兵缓慢地给重型弩上弦，因为它需要很大的力气或借助机械装置。"}]}],"synonyms":["crossbow (general)","medieval crossbow"],"phonetic":"/ˈɑːr.bə.lɛst/","extraExplanation":["“arbalest”这个词来自古法语 arbaleste，追溯到拉丁语 arcuballista（大致可理解为“弓 + 投射器/弩炮”的组合概念）。它在英文里带有明显的历史与文学色彩，常出现在中世纪题材、骑士故事或战争描写中。","与更常见的“crossbow（弩）”相比，arbalest通常让人联想到更重、更强、拉力更大、装填更慢的一类弩（有时会用绞盘/杠杆上弦）。","在现代英语中它不算日常词汇，更像是历史名词；写作时用它可以营造“中世纪/古战场”的氛围。"]}
{"word":"arbalester","summary":{"en":"An arbalester is a medieval crossbowman—someone who fights using a crossbow.","zh":"arbalester 指中世纪的弩手，即使用弩作战的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A soldier who uses a crossbow (especially a medieval crossbow).","zh":"（尤指中世纪的）弩手；使用弩的士兵。"},"examples":[{"en":"In the castle story, an arbalester guarded the gate with a heavy crossbow.","zh":"在城堡故事里，一名弩手拿着沉重的弩守着城门。"},{"en":"The film shows an arbalester loading a bolt carefully before shooting.","zh":"电影里，一名弩手在射击前仔细装填弩箭。"}]}],"synonyms":["crossbowman"],"phonetic":"/ˌɑɹbəˈlɛstɚ/","extraExplanation":["“Arbalester”常见于历史、奇幻文学或角色扮演类语境（如中世纪战场、城堡防御）。现代英语更常用“crossbowman”。","词源上与“arbalest”（一种弩的名称）相关，读到该词时通常可直接联想到“弩/弩箭（bolt）”。","文学与流行文化里常用它营造“中古欧洲”的氛围：例如描写城墙上的守军、佣兵队伍或围城战时，会用更古雅的“arbalester”而不是更普通的“archer（弓箭手）”。"]}
{"word":"arbalestier","summary":{"en":"An arbalestier is a medieval crossbowman—someone who fights using an arbalest (crossbow).","zh":"arbalestier 指使用弩（arbalest）作战的弩手，常见于中世纪语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A soldier who uses an arbalest (a type of crossbow), especially in medieval Europe.","zh":"（尤指中世纪欧洲的）弩手；使用弩（arbalest）作战的士兵。"},"examples":[{"en":"The arbalestier took position on the castle wall and aimed at the attackers below.","zh":"弩手在城墙上占据位置，瞄准下方的攻城者。"},{"en":"In many medieval armies, arbalestiers were valued for their ability to pierce armor at range.","zh":"在许多中世纪军队中，弩手因能在远距离穿透盔甲而备受重视。"}]}],"synonyms":["crossbowman","arbalester"],"phonetic":"/ˌɑːr.bəˈlɛs.ti.ər/","extraExplanation":["“Arbalestier”来自法语/中古法语传统，常见于历史叙述与中世纪题材文学或游戏中。它指的不是一般“弓箭手”（archer），而是专门使用重型弩（arbalest）的人。","历史上弩的拉力往往较大，装填速度较慢，但威力强、易训练，因此弩手常用于守城、阵地防守或支援射击。"]}
{"word":"arbalestre","summary":{"en":"Arbalestre means a medieval (often large) crossbow.","zh":"arbalestre 指中世纪（通常较大型、威力较强的）弩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medieval crossbow, often large and powerful, used in war and hunting.","zh":"（中世纪的）强弩；大型弩（常用于战争或狩猎）"},"examples":[{"en":"In the museum, you can see an arbalestre used by soldiers in the Middle Ages.","zh":"在博物馆里，你可以看到中世纪士兵使用的强弩。"},{"en":"The knight carried an arbalestre for long-range attacks.","zh":"那位骑士携带强弩进行远程攻击。"}]}],"synonyms":["crossbow","medieval crossbow"],"phonetic":"ˌɑr.bəˈlɛst","extraExplanation":["“arbalestre”是较文学/历史用语，现代英语里更常用“crossbow（弩）”。它源自古法语，进一步可追溯到拉丁语，历史上指一种威力更强、结构更重的弩，常需要绞盘等装置上弦。","在欧洲中世纪战争史中，强弩与长弓常被并列讨论：强弩学习门槛较低但装填较慢；长弓射速快但训练成本高。不同地区与时代差异很大，可作为背景理解。"]}
{"word":"arbalestrier","summary":{"en":"A historical term for a medieval crossbowman.","zh":"指中世纪的弩兵（使用弩的士兵）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medieval soldier who used a crossbow; a crossbowman (often in European armies, especially in the Middle Ages).","zh":"中世纪使用弩作战的士兵；弩兵（多见于欧洲中世纪军队）。"},"examples":[{"en":"The castle hired arbalestriers to defend the walls during a siege.","zh":"城堡雇佣弩兵在围城战中守卫城墙。"},{"en":"In the novel, an arbalestrier takes careful aim before releasing the bolt.","zh":"在小说里，一名弩兵仔细瞄准后射出弩箭。"}]}],"synonyms":["crossbowman","arbalester"],"phonetic":"/ˌɑr.bəˈlɛs.tri.ɚ/","extraExplanation":["“arbalestrier”是历史/文学用词，现代英语更常说“crossbowman”。","词源上与“arbalest（重弩）”有关；arbalest通常指中世纪较强力、较重的弩。","在中世纪战争语境中，弩兵常与弓箭手并列出现，但弩的上弦较慢、穿透力强，战术角色也可能不同。"]}
{"word":"arbalests","summary":{"en":"“Arbalests” means large medieval crossbows (plural of arbalest).","zh":"“arbalests”指“重弩/强弩”，即 arbalest 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large medieval crossbow, often used in war or hunting; the plural form is arbalests.","zh":"（中世纪的）重弩/强弩；常用于战争或狩猎。“arbalests”是其复数形式。"},"examples":[{"en":"The castle walls bristled with archers and arbalests.","zh":"城墙上布满了弓箭手和重弩。"},{"en":"In many medieval battles, arbalests could pierce armor at close range.","zh":"在许多中世纪战斗中，重弩在近距离能射穿盔甲。"}]}],"synonyms":["crossbows","medieval crossbows"],"phonetic":"/ˈɑr.bəˌlɛst/","extraExplanation":["“arbalest”一词多见于中世纪欧洲语境，通常指比一般弩更强、更重的军用弩，有时需要借助上弦器（如卷轴或杠杆）上弦。","在历史与文学作品中，“arbalest”常用来营造中古战争或城堡攻防的氛围；现代英语里更常用的通用词是“crossbow”，而“arbalest”带有更强的历史/古风色彩。"]}
{"word":"arbalist","summary":{"en":"An arbalist is a medieval crossbow user (and sometimes a crossbow maker).","zh":"arbalist 指中世纪的弩手（有时也指制弩/修弩者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A soldier who used a crossbow, especially in medieval times.","zh":"（尤指中世纪的）弩手；使用弩作战的士兵。"},"examples":[{"en":"In medieval battles, an arbalist could strike targets from a distance with a crossbow.","zh":"在中世纪的战斗中，弩手可以用弩从远处攻击目标。"},{"en":"The castle hired arbalists to defend the walls.","zh":"城堡雇佣弩手来守卫城墙。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who makes or maintains crossbows (less common; historical).","zh":"制作或修理弩的人（较少见；历史用法）。"},"examples":[{"en":"The arbalist inspected the crossbow’s string before the tournament.","zh":"比赛前，那位制弩者检查了弩弦。"}]}],"synonyms":["crossbowman","bowman (historical/looser)","archer (not exact)"],"phonetic":"/ˈɑɹbəˌlɪst/","extraExplanation":["“arbalist”来自中古法语/拉丁语系词源，和“arbalest”（一种强力弩）同源。在历史书写中更常见的说法是“crossbowman”（弩手）。","该词多用于历史、文学或角色扮演（如奇幻小说/游戏）语境，现代日常英语中不常用。"]}
{"word":"arbalister","summary":{"en":"An arbalister is a crossbowman (or sometimes a maker of crossbows), especially in medieval contexts.","zh":"arbalister 指弩手（有时也指弩匠），多用于中世纪语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A crossbowman—especially a medieval soldier who used an arbalest (a powerful type of crossbow).","zh":"弩手；（尤指中世纪）使用“强弩/十字弓（arbalest）”的士兵。"},"examples":[{"en":"The castle hired arbalisters to defend the walls during a siege.","zh":"城堡雇用了弩手在围城时守卫城墙。"},{"en":"In medieval stories, an arbalister might be posted on a tower to watch the road.","zh":"在中世纪故事里，弩手可能被安排在塔楼上监视道路。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who makes or supplies arbalests (crossbows).","zh":"制作或供应强弩（十字弓）的人；弩匠。"},"examples":[{"en":"The arbalister repaired the weapon’s string and mechanism.","zh":"那位弩匠修理了武器的弓弦和机关。"}]}],"synonyms":["arbalester","arbalestier","crossbowman"],"phonetic":"/ˈɑr.bə.lɪs.tɚ/","extraExplanation":["“arbalister”较少见，更常见的拼写是“arbalester / arbalestier”。词源与中古法语有关，常出现在历史小说、战争史或奇幻作品中。","中世纪的弩（尤其是强弩 arbalest）威力大、训练门槛相对较低，因此弩手在攻城与守城中很常见；但在许多地区也曾引发关于武器使用的社会与宗教争议。"]}
{"word":"arbalists","summary":{"en":"Arbalists are crossbowmen—people who fight or hunt using an arbalest (a powerful medieval crossbow).","zh":"Arbalists 指“弩手”，即使用强弩（中世纪威力较大的弩）作战或狩猎的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a soldier or hunter who uses an arbalest (a type of crossbow); a crossbowman","zh":"使用强弩（中世纪的一种弩）的士兵或猎手；弩手"},"examples":[{"en":"In the siege, the arbalists defended the walls with heavy crossbows.","zh":"在围城战中，弩手用重弩守卫城墙。"},{"en":"The captain ordered the arbalists to aim at the approaching cavalry.","zh":"队长命令弩手瞄准逼近的骑兵。"}]}],"synonyms":["crossbowmen","bowmen (broader)","marksmen (broader)"],"phonetic":"/ˈɑrbəlɪsts/","extraExplanation":["“Arbalists”是复数形式，单数是“arbalist”。相关武器“arbalest”常指中世纪欧洲威力较大的强弩，常用于攻城与防守。","在历史与文学语境里，arbalist常带有“中世纪军队/雇佣兵/城堡守军”的氛围；现代英语更常用的通用词是“crossbowman”。"]}
{"word":"arbalo","summary":{"en":"“Arbalo” is not a standard English vocabulary word; it’s usually a proper name, so the meaning depends on context.","zh":"“Arbalo”不是标准英语词汇，通常是专有名词，含义取决于具体语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. “Arbalo” most often appears as a proper name (a surname, brand name, or place name) in English contexts, so its meaning depends on who/what it refers to.","zh":"不是标准英语词汇。“Arbalo”在英语语境中多见作专有名词（姓氏、品牌名或地名），具体含义取决于它指代的人或事物。"},"examples":[{"en":"I couldn’t find a dictionary meaning for “arbalo”; it may be a surname or a brand.","zh":"我在词典里找不到“arbalo”的释义；它可能是姓氏或品牌名。"},{"en":"If “Arbalo” is a company name, check the website for its official pronunciation and meaning.","zh":"如果“Arbalo”是公司名，建议查看官网获取官方读音和含义。"}]}],"synonyms":["(proper noun) name","(possible intended words) arboreal","arbor","arable"],"phonetic":"/ɑrˈbɑloʊ/","extraExplanation":["“Arbalo”看起来更像西班牙语/意大利语风格的拼写，但它本身并不是常见英语单词。","如果你想查的是某个英语单词，可能是拼写接近的词：\n- arboreal（adj. 树上的；栖树的）\n- arbor（n. 凉亭/棚架；（植物）乔木）\n- arable（adj. 可耕种的）\n你可以告诉我你想表达的中文意思或提供句子，我可以帮你锁定正确单词。"]}
{"word":"arbalos","summary":{"en":"“arbalos” is not a recognized standard English word; it is likely a misspelling or a proper name.","zh":"“arbalos”不是标准英语词汇；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as a misspelling or mistaken form.","zh":"不是标准英语单词；最常见的是拼写错误或误写形式。"},"examples":[{"en":"I couldn’t find “arbalos” in an English dictionary—did you mean “arbalest” or “Arbalo’s”?","zh":"我在英语词典里找不到“arbalos”——你是想写“arbalest（弩）”还是“Arbalo’s（Arbalo 的……）”吗？"},{"en":"Please share the sentence where you saw “arbalos” so I can identify the intended meaning.","zh":"请把你看到“arbalos”的句子发给我，这样我能判断它原本想表达的意思。"}]}],"phonetic":"ɑrˈbɑloʊz","extraExplanation":["“arbalos”很可能是：\n1）把 **arbalest**（中古英语/法语来源，意为“弩”）拼错了；\n2）把西班牙语 **árboles**（意为“树木”，复数）误当成英语写法；\n3）专有名词（人名/地名/品牌名）或某个文本里的虚构词。若你提供上下文（完整句子、出处、领域），我可以更准确地判断并给出对应词条。"]}
{"word":"Arbe","summary":{"en":"Arbe is usually a proper name—most often an older name for Rab (Croatia).","zh":"Arbe 通常是专有名词，多指克罗地亚 Rab（拉布）的旧称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a historical/Italian name for the Croatian island and town now called Rab (in the Adriatic Sea).","zh":"“Rab（拉布岛/拉布镇）”的历史/意大利语旧称，位于亚得里亚海的克罗地亚。"},"examples":[{"en":"In older Italian sources, Rab may appear as Arbe.","zh":"在较早的意大利语资料中，Rab 可能会写作 Arbe。"},{"en":"The ship stopped at Arbe (today’s Rab) during its Adriatic route.","zh":"那艘船在亚得里亚海航线上停靠了 Arbe（即今天的 Rab）。"}]},{"partOfSpeech":"other","definition":{"en":"a rare personal name or surname in English-language contexts.","zh":"在英语语境中较少见的人名或姓氏。"},"examples":[{"en":"Ms. Arbe will join the meeting at 2 p.m.","zh":"Arbe 女士将于下午两点参加会议。"}]}],"synonyms":["Rab"],"phonetic":"/ˈɑrbeɪ/","extraExplanation":["“Arbe”在现代英语里不是常用词汇；更常见的是作为专有名词（地名/人名）。如果你本来想查的是英语单词“arb.”（arbitrage 的缩写）或别的词（如“arbor”“ardor”“are”），把完整拼写发我，我可以按你想要的词解释。"]}
{"word":"Arbeiterpartei","summary":{"en":"Arbeiterpartei is German for “workers’ party,” often seen in historical political party names.","zh":"Arbeiterpartei是德语“工人党”，常见于历史上的政党名称中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(German) “Workers’ Party”; a political party that claims to represent workers’ interests, often used in historical contexts as part of a party’s official name.","zh":"（德语）“工人党”；自称代表工人利益的政党名称，常见于历史语境中作为政党正式名称的一部分。"},"examples":[{"en":"The term “Arbeiterpartei” literally means “workers’ party” in German.","zh":"“Arbeiterpartei”在德语里字面意思就是“工人党”。"},{"en":"In history books, you may see it as part of a longer party name.","zh":"在历史书里，你可能会看到它作为更长的政党名称的一部分出现。"}]}],"synonyms":["workers' party","labor party","labour party"],"phonetic":"/ˈɑr.baɪ.tɚ.pɑrˌtaɪ/","extraExplanation":["“Arbeiterpartei”在德语中由Arbeiter（工人）+ Partei（政党）构成，是非常直译、常见的政治词汇。","它在20世纪欧洲历史材料中可能与特定政党名称同时出现（例如“Deutsche Arbeiterpartei”或“Nationalsozialistische Deutsche Arbeiterpartei”）。阅读时要区分“字面含义（工人党）”与“具体历史组织/意识形态”的指称：同样的词根并不必然代表相同立场或价值。"]}
{"word":"Arbela","summary":{"en":"Arbela is an ancient name for modern Erbil (Iraq) and is sometimes used as an older name for the Battle of Gaugamela.","zh":"Arbela 是伊拉克埃尔比勒（Erbil）的古称，也常见于较旧说法中用来指代“高加米拉之战”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical name) The ancient name for Erbil, a city in what is now northern Iraq.","zh":"（历史名称）今伊拉克北部城市埃尔比勒（Erbil）的古称。"},"examples":[{"en":"Some classical writers called the city Arbela, which is modern Erbil in Iraq.","zh":"一些古典作家把这座城市称为 Arbela，也就是今天伊拉克的埃尔比勒（Erbil）。"},{"en":"Arbela appears in ancient sources describing Mesopotamian and Persian history.","zh":"在描述美索不达米亚与波斯历史的古代文献中常能见到 Arbela 这个名字。"}]},{"partOfSpeech":"n.","definition":{"en":"A traditional (but less precise) name used for the decisive battle in 331 BCE where Alexander the Great defeated Darius III; more accurately called the Battle of Gaugamela.","zh":"（传统但不够精确的说法）指公元前331年亚历山大大帝击败大流士三世的决定性战役；更准确的名称是“高加米拉之战”（Battle of Gaugamela）。"},"examples":[{"en":"Older books may refer to the Battle of Arbela, but many historians prefer “Battle of Gaugamela.”","zh":"一些较早的书可能称其为“Arbela 之战”，但很多历史学者更倾向用“高加米拉之战”。"},{"en":"The term “Arbela” became linked to the battle because Arbela was the nearest major city mentioned in some accounts.","zh":"“Arbela”之所以与这场战役联系在一起，是因为在某些记载中它是被提到的最近的大城市。"}]}],"synonyms":["Erbil","Gaugamela (for the battle)"],"phonetic":"/ɑrˈbiːlə/","extraExplanation":["Arbela 属于“古地名/异名”（historical place-name）。在不同语言与不同时代的史料中，同一地点可能有多个名称；学习时可把它当作 Erbil（埃尔比勒）的旧称来记。","“Battle of Arbela” 在英语里更像一种传统叫法：由于战场附近地名的转述差异，有时以较知名的城市 Arbela 来指代；现代史学更常用更精确的 Gaugamela。"]}
{"word":"arbela","summary":{"en":"Arbela is an ancient city name (usually modern Erbil, Iraq) and also an older name for the Battle of Gaugamela (331 BCE).","zh":"Arbela 既可指一座古城（通常对应今天伊拉克的埃尔比勒），也可指较旧说法中的“Arbela 之战”（即高加米拉之战，公元前331年）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient city in Mesopotamia, usually identified with modern Erbil in northern Iraq.","zh":"美索不达米亚的一座古城，通常被认为就是今天伊拉克北部的埃尔比勒（Erbil）。"},"examples":[{"en":"Arbela was an important city in the ancient Near East.","zh":"Arbela 是古代近东地区的重要城市。"},{"en":"Some historians connect Arbela with the area around modern Erbil.","zh":"一些历史学者认为 Arbela 与今天埃尔比勒一带有关。"}]},{"partOfSpeech":"n.","definition":{"en":"A traditional name used in some older sources for Alexander the Great’s decisive victory over Darius III in 331 BCE (more precisely fought near Gaugamela).","zh":"一些较旧资料中对公元前331年亚历山大大帝击败波斯王大流士三世那场决定性战役的称呼（更准确的战场地点在高加米拉 Gaugamela 附近）。"},"examples":[{"en":"Older books may call the Battle of Gaugamela the Battle of Arbela.","zh":"较旧的书可能把“高加米拉之战”称为“Arbela 之战”。"},{"en":"The victory at Arbela helped Alexander take control of the Persian Empire.","zh":"“Arbela 的胜利”（即高加米拉之战）帮助亚历山大掌控了波斯帝国。"}]}],"synonyms":["Erbil","Gaugamela (in the battle context)"],"phonetic":"/ɑrˈbiːlə/","extraExplanation":["Arbela 是拉丁化/英语化的古名；现代更常见的地名是 Erbil（埃尔比勒），在库尔德语里常写作 Hewlêr。","“Battle of Arbela（阿贝拉之战）”这一说法在早期西方史书里很常见，因为 Arbela 是附近较有名的城市；但多数现代史学作品更倾向使用更精确的“Battle of Gaugamela（高加米拉之战）”。","阅读英语史书时，看到 Arbela 既可能指“城市”，也可能指“战役名称”；可通过上下文（如 Alexander, Darius, 331 BCE 等线索）来判断。"]}
{"word":"Arbela-Gaugamela","summary":{"en":"Arbela-Gaugamela refers to the famous 331 BCE battle in which Alexander the Great defeated Darius III; it combines an older place-name (Arbela) with the standard modern name (Gaugamela).","zh":"Arbela-Gaugamela指公元前331年亚历山大大帝击败大流士三世的著名战役；该写法把较旧的地名称呼（Arbela）与现代通行名称（Gaugamela）并列。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a historical name referring to the Battle of Gaugamela (331 BCE), sometimes described as the Battle of Arbela, where Alexander the Great decisively defeated the Persian king Darius III.","zh":"一个历史称呼，指公元前331年的“高加米拉战役”（有时也被称为“阿贝拉/阿尔贝拉之战”），亚历山大大帝在此决定性击败波斯王大流士三世。"},"examples":[{"en":"The Arbela-Gaugamela battle is often taught as the turning point that ended Persia’s power in the region.","zh":"“阿贝拉—高加米拉战役”常被视为终结波斯在该地区霸权的关键转折点。"},{"en":"Some older sources call it Arbela, but most modern historians use Gaugamela.","zh":"一些较早的资料称其为“阿贝拉之战”，但大多数现代史学家使用“高加米拉战役”。"}]}],"synonyms":["Battle of Gaugamela","Battle of Arbela","Gaugamela","Arbela"],"phonetic":"/ˌɑrˈbɛlə ˌɡɔɡəˈmiːlə/","extraExplanation":["“Arbela”通常指古代城市阿贝拉（与今天伊拉克北部的埃尔比勒 Erbil 有关）；而真正的战场更接近“Gaugamela”。因此把两者连在一起（Arbela-Gaugamela）多见于强调旧称与通行学术称呼的对应关系。","这场战役在英语历史写作中常被用来讨论“战略与战术”“骑兵侧翼包抄”“帝国更替”等主题。"]}
{"word":"arbelest","summary":{"en":"Arbelest means a powerful medieval crossbow.","zh":"Arbelest 指中世纪常见的强弩（弩的一种）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medieval crossbow, often large and powerful, used as a weapon in war or hunting","zh":"（中世纪的）强弩；一种常见于战争或狩猎的弩，通常更大、更有威力"},"examples":[{"en":"The guard carried an arbelest to defend the castle gate.","zh":"守卫拿着一把强弩来防守城门。"},{"en":"In the story, the knight fears the arbelest more than a sword.","zh":"在故事里，这位骑士比起剑更害怕强弩。"}]}],"synonyms":["arbalest","crossbow"],"phonetic":"/ˈɑr.bə.lɛst/","extraExplanation":["“arbelest”更常见的拼写是“arbalest”。两者指同一种武器，都是“弩”的一种（通常更重、更强），在中世纪欧洲的战争中很常见。","这种弩往往需要借助上弦器（如绞盘或杠杆）来拉开弓弦，装填较慢，但穿透力强；因此在历史叙述、奇幻小说和中世纪题材作品中经常出现。"]}
{"word":"Arber","summary":{"en":"Arber is most commonly a person’s name; it can also relate to “Arbër,” a historical/cultural term connected to Albanians.","zh":"Arber 最常见是人名；也可能与 “Arbër” 有关，这是与阿尔巴尼亚人相关的历史/文化用语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A masculine given name and surname, used in several countries (especially among Albanian speakers).","zh":"男性名字或姓氏，在多个国家使用（在阿尔巴尼亚语使用者中较常见）。"},"examples":[{"en":"Arber is starting a new job next week.","zh":"Arber 下周开始新工作。"},{"en":"I met Arber through a friend from Albania.","zh":"我通过一位来自阿尔巴尼亚的朋友认识了 Arber。"}]},{"partOfSpeech":"other","definition":{"en":"A spelling that may refer to “Arbër,” an older name connected to Albanians and the Albanian language/culture (often seen in historical or cultural contexts).","zh":"一种写法，可能指 “Arbër”，与阿尔巴尼亚人及其语言/文化相关的较早称呼（常见于历史或文化语境）。"},"examples":[{"en":"Some historical texts use Arbër to refer to Albanians.","zh":"一些历史文本会用 Arbër 来指代阿尔巴尼亚人。"}]}],"synonyms":["Arbër","Arbëreshë (related term)"],"phonetic":"/ˈɑrbər/","extraExplanation":["“Arbër/Arbëresh”常与阿尔巴尼亚历史与族群认同有关：Arbër是较早的自称之一；Arbëreshë指意大利南部的阿尔巴尼亚裔社群。不同地区与拼写（Arber/Arbër）在拉丁字母转写时会出现差异。"]}
{"word":"arber","summary":{"en":"“Arber” is most often a name (surname or given name). In Albanian contexts, it connects to an old term for Albanians/Albania.","zh":"“Arber”多为人名（姓或名）。在阿尔巴尼亚语境中，它与阿尔巴尼亚人/阿尔巴尼亚的古称有关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname) used in English and other languages.","zh":"（姓氏）Arber，用作英文及其他语言中的姓。"},"examples":[{"en":"Dr. Arber will lead today’s seminar.","zh":"Arber 博士将主持今天的研讨会。"},{"en":"I found an article by Arber in the library catalog.","zh":"我在图书馆目录里找到了 Arber 写的文章。"}]},{"partOfSpeech":"other","definition":{"en":"a given name used especially in Albanian communities; related to “Arbër/Arbëria,” an old name for Albanians/Albania.","zh":"（人名）常见于阿尔巴尼亚社群；与“Arbër/Arbëria”（对阿尔巴尼亚人/阿尔巴尼亚的古称）有关。"},"examples":[{"en":"Arber is a common boy’s name in some Albanian families.","zh":"在一些阿尔巴尼亚家庭中，Arber 是常见的男孩名字。"},{"en":"His name, Arber, reflects his Albanian heritage.","zh":"他的名字 Arber 体现了他的阿尔巴尼亚文化背景。"}]}],"synonyms":["(no direct synonyms; it’s usually a proper name)"],"phonetic":"/ˈɑrbər/","extraExplanation":["如果你要查的是英文常用词，可能是拼写少了一个字母：\n- barber /ˈbɑrbər/：理发师\n- arbor /ˈɑrbər/：树荫处；（机器/工具的）轴；凉棚（也常写作 arbour，英式）\n你可以告诉我你看到 “arber” 的句子或上下文，我可以帮你判断具体意思。","在阿尔巴尼亚语文化中，Arbër（也写作 Arber）与中世纪时期对阿尔巴尼亚及其民族的称呼有关；“Arbëreshë/Arbëresh”也指生活在意大利的阿尔巴尼亚裔社群（历史上迁徙形成）。"]}
{"word":"Arbil","summary":{"en":"Arbil: a less common English spelling of Erbil, a major city in northern Iraq.","zh":"Arbil：Erbil（埃尔比勒）的较少见英文拼写，位于伊拉克北部的重要城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in northern Iraq (Iraqi Kurdistan), widely known in English as **Erbil**; **Arbil** is a less common spelling.","zh":"伊拉克北部（伊拉克库尔德斯坦地区）的一座城市，英文中更常写作 **Erbil**；**Arbil** 是较少见的拼写。"},"examples":[{"en":"Arbil (Erbil) is the capital of the Kurdistan Region of Iraq.","zh":"Arbil（Erbil）是伊拉克库尔德斯坦自治区的首府。"},{"en":"She traveled to Arbil for a cultural festival.","zh":"她去 Arbil 参加一个文化节。"},{"en":"Some older maps label the city as Arbil instead of Erbil.","zh":"一些较旧的地图会把这座城市标成 Arbil，而不是 Erbil。"}]}],"synonyms":["Erbil","Hewlêr (Hawler)"],"phonetic":"/ˈɑr.bɪl/","extraExplanation":["“Arbil / Erbil”指同一座城市。英文媒体与学术写作中更常用 **Erbil**；“Arbil”多见于旧译名、旧地图或个别转写体系。","这座城市在库尔德语中常写作 **Hewlêr（也写 Hawler）**；不同语言与转写规则会造成拼写差异。","埃尔比勒以“埃尔比勒城堡（Citadel of Erbil）”闻名，被认为是世界上持续有人居住时间极长的城市之一。"]}
{"word":"arbinose","summary":{"en":"Arabinose is a naturally occurring plant sugar (a five-carbon monosaccharide).","zh":"Arabinose（阿拉伯糖）是一种天然存在于植物中的五碳单糖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural sugar (a five-carbon monosaccharide) found in many plants, especially in plant gums and hemicellulose.","zh":"阿拉伯糖；一种天然的五碳单糖，存在于许多植物中，尤其常见于植物胶和半纤维素中。"},"examples":[{"en":"Arabinose is a common component of plant cell walls.","zh":"阿拉伯糖是植物细胞壁的常见组成成分。"},{"en":"In the lab, scientists may test how yeast reacts to arabinose.","zh":"在实验室里，科学家可能会测试酵母对阿拉伯糖的反应。"}]}],"synonyms":["arabinose (L-arabinose)","pentose"],"phonetic":"/əˈræbɪˌnoʊs/","extraExplanation":["你输入的“arbinose”通常是拼写误差；标准拼写是 **arabinose**（阿拉伯糖）。","阿拉伯糖常用于生物化学与微生物学实验，例如研究细菌/酵母对不同糖的代谢能力。"]}
{"word":"arbiter","summary":{"en":"An arbiter is a person who makes the final decision in a dispute or serves as an authority on what is acceptable or in good taste.","zh":"arbiter 指在争议中作最终裁决的人，也可指在品味或标准方面具有权威影响力的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who has the authority to make a final decision or judgment in a disagreement, competition, or matter of taste.","zh":"仲裁者；裁决者；（在争议、比赛或审美问题上）有最终决定权的人。"},"examples":[{"en":"The two companies chose a neutral arbiter to settle the contract dispute.","zh":"两家公司选择了一位中立的仲裁者来解决合同纠纷。"},{"en":"In many families, a grandparent becomes the arbiter when siblings argue.","zh":"在许多家庭里，当兄弟姐妹争吵时，祖父母常常成了裁决者。"},{"en":"For decades, the magazine acted as an arbiter of good taste.","zh":"几十年来，这本杂志一直被视为“品味好坏”的权威裁判。"}]},{"partOfSpeech":"v.","definition":{"en":"To act as an arbiter; to judge or decide between different sides (less common).","zh":"担任仲裁者；裁决（较少见的用法）。"},"examples":[{"en":"She was asked to arbiter between the two teams after the controversy.","zh":"争议发生后，人们请她在两队之间进行裁决。"}]}],"synonyms":["arbitrator","judge","referee","umpire","mediator","adjudicator","authority"],"phonetic":"/ˈɑɹbɪtɚ/","extraExplanation":["“arbiter”常见于正式语境（法律、商业、公共争议），比“judge”更强调“被双方接受、负责裁决争端”的角色。法律语境中常与“arbitration（仲裁）”相关，但“arbiter”也可引申为“品味/标准的权威”（arbiter of taste）。","词源来自拉丁语“arbiter”（见证者、裁判者）。在文学与评论写作中，常用“arbiter of taste/arbiter of style”来指某个媒体、评论家或群体对审美风向的影响力。"]}
{"word":"arbiters","summary":{"en":"Arbiters are people who decide disputes or who set standards and influence opinions in a field.","zh":"arbiters 指“裁决争议的人（仲裁者/裁判）”或“某领域的权威评判者（制定标准、影响舆论的人）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who have the authority to judge or decide a disagreement or dispute (often in an official or neutral role).","zh":"仲裁者；裁决者（通常指有权且保持中立、负责判定争议的人）"},"examples":[{"en":"The two companies agreed to let independent arbiters settle the contract dispute.","zh":"两家公司同意让独立的仲裁者来解决合同纠纷。"},{"en":"In many labor disputes, arbiters review evidence from both sides before making a decision.","zh":"在许多劳资纠纷中，仲裁者会先审查双方证据再作出裁决。"}]},{"partOfSpeech":"n.","definition":{"en":"People who strongly influence or set standards in a particular area (for example, art, fashion, or public opinion).","zh":"权威人士；评判标准的制定者（如艺术、时尚或舆论领域的“风向标”）"},"examples":[{"en":"Critics and editors are often seen as arbiters of taste.","zh":"评论家和编辑常被视为品味的权威评判者。"},{"en":"For years, the magazine’s staff acted as arbiters of what was considered fashionable.","zh":"多年来，这家杂志的团队一直充当着“什么算时髦”的评判者。"}]}],"synonyms":["judges","referees","mediators","umpires","adjudicators","authorities","tastemakers"],"phonetic":"ˈɑrbɪtər","extraExplanation":["“arbiter”的词源来自拉丁语，和“判断、裁决”有关；因此它既可指正式的仲裁/裁判角色，也可引申为在某个领域里“说了算”的权威。","在体育语境中，arbiter 有时可指“裁判”，但更常见的说法是 referee。"]}
{"word":"arbith","summary":{"en":"“Arbith” is not a standard English word; you likely mean “arbiter,” meaning a judge/decision-maker in disputes or an authority who sets standards.","zh":"“arbith”不是标准英文单词；你可能想写“arbiter”，意思是纠纷中的裁决者/仲裁者，也可指在品味或标准上有影响力的权威。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended: “arbiter”) a person or group that has the authority to judge a disagreement and make a decision.","zh":"（你可能想写的是：arbiter）仲裁者；裁决者：有权判断争议并作出决定的人或机构。"},"examples":[{"en":"The judge acted as the arbiter in the dispute between the two companies.","zh":"法官在两家公司之间的纠纷中充当了仲裁者。"},{"en":"In our family, my mom is the arbiter of what counts as “fair.”","zh":"在我们家，妈妈是决定什么才算“公平”的裁决者。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension) someone whose taste or opinion strongly influences what others accept as good or correct.","zh":"（引申）品味／标准的权威；（对大众审美或标准有影响的）评判者。"},"examples":[{"en":"She became an arbiter of fashion in the city.","zh":"她成了这座城市的时尚风向标。"},{"en":"Critics are often seen as arbiters of quality in art.","zh":"评论家常被视为艺术质量的评判权威。"}]}],"synonyms":["judge","referee","umpire","mediator","decision-maker"],"phonetic":"ˈɑːrbɪtər","extraExplanation":["“arbith”不是常见的英语单词拼写；最接近、最常见的目标词通常是 **arbiter**（仲裁者/裁决者）。如果你本来想表达“武断的/任意的”，可能是 **arbitrary**；如果是“仲裁”，则常用 **arbitrate / arbitration**。","词源小提示：**arbiter** 来自拉丁语，核心含义是“判断、裁决”。"]}
{"word":"arbitrable","summary":{"en":"Arbitrable means a dispute or claim can be legally decided through arbitration instead of court.","zh":"Arbitrable 指争议或请求在法律/合同上可由仲裁而非法院来裁决。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be decided or settled by arbitration (a private legal process where a neutral arbitrator makes a binding decision).","zh":"可通过仲裁解决的；可以提交仲裁裁决的（仲裁是一种由中立仲裁员作出具有约束力决定的私法程序）。"},"examples":[{"en":"The judge held that the dispute was arbitrable under the contract’s arbitration clause.","zh":"法官认定该争议根据合同中的仲裁条款属于可仲裁事项。"},{"en":"Some employment claims are arbitrable, but others must be heard in court.","zh":"有些劳动争议可以仲裁，但也有些必须由法院审理。"},{"en":"Before filing a lawsuit, check whether the issue is arbitrable.","zh":"在提起诉讼前，先确认该问题是否可仲裁。"}]}],"synonyms":["subject to arbitration","capable of arbitration"],"phonetic":"/ˈɑːrbɪtrəbəl/","extraExplanation":["“arbitrable”常见于法律与合同语境，尤其是合同里写有arbitration clause（仲裁条款）时。它强调“这个争议的类型/事项是否被法律与合同允许交给仲裁处理”，而不只是“双方愿不愿意仲裁”。","常见搭配：arbitrable dispute/claim/issue（可仲裁的争议/请求/事项）；be deemed/held arbitrable（被认定为可仲裁）。与之相对的是non-arbitrable（不可仲裁的）。"]}
{"word":"arbitrage","summary":{"en":"Arbitrage means making profit from price differences by buying in one market and selling in another.","zh":"Arbitrage 指通过在不同市场间买入卖出，利用价差获利的“套利”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The practice of buying something (such as currency, stocks, or goods) in one market and selling it in another market to profit from a price difference, often with low risk.","zh":"套利：在一个市场买入（如货币、股票或商品），并在另一个市场卖出，以利用价格差获利，通常风险较低。"},"examples":[{"en":"Traders used arbitrage to profit from the price difference between the two exchanges.","zh":"交易员利用两个交易所之间的价差进行套利获利。"},{"en":"Currency arbitrage can happen when exchange rates are slightly different in different markets.","zh":"当不同市场的汇率略有差异时，就可能出现外汇套利。"}]},{"partOfSpeech":"v.","definition":{"en":"To use arbitrage (to profit from price differences across markets).","zh":"进行套利；利用不同市场之间的价差获利。"},"examples":[{"en":"Some firms arbitrage between futures and spot markets.","zh":"一些公司在期货市场与现货市场之间进行套利。"},{"en":"They tried to arbitrage the same stock listed in two countries.","zh":"他们试图对在两个国家上市的同一只股票进行套利。"}]}],"synonyms":["riskless profit (informal idea)","price discrepancy trading","cross-market trading"],"phonetic":"/ˈɑr.bəˌtrɑʒ/","extraExplanation":["“arbitrage”常见于金融与经济新闻中。经典例子是“同一资产在不同市场的价格短暂不一致”，套利者迅速买低卖高，理论上会推动价格回到一致，因此也被视为一种让市场更有效率的力量。","在实际操作中，套利并非完全“无风险”：可能遇到交易成本、延迟（价格变化太快）、资金限制、监管限制或市场流动性不足等问题。","常见搭配：arbitrage opportunity（套利机会）, arbitrageur（套利者/套利交易员）, triangular arbitrage（三角套利：多种货币之间循环兑换获利）。"]}
{"word":"arbitrager","summary":{"en":"An arbitrager is someone who tries to profit from price differences across markets (arbitrage).","zh":"Arbitrager 指“套利者”，通过不同市场/相关资产的价差进行套利获利的人或机构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or firm that does arbitrage (tries to profit from price differences for the same asset in different markets, or from related price mismatches).","zh":"套利者；进行套利的个人或机构（利用同一资产在不同市场的价差，或相关价格不一致来获利）。"},"examples":[{"en":"In fast markets, an arbitrager can buy the stock in one exchange and sell it on another within seconds.","zh":"在快速波动的市场里，套利者可以在一个交易所买入股票，并在几秒内在另一个交易所卖出。"},{"en":"Some critics say high-frequency firms act like arbitragers, earning tiny profits on many trades.","zh":"一些批评者认为，高频交易公司像套利者一样，通过大量交易赚取很小的利润。"},{"en":"After fees and taxes, the arbitrager’s “risk-free” profit may disappear.","zh":"扣除手续费和税费后，套利者所谓的“无风险”利润可能会消失。"}]}],"synonyms":["arbitrageur","trader (in arbitrage)","market participant"],"phonetic":"/ˈɑːr.bɪˌtrɑː.ʒɚ/","extraExplanation":["“arbitrager”来自“arbitrage（套利）”。在金融语境中，它并不表示“仲裁者（arbiter）”，而是强调用交易把价格差“抹平”。","经典的例子是“跨市场套利”：同一只股票/加密货币在两个平台价格不同，套利者低买高卖；也有“衍生品套利”，例如利用期货与现货、期权与标的之间的定价偏差。","现实中套利并非总是无风险：滑点、成交速度、资金占用、交易限制、借券成本与监管规则都可能让套利失败或利润变小。"]}
{"word":"arbitragers","summary":{"en":"Arbitragers are people who profit from price differences by buying and selling across markets.","zh":"Arbitragers 指通过跨市场买卖利用价差获利的套利者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who do arbitrage—buying and selling (often in different markets) to profit from small price differences, usually in finance.","zh":"套利者：利用不同市场或不同产品之间的微小价差进行买卖以获利的人，常见于金融领域。"},"examples":[{"en":"Arbitragers quickly bought the undervalued stock and sold it where the price was higher.","zh":"套利者迅速买入被低估的股票，并在价格更高的市场卖出。"},{"en":"In efficient markets, arbitragers help prices move closer to fair value.","zh":"在有效市场中，套利者有助于让价格更接近合理价值。"}]}],"synonyms":["arbitrageurs","traders","market makers"],"phonetic":"/ˌɑr.bəˈtrɑː.ʒɚz/","extraExplanation":["“Arbitragers”是“arbitrager”的复数。核心概念是“arbitrage（套利）”。在金融语境里，套利并不等同于投机：套利通常强调利用价格不一致并尽量降低风险，但现实中也可能存在执行风险（例如交易延迟、手续费、汇率波动等）。","常见搭配：arbitragers step in（套利者介入）、arbitragers exploit price gaps（利用价差）、arbitragers drive convergence（推动价格收敛）。"]}
{"word":"arbitrages","summary":{"en":"Arbitrages are instances of arbitrage—profit opportunities from price differences between markets; it can also be the verb “arbitrages,” meaning “does arbitrage.”","zh":"arbitrages 是 arbitrage 的复数，指“套利”机会/行为；也可作动词第三人称单数，表示“进行套利”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) opportunities or instances of buying and selling the same (or closely related) asset in different markets to profit from price differences, often with low risk.","zh":"（复数）“套利”机会或行为：在不同市场买卖同一（或高度相关的）资产，利用价格差获利，通常风险较低。"},"examples":[{"en":"High-frequency traders look for small arbitrages across exchanges.","zh":"高频交易者会在不同交易所之间寻找微小的套利机会。"},{"en":"As news spread, the arbitrages disappeared quickly.","zh":"消息一传开，这些套利机会很快就消失了。"}]},{"partOfSpeech":"v.","definition":{"en":"(third-person singular) to perform arbitrage; to profit by exploiting price differences between markets.","zh":"（第三人称单数）进行套利；利用不同市场的价格差来获利。"},"examples":[{"en":"The firm arbitrages price gaps between U.S. and European markets.","zh":"这家公司在美国和欧洲市场之间的价差中进行套利。"},{"en":"When demand spikes, traders arbitrages the difference within minutes.","zh":"当需求激增时，交易者会在几分钟内套利掉这种差价。"}]}],"synonyms":["price discrepancy trading","riskless (or near-riskless) trading","spread trading (related)","cross-market trading"],"phonetic":"/ˈɑːrbətrɑːʒ/","extraExplanation":["“arbitrage”常用于金融、外汇、期货与加密货币等领域。理论上套利接近“低风险”，但现实中仍可能受交易成本、延迟、流动性不足、政策限制等影响而产生风险。","词源来自法语 *arbitrage*（裁决、仲裁），在金融语境里引申为“通过规则与市场差异来获得确定性收益”的做法。"]}
{"word":"arbitrageur","summary":{"en":"An arbitrageur is someone who profits from price differences of the same asset across markets.","zh":"arbitrageur 指“套利者”，通过同一资产在不同市场的价差获利的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who practices arbitrage—trying to profit from small price differences for the same (or equivalent) asset in different markets.","zh":"从事“套利”的人——利用同一（或等价）资产在不同市场的细微价差来获利。"},"examples":[{"en":"The arbitrageur bought the stock in New York and sold it in London within seconds.","zh":"套利者在纽约买入该股票，并在几秒内于伦敦卖出。"},{"en":"In efficient markets, arbitrageurs help push prices back into alignment.","zh":"在有效市场中，套利者会帮助推动价格重新趋于一致。"}]}],"synonyms":["arbitrager","trader (context-dependent)","market maker (sometimes related)"],"phonetic":"/ˌɑɹbɪˈtɹɑʒɚ/","extraExplanation":["“arbitrageur”常见于金融新闻与投资语境，尤其与股票、外汇、期货、加密货币等市场相关。它强调的是“跨市场/跨交易所”的价差机会。","词源上与法语“arbitrage”有关；英语里也常见另一种拼写“arbitrager”（较少用），但“arbitrageur”更常见、更正式。","在现实中，套利并非“无风险赚钱”：会受到交易成本、滑点、延迟、额度限制与监管规则等影响。"]}
{"word":"arbitrageurs","summary":{"en":"Arbitrageurs are traders who profit from price differences across markets by buying low in one place and selling high in another.","zh":"Arbitrageurs 指通过利用不同市场的价差，在一处低买、另一处高卖来获利的套利者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who do arbitrage: they try to profit from small price differences for the same (or very similar) asset in different markets, often by buying in one place and selling in another quickly.","zh":"从事“套利”的人：他们利用同一（或非常相似）资产在不同市场中的微小价差获利，通常通过在一处买入、在另一处迅速卖出。"},"examples":[{"en":"Arbitrageurs bought the stock in London and sold it in New York to capture the price difference.","zh":"套利者在伦敦买入这只股票，再在纽约卖出，以获取价差。"},{"en":"In efficient markets, arbitrageurs tend to reduce mispricing over time.","zh":"在有效市场中，套利者往往会随着时间推移减少定价偏差。"}]}],"synonyms":["arbitragers","arbitrage traders","market arbitrageurs","spread traders"],"phonetic":"/ˌɑːr.bɪ.træˈʒɝːz/","extraExplanation":["“arbitrageur”来自法语词源，常用于金融与投资语境。它的复数可以写作 arbitrageurs（更常见）或 arbitrageurs 的读音因口音略有差异，但含义相同。","在现实中，套利并不一定“无风险”：会受到交易成本、执行速度、汇率波动、监管限制、以及价格迅速变化等因素影响。"]}
{"word":"arbitragist","summary":{"en":"An arbitrage trader; someone who profits from price differences between markets.","zh":"套利交易者；利用不同市场价格差获利的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who makes profit by arbitrage—buying and selling the same (or equivalent) asset in different markets to take advantage of a price difference.","zh":"套利者：通过“套利”获利的人——在不同市场买入并卖出同一（或等价）资产，利用价格差赚钱。"},"examples":[{"en":"The arbitrაგist bought gold in one market and sold it in another where the price was slightly higher.","zh":"套利者在一个市场买入黄金，然后在价格略高的另一个市场卖出。"},{"en":"In theory, arbitrage by arbitrageists helps keep prices consistent across markets.","zh":"理论上，套利者的套利行为有助于让不同市场的价格更一致。"}]}],"synonyms":["arbitrageur","trader","market operator"],"phonetic":"/ˌɑːr.bəˈtrɑː.ʒɪst/","extraExplanation":["“arbitragist”常见于金融新闻与学术写作，和更常用的“arbitrageur”意思相同，都是“套利者”。在英语里两者都可用，但“arbitrageur”更常见一些。","发音上，词根来自法语“arbitrage（仲裁/套利）”，在金融语境中指利用市场定价差的交易策略，并不等同于“arbitrator（仲裁员）”。"]}
{"word":"arbitral","summary":{"en":"“Arbitral” means “related to arbitration,” especially in legal or business disputes.","zh":"“arbitral”表示“与仲裁有关的”，多用于法律或商业争议语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to arbitration: a process where a neutral third party (an arbitrator or panel) makes a decision to settle a dispute, usually outside of court.","zh":"与“仲裁”有关的：指由中立第三方（仲裁员或仲裁庭）作出决定、通常在法庭之外解决争议的程序。"},"examples":[{"en":"The company challenged the arbitral award in court.","zh":"该公司在法院对仲裁裁决提出了挑战。"},{"en":"Both sides agreed to follow the arbitral procedure in their contract.","zh":"双方在合同中同意遵循仲裁程序。"}]}],"synonyms":["arbitration-related","arbitrative","judicial (context-dependent)"],"phonetic":"/ˈɑɹbɪtɹəl/","extraExplanation":["“arbitral”常见于法律与商事语境，搭配非常固定：arbitral award（仲裁裁决）、arbitral tribunal（仲裁庭）、arbitral proceedings（仲裁程序）。日常口语更常说 arbitration / arbitrator，而不是 arbitral。","词源上与拉丁语“arbiter”（裁决者、仲裁人）有关；在国际商务中，仲裁常被用来避免跨国诉讼的复杂与高成本。"]}
{"word":"arbitrament","summary":{"en":"A formal word meaning an arbitration decision or a final judgment that settles a dispute.","zh":"正式用词，指仲裁裁决，或能了结争端的最终裁断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A decision or judgment made by an arbitrator (a neutral person) to settle a dispute; the award or ruling in arbitration.","zh":"（仲裁人作出的）裁决；仲裁结果（用于解决纠纷的决定）。"},"examples":[{"en":"Both companies agreed to accept the arbitrament and end the lawsuit.","zh":"两家公司同意接受仲裁裁决并结束诉讼。"},{"en":"The arbitrament granted damages to the injured party.","zh":"该仲裁裁决判给受害方损害赔偿。"}]},{"partOfSpeech":"n.","definition":{"en":"(More formal or literary) A final decision or outcome that settles a disagreement.","zh":"（更正式/文学用法）最终裁断；终局性的决定（用来平息争端）。"},"examples":[{"en":"In the end, time was the only arbitrament between the two versions of the story.","zh":"最终，时间成了两种说法之间唯一的裁断。"},{"en":"She treated the judge’s words as the arbitrament of the matter.","zh":"她把法官的话当作此事的最终裁断。"}]}],"synonyms":["arbitration award","award","ruling","decision","judgment","verdict"],"phonetic":"/ɑrˈbɪtrəmənt/","extraExplanation":["“Arbitrament”语体非常正式，日常英语里更常用“arbitration decision / arbitration award / ruling / decision”。","词源来自拉丁语“arbitrare”（判断、裁定），与“arbitrator（仲裁人）”“arbitrate（仲裁）”同源。"]}
{"word":"arbitraments","summary":{"en":"“Arbitraments” is the plural of “arbitrament,” meaning an arbitration decision or a final judgment that settles a dispute.","zh":"“arbitraments”是“arbitrament”的复数，表示（仲裁）裁决，或用于正式/较旧文体中的最终裁断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A decision or judgment made by an arbitrator (a person chosen to settle a dispute), or the process of settling a dispute by arbitration.","zh":"（由仲裁者作出的）裁决、判决；或（通过仲裁）解决争议的过程。"},"examples":[{"en":"The two companies agreed to accept the arbitrament of an independent panel.","zh":"两家公司同意接受独立小组的仲裁裁决。"},{"en":"They chose arbitrament instead of going to court.","zh":"他们选择仲裁来解决问题，而不是上法庭。"}]},{"partOfSpeech":"n.","definition":{"en":"A final choice or outcome that settles a disagreement, especially in formal or old-fashioned writing.","zh":"（尤用于正式或较旧的文体中）用来了结争议的最终决定或结果。"},"examples":[{"en":"For them, peace was the only possible arbitrament.","zh":"对他们来说，和平是唯一可能的最终了结方式。"},{"en":"The arbitrament of history is often harsh.","zh":"历史的最终评判往往很严苛。"}]}],"synonyms":["arbitration","award","decision","judgment","ruling","verdict"],"phonetic":"/ɑrˈbɪtrəmənt/","extraExplanation":["“arbitraments”通常是名词“arbitrament”的复数形式，意思是“仲裁裁决/裁断”。这个词在现代日常英语里比较少见，更常用的是“arbitration”（仲裁）或“award/decision”（裁决/决定）。","词源上与“arbitrate / arbiter”（仲裁/仲裁者）同源，带有“由第三方作出裁断”的含义。","文学或较正式的表达里，有时会用“the arbitrament of X”（X 的最终裁断/评判），例如“the arbitrament of history”（历史的裁断）。"]}
{"word":"arbitraries","summary":{"en":"“Arbitraries” means arbitrary things or decisions—unreasoned, chosen by personal preference.","zh":"“Arbitraries”指各种武断、随意的事物或决定——缺乏明确理由，更多出于个人偏好。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) arbitrary things, rules, or decisions—chosen by personal preference rather than by a clear reason, system, or law.","zh":"（复数名词）武断/随意的事物、规则或决定——不是基于明确理由、制度或法律，而是出于个人偏好。"},"examples":[{"en":"The policy was full of arbitraries that confused both staff and customers.","zh":"这项政策里充满了各种随意规定，让员工和顾客都很困惑。"},{"en":"We need a fair process, not a list of arbitraries made at the last minute.","zh":"我们需要一个公平的流程，而不是最后一刻随便定出来的一堆规定。"}]}],"synonyms":["arbitrary decisions","random choices","caprices","whims"],"phonetic":"/ˈɑr.bəˌtrer.iz/","extraExplanation":["“arbitraries”是“arbitrary”的名词复数用法，常见于较正式的写作里，意思是“随意之处/武断之处”。日常口语里更常说：“arbitrary rules/decisions”（随意的规则/决定）。","注意不要和“arbitrators”（仲裁员）混淆：arbitrary（随意的）≠ arbitrator（仲裁员）。"]}
{"word":"arbitrarily","summary":{"en":"Arbitrarily means “without a clear reason or rule,” often suggesting something unfair or based on personal choice.","zh":"arbitrarily 意为“没有明确理由或规则地（随意/武断地）”，常暗示缺乏依据、可能不公平。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is based on personal choice or preference rather than a clear rule, reason, or plan.","zh":"（做事）随意地；武断地；基于个人喜好而非明确规则、理由或计划地。"},"examples":[{"en":"The teacher didn’t pick names arbitrarily; she used a random number app.","zh":"老师不是随便点名的；她用了随机号码应用。"},{"en":"If you change the rules arbitrarily, people will feel it’s unfair.","zh":"如果你随意更改规则，人们会觉得不公平。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that is fixed by someone’s decision, not by nature or an objective connection.","zh":"（规定/标准）任意设定的；并非由客观联系或自然规律决定的。"},"examples":[{"en":"The cutoff score is somewhat arbitrarily set at 70.","zh":"及格线在某种程度上被任意定为70分。"},{"en":"The categories can seem arbitrarily chosen, not based on real differences.","zh":"这些分类看起来像是随意选的，并非基于真实差异。"}]}],"synonyms":["randomly","capriciously","unreasonably","at will"],"phonetic":"/ˌɑr.bəˈtrer.ə.li/","extraExplanation":["“arbitrarily”常带负面语气，暗示“缺乏依据、让人感觉不公”。想表达中性“随机”时，英语更常用“randomly”。","词源提示：来自拉丁语“arbiter”（裁判、仲裁者）。所以它常与“权力决定、武断裁量”有关：例如“arbitrary decision（武断的决定）”。"]}
{"word":"arbitrariness","summary":{"en":"Arbitrariness means being decided by personal choice rather than clear rules; in linguistics, it means word forms usually have no natural link to meanings.","zh":"arbitrariness 指“任意/武断、缺乏明确规则”；在语言学中指“词形与词义通常没有天然必然联系，主要靠约定”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being based on personal choice or chance rather than clear rules, logic, or fairness","zh":"任意性；武断性（指基于个人喜好、偶然或权力，而非明确规则、逻辑或公平）"},"examples":[{"en":"People criticized the arbitrariness of the decision because no reasons were given.","zh":"人们批评这个决定太武断，因为没有给出任何理由。"},{"en":"To reduce arbitrariness, the school published clear grading criteria.","zh":"为了减少任意性，学校公布了清晰的评分标准。"}]},{"partOfSpeech":"n.","definition":{"en":"(linguistics) the idea that there is no natural connection between a word’s sound/form and its meaning; the link is created by social agreement","zh":"（语言学）任意性：词的语音/形式与意义之间没有天然必然联系，二者的联系来自社会约定"},"examples":[{"en":"The arbitrariness of the word “dog” is clear because other languages use different sounds for the same animal.","zh":"“dog”这个词的任意性很明显，因为其他语言用不同的声音来表示同一种动物。"},{"en":"Arbitrariness helps explain why you usually must memorize vocabulary instead of ‘guessing’ it from the sound.","zh":"任意性解释了为什么词汇通常需要记忆，而不能只靠听声音来“猜”意思。"}]}],"synonyms":["randomness","capriciousness","unpredictability","subjectivity","discretion"],"phonetic":"/ˌɑrˌbɪˈtrɛriːnəs/","extraExplanation":["词源上来自“arbitrary（任意的、由个人决定的）+ -ness（名词后缀）”。日常语境里常带有负面含义：暗示“不透明、不公平、缺乏标准”。","在语言学中，“任意性”常与“象似性/拟象性（iconicity）”对比：有些词（如拟声词 bang, meow）声音与意义更相近，但总体上语言符号仍以任意性为主。"]}
{"word":"arbitrarinesses","summary":{"en":"“Arbitrarinesses” is the plural of “arbitrariness,” meaning kinds or instances of being ruleless/subjective (often unfair), and in linguistics, the non-natural link between word form and meaning.","zh":"“arbitrarinesses”是“arbitrariness”的复数，指多种/多处“随意、缺乏规则（常显得不公平）的任意性”；在语言学中也指“词形与词义联系多为约定俗成的任意性”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being decided by personal choice or chance rather than by a clear rule, reason, or system; the fact that something seems unfairly random.","zh":"（决定或规则）缺乏明确依据、带有随意性的性质；（常含）不公平的任意性。"},"examples":[{"en":"People complained about the arbitrariness of the new rules.","zh":"人们抱怨新规定太随意、缺乏明确依据。"},{"en":"The judge tried to reduce arbitrariness by following consistent guidelines.","zh":"法官通过遵循一致的指导原则来减少任意性。"}]},{"partOfSpeech":"n.","definition":{"en":"In linguistics: the idea that the connection between a word’s sound/form and its meaning is mostly not natural but agreed on by a language community.","zh":"（语言学）任意性：词的语音/形式与意义之间的联系多半不是天然必然的，而是语言共同体约定形成的。"},"examples":[{"en":"One example of arbitrariness is that there’s nothing about the sound of “dog” that naturally means a dog.","zh":"任意性的一个例子是：单词“dog”的声音本身并不“自然地”就表示狗。"},{"en":"Different languages show arbitrariness because the same animal has different names around the world.","zh":"不同语言体现任意性：同一种动物在世界各地有不同的叫法。"}]}],"synonyms":["randomness","capriciousness","subjectivity","whim","unpredictability"],"phonetic":"/ˌɑːr.bəˈrɛr.i.nəs.ɪz/","extraExplanation":["“arbitrarinesses”是名词复数，单数是“arbitrariness”。日常写作中更常见单数，用复数通常是在比较“多种不同的随意之处/任意性表现”。","词源提示：arbitrary（任意的）来自拉丁语“arbiter”（裁判/仲裁者），引申出“由某人自行裁定→带有主观随意”的含义。","语言学里常提到的“符号的任意性”（the arbitrariness of the sign）与索绪尔（Saussure）的观点有关：词形与词义多是约定俗成；但也有“拟声词”等相对不那么任意的例外。"]}
{"word":"arbitrarius","summary":{"en":"A Latin adjective meaning “arbitrary; based on an arbiter’s discretion.”","zh":"拉丁语形容词，意为“任意的；基于仲裁者/法官自由裁量的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Latin, adjective) decided by an arbiter or judge; depending on someone’s will or discretion rather than fixed rules (i.e., “arbitrary”).","zh":"（拉丁语，形容词）由仲裁者/法官裁定的；取决于个人意志或自由裁量、而非固定规则的（即“任意的”）。"},"examples":[{"en":"In some Roman legal texts, an arbitrarius iudex could decide a case using discretion.","zh":"在一些罗马法文献中，arbitrarius iudex（自由裁量的法官）可以根据酌情判断来裁决案件。"},{"en":"The writer criticizes arbitrarius punishment—penalties chosen by will, not by law.","zh":"作者批评 arbitrarius 的惩罚——惩罚取决于个人意志，而不是法律规定。"}]}],"synonyms":["arbitrary","discretionary","dependent on will"],"phonetic":"/ˌɑr.bəˈtrɛr.i.əs/","extraExplanation":["“arbitrarius”来自拉丁语“arbiter”（裁决者、仲裁者）。它和英语里的“arbitrary（任意的）”“arbitration（仲裁）”“arbiter（仲裁人/裁决者）”是同源词。","在法学语境里，它常带有“基于自由裁量”的中性含义；在日常英语里，“arbitrary”往往带有负面色彩，强调“不讲理、没根据”。"]}
{"word":"arbitrary","summary":{"en":"Arbitrary usually means “based on personal choice, not a clear rule,” often implying unfairness; in technical contexts it can mean “any/randomly chosen.”","zh":"arbitrary 通常指“没有明确依据、凭个人决定（常显得不公平）”；在数学/技术语境中也可指“任意/随机选取”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Decided by personal choice or preference, not based on a clear rule, reason, or system (often suggesting it may be unfair).","zh":"任意的；武断的；由个人喜好决定的（常含“缺乏依据、可能不公平”的意思）。"},"examples":[{"en":"The teacher said the grading was not arbitrary; it followed a clear rubric.","zh":"老师说评分不是任意的；它遵循清晰的评分标准。"},{"en":"People protested against arbitrary arrests.","zh":"人们抗议任意逮捕。"}]},{"partOfSpeech":"adj.","definition":{"en":"Random or chosen without any particular pattern, especially in math or computing.","zh":"随机的；随意选取的（尤用于数学或计算机语境）。"},"examples":[{"en":"Pick an arbitrary starting point and test the method.","zh":"随便选一个起点，然后测试这个方法。"},{"en":"In programming, you can use an arbitrary value as a placeholder.","zh":"在编程中，你可以用一个随意的值作为占位符。"}]}],"synonyms":["random","capricious","unjustified","groundless","haphazard"],"phonetic":"/ˈɑːr.bəˌtrer.i/","extraExplanation":["“arbitrary”在日常语境里常带负面色彩，强调“缺乏合理依据、武断”，比如 arbitrary rule（武断的规定）。但在数学/技术语境里更中性，表示“任取、随便选”，例如 an arbitrary constant（任意常数）。判断褒贬主要看上下文。","常见搭配：arbitrary decision（武断决定）、arbitrary power（专断权力）、arbitrary limit（随意设定的限制）、arbitrary choice（任意选择）。"]}
{"word":"arbitrate","summary":{"en":"Arbitrate means to settle a dispute by acting as a neutral third party and making a decision.","zh":"Arbitrate 指作为中立第三方通过仲裁来解决争端并作出裁决。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to settle a disagreement between two sides by listening to both and making a fair decision (often as a neutral third person)","zh":"（作为中立第三方）听取双方意见并作出裁决，以解决争端（常用于正式场合）"},"examples":[{"en":"The two companies asked an independent expert to arbitrate their contract dispute.","zh":"两家公司请一位独立专家来仲裁他们的合同纠纷。"},{"en":"If we can’t agree, we’ll let the committee arbitrate.","zh":"如果我们无法达成一致，就让委员会来仲裁。"}]},{"partOfSpeech":"v.","definition":{"en":"to act as an arbitrator in an official process (such as labor or business arbitration)","zh":"担任仲裁员；在正式仲裁程序中进行裁决"},"examples":[{"en":"She has arbitrated many labor-management conflicts.","zh":"她仲裁过许多劳资冲突。"},{"en":"He was invited to arbitrate at an international trade hearing.","zh":"他受邀在一次国际贸易听证中担任仲裁。"}]}],"synonyms":["mediate","judge","adjudicate","resolve","settle"],"phonetic":"/ˈɑːr.bə.treɪt/","extraExplanation":["“arbitrate”常见于法律与商业语境，尤其是“arbitration（仲裁）”。仲裁通常比上法庭更快、更保密；有时裁决具有约束力（binding arbitration），也可能不具约束力（non-binding）。","词源上与“arbiter（仲裁者/裁决者）”同源，核心含义是“由第三方作出判断”。日常口语里也可用来表示“当和事佬并作决定”，但语气偏正式。"]}
{"word":"arbitrated","summary":{"en":"“Arbitrated” means a dispute was settled (or a case was decided) by a neutral arbitrator, usually as an alternative to going to court.","zh":"“Arbitrated”表示争议由中立的仲裁员作出裁决而得到解决，通常作为诉讼之外的替代方式。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle of “arbitrate”) to settle a dispute officially by having a neutral third person (an arbitrator) listen to both sides and make a decision.","zh":"（arbitrate 的过去式/过去分词）指由中立的第三方（仲裁员）听取双方意见后，作出正式裁决来解决争议。"},"examples":[{"en":"The labor dispute was arbitrated by an independent panel.","zh":"这起劳资纠纷由一个独立仲裁小组进行了仲裁。"},{"en":"They arbitrated the contract disagreement instead of going to court.","zh":"他们选择通过仲裁解决合同争议，而不是上法庭。"}]},{"partOfSpeech":"vt.","definition":{"en":"to act as an arbitrator and make a judgment between two sides.","zh":"担任仲裁员，在双方之间作出裁决。"},"examples":[{"en":"She arbitrated between the two companies and issued a final decision.","zh":"她在两家公司之间担任仲裁员，并作出了最终裁决。"},{"en":"He arbitrated the case fairly and explained his reasoning clearly.","zh":"他公正地仲裁了此案，并清楚说明了理由。"}]}],"synonyms":["settled","adjudicated","mediated","resolved","ruled on"],"phonetic":"/ˈɑːr.bəˌtreɪ.tɪd/","extraExplanation":["“仲裁（arbitration）”常见于商业合同、劳动争议、体育赛事等场景。它通常比诉讼更快、更保密；有些仲裁裁决在法律上具有约束力（binding arbitration），当事人需要遵守。","词形提示：arbitrated = arbitrate（动词原形）+ -ed。常见搭配：arbitrated dispute（仲裁纠纷）、arbitrated settlement（仲裁和解/裁决结果）。"]}
{"word":"arbitrates","summary":{"en":"“Arbitrates” means “acts as a neutral decision-maker to settle a dispute,” especially in legal or business contexts.","zh":"“arbitrates”意为“作为中立方对争议作出裁决”，常用于法律或商业语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to act as a neutral judge and decide a dispute (especially in a legal or business setting); third-person singular form of “arbitrate.”","zh":"担任仲裁者并对争议作出裁决（尤指法律或商业纠纷）；为“arbitrate”的第三人称单数形式。"},"examples":[{"en":"In this case, the arbitrator arbitrates disagreements between the company and the union.","zh":"在这个案件中，仲裁员对公司与工会之间的分歧作出裁决。"},{"en":"If the two sides cannot agree, the panel arbitrates the contract dispute.","zh":"如果双方无法达成一致，仲裁小组将对合同纠纷进行仲裁裁决。"}]},{"partOfSpeech":"v.","definition":{"en":"to decide between options or viewpoints; to settle something by making a judgment.","zh":"在不同选择或观点之间作出判断；裁定并解决某事。"},"examples":[{"en":"She arbitrates between two teams that both want the same meeting room.","zh":"她在两个都想用同一间会议室的团队之间作出协调与裁定。"},{"en":"A good manager arbitrates competing priorities fairly.","zh":"一位优秀的管理者会公平地裁定并平衡相互竞争的优先事项。"}]}],"synonyms":["adjudicates","mediates","settles","decides"],"phonetic":"/ˈɑɹbəˌtɹeɪts/","extraExplanation":["“arbitrate”常见于较正式的语境，尤其是法律与商业领域的“仲裁（arbitration）”。仲裁通常由双方事先同意：发生纠纷时不走法院诉讼，而交由仲裁员/仲裁机构裁决。","词形提示：arbitrates = he/she/it arbitrates（现在时第三人称单数）；对应的名词是 arbitrator（仲裁员）、arbitration（仲裁）。"]}
{"word":"arbitrating","summary":{"en":"Arbitrating means settling a dispute by acting as (or using) an arbitrator, especially in business or legal situations.","zh":"Arbitrating 指通过仲裁来解决争议：由仲裁人进行裁决或使用仲裁程序，常见于商业和法律情境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"serving as an arbitrator; listening to both sides of a dispute and making a decision (often in a legal or business context)","zh":"担任仲裁人；听取争议双方意见并作出裁决（常用于法律或商业语境）"},"examples":[{"en":"She is arbitrating the contract dispute between the company and the supplier.","zh":"她正在仲裁这家公司与供应商之间的合同纠纷。"},{"en":"The union asked a neutral expert to begin arbitrating the disagreement.","zh":"工会要求一位中立的专家开始仲裁这场争议。"}]},{"partOfSpeech":"v.","definition":{"en":"taking part in arbitration; trying to settle a disagreement by a formal process instead of going to court","zh":"参与仲裁程序；通过正式程序解决争议，而不是上法庭"},"examples":[{"en":"They agreed to settle the issue by arbitrating rather than filing a lawsuit.","zh":"他们同意通过仲裁来解决问题，而不是提起诉讼。"},{"en":"Arbitrating can be faster and more private than going to court.","zh":"仲裁通常比上法庭更快，也更具隐私性。"}]}],"synonyms":["mediating","adjudicating","settling","resolving","refereeing"],"phonetic":"/ˈɑɹbɪˌtɹeɪtɪŋ/","extraExplanation":["“arbitrating”来自动词 arbitrate（仲裁）。在很多合同里会出现 arbitration clause（仲裁条款），意思是发生争议时先（或必须）走仲裁程序。","仲裁（arbitration）通常由双方同意选择的中立第三方（arbitrator）作出裁决（award）。在不少国家/地区，仲裁裁决往往具有法律效力，但程序比诉讼更灵活。"]}
{"word":"arbitration","summary":{"en":"Arbitration is a formal way to resolve disputes by having a neutral person decide, often instead of going to court.","zh":"Arbitration 指通过中立第三方作出裁决来解决争议的正式方式，常用于替代诉讼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a formal process for solving a disagreement by asking a neutral third person (an arbitrator) to make a decision, often outside of court","zh":"仲裁：通过请中立的第三方（仲裁员）作出裁决来解决争议的正式程序，通常在法院之外进行"},"examples":[{"en":"The contract requires arbitration if the two sides cannot agree.","zh":"合同规定如果双方无法达成一致，就要进行仲裁。"},{"en":"They chose arbitration to avoid a long court case.","zh":"他们选择仲裁来避免漫长的诉讼。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of judging or settling a dispute between people or groups","zh":"裁决；调解（争端的裁定或解决行为）"},"examples":[{"en":"His arbitration brought both teams to a final agreement.","zh":"他的仲裁使两队最终达成一致。"}]}],"synonyms":["mediation (similar but usually non-decisive)","adjudication","settlement (general)","dispute resolution"],"phonetic":"/ˌɑr.bəˈtreɪ.ʃən/","extraExplanation":["在商业与劳动关系中，“arbitration”很常见：例如雇主与员工、公司与客户发生纠纷时，可能会用仲裁来代替上法庭。","常见搭配：binding arbitration（具有约束力的仲裁，裁决通常必须遵守） vs. non-binding arbitration（不具约束力，双方可选择是否接受）。","词源提示：arbitration 来自拉丁语词根 *arbiter*（裁判者、仲裁者）。在英语里与之相关的词还有 arbitrator（仲裁员）、arbitrate（进行仲裁）。"]}
{"word":"arbitration-friendly","summary":{"en":"Describes laws, places, or policies that encourage and support resolving disputes through arbitration instead of court.","zh":"形容法律、地区或政策鼓励并支持用仲裁而非诉讼解决纠纷。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Supportive of resolving disputes through arbitration (a private legal process) rather than going to court; designed to make arbitration easier or more likely.","zh":"支持通过仲裁（私下的争议解决程序）而不是诉讼来解决纠纷的；旨在让仲裁更容易进行或更常被采用的。"},"examples":[{"en":"The company chose an arbitration-friendly contract to avoid long court battles.","zh":"公司选择了一份对仲裁友好的合同，以避免漫长的诉讼。"},{"en":"Singapore is often described as an arbitration-friendly place for international business disputes.","zh":"新加坡常被形容为在国际商事争议方面“对仲裁友好”的地区。"},{"en":"An arbitration-friendly policy can reduce legal costs and speed up decisions.","zh":"对仲裁友好的政策可以降低法律成本并加快裁决。"}]}],"synonyms":["pro-arbitration","arbitration-supportive","arbitration-oriented","arbitration-favorable"],"phonetic":"/ɑrˌbɪˈtreɪʃən ˈfrɛndli/","extraExplanation":["“arbitration-friendly”常用于法律与商业语境，修饰国家/地区（jurisdiction）、法院、法律制度、合同条款或公司政策。意思通常是：法律支持仲裁协议的效力、法院较少干预仲裁程序、裁决更容易被承认与执行。","写合同或谈判时常见搭配：arbitration-friendly jurisdiction（对仲裁友好的司法辖区）、arbitration-friendly clause（对仲裁友好的条款）。注意它并不等于“对某一方更有利”，而是指整体制度更支持仲裁这种机制。"]}
{"word":"arbitration-related","summary":{"en":"Arbitration-related means connected with arbitration (resolving disputes outside of court).","zh":"arbitration-related 意为“与仲裁有关的”，常用于合同、法律与商业纠纷语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with arbitration (a formal process where a neutral person or panel decides a dispute outside of court).","zh":"与仲裁有关的（仲裁指由中立的仲裁员或仲裁庭在法庭外对纠纷作出裁决的正式程序）。"},"examples":[{"en":"All arbitration-related documents must be submitted by Friday.","zh":"所有与仲裁有关的文件必须在周五前提交。"},{"en":"The company hired an attorney with arbitration-related experience.","zh":"公司聘请了一位有仲裁相关经验的律师。"},{"en":"Arbitration-related costs can include filing fees and the arbitrator’s fees.","zh":"仲裁相关费用可能包括立案费和仲裁员费用。"}]}],"synonyms":["arbitration-connected","arbitration-associated","arbitration-specific","ADR-related"],"phonetic":"/ˌɑr.bəˈtreɪ.ʃən rɪˈleɪ.tɪd/","extraExplanation":["“arbitration-related”是由名词“arbitration（仲裁）+ related（相关的）”构成的复合形容词，常用于法律、合同与商业语境。","连字符（-）常见于放在名词前作定语时：arbitration-related costs / issues。若放在名词后作表语，有时可不加连字符：The costs are arbitration related（但加连字符也常见）。"]}
{"word":"arbitrational","summary":{"en":"“Arbitrational” means “related to arbitration,” especially in legal or contract contexts.","zh":"“arbitrational”意为“与仲裁有关的”，多用于法律或合同语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to arbitration (a process where a neutral third party makes a decision to settle a dispute, often outside of court).","zh":"与仲裁有关的（仲裁是由中立第三方作出决定来解决争议的程序，通常在法庭之外进行）。"},"examples":[{"en":"The contract includes an arbitrational clause for resolving disputes.","zh":"该合同包含一项用于解决争议的仲裁条款。"},{"en":"They faced arbitrational proceedings after negotiations failed.","zh":"谈判失败后，他们进入了仲裁程序。"}]}],"synonyms":["arbitral","arbitration-related","arbitrative"],"phonetic":"/ˌɑɹbəˈtɹeɪʃənəl/","extraExplanation":["“arbitrational”在日常英语中不算常见，更常见的是“arbitration”（名词）和“arbitral”（形容词，如：arbitral tribunal 仲裁庭，arbitral award 仲裁裁决）。“arbitrational”也可用，但在法律/合同语境下你更常看到“arbitral”。"]}
{"word":"arbitrationist","summary":{"en":"An arbitrationist is someone who supports arbitration to settle disputes (and less commonly, someone who acts as an arbitrator).","zh":"arbitrationist 指主张用仲裁解决争端的人；较少见时也可指仲裁者本身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who supports or promotes arbitration (using a neutral third party to settle a dispute), especially in labor or political conflicts","zh":"主张仲裁的人；支持用仲裁（由中立第三方裁决）来解决争端的人（尤指劳资或政治冲突）"},"examples":[{"en":"The arbitrationist argued that strikes should be a last resort and that disputes should go to arbitration first.","zh":"这位主张仲裁的人认为罢工应是最后手段，争端应先交由仲裁处理。"},{"en":"Many arbitrationists in the labor movement pushed for neutral panels to prevent long work stoppages.","zh":"劳工运动中许多主张仲裁的人推动设立中立委员会，以避免长期停工。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a person who serves as an arbitrator; someone who decides a dispute through arbitration","zh":"（较少见）仲裁者；担任仲裁裁决的人"},"examples":[{"en":"In this case, the arbitrationist issued a written decision after hearing both sides.","zh":"在这个案件中，仲裁者听取双方陈述后出具了书面裁决。"}]}],"synonyms":["advocate of arbitration","arbitration advocate","arbitrator (less common sense)"],"phonetic":"/ɑrˌbɪˈtreɪʃənɪst/","extraExplanation":["“arbitrationist”更常指“主张仲裁的人”（强调立场/理念），而“arbitrator”更常指“具体担任仲裁的人”（强调角色/职位）。在劳资关系语境中，arbitrationist 常与“反对罢工或暴力冲突、提倡制度化协商”的观点相关。"]}
{"word":"arbitrations","summary":{"en":"“Arbitrations” means multiple arbitration processes or cases—disputes decided by a neutral arbitrator outside of court.","zh":"“arbitrations”指多起仲裁程序或案件——由中立仲裁员在法院之外对争议作出裁决。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process of resolving a dispute by having a neutral third person (an arbitrator) make a decision, usually outside of court.","zh":"通过中立第三方（仲裁员）作出裁决来解决争议的程序，通常在法院之外进行。"},"examples":[{"en":"Many business contracts require arbitrations instead of lawsuits.","zh":"许多商业合同要求用仲裁而不是诉讼来解决争议。"},{"en":"The two companies agreed to settle their conflict through arbitrations.","zh":"两家公司同意通过仲裁来解决冲突。"}]},{"partOfSpeech":"n.","definition":{"en":"Dispute cases or formal hearings handled through arbitration (plural).","zh":"以仲裁方式处理的争议案件或正式听审（复数）。"},"examples":[{"en":"The legal team is handling three arbitrations this month.","zh":"法务团队本月正在处理三起仲裁案件。"},{"en":"International arbitrations can involve parties from different countries and legal systems.","zh":"国际仲裁可能涉及来自不同国家和法律体系的当事方。"}]}],"synonyms":["arbitration cases","hearings","dispute resolution","proceedings"],"phonetic":"ˌɑɹbəˈtɹeɪʃən","extraExplanation":["“arbitrations”是“arbitration”的复数形式。日常英语里更常见单数“arbitration”来指一种机制/程序；用复数时，通常强调“多起仲裁案件/多场仲裁程序”。","仲裁（arbitration）常与诉讼（litigation）对比：仲裁通常更私密、程序更灵活、速度可能更快；但在许多情况下，仲裁裁决的上诉空间更小，且常由合同条款提前约定（例如employment arbitration、commercial arbitration）。"]}
{"word":"arbitrative","summary":{"en":"Arbitrative means “related to arbitration” or “having the authority to settle disputes,” mainly used in formal/legal contexts.","zh":"arbitrative 指“与仲裁有关”或“具有裁决争议的权威”，多用于正式/法律语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to arbitration (a formal process where a neutral person or panel settles a dispute outside of court).","zh":"与仲裁有关的（仲裁是由中立的仲裁员或仲裁庭在法庭外裁决争议的正式程序）。"},"examples":[{"en":"The contract includes an arbitrative clause requiring disputes to be resolved by arbitration.","zh":"合同包含一项仲裁条款，要求争议通过仲裁解决。"},{"en":"They chose an arbitrative process to avoid a long court case.","zh":"他们选择了仲裁程序，以避免漫长的诉讼。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having the power to decide something in a final or authoritative way (less common; often replaced by “arbitral” or “arbitrational” in legal writing).","zh":"具有最终或权威性裁决权的（较少见；法律语境中常用“arbitral”或“arbitrational”替代）。"},"examples":[{"en":"The committee played an arbitrative role in the disagreement between the two teams.","zh":"委员会在两队的分歧中扮演了裁决性的角色。"}]}],"synonyms":["arbitral","arbitrational","adjudicative"],"phonetic":"/ˈɑɹbɪˌtɹeɪtɪv/","extraExplanation":["“arbitrative”来自拉丁语词根 *arbiter*（仲裁者、裁决者）。在英语法律文本里，更常见的搭配是 **arbitral tribunal**（仲裁庭）、**arbitral award**（仲裁裁决书）。因此你在阅读合同时，看到“arbitrative”通常可以理解为“与仲裁有关/用于仲裁的”，但写作时更地道的选择往往是 **arbitral**。"]}
{"word":"arbitrator","summary":{"en":"An arbitrator is a neutral decision-maker in arbitration who resolves disputes outside court.","zh":"arbitrator 指在仲裁程序中充当中立裁决者、在法庭之外解决争议的仲裁员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A neutral person chosen to listen to both sides of a dispute and make a decision (an “award”), especially in arbitration instead of going to court.","zh":"仲裁员；被双方选定的中立人士，听取争议双方意见并作出裁决（仲裁裁决），常用于不通过法院的仲裁程序。"},"examples":[{"en":"The two companies agreed to let an arbitrator decide the contract dispute.","zh":"两家公司同意让仲裁员来裁定合同纠纷。"},{"en":"An arbitrator must remain neutral and treat both sides fairly.","zh":"仲裁员必须保持中立，公平对待双方。"},{"en":"The arbitrator’s decision is usually binding under the arbitration agreement.","zh":"在仲裁协议下，仲裁员的裁决通常具有约束力。"}]}],"synonyms":["arbiter","mediator (not the same role)","referee"],"phonetic":"/ˈɑːrbəˌtreɪtər/","extraExplanation":["“arbitrator”常见于法律与商务语境，尤其是劳动争议、合同纠纷、商业合作破裂等。与“judge（法官）”不同，仲裁员通常由双方同意选出，程序更灵活、私密，时间与费用可能更可控。","词源上与拉丁语“arbiter（裁判者/见证者）”有关；在文学或正式写作中也可引申为“在争端中作出最终判断的人/事物”，例如“Time is the best arbitrator.（时间是最好的裁判）”。"]}
{"word":"arbitrators","summary":{"en":"Arbitrators are people chosen to decide a dispute fairly in arbitration, often for business, labor, or legal conflicts.","zh":"Arbitrators 指在仲裁程序中被选来公正裁决争议的人，常见于商业、劳资或法律纠纷。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who are chosen to listen to both sides of a disagreement and make a fair decision, especially in a legal or business dispute (arbitration).","zh":"仲裁员；被选来听取争议双方意见并作出公正裁决的人，尤用于法律或商业纠纷（仲裁）。"},"examples":[{"en":"The arbitrators reviewed the contract and made a final decision.","zh":"仲裁员审阅了合同并作出了最终裁决。"},{"en":"Both companies agreed to use arbitrators instead of going to court.","zh":"两家公司同意使用仲裁员，而不是去法院。"},{"en":"The union and management presented evidence to the arbitrators.","zh":"工会和管理层向仲裁员提交了证据。"}]}],"synonyms":["mediators","judges","referees"],"phonetic":"/ˈɑɹbɪˌtɹeɪtɚz/","extraExplanation":["“Arbitrators”是复数形式；单数是“arbitrator”。相关动词是“arbitrate”（进行仲裁），名词是“arbitration”（仲裁）。","仲裁（arbitration）通常比诉讼（lawsuit/court case）更快、更保密；很多合同里会写“arbitration clause”（仲裁条款），表示发生争议时先走仲裁程序。","常见搭配：neutral arbitrator（中立仲裁员）、panel of arbitrators（仲裁庭/仲裁员小组）、binding arbitration（有约束力的仲裁，结果通常必须遵守）。"]}
{"word":"arbitratorship","summary":{"en":"Arbitratorship means the office or role of an arbitrator (and, more rarely, the practice of arbitration).","zh":"Arbitratorship 指“仲裁员的职位/角色/任期”（更少见时也可指“仲裁程序”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the position, authority, or term of service of an arbitrator; the state of acting as an arbitrator (someone who settles a dispute by making a decision).","zh":"仲裁员的职位、权限或任期；担任仲裁员（通过裁决解决争议）的状态。"},"examples":[{"en":"Her arbitratorship in the labor dispute lasted three months.","zh":"她在这起劳资纠纷中的仲裁员任期持续了三个月。"},{"en":"The contract described the arbitratorship as independent from both parties.","zh":"合同说明该仲裁职责应独立于双方当事人。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) arbitration; the process of settling a dispute by an arbitrator’s decision.","zh":"（较少用）仲裁；由仲裁员作出裁决来解决争议的过程。"},"examples":[{"en":"The company agreed to resolve the conflict through arbitratorship instead of court.","zh":"公司同意通过仲裁而不是诉讼来解决冲突。"}]}],"synonyms":["arbitration (common for the process)","arbitrator’s role","arbitrator’s office","arbitrator’s appointment","arbitrator’s term"],"phonetic":"/ˈɑɹbəˌtɹeɪtɚˌʃɪp/","extraExplanation":["“arbitratorship”在现代英语里比较少见，更常用的是“arbitration（仲裁）”指程序，或“arbitrator（仲裁员）”指人。写作和合同中如果想表达“担任仲裁员的身份/任期”，也可用更常见的表达：“the arbitrator’s role/term/appointment”。","构词上是 arbitrator（仲裁员）+ -ship（表示“身份、职位、关系、状态”），类似于 “leadership（领导身份/领导层）”“membership（会员身份）”。"]}
{"word":"arbitratrix","summary":{"en":"An old-fashioned/formal word meaning a female arbitrator who settles disputes.","zh":"较正式或偏旧的词，指“女仲裁员”，负责裁决争议。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A woman who acts as an arbitrator: a person (especially in law) chosen to settle a dispute by making a decision both sides agree to accept.","zh":"（尤指法律中）女仲裁员；被双方选来裁决争议并作出双方同意接受的决定的女性。"},"examples":[{"en":"The contract named Ms. Lee as the arbitratrix for any disputes.","zh":"合同指定李女士为任何争议的女仲裁员。"},{"en":"Both parties agreed to accept the arbitratrix’s final decision.","zh":"双方同意接受女仲裁员的最终裁决。"}]}],"synonyms":["arbitrator","female arbitrator","referee (informal, not legal-specific)"],"phonetic":"/ˈɑːrbəˌtreɪtrɪks/","extraExplanation":["“arbitratrix”较为正式且带有性别标记，多见于法律英语或较旧/较讲究的用法；现代英语中更常用性别中立的“arbitrator”。","词源上来自拉丁语：-trix 是表示“女性施行者/执行者”的后缀（对应男性常见的 -tor）。因此它与“arbitrator（仲裁员）”同源，只是强调女性。","在实际写作中，除非法律文件或特定场合需要精确区分性别，否则通常建议用“arbitrator”以保持中立和自然。"]}
{"word":"arbitre","summary":{"en":"An arbiter is a person who decides disputes or judges a contest; to arbitrate is to make that decision.","zh":"arbiter 指作出裁决的人（仲裁者/裁判）；作动词时表示仲裁、裁决（更常见动词为 arbitrate）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who makes an official decision in a disagreement, competition, or situation where rules must be applied; a judge (especially in sports).","zh":"仲裁者；裁判（尤指体育比赛中的裁判/判决者）。"},"examples":[{"en":"The arbiter decided that the contract had been broken.","zh":"仲裁者裁定合同已被违约。"},{"en":"In tennis, the arbiter can overrule a line judge’s call.","zh":"在网球比赛中，主裁判可以推翻司线员的判罚。"}]},{"partOfSpeech":"v.","definition":{"en":"to act as the person who decides or settles a dispute; to judge between different sides.","zh":"仲裁；裁决；在双方之间作出判断并解决争端。"},"examples":[{"en":"A neutral committee will arbitrate between the two departments.","zh":"一个中立委员会将对两个部门之间的争议进行仲裁。"},{"en":"She was asked to arbitrate the argument between her friends.","zh":"她被请来仲裁朋友之间的争吵。"}]}],"synonyms":["judge","referee","umpire","mediator","adjudicator"],"phonetic":"/ˈɑr.bə.tɚ/","extraExplanation":["“arbitre”不是常见的英语拼写，更像法语的“arbitre”（裁判/仲裁者）。英语里对应的常用词是“arbiter”（名词）和“arbitrate”（动词）。","词根来自拉丁语“arbiter”，含义与“判断、裁决”相关，因此在正式语境（法律、合同争端）和体育比赛中都很常见。"]}
{"word":"arbitrement","summary":{"en":"Arbitrament means an arbitration decision or (in older literary use) the power to decide.","zh":"Arbitrament 指仲裁裁决；在较旧的文学用法中也可指“决定权/意志”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Formal) A decision, judgment, or settlement made by an arbitrator; an award made through arbitration.","zh":"（正式用语）仲裁裁决；由仲裁人作出的决定或解决方案。"},"examples":[{"en":"The dispute was finally resolved by arbitram​ent.","zh":"这场争端最终通过仲裁裁决得到解决。"},{"en":"They agreed to accept the arbitram​ent of an independent panel.","zh":"他们同意接受一个独立小组的仲裁裁决。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literary/older) The power or right to decide something; personal choice or will.","zh":"（文学/较旧用法）决定权；选择的权力；个人意志。"},"examples":[{"en":"The matter was left to the arbitram​ent of the king.","zh":"此事交由国王裁夺。"},{"en":"She acted according to her own arbitram​ent.","zh":"她按自己的意愿行事。"}]}],"synonyms":["arbitration","award","judgment","decision","ruling"],"phonetic":"/ɑrˈbɪtrəmənt/","extraExplanation":["“arbitrement”更常见的规范拼写是 **arbitrament**。如果你想表达现代法律/商业语境中的“仲裁程序”，更常用的词是 **arbitration**（仲裁）。","词源与“arbitrary（任意的）”“arbiter（仲裁者/裁决者）”同源，都来自拉丁语 *arbiter*（裁决者）。在现代英语里，**arbitrament**偏正式、偏文雅，使用频率远低于 **arbitration**。"]}
{"word":"arbitrer","summary":{"en":"“Arbiter” means a person or thing that makes a final judgment or decision, especially in disputes or standards (like taste).","zh":"“Arbiter”指作出最终判断或决定的人或事物，常用于争议裁决或（如品味）标准的评判。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person (or group) who has the authority to judge a dispute or make a final decision.","zh":"仲裁者；裁决者；有权对争议作出最终决定的人（或机构）。"},"examples":[{"en":"The judge acted as the arbiter in the case.","zh":"法官在此案中充当了裁决者。"},{"en":"In our team, the manager is the arbiter of what gets prioritized.","zh":"在我们团队里，经理对优先事项有最终决定权。"}]},{"partOfSpeech":"n.","definition":{"en":"Something that decides what is best or most acceptable (often used in phrases like “the arbiter of taste”).","zh":"（比喻）决定标准的事物；评判依据（常见于“品味的评判者”等表达）。"},"examples":[{"en":"For many readers, time is the final arbiter of a book’s value.","zh":"对许多读者来说，时间是衡量一本书价值的最终标准。"},{"en":"Fashion magazines once served as the arbiter of taste.","zh":"时尚杂志曾一度是品味的评判者。"}]}],"synonyms":["judge","referee","mediator","decision-maker","umpire"],"phonetic":"/ˈɑːrbɪtər/","extraExplanation":["“arbitrer”通常被认为是拼写错误，更常见的正确拼写是 **arbiter**（裁决者、仲裁者）。如果你想表达“仲裁/裁判”的动词，常用 **arbitrate**（仲裁）或名词 **arbitration**（仲裁）。","词源提示：**arbiter** 来自拉丁语，核心含义是“作出判断/裁决的人”。日常英语里它既可用于法律语境（仲裁、裁决），也常用于比喻（如“the arbiter of taste”）。"]}
{"word":"arbitress","summary":{"en":"Arbitress means a female arbitrator, a woman who decides a dispute; today “arbitrator” is more common.","zh":"arbitress 指“女仲裁员”，即裁决争端的女性；如今更常用中性词 arbitrator。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A female arbitrator; a woman chosen to judge a dispute and make a decision (now often replaced by the gender-neutral word “arbitrator”).","zh":"女仲裁员；被选来裁决争端并作出决定的女性（现代英语常用中性词 arbitrator 代替）。"},"examples":[{"en":"The contract allows either party to appoint an arbitress to resolve disagreements.","zh":"合同允许任何一方指定一位女仲裁员来解决分歧。"},{"en":"In older writings, an arbitress might be asked to settle a family quarrel.","zh":"在较早的作品中，女仲裁员可能会被请来调解家庭纠纷。"}]}],"synonyms":["arbitrator","referee","judge","mediator"],"phonetic":"/ˌɑr.bəˈtrɛs/","extraExplanation":["“arbitress”属于较旧或较少见的性别标记名词（-ess 结尾，如 actress）。在现代正式写作中通常使用“arbitrator”来强调职业而非性别。","词源与拉丁语“arbiter”（仲裁者）有关；历史上英语曾更常用带性别后缀的职业称呼。"]}
{"word":"arbitrium","summary":{"en":"Arbitrium is a rare, formal noun from Latin meaning (1) an authoritative decision made at someone’s discretion, or (2) free will in philosophy/theology.","zh":"Arbitrium是源自拉丁语的罕见正式名词，可指（1）有权者依裁量作出的裁断，（2）哲学/神学中的“自由意志”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, formal) A decision or judgment made by someone, especially an authority; a ruling made at one’s discretion.","zh":"（罕见，正式）某人（尤指有权者）作出的决定或裁断；依个人裁量作出的裁决。"},"examples":[{"en":"The dispute was settled by the arbitrium of the council.","zh":"这场争端由议会的裁断解决。"},{"en":"In the old text, the king’s arbitrium determined the fate of the prisoners.","zh":"在那部古文献中，囚犯的命运取决于国王的裁量。"}]},{"partOfSpeech":"n.","definition":{"en":"(Philosophy/Theology) Free will; the power to choose (often contrasted with fate, necessity, or divine predestination).","zh":"（哲学/神学）自由意志；选择的能力（常与命运、必然性或神的预定相对）。"},"examples":[{"en":"The author argues that humans have arbitrium and are responsible for their actions.","zh":"作者主张人具有自由意志，因此要为自己的行为负责。"},{"en":"The phrase “liberum arbitrium” is often translated as “free will.”","zh":"“liberum arbitrium”常被译为“自由意志”。"}]}],"synonyms":["decision","judgment","discretion","ruling","free will"],"phonetic":"/ɑrˈbɪtriəm/","extraExplanation":["“arbitrium”源自拉丁语，和“arbiter”（仲裁者、裁决者）同源，因此带有“裁量、裁断”的核心意思。现代英语里它不是常用词，更多见于学术写作、法律史或神学/哲学讨论中。","在神学传统中，尤其常见于拉丁语短语“liberum arbitrium”（自由意志）。讨论主题往往涉及：人是否能自由选择、是否需要为罪与善行负责、以及这种选择是否会被宿命或预定所限制。","阅读古典或中世纪作品的英文译本时，你可能会在脚注、术语表或拉丁引文中看到该词，而在日常英语中通常用“decision / judgment / discretion / free will”来表达。"]}
{"word":"arbitry","summary":{"en":"Arbitrary means decided by personal choice rather than clear rules; it can also mean determined by an authority’s judgment.","zh":"Arbitrary 指“随意的/武断的”，即不是依据明确规则而定；也可指“由权威裁量决定的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Spelling note: often misspelled as “arbitry”) Based on personal choice or preference rather than a clear reason, rule, or system; seeming random.\nExamples: (1) The teacher’s grading felt arbitrary. / (2) Choosing a date without checking everyone’s schedule is arbitrary.\n例句翻译: (1) 老师的评分让人觉得很武断/随意。 (2) 不看大家时间就定日期很随意。","zh":"（拼写提示：常被误写成 “arbitry”）任意的；武断的；缺乏明确理由、规则或系统的，给人感觉像“随便定的”。\nExamples: (1) The teacher’s grading felt arbitrary. / (2) Choosing a date without checking everyone’s schedule is arbitrary.\n例句翻译: (1) 老师的评分让人觉得很武断/随意。 (2) 不看大家时间就定日期很随意。"},"examples":[{"en":"The rules seemed arbitrary, so people didn’t trust them.","zh":"这些规则看起来很随意，所以人们不信任它们。"},{"en":"He made an arbitrary decision without listening to others.","zh":"他没听别人意见就做了一个武断的决定。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) In grammar/law contexts: decided by an authority (like an arbiter) rather than by strict rules.\nExample: The dispute was settled by arbitrary judgment.\n例句翻译: 争端通过仲裁式的裁决解决了。","zh":"（较少见，用于语法/法律语境）由权威（如仲裁者）裁定的，而不是严格按规则推导出来的。\nExample: The dispute was settled by arbitrary judgment.\n例句翻译: 争端通过仲裁式的裁决解决了。"},"examples":[{"en":"In some systems, an arbitrary authority can overrule local decisions.","zh":"在一些制度中，中央/权威可以用裁量权推翻地方决定。"}]}],"synonyms":["random","capricious","unjustified","subjective","whimsical"],"phonetic":"ˈɑɹbəˌtɹɛɹi","extraExplanation":["你输入的 “arbitry” 通常是 “arbitrary” 的拼写错误。记忆法：arbit(er)（仲裁者）+ -ary（形容词后缀）→ arbitrary。常见搭配：arbitrary decision（武断的决定）、arbitrary rule（随意的规则）、arbitrary number/value（任取的数/值，数学里常见）。"]}
{"word":"arblast","summary":{"en":"“Arblast” is usually a misspelling of “arbalest,” meaning a medieval crossbow.","zh":"“arblast”通常是“arbalest”的误拼，意思是中世纪的弩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common misspelling) A variant spelling of “arbalest,” a medieval crossbow, often a large and powerful one.","zh":"（常见拼写错误）“arbalest”的变体/误拼，指中世纪的弩（常指体型较大、威力较强的弩）。"},"examples":[{"en":"In the novel, the guard raised an arbalest to defend the gate.","zh":"在小说里，守卫举起弩来防守城门。"},{"en":"The museum label says the weapon is an arbalest, not “arblast.”","zh":"博物馆的标牌写着这武器叫 arbalest，而不是“arblast”。"}]}],"synonyms":["arbalest","crossbow"],"phonetic":"/ˈɑr.bə.lɛst/","extraExplanation":["“arbalest”常见于中世纪题材的历史书、奇幻小说和角色扮演游戏中，通常用来强调武器更重、更强、上弦更费力。","词源上与古法语有关，和“弩”这一类武器在欧洲中世纪的军事发展相关。写作时更推荐使用标准拼写 arbalest。"]}
{"word":"Arblay","summary":{"en":"Arblay is best known as the surname in “Madame d’Arblay,” the later name of the English writer Frances Burney.","zh":"Arblay 最常见于“Madame d’Arblay（达尔布莱夫人）”，即英国作家弗朗西丝·伯尼的婚后姓名/称呼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A surname best known from English literature: the married name and pen name of the novelist and diarist Frances Burney (1752–1840), often referred to as “Madame d’Arblay.”","zh":"一个姓氏，在英国文学中最有名：指小说家、日记作者弗朗西丝·伯尼（Frances Burney，1752–1840）的婚后姓与常见称呼/署名，常被称为“Madame d’Arblay（达尔布莱夫人）”。"},"examples":[{"en":"Frances Burney is sometimes listed under her later name, Madame d’Arblay.","zh":"弗朗西丝·伯尼有时会以她后来的名字“Madame d’Arblay（达尔布莱夫人）”被收录。"},{"en":"In some editions, her diaries appear as The Journals and Letters of Madame d’Arblay.","zh":"在一些版本中，她的日记会以《Madame d’Arblay 的日记与书信》之类的标题出版。"}]}],"phonetic":"/ɑrˈbleɪ/","extraExplanation":["“d’Arblay”里的 d’ 来自法语，表示“来自/属于……”。伯尼与法国军官亚历山大·达尔布莱（Alexandre d’Arblay）结婚后，常以“Madame d’Arblay”被称呼。阅读文学史或书目时，看到 Arblay / d’Arblay 多半是在指同一位作者（Frances Burney）。"]}
{"word":"Arboles","summary":{"en":"“Arboles” is Spanish for “trees” (plural).","zh":"“Arboles”是西班牙语，意思是“树木（复数）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) plural of “árbol”; means “trees.”","zh":"（西班牙语）“árbol”的复数，意思是“树；树木”。"},"examples":[{"en":"En el parque hay muchos árboles.","zh":"公园里有很多树。"},{"en":"Los árboles dan sombra en verano.","zh":"树在夏天提供阴凉。"}]}],"synonyms":["trees"],"phonetic":"/ˈɑr.boʊ.leɪs/","extraExplanation":["“Arboles”通常应写作“árboles”，重音符号（´）表示重读在第一个音节 AR- 上。省略重音符号在非正式场合可能出现，但在规范西班牙语写作中应保留。","在英语里对应的常用词是“trees”。如果你是在学英语，看到西班牙语“árboles”，可以把它当作“trees（复数）”来记。"]}
{"word":"arboloco","summary":{"en":"“Arboloco” is a Spanish-derived term meaning “crazy tree,” often used as a nickname/handle; in some regions it’s also a common name for certain Latin American plants.","zh":"“Arboloco”源自西班牙语，意为“疯狂的树”，常作昵称/网名；在部分地区也可作某些拉丁美洲植物的俗名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(from Spanish) “crazy tree”; used as a nickname, username, or playful label for something or someone seen as wild, quirky, or unpredictable.","zh":"（源自西班牙语）“疯狂的树”；常用作昵称、网名或戏称，形容某人/某物古怪、狂野或难以预测。"},"examples":[{"en":"Online he goes by “Arboloco,” which fits his chaotic sense of humor.","zh":"他在网上用“Arboloco”当网名，很符合他混乱又搞笑的风格。"},{"en":"They called the graffiti-covered oak the “arboloco” of the neighborhood.","zh":"他们把那棵被涂鸦覆盖的橡树叫作社区里的“arboloco（疯狂的树）”。"}]},{"partOfSpeech":"n.","definition":{"en":"A Spanish common name sometimes used for certain Latin American plants (depending on region), especially the shrub/tree-like plant Montanoa quadrangularis.","zh":"（西语俗名）在一些地区用来指某些拉丁美洲植物的俗称，常见指蒙塔诺亚属植物 Montanoa quadrangularis（因地区而异）。"},"examples":[{"en":"In some Colombian contexts, “arboloco” refers to a local plant used in traditional remedies.","zh":"在哥伦比亚的一些语境里，“arboloco”指一种用于传统疗法的本地植物。"},{"en":"The guide pointed out an arboloco growing along the mountain path.","zh":"向导指着山路旁生长的一株 arboloco 给我们看。"}]}],"synonyms":["árbol loco","crazy tree (translation)","nickname/handle (by function)"],"phonetic":"ˌɑrboʊˈloʊkoʊ","extraExplanation":["“arboloco”更常见的写法是西班牙语“árbol loco”（有重音符号），直译为“疯狂的树”。在英文语境里多作为外来词/网名出现，并不是标准英语词汇。","作为植物俗名时，不同国家与地区可能指向不同物种；如果你是在特定文章、歌曲、地名或品牌里看到它，告诉我上下文，我可以帮你精确判断含义。"]}
{"word":"Arbon","summary":{"en":"Arbon is most commonly a place name: a town in northeastern Switzerland on Lake Constance; it can also be a less common surname.","zh":"Arbon 最常见是地名：瑞士东北部博登湖畔的一座城镇；也可能是较少见的姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A town (municipality) in northeastern Switzerland, on the shore of Lake Constance.","zh":"瑞士东北部的一座城镇（市镇），位于博登湖（康斯坦茨湖）湖畔。"},"examples":[{"en":"Arbon is a small town on Lake Constance in Switzerland.","zh":"Arbon 是瑞士博登湖畔的一座小镇。"},{"en":"We stopped in Arbon for a walk along the lake.","zh":"我们在 Arbon 停留，沿着湖边散步。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname), less common in English; it may also appear as a given name in some contexts.","zh":"一个姓氏（在英语语境中较少见）；在某些情况下也可能作为名字出现。"},"examples":[{"en":"Ms. Arbon will speak at the meeting today.","zh":"Arbon 女士今天将在会议上发言。"}]}],"phonetic":"/ˈɑr.bɑn/","extraExplanation":["Arbon 位于瑞士图尔高州（Thurgau），临博登湖。当地主要语言是德语，因此在旅游信息或地图上常见德语拼写与周边城镇一起出现。","如果你其实想查的是 “carbon”（碳）或 “arbor”（树荫亭/树架），告诉我你看到它的句子或语境，我可以帮你确认。"]}
{"word":"Arbor","summary":{"en":"“Arbor” most commonly means a garden trellis or shady structure (and can also mean a tree).","zh":"“arbor”最常指花园里的棚架/藤架等遮荫结构（也可指树）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tree; also, a place shaded by trees or a leafy garden structure that provides shade.","zh":"树；也可指树荫处，或（花园里的）棚架/凉亭（常被藤蔓覆盖，用来遮荫）。"},"examples":[{"en":"This arbor provides shade in the summer.","zh":"这个棚架在夏天提供阴凉。"},{"en":"They planted an arbor of oak and maple near the entrance.","zh":"他们在入口附近种了一片橡树和枫树。"},{"en":"We ate lunch under the arbor covered with grapevines.","zh":"我们在长满葡萄藤的棚架下吃午饭。"}]},{"partOfSpeech":"v.","definition":{"en":"To provide with a tree or trellis; to make a garden area shady by planting or supporting climbing plants.","zh":"种树或搭棚架以遮荫；用攀缘植物支撑结构来布置成荫凉的地方。"},"examples":[{"en":"They arbor the walkway with roses and climbing vines.","zh":"他们用玫瑰和攀缘藤蔓在走道上搭出棚架遮荫。"},{"en":"The courtyard was arborsed to create a cooler space.","zh":"这个庭院通过搭棚架/种植变得更凉爽。"}]}],"synonyms":["trellis","pergola","bower","tree"],"phonetic":"/ˈɑr.bɚ/","extraExplanation":["“arbor”在美式英语里常见意思是“（花园）棚架/藤架、凉亭式的遮荫架”，比如婚礼拱门或花园小径上的藤架。英式英语里更常用“arbour”拼写。","别和“harbor”（港口、避风港）混淆：发音不同、意思也不同。","相关词：arboreal（树上的；与树有关的），arborist（树艺师/修树专家），arboretum（植物园，尤指树木园）。"]}
{"word":"arbor","summary":{"en":"Arbor usually means a garden structure that supports climbing plants; less commonly, it can mean a tree.","zh":"Arbor 通常指花园里的棚架/藤架，用来支撑攀爬植物；较少情况下也可指“树”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A structure or framework (often wooden or metal) in a garden that supports climbing plants like vines or roses; often forms a shaded walkway or entrance.","zh":"（花园中的）棚架/藤架；常用木或金属搭成，用来支撑藤蔓或蔷薇等攀爬植物，常形成有遮荫的走道或入口。"},"examples":[{"en":"We walked through the grape arbor to reach the backyard.","zh":"我们穿过葡萄藤架走到后院。"},{"en":"She trained the roses to grow over the arbor.","zh":"她把玫瑰牵引到棚架上生长。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A tree; also used in names related to trees (for example, Arbor Day).","zh":"（较少用）树；也常见于与树相关的名称中（如“Arbor Day”植树节）。"},"examples":[{"en":"Arbor Day is a holiday that encourages planting and caring for trees.","zh":"植树节是一个鼓励人们种树并照料树木的节日。"}]}],"synonyms":["trellis","pergola","bower"],"phonetic":"/ˈɑr.bɚ/","extraExplanation":["“arbor”来自拉丁语 *arbor*，原意就是“树”。现代英语里更常用的是表示花园里的“棚架/藤架”。","英式英语中常见拼写/用词“arbour”，与美式“arbor”同义；在美国，“Arbor Day”是很常见的文化词汇。"]}
{"word":"arboraceous","summary":{"en":"Arboraceous means “tree-related” or “tree-like,” often used in scientific or formal writing.","zh":"arboraceous 意为“与树有关的；树木状的”，常见于科学或正式语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to trees; having the characteristics of a tree (especially being woody and tall).","zh":"树木的；与树有关的；（尤指）像树一样木质、高大的。"},"examples":[{"en":"The park is full of arboraceous plants such as oaks and maples.","zh":"公园里有许多树木类植物，比如橡树和枫树。"},{"en":"Botanists described the species as arboraceous rather than shrubby.","zh":"植物学家把这种物种描述为乔木状，而不是灌木状。"}]}],"synonyms":["tree-like","woody","arboreal","arborescent"],"phonetic":"/ˌɑr.bəˈreɪ.ʃəs/","extraExplanation":["“arboraceous”较为书面、偏科学（尤其植物学）用语，日常英语更常说“tree-like”“woody”或直接说“trees/trees species”。","词源上来自拉丁语“arbor”（树），因此常见于学术写作中描述“乔木状/树木类”的特征。"]}
{"word":"arboral","summary":{"en":"Arboral means “related to trees,” especially describing animals that live in trees; the more common spelling is arboreal.","zh":"arboral 表示“与树有关的”，尤其指“树栖的”；更常见的拼写是 arboreal。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to trees; living in trees or resembling trees.","zh":"与树有关的；栖息在树上的；像树的。"},"examples":[{"en":"Many monkeys are arboral and spend most of their lives in the canopy.","zh":"许多猴子是树栖动物，一生大部分时间都待在林冠层。"},{"en":"The park protects arboral habitats for birds and insects.","zh":"这座公园保护鸟类和昆虫的树栖栖息地。"},{"en":"Arboral plants in this region depend on tall trees for support.","zh":"这个地区的一些攀附植物依靠高大的树木支撑。"}]}],"synonyms":["arboreal","tree-dwelling","tree-living","woodland (context-dependent)"],"phonetic":"/ɑɹˈbɔɹiəl/","extraExplanation":["更常见、标准的拼写是 **arboreal**（有 *e*）。**arboral** 偶尔也会被使用，但在学术写作、词典和正式场合通常推荐用 **arboreal**。","词源关联：*arbor* 是拉丁语“树”的意思（英语里也见于 *arbor* = 乔木/亭架等）。因此 **arboreal** 常用于生物学/生态学语境，指“树栖的、与树相关的”。"]}
{"word":"arborary","summary":{"en":"Arborary (rare): relating to trees or life in trees.","zh":"arborary（少见）：与树有关的；树栖的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to trees; consisting of or growing in trees (rare word).","zh":"与树有关的；由树构成的；生长在树上的（较少见的用法）。"},"examples":[{"en":"The garden included several arborary plants chosen for their shade.","zh":"花园里种了几种与树有关的植物，用来遮阴。"},{"en":"Some animals have arborary habits, spending most of their time in branches.","zh":"有些动物有树栖习性，大部分时间待在树枝上。"}]}],"synonyms":["arboreal","arboraceous","wooded","treelike"],"phonetic":"/ˈɑr.bəˌrɛr.i/","extraExplanation":["“arborary”在现代英语中非常少见，更常见、也更自然的说法是“arboreal”（树栖的；与树有关的）或“arboraceous”（树木的）。如果你是在写作或考试中使用，建议优先用“arboreal”。","词根来自拉丁语“arbor”（树）。英语里与树相关的常见词还有：arbor（棚架/树荫亭）、arborist（树艺师/树木护理师）、arboretum（植物园/树木园）。"]}
{"word":"arborator","summary":{"en":"Arborator can mean a (rare) person who plants or cares for trees, and it is also used as the name of a linguistic annotation tool for tree structures.","zh":"Arborator 可指（较少用）植树或养护树木的人；也可指用于语言学树状结构标注的软件工具名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who plants, cultivates, or cares for trees; a tree grower or caretaker (rare).","zh":"植树者；树木栽培者或养护者（较少用）。"},"examples":[{"en":"The village hired an arborator to restore the old orchard after the storm.","zh":"暴风雨过后，村里雇了一位树木养护者来修复老果园。"},{"en":"As an arborator, she studies which trees can survive drought and heat.","zh":"作为一名植树/树木栽培者，她研究哪些树能在干旱和高温中存活。"}]},{"partOfSpeech":"n.","definition":{"en":"A name used for software tools that help linguists annotate “tree” structures in language data (for example, syntax treebanks).","zh":"（常作专有名词）用于语言学“树状结构”标注的工具名称（如句法树库标注）。"},"examples":[{"en":"We used Arborator to label syntactic dependencies in the dataset.","zh":"我们用 Arborator 给数据集标注句法依存关系。"},{"en":"The annotation guidelines explain how to create a tree in Arborator.","zh":"标注指南说明了如何在 Arborator 里创建一棵“树”（结构）。"}]}],"synonyms":["arborist","tree planter","tree caretaker","tree grower","treebank annotation tool"],"phonetic":"/ˈɑr.bəˌreɪ.tɚ/","extraExplanation":["“arborator”源于拉丁语词根 arbor（树）。在日常英语里更常见的是 arborist（树艺师/树木养护专家）。","在计算语言学里，“tree（树）”常比喻句法结构，因此一些标注软件会用与“树”相关的名字（如 Arborator）。"]}
{"word":"arborea","summary":{"en":"Arborea is most commonly a proper name: a town in Sardinia, Italy, or a fantasy plane in Dungeons & Dragons; rarely, it appears as a Latin-based word meaning “wooded/of trees.”","zh":"Arborea 最常见是专有名词：意大利撒丁岛的城镇名，或《龙与地下城》中的位面名；较少情况下作为拉丁语借形，表示“树木繁茂的/与树有关的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A town (comune) in the province of Oristano, on the island of Sardinia, Italy.","zh":"意大利撒丁岛奥里斯塔诺省的一个城镇（市镇）。"},"examples":[{"en":"Arborea is a small town in Sardinia known for agriculture and nearby wetlands.","zh":"Arborea 是撒丁岛上的一座小镇，以农业和附近的湿地闻名。"},{"en":"She visited Arborea while traveling through central-western Sardinia.","zh":"她在撒丁岛中西部旅行时去了 Arborea。"}]},{"partOfSpeech":"other","definition":{"en":"In Dungeons & Dragons (fantasy role‑playing), the name of a “plane of existence” associated with wild nature, passion, and chaotic good gods; it was called Olympus in earlier editions.","zh":"在《龙与地下城》（奇幻桌游）设定中，“位面”的名称之一，常与狂野自然、激情、混乱善阵营的神祇相关；早期版本曾称为 Olympus。"},"examples":[{"en":"The campaign’s cleric said her deity’s realm lies in Arborea.","zh":"这场战役里的牧师说，她的神祇领域位于 Arborea。"},{"en":"In the story, portals sometimes open from the Feywild to Arborea.","zh":"在故事里，传送门有时会从妖精荒野通向 Arborea。"}]},{"partOfSpeech":"adj.","definition":{"en":"A rare, Latin-based form meaning “wooded” or “of trees,” seen mainly in scholarly or poetic contexts (from Latin arboreus/arborea).","zh":"较少见的拉丁语借形，意为“树木繁茂的；与树有关的”，多见于学术或诗歌语境（源自拉丁语 arboreus/arborea）。"},"examples":[{"en":"The author uses a Latin phrase with arborea to evoke a forested landscape.","zh":"作者用含有 arborea 的拉丁短语来唤起森林景象。"}]}],"synonyms":["arboreal","wooded","forest(ed)"],"phonetic":"/ɑrˈbɔriə/","extraExplanation":["在现代英语里，Arborea 更常作为专有名词出现（地名或奇幻设定名）。如果你想表达“树栖的/栖息在树上的”，更常用的英语词是 arboreal（/ɑrˈbɔriəl/）。"]}
{"word":"arboreal","summary":{"en":"Arboreal describes something related to trees, especially animals that live in trees.","zh":"Arboreal 指与树木有关，尤其指在树上生活（树栖）的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to trees; living in or among trees.","zh":"与树木有关的；栖息在树上或生活在树林中的。"},"examples":[{"en":"Monkeys have many arboreal habits, such as sleeping in the branches.","zh":"猴子有很多树栖习性，比如在树枝上睡觉。"},{"en":"The arboreal canopy is full of birds and insects.","zh":"树冠层里充满了鸟类和昆虫。"}]}],"synonyms":["tree-dwelling","tree-living","woodland (context-dependent)"],"phonetic":"/ɑrˈbɔriəl/","extraExplanation":["“arboreal”来自拉丁语 *arbor*（树）。常用于生物学/生态学语境，描述“树栖”的动物（如树懒、松鼠、某些蛇类）或与森林树木相关的事物。","常见搭配：*arboreal animals*（树栖动物）, *arboreal habitat*（树栖/林木栖息地）, *arboreal canopy*（树冠层）。对比：*terrestrial*（陆生的，地面生活的）与 *aquatic*（水生的）。"]}
{"word":"arboreally","summary":{"en":"Arboreally means “in a tree-related or tree-dwelling way,” often used in biology and ecology.","zh":"arboreally 意为“以与树有关或树栖的方式”，常用于生物学与生态学语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to trees or living/occurring in trees.","zh":"以与树有关的方式；（尤指）以树栖的方式、在树上生活/发生地。"},"examples":[{"en":"The koala is adapted to live arboreally, spending most of its time in eucalyptus trees.","zh":"考拉适应树栖生活，大部分时间都待在桉树上。"},{"en":"Some snakes hunt arboreally, moving from branch to branch in search of birds.","zh":"有些蛇会在树上捕猎，在树枝间移动寻找鸟类。"}]}],"synonyms":["in trees","tree-dwellingly","in an arboreal way"],"phonetic":"ɑrˈbɔrɪli","extraExplanation":["“arboreally”来自拉丁语词根 arbor（树）。在生物学与生态学语境中更常见，用来描述动物的生活方式（如 arboreal=树栖的；arboreally=以树栖方式）。日常英语里更常用 in trees / in a tree-dwelling way 来表达同样意思。"]}
{"word":"arborean","summary":{"en":"Arborean means “related to trees/forests” (rare; often replaced by arboreal) or “related to Arborea in Sardinia, Italy.”","zh":"arborean 可指“与树木/森林有关的”（较少见，常被 arboreal 取代），也可指“与意大利撒丁岛的阿尔博雷亚（Arborea）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to trees or forests; tree-like.","zh":"与树或森林有关的；像树的。"},"examples":[{"en":"The park has an arborean feel, with tall trunks and deep shade.","zh":"这个公园有一种森林般的氛围：高高的树干和浓密的树荫。"},{"en":"In the story, arborean spirits protect the ancient woods.","zh":"在故事里，森林精灵守护着古老的树林。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to Arborea (a town and historical region in Sardinia, Italy).","zh":"与意大利撒丁岛的阿尔博雷亚（Arborea）城镇及其历史地区有关的。"},"examples":[{"en":"She studied Arborean history and medieval Sardinian politics.","zh":"她研究阿尔博雷亚的历史以及中世纪撒丁岛的政治。"},{"en":"The museum has an exhibit on Arborean culture in Sardinia.","zh":"博物馆有一个关于撒丁岛阿尔博雷亚文化的展览。"}]}],"synonyms":["arboreal","woodland","forest","sylvan"],"phonetic":"/ɑrˈbɔriən/","extraExplanation":["“arborean”较少见，日常英语更常用的是“arboreal”（树栖的、与树有关的）。在写作或文学语境中，“arborean”有时被用来营造更诗意、更古典的“森林/树木气息”。","如果你看到的是大写“Arborean”，通常指与撒丁岛历史上的“Arborea（阿尔博雷亚）”相关；小写则更可能是“与树木相关”的形容词用法。"]}
{"word":"arbored","summary":{"en":"“Arbored” most commonly means “having many trees; tree-covered or shaded.”","zh":"“arbored”最常见的意思是“树木繁茂的；被树木覆盖/遮蔽的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a place) having many trees; shaded or covered with trees.","zh":"（指地方）树木繁茂的；被树木遮蔽的。"},"examples":[{"en":"They built a small house on an arbored hillside.","zh":"他们在一座树木葱郁的山坡上建了一间小房子。"},{"en":"We walked along an arbored path to stay cool in the summer heat.","zh":"我们沿着一条林荫小路散步，以躲避夏日的炎热。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “arbor” (rare): to plant or cover with trees, or to provide with a leafy shelter.","zh":"“arbor”的过去式/过去分词（较少见）：种树于；用树木覆盖；搭建或提供树荫/棚架般的遮蔽处。"},"examples":[{"en":"The streets were arbored to reduce heat and improve air quality.","zh":"街道两旁种上了树，以降低热度并改善空气质量。"}]}],"synonyms":["wooded","tree-covered","tree-lined","shaded","leafy"],"phonetic":"/ˈɑr.bɚd/","extraExplanation":["“arbored”来自名词“arbor”（树、树林；也可指花园里的凉棚/藤架）。在现代英语里，“arbored”更常作形容词，表示“多树的、林荫的”。在园艺或城市绿化语境中，你也可能看到更常用的表达如 “tree-lined / wooded / shaded”。"]}
{"word":"arboreous","summary":{"en":"Arboreous means “related to trees” or “living in trees,” and is a more formal/literary word.","zh":"arboreous 表示“与树有关的；栖树的”，偏正式/文学用语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to trees; having the characteristics of trees or living in trees.","zh":"与树有关的；像树的；（动物）栖树而居的。"},"examples":[{"en":"The park has an arboreous landscape, with tall oaks and maples lining the paths.","zh":"这个公园的景观很“树木繁盛”，小路两旁种着高大的橡树和枫树。"},{"en":"Many monkeys are arboreous and spend most of their time in the canopy.","zh":"很多猴子是栖树动物，大部分时间都在树冠层活动。"}]}],"synonyms":["arboreal","tree-dwelling","wooded","forested"],"phonetic":"/ɑrˈbɔriəs/","extraExplanation":["“arboreous”来自拉丁语 arbor（树），常用于书面语或科学语境（如生态学、动物学）来描述“与树木有关/栖树的”。日常英语里更常见的表达是 “tree-related”, “wooded”, “forest”, “living in trees”。","近义词细微差别：wooded/forested 多指“有很多树的地方”；arboreal 更常用于动物“栖树的”；arboreous 既可形容环境（树木繁盛）也可形容与树有关的特征，语气更文学或正式。"]}
{"word":"arborer","summary":{"en":"Arborer is a rare noun meaning someone who builds/maintains a garden arbor, or (rarely) a person/thing that shelters or hides something.","zh":"arborer 是较罕见的名词，可指建造/维护花架（藤架）的人，也可（较少见）指提供庇护或窝藏的人/物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who makes, builds, or maintains an arbor (a garden shelter or leafy walkway).","zh":"建造或维护花架／藤架（花园遮荫棚、拱门走道等）的人。"},"examples":[{"en":"The arboretum hired an arborer to repair the old grape arbor.","zh":"这座植物园雇了一位花架工来修理那座老葡萄藤架。"},{"en":"In the spring, the arborer trained the vines so they would cover the walkway.","zh":"春天里，花架工把藤蔓牵引整理，好让它们覆盖走道。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) someone or something that provides shelter or concealment; a person who “arbors” (harbors) something.","zh":"（罕见）提供遮蔽之物；“庇护／藏匿”某物的人（相当于 harbor 的含义）。"},"examples":[{"en":"The cave was an arborer of small animals during storms.","zh":"暴风雨时，这个洞穴成了小动物的庇护所。"},{"en":"He was accused of being an arborer of stolen goods.","zh":"他被指控为赃物的窝藏者。"}]}],"synonyms":["arbor builder","gardener (context)","harborer (rare sense)"],"phonetic":"/ˈɑːrbərər/","extraExplanation":["“arborer”在现代英语里非常少见，日常更常用的是“arborist”（树艺师、树木修剪与养护专家）来指从事树木工作的职业人士。","“arbor”既可以指花园里的“花架/藤架/拱门”，也可以作动词表示“庇护、窝藏”（和“harbor”含义接近）。因此“arborer”有时会被理解为“提供庇护的人/物”，但这种用法偏旧或偏文学。"]}
{"word":"arbores","summary":{"en":"“Arbores” is an uncommon plural form of “arbor,” meaning trees (often in literary/Latin-style writing) and sometimes garden arbors.","zh":"“arbores”是“arbor”的不常见复数形式，多指“树木”（偏文学/拉丁风格），有时也可指“花园凉棚/藤架”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of arbor: trees (literary/Latin-based use) or garden shelters made of plants/trellis (less common in this spelling).","zh":"arbor 的复数：树木（偏文学/拉丁语系用法）或花园里的藤架凉棚（这种拼写较少见）。"},"examples":[{"en":"In some older or scholarly writing, you may see “arbores” used to mean trees.","zh":"在一些较旧或较学术的写作中，你可能会看到“arbores”用来表示“树木”。"},{"en":"The estate was shaded by ancient arbores along the riverbank.","zh":"庄园被河岸边的古老树木所遮荫。"}]}],"synonyms":["trees","arbors","arbours"],"phonetic":"/ˈɑr.bɚz/","extraExplanation":["“arbores”在现代日常英语里很少见；更常见的拼写是“arbors”（美式）或“arbours”（英式），尤其在表示“花园凉棚/藤架”时。","“arbor”来自拉丁语 arbor（树）。在文学或带拉丁色彩的语境里，作者有时会用更“古典”的复数形式“arbores”。如果你是在西班牙语或拉丁语文本中看到它，也很可能就是“树木”的意思。"]}
{"word":"arborescence","summary":{"en":"Arborescence means a tree-like branching pattern; in math/CS it also means a rooted directed tree structure.","zh":"Arborescence 指“树枝状的分叉结构”；在数学/计算机中也指“以根为起点的有向树结构”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tree-like branching structure; something that looks like or spreads out like the branches of a tree.","zh":"树枝状结构；像树一样分叉、扩展的形态。"},"examples":[{"en":"The map of the river system shows an arborescence of smaller streams feeding into the main channel.","zh":"这张河流系统地图显示出许多小支流汇入主河道的树枝状结构。"},{"en":"Under the microscope, the neuron’s arborescence looks like a delicate network of branches.","zh":"在显微镜下，神经元的树枝状分支看起来像一张精细的网络。"}]},{"partOfSpeech":"n.","definition":{"en":"In mathematics and computer science, a directed tree structure where all nodes are reachable from a single root following the direction of the arrows (a rooted directed tree).","zh":"（数学/计算机）有向树：从一个根节点出发，沿箭头方向可以到达所有节点的树状结构（根式有向树）。"},"examples":[{"en":"The routing protocol builds an arborescence rooted at the server to distribute updates efficiently.","zh":"该路由协议建立一个以服务器为根的有向树，以高效分发更新。"},{"en":"We proved the graph contains an arborescence spanning all vertices from the chosen root.","zh":"我们证明该图中存在一个从所选根节点出发、覆盖所有顶点的有向生成树。"}]}],"synonyms":["branching pattern","tree-like structure","(math/CS) directed tree","(math/CS) rooted tree"],"phonetic":"/ˌɑr.bəˈrɛs.əns/","extraExplanation":["词源来自拉丁语 arbor（树）+ -escence（“逐渐形成/呈现……状态”），所以 arborescence 带有“逐渐长成树状分叉”的感觉。","常见于生物学（神经元、血管、珊瑚）、地理（河网、三角洲）以及化学/材料（结晶形成的树枝状图案 dendrite）。","相关词：arboreal（树上的/与树有关的），arborescent（呈树枝状的，形容词）；在计算机领域也常说 directed tree / rooted tree 来表达类似概念。"]}
{"word":"arborescent","summary":{"en":"“Arborescent” means tree-like, especially describing something that branches like a tree.","zh":"“Arborescent”意为“树状的”，常指结构或纹理像树一样分叉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Tree-like in shape or structure; having a branching pattern like a tree.","zh":"树状的；像树一样分枝的；呈树形结构的。"},"examples":[{"en":"The river looked arborescent from above, with many small streams branching out.","zh":"从空中看，这条河呈树状，许多小支流向外分叉。"},{"en":"Doctors described an arborescent pattern of veins on the scan.","zh":"医生在扫描图上描述到血管呈树枝状分布。"}]}],"synonyms":["tree-like","branching","ramified","dendritic"],"phonetic":"/ˌɑɹbəˈɹɛsənt/","extraExplanation":["词源提示：arborescent 来自拉丁语 arbor（“树”）。它常用于书面语或科学语境（如生物学、医学、地理学、材料科学）来描述“像树一样分叉”的结构。","常见搭配：arborescent pattern（树状图案/结构）、arborescent veins（树枝状静脉）、arborescent branching（树状分枝）。","易混词：arborous 通常指“多树的/林木繁茂的”（形容地方），而 arborescent 强调“结构像树、呈分枝形”。"]}
{"word":"arborescently","summary":{"en":"Arborescently means “in a tree-like, branching pattern.”","zh":"arborescently 意为“以树状、分枝的模式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a tree-like or branching way; with a structure that spreads out like a tree (often used in science, medicine, or descriptive writing).","zh":"以树状（分枝）方式；呈树一样向外分叉扩展（常见于科学、医学或描写性语境）。"},"examples":[{"en":"The river delta spreads arborescently across the coastal plain.","zh":"这片河流三角洲在沿海平原上呈树状分布。"},{"en":"Under the microscope, the neurons branch arborescently from the cell body.","zh":"在显微镜下，神经元从胞体呈树状分叉。"},{"en":"Cracks formed arborescently in the dried mud.","zh":"干涸的泥地上出现了树状裂纹。"}]}],"synonyms":["branchingly","dendritically","tree-like"],"phonetic":"/ˌɑɹbəˈɹɛsəntli/","extraExplanation":["“arborescently”来自形容词“arborescent”（树状的）+ 副词后缀“-ly”，字面意思就是“以树状的方式”。","这个词比较少见，更多出现在较正式或专业的描述里（如生物学：神经元/血管分支；地理：河网/三角洲；材料学：裂纹形态）。日常口语更常用“in a branching way / like a tree”。"]}
{"word":"arboresque","summary":{"en":"Arboresque means “tree-like,” especially branching in a pattern or design.","zh":"arboresque 表示“像树的”，尤指呈树枝状分叉的图案或结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a pattern, shape, or design) resembling trees or branching like a tree.","zh":"（图案、形状或设计）像树的；呈树枝状分叉的。"},"examples":[{"en":"The river forms an arboresque network of channels across the delta.","zh":"这条河在三角洲形成了树枝状分叉的水道网络。"},{"en":"She wore a scarf with an arboresque pattern of vines and branches.","zh":"她戴着一条围巾，上面是藤蔓与枝条组成的树状图案。"},{"en":"Under the microscope, the neurons showed arboresque branching.","zh":"在显微镜下，神经元呈现出树枝状分支。"}]}],"synonyms":["tree-like","branching","ramified","dendritic"],"phonetic":"/ˌɑr.bəˈrɛsk/","extraExplanation":["该词源自法语 arboresque，来自拉丁语 arbor（“树”）。在艺术与建筑语境中，它常用来形容“枝蔓般分叉、像树一样扩展”的装饰线条或纹样；在科学语境（如生物学、医学）中，也常形容细胞、血管或神经的“树状分支”。","易混词：arbor（树荫棚/凉亭）与 arboreal（树上的、栖树的）。arboresque 更强调“形态像树、分叉成网”。"]}
{"word":"arboret","summary":{"en":"An arboretum is a garden or park focused on collecting and displaying many kinds of trees for education and conservation.","zh":"arboretum 指以树木与木本植物为主、兼具教育与保育功能的树木园。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A place (like a park or garden) where many kinds of trees and woody plants are grown and labeled for study, conservation, and public enjoyment.","zh":"植物园中的一种——以树木与木本植物为主的园区，通常会标注名称，用于研究、保育与公众参观。"},"examples":[{"en":"We spent the afternoon walking through the arboretum and reading the tree labels.","zh":"我们下午在树木园里散步，还读了树牌上的信息。"},{"en":"The university arboretum protects rare native trees.","zh":"大学的树木园保护一些稀有的本土树种。"}]}],"synonyms":["tree garden","tree park"],"phonetic":"/ˌɑr.bəˈriː.t̬əm/","extraExplanation":["你输入的“arboret”在英语里不常见；多数情况下人们想写的是 **arboretum**（树木园）。","**词源小知识**：arboretum 来自拉丁语 *arbor*（树）。复数常见两种：**arboretums**（更常用）或 **arboreta**（较书面/学术）。","与 **botanical garden（植物园）** 的区别：植物园涵盖各种植物；arboretum 更强调树木与木本植物。"]}
{"word":"arboreta","summary":{"en":"“Arboreta” is the plural of “arboretum,” meaning places that collect and display many kinds of trees.","zh":"“arboreta”是“arboretum”的复数，指收集与展示多种树木的树木园。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of arboretum: botanical gardens or collections where many kinds of trees (and often shrubs) are grown for study, conservation, and public enjoyment.","zh":"arboretum 的复数：树木园/植物园中的一类，专门（或主要）收集、栽培多种树木（也常包括灌木），用于研究、保育与公众参观。"},"examples":[{"en":"The university manages several arboreta for teaching and research.","zh":"这所大学管理着几座树木园，用于教学和研究。"},{"en":"We visited two arboreta in New England to see the autumn colors.","zh":"我们去新英格兰参观了两座树木园，欣赏秋天的色彩。"},{"en":"Many arboreta label their trees so visitors can learn the names and origins.","zh":"许多树木园都会给树木做标牌，让游客了解名称与产地。"}]}],"synonyms":["arboretums","tree gardens","botanical gardens (broader)"],"phonetic":"/ˌɑr.bəˈriː.tə/","extraExplanation":["“arboreta”来自拉丁语复数形式（arboretum → arboreta）。在现代英语里也常见规则复数“arboretums”，两者都正确；在较正式或学术语境中“arboreta”更常见。","“arboretum”与一般“botanical garden（植物园）”的区别：arboretum更强调“树木”收藏与展示，但很多树木园也会种植其他植物。"]}
{"word":"arboretum","summary":{"en":"An arboretum is a tree-focused garden where many kinds of trees are grown and labeled for education, study, and enjoyment.","zh":"arboretum 指以树木为主的园区，种植并标识多种树木，用于学习研究与公众游览。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place where many kinds of trees (and often shrubs) are grown, labeled, and cared for, especially for study, education, and public enjoyment","zh":"树木园；植物园中的树木专类园（种植、标识并养护多种树木，常用于研究、教育与公众游览）"},"examples":[{"en":"We spent Saturday afternoon walking through the arboretum and reading the tree labels.","zh":"我们周六下午在树木园里散步，还读了树牌说明。"},{"en":"The university arboretum is used for botany classes and research.","zh":"大学的树木园用于植物学课程和研究。"},{"en":"In autumn, the arboretum is especially popular for its colorful leaves.","zh":"秋天的树木园因彩叶而特别受欢迎。"}]}],"synonyms":["tree garden","tree museum","botanical garden (broader)"],"phonetic":"/ˌɑːr.bəˈriː.t̬əm/","extraExplanation":["“arboretum”来自拉丁语 arbor（树），本义与“树”有关。很多 arboretum 会按树种、地区或生态环境分区，并用标牌介绍名称与特征，兼具科普与休闲功能。","与“botanical garden（植物园）”相比，arboretum 更强调“树木”为主；但不少植物园里会设有 arboretum 区域。"]}
{"word":"arboretums","summary":{"en":"“Arboretums” is the plural of “arboretum”: a garden or park for growing and studying many kinds of trees.","zh":"“arboretums”是“arboretum”的复数：指用于栽培与研究多种树木的树木园。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place (garden or park) where many kinds of trees are grown and studied, often for education and research","zh":"（常用于教育与研究的）树木园；植物园中的树木专类园"},"examples":[{"en":"We took a quiet walk through the arboretum to look at the maples and pines.","zh":"我们在树木园里安静地散步，观赏枫树和松树。"},{"en":"The university arboretum labels each tree with its scientific and common name.","zh":"大学的树木园会给每棵树标注学名和常用名。"},{"en":"In autumn, the arboretum becomes a popular place for leaf-peeping.","zh":"到了秋天，树木园成了赏枫看彩叶的热门地点。"}]}],"synonyms":["tree garden","tree park","botanical garden (broader)"],"phonetic":"/ˌɑr.bəˈriː.t̬əm/","extraExplanation":["“arboretum”来自拉丁语 arbor（树）。复数既可用更常见的 arboretums，也可用较学术的 arboreta。","arboretum 通常以“树”为重点；botanical garden（植物园）更广泛，可能包含花卉、温室、多种植物分类区等。"]}
{"word":"arborical","summary":{"en":"“Arborical” is a rare adjective meaning “related to trees” or “tree-like.”","zh":"“arborical”是个罕见形容词，意为“与树有关的”或“树状的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Relating to trees or to something shaped like a tree.","zh":"（罕见）与树有关的；树状的。"},"examples":[{"en":"The artist used an arborical pattern that looked like branching limbs.","zh":"这位艺术家用了树状图案，看起来像分叉的树枝。"},{"en":"Some early notes describe the region’s arborical cover as dense and shady.","zh":"一些早期记录把该地区的树木覆盖描述为茂密而阴凉。"}]}],"synonyms":["tree-related","tree-like","arboreal","arboricultural"],"phonetic":"ɑrˈbɔrɪkəl","extraExplanation":["“arborical”在现代英语中很少见；更常用的是“arboreal”（指“栖于树上的/与树有关的”，尤其用于动物或生态语境）和“arboricultural”（指“树木栽培/树艺/树木管理的”，更偏园艺或专业领域）。","词根来自拉丁语“arbor”（树）。如果你想表达“树上的（动物）”，通常选“arboreal”；如果你想表达“与树木栽培管理有关”，选“arboricultural”。"]}
{"word":"arboricole","summary":{"en":"Arboricole means “tree-dwelling” (most common) and, more rarely, “related to tree cultivation.”","zh":"arboricole 指“树栖的/栖居树上的”（最常见），也可较少见地指“与树木栽培养护有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"living in trees; tree-dwelling (used of animals, especially insects).","zh":"（动物等）栖居树上的；树栖的（尤用于昆虫等）。"},"examples":[{"en":"Many ants have arboricole nests in tropical forests.","zh":"许多蚂蚁在热带森林里有树栖的巢。"},{"en":"The arboricole beetle spends most of its life on bark and branches.","zh":"这种树栖甲虫一生大多时间待在树皮和枝条上。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the cultivation or care of trees (rare; often replaced by “arboricultural”).","zh":"与树木栽培、养护有关的（较少见；常用 arboricultural）。"},"examples":[{"en":"The city adopted arboricole practices to protect street trees.","zh":"这座城市采用与树木养护相关的做法来保护行道树。"},{"en":"She wrote a short arboricole guide for new park workers.","zh":"她为新入职的公园工作人员写了一本简短的树木养护指南。"}]}],"synonyms":["arboreal","arboricolous","tree-dwelling","arboricultural"],"phonetic":"/ˌɑr.bərˈɪk.oʊl/","extraExplanation":["“arboricole”在现代英语中非常少见，更常见的是 **arboreal**（树栖的）或 **arboricolous**（树栖的，偏学术/生物学），以及 **arboricultural**（树木栽培与养护的）。","词源上可联想拉丁语 *arbor*（树）。在自然纪录片或生物学描述中，谈到动物“生活在树上”时用 **arboreal** 最自然。"]}
{"word":"arboricoline","summary":{"en":"“Arboricoline” means living in trees or adapted to life in trees.","zh":"“arboricoline”指“树栖的；适应在树上生活的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"living in trees; adapted to life in trees (arboreal)","zh":"树栖的；适应在树上生活的（同 arboreal）"},"examples":[{"en":"Many monkeys are arboricoline, spending most of their time in the canopy.","zh":"许多猴子是树栖动物，大部分时间都在树冠层活动。"},{"en":"The arboricoline lizard has long toes that help it grip branches.","zh":"这种树栖蜥蜴的脚趾很长，有助于抓握树枝。"}]}],"synonyms":["arboreal","tree-dwelling","arboricolous"],"phonetic":"/ˌɑr.bəˈrɪk.əˌlaɪn/","extraExplanation":["“arboricoline”较少见，更常用的词是 **arboreal**（树栖的）或 **tree-dwelling**（住在树上的）。","词形上可理解为 **arbor-**（拉丁语词根，意为“树”）+ 表示“栖居/生活方式”的构词成分，整体强调“以树为栖息地”。在动物学/生态学语境中更容易见到。"]}
{"word":"arboricolous","summary":{"en":"Arboricolous means living in trees (a formal biology word).","zh":"arboricolous 指“栖居在树上的”（较正式的生物学用语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Living in trees; tree-dwelling.","zh":"（动物等）栖居在树上的；树栖的。"},"examples":[{"en":"Many monkeys are arboricolous and spend most of their time in the canopy.","zh":"许多猴子是树栖动物，大部分时间都在树冠层活动。"},{"en":"The arboricolous lizard climbed quickly up the trunk to escape predators.","zh":"这只树栖蜥蜴迅速爬上树干以躲避捕食者。"}]}],"synonyms":["arboreal","tree-dwelling","arborous"],"phonetic":"/ˌɑɹ.bɔˈɹɪk.ə.ləs/","extraExplanation":["词源：来自拉丁语 *arbor*（树）+ *-colous*（居住的、栖居的，源自 *colere*“居住/栽培”）。因此字面意思就是“住在树上的”。","用法提示：这是生物学/动物学里较正式的词，日常英语更常说 *tree-dwelling* 或 *arboreal*（更常见的同义词）。"]}
{"word":"arboricultural","summary":{"en":"“Arboricultural” means relating to the professional care and management of trees.","zh":"“arboricultural”意为“与专业树木养护与管理（树艺）相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to arboriculture: the cultivation, care, and management of trees (especially in towns, parks, and managed landscapes).","zh":"与树艺学/树木栽培管理有关的：指对树木（尤其在城市、园林等人工环境中）的栽培、养护与管理。"},"examples":[{"en":"The city hired an arboricultural consultant to assess street trees after the storm.","zh":"暴风雨过后，市政府聘请了一位树木养护（树艺）顾问来评估行道树。"},{"en":"Arboricultural work includes pruning, tree health checks, and risk management.","zh":"树艺工作包括修剪、树木健康检查和风险管理。"}]}],"synonyms":["arboreal (related but broader)","tree-care (informal)","arboriculture-related"],"phonetic":"/ˌɑɹ.bəɹ.əˈkʌl.tʃɚ.əl/","extraExplanation":["“arboricultural”来自拉丁语 arbor（树）+ -culture（栽培/培养）。它常用于专业语境，如 arboricultural report（树木评估/树艺报告）、arboricultural officer（树艺官员/树木管理人员）。","常见区分：forestry（林业）多指大面积森林资源的经营与生产；arboriculture（树艺/城市树木学）更常指单株树木与城市/园林环境中的管理。"]}
{"word":"arboriculture","summary":{"en":"Arboriculture is the care and management of individual trees, especially in urban and landscaped areas.","zh":"Arboriculture 指对单株树木（尤其城市与景观环境中的树木）进行栽培、养护与管理的学科与实践。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the science and practice of planting, caring for, and managing trees (especially in towns, parks, and landscaped areas)","zh":"树艺学；城市/园林树木的栽培、养护与管理（尤其指城市、公园和景观中的树木）"},"examples":[{"en":"Arboriculture focuses on keeping individual trees healthy and safe in cities.","zh":"树艺学关注在城市中让单株树木保持健康并确保安全。"},{"en":"She studied arboriculture and now works as a certified arborist.","zh":"她学习了树艺学，现在是一名认证树艺师（arborist）。"},{"en":"Good arboriculture includes pruning at the right time of year to protect the tree.","zh":"良好的树木养护包括在合适的季节修剪，以保护树木。"}]}],"synonyms":["tree care","tree management","tree cultivation"],"phonetic":"ˌɑɹbɚˈɪkʌltʃɚ","extraExplanation":["与 forestry（林学/林业）相比，arboriculture 更强调“单株树木”的养护与风险管理，常见于城市绿化、庭院、公园等场景；forestry 更偏向“森林整体”的经营与资源管理。","常见相关职业：arborist（树艺师/树木医生），常做修剪（pruning）、病虫害诊断、树木健康评估与安全检查（如防止倒伏）。","词源提示：arbor- 来自拉丁语，意为“树”，-culture 表示“栽培/培育”（同 agriculture 农业、horticulture 园艺）。"]}
{"word":"arboriculture-related","summary":{"en":"Arboriculture-related means connected with the study and professional care of trees.","zh":"arboriculture-related 指与树艺学/树木专业养护有关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with arboriculture (the study and care of trees), especially in work such as planting, pruning, diagnosing tree problems, or managing urban trees.","zh":"与树艺学/树木养护（arboriculture）有关的；尤指与植树、修剪、树木病虫害诊断或城市树木管理等工作相关的。"},"examples":[{"en":"The city is hiring arboriculture-related staff to inspect street trees after storms.","zh":"市政府正在招聘与树木养护相关的人员，在暴风雨后检查行道树。"},{"en":"She took arboriculture-related courses on pruning and tree risk assessment.","zh":"她选修了与树艺学相关的课程，包括修剪和树木风险评估。"},{"en":"The report lists arboriculture-related costs, such as removing hazardous branches.","zh":"报告列出了与树木养护相关的费用，例如清除有危险的树枝。"}]}],"synonyms":["tree-care-related","arborist-related","tree-management-related","urban-forestry-related"],"phonetic":"/ˌɑr.bərˈɪk.əl.tʃər rɪˈleɪ.tɪd/","extraExplanation":["“arboriculture-related”是由名词“arboriculture（树艺学/树木养护）”+ “related（相关的）”构成的复合形容词，常用连字符连接，尤其在正式写作中更常见。","含义通常偏向“树木管理/养护的专业领域”，与“forestry（林业，常指森林与木材生产管理）”有所区别：前者更常见于城市树木、园林树木与单株树木的照护。"]}
{"word":"arboriculturist","summary":{"en":"An arboriculturist is a tree-care specialist, especially for trees in managed places like cities and parks.","zh":"arboriculturist 指树木养护与管理方面的专业人员，常见于城市与公园等人工管理环境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who studies, plants, and takes care of trees, especially in cities, parks, and other managed areas.","zh":"树艺师；树木养护师（研究、种植并维护树木的人，尤指城市、公园等人工管理环境中的树木）"},"examples":[{"en":"The arboriculturist inspected the street trees for signs of disease.","zh":"树艺师检查了行道树是否有病害迹象。"},{"en":"Our city hired an arboriculturist to improve tree health after the storm.","zh":"暴风雨过后，我们的城市雇了一位树艺师来改善树木健康。"},{"en":"An arboriculturist can recommend safe pruning methods.","zh":"树艺师可以建议安全的修剪方法。"}]}],"synonyms":["arborist","tree surgeon (BrE)","tree-care specialist"],"phonetic":"/ˌɑr.bə.rɪˈkʌl.tʃə.rɪst/","extraExplanation":["“arboriculturist”来自拉丁语词根 arbor（树）+ culture（栽培、培育），与“agriculture（农业）”中的 -culture 同源。","常见相关词：arboriculture（树木栽培/树艺学，学科或行业）；arborist（树艺师，更口语、更常用，尤其指修剪与树木安全评估的人）。","区别小提示：forester（林务员）多与森林、林业资源管理有关；arboriculturist/arborist 更聚焦单株树木的健康、安全与修剪，常见于城市绿化与园林。"]}
{"word":"arboriform","summary":{"en":"Arboriform means “tree-shaped” or “branching like a tree,” used mostly in scientific or formal descriptions.","zh":"Arboriform 指“树状的、像树一样分枝的”，多用于科学或较正式的描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Tree-shaped; branching like a tree, with a main “trunk” and smaller branches spreading out.","zh":"树状的；像树一样分枝的（有主干并向外分出许多枝条）。"},"examples":[{"en":"Under the microscope, the neuron’s arboriform structure looked like a tiny tree.","zh":"在显微镜下，神经元的树状结构看起来像一棵小树。"},{"en":"The river forms an arboriform pattern as it splits into many smaller channels.","zh":"这条河在分成许多小支流时形成了树状的分布。"}]}],"synonyms":["tree-like","branching","dendritic","arborescent"],"phonetic":"/ˌɑr.bəˈrɪf.ɔrm/","extraExplanation":["该词较书面、偏学术，常见于生物学（如“树突”分支）、解剖学、地理学（河网/三角洲）、以及描述某些装饰图案或裂纹的形态。","词源上可拆为拉丁语 arbor（树）+ -form（形状），与 “arboreal”（树上的/与树有关的）同源但含义不同：arboreal 强调“与树相关/栖于树上”，arboriform 强调“形状像树”。"]}
{"word":"arborise","summary":{"en":"Arborise means (1) to branch out like a tree, or (2) to cause something to develop tree-like branches. It’s the British spelling of “arborize.”","zh":"Arborise 指（1）像树一样分枝、呈树枝状；或（2）使某物呈树枝状分叉。它是“arborize”的英式拼写。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to branch out like a tree; to develop a tree‑like shape or pattern","zh":"像树一样分枝；呈现树枝状结构"},"examples":[{"en":"On the CT scan, the blood vessels arborised into many fine branches.","zh":"在CT扫描中，血管呈树枝状分出许多细小分支。"},{"en":"Cracks can arborise across the surface of old paint.","zh":"裂纹会在旧油漆表面呈树枝状蔓延。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something branch out like a tree; to cause to develop branching structures","zh":"使……分枝；使呈树枝状结构"},"examples":[{"en":"The diagram arborises the main idea into smaller topics.","zh":"这张图把主要观点分成树枝状的几个小主题。"},{"en":"In biology, some chemicals can arborise nerve endings during development.","zh":"在生物学中，一些化学物质可能在发育过程中使神经末梢呈树枝状分支。"}]}],"synonyms":["branch","ramify","diverge","spread out","arborize"],"phonetic":"/ˈɑrbəˌraɪz/","extraExplanation":["“arborise”是英式拼写，对应美式拼写“arborize”。在医学/生物学与技术写作里更常见，用来形容血管、神经、裂纹、图表等“树枝状分叉”的形态。","词根来自拉丁语“arbor”（树）。因此它的核心意象就是“像树一样分出许多枝”。"]}
{"word":"arborist","summary":{"en":"An arborist is a tree-care professional who maintains and protects trees.","zh":"arborist 指专业的树木护理人员，负责养护、修剪并保护树木。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person trained to care for trees—especially by planting, pruning, diagnosing problems, and safely removing trees when necessary.","zh":"树艺师；树木护理师（受过专业训练，负责种植、修剪、诊断树木问题，并在必要时安全移除树木的人）"},"examples":[{"en":"The arborist pruned the oak to keep it healthy and away from power lines.","zh":"树艺师修剪了那棵橡树，让它更健康，并避免碰到电线。"},{"en":"If your tree looks sick, an arborist can identify pests or disease.","zh":"如果你的树看起来生病了，树艺师可以判断是否有虫害或疾病。"},{"en":"The city hired an arborist to manage trees in public parks.","zh":"市政府雇了一位树艺师来管理公共公园里的树木。"}]}],"synonyms":["tree surgeon","tree-care specialist"],"phonetic":"/ˈɑɹbɚɪst/","extraExplanation":["“arborist”来自拉丁语 arbor（树）。在美国日常用法里，它常指从事“树木养护/树木外科（tree care/tree surgery）”的专业人员，比“gardener（园丁）”更专门、也更强调安全与技术。","常见搭配：certified arborist（认证树艺师）、tree pruning（修剪树木）、tree removal（移除树木）、tree risk assessment（树木风险评估）。","相关词区分：forester（林务员/林学家）更偏森林与大范围林业管理；arborist更常处理城市/庭院等环境中的单棵或少量树木。"]}
{"word":"arborists","summary":{"en":"Arborists are professionals who care for and manage trees, especially in urban areas.","zh":"Arborists 指专业从事树木养护与管理的人，尤其常见于城市环境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person whose job is to care for trees (especially in cities), such as planting, pruning, diagnosing diseases, and removing unsafe trees.","zh":"树艺师；树木护理师（尤其在城市中从事种树、修剪、诊断病虫害与移除危险树木等工作的人）"},"examples":[{"en":"The arborists pruned the street trees to keep branches away from power lines.","zh":"树艺师修剪行道树，让树枝远离电线。"},{"en":"After the storm, the city hired arborists to remove damaged trees safely.","zh":"暴风雨过后，市政府雇用树艺师安全地移除受损的树木。"},{"en":"An arborist can tell whether a tree is sick or just stressed by drought.","zh":"树艺师能判断树是生病了，还是只是因干旱而压力过大。"}]}],"synonyms":["tree surgeon","tree care professional"],"phonetic":"/ˈɑɹbɚɪsts/","extraExplanation":["“arborist”来自拉丁语 arbor（树）。在美国日常用法里，arborist 常指接受过专业训练、懂安全攀树与修剪规范的人；若是做更大范围森林管理的职业，常用 forester（林务员/森林管理者）。","复数 arborists：用于指“多位树艺师/多个树木护理团队”。例如：The arborists are on site today.（树艺师今天在现场。）"]}
{"word":"arborization","summary":{"en":"Arborization means a tree-like branching pattern, especially in biology (nerves, vessels) or natural structures.","zh":"Arborization 指“树枝状分叉”的形态或过程，常用于生物学中描述神经、血管等结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a pattern or process of branching like a tree; the formation of tree-like structures","zh":"树枝状的分枝形态或分枝过程；形成像树一样的结构"},"examples":[{"en":"The leaf veins show clear arborization, spreading from the center like branches.","zh":"叶脉呈现明显的树枝状分叉，从中心向外像树枝一样扩散。"},{"en":"In winter, the bare branches create an arborization against the sky.","zh":"冬天里光秃的树枝在天空映衬下形成树枝状的图案。"}]},{"partOfSpeech":"n.","definition":{"en":"(biology/anatomy) the tree-like branching of nerves, blood vessels, or other structures","zh":"（生物/解剖）神经、血管或其他结构呈树枝状分叉"},"examples":[{"en":"Under the microscope, the neuron’s arborization becomes easier to see.","zh":"在显微镜下，更容易看到神经元的树枝状分支。"},{"en":"Doctors noted arborization of small vessels in the imaging results.","zh":"医生在影像结果中观察到小血管的树枝状分支。"}]}],"synonyms":["branching","ramification","tree-like pattern","dendritic branching"],"phonetic":"/ˌɑr.bə.rəˈzeɪ.ʃən/","extraExplanation":["词源上来自拉丁语 arbor（树）。在科学写作中更常见，日常英语里通常会用 branching / tree-like pattern 来替代。","相关形容词：arborized（呈树枝状的）。在神经科学中也常说 dendritic arbor（树突分枝）。"]}
{"word":"arborize","summary":{"en":"Arborize means to (cause something to) branch out like a tree.","zh":"Arborize 指（使）像树枝一样分叉、呈树状扩展。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to branch out or spread like the branches of a tree; to become tree-like in form","zh":"（形状）像树枝一样分叉、伸展；呈树状"},"examples":[{"en":"Over time, the river arborized into many narrow channels across the delta.","zh":"随着时间推移，这条河在三角洲处分叉成许多狭窄的支流。"},{"en":"The cracks in the dried mud arborized into a fine, branching pattern.","zh":"干涸泥土上的裂纹分叉扩散，形成细密的树枝状纹理。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something branch out in a tree-like way","zh":"使……呈树状分叉；使……像树枝一样分支"},"examples":[{"en":"Engineers arborized the drainage network to carry water away efficiently.","zh":"工程师把排水系统设计成树状分支，以高效排走积水。"},{"en":"The artist arborized the lines in the drawing to suggest veins and roots.","zh":"画家让线条呈树状分叉，以表现叶脉和根系。"}]}],"synonyms":["branch out","ramify","spread","diverge"],"phonetic":"/ˈɑɹ.bəˌɹaɪz/","extraExplanation":["“arborize”来自拉丁语词根 arbor（树）。它在日常英语里很少见，更常出现在地质、解剖学、植物学或技术写作中，用来描述“像树枝一样分叉”的结构。","近义表达（更常用）包括：branch out（向外分支/扩展）、ramify（分支、蔓延，较正式）、form a branching pattern（形成分叉图案）。在医学里也可能用来形容神经、血管等呈树状分布。"]}
{"word":"arborized","summary":{"en":"Arborized means “tree-like and branching,” especially used for patterns in nature or in anatomy (nerves, vessels, tissues).","zh":"Arborized 意为“树枝状分叉的”，常用于描述自然界的形态或解剖结构（如神经、血管、组织）的树状分枝。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a tree-like, branching pattern; shaped like the branches of a tree.","zh":"呈树枝状的；像树一样分叉的（形状或结构）。"},"examples":[{"en":"Under the microscope, the cells showed an arborized pattern.","zh":"在显微镜下，这些细胞呈现出树枝状的形态。"},{"en":"The river forms an arborized network of small channels near the delta.","zh":"这条河在三角洲附近形成了树枝状的小水道网络。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Biology/medicine) Describing nerves, blood vessels, or tissues that branch repeatedly like a tree.","zh":"（生物/医学）描述神经、血管或组织反复分支，呈树状分枝。"},"examples":[{"en":"The arborized nerves spread through the skin.","zh":"树状分支的神经分布在皮肤中。"},{"en":"Doctors noted an arborized appearance of the small vessels on imaging.","zh":"医生在影像检查中注意到小血管呈树枝状外观。"}]}],"synonyms":["branching","tree-like","ramified","dendritic"],"phonetic":"/ˈɑr.bəˌraɪzd/","extraExplanation":["“arborized”来自动词“arborize”（使……呈树枝状分支）。“arbor-”与拉丁语中“树”有关，因此这个词常用于形容自然界或人体结构的“像树一样分叉”的形态。","在医学/生物学语境中，这种“树状分支”通常强调结构的层级分叉与扩散（如神经、血管、支气管等），常见搭配有 arborized vessels / arborized nerves / arborized pattern。"]}
{"word":"arborizes","summary":{"en":"“Arborizes” means “branches out like a tree,” especially describing nerves, blood vessels, or roots; it can also rarely mean “plants with trees.”","zh":"“Arborizes”主要指“像树一样分枝”（常用于神经、血管、根系等的描述）；也可罕见地表示“种树”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(especially in biology) to branch out like a tree; to form many smaller branches from a main stem (e.g., nerves, blood vessels, coral).","zh":"（尤指生物学）像树一样分枝；从主干分出许多细小分支（如神经、血管、珊瑚等）。"},"examples":[{"en":"The neuron arborizes widely in the cortex.","zh":"这个神经元在大脑皮层中广泛分枝。"},{"en":"As the root grows, it arborizes into finer and finer branches.","zh":"随着根系生长，它不断分枝，变得越来越细。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare) to plant with trees; to turn an area into a grove.","zh":"（罕见）种树；使某地成为林地/树丛。"},"examples":[{"en":"The city arborizes the riverbanks to reduce heat and erosion.","zh":"这座城市在河岸种树，以减少热岛效应和水土流失。"}]}],"synonyms":["branch out","sprout","ramify","diverge","spread out","tree out"],"phonetic":"/ˈɑr.bəˌraɪz/","extraExplanation":["“arborizes”是动词“arborize”的第三人称单数（he/she/it arborizes）。更常见于学术与医学写作，如“dendrites arborize”（树突分枝）、“vessels arborize”（血管呈树状分布）。","词根来自拉丁语“arbor”（树），所以核心意象就是“树状分叉”。日常英语里更常用的替代说法有“branch out / form branches / spread out”。"]}
{"word":"arborizing","summary":{"en":"“Arborizing” means branching out like a tree, especially in biology or medicine (nerves, blood vessels, etc.).","zh":"“Arborizing”指像树一样分枝的形态，常用于生物学/医学语境（如神经、血管等）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of nerves, blood vessels, or other structures) branching out like a tree; tree-like in shape.","zh":"（指神经、血管或其他结构）像树一样分枝的；树枝状的。"},"examples":[{"en":"Under the microscope, the neuron shows an arborizing pattern of branches.","zh":"在显微镜下，这个神经元呈现出树枝状分叉的形态。"},{"en":"The scan revealed arborizing blood vessels feeding the tumor.","zh":"扫描显示有树枝状分叉的血管为肿瘤供血。"}]},{"partOfSpeech":"v.","definition":{"en":"forming or developing tree-like branches (present participle of “arborize”).","zh":"形成或发展出树枝状分叉（“arborize”的现在分词）。"},"examples":[{"en":"The nerve fibers are arborizing as they approach the muscle.","zh":"当神经纤维接近肌肉时，它们开始树枝状分叉。"},{"en":"Dendrites keep arborizing during early development.","zh":"在早期发育阶段，树突会不断分枝。"}]}],"synonyms":["branching","tree-like","ramifying"],"phonetic":"ˈɑrbəˌraɪzɪŋ","extraExplanation":["“arbor-”来自拉丁语 *arbor*（树）。在医学与生物学写作中很常见：如“arborizing dendrites（树枝状树突）”“arborizing vessels（树枝状血管）”。","常见搭配：arborizing pattern（树枝状模式）、arborizing branches（树枝状分支）、arborization（名词：树枝状分支/分枝现象）。"]}
{"word":"arborlike","summary":{"en":"“Arborlike” means tree-shaped or branching like a tree.","zh":"“arborlike”指“树状的；像树一样分枝的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a tree in shape or structure; branching like a tree.","zh":"树状的；像树一样的（形状或结构上呈分枝状）。"},"examples":[{"en":"The arborlike pattern of blood vessels spreads through the body in many branching paths.","zh":"血管呈树状分布，在身体里沿着许多分枝路径延伸。"},{"en":"Under the microscope, the arborlike neurons looked like tiny trees.","zh":"在显微镜下，树状的神经元看起来像一棵棵小树。"}]}],"synonyms":["treelike","arborescent","branching","dendritic"],"phonetic":"/ˈɑrbɚˌlaɪk/","extraExplanation":["“arbor-”来自拉丁语，意思是“树”（tree）。“-like”表示“像……一样”。因此 arborlike = “像树一样的/树状的”。","这个词常见于科学写作（如生物学、医学、地质学、计算机图结构等），用来形容“分枝、层级、像树的形态”。"]}
{"word":"arboroid","summary":{"en":"Arboroid means “tree-like,” especially describing a branching structure.","zh":"Arboroid 表示“树状的、像树一样的”，常指分枝结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Tree-like in form; resembling a tree in shape or branching pattern.","zh":"树状的；外形或分枝结构像树的。"},"examples":[{"en":"Under the microscope, the neurons showed an arboroid branching pattern.","zh":"在显微镜下，这些神经元呈现出树状的分枝结构。"},{"en":"The fungus formed arboroid networks that spread across the wood.","zh":"这种真菌形成了树状网络，沿着木头扩散。"}]}],"synonyms":["tree-like","arborescent","dendritic"],"phonetic":"/ˈɑɹbɚˌɔɪd/","extraExplanation":["词源提示：arbor- 来自拉丁语 arbor（“树”），-oid 表示“……样的/类似……的”。所以 arboroid 直译就是“像树一样的”。","使用场景：该词多见于生物学、医学与技术写作，用来描述“分枝像树”的结构（如神经元、血管、晶体、生长纹理等），日常口语中较少用。"]}
{"word":"arborolater","summary":{"en":"An “arborolater” is someone who worships trees, or (jokingly) someone who loves trees intensely.","zh":"“arborolater”指崇拜树木的人；也可（带玩笑意味）指特别爱树、对树着迷的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who worships trees; someone who practices tree-worship.","zh":"崇拜树木的人；从事“树木崇拜”的人。"},"examples":[{"en":"Some early writers used the word “arborolater” to describe people who worshiped sacred trees.","zh":"一些早期作家用“arborolater”来形容崇拜神圣树木的人。"},{"en":"In the story, the villagers treat the old oak as holy, almost like arborolaters.","zh":"在故事里，村民把那棵老橡树当作神圣之物，几乎像树木崇拜者一样。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative, often humorous) a person who loves trees extremely or is obsessed with them.","zh":"（比喻、常带幽默）特别爱树、对树“痴迷”的人。"},"examples":[{"en":"He’s a bit of an arborolater—he knows the name of every tree in the park.","zh":"他有点像个“树木迷”——公园里的每一棵树他都叫得出名字。"},{"en":"My arborolater friend insists we plant native trees in the yard.","zh":"我那位“树木迷”朋友坚持我们在院子里种本地树种。"}]}],"synonyms":["tree-worshipper","arborolatrist","nature worshipper (approx.)"],"phonetic":"/ˌɑr.bəˈrɑl.ə.tər/","extraExplanation":["“arborolater”较少见，更常见的相关词是“arborolatry”（树木崇拜）以及形容词“arborolatrous”。","词源上与拉丁语 arbor（树）有关，后半部分与 -latry（崇拜）同源，也可联想“idolatry”（偶像崇拜）。"]}
{"word":"arborolatrist","summary":{"en":"An arborolatrist is a person who worships trees.","zh":"arborolatrist 指“崇拜树木的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who worships trees; someone who shows religious devotion to trees (tree-worship).","zh":"崇拜树木的人；把树木当作神圣对象来敬拜的人（树木崇拜者）。"},"examples":[{"en":"In the novel, the old hermit is rumored to be an arborolatrist who prays beneath an ancient oak.","zh":"在小说里，那位老隐士据说是个崇拜树木的人，会在一棵古老的橡树下祈祷。"},{"en":"The museum label notes that some ancient communities were sometimes described by outsiders as arborolatrists.","zh":"博物馆的说明牌提到，一些古代社群有时会被外人称为“树木崇拜者”。"}]}],"synonyms":["tree worshipper","tree-worshipper","dendrolater","arborolator"],"phonetic":"/ˌɑr.bəˈroʊ.lə.trɪst/","extraExplanation":["这个词比较少见，来自拉丁语词根：arbor（树）+ -latry / -latrist（崇拜/崇拜者），含义接近“树木崇拜”。在现代英语里更常见的说法是 tree worshipper 或 tree-worshipper。","在文化与宗教学语境中，有时会用它来描述某些自然崇拜或民间信仰；但在写作中要注意语气，有时带有“外部观察者的标签”色彩，可能显得不够中立。"]}
{"word":"arborolatry","summary":{"en":"Arborolatry means the worship or sacred reverence of trees.","zh":"Arborolatry 指对树木的敬拜或将树木视为神圣的崇敬。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The worship of trees; reverence for trees as sacred or divine.","zh":"树木崇拜；把树木当作神圣或具有神性的崇敬与敬拜。"},"examples":[{"en":"Some early religions included forms of arborolatry, treating certain groves as holy places.","zh":"一些早期宗教包含树木崇拜的形式，把某些树林视为圣地。"},{"en":"The novel mentions arborolatry to show how deeply the community respected the ancient oak.","zh":"小说用“树木崇拜”来表现这个社群对那棵古老橡树的深切敬重。"}]}],"synonyms":["tree worship","dendrolatry","nature worship"],"phonetic":"/ˌɑːr.bəˈrɑː.lə.tri/","extraExplanation":["词源上可拆解为 arbor（树）+ -latry（崇拜），与 idololatry（偶像崇拜）、heliolatry（太阳崇拜）结构相似。","在文化与人类学语境里，它常用于描述某些传统社会对“圣树”“神木”或特定林地的仪式性尊崇；现代写作中也可能带一点文学色彩，用来强调对自然的近乎宗教式敬畏。"]}
{"word":"arborous","summary":{"en":"Arborous (usually “arboreous”) means “related to trees” or “living in trees.”","zh":"arborous（通常写作 arboreous）意思是“与树木有关/树木繁茂的”，也可指“栖树的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Usually spelled “arboreous”) Related to trees; consisting of or covered with trees.","zh":"（通常拼作 arboreous）与树木有关的；由树木组成的；树木繁茂的。"},"examples":[{"en":"They walked through an arboreous valley filled with tall pines.","zh":"他们穿过一片树木繁茂的山谷，那里长满了高大的松树。"},{"en":"The region is famous for its arboreous landscape.","zh":"这个地区以树木繁多的景观而闻名。"}]},{"partOfSpeech":"adj.","definition":{"en":"Living in trees; tree-dwelling (often used for animals).","zh":"栖树的；生活在树上的（常用于动物）。"},"examples":[{"en":"Many arboreous animals move quickly from branch to branch.","zh":"许多栖树动物能在树枝间快速穿梭。"},{"en":"The monkey is an arboreous species.","zh":"这种猴子是栖树物种。"}]}],"synonyms":["arboreal","wooded","tree-covered","forest"],"phonetic":"/ɑrˈbɔriəs/","extraExplanation":["“arborous”在现代英语里很少见，常被视为“arboreous”的变体或拼写错误；更标准、更常见的拼法是“arboreous”。","词根来自拉丁语“arbor”（树），所以含义通常都与“树、树木环境、栖树生活”相关。"]}
{"word":"arbors","summary":{"en":"“Arbors” usually means garden arbors—shaded structures often covered with climbing plants; in literary use, it can also mean trees.","zh":"“arbors”通常指花园里的棚架/凉棚（常有藤蔓遮阴）；在文学语境中也可指“树”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “arbor”: a shaded garden structure or covered passageway (often with climbing plants) used for sitting or walking under.","zh":"“arbor”的复数：花园里的棚架/凉亭或有遮蔽的走廊（常有藤蔓植物攀爬），用于乘凉或在下面行走。"},"examples":[{"en":"The park has several arbors covered in roses.","zh":"公园里有好几座爬满玫瑰的花架凉棚。"},{"en":"We ate lunch under one of the arbors to stay out of the sun.","zh":"我们在一座凉棚下面吃午饭，避开太阳。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “arbor”: a tree (used especially in poetry or older/literary writing).","zh":"“arbor”的复数：树（多见于诗歌或较古典/文学语境）。"},"examples":[{"en":"Ancient arbors shaded the quiet path.","zh":"古老的树木为安静的小路投下阴影。"},{"en":"In the poem, arbors stand as symbols of endurance.","zh":"在诗中，树木象征着坚韧。"}]}],"synonyms":["pergolas","trellises","gazebos","trees"],"phonetic":"/ˈɑr.bɚ/","extraExplanation":["“arbors”是名词复数，单数是“arbor”。现代日常英语里更常用“arbor”表示“花架/凉棚”，表示“树”的用法偏文学。","英式拼写常见“arbour”，美式拼写是“arbor”。","相关词：arborist（树艺师/树木护理师），arboriculture（树木栽培与养护）。"]}
{"word":"arborvitae","summary":{"en":"Arborvitae is an evergreen thuja often planted as a hedge or privacy screen.","zh":"Arborvitae 指常用于做绿篱或隐私屏障的常绿侧柏属植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an evergreen tree or shrub (often used in gardens) with flat, fan-shaped sprays of green leaves; a type of thuja","zh":"一种常绿的树或灌木（常用于园林绿化），叶片呈扁平扇形枝叶簇；常指侧柏属（Thuja）植物"},"examples":[{"en":"We planted arborvitae along the fence to create a natural privacy screen.","zh":"我们沿着栅栏种了几棵圆柏（arborvitae）来做天然的隐私屏障。"},{"en":"Arborvitae stays green in winter, so it’s popular in cold climates.","zh":"圆柏（arborvitae）冬天也常绿，所以在寒冷地区很受欢迎。"}]}],"synonyms":["thuja","cedar (common name)","evergreen"],"phonetic":"/ˌɑɹ.bɚˈvaɪ.ti/","extraExplanation":["“arborvitae”来自拉丁语，意为“生命之树”（tree of life）。在北美历史中，它与早期探险者有关：据记载，当地原住民曾用含维生素C的针叶/叶片煮水帮助人们缓解坏血病，因此得名带有“生命”含义的称呼。","日常英语里它常被当作园艺用语，尤其指用于做绿篱（hedge）、风障（windbreak）或隐私屏障（privacy screen）的侧柏属植物。不同地区也可能用它泛指某些类似的常绿针叶灌木。"]}
{"word":"arborvitaes","summary":{"en":"Arborvitaes are Thuja evergreens commonly used for hedges and privacy screens.","zh":"Arborvitaes 指侧柏属的常绿植物，常用作绿篱和遮挡视线。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of arborvitae: evergreen conifer trees or shrubs (genus Thuja) often planted as hedges or for privacy in gardens.","zh":"arborvitae 的复数：侧柏属（Thuja）的常绿针叶树或灌木，常用于庭院绿篱、挡风或隐私屏障。"},"examples":[{"en":"They planted arborvitaes along the fence to create a natural privacy screen.","zh":"他们沿着篱笆种了一排 arborvitaes，做成天然的隐私屏障。"},{"en":"In winter, the arborvitaes stayed green when most other plants lost their leaves.","zh":"冬天里，大多数植物都落叶了，但 arborvitaes 依然常绿。"}]}],"synonyms":["thuja","arborvitae (plural)","evergreen hedge"],"phonetic":"/ˌɑːrbərˈvaɪtiː/","extraExplanation":["“arborvitae”来自拉丁语，意思是“生命之树”（tree of life）。在北美园艺中很常见，尤其用于做整齐的绿篱。","日常使用里，人们常把不同品种的 Thuja（如 ‘Emerald Green’）都统称为 arborvitae；复数既可写 arborvitaes，也可写 arborvitae（不变复数）但前者更直观。"]}
{"word":"arborway","summary":{"en":"Arborway means a tree-lined road, and it can also be a proper name for certain streets (notably in Boston).","zh":"Arborway 指“林荫道”，也可作专有名词，表示某些道路/地区的名称（如波士顿的 The Arborway）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a road, path, or landscaped route lined with trees; a “tree-way.”","zh":"林荫道；两侧种有树木的道路/步道。"},"examples":[{"en":"They walked along the arborway to enjoy the shade in summer.","zh":"他们沿着林荫道散步，享受夏天的树荫。"},{"en":"The city planted new maples to turn the old road into an arborway.","zh":"城市种了新的枫树，把这条老路变成了林荫道。"}]},{"partOfSpeech":"n.","definition":{"en":"(often capitalized) a place name used for certain streets or areas, such as the Arborway in Boston.","zh":"（常大写）地名：某些道路或地区的名称，例如波士顿的 The Arborway。"},"examples":[{"en":"Take the bus toward the Arborway and get off near the park.","zh":"坐车往 Arborway 方向，在公园附近下车。"}]}],"synonyms":["tree-lined street","boulevard","avenue","parkway","promenade"],"phonetic":"/ˈɑːrbərweɪ/","extraExplanation":["“arborway”由拉丁词根 arbor（树）+ way（道路）组成，字面意思是“树的道路”。它不是最常见的通用词，更常见的表达是 tree-lined street / boulevard / avenue。","在美国，“The Arborway”也是专有名词，指波士顿“翡翠项链”（Emerald Necklace）公园系统附近的一段道路/区域，因此在当地语境里常被当作地名使用。"]}
{"word":"arbory","summary":{"en":"Arbory is a rare adjective meaning “related to trees” or “wooded.”","zh":"Arbory 是个较罕用的形容词，表示“与树木有关的”或“多树的/林地般的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Related to trees; wooded; like a grove or forest.","zh":"（罕用）与树木有关的；多树的；像林地/树林一样的。"},"examples":[{"en":"They picnicked in an arbory corner of the park, shaded by old oaks.","zh":"他们在公园里一个多树的角落野餐，老橡树遮出了阴凉。"},{"en":"The poet describes an arbory silence, broken only by birdsong.","zh":"诗人描写了一种林间的寂静，只被鸟鸣打破。"}]}],"synonyms":["arboreal","wooded","sylvan","leafy"],"phonetic":"ˈɑr.bə.ri","extraExplanation":["“arbory”很少见，多用于文学或风格化写作；日常英语更常用“arboreal”（树木的/栖树的）、“wooded”（多树的）或“leafy”（树木繁茂的）。","词源与拉丁语“arbor”（树）有关，因此看到“arbor/arbore-”开头的词（如“arboretum”植物园、“arboreal”）通常都和树有关。"]}
{"word":"arbota","summary":{"en":"“Arbota” is mainly used as a proper name (often a surname), not a common English word with a standard meaning.","zh":"“Arbota”主要作为专有名词（常见为姓氏）使用，并非英语里有固定常用词义的普通单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (usually a surname, and occasionally a place name). It is not a standard English vocabulary word with a common dictionary meaning.","zh":"专有名词（通常是姓氏，偶尔也可作地名）。它不是英语里常见、具有固定词义的普通词汇。"},"examples":[{"en":"Dr. Arbota will speak at the conference tomorrow.","zh":"Arbota 博士将在明天的会议上发言。"},{"en":"I saw the name Arbota on the class list.","zh":"我在班级名单上看到了 Arbota 这个名字。"}]}],"phonetic":"/ɑrˈboʊtə/","extraExplanation":["“Arbota”在英语语境中更常见的是人名/姓氏，而不是像book、run这类有固定词义的单词。","如果你本来想查的是英文单词，可能是拼写接近的：robot（机器人）、arbor（乔木/棚架，较书面）、arboretum（植物园/树木园）。你可以告诉我你想表达的句子或语境，我可以帮你确认正确拼写与词义。"]}
{"word":"arbour","summary":{"en":"An arbour is a leafy garden shelter or shaded spot made by trees or climbing plants.","zh":"arbour 指由树木或攀援植物形成的花园遮荫棚/藤架凉棚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a shady garden shelter made of trees, shrubs, or climbing plants (often trained over a wooden or metal frame); a leafy bower.","zh":"（花园中的）树荫棚、藤架凉棚；由树木、灌木或攀援植物形成的荫蔽处。"},"examples":[{"en":"We sat in the arbour to escape the afternoon sun.","zh":"我们坐在树荫棚里躲避午后的太阳。"},{"en":"Roses climbed over the arbour, making a natural green tunnel.","zh":"玫瑰攀在藤架凉棚上，形成一条天然的绿色小隧道。"}]}],"synonyms":["arbor","bower","pergola","trellis"],"phonetic":"/ˈɑr.bɚ/","extraExplanation":["“arbour”是“arbor”的英式拼写，在文学、园艺语境里更常见；美式英语更常写作“arbor”。它常让人联想到英式花园里被藤蔓、玫瑰覆盖的凉棚，也常用于诗歌或描写浪漫、隐秘的户外空间。"]}
{"word":"arboured","summary":{"en":"“Arboured” usually means shaded/covered by trees or foliage; it can also mean having an arbour (a garden shelter). It’s a British spelling variant of American “arbored.”","zh":"“arboured”通常指“林荫的、被枝叶遮蔽的”，也可指“设有花架/藤棚（arbour）的”。它多为英式拼写，对应美式“arbored”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a place or path) shaded or covered by trees or leafy branches; tree-lined.","zh":"（指地方或小路）有树荫的；被树木或枝叶遮蔽的；林荫的。"},"examples":[{"en":"We walked along an arboured lane that stayed cool even at noon.","zh":"我们走在一条林荫小路上，即使中午也很凉爽。"},{"en":"The café has an arboured terrace with vines overhead.","zh":"那家咖啡馆有个藤蔓遮顶的绿荫露台。"}]},{"partOfSpeech":"adj.","definition":{"en":"Provided with an arbour (a garden shelter/pergola), or having arbours.","zh":"设有（或带有）花架／藤棚／凉亭式花棚（arbour）的。"},"examples":[{"en":"The arboured garden was designed for reading and quiet conversation.","zh":"这个带花架的花园是为阅读和安静交谈而设计的。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “arbour” (rare): to provide with an arbour, or to shelter with trees/foliage.","zh":"“arbour”的过去式/过去分词（少见）：建花架/藤棚；或用树木枝叶遮蔽。"},"examples":[{"en":"The walkway was arboured with climbing roses.","zh":"这条步道用攀缘玫瑰做了遮蔽（形成花架般的绿荫）。"}]}],"synonyms":["shaded","tree-lined","leafy","canopied","sheltered"],"phonetic":"/ˈɑr.bɚd/","extraExplanation":["“arboured”更常见于英式拼写，对应美式常写作“arbored”。两者意思通常相同。","“arbour”在英式英语里多指花园里的花架、藤棚或小型遮蔽处（美式常拼作“arbor”）。在文学描写中常用来营造清凉、幽静、浪漫的氛围。"]}
{"word":"arbours","summary":{"en":"“Arbours” usually means multiple vine-covered garden shelters (plural of arbour/arbor). Less commonly, it can mean trees in poetic writing.","zh":"“arbours”通常指多个藤蔓覆盖的花园棚架/花架（arbour/arbor 的复数）；较少情况下在诗歌文学中可指“树木”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of arbour/arbor) A shady garden structure or covered seating area made of a framework with climbing plants (like vines) growing over it; a bower.","zh":"（arbour/arbor 的复数）花园里的棚架/藤架式小亭或遮阴座位区，常有藤蔓植物攀爬覆盖其上；树荫棚。"},"examples":[{"en":"We sat in one of the arbours to escape the afternoon sun.","zh":"我们坐在其中一个花园藤架下，躲避午后的太阳。"},{"en":"The wedding photos were taken under the arbours covered in roses.","zh":"婚礼照片是在被玫瑰覆盖的花架下拍的。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) Trees or a group of trees; used in poetic or literary style.","zh":"（较少见）树木；一片树木（多见于诗歌或文学用法）。"},"examples":[{"en":"In spring, the arbours along the lane turned bright green.","zh":"春天时，小路旁的树木变得翠绿。"}]}],"synonyms":["arbors","arbour(s)","pergolas","trellises","bower(s)"],"phonetic":"/ˈɑr.bɚ/","extraExplanation":["“arbours”是英式拼写 arbour 的复数；美式更常写作 arbor /ˈɑr.bɚ/。园艺语境里通常指“藤架、花架式的遮阴棚/小亭”。","表示“树木”的意思更偏文学/诗歌用法；在现代日常英语里说“trees”更自然。"]}
{"word":"Arbovale","summary":{"en":"“Arbovale” is mainly used as a proper name and often implies a wooded valley.","zh":"“Arbovale”主要作专有名词使用，常暗示“林木茂密的山谷”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (not a standard English dictionary word). It may be used as a place name, business name, or fictional setting; it often suggests “a valley with trees” or “wooded valley.”","zh":"专有名词（不是标准英语词典里的常见词）。常用作地名、品牌名或虚构地点名；常带有“树木环绕的山谷 / 林谷”的意象。"},"examples":[{"en":"Arbovale is a small town known for its oak forests.","zh":"Arbovale 是一座以橡树林闻名的小镇。"},{"en":"The novel opens in Arbovale, a quiet valley surrounded by pines.","zh":"小说以 Arbovale 开篇：一处被松林环绕的宁静山谷。"}]}],"synonyms":["(as a meaning) wooded valley","forest valley","green valley"],"phonetic":"ˈɑrboʊveɪl","extraExplanation":["“Arbovale”看起来像是由拉丁语词根组合而成：arbor（树）+ vale（山谷）。因此在命名中常用来营造自然、宁静、绿色的感觉。","由于它更像是自造词/专名，实际含义会取决于具体作品、地图或品牌的设定；如果你能提供上下文（句子、出处或你看到它的地方），我可以帮你更准确地解释。"]}
{"word":"arbovirus","summary":{"en":"An arbovirus is a virus spread by arthropods like mosquitoes or ticks.","zh":"Arbovirus 指由蚊子、蜱等节肢动物传播的病毒（虫媒病毒）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a virus that is transmitted to humans or animals by arthropods such as mosquitoes, ticks, or sandflies (short for “arthropod-borne virus”)","zh":"虫媒病毒；由节肢动物（如蚊子、蜱、白蛉等）传播给人或动物的病毒（“arthropod-borne virus”的缩写）"},"examples":[{"en":"Dengue is an arbovirus spread mainly by Aedes mosquitoes.","zh":"登革热是一种主要由伊蚊传播的虫媒病毒感染。"},{"en":"Public health teams track arboviruses by monitoring mosquito populations.","zh":"公共卫生团队通过监测蚊虫种群来追踪虫媒病毒。"},{"en":"Wearing long sleeves can reduce the risk of arbovirus infection after a bite.","zh":"被叮咬后，穿长袖衣物有助于降低虫媒病毒感染风险。"}]}],"synonyms":["arthropod-borne virus","vector-borne virus"],"phonetic":"/ˈɑɹboʊˌvaɪɹəs/","extraExplanation":["“arbovirus”不是一个严格的生物分类名称，而是按传播方式来命名的统称：由节肢动物（arthropods）传播的病毒。常见的虫媒病毒包括登革热病毒（dengue）、寨卡病毒（Zika）、西尼罗河病毒（West Nile）和黄热病病毒（yellow fever）。","词源/构词：arbo- 来自 “arthropod-borne”（节肢动物传播的），virus 是“病毒”。常用于医学、流行病学与公共卫生语境中。"]}
{"word":"Arbroath","summary":{"en":"Arbroath is a town in eastern Scotland; it’s also linked to the 1320 Declaration of Arbroath and lends its name to the traditional smoked fish “Arbroath smokie.”","zh":"Arbroath 是苏格兰东部的城镇；它也与1320年的《阿布罗斯宣言》有关，并且是传统熏鱼 “Arbroath smokie” 的得名来源。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A coastal town in Angus, Scotland, known for its harbor and fishing traditions.","zh":"（苏格兰）安格斯郡的海滨小镇，以港口和渔业传统闻名。"},"examples":[{"en":"Arbroath is a small coastal town on Scotland’s east coast.","zh":"Arbroath 是苏格兰东海岸的一个海滨小镇。"},{"en":"We stopped in Arbroath to walk by the harbor.","zh":"我们在 Arbroath 停留，到海港边散步。"}]},{"partOfSpeech":"n.","definition":{"en":"In Scottish history, a place strongly associated with the “Declaration of Arbroath” (1320), an important statement about Scotland’s independence.","zh":"在苏格兰历史中，Arbroath 与《阿布罗斯宣言》（1320年）密切相关，这是一份关于苏格兰独立的重要文书。"},"examples":[{"en":"The Declaration of Arbroath is often discussed in Scottish history classes.","zh":"《阿布罗斯宣言》常在苏格兰历史课中被讨论。"},{"en":"Arbroath is remembered for its connection to the 1320 declaration.","zh":"Arbroath 因与1320年的宣言有关而被铭记。"}]},{"partOfSpeech":"n.","definition":{"en":"Short for “Arbroath smokie,” a traditional Scottish smoked haddock (often hot-smoked), named after the town.","zh":"“Arbroath smokie”的简称：一种传统苏格兰熏黑线鳕（通常为热熏），因该城而得名。"},"examples":[{"en":"Try an Arbroath smokie if you like smoked fish.","zh":"如果你喜欢熏鱼，可以试试 Arbroath smokie。"},{"en":"The café served Arbroath with bread and butter.","zh":"那家咖啡馆把 Arbroath（熏鱼）配面包和黄油一起上。"}]}],"synonyms":["(place name)","(related term) Arbroath smokie"],"phonetic":"ˈɑrbroʊθ","extraExplanation":["发音提示：重音在第一个音节 AR-，结尾的 -th 常读成清音 /θ/（类似 “think” 里的 th）。","文化小知识：Arbroath Abbey（阿布罗斯修道院遗址）与《阿布罗斯宣言》关系密切，因此这个地名在苏格兰民族认同与历史叙事中经常被提到。","美食背景：“Arbroath smokie” 是受保护的传统食品名称（与产地和传统做法有关），在苏格兰常被当作地方特色来推荐。"]}
{"word":"arbs","summary":{"en":"“Arbs” is informal trading slang for arbitrageurs (people who do arbitrage) or for arbitrage activity.","zh":"“arbs”是交易圈的非正式说法，指套利者（arbitrageurs）或套利活动/套利交易。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Finance, informal) People or trading strategies that do arbitrage—trying to profit from small price differences of the same (or closely related) asset in different markets.","zh":"（金融，非正式）做“套利”的人或策略：利用同一（或高度相关）资产在不同市场/时间的微小价差来获利。"},"examples":[{"en":"The arbs stepped in when the stock and its futures got out of line.","zh":"当现货股票价格和期货价格出现偏离时，套利者就会进场。"},{"en":"High-frequency arbs look for tiny pricing gaps across exchanges.","zh":"高频套利会在不同交易所之间寻找很小的价差。"},{"en":"After the announcement, merger arbs started buying the target company’s shares.","zh":"公告发布后，并购套利者开始买入目标公司的股票。"}]},{"partOfSpeech":"n.","definition":{"en":"Short for “arbitrage” (the activity of arbitraging), used in trading talk.","zh":"“arbitrage（套利）”的简称，在交易语境中常用。"},"examples":[{"en":"This desk focuses on arbs rather than long-term investing.","zh":"这个交易团队更专注于套利，而不是长期投资。"},{"en":"Arbs can help push prices back toward fair value.","zh":"套利活动可能会推动价格回归到更合理的水平。"}]}],"synonyms":["arbitrageurs","arbitrage","arb traders","arbs (informal)"],"phonetic":"/ɑrbz/","extraExplanation":["“arbs”在金融英语里非常口语化，最常见指“arbitrageurs（套利者）”的复数；也可泛指“套利交易/套利机会”。写作中更正式的表达通常用“arbitrage”或“arbitrageurs”。","常见搭配：merger arbs（并购套利）、index arbs（指数套利）、convertible arbs（可转债套利）、stat arbs（统计套利）。"]}
{"word":"arbtrn","summary":{"en":"“arbtrn” is an informal abbreviation for “arbitration,” meaning dispute resolution decided by an arbitrator outside court.","zh":"“arbtrn”通常是“arbitration（仲裁）”的非正式缩写，指在法庭外由仲裁员裁决争议的解决方式。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr., informal) Short for “arbitration,” a process where a neutral third person (an arbitrator) decides a dispute outside of court.","zh":"（缩写，非正式）“arbitration（仲裁）”的简写：由中立第三方（仲裁员）在法庭外对争议作出裁决的程序。"},"examples":[{"en":"The contract requires arbtrn instead of going to court.","zh":"合同要求通过 arbtrn（仲裁）解决，而不是上法庭。"},{"en":"They filed a request for arbtrn over the unpaid invoice.","zh":"他们就未付发票提交了 arbtrn（仲裁）申请。"}]},{"partOfSpeech":"n.","definition":{"en":"Arbitration (full form): a formal way to settle disagreements, especially in business or employment, by having an arbitrator make a binding decision.","zh":"Arbitration（全称：仲裁）：一种正式的争议解决方式，常见于商业或劳动领域，由仲裁员作出通常具有约束力的决定。"},"examples":[{"en":"The labor dispute was resolved through arbitration.","zh":"这场劳资纠纷通过仲裁解决了。"},{"en":"Many companies include an arbitration clause in their contracts.","zh":"许多公司在合同中加入仲裁条款。"}]}],"synonyms":["arbitration","arb.","dispute resolution"],"phonetic":"/ˌɑrbəˈtreɪʃən/","extraExplanation":["“arbtrn”不是标准英语词典里的常见拼写，更像是合同、邮件、表格或内部系统里的缩写（类似于“arb.”）。正式写作中建议用完整形式“arbitration”。","仲裁常与“mediation（调解）”对比：调解是协助双方达成协议；仲裁通常由仲裁员作出决定（很多情况下对双方有约束力）。"]}
{"word":"Arbuckle","summary":{"en":"Arbuckle is mainly a proper noun: a surname, a U.S. place name (notably in Oklahoma), and a name seen in pop culture and early film history.","zh":"Arbuckle 主要是专有名词：用作姓氏、美国地名（尤其在俄克拉何马州），也常见于流行文化与早期电影史。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A family name (surname), used for people, characters, or families.","zh":"姓氏（家族姓），用于指人名、角色名或某个家族。"},"examples":[{"en":"My teacher’s last name is Arbuckle.","zh":"我老师的姓是 Arbuckle。"},{"en":"In the Garfield comics, Jon Arbuckle is Garfield’s owner.","zh":"在《加菲猫》漫画里，Jon Arbuckle 是加菲猫的主人。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name in the U.S., especially in Oklahoma (e.g., the Arbuckle Mountains).","zh":"美国的地名，尤其与俄克拉何马州有关（如 Arbuckle Mountains 阿巴克尔山脉）。"},"examples":[{"en":"They went hiking in the Arbuckle Mountains.","zh":"他们去阿巴克尔山脉徒步了。"},{"en":"The Arbuckle region is known for its parks and springs.","zh":"阿巴克尔地区以公园和泉水闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"A famous surname in early American film history, most notably Roscoe “Fatty” Arbuckle (a silent-film comedian).","zh":"美国早期电影史上较有名的姓氏之一，最常见的指 Roscoe “Fatty” Arbuckle（默片喜剧演员）。"},"examples":[{"en":"Roscoe Arbuckle was a well-known comedian in the silent-film era.","zh":"Roscoe Arbuckle 是默片时代很有名的喜剧演员。"},{"en":"The name Arbuckle often appears in discussions of early Hollywood.","zh":"在讨论好莱坞早期历史时，经常会出现 Arbuckle 这个名字。"}]}],"phonetic":"/ˈɑrˌbʌkəl/","extraExplanation":["“Arbuckle”主要作为专有名词使用（人名/地名），日常英文里一般不会把它当作普通词汇来用。","作为姓氏时，它常见于英语国家（尤其北美），在流行文化中最广为人知的例子是《加菲猫》里的 Jon Arbuckle。"]}
{"word":"arbuscle","summary":{"en":"An arbuscule is a tiny tree-like fungal structure inside plant root cells where nutrients are exchanged in arbuscular mycorrhiza.","zh":"丛枝是丛枝菌根真菌在植物根细胞内形成的树枝状微结构，是养分交换的重要部位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) A tiny, tree-like structure formed by certain fungi inside plant root cells, where the fungus and plant exchange nutrients in a symbiotic relationship (arbuscular mycorrhiza).","zh":"（生物）丛枝：某些真菌在植物根部细胞内形成的微小“树枝状”结构，用于真菌与植物在共生关系中交换养分（丛枝菌根）。"},"examples":[{"en":"In arbuscular mycorrhiza, the arbuscule is the main site of nutrient exchange between the fungus and the plant.","zh":"在丛枝菌根中，丛枝是真菌与植物进行养分交换的主要部位。"},{"en":"Researchers stained the roots to observe arbuscules under a microscope.","zh":"研究人员对根部进行染色，以便在显微镜下观察丛枝。"}]}],"synonyms":["(no exact everyday synonym)","branched hyphal structure (technical)"],"phonetic":"/ɑrˈbʌs.kjʊl/","extraExplanation":["你输入的拼写“arbuscle”更常见的标准拼写是 **arbuscule**（丛枝）。这个词来自拉丁语 *arbuscula*，意思是“小树”，形容其树枝状外形。","该词多用于植物学、土壤生态学与农业研究语境；日常英语中很少出现。"]}
{"word":"arbuscles","summary":{"en":"Arbuscles are tiny tree-like fungal structures inside plant roots that help plants take up nutrients.","zh":"Arbuscles 是植物根内由真菌形成的微小树状结构，能帮助植物吸收养分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural: arbuscles) A tiny, tree-like structure formed inside plant root cells by certain beneficial fungi, helping the plant absorb nutrients (especially phosphorus) in a symbiotic relationship called arbuscular mycorrhiza.","zh":"（复数：arbuscles）一种由特定有益真菌在植物根细胞内形成的微小“树枝状”结构，帮助植物吸收养分（尤其是磷），属于“丛枝菌根”（arbuscular mycorrhiza）共生关系的一部分。"},"examples":[{"en":"Under the microscope, the roots showed many arbuscles, suggesting a healthy mycorrhizal partnership.","zh":"在显微镜下，这些根部出现了许多丛枝结构（arbuscles），说明菌根共生关系很健康。"},{"en":"Arbuscles increase the surface area for nutrient exchange between the fungus and the plant.","zh":"丛枝结构能增加真菌与植物之间进行养分交换的表面积。"}]}],"synonyms":["arbuscular structures","AM arbuscules"],"phonetic":"/ˈɑrˌbʌs.kəl/","extraExplanation":["“arbuscle”来自拉丁语 arbuscula（意为“小树/小灌木”），形状像一棵小树，因此得名。","学习提示：你输入的“arbuscles”是复数形式；单数是“an arbuscle”。在生物/农业论文里更常见到“arbuscular mycorrhiza (AM)”或“AM fungi”。"]}
{"word":"arbuscula","summary":{"en":"Arbuscula is a rare term meaning either a small shrub/tree, or (in plant–fungus biology) a tree-like branching structure in roots where nutrients are exchanged.","zh":"Arbuscula 是较少见的词，可指“小树/矮灌木”，也可指植物根内丛枝菌根真菌形成的“树状分枝结构”（用于养分交换）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany, rare) A small tree or shrub; a shrublet.","zh":"（植物学，较少见）小树或灌木；矮灌木。"},"examples":[{"en":"The hillside was covered with arbuscula and wild grasses.","zh":"山坡上长满了矮灌木和野草。"},{"en":"In older botanical writing, arbuscula may describe woody plants smaller than trees.","zh":"在较早的植物学著作中，arbuscula 可用来指比乔木更矮小的木本植物。"}]},{"partOfSpeech":"n.","definition":{"en":"(Mycology/plant science) A tree-like, branched structure formed inside plant root cells by arbuscular mycorrhizal fungi, where nutrients are exchanged; an arbuscule.","zh":"（真菌学/植物科学）丛枝菌根真菌在植物根细胞内形成的“树状分枝结构”，用于植物与真菌交换养分；丛枝（arbuscule）。"},"examples":[{"en":"The fungus forms arbuscula in the roots to trade phosphorus for sugars.","zh":"这种真菌在根部形成丛枝结构，用磷换取植物的糖。"},{"en":"Microscopy showed many arbuscula in the cortex cells of the roots.","zh":"显微镜下可见根皮层细胞内有许多丛枝结构。"}]}],"synonyms":["shrublet","small shrub","arbuscule","arbuscular structure"],"phonetic":"/ɑrˈbʌskjələ/","extraExplanation":["“Arbuscula”源自拉丁语 *arbuscula*，是 *arbor*（树）的指小形式，字面意思接近“树的小样子”。在现代科学英语里，你更常见到拼写 **arbuscule**（丛枝）与术语 **arbuscular mycorrhiza**（丛枝菌根）。因此如果你是在论文或课本里看到它，常常与菌根结构有关。"]}
{"word":"arbuscular","summary":{"en":"Arbuscular means “related to arbuscules,” the tiny tree-like fungal structures in plant roots (common in arbuscular mycorrhiza).","zh":"arbuscular 指“与丛枝有关的”，常用于描述丛枝菌根中真菌在植物根内形成的树枝状微结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to arbuscules (tiny, tree-like structures) formed inside plant root cells by certain fungi, especially in arbuscular mycorrhiza.","zh":"与“丛枝（arbuscule）”有关的；指某些真菌在植物根细胞内形成的微小树枝状结构，尤用于“丛枝菌根”。"},"examples":[{"en":"Arbuscular mycorrhizal fungi help many crops absorb phosphorus from the soil.","zh":"丛枝菌根真菌能帮助许多作物从土壤中吸收磷。"},{"en":"The researchers measured arbuscular colonization in roots to estimate symbiosis strength.","zh":"研究人员测量根系的丛枝定殖程度，以估计共生关系的强弱。"}]}],"synonyms":["arbuscule-related","AM (arbuscular mycorrhizal)"],"phonetic":"/ɑrˈbʌskjələr/","extraExplanation":["“arbuscular”来自拉丁语词根 arbuscula，意为“小树”，用来形容在显微镜下看起来像小树枝的结构（丛枝）。","在生态与农业语境中常见搭配是 arbuscular mycorrhiza（丛枝菌根）或 arbuscular mycorrhizal fungi（丛枝菌根真菌，常缩写 AMF）。"]}
{"word":"arbuscule","summary":{"en":"A microscopic, tree-like fungal structure inside root cells where mycorrhizal nutrient exchange happens.","zh":"植物根细胞内由菌根真菌形成的微小树枝状结构，是养分交换的关键部位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tiny, tree-like (branched) structure formed by certain mycorrhizal fungi inside plant root cells, where nutrients are exchanged between the fungus and the plant.","zh":"（生物/植物学）丛枝：某些菌根真菌在植物根部细胞内形成的微小“树枝状”结构，是真菌与植物进行养分交换的主要场所。"},"examples":[{"en":"In arbuscular mycorrhizae, the arbuscule is the main site of nutrient exchange.","zh":"在丛枝菌根中，丛枝是养分交换的主要部位。"},{"en":"Microscopy revealed many arbuscules inside the root cortex cells.","zh":"显微观察显示根皮层细胞内有许多丛枝结构。"},{"en":"Healthy arbuscule formation often improves a plant’s phosphorus uptake.","zh":"丛枝形成良好通常能提高植物对磷的吸收。"}]}],"synonyms":["mycorrhizal arbuscule","fungal arbuscule","arbuscular structure"],"phonetic":"/ɑrˈbʌs.kjul/","extraExplanation":["“arbuscule”常见于植物学与土壤生态学文献，尤其与“arbuscular mycorrhiza（丛枝菌根，简称 AM）”一起出现；它描述的是进入根细胞后形成的分枝结构，不是长在根表面的菌丝。","词源上与拉丁语 arbuscula（“小树”）有关，因此中文常译作“丛枝/小树状结构”，帮助理解其形态特征。","学习时可区分：arbuscule（细胞内交换结构） vs. hyphae（菌丝，总体的丝状结构） vs. mycorrhiza（菌根关系/共生系统）。"]}
{"word":"arbuscule-related","summary":{"en":"“Arbuscule-related” means connected with arbuscules—tree-like fungal structures inside plant roots that help nutrient exchange.","zh":"“Arbuscule-related”指与丛枝有关：丛枝是在植物根内形成的树枝状真菌结构，常与养分交换有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with or involving arbuscules (tiny, tree-like structures formed inside plant root cells by mycorrhizal fungi).","zh":"与丛枝（由菌根真菌在植物根细胞内形成的微小树枝状结构）有关的；涉及丛枝的。"},"examples":[{"en":"Researchers measured arbuscule-related gene expression to see how strongly the fungus and the plant were cooperating.","zh":"研究人员测量了丛枝相关基因的表达，以判断真菌与植物协作的强度。"},{"en":"Phosphate uptake often increases when arbuscule-related structures are abundant in the roots.","zh":"当根系中丛枝相关结构丰富时，磷酸盐吸收通常会增加。"}]}],"synonyms":["arbuscular","AM-related","mycorrhiza-related"],"phonetic":"/ɑrˈbʌs.kjul rɪˈleɪ.tɪd/","extraExplanation":["“arbuscule”来自拉丁语 arbusculum，意为“小树”，因此在图像与描述中常见“树枝状/分枝状”的比喻。","该词多见于植物学、微生物学与农业生态学语境，尤其与“丛枝菌根（arbuscular mycorrhiza, AM）”研究相关。写作中常与 gene expression（基因表达）、colonization（定殖）、symbiosis（共生）、nutrient uptake（养分吸收）等搭配。"]}
{"word":"arbust","summary":{"en":"“Arbust” is a rare word meaning a shrub or (in older/botanical use) a planted area of trees, sometimes a vine-trained orchard/vineyard.","zh":"“arbust”是一个罕见词，意思是灌木；也可指（古义/植物学）种植树木的园地，有时特指葡萄藤攀树栽培的葡萄园/树园。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic) A shrub; a bushy plant or small tree.","zh":"（罕见/古义）灌木；矮树；丛生的树木。"},"examples":[{"en":"In the old garden, an arbust grew wild along the stone wall.","zh":"在那座老花园里，石墙边有一片灌木丛野生生长。"},{"en":"The path was hidden by thick arbust and tall grass.","zh":"小路被浓密的灌木和高草遮住了。"}]},{"partOfSpeech":"n.","definition":{"en":"(Botany, rare) A place planted with trees or shrubs; especially an orchard or a vineyard where vines are trained on trees.","zh":"（植物学，罕见）种植树木或灌木的地方；尤指让葡萄藤攀在树上生长的葡萄园（古典用法）。"},"examples":[{"en":"Some Latin texts describe an arbust where vines climbed up living trees.","zh":"一些拉丁文文献描述了“arbust”：葡萄藤沿着活树向上攀爬的种植方式。"},{"en":"They wrote of fields, woods, and arbust in the countryside.","zh":"他们写到乡间的田地、树林与树园。"}]}],"synonyms":["shrub","bush","thicket","shrubbery","orchard (context-dependent)"],"phonetic":"/ˈɑr.bəst/","extraExplanation":["“arbust”在现代英语中非常少见，多见于古典/文学语境或植物学讨论。日常英语里更常用的词是“shrub”“bush”“thicket”。","词源与拉丁语“arbustum”有关，古罗马农业里可指一种把葡萄藤引到树上生长的栽培系统，因此在部分文本中会带有“葡萄园/树园”的含义。"]}
{"word":"arbusta","summary":{"en":"Arbusta is a rare word meaning “shrubs/shrubbery,” and it’s sometimes a mistaken spelling for “arabusta” in coffee contexts.","zh":"Arbusta 是个少见词，主要指“灌木/灌木丛”；在咖啡语境中也常是把更常见的 arabusta 误写成 arbusta。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) Shrubs or shrubbery; a collection of bushes (often used in botanical, Latin-influenced writing).","zh":"（罕见）灌木、灌木丛；一片灌木（常见于受拉丁语影响的植物学/文学用法）。"},"examples":[{"en":"The garden’s arbusta grew thick along the stone wall.","zh":"花园里的灌木丛沿着石墙长得很茂密。"},{"en":"In older texts, arbusta can refer to low woody plants rather than trees.","zh":"在较早的文本中，arbusta 可以指低矮的木本植物，而不是乔木。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare; often confused spelling) A coffee plant related to Robusta/Arabica types; many writers actually mean “arabusta” (a hybrid of Arabica and Robusta).","zh":"（极罕见；常见为拼写混淆）与罗布斯塔/阿拉比卡相关的咖啡植株；很多情况下写作 arbusta 其实想表达的是 “arabusta”（阿拉比卡与罗布斯塔的杂交品种）。"},"examples":[{"en":"Some sellers label the hybrid as arbusta, but the usual name is arabusta.","zh":"有些卖家把这种杂交咖啡标成 arbusta，但更常见的名称是 arabusta。"}]}],"synonyms":["shrubbery","bushes","shrubs"],"phonetic":"/ɑrˈbʌstə/","extraExplanation":["“arbusta”来自拉丁语词根 *arbor*（树）。在古典拉丁语里，*arbustum/arbusta* 也可与“在树间栽种的葡萄园/林地”相关，因此在英语里偶尔会出现在带古典色彩的描写中。","如果你是在咖啡语境里看到它，建议核对原文是否其实是 “arabusta”（Arabica + Robusta 的混成词），因为这是更常用、更标准的拼写与说法。"]}
{"word":"arbusterin","summary":{"en":"“arbusterin” isn’t recognized as a standard English word; it’s likely a misspelling or a proper name.","zh":"“arbusterin”不是常见英语词，可能是拼写错误或专有名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a name (e.g., a medicine/brand/product).","zh":"不是标准英语单词。可能是拼写错误，或是某种名称（如药名/品牌/产品名）。"},"examples":[{"en":"I can’t find “arbusterin” in an English dictionary—could you check the spelling?","zh":"我在英语词典里找不到“arbusterin”——你可以确认一下拼写吗？"},{"en":"If you tell me where you saw the word (a prescription, a website, a book), I can help identify what it refers to.","zh":"如果你告诉我这个词出现在哪里（处方、网站、书里等），我可以帮你判断它指的是什么。"}]}],"extraExplanation":["“arbusterin”看起来像是把某个常见词拼错了。最常见的可能之一是 **albuterol**（沙丁胺醇，一种常见的哮喘/支气管扩张吸入药）。也可能是某个品牌名或专有名词。","把你看到它的上下文发我（完整句子/截图/所属领域），我可以更准确地帮你匹配正确词并解释用法。"]}
{"word":"arbusterol","summary":{"en":"“Arbusterol” is not a standard English word; it is often a misspelling of “albuterol,” a common asthma inhaler medicine.","zh":"“arbusterol”不是标准英语单词；它常被用作“albuterol（沙丁胺醇，美式常用名）”的拼写错误，是常见的哮喘吸入药物之一。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Not a standard English word) Often a misspelling of “albuterol,” a medicine that relaxes the muscles in the airways and helps you breathe more easily (commonly used for asthma).","zh":"（不是标准英语单词）常见于把“albuterol（沙丁胺醇/美式常用名）”拼错；它是一种使气道肌肉放松、帮助更容易呼吸的药物（常用于哮喘）。"},"examples":[{"en":"I think “arbusterol” may be a misspelling of albuterol.","zh":"我觉得“arbusterol”可能是把 albuterol 拼错了。"},{"en":"The doctor prescribed an albuterol inhaler for her asthma symptoms.","zh":"医生给她开了一个 albuterol（沙丁胺醇）吸入器来缓解哮喘症状。"}]}],"synonyms":["albuterol","salbutamol"],"phonetic":"/ælˈbjuːtərɔl/","extraExplanation":["“Arbusterol”在常见英语词典里通常查不到；如果你是在药品、处方或吸入器上看到这个词，很可能是把 albuterol 拼错了。","albuterol 在英式英语里常对应名称 salbutamol（同一种药的不同通用名）。","用药相关信息请以医生/药师为准；不要仅凭拼写相近就自行替换或使用药物。"]}
{"word":"arbustum","summary":{"en":"A rare word for a tree plantation, especially a Roman-style vineyard with vines trained on trees.","zh":"一个罕见词，指树木种植园，尤指古罗马让葡萄藤攀附在树上生长的葡萄园。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A plantation of trees; especially (in Roman agriculture) a vineyard where grapevines are trained to grow up trees.","zh":"（罕见）树木种植园；尤指（古罗马农业中）让葡萄藤攀附在树上生长的葡萄园。"},"examples":[{"en":"In some Roman texts, an arbustum is described as a vineyard supported by living trees.","zh":"在一些罗马文献中，arbustum 被描述为一种由活树支撑的葡萄园。"},{"en":"The estate once included an arbustum, along with fields for grain and olives.","zh":"这座庄园曾有一片 arbustum，同时还种植谷物和橄榄。"}]}],"synonyms":["vineyard","grove","orchard","plantation"],"phonetic":"ɑrˈbʌstəm","extraExplanation":["arbustum 是拉丁词，出现在古罗马农书（如农业论述）中，常与“vineyard（葡萄园）”的概念相关，但更具体：葡萄藤不是用木桩或铁丝架支撑，而是“攀树而上”。","在现代英语里它非常少见，多见于古典学、历史、考古或农业史写作中。日常表达通常用 vineyard、orchard、grove 等更常见词。"]}
{"word":"arbutase","summary":{"en":"Arbutase is an enzyme that hydrolyzes arbutin into hydroquinone and glucose.","zh":"Arbutase 是一种水解并分解熊果苷、生成对苯二酚和葡萄糖的酶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An enzyme that breaks down arbutin by hydrolyzing it into hydroquinone and glucose (often described as an arbutin-hydrolyzing enzyme).","zh":"一种能分解熊果苷（arbutin）的酶，通过水解将其分解为对苯二酚（hydroquinone）和葡萄糖。"},"examples":[{"en":"Some microbes produce arbutase to use arbutin as a source of carbon.","zh":"一些微生物会产生熊果苷酶（arbutase），以熊果苷作为碳源。"},{"en":"Researchers measured arbutase activity by tracking how quickly arbutin was broken down.","zh":"研究人员通过监测熊果苷被分解的速度来测定熊果苷酶的活性。"}]}],"synonyms":["arbutinase"],"phonetic":"/ˈɑɹ.bjəˌteɪs/","extraExplanation":["“Arbutase”在文献中有时也会写作或近似等同于“arbutinase”，指能水解熊果苷的酶活性；具体名称与分类可能因研究对象（不同细菌/真菌/植物来源）而略有差异。","熊果苷常见于一些植物（如熊果属相关植物）中，在护肤语境里也常被提到；但“arbutase”这个词更偏生化/微生物学语境，用于描述分解熊果苷的酶。"]}
{"word":"arbute","summary":{"en":"“Arbute” is usually a misspelling of “arbutus,” a type of small tree/shrub with smooth reddish bark and round fruits.","zh":"“arbute”通常是“arbutus”的误拼，指一种树皮光滑偏红褐、结圆形果实的小乔木或灌木。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Often a misspelling of) arbutus: a small tree or shrub with smooth reddish bark and round fruits; it includes the “strawberry tree.”","zh":"（常见拼写误差）arbutus（杨梅树属/草莓树）：一种小乔木或灌木，树皮光滑呈红褐色，结圆形果实。"},"examples":[{"en":"In the Pacific Northwest, the arbutus is known for its twisting branches and peeling bark.","zh":"在北美太平洋西北地区，arbutus 以扭曲的枝条和会剥落的树皮而闻名。"},{"en":"We saw red arbutus berries along the trail.","zh":"我们在小径旁看到了红色的 arbutus 果实。"}]}],"synonyms":["arbutus","strawberry tree","madrone"],"phonetic":"/ɑrˈbjuːtəs/","extraExplanation":["“arbute”在英语里不算常见的标准拼写；多数情况下你可能想写的是 **arbutus**。如果你是在某本书、植物名录或地名里看到“arbute”，也可能是特定地区/个人的拼写变体或缩写，建议提供上下文我可以帮你确认。","**arbutus** 一词源自拉丁语，常用于植物学语境；在日常英语中更常见的说法是具体物种名（如 *Pacific madrone*）。"]}
{"word":"arbutean","summary":{"en":"Arbutean means “related to the arbutus (strawberry tree).”","zh":"arbutean 表示“与杨梅树属（草莓树）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the arbutus (a kind of evergreen tree or shrub, especially the strawberry tree).","zh":"与杨梅树属（Arbutus，一类常绿灌木或小乔木，尤指草莓树）有关的；杨梅树属的。"},"examples":[{"en":"The garden has arbutean shrubs with glossy leaves.","zh":"花园里有几株杨梅树属的灌木，叶子很有光泽。"},{"en":"Arbutean flowers can be small, white or pink, and bell-shaped.","zh":"杨梅树属的花往往很小，白色或粉色，呈钟形。"}]}],"synonyms":["arbutus-related","of the arbutus"],"phonetic":"/ɑrˈbjuːtiən/","extraExplanation":["“arbutean”是一个比较少见的形容词，通常出现在植物学、园艺或自然写作中，用来描述“arbutus（杨梅树属/草莓树）”的特征。日常英语里更常见的说法是“arbutus (something)”或“of the arbutus tree”。"]}
{"word":"arbutes","summary":{"en":"Arbutus is an evergreen tree or shrub with bell-shaped flowers and berry-like fruit (often called strawberry tree or madrone).","zh":"Arbutus 指一种常绿小树或灌木，开钟形花、结果实似浆果（常被称为草莓树或马德罗娜）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small tree or shrub (genus Arbutus) with evergreen leaves, white or pink bell-shaped flowers, and round berry-like fruit; often called the strawberry tree (in Europe) or madrona (in western North America).","zh":"一种常绿小乔木或灌木（杨梅树属 Arbutus），有常绿叶、白色或粉色钟形花，结圆形似浆果的果实；常被称为“草莓树”（欧洲）或“马德罗娜/美洲杨梅树”（北美西海岸）。"},"examples":[{"en":"An arbutus tree grew near the coast, with smooth reddish bark.","zh":"海岸附近长着一棵杨梅树（arbutus），树皮光滑呈红褐色。"},{"en":"In spring, arbutus flowers attract bees and other pollinators.","zh":"春天，arbutus 的花会吸引蜜蜂和其他传粉昆虫。"}]}],"synonyms":["strawberry tree","madrone","madrona"],"phonetic":"/ɑrˈbjuːtəs/","extraExplanation":["你输入的“arbutes”很可能是拼写错误，更常见的正确拼写是 **arbutus**（单数/复数：arbutus / arbutuses）。","在不同地区叫法不一样：在欧洲常指 **strawberry tree**（Arbutus unedo）；在北美西海岸常指 **Pacific madrone / madrona**（Arbutus menziesii）。","词源来自拉丁语 *arbutus*，指一种结果实的树。它的果实看起来像草莓，但味道并不一定像草莓。"]}
{"word":"Arbuthnot","summary":{"en":"Arbuthnot is mainly a Scottish surname, and in historical contexts it often refers to the writer and scientist John Arbuthnot (1667–1735).","zh":"Arbuthnot 主要是一个苏格兰姓氏；在历史语境中常指作家兼科学家约翰·阿巴思诺特（1667–1735）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Scottish surname; often refers to a person or family with the name Arbuthnot.","zh":"一个苏格兰姓氏；常用来指姓 Arbuthnot 的个人或家族。"},"examples":[{"en":"My professor, Dr. Arbuthnot, specializes in statistics.","zh":"我的教授 Arbuthnot 博士专攻统计学。"},{"en":"Arbuthnot is a surname with Scottish origins.","zh":"Arbuthnot 是一个起源于苏格兰的姓氏。"}]},{"partOfSpeech":"n.","definition":{"en":"(often in literature/history) referring to John Arbuthnot (1667–1735), a Scottish physician, mathematician, and satirist.","zh":"（文学/历史语境中常见）指约翰·阿巴思诺特（John Arbuthnot，1667–1735），苏格兰医生、数学家与讽刺作家。"},"examples":[{"en":"Arbuthnot wrote satirical works and was connected to writers like Swift and Pope.","zh":"Arbuthnot 写过讽刺作品，并与斯威夫特和蒲柏等作家有来往。"},{"en":"In a discussion of early statistics, Arbuthnot is sometimes mentioned for his work on birth records.","zh":"在讨论早期统计学时，有时会提到 Arbuthnot 对出生记录的研究。"}]}],"synonyms":["(surname)","(family name)"],"phonetic":"/ɑrˈbʌθnət/","extraExplanation":["Arbuthnot 常见读音重音在第一个音节（AR-），但不同家庭或地区可能有轻微差异。","历史人物 John Arbuthnot 以讽刺写作与学术贡献著称：他与“斯克里布勒斯俱乐部”（Scriblerus Club）有关联，这是18世纪英国重要的文学圈子之一。","在统计学史上，他曾用伦敦的出生记录讨论男女出生比例，被一些教材视为早期“统计推断/显著性思路”的例子。"]}
{"word":"arbutin","summary":{"en":"Arbutin is a plant-based ingredient used in skincare to help brighten skin and reduce dark spots.","zh":"Arbutin（熊果苷）是一种植物来源的护肤成分，常用于提亮肤色、淡化色斑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural chemical (a glycoside) found in some plants, used especially in skincare as a skin-brightening ingredient because it can help reduce the appearance of dark spots by affecting melanin production","zh":"熊果苷；一种存在于某些植物中的天然化合物（糖苷），常用于护肤作为“提亮/美白”成分，通过影响黑色素生成来帮助淡化色斑、痘印等"},"examples":[{"en":"This serum contains arbutin to help fade dark spots over time.","zh":"这款精华含有熊果苷，长期使用有助于淡化色斑。"},{"en":"Arbutin is often used in products for uneven skin tone.","zh":"熊果苷常用于改善肤色不均的产品中。"},{"en":"People sometimes choose arbutin as a gentler alternative to stronger brightening ingredients.","zh":"有些人会选择熊果苷作为比更强效提亮成分更温和的替代选择。"}]}],"synonyms":["alpha-arbutin","beta-arbutin","bearberry extract (related)"],"phonetic":"/ɑɹˈbjuːtɪn/","extraExplanation":["在成分表里常见的相关写法有：alpha-arbutin（α-熊果苷，通常被认为更稳定/更有效一些）、beta-arbutin（β-熊果苷，也常直接写作 arbutin）。\n\n护肤语境里提到“美白/提亮”通常指淡化色沉、让肤色更均匀，并不意味着改变个人肤色本身。不同皮肤对成分的耐受度不同，容易敏感的人建议先做局部测试、循序渐进使用。"]}
{"word":"arbutinase","summary":{"en":"Arbutinase is an enzyme that hydrolyzes arbutin (often into hydroquinone and glucose).","zh":"Arbutinase（熊果苷酶）是一种能水解熊果苷的酶（常生成对苯二酚和葡萄糖）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An enzyme that breaks down (hydrolyzes) arbutin, typically producing hydroquinone and glucose.","zh":"熊果苷酶；一种能水解（分解）熊果苷的酶，通常生成对苯二酚和葡萄糖。"},"examples":[{"en":"In some microbes, arbutinase helps them use arbutin as a carbon source.","zh":"在一些微生物中，熊果苷酶帮助它们把熊果苷当作碳源来利用。"},{"en":"The assay measured arbutinase activity by tracking the formation of hydroquinone.","zh":"该实验通过追踪对苯二酚的生成来测定熊果苷酶活性。"}]}],"synonyms":["arbutin-hydrolyzing β-glucosidase","β-glucosidase (arbutinase activity)"],"phonetic":"/ɑrˈbjuːtɪˌneɪs/","extraExplanation":["词源提示：arbutin（熊果苷）+ -ase（常见于“酶”的后缀，如 lactase 乳糖酶）。因此 arbutinase 直译就是“分解熊果苷的酶”。","应用与语境：这个词多见于生物化学、微生物学与食品/植物化学研究文献中。由于 arbutin 与护肤美白成分相关，但 arbutinase 属于“分解该成分的酶”，并不是护肤品里常见的成分名称。","安全与理解：对苯二酚（hydroquinone）在某些地区属于受监管成分；在科研语境中提到它通常是描述代谢产物，并不等同于日常产品推荐。"]}
{"word":"arbutus","summary":{"en":"Arbutus is an evergreen tree or shrub with small bell-shaped flowers and round berries, often noted for peeling reddish bark in some species.","zh":"Arbutus 指杨梅树属的常绿树或灌木，开小钟形花、结圆形浆果；部分品种以红褐色会剥落的树皮著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An evergreen tree or shrub (genus Arbutus) with leathery leaves, small bell-shaped flowers, and round berries; some species are known for peeling reddish bark (e.g., madrone).","zh":"杨梅树属（Arbutus）的常绿乔木或灌木，叶片厚而有革质，小钟形花，结圆形浆果；有些品种以红褐色会剥落的树皮著名（如美洲树莓/马德罗内树）。"},"examples":[{"en":"An arbutus tree grew near the rocky shoreline, its bark peeling in thin curls.","zh":"岩石海岸边长着一棵杨梅树属的树，树皮一层层卷曲剥落。"},{"en":"In spring, the arbutus has clusters of small white flowers.","zh":"春天时，这种杨梅树属植物会开成串的小白花。"}]}],"synonyms":["madrone","strawberry tree"],"phonetic":"/ɑrˈbjuːtəs/","extraExplanation":["“Arbutus”常见于植物学与地名/校园名（如“Arbutus Ridge”）。在北美西海岸，人们常把Arbutus menziesii称为“madrone”或“Pacific madrone”，以光滑、会剥落的红褐色树皮为识别特征。","不要与“strawberry tree（草莓树）”混淆：欧洲的Arbutus unedo常被俗称为“strawberry tree”，因为果实外观有点像草莓，但味道与草莓不同。"]}
{"word":"arbutus-related","summary":{"en":"“Arbutus-related” means “related to arbutus trees/shrubs.”","zh":"“arbutus-related”意为“与石楠属（arbutus）树木/灌木有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with arbutus (a type of evergreen tree or shrub, such as the strawberry tree or Pacific madrone).","zh":"与“石楠属植物（arbutus）”（一种常绿乔木或灌木，如草莓树或太平洋马德罗尼树）有关的。"},"examples":[{"en":"The researcher focused on arbutus-related diseases that affect coastal forests.","zh":"研究人员重点关注影响沿海森林的与石楠属植物相关的病害。"},{"en":"We collected arbutus-related samples, including leaves, bark, and soil around the roots.","zh":"我们采集了与石楠属植物相关的样本，包括叶片、树皮以及根部周围的土壤。"}]}],"synonyms":["arbutus-associated","arbutus-connected","related to arbutus"],"phonetic":"/ɑɹˈbjuːtəs rɪˈleɪtɪd/","extraExplanation":["“Arbutus”在北美语境里常让人想到 Pacific madrone（学名 Arbutus menziesii），中文常译为“马德罗尼树/太平洋草莓树”等；在欧洲语境里也可能指 strawberry tree（Arbutus unedo）。因此“arbutus-related”在不同地区的文章中，所指的具体物种可能不同。","这种“X-related”的构词很常见，表示“与X有关/相关的”，常用于学术写作或新闻报道中（如 climate-related、stress-related）。"]}
{"word":"arbutuses","summary":{"en":"Arbutuses are Arbutus trees/shrubs (strawberry trees), known for bell-shaped flowers and round red-orange fruit.","zh":"Arbutuses 指 Arbutus 属的树或灌木（草莓树），以铃状花和红橙色圆果著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of arbutus) Evergreen trees or shrubs in the genus Arbutus, often called strawberry trees, with white/pink bell-shaped flowers and round red-orange fruits.","zh":"（arbutus 的复数）杨梅树属（Arbutus）的常绿乔木或灌木，常被称为“草莓树”，开白色/粉色铃状花，结红橙色圆形果实。"},"examples":[{"en":"Arbutuses grow well in mild coastal climates and can handle dry summers once established.","zh":"Arbutuses 在温和的海岸气候中长得很好，成活后也能耐受干燥的夏季。"},{"en":"In winter, the arbutuses in the park showed both flowers and fruit at the same time.","zh":"冬天公园里的 arbutuses 同时能看到花和果。"}]}],"synonyms":["strawberry trees","madrone","madroño"],"phonetic":"/ɑrˈbjuːtəs/","extraExplanation":["“arbutuses”是复数形式；单数是“arbutus”。在北美西海岸常见的种类包括“Pacific madrone”（学名 Arbutus menziesii），在英语里也常被归入与“strawberry tree（草莓树）”相关的称呼体系中。","词源来自拉丁语“arbutus”，原指一种树；不同地区对具体物种的俗名可能不同（如 madrone / madroña），但“Arbutus”作为属名较为统一。"]}
{"word":"Arbyrd","summary":{"en":"Arbyrd is a place name: a small community in southeastern Missouri, USA.","zh":"Arbyrd 是地名：美国密苏里州东南部的一个小社区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small unincorporated community (place name) in southeastern Missouri, USA, near the Arkansas border.","zh":"（地名）美国密苏里州东南部靠近阿肯色州边界的一个小型非建制社区。"},"examples":[{"en":"Arbyrd is a quiet community in the Missouri Bootheel region.","zh":"Arbyrd 是密苏里州“靴跟地区”（Bootheel）里的一个安静社区。"},{"en":"She grew up near Arbyrd, Missouri, close to the Arkansas state line.","zh":"她在密苏里州 Arbyrd 附近长大，离阿肯色州州界很近。"}]},{"partOfSpeech":"other","definition":{"en":"Used as a proper name (especially in addresses) to refer to the local area or mailing location called Arbyrd.","zh":"（专有名词用法）常用于地址或邮寄信息中，指名为 Arbyrd 的地区/投递地点。"},"examples":[{"en":"The package was sent to Arbyrd, MO.","zh":"包裹寄到了密苏里州的 Arbyrd。"}]}],"synonyms":["(none; proper noun)"],"phonetic":"/ˈɑrˌbɝd/","extraExplanation":["“Arbyrd”主要作为地名使用，不是常见英语词汇，因此一般不翻译为普通名词。阅读或听到它时，通常把它当作专有名词（地名/社区名）来理解。","在美国地址中常见格式为 “Arbyrd, MO”（MO=Missouri，密苏里州的缩写）。"]}

