{"word":"ARD","summary":{"en":"ARD is an acronym with multiple meanings; its definition depends on context (medicine, telecom, or organization names).","zh":"ARD 是多义缩写，具体含义取决于上下文（医学、通信或机构名称等）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(acronym, medicine) Acute respiratory distress (often seen as ARDS for “acute respiratory distress syndrome”).","zh":"（缩写，医学）急性呼吸窘迫（更常见写作 ARDS，指“急性呼吸窘迫综合征”）。"},"examples":[{"en":"The ICU team monitored the patient closely for signs of ARDS.","zh":"重症监护团队密切监测患者是否出现 ARDS 的迹象。"},{"en":"Severe pneumonia can lead to acute respiratory distress.","zh":"严重肺炎可能引发急性呼吸窘迫。"}]},{"partOfSpeech":"other","definition":{"en":"(acronym, tech/telecom) Automatic Repeat reQuest: a method where a receiver asks for retransmission when data is corrupted or lost.","zh":"（缩写，技术/通信）自动重传请求：当数据出错或丢失时，接收方请求重新发送的一种机制。"},"examples":[{"en":"The protocol uses ARD/ARQ to resend packets if errors are detected.","zh":"该协议使用 ARD/ARQ 在检测到错误时重传数据包。"},{"en":"With a noisy connection, automatic repeat request improves reliability.","zh":"在噪声较大的连接中，自动重传请求能提高可靠性。"}]},{"partOfSpeech":"other","definition":{"en":"(acronym, organizations/media) A set of letters used in many names; meaning depends on the field (for example, Germany’s public broadcaster “ARD”).","zh":"（缩写，机构/媒体）可出现在许多名称中的字母缩写；具体含义取决于领域（例如德国公共广播机构“ARD”）。"},"examples":[{"en":"I watched the documentary on ARD last night.","zh":"我昨晚在 ARD 上看了那部纪录片。"},{"en":"In this document, ARD refers to the organization defined in section 1.","zh":"在本文件中，ARD 指第 1 节所定义的机构。"}]}],"synonyms":["acronym","initialism"],"phonetic":"/ˌeɪ ɑr ˈdiː/","extraExplanation":["“ARD”单独出现时非常不明确，最常见的学习策略是：先看上下文领域（医学/通信/机构名等），再确认它到底代表哪一组词。","在医学语境里更常见的是“ARDS”（syndrome 综合征）。如果你是在化验单、病历或新闻里看到“ARD/ARDS”，建议以原文为准并结合医生解释。","如果你愿意，把你看到“ARD”的完整句子或段落发来，我可以帮你准确判断它在那里的含义。"]}
{"word":"ard","summary":{"en":"“ard” is mainly a Scottish dialect word meaning “to plow” (verb) or “a plowing/plowed land” (noun). It can also appear as the suffix “-ard” (a person with a trait) or as an acronym “ARD,” whose meaning depends on context.","zh":"“ard” 主要是苏格兰方言，意为“犁地/耕作”（动词）或“犁地、犁过的地”（名词）。它也可能以词尾后缀“-ard”（带某种特征的人）出现，或作为缩写“ARD”，具体含义需看语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Scottish, dialect) to plow; to till land.","zh":"（苏格兰方言）犁地；耕作。"},"examples":[{"en":"In older Scottish writing, you may see “ard the field” meaning “plow the field.”","zh":"在较早的苏格兰文字里，你可能会看到“ard the field”，意思是“把田犁一犁/耕田”。"},{"en":"They arded the soil before planting potatoes.","zh":"他们在种土豆前先把土犁松。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scottish, dialect) a plowing; a piece of land that has been plowed.","zh":"（苏格兰方言）犁地（这一过程）；犁过的一块地。"},"examples":[{"en":"After the ard, the field was ready for seed.","zh":"犁完地后，这块田就可以播种了。"}]},{"partOfSpeech":"other","definition":{"en":"A common suffix in English meaning “a person characterized by (something), often in a negative or humorous way.”","zh":"英语常见后缀，表示“带有某种特征的人”，常带贬义或调侃色彩。"},"examples":[{"en":"A drunkard is a person who drinks too much.","zh":"drunkard 指喝酒过量的人（酒鬼）。"},{"en":"A braggart is a person who brags a lot.","zh":"braggart 指爱吹牛的人。"}]},{"partOfSpeech":"other","definition":{"en":"Acronym: a set of letters used as a name (meanings depend on context).","zh":"缩写：一组字母当作名称使用（含义取决于语境）。"},"examples":[{"en":"ARD is a major public broadcaster in Germany.","zh":"ARD 是德国重要的公共电视广播联盟/电视台。"},{"en":"In medicine, ARD can mean “acute respiratory disease” in some contexts.","zh":"在医学语境中，ARD 有时可指“急性呼吸道疾病”。"}]}],"synonyms":["plow","plough","till"],"phonetic":"/ɑrd/","extraExplanation":["“ard” 作动词/名词主要见于苏格兰方言或较古老的文本里，现代通用英语更常用 plow/plough。","如果你看到的是词尾 “-ard”，它是构词后缀，不是独立词：常用来给人贴标签（有时带轻微嘲讽），如 drunkard、sluggard、braggart（拼写上也常见 -art）。","若你是在某篇文章/专业领域里遇到 ARD（大写），最好提供上下文，我可以帮你确定它在那里的具体含义。"]}
{"word":"Arda","summary":{"en":"Arda is most commonly a Turkish boy’s name; it can also refer to the Arda River in the Balkans or to the world in Tolkien’s mythology.","zh":"Arda 常见为土耳其男性名字；也可指巴尔干地区的阿尔达河，或指托尔金神话体系中的世界“Arda”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (especially in Turkey) used for boys; it can carry the sense of “the one who follows” or “successor.”","zh":"（人名）常见于土耳其的男性名字；常被解释为“后来者 / 继承者（跟随的人）”。"},"examples":[{"en":"Arda is a common boy’s name in Turkey.","zh":"Arda 是土耳其很常见的男孩名字。"},{"en":"His name, Arda, means someone who comes after another.","zh":"他的名字 Arda 常被解释为“后来者”。"}]},{"partOfSpeech":"n.","definition":{"en":"a river in the Balkans (the Arda River) that flows through Bulgaria and into Greece, where it joins the Evros/Maritsa River system.","zh":"（地名）阿尔达河：巴尔干地区的一条河流，流经保加利亚进入希腊，并汇入埃夫罗斯河/马里查河水系。"},"examples":[{"en":"They visited towns along the Arda River.","zh":"他们参观了阿尔达河沿岸的城镇。"}]},{"partOfSpeech":"n.","definition":{"en":"in J. R. R. Tolkien’s legendarium, the world (Earth) where Middle-earth is located.","zh":"（文学）在托尔金的传说体系中，“Arda”指中土世界所在的整体世界（相当于“地球”）。"},"examples":[{"en":"In Tolkien’s stories, Middle-earth is part of Arda.","zh":"在托尔金的故事里，中土世界是 Arda 的一部分。"},{"en":"The history of Arda is told through myths and ages.","zh":"Arda 的历史通过神话与纪元被讲述出来。"}]}],"synonyms":["(proper noun) no true synonyms; context-specific references include “Arda River” and “Arda (Tolkien)”"],"phonetic":"ˈɑrdə","extraExplanation":["“Arda”作为土耳其人名的解释常与“后面、随后”相关（可理解为“后来者/继任者”）。不同家庭对名字寓意的理解可能略有差异。","在英语语境里，如果你说“Arda”而没有上下文，别人可能会先想到托尔金作品里的“Arda”，或把它当作人名。为了更清楚，可以说：“Arda (a Turkish name)”或“Arda in Tolkien’s works”。"]}
{"word":"Ardal","summary":{"en":"Ardal is usually a proper noun used as a person’s name or a place name, not a common English vocabulary word.","zh":"Ardal 通常是专有名词，用作人名或地名，不是常见的英语词汇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A personal name (given name or surname). It is not a common everyday English word, and its meaning depends on the culture or family using it.","zh":"人名（名字或姓氏）。它不是常见的英语词汇，具体含义常取决于使用它的文化背景或家族来源。"},"examples":[{"en":"Ardal moved to Chicago for work last year.","zh":"Ardal 去年为了工作搬到了芝加哥。"},{"en":"I met someone named Ardal at the conference.","zh":"我在会议上认识了一个叫 Ardal 的人。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name in some regions (e.g., used for towns or areas).","zh":"某些地区的地名（例如用作城镇或区域名称）。"},"examples":[{"en":"They drove through Ardal on the way to the coast.","zh":"他们去海边的路上开车经过了 Ardal。"}]}],"phonetic":"/ˈɑrdəl/","extraExplanation":["“Ardal”更常见于专有名词（人名/地名），而不是普通英语词汇。因此在阅读或交流中，通常需要结合上下文判断：是在说某个人、某个地点，还是某个品牌/组织名称。","如果你是在书里、游戏里或新闻里看到“Ardal”，也可能是虚构世界观中的名字。此时“Ardal”的含义往往由作者设定，不一定有固定词源。"]}
{"word":"Ardan","summary":{"en":"Ardan is most commonly a proper name (a person’s name), and more rarely a place name.","zh":"Ardan 最常见是专有名词（人名），较少情况下也可作地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (usually masculine), used in various cultures; it is uncommon in English and is mainly used as a personal name","zh":"人名（多为男性名）；在英语里不算常见，主要用作名字"},"examples":[{"en":"Ardan introduced himself and said he was new to the class.","zh":"Ardan 自我介绍，说他是班里的新同学。"},{"en":"Do you know how to spell Ardan for the guest list?","zh":"你知道宾客名单上 Ardan 怎么拼吗？"}]},{"partOfSpeech":"n.","definition":{"en":"a place name in some regions (rare in general English); used as a proper noun for specific locations","zh":"地名（在一般英语中较少见）；用作特定地点的专有名词"},"examples":[{"en":"They passed through Ardan on the way to the coast.","zh":"他们去海边的路上经过了 Ardan。"}]}],"synonyms":["Arden (similar-looking name)"],"phonetic":"/ˈɑrdən/","extraExplanation":["“Ardan”更常见的是作为专有名词（人名/地名），所以通常不翻译，直接音译或保留拼写。","词源在不同地区可能不同；在英文语境里，它不像常见英文词那样有固定的“词义”，更多取决于具体的人或地点。","如果你是在小说、游戏或影视作品里看到“Ardan”，它也可能是作者创造的名字；此时含义通常由作品设定决定。"]}
{"word":"Ardara","summary":{"en":"Ardara is mainly a place name: a town in County Donegal, Ireland.","zh":"Ardara 主要是地名：爱尔兰多尼戈尔郡的一个小镇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small town and village in County Donegal, Ireland, known for traditional Irish music, weaving (especially tweed), and nearby coastal scenery.","zh":"爱尔兰多尼戈尔郡的一个小镇与村庄，以传统爱尔兰音乐、纺织（尤其是粗花呢）以及附近的海岸风光而闻名。"},"examples":[{"en":"We stayed in Ardara for a weekend to hear live traditional music in the pubs.","zh":"我们在阿尔达拉住了一个周末，在酒吧里听现场的传统音乐。"},{"en":"Ardara is often mentioned as a good base for exploring Donegal’s coastline.","zh":"人们常说阿尔达拉是探索多尼戈尔海岸线的一个很好的落脚点。"}]},{"partOfSpeech":"n.","definition":{"en":"A personal name used occasionally in English-speaking contexts (rare), often inspired by place names or Celtic-sounding names.","zh":"一个偶尔出现的英文人名（较少见），常受地名或凯尔特风格名字启发。"},"examples":[{"en":"Ardara is an uncommon name, so people sometimes ask how it’s spelled.","zh":"Ardara 是个不太常见的名字，所以别人有时会问怎么拼写。"}]}],"synonyms":["(place name)"],"phonetic":"ɑrˈdɑrə","extraExplanation":["“Ardara”常被认为源自爱尔兰语（盖尔语）地名元素：Ard- 常表示“高地/高处”，-ara 的具体来源有不同解释，整体带有典型的爱尔兰地名特色。"]}
{"word":"ardass","summary":{"en":"Hardass means a very strict, tough person, or acting in a strict, uncompromising way (informal and somewhat rude).","zh":"Hardass 指非常严厉强硬的人，或指以严厉、毫不妥协的方式行事（非正式且略粗鲁）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A very strict, tough person who demands obedience or high standards, often seeming unfriendly or harsh.","zh":"（非正式）非常严厉、强硬的人，要求别人服从或达到很高标准，常给人不友好或刻薄的感觉。"},"examples":[{"en":"Our coach is a hardass, but the team improved a lot under her rules.","zh":"我们的教练很严厉，但在她的规矩下球队进步很大。"},{"en":"He can be a hardass at work, yet he’s kind outside the office.","zh":"他在工作上可能很强硬，但在办公室外其实很善良。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal) To act in a very strict, uncompromising way; to be tough on someone.","zh":"（非正式）以很严厉、毫不妥协的方式行事；对某人很强硬/很苛刻。"},"examples":[{"en":"Stop hardassing the new guy—he’s still learning.","zh":"别再苛刻为难新人了——他还在学习。"},{"en":"The teacher didn’t hardass us about minor mistakes.","zh":"老师没有因为小错误就对我们很苛刻。"}]}],"synonyms":["strict person","tough guy","disciplinarian","hard-nosed","no-nonsense"],"phonetic":"/ˈhɑɹdˌæs/","extraExplanation":["你输入的“ardass”很可能是拼写错误，常见的词是 **hardass**（有时也写作 *hard-ass*）。","这是比较粗鲁的口语，用在正式场合不合适；可以用更中性的说法：**strict**, **tough**, **demanding**, **no-nonsense**。","词源上是 *hard*（强硬）+ *ass*（粗俗词），强调“硬、不好惹、很难搞”。在影视或军队/体育语境里常见。"]}
{"word":"ardassine","summary":{"en":"“ardassine” is not a common English word; it’s likely a misspelling or a proper name.","zh":"“ardassine”不是常见英语词汇，更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling, a username, or a proper name (such as a surname, place name, or brand).","zh":"不是标准英语单词。更可能是拼写错误、用户名，或专有名词（如姓氏、地名或品牌名）。"},"examples":[{"en":"I couldn’t find “ardassine” in an English dictionary—did you mean a different word?","zh":"我在英语词典里找不到“ardassine”——你是不是想写另一个词？"},{"en":"“Ardassine” might be a name, so its meaning depends on the person or context.","zh":"“Ardassine”可能是一个名字，所以含义取决于具体人物或语境。"}]}],"phonetic":"/ɑrˈdæsɪn/","extraExplanation":["“ardassine”看起来像拼写误差。常见的相近拼写可能包括 assassin（刺客、暗杀者）等，但需要你提供上下文（完整句子、来源、语言/地区）才能准确判断。","如果这是游戏ID、网名或品牌名，通常不按英语词汇解释；可以告诉我它出现在哪个平台/文章/对白里，我可以帮你推测来源与含义。"]}
{"word":"Ardath","summary":{"en":"Ardath is usually a rare proper noun: a given name, or a place name best known from 2 Esdras (“the field of Ardath”).","zh":"Ardath 通常是罕见的专有名词：可作人名，也可作地名，较知名的来源是《以斯拉二书》中的“Ardath 的田地”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare given name (usually feminine) used in English, likely inspired by a biblical/apocryphal place name.","zh":"一个较罕见的英文人名（多作女性名），可能源自《圣经》次经/伪经中的地名。"},"examples":[{"en":"Ardath is an uncommon name today, but you may see it in older records.","zh":"Ardath 现在很少见，但在较早的记录中可能会出现。"},{"en":"Her grandmother’s name was Ardath, so the family reused it.","zh":"她祖母名叫 Ardath，所以家里沿用了这个名字。"}]},{"partOfSpeech":"n.","definition":{"en":"(in some religious and literary references) a place name; in the apocryphal book 2 Esdras, “the field of Ardath” is where Ezra goes to pray and reflect.","zh":"（见于部分宗教与文学引用）一个地名；在《以斯拉二书》（2 Esdras，次经/伪经）中，“Ardath 的田地”是以斯拉前去祈祷与沉思的地方。"},"examples":[{"en":"The passage mentions Ezra going out into the field of Ardath to be alone.","zh":"那段文字提到以斯拉走到 Ardath 的田地里独处。"},{"en":"Some writers borrow “Ardath” as a mysterious-sounding place name in fiction.","zh":"一些作者会把“Ardath”借用为小说里听起来神秘的地名。"}]}],"synonyms":["(proper noun)"],"phonetic":"/ˈɑr.dæθ/","extraExplanation":["“Ardath”在现代英语里不是常见词汇，更常被当作专有名词（人名或地名）出现。读到它时，最稳妥的理解方式是：先看上下文是在指“人”还是“地点”。","发音上结尾的 -th 常读作清辅音 /θ/（像 think 里的 th），因此不要读成 /t/ 或 /d/。","2 Esdras（《以斯拉二书》）在不同宗派传统中的地位不完全一样：有的传统把它当作次经/伪经，因此你可能在不同版本的《圣经》或注释里看到不同的归类。"]}
{"word":"Arde","summary":{"en":"Arde is Spanish for “burns/is burning,” sometimes kept in English texts for style or quotation.","zh":"Arde 是西班牙语，意思是“在燃烧/烧着”，在英文中常作为引用或风格化表达保留。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(from Spanish) “burns; is burning” — third‑person singular present of arder (“to burn”). In English writing, it may appear in Spanish quotes, song/poetry titles, or names.","zh":"（源自西班牙语）“在燃烧；烧着”——动词 arder（“燃烧”）的直陈式现在时第三人称单数。在英文语境中常作为西语引用、歌词/诗歌标题或专名出现。"},"examples":[{"en":"In the chorus, the singer repeats “arde, arde” (“burn, burn”) to show intense emotion.","zh":"在副歌里，歌手反复唱“arde, arde”（“燃烧吧，燃烧吧”）来表达强烈情绪。"},{"en":"The poem’s title “Arde” suggests passion that won’t die out.","zh":"这首诗题为“Arde”，暗示不会熄灭的热情。"},{"en":"The subtitle translates the Spanish line: “Mi corazón arde” — “My heart is burning.”","zh":"字幕把西语句子翻成英文：“Mi corazón arde”——“我的心在燃烧”。"}]}],"synonyms":["burns (translation)","is on fire (translation)","is burning (translation)"],"phonetic":"/ˈɑr.de/","extraExplanation":["“Arde”本身通常不算英语单词；如果你是在英文文本里看到它，多半是保留原文的西班牙语。","它和英语词根 ard-（如 ardent“热烈的”、ardor“热情”）在意义上相近，都与“燃烧、热度、激情”相关。"]}
{"word":"Ardea","summary":{"en":"Ardea is the scientific genus name for several large herons (the “true herons”).","zh":"Ardea 是苍鹭属的学名，用于指一类大型鹭（“真鹭”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus (group) of large herons, including the great blue heron and gray heron; often called the “true herons.”","zh":"苍鹭属（Ardea）：大型鹭类的一个属（分类群），包括大蓝鹭、苍鹭等，常被称为“真鹭”。"},"examples":[{"en":"The great blue heron belongs to the genus Ardea.","zh":"大蓝鹭属于苍鹭属（Ardea）。"},{"en":"In the wetland survey, several Ardea species were recorded near the river.","zh":"在湿地调查中，研究人员在河边记录到了几种苍鹭属（Ardea）的鸟类。"}]}],"synonyms":["heron (general term)","true herons (common-name group)"],"phonetic":"/ˈɑrdiə/","extraExplanation":["Ardea 是拉丁语，原意就是“苍鹭/鹭”。在生物分类中它是“属名”，所以常用斜体书写（Ardea），首字母大写。","日常英语里，人们更常说 heron（鹭/苍鹭），而 Ardea 多见于鸟类学、自然纪录片字幕、学术或科普文章。"]}
{"word":"ardea","summary":{"en":"Ardea is the scientific genus name for several large herons and egrets.","zh":"Ardea 是多种大型鹭鸟（鹭与白鹭等）的生物学属名（苍鹭属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of large herons and egrets (family Ardeidae), including species like the great blue heron.","zh":"（生物）苍鹭属：鹭科中的一属大型鹭鸟与白鹭，代表种包括大蓝鹭等。"},"examples":[{"en":"The guide pointed out an Ardea heron standing motionless by the river.","zh":"向导指着一只苍鹭属的鹭鸟，它一动不动地站在河边。"},{"en":"Scientists recorded several Ardea species nesting in the wetland.","zh":"科学家记录到多种苍鹭属物种在湿地筑巢。"}]}],"synonyms":["heron (general term)","egret (general term)","genus Ardea"],"phonetic":"/ɑrˈdiə/","extraExplanation":["“Ardea”源自拉丁语，常用于生物学的拉丁学名中（如 Ardea herodias 大蓝鹭）。在日常英语里，人们更常说“heron（鹭）/egret（白鹭）”，而“Ardea”多见于学术文章、野外观察记录或物种名中。"]}
{"word":"Ardeae","summary":{"en":"Ardeae is a Latin-based scientific term meaning “herons,” and it has also been used historically as a taxonomic grouping related to the heron family (Ardeidae).","zh":"Ardeae 是源自拉丁语的科学术语，意思是“鹭（复数）”，也曾在旧分类中作为与鹭科（Ardeidae）相关的类群名称使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific (Latinized) name used in ornithology for heron-like birds; historically, a taxonomic group referring to herons and their close relatives (today usually treated under the family name Ardeidae).","zh":"（鸟类学/拉丁化学名）指鹭类鸟；历史上曾用作分类群名称，概指鹭及其近缘类群（现代更常用科名 Ardeidae“鹭科”）。"},"examples":[{"en":"In older classification systems, some authors placed herons in a group called Ardeae.","zh":"在较早的分类系统中，有些作者把鹭类归入一个叫 Ardeae 的类群。"},{"en":"Ardeae is a Latin-based scientific label connected with the heron family Ardeidae.","zh":"Ardeae 是一个基于拉丁语的科学名称，与鹭科（Ardeidae）有关。"}]},{"partOfSpeech":"n.","definition":{"en":"(Latin) “herons,” the plural of ardea (“heron”).","zh":"（拉丁语）“鹭”（复数），单数 ardea 表示“一只鹭”。"},"examples":[{"en":"The Latin word ardeae can be translated as “herons.”","zh":"拉丁语 ardeae 可以译为“鹭（复数）”。"}]}],"synonyms":["herons","egrets","Ardeidae"],"phonetic":"/ɑrˈdiː.i/","extraExplanation":["Ardeae 来自拉丁语 ardea（“鹭”）。在生物分类学里，很多名称采用拉丁/希腊词根；但现代常用的正式层级更多写作 Ardeidae（鹭科），而 Ardeae 往往出现在旧分类或某些作者的用法中。","发音在英语语境里通常按“拉丁化科学读法”来读，不同地区/学科可能略有差异。"]}
{"word":"ardeae","summary":{"en":"Ardeae is a scientific Latin plural term for herons and related birds.","zh":"Ardeae 是学术拉丁语中的复数术语，指鹭类及其近亲鸟类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific (Latin) plural term referring to herons and their relatives (herons, egrets, bitterns), used in biological classification.","zh":"（拉丁语/学术用语）复数名词，指“鹭类及其近亲”（如鹭、白鹭、麻鳽等），常用于生物分类学语境中。"},"examples":[{"en":"In some older classifications, Ardeae grouped herons and egrets together.","zh":"在一些较旧的分类体系中，Ardeae 用来把鹭和白鹭等归为一类。"},{"en":"The paper compares feeding behavior across several Ardeae species.","zh":"这篇论文比较了多种鹭类（Ardeae）物种的取食行为。"}]}],"synonyms":["herons and egrets","Ardeidae (related term)","heron family (general)"],"phonetic":"/ɑrˈdiː.iː/","extraExplanation":["Ardeae 源自拉丁语 ardea（“鹭”）。在现代分类中，你更常见到的是 Ardeidae（鹭科）或 Pelecaniformes / Ciconiiformes 等更具体的分类名称；Ardeae 在一些文献里属于较旧或较宽泛的用法。","读学术文章时，如果看到 Ardeae，通常可以先理解为“鹭类（herons/egrets/bitterns 这一群）”，再结合上下文判断作者采用的是哪套分类体系。"]}
{"word":"ardeb","summary":{"en":"Ardeb is a traditional Egyptian unit for measuring grain and other dry goods; its exact amount can vary.","zh":"Ardeb 是埃及传统的干货（尤其谷物）计量单位，具体数值可能因地区与时期而不同。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Egyptian unit used to measure grain and other dry goods (its exact size varies by region and time).","zh":"阿尔德布（埃及传统的谷物等干货计量单位；具体大小因地区与时代而异）。"},"examples":[{"en":"The farmer sold wheat by the ardeb at the local market.","zh":"农民在当地市场按“ardeb（阿尔德布）”来卖小麦。"},{"en":"Historical records list grain taxes in ardabs rather than kilograms.","zh":"历史记录中，粮食税常用“ardeb（复数：ardabs）”记载，而不是用千克。"}]}],"synonyms":["dry measure","grain measure","Egyptian unit"],"phonetic":"/ˈɑr.dɛb/","extraExplanation":["“ardeb”源自阿拉伯语“أردبّ (irdabb/ardabb)”的英语转写，常见于关于埃及农业、税收、贸易的历史或学术文本中。","它通常是“干量”（dry measure）单位，常被粗略换算为约150升左右，但不同作物与地区可能采用不同折算标准，因此阅读资料时要注意作者给出的具体换算。"]}
{"word":"ardebs","summary":{"en":"“ardebs” is not a standard English word; it’s likely a misspelling or a proper name.","zh":"“ardebs”不是标准英语单词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a typo or a name/username. Common possibilities include “Arabs” (a people), “Ardbeg” (a Scotch whisky brand), or “debs” (short for debutantes in some contexts).","zh":"不是标准英语单词；更可能是拼写错误或人名/账号名。常见的可能包括 “Arabs”（阿拉伯人/阿拉伯民族）、“Ardbeg”（苏格兰威士忌品牌）、或 “debs”（在某些语境中指“舞会出道的上流社会年轻女性/出道舞会”）。"},"examples":[{"en":"I couldn’t find “ardebs” in a dictionary—did you mean “Arabs” or “Ardbeg”?","zh":"我在词典里找不到“ardebs”——你是不是想写“Arabs”或“Ardbeg”？"},{"en":"If you tell me the sentence you saw it in, I can identify what “ardebs” is supposed to be.","zh":"如果你把看到它的句子发给我，我可以判断“ardebs”可能原本是什么词。"}]}],"phonetic":"/ɑrˈdɛbz/","extraExplanation":["“ardebs”本身不常见于主流英语词典。如果你能提供：①出现的完整句子/上下文；②是否是人名、地名、品牌名；③你想表达的意思（比如“阿拉伯人/某个品牌/某个缩写”），我就能更准确地给出释义、发音和例句。","如果你原本想输入的是“Arabs”（注意大小写不影响发音但会影响专有名词感觉），建议确认拼写：Arabs = A-r-a-b-s。"]}
{"word":"Ardeche","summary":{"en":"Ardèche is a place name in southern France: both a department and a river, best known for the Ardèche Gorge.","zh":"Ardèche是法国南部的地名：既指一个省也指一条河，最出名的是阿尔代什峡谷。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A department (administrative area) in southern France, known for the Ardèche River and the dramatic Ardèche Gorge.","zh":"法国南部的一个省（行政区），以阿尔代什河及其壮观的阿尔代什峡谷闻名。"},"examples":[{"en":"They spent a week hiking in Ardèche and visiting small villages.","zh":"他们在阿尔代什徒步了一周，还参观了许多小村庄。"},{"en":"Ardèche is popular for kayaking in the summer.","zh":"阿尔代什在夏季很适合划皮划艇，因此很受欢迎。"}]},{"partOfSpeech":"n.","definition":{"en":"The Ardèche River in southern France, a tributary of the Rhône, famous for cutting the Ardèche Gorge.","zh":"法国南部的阿尔代什河，是罗讷河的支流，以冲刷形成阿尔代什峡谷而著名。"},"examples":[{"en":"The Ardèche flows through limestone landscapes before joining the Rhône.","zh":"阿尔代什河流经石灰岩地貌，之后汇入罗讷河。"},{"en":"We rafted down the Ardèche and camped along the riverbank.","zh":"我们在阿尔代什河上漂流，并在河岸露营。"}]}],"synonyms":["Ardèche Department","Ardèche River"],"phonetic":"/ɑrˈdɛʃ/","extraExplanation":["“Ardèche”是法语地名，带重音符号“è”。英语里常见的拼写会保留或省略重音（Ardèche / Ardeche）。","英语发音通常把结尾读成“sh”（类似“fresh”里的/sh/），而不是按字母逐个发音。","文化与旅行语境中，Ardèche常和“Gorges de l’Ardèche（阿尔代什峡谷）”“Pont d’Arc（拱门桥）”等景点一起出现。"]}
{"word":"Ardeen","summary":{"en":"Ardeen is most commonly used as an uncommon personal name in English.","zh":"Ardeen 最常见的用法是一个较少见的英语人名（名字或姓氏）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a personal name (given name or surname); it is uncommon in modern English and is usually used as a proper noun.","zh":"人名（名字或姓氏）；在现代英语中不常见，通常作为专有名词使用。"},"examples":[{"en":"Ardeen moved to Seattle for a new job.","zh":"Ardeen 搬到西雅图开始一份新工作。"},{"en":"I met Dr. Ardeen at the conference.","zh":"我在会议上见到了 Ardeen 博士。"}]}],"phonetic":"/ɑrˈdin/","extraExplanation":["“Ardeen”更常见的用法是作为姓名而不是词汇本身，因此它没有固定的“词义”。不同家庭或地区可能有不同的拼写与读音（例如 Ardeen / Ardine / Arden 等），有时是音译、也可能是由其他语言的名字改写而来。","如果你是在书里、影片里或某个品牌/地名中看到 “Ardeen”，把上下文（完整句子或截图）发来，我可以更准确判断它指的是人名、地名，还是特定作品中的专有称呼。"]}
{"word":"Ardeha","summary":{"en":"“Ardeha” is most likely a proper name, not a standard English word; its meaning depends on context.","zh":"“Ardeha”多半是专有名词而非标准英语词汇；具体含义需要看语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (given name or place name). It is not a common standard English vocabulary word, so its meaning depends on the person, language, or context using it.","zh":"专有名词（人名或地名）。它不是常见的标准英语词汇，因此含义取决于具体人物、语言来源或使用语境。"},"examples":[{"en":"Ardeha is the name of a character in the story.","zh":"Ardeha 是故事里一个角色的名字。"},{"en":"I met someone named Ardeha at the conference.","zh":"我在会议上认识了一个叫 Ardeha 的人。"}]}],"phonetic":"/ɑrˈdeɪə/","extraExplanation":["“Ardeha”在常见英语词典中通常查不到固定词义，更像是姓名、地名或虚构作品中的专名。","如果你是在某段文字里看到的，建议你提供原句或说明来源（例如：小说/游戏/某种语言的拼写），我可以帮你判断它可能的含义、读音和相关背景。","也可能是其他单词的拼写变体或拼写错误；如果你想查的是另一个词，请告诉我你想表达的意思或可能的正确拼写。"]}
{"word":"Ardehs","summary":{"en":"“Ardehs” is not a common English word; it is most likely a proper name or a spelling variant that needs context.","zh":"“Ardehs”不是常见英语词；更可能是专有名词或拼写变体，需要语境才能确定含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (not a standard English dictionary word). It may be a surname, brand name, or a place/person name, depending on context.","zh":"专有名词（不是常见的英语词典词条）。可能是姓氏、品牌名，或地名/人名，具体取决于语境。"},"examples":[{"en":"I couldn’t find “Ardehs” in a standard English dictionary—could it be a name?","zh":"我在常见英语词典里找不到“Ardehs”——它会不会是一个名字？"},{"en":"Ardehs is listed as a user name on the website.","zh":"Ardehs 在这个网站上被列为用户名。"}]}],"phonetic":"/ɑrˈdeɪz/","extraExplanation":["“Ardehs”看起来更像是专有名词或拼写变体，而不是常见英语单词。若你是在文章/游戏/社交平台看到它，提供一句原文或说明它指人名、地名还是品牌名，我可以更准确地解释。","也可能是拼写接近的词（例如某些姓氏或外来语的英语转写）。你可以核对是否少了/多了字母（如 Ardes, Ardeas, Arden, Ares 等）。"]}
{"word":"ardeid","summary":{"en":"An ardeid is a heron-family bird (or something related to that family), such as herons and egrets.","zh":"ardeid 指鹭科的鸟（或与鹭科有关的），如苍鹭、白鹭等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bird that belongs to the heron family (Ardeidae), such as herons, egrets, and bitterns","zh":"鹭科（Ardeidae）的鸟类，如苍鹭、白鹭、麻鳽等"},"examples":[{"en":"We spotted an ardeid wading slowly through the marsh, hunting for fish.","zh":"我们看到一只鹭科鸟在沼泽里慢慢涉水，寻找鱼。"},{"en":"Herons and egrets are ardeids commonly seen near rivers and wetlands.","zh":"苍鹭和白鹭是常见于河边和湿地的鹭科鸟。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the heron family (Ardeidae)","zh":"与鹭科（Ardeidae）有关的；鹭科的"},"examples":[{"en":"The guide pointed out ardeid nesting sites in the trees by the lake.","zh":"导游指出湖边树上的鹭科鸟筑巢地点。"},{"en":"Researchers recorded ardeid calls at dawn to estimate population size.","zh":"研究人员在黎明录下鹭科鸟的叫声，以估算种群数量。"}]}],"synonyms":["heron (common name, not exact)","egret (common name, not exact)","bittern (common name, not exact)"],"phonetic":"/ˈɑrdiɪd/","extraExplanation":["“ardeid”主要用于自然科普与鸟类学语境，日常英语里更常直接说“heron（苍鹭）/egret（白鹭）”。","词源来自拉丁语“Ardea”（鹭），对应的科名是“Ardeidae”。"]}
{"word":"Ardeidae","summary":{"en":"Ardeidae = the heron family (herons, egrets, bitterns).","zh":"Ardeidae 指“鹭科”（包括鹭、白鹭、麻鳽等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a biological family of long-legged wading birds that includes herons, egrets, and bitterns.","zh":"（生物分类）鹭科：一类长腿涉水鸟的科，包括鹭、白鹭和麻鳽等。"},"examples":[{"en":"The great egret is a member of the Ardeidae family.","zh":"大白鹭属于鹭科（Ardeidae）。"},{"en":"Many Ardeidae hunt in shallow water for fish and frogs.","zh":"许多鹭科鸟类在浅水中捕食鱼和青蛙。"}]}],"synonyms":["heron family","herons and egrets"],"phonetic":"/ɑrˈdiːədiː/","extraExplanation":["“Ardeidae”是拉丁化的学名（生物分类“科”级别），常见于论文、野外图鉴与物种名录中；日常英语里更常说“herons and egrets（鹭和白鹭）”。","读音在英语中有几种习惯说法；在野鸟学/生物学语境里，重音通常落在中间音节附近。记忆时可把它理解为“heron family（鹭科）”。"]}
{"word":"ardeidae","summary":{"en":"Ardeidae is the bird family that includes herons, egrets, and bitterns.","zh":"Ardeidae 指鹭科：包括苍鹭、白鹭、麻鳽等鸟类的一个科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of long-legged wading birds that includes herons, egrets, and bitterns","zh":"鹭科（包括苍鹭、白鹭、麻鳽等一类长腿涉禽的鸟类家族）"},"examples":[{"en":"The great egret is a well-known member of the Ardeidae.","zh":"大白鹭是鹭科中很有代表性的一种。"},{"en":"Wetlands often support many Ardeidae species because they hunt in shallow water.","zh":"湿地常常能养育多种鹭科鸟类，因为它们常在浅水中觅食。"}]}],"synonyms":["heron family","egret-and-heron family"],"phonetic":"ɑrˈdiˌaɪdi","extraExplanation":["“Ardeidae”是生物分类学用语，来自新拉丁语，常用于学术写作、野外调查报告和自然纪录片解说中。","词尾“-idae”在动物分类里通常表示“科”，因此看到类似形式（如Felidae猫科、Canidae犬科）时，可以推断它是某个动物“科”的名称。"]}
{"word":"Ardel","summary":{"en":"Ardel is mainly used as a personal name in English.","zh":"Ardel 主要作为英语人名使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (first name), used for people; sometimes a variant of names like Ardal/Ardell. It may be used for any gender, but in modern English it is more often seen as a masculine name in some regions.","zh":"人名（名字），用于称呼个人；有时被视为 Ardal / Ardell 等名字的变体。可用于任何性别，但在一些地区现代英语中更常见为男性名。"},"examples":[{"en":"Ardel moved to Chicago for a new job.","zh":"Ardel 为了新工作搬到了芝加哥。"},{"en":"My grandpa’s name was Ardel, so we named the baby after him.","zh":"我爷爷叫 Ardel，所以我们用他的名字给宝宝取名。"}]}],"synonyms":["Ardell","Ardal","Arden"],"phonetic":"/ɑrˈdɛl/","extraExplanation":["“Ardel”在英语里通常被当作专有名词（人名）使用，因此在词典中常见的信息会包括：发音、性别倾向、可能的拼写变体（如 Ardell, Ardal），以及在不同国家或年代的使用频率。它不像普通词汇那样有固定的“词义”，更多承载家族、地域或个人喜好等文化背景。"]}
{"word":"Ardelia","summary":{"en":"Ardelia is an uncommon female given name.","zh":"Ardelia 是一个较少见的女性英文名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (a personal name) used in English-speaking contexts.","zh":"Ardelia：女性英文名（人名）。"},"examples":[{"en":"Ardelia moved to Chicago for graduate school.","zh":"Ardelia 去芝加哥读研究生了。"},{"en":"We invited Ardelia to join our book club.","zh":"我们邀请 Ardelia 加入读书会。"}]}],"synonyms":["Delia","Ardelle","Adelia"],"phonetic":"/ɑrˈdiːliə/","extraExplanation":["Ardelia 多被视为较少见的女性名。日常使用时通常不翻译含义，而是按音译处理（如“阿黛莉娅/阿德莉娅”，不同地区译法可能不同）。","文学文化小补充：在英美文学研究中，Ardelia 有时被提到与 17 世纪早期美洲诗人 Anne Bradstreet（安妮·布拉德斯特里特）相关，她在一些文本传统中被称作“Ardelia”。如果你是在某篇诗歌/论文里看到这个名字，可能带有这种文学指代。"]}
{"word":"ardelia","summary":{"en":"Ardelia is an uncommon female given name; it is also associated with Anne Bradstreet as a pen name or poetic persona in literary discussion.","zh":"Ardelia 是一个较少见的女性名字；在文学讨论中也常与诗人安妮·布拉德斯特里特相关，作为她的笔名或诗歌化身。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a female given name (a woman’s first name).","zh":"女性名字（女子的名）。"},"examples":[{"en":"Ardelia is my grandmother’s name.","zh":"Ardelia 是我祖母的名字。"},{"en":"We named our daughter Ardelia after a beloved relative.","zh":"我们把女儿取名 Ardelia，以纪念一位敬爱的亲人。"}]},{"partOfSpeech":"other","definition":{"en":"a pen name used by the early American poet Anne Bradstreet (1612–1672) in some contexts; “Ardelia” can refer to her poetic persona.","zh":"早期美国诗人安妮·布拉德斯特里特（Anne Bradstreet，1612–1672）在一些语境中使用的笔名；“Ardelia”也可指她的诗歌化身。"},"examples":[{"en":"In some discussions of early American poetry, Ardelia is used to refer to Anne Bradstreet.","zh":"在一些关于早期美国诗歌的讨论中，人们会用 Ardelia 来指代安妮·布拉德斯特里特。"},{"en":"The poem is sometimes read as Ardelia speaking in a private, reflective voice.","zh":"这首诗有时会被解读为 Ardelia 以一种私密、沉思的声音在说话。"}]}],"synonyms":["Anne Bradstreet (in literary reference)"],"phonetic":"/ɑrˈdiːliə/","extraExplanation":["Ardelia 作为名字并不常见，常给人一种古典、文学感较强的印象。","关于词源：一般认为它可能与拉丁语词根有关，带有“热情、炽热（ardent）”一类的联想，但并不存在一个人人一致的单一来源。","文学背景：Anne Bradstreet 常被视为北美殖民时期最重要的英语诗人之一；在研究或课堂讨论中，用“Ardelia”指代她，有点像用一个“诗中自我/抒情主体”的名字来谈她的作品。"]}
{"word":"ardelio","summary":{"en":"“Ardelio” means a busybody—someone who meddles in other people’s affairs.","zh":"“Ardelio”指“爱管闲事的人”，即爱插手、干预他人事务的好事者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a meddlesome, busy person who interferes in other people’s affairs; a busybody","zh":"爱管闲事的人；好事者；爱插手他人事务的忙人"},"examples":[{"en":"Ignore him—he’s an ardelio who always wants to know everyone’s business.","zh":"别理他——他就是个爱管闲事的人，总想打听别人的私事。"},{"en":"The neighbors complained about an ardelio who kept reporting trivial things.","zh":"邻居们抱怨有个好事者老是举报一些鸡毛蒜皮的小事。"}]}],"synonyms":["busybody","meddler","nosy person","interloper","buttinsky"],"phonetic":"/ɑrˈdiːlioʊ/","extraExplanation":["“Ardelio”是非常少见、偏文学/古典的词，现代英语里更常用 busybody、meddler、nosy person。","词源来自拉丁语 ardelio，指“爱忙、爱插手的人”；因此它常带负面语气，暗示多管闲事、打扰他人。"]}
{"word":"Ardelis","summary":{"en":"Ardelis is most commonly used as a personal name (given name or sometimes a surname).","zh":"Ardelis 通常用作人名（名字，也可能作姓氏）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name (first name), used for people; uncommon in English-speaking countries","zh":"人名（名字）；在英语国家不常见"},"examples":[{"en":"Ardelis introduced herself at the start of the meeting.","zh":"阿德利斯在会议开始时做了自我介绍。"},{"en":"Do you spell Ardelis with one “l” or two?","zh":"Ardelis 是一个 “l” 还是两个 “l”？"}]},{"partOfSpeech":"other","definition":{"en":"a family name (surname/last name) in some communities","zh":"姓氏（在某些社群中使用）"},"examples":[{"en":"Ms. Ardelis will be joining the team next week.","zh":"Ardelis 女士将于下周加入团队。"}]}],"synonyms":["(no direct synonyms; proper name)"],"phonetic":"/ɑrˈdɛlɪs/","extraExplanation":["“Ardelis”更像是专有名词（人名）而不是常见英语词汇，因此一般不会像普通单词那样有固定词义。","发音在英语里通常按拼写读作 /ɑrˈdɛlɪs/（重音多落在第二音节），但真实读法可能会因个人、家庭语言背景而不同。","如果你是在书名、品牌名或特定文化语境里看到它，可能会有专门含义；你可以提供一句原文或出现的场景，我可以更精准解释。"]}
{"word":"Ardell","summary":{"en":"Ardell is a personal name (also a surname) and is also a well-known beauty brand, especially for false eyelashes.","zh":"Ardell 可作人名（也可作姓），同时也是知名美妆品牌名，尤以假睫毛闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (usually feminine in the U.S.), also used as a surname","zh":"人名（在美国多为女性名），也可作姓氏"},"examples":[{"en":"Ardell moved to Chicago for work.","zh":"Ardell 为了工作搬去了芝加哥。"},{"en":"Ms. Ardell will lead today’s meeting.","zh":"Ardell 女士将主持今天的会议。"}]},{"partOfSpeech":"n.","definition":{"en":"a brand name best known for false eyelashes and other beauty products","zh":"品牌名：以假睫毛等美妆产品闻名的品牌（Ardell）"},"examples":[{"en":"She bought Ardell lashes for the party.","zh":"她为派对买了 Ardell 的假睫毛。"},{"en":"Ardell is popular in many drugstores in the U.S.","zh":"在美国许多药妆店里，Ardell 很受欢迎。"}]}],"synonyms":["Ardel","Ardelle"],"phonetic":"/ɑrˈdɛl/","extraExplanation":["“Ardell”作人名在英语国家并不算常见，更常见于20世纪中后期的美国；有时会被看作由“Ard-”和“-ell”组合出来的现代名字。","在书面表达中，如果指品牌，常按商标写作 Ardell；如果指人名，首字母大写同样是 Ardell，需要根据上下文判断。"]}
{"word":"Ardella","summary":{"en":"Ardella is a female first name in English usage.","zh":"Ardella 是英语语境中使用的女性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A feminine given name (first name), used mainly in English-speaking contexts.","zh":"女性名字（名），主要见于英语国家/语境中。"},"examples":[{"en":"Ardella moved to Chicago for a new job.","zh":"Ardella 为了新工作搬去了芝加哥。"},{"en":"Please welcome our speaker, Ardella Johnson.","zh":"请欢迎我们的演讲者 Ardella Johnson。"}]}],"synonyms":["Ardelia","Ardell","Della"],"phonetic":"/ɑrˈdɛlə/","extraExplanation":["“Ardella”在英语里通常被当作女性名使用，不是常见词汇，因此在写作或阅读中多半出现在人名、名单、书信称呼等场景。","读音上重音常落在第二音节：ar-DEL-la。非正式场合可能会被昵称为“Ardie / Della”。","关于词源：它一般被视为较现代或较少见的名字，可能与“Ardell / Ardelia / Della”等名字有关联；不同家庭取名的来源可能不同。"]}
{"word":"ardella","summary":{"en":"Ardella is mainly used as a woman’s first name, and more rarely as a surname.","zh":"Ardella 主要用作女性名字，也较少用作姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a feminine given name (first name).","zh":"女性名字（名）。"},"examples":[{"en":"Ardella moved to Chicago for her first job.","zh":"Ardella 为了第一份工作搬到了芝加哥。"},{"en":"Our new classmate is named Ardella.","zh":"我们新来的同学叫 Ardella。"}]},{"partOfSpeech":"other","definition":{"en":"a family name (surname), though less common.","zh":"姓氏（较少见）。"},"examples":[{"en":"Ms. Ardella will lead today’s meeting.","zh":"Ardella 女士将主持今天的会议。"}]}],"synonyms":["Ardelia","Ardelle","Adella"],"phonetic":"/ɑrˈdɛlə/","extraExplanation":["“Ardella”多见于英语环境中的女性名，也偶尔作姓使用。","词源并不完全固定：它常被视为与“Ardelle/Ardelia”等名字相关，可能受拉丁语词根 *ard-*（与“燃烧、热情”相关）或法语/英语中表示“热情、炽热”的词（如 *ardent*）联想影响。由于姓名来源复杂，不同家族或地区也可能有不同解释。"]}
{"word":"ardellae","summary":{"en":"“ardellae” is likely a proper name or a Latin/older spelling form, not a common English vocabulary word.","zh":"“ardellae”更可能是专名或拉丁/旧式拼写形式，并非常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a proper name (e.g., a surname/place name) or a Latin-style form/spelling seen in older texts (sometimes written with “æ” as “ardellæ”).","zh":"不是标准英语单词；更可能是专有名词（如姓氏/地名）或旧式/拉丁化拼写（有时用“æ”写作“ardellæ”）。"},"examples":[{"en":"I couldn’t find “ardellae” in a standard English dictionary; it may be a name from a specific source.","zh":"我在常见英语词典里找不到“ardellae”；它可能来自某个特定资料中的名字。"},{"en":"If “Ardellae” is a character or place in your text, share the sentence and I can help interpret it.","zh":"如果“Ardellae”是你文章中的人物或地名，把原句发我，我可以帮你判断含义。"}]}],"phonetic":"/ɑrˈdɛleɪ/","extraExplanation":["“-ae”这个结尾常见于拉丁语/古典语境（例如表示某些变格形式），也常见于把“æ”转写成“ae”的旧式拼写。因此它可能不是现代英语词汇，而是出现在姓名、地名、书名、或拉丁引文里。","如果你是从图片、手写体或扫描文本里看到的，可能是误读/拼写误差。常见近似拼法可能包括：Ardelle, Ardella, Ardell, Adella, Ariella 等。把上下文句子发来最容易确认。"]}
{"word":"Ardelle","summary":{"en":"Ardelle is mainly used as a woman’s first name; it can also be a less common surname.","zh":"Ardelle 主要用作女性名字；也可较少见地用作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feminine given name (first name).","zh":"女性名字（名）。"},"examples":[{"en":"Ardelle moved to Chicago for her new job.","zh":"Ardelle 为了新工作搬到了芝加哥。"},{"en":"My grandmother’s name was Ardelle.","zh":"我祖母的名字叫 Ardelle。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname), less common than the first name use.","zh":"姓氏（较少见，也可作姓）。"},"examples":[{"en":"Dr. Ardelle will see you now.","zh":"Ardelle 医生现在要见你。"}]}],"synonyms":["Ardell","Ardel"],"phonetic":"/ɑrˈdɛl/","extraExplanation":["“Ardelle”通常被当作专有名词使用，因此在英语里一般不翻译含义；写作时首字母要大写。","关于词源：它常被认为与名字“Ardell / Ardel”有关，可能带有法语风格的拼写（-elle 结尾常见于法语/法语化名字），但不同家庭或地区的来源并不完全一致。","发音提示：重音在第二音节，读起来像“ar-DEL”。"]}
{"word":"Arden","summary":{"en":"Arden is most commonly a personal name. It can also be a place name, and in literature it refers to Shakespeare’s Forest of Arden in *As You Like It*.","zh":"Arden 最常见的是人名；也可作地名；在文学中还指莎士比亚《皆大欢喜》里的“阿登森林”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (first name) for people of any gender; also used as a surname","zh":"人名（名字），可用于任何性别；也可作姓氏"},"examples":[{"en":"Arden is a popular name in English-speaking countries.","zh":"Arden 是英语国家里比较常见的名字。"},{"en":"My friend Arden loves hiking on weekends.","zh":"我的朋友 Arden 周末喜欢徒步。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used for several locations, especially in English-speaking areas","zh":"地名；在英语国家中有多个地方叫 Arden"},"examples":[{"en":"They moved to Arden, Delaware for work.","zh":"他们为了工作搬到了特拉华州的 Arden。"},{"en":"We stopped in Arden on our road trip.","zh":"我们公路旅行时在 Arden 停了一下。"}]},{"partOfSpeech":"n.","definition":{"en":"(literary) “the Forest of Arden,” the main setting in Shakespeare’s play *As You Like It*","zh":"（文学）“阿登森林”，莎士比亚戏剧《皆大欢喜》的主要背景地"},"examples":[{"en":"In *As You Like It*, the characters escape to the Forest of Arden.","zh":"在《皆大欢喜》中，人物们逃到阿登森林。"},{"en":"The Forest of Arden often symbolizes freedom and a fresh start.","zh":"阿登森林常象征自由与新的开始。"}]}],"synonyms":["(related) Forest of Arden","(related) Ardennes (a different place name)"],"phonetic":"/ˈɑɹdən/","extraExplanation":["“Arden”常被解释为与“森林/高地”等意象相关的古老地名或姓名元素，因此在文学与品牌命名中常给人一种自然、宁静、田园的感觉。","莎士比亚的“阿登森林（Forest of Arden）”可能受英格兰沃里克郡的阿登森林（Arden Forest）启发；这一背景让作品中的“远离宫廷、回到自然”主题更突出。","在日常书写中，作为人名或地名时通常首字母大写：Arden。"]}
{"word":"ardencies","summary":{"en":"Ardencies means strong passions or intense enthusiasm (plural of ardency).","zh":"Ardencies 指强烈的热情或激情，是 ardency 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"strong enthusiasm, passion, or eagerness (plural: ardencies).","zh":"强烈的热情、激情或渴望（复数：ardencies）。"},"examples":[{"en":"Her ardency for teaching made students feel confident and motivated.","zh":"她对教学的热情让学生感到自信并更有动力。"},{"en":"The team played with an ardency that surprised their opponents.","zh":"球队以一种让对手意外的热情与拼劲在比赛。"},{"en":"In his letters, he wrote with youthful ardencies and big dreams.","zh":"在他的书信中，他带着年轻的热情与宏大的梦想写作。"}]}],"synonyms":["enthusiasms","passions","zeal","fervor","eagerness"],"phonetic":"ˈɑrdənsi","extraExplanation":["“ardency”来自形容词“ardent”（热情的、炽热的），其词源与拉丁语中表示“燃烧”的意思有关，所以它常带有“像火一样热烈”的语感。","“ardencies”多见于较正式或文学性的表达，用复数强调“多种热情/多次热情的表现”，例如对不同事业、信念或人的热情。"]}
{"word":"ardency","summary":{"en":"Ardency means strong passion or intense enthusiasm.","zh":"Ardency 指强烈的热情或激情。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"strong enthusiasm, passion, or intense feeling for someone or something; fervor.","zh":"热情；激情；强烈的感情（对某人或某事的热烈投入）。"},"examples":[{"en":"She spoke about the project with real ardency.","zh":"她谈到这个项目时充满了真挚的热情。"},{"en":"His ardency for music pushed him to practice every day.","zh":"他对音乐的热爱促使他每天练习。"},{"en":"The group’s ardency inspired others to volunteer.","zh":"这群人的热忱激励了更多人来做志愿者。"}]}],"synonyms":["passion","enthusiasm","fervor","zeal","eagerness"],"phonetic":"/ˈɑrdənsi/","extraExplanation":["“ardency”源自“ardent”（热烈的、炽热的），其词根可追溯到拉丁语 *ardere*，意为“燃烧”。因此它常带有“像火一样热”的比喻色彩，多用于描述情感、信念或投入程度。","语体上略显正式、书面，日常口语里更常用“passion”“enthusiasm”“fervor”。"]}
{"word":"Ardene","summary":{"en":"Ardene is most commonly the name of a Canadian fashion retail brand.","zh":"Ardene 最常见的意思是加拿大的一家时尚零售品牌名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A Canadian fashion retail brand known for affordable clothing, shoes, accessories, and beauty items (often found in malls and online).","zh":"一家加拿大的时尚零售品牌，以平价服装、鞋类、配饰与美妆产品闻名（常见于商场门店与线上）。"},"examples":[{"en":"I bought a pair of earrings at Ardene.","zh":"我在 Ardene 买了一对耳环。"},{"en":"Ardene often has sales on basics like T-shirts and leggings.","zh":"Ardene 经常对 T 恤、打底裤等基础款做促销。"}]}],"phonetic":"/ɑrˈdiːn/","extraExplanation":["“Ardene”在日常英语里通常是品牌名（专有名词），不是常见词汇；在不同国家/地区可能不如H&M、Zara那样普及。","发音上常重读第二音节，近似“ar-DEEN”。","如果你是在某个地址、人名或地名里看到“Ardene”，也可能是专有名词（例如店名、公司名），需要结合上下文确认。"]}
{"word":"Ardenia","summary":{"en":"“Ardenia” is usually a proper name (person/place/brand), not a common dictionary word; its meaning depends on context.","zh":"“Ardenia”通常是专有名词（人名/地名/品牌名），不是常见词典词；含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a proper name (often used as a feminine given name or a place name); it is not a common standard English vocabulary word and usually refers to a specific person, character, brand, or fictional location.","zh":"专有名词（常见为女性名字或地名）；它不是常见的标准英语词汇，通常指特定的人物、角色、品牌或虚构地点。"},"examples":[{"en":"Ardenia is the name of a character in my story.","zh":"Ardenia 是我故事里一个角色的名字。"},{"en":"The company registered Ardenia as its product name.","zh":"这家公司把 Ardenia 注册为产品名称。"},{"en":"We visited Ardenia, a small town on the map.","zh":"我们去过地图上的一个小镇——Ardenia。"}]}],"synonyms":["(no direct synonyms; proper name)"],"phonetic":"/ɑrˈdiːniə/","extraExplanation":["“Ardenia”在英语中更像是一个名字（人名/地名/品牌名），而不是像apple、beautiful这类有固定词典释义的常用词。具体含义通常取决于它在文本或语境中指代什么。","它可能会被误看成“gardenia（栀子花）”的拼写错误；两者拼写相近，但含义完全不同。若你是想查“gardenia”，我也可以给出详细释义与用法。","也有人把它联想到“Arden”（如莎士比亚笔下的Arden森林意象），但“Ardenia”本身并不是固定成语或经典文学中的常用词。"]}
{"word":"Ardennes","summary":{"en":"The Ardennes is a wooded region in Belgium/Luxembourg/France, also famous in WWII history (Battle of the Bulge).","zh":"Ardennes（阿登）是比利时/卢森堡/法国交界的森林高地，也因二战史（突出部战役）而著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a forested highland region (the Ardennes) spanning southeastern Belgium, northern Luxembourg, and northeastern France, known for its wooded hills and river valleys","zh":"阿登地区（The Ardennes）：横跨比利时东南部、卢森堡北部和法国东北部的森林高地，以丘陵森林与河谷地形闻名"},"examples":[{"en":"They drove through the Ardennes to visit small villages and forests.","zh":"他们开车穿过阿登地区，去看小村庄和森林。"},{"en":"The Ardennes is popular for hiking and cycling.","zh":"阿登地区很适合徒步和骑行。"}]},{"partOfSpeech":"n.","definition":{"en":"(history) the Ardennes as a strategic area in World War II, especially connected to the Battle of the Bulge (often called the Ardennes Offensive)","zh":"（历史）二战中的阿登战略地带，尤指“突出部战役”（也常被称为“阿登攻势”）相关的地区"},"examples":[{"en":"The documentary explains why the Ardennes became a key battlefield in 1944.","zh":"这部纪录片解释了为什么阿登在1944年成为关键战场。"},{"en":"Many war memorials in the Ardennes remember the Battle of the Bulge.","zh":"阿登地区的许多战争纪念碑都在纪念突出部战役。"}]}],"synonyms":["the Ardennes","Ardennes Forest"],"phonetic":"/ɑrˈdɛn/","extraExplanation":["“Ardennes”是地名，英语里常用定冠词说成“the Ardennes”。也可以说“the Ardennes Forest”（阿登森林）。","“Battle of the Ardennes”在英语里常指“突出部战役”（Battle of the Bulge）。不同资料会用不同名称，但都与1944年冬季德军在该地区发起的大规模攻势有关。"]}
{"word":"ardennite","summary":{"en":"Ardennite is a rare manganese–aluminum silicate mineral often containing arsenate/vanadate.","zh":"Ardennite（阿登石）是一种较罕见的锰—铝硅酸盐矿物，常含砷酸根/钒酸根成分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (a manganese–aluminum silicate) that often contains arsenate and/or vanadate, typically found in metamorphic rocks.","zh":"一种较罕见的矿物（锰—铝硅酸盐），常含砷酸根和/或钒酸根，通常产于变质岩中。"},"examples":[{"en":"Ardennite is valued mainly by mineral collectors because good crystals are uncommon.","zh":"阿登石主要受矿物收藏者喜爱，因为品相好的晶体并不常见。"},{"en":"The report noted ardennite occurring with other manganese-rich minerals in a metamorphic deposit.","zh":"报告指出在一处变质矿床中，阿登石与其他富锰矿物共生。"}]}],"synonyms":["mineral","manganese silicate"],"phonetic":"/ɑrˈdɛnˌnaɪt/","extraExplanation":["“arden(n)ite”一名来源于欧洲的阿登地区（Ardennes），早期在该地区被描述与命名。","它属于含锰、铝的硅酸盐矿物体系，成分可因含砷/钒等而变化；在矿物学文献中有时会细分为不同端元或“族/组”（group）。"]}
{"word":"ardens","summary":{"en":"“Ardens” is usually a rare/archaic verb form meaning “burns/glows,” or a plural form of the name “Arden.”","zh":"“Ardens”通常要么是罕见古体动词形式，意为“燃烧/发热发光”，要么是名称“Arden”的复数形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(rare, archaic) burns; glows with heat or strong feeling (third-person singular form of “arden”).","zh":"（罕见/古体）燃烧；发热发光；（感情）炽热（为动词 arden 的第三人称单数）。"},"examples":[{"en":"In old poetry, the heart ardens with longing.","zh":"在一些古诗体里，会写“心因渴望而炽热”。"},{"en":"The coals ardens in the dark, giving off a faint red light.","zh":"煤块在黑暗中燃着，透出淡淡的红光。"}]},{"partOfSpeech":"n.","definition":{"en":"(name) Plural of “Arden” (a surname or place name).","zh":"（名称）“Arden”的复数：可指多个同名地点，或同姓的人。"},"examples":[{"en":"Two Ardens are listed in the directory.","zh":"目录里列出了两个叫 Arden 的人。"},{"en":"They visited several places called Arden on their trip.","zh":"他们旅行时去了几个名叫 Arden 的地方。"}]}],"synonyms":["burns","glows","blazes"],"phonetic":"/ˈɑrdənz/","extraExplanation":["“arden”这个动词在现代英语里几乎不用，更常见的是形容词“ardent”（热烈的、炽热的）。它们都和拉丁语词根 *ard-*（燃烧）有关。","如果你是在读莎士比亚《皆大欢喜》（*As You Like It*），你可能会看到“Forest of Arden（阿登森林）”。那里的“Arden”是地名/意象，而不是常用动词；“Ardens”可能是误读、拼写变体，或指多个“Arden”。"]}
{"word":"ardent","summary":{"en":"Ardent means very passionate and strongly enthusiastic, often about a person, belief, or cause.","zh":"Ardent 指非常热情、充满激情，常形容对某个人、信念或事业的强烈投入与支持。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Showing strong feelings of enthusiasm, love, or support; very passionate.","zh":"热情的；热烈的；充满激情的（对某人或某事有强烈的热爱、支持或投入）"},"examples":[{"en":"She is an ardent supporter of public libraries.","zh":"她是公共图书馆的热心支持者。"},{"en":"He wrote an ardent letter expressing his love.","zh":"他写了一封热烈的信表达爱意。"},{"en":"They had an ardent debate about education policy.","zh":"他们就教育政策展开了激烈而投入的辩论。"}]}],"synonyms":["passionate","enthusiastic","fervent","devoted","zealous"],"phonetic":"/ˈɑɹdənt/","extraExplanation":["“ardent”常用来形容对人、理想、事业或兴趣的强烈投入与热情，语气通常偏正面（热爱、忠诚、支持）。但在“ardent debate/argument”等搭配中，更多强调情绪强烈、投入度高，并不一定表示友好。","词源上与“燃烧、炽热”的意象有关，所以它常带有“像火一样热烈”的感觉。写作中比“enthusiastic”更有文学色彩，也更强调深度与强度。"]}
{"word":"ardently","summary":{"en":"“Ardently” means “with strong passion or enthusiasm.”","zh":"“ardently”表示“热烈地、充满激情地（带强烈情感与投入）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows strong feeling, enthusiasm, or passion.","zh":"热烈地；热情地；充满激情地。"},"examples":[{"en":"She spoke ardently about protecting the environment.","zh":"她热情地谈论保护环境。"},{"en":"He ardently supported his team through the whole season.","zh":"他整个赛季都热烈地支持自己的球队。"},{"en":"They ardently hoped for peace.","zh":"他们热切地希望和平。"}]}],"synonyms":["passionately","fervently","enthusiastically","eagerly","devotedly"],"phonetic":"/ˈɑɹdəntli/","extraExplanation":["“ardently”常用于较正式或文学性的语境，表示情感强烈且真诚；在日常口语里也可用“really/very/passionately”替换，但语气没有这么“浓”。","词源上与“burn”（燃烧）相关的意象相近（来自拉丁语表示“燃烧、炽热”的词根），所以常带有“炽热的感情/热烈投入”的感觉。","常见搭配：ardently believe（坚信）、ardently hope（热切希望）、ardently support（热情支持）、ardently in love（热恋中/深深爱着）。"]}
{"word":"ardentness","summary":{"en":"Ardentness means strong passion or enthusiastic intensity.","zh":"Ardentness 指强烈的热情或激情（情感强度很高）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Strong enthusiasm, passion, or intensity of feeling toward someone or something.","zh":"对某人或某事强烈的热情、激情或情感上的强烈程度。"},"examples":[{"en":"Her ardentness for teaching kept her motivated even on difficult days.","zh":"她对教学的热忱让她即使在困难的日子也能保持动力。"},{"en":"The fans showed ardentness when the team returned home.","zh":"球队回到主场时，球迷们表现出强烈的热情。"},{"en":"He spoke with ardentness about protecting the environment.","zh":"他谈到保护环境时充满热情。"}]}],"synonyms":["ardor","passion","enthusiasm","fervor","zeal"],"phonetic":"/ˈɑrdəntnəs/","extraExplanation":["“ardentness”来自形容词“ardent”（热烈的、热情的）加名词后缀“-ness”，表示“……的状态/性质”。在现代英语里，这个名词不算常用，更常见的说法是“ardor/ardour”（热情）或“passion”（激情）。","语体感觉：比“enthusiasm”更偏“热烈、强烈”，常见于较正式或文学化的表达，例如谈信念、爱情、政治理想等。"]}
{"word":"Ardenvoir","summary":{"en":"Ardenvoir is a small unincorporated community in Chelan County, Washington, in the Entiat River valley.","zh":"Ardenvoir是美国华盛顿州奇兰县、恩蒂亚特河河谷中的一个小型非建制社区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An unincorporated community (small settlement) in Chelan County, Washington State, U.S., located along the Entiat River valley.","zh":"美国华盛顿州奇兰县的一个非建制社区（小型聚居地），位于恩蒂亚特河（Entiat River）河谷一带。"},"examples":[{"en":"We drove through Ardenvoir on our way to hiking trails in the Entiat Valley.","zh":"我们开车经过Ardenvoir，准备去恩蒂亚特河谷的徒步路线。"},{"en":"Ardenvoir is a quiet place known for forests, cabins, and river scenery.","zh":"Ardenvoir是个安静的地方，以森林、小木屋和河景闻名。"}]}],"synonyms":["(proper place name; no true synonyms)"],"phonetic":"ˈɑrdənˌvwɑr","extraExplanation":["Ardenvoir 是专有地名，日常对话中通常不翻译；需要说明时可说 “Ardenvoir, Washington”。","读音在不同人群中可能略有差异（尤其是外来法语式拼写），但在当地英语里常按英语规则读成类似 “AR-den-vwar”。"]}
{"word":"arder","summary":{"en":"“Arder” is a rare word meaning a person who burns/sets fires, and it is also used as a surname.","zh":"“Arder”是个很罕见的词，可指纵火者；也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/obsolete) A person who burns or sets fire to something; an arsonist.","zh":"（罕见/过时）纵火者；放火的人。"},"examples":[{"en":"The old record mentioned an arder who burned barns at night.","zh":"那份旧记录提到有个纵火者在夜里烧谷仓。"},{"en":"In modern English, people usually say “arsonist,” not “arder.”","zh":"在现代英语里，人们通常说“arsonist（纵火犯）”，而不是“arder”。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname).","zh":"姓氏。"},"examples":[{"en":"Dr. Arder will see you now.","zh":"阿德医生现在会见你。"}]}],"synonyms":["arsonist","fire-raiser"],"phonetic":"/ˈɑrdər/","extraExplanation":["“arder”在现代英语中非常少见。很多学习者想查的其实是 **ardor**（美式拼写；英式常写 **ardour**），意思是“热情、激情”。","如果你想表达“热情”，更自然的搭配是：**with ardor**（满怀热情）或 **show ardor for**（对……表现出热情）。","如果你本来想写的是“命令/指令”，也可能是把 **order** 拼错了。你可以告诉我你的原句，我帮你确认最合适的词。"]}
{"word":"Ardeth","summary":{"en":"Ardeth is usually a rare male given name (often recognized from The Mummy). In archaic English, “ardeth” can mean “plows.”","zh":"Ardeth 通常是罕见的男性名字（常因《木乃伊》而被认识）；在古语中，“ardeth”可表示“犁地/耕作（plows）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A male given name (proper name). It is rare in modern English and is most widely recognized from popular culture (for example, the character Ardeth Bay in the film The Mummy).","zh":"男性名字（专有名词）。现代英语中较少见，更多因流行文化而为人所知（例如电影《木乃伊》中的角色 Ardeth Bay）。"},"examples":[{"en":"Ardeth is a rare name, so people often ask how to spell it.","zh":"Ardeth 是个少见的名字，所以人们常会问怎么拼。"},{"en":"In The Mummy, Ardeth Bay helps guide the main characters through the desert.","zh":"在《木乃伊》中，Ardeth Bay 帮助主角们穿越沙漠。"}]},{"partOfSpeech":"v.","definition":{"en":"(Archaic) “plows” — an old third-person singular form of the verb “ard” (to plow). You may see it in older or literary English, but it is not used in everyday modern English.","zh":"（古语）“耕作 / 犁地”——动词 ard（犁地）的第三人称单数旧式形式，相当于现代英语的 plows。可能出现在古典或文学英语中，但现代日常英语不使用。"},"examples":[{"en":"He ardeth the field at dawn. (archaic)","zh":"他在黎明时分犁地。（古语）"}]}],"synonyms":["plows (archaic sense)"],"phonetic":"/ˈɑr.dɛθ/","extraExplanation":["Ardeth 作为人名时，多数情况下并不是英语传统常用名。电影《木乃伊》里的“Ardeth Bay”让它在英语世界更有辨识度，但现实生活中仍然非常少见。","古语动词 ard（犁地）在现代英语里几乎不用；你更可能见到的是 plow/plough。带 -eth 的动词形式（如 goeth, saith）常见于《钦定版圣经》（KJV）或模仿古风的文学写作中。"]}
{"word":"Ardha-Magadhi","summary":{"en":"Ardha-Magadhi is a historical Prakrit language best known as the main language of many early Jain scriptures.","zh":"阿尔达-摩揭陀语是一种历史上的俗语（普拉克里特语），最著名的是作为许多早期耆那教经典的主要语言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Middle Indo-Aryan language (a Prakrit) historically used in parts of northern and eastern India, especially known as the main language of many early Jain scriptures.","zh":"一种中古印度-雅利安语支的语言（俗语/普拉克里特语的一种），历史上流行于印度北部与东部部分地区，尤以许多早期耆那教经典的主要语言而著名。"},"examples":[{"en":"Many early Jain texts were composed in Ardha-Magadhi.","zh":"许多早期耆那教文献是用阿尔达-摩揭陀语写成的。"},{"en":"Scholars compare Ardha-Magadhi with other Prakrits to trace the history of Indo-Aryan languages.","zh":"学者会将阿尔达-摩揭陀语与其他俗语作比较，以追溯印度-雅利安诸语言的历史。"}]}],"synonyms":["Ardhamagadhi","Ardha Magadhi"],"phonetic":"/ˌɑrdə məˈɡɑdi/","extraExplanation":["“Ardha-”在梵语里有“半、部分”的意思，因此 Ardha-Magadhi 常被理解为“（与）摩揭陀语（Magadhi）相近但不完全相同的方言/语言”。","它与佛教经典常见的巴利语（Pali）同属中古印度语群，但传统上 Ardha-Magadhi 与耆那教经典的关系更紧密。","拼写上也常见 Ardhamagadhi / Ardha Magadhi 等变体；学术写作中通常会保留连字符以强调复合词结构。"]}
{"word":"Ardhamagadhi","summary":{"en":"Ardhamagadhi is a Prakrit (Middle Indo-Aryan) language best known as the traditional language of early Jain scriptures.","zh":"Ardhamagadhi 是一种俗语（中期印度-雅利安语），最广为人知的是作为早期耆那教经典的传统语言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Middle Indo-Aryan language (a type of Prakrit) closely associated with early Jain scriptures; it is especially known as the traditional language of the Jain Āgamas.","zh":"一种中期印度-雅利安语（属于俗语 Prakrit 的一种），与早期耆那教经典关系密切，尤以作为耆那教《阿含/圣典》（Āgamas）的传统语言而著名。"},"examples":[{"en":"Many early Jain texts were transmitted in Ardhamagadhi.","zh":"许多早期耆那教文献以 Ardhamagadhi（半摩揭陀语）传承下来。"},{"en":"The scholar compared Ardhamagadhi with other Prakrits to trace how the language changed over time.","zh":"学者将 Ardhamagadhi 与其他俗语对比，以追踪语言随时间的变化。"}]}],"synonyms":["Jain Prakrit","Prakrit (general term)"],"phonetic":"/ˌɑrdə məˈɡɑdi/","extraExplanation":["“Ardhamagadhi”常被译作“半摩揭陀语”。名称里“Magadhi（摩揭陀语）”指古代印度摩揭陀地区相关的语言/方言传统；“ardha-（半、部分）”暗示它与“Magadhi”有密切关系，但并不等同。","在语言学习或阅读文献时，你可能会看到它被称为“Jain Prakrit（耆那俗语）”，因为它在耆那教经典传统中地位非常突出。"]}
{"word":"ardhamagadhi","summary":{"en":"Ardhamagadhi is a Prakrit language best known as a major language of early Jain scriptures.","zh":"阿尔达摩揭陀语是一种普拉克里特语，最广为人知的是它作为早期耆那教经典的重要语言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Middle Indo-Aryan language (a Prakrit) closely associated with early Jain scriptures; historically spoken in parts of northern India.","zh":"阿尔达摩揭陀语（Ardhamagadhi）：一种中古印度-雅利安语（普拉克里特语的一支），与早期耆那教经典密切相关；历史上在印度北部部分地区使用。"},"examples":[{"en":"Many early Jain texts were composed in Ardhamagadhi.","zh":"许多早期耆那教文献是用阿尔达摩揭陀语写成的。"},{"en":"The scholar compared Ardhamagadhi with other Prakrit languages.","zh":"这位学者把阿尔达摩揭陀语与其他普拉克里特语作了比较。"}]}],"synonyms":["Ardha-Magadhi","Ārdhamāgadhī"],"phonetic":"/ˌɑrdə məˈɡɑdi/","extraExplanation":["“Ardha-”在梵语/印度语境中有“半、部分”的意思；“Magadhi”与古代“摩揭陀（Magadha）”地区相关。因此该名称常被理解为“（与）摩揭陀语相关的一种‘半/部分’变体”，体现它与摩揭陀地区语言传统的亲缘关系，但并不表示它“只是一半的语言”。","在学习印度古典语言时，Ardhamagadhi常和Pali（巴利语）一起被提到：两者都属于中古印度语的早期书面语言传统，但宗教与文本传统侧重点不同（耆那教 vs. 佛教）。","常见写法有Ardhamagadhi、Ardha-Magadhi；在学术文章中也可能见到带长音符号的转写（如Ārdhamāgadhī）。"]}
{"word":"Ardhanari","summary":{"en":"Ardhanari refers to Shiva depicted as half male and half female, symbolizing the unity of masculine and feminine energies (often short for “Ardhanarishvara”).","zh":"Ardhanari 指湿婆的“半男半女”形象，象征男性与女性力量的合一（常为 Ardhanarishvara 的简称）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Hinduism) A concept or depiction of Shiva as half male and half female, symbolizing the unity of masculine and feminine principles; often used as a shorter form of “Ardhanarishvara.”","zh":"（印度教）“半男半女”的神格观念或形象：湿婆呈现为一半男性、一半女性，象征阴阳/男女两种力量的合一；常被视为“Ardhanarishvara（阿尔达那利湿伐罗）”的简称。"},"examples":[{"en":"The statue shows Ardhanari with the right side as Shiva and the left side as Parvati.","zh":"这尊雕像呈现“Ardhanari”，右半边是湿婆，左半边是帕尔瓦蒂。"},{"en":"In class we discussed how Ardhanari represents balance rather than simply gender.","zh":"课堂上我们讨论了“Ardhanari”更多象征平衡，而不只是性别。"}]}],"synonyms":["Ardhanarishvara","androgynous form of Shiva","half-male, half-female deity"],"phonetic":"/ɑrdhəˈnɑri/","extraExplanation":["“Ardhanari”来自梵语词根：ardha-（一半）+ nārī（女人），字面意思是“半个女人”。在更完整、常见的名称“Ardhanarishvara”中，-īśvara表示“主/神”，因此全称可理解为“半女之主”。","在艺术与宗教语境中，这一形象常以“左右对半”的方式表现：一侧具湿婆的装饰与象征物，另一侧具帕尔瓦蒂/女神的装束，用来表达二元合一、互补与整体性。","英语里拼写常见变体包括 Ardhanari, Ardhanaree, Ardhanarishvara；学术或博物馆说明中更常见 Ardhanarishvara。"]}
{"word":"ardhanari","summary":{"en":"Ardhanari refers to the half-male, half-female unified form of Shiva and Shakti (often Shiva and Parvati).","zh":"Ardhanari 指湿婆与夏克蒂（常说湿婆与雪山神女）合一的“半男半女”形态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Hinduism) a form or idea of Shiva and Shakti as one being that is half male and half female; a shortened name for Ardhanarishvara.","zh":"（印度教）“半男半女”的神祇形象或观念，指湿婆与雪山神女（或作为夏克蒂能量）合一的形态；常作为 Ardhanarishvara（阿尔达那利什瓦拉）的简称。"},"examples":[{"en":"The sculpture shows Ardhanari, with Shiva on one side and Parvati on the other.","zh":"这尊雕塑呈现“半男半女”的阿尔达那利：一侧是湿婆，另一侧是雪山神女。"},{"en":"In the lecture, the professor used Ardhanari to discuss balance between masculine and feminine energies in Hindu art.","zh":"在讲座中，教授用“阿尔达那利”来讨论印度教艺术中阳性能量与阴性能量的平衡。"}]}],"synonyms":["Ardhanarishvara","Ardhanārīśvara","the half-male, half-female form of Shiva"],"phonetic":"/ɑrdhəˈnɑri/","extraExplanation":["“Ardhanari”来自梵语，常见全称是“Ardhanarishvara”（意为“半为女性的主/神”）。在图像与雕塑中，通常一半呈现湿婆的特征（如简朴、男性装饰），另一半呈现帕尔瓦蒂/夏克蒂的特征（如女性衣饰与珠宝），象征宇宙中相互依存、合一的两种力量。","在英语语境里，这个词多用于宗教研究、艺术史与文化讨论；使用时尊重其宗教意义，避免把它简单等同于现代性别标签。"]}
{"word":"Ardhanarishvara","summary":{"en":"Ardhanarishvara is a Hindu image of Shiva as half man and half woman, symbolizing the unity of Shiva and Parvati and the balance of masculine and feminine energies.","zh":"Ardhanarishvara（阿尔达纳利什瓦拉）是印度教中“半男半女”的湿婆形象，象征湿婆与帕尔瓦蒂的合一，以及阴阳（男性/女性）能量的平衡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Hinduism) A form of the god Shiva shown as half male and half female, symbolizing the unity of masculine and feminine energies (Shiva and Parvati).","zh":"（印度教）“半男半女”的湿婆形象，象征男性与女性能量（湿婆与帕尔瓦蒂）的合一。"},"examples":[{"en":"The sculpture depicts Ardhanarishvara, with Shiva on one side and Parvati on the other.","zh":"这尊雕塑刻画的是阿尔达纳利什瓦拉，一侧为湿婆，另一侧为帕尔瓦蒂。"},{"en":"In some Hindu traditions, Ardhanarishvara represents balance rather than opposition between genders.","zh":"在一些印度教传统中，阿尔达纳利什瓦拉象征的是性别之间的平衡，而非对立。"}]}],"synonyms":["Ardhanari","Ardhanarishwar","half-male half-female form of Shiva"],"phonetic":"/ˌɑr.də.nɑːˈrɪʃ.və.rə/","extraExplanation":["这是一个源自梵语的专名（常见拼写：Ardhanārīśvara），常见于印度教艺术与神话中：身体左右（或前后）分为男/女两部分，用来表达“二元合一”的观念。","在艺术表现上，男性一侧常配有湿婆的特征（如三叉戟意象、男性装饰），女性一侧则呈现帕尔瓦蒂的特征（如女性饰品、服饰与姿态）；具体细节会因地区与时代而异。"]}
{"word":"Ardi-ea","summary":{"en":"Ardea most commonly refers to a genus of herons/egrets; it can also be a town name in Italy.","zh":"Ardea 最常指“苍鹭属”（鹭/白鹭等的一类）；也可作意大利城镇名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) a genus of large herons and egrets (long-legged water birds).","zh":"（生物）苍鹭属：一类体型较大的鹭和白鹭等长腿涉水鸟的属名。"},"examples":[{"en":"The great blue heron belongs to the genus Ardea.","zh":"大蓝鹭属于苍鹭属（Ardea）。"},{"en":"Several Ardea species hunt fish in shallow wetlands.","zh":"一些苍鹭属的物种会在浅水湿地捕鱼。"}]},{"partOfSpeech":"other","definition":{"en":"A place name, especially Ardea, a town in Italy (near Rome).","zh":"地名：Ardea，意大利的一座城镇（靠近罗马）。"},"examples":[{"en":"They visited Ardea during a trip to the Lazio region.","zh":"他们在拉齐奥大区旅行时去了阿尔代亚（Ardea）。"}]}],"synonyms":["heron","egret"],"phonetic":"/ˈɑrdiə/","extraExplanation":["“Ardea”来自拉丁语，意思与“鹭（heron）”相关，因此常被用作鹭类的属名。","你写的“Ardi-ea”很像英语里把 Ardea 按音节读出来的拼法（AR-dee-uh）。如果你其实想查的是“Ardi”（著名古人类化石昵称）或别的词，也可以告诉我上下文，我可以再帮你对照。"]}
{"word":"Ardie","summary":{"en":"Ardie is mainly used as a personal name (often a nickname) and sometimes as a surname.","zh":"Ardie 主要用作人名（常为昵称/简称），有时也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A given name (first name) used for any gender, often as a nickname for longer names such as Arden, Ardith, or names beginning with “Ard-”.","zh":"一个人名（名字），可用于任何性别；常作为较长名字的昵称/简称，例如 Arden、Ardith，或以“Ard-”开头的名字。"},"examples":[{"en":"Ardie is short for Arden in this family.","zh":"在这个家庭里，Ardie 是 Arden 的简称。"},{"en":"My friend Ardie moved to Chicago last year.","zh":"我的朋友 Ardie 去年搬到了芝加哥。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname (family name).","zh":"一个姓氏（家族姓）。"},"examples":[{"en":"Ms. Ardie will lead the meeting today.","zh":"Ardie 女士今天将主持会议。"}]}],"synonyms":["Arden (related name)","Ardith (related name)"],"phonetic":"/ˈɑrdi/","extraExplanation":["“Ardie”多见于英语语境中的昵称形式，拼写和读音相对固定，但它本身通常不带明确词义（不像普通词汇那样有“字面意思”）。","在流行文化与体育领域也可能遇到这个名字，例如新西兰橄榄球运动员 Ardie Savea；这类专名的含义主要来自人物本身与使用场景。"]}
{"word":"ardilla","summary":{"en":"“Ardilla” is Spanish for “squirrel.” In English, the usual word is “squirrel.”","zh":"“Ardilla”是西班牙语，意思是“松鼠”；英语常用词是“squirrel”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a squirrel (a small animal with a long tail that lives in trees)","zh":"松鼠（有长尾巴、常住在树上的小动物）"},"examples":[{"en":"In Spanish, “ardilla” means “squirrel.”","zh":"在西班牙语里，“ardilla”意思是“松鼠”。"},{"en":"We saw an ardilla running up the tree in the park.","zh":"我们在公园里看到一只ardilla（松鼠）爬上了树。"}]}],"synonyms":["squirrel","(Spanish) esquilo"],"phonetic":"/ˈɑɹ.dij.jɑ/","extraExplanation":["“Ardilla”是西班牙语名词，不是英语单词。英语里对应的常用词是 “squirrel”。","在不同地区的西班牙语里也会用其他词指“松鼠”，例如部分拉美地区会见到 “esquilo”（较偏正式或地区用法）。"]}
{"word":"Ardin","summary":{"en":"“Ardin” is most commonly used as a personal name (and sometimes a surname), not a standard English vocabulary word with a fixed meaning.","zh":"“Ardin”最常见是人名（有时作姓氏），并非一个在英语中具有固定词义的常规词汇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (usually a masculine name), used for people; sometimes also used as a surname.","zh":"人名（多为男性名），用于称呼个人；有时也可作姓氏。"},"examples":[{"en":"Ardin moved to Chicago for work.","zh":"Ardin 为了工作搬到了芝加哥。"},{"en":"I met someone named Ardin at the conference.","zh":"我在会议上认识了一个叫 Ardin 的人。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a place name in some regions; the exact meaning depends on the local language and location.","zh":"（较少见）某些地区的地名；具体含义取决于当地语言与地点。"},"examples":[{"en":"They searched for Ardin on the map but found multiple results.","zh":"他们在地图上搜索 Ardin，但发现了多个结果。"}]}],"synonyms":["(no direct synonyms; it’s a proper name)"],"phonetic":"/ˈɑrdɪn/","extraExplanation":["“Ardin”更常见为专有名词（名字/姓氏），通常不像普通词汇那样有固定词义与用法；在不同文化与语言中可能是不同名字的变体或音译。","如果你原本想查的是相近拼写的普通词（如 ardent, Arden, Ardin’s 等），告诉我你看到它的句子/语境，我可以帮你确认最可能的词与意思。"]}
{"word":"Ardine","summary":{"en":"Ardine is an uncommon given name or surname.","zh":"Ardine 是一个不太常见的名字或姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a personal name (given name), uncommon in English-speaking countries","zh":"人名（名字），在英语国家中较少见"},"examples":[{"en":"Ardine is my grandmother’s name.","zh":"Ardine 是我祖母的名字。"},{"en":"We met Ardine at a community event.","zh":"我们在一次社区活动上认识了 Ardine。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname)","zh":"姓氏（家族名）"},"examples":[{"en":"Ms. Ardine will lead today’s meeting.","zh":"Ardine 女士将主持今天的会议。"},{"en":"The book was written by Jordan Ardine.","zh":"这本书由 Jordan Ardine 撰写。"}]}],"synonyms":["Ardeen","Ardine (variant spellings)"],"phonetic":"/ɑrˈdiːn/","extraExplanation":["“Ardine”更常见于姓名而不是普通词汇，因此通常不翻译含义，而是按读音音译或直接保留拼写。","它在不同家庭/地区可能有不同来源；有时会被视为其他相近拼写名字（如 Ardeen、Ardine 等）的变体。若你是想查某位人物或地名的“Ardine”，可以告诉我上下文（国家/领域/句子），我能更精准说明。"]}
{"word":"Ardis","summary":{"en":"Ardis is mainly used as a personal name; it is also famous as the fictional estate in Nabokov’s Ada, or Ardor.","zh":"Ardis 主要用作人名；同时也因纳博科夫《Ada, or Ardor》中虚构庄园的名称而知名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a personal name (usually a feminine given name) and sometimes a surname","zh":"人名（多为女性名字），有时也作姓氏"},"examples":[{"en":"Ardis joined our book club last month.","zh":"Ardis 上个月加入了我们的读书会。"},{"en":"My great-aunt was named Ardis.","zh":"我曾祖姑妈名叫 Ardis。"}]},{"partOfSpeech":"n.","definition":{"en":"the name of a fictional estate in Vladimir Nabokov’s novel Ada, or Ardor: A Family Chronicle","zh":"弗拉基米尔·纳博科夫小说《Ada, or Ardor》（《阿达，或热情》）中一处虚构庄园的名字"},"examples":[{"en":"In Nabokov’s Ada, Ardis is the country estate where much of the story unfolds.","zh":"在纳博科夫的《Ada》中，Ardis 是故事大量情节展开的乡间庄园。"}]}],"phonetic":"/ˈɑrdɪs/","extraExplanation":["“Ardis”在现实中常见于英语姓名系统（名字或姓氏），但它在文学语境里尤其容易让人联想到纳博科夫的《Ada, or Ardor》。在这部作品中，“Ardis”既像一个地名，也带有“庄园/故园”的情感色彩，因此在讨论文学时常被当作一个具有象征意味的专有名词来使用。"]}
{"word":"ardish","summary":{"en":"“Ardish” is an uncommon, informal form meaning “somewhat hard.”","zh":"“ardish”是不常见的非正式写法，意思是“有点硬、比较硬”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Informal, nonstandard) Somewhat hard; rather hard.","zh":"（非正式、非标准用法）有点硬的；比较硬的。"},"examples":[{"en":"The cookie is ardish on the outside but soft inside.","zh":"这块饼干外面有点硬，但里面很软。"},{"en":"This mattress feels ardish for my back.","zh":"这张床垫对我的背来说感觉有点硬。"}]}],"synonyms":["kind of hard","a bit hard","rather hard","hardish"],"phonetic":"/ˈɑrdɪʃ/","extraExplanation":["“ardish”不是常见的标准英语词，很多情况下是把“hard-ish（有点硬）”连写、口语化写法，或是拼写错误。更自然的表达通常是“kind of hard / a bit hard / rather hard”。","英语后缀“-ish”常用来表示“有点……、差不多……（not exactly, somewhat）”，如：greenish（微绿的）、tallish（有点高）。如果你想表达“有点硬”，更建议写成“hardish”（虽然也偏口语）或直接用短语表达。"]}
{"word":"Ardisia","summary":{"en":"Ardisia: a genus of evergreen ornamental shrubs/small trees, often noted for glossy leaves and bright berries.","zh":"Ardisia：紫金牛属常绿观赏灌木/小乔木，常以油亮叶片与鲜艳果实著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of evergreen shrubs and small trees (family Primulaceae) found mainly in tropical and subtropical regions, often grown as ornamentals with glossy leaves and bright berries (for example, coralberry).","zh":"紫金牛属（报春花科）的一类常绿灌木或小乔木，主要分布在热带与亚热带地区；部分种类因叶片油亮、果实鲜艳（如珊瑚樱/圣诞红果）而作为观赏植物栽培。"},"examples":[{"en":"Ardisia crenata is a popular houseplant because its red berries can last for months.","zh":"珊瑚樱（Ardisia crenata）很受欢迎，因为它的红色果实能维持好几个月。"},{"en":"In the garden, ardisia prefers shade and moist, well-drained soil.","zh":"在花园里，紫金牛属植物更喜欢阴凉、湿润且排水良好的土壤。"}]}],"synonyms":["coralberry (common name for some species)","Christmas berry (common name for Ardisia crenata)"],"phonetic":"/ɑrˈdɪziə/","extraExplanation":["“Ardisia”是植物学中的拉丁化属名，常见于园艺与植物科普文章中；日常英语里更常用具体物种名或俗名（如 coralberry / Christmas berry）。","部分紫金牛属植物在一些地区可能具有入侵性，果实也可能对宠物或儿童不适宜误食；如果用于庭院种植，最好先查当地建议与安全信息。"]}
{"word":"ardisia","summary":{"en":"Ardisia is a group (genus) of evergreen plants, some of which are popular ornamentals with bright berries.","zh":"Ardisia 指紫金牛属的一类常绿植物，其中一些因结鲜艳浆果而常作观赏栽培。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of evergreen shrubs and small trees (family Primulaceae) found mainly in tropical and subtropical regions; some species are grown as ornamental houseplants for their glossy leaves and bright berries (e.g., coral ardisia).","zh":"紫金牛属植物（报春花科）的一类常绿灌木或小乔木，多分布于热带与亚热带地区；部分种类因叶片油亮、果实鲜红等而作为观赏植物栽培（如朱砂根/珊瑚紫金牛等）。"},"examples":[{"en":"Ardisia is often sold as a holiday plant because its red berries look festive.","zh":"紫金牛常被当作节日盆栽出售，因为它的红色浆果很喜庆。"},{"en":"In the greenhouse, the ardisia stayed green all winter.","zh":"在温室里，这株紫金牛整个冬天都保持常绿。"}]}],"synonyms":["coral ardisia","coralberry (in some contexts)","marlberry (for some species)"],"phonetic":"/ɑrˈdɪziə/","extraExplanation":["“Ardisia”常见于园艺与植物学语境；在英语里很多人会用具体种名或俗名来指代，比如 coral ardisia（通常指 Ardisia crenata）。","部分地区（如美国东南部）把 coral ardisia 视为入侵植物；其果实对宠物或野生动物可能有不良影响，家庭种植时应避免儿童或宠物误食。"]}
{"word":"Ardisiaceae","summary":{"en":"Ardisiaceae is a botanical family name for certain flowering plants, including Ardisia species.","zh":"Ardisiaceae 指植物分类中的“紫金牛科”，包含紫金牛属等若干开花植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of flowering plants (the primrose family group) that includes genera such as Ardisia; many are tropical shrubs or small trees.","zh":"（植物）紫金牛科：一类被子植物的科名，包含如紫金牛属（Ardisia）等属，多为热带灌木或小乔木。"},"examples":[{"en":"Ardisiaceae includes several ornamental plants grown for their glossy leaves and berries.","zh":"紫金牛科包含一些观赏植物，人们常因其有光亮叶片和浆果而栽培。"},{"en":"The researcher compared leaf structures across different genera in Ardisiaceae.","zh":"研究人员比较了紫金牛科不同属之间的叶片结构。"}]}],"synonyms":["the ardisia family","Myrsinaceae (older usage in some sources)"],"phonetic":"/ˌɑr.dɪ.siˈeɪ.si.i/","extraExplanation":["“Ardisiaceae”是植物分类学中的科名，常见于学术论文、植物百科与园艺资料中；日常英语里较少使用。","该科名来自代表属“Ardisia（紫金牛属）”。在较早的分类系统中，与“myrsine family（报春花类群中的旧称相关群）”等名称在文献里可能会出现；不同分类系统的界定可能略有差异。"]}
{"word":"ardisiaceae","summary":{"en":"Ardisiaceae is the botanical family name for plants related to Ardisia (the ardisia family).","zh":"Ardisiaceae 指紫金牛科，是与紫金牛属（Ardisia）相关的一类植物的科名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of flowering plants that includes the genus Ardisia; many are tropical shrubs or small trees (often called the ardisia family).","zh":"紫金牛科；一类开花植物的科，包含紫金牛属（Ardisia）等，许多为热带灌木或小乔木（常被称为“紫金牛科/紫金牛类植物”）。"},"examples":[{"en":"Ardisiaceae includes several ornamental plants grown for their glossy leaves and colorful berries.","zh":"紫金牛科包含一些观赏植物，人们因其光亮的叶子和鲜艳的浆果而栽培它们。"},{"en":"In a plant guide, the species was listed under the family Ardisiaceae.","zh":"在植物图鉴里，这个物种被归在紫金牛科（Ardisiaceae）之下。"}]}],"synonyms":["ardisia family"],"phonetic":"/ˌɑr.dɪ.ziˈeɪ.si.iː/","extraExplanation":["“Ardisiaceae”是植物分类学中的“科”名，来自属名“Ardisia（紫金牛属）”。科名常用于学术写作、标本标签、植物百科/植物志中，日常英语里较少出现。","传统分类系统中，紫金牛科常与报春花科（Primulaceae）等类群的界限与归并关系曾有变化；不同资料可能会看到它被并入更大的科中，取决于所采用的分类系统。"]}
{"word":"Ardisj","summary":{"en":"“Ardisj” isn’t a recognized English vocabulary word; it’s likely a name or a misspelling.","zh":"“Ardisj”不是常见英语词汇；更可能是人名/专名或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a misspelling, a username, or a proper name (e.g., a person/place/brand).","zh":"不是标准英语单词；更可能是拼写错误、用户名，或专有名词（如人名/地名/品牌名）。"},"examples":[{"en":"I can’t find “Ardisj” in major English dictionaries—could it be a name or a typo?","zh":"我在主要英语词典里找不到“Ardisj”——它会不会是人名或拼写错误？"},{"en":"If you meant “Ardis,” it can be used as a personal name.","zh":"如果你想写的是“Ardis”，它可以用作人名。"}]}],"phonetic":"/ɑrˈdɪsdʒ/","extraExplanation":["“Ardisj”看起来像是专有名词或键入时多/少了字母。你可以检查：\n1) 你想表达的语境（人名、地名、游戏ID、公司名？）\n2) 是否来自其他语言的转写（不同语言的拼写规则会让词形看起来“像英语但不是英语”）\n3) 可能的近似拼写：Ardis, Ardish, Ardijs, Ardis J（名字+首字母）\n如果你把它所在的句子发给我，我可以更准确判断它可能是什么。"]}
{"word":"Ardith","summary":{"en":"Ardith is a relatively uncommon female first name in English.","zh":"Ardith 是一个较少见的英文女性名字。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a female given name (first name), used mainly in English-speaking countries; it is relatively uncommon.","zh":"（女性）名字/名（英文常见但较少见）。"},"examples":[{"en":"Ardith moved to Chicago for her new job.","zh":"Ardith 为了新工作搬到了芝加哥。"},{"en":"Our teacher, Ms. Ardith Lee, is very patient.","zh":"我们的老师 Ardith Lee 女士很有耐心。"}]}],"synonyms":["Ardyth (variant spelling)","Ardith (as a given name)"],"phonetic":"ˈɑrdɪθ","extraExplanation":["“Ardith”通常被当作女性英文名使用，在美国较多见于20世纪早期的出生登记里，整体属于偏少见的名字。","词源在公开资料中并不完全一致：有人认为它与较古老的拼写变体“Ardyth”有关，也可能受到常见女性名（如 Judith、Edith 等）的拼写与读音影响。日常使用时可按名字本身来理解，不必强行对应固定含义。","常见昵称：Ardy / Ardie（口语里更亲切）。在正式场合可直接称呼 Ardith，或配合姓氏使用（如 Ms. Ardith Smith）。"]}
{"word":"arditi","summary":{"en":"Arditi refers mainly to Italy’s World War I elite assault troops; more rarely, it can mean “daring people.”","zh":"Arditi主要指一战时期意大利的精锐突击部队；较少情况下也可泛指“勇敢敢为的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) Italian elite assault troops in World War I; in English, often used to mean the unit or the soldiers collectively.","zh":"（历史）第一次世界大战时期意大利的精锐突击部队；英语中常指该部队或这些士兵（统称）。"},"examples":[{"en":"In World War I, the Arditi were trained for dangerous trench raids.","zh":"在一战中，Arditi 受训执行危险的战壕突袭任务。"},{"en":"The museum exhibit includes uniforms worn by Arditi soldiers.","zh":"博物馆展览中有 Arditi 士兵穿过的制服。"}]},{"partOfSpeech":"n.","definition":{"en":"People known for daring or bold action (rare; influenced by the Italian meaning “the daring ones”).","zh":"以大胆、敢为著称的人（较少见；受意大利语“勇敢者/敢死队”之意影响）。"},"examples":[{"en":"He spoke of the activists as modern arditi, willing to take risks for their cause.","zh":"他把这些行动者称作现代的 arditi，愿意为事业冒险。"}]}],"synonyms":["Italian assault troops","storm troops","commandos (approx.)","daring ones (rare)"],"phonetic":"ɑrˈdiːti","extraExplanation":["“Arditi”是意大利语复数，字面意思接近“勇敢的人/敢死队”。在英语资料里常直接借用作专有名词（可首字母大写 Arditi），指一战意大利军队中的突击部队；对应的单数形式是意大利语“ardito”，但英语里更常见“Arditi”作统称。","历史背景上，Arditi以近距离突击、手榴弹与短兵器作战而著名；战后这一名称也在意大利政治文化中留下痕迹，因此在某些语境里会带有强烈的历史与意识形态联想。"]}
{"word":"ardito","summary":{"en":"Ardito means “daring” or “bold,” mainly used as an Italian word in English contexts.","zh":"Ardito意为“大胆/勇敢”，多作为意大利语词在英语语境中使用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Italian) daring; bold; brave (often describing a person, plan, or style).","zh":"（意大利语）大胆的；勇敢的；无畏的（常形容人、计划或风格）。"},"examples":[{"en":"His ardito plan was risky, but it worked.","zh":"他那个大胆的计划很冒险，但成功了。"},{"en":"The designer is known for an ardito use of color.","zh":"这位设计师以大胆用色而闻名。"}]}],"synonyms":["daring","bold","brave","audacious","fearless"],"phonetic":"/ɑrˈdiːtoʊ/","extraExplanation":["“ardito”是意大利语形容词，来自拉丁语词根，常带有“大胆到有点冒险/前卫”的语感。在英语里它不算常用词，更多出现在艺术评论、时尚、音乐或谈到意大利文化的语境中。","历史上意大利语中也可作名词（Arditi）指一战时期意大利的突击队员；在英语资料中有时会以专有名词形式出现。"]}
{"word":"Ardme","summary":{"en":"Not a standard English word; likely a misspelling or a name. Share the sentence for an accurate match.","zh":"不是标准英语词；可能是拼写错误或名字。提供句子上下文才能准确判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“Ardme” is not a standard English word in common dictionaries. It is most likely a misspelling, a username/brand, or a proper name.","zh":"“Ardme” 不是常见英语词典里的标准单词，更可能是拼写错误、用户名/品牌名，或专有名词（名字）。"},"examples":[{"en":"I couldn’t find “Ardme” in the dictionary—could you share the sentence you saw it in?","zh":"我在词典里找不到 “Ardme”——你能把它出现的句子发我吗？"},{"en":"“Ardme” might be a name or a typo rather than a real English word.","zh":"“Ardme” 可能是名字或拼写错误，而不是真正的英语单词。"}]}],"phonetic":"/ˈɑrdmi/","extraExplanation":["你可以把包含 “Ardme” 的完整句子/上下文发我（或截图），我就能判断它到底是：①拼错了哪个词；②人名/地名；③品牌/用户名；④两个词连在一起（例如分词或连写）。","常见的“看起来像 Ardme”的可能目标包括：admire（钦佩）、armed（武装的/带着武器的）、ardent（热情的）、pardon me（对不起/劳驾）、readme/README（说明文件）。但需要上下文才能确定。"]}
{"word":"Ardmore","summary":{"en":"Ardmore is a proper name used mainly as a place name (and sometimes a whisky name).","zh":"Ardmore 主要是专有名词，多用作地名（有时也指威士忌相关名称）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a place name (proper noun), used for several towns and neighborhoods in English-speaking countries (especially in the U.S.), such as Ardmore, Pennsylvania and Ardmore, Oklahoma.","zh":"地名（专有名词）：英语国家中多个城镇或社区的名称，尤其在美国，如宾夕法尼亚州的 Ardmore 和俄克拉何马州的 Ardmore。"},"examples":[{"en":"She commutes to Philadelphia from Ardmore, Pennsylvania.","zh":"她从宾夕法尼亚州的 Ardmore 通勤去费城。"},{"en":"Our road trip stopped overnight in Ardmore, Oklahoma.","zh":"我们的公路旅行在俄克拉何马州的 Ardmore 过了一夜。"}]},{"partOfSpeech":"other","definition":{"en":"a Scottish whisky-related name, most commonly referring to The Ardmore Distillery (a Highland whisky distillery) or whisky labeled “Ardmore.”","zh":"与苏格兰威士忌相关的名称：常指 The Ardmore Distillery（高地区的威士忌酒厂）或标注为“Ardmore”的威士忌。"},"examples":[{"en":"He ordered a dram of Ardmore after dinner.","zh":"晚饭后他点了一小杯 Ardmore 威士忌。"},{"en":"The tour includes a visit to the Ardmore Distillery.","zh":"行程包括参观 Ardmore 酒厂。"}]}],"synonyms":["(as a place name) no direct synonym","(as whisky) The Ardmore Distillery"],"phonetic":"/ˈɑrdmɔr/","extraExplanation":["“Ardmore”常被认为源自盖尔语（爱尔兰/苏格兰盖尔语）地名元素：ard（高地/高处）+ mór（大），大意是“高大的高地/高处”。因此它常出现在地名中。","因为它是专有名词，拼写固定但读音在英语中通常一致；写作时一般首字母大写：Ardmore。"]}
{"word":"Ardmored","summary":{"en":"Ardmored is likely a misspelling of **armored** (“protected by armor”).","zh":"Ardmored 很可能是 **armored** 的拼写错误，意思是“有装甲的/受防护的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely a misspelling of) **armored**: protected by armor (a hard covering), especially for soldiers, vehicles, or animals.","zh":"（很可能是拼写错误，正确应为）**armored**：有装甲的；受盔甲/防护层保护的（尤指士兵、车辆或动物）。"},"examples":[{"en":"The soldiers rode in an armored vehicle.","zh":"士兵们乘坐装甲车。"},{"en":"The bank uses armored trucks to move cash.","zh":"银行用装甲运钞车运送现金。"},{"en":"Some medieval horses were armored for battle.","zh":"一些中世纪的战马为了作战会披上护甲。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense / past participle of **armor**: to cover or equip with armor; to protect strongly.","zh":"**armor** 的过去式/过去分词：给……穿上装甲/盔甲；使得到强力保护。"},"examples":[{"en":"The vehicle was armored to resist bullets.","zh":"这辆车加装了装甲以抵御子弹。"},{"en":"The doors were armored with steel plates.","zh":"门用钢板加固了防护。"}]}],"synonyms":["protected","shielded","reinforced","fortified"],"phonetic":"/ˈɑrmərd/","extraExplanation":["“Ardmored” 不是常见英文单词，更可能是把 **armored** 拼错了（多了一个 d）。","美式拼法是 **armored**，英式拼法常见 **armoured**。","如果你其实想写的是专有名词 **Ardmore**（地名/人名，如美国宾州或俄克拉荷马的 Ardmore），告诉我语境我可以按专有名词解释。"]}
{"word":"Ardoch","summary":{"en":"Ardoch is mainly a proper noun used as a place name (and sometimes a surname).","zh":"Ardoch 主要是专有名词，用作地名（有时也作姓氏）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A place name (proper noun), used for several locations—most commonly a village in Scotland (near Braco, Perthshire) and small communities in Canada and Australia.","zh":"地名（专有名词）：用于多个地点；最常见的是苏格兰珀斯郡（Perthshire）布拉科（Braco）附近的一个村庄，以及加拿大、澳大利亚的一些小社区。"},"examples":[{"en":"Ardoch is a small village in Perthshire, Scotland.","zh":"Ardoch 是苏格兰珀斯郡的一个小村庄。"},{"en":"She grew up near Ardoch in Ontario, Canada.","zh":"她在加拿大安大略省 Ardoch 附近长大。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname) in some English-speaking contexts.","zh":"（在一些英语语境中）姓氏。"},"examples":[{"en":"Dr. Ardoch will speak at the conference today.","zh":"Ardoch 医生今天将在会议上发言。"}]}],"phonetic":"ˈɑrˌdɑk","extraExplanation":["Ardoch 作为苏格兰地名，常被认为源自盖尔语元素：àrd（“高的、高地”）+ achadh（“田地、旷野/田野”），整体含义大致可理解为“高地上的田野/高田”。不同地区的 Ardoch 可能是移民时期沿用的原乡地名。"]}
{"word":"ardoise","summary":{"en":"Ardoise usually means slate (stone) or, from French usage, a chalkboard; it can also name a slate-gray color in design.","zh":"Ardoise 通常指“石板/板岩”；受法语影响也可指“黑板/写特餐的小黑板”；在设计中还可作“板岩灰”的颜色名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Slate (a fine-grained stone), especially used for roofing tiles or surfaces.","zh":"石板；板岩（细粒岩石），常用于屋顶瓦片或铺面。"},"examples":[{"en":"The old cottage roof was covered with ardoise tiles.","zh":"那座老小屋的屋顶铺着石板瓦。"},{"en":"They chose ardoise for the terrace because it’s durable and water-resistant.","zh":"他们选择用石板铺露台，因为它耐用又防水。"}]},{"partOfSpeech":"n.","definition":{"en":"(From French) A chalkboard or writing slate; sometimes the board listing a café’s daily specials.","zh":"（源自法语）黑板/写字板；有时也指咖啡馆写“今日特餐”的小黑板。"},"examples":[{"en":"The menu was written on an ardoise by the counter.","zh":"菜单写在柜台旁的一块小黑板上。"},{"en":"In some French cafés, the plat du jour is announced on the ardoise.","zh":"在一些法国咖啡馆里，“今日特餐”会写在小黑板上公布。"}]},{"partOfSpeech":"adj.","definition":{"en":"A slate-gray color used in fashion, interior design, or paint names.","zh":"板岩灰（时尚、室内设计或涂料中的一种灰色名称）。"},"examples":[{"en":"She picked an ardoise coat for a classic, understated look.","zh":"她选了一件板岩灰的大衣，风格经典又低调。"},{"en":"The walls are painted ardoise to make the room feel calm and modern.","zh":"墙面刷成板岩灰，让房间显得安静又现代。"}]}],"synonyms":["slate","slate tile","chalkboard","blackboard","slate-gray"],"phonetic":"/ɑrˈdwɑz/","extraExplanation":["“ardoise”是法语词，原意就是“石板/板岩”。英语里较少作为日常通用词，更常见于建筑材料、设计配色或带法式氛围的餐饮场景（写特餐的黑板）。","发音中“-oise”常读成类似“waz/waaz”的音（像 *noise* 的结尾），因此整体更接近“ar-DWAHZ”。"]}
{"word":"Ardolino","summary":{"en":"Ardolino is most commonly an Italian-origin surname used as a proper name.","zh":"Ardolino 最常见为意大利语背景的姓氏，用作专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname), most commonly of Italian origin; used as a last name for people, businesses, or places.","zh":"一个姓氏（家族姓），最常见于意大利语背景；可作为人的姓、公司名或地名的一部分。"},"examples":[{"en":"Ms. Ardolino will lead today’s meeting.","zh":"Ardolino 女士将主持今天的会议。"},{"en":"I saw the name Ardolino on the company directory.","zh":"我在公司通讯录上看到了 Ardolino 这个姓。"}]}],"phonetic":"/ˌɑr.dəˈliː.noʊ/","extraExplanation":["“Ardolino”通常被视为意大利姓氏。意大利姓氏常见后缀 -ino 有时带有“小/亲昵称呼”或家族分支的感觉（不一定每个姓都能直接拆出明确含义）。在英文语境里，它一般作为专有名词使用：首字母大写，不加冠词（不说 *the Ardolino*，除非特指“Ardolino 一家人”）。"]}
{"word":"ardor","summary":{"en":"Ardor means strong passion or intense enthusiasm.","zh":"Ardor 指强烈的激情或高度的热情。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Strong enthusiasm, passion, or excitement (often for a cause, activity, or person).","zh":"强烈的热情；激情；热忱（常用于对事业、活动或某人）。"},"examples":[{"en":"She spoke with ardor about protecting the environment.","zh":"她谈到保护环境时充满热忱。"},{"en":"His ardor for learning languages kept him practicing every day.","zh":"他对语言学习的热情让他每天都坚持练习。"},{"en":"The fans cheered with ardor as the team entered the field.","zh":"球队入场时，球迷们热情高涨地欢呼。"}]}],"synonyms":["passion","fervor","enthusiasm","zeal"],"phonetic":"/ˈɑrdɚ/","extraExplanation":["“ardor”常带有“炽热、燃烧般的热情”的感觉，语气比“interest（兴趣）”更强，也比一般的“enthusiasm（热情）”更富情感色彩。","常见搭配：ardor for（对……的热情）、with ardor（热情地）。","文学中常用来写“爱情的激情”或“理想/信念的热忱”，例如可说“the ardor of youth（青春的热血/热情）”。"]}
{"word":"ardors","summary":{"en":"“Ardors” means strong passions or intense enthusiasm (plural of “ardor”), often in formal or literary writing.","zh":"“ardors”是“ardor”的复数，指强烈的热情/激情，常见于较正式或文学语体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"strong enthusiasm, passion, or intense feeling (plural of “ardor”).","zh":"热情；激情；强烈的情感（“ardor”的复数）。"},"examples":[{"en":"Her ardors for music and languages shaped her career.","zh":"她对音乐和语言的热情塑造了她的职业道路。"},{"en":"The team’s ardors cooled after a long losing streak.","zh":"在一段漫长的连败后，球队的激情减退了。"}]},{"partOfSpeech":"n.","definition":{"en":"strong romantic or sexual passion (often used in a literary or formal style).","zh":"（常用于文学或较正式语体）炽热的爱情/欲望。"},"examples":[{"en":"In the novel, their secret ardors lead to trouble.","zh":"在小说里，他们隐秘的爱情最终引发了麻烦。"},{"en":"Poets sometimes write of youthful ardors that fade with time.","zh":"诗人有时会写到随时间消退的青春爱恋。"}]}],"synonyms":["passions","enthusiasms","zeal","fervor","intensity"],"phonetic":"/ˈɑɹ.dɚz/","extraExplanation":["“ardor”常见于较正式或文学语境，比常用的“passion / enthusiasm”更带有“炽热、燃烧般”的感觉。日常口语里通常说：enthusiasm for… / passion for…；在写作、演讲中用“ardor”会显得更典雅。","词源上与“燃烧、火热”的意象有关，因此常与情感（热情、爱恋、信念）搭配使用，比如：ardor for justice（对正义的热忱）。"]}
{"word":"ardour","summary":{"en":"Ardour means intense passion or enthusiasm; it can also mean romantic or sexual passion. (US spelling: ardor.)","zh":"Ardour 指强烈的热情或激情；也可指浪漫或性方面的激情。（美式拼写：ardor。）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"strong enthusiasm, passion, or intense feeling (often for a cause, activity, or person)","zh":"热情；激情；强烈的感情（常用于对事业、活动或某人的热爱）"},"examples":[{"en":"She spoke about education reform with real ardour.","zh":"她谈到教育改革时充满真挚的热情。"},{"en":"His ardour for music started when he was a child.","zh":"他对音乐的热爱从童年就开始了。"}]},{"partOfSpeech":"n.","definition":{"en":"sexual passion or romantic desire","zh":"情欲；爱欲（指强烈的浪漫或性方面的欲望）"},"examples":[{"en":"The novel describes their relationship with youthful ardour.","zh":"这部小说用青春的激情描写了他们的关系。"}]}],"synonyms":["passion","enthusiasm","fervor","zeal","intensity"],"phonetic":"/ˈɑɹ.dɚ/","extraExplanation":["“ardour”是英式拼写，美式通常写作“ardor”。两者意思相同，只是拼写习惯不同。","语体上较正式，常见于演讲、文学或较庄重的写作中。日常口语里更常用“passion”“enthusiasm”。","词源来自拉丁语与“燃烧”有关，因此常带有“炽热、燃起”的意象。"]}
{"word":"ardours","summary":{"en":"“Ardours” means strong passions or intense enthusiasm (plural, often poetic/formal).","zh":"“ardours”指强烈的热情/激情（复数形式，语气常较文学或正式）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of ardour/ardor: strong enthusiasm, passion, or intense feeling (often used in a slightly poetic or formal style).","zh":"ardour/ardor 的复数：强烈的热情、激情或炽烈的情感（常带一点诗意或较正式的语气）。"},"examples":[{"en":"In her letters, she wrote about her ardours for art and learning.","zh":"在她的书信里，她写到了自己对艺术与学习的热情。"},{"en":"Youthful ardours can fade, but good habits remain.","zh":"年轻时的热情可能会消退，但好习惯会留下。"}]}],"synonyms":["passions","enthusiasms","fervor","zeal","ardor"],"phonetic":"/ˈɑrdɚ/","extraExplanation":["“ardours”多见于较文学、较正式的语境，常用来强调“多种/反复出现的热情与冲动”。日常口语里更常说“passion(s)”或“enthusiasm”。","拼写提示：英式常写“ardour”，美式常写“ardor”；“ardours”是英式拼写的复数，对应美式复数是“ardors”。","文学色彩：在诗歌或浪漫主义作品里，“ardour(s)”常用来写爱情的炽热、理想主义的激情或年轻人的冲动。"]}
{"word":"ardously","summary":{"en":"“Arduously” means “with great effort; in a very difficult way.”","zh":"“Arduously”表示“费力地、艰苦地（以很困难的方式）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a difficult, strenuous, or effortful way; requiring a lot of hard work.","zh":"艰苦地；费力地；需要大量努力地。"},"examples":[{"en":"They worked arduously to finish the project on time.","zh":"他们艰苦地工作，按时完成了项目。"},{"en":"She trained arduously for months before the marathon.","zh":"她在马拉松前艰苦训练了好几个月。"}]}],"synonyms":["strenuously","laboriously","with great effort","assiduously"],"phonetic":"/ˈɑr.dʒu.əs.li/","extraExplanation":["你输入的 **ardously** 通常是 **arduously** 的拼写错误。正确拼写来自形容词 **arduous**（艰难的、费力的）。","**arduously** 常用于正式写作，强调“过程很辛苦、很吃力”，比 **hard** 更书面、更强调“艰难程度”。"]}
{"word":"Ardra","summary":{"en":"Ardra usually refers to a Vedic lunar mansion (nakshatra) linked to Betelgeuse/Orion and themes like storms and transformation; it can also be a personal name.","zh":"Ardra 通常指吠陀占星中的“阿尔德拉宿”（与参宿四/猎户座相关，常联想到风暴与转化），也可用作人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Hindu astrology) A lunar mansion (nakshatra) associated with the star Betelgeuse in the constellation Orion; traditionally linked with storms, strong emotions, renewal, and the deity Rudra.","zh":"（印度占星术）“阿尔德拉宿”（Ardra，月宿之一），与猎户座中的参宿四（Betelgeuse）相关；传统上象征风暴、强烈情感与更新，并与神祇“楼陀罗”（Rudra）相联系。"},"examples":[{"en":"In Vedic astrology, Ardra is often described as a stormy but transformative nakshatra.","zh":"在吠陀占星里，Ardra 常被描述为“风暴般但能带来转化”的月宿。"},{"en":"She said her Moon was in Ardra, so she tends to feel things intensely.","zh":"她说自己的月亮落在 Ardra，所以她常常情绪感受很强烈。"}]},{"partOfSpeech":"n.","definition":{"en":"A given name (often used in South Asia), sometimes chosen for its astrological or cultural associations.","zh":"人名（常见于南亚地区），有时因其占星或文化含义而被选用。"},"examples":[{"en":"Ardra is a popular name for girls in parts of India.","zh":"在印度的一些地区，Ardra 是一个较常见的女孩名字。"},{"en":"Ardra introduced herself and explained that her name comes from Sanskrit.","zh":"Ardra 做了自我介绍，并解释她的名字源自梵语。"}]}],"synonyms":["Ardra nakshatra","nakshatra","lunar mansion"],"phonetic":"/ˈɑːrdrə/","extraExplanation":["“Ardra”（आर्द्रा）在梵语里与“湿润、被雨淋湿”相关，因此在象征上常与降雨、风暴、净化与重生联系在一起。","在吠陀占星体系中，“nakshatra（月宿）”类似于把黄道划分为若干段来解读性格与人生主题；Ardra 是其中之一。不同流派对其性格描述可能略有差异，阅读时可留意具体传统/作者的框架。","与之相关的神祇常提到 Rudra（楼陀罗，后与湿婆 Shiva 的形象体系相连），因此有些解读会强调“破坏—更新”的主题。"]}
{"word":"Ardrey","summary":{"en":"Ardrey is mainly an English surname, best known from writer Robert Ardrey; it is rarely used as a given name.","zh":"Ardrey 主要是英文姓氏，最知名的相关人物是作家 Robert Ardrey；很少作为名字使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name), most notably borne by Robert Ardrey (1908–1980), an American writer and popularizer of ideas about human evolution and behavior","zh":"一个英文姓氏（家族姓），其中较知名的是美国作家、以通俗方式介绍人类演化与行为观点的罗伯特·阿德里（Robert Ardrey，1908–1980）"},"examples":[{"en":"Ardrey is a surname you might see in discussions of twentieth-century popular science writing.","zh":"Ardrey 是一个姓氏，你可能会在讨论二十世纪通俗科学写作时看到它。"},{"en":"Robert Ardrey wrote books that brought debates about human nature to a general audience.","zh":"罗伯特·阿德里写过一些书，把关于人性的争论带给更广泛的读者。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name in rare cases (used mainly as a family name; sometimes confused with the first name “Audrey”)","zh":"少见的人名用法（主要还是作为姓；有时会与名字“Audrey（奥黛丽）”混淆）"},"examples":[{"en":"I thought it said Audrey, but the form actually reads Ardrey.","zh":"我以为写的是 Audrey，但表格上实际写的是 Ardrey。"}]}],"phonetic":"/ˈɑrdri/","extraExplanation":["“Ardrey”常见于英语世界的姓氏系统里；如果你是在书名、作者名或学术引用里看到它，通常就是指人名（姓）。","较有影响力的同名人物 Robert Ardrey 以《African Genesis》《The Territorial Imperative》等作品被人提及；这些书在20世纪中期的英文大众文化中影响过关于“人类天性/攻击性”等话题的讨论。","拼写上容易与更常见的名字“Audrey（奥黛丽）”混淆；读写时可特别注意字母 r 的位置（Ardrey vs. Audrey）。"]}
{"word":"ardri","summary":{"en":"Ardri (from Irish ard rí) means “High King,” a title in Irish history and sometimes a modern name.","zh":"Ardri 源自爱尔兰语 ard rí，意为“高王/至高王”，是爱尔兰历史头衔，也可作为现代人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Irish history) a “High King”; a title for a ruler who claimed overlordship of Ireland (from Irish Gaelic ard rí, literally “high king”).","zh":"（爱尔兰历史）“至高王/高王”；指宣称对爱尔兰拥有最高宗主权的统治者头衔（源自爱尔兰盖尔语 ard rí，直译“高的国王”）。"},"examples":[{"en":"Some medieval texts describe a ruler as the Ard Rí of Ireland.","zh":"一些中世纪文献把某位统治者称为爱尔兰的“Ard Rí（高王）”。"},{"en":"The concept of an Ardri appears often in Irish legends and historical writing.","zh":"“Ardri（高王）”这一概念常见于爱尔兰传说与史书中。"}]},{"partOfSpeech":"n.","definition":{"en":"A given name or modern stylized spelling based on Ard Rí (“High King”).","zh":"源自 Ard Rí（高王）的名字/现代变体拼写，可用作人名。"},"examples":[{"en":"Ardri is sometimes used as a distinctive baby name inspired by Irish culture.","zh":"Ardri 有时被用作一个带有爱尔兰文化灵感的独特宝宝名字。"}]}],"synonyms":["High King","Ard Rí"],"phonetic":"/ˈɑrdri/","extraExplanation":["“Ard Rí”常被英语写作 Ardri/Ard Ri/Ard-Rí 等不同形式；在严谨的历史语境中更常见带空格或重音符号的写法（Ard Rí）。","历史上“高王”并不总等同于统一的中央君主，更像是一种在不同王国之上建立宗主权或声望的政治主张；文学与神话作品中也常把它塑造成更强的“全岛之王”。"]}
{"word":"ardrigh","summary":{"en":"Ardrigh means the High King of Ireland (a Gaelic title), often used in history or Irish-inspired fantasy.","zh":"Ardrigh 指“爱尔兰至高王/高王”（盖尔语头衔），常见于历史语境或爱尔兰风格的奇幻作品中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Irish historical title) the High King of Ireland; a ruler said to have authority (often more symbolic than absolute) over other kings in Ireland.","zh":"（爱尔兰历史头衔）“爱尔兰至高王/高王”；据说对爱尔兰其他诸王拥有最高权威（但往往更偏象征性而非绝对统治）。"},"examples":[{"en":"In medieval Irish tradition, an ardrigh could claim overlordship over many regional kings.","zh":"在中世纪爱尔兰传统中，ardrigh 可以宣称对许多地区国王拥有宗主权。"},{"en":"The novel uses the word ardrigh to give its kingdom an Irish mythic feel.","zh":"这部小说用 ardrigh 这个词来营造带有爱尔兰神话色彩的王国氛围。"}]}],"synonyms":["High King","Ard Rí","overking"],"phonetic":"/ˈɑrˌdriː/","extraExplanation":["“ardrigh”常见于英语对爱尔兰语 **Ard Rí / Ard-Rí** 的转写：**ard** 意为“高、至高”，**rí** 意为“王”。在学术或较规范的写法里常保留空格与重音符号（如 *Ard Rí*）。","历史上“高王”并不总是像统一君主那样直接统治全岛，更常体现为盟主地位、朝贡关系与政治声望；不同史料与传说对其权力范围描述不一。","在现代英语语境里，这个词也常被奇幻作品借用，用来快速营造“凯尔特/盖尔式”世界观氛围。"]}
{"word":"Ardsley","summary":{"en":"Ardsley is a proper name for several places, especially a village in New York State.","zh":"Ardsley 是多个地点的专有地名，尤常指纽约州的一个村庄。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A place name (proper noun). It most commonly refers to Ardsley, a village in Westchester County, New York, USA; it can also refer to places in England such as Ardsley (South Yorkshire).","zh":"地名（专有名词）。最常见指美国纽约州威彻斯特县的阿兹利（Ardsley）村；也可指英国如南约克郡的 Ardsley 等地。"},"examples":[{"en":"She grew up in Ardsley, New York, and commuted to Manhattan for work.","zh":"她在纽约州的 Ardsley 长大，上班通勤去曼哈顿。"},{"en":"Our flight lands at JFK, and then we’ll drive north to Ardsley.","zh":"我们会在肯尼迪机场降落，然后开车往北去 Ardsley。"},{"en":"He visited Ardsley in South Yorkshire while traveling in England.","zh":"他在英国旅行时去了南约克郡的 Ardsley。"}]}],"phonetic":"/ˈɑrdzli/","extraExplanation":["“Ardsley”是典型的英语地名用法，首字母大写；在写作中通常直接当作专有名词使用，不加冠词（不说 *the Ardsley*）。","在美国语境里，若不特别说明，较常指纽约州 Westchester County 的 Ardsley；在英国语境中则可能指 South Yorkshire 一带的 Ardsley，因此在正式写作或旅行信息中常会加上州/郡来避免歧义。"]}
{"word":"ardu","summary":{"en":"“ardu” is usually an informal tech shorthand for “Arduino” or Arduino-related content.","zh":"“ardu”通常是“Arduino”或 Arduino 相关内容的非正式技术缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal/technical) A shortened form used in computing to refer to Arduino (the open‑source electronics platform) or to Arduino-related files/projects (e.g., “ardu” folders, “ardu” code).","zh":"（非正式/技术用语）在计算领域中，用来指 Arduino（开源电子平台）或与 Arduino 相关的文件/项目的缩写写法（如“ardu”文件夹、“ardu”代码）。"},"examples":[{"en":"I saved the Arduino sketch in the “ardu” folder.","zh":"我把 Arduino 程序（sketch）存到“ardu”文件夹里了。"},{"en":"This repo has an “ardu” directory for the board code.","zh":"这个代码库有一个“ardu”目录，放的是开发板相关代码。"}]}],"synonyms":["Arduino (full form)"],"phonetic":"/ɑrˈdu/","extraExplanation":["“ardu”本身不是标准英语单词，更常见的是“Arduino”。在实际使用中，“ardu”多见于文件名、文件夹名、项目缩写或聊天中的简写。","如果你指的是“Arduino”，它通常读作 /ɑrˈdwiːnoʊ/（美式）。"]}
{"word":"arduinite","summary":{"en":"“Arduinite” is a rare informal word meaning an Arduino enthusiast; it may also appear as a nonstandard spelling in mineral-name contexts.","zh":"“Arduinite”是个少见的非正式词，常指 Arduino 爱好者；在矿物名称语境中也可能是非标准拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, rare) A person who uses, loves, or strongly supports Arduino (the open-source electronics platform); an Arduino enthusiast.","zh":"（非正式、少见）指热衷或常用 Arduino（开源电子平台）的人；Arduino 爱好者。"},"examples":[{"en":"At the maker fair, a few self-described arduinites were showing off their robot cars.","zh":"在创客展上，有几个自称“arduinite”的人展示了他们的机器人小车。"},{"en":"He’s an arduinite—he builds weekend projects with Arduino boards.","zh":"他是个“arduinite”——周末经常用 Arduino 板子做小项目。"}]},{"partOfSpeech":"n.","definition":{"en":"A very uncommon term sometimes seen as a misspelling or variant of a mineral name (often written “arduinoite” in mineral contexts).","zh":"一个非常少见的词，有时被当作某种矿物名称的误拼或变体（在矿物语境中更常见写法是“arduinoite”）。"},"examples":[{"en":"I saw “arduinite” in a forum post, but mineral catalogs usually list “arduinoite.”","zh":"我在论坛里看到有人写“arduinite”，但矿物名录通常写“arduinoite”。"}]}],"synonyms":["Arduino enthusiast","Arduino fan","maker","hobbyist"],"phonetic":"/ɑrˈdwiːnaɪt/","extraExplanation":["“-ite”在英语里常用于表示“某类人/支持者”（如 Jacobite）或“矿物”（如 calcite）。因此有人会用“Arduino + -ite”来开玩笑地指“Arduino 圈子的人”。","如果你是在矿物学语境里遇到这个词，建议核对原始来源或权威矿物数据库，因为“arduinite”并不是常见标准拼写。"]}
{"word":"Arduino","summary":{"en":"Arduino is an open-source electronics platform used to create projects with microcontroller boards and simple code.","zh":"Arduino 是一种开源电子平台，用微控制器开发板和简单代码来制作各种电子项目。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a popular open-source electronics platform (a microcontroller board plus software tools) used to build simple interactive projects by reading sensors and controlling devices like lights, motors, and displays.","zh":"一种很受欢迎的开源电子平台（微控制器开发板 + 软件工具），常用来做互动小项目：读取传感器并控制灯、马达、显示器等设备。"},"examples":[{"en":"I built a simple temperature alarm with an Arduino and a sensor.","zh":"我用 Arduino 和一个传感器做了一个简单的温度报警器。"},{"en":"Arduino is often used in schools because it’s easy for beginners to start with.","zh":"Arduino 常用于学校教学，因为新手很容易入门。"}]}],"synonyms":["microcontroller board","electronics prototyping platform"],"phonetic":"/ɑrˈdwiːnoʊ/","extraExplanation":["Arduino 最初在意大利诞生，后来发展成全球性的开源硬件/软件生态。常见的板子有 Arduino Uno、Nano、Mega 等。","在日常英语中，人们有时会用 “an Arduino” 泛指某块 Arduino 开发板；也会说 “the Arduino platform / Arduino IDE”。注意它是品牌名/专有名词，通常首字母大写。","相关词汇：microcontroller（微控制器）、sensor（传感器）、breadboard（面包板）、prototype（原型）、open-source（开源）、IDE（集成开发环境）。"]}
{"word":"arduous","summary":{"en":"Arduous means very difficult and requiring sustained effort.","zh":"Arduous 指“艰巨的、费力且需要持续努力的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Very difficult and requiring a lot of effort over time; hard and tiring.","zh":"非常困难、需要长时间付出大量努力的；艰巨而费力的。"},"examples":[{"en":"Training for a marathon is an arduous process.","zh":"为马拉松训练是一个艰苦的过程。"},{"en":"They made an arduous journey across the mountains.","zh":"他们翻山越岭，经历了一段艰难的旅程。"},{"en":"Writing the thesis was arduous, but she finished on time.","zh":"写论文很艰巨，但她还是按时完成了。"}]}],"synonyms":["difficult","demanding","strenuous","laborious","tough"],"phonetic":"/ˈɑr.dʒu.əs/","extraExplanation":["“arduous”常用来形容需要持续努力的任务或过程（如训练、研究、谈判、旅程），语气比“hard”更正式，也更强调“费力、耗时”。","词源来自拉丁语“arduus”，有“陡峭的、高耸的”之意，所以它常和“journey / climb / task / process”等词搭配，带有“像爬陡坡一样吃力”的画面感。"]}
{"word":"arduous journey","summary":{"en":"a very difficult, tiring trip or long process","zh":"非常艰难、费力且常常漫长的旅程或过程"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a trip or long process that is very difficult and tiring, often requiring great effort over time","zh":"艰难而漫长的旅程；（比喻）艰辛的过程，需要长期付出很大努力"},"examples":[{"en":"The climbers began an arduous journey across the ice field.","zh":"登山者开始了穿越冰原的艰难旅程。"},{"en":"Learning a new language can be an arduous journey, but it’s worth it.","zh":"学习一门新语言可能是一段艰辛的旅程，但很值得。"},{"en":"After surgery, recovery is often an arduous journey of small daily improvements.","zh":"手术后，康复往往是一段靠每天一点点进步支撑的艰辛历程。"}]}],"synonyms":["difficult journey","hard journey","tough journey","grueling trek","long hard road","uphill battle","trying process"],"phonetic":"/ˈɑɹdʒuəs ˈdʒɝni/","extraExplanation":["这是很常见的搭配（collocation）。在新闻、传记、演讲里常用来强调“过程很长、很累、很不容易”。也常用于比喻：an arduous journey to success（通往成功的艰辛历程）。"],"etymology":"“arduous”来自拉丁语 arduus，原意有“陡峭的、难以攀登的”，后来引申为“费力的、艰巨的”。“journey”来自古法语 jornee，原指“一天的路程/一天的行程”，逐渐泛指“旅程”。合在一起常用来形容“非常辛苦的旅途”，也常作比喻指“艰难的历程”。","mnemonic":["把 arduous 记成“阿（a）路（rdu）真难走”：路很难走→艰难。","联想“journey=旅行/历程”，arduous=艰苦的；合起来就是“苦旅/苦行之旅”。"]}
{"word":"arduously","summary":{"en":"“Arduously” means “with great effort; with difficulty,” often in formal writing.","zh":"“arduously”表示“费力地、艰难地”，较正式，强调付出很大努力。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that requires great effort, time, or patience; with difficulty.","zh":"费力地；艰难地（需要大量努力、时间或耐心）。"},"examples":[{"en":"They worked arduously to finish the project before the deadline.","zh":"他们费力地工作，想在截止日期前完成项目。"},{"en":"She trained arduously for months to run her first marathon.","zh":"她艰苦训练了好几个月，去跑人生第一个马拉松。"},{"en":"The team searched arduously through the ruins for survivors.","zh":"救援队在废墟中艰难地搜寻幸存者。"}]}],"synonyms":["strenuously","laboriously","with difficulty","painstakingly"],"phonetic":"/ˈɑr.dʒu.əs.li/","extraExplanation":["“arduously”来自形容词“arduous”（艰巨的、费力的），常用于正式或书面语，强调过程很辛苦、很耗精力，而不只是“有点难”。","语气上，“arduously”比“hard”更强、更正式：hard可以很口语；arduously常用于描述训练、研究、谈判、攀登等长期或高强度的努力。"]}
{"word":"arduousness","summary":{"en":"Arduousness means the quality of being very difficult and requiring great effort.","zh":"Arduousness 指“艰巨性/费力性”，强调事情非常困难且需要大量努力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being very difficult and requiring a lot of effort over time","zh":"艰巨性；费力性（指非常困难、需要长期付出大量努力的特质）"},"examples":[{"en":"Anyone who has tried to learn a new language understands the arduousness of daily practice.","zh":"任何学过一门新语言的人都明白每天练习的艰巨性。"},{"en":"The arduousness of the climb increased as the weather turned cold and windy.","zh":"随着天气变得寒冷多风，攀登的艰巨性更明显了。"},{"en":"She was prepared for the arduousness of caring for a sick family member.","zh":"她为照顾生病的家人所需的辛劳与艰巨做好了准备。"}]}],"synonyms":["difficulty","hardship","strenuousness","rigor","toughness"],"phonetic":"/ˈɑrdʒuəsnəs/","extraExplanation":["“arduousness”来自形容词“arduous”（艰巨的、费力的）加名词后缀“-ness”，表示“……的性质/状态”。在写作中它偏正式，日常口语更常用“difficulty / how hard it is”。","常见搭配：the arduousness of + 名词/动名词（例如：the arduousness of recovery 恢复过程的艰难；the arduousness of the journey 旅程的艰辛）。"]}
{"word":"arduousnesses","summary":{"en":"Arduousnesses means “instances or types of great difficulty and effort” (the plural of arduousness).","zh":"Arduousnesses 指“艰巨、费力的程度/情况”的复数形式（arduousness 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being very difficult and requiring a lot of effort (plural form)","zh":"艰巨；费力（“arduousness”的复数形式，指多个情境中的艰难程度）"},"examples":[{"en":"The report compares the arduousnesses of different training programs.","zh":"这份报告比较了不同训练项目的艰巨程度。"},{"en":"We underestimated the arduousnesses of moving, starting a new job, and learning a new system at the same time.","zh":"我们低估了同时搬家、入职新工作、学习新系统这几件事的艰难程度。"}]}],"synonyms":["difficulties","hardships","challenges","demands","rigors"],"phonetic":"/ˈɑɹdʒuəsnəsɪz/","extraExplanation":["“arduousnesses”是名词“arduousness”的复数，但在日常英语里不算常见；更多时候人们会用不可数的“arduousness”（艰巨性/费力程度）来概括，或改用更自然的表达，如：the difficulty of…, how demanding…, the challenges of…","词根提示：arduous（艰巨的、费力的）+ -ness（名词后缀，表示“……的性质/状态”）。当需要强调“不同任务各自的艰难程度”时，才可能用复数。"]}
{"word":"ardure","summary":{"en":"“Ardure” is usually a misspelling of “ardor/ardour,” meaning strong passion or enthusiasm; in older/literary use it can mean burning heat.","zh":"“ardure”通常是“ardor/ardour”的误拼，意思是强烈的热情/激情；在古义或文学语境中也可指灼热的热度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard spelling) likely meant “ardor” (US) / “ardour” (UK): strong enthusiasm, passion, or excitement for something.","zh":"（非标准拼写）多半是想写“ardor”（美式）/“ardour”（英式）：对某事强烈的热情、激情或兴奋。"},"examples":[{"en":"She spoke about teaching with real ardor.","zh":"她谈到教学时充满真挚的热情。"},{"en":"His ardor for music began when he was a child.","zh":"他对音乐的热爱从童年就开始了。"},{"en":"The fans cheered with ardor after the win.","zh":"赢球后，球迷们热情地欢呼。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literary/archaic) burning heat, especially the heat of the sun or fire.","zh":"（文学/古义）灼热；尤指太阳或火焰的热度。"},"examples":[{"en":"They rested in the shade to escape the ardor of the sun.","zh":"他们在阴凉处休息，以躲避太阳的灼热。"}]}],"synonyms":["passion","enthusiasm","zeal","fervor","eagerness"],"phonetic":"/ˈɑrdɚ/","extraExplanation":["“ardure”在现代英语中很少作为标准词使用，常见的是“ardor”（美式拼写）或“ardour”（英式拼写）。","词源来自拉丁语“ardor”，本义与“燃烧、热”相关，所以既可以引申为“热情”，也能在文学语境里表示“热度、灼热”。","相关词：ardent（adj. 热情的；炽热的）、ardently（adv. 热情地）。"]}
{"word":"ardurous","summary":{"en":"“Ardurous” is not standard; the correct word is “arduous,” meaning very difficult and requiring great effort.","zh":"“ardurous” 不是规范拼写；正确词是 “arduous”，表示“非常困难、需要很大努力的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Common misspelling) Usually meant to be “arduous”: very difficult and requiring a lot of effort and endurance.","zh":"（常见拼写错误）通常是想写 “arduous”：非常困难、需要大量努力与耐力的。"},"examples":[{"en":"Climbing the mountain was arduous, but the view was worth it.","zh":"爬那座山很艰苦，但风景很值得。"},{"en":"She completed the arduous task of cleaning the entire apartment in one day.","zh":"她在一天内完成了把整套公寓打扫干净这项艰巨任务。"}]}],"synonyms":["difficult","hard","tough","strenuous","demanding"],"phonetic":"/ˈɑr.dʒu.əs/","extraExplanation":["“ardurous” 不是标准英语拼写；标准形式是 “arduous”。词源来自拉丁语 *arduus*，有“陡峭、困难”的意思，所以常用来形容需要长期努力、很费劲的事。","常见搭配：an arduous journey（艰难的旅程）, arduous work（艰苦的工作）, an arduous process（艰难的过程）。"]}
{"word":"Ardussi","summary":{"en":"“Ardussi” is most commonly a surname (a proper name), likely Italian in origin.","zh":"“Ardussi”最常见的用法是姓氏（专有名词），可能源自意大利。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname), likely of Italian origin; used as a proper noun to refer to a person or family named Ardussi.","zh":"（专有名词）一个姓氏（家族名），可能源自意大利；用来指名为 Ardussi 的个人或家族。"},"examples":[{"en":"Dr. Ardussi will speak at the conference tomorrow.","zh":"Ardussi 医生将于明天在会议上发言。"},{"en":"I emailed Ms. Ardussi about the schedule change.","zh":"我给 Ardussi 女士发邮件说明了日程变更。"}]}],"synonyms":["(no true synonyms; it is a proper name)"],"phonetic":"/ɑrˈdusi/","extraExplanation":["“Ardussi”在英语里并不是常见的词汇，更常见的是作为人名/姓氏出现。若你是在某篇文章、电影字幕或作业里看到它，可能需要结合上下文确认它是人名、品牌名还是地名。","读音在现实中会因家庭/地区而略有不同；英语环境中通常会按拼写读成类似“ar-DOO-see”的感觉。若你能提供句子或来源（如书名/网址/截图），我可以更准确地解释。"]}
{"word":"arduus","summary":{"en":"Arduous means very difficult and requiring great effort; “arduus” is usually a misspelling or a Latin form.","zh":"Arduous 表示“艰巨费力的”；“arduus”通常是拼写错误或拉丁语形式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended: **arduous**) very difficult and requiring a lot of effort and time; hard to do.","zh":"（多半想查：**arduous**）艰巨的；费力费时的；很难完成的。"},"examples":[{"en":"Training for a marathon is arduous, but it can be rewarding.","zh":"为马拉松做训练很艰苦，但也可能很有收获。"},{"en":"They finished the arduous journey across the mountains.","zh":"他们完成了穿越群山的艰难旅程。"},{"en":"Writing a thesis is an arduous process for many students.","zh":"写论文对许多学生来说是一个艰巨的过程。"}]}],"synonyms":["difficult","demanding","strenuous","challenging","laborious"],"phonetic":"ˈɑrdʒuəs","extraExplanation":["“arduus”不是常见英语单词；英语里更常见的是 **arduous**。如果你在文章里看到“arduus”，可能是拼写错误，或是借用拉丁语词形。","**arduous**源自拉丁语 *arduus*，本义有“陡峭的、难攀的”，后来引申为“艰难费力的”。","常见搭配：**arduous task**（艰巨的任务）、**arduous journey**（艰难的旅程）、**arduous process**（艰难的过程）。近义词可用：**difficult, demanding, strenuous, challenging**。"]}
{"word":"Ardy","summary":{"en":"“Ardy” is most commonly a personal name; it can also mean “tough/brave” in informal British speech (often sarcastic).","zh":"“Ardy”最常见是人名；在非正式英式口语中也可表示“很硬气/很勇敢”（常带讽刺或挑衅语气）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a personal name or nickname (a given name), sometimes used as a short form of names like Arden or Arnold.","zh":"人名或昵称（名字）；有时可作为 Arden、Arnold 等名字的简称。"},"examples":[{"en":"Ardy is my classmate from Jakarta.","zh":"Ardy 是我来自雅加达的同学。"},{"en":"People call him Ardy for short.","zh":"大家简称他叫 Ardy。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal, chiefly British) tough or brave—often said in a challenging or slightly sarcastic way.","zh":"（非正式，主要英式）“很硬气/很勇敢”；常带挑衅或略带讽刺的语气。"},"examples":[{"en":"You think you're ardy, do you?","zh":"你觉得自己很硬气，是吗？"},{"en":"He acted ardy in front of his friends.","zh":"他在朋友面前装得很硬气。"}]}],"synonyms":["(name) —","tough","brave","bold","cocky"],"phonetic":"/ˈɑrdi/","extraExplanation":["“Ardy”作名字时含义取决于文化与家庭取名习惯，本身不一定有固定词义。不同国家/地区也可能把它当作其他名字的变体拼写。","英式口语里的 ardy 常被理解为把 h 省掉的 hardy（“强悍的”）的口语发音/拼写，用在对话里更常见，语气可能不太友好。"]}
{"word":"Ardyce","summary":{"en":"Ardyce is a rare female given name, most commonly found in the United States.","zh":"Ardyce 是一个较少见的女性名字，多见于美国。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A feminine given name (proper noun). It is rare and is most often seen in the U.S., sometimes as a variant spelling of **Ardis/Ardys**.","zh":"（专有名词）女性名字。较少见，多见于美国；有时被视为 **Ardis/Ardys** 的变体拼写。"},"examples":[{"en":"Ardyce moved to Chicago for her new job.","zh":"Ardyce 为了新工作搬到了芝加哥。"},{"en":"I met Ardyce at a community meeting.","zh":"我在一次社区会议上认识了 Ardyce。"}]}],"synonyms":["Ardis","Ardys"],"phonetic":"/ɑrˈdis/","extraExplanation":["“Ardyce”主要作为人名使用，不是常见英语词汇，所以通常不翻译“词义”，而是按发音音译或直接保留原拼写。","关于词源与含义：它常被认为与 Ardis/Ardys 有关，但公开资料对其明确来源与固定含义并不一致；在正式场合（证件、邮件抬头）建议以当事人指定拼写为准。","使用提示：称呼别人名字时，如果不确定读音，可以礼貌地问：\"How do you pronounce your name?\"（你的名字怎么读？）"]}
{"word":"Ardys","summary":{"en":"Ardys is most commonly used as a personal name (a variant of Ardis/Ardyce).","zh":"Ardys 最常见的是人名（常被视为 Ardis/Ardyce 的变体）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A personal name (given name), usually feminine; a variant spelling of Ardis/Ardyce used in English-speaking contexts.","zh":"人名（多为女性名）；在英语语境中常见作 Ardis/Ardyce 的变体拼写。"},"examples":[{"en":"Ardys moved to Seattle for a new job.","zh":"Ardys 为了新工作搬到了西雅图。"},{"en":"Please ask Ardys to call me back when she’s free.","zh":"请转告 Ardys 有空时回我电话。"}]}],"synonyms":["Ardis","Ardyce"],"phonetic":"/ˈɑrdɪs/","extraExplanation":["“Ardys”一般不作为常见英语词汇使用，而是作为专有名词（人名）。在正式写作中通常首字母大写：Ardys。","它常被视为“Ardis/Ardyce”的变体拼写；不同家庭可能有不同拼写习惯，因此在填写证件、邮件或名单时要按对方提供的拼写为准。","发音上常重读第一个音节；如果你是在特定地区或家庭中遇到这个名字，对方也可能有自己偏好的读法，最礼貌的方式是直接询问。"]}
{"word":"Ardyth","summary":{"en":"Ardyth is a rare feminine first name, sometimes a variant of “Ardith.”","zh":"Ardyth 是一个较少见的女性英文名，有时是“Ardith”的变体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare feminine given name (first name), sometimes used as a variant spelling of “Ardith.”","zh":"一个较少见的女性英文名（名字），有时被视为“Ardith”的变体拼写。"},"examples":[{"en":"Ardyth is my grandmother’s name, so we gave it to our daughter.","zh":"Ardyth 是我祖母的名字，所以我们把这个名字给了女儿。"},{"en":"Ardyth Johnson will speak at the meeting today.","zh":"Ardyth Johnson 今天会在会上发言。"}]}],"synonyms":["Ardith"],"phonetic":"/ˈɑr.dɪθ/","extraExplanation":["“Ardyth”主要作为人名使用，不是常见词汇，所以在阅读或听到时，通常把它理解为专有名词（某个人的名字）。","关于来源：它常被认为与“Ardith”有关，但该名字的准确词源在不同资料中说法不一；在不确定背景时，把它当作个人姓名来使用最安全。","发音在英语中可能因家庭或地区而略有差异；如果你是在称呼某位具体的人，最好尊重对方自我介绍时的读法。"]}

