{"word":"arh","summary":{"en":"“arh” is an informal exclamation (often a variant of “argh”) used to show frustration or anger.","zh":"“arh”是非正式的感叹词（常为“argh”的变体），用于表达懊恼或愤怒。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"an informal written exclamation showing anger, frustration, or annoyance (a common misspelling/short form of “argh”)","zh":"（书面/网络用语）表示愤怒、懊恼、抓狂的感叹词（常见于“argh”的简写或拼写变体）"},"examples":[{"en":"Arh, I missed the bus again!","zh":"Arh，我又错过公交了！"},{"en":"Arh! This password won’t work.","zh":"Arh！这个密码就是不对。"}]}],"synonyms":["argh","aargh","ugh","grr"],"phonetic":"/ɑr/","extraExplanation":["“arh”不是标准拼写，更常见的是“argh/aargh”，用来模仿人抓狂时发出的声音。写作或正式场合建议改用更标准的表达，比如：“Ugh!”（烦/恶心）、“Darn!”（倒霉）、“I’m so frustrated.”（我很沮丧）。"]}
{"word":"arhar","summary":{"en":"Arhar means pigeon pea, commonly used as toor/tur dal in South Asian cooking.","zh":"Arhar 指木豆，南亚烹饪中常见的 toor/tur dal。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"pigeon pea; a yellow split lentil/bean used in South Asian cooking (also called toor/tur dal).","zh":"（南亚常见的）木豆；常用于印度等地烹饪的黄色分裂豆类（也常叫 toor/tur dal）。"},"examples":[{"en":"I made dal with arhar and tomatoes.","zh":"我用 arhar（木豆）和番茄做了达尔豆汤。"},{"en":"Arhar dal is a staple ingredient in many Indian households.","zh":"Arhar dal 是许多印度家庭的常备食材。"}]}],"synonyms":["pigeon pea","toor dal","tur dal"],"phonetic":"/ɑrˈhɑr/","extraExplanation":["“Arhar”主要是印度英语/印地语等语境里的常用叫法；在英文食谱里你也会更常看到拼写为 “toor dal / tur dal”。它常被煮成浓汤（dal），也用于咖喱、炖菜。购买时可能遇到整粒（pigeon peas）或去皮分裂的“dal”形态。"]}
{"word":"Arhat","summary":{"en":"An arhat is a Buddhist person who has attained full enlightenment and is liberated from rebirth.","zh":"Arhat（阿罗汉）指佛教中已证得究竟觉悟、解脱轮回的圣者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Buddhism, a person who has achieved full enlightenment and is free from the cycle of rebirth (samsara); often translated as a “worthy one” or “saint.”","zh":"（佛教）阿罗汉：已证得彻底觉悟、断除烦恼并解脱生死轮回（轮回/samsara）的人；常译为“应供”“圣者”。"},"examples":[{"en":"In Theravada Buddhism, becoming an arhat is the goal of the path.","zh":"在上座部佛教中，成就阿罗汉是修行道路的目标。"},{"en":"The story describes a monk who practices for years and finally becomes an arhat.","zh":"故事描写一位僧人多年修行，最终证得阿罗汉果。"},{"en":"Many temples have statues of the arhat disciples of the Buddha.","zh":"许多寺庙里有佛陀阿罗汉弟子的塑像。"}]}],"synonyms":["arahant","saint (in Buddhist context)","enlightened disciple"],"phonetic":"/ˈɑr.hɑt/","extraExplanation":["“Arhat”来自梵语 arhat（巴利语常见写法为 arahant），在英语里也常见拼写变体“arahant”。","在不同佛教传统中侧重点不同：上座部更强调阿罗汉的解脱与断尽烦恼；大乘语境中常将“菩萨（bodhisattva）”理想与之对比，但并不等于否定阿罗汉。","文化语境中，“the Eighteen Arhats（十八罗汉）”在东亚艺术与寺庙中很常见，指被崇敬的一组罗汉形象（不同传统可能名单略有差异）。"]}
{"word":"arhat","summary":{"en":"An arhat is a Buddhist saint who has attained enlightenment and liberation.","zh":"arhat 指佛教中已证悟解脱的圣者（阿罗汉）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Buddhism, a person who has reached a very high spiritual level by overcoming desire and ignorance; someone who has attained enlightenment and will not be reborn.","zh":"（佛教）阿罗汉：通过断除贪欲与无明而达到高深修行境界的人；已证悟解脱、（传统上）不再轮回者。"},"examples":[{"en":"In Theravada Buddhism, becoming an arhat is the goal of the path.","zh":"在上座部佛教中，证得阿罗汉是修行道路的目标。"},{"en":"The temple’s artwork shows several arhats seated in meditation.","zh":"寺庙的壁画描绘了数位阿罗汉结跏趺坐、入定禅修。"}]}],"synonyms":["Buddhist saint","enlightened one (context-dependent)"],"phonetic":"/ˈɑːr.hɑːt/","extraExplanation":["“arhat”源自梵语/巴利语（常见音译为“阿罗汉”），意为“应供、值得供养的人”，在佛教语境中指已经断尽烦恼、证得解脱的圣者。","不同传统对“arhat/阿罗汉”的地位与侧重点会有差异：上座部强调阿罗汉果；大乘经典中更常以“菩萨道”作为理想路径，但“阿罗汉”仍是重要概念。","相关文化用法：中文里常见“罗汉”（如“十八罗汉”）多指阿罗汉的形象与传说，寺院塑像与绘画中很常见。"]}
{"word":"arhats","summary":{"en":"Arhats are enlightened Buddhist saints who have attained liberation from rebirth.","zh":"arhats 指佛教中已证悟并解脱轮回的圣者（阿罗汉），为 arhat 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Buddhism) Enlightened people who have reached a very high spiritual level and are freed from the cycle of rebirth (samsara); plural of arhat.","zh":"（佛教）已证得高深觉悟、解脱生死轮回（轮回/生死）的圣者；arhat 的复数。"},"examples":[{"en":"In early Buddhist texts, arhats are described as people who have destroyed greed, hatred, and ignorance.","zh":"在早期佛教经典中，阿罗汉被描述为已断除贪、嗔、痴的人。"},{"en":"Some traditions honor the Buddha and the arhats together during ceremonies.","zh":"一些传统会在仪式中同时礼敬佛陀与诸阿罗汉。"}]}],"synonyms":["enlightened ones","saints (in Buddhist context)","arahants"],"phonetic":"/ˈɑrˌhɑt/","extraExplanation":["“arhat”来自梵语/巴利语（常译为“阿罗汉”），在上座部佛教中通常指通过修行证得解脱的圣者；在大乘语境里有时会与“菩萨”的理想作对比（并非高下简单判断，而是修行目标侧重点不同）。","英语里更常见的拼写是 arhat；也会看到 arahant（更接近巴利语拼写）。复数常写 arhats。"]}
{"word":"Arhatship","summary":{"en":"Arhatship means the spiritual attainment or status of becoming an arhat in Buddhism.","zh":"Arhatship 指在佛教中证得阿罗汉果位的境界或成就。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being an arhat (a person who has reached a high level of spiritual liberation in Buddhism); the attainment of that status","zh":"阿罗汉果位；成为阿罗汉的境界（在佛教中指修行者达到高度解脱的成就）"},"examples":[{"en":"In Theravada Buddhism, arhatship is often described as the goal of the monastic path.","zh":"在上座部佛教中，阿罗汉果位常被描述为出家修行道路的目标。"},{"en":"The text explains the practices believed to lead to arhatship.","zh":"这部经典说明了被认为能导向阿罗汉果位的修行方法。"}]}],"synonyms":["arahantship","arhat-hood","the state of being an arhat"],"phonetic":"/ɑrˈhɑtʃɪp/","extraExplanation":["“Arhatship”来自“arhat/arahant”（阿罗汉）+ “-ship”（表示“状态、身份”的后缀，如 friendship 友谊）。","在不同佛教传统中，“阿罗汉”的地位与“菩萨”“佛陀”等概念的强调点可能不同：上座部较常以证得阿罗汉果为重要目标；大乘语境中也谈阿罗汉，但常更突出菩萨道与成佛。","常见拼写有 arhatship 与 arahantship（arahant 更接近巴利语形式）。在学术或宗教写作中多见，日常英语对话中较少使用。"]}
{"word":"arhatship","summary":{"en":"Arhatship means attaining the state of an arhat—liberation in Buddhism from suffering and rebirth.","zh":"Arhatship 指证得阿罗汉的果位，即在佛教中获得解脱、出离生死轮回的成就。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or attainment of being an arhat (arahant): a person in Buddhism who has reached liberation from the cycle of rebirth through deep insight and the ending of greed, hatred, and delusion.","zh":"阿罗汉果位；证得“阿罗汉”的境界：在佛教中指通过深刻的觉悟断除贪、嗔、痴，从而解脱轮回的成就。"},"examples":[{"en":"In Theravāda Buddhism, arhatship is often described as the goal of monastic practice.","zh":"在上座部佛教中，证得阿罗汉果常被描述为出家修行的目标。"},{"en":"The text explains the stages that lead a practitioner toward arhatship.","zh":"这部经典解释了修行者迈向阿罗汉果位的阶段。"},{"en":"She studied how different traditions interpret arhatship and enlightenment.","zh":"她研究不同传统如何理解阿罗汉果位与觉悟。"}]}],"synonyms":["arahantship","arhathood","the state of being an arhat"],"phonetic":"ˈɑr.hətˌʃɪp","extraExplanation":["“arhatship”来自“arhat/arahant（阿罗汉）+ -ship（表示状态或身份的后缀）”。英语中也常见拼写“arahantship”。","在许多语境里，阿罗汉被理解为“已解脱的圣者”，但与“佛（Buddha）”的内涵和地位并不完全相同；不同佛教传统对其意义与重要性也可能有不同强调。","该词多用于宗教学、佛学研究或严肃写作中，日常英语对话里较少出现。"]}
{"word":"Arhauaco","summary":{"en":"Arhuaco refers to an Indigenous people of northern Colombia (also called the Ika) and their language.","zh":"Arhuaco 指哥伦比亚北部的一支原住民族（亦称 Ika）以及他们的语言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an Indigenous people of northern Colombia (in the Sierra Nevada de Santa Marta), also known as the Ika.","zh":"哥伦比亚北部（圣玛尔塔内华达山脉）的一支原住民族成员；也常被称为 Ika（伊卡人）。"},"examples":[{"en":"The Arhuaco have lived for centuries in the Sierra Nevada de Santa Marta.","zh":"阿尔瓦科人（Arhuaco）数百年来一直居住在圣玛尔塔内华达山脉。"},{"en":"An Arhuaco community leader spoke about protecting sacred sites.","zh":"一位阿尔瓦科社区领袖谈到了保护神圣地点的重要性。"}]},{"partOfSpeech":"n.","definition":{"en":"the Chibchan language spoken by the Arhuaco people; also called Ika.","zh":"阿尔瓦科人使用的一种奇布查语系语言；也称 Ika 语。"},"examples":[{"en":"Some researchers document Arhuaco (Ika) to help preserve the language.","zh":"一些研究者记录阿尔瓦科语（Ika）以帮助保存这门语言。"}]}],"synonyms":["Ika","Arhuacos (plural)"],"phonetic":"/ɑrˈwɑːkoʊ/","extraExplanation":["“Arhuaco”在英语资料中更常见的拼写是 **Arhuaco**；你写的 **Arhauaco** 可能是拼写变体或误拼。若用于正式写作，建议查证当地或学术来源的标准拼法。","在跨文化语境中，称呼族群时尽量使用他们自称（如 **Ika**）或其偏好的拼写，并避免把“Arhuaco”当作泛指所有当地原住民的统称。"]}
{"word":"arhauaco","summary":{"en":"Arhauaco (more commonly Arhuaco) refers to the Arhuaco Indigenous people of northern Colombia, or something related to their culture/language.","zh":"Arhauaco（更常见拼作 Arhuaco）指哥伦比亚北部的阿尔瓦科原住民族，或与其文化/语言相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an Indigenous people living mainly in the Sierra Nevada de Santa Marta in northern Colombia (also spelled Arhuaco; plural Arhuacos).","zh":"（阿尔瓦科人）哥伦比亚北部圣玛尔塔山脉（Sierra Nevada de Santa Marta）地区的一个原住民民族成员（也常拼作 Arhuaco；复数 Arhuacos）。"},"examples":[{"en":"The museum hosted an exhibition of Arhuaco textiles and weaving traditions.","zh":"博物馆举办了阿尔瓦科纺织品与编织传统的展览。"},{"en":"An Arhuaco leader spoke about protecting the mountain ecosystem.","zh":"一位阿尔瓦科领袖谈到保护山地生态系统。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Arhuaco people, their language, or their culture.","zh":"与阿尔瓦科人、其语言或文化有关的。"},"examples":[{"en":"She is researching Arhuaco cultural practices and oral history.","zh":"她正在研究阿尔瓦科文化习俗与口述历史。"},{"en":"Arhuaco communities have long advocated for the protection of their ancestral lands.","zh":"阿尔瓦科社群长期倡导保护他们的祖传土地。"}]}],"synonyms":["Arhuaco","Arhuacos"],"phonetic":"/ɑrˈwɑːkoʊ/","extraExplanation":["“Arhauaco”常见为“Arhuaco”的拼写变体；在英文资料中更常用 Arhuaco/Arhuacos。","阿尔瓦科人常被视为与科吉（Kogi）、维瓦（Wiwa）等群体同属该地区的重要原住民文化圈；相关内容在英语中多出现在人类学、历史、环境保护与原住民权利语境里。","作为族名/专有名词，通常首字母大写：Arhuaco。","若你是在某篇文章里看到该词，欢迎贴出句子，我可以帮你判断它指“族群”还是“形容词用法”。"]}
{"word":"Arhna","summary":{"en":"“Arhna” is most commonly a rare personal name; it doesn’t have a fixed meaning in standard English.","zh":"“Arhna”多见于较少见的人名；在标准英语中没有固定词义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare personal name (proper noun). It is not a standard English vocabulary word, so its meaning depends on the language/culture or the person’s chosen spelling.","zh":"一个较少见的人名（专有名词）。它不是标准英语词汇，因此含义通常取决于所属语言/文化背景或个人的取名与拼写。"},"examples":[{"en":"Arhna is my classmate in biology.","zh":"Arhna 是我生物课的同学。"},{"en":"Please ask Arhna to email the file by Friday.","zh":"请让 Arhna 在周五前把文件发邮件过来。"}]}],"phonetic":"/ˈɑrnə/","extraExplanation":["“Arhna”在英语词典里通常查不到固定释义，更常见的是作为人名/昵称/笔名或品牌名出现。","如果你是在某个语境里看到它（比如一段文字、一个名字、社交媒体账号或一门语言的词），把上下文或来源语言发我，我可以更准确判断读音与含义。","英文里遇到陌生人名时，读音往往以本人习惯为准；你也可以礼貌地问：“How do you pronounce your name?”。"]}
{"word":"arhythmia","summary":{"en":"Arrhythmia means an irregular heartbeat.","zh":"Arrhythmia 指心律失常（心跳不规则）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an irregular heartbeat (the heart beats too fast, too slow, or unevenly)","zh":"心律失常；心跳不规则（可能过快、过慢或不均匀）"},"examples":[{"en":"The doctor diagnosed her with an arrhythmia after an ECG test.","zh":"医生在做完心电图检查后诊断她患有心律失常。"},{"en":"Some arrhythmias are harmless, but others need treatment.","zh":"有些心律失常并不严重，但也有一些需要治疗。"},{"en":"He felt his heart fluttering, which can be a sign of arrhythmia.","zh":"他感觉心脏“扑动”，这可能是心律失常的信号。"}]}],"synonyms":["irregular heartbeat","cardiac arrhythmia"],"phonetic":"/əˈrɪðmiə/","extraExplanation":["读音与拼写提示：arrhythmia 里有两个 r，且中间的 -rh- 来自希腊语词根，表示“节律/韵律（rhythm）”；前缀 a- 表示“无、缺少”，整体意思就是“缺少正常节律”。","医学语境常见搭配：cardiac arrhythmia（心律失常）；常见相关词有 atrial fibrillation / AFib（房颤）、palpitations（心悸/心跳感明显）、ECG/EKG（心电图）。日常交流中更常用 irregular heartbeat 来解释。"]}
{"word":"arhythmic","summary":{"en":"Arhythmic means “without a regular rhythm,” used in music/dance and in medicine for an irregular heartbeat.","zh":"arhythmic 指“无规律节奏的”，可用于音乐/舞蹈，也可指医学上的心跳节律不齐。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not having a regular rhythm; lacking a steady beat or pattern.","zh":"无规律节奏的；缺乏稳定节拍或模式的。"},"examples":[{"en":"The drummer played an arhythmic pattern that made the song feel unsettled.","zh":"鼓手打出无规律的节奏，让这首歌听起来不太稳定。"},{"en":"Some modern dance uses arhythmic movement to create surprise.","zh":"一些现代舞会用无规律的动作来制造惊喜感。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Having an irregular rhythm, especially an irregular heartbeat.","zh":"（医学）节律不齐的，尤指心律不齐的。"},"examples":[{"en":"The monitor showed an arhythmic heartbeat, so the nurse called the doctor.","zh":"监护仪显示心跳节律不齐，所以护士叫来了医生。"},{"en":"He went to the clinic after feeling his pulse become arhythmic.","zh":"他感觉脉搏变得不规律后就去诊所检查了。"}]}],"synonyms":["arrhythmic","irregular","unrhythmic","offbeat"],"phonetic":"/ˌæˈrɪðmɪk/","extraExplanation":["在医学语境中，更常见的说法是 arrhythmic（双 r）或 arrhythmia（心律失常）。arhythmic 这个拼写较少见，但含义通常相同。","词源上与 rhythm（节奏）有关：a- 表示“无/缺乏”，因此字面意思是“没有节奏/不成节奏”。"]}
{"word":"arhythmical","summary":{"en":"“Arrhythmical” means irregular in rhythm—without a steady beat or pattern.","zh":"“arrhythmical” 指“节奏不规则的”，缺乏稳定的节拍或规律。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Lacking a regular rhythm; not following a steady beat or pattern (in music, speech, movement, etc.).","zh":"不规则节奏的；无固定韵律的（用于音乐、语言、动作等）。"},"examples":[{"en":"The drummer played an arrhythmical pattern to create tension in the song.","zh":"鼓手演奏了不规则的节奏型，让歌曲更有紧张感。"},{"en":"His arrhythmical breathing made the doctor pay closer attention.","zh":"他不规则的呼吸让医生更加注意。"}]}],"synonyms":["irregular","rhythmless","offbeat","arrhythmic"],"phonetic":"/eɪˈrɪðmɪkəl/","extraExplanation":["更常见的拼写是 arrhythmic / arrhythmical；两者意思相近，但在医学语境中更常用 arrhythmic（如 arrhythmic heartbeat = 心律失常的心跳）。","词根提示：a-（否定）+ rhythm（节奏）。英语里 rhythm 的拼写里有 “thm”，发音时更像 /rɪðəm/，因此相关形容词常写成 rh- 开头。"]}
{"word":"arhythmically","summary":{"en":"Arrhythmically means “in an irregular rhythm,” in music/writing or (medically) with an irregular heartbeat.","zh":"arrhythmically 意为“以不规则的节奏”，可用于音乐/描写，也可（医学）指心跳不齐。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an irregular rhythm; not following a steady beat or pattern.","zh":"以不规则的节奏；不按稳定的拍子或模式。"},"examples":[{"en":"The drummer played arrhythmically to create a feeling of tension.","zh":"鼓手用不规则的节奏演奏，营造出紧张感。"},{"en":"Her footsteps echoed arrhythmically in the empty hallway.","zh":"她的脚步声在空荡的走廊里不规则地回响。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Medical) With an irregular heartbeat or pulse pattern.","zh":"（医学）以心跳或脉搏不齐的方式。"},"examples":[{"en":"The monitor showed that his heart was beating arrhythmically.","zh":"监护仪显示他的心跳不规律。"},{"en":"If your pulse feels arrhythmically for more than a few minutes, seek medical advice.","zh":"如果你的脉搏不规律持续几分钟以上，应寻求医疗建议。"}]}],"synonyms":["irregularly","unevenly","off-beat","out of rhythm"],"phonetic":"/əˈrɪðmɪkli/","extraExplanation":["拼写提示：常见拼法是 **arrhythmically**，来自 **rhythm**（节奏）与医学词根 **arrhythmia**（心律失常）。前面的 **a-** 在这里有“无/不”的含义，即“没有规律的节奏”。","用法提示：在音乐或写作中，arrhythmically 往往用来强调“刻意打破节拍”的效果；在医学语境中则更偏向客观描述心跳不齐。"]}
