{"word":"Arjan","summary":{"en":"Arjan is most commonly a male first name; it can also be a less common place name.","zh":"Arjan 最常见是男性名；也可（较少见）作地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a masculine given name used in several cultures (often Dutch or South Asian). In English contexts, it’s treated as a personal name.","zh":"男性名字，用于多种文化语境（常见于荷兰或南亚）。在英语里通常作为人名使用。"},"examples":[{"en":"Arjan is my classmate from Rotterdam.","zh":"Arjan 是我来自鹿特丹的同学。"},{"en":"Please ask Arjan to email the report by Friday.","zh":"请让 Arjan 在周五前把报告发邮件过来。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name, especially referring to historical or geographic locations in Iran (less common in everyday English).","zh":"地名，尤其可指伊朗的历史或地理相关地点（在日常英语中较少见）。"},"examples":[{"en":"The article mentioned the ancient site of Arjan in Iran.","zh":"那篇文章提到了伊朗的古代遗址 Arjan。"}]}],"synonyms":["Adrian","Arjun","Arjuna"],"phonetic":"/ˈɑrˌdʒən/","extraExplanation":["“Arjan”在不同文化里来源不一：\n- 荷兰语里很常见，常被认为与 Adrian/Adrianus（源自拉丁语 Hadrianus）有关。\n- 在南亚语境中也可见到该名，并常让人联想到发音相近的 “Arjun/Arjuna”。\n- 在锡克教文化中，“Guru Arjan（阿尔詹大师）”是第五位锡克教上师，因此这个名字也带有宗教与历史联想。"]}
{"word":"Arjay","summary":{"en":"Arjay is usually a name or nickname pronounced like “R.J.” (the initials).","zh":"Arjay通常是人名或昵称，读音相当于字母缩写“R.J.”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A given name or nickname, often a phonetic spelling of the initials “R.J.” (for example, “Robert James”).","zh":"人名或昵称，常见于把姓名首字母“R.J.”用读音拼出来的写法（例如“Robert James”的缩写）。"},"examples":[{"en":"Arjay introduced himself as “R.J.”, short for his first and middle names.","zh":"Arjay自我介绍说大家也叫他“R.J.”，这是他名和中间名首字母的简称。"},{"en":"Arjay is a popular nickname for someone with the initials R and J.","zh":"Arjay常用作首字母是R和J的人的昵称。"}]}],"synonyms":["RJ","R.J."],"phonetic":"/ˈɑrˌdʒeɪ/","extraExplanation":["“Arjay”属于非正式拼写：用字母名的读音来拼写（R = “ar”，J = “jay”）。因此它既可以是正式名字，也可以是昵称/网名。","在不同地区与家庭中，重音位置可能略有差异，但一般都按“R + J”的读法来念。"]}
{"word":"Arjun","summary":{"en":"Arjun is a common Indian male name; it can also refer to the epic hero Arjuna from the Mahabharata.","zh":"Arjun 是常见的印度男性名字；也可指《摩诃婆罗多》中的英雄人物阿周那（Arjuna）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name common in India (especially among people influenced by Hindu culture).","zh":"（男性名）“Arjun/阿琼”，在印度很常见的男性名字（尤其在受印度教文化影响的人群中）。"},"examples":[{"en":"Arjun moved to Chicago for graduate school.","zh":"阿琼为了读研究生搬到了芝加哥。"},{"en":"I met Arjun at a conference, and he works in software engineering.","zh":"我在一次会议上认识了阿琼，他从事软件工程。"}]},{"partOfSpeech":"n.","definition":{"en":"in Hindu epic tradition, Arjun (often spelled Arjuna) is a heroic warrior and one of the Pandava brothers in the Mahabharata.","zh":"（史诗人物）在印度教史诗传统中，Arjun（常拼作 Arjuna/阿周那）是《摩诃婆罗多》里的英雄战士、般度五兄弟之一。"},"examples":[{"en":"In the Mahabharata, Arjun is known for his skill in archery.","zh":"在《摩诃婆罗多》中，阿周那以精湛的箭术闻名。"},{"en":"The Bhagavad Gita is a dialogue between Krishna and Arjun on the battlefield.","zh":"《薄伽梵歌》是战场上克里希纳与阿周那之间的对话。"}]}],"synonyms":["Arjuna"],"phonetic":"/ˈɑrdʒən/","extraExplanation":["“Arjun”在英语里通常作为人名使用；在文学与宗教语境中更常见拼写是“Arjuna（阿周那）”。","文化提示：在印度语境中直呼名字很常见；如果不确定称呼方式，可以礼貌地问对方喜欢被怎么称呼。"]}
{"word":"arjun","summary":{"en":"Arjun is a common South Asian male name, often linked to Arjuna, the famous warrior-hero from the Mahabharata.","zh":"Arjun 是常见的南亚男性名字，常与《摩诃婆罗多》中的著名武士英雄阿周那（Arjuna）相关联。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A male given name (common in India and among people with South Asian heritage), often spelled as a variant of “Arjuna.”","zh":"男性名字（常见于印度及南亚族裔），常被视为“Arjuna（阿周那）”的另一种拼写。"},"examples":[{"en":"Arjun is starting a new job next week.","zh":"Arjun 下周要开始一份新工作。"},{"en":"I met Arjun at the library, and we studied together.","zh":"我在图书馆认识了 Arjun，我们一起学习。"}]},{"partOfSpeech":"n.","definition":{"en":"A reference to Arjuna, a major hero/warrior in the ancient Indian epic the Mahabharata (and an important figure in the Bhagavad Gita).","zh":"指印度古代史诗《摩诃婆罗多》中的重要英雄/武士阿周那（Arjuna），也是《薄伽梵歌》中的关键人物。"},"examples":[{"en":"In the story, Arjun(a) struggles with doubt before the battle.","zh":"在故事中，阿周那在战斗前经历了怀疑与挣扎。"},{"en":"The Bhagavad Gita is a dialogue between Krishna and Arjun(a).","zh":"《薄伽梵歌》是克里希纳与阿周那之间的对话。"}]}],"synonyms":["Arjuna"],"phonetic":"/ˈɑr.dʒʊn/","extraExplanation":["“Arjun/Arjuna”源自梵语，在南亚文化语境里常带有“勇士、英雄”的联想（因为阿周那是著名的史诗人物）。","英语里专有名词（人名）一般不翻译；在正式写作中，第一次出现可加注读音或背景（如：Arjun, a character from the Mahabharata）。"]}
{"word":"Arjuna","summary":{"en":"Arjuna is a famous hero-archer in the Mahabharata (and the listener in the Bhagavad Gita), and it is also a common Indian male given name.","zh":"Arjuna（阿周那）是《摩诃婆罗多》中的著名英雄神射手（也是《薄伽梵歌》的对话对象），同时也是常见的印度男性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A major hero in the Indian epic the Mahabharata; a master archer and one of the five Pandava brothers. In the Bhagavad Gita, he receives spiritual guidance from Krishna before a great battle.","zh":"印度史诗《摩诃婆罗多》中的重要英雄人物；神射手，般度五兄弟之一。在《薄伽梵歌》中，他在大战前接受克里希纳（Krishna）的精神教诲。"},"examples":[{"en":"In the Bhagavad Gita, Krishna teaches Arjuna about duty and selfless action.","zh":"在《薄伽梵歌》中，克里希纳教导阿周那（Arjuna）关于责任与无私的行动。"},{"en":"Arjuna is often described as the greatest archer among the Pandavas.","zh":"阿周那常被描写为般度兄弟中最出色的弓箭手。"}]},{"partOfSpeech":"n.","definition":{"en":"A male given name of Sanskrit origin, especially common in India and among the Indian diaspora.","zh":"一个源自梵语的男性名字，在印度及海外印度社群中很常见。"},"examples":[{"en":"Arjuna is a popular name for boys in many Indian families.","zh":"在许多印度家庭里，Arjuna 是一个很受欢迎的男孩名字。"},{"en":"My classmate Arjuna moved to the U.S. when he was ten.","zh":"我的同学 Arjuna 十岁时搬到了美国。"}]}],"synonyms":["Arjun","Pandava prince"],"phonetic":"ɑrˈdʒuːnə","extraExplanation":["“Arjuna/阿周那”主要出自印度史诗传统：他是“般度五兄弟”之一，与“俱卢之战”（Kurukshetra War）故事密切相关。《薄伽梵歌》常被视为印度哲学与宗教经典，其中的对话发生在阿周那对是否应参战产生道德困惑之时。","在英语语境里，Arjuna 通常被当作专有名词使用，首字母大写；也常作为人名出现。拼写变体有 Arjun（较常见的简写/变体）。"]}

