{"word":"Ark","summary":{"en":"Ark usually means Noah’s Ark (the biblical спасение boat) or a special chest/box, especially the Ark of the Covenant.","zh":"Ark 通常指《圣经》中的“诺亚方舟”，也可指（尤指约柜等）重要或神圣物品的箱柜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often capitalized) In the Bible, Noah’s Ark: a very large boat that saved Noah, his family, and animals from a great flood.","zh":"（常大写）《圣经》中的“诺亚方舟”：一艘巨大的船，据说在大洪水中拯救了诺亚一家和各种动物。"},"examples":[{"en":"The story of Noah’s Ark is known around the world.","zh":"诺亚方舟的故事在世界各地都很有名。"},{"en":"Many children’s books retell the tale of the Ark and the flood.","zh":"很多儿童读物会改写“方舟与洪水”的故事。"}]},{"partOfSpeech":"n.","definition":{"en":"A chest or box made to hold something important or valuable (especially the Ark of the Covenant in the Bible).","zh":"用来存放重要或贵重物品的箱子、柜子（尤指《圣经》中的“约柜”）。"},"examples":[{"en":"In the Old Testament, the Ark of the Covenant is described as a sacred chest.","zh":"在《旧约》中，约柜被描述为一只神圣的箱柜。"},{"en":"The museum displayed an ancient ark used to store religious items.","zh":"博物馆展出了一只古代的“圣柜”，用于存放宗教物品。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) Any place of protection or safety; a refuge.","zh":"（罕见）庇护处；避难所。"},"examples":[{"en":"For some, the library felt like an ark from the noise outside.","zh":"对一些人来说，图书馆像是远离外界喧嚣的避难所。"}]}],"synonyms":["Noah’s Ark","chest","box","coffer","refuge"],"phonetic":"/ɑrk/","extraExplanation":["“ark”来自拉丁语 arca，意思是“箱子、柜子”，所以它既可以指“方舟”（大船），也可以指“约柜”等“圣箱”。在英语文化里，Noah’s Ark 常被用来象征“在灾难中保存生命、重新开始”。","常见搭配：Noah’s Ark（诺亚方舟），the Ark of the Covenant（约柜）。在非宗教语境中，ark 偶尔会被比喻为“避风港/庇护所”，但这种用法比较文学化。"]}
{"word":"ark","summary":{"en":"An “ark” is usually a large boat in Bible stories (Noah’s Ark), or a sacred chest (the Ark of the Covenant); it can also mean a safe refuge in literary writing.","zh":"“ark”通常指《圣经》故事中的方舟（挪亚方舟），或圣柜（约柜）；在文学语境中也可指避难所。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large boat or ship, especially one mentioned in the Bible that saved people/animals from a great flood (Noah’s Ark)","zh":"（尤指《圣经》中）方舟；大船（如挪亚方舟，用来躲避洪水）"},"examples":[{"en":"In the Bible story, Noah built an ark to survive the flood.","zh":"在《圣经》故事里，挪亚建造方舟来躲避洪水。"},{"en":"The museum has a model of Noah’s Ark.","zh":"博物馆里有一个挪亚方舟的模型。"}]},{"partOfSpeech":"n.","definition":{"en":"a sacred box or chest, especially the Ark of the Covenant in the Bible","zh":"（尤指《圣经》中）约柜；圣柜（装载圣物的箱柜）"},"examples":[{"en":"The Ark of the Covenant is described as a holy chest.","zh":"《圣经》中把约柜描述为神圣的箱柜。"},{"en":"The story mentions priests carrying the ark.","zh":"故事里提到祭司抬着约柜。"}]},{"partOfSpeech":"n.","definition":{"en":"(literary) a place of safety or protection","zh":"（文学用法）避难所；庇护之地"},"examples":[{"en":"For her, the library was an ark in hard times.","zh":"对她来说，图书馆是在艰难时期的避难所。"}]}],"synonyms":["Noah’s Ark","the Ark of the Covenant","refuge","shelter","sanctuary"],"phonetic":"/ɑrk/","extraExplanation":["“ark”最常见的文化背景来自《圣经》：Noah’s Ark（挪亚方舟）讲的是洪水来临时，挪亚造船拯救家人和动物；Ark of the Covenant（约柜）是以色列人宗教传统中的圣物容器。","在日常英语里，如果不在宗教/故事语境中，“ark”并不常用；现代语境更常说“boat/ship”或“shelter/refuge”。"]}
{"word":"Arkab","summary":{"en":"Arkab is mainly a traditional astronomy name for two Sagittarius stars (Arkab Prior and Arkab Posterior); it can also be used as a personal name.","zh":"Arkab 主要是传统星名，指人马座的两颗恒星（Arkab Prior 与 Arkab Posterior）；它也可作人名使用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a traditional star name used in astronomy for two nearby stars in the constellation Sagittarius: Arkab Prior (β¹ Sagittarii) and Arkab Posterior (β² Sagittarii).","zh":"（天文学）“Arkab”是人们给人马座中两颗相邻恒星起的传统星名：Arkab Prior（人马座β¹）与 Arkab Posterior（人马座β²）。"},"examples":[{"en":"Arkab Prior and Arkab Posterior are two stars in Sagittarius that share the name Arkab.","zh":"Arkab Prior 和 Arkab Posterior 是人马座中两颗共用“Arkab”这一名称的恒星。"},{"en":"In some star catalogs, you may see Arkab listed alongside its Bayer designation, β Sagittarii.","zh":"在一些星表中，你可能会看到 Arkab 与它的拜耳命名（人马座β）一起出现。"}]},{"partOfSpeech":"n.","definition":{"en":"a personal name (usually a given name) found in some cultures; spelling and meaning vary by language and family tradition.","zh":"人名（多作名字使用）：在一些文化中可见，拼写与含义会随语言与家族习惯而变化。"},"examples":[{"en":"Arkab is used as a given name in some communities.","zh":"在某些社群中，Arkab 会被用作名字。"},{"en":"If Arkab is someone’s name, it’s best to ask how they prefer it pronounced.","zh":"如果 Arkab 是某人的名字，最好询问对方希望你如何发音。"}]}],"synonyms":["Arkab Prior","Arkab Posterior","β¹ Sagittarii","β² Sagittarii"],"phonetic":"ˈɑr.kæb","extraExplanation":["“Arkab”作为星名多见于传统星名体系，许多此类名称来源于阿拉伯语，经由中世纪/近代早期的天文学著作与星表进入欧洲语言。由于转写与流传路径不同，不同资料里可能出现拼写差异。","在现代天文学里，正式定位恒星常用“拜耳命名/弗兰斯蒂德编号”等标准标记（如 β¹/β² Sagittarii），而传统星名（如 Arkab）更多用于历史、文化与科普语境。"]}
{"word":"arkab","summary":{"en":"Arkab is mainly a traditional Arabic-derived star name used for two stars in Sagittarius; it can also appear as a personal name.","zh":"Arkab主要是源自阿拉伯语的传统恒星名，常指人马座的两颗星；在某些情况下也可作为人名出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional star name used for two stars in the constellation Sagittarius (Beta¹ Sagittarii and Beta² Sagittarii), often called Arkab Prior and Arkab Posterior.","zh":"一个传统恒星名称，用于人马座中的两颗星（人马座β¹与β²），常称为“Arkab Prior（前者）”与“Arkab Posterior（后者）”。"},"examples":[{"en":"In some star charts, Beta Sagittarii is labeled with the traditional name Arkab.","zh":"在一些星图中，人马座β星会标注为传统名称Arkab。"},{"en":"Arkab Prior and Arkab Posterior are two neighboring stars in Sagittarius.","zh":"Arkab Prior和Arkab Posterior是人马座中彼此相邻的两颗恒星。"}]},{"partOfSpeech":"n.","definition":{"en":"a name of Arabic origin that can also be used as a personal name in some contexts.","zh":"源自阿拉伯语的名称，在某些语境中也可用作人名。"},"examples":[{"en":"Arkab appears as a given name in some Arabic-language contexts.","zh":"在一些阿拉伯语语境中，Arkab会作为名字出现。"}]}],"synonyms":["Arkab Prior","Arkab Posterior","Beta Sagittarii"],"phonetic":"/ɑrˈkɑb/","extraExplanation":["“Arkab”常被认为来自阿拉伯语词源（常见解释与“脚跟/跟腱（hamstring, Achilles tendon）”相关）。许多传统恒星名都来自中世纪阿拉伯天文学，再通过拉丁文与欧洲星表流传到现代英语。","在英语里它更常见于天文学/观星语境；日常英语中并不是常用词。"]}
{"word":"Arkabutla","summary":{"en":"Arkabutla is a place name in Mississippi; it can refer to the town or to Arkabutla Lake (a nearby reservoir).","zh":"Arkabutla 是密西西比州的地名，可指当地小镇，也常指附近的 Arkabutla Lake（阿卡布特拉湖/水库）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small town in northern Mississippi, USA","zh":"美国密西西比州北部的一个小镇"},"examples":[{"en":"Arkabutla is a quiet community in northern Mississippi.","zh":"Arkabutla 是密西西比州北部一个安静的社区。"},{"en":"We drove through Arkabutla on the way to Memphis.","zh":"我们去孟菲斯的路上开车经过了 Arkabutla。"}]},{"partOfSpeech":"n.","definition":{"en":"Arkabutla Lake, a large reservoir near the town, popular for fishing and boating","zh":"Arkabutla Lake（阿卡布特拉湖），位于小镇附近的大型水库，以钓鱼和划船等活动闻名"},"examples":[{"en":"They went fishing at Arkabutla Lake over the weekend.","zh":"他们周末去阿卡布特拉湖钓鱼了。"},{"en":"Camping near Arkabutla Lake is common in summer.","zh":"夏天在阿卡布特拉湖附近露营很常见。"}]}],"phonetic":"/ˌɑr.kəˈbʌt.lə/","extraExplanation":["“Arkabutla”是专有名词（地名），在英文里通常首字母大写。口语中常直接说“Arkabutla”指小镇，也可能指周边地区；但更明确时会说“Arkabutla Lake”。","该地名常被认为与当地原住民语言（如乔克托语 Choctaw）有关；美国南部不少地名都保留了原住民语言的痕迹。"]}
{"word":"Arkadelphia","summary":{"en":"Arkadelphia is a city in Arkansas, USA.","zh":"Arkadelphia 是美国阿肯色州的一座城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in southwestern Arkansas, USA (in Clark County), known as a small college town.","zh":"美国阿肯色州西南部的一座城市（克拉克县），以“小型大学城”而闻名。"},"examples":[{"en":"Arkadelphia is home to two universities: Henderson State University and Ouachita Baptist University.","zh":"Arkadelphia 有两所大学：亨德森州立大学和瓦希塔浸信会大学。"},{"en":"We stopped in Arkadelphia on our drive through Arkansas.","zh":"我们开车穿过阿肯色州时在 Arkadelphia 停了一下。"}]}],"phonetic":"ˌɑrkəˈdeɪlfiə","extraExplanation":["Arkadelphia 是一个专有名词（地名），通常不翻译，直接音译或保留英文拼写。","名称来源常被解释为把“Arkansas（阿肯色）”的缩写 Ark- 与 “Philadelphia（费城）”或“Arcadia（阿卡迪亚，象征田园乐土）”等元素结合而成；属于较有地方特色的命名方式。"]}
{"word":"Arkansan","summary":{"en":"Arkansan means a person from Arkansas or something related to Arkansas.","zh":"Arkansan 指“阿肯色州人”或“阿肯色州的/与阿肯色州有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from the U.S. state of Arkansas","zh":"阿肯色州人（来自美国阿肯色州的人）"},"examples":[{"en":"She’s an Arkansan who grew up near Little Rock.","zh":"她是阿肯色州人，在小石城附近长大。"},{"en":"Many Arkansans enjoy hiking in the Ozarks.","zh":"许多阿肯色州人喜欢在欧扎克山区徒步。"}]},{"partOfSpeech":"adj.","definition":{"en":"from or related to the U.S. state of Arkansas","zh":"阿肯色州的；与阿肯色州有关的"},"examples":[{"en":"Arkansan culture includes strong traditions of country and folk music.","zh":"阿肯色州文化包含浓厚的乡村与民谣音乐传统。"},{"en":"They serve Arkansan dishes made with local ingredients.","zh":"他们提供用本地食材制作的阿肯色州风味菜肴。"}]}],"synonyms":["Arkansas resident","person from Arkansas","Arkansasian"],"phonetic":"/ɑrˈkænzən/","extraExplanation":["“Arkansan”是最常见、最标准的称呼，意思是“阿肯色州人/阿肯色州的”。也有人说“Arkansasian”，但在新闻、政府与日常使用中“Arkansan”更普遍、更自然。","发音提示：Arkansas 的末尾 “-sas”不读成 /sæs/，而更接近 “-saw”（类似“阿肯索”），所以 Arkansan 也按这个读音规律延伸。","文化与语境：在美国，这类“州名 + -an/-ian”的词常用来表达身份与归属（如 Texan, Californian）。在写作中，用它来描述人、地方文化、传统或产品都很常见。"]}
{"word":"arkansan","summary":{"en":"“Arkansan” means a person from Arkansas, or something related to Arkansas.","zh":"“Arkansan”指阿肯色州人，也可作形容词表示“阿肯色州的/与阿肯色州有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from the U.S. state of Arkansas","zh":"阿肯色州人（来自美国阿肯色州的人）"},"examples":[{"en":"She’s an Arkansan who grew up near the Ozark Mountains.","zh":"她是阿肯色州人，在奥扎克山区附近长大。"},{"en":"Many Arkansans enjoy outdoor activities like hiking and fishing.","zh":"很多阿肯色州人喜欢徒步、钓鱼等户外活动。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the U.S. state of Arkansas","zh":"阿肯色州的；与阿肯色州有关的"},"examples":[{"en":"He studies Arkansan history and local culture.","zh":"他研究阿肯色州的历史和当地文化。"},{"en":"Arkansan food traditions include barbecue and comfort foods.","zh":"阿肯色州的饮食传统包括烧烤和家常菜。"}]}],"synonyms":["Arkansas resident","person from Arkansas"],"phonetic":"/ɑrˈkænzən/","extraExplanation":["“Arkansan”常见于新闻、地理与身份认同的语境，类似于“Texan（德州人）”“Californian（加州人）”。","注意拼写与发音：州名 Arkansas 的结尾 -sas 不读 /sæs/，而是 /sɔ/，因此 Arkansan 读作 /ɑrˈkænzən/。","文化提示：阿肯色州常与奥扎克山区（Ozarks）、温泉城（Hot Springs）、以及密西西比河流域等地理与文化符号相关。"]}
{"word":"arkansans","summary":{"en":"Arkansans are people from or living in Arkansas, USA.","zh":"Arkansans 指来自或居住在美国阿肯色州的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who live in Arkansas or are from Arkansas (a state in the southern United States)","zh":"阿肯色州人；来自（或居住在）美国阿肯色州的人"},"examples":[{"en":"Many Arkansans enjoy fishing and boating on the state’s rivers and lakes.","zh":"许多阿肯色州人喜欢在本州的河流和湖泊里钓鱼、划船。"},{"en":"She’s an Arkansan who moved to Texas for work.","zh":"她是阿肯色州人，后来为了工作搬到了德克萨斯州。"},{"en":"Arkansans voted in the election last November.","zh":"阿肯色州人在去年11月参加了投票。"}]}],"synonyms":["people from Arkansas","residents of Arkansas","Arkansas residents"],"phonetic":"/ɑrˈkænzənz/","extraExplanation":["“Arkansas”的标准美式读音结尾不读 /s/，而更像“ARK-an-saw”（/ˈɑrkənˌsɔ/）。因此“Arkansans”的重音在第二个音节：/ɑrˈkænzənz/。","拼写上“Arkansas”和“Kansas”很像，但读音不同：Kansas 末尾读 /s/，Arkansas 通常不读 /s/。这是地名历史来源不同造成的（与法语拼写影响有关）。"]}
{"word":"Arkansas","summary":{"en":"Arkansas is a U.S. state (and also the name of a major river).","zh":"Arkansas 指美国的阿肯色州（也可指阿肯色河）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A state in the south-central United States; its capital and largest city is Little Rock.","zh":"美国中南部的一个州；首府及最大城市是小石城（Little Rock）。"},"examples":[{"en":"She moved to Arkansas for a new job.","zh":"她为了新工作搬到了阿肯色州。"},{"en":"Arkansas is known for its rivers, forests, and hot springs.","zh":"阿肯色州以河流、森林和温泉闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"A major river in the central United States that flows into the Mississippi River.","zh":"美国中部的一条大河，最终汇入密西西比河。"},"examples":[{"en":"They went fishing on the Arkansas River.","zh":"他们去阿肯色河钓鱼了。"}]}],"phonetic":"/ˈɑrkənsɔː/","extraExplanation":["发音提示：虽然拼写里有 “-sas”，但标准美式读音是 “AR-kan-saw”（/ˈɑrkənsɔː/），最后不读 /z/。常见对比是 Kansas（/ˈkænzəs/）末尾读 /z/。","词源背景：名称与当地原住民部族有关，早期经由法语拼写与英语习惯固定下来，因此出现了“拼写和读音不完全一致”的情况。","文化小知识：阿肯色州的昵称是 “The Natural State”（自然之州），常用于旅游宣传。"]}
{"word":"arkansas","summary":{"en":"Arkansas is a U.S. state in the south-central region; its capital is Little Rock.","zh":"Arkansas 是美国中南部的一个州，首府是小石城（Little Rock）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A state in the south-central United States, known for the Ozark and Ouachita Mountains, forests, rivers, and hot springs; its capital is Little Rock.","zh":"美国中南部的一个州，以奥扎克山脉与瓦希塔山脉、森林、河流和温泉闻名；首府为小石城（Little Rock）。"},"examples":[{"en":"My friend moved to Arkansas for a job in Little Rock.","zh":"我的朋友为了在小石城的工作搬去了阿肯色州。"},{"en":"We went hiking in the Ozarks in northern Arkansas.","zh":"我们去了阿肯色州北部的奥扎克山区徒步。"}]}],"synonyms":["AR (abbrev.)","The Natural State (nickname)"],"phonetic":"/ˈɑrkənˌsɔ/","extraExplanation":["发音提示：Arkansas 的末尾 -s 不发音（/ˈɑrkənˌsɔ/），这一点常让学习者困惑。常见记忆法是“Ar-kan-saw”。","词源与文化：地名来自对当地原住民部族（如 Quapaw）的称呼，经法语拼写影响形成 Arkansas；而 Kansas 虽拼写相似，但英语常读作 /ˈkænzəs/，发音不同。"]}
{"word":"Arkansaw","summary":{"en":"“Arkansaw” is an uncommon/old spelling of Arkansas, sometimes also used historically for the Arkansas River.","zh":"“Arkansaw”是Arkansas（阿肯色州）的少见/旧式拼写，也偶尔在历史语境中指阿肯色河。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A less common or old-fashioned spelling of Arkansas (a U.S. state), often used to reflect the traditional pronunciation ending in “-saw.”","zh":"Arkansas（美国阿肯色州）的较少见或较旧式拼写，常用来强调传统发音以“-saw”（类似“索”）结尾。"},"examples":[{"en":"Some older maps and writings spell the state as “Arkansaw.”","zh":"一些较旧的地图和文字会把该州拼作“Arkansaw”。"},{"en":"He joked that he’s from “Arkansaw,” so you know how to say the name.","zh":"他开玩笑说自己来自“Arkansaw”，这样你就知道这个名字该怎么念了。"}]},{"partOfSpeech":"other","definition":{"en":"(Rare) A name used for the Arkansas River, especially in historical contexts.","zh":"（罕见）对 Arkansas River（阿肯色河）的称呼，尤见于历史语境。"},"examples":[{"en":"The journal mentioned travel along the “Arkansaw River.”","zh":"这本日记提到沿着“Arkansaw River（阿肯色河）”旅行。"}]}],"synonyms":["Arkansas","Arkansas River"],"phonetic":"/ˈɑrkənˌsɔ/","extraExplanation":["“Arkansaw”多见于19世纪及更早的拼写习惯，或在文学/民间语境中用来提示读者：Arkansas在英语里通常读作“AR-kan-saw”，末尾的 s 不发 /z/。","这也常被拿来和 Kansas（堪萨斯，/ˈkænzəs/）对比：Kansas 末尾读 /-zəs/，但 Arkansas 末尾读 /-sɔ/。"]}
{"word":"Arkansawyer","summary":{"en":"“Arkansawyer” means a person from Arkansas; it’s an informal, somewhat old-fashioned word (Arkansan is more common).","zh":"“Arkansawyer”指阿肯色州人，属于较口语、略复古的说法（更常用 Arkansan）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from the U.S. state of Arkansas; an Arkansan (often informal or old-fashioned)","zh":"来自美国阿肯色州的人；阿肯色州人（常为非正式或较旧式的说法）"},"examples":[{"en":"She’s an Arkansawyer who moved to Texas for work.","zh":"她是阿肯色州人，后来为了工作搬到德克萨斯州。"},{"en":"Many Arkansawyers enjoy spending weekends on the lakes and rivers.","zh":"许多阿肯色州人喜欢周末去湖泊和河流休闲。"}]}],"synonyms":["Arkansan","person from Arkansas"],"phonetic":"/ˌɑr.kənˈsɔɪ.ɚ/","extraExplanation":["“Arkansawyer”是“Arkansas（阿肯色州）+ -yer”的构词方式，带有较强的口语/地方色彩；在正式写作或新闻中更常见的是“Arkansan”。","阿肯色州名“Arkansas”在英语中末尾不读 /s/（常读作“AR-kan-saw”一类），因此“Arkansawyer”用拼写“saw”来提示这种读音。","语域提醒：在现代语境里它可能显得带地方风味、复古或幽默；若不确定对方感受，用更中性的“Arkansan”更稳妥。"]}
{"word":"arkansawyer","summary":{"en":"“Arkansawyer” is an old-fashioned or dialect word meaning a person from Arkansas (an Arkansan).","zh":"“Arkansawyer”是较旧式或方言用法，意思是阿肯色州人（即 Arkansan）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Arkansas; an Arkansan (dialectal/old-fashioned).","zh":"阿肯色州人；阿肯色州居民（方言/较旧式用法）。"},"examples":[{"en":"My great-grandfather called himself an Arkansawyer when he talked about growing up in the Ozarks.","zh":"我曾祖父谈到自己在奥沙克山区长大时，会说自己是“Arkansawyer”。"},{"en":"In some older stories, a traveler meets an Arkansawyer on the road.","zh":"在一些较老的故事里，旅人会在路上遇到一位“Arkansawyer”。"}]}],"synonyms":["Arkansan"],"phonetic":"/ˌɑr.kənˈsɔ.jɚ/","extraExplanation":["“Arkansawyer”是“Arkansas”的一种带口音/民间拼写的延伸，反映把 Arkansas 读成类似“Arkansaw”的发音习惯（在部分地区或旧文本中可见）。","现代更常用、也更正式的说法是“Arkansan”。“Arkansawyer”多见于口语化、自嘲式表达、地方文化叙述或较早的文学/民俗写作中。","拼写中的 -saw- 往往用来提示读音与“saw”（/sɔ/）接近；但在当代公共场合使用时，可能显得过时或带强烈地方色彩。"]}
{"word":"Arkansian","summary":{"en":"Arkansan means a person from Arkansas, or something related to Arkansas.","zh":"Arkansan 指阿肯色州人，或与阿肯色州相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from the U.S. state of Arkansas","zh":"美国阿肯色州（Arkansas）的人；阿肯色州居民"},"examples":[{"en":"She’s an Arkansan who moved to Texas for work.","zh":"她是阿肯色州人，为了工作搬到了德克萨斯州。"},{"en":"Many Arkansans enjoy outdoor activities in the Ozarks.","zh":"许多阿肯色州人喜欢在奥扎克山区进行户外活动。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Arkansas or its people","zh":"阿肯色州的；与阿肯色州或其居民有关的"},"examples":[{"en":"Arkansan history is taught in some local schools.","zh":"一些当地学校会教授阿肯色州历史。"},{"en":"He cooked an Arkansan-style meal with Southern flavors.","zh":"他做了一顿带有南方风味的“阿肯色州风格”餐。"}]}],"synonyms":["Arkansas resident","Arkansas native"],"phonetic":"/ɑrˈkænzən/","extraExplanation":["你写的 **Arkansian** 通常被视为拼写错误或少见变体；标准拼写是 **Arkansan**。","发音要点：州名 **Arkansas** 常读作 “AR-kan-saw”（末尾不发 /s/），因此 **Arkansan** 也读作 /ɑrˈkænzən/。","相关用法：表示“来自某州的人”在英文里常用后缀 **-an / -ian**（如 *Texan, Californian*），但阿肯色州的标准形式是 **Arkansan**。"]}
{"word":"arkansite","summary":{"en":"Arkansite is a rare titanium dioxide mineral originally found in Arkansas.","zh":"Arkansite 是一种最初在阿肯色州发现的罕见二氧化钛矿物（板钛矿的一种）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (a variety of brookite, titanium dioxide) originally found in Arkansas, USA.","zh":"一种罕见矿物（板钛矿 brookite 的一种，主要成分为二氧化钛），最初在美国阿肯色州被发现。"},"examples":[{"en":"The museum’s mineral case includes arkansite from Arkansas.","zh":"博物馆的矿物展柜里有一块来自阿肯色州的 arkansite（阿肯石）。"},{"en":"Arkansite is related to other titanium dioxide minerals such as rutile and anatase.","zh":"Arkansite 与金红石（rutile）和锐钛矿（anatase）等其他二氧化钛矿物有关。"}]}],"synonyms":["brookite (variety)","titanium dioxide mineral"],"phonetic":"/ɑrˈkænsaɪt/","extraExplanation":["“Arkansite”这个名字来自它的产地 Arkansas（阿肯色州），是一种比较早期的命名方式；在矿物学分类中，它通常被视为板钛矿（brookite，TiO₂）的一个品种/变种。","学习提示：它是专有名词式的矿物名，日常英语里很少见，更常出现在地质、矿物收藏、博物馆标注或学术语境中。"]}
{"word":"Arkdale","summary":{"en":"Arkdale is usually a proper noun, best known as a small community in Wisconsin; it can also be used as a fictional or brand name.","zh":"Arkdale 通常是专有名词，最常见指美国威斯康星州的一个小社区；也可用作虚构地名或品牌名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small unincorporated community in Adams County, Wisconsin, United States (a place name).","zh":"美国威斯康星州亚当斯县的一个小型非建制社区（地名）。"},"examples":[{"en":"She grew up near Arkdale, Wisconsin.","zh":"她在威斯康星州的阿克代尔（Arkdale）附近长大。"},{"en":"We stopped in Arkdale for gas before driving to the lake.","zh":"我们去湖边之前在阿克代尔停下来加油。"}]},{"partOfSpeech":"n.","definition":{"en":"a proper name used in fiction or branding (often chosen to sound rural or traditional).","zh":"用于小说或品牌的专有名称（常被选来营造乡村、传统的感觉）。"},"examples":[{"en":"The novel’s main town is called Arkdale.","zh":"这本小说里的主要城镇叫 Arkdale。"},{"en":"They named the new café Arkdale to give it a cozy, small-town feel.","zh":"他们把新咖啡馆取名为 Arkdale，以营造温馨的小镇氛围。"}]}],"synonyms":["(no direct synonyms; it is a proper name)"],"phonetic":"/ˈɑrkdeɪl/","extraExplanation":["“Arkdale”是专有名词，通常不翻译，常见做法是音译或直接保留原拼写。","词尾“-dale”在英语地名里很常见，意思是“山谷/谷地”（如 Glendale, Riverdale），所以“Arkdale”听起来像一个自然地理相关的小镇地名。"]}
{"word":"Arkhangelsk","summary":{"en":"Arkhangelsk is a city (and sometimes the wider region) in northwest Russia on the White Sea, historically important as a port connected to the Arctic.","zh":"Arkhangelsk 指俄罗斯西北部白海沿岸的阿尔汉格尔斯克市（有时也指更大的阿尔汉格尔斯克州），历史上是与北极航线相关的重要港口。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in northwest Russia on the White Sea, known as a historic port and gateway to the Arctic.","zh":"阿尔汉格尔斯克（Arkhangelsk）：俄罗斯西北部白海沿岸的城市，以历史港口和通往北极的重要门户而闻名。"},"examples":[{"en":"Arkhangelsk is a major port on the White Sea.","zh":"阿尔汉格尔斯克是白海沿岸的重要港口。"},{"en":"Some Arctic expeditions used Arkhangelsk as a starting point.","zh":"一些北极探险曾以阿尔汉格尔斯克为出发地。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension) Arkhangelsk Oblast, the surrounding administrative region of Russia that includes the city and nearby Arctic territories.","zh":"（引申）阿尔汉格尔斯克州：俄罗斯的一个行政区，包括该市及周边部分北极地区。"},"examples":[{"en":"He works in Arkhangelsk Oblast, not far from the White Sea coast.","zh":"他在阿尔汉格尔斯克州工作，离白海海岸不远。"}]}],"synonyms":["Archangel (historical English name)"],"phonetic":"/ɑrˈkænɡəlsk/","extraExplanation":["发音提示：重音通常在第二个音节（-han-）附近，结尾的 -sk 常读作 /sk/。","名称背景：Arkhangelsk 与“archangel（大天使）”同源，历史上英语里也可见旧称 “Archangel”（多见于历史/航海语境）。","文化与历史：在彼得大帝发展圣彼得堡之前，Arkhangelsk 曾是俄罗斯对外贸易的重要海港之一；在二战时期也与北极航线补给有历史关联。"]}
{"word":"arkheia","summary":{"en":"Arkheia means “archives,” especially official public records; in theory, it can also refer to the archive as a system of authority and memory.","zh":"Arkheia 指“档案/官方公共记录”；在理论语境中也可指档案作为权力与记忆运作机制的概念。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural, from Greek) archives; official public records, especially those kept by authorities.","zh":"（复数，源自希腊语）档案；官方公共记录，尤指由政府/权力机构保存的记录。"},"examples":[{"en":"Historians searched the arkheia for old tax records and court decisions.","zh":"历史学家在 arkheia（官方档案）中查找旧税册和法院裁决。"},{"en":"In ancient cities, the arkheia were kept under the control of officials.","zh":"在古代城邦中，arkheia 通常由官员掌管保存。"}]},{"partOfSpeech":"n.","definition":{"en":"(in literary/critical theory) the idea of the archive as a place and system of authority—what is preserved, who controls it, and how memory is shaped.","zh":"（文学/批评理论）“档案”作为权力机制与制度的概念：保存什么、谁来掌控，以及记忆如何被塑造。"},"examples":[{"en":"The essay uses the term arkheia to discuss how institutions decide which stories become ‘history.’","zh":"这篇文章用 arkheia 来讨论机构如何决定哪些故事会成为“历史”。"},{"en":"Derrida’s writing on arkheia links archiving to authority and origin.","zh":"德里达关于 arkheia 的论述把“存档”与权威和起源联系在一起。"}]}],"synonyms":["archives","public records","repository","records"],"phonetic":"/ɑrˈkeɪ.ə/","extraExplanation":["“Arkheia”常见于人文学术语境，来自希腊语“arkheion”（执政官/官署的所在地、公共档案存放处），与“arkhē”（统治、开端/起源）同源，因此这个词常被用来强调：档案不只是资料库，也与权力、管理、合法性有关。","现代讨论中常与德里达（Jacques Derrida）的《Archive Fever》（《档案热》）相关；他借此强调“谁有权保存与解释记录”会影响社会记忆与历史叙事。"]}
{"word":"arkhia","summary":{"en":"“Arkhia” is a rare Greek-style transliteration meaning “rule/government,” roughly the same as the English suffix “-archy.”","zh":"“arkhia”是少见的希腊语式转写，表示“统治/政体”，大致相当于英语后缀“-archy”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Rare; from Greek transliteration) a suffix/combining form meaning “rule, government, or a system of power,” similar to -archy.","zh":"（少见；源自希腊语转写）表示“统治、政体、权力体系”的后缀/构词成分，相当于英语的 -archy。"},"examples":[{"en":"In English, we usually write this idea as “-archy,” as in monarchy or anarchy.","zh":"在英语里，这个意思通常写作“-archy”，比如 monarchy（君主制）或 anarchy（无政府状态）。"},{"en":"You may see “-arkhia” in transliterations from Greek or in names used in specific communities.","zh":"你可能会在希腊语的转写形式，或某些社群的特定用法中看到“-arkhia”。"}]}],"synonyms":["-archy"],"phonetic":"ˈɑrkiə","extraExplanation":["“arkhia”本身不是现代英语中常见、规范的拼写；学习英语词汇时，更实用的是认识它对应的英语形式“-archy”。","“-archy”来自希腊语 arkhē（统治/起源/权威）相关词根，常见构词：mon-（一个）+ -archy → monarchy；an-（无）+ -archy → anarchy；olig-（少数）+ -archy → oligarchy（寡头政治）。","如果你是在特定文本（例如某些学术转写、宗教/文化圈用语、或人名/组织名）中遇到“arkhia”，可以告诉我上下文，我能更准确判断它是拼写变体、专有名词，还是某个具体术语。"]}
{"word":"arkhwo","summary":{"en":"“arkhwo” is not recognized as a standard English word; it likely needs clarification or corrected spelling.","zh":"“arkhwo”不是标准英语单词；很可能需要澄清来源或更正拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a name/username.","zh":"不是标准英语单词，可能是拼写错误或人名/用户名。"},"examples":[{"en":"I couldn’t find “arkhwo” in an English dictionary—could you check the spelling?","zh":"我在英语词典里找不到“arkhwo”，你能检查一下拼写吗？"},{"en":"Do you mean “arch” or “art”?","zh":"你是不是想写“arch（拱形/拱门）”或“art（艺术）”？"}]}],"extraExplanation":["“arkhwo”看起来像随机字母组合，或来自其他语言/转写（比如俄语、希腊语等）的拼写。为了帮你准确查词，请你告诉我：\n1）你想表达的中文意思；\n2）它出现的句子/上下文；\n3）是否是人名、地名、游戏ID或品牌名。\n\n在你回复前，我也可以先给出几个最可能的英语目标词：\n- arch /ɑrtʃ/：拱门；拱形的\n- artwork /ˈɑrtˌwɝk/：艺术品\n- archae-（词根）：与“古代、考古”有关（如 archaeology）\n如果你能确认其中一个，我就能按正确词条详细解释。"]}
{"word":"Arkie","summary":{"en":"“Arkie” is an informal word meaning a person from Arkansas (an Arkansan).","zh":"“Arkie”是非正式用语，指阿肯色州人（Arkansan）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Informal) A person from Arkansas; an Arkansan. Sometimes used as a casual nickname, and occasionally felt as mildly insulting depending on tone and context.","zh":"（非正式）阿肯色州人；阿肯色州居民。有时是随口的昵称，但在某些语气或语境里也可能带点轻微贬义。"},"examples":[{"en":"She’s an Arkie born and raised in Little Rock.","zh":"她是土生土长的小石城（Little Rock）的阿肯色州人。"},{"en":"Some locals call themselves Arkies with pride.","zh":"一些当地人会带着自豪感称自己为“Arkie”。"},{"en":"Be careful—calling someone an “Arkie” can sound rude if you don’t know them well.","zh":"要注意：如果不熟，叫别人“Arkie”可能听起来不礼貌。"}]}],"synonyms":["Arkansan"],"phonetic":"/ˈɑrki/","extraExplanation":["“Arkie”是“Arkansas（阿肯色州）”的口语化缩写称呼，主要在美国南部语境中出现。","它既可能是自称的亲切昵称（类似“本地人”口吻），也可能在外人使用时带有刻板印象色彩；正式场合更稳妥的说法是“Arkansan”。"]}
{"word":"arkie","summary":{"en":"“Arkie” is an informal word for someone from Arkansas; it can be neutral in friendly contexts but may be offensive when used as an insult.","zh":"“Arkie”是指阿肯色州人的非正式说法；在友好语境里可能中性，但作为辱称时可能冒犯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A person from Arkansas (a state in the southern United States).","zh":"（非正式）来自美国阿肯色州的人。"},"examples":[{"en":"My roommate is an Arkie, and he taught me how to make real cornbread.","zh":"我室友是个阿肯色州人，他教我怎么做正宗的玉米面包。"},{"en":"A lot of Arkies travel to Texas for work.","zh":"很多阿肯色州人会去德州工作。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, sometimes offensive) A stereotype-based label for someone from Arkansas, suggesting they are uneducated or rural.","zh":"（非正式；有时带冒犯）基于刻板印象给阿肯色州人贴的标签，暗示对方没受过教育或很“乡下”。"},"examples":[{"en":"He used the word “Arkie” as an insult, which wasn’t okay.","zh":"他把“Arkie”当侮辱用，这样不合适。"},{"en":"Some people avoid the term because it can sound rude.","zh":"有些人会避开这个词，因为听起来可能不礼貌。"}]}],"synonyms":["Arkansan","person from Arkansas"],"phonetic":"/ˈɑrki/","extraExplanation":["“Arkie”是“Arkansas”的昵称式变体（类似把地名缩短、口语化）。在一些语境里它只是随意的自称或玩笑；但在另一些语境里可能带有轻视、嘲讽的味道。比较中性、正式的说法是“Arkansan”。","书面或正式场合建议用“Arkansan”；如果听到别人说“Arkie”，可以结合语气、关系和上下文判断是否友好。"]}
{"word":"Arkite","summary":{"en":"“Arkite” means a person from Arkansas (less common than “Arkansan”).","zh":"“Arkite”指阿肯色州人（比“Arkansan”更少用、略显旧式）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Arkansas; an Arkansan.","zh":"阿肯色州人；阿肯色州居民。"},"examples":[{"en":"She’s an Arkite who moved to Texas for work.","zh":"她是阿肯色州人，为了工作搬到了德州。"},{"en":"Many Arkites enjoy outdoor activities like fishing and hiking.","zh":"许多阿肯色州人喜欢钓鱼、徒步等户外活动。"}]}],"synonyms":["Arkansan"],"phonetic":"/ˈɑrˌkaɪt/","extraExplanation":["“Arkite”是较少见、带点旧式或报刊用语色彩的称呼；日常更常见的是“Arkansan”（阿肯色州人）。","在一些历史文本或新闻报道中可能会看到“Arkite”，用来强调地域身份，类似于用“New Yorker”“Texan”来称呼纽约人、德州人。"]}
{"word":"arkite","summary":{"en":"Arkite usually means a person from Arkansas (old-fashioned); it can also refer to a biblical group called the Arkites.","zh":"Arkite 通常指阿肯色州人（较旧式）；也可指《圣经》中名为 Arkites 的族群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from the U.S. state of Arkansas; an Arkansan (now uncommon or old-fashioned).","zh":"来自美国阿肯色州的人；阿肯色州居民（较少用/较旧式）。"},"examples":[{"en":"My grandfather still calls himself an Arkite, but most people say ‘Arkansan’ today.","zh":"我爷爷还会自称是“Arkite”，但现在大多数人会说“Arkansan”。"},{"en":"The article interviewed several Arkites about the local election.","zh":"这篇文章采访了几位阿肯色州居民，询问他们对地方选举的看法。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural: Arkites) a group mentioned in the Bible (Genesis 10:17), traditionally understood as a Canaanite clan or people.","zh":"（复数 Arkites）《圣经》中提到的族群（《创世记》10:17），传统上被理解为迦南的一支氏族/民族。"},"examples":[{"en":"In Genesis, the Arkites are listed among the Canaanite peoples.","zh":"在《创世记》中，Arkites 被列为迦南诸族之一。"},{"en":"Some Bible notes explain the Arkites as people connected with an ancient place-name.","zh":"一些《圣经》注释把 Arkites 解释为与古代地名相关的人群。"}]}],"synonyms":["Arkansan","Arkansas resident"],"phonetic":"/ˈɑrkaɪt/","extraExplanation":["“Arkite”作为“阿肯色州人”的说法带有年代感，现代更常见、也更中性的说法是“Arkansan”。","作为《圣经》用语时，“Arkites”通常只出现在宗教文本、注释或历史/地理讨论中，不属于日常英语。"]}
{"word":"Arkoma","summary":{"en":"Arkoma is a U.S. place name—most commonly a small town in eastern Oklahoma near Arkansas; it can also refer to the Arkoma Basin in geology.","zh":"Arkoma 是美国的地名：最常见指俄克拉荷马州东部靠近阿肯色州的一座小镇；在地质语境中也可指“阿科马盆地”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small town in eastern Oklahoma, U.S., near the Arkansas border (close to Fort Smith, Arkansas)","zh":"阿科马（Arkoma）：美国俄克拉荷马州东部、靠近阿肯色州边界的一座小镇（靠近阿肯色州的史密斯堡）"},"examples":[{"en":"Arkoma sits right near the Oklahoma–Arkansas line.","zh":"Arkoma 就在俄克拉荷马州与阿肯色州的州界附近。"},{"en":"We drove through Arkoma on the way to Fort Smith.","zh":"我们去史密斯堡的路上开车经过了 Arkoma。"}]},{"partOfSpeech":"n.","definition":{"en":"(in geology) the Arkoma Basin, a sedimentary basin spanning parts of Arkansas and Oklahoma","zh":"（地质）阿科马盆地（Arkoma Basin）：横跨阿肯色州与俄克拉荷马州部分地区的沉积盆地"},"examples":[{"en":"Some maps label this region as the Arkoma Basin.","zh":"一些地图会把这一带标注为阿科马盆地。"},{"en":"The Arkoma Basin is known for its rock layers and energy resources.","zh":"阿科马盆地以其岩层和能源资源而闻名。"}]}],"phonetic":"/ɑrˈkoʊmə/","extraExplanation":["“Arkoma”这个名字常被认为是由“Arkansas（阿肯色）”和“Oklahoma（俄克拉荷马）”两州名称拼合而来，因此特别贴合它靠近州界的地理位置。"]}
{"word":"arkose","summary":{"en":"Arkose is a feldspar-rich sandstone, often pink or reddish, typically formed from nearby granite.","zh":"Arkose（长石砂岩）是富含长石的砂岩，常呈粉红或红色，通常与附近花岗岩风化物有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of sandstone made mostly of quartz and feldspar (often pink or reddish), usually formed from the fast erosion of granite.","zh":"一种砂岩，主要由石英和长石组成（常呈粉红或红褐色），通常由花岗岩快速风化侵蚀后的物质沉积形成。"},"examples":[{"en":"The trail cuts through layers of arkose that weather into gritty sand.","zh":"小径穿过一层层的长石砂岩，风化后会变成粗粒的砂。"},{"en":"Because it contains a lot of feldspar, arkose often points to nearby granite as the source rock.","zh":"由于含有大量长石，长石砂岩常暗示其物源岩可能就在附近的花岗岩。"}]}],"synonyms":["feldspathic sandstone","sandstone"],"phonetic":"/ɑrˈkoʊs/","extraExplanation":["“arkose”是地质学术语，常用于野外描述岩层或讲解沉积环境。它与一般“sandstone（砂岩）”相比，辨认要点是长石含量高；长石容易风化，所以当你看到富长石的砂岩时，往往意味着沉积物搬运距离不远、沉积速度较快。","在建筑或景观石材语境中，有时也会提到arkose的颜色（偏粉红/红色）与颗粒感，但它并不是日常生活里常用的词，更多出现在地质、地理或自然历史类读物中。"]}
{"word":"arkoses","summary":{"en":"“Arkoses” means more than one arkose, a feldspar-rich sandstone often linked to nearby granite sources.","zh":"“arkoses”是arkose的复数，指多层/多块富含长石的砂岩，常暗示物源接近花岗岩、沉积较快。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of arkose: a type of sandstone that contains a high amount of feldspar (often pinkish or reddish), usually formed from the rapid erosion of granite-rich rocks.","zh":"arkose（长石砂岩）的复数：一种含长石比例很高的砂岩（常呈粉红或红色），通常由富含花岗岩成分的岩石快速风化、侵蚀后形成。"},"examples":[{"en":"The outcrop shows arkoses with visible pink feldspar grains.","zh":"这处露头可见多层长石砂岩，粉红色长石颗粒很明显。"},{"en":"Geologists mapped several arkoses along the valley as evidence of nearby granite sources.","zh":"地质学家在山谷中标绘出多处长石砂岩，用以证明附近存在花岗岩物源。"}]}],"synonyms":["feldspathic sandstone","feldspar-rich sandstone"],"phonetic":"/ɑrˈkoʊs/","extraExplanation":["“arkose”常用于地质学与沉积学语境，强调砂岩中长石含量高（常见阈值约≥25%）。它通常意味着沉积物搬运距离较短、风化不充分，因此常被用来推断“物源近、沉积快”的环境信息。","词形：单数 arkose，复数 arkoses。学术写作中也可能用作不可数名词（如：arkose is common here）。"]}
{"word":"arkosic","summary":{"en":"Arkosic describes rocks or sediments that are rich in feldspar, especially sandstone related to arkose.","zh":"arkosic 指富含长石的岩石或沉积物，尤指与长石砂岩（arkose）相关的砂岩。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing a lot of feldspar (especially in sandstone); related to or resembling arkose (a feldspar-rich sandstone).","zh":"（尤指砂岩）含有大量长石的；与长石砂岩（arkose）有关或类似的。"},"examples":[{"en":"The geologist identified an arkosic sandstone, rich in feldspar grains.","zh":"地质学家鉴定出一种长石含量很高的长石质砂岩。"},{"en":"Arkosic sediments often indicate rapid erosion and short transport from nearby granite.","zh":"长石质沉积物常暗示侵蚀迅速、搬运距离短，物源可能来自附近的花岗岩。"}]}],"synonyms":["feldspathic","arkose-rich","feldspar-rich"],"phonetic":"/ɑrˈkoʊsɪk/","extraExplanation":["“arkosic”多用于地质与沉积学语境，常见搭配有：arkosic sandstone（长石质砂岩）、arkosic arenite（长石质砂屑岩/砂岩）、arkosic composition（长石质成分）。","词形上是“arkose（长石砂岩）+ -ic（形容词后缀）”，表示“具有……性质的”。"]}
{"word":"Arkport","summary":{"en":"Arkport is a place name in New York State, referring to a village (and also a surrounding town) in Steuben County.","zh":"Arkport 是纽约州的地名，通常指斯托本县的阿克波特村，也可能指其周边的阿克波特镇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A village in Steuben County, New York, United States.","zh":"美国纽约州斯托本县的一个村庄（Arkport Village）。"},"examples":[{"en":"She grew up in Arkport and later moved to Rochester for college.","zh":"她在阿克波特（Arkport）长大，后来去罗切斯特上大学。"},{"en":"Arkport is a small community with a quiet, rural feel.","zh":"Arkport 是一个小社区，氛围安静、乡村气息浓。"}]},{"partOfSpeech":"n.","definition":{"en":"A nearby town (the larger administrative area) that surrounds the village of Arkport in Steuben County, New York.","zh":"美国纽约州斯托本县的阿克波特镇（Arkport Town；通常指环绕阿克波特村的更大行政区域）。"},"examples":[{"en":"The event is held in the Town of Arkport, just outside the village.","zh":"活动在阿克波特镇（Town of Arkport）举行，就在村子外面。"}]}],"phonetic":"/ˈɑɹkˌpɔɹt/","extraExplanation":["Arkport 是专有名词（地名），通常不翻译，会直接音译或保留原拼写。实际使用时，有时指“Arkport Village（阿克波特村）”，有时指“Town of Arkport（阿克波特镇）”；在纽约州语境里，town 和 village 是不同的行政单位。","在书面地址或官方文件中，常见写法包括 “Arkport, NY”。"]}
{"word":"arks","summary":{"en":"“Arks” is the plural of “ark,” meaning either (1) large boats/“arks” like Noah’s Ark or (2) sacred chests/boxes, especially the Ark of the Covenant.","zh":"“arks”是“ark”的复数，常指（1）方舟/大船（如诺亚方舟），也可指（2）圣柜/圣匣（尤指约柜）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of ark: a large boat or ship, especially one mentioned in stories (such as Noah’s Ark).","zh":"ark 的复数：大船、方舟（尤指故事中的船，如《圣经》里的诺亚方舟）。"},"examples":[{"en":"Many children can recognize pictures of animals boarding arks in storybooks.","zh":"很多孩子都能在故事书里认出动物登上方舟的图画。"},{"en":"The museum displayed models of arks from different cultures’ flood legends.","zh":"博物馆展出了不同文化洪水传说中的方舟模型。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of ark: a sacred chest or box for keeping something precious, especially in religious contexts (such as the Ark of the Covenant).","zh":"ark 的复数：圣柜、圣匣（用于存放珍贵或神圣之物，尤指宗教语境，如“约柜”）。"},"examples":[{"en":"In some traditions, arks were used to hold important religious objects.","zh":"在一些传统中，圣柜用来存放重要的宗教器物。"},{"en":"The story describes the Ark of the Covenant as one of the most sacred arks.","zh":"这个故事把“约柜”描述为最神圣的圣柜之一。"}]}],"synonyms":["vessels","boats","chests","shrines"],"phonetic":"/ɑrks/","extraExplanation":["“ark”常见于宗教与文学叙事：如《圣经》里的“Noah’s Ark（诺亚方舟）”象征拯救与新开始；“Ark of the Covenant（约柜）”则象征神圣盟约与信仰。","注意：在现代英语里，“arks”最常见的用法是指“方舟/大船”的复数；宗教意义的“圣柜/约柜”多出现在特定语境（宗教、历史、文学）中。"]}
{"word":"arksutite","summary":{"en":"“arksutite” is not recognized as a common English word; it’s likely a misspelling or a specialized/proper-name term.","zh":"“arksutite”不是常见英语词；更可能是拼写错误或某个专有名词/专业术语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries. It may be a misspelling, a proper noun (name), or a highly specialized term (e.g., a mineral/species name).","zh":"不是常见英语词典中的标准词。可能是拼写错误、专有名词（名字），或非常专业的术语（例如矿物/物种名称）。"},"examples":[{"en":"I can’t find “arksutite” in standard dictionaries—could you share the sentence or where you saw it?","zh":"我在常见词典里找不到“arksutite”——你能提供它所在的句子或出处吗？"},{"en":"Did you mean “Arksutite” as a place/person name, or is it a scientific term?","zh":"你说的“Arksutite”是地名/人名，还是科学术语呢？"}]}],"extraExplanation":["如果你能提供更多线索（例如：它出现的句子、学科领域、是否首字母大写、或可能的正确拼写），我就能更准确地判断它的含义与发音。也可能是与 Arctic（北极的）相关的拼写变体，或是某些专业命名（矿物/化学/生物分类名），需要具体上下文确认。"]}
{"word":"arktikos","summary":{"en":"Arktikos is an Ancient Greek-based form meaning “northern; Arctic,” mainly used in etymology to explain the origin of “Arctic.”","zh":"Arktikos 源自古希腊语，意为“北方的；北极的”，主要用于词源说明，解释英语 Arctic 的来历。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(from Ancient Greek) “northern; of the Arctic,” related to the region around the North Pole.","zh":"（源自古希腊语）“北方的；北极的”，指与北极圈、北极地区相关。"},"examples":[{"en":"In Greek, arktikos describes things connected with the far north.","zh":"在希腊语中，arktikos 用来形容与遥远北方有关的事物。"},{"en":"The word “Arctic” ultimately comes from arktikos.","zh":"英语里的 “Arctic（北极的）” 最终来源于 arktikos。"}]},{"partOfSpeech":"other","definition":{"en":"A transliterated form seen in etymology (word-history) notes; it is not commonly used as an everyday English word.","zh":"常见于词源（词语历史）说明中的拉丁字母转写形式；并不是日常英语里常用的词。"},"examples":[{"en":"Some dictionaries cite arktikos when explaining the origin of “Arctic.”","zh":"一些词典在解释 “Arctic” 的来源时会引用 arktikos。"}]}],"synonyms":["Arctic","northern","polar"],"phonetic":"/ˈɑrktɪkəs/","extraExplanation":["“Arktikos” 来自古希腊语 ἄρκτος (arktos, “熊”)。古人用“熊”指代北方天空中的大熊座（Ursa Major）等星座，因此“与熊有关的”逐渐引申为“北方的、北极的”。","现代英语常用的是 Arctic /ˈɑrktɪk/；“arktikos”多用于学术或词源讨论中。"]}
{"word":"Arktos","summary":{"en":"Arktos is Greek for “bear,” best known as the root behind “Arctic.”","zh":"Arktos 是希腊语“熊”，最常见于词源中，尤其是 Arctic（北极的）的词根。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(from Greek) “bear”; used as a name or root in words related to the north, especially in “Arctic.”","zh":"（源自希腊语）“熊”；常作为名称或词根使用，尤其出现在与“北方/北极”相关的词中，如 Arctic（北极的）。"},"examples":[{"en":"The word “Arctic” comes from Greek arktos, meaning “bear.”","zh":"“Arctic（北极的）”这个词来自希腊语 arktos，意思是“熊”。"},{"en":"Some books use “Arktos” as a dramatic name for a bear or a bear spirit.","zh":"有些书会把“Arktos”当作一个很有戏剧感的名字，用来指熊或“熊之灵”。"}]}],"synonyms":["bear (meaning)","Greek for “bear”"],"phonetic":"/ˈɑrktɑs/","extraExplanation":["“Arktos（ἄρκτος）”在古希腊语里就是“熊”。它和天上的“北斗/大熊座（Ursa Major）”的意象有关：古人用这些星座来指引北方，因此“北极 Arctic”可理解为“与熊（星座）相关的地方”。","相关词：Arctic（北极的，靠近北极的）；Antarctic（南极的；字面上可理解为“与北极相对的”）。","作为专有名词或角色名出现时，“Arktos”常带有神话感、古典感，适合用在文学、游戏或奇幻作品中。"]}
{"word":"arktos","summary":{"en":"Arktos is a Greek-derived word meaning “bear,” mostly used in etymology (e.g., explaining the origin of “Arctic”).","zh":"Arktos 源自希腊语，意为“熊”，多用于词源学解释（如说明“Arctic/北极的”的来源）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Greek) “bear”; used mainly in etymology and names (not common in everyday English).","zh":"（源自希腊语）“熊”；主要用于词源学与命名中（英语日常中不常直接使用）。"},"examples":[{"en":"The word “Arctic” comes from Greek arktos, meaning “bear.”","zh":"“Arctic（北极的）”一词来自希腊语 arktos，意思是“熊”。"},{"en":"In some academic texts, arktos is mentioned when explaining how Arctic and Arcturus got their names.","zh":"在一些学术文本中，解释 Arctic 和 Arcturus（大角星）名称来源时会提到 arktos。"}]}],"synonyms":["bear","Ursa"],"phonetic":"/ˈɑrktɑs/","extraExplanation":["在英语里，arktos 通常不是“你会拿来日常说熊”的词；真正常用的是 bear。arktos 更常出现在词源解释里：古希腊人用“熊”来指代北方天空附近的星座（如大熊座），所以与“北方/北极”相关的词也常从这个词根发展出来。","相关文化线索：Arctic（北极）可理解为“熊之地/熊的方向”，与北天的大熊座（Ursa Major）意象有关；Arcturus（大角星）的名字也与“熊的守卫者/看守熊者”这一传统解释有关。"]}
{"word":"Arkville","summary":{"en":"Arkville is a proper name, most often a small hamlet in New York State, USA, and can also be used for other places (real or fictional) with the same name.","zh":"Arkville 是专有地名，最常见指美国纽约州的一个小村落，也可泛指其他同名地点（真实或虚构）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun), most commonly referring to Arkville, a small hamlet in Delaware County, New York, USA.","zh":"地名（专有名词），最常见指美国纽约州特拉华县的一个小村落（hamlet）Arkville。"},"examples":[{"en":"We drove through Arkville on our way to the Catskills.","zh":"我们去卡茨基尔山的路上开车经过了阿克维尔（Arkville）。"},{"en":"Arkville is a quiet community with beautiful mountain scenery nearby.","zh":"阿克维尔（Arkville）是个安静的社区，附近有很美的山景。"}]},{"partOfSpeech":"n.","definition":{"en":"any real or fictional location named “Arkville” (used in stories, maps, or as a business/community name).","zh":"任何名为“Arkville”的真实或虚构地点（可出现在故事、地图中，也可能用作企业/社区名称）。"},"examples":[{"en":"In the novel, the hero returns to Arkville to solve a mystery.","zh":"在小说里，主角回到阿克维尔（Arkville）破解一个谜案。"}]}],"synonyms":["(no direct synonym; place name)"],"phonetic":"/ˈɑrkˌvɪl/","extraExplanation":["“Arkville”属于专有名词，通常不翻译，中文常用音译“阿克维尔”。","在美国，“-ville”这个后缀很常见，来自法语，意思大致是“城镇/聚落”。因此很多地名会以“-ville”结尾。"]}
{"word":"Arkwright","summary":{"en":"Arkwright is a surname, especially associated with Sir Richard Arkwright, an important Industrial Revolution figure in textile manufacturing.","zh":"Arkwright 是一个姓氏，最常与工业革命时期纺织业重要人物理查德·阿克赖特爵士相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a British surname; most commonly refers to Sir Richard Arkwright (1732–1792), an English inventor and entrepreneur who helped develop the early factory system in the Industrial Revolution, especially in cotton spinning.","zh":"英国姓氏；最常指理查德·阿克赖特爵士（1732–1792），英格兰发明家与企业家，工业革命时期推动早期工厂制度发展，尤其在棉纺纱领域影响深远。"},"examples":[{"en":"In our history class, we learned how Arkwright’s water-powered mills changed textile production.","zh":"在历史课上，我们学习了阿克赖特的水力纺织工厂如何改变了纺织生产。"},{"en":"The museum exhibit mentions Arkwright as a key figure in the Industrial Revolution.","zh":"博物馆展览把阿克赖特称为工业革命的重要人物。"}]}],"phonetic":"/ˈɑrkwraɪt/","extraExplanation":["“Arkwright”在英语语境里通常不是普通词汇，而是专有名词（人名/姓氏）。历史上最有名的是理查德·阿克赖特：他改良与推广纺纱技术，并以水力纺纱厂推动规模化生产，因此常与“factory system（工厂制度）”“textile industry（纺织业）”等话题一起出现。"]}
{"word":"arkwright","summary":{"en":"Arkwright most often refers to Sir Richard Arkwright, a key figure in the Industrial Revolution; it can also be a surname.","zh":"Arkwright 通常指工业革命的重要人物阿克赖特爵士，也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Sir Richard Arkwright (1732–1792), an English inventor and industrialist who helped drive the Industrial Revolution by developing and popularizing early factory-based cotton-spinning machines (especially the water frame).","zh":"阿克赖特爵士（Richard Arkwright，1732–1792），英国发明家与实业家，因改良并推广早期工厂化棉纺机器（尤指“水力纺纱机”water frame）而推动了工业革命。"},"examples":[{"en":"In many history books, Arkwright is linked with the rise of the modern factory system.","zh":"在许多历史书中，阿克赖特与现代工厂制度的兴起密切相关。"},{"en":"The museum shows how Arkwright’s spinning machines changed textile production.","zh":"博物馆展示了阿克赖特的纺纱机器如何改变了纺织生产。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname: the family name Arkwright.","zh":"姓氏：Arkwright（阿克赖特）。"},"examples":[{"en":"Her last name is Arkwright, but she isn’t related to the inventor.","zh":"她的姓是阿克赖特，但她和那位发明家没有亲属关系。"}]}],"synonyms":["Sir Richard Arkwright","Richard Arkwright"],"phonetic":"/ˈɑrkˌraɪt/","extraExplanation":["“Arkwright”常在工业革命语境中出现：他把技术创新、资本与组织管理结合起来，推动了集中化生产与工厂工作制度的发展。","water frame（“水力纺纱机/水力纺纱架”）得名于其依靠水力驱动；与后来的蒸汽动力结合后，纺织业的规模与效率迅速提升。","在英国文化中，Arkwright常被作为“工业化早期企业家/工厂制度代表人物”来提及。"]}
