{"word":"arn","summary":{"en":"“ARN” most commonly means Amazon Resource Name in AWS, a unique identifier for a cloud resource; it can also be a male name.","zh":"“ARN”最常见指 AWS 中的 Amazon Resource Name（资源唯一标识符）；也可以用作男性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(computing, Amazon Web Services) Abbreviation for Amazon Resource Name: a unique identifier for an AWS resource (like an S3 bucket, IAM role, or Lambda function).","zh":"（计算机，AWS）Amazon Resource Name 的缩写：用于唯一标识某个 AWS 资源（如 S3 存储桶、IAM 角色或 Lambda 函数）的标识符。"},"examples":[{"en":"To allow access, you must put the correct ARN in the policy.","zh":"要允许访问，你必须在策略里写入正确的 ARN。"},{"en":"The error message says the Lambda function ARN is invalid.","zh":"错误信息显示该 Lambda 函数的 ARN 无效。"}]},{"partOfSpeech":"n.","definition":{"en":"A male given name (used in several European languages; sometimes a short form of names like Arnold in some contexts).","zh":"男性名字（见于一些欧洲语言；在某些语境下也可能是 Arnold 等名字的简称）。"},"examples":[{"en":"Arn joined the team last month.","zh":"Arn 上个月加入了团队。"},{"en":"In the novel, Arn is portrayed as a quiet but brave character.","zh":"在小说中，Arn 被塑造成一个安静但勇敢的角色。"}]}],"synonyms":["Amazon Resource Name","resource identifier","AWS identifier"],"phonetic":"/ɑrn/","extraExplanation":["在 AWS 里，ARN 常见格式大致是：arn:partition:service:region:account-id:resource。不同服务的 resource 部分写法会不一样，所以复制时要特别注意是否包含 region、account-id、以及资源路径。","如果你想查的是动词 “earn（赚得）”，或是 “arm（手臂/武装）”，告诉我你想要的词和语境，我可以给出对应词条。"]}
{"word":"arna","summary":{"en":"“Arna” is most commonly a Nordic female name; it can also be a place name (e.g., in Norway) or an acronym whose meaning depends on context.","zh":"“Arna” 最常见是北欧地区的女性名字；也可能是地名（如挪威）或某些机构的缩写，含义需看语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a female given name, used especially in Iceland and other Nordic countries","zh":"女性名字，尤其常见于冰岛及其他北欧地区"},"examples":[{"en":"Arna is my classmate from Iceland.","zh":"Arna 是我来自冰岛的同学。"},{"en":"Arna said she loves hiking on weekends.","zh":"Arna 说她周末喜欢徒步。"}]},{"partOfSpeech":"other","definition":{"en":"a place name (for example, Arna is an area/borough of Bergen in Norway)","zh":"地名（例如：挪威卑尔根的一个区域/行政区叫 Arna）"},"examples":[{"en":"He lives in Arna, just outside central Bergen.","zh":"他住在 Arna，离卑尔根市中心不远。"}]},{"partOfSpeech":"other","definition":{"en":"an acronym used by different organizations; its meaning depends on the context","zh":"在不同机构中使用的缩写；具体含义取决于语境"},"examples":[{"en":"ARNA can mean different things in different fields, so check the full name in the document.","zh":"ARNA 在不同领域可能代表不同意思，所以要在文件里查看全称。"}]}],"phonetic":"/ˈɑrnə/","extraExplanation":["作为人名时，Arna 在北欧语境中较常见，常被认为与古诺尔斯语中表示“鹰”的词根有关，因此有时会被解释为带有“鹰”的意象（不同资料对来源细节说法略有差异）。","如果你是在某篇文章、学校/公司文件或网页上看到 “ARNA”，很可能是缩写；最可靠的方法是看它首次出现时有没有写出全称。你也可以把看到的句子发给我，我可以帮你判断具体意思。"]}
{"word":"Arnaeus","summary":{"en":"“Arnaeus” is not a standard English word; it is most likely a misspelling of **Araneus**, an orb-weaver spider genus.","zh":"“Arnaeus” 不是常见英语词；它很可能是 **Araneus**（圆网蛛属）的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A likely misspelling of **Araneus**, a scientific genus name for many common **orb-weaver spiders** (spiders that build round, wheel-shaped webs).","zh":"很可能是 **Araneus** 的拼写错误；**Araneus** 是一种常见的**圆网蛛（结圆形蜘蛛网的蜘蛛）**的属名。"},"examples":[{"en":"I think “Arnaeus” is a typo—**Araneus** is a genus of orb-weaver spiders.","zh":"我觉得 “Arnaeus” 可能是拼写错误——**Araneus** 是圆网蛛的一个属。"},{"en":"An **Araneus** spider rebuilt its orb web overnight.","zh":"一只 **Araneus** 的蜘蛛在夜里重新织好了圆网。"}]}],"synonyms":["Araneus","orb-weaver (common name)","garden spider (common name)"],"phonetic":"/əˈreɪniəs/","extraExplanation":["在生物学命名中，**Araneus** 属名来自拉丁语词根 *aranea*（“蜘蛛”）。因此它常被用于指代“结圆网的蜘蛛”这一类群。若你是在论文、标本标签或数据库里看到 “Arnaeus”，很常见的情况是录入或转写时把字母顺序写错了。","如果你方便的话，告诉我你看到这个词的上下文（比如一段句子、书名或网页截图），我也可以帮你确认它到底是拼写错误、专有名词，还是某个罕见的人名/地名。"]}
{"word":"Arnaldo","summary":{"en":"Arnaldo is a masculine given name and sometimes a surname.","zh":"Arnaldo 常用作男性名字，也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name), common in Spanish-, Italian-, and Portuguese-speaking cultures.","zh":"（男性）名字（名），在西班牙语、意大利语和葡萄牙语文化中较常见。"},"examples":[{"en":"Arnaldo is my uncle; he lives in Mexico City.","zh":"Arnaldo 是我叔叔，他住在墨西哥城。"},{"en":"Our new classmate, Arnaldo, speaks Spanish and English.","zh":"我们新同学 Arnaldo 会说西班牙语和英语。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"姓氏（家族姓）。"},"examples":[{"en":"The book was written by Maria Arnaldo.","zh":"这本书由 Maria Arnaldo 所著。"},{"en":"Mr. Arnaldo will join the meeting at 3 p.m.","zh":"Arnaldo 先生将于下午三点参加会议。"}]}],"synonyms":["Arnold","Arnaud","Arnaldo (variant spellings may exist by region)"],"phonetic":"/ɑrˈnɑldoʊ/","extraExplanation":["“Arnaldo”常被认为是“Arnold”的罗曼语系形式（如意大利语/西班牙语/葡萄牙语用法）。其词源与日耳曼语根有关，传统上可引申出“像鹰一样（arn-）+ 统治/力量（-wald）”的含义，因此在一些文化语境里带有“强壮、有力量”的名字印象。"]}
{"word":"Arnarson","summary":{"en":"Arnarson is a surname, usually Icelandic, meaning “son of Arnar.”","zh":"Arnarson 是一个姓氏，多见于冰岛，意思是“Arnar 的儿子”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), most commonly Icelandic, meaning “son of Arnar.”","zh":"（姓氏）常见于冰岛，意为“Arnar 的儿子”。"},"examples":[{"en":"Her last name is Arnarson, so she may have Icelandic roots.","zh":"她的姓是 Arnarson，所以她可能有冰岛背景。"},{"en":"In the credits, the director is listed as Jón Arnarson.","zh":"在演职员表里，导演写作 Jón Arnarson。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a patronymic-style last name used in the Icelandic naming system, indicating a person’s father is named Arnar.","zh":"（较少作为“词义”解释时）冰岛父称式姓氏的一种，表示此人的父亲名为 Arnar。"},"examples":[{"en":"In Iceland, a person named “Einar Arnarson” is literally “Einar, Arnar’s son.”","zh":"在冰岛，“Einar Arnarson”字面意思是“Einar，Arnar 的儿子”。"}]}],"phonetic":"/ˈɑːrnɑrˌsɑn/","extraExplanation":["这是典型的冰岛姓氏构词：Arnar + -son（儿子）。女性常见对应形式是 -dóttir（女儿）。因此在冰岛，“姓氏”往往更像是父称/母称标记，并不一定代代相传为同一个固定家族姓。","Arnar 在冰岛语中是男性名字，来源与“鹰”（arn）相关的词根，因此这个姓也常带有“鹰之子”的联想（文化联想层面，不是严格翻译）。"]}
{"word":"arnatta","summary":{"en":"Aratta is a legendary land from ancient Sumerian literature, famous for its wealth and distance.","zh":"Aratta（阿拉塔）是苏美尔古代文学中的传说国度，以遥远与富饶著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Aratta: a legendary, wealthy land mentioned in ancient Sumerian myths and epic poems, often described as a distant rival or trading partner of the city of Uruk.","zh":"阿拉塔（Aratta）：古代苏美尔神话与史诗中提到的传说之地，常被描绘为遥远而富饶的国度，常与乌鲁克（Uruk）发生竞争或往来。"},"examples":[{"en":"In Sumerian stories, Aratta is described as rich in precious stones and metals.","zh":"在苏美尔故事中，阿拉塔被描述为盛产宝石和金属的富饶之地。"},{"en":"Some scholars discuss Aratta when talking about early trade and imagination in Mesopotamian literature.","zh":"一些学者在讨论美索不达米亚文学中的早期贸易与想象时，会提到阿拉塔。"}]}],"synonyms":["legendary land","mythic kingdom"],"phonetic":"/əˈrɑtə/","extraExplanation":["“Aratta”多见于《恩美尔卡与阿拉塔之主》（Enmerkar and the Lord of Aratta）等苏美尔叙事作品，地理位置至今不确定；有人推测可能与伊朗高原一带有关，但仍属学术争议。","如果你输入的“arnatta”是拼写误差，最常见的对应词就是“Aratta”。也可能是某个品牌名、用户名或地名的特殊拼写；若你能提供一句原文语境，我可以帮你更准确判断。"]}
{"word":"arnatto","summary":{"en":"Annatto is a natural orange-red food coloring made from achiote (annatto) seeds.","zh":"Annatto 是从胭脂树（achiote）种子提取的天然橙红色食用色素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A natural orange-red coloring made from the seeds of the achiote tree, used especially to color foods like cheese, butter, and snacks.","zh":"一种从胭脂树（achiote）种子中提取的天然橙红色食用色素，常用于给奶酪、黄油和零食等食品上色。"},"examples":[{"en":"Some cheddar cheeses get their orange color from annatto rather than from aging.","zh":"有些切达奶酪的橙色来自胭脂树色素（annatto），而不是来自熟成过程。"},{"en":"The label lists “annatto extract” as a coloring agent.","zh":"配料表把“胭脂树提取物（annatto extract）”列为着色剂。"},{"en":"Many packaged snacks use annatto to create a warm yellow-orange color.","zh":"许多包装零食会用 annatto 来做出偏暖的黄橙色。"}]}],"synonyms":["achiote","annatto extract"],"phonetic":"/əˈnætoʊ/","extraExplanation":["Annatto 也常被写作“achiote”（更常见于拉美饮食语境），来源于胭脂树（Bixa orellana）的种子。它不仅用于上色，也会带一点温和、微胡椒/坚果感的风味（因做法与用量而异）。","在食品标签上可能出现的相关词包括：annatto、annatto extract、achiote、bixin（主要色素之一）。对少数人来说可能引发过敏或不耐受，但总体被视为常见的天然食用色素来源。"]}
{"word":"arnattos","summary":{"en":"Annatto is a natural orange-red coloring (and mild flavoring) made from achiote seeds, often used in foods like rice and cheese.","zh":"Annatto（胭脂树红）是由胭脂树种子制成的天然橘红色食用色素（也可作轻微调味），常用于米饭、奶酪等食品上色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A natural orange-red food coloring and flavoring made from the seeds of the achiote tree, used especially in Latin American and Caribbean cooking.","zh":"胭脂树红（annatto）：由胭脂树（achiote）种子制成的天然橘红色食用色素/调味料，常用于拉丁美洲与加勒比地区料理。"},"examples":[{"en":"The recipe uses annatto to give the rice a bright orange color.","zh":"这道食谱用胭脂树红把米饭染成鲜亮的橘色。"},{"en":"Many cheeses get their yellow-orange color from annatto.","zh":"很多奶酪的黄橙色来自胭脂树红。"}]}],"synonyms":["achiote","annatto extract","natural food coloring"],"phonetic":"/əˈnætoʊ/","extraExplanation":["你输入的“arnattos”很可能是拼写错误；常见正确拼写是“annatto”（单数/不可数名词），也有人写作“anatto”。","annatto 在配料表里常见，作为天然色素使用；有时也会带来轻微的坚果/胡椒样风味，但多数情况下主要作用是上色。","来源文化上与美洲原住民及拉丁美洲饮食传统有关；在一些菜里会与酸橙、蒜、孜然等一起做成腌料或调味油。"]}
{"word":"Arnaud","summary":{"en":"Arnaud is a French male first name (related to Arnold).","zh":"Arnaud 是一个法语男性名字（与 Arnold 同源）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name, common in French-speaking countries; a French form of “Arnold.”","zh":"男性名字，常见于法语国家；相当于英文名 Arnold 的法语形式。"},"examples":[{"en":"Arnaud is a popular name in France and parts of Switzerland.","zh":"Arnaud 在法国以及瑞士部分地区是比较常见的名字。"},{"en":"I met Arnaud at a conference in Paris.","zh":"我在巴黎的一场会议上认识了 Arnaud。"}]}],"synonyms":["Arnold"],"phonetic":"/ɑrˈnoʊ/","extraExplanation":["“Arnaud”主要来自古日耳曼语系名字（与 Arnold 同源），常被解释为与“鹰（eagle）”和“统治/力量（rule/power）”相关的含义，因此有时会被解读为“像鹰一样强大/有领导力”。不过在英语日常使用中，它通常只是被当作人名，不会刻意强调字面含义。","在英文语境里，作为人名通常不需要加冠词（不说 *the Arnaud*）。书写时首字母大写：Arnaud。称呼陌生人时更常用 Mr./Ms. + 姓氏，而不是直接用名字，除非对方允许。"]}
{"word":"Arnaudville","summary":{"en":"Arnaudville is a town in Louisiana, USA, associated with Cajun/Creole culture and French heritage.","zh":"Arnaudville 是美国路易斯安那州的一个小镇，常与卡津/克里奥尔文化及法语传统联系在一起。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small town in St. Landry Parish, Louisiana, USA, known for Cajun and Creole culture and French heritage.","zh":"美国路易斯安那州圣兰德里教区的一个小镇，以卡津（Cajun）与克里奥尔（Creole）文化和法语传统闻名。"},"examples":[{"en":"Arnaudville sits along Bayou Teche in south Louisiana.","zh":"阿尔诺维尔位于路易斯安那州南部的泰什河湾（Bayou Teche）沿岸。"},{"en":"She visited Arnaudville to experience Cajun music and local food.","zh":"她去阿尔诺维尔体验卡津音乐和当地美食。"},{"en":"Arnaudville hosts community arts events throughout the year.","zh":"阿尔诺维尔全年都会举办社区艺术活动。"}]}],"synonyms":["(No direct synonyms; it is a place name.)"],"phonetic":"/ɑrˈnoʊdˌvɪl/","extraExplanation":["“Arnaudville”是专有名词（地名），通常不翻译，也不加复数。写作时首字母大写。","发音上常见重音在第二个音节（-naud-）附近；当地（路易斯安那）口音可能与标准美式读法略有差异。","该地区与“阿卡迪亚纳（Acadiana）”文化圈相关，常与卡津法语、传统音乐（如zydeco）与地方饮食联系在一起。"]}
{"word":"Arnauld","summary":{"en":"Arnauld is a French name, most often a surname, used to refer to someone named Arnauld.","zh":"Arnauld 是一个法语名字，通常为姓氏，用来指名为 Arnauld 的人。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A French name (usually a surname, sometimes a given name), used to refer to a person named Arnauld.","zh":"一个法语名字（通常是姓氏，有时也作名字），用来指名为 Arnauld 的人。"},"examples":[{"en":"Blaise Pascal argued with Antoine Arnauld about religion and philosophy.","zh":"布莱兹·帕斯卡曾与安托万·阿尔诺（Antoine Arnauld）就宗教与哲学问题辩论。"},{"en":"I met Dr. Arnauld at the conference in Paris.","zh":"我在巴黎的会议上见到了 Arnauld 医生。"}]}],"synonyms":["Arnaud (variant spelling)","Arnold (related but different name)"],"phonetic":"/ɑɹˈnoʊ/","extraExplanation":["Arnauld 常见于法国历史与思想史语境，最有名的用法之一是指 17 世纪的神学家与哲学家 Antoine Arnauld（安托万·阿尔诺），与“詹森主义（Jansenism）”及波尔-罗亚尔（Port-Royal）学派有关。","拼写上 Arnauld 与 Arnold/Arnaud 相近，但语言与来源不同：Arnold 更常见于英语/德语传统；Arnaud/Arnauld 属于法语姓名系统中的常见变体。","在英文写作中它通常作为专有名词使用：首字母大写；前面可加 Mr./Ms./Dr. 等称谓；复数一般不用于指“很多个 Arnauld”，而会说 “the Arnauld family”（阿尔诺一家）等。"]}
{"word":"Arnaut","summary":{"en":"Arnaut is an old historical word for an Albanian person, especially an Albanian soldier/mercenary in Ottoman contexts; it can also be a personal name or surname.","zh":"Arnaut 是指“阿尔巴尼亚人”的历史旧称，常特指奥斯曼语境中的阿尔巴尼亚士兵/雇佣兵；也可作人名或姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) An Albanian person; especially an Albanian soldier or mercenary in the Ottoman period (an older term used in Balkan/Ottoman contexts).","zh":"（历史用语）阿尔巴尼亚人；尤指奥斯曼时期的阿尔巴尼亚士兵/雇佣兵（巴尔干与奥斯曼语境中的旧称）。"},"examples":[{"en":"In some 19th‑century travel writing, “Arnauts” are described as Albanian guards in the Ottoman Empire.","zh":"在一些19世纪的游记里，“Arnauts”常被描述为奥斯曼帝国中的阿尔巴尼亚卫兵。"},{"en":"The fortress was protected by Arnaut mercenaries hired by a local ruler.","zh":"这座要塞由当地统治者雇佣的阿尔巴尼亚雇佣兵（Arnaut）守卫。"}]},{"partOfSpeech":"n.","definition":{"en":"A masculine given name or surname (less common; appears in European contexts).","zh":"男性名字或姓氏（较少见；可见于一些欧洲语境）。"},"examples":[{"en":"Arnaut is also used as a family name in parts of Europe.","zh":"Arnaut 在欧洲一些地区也用作姓氏。"}]}],"synonyms":["Albanian","Arnavut"],"phonetic":"/ɑrˈnoʊt/","extraExplanation":["“Arnaut”源自奥斯曼土耳其语（Arnavut），原本就是“阿尔巴尼亚人”的称呼。在英语史料里常出现在巴尔干、奥斯曼帝国、雇佣兵与地方武装等语境中。","由于它带有特定时代与外部称呼的色彩，现代英语中更常直接说 “Albanian”。在某些历史文本里该词可能带有刻板印象或轻蔑意味，阅读时要注意语境与作者立场。","你可能也会在文学/历史中见到类似专名：中世纪普罗旺斯吟游诗人 Arnaut Daniel（“Arnaut”作为人名的一例）。"]}
{"word":"arnaut","summary":{"en":"Arnaut is a historical term for an Albanian person (Ottoman-era usage) and can also be a personal name in historical/literary contexts.","zh":"Arnaut 既可作历史用语指“阿尔巴尼亚人”（多见于奥斯曼时期语境），也可作人名/姓氏，常见于历史或文学材料中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) An Albanian person, especially as referred to in the Ottoman Balkans (often spelled “Arnaut” or “Arnaut(e)”).","zh":"（历史用语）指阿尔巴尼亚人，尤其是在奥斯曼时期巴尔干地区对阿尔巴尼亚人的称呼（常拼作 Arnaut/Arnaute）。"},"examples":[{"en":"In some older travel writings, Albanians were called “Arnauts.”","zh":"在一些较早的游记或旅行记中，阿尔巴尼亚人常被称为“Arnauts（Arnaut）”。"},{"en":"The term “Arnaut” appears in Ottoman-era contexts and may feel old-fashioned today.","zh":"“Arnaut”多出现在奥斯曼时代语境中，如今读起来往往带有陈旧感。"}]},{"partOfSpeech":"n.","definition":{"en":"A male given name and surname used in some cultures; also seen as a historical/literary name (e.g., in medieval European contexts).","zh":"用作男性名字或姓氏；也可见于某些历史/文学语境中的人名（如中世纪欧洲相关人物）。"},"examples":[{"en":"Arnaut is sometimes used as a personal name in literature and historical records.","zh":"Arnaut 有时会作为人名出现在文学作品和历史记录中。"},{"en":"Some readers first meet the name through medieval poetry and troubadour references.","zh":"有些读者最初是在中世纪诗歌与吟游诗人相关材料中接触到这个名字。"}]}],"synonyms":["Albanian (modern term)","Arnavut (Turkish form)"],"phonetic":"/ɑrˈnaʊt/","extraExplanation":["“Arnaut”源自土耳其语 Arnavut（阿尔巴尼亚人）。在英语与法语等语言的旧文献中可见该写法，但现代英语更常用 “Albanian”。如果在阅读中遇到该词，注意它可能带有特定历史语境，甚至可能被当作带有时代偏见的旧称呼。","在文学/文化史里也常见“Arnaut Daniel”（阿尔诺·丹尼尔），他是12世纪著名的普罗旺斯语吟游诗人，以复杂的诗体与押韵技巧闻名；但这属于专名用法，含义与“阿尔巴尼亚人”无关。"]}
{"word":"Arnavut","summary":{"en":"“Arnavut” is Turkish for “Albanian,” used as a noun (a person) or an adjective (Albanian-related).","zh":"“Arnavut”是土耳其语，意为“阿尔巴尼亚人/阿尔巴尼亚的”，可作名词或形容词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an Albanian person; an Albanian (used especially in Turkish).","zh":"阿尔巴尼亚人；阿尔巴尼亚人（多用于土耳其语中）。"},"examples":[{"en":"In Turkish, “Arnavut” means “Albanian.”","zh":"在土耳其语里，“Arnavut”意思是“阿尔巴尼亚人”。"},{"en":"He said his grandfather was an Arnavut from the Balkans.","zh":"他说他的祖父是来自巴尔干地区的阿尔巴尼亚人（Arnavut）。"}]},{"partOfSpeech":"adj.","definition":{"en":"Albanian (describing people, language, or culture).","zh":"阿尔巴尼亚的（用于形容人、语言或文化；多见于土耳其语语境）。"},"examples":[{"en":"They served Arnavut dishes at the festival.","zh":"他们在节日上供应阿尔巴尼亚风味（Arnavut）的菜肴。"},{"en":"She’s learning Arnavut music traditions.","zh":"她在学习阿尔巴尼亚（Arnavut）的音乐传统。"}]}],"synonyms":["Albanian"],"phonetic":"/ɑɾnɑˈvut/","extraExplanation":["“Arnavut”是土耳其语中对“阿尔巴尼亚人/阿尔巴尼亚的”的常用称呼，英语里通常对应“Albanian”。在奥斯曼帝国历史语境中也常出现该词，用来指巴尔干地区的阿尔巴尼亚族群。","在土耳其饮食文化里你可能会看到相关搭配，如“Arnavut ciğeri”（字面“阿尔巴尼亚式肝”，一种常见小吃/菜名）。"]}
{"word":"arnberry","summary":{"en":"Cranberry is a small sour red berry often used in juice and sauces, especially in North America.","zh":"Cranberry（蔓越莓）是一种偏酸的红色小浆果，常用于果汁和酱汁，在北美尤其常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, sour red berry used in cooking, drinks, and sauces (often grown in wet fields called bogs)","zh":"蔓越莓；一种小而偏酸的红色浆果，常用于烹饪、饮料和酱汁（常种植在称为“沼泽田”的湿地中）"},"examples":[{"en":"We usually eat cranberry sauce with turkey on Thanksgiving.","zh":"感恩节时我们通常会配火鸡吃蔓越莓酱。"},{"en":"She drank a glass of cranberry juice.","zh":"她喝了一杯蔓越莓汁。"},{"en":"This muffin has cranberries and orange zest.","zh":"这个玛芬里有蔓越莓和橙皮屑。"}]}],"synonyms":["lingonberry (similar berry, not the same)","berry (general)"],"phonetic":"/ˈkrænˌbɛri/","extraExplanation":["你输入的 **“arnberry”** 不是常见英语单词，最可能是拼写成了 **cranberry**（蔓越莓）。","在北美文化里，蔓越莓常和感恩节餐桌联系在一起（比如 cranberry sauce）。另外，英语里有个有趣的说法 **“cranberry”** 有时被用来指“只有在某个固定搭配里才常出现的词”，比如 **cranberry sauce** 里的 *cranberry*。"]}
{"word":"Arndt","summary":{"en":"Arndt is mainly a German surname (and sometimes a given name), also appearing in names of people, places, or named rules/theories.","zh":"Arndt 主要是德国姓氏（有时也作名字），也常出现在人名、地名或以人名命名的规则/理论中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a German surname (family name); also used as a given name, especially in German-speaking countries.","zh":"德国姓氏（家族姓）；也可作名字使用，常见于德语国家。"},"examples":[{"en":"Her last name is Arndt, so people often ask if she has German roots.","zh":"她的姓是 Arndt，所以人们常问她是否有德国血统。"},{"en":"Professor Arndt will present the research findings today.","zh":"Arndt 教授今天将展示研究成果。"}]},{"partOfSpeech":"n.","definition":{"en":"a name seen in titles of people, places, or theories (e.g., named after someone called Arndt).","zh":"常出现在人名、地名或理论名称中（例如以名为 Arndt 的人物命名）。"},"examples":[{"en":"The paper mentions the Arndt–Schulz rule in physiology.","zh":"这篇论文提到了生理学中的 Arndt–Schulz 规律。"},{"en":"I found an article by Arndt in a German history journal.","zh":"我在一本德国历史期刊里找到一篇 Arndt 写的文章。"}]}],"synonyms":["(no direct synonyms; it is a proper name)"],"phonetic":"/ɑrnt/","extraExplanation":["“Arndt”多见于德语语境，来源与古日耳曼人名有关，常被认为与“Arnold（阿诺德）”等名字同源或近似，但拼写与发音不同。","学习时可注意不要与“Arendt（阿伦特/阿伦特）”混淆：两者是不同的姓氏（例如哲学家 Hannah Arendt）。","读音上英语里通常把它读成 /ɑrnt/（一个音节），中间的 d 往往不明显。"]}
{"word":"Arne","summary":{"en":"Arne is a Scandinavian male name and can also be a surname.","zh":"Arne 常见于北欧的男性名字，也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name, most common in Norway and other Scandinavian countries","zh":"（男子名）阿尔内；在挪威等斯堪的纳维亚国家较常见的男性名字"},"examples":[{"en":"Arne is from Norway, but he lives in Seattle now.","zh":"阿尔内来自挪威，但他现在住在西雅图。"},{"en":"I met Arne at a language exchange event.","zh":"我在一次语言交流活动上认识了阿尔内。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname) in some countries","zh":"（姓氏）阿尔内；在一些国家也可作姓"},"examples":[{"en":"Ms. Arne will lead today’s meeting.","zh":"阿尔内女士将主持今天的会议。"}]}],"phonetic":"/ˈɑɹni/","extraExplanation":["“Arne”常被认为源自古诺尔斯语相关词根，常见解释与“鹰（eagle）”有关，因此在北欧文化中带有自然与力量的联想。","英语里把它当作专有名词使用：通常首字母大写；称呼时可直接说“Arne”，更正式时可加上Mr./Ms./Dr.。","文化小知识：英国作曲家Thomas Arne（托马斯·阿尔内）因《Rule, Britannia!》等作品而知名；丹麦建筑师Arne Jacobsen（阿尔内·雅各布森）在现代设计领域影响很大。"]}
{"word":"arne","summary":{"en":"Arne is mainly a Scandinavian male first name, and it can also be a surname.","zh":"Arne 主要是源自斯堪的纳维亚的男性名，也可作姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A masculine given name, originally from Scandinavia (especially Norwegian and Swedish).","zh":"男性名字，源自斯堪的纳维亚地区（尤其常见于挪威和瑞典）。"},"examples":[{"en":"Arne lives in Oslo and works as a designer.","zh":"Arne 住在奥斯陆，是一名设计师。"},{"en":"Our new classmate is named Arne.","zh":"我们新来的同学叫 Arne。"}]},{"partOfSpeech":"other","definition":{"en":"A surname (family name) in some countries.","zh":"在一些国家也可作姓氏（家族姓）。"},"examples":[{"en":"Professor Arne will speak at the conference.","zh":"Arne 教授将在会议上发言。"}]}],"phonetic":"/ˈɑr.nə/","extraExplanation":["“Arne”常被认为与古北欧语名字有关，和“鹰（arn）”等意象有联系（不同地区解释略有差异）。","在英语环境中，这个名字的读法可能会被英语习惯影响；在北欧语境里通常更接近“两音节”的读法。"]}
{"word":"Arneb","summary":{"en":"Arneb: the brightest star in Lepus (Alpha Leporis).","zh":"Arneb：天兔座最亮的恒星（天兔座α星）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A bright star (Alpha Leporis) in the constellation Lepus (the Hare).","zh":"（天文学）位于天兔座（Lepus，意为“野兔”）的亮星：天兔座α星（Alpha Leporis）。"},"examples":[{"en":"Arneb is the brightest star in the constellation Lepus.","zh":"Arneb 是天兔座中最亮的恒星。"},{"en":"In a winter sky guide, Arneb is often mentioned near Orion and its neighboring constellations.","zh":"在冬季星空指南中，Arneb 常被提到，位置在猎户座及其附近星座周边。"}]}],"phonetic":"ˈɑrnəb","extraExplanation":["Arneb 是一颗恒星的专名（传统星名），常见于星图、天文科普与导航语境。","名称源自阿拉伯语“arnab”（意为“野兔”），与星座 Lepus（天兔座）的形象对应。"]}
{"word":"arneb","summary":{"en":"Arneb is the traditional name of Alpha Leporis, a star in the constellation Lepus.","zh":"Arneb 是天兔座α（Alpha Leporis）的传统名称，是天兔座中的一颗恒星。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a star (Alpha Leporis) in the constellation Lepus, traditionally known by the proper name Arneb","zh":"（天文学）天兔座α（大星），天兔座中一颗恒星，传统专名为 Arneb"},"examples":[{"en":"Arneb is one of the brighter stars in the constellation Lepus.","zh":"Arneb 是天兔座（Lepus）里较亮的恒星之一。"},{"en":"On a clear winter night, you may be able to spot Arneb below Orion.","zh":"在晴朗的冬夜，你可能在猎户座（Orion）下方找到 Arneb。"}]}],"synonyms":["Alpha Leporis"],"phonetic":"/ˈɑr.nɛb/","extraExplanation":["Arneb 这个名字来自阿拉伯语“الأرنب (al-arnab)”，意思是“野兔/兔子”，与它所在的星座 Lepus（拉丁语“兔子”）相呼应。","在现代天文学命名中，Arneb 也常用其拜耳命名“Alpha Leporis”表示。"]}
{"word":"Arnebia","summary":{"en":"Arnebia is a plant genus (borage family) known for species used in traditional medicine and red natural dyes.","zh":"Arnebia 指紫草科的一个植物属，其中一些物种因传统药用和红色天然染料而为人所知。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants in the borage family (Boraginaceae), found mainly in parts of Asia and the Middle East; some species are used in traditional medicine and as natural dyes.","zh":"阿尔内比亚属（紫草科）的一类开花植物，主要分布于亚洲及中东部分地区；其中一些物种可用于传统药用或天然染料。"},"examples":[{"en":"Researchers studied Arnebia species for their red pigments used in natural dyes.","zh":"研究人员研究了阿尔内比亚属植物，关注其可用于天然染料的红色色素。"},{"en":"In some traditional remedies, Arnebia root has been used to support skin healing.","zh":"在一些传统疗法中，阿尔内比亚属植物的根曾被用于帮助皮肤修复。"}]}],"synonyms":["a plant genus (Boraginaceae)"],"phonetic":"/ɑrˈniːbiə/","extraExplanation":["“Arnebia”是植物学拉丁学名（属名），在英文里通常首字母大写并用斜体书写（Arnebia）。口语或一般写作中也常不加斜体。","部分物种（如 Arnebia euchroma）在中亚与西藏等地区较常见，其根部可提取红色系萘醌类色素（常被称为 arnebins），用于染色或研究用途。","在中文语境中，它与“紫草”（Lithospermum/Arnebia 等相关植物在民间应用上容易被并提或混用）可能会产生混淆；学术写作最好同时注明具体物种名以避免歧义。"]}
{"word":"arnebia","summary":{"en":"Arnebia is a genus of borage-family flowering plants, known in science and sometimes for red dye/traditional uses.","zh":"Arnebia 指紫草科阿恩比亚属植物，多见于科学语境，部分物种与红色染料/传统用途相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants in the borage family (Boraginaceae), found mainly in dry regions of Asia and the Mediterranean; some species are valued for their red dye and traditional medicinal uses.","zh":"阿恩比亚属（紫草科）开花植物的一属，主要分布在亚洲与地中海地区的干旱环境；部分物种因可提取红色染料并用于传统草药而受到重视。"},"examples":[{"en":"Researchers studied Arnebia species to identify the pigments responsible for their red color.","zh":"研究人员分析了阿恩比亚属植物，以找出造成其红色的色素成分。"},{"en":"In some traditional practices, extracts from Arnebia roots have been used on the skin.","zh":"在一些传统做法中，人们会把阿恩比亚属植物根部的提取物用于皮肤护理。"}]}],"synonyms":["(no common everyday synonym; scientific name: Arnebia)"],"phonetic":"ɑrˈniːbiə","extraExplanation":["“Arnebia”是拉丁化的植物学属名，通常在科学写作中首字母大写（Arnebia），斜体书写更常见。日常英语里不算常用词，多出现在植物学、药用植物或天然染料相关语境。","阿恩比亚属中有些物种与“紫草”类植物在用途上相近，可能涉及天然红色染料（如紫草素类成分）。不过具体功效与安全性需以可靠资料与专业建议为准，避免自行内服或用于破损皮肤。"]}
{"word":"arnee","summary":{"en":"An arnee is a wild Asian water buffalo.","zh":"arnee 指“野生亚洲水牛”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wild Asian water buffalo (scientific name: Bubalus arnee), considered the wild ancestor of the domestic water buffalo","zh":"野生亚洲水牛（学名：Bubalus arnee），被认为是家养水牛的野生祖先"},"examples":[{"en":"The arnee lives in wetlands and river plains in South Asia.","zh":"野生亚洲水牛（arnee）生活在南亚的湿地与河流平原。"},{"en":"Conservationists are working to protect the arnee from habitat loss.","zh":"保育人士正在努力保护野生亚洲水牛（arnee），以免其栖息地持续流失。"}]}],"synonyms":["wild water buffalo","Asian wild buffalo"],"phonetic":"/ˈɑrni/","extraExplanation":["“arnee”多见于动物学、自然纪录片或较正式的书面语中，日常英语里更常说“wild water buffalo（野生水牛）”。","该词在一些资料中也会写作“arní/arni”等拼写变体；在非专业语境中容易被误认成英文人名“Arnie”。"]}
{"word":"Arnegard","summary":{"en":"Arnegard is mainly used as the name of a small town in North Dakota; it can also be a surname.","zh":"Arnegard 主要是北达科他州一个小镇的地名；也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small town in McKenzie County, North Dakota, USA.","zh":"美国北达科他州麦肯齐县的一个小镇（地名）。"},"examples":[{"en":"Arnegard is a small community in western North Dakota.","zh":"阿内加德（Arnegard）是北达科他州西部的一个小社区。"},{"en":"She drove through Arnegard on her way to Watford City.","zh":"她在去沃特福德城（Watford City）的路上开车经过了阿内加德。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname), less common than the place name.","zh":"姓氏（较少见），通常不如地名用得多。"},"examples":[{"en":"Mr. Arnegard spoke at the local meeting.","zh":"阿内加德先生在当地会议上发言。"}]}],"synonyms":["(no direct synonyms; proper noun)"],"phonetic":"/ˈɑr.nə.ɡɑrd/","extraExplanation":["“Arnegard”在英语里最常见的用法是专有名词（地名）。它位于北达科他州的巴肯（Bakken）地区附近，因此在一些新闻或报道中可能会与石油开发、人口流动等话题一起出现。","发音上重音通常落在第一个音节 AR-，后面的 -gard 读作 /ɡɑrd/（类似“guard”的 /gɑrd/ 但这里是 -gard）。"]}
{"word":"Arnel","summary":{"en":"Arnel is mainly used as a personal name; historically it can also refer to a (now uncommon) fabric brand name.","zh":"Arnel 主要用作人名；在历史语境中也可指一种（现较少见的）面料商标名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A given name (first name), used for people; also used as a family name in some cultures.","zh":"人名（名字），也可作姓氏（在某些文化中使用）。"},"examples":[{"en":"Arnel is my cousin; he lives in Seattle now.","zh":"Arnel 是我表弟；他现在住在西雅图。"},{"en":"I met Arnel at a conference, and we worked on the project together.","zh":"我在一次会议上认识了 Arnel，我们一起做了那个项目。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical) A brand name for a type of man‑made fabric/fiber (often acetate/triacetate), used in clothing; now uncommon.","zh":"（历史用法）一种人造纤维/面料的商标名（常与醋酸纤维/三醋酸纤维相关），用于服装；现在较少见。"},"examples":[{"en":"The vintage label says the dress is made of Arnel.","zh":"这件复古衣服的标签写着面料是 Arnel。"},{"en":"Arnel fabrics were popular in mid‑20th‑century clothing.","zh":"在20世纪中期，Arnel 面料在服装中曾很流行。"}]}],"phonetic":"/ɑrˈnɛl/","extraExplanation":["“Arnel”在英语里最常见的功能是专有名词（人名）。在菲律宾等地也较常见；例如歌手 Arnel Pineda（乔尼乐队 Journey 的主唱之一）让这个名字更为人熟知。","作为面料商标的“Arnel”多出现在旧衣物标签或复古语境中；现代英语里更常直接说 acetate / triacetate（醋酸纤维/三醋酸纤维）而不是用该商标名。"]}
{"word":"Arnelle","summary":{"en":"Arnelle is primarily used as a personal (given) name, often for women.","zh":"Arnelle 主要用作个人名字（常见为女性名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (usually feminine) of modern usage; a personal name.","zh":"人名（多为女性名）的现代用法；用作个人名字。"},"examples":[{"en":"Arnelle introduced herself at the start of the meeting.","zh":"Arnelle 在会议开始时做了自我介绍。"},{"en":"I met Arnelle through a mutual friend.","zh":"我通过共同的朋友认识了 Arnelle。"}]}],"synonyms":["Arnelle (variant spellings may exist as names, e.g., Arnell, Arnel)"],"phonetic":"/ɑrˈnɛl/","extraExplanation":["“Arnelle”通常被当作专有名词（人名）使用，因此在字典里常见的不是“词义”，而是“名字信息”。","发音在不同地区可能略有差异：有的人会把重音放在第二音节（ar-NELL），也有人读得更平均。","如果你是在某本书、电影字幕或社交媒体上看到这个名字，它很可能指具体人物；在正式写作中首字母需要大写：Arnelle。"]}
{"word":"arnement","summary":{"en":"Armament means weapons and military equipment, or sometimes a country’s military strength.","zh":"Armament 指武器与军事装备；有时也指一国的军备力量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Weapons and military equipment (guns, missiles, tanks, etc.).","zh":"武器与军事装备（如枪支、导弹、坦克等）。"},"examples":[{"en":"The treaty limits the armament each country can produce.","zh":"该条约限制各国可生产的武器装备数量。"},{"en":"The ship was equipped with modern armament.","zh":"这艘船配备了现代化武器装备。"}]},{"partOfSpeech":"n.","definition":{"en":"A country’s military forces or overall military strength (less common).","zh":"（较不常用）一国的军备力量/军事力量。"},"examples":[{"en":"The nation expanded its armament during the conflict.","zh":"冲突期间，该国扩充了军备力量。"}]}],"synonyms":["weapons","arms","military equipment","munitions","arsenal"],"phonetic":"/ˈɑrməmənt/","extraExplanation":["你输入的“arnement”通常是拼写错误，更常见的正确拼写是 **armament**（少了一个“r”，多了一个“m”）。","词源上与 *arm*（武装、武器）有关；在新闻与历史语境中常见于 **arms race（军备竞赛）**、**disarmament（裁军）** 这类搭配。"]}
{"word":"Arnett","summary":{"en":"Arnett is mainly an English surname; it can also be a less-common first name.","zh":"Arnett 主要是英文姓氏；也可作较少见的名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), used for people’s last names","zh":"姓氏（家族姓），用作人的英文“姓”"},"examples":[{"en":"Her last name is Arnett.","zh":"她的姓是 Arnett。"},{"en":"Mr. Arnett will lead the meeting today.","zh":"Arnett 先生今天将主持会议。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name (first name), less common","zh":"名字（英文名），较少见"},"examples":[{"en":"Arnett is his first name.","zh":"Arnett 是他的名字。"}]}],"phonetic":"/ɑrˈnɛt/","extraExplanation":["“Arnett”在英语里最常见的是姓氏。它也可能被用作名字，但相对少见。","在文化语境中，许多人会因为演员 Will Arnett（威尔·阿奈特）而熟悉这个姓；在日常交流中，如果不确定对方是名还是姓，可以礼貌询问：“Is Arnett your first or last name?”（Arnett 是你的名还是姓？）"]}
{"word":"Arney","summary":{"en":"Arney is usually a personal or family name, sometimes a variant of Arnie (nickname of Arnold).","zh":"Arney 通常是人名或姓氏；有时是 Arnie（Arnold 的昵称）的变体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a name used as a given name or surname (family name), sometimes a variant spelling of “Arnie,” a nickname for “Arnold.”","zh":"一个人名或姓氏；有时是“Arnie”的变体拼写，而“Arnie”常作“Arnold”的昵称。"},"examples":[{"en":"Arney is my classmate’s last name.","zh":"Arney 是我同学的姓。"},{"en":"Some people spell the nickname as Arney instead of Arnie.","zh":"有些人会把这个昵称拼作 Arney，而不是 Arnie。"}]}],"synonyms":["Arnie","Arnold"],"phonetic":"/ˈɑrni/","extraExplanation":["“Arney”不是最常见的英文名拼写，更常见的是“Arnie”（常见于口语昵称）以及“Arnold”（正式名）。","如果你是在书名、人名、地名或品牌里看到“Arney”，它很可能是专有名词，具体含义要看上下文（例如指某个人或某个家族）。"]}
{"word":"Arnhem","summary":{"en":"Arnhem is a city in the eastern Netherlands and the capital of Gelderland.","zh":"Arnhem 指荷兰东部城市阿纳姆，是海尔德兰省省会。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in the eastern Netherlands, the capital of the province of Gelderland.","zh":"荷兰东部城市阿纳姆（Arnhem），海尔德兰省（Gelderland）的省会。"},"examples":[{"en":"Arnhem is known for its parks and green spaces.","zh":"阿纳姆以公园和绿地闻名。"},{"en":"She took a train from Amsterdam to Arnhem.","zh":"她从阿姆斯特丹坐火车到阿纳姆。"}]}],"phonetic":"/ˈɑr.nəm/","extraExplanation":["阿纳姆在英语语境中常与二战的“市场花园行动”（Operation Market Garden, 1944）联系在一起，尤其是“阿纳姆桥”（Arnhem Bridge）。相关表达如：a bridge too far（一步太远/目标过高），源于这次行动的叙事标题与大众文化传播。"]}
{"word":"Arni","summary":{"en":"Arni is usually a proper noun: a male given name (often Icelandic) or a place name (notably a town in Tamil Nadu, India).","zh":"Arni 通常是专有名词：可作男性名字（常见于冰岛），也可作地名（尤其指印度泰米尔纳德邦的城镇 Arni）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a masculine given name (common in Iceland and used elsewhere).","zh":"男性名字（在冰岛很常见，也用于其他地区）。"},"examples":[{"en":"Arni is an Icelandic name, so people may ask how to spell it.","zh":"Arni 是一个冰岛名字，所以别人可能会问怎么拼写。"},{"en":"Arni introduced himself and said his name is pronounced with two syllables.","zh":"Arni 自我介绍说他的名字是两个音节。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name; especially Arni, a town in Tamil Nadu, India.","zh":"地名；尤其指印度泰米尔纳德邦的城镇 Arni。"},"examples":[{"en":"She traveled from Chennai to Arni by road.","zh":"她从金奈坐车前往 Arni。"},{"en":"Arni is known locally for markets and regional life in Tamil Nadu.","zh":"在当地，Arni 以集市和泰米尔纳德邦的地域生活氛围为人所知。"}]}],"synonyms":["(as a name) Árna/Árni (spelling variants)","(as a related name) Arne"],"phonetic":"ˈɑrni","extraExplanation":["“Arni”作人名时常被认为来自古诺尔斯语（Old Norse）词根，与“eagle（鹰）”相关，因此在北欧语境里有一定传统色彩。","在英文写作中它通常作为专有名词使用：人名/地名首字母大写（Arni）。如果写成小写“arni”，多半是拼写错误或来自其他语言的转写。"]}
{"word":"arni","summary":{"en":"“Arni/ARNI” is most commonly a medical acronym for a heart-failure drug class; it can also be a personal name.","zh":"“Arni/ARNI”最常见是医学缩略词，指治疗心衰的一类药物；也可以是人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medicine) An angiotensin receptor–neprilysin inhibitor: a type of heart-failure medicine (for example, sacubitril/valsartan) that helps the heart work better.","zh":"（医学）血管紧张素受体-脑啡肽酶抑制剂：一种用于心力衰竭的药物类型（如沙库巴曲/缬沙坦），可帮助心脏更有效地工作。"},"examples":[{"en":"The cardiologist prescribed an ARNI to reduce the patient’s heart-failure symptoms.","zh":"心脏科医生开了ARNI来减轻患者的心衰症状。"},{"en":"Some people need blood-pressure checks after starting an ARNI.","zh":"有些人开始使用ARNI后需要监测血压。"}]},{"partOfSpeech":"n.","definition":{"en":"A given name (a personal name), used in several cultures; it can be a short form or a standalone name.","zh":"人名（名）：在多种文化中使用，可能是简称，也可能是独立名字。"},"examples":[{"en":"Arni introduced himself at the meeting.","zh":"Arni在会议上做了自我介绍。"},{"en":"I met someone named Arni from Iceland.","zh":"我认识一位来自冰岛、名叫Arni的人。"}]}],"synonyms":["(medicine) angiotensin receptor–neprilysin inhibitor","(medicine) sacubitril/valsartan (example)"],"phonetic":"ˈɑrni","extraExplanation":["在英文医疗语境里，ARNI通常写成全大写（ARNI），属于缩略词；在日常生活中若写作Arni/arni，更常被理解为人名。","如果你是在读药品说明、心衰指南或处方单看到ARNI，它几乎一定指这类药物（常见代表是sacubitril/valsartan）。"]}
{"word":"arnica","summary":{"en":"Arnica is a yellow-flowered plant and a common ingredient in topical products for bruises and soreness.","zh":"Arnica（山金车/阿尼卡）是一种黄花植物，也常指用于淤青与酸痛的外用制剂成分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant (Arnica) with yellow, daisy-like flowers, whose extracts are commonly used in creams or gels to help reduce bruising, swelling, and muscle soreness (usually applied to the skin).","zh":"一种开黄色菊状花的植物（山金车/阿尼卡），其提取物常用于乳膏或凝胶，通常外用以帮助减轻淤青、肿胀和肌肉酸痛。"},"examples":[{"en":"I put arnica gel on the bruise to help it fade faster.","zh":"我在淤青处涂了山金车凝胶，想让它消得快一点。"},{"en":"Some athletes use arnica cream after intense training.","zh":"有些运动员在高强度训练后会用山金车乳膏。"}]}],"synonyms":["mountain daisy","arnica gel","arnica cream"],"phonetic":"ˈɑr.nɪ.kə","extraExplanation":["“Arnica”在英语里既可指植物本身，也常指含其成分的外用产品（arnica cream/gel/ointment）。","多数情况下山金车用于外用；直接口服可能有风险。购买与使用时最好按说明或咨询专业人士。","在一些文化与替代疗法语境中，arnica 也常出现在顺势疗法（homeopathy）产品里；其效果与证据在不同研究中看法不一，学习时可理解为“常见的民间/保健用途”。"]}
{"word":"arnicas","summary":{"en":"“Arnicas” is the plural of “arnica,” meaning the plant or a topical remedy made from it, commonly used for bruises and soreness.","zh":"“Arnicas”是“arnica”的复数，可指山金车植物或其外用制品，常用于淤青和酸痛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of arnica: a yellow-flowered mountain plant (genus Arnica), or a medicine/cream made from it, often used on the skin for bruises and sore muscles.","zh":"arnica 的复数：一种黄色花的高山植物（山金车属），也可指由其制成的外用药膏/凝胶，常用于淤青和肌肉酸痛。"},"examples":[{"en":"She keeps a tube of arnica gel at home for bruises.","zh":"她家里常备一支山金车凝胶，用来处理淤青。"},{"en":"Some hikers can name different arnicas growing along the trail.","zh":"有些徒步者能说出小径旁生长的不同种类的山金车。"}]}],"synonyms":["arnica gel","arnica cream","herbal bruise remedy"],"phonetic":"ˈɑrnɪkə","extraExplanation":["“Arnica”在英语中既可指植物本身，也常指由其提取物制成的外用产品（如 cream/gel/ointment）。日常语境里更常见的是药膏/凝胶的意思。","常见搭配：arnica cream / arnica gel / arnica ointment；相关表达：bruise cream（淤青膏）、muscle soreness（肌肉酸痛）。","用法提醒：许多产品标注仅供外用（for external use only）。实际医疗效果因产品与个体而异；如有严重受伤或过敏，建议咨询医生。"]}
{"word":"Arnie","summary":{"en":"Arnie is a male name, commonly a nickname for Arnold.","zh":"Arnie 是男性名字，常见为 Arnold 的昵称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A male given name, often used as a friendly nickname for Arnold.","zh":"男性名字，常用作 Arnold 的昵称（更亲切的叫法）。"},"examples":[{"en":"Arnie is short for Arnold.","zh":"Arnie 是 Arnold 的简称/昵称。"},{"en":"I met Arnie at the gym after work.","zh":"下班后我在健身房认识了 Arnie。"}]}],"synonyms":["Arnold (full form)"],"phonetic":"ˈɑrni","extraExplanation":["“Arnie”在英语口语中很常见，尤其作为昵称使用；最广为人知的例子之一是演员兼前加州州长 Arnold Schwarzenegger 常被称作 “Arnie”。"]}
{"word":"Arnim","summary":{"en":"Arnim is mainly used as a German surname, especially in historical or literary contexts.","zh":"Arnim 主要用作德国姓氏，常见于历史或文学语境中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a German surname; often seen in names like “Achim von Arnim,” a well-known German Romantic writer","zh":"一个德国姓氏；常见于如“Achim von Arnim（阿希姆·冯·阿尔尼姆）”这样的名字中，他是著名的德国浪漫主义作家"},"examples":[{"en":"I’m reading a short story by Achim von Arnim.","zh":"我在读阿希姆·冯·阿尔尼姆的一篇短篇作品。"},{"en":"Arnim is a family name, not a common everyday English word.","zh":"Arnim 是一个姓氏，不是英语里常用的日常词汇。"}]}],"phonetic":"/ˈɑr.nɪm/","extraExplanation":["“Arnim”在英语语境里通常作为专有名词出现（人名/姓氏）。最常被提到的是德国作家 Achim von Arnim（1781–1831），他属于德国浪漫主义时期，常与民间文学、诗歌与民族文化的兴起联系在一起。","读到“von Arnim”时，“von”是德语贵族或家族来源标记，类似“来自……的”，整体常作为姓氏的一部分来称呼。"]}
{"word":"Arno","summary":{"en":"Arno is a male first name, and it can also refer to the Arno River in Italy.","zh":"Arno 既可作男性名字，也可指意大利的阿尔诺河。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a masculine given name (first name).","zh":"男性名字（名）。"},"examples":[{"en":"Arno moved to New York for graduate school.","zh":"Arno 去纽约读研究生。"},{"en":"My friend Arno speaks German and English.","zh":"我的朋友 Arno 会说德语和英语。"}]},{"partOfSpeech":"n.","definition":{"en":"the Arno River, a river in Tuscany, Italy, flowing through Florence and Pisa.","zh":"阿尔诺河（意大利托斯卡纳地区的河流，流经佛罗伦萨与比萨）。"},"examples":[{"en":"We walked along the Arno at sunset in Florence.","zh":"我们在佛罗伦萨沿着阿尔诺河看日落。"},{"en":"The bridges over the Arno are famous tourist sights.","zh":"跨越阿尔诺河的桥是著名景点。"}]}],"synonyms":["(name) Arnold (related form)","(river) Arno River"],"phonetic":"/ˈɑrnoʊ/","extraExplanation":["“Arno”作人名时多见于德语、荷兰语等语境，常被认为与古日耳曼语词根有关，含义常被解释为“鹰（eagle）”或“像鹰一样强壮”。在英语世界里它相对少见，因此在正式文件中通常会被当作专有名词（首字母大写）。","“the Arno”指河流时，英语里通常加定冠词 the；谈到地名（如 Florence）时也常用“along the Arno / over the Arno / on the Arno”等搭配。"]}
{"word":"Arnold","summary":{"en":"Arnold is a common English male first name and also a surname.","zh":"Arnold 是常见的英文男性名字，也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name).","zh":"男性名字（名）。"},"examples":[{"en":"Arnold is my grandfather’s name.","zh":"Arnold 是我爷爷的名字。"},{"en":"Arnold joined our class this semester.","zh":"Arnold 这学期加入了我们班。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"姓氏（家族姓）。"},"examples":[{"en":"Her last name is Arnold.","zh":"她的姓是 Arnold。"},{"en":"Dr. Arnold will see you now.","zh":"Arnold 医生现在会见你。"}]}],"phonetic":"ˈɑr.nəld","extraExplanation":["“Arnold”源自日耳曼语人名，常被解释为与“鹰（eagle）”和“力量/统治（power/rule）”相关的含义，因此在英语文化中给人一种“强壮、坚定”的名字印象。","文化联想：比较常见的名人包括 Arnold Schwarzenegger（施瓦辛格，演员/前加州州长）。另外 Benedict Arnold 是美国独立战争时期的历史人物，因叛变而让 “an Arnold” 在某些语境中带有“叛徒”的联想，但这更多是历史典故，不代表所有叫 Arnold 的人。"]}
{"word":"arnold","summary":{"en":"Arnold is commonly used as a male first name and also as a last name in English.","zh":"Arnold 在英语中常见作男性名字，也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name).","zh":"男性名字（名）。"},"examples":[{"en":"Arnold is my uncle’s name.","zh":"Arnold 是我叔叔的名字。"},{"en":"Arnold moved to New York for work.","zh":"Arnold 为了工作搬到了纽约。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"姓氏（家族名）。"},"examples":[{"en":"Dr. Arnold will see you now.","zh":"Arnold 医生现在要见你。"},{"en":"My teacher’s last name is Arnold.","zh":"我老师的姓是 Arnold。"}]}],"phonetic":"/ˈɑɹnəld/","extraExplanation":["“Arnold”源自日耳曼语名字元素，常被解释为“鹰（arn）+力量/统治（wald）”，可理解为“像鹰一样强大/有力量”。","在英语文化里，你可能会在名人或品牌中见到它，例如演员兼政治人物 Arnold Schwarzenegger；以及与高尔夫相关的 Arnold Palmer（也常指同名饮料：冰茶+柠檬水）。"]}
{"word":"Arnoldian","summary":{"en":"Arnoldian means “connected with Matthew Arnold’s ideas,” especially about culture, education, and literary criticism; it can also mean a follower of those ideas.","zh":"Arnoldian 指“与马修·阿诺德的思想有关的”，尤指文化、教育与文学批评；也可指其思想的拥护者。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the English poet and cultural critic Matthew Arnold (1822–1888), especially his ideas about culture, education, and literary criticism.","zh":"与英国诗人、文化批评家马修·阿诺德（Matthew Arnold, 1822–1888）有关的，尤指他的文化、教育与文学批评思想。"},"examples":[{"en":"The essay takes an Arnoldian view that education should cultivate the whole person, not just job skills.","zh":"这篇文章采取一种“阿诺德式”的观点，认为教育应当塑造完整的人，而不只是培养职业技能。"},{"en":"Her Arnoldian critique argues that great literature can refine our moral and emotional life.","zh":"她的阿诺德式批评认为，伟大的文学能够提升我们的道德与情感生活。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who follows or strongly agrees with Matthew Arnold’s cultural and critical views.","zh":"阿诺德思想的拥护者；赞同马修·阿诺德文化与批评观点的人。"},"examples":[{"en":"Some Arnoldians still defend the idea of a shared cultural canon in schools.","zh":"一些阿诺德派仍然主张学校里应有一套共同的经典书目（文化正典）。"}]}],"synonyms":["Matthew-Arnold-like","Arnold-esque","classicist (context-dependent)"],"phonetic":"/ɑrˈnoʊldiən/","extraExplanation":["“Arnoldian”常出现在文学研究与文化批评语境里。阿诺德在《Culture and Anarchy》（《文化与无政府状态》）中强调文化的教化作用，并以“sweetness and light”（可译为“优雅与光明/甜美与光明”）概括理想的文明状态。","在文学批评中，“Arnoldian”也常暗示一种重视“高严肃性”（high seriousness）、道德与审美教化、以及经典传统价值的立场。"]}
{"word":"Arnoldist","summary":{"en":"Arnoldist means a follower of Matthew Arnold’s cultural and literary ideas, or something characterized by them.","zh":"Arnoldist指追随马修·阿诺德文化/文学思想的人，或具有其思想特点的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who follows or supports the ideas (especially literary, cultural, or social criticism) associated with Matthew Arnold.","zh":"阿诺德主义者：指追随或支持马修·阿诺德（尤其在文学、文化或社会批评方面）思想的人。"},"examples":[{"en":"Some early 20th‑century critics were Arnoldists who believed literature should promote moral seriousness.","zh":"一些20世纪早期的评论家是阿诺德主义者，他们认为文学应当倡导严肃的道德关怀。"},{"en":"As an Arnoldist, she valued “culture” as a way to improve public life.","zh":"作为一名阿诺德主义者，她重视“文化”作为改善公共生活的一种方式。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or characteristic of Matthew Arnold’s views, especially the idea that culture and education can refine society.","zh":"阿诺德主义的：与马修·阿诺德的观点有关或具有其特色的，尤指“文化与教育能提升社会”的主张。"},"examples":[{"en":"The essay takes an Arnoldist tone, arguing for humane education over narrow job training.","zh":"这篇文章带有阿诺德主义的语气，主张人文教育胜过狭隘的职业训练。"},{"en":"His Arnoldist emphasis on “the best that has been thought and said” shaped the syllabus.","zh":"他阿诺德主义式地强调“人类思想与言说的精华”，这影响了课程大纲。"}]}],"synonyms":["Arnoldian","follower of Matthew Arnold","cultural critic"],"phonetic":"ˈɑrnəldɪst","extraExplanation":["“Arnoldist/Arnoldian”通常与英国维多利亚时代诗人兼文化评论家Matthew Arnold（1822–1888）相关。他在《Culture and Anarchy》中强调“culture（文化修养）”与“the best that has been thought and said（最好的思想与表达）”，认为这能对抗社会的狭隘与混乱。","在学术写作里也常见形容词Arnoldian（更常用），意思与Arnoldist相近，但Arnoldist更强调“追随者/立场”。"]}
{"word":"arnoldist","summary":{"en":"Arnoldist means a follower of Matthew Arnold or something based on his cultural and literary ideas.","zh":"Arnoldist 指追随马修·阿诺德的人，或指体现其文化与文学批评理念的观点/风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who follows or supports the ideas of Matthew Arnold (especially his views on culture, education, and literary criticism).","zh":"阿诺德主义者；追随/支持马修·阿诺德（尤其是其关于文化、教育与文学批评观点）的人。"},"examples":[{"en":"Some early 20th-century critics were openly Arnoldists who argued that literature should cultivate moral and cultural standards.","zh":"一些20世纪初的批评家明显带有阿诺德主义色彩，主张文学应当培养道德与文化标准。"},{"en":"He sounds like an Arnoldist when he says culture should be “the best that has been thought and said.”","zh":"当他说文化应当是“人类所思所言之精华”时，他听起来很像阿诺德主义者。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to Matthew Arnold or to his cultural and critical principles.","zh":"与马修·阿诺德有关的；体现其文化观与批评原则的。"},"examples":[{"en":"The essay takes an Arnoldist approach to education, emphasizing character and humane learning.","zh":"这篇文章以阿诺德式的教育观为路径，强调品格与人文学习。"},{"en":"Her Arnoldist criticism focuses on how art shapes society’s values.","zh":"她的阿诺德式批评关注艺术如何塑造社会价值观。"}]}],"synonyms":["Arnoldian","Matthew-Arnold-inspired","humanist (context-dependent)"],"phonetic":"/ˈɑr.nəld.ɪst/","extraExplanation":["“Arnoldist”来自英国诗人兼评论家 Matthew Arnold（1822–1888）。他在《Culture and Anarchy》等著作中强调“文化”应追求广博的人文修养，并用名句“the best that has been thought and said（人类所思所言之精华）”来概括文化理想。","在英语文化语境中，“Arnoldist”常与强调文学的道德/社会功能、反对狭隘功利主义教育、推崇古典与人文传统的批评立场联系在一起。"]}
{"word":"Arnoldo","summary":{"en":"Arnoldo is a male first name, common in Spanish/Portuguese contexts, related to Arnold.","zh":"Arnoldo 是男性名字，常见于西语/葡语语境，与 Arnold 同源或相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A male given name (first name), used especially in Spanish- and Portuguese-speaking communities; a form related to “Arnold.”","zh":"男性名字（名），在西班牙语与葡萄牙语社群中较常见；与“Arnold（阿诺德）”同源/相关。"},"examples":[{"en":"Arnoldo is my uncle; he moved to California years ago.","zh":"Arnoldo 是我叔叔；他多年前搬到加州了。"},{"en":"Please ask Arnoldo to call me when he has time.","zh":"请让 Arnoldo 有空时给我打电话。"}]}],"synonyms":["Arnold"],"phonetic":"/ɑrˈnol.doʊ/","extraExplanation":["“Arnoldo”常见于拉丁美洲与西语裔社群，也可能出现在意大利语环境中。它与日耳曼语源的“Arnold”相关，名字含义传统上与“鹰（eagle）/力量（power）”一类意象有关。英文语境里通常直接当作人名使用，不需要翻译，只需按对方习惯发音或拼写。"]}
{"word":"Arnoldsburg","summary":{"en":"Arnoldsburg is a place name: an unincorporated community in Calhoun County, West Virginia, USA.","zh":"Arnoldsburg 是一个地名：美国西弗吉尼亚州卡尔霍恩县的非建制社区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An unincorporated community in Calhoun County, West Virginia, USA.","zh":"美国西弗吉尼亚州（West Virginia）卡尔霍恩县（Calhoun County）的一个非建制社区（unincorporated community）。"},"examples":[{"en":"Arnoldsburg is a small community in central West Virginia.","zh":"Arnoldsburg 是西弗吉尼亚州中部的一个小社区。"},{"en":"She drove through Arnoldsburg on the way to a nearby town.","zh":"她开车经过 Arnoldsburg，前往附近的城镇。"}]}],"phonetic":"/ˈɑr.noʊldz.bɝːɡ/","extraExplanation":["Arnoldsburg 属于“非建制社区”（unincorporated community）：通常有地名与居民聚居，但不像“市/镇”（city/town）那样拥有独立的市政政府。","在美国地名里，很多以 -burg 结尾的名字常与早期定居点或“城镇/堡垒”之意有关（与“borough”等词同源），但日常理解时把它当作普通地名即可。"]}
{"word":"Arnoldson","summary":{"en":"Arnoldson is a surname; historically it can mean “son of Arnold.”","zh":"Arnoldson 是一个姓氏；从历史构词上可理解为“Arnold 的儿子”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A family name (surname).","zh":"一个姓氏（家族姓）。"},"examples":[{"en":"Ms. Arnoldson will lead the meeting today.","zh":"Arnoldson 女士今天将主持会议。"},{"en":"I found an article written by Dr. Arnoldson.","zh":"我找到了一篇由 Arnoldson 博士撰写的文章。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname that historically can be understood as “son of Arnold” (a patronymic-style name).","zh":"一个在历史上可理解为“Arnold 的儿子”的姓（父名式/来源于父名的姓）。"},"examples":[{"en":"The name Arnoldson likely began as a way to show family connection to someone named Arnold.","zh":"Arnoldson 这个姓很可能最初用于表示与名叫 Arnold 的人有家族关系。"}]}],"synonyms":["Arnold (related given name)","Arnoldsson (variant spelling)"],"phonetic":"/ˈɑrnəldsən/","extraExplanation":["“-son”结尾的姓在英语世界很常见，常见含义是“某人的儿子”（如 Johnson = John 的儿子）。这类姓在北欧与英语文化中都能见到，但具体来源需要结合家族与地区史料（族谱、移民记录等）才能确定。","作为专有名词（人名/姓氏），Arnoldson 通常不翻译；中文写作时多用音译或直接保留原拼写。"]}
{"word":"Arnoldsson","summary":{"en":"Arnoldsson is a Scandinavian surname, especially Swedish, meaning “son of Arnold.”","zh":"Arnoldsson 是常见于斯堪的纳维亚（尤其瑞典）的姓氏，意思是“Arnold 的儿子”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Swedish (and sometimes Icelandic-style) family name meaning “son of Arnold.”","zh":"一个瑞典（有时也见于北欧）姓氏，意思是“Arnold 的儿子”。"},"examples":[{"en":"Her last name is Arnoldsson, so she likely has Scandinavian roots.","zh":"她的姓是 Arnoldsson，所以她可能有斯堪的纳维亚背景。"},{"en":"I saw “Arnoldsson” on the roster and guessed it was a Swedish surname.","zh":"我在名单上看到“Arnoldsson”，就猜这是一个瑞典姓。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who has the surname Arnoldsson (used as a proper name).","zh":"姓 Arnoldsson 的人（作为专有名词使用）。"},"examples":[{"en":"Arnoldsson scored the winning goal in the final minute.","zh":"Arnoldsson 在最后一分钟打进制胜球。"},{"en":"Please email Arnoldsson the updated schedule.","zh":"请把更新后的日程发邮件给 Arnoldsson。"}]}],"synonyms":["(no direct synonym; related surnames: Andersson, Johansson, Karlsson)"],"phonetic":"/ˈɑrnoʊldˌsɔn/","extraExplanation":["在瑞典姓氏中，“-sson”（也写作 -son）是常见的父名后缀，表示“某某的儿子”。例如 Andersson=“Anders 的儿子”、Johansson=“Johan 的儿子”。现代瑞典人通常把它当作固定姓氏使用，不一定表示真实父子关系。","“Arnold”源自古日耳曼语名字元素，常被解释为“鹰（arn）+ 统治/权力（wald）”，因此 Arnoldsson 可以理解为“Arnold 的后代/家族名”。"]}
{"word":"Arnoldsville","summary":{"en":"Arnoldsville is a place name, most commonly referring to a small community in Georgia, USA.","zh":"Arnoldsville 是一个地名，最常见的是指美国乔治亚州的一个小社区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun), referring to a small town/community called Arnoldsville, especially Arnoldsville in Oglethorpe County, Georgia, USA.","zh":"地名（专有名词），指名为 Arnoldsville 的小镇/社区，尤其常指美国乔治亚州奥格尔索普县的 Arnoldsville。"},"examples":[{"en":"She grew up in Arnoldsville, Georgia, before moving to Atlanta for college.","zh":"她在乔治亚州的 Arnoldsville 长大，后来去亚特兰大上大学。"},{"en":"Arnoldsville is a small community not far from Athens, Georgia.","zh":"Arnoldsville 是一个离乔治亚州雅典市不远的小社区。"}]}],"synonyms":["town","community","(place name)"],"phonetic":"/ˈɑr.nəldz.vɪl/","extraExplanation":["Arnoldsville 属于美国常见的“以人名/姓氏 + -ville（城镇）”的地名结构；-ville 来自法语，常表示“村镇、居住地”。","美国可能存在不止一个叫 Arnoldsville 的地方；在对话或写作中，最好加上州名（如 Arnoldsville, GA）来避免歧义。"]}
{"word":"Arnon","summary":{"en":"Arnon is a biblical river name, commonly linked to Wadi Mujib in Jordan.","zh":"Arnon（亚嫩）是《圣经》中的河流名称，通常被认为对应约旦的穆吉卜河谷（Wadi Mujib）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A river mentioned in the Bible that marked a boundary of ancient Moab; traditionally identified with Wadi Mujib in present-day Jordan, flowing into the Dead Sea.","zh":"《圣经》中提到的一条河流，曾作为古代摩押（Moab）的边界；通常被认为对应今天约旦的穆吉卜河谷（Wadi Mujib），流入死海。"},"examples":[{"en":"In the Bible, the Arnon River is described as a border between territories.","zh":"在《圣经》中，亚嫩河被描述为领土之间的边界。"},{"en":"Some maps identify the Arnon with Wadi Mujib in Jordan.","zh":"一些地图把亚嫩河标注为约旦的穆吉卜河谷（Wadi Mujib）。"}]}],"phonetic":"ˈɑr.nɑn","extraExplanation":["“Arnon/亚嫩河”常见于《旧约》地理叙述（如《民数记》《申命记》等）中，用来界定以色列人、亚摩利人和摩押人等相关地区的边界。","现代地理上多认为它对应约旦的Wadi Mujib（穆吉卜河谷）。在英文资料里，你也会看到写作“the Arnon”来指这条河。"]}
{"word":"Arnoseris","summary":{"en":"Arnoseris is a botanical genus name for certain small daisy-family plants (notably lamb’s succory).","zh":"Arnoseris 是植物学上的属名，指菊科中的一类小型植物（代表物种为“羊苦苣”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small flowering plants in the daisy family (Asteraceae), especially known for the species lamb’s succory (Arnoseris minima) found in parts of Europe.","zh":"一种菊科（Asteraceae）的小型开花植物属，较知名的物种为“羊苦苣”（Arnoseris minima），分布于欧洲部分地区。"},"examples":[{"en":"In some European wildflower guides, Arnoseris is listed under the daisy family.","zh":"在一些欧洲野花图鉴中，Arnoseris 被归在菊科里。"},{"en":"The species Arnoseris minima is sometimes called lamb’s succory.","zh":"Arnoseris minima 这个物种有时被称为“羊苦苣”。"}]}],"synonyms":["genus Arnoseris","lamb’s succory (for Arnoseris minima)"],"phonetic":"/ˌɑrnoʊˈsɪrɪs/","extraExplanation":["Arnoseris 是拉丁学名（属名），在英文里多用于植物学、生态调查、或野外辨识资料中，日常对话里很少出现。","学名通常斜体书写：*Arnoseris*；属名首字母大写，种加词小写：*Arnoseris minima*。"]}
{"word":"arnoseris","summary":{"en":"Arnoseris is a plant genus in the daisy family, used mainly as a scientific (Latin) name.","zh":"Arnoseris 是菊科的一种植物属名，主要作为拉丁学名使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants in the daisy family (Asteraceae), found mainly in Europe; it includes species such as lamb’s-succory (Arnoseris minima).","zh":"一种菊科（Asteraceae）的开花植物属，主要分布于欧洲；其物种之一是“羊婆婆菜/小羊苦苣”（Arnoseris minima，常见英文名 lamb’s-succory）。"},"examples":[{"en":"Arnoseris is a small genus in the daisy family, best known for the species Arnoseris minima.","zh":"Arnoseris 是菊科中的一个小属，最知名的是 Arnoseris minima 这一物种。"},{"en":"The guidebook listed Arnoseris minima among the wildflowers found in sandy fields.","zh":"这本指南把 Arnoseris minima 列为沙地田野常见的野花之一。"}]}],"synonyms":["(scientific name) Arnoseris (genus)","daisy family genus (Asteraceae)"],"phonetic":"/ˌɑrnoʊˈsɪrɪs/","extraExplanation":["“Arnoseris”是拉丁学名（属名），通常用于植物学与野外识别手册中；日常英语里更常用具体物种名或常见名（例如 lamb’s-succory）。","读法上可把它分成 ar-no-ser-is 来帮助发音；在英语语境中遇到这类词，多半是学名，不需要像普通词汇那样变形（复数常按属名不变，或用“species of Arnoseris”表达）。"]}
{"word":"Arnot","summary":{"en":"Arnot is most commonly a surname, and it can also be used as a place name.","zh":"Arnot 最常见的是姓氏，也可用作地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name), especially found in Scotland and in English-speaking countries","zh":"姓氏（家族姓），常见于苏格兰及英语国家"},"examples":[{"en":"Dr. Arnot will speak at the conference tomorrow.","zh":"Arnot 博士明天将在会议上发言。"},{"en":"My teacher’s last name is Arnot.","zh":"我老师的姓是 Arnot。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun) used for some locations, such as roads, parks, or small areas named “Arnot”","zh":"地名（专有名词），用于一些名为“Arnot”的地点，如道路、公园或小区域"},"examples":[{"en":"We met near Arnot Park after school.","zh":"放学后我们在 Arnot 公园附近见面。"},{"en":"The store is on Arnot Road.","zh":"那家店在 Arnot 路上。"}]}],"synonyms":["(as a surname) no direct synonyms","(as a place name) no direct synonyms"],"phonetic":"/ˈɑrnət/","extraExplanation":["“Arnot”多见于苏格兰背景的姓氏。英语里的专有名词通常首字母大写（Arnot），发音会因地区口音略有差异。若你是在某本书/文章里看到它，也可能是人物姓氏或地名。"]}
{"word":"Arnott","summary":{"en":"Arnott is a surname, and “Arnott’s” is also the name of a well-known Australian biscuit company.","zh":"Arnott 既可以是姓氏，也常指澳大利亚知名饼干公司 “Arnott’s”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname), used for people named Arnott.","zh":"姓氏：Arnott（人名/家族名）。"},"examples":[{"en":"Dr. Arnott will see you at 3 p.m.","zh":"Arnott 医生会在下午三点见你。"},{"en":"My teacher’s last name is Arnott.","zh":"我老师的姓是 Arnott。"}]},{"partOfSpeech":"other","definition":{"en":"(often written “Arnott’s”) an Australian food company best known for making biscuits/cookies.","zh":"（常写作“Arnott’s”）澳大利亚的食品公司，以生产饼干/曲奇最出名。"},"examples":[{"en":"She bought a pack of Arnott’s biscuits for the trip.","zh":"她买了一包 Arnott’s 饼干带着路上吃。"},{"en":"Tim Tams are made by Arnott’s.","zh":"Tim Tam 是 Arnott’s 生产的。"}]}],"phonetic":"/ɑrˈnɑt/","extraExplanation":["Arnott 作为姓氏多见于英语国家，常被认为与苏格兰/英国的家族姓名有关；在日常生活中，你也很可能在澳大利亚语境里把它当作品牌名（Arnott’s）。","英语里带撇号的 “Arnott’s” 通常来自所有格/品牌写法（原意类似“Arnott 家的（产品）”），但在现代使用中已固定为公司品牌名。"]}
{"word":"arnotta","summary":{"en":"“Arnotta” is mainly used as a surname (a proper name), not a standard English word.","zh":"“Arnotta”主要用作姓氏（专有名词），不是标准英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname); not a common English vocabulary word. It may be a variant spelling of “Arnott/Arnot,” used as a personal or place-related name.","zh":"一个姓氏；不是常见英文词汇。可能是“Arnott/Arnot”的拼写变体，用作人名或与地名相关的姓氏。"},"examples":[{"en":"Ms. Arnotta will join the meeting at 3 p.m.","zh":"Arnotta 女士将于下午三点参加会议。"},{"en":"I saw the name Arnotta on the guest list.","zh":"我在宾客名单上看到了 Arnotta 这个名字。"}]}],"synonyms":["Arnott","Arnot"],"phonetic":"/ɑɹˈnɑːtə/","extraExplanation":["“Arnott/Arnot”常见于英语国家的姓氏体系里，尤其与苏格兰姓氏传统有关；这类姓氏有时来自地名或家族来源，因此不同分支可能出现不同拼写（如加上 -a 变成 Arnotta）。","如果你是想查一个英文单词的意思，“arnotta”更像是拼写或专有名词。你可以告诉我它出现的句子/上下文，或确认是否想查：Arnott / Arnot / Anotta 等，我可以更准确解释。"]}
{"word":"arnotto","summary":{"en":"“arnotto” isn’t a recognized common English word; it’s likely a name or a misspelling.","zh":"“arnotto”不是常见英语词，可能是专有名词或拼写误写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. “arnotto” is most likely a proper name (e.g., a surname/place/brand) or a misspelling of another word.","zh":"不是标准英语单词。“arnotto”很可能是专有名词（如姓氏/地名/品牌），或是其他单词的拼写错误。"},"examples":[{"en":"I can’t find “arnotto” in major English dictionaries—could you share the sentence you saw it in?","zh":"我在主要英语词典里找不到“arnotto”——你能把它出现的句子发我吗？"},{"en":"If you meant a different word, tell me the topic (food, music, a person’s name), and I’ll help you identify it.","zh":"如果你想查的是别的词，告诉我主题（食物/音乐/人名等），我可以帮你确认正确拼写。"}]}],"phonetic":"/ɑrˈnɑtoʊ/","extraExplanation":["“arnotto”看起来更像专有名词或外来词的转写（例如意大利语姓名/品牌），而不是英语常用词。","如果你是从听力里记下来的，可能存在音近误拼。把上下文句子或你想表达的意思发来，我可以帮你推测最可能的目标词（并给出正确拼写与释义）。"]}
{"word":"arnottos","summary":{"en":"“Arnott’s/Arnotts” refers to an Australian biscuit and snack brand; “arnottos” is likely a misspelling or informal variant.","zh":"“Arnott’s/Arnotts”指澳大利亚的饼干与零食品牌；“arnottos”很可能是拼写错误或非正式写法。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Arnott’s (often written informally as “Arnotts”) is an Australian brand best known for biscuits/cookies and snack foods.","zh":"Arnott’s（口语或非正式拼写常见为“Arnotts”）是澳大利亚的一个品牌，最有名的是饼干/曲奇和零食。"},"examples":[{"en":"I bought a pack of Arnott’s Tim Tams at the supermarket.","zh":"我在超市买了一包 Arnott’s 的 Tim Tam。"},{"en":"Do you want Arnott’s biscuits with your tea?","zh":"你喝茶要配 Arnott’s 的饼干吗？"}]}],"synonyms":["Arnott’s","Arnotts"],"phonetic":"/ɑrˈnɑts/","extraExplanation":["“arnottos”很可能是拼写误差或口语化写法；最常见的标准写法是 **Arnott’s**（带撇号）。","在英语里这属于品牌名/专有名词，日常表达中也有人把撇号省略写成 **Arnotts**。如果你是想查别的词（例如人名/地名/用户名），可以告诉我具体上下文，我可以帮你确认。"]}
{"word":"Arnotts","summary":{"en":"Arnott’s is a well-known Australian biscuit (cookie) and snack brand.","zh":"Arnott’s 是澳大利亚知名的饼干（曲奇）与零食品牌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an Australian brand best known for biscuits (cookies) and snack foods, especially products like Tim Tam, Shapes, and Iced VoVo","zh":"Arnott’s（阿诺茨）是澳大利亚知名的饼干与零食品牌，代表性产品包括 Tim Tam、Shapes、Iced VoVo 等"},"examples":[{"en":"I brought Arnott’s Tim Tams for dessert.","zh":"我带了 Arnott’s 的 Tim Tam 当甜点。"},{"en":"In Australia, Arnott’s biscuits are a common thing to have with tea.","zh":"在澳大利亚，Arnott’s 的饼干常常配茶一起吃。"}]}],"synonyms":["a biscuit brand","an Australian snack brand"],"phonetic":"/ɑrˈnɑts/","extraExplanation":["“Arnott’s”中的撇号 s 表示品牌名源自创始人姓氏 Arnott（相当于“Arnott 家的”），但在日常使用中通常把它当作一个整体的品牌名称来读和写。","在澳大利亚语境里，人们常把“Arnott’s”直接当作“饼干/零食”的代表品牌来提，类似于在其他国家用某些大品牌代指一类常见零食的说法。"]}
{"word":"Arnst","summary":{"en":"“Arnst” is mainly used as a proper name (surname or sometimes a place name) rather than a regular English word.","zh":"“Arnst”主要作为专有名词（姓氏，有时为地名）使用，而不是常规英语词汇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A proper name (usually a surname) and sometimes a place name; it is not a common English vocabulary word in everyday use.","zh":"专有名（通常是姓氏），有时也可作地名；它不是日常英语中常见的词汇。"},"examples":[{"en":"Dr. Arnst will speak at the conference tomorrow.","zh":"Arnst 博士明天将在会议上发言。"},{"en":"The email was sent to Ms. Arnst by mistake.","zh":"这封邮件误发给了 Arnst 女士。"}]}],"phonetic":"/ɑrnst/","extraExplanation":["“Arnst”更常见于德语背景的姓氏或地名。在英语里通常只作为专有名词出现，不像普通词汇那样有固定的词义。","如果你想查的是“Ernst”（常见德语名/姓，含义接近“serious/earnest（认真、严肃）”），告诉我语境或正确拼写，我可以一并解释并对比。"]}
{"word":"Arnuad","summary":{"en":"Arnuad is not a standard English word; it is likely a misspelling or variant of the French name “Arnaud.”","zh":"Arnuad 不是标准英语单词；它很可能是法语人名 “Arnaud” 的拼写错误或变体。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A French given name and surname (more commonly spelled “Arnaud”). It is used as a person’s name, not as a common English vocabulary word.","zh":"一个法语中的人名（名字或姓氏），更常见的拼写是“Arnaud”。它是专有名词，用作姓名，而不是英语里的普通词汇。"},"examples":[{"en":"Arnaud is a common first name in France.","zh":"Arnaud 是法国很常见的名字。"},{"en":"I met Arnaud at a conference in Paris.","zh":"我在巴黎的一场会议上认识了 Arnaud。"},{"en":"Please check the spelling—did you mean Arnaud?","zh":"请核对拼写——你是不是想写 Arnaud？"}]}],"synonyms":["Arnaud","Arnauld"],"phonetic":"/ɑrˈnoʊ/","extraExplanation":["“Arnaud”多被认为源自古日耳曼语成分：arn（鹰）+ wald（统治/力量），常被解释为“像鹰一样强大/有力量的人”。不同地区可能有不同拼写（如 Arnaud/Arnauld 等）。","你写的“Arnuad”不太常见，可能是“Arnaud”的拼写错误或变体；如果你是在某篇文章、名单或影视字幕里看到的，也可能是个体姓名的特殊拼写。"]}
{"word":"Arnulf","summary":{"en":"Arnulf is a masculine Germanic name (and sometimes a surname), seen in historical and medieval contexts.","zh":"Arnulf 是一个源自日耳曼语的男性名字（有时也作姓氏），常见于历史或中世纪语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A masculine given name (first name), originally from Germanic languages.","zh":"男性名字（名），源自日耳曼语系。"},"examples":[{"en":"Arnulf is a traditional Germanic name that appears in medieval history.","zh":"Arnulf 是一个传统的日耳曼名字，在中世纪历史中常见。"},{"en":"In the novel, Arnulf is portrayed as a loyal knight.","zh":"在小说里，Arnulf 被描写成一位忠诚的骑士。"}]},{"partOfSpeech":"other","definition":{"en":"A surname (family name), less common, often found in areas influenced by German-speaking cultures.","zh":"姓氏（较少见），多见于受德语文化影响的地区。"},"examples":[{"en":"Dr. Arnulf published a study on European folklore.","zh":"Arnulf 博士发表了一项关于欧洲民俗的研究。"}]}],"synonyms":["Arnold (related name)","Arnaud (related name)","Arnaldo (related name)"],"phonetic":"/ˈɑr.nʊlf/","extraExplanation":["“Arnulf”来自古日耳曼语要素：arn-（鹰）+ -wulf（狼），常被解释为“鹰与狼”或“像鹰和狼一样勇猛”的象征性名字。","历史上较著名的人物包括“Arnulf of Carinthia（卡林西亚的阿努尔夫）”，9世纪末成为东法兰克（中世纪德意志地区前身）国王并短暂担任神圣罗马皇帝。"]}
{"word":"Arnulfo","summary":{"en":"Arnulfo is a Spanish-language male first name.","zh":"Arnulfo 是一个西班牙语中的男性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a masculine given name, used especially in Spanish-speaking communities; equivalent to “Arnulf” in some European traditions.","zh":"（男名）阿努尔福；常见于西班牙语社群的男性名字，在一些欧洲传统中与 Arnulf（阿恩努尔夫）相对应。"},"examples":[{"en":"Arnulfo is my uncle’s name, and he was born in Mexico.","zh":"阿努尔福是我叔叔的名字，他出生在墨西哥。"},{"en":"Arnulfo called to confirm the appointment for Monday.","zh":"阿努尔福打电话来确认周一的预约。"}]}],"synonyms":["Arnulf","Arnaldo"],"phonetic":"/ɑrˈnulfoʊ/","extraExplanation":["“Arnulfo”多被视为西班牙语中的男性名字，常见于墨西哥及中美洲等地。它与德语系名字“Arnulf/Arnolf”有渊源：传统上可理解为与“鹰（arn）+狼（wulf）”相关的古老姓名元素。","在英语语境中，这类名字通常按西班牙语重音读作 ar-NOOL-fo；正式文件或课堂点名时，尊重当事人的自我发音最礼貌。"]}
{"word":"Arnusian","summary":{"en":"“Arnusian” usually means “of/from Arnus or Arnusia,” often in fictional or world-building contexts.","zh":"“Arnusian”通常表示“与 Arnus 或 Arnusia 有关/来自 Arnus 或 Arnusia”，常见于虚构设定或世界观创作语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Proper adjective) Relating to a place, culture, language, or person named “Arnus/Arnusia.”","zh":"（专有形容词）与名为“Arnus/Arnusia”的地点、文化、语言或人物有关的。"},"examples":[{"en":"The novel describes an Arnusian kingdom on the edge of the map.","zh":"这本小说描写了一个位于地图边缘的 Arnusian 王国。"},{"en":"She studies Arnusian history for her fantasy-world project.","zh":"她为了自己的奇幻世界设定研究 Arnusian 的历史。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A person from Arnusia (or connected with Arnus/Arnusia).","zh":"（专有名词）Arnusia 的人；与 Arnus/Arnusia 有关的人。"},"examples":[{"en":"In the story, an Arnusian arrives as an envoy.","zh":"故事里，一位 Arnusian 作为使节到来。"},{"en":"The Arnusians in the film speak a distinct dialect.","zh":"电影里的 Arnusians 说一种独特的方言。"}]}],"synonyms":["Arnus/Arnusia-related","of Arnus","from Arnusia"],"phonetic":"/ɑrˈnuːʒən/","extraExplanation":["“Arnusian”不是现代英语里常见的词，更多像是专有名词（地名/人名）派生出来的形容词或族名（demonym），常见于奇幻作品、游戏设定、同人创作等语境。","如果你是在某本书、游戏、字幕或论文里看到的，给我一句原文或说明它指的是国家/城市/人物/组织，我可以帮你更准确地确认含义与更自然的翻译。","拼写也可能有变体或误读（例如 Arnusian / Arnesian / Arussian 等）；不同来源会影响发音与含义。"]}
{"word":"arnusian","summary":{"en":"“Arnusian” isn’t a common dictionary word; it’s probably a made-up or proper-name adjective meaning “related to Arnus.”","zh":"“arnusian”并非常见词典词汇；很可能是专有名词或虚构词，意为“与 Arnus 有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not a standard English word. It is likely a proper name or a coined/fictional adjective meaning “related to Arnus/Arnusian (a place, person, or group named Arnus).”","zh":"不是标准英语单词。更可能是专有名词或人为创造/虚构的形容词，表示“与 Arnus（某个地方、人物或群体）有关的”。"},"examples":[{"en":"I can’t find “arnusian” in a dictionary—where did you see it?","zh":"我在词典里找不到“arnusian”，你是在哪里看到的？"},{"en":"In the novel, the Arnusian language is used during ceremonies.","zh":"在小说里，Arnusian 语言会在仪式中使用。"}]}],"phonetic":"/ɑrˈnuːʒən/","extraExplanation":["“arnusian”看起来像是“地名/人名 + -ian”构成的形容词或身份词（类似 Canadian / Martian），用来表示“……的、……人/……语”。如果你能提供一句原文或告诉我它来自哪本书/游戏/文章，我可以更准确地解释它在特定语境中的含义与用法。","也有可能是拼写错误；常见的相近词包括 Armenian（亚美尼亚的/亚美尼亚人）等。"]}
{"word":"arnut","summary":{"en":"“arnut” is not standard English; it’s usually a misspelling of “aren’t” (“are not”).","zh":"“arnut”不是标准英语，通常是把“aren’t”（are not 的缩写）拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A common misspelling of “aren’t,” the contraction of “are not.”","zh":"“aren’t”（are not 的缩写）的常见拼写错误。"},"examples":[{"en":"Incorrect: We arnut ready yet. / Correct: We aren’t ready yet.","zh":"错误：We arnut ready yet. / 正确：We aren’t ready yet.（我们还没准备好。）"},{"en":"They aren’t coming today.","zh":"他们今天不来。"}]}],"synonyms":["are not"],"phonetic":"/ɑɹnt/","extraExplanation":["“aren’t”在口语里发音常常很快，听起来可能接近“arn’t”，所以学习者容易把它误写成“arnut / arnt”。标准书写一定是 aren’t（带撇号）。","“aren’t”主要搭配主语 you / we / they（以及复数名词）：You aren’t…, We aren’t…, They aren’t…。在更正式的写作中，也可以写成 are not。"]}
{"word":"Arny","summary":{"en":"“Arny” is usually a personal name or nickname (often for Arnold), sometimes a variant spelling of “Arnie.”","zh":"“Arny”通常是人名或昵称（常见于 Arnold 的昵称），有时是 “Arnie” 的变体拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A given name or nickname (usually for someone named Arnold or Arne).","zh":"人名或昵称（通常是 Arnold 或 Arne 的昵称）。"},"examples":[{"en":"Arny is short for Arnold in some families.","zh":"在一些家庭里，Arny 是 Arnold 的昵称。"},{"en":"Arny told me he prefers the nickname to his full name.","zh":"Arny 跟我说他更喜欢昵称而不是全名。"}]},{"partOfSpeech":"other","definition":{"en":"A less common spelling of the nickname “Arnie.”","zh":"昵称 “Arnie” 的一种不太常见的拼写。"},"examples":[{"en":"You might also see it written as Arnie in books or films.","zh":"在书或电影里，你也可能看到它写作 Arnie。"}]}],"synonyms":["Arnie","Arnold","Arne"],"phonetic":"/ˈɑrni/","extraExplanation":["“Arny/Arnie”多见于英语口语里的昵称写法，不算严格的“词汇”，因此含义主要取决于具体人物。","如果你本来想写的是“army”（军队），拼写不同、读音也不同；“army”的美式音标常见为 /ˈɑrmi/。"]}

