{"word":"ARP","summary":{"en":"ARP most often refers to a networking protocol (Address Resolution Protocol) or, in U.S. news, the American Rescue Plan.","zh":"ARP 常见含义是网络中的“地址解析协议”，或在美国新闻中指“美国救援计划”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(computing) Address Resolution Protocol: a network protocol that matches an IP address to a device’s MAC (hardware) address on a local network, so data can be sent to the right machine.","zh":"（计算机）地址解析协议：在局域网中把 IP 地址对应到设备的 MAC（硬件）地址的网络协议，从而把数据发到正确的机器。"},"examples":[{"en":"If your computer can’t reach the router, an ARP problem might be the cause.","zh":"如果你的电脑连不上路由器，原因可能是 ARP 出了问题。"},{"en":"The system uses ARP to find the MAC address for an IP on the same network.","zh":"系统会用 ARP 去找到同一网络里某个 IP 对应的 MAC 地址。"}]},{"partOfSpeech":"other","definition":{"en":"(U.S. politics/economy) American Rescue Plan: a 2021 U.S. federal law that provided COVID-19 relief, such as stimulus payments and support for schools and local governments.","zh":"（美国政治/经济）《美国救援计划》：美国在 2021 年通过的联邦法案，用于提供新冠疫情救助，例如补助金、对学校和地方政府的支持等。"},"examples":[{"en":"Some cities used ARP funds to improve public health programs.","zh":"一些城市用 ARP 资金来加强公共卫生项目。"},{"en":"The report explains how ARP money was spent in the community.","zh":"这份报告说明了社区如何使用 ARP 资金。"}]}],"synonyms":["Address Resolution Protocol","American Rescue Plan"],"phonetic":"/ˌeɪ ɑr ˈpiː/","extraExplanation":["“ARP”最常见于两类语境：\n1）IT/网络：通常与“ARP request / ARP reply（请求/响应）”“ARP table/cache（ARP 表/缓存）”“ARP spoofing（ARP 欺骗）”一起出现。\n2）美国新闻/政策：通常指 American Rescue Plan，会搭配“ARP funds（ARP 资金）”“ARP grant（补助）”等说法。\n读到“ARP”时，可以先看文章主题是网络技术还是公共政策，再判断是哪一种含义。"]}
{"word":"arp","summary":{"en":"“arp” most often means ARP (Address Resolution Protocol) in networking, or an informal music shorthand for “arpeggio,” and it can also be used as a verb meaning to play/program an arpeggio.","zh":"“arp”最常见指网络中的 ARP（地址解析协议）；在音乐里也常作“arpeggio（琶音）”的口语简称，并可作动词表示弹/编琶音。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(computing) Address Resolution Protocol: a network method used on local networks to match an IP address to a device’s MAC (hardware) address.","zh":"（计算机）地址解析协议：在局域网中用于把 IP 地址对应到设备的 MAC（硬件）地址的方法。"},"examples":[{"en":"If ARP fails, your computer may not be able to find the router’s MAC address on the local network.","zh":"如果 ARP 出问题，你的电脑可能就无法在局域网中找到路由器的 MAC 地址。"},{"en":"The network engineer checked the ARP table to see which MAC address matched the IP.","zh":"网络工程师查看了 ARP 表，看看哪个 MAC 地址对应那个 IP。"}]},{"partOfSpeech":"n.","definition":{"en":"(music, informal) Short for “arpeggio”: playing the notes of a chord one after another instead of all at once.","zh":"（音乐，非正式）“arpeggio（琶音）”的简称：把和弦音一个接一个弹出，而不是同时弹。"},"examples":[{"en":"Try an arp in the left hand to make the chord sound smoother.","zh":"左手试试弹一个 arp（琶音），和弦会更顺滑。"},{"en":"The intro uses a simple arp pattern on the piano.","zh":"前奏在钢琴上用了一个简单的 arp（琶音）型。"}]},{"partOfSpeech":"v.","definition":{"en":"(music production, informal) To play or program an arpeggio, especially with a synthesizer’s arpeggiator.","zh":"（音乐制作，非正式）弹/编一个琶音，尤其指用合成器的琶音器（arpeggiator）来演奏或编程。"},"examples":[{"en":"Let’s arp the chord and add a slow filter sweep.","zh":"我们把这个和弦做成琶音，再加一个慢慢打开的滤波扫频。"},{"en":"I arped the same chord at different speeds to build tension.","zh":"我把同一个和弦用不同速度做成琶音来增加张力。"}]}],"synonyms":["Address Resolution Protocol (ARP)","arpeggio (informal: arp)","arpeggiate"],"phonetic":"/ɑrp/","extraExplanation":["在网络里，ARP 常见于“ARP request/ARP reply（请求/应答）”以及“ARP table/cache（ARP 表/缓存）”。它主要在同一网段的局域网内工作。","在音乐语境中，arp 多见于乐手口语、编曲笔记或合成器界面（如“ARP on/off”“arp rate”）。正式写法通常是 arpeggio 或 arpeggiator。"]}
{"word":"ARPA","summary":{"en":"ARPA is the former name of a U.S. defense research agency (later DARPA), known for funding pioneering projects like ARPANET.","zh":"ARPA 是美国国防科研机构的旧称（后更名为 DARPA），以资助 ARPANET 等开创性项目而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbr.) Advanced Research Projects Agency: a former U.S. Department of Defense agency that funded high-risk, cutting-edge research; it was later renamed DARPA.","zh":"（缩写）美国国防部“高级研究计划局”：曾负责资助高风险、前沿科研项目的机构，后来更名为 DARPA。"},"examples":[{"en":"ARPA funded early computer networking research that helped shape the modern internet.","zh":"ARPA 资助了早期计算机网络研究，这些研究推动了现代互联网的发展。"},{"en":"In the 1960s, ARPA supported university labs working on advanced computing.","zh":"在 20 世纪 60 年代，ARPA 支持高校实验室开展先进计算研究。"}]}],"synonyms":["DARPA (later name)"],"phonetic":"/ˈɑr.pə/","extraExplanation":["ARPA 最著名的项目之一是 ARPANET（阿帕网），它常被视为互联网的早期雏形。","ARPA 在 1972 年左右改名为 DARPA（Defense Advanced Research Projects Agency）。因此在历史材料里你会看到 ARPA 与 DARPA 的称呼交替出现。","在语言/语音学领域你也可能见到 “ARPAbet”，那是一套用拉丁字母表示英语音素的标注系统；不过 ARPA 单独出现时通常指该机构。"]}
{"word":"ARPANET","summary":{"en":"ARPANET was an early U.S. research network and a major predecessor of the Internet.","zh":"ARPANET是美国早期的研究网络，也是互联网的重要前身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a pioneering U.S. computer network (1960s–1980s) built by the U.S. Department of Defense’s ARPA, widely considered the direct precursor to today’s Internet","zh":"美国在20世纪60–80年代由国防部ARPA（高级研究计划署）资助建立的开创性计算机网络，普遍被认为是当今互联网的直接前身"},"examples":[{"en":"ARPANET connected universities and research labs so they could share computing resources.","zh":"ARPANET把大学和研究机构连接起来，以便共享计算资源。"},{"en":"Many people describe ARPANET as the network that laid the groundwork for the modern Internet.","zh":"很多人把ARPANET称为奠定现代互联网基础的网络。"},{"en":"Email became one of the first “killer apps” on ARPANET.","zh":"电子邮件成为ARPANET上最早的“杀手级应用”之一。"}]}],"synonyms":["the early Internet","precursor to the Internet","research network"],"phonetic":"/ˈɑr.pə.nɛt/","extraExplanation":["ARPANET是“Advanced Research Projects Agency Network”的缩写（高级研究计划署网络）。它推动了分组交换（packet switching）与TCP/IP等关键思想的发展；1983年ARPANET切换到TCP/IP常被视为互联网形成的重要里程碑。","在流行文化和历史写作中，ARPANET常被用来象征“互联网的起点”，也常出现在技术史书籍与纪录片里。"]}
{"word":"arpanet","summary":{"en":"ARPANET was an early U.S. research network and an important predecessor of the Internet.","zh":"ARPANET 是美国早期的研究网络，也是互联网的重要前身之一。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The first major wide-area computer network, created in the United States (late 1960s) to connect research institutions; it later became a key technical foundation for today’s Internet.","zh":"美国在20世纪60年代末建立的首个重要广域计算机网络，用于连接研究机构；后来成为现代互联网的重要技术基础。"},"examples":[{"en":"ARPANET connected universities and labs so researchers could share computing resources.","zh":"ARPANET把大学和实验室连接起来，让研究人员可以共享计算资源。"},{"en":"Many Internet ideas—like packet switching—were tested on ARPANET.","zh":"许多互联网理念（如分组交换）最早在ARPANET上得到测试。"}]}],"synonyms":["Advanced Research Projects Agency Network"],"phonetic":"/ˈɑr.pəˌnɛt/","extraExplanation":["ARPANET 是 “Advanced Research Projects Agency Network” 的缩写，其中 ARPA 是美国国防部的高级研究计划署（后来改名为 DARPA）。","它常被提到与“分组交换（packet switching）”和早期网络通信协议的发展有关；不过现代互联网并不等同于 ARPANET，而是在其经验与技术基础上发展起来的。","大小写提示：通常写作 ARPANET（全大写），也有人写 arpanet；在正式写作中更常用全大写。"]}
{"word":"arpeggiando","summary":{"en":"A musical direction meaning “play as an arpeggio,” with chord notes sounded one after another.","zh":"一个音乐术语，表示“用琶音来演奏”，把和弦音依次弹出。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(music) In the manner of an arpeggio—playing the notes of a chord one after another (not all at once).","zh":"（音乐）以琶音的方式——把和弦的音一个接一个地弹（而不是同时弹出）。"},"examples":[{"en":"Play the left hand arpeggiando to keep the accompaniment light.","zh":"左手用 arpeggiando（琶音式）来弹，让伴奏更轻盈。"},{"en":"The composer marks the opening chord arpeggiando.","zh":"作曲家在开头的和弦上标注 arpeggiando（琶音式演奏）。"}]}],"synonyms":["arpeggiato","in arpeggio","broken-chord style"],"phonetic":"/ɑrˌpɛdʒiˈɑndoʊ/","extraExplanation":["“Arpeggiando”来自意大利语，是乐谱里常见的演奏指示（类似“legato / staccato”这类术语）。通常表示把一个和弦“分解”成从低到高（或相反）的连续音。","在钢琴谱上，arpeggiando 常用一个竖向的波浪线标在和弦旁边，提示演奏者将和弦快速分开弹，而不是齐奏；有时也会写作 “arpeggiato”。"]}
{"word":"arpeggiated","summary":{"en":"“Arpeggiated” describes music where a chord is broken into notes played one after another (an arpeggio).","zh":"“arpeggiated”指把和弦分解成音符依次弹出的琶音式演奏/写作。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Played as an arpeggio (a chord’s notes sounded one after another, not all at once).","zh":"以琶音方式演奏的（把和弦的音一个接一个弹出，而不是同时按下）。"},"examples":[{"en":"The guitarist played an arpeggiated C major chord.","zh":"吉他手用琶音方式弹奏了一个C大调和弦。"},{"en":"The piano part is arpeggiated to make the harmony feel lighter.","zh":"钢琴声部用琶音处理，让和声听起来更轻盈。"}]},{"partOfSpeech":"v.","definition":{"en":"To play or write (music) as arpeggios; to break a chord into successive notes.","zh":"把（音乐/和弦）写成或演奏成琶音；把和弦分解成依次出现的音。"},"examples":[{"en":"She arpeggiated the chord slowly to create a calm mood.","zh":"她缓慢地把和弦分解成琶音，营造出平静的氛围。"},{"en":"In this passage, the composer arpeggiates the left hand.","zh":"在这一段里，作曲家让左手以琶音形式进行。"}]}],"synonyms":["broken-chord","rolled (chord)","arpeggio-style"],"phonetic":"/ɑɹˈpɛdʒi.eɪtɪd/","extraExplanation":["“arpeggiated”来自“arpeggio（琶音）”。在乐谱里常见标记有“arpegg.”或一个竖向波浪线（表示从低音到高音依次弹奏，有时也可反向）。","常见搭配：arpeggiated chord（琶音和弦）、arpeggiated accompaniment（琶音伴奏）、arpeggiated figure/pattern（琶音型/琶音织体）。","对比：blocked chord / solid chord（柱式和弦，音同时响） vs. arpeggiated chord（琶音和弦，音依次响）。","在文学/评论语境里，“arpeggiated”也可用来形容声音或意象“像琶音般流动、分散、闪烁”，多见于音乐评论或描写性文字。"]}
{"word":"arpeggiation","summary":{"en":"Arpeggiation is the technique of playing a chord’s notes one by one rather than simultaneously.","zh":"Arpeggiation 指把和弦音依次弹奏/演奏的“琶音化”技巧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In music, the act or technique of playing the notes of a chord one after another (rather than all at the same time).","zh":"（音乐）琶音化：把和弦的音一个接一个弹奏/演奏（而不是同时按下/奏出）的技巧或做法。"},"examples":[{"en":"The guitarist added arpeggiation to make the chord progression sound more flowing.","zh":"吉他手加入琶音化，让和弦进行听起来更流畅。"},{"en":"In the intro, the piano uses gentle arpeggiation instead of block chords.","zh":"在前奏里，钢琴用柔和的琶音化来代替柱式和弦。"}]}],"synonyms":["arpeggio playing","broken-chord technique","arpeggio technique"],"phonetic":"/ɑrˌpɛdʒiˈeɪʃən/","extraExplanation":["“Arpeggiation”来自“arpeggio（琶音）”。在乐谱里，琶音常见标记是和弦旁边的一条竖向波浪线，表示要从低音到高音（或反向）依次弹奏。","琶音化常用于钢琴、吉他与竖琴（harp）等乐器，用来制造连贯、闪烁或更“铺开”的和声效果；在流行与古典配器中都很常见。"]}
{"word":"arpeggio","summary":{"en":"An arpeggio is a chord played as a sequence of notes, not all at once.","zh":"arpeggio 指把和弦音按顺序依次弹/奏出来的“琶音”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In music, a chord played by sounding its notes one after another (up or down) rather than all at the same time.","zh":"（音乐）琶音：把一个和弦的音按顺序（向上或向下）依次弹/奏出来，而不是同时发声。"},"examples":[{"en":"The pianist played an arpeggio to introduce the melody.","zh":"钢琴家用一段琶音来引出旋律。"},{"en":"Try practicing the C major arpeggio slowly and evenly.","zh":"试着把C大调琶音练得慢一些、均匀一些。"},{"en":"The guitar part is full of soft arpeggios.","zh":"吉他声部里充满了柔和的琶音。"}]}],"synonyms":["broken chord"],"phonetic":"/ɑrˈpɛdʒioʊ/","extraExplanation":["“arpeggio”来自意大利语，和“arpa”（竖琴）有关：竖琴常常以分解和弦的方式拨弦，因此这种“像竖琴一样把和弦拆开弹”的效果就叫琶音。","学习提示：arpeggio 强调“和弦的音一个接一个”；对比：chord（和弦）强调“同时按/奏出多个音”。"]}
{"word":"arpeggioed","summary":{"en":"“Arpeggioed” means a chord was played as separate notes in sequence (as an arpeggio).","zh":"“arpeggioed”表示把和弦分解成琶音，单个音按顺序演奏。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of arpeggio) To play or arrange a chord as separate notes in sequence rather than all at once.","zh":"（arpeggio 的过去式/过去分词）把和弦拆成单个音按顺序弹奏/演奏，而不是同时按下。"},"examples":[{"en":"She arpeggioed the chord softly to make the melody stand out.","zh":"她轻轻地把这个和弦分解弹奏，让旋律更突出。"},{"en":"The guitarist arpeggioed the harmony instead of strumming it.","zh":"吉他手没有扫弦，而是把和声做了分解弹奏。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describes music (or a chord) that has been played as an arpeggio—notes sounded one after another.","zh":"形容（音乐或和弦）被分解成琶音来演奏——音符依次出现。"},"examples":[{"en":"The arpeggioed accompaniment gave the song a flowing, shimmering feel.","zh":"分解和弦的伴奏让这首歌有一种流动、闪烁的感觉。"},{"en":"He practiced the arpeggioed pattern slowly, then increased the speed.","zh":"他先慢速练习这个琶音型，再逐渐加快速度。"}]}],"synonyms":["arpeggiated","broken (chord)","rolled (chord)"],"phonetic":"/ɑrˈpɛdʒioʊd/","extraExplanation":["“arpeggio”来自意大利语，和“harp（竖琴）”有关：竖琴常常把和弦的音分开依次拨奏，所以这种“分解和弦”的方式就叫 arpeggio。","“arpeggioed”在现代英文里相对少见，写作中更常见的是用“played as arpeggios / arpeggiated（分解成琶音）”来表达同样意思。"]}
{"word":"arpeggios","summary":{"en":"Arpeggios are chord notes played one by one rather than together.","zh":"Arpeggios 指把和弦音按顺序一个个弹出的“琶音/分解和弦”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Broken chords: the notes of a chord played one after another (up or down) instead of all at the same time.","zh":"琶音／分解和弦：把一个和弦的音按顺序（向上或向下）一个个弹出，而不是同时弹出。"},"examples":[{"en":"The pianist warmed up with arpeggios before practicing the piece.","zh":"钢琴家在练习曲子前先用琶音热身。"},{"en":"Play the chord as arpeggios: C–E–G–C.","zh":"把和弦用琶音弹出来：C–E–G–C。"},{"en":"Guitar arpeggios can make a simple progression sound more flowing.","zh":"吉他的琶音能让简单的和弦进行听起来更流畅。"}]}],"synonyms":["broken chords"],"phonetic":"/ɑrˈpɛdʒioʊz/","extraExplanation":["“arpeggios”是“arpeggio”的复数。词源与意大利语有关，来自“arpa（竖琴）”，因为琶音的效果像竖琴拨弦那样把音符依次展开。","在乐谱里常见的记号是和弦旁的波浪竖线（像一条竖着的波浪线），表示把和弦音从低到高（或相反）依次弹出。"]}
{"word":"arpen","summary":{"en":"“Arpen” isn’t a standard English word; it’s probably “sharpen,” meaning to make something sharper or to improve/clarify something.","zh":"“arpen”不是标准英语词；多半是“sharpen”的误拼，意思是“使更锋利”或“提升/让…更清晰有效”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard) Likely a misspelling of “sharpen.”","zh":"（非标准用法）很可能是“sharpen”的拼写错误。"},"examples":[{"en":"I think you meant “sharpen,” as in “sharpen a pencil.”","zh":"我想你想写的是“sharpen”，比如“sharpen a pencil（削铅笔）”。"}]},{"partOfSpeech":"vt.","definition":{"en":"To make something have a sharper edge or point; to make it able to cut better.","zh":"使（刀、剪、铅笔等）更锋利；把边缘或尖端弄得更尖、更利。"},"examples":[{"en":"He sharpened the knife before cooking.","zh":"他做饭前把刀磨锋利了。"},{"en":"Can you sharpen my pencil?","zh":"你能帮我削一下铅笔吗？"}]},{"partOfSpeech":"vt.","definition":{"en":"To improve or develop a skill, an idea, or a plan so it becomes clearer or more effective.","zh":"提高或打磨（技能、想法、计划等），使其更清晰、更有效。"},"examples":[{"en":"She took a writing class to sharpen her skills.","zh":"她上了写作课来提升写作能力。"},{"en":"Let’s sharpen our argument before the debate.","zh":"在辩论前我们把论点再打磨一下。"}]},{"partOfSpeech":"vi.","definition":{"en":"To become stronger, clearer, or more intense.","zh":"（程度、感觉、对比等）变得更强烈、更清晰、更明显。"},"examples":[{"en":"The wind sharpened as night fell.","zh":"夜幕降临时风更猛烈了。"},{"en":"The contrast between the two colors sharpened in bright light.","zh":"在强光下这两种颜色的对比更明显了。"}]}],"synonyms":["hone","refine","whet","point","intensify","clarify"],"phonetic":"ˈʃɑrpən","extraExplanation":["“sharpen”常见搭配：sharpen a knife（磨刀）、sharpen a pencil（削铅笔）、sharpen your focus（提高专注力）、sharpen your mind（让头脑更敏锐）。","近义词里“hone”偏“长期打磨技能”；“whet”更书面，常见于固定搭配 whet your appetite（吊胃口/勾起兴趣），不要写成 *wet*。"]}
{"word":"arpens","summary":{"en":"“Arpent” is a historical French unit used to measure land (and sometimes length), common in old property and surveying contexts; “arpens” is likely a misspelling.","zh":"“arpent”是历史上的法语计量单位，用来量土地（有时也量长度），常见于旧地契与勘测语境；“arpens”多半是误拼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a French (and historically Louisiana) unit of land measurement; its exact size varies by place and time, but it is roughly similar to an acre","zh":"一种法语地区（以及历史上路易斯安那）使用的土地面积单位；具体大小因地区与年代而异，大致接近“英亩”"},"examples":[{"en":"The old deed says the farm included 40 arpents of land.","zh":"这份旧地契写着这座农场包含40 arpents 的土地。"},{"en":"In Louisiana history, people sometimes described property in arpents along the river.","zh":"在路易斯安那的历史语境里，人们有时会用 arpents 来描述沿河的地产。"}]},{"partOfSpeech":"n.","definition":{"en":"a measure of length used in surveying (especially in French colonial contexts)","zh":"一种用于测量/勘测的长度单位（多见于法属殖民历史语境）"},"examples":[{"en":"The boundary was marked as several arpents from the oak tree.","zh":"边界被标记为距离那棵橡树若干个 arpent。"}]}],"synonyms":["French land measure","historic unit","acre (approx.)"],"phonetic":"/ɑrˈpɑnt/","extraExplanation":["“arpens”通常不是标准拼写；更常见的是 **arpent**（单数）和 **arpents**（复数）。如果你是在旧地图、地契、或路易斯安那/法裔加拿大相关文本里看到“arpens”，很可能是拼写误差或地方写法。","词源来自法语 **arpent**。在英语里它多用于历史、法律文件、地理与地方文化叙述中，而不是现代日常计量。"]}
{"word":"arpent","summary":{"en":"Arpent is an old French unit used to measure land (and sometimes length), especially in historical records from French-speaking North America.","zh":"Arpent是旧时法国的度量单位，主要用于测量土地面积（有时也指长度），常见于北美法语地区的历史文献。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former French unit for measuring land area, used especially in French-speaking North America (e.g., Louisiana and Quebec); it is roughly 0.85 acre (about 0.34 hectare), though it varied by place and time","zh":"（旧时）法国的土地面积单位，尤其用于法语地区的北美（如路易斯安那、魁北克）；大约相当于0.85英亩（约0.34公顷），但会因地区与时期而不同"},"examples":[{"en":"The deed described the farm as “twenty arpents of land.”","zh":"地契把这块农地描述为“二十阿尔邦（arpents）的土地”。"},{"en":"In old Louisiana records, land grants are often listed in arpents rather than acres.","zh":"在路易斯安那的旧档案里，土地授予常用arpents记载，而不是用英亩。"}]},{"partOfSpeech":"n.","definition":{"en":"a former French unit of length (used in surveying), about 192 feet (about 58 meters), though it could vary","zh":"（旧时）法国的长度单位（常用于测量/测绘），约192英尺（约58米），但也可能有地区差异"},"examples":[{"en":"The boundary line was recorded as several arpents in length.","zh":"边界线的长度被记录为若干个arpents。"}]}],"synonyms":["(approx.) acre","land measure","surveying unit"],"phonetic":"/ɑrˈpɑnt/","extraExplanation":["arpent源自法语，常见于法国殖民历史相关的地契、测量记录与地名研究中。尤其在路易斯安那的“长条地”（long-lot）土地分配体系里，地块常以河岸为正面，向内陆延伸，文件里会频繁出现arpents作为宽度或深度的单位。","阅读历史文献时，arpent的具体换算可能因地区与年代不同而略有差异；遇到学术或法律文本，最好查看该文献采用的标准。"]}
{"word":"arpenteur","summary":{"en":"An *arpenteur* is a (usually Canadian or historical) term for a land surveyor.","zh":"*arpenteur* 指（土地）测量员/测量师，多用于加拿大或历史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in Canada or in historical contexts) a land surveyor; a person trained to measure and map land.","zh":"（尤指加拿大或历史语境中）土地测量员；负责测量与绘制土地的人。"},"examples":[{"en":"In Quebec, an arpenteur may be hired to mark property boundaries before a house is built.","zh":"在魁北克，建房前可能会雇用一位 arpenteur 来标出地界。"},{"en":"The old map was drawn by an arpenteur working for the colonial administration.","zh":"这张旧地图是殖民政府雇用的测量员绘制的。"}]}],"synonyms":["surveyor","land surveyor","property surveyor"],"phonetic":"/ˌɑr.pɑnˈtɝ/","extraExplanation":["“arpenteur”来自法语，在英语里多见于加拿大英语（尤其与魁北克相关）或历史/法律文件中，常指“土地测量师”。在现代日常英语中更常用的对应词是 surveyor（或 land surveyor）。","法语里 arpenter 有“丈量土地、用步测量”的意思；因此 arpenteur 带有“进行地界测量与划分”的职业含义。"]}
{"word":"arpents","summary":{"en":"“Arpents” is the plural of “arpent,” a historical French unit used to measure land (and sometimes length).","zh":"“arpents”是“arpent”的复数，指一种历史上的法语土地计量单位（有时也用作长度单位）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plural of “arpent”: an old French unit of land area (and sometimes length), especially used historically in France and French-speaking regions such as Louisiana and Quebec.","zh":"“arpent”的复数：一种旧时的法语土地面积单位（有时也作长度单位），历史上常见于法国及法语地区，如路易斯安那、魁北克等。"},"examples":[{"en":"The deed described the farm as “twenty arpents of land.”","zh":"地契把那片农场描述为“二十 arpents 的土地”。"},{"en":"In Louisiana history, property sizes were often recorded in arpents.","zh":"在路易斯安那的历史文献中，土地面积常用 arpent 记录。"}]}],"synonyms":["acre (approx.)","hectare (approx.)","land measure"],"phonetic":"/ɑrˈpɑ̃/","extraExplanation":["arpent 源自法语，是旧制单位，不同地区大小不完全一致：作“面积”时，在路易斯安那常接近约 0.85 英亩（约 0.34 公顷），在加拿大/魁北克等地也有不同换算。阅读历史文献时，最好结合具体地区或原始说明来换算。","你可能会在“arpent system / arpent lines（长条形地块）”这类历史地理语境中看到它，常与河流沿岸分配土地的方式有关。"]}
{"word":"Arpin","summary":{"en":"Arpin is usually a proper noun: a surname (often French) or a place name (notably a village in Wisconsin).","zh":"Arpin 通常是专有名词：一个姓氏（常见法语背景）或一个地名（尤其指威斯康星州的 Arpin 村）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname (family name), most commonly of French origin","zh":"一个姓氏（家族姓），常见于法语文化背景"},"examples":[{"en":"Ms. Arpin will lead the meeting today.","zh":"Arpin 女士今天将主持会议。"},{"en":"The book was written by Jean Arpin.","zh":"这本书由 Jean Arpin 撰写。"}]},{"partOfSpeech":"other","definition":{"en":"a place name, especially Arpin, Wisconsin (a village in the United States)","zh":"一个地名，尤其指美国威斯康星州的 Arpin（一个村庄）"},"examples":[{"en":"They drove through Arpin, Wisconsin on their way to the park.","zh":"他们去公园的路上开车经过了威斯康星州的 Arpin。"},{"en":"Arpin is a small community with local events each year.","zh":"Arpin 是一个小社区，每年都有本地活动。"}]}],"phonetic":"/ɑrˈpɪn/","extraExplanation":["“Arpin”多见于法语姓氏体系（如法国或法裔移民家庭）。在英语语境中，它通常作为专有名词使用：要么是人的姓氏，要么是地名（如美国威斯康星州的 Arpin）。","专有名词在英语里一般首字母大写；读音可能因家庭或地区而略有不同，最好尊重当事人的自我发音。"]}
