{"word":"ARQ","summary":{"en":"ARQ is a technique that makes data transmission reliable by requesting retransmission when errors or losses occur.","zh":"ARQ 是一种在发生错误或丢包时通过请求重传来保证传输可靠性的技术。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(telecommunications, computing) Automatic Repeat reQuest: a method for reliable data transmission where the receiver asks the sender to resend (“repeat”) data if errors are detected or data is missing.","zh":"（电信/计算机）自动重传请求：一种可靠传输机制；接收方在检测到出错或丢包时，会请求发送方重新发送数据。"},"examples":[{"en":"ARQ improves reliability by retransmitting lost or corrupted packets.","zh":"ARQ 通过重传丢失或损坏的数据包来提高可靠性。"},{"en":"In this protocol, the receiver uses ARQ to request a resend when it detects an error.","zh":"在这个协议中，接收端在检测到错误时会用 ARQ 请求重发。"},{"en":"Stop-and-wait ARQ is simple but can be slow on long-distance links.","zh":"停止等待式 ARQ 很简单，但在长距离链路上可能较慢。"}]}],"synonyms":["automatic repeat request","retransmission protocol","error-control retransmission"],"phonetic":"/ˌeɪ ɑr ˈkjuː/","extraExplanation":["ARQ 常见于网络与无线通信（如 Wi‑Fi、蜂窝网络等）的“可靠传输”设计中。核心思想是：检测到错误就重发，以换取更高的正确率。","常见 ARQ 变体包括 stop-and-wait（停止等待）、Go-Back-N（回退 N 帧）、Selective Repeat（选择重传）。它们在“效率/延迟/实现复杂度”之间做不同权衡。","有时会与 FEC（前向纠错）一起使用：FEC 尽量在接收端直接纠错，ARQ 负责在纠错失败时重传。"]}
{"word":"arquated","summary":{"en":"“Antiquated” means old-fashioned or no longer suitable for modern times.","zh":"“Antiquated”指“过时的、陈旧的”，不再适合现代。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Old-fashioned; no longer modern, common, or useful.","zh":"过时的；陈旧的；不再现代或不再常用的。"},"examples":[{"en":"Some of the rules in this handbook are antiquated and need updating.","zh":"这本手册里有些规定已经过时，需要更新。"},{"en":"He has antiquated ideas about what women should do at work.","zh":"他对女性在职场该做什么的看法很陈旧。"},{"en":"The software still uses an antiquated system that often crashes.","zh":"这款软件仍在使用一个老旧的系统，经常崩溃。"}]},{"partOfSpeech":"vt.","definition":{"en":"To make something seem old-fashioned or outdated (often in passive voice).","zh":"使……显得过时（常用被动语态）。"},"examples":[{"en":"New technology quickly antiquated the older cameras.","zh":"新技术很快让旧款相机显得过时了。"},{"en":"Many traditional jobs were antiquated by automation.","zh":"许多传统工作被自动化迅速淘汰了。"}]}],"synonyms":["outdated","old-fashioned","obsolete","archaic","dated"],"phonetic":"/ænˈtɪkweɪtɪd/","extraExplanation":["你输入的“arquated”很可能是拼写错误，常见的正确拼写是 antiquated。","antiquated 来自拉丁语词根 antiqua-（“古老的”），常用来形容“观念/制度/设备/说法”等已经不合时代。语气通常偏负面（=落伍）。","近义词辨析：old-fashioned（有时只是“复古/传统”，不一定强烈负面）；outdated（更中性，强调“已不再适用/不再最新”）；obsolete（更强，强调“已经被淘汰不用”）。"]}
{"word":"arquebus","summary":{"en":"An early shoulder-fired firearm used in the 15th–17th centuries, often matchlock-operated.","zh":"15至17世纪常见的一种早期肩射火器，早期多为火绳点火。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An early type of long gun (a handheld firearm) used mainly in the 15th–17th centuries, fired from the shoulder and originally lit with a matchlock.","zh":"一种早期的长枪（手持火器），主要在15至17世纪使用；通常肩射，早期多为火绳点火（火绳枪机构）。"},"examples":[{"en":"The soldiers carried arquebuses instead of modern rifles.","zh":"士兵们携带的是火绳枪（arquebus），而不是现代步枪。"},{"en":"In the museum, you can see an arquebus with a wooden stock and a metal barrel.","zh":"在博物馆里，你可以看到一把带木枪托和金属枪管的火绳枪。"},{"en":"Arquebuses changed warfare by making armor less effective.","zh":"火绳枪改变了战争方式，使盔甲的防护效果变得没那么可靠。"}]}],"synonyms":["matchlock gun","early firearm","hand cannon (historical, related)"],"phonetic":"ˈɑr.kə.bəs","extraExplanation":["“arquebus”常译为“火绳枪/钩铳/鸟铳”，具体译法会随地区与历史语境不同而变化。它比“musket（火枪/燧发枪时代常见的滑膛枪）”更早、口径通常更小，后来逐渐被更重、更成熟的火枪类型取代。","词源大致来自中古法语/荷兰语一类词形（如 harquebuse/haakbus），与“钩（hook）”有关：早期有些枪会用钩抵住城墙或支撑物来吸收后坐力。","在历史文学或历史小说中，常见搭配有“matchlock arquebus（火绳式火绳枪）”“arquebusier（火绳枪兵）”。"]}
{"word":"arquebuses","summary":{"en":"“Arquebuses” means early long guns used in the 15th–17th centuries (plural form).","zh":"“Arquebuses”指15—17世纪常见的早期长枪/火器（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of arquebus: an early type of long gun (a shoulder-fired firearm) used mainly in Europe and Asia from the 1400s to the 1600s.","zh":"arquebus 的复数：一种早期的长枪（肩射火器），主要在15至17世纪的欧洲与亚洲使用。"},"examples":[{"en":"The museum displays swords, armor, and arquebuses from the 1500s.","zh":"博物馆展出了16世纪的刀剑、盔甲和火绳枪。"},{"en":"Infantry lines fired their arquebuses in volleys before reloading.","zh":"步兵列队齐射火绳枪，然后再装填。"}]}],"synonyms":["matchlock guns","early muskets","handguns (historical)"],"phonetic":"/ˈɑr.kə.bəs/","extraExplanation":["“arquebus（火绳枪/早期火器）”常被视为“musket（火枪）”的前身或近亲。早期 arquebus 往往用火绳点火（matchlock），后来逐步被更强、更可靠的 muskets 取代。","词源来自法语/荷兰语等欧洲语言，指一种带钩或早期枪械形式；在历史写作中常用来营造“早期火器时代”的氛围。"]}
{"word":"arquebusier","summary":{"en":"An arquebusier is a person (usually a soldier) who uses an arquebus, an early firearm.","zh":"arquebusier 指使用火绳枪（早期火器）的士兵（有时也指与其相关的工匠）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A soldier or craftsman associated with an arquebus (an early type of gun): either someone who used it in battle or, less commonly, someone who made or maintained it.","zh":"与“火绳枪（arquebus，一种早期火器）”有关的人：通常指使用火绳枪作战的士兵；较少见也可指制造或维护这种武器的工匠。"},"examples":[{"en":"In the 16th century, arquebusiers often fought alongside pikemen on the battlefield.","zh":"在16世纪，火绳枪兵常常与长枪兵并肩作战。"},{"en":"The novel describes an arquebusier taking careful aim before firing through the smoke.","zh":"小说描写一名火绳枪兵在烟雾中小心瞄准后开火。"}]}],"synonyms":["harquebusier","musketeer (broader/related)","soldier"],"phonetic":"/ˌɑr.kəˈbʌs.i.ɚ/","extraExplanation":["“arquebusier”来自法语 *arquebusier*，与“arquebus（火绳枪）”同源。它多出现在16—17世纪的欧洲战争语境中，代表从冷兵器向火器过渡时期的步兵类型。","在历史与文学作品里，arquebusiers 常被用来营造“早期火器时代”的氛围：装填慢、烟雾大、射击需要队列配合，因此常与“长枪兵（pikeman）/火枪兵（musketeer）”一起出现。"]}
{"word":"arquerite","summary":{"en":"Arquerite is a rare mineral: a natural silver–mercury amalgam.","zh":"Arquerite 指一种稀有矿物：银与汞的天然合金（银汞齐）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare mineral made of a natural alloy (amalgam) of silver and mercury.","zh":"一种稀有矿物，为银与汞的天然合金（银汞齐）。"},"examples":[{"en":"Arquerite is classified as a silver–mercury amalgam mineral.","zh":"Arquerite 被归类为银—汞银汞齐类矿物。"},{"en":"The sample contained arquerite along with other silver-bearing minerals.","zh":"该样品含有 arquerite，并伴生其他含银矿物。"}]}],"synonyms":["silver amalgam","silver–mercury amalgam"],"phonetic":"/ˈɑrkəˌraɪt/","extraExplanation":["该词多用于矿物学/地质学语境，日常英语中几乎不会出现；在一般科普或新闻里更常见的说法是“silver amalgam（银汞齐）”。","词尾 -ite 常见于矿物名称（如 calcite, hematite），通常表示“某种矿物”。"]}
{"word":"arquifoux","summary":{"en":"“Arquifoux” is not recognized as a standard English word; it’s likely a misspelling or a proper name.","zh":"“arquifoux”不是标准英语词汇；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling, a username/brand name, or a word from another language rather than established English vocabulary.","zh":"不是标准英语词汇。更可能是拼写错误、用户名/品牌名，或来自其他语言的词，而非英语常用词。"},"examples":[{"en":"I couldn’t find “arquifoux” in an English dictionary—could you share a sentence where you saw it?","zh":"我在英文词典里查不到“arquifoux”——你能提供它出现的句子吗？"},{"en":"If you meant “archenemy,” you could say: “He became her archenemy at work.”","zh":"如果你想说的是“archenemy（宿敌）”，可以说：“他成了她在职场上的宿敌。”"}]}],"synonyms":["archenemy","archrival","archfiend"],"phonetic":"/ˌɑrkiˈfuks/","extraExplanation":["“arquifoux”看起来像是把英语前缀 arch-（意为“最…的/主要的”，如 archenemy 宿敌、archrival 头号对手）和一个不常见的词尾拼在一起，或是受到法语/西语拼写影响的造词。","如果你能告诉我它出现的来源（书名、游戏、社媒账号、文章截图或上下文句子），我可以更准确判断它是否是专有名词、外来词，或应改成某个常见英语单词。"]}
{"word":"Arquit","summary":{"en":"Acquit means to declare someone not guilty in court, or to clear someone of blame or responsibility; “acquit yourself” means to perform in a certain way (often well).","zh":"acquit 指（法律上）宣判无罪，也可指洗清责备/责任；acquit yourself 指（常在困难情境中）表现如何，常含“表现不错”之意。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Law) To officially decide in court that someone is not guilty of a crime.","zh":"（法律）在法庭上正式判定某人无罪。"},"examples":[{"en":"The jury acquitted him of all charges.","zh":"陪审团裁定他所有指控都不成立（宣判无罪）。"},{"en":"She was acquitted after the new evidence was presented.","zh":"新证据出示后，她被宣判无罪。"}]},{"partOfSpeech":"vt.","definition":{"en":"To free someone from blame, duty, or a feeling of guilt; to clear responsibility.","zh":"免除责备/义务/内疚；洗清责任。"},"examples":[{"en":"I don’t think that excuses acquit him of responsibility.","zh":"我不认为这些借口能免除他的责任。"},{"en":"He tried to acquit himself of any wrongdoing.","zh":"他试图证明自己没有不当行为（洗清嫌疑）。"}]},{"partOfSpeech":"phrase","definition":{"en":"(Phrase) “Acquit yourself”: to do something in a particular way, especially in a difficult situation (often meaning ‘perform well’).","zh":"（短语）acquit yourself：在（困难）情况下表现如何（常指“表现得不错”）。"},"examples":[{"en":"She acquitted herself well in the interview.","zh":"她在面试中表现得很好。"},{"en":"The team acquitted itself admirably under pressure.","zh":"球队在压力下表现得很出色。"}]}],"synonyms":["clear","exonerate","vindicate","absolve"],"phonetic":"/əˈkwɪt/","extraExplanation":["你输入的“Arquit”在英语里不是常见标准拼写；最可能是想写“acquit”。“acquit”常用于法律语境（陪审团/法官宣判无罪），也可引申为“洗清责任/免除责备”。","易混词：acquit（宣判无罪/洗清）≠ quit（退出/辞职）≠ quiet（安静的）≠ quite（相当）。"]}

