{"word":"arr","summary":{"en":"“arr” is an informal exclamation (often pirate-like) showing strong feeling, and it can also be an abbreviation like “arr.” for “arrival” or “arrangement.”","zh":"“arr”可作非正式感叹词（常带海盗腔）表达强烈情绪，也可作缩写如“arr.”表示“到达”或“编曲/改编”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(informal) An exclamation used to show annoyance, frustration, or strong emotion; often written as “arr!” or “argh!”","zh":"（非正式）表示恼火、沮丧或强烈情绪的感叹；常写作“arr!”或“argh!”"},"examples":[{"en":"Arr! I can’t find my keys again.","zh":"啊！我又找不到钥匙了。"},{"en":"Arr, this computer is so slow today.","zh":"哎呀，这台电脑今天也太慢了。"}]},{"partOfSpeech":"int.","definition":{"en":"A playful “pirate” sound in English (a stereotypical pirate way of speaking in movies and stories).","zh":"英语里模仿“海盗腔”的玩笑式声音（电影、故事中对海盗说话方式的刻板印象）。"},"examples":[{"en":"At the costume party he shouted, “Arr, matey!”","zh":"在化装派对上，他喊道：“啊哈，伙计！”"},{"en":"The kids practiced pirate talk: “Arr! Shiver me timbers!”","zh":"孩子们练习海盗腔：“啊！吓死我了！（海盗式夸张说法）”"}]},{"partOfSpeech":"other","definition":{"en":"(Abbreviation, less common) Short for words like “arrival” (arr.) in schedules or “arrangement” in music (arr.).","zh":"（缩写，不太常见）在时刻表里可表示“到达”（arr.），在音乐里可表示“编曲/改编”（arr.）。"},"examples":[{"en":"Flight arr. 6:10 PM (arrival time).","zh":"航班 arr. 下午6:10（到达时间）。"},{"en":"Song title (arr. John Smith).","zh":"曲名（arr. John Smith，编曲：John Smith）。"}]}],"synonyms":["argh","ugh","grr"],"phonetic":"/ɑr/","extraExplanation":["“Arr/Arrr”作为“海盗语气词”主要来自英语流行文化（尤其是电影与舞台表演），并不是历史上海盗真实、固定的说话方式。","写作上常见变体有 arr、arrr、argh、aargh；表达“懊恼”时更常用 argh/ugh，在正式写作中通常不使用。"]}
{"word":"arracach","summary":{"en":"Arracacha is an Andean root vegetable used like carrots or potatoes in cooking.","zh":"Arracacha 是一种安第斯地区的根茎蔬菜，烹饪用途类似胡萝卜或土豆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a South American root vegetable (Arracacia xanthorrhiza), similar to a carrot or parsnip, often used in soups, stews, and purées.","zh":"一种南美根茎蔬菜（学名 Arracacia xanthorrhiza），外形与胡萝卜或欧防风（parsnip）相似，常用于汤、炖菜或做成泥。"},"examples":[{"en":"In Colombia, arracacha is often cooked in chicken soup for a mild, sweet flavor.","zh":"在哥伦比亚，arracacha 常被煮进鸡汤里，带来温和微甜的味道。"},{"en":"You can mash arracacha like potatoes and serve it with roasted meat.","zh":"你可以把 arracacha 像土豆一样压成泥，配烤肉一起吃。"},{"en":"The stew thickened naturally after we added sliced arracacha.","zh":"我们加入切片的 arracacha 后，炖菜自然变得更浓稠。"}]}],"synonyms":["Peruvian carrot","Andean root (vegetable)"],"phonetic":"/ˌærəˈkɑːtʃə/","extraExplanation":["你输入的“arracach”常见是拼写少了一个字母，正确拼写通常为 **arracacha**。","arracacha 在安第斯地区（如秘鲁、哥伦比亚、厄瓜多尔）较常见；英语语境里有时也会写作 *Peruvian carrot*（秘鲁胡萝卜），但它并不是普通胡萝卜。"]}
{"word":"arracacha","summary":{"en":"Arracacha is a South American root vegetable used much like a potato, especially in soups and stews.","zh":"Arracacha 是一种南美洲的根茎蔬菜，常像土豆一样烹调，尤其常用于汤和炖菜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A South American root vegetable with a mild, sweet, nutty flavor, often cooked like potatoes or used in soups and stews.","zh":"一种南美洲的根茎类蔬菜，味道温和、微甜带坚果香，常像土豆一样烹调或用于汤和炖菜。"},"examples":[{"en":"In Colombia, arracacha is often added to soups for a creamy texture.","zh":"在哥伦比亚，arracacha 常被加入汤里，让口感更绵密。"},{"en":"You can mash arracacha with butter and salt like mashed potatoes.","zh":"你可以把 arracacha 像土豆泥一样加黄油和盐来捣碎食用。"}]}],"synonyms":["Peruvian carrot","mandioquinha"],"phonetic":"/ˌærəˈkætʃə/","extraExplanation":["Arracacha 在英语里多作为外来词使用，常见于拉丁美洲菜谱与超市标识。它在西语中也常被称为 “apio criollo” 或 “mandioquinha”（尤其在巴西常见）。","在烹饪语境中，你可能会看到它被描述为介于胡萝卜与土豆之间的风味与质地；英文食谱里也会把它叫作 “Peruvian carrot”（但并非真正的胡萝卜）。"]}
{"word":"Arracacia","summary":{"en":"Arracacia is a botanical genus in the carrot family, known because it includes edible-root plants like arracacha.","zh":"Arracacia 是伞形科的一个植物属，因为包含可食用根茎作物（如 arracacha/阿拉卡恰）而被提及。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of plants in the carrot family (Apiaceae), native to Central and South America; some species are grown for their edible roots (such as arracacha).","zh":"（植物）阿拉卡西亚属：伞形科的一类植物，原产中南美洲；其中一些种类可食用其根（如常见的“arracacha/阿拉卡恰”）。"},"examples":[{"en":"Arracacia includes several species related to carrots and parsley.","zh":"Arracacia 属包含多种与胡萝卜、欧芹同科的植物。"},{"en":"In Andean cuisine, a plant from the Arracacia group may be used as a starchy root vegetable.","zh":"在安第斯地区的饮食中，Arracacia 相关植物有时会作为富含淀粉的根茎蔬菜使用。"}]}],"synonyms":["arracacha (related species/common name)"],"phonetic":"ˌærəˈkeɪʃiə","extraExplanation":["“Arracacia”更常见于植物学语境，是一个“属名”（genus）。日常饮食或市场里，人们更可能看到的是“arracacha”（阿拉卡恰，一种可食用根茎作物），它属于 Arracacia 这个属。","词源上与西班牙语/南美地区的土著语言转写有关，因此拼写与发音在不同资料中可能略有差异；学习时可把它当作“植物学拉丁名”，通常首字母大写（Arracacia）。"]}
{"word":"arracacia","summary":{"en":"Arracacia is mainly a botanical genus name; in everyday food contexts it’s sometimes (incorrectly) used for arracacha, the edible root.","zh":"Arracacia 主要是植物學上的屬名；在日常飲食語境中，有時（不太標準地）用來指可食用根莖 arracacha（阿拉卡恰）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany) A genus of flowering plants in the carrot/parsley family (Apiaceae), native mainly to Central and South America.","zh":"（植物學）繖形科（胡蘿蔔／芹菜家族）的一個植物屬，主要原產於中南美洲。"},"examples":[{"en":"Arracacia includes species related to carrots and parsley.","zh":"Arracacia 這個屬包含一些與胡蘿蔔和歐芹有親緣關係的物種。"},{"en":"Scientists classify arracacha under the genus Arracacia.","zh":"科學家把「arracacha（阿拉卡恰）」歸類在 Arracacia 這個屬之下。"}]},{"partOfSpeech":"n.","definition":{"en":"(Common usage, especially in food contexts) Used to refer to arracacha, an edible starchy root also called Peruvian carrot.","zh":"（常見用法，尤指飲食語境）用來指 arracacha（阿拉卡恰），一種可食用的澱粉根莖，又稱「秘魯胡蘿蔔」。"},"examples":[{"en":"In some markets, people label arracacha as “arracacia.”","zh":"在一些市場裡，人們可能把 arracacha 標成「arracacia」。"},{"en":"Try arracacha in soups; it tastes mildly sweet and nutty.","zh":"可以把 arracacha 加進湯裡；它的味道微甜、帶點堅果香。"}]}],"synonyms":["arracacha","Peruvian carrot"],"phonetic":"ˌærəˈkeɪʃə","extraExplanation":["「arracacia」在英文中較常見的是植物學上的屬名 Arracacia（首字母通常大寫）。日常飲食或市場標示中，有時會把可食用根莖 arracacha（常見拼法）誤寫成 arracacia。","Arracacia 來自新拉丁文的植物命名傳統；而 arracacha 作為食物名稱在英語裡更常見於拉丁美洲料理相關語境。"]}
{"word":"arrace","summary":{"en":"“Arrace” is an archaic verb meaning “to erase or wipe out.” In modern English, “erase” is the normal word.","zh":"“arrace”是一个古义动词，意思是“擦掉、抹去、清除（痕迹）”。现代英语一般用“erase”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic) to erase; to scrape off or remove writing or marks; to efface.","zh":"（古义）擦掉；刮去（字迹或痕迹）；抹去、消除。"},"examples":[{"en":"The name was arraced from the stone, as if it had never been there.","zh":"名字被从石头上抹去，仿佛从未存在过。"},{"en":"In old texts, you may see “arrace” used where modern English would say “erase.”","zh":"在旧文献中，你可能会看到用“arrace”来表达现代英语的“erase（擦除）”。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare/poetic) to destroy or remove completely; to wipe out.","zh":"（少见/诗性）彻底清除；消灭；抹除殆尽。"},"examples":[{"en":"Time arraces many proud monuments.","zh":"时间会抹去许多曾经显赫的纪念物。"}]}],"synonyms":["erase","efface","obliterate","expunge"],"phonetic":"/əˈreɪs/","extraExplanation":["“arrace”是非常少见的古词/古拼写（也可见作 *arace*）。现代英语里通常用 **erase / efface / obliterate** 来表达相同意思。","它常出现在较老的文学或历史文本中，用来营造“把痕迹抹去”的意象。"]}
{"word":"arrach","summary":{"en":"“Arrach” is a rare spelling for the spirit usually written “arrack” (related to “arak”).","zh":"“arrach”是烈酒“arrack”（也与“arak”相关）的罕见拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/variant spelling) A strong alcoholic drink (a distilled spirit), especially one made in South or Southeast Asia; often spelled “arrack” (also related to “arak”).","zh":"（罕见/变体拼写）一种烈性蒸馏酒，常见于南亚或东南亚；更常拼作“arrack”（也与“arak/阿拉克酒”相关）。"},"examples":[{"en":"In older travel books, you may see “arrach,” but today “arrack” is the usual spelling.","zh":"在较早的旅行书里你可能会看到“arrach”，但如今更常用的拼写是“arrack”。"},{"en":"They served a local arrack cocktail made with citrus and spices.","zh":"他们端上了一杯用柑橘和香料调制的当地椰子烧酒/阿拉克酒鸡尾酒。"}]}],"synonyms":["arrack","arak"],"phonetic":"/əˈræk/","extraExplanation":["“arrach”通常被认为是“arrack”的旧拼法或非标准拼法；在现代英语词典、酒类标签和菜单上更常见的是“arrack”。","“arrack/arak”在不同地区指代可能不完全一样：有的以椰子花蜜或甘蔗糖蜜为原料（如斯里兰卡、印尼部分地区），有的则指茴香风味的阿拉克酒（中东/地中海一带常见的“arak”）。阅读时最好结合产地与上下文判断。"]}
{"word":"arrack","summary":{"en":"Arrack is a traditional Asian distilled spirit made from ingredients like palm sap, sugarcane, rice, or coconut.","zh":"Arrack 是一种传统的亚洲蒸馏烈酒，常由棕榈汁、甘蔗、米或椰子等制成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong alcoholic drink (spirit) traditionally distilled in South and Southeast Asia, often made from fermented palm sap, sugarcane, rice, or coconut; it can be used for sipping or in mixed drinks","zh":"一种传统的烈酒（蒸馏酒），常见于南亚与东南亚，通常由发酵的棕榈汁、甘蔗、米或椰子制成；可纯饮或调酒"},"examples":[{"en":"In Sri Lanka, some people drink arrack with ginger beer and lime.","zh":"在斯里兰卡，有些人会把 arrack 和姜汁汽水、青柠一起调着喝。"},{"en":"The recipe calls for a small amount of arrack to add a warm, fruity aroma.","zh":"这个配方需要一点点 arrack 来增加温暖的果香。"},{"en":"He brought back a bottle of Indonesian arrack as a souvenir.","zh":"他带回了一瓶印度尼西亚的 arrack 当纪念品。"}]}],"synonyms":["spirit","liquor","distilled alcohol"],"phonetic":"əˈræk","extraExplanation":["“Arrack/arak”一词在不同地区拼写和所指酒类可能不同：南亚和东南亚的 arrack 多指以棕榈汁、甘蔗等为原料的蒸馏酒；而中东常见的 “arak” 往往指茴香味烈酒（如黎巴嫩 arak），风格不一样。","在英语语境中，提到产地很重要：例如 “Sri Lankan arrack / Indonesian arrack” 能更清楚地指明是哪一种。","词源通常与阿拉伯语中表示“蒸馏酒/烈酒”的词有关，随着贸易传播到南亚与东南亚，并进入英语。"]}
{"word":"arracks","summary":{"en":"Barracks: military living quarters; also a verb meaning to house troops.","zh":"Barracks：兵营/营房；也可作动词，表示使部队驻扎或安置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually plural) Buildings where soldiers live and sleep; military housing.","zh":"（常用复数）兵营；营房（士兵居住、睡觉的军用建筑）"},"examples":[{"en":"The new recruits moved into the barracks on Monday.","zh":"新兵周一搬进了营房。"},{"en":"Life in the barracks can feel strict and crowded.","zh":"营房生活可能让人觉得严格又拥挤。"}]},{"partOfSpeech":"v.","definition":{"en":"To house or lodge (especially soldiers) in a barracks or in temporary quarters.","zh":"（尤指）使（士兵）驻扎；为……提供营房/临时住处"},"examples":[{"en":"The troops were barracked near the airport.","zh":"部队被安排驻扎在机场附近。"}]}],"synonyms":["military quarters","garrison (n.)","lodging","billet (v./n.)"],"phonetic":"/ˈbærəks/","extraExplanation":["你输入的“arracks”通常是拼写错误，最常见的目标词是 **barracks**（前面少了一个 b）。","**Barracks** 在英语里外形像复数（以 -s 结尾），但在指“一个兵营/一处营房”时也常当作单数使用：*a barracks / the barracks is...*；表示多处兵营时再用复数语义：*two barracks / the barracks are...*。"]}
{"word":"arrage","summary":{"en":"Arrange means to organize, put in order, or make plans for something to happen.","zh":"Arrange 指整理排序或安排计划，使某事发生。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to plan, organize, or put things in a particular order or position","zh":"安排；整理；把……摆放成某种顺序或位置"},"examples":[{"en":"Please arrange the books by topic.","zh":"请把书按主题整理。"},{"en":"She arranged the chairs in a circle.","zh":"她把椅子摆成一个圆圈。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make plans for something to happen (often by contacting people or organizing details)","zh":"安排（使某事发生，常指联络与细节规划）"},"examples":[{"en":"I arranged a meeting with my teacher for Monday.","zh":"我安排了周一和老师见面。"},{"en":"They arranged transportation to the airport.","zh":"他们安排了去机场的交通。"}]},{"partOfSpeech":"v.","definition":{"en":"to come to an agreement; to settle details (often used with “arrange to” or “arrange that”)","zh":"达成安排/协议；商定细节（常用“arrange to / arrange that”）"},"examples":[{"en":"We arranged to meet at 6 p.m.","zh":"我们约好六点见。"},{"en":"She arranged that someone would pick him up.","zh":"她安排了有人去接他。"}]}],"synonyms":["organize","plan","set up","schedule","order"],"phonetic":"/əˈreɪndʒ/","extraExplanation":["你输入的“arrage”常见是拼写错误，正确拼写是 **arrange**。","常见搭配：**arrange a meeting/trip/appointment**（安排会议/旅行/预约），**arrange the flowers/furniture**（摆放花/家具），**arrange for + 人/事**（安排……）。","小区别：**arrange** 偏“把事情/物品按计划与顺序安排好”；**organize** 更强调“组织管理（人/活动）”；**tidy up** 更偏“收拾干净”。"]}
{"word":"Arragon","summary":{"en":"Arragon is an uncommon spelling, usually referring to Aragon, a historical kingdom and modern region in northeastern Spain.","zh":"Arragon 是不常见的拼写，通常指 Aragon（阿拉贡）：西班牙东北部的历史王国与现代自治区。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Usually spelled Aragon) A historical kingdom and modern autonomous community in northeastern Spain.","zh":"（通常拼作 Aragon）西班牙东北部的一个历史王国；今为西班牙的一个自治区。"},"examples":[{"en":"Zaragoza is the capital of Aragon in northeastern Spain.","zh":"萨拉戈萨是西班牙东北部阿拉贡自治区的首府。"},{"en":"In the Middle Ages, the Crown of Aragon was a major power in the Mediterranean.","zh":"在中世纪，阿拉贡王冠曾是地中海地区的重要势力。"}]},{"partOfSpeech":"other","definition":{"en":"A surname or place-name variant sometimes seen in English, but uncommon; often a misspelling of Aragon.","zh":"一种偶见的英文姓氏或地名拼写变体，但不常见；常是 Aragon 的误拼。"},"examples":[{"en":"I think “Arragon” here is a typo for “Aragon.”","zh":"我觉得这里的 “Arragon” 是把 “Aragon” 打错了。"}]}],"synonyms":["Aragon","Aragón"],"phonetic":"ˈærəɡɑn","extraExplanation":["“Aragon/阿拉贡”在英语里常用于历史语境（如“Crown of Aragon/阿拉贡王冠”），也用于现代地理（西班牙自治区 Aragón）。该地区与加泰罗尼亚、瓦伦西亚等地的历史联系紧密，对地中海贸易与政治曾有较大影响。","在文学与流行文化中，“Aragon”也可能让人联想到《指环王》中的角色 Aragorn（阿拉贡/阿拉贡王的后裔），但那是虚构人名，拼写不同：Aragorn ≠ Aragon ≠ Arragon。"]}
{"word":"arragonite","summary":{"en":"Aragonite is a common calcium carbonate mineral found in shells, coral, and some cave or rock formations.","zh":"霰石是一种常见的碳酸钙矿物，常见于贝壳、珊瑚以及部分洞穴或岩石沉积中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A mineral form of calcium carbonate (CaCO₃) that often forms in shells, coral, and cave deposits; it is a common natural material in oceans and some rocks.","zh":"霰石（一种碳酸钙 CaCO₃ 的矿物形态），常见于贝壳、珊瑚和洞穴沉积物中；在海洋环境与某些岩石里很常见的天然物质。"},"examples":[{"en":"Many seashells are made of aragonite or calcite.","zh":"许多贝壳是由霰石或方解石构成的。"},{"en":"Scientists study aragonite in coral reefs to understand ocean acidification.","zh":"科学家研究珊瑚礁中的霰石来了解海洋酸化。"},{"en":"Aragonite can form beautiful needle-like crystals in caves.","zh":"霰石在洞穴中可以形成漂亮的针状晶体。"}]}],"synonyms":["calcium carbonate mineral","CaCO₃ (mineral form)"],"phonetic":"/əˈræɡəˌnaɪt/","extraExplanation":["“aragonite”来自西班牙地名 Aragón（阿拉贡），因为这种矿物最早被描述与该地区有关。","霰石与“calcite（方解石）”化学成分相同，都是 CaCO₃，但晶体结构不同；在地球表面条件下，霰石相对更容易随时间转变成方解石。","在环保与海洋科学中，霰石常用于讨论“霰石饱和度（aragonite saturation）”，它与珊瑚、贝类更容易或更困难形成硬壳有关。"]}
{"word":"arrah","summary":{"en":"“Arrah” is an Irish-English exclamation meaning “oh/ah,” used to add emotion (surprise, emphasis, or mild protest).","zh":"“arrah”是带爱尔兰口语色彩的感叹词，相当于“哦/哎呀”，用于表达惊讶、强调或轻微反驳等情绪。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(Irish English, informal) An exclamation used to show surprise, emphasis, or mild protest, similar to “oh!” or “ah!”","zh":"（爱尔兰英语，非正式）表示惊讶、强调或轻微反驳的感叹词，类似于“哦！”“啊！”"},"examples":[{"en":"Arrah, I didn’t mean to upset you.","zh":"哎呀，我不是故意惹你生气的。"},{"en":"Arrah, don’t be so hard on yourself.","zh":"哎呀，别对自己这么苛刻。"},{"en":"Arrah, would you look at the time!","zh":"哎呀，你看看都几点了！"}]}],"synonyms":["oh","ah","well","indeed"],"phonetic":"/ˈɑrə/","extraExplanation":["“arrah”多见于爱尔兰（Hiberno-English）口语或带爱尔兰口音/地域色彩的文学对白中，用来营造人物的地方身份与语气。","在现代标准美式/英式英语中不常用；写作时通常只在对话或风格化表达里出现。"]}
{"word":"arraign","summary":{"en":"Arraign means to formally bring someone to court to answer criminal charges; more broadly, it can mean to criticize harshly.","zh":"Arraign 指正式将某人传讯/提审到法庭应对刑事指控；引申义为严厉指责、抨击。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Law) To bring someone before a court to hear and answer official criminal charges; to formally charge and call them to plead.","zh":"（法律）传讯（被告）到法庭宣读指控并要求答辩；正式提审、传讯。"},"examples":[{"en":"He was arraigned on charges of theft and pleaded not guilty.","zh":"他因盗窃指控被提审，并表示不认罪。"},{"en":"The suspect will be arraigned in court tomorrow morning.","zh":"嫌疑人将于明天上午在法庭被提审。"},{"en":"After the arrest, the next step is usually an arraignment.","zh":"逮捕之后，下一步通常是传讯/提审。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Less common) To accuse or criticize someone strongly, as if putting them on trial.","zh":"（较少见）严厉指责、抨击（仿佛把某人送上审判台）。"},"examples":[{"en":"In the speech, she arraigned the company for ignoring safety rules.","zh":"在演讲中，她严厉抨击该公司无视安全规定。"},{"en":"The article arraigned the government’s slow response to the crisis.","zh":"这篇文章严厉指责政府对危机反应迟缓。"}]}],"synonyms":["indict","charge","prosecute","summon","accuse","censure","condemn"],"phonetic":"/əˈreɪn/","extraExplanation":["“arraign”主要用于法律语境，常见搭配是 be arraigned on charges of …（因……指控被提审/传讯）以及 be arraigned in court（在法庭被提审）。","在美国刑事程序里，arraignment 通常是被告第一次出庭的重要环节：法官宣读指控、告知权利，并让被告作出认罪与否的答辩（plead guilty / not guilty）。","词源来自古法语/拉丁语，核心含义与“排列、召集到法庭前”有关，因此引申出“像审判一样严厉指责”的用法。"]}
{"word":"arraignability","summary":{"en":"A rare legal noun meaning the quality of being able to be formally brought to court for an arraignment.","zh":"罕见法律名词，指“可以被正式提讯到法庭”的性质或状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being able to be arraigned (formally brought before a court to hear criminal charges and enter a plea)","zh":"可被提讯的状态或性质（指可以被正式带到法庭上宣读刑事指控并作出认罪/不认罪答辩）"},"examples":[{"en":"The defense challenged the defendant’s arraignability in that jurisdiction.","zh":"辩方对被告在该司法辖区内是否可被提讯提出了质疑。"},{"en":"Questions of arraignability often depend on where and when the alleged offense occurred.","zh":"是否可被提讯的问题常常取决于涉嫌犯罪发生的地点与时间。"}]}],"synonyms":["amenability to arraignment","subject to arraignment","triability (related)","prosecutability (related)"],"phonetic":"/əˌreɪnəˈbɪləti/","extraExplanation":["这是一个非常少见、偏法律文书的抽象名词，来自 arraign（提讯、传讯）+ -ability（……的能力/可能性）。日常英语里更常见的表达是“whether someone can be arraigned / is subject to arraignment”（某人是否能够/是否应当被提讯）。","arraignment（提讯）通常是刑事程序中的早期环节：法官宣读指控，被告作出答辩，并可能讨论保释与后续开庭安排。不同法域程序细节不一，因此“arraignability”往往与管辖权、程序资格等问题相关。"]}
{"word":"arraignable","summary":{"en":"A legal adjective meaning “able to be brought to court for an arraignment.”","zh":"法律形容词，表示“可以被带到法庭进行提讯/传讯程序的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be formally accused and brought before a court (i.e., can be arraigned).","zh":"可被正式控告并带到法庭进行传讯（可被“提讯/传讯”）的。"},"examples":[{"en":"Because the suspect was identified, the case was considered arraignable.","zh":"由于嫌疑人已被确认，这个案件被认为可以进行提讯。"},{"en":"Only arraignable offenses require an arraignment in court.","zh":"只有可提讯的罪行才需要在法庭进行提讯程序。"}]}],"synonyms":["subject to arraignment","chargeable","prosecutable"],"phonetic":"/əˈreɪnəbəl/","extraExplanation":["“arraignable”是法律用语，来自动词“arraign”（在法庭上对被告宣读指控并要求其答辩，即“提讯/传讯”）。在日常英语里较少见，更常见的表达是“can be arraigned”或直接说“subject to arraignment”。","不同法域（例如美国、加拿大、英国）对刑事程序的称呼和阶段划分可能不同；“arraignment”在美国语境中常指被告首次出庭、获知指控并作出认罪/不认罪答辩的程序。"]}
{"word":"arraignableness","summary":{"en":"A rare legal noun meaning “the state or quality of being arraignable,” i.e., able to be formally brought to court to answer a criminal charge.","zh":"一个罕见的法律名词，指“可被提讯的性质/状态”，即能被正式带到法庭上对刑事指控进行应讯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being able or likely to be arraigned (formally brought before a court to answer a criminal charge).","zh":"可被提讯（传讯、到庭受审）的性质；可能被正式提到法庭上应讯的状态。"},"examples":[{"en":"In criminal procedure, the defendant’s arraignableness depends on whether the court has jurisdiction and proper charges.","zh":"在刑事程序中，被告是否“可被提讯”取决于法院是否有管辖权以及指控是否成立。"},{"en":"The lawyer argued that the case lacked arraignableness because the alleged acts were not crimes under that statute.","zh":"律师主张该案缺乏“可提讯性”，因为被指控的行为在该法条下并不构成犯罪。"}]}],"synonyms":["arraignability","liability to arraignment","amenability to prosecution"],"phonetic":"əˈreɪnəbəlnəs","extraExplanation":["这是一个非常少见、偏法律写作的名词，来自 arraign（提讯、传讯）→ arraignable（可被提讯的）→ arraignableness（可被提讯的性质）。日常英语里通常直接说 “whether someone can be arraigned / is subject to arraignment”，而不是用这个抽象名词。","arraignment（提讯）在英美法语境中通常指被告第一次正式出庭：法院宣读指控，询问被告是否认罪，并可能决定保释等程序性事项。不同州/国家的具体流程会有差异。"]}
{"word":"arraigned","summary":{"en":"“Arraigned” means formally brought to court to hear charges (most common), or formally criticized (less common).","zh":"“arraigned”通常指（在法庭上）被正式提讯/起诉；也可指（正式用法）被严厉批评、谴责。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(law) To bring someone before a court to hear the formal charges against them; to formally accuse someone in court.","zh":"（法律）把某人带到法庭上宣读/听取正式指控；在法庭上正式起诉某人。"},"examples":[{"en":"He was arraigned on charges of theft and released on bail.","zh":"他因盗窃指控被提讯，随后交保释金获释。"},{"en":"The suspect will be arraigned tomorrow morning in federal court.","zh":"嫌疑人将于明天上午在联邦法院被提讯。"}]},{"partOfSpeech":"vt.","definition":{"en":"(formal) To strongly criticize or condemn someone or something.","zh":"（正式用法）严厉批评；谴责。"},"examples":[{"en":"The report arraigned the company for ignoring basic safety rules.","zh":"该报告严厉谴责该公司无视基本安全规定。"},{"en":"She arraigned the policy as unfair to working families.","zh":"她抨击这项政策对工薪家庭不公平。"}]}],"synonyms":["indicted","charged","prosecuted","called to account","denounced","condemned","criticized"],"phonetic":"/əˈreɪnd/","extraExplanation":["“arraigned”是“arraign”的过去式/过去分词。法律语境中常见搭配：be arraigned on charges of…（因……被提讯/被起诉）、arraignment（提讯程序）。在英美法中，arraignment通常是被告首次在法庭上正式面对指控并作出答辩（认罪/不认罪）的环节。"]}
{"word":"arraigner","summary":{"en":"An “arraigner” is someone who formally brings charges against a person in court.","zh":"“arraigner”指在法庭上对某人提出正式指控或使其到庭应讯的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person (usually a prosecutor or attorney) who formally accuses someone in court or brings them before the court to answer a charge (to arraign).","zh":"（通常指检察官或律师）在法庭上正式指控某人，或使某人到庭就指控答辩的人（即“arraign”的执行者）。"},"examples":[{"en":"The arraigner read the charges clearly, and the defendant entered a plea.","zh":"控诉方清楚宣读了指控，被告随后作出认罪/不认罪答辩。"},{"en":"In this case, the arraigner argued that the evidence supported a felony charge.","zh":"在这个案件中，控诉方主张证据支持以重罪起诉。"}]}],"synonyms":["accuser","prosecutor","the prosecution","complainant (legal)"],"phonetic":"/əˈreɪnər/","extraExplanation":["“arraigner”是法律语境用词，来自动词“arraign”（在法庭上提审/传讯/正式指控）。日常英语中更常说“prosecutor（检察官）”或“the prosecution（控方）”，而“arraigner”相对少见、更偏正式。","在美式司法程序中，“arraignment（传讯/提审）”是被告第一次在法庭上正式听取指控并作出“plea（答辩/认罪与否）”的阶段。"]}
{"word":"arraigning","summary":{"en":"“Arraigning” means formally bringing someone to court to hear criminal charges and enter a plea; more broadly, it can mean strongly accusing someone.","zh":"“arraigning”指（在法律中）对某人进行提讯：宣读刑事指控并要求答辩；引申为强烈指责某人。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Present participle of “arraign”) formally bringing someone before a court to hear the official criminal charges and ask for a plea (e.g., guilty or not guilty).","zh":"（arraign 的现在分词）把某人正式带到法庭上进行提讯：宣读指控并要求其表态（如认罪或不认罪）。"},"examples":[{"en":"The court began arraigning defendants early Monday morning.","zh":"法院在周一一大早就开始对被告进行提讯。"},{"en":"She was arraigning her client and requesting bail at the same hearing.","zh":"她在同一次庭审中为当事人办理提讯，并申请保释。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Less common) accusing someone strongly or publicly, as if putting them on trial.","zh":"（较少见）强烈地或公开地指责某人，带有“像把人送上审判台”那种意味。"},"examples":[{"en":"In his speech, he was arraigning the company for ignoring safety warnings.","zh":"在演讲中，他强烈指责公司无视安全警告。"},{"en":"The article kept arraigning officials for their lack of transparency.","zh":"那篇文章不断指责官员缺乏透明度。"}]}],"synonyms":["charging","indicting","accusing","prosecuting","bringing to court"],"phonetic":"/əˈreɪnɪŋ/","extraExplanation":["“Arraigning”主要用于美国刑事司法语境中的程序性环节：arraignment（提讯）通常是被捕/起诉后较早的一次出庭，法官会宣读指控、告知权利并记录被告的答辩（plea），有时也会处理保释（bail）。","注意拼写与发音：arraign /əˈreɪn/ 的词尾 -gn 不发音；不要与 “arrange”（安排）混淆。"]}
{"word":"arraignment","summary":{"en":"An arraignment is the first major court hearing where charges are read and the defendant enters a plea.","zh":"arraignment 指刑事案件中较早的重要听证：法庭宣读指控并让被告作出答辩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Law) a court hearing where a person is formally told the criminal charges against them and asked to enter a plea (such as guilty or not guilty).","zh":"（法律）传讯/提审：在法庭上正式告知被告所受刑事指控，并要求其作出认罪与否等答辩的听证程序。"},"examples":[{"en":"At the arraignment, the judge read the charges and asked how the defendant pleaded.","zh":"在传讯（提审）中，法官宣读了指控，并询问被告如何答辩。"},{"en":"She was released after her arraignment while the case continued.","zh":"她在提审后获释，但案件仍在继续。"},{"en":"He hired a lawyer before the arraignment to understand his options.","zh":"他在提审前聘请了律师，以了解自己的选择。"}]}],"synonyms":["charging hearing","initial hearing","plea hearing"],"phonetic":"/əˈreɪnmənt/","extraExplanation":["“Arraignment”常见于美国刑事司法程序中，一般发生在逮捕或起诉之后。提审时通常会处理：告知权利、确认是否需要律师、设定保释/羁押条件、以及输入“guilty / not guilty / no contest（不抗辩）”等答辩。不同州或联邦法院流程细节可能略有差异。","词源上与动词“arraign（传讯，提审）”有关，来自古法语/拉丁语，含义与“把人带到法庭面前并宣读指控”相关。","在新闻与法律剧中常见搭配：“at an arraignment（在提审中）”、“during the arraignment（提审期间）”、“scheduled for arraignment（安排提审）”。容易和“trial（审判）”混淆：arraignment 是更早的程序性步骤，trial 才是正式审理证据、决定有罪与否的阶段。"]}
{"word":"arraignments","summary":{"en":"“Arraignments” are court hearings where charges are formally read and the accused enters a plea.","zh":"“arraignments”指在法庭上正式宣读指控并让被告答辩的传讯听证（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A court hearing where a person is formally told what they are accused of (the charges) and is asked to plead (e.g., guilty or not guilty).","zh":"（刑事案件中）被告在法庭上被正式宣读指控并进行认罪答辩的听证程序（如认罪/不认罪）。"},"examples":[{"en":"The defendant’s arraignment is scheduled for next Monday.","zh":"被告的传讯（宣读指控与答辩）定在下周一。"},{"en":"At the arraignment, she pleaded not guilty.","zh":"在传讯听证上，她答辩不认罪。"},{"en":"Several arraignments were held at the courthouse this morning.","zh":"今天早上法院举行了几场传讯听证。"}]}],"synonyms":["initial hearing","plea hearing","court appearance"],"phonetic":"/əˈreɪnmənt/","extraExplanation":["“arraignment”主要用于美国刑事司法语境。通常在这个阶段，法官会确认被告身份、告知指控与权利、询问是否需要律师，并可能讨论保释/羁押等事项；它不等同于“审判（trial）”。","词形提示：你输入的“arraignments”是复数形式；单数是“arraignment”。动词是“arraign”（正式把某人提到法庭上受审/宣读指控）。"]}
{"word":"arraigns","summary":{"en":"“Arraigns” means formally bringing someone to court to answer charges; it can also mean strongly accusing or condemning someone.","zh":"“Arraigns”主要指在法庭上正式传讯某人并要求其对指控答辩；也可指严厉指责或公开谴责。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to formally call someone before a court to answer criminal charges (the person is told the charges and asked to enter a plea)","zh":"（在法庭上）正式传讯某人并宣读指控，要求其对刑事指控作出答辩（认罪或不认罪）"},"examples":[{"en":"The judge arraigns the defendant and asks how they plead.","zh":"法官对被告进行传讯并询问其认罪与否。"},{"en":"He was arraigned on charges of fraud.","zh":"他因诈骗罪被正式传讯。"},{"en":"The court arraigns suspects soon after an arrest in some cases.","zh":"在某些情况下，法院会在逮捕后不久对嫌疑人进行传讯。"}]},{"partOfSpeech":"vt.","definition":{"en":"(literary or formal) to accuse someone strongly; to criticize publicly and severely","zh":"（文学或正式用法）严厉指控；公开强烈谴责"},"examples":[{"en":"The article arraigns the company for ignoring safety warnings.","zh":"这篇文章严厉谴责该公司无视安全警告。"},{"en":"She arraigned his behavior as dishonest.","zh":"她指责他的行为不诚实。"}]}],"synonyms":["arraign","bring to court","charge","indict","accuse","condemn"],"phonetic":"/əˈreɪn/","extraExplanation":["“arraigns”是动词“arraign”的第三人称单数现在时（he/she/it arraigns）。更常见的新闻表达是被动语态：be arraigned（被传讯）。","法律流程里，arraign（传讯）通常发生在起诉/指控之后：charge/indict（提出指控/起诉）→ arraign（宣读指控并让被告答辩）→ trial（审判）。不同司法体系的具体程序可能略有差异。"]}
{"word":"arrame","summary":{"en":"“Arrame” is not a standard English word; it’s probably a misspelling (often of “arrange”) or a name/variant of “arame.”","zh":"“arrame”不是标准英语单词；多半是拼写错误（常见是“arrange”）或姓名/“arame”的变体。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name. You may mean “arrange” (to organize), or “arame” (a type of Japanese seaweed).","zh":"不是标准英语单词。很可能是拼写错误或专有名词。你可能想写的是“arrange”（安排/整理），或“arame”（一种日本海藻）。"},"examples":[{"en":"I can’t find “arrame” in the dictionary—did you mean “arrange”?","zh":"我在词典里找不到“arrame”——你是不是想写“arrange”？"},{"en":"If you meant “arame,” it’s a seaweed often used in Japanese cooking.","zh":"如果你指的是“arame”，它是一种常用于日式料理的海藻。"}]}],"phonetic":"N/A","extraExplanation":["“arrame”本身在常见英语词典中通常查不到；如果你是在手机输入法里打出来的，可能是自动更正/拼写混淆。","你可以告诉我：你看到它的句子（上下文）或你想表达的中文意思，我就能更准确判断你想要的词（如 arrange / arame / arena / arm 等）。"]}
{"word":"Arran","summary":{"en":"Arran most commonly refers to the Isle of Arran in Scotland; it can also be a personal name.","zh":"Arran 最常指苏格兰的阿伦岛；也可作人名或姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) The Isle of Arran, an island off the west coast of Scotland, known for its mountains, coastal scenery, and whisky.","zh":"（专有名词）阿伦岛（Arran），苏格兰西海岸外的岛屿，以山地与海岸风光、威士忌闻名。"},"examples":[{"en":"We spent a weekend hiking on Arran and visited Brodick Castle.","zh":"我们在阿伦岛度过了一个周末徒步，还参观了布罗迪克城堡。"},{"en":"Arran is often called “Scotland in miniature” because it has many landscapes in one place.","zh":"阿伦岛常被称为“缩小版的苏格兰”，因为它在一个地方集合了多种地貌。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A surname or given name used in English-speaking contexts.","zh":"（专有名词）英语语境中使用的姓氏或名字（较少见）。"},"examples":[{"en":"Arran gave a short presentation at the meeting.","zh":"Arran 在会上做了一个简短的汇报。"},{"en":"Her last name is Arran.","zh":"她的姓是 Arran。"}]}],"synonyms":["Isle of Arran"],"phonetic":"/ˈærən/","extraExplanation":["发音上，Arran 常读作 /ˈærən/，第二个音节较弱，接近 “A-rən”。","如果你指的是苏格兰的阿伦岛，常见搭配有：Isle of Arran（阿伦岛）、Arran whisky（阿伦威士忌）、Arran ferry（阿伦渡轮）。","地理文化小知识：阿伦岛位于克莱德湾（Firth of Clyde），岛上最高峰是 Goat Fell，旅游活动包括徒步、观景、城堡参观与品尝当地威士忌。"]}
{"word":"arrand","summary":{"en":"An errand is a short trip made to do a specific task, like shopping or delivering something.","zh":"Errand 指为完成某个具体任务而进行的短程外出办事，如买东西、送东西等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short trip to do a specific task, usually for someone else (or for a practical purpose)","zh":"（通常为他人或为办事而进行的）差事；跑腿；短程外出办事"},"examples":[{"en":"I have to run an errand after work.","zh":"我下班后得去办点事。"},{"en":"Could you do me an errand and pick up some milk?","zh":"你能帮我跑个腿，顺便买点牛奶吗？"},{"en":"She was out on errands all morning.","zh":"她一整个上午都在外面办事。"}]}],"synonyms":["task","chore","mission","job","trip"],"phonetic":"/ˈɛrənd/","extraExplanation":["你输入的“arrand”不是常见英文单词，最可能是拼写错误：正确拼写通常是 **errand**（差事/跑腿）。常见搭配：**run an errand**（去办事）、**do an errand**（跑腿）、**be out on errands**（在外办事）。","词源小知识：**errand** 来自古英语，原意和“消息、使命”有关，所以也可用于较正式的语境，如 **an errand of mercy**（慈善/救助之行）。"]}
{"word":"arrange","summary":{"en":"Arrange means to organize or plan something, or to put things in a specific order; it can also mean to agree on plans (arrange to/for).","zh":"arrange 指“安排、筹划”或“把事物排列整理”；也可表示“约定/安排去做某事”（arrange to/for）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to plan, organize, or put things in a particular order (often so something can happen smoothly)","zh":"安排；筹划；把事物整理成某种顺序（常为使事情顺利进行）"},"examples":[{"en":"Could you arrange a meeting for next Tuesday?","zh":"你能安排下周二的会议吗？"},{"en":"I arranged the books by topic on the shelf.","zh":"我把书按主题在书架上整理摆放。"},{"en":"They arranged transportation from the airport to the hotel.","zh":"他们安排了从机场到酒店的交通。"}]},{"partOfSpeech":"v.","definition":{"en":"to reach an agreement or make preparations (often used with “to” or “for”)","zh":"达成约定；做准备（常与“to / for”连用）"},"examples":[{"en":"We arranged to meet at 6 p.m.","zh":"我们约好晚上六点见。"},{"en":"She arranged for a friend to watch her dog.","zh":"她安排朋友帮她照看狗。"}]},{"partOfSpeech":"vi.","definition":{"en":"(of things) to be placed in a particular order or position","zh":"（事物）被排列成某种顺序或位置"},"examples":[{"en":"The chairs were arranged in a circle.","zh":"椅子被围成一圈摆放。"}]}],"synonyms":["organize","plan","set up","schedule","sort","order"],"phonetic":"/əˈreɪndʒ/","extraExplanation":["常见搭配：arrange a meeting/an appointment（安排会议/预约）；arrange a time/date（约时间/日期）；arrange transportation（安排交通）；arrange the flowers/furniture（摆放花/家具）；arrange for sb. to do sth.（安排某人做某事）；arrange to do sth.（约定/计划做某事）。","词源提示：arrange 来自法语，核心感觉是“把东西排好、整理好”，因此既可用于“摆放/排序”，也可引申为“把事情安排妥当”。","常见语气差别：make arrangements（做安排/做准备）较正式；set up（把活动/系统“搭建起来”）更口语；organize（组织）强调统筹和管理；sort（分类整理）更偏“把东西分门别类”。"]}
{"word":"arrangeable","summary":{"en":"“Arrangeable” means able to be arranged or organized, often describing things like schedules, seating, or plans that can be changed.","zh":"“Arrangeable”表示“可安排/可整理的”，常用于形容日程、座位或计划等可以调整或重新组织。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be arranged; can be organized or put into a particular order or plan.","zh":"可安排的；可整理/可组织成某种顺序或计划的。"},"examples":[{"en":"The chairs are arrangeable, so we can make a circle for discussion.","zh":"椅子是可安排的，所以我们可以摆成一个讨论用的圆圈。"},{"en":"The schedule is arrangeable if you need to change the meeting time.","zh":"如果你需要改会议时间，这个日程是可以调整安排的。"},{"en":"Most of the furniture in this room is arrangeable to fit different events.","zh":"这个房间里的大多数家具都可以重新摆放，以适应不同活动。"}]}],"synonyms":["adjustable","flexible","modifiable","rearrangeable"],"phonetic":"əˈreɪndʒəbəl","extraExplanation":["“arrangeable”由动词 arrange（安排、整理）+ 后缀 -able（能够……的）构成，强调“具备被安排/被整理的可能性”。日常英语里更常见的表达有：can be arranged / adjustable / flexible。"]}
{"word":"arranged","summary":{"en":"“Arranged” means planned/organized or put in order; it’s also the past form of “arrange.”","zh":"“arranged”表示“已安排好的/已整理好的”，也是动词“arrange”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"planned or organized in advance; put into a specific order.","zh":"事先安排好的；有组织的；按顺序整理好的。"},"examples":[{"en":"Everything was arranged before the guests arrived.","zh":"客人到来之前，一切都已经安排好了。"},{"en":"The books are arranged by topic on the shelves.","zh":"书在书架上按主题排列。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “arrange”: to plan, organize, or agree on something; to put things in order.","zh":"“arrange”的过去式/过去分词：安排、组织、商定；把……整理排列好。"},"examples":[{"en":"We arranged a meeting for Friday.","zh":"我们安排了周五的会议。"},{"en":"They arranged the flowers in a vase.","zh":"他们把花插在花瓶里并摆好。"},{"en":"I arranged to call her after work.","zh":"我约好下班后给她打电话。"}]}],"synonyms":["planned","organized","scheduled","ordered","set up"],"phonetic":"/əˈreɪndʒd/","extraExplanation":["“arranged”常见两种用法：\n1）作形容词：表示“已经安排好的/有条理的”（如 an arranged marriage 指“包办婚姻/家长安排的婚姻”）。\n2）作动词过去式/过去分词：常见搭配包括 arrange a meeting（安排会议）、arrange for + 名词/人 + to do（安排……去做某事）、arrange to do（约定/安排自己去做）。\n注意区分：arrange（安排/整理）偏“组织与计划”；organize 也可表示“组织”，但更强调系统性或大规模活动；set up 更口语，常指“把某事搞起来/建立起来”（如 set up an account）。"]}
{"word":"arrangement","summary":{"en":"Arrangement most often means the way things are organized, or a practical plan/appointment; it can also mean a musical adaptation.","zh":"arrangement 常指“布置/排列方式”或“约定的安排/计划”；在音乐里也可指“改编/配器版本”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A plan or way of organizing things; the order or layout of items.","zh":"安排；布置；把事物组织起来的方式或顺序。"},"examples":[{"en":"The arrangement of the chairs made it easy for everyone to see the stage.","zh":"椅子的摆放让每个人都很容易看到舞台。"},{"en":"We changed the arrangement of the files to find them faster.","zh":"我们调整了文件的排列方式，这样更容易快速找到。"}]},{"partOfSpeech":"n.","definition":{"en":"An agreement or plan for something to happen (often a practical plan).","zh":"约定；安排（通常指实际事务的计划）。"},"examples":[{"en":"I made an arrangement to meet my doctor on Friday.","zh":"我约好了周五去见医生。"},{"en":"They reached an arrangement about how to share the costs.","zh":"他们就如何分摊费用达成了约定。"}]},{"partOfSpeech":"n.","definition":{"en":"A musical version of a piece, changed or adapted for different instruments or voices.","zh":"（音乐）改编；配器后的版本（为不同乐器或声部改写）。"},"examples":[{"en":"Her piano arrangement of the song is simple but beautiful.","zh":"她把这首歌改编成钢琴版，简单却很动听。"},{"en":"The choir performed an arrangement written for four voices.","zh":"合唱团演唱了一首为四个声部改编的版本。"}]}],"synonyms":["plan","organization","layout","order","agreement","appointment","setup","adaptation"],"phonetic":"/əˈreɪndʒmənt/","extraExplanation":["常见搭配：make arrangements（做安排/做准备），arrangements for + 事情（为……做安排），by arrangement（事先约定/安排好的）。","词源小提示：arrangement 来自 arrange（安排、整理），名词后缀 -ment 表示“……的结果/行为”。","区分用法：arrangement 强调“安排/组织的结果”；schedule 更偏“时间表”；agreement 更偏“协议/同意”。"]}
{"word":"arrangements","summary":{"en":"“Arrangements” most often means plans/preparations, and it can also mean an agreement, a physical layout, or a music adaptation.","zh":"“arrangements”常指计划/准备；也可指约定、布置/排列方式，或音乐改编。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plans or preparations that are made so something can happen smoothly (often including details like time, place, and people).","zh":"为使事情顺利进行而做的安排或准备（常包含时间、地点、人员等细节）。"},"examples":[{"en":"Have you made arrangements for the meeting room?","zh":"你安排好会议室了吗？"},{"en":"Travel arrangements can change because of the weather.","zh":"旅行安排可能会因为天气而改变。"}]},{"partOfSpeech":"n.","definition":{"en":"an agreement about how something will be organized or handled; a settled plan between people.","zh":"关于如何组织或处理某事的约定；双方（或多方）达成的方案。"},"examples":[{"en":"We have an arrangement to share the rent.","zh":"我们有个分摊房租的约定。"},{"en":"The company made special arrangements with the supplier.","zh":"公司与供应商达成了特殊安排（协议）。"}]},{"partOfSpeech":"n.","definition":{"en":"the way things are organized or positioned in a particular order or pattern.","zh":"事物的组织方式；排列方式或布局。"},"examples":[{"en":"I like the arrangement of flowers on the table.","zh":"我喜欢桌上花的摆放（插花）方式。"},{"en":"The arrangement of the chairs made the room feel crowded.","zh":"椅子的摆放让房间显得拥挤。"}]},{"partOfSpeech":"n.","definition":{"en":"a rewritten version of a piece of music for different instruments or voices.","zh":"（音乐）改编；为不同乐器或声部重新编写的版本。"},"examples":[{"en":"This song is an arrangement for piano and violin.","zh":"这首歌是为钢琴和小提琴改编的版本。"},{"en":"She performed a jazz arrangement of a classic tune.","zh":"她演奏了一首经典旋律的爵士改编版。"}]}],"synonyms":["plans","preparations","setup","agreement","layout","organization"],"phonetic":"/əˈreɪndʒmənts/","extraExplanation":["“Arrangements”是名词复数，来自动词“arrange”（安排、整理、布置）。在日常英语里最常见的是“做安排/做准备”的意思，常见搭配有：make arrangements (for…)（为……做安排）、travel arrangements（行程安排）、living arrangements（居住安排）、special arrangements（特殊安排/特别照顾）。","语域提示：在服务行业或正式通知中，“We can make arrangements…”常带有“我们可以酌情处理/为你特别安排”的委婉语气。"]}
{"word":"arranger","summary":{"en":"An arranger is someone who organizes plans or adapts music for performance.","zh":"arranger 指“安排者/组织者”，也可指音乐上的“编曲者/改编者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who organizes or plans something, such as an event, meeting, or agreement.","zh":"安排者；组织者（指组织或策划活动、会议或相关事务的人）"},"examples":[{"en":"The wedding arranger coordinated the venue, flowers, and music.","zh":"婚礼安排者协调了场地、鲜花和音乐。"},{"en":"Talk to the arranger if you need to change the schedule.","zh":"如果你需要改时间表，可以联系安排者。"}]},{"partOfSpeech":"n.","definition":{"en":"A musician who adapts a piece of music for performance (for example, changing it for a choir, band, or orchestra).","zh":"编曲者；改编者（指把音乐作品改写成适合合唱团、乐队或管弦乐队演奏的形式的人）"},"examples":[{"en":"The arranger rewrote the pop song for a string quartet.","zh":"编曲者把这首流行歌改编成适合弦乐四重奏演奏的版本。"},{"en":"In the album credits, she is listed as the arranger.","zh":"在专辑鸣谢里，她被列为编曲者。"}]}],"synonyms":["organizer","planner","coordinator","music arranger","adapter"],"phonetic":"/əˈreɪndʒɚ/","extraExplanation":["“arranger”来自动词 arrange（安排；整理；编排）。在音乐语境里，arranger 常指“编曲者”，与 composer（作曲者）不同：composer 写出旋律与和声的原作，arranger 负责把作品改编成适合某种乐器编制或风格的版本。","常见搭配：event/wedding/travel arranger（活动/婚礼/旅行安排者）；music/song/choral arranger（音乐/歌曲/合唱编曲者）。"]}
{"word":"arrangers","summary":{"en":"“Arrangers” means people who organize plans, or (in music) people who adapt music for performance.","zh":"“arrangers”指安排/组织计划的人；在音乐中也指编曲或改编作品的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who organize, plan, or set up something (such as an event, meeting, or business deal).","zh":"组织者；筹划者；安排者（如活动、会议或交易的组织与安排人员）。"},"examples":[{"en":"The wedding arrangers confirmed the venue and the schedule.","zh":"婚礼的安排人员确认了场地和时间表。"},{"en":"Local community arrangers helped coordinate the charity concert.","zh":"当地社区的组织者协助协调这场慈善音乐会。"}]},{"partOfSpeech":"n.","definition":{"en":"Musicians who adapt or rewrite a piece of music for different instruments or voices.","zh":"（音乐）改编者；编曲者（把乐曲改写成适合不同乐器或声部的版本）。"},"examples":[{"en":"The arrangers turned the piano piece into a full orchestral version.","zh":"编曲者把那首钢琴曲改编成了完整的管弦乐版本。"},{"en":"In pop music, arrangers often shape the final sound of a song.","zh":"在流行音乐中，编曲者常常决定一首歌最终的声音风格。"}]}],"synonyms":["organizers","planners","coordinators","music arrangers","adaptors"],"phonetic":"/əˈreɪndʒərz/","extraExplanation":["“arrangers”是名词复数，单数是“arranger”。在日常语境里多指“活动/事务的安排者”；在音乐语境里常特指“编曲者/改编者”。看到音乐相关词（orchestra, score, instruments, arrangement）时，通常取第二个意思。"]}
{"word":"arranges","summary":{"en":"“Arranges” means “organizes or puts things in order,” and it can also mean “plans or makes arrangements for an event or situation.”","zh":"“arranges” 表示“整理、排列、组织”，也可表示“筹备、安排（某个活动或事情），或安排……发生（arrange for）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to put things in a planned, neat, or correct order; to organize","zh":"把事物按计划或合适的方式摆放、排序；整理、组织"},"examples":[{"en":"She arranges the books by topic.","zh":"她按主题把书排列。"},{"en":"He arranges the chairs in a circle for the discussion.","zh":"他把椅子摆成一圈用于讨论。"}]},{"partOfSpeech":"vt.","definition":{"en":"to plan or organize an event or activity","zh":"筹备、安排活动或事情"},"examples":[{"en":"Our teacher arranges a class trip every spring.","zh":"我们老师每年春天都会安排一次班级旅行。"},{"en":"The team arranges meetings on Monday mornings.","zh":"团队把会议安排在周一早上。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make plans for something to happen, often by contacting other people (often used with “for”)","zh":"（常与 for 连用）为某事做安排、联系协调使其发生"},"examples":[{"en":"She arranges for a taxi to pick her up at 6 a.m.","zh":"她安排一辆出租车早上六点来接她。"},{"en":"He arranges for someone to water the plants while he’s away.","zh":"他安排别人在他不在时浇花。"}]},{"partOfSpeech":"vi.","definition":{"en":"to come to an agreement or make a plan (less common in everyday conversation)","zh":"（较少见）达成协议；商定计划"},"examples":[{"en":"They arrange to meet after work.","zh":"他们约好下班后见面。"}]}],"synonyms":["organizes","orders","plans","sets up","prepares"],"phonetic":"/əˈreɪndʒɪz/","extraExplanation":["“arranges” 是动词 “arrange” 的第三人称单数（he/she/it + arranges）。常见搭配：arrange + 名词（arrange the room / arrange a meeting）；arrange for + 人/事（arrange for a driver / arrange for childcare）；arrange to do（arrange to meet）。"]}
{"word":"arranging","summary":{"en":"Arranging means organizing things, making plans, or (in music) adapting a piece for certain instruments/voices.","zh":"Arranging 指整理归类、进行安排筹划，或（在音乐中）编曲/改编。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of putting things in order or organizing them in a neat, planned way","zh":"整理；把东西按顺序摆放；有条理地组织"},"examples":[{"en":"She spent the afternoon arranging the books by subject.","zh":"她花了一个下午按主题整理书籍。"},{"en":"Arranging the files alphabetically makes them easier to find.","zh":"按字母顺序整理文件会更容易找到。"}]},{"partOfSpeech":"v.","definition":{"en":"planning or organizing something (such as a meeting, trip, or event)","zh":"安排（如会议、旅行或活动）；筹划"},"examples":[{"en":"He is arranging a meeting with the client for next week.","zh":"他正在安排下周与客户的会面。"},{"en":"We’re arranging transportation from the airport.","zh":"我们正在安排从机场的交通。"}]},{"partOfSpeech":"v.","definition":{"en":"creating or adapting a piece of music for particular instruments or voices","zh":"（音乐）编曲；改编（使适合某些乐器或声部）"},"examples":[{"en":"She is arranging the song for a school choir.","zh":"她正在把这首歌编成适合学校合唱团演唱的版本。"},{"en":"The composer enjoyed arranging folk tunes for piano.","zh":"这位作曲家喜欢把民间曲调改编成钢琴曲。"}]}],"synonyms":["organizing","ordering","sorting","planning","setting up","coordinating","scheduling"],"phonetic":"əˈreɪndʒɪŋ","extraExplanation":["“arranging” 是动词 arrange 的 -ing 形式：既可以表示正在进行的动作（现在分词，用于进行时：is arranging），也可以当名词用（动名词：Arranging the files takes time）。具体词性通常看它在句子中的位置与功能。"]}
{"word":"arrant","summary":{"en":"Arrant means complete and obvious, especially in a negative sense (e.g., “arrant nonsense”).","zh":"arrant 表示“十足的、彻头彻尾的”（多用于贬义，如“arrant nonsense”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Complete and obvious (usually in a bad way); absolute, utter.","zh":"十足的（通常指坏的）；彻头彻尾的；完全的。"},"examples":[{"en":"That’s arrant nonsense—you know it isn’t true.","zh":"那是彻头彻尾的胡说——你知道那不是真的。"},{"en":"He told an arrant lie to avoid trouble.","zh":"他为了避麻烦撒了个十足的谎。"},{"en":"It was an arrant failure from start to finish.","zh":"这从头到尾都是一次彻底的失败。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Old-fashioned) Notorious; openly and famously bad.","zh":"（较旧用法）臭名昭著的；声名狼藉的。"},"examples":[{"en":"In the story, the king is described as an arrant tyrant.","zh":"在故事里，这位国王被描写成臭名昭著的暴君。"},{"en":"The novel paints him as an arrant villain of the court.","zh":"小说把他刻画成宫廷里声名狼藉的恶棍。"}]}],"synonyms":["utter","absolute","complete","downright","sheer"],"phonetic":"/ˈærənt/","extraExplanation":["“arrant”常和负面名词搭配，用来加强语气：arrant nonsense（一派胡言）、arrant lie（弥天大谎）、arrant fool（十足的傻瓜）。语气比“very”更强，带有批评或不屑的色彩。","词源上与“errant（四处游荡的；偏离正道的）”有关，早期含有“走歪了路”的意味，后来演变为“完全的、十足的（尤指坏的）”。因此它常见于较正式或文学化的表达。"]}
{"word":"arrantly","summary":{"en":"“Arrantly” means “completely and obviously,” usually to criticize something as plainly wrong or bad.","zh":"“Arrantly”表示“彻底而明显地”，多用于批评某事明显错误或很糟。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"completely and clearly; downright (often used to emphasize a negative judgment).","zh":"彻底地；明明白白地；十足地（常用于强调负面评价）。"},"examples":[{"en":"That’s arrantly false.","zh":"那明显是彻底的谎言。"},{"en":"He was arrantly unfair in the way he treated her.","zh":"他对待她的方式十足不公平。"}]}],"synonyms":["downright","utterly","plainly","blatantly","completely"],"phonetic":"/ˈærəntli/","extraExplanation":["“arrantly”来自形容词“arrant”，意思是“十足的、彻头彻尾的（通常用于贬义）”。它在现代英语里比较正式、书面，也带一点旧式/文雅的语感。常见搭配有：arrantly false / arrantly wrong / arrantly unjust。"]}
{"word":"arrantness","summary":{"en":"Arrantness means the state of being complete/utter (usually in a negative sense) or notoriously, shamelessly bad.","zh":"Arrantness 指“十足/彻底（多为贬义）”或“臭名昭著、厚颜无耻地坏”的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being complete, absolute, or unmistakable (often used to emphasize something negative)","zh":"（多用于强调负面事物的）彻底、十足、完全的特质"},"examples":[{"en":"The arrantness of his dishonesty shocked everyone.","zh":"他那种十足的欺骗行为让所有人都很震惊。"},{"en":"She criticized the plan for its arrantness—there was nothing practical about it.","zh":"她批评这个计划“完全不靠谱”——一点都不实际。"}]},{"partOfSpeech":"n.","definition":{"en":"the quality of being notorious or shamelessly bad (as in “an arrant liar”)","zh":"臭名昭著或厚颜无耻地坏的特质（如“十足的骗子”）"},"examples":[{"en":"The article exposed the arrantness of the scam.","zh":"这篇文章揭露了这场骗局的卑劣与无耻。"},{"en":"People were tired of the arrantness of his excuses.","zh":"人们厌倦了他那些厚颜无耻的借口。"}]}],"synonyms":["utterness","totality","outrightness","notoriety","shamelessness"],"phonetic":"ˈærəntnəs","extraExplanation":["“arrantness”来自形容词“arrant”，在现代英语里较少单独使用，更常见的是“arrant + 名词”（如 arrant fool / arrant liar），表示“十足的、彻头彻尾的（通常是贬义）”。","“arrant”带有一种较老派或文风偏正式的强调语气；日常口语中常用 complete/total/utter 来替换。"]}
{"word":"Arras","summary":{"en":"Arras can mean a decorative wall tapestry, or the French city named Arras.","zh":"Arras既可指装饰用的挂毯/壁毯，也可指法国北部城市阿拉斯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rich decorative wall hanging (often a tapestry), traditionally used to cover and warm walls","zh":"（常指）华丽的挂毯；壁毯（传统上用于装饰并保暖墙面）"},"examples":[{"en":"The old castle hall was lined with arras to keep out the cold.","zh":"古堡的大厅四壁挂着壁毯，用来挡寒。"},{"en":"Behind the arras, someone listened to the conversation.","zh":"有人躲在挂毯后面偷听谈话。"}]},{"partOfSpeech":"n.","definition":{"en":"Arras: a city in northern France","zh":"阿拉斯：法国北部的一座城市"},"examples":[{"en":"They visited Arras on a trip through northern France.","zh":"他们在法国北部旅行时参观了阿拉斯。"}]}],"synonyms":["tapestry","wall hanging"],"phonetic":"/ˈærəs/","extraExplanation":["“arras”表示“挂毯/壁毯”这一义，来自法国城市Arras的名声：中世纪晚期到近代早期，Arras以高品质织毯闻名，因此城市名逐渐被英语借来指代这类装饰挂毯。","在英语文学里，“behind the arras（在挂毯后面）”常用来营造“躲藏、偷听”的场景；莎士比亚《哈姆雷特》中就有角色藏在帷幕后（常译作挂毯/帷幕）被刺的著名情节。"]}
{"word":"arras","summary":{"en":"Arras are traditional wedding coins (often 13) in Spanish-speaking cultures, and can also mean an earnest deposit in Spanish legal contexts.","zh":"Arras指西语文化中的传统婚礼硬币（常为13枚），也可指西语法律语境中的定金／诚意金。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Spanish-speaking cultures) wedding coins given as a symbolic gift, often 13 coins exchanged during a marriage ceremony to represent shared prosperity and mutual support.","zh":"（西语文化中）婚礼金币／婚礼硬币，常指婚礼仪式中交换的13枚硬币，象征共同富足与彼此扶持。"},"examples":[{"en":"In a traditional Catholic wedding, the couple exchanged arras to show they would share their wealth.","zh":"在一场传统天主教婚礼中，新人交换了arras，表示他们会共享财富。"},{"en":"The arras ceremony is common in many Latin American weddings.","zh":"arras仪式在许多拉丁美洲婚礼中很常见。"}]},{"partOfSpeech":"n.","definition":{"en":"(Law, mainly in Spanish contexts) an earnest payment or deposit that shows a serious intention to complete a contract.","zh":"（法律用语，主要见于西语语境）定金／诚意金，用来表示有意认真履行合同。"},"examples":[{"en":"They paid arras when they signed the agreement, and the rest was due later.","zh":"他们在签协议时支付了arras（定金），其余款项之后再付。"},{"en":"If the deal falls through, the rules about returning the arras depend on the contract.","zh":"如果交易告吹，arras是否退还要看合同约定。"}]}],"synonyms":["wedding coins","earnest money","deposit","down payment"],"phonetic":"/ˈɑːrɑːs/","extraExplanation":["“Arras”是西班牙语借词，英语里通常出现在文化介绍、宗教婚礼或涉西语法律语境中。婚礼里的“13枚硬币”常与宗教象征相连，具体解释会因地区与家庭传统而不同。","在英语写作中常会写成“arras coins”或“the arras ceremony”，以避免读者把它误认成普通的“coins”。"]}
{"word":"arrased","summary":{"en":"“Arrased” isn’t standard; it’s likely a misspelling of “embarrassed,” “harassed,” or “erased.”","zh":"“arrased”不是标准拼写；通常是“embarrassed / harassed / erased”的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling of “embarrassed,” “harassed,” or “erased,” depending on the context.","zh":"不是标准英语单词；多半是“embarrassed（尴尬的）”“harassed（被骚扰/被困扰的）”或“erased（被擦掉/抹去的）”的拼写错误，具体取决于语境。"},"examples":[{"en":"If you mean “embarrassed”: I felt embarrassed when I forgot her name.","zh":"如果你想写“embarrassed（尴尬的）”：我忘了她的名字时感到很尴尬。"},{"en":"If you mean “harassed”: She was harassed online and reported it.","zh":"如果你想写“harassed（被骚扰的）”：她在网上遭到骚扰并进行了举报。"},{"en":"If you mean “erased”: The pencil mark was erased easily.","zh":"如果你想写“erased（被擦掉的）”：铅笔印很容易就被擦掉了。"}]}],"synonyms":["embarrassed","harassed","erased"],"phonetic":"əˈreɪzd","extraExplanation":["“arrased”在常见词典里通常查不到。如果你把原句发我（前后各3–5个词即可），我可以准确判断你想表达的是哪一个词，并给你更贴切的释义与用法。"]}
{"word":"arrasene","summary":{"en":"Arsenene is a thin, 2D material made of arsenic atoms, mainly used as a scientific research term.","zh":"砷烯是一种由砷原子构成的二维薄层材料，主要作为科研术语使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A two-dimensional (single-atom-thick) sheet of arsenic atoms, similar in concept to graphene; a research material studied for its electronic properties.","zh":"一种由砷原子组成的二维（单原子层厚度）材料，概念上类似石墨烯；常用于研究其电子性质的科研材料。"},"examples":[{"en":"Some researchers study arsenene for potential use in future electronics.","zh":"一些研究人员研究砷烯，探索其在未来电子器件中的潜在应用。"},{"en":"Arsenene is usually discussed in scientific papers rather than everyday conversation.","zh":"砷烯通常出现在科学论文中，而不是日常对话里。"}]}],"synonyms":["2D arsenic","monolayer arsenic"],"phonetic":"/ɑrˈsiːniːn/","extraExplanation":["你输入的“arrasene”很可能是拼写误差；较常见的相关词是 **arsenene（砷烯）**。它的命名方式和 graphene（石墨烯）类似：元素名 arsenic（砷）+ 后缀 -ene（常用于表示与烯/二维材料相关的命名）。","注意区分 **arsenene（砷烯）** 和 **arsenic（砷/砒霜相关的元素名）**：前者是材料科学术语，后者是化学元素名，在“有毒”语境中更常见。"]}
{"word":"arrases","summary":{"en":"“Arrases” means decorative tapestries or wall hangings (plural of “arras”).","zh":"“arrases”指装饰性的挂毯/壁毯（“arras”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of arras: a rich decorative wall hanging (tapestry), often used as a curtain or to cover a wall","zh":"arras 的复数：华丽的挂毯/壁毯（常用作墙面装饰或帘幕）"},"examples":[{"en":"The old castle hall was lined with arrases that showed hunting scenes.","zh":"古老城堡的大厅挂满了描绘狩猎场景的壁毯。"},{"en":"She stepped behind the arrases to hide from view.","zh":"她躲到挂毯后面，避开他人的视线。"}]}],"synonyms":["tapestries","wall hangings","hangings"],"phonetic":"əˈræs","extraExplanation":["“arras”一词来自法国北部城市 Arras（阿拉斯），中世纪以生产精美挂毯闻名，所以这种挂毯就以地名来称呼。","在文学或历史题材中，arras 常用于营造“宫廷/城堡”的氛围，也常出现“躲在挂毯后偷听/藏身”的场景。","注意拼写：你输入的“arrases”通常就是复数形式；如果你想表达“出现/产生”，常见拼法是“arises”。"]}
{"word":"arrastra","summary":{"en":"An arrastra is a primitive ore-crushing mill that drags heavy stones over rock to extract gold or silver.","zh":"arrastra 指一种原始的碾矿设备，通过拖动重石碾碎矿石来提取金或银。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a simple, old-fashioned machine used (especially in the American Southwest and Latin America) to crush gold- or silver-bearing rock by dragging heavy stones over it","zh":"（尤指美国西南部和拉丁美洲早期使用的）简易碾矿装置；用拖拽沉重石块来碾碎含金/含银矿石的原始磨矿机"},"examples":[{"en":"The museum displays an old arrastra used to crush ore for gold.","zh":"博物馆里展示了一台旧的 arrastra，用来碾碎含金矿石。"},{"en":"Miners powered the arrastra with a mule walking in a circle.","zh":"矿工让骡子绕圈走来带动 arrastra 运转。"},{"en":"Before modern mills, an arrastra was one of the cheapest ways to process ore.","zh":"在现代磨矿机出现之前，arrastra 是处理矿石最省钱的方法之一。"}]}],"synonyms":["ore mill","stamp mill (similar purpose)","crusher"],"phonetic":"/əˈræstrə/","extraExplanation":["“arrastra”来自西班牙语（与“拖拽/拉”的含义相关）。在英语里它主要作为矿业史/西部历史语境中的名词使用，常见于关于淘金热、旧矿区遗址、地方博物馆解说等文本。"]}
{"word":"arrastre","summary":{"en":"*Arrastre* is a Spanish noun meaning “dragging/haul,” and it can also mean a figurative “drag/burden,” or (in politics) a coattail effect (*arrastre de votos*).","zh":"*Arrastre* 是西班牙语名词，主要意思是“拖拽/拖行”；也可引申为“拖累/负担”，在政治语境中还可指“带票效应”（*arrastre de votos*）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) the act of dragging/pulling something along a surface; a drag or haul.","zh":"（西班牙语）拖拽、拉着走的动作；拖行/牵引。"},"examples":[{"en":"In Spanish, *arrastre* describes the action of dragging something across the floor.","zh":"在西班牙语里，*arrastre* 指把东西在地面上拖着走的动作。"},{"en":"The report mentioned the *arrastre* of heavy logs using a chain.","zh":"报告提到用链条拖拉（*arrastre*）沉重的原木。"}]},{"partOfSpeech":"n.","definition":{"en":"(Spanish, figurative) a lingering negative effect or “drag,” such as a burden that slows progress.","zh":"（西班牙语，引申）拖累、负担；使进展变慢的不利影响。"},"examples":[{"en":"They talked about the *arrastre* of past debt on the company’s growth.","zh":"他们谈到过去债务对公司增长的拖累（*arrastre*）。"}]},{"partOfSpeech":"phrase","definition":{"en":"(Spanish, some regions) electoral “coattail effect,” when a popular candidate helps others win votes (often said as *arrastre de votos*).","zh":"（西班牙语，部分地区）“带动效应/搭便车效应”，指热门候选人带动他人得票（常说 *arrastre de votos*）。"},"examples":[{"en":"Analysts discussed the *arrastre de votos* from the presidential race to local candidates.","zh":"分析人士讨论总统选举对地方候选人的“带票效应”（*arrastre de votos*）。"}]}],"synonyms":["dragging","haul","pull","burden (figurative)","coattail effect (politics)"],"phonetic":"/aˈras.tɾe/","extraExplanation":["*Arrastre* 来自动词 *arrastrar*（拖、拽）。日常语境里多指“物理上的拖行”，在新闻/政治语境里也常见引申义，如“拖累”（经济负担）或“带票效应”（*arrastre de votos*）。","发音提示：西语里的 *rr* 是颤音/滚舌音；如果不会滚舌，接近清晰的“r-r”也能被理解。"]}
{"word":"arratel","summary":{"en":"“Arratel” is not a standard English word; it likely means “narrate” (to tell a story or describe events).","zh":"“arratel”不是标准英语单词；很可能是想写“narrate”（讲述/叙述）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"Not a standard English word; it is likely a misspelling of “narrate,” meaning to tell a story or describe events in order.","zh":"不是标准英语单词；很可能是把 “narrate” 拼错了，意思是“按顺序讲述故事或事件”。"},"examples":[{"en":"Could you narrate what happened after the meeting ended?","zh":"你能按顺序讲述一下会议结束后发生了什么吗？"},{"en":"The documentary is narrated by a famous actor.","zh":"这部纪录片由一位著名演员担任旁白讲述。"}]}],"synonyms":["narrate","tell","recount","relate","describe"],"phonetic":"/nəˈreɪt/","extraExplanation":["“arratel”在常见词典中找不到对应词条；最接近的常用词通常是“narrate”（讲述、叙述）或“relate”（讲述、关联）。如果你想表达“讲故事/叙述”，一般用“narrate”。","如果你告诉我它出现的句子或语境（例如一整句话），我可以更准确判断你想找的词。"]}
{"word":"Arratoon","summary":{"en":"Ratoon refers to new crop growth that regrows from stubble/roots after harvesting, and can also mean to produce/manage such regrowth.","zh":"Ratoon 指作物收割后由残茬或根部再生的一茬，也可作动词表示“让作物留茬再生/促其再生”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Agriculture) a new growth of a crop (especially sugarcane or rice) that comes up from the stubble or roots after the first harvest; also called a “ratoon crop.”","zh":"（农业）宿根再生作物；指第一次收割后，从残茬或根部再长出来的一茬（尤指甘蔗、水稻等），也叫“再生茬/留茬再生作物”。"},"examples":[{"en":"After harvesting the sugarcane, farmers often let a ratoon crop grow for the next season.","zh":"收割甘蔗后，农民常让留茬再生的一茬在下一季继续生长。"},{"en":"This field produced two good ratoons before the yield started to drop.","zh":"这块田在产量下降前，连续出了两茬不错的再生茬。"}]},{"partOfSpeech":"v.","definition":{"en":"to grow (a crop) again from the stubble or roots after harvesting; to manage land so a ratoon crop regrows.","zh":"（农业）让作物留茬再生；通过收割后保留根/残茬，使其再长出下一茬。"},"examples":[{"en":"Some growers ratoon rice to save time and reduce planting costs.","zh":"有些种植户会让水稻留茬再生，以节省时间并降低栽培成本。"},{"en":"If you ratoon sugarcane too many times, the stalks can become thinner.","zh":"如果甘蔗留茬再生次数太多，茎秆可能会变细。"}]}],"synonyms":["regrowth","second crop","ratoon crop"],"phonetic":"/rəˈtun/","extraExplanation":["“Arratoon”看起来不像常见英语单词，更可能是把 “a ratoon”（一个再生茬）连写或拼写成了一个词。","“ratoon”主要用于农业语境，日常英语里不常见；常见搭配有 “ratoon crop（再生茬作物）”“ratoon rice（再生稻）”“ratoon sugarcane（再生蔗）”。"]}
{"word":"Arrau","summary":{"en":"Arrau is a surname, most famously referring to the Chilean pianist Claudio Arrau.","zh":"Arrau 是一个姓氏，最常指智利钢琴家克劳迪奥·阿劳。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surname, best known from Claudio Arrau (1903–1991), a Chilean classical pianist famous for thoughtful interpretations of composers such as Beethoven, Schubert, and Liszt.","zh":"一个姓氏，最常见的指涉是克劳迪奥·阿劳（Claudio Arrau，1903–1991），智利古典钢琴家，以对贝多芬、舒伯特、李斯特等作曲家的深思熟虑式诠释而闻名。"},"examples":[{"en":"Claudio Arrau is often praised for his Beethoven piano sonatas.","zh":"克劳迪奥·阿劳常因演绎贝多芬钢琴奏鸣曲而备受称赞。"},{"en":"I listened to an Arrau recording of Schubert last night.","zh":"我昨晚听了一张阿劳演奏舒伯特作品的录音。"}]}],"synonyms":["Claudio Arrau (as a full-name reference)"],"phonetic":"/əˈraʊ/","extraExplanation":["“Arrau”通常作为专有名词出现（人名/姓氏），在英语里多见于音乐评论、唱片介绍与古典音乐书写中。","克劳迪奥·阿劳是20世纪重要钢琴家之一；谈到“an Arrau recording（阿劳的录音）”时，常隐含其演奏风格：音色厚实、结构感强、节制而富思想性。"]}
{"word":"arrau","summary":{"en":"Array means a large, ordered group of things, or to arrange things neatly.","zh":"Array 表示“一系列（整齐排列的）事物”，也可作动词表示“把……排列/布置整齐”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an ordered set or group of things, often arranged in a line or in a clear pattern","zh":"一组按顺序排列的事物；（常指）整齐陈列的一系列"},"examples":[{"en":"The shop displayed an array of colorful scarves.","zh":"这家店陈列了一系列色彩鲜艳的围巾。"},{"en":"We had an array of choices on the menu.","zh":"菜单上有很多选择。"}]},{"partOfSpeech":"v.","definition":{"en":"to arrange things neatly or in a planned way","zh":"把……整齐地排列；有计划地布置"},"examples":[{"en":"The books were arrayed on the table by size.","zh":"书按大小被摆放在桌上。"},{"en":"They arrayed the chairs in rows for the meeting.","zh":"他们把椅子排成一排排来开会。"}]}],"synonyms":["collection","range","variety","set","arrange","line up"],"phonetic":"/əˈreɪ/","extraExplanation":["你输入的“arrau”很可能是拼写错误，常见目标词是“array”。","“an array of + 名词”是很常用的搭配，表示“各种各样的一大堆”，语气比“many”更书面一些。"]}
{"word":"array","summary":{"en":"Array most commonly means an ordered collection of items, especially in programming; it can also mean a large, impressive variety or display.","zh":"Array 最常见指“有序的集合/数组”（尤其在编程中）；也可指“琳琅满目的大量陈列或多样选择”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A set of items arranged in order, usually stored as one unit (often in math and programming).","zh":"一组按顺序排列的元素，通常作为一个整体存储（常见于数学与编程）。"},"examples":[{"en":"In programming, an array lets you store many values under one name.","zh":"在编程中，array 可以让你用一个名字存储多个值。"},{"en":"The numbers are in an array from smallest to largest.","zh":"这些数字按从小到大排列成一个数组（array）。"}]},{"partOfSpeech":"n.","definition":{"en":"A large or impressive display or arrangement of things.","zh":"大量（或令人印象深刻的）陈列、展示或排列。"},"examples":[{"en":"The market offered an array of fresh fruits and vegetables.","zh":"市场上摆着琳琅满目的新鲜水果和蔬菜。"},{"en":"An array of lights lit up the stage.","zh":"一排（或一片）灯光照亮了舞台。"}]}],"synonyms":["collection","series","range","variety","assortment","set"],"phonetic":"/əˈreɪ/","extraExplanation":["“an array of …”是非常常见的固定搭配，表示“各种各样的…… / 一大批……”，语气比“many”更正式、更有“选择很多、种类丰富”的感觉。","在编程语境里，array 通常强调“有序、可用索引访问”；而在日常英语里，它更像“丰富的陈列/一系列”。注意根据语境理解。"]}
{"word":"arrayal","summary":{"en":"“Arrayal” is a rare/archaic noun meaning an arrangement or outfit (the act of arraying). In modern English it’s often a mistake for “array” or another word.","zh":"“Arrayal”是罕见/古旧名词，指整理/排列或装束（arraying的结果）。现代英语中更常见的是拼写误写，往往应为“array”等词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic) The act of arranging or dressing; an arrangement, especially of clothing or equipment.","zh":"（罕见/古旧）整理、排列或穿戴的行为；（尤指衣着或装备的）装束、陈设。"},"examples":[{"en":"In old writings, “arrayal” could refer to a soldier’s full arrayal before battle.","zh":"在一些旧文本中，“arrayal”可以指士兵上战场前的全套装束与装备。"},{"en":"The room’s arrayal of candles and flowers made the ceremony feel formal.","zh":"房间里蜡烛与鲜花的陈设（arrayal）让仪式显得很正式。"}]},{"partOfSpeech":"other","definition":{"en":"(Nonstandard today) Sometimes used as a misspelling or mistaken form of “array” or “arousal,” depending on context.","zh":"（现代不规范用法）有时是拼写错误或误写，可能想写“array（排列/一系列）”或“arousal（唤起/兴奋）”，需看上下文。"},"examples":[{"en":"If you meant “array,” you might write: “an array of choices.”","zh":"如果你想表达“array”，可以写： “an array of choices（多种选择）”。"},{"en":"If you meant “arousal,” you might write: “emotional arousal.”","zh":"如果你想表达“arousal”，可以写： “emotional arousal（情绪唤起/激动）”。"}]}],"synonyms":["arrangement","ordering","attire","outfit"],"phonetic":"/əˈreɪ.əl/","extraExplanation":["“arrayal”不是现代英语里的常用词，更常见的是“array”（名词：一系列；动词：排列/布置）。如果你告诉我它出现的句子，我可以帮你判断到底是古旧用法，还是你想写的是别的词。"]}
{"word":"arrayals","summary":{"en":"“arrayals” isn’t a standard word; it’s likely a typo for “arrivals” or “arrays.”","zh":"“arrayals”不是标准单词，可能是“arrivals”或“arrays”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most likely a misspelling (commonly of “arrivals” or “arrays”).","zh":"不是标准英语单词；很可能是拼写错误（常见为“arrivals”或“arrays”的误拼）。"},"examples":[{"en":"Did you mean “arrivals” (people/things that arrive) or “arrays” (ordered groups/lists)?","zh":"你想写的是“arrivals”（到达的人/物）还是“arrays”（有序的组/列表）？"},{"en":"Correct: The arrivals board shows all incoming flights.","zh":"正确：到达信息屏显示所有进港航班。"},{"en":"Correct: The program stores the numbers in arrays.","zh":"正确：程序把数字存进数组（arrays）里。"}]}],"synonyms":["arrivals","arrays"],"phonetic":"əˈreɪəlz","extraExplanation":["“arrayals”在常见词典与语料中不属于标准拼写。如果你是学编程，可能想写的是 arrays（数组）；如果是机场/物流场景，可能想写 arrivals（到达/到达者）。你也可以告诉我你看到这个词的句子，我可以更准确判断。"]}
{"word":"arrayan","summary":{"en":"“arrayan” is not a common English word; it’s probably a misspelling (often “Aryan” or “array”).","zh":"“arrayan” 不是常见英语词；多半是拼写错误（常见是 “Aryan” 或 “array”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling or a name. Common intended words include “Aryan” (a historical/linguistic term) or the phrase “array an …” (meaning to arrange something).","zh":"不是标准英语单词；更可能是拼写错误或人名。常见可能想表达的是 “Aryan”（历史/语言学术语）或短语 “array an …”（表示“把……排列/布置”）。"},"examples":[{"en":"I couldn’t find “arrayan” in the dictionary—did you mean “Aryan” or “array”?","zh":"我在词典里找不到 “arrayan”——你是想写 “Aryan” 还是 “array” 吗？"},{"en":"If you meant “array,” you can say: “Please array the books on the shelf by size.”","zh":"如果你想写 “array”，可以说：“请把书按大小排列在书架上。”"}]}],"extraExplanation":["“Aryan” 在现代语境中很敏感：它原本多用于历史语言学（如“印欧语系的印度-伊朗语支”相关），但曾被纳粹种族主义错误挪用，用来宣扬所谓“雅利安人优越论”。如果你想表达历史/语言学含义，建议在写作中明确上下文，避免误解。","如果你告诉我你看到这个词的句子或你想表达的意思（例如人名/地名/拼写），我可以帮你确定最合适的词并给出准确释义。"]}
{"word":"arrayed","summary":{"en":"“Arrayed” means either arranged neatly (past form of “array”) or dressed/decorated in a particular way (more formal/literary).","zh":"“Arrayed”可指“被整齐排列/布置”（array 的过去式/过去分词），也可指“穿着/装饰成某种样子”（偏正式/文学用法）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Past tense/past participle of “array”) to arrange or place things in a neat, ordered way, often in lines or groups.","zh":"（array 的过去式/过去分词）把事物整齐地排列或布置，常按行列或分组摆放。"},"examples":[{"en":"The chairs were arrayed in neat rows for the meeting.","zh":"椅子被整齐地排成几排，用于开会。"},{"en":"The products were arrayed by color to make them easier to find.","zh":"商品按颜色排列，方便顾客查找。"}]},{"partOfSpeech":"adj.","definition":{"en":"Dressed or decorated in a particular way; wearing something formal or impressive.","zh":"（尤用于较正式的表达）穿着/装扮成某种样子，常指正式或华丽。"},"examples":[{"en":"She arrived arrayed in a black suit and white shirt.","zh":"她穿着黑色西装、白衬衫到达。"},{"en":"The hall was arrayed with flags for the ceremony.","zh":"大厅用旗帜装饰起来，迎接仪式。"}]}],"synonyms":["arranged","ordered","lined up","ranked","dressed","clad","decked out"],"phonetic":"/əˈreɪd/","extraExplanation":["“array”既可表示“排列、布置”，也可表示“盛装、装饰”。在较文学或正式的语境里，常见搭配有 be arrayed in（穿着……）和 be arrayed with（用……装饰）。"]}
{"word":"arrayer","summary":{"en":"An arrayer is someone who arranges or lines things (or people) up, often in a formal way.","zh":"arrayer 指“安排/布置/列队的人”，常带正式或偏古典的语感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who arranges, organizes, or lines things up (especially people or troops).","zh":"安排者；布置者；列阵者（尤指把人或军队排成队列的人）。"},"examples":[{"en":"The arrayer positioned the students in two neat lines before the ceremony.","zh":"典礼前，安排者把学生排成两条整齐的队伍。"},{"en":"In old stories, an arrayer would set the soldiers in battle formation.","zh":"在古老故事里，列阵者会把士兵布置成作战阵形。"}]}],"synonyms":["organizer","arranger","coordinator"],"phonetic":"əˈreɪər","extraExplanation":["“arrayer”来自动词“array”（排列、布置；列阵）。在现代英语中，“arrayer”非常少见，通常会用“organizer / arranger / coordinator”等更常用的词来表达。","在历史或文学语境里，“array”常用于“array troops”（列阵军队）这类搭配，因此“arrayer”也带有一点古风或正式色彩。"]}
{"word":"arrayers","summary":{"en":"“Arrayers” means people who arrange/display things in order; rarely, it can mean people who arrange a jury in older legal usage.","zh":"“arrayers”指把事物有序排列/陈列的人；较少见的旧式法律用法中也可指负责安排陪审团的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who arrange or display things in an ordered way; people who “array” items.","zh":"把事物有秩序地排列、陈列的人；进行“排列/布置”的人。"},"examples":[{"en":"The museum’s arrayers placed the artifacts by century so visitors could compare them easily.","zh":"博物馆的陈列人员按世纪摆放文物，方便参观者比较。"},{"en":"Volunteer arrayers lined up the donated books by level for the children’s program.","zh":"志愿者把捐赠的书按难度分级排好，用于儿童项目。"}]},{"partOfSpeech":"n.","definition":{"en":"(Law, rare) People responsible for choosing or arranging a jury; “arrayers of a jury.”","zh":"（法律用语，罕见）负责挑选或安排陪审团的人；“陪审团遴选/安排人员”。"},"examples":[{"en":"In older legal texts, you may see references to arrayers who helped organize the jury panel.","zh":"在较早的法律文献中，你可能会看到关于负责组织陪审员名单的人员（arrayers）的说法。"}]}],"synonyms":["arrangers","organizers","setters","curators"],"phonetic":"/əˈreɪ.ərz/","extraExplanation":["“arrayers”是名词复数，单数是“arrayer”。现代英语里更常用的是动词“arrange / set out / lay out”来表达“排列、布置”。","法律义项多见于旧式英美法律或历史文献：名词“array”（陪审团名册/陪审团的编列）相关的角色有时会被称为“arrayer(s)”。"]}
{"word":"arraying","summary":{"en":"“Arraying” means arranging or lining things up in an organized way; it can also mean dressing/equipping someone, or organizing data into a computing array.","zh":"“Arraying”指把事物有条理地排列/布置；也可指为某人穿戴/配备（多用于正式场合），或在计算机中把数据组织成数组。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"arranging or setting people/things in an organized way (often in rows or a particular order)","zh":"把人或物有条理地排列、布置（常指排成行或按某种顺序）"},"examples":[{"en":"The staff were arraying the chairs in neat rows before the meeting.","zh":"会议开始前，工作人员把椅子整齐地一排排摆好。"},{"en":"She spent the morning arraying her notes by topic.","zh":"她花了一上午按主题整理笔记。"}]},{"partOfSpeech":"v.","definition":{"en":"dressing or equipping someone in a particular way, especially for a formal event","zh":"（尤指为正式场合）给某人穿戴或配备某种服饰/装备"},"examples":[{"en":"The designer was arraying the actors in traditional costumes.","zh":"设计师正在给演员们穿上传统服装。"},{"en":"They were arraying the wedding party in matching colors.","zh":"他们让婚礼队伍穿上统一配色的服装。"}]},{"partOfSpeech":"v.","definition":{"en":"computing: organizing data into an array (a structured list, often indexed)","zh":"【计算机】把数据组织成数组（通常可用下标索引的结构化列表）"},"examples":[{"en":"The program is arraying the sensor readings for faster access.","zh":"程序正在把传感器读数组织成数组，以便更快访问。"},{"en":"Try arraying these values before you sort them.","zh":"在排序之前，先把这些值放进数组里试试。"}]}],"synonyms":["arranging","organizing","lining up","marshaling","ordering"],"phonetic":"/əˈreɪɪŋ/","extraExplanation":["“arraying”是动词“array”的现在分词/动名词形式。日常英语里更常见的是“arranging/lining up”；“array”带有“更正式、更整齐地排布或陈列”的语感。","名词“array”很常见，表示“（一大）排/一列；一系列；陈列”，如：an array of choices（各种各样的选择）。"]}
{"word":"arrayment","summary":{"en":"Arrayment is a literary word meaning clothing/attire or a careful arrangement.","zh":"Arrayment 是偏文学的词，表示“衣着/服饰”，也可指“整齐的排列/布置”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Literary/old-fashioned) Clothing or dress; the way someone is dressed.","zh":"（文学/旧用法）衣着；服饰；穿着方式。"},"examples":[{"en":"In her bright arrayment, she looked ready for the festival.","zh":"她穿着鲜艳的服饰，看起来已经准备好参加节日了。"},{"en":"The knight’s arrayment was polished and carefully chosen.","zh":"骑士的装束被擦得发亮，且精心挑选。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literary) An arrangement or ordering of things, especially in a neat or impressive way.","zh":"（文学用法）排列；布置；（尤指整齐或庄重的）陈列。"},"examples":[{"en":"The candles were set in a careful arrayment along the table.","zh":"蜡烛被细心地沿着桌子摆放成一排。"},{"en":"We admired the arrayment of flowers at the entrance.","zh":"我们欣赏入口处花卉的布置。"}]}],"synonyms":["attire","clothing","dress","outfit","arrangement","ordering"],"phonetic":"/əˈreɪmənt/","extraExplanation":["“arrayment”在现代英语中很少见，更常出现在诗歌、宗教或古典风格的文字里。日常表达“衣着/服饰”更常用“clothing, outfit, attire, dress”。","注意不要和法律词“arraignment”（提讯/传讯）混淆；两者拼写相近但意义不同，且“arraignment”在现代更常见。"]}
{"word":"arrays","summary":{"en":"“Arrays” is the plural of “array”: a wide variety/collection; an orderly arrangement; or (in computing) a list-like data structure. It can also be a verb meaning “to arrange/display.”","zh":"“arrays”是“array”的复数：可指各种各样的集合/一系列事物；整齐的排列；或（计算机）数组。也可作动词，表示“排列/陈列”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large, impressive group or collection of things arranged or shown together.","zh":"一大批（令人印象深刻的）事物的集合；陈列在一起的一系列东西。"},"examples":[{"en":"The museum displayed an array of ancient coins.","zh":"博物馆陈列了一系列古代硬币。"},{"en":"The menu offers a wide array of vegetarian dishes.","zh":"菜单提供种类丰富的素食菜肴。"}]},{"partOfSpeech":"n.","definition":{"en":"An arrangement of people or things in an orderly way, often in lines or rows.","zh":"（人或物的）整齐排列；（常指）成行成列的队形。"},"examples":[{"en":"The soldiers stood in array along the street.","zh":"士兵们沿街列队站立。"}]},{"partOfSpeech":"n.","definition":{"en":"In computing, a data structure that stores a list of items (often of the same type) and lets you access them by position (index).","zh":"【计算机】数组：一种数据结构，用来存放一组数据，通常可用位置（索引）来访问。"},"examples":[{"en":"Store the test scores in an array so you can loop through them.","zh":"把测试分数存进数组里，这样就可以用循环逐个处理。"},{"en":"This array has five elements, indexed from 0 to 4.","zh":"这个数组有五个元素，索引从 0 到 4。"}]},{"partOfSpeech":"vt.","definition":{"en":"To arrange or display things in an orderly or impressive way.","zh":"把……排列/陈列得整齐或壮观。"},"examples":[{"en":"They arrayed the flowers on the table for the ceremony.","zh":"他们把花摆在桌上，供仪式使用。"}]}],"synonyms":["range","variety","collection","assortment","sequence","arrangement"],"phonetic":"/əˈreɪ/","extraExplanation":["“arrays”是“array”的复数形式。日常英语里常见搭配是“a wide array of ...”（各种各样的……），语气比“many kinds of”更正式一些。","在编程语境中，“array/arrays”通常指“数组”。不同语言对数组的细节（如是否固定长度、索引从0还是1开始）可能不同，但核心概念是“按位置访问的一组数据”。"]}
{"word":"arrear","summary":{"en":"Arrear(s) means money that is overdue—payments that should have been made earlier but weren’t.","zh":"arrear（常用arrears）指“拖欠款/逾期未付的款项”，即本应更早支付却未支付的钱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually plural: arrears) money that should have been paid earlier but has not been paid yet; overdue payments or debts.","zh":"（常用复数：arrears）拖欠款；逾期未付的款项/债务。"},"examples":[{"en":"He is behind on his rent and now owes three months of arrears.","zh":"他房租没按时交，现在已经拖欠了三个月的租金。"},{"en":"The company paid the workers’ wage arrears after the protest.","zh":"抗议之后，公司补发了工人的拖欠工资。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common, often in set phrases) in a position of being late or behind, especially with payments or duties.","zh":"（较少见，多见于固定搭配）处于拖延/落后状态，尤指付款或履行义务方面。"},"examples":[{"en":"Many customers are in arrear with their bills.","zh":"许多客户账单处于拖欠状态。"},{"en":"If you fall into arrear, contact the bank quickly to discuss a plan.","zh":"如果你开始拖欠，请尽快联系银行商量解决方案。"}]}],"synonyms":["overdue payments","back payments","past-due amounts","debt","delinquency"],"phonetic":"/əˈrɪr/","extraExplanation":["“arrear”在现代英语里最常见的形式是复数“arrears”，尤其在法律、财务、租房、工资等场景：rent arrears（拖欠房租）、wage arrears（拖欠工资）。","固定搭配：be in arrears（拖欠/落后），get into arrears（开始拖欠），pay off arrears（还清欠款），back payments（补缴款）与“arrears”意思接近但更口语一些。"]}
{"word":"arrearage","summary":{"en":"Arrearage means money that is past due and still unpaid.","zh":"arrearage 指已经到期但仍未支付的欠款/拖欠款。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Money that is overdue and still unpaid (often a debt, rent, child support, or loan payments).","zh":"逾期未付的欠款；拖欠款（常指租金、抚养费或贷款分期等）。"},"examples":[{"en":"The tenant has an arrearage of two months’ rent.","zh":"这位房客拖欠了两个月的房租。"},{"en":"He agreed to pay the arrearage in monthly installments.","zh":"他同意按月分期偿还拖欠款。"},{"en":"The court calculated the child-support arrearage.","zh":"法院计算了拖欠的子女抚养费金额。"}]}],"synonyms":["arrears","overdue payments","back payments","unpaid balance"],"phonetic":"/əˈrɪrɪdʒ/","extraExplanation":["“arrearage”多用于法律、财务或正式文件中，强调“已经到期却仍未支付”的金额。日常口语里更常说“overdue payments / back payments / unpaid balance”。","它来自“in arrears（拖欠）”，常见搭配：arrearage of + 金额/项目（arrearage of $2,000; arrearage of rent）。","在美国法律语境中，child-support arrearage（抚养费拖欠）是很常见的固定说法；也可能写作复数 arrearages，指多笔或一段时间累积的拖欠。"]}
{"word":"arrearages","summary":{"en":"Arrearages are overdue payments—money you should have paid already but still owe.","zh":"Arrearages 指到期未付的欠款，即本该已支付但仍拖欠的钱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"money that is owed but has not been paid at the expected time; overdue payments (often regular payments such as rent, child support, taxes, or loan payments).","zh":"到期未付的欠款；拖欠款（常指房租、抚养费、税款或贷款等定期付款的欠款）。"},"examples":[{"en":"He fell into arrearages on his rent after losing his job.","zh":"他失业后房租开始拖欠。"},{"en":"The court ordered him to pay the child-support arrearages.","zh":"法院命令他偿还拖欠的子女抚养费。"},{"en":"The company is working to reduce its tax arrearages.","zh":"公司正在努力减少拖欠的税款。"}]}],"synonyms":["arrears","overdue payments","back payments","past-due amounts"],"phonetic":"/əˈrɪrɪdʒɪz/","extraExplanation":["“arrearages”通常以复数形式出现，比“arrears”更偏法律/财务文件用语（如法院命令、合同、账单）。","常见搭配：in arrearages / in arrears（拖欠中）；pay arrearages（补缴欠款）；mortgage arrearages（拖欠房贷）；child-support arrearages（拖欠抚养费）。"]}
{"word":"arrears","summary":{"en":"Arrears means overdue money or being behind in payments or progress, often used in formal/financial contexts.","zh":"Arrears 指逾期欠款/拖欠款，也可指进度落后，多见于正式或财经语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"money that is owed and should have been paid earlier (late or overdue payments), such as rent, wages, or bills","zh":"（应付未付的）欠款，逾期款（如房租、工资或账单）"},"examples":[{"en":"He is three months in arrears on his rent.","zh":"他的房租已经拖欠三个月了。"},{"en":"The company paid the workers their wages in arrears.","zh":"公司把拖欠的工资补发给了工人。"},{"en":"If you fall into arrears, contact the bank as soon as possible.","zh":"如果你出现逾期欠款，应尽快联系银行。"}]},{"partOfSpeech":"other","definition":{"en":"behind the correct time or level; not keeping up with what is required","zh":"落后于应有进度；未跟上要求"},"examples":[{"en":"She is in arrears with her coursework after missing two weeks of class.","zh":"她因为缺课两周，作业进度落后了。"},{"en":"The project is in arrears and may miss the deadline.","zh":"项目进度落后，可能赶不上截止日期。"}]}],"synonyms":["overdue payments","back payments","past-due amounts","debt","behind"],"phonetic":"/əˈrɪrz/","extraExplanation":["“arrears”几乎总是以复数形式出现（ending in -s），即使指一笔欠款也常说“in arrears”。常见搭配：be in arrears（拖欠/逾期）、fall into arrears（陷入拖欠）、rent/tax/loan arrears（房租/税款/贷款欠款）、pay in arrears（事后支付：例如工资按“后付”制度发放，并不一定表示拖欠）。","来源提示：来自法语/拉丁语，核心含义是“在后面、落后”。在英美语境里多用于正式或财经场景（银行、合同、账单、租赁等）。"]}
{"word":"arrect","summary":{"en":"Arrect is an archaic/literary word meaning “upright/erect,” and less commonly “to make upright.”","zh":"arrect 是较少见的古语/文学用词，意为“直立的、竖起的”，也可作动词表示“使直立、竖起”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic or literary) upright or erect; standing straight.","zh":"（古语/文学用语）直立的；竖起的；挺直的。"},"examples":[{"en":"The arrect posture of the guard made everyone feel watched.","zh":"卫兵挺直的站姿让人觉得一直被盯着。"},{"en":"In the old painting, the horse’s ears are arrect, as if it hears something.","zh":"在那幅旧画里，马的耳朵竖起，仿佛听到了什么。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Archaic or technical) to make upright; to raise or erect.","zh":"（古语/技术用语）使直立；竖起；立起。"},"examples":[{"en":"He arrected the pole so the flag could be seen from the road.","zh":"他把杆子竖起来，让路上的人也能看见旗子。"},{"en":"Some texts use “arrect” for the action of raising the ears or head in attention.","zh":"有些文本用 arrect 表示“竖起耳朵或抬起头以示专注”的动作。"}]}],"synonyms":["erect","upright","raised","stiffened","straightened"],"phonetic":"/əˈrɛkt/","extraExplanation":["arrect 源自拉丁语 arrectus，含“竖起、抬起”的意思；在现代英语中较少见，更常用 erect、upright、raise。","在文学描写里，arrect 常用来写“耳朵竖起”“身形挺直”等，带一点书面、古典的语感。"]}
{"word":"arrectary","summary":{"en":"Arrectary is a rare anatomy term meaning ‘raising/erecting,’ or referring to an arrector muscle (especially the arrector pili).","zh":"Arrectary 是一个较少见的解剖学词，表示“使竖起的”，或指“竖毛肌/立毛肌”等起竖作用的肌肉（尤指立毛肌）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy, rare) Causing something to stand up or become erect; raising.","zh":"（解剖学，较少用）使某物竖起、立起的；起立/勃起的。"},"examples":[{"en":"Cold air can trigger arrectary muscle action, making the hairs stand up.","zh":"冷空气会触发立毛肌的收缩，让毛发竖起来。"},{"en":"The tiny arrectary muscles attached to hair follicles contract under stress.","zh":"与毛囊相连的微小立毛肌在压力下会收缩。"}]},{"partOfSpeech":"n.","definition":{"en":"(Anatomy, rare) An arrector muscle, especially the arrector pili (the muscle that raises body hair).","zh":"（解剖学，较少用）竖毛肌/立毛肌等“使竖起”的肌肉，尤指立毛肌（使体毛竖起的肌肉）。"},"examples":[{"en":"In some older texts, the arrectary is mentioned when describing goosebumps.","zh":"在一些较旧的文献中，描述“起鸡皮疙瘩”时会提到立毛肌（arrectary）。"},{"en":"The doctor explained that the arrectary muscle is part of the skin’s response system.","zh":"医生解释说，立毛肌属于皮肤的反应系统之一。"}]}],"synonyms":["arrector (pili)","arrector muscle","piloerector (muscle)"],"phonetic":"/əˈrɛktəri/","extraExplanation":["这个词很少见，多出现在较旧的医学/解剖学写作中。现代英语里更常用的是 **arrector (pili)** 或直接说 **arrector pili muscle**（立毛肌）。","词源上与拉丁语中表示“竖起、抬起”的词根有关（可联想 **erect** ‘竖立/勃起’）。"]}
{"word":"arrector","summary":{"en":"Arrector is an anatomy term meaning a muscle that raises or makes something stand up, especially the arrector pili muscle that causes goosebumps.","zh":"Arrector 是解剖学用语，指“使某物抬起或竖起的肌肉”，尤其常指立毛肌（arrector pili），它会让人起鸡皮疙瘩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy) A muscle that raises or erects a body part (for example, a small muscle that makes hair stand up).","zh":"（解剖）使身体某部分抬起或竖起的肌肉（例如让汗毛竖起的小肌肉）。"},"examples":[{"en":"The arrector pili muscles contract when you feel cold, making your skin look bumpy.","zh":"当你觉得冷时，立毛肌（arrector pili）会收缩，让皮肤看起来起鸡皮疙瘩。"},{"en":"In anatomy class, we learned that an arrector muscle can lift a structure by contracting.","zh":"在解剖课上，我们学到“arrector”这类肌肉通过收缩来抬起某个结构。"}]}],"synonyms":["erector (general sense)","arrector pili (common specific term)"],"phonetic":"əˈrɛktər","extraExplanation":["“arrector”多见于解剖学术语，常与其他词搭配使用，最常见的是 arrector pili（立毛肌），指毛囊旁的一小束平滑肌，收缩时会让毛发竖立并产生“鸡皮疙瘩”。","词源上来自拉丁语，核心含义是“使竖起/使抬起”，与 erect（竖立）在意义上相关。日常英语里很少单独使用，更多出现在医学或生物学语境。"]}
{"word":"arrendation","summary":{"en":"Arrendation is a rare word meaning leasing/renting out property, or a lease agreement itself.","zh":"Arrendation 是个较罕见的词，指“出租/租赁”的行为，或指“租约/租赁合同”本身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) The act of leasing or renting out land or property; the granting of a lease.","zh":"（罕见用法）把土地或房产出租的行为；授予租约/租赁权。"},"examples":[{"en":"In some old legal documents, arrendation refers to leasing land to a tenant for a fixed term.","zh":"在一些旧的法律文件里，arrendation 指把土地按固定期限出租给佃户的行为。"},{"en":"The estate’s income came largely from the arrendation of farmland.","zh":"该庄园的收入主要来自农田的出租。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A lease agreement or the leased property/rights under that lease.","zh":"（罕见用法）租赁合同；或租约下的租赁物/租赁权。"},"examples":[{"en":"They reviewed the arrendation to confirm the rent and renewal terms.","zh":"他们审阅租约以确认租金与续租条款。"},{"en":"The arrendation gave the tenant the right to use the house for five years.","zh":"该租约赋予承租人使用该房屋五年的权利。"}]}],"synonyms":["lease","leasing","rental","tenancy","letting"],"phonetic":"/ˌærənˈdeɪʃən/","extraExplanation":["“arrendation”在现代英语中非常少见，更常见的说法是“lease / leasing / rental (agreement) / tenancy”。","词源上与西班牙语/法语中表示“出租、租赁”的词根有关（如西语 arrendar）。如果你是在法律或历史材料中看到它，通常就按“租赁/租约”理解即可。","如果你原本想查的是“arraignment”（法庭上的提审）或“arrestation”（拘捕，较少见），告诉我上下文句子我可以帮你确认。"]}
{"word":"arrendator","summary":{"en":"An arrendator is a tenant/lessee who rents land or property, especially in legal or historical contexts.","zh":"arrendator 指承租（土地或房产）的人/公司，即承租人，常见于法律或历史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or company that rents (leases) land or property from someone else; a tenant or lessee (often used in legal or historical contexts).","zh":"从他人那里租用（土地或房产）的人或公司；承租人/租户（常见于法律或历史语境）。"},"examples":[{"en":"The arrendator agreed to pay rent every quarter.","zh":"承租人同意每个季度支付一次租金。"},{"en":"In the old records, the arrendator was responsible for maintaining the fields.","zh":"在旧档案中，承租人负责维护田地。"}]}],"synonyms":["tenant","lessee","renter"],"phonetic":"əˈrɛnˌdeɪtɚ","extraExplanation":["这个词比较少见，常出现在法律文件、历史研究或与西班牙语/葡萄牙语地区相关的语境中（与“arrendamiento/arrendar”这类“租赁”的词族有关）。日常英语里更常用 tenant（租户）或 lessee（承租人）。"]}
{"word":"arrengiare","summary":{"en":"Arrange means to organize things in order or to plan and make preparations for something.","zh":"Arrange 指把事物整理成有序状态，或为某事作出安排与准备。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To put things in a neat, correct, or planned order; to organize.","zh":"把……整理好；安排；组织。"},"examples":[{"en":"Please arrange the books by size.","zh":"请按大小把书整理好。"},{"en":"We need to arrange the chairs for the meeting.","zh":"我们需要为会议摆放椅子。"},{"en":"She arranged her desk before class started.","zh":"上课前她把桌面整理好了。"}]},{"partOfSpeech":"vt.","definition":{"en":"To plan or prepare something; to make the necessary details happen (often used with “arrange for” or “arrange to”).","zh":"安排；筹备；使（事情）落实（常用“arrange for / arrange to”）。"},"examples":[{"en":"I’ll arrange a taxi for you.","zh":"我会替你安排一辆出租车。"},{"en":"They arranged to meet at 6 p.m.","zh":"他们约好在晚上六点见面。"},{"en":"Could you arrange a meeting with the teacher?","zh":"你能安排和老师见个面吗？"}]},{"partOfSpeech":"vt.","definition":{"en":"To reach an agreement; to settle details (more formal).","zh":"达成一致；商定细节（较正式）。"},"examples":[{"en":"We arranged a price that both sides accepted.","zh":"我们商定了双方都能接受的价格。"},{"en":"The lawyer arranged the terms of the contract.","zh":"律师商定了合同条款。"}]},{"partOfSpeech":"vi.","definition":{"en":"To organize or make plans (without stating the object).","zh":"安排；筹划（不直接说出宾语）。"},"examples":[{"en":"I’ll call you after I arrange everything.","zh":"等我都安排好了再给你打电话。"},{"en":"He is arranging for the trip next week.","zh":"他正在安排下周的行程。"}]}],"synonyms":["organize","plan","set up","sort","prepare","schedule"],"phonetic":"/əˈreɪndʒ/","extraExplanation":["你输入的“arrengiare”不是常见英文单词，最可能是把 **arrange** 拼错了（也可能受意大利语 *arrangiare* 影响）。英文里最常用的是 **arrange**（整理/安排）。"]}
{"word":"arrenotokous","summary":{"en":"Arrenotokous means “producing only male offspring,” mainly used in scientific biology contexts.","zh":"Arrenotokous 指“只产生雄性后代”，主要用于生物学等科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of reproduction) producing only male offspring; male-producing (often used in biology, especially about certain insects and other animals).","zh":"（指繁殖方式）只产生雄性后代的；产雄性的（多用于生物学语境，常见于昆虫等动物）。"},"examples":[{"en":"Some species can reproduce in an arrenotokous way under certain conditions.","zh":"一些物种在特定条件下可以以产雄性（arrenotokous）的方式繁殖。"},{"en":"In arrenotokous reproduction, unfertilized eggs may develop into males in some insects.","zh":"在产雄性繁殖中，一些昆虫的未受精卵可能发育成雄性。"}]}],"synonyms":["male-producing","male-only (offspring)"],"phonetic":"/əˌriːnoʊˈtoʊkəs/","extraExplanation":["该词较少出现在日常英语里，主要用于动物学、昆虫学等学术写作。","词源上与希腊语表示“男性/雄性”（arrhen）和“生育/分娩”（tokos）有关，因此字面意思接近“生出雄性的”。","在相关研究中常与 thelytokous（只产生雌性后代）并列，用来描述某些物种的单性生殖或性别决定机制。"]}
{"word":"arrenotoky","summary":{"en":"“Aren’t okay” means “are not fine/acceptable/normal.”","zh":"“aren’t okay”表示“不太好/不被接受/不正常”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(likely intended as) “aren’t okay”: not fine; not acceptable; not in a good or safe condition.","zh":"（很可能想表达）“aren’t okay”：不太好；不可以/不合适；状态不安全或不正常。"},"examples":[{"en":"If you’re not feeling well, it’s okay to say you aren’t okay.","zh":"如果你感觉不舒服，说“我不太好”是可以的。"},{"en":"Those comments aren’t okay—they’re hurtful.","zh":"那些评论不行/不合适——很伤人。"},{"en":"The numbers aren’t okay; we need to check the data again.","zh":"这些数字不对劲；我们需要再核对一次数据。"}]}],"synonyms":["not okay","not fine","not acceptable","not all right","not good"],"phonetic":"/ɑrnt oʊˈkeɪ/","extraExplanation":["你输入的“arrenotoky”看起来像是把“aren’t okay”连在一起打错了：正确写法通常是 aren’t okay（= are not okay）。","aren’t 是 are not 的缩写，更口语；在正式写作里常写 are not okay。","“not okay”在英语里既可以表示情绪状态（不舒服/难过），也可以表示行为或言论“不可接受”。"]}
{"word":"arrent","summary":{"en":"“Arrent” isn’t standard; you likely mean “aren’t” or “arrant.”","zh":"“arrent”不是标准用词；你可能想写“aren’t”或“arrant”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually a misspelling. Common intended words are “aren’t” (are not) or “arrant” (complete; often negative).","zh":"不是标准英语单词；通常是拼写错误。常见想表达的可能是“aren’t”（are not 的缩写）或“arrant”（十足的/彻底的，常带贬义）。"},"examples":[{"en":"You wrote “arrent”; did you mean “aren’t” (are not)?","zh":"你写了“arrent”；你是不是想写“aren’t”（are not 的缩写）？"},{"en":"If you meant “arrant,” you could say: “an arrant lie.”","zh":"如果你想写“arrant”，可以说：“an arrant lie（彻头彻尾的谎言）。”"}]}],"synonyms":["aren’t","arrant"],"phonetic":"/ˈæɹənt/","extraExplanation":["“aren’t”常用于口语/非正式写作，是“are not”的缩写：They aren’t ready.（他们还没准备好。）","“arrant”是较正式/文学化的词，常搭配负面名词（lie, fool, nonsense 等），表示“十足的、彻底的（多为贬义）”。"]}
{"word":"arrentable","summary":{"en":"“Arrentable” is not standard; you probably mean “rentable” = able/suitable to be rented.","zh":"“arrentable”不规范；你可能想说“rentable”，意思是“可出租的/可租用的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Not standard) “arrentable” is not a common English word. People usually mean “rentable,” meaning able to be rented (especially a room, house, car, etc.).","zh":"（不规范）“arrentable”不是常见英语单词。多数情况下人们想表达的是“rentable”，意思是“可出租的 / 可租用的”（常用于房间、房子、汽车等）。"},"examples":[{"en":"I couldn’t find “arrentable” in a dictionary—did you mean “rentable”?","zh":"我在词典里找不到“arrentable”——你是不是想说“rentable”？"},{"en":"The apartment is rentable from March onward.","zh":"这套公寓从三月起可以出租。"}]},{"partOfSpeech":"adj.","definition":{"en":"Rentable: profitable or suitable to rent out (often used in real estate or business contexts).","zh":"rentable：出租有利可图的 / 适合出租的（常用于房地产或商业语境）。"},"examples":[{"en":"The landlord renovated the unit to make it more rentable.","zh":"房东翻新了这套房子，让它更适合出租。"},{"en":"Small studios are usually very rentable in this neighborhood.","zh":"在这个社区，小单间通常很好出租。"}]}],"synonyms":["for rent","available to rent","leaseable","lettable"],"phonetic":"/ˈrɛn.tə.bəl/","extraExplanation":["“rentable”在美式英语里能用，但更常见、更自然的表达是“for rent”（招租/可出租）或“available to rent”（可租用）。例如：The apartment is for rent.","如果你想表达“不能出租/租不出去”，常用“unrentable”（较正式）或更口语的“hard to rent out”（很难租出去）。"]}
{"word":"arrentation","summary":{"en":"“Arrentation” isn’t a standard English word; it’s likely a misspelling (often of “argumentation” or “annotation”).","zh":"“arrentation”不是标准英语词，通常是拼写错误（常见可能是“argumentation”或“annotation”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually a misspelling or a mistaken form in writing.","zh":"不是标准英语词；通常是拼写错误或误写出来的形式。"},"examples":[{"en":"I can’t find “arrentation” in a standard dictionary—did you mean “argumentation” or “annotation”?","zh":"我在常见词典里找不到“arrentation”——你是不是想写“argumentation（论证）”或“annotation（注释）”？"}]}],"phonetic":"/ˌærənˈteɪʃən/","extraExplanation":["“arrentation”在英语里不常见，基本不被当作正式单词使用；更像是拼写误差。","你可能想查的是：\n1) argumentation：意为“论证、辩论的过程”（更正式、学术写作常用）。\n2) annotation：意为“注释、批注”（书本、文章边注）。\n3) arrant（形容词）：意为“十足的、彻底的（通常用于贬义）”，如 arrant liar（十足的骗子）。","如果你能提供一句原句（含上下文），我可以帮你确定最可能的目标词。"]}
{"word":"Arrephoria","summary":{"en":"Arrephoria: an ancient Athenian festival linked to a secret ritual performed by selected young girls.","zh":"Arrephoria：古雅典的一种节庆，与由被选中的少女执行的秘密仪式有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient Athenian religious festival (also spelled Arrhephoria) honoring Athena (and connected with a secret night ritual carried out by young girls called arrephoroi).","zh":"古雅典的一种宗教节庆（亦拼作 Arrhephoria），祭祀雅典娜（并与一项秘密的夜间仪式有关，由被称为 arrephoroi 的少女执行）。"},"examples":[{"en":"In her paper, she mentions the Arrephoria as part of Athens’ summer religious calendar.","zh":"在她的论文中，她把 Arrephoria 作为雅典夏季宗教历的一部分提到。"},{"en":"The Arrephoria involved a nighttime procession with objects that were not meant to be seen.","zh":"Arrephoria 包含一段夜间的队列行进，携带着不应被人看见的物品。"}]}],"synonyms":["Arrhephoria"],"phonetic":"/ˌærɪˈfɔːriə/","extraExplanation":["更常见的拼写是 Arrhephoria（带 h），相关的少女称为 arrephoroi（单数 arrephoros）。她们通常是贵族出身的小女孩，被挑选在雅典卫城为雅典娜服务一段时间。","该节庆以“秘密搬运/交接”为特色：夜间把装在容器里的物品从雅典娜神庙附近带到另一处圣所再带回；内容物与具体仪式细节在古代就带有神秘色彩，因此现代研究多依赖零散记载与考古推测。","词源来自希腊语，常被解释为与“搬运、携带秘密物品”相关；在英文写作中多见于古典学、宗教学或古希腊史语境。"]}
{"word":"Arrephoroi","summary":{"en":"Arrephoroi were young Athenian girls who served Athena in a secret religious rite called the Arrhephoria.","zh":"Arrephoroi 指雅典被选中的少女，侍奉雅典娜并参加名为 Arrhephoria 的秘密宗教仪式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Greece) young girls chosen in Athens to serve the goddess Athena in a secret annual religious rite (the Arrhephoria), including carrying hidden sacred objects.","zh":"（古希腊）雅典被选中的少女，侍奉雅典娜并参加一年一度的神秘宗教仪式“阿瑞福里亚节（Arrhephoria）”，其中包括搬运被遮蔽的神圣物品。"},"examples":[{"en":"The Arrephoroi lived on the Acropolis for a time as part of their service to Athena.","zh":"阿瑞福罗伊少女会在卫城居住一段时间，以完成对雅典娜的侍奉。"},{"en":"In accounts of Athenian religion, the Arrephoroi appear in descriptions of the secret nighttime procession.","zh":"在关于雅典宗教的记载中，阿瑞福罗伊常出现在对夜间秘密行列的描述里。"},{"en":"A museum label explained that the Arrephoroi carried baskets whose contents were not to be seen.","zh":"博物馆说明牌写道：阿瑞福罗伊会搬运篮子，但篮中之物不应被人看见。"}]}],"synonyms":["Arrhephoroi (variant spelling)","Arrephoros (singular)"],"phonetic":"əˈrɛfəˌrɔɪ","extraExplanation":["“Arrephoroi”通常被视为复数名词（单数常写作 Arrephoros）。该词与“携带/运送”有关，也常与“不可言说、不可公开”的神圣物品联系在一起，因此译介时会强调“秘密仪式、隐秘圣物搬运”。","相关仪式一般与雅典卫城（Acropolis）上的雅典娜信仰和城市宗教生活有关；古代作者如帕乌萨尼亚斯（Pausanias）等曾提到这一传统，但细节往往因“神秘性”而语焉不详。"]}
{"word":"Arrephoros","summary":{"en":"An Arrephoros was a young Athenian girl chosen to serve Athena in a secret annual ritual.","zh":"Arrephoros 指古雅典被选中为雅典娜服务、参与年度秘密仪式的小女孩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In ancient Athens, an Arrephoros was one of two young girls chosen each year to serve Athena by performing a secret ritual (the Arrephoria) and helping with sacred duties on the Acropolis.","zh":"在古代雅典，Arrephoros（阿瑞佛洛斯）是每年选出的两名小女孩之一，她们在卫城为雅典娜服务，执行名为 Arrephoria 的秘密仪式，并承担一些神圣职责。"},"examples":[{"en":"The Arrephoros lived for a time on the Acropolis as part of her service to Athena.","zh":"Arrephoros 在为雅典娜服务期间，会在卫城居住一段时间。"},{"en":"Historians describe the Arrephoros carrying sacred objects whose contents were not revealed to the public.","zh":"历史学者记载，Arrephoros 会携带神圣物品，但其内容不会向公众公开。"}]}],"synonyms":["Arrephoroi (plural)"],"phonetic":"/əˈrɛfəˌrɔs/","extraExplanation":["“Arrephoros”常见于古典学与希腊宗教研究中，更常见的复数形式是 “Arrephoroi”（两名女孩一起承担职责）。","她们参与的仪式通常与雅典娜、城市守护与“编织圣衣（peplos）”等宗教象征相关；其中最著名的一段是夜间秘密搬运物品并完成交接。","这个词在英文里多作为历史/考古语境的专有名词使用，日常英语中很少见。"]}
{"word":"arreption","summary":{"en":"Arreption means a sudden taking or seizure; it’s a rare, archaic noun.","zh":"Arreption 指“突然夺取/攫取”，是一个罕见、偏古的名词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sudden taking or seizure; an act of snatching something quickly (rare/archaic).","zh":"突然夺取；迅速攫取（较少见/古词）。"},"examples":[{"en":"In old legal writing, an arreption could describe the sudden seizure of goods.","zh":"在旧式法律文书中，arreption 可用来描述对财物的突然扣押。"},{"en":"The poem hints at arreption—grabbing a moment before it disappears.","zh":"这首诗暗示了 arreption——在瞬间消逝前把它抓住。"}]}],"synonyms":["seizure","snatching","taking","capture"],"phonetic":"/əˈrɛpʃən/","extraExplanation":["这个词非常罕见，多见于古英语/拉丁化的学术或法律语境。来自拉丁语 arripere（ar- 加强 + ripere “抓住、夺取”），与常见词 “to snatch / to seize / to grab”意思相近。","如果你是在现代文本里看到它，也可能是拼写误差。常见的相近词包括：“arrepentance”（悔改）、“reception”（接待/接收）、“apprehension”（理解/担忧/逮捕）。你可以把原句发我，我帮你判断。"]}
{"word":"arreptitious","summary":{"en":"Surreptitious means secretly done to avoid notice, often because it’s not approved.","zh":"Surreptitious 指为避人耳目而秘密进行的，常暗示不被允许或不光彩。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"done secretly, especially because it is not allowed, approved, or is meant to avoid attention","zh":"秘密进行的（尤指因不被允许/不被赞同而刻意避人耳目）"},"examples":[{"en":"They held a surreptitious meeting after work to discuss the plan.","zh":"他们下班后秘密开会讨论计划。"},{"en":"She took a surreptitious glance at her phone during the lecture.","zh":"她在讲座中偷偷瞥了一眼手机。"},{"en":"The company made surreptitious payments to hide the deal.","zh":"公司暗中付款以掩盖这笔交易。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of a person) acting in a secret and sometimes slightly dishonest way","zh":"（形容人）鬼鬼祟祟的；带点不光彩地偷偷摸摸的"},"examples":[{"en":"He gave a surreptitious smile when he heard the surprise was working.","zh":"听到惊喜计划奏效时，他露出一个偷偷的笑。"},{"en":"The surreptitious driver tried to avoid the police by taking back roads.","zh":"那个鬼鬼祟祟的司机试图走小路躲开警察。"}]}],"synonyms":["secret","covert","sneaky","clandestine","furtive"],"phonetic":"/ˌsɝəˈpɪʃəs/","extraExplanation":["你输入的“arreptitious”通常被认为是拼写错误；正确常用词是 **surreptitious**。","词源来自拉丁语 *surrepticius*，与“偷拿/偷带走”（*surrept-*）有关，因此常带有“偷偷进行、避人耳目”的语感。","使用上常和 **surreptitious glance / surreptitious look / surreptitious meeting / surreptitious attempt** 搭配。注意它通常比 **secret** 更强调“刻意隐瞒、可能不被允许”。"]}
{"word":"arrest","summary":{"en":"Arrest means to take someone into custody, or (more formally) to stop/slow something; as a noun, it can mean an act of arrest or a sudden stoppage (e.g., cardiac arrest).","zh":"Arrest 常指（警方）逮捕；也可较正式地表示“遏制/抑制”。作名词时指逮捕行为或（如心脏）骤停。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to take someone into police custody because they are suspected of a crime","zh":"（警方）逮捕，拘捕（因涉嫌犯罪而带走）"},"examples":[{"en":"The police arrested him for shoplifting.","zh":"警方因他商店行窃而逮捕了他。"},{"en":"She was arrested after the protest turned violent.","zh":"抗议活动变得暴力后，她被逮捕了。"}]},{"partOfSpeech":"vt.","definition":{"en":"to stop or slow down a process or development","zh":"阻止；抑制；使停止或减缓（进程/发展）"},"examples":[{"en":"The new policy aims to arrest the spread of the disease.","zh":"新政策旨在遏制疾病的传播。"},{"en":"Prompt treatment can arrest the condition.","zh":"及时治疗可以控制病情发展。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of taking someone into police custody; the state of being in custody","zh":"逮捕；拘留状态"},"examples":[{"en":"Two arrests were made near the stadium.","zh":"体育场附近进行了两起逮捕。"},{"en":"He resisted arrest.","zh":"他拒捕。"}]},{"partOfSpeech":"n.","definition":{"en":"a sudden stopping of a body function (especially in medical use)","zh":"（生理机能的）骤停（尤指医学用语）"},"examples":[{"en":"The patient went into cardiac arrest.","zh":"病人发生了心脏骤停。"}]}],"synonyms":["detain","apprehend","capture","seize","halt","stop"],"phonetic":"/əˈrɛst/","extraExplanation":["“arrest”最常见的语境是法律：警方“arrest someone”（逮捕某人）。被逮捕后不一定立刻被定罪；是否有罪要由调查与法院审理决定。","“arrest”在较正式/书面语里也常指“遏制、阻止”（arrest the decline/spread）。这个用法在新闻、政策文件、医学表达中比较多。","常见搭配：be arrested for...（因……被捕）；be arrested on suspicion of...（因涉嫌……被捕）；make an arrest（实施逮捕）；resist arrest（拒捕）；under arrest（被拘捕）。"]}
{"word":"arrestable","summary":{"en":"Arrestable means legally able to be arrested, or likely to be arrested because of unlawful behavior.","zh":"arrestable 指“依法可被逮捕的”，也可泛指“因违法行为而很可能被逮捕的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be arrested; legally subject to arrest (usually because there is a lawful reason or authority to arrest).","zh":"可被逮捕的；依法可以逮捕的（通常指具备合法理由或权限）。"},"examples":[{"en":"If the officer has probable cause, the suspect is arrestable.","zh":"如果警官有“合理根据”，嫌疑人就属于可被逮捕的对象。"},{"en":"Driving with an expired warrant can make you arrestable during a traffic stop.","zh":"在有过期未处理的逮捕令时开车，可能会让你在交通拦检时被逮捕。"}]},{"partOfSpeech":"adj.","definition":{"en":"In a broader sense, likely to be arrested because one’s behavior breaks the law or violates rules.","zh":"（更宽泛地）很可能会被逮捕的（因为行为违法或违规）。"},"examples":[{"en":"Posting threats online can be arrestable behavior.","zh":"在网上发布威胁信息可能属于会被逮捕的行为。"},{"en":"The protest remained peaceful and didn’t become arrestable conduct.","zh":"这场抗议保持和平，没有演变成会导致逮捕的行为。"}]}],"synonyms":["subject to arrest","liable to arrest","arrest-worthy","detainable"],"phonetic":"/əˈrɛs.tə.bəl/","extraExplanation":["“arrestable”在新闻、法律语境里更常见，强调“是否具备合法逮捕条件”。美国英语里常和 probable cause（合理根据）、warrant（逮捕令/搜查令）等搭配出现。日常口语更常说 “someone can be arrested” 或 “is subject to arrest”。"]}
{"word":"arrestant","summary":{"en":"An arrestant is a person who has been arrested (or, rarely, describes someone who is under arrest).","zh":"arrestant 指被逮捕/被拘留的人（少见时也可作形容词表示“被逮捕的”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who has been arrested; a detainee.","zh":"被逮捕的人；被拘留者。"},"examples":[{"en":"The police transported the arrestant to the station for questioning.","zh":"警方把被逮捕者送到警局接受讯问。"},{"en":"The arrestant asked to speak with a lawyer before answering any questions.","zh":"被逮捕者要求在回答任何问题前先与律师交谈。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) arrested; being held by the authorities.","zh":"（罕见）被逮捕的；被当局拘押的。"},"examples":[{"en":"The arrestant suspect was kept in a secure room.","zh":"被拘押的嫌疑人被安置在一间安全房间里。"}]}],"synonyms":["arrestee","detainee","prisoner","suspect"],"phonetic":"/əˈrɛstənt/","extraExplanation":["“arrestant”在现代英语里比较少见，更常用的是“arrestee”（被捕者）或“detainee”（被拘留者）。在法律、警方记录或较正式的语境中偶尔会出现。"]}
{"word":"arrestare","summary":{"en":"“Arrestare” is an Italian verb meaning “to arrest (a person)” or “to stop/halt (something).”","zh":"“arrestare”是意大利语动词，意思是“逮捕（某人）”或“使停止/中止（某事）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Italian) to arrest; to take someone into custody by legal authority.","zh":"（意大利语）逮捕；依法拘留某人。"},"examples":[{"en":"In Italian, “La polizia ha arrestato il ladro” means “The police arrested the thief.”","zh":"意大利语里，“La polizia ha arrestato il ladro”意思是“警察逮捕了小偷”。"},{"en":"They used the verb “arrestare” in the report to describe the suspect being taken into custody.","zh":"他们在报道中用动词“arrestare”来描述嫌疑人被拘留。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Italian) to stop or halt something; to bring to a standstill (often used for movement or a process).","zh":"（意大利语）使停止；使中止（常指运动或某个过程）。"},"examples":[{"en":"“Arrestare il motore” means “to stop the engine.”","zh":"“Arrestare il motore”意思是“让发动机停止”。"},{"en":"The medicine helped arrest the spread of the infection.","zh":"这种药物帮助遏制（阻止）感染扩散。"}]}],"synonyms":["arrest","detain","take into custody","stop","halt","prevent","block"],"phonetic":"/ˌɑrɛˈstɑreɪ/","extraExplanation":["“Arrestare”是意大利语动词，和英语“arrest（逮捕）”同源，都来自拉丁语词根，核心含义是“抓住、使停止”。在意大利语里，它既可用于法律语境（逮捕），也可用于一般语境（停止机器、阻止进程）。","如果你是在学意大利语：常见变位如 io arresto（我逮捕/停止）、lui/lei arresta（他/她逮捕/停止）、passato prossimo: ho arrestato（我已经逮捕/停止）。"]}
{"word":"arrestation","summary":{"en":"Arrestation is an uncommon noun meaning an arrest or the act of arresting; more rarely, it means a stopping or halt.","zh":"arrestation 是一个不常用名词，意为“逮捕/逮捕行为”；更少见时可指“停止、阻止、中止”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon) The act of arresting someone; an arrest.","zh":"（不常用）逮捕某人的行为；逮捕。"},"examples":[{"en":"The suspect’s arrestation happened just outside the station.","zh":"嫌疑人是在车站外被逮捕的。"},{"en":"The report describes the arrestation as peaceful and quick.","zh":"报告称这次逮捕过程平和且迅速。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare/technical) A stopping or checking of movement or progress; a sudden halt.","zh":"（罕见/较技术性）停止、阻止（进展或运动）；突然中止。"},"examples":[{"en":"An arrestation of blood flow can damage tissue.","zh":"血流的中断可能会损伤组织。"},{"en":"They feared an arrestation of the project after funding was cut.","zh":"他们担心资金被削减后项目会停摆。"}]}],"synonyms":["arrest","apprehension","detention","seizure","halt","stoppage"],"phonetic":"/ˌæɹəˈsteɪʃən/","extraExplanation":["“arrestation”在现代英语里比较少见，日常更常用的是“arrest”（n./v. 逮捕）或“the arrest of …”。如果你在新闻或法律文本中看到“arrestation”，通常是在强调“逮捕这一行为/过程”，或受到法语（如 *arrestation*）表达方式的影响。"]}
{"word":"arrested","summary":{"en":"“Arrested” usually means “caught by the police,” and it can also mean “stopped from developing.”","zh":"“arrested”通常指“被警方逮捕的”，也可指“发展/进程被阻止、停滞的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"taken by the police; officially caught and held because you are suspected of a crime","zh":"被警方逮捕的；因涉嫌犯罪而被正式拘留的"},"examples":[{"en":"He was arrested for stealing a car.","zh":"他因偷车被逮捕。"},{"en":"She got arrested after the protest turned violent.","zh":"抗议活动变得暴力后，她被逮捕了。"}]},{"partOfSpeech":"adj.","definition":{"en":"stopped or slowed so it cannot continue or develop normally (often in phrases like “arrested development”)","zh":"被阻止的；发展受阻的（常见于短语“arrested development”）"},"examples":[{"en":"The project is in arrested development because funding ran out.","zh":"由于资金用尽，这个项目的发展停滞了。"},{"en":"The report discusses children with arrested growth.","zh":"报告讨论了生长发育受阻的儿童。"}]},{"partOfSpeech":"v.","definition":{"en":"simple past and past participle of “arrest”: to seize and take someone into custody; to stop or hold back","zh":"“arrest”的过去式/过去分词：逮捕；（使）停止、阻止"},"examples":[{"en":"The police arrested him at his home.","zh":"警方在他家逮捕了他。"},{"en":"Quick action arrested the spread of the fire.","zh":"迅速行动阻止了火势蔓延。"}]}],"synonyms":["detained","taken into custody","apprehended","caught","stopped","halted"],"phonetic":"/əˈrɛstɪd/","extraExplanation":["“arrested”作形容词时，最常见是“被逮捕的”。在新闻里常见被动结构：be arrested (for + 罪名/原因) 或 be arrested on suspicion of…（因涉嫌……被捕）。","“arrested development”在日常英语里既可指真实的“发育/发展受阻”，也常带一点讽刺意味，指一个人心理或行为“不成熟、停留在某个阶段”。（同名美剧《Arrested Development》也借用了这个双关。）"]}
{"word":"arrestee","summary":{"en":"An arrestee is a person who has been arrested.","zh":"Arrestee 指“被逮捕的人、被捕者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who has been arrested by the police or other authorities","zh":"被逮捕的人；被捕者"},"examples":[{"en":"The arrestee was taken to the police station for questioning.","zh":"被捕者被带到警察局接受讯问。"},{"en":"The officer told the arrestee to stay calm and follow instructions.","zh":"警官让被捕者保持冷静并听从指示。"}]}],"synonyms":["detainee","suspect"],"phonetic":"/əˌrɛsˈti/","extraExplanation":["“arrestee”来自动词“arrest”（逮捕）+ 名词后缀“-ee”。“-ee”常表示“动作的承受者/接受者”，例如：employee（雇员，被雇用的人）、trainee（受训者）、interviewee（受访者）。","在新闻与法律语境中，“arrestee”强调“刚被逮捕/处于被捕状态的人”；而“suspect”是“嫌疑人”（未必被逮捕），“defendant”是“被告”（已进入诉讼程序）。"]}
{"word":"arrestees","summary":{"en":"Arrestees are people who have been arrested by the police.","zh":"arrestees 指被警方逮捕的人（被捕者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who have been arrested by the police.","zh":"被警方逮捕的人；被捕者。"},"examples":[{"en":"The police questioned the arrestees at the station.","zh":"警方在警局讯问了被捕者。"},{"en":"The arrestees were taken to court the next morning.","zh":"这些被捕者第二天早上被带到法庭。"}]}],"synonyms":["people who were arrested","suspects","detainees (broader)"],"phonetic":"/əˌrɛsˈtiːz/","extraExplanation":["“arrestee”是从动词 arrest（逮捕）+ 名词后缀 -ee 构成，-ee 常表示“动作的承受者”（如 employee 雇员、refugee 难民）。因此 arrestee 就是“被逮捕的人”。","在新闻或法律语境中更常用 arrestee；日常口语里也常说 “the person they arrested / the people who were arrested”。","用法提示：arrestee 只表示“被逮捕”，不表示“有罪”。英语新闻里常会搭配 alleged（被指称的）或 suspect（嫌疑人）来避免默认其有罪。"]}
{"word":"arrester","summary":{"en":"Arrester can mean a person who makes an arrest, or a device that stops/redirects danger (like surges, flames, or sparks).","zh":"Arrester 可指“实施逮捕的人”，也可指“用于阻止或安全导走危险的装置”（如浪涌、火焰或火花）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person (often a police officer) who arrests someone; someone who stops or seizes a suspect by law.","zh":"（常指警察等）实施逮捕的人；依法拘捕嫌疑人的人。"},"examples":[{"en":"The arrester read him his rights before taking him to the station.","zh":"逮捕人员在把他带去警局前向他宣读了权利。"},{"en":"Witnesses said the arrester acted calmly and professionally.","zh":"目击者说逮捕人员表现得冷静而专业。"}]},{"partOfSpeech":"n.","definition":{"en":"A device that prevents, stops, or safely redirects something dangerous (such as electricity, flames, or sparks).","zh":"（技术用语）用于阻止、抑制或安全导走危险因素的装置（如电涌、火焰或火花）。"},"examples":[{"en":"An electrical surge arrester can protect equipment from voltage spikes.","zh":"电涌避雷器（浪涌保护器）可以保护设备免受电压尖峰影响。"},{"en":"The mechanic installed a spark arrester on the exhaust.","zh":"技师在排气管上安装了防火花装置。"}]}],"synonyms":["arresting officer","captor","apprehender","suppressor","protector","surge protector"],"phonetic":"/əˈrɛstər/","extraExplanation":["在工程语境中，arrester 很常见于复合词：lightning arrester（避雷器）、surge arrester（浪涌保护器）、flame arrester（阻火器）、spark arrester（防火花装置）。这些都不是“逮捕的人”，而是“抑制/阻止危险”的设备。","在日常法律语境里，更常用 arresting officer（执行逮捕的警官）来表达；arrester 单独使用相对少见，更多见于正式文本或技术文档。"]}
{"word":"arresters","summary":{"en":"“Arresters” most often means safety devices that stop or limit hazards like lightning, sparks, or flames.","zh":"“Arresters”多指安全装置，用来阻止或减弱避雷、电涌、火花或火焰等危险。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of arrester: a person or device that stops, prevents, or controls something (often something dangerous).","zh":"arrester 的复数：指“阻止/抑制/控制某物（常为危险事物）的人或装置”。"},"examples":[{"en":"The factory installed new flame arresters on the gas lines.","zh":"工厂在燃气管线上安装了新的阻火器（flame arresters）。"},{"en":"Lightning arresters help protect buildings from electrical surges.","zh":"避雷器（lightning arresters）有助于保护建筑物免受电涌冲击。"}]}],"synonyms":["protector","suppressor","stopper","surge protector"],"phonetic":"əˈrɛstər","extraExplanation":["在工程与安全语境里，arrester 常见搭配有：lightning arrester（避雷器/浪涌保护器）、spark arrester（火花熄灭器/防火花装置）、flame arrester（阻火器）。这些装置的核心概念都是“把危险的能量/火焰/火花拦住或削弱”。","在日常英语中，如果指“执行逮捕的人”，更常说 police officer 或 arresting officer；arrester 更偏技术/装置用法。"]}
{"word":"arresting","summary":{"en":"“Arresting” most often means “striking and attention-grabbing.” It can also be the -ing form of “arrest” (to arrest a person or to stop something).","zh":"“arresting”最常见的意思是“引人注目的、吸睛的”。它也可以是动词“arrest”的-ing形式，表示“逮捕某人”或“使某事停止/遏制”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Very noticeable or striking; able to grab and hold your attention.","zh":"非常引人注目的；夺人眼球的；能抓住注意力的。"},"examples":[{"en":"She wore an arresting red coat that everyone noticed.","zh":"她穿了一件非常抢眼的红色外套，所有人都注意到了。"},{"en":"The documentary opens with an arresting image of the empty city streets.","zh":"这部纪录片以一幅令人震撼的空荡城市街景开场。"},{"en":"His arresting voice made the audience go quiet.","zh":"他极具吸引力的嗓音让观众安静了下来。"}]},{"partOfSpeech":"v.","definition":{"en":"The present participle of “arrest”; stopping or capturing someone, especially by police, or stopping something suddenly.","zh":"“arrest”的现在分词；（尤指警方）逮捕/拘捕；或使某事突然停止。"},"examples":[{"en":"Police are arresting the suspect after reviewing the video.","zh":"警方在查看视频后正在逮捕嫌疑人。"},{"en":"The medicine may be arresting the spread of the infection.","zh":"这种药可能正在遏制感染的扩散。"}]}],"synonyms":["striking","eye-catching","remarkable","dramatic","compelling"],"phonetic":"/əˈrɛstɪŋ/","extraExplanation":["“arresting”作形容词时很常见，常搭配：arresting image/beauty/contrast/detail（引人注目的画面/美感/对比/细节）。这个用法的核心是“让人停下来看”，和动词arrest“使停止”有语感上的联系，但日常多指“醒目、吸睛”，不带“逮捕”的法律含义。"]}
{"word":"arrestingly","summary":{"en":"“Arrestingly” means “in a striking, attention-grabbing way.”","zh":"“arrestingly”表示“引人注目地、惊人地（让人一下子注意到）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that strongly attracts your attention; strikingly.","zh":"引人注目地；惊人地（以一种强烈吸引注意力的方式）。"},"examples":[{"en":"The room was arrestingly beautiful, with sunlight spilling through the tall windows.","zh":"那个房间美得引人注目，阳光从高窗倾泻而入。"},{"en":"She spoke arrestingly calmly during the crisis.","zh":"危机中她冷静得令人惊讶。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that makes someone stop and notice; compellingly.","zh":"令人驻足注意地；有感染力地（让人停下来关注）。"},"examples":[{"en":"The poster presents the message arrestingly, using a simple image and bold color.","zh":"那张海报用简洁的图像和醒目的颜色把信息呈现得很吸睛。"},{"en":"He writes arrestingly about ordinary life, making small moments feel important.","zh":"他把平凡生活写得很有吸引力，让小瞬间也显得重要。"}]}],"synonyms":["strikingly","remarkably","dramatically","compellingly","powerfully"],"phonetic":"/əˈrɛstɪŋli/","extraExplanation":["“arrestingly”来自动词“arrest”的“使停下/阻止”这一层含义，而不一定指“逮捕”。在写作与评论里，它常用来形容外貌、画面、声音或表达方式“让人一下子注意到”。","常见搭配：arrestingly beautiful / arrestingly honest / arrestingly quiet / arrestingly clear。语域偏书面或评论（艺术、文学、新闻描写）中更常见。"]}
{"word":"arrestive","summary":{"en":"Arrestive means ‘attention-catching’ or ‘striking,’ especially in writing or art descriptions.","zh":"arrestive 指“能抓住注意力、很醒目”的（多用于书面语或艺术/评论语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Very noticeable and able to quickly catch your attention; striking.","zh":"非常显眼、能迅速吸引注意力的；醒目的、引人注目的。"},"examples":[{"en":"The artist used arrestive colors to pull the viewer’s eye toward the center.","zh":"艺术家用了很醒目的颜色，把观众的视线吸引到画面中心。"},{"en":"Her arrestive voice made everyone turn around.","zh":"她那引人注目的嗓音让大家都回过头来。"}]}],"synonyms":["striking","eye-catching","attention-grabbing","arresting","noticeable"],"phonetic":"/əˈrɛstɪv/","extraExplanation":["“arrestive”里的 arrest 不是“逮捕”的意思，而是“使停止、使注意力被‘拦住’”。所以 arrestive 强调“让人忍不住停下来注意”的效果。","这是较偏书面/文学或评论（如艺术评论、写作）用词；日常口语更常用 striking / eye-catching / attention-grabbing。"]}
{"word":"arrestment","summary":{"en":"A rare word meaning either the act of arresting someone, or (in Scottish law) a court order freezing property or funds.","zh":"较少用的词：可指“逮捕行为”，也可指（苏格兰法律中）法院对财产或资金作出的冻结/扣押命令。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) the act of arresting someone; an arrest.","zh":"（较少用）逮捕行为；逮捕。"},"examples":[{"en":"The suspect’s arrestment happened without violence.","zh":"嫌疑人的逮捕过程没有发生暴力。"},{"en":"News reports focused on the arrestment rather than the later trial.","zh":"新闻报道更关注逮捕本身，而不是之后的审判。"}]},{"partOfSpeech":"n.","definition":{"en":"(Law, especially in Scotland) a legal order that freezes or holds a person’s property or funds to secure a debt or claim (similar to ‘attachment’ or ‘garnishment’).","zh":"（法律，尤指苏格兰）为确保债务或请求权而对财产/资金作出的“冻结、扣押”类法律命令（类似 attachment/garnishment）。"},"examples":[{"en":"The court granted arrestment of the debtor’s bank account.","zh":"法院批准冻结债务人的银行账户。"},{"en":"Arrestment can prevent money from being moved before a judgment is enforced.","zh":"扣押/冻结令可防止在执行判决前资金被转移。"}]}],"synonyms":["arrest","detention","apprehension","attachment","garnishment"],"phonetic":"/əˈrɛstmənt/","extraExplanation":["“Arrestment”在现代美式英语里非常少见；日常更常用的是“arrest”（逮捕）或“the arrest”。","在苏格兰法律语境中，“arrestment”是一个专门术语，常见于债务追偿：通过法院命令先“冻结/扣押”资产，以便日后执行。阅读法律新闻或文件时更可能遇到这一用法。"]}
{"word":"arrestor","summary":{"en":"An arrestor is a device that stops or limits motion or danger—especially an electrical surge or lightning.","zh":"arrestor 指用于“阻止/限制”的装置，常见于防止电涌或雷击的避雷/浪涌保护设备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device that stops, slows, or catches something (so it cannot move or continue).","zh":"（使某物停止、减速或被拦住的）制动器；止动装置；拦截装置。"},"examples":[{"en":"The machine has a safety arrestor to stop the belt if something goes wrong.","zh":"这台机器有一个安全止动装置，一旦出问题就会让传送带停下来。"},{"en":"A fall arrestor can prevent serious injuries for workers at height.","zh":"防坠落止动器可以帮助高空作业者避免严重受伤。"}]},{"partOfSpeech":"n.","definition":{"en":"a protective device that prevents damage by diverting or limiting a sudden electrical surge, especially lightning.","zh":"（尤指防雷的）避雷器；浪涌保护器（通过分流/限制瞬间电涌来保护设备）。"},"examples":[{"en":"They installed a lightning arrestor on the radio tower.","zh":"他们在无线电塔上安装了避雷器。"},{"en":"A surge arrestor can protect sensitive electronics during storms.","zh":"浪涌保护器可以在暴风雨时保护敏感电子设备。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a person or thing that arrests someone; an arrester.","zh":"（较少用）逮捕者；执行逮捕的事物（同 arrester）。"},"examples":[{"en":"In older legal writing, “arrestor” sometimes appeared with the meaning “arrester.”","zh":"在较旧的法律写作中，“arrestor”有时会用来表示“逮捕者（arrester）”。"}]}],"synonyms":["arrester","surge protector","lightning arrester","stopper"],"phonetic":"/əˈrɛstɚ/","extraExplanation":["“Arrestor”和“arrester”在工程/电力语境里常指同类设备（如 lightning arrestor/arrester）。不同国家、行业标准偏好不同：美国工程文献里两种拼法都见到，但“arrester”更常见一些。"]}
{"word":"arrestors","summary":{"en":"“Arrestors” is the plural of arrestor/arrester: people or devices that stop, restrain, or (in engineering) protect against electrical surges.","zh":"“arrestors”是 arrestor/arrester 的复数：指用来逮捕/制止的人，或（工程中）用于抑制电压浪涌的保护装置（避雷器/浪涌保护器）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or things that arrest (stop, capture, or restrain someone or something). Plural of “arrestor/arrester.”","zh":"执行逮捕或起到“阻止、制止、限制”作用的人或物；“arrestor/arrester”的复数。"},"examples":[{"en":"The arrestors moved quickly to detain the suspect.","zh":"执行逮捕的人迅速行动，拘留了嫌疑人。"},{"en":"In older texts, you may see “arrestors” used for devices that stop motion.","zh":"在较旧的文章里，你可能会看到“arrestors”用来指能让运动停止的装置。"}]},{"partOfSpeech":"n.","definition":{"en":"(Engineering) Protective devices that stop or limit dangerous electrical surges (often called surge arresters).","zh":"（工程）用于抑制或“拦截”危险电压浪涌的保护装置（常称“避雷器/浪涌保护器”surge arrester）。"},"examples":[{"en":"The technician inspected the arrestors after the lightning storm.","zh":"雷暴过后，技术员检查了避雷器/浪涌保护器。"},{"en":"Good arrestors help protect sensitive equipment from voltage spikes.","zh":"好的浪涌保护器能帮助保护精密设备免受电压尖峰影响。"}]}],"synonyms":["arresters","detainers","captors","restrainers","surge arresters","lightning arresters"],"phonetic":"/əˈrɛstərz/","extraExplanation":["拼写上“arrestor”和“arrester”都能见到；在电力与防雷语境里更常用“surge arrester”。在一般英语里，“arrestor(s)”单独出现时常让人先联想到“逮捕者”，所以写技术文档时建议用更明确的词（如“surge arrester”或“lightning arrester”）。"]}
{"word":"arrests","summary":{"en":"“Arrests” can mean multiple arrests (noun) or “arrests” as a verb: police take someone into custody, or stop/slow a process.","zh":"“arrests”既可作名词表示“多次逮捕/拘留”，也可作动词表示“逮捕某人”，或引申为“阻止/抑制某事的发展”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of taking a person into custody by legal authority; the event of being detained by police.","zh":"（警方/执法机关的）逮捕；拘留（这一事件）"},"examples":[{"en":"There were two arrests after the fight.","zh":"打架后有两人被逮捕。"},{"en":"The news reported several arrests during the protest.","zh":"新闻报道说抗议活动中有多人被逮捕。"}]},{"partOfSpeech":"v.","definition":{"en":"To take someone into custody legally; to detain someone by police authority.","zh":"逮捕；拘留（某人）"},"examples":[{"en":"Police arrests the suspect early in the morning.","zh":"警方一大早逮捕了嫌疑人。"},{"en":"If you drive drunk, the officer may arrest you.","zh":"如果你酒驾，警察可能会逮捕你。"}]},{"partOfSpeech":"vt.","definition":{"en":"To stop or slow a process or movement; to halt something.","zh":"阻止；抑制；使停止（进程/发展/运动）"},"examples":[{"en":"The medicine helps arrest the spread of the infection.","zh":"这种药有助于阻止感染扩散。"},{"en":"They planted trees to arrest soil erosion.","zh":"他们种树来防止水土流失。"}]}],"synonyms":["detentions","seizures","apprehends","detains","takes into custody","halts","stops","checks"],"phonetic":"/əˈrɛsts/","extraExplanation":["“arrest(s)”在新闻里常见搭配：make an arrest（实施逮捕）、under arrest（被逮捕/被拘留）、arrest warrant（逮捕令）。","法律语境中，“be arrested”表示被警方带走并限制自由；不一定等于“被判有罪”。“charge”是“正式指控”，“convict”是“定罪”。"]}
{"word":"arret","summary":{"en":"Arret is a French loanword used in English mainly to mean a court judgment (especially in French law), and more rarely a stop or halt.","zh":"Arret 是法语借词，在英语中主要指（尤指法国法语境的）法院判决/裁定，较少也可指停止或中止。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Law, from French) a formal judgment or decision of a court, especially in France or in writing about French law.","zh":"（法律，源自法语）法院的正式判决或裁定，尤用于法国法律语境或讨论法国法院的文献中。"},"examples":[{"en":"The scholar analyzed a French court arret from the 1800s.","zh":"这位学者分析了一份19世纪的法国法院判决（arret）。"},{"en":"The treaty dispute ended with an arret by the highest court.","zh":"这场条约争端以最高法院的一项裁定（arret）告终。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) a stop or stoppage; a sudden halt.","zh":"（罕见）停止；中止；突然的停顿。"},"examples":[{"en":"He spoke, then came to an arret, searching for the right word.","zh":"他讲着讲着突然停顿（arret），在找合适的词。"}]}],"synonyms":["ruling","judgment","decree","decision","halt","stop"],"phonetic":"/æˈreɪ/","extraExplanation":["“arret”来自法语“arrêt”（常带重音符号：arrêt），本义与“停止/中止”有关。在英语里它多出现在法律或历史文献中，指法国法院的“判决/裁定”。日常英语更常用的对应词是“ruling / judgment / decree”。","不要把“arret”与英语“arrest（逮捕）”混淆：两者拼写相近，但含义不同。"]}
{"word":"arretez","summary":{"en":"“Arrêtez” is French for “Stop!” (formal/plural “you” form).","zh":"“Arrêtez”是法语“停下！”（用于“您/你们”的正式或复数形式）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(French) “Stop!” or “Stop it!”—a command telling someone to stop doing something.","zh":"（法语）“停下！”“别这样！”——命令某人停止正在做的事。"},"examples":[{"en":"Arrêtez! You’re hurting him.","zh":"停下！你在伤害他。"},{"en":"Arrêtez de parler, s’il vous plaît.","zh":"请别说话了。"},{"en":"In movies, you may hear a police officer shout, “Arrêtez!”","zh":"在电影里，你可能会听到警察喊：“停下！”"}]},{"partOfSpeech":"other","definition":{"en":"(French grammar note) “Arrêtez” is the “vous” form (formal/plural) of the verb “arrêter” (“to stop”).","zh":"（法语语法提示）“arrêtez”是动词“arrêter”（停止）的“vous”（您/你们）形式。"},"examples":[{"en":"Monsieur, arrêtez, s’il vous plaît.","zh":"先生，请停下。"},{"en":"Vous arrêtez la voiture ici.","zh":"您/你们把车停在这里。"}]}],"synonyms":["Stop!","Stop it!","Hold it!","Quit it!"],"phonetic":"/ˌɑːreɪˈteɪ/","extraExplanation":["拼写提示：你输入的“arretez”通常写作“arrêtez”（带抑扬符号ê）。在不方便输入重音符号时，人们常用“arretez”代替。","语气与礼貌：在法语里，“Arrêtez !”比较直接、甚至可能显得强硬。更礼貌一点可以说“Arrêtez, s’il vous plaît.”（请停下）或“Pouvez-vous arrêter ?”（您能停一下吗？）。"]}
{"word":"Arretine","summary":{"en":"Arretine means “from Arezzo (ancient Arretium)” and commonly refers to a well-known type of fine Roman red pottery (Arretine ware).","zh":"Arretine 指“来自意大利阿雷佐（古 Arretium）的”，常用来指一种著名的古罗马精致红色陶器（阿雷丁陶）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Arezzo (ancient Arretium) in Italy, especially to a famous type of fine Roman red pottery (often called Arretine ware).","zh":"与意大利阿雷佐（古称 Arretium）有关的；尤指一种著名的古罗马精致红色陶器（常称 Arretine ware / 阿雷丁陶）。"},"examples":[{"en":"The museum displays Arretine bowls with glossy red surfaces.","zh":"博物馆展出了表面光亮的阿雷丁红陶碗。"},{"en":"Arretine pottery influenced later Roman tableware across the empire.","zh":"阿雷丁陶器影响了帝国各地后来罗马人的餐具风格。"}]},{"partOfSpeech":"n.","definition":{"en":"Arretine ware; a kind of fine Roman pottery made in or associated with Arezzo, often red and sometimes molded with decoration.","zh":"阿雷丁陶（Arretine ware）；与阿雷佐有关的一种古罗马精致陶器，常为红色，有时用模具压制出装饰纹样。"},"examples":[{"en":"Arretine was traded widely and is often found at Roman archaeological sites.","zh":"阿雷丁陶曾广泛贸易，因此常在罗马考古遗址中出土。"},{"en":"Researchers dated the Arretine to the early Roman Imperial period.","zh":"研究人员将这件阿雷丁陶器断代为罗马帝国早期。"}]}],"synonyms":["Arretine ware","terra sigillata (related term)"],"phonetic":"/ˈærɪtaɪn/","extraExplanation":["“Arretine”源自拉丁语 Arretium（今意大利城市 Arezzo/阿雷佐）。在英文艺术史与考古语境里，它最常指“Arretine ware（阿雷丁陶）”，属于罗马时期的高品质红色陶器，常见于公元前1世纪至公元1世纪早期的遗物描述中。","在现代英语里，这个词比较书面、专业，多出现在博物馆说明、考古报告或艺术史文章中；日常对话中更常说 “Roman red pottery” 或直接说 “Arretine ware”。"]}
{"word":"arretine","summary":{"en":"Arretine means “from Arezzo/Arretium,” especially referring to fine ancient Roman red pottery (Arretine ware).","zh":"Arretine 指“来自阿雷佐/古阿雷蒂乌姆的”，尤指著名的古罗马精致红陶（阿雷廷陶）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Arretium (modern Arezzo, Italy), especially to a famous type of ancient Roman red pottery made there","zh":"（与）阿雷蒂乌姆（今意大利阿雷佐）有关的；尤指当地出产、著名的古罗马红色陶器（阿雷廷陶）"},"examples":[{"en":"The museum displays Arretine bowls with a glossy red surface.","zh":"博物馆展出了表面光亮的阿雷廷红陶碗。"},{"en":"Arretine pottery was widely exported across the Roman world.","zh":"阿雷廷陶器曾被大量出口到整个罗马世界。"}]},{"partOfSpeech":"n.","definition":{"en":"Arretine ware; a fine red Roman pottery, often decorated with relief designs","zh":"阿雷廷陶（器）；一种精致的古罗马红陶，常带浮雕装饰"},"examples":[{"en":"Fragments of Arretine were found at the archaeological site.","zh":"考古遗址发现了阿雷廷陶器的碎片。"},{"en":"Collectors prize Arretine for its craftsmanship and historical value.","zh":"收藏家看重阿雷廷陶器的工艺与历史价值。"}]}],"synonyms":["Aretine","terra sigillata (related term)"],"phonetic":"/ˈærəˌtaɪn/","extraExplanation":["“Arretine (ware)”在艺术史/考古语境里很常见，常与拉丁语术语“terra sigillata（印纹红陶）”相关：它属于早期高品质红陶的代表，流行于公元前1世纪至公元1世纪早期，并影响了后来罗马各地的陶器生产。","拼写上也常见变体“Aretine”。在阅读学术或博物馆说明牌时，两者通常指同一类器物或其产地传统。"]}
{"word":"Arretium","summary":{"en":"Arretium is the Latin name of modern Arezzo in Tuscany, Italy, and it can also refer to Roman red pottery associated with that city.","zh":"Arretium 是意大利托斯卡纳阿雷佐（Arezzo）的拉丁名称，也可指与该城相关的罗马红色精致陶器（阿雷佐陶器）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Latin name) The ancient city now called Arezzo, in Tuscany, Italy.","zh":"（拉丁地名）意大利托斯卡纳地区的古城，即今阿雷佐（Arezzo）。"},"examples":[{"en":"Arretium was an important town in Roman Italy.","zh":"Arretium 是罗马时期意大利的一座重要城镇。"},{"en":"The manuscript mentions Arretium as a stop on the road north.","zh":"手稿提到 Arretium 是向北道路上的一处停靠点。"}]},{"partOfSpeech":"n.","definition":{"en":"In archaeology/art history, fine Roman red pottery made in or associated with Arretium (also called Arretine ware).","zh":"（考古/艺术史）与 Arretium 有关、在当地生产或以其闻名的罗马红色精致陶器（亦称 Arretine ware）。"},"examples":[{"en":"The museum displayed bowls of Arretium from the first century BCE.","zh":"博物馆展出了公元前一世纪的 Arretium（阿雷佐陶器）碗。"},{"en":"Arretium pottery is known for its glossy red surface.","zh":"Arretium 陶器以光亮的红色表面著称。"}]}],"synonyms":["Arezzo","Arretine ware","terra sigillata"],"phonetic":"/əˈriːtiəm/","extraExplanation":["Arretium 是拉丁语写法，英语学术语境中多见于古代史、拉丁文文献、考古与艺术史。现代地名对应意大利的 Arezzo。","“Arretine ware（阿雷佐陶器）”常与更广义的 “terra sigillata（印纹红陶）”一起出现；前者可视为这种红陶传统中早期、与阿雷佐产地联系紧密的一支。"]}
{"word":"Arrey","summary":{"en":"“Arrey” is an informal South Asian interjection meaning “hey/oh/come on,” used to get attention or show surprise or mild annoyance.","zh":"“Arrey”是南亚语境常用的非正式感叹词，约等于“嘿/哎呀/拜托”，用于引起注意或表达惊讶、轻微不满。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(South Asian English, informal) An interjection used to call someone’s attention or to show surprise, protest, or mild annoyance; similar to “hey!” “oh!” or “come on!” depending on tone.","zh":"（南亚英语/印地语等语境，非正式）感叹词，用来引起注意或表达惊讶、抗议、轻微不满；语气不同可近似“嘿！”“哎呀！”“拜托！”"},"examples":[{"en":"Arrey, listen to me for a second!","zh":"Arrey，先听我说一下！"},{"en":"Arrey! You scared me.","zh":"Arrey！你吓到我了。"},{"en":"Arrey, don’t do that—it’s dangerous.","zh":"Arrey，别那样做——很危险。"}]}],"synonyms":["hey","oh","come on","listen"],"phonetic":"/əˈreɪ/","extraExplanation":["“Arrey/Arey/Arre”常见于印度、巴基斯坦、孟加拉等地的日常口语，也常出现在宝莱坞电影台词或以南亚文化为背景的英文对话中。它并不是标准书面英语，正式写作或正式场合一般避免使用。","语气非常重要：拉长或提高音调可表示惊讶（“哎呀！”），较重的语气可表示不满（“喂/拜托”），轻快的语气也可用于亲近的人之间打招呼（类似“嘿”）。"]}
{"word":"arrgt","summary":{"en":"“Alright” means “OK / fine,” and it’s often used informally to agree or reassure someone.","zh":"“alright”表示“好/可以/没问题”，常用于非正式场合表示同意或安慰。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) OK; acceptable; satisfactory.","zh":"（非正式）好；可以；令人满意。"},"examples":[{"en":"Is it alright if I open the window?","zh":"我开一下窗可以吗？"},{"en":"Don’t worry—everything will be alright.","zh":"别担心——一切都会好起来的。"}]},{"partOfSpeech":"adv.","definition":{"en":"(informal) in a satisfactory way; well enough.","zh":"（非正式）顺利地；还不错地；够好地。"},"examples":[{"en":"The meeting went alright, but it was a bit long.","zh":"会议进行得还行，不过有点长。"},{"en":"I’m doing alright these days.","zh":"我最近过得还不错。"}]},{"partOfSpeech":"int.","definition":{"en":"(informal) used to show agreement or to start/continue a conversation.","zh":"（非正式）用于表示同意，或用于开始/继续对话（如“好吧”“行”）。"},"examples":[{"en":"Alright, let’s get started.","zh":"好吧，我们开始吧。"},{"en":"Alright—I’ll call you later.","zh":"行——我晚点打给你。"}]}],"synonyms":["OK","fine","acceptable","good enough","sure"],"phonetic":"ɔl ˈraɪt","extraExplanation":["“arrgt”不是标准英语拼写，常见于打字失误或随意的网络写法；你很可能想写的是“alright”或“all right”。","在正式写作中更推荐用“all right”（两词），而“alright”更偏口语、短信、社交媒体。"]}
{"word":"arrha","summary":{"en":"Arrha means a small deposit or pledge (earnest money) paid to confirm an agreement.","zh":"Arrha 指为确认协议而付的订金/保证金（表示诚意的定金）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, formal) A pledge or deposit given to confirm an agreement, especially in a sale or contract; earnest money.","zh":"（罕见、正式）为确认交易或合同而支付的定金/押金；订金（表示诚意的款项）。"},"examples":[{"en":"The buyer paid an arrha to show good faith and secure the deal.","zh":"买方支付了一笔订金以表示诚意并确保成交。"},{"en":"In some older legal texts, the arrha served as proof that a contract had been accepted.","zh":"在一些较旧的法律文本中，订金被用作合同已被接受的证明。"}]}],"synonyms":["earnest money","deposit","down payment","pledge"],"phonetic":"/ˈɑrə/","extraExplanation":["“arrha”在现代英语中非常少见，多见于历史性/学术性/法律史语境。日常英语更常用 earnest money, deposit, down payment。","词源上来自拉丁语 arrha，进一步与希腊语中表示“保证金/担保”的词有关；在罗马法或古代商贸语境里，它常指用来“锁定交易”的象征性款项。"]}
{"word":"arrhal","summary":{"en":"arrhal is a rare medical adjective meaning “related to catarrh,” usually appearing in catarrhal.","zh":"arrhal 是罕见的医学形容词，表示“与卡他/黏膜炎有关”，多见于 catarrhal 中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare; medical) Relating to catarrh (inflammation of a mucous membrane with excess mucus). Usually seen as the ending in words like catarrhal.","zh":"（罕见；医学）与“卡他/黏膜炎”（黏膜发炎并分泌大量黏液）有关的。通常作为词尾出现在如 catarrhal 等词中。"},"examples":[{"en":"In medical writing, you may see catarrhal, meaning “producing a lot of mucus.”","zh":"在医学写作中，你可能会看到 catarrhal，意思是“分泌大量黏液的/黏液性的”。"},{"en":"The word arrhal is not commonly used by itself; it’s usually part of a longer medical term.","zh":"arrhal 很少单独使用；它通常是较长医学术语的一部分。"}]}],"synonyms":["catarrhal"],"phonetic":"/ˈærəl/","extraExplanation":["arrhal 基本上可以理解为“与黏液性炎症（catarrh）有关”的词素，但现代英语里几乎不会把它当作独立单词使用；更常见的是 catarrhal（形容词）以及 catarrh（名词）。如果你是在文章里看到 arrhal，很可能是截断、拼写不完整，或来自专业术语的分词/词尾。"]}
{"word":"arrhenal","summary":{"en":"Arsenal means a weapons storehouse, or (figuratively) a large supply of useful tools or strategies.","zh":"Arsenal 指“军火库”，也可比喻“工具/方法/策略的储备”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Correct spelling: arsenal) a place where weapons and military equipment are stored or made.","zh":"（正确拼写：arsenal）军火库；存放或制造武器与军用装备的地方。"},"examples":[{"en":"The city protected its arsenal during the war.","zh":"战争期间，这座城市严密保护它的军火库。"},{"en":"They built an arsenal near the port to supply the navy.","zh":"他们在港口附近建了一座军火库，为海军提供补给。"}]},{"partOfSpeech":"n.","definition":{"en":"a large supply of useful things (skills, tools, methods) that can be used to achieve a goal.","zh":"（比喻）储备；大量可用来达成目标的技能、工具或方法。"},"examples":[{"en":"She has an arsenal of strategies for dealing with stress.","zh":"她有一整套应对压力的策略。"},{"en":"Good communication is part of a leader’s arsenal.","zh":"良好的沟通能力是领导者的重要“武器库”。"}]}],"synonyms":["armory","storehouse","stockpile","cache","collection"],"phonetic":"/ˈɑrsənl/","extraExplanation":["你输入的“arrhenal”很可能是拼写错误。常见且正确的词是 **arsenal**。","**Arsenal** 也常见于体育文化：英国足球俱乐部 **Arsenal F.C.**（阿森纳）非常有名，因此中文里常直接音译为“阿森纳”。"]}
{"word":"Arrhenatherum","summary":{"en":"Arrhenatherum is the scientific genus name for certain oat-like grasses, especially tall oatgrass.","zh":"Arrhenatherum 是某些类似燕麦的禾草的科学属名，尤其与“高燕麦草”相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of grasses in the oat family (Poaceae), best known for the species tall oatgrass.","zh":"一种禾本科（Poaceae）植物的属名（燕麦族相关的草类），最常见的代表是“高燕麦草”（tall oatgrass）。"},"examples":[{"en":"Arrhenatherum is often mentioned in field guides to European grasses.","zh":"Arrhenatherum 常见于欧洲禾草类的野外识别手册中。"},{"en":"Tall oatgrass (Arrhenatherum elatius) can spread quickly along roadsides.","zh":"高燕麦草（Arrhenatherum elatius）可能沿路边快速扩散。"}]}],"synonyms":["(scientific) tall oatgrass (Arrhenatherum elatius)"],"phonetic":"ˌærənəˈθɪrəm","extraExplanation":["这是一个拉丁化的科学属名，常用于植物学、生态学与牧草/杂草管理的语境；日常英语中更常说具体种名（如 tall oatgrass）。","科学写作里属名通常首字母大写并斜体（Arrhenatherum），而种加词小写（Arrhenatherum elatius）。"]}
{"word":"arrhenatherum","summary":{"en":"Arrhenatherum is a genus of grasses, best known for tall oatgrass.","zh":"Arrhenatherum 指禾本科植物的一个属（燕麦草属），以高燕麦草最著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of grasses (plants in the grass family), especially known for the species tall oatgrass.","zh":"一种禾本科草本植物的属名（燕麦草属），其中最有名的是“高燕麦草”。"},"examples":[{"en":"Arrhenatherum includes species that are common in meadows and pastures.","zh":"燕麦草属包含一些在草地和牧场很常见的物种。"},{"en":"Tall oatgrass (Arrhenatherum elatius) can be used for hay in some regions.","zh":"在一些地区，高燕麦草（Arrhenatherum elatius）可用来做干草。"}]}],"synonyms":["(common name for a well-known species) tall oatgrass"],"phonetic":"/əˌrɛnəˈθɪrəm/","extraExplanation":["这是一个拉丁化的植物学属名，常见于植物志、生态调查报告或园艺/牧草资料中；日常英语里更常用具体物种名（如 tall oatgrass）而不是属名。","词源上可追溯到希腊语成分：arrhen-（“雄性的”）与 ather（“芒刺/穗芒”）相关，用来描述禾草花序结构的特征。"]}
{"word":"Arrhenius","summary":{"en":"Arrhenius refers to the Swedish scientist Svante Arrhenius or to chemistry concepts named after him (e.g., the Arrhenius equation; Arrhenius acids/bases).","zh":"Arrhenius 指瑞典科学家斯万特·阿伦尼乌斯，或指以他命名的化学概念（如阿伦尼乌斯方程、阿伦尼乌斯酸/碱）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Svante Arrhenius (1859–1927), a Swedish scientist who helped develop physical chemistry; he is known for the theory of electrolytic dissociation and for early work on the greenhouse effect.","zh":"斯万特·阿伦尼乌斯（1859–1927），瑞典科学家，奠定了物理化学的重要基础；以电解质离解理论及早期温室效应研究而闻名。"},"examples":[{"en":"Arrhenius won the Nobel Prize in Chemistry in 1903.","zh":"阿伦尼乌斯于1903年获得诺贝尔化学奖。"},{"en":"In class we discussed Arrhenius and the idea that salts split into ions in water.","zh":"课上我们讨论了阿伦尼乌斯，以及盐在水中会分裂成离子的观点。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to Arrhenius’s ideas in chemistry, especially the Arrhenius equation or the Arrhenius definitions of acids and bases.","zh":"（化学）与阿伦尼乌斯的理论相关，尤指“阿伦尼乌斯方程”或“阿伦尼乌斯酸碱定义”。"},"examples":[{"en":"The Arrhenius equation shows how reaction rate changes with temperature.","zh":"阿伦尼乌斯方程说明反应速率如何随温度变化。"},{"en":"By the Arrhenius definition, an acid increases H+ in water.","zh":"按阿伦尼乌斯定义，酸会在水中增加H+（氢离子）。"},{"en":"Sodium hydroxide is an Arrhenius base because it produces OH− in solution.","zh":"氢氧化钠是阿伦尼乌斯碱，因为它在溶液中产生OH−（氢氧根离子）。"}]}],"synonyms":["Svante Arrhenius","Arrhenius equation","Arrhenius acid","Arrhenius base"],"phonetic":"/əˈriːniəs/","extraExplanation":["“Arrhenius”在英语里最常见的用法是作为专有名词（人名）或形容词（修饰化学概念）。写作时通常大写：Arrhenius equation（阿伦尼乌斯方程）、Arrhenius acid/base（阿伦尼乌斯酸/碱）。","发音提示：重音在第二音节（-REE-）。很多学习者会把开头读得太重，实际上更像弱读的“uh-”。"]}
{"word":"arrhenoid","summary":{"en":"Arrhenoid refers to Arrhenius-type acids and bases—species that produce H+ or OH− in water.","zh":"arrhenoid 指“阿瑞尼乌斯型”的酸和碱——在水中分别产生 H+ 或 OH− 的物质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(chemistry) Relating to Svante Arrhenius’s acid–base theory, especially acids that produce H+ in water and bases that produce OH− in water.","zh":"（化学）与阿瑞尼乌斯（Arrhenius）的酸碱理论有关，尤指在水溶液中产生 H+ 的酸与产生 OH− 的碱。"},"examples":[{"en":"Hydrochloric acid is an Arrhenoid acid because it releases H+ in water.","zh":"盐酸是阿瑞尼乌斯酸（arrhenoid acid），因为它在水中释放 H+。"},{"en":"Sodium hydroxide is an Arrhenoid base in aqueous solution.","zh":"氢氧化钠在水溶液中是阿瑞尼乌斯碱（arrhenoid base）。"}]},{"partOfSpeech":"n.","definition":{"en":"An acid or base defined by Arrhenius’s theory (less common usage).","zh":"按阿瑞尼乌斯理论定义的酸或碱（较少见用法）。"},"examples":[{"en":"In early textbooks, some writers grouped strong electrolytes as Arrhenoids.","zh":"在早期教材里，有些作者把强电解质归为“arrhenoids”。"}]}],"synonyms":["Arrhenius (acid/base)","Arrhenian (rare)"],"phonetic":"/əˈriːniˌɔɪd/","extraExplanation":["“arrhenoid”多见于较旧或较专业的化学写作中；现代教材更常用“Arrhenius acid/base（阿瑞尼乌斯酸/碱）”来表达同一概念。","阿瑞尼乌斯理论的重点是“必须在水溶液中”产生 H+ 或 OH−，因此它对非水体系或某些酸碱反应解释力有限；后来发展出 Brønsted–Lowry 与 Lewis 的定义来补充。"]}
{"word":"arrhenotokous","summary":{"en":"Arrhenotokous describes a reproductive pattern where males are produced from unfertilized eggs.","zh":"Arrhenotokous 指一种繁殖方式：雄性由未受精卵产生。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(In some insects and other animals) producing male offspring from unfertilized eggs; related to a form of reproduction called arrhenotoky.","zh":"（某些昆虫及其他动物中）由未受精卵产生雄性后代的；与“雄单性生殖（arrhenotoky）”相关。"},"examples":[{"en":"Many bees are arrhenotokous: males can develop from unfertilized eggs.","zh":"许多蜜蜂具有雄单性生殖特征：雄蜂可以由未受精卵发育而来。"},{"en":"The species is arrhenotokous, so females control whether an egg is fertilized.","zh":"该物种具有雄单性生殖特征，因此雌性可以控制卵是否受精。"}]}],"synonyms":["arrhenotoky-related","male-producing (from unfertilized eggs)"],"phonetic":"/əˌriːnoʊˈtoʊkəs/","extraExplanation":["这个词常见于昆虫学与进化生物学文献，尤其描述“单倍体—二倍体（haplodiploidy）”系统：未受精卵发育为单倍体雄性，受精卵发育为二倍体雌性（如蜜蜂、黄蜂、蚂蚁等膜翅目）。","词根来自希腊语：arrhen- 表示“雄性/男性”，-tokous 与“分娩/生育（toxic? → tokos）”相关，整体字面意思接近“生出雄性的”。"]}
{"word":"arrhenotoky","summary":{"en":"Arrhenotoky is a reproductive system where unfertilized eggs develop into male offspring, common in bees, ants, and wasps.","zh":"Arrhenotoky（雄产孤雌生殖）指未受精的卵发育成雄性后代，常见于蜜蜂、蚂蚁和黄蜂等昆虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of parthenogenesis (asexual reproduction) in which unfertilized eggs develop into male offspring","zh":"雄产孤雌生殖；一种孤雌生殖方式：未受精的卵发育成雄性后代"},"examples":[{"en":"In many wasps and bees, arrhenotoky allows females to produce males from unfertilized eggs.","zh":"在许多黄蜂和蜜蜂中，雄产孤雌生殖使雌性能够用未受精的卵产下雄性。"},{"en":"Researchers studied arrhenotoky to understand how sex is determined in haplodiploid insects.","zh":"研究人员通过研究雄产孤雌生殖来理解单倍—二倍体昆虫的性别决定机制。"}]}],"synonyms":["male-producing parthenogenesis","arrhenotocus parthenogenesis"],"phonetic":"/əˌriːnəˈtoʊki/","extraExplanation":["词源：arrheno- 来自希腊语，意为“男性”；-toky 表示“生产/分娩”。合起来就是“产雄”。","常见于膜翅目昆虫（如蜜蜂、蚂蚁、黄蜂）的单倍—二倍体系统：未受精卵通常为单倍体，发育成雄性；受精卵为二倍体，发育成雌性。","相关术语：thelytoky（未受精卵发育成雌性）、deuterotoky/amphitoky（未受精卵可发育成雌或雄，因物种而异）。"]}
{"word":"Arrhephoria","summary":{"en":"Arrhephoria: an ancient Athenian festival/rite for Athena involving a secret night procession by two young girls carrying sacred objects.","zh":"Arrhephoria：古雅典与雅典娜相关的节仪；两名少女在夜间秘密行进，搬运神圣物品完成仪式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient Athenian religious festival and rite connected with Athena, in which two young girls (Arrhephoroi) carried sacred objects in a secret nighttime procession.","zh":"古雅典与雅典娜（Athena）相关的宗教节仪；其中两名少女（Arrhephoroi，意为“携秘物者”）在夜间秘密行进，搬运神圣物品并完成仪式。"},"examples":[{"en":"The Arrhephoria was one of the lesser-known but important rites in the Athenian religious calendar.","zh":"Arrhephoria 是雅典宗教历中较少为人熟知但很重要的仪式之一。"},{"en":"In discussions of women and girls in Greek religion, the Arrhephoria is often mentioned alongside other initiation-like rituals.","zh":"在讨论希腊宗教中的女性与少女时，Arrhephoria 常与其他类似“成年礼”的仪式一起被提及。"}]}],"synonyms":["Athenian festival","Greek religious rite","Athena cult rite"],"phonetic":"/ˌærɪˈfɔːriə/","extraExplanation":["Arrhephoria 通常被认为与雅典娜崇拜、城市守护与织布（如为雅典娜准备祭衣 peplos 的传统）等主题相关，但仪式细节在古代文本中也带有“保密”色彩，因此现代学界对所携带“秘物”的具体内容仍有争议。","名称常与 Arrhephoroi（执行仪式的两名少女）一起出现；在阅读古典学或古希腊宗教研究时，你也可能看到拼写变体，如 Arrephoria。"]}
{"word":"arrhinia","summary":{"en":"Arrhinia is a rare condition of being born without a nose.","zh":"Arrhinia 指一种罕见的先天性“无鼻症”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare congenital condition in which a person is born without a nose (or with an extremely underdeveloped nose).","zh":"（医学）先天性无鼻症：一种罕见的先天性疾病，患者出生时没有鼻子（或鼻部极度发育不全）。"},"examples":[{"en":"The newborn was diagnosed with arrhinia after imaging confirmed the absence of nasal structures.","zh":"通过影像检查确认缺乏鼻部结构后，新生儿被诊断为先天性无鼻症（arrhinia）。"},{"en":"Arrhinia can affect breathing and the sense of smell, so early medical support is important.","zh":"无鼻症可能影响呼吸和嗅觉，因此及早的医疗支持很重要。"}]}],"synonyms":["congenital absence of the nose","nasal agenesis"],"phonetic":"/əˈrɪniə/","extraExplanation":["词源提示：a-（否定、无）+ rhino-（鼻）+ -ia（状态/疾病）。因此字面意思就是“无鼻的状态”。","这是非常罕见的医学术语，通常出现在医学论文、病例报告或遗传/先天畸形相关语境中。日常英语里几乎不会用。"]}
{"word":"arrhizal","summary":{"en":"Arrhizal means “without roots,” used mainly in botany.","zh":"arrhizal 指“无根的”，主要用于植物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having no roots; rootless.","zh":"（植物）无根的；没有根的。"},"examples":[{"en":"Some aquatic plants are arrhizal and absorb nutrients directly through their stems and leaves.","zh":"一些水生植物是无根的，它们直接通过茎和叶吸收养分。"},{"en":"In the lab, the arrhizal seedlings needed a different way to take up water.","zh":"在实验室里，这些无根幼苗需要用不同方式来吸收水分。"}]}],"synonyms":["rootless","without roots"],"phonetic":"/æˈraɪzəl/","extraExplanation":["词源上，arrhizal 来自 a-（表示“无、缺少”）+ rhiz-（来自希腊语 rhiza“根”），字面意思就是“没有根的”。这个词多见于植物学/生态学语境（如水生植物、漂浮植物或特定阶段的幼体结构）。"]}
{"word":"arrhizous","summary":{"en":"Arrhizous means “rootless; lacking roots,” mainly in botanical contexts.","zh":"arrhizous 指“无根的；没有根的”，主要用于植物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Lacking roots; rootless (used for some plants, algae, or organisms that do not form true roots).","zh":"（植物学）无根的；没有根的（用于某些不形成真正根的植物、藻类或生物）。"},"examples":[{"en":"Some algae are arrhizous and absorb nutrients directly from the water.","zh":"一些藻类是无根的，直接从水中吸收养分。"},{"en":"The guide described the plant’s arrhizous growth as an adaptation to wet habitats.","zh":"导览员把这种植物的无根生长描述为对潮湿环境的适应。"}]}],"synonyms":["rootless","without roots","radicleless"],"phonetic":"æˈraɪzəs","extraExplanation":["词源上可拆为 a-（“无、非”）+ rhiz-（与“root/根”同源，来自希腊语 rhiza “根”），因此字面意思就是“没有根”。","这是偏学术/专业的描述性形容词，多见于植物学、藻类学或形态学写作；日常英语更常用 rootless / without roots 来表达。"]}
{"word":"arrhythmia","summary":{"en":"Arrhythmia means an irregular heartbeat.","zh":"Arrhythmia 指“心律不齐/心律失常”，即心跳节律不规则。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an irregular heartbeat (the heart beats too fast, too slow, or with an uneven rhythm)","zh":"心律不齐；心律失常（心跳过快、过慢或节律不规则）"},"examples":[{"en":"The doctor diagnosed him with an arrhythmia after an ECG test.","zh":"心电图检查后，医生诊断他有心律失常。"},{"en":"Some arrhythmias are harmless, but others need treatment.","zh":"有些心律不齐并不严重，但有些需要治疗。"},{"en":"She felt dizziness and a fluttering feeling in her chest because of an arrhythmia.","zh":"由于心律失常，她感到头晕，胸口有“扑动”的感觉。"}]}],"synonyms":["irregular heartbeat","irregular heart rhythm","cardiac arrhythmia"],"phonetic":"/əˈrɪðmiə/","extraExplanation":["发音小提示：arrhythmia 里有一个“静音”的 h，不读成 /h/；重音通常在倒数第二个音节。","医学语境中常见相关词：ECG/EKG（心电图）、palpitations（心悸/心跳漏拍或乱跳的感觉）、atrial fibrillation/AFib（房颤，一种常见心律失常）。如果出现胸痛、晕厥、呼吸困难等症状，应及时就医。"]}
{"word":"arrhythmias","summary":{"en":"“Arrhythmias” means irregular heartbeats (plural).","zh":"“arrhythmias” 指“心律不整/心律失常”（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Irregular heartbeats (the plural of arrhythmia): the heart beats too fast, too slow, or unevenly.","zh":"心律不整／心律失常（arrhythmia 的复数）：心跳过快、过慢或不规则。"},"examples":[{"en":"The doctor said my palpitations were caused by arrhythmias.","zh":"医生说我的心悸是由心律失常引起的。"},{"en":"Some arrhythmias are harmless, but others need treatment.","zh":"有些心律失常无害，但有些需要治疗。"},{"en":"Caffeine and stress can sometimes trigger arrhythmias in sensitive people.","zh":"对敏感的人来说，咖啡因和压力有时会诱发心律失常。"}]}],"synonyms":["irregular heartbeats","abnormal heart rhythms","dysrhythmias"],"phonetic":"/əˈrɪðmiəz/","extraExplanation":["在医学语境里，arrhythmia（心律失常）是总称，常见类型包括 atrial fibrillation（房颤）、tachycardia（心动过速）、bradycardia（心动过缓）等。是否危险取决于类型、持续时间与是否影响供血。若出现胸痛、昏厥、严重气促等症状，应及时就医。","词源：a-（不、无）+ rhythm（节律）+ -ia（疾病/状态），直译为“无节律（的状态）”。"]}
{"word":"arrhythmic","summary":{"en":"Arrhythmic means “without a regular rhythm,” and in medical contexts it can describe an abnormal heartbeat rhythm.","zh":"arrhythmic 意为“没有规律节奏的”；在医学语境中也可指“与心律失常相关的/心跳不齐的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not having a regular rhythm; lacking a steady beat or pattern (often used about music, speech, movement, or biological rhythms such as the heartbeat).","zh":"没有规律节奏的；不规则的（常用于音乐、说话、动作或生物节律，如心跳）。"},"examples":[{"en":"The drummer played an arrhythmic pattern that made the song feel unpredictable.","zh":"鼓手演奏了不规则的节奏型，让这首歌听起来难以预测。"},{"en":"His speech became arrhythmic, with long pauses and sudden bursts of words.","zh":"他说话变得节奏紊乱，时而长时间停顿，时而突然一口气说很多。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to an abnormal heart rhythm; involving or causing an arrhythmia (medical use).","zh":"（医学）与心律失常有关的；涉及或导致心律失常的。"},"examples":[{"en":"The doctor noted arrhythmic beats on the monitor and ordered more tests.","zh":"医生在监护仪上发现心跳不齐，于是安排了进一步检查。"},{"en":"Some medications can have arrhythmic effects in sensitive patients.","zh":"某些药物在敏感患者身上可能产生诱发心律失常的影响。"}]}],"synonyms":["irregular","rhythmless","nonrhythmic","unsteady"],"phonetic":"/əˈrɪðmɪk/","extraExplanation":["词源提示：arrhythmic = a-（“无/不”）+ rhythmic（“有节奏的”）。在医学里常与 arrhythmia（心律失常）一起出现；在音乐/文学评论中则更多表示“故意打破节奏、制造不稳定感”的效果。"]}
{"word":"arrhythmical","summary":{"en":"Arrhythmical means “not having a regular rhythm,” and less commonly it can describe an irregular heartbeat.","zh":"arrhythmical 指“节奏不规律的”，较少见时也可指“心跳节律不规则的/与心律不齐有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not having a regular rhythm; lacking a steady beat or pattern (in music, speech, poetry, movement, etc.).","zh":"没有规律节奏的；节拍/韵律不整齐的（用于音乐、语言、诗歌、动作等）。"},"examples":[{"en":"The song has an arrhythmical drum pattern that keeps surprising the listener.","zh":"这首歌的鼓点节奏不规则，让听众不断感到意外。"},{"en":"His arrhythmical pauses made the speech feel uneasy.","zh":"他不规律的停顿让演讲听起来有些不安。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Relating to an irregular heartbeat; not rhythmic in heart activity.","zh":"（较少见）与心律不齐有关的；心跳节律不规则的。"},"examples":[{"en":"The monitor showed an arrhythmical pattern, so the nurse called the doctor.","zh":"监护仪显示心律不规则，于是护士叫来了医生。"}]}],"synonyms":["irregular","rhythm-less","offbeat","unrhythmic","arrhythmic"],"phonetic":"/ˌeɪˈrɪðmɪkəl/","extraExplanation":["“arrhythmical”由前缀 a-（表示“非、不”）+ rhythm（节奏）构成，意思就是“没有节奏/不规则的节奏”。在医学语境里，更常见的词是 “arrhythmic” 或名词 “arrhythmia（心律失常/心律不齐）”；在音乐与文学评论中，“arrhythmical”也会出现，用来强调节奏的“不整齐感”。"]}
{"word":"arrhythmically","summary":{"en":"Arrhythmically means “in an irregular rhythm,” and it can also describe an abnormal heart rhythm in medical contexts.","zh":"arrhythmically 指“以不规则的节奏”，在医学语境中也可指“呈现心律失常的节律”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an irregular rhythm; without a steady beat or predictable timing.","zh":"以不规则的节奏；没有稳定拍子或可预测的时间规律。"},"examples":[{"en":"The drummer played arrhythmically, making the song feel unsettled.","zh":"鼓手以不规则的节奏演奏，让这首歌听起来有些不安定。"},{"en":"The dancers moved arrhythmically, intentionally breaking the usual pattern.","zh":"舞者以不规则的节奏移动，刻意打破常见的套路。"},{"en":"The words came arrhythmically, with long pauses between sentences.","zh":"他说话断断续续、节奏不均，句子之间隔着很长的停顿。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Medicine) In a way that shows an abnormal heart rhythm (an arrhythmia).","zh":"（医学）以心律失常的方式；呈现不正常的心跳节律。"},"examples":[{"en":"After the procedure, his heart was no longer beating arrhythmically.","zh":"手术后，他的心脏不再以心律失常的方式跳动。"},{"en":"The monitor showed that her heart was beating arrhythmically for several minutes.","zh":"监护仪显示她的心跳有几分钟出现了心律不齐。"}]}],"synonyms":["irregularly","out of rhythm","unevenly","without a steady beat"],"phonetic":"/əˈrɪðmɪkli/","extraExplanation":["词源提示：arrhythmically 来自 a-（“无/不”）+ rhythmic（“有节奏的”）。既可用于音乐/语言（节奏不规律），也可用于医学语境描述心律失常。","用法提示：在日常英语里更常见的是 irregularly（不规律地）或 “out of rhythm”。arrhythmically 更正式，常见于评论音乐风格或医学报告。"]}
{"word":"arrhythmous","summary":{"en":"Arrhythmous (rare) means having an irregular rhythm, especially an abnormal heart rhythm.","zh":"arrhythmous（少见）指节奏不规则，尤指心律异常。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Having an irregular rhythm; lacking a steady beat—especially describing an abnormal heart rhythm.","zh":"（少见）无节律的；节奏不规则的——尤指（心脏）心律异常的。"},"examples":[{"en":"The doctor noted an arrhythmous heartbeat and ordered an ECG.","zh":"医生注意到心跳无节律，于是安排做心电图。"},{"en":"The music sounded arrhythmous, as if the beat kept slipping.","zh":"这段音乐听起来节奏不规则，好像拍子一直在滑走。"}]}],"synonyms":["arrhythmic","irregular","rhythm-less","uneven"],"phonetic":"/əˈrɪðməs/","extraExplanation":["“arrhythmous”在现代英语中较少见；更常用、也更标准的形容词是 **arrhythmic**（描述节奏/心律不齐）或 **arrhythmic heartbeat**。名词常用 **arrhythmia**（心律失常）。","词源上来自 a-（无/不）+ rhythm（节奏），表示“缺乏规则节奏”。在医学语境里一般建议用更常见的搭配（如 *arrhythmic* / *arrhythmia*），更容易被理解。"]}
{"word":"arrhythmy","summary":{"en":"Arrhythmy means an irregular rhythm, most commonly an abnormal heartbeat; it’s rare, and arrhythmia is the standard form.","zh":"arrhythmy 指节律不规则，最常见是心跳节律异常；该词较少见，标准用法通常是 arrhythmia。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an irregular rhythm, especially an abnormal heartbeat; (rare) irregularity in rhythm in general","zh":"心律不齐；（罕见）节奏不规则"},"examples":[{"en":"The doctor detected an arrhythmy during the routine checkup.","zh":"医生在例行检查中发现了心律不齐。"},{"en":"Some medications can trigger arrhythmy in sensitive patients.","zh":"某些药物可能会在敏感患者中诱发心律不齐。"},{"en":"The poet used arrhythmy to mirror the character’s anxiety.","zh":"诗人用不规则的节奏来映射人物的焦虑。"}]}],"synonyms":["arrhythmia","irregular heartbeat","irregular rhythm"],"phonetic":"/əˈrɪðmi/","extraExplanation":["“arrhythmy”在现代英语中非常少见，更常用、也更标准的医学名词是 **arrhythmia**（心律失常/心律不齐），形容词是 **arrhythmic**（节律不齐的）。如果你在医学报告或学术文章中遇到“arrhythmy”，多半是非标准拼写、旧用法，或作者想把“arrhythmia”简写成更口语/文学化的形式。","词源来自希腊语：**a-**（无/不）+ **rhythm**（节律），字面意思就是“没有规律的节奏”。在文学或音乐评论里偶尔会被借用来谈“节奏不规则”，但日常表达更常说 **irregular rhythm** 或 **lack of rhythm**。"]}
{"word":"Arri","summary":{"en":"Arri most commonly refers to ARRI, a well-known German brand for professional film cameras and lighting; it can also be used as a personal name.","zh":"Arri 最常指 ARRI——知名的德国专业电影摄影机与灯光品牌；也可以用作人名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a German company and brand famous for professional cinema cameras, lenses, and lighting equipment (often written as ARRI).","zh":"一家德国公司与品牌，以专业电影摄影机、镜头与灯光设备闻名（常写作 ARRI）。"},"examples":[{"en":"The film was shot on an ARRI ALEXA camera.","zh":"这部电影使用 ARRI ALEXA 摄影机拍摄。"},{"en":"The crew rented ARRI lights for the night scenes.","zh":"剧组为夜戏租用了 ARRI 灯具。"}]},{"partOfSpeech":"other","definition":{"en":"a personal name; sometimes used as a variant of “Ari” or as a nickname in some communities.","zh":"人名；在一些社群中会作为“Ari”的变体或昵称使用。"},"examples":[{"en":"Arri is my classmate in the English course.","zh":"Arri 是我英语课的同学。"},{"en":"Arri said she would join the study group later.","zh":"Arri 说她晚点会加入学习小组。"}]}],"synonyms":["ARRI"],"phonetic":"/ˈɑri/","extraExplanation":["在影视行业里，人们说“shoot on ARRI / shot on ARRI”通常指使用 ARRI 品牌的摄影机（尤其是 ALEXA 系列）拍摄。ARRI 以色彩、动态范围和电影工业级可靠性出名，因此在片尾字幕、器材清单和摄影师访谈中很常见。","拼写上常见全大写“ARRI”（品牌/公司），而作为人名时更常写作“Arri”。"]}
{"word":"arri","summary":{"en":"ARRI is a well-known German brand for professional cinema cameras, lenses, and lighting.","zh":"ARRI 是知名的德国影视器材品牌，以电影摄影机、镜头和灯光闻名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A German company famous for making professional film and TV cameras, lenses, and lighting equipment (often written as “ARRI”).","zh":"一家以制造专业电影/电视摄影机、镜头与灯光设备而闻名的德国公司（常写作“ARRI”）。"},"examples":[{"en":"The movie was shot on an ARRI ALEXA camera.","zh":"这部电影是用 ARRI ALEXA 摄影机拍摄的。"},{"en":"Many cinematographers choose ARRI lights for their color quality.","zh":"很多摄影指导会选择 ARRI 灯光，因为它的色彩质量很好。"}]}],"synonyms":["camera brand","cinema equipment maker"],"phonetic":"/ˈɑri/","extraExplanation":["ARRI 源自创办人名字的组合：Arnold 和 Richter；公司全名常见写法为 “Arnold & Richter Cine Technik”。在影视行业里，“ARRI” 常被当作高端电影机与灯光的代名词（例如 ALEXA 系列）。","如果你想查的是动词 “arrive（到达）”，请告诉我；“arri” 本身在英语里通常不作为普通单词使用，多见于品牌/缩写或人名拼写。"]}
{"word":"Arria","summary":{"en":"Arria is a woman’s name, especially known as a brave Roman noblewoman from the 1st century CE.","zh":"Arria 是女性名字，尤其指公元1世纪以勇敢著称的罗马贵族女性阿里娅。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A woman’s name, best known in history as Arria (1st century CE), a Roman noblewoman remembered for her courage and loyalty.","zh":"（专有名词）女性名字。历史上最著名的是公元1世纪的罗马贵族女性阿里娅（Arria），以勇气与忠诚而闻名。"},"examples":[{"en":"Arria is often cited as an example of stoic courage in ancient Rome.","zh":"阿里娅常被用来举例说明古罗马的坚忍与勇气。"},{"en":"In the story, Arria encourages her husband to face death without fear.","zh":"在这个故事里，阿里娅鼓励丈夫无惧面对死亡。"}]}],"synonyms":["(no direct synonyms; proper name)"],"phonetic":"/ˈæriə/","extraExplanation":["Arria最著名的典故来自罗马史：她的丈夫Paetus被命令自尽时，Arria先刺入自己身体，据传说说出拉丁语名句“Paete, non dolet”（“Paetus，不疼。”），以此鼓励丈夫。这个故事常被用来讨论罗马文化中的“斯多葛式坚忍”（stoicism）与荣誉观。","英语里“Arria”通常只在历史、文学、古典学语境出现；日常生活中更多作为较少见的人名。","相关表达：可与“stoic / stoicism（坚忍的/斯多葛主义）”“Roman matron（罗马贵妇/主妇）”一起理解其文化意涵。"]}
{"word":"arriage","summary":{"en":"Marriage means the formal union of two people, and it can also mean a strong combination of two things.","zh":"Marriage 指两人的正式婚姻关系，也可指两种事物的紧密结合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the legal or formal union of two people as partners in life","zh":"婚姻；结婚（指两人在法律或正式意义上的伴侣关系）"},"examples":[{"en":"They got married last summer after dating for three years.","zh":"他们交往三年后，于去年夏天结婚了。"},{"en":"In many places, marriage comes with legal rights and responsibilities.","zh":"在许多地方，婚姻伴随着法律权利与责任。"}]},{"partOfSpeech":"n.","definition":{"en":"a close combination or pairing of two things (often used in the pattern “a marriage of A and B”)","zh":"（事物的）结合；融合（常用结构：a marriage of A and B）"},"examples":[{"en":"The dish is a marriage of spicy flavors and fresh herbs.","zh":"这道菜把辛辣风味与新鲜香草融合在一起。"},{"en":"Their success is a marriage of talent and hard work.","zh":"他们的成功是天赋与努力的结合。"}]}],"synonyms":["wedding","union","matrimony","partnership","blend","combination"],"phonetic":"/ˈmærɪdʒ/","extraExplanation":["你输入的 **arriage** 通常是拼写少了开头的 **m**，正确拼写是 **marriage**。","常见搭配：**get married**（结婚）、**be married to**（与……结婚）、**marriage ceremony**（婚礼仪式）、**marriage certificate**（结婚证/婚姻证明）。","区分：**marriage**（名词：婚姻/结婚） vs. **marry**（动词：结婚/娶/嫁）。"]}
{"word":"Arriba","summary":{"en":"Arriba is a Spanish loanword used in English mainly as an exclamation meaning “Up!” or “Come on!”, and in Spanish phrases it can mean “up/above.”","zh":"Arriba 是从西班牙语借入的词，在英语中主要作欢呼的感叹语“起来！/加油！”，在西语短语里也可表示“向上/在上方”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(from Spanish) used as an exclamation meaning “up!” or “come on!”—often to encourage people, celebrate, or cheer.","zh":"（源自西班牙语）感叹语，意为“起来！/加油！”，常用于鼓励、庆祝或欢呼。"},"examples":[{"en":"Arriba! Let’s dance!","zh":"Arriba！来跳舞吧！"},{"en":"The crowd shouted, “Arriba!” as the team scored.","zh":"球队得分时，人群高喊：“Arriba！”"}]},{"partOfSpeech":"adv.","definition":{"en":"(in Spanish phrases used in English) “up; above; upstairs.”","zh":"（在英语中出现的西语短语里）“向上；在上方；楼上”。"},"examples":[{"en":"The sign said “Arriba,” meaning the exit was upstairs.","zh":"标牌写着“Arriba”，意思是出口在楼上。"},{"en":"In the song, “arriba” contrasts with “abajo” (“down”).","zh":"在这首歌里，“arriba”和“abajo”（向下）形成对比。"}]}],"synonyms":["up","come on","let’s go","higher"],"phonetic":"/əˈriːbə/","extraExplanation":["“Arriba”是西班牙语里非常常见的词，字面意思是“上面/向上”。在英语环境中多作为带有拉丁文化色彩的欢呼用语出现（例如派对、舞蹈、体育比赛）。","在一些墨西哥/拉美文化场景中，敬酒时可能会听到带“arriba”的固定说法（不同地区版本很多），属于口语文化表达；在正式英语写作中不常用。"]}
{"word":"arriba","summary":{"en":"“Arriba” is a Spanish word used in English mainly as a cheer meaning “Up!” or “Come on!” and sometimes as “up/above.”","zh":"“Arriba”是西班牙语词，在英语中多用作欢呼“加油/上！”；有时也表示“在上面/向上”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(from Spanish) an exclamation meaning “up!” or “let’s go!/come on!” often used in cheers or to encourage someone.","zh":"（源自西班牙语）感叹词，表示“上！/举起来！”或“加油！/快点！”，常用于欢呼或鼓励。"},"examples":[{"en":"Arriba! We can finish this hike if we keep moving.","zh":"Arriba！我们继续走就能走完这段徒步。"},{"en":"The crowd shouted “Arriba!” as the team ran onto the field.","zh":"球队跑进场时，人群高喊“Arriba！”"}]},{"partOfSpeech":"adv.","definition":{"en":"(Spanish adverb, sometimes seen in mixed English-Spanish) meaning “up/above/upstairs.”","zh":"（西语副词，在英西混用语境中偶尔出现）表示“在上面/向上/楼上”。"},"examples":[{"en":"Put the boxes arriba, not on the floor.","zh":"把箱子放到上面（arriba），别放地上。"},{"en":"They live arriba in the apartment upstairs.","zh":"他们住在楼上的公寓里。"}]}],"synonyms":["come on","let’s go","up","cheer"],"phonetic":"/əˈriːbə/","extraExplanation":["“Arriba”在西班牙语里很常见，字面核心含义是“向上/在上面”。在英语语境中，它多作为带有拉丁文化氛围的欢呼用语出现（比如庆祝、助威、舞蹈或节日场景）。","常见搭配包括：¡Arriba!（加油/上！）、Arriba las manos（手举起来；多见于口语或影视台词）。注意在正式英语写作中一般不使用，更多出现在口语、歌词、标语或文化相关文本里。"]}
{"word":"arribadas","summary":{"en":"Arribadas are mass nesting events when many sea turtles come ashore together to lay eggs.","zh":"Arribadas 指许多海龟同时上岸产卵的集体筑巢现象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of arribada) A mass nesting event when many sea turtles (especially olive ridley turtles) come ashore at the same time to lay eggs.","zh":"（arribada 的复数）指大量海龟（尤指榄蠵龟）在同一时间成群结队上岸产卵的“集体筑巢/同步产卵”现象。"},"examples":[{"en":"During arribadas, thousands of olive ridley turtles crawl onto the beach to lay eggs.","zh":"在 arribadas 期间，成千上万只榄蠵龟爬上海滩产卵。"},{"en":"The park closes some areas at night to protect turtles during the arribadas.","zh":"为了在 arribadas 期间保护海龟，公园会在夜间关闭部分区域。"},{"en":"Scientists study arribadas to understand sea turtle behavior and conservation needs.","zh":"科学家研究 arribadas，以了解海龟行为和保护需求。"}]}],"synonyms":["mass nesting (event)","mass nesting aggregation","synchronized nesting"],"phonetic":"ˌærɪˈbɑːdəz","extraExplanation":["“arribada”来自西班牙语，字面意思与“到达/上岸”有关。在英语里它通常作为外来词使用，最常见于生态、动物行为与保育文章中。常见搭配有：turtle arribada（海龟 arribada）、mass nesting event（大规模筑巢事件）。"]}
{"word":"arricci","summary":{"en":"Arricci are rough base coats of plaster used to prepare a wall for fresco painting.","zh":"Arricci 指用于湿壁画前期准备的粗糙底层灰泥（底灰）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(art, fresco painting) A rough base layer of plaster applied to a wall as preparation for a fresco; often the plural form refers to multiple such base coats or areas.","zh":"（艺术／湿壁画）涂在墙面上、用于准备湿壁画的粗糙底层灰泥；复数形式常指多处或多层这种底灰。"},"examples":[{"en":"Before painting the fresco, the artists prepared the wall with arricci.","zh":"在绘制湿壁画之前，艺术家先用 arricci（粗底灰）处理墙面。"},{"en":"The restoration team examined the arricci to understand the original surface.","zh":"修复团队检查了 arricci，以了解原始墙面结构。"}]}],"synonyms":["arriccio","rough coat","base coat","undercoat"],"phonetic":"ɑːˈriːtʃi","extraExplanation":["“Arricci”常被视为意大利语术语（更常见的单数是 arriccio）。在传统湿壁画（fresco）中，通常先做粗底灰（arriccio），再在要作画的当天铺一层更细、更湿的面灰（intonaco），颜料趁湿渗入而固定。","在英文艺术史与修复文献里，这个词多出现在对意大利文艺复兴壁画工艺的描述中，因此属于相对专业、学术语境的词。"]}
{"word":"arricciati","summary":{"en":"“Arricciati” is an Italian word meaning “curled/wavy” or “crinkled/wrinkled,” used in the plural.","zh":"“arricciati”是意大利语，表示“卷曲的/起皱的”，通常为复数形式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"curled; wavy; crinkled (Italian; plural form)","zh":"卷曲的；起皱的；波浪状的（意大利语复数形式）"},"examples":[{"en":"In the novel, the boy is described as having short, curly hair—capelli arricciati.","zh":"小说里写那个男孩留着短短的卷发——capelli arricciati。"},{"en":"She wore a scarf with arricciati edges, slightly crinkled like ruffles.","zh":"她围了一条边缘带褶皱的围巾，边边微微起皱，像荷叶边。"}]},{"partOfSpeech":"other","definition":{"en":"curled up / wrinkled (used as a past participle of the Italian verb arricciare, “to curl; to crinkle”)","zh":"被卷起／起皱（作意大利语动词 arricciare“使卷曲、使起皱”的过去分词用法）"},"examples":[{"en":"The heat had curled the paper: fogli arricciati.","zh":"高温把纸烤卷了：fogli arricciati。"},{"en":"After the swim, his hair looked messier and more curled—ancora più arricciati.","zh":"游完泳，他的头发更乱、更卷了——ancora più arricciati。"}]}],"synonyms":["curly","wavy","crinkled","wrinkled"],"phonetic":"/ɑˌritʃˈɑti/","extraExplanation":["“arricciati”是意大利语形式，通常是阳性复数的过去分词/形容词，意思接近“卷曲的、起皱的”。常见搭配：capelli arricciati（卷发）、fogli arricciati（卷起的纸）。","对应的基础动词是 arricciare（使卷曲/使起皱），也可以用于比喻情绪或表情的“皱起/扭曲”（如皱鼻子、皱眉等语境，具体要看原句）。"]}
{"word":"arricciato","summary":{"en":"Arricciato means “curled/ruffled,” especially in Italian-style descriptions of hair or fabric.","zh":"arricciato意为“卷曲的/起褶的”，常用于意式语境中描述头发或布料。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Italian) curled; crimped; ruffled (often used to describe hair, fabric, ribbons, or decorative edges).","zh":"（意大利语）卷曲的；起皱的；有褶边的（常形容头发、布料、丝带或装饰边缘）。"},"examples":[{"en":"She wore her hair arricciato, with soft curls around her face.","zh":"她把头发弄成arricciato的样子，脸旁是柔和的卷发。"},{"en":"The dress had an arricciato collar that looked like a small ruffle.","zh":"那条裙子有一个arricciato的领口，看起来像小小的荷叶边。"}]},{"partOfSpeech":"v.","definition":{"en":"(As a past participle of Italian arricciare) to curl up; to ruffle or make wavy.","zh":"（作意大利语动词arricciare的过去分词）使卷起；使起皱/起波纹。"},"examples":[{"en":"The humid air made the fabric look arricciato.","zh":"潮湿的空气让布料看起来有些arricciato（起皱/卷曲）。"},{"en":"He arricciato the ribbon to decorate the gift box.","zh":"他把丝带弄成arricciato的样子来装饰礼物盒。"}]}],"synonyms":["curled","wavy","ruffled","crimped"],"phonetic":"/ˌɑːriˈtʃɑːtoʊ/","extraExplanation":["“arricciato”是意大利语，来自动词“arricciare”（使卷曲、使起皱）。在英文语境里多见于时尚、纺织、艺术或烹饪（较少）等描述性文字中，常作为外来词使用。"]}
{"word":"arricciatos","summary":{"en":"Arricciato is an Italian-derived adjective meaning “curly/curling,” and in fresco art it can describe the rough plaster underlayer related to arriccio.","zh":"Arricciato 是源自意大利语的形容词，常指“卷曲的”；在湿壁画语境中也可指与底层粗灰（arriccio）相关的粗底灰层。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Borrowed from Italian) curly; curled up or wavy in shape (often used to describe hair, ribbons, or decorative forms).","zh":"（意大利语借词）卷曲的；蜷起的；呈波浪状的（常形容头发、丝带或装饰形态）。"},"examples":[{"en":"She wore her hair in an arricciato style, with loose curls framing her face.","zh":"她把头发做成偏“arricciato”的造型，松松的卷发修饰着脸颊。"},{"en":"The sculpted leaves look arricciato, as if the edges were gently curled by hand.","zh":"雕刻的叶片看起来是“arricciato”的，好像叶缘被手工轻轻卷起。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Art / fresco painting) having a rough undercoat of plaster; related to the base layer (arriccio) used before the final smooth layer in a fresco.","zh":"（艺术/湿壁画）带有粗底灰层的；与湿壁画上粉饰前的底层粗灰（arriccio）有关。"},"examples":[{"en":"Before painting the final layer, the wall was prepared with an arricciato surface.","zh":"在绘制最后一层之前，墙面先做成带底灰的 arricciato 表面。"},{"en":"The conservation report mentions an arricciato layer beneath the finished fresco.","zh":"修复报告提到成品湿壁画下方有一层 arricciato 底层。"}]}],"synonyms":["curly","curled","wavy","frizzy","rough-coated"],"phonetic":"/ˌɑriˈtʃiɑtoʊ/","extraExplanation":["“arricciatos”在英语里不算常见标准形式，更像把意大利语形容词 arricciato 随意加了英文复数 -s。若按意大利语复数：阳性复数常为 arricciati，阴性复数常为 arricciate。","在湿壁画（fresco）工艺中，arriccio 指较粗的底层灰泥；其上再做更细、更平滑的 intonaco（面层），画家通常在面层尚湿时作画。"]}
{"word":"arriccio","summary":{"en":"Arriccio is the rough first plaster coat used as the base layer for fresco painting.","zh":"Arriccio 指湿壁画等墙面打底用的粗抹灰第一层（粗底灰层）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rough base layer of plaster applied to a wall, especially as the first coat in true fresco painting, used to create a key (tooth) for the final smooth layer.","zh":"（尤指湿壁画 true fresco 中的）粗底灰层/粗抹灰第一层，用来打底并提供粗糙“咬合力”，以便后续的细灰层附着。"},"examples":[{"en":"In fresco painting, the artist lays down the arriccio before adding the smooth final plaster.","zh":"在湿壁画中，画家会先抹上 arriccio（粗底灰层），再加上最后的细灰层。"},{"en":"The conservator found cracks in the arriccio beneath the painted surface.","zh":"修复师发现彩绘表面下面的 arriccio（粗底灰层）出现了裂缝。"}]}],"synonyms":["rough plaster","base coat","scratch coat","undercoat"],"phonetic":"ˌɑːˈritʃoʊ","extraExplanation":["Arriccio 是意大利语术语，常见于艺术史与壁画修复语境。传统湿壁画通常分层：先做 arriccio（较粗的石灰灰泥层），其上会画“底稿/预备稿”（sinopia），最后再抹一层更细更湿的灰泥（intonaco）并趁湿作画。","在英语艺术写作里，这个词多保持意大利语原形使用，属于较专业的借词。"]}
{"word":"arriccioci","summary":{"en":"“Arriccioci” isn’t an English word; it’s likely Italian and relates to “curling/wrinkling.” Share the original sentence for a precise meaning.","zh":"“arriccioci”不是英语词；很可能是意大利语，和“卷曲/起皱”有关。给出原句能更准确判断意思。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It looks like Italian.","zh":"不是标准英语单词，看起来像意大利语。"},"examples":[{"en":"I couldn’t find “arriccioci” in standard English dictionaries—could you share the sentence it comes from?","zh":"我在标准英语词典里找不到“arriccioci”，你可以把它出现的句子发我吗？"}]},{"partOfSpeech":"other","definition":{"en":"(Likely Italian) A form related to the verb “arricciare/arricciarsi,” meaning “to curl; to wrinkle; to bristle (hair),” often used for hair or edges.","zh":"（很可能是意大利语）与动词“arricciare/arricciarsi”有关，意思是“卷曲；起皱；（毛发）竖起/卷起”，常用于头发或边缘。"},"examples":[{"en":"Italian example: I capelli si arricciano con l’umidità. (The hair curls with humidity.)","zh":"意大利语例句：I capelli si arricciano con l’umidità.（头发在潮湿环境下会卷起来。）"},{"en":"If it’s a command, it may mean something like “curl up!” depending on context.","zh":"如果它是命令式，按语境可能类似“蜷起来/卷起来！”之类的意思。"}]}],"synonyms":["(Italian) arricciarsi","(Italian) arricciare","curl","wrinkle"],"phonetic":"/ˌɑːriːˈtʃoʊtʃi/","extraExplanation":["“arricci-”这个词根在意大利语里常和“卷曲、起皱、卷边”有关：例如 arricciare（使……卷曲/起皱）、arricciarsi（变卷/起皱）、arricciato（卷曲的/起皱的）。但“arriccioci”具体是哪一种人称/语气（比如命令式、虚拟式、或拼写误差）需要看到原句才能确定。"]}
{"word":"arriccios","summary":{"en":"Arriccios are the rough base plaster layers used under the final smooth coat in fresco painting.","zh":"Arriccios 指湿壁画中用于打底的粗抹灰层/粗底灰，位于最终细面层之下。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Art, architecture) In fresco painting, a rough base coat of plaster applied to a wall before the smoother final layer (intonaco).","zh":"（艺术/建筑）湿壁画中，先涂在墙面上的粗底灰（粗抹灰层），用于打底，之后再上更细的面层（intonaco）。"},"examples":[{"en":"The restorer found cracks in the arriccio beneath the painted surface.","zh":"修复师在画面表层下方的粗底灰（arriccio）里发现了裂缝。"},{"en":"Artists often sketch the sinopia on the arriccio before applying the final plaster.","zh":"画家常在粗底灰（arriccio）上画底稿（sinopia），再覆盖最后的面灰。"}]}],"synonyms":["base coat","rough plaster coat","undercoat (plaster)","scratch coat"],"phonetic":"/əˈritʃoʊz/","extraExplanation":["“Arriccio”是意大利语词，主要出现在湿壁画（fresco）工艺中：墙体通常先做粗糙的底层（arriccio），待其干后在上面绘制底稿（常称sinopia），最后再铺一层更细、更适合上色的湿灰层（intonaco），颜料趁湿渗入形成画面。","复数在英语里常写作 arriccios（也可能见到意大利式复数 arricci）。"]}
{"word":"arride","summary":{"en":"“arride” is not standard; it is most likely a misspelling of **arrive**, meaning to reach a place or for a time/event to come.","zh":"“arride” 不是标准英文，最可能是 **arrive** 的拼写错误，意思是“到达”或“（时间/事件）到来”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Common spelling: **arrive**) to reach a place; to come to a destination.","zh":"（常见拼写：**arrive**）到达某地；抵达目的地。"},"examples":[{"en":"What time did you arrive at the airport?","zh":"你几点到达机场的？"},{"en":"The train arrived late because of the weather.","zh":"因为天气原因，火车晚点到达了。"},{"en":"When we arrived home, it was already dark.","zh":"我们到家时，天已经黑了。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Of a time/event) to happen or come.","zh":"（时间/事件）到来；发生。"},"examples":[{"en":"The day we’ve been waiting for has finally arrived.","zh":"我们一直等待的那一天终于到来了。"},{"en":"A new opportunity may arrive when you least expect it.","zh":"新的机会可能会在你最意想不到的时候到来。"}]},{"partOfSpeech":"vi.","definition":{"en":"To become successful or be accepted/recognized (often used with “has arrived”).","zh":"取得成功；被认可（常用 “has arrived” 表示“已经出名/站稳脚跟”）。"},"examples":[{"en":"After her first novel became a hit, people said she had arrived.","zh":"她的第一部小说大获成功后，人们说她已经成名了。"},{"en":"That small startup has really arrived in the tech world.","zh":"那家小型初创公司在科技圈真的站稳脚跟了。"}]}],"synonyms":["reach","get to","come","show up","turn up"],"phonetic":"/əˈraɪv/","extraExplanation":["“arride” 不是标准英文单词，最常见是把 **arrive** 拼错了。正确拼写是 **arrive**（注意：中间是 **-ive**，不是 **-ide**）。","用法小提醒：一般说 **arrive at** + 小地点（at the station/at school），**arrive in** + 大地点（in China/in New York）。"]}
{"word":"arrided","summary":{"en":"Arrive means to reach a place, or for a time/event to come; informally, it can mean to become successful.","zh":"arrive 表示“到达；（时间/事件）到来”；口语中也可指“成名/成功”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to reach a place (often after traveling)","zh":"到达（某地），抵达"},"examples":[{"en":"We arrived at the airport early.","zh":"我们很早就到达了机场。"},{"en":"What time did you arrive?","zh":"你什么时候到的？"},{"en":"The train arrived late because of the weather.","zh":"因为天气原因，火车晚点到达。"}]},{"partOfSpeech":"vi.","definition":{"en":"to happen or come (especially of a time, event, or moment)","zh":"到来；发生（常指时间、事件或时刻）"},"examples":[{"en":"When the big day finally arrived, she felt calm.","zh":"当重要的日子终于到来时，她反而很平静。"},{"en":"Opportunity may arrive when you least expect it.","zh":"机会可能在你最意想不到的时候到来。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become successful or well-known (informal)","zh":"（非正式）成名；成功；“出头”"},"examples":[{"en":"After her first hit song, she had really arrived.","zh":"她第一首热歌之后，真的算是成名了。"},{"en":"He worked for years before he finally arrived in the industry.","zh":"他努力多年，才终于在行业里站稳脚跟。"}]}],"synonyms":["reach","get (to)","come","show up","turn up"],"phonetic":"əˈraɪv","extraExplanation":["“arrided” 不是标准英文单词，最常见的情况是把过去式/过去分词 “arrived” 拼错了。arrive 的过去式是 arrived：We arrived yesterday（我们昨天到达了）。","常见搭配：arrive at + 小地点/具体点（arrive at the station 到车站；arrive at a decision 做出决定）；arrive in + 大地点（arrive in China 到中国）。不要说 “arrive to a place”。"]}
{"word":"arridge","summary":{"en":"“arridge” isn’t a standard English word; it’s likely a misspelling of another word such as “porridge,” “carriage,” or “partridge.”","zh":"“arridge”不是标准英文单词；更可能是把“porridge / carriage / partridge”等词拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a truncated form of another word (for example, “porridge,” “carriage,” or “partridge”), depending on the context.","zh":"不是标准英文单词。更可能是拼写错误或把某个单词截断了（例如 porridge「粥」、carriage「马车/车厢」、partridge「鹧鸪」），具体取决于上下文。"},"examples":[{"en":"I couldn’t find “arridge” in the dictionary—did you mean “porridge”?","zh":"我在词典里找不到“arridge”——你是不是想写“porridge（粥）”？"},{"en":"If you meant “carriage,” it refers to a vehicle or a train car (in British English).","zh":"如果你想写“carriage”，它指“马车/车辆”，在英式英语里也可指“火车车厢”。"}]}],"phonetic":"/ˈærɪdʒ/","extraExplanation":["“arridge”更像是打字漏掉了开头字母（如 p/car/part-）造成的。你可以把包含它的完整句子发我，我就能判断你真正想表达的词，并给出准确释义与例句。","小提示：\n- porridge：常见于英式早餐文化（燕麦粥）。\n- carriage：在英式英语里常见搭配是 train carriage（火车车厢）。\n- partridge：常见于童谣/圣诞歌曲语境，如《The Twelve Days of Christmas》里的 “a partridge in a pear tree”。"]}
{"word":"arriding","summary":{"en":"“Arriding” is not standard; it usually means “arriving.”","zh":"“arriding” 不是标准拼写；通常想写的是 “arriving（到达）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most commonly a misspelling of “arriving” (coming to a place).","zh":"不是标准英文单词。最常见是把 “arriving”（到达、来到某地）拼错了。"},"examples":[{"en":"Incorrect: The train is arriding at 6 p.m.","zh":"错误：The train is arriding at 6 p.m.（这里应写 arriving）"},{"en":"Correct: The train is arriving at 6 p.m.","zh":"正确：The train is arriving at 6 p.m.（火车下午6点到达）"},{"en":"She texted me when she was arriving.","zh":"她在快到/到达时给我发了短信。"}]}],"synonyms":["coming","reaching","getting in"],"phonetic":"/əˈraɪvɪŋ/","extraExplanation":["“arriving” 来自动词 “arrive”（到达）。现在分词/动名词形式是 arrive + -ing → arriving。","常见拼写混淆：把 v 误写成 d（尤其在手写体或输入法联想时）。如果你想表达“骑车/乘马”，更可能是 “riding”。"]}
{"word":"arrie","summary":{"en":"“Arrie” is most commonly used as a personal name/nickname; it may also be a misspelling of a similar name or word.","zh":"“Arrie”最常见是人名/昵称；也可能是相近名字或单词的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name (usually a nickname), often used as a short form of names like Harriet, Arielle/Ariel, or Ariana (usage varies by family and region).","zh":"人名（多为昵称），常作为 Harriet、Arielle/Ariel 或 Ariana 等名字的简写（具体来源因家庭与地区而异）。"},"examples":[{"en":"Arrie is short for Harriet in her family.","zh":"在她家里，Arrie 是 Harriet 的昵称/简写。"},{"en":"My friend Arrie just started college.","zh":"我的朋友 Arrie 刚开始上大学。"}]},{"partOfSpeech":"other","definition":{"en":"a misspelling of a more common word or name (for example, “Ari,” “Arie,” or “Harry”); the intended meaning depends on context.","zh":"可能是更常见单词或名字的拼写错误（如 Ari、Arie 或 Harry）；具体含义需要结合上下文判断。"},"examples":[{"en":"Did you mean “Ari” or “Arie”?","zh":"你想写的是 “Ari” 还是 “Arie” 呢？"},{"en":"If you share the sentence, I can tell what “arrie” is meant to be.","zh":"如果你把整句话发我，我就能判断 “arrie” 具体想表达什么。"}]}],"synonyms":["Ari","Arie"],"phonetic":"/ˈæri/","extraExplanation":["“Arrie”在英语里不算常见词汇，更常见的是作为人名/昵称出现。不同家庭可能把它当作 Harriet、Arielle/Ariel、Ariana 等名字的简写。","如果你是在一段文字里看到“arrie”，也有可能是拼写错误。把原句（或你想表达的句子）发来，我可以帮你确定最可能的正确拼法和意思。"]}
{"word":"arriere","summary":{"en":"“Arriere/Arrière” is a French loanword meaning “behind; rear,” and it’s rare in everyday English.","zh":"“arriere/（法语）arrière”是法语借词，表示“在后；后部/后方”，在日常英语中不常用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(French loanword; often written with accents as “arrière”) located behind; rear; in the back.","zh":"（法语借词；常写作带重音的“arrière”）在后面的；后部的；靠后的。"},"examples":[{"en":"They waited in the arrière room, away from the main hall.","zh":"他们在后面的房间里等着，远离主大厅。"},{"en":"In some formal writing, “arrière” can mean “rear” or “behind.”","zh":"在一些较正式的写作中，“arrière”可表示“后方/后面”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare in modern English) the rear part or the area behind something.","zh":"（现代英语中较少见）后部；后方区域。"},"examples":[{"en":"Supplies were stored in the arrière of the building.","zh":"物资被存放在大楼的后部。"}]}],"synonyms":["rear","back","behind","rearward"],"phonetic":"/ˌær.iˈɛr/","extraExplanation":["“arrière”是法语词，原意与“后面/后方”有关；英语里更常用的对应表达是 rear / back / behind。","注意拼写：法语标准写法常带重音符号（arrière）。在英语文本中有时会省略重音写成 arriere，但整体仍显得偏“外来词”、较书面。","不要与英语的 arrears（欠款、拖欠）混淆：两者看起来像，但英语里谈“欠费/拖欠”通常用 arrears，而不是 arriere。"]}
{"word":"arriero","summary":{"en":"Arriero means a muleteer or pack-animal driver, mainly used as a Spanish loanword in historical or Latin American contexts.","zh":"Arriero 指“赶骡人／驮队赶运者”，是来自西班牙语的外来词，常见于历史或拉美语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Spanish) a muleteer; a person who drives or leads pack animals (especially mules) to transport goods.","zh":"（源自西班牙语）赶骡人／赶驮队的人；带领驮畜（尤指骡子）运送货物的人。"},"examples":[{"en":"In the mountains, an arriero led a line of mules carrying coffee sacks.","zh":"在山里，一位赶骡人带着一队骡子驮着一袋袋咖啡前行。"},{"en":"They hired an arriero to guide the pack animals along the old trail.","zh":"他们雇了一位赶骡人沿着古道引导驮畜前进。"}]}],"synonyms":["muleteer","packman","pack-animal driver"],"phonetic":"/ɑːriˈɛroʊ/","extraExplanation":["“Arriero”常见于西班牙语国家（如墨西哥、秘鲁、哥伦比亚等）的山区运输语境，指传统以骡马驮运货物的人。英语里多用于历史、旅行写作或描写拉美乡村生活的文本中。","有一句西班牙语谚语“Arrieros somos y en el camino andamos”，大意是“我们都是行路人，路上总会再相逢”，带有“做人留一线、江湖再见”的意味。"]}
{"word":"Arries","summary":{"en":"Aries is the zodiac sign (and constellation) symbolized by a ram; it can also mean a person born under that sign.","zh":"Aries 指以“公羊”为象征的白羊座（黄道十二宫与同名星座），也可指白羊座的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Aries: the zodiac sign represented by a ram, traditionally linked to people born roughly from March 21 to April 19.","zh":"白羊座：黄道十二宫之一，以“公羊”为象征，通常对应大约3月21日至4月19日出生的人。"},"examples":[{"en":"She’s an Aries, so she loves taking the lead.","zh":"她是白羊座，所以很喜欢带头做事。"},{"en":"My birthday is in early April, which makes me an Aries.","zh":"我生日在四月初，所以我是白羊座。"}]},{"partOfSpeech":"n.","definition":{"en":"Aries: a constellation (a group of stars) in the northern sky, associated with the zodiac sign Aries.","zh":"白羊座（星座）：北天的一个星座（由一组恒星组成），与黄道十二宫的白羊座相对应。"},"examples":[{"en":"On a clear night, you might be able to spot Aries near Taurus.","zh":"在晴朗的夜晚，你也许能在金牛座附近看到白羊座（星座）。"},{"en":"The constellation Aries is named after the ram in Greek myth.","zh":"白羊座这个星座的名字来自希腊神话中的公羊。"}]},{"partOfSpeech":"n.","definition":{"en":"an Aries: a person born under the zodiac sign Aries.","zh":"白羊座的人：指出生在白羊座对应日期范围内的人。"},"examples":[{"en":"As an Aries, he’s energetic and direct.","zh":"作为白羊座的人，他精力充沛、说话很直接。"},{"en":"Two Aries in the same team can clash over who’s in charge.","zh":"同一团队里两个白羊座的人可能会因为谁做主而起冲突。"}]}],"synonyms":["the Ram"],"phonetic":"/ˈɛriz/","extraExplanation":["你输入的“Arries”更常见的拼写是 **Aries**（白羊座）。在英语里“Aries”常用于占星（zodiac sign）或天文学（constellation）的语境。","词源：**Aries** 来自拉丁语，意思是“公羊（ram）”。因此它的常见相关词也包括 **the Ram**（公羊座）。"]}
{"word":"Arriet","summary":{"en":"Arriet is usually a misspelling or rare variant of the name Harriet.","zh":"Arriet 通常是 Harriet 的误拼或少见变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Harriet (also spelled Arriet in some contexts) is a female given name.","zh":"Harriet（有时也会看到 Arriet 这种拼写）是一个女性英文名字。"},"examples":[{"en":"Harriet is my grandmother’s name.","zh":"Harriet 是我祖母的名字。"},{"en":"We read a biography of Harriet Tubman in class.","zh":"我们在课上读了一本关于 Harriet Tubman（哈丽雅特·塔布曼）的传记。"}]}],"synonyms":["Harriet"],"phonetic":"/ˈhɛriət/","extraExplanation":["“Arriet”更常见的情况是把“Harriet”少写了开头的 H，或者是个较少见的变体拼写。日常英语里最标准、最常见的拼写是 Harriet。","Harriet 这个名字在英语文化中很常见，常与历史人物 Harriet Tubman（美国废奴主义者、地下铁路重要人物）或文学作品中的角色（如简·奥斯汀《爱玛》里的 Harriet Smith）联系在一起。"]}
{"word":"arriet","summary":{"en":"Harriet is a common female first name; it may also refer to the historical figure Harriet Tubman.","zh":"Harriet 是常见的女性英文名；也可能在语境中指历史人物哈丽雅特·塔布曼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a female given name (first name), often used in English-speaking countries","zh":"女性名字（名），常见于英语国家"},"examples":[{"en":"Harriet is my aunt’s name.","zh":"Harriet 是我姑妈的名字。"},{"en":"We met a student named Harriet in class.","zh":"我们在课上认识了一位叫 Harriet 的学生。"}]},{"partOfSpeech":"other","definition":{"en":"(often capitalized in context) a famous historical figure named Harriet, especially Harriet Tubman in U.S. history","zh":"（在特定语境中常特指）著名的 Harriet，尤其指美国历史人物哈丽雅特·塔布曼（Harriet Tubman）"},"examples":[{"en":"Harriet Tubman helped many enslaved people escape to freedom.","zh":"哈丽雅特·塔布曼帮助许多被奴役的人逃向自由。"},{"en":"The museum has an exhibit about Harriet Tubman’s life.","zh":"博物馆有一个关于哈丽雅特·塔布曼生平的展览。"}]}],"synonyms":["Henrietta (related name)"],"phonetic":"/ˈhɛriət/","extraExplanation":["“Harriet”常被认为是“Henrietta”的昵称或变体，源头与德语系词根有关，含义接近“家园的统治者/管理者”。","你输入的“arriet”可能是漏掉了首字母H的拼写；英文中单独写“arriet”并不常见。"]}
{"word":"Arrigny","summary":{"en":"Arrigny is a place name: a commune in the Marne department of northeastern France.","zh":"Arrigny 是一个地名：法国东北部马恩省的一个市镇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Arrigny: a small commune (town) in northeastern France, in the Marne department (Grand Est region).","zh":"Arrigny：法国东北部的一个小市镇（commune），位于马恩省（Grand Est 大区）。"},"examples":[{"en":"She grew up near Arrigny in the Marne countryside.","zh":"她在马恩省乡间、靠近 Arrigny 的地方长大。"},{"en":"Arrigny is a quiet French commune with farms and small villages nearby.","zh":"Arrigny 是一个安静的法国小市镇，附近有农田和小村庄。"}]}],"synonyms":["(no direct synonyms; proper place name)"],"phonetic":"/əˈriːnji/","extraExplanation":["这是法语地名。在英文语境中常被当作专有名词使用；如果你是在地图、家谱、旅行资料或历史文本中看到它，通常指法国马恩省的这个市镇。","法语里结尾“-gny”常对应类似“ny/ñ”的鼻音（像“canyon”里“-ny-”那种感觉）；英文读法通常会做近似化处理。"]}
{"word":"Arrigo","summary":{"en":"Arrigo is an Italian male given name (also used as a surname).","zh":"Arrigo 是一个意大利男性名字（也可作姓氏）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name of Italian origin (the Italian form related to “Henry/Enrico”).","zh":"一个意大利语男性名字（与“Henry/Enrico/亨利”同源或相关的意大利名字形式）。"},"examples":[{"en":"Arrigo is an Italian first name.","zh":"Arrigo 是一个意大利名字。"},{"en":"His name is Arrigo, but his friends call him Ari.","zh":"他叫 Arrigo，但朋友们叫他 Ari。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname), especially in Italy.","zh":"一个姓氏（尤其在意大利）。"},"examples":[{"en":"Ms. Arrigo will speak at the meeting today.","zh":"Arrigo 女士今天会在会议上发言。"}]}],"synonyms":["Enrico","Henry"],"phonetic":"/əˈriːɡoʊ/","extraExplanation":["Arrigo 常见于意大利语语境中；在英语里多作为外来人名出现，通常不会翻译含义，而是按读音音译或直接保留拼写。","文化提示：有些著名人物使用 Arrigo 作为名，例如作曲家与诗人 Arrigo Boito、足球教练 Arrigo Sacchi；因此在音乐、文学或足球语境里可能会看到这个名字。"]}
{"word":"arrimby","summary":{"en":"“Arrimby” isn’t a standard English word; it’s likely a name or a misspelling.","zh":"“arrimby”不是标准英语单词；更可能是人名/专名或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling, a username, or a proper name (e.g., a surname or place name).","zh":"不是标准英语单词。更可能是拼写错误、用户名，或专有名词（如姓氏/地名）。"},"examples":[{"en":"I couldn’t find “arrimby” in an English dictionary—do you mean “Arrimby” as a name?","zh":"我在英语词典里找不到“arrimby”——你是指作为名字的“Arrimby”吗？"},{"en":"The email was signed “Arrimby,” so I assumed it was the sender’s surname.","zh":"邮件署名为“Arrimby”，所以我猜它是发件人的姓。"}]}],"phonetic":"/əˈrɪmbi/","extraExplanation":["“arrimby”很可能是打错字。你能提供一句包含它的原句、或说明它来自哪里（游戏ID、地名、人名、品牌等）吗？我就能更准确判断意思与用法。","如果你想查的是常见英语词：你是不是想写 **arrive**（到达）、**army**（军队）、或 **Arimby/Arimbee** 这类人名拼法？给我上下文我可以帮你锁定。"]}
{"word":"Arrington","summary":{"en":"Arrington is mainly a surname and sometimes a place name.","zh":"Arrington主要用作姓氏，也可用作地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), originally an English name that often comes from place names ending in “-ton” (meaning “town/settlement”).","zh":"一个姓氏（家族姓），源自英语中常见的地名式姓氏；其中“-ton”常表示“城镇/聚落”。"},"examples":[{"en":"Ms. Arrington will lead today’s meeting.","zh":"阿灵顿女士将主持今天的会议。"},{"en":"My last name is Arrington.","zh":"我姓阿灵顿。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used for some towns, roads, and neighborhoods (especially in the U.S.), often named after a person or an older English place name.","zh":"一个地名，可用于一些城镇、道路或社区（尤其在美国）；常因纪念某个人或沿用旧的英式地名而得名。"},"examples":[{"en":"They moved to Arrington, Tennessee, for work.","zh":"他们因工作搬到了田纳西州的阿灵顿（Arrington）。"},{"en":"Turn left onto Arrington Road.","zh":"左转进入阿灵顿路（Arrington Road）。"}]}],"synonyms":["(none; proper name)"],"phonetic":"ˈærɪŋtən","extraExplanation":["“Arrington”在英语里通常是专有名词（人名/地名），所以一般不加冠词，也不按普通名词那样用复数（除非指“Arrington一家人/the Arringtons”）。","在美国你可能会看到它作为地名或机构名的一部分（如学校、公司、街道）；具体指哪一个地点需要看上下文（州/城市/道路名等）。"]}
{"word":"Arrio","summary":{"en":"“Arrio” is not a standard English vocabulary word; it is usually a proper name.","zh":"“Arrio”不是标准英语词汇，通常用作专有名词（名字/姓氏/地名/品牌）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a common English word. Most often seen as a proper name (a surname, place name, or brand name). Meaning depends on the specific person/place/brand.","zh":"不是常见英语词。多见于专有名词（姓氏、地名或品牌名）。具体含义取决于指代的对象。"},"examples":[{"en":"I couldn’t find a standard English definition for “Arrio”; it may be a name.","zh":"我查不到“Arrio”的标准英语词义；它可能是一个名字。"},{"en":"Arrio is the last name of one of the speakers at the event.","zh":"Arrio 是活动中一位演讲者的姓。"}]}],"phonetic":"/ˈɑːrioʊ/","extraExplanation":["“Arrio”更像是西班牙语/意大利语语感的姓氏或地名拼写，但在英语词典里通常不会作为普通词条出现。","如果你是在文章/游戏/社交媒体里看到它，发我一句包含它的原句或告诉我它指人、地还是产品，我可以更准确解释。","它也可能是拼写误差：常见相近词有 arrive（到达）、arrow（箭）、aria（咏叹调/旋律）。"]}
{"word":"arripare","summary":{"en":"“Arripare” isn’t a standard English word; it’s most likely a misspelling of **arrive**, meaning “to reach a place” or (with *arrive at*) “to reach a decision/conclusion.”","zh":"“arripare” 不是标准英语单词；它很可能是 **arrive** 的拼写错误，意思是“到达”，或在 *arrive at* 结构中表示“得出结论/作出决定”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Likely intended: **arrive**) to reach a place, especially at the end of a journey.","zh":"（可能想写：**arrive**）到达（某地），尤指旅程结束时到达。"},"examples":[{"en":"We arrived at the airport early.","zh":"我们很早就到达了机场。"},{"en":"What time does the train arrive?","zh":"火车几点到？"}]},{"partOfSpeech":"phrase","definition":{"en":"(arrive at + noun) to achieve or decide something after thinking or discussing.","zh":"（arrive at + 名词）经过思考或讨论后得出（结论）、作出（决定）。"},"examples":[{"en":"After a long discussion, we arrived at a solution.","zh":"经过长时间讨论，我们得出了一个解决方案。"},{"en":"They arrived at the decision to move.","zh":"他们最终决定搬家。"}]}],"synonyms":["reach","get to","come","turn up","attain (arrive at a decision)"],"phonetic":"əˈraɪv","extraExplanation":["“arripare” 不是常见英语单词，最可能是把 **arrive** 拼错了（把 v 写成了 p）。","如果你其实想写意大利语 **arrivare**（到达），英语对应通常是 **arrive**。"]}
{"word":"arris","summary":{"en":"An arris is a sharp edge where two surfaces meet, especially in masonry or woodworking.","zh":"Arris 指两平面相交形成的锋利棱角，常见于建筑砌筑或木工语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sharp edge formed where two flat surfaces meet, especially on a stone, brick, piece of wood, or metal (common in architecture and masonry)","zh":"（尤指石材、砖、木材或金属等两平面相交形成的）棱；棱角（建筑/砌筑用语）"},"examples":[{"en":"Be careful—the arris of that stone block is very sharp.","zh":"小心——那块石料的棱角很锋利。"},{"en":"The mason chamfered the arris to prevent chipping.","zh":"泥瓦匠把棱角倒角处理，以免崩裂。"},{"en":"Clean lines and crisp arrises give the column a refined look.","zh":"线条干净、棱角分明让这根柱子看起来更精致。"}]}],"synonyms":["edge","ridge","corner","sharp edge","angle"],"phonetic":"/ˈærɪs/","extraExplanation":["“arris”主要用于建筑、石材加工、木工等语境，日常口语里更常说“edge（边缘）”或“corner（角）”。","常见搭配：sharp/crisp arris（锋利/清晰的棱角）、chamfer/bevel the arris（给棱角倒角/做斜角）、protect the arris（保护棱角，防止磕碰崩边）。"]}
{"word":"arrises","summary":{"en":"“Arrises” most commonly means the sharp edges/corners where two surfaces meet (plural of “arris”).","zh":"“arrises”通常指两面相交形成的棱角/锐边（“arris”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “arris”: a sharp edge or ridge formed where two surfaces meet (especially in stone, wood, or metalwork).","zh":"“arris”的复数：两面相交形成的棱角、锐边（常见于石材、木材或金属加工）。"},"examples":[{"en":"The mason protected the arrises of the stone blocks during transport.","zh":"石匠在运输过程中保护石块的棱角。"},{"en":"A small chip on the arrises can make the corner look rough.","zh":"棱角上的小缺口会让角看起来很粗糙。"}]},{"partOfSpeech":"v.","definition":{"en":"In woodworking or construction, to create or shape a sharp edge (rare; from “to arris”).","zh":"在木工或建筑中：做出/修出棱角（较少见；源自动词“to arris”）。"},"examples":[{"en":"They arrised the timber to make the corners crisp.","zh":"他们把木料修出棱角，让边角更利落。"}]}],"synonyms":["edges","ridges","corners (in construction context)"],"phonetic":"/ˈærɪs/","extraExplanation":["“arrises”经常被误拼或误读为“arises”（动词 arise 的第三人称单数，意为“出现/发生”）。如果你想表达“发生/出现”，正确拼写通常是“arises”。"]}
{"word":"arrish","summary":{"en":"Arrish means “harsh or unpleasant,” especially of a sound (Scots dialect).","zh":"Arrish 指“刺耳、难听（多指声音）”，主要见于苏格兰英语方言。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Dialect, chiefly Scots) Harsh or unpleasant to hear; grating or shrill.","zh":"（方言，主要为苏格兰英语）刺耳的；听起来让人不舒服的；尖厉的。"},"examples":[{"en":"Her voice sounded arrish after shouting all day.","zh":"她喊了一整天后，声音听起来很刺耳。"},{"en":"The old radio gave an arrish, crackling noise.","zh":"那台旧收音机发出刺耳的噼啪声。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Rough or harsh in feel; not smooth.","zh":"（较少见）摸起来粗糙的；不平滑的。"},"examples":[{"en":"The wool feels a bit arrish on my skin.","zh":"这羊毛贴在皮肤上有点扎、粗糙。"}]}],"synonyms":["harsh","grating","shrill","rough","scratchy"],"phonetic":"/ˈærɪʃ/","extraExplanation":["“arrish”多见于苏格兰英语/方言写作，表示“刺耳、难听”，有时也可指触感“粗糙”。在现代标准英语里更常用的词是 harsh / grating / shrill（声音），或 rough / scratchy（触感）。","如果你是在名字里看到“Aarish/Arish”等拼写，它们通常是人名或地名，不是这个方言形容词；可以把原句发来我帮你判断。"]}
{"word":"arrisways","summary":{"en":"Arrisways means “edgewise,” with the sharp edge (arris) facing up or outward (an archaic term).","zh":"Arrisways 指“以棱边朝上/朝外、侧立（edgewise）”，偏古语与工艺语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Archaic) With the sharp edge (the “arris”) facing up or outward; edgewise.","zh":"（古语）使（物体）以锐边（棱、棱角）朝上或朝外；侧立、以边朝向某处。"},"examples":[{"en":"Set the stone arrisways so the clean edge faces the street.","zh":"把石块摆成 arrisways，让整齐的棱边朝向街面。"},{"en":"The boards were stacked arrisways to save space.","zh":"木板被侧立堆放（arrisways）以节省空间。"}]}],"synonyms":["edgewise","on edge","arriswise"],"phonetic":"ˈærɪzˌweɪz","extraExplanation":["“Arris”指石材、木材或金属上两面相交形成的“锐棱/棱线”。在砌石、木工等语境里，arrisways（也常见作 arriswise）用来描述“以棱边为主的朝向”。","这是较少见、偏行业且带古典色彩的用法；现代英语更常用 edgewise / on edge 来表达类似意思。"]}
{"word":"arriswise","summary":{"en":"Arriswise means “along the sharp edge (arris) of a piece,” an old term used in building and carpentry.","zh":"Arriswise 指“沿着材料的棱（锐边）方向”，是建筑与木工里较古旧的说法。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Architecture / carpentry, archaic) Along the arris (the sharp edge where two surfaces meet); edgewise.","zh":"（建筑/木工，古旧用法）沿着棱线（两面相交形成的锐边）；以棱边方向、侧着。"},"examples":[{"en":"Set the timber arriswise so the sharp edge faces outward.","zh":"把木料棱朝外摆放，让锐边朝外。"},{"en":"The mason laid the stone arriswise to emphasize a crisp corner.","zh":"泥瓦匠把石块沿棱摆放，以突出清晰的转角。"}]}],"synonyms":["edgewise","along the edge","with the arris outward"],"phonetic":"/ˈærɪzˌwaɪz/","extraExplanation":["“Arris”指两块平面相交形成的“棱/棱角”，常见于建筑、石材与木工语境；“-wise”表示“以……方式/方向”。因此 arriswise = “沿棱/以棱边方向”。","该词较少见，多见于较老的工艺书、建筑说明或描述砌筑/木作做法的文本中。现代英语里更常用 along the edge / edgewise / with the arris facing… 来表达。"]}
{"word":"arrivage","summary":{"en":"Arrivage means a newly arrived shipment or batch of goods, especially in retail or wine/food contexts.","zh":"Arrivage 指“新到的一批货/到货”，常见于零售或葡萄酒、食品等语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a newly arrived shipment or batch of goods; the arrival of merchandise (often used in retail, food, or wine contexts).","zh":"（常用于零售、食品或葡萄酒等语境）新到的一批货；到货；新货到达。"},"examples":[{"en":"The shop is featuring the latest arrivage of spring jackets.","zh":"这家店正在主推最新到货的春季夹克。"},{"en":"Ask the sommelier about the new arrivage of Burgundy wines.","zh":"可以问问侍酒师新到的一批勃艮第葡萄酒。"}]}],"synonyms":["new shipment","new arrival(s)","delivery","consignment","new stock"],"phonetic":"/ˌærɪˈvɑʒ/","extraExplanation":["“arrivage”是从法语借入的词，来自“arriver（到达）”。在英语里多见于较正式或带“精品/高端”风格的商业文案（尤其是时尚、食品、葡萄酒），用来强调“新到货/新一批到达”的感觉。日常英语更常说“new shipment / new arrival(s) / new stock”。"]}
{"word":"arrival","summary":{"en":"Arrival means reaching a place, or (in plural) new people or products that have just come.","zh":"arrival 表示“到达/抵达”，也可指“新到的人或新品（常用复数 new arrivals）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of coming to a place; the moment someone or something reaches a destination","zh":"到达；抵达（到某地的行为或到达的时刻）"},"examples":[{"en":"We waited for her arrival at the airport.","zh":"我们在机场等她到达。"},{"en":"Please call me upon your arrival.","zh":"你一到就请给我打电话。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or thing that has just come to a place (often used in the plural: new arrivals)","zh":"新到的人（或物）；新来者（常用复数 new arrivals）"},"examples":[{"en":"The store has new arrivals for spring.","zh":"这家店上新了春季新品。"},{"en":"New arrivals must register at the front desk.","zh":"新到的人必须在前台登记。"}]}],"synonyms":["arrival time","coming","appearance","entry"],"phonetic":"/əˈraɪvəl/","extraExplanation":["常见搭配：arrival time（到达时间）、arrival gate（到达口/到达闸口）、upon arrival（抵达后/一到就……）、arrival of + 名词（……的到来，如 the arrival of spring 春天的到来）。","词源提示：arrival 来自 arrive（到达）+ -al（名词后缀），表示“到达这一件事”。在写作中也可比喻“某事物的出现/到来”，如 the arrival of a new era（新时代的到来）。"]}
{"word":"arrivals","summary":{"en":"“Arrivals” means people/things that have arrived, or the act/time of arriving (plural of “arrival”).","zh":"“arrivals”是“arrival”的复数，指到达的人/物，或到达这一行为/时间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or things that arrive at a place (often used in travel, airports, hotels, or event settings).","zh":"到达的人或物（常用于旅行、机场、酒店或活动场景）。"},"examples":[{"en":"International arrivals must show their passports at immigration.","zh":"国际到达旅客必须在入境处出示护照。"},{"en":"The hotel is expecting several late-night arrivals.","zh":"酒店预计会有几位深夜到达的客人。"},{"en":"New arrivals in the store are displayed near the entrance.","zh":"店里的新到货陈列在入口附近。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or time of arriving.","zh":"到达这一行为；到达的时间。"},"examples":[{"en":"Her arrival was delayed by a snowstorm.","zh":"由于暴风雪，她的到达被耽搁了。"},{"en":"Upon his arrival, the meeting began.","zh":"他一到达，会议就开始了。"}]}],"synonyms":["newcomers","incoming passengers","arriving passengers","deliveries","arrivals hall"],"phonetic":"/əˈraɪvəlz/","extraExplanation":["“arrivals”是可数名词“arrival”的复数。常见于固定搭配与标识：Arrivals（到达/到达区）与 Departures（出发/出发区），多见于机场、车站的指示牌。","在零售与电商中，“new arrivals”指“新品/新到货”，语气比“new products”更偏向“刚到、刚上架”。"]}
{"word":"arrivance","summary":{"en":"Arrivance is a rare, old-fashioned noun meaning “arrival” or “the act of arriving.”","zh":"Arrivance 是很少见、偏旧式的名词，意思是“到达/抵达（arrival）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of arriving; arrival","zh":"到达；抵达（较少用、偏文学/旧式用法）"},"examples":[{"en":"We waited in silence for the doctor’s arrivance.","zh":"我们默默等待医生的到来。"},{"en":"News of the ship’s arrivance spread quickly through the town.","zh":"那艘船抵达的消息很快传遍了小镇。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or thing that has arrived; a newcomer (rare, archaic)","zh":"到来的人/物；新来者（罕见、旧式用法）"},"examples":[{"en":"The arrivance was greeted with cautious curiosity.","zh":"大家带着谨慎的好奇心迎接这位新来者。"}]}],"synonyms":["arrival","coming","advent","appearance"],"phonetic":"/əˈraɪvəns/","extraExplanation":["“arrivance”在现代英语里非常少见，更常用的是“arrival”。你可能会在较旧的文学作品、历史文本，或刻意使用古风/正式语气的写作中见到它。","词形上，“arrive + -ance”与“appearance / performance”这类名词构词相似，但实际使用频率远低于“arrival”。写作与口语中一般建议用“arrival”，除非你想营造复古或文学效果。"]}
{"word":"arrive","summary":{"en":"Arrive means to reach a place, or (more generally) for a time, event, or conclusion to be reached.","zh":"Arrive 指“到达某地”，也可引申为“某个时刻/事件到来”或“得出结论、作出决定”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to reach a place; to come to a destination","zh":"到达；抵达（某地）"},"examples":[{"en":"What time did you arrive at the airport?","zh":"你几点到机场的？"},{"en":"The train arrives in Boston at 8:30 a.m.","zh":"火车上午8:30到波士顿。"}]},{"partOfSpeech":"vi.","definition":{"en":"to happen or come after a period of waiting or effort (often used with “has arrived”)","zh":"（经过等待或努力后）终于来到/出现（常用“has arrived”表示“已经到来”）"},"examples":[{"en":"At last, the day has arrived.","zh":"终于，这一天到来了。"},{"en":"Success doesn’t arrive overnight.","zh":"成功不会一夜之间到来。"}]},{"partOfSpeech":"vi.","definition":{"en":"to reach a decision, result, or conclusion (often used with “arrive at”)","zh":"得出（结论）；作出（决定）（常与“arrive at”搭配）"},"examples":[{"en":"We arrived at the same conclusion.","zh":"我们得出了相同的结论。"},{"en":"After hours of discussion, they arrived at a decision.","zh":"经过数小时讨论，他们作出了决定。"}]}],"synonyms":["reach","get (to)","come","turn up","show up"],"phonetic":"/əˈraɪv/","extraExplanation":["常见搭配：arrive in + 大地方（城市/国家）如 arrive in New York；arrive at + 小地点/具体点（车站/门口/地址）如 arrive at the station / arrive at 101 Main Street。口语里也常说 arrive home（不加介词）。","和 reach 的区别：reach 常可直接接宾语（reach the station），语气更“到达并触及/达到”；arrive 通常不直接接地点名词，需要 in/at（arrive at the station）。"]}
{"word":"arrived","summary":{"en":"“Arrived” most commonly means “reached a place/time” (past of arrive). It can also mean “successful/recognized” as an adjective.","zh":"“arrived”最常见表示“到达”（arrive 的过去式/过去分词）；也可作形容词表示“功成名就、被认可”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “arrive”: to reach a place, event, or stage (often after traveling or waiting).","zh":"“arrive”的过去式和过去分词：到达某地/某个时刻；（经过旅程或等待后）抵达。"},"examples":[{"en":"We arrived at the airport early.","zh":"我们很早就到达了机场。"},{"en":"The package arrived yesterday.","zh":"包裹昨天到了。"},{"en":"When I arrived home, it was already dark.","zh":"我到家时，天已经黑了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective) successful and accepted as important in society or a profession.","zh":"（形容词）功成名就的；被社会或行业认可的。"},"examples":[{"en":"After her first hit movie, she was considered an arrived actress.","zh":"她第一部卖座电影之后，被认为是功成名就的女演员。"},{"en":"He speaks like someone who’s already arrived.","zh":"他说话的样子像个已经成功的人。"}]}],"synonyms":["reached","got (to)","came","turned up","showed up","made it","successful (adj.)","established (adj.)"],"phonetic":"/əˈraɪvd/","extraExplanation":["作动词时，“arrived”常与介词连用：arrived at（到达小地点/具体点，如 at the station）、arrived in（到达大地点，如 in China）。口语里也常说 arrived home / arrived here / arrived there（home/here/there 前一般不加介词）。","作形容词的“arrived”多见于较正式写作，表示“已成名、已站稳脚跟”，与“just arrived（刚到）”的字面意思不同。"]}
{"word":"arrivederci","summary":{"en":"“Arrivederci” is an Italian word used in English to mean “goodbye,” often with a “see you again” feeling.","zh":"“Arrivederci”是意大利语，在英语中常借用来表示“再见”，并带有“还会再见”的感觉。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"a way to say “goodbye” in Italian (often implying “see you again”)","zh":"意大利语的“再见”（常含“回头见/还会再见”的语气）"},"examples":[{"en":"Arrivederci! See you tomorrow.","zh":"Arrivederci！明天见。"},{"en":"She waved and said, “Arrivederci,” before leaving the café.","zh":"她挥挥手，在离开咖啡馆前说了声“Arrivederci”。"}]}],"synonyms":["goodbye","bye","see you","farewell"],"phonetic":"/ˌɑːrɪvəˈdɛrtʃi/","extraExplanation":["“Arrivederci”来自意大利语，直译可理解为“直到我们再次相遇”。在英语里，它多用于带一点意大利风情、电影感或礼貌氛围的告别语。","常见文化场景：意大利餐厅服务员对客人道别、影视作品中意大利角色告别。英语日常口语里更常用的是“Goodbye/Bye/See you”。","相关表达：意大利语里更随意的“Ciao”既可表示“你好”也可表示“再见”。"]}
{"word":"arrivederla","summary":{"en":"An Italian loanword meaning “goodbye,” often addressed to a woman.","zh":"源自意大利语的借词，意为“再见”，常用于对女性说。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Italian, used in English) “Goodbye,” especially said to or about a woman; literally “until we see (each other) again.”","zh":"（意大利语，英语中也会借用）“再见”，尤其用于对女性说/指女性；字面义为“直到我们再次相见”。"},"examples":[{"en":"Arrivederla, Signora—see you tomorrow.","zh":"Arrivederla，女士——明天见。"},{"en":"He waved and said “arrivederla” as she left the café.","zh":"她离开咖啡馆时，他挥挥手说了一声“arrivederla”。"}]}],"synonyms":["goodbye","farewell","see you","arrivederci"],"phonetic":"/əˌriːvəˈdɛrlə/","extraExplanation":["在意大利语里，通常对女性说 arrivederla，对男性说 arrivederci（英语里也更常见 arrivederci）。在英语语境中使用时，多带一点“欧陆风情/电影感”，常见于戏剧、歌剧、老电影台词或带意大利氛围的场合。"]}
{"word":"arriver","summary":{"en":"Arriver is an uncommon noun meaning “a person who arrives.” In most cases, English prefers newcomer/arrival (person) or arrival (event).","zh":"Arriver 是不常用名词，指“到达的人”。多数情况下英语更常用 newcomer/arrival（人）或 arrival（到来这件事）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon) A person who arrives somewhere; a newcomer or arrival.","zh":"（不常用）到达者；新来的人；来访者。"},"examples":[{"en":"The first arrivers grabbed the best seats near the stage.","zh":"最早到达的人抢到了舞台附近最好的座位。"},{"en":"Please wait here; an usher will guide arrivers to their sections.","zh":"请在这里等候；引座员会带领到达的观众前往各自区域。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare) Something that arrives or is delivered.","zh":"（很少见）到达的事物；送达的物品。"},"examples":[{"en":"The latest arrivers include two packages from the lab.","zh":"最新送达的东西包括实验室寄来的两个包裹。"}]}],"synonyms":["newcomer","arrival","latecomer","visitor"],"phonetic":"/əˈraɪvər/","extraExplanation":["“arriver”在现代英语里非常少见，通常不如用更自然的词：描述“到达的人”多用 newcomer、arrival、latecomer（迟到者），描述“到达/到来”这个动作则用动词 arrive。","如果你想表达“到达（动作）/到达事件”，常用名词是 arrival；例如：His arrival was unexpected（他的到来出乎意料）。","“arriver”也可能是把 arrive（到达）误写成了名词形式；在正式写作中建议避免使用“arriver”。"]}
{"word":"arrivers","summary":{"en":"“Arrivers” means people who arrive somewhere; it’s the plural of “arriver,” a less common word in everyday English.","zh":"“arrivers”指“到达某地的人”，是较少见的名词“arriver”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who arrive somewhere; newcomers who have just come to a place","zh":"到达者；新到的人；刚来的人"},"examples":[{"en":"The arrivers gathered near the station to wait for directions.","zh":"到达的人们在车站附近集合，等待指引。"},{"en":"The host welcomed the arrivers with warm tea and snacks.","zh":"主人用热茶和点心欢迎新到的人。"}]}],"synonyms":["new arrivals","newcomers","arrivals"],"phonetic":"əˈraɪvɚz","extraExplanation":["“arrivers”是名词“arriver”的复数形式，来自动词“arrive（到达）”。在日常英语里，人们更常说“new arrivals（新来的人/新到货）”、“people who arrived（到达的人）”或“newcomers（新人）”；“arriver(s)”相对不那么常见，语气更书面或用于特定语境。"]}
{"word":"arrives","summary":{"en":"“Arrives” means “reaches a place” (or, with “arrive at,” “reaches a decision/answer”).","zh":"“arrives”表示“到达某地”；也可用于“arrive at”表示“得出结论/达成决定”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(third-person singular of “arrive”) to reach a place; to come to a destination.","zh":"（arrive 的第三人称单数）到达；抵达某地。"},"examples":[{"en":"The train arrives at 6:30 p.m.","zh":"火车在下午6:30到达。"},{"en":"She arrives in New York tomorrow.","zh":"她明天到纽约。"},{"en":"When he arrives, call me.","zh":"他一到就给我打电话。"}]},{"partOfSpeech":"phrase","definition":{"en":"(arrive at) to reach a decision, result, or answer after thinking or discussing.","zh":"（arrive at）经过思考或讨论后得出（结论/答案）；达成（决定）。"},"examples":[{"en":"We finally arrived at a solution.","zh":"我们终于想出了解决办法。"},{"en":"How did you arrive at that number?","zh":"你是怎么得出那个数字的？"}]}],"synonyms":["comes","reaches","gets there","turns up","shows up"],"phonetic":"əˈraɪvz","extraExplanation":["“arrive”通常是不及物动词，不直接接宾语：说 *arrive in/at + 地点*（不是 *arrive to*）。一般规则：大地方/城市/国家用 **in**（arrive in China/Shanghai）；具体地点/点位用 **at**（arrive at the station/airport）。","“arrive”比“get (to)”更正式；日常口语常说 *When do you get there?*，更正式或书面语可用 *When do you arrive?*。"]}
{"word":"arriving","summary":{"en":"“Arriving” means coming to a place or happening/appearing, and it’s the -ing form of “arrive.”","zh":"“Arriving”表示“到达/抵达”，也可表示“到来/出现”，是“arrive”的-ing形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"coming to a place at the end of a trip or journey; reaching a destination","zh":"到达（某地）；抵达目的地"},"examples":[{"en":"The train is arriving at Platform 3.","zh":"火车正在到达3号站台。"},{"en":"Please call me when you’re arriving at the airport.","zh":"你到机场时请给我打电话。"}]},{"partOfSpeech":"v.","definition":{"en":"becoming present or happening; appearing (often used for events, seasons, or changes)","zh":"到来；出现（常用于事件、季节或变化）"},"examples":[{"en":"Spring is arriving, and the days are getting longer.","zh":"春天正在到来，白天变长了。"},{"en":"A new opportunity arrived just when she needed it.","zh":"就在她需要的时候，一个新机会出现了。"}]},{"partOfSpeech":"other","definition":{"en":"the present participle of “arrive,” often used in continuous tenses or as an adjective","zh":"“arrive”的现在分词，常用于进行时，或作形容词使用"},"examples":[{"en":"I was arriving home when it started to rain.","zh":"我正要到家时开始下雨了。"},{"en":"Arriving passengers should go through customs.","zh":"到达的乘客应通过海关。"}]}],"synonyms":["coming","reaching","getting to","turning up","appearing"],"phonetic":"/əˈraɪvɪŋ/","extraExplanation":["“Arrive”通常与介词搭配：arrive at + 小地点/具体点（arrive at the station）；arrive in + 大地点（arrive in New York）。表示“到家”常说 arrive home（不加介词）。","“Arriving”也常见于公告与标识：arriving flights（到达航班）、arriving passengers（到达旅客），语气更正式。"]}
{"word":"arrivism","summary":{"en":"Arrivism is aggressive, often criticized ambition aimed at quick success or higher social status.","zh":"Arrivism 指带贬义的急于上位、投机式的野心与社会攀升心态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The behavior or attitude of someone who is aggressively ambitious and tries to gain success or higher social status quickly, sometimes in a way that seems pushy or opportunistic.","zh":"（带贬义）急于出头、拼命往上爬的作风；投机式的野心与“社会攀升”心态。"},"examples":[{"en":"Some critics said the politician’s sudden change of views was pure arrivism.","zh":"一些批评者说，那位政客突然改变立场纯粹是“投机上位”的表现。"},{"en":"In the novel, her arrivism pushes her to abandon old friends for richer connections.","zh":"在小说里，她的“急于攀升”让她为了更有钱的关系而抛弃老朋友。"}]}],"synonyms":["social climbing","opportunism","careerism","pushiness","status-seeking"],"phonetic":"/əˈraɪˌvɪzəm/","extraExplanation":["“arrivism”来自法语词根，常与法语名词“arriviste”（指一心想“爬上去”的野心家/投机者）相关；英语里这个词较少见，多用于较正式或批评性的语境。","语气通常偏负面：强调“急功近利、为上位不择手段”的感觉；与中性的“ambition（抱负）”不同。"]}
{"word":"arrivisme","summary":{"en":"Arrivisme means opportunistic social climbing—seeking status or success by any means, often with a negative tone.","zh":"Arrivisme 指带贬义的“社会攀附/急于出头”：为了地位或成功而投机地不择手段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the practice or attitude of trying to gain social status, power, or success by any means (often seen as opportunistic or overly ambitious social climbing)","zh":"（常带贬义）不择手段地追求社会地位、权力或成功；投机式的“向上爬”（社会攀附）"},"examples":[{"en":"Some critics say the film is a satire of modern arrivisme—people will do anything to get famous.","zh":"一些评论家说这部电影是在讽刺现代的“arrivisme”——人们为了出名什么都愿意做。"},{"en":"In the novel, his arrivisme pushes him to flatter powerful people and betray old friends.","zh":"在小说里，他的“arrivisme”驱使他去奉承权贵、背叛老朋友。"},{"en":"She rejected the culture of arrivisme in the company and focused on doing solid work.","zh":"她拒绝公司里的“arrivisme”风气，专注把工作踏实做好。"}]}],"synonyms":["social climbing","careerism","opportunism","ambition (negative context)"],"phonetic":"/əˌriːˈviːzm/","extraExplanation":["这是一个法语借词，来自 *arriver*（“到达/出头”）的概念，常用来指“想出人头地”的心态，但语气通常偏负面：强调投机、攀附、急功近利。","英语里这个词比较书面、少见，更常用的表达有 *social climbing*（社会攀附）或 *careerism*（事业至上/功利的升迁观）。在文学和社会评论里更容易看到它。"]}
{"word":"arrivist","summary":{"en":"An arrivist is a person eager for higher social status or power, often viewed as pushy or opportunistic.","zh":"arrivist 指急于追求更高社会地位或权势的人，常被认为有些强势或投机（带贬义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is ambitious for social success and tries hard to gain power or status, often in a way that others consider pushy or not fully sincere","zh":"（常带贬义）急于出人头地、拼命往上爬以获取地位或权势的人；野心勃勃的投机上位者"},"examples":[{"en":"Some colleagues saw him as an arrivist who cared more about titles than teamwork.","zh":"有些同事把他看作一个“往上爬的人”，更在乎头衔而不是团队合作。"},{"en":"The novel portrays an arrivist who remakes his image to enter high society.","zh":"这部小说刻画了一个通过重塑形象混入上流社会的投机上位者。"},{"en":"She didn’t want to be labeled an arrivist just for networking with senior leaders.","zh":"她不希望仅仅因为和高层建立人脉就被贴上“投机上位者”的标签。"}]}],"synonyms":["social climber","careerist","opportunist","climber","upstart"],"phonetic":"/ˈærɪvɪst/","extraExplanation":["这个词通常带有“靠手段上位、过度看重名利”的负面评价；强调的是“想进入更高社会阶层的野心与手段”，而不只是一般的“有抱负”。","词源来自法语 *arriver*（到达、获得成功）。在英语里常用于批评社会攀附、势利或投机的行为。","常见文学/文化语境：用来描写“社会攀升者”（social climber）或“野心家”，比如描写通过包装身份、结交权贵进入上流社会的人物类型。"]}
{"word":"arriviste","summary":{"en":"An arriviste is a (often disliked) social climber who has recently gained status and tries hard to enter elite circles.","zh":"arriviste 指（常带贬义的）社会攀附者/暴发户：新近获得地位后努力挤入上层圈子的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a social climber—someone who has recently gained wealth or status and is eager to be accepted by a higher social class (often with a negative judgment)","zh":"（常含贬义）暴发户；社会攀附者；新贵——指刚获得财富或地位、急于进入上层圈子的人"},"examples":[{"en":"The old families dismissed him as an arriviste who didn’t understand their traditions.","zh":"那些老牌家族把他看作一个不懂他们传统的暴发户。"},{"en":"She feared being labeled an arriviste just because her career took off quickly.","zh":"她担心仅仅因为事业起飞得快就被贴上“社会攀附者”的标签。"},{"en":"In the novel, the arriviste tries to buy respect with expensive parties.","zh":"在小说里，这个新贵试图用奢华派对来买到尊重。"}]}],"synonyms":["social climber","upstart","parvenu","nouveau riche"],"phonetic":"/ˌærɪˈvist/","extraExplanation":["“arriviste”来自法语 *arriver*（到达）。在英语里多用于批评语境，强调“地位来得快”但“被认为缺乏教养/底蕴”。在文学与评论写作中常见，用来对比“old money（老钱）/establishment（既得阶层）”与“new money（新钱）”。"]}
{"word":"arrivistes","summary":{"en":"Arrivistes are people seen as pushy newcomers to wealth or high social status, eager for acceptance.","zh":"Arrivistes 指被认为急于跻身上流、带点“攀附”意味的暴发户或新贵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who has recently gained wealth or social position and is seen as pushy or overly eager to be accepted by a higher social class","zh":"（常带贬义）暴发户；新贵；急于跻身上流社会的人"},"examples":[{"en":"Some old-money families looked down on the arrivistes who had made fortunes in technology.","zh":"一些老钱家族看不起那些靠科技发财的新贵。"},{"en":"He was labeled an arriviste because he constantly tried to impress people with his connections.","zh":"他总是拿人脉来炫耀，所以被贴上“急于上位的新贵”的标签。"}]}],"synonyms":["social climber","parvenu","upstart","nouveau riche"],"phonetic":"/ˌærɪˈvist/","extraExplanation":["“arriviste”是从法语借入英语的词，来自“arriver”（到达、成名）。在英语里通常带有轻蔑意味：强调此人“地位上升得很快”，但被认为缺乏传统背景、品味或教养。","常见搭配：an arriviste politician（投机上位的政客）、social arriviste（社交攀附的新贵）。更中性的表达可用“newcomer（新来者）”“newly rich（新近富有的人）”；更口语、更直接的贬义可用“social climber（攀附者）”。","文学/文化语境中常用于描写阶级与身份焦虑：例如谈到“old money vs. new money（旧钱 vs. 新钱）”的主题时，会用arriviste来突出“想挤进圈子”的紧张关系。"]}
{"word":"ARRL","summary":{"en":"ARRL is the American Radio Relay League, a major U.S. organization for amateur (ham) radio.","zh":"ARRL 指美国业余无线电中继联盟，是美国业余无线电领域的重要组织。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"the American Radio Relay League, the main national organization for amateur (ham) radio operators in the United States","zh":"美国业余无线电中继联盟（ARRL），美国最主要的业余无线电（火腿）爱好者全国性组织"},"examples":[{"en":"I joined ARRL to get resources for my first ham radio license.","zh":"我加入了 ARRL，来获取考取第一张业余无线电执照的资料。"},{"en":"ARRL publishes magazines and organizes emergency communication training.","zh":"ARRL 出版杂志，也组织应急通信培训。"},{"en":"The ARRL Field Day event brings operators together to practice communication skills.","zh":"ARRL 的“野外日”（Field Day）活动让操作员聚在一起练习通信技能。"}]}],"synonyms":["American Radio Relay League","the League"],"phonetic":"/ˌeɪ ɑːr ˌɑːr ˈɛl/","extraExplanation":["ARRL 通常读作把字母逐个念出来（A-R-R-L），在邮件、论坛和无线电圈子里很常见。","它与“业余无线电（amateur radio / ham radio）”文化关系密切：强调技术学习、公共服务与应急通信（如灾害时的备份通信）。","在一些语境里，人们也会直接称它为 “the League”（联盟），尤其是在 ARRL 自己的出版物或会员交流中。"]}
{"word":"arroba","summary":{"en":"“Arroba” most commonly means the @ symbol in Spanish/Portuguese, and it can also mean an old unit of weight in Iberian and Latin American history.","zh":"“Arroba” 最常见是指西语/葡语里的“@”符号；也可指伊比利亚及拉丁美洲历史上的一种旧重量单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the “@” symbol, especially in Spanish- and Portuguese-speaking contexts","zh":"“@” 符号；在西班牙语和葡萄牙语语境中常称为“arroba”"},"examples":[{"en":"In Spanish, the @ symbol is often called “arroba.”","zh":"在西班牙语中，“@” 符号常被叫作“arroba”。"},{"en":"Please email me at name@example.com—there’s an arroba between the name and the domain.","zh":"请发邮件到 name@example.com——用户名和域名之间有一个 arroba（@）。"}]},{"partOfSpeech":"n.","definition":{"en":"a traditional unit of weight used in parts of Spain, Portugal, and Latin America (its exact value varies by place and time)","zh":"一种传统重量单位（在西班牙、葡萄牙及拉丁美洲部分地区使用，具体数值因地区与时代而异）"},"examples":[{"en":"The old record lists the shipment as “two arrobas” of coffee.","zh":"旧记录把这批货写成“两 arrobas 的咖啡”。"},{"en":"Different regions used different values for an arroba, so historians often check the local standard.","zh":"不同地区对 arroba 的数值不同，所以历史研究常会核对当地标准。"}]}],"synonyms":["at sign","@"],"phonetic":"/əˈroʊbə/","extraExplanation":["“Arroba” 来自阿拉伯语词源，早先指一种重量/容量单位。后来因为 “@” 符号在商业记账中曾表示“每/按……计价”，在伊比利亚地区逐渐被俗称为 “arroba”。","现代日常里，西语/葡语使用者说 “arroba” 通常就是指电子邮件或社交媒体用户名里的 “@”。"]}
{"word":"arrobas","summary":{"en":"“Arrobas” is the plural of “arroba,” mainly meaning an old Spanish/Portuguese unit of measure; it can also mean multiple “@” symbols in Spanish contexts.","zh":"“arrobas”是“arroba”的复数，主要指旧时西语/葡语地区使用的度量单位；在西语语境中也可指多个“@”符号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish/Portuguese) the plural of “arroba,” a traditional unit of weight or volume used in some Spanish- and Portuguese-speaking regions (amount varies by place and time).","zh":"（西班牙语/葡萄牙语）“arroba”的复数；一种传统的重量或容量单位，曾在部分西语/葡语地区使用（具体数值因地区与历史时期而异）。"},"examples":[{"en":"In old trade records, coffee was sometimes sold by arrobas rather than kilograms.","zh":"在一些旧的贸易记录里，咖啡有时按“arrobas（阿罗巴）”而不是按公斤出售。"},{"en":"The document lists the shipment as 20 arrobas of sugar.","zh":"文件把这批货标为20 arrobas 的糖。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common in English) a plural form used to refer to the “@” symbol (especially in Spanish contexts).","zh":"（在英语中较少见）指“@”符号的复数说法（尤其在西语语境中常见）。"},"examples":[{"en":"Some Spanish speakers may call the @ symbol an “arroba,” so multiple @ signs could be described as “arrobas.”","zh":"一些西语使用者会把@符号称为“arroba”，因此多个@符号可说成“arrobas”。"}]}],"synonyms":["arroba (singular)","@ symbols (for the symbol meaning)"],"phonetic":"/əˈroʊbəz/","extraExplanation":["“arroba”一词源自阿拉伯语 al-rubʿ，意为“四分之一”，历史上常指一“担/一量”的四分之一。由于各地度量衡不统一，所以它在不同国家/时期对应的重量（或容量）不完全相同。","在现代西班牙语里，“arroba”也常用来称呼@符号；这与早期商业记号和度量单位名称在日常语言中的延伸有关。"]}
{"word":"arrode","summary":{"en":"“arrode” is not standard; it’s usually a misspelling of **erode** (“to gradually wear away or weaken”).","zh":"“arrode”不是标准拼写；通常是 **erode** 的误拼，意思是“逐渐侵蚀/削弱”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Common misspelling) Usually intended to be **erode**: to gradually wear away or destroy something (like rock, soil, or trust) over time.","zh":"（常见拼写错误）通常想写的是 **erode**：指随着时间推移逐渐磨损、侵蚀或削弱（如岩石、土壤，或信任等）。"},"examples":[{"en":"Over time, wind and rain can **erode** the coastline.","zh":"随着时间推移，风雨会**侵蚀**海岸线。"},{"en":"Constant criticism can **erode** a child’s confidence.","zh":"持续的批评会**削弱**孩子的自信心。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Transitive) To wear away or reduce something gradually.","zh":"（及物）使某物逐渐被磨损、减少或削弱。"},"examples":[{"en":"The river **eroded** the riverbank after the storm.","zh":"暴风雨后，河水**冲刷侵蚀**了河岸。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Intransitive) To become gradually worn away or reduced.","zh":"（不及物）逐渐被侵蚀、被削弱。"},"examples":[{"en":"The metal will **erode** if it’s exposed to salt water.","zh":"金属如果暴露在盐水中会逐渐**被腐蚀**。"}]}],"synonyms":["wear away","wear down","chip away at","corrode","undermine"],"phonetic":"/ɪˈroʊd/","extraExplanation":["“arrode”不是标准英文单词；学习中更常见的是把 **erode** 拼错（尤其把开头的 e 写成 a，或多写一个 r）。","**erode** 常用于两类语境：①自然过程（侵蚀、冲刷、腐蚀）②抽象事物（信任、权威、支持、信心等被逐渐削弱）。常见搭配：**erode trust/confidence/support**。"]}
{"word":"arrogance","summary":{"en":"Arrogance is an attitude of rude, excessive pride—acting as if you are better than others.","zh":"Arrogance 指带有无礼与过度优越感的“傲慢/自大”，表现为觉得自己比别人更好。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A belief that you are better, more important, or smarter than other people, shown in a rude or overly confident way.","zh":"傲慢；自大（认为自己比别人更好、更重要或更聪明，并以无礼或过度自信的方式表现出来）。"},"examples":[{"en":"His arrogance made it hard for him to listen to advice.","zh":"他的傲慢让他很难听进别人的建议。"},{"en":"She spoke with such arrogance that the team felt disrespected.","zh":"她说话非常傲慢，让团队觉得不被尊重。"},{"en":"Confidence is helpful, but arrogance can push people away.","zh":"自信是有帮助的，但傲慢会把人推开。"}]},{"partOfSpeech":"n.","definition":{"en":"(In a broader sense) an attitude of excessive pride or superiority.","zh":"（更宽泛）过度的骄傲或优越感的态度。"},"examples":[{"en":"The book criticizes the arrogance of those in power.","zh":"这本书批评了掌权者的傲慢。"},{"en":"He apologized for the arrogance of his earlier comments.","zh":"他为自己先前评论中的傲慢道歉。"}]}],"synonyms":["conceit","haughtiness","hubris","superiority","self-importance"],"phonetic":"/ˈerəɡəns/","extraExplanation":["“arrogance”通常带强烈负面评价，常与“rudeness（无礼）”“entitlement（理所当然的优越感）”连用。与“confidence（自信）”不同：自信更偏“相信自己能做到”，而傲慢更偏“看低别人/不愿倾听”。","词源上来自拉丁语 *arrogare*，有“把某种权利/功劳据为己有”的含义，因此也常暗含“自以为应得”的感觉。文学与正式写作中常用来批评权力者或强者的姿态，例如“the arrogance of power（权力的傲慢）”。"]}
{"word":"arrogances","summary":{"en":"“Arrogances” means different acts or attitudes of arrogance (plural of “arrogance”).","zh":"“Arrogances”指“arrogance（傲慢）”的复数，用来强调多种具体的傲慢表现或态度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural form of “arrogance”: attitudes or acts that show an exaggerated sense of one’s own importance and a lack of respect for others","zh":"“arrogance”的复数：多种傲慢的态度或行为，表现出过度自负并缺乏对他人的尊重"},"examples":[{"en":"His small arrogances—interrupting people and refusing advice—made teamwork difficult.","zh":"他那些小小的傲慢——打断别人说话、拒绝建议——让团队合作变得困难。"},{"en":"The novel explores the arrogances of power and wealth.","zh":"这部小说探讨了权力与财富带来的种种傲慢。"}]}],"synonyms":["haughty attitudes","conceits","airs","snobberies","self-importance"],"phonetic":"ˈærəɡənsɪz","extraExplanation":["“Arrogance”通常是不可数名词（uncountable），表示一种“傲慢”这种品质：He spoke with arrogance（他带着傲慢说话）。当用复数“arrogances”时，往往强调“具体表现出来的多种傲慢行为/态度”，常见于写作或较正式的语境。"]}
{"word":"arrogancy","summary":{"en":"“Arrogancy” is a less common form of “arrogance,” meaning an overconfident, disrespectful attitude.","zh":"“arrogancy”是“arrogance”的较少见形式，表示傲慢、自大、轻视他人的态度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Arrogancy: an uncommon word meaning the same as “arrogance”—an attitude of believing you are better or more important than others, often shown in rude or disrespectful behavior.","zh":"arrogancy：不太常用的词，意思同“arrogance”（傲慢、自大）——认为自己比别人更重要/更优秀的态度，常表现为无礼或轻视他人。"},"examples":[{"en":"His arrogancy made it hard for people to work with him.","zh":"他的傲慢让人很难与他共事。"},{"en":"She spoke with such arrogancy that the team felt ignored.","zh":"她说话非常傲慢，团队感觉被无视了。"},{"en":"Try to be confident without arrogancy.","zh":"尽量自信，但不要傲慢。"}]}],"synonyms":["arrogance","conceit","haughtiness","pride"],"phonetic":"/ˈærəɡəns/","extraExplanation":["“arrogancy”在现代英语中较少见，更常用的是“arrogance”。在写作、考试和正式场合建议优先用“arrogance”，以免显得不地道或引起读者困惑。"]}
{"word":"arrogant","summary":{"en":"Arrogant means acting too proud and showing you think you’re better than others.","zh":"Arrogant 指表现得过于自大，觉得自己比别人更厉害、更重要。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having an exaggerated sense of your own importance or ability; behaving as if you are better than others.","zh":"傲慢的；自大的；自以为高人一等的。"},"examples":[{"en":"He sounded arrogant when he said the project would be easy for him.","zh":"他说这个项目对他来说很容易时，听起来很傲慢。"},{"en":"She is confident, not arrogant—she listens to other people’s ideas.","zh":"她很自信，但不傲慢——她会听取别人的想法。"}]}],"synonyms":["conceited","haughty","overbearing","snobbish"],"phonetic":"/ˈærəɡənt/","extraExplanation":["“arrogant”通常是负面评价，强调态度让人不舒服；而“confident（自信的）”更中性或正面，强调相信自己但仍尊重他人。","常见搭配：arrogant attitude（傲慢的态度），arrogant remark/comment（傲慢的话），arrogant tone（傲慢的语气）。"]}
{"word":"arrogantly","summary":{"en":"“Arrogantly” means acting or speaking in a proud, superior way that shows disrespect for others.","zh":"“arrogantly”表示以自大、优越且不尊重他人的方式行事或说话。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows you believe you are better or more important than others; proudly and disrespectfully.","zh":"傲慢地；自大地（表现出认为自己比别人更重要、并带有不尊重的态度）。"},"examples":[{"en":"He spoke arrogantly, as if no one else’s opinion mattered.","zh":"他说话很傲慢，好像别人的意见都不重要。"},{"en":"She arrogantly refused to apologize, even after she was clearly wrong.","zh":"即使她明显错了，她仍傲慢地拒绝道歉。"}]}],"synonyms":["haughtily","conceitedly","superiorly","snobbishly"],"phonetic":"/ˈer.ə.ɡənt.li/","extraExplanation":["“arrogantly”通常带强烈负面评价，表示不仅“自信”，而是把自己放在别人之上，常让人感觉被轻视。与“confidently（自信地）”不同，自信可以尊重他人；傲慢则常缺少尊重。","常见搭配：speak/talk arrogantly（傲慢地说话）、smile arrogantly（傲慢地笑）、dismiss arrogantly（傲慢地否定/打发）。"]}
{"word":"arrogantness","summary":{"en":"Arrogantness means the quality of being arrogant; it’s a less common word than arrogance.","zh":"arrogantness 指“傲慢、自大”的性质；但它不如 arrogance 常用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being arrogant (showing an exaggerated sense of one’s own importance or ability)","zh":"傲慢；自大（过度看重自己的重要性或能力的态度）"},"examples":[{"en":"His arrogantness made it hard for the team to work with him.","zh":"他的傲慢让团队很难和他合作。"},{"en":"She apologized for the arrogantness in her tone.","zh":"她为自己语气里的傲慢道了歉。"}]}],"synonyms":["arrogance","conceit","haughtiness","pride"],"phonetic":"/ˈærəɡəntnəs/","extraExplanation":["“arrogantness”在现代英语里不太常见，更常用的名词是“arrogance”。在正式写作或考试中，通常建议用“arrogance”。","词根提示：arrogant（傲慢的）+ -ness（把形容词变成名词，表示“……的状态/性质”）。"]}
{"word":"arrogare","summary":{"en":"“Arrogare” is a rare Latin-based verb meaning to wrongfully claim or seize power, rights, or privileges for yourself.","zh":"“arrogare”是一个罕见的、带拉丁语色彩的动词，表示不当地据为己有或僭取权力、权利或特权。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare; from Latin) to claim or take something for yourself without having the right to it; to assume or seize a power, title, or privilege.","zh":"（罕见；源自拉丁语）把某物不当地据为己有；擅自占有或僭取（权力、头衔、特权）。"},"examples":[{"en":"He tried to arrogare authority that belonged to the committee.","zh":"他试图僭取本应属于委员会的权力。"},{"en":"In old legal writing, a ruler might arrogare the right to tax without consent.","zh":"在较早的法律文体中，统治者可能会僭取未经同意就征税的权利。"}]}],"synonyms":["arrogate","usurp","seize","claim"],"phonetic":"/ˌærəˈɡɑːreɪ/","extraExplanation":["“arrogare”本来是拉丁语动词不定式，意思接近“为自己主张/据为己有”。现代英语中更常见的是由它演变而来的动词 **arrogate**（arrogate power/rights）。如果你是在英语语境里看到“arrogare”，它多半是引用拉丁原词，或是把“arrogate”误写成了“arrogare”。","用法提示：常见搭配是“arrogate + power/authority/rights”（僭取权力/权威/权利）。语气通常为批评或否定。"]}
{"word":"arrogate","summary":{"en":"“Arrogate” means to take or claim power or rights that you do not have the right to take.","zh":"“Arrogate”指未经允许擅自夺取或自称拥有本不属于自己的权力或权利。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to claim or take (power, rights, or authority) for yourself without permission; to seize something that is not rightfully yours","zh":"（未经允许地）自称或擅自夺取（权力、权利或权威）；僭取"},"examples":[{"en":"The general arrogated more power after the crisis.","zh":"危机之后，那位将军擅自夺取了更多权力。"},{"en":"She was accused of arrogating the right to speak for the whole community.","zh":"她被指责擅自代表整个社区发声。"}]}],"synonyms":["usurp","seize","claim","assume","appropriate"],"phonetic":"/ˈærəˌɡeɪt/","extraExplanation":["词源上与拉丁语相关，核心意思是“把某种权利/头衔/权力要求到自己身上”。它通常带明显的负面评价，常用于正式写作或新闻语体。","常见搭配：arrogate power/authority/rights/the role（僭取权力/权威/权利/角色）。","容易与 arrogant（傲慢的）混淆：arrogate 是“擅自夺取”，arrogant 是“傲慢自大”。两者有关联，但词性与用法不同。"]}
{"word":"arrogated","summary":{"en":"**Arrogated** means “claimed or took for oneself (usually without right or permission),” especially power or authority.","zh":"**arrogated** 指“（通常无权或未经允许地）擅自据为己有”，多用于权力、权利或权限。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle of **arrogate**) to claim or take a right, power, title, or privilege for yourself—especially **without permission** or **without having earned it**.","zh":"（**arrogate** 的过去式/过去分词）把某种权力、权利、头衔或特权据为己有——尤指**未经允许**或**不应得**地擅自占有。"},"examples":[{"en":"He arrogated the authority to fire staff, even though he wasn’t a manager.","zh":"他擅自把解雇员工的权力揽到自己手里，尽管他并不是经理。"},{"en":"The committee arrogated decision-making power that properly belonged to the board.","zh":"该委员会擅自夺取了本应属于董事会的决策权。"}]},{"partOfSpeech":"vt.","definition":{"en":"(less common) to assign or attribute something to yourself, often in a way that sounds unjustified.","zh":"（较少见）把某种功劳、品质或作用归于自己（常带“不太站得住脚”的意味）。"},"examples":[{"en":"She arrogated all the credit for the project’s success.","zh":"她把项目成功的功劳全都归到自己身上。"}]}],"synonyms":["usurped","seized","appropriated","claimed","assumed"],"phonetic":"ˈærəˌɡeɪtɪd","extraExplanation":["“arrogated”常见于正式语境（新闻、政治评论、法律/组织治理等），强调“越权”“僭越”，语气通常偏负面。","词源上与拉丁语 *arrogare*（向自己要求/索取）有关；因此它并不只是“自大”(arrogant) 的意思，而是“把不属于自己的权力/权利拿走”。"]}
{"word":"arrogates","summary":{"en":"“Arrogates” means someone claims or takes power/rights they are not entitled to.","zh":"“arrogates”指某人无正当权利却擅自宣称或夺取权力/权利。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to claim or take (power, rights, or authority) for yourself without a real right to it","zh":"（无正当权利地）擅自把（权力、权利或权威）据为己有；僭取"},"examples":[{"en":"The general arrogated absolute power after the coup.","zh":"政变后，这位将军僭取了绝对权力。"},{"en":"No one should arrogate the right to speak for the entire community.","zh":"任何人都不该擅自把代表整个社群发言的权利据为己有。"},{"en":"He arrogated to himself the authority to approve all decisions.","zh":"他擅自把批准所有决定的权力揽到自己手里。"}]}],"synonyms":["usurps","claims","assumes","seizes","takes"],"phonetic":"ˈærəˌɡeɪts","extraExplanation":["“arrogates”是动词“arrogate”的第三人称单数现在时（he/she/it arrogates）。这个词语体较正式，常见于新闻、政治评论、法律或历史写作中。","常用结构：arrogate something / arrogate to yourself something（如：arrogate to himself the right to…）。语气通常带批评：暗示“自封”“越权”“不当占用”。","词源来自拉丁语 ad-（向、到）+ rogare（提出、要求），后来发展出“强行要求并据为己有”的含义。","近义词提示：claim（声称/主张，中性）、assume（承担/以为，有时中性）、usurp（篡夺，语气更强、更负面）；arrogate介于claim与usurp之间，强调“无权却自认有权”。"]}
{"word":"arrogating","summary":{"en":"“Arrogating” means claiming or taking power, rights, or credit for yourself without proper authority (formal).","zh":"“arrogating”指（正式用语）未经正当授权而擅自攫取/宣称权力、权利或功劳。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(formal) taking or claiming something for yourself, especially power, rights, or credit, without permission or a proper reason.","zh":"（正式用语）把某物（尤指权力、权利或功劳）擅自据为己有；僭取、霸占。"},"examples":[{"en":"The minister was accused of arrogating powers that belonged to Parliament.","zh":"这位部长被指控僭取本应属于议会的权力。"},{"en":"By arrogating all the credit, he hurt the team’s trust.","zh":"他把所有功劳都揽到自己身上，伤害了团队的信任。"}]},{"partOfSpeech":"vt.","definition":{"en":"(formal) assuming or taking on a role, title, or authority for yourself.","zh":"（正式用语）自封；自任（某种角色、头衔或权威）。"},"examples":[{"en":"She resented him arrogating the role of spokesperson.","zh":"她反感他自封为发言人。"}]}],"synonyms":["usurping","appropriating","seizing","claiming","commandeering"],"phonetic":"ˈærəˌɡeɪtɪŋ","extraExplanation":["“arrogating”是动词“arrogate”的现在分词/动名词形式，语气较正式，常见于政治、法律、媒体评论中。它强调“没有正当依据却拿走/宣称”的意味，因此常带批评色彩。可与“claim”（主张）对比：claim不一定表示不正当，而arrogate通常暗示越权或不当。"]}
{"word":"arrogatingly","summary":{"en":"“Arrogatingly” means acting as if you have the right to take or claim power, credit, or privileges that aren’t yours.","zh":"“arrogatingly”表示以越权、擅自占有或冒领的方式行事，仿佛自己有权拿走不属于自己的权力、功劳或特权。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that arrogates something: claiming or taking power, rights, or privileges for yourself without permission; presumptuously.","zh":"以“擅自据为己有/擅权”的方式：未经许可就自作主张地宣称或夺取权力、权利或特权；傲慢而越权地。"},"examples":[{"en":"He spoke arrogatingly, as if the final decision belonged to him alone.","zh":"他说话很越权，好像最终决定只归他一个人。"},{"en":"The manager arrogatingly reassigned other people’s projects without asking.","zh":"经理很擅权地在未征求同意的情况下重新分配了别人的项目。"},{"en":"She arrogatingly took credit for the team’s work.","zh":"她傲慢地把团队的功劳据为己有。"}]}],"synonyms":["presumptuously","high-handedly","self-importantly","imperiously"],"phonetic":"/ˈærəˌɡeɪtɪŋli/","extraExplanation":["“arrogatingly”较少见、偏正式，多用于批评某人“越权/擅自占有”。日常英语里更常用：presumptuously（自以为是地）、self-importantly（自命不凡地）、as if it were his/her right（仿佛理所当然）。","词根来自拉丁语 *arrogare*（把…要求/归为自己），与“arrogant（傲慢的）”同源，但“arrogate”更强调“擅自夺取/冒领权力或功劳”。"]}
{"word":"arrogation","summary":{"en":"Arrogation means wrongfully claiming or taking rights, power, or credit for yourself.","zh":"Arrogation 指未经授权而擅自宣称或据为己有权力、权利或功劳。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Formal, often legal) the act of claiming or taking something (a right, power, title, credit, etc.) for yourself, especially without proper authority.","zh":"（正式，常用于法律）擅自宣称或据为己有（权利、权力、头衔、功劳等），尤指未经正当授权。"},"examples":[{"en":"The report criticized the manager’s arrogation of credit for the team’s work.","zh":"报告批评了那位经理把团队的成果功劳据为己有。"},{"en":"In constitutional debates, some warned against the arrogation of power by the executive branch.","zh":"在宪政辩论中，一些人警告行政部门不要擅权、攫取权力。"}]}],"synonyms":["usurpation","appropriation","seizure (of power)","assumption (of authority)"],"phonetic":"/ˌærəˈɡeɪʃən/","extraExplanation":["“arrogation”语体很正式，常见于政治评论、法律/宪法语境，强调“未经授权而据为己有”。","词源来自拉丁语 *arrogare*（向自己索取/提出要求），与常见词“arrogance（傲慢）”长得像但意思不同：arrogance强调态度；arrogation强调行为（擅取、擅权）。"]}
{"word":"arrogations","summary":{"en":"“Arrogations” means acts of claiming or taking power/rights/titles for yourself, often without permission (formal).","zh":"“Arrogations”指（常带贬义的、正式用语）僭取：未经允许就宣称或夺取权力、权利或头衔的行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of arrogating something—claiming, taking, or assuming a right, power, or title (often without permission)","zh":"僭取；擅自占有（指未经允许就宣称或夺取某种权力、权利或头衔）"},"examples":[{"en":"The committee criticized the CEO’s arrogations of authority that belonged to the board.","zh":"委员会批评了这位CEO僭取本应属于董事会的权力。"},{"en":"History is full of arrogations of land and resources by stronger nations.","zh":"历史上充满了强国对土地与资源的僭取。"}]},{"partOfSpeech":"n.","definition":{"en":"(formal, legal/historical) a formal claim or assumption of a title, role, or privilege","zh":"（正式用语，法律/历史）对头衔、身份或特权的正式主张或擅自认定"},"examples":[{"en":"The court rejected his arrogations of noble rank.","zh":"法院驳回了他对贵族身份的主张。"},{"en":"Such arrogations were common in times of political transition.","zh":"在政治转型时期，这类僭称很常见。"}]}],"synonyms":["usurpations","seizures","appropriations","claims","assumptions (of power)"],"phonetic":"/ˌærəˈɡeɪʃənz/","extraExplanation":["“arrogations”是“arrogation”的复数，较书面、较少见，常出现在政治评论、历史写作或法律语境中。","词源与“arrogate”有关，来自拉丁语 *arrogare*，含义接近“把某物要求到自己名下”。它通常带有负面评价：暗示越权、擅取。"]}
{"word":"arrogative","summary":{"en":"Arrogative means (rarely used) arrogant or presumptuous—acting too proud or as if you’re superior.","zh":"Arrogative 表示（较少用）“傲慢的、自以为是的”，相当于 arrogant / presumptuous。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) overly proud and behaving as if you are better than others; arrogant or presumptuous.","zh":"（较少用）傲慢的；自大的；自以为是的。"},"examples":[{"en":"His arrogative comments made the meeting uncomfortable.","zh":"他那些傲慢的评论让会议气氛很尴尬。"},{"en":"She gave an arrogative smile, as if no one else mattered.","zh":"她露出一种自大的笑容，仿佛别人都不重要。"}]}],"synonyms":["arrogant","presumptuous","haughty","conceited","overbearing"],"phonetic":"/ˈærəˌɡeɪtɪv/","extraExplanation":["“arrogative”在现代英语里比较少见，更常用的是“arrogant”。写作或考试中若想表达“傲慢”，优先选“arrogant / haughty / conceited”。","词根与“arrogate（自称拥有、擅自占有）”有关，带有“把本不属于自己的东西揽到自己身上”的意味，因此可引申为“自大、逾越本分”。"]}
{"word":"arrogator","summary":{"en":"An “arrogator” is a person who wrongfully claims or takes something (especially power, authority, or credit) for themselves.","zh":"“arrogator”指没有正当权利却擅自把某物（尤指权力、权威或功劳）据为己有的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who arrogates something—someone who claims or takes power, rights, credit, or authority for themselves without a proper right","zh":"（arrogate 的名词）擅自占有者；僭取者：指没有正当权利却把权力、权利、功劳或权威据为己有的人"},"examples":[{"en":"The critic called him an arrogator of other people’s ideas.","zh":"评论家称他为“他人思想的僭取者”。"},{"en":"History remembers him less as a leader and more as an arrogator of power.","zh":"历史记住他的与其说是领袖，不如说是僭取权力的人。"},{"en":"In the debate, she accused the company of being an arrogator of public resources.","zh":"在辩论中，她指责那家公司是公共资源的僭取者。"}]}],"synonyms":["usurper","claimant","appropriator","power-grabber"],"phonetic":"/ˈæroʊˌɡeɪtɚ/","extraExplanation":["“arrogator”很少见，更常见的是动词“arrogate”（擅自占有、僭取）或名词“arrogation”。它与常用形容词“arrogant（傲慢的）”同源，但意思不同：arrogate强调“未经允许而据为己有”，arrogant强调“态度自大”。","词源来自拉丁语 *arrogare*（为自己要求/索取）。在法律、政治评论或较正式的写作中更可能出现。"]}
{"word":"arrojadite","summary":{"en":"Arrojadite is a rare phosphate mineral (a mineral group) found mainly in granitic pegmatites.","zh":"Arrojadite 是一种主要产于花岗伟晶岩的稀有磷酸盐矿物（矿物族/系列）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare phosphate mineral (actually a group/series of related minerals) found mainly in granitic pegmatites, typically containing sodium, iron or manganese, and other elements","zh":"一种稀有的磷酸盐矿物（更准确说是一组/一系列相关矿物），主要产于花岗伟晶岩中，通常含有钠、铁或锰等元素"},"examples":[{"en":"Arrojadite is often identified in granitic pegmatites alongside other phosphate minerals.","zh":"Arrojadite 常与其他磷酸盐矿物一起在花岗伟晶岩中被鉴定出来。"},{"en":"The museum label listed the specimen as arrojadite with manganese-rich composition.","zh":"博物馆标签将该标本标注为富锰成分的 arrojadite。"}]}],"phonetic":"/əˈroʊhəˌdiːt/","extraExplanation":["这是矿物学术语，不是日常英语词汇；多见于地质、矿物鉴定、论文或矿物标本说明中。","词名来自人名（Arrojado），用于纪念与地质/矿物学相关的人物；在专业语境里也常见到“arrojadite group（arrojadite 族）”这种说法，强调它是一组成分可变化的矿物。"]}
{"word":"Arron","summary":{"en":"Arron is usually a personal name, commonly a variant spelling of Aaron; it can also be a Scottish place name (e.g., River Arron).","zh":"Arron 通常是人名，多为 Aaron 的变体拼写；也可作苏格兰的地名（如 Arron 河）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A given name (usually male); a less common spelling of Aaron.","zh":"人名（多为男性名）；Aaron 的一种较少见的拼写形式。"},"examples":[{"en":"Arron is starting a new job next week.","zh":"Arron 下周开始新工作。"},{"en":"I think Arron is spelled differently from Aaron, but they sound the same.","zh":"我觉得 Arron 和 Aaron 拼写不同，但读音一样。"}]},{"partOfSpeech":"other","definition":{"en":"A place name, especially in Scotland (e.g., the River Arron); used mainly in geographic contexts.","zh":"地名，尤其见于苏格兰（如 Arron 河）；主要用于地理语境。"},"examples":[{"en":"We hiked near the River Arron in Scotland.","zh":"我们在苏格兰的 Arron 河附近徒步。"}]}],"synonyms":["Aaron"],"phonetic":"/ˈærən/","extraExplanation":["“Arron”在英语里最常见的用法是人名拼写变体。作为姓名时，它通常与“Aaron”同音（在美式英语里多读作/ˈærən/），因此在口语中很难仅凭发音区分拼写。","如果你是在查“Arron”这个名字的来源：更常见的形式“Aaron”在《圣经》中出现较多，因此在英语文化里更常见；“Arron”则更像是个人/家族选择的拼写。"]}
{"word":"arrondi","summary":{"en":"Arrondi means “rounded” or “softly curved,” especially in fashion and design contexts.","zh":"arrondi 表示“圆润的、柔和弧形的”，常用于时尚与设计语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Rounded; having a gently curved outline (often used in fashion, design, or architecture).","zh":"圆润的；呈圆弧形的（常用于时尚、设计或建筑语境）。"},"examples":[{"en":"The jacket has an arrondi shoulder line that looks softer than a sharp cut.","zh":"这件夹克的肩线是圆润的（arrondi），看起来比硬挺的直角剪裁更柔和。"},{"en":"They chose an arrondi arch for the doorway to make the entrance feel welcoming.","zh":"他们为门口选择了圆拱形（arrondi）的门洞，让入口更显亲切。"}]}],"synonyms":["rounded","curved","softly rounded","rounded-off"],"phonetic":"əˈrɑndi","extraExplanation":["“arrondi”源自法语，意思是“变圆、圆形的”。在英语中它多见于较专业或带法式风格的语境（如服装剪裁、室内设计、建筑描述），用来表达“线条圆润、过渡柔和”的感觉。","日常英语里更常用的对应词是 rounded / curved / softly rounded；“arrondi”会显得更“时尚/设计圈”的表达。"]}
{"word":"arrondissement","summary":{"en":"An administrative district in France, especially one of the numbered districts of Paris.","zh":"法国的行政区，尤指巴黎按数字编号划分的各区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A district or administrative division of a city or region in France (and some other French-speaking places).","zh":"（法国及部分法语地区的）区；行政区（城市或地区的行政划分）。"},"examples":[{"en":"Paris is divided into 20 arrondissements.","zh":"巴黎被划分为20个区。"},{"en":"She lives in the 7th arrondissement, near the Eiffel Tower.","zh":"她住在第七区，靠近埃菲尔铁塔。"}]},{"partOfSpeech":"n.","definition":{"en":"In France, an administrative subdivision of a department (a level of government below the department).","zh":"（法国行政体系中）省（department）下一级的行政分区。"},"examples":[{"en":"The prefecture announced changes for the arrondissement.","zh":"省政府（行政机关）宣布了该行政分区的调整。"},{"en":"This town is the seat of its arrondissement.","zh":"这个城镇是该行政分区的驻地（行政中心）。"}]}],"synonyms":["district","borough (approx.)","administrative district"],"phonetic":"/ˌærɑnˈdɪsmənt/","extraExplanation":["“Arrondissement”是法语借词，在英语里多用于谈法国地理、旅游、历史或行政体系。日常英语中很少用来指其他国家的“区”，除非该地也采用法语行政术语。","巴黎的“区”常用数字表示（1st, 2nd, 3rd… arrondissement）。有时也会说“the 1st”来指“the 1st arrondissement”，但在正式或清晰表达时仍建议说完整。","在文化语境里，巴黎各区常与不同气质联想在一起（例如时尚、政商、艺术、移民社区等），旅游攻略和文学作品中也常借“arrondissement”来暗示氛围与阶层。"]}
{"word":"arrondissements","summary":{"en":"“Arrondissements” are French administrative districts, especially the numbered districts of Paris.","zh":"“Arrondissements”指法国的行政区，尤指巴黎按号码划分的各区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Administrative districts (official divisions) in France, especially the numbered districts of Paris; also used for similar divisions in some French-speaking places.","zh":"（法国的）行政区；尤指巴黎按号码划分的各区；也可指其他法语地区类似的行政分区。"},"examples":[{"en":"Paris is divided into 20 arrondissements, each with its own character.","zh":"巴黎分为20个区（arrondissements），每个区都有自己的特色。"},{"en":"Their hotel was in the 7th arrondissement, near the Eiffel Tower.","zh":"他们的酒店在巴黎第七区，靠近埃菲尔铁塔。"},{"en":"Local services are often organized at the arrondissement level.","zh":"地方服务常常按行政区（arrondissement）的层级来组织。"}]}],"synonyms":["districts","boroughs (approx.)","administrative divisions"],"phonetic":"əˌrɑːnˈdiːsmənts","extraExplanation":["“Arrondissement”是法语外来词，英文里常直接借用，尤其在旅游、新闻与法国相关语境中出现。单数是 arrondissement，复数可写作 arrondissements。","在巴黎，arrondissements按1到20编号，通常从市中心向外呈“蜗牛壳/螺旋”式排列。常见表达如“the 5th arrondissement / the 5th (five)”。","注意不要把 arrondissement 和“neighborhood（街区）”完全等同：前者是官方行政区，后者更偏生活与文化上的区域概念。"]}
{"word":"arrope","summary":{"en":"Arrope is a thick grape-must syrup used as a traditional sweetener or sauce in Spanish/Latin American cooking.","zh":"Arrope 指把葡萄汁（葡萄浆）熬煮浓缩成的浓稠糖浆，常用于西班牙/拉美传统料理作甜味剂或淋酱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a thick syrup made by slowly boiling down grape juice (grape must), used as a sweetener or sauce in some Spanish- and Latin American cuisines","zh":"（尤指西班牙及拉美部分地区的）阿罗佩：把葡萄汁（葡萄浆/葡萄酒醪）慢慢熬煮浓缩成的浓稠糖浆，用作甜味剂或淋酱"},"examples":[{"en":"In some traditional desserts, arrope is drizzled over cheese or fruit.","zh":"在一些传统甜点里，人们会把 arrope 淋在奶酪或水果上。"},{"en":"The cook reduced fresh grape must into arrope until it became dark and thick.","zh":"厨师把新鲜葡萄浆慢慢熬到颜色变深、变稠，做成了 arrope。"}]}],"synonyms":["grape syrup","boiled grape must","grape molasses"],"phonetic":"/əˈroʊpeɪ/","extraExplanation":["“Arrope”是西班牙语外来词，在英语里相对少见，多出现在美食语境（菜单、食谱、地方饮食介绍）中。","它通常指“葡萄汁/葡萄酒醪（must）熬成的糖浆”，有时不同地区也会用它指其他水果的浓缩糖浆；遇到食谱时可根据原料说明来判断。","在西班牙部分地区，常见搭配包括奶酪、面包点心或作为甜味来源；也可能作为料理中的甜酸平衡元素。"]}
{"word":"arrosion","summary":{"en":"Arrosion is a rare word meaning gradual wearing away, especially of body tissue; in everyday English, people usually say erosion or corrosion.","zh":"Arrosion 是个较罕见的词，指逐渐磨损/侵蚀（尤指组织）；日常英语更常用 erosion 或 corrosion。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/technical) the gradual wearing away or eating away of a surface, especially body tissue (similar to erosion or corrosion).","zh":"（罕见/术语）逐渐磨损、侵蚀或“蚀损”表面，尤指身体组织的被侵蚀（类似 erosion / corrosion）。"},"examples":[{"en":"The doctor noted a small arrosion on the lining of the stomach.","zh":"医生记录到胃黏膜上有一处小的侵蚀（蚀损）。"},{"en":"Continuous rubbing can cause arrosion of the skin.","zh":"持续摩擦会造成皮肤的磨损/侵蚀。"}]}],"synonyms":["erosion","corrosion","abrasion","ulceration"],"phonetic":"/əˈroʊʒən/","extraExplanation":["“arrosion”在现代英语中很少见，更多出现在医学或较旧的学术写作里，常指组织表面被“蚀掉/磨掉”的过程或结果。日常英语中更常用的是“erosion”（自然/逐渐侵蚀）和“corrosion”（化学腐蚀，尤指金属）。","如果你本来想查的是“erosion”，它在地理与环境语境里非常常见（例如 soil erosion 土壤侵蚀）。拼写上“arrosion”容易被当作“erosion”的误拼。"]}
{"word":"arrosive","summary":{"en":"“Arrosive” is not a standard word; it is usually a misspelling of “erosive” (“wearing away gradually”).","zh":"“arrosive” 不是标准词；通常是把 “erosive”（逐渐侵蚀/削弱的）拼错了。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard) A common misspelling of “erosive,” meaning something that gradually wears away or weakens a surface, substance, or situation.","zh":"（非标准用法）常见的拼写错误，通常想写的是 “erosive”，表示会逐渐侵蚀、磨损或削弱某物（或某种情况）。"},"examples":[{"en":"“Arrosive” isn’t standard English; in most cases, you want “erosive.”","zh":"“arrosive” 不是标准英语；大多数情况下你想写的是 “erosive”。"},{"en":"Acid rain can have an erosive effect on stone buildings.","zh":"酸雨会对石质建筑产生侵蚀作用。"},{"en":"Constant criticism can be erosive to a team’s confidence.","zh":"持续的批评会逐渐削弱团队的信心。"}]}],"synonyms":["eroding","wearing","abrasive","corrosive (related but not the same)"],"phonetic":"/ɪˈroʊsɪv/","extraExplanation":["“erosive” 常用于两类语境：\n1）自然/材料：风化、流水、冰川等造成的侵蚀（erosion）；\n2）抽象/社会语境：逐步削弱信任、信心、关系（an erosive effect）。\n\n容易混淆的词还有 “corrosive”（腐蚀性的），更常指化学腐蚀（酸、碱等）或“言语尖刻、伤人的”（corrosive remarks）。"]}
{"word":"arround","summary":{"en":"“Arround” is a misspelling of “around,” meaning surrounding, in various places/nearby, or approximately.","zh":"“arround” 是 “around” 的错误拼写；around 可表示“在……周围/四处（附近）/大约”。"},"definitions":[{"partOfSpeech":"prep.","definition":{"en":"(Correct spelling: around) in a position surrounding someone or something; on every side.","zh":"（正确拼写：around）在……周围；环绕在……四周。"},"examples":[{"en":"There are trees all around the house.","zh":"房子周围都是树。"},{"en":"She looked around the room for her keys.","zh":"她环顾房间找钥匙。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Correct spelling: around) to or in different places; here and there; nearby (often used with verbs like walk, move, hang).","zh":"（正确拼写：around）到处；在附近；四处（常与 walk / move / hang 等动词搭配）。"},"examples":[{"en":"We walked around for an hour before finding the café.","zh":"我们四处走了一个小时才找到那家咖啡馆。"},{"en":"Are you going to be around later?","zh":"你晚点会在附近吗？"}]},{"partOfSpeech":"adv.","definition":{"en":"(Correct spelling: around) approximately; about (used with numbers and amounts).","zh":"（正确拼写：around）大约；差不多（用于数字、数量）。"},"examples":[{"en":"It costs around $20.","zh":"它大约20美元。"},{"en":"The meeting will take around thirty minutes.","zh":"会议大概会持续三十分钟。"}]}],"synonyms":["about","approximately","nearby","round"],"phonetic":"/əˈraʊnd/","extraExplanation":["“arround” 是拼写错误，标准拼写是 “around”。只有一个 r：a + round。可以把它记成 round（圆的、环绕的）前面加 a-。"]}
{"word":"arrouse","summary":{"en":"Arouse means to wake someone up or to cause feelings (like interest, anger, or desire) to begin or grow stronger.","zh":"Arouse 指“唤醒”或“引起/激起”某种情绪、兴趣或欲望。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to wake someone up or cause someone to become active or alert","zh":"唤醒；使（某人）变得警觉或开始行动"},"examples":[{"en":"The loud noise aroused the baby from sleep.","zh":"巨大的噪音把宝宝吵醒了。"},{"en":"The coach’s speech aroused the team and they played with more energy.","zh":"教练的讲话激起了球队的斗志，他们打得更有劲。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cause a feeling, interest, or reaction to start or become stronger","zh":"引起（情绪/兴趣/反应）；激起"},"examples":[{"en":"The documentary aroused public concern about the environment.","zh":"这部纪录片引起了公众对环境问题的担忧。"},{"en":"Her question aroused my curiosity.","zh":"她的问题激起了我的好奇心。"},{"en":"The decision aroused anger among residents.","zh":"这个决定引起了居民的愤怒。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cause sexual excitement (used in medical, psychological, or careful contexts)","zh":"使产生性兴奋（多用于医学、心理学或较谨慎的语境）"},"examples":[{"en":"The article discusses factors that can arouse desire.","zh":"文章讨论了可能引发性欲的因素。"},{"en":"Some medications may affect the ability to become aroused.","zh":"一些药物可能会影响产生性兴奋的能力。"}]}],"synonyms":["awaken","rouse","stir","spark","trigger","provoke","excite"],"phonetic":"/əˈraʊz/","extraExplanation":["你输入的 **arrouse** 通常是拼写错误；正确拼写是 **arouse**（只有一个 r）。","常见搭配：**arouse interest/curiosity/anger/suspicion**（引起兴趣/好奇/愤怒/怀疑），**arouse someone from sleep**（把某人从睡梦中叫醒）。","语体提示：表示“性唤起”的意思时比较敏感，正式写作中常见于医学或心理学语境；日常表达可根据场合选择更委婉的说法。"]}
{"word":"arrow","summary":{"en":"Arrow most commonly means the projectile shot from a bow, and it also means a directional symbol (→). As a verb, it can mean to move quickly and straight.","zh":"arrow最常见指“箭”，也可指“箭头/方向符号（→）”；作动词时可表示“像箭一样迅速直奔”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A weapon or tool: a thin, straight stick with a sharp point, shot from a bow.","zh":"箭；（用弓射出的）细长直杆，前端尖锐的武器或工具。"},"examples":[{"en":"The hunter lifted his bow and released an arrow.","zh":"猎人举起弓，放出一支箭。"},{"en":"The arrow hit the target near the center.","zh":"箭射中了靶心附近。"}]},{"partOfSpeech":"n.","definition":{"en":"A symbol or sign that shows direction (→), often used on maps, screens, and road signs.","zh":"箭头；表示方向的符号（→），常见于地图、屏幕和路标上。"},"examples":[{"en":"Follow the arrow to find the exit.","zh":"沿着箭头指示找到出口。"},{"en":"Click the arrow to go back to the previous page.","zh":"点击箭头返回上一页。"}]},{"partOfSpeech":"v.","definition":{"en":"To move very quickly and directly toward a place or goal.","zh":"（迅速而笔直地）冲向；直奔（某处或目标）。"},"examples":[{"en":"She arrowed across the street to catch the bus.","zh":"她飞快地穿过马路去赶公交车。"}]}],"synonyms":["bolt","shaft","pointer","direction marker"],"phonetic":"/ˈæroʊ/","extraExplanation":["“Arrow”作动词比较文学化、不如“run/dash/rush”常用，常用来强调“像箭一样又快又直”的动作。","在文学与文化中，“arrow”常象征方向、命运或爱情（如“Cupid’s arrow”丘比特之箭，象征爱神让人坠入爱河）。"]}
{"word":"arrowbush","summary":{"en":"Arrowbush is a desert riverside shrub whose straight stems were traditionally used for making arrow shafts.","zh":"Arrowbush 指一种生长在沙漠河岸的灌木，因枝条笔直、传统上可用来制作箭杆而得名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a shrub (especially Pluchea sericea, common in the southwestern U.S.) that grows near desert rivers and wetlands; its straight stems were traditionally used to make arrow shafts.","zh":"一种灌木（常指美国西南部的“箭灌木/箭草”Pluchea sericea），多生于沙漠河岸与湿地；其较直的枝条传统上可用来制作箭杆。"},"examples":[{"en":"Arrowbush often grows in thick stands along desert riverbanks.","zh":"箭灌木常常在沙漠河岸边成片生长。"},{"en":"Historically, people cut arrowbush stems and shaped them into arrow shafts.","zh":"在历史上，人们会砍下箭灌木的枝条，修整成箭杆。"}]}],"synonyms":["arrowweed"],"phonetic":"ˈæroʊˌbʊʃ","extraExplanation":["“arrowbush”是常见名，不同地区可能指不同植物；在北美语境里常与“arrowweed（箭草）”相近或互指。","词形很好理解：arrow（箭）+ bush（灌木）。名称通常来自其枝条适合做箭杆这一传统用途。"]}
{"word":"arrowed","summary":{"en":"“Arrowed” usually means “marked with arrows” (common in diagrams and signs). It can also be the rare past form of “arrow,” meaning to shoot with an arrow or move straight and fast.","zh":"“arrowed”通常指“用箭头标出的”（常见于图示和标志）。也可作少见动词“arrow”的过去式，表示“用箭射”或“像箭一样快速笔直地移动”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Often in signs, diagrams, or maps) marked with an arrow or arrows to show direction or highlight something.","zh":"（常用于标志、图示或地图）用箭头标出，用来指示方向或强调某处。"},"examples":[{"en":"Follow the arrowed path to the exit.","zh":"沿着用箭头标出的路线走到出口。"},{"en":"The manual shows an arrowed line pointing to the reset button.","zh":"说明书里有一条带箭头的线指向重置按钮。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “arrow” (rare): to shoot with an arrow; or to move quickly and directly like an arrow.","zh":"“arrow”的过去式/过去分词（较少见）：用箭射；或像箭一样快速、笔直地移动。"},"examples":[{"en":"In the story, the hunter arrowed a deer from behind a tree.","zh":"在故事里，猎人从树后用箭射中了一只鹿。"},{"en":"Her glance arrowed across the room toward him.","zh":"她的目光像箭一样迅速地扫过房间，落在他身上。"}]}],"synonyms":["marked","pointed","indicated","directed"],"phonetic":"/ˈæroʊd/","extraExplanation":["“arrowed”最常见的用法是形容词，尤其在指示牌、地图、说明书里：arrowed exit（箭头标示的出口）、arrowed route（用箭头标出的路线）。","动词“to arrow”在现代英语里不常用；文学或描写性语境中偶尔会用来表示“像箭一样直冲/目光直指”。"]}
{"word":"arrowhead","summary":{"en":"An arrowhead is the pointed tip of an arrow, or anything shaped like that point; it can also refer to a plant with arrow-shaped leaves.","zh":"arrowhead 指箭的尖头，也可指箭头形图案/符号；还可指叶片呈箭头形的水生植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the pointed (often stone or metal) tip of an arrow, designed to cut or pierce","zh":"箭的尖头（常为石或金属制），用于切割或穿刺"},"examples":[{"en":"The hunter replaced the broken arrowhead before going out again.","zh":"猎人在再次出发前更换了断裂的箭头。"},{"en":"Archaeologists found several stone arrowheads near the river.","zh":"考古学家在河边发现了几枚石制箭头。"}]},{"partOfSpeech":"n.","definition":{"en":"a shape like an arrow point, often used in signs, logos, or patterns","zh":"箭头形状（类似箭尖的图形），常用于标志、图案或指示"},"examples":[{"en":"Follow the arrowhead symbol to find the exit.","zh":"跟着箭头标志就能找到出口。"},{"en":"The carpet has repeating arrowhead patterns along the edge.","zh":"地毯边缘有重复的箭头图案。"}]},{"partOfSpeech":"n.","definition":{"en":"a kind of aquatic plant with arrow-shaped leaves (often called arrowhead; genus Sagittaria)","zh":"一种水生植物，叶子呈箭头状（常称“慈姑/箭叶慈姑”，多指慈姑属 Sagittaria）"},"examples":[{"en":"Arrowhead plants grow well in shallow ponds.","zh":"箭叶慈姑类植物在浅水池里长得很好。"}]}],"synonyms":["arrow tip","point","barb","arrowhead symbol"],"phonetic":"/ˈæroʊˌhɛd/","extraExplanation":["在北美语境里，stone arrowheads（石箭头）常与原住民历史与考古发现相关；在博物馆或新闻报道中常见这个搭配。提到相关文化时，使用“Indigenous/Native American artifacts（原住民文物）”等更尊重的表达，并避免把文物当作随意收藏品。"]}
{"word":"arrowheaded","summary":{"en":"Arrowheaded means “shaped like an arrowhead.”","zh":"arrowheaded 表示“箭头形的；像箭镞一样的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shaped like an arrowhead (broad near the base and pointed at the tip).","zh":"箭头形的；像箭镞（箭头）一样的（底部较宽、尖端较尖）。"},"examples":[{"en":"The archaeologist found an arrowheaded stone tool.","zh":"考古学家发现了一件箭头形的石器。"},{"en":"An arrowheaded leaf often has two small lobes near its base.","zh":"箭头形的叶子通常在叶基部有两个小裂片。"}]}],"synonyms":["arrowhead-shaped","pointed","spear-shaped"],"phonetic":"/ˈæroʊˌhɛdɪd/","extraExplanation":["“arrowheaded”也常写作“arrow-headed”。两种写法都常见；作定语时用连字符（arrow-headed）更常见，尤其在正式写作中。","在植物学/自然描写里，它常用来描述“箭头形叶”（arrowhead-shaped leaves），例如一些泽泻属等水生植物的叶形。"]}
{"word":"arrowheads","summary":{"en":"Arrowheads are the pointed tips of arrows, or arrow-shaped symbols; the word can also refer to a wetland plant with arrow-shaped leaves.","zh":"arrowheads 指“箭头/箭的尖端”，也可指“箭头形符号/图案”；有时也指一种叶片呈箭头形的湿地植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The pointed tip of an arrow (often made of stone, metal, or bone).","zh":"箭头；箭的尖端（常用石、金属或骨制成）。"},"examples":[{"en":"Archaeologists found several stone arrowheads near the river.","zh":"考古学家在河边发现了几枚石制箭头。"},{"en":"He carefully cleaned the arrowheads before putting them on display.","zh":"他小心清理这些箭头，然后把它们陈列起来。"}]},{"partOfSpeech":"n.","definition":{"en":"A leaf shape or symbol that looks like the head of an arrow.","zh":"箭头形状；箭头状的符号/图案。"},"examples":[{"en":"The road sign uses arrowheads to show the direction of traffic.","zh":"路标用箭头形符号来指示车流方向。"},{"en":"In the diagram, small arrowheads show the direction of the force.","zh":"在示意图中，小箭头表示力的方向。"}]},{"partOfSpeech":"n.","definition":{"en":"A wetland plant (also called arrowhead) with arrow-shaped leaves; it can have edible tubers.","zh":"慈姑属水生植物（也叫“箭叶慈姑/箭叶植物”），叶子呈箭头形；块茎有的可食用。"},"examples":[{"en":"Arrowheads grow in shallow water along the edge of the pond.","zh":"箭叶植物生长在池塘边的浅水处。"},{"en":"We saw white arrowhead flowers in the marsh.","zh":"我们在沼泽里看到了白色的箭叶植物花。"}]}],"synonyms":["arrow tips","points","barbs","tips","arrow-shaped symbols"],"phonetic":"ˈæroʊˌhɛdz","extraExplanation":["“arrowhead(s)”在考古语境中非常常见，常指史前人类用燧石等材料打制的“石镞/石箭头”，有时也被用来帮助判断遗址年代与文化类型。","在理工科图示里，arrowheads 常指向量箭头末端的三角形尖端，用来明确方向（如力、速度、磁场等）。","“arrowhead”也可见于装饰图案、徽章与纹样设计中，用来表达“方向、进攻、前进”等意象。"]}
{"word":"arrowing","summary":{"en":"Arrowing usually means shooting arrows, or moving swiftly and straight like an arrow.","zh":"Arrowing通常指“射箭”，也可形容“像箭一样又快又直地前进/冲去”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of shooting or sending arrows; archery in action","zh":"射箭；放箭（指正在进行的射箭行为）"},"examples":[{"en":"During the festival, there was arrowing on the practice field all afternoon.","zh":"节日期间，练习场上整个下午都有人在射箭。"},{"en":"Safe arrowing requires clear rules and a protected range.","zh":"安全的射箭需要明确规则和受保护的靶场。"}]},{"partOfSpeech":"adj.","definition":{"en":"moving straight and fast like an arrow; darting forward","zh":"像箭一样笔直而迅速地前进；疾驰"},"examples":[{"en":"A small fish went arrowing through the water.","zh":"一条小鱼像箭一样穿过水中。"},{"en":"She ran, arrowing down the hallway toward the door.","zh":"她沿着走廊朝门口直冲过去。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “arrow”: to travel or shoot forward quickly and directly","zh":"“arrow”的现在分词：快速、笔直地向前冲/射出"},"examples":[{"en":"The hawk was arrowing toward its prey.","zh":"鹰正朝猎物俯冲而去。"},{"en":"Light was arrowing in through a crack in the curtains.","zh":"一道光从窗帘的缝隙里直射进来。"}]}],"synonyms":["shooting","archery","darting","streaking","rushing"],"phonetic":"/ˈæroʊɪŋ/","extraExplanation":["“arrowing”常见于描写性写作（小说、诗歌、体育解说）中，用来营造“直线、迅猛、带目标感”的画面。它比单纯的“moving fast”更强调方向很直、动作像箭一样“射出去”。"]}
{"word":"arrowleaf","summary":{"en":"Arrowleaf describes arrow-shaped leaves and is also used in plant names for species with that leaf shape.","zh":"arrowleaf 指“箭叶的（叶片像箭头）”，也常作植物俗名的一部分，泛指具有箭头形叶子的植物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having leaves shaped like an arrowhead (pointed with two smaller points near the base).","zh":"（叶子）箭头形的；叶片形状像箭头（前端尖、基部两侧有小裂片）。"},"examples":[{"en":"Arrowleaf plants are easy to recognize by their arrow-shaped leaves.","zh":"箭叶植物很容易通过它们箭头形的叶子辨认出来。"},{"en":"We found an arrowleaf wildflower along the trail.","zh":"我们在小径旁发现了一种箭叶野花。"}]},{"partOfSpeech":"n.","definition":{"en":"A plant (or group name in common names) with arrow-shaped leaves, often used in names of wildflowers and aquatic plants.","zh":"箭叶植物（常见名用法）：指叶片呈箭头形的一类植物，常见于野花或水生植物的俗名中。"},"examples":[{"en":"Arrowleaf is common in plant names, like arrowleaf balsamroot.","zh":"“arrowleaf”常出现在植物俗名里，比如“arrowleaf balsamroot（箭叶香根菊/箭叶香脂根）”。"},{"en":"In the marsh, we saw arrowleaf growing in shallow water.","zh":"在沼泽里，我们看到浅水处长着箭叶植物。"}]}],"synonyms":["arrow-shaped","sagittate (more technical)"],"phonetic":"/ˈæroʊˌlif/","extraExplanation":["“arrowleaf”多用于植物学或自然观察语境，常作为复合词的一部分（如 arrowleaf balsamroot、arrowleaf milkweed）。在北美语境中，你会在野外识别手册、步道解说牌或园艺资料里经常见到它。","与“arrowhead”相关：arrowhead 既可指“箭头”，也常用作某些箭叶水生植物的俗名（如慈姑属 Sagittaria）。因此在自然语境里，arrowleaf（箭叶的）和 arrowhead（箭头/箭叶植物）容易一起出现。"]}
{"word":"arrowless","summary":{"en":"“Arrowless” means lacking arrows, and can also suggest lacking clear direction.","zh":"“arrowless”表示“没有箭的/缺少箭的”，也可引申为“缺乏明确方向或指引”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without an arrow or arrows; lacking arrows (literally or figuratively “without direction/pointing”).","zh":"没有箭的；缺少箭（也可引申为“没有方向/指向性”）。"},"examples":[{"en":"The arrowless bow looked ceremonial, not meant for hunting.","zh":"这把没有箭的弓看起来更像是礼仪用的，并不是用来打猎的。"},{"en":"Without street signs, the road felt arrowless and confusing.","zh":"没有路牌，这条路感觉“没有指引”，让人很困惑。"}]}],"synonyms":["without arrows","lacking arrows","arrow-free","directionless (figurative)"],"phonetic":"/ˈæroʊləs/","extraExplanation":["“arrowless”= arrow + -less。后缀 -less 表示“没有/缺乏”（如: homeless 无家可归的，careless 粗心的）。因此它多用于描述“缺少某物”的状态。","这个词在日常英语里不算常见，更常见的表达是 “without arrows” 或 “lacking arrows”。在写作中用 “arrowless” 往往带有更强的画面感或比喻色彩。"]}
{"word":"arrowlet","summary":{"en":"Arrowlet means a small arrow, usually in poetic or old-fashioned contexts.","zh":"arrowlet 指“小箭”，多见于诗歌或较古旧的语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small arrow; a little arrow (often used in poetic or old-fashioned writing).","zh":"小箭；小小的箭（常见于诗歌或较古旧的用法）。"},"examples":[{"en":"In the old tale, the hunter carried a quiver of arrowlets for small game.","zh":"在那则古老的故事里，猎人带着一筒小箭来打小型猎物。"},{"en":"The poet compared her sharp words to arrowlets that still could sting.","zh":"诗人把她犀利的话比作小箭，虽然小却依然刺痛人心。"}]}],"synonyms":["small arrow","little arrow"],"phonetic":"/ˈæroʊlət/","extraExplanation":["“arrowlet”由“arrow（箭）+ -let（指小的后缀）”构成，语气带有“更小、更轻”的感觉，常用于文学或描述性文字中。现代日常英语里更常说“small arrow”。"]}
{"word":"arrowlike","summary":{"en":"Arrowlike means shaped like an arrow—long, narrow, and pointed.","zh":"arrowlike 指“箭状的”，像箭一样细长并带尖端。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shaped like an arrow; long and narrow, often pointed at one end.","zh":"箭状的；像箭一样的（通常细长、末端尖）。"},"examples":[{"en":"The plant has arrowlike leaves that taper to a sharp point.","zh":"这种植物的叶子呈箭状，逐渐变细并形成尖端。"},{"en":"An arrowlike symbol on the screen shows the direction you should move.","zh":"屏幕上的箭状符号显示你应该移动的方向。"}]}],"synonyms":["arrow-shaped","pointed","tapering","lance-shaped"],"phonetic":"ˈæroʊˌlaɪk","extraExplanation":["“arrowlike”也常写作“arrow-like”（更常见、也更符合规范写法），表示“像箭一样的形状”。在学术或说明性文字中常用来描述叶片、晶体、图案、符号等外形。"]}
{"word":"arrowplate","summary":{"en":"An arrow plate is a flat sign or label with an arrow used to indicate direction or position.","zh":"arrow plate 指带箭头的平板标识，用来指示方向或位置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flat piece of metal or plastic that has an arrow symbol on it, used as a sign, label, or indicator to show direction or position (often written as two words: “arrow plate”).","zh":"带有箭头标记的平板（多为金属或塑料），用作标牌、标签或指示器来表示方向或位置（常写作两个词：arrow plate）。"},"examples":[{"en":"Follow the arrow plate to find the emergency exit.","zh":"跟着箭头指示牌就能找到紧急出口。"},{"en":"The technician replaced the worn arrow plate on the control panel.","zh":"技术员更换了控制面板上磨损的箭头标识板。"}]}],"synonyms":["arrow sign","directional plate","indicator plate","arrow label"],"phonetic":"/ˈæroʊˌpleɪt/","extraExplanation":["“arrowplate”不是非常常见的通用词，更常见写法是分开写作“arrow plate”。在不同领域里它可能指：道路/公共设施上的方向指示小牌、机器面板上的方向/位置标识板、或某些五金配件里带箭头的定位板。具体含义通常要看使用场景（如交通、机械、门锁五金等）。"]}
{"word":"arrowroot","summary":{"en":"Arrowroot is a tropical plant and, more commonly, a fine starch from its roots used to thicken food.","zh":"arrowroot 指一种热带植物（竹芋）以及更常见的“箭根粉/竹芋粉”——由其根茎制成、用于勾芡增稠的细淀粉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tropical plant (Maranta arundinacea) whose roots (rhizomes) are used to make a fine starch.","zh":"竹芋（西印度葛），一种热带植物，其根茎可用来制成细腻的淀粉。"},"examples":[{"en":"Arrowroot is grown in warm climates and harvested for its starchy roots.","zh":"竹芋生长在温暖的气候中，人们收获它的根茎来获取淀粉。"},{"en":"The arrowroot plant is valued more for its starch than for its leaves.","zh":"竹芋主要因其可提取的淀粉而受重视，而不是因为叶子。"}]},{"partOfSpeech":"n.","definition":{"en":"A fine, easily digested starch made from arrowroot (or sometimes similar plants), used to thicken sauces, soups, and desserts.","zh":"（箭根粉/竹芋粉）一种细腻、易消化的淀粉（通常由竹芋提取，也有时泛指类似植物的淀粉），用于勾芡、增稠汤汁或甜点。"},"examples":[{"en":"She thickened the fruit sauce with a little arrowroot.","zh":"她用一点箭根粉把水果酱汁勾稠。"},{"en":"Arrowroot is often used in gluten-free baking.","zh":"箭根粉常用于无麸质烘焙。"},{"en":"For a clear, glossy sauce, many cooks choose arrowroot instead of flour.","zh":"想要汤汁清澈又有光泽，很多厨师会用箭根粉代替面粉来勾芡。"}]}],"synonyms":["starch","thickener","arrowroot starch"],"phonetic":"/ˈæroʊˌrut/","extraExplanation":["“arrowroot”这个名字常被解释为与传统用法有关：据说它曾被用于处理“箭毒/箭伤”之类的情况（不同资料说法不一），因此得名。现代英语里它主要指食用淀粉或这种植物本身。","烹饪小提示：箭根粉加热后会增稠，但长时间大火沸煮可能让增稠效果变弱；它做出的酱汁通常更透明、更有光泽。"]}
{"word":"arrowroots","summary":{"en":"Arrowroot is a tropical plant and the starch made from its roots, commonly used as a clear thickener in cooking.","zh":"Arrowroot 指一种热带植物，也指由其根茎制成的箭根粉，常用于烹饪中勾芡并使酱汁更清亮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical plant whose roots (rhizomes) are used to make a fine starch","zh":"（热带）竹芋属植物；其根茎可用来制成细致的淀粉"},"examples":[{"en":"Arrowroot grows well in warm, humid climates.","zh":"箭根粉植物在温暖潮湿的气候中生长良好。"},{"en":"In some regions, people cultivate arrowroot as a food crop.","zh":"在一些地区，人们把箭根粉植物当作粮食作物来种植。"}]},{"partOfSpeech":"n.","definition":{"en":"a white, powdery starch made from arrowroot, used to thicken sauces and desserts","zh":"箭根粉（由箭根粉植物制成的白色粉状淀粉，用于勾芡或做甜点）"},"examples":[{"en":"Stir a little arrowroot into cold water before adding it to the hot soup.","zh":"把少量箭根粉先用冷水调匀，再加入热汤里。"},{"en":"Arrowroot makes a clear, glossy sauce compared with flour.","zh":"和面粉相比，箭根粉做出来的酱汁更清亮、有光泽。"},{"en":"This pudding uses arrowroot for a smooth texture.","zh":"这款布丁用箭根粉来获得顺滑的口感。"}]}],"synonyms":["arrowroot starch","starch","thickener"],"phonetic":"/ˈæroʊˌrut/","extraExplanation":["“arrowroot”这个名字据说与传统上用其制品敷在箭伤上有关（民间说法不止一种），因此中文常译为“箭根粉”。","烹饪上，箭根粉常用于无麸质（gluten-free）料理；它在较低温度就能增稠，且成品更透明。注意不要长时间大火煮，否则可能变稀。"]}
{"word":"arrows","summary":{"en":"“Arrows” is the plural of “arrow”: either real arrows shot from a bow, or arrow-shaped symbols used to show direction or relationships.","zh":"“arrows”是“arrow”的复数：既可指弓箭等实体的“箭”，也可指表示方向或关系的“箭头符号”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ammunition: thin, pointed sticks shot from a bow; also used in modern archery and in the sport of darts (similar idea).","zh":"箭；弓箭用的细长尖头武器（现代也用于射箭运动；概念上也常与飞镖类投射物相类比）。"},"examples":[{"en":"The archer pulled an arrow from the quiver.","zh":"弓箭手从箭袋里抽出一支箭。"},{"en":"Be careful—the arrows are sharp.","zh":"小心点——箭很锋利。"}]},{"partOfSpeech":"n.","definition":{"en":"A symbol shaped like a pointed line (→) used to show direction, movement, or connection (for example on signs, maps, and screens).","zh":"箭头符号（→）：用于表示方向、移动或关系（如路标、地图、屏幕提示）。"},"examples":[{"en":"Follow the arrow to the exit.","zh":"跟着箭头走到出口。"},{"en":"Click the back arrow in your browser.","zh":"点击浏览器里的返回箭头。"}]},{"partOfSpeech":"n.","definition":{"en":"In diagrams, math, or programming, a mark that shows a relationship, mapping, or a process (often read as “goes to” or “leads to”).","zh":"（图表/数学/编程中）表示关系、映射或流程的箭头（常读作“指向/导向”）。"},"examples":[{"en":"In the chart, arrows show how water moves through the system.","zh":"在图表里，箭头显示水如何在系统中流动。"},{"en":"In math, x → 0 means x approaches 0.","zh":"在数学里，x → 0 表示 x 趋近于 0。"}]}],"synonyms":["arrows (plural)","arrowheads (for the pointed tips)","directional symbols","pointers"],"phonetic":"/ˈæroʊz/","extraExplanation":["“arrows”是“arrow”的复数形式。一个常见搭配是：a bow and arrow（弓和箭）、a quiver of arrows（一箭袋的箭）。","在文学和文化里，箭常象征“方向/目标/命运”或“爱”（如丘比特之箭 Cupid’s arrow）。因此英文里也常用arrow/pointed as an arrow来表达“直指要害、非常明确”。"]}
{"word":"Arrowsmith","summary":{"en":"“Arrowsmith” means an arrow-maker (old term) and is also a surname and the title of a well-known novel.","zh":"“Arrowsmith”可指制箭匠（较旧用法），也可作姓氏，并且是一部知名小说的书名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who makes arrows (an old term; more commonly called a “fletcher”).","zh":"制箭匠（较旧的说法；更常见的说法是 fletcher）。"},"examples":[{"en":"In medieval towns, an arrowsmith often worked alongside a bowyer and a fletcher.","zh":"在中世纪城镇里，制箭匠常常与制弓匠（bowyer）和制箭羽匠（fletcher）一起工作。"},{"en":"The museum displays tools an arrowsmith used to shape arrowheads.","zh":"博物馆展出了制箭匠用来打造箭头的工具。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname), and also the title of a famous novel.","zh":"姓氏；也可指一部著名小说的书名。"},"examples":[{"en":"Arrowsmith is a common English-language surname.","zh":"Arrowsmith 是一个常见的英语姓氏。"},{"en":"I’m reading Arrowsmith, a novel by Sinclair Lewis.","zh":"我在读《阿罗史密斯》（Arrowsmith），作者是辛克莱·刘易斯（Sinclair Lewis）。"}]}],"synonyms":["fletcher","arrow maker"],"phonetic":"/ˈæroʊsmɪθ/","extraExplanation":["“Arrowsmith”由 arrow（箭）+ smith（铁匠/工匠）构成，字面意思就是“做箭的工匠”。在历史上与 fletcher（制箭羽、装羽毛的人）含义接近，但日常英语里 fletcher 更常见。","文学方面，Sinclair Lewis 的小说《Arrowsmith》（1925）讲述一位理想主义医生兼科学家在医学研究、职业伦理与现实压力之间的挣扎；这部作品也让“Arrowsmith”在英语文化中更广为人知。"]}
{"word":"arrowsmith","summary":{"en":"Arrowsmith means a maker of arrows, and it is also a surname and the title of a famous novel by Sinclair Lewis.","zh":"Arrowsmith 指“制箭匠”，也可作姓氏，并且是辛克莱·刘易斯一部著名小说的书名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who makes arrows (especially for bows), historically as a craft or trade","zh":"制箭匠；制作箭矢的人（尤指传统工艺或职业）"},"examples":[{"en":"In medieval times, an arrowsmith supplied arrows to hunters and soldiers.","zh":"在中世纪，制箭匠会为猎人和士兵提供箭矢。"},{"en":"The museum has a display showing how an arrowsmith shaped arrowheads.","zh":"博物馆有一个展区展示制箭匠如何打造箭头。"}]},{"partOfSpeech":"n.","definition":{"en":"a surname (family name); also used as a title/name in literature","zh":"阿罗史密斯（姓氏）；也可作为文学作品的书名/人物名"},"examples":[{"en":"Arrowsmith is his last name.","zh":"Arrowsmith 是他的姓。"},{"en":"She’s reading Arrowsmith by Sinclair Lewis.","zh":"她正在读辛克莱·刘易斯的《阿罗史密斯》。"}]}],"synonyms":["arrow maker","fletcher"],"phonetic":"/ˈæroʊsmɪθ/","extraExplanation":["“Arrowsmith”由“arrow（箭）+ smith（铁匠/匠人）”构成，字面意思是“制箭的匠人”。历史上与“blacksmith（铁匠）”“goldsmith（金匠）”同类，是按职业形成的称呼。","《Arrowsmith》（1925）是美国作家 Sinclair Lewis 的小说，讲述一位医生/科学家在理想、科研与现实压力之间的挣扎。这也让“Arrowsmith”在文化语境中常被联想到医学研究与职业理想主义。"]}
{"word":"arrowstone","summary":{"en":"Arrowstone usually means a stone arrowhead (often flint), and can also refer to a belemnite fossil in older or folk usage.","zh":"Arrowstone 通常指石制箭头（常为燧石），也可在较旧或民间用法中指箭石类（belemnite）化石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A stone (often flint or similar rock) shaped or used as an arrowhead; an arrowhead made of stone.","zh":"（常为燧石等）用来制作或打制成箭头的石头；石制箭头。"},"examples":[{"en":"Archaeologists found an arrowstone near the riverbank.","zh":"考古学家在河岸附近发现了一枚石制箭头（箭石）。"},{"en":"The museum displays arrowstones from the Stone Age.","zh":"博物馆展出了石器时代的箭石（石箭头）。"}]},{"partOfSpeech":"n.","definition":{"en":"A belemnite fossil (a bullet- or dart-shaped fossil) sometimes called an “arrowstone,” especially in older or folk usage.","zh":"箭石（指一种“似箭/似镖”的箭石化石——箭石类头足动物的化石；多见于较旧或民间说法）。"},"examples":[{"en":"On the beach, she collected arrowstones—actually belemnite fossils.","zh":"她在海滩上捡到一些“箭石”——其实是箭石类（belemnite）的化石。"},{"en":"In older writings, belemnites were sometimes described as arrowstones from the sky.","zh":"在较早的文字里，箭石类化石有时被说成是“从天而降的箭石”。"}]}],"synonyms":["arrowhead","flint arrowhead","flint","belemnite","thunderbolt stone (folk)"],"phonetic":"/ˈæroʊˌstoʊn/","extraExplanation":["“arrowstone”不是现代日常高频词，更常见的表达是“arrowhead（箭头）”或“flint arrowhead（燧石箭头）”。","在欧洲一些民间传统中，belemnite（箭石类化石）因形状像箭/子弹，曾被叫作“thunderbolt stones（雷霆石）”或被认为与雷电有关；这是民俗解释，不是科学结论。"]}
{"word":"arrowweed","summary":{"en":"Arrowweed is a desert riverbank shrub (Pluchea sericea), known for narrow leaves and traditional use in making arrows.","zh":"Arrowweed 指一种生长在沙漠河岸与湿地边缘的灌木（箭草，Pluchea sericea），叶细长，传统上可用来做箭杆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a desert shrub (Pluchea sericea) native to the southwestern U.S. and northern Mexico, often found along rivers and wetlands; it has narrow, willow-like leaves and was traditionally used for making arrows and other tools.","zh":"箭草（又称箭蒿；学名 Pluchea sericea）：原产于美国西南部和墨西哥北部的沙漠灌木，常生长在河岸与湿地边缘；叶子细长似柳，传统上可用来制作箭杆与其他器具。"},"examples":[{"en":"Arrowweed grows in dense stands along desert washes and riverbanks.","zh":"箭草常沿着沙漠干河道和河岸成片生长。"},{"en":"The trail crosses a wet area where arrowweed and cattails are common.","zh":"小径穿过一片湿地，那里常见箭草和香蒲。"},{"en":"Historically, some Indigenous groups used arrowweed stems for arrows and simple tools.","zh":"历史上，一些原住民群体会用箭草的茎制作箭杆和简易工具。"}]}],"synonyms":["Pluchea sericea","arrow weed"],"phonetic":"ˈæroʊˌwid","extraExplanation":["“arrowweed”通常写作一个词，也可能写作“arrow weed”。名字里的“arrow-”来自其茎秆较直、可做箭杆的传统用途。","它常被用作荒漠河岸带（riparian areas）的指示植物：看到箭草往往意味着附近有较稳定的地下水或季节性水源。"]}
{"word":"arrowwood","summary":{"en":"Arrowwood is a shrub (often a viburnum) whose straight stems were traditionally used to make arrows.","zh":"Arrowwood 指一种灌木（常为荚蒾属），因枝条笔直坚韧，传统上可用来做箭杆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A North American shrub (especially viburnum, such as Viburnum dentatum) with straight, tough stems that were traditionally used to make arrows.","zh":"一种北美灌木（常指荚蒾属，如齿叶荚蒾 Viburnum dentatum），枝条笔直坚韧，传统上可用来制作箭杆。"},"examples":[{"en":"Arrowwood grows along streams and at the edges of wetlands.","zh":"箭木常生长在溪流旁和湿地边缘。"},{"en":"Some Indigenous peoples used arrowwood stems to make arrow shafts.","zh":"一些原住民会用箭木的枝条制作箭杆。"}]}],"synonyms":["viburnum (common name group)","arrow-wood (variant spelling)"],"phonetic":"/ˈæroʊˌwʊd/","extraExplanation":["“arrowwood”是常见名（common name），不同地区有时也会用它指其他枝条笔直、适合做箭杆的灌木，但在北美最常见的指向是荚蒾属（Viburnum）中的几种。","在自然写作或园艺语境里，arrowwood常与“湿地边缘、林缘、灌木篱、野生动物栖息地”等主题一起出现，因为它能提供花蜜与果实，吸引鸟类。"]}
{"word":"arrowworm","summary":{"en":"An arrowworm is a small planktonic marine predator with an arrow-shaped body.","zh":"arrowworm 指生活在海洋浮游生物中的小型捕食者“箭虫”，身体呈箭形。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, transparent marine animal (a chaetognath) that lives in plankton and preys on tiny organisms; it has a long, arrow-shaped body.","zh":"箭虫（毛颚动物），一种生活在海洋浮游生物中的小型透明动物，身体细长呈“箭形”，以微小生物为食。"},"examples":[{"en":"Arrowworms are common predators in ocean plankton.","zh":"箭虫是海洋浮游生物中常见的捕食者。"},{"en":"In a microscope image, the arrowworm’s slender body looks like an arrow.","zh":"在显微镜图像里，箭虫细长的身体看起来像一支箭。"},{"en":"Some fish larvae eat arrowworms, but arrowworms also eat smaller plankton.","zh":"一些鱼类幼体会吃箭虫，但箭虫也会捕食更小的浮游生物。"}]}],"synonyms":["chaetognath","glass worm (less common)"],"phonetic":"ˈæroʊwɝm","extraExplanation":["“arrowworm”是常见英文名，生物学上多称为chaetognath（毛颚动物门）。它们通常是海洋浮游动物的重要捕食者，头部有钩状刚毛用来抓捕猎物（如桡足类等）。","这个词在日常英语里不常见，更多出现在海洋生物学、生态学、科普或水族/浮游生物相关内容中。"]}
{"word":"arrowy","summary":{"en":"Arrowy means “arrow-shaped” or, in a poetic sense, “sharp and direct like an arrow.”","zh":"arrowy 指“箭形的”，也可作诗意比喻，表示“像箭一样尖锐、直接”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shaped like an arrow; long, narrow, and pointed.","zh":"箭形的；细长、尖锐如箭的。"},"examples":[{"en":"The plant has arrowy leaves with sharp tips.","zh":"这种植物的叶子呈箭形，叶尖很锐利。"},{"en":"An arrowy ridge cut across the landscape.","zh":"一道箭一般狭长的山脊横穿了这片地貌。"}]},{"partOfSpeech":"adj.","definition":{"en":"Resembling an arrow in movement or effect—fast, direct, and piercing (often poetic).","zh":"（多为文学/诗意用法）像箭一样在动作或效果上迅疾、直接、刺入人心的。"},"examples":[{"en":"She gave him an arrowy glance that ended the argument.","zh":"她投来一道“箭一般”的目光，争论立刻结束了。"},{"en":"Arrowy pain shot through his side when he ran.","zh":"他跑起来时，侧腹传来箭一般刺痛的疼痛。"}]}],"synonyms":["arrow-shaped","pointed","sharp","piercing"],"phonetic":"/ˈæroʊi/","extraExplanation":["“arrowy”不是日常高频词，更常见于描写自然形状（叶子、山脊、线条）或用于诗意比喻（目光、痛感、动作）。日常写作里也可以用更常见的形容词，如“arrow-shaped”“pointed”“sharp”“piercing”。"]}
{"word":"arroya","summary":{"en":"“Arroyo” means a usually dry creek bed that carries water only after rain, common in the U.S. Southwest.","zh":"“Arroyo”指一种通常干涸、雨后才有水的河沟/旱谷，在美国西南部很常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended) a dry streambed or small, steep-sided channel that temporarily carries water after rain, especially in the U.S. Southwest.","zh":"（可能想写的是）“干河沟/旱谷”：一种小而陡的沟谷或河床，平时干涸，下雨后会短暂有水流（尤见于美国西南部）。"},"examples":[{"en":"After the storm, water rushed through the arroyo for a few hours.","zh":"暴风雨过后，水在那条干河沟里奔流了几个小时。"},{"en":"Hikers followed the arroyo to find an easier path through the desert.","zh":"徒步者沿着干河沟走，想在沙漠中找到一条更好走的路。"}]}],"synonyms":["dry creek","wash","gully","ravine"],"phonetic":"/əˈrɔɪoʊ/","extraExplanation":["“arroyo”是从西班牙语借入英语的词，在美国西南部（如亚利桑那、新墨西哥、加州）很常见。很多地名里也会出现Arroyo（如Arroyo Seco）。","你输入的“arroya”在英语里不常见，通常是拼写错误；标准拼写是“arroyo”。"]}
{"word":"arroyo","summary":{"en":"An arroyo is a small creek or (often dry) channel in dry regions, especially in the U.S. Southwest.","zh":"Arroyo 指干旱地区常见的（多半时间干涸、雨后才有水的）小溪或沟谷，尤见于美国西南部。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small stream or creek, especially one that flows only after rain in dry regions.","zh":"（尤指干旱地区雨后才有水的）小溪，小河沟。"},"examples":[{"en":"After the storm, water rushed through the arroyo behind our house.","zh":"暴风雨过后，水从我们房子后面的干涸沟渠（arroyo）里奔涌而过。"},{"en":"Hikers were told not to camp in an arroyo because it can flood suddenly.","zh":"有人提醒徒步者不要在干沟（arroyo）里扎营，因为可能会突然暴发洪水。"}]},{"partOfSpeech":"n.","definition":{"en":"A dry creek bed or gully shaped by flowing water (often dry most of the year).","zh":"（多半时间干涸的）河床；被流水冲刷形成的沟壑。"},"examples":[{"en":"The trail drops into a sandy arroyo and climbs out again.","zh":"小路下到一条沙质干河床（arroyo）里，然后再爬上去。"},{"en":"Erosion widened the arroyo over many years.","zh":"多年侵蚀使这条沟壑（arroyo）变得更宽。"}]}],"synonyms":["dry creek bed","gully","ravine","wash","streambed"],"phonetic":"əˈrɔɪoʊ","extraExplanation":["“Arroyo”来自西班牙语，意思接近“溪流/沟渠”。在美国西南部（如新墨西哥、亚利桑那、加州部分地区）非常常见，用来指雨季才会有水、平时干涸的沟谷。","在安全语境里常会听到“flash flood（山洪暴发）”与 arroyo 搭配：干涸的 arroyo 看起来安全，但强降雨会让水位在短时间内暴涨。"]}
{"word":"arroyos","summary":{"en":"Arroyos are usually dry streambeds that can suddenly carry water after rain, common in the U.S. Southwest.","zh":"Arroyos 指通常干燥、下雨后会突然有水流的溪沟/小峡谷，常见于美国西南部。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A usually dry streambed or small canyon that fills with water after rain, especially in the southwestern U.S. (plural of “arroyo”).","zh":"（arroyo 的复数）干涸的溪沟/小峡谷；通常平时干燥，下雨后会突然有水流，常见于美国西南部。"},"examples":[{"en":"After the storm, water rushed through the arroyos behind the houses.","zh":"暴风雨过后，水流冲过房子后面的那些干溪沟。"},{"en":"Be careful hiking—arroyos can flood quickly when it rains upstream.","zh":"徒步要小心——上游一下雨，干溪沟可能会很快暴涨成洪水。"}]}],"synonyms":["gullies","ravines","dry creek beds","wadis"],"phonetic":"/əˈrɔɪoʊ/","extraExplanation":["“Arroyo”来自西班牙语，意思是“小溪/溪流”。在美国西南部（如亚利桑那、新墨西哥、加州部分地区）很常见，因为当地气候干燥、降雨集中，容易形成这种“平时干、雨季猛”的地形。","在文学与自然写作中，arroyos 常用来营造荒漠、边境、牧场或西部景观的氛围，也常与“flash flood（山洪）”一起出现。"]}
{"word":"arroyuelo","summary":{"en":"Arroyuelo is a Spanish word meaning “a small arroyo (little stream/gully),” seen in English mostly in place names or local descriptions.","zh":"Arroyuelo 源自西班牙语，意为“较小的旱沟/小溪谷（arroyo）”，在英语中多见于地名或地方性描写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Spanish; used in English mainly in place names) a small arroyo—a little stream, dry creek bed, or gully formed by water, especially in arid regions.","zh":"（源自西班牙语；英语中多见于地名）小型“arroyo”（旱沟/干河床/冲沟），指在干旱地区由流水冲刷形成的小溪谷或沟渠。"},"examples":[{"en":"After the rain, water rushed through the arroyuelo behind the house.","zh":"下雨后，水从房子后面的那条小冲沟里奔流而过。"},{"en":"The trail crosses an arroyuelo that is dry most of the year.","zh":"这条小径会穿过一条一年大部分时间都干涸的小旱沟。"}]},{"partOfSpeech":"n.","definition":{"en":"a proper name (often a place name or surname) in Spanish-speaking contexts; sometimes kept in English texts for local color.","zh":"专有名词（常见为地名或姓氏），在英语文本中有时保留原词以体现地域色彩。"},"examples":[{"en":"They visited Arroyuelo during their road trip through northern Spain.","zh":"他们在穿越西班牙北部的自驾游中去了 Arroyuelo。"}]}],"synonyms":["arroyo","creek","brook","gully","dry creek bed"],"phonetic":"/ɑˌroʊˈwɛloʊ/","extraExplanation":["“Arroyuelo”是西班牙语“arroyo（小河/冲沟）”的指小形式，后缀“-uelo”带有“更小、较轻微”的意思，类似英语里用“little-”或“-let”（如 streamlet）。","在英语里它通常不作为常用词汇，而更多出现在地名、文学描写或介绍西语地区地貌时；日常英语更常说 creek, brook, gully 或 dry creek bed。"]}
{"word":"arroz","summary":{"en":"“Arroz” means rice, commonly used in English on Latin American/Spanish menus or food contexts.","zh":"“arroz”意为“米/米饭”，在英语中多用于拉美/西语餐饮语境或菜单。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"rice; in English, a loanword used mainly on menus or in Latin American/Spanish contexts to refer to cooked rice dishes.","zh":"米饭；在英语中多作为外来词，常见于菜单或拉美/西语语境里，指米饭或米饭类料理。"},"examples":[{"en":"I’ll have chicken with arroz and beans.","zh":"我想要鸡肉配米饭和豆子。"},{"en":"This arroz is seasoned with garlic and cilantro.","zh":"这道米饭用大蒜和香菜调味。"}]}],"synonyms":["rice"],"phonetic":"/ɑˈroʊs/","extraExplanation":["“arroz”来自西班牙语/葡萄牙语，意思就是“米、米饭”。在日常英语里更常说“rice”，但在拉美餐馆菜单上你会经常看到“arroz”（比如 *arroz con pollo*）。","发音在英语环境中常被英语化；如果你在西语语境交流，也可能听到更接近西班牙语的读法。"]}
{"word":"arrtez","summary":{"en":"“arrtez” is not a standard English word; it most likely refers to ArtEZ, a Dutch university of the arts.","zh":"“arrtez”不是标准英语单词；它很可能指荷兰的艺术大学 ArtEZ。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A likely misspelling of “ArtEZ,” the name of a Dutch university of the arts (ArtEZ University of the Arts). It is used as a proper name, not a regular English vocabulary word.","zh":"很可能是“ArtEZ”的拼写错误；ArtEZ 是荷兰的一所艺术大学（ArtEZ University of the Arts）。它是专有名词，不是常规英语词汇。"},"examples":[{"en":"She studied fashion design at ArtEZ in the Netherlands.","zh":"她在荷兰的 ArtEZ 学习了时装设计。"},{"en":"ArtEZ is known for programs in art, design, and music.","zh":"ArtEZ 以艺术、设计和音乐等专业而闻名。"}]}],"synonyms":["ArtEZ University of the Arts"],"phonetic":"ɑrˈtɛz","extraExplanation":["“ArtEZ”中的大写形式常见于学校官方写法；在英文句子里通常直接当作学校名称使用（类似于“Harvard”）。","如果你指的是别的“arrtez”（例如用户名、品牌名或缩写），请告诉我你看到它的上下文句子，我可以按那个语境解释。"]}
{"word":"Arruague","summary":{"en":"“Arruague” is most likely a surname (proper noun), not a standard English word.","zh":"“Arruague”更可能是姓氏（专有名词），不是标准英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper noun used as a family name (surname), most likely of Spanish-language origin; it is not a common English vocabulary word.","zh":"一个用作姓氏的专有名词，较可能源自西班牙语语境；它不是常见的英语词汇。"},"examples":[{"en":"The email was signed “Arruague,” so I assumed that was the sender’s last name.","zh":"邮件签名写着“Arruague”，所以我推测那是发件人的姓。"},{"en":"In the roster, Arruague appears as a surname, not a job title.","zh":"在名单里，Arruague 是作为姓氏出现的，不是职位名称。"}]}],"phonetic":"/ɑˈruːɑˌɡeɪ/","extraExplanation":["“Arruague”在英文词典里通常查不到作为普通词汇的释义，更常见的用法是人名/姓氏（专有名词）。","如果你是在某篇文章、证件或家谱资料里看到它，它很可能是西班牙语地区的姓；但仅凭拼写很难确认具体来源与含义。","它也可能与其他相近拼写的姓氏混淆（例如因转写、打字或OCR识别错误）。如果你能提供出现的句子/上下文，我可以帮你判断它在那里的确切用法与更自然的读法。"]}
{"word":"arruague","summary":{"en":"Likely “argue”: to disagree and give reasons to support your opinion.","zh":"可能是“argue”：发生分歧时用理由表达并支持自己的观点。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Likely intended: **argue**) to speak or write using reasons to support your opinion, especially when people disagree.","zh":"（可能想写：**argue**）用理由表达并支持自己的观点，尤其是在有分歧或争论时。"},"examples":[{"en":"They often argue about money.","zh":"他们经常为钱的事争吵。"},{"en":"She argued that the plan would save time.","zh":"她论证说这个计划能节省时间。"},{"en":"Try to argue calmly and listen carefully.","zh":"尽量冷静地沟通争论，并认真倾听。"}]},{"partOfSpeech":"vt.","definition":{"en":"to give reasons in order to persuade someone; to claim and support an idea (often with evidence).","zh":"提出理由来劝服别人；主张并用证据支持某个观点。"},"examples":[{"en":"The lawyer argued the case in court.","zh":"律师在法庭上为案件辩论。"},{"en":"Scientists argue that the change is real.","zh":"科学家认为这种变化确实存在，并提出理由支持。"}]}],"synonyms":["debate","disagree","reason","quarrel","contend"],"phonetic":"/ɑrˈɡju/","extraExplanation":["“arruague”不是常见英语单词，最接近且最常用的应是 **argue**（拼写：a-r-g-u-e）。常见错误是把字母顺序写乱或多写字母。","常用搭配：**argue with someone**（和某人争论/吵架）；**argue about/over something**（为某事争论）；**argue that + 从句**（论证/主张……）。","语气提醒：**argue** 可以是理性“辩论/论证”，也可以是情绪化“争吵”，要看语境。想表达更温和的“讨论”，可用 **discuss**。"]}
{"word":"Arry","summary":{"en":"“Arry” is not standard English; it usually represents “Harry” in certain British accents, or it’s simply a misspelling of words like “array.”","zh":"“Arry”不是标准英语：通常用来表示某些英式口音里的“Harry”，也可能只是把“array”等词拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Uncommon) A dialect or informal spelling of the male name “Harry,” especially representing some British accents where the /h/ sound is dropped.","zh":"（不常见）男性名字“Harry”的方言/口语拼写，常用来表现一些英式口音中把 /h/ 音省略的读法。"},"examples":[{"en":"In the novel, the character is written as ’Arry to show his Cockney accent.","zh":"在小说里，这个角色写作 ’Arry，用来表现他的伦敦腔（Cockney）口音。"},{"en":"People called him Arry, but his official name was Harry.","zh":"大家叫他 Arry，但他的正式名字是 Harry。"}]},{"partOfSpeech":"other","definition":{"en":"A misspelling of “array” (a set or collection of things) or sometimes “airy” (light and open).","zh":"“array”（一组/一系列）或“airy”（通风的、轻盈的）的常见拼写错误。"},"examples":[{"en":"I think you meant “array,” not “arry.”","zh":"我想你想写的是“array”，不是“arry”。"},{"en":"The data are stored in an array.","zh":"数据存储在一个数组（array）里。"}]}],"synonyms":["Harry (standard spelling)"],"phonetic":"/ˈhæri/","extraExplanation":["“H-dropping”（省略词首 h 音）在英国一些口音中比较常见，文学作品会用 ’Arry 这种写法来“写出口音”。这类拼写通常是为了塑造人物身份、阶层或地域背景，并不是标准拼写。"]}
{"word":"arry","summary":{"en":"“arry/’arry” is mainly a nonstandard written form of “Harry,” or a rare old variant spelling of “array.”","zh":"“arry/’arry”主要是“Harry”的非标准口音写法，也可能是“array”的罕见旧式拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(usually written 'arry) a nonstandard spelling/pronunciation of the name “Harry,” often used to show a Cockney (London) accent in writing.","zh":"（常写作 'arry）“Harry（哈里）”这个名字的非标准拼写/发音，常用于文字中表现伦敦考克尼口音。"},"examples":[{"en":"In the old novel, the character calls his friend “’Arry” instead of “Harry.”","zh":"在那本老小说里，角色把朋友叫作“’Arry”，而不是“Harry”。"},{"en":"“’Arry, come ’ere!” the vendor shouted in a strong London accent.","zh":"小贩用浓重的伦敦口音喊道：“’Arry，过来！”"}]},{"partOfSpeech":"other","definition":{"en":"(rare/archaic) a spelling variant of “array” meaning “to arrange/prepare” or “an arrangement.”","zh":"（罕见/古旧）“array”的异体拼写，可表示“排列/布置/准备”或“排列、陈列”。"},"examples":[{"en":"Some older texts may spell “array” as “arry,” but modern English uses “array.”","zh":"一些较老的文本里可能把“array”写成“arry”，但现代英语一般用“array”。"}]}],"synonyms":["Harry","array (archaic variant)"],"phonetic":"/ˈæri/","extraExplanation":["“’Arry”这类写法常见于19世纪到20世纪初的英国文学或戏剧，用来“写出口音”（eye dialect）。它不是标准拼写，正式写作中通常避免使用。","如果你想查的是“array”（名词：一排/一系列；动词：排列/部署），告诉我你要的词性和语境，我可以给你更常用的释义与例句。"]}
{"word":"Arryish","summary":{"en":"“Arryish” isn’t a standard English word; it’s likely a misspelling (often of “Irish”) or a creative spelling/name.","zh":"“Arryish”不是标准英语词；多半是拼写错误（常见指“Irish”）或创意拼写/名字。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most often seen as a misspelling or creative spelling in names/usernames, and its meaning depends on the writer’s intent.","zh":"不是标准英语单词。多见于拼写错误或创意拼写（如名字、网名），具体含义取决于写作者的意图。"},"examples":[{"en":"I couldn’t find “Arryish” in a dictionary—did you mean “Irish” or “Harry-ish”?","zh":"我在词典里找不到“Arryish”——你是想写“Irish（爱尔兰的）”还是“Harry-ish（有点像哈利的）”吗？"},{"en":"The username “Arryish” seems like a personal spelling rather than a common word.","zh":"用户名“Arryish”看起来更像个人拼写，而不是常见词。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Possible intended word) Irish: relating to Ireland, its people, or its culture.","zh":"（可能想写的词）Irish：与爱尔兰、爱尔兰人或爱尔兰文化有关的。"},"examples":[{"en":"She loves Irish music and dance.","zh":"她很喜欢爱尔兰音乐和舞蹈。"},{"en":"They visited an Irish pub after work.","zh":"他们下班后去了一家爱尔兰酒吧。"}]}],"synonyms":["Irish (if that’s what was intended)","name/username (context-dependent)"],"phonetic":"ˈaɹiɪʃ","extraExplanation":["“Arryish”如果出现在聊天或社交媒体里，常见情况有：\n1) 把“Irish”（爱尔兰的）拼错；\n2) 用“-ish”表示“有点像……”，例如“Harry-ish”=“有点像哈利/哈里风格”；\n3) 作为人名/外号（如 Arry 是 Harry 的口语/方言写法）。\n如果你能给我一句原文语境（前后一句），我可以更准确判断。"]}
{"word":"arryish","summary":{"en":"Arrayish means “array-like,” especially in JavaScript—similar to an array but not a real Array.","zh":"arrayish 指“类数组的”，尤指在 JavaScript 中：像数组但不是真正的 Array。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(computing, especially JavaScript) Resembling an array; having some array-like features (such as indexed elements and a length) but not being a true Array object.","zh":"（计算机用语，尤指 JavaScript）“像数组的”；具有一些数组特征（如按索引取值、length 属性等），但不是真正的 Array 对象。"},"examples":[{"en":"In JavaScript, the arguments object is arrayish, so you may need to convert it to an Array.","zh":"在 JavaScript 里，arguments 对象是“类数组”的，所以你可能需要把它转换成真正的 Array。"},{"en":"A NodeList from querySelectorAll is arrayish: you can use indexes, but not every array method works directly.","zh":"querySelectorAll 返回的 NodeList 是“类数组”的：可以用索引访问，但不是所有数组方法都能直接用。"}]}],"synonyms":["array-like","list-like"],"phonetic":"əˈreɪɪʃ","extraExplanation":["“-ish”是英语里很常见的后缀，表示“有点像……、带有……的特征”（例如: child → childish, green → greenish）。因此 arrayish 字面意思就是“像 array 的”。","在 JavaScript 语境中，常见的“类数组（array-like/arrayish）”对象包括 arguments、NodeList、HTMLCollection 等。它们通常有 length，也能用 obj[0] 访问元素，但可能没有 push/pop/map 等数组方法；需要时可用 Array.from(...) 或 [...obj] 转成真正数组。"]}
{"word":"arrythmia","summary":{"en":"Arrhythmia means an irregular heartbeat.","zh":"Arrhythmia 指“心律失常”，即心跳不规则。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An irregular heartbeat (the heart beats too fast, too slow, or unevenly).","zh":"心律失常；心跳不规则（可能过快、过慢或不均匀）。"},"examples":[{"en":"The doctor detected an arrhythmia during the ECG test.","zh":"医生在心电图检查中发现了心律失常。"},{"en":"Some arrhythmias are harmless, but others need treatment.","zh":"有些心律失常并不危险，但有些需要治疗。"}]}],"synonyms":["irregular heartbeat","irregular heart rhythm"],"phonetic":"əˈrɪðmiə","extraExplanation":["你输入的“arrythmia”常见于拼写错误；标准拼写是“arrhythmia”。这个词来自希腊语：a-（不、无）+ rhythm（节律），字面意思是“没有规律的节奏”。","在医疗语境里常见搭配：cardiac arrhythmia（心律失常）、atrial fibrillation/AFib（房颤，一种常见的心律失常）、ECG/EKG（心电图，用于检测心律问题）。"]}
{"word":"arrythmic","summary":{"en":"Arrhythmic means having an irregular rhythm, especially an irregular heartbeat; it can also describe irregular musical rhythm.","zh":"Arrhythmic 指“节律不规则的”，尤其常指心跳不规律；也可形容音乐节奏不规则。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having an irregular rhythm; not following a steady beat (often used about the heartbeat).","zh":"节律不规则的；无固定节拍的（常用于形容心跳）。"},"examples":[{"en":"The doctor detected an arrhythmic heartbeat and ordered an ECG.","zh":"医生发现心跳节律不齐，于是安排了心电图检查。"},{"en":"After too much caffeine, his pulse felt slightly arrhythmic.","zh":"咖啡因摄入过多后，他的脉搏感觉有点不规律。"}]},{"partOfSpeech":"adj.","definition":{"en":"In music or movement, lacking a regular beat; rhythmically uneven.","zh":"（音乐或动作）节奏不规则的；不匀称的。"},"examples":[{"en":"The composer used arrhythmic patterns to create tension.","zh":"作曲家用不规则的节奏型来制造紧张感。"},{"en":"Her steps became arrhythmic when she was nervous.","zh":"她紧张时脚步变得不太有节奏。"}]}],"synonyms":["irregular","uneven","asynchronous"],"phonetic":"/əˈrɪðmɪk/","extraExplanation":["你输入的“arrythmic”常见为拼写错误；更常见、标准的拼写是“arrhythmic”（两个 r，且含有 “rhythm” 的词根）。","医学语境中它常与“arrhythmia（心律失常）”一起出现：arrhythmia 是名词（疾病/现象），arrhythmic 是形容词（描述心跳/节律的状态）。"]}
{"word":"arrythmical","summary":{"en":"Arrhythmical means irregular in rhythm, especially an abnormal heartbeat; it can also describe irregular rhythm in music or writing.","zh":"arrhythmical 指“节律不规则的”，尤指“心跳节律不齐（心律失常的）”，也可形容音乐或文字的节奏不规则。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having an irregular rhythm, especially an abnormal or uneven heartbeat.","zh":"（尤指心跳）节律不齐的；心律失常的。"},"examples":[{"en":"The doctor heard an arrhythmical heartbeat and ordered an ECG.","zh":"医生听到心跳节律不齐，于是安排做心电图。"},{"en":"Some medicines can cause arrhythmical heart rhythms as a side effect.","zh":"有些药物的副作用可能会引起心律不齐。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not following a regular beat or pattern of rhythm (in music, speech, or writing).","zh":"（音乐、言语或写作）无固定节拍的；节奏不规则的。"},"examples":[{"en":"The poem’s arrhythmical lines create a nervous, unsettled feeling.","zh":"这首诗不规则的节奏营造出紧张、不安的感觉。"},{"en":"The composer used arrhythmical pulses to suggest chaos.","zh":"作曲家用不规则的节拍来暗示混乱。"}]}],"synonyms":["arrhythmic","irregular","uneven","out of rhythm"],"phonetic":"/əˈrɪðmɪkəl/","extraExplanation":["“arrhythmical”在英语中不如“arrhythmic”常见，但意思基本相同；两者都来自“arrhythmia（心律失常）”。","医学语境里更常用“arrhythmic (heartbeat/rhythm)”或直接说“arrhythmia”。写作时如果是描述心电图或诊断，优先用更常见的表达会更自然。"]}
{"word":"arrythmically","summary":{"en":"“Arrhythmically” means “in an irregular rhythm,” often describing music, movement, breathing, or flashing lights.","zh":"“arrhythmically”表示“以不规则的节奏”，常用来形容音乐、动作、呼吸或灯光闪烁等节奏紊乱的情况。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an irregular rhythm; without a steady beat or predictable timing.","zh":"以不规则的节奏；没有稳定拍点或可预测的时间规律。"},"examples":[{"en":"The drummer played arrhythmically, making it hard for the band to stay together.","zh":"鼓手以不规则的节奏演奏，让乐队很难合拍。"},{"en":"The lights flashed arrhythmically, like a faulty neon sign.","zh":"灯光以不规则的频率闪烁，像坏掉的霓虹灯招牌。"},{"en":"She breathed arrhythmically after the sprint.","zh":"冲刺后她呼吸节奏紊乱。"}]}],"synonyms":["irregularly","out of rhythm","unevenly","without a steady beat"],"phonetic":"/əˈrɪðmɪkli/","extraExplanation":["“arrhythmically”常见于音乐评论、文学描写或医学语境的延伸用法，强调“节奏不稳、忽快忽慢”。它来自“arrhythmia/arrhythmic”（心律不齐/不规则的节律），因此也常被用来形容呼吸、心跳、灯光闪烁等“不规则的节奏感”。","拼写注意：有时会写成“arythmically”，但标准拼写通常是“arrhythmically”（含双r和h）。"]}
