{"word":"ARS","summary":{"en":"Ars means “art/skill” from Latin, used mostly in Latin phrases; ARS in caps is a context-dependent abbreviation.","zh":"ars 源自拉丁语，意为“艺术/技艺”，多见于拉丁短语；大写 ARS 通常是需结合语境理解的缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Latin) “art; skill; craft,” used in English mainly in fixed Latin phrases (e.g., ars poetica).","zh":"（源自拉丁语）“艺术；技艺；技巧”，在英语中多用于固定拉丁短语里（如 ars poetica）。"},"examples":[{"en":"The course explores ars poetica—ideas about what poetry is and how it works.","zh":"这门课探讨“ars poetica”（诗艺/诗学）——关于诗是什么以及如何运作的观点。"},{"en":"He admired the ars of ancient engineers: their practical skill and creativity.","zh":"他钦佩古代工程师的“ars”：他们的实用技艺与创造力。"}]},{"partOfSpeech":"other","definition":{"en":"ARS (abbreviation): can stand for different things depending on the field (medicine, education, organizations, etc.). Often needs context.","zh":"ARS（缩写）：在不同领域可代表不同含义（医学、教育、机构名称等），通常需要上下文才能确定。"},"examples":[{"en":"In the report, ARS refers to a specific agency, so check the document’s abbreviation list.","zh":"在这份报告中，ARS 指某个机构，所以要查看文件里的缩写表。"},{"en":"Without context, ARS is ambiguous.","zh":"没有上下文时，ARS 的含义不明确。"}]}],"synonyms":["art","skill","craft"],"phonetic":"ɑrz","extraExplanation":["“ars”是拉丁语名词“艺术/技艺”，在英语里常见于学术或文学语境的拉丁短语：\n- ars poetica：诗艺/诗学（也可指“关于诗歌创作的理论/原则”）\n- ars longa, vita brevis：艺长命短（常译“艺术永恒，人生短暂”）\n在现代日常英语中，人们一般直接说 art/skill，而不会单独用 ars。","如果你指的是某个特定领域的 ARS（例如某个政府机构、医学术语、课堂互动系统等），给我一句原文或上下文，我可以帮你准确对应全称与含义。"]}
{"word":"ars","summary":{"en":"“ARS” is usually an abbreviation (e.g., Acute Respiratory Syndrome or USDA Agricultural Research Service). “ars” can also be a Latin word meaning “art/skill.”","zh":"“ARS”通常是缩写（如急性呼吸综合征，或美国农业部农业研究局）。小写“ars”也可能是拉丁语，意为“艺术/技艺”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbreviation) Acute Respiratory Syndrome: a serious illness that affects the lungs and breathing (often used in medical contexts).","zh":"（缩写）急性呼吸综合征：一种影响肺部和呼吸的严重疾病（常见于医学语境）。"},"examples":[{"en":"The doctor said the patient showed signs of ARS and needed close monitoring.","zh":"医生说病人出现了 ARS 的迹象，需要密切观察。"},{"en":"Hospitals prepared new protocols for ARS cases.","zh":"医院为 ARS 病例制定了新的流程。"}]},{"partOfSpeech":"other","definition":{"en":"(abbreviation) Agricultural Research Service: a U.S. Department of Agriculture (USDA) agency that conducts scientific research in agriculture and food.","zh":"（缩写）农业研究局：美国农业部（USDA）下属机构，从事农业与食品相关科研。"},"examples":[{"en":"The ARS published a report on soil health and sustainable farming.","zh":"ARS 发布了一份关于土壤健康与可持续农业的报告。"},{"en":"She works at the USDA ARS lab on crop disease prevention.","zh":"她在 USDA 的 ARS 实验室从事作物病害预防研究。"}]},{"partOfSpeech":"n.","definition":{"en":"(Latin) “ars”: art or skill; sometimes seen in English writing in Latin phrases (e.g., “ars longa”).","zh":"（拉丁语）ars：艺术或技艺；有时会出现在英语文章中的拉丁短语里（如“ars longa”）。"},"examples":[{"en":"In the quote “ars longa, vita brevis,” ars means “art” or “skill.”","zh":"在引语“ars longa, vita brevis”中，ars 指“艺术/技艺”。"},{"en":"The book title uses the Latin word ars to suggest craftsmanship.","zh":"这本书的标题用拉丁词 ars 来表达“匠心/技艺”。"}]}],"synonyms":["(medical) acute respiratory illness","(USDA ARS) agricultural research agency","(Latin) art","skill"],"phonetic":"/ˌeɪ ɑr ˈɛs/","extraExplanation":["“ARS”在英语里最常见是缩写，不同领域含义不同（医学、政府机构、科技等）。阅读时可根据上下文判断：医学文章更可能是“急性呼吸综合征”，美国农业相关材料则常指USDA的“Agricultural Research Service”。","拉丁语“ars”常见于格言或文学引用中，例如“ars longa, vita brevis”（技艺长存，人生短暂），用来强调艺术/技艺的长期价值。"]}
{"word":"ARSA","summary":{"en":"ARSA most commonly refers to the Arakan Rohingya Salvation Army, an armed Rohingya insurgent group in Myanmar.","zh":"ARSA最常见指“若开罗兴亚救世军”，是缅甸境内的罗兴亚武装组织。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Arakan Rohingya Salvation Army: an armed Rohingya insurgent group active mainly in Rakhine State, Myanmar.","zh":"若开罗兴亚救世军：主要在缅甸若开邦活动的罗兴亚武装组织（叛乱团体）。"},"examples":[{"en":"ARSA claimed responsibility for several attacks in Rakhine State.","zh":"ARSA宣称对若开邦的数起袭击负责。"},{"en":"News reports often mention ARSA when discussing the Rohingya crisis.","zh":"在讨论罗兴亚危机时，新闻报道常会提到ARSA。"}]}],"synonyms":["Arakan Rohingya Salvation Army"],"phonetic":"/ˈɑr.sə/","extraExplanation":["“ARSA”通常作为缩写出现在国际新闻与人权/地区冲突报道中，涉及缅甸若开邦的族群紧张与难民问题。该缩写带有明显政治与敏感语境，写作时常需要交代全称与背景，避免读者误解。","读音在英语中常按字母读（A-R-S-A）或当作一个词读成“AR-sa”。正式写作中第一次出现建议写全称 Arakan Rohingya Salvation Army (ARSA)。"]}
{"word":"Arsacid","summary":{"en":"Arsacid refers to the dynasty (and its members) that ruled the Parthian Empire in ancient Iran.","zh":"Arsacid 指古代伊朗帕提亚帝国的阿萨息王朝及其成员。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Arsacid (Arsacids), the ruling family (dynasty) that founded and governed the Parthian Empire in ancient Iran (about 247 BCE–224 CE).","zh":"阿萨息德的；指建立并统治古代伊朗帕提亚帝国（约公元前247年—公元224年）的阿萨息王朝（阿萨息家族）。"},"examples":[{"en":"The Arsacid dynasty ruled much of Iran before the rise of the Sasanian Empire.","zh":"阿萨息王朝在萨珊帝国崛起之前统治了伊朗的大片地区。"},{"en":"Arsacid kings often negotiated with Rome and fought along the empire’s western border.","zh":"阿萨息诸王常与罗马谈判，也在帝国西部边境作战。"}]},{"partOfSpeech":"n.","definition":{"en":"a member of the Arsacid ruling family; an Arsacid ruler.","zh":"阿萨息家族成员；阿萨息王朝的统治者。"},"examples":[{"en":"An Arsacid took the throne after a period of internal conflict.","zh":"一位阿萨息家族成员在一段内部冲突后登上王位。"}]}],"synonyms":["Parthian (in many historical contexts)"],"phonetic":"/ˈɑr.sə.sɪd/","extraExplanation":["“Arsacid”来自王朝奠基者阿萨息一世（Arsaces I）的名字，因此也常见写法“Arsacid/Arsacids”指王朝或其统治者。","在英文史学写作中，“Arsacid Empire”通常就是“Parthian Empire（帕提亚帝国）”的另一种称呼；二者经常互换使用，但语境不同：前者更强调王朝家族，后者更强调国家/帝国本身。","常见相关词：Parthian（帕提亚的）、Sasanian（萨珊的）、Achaemenid（阿契美尼德的，波斯第一帝国）。"]}
{"word":"arsacid","summary":{"en":"“arsacid” is not a recognized standard English word; it’s likely a misspelling (possibly of “arsenic acid”).","zh":"“arsacid”不是标准英语词；很可能是拼写错误（可能想写“arsenic acid（砷酸）”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a shortened form used in a specific context (for example, someone may mean “arsenic acid”).","zh":"不是标准英语单词。很可能是拼写错误，或是在特定语境中的缩写/简写（例如有人可能想写“arsenic acid”（砷酸））。"},"examples":[{"en":"I couldn’t find “arsacid” in standard English dictionaries—could you share the sentence you saw it in?","zh":"我在标准英语词典里找不到“arsacid”——你能把它出现的句子发我看看吗？"},{"en":"If you meant “arsenic acid,” the correct spelling is two words: arsenic acid.","zh":"如果你想表达“arsenic acid（砷酸）”，正确拼写是两个词：arsenic acid。"}]}],"extraExplanation":["“arsacid”看起来像把“arsenic acid”（砷酸）或“arsenical acid”等化学术语写错/连写了。也可能是某个产品名、用户名、文件名或实验室内部缩写。若你提供来源（句子、领域：化学/游戏/账号/产品等），我可以更准确判断并给出对应释义。"]}
{"word":"Arsacidan","summary":{"en":"Arsacidan means “connected with the Arsacid (Parthian) dynasty,” or a person from that royal family.","zh":"Arsacidan 指“与阿尔萨息德（帕提亚）王朝有关的”，也可指该王族成员。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Arsacids (the ruling dynasty of the Parthian Empire in ancient Iran).","zh":"与阿尔萨息德王朝有关的；与帕提亚帝国统治王族有关的（古代伊朗地区）。"},"examples":[{"en":"The museum has coins with Arsacidan kings on them.","zh":"博物馆里有印着阿尔萨息德王朝国王头像的硬币。"},{"en":"Arsacidan art often blends Iranian and Hellenistic styles.","zh":"阿尔萨息德时期的艺术常常融合伊朗与希腊化风格。"}]},{"partOfSpeech":"n.","definition":{"en":"A member of the Arsacid dynasty.","zh":"阿尔萨息德王朝的成员；阿尔萨息德家族的人。"},"examples":[{"en":"Some sources describe him as an Arsacidan prince.","zh":"一些资料称他为阿尔萨息德王子。"}]}],"synonyms":["Arsacid","Parthian (related)"],"phonetic":"ˌɑrˈsæsɪdən","extraExplanation":["“Arsacidan”多见于历史/学术语境，是“Arsacid（阿尔萨息德）”的变体形式，来源于王朝奠基者 Arsaces（阿尔萨息斯）。该王朝约在公元前247年建立，统治帕提亚帝国，后被萨珊王朝取代（约公元224年）。","学习上可以把它和“Parthian（帕提亚的）”联系起来：Parthian更强调国家/地区，Arsacidan更强调王朝/家族。"]}
{"word":"arsacidan","summary":{"en":"Arsacidan means “related to the Arsacid (Parthian) dynasty/period,” and less commonly “a person connected with it.”","zh":"Arsacidan 指“与阿尔萨息德（帕提亚）王朝/时期有关的”，较少也可指“与其相关的人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Arsacids (the ruling dynasty of the Parthian Empire in ancient Iran), or to the Parthian period under their rule.","zh":"与阿尔萨息德王朝（古代伊朗帕提亚帝国的统治王朝）有关的；阿尔萨息德/帕提亚时期的。"},"examples":[{"en":"The museum displayed Arsacidan coins from the Parthian Empire.","zh":"博物馆展出了帕提亚帝国的阿尔萨息德王朝钱币。"},{"en":"Some historians describe the region as a key Arsacidan frontier.","zh":"一些历史学家把该地区称为阿尔萨息德时期的重要边境地带。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from, or connected with, the Arsacid dynasty or its Parthian realm (less common).","zh":"阿尔萨息德王朝的人；与其帕提亚政权有关的人（较少见）。"},"examples":[{"en":"In the novel, an Arsacidan appears as a diplomat at the Roman court.","zh":"在小说里，一位阿尔萨息德人作为使节出现在罗马宫廷。"}]}],"synonyms":["Arsacid","Parthian (context-dependent)"],"phonetic":"/ɑrˈsæsɪdən/","extraExplanation":["“Arsacidan”来自“Arsacid”（阿尔萨息德），源于王朝奠基者Arsaces（阿尔萨息斯）。在英文史学写作中，你也更常看到“Arsacid”或“Parthian”作形容词。","阅读古典/历史文本时，相关常见搭配有：Arsacid/Arsacidan dynasty（王朝）、Arsacid/Arsacidan Empire（帝国/政权）、Arsacid/Arsacidan coinage（铸币）。"]}
{"word":"arsanilic","summary":{"en":"Arsanilic means “related to or containing arsanilic acid,” a specific organoarsenic chemical.","zh":"arsanilic 指“与胂氨酸有关的/含胂氨酸的”，胂氨酸是一种特定的有机砷化学物质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to arsanilic acid (an organoarsenic compound), or containing arsanilic acid.","zh":"与“胂氨酸（arsanilic acid，一种有机砷化合物）”有关的；含有胂氨酸的。"},"examples":[{"en":"Researchers tested arsanilic compounds to understand how organoarsenic chemicals behave in animals.","zh":"研究人员测试了与胂氨酸相关的化合物，以了解有机砷化学品在动物体内的行为。"},{"en":"The report mentioned arsanilic acid and other arsanilic derivatives used in older veterinary practices.","zh":"报告提到了胂氨酸以及其他胂氨酸衍生物，它们曾用于较早时期的兽医实践中。"}]}],"synonyms":["arsanilic acid–related","organoarsenic (related)"],"phonetic":"ˌɑr.səˈnɪl.ɪk","extraExplanation":["“arsanilic”多见于化学/毒理学/兽医学文献，属于较专业的词。它通常用来修饰“acid（酸）”“compound（化合物）”“derivative（衍生物）”等名词。","与砷相关的化学品具有潜在毒性与环境风险；在现代语境中，该词常出现在对历史用药、环境残留或安全监管的讨论里。"]}
{"word":"ARSB","summary":{"en":"ARSB usually refers to Amon-Ra St. Brown (Detroit Lions) in sports and online talk.","zh":"ARSB 通常在体育与网络语境中指阿蒙-拉·圣布朗（底特律雄狮队）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An initialism most commonly used online and in sports contexts to refer to Amon-Ra St. Brown, an NFL wide receiver for the Detroit Lions.","zh":"一个常见于网络与体育语境的缩写，通常指底特律雄狮队（Detroit Lions）的NFL外接手阿蒙-拉·圣布朗（Amon-Ra St. Brown）。"},"examples":[{"en":"I’m starting ARSB in fantasy football this week.","zh":"我这周梦幻橄榄球要让 ARSB 上场首发。"},{"en":"ARSB had a huge game for the Lions.","zh":"ARSB 这场比赛为雄狮队打出了非常亮眼的表现。"},{"en":"In group chats, people often just write “ARSB” instead of his full name.","zh":"在群聊里，大家常常直接写“ARSB”，不写他的全名。"}]}],"synonyms":["Amon-Ra St. Brown","St. Brown"],"phonetic":"/ˌeɪ ɑr ɛs ˈbiː/","extraExplanation":["“ARSB”属于社群内的简称/缩写，用法很口语、很“圈内”。在NFL讨论、梦幻足球（fantasy football）、体育新闻标题或推特/X上尤其常见。","读法通常是逐个字母念（A-R-S-B），而不是当作一个词来读。"]}
{"word":"arse","summary":{"en":"“Arse” is a vulgar British-English word for “buttocks,” and it can also mean “to mess up” in informal speech.","zh":"“arse”是英式英语里表示“屁股”的粗俗说法，也可在非正式口语中表示“搞砸”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(vulgar, mainly British English) the buttocks; the rear end.","zh":"（粗俗词，主要英式英语）屁股；臀部。"},"examples":[{"en":"He slipped on the ice and landed on his arse.","zh":"他在冰上滑倒了，一屁股摔在地上。"},{"en":"Get off your arse and help me carry this box.","zh":"别再懒着不动了，起来帮我搬这个箱子。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal, mainly British) to do something badly or carelessly; to mess up.","zh":"（非正式，主要英式）把事情搞砸；做得很差/很马虎。"},"examples":[{"en":"I really arsed that presentation up—I forgot the main points.","zh":"我把那次展示搞砸了——把重点都忘了。"},{"en":"Don’t arse it up; double-check the address before you send it.","zh":"别搞砸了；发之前再核对一下地址。"}]}],"synonyms":["buttocks","rear","bottom","ass (vulgar)","mess up (verb)","screw up (verb)"],"phonetic":"/ɑrs/","extraExplanation":["“arse”在英式英语里很常见，但属于明显粗俗用语；在正式场合、工作邮件、课堂写作里应避免。美式英语里更常用对应词“ass”（同样粗俗/不正式）。","常见搭配：get off your arse（别偷懒/赶紧行动）、arse around/arse about（瞎混、磨蹭）、arse up（搞砸）。使用时注意语境和对象，避免冒犯。"]}
{"word":"arsedine","summary":{"en":"“Arsedine” is not a standard word; you probably mean “arsenide,” a compound containing arsenic and another element.","zh":"“arsedine”不是标准英文词；你很可能想写“arsenide（砷化物）”，指含砷与另一元素形成的化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended: arsenide) a chemical compound made of arsenic and another element (often a metal), where arsenic has a negative oxidation state.","zh":"（更可能想写：arsenide）“砷化物”：由砷与另一种元素（常为金属）形成的化合物，通常表示砷带负价态。"},"examples":[{"en":"Gallium arsenide is used in some high-speed electronics and solar cells.","zh":"砷化镓用于一些高速电子器件和太阳能电池中。"},{"en":"Many arsenides can be toxic, so they must be handled carefully.","zh":"许多砷化物具有毒性，因此必须小心处理。"}]}],"synonyms":["arsenic compound"],"phonetic":"/ˈɑrsəˌnaɪd/","extraExplanation":["“arsedine”不是常见或标准的英文词形；最接近、最常用的拼写是 **arsenide**（砷化物）。如果你指的是某种具体药物名、品牌名或专有名词，请告诉我出现它的句子或来源，我可以帮你准确确认。","词尾 **-ide** 在化学里常表示“二元化合物/阴离子化合物”（如 oxide 氧化物、chloride 氯化物），所以 **arsenide** 按构词法就是“砷化物”。"]}
{"word":"arsefoot","summary":{"en":"A vulgar British/Scots slang term for a clumsy, slow-moving person; also seen as the adjective arsefooted.","zh":"英式/苏格兰方言俚语（较粗俗），指笨拙、动作迟缓的人；也常见作形容词 arsefooted。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(British/Scots slang, vulgar) A clumsy or awkward person; someone who moves in a slow, heavy, or ungainly way.","zh":"（英式/苏格兰方言俚语，带粗俗色彩）笨拙的人；走路慢吞吞、步伐沉重不灵活的人。"},"examples":[{"en":"He’s such an arsefoot on the dance floor—he keeps bumping into everyone.","zh":"他在舞池里真是个笨手笨脚的人——老是撞到别人。"},{"en":"Stop dragging your feet, you arsefoot—we’re going to be late.","zh":"别磨磨蹭蹭的，你这慢吞吞的家伙——我们要迟到了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) Used as an adjective in the form arsefooted: slow-moving or clumsy.","zh":"（较少见）常以形容词形式 arsefooted 出现：行动迟缓的；笨拙的。"},"examples":[{"en":"It was an arsefooted attempt at a joke, but everyone laughed anyway.","zh":"那是个有点笨拙的玩笑尝试，但大家还是笑了。"}]}],"synonyms":["clumsy person","slowpoke","oaf","lout"],"phonetic":"/ˈɑrsˌfʊt/","extraExplanation":["这个词含有粗俗成分“arse”（相当于美式口语里的“ass”），用在陌生人或正式场合容易冒犯。更中性的表达可以用 clumsy / awkward / slowpoke。","在现实语料中更常见的是形容词 arse-footed / arsefooted（拼写会有连字符差异），名词 arsefoot 相对少见。"]}
{"word":"arsehole","summary":{"en":"A very offensive word meaning a hateful person; also a crude term for the anus.","zh":"非常冒犯的粗口：骂人“混蛋/讨厌鬼”；也可粗俗地指“肛门”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Vulgar, offensive) A rude insult for a person you strongly dislike; someone seen as very unpleasant, selfish, or cruel.","zh":"（粗俗、冒犯）对你非常讨厌的人的侮辱性称呼；指被认为很讨厌、自私或刻薄的人。"},"examples":[{"en":"Don’t call people an arsehole at work—you could get in trouble.","zh":"在工作场合别骂人“arsehole”，你可能会惹上麻烦。"},{"en":"He cut in line and acted like an arsehole about it.","zh":"他插队还一副很嚣张的样子，真讨厌。"}]},{"partOfSpeech":"n.","definition":{"en":"(Vulgar) The anus.","zh":"（粗俗）肛门。"},"examples":[{"en":"The word is also used to mean the anus, but it’s very crude.","zh":"这个词也可以指“肛门”，但说法非常粗俗。"}]}],"synonyms":["asshole","jerk","idiot","bastard","prick"],"phonetic":"/ˈɑrsˌhoʊl/","extraExplanation":["这是非常粗口、攻击性很强的词，很多场合（学校、职场、正式对话、对陌生人）都不合适。更安全的替代说法有：jerk（讨厌鬼）、mean person（刻薄的人）、rude guy（没礼貌的人）。","拼写 arsehole 更常见于英式英语；美式英语更常写作 asshole。两者含义相同，但都同样粗俗。"]}
{"word":"arsen","summary":{"en":"Arsen is usually a male first name, not a common English vocabulary word.","zh":"Arsen 通常是男性名，不是常见的英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a male given name (used in several countries, especially Eastern Europe and the Caucasus).","zh":"男性名字（在东欧与高加索地区等国家较常见）。"},"examples":[{"en":"Arsen moved to the U.S. for graduate school.","zh":"Arsen 为了读研究生搬到了美国。"},{"en":"I met a doctor named Arsen at the conference.","zh":"我在会议上认识了一位叫 Arsen 的医生。"}]},{"partOfSpeech":"other","definition":{"en":"(less common) a short form or variant of names like Arseniy/Arseni (from Greek, meaning “masculine”).","zh":"（较少见）Arseniy/Arseni 等名字的简称或变体（源自希腊语，含义与“男性/阳刚”相关）。"},"examples":[{"en":"In some families, Arsen is used as a nickname for Arseniy.","zh":"在一些家庭里，Arsen 会作为 Arseniy 的昵称。"}]}],"synonyms":["Arseniy","Arseni","Arsenio"],"phonetic":"/ˈɑr.sən/","extraExplanation":["“Arsen”常被英语学习者误看成以 arsen- 开头的英语词根（例如 arsenic 砷；arsenal 军械库/资源库），但“Arsen”本身通常是人名。","常见发音接近“AR-sən”。如果你其实想查的是 arsenic 或 arsenal，告诉我我可以分别给出词义、用法和例句。"]}
{"word":"arsenal","summary":{"en":"An arsenal is a place for storing/making weapons, or (figuratively) a large set of resources or skills; it can also refer to the London soccer club Arsenal.","zh":"arsenal 指军火库/兵工厂，也可比喻为一整套可用的资源或技能；大写 Arsenal 还可指伦敦足球俱乐部阿森纳。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place or building where weapons and military equipment are stored, repaired, or made","zh":"军火库；兵工厂（存放、维修或制造武器装备的地方）"},"examples":[{"en":"The city’s old arsenal was turned into a museum.","zh":"这座城市的旧军火库被改建成了博物馆。"},{"en":"During the war, the arsenal worked day and night to produce supplies.","zh":"战争期间，兵工厂昼夜不停地生产军需品。"}]},{"partOfSpeech":"n.","definition":{"en":"a large collection of resources or skills that can be used to achieve something (often in politics, business, or sports)","zh":"（可用来达成目标的）一整套资源/手段/技能储备"},"examples":[{"en":"She has an arsenal of strategies for dealing with difficult customers.","zh":"她有一整套应对难缠顾客的策略。"},{"en":"The team added new players to its arsenal this season.","zh":"这个赛季球队把新球员纳入了自己的“武器库”。"}]},{"partOfSpeech":"n.","definition":{"en":"Arsenal: a professional soccer club in London, England (often simply called “Arsenal”)","zh":"阿森纳：英格兰伦敦的职业足球俱乐部（常简称“阿森纳”）"},"examples":[{"en":"He’s an Arsenal fan and watches every match.","zh":"他是阿森纳球迷，每场比赛都看。"}]}],"synonyms":["armory","weapons depot","stockpile","storehouse","collection","repertoire"],"phonetic":"/ˈɑrsənəl/","extraExplanation":["“arsenal”原本指与军事相关的武器储存与制造场所，来自阿拉伯语词源，经由意大利语/法语进入英语。现代英语里常用作比喻，表示“可用的手段/资源很多”，类似中文的“十八般武艺”“工具箱”。","大写的 Arsenal 通常特指足球俱乐部；在新闻或口语中若不大写，一般按普通名词理解。"]}
{"word":"arsenals","summary":{"en":"“Arsenals” means weapon stores or armament facilities, and figuratively a collection of useful tools or skills.","zh":"“Arsenals”指军火库/军备设施；也可引申为一整套可用的工具或技能。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of arsenal) Stores of weapons and military equipment; also the buildings or places where they are made or kept.","zh":"（arsenal 的复数）武器与军事装备的储存（或制造、保管的场所/设施）。"},"examples":[{"en":"The country’s arsenals were placed under tight security.","zh":"该国的军火库受到了严格安保。"},{"en":"Several arsenals near the port were damaged in the attack.","zh":"港口附近的几座军械库在袭击中受损。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) Collections of tools, resources, or skills used to achieve a goal.","zh":"（比喻）为达成目标而拥有的一整套工具、资源或技能。"},"examples":[{"en":"A good teacher has many strategies in their arsenal.","zh":"优秀的老师会有一整套教学策略。"},{"en":"She added negotiation to her arsenal of professional skills.","zh":"她把谈判能力加入了自己的职业技能“武器库”。"}]}],"synonyms":["armories","stores","stockpiles","supplies","resources","toolkit"],"phonetic":"/ˈɑrsənəlz/","extraExplanation":["“arsenal”一词历史上与军事密切相关：它经由意大利语 *arsenale* 进入英语，最早可追溯到阿拉伯语中表示“造船厂/制造工场”的说法（常见解释为 *dār aṣ-ṣināʿa*，意为“工业/制造之屋”）。因此它既可指“军械库”，也可指“制造与储存军备的设施”。在现代英语里很常见的引申用法是把“技能/资源”比作“武器”，如 *in your arsenal*。"]}
{"word":"arsenate","summary":{"en":"Arsenate is a salt/compound of arsenic acid or the arsenate ion (AsO₄³⁻), often discussed in contamination and toxicity contexts.","zh":"Arsenate 指砷酸盐或砷酸根（AsO₄³⁻），常用于污染与毒性相关语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (a salt or ester) of arsenic acid, or the arsenate ion (AsO₄³⁻); arsenates contain arsenic and are often toxic","zh":"砷酸盐；砷酸根（AsO₄³⁻）。指砷酸的盐或酯，通常含砷，常具有毒性"},"examples":[{"en":"The lab tested the soil for arsenate contamination.","zh":"实验室检测土壤中是否存在砷酸盐污染。"},{"en":"Arsenate can interfere with plant growth and harm wildlife.","zh":"砷酸盐会干扰植物生长并危害野生动物。"},{"en":"Some minerals naturally contain arsenate, but industrial pollution can raise levels.","zh":"有些矿物天然含砷酸盐，但工业污染会使其含量升高。"}]}],"synonyms":["arsenate ion","arsenic(V) compound","salt of arsenic acid"],"phonetic":"/ɑrˈsɛn.eɪt/","extraExplanation":["“Arsenate”在环境与健康语境中常与水质/土壤污染、农药（历史上某些含砷制剂）及职业暴露相关；由于“arsen-”与“arsenic（砷）”同源，看到该词通常要联想到潜在毒性与需要管控/检测。","在化学上它常被用来对比“arsenite（亚砷酸盐）”：一般来说，arsenate对应较高氧化态的砷（+5），arsenite对应较低氧化态（+3）。日常阅读中，区分两者有助于理解环境报告或安全数据表。"]}
{"word":"arsenates","summary":{"en":"“Arsenates” means salts/compounds containing the arsenate (AsO₄³⁻) group; it is the plural of “arsenate.”","zh":"“arsenates”指含砷酸根（AsO₄³⁻）的砷酸盐/化合物，是“arsenate”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Salts or esters of arsenic acid (H₃AsO₄), containing the arsenate ion (AsO₄³⁻); “arsenates” is the plural form of “arsenate.”","zh":"砷酸盐（或砷酸酯）：由砷酸（H₃AsO₄）形成、含砷酸根离子（AsO₄³⁻）的盐或酯；“arsenates”为“arsenate”的复数。"},"examples":[{"en":"The lab tested the soil for heavy metals, including arsenates.","zh":"实验室检测了土壤中的重金属，包括砷酸盐。"},{"en":"Some minerals naturally contain arsenates, which can be hazardous if released into water.","zh":"一些矿物天然含有砷酸盐，如果进入水体可能有危害。"}]}],"synonyms":["arsenate salts","arsenic(V) salts"],"phonetic":"/ˈɑrsəˌneɪt/","extraExplanation":["在环境与健康语境中，“arsenates/砷酸盐”常与污染、地下水安全、农药残留等话题相关；它们是“砷（arsenic）”的一类化合物形态。","在化学表达中，“arsenate”也常指“砷酸根（arsenate ion）”。与“arsenite（亚砷酸盐/砷酸盐的另一种氧化态）”不同，arsenate通常对应更高的氧化态（常见为As(V)）。"]}
{"word":"arsenation","summary":{"en":"Arsenation is a rare technical noun meaning the introduction of arsenic (or arsenic compounds) into a substance.","zh":"Arsenation 是一个较少见的技术性名词，指把砷（或砷化合物）引入某种物质的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of introducing arsenic (or an arsenic compound) into a material or chemical substance; treatment with arsenic","zh":"向材料或化学物质中引入砷（或砷化合物）的过程；用砷进行处理"},"examples":[{"en":"In older chemical texts, arsenation refers to adding an arsenic compound to a reaction mixture.","zh":"在较早的化学文献中，arsenation 指向反应混合物中加入砷化合物。"},{"en":"Because arsenic is highly toxic, any arsenation step requires strict safety controls.","zh":"由于砷具有高毒性，任何 arsenation 步骤都必须有严格的安全控制。"}]}],"synonyms":["arsenic treatment","introduction of arsenic","arsenication (rare)"],"phonetic":"ˌɑr.səˈneɪ.ʃən","extraExplanation":["这个词非常少见，主要出现在化学/材料相关的专业语境中；日常英语几乎不用。更常见的表达会直接说 “adding arsenic/arsenic compounds” 或具体反应名称（例如形成某种砷化物、砷酸盐等）。","与 “arsenation” 外形相近但意义不同的词：\"arsenal\"（军械库/工具库），\"arsenate\"（砷酸盐/使成砷酸盐），注意不要混淆。"]}
{"word":"arseneted","summary":{"en":"“arseneted” is not standard; it most likely means “arsenated,” i.e., containing arsenic or treated with an arsenic compound.","zh":"“arseneted”并非标准拼写；通常是指“arsenated”，即“含砷的/用含砷化合物处理过的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely a misspelling of “arsenated”) treated with arsenic or an arsenic compound; containing arsenate.","zh":"（很可能是“arsenated”的拼写错误）用砷或含砷化合物处理过的；含有砷酸盐的。"},"examples":[{"en":"In the past, some wood was arsenated to prevent insect damage.","zh":"过去有些木材会用含砷药剂处理，以防虫蛀。"},{"en":"The lab report mentioned arsenated samples, so we handled them with extra care.","zh":"实验报告提到样品含砷处理过，所以我们格外小心操作。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past form of the verb “arsenate”: to treat or combine with arsenic/arsenate.","zh":"动词“arsenate”的过去式/过去分词：用砷（或砷酸盐）处理；与砷（或砷酸盐）结合。"},"examples":[{"en":"The timber was arsenated before shipping.","zh":"这批木材在运输前做了含砷处理。"}]}],"synonyms":["arsenated","arsenic-treated","arsenical"],"phonetic":"ˈɑrsəˌneɪtɪd","extraExplanation":["“arseneted”不是常见标准拼写。最常见的对应词是“arsenated”（意为“用砷处理过的/含砷的”）。如果你是从文章或标签上看到的，也可能是拼写错误或非常罕见的变体。","含砷物质具有毒性。在现实生活中讨论或接触相关材料时，应遵守当地安全规范（如佩戴手套、避免吸入粉尘等）。"]}
{"word":"arsenetted","summary":{"en":"“Arsenetted” is a rare word meaning ‘treated with arsenic’ or ‘poisoned with arsenic.’","zh":"“arsenetted”是罕见词，意思是“用砷处理过的/含砷的”，也可指“被砷下毒的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Treated with arsenic; containing arsenic (often describing something poisoned or preserved with arsenic).","zh":"（罕用）用砷处理过的；含砷的（常指被砷毒害或用砷防腐/保存的）。"},"examples":[{"en":"The old taxidermy specimen may have been arsenetted to keep insects away.","zh":"那件旧的动物标本可能用砷处理过，以防昆虫侵蚀。"},{"en":"He suspected the food was arsenetted and refused to eat it.","zh":"他怀疑食物被下了砷毒，便拒绝食用。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare) Past tense/past participle of “arsenette”: to poison or treat with arsenic.","zh":"（罕用）“arsenette”的过去式/过去分词：用砷使中毒；用砷处理。"},"examples":[{"en":"The rats were arsenetted by bait left in the cellar.","zh":"地窖里留下的毒饵使老鼠中了砷毒。"},{"en":"Some museum skins were arsenetted decades ago for preservation.","zh":"一些博物馆藏皮在几十年前曾用砷处理以便保存。"}]}],"synonyms":["arsenic-treated","arsenical","poisoned (with arsenic)"],"phonetic":"/ˌɑr.səˈnɛt.ɪd/","extraExplanation":["“arsenetted”非常少见，更常见的表达是 **arsenic-treated**（用砷处理的）、**arsenical**（含砷的）或 **poisoned with arsenic**（用砷下毒）。","历史上砷曾用于灭虫、防腐（例如标本制作、皮革/毛皮处理），也与“下毒”在文学与社会新闻中有典型联系。不过砷极毒，现代使用受到严格管制。"]}
{"word":"arsenfast","summary":{"en":"“arsenfast” is not a standard English word; it’s likely a misspelling or a proper name.","zh":"“arsenfast”不是标准英语词汇，更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username/brand name, or a rare proper noun (e.g., a surname).","zh":"不是标准英语单词。可能是拼写错误、用户名/品牌名，或非常少见的专有名词（如姓氏）。"},"examples":[{"en":"I can’t find “arsenfast” in standard English dictionaries—could you share the sentence where you saw it?","zh":"我在标准英语词典里找不到“arsenfast”——你能把它出现的句子发给我吗？"},{"en":"If you meant “arsenic,” the spelling is a-r-s-e-n-i-c.","zh":"如果你想写的是“arsenic（砷）”，拼写是 a-r-s-e-n-i-c。"}]}],"synonyms":["(If you meant) arsenic","(If you meant) arsenal","(If you meant) steadfast"],"extraExplanation":["“arsenfast”看起来像由两部分拼在一起：arsen-（让人联想到 arsenic/arsenal 等词根开头）+ fast（“快的/牢固的”）。但英语里没有常见词条是这个拼法。","你可以检查是否想表达下面这些更常见的词：\n- arsenic /ˈɑrsənɪk/：砷（有毒化学元素）\n- arsenal /ˈɑrsənəl/：军械库；（比喻）一整套手段\n- steadfast /ˈstɛdˌfæst/：坚定的\n- as fast as：和……一样快（短语）","把“arsenfast”所在的上下文句子贴出来（前后各一两句）或告诉我是人名/地名/游戏名，我就能更准确判断你要找的意思和正确拼写。"]}
{"word":"arsenferratose","summary":{"en":"“arsenferratose” is not a recognized English word; it’s likely a misspelling or a highly specialized term.","zh":"“arsenferratose”不是常见或可查的英语单词；更可能是拼写错误或极专业术语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a made-up form, or a very specialized chemical name.","zh":"不是标准英语单词。可能是拼写错误、杜撰词，或极少见的专业（化学）术语。"},"examples":[{"en":"I can’t find “arsenferratose” in major English dictionaries—could you share the sentence you saw it in?","zh":"我在主流英语词典里查不到“arsenferratose”，你能把它出现的句子发我吗？"},{"en":"If it’s a chemistry term, the correct spelling might be different.","zh":"如果这是化学术语，正确拼写可能不一样。"}]}],"extraExplanation":["从构词上看，它看起来像把“arsen-（砷）”和“ferr-（铁）”拼在一起的拟化学词根，但英语里常见的相关词更可能是：arsenic（砷）、ferrous/ferric（亚铁/三价铁）、arsenate（砷酸盐）、ferrate（高铁酸盐）等。","如果你能提供：①它出现的上下文句子；②是否来自化学/矿物/医学文本；③是否可能是扫描/转写错误（比如把字母看错），我可以帮你反查最可能的原词和含义。"]}
{"word":"arsenhemol","summary":{"en":"Arsenhemol is an old name for an arsenic-based medicine once used to treat infections (especially syphilis), now largely obsolete.","zh":"Arsenhemol 是一种含砷的旧式药名，曾用于治疗感染（尤指梅毒），现已基本淘汰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historical brand/name for an arsenic-containing medicine (an arsphenamine-type drug) once used to treat infections such as syphilis; now obsolete because safer antibiotics are available and arsenic drugs can be toxic.","zh":"一种含砷的旧式药物名称（属“胂凡纳明/砷胺类”一类），曾用于治疗如梅毒等感染；因毒性较大且后来有更安全的抗生素而基本淘汰。"},"examples":[{"en":"Before penicillin became widely available, doctors sometimes used arsenhemol to treat syphilis.","zh":"在青霉素广泛使用之前，医生有时会用 arsenhemol 来治疗梅毒。"},{"en":"Arsenhemol is mainly mentioned in historical discussions of early antimicrobial therapy.","zh":"arsenhemol 主要出现在关于早期抗感染治疗的历史讨论中。"}]}],"synonyms":["arsphenamine","Salvarsan","arsenic-based drug"],"phonetic":"/ɑrˈsɛnhiˌmɔl/","extraExplanation":["“arsen-”表示“砷”，这类药物与20世纪初期的“Salvarsan（606号）/arsphenamine（胂凡纳明）”同属一个时代背景。如今医学上几乎不再使用含砷药物来治疗此类感染。","你输入的拼写可能是较少见的商品名/旧文献用名；如果你想查的是更常见的词，可能是 **arsphenamine** 或 **Salvarsan**。你也可以告诉我它出现的句子或出处，我可以帮你核对。"]}
{"word":"arseniasis","summary":{"en":"Arseniasis is a medical term meaning illness/poisoning caused by arsenic exposure, often long-term.","zh":"Arseniasis 是医学术语，指因接触砷而导致的疾病/中毒，常为长期暴露所致。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) illness or poisoning caused by exposure to arsenic, especially long-term (chronic) exposure.","zh":"（医学）砷中毒；因接触砷而引起的疾病，尤指长期（慢性）暴露导致的中毒。"},"examples":[{"en":"Workers in mines may develop arseniasis if safety controls are weak.","zh":"如果安全防护不到位，矿山工人可能会出现砷中毒。"},{"en":"The doctor suspected arseniasis after seeing skin changes and reviewing the patient’s water source.","zh":"医生在看到皮肤变化并了解患者的饮水来源后，怀疑是砷中毒。"}]}],"synonyms":["arsenic poisoning","chronic arsenic poisoning","arsenicism"],"phonetic":"/ˌɑr.səˈnaɪ.ə.sɪs/","extraExplanation":["词源提示：arseniasis 由 “arsenic（砷）” + “-iasis（表示疾病/病态的后缀）”构成，常用于医学或公共卫生语境，日常英语更常说 “arsenic poisoning（砷中毒）” 或 “chronic arsenic poisoning（慢性砷中毒）”。","常见语境：谈论受污染的地下水、工业/采矿暴露、农药或防腐剂历史使用等。医学描述中可能会提到皮肤色素沉着、角化（手掌/脚底粗糙增厚）等线索，但具体诊断需要专业检测。"]}
{"word":"arseniate","summary":{"en":"Arseniate is a (less common) term for an arsenate compound—a salt or ester of arsenic acid.","zh":"Arseniate（较少用）指砷酸盐/砷酸酯，即砷酸的盐或酯类化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound that is a salt or ester of arsenic acid (containing the arsenate ion, AsO₄³⁻).","zh":"砷酸盐；砷酸酯（含有砷酸根 AsO₄³⁻ 的化合物）。"},"examples":[{"en":"Calcium arseniate was once used in some pesticides, but it is highly toxic.","zh":"砷酸钙曾经用于某些杀虫剂，但毒性很强。"},{"en":"In chemistry class, we learned that arseniate compounds contain arsenic in a high oxidation state.","zh":"在化学课上，我们学到砷酸盐化合物中的砷通常处于较高氧化态。"}]}],"synonyms":["arsenate","arsenic acid salt"],"phonetic":"/ɑrˈsiːniˌeɪt/","extraExplanation":["“arseniate”在现代英语里更常见的形式是“arsenate”。“arseniate”多见于较旧的化学文献或特定命名习惯中。","由于与砷有关，这类物质通常具有较强毒性；涉及实验或工业安全时应格外注意（如通风、手套、合规处置等）。"]}
{"word":"arsenic","summary":{"en":"Arsenic is a poisonous chemical element (As), and it can also mean a poison made from it.","zh":"Arsenic 指有毒的化学元素“砷”(As)，也可指由砷制成的毒药。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A poisonous chemical element (symbol As) often found in some rocks, soil, and water; it can be harmful to humans even in small amounts.","zh":"砷（化学元素，符号 As）：一种有毒元素，常见于某些岩石、土壤和水中；即使少量也可能对人体有害。"},"examples":[{"en":"The report warned that arsenic levels in the well water were unsafe.","zh":"报告警告说，这口井水中的砷含量不安全。"},{"en":"Long-term exposure to arsenic can cause serious health problems.","zh":"长期接触砷可能导致严重的健康问题。"}]},{"partOfSpeech":"n.","definition":{"en":"A poison made from arsenic, historically used for killing or pest control.","zh":"砷毒（由砷制成的毒药）：历史上曾用于杀人或灭虫等用途。"},"examples":[{"en":"In old mystery stories, arsenic was sometimes used as a secret poison.","zh":"在一些老式悬疑故事里，砷有时被用作秘密毒药。"},{"en":"The novel mentioned “arsenic and rat poison” in a dark, dramatic scene.","zh":"小说在一个阴暗戏剧性的场景中提到“砷和老鼠药”。"}]}],"synonyms":["As (chemical symbol)","poison (general meaning)"],"phonetic":"/ˈɑr.sə.nɪk/","extraExplanation":["“arsenic”在英语文化里常出现在侦探小说、舞台剧与黑色幽默中，因为它曾是较常见、容易获取的毒物之一。著名例子是舞台剧《Arsenic and Old Lace》（《砒霜与旧蕾丝》），借“arsenic”制造荒诞与悬疑的气氛。","发音小提示：结尾的“-ic”常读作 /-ɪk/；重音在第一音节：AR-se-nic。"]}
{"word":"arsenical","summary":{"en":"Arsenical means ‘containing arsenic’ or, as a noun, ‘an arsenic-containing substance.’","zh":"Arsenical 指“含砷的/与砷有关的”，也可作名词指“含砷物质（如砷基药剂）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing arsenic; related to arsenic (a poisonous chemical element).","zh":"含砷的；与砷有关的（砷是一种有毒的化学元素）。"},"examples":[{"en":"The lab stored arsenical compounds in a locked cabinet.","zh":"实验室把含砷化合物存放在上锁的柜子里。"},{"en":"Older medicines sometimes included arsenical ingredients, which are now tightly controlled.","zh":"较早的药物有时含有砷成分，如今这类成分受到严格管控。"}]},{"partOfSpeech":"n.","definition":{"en":"(Noun) A substance that contains arsenic, especially an arsenic-based pesticide or chemical.","zh":"（名词）含砷的物质，尤指砷基农药或化学品。"},"examples":[{"en":"Farm records mentioned the use of an arsenical to protect crops.","zh":"农场记录提到使用含砷药剂来保护作物。"}]}],"synonyms":["arsenic-containing","arsenous","arsenic-based"],"phonetic":"/ɑrˈsɛnɪkəl/","extraExplanation":["“arsenical”在现代英语里多见于科学、医学史、环境与农业语境。过去一些“砷剂/砷基药物”曾用于治疗或杀虫，但因毒性与污染风险，如今使用受到严格限制。阅读历史文本或侦探小说时，arsenical 有时会与“投毒”“致命毒药”的文化意象相关。"]}
{"word":"arsenicalism","summary":{"en":"Arsenicalism means illness or poisoning caused by exposure to arsenic, especially chronic exposure.","zh":"arsenicalism 指因接触砷而导致的中毒或疾病，尤指慢性砷暴露引起的问题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Poisoning or illness caused by exposure to arsenic, especially long-term (chronic) exposure.","zh":"砷中毒；因接触砷（尤其是长期、慢性接触）而引起的疾病或不适。"},"examples":[{"en":"The doctor considered arsenicalism after learning the patient had been drinking well water for years.","zh":"医生得知病人多年饮用井水后，开始考虑是否为砷中毒。"},{"en":"Symptoms of arsenicalism can include stomach pain, skin changes, and numbness in the hands or feet.","zh":"砷中毒的症状可能包括胃痛、皮肤改变，以及手脚麻木。"}]},{"partOfSpeech":"n.","definition":{"en":"A condition or pattern of illness associated with arsenic-containing products or environments (used mainly in medical or historical writing).","zh":"与含砷产品或环境有关的一类病症（多见于医学或历史性写作中的用法）。"},"examples":[{"en":"Historical reports linked arsenicalism to certain pigments used in household items.","zh":"历史报告曾将砷中毒与家用品中使用的某些颜料联系起来。"},{"en":"In older medical texts, arsenicalism was discussed alongside other forms of industrial poisoning.","zh":"在较早的医学文献中，砷中毒常与其他工业性中毒一起讨论。"}]}],"synonyms":["arsenic poisoning","chronic arsenic poisoning","arsenicosis"],"phonetic":"/ˌɑr.səˈnɪk.əˌlɪ.zəm/","extraExplanation":["这个词比较少见，常出现在医学论文、公共卫生报告或历史材料里；日常英语更常用的是“arsenic poisoning（砷中毒）”或“chronic arsenic poisoning（慢性砷中毒）”。","历史上砷曾被用于杀虫剂、某些颜料（例如旧式壁纸/染料）以及部分药物制剂；因此在环境污染或职业暴露的语境中，可能会看到“arsenicalism”来概括一组由砷引发的症状。"]}
{"word":"arsenicate","summary":{"en":"Arsenicate is a chemistry term meaning an arsenic-acid salt/ester, and it can also mean to treat or contaminate something with arsenic.","zh":"arsenicate 是化学用语，指砷酸盐/砷酸的酯；也可作动词，表示用砷处理或使受砷污染。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical salt or ester of arsenic acid (arsenic(V) acid); a compound containing the arsenate/arsenicate group","zh":"砷酸盐；（砷酸的）盐或酯；含砷酸根的化合物"},"examples":[{"en":"Some minerals naturally contain arsenicates.","zh":"一些矿物天然含有砷酸盐。"},{"en":"The lab analyzed the water for traces of arsenicate compounds.","zh":"实验室检测了水中是否有微量的砷酸盐化合物。"}]},{"partOfSpeech":"vt.","definition":{"en":"to treat or contaminate with arsenic or an arsenic compound","zh":"用砷或含砷化合物处理；使受砷污染"},"examples":[{"en":"In the past, some products were arsenicated to prevent pests.","zh":"过去有些产品会用含砷物质处理以防虫害。"},{"en":"The soil may have been arsenicated by industrial waste.","zh":"土壤可能被工业废弃物造成了砷污染。"}]}],"synonyms":["arsenate","arsenical compound","contaminate (with arsenic)"],"phonetic":"/ɑrˈsɛnɪˌkeɪt/","extraExplanation":["“arsenicate”在现代英语中更常见于化学或环境检测语境；日常表达里，人们更常用“arsenate（砷酸盐）”这个词。","砷及其化合物具有毒性；涉及水质、土壤或食品安全时，通常会与“contamination（污染）”“toxic（有毒的）”“regulation（监管/标准）”等词一起出现。"]}
{"word":"arsenicated","summary":{"en":"“Arsenicated” means containing arsenic or having been treated with arsenic.","zh":"“arsenicated”指“含砷的”或“用砷处理过的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing arsenic; polluted or mixed with arsenic.","zh":"含砷的；被砷污染或混入砷的。"},"examples":[{"en":"Tests showed that the well water was arsenicated and unsafe to drink.","zh":"检测显示井水含砷，饮用不安全。"},{"en":"The soil near the old factory was arsenicated after years of dumping.","zh":"那家旧工厂附近的土壤因多年倾倒废料而含砷污染。"}]},{"partOfSpeech":"adj.","definition":{"en":"Treated with arsenic (for example, as a pesticide or preservative, especially in older practices).","zh":"用砷处理过的（例如作杀虫剂或防腐剂，尤指较早时期的做法）。"},"examples":[{"en":"Some historical specimens were arsenicated to prevent insect damage.","zh":"一些历史标本曾用砷处理，以防虫蛀。"},{"en":"In the past, certain materials were arsenicated as a preservative, but safer methods are used today.","zh":"过去有些材料会用砷作防腐处理，但如今多采用更安全的方法。"}]}],"synonyms":["arsenic-laced","arsenic-contaminated","arsenical","poisoned"],"phonetic":"ɑrˈsɛnɪˌkeɪtɪd","extraExplanation":["“arsenicated”来自“arsenicate”（使含砷/用砷处理）。由于砷具有毒性，它曾被用于某些杀虫、防腐或保存用途（例如部分旧式标本保存），但现代多数国家已严格限制或禁止相关做法。阅读历史文献或环境新闻时，这个词常用来强调“有毒污染/处理过”的含义。"]}
{"word":"arsenicating","summary":{"en":"“arsenicating” means treating, preserving, or contaminating something with arsenic (a toxic chemical).","zh":"“arsenicating”指用砷处理某物（用于防腐/杀虫等）或用砷进行污染、投毒。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"treating or poisoning something with arsenic (often to preserve, kill pests, or contaminate).","zh":"用砷（砒霜等砷化合物）处理某物；（也可指）用砷毒害、污染。"},"examples":[{"en":"In the past, some collectors tried arsenicating animal skins to protect them from insects.","zh":"过去有些收藏者会用砷处理动物皮毛，以防虫蛀。"},{"en":"The report warned that arsenicating food or water is a serious criminal act.","zh":"报告警告说，用砷污染食物或水是严重的犯罪行为。"}]},{"partOfSpeech":"vt.","definition":{"en":"applying arsenic-based chemicals in a technical setting (for example, in older agriculture or lab procedures).","zh":"（技术语境）施用含砷化学品（例如旧式农业或实验操作中）。"},"examples":[{"en":"Farm records from the early 1900s mention arsenicating orchards to control certain pests.","zh":"20世纪初的农场记录提到用含砷药剂处理果园来控制某些害虫。"},{"en":"Proper protective equipment is required when arsenicating materials in the lab.","zh":"在实验室用含砷物质处理材料时必须佩戴合适的防护装备。"}]}],"synonyms":["poisoning (with arsenic)","treating with arsenic","contaminating","doping (technical)"],"phonetic":"/ɑrˈsɛnɪˌkeɪtɪŋ/","extraExplanation":["“arsenicating”来自动词“arsenicate / arsenicating”，意思是“用砷处理”。它在现代日常英语中很少见，更常出现在历史资料、博物馆保存、环境污染或法医学等语境。","砷及其化合物有很强毒性。历史上曾用于杀虫剂、木材防腐、颜料（如“巴黎绿”），但因危害健康与环境，许多用途已被严格限制。"]}
{"word":"arsenicism","summary":{"en":"Arsenicism is a rare term meaning arsenic poisoning, or (historically) the practice of taking arsenic.","zh":"Arsenicism 是一个较少见的词，指砷中毒，也可指（历史上）服用砷的做法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Poisoning or illness caused by exposure to arsenic (arsenic intoxication).","zh":"砷中毒；因接触或摄入砷而导致的中毒或疾病。"},"examples":[{"en":"The doctor suspected arsenicism after the patient developed severe stomach pain and weakness.","zh":"病人出现严重胃痛和乏力后，医生怀疑是砷中毒。"},{"en":"In older reports, long-term exposure in mines was sometimes described as chronic arsenicism.","zh":"在较早的报告中，矿井里的长期暴露有时被描述为慢性砷中毒。"}]},{"partOfSpeech":"n.","definition":{"en":"The practice or habit of taking arsenic (historically, sometimes in small doses) for perceived benefits.","zh":"（历史上）服用砷（有时为小剂量）以求“保健”或其他效果的做法。"},"examples":[{"en":"Some 19th‑century writings mention arsenicism as a dangerous fashion in certain regions.","zh":"一些19世纪的著作提到，在某些地区“服砷风尚”是一种危险的潮流。"},{"en":"Modern medicine rejects arsenicism because the risks of arsenic exposure are serious.","zh":"现代医学反对这种服砷做法，因为砷暴露的风险非常严重。"}]}],"synonyms":["arsenic poisoning","arsenic intoxication","arsenicosis","chronic arsenic poisoning"],"phonetic":"/ɑrˈsɛnɪˌsɪzəm/","extraExplanation":["这个词在现代英语里很少见，更常用的说法是 arsenic poisoning（砷中毒）或 arsenic intoxication。","词形来自 arsenic（砷）+ -ism（表示“某种状态/倾向/做法”）。在19世纪的部分欧洲地区，确实有过“少量服砷以增进食欲或气色”的传闻与记录，但这种做法危险且不可取。"]}
{"word":"arsenicize","summary":{"en":"Arsenicize means to treat with arsenic (often for preservation) or to poison with arsenic.","zh":"Arsenicize 指“用砷处理（常为保存/防虫）”或“用砷下毒、使中毒”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to treat something with arsenic, especially to preserve it (for example, in taxidermy or specimen preparation).","zh":"用砷处理某物（尤指为防腐、保存，如用于标本或剥制）。"},"examples":[{"en":"In the 19th century, some museums arsenicized animal skins to protect them from insects.","zh":"在19世纪，一些博物馆会用砷处理动物皮张，以防虫蛀。"},{"en":"The label warns that the specimen may have been arsenicized and should be handled with gloves.","zh":"标签警告该标本可能经过砷处理，操作时应戴手套。"}]},{"partOfSpeech":"vt.","definition":{"en":"to poison someone or something with arsenic.","zh":"用砷使人或物中毒；以砷下毒。"},"examples":[{"en":"The detective suspected the victim was arsenicized over time through contaminated medicine.","zh":"侦探怀疑受害者是因受污染的药物而长期摄入砷导致中毒。"},{"en":"Food or water should never be exposed to chemicals that could arsenicize it.","zh":"食物或饮用水绝不应接触可能使其含砷的化学物质。"}]}],"synonyms":["treat with arsenic","poison","contaminate","dope (with chemicals)"],"phonetic":"/ɑrˈsɛnɪˌsaɪz/","extraExplanation":["“arsenicize”是比较少见、偏专业的动词，多出现在历史文献、博物馆/标本保存、法医学或环境污染语境中。现代更常见的表达包括“treat with arsenic”（用砷处理）或“poison with arsenic”（用砷下毒）。","砷曾被用作杀虫、防腐材料（例如某些旧式剥制标本处理法），但因毒性与健康风险，相关做法如今受到严格限制或已被替代。"]}
{"word":"arsenicked","summary":{"en":"“arsenicked” means “poisoned with arsenic” (or “treated with arsenic”), and it’s a somewhat old-fashioned/literary word.","zh":"“arsenicked”意为“被砒霜（含砷）下毒的/含砷处理过的”，偏旧式或文学化表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"poisoned with arsenic; containing arsenic (often used as a past participle or adjective).","zh":"被砒霜（含砷）毒害的；含砷的（常作过去分词或形容词用）。"},"examples":[{"en":"The detective suspected the tea had been arsenicked.","zh":"侦探怀疑茶里被下了砒霜。"},{"en":"In old stories, an arsenicked ring or powder is a common murder tool.","zh":"在一些旧故事里，“下砒霜的戒指”或“含砒霜的粉末”常被写成谋杀工具。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, past tense/past participle of “arsenic”) to poison with arsenic.","zh":"（动词“arsenic”的过去式/过去分词）用砒霜（含砷物质）下毒。"},"examples":[{"en":"The villain arsenicked the food before the banquet.","zh":"反派在宴会前给食物下了砒霜。"},{"en":"He claimed he had never arsenicked anyone.","zh":"他声称自己从没给任何人下过砒霜。"}]}],"synonyms":["poisoned","laced (with arsenic)","tainted","contaminated"],"phonetic":"/ˈɑrsənɪkt/","extraExplanation":["“arsenicked”在现代英语里比较少见，更常见的说法是“poisoned with arsenic”或“laced with arsenic”。它带有一种旧小说/侦探文学的叙述风格。","砷（arsenic）曾在历史上因无色无味、难以察觉而与“毒药”形象紧密相关，所以在推理小说、哥特文学中常被用作典型毒物意象。"]}
{"word":"arsenicking","summary":{"en":"Arsenicking means using arsenic—especially to poison—or (historically) treating something with arsenic compounds.","zh":"Arsenicking 指使用砷，尤其是用来下毒；也可指（历史上）用含砷化合物处理或保存某物。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"using arsenic (a poisonous chemical), especially to poison someone or something; the act of poisoning with arsenic","zh":"使用砷（有毒化学物质），尤指用来下毒；用砷投毒的行为"},"examples":[{"en":"The detective suspected someone was arsenicking the tea.","zh":"侦探怀疑有人在茶里下砷下毒。"},{"en":"In old crime stories, arsenicking was a common method because symptoms could look like illness.","zh":"在一些老犯罪故事里，用砷下毒很常见，因为症状可能看起来像生病。"}]},{"partOfSpeech":"v.","definition":{"en":"treating or preserving something with an arsenic compound (historical use), for example in pest control or specimen preservation","zh":"（历史用法）用含砷化合物处理或保存某物，例如用于杀虫或保存标本"},"examples":[{"en":"The museum once used arsenicking techniques to protect specimens from insects.","zh":"博物馆曾用含砷处理的方法来保护标本免受虫害。"},{"en":"Some antique materials may have been arsenicking-treated, so handling requires care.","zh":"一些古旧材料可能用含砷药剂处理过，因此接触时要小心。"}]}],"synonyms":["poisoning with arsenic","arsenic poisoning","poisoning","doping (with arsenic)"],"phonetic":"/ˈɑrsənɪkɪŋ/","extraExplanation":["“arsenicking”多见于较老的英文文本、侦探/犯罪小说或历史语境中，是由“arsenic（砷）”衍生出的动词用法（to arsenic / arsenick），意思是“用砷处理/用砷投毒”。现代英语里更常说“poisoning with arsenic / arsenic poisoning”。","砷在19世纪曾被用于灭鼠、杀虫、颜料与某些保存处理；也因此在历史上与“隐蔽投毒”联系紧密。阅读旧文献时遇到该词，通常暗示危险或不当使用。"]}
{"word":"arsenicophagy","summary":{"en":"Arsenicophagy means the practice of eating arsenic, a highly poisonous substance.","zh":"arsenicophagy 指“食用砷/砒霜”的行为，是非常危险的做法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The practice of eating arsenic (a poisonous chemical), historically reported in some places as a supposed tonic or for cosmetic/health reasons.","zh":"食砒霜（食用砷）——指食用砷这种有毒物质的行为；历史上在少数地区被记载为“强身”或美容/保健的做法。"},"examples":[{"en":"Arsenicophagy is dangerous and can cause serious poisoning or death.","zh":"食砒霜非常危险，可能导致严重中毒甚至死亡。"},{"en":"In some historical accounts, arsenicophagy was described as a misguided way to improve stamina.","zh":"在一些历史记载中，食砒霜被描述为一种错误的“增强体力”的方式。"}]}],"synonyms":["arsenic ingestion","eating arsenic"],"phonetic":"/ɑrˌsɛnɪˈkɑfədʒi/","extraExplanation":["词源：由 arsenic（砷/砒霜）+ -phagy（“进食/吞食”，也见于 geophagy“食土”、coprophagy“食粪”）组成。","文化与历史背景：19世纪欧洲（尤其奥地利部分地区）曾流传“少量食砷”可让皮肤更白或增强耐力的说法，但这是高风险、不可取的迷信与误用。现代医学明确指出砷具有毒性与致癌性，绝不应尝试。","用法提示：该词较罕见，多出现在医学史、毒理学或社会文化研究语境中。日常英语更常用表达是 “eating arsenic” 或 “arsenic ingestion”。"]}
{"word":"arsenics","summary":{"en":"“Arsenics” means arsenic or multiple arsenic compounds, used mainly in scientific or testing contexts.","zh":"“Arsenics”指“砷/多种砷化合物”，多用于科学或检测等语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of arsenic; arsenic or different arsenic compounds (chemical forms of arsenic).","zh":"arsenic 的复数；指砷或不同形态/化合物的砷（多种“砷类”）。"},"examples":[{"en":"The lab tested the water for arsenics and other heavy metals.","zh":"实验室检测了水中的砷类以及其他重金属。"},{"en":"Some soils contain naturally occurring arsenics that can enter crops.","zh":"有些土壤含有天然存在的砷类，可能进入农作物。"}]}],"synonyms":["arsenic compounds","arsenicals"],"phonetic":"/ˈɑrsənɪks/","extraExplanation":["日常英语里更常见的是用不可数名词 arsenic（砷）来泛指这种元素或毒物；当说 arsenics 时，通常是在化学、环境检测或法规语境中，强调“不同形态/不同化合物的砷”（例如无机砷与有机砷等）。","砷在历史上曾被用作毒药，也曾出现在某些颜料和杀虫剂中；现代使用受到严格管控。学习时注意它属于危险物质相关词汇，常与 contamination（污染）、poisoning（中毒）、heavy metals（重金属）一起出现。"]}
{"word":"arsenide","summary":{"en":"An arsenide is a compound of arsenic with another element, commonly mentioned in chemistry and semiconductor materials (e.g., gallium arsenide).","zh":"arsenide 指“砷化物”，即砷与另一元素形成的化合物，常见于化学与半导体材料语境（如砷化镓）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound in which arsenic is combined with another element (especially a metal); often used in semiconductors and other materials science contexts","zh":"砷化物；砷与另一种元素（尤其是金属）形成的化合物；常用于半导体等材料科学领域"},"examples":[{"en":"Gallium arsenide is used to make high-speed electronic devices.","zh":"砷化镓用于制造高速电子器件。"},{"en":"Some arsenides can be toxic and must be handled with care.","zh":"一些砷化物有毒，必须小心处理。"}]}],"synonyms":["arsenic compound","metal arsenide"],"phonetic":"/ˈɑɹsəˌnaɪd/","extraExplanation":["“arsenide”是化学命名中的后缀“-ide（……化物）”形式之一，表示由砷（arsenic, As）与另一元素构成的二元化合物，例如“gallium arsenide（砷化镓，GaAs）”。","在材料与电子工程里，最常见的语境是半导体：GaAs（砷化镓）常用于射频器件、激光二极管、光电器件等。日常英语中较少见，多出现在学术/工业文本。","注意不要与“arsenic（砷）”“arsenate（砷酸盐，通常含AsO4）”“arsenite（亚砷酸盐，常含AsO3）”混淆：它们对应不同化学形态与命名规则。"]}
{"word":"arsenides","summary":{"en":"“Arsenides” means compounds containing arsenic bonded with another element.","zh":"“arsenides”指含砷并与其他元素结合形成的化合物（砷化物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Chemical compounds in which arsenic is combined with another element (often a metal), forming an ion/compound called an arsenide.","zh":"“砷化物”：指砷与另一种元素（常见为金属）形成的化合物/离子化合物。"},"examples":[{"en":"Gallium arsenides are widely used in high-speed electronics and some solar cells.","zh":"砷化镓广泛用于高速电子器件以及部分太阳能电池。"},{"en":"Some arsenides can release toxic substances if heated or treated with acids.","zh":"一些砷化物在加热或遇酸时可能释放有毒物质。"}]}],"synonyms":["arsenide compounds","arsenic compounds"],"phonetic":"/ˈɑr.səˌnaɪd/","extraExplanation":["“arsenides”是“arsenide”的复数形式，常见于化学与材料科学（如半导体材料“gallium arsenide / GaAs”）。","砷及其化合物通常具有毒性；在实验室或工业环境中应遵守安全规范（通风、个人防护、正确处置）。"]}
{"word":"arseniferous","summary":{"en":"“Arseniferous” means containing arsenic, especially in scientific contexts.","zh":"“arseniferous”意为“含砷的”，多用于科学或技术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing arsenic; having arsenic in it (often used in geology, chemistry, or environmental writing).","zh":"含砷的；含有砷成分的（常见于地质、化学或环境相关语境）。"},"examples":[{"en":"The lab detected arseniferous minerals in the rock sample.","zh":"实验室在岩石样本中检测到了含砷矿物。"},{"en":"Arseniferous groundwater can pose serious health risks if it is used for drinking.","zh":"含砷地下水如果用于饮用，可能带来严重的健康风险。"},{"en":"The region’s arseniferous soils require careful monitoring before farming expands.","zh":"该地区的含砷土壤在扩大耕作前需要谨慎监测。"}]}],"synonyms":["arsenic-containing","arsenical"],"phonetic":"/ˌɑr.səˈnɪf.ər.əs/","extraExplanation":["这个词较为正式、学术化，日常英语里更常说“contains arsenic / arsenic-containing”。","常见搭配：arseniferous minerals（含砷矿物）、arseniferous ore（含砷矿石）、arseniferous water/groundwater（含砷水/地下水）、arseniferous soils（含砷土壤）。","词源结构可帮助记忆：arsenic（砷）+ -ferous（“带有、含有”，类似 carboniferous=含碳的）。"]}
{"word":"arsenillo","summary":{"en":"“Arsenillo” is usually a personal name (Spanish), not a common English word.","zh":"“Arsenillo”通常是（西班牙语）人名/姓氏，并非常见英语词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare proper name (usually a Spanish given name or surname). It is not a standard English vocabulary word.","zh":"一个较少见的专有名词（通常是西班牙语的人名或姓氏）。“arsenillo”不是标准英语词汇。"},"examples":[{"en":"Arsenillo is listed as a family name in some Spanish-language records.","zh":"在一些西班牙语资料中，Arsenillo 被记为一个姓氏。"},{"en":"I’m not sure how to pronounce Arsenillo—could you say it slowly?","zh":"我不确定 Arsenillo 怎么读——你能慢一点说吗？"}]}],"phonetic":"ˌɑr.səˈni.loʊ","extraExplanation":["“Arsenillo”在英语词典里通常查不到，多半是姓名（专名），所以没有固定的英文“同义词”。","如果你是在英文语境里看到它，也可能是拼写误差。常见的相近形式有西班牙语名字“Arsenio”，或英语里与“arsenic（砷）”相关的词（如“arsenical”），但意义完全不同。","发音会因个人/地区而异；上面的音标给的是按英语习惯读一个西语姓名时的近似读法。"]}
{"word":"arsenio","summary":{"en":"Arsenio is mainly a male first name; it can also refer to the American entertainer Arsenio Hall.","zh":"Arsenio 主要是男性名字；也可指美国艺人阿森尼奥·霍尔（Arsenio Hall）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name), used especially in Spanish- and Italian-speaking cultures; an English spelling of the same name.","zh":"男性名字（名），在西班牙语和意大利语文化中较常见；英文中也可用此拼写。"},"examples":[{"en":"Arsenio is my grandfather’s name.","zh":"Arsenio 是我祖父的名字。"},{"en":"We met an Arsenio from Mexico at the conference.","zh":"我们在会议上认识了一位来自墨西哥的 Arsenio。"}]},{"partOfSpeech":"n.","definition":{"en":"(most famously) Arsenio Hall (born 1956), an American comedian and talk-show host known for The Arsenio Hall Show.","zh":"（最著名的）阿森尼奥·霍尔（Arsenio Hall，1956 年生），美国喜剧演员与脱口秀主持人，以《The Arsenio Hall Show》闻名。"},"examples":[{"en":"I watched an old clip from Arsenio Hall’s talk show.","zh":"我看了一段阿森尼奥·霍尔脱口秀的老片段。"},{"en":"Arsenio Hall hosted a popular late-night show in the 1990s.","zh":"阿森尼奥·霍尔在 1990 年代主持过一档很受欢迎的深夜节目。"}]}],"synonyms":["Arsénio","Arsenio Hall"],"phonetic":"/ɑrˈsɛnioʊ/","extraExplanation":["Arsenio 源自希腊语名字 Arsénios（意为“有男子气概的/强健的”之类的含义），在西班牙语、意大利语等语言中常见。作为英语使用时，多以人名出现，通常不翻译，只音译或直接保留原拼写。"]}
{"word":"arseniopleite","summary":{"en":"Arseniopleite is a rare arsenic-bearing mineral name used mainly in geology/mineralogy.","zh":"Arseniopleite 是一种含砷的罕见矿物名称，主要用于地质/矿物学领域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (an arsenate) found in some ore deposits; it contains arsenic and is studied mainly in geology/mineralogy","zh":"一种罕见的矿物（砷酸盐类），可见于某些矿床中；含砷，主要用于地质学/矿物学研究"},"examples":[{"en":"Arseniopleite is usually mentioned in mineral lists rather than in everyday English.","zh":"“arseniopleite”通常出现在矿物名录中，而不是日常英语里。"},{"en":"Because it contains arsenic, arseniopleite should be handled carefully in a laboratory setting.","zh":"由于含砷，实验室环境中应谨慎处理arseniopleite。"}]}],"phonetic":"/ɑrˈsiːnioʊˌplaɪt/","extraExplanation":["这是一个非常专业的矿物名称，在普通英语语境里几乎不会用到，更多出现在矿物学论文、标本目录或矿区报告中。","该词包含词根 arsenio-（与“砷”有关），许多含砷矿物名称都会带有类似构词；含砷物质可能具有毒性，因此相关讨论常会提到安全与防护。"]}
{"word":"arseniosiderite","summary":{"en":"Arseniosiderite is a rare mineral: a hydrated calcium iron arsenate.","zh":"Arseniosiderite（砷铁钙矿）是一种罕见矿物，属于含水的钙-铁砷酸盐。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (a hydrated calcium iron arsenate) that can form in the oxidation zones of arsenic-rich ore deposits","zh":"一种罕见矿物（含水的钙-铁砷酸盐），常形成于富砷矿床的氧化带"},"examples":[{"en":"Arseniosiderite is sometimes found as a secondary mineral where arsenic-bearing ores weather.","zh":"砷铁钙矿有时会作为次生矿物出现在含砷矿石风化的环境中。"},{"en":"The sample contained arseniosiderite along with other iron arsenate minerals.","zh":"该样品中含有砷铁钙矿，并伴生其他铁砷酸盐矿物。"}]}],"synonyms":["calcium iron arsenate (general description)"],"phonetic":"/ɑrˌsiːni.oʊˈsɪd.ɚ.aɪt/","extraExplanation":["词源上可拆解理解：arsenio- 表示“砷（arsenic）”，sider- 来自希腊语 sideros，表示“铁（iron）”，-ite 常用于矿物名称后缀。整体意思可理解为“含砷的铁系矿物”。","这是矿物学/地质学用语，不是日常英语词汇；在阅读矿物鉴定、矿床氧化带（oxidation zone）或砷污染相关资料时更常见。由于含砷，实验与处理样品时通常需要注意安全与防护。"]}
{"word":"arsenious","summary":{"en":"Arsenious is a chemistry term meaning “containing trivalent arsenic (+3),” as in arsenious acid.","zh":"Arsenious 是化学用语，指“含三价砷（+3 价）的”，如亚砷酸。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing arsenic, especially arsenic in the +3 oxidation state (trivalent arsenic); related to arsenious compounds (e.g., arsenious acid).","zh":"含砷的，尤指含三价砷（+3 价、三价砷）的；与“亚砷”化合物有关（如亚砷酸）。"},"examples":[{"en":"Arsenious compounds can be highly toxic if ingested.","zh":"亚砷化合物如果被摄入，可能具有很强的毒性。"},{"en":"The report mentioned arsenious acid as one form of arsenic found in water samples.","zh":"报告提到，水样中发现的砷形态之一是亚砷酸。"}]}],"synonyms":["arsenical","arsenic (in general contexts)"],"phonetic":"/ɑrˈsiːniəs/","extraExplanation":["“arsenious”多见于化学/环境科学语境，常用来区分砷的不同价态：arsenious 通常指三价砷（As(III)），而 arsenic/arsenic acid 常与五价砷（As(V)）相关。日常英语里更常见的形容词是 “arsenic” 或 “arsenical”。","你输入的拼写是 “arsenious”。它很容易和 “arsenious/arsenical/arsenic” 混淆：在非专业场合，很多人会直接用 “arsenic” 来泛指“砷/含砷的”。"]}
{"word":"arsenism","summary":{"en":"Arsenism means poisoning caused by arsenic, often discussed in medical or toxicology contexts.","zh":"Arsenism 指砷中毒，多用于医学或毒理学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Poisoning caused by arsenic (from swallowing it, breathing it in, or long-term exposure).","zh":"砷中毒（因吞食、吸入或长期接触砷而引起的中毒）。"},"examples":[{"en":"The doctor suspected arsenism after the patient showed signs of long-term arsenic exposure.","zh":"病人出现长期接触砷的迹象后，医生怀疑是砷中毒。"},{"en":"Contaminated well water can lead to chronic arsenism in some communities.","zh":"受污染的井水可能导致一些社区出现慢性砷中毒。"}]}],"synonyms":["arsenic poisoning","arsenicosis"],"phonetic":"/ˈɑrsəˌnɪzəm/","extraExplanation":["“arsenism”是较少见、偏医学/毒理学的词，更常见的说法是“arsenic poisoning（砷中毒）”或“arsenicosis（砷中毒/砷病，尤指慢性）”。","在现代英语中，它多见于医学文献或严肃报道；日常交流中用“arsenic poisoning”会更自然、易懂。"]}
{"word":"arsenite","summary":{"en":"Arsenite is a toxic arsenic(III) compound/ion, often discussed in chemistry and environmental contamination.","zh":"Arsenite 指含三价砷的（通常有毒的）化合物/离子，常见于化学与环境污染语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound or ion containing arsenic in the +3 oxidation state (As(III)); often referring to salts of arsenious acid, and commonly toxic","zh":"亚砷酸盐；含三价砷（As(III)）的化合物或离子（常指亚砷酸的盐），通常具有毒性"},"examples":[{"en":"Arsenite can contaminate groundwater and pose serious health risks.","zh":"亚砷酸盐可能污染地下水，并带来严重的健康风险。"},{"en":"The lab labeled the sample as containing arsenite (As(III)).","zh":"实验室将该样品标注为含有亚砷酸盐（As(III)）。"}]}],"synonyms":["arsenic(III) (compound)","As(III)","arsenious (compound)"],"phonetic":"/ɑrˈsɛnˌaɪt/","extraExplanation":["在环境与健康领域里，arsenite 通常指“三价砷”（As(III)）的形态，相比常见的“五价砷” arsenate（As(V)），As(III) 往往更易被生物吸收、毒性也更强。","词形来源：arsen-（砷）+ -ite（常用于表示“较低氧化态/亚…盐”）。因此 arsenite 常与 arsenate 对比记忆。","常见搭配：arsenite oxidation（三价砷氧化）、arsenite contamination（亚砷酸盐污染）、sodium arsenite（亚砷酸钠；历史上用作农药/木材防腐剂等，但因毒性现在受到严格限制）。"]}
{"word":"arsenites","summary":{"en":"“Arsenites” are arsenic-containing salts/compounds with the arsenite ion, often mentioned in chemistry and environmental pollution contexts.","zh":"“Arsenites”指亚砷酸盐（含亚砷酸根的砷化合物），常见于化学与环境污染相关语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"salts or chemical compounds that contain the arsenite ion (AsO3^3−), derived from arsenious acid; often discussed in chemistry and environmental contexts (many are toxic).","zh":"亚砷酸盐；含有“亚砷酸根”(AsO3^3−)的盐或化合物，来源于亚砷酸；常见于化学与环境话题（许多具有毒性）。"},"examples":[{"en":"Scientists tested the groundwater for arsenites and other arsenic compounds.","zh":"科学家检测地下水中是否含有亚砷酸盐及其他砷化合物。"},{"en":"Some arsenites can form under low-oxygen conditions in soil and water.","zh":"在土壤和水体的低氧环境下，可能会形成某些亚砷酸盐。"},{"en":"The report warns that arsenites may pose serious health risks if they contaminate drinking water.","zh":"报告警告说，如果亚砷酸盐污染饮用水，可能会带来严重的健康风险。"}]}],"synonyms":["arsenite salts","arsenious salts","arsenite compounds"],"phonetic":"ɑrˈsɛnaɪts","extraExplanation":["“arsenites”是复数形式，单数是“arsenite”。在环境科学里常与“arsenates（砷酸盐）”对比：arsenite通常对应较低氧化态的砷（As(III)），而 arsenate多对应较高氧化态（As(V)）。","含砷化合物具有毒性风险，现实语境中常出现在“地下水污染、土壤修复、工业排放、实验室化学”等话题里；阅读相关资料时要注意它多是专业术语而非日常用词。"]}
{"word":"arsenium","summary":{"en":"“Arsenium” is a rare/nonstandard term that usually refers to arsenic.","zh":"“arsenium”是罕见/不规范用法，通常指“arsenic（砷）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare or nonstandard) another name for the chemical element arsenic.","zh":"（罕见或不规范用法）指化学元素“砷（arsenic）”的另一种叫法。"},"examples":[{"en":"Arsenium is a rare term; most modern English uses “arsenic.”","zh":"“arsenium”这个词很少见；现代英语通常用“arsenic（砷）”。"},{"en":"The report mentions arsenium contamination, but it likely means arsenic.","zh":"报告里写了“arsenium”污染，但很可能指的是“arsenic（砷）”。"}]}],"synonyms":["arsenic"],"phonetic":"/ɑrˈsiːniəm/","extraExplanation":["“arsenium”在现代英语里几乎不作为标准词使用；更常见、正确的词是“arsenic”。如果你是在化学、环境检测或医学语境中看到“arsenium”，很可能是拼写错误、旧译名/旧写法，或来自其他语言/拉丁化形式的影响。","学习与考试写作建议：使用“arsenic”（砷）。常见搭配：arsenic poisoning（砷中毒）、arsenic in drinking water（饮用水中的砷）、arsenic levels（砷含量）。"]}
{"word":"arseniuret","summary":{"en":"An old term for an arsenide: a compound containing arsenic combined with another element, often a metal.","zh":"“arseniuret”是“arsenide（砷化物）”的旧称，指含砷并与其他元素（常为金属）结合的化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Old-fashioned) a compound of arsenic with a metal or another element; an arsenide.","zh":"（旧用）砷与金属或其他元素形成的化合物；砷化物。"},"examples":[{"en":"In older chemistry books, nickel arsenide might be called a nickel arseniuret.","zh":"在较早的化学书里，砷化镍（nickel arsenide）可能会被称为 nickel arseniuret。"},{"en":"The report described an arseniuret found in an ore sample.","zh":"报告描述了在矿石样品中发现的一种砷化物（arseniuret）。"}]}],"synonyms":["arsenide","arsenuret (rare)"],"phonetic":"/ɑrˌsiːniˈjʊrət/","extraExplanation":["“arseniuret”是19世纪及更早时期常见的化学/矿物学用语，现代英语更常用“arsenide（砷化物）”。在阅读老教材或旧矿物报告时会遇到该词。","词形带有法语色彩（类似 -uret 结尾的旧术语），在现代科学写作中通常被更标准的命名体系取代。"]}
{"word":"arseniureted","summary":{"en":"A rare/old chemistry adjective meaning “containing or combined with arsenic,” especially in the phrase “arsenuretted (arsenureted) hydrogen.”","zh":"一个较少见/偏旧的化学形容词，意为“含砷的、与砷结合的”，尤其常见于“arsenuretted/arsenureted hydrogen（砷化氢/砷烷）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) containing arsenic; combined with arsenic (often said of hydrogen gas: “arsenuretted hydrogen,” i.e., arsine).","zh":"（化学）含砷的；与砷结合的（常用于“arsenuretted hydrogen/arsenureted hydrogen”，即“砷化氢/砷烷”）。"},"examples":[{"en":"The old report warned about exposure to arsenuretted hydrogen in the lab.","zh":"那份旧报告警告在实验室中可能接触到砷化氢。"},{"en":"Arsenuretted compounds can be extremely poisonous and must be handled carefully.","zh":"含砷化合物可能毒性极强，必须小心处理。"}]}],"synonyms":["arsenic-containing","arsenical"],"phonetic":"/ɑrˈsɛn.jəˌreɪ.tɪd/","extraExplanation":["“arseniureted”很可能是拼写错误；更常见的拼法是 **arsenureted** 或英式 **arsenuretted**。","该词多见于较早的化学/医学文献；现代更常用 **arsenic-containing**（含砷的）或直接用具体名称如 **arsine (AsH₃)**（砷烷/砷化氢）。"]}
{"word":"arseniuretted","summary":{"en":"An old-fashioned chemistry adjective meaning “containing arsenic; combined with arsenic.”","zh":"一个较旧的化学形容词，表示“含砷的；与砷结合的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry, old-fashioned) Containing arsenic, or combined with arsenic; especially used in names of gases/compounds (e.g., “arseniuretted hydrogen”).","zh":"（化学，较旧用法）含砷的；与砷结合的（常用于旧式化学命名，如“arseniuretted hydrogen”）。"},"examples":[{"en":"Arseniuretted hydrogen is an old name for arsine, a highly toxic gas.","zh":"“Arseniuretted hydrogen”是“arsine（砷化氢）”的旧称，是一种剧毒气体。"},{"en":"The paper mentions arseniuretted compounds that were studied in early chemistry.","zh":"这篇论文提到早期化学研究过的“arseniuretted（含砷的）”化合物。"}]}],"synonyms":["arsenic-containing","arsenical","arsenic"],"phonetic":"/ɑrˌsiːniˈjʊrɛtɪd/","extraExplanation":["“arseniuretted”多见于19世纪及更早的化学文献，属于旧式命名/拼写习惯。现代英文通常更直接用“arsenic/arsenical”（形容含砷）或用具体化合物名称（如“arsine”砷化氢）。","词形上可理解为“arseni-（砷）+ -uretted（与……形成化合物/被……化合的）”。在今天的科学英语里，这种“-uretted”结构已不常用。"]}
{"word":"arsenization","summary":{"en":"Arsenization means treating something with arsenic (often for preservation or pest control).","zh":"Arsenization 指用砷（或含砷物质）对某物进行处理，常见目的为防腐或杀虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of treating something with arsenic or an arsenic compound (for example, to preserve materials or kill pests).","zh":"砷化处理；用砷或含砷化合物对某物进行处理（例如用于防腐或杀虫）。"},"examples":[{"en":"In the past, arsenization was used to protect wood from insects.","zh":"过去，人们曾用砷化处理来保护木材免受虫害。"},{"en":"Because arsenic is highly toxic, arsenization is now tightly regulated or avoided.","zh":"由于砷的毒性极强，如今砷化处理受到严格管制，或被尽量避免。"}]}],"synonyms":["arsenic treatment","arsenation","arsenification"],"phonetic":"/ˌɑrsənəˈzeɪʃən/","extraExplanation":["“arsenization”由“arsenic（砷）+ -ization（……化/处理过程）”构成，是较少见的词。历史上可见于木材防腐、标本制作（防虫防腐）或某些工业处理的语境中；但现代由于砷的高毒性与环境危害，相关做法多被替代或严格限制。"]}
{"word":"arseno","summary":{"en":"Arseno- is a chemistry prefix meaning “arsenic” or “arsenic-containing.”","zh":"arseno- 是化学前缀，表示“砷”或“含砷的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(chemistry) A combining form meaning “arsenic” or “containing arsenic,” used in names of compounds and chemical groups.","zh":"（化学）构词成分，表示“砷”或“含砷的”，用于化合物或基团名称中。"},"examples":[{"en":"In older chemical names, arseno- indicates an arsenic-containing group.","zh":"在较早的化学命名中，arseno- 表示含砷的基团。"},{"en":"Researchers studied arseno compounds for their biological effects.","zh":"研究人员研究含砷化合物的生物学作用。"}]}],"synonyms":["arsenic (related word)"],"phonetic":"/ɑrˈsinoʊ/","extraExplanation":["“arseno”本身在日常英语里很少单独使用，更常见的是带连字符的形式“arseno-”，作为前缀出现在化学名词中。","如果你想查的是“arsenal”（军械库/武器库，或比喻“手段储备”），拼写是 a-r-s-e-n-a-l，意思不同。"]}
{"word":"arsenobenzene","summary":{"en":"A chemistry term for an organoarsenic compound involving benzene and arsenic, sometimes mentioned in early drug research history.","zh":"化学术语：指含苯环与砷的有机砷化合物，有时也出现在早期药物研究史的讨论中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound made of benzene rings bonded to arsenic (an organoarsenic compound), often discussed in chemistry and the history of medicine.","zh":"一种含砷与苯环结合的化合物（有机砷化合物），常见于化学领域及医学史相关讨论中。"},"examples":[{"en":"Arsenobenzene compounds are studied for their unusual bonding and reactivity.","zh":"人们研究砷代苯类化合物，是因为它们具有不寻常的成键方式和反应性。"},{"en":"Early 20th-century researchers explored arsenobenzene-related chemicals as treatments for infectious diseases.","zh":"20世纪初的研究者曾探索与砷代苯相关的化学物质，用于治疗传染病。"}]}],"synonyms":["organoarsenic compound","arsenic-containing aromatic compound"],"phonetic":"/ɑrˌsiːnoʊˈbɛnziːn/","extraExplanation":["“arseno-”表示“含砷的/与砷有关的”，benzene（苯）是最常见的芳香烃之一；因此 arsenobenzene 字面意思就是“砷与苯相关的化合物”。","在医学史语境里，人们有时会把它与早期含砷药物（如用于治疗梅毒的相关化合物）联系起来；但具体物质名称在不同资料中可能指向不同的“含砷-芳香环”结构，阅读时最好结合化学式或上下文确认。"]}
{"word":"arsenobenzol","summary":{"en":"Arsenobenzol is a historical organoarsenic drug once used to treat syphilis.","zh":"Arsenobenzol 是一种含砷的历史药物，曾用于治疗梅毒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an organoarsenic compound (also called arsphenamine or Salvarsan) that was historically used as an early antibiotic drug, especially to treat syphilis (before penicillin).","zh":"一种有机砷化合物（也叫 arsphenamine 或 Salvarsan，“撒尔佛散”），历史上曾作为早期抗感染药物使用，尤其用于治疗梅毒（在青霉素出现之前）。"},"examples":[{"en":"Before penicillin, doctors sometimes treated syphilis with arsenobenzol.","zh":"在青霉素出现之前，医生有时会用 arsenobenzol 来治疗梅毒。"},{"en":"Arsenobenzol is mainly discussed today in medical history and pharmacology classes.","zh":"如今 arsenobenzol 主要出现在医学史和药理学课程中。"}]}],"synonyms":["arsphenamine","Salvarsan"],"phonetic":"/ˌɑr.sə.noʊˈbɛn.zɔl/","extraExplanation":["它与“魔弹（magic bullet）”理念有关：德国科学家保罗·埃尔利希（Paul Ehrlich）在20世纪初推动了针对特定病原体的化学疗法研究，Salvarsan（常被称为“606号”）是这一思路的代表性成果之一。","该药物含砷，治疗时需要谨慎使用并可能有毒副作用，因此后来在更安全有效的抗生素（如青霉素）出现后逐渐被淘汰。"]}
{"word":"arsenobismite","summary":{"en":"Arsenobismite is a rare mineral: bismuth arsenate (BiAsO₄).","zh":"arsenobismite 指一种罕见矿物：砷酸铋（BiAsO₄）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral: bismuth arsenate (chemical formula BiAsO₄).","zh":"一种罕见矿物：砷酸铋（化学式 BiAsO₄）。"},"examples":[{"en":"Arsenobismite is a rare bismuth arsenate mineral found in some oxidized ore zones.","zh":"砷酸铋是一种罕见的砷酸盐矿物，可见于某些矿床的氧化带。"},{"en":"Because it contains arsenic, arsenobismite specimens should be handled with care.","zh":"由于含有砷元素，砷酸铋标本应谨慎处理。"}]}],"synonyms":["bismuth arsenate"],"phonetic":"/ɑrˌsiːnoʊˈbɪzmaɪt/","extraExplanation":["词源可拆解为 arseno-（“砷的/与砷有关”）+ bismuth（“铋”）+ -ite（常见矿物后缀，表示“……矿物”）。","多见于矿物学与地质学语境，日常英语中几乎不用；阅读矿物名录、矿床报告或博物馆标签时更可能遇到。"]}
{"word":"arsenoferratin","summary":{"en":"A rare research term for an arsenic-binding/sequestering ferritin-like protein complex.","zh":"一个罕见的研究用词，指可结合/封存砷的铁蛋白样蛋白（复合体）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare scientific term for a ferritin-family (iron‑storage) protein or protein complex that can bind/sequester arsenic, discussed in some biochemistry/microbiology research.","zh":"（罕见科技术语）指一种铁蛋白（储铁蛋白）家族的蛋白质或蛋白复合体，被一些生物化学/微生物学研究用来描述可结合或“封存”砷的储存/解毒相关蛋白。"},"examples":[{"en":"Some papers describe an arsenoferratin-like complex that stores arsenic inside a ferritin shell.","zh":"一些论文描述了类似“arsenoferratin”的复合体，可在铁蛋白外壳内储存砷。"},{"en":"Arsenoferratin is not a common dictionary word; you mainly see it in specialized research contexts.","zh":"“arsenoferratin”不是常见词典词汇，主要出现在专门的研究语境中。"}]}],"synonyms":["arsenic-binding ferritin (descriptive)","ferritin-like arsenic storage protein (descriptive)"],"phonetic":"/ˌɑrˌsiːnoʊˈfɛrətɪn/","extraExplanation":["这个词在普通英语里几乎不用，更像是研究者为了描述“与砷相关、且属于铁蛋白体系的储存/结合机制”而造出的术语或变体写法。不同论文可能用来指不同物种/不同蛋白的“铁蛋白样”结构，因此阅读时最好结合原文的物种、基因名或蛋白名一起确认。"]}
{"word":"arsenofuran","summary":{"en":"A rare chemistry term for a furan-like ring compound involving arsenic (arseno- + furan).","zh":"一个罕见的化学术语，指与呋喃类似、但涉及砷的环状化合物（arseno- + furan）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A rare organoarsenic heterocycle: a furan-like five‑membered ring in which the oxygen of furan is replaced by arsenic (often used as a name element for related aromatic ring compounds).","zh":"（化学）一种罕见的有机砷杂环：结构类似呋喃的五元环，但把呋喃中的氧原子替换为砷原子（也常作为命名成分，用于指代相关的芳香环化合物）。"},"examples":[{"en":"In some research papers, arsenofuran derivatives are discussed as part of organoarsenic heterocycle chemistry.","zh":"在一些研究论文中，会把 arsenofuran 衍生物作为有机砷杂环化学的一部分来讨论。"},{"en":"Because it is a technical term, “arsenofuran” usually appears in chemical naming rather than everyday English.","zh":"由于是技术术语，“arsenofuran”通常出现在化学命名中，而不是日常英语里。"}]}],"synonyms":["organoarsenic heterocycle","arsenic-containing heteroaromatic compound"],"phonetic":"/ˌɑrsənoʊˈfjʊræn/","extraExplanation":["词源/构词：arseno- 表示“与砷有关”，furan 指“呋喃”。合在一起表示“砷取代的呋喃样环”。","发音提示：重音通常落在后半部分（-FUR- 或 -FUR-an 一段），读起来像 “ar-SEN-oh-FYUR-an”。","安全与语境：含砷化合物常与毒性和严格实验室管理相关；该词一般只在化学、材料或有机合成等专业语境中使用。"]}
{"word":"arsenohemol","summary":{"en":"A rare, historical term for an arsenic-based medicine formerly used to treat syphilis.","zh":"一个罕见的历史用词，指曾用于治疗梅毒的含砷药物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an old/rare name for an arsenic-based medicine (related to arsphenamine, once used to treat syphilis).","zh":"一种旧称/罕用名，指含砷的药物（与“砷凡纳明 arsphenamine/Salvarsan”相关，曾用于治疗梅毒）。"},"examples":[{"en":"Before penicillin, doctors used arsenic-based drugs such as arsenohemol to treat syphilis.","zh":"在青霉素出现之前，医生会用含砷药物（如 arsenohemol）来治疗梅毒。"},{"en":"The term arsenohemol is mostly seen in older medical texts.","zh":"arsenohemol 这个词多见于较早期的医学文献。"}]}],"synonyms":["arsphenamine","Salvarsan","arsenic-based drug"],"phonetic":"/ɑrˌsiːnoʊˈhiːmɔl/","extraExplanation":["这个词在现代英语中非常少用，更多是历史医学语境里出现。20世纪初，含砷药物（如 Salvarsan/arsphenamine）曾是治疗梅毒的重要手段，但因毒副作用与后来抗生素（尤其是青霉素）的普及而逐渐被淘汰。","拼写上也可能存在版本差异；如果你是在某段原文里看到它，提供上下文（句子/书名/截图）我可以帮你确认是否为拼写变体或特定商品名。"]}
{"word":"arsenolite","summary":{"en":"Arsenolite is the mineral form of arsenic trioxide (As₂O₃), a very toxic white mineral.","zh":"Arsenolite 指三氧化二砷（As₂O₃）的矿物形态，是一种剧毒的白色矿物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A white mineral form of arsenic trioxide (As₂O₃), often found in oxidized arsenic deposits; it is highly toxic.","zh":"一种白色矿物，是三氧化二砷（As₂O₃）的矿物形态，常见于含砷矿床的氧化带；毒性极强。"},"examples":[{"en":"Arsenolite can form as a secondary mineral when arsenic-bearing ores weather.","zh":"当含砷矿石风化时，可能会形成砷华（arsenolite）这类次生矿物。"},{"en":"The geologist labeled the sample as arsenolite based on its crystal habit and composition.","zh":"地质学家根据晶体形态和成分将该样品标注为砷华（arsenolite）。"}]}],"synonyms":["arsenic trioxide (chemical name)","As2O3 (formula)"],"phonetic":"/ɑrˈsɛnəˌlaɪt/","extraExplanation":["“Arsenolite”常出现在矿物学、地球化学与环境污染相关语境中；它与“arsenic trioxide（三氧化二砷）”是同一化学物质的不同称呼（前者强调矿物形态，后者强调化学物质/工业品）。","由于含砷化合物对人体与生态具有强毒性，涉及样品处理或阅读相关资料时常会看到“toxic / hazardous / carcinogenic”等警示词汇。"]}
{"word":"arsenophagy","summary":{"en":"Arsenophagy means eating males, especially in biological contexts where females consume males.","zh":"Arsenophagy 指“食雄”，多用于生物学语境，描述雌性吃掉雄性的现象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or habit of eating males (especially used in biology for cases where females consume males, such as in some insects or spiders).","zh":"食雄（指吃掉雄性个体的行为或习性；生物学中常用于描述某些昆虫或蜘蛛等雌性捕食并吃掉雄性）。"},"examples":[{"en":"In some species, arsenophagy occurs after mating, when the female consumes the male.","zh":"在某些物种中，交配后会发生食雄现象：雌性会把雄性吃掉。"},{"en":"Researchers documented arsenophagy in a population of mantises under food stress.","zh":"研究人员在食物紧缺的螳螂种群中记录到了食雄行为。"}]}],"synonyms":["male-eating","sexual cannibalism"],"phonetic":"/ɑrˌsiːˈnɑːfədʒi/","extraExplanation":["“arsenophagy”非常少见，多见于学术或科普语境。词源来自希腊语：arseno-（雄性、男性）+ -phagy（吞食、食用），字面意思就是“吃雄性”。","它常被当作“性食同类（sexual cannibalism）”的一种更具体说法：强调被吃掉的是雄性，但不一定只发生在交配场景。"]}
{"word":"arsenophen","summary":{"en":"“Arsenophen” is a rare, older term referring to an arsenic-containing phenyl (aromatic) compound, and it may be used inconsistently in old sources.","zh":"“arsenophen”是一个罕见的旧称，多指含砷的苯基（芳香族）化合物，在旧资料中用法可能不够统一。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, chemistry) An old or uncommon name for an organoarsenic compound related to a phenyl group (a compound containing arsenic and a benzene-ring structure); sometimes used loosely or mistakenly for early arsenic-based medicines.","zh":"（罕见，化学）一种较旧或不常见的名称，指与苯基相关的有机砷化合物（含砷并带有苯环结构的化合物）；有时也会被含糊或误用来指早期的砷类药物。"},"examples":[{"en":"In some older lab notes, “arsenophen” appears as a shorthand label for an arsenic-containing aromatic compound.","zh":"在一些较旧的实验记录里，“arsenophen”会作为含砷芳香族化合物的简写标签出现。"},{"en":"Be careful: “arsenophen” is not a standard modern term, so you may need the full chemical name to be sure what it refers to.","zh":"注意：“arsenophen”不是现代标准术语，因此通常需要看到完整化学名称才能确定它指的是什么。"}]}],"synonyms":["organoarsenic compound","arsphenamine (possible confusion)","arsenic compound"],"phonetic":"ɑrˈsɛnoʊˌfɛn","extraExplanation":["“arsenophen”在现代英语与现代化学文献中非常少见，常见于旧资料、非正式笔记或翻译/拼写变体。","它容易与更常见的历史药物名“arsphenamine（阿司凡明，Salvarsan）”混淆；如果你是在医学史或药物史语境中看到该词，建议核对原文拼写与具体化学式/结构。"]}
{"word":"arsenophenol","summary":{"en":"A chemical term for an arsenic-containing phenol compound.","zh":"一个化学术语，指“含砷的酚类化合物”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an arsenic-containing phenol (a phenol compound with an arsenic group), often referring to a class of organoarsenic chemicals used mainly in research or historical medicine/chemistry contexts","zh":"含砷的酚类化合物（在酚结构中引入砷基团的有机砷化学物质），常用于科研或历史上的药物/化学语境"},"examples":[{"en":"Arsenophenols are studied in some labs because arsenic can strongly affect biological systems.","zh":"一些实验室会研究含砷酚类化合物，因为砷会强烈影响生物系统。"},{"en":"Because arsenophenol compounds can be toxic, researchers handle them with strict safety rules.","zh":"由于含砷酚类化合物可能有毒，研究人员会用严格的安全规范来操作。"}]}],"synonyms":["organoarsenic phenol","arsenic-substituted phenol"],"phonetic":"/ˌɑrsənoʊˈfiːnɔːl/","extraExplanation":["“arsenophenol”并不是日常英语词汇，更常见于化学/毒理学文献。词形可拆解为 arsen(o)-（与砷有关）+ phenol（酚）。","含砷有机物通常具有潜在毒性与环境风险；在真实实验与工业场景中会涉及专业的防护、处置与法规要求。"]}
{"word":"arsenophenylglycin","summary":{"en":"Arsenophenylglycin is a rare technical noun for an arsenic-containing organic compound related to phenylglycine.","zh":"Arsenophenylglycin 是一个罕见的技术性名词，指与苯基甘氨酸相关的含砷有机化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound: an organoarsenic derivative related to phenylglycine (an arsenic-containing aromatic amino-acid–type compound), mainly encountered in scientific or historical medical-chemistry contexts.","zh":"一种化学化合物：与苯基甘氨酸相关的有机砷衍生物（含砷的芳香族“氨基酸样”化合物），多见于科研或医学化学史等语境。"},"examples":[{"en":"Arsenophenylglycin is rarely mentioned outside older chemistry or pharmacology literature.","zh":"Arsenophenylglycin 在旧式的化学或药理学文献之外很少被提及。"},{"en":"Because it contains arsenic, arsenophenylglycin must be handled under strict safety guidelines in a lab.","zh":"由于含砷，实验室处理中必须严格遵守 arsenophenylglycin 的安全规范。"}]}],"synonyms":["arsenophenylglycine","organoarsenic compound"],"phonetic":"/ˌɑr.sə.noʊˌfiː.nəlˈɡlaɪ.sɪn/","extraExplanation":["这是一个非常专业的化学名词，常见于早期（19—20世纪）“含砷有机化合物”相关研究或药物化学史背景。含砷化合物具有潜在毒性，现代语境中通常只在受控的科研/分析场合出现。","拼写上也可能见到更常见的形式 arsenophenylglycine；若你是在论文/数据库里看到该词，建议核对原文的结构式、CAS 号或同义名以确认具体指代。"]}
{"word":"arsenopyrite","summary":{"en":"Arsenopyrite is a metallic mineral (FeAsS) found in ore deposits, sometimes associated with arsenic or gold.","zh":"砷黄铁矿是一种金属光泽矿物（FeAsS），常见于矿床中，有时与砷或金有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a gray, metallic mineral made of iron, arsenic, and sulfur (FeAsS), often found in ore deposits and sometimes a source of arsenic or gold.","zh":"砷黄铁矿（FeAsS），一种灰色金属光泽的矿物，由铁、砷和硫组成，常见于矿床中，有时是砷或金的来源。"},"examples":[{"en":"The geologist identified arsenopyrite in the quartz vein.","zh":"地质学家在石英脉中鉴定出了砷黄铁矿。"},{"en":"Arsenopyrite can release toxic arsenic compounds when it weathers or is processed.","zh":"砷黄铁矿在风化或加工时可能释放有毒的砷化合物。"}]}],"synonyms":["mispickel","arsenic pyrites"],"phonetic":"/ˌɑrsənoʊˈpaɪraɪt/","extraExplanation":["“arsenopyrite”由“arseno-（砷）”和“-pyrite（黄铁矿/硫化物矿物名后缀）”组成，意思是“含砷的黄铁矿类矿物”。","它常与金矿共生；在某些矿区，处理含砷黄铁矿的矿石需要更严格的环保与职业安全措施（如防尘、尾矿管理），因为砷具有毒性。"]}
{"word":"arsenostyracol","summary":{"en":"A rare technical term for an organoarsenic compound, mostly found in older scientific texts.","zh":"一个非常罕见的技术词，指一种有机砷化合物，多见于较早的科学文献。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(rare, technical) An organoarsenic chemical compound (an arsenic-containing derivative related to styrene); mainly seen in older scientific or medical texts rather than modern everyday English.","zh":"（罕见，技术用语）一种有机砷化合物（与苯乙烯相关的含砷衍生物）；多见于较早的科学或医学文献，在现代日常英语中几乎不用。"},"examples":[{"en":"Arsenostyracol is mentioned in some early 20th‑century chemical listings, but it is not a common modern term.","zh":"“arsenostyracol”在一些20世纪初的化学目录中出现，但它不是现代常用术语。"},{"en":"Always handle organoarsenic compounds such as arsenostyracol using appropriate safety precautions.","zh":"处理“arsenostyracol”等有机砷化合物时应采取适当的安全防护措施。"}]}],"synonyms":["organoarsenic compound","arsenic-containing compound"],"phonetic":"/ɑrˌsiːnoʊˈstaɪrəˌkɔl/","extraExplanation":["这个词非常少见，很多现代词典不收录；如果你是在论文、扫描版老书或化学品清单里看到它，可能存在拼写差异或OCR识别错误。建议你提供出处句子或图片，我可以帮你核对是否应为另一个更常见的化学名（例如某种“arseno-”开头的化合物）。"]}
{"word":"arsenotherapy","summary":{"en":"Arsenotherapy means treating illness with arsenic-based drugs.","zh":"Arsenotherapy 指用含砷药物进行治疗的疗法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"treatment of disease using arsenic or arsenic-containing drugs (now rare and used only in specific medical contexts).","zh":"用砷或含砷药物来治疗疾病的疗法（如今较少见，仅在特定医疗情境中使用）。"},"examples":[{"en":"In the early 1900s, arsenotherapy was used to treat certain infectious diseases.","zh":"在20世纪初，砷疗法曾被用来治疗某些传染病。"},{"en":"Modern medicine uses far safer options, so arsenotherapy is mostly of historical interest.","zh":"现代医学有更安全的选择，因此砷疗法多半只具有历史研究价值。"},{"en":"Some arsenic-based treatments have been studied under strict medical supervision.","zh":"在严格的医学监管下，一些含砷治疗方案曾被研究。"}]}],"synonyms":["arsenic therapy","arsenical therapy","treatment with arsenic"],"phonetic":"/ɑrˌsiːnoʊˈθɛrəpi/","extraExplanation":["词源拆解：arseno-（砷）+ therapy（治疗）。这种构词方式常见于医学词汇。","历史背景：过去曾用含砷药物治疗某些疾病（例如早期对梅毒等感染的治疗探索），但因毒性与副作用风险大，后来逐渐被更安全有效的疗法取代。","现代相关：在非常特定的情况下，某些砷化合物（如三氧化二砷）在血液肿瘤领域有过应用与研究，但这属于高度专业、严格剂量控制与监测下的医疗行为，日常语境很少用“arsenotherapy”来泛指此类治疗。"]}
{"word":"arsenotungstates","summary":{"en":"Arsenotungstates are chemistry compounds (salts) containing arsenic–tungsten polyoxometalate anions.","zh":"Arsenotungstates 指含有“砷–钨”多金属氧酸盐阴离子的化合物（盐）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) Salts (or related compounds) that contain an arsenic–tungsten polyoxometalate anion; plural of arsenotungstate.","zh":"（化学）含有砷–钨多金属氧酸盐阴离子的盐（或相关化合物）；arsenotungstate 的复数。"},"examples":[{"en":"Arsenotungstates are studied in inorganic chemistry for their unusual cluster structures.","zh":"砷钨酸盐在无机化学中常因其独特的簇状结构而被研究。"},{"en":"The paper compares arsenotungstates with phosphotungstates in catalytic reactions.","zh":"这篇论文比较了砷钨酸盐与磷钨酸盐在催化反应中的表现。"}]}],"synonyms":["arsenotungstate salts","arsenic–tungsten polyoxometalates","arsenotungstate compounds"],"phonetic":"/ɑrˌsɛnoʊˈtʌŋsteɪts/","extraExplanation":["这是一个比较专业的化学术语，常见于“polyoxometalates（多金属氧酸盐）/ heteropoly acids（杂多酸）”相关文献。arseno- 表示“含砷/与砷相关”，tungstate 表示“钨酸盐（含钨的氧酸根或其盐）”。","在实际阅读中，你可能会看到更具体的名称或化学式（例如某些“arsenotungstate anion/cluster”），用于描述特定结构与用途（如催化、材料、分析化学等）。"]}
{"word":"arsenotungstic","summary":{"en":"Arsenotungstic means “containing both arsenic and tungsten,” mainly used in chemistry.","zh":"arsenotungstic 指“同时含砷和钨的”，主要用于化学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a chemical compound that contains both arsenic and tungsten, especially arsenotungstic acid or its salts (used mainly in chemistry).","zh":"（化学）指同时含有砷（arsenic）和钨（tungsten）的化合物，尤指砷钨酸（arsenotungstic acid）或其盐类。"},"examples":[{"en":"The lab used an arsenotungstic reagent to form a precipitate for analysis.","zh":"实验室使用了砷钨酸类试剂来生成沉淀以进行分析。"},{"en":"Arsenotungstic compounds are discussed mostly in inorganic chemistry texts, not everyday English.","zh":"砷钨化合物多见于无机化学教材中，而不是日常英语。"}]}],"synonyms":["arsenic–tungsten (compound)","arsenotungstate (related term)"],"phonetic":"/ˌɑr.sə.noʊ.tʌŋˈstɪk/","extraExplanation":["这个词非常罕见，通常出现在“arsenotungstic acid（砷钨酸）”等专业术语里。它属于由元素名称组合而成的形容词：arseno-（与“砷”有关）+ tungstic（与“钨/钨酸”有关）。","学习时可以把它当作“含砷+含钨”的标签词来理解；在学术写作中更常见的表达可能会直接写“arsenotungstic acid”或具体的化学式/名称。"]}
{"word":"arsenous","summary":{"en":"“Arsenous” is a chemistry adjective meaning ‘related to arsenic in the +3 oxidation state,’ often seen in names of compounds.","zh":"“Arsenous”是化学形容词，表示“与三价（+3）砷有关”，常用于化合物名称中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to arsenic in its lower oxidation state (+3), especially in chemical compounds (e.g., arsenous oxide).","zh":"（化学）指与低价态（三价，+3）的砷有关的，尤指相关化合物（如亚砷酸酐）。"},"examples":[{"en":"Arsenous oxide is also known as arsenic trioxide (As2O3).","zh":"Arsenous oxide 也称为三氧化二砷（As2O3）。"},{"en":"The lab report mentioned arsenous compounds and their toxicity.","zh":"实验报告提到了亚砷化合物及其毒性。"}]}],"synonyms":["arsenite (related term)","As(III) (technical)"],"phonetic":"/ˈɑrsənəs/","extraExplanation":["“arsenous”常见于化学命名体系里，用来区分不同价态：arsenous 通常指砷的 +3 价（亚砷-），而 “arsenic” 在一些旧式/传统命名中常对应 +5 价（砷酸-）。在现代英文里，日常语境更常直接说 “arsenic compounds（砷化合物）” 或用具体化学名（如 “arsenic trioxide”）。","你输入的拼写“arsenous”是正确的；不要和 “arsenous/arsenate/arsenite” 搞混：arsenite（亚砷酸盐）常与 +3 价相关，arsenate（砷酸盐）常与 +5 价相关。"]}
{"word":"arsenoxide","summary":{"en":"Arsenoxide means an oxide of arsenic, especially arsenic trioxide, and it is highly poisonous.","zh":"arsenoxide 指砷的氧化物，常特指三氧化二砷，毒性很强。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical oxide of arsenic (commonly referring to arsenic trioxide, As₂O₃); a highly toxic substance used in some industrial processes and historically as a poison.","zh":"砷的氧化物（常常特指三氧化二砷 As₂O₃）；一种剧毒物质，用于某些工业过程，也曾在历史上被用作毒药。"},"examples":[{"en":"Arsenoxide is extremely toxic and must be handled with strict safety protections.","zh":"砷氧化物毒性极强，必须在严格的安全防护下处理。"},{"en":"The lab stored arsenoxide in a clearly labeled, sealed container.","zh":"实验室把砷氧化物存放在清晰标注、密封的容器中。"}]}],"synonyms":["arsenic oxide","arsenic trioxide","arsenious oxide"],"phonetic":"/ˌɑrsənˈɑksaɪd/","extraExplanation":["“arsenoxide”不是最常见的日常用词；在英语里更常见的说法是 **arsenic oxide**（砷氧化物）或更具体的 **arsenic trioxide**（三氧化二砷）。","三氧化二砷在历史与文化中常与“无色无味的毒药”形象相关，但现实中它也有合法的工业用途；无论何种用途，都必须遵循化学品安全规范。"]}
{"word":"Arseny","summary":{"en":"Arseny is a Russian male first name (from Арсений).","zh":"Arseny 是一个俄语来源的男性名字（源自 Арсений）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A male given name used especially in Russia and other Slavic countries; it comes from Russian Арсений (Arseniy/Arseny).","zh":"男性名字，常见于俄罗斯及其他斯拉夫国家；源自俄语 Арсений（Arseniy/Arseny）。"},"examples":[{"en":"Arseny is a common Russian first name.","zh":"Arseny 是一个常见的俄罗斯男性名字。"},{"en":"Arseny introduced himself at the meeting.","zh":"Arseny 在会议上做了自我介绍。"}]}],"synonyms":["Arseniy","Arsenii"],"phonetic":"/ɑrˈsɛni/","extraExplanation":["这个名字的更深层词源通常追溯到希腊语 Arsenios，和希腊语词根 arsēn（“男性、雄性”）有关，因此在一些资料中会被解释为“阳刚的/男子气的”。","英语里常见不同拼写：Arseny、Arseniy、Arsenii；读音也会因说话者语言背景而略有差异。"]}
{"word":"arsenyl","summary":{"en":"“Arsenyl” is a technical chemistry word meaning “arsenic-containing,” or an arsenic-based group in a molecule.","zh":"“arsenyl”是化学术语，表示“含砷的/与砷基团有关的”，也可指分子中的含砷基团。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Relating to, or containing, an arsenic-based group (a part of a molecule that includes arsenic), often written as an arsenic–oxygen unit in chemical names.","zh":"（化学）指“含砷基团的/与砷基团有关的”；常用于化学命名中，表示分子里含有砷相关的结构单元（常见为砷-氧结构）。"},"examples":[{"en":"In organic chemistry, some names use “arsenyl” to show that the molecule contains an arsenic-based group.","zh":"在有机化学中，一些名称会用“arsenyl”来表示分子含有砷相关的基团。"},{"en":"The paper describes an arsenyl-containing compound and its reactions in water.","zh":"这篇论文描述了一种含砷基团的化合物及其在水中的反应。"}]},{"partOfSpeech":"n.","definition":{"en":"(Chemistry) An arsenic-containing group within a molecule (used in technical descriptions and naming).","zh":"（化学）分子中的“含砷基团”（多用于专业描述与命名）。"},"examples":[{"en":"The structure can be described as an aromatic ring attached to an arsenyl group.","zh":"该结构可描述为：一个芳香环连接到一个含砷基团。"}]}],"synonyms":["arsenic-containing","arsenical (broader/older usage)"],"phonetic":"/ˈɑrsənɪl/","extraExplanation":["“arsenyl”主要出现在化学/生物化学文献与命名中，日常英语几乎不用。","含砷化合物通常具有毒性或环境风险；在阅读相关材料时要把它当作“术语”理解，而不是常用词汇。","拼写上容易与“arsenal（军械库）”混淆，但两者含义完全无关。"]}
{"word":"arses","summary":{"en":"“Arses” is the plural of the vulgar British word “arse,” meaning either buttocks or (as an insult) an unpleasant person.","zh":"“arses”是英式粗俗词“arse”的复数，可指“屁股”，也可作骂人用语（指讨厌的人/混蛋）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(vulgar, mainly British English) The plural of “arse”: a person’s buttocks.","zh":"（粗俗词，主要英式英语）“arse”的复数：人的屁股。"},"examples":[{"en":"The kids came back covered in mud, all over their arses.","zh":"孩子们回来时浑身是泥，连屁股上都是。"},{"en":"He fell off the bike and landed on his arse.","zh":"他从自行车上摔下来，一屁股坐在地上。"}]},{"partOfSpeech":"n.","definition":{"en":"(vulgar, mainly British English) The plural of “arse”: an insulting term for a person (similar to “asshole,” but meaning varies by context).","zh":"（粗俗词，主要英式英语）“arse”的复数：对人的侮辱性称呼（类似“asshole/混蛋”，但语气和含义随语境变化）。"},"examples":[{"en":"Don’t be an arse—just apologize.","zh":"别当个混蛋了——道个歉吧。"},{"en":"They acted like complete arses at the meeting.","zh":"他们在会议上表现得像一群十足的混蛋。"}]}],"synonyms":["butts","bottoms","backsides","asses (AmE, informal)"],"phonetic":"/ˈɑr.sɪz/","extraExplanation":["“arse”在英式英语里很常见，但属于粗口/低俗用语；在正式场合、职场或对不熟的人通常应避免。美式英语里更常见的是“ass”（屁股/蠢人）或更粗的“asshole”（骂人）。","常见固定表达：fall on your arse（摔个四脚朝天/一屁股坐下）、kick up the arse（在屁股上踢一脚，比喻“推动/逼一把”）、arse about face（180度大转弯，态度或立场突然改变）。"]}
{"word":"arsesmart","summary":{"en":"A mildly vulgar slang adjective meaning “cheekily overconfident or smart-alecky.”","zh":"一个略粗俗的俚语形容词，意思是“耍小聪明、油嘴滑舌、带点不尊重的自作聪明”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(slang, chiefly UK/Ireland; mildly vulgar) Too clever in a cheeky, disrespectful way; smart-alecky or presumptuous.","zh":"（俚语，多见于英国/爱尔兰；略粗俗）自作聪明、耍小聪明的；油嘴滑舌、带点不尊重的。"},"examples":[{"en":"Don’t get arsesmart with me—just answer the question.","zh":"别跟我耍小聪明——直接回答问题。"},{"en":"He made an arsesmart comment in class and the teacher shut him down.","zh":"他在课堂上说了句自作聪明的风凉话，老师马上制止了。"},{"en":"She’s arsesmart sometimes, but she usually means well.","zh":"她有时候会耍点小聪明，但通常是好意。"}]}],"synonyms":["smart-alecky","cheeky","mouthy","fresh","cocky","wiseass"],"phonetic":"/ˈɑrsˌsmɑrt/","extraExplanation":["“arse”在英式英语里相当于美式的“ass”，是比较粗俗的词；因此“arsesmart”带有不礼貌/冒犯的语气，适合在熟人之间的口语里或在描写人物时使用，不建议在正式场合、对长辈或陌生人使用。","拼写上也可能见到“arse-smart”“arse smart”，含义基本相同。","语气接近“smart-alecky / mouthy / cheeky（带点无礼）”，但因为含有粗口，攻击性通常更强。"]}
{"word":"arsheen","summary":{"en":"“Arsheen” is usually a variant of “arshin,” a historical unit of length; it can also appear as a transliteration in cultural titles/names.","zh":"“arsheen”通常是“arshin”的异拼，指一种历史长度单位；也可能作为音译出现在文化作品标题或专名中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a variant spelling of arshin: a traditional Russian and Central Asian unit of length (about 28 inches / 71 cm), now mostly historical.","zh":"arshin 的另一种拼写：一种传统的俄罗斯及中亚长度单位（约 28 英寸 / 71 厘米），现多用于历史语境。"},"examples":[{"en":"In old texts, cloth might be measured in arsheens (arshins).","zh":"在旧文献中，布料可能用 arsheen（arshin）来计量。"},{"en":"The merchant sold silk by the arsheen.","zh":"那位商人按 arsheen 出售丝绸。"}]},{"partOfSpeech":"other","definition":{"en":"a proper name/transliteration sometimes seen in titles or names (especially related to the Azerbaijani operetta “Arshin Mal Alan”), not a common everyday English word.","zh":"一种音译/专名拼写，常见于标题或人名中（尤其与阿塞拜疆轻歌剧《Arshin Mal Alan》相关），不是常用日常英语词。"},"examples":[{"en":"I first saw “Arsheen” in a film title, but the more common spelling is “Arshin.”","zh":"我第一次看到“Arsheen”是在电影标题里，但更常见的拼写是“Arshin”。"}]}],"synonyms":["arshin"],"phonetic":"/ɑrˈʃin/","extraExplanation":["“arshin/arsheen”源自俄语 аршин（arshin），历史上常用于布匹等商品的长度计量；在现代英语里多出现在历史读物、翻译作品或文化标题中。","《Arshin Mal Alan》常被译作“布商”（字面含义接近“卖布的人”），因此你可能会在影视、音乐或戏剧资料里遇到这种拼写。"]}
{"word":"Arshile","summary":{"en":"Arshile is a masculine given name, most commonly associated with the painter Arshile Gorky.","zh":"Arshile 是一个男性名字，最常与画家 Arshile Gorky（阿希尔·高尔基）相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a masculine given name, best known from the painter Arshile Gorky","zh":"男性名字；最广为人知的用例来自画家 Arshile Gorky（阿希尔·高尔基）"},"examples":[{"en":"Arshile Gorky was an influential figure in American abstract art.","zh":"Arshile Gorky 是美国抽象艺术中很有影响力的人物。"},{"en":"In class, we studied a painting by Arshile.","zh":"课上我们学习了一幅 Arshile 的画作。"}]}],"synonyms":["(proper name) Arshile Gorky"],"phonetic":"/ɑrˈʃil/","extraExplanation":["“Arshile”在英语里通常被当作专有名词（人名）使用，不是常见词汇。最常被提到的是亚美尼亚裔美国画家 Arshile Gorky（1904–1948），他对抽象表现主义的发展有重要影响。","如果你是在艺术史或博物馆语境里看到这个词，通常就是指这位画家或以他名字命名/署名的作品。"]}
{"word":"arshin","summary":{"en":"A traditional Russian unit of length (about 71 cm / 28 inches), once common for measuring cloth.","zh":"俄国传统长度单位（约71厘米/28英寸），旧时常用于量布。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Russian unit of length, about 71 centimeters (28 inches), formerly used especially for measuring cloth","zh":"俄国传统长度单位（阿尔申），约等于71厘米（28英寸），旧时常用于量布"},"examples":[{"en":"In old Russia, cloth was often sold by the arshin.","zh":"在旧俄国，布料常常按“阿尔申”来出售。"},{"en":"The merchant measured the fabric in arshins.","zh":"商人用“阿尔申”为单位来量布。"}]}],"synonyms":["Russian yard (approx.)","traditional Russian measure"],"phonetic":"ˈɑrʃɪn","extraExplanation":["“arshin”一词来自俄语 аршин（arshin），可能与土耳其语/波斯语中表示“肘尺”或“手臂长度”的词有关，反映了许多古代长度单位常以人体尺度为基础。","这是历史计量单位：在现代俄语和国际交流中一般改用米（meter），但在历史文献、旧小说、或讨论传统贸易时仍可能出现。"]}
{"word":"arshine","summary":{"en":"“Arshine” is usually not a real English word; it’s often a misspelling of “arsine,” a very poisonous gas (AsH₃).","zh":"“arshine”通常不是标准英语单词；它常是“arsine（砷化氢，AsH₃）”的误拼，一种毒性很强的气体。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Common misspelling) Not a standard English word. People often mean “arsine,” a toxic gas (AsH₃).","zh":"（常见拼写错误）“arshine”不是标准英语单词。很多人想写的是“arsine”，一种有毒气体（砷化氢，AsH₃）。"},"examples":[{"en":"I couldn’t find “arshine” in the dictionary—did you mean “arsine”?","zh":"我在词典里找不到“arshine”——你是不是想写“arsine”？"}]},{"partOfSpeech":"n.","definition":{"en":"a highly poisonous, flammable gas containing arsenic (chemical formula AsH₃)","zh":"砷化氢；一种含砷的高毒、易燃气体（化学式 AsH₃）"},"examples":[{"en":"Arsine is extremely toxic, so labs handle it with strict safety rules.","zh":"砷化氢毒性极强，因此实验室会用非常严格的安全规范来处理它。"},{"en":"The report mentioned a risk of arsine exposure in metal-processing work.","zh":"报告提到在金属加工工作中可能有接触砷化氢的风险。"}]}],"synonyms":["arsenic hydride"],"phonetic":"ˈɑrsaɪn","extraExplanation":["“arsine”是化学术语，日常英语里不常用，更多出现在化学、工业安全、实验室环境中。","如果你是在歌曲、昵称、品牌名里看到“Arshine/ArShine”，那可能是专有名词（人名/公司名），含义要看具体语境。"]}
{"word":"arshins","summary":{"en":"“Arshins” is the plural form of “arshin,” an old Russian length measure (~71 cm).","zh":"“arshins”是“arshin（俄尺）”的复数，指旧时俄罗斯的长度单位（约71厘米）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of arshin: an old Russian unit of length (about 28 inches or 71 centimeters).","zh":"arshin 的复数：旧时俄罗斯的长度单位（约 28 英寸，约 71 厘米）。"},"examples":[{"en":"The cloth was sold by the arshins in old Russian markets.","zh":"在旧时的俄罗斯市场里，布料常按 arshins（俄尺）来出售。"},{"en":"In the novel, the merchant measured silk in arshins.","zh":"在小说里，商人用 arshins（俄尺）来丈量丝绸。"}]}],"synonyms":["arshin"],"phonetic":"/ɑrˈʃin/","extraExplanation":["“arshin”（俄尺）源自俄语，常见于历史文献、古典小说与翻译作品中（尤其是描写沙皇俄国时期的场景）。现代俄语与国际场合多使用米制，所以在当代日常英语中比较少见。"]}
{"word":"arsine","summary":{"en":"Arsine is a very poisonous, flammable gas containing arsenic.","zh":"Arsine 指“胂”，一种含砷的高毒、易燃气体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A highly poisonous, flammable gas (AsH₃) that contains arsenic, often encountered in industrial or laboratory settings.","zh":"胂（AsH₃）：一种含砷的高毒、易燃气体，常见于工业或实验室环境。"},"examples":[{"en":"Arsine exposure can be fatal, so strict safety controls are required in labs.","zh":"胂暴露可能致命，因此实验室必须采取严格的安全措施。"},{"en":"The technician checked the monitors to make sure no arsine gas was leaking.","zh":"技术员检查监测仪，确保没有胂气体泄漏。"}]}],"synonyms":["arsenic hydride","AsH3"],"phonetic":"/ˈɑrˌsaɪn/","extraExplanation":["“arsine”来自“arsen-（砷）”相关词根；在半导体制造、冶金等领域更可能听到这个词。日常英语中不常用，更多出现在安全手册、化学课本或工业新闻里。","注意区分：arsine（胂，气体）≠ arsenic（砷，元素/或其化合物的统称）。"]}
{"word":"arsines","summary":{"en":"“Arsines” means arsenic–hydrogen compounds (especially arsine gas, AsH₃), or more broadly a group of related (often organic) arsenic compounds.","zh":"“arsines”指砷—氢化合物（尤指砷化氢 AsH₃），也可泛指一类相关（常为有机）的砷化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Hydrides of arsenic (especially arsine gas, AsH₃), or related arsenic–hydrogen compounds; the plural form refers to more than one such compound.","zh":"砷的氢化物（尤其指砷化氢气体 AsH₃），或相关的砷—氢化合物；复数形式表示多种此类化合物。"},"examples":[{"en":"Arsines can be produced during certain industrial processes involving arsenic.","zh":"在一些涉及砷的工业过程中可能会生成多种砷化氢类化合物（arsines）。"},{"en":"Because arsines are highly toxic, laboratories handle them with strict safety controls.","zh":"由于砷化氢类化合物毒性很强，实验室会用严格的安全措施来操作。"}]},{"partOfSpeech":"n.","definition":{"en":"In chemistry, organic compounds that contain arsenic bonded to carbon and hydrogen (organoarsines), mentioned as a group.","zh":"（化学）含有砷—碳键并带有氢的有机砷化合物（有机砷化氢类，organoarsines）的统称。"},"examples":[{"en":"Some arsines are used as intermediates in chemical research.","zh":"某些有机砷化氢类化合物会作为化学研究中的中间体使用。"}]}],"synonyms":["arsine gas","arsenic hydrides","AsH3"],"phonetic":"ˈɑrˌsaɪnz","extraExplanation":["“arsines”是“arsine”的复数。最常见的“arsine”专指砷化氢（AsH₃），是一种无色、剧毒气体；在材料与半导体领域也可能提到相关有机砷化合物（organoarsines）。在日常英语里很少出现，更多见于化学/工业安全语境。"]}
{"word":"arsinic","summary":{"en":"Arsinic means “related to or containing arsenic,” and in chemistry it often refers to arsinic acids or arsinic groups.","zh":"arsinic 指“与砷有关/含砷的”；在化学中常特指与胂酸或胂酸基团相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to arsenic or containing arsenic.","zh":"与砷有关的；含砷的。"},"examples":[{"en":"The report warned about arsenic pollution and arsenic compounds in the soil.","zh":"报告警告土壤中存在砷污染以及含砷化合物。"},{"en":"Use proper safety equipment when working with arsenic or arsenic materials.","zh":"处理砷或含砷材料时要使用适当的安全防护装备。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Relating to arsinic acids or the arsinic group in organic chemistry.","zh":"（化学）与“胂酸/胂酸基”有关的（有机化学中的 arsinic acid 或 arsinic 基团）。"},"examples":[{"en":"The paper describes the synthesis of several arsinic acid derivatives.","zh":"论文描述了几种胂酸衍生物的合成。"},{"en":"Arsinic functional groups can affect how a molecule binds in experiments.","zh":"胂酸官能团会影响分子在实验中的结合方式。"}]}],"synonyms":["arsenical","arsenic (adj.)","arsenic-containing"],"phonetic":"/ɑrˈsɪnɪk/","extraExplanation":["“arsinic”是形容词，日常英语中更常见的是“arsenic”（既可作名词也可作形容词，如 arsenic poisoning 砷中毒）。在学术/化学语境里，“arsinic”常用来描述“胂酸（arsinic acid）”及其相关结构（例如有机胂酸 RAsO(OH)2）。","拼写提示：arsenic（砷） vs. arsinic（与胂酸/含砷相关的形容词用法更偏专业）。"]}
{"word":"arsino","summary":{"en":"arsino- is a chemistry prefix meaning “containing an arsenic group,” especially –AsH₂.","zh":"arsino- 是化学中的构词前缀，表示“含砷基团”，尤指 –AsH₂（胂基）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Chemistry, combining form) relating to an arsenic-containing group, especially the substituent –AsH₂ (arsino group). It is used mainly in scientific names of organic compounds.","zh":"（化学，构词成分）表示“含砷的基团”，尤指取代基 –AsH₂（“胂基/砷基”之一种写法：arsino group）。多用于有机化合物的命名。"},"examples":[{"en":"The molecule contains an arsino group attached to a benzene ring.","zh":"这个分子含有一个连接在苯环上的 arsino（胂基）基团。"},{"en":"In chemical nomenclature, arsino- helps indicate where arsenic appears in the structure.","zh":"在化学命名中，arsino- 用来标明结构中砷出现的位置。"}]}],"synonyms":["arsen-","arsenic-related"],"phonetic":"ˈɑr.sə.noʊ","extraExplanation":["“arsino”在日常英语里几乎不作为独立单词使用，更常见的是作为前缀/构词成分“arsino-”出现在化学术语中。","如果你想查的是气体“arsine”（砷化氢，AsH₃），它的拼写是 arsine，读音和含义都不同；告诉我你想要哪个，我可以给出对应词条与例句。"]}
{"word":"Arsinoe","summary":{"en":"Arsinoe is an ancient Greek female name best known from Ptolemaic Egypt, and it can also refer to several ancient places with the same name.","zh":"Arsinoe（阿尔西诺伊）是一个古希腊女性名字，最常与埃及托勒密王朝相关；它也可指若干同名的古代城市/地点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A female given name used in ancient Greek and especially in the Ptolemaic (Greek) royal family of Egypt; it refers to several historical queens and princesses (for example, Arsinoe II and Arsinoe IV).","zh":"一个古希腊女性名字，尤其常见于埃及托勒密王朝的王室；也指多位历史上的王后与公主（如阿尔西诺伊二世、阿尔西诺伊四世）。"},"examples":[{"en":"Arsinoe II was an influential queen in Ptolemaic Egypt.","zh":"阿尔西诺伊二世是托勒密埃及一位极具影响力的王后。"},{"en":"Some historians compare Arsinoe IV’s political role with Cleopatra’s early struggles for power.","zh":"一些历史学家把阿尔西诺伊四世的政治角色与克娄巴特拉早期的权力斗争作比较。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name from antiquity; several ancient towns were called Arsinoe, especially in Egypt and Cyprus.","zh":"古代地名；多座古城曾名为Arsinoe，尤以埃及和塞浦路斯一带较常见。"},"examples":[{"en":"The port city once called Arsinoe later became known by another name.","zh":"这座曾被称为Arsinoe的港口城市后来改用了另一个名称。"},{"en":"Ancient sources mention Arsinoe as a settlement in Cyprus.","zh":"古代文献提到塞浦路斯有一个名为Arsinoe的聚落。"}]}],"phonetic":"/ɑrˈsɪn.oʊ.i/","extraExplanation":["“Arsinoe（阿尔西诺伊）”源自古希腊语，常被解释为与“高贵、崇高的心智/思想”相关。","在托勒密王朝中，这个名字被多位王室女性重复使用，因此阅读历史书或影视作品时，最好留意后面的编号（如II、IV）或称号来区分具体人物。","英文里也常见拼写变体“Arsinoë”（末尾带分音符ë），用来提示读音为三个音节（ar-SIN-oh-ee/ay），但日常英文写作常省略分音符。"]}
{"word":"Arsinoitherium","summary":{"en":"Arsinoitherium is a large extinct African mammal known for two horn-like nose structures.","zh":"Arsinoitherium（阿尔西诺兽）是一种已灭绝的非洲大型哺乳动物，以鼻部一对角状突起著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large extinct herbivorous mammal (Arsinoitherium) from ancient Africa, famous for having two big horn-like structures on its nose; it lived about 36–30 million years ago.","zh":"（古生物）阿尔西诺兽（Arsinoitherium）：一种已灭绝的大型草食性哺乳动物，生活在古代非洲，以鼻部两根巨大的“角状”突起而著名；约生存于距今约3600万至3000万年前。"},"examples":[{"en":"Arsinoitherium lived in what is now Egypt during the Oligocene period.","zh":"阿尔西诺兽生活在渐新世时期的地区，地点大致相当于今天的埃及。"},{"en":"In the museum, a model of Arsinoitherium shows its heavy body and twin horn-like bumps.","zh":"在博物馆里，阿尔西诺兽的模型展示了它粗壮的身体和一对角状隆起。"}]}],"synonyms":["Arsinoitherium (genus name)","prehistoric mammal","extinct herbivore"],"phonetic":"/ɑrˌsaɪnɔˈθɪriəm/","extraExplanation":["词名来自古希腊语后缀 -therium（意为“兽”或“野兽”），Arsinoi- 指向“阿尔西诺伊”（Arsinoë），常被解释为与古埃及托勒密王朝的阿尔西诺伊二世（Queen Arsinoë II）相关的命名致敬。","它的“角”并非犀牛那种角质结构，更像是头骨上的骨性突起；尽管外形像犀牛，但亲缘关系并不近。"]}
{"word":"arsinoitherium","summary":{"en":"Arsinoitherium is an extinct large mammal from ancient North Africa, famous for its horn-like head bumps.","zh":"Arsinoitherium（阿尔西诺兽）是北非古代的一种大型已灭绝哺乳动物，以头部角状突起著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large extinct mammal (genus Arsinoitherium) that lived in North Africa about 36–30 million years ago, known for having two big horn-like bumps on its head; it looked somewhat like a rhinoceros but was not closely related to modern rhinos","zh":"一种已灭绝的大型哺乳动物（阿尔西诺兽属 Arsinoitherium），生活在约3600万到3000万年前的北非，以头部两根巨大的“角状突起”闻名；外形有点像犀牛，但与现代犀牛并非近亲"},"examples":[{"en":"Arsinoitherium fossils have been found in Egypt’s Fayum region.","zh":"阿尔西诺兽的化石曾在埃及法尤姆地区被发现。"},{"en":"Although it looked rhinoceros-like, Arsinoitherium belonged to a different group of mammals.","zh":"虽然它看起来像犀牛，阿尔西诺兽其实属于不同的哺乳动物类群。"}]}],"phonetic":"/ɑrˌsɪnɔɪˈθɪriəm/","extraExplanation":["“Arsinoitherium”是学名（属名），通常首字母大写并用斜体书写（Arsinoitherium）。名字来自“Arsinoë（阿尔西诺伊/阿尔西诺埃）”——古埃及托勒密王朝的一位王后/公主之名，加上希腊语“-therium（兽）”，大意是“阿尔西诺的兽”。"]}
{"word":"Arsinous","summary":{"en":"Arsinous is a rare spelling, usually a variant of Arsinoë (a historical name), or a misspelling of “arsenous” in chemistry.","zh":"Arsinous 是很少见的拼写，通常是 Arsinoë（历史人名/地名）的变体，或是化学词 “arsenous（亚砷的）”的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Rare) A proper name; a variant spelling of **Arsinoüs / Arsinoë**, used for people (especially in ancient Greek/Egyptian history) or places bearing that name.","zh":"（罕见）专有名词；**Arsinoüs / Arsinoë（阿尔西诺伊）**的变体拼写，可指历史人物（多见于古希腊/古埃及背景）或以此命名的城市。"},"examples":[{"en":"Some older books use **Arsinous** as a variant of **Arsinoë**, a name associated with the Ptolemaic queens of Egypt.","zh":"一些较早的书会用 **Arsinous** 作为 **Arsinoë** 的变体拼写；这个名字常与埃及托勒密王朝的王后有关。"},{"en":"The inscription may refer to **Arsinous**, but modern historians usually standardize the spelling as **Arsinoë**.","zh":"这段铭文可能写的是 **Arsinous**，但现代史学著作通常把拼写统一为 **Arsinoë**。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Often a misspelling) **arsenous**: relating to arsenic in the +3 oxidation state (As(III)), common in chemistry terms like “arsenous acid.”","zh":"（常见为拼写误差）**arsenous（亚砷的）**：指砷处于 +3 价态（As(III)）时的性质，常见于化学表达如“arsenous acid（亚砷酸）”。"},"examples":[{"en":"In older chemistry texts, **arsenous acid** is contrasted with **arsenic acid**.","zh":"在较早的化学教材里，**arsenous acid（亚砷酸）**常与 **arsenic acid（砷酸）**对比。"},{"en":"The compound contains arsenic in an **arsenous** form (As(III)).","zh":"该化合物中的砷以**亚砷态（As(III)）**存在。"}]}],"synonyms":["Arsinoë","Arsinoe","(chemistry) arsenous"],"phonetic":"/ɑrˈsaɪnoʊs/","extraExplanation":["你输入的 **Arsinous** 在现代英语里非常少见，更多时候人们要么写作 **Arsinoë / Arsinoe**（历史人名/地名），要么其实想写 **arsenous**（化学术语，“亚砷的”）。\n\n如果你能告诉我它出现在哪本书/哪句话里，我可以帮你判断具体指哪一个，并给出更贴合上下文的解释。"]}
{"word":"Arsippe","summary":{"en":"Arsippe is a rare Greek-origin proper name, mainly found in classical/mythological references; its exact referent depends on context.","zh":"Arsippe 是一个罕见的希腊来源专名，多见于古典/神话引用；具体所指需依上下文而定。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Arsippe: a rare proper name (usually a feminine name) of classical Greek origin. In English it is mainly seen in references to ancient mythology or classical literature; the exact person meant depends on the source.","zh":"Arsippe：一个较少见的专有名词（通常为女性名字），源自古希腊。在英语中多见于古典神话或古典文学的引用中；具体指哪位人物需看出处与上下文。"},"examples":[{"en":"In some classical references, Arsippe is listed as a minor figure, so you may need the author or passage to know who she is.","zh":"在一些古典文献的提要里，Arsippe 被列为较次要的人物，因此需要作者或具体段落才能确认她是谁。"},{"en":"The name Arsippe appears in notes and genealogies rather than in everyday English.","zh":"Arsippe 这个名字更多出现在注释和族谱式的整理中，而不是日常英语里。"}]}],"phonetic":"/ɑrˈsɪpi/","extraExplanation":["Arsippe 在现代英语里非常罕见，很多时候是从古希腊名字（常见转写为 Arsippē / Ἀρσίππη）音译而来。不同书目、神话辞典或译本里，可能把它用作不同小人物的名字。","如果你能提供你看到 Arsippe 的句子、书名/章节或截图，我可以更准确地判断它在该文本中指的到底是哪一位人物（或是否为拼写变体）。"]}
{"word":"arsis","summary":{"en":"Arsis is a technical term in poetry and music meaning the “lift” or upbeat part of a rhythm, contrasted with thesis (the downbeat).","zh":"Arsis 是诗歌格律与音乐里的术语，指节奏中“抬起/弱起（上扬）”的部分，与 thesis（落下/重拍）相对。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Poetry/Prosody) The “lift” or unaccented/upward part of a metrical foot; traditionally contrasted with thesis (the “downbeat” or stressed part).","zh":"（诗歌/格律）音步中“抬起/上升”的部分，常指非重读或向上提起的节拍；与 thesis（落下/重拍）相对。"},"examples":[{"en":"In some descriptions of Greek meter, arsis refers to the part of the foot where the voice rises.","zh":"在一些对希腊格律的描述里，arsis 指声音上扬的那一段。"},{"en":"The teacher explained the contrast between arsis (lift) and thesis (fall) to help students feel the rhythm.","zh":"老师讲解了 arsis（抬起）和 thesis（落下）的对比，帮助学生体会节奏。"}]},{"partOfSpeech":"n.","definition":{"en":"(Music) The upbeat: the lighter, preparatory part of a beat or measure before the main stress.","zh":"（音乐）弱起（upbeat）：在主要重拍之前较轻、起势的节拍部分。"},"examples":[{"en":"The melody starts on the arsis, so it feels like it leans into the first strong beat.","zh":"旋律从 arsis（弱起）开始，所以听起来像是“带着劲儿”进入第一个强拍。"},{"en":"Clap the thesis strongly, and let the arsis be lighter.","zh":"thesis 用力拍，arsis 轻一点。"}]}],"synonyms":["upbeat","lift"],"phonetic":"ˈɑr.sɪs","extraExplanation":["词源来自希腊语，原意有“抬起、举起”之感，所以在格律/音乐里常被理解为“上扬、起势”的部分。","在不同学术传统里，arsis 有时会被用来指“重读”或“轻读”的不同一方，阅读教材时最好看作者如何定义它，并注意它与 thesis 的配对关系。","该词在日常英语中非常少见，多出现在诗歌格律、古典语言学、音乐理论等语境。"]}
{"word":"arsle","summary":{"en":"“Arsle” is not a standard English word; it’s likely a misspelling of “arse” or “ass.”","zh":"“arsle”不是标准英语词汇；很可能是“arse”或“ass”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A misspelling or nonstandard form; most often people mean “arse” (British English slang for buttocks) or “ass” (American English slang for buttocks).","zh":"常见的拼写错误或非标准写法；多数情况下是想写“arse”（英式英语俚语：屁股）或“ass”（美式英语俚语：屁股）。"},"examples":[{"en":"I think “arsle” is a typo—did you mean “arse” or “ass”?","zh":"我觉得“arsle”可能是打错了——你是想写“arse”还是“ass”？"},{"en":"If you meant “arse,” be careful: it’s informal and can sound rude.","zh":"如果你想写“arse”，要注意：它很口语，有时听起来会有点粗鲁。"}]}],"synonyms":["arse","ass","butt","rear"],"phonetic":"/ˈɑr.səl/","extraExplanation":["“arse”更常见于英式英语（英国、爱尔兰等），语气通常比“ass”更偏英式、口语且略粗；“ass”在美式英语里很常见，也可引申表示“蠢人/混蛋”（带冒犯）。","如果你能提供句子语境（例如整句或你想表达的意思），我可以帮你确定你真正想查的词，并给出更准确的释义与用法。"]}
{"word":"ARSM","summary":{"en":"ARSM most commonly means “Associate of the Royal Schools of Music,” a UK music performance diploma from ABRSM.","zh":"ARSM 最常见指“英国皇家音乐学院联合委员会准院士级别”的音乐表演文凭（ABRSM 体系）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Associate of the Royal Schools of Music (a UK music performance diploma/qualification awarded by ABRSM).","zh":"英国皇家音乐学院联合委员会（ABRSM）颁发的音乐表演文凭/资格之一：ARSM（皇家音乐学院联合委员会“准院士”级别）。"},"examples":[{"en":"She earned the ARSM in Piano Performance last year.","zh":"她去年获得了钢琴表演的 ARSM 文凭。"},{"en":"The conservatory asked applicants to list diplomas such as ARSM, DipABRSM, or LRSM.","zh":"音乐学院要求申请者列出如 ARSM、DipABRSM 或 LRSM 等文凭。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation that can also stand for other organizations or terms depending on context (less common).","zh":"在不同语境中也可能代表其他机构或术语的缩写（较少见，需看上下文）。"},"examples":[{"en":"In this document, ARSM refers to a local professional association, not the music diploma.","zh":"在这份文件里，ARSM 指的是一个本地行业协会，而不是音乐文凭。"}]}],"synonyms":["Associate of the Royal Schools of Music","ABRSM diploma (category)"],"phonetic":"/ˌɑr.ɛsˈɛm/","extraExplanation":["ARSM 通常出现在音乐考试/简历语境中，最常见含义是 ABRSM（英国皇家音乐学院联合委员会）体系里的表演文凭级别之一，常被理解为介于“高级等级考试”和更高阶文凭（如 DipABRSM、LRSM）之间的资格。","读法一般是按字母念 A-R-S-M。若你告诉我它出现的句子或领域（音乐、学校、公司、医学等），我可以帮你确认在该语境下的准确含义。"]}
{"word":"arsmetik","summary":{"en":"Arithmetic = basic math with numbers (add, subtract, multiply, divide).","zh":"Arithmetic = 以数字的加减乘除为核心的基础“算术”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Correct spelling) the part of mathematics that deals with basic operations like addition, subtraction, multiplication, and division.","zh":"（正确拼写）算术：数学中处理加、减、乘、除等基本运算的部分。"},"examples":[{"en":"In elementary school, we learned arithmetic like addition and subtraction.","zh":"在小学，我们学习了加法和减法等算术。"},{"en":"You can use a calculator for arithmetic, but it’s good to understand the steps.","zh":"你可以用计算器做算术，但理解步骤也很重要。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to basic number calculations (not algebra or higher math).","zh":"与基础数字计算有关的（相对于代数或更高等数学）。"},"examples":[{"en":"This is an arithmetic mistake, not a logic problem.","zh":"这是算术错误，不是逻辑问题。"},{"en":"The app helps students practice arithmetic skills.","zh":"这个应用帮助学生练习算术技能。"}]}],"synonyms":["basic math","calculation"],"phonetic":"/əˈrɪθmətɪk/","extraExplanation":["你输入的“arsmetik”常见于把英文单词拼错的情况；标准拼写是 arithmetic（算术）。如果你想表达“数学（学科）”更宽泛的意思，常用 math / mathematics，而 arithmetic 更强调加减乘除这类基础运算。","常见搭配：arithmetic operations（算术运算）、arithmetic mean（算术平均数）、do mental arithmetic（做心算）。"]}
{"word":"arsmetrik","summary":{"en":"Arithmetic is basic math with numbers (add, subtract, multiply, divide), and it can also describe things related to such calculations.","zh":"Arithmetic 指处理数字的基础数学（加减乘除），也可作形容词表示“算术的、与计算有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the basic type of math that deals with numbers and the operations of adding, subtracting, multiplying, and dividing","zh":"算术；处理数字以及加、减、乘、除等运算的基础数学"},"examples":[{"en":"My little sister is learning arithmetic at school.","zh":"我妹妹在学校学算术。"},{"en":"You need basic arithmetic to manage a budget.","zh":"你需要基本的算术来管理预算。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to basic number calculations (addition, subtraction, multiplication, division)","zh":"算术的；与基本数字运算有关的"},"examples":[{"en":"There was an arithmetic mistake in the total.","zh":"总数里有一个算术错误。"},{"en":"This is an arithmetic problem, not a geometry one.","zh":"这是算术题，不是几何题。"}]}],"synonyms":["basic math","calculation","numeracy"],"phonetic":"/əˈrɪθmətɪk/","extraExplanation":["你输入的“arsmetrik”很可能是拼写错误，常见的正确拼写是 **arithmetic**。","**arithmetic** 的词源与阿拉伯语有关：中世纪欧洲通过阿拉伯学者的著作接触到数字与计算方法，因此这个词带有明显的历史文化传播背景。"]}
{"word":"arsmetrike","summary":{"en":"Arithmetic is basic math with numbers (add, subtract, multiply, divide).","zh":"Arithmetic 指“算术”，即用数字进行加减乘除等基础运算。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the basic kind of mathematics that deals with numbers and operations like addition, subtraction, multiplication, and division","zh":"算术；处理数字及加、减、乘、除等运算的基础数学"},"examples":[{"en":"In elementary school, we learned arithmetic before algebra.","zh":"在小学，我们先学算术，再学代数。"},{"en":"I’m good at arithmetic, but word problems are harder for me.","zh":"我算术不错，但应用题对我来说更难。"},{"en":"Check your arithmetic before you submit the report.","zh":"提交报告前先检查一下你的计算是否正确。"}]}],"synonyms":["basic math","calculation","math"],"phonetic":"/əˈrɪθməˌtɪk/","extraExplanation":["你写的“arsmetrike”不是常见英文单词；最可能想写的是 **arithmetic**（算术）。常见拼法提示：a-r-i-t-h-m-e-t-i-c。","词源小知识：arithmetic 来自希腊语 *arithmos*（“数字”）。在英语里也常用来表示“计算是否正确”（例如：Check the arithmetic）。"]}
{"word":"arsmetry","summary":{"en":"Asymmetry means a lack of symmetry—two sides or parts don’t match.","zh":"Asymmetry 指“不对称”，即两边或各部分不相同、不匹配。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lack of symmetry; an uneven or unbalanced arrangement where two sides do not match","zh":"不对称；（两边）不相同、不均衡的状态"},"examples":[{"en":"The face has slight asymmetry—one eye is a bit higher than the other.","zh":"这张脸有轻微的不对称——一只眼睛比另一只略高。"},{"en":"Designers sometimes use asymmetry to make a layout feel more dynamic.","zh":"设计师有时会用不对称，让版面更有动感。"},{"en":"Researchers measured asymmetry in the wings to study the health of the birds.","zh":"研究人员测量翅膀的不对称性，以研究鸟类的健康状况。"}]}],"synonyms":["imbalance","unevenness","irregularity","disproportion"],"phonetic":"/ˌeɪˈsɪmɪtri/","extraExplanation":["“arsmetry” 不是常见英文单词，最可能是拼写错误，常见目标词是 **asymmetry**（不对称）。如果你本来想表达“算术”，那对应的词是 **arithmetic**。你也可以告诉我你的语境（比如数学/设计/生物学），我可以帮你确定想要的词。","词源小提示：**asymmetry** 来自希腊语前缀 **a-**（“不、无”）+ **symmetry**（“对称”），意思就是“没有对称”。文学和艺术评论中也常用它来谈构图、人物面孔或叙事结构的“刻意不对称”。"]}
{"word":"arsnicker","summary":{"en":"“Snicker” means to laugh quietly (often a bit rude or childish), or the quiet laugh itself.","zh":"“snicker” 指带点不礼貌或幼稚意味的暗笑/窃笑，也可指这种窃笑声。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to laugh quietly in a disrespectful or silly way, often because you think something is funny or embarrassing","zh":"暗笑；窃笑（常带有不礼貌、嘲弄或觉得尴尬好笑的意味）"},"examples":[{"en":"The kids started to snicker when the teacher’s phone rang in class.","zh":"老师的手机在课堂上响了，孩子们开始窃笑。"},{"en":"Don’t snicker at her accent—be respectful.","zh":"别嘲笑她的口音——要有礼貌。"}]},{"partOfSpeech":"n.","definition":{"en":"a quiet, partly suppressed laugh","zh":"暗笑；窃笑声"},"examples":[{"en":"I heard a snicker from the back of the room.","zh":"我听到教室后面传来一阵窃笑声。"}]}],"synonyms":["giggle","chuckle","titter"],"phonetic":"ˈsnɪkər","extraExplanation":["“arsnicker” 不是常见英语单词，较像拼写错误或网名/自造词。你是不是想查 **snicker**（窃笑）？如果你能提供使用场景或句子，我也可以帮你判断 “arsnicker” 在那个语境里可能是什么意思。"]}
{"word":"arsoite","summary":{"en":"Arsenite is a chemistry term for an arsenic(III) compound/ion, often found in discussions of water quality and toxicity.","zh":"Arsenite 是化学用语，指含三价砷（As(III)）的化合物/离子，常见于水质与毒性相关讨论。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A compound (or ion) that contains arsenic in the +3 oxidation state; often used to refer to salts of arsenious acid.","zh":"（化学）亚砷酸盐/亚砷酸根：指含有+3价砷（As(III)）的化合物（或离子），常用来指亚砷酸的盐。"},"examples":[{"en":"Arsenite can be more toxic than arsenate in many biological systems.","zh":"在许多生物体系中，亚砷酸盐往往比砷酸盐更有毒。"},{"en":"The lab measured arsenite levels in the groundwater sample.","zh":"实验室测量了地下水样本中的亚砷酸盐含量。"}]}],"synonyms":["arsenite ion","arsenious salt"],"phonetic":"/ˈɑr.səˌnaɪt/","extraExplanation":["“arsoite”在英语里不是常见或标准拼写；你可能想写的是 **arsenite**（亚砷酸盐）。如果你能提供句子或出处（例如化学报告/论文），我也可以帮你确认具体指哪一种物质或拼写。","相关词对比：**arsenite (As(III))** 通常指“亚砷酸盐/亚砷酸根”，而 **arsenate (As(V))** 指“砷酸盐/砷酸根”。两者在毒性、化学反应与环境行为上常被区分讨论。"]}
{"word":"arson","summary":{"en":"Arson is the crime of deliberately setting fire to property.","zh":"Arson 指故意放火焚烧财物的犯罪行为（纵火罪）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the crime of intentionally setting fire to a building, vehicle, or other property","zh":"纵火罪；故意放火焚烧建筑物、车辆或其他财物的犯罪行为"},"examples":[{"en":"The police arrested him for arson after the warehouse fire.","zh":"仓库起火后，警方以纵火罪逮捕了他。"},{"en":"Investigators ruled out arson because the fire started from faulty wiring.","zh":"调查人员排除了纵火的可能，因为火灾是由电线故障引起的。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of deliberately setting something on fire (often used in legal or news contexts)","zh":"故意纵火的行为（常见于法律或新闻语境）"},"examples":[{"en":"The report describes multiple cases of arson in the neighborhood.","zh":"报告描述了该社区多起纵火案件。"},{"en":"The insurance company investigated whether it was arson.","zh":"保险公司调查这是否属于纵火。"}]}],"synonyms":["deliberate burning","fire-setting (in crime/news context)"],"phonetic":"/ˈɑr.sən/","extraExplanation":["“arson”是法律用语，强调“故意”与“非法”放火；如果是意外起火，常用“accidental fire”或“an electrical fire”等表达。","相关词汇：arsonist（纵火犯），set fire to…（放火烧……），commit arson（实施纵火）。","在英美新闻里，“suspected arson（疑似纵火）”“arson investigation（纵火调查）”很常见。"]}
{"word":"arsonate","summary":{"en":"An arsonate is a salt or ester of an arsonic acid—an organoarsenic compound.","zh":"arsonate 指有机砷酸（arsonic acid）的盐或酯，属于有机砷化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound that is a salt or ester of an arsonic acid (an organic arsenic acid), containing the arsonate group (often written as R–AsO(OH)O⁻ or related forms)","zh":"砷酸酯/砷酸盐的一类化合物：指“有机砷酸（arsonic acid）”的盐或酯，含有“arsonate（有机砷酸根）”结构（常写作 R–AsO(OH)O⁻ 等相关形式）"},"examples":[{"en":"Some older pesticides contained arsonate compounds, but many have been restricted because of toxicity concerns.","zh":"一些较早的农药曾含有 arsonate（有机砷酸盐）化合物，但由于毒性风险，许多已受到限制。"},{"en":"In the lab, the researcher tested an arsonate derivative to study how arsenic bonds to carbon.","zh":"在实验室里，研究人员测试了一种 arsonate 衍生物，用来研究砷如何与碳成键。"}]}],"synonyms":["arsonate compound","arsonic acid salt","arsonic acid ester"],"phonetic":"ˈɑr.səˌneɪt","extraExplanation":["“arsonate”容易与“arsenate（无机砷酸盐/砷酸根 AsO4^3−）”混淆：arsonate通常指有机砷化合物（来自arsonic acid），而arsenate多指无机砷酸盐。","该词主要用于化学与环境科学语境，日常英语中很少见；阅读科研文章或安全资料（SDS）时更常遇到。"]}
{"word":"arsonation","summary":{"en":"Arsonation is a rare noun meaning the act or crime of arson—deliberately setting fire to property.","zh":"Arsonation 是一个少见名词，意思是“纵火（罪）”，即故意放火烧毁财物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or crime of deliberately setting fire to property; arson (a rare/less common word).","zh":"故意纵火的行为或罪行；纵火（较少用的词）。"},"examples":[{"en":"The police investigated the warehouse fire as possible arsonation.","zh":"警方将这场仓库火灾按可能的纵火行为进行调查。"},{"en":"He was charged with arsonation after witnesses saw him ignite the trash behind the building.","zh":"目击者称看到他在楼后点燃垃圾后，他被以纵火罪起诉。"}]}],"synonyms":["arson","incendiarism","deliberate burning"],"phonetic":"/ˌɑr.səˈneɪ.ʃən/","extraExplanation":["“Arsonation”在现代英语里非常少见，更常用的是“arson”。如果你在法律文件、旧式写作或非母语写作者的文本中看到它，通常就是指“纵火/纵火罪”。","词源上与拉丁语后缀“-ation”（表示“行为/过程”）有关，结构上类似“accusation / vaccination”等，但实际使用频率远低于“arson”。"]}
{"word":"arsonic","summary":{"en":"“Arsonic” is usually a misspelling of “arsenic,” the poisonous element arsenic.","zh":"“arsonic”多半是“arsenic（砷）”的拼写错误；arsenic 指一种有毒的化学元素。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Common misspelling) Intended word: “arsenic,” a poisonous chemical element.","zh":"（常见拼写错误）通常想写的是 arsenic，指“砷”，一种有毒的化学元素。"},"examples":[{"en":"I think you meant “arsenic,” not “arsonic.”","zh":"我想你是想写“arsenic（砷）”，不是“arsonic”。"},{"en":"Arsenic can be deadly if swallowed.","zh":"砷如果吞食可能致命。"}]}],"synonyms":["arsenic"],"phonetic":"/ˈɑrsənɪk/","extraExplanation":["“arsonic”不是现代英语里常见的标准单词；学习与写作中更常见的是“arsenic（砷）”。","注意拼写与发音：arsenic 中间是 -sen-，不是 -son-。","顺带区分：arson 是“纵火”。它和 arsenic（砷）意思完全不同，但拼写相近，容易混淆。"]}
{"word":"arsonist","summary":{"en":"An arsonist is someone who deliberately sets fires (commits arson).","zh":"arsonist 指“纵火犯”，即故意放火、犯纵火罪的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who deliberately sets fire to a building, vehicle, or other property (the crime is called arson)","zh":"纵火犯；故意放火烧毁建筑、车辆或其他财物的人（这种犯罪叫 arson）"},"examples":[{"en":"The police arrested an arsonist after several fires in the neighborhood.","zh":"社区接连发生多起火灾后，警方逮捕了一名纵火犯。"},{"en":"The building was destroyed by an arsonist, not an accident.","zh":"这栋楼是被纵火犯烧毁的，并非意外。"},{"en":"Investigators searched for evidence to identify the arsonist.","zh":"调查人员寻找证据来确认纵火犯的身份。"}]}],"synonyms":["firebug","incendiary (person)","arson offender"],"phonetic":"/ˈɑɹsənɪst/","extraExplanation":["词源：arsonist 来自 arson（纵火罪）+ -ist（表示“从事某事的人”）。因此 arsonist 强调“故意纵火”的行为，而不是一般的“起火/失火”。","用法提醒：在新闻和法律语境里很常见；日常口语里如果不确定是否“故意”，更中性可以说 someone set the fire（某人放火）或 the fire was intentionally set（火灾是人为造成的）。"]}
{"word":"arsonists","summary":{"en":"“Arsonists” means people who deliberately and illegally set fires.","zh":"“arsonists”指蓄意、非法放火的人（纵火犯）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who deliberately sets fire to a building, vehicle, or other property illegally (commits arson)","zh":"纵火犯；蓄意非法放火的人"},"examples":[{"en":"The police arrested two arsonists after several suspicious fires in the neighborhood.","zh":"警方在社区发生多起可疑火灾后逮捕了两名纵火犯。"},{"en":"Arsonists often choose empty buildings to avoid being seen.","zh":"纵火犯常选择空置建筑以避免被人发现。"},{"en":"The security cameras helped identify the arsonist.","zh":"监控摄像头帮助确认了纵火犯的身份。"}]}],"synonyms":["firebug","incendiary (person)","arson offender"],"phonetic":"/ˈɑr.sə.nɪsts/","extraExplanation":["“Arsonist”来自“arson（纵火罪）”。在新闻和法律语境中很常见，语气较强，通常指“故意且非法”的放火，不用于描述意外起火。"]}
{"word":"arsonite","summary":{"en":"A rare chemistry term: an arsonite is a compound derived from arsonous acid; it’s also sometimes used as a mistaken spelling of “arsenite.”","zh":"较少见的化学词：arsonite 指由亚砷酸衍生的化合物；也常被当作 arsenite（亚砷酸盐）的误拼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A salt or ester derived from arsonous acid (an arsenic(III) oxyacid); an organoarsenic compound in the “arsonite” family.","zh":"（化学）由亚砷酸（砷(III)含氧酸）衍生的盐或酯；“亚砷酸盐/亚砷酸酯（arsonite）”类有机砷化合物。"},"examples":[{"en":"The paper reports the synthesis of an arsonite ligand for coordination chemistry.","zh":"该论文报告了用于配位化学的一种亚砷酸酯（arsonite）配体的合成。"},{"en":"Arsonite compounds are typically handled under strict safety rules because arsenic can be highly toxic.","zh":"由于砷可能具有很强毒性，亚砷酸盐/酯（arsonite）化合物通常需要在严格的安全规范下操作。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common; often informal) A misspelling or mistaken form of “arsenite.”","zh":"（较少见；多为非正式）“arsenite（亚砷酸盐）”的拼写错误或误用形式。"},"examples":[{"en":"If you meant the inorganic salt, the standard spelling is arsenite, not arsonite.","zh":"如果你指的是无机盐，标准拼写是 arsenite，而不是 arsonite。"}]}],"synonyms":["arsenite (often what people intend)","organarsenic compound (broader)"],"phonetic":"/ˈɑr.sə.naɪt/","extraExplanation":["这个词很少在普通英语中出现，更多见于化学文献（尤其是有机砷化学）。它看起来像 arson（纵火），但两者没有关系：arsonite 来自 arsenic/arsen-（砷）这一词根。日常学习中更常遇到的是 arsenite（亚砷酸盐）与 arsenate（砷酸盐）。"]}
{"word":"arsonium","summary":{"en":"A chemistry term for the organoarsenic cation R₄As⁺ and its salts.","zh":"化学术语：指有机砷阳离子 R₄As⁺ 及其盐类（砷鎓盐）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A positively charged organoarsenic ion, typically written as R₄As⁺ (analogous to ammonium, R₄N⁺), and the group of compounds (salts) that contain this ion.","zh":"（化学）一种带正电的有机砷离子，通常写作 R₄As⁺（类似于铵离子 R₄N⁺）；也可指含有该离子的化合物（砷鎓盐）。"},"examples":[{"en":"In some organic chemistry texts, arsonium salts are discussed as heavier analogs of ammonium salts.","zh":"在一些有机化学教材中，砷鎓盐会被作为铵盐的“更重同系物”来讨论。"},{"en":"The reaction produced an arsonium compound rather than a neutral organoarsenic molecule.","zh":"该反应生成了砷鎓化合物，而不是中性的有机砷分子。"}]}],"synonyms":["arsonium ion","arsonium salt","organoarsonium"],"phonetic":"/ɑrˈsoʊniəm/","extraExplanation":["“arsonium”主要出现在专业化学语境中，日常英语几乎不用。它和“arsenic（砷）/arsenical（含砷的）”同源，但并不表示“纵火（arson）”，两者只是拼写相近、含义无关。","含砷化合物可能具有毒性；在学习或实验语境中看到该词时，通常是在讨论结构/离子类型而非日常物品。"]}
{"word":"arsono","summary":{"en":"“Arsono” is usually a person’s name (a proper noun), not a common English word.","zh":"“Arsono”通常是人名（专有名词），不是常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A given name or surname (most commonly Indonesian/Javanese); a proper noun used to identify a person.","zh":"人名或姓氏（多见于印度尼西亚/爪哇语背景）；作为专有名词用于指代某个人。"},"examples":[{"en":"Arsono is my colleague from Surabaya.","zh":"Arsono 是我来自泗水的同事。"},{"en":"Please email Arsono the updated schedule.","zh":"请把更新后的日程发邮件给 Arsono。"}]}],"synonyms":["(no true synonyms; it is a name)"],"phonetic":"ɑrˈsoʊnoʊ","extraExplanation":["“Arsono”通常不是英语词汇，而是人名（专有名词）。在英语里使用人名时，一般不翻译其含义，主要关注拼写与读音。","如果你是在某篇文章、新闻或字幕里看到“Arsono”，它很可能是一个人的名字；需要结合上下文（他是谁、来自哪里、做什么）来理解。"]}
{"word":"arsonous","summary":{"en":"Arsonous means “related to arson” or “having an intention/tendency to commit arson,” but it’s not very common in modern English.","zh":"arsonous 指“与纵火有关的”或“有纵火意图/倾向的”，但在现代英语中不算常用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to arson (the crime of deliberately setting fire to property).","zh":"与纵火（故意放火焚毁财物的犯罪）有关的；纵火的。"},"examples":[{"en":"Police investigated the fire and treated it as an arsonous act.","zh":"警方调查这场火灾，并将其视为一起纵火行为。"},{"en":"The report mentioned possible arsonous intent, not an accident.","zh":"报告提到可能存在纵火意图，而非意外事故。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a tendency or intention to commit arson; incendiary in a criminal sense.","zh":"有纵火倾向的；具有纵火意图的（犯罪意义上）。"},"examples":[{"en":"They looked into whether the suspect had arsonous motives.","zh":"他们调查嫌疑人是否有纵火动机。"},{"en":"The prosecutor argued the damage was arsonous rather than careless.","zh":"检察官认为损害是纵火造成的，而不是疏忽导致的。"}]}],"synonyms":["arson-related","incendiary","pyromaniac (as an adjective: pyromaniacal)"],"phonetic":"/ˈɑr.sə.nəs/","extraExplanation":["“arsonous”在现代英语中较少见，更多时候会用更常见的形容词：**arson-related**（与纵火相关的）、**incendiary**（煽动性的；也可指纵火装置/引燃物相关）、或直接说 **arson** 作名词（e.g., “It was arson.”）。","构词上是 **arson + -ous**（表示“……的/具有……性质的”），意思直观，但在正式报道或法律语境里通常更偏好 “arson” 搭配名词或 “arson-related”。"]}
{"word":"arsons","summary":{"en":"Arson is the crime of intentionally setting something on fire.","zh":"Arson 指“故意放火”的犯罪行为（纵火）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the crime of deliberately setting fire to a building, vehicle, or other property","zh":"纵火罪；故意放火（烧毁建筑、车辆或其他财物的犯罪）"},"examples":[{"en":"The police arrested him for arson after the warehouse fire.","zh":"仓库失火后，警方以纵火罪逮捕了他。"},{"en":"Investigators found signs of arson, not an accident.","zh":"调查人员发现这是人为纵火的迹象，而不是意外。"},{"en":"The movie begins with an arson attack on a small shop.","zh":"电影以一家小店遭到纵火袭击开场。"}]}],"synonyms":["fire-setting","incendiarism"],"phonetic":"/ˈɑr.sən/","extraExplanation":["“arson”通常是不可数名词（commit arson），但在新闻/法律语境中也会见到复数“arsons”，表示“多起纵火案件”。","常见搭配：commit arson（实施纵火）、arson attack（纵火袭击）、suspected arson（疑似纵火）、arson investigator（纵火调查员）。","注意区分：fire（火/火灾）是一般词；arson 强调“故意放火”的犯罪行为。"]}
{"word":"arsonvalization","summary":{"en":"Arsonvalization is an electrotherapy method using high-frequency currents (d’Arsonval currents).","zh":"Arsonvalization（达松瓦电疗）是一种使用高频电流进行电疗/理疗的方法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical/physical-therapy treatment that uses high-frequency electric currents (d’Arsonval currents) applied to the body, historically used in electrotherapy and some skin/scalp treatments","zh":"一种使用高频电流（达松瓦电流）作用于人体的理疗/医疗方法；历史上用于电疗，也曾用于某些皮肤或头皮护理治疗"},"examples":[{"en":"The clinic advertised arsonvalization for scalp stimulation, though evidence of benefit is limited.","zh":"这家诊所宣传用“达松瓦电疗”来刺激头皮，但其疗效证据有限。"},{"en":"In early 20th-century electrotherapy, arsonvalization was used to deliver high-frequency currents without painful muscle contractions.","zh":"在20世纪初的电疗中，“达松瓦电疗”用来施加高频电流，同时避免引起疼痛的肌肉收缩。"}]}],"synonyms":["d'Arsonvalization","high-frequency electrotherapy","HF current therapy"],"phonetic":"/ˌɑr.sən.və.laɪˈzeɪ.ʃən/","extraExplanation":["“arsonvalization”源自法国生理学家 Jacques-Arsène d’Arsonval（达松瓦）。他研究的高频电流在当时被认为可能有理疗作用，因此出现了以其姓氏命名的治疗法。","这类疗法在历史上曾较流行，但在现代医学中，其适应证与疗效证据需要具体辨别；在不同国家/机构的使用范围与监管也可能不同。"]}
{"word":"arsphenamine","summary":{"en":"Arsphenamine is an old arsenic-based drug formerly used to treat syphilis (Salvarsan).","zh":"Arsphenamine 是一种含砷的旧式药物，过去用于治疗梅毒（撒尔佛散）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An early antibiotic drug used to treat syphilis, containing arsenic; also called Salvarsan.","zh":"一种早期用于治疗梅毒的抗感染药物，含砷；也称为“撒尔佛散（Salvarsan）”。"},"examples":[{"en":"Before penicillin, arsphenamine was one of the main treatments for syphilis.","zh":"在青霉素出现之前，arsphenamine 是治疗梅毒的主要药物之一。"},{"en":"Because it contained arsenic, arsphenamine had serious side effects and required careful dosing.","zh":"由于含砷，arsphenamine 可能带来严重副作用，需要谨慎控制剂量。"}]}],"synonyms":["Salvarsan","606"],"phonetic":"/ˌɑr.sfəˈnæ.min/","extraExplanation":["arsphenamine（常见商品名 Salvarsan）与后来改良的 neoarsphenamine（Neosalvarsan）有关，历史上常被称为“606”，因为它是保罗·埃尔利希（Paul Ehrlich）团队筛选出的第606个化合物。","它在20世纪初是“化学疗法（chemotherapy）/选择性毒性（selective toxicity）”理念的重要里程碑：目标是尽量杀死病原体而减少对人体的伤害。","虽然具有历史意义，但它毒性较强、使用复杂；随着青霉素等更安全有效的药物出现，现已基本被淘汰。"]}
{"word":"Arst","summary":{"en":"“Arst” is an archaic adverb meaning “formerly; once; in the past.”","zh":"“Arst”是古用副词，意思是“从前/曾经/以前”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(archaic) Formerly; in the past; once.","zh":"（古用）从前；以前；曾经。"},"examples":[{"en":"Arst I was young, but now I am old.","zh":"我从前很年轻，但现在老了。"},{"en":"He was arst a soldier, before he became a teacher.","zh":"他曾经是士兵，后来才当了老师。"},{"en":"In old poems, “arst” often means “once” or “formerly.”","zh":"在古诗里，“arst”常用来表示“曾经/从前”。"}]}],"synonyms":["formerly","once","in the past","previously"],"phonetic":"/ɑrst/","extraExplanation":["“arst”是非常古老的英语副词，现代英语里几乎不用；写作或阅读中更常见的对应词是 **formerly / once / in the past**。","常见于中古英语/早期现代英语的文学作品或仿古文风中；例如在一些古典诗歌与旧译本里会看到。"]}
{"word":"arsyl","summary":{"en":"“arsyl” isn’t a common English vocabulary word; it’s likely a name or a misspelling.","zh":"“arsyl”不是常见英语词汇，更可能是名字/专有名词或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a personal name, a brand/username, or a misspelling of another word.","zh":"不是标准英语单词。可能是人名、品牌/用户名，或是其他单词的拼写错误。"},"examples":[{"en":"My gamer tag is Arsyl.","zh":"我的游戏昵称是 Arsyl。"},{"en":"Did you mean “argyle” or “arsenal” instead of “arsyl”?","zh":"你想写的是“argyle（菱形格花纹）”或“arsenal（军火库/武器库）”，而不是“arsyl”吗？"}]}],"phonetic":"N/A","extraExplanation":["“arsyl”在常见英语词典里通常查不到，因此更像专有名词（名字/网名）或拼写误差。","如果你是在某个句子、文章、游戏、歌曲或产品名里看到它，把原句贴出来我可以帮你判断最可能的意思。","可能的接近词：\n- arson（纵火）\n- arsenal（军火库；一整套手段）\n- argyle（菱形格花纹，常见于毛衣/袜子）"]}
{"word":"arsylene","summary":{"en":"“Arsylene” is a rare chemistry term meaning a divalent arsenic fragment (–As:) used in advanced inorganic/organometallic contexts.","zh":"“Arsylene”是很少见的化学术语，指二价砷片段（–As:），多用于高等无机/有机金属化学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A divalent arsenic-containing group or reactive intermediate (written as “–As:”); the arsenic analogue of a nitrene/carbene-type fragment. It is a highly specialized term used mainly in academic chemistry.","zh":"（化学）一种二价含砷基团或反应性中间体（常写作“–As:”）；可理解为类似“氮烯/卡宾”那类片段的砷同系物。该词非常专业，主要见于学术化学语境。"},"examples":[{"en":"In some papers, an “arsylene” fragment is depicted as –As: bound to a metal center.","zh":"在一些论文中，“arsylene”片段会画成与金属中心配位的 –As: 。"},{"en":"Arsylene chemistry is discussed mostly in advanced inorganic and organometallic studies.","zh":"“arsylene”相关化学主要出现在高等无机与有机金属研究中。"}]}],"synonyms":["arsenylene","–As: fragment","arsenic(II) fragment"],"phonetic":"/ɑrˈsɪliːn/","extraExplanation":["这个词在一般英语里几乎不会用到，主要出现在无机/有机金属化学文献中，用来描述“二价砷片段（–As:）”这类高度反应性的概念。","有时你也会看到更常见的拼写是 arsenylene；如果你是在课本、论文或化学结构式里看到“arsylene”，很可能就是指这一类概念或其简写/变体。"]}
{"word":"arsyversy","summary":{"en":"Arsy-versy (also arsey-versey) means “upside down” or “all mixed up,” and it’s informal, mainly British.","zh":"Arsy-versy（也写作 arsey-versey）意思是“倒过来/上下颠倒”或“乱成一团”，偏口语，主要见于英式英语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal, chiefly British) Upside down; in a reversed or chaotic position.","zh":"（非正式，多见于英式英语）倒着的；颠倒的；乱成一团的（位置或状态）。"},"examples":[{"en":"The box got turned arsy-versy in the trunk, and everything spilled out.","zh":"箱子在后备箱里被颠得倒过来了，东西全撒出来了。"},{"en":"After the move, the whole apartment felt arsy-versy for a week.","zh":"搬家后，整个公寓乱七八糟了一周。"}]},{"partOfSpeech":"adv.","definition":{"en":"(informal) In a messy, disorganized, or mixed-up way.","zh":"（非正式）乱七八糟地；颠三倒四地。"},"examples":[{"en":"I packed in a rush, so my clothes are all arsy-versy in the suitcase.","zh":"我匆忙收拾的，所以衣服在行李箱里全乱套了。"}]}],"synonyms":["upside down","backwards","topsy-turvy","inside out","all mixed up"],"phonetic":"/ˌɑrzi ˈvɝzi/","extraExplanation":["你写的“arsyversy”更常见的拼写是 **arsey-versey / arsy-versy**，也有人写作 **arsey-versy**。其中 **arse** 是英式英语里较粗俗的“屁股”，所以这个词带一点口语、俚语色彩；在正式场合不建议使用。","意思通常是“上下颠倒”，也可引申为“乱套、混乱”。在美式英语里更常说 **upside down** 或 **all mixed up**。"]}
