{"word":"ARU","summary":{"en":"ARU is most commonly an acronym, often read as the letters A-R-U; one frequent meaning is the former name of Australia’s rugby union governing body (now Rugby Australia).","zh":"ARU 通常是按字母读的缩写；常见含义之一是澳大利亚橄榄球联盟的旧称（现多称 Rugby Australia）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Australian Rugby Union (former name of the national governing body for rugby union in Australia; today commonly called Rugby Australia).","zh":"澳大利亚橄榄球联盟（澳大利亚英式橄榄球的全国管理机构旧称；现多称 Rugby Australia）。"},"examples":[{"en":"ARU announced new safety rules for community rugby.","zh":"ARU 宣布了社区橄榄球的新安全规定。"},{"en":"He worked for the ARU before it rebranded as Rugby Australia.","zh":"在更名为 Rugby Australia 之前，他曾在 ARU 工作。"}]},{"partOfSpeech":"n.","definition":{"en":"Acronym used in different fields for different organizations or terms; meaning depends on context (often written as the letters A-R-U).","zh":"在不同领域可指不同机构或术语的缩写；具体含义取决于语境（常按字母 A-R-U 逐个读）。"},"examples":[{"en":"In this report, ARU refers to the hospital’s Acute Receiving Unit.","zh":"在这份报告中，ARU 指医院的急诊接收单元。"},{"en":"Could you clarify what ARU stands for in your email?","zh":"你能说明一下你邮件里的 ARU 具体指什么吗？"}]}],"synonyms":["Rugby Australia (for the sports organization)"],"phonetic":"/ˌeɪ ɑr ˈjuː/","extraExplanation":["“ARU”最常见的用法之一是指澳大利亚橄榄球的管理机构旧称；但在医疗、企业或政府系统里也可能代表不同部门（例如某些医院会用 ARU 表示接收/急诊相关单元）。看到缩写时，最好结合行业、国家和上下文确认全称。","如果你其实想查的是小写“aru”，它在日语里是动词“ある（aru）”，意思是“（无生命物）存在/有”；这与英文缩写 ARU 不是同一个词。"]}
{"word":"aru","summary":{"en":"Aru is a common Japanese verb meaning “to exist/be” (for things) or “to have.”","zh":"Aru（ある）是常见日语动词，表示“（事物）存在/在”或“拥有”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Japanese) to exist; to be (for things, places, events); “there is/are …”","zh":"（日语）存在；（用于事物、地点、事件）是/在；“有……”"},"examples":[{"en":"There is a book on the table. (Japanese: 本がテーブルの上にある。)","zh":"桌子上有一本书。（日语：本がテーブルの上にある。）"},{"en":"The station is near here. (Japanese: 駅はここにある。)","zh":"车站在这附近。（日语：駅はここにある。）"}]},{"partOfSpeech":"v.","definition":{"en":"(Japanese) to have; to possess (usually for non-living things or abstract things)","zh":"（日语）拥有；具有（多用于非生命体或抽象事物）"},"examples":[{"en":"This phone has a good camera. (Japanese: このスマホはいいカメラがある。)","zh":"这部手机有一个很好的摄像头。（日语：このスマホはいいカメラがある。）"},{"en":"I have time today. (Japanese: 今日は時間がある。)","zh":"我今天有时间。（日语：今日は時間がある。）"}]}],"synonyms":["exist","be located","have"],"phonetic":"/ˈɑːruː/","extraExplanation":["「ある（aru）」是日语里非常常用的动词，通常用于“无生命的东西/植物/抽象事物”的存在或拥有；而表示“人或动物的存在”一般用「いる（iru）」。","在日常对话中常见结构：\n- ～がある：有/存在（There is/are…）\n- ～は～にある：～在～（… is located in/on …）\n礼貌形：あります（arimasu）。"]}
{"word":"Aruabea","summary":{"en":"“Aruabea” isn’t a common English word; it’s likely a name or a misspelling (possibly “Aruba”).","zh":"“Aruabea”不是常见英语词；更可能是名字或拼写错误（可能是“Aruba/阿鲁巴”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a proper name (e.g., a username, brand, or fictional name) or a misspelling of another word (such as “Aruba”).","zh":"不是标准英语词汇。更可能是专有名词（如用户名、品牌名、虚构名称），或是其他词的拼写错误（例如“Aruba/阿鲁巴”）。"},"examples":[{"en":"Aruabea is the name of the artist on the poster.","zh":"海报上写着艺术家的名字是 Aruabea。"},{"en":"I couldn’t find “Aruabea” in the dictionary—do you mean “Aruba”?","zh":"我在词典里找不到 “Aruabea”——你是不是想写 “Aruba/阿鲁巴”？"}]}],"phonetic":"/ˌær.uˈbeɪ.ə/","extraExplanation":["“Aruabea”在常见英语词典里通常查不到。如果你能提供一点上下文（例如：出自哪本书/哪段句子、是人名还是地名、你想表达的中文意思），我可以更准确判断它可能对应的词。","如果你想写的是“Aruba”，它是加勒比海的一个岛（荷兰王国构成国之一），英文常见拼写为 Aruba。"]}
{"word":"Aruac","summary":{"en":"Aruac is a variant spelling of Arawak: an Indigenous people and their languages in the Caribbean and northern South America; it can also mean “related to” them.","zh":"Aruac 常为 Arawak 的异拼：指加勒比与南美北部的原住民族群及其语言；也可作形容词表示“与其相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an Indigenous people of the Caribbean and parts of northern South America (often called the Arawak)","zh":"阿鲁阿克人／阿拉瓦克人：加勒比地区及南美洲北部的原住民族群成员（英语中常写作 Arawak）"},"examples":[{"en":"The Aruac (Arawak) peoples lived on several Caribbean islands before European colonization.","zh":"在欧洲殖民之前，阿鲁阿克（阿拉瓦克）人曾生活在多座加勒比海岛屿上。"},{"en":"Some museums describe pottery styles linked to Aruac communities.","zh":"一些博物馆会介绍与阿鲁阿克社群相关的陶器风格。"}]},{"partOfSpeech":"n.","definition":{"en":"the Indigenous languages of the Arawakan (Aruac) family, formerly spoken widely in the Caribbean and still spoken in parts of South America","zh":"阿鲁阿克语（语族）：阿拉瓦克语系的语言（曾在加勒比广泛使用，现仍在南美部分地区使用）"},"examples":[{"en":"Linguists compare Aruac languages to trace migration patterns in the region.","zh":"语言学家会比较阿鲁阿克语族的语言，以追踪该地区的人群迁徙。"},{"en":"A few communities continue to teach Aruac words to younger generations.","zh":"一些社群仍在把阿鲁阿克语词汇教给年轻一代。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Arawak/Arawakan peoples or their languages","zh":"阿鲁阿克的／阿拉瓦克的：与该族群或其语言有关的"},"examples":[{"en":"The exhibition includes Aruac artifacts and oral-history recordings.","zh":"该展览包含阿鲁阿克文物和口述历史录音。"}]}],"synonyms":["Arawak","Arawakan"],"phonetic":"/ˈærəwɑːk/","extraExplanation":["“Aruac”常见为“Arawak”的另一种拼写。英语资料里也会用“Arawakan”指更广泛的“阿拉瓦克语系”。","历史上，加勒比地区（如大安的列斯群岛）与南美北部一些地区都与阿拉瓦克语系族群有关；许多语言在殖民时期后衰落，但南美部分地区仍有使用与复振（revitalization）的努力。"]}
{"word":"aruac","summary":{"en":"“Aruac” is an uncommon/older spelling of “Arawak,” referring to the Arawak people or their languages.","zh":"“Aruac”是“Arawak（阿拉瓦克）”较少见/较旧的拼写，指阿拉瓦克人或其语言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a variant spelling of “Arawak,” referring to an Indigenous people of the Caribbean and northern South America, or to their languages","zh":"“Arawak（阿拉瓦克）”的另一种拼写，指加勒比地区与南美北部的阿拉瓦克原住民，或指其语言（阿拉瓦克语族/语言）"},"examples":[{"en":"Some historians use “Aruac” as an older spelling of “Arawak.”","zh":"一些历史学者会用“Aruac”作为“Arawak”的旧式拼写。"},{"en":"Aruac languages influenced place names in parts of the Caribbean.","zh":"阿拉瓦克语（Aruac/Arawak）影响了加勒比一些地区的地名。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Arawak people or their languages","zh":"与阿拉瓦克人或其语言有关的"},"examples":[{"en":"The museum has an Aruac exhibit about early Caribbean cultures.","zh":"博物馆有一个关于早期加勒比文化的阿拉瓦克（Aruac）主题展。"}]}],"synonyms":["Arawak"],"phonetic":"/ˈærəˌwɑk/","extraExplanation":["“Aruac”在现代英语里不如“Arawak”常见，很多当代资料会优先使用“Arawak”。在学术写作中，使用哪一种拼写常与具体来源、时代或出版习惯有关。","“Arawak”有时既指一个民族，也指一组相关语言（阿拉瓦克语族的一部分）。阅读时可根据上下文判断是“人群/文化”还是“语言”。"]}
{"word":"Aruba","summary":{"en":"Aruba is a Caribbean island and a self-governing country within the Kingdom of the Netherlands.","zh":"Aruba 指加勒比海的阿鲁巴岛，也是荷兰王国的一个自治构成国。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an island in the southern Caribbean Sea, known for its beaches; a constituent country within the Kingdom of the Netherlands (its capital is Oranjestad).","zh":"阿鲁巴岛（位于加勒比海南部，以海滩闻名；为荷兰王国的构成国之一，首都是奥拉涅斯塔德）。"},"examples":[{"en":"We spent a week in Aruba during winter break.","zh":"寒假我们在阿鲁巴待了一周。"},{"en":"Aruba is part of the Kingdom of the Netherlands, but it governs itself in many areas.","zh":"阿鲁巴属于荷兰王国的一部分，但在许多事务上实行自治。"}]}],"phonetic":"/əˈruːbə/","extraExplanation":["发音重音在第二个音节：A-RU-ba。","语言与文化：当地常用荷兰语（Dutch）与帕皮阿门托语（Papiamento），英语也很普及，旅游业发达。","相关词：Aruban（阿鲁巴的；阿鲁巴人）。","地理小知识：阿鲁巴靠近委内瑞拉海岸，属于“ABC群岛”（Aruba, Bonaire, Curaçao）。"]}
{"word":"arugola","summary":{"en":"Arugula is a peppery leafy green often used in salads (also called “rocket”).","zh":"Arugula 指带胡椒辛辣味的绿叶蔬菜（芝麻菜），常用于沙拉；也叫 rocket。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a leafy green vegetable with a peppery (slightly spicy) taste, often eaten in salads; also called “rocket” (especially in the UK)","zh":"一种带胡椒般辛辣味的绿叶蔬菜，常用于沙拉；英式英语常称为 rocket（芝麻菜）"},"examples":[{"en":"I like arugula with olive oil, lemon juice, and salt.","zh":"我喜欢用橄榄油、柠檬汁和盐拌芝麻菜。"},{"en":"This pizza is topped with fresh arugula after it comes out of the oven.","zh":"这张披萨出炉后会再铺上新鲜的芝麻菜。"},{"en":"Can you add arugula to the sandwich instead of lettuce?","zh":"你能把生菜换成芝麻菜加到三明治里吗？"}]}],"synonyms":["rocket","rucola"],"phonetic":"/əˈruːɡjələ/","extraExplanation":["你输入的拼写是 arugola，更常见/标准拼写是 **arugula**；在英式英语里常叫 **rocket**。","arugula 的味道常被形容为 peppery（带胡椒感的辛辣），嫩叶更温和，老叶味道更冲。"]}
{"word":"arugolas","summary":{"en":"“Arugolas” means multiple arugula leaves/greens, a peppery salad green.","zh":"“Arugolas”指多份/多把芝麻菜（一种带辛香味的沙拉绿叶菜）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of arugola/arugula: a peppery leafy green often used in salads (also called rocket).","zh":"arugola/arugula 的复数：一种带胡椒辛香味的绿叶菜，常用于沙拉（也叫 rocket）。"},"examples":[{"en":"The salad comes with arugolas, cherry tomatoes, and parmesan.","zh":"这份沙拉里有芝麻菜、樱桃番茄和帕玛森奶酪。"},{"en":"She tossed the arugolas with olive oil and lemon juice.","zh":"她把芝麻菜拌上橄榄油和柠檬汁。"}]}],"synonyms":["arugula","rocket","rucola","ruccola"],"phonetic":"əˈruːɡələ","extraExplanation":["“Arugola(s)”在英语里不如“arugula”常见，多数情况下写作 arugula（美式）或 rocket（英式）。","词源与意大利语有关：常见拼写还有 rucola / ruccola（菜单或进口食材中更常见）。"]}
{"word":"arugula","summary":{"en":"Arugula is a peppery leafy green often used in salads and as a fresh topping.","zh":"Arugula（芝麻菜/火箭菜）是一种带辛辣胡椒味的绿叶蔬菜，常用于沙拉或作为新鲜配料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A leafy green vegetable with a peppery, slightly bitter taste, often used in salads and as a topping.","zh":"一种绿叶蔬菜，味道带胡椒般的辛辣和微苦，常用于沙拉或作为配料。"},"examples":[{"en":"I like arugula in my salad because it adds a peppery flavor.","zh":"我喜欢在沙拉里放芝麻菜，因为它能增加一种胡椒般的辛辣味。"},{"en":"The pizza comes topped with fresh arugula after it’s baked.","zh":"这款披萨出炉后会再铺上新鲜的芝麻菜。"}]}],"synonyms":["rocket","rocket salad"],"phonetic":"/əˈruːɡjələ/","extraExplanation":["“Arugula”在美式英语里很常见；英式英语中常用“rocket”（或“rocket salad”）来指同一种菜。","它常见于地中海饮食（如意大利料理），经常与橄榄油、柠檬汁、帕玛森奶酪等搭配；味道更浓时可与较甜或较油脂的食物平衡口感。"]}
{"word":"arugulas","summary":{"en":"“Arugulas” means more than one bunch/serving of arugula, a peppery salad green.","zh":"“arugulas”指多份/多把芝麻菜（arugula），一种带胡椒辛辣味的沙拉绿叶菜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of arugula: a peppery green leafy vegetable often used in salads and sandwiches.","zh":"arugula 的复数：一种带胡椒辛辣味的绿叶蔬菜，常用于沙拉、三明治等。"},"examples":[{"en":"The salad has arugulas, cherry tomatoes, and feta cheese.","zh":"这份沙拉里有芝麻菜、樱桃番茄和菲达奶酪。"},{"en":"She added arugulas to the sandwich for a fresh, spicy bite.","zh":"她在三明治里加了芝麻菜，吃起来更清新、带点辛辣。"}]}],"synonyms":["arugula","rocket (BrE)","roquette"],"phonetic":"/əˈruːɡjələ/","extraExplanation":["“arugulas”在日常英语里不算最常见；很多时候即使是复数，人们也会把“arugula”当作不可数名词来用（例如：Some arugula）。","“arugula”在英式英语中也常被称为“rocket”（或“roquette”），菜单上看到这两个词通常指同一种菜。"]}
{"word":"arui","summary":{"en":"“arui” isn’t a common English word; it’s likely a name/romanization/acronym or a misspelling.","zh":"“arui”不是常见英文词，可能是人名/外语拼写/缩写，或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. “arui” is most often seen as a romanized spelling of a word or name from another language (for example, Japanese), or as a username/brand name.","zh":"不是标准英语单词。“arui”更常见为其他语言（例如日语）的罗马字拼写，或作为用户名/品牌名等专有名称。"},"examples":[{"en":"I couldn’t find “arui” in an English dictionary—what language is it from?","zh":"我在英语词典里找不到“arui”——它来自哪种语言？"},{"en":"Is “arui” a name, a brand, or a misspelling of another English word?","zh":"“arui”是人名、品牌名，还是某个英文单词的拼写错误？"}]}],"phonetic":"/ɑːˈruːi/","extraExplanation":["如果你是想查日语罗马字，“arui”可能与「あるいは」（aruiwa，意为“或者/还是”）有关，但通常会写成 aruiwa 而不是 arui。","也有可能是你想输入的英语单词拼错了（例如 Are we / argue / auri- 等）。你可以告诉我：它出现在哪个句子里、你想表达什么意思、或是否是人名/地名，我可以更准确地帮你查。"]}
{"word":"aruke","summary":{"en":"“Aruke” is a Japanese command meaning “Walk!” / “Keep walking!”","zh":"“aruke”是日语里的命令句，意思是“走！”“继续走！”"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(From Japanese) a command meaning “Walk!” or “Keep walking!”—the imperative form of 歩く (aruku, “to walk”).","zh":"（源自日语）“走！”“继续走！”——动词 歩く（aruku，“走路”）的命令形。"},"examples":[{"en":"In the game, the coach shouts, “Aruke!” to push the player forward.","zh":"在游戏里，教练喊“Aruke!”来催促玩家往前走。"},{"en":"He wrote “ARUKE” on the sign as a dramatic way to say, “Keep going.”","zh":"他在牌子上写“ARUKE”，用一种很戏剧化的方式表达“继续走下去”。"}]}],"synonyms":["walk!","keep going","aruku (歩く)","aruite (歩いて)","aruite kudasai (歩いてください)"],"phonetic":"/ɑˈruːkeɪ/","extraExplanation":["“aruke（歩け）”是日语动词“aruku（歩く，走路）”的命令形，语气通常比较直接、强硬，常见于口号、训练、动漫/游戏台词等场景。对不熟的人直接说可能显得不礼貌；更礼貌的说法常用“aruite kudasai（歩いてください，请走/请步行）”。","如果你是在英语语境中看到“aruke”，它多半是借用日语来制造“热血/鼓励/命令式”的氛围，而不是标准英语单词。"]}
{"word":"Arulo","summary":{"en":"“Arulo” is most likely a rare name, not a common English word.","zh":"“Arulo”多半是少见的人名，并非常见英语单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare personal name (given name or surname). It is not a standard English vocabulary word and is usually used as a proper noun (a name).","zh":"一个较少见的人名（名字或姓氏）。它不是标准英语词汇，通常作为专有名词（姓名）使用。"},"examples":[{"en":"Arulo moved to Chicago last year.","zh":"Arulo 去年搬到芝加哥了。"},{"en":"I met someone named Arulo at the conference.","zh":"我在会议上认识了一个叫 Arulo 的人。"}]}],"phonetic":"əˈruːloʊ","extraExplanation":["“Arulo”在常见英语词典里通常查不到；如果你是在文章、游戏、品牌、地名或人名里看到它，很可能是专名或自创词。","如果你本来想查的是相近拼写的词，常见的可能是：Arlo（人名）、arugula（芝麻菜/火箭菜）、Aru（人名/地名片段）。你可以告诉我你看到它的句子或语境，我能更准确判断。"]}
{"word":"arulo","summary":{"en":"“Arulo” isn’t a common English word; it’s likely a name or a misspelling.","zh":"“arulo”不是常见英文词，更可能是名字或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as a name (proper noun) or a misspelling/typo of another word.","zh":"不是标准英语单词；更常见为人名/专有名词，或是其他单词的拼写错误。"},"examples":[{"en":"I couldn’t find “arulo” in an English dictionary—did you mean a different word?","zh":"我在英语词典里找不到“arulo”——你是不是想写另一个词？"},{"en":"Arulo is used as a username or a person’s name in some contexts.","zh":"在一些语境里，Arulo 会被用作用户名或人名。"}]}],"phonetic":"əˈruːloʊ","extraExplanation":["“arulo”看起来不像常见英文词汇。你可以告诉我它出现在哪句话里吗？有了上下文我能更准确判断你想查的词。","如果你是在输入时手滑，可能想写的是：around（周围/大约）、a rule（一个规则）、or “Rolo”（糖果名/人名）等。把原句发我我来帮你确认。"]}
{"word":"Arum","summary":{"en":"An arum is a plant in the arum family (Araceae), usually with a spadix of flowers and a spathe (hood).","zh":"Arum 指天南星科的一类植物，常见“肉穗花序+佛焰苞（像兜帽）”的结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant in the arum family (Araceae), often with a thick spike of tiny flowers (spadix) surrounded by a leaf-like hood (spathe); some kinds are grown as ornamentals","zh":"天南星属/天南星科植物（Araceae），常见特征是“肉穗花序（spadix）”外包一片佛焰苞（spathe）；部分种类作为观赏植物栽培"},"examples":[{"en":"The arum in the garden has a tall spadix and a green hood-like spathe.","zh":"花园里的天南星长着高高的肉穗花序，外面包着绿色、像兜帽一样的佛焰苞。"},{"en":"Some arum species produce bright berries, but they can be poisonous.","zh":"有些天南星会结出鲜艳的浆果，但可能有毒。"}]}],"synonyms":["arum lily","cuckoo-pint","lords-and-ladies","jack-in-the-pulpit"],"phonetic":"/ˈerəm/","extraExplanation":["“Arum”源自拉丁语 arum/aron，和古希腊语有关，常用来指一类具有典型“佛焰苞+肉穗花序”结构的植物。日常英语里它有时泛指天南星科植物，但在园艺或植物学语境中也可能更严格地指“天南星属（Arum）”。","很多天南星科植物含草酸钙针晶，误食可能刺激口腔和喉咙；如果在自然环境看到不熟悉的浆果或块茎，最好不要采食。"]}
{"word":"arum","summary":{"en":"Arum is a type of plant (genus *Arum*) known for its spathe-and-spadix flower structure.","zh":"Arum 指天南星属植物，以佛焰苞和肉穗花序构成的花序结构而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant in the genus *Arum* (family Araceae), typically with arrow-shaped leaves and a flower structure made of a spadix surrounded by a spathe","zh":"天南星属（*Arum*）植物（天南星科），常见特征为箭形叶，以及由“肉穗花序（spadix）+佛焰苞（spathe）”构成的特殊花序结构"},"examples":[{"en":"The arum grows well in shady woodland gardens.","zh":"天南星属植物很适合在阴凉的林地花园里生长。"},{"en":"An arum flower has a spathe that wraps around a central spadix.","zh":"天南星属植物的花有佛焰苞包裹着中间的肉穗花序。"}]}],"synonyms":["cuckoo-pint","lords-and-ladies","arum family plant"],"phonetic":"/ˈerəm/","extraExplanation":["英式英语里常见的“cuckoo-pint(s)”通常指 *Arum maculatum*（斑点天南星）。很多天南星科植物的汁液可能刺激皮肤或有毒，野外不要随意触摸或食用。","“arum lily”在日常用法里有时也被用来指马蹄莲（calla lily，属 *Zantedeschia*），但严格来说它不属于 *Arum* 属；这是常见的俗名混用。"]}
{"word":"arumin","summary":{"en":"“Arumin” is commonly used online as a Japanese-style spelling of the name Armin, often referring to the Attack on Titan character.","zh":"“Arumin” 常见于网络上，作为名字 Armin 的日式拼写，常指《进击的巨人》角色阿尔敏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper name) A male given name, most commonly spelled Armin.","zh":"（专有名词）男性名字，最常见拼写为 Armin。"},"examples":[{"en":"Armin is my classmate.","zh":"Armin 是我的同学。"},{"en":"Do you know anyone named Armin?","zh":"你认识叫 Armin 的人吗？"}]},{"partOfSpeech":"n.","definition":{"en":"(Pop-culture/Japanese romanization) “Arumin” is a common Japanese-style spelling (ローマ字) used online for the name Armin, especially referring to the character Armin Arlert from the anime/manga Attack on Titan.","zh":"（流行文化/日式罗马字）“Arumin” 常见于网络上的日式拼写（罗马字），用来表示 Armin 这个名字，尤其常指《进击的巨人》中的角色阿尔敏·阿诺德（Armin Arlert）。"},"examples":[{"en":"Fans often write “Arumin” when talking about Armin from Attack on Titan.","zh":"粉丝讨论《进击的巨人》的阿尔敏时，常会写作 “Arumin”。"},{"en":"I saw “Arumin” trending on social media.","zh":"我看到社交媒体上 “Arumin” 上了热搜。"}]}],"synonyms":["Armin"],"phonetic":"/ˈɑr.mɪn/","extraExplanation":["“Arumin” 本身不是最标准的英文拼写，更常见的是 **Armin**。之所以会出现 “Arumin”，通常是因为日语里为了把外来名字发音得更顺口，会加上元音来拼写（例如把 Armin 近似写成 アルミン arumin）。","如果你本来想查的是金属“铝”，英文是 **aluminum**（美式）/ **aluminium**（英式）。你可以告诉我你想要哪一个，我可以再给对应词条。"]}
{"word":"arumlike","summary":{"en":"Arumlike means “resembling an arum plant,” mainly used in botany/gardening descriptions.","zh":"Arumlike 指“像天南星属植物一样的”，主要用于植物学或园艺描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Resembling an arum plant (a plant in the arum family, Araceae), especially in shape or structure—often referring to leaves or flowers/spathes.","zh":"（植物学）像天南星属植物（Arum，天南星科 Araceae）一样的；尤指形状或结构相似，常用来形容叶子或花（佛焰苞/肉穗花序）的外形。"},"examples":[{"en":"The garden has an arumlike plant with a tall spadix and a hooded spathe.","zh":"花园里有一株天南星状的植物，有高高的肉穗花序和兜状的佛焰苞。"},{"en":"In the shade, its arumlike leaves stay glossy and broad.","zh":"在阴处，它那天南星状的叶子依旧油亮而宽大。"}]}],"synonyms":["arum-like","aroid","Araceae-like"],"phonetic":"/ˈerəmˌlaɪk/","extraExplanation":["“arum”在英语里指天南星属（Arum）的植物；“-like”表示“像……一样”。因此 arumlike 多见于植物百科、园艺说明或自然观察类文字，用来概括“天南星科常见的外观特征”（如大叶、佛焰苞 spathe、肉穗花序 spadix）。"]}
{"word":"arums","summary":{"en":"“Arums” means plants in the arum family, especially the genus Arum.","zh":"“arums”是“arum”的复数，指天南星科植物，尤指天南星属（Arum）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant of the arum family (Araceae), especially one in the genus Arum, often having a central spike of tiny flowers surrounded by a leaf-like hood (spathe)","zh":"天南星科植物（Araceae），尤指天南星属（Arum）的植物，常见特征是中间有花序肉穗（spadix），外面包着一片佛焰苞（spathe）"},"examples":[{"en":"Arums often grow in damp, shady woodland areas.","zh":"天南星类植物常生长在潮湿、阴凉的林地里。"},{"en":"The garden guide warned that some arums can irritate the skin if handled.","zh":"园艺指南提醒：有些天南星科植物接触皮肤可能会引起刺激。"}]}],"synonyms":["aroid","arum plant"],"phonetic":"/ˈerəm/","extraExplanation":["“arums”是“arum”的复数。这个词在日常英语里不算常见，更多出现在园艺、植物学或自然写作中。","天南星科许多植物含有草酸钙针晶，误食或接触可能造成口腔灼痛或皮肤刺激；如果在野外或家中种植，注意安全与辨识。","在部分地区口语里，人们有时会把某些外形相似的观赏植物（如“arum lily”）也叫作“arum”，但严格植物分类上未必同属。"]}
{"word":"Arun","summary":{"en":"Arun is usually a male given name (often South Asian) and can also refer to a river, especially the Arun River in Nepal.","zh":"Arun 通常是男性名字（多见于南亚），也可指河流名称，尤其是尼泊尔的阿润河（Arun River）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a masculine given name, common in India and among South Asian communities.","zh":"（人名）阿伦：常见于印度及南亚社群的男性名字。"},"examples":[{"en":"Arun is my classmate, and he’s from Chennai.","zh":"Arun 是我的同学，他来自金奈。"},{"en":"Please ask Arun to email the report by Friday.","zh":"请让 Arun 在周五前把报告发邮件过来。"}]},{"partOfSpeech":"n.","definition":{"en":"the name of a river, especially the Arun River in Nepal (a major tributary of the Koshi River).","zh":"（地名）阿润河：常指尼泊尔的 Arun River（科西河的重要支流）。"},"examples":[{"en":"They trekked in eastern Nepal near the Arun River valley.","zh":"他们在尼泊尔东部的阿润河河谷附近徒步旅行。"}]}],"synonyms":["(no direct synonyms; it is a proper name)"],"phonetic":"/əˈruːn/","extraExplanation":["“Arun”在英语里通常作为专有名词使用（人名或地名），写作首字母大写。","名字来源上，Arun 常被认为与梵语词根“aruna/aruṇá”（意为“黎明、朝霞、微红”）有关，因此带有“晨光、曙光”的文化联想。","在日常交流中，如果不确定读音，可以礼貌地问：“How do you pronounce your name?”（你的名字怎么读？）"]}
{"word":"Aruncus","summary":{"en":"Aruncus is a plant genus (goat’s beard) known for tall, feathery white flower plumes.","zh":"Aruncus 指落新妇属（常称“山羊胡子花”），以高大、羽毛状白色花序闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of perennial flowering plants in the rose family, known for tall stems and feathery white flower plumes; often called “goat’s beard.”","zh":"落新妇属（蔷薇科）的多年生开花植物属，以高花茎和羽毛状白色花序著称；常被称为“山羊胡子花”。"},"examples":[{"en":"Aruncus grows well in moist, partly shaded gardens.","zh":"落新妇属植物适合在湿润、半阴的花园里生长。"},{"en":"The gardener planted Aruncus for its airy white plumes in early summer.","zh":"园丁种了落新妇属植物，欣赏它初夏时轻盈的白色羽状花序。"}]}],"synonyms":["goat’s beard","goatsbeard","bride’s feathers"],"phonetic":"/əˈrʌŋkəs/","extraExplanation":["“Aruncus”是植物学上的拉丁学名，在园艺语境里常特指常见种Aruncus dioicus（英语俗名goat’s beard）。","在英文中它通常作为专有名词使用（首字母大写），但在非正式写作中也可能出现小写aruncus。","不要与“astilbe（落新妇属 Astilbe）”混淆：两者花序外观相似、都适合半阴湿润环境，但属于不同属。"]}
{"word":"aruncus","summary":{"en":"Aruncus is a genus of ornamental perennial plants with feathery white flowers, commonly called goat’s beard.","zh":"Aruncus 指一种观赏多年生植物属，以白色羽状花序著称，常被称为“山羊胡”（goat’s beard）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of perennial flowering plants in the rose family (Rosaceae), often grown in gardens for their tall, feathery white flower plumes; commonly called goat’s beard","zh":"一种蔷薇科的多年生开花植物属（Aruncus），常作观赏植物栽培，以高大、羽毛状的白色花序著称；俗称“山羊胡”（goat’s beard）"},"examples":[{"en":"Aruncus is a good choice for a shady garden bed because it can handle less sun.","zh":"Aruncus 很适合种在半阴的花坛里，因为它能适应较少的阳光。"},{"en":"The aruncus blooms in early summer with tall, creamy-white plumes.","zh":"Aruncus 通常在初夏开花，长出高高的乳白色羽状花序。"}]}],"synonyms":["goat’s beard","bride’s feathers (for some species)"],"phonetic":"əˈrʌŋkəs","extraExplanation":["Aruncus 是植物学里的“属名”，日常英语里更常听到俗名 goat’s beard（山羊胡），指它那种像胡须一样的羽状花序。","词源来自拉丁语，aruncus 有“野草/草本植物”的意思；作为植物属名时通常不翻译，但在园艺语境中可用“山羊胡（花）”来帮助记忆。","在园艺店或植物标签上，你可能会看到 Aruncus dioicus（常见栽培种），有时也被称作 “bride’s feathers（新娘羽毛）”。"]}
{"word":"arund","summary":{"en":"Around means surrounding, nearby/in different places, or approximately; it can also mean about a topic.","zh":"Around 可表示“在……周围/四周”“在附近各处”“大约”，也可表示“关于（某个话题）”。"},"definitions":[{"partOfSpeech":"prep.","definition":{"en":"in a circle surrounding someone or something; on every side of","zh":"围绕；在……周围；在四周"},"examples":[{"en":"There are trees all around the house.","zh":"房子四周都是树。"},{"en":"We sat around the table and talked.","zh":"我们围着桌子坐着聊天。"}]},{"partOfSpeech":"adv.","definition":{"en":"in different places nearby; here and there (not in one specific place)","zh":"在附近各处；到处（不在某一个固定地点）"},"examples":[{"en":"Is anyone around to help?","zh":"附近有人能帮忙吗？"},{"en":"I looked around for my keys.","zh":"我四处找我的钥匙。"}]},{"partOfSpeech":"adv.","definition":{"en":"approximately; about (used with numbers or time)","zh":"大约；左右（用于数字或时间）"},"examples":[{"en":"It costs around $20.","zh":"它大约20美元。"},{"en":"I’ll be there around 6 p.m.","zh":"我大约晚上6点到。"}]},{"partOfSpeech":"prep.","definition":{"en":"about a topic; concerning","zh":"关于；就……而言"},"examples":[{"en":"Let’s talk around the main idea first.","zh":"我们先围绕主要想法谈。"},{"en":"There’s been a lot of discussion around this issue.","zh":"关于这个问题有很多讨论。"}]}],"synonyms":["about","approximately","nearby","surrounding"],"phonetic":"/əˈraʊnd/","extraExplanation":["你输入的“arund”通常是“around”的拼写错误。正确拼写是 around。"]}
{"word":"Arundel","summary":{"en":"Arundel is mainly a place name in England (West Sussex), and it can also appear in British noble titles like “Earl of Arundel.”","zh":"Arundel 主要是英国（西萨塞克斯）的地名“阿伦德尔”，也可见于英国贵族头衔用语，如“阿伦德尔伯爵”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a town in West Sussex, England, known for Arundel Castle and its cathedral; also used as a place name in addresses and travel contexts","zh":"（专有名词）英国英格兰西萨塞克斯郡的城镇“阿伦德尔”，以阿伦德尔城堡和大教堂闻名；也常作为地名出现在地址、旅行与地理语境中"},"examples":[{"en":"We visited Arundel to see the castle and walk by the River Arun.","zh":"我们去了阿伦德尔，参观城堡并沿着阿伦河散步。"},{"en":"The train stops near Arundel, making it an easy day trip from London.","zh":"火车在阿伦德尔附近停靠，所以从伦敦当天往返很方便。"}]},{"partOfSpeech":"n.","definition":{"en":"a British title name connected with the area, especially in the phrase “Earl of Arundel” (a noble title in the UK)","zh":"与该地区相关的英国贵族头衔用名，尤见于短语“Earl of Arundel（阿伦德尔伯爵）”"},"examples":[{"en":"The museum label mentioned the Earl of Arundel as a historical patron.","zh":"博物馆的说明牌提到阿伦德尔伯爵是一位历史上的赞助人。"},{"en":"In older texts, Arundel can appear as part of a noble family name or title.","zh":"在较早的文本里，Arundel 可能作为贵族家族名或头衔的一部分出现。"}]}],"synonyms":["(place)","(proper noun)"],"phonetic":"/əˈrʌndəl/","extraExplanation":["Arundel 的读音重音在第二音节（ə-RUN-dəl）。作为地名时，通常不需要加冠词（不说 *the Arundel*），但如果指“阿伦德尔城堡”等具体景点，会说 *Arundel Castle*。","它与当地的 Arun 河有联系，因此在旅行介绍中常与 *River Arun*、*castle*、*cathedral* 等词一起出现。"]}
{"word":"Arundell","summary":{"en":"Arundell is most commonly a surname, sometimes used in names of places or institutions, especially in British contexts.","zh":"Arundell 最常见的是姓氏；也可能用于地名或机构名，尤其在英国相关语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A family name (surname), mainly found in English-speaking countries; a spelling variant related to the name “Arundel.”","zh":"一个姓氏（家族名），主要见于英语国家；常被视为与“Arundel”相关的拼写变体。"},"examples":[{"en":"Ms. Arundell will lead the meeting today.","zh":"Arundell 女士今天将主持会议。"},{"en":"I saw the name Arundell on the list of authors.","zh":"我在作者名单上看到了 Arundell 这个名字。"}]},{"partOfSpeech":"n.","definition":{"en":"A proper name used for places, institutions, or titles (often connected to British history or geography), depending on context.","zh":"一个专有名称，可用于地名、机构名或头衔等（常与英国历史或地理相关），具体含义取决于语境。"},"examples":[{"en":"He studied at a school named Arundell.","zh":"他在一所名为 Arundell 的学校学习。"},{"en":"The Arundell collection was displayed in the museum.","zh":"Arundell 馆藏在博物馆展出。"}]}],"synonyms":["Arundel (variant spelling)"],"phonetic":"əˈrʌndəl","extraExplanation":["“Arundell”多见于英国相关语境，常与“Arundel/Arundell”这一历史姓氏的不同拼写有关。若你是在小说、历史或地名中看到它，通常需要结合上下文判断是人名、家族名还是机构/地点名称。","在阿加莎·克里斯蒂（Agatha Christie）的侦探小说《The Pale Horse》中有角色名为“Miss Arundell”（Arundell 小姐），因此这个拼写也常出现在文学作品的人物名中。"]}
{"word":"arundiferous","summary":{"en":"Arundiferous means “bearing reeds; full of reeds,” used mainly in rare botanical or descriptive writing.","zh":"arundiferous 指“长有芦苇、芦苇丛生的”，多见于较罕见的植物学或描写性文字。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany, rare) Bearing reeds or reed-like plants; having reeds growing in it.","zh":"（植物学，罕见）长有芦苇（或类似芦苇的植物）的；生有芦苇的。"},"examples":[{"en":"The marshy edge of the lake was described as arundiferous, thick with reeds.","zh":"湖边的沼泽地带被描述为“arundiferous”，芦苇丛生。"},{"en":"They surveyed the arundiferous wetlands to map bird nesting areas.","zh":"他们勘测了芦苇繁茂的湿地，以绘制鸟类筑巢区域。"}]}],"synonyms":["reedy","reed-covered","reed-filled","reed-fringed"],"phonetic":"/əˌrʌnˈdɪfərəs/","extraExplanation":["这个词非常少见，多出现在较古典或学术风格的自然史/植物学描写中。更常见的表达是“reed-filled / reed-covered / reedy”。","词源上可拆为 arundo（拉丁语：芦苇）+ -ferous（“携带/产生/具有……的”），类似词还有 coniferous（针叶树的/结松果的）、odoriferous（有香味的）。"]}
{"word":"arundinaceous","summary":{"en":"An adjective meaning “reedy” or “related to reeds,” used mostly in scientific or descriptive writing.","zh":"形容词，意为“芦苇般的/与芦苇有关的”，多用于科学或景物描写语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or resembling reeds (tall, grass-like wetland plants).","zh":"与芦苇有关的；像芦苇的（指高大、似草的湿地植物）。"},"examples":[{"en":"The arundinaceous plants along the riverbank provided shelter for birds.","zh":"河岸边那些芦苇状的植物为鸟类提供了庇护。"},{"en":"In the marsh, arundinaceous vegetation swayed in the wind.","zh":"在沼泽里，芦苇状的植被随风摇摆。"}]}],"synonyms":["reedy","reed-like"],"phonetic":"/əˌrʌn.dəˈneɪ.ʃəs/","extraExplanation":["词源来自拉丁语 arundo（“芦苇”）。这是一个偏学术/文学的形容词，常见于植物学、生态学或描写湿地景观的文字中。","常见搭配：arundinaceous plants/vegetation（芦苇状植物/植被）、arundinaceous reeds（芦苇类植物）。日常英语里更常直接说 reed-like（像芦苇的）或 reedy（芦苇般的）。"]}
{"word":"Arundinaria","summary":{"en":"Arundinaria is the scientific genus name for certain bamboo-like grasses, especially in North America.","zh":"Arundinaria 是某些竹类禾草的植物学属名，尤其与北美的“藤竹/河藤竹”等竹状植物相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of bamboo-like plants (in the grass family) found especially in North America; some species are called canes and form dense thickets","zh":"一种竹类植物的属名（禾本科），尤其分布于北美；部分种类常被称为“藤竹/芦竹状的竹”（cane），可形成茂密的丛生竹林"},"examples":[{"en":"Arundinaria can form thick stands along rivers and wetlands.","zh":"Arundinaria 常在河岸与湿地形成成片、茂密的群落。"},{"en":"River cane (an Arundinaria species) provides shelter for wildlife.","zh":"河藤竹（Arundinaria 的一种）能为野生动物提供栖息与遮蔽。"}]}],"synonyms":["cane bamboo","river cane (common name for some species)"],"phonetic":"/əˌrʌn.dɪˈnɛr.i.ə/","extraExplanation":["词源：源自拉丁语 arundo（“芦苇、芦杆”）相关的植物命名传统，常用于指外形像芦苇或竹子的禾本科植物。","文化与生态：北美原生的 cane（如常见的“river cane”）在一些地区曾广泛用于编织、制作工具与日常器物；同时它也是重要的栖地植物，能稳固河岸、为鸟类与小型动物提供遮蔽。"]}
{"word":"arundinaria","summary":{"en":"Arundinaria is a genus of bamboo, especially North American river cane.","zh":"Arundinaria 指一种竹类植物属，尤指北美的河甘蔗竹（river cane）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of bamboo (in the grass family), especially the North American native “river cane,” known for tall, hollow stems used for weaving and habitat.","zh":"一种竹类植物属（禾本科）；尤指北美原生的“河甘蔗竹/河竹（river cane）”，茎秆高而中空，常用于编织，也为野生动物提供栖息地。"},"examples":[{"en":"River cane (Arundinaria) forms dense stands along rivers in the southeastern United States.","zh":"在美国东南部，河甘蔗竹（Arundinaria）常沿河岸成片生长。"},{"en":"Some baskets were traditionally made from split Arundinaria stems.","zh":"一些篮子传统上会用劈开的河甘蔗竹茎来编织。"}]}],"synonyms":["river cane","cane bamboo","North American bamboo"],"phonetic":"/əˌrʌn.dɪˈnɛr.i.ə/","extraExplanation":["词源上来自拉丁语 arundo（“芦苇/芦杆”），因此这个属名常让人联想到“像芦苇一样的高大中空茎”。","在北美文化语境中，Arundinaria（尤其是 A. gigantea，常称 river cane）与美国东南部部分原住民的传统编织工艺密切相关；同时它也是许多鸟类与小型动物的重要栖息与觅食植物。"]}
{"word":"arundineous","summary":{"en":"Arundineous means “reedy” or “related to reeds,” often used in nature writing or scientific contexts.","zh":"arundineous 意为“像芦苇的”或“与芦苇有关的”，多用于自然描写或学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling reeds (tall, thin wetland grasses), especially in shape or appearance.","zh":"像芦苇的；呈芦苇状的（尤指形状或外观）。"},"examples":[{"en":"The arundineous plants along the riverbank swayed in the wind.","zh":"河岸边那些芦苇状的植物在风中摇摆。"},{"en":"In the painting, arundineous stems frame the quiet pond.","zh":"在这幅画里，芦苇状的茎秆勾勒出宁静的池塘。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to reeds or reed beds; growing among reeds.","zh":"与芦苇或芦苇丛有关的；生长在芦苇丛中的。"},"examples":[{"en":"The marsh has an arundineous habitat that shelters many birds.","zh":"这片沼泽有与芦苇丛相关的栖息地，庇护着许多鸟类。"},{"en":"They studied arundineous ecosystems in the wetlands.","zh":"他们研究湿地中的芦苇相关生态系统。"}]}],"synonyms":["reedy","reedlike","reed-like","rushy"],"phonetic":"/əˌrʌnˈdɪniəs/","extraExplanation":["“arundineous”较文学化、学术化，常见于植物学、生态学或描写自然景观的文字。日常英语更常用：reedy（像芦苇的）、reed-like（像芦苇的）、reed bed（芦苇荡）。","词源来自拉丁语 arundo（芦苇）。相关词：Arundel（地名，词源相近）、Arundo（芦苇属的拉丁学名）。"]}
{"word":"Arundo","summary":{"en":"Arundo: a genus of tall reeds, especially giant reed (Arundo donax).","zh":"Arundo：一种高大的芦苇属植物，尤指巨芦（Arundo donax）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tall reed plant (genus *Arundo*), especially *Arundo donax* (“giant reed”), often growing near rivers and wetlands and used for thatching, weaving, and making reeds for musical instruments","zh":"一种高大的芦苇类植物（*Arundo* 属），尤指 *Arundo donax*（“巨芦/大芦苇”），常生长在河边与湿地，可用于盖屋顶、编织，也可制作乐器用的簧片等"},"examples":[{"en":"Giant reed (Arundo) can form dense stands along riverbanks.","zh":"巨芦（Arundo）常会在河岸形成密集的植被带。"},{"en":"Some instrument reeds are traditionally made from Arundo donax.","zh":"有些乐器的簧片传统上会用巨芦（Arundo donax）制作。"}]}],"synonyms":["giant reed","reed","cane (context-dependent)"],"phonetic":"/əˈrʌndoʊ/","extraExplanation":["“Arundo”来自拉丁语，意为“芦苇/秆状草”。在古典文学里，拉丁语 *arundo* 也常被用来指可做成笛管或书写用芦苇笔的材料。","在生态语境中，*Arundo donax* 在一些地区被视为入侵植物，因为它生长快、易扩张，会挤压本地植物并影响河岸生态。"]}
{"word":"arundo","summary":{"en":"Arundo is a botanical term for a type of tall reed grass, especially giant reed (Arundo donax).","zh":"Arundo 是植物学用语，指芦竹属的高大芦苇状禾草，尤指巨芦（Arundo donax）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tall reed grasses (especially Arundo donax, “giant reed”), often growing near water and used for making reeds, fences, and other materials","zh":"芦竹属（高大的芦苇状禾草；尤指芦竹/巨芦 Arundo donax），常生于水边，可用于制作乐器簧片、篱笆等"},"examples":[{"en":"Giant reed (Arundo donax) can form dense stands along rivers.","zh":"巨芦（Arundo donax）会在河岸形成密集的植被带。"},{"en":"Some musical instrument reeds are traditionally made from arundo cane.","zh":"一些乐器的簧片传统上会用芦竹（arundo）制成。"}]}],"synonyms":["giant reed","reed","cane"],"phonetic":"əˈrʌndoʊ","extraExplanation":["“Arundo”源自拉丁语，意为“芦苇/芦杆”。在英语里它多用于植物学语境，日常更常说“(giant) reed”。","Arundo donax 在一些地区属于外来入侵植物，生长快、耗水量大，可能挤压本地物种；因此在生态与环境治理文章里也常见。"]}
{"word":"Aruns","summary":{"en":"“Aruns” is usually the plural of the proper noun “Arun” (people or places named Arun).","zh":"“Aruns”通常是专有名词“Arun”的复数形式（指多个叫 Arun 的人或同名地点/事物）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Plural of Arun: people named Arun (a male given name), or multiple places/things called Arun (such as rivers).","zh":"Arun 的复数：指多个名叫 Arun 的人（常见男性名），或多个名为 Arun 的地点/事物（如河流）。"},"examples":[{"en":"There are three Aruns in our class, so we use last names too.","zh":"我们班有三个叫 Arun 的人，所以也会用姓来区分。"},{"en":"The map shows several rivers named Arun in different regions.","zh":"地图上显示不同地区有几条都叫 Arun 的河。"}]},{"partOfSpeech":"other","definition":{"en":"(Rare) A misspelling of “runs” or a mistaken plural; in most contexts, “Aruns” is treated as a proper noun plural, not a common English word.","zh":"（较少见）可能是把 runs 拼错，或误以为需要加复数；多数语境中 Aruns 被当作专有名词复数，而不是普通英语词汇。"},"examples":[{"en":"If you meant the verb, write “runs,” not “Aruns.”","zh":"如果你想表达动词，应写 “runs”，不是 “Aruns”。"}]}],"synonyms":["(no direct synonyms; proper noun)"],"phonetic":"/əˈruːnz/","extraExplanation":["“Arun”常见于南亚（尤其印度）男性名字，常被解释为源自梵语，含义与“黎明/太阳”等意象有关（不同地区与词源解释会有差异）。","“Arun”也是一些地名/河流名：例如英国有 River Arun；在南亚也能见到名为 Arun 的河流或地区名。作为专有名词时，是否加 -s 取决于是否在说“多个名为 Arun 的人/事物”。"]}
{"word":"Arunta","summary":{"en":"Arunta refers to the Arrernte people of central Australia and sometimes to their language; modern spelling is often Arrernte.","zh":"Arunta 指澳大利亚中部的 Arrernte（阿伦塔）族群，也可指其语言；现代常用拼写为 Arrernte。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of Aboriginal Australian people from central Australia (especially around Alice Springs); also used for their language (often spelled Arrernte today)","zh":"澳大利亚中部的一个原住民族群（尤指爱丽丝泉一带）；也可指他们的语言（现代更常拼作 Arrernte）"},"examples":[{"en":"The Arunta (Arrernte) people have a long history in central Australia.","zh":"阿伦塔（现常写作 Arrernte）族在澳大利亚中部有悠久的历史。"},{"en":"Some older books use the spelling “Arunta,” while many current sources prefer “Arrernte.”","zh":"一些旧书使用拼写“Arunta”，而许多当代资料更常用“Arrernte”。"}]}],"synonyms":["Arrernte"],"phonetic":"/əˈrʌn.tə/","extraExplanation":["“Arunta”是早期英语文献中常见的转写形式；今天在学术与社区语境中，更尊重当地用法的拼写通常是“Arrernte”。如果你在写作或引用，建议查阅所指社群或权威来源采用的拼写。","该词涉及原住民身份与文化时，语境需要谨慎：尽量使用当事社群自称（如 Arrernte），并避免把族群名称当作泛称或刻板印象标签。"]}
{"word":"arunta","summary":{"en":"Arunta is an older term for the Arrernte (Aranda) people and/or their language in Central Australia.","zh":"Arunta 是 Arrernte（Aranda）人及其语言的旧称/旧拼写，主要见于澳大利亚中部相关文献。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an older spelling for the Arrernte (also spelled Aranda) people of Central Australia, especially around Alice Springs; it can also refer to their language.","zh":"“Arrernte（也拼作 Aranda）”的旧式拼写，指澳大利亚中部（以艾丽斯泉一带为主）的原住民群体；也可指其语言。"},"examples":[{"en":"Some early anthropology books used the name “Arunta” for the Arrernte people.","zh":"一些早期的人类学著作会用“Arunta”来称呼 Arrernte 人。"},{"en":"Today, many writers prefer “Arrernte” because it matches how the community names itself.","zh":"如今，许多作者更倾向使用“Arrernte”，因为更贴近该社群的自称。"}]}],"synonyms":["Arrernte","Aranda"],"phonetic":"/əˈrʌntə/","extraExplanation":["“Arunta”常见于19—20世纪早期英文文献（尤其是人类学、民族志资料）中，属于外来转写/旧拼法。现代写作中更常用“Arrernte”，被认为更尊重社群自称与当代拼写规范。","在学术引用或阅读旧文献时，你可能会遇到“Arunta”；写正式文章时，通常建议优先用“Arrernte（Aranda）”，并在首次出现时说明“Arunta”为旧称。"]}
{"word":"Aruntas","summary":{"en":"“Aruntas” is a plural noun meaning members of the Arunta/Arrernte Aboriginal people of Central Australia (an older spelling common in early sources).","zh":"“Aruntas”为复数名词，指澳大利亚中部 Arunta/Arrernte 原住民族群的成员（早期文献常用的旧拼写）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an Aboriginal Australian people from Central Australia (also spelled Arrernte or Aranda); “Aruntas” is the plural form.","zh":"澳大利亚中部的一个原住民族群成员（也拼作 Arrernte 或 Aranda）；“Aruntas”为复数形式。"},"examples":[{"en":"Some early anthropology books used the term “Aruntas” for Central Australian Aboriginal communities.","zh":"一些早期人类学著作用“Aruntas”指澳大利亚中部的原住民社群。"},{"en":"Today, many people prefer the spelling “Arrernte,” which reflects the community’s own language and identity.","zh":"如今，许多人更倾向使用“Arrernte”这一拼写，以更贴近该族群自身的语言与身份认同。"}]}],"synonyms":["Arrernte","Aranda (older)"],"phonetic":"/əˈrʌntəz/","extraExplanation":["“Arunta/Aruntas”多见于19—20世纪早期英语文献（尤其是人类学与殖民时期记录）。在当代语境中，更常见、也更尊重自称的写法是“Arrernte”（有时也会见到较旧写法“Aranda”）。","在写作或引用时，如果是在讨论历史文献，可以保留“Aruntas”并说明其为旧称；若指当代社群，通常建议使用“Arrernte”，并尽量核对具体地区与群体名称的偏好。"]}
{"word":"arupa","summary":{"en":"Arupa means “formless” and is mainly used in Buddhist/Hindu/yogic contexts for non-material states or realms.","zh":"Arupa 指“无形/非物质”，主要用于佛教、印度哲学或瑜伽语境，表示无色的境界或状态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(in Buddhism, Hindu philosophy, and yoga) formless; without physical shape or material form.","zh":"（佛教、印度哲学、瑜伽语境）无形的；非物质形态的；没有具体形状的。"},"examples":[{"en":"Some meditation practices focus on arupa states, where attention is no longer on physical sensations.","zh":"有些禅修会专注于 arupa（无色/无形）状态，此时注意力不再停留在身体感觉上。"},{"en":"The text contrasts rupa (form) with arupa (formlessness).","zh":"这段文本把 rupa（色/有形）和 arupa（无色/无形）作对比。"}]},{"partOfSpeech":"n.","definition":{"en":"the formless realm or formless states of existence/meditation (often used in phrases like “arupa jhana” or “arupa loka”).","zh":"无色界；无形的存在/禅修境界（常见于 arupa jhana「无色定」或 arupa loka「无色界」等搭配）。"},"examples":[{"en":"In some traditions, arupa is discussed after teachings on the material realm.","zh":"在某些传统中，讲完物质（有形）层面后会进一步讨论 arupa（无色/无形）层面。"},{"en":"He studied arupa jhana as part of a broader course on Buddhist meditation.","zh":"他在一门佛教禅修课程中学习了 arupa jhana（无色定）。"}]}],"synonyms":["formless","immaterial","incorporeal","nonphysical"],"phonetic":"/əˈruːpə/","extraExplanation":["Arupa 常见拼写来自梵语/巴利语 arūpa：a- 表否定（“非、无”），rūpa 表“形色/形体/物质形态”。因此 arūpa 字面义就是“无形色”。","在佛教里，rūpa 通常译作“色”（有形的物质与形体），arūpa 常译作“无色”（非物质、无形相）。相关概念包括“四无色定”（空无边处、识无边处、无所有处、非想非非想处）与“无色界”。","在英文写作中它多用于宗教学、冥想或哲学语境，日常英语里很少单独使用；更常见的是搭配词（arupa jhana / formless jhana；arupa realm）。"]}
{"word":"Aruru","summary":{"en":"Aruru is a Mesopotamian creation mother-goddess best known for creating Enkidu in the Epic of Gilgamesh.","zh":"Aruru（阿鲁鲁）是两河流域神话中的创世母神，以在《吉尔伽美什史诗》中创造恩奇都最为著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In ancient Mesopotamian mythology) a Sumerian mother-goddess associated with creation; in the Epic of Gilgamesh, she creates Enkidu from clay.","zh":"（古代美索不达米亚神话）苏美尔的母神/创世女神；在《吉尔伽美什史诗》中，她用泥土创造了恩奇都（Enkidu）。"},"examples":[{"en":"In the Epic of Gilgamesh, Aruru creates Enkidu to balance Gilgamesh’s power.","zh":"在《吉尔伽美什史诗》中，阿鲁鲁创造了恩奇都，用来制衡吉尔伽美什的力量。"},{"en":"Aruru is sometimes identified with other Mesopotamian mother goddesses.","zh":"阿鲁鲁有时会被认为与其他美索不达米亚的母神是同一位或相近的神祇。"}]}],"synonyms":["Ninhursag","Ninmah","Mami"],"phonetic":"/əˈruːruː/","extraExplanation":["“Aruru”多见于英文文学、历史或神话研究语境里，属于专有名词。对学习者来说，最常遇到的场景是阅读《吉尔伽美什史诗》相关内容：阿鲁鲁接受众神请求，捏土造人（恩奇都），体现“造物/母性/大地”主题。","不同译本或学术写法中，Aruru 可能会与 Ninhursag、Ninmah、Mami 等母神名字互相对应或并列，这是因为古代两河流域神祇在不同时期、城市与语言传统中会出现“同神异名/职能重叠”的情况。"]}
{"word":"arusa","summary":{"en":"“Arusa” is usually a proper name, not a common English word; its meaning depends on context.","zh":"“Arusa”通常是人名等专有名词，不是常见英语词汇；具体含义需看语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (given name or surname). It is not a common standard English vocabulary word, so its meaning depends on the person/place using it.","zh":"专有名词（人名或姓氏）。它不是常见的标准英语词汇，因此含义取决于具体的人或来源。"},"examples":[{"en":"Arusa is my classmate’s name.","zh":"Arusa 是我同学的名字。"},{"en":"Please ask Arusa to email the file to me.","zh":"请让 Arusa 把文件发邮件给我。"}]}],"phonetic":"/əˈruːsə/","extraExplanation":["“arusa”在英语中不常见，很多情况下可能是拼写或听写误差。常见的相近词包括：\n- **Arusha**：坦桑尼亚的城市（常见地名）。\n- **arouse** /əˈraʊz/：动词，意为“唤醒；激起（兴趣/情绪）”。\n- **Arosa**：瑞士地名（也作人名/品牌名）。\n如果你告诉我它出现的句子/语境（比如一段话、标题、地图或人名），我可以更准确判断。"]}
{"word":"Arusha","summary":{"en":"Arusha is a city in northern Tanzania, widely known as a starting point for safaris and sometimes used as a place name in international agreements.","zh":"Arusha 指坦桑尼亚北部城市阿鲁沙，常作为观兽旅行的出发地，也常出现在国际协议等名称中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in northern Tanzania, near Mount Meru; a major gateway for safaris and travel to parks like Serengeti and Ngorongoro.","zh":"阿鲁沙（坦桑尼亚北部城市，靠近梅鲁火山；前往塞伦盖蒂、恩戈罗恩戈罗等国家公园的主要门户城市）。"},"examples":[{"en":"We flew into Arusha before starting our safari in Serengeti National Park.","zh":"我们先飞到阿鲁沙，然后开始塞伦盖蒂国家公园的观兽之旅。"},{"en":"Arusha is often used as a base for visiting Mount Kilimanjaro and nearby parks.","zh":"阿鲁沙常被用作前往乞力马扎罗山和周边国家公园的出发基地。"}]},{"partOfSpeech":"n.","definition":{"en":"(in international affairs) a place name used in titles of agreements, courts, or meetings connected with Arusha, Tanzania.","zh":"（国际事务用法）用作协议、法庭或会议名称中的地名，指与坦桑尼亚阿鲁沙相关的机构或事件。"},"examples":[{"en":"The peace talks were held in Arusha.","zh":"和谈在阿鲁沙举行。"},{"en":"The agreement is sometimes referred to as the Arusha Accord(s).","zh":"该协议有时被称为《阿鲁沙协议》。"}]}],"synonyms":["Arusha (city)","Arusha Region"],"phonetic":"əˈruːʃə","extraExplanation":["“Arusha”在东非旅游语境里非常常见，因为它靠近多座著名国家公园，是很多旅行团与登山/观兽行程的集散地。","历史与政治语境中，你可能会看到“Arusha Declaration（阿鲁沙宣言，1967）”或“Arusha Accords（阿鲁沙协议）”等名称，都是以会议/签署地来命名。"]}
{"word":"arusha","summary":{"en":"Arusha is a city in northern Tanzania and is also used to refer to important political agreements or declarations made there.","zh":"Arusha（阿鲁沙）是坦桑尼亚北部城市，也常用来指在当地达成的重大政治协议或宣言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in northern Tanzania, near Mount Meru, often used as a gateway to safaris and parks such as Serengeti and Ngorongoro.","zh":"阿鲁沙：坦桑尼亚北部城市，靠近梅鲁火山，常被视为前往塞伦盖蒂、恩戈罗恩戈罗等国家公园进行游猎的门户。"},"examples":[{"en":"We flew into Arusha before starting our safari in Serengeti National Park.","zh":"我们先飞到阿鲁沙，然后开始前往塞伦盖蒂国家公园的游猎行程。"},{"en":"Arusha is known for its markets and for being a base for climbing Mount Meru.","zh":"阿鲁沙以集市闻名，也常作为攀登梅鲁火山的基地。"}]},{"partOfSpeech":"n.","definition":{"en":"(in politics/history) used in names of major agreements or events held in Arusha, such as the “Arusha Declaration” or “Arusha Accords.”","zh":"（政治/历史）指在阿鲁沙签署或发表的重要文件与事件名称中的“阿鲁沙”，如《阿鲁沙宣言》《阿鲁沙协议》。"},"examples":[{"en":"The Arusha Declaration influenced Tanzania’s early post-independence policies.","zh":"《阿鲁沙宣言》影响了坦桑尼亚独立初期的政策走向。"},{"en":"The Arusha Accords are often discussed in studies of conflict and peace processes in the region.","zh":"在研究该地区冲突与和平进程时，人们常会讨论《阿鲁沙协议》。"}]}],"synonyms":["(no true synonyms; related: Northern Tanzania, safari gateway)"],"phonetic":"/əˈruːʃə/","extraExplanation":["“Arusha”既是地名，也是一个常见的“地名转指”（metonymy）：用地点来指代在那里发生的重大会议、宣言或和平协议。","词源上通常与当地的阿鲁沙人（Waarusha）有关。英语里它作为专有名词使用，通常首字母大写：Arusha。"]}
{"word":"aruspex","summary":{"en":"An ancient Roman diviner who foretold events by examining sacrificed animals’ entrails; sometimes used figuratively for someone who reads signs to predict outcomes.","zh":"古罗马通过检查祭牲内脏来占卜的人；也可引申为善于从征兆/线索中预测结果的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In ancient Rome, a religious diviner (soothsayer) who tried to predict the future by examining the entrails (especially the liver) of sacrificed animals.","zh":"（古罗马）占卜师；通过检查祭牲内脏（尤指肝脏）来预测吉凶与未来的人。"},"examples":[{"en":"Before the general marched, an aruspex inspected the sacrificed sheep’s liver for omens.","zh":"将军出征前，一位 aruspex 检查了祭羊的肝脏来判断征兆。"},{"en":"The senator refused to act until the aruspex declared the signs favorable.","zh":"那位元老院议员直到 aruspex 宣称征兆吉利才肯行动。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, rare) A person who claims to predict events by reading signs or hidden clues.","zh":"（引申义，较少见）靠解读迹象或隐秘线索来预测事件的人；“预言者”。"},"examples":[{"en":"In the novel, the detective is an aruspex of tiny details.","zh":"在这部小说里，那名侦探像是能从细节中占卜的 aruspex。"},{"en":"Some critics became aruspices of the market, reading every rumor as an omen.","zh":"有些评论员成了市场的“占卜师”，把每条传闻都当作征兆来解读。"}]}],"synonyms":["soothsayer","diviner","seer","oracle","haruspex"],"phonetic":"/ˈærəˌspɛks/","extraExplanation":["词源来自拉丁语 haruspex（也写作 haruspic-），大意为“看内脏的人”。这种占卜法常被称为 haruspicy（内脏占卜）。","在罗马宗教与公共政治中，解读“征兆”（omens）很重要；aruspex 的角色与 augur（观鸟占兆的祭司）相近，但方法不同：augur 主要看鸟的飞行与叫声，aruspex 主要看祭牲内脏。"]}
{"word":"aruspice","summary":{"en":"An aruspice is an ancient Roman diviner who foretold the future by inspecting sacrificed animals’ entrails.","zh":"aruspice 指古罗马通过检查献祭动物内脏来预言未来的占卜师/祭司。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Rome) a diviner or priest who predicted the future by examining the entrails (especially the liver) of sacrificed animals.","zh":"（古罗马）占卜师/祭司，通过检查献祭动物的内脏（尤其是肝脏）来预言未来。"},"examples":[{"en":"In the novel, an aruspice studies the sacrificed sheep’s liver before the army marches.","zh":"在小说里，一位占卜师在军队出征前检查献祭羊的肝脏。"},{"en":"The general consulted an aruspice to see whether the gods favored the campaign.","zh":"将军请占卜师查看诸神是否支持这次战役。"}]}],"synonyms":["haruspex","haruspice","diviner","soothsayer"],"phonetic":"əˈrʌs.pɪs","extraExplanation":["“aruspice”常被视为“haruspice/haruspex”的变体拼写，来自拉丁语，指罗马宗教中的一种占卜传统（肠卜/脏卜）。在英语写作中多见于历史、文学或学术语境。","相关文化背景：古罗马人认为神意会通过献祭动物的器官显现，占卜师会根据形状、颜色或“异常”来解释吉凶。这一做法在古代地中海世界较常见。"]}
{"word":"aruspices","summary":{"en":"Aruspices were Roman diviners who foretold events by inspecting the entrails of sacrificed animals.","zh":"Aruspices指古罗马通过检查献祭动物内脏来占卜的祭司／占卜师（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Roman religious diviners who tried to predict the future by examining the entrails (especially the liver) of sacrificed animals.","zh":"（复数）古罗马的祭司／占卜师，通过检查献祭动物的内脏（尤指肝脏）来预测吉凶与未来。"},"examples":[{"en":"In ancient Rome, aruspices were consulted before major battles or public decisions.","zh":"在古罗马，人们常在大战或重大公共决策前请祭司占卜（aruspices）。"},{"en":"The general asked the aruspices to read the signs after the sacrifice.","zh":"将军在献祭后请占卜师解读征兆。"},{"en":"In historical novels, aruspices often appear at ceremonies, interpreting omens for the crowd.","zh":"在历史小说中，占卜师常出现在仪式现场，为众人解读不祥或吉祥的预兆。"}]}],"synonyms":["haruspices","Roman diviners","soothsayers","seers"],"phonetic":"/həˈrʌspəˌsiz/","extraExplanation":["“aruspices”是拉丁词源的英语复数，单数是“haruspex”。在英文写作里，它通常出现在古罗马宗教、历史或文学语境中，比日常词更偏书面与学术。","这种占卜方式与“augur（观鸟占卜的祭司）”不同：augur主要观察鸟的飞行与叫声等自然征兆；haruspex/aruspices则侧重解读献祭动物内脏的形态与标记。"]}
{"word":"aruspicy","summary":{"en":"“aruspicy” is likely a texting form of “are u spicy?” meaning either “Do you like spicy food?” or (sometimes) a playful/flirty “Are you bold/sexy?” depending on context.","zh":"“aruspicy”多半是网聊写法“are u spicy?”，可指“你爱吃辣吗？”，也可能在某些语境里带调情意味，具体看上下文。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Texting/informal) “Are you spicy?”—a playful question that can mean “Do you like spicy food?” or, in some contexts, “Are you bold/flirty/doing something a bit naughty?”","zh":"（短信/非正式）“Are you spicy?”——一种俏皮的问法，既可以指“你爱吃辣吗？”，也可能在某些语境里指“你是不是很敢/很撩/有点‘辣’（暧昧或性感）？”"},"examples":[{"en":"A: We’re ordering Thai food—are you spicy or mild?","zh":"A：我们要点泰国菜——你吃辣还是不辣？"},{"en":"That caption “Are you spicy?” is just a playful way to flirt online.","zh":"那个配文“Are you spicy?”在网上多半是用来开玩笑式调情。"}]}],"synonyms":["Are you into spicy food?","Do you want it spicy?","Are you bold?","Are you feeling spicy?"],"phonetic":"/ɑr ju ˈspaɪsi/","extraExplanation":["“aruspicy”很可能是把“are u spicy”（are you spicy）连在一起打出来的网聊写法；“u”=“you”。","如果在点餐/食物语境里，它通常只是在问你能不能吃辣；如果出现在私聊、暧昧语境里，可能带有调情意味。对不熟的人使用时要注意分寸与场合。"]}
{"word":"arustle","summary":{"en":"Rustle means a soft sound (or to make that sound) caused by light movement, like leaves or paper.","zh":"Rustle 指（或发出）因轻微移动产生的沙沙声/窸窣声，如树叶或纸张。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a soft, light sound made by things like leaves, paper, or cloth moving or rubbing together","zh":"（树叶、纸张、布料等摩擦或移动发出的）沙沙声；窸窣声"},"examples":[{"en":"We heard a rustle in the bushes.","zh":"我们听到灌木丛里有沙沙声。"},{"en":"The rustle of pages filled the quiet room.","zh":"翻页的窸窣声充满了安静的房间。"}]},{"partOfSpeech":"v.","definition":{"en":"to make a soft, light sound as something moves or rubs against something else","zh":"（使）发出沙沙声；窸窣作响"},"examples":[{"en":"Leaves rustled in the wind.","zh":"树叶在风中沙沙作响。"},{"en":"She rustled the paper to get his attention.","zh":"她抖了抖纸张发出声音来引起他的注意。"}]}],"synonyms":["swish","flutter","whisper","murmur"],"phonetic":"/ˈrʌsəl/","extraExplanation":["你输入的“arustle”通常是把短语“a rustle”（一阵沙沙声）连写在一起；常见词条是“rustle”。","“rustle”很像拟声词，用来描写轻柔、断续的摩擦声（常见于自然场景：树叶、草丛；也可用于纸张、裙摆等）。"]}
{"word":"Arutiunian","summary":{"en":"Arutiunian is most commonly an Armenian surname (a family name), and it can also be used as an adjective meaning “related to the Arutiunian family/person.”","zh":"Arutiunian 最常见的是亚美尼亚姓氏；也可作形容词，表示“与 Arutiunian 家族/本人有关”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an Armenian surname (family name), also spelled Arutyunian/Harutyunyan, originally based on the Armenian given name Harutyun","zh":"一个亚美尼亚姓氏（家族姓），也常拼作 Arutyunian / Harutyunyan，源自亚美尼亚名字 Harutyun"},"examples":[{"en":"Dr. Arutiunian will present the research findings tomorrow.","zh":"Arutiunian 医生将于明天展示研究结果。"},{"en":"I met Ms. Arutiunian at an Armenian cultural festival.","zh":"我在一次亚美尼亚文化节上认识了 Arutiunian 女士。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to a person or family named Arutiunian","zh":"与名为 Arutiunian 的人或家族有关的"},"examples":[{"en":"The Arutiunian family archives include letters from the early 1900s.","zh":"Arutiunian 家族档案中包含许多 20 世纪初的信件。"},{"en":"They donated an Arutiunian collection of historical photographs to the museum.","zh":"他们向博物馆捐赠了一批 Arutiunian 家族的历史照片收藏。"}]}],"phonetic":"/əˌruːtiˈuːniən/","extraExplanation":["“Arutiunian”多见于英语语境中对亚美尼亚姓氏的音译/转写；不同地区可能出现 Harutyunyan、Arutyunyan 等拼法，通常与亚美尼亚语名字 Harutyun（常被解释为“复活/复生”之意）有关。","在英文写作里，这类姓氏通常大写首字母；称呼个人时可用 Mr./Ms./Dr. + Arutiunian。"]}
{"word":"Aruwimi","summary":{"en":"Aruwimi is the name of a river in the Democratic Republic of the Congo, a tributary of the Congo River.","zh":"Aruwimi 指刚果民主共和国的阿鲁维米河，是刚果河的支流。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Aruwimi River, a river in the Democratic Republic of the Congo and a tributary of the Congo River","zh":"阿鲁维米河（Aruwimi River），位于刚果民主共和国的一条河流，是刚果河的支流"},"examples":[{"en":"The Aruwimi River flows through dense rainforest in the Congo Basin.","zh":"阿鲁维米河流经刚果盆地的茂密雨林。"},{"en":"On the map, you can find the Aruwimi as a tributary joining the Congo River.","zh":"在地图上，你可以看到阿鲁维米河作为支流汇入刚果河。"}]}],"synonyms":["Aruwimi River"],"phonetic":"/ˌɑːruːˈwiːmi/","extraExplanation":["“Aruwimi”通常作为专有名词使用（河流名），写作时多首字母大写：Aruwimi River。","它所在区域属于刚果盆地雨林地带，相关文本中常与探险史、热带雨林与中非地理一起出现。"]}
