{"word":"ARV","summary":{"en":"ARV most commonly means an antiretroviral drug (HIV medicine). In real estate, it can mean after-repair value.","zh":"ARV 最常指抗逆转录病毒药物（HIV 用药）；在房地产语境中也可指修缮后价值。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbrev.) antiretroviral (drug); a medicine used to treat HIV by stopping the virus from multiplying.","zh":"（缩写）抗逆转录病毒（药物）；用于治疗 HIV，通过抑制病毒复制来控制病情的药物。"},"examples":[{"en":"Many people with HIV take ARVs every day to keep the virus under control.","zh":"许多 HIV 感染者每天服用 ARVs 来控制病毒。"},{"en":"The clinic provides ARVs for free in some communities.","zh":"在一些社区，诊所会免费提供 ARV 药物。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbrev., real estate) after-repair value; the estimated value of a property after renovations are completed.","zh":"（缩写，房地产）修缮后价值；房屋装修/翻新完成后预计能卖到的价值。"},"examples":[{"en":"Investors estimate the ARV before deciding how much to spend on repairs.","zh":"投资者会先估算 ARV，再决定修缮要花多少钱。"},{"en":"If the ARV is high, the project may be worth doing.","zh":"如果 ARV 很高，这个项目可能值得做。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev., less common) a shortened form used for certain technical terms (for example in military or engineering); the exact meaning depends on the field.","zh":"（缩写，较少见）某些技术术语的简称（例如军事或工程领域）；具体含义取决于语境/行业。"},"examples":[{"en":"In this report, ARV is defined in the glossary.","zh":"在这份报告里，ARV 的含义在术语表中有定义。"}]}],"synonyms":["antiretroviral","ARVs","HIV medicine","after-repair value","after renovation value"],"phonetic":"/ˌeɪ ɑr ˈviː/","extraExplanation":["在医疗语境里，ARV/ARVs 最常指“抗逆转录病毒药物”，常与 HIV 治疗相关；说法上既可说 an ARV（一个药物/一种药），也常用复数 ARVs 指“整套用药/多种药”。","在房地产投资语境里，ARV 指 After-Repair Value（修缮后价值），常用于估算翻新房的潜在售价与利润。","如果你告诉我 ARV 出现的句子或领域（医疗/房地产/工作文件等），我可以帮你锁定最准确的含义。"]}
{"word":"Arva","summary":{"en":"Arva is most commonly a proper noun used as a personal name or a place name.","zh":"Arva 通常作为专有名词使用，最常见的是人名或地名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name (usually feminine), used in several cultures; it is relatively uncommon in English-speaking countries.","zh":"人名（多为女性名）；在多种文化中可见，在英语国家相对少见。"},"examples":[{"en":"Arva is a unique name, so people often ask how to spell it.","zh":"Arva 是个比较特别的名字，所以人们常会问怎么拼写。"},{"en":"Arva introduced herself at the meeting and everyone repeated her name to remember it.","zh":"Arva 在会议上自我介绍后，大家又重复了一遍她的名字来记住。"}]},{"partOfSpeech":"other","definition":{"en":"a place name; for example, Arva is the name of a community in Ontario, Canada, and also appears as a place name in other regions.","zh":"地名；例如 Arva 是加拿大安大略省的一个社区名，在其他地区也可能作为地名出现。"},"examples":[{"en":"We drove through Arva on our way to London, Ontario.","zh":"我们去安大略省伦敦市的路上开车经过了 Arva。"},{"en":"The address says Arva, so it’s probably referring to the community, not a person.","zh":"地址上写着 Arva，所以多半指的是那个地方，而不是一个人。"}]}],"synonyms":["(no direct synonyms; proper noun)"],"phonetic":"ˈɑrvə","extraExplanation":["“Arva”作为名字时，可能是不同语言/家族传统中的拼写变体；仅凭这一种拼写很难确定单一来源。","在英语语境里，看到首字母大写的“Arva”通常要结合上下文判断：是人名、地名，还是品牌/组织名。"]}
{"word":"Arvad","summary":{"en":"Arvad is an ancient Phoenician island city (often spelled Arwad) near Syria, and it can also refer to its people.","zh":"Arvad 指叙利亚附近的一座古代腓尼基海岛城（常拼作 Arwad），也可指该城的居民。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient island city (also spelled Arwad) off the coast of present-day Syria, known in Phoenician history and mentioned in the Bible.","zh":"古代腓尼基的海岛城邦（也拼作 Arwad/Arwād），位于今叙利亚海岸附近，在腓尼基历史中重要，也出现在《圣经》中。"},"examples":[{"en":"Arvad was a Phoenician island city known for maritime trade.","zh":"Arvad 是一座以海上贸易闻名的腓尼基海岛城。"},{"en":"Some Bible translations mention Arvad in lists of coastal peoples and cities.","zh":"一些《圣经》译本在沿海民族与城邑的名单中提到 Arvad。"}]},{"partOfSpeech":"n.","definition":{"en":"The people associated with Arvad; sometimes referred to as the Arvadites in older texts.","zh":"与 Arvad 相关的居民；在较早的文献中有时称为“Arvadites（亚瓦底人）”。"},"examples":[{"en":"Historical sources describe sailors from Arvad as skilled seafarers.","zh":"一些史料记载 Arvad 的水手以航海技术高超著称。"}]}],"synonyms":["Arwad","Arwād"],"phonetic":"ˈɑr.vɑd","extraExplanation":["“Arvad”在英文资料中常与“Arwad/Arwād”互为异拼，属于同一地名的不同转写方式（从腓尼基语/阿拉伯语进入英语）。","在《圣经》背景中，它常作为地名出现在先知书或族群/城邑清单里；现代学术与旅行资料更常用拼法“Arwad”。"]}
{"word":"Arvada","summary":{"en":"Arvada is best known as a city in Colorado near Denver.","zh":"Arvada 最常指科罗拉多州丹佛附近的一座城市（阿瓦达）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A city in Jefferson County, Colorado, USA, located just northwest of Denver.","zh":"美国科罗拉多州杰斐逊县的一座城市，位于丹佛市西北方向不远处。"},"examples":[{"en":"She lives in Arvada and commutes to downtown Denver for work.","zh":"她住在阿瓦达（Arvada），每天通勤去丹佛市中心上班。"},{"en":"Arvada has easy access to the Rocky Mountains for weekend trips.","zh":"阿瓦达去落基山脉很方便，适合周末出游。"}]},{"partOfSpeech":"other","definition":{"en":"A personal name or surname (rare), usually referring to the place name or inspired by it.","zh":"人名或姓氏（较少见），通常与地名有关或受其启发。"},"examples":[{"en":"His last name is Arvada, which often gets mistaken for the Colorado city.","zh":"他姓 Arvada，经常会被误以为是科罗拉多的那座城市。"}]}],"synonyms":["Arvada, Colorado"],"phonetic":"/ɑrˈvædə/","extraExplanation":["“Arvada”在英语里主要是一个专有名词（地名）。书写时首字母通常大写：Arvada。","关于地名来源：资料中常见说法是其命名与早期铁路/定居时期有关，但词源并不完全统一；学习中可把它当作固定地名记忆即可。"]}
{"word":"Arval","summary":{"en":"Arval is a historical Northern English word meaning a funeral feast, or describing things connected to that feast.","zh":"Arval 是英格兰北部的历史用语，指“丧宴/葬后聚餐”，也可作形容词表示与丧宴相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Northern England, historical) relating to a funeral meal or feast held after someone’s burial.","zh":"（英格兰北部，历史用法）与葬礼后的“丧宴/追思宴”有关的；丧宴的。"},"examples":[{"en":"In some old Yorkshire villages, people spoke of an arval meal after the burial.","zh":"在约克郡一些旧时的村庄里，人们会提到下葬后的 arval 丧宴。"},{"en":"The record mentions arval bread served to guests at the funeral gathering.","zh":"记录中提到在葬礼聚会时招待宾客的 arval 面包。"}]},{"partOfSpeech":"n.","definition":{"en":"(Northern England, historical) a funeral meal or feast held after a burial; a funeral gathering with food.","zh":"（英格兰北部，历史用法）丧宴；下葬后举行的追思聚餐（含食物的葬礼聚会）。"},"examples":[{"en":"The family hosted an arval for neighbors and friends.","zh":"家人为邻居和朋友办了一场 arval 丧宴。"},{"en":"After the service, everyone went back to the house for the arval.","zh":"仪式结束后，大家回到家里参加丧宴（arval）。"}]}],"synonyms":["funeral feast","funeral meal","wake"],"phonetic":"/ˈɑrvəl/","extraExplanation":["“arval”主要见于英格兰北部（如约克郡、坎布里亚等）的方言与旧文献中，现代日常英语里不常用。","相关搭配里常见“arval bread / arval cake”（丧宴面包/蛋糕），指在这种葬后聚会上分享的食物。","词源上通常与古英语中表示“继承/继嗣（heir）”的词根有关，反映了葬礼后亲族与社区聚集、处理遗产与社会关系的传统。"]}
{"word":"arval","summary":{"en":"Arval = a dialect word for a funeral meal/feast (like a wake), mainly in Northern England.","zh":"Arval 是英格兰北部方言，指葬礼后的饭局/宴席（类似 wake）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dialect, chiefly Northern England) a meal or feast held after a funeral; a funeral banquet (similar to a wake).","zh":"（方言，主要见于英格兰北部）葬礼后举行的饭局/宴席；丧宴（类似“守灵宴/追思宴”）。"},"examples":[{"en":"After the burial, the family invited neighbors to an arval at the local inn.","zh":"下葬后，家人在当地旅店请邻居参加丧宴。"},{"en":"In some villages, the arval was a way to thank the community for their help.","zh":"在一些村庄里，丧宴是一种感谢社区帮忙的方式。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to a funeral feast.","zh":"与丧宴有关的；丧宴的。"},"examples":[{"en":"They followed an old arval custom of sharing bread and ale.","zh":"他们遵循古老的丧宴习俗，分享面包和麦酒。"}]}],"synonyms":["wake","funeral feast","funeral reception"],"phonetic":"/ˈɑrvəl/","extraExplanation":["“arval”是地方用语（dialect word），在现代英语里不常见；更常用的说法是“wake”（守灵/追思聚会）或“funeral reception”（葬礼后的招待会）。","词源常被认为与古诺尔斯语（Old Norse）中表示“继承/遗产”的词根有关，因为这种宴席历史上也与遗产分配、社区见证等社会习俗相关。"]}
{"word":"Arvales","summary":{"en":"Arvales refers to the Arval Brothers, an ancient Roman priesthood connected with farming rites and harvest protection.","zh":"Arvales 指古罗马的阿尔瓦里兄弟会（祭司团），与农业祭仪、祈求丰收和保护庄稼有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Rome) the Arval Brothers: a group of Roman priests who performed rituals to protect crops and ensure a good harvest.","zh":"（古罗马）阿尔瓦里兄弟会／阿尔瓦里祭司团：一支罗马祭司团体，负责举行仪式以保佑农作物、祈求丰收。"},"examples":[{"en":"The Arvales held ceremonies in spring to pray for fertile fields.","zh":"阿尔瓦里祭司团会在春季举行仪式，为田地丰饶而祈祷。"},{"en":"Inscriptions mention the Arvales alongside other important Roman priesthoods.","zh":"碑铭中常把阿尔瓦里祭司团与其他重要的罗马祭司团并列提及。"}]}],"synonyms":["Arval Brothers","Fratres Arvales"],"phonetic":"/ɑrˈveɪliz/","extraExplanation":["“Arvales”来自拉丁语，和“arva”（田地、耕地）有关，因此它的核心联想是“农业与丰收”。","他们常以拉丁名“Fratres Arvales”（阿尔瓦里兄弟会）出现，主持与女神Dea Dia相关的祭仪；现存的祭仪记录（碑铭）为研究罗马宗教提供了重要材料。"]}
{"word":"ArvArva","summary":{"en":"“ArvArva” is not recognized as a common English word; its meaning likely depends on context (name/brand/typo/other language).","zh":"“ArvArva”不是常见英语词；含义多半取决于语境（人名/品牌/拼写错误/其他语言）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a name, a stylized spelling, a typo, or a word from another language.","zh":"不是标准英语单词。可能是人名/地名、刻意的拼写风格、打字错误，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “ArvArva” in an English dictionary—could you share a sentence where you saw it?","zh":"我在英语词典里找不到“ArvArva”——你能给我它出现的句子吗？"},{"en":"If “ArvArva” is a username or brand name, the meaning depends on the creator.","zh":"如果“ArvArva”是用户名或品牌名，它的含义取决于创作者。"}]}],"phonetic":"/ˌɑrˈvɑrvɑ/","extraExplanation":["“ArvArva”看起来像是大小写交替的写法（常见于网名、品牌名、游戏ID），这种写法通常不改变读音，但会增加视觉辨识度。","如果你是在特定语境里看到它（比如一段对话、小说、游戏任务、歌曲歌词、产品名），把那句话发来，我可以帮你判断它是不是某个专有名词、缩写，或是某种语言的词。"]}
{"word":"arveja","summary":{"en":"“Arveja” means “pea,” a common Latin American Spanish word.","zh":"“Arveja”意为“豌豆”，是拉丁美洲西班牙语里很常用的说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a pea (especially a green pea), commonly used in Latin American Spanish.","zh":"豌豆（尤其指青豌豆；常见于拉丁美洲西班牙语用法）。"},"examples":[{"en":"In Peru, many soups include arveja (peas).","zh":"在秘鲁，很多汤里会加入 arveja（豌豆）。"},{"en":"She bought arvejas to make a simple vegetable stew.","zh":"她买了豌豆（arvejas）来做一锅简单的蔬菜炖菜。"}]}],"synonyms":["pea","green pea","guisante (Spain Spanish)"],"phonetic":"/ɑrˈveɪhə/","extraExplanation":["“Arveja”是西班牙语词，在不少拉丁美洲国家（如秘鲁、哥伦比亚、智利等）很常用；在西班牙本土更常见的说法是“guisante”。","在菜谱语境里，arveja 通常指可食用的青豌豆（fresh/frozen green peas），有时也可能指干豌豆（split peas）——具体看配方说明（如是否写“seca/partida”表示干的/剖开的）。"]}
{"word":"arvejon","summary":{"en":"“arvejon” is a non-standard English form of Spanish “arvejón,” meaning “pea.”","zh":"“arvejon”并非标准英文，通常对应西班牙语“arvejón”，意思是“豌豆”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Not standard English) A Spanish word for a pea; sometimes used to refer to a pea plant or peas in general, especially in Latin American contexts.","zh":"（非标准英文）西班牙语词，指“豌豆”；在拉丁美洲语境中有时也泛指豌豆或豌豆植物。"},"examples":[{"en":"In some Spanish-speaking regions, “arvejón” refers to peas used in soups.","zh":"在一些西语地区，“arvejón”指用来煮汤的豌豆。"},{"en":"The recipe calls for arvejón (peas) and carrots.","zh":"这道食谱需要 arvejón（豌豆）和胡萝卜。"}]}],"synonyms":["pea","peas","arvejón","arveja"],"phonetic":"/ɑrˈveɪ.hoʊn/","extraExplanation":["“arvejon”更常见的规范写法是带重音符号的西班牙语“arvejón”。不同国家/地区也常用“arveja”表示豌豆。","它通常不会出现在一般英语词典里；如果你在英文语境写作，建议直接用“peas / pea”。"]}
{"word":"Arvel","summary":{"en":"Arvel is a (rare) personal name, used mainly as a first name.","zh":"Arvel 是较少见的人名，主要用作名字。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a personal name (given name), sometimes also used as a family name.","zh":"人名（名字），有时也可作姓氏。"},"examples":[{"en":"Arvel is my grandfather’s first name.","zh":"Arvel 是我祖父的名字。"},{"en":"I met someone named Arvel at the conference.","zh":"我在会议上遇到一个叫 Arvel 的人。"}]}],"synonyms":["Arvell","Arwel"],"phonetic":"/ˈɑrvəl/","extraExplanation":["“Arvel”在英语里主要作为专有名词使用（人名），本身不是常见的普通词汇，因此没有像一般单词那样固定的词义。","有时它被视为威尔士语名字“Arwel”的变体拼写（Arwel 常被解释为与“显著、杰出”相关），但具体来源会因家庭与地区而不同，未必都有明确语源。","用作称呼时，英语里常见表达是：first name（名）、last name/family name（姓）、full name（全名）。"]}
{"word":"arvel","summary":{"en":"Marvel means “something amazing” (noun) or “to be amazed” (verb, often with at).","zh":"Marvel 可作名词表示“奇迹/令人惊叹的事物”，也可作动词表示“感到惊奇/赞叹”（常与 at 连用）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wonderful or surprising person, thing, or event; something that makes people feel amazed","zh":"奇迹；令人惊叹的人（或事物、事件）"},"examples":[{"en":"It’s a marvel that no one was hurt in the accident.","zh":"这次事故中没人受伤，真是个奇迹。"},{"en":"The new bridge is an engineering marvel.","zh":"这座新桥是工程学上的奇迹。"}]},{"partOfSpeech":"v.","definition":{"en":"to feel great surprise or admiration (often used with “at”)","zh":"（常与 at 连用）感到惊奇；赞叹"},"examples":[{"en":"I marveled at how quickly she learned English.","zh":"我惊叹她学英语学得那么快。"},{"en":"Tourists marvel at the view from the top of the mountain.","zh":"游客们赞叹山顶的景色。"}]}],"synonyms":["wonder","miracle","astonishment","amazement","admire"],"phonetic":"/ˈmɑrvəl/","extraExplanation":["你输入的 **arvel** 很可能是 **marvel** 少了开头的 m（常见拼写错误）。英语里单独的 **Arvel** 也可能是人名，但最常用的词汇是 **marvel**。","用法提示：**marvel at + 名词/动名词**（marvel at the view / marvel at seeing…）。名词 **a marvel** 常表示“令人惊叹的事物”。"]}
{"word":"Arvell","summary":{"en":"Arvell is most commonly used as a personal name (first name) and sometimes as a surname.","zh":"Arvell 最常见的用法是人名（名字），有时也用作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (first name), usually for men; used in English-speaking contexts as a personal name.","zh":"人名（名），多用于男性；在英语语境中作为个人名字使用。"},"examples":[{"en":"Arvell moved to Chicago for a new job.","zh":"Arvell 为了新工作搬到了芝加哥。"},{"en":"My uncle Arvell loves jazz music.","zh":"我叔叔 Arvell 很喜欢爵士乐。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname/last name).","zh":"姓氏（家族名）。"},"examples":[{"en":"Dr. Arvell will see you at 3 p.m.","zh":"Arvell 医生会在下午三点见你。"},{"en":"She searched for Arvell in the alumni directory.","zh":"她在校友名录里搜索 Arvell 这个姓。"}]}],"phonetic":"/ˈɑr.vəl/","extraExplanation":["“Arvell”通常被视为英语人名/姓氏，而不是一个常见词汇，所以没有固定的“词义”。在写作中要注意首字母大写：Arvell。","发音在不同地区可能略有差异；有些人也会把它读得更接近“AR-vuhl”。如果你是在特定作品、人物或品牌里看到这个词，也可能是作者创造或选择的名字。"]}
{"word":"Arverni","summary":{"en":"Arverni = an ancient powerful Gallic tribe in central France, associated with Vercingetorix’s resistance to Julius Caesar.","zh":"Arverni（阿尔维尔尼人）= 古代法国中部的强大高卢部族，与维钦革托里克斯反抗凯撒密切相关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an ancient Celtic (Gallic) people who lived in what is now central France (roughly the Auvergne region), famous for their leader Vercingetorix who resisted Julius Caesar","zh":"古代凯尔特（高卢）部族之一，居住在今日法国中部（大致为奥弗涅地区），以其领袖维钦革托里克斯（Vercingetorix）反抗凯撒而闻名"},"examples":[{"en":"Vercingetorix was a leader of the Arverni during the Gallic Wars.","zh":"在高卢战争期间，维钦革托里克斯是阿尔维尔尼人的领袖。"},{"en":"The Arverni were one of the most powerful tribes in ancient Gaul.","zh":"阿尔维尔尼人是古代高卢最强大的部族之一。"},{"en":"This museum exhibit explains how the Arverni lived in central France.","zh":"这个博物馆展览介绍了阿尔维尔尼人在法国中部的生活方式。"}]}],"synonyms":["a Gallic tribe","the Gauls (general term)"],"phonetic":"/ɑrˈvɝːnaɪ/","extraExplanation":["“Arverni”是拉丁语/史学写法中的族名，英语里常见于历史书（尤其是讲罗马与高卢的冲突）。在凯撒的《高卢战记》（Commentarii de Bello Gallico）相关章节中经常出现该族名。","与地名的关系：阿尔维尔尼人的核心地区后来与法国的“Auvergne（奥弗涅）”地区有历史关联，因此学习时可以把Arverni与Auvergne联想记忆。"]}
{"word":"arverni","summary":{"en":"Arverni: an ancient Gaulish tribe from central France, known for resisting Rome under Vercingetorix.","zh":"Arverni：古代高卢（凯尔特）部族，位于今法国中部，以韦尔辛格托里克斯反抗罗马而著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an ancient Celtic (Gaulish) people who lived in what is now central France (the Auvergne region), famous for leading resistance against Julius Caesar under Vercingetorix.","zh":"阿尔维尔尼斯人：古代凯尔特（高卢）部族之一，居于今法国中部（奥弗涅一带），以韦尔辛格托里克斯领导反抗凯撒而闻名。"},"examples":[{"en":"The Arverni were one of the most powerful tribes in Gaul.","zh":"阿尔维尔尼斯人曾是高卢最强大的部族之一。"},{"en":"Vercingetorix, an Arvernian leader, united many tribes against Rome.","zh":"韦尔辛格托里克斯这位阿尔维尔尼斯领袖联合了许多部族对抗罗马。"}]}],"synonyms":["Arvernian (related adjective)"],"phonetic":"/ɑrˈvɝːnaɪ/","extraExplanation":["“Arverni”是拉丁文复数形式，英语中常直接用来指该部族整体；若要表达“阿尔维尔尼斯的/来自阿尔维尔尼斯人”，英语更常用形容词“Arvernian”。","在凯撒《高卢战记》（Commentarii de Bello Gallico）中，Arverni与其领袖Vercingetorix经常出现，尤其与公元前52年的阿莱西亚之战（Battle of Alesia）相关。","“Auvergne（奥弗涅）”这一法国地名一般被认为与“Arverni”有关，反映了该部族对当地历史与地名的影响。"]}
{"word":"Arvernian","summary":{"en":"Arvernian means “connected with the ancient Gallic tribe the Arverni (central Gaul/Auvergne)” or “a member of that people.”","zh":"Arvernian 指“与古代高卢部族阿维尔尼人（法国中部/奥弗涅）有关的”，也可指“阿维尔尼人（该族群成员）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Arverni, an ancient Gallic (Celtic) people of central Gaul (roughly modern Auvergne in France).","zh":"与阿维尔尼人（古代高卢的凯尔特部族，活动于法国中部，约相当于今奥弗涅地区）有关的。"},"examples":[{"en":"Vercingetorix was an Arvernian leader who resisted Julius Caesar.","zh":"维钦托里克斯是一位阿维尔尼领袖，曾反抗尤利乌斯·凯撒。"},{"en":"The museum has coins from Arvernian territory.","zh":"这家博物馆收藏了来自阿维尔尼领地的硬币。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from the Arverni, or someone identified with that ancient people.","zh":"阿维尔尼人；指阿维尔尼部族的一员或被认同为该古代族群的人。"},"examples":[{"en":"Roman writers described the Arverni as powerful in central Gaul.","zh":"罗马作家形容阿维尔尼人在高卢中部势力强大。"}]}],"synonyms":["Arverni (related term)","Gallic (broader)","Celtic (broader)"],"phonetic":"/ɑrˈvɝniən/","extraExplanation":["“Arvernian”多见于历史、考古与古典学语境（例如讲述高卢战争）。最常被提到的人物是Vercingetorix（维钦托里克斯），他在公元前52年联合多部族对抗凯撒。","与现代地名的联系：Arverni的核心区域大致对应法国的Auvergne（奥弗涅）。因此在某些历史写作中，Arvernian也会被用来指与该地区古代历史相关的事物。"]}
{"word":"Arvicola","summary":{"en":"Arvicola is the scientific genus name for water voles and related voles.","zh":"Arvicola 是水田鼠及其近缘田鼠的属名（学名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of voles (small rodents), especially the water voles found in Europe and parts of Asia; in everyday English, it often refers to the water vole.","zh":"（生物分类）田鼠属：一种田鼠类（小型啮齿动物）的属，尤其指分布于欧洲及部分亚洲的水田鼠；在日常英语中有时也用来泛指水田鼠。"},"examples":[{"en":"The water vole belongs to the genus Arvicola.","zh":"水田鼠属于田鼠属（Arvicola）。"},{"en":"Researchers recorded Arvicola populations along the riverbanks.","zh":"研究人员记录了河岸一带田鼠属（Arvicola）的种群数量。"}]}],"synonyms":["water vole","vole"],"phonetic":"/ɑrˈvɪkələ/","extraExplanation":["“Arvicola”是拉丁化的学名（属名），常见于生物学与生态学写作中；在普通对话里，人们更常说“water vole”（水田鼠）。","拼写以大写字母开头通常表示属名（Genus）；如果指具体物种，会写成二名法，如 *Arvicola amphibius*（欧洲水田鼠）。"]}
{"word":"arvicola","summary":{"en":"Arvicola is the scientific genus name for certain voles, especially the water vole.","zh":"Arvicola 是田鼠属的拉丁学名，常指包括水田鼠在内的一类田鼠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of voles (small, mouse-like rodents) found mainly in Europe and parts of Asia; used as a scientific name in biology.","zh":"（生物学）田鼠属：一种小型啮齿动物（田鼠）的属名，主要分布于欧洲及部分亚洲地区；常用于学术/科学语境。"},"examples":[{"en":"The paper examined the population cycles of Arvicola in wetland habitats.","zh":"这篇论文研究了湿地栖息地中田鼠属（Arvicola）的种群周期。"},{"en":"Arvicola amphibius is often called the European water vole.","zh":"Arvicola amphibius 常被称为欧洲水田鼠（European water vole）。"}]}],"synonyms":["vole","water vole","field vole"],"phonetic":"/ɑrˈvɪkələ/","extraExplanation":["“Arvicola”是拉丁化的动物学属名，常见于物种的双名法（如 Arvicola amphibius）。在一般英语交流中，人们更常说“vole（田鼠）”或更具体的“water vole（水田鼠）”，而不是直接用“Arvicola”。"]}
{"word":"arvicole","summary":{"en":"Arvicole means “of fields or farming; rural and agricultural.”","zh":"arvicole 指“田野/耕作相关的；乡村农业的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to fields or farming; rural and agricultural in nature.","zh":"与田野或耕作有关的；乡村的、农业的。"},"examples":[{"en":"In the arvicole landscape, small farms and hedgerows shape the view.","zh":"在这种田园农业景观中，小农场和树篱勾勒出视野。"},{"en":"The novelist uses arvicole details—plows, harvests, and soil—to make the setting feel real.","zh":"小说家用田园农业的细节——犁、收割和泥土——让背景更真实。"}]}],"synonyms":["agricultural","agrarian","rural","pastoral"],"phonetic":"/ˈɑr.vəˌkoʊl/","extraExplanation":["“arvicole”是一个比较少见、偏文学或学术的词，用来表达“田野/耕作的气息”。日常英语里更常用的是 “agricultural” 或 “rural”。","词源来自拉丁语：arvum（田地）+ colere（耕作、栽培），所以它带有“在田里耕作、与农事相关”的核心意思。"]}
{"word":"Arvicolinae","summary":{"en":"Arvicolinae is the rodent subfamily that includes voles, lemmings, and muskrats.","zh":"Arvicolinae 指包含田鼠、旅鼠和麝鼠等的一类啮齿动物亚科（田鼠亚科）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a biological subfamily of rodents (in the family Cricetidae) that includes voles, lemmings, and the muskrat.","zh":"（生物分类）田鼠亚科：隶属仓鼠科（Cricetidae）的一支啮齿动物亚科，包括田鼠、旅鼠和麝鼠等。"},"examples":[{"en":"Many species in Arvicolinae are important prey for owls and foxes.","zh":"田鼠亚科的许多物种是猫头鹰和狐狸的重要猎物。"},{"en":"The muskrat is often classified within Arvicolinae in modern taxonomy.","zh":"在现代分类学中，麝鼠常被归入田鼠亚科。"}]}],"synonyms":["vole subfamily","Arvicolines"],"phonetic":"/ˌɑr.vɪˈkoʊ.lɪ.niː/","extraExplanation":["“Arvicolinae”是拉丁化的动物分类名称，常见于学术论文、野生动物调查报告和博物馆标本标签中；日常英语里更常直接说“voles / lemmings / muskrat（田鼠/旅鼠/麝鼠）”。","分类层级提示：亚科（subfamily）位于“科（family）”之下、“属（genus）”之上；因此它指的是一群相关的属与物种，而不是单一动物。"]}
{"word":"arvicolinae","summary":{"en":"Arvicolinae is the rodent subfamily that includes voles and lemmings.","zh":"Arvicolinae 指包含田鼠和旅鼠在内的啮齿动物“田鼠亚科”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a subfamily of rodents that includes voles, lemmings, and closely related small, short-tailed mice-like animals (within the family Cricetidae)","zh":"（生物分类）田鼠亚科：啮齿动物的一支，包含田鼠、旅鼠及其近缘的小型短尾类鼠动物（隶属仓鼠科 Cricetidae）"},"examples":[{"en":"Voles belong to the subfamily Arvicolinae.","zh":"田鼠属于田鼠亚科（Arvicolinae）。"},{"en":"Many Arvicolinae species live in cold or temperate regions and are important prey for owls and foxes.","zh":"许多田鼠亚科物种生活在寒冷或温带地区，是猫头鹰和狐狸等动物的重要食物来源。"}]}],"synonyms":["arvicolines (plural, common in writing)","vole subfamily"],"phonetic":"/ˌɑr.vɪ.kəˈlaɪ.niː/","extraExplanation":["这是一个“拉丁化的生物学名称”，日常英语里很少用；在科普或学术写作中更常见。","在英文文献中也常见复数形式 **arvicolines**（指“田鼠亚科动物/田鼠类”），例如：*arvicolines are common in grasslands*。"]}
{"word":"Arvicolinae-related","summary":{"en":"“Arvicolinae-related” means related to the rodent subfamily Arvicolinae (voles and lemmings).","zh":"“Arvicolinae-related” 指与啮齿动物亚科 Arvicolinae（田鼠、旅鼠）有关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with, about, or involving the rodent subfamily Arvicolinae (voles, lemmings, and close relatives).","zh":"与啮齿动物亚科 Arvicolinae（田鼠、旅鼠及其近缘类群）有关的；涉及该类群的。"},"examples":[{"en":"Researchers compared Arvicolinae-related fossils from different Ice Age sites.","zh":"研究人员比较了来自不同冰河时期遗址的 Arvicolinae 相关化石。"},{"en":"The paper discusses Arvicolinae-related changes in tooth shape over time.","zh":"这篇论文讨论了 Arvicolinae 相关的牙齿形态随时间的变化。"},{"en":"They used Arvicolinae-related DNA markers to identify species from hair samples.","zh":"他们使用 Arvicolinae 相关的 DNA 标记，通过毛发样本鉴定物种。"}]}],"synonyms":["Arvicolinae-associated","vole-related","lemming-related","arvicoline"],"phonetic":"/ˌɑr.vəˈkoʊ.lɪ.niˌeɪ rɪˈleɪtɪd/","extraExplanation":["这是一个学术写法的复合形容词：Arvicolinae（亚科名）+ related（相关的）。常见于动物分类学、古生物学与生态学论文中，用来把研究对象明确限定在“田鼠/旅鼠这一支”的范围。","Arvicolinae 是鼹形鼠科（Cricetidae）中的一个亚科；日常英语里更常说 voles（田鼠）和 lemmings（旅鼠）。如果写给非专业读者，可以考虑用 “vole- and lemming-related”。"]}
{"word":"arvicoline","summary":{"en":"An adjective used in biology meaning “related to voles/lemmings and their close relatives.”","zh":"生物学用形容词，表示“与田鼠、旅鼠及其近缘类群（鼠亚科）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or characteristic of the Arvicolinae (a group of rodents such as voles, lemmings, and muskrats).","zh":"与鼠亚科（Arvicolinae，一类啮齿动物，如田鼠、旅鼠、麝鼠）有关的；具有该类动物特征的。"},"examples":[{"en":"Scientists compared arvicoline teeth to understand how different vole species evolved.","zh":"科学家比较了鼠亚科动物的牙齿，以了解不同田鼠物种如何进化。"},{"en":"The owl’s diet in this area is largely arvicoline rodents.","zh":"该地区猫头鹰的食谱主要是鼠亚科啮齿动物。"}]}],"synonyms":["vole-related","Arvicolinae-related"],"phonetic":"/ˌɑrˈvɪkəlaɪn/","extraExplanation":["“arvicoline”主要用于动物学与生态学写作，是一个比较学术、偏专业的形容词，日常英语中很少见。","它来自拉丁化的属名/词根“Arvicola”（常指田鼠类）+ “-ine”（表示“……的、与……有关的”）。","在论文或科普中，你也可能看到更常用、更通俗的表达：vole (田鼠)、lemming (旅鼠)、muskrat (麝鼠)，或直接写“arvicoline rodents（鼠亚科啮齿动物）”。"]}
{"word":"Arvicolines","summary":{"en":"Arvicolines are voles and lemmings (Arvicolinae), a group of small rodents.","zh":"Arvicolines 指田鼠与旅鼠类（田鼠亚科）的一类小型啮齿动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small rodents of the vole and lemming group (subfamily Arvicolinae), known for short tails and gnawing teeth; plural form of *arvicoline*.","zh":"田鼠与旅鼠类的小型啮齿动物（田鼠亚科 Arvicolinae）；*arvicoline* 的复数形式。"},"examples":[{"en":"Arvicolines are common prey for owls and foxes in northern habitats.","zh":"在北方栖息地里，田鼠与旅鼠类常常是猫头鹰和狐狸的主要猎物。"},{"en":"The study compared how different arvicolines survive cold winters.","zh":"这项研究比较了不同田鼠与旅鼠类如何度过寒冷的冬季。"}]}],"synonyms":["voles and lemmings","Arvicolinae"],"phonetic":"/ɑrˈvɪkəˌlaɪnz/","extraExplanation":["“Arvicolines”多用于生物学/生态学写作，是比较正式的分类学用词；日常英语里更常直接说“voles and lemmings（田鼠和旅鼠）”。","词源上来自拉丁语 *arvicola*（意为“田野的居住者/田鼠”），因此与田野环境、草地生态常有关联。"]}
{"word":"arvicolines","summary":{"en":"Arvicolines are rodents in the vole-and-lemming group (Arvicolinae).","zh":"Arvicolines 指田鼠亚科（田鼠、旅鼠、麝鼠等）的一类啮齿动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"small rodents in the vole-and-lemming group (members of the subfamily Arvicolinae), including voles, lemmings, and muskrats","zh":"田鼠—旅鼠类的小型啮齿动物（隶属田鼠亚科 Arvicolinae），包括田鼠、旅鼠和麝鼠"},"examples":[{"en":"Owls often hunt arvicolines such as voles in open fields.","zh":"猫头鹰常在开阔田野捕食田鼠等田鼠亚科动物。"},{"en":"The study compared the population cycles of several arvicolines in northern forests.","zh":"这项研究比较了北方森林中几种田鼠亚科动物的种群周期。"}]}],"synonyms":["voles","lemmings","muskrats (as a member of the group)"],"phonetic":"/ɑrˈvɪkəlaɪnz/","extraExplanation":["“arvicolines”来自分类学用语 Arvicolinae（田鼠亚科）的复数成员称呼，常见于动物学、生态学与野生动物研究语境中。日常英语里更常直接说 voles（田鼠）或 lemmings（旅鼠）。","词形提示：单数可说 an arvicoline（一个田鼠亚科动物）；复数 arvicolines。"]}
{"word":"arvicolous","summary":{"en":"Arvicolous describes animals that live in or are associated with vole-like grassy field habitats.","zh":"arvicolous 指生活在或偏好類似田鼠常見的草地、田野等棲地的（多用於生態/動物學）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"living in, relating to, or resembling the habitat of voles (typically grassy fields, meadows, or ground cover).","zh":"（動物等）生活在、與田野/草地等田鼠類棲地有關的；（棲地特徵）類似田鼠常見環境的。"},"examples":[{"en":"The biologist found an arvicolous rodent species thriving in wet meadows.","zh":"生物學家發現一種偏好田鼠類棲地的齧齒動物在潮濕草甸中繁盛。"},{"en":"Arvicolous mammals often build runways through dense grass.","zh":"偏田鼠類棲地的哺乳動物常在濃密草叢中踩出小徑。"}]}],"synonyms":["vole-associated","field-dwelling","grassland-dwelling"],"phonetic":"/ɑrˈvɪkələs/","extraExplanation":["這個字比較少見，多用於動物學/生態學描述。「arvicolous」源自拉丁文 arvi-（田野）+ -colous（居住於……的），與「Arvicola」（田鼠屬，字面義為「住在田野的」）同源。它通常不是指「像田鼠一樣」的外形，而是指「棲地/生活環境」的偏好。"]}
{"word":"arviculture","summary":{"en":"Arviculture means field-crop farming and the management of arable land; it’s a rare word today.","zh":"Arviculture 指大田作物的耕作与耕地管理；如今用得较少。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the science or practice of growing field crops and managing farmland; arable farming (agriculture focused on cultivated fields).","zh":"耕作学；田间作物栽培与农田管理（强调可耕地与大田作物的农业）。"},"examples":[{"en":"In the 1800s, books on arviculture explained how to rotate crops to keep the soil fertile.","zh":"在19世纪，耕作学的书籍会讲解如何轮作来保持土壤肥力。"},{"en":"The museum exhibit compared traditional arviculture with modern mechanized farming.","zh":"博物馆展览把传统耕作方式与现代机械化农业作了对比。"}]}],"synonyms":["arable farming","crop farming","tillage (context-dependent)","agriculture (broader)"],"phonetic":"/ˈɑrviˌkʌltʃɚ/","extraExplanation":["“arviculture”较少见，更常用的表达是“agriculture（农业）”“arable farming（旱作/耕地农业）”或“crop farming（作物种植）”。","词根来自拉丁语：arvum（田地）+ culture（耕作/培育）。因此它更强调“田地里的作物栽培”，而不包括畜牧等更广义的农业内容。"]}
{"word":"Arvid","summary":{"en":"Arvid is a Scandinavian male first name.","zh":"Arvid 是一个北欧常见的男性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A male given name, common in Scandinavia (especially Sweden and Norway).","zh":"男性名字，常见于北欧（尤其是瑞典、挪威）。"},"examples":[{"en":"Arvid is my colleague from Sweden.","zh":"Arvid 是我来自瑞典的同事。"},{"en":"We invited Arvid to join the study group.","zh":"我们邀请 Arvid 加入学习小组。"}]}],"phonetic":"/ˈɑrvɪd/","extraExplanation":["Arvid 通常被认为源自古北欧语名字元素，常被解释为与“鹰（arn）”和“森林/树（viðr）”相关，因此有人会把它理解为类似“森林之鹰”的含义（不同资料解释略有差异）。","在英语语境里，Arvid 多作为人名使用；书写时首字母大写。若你是在某本书、电影或游戏里看到 Arvid，它通常就是角色名，而不是普通词汇。"]}
{"word":"Arvida","summary":{"en":"Arvida is a Canadian place name (in Quebec), historically linked to aluminum production and now part of Saguenay.","zh":"Arvida 是加拿大魁北克省的地名，历史上与铝工业相关，现属萨格奈市的一部分。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A place name: Arvida, a planned industrial town in Quebec, Canada (now a borough of the city of Saguenay), historically known for aluminum production.","zh":"地名：Arvida（阿尔维达），加拿大魁北克省的一座规划型工业城镇（现为萨格奈市 Saguenay 的一个区），历史上以铝工业闻名。"},"examples":[{"en":"Arvida became closely associated with Canada’s aluminum industry.","zh":"Arvida 与加拿大的铝工业密切相关。"},{"en":"She visited Arvida while traveling through the Saguenay–Lac-Saint-Jean region.","zh":"她在游览萨格奈—拉克圣让地区时去过 Arvida。"}]}],"phonetic":"/ɑrˈviːdə/","extraExplanation":["Arvida 这个名字常被认为与创办相关产业的人名/缩写有关；它在20世纪早期作为“公司城镇”（company town）发展起来，城市规划和社区建设带有明显的工业背景。","在英语/法语语境中它通常作为专有名词使用，首字母大写；当地法语发音可能与英语发音略有差异。"]}
{"word":"Arvie","summary":{"en":"Arvie is usually used as a personal name (and sometimes a surname).","zh":"Arvie 通常用作人名（有时也作姓氏）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (first name), used for any gender but more often masculine; sometimes a nickname for names like Arvin, Arvid, or Arvel.","zh":"人名（名字），可用于任何性别但更常见于男性；有时是 Arvin、Arvid 或 Arvel 等名字的昵称/简称。"},"examples":[{"en":"Arvie introduced himself as the new student in our class.","zh":"Arvie 介绍自己是我们班的新同学。"},{"en":"People often ask Arvie how to spell his name.","zh":"大家常常问 Arvie 他的名字怎么拼。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"姓氏。"},"examples":[{"en":"Dr. Arvie will see you now.","zh":"Arvie 医生现在要见你。"}]}],"synonyms":["Arvin (related name)","Arvid (related name)","Arvel (related name)"],"phonetic":"/ˈɑrvi/","extraExplanation":["“Arvie”在英语里最常见的用法是作为人名或姓氏，因此在句子中通常需要大写。","它不是一个高频的常见词，所以在真实交流中别人可能会确认读音或拼写；你可以准备好回答：\"It’s A-R-V-I-E.\"","读音上通常是重音在第一个音节（AR-vie）。"]}
{"word":"Arvil","summary":{"en":"Arvil is usually a male first name.","zh":"Arvil 通常是一个男性英文名字。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A masculine given name (first name).","zh":"（男性）名字／名。"},"examples":[{"en":"Arvil moved to Chicago for work.","zh":"Arvil 为了工作搬到了芝加哥。"},{"en":"My grandfather’s name was Arvil.","zh":"我祖父名叫 Arvil。"}]}],"synonyms":["Arvel","Arville"],"phonetic":"ˈɑrvəl","extraExplanation":["Arvil 多见于英语姓名中，尤其在美国较常见，属于较传统、较少见的男性名。常被视为 Arvel、Arville 等名字的变体拼写。","如果你其实想查的是 anvil（“铁砧”），Arvil 可能是拼写误差；anvil 的读音与 Arvil 不同。"]}
{"word":"Arvilla","summary":{"en":"Arvilla is usually a feminine first name, and it can also be a U.S. place name.","zh":"Arvilla 通常是女性名字，也可作美国地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A feminine given name (first name).","zh":"女性名字（名）。"},"examples":[{"en":"Arvilla introduced herself at the meeting.","zh":"Arvilla 在会议上做了自我介绍。"},{"en":"Arvilla is an uncommon name today, but you may see it in older records.","zh":"Arvilla 如今不算常见，但你可能会在较早的档案里看到它。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name used in the United States for small communities or geographic locations.","zh":"美国的地名，用于一些小社区或地理地点。"},"examples":[{"en":"They drove through Arvilla on their way to Grand Forks.","zh":"他们去大福克斯（Grand Forks）的路上开车经过 Arvilla。"}]}],"phonetic":"/ɑrˈvɪlə/","extraExplanation":["Arvilla 多见于19世纪末到20世纪早期的英语姓名记录，属于“较传统/复古”的女性名。它的来源通常被认为与拉丁语词根有关：ar-（与耕作、田地相关的含义）+ villa（“乡间庄园、别墅”）。因此在含义联想上常给人“乡村庄园、田园气息”的感觉，但并不是所有使用者都会强调其词源含义。","作为地名时，Arvilla 常见于美国乡镇或未建制社区名称；具体指哪个地点需要结合州或县来确认。"]}
{"word":"Arvin","summary":{"en":"Arvin is usually a person’s first name; it can also be a place name (notably a city in California).","zh":"Arvin 通常是人名（名字）；也可作地名（尤其指加州的一个城市）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (first name), often masculine; used in various cultures and also in English-speaking countries.","zh":"人名（名字/名），常见为男性名；在多种文化中使用，也用于英语国家。"},"examples":[{"en":"Arvin is my classmate in English class.","zh":"Arvin 是我英语课的同学。"},{"en":"My brother’s name is Arvin.","zh":"我哥哥的名字叫 Arvin。"}]},{"partOfSpeech":"n.","definition":{"en":"a city name, most commonly referring to Arvin, a city in California, USA.","zh":"地名，最常见指美国加利福尼亚州的阿尔文（Arvin）市。"},"examples":[{"en":"She grew up in Arvin, California.","zh":"她在加州的 Arvin 长大。"},{"en":"We drove through Arvin on the way to Bakersfield.","zh":"我们去贝克斯菲尔德的路上开车经过 Arvin。"}]}],"synonyms":["(as a name) no true synonyms","(related names) Arvind, Alvin"],"phonetic":"/ˈɑr.vɪn/","extraExplanation":["“Arvin”作为人名在伊朗等地较常见，常被认为与波斯语来源有关，含义常被解释为“经历过的、受过考验的/有经验的”等（不同地区与资料解释可能略有差异）。","英语里人名通常不“翻译”意思；在正式写作中，注意首字母大写：Arvin。若用于称呼对方，可说：Hi, Arvin. / Nice to meet you, Arvin."]}
{"word":"Arvind","summary":{"en":"Arvind is a common Indian male first name used in English as a personal name.","zh":"Arvind 是常见的印度男性名，在英语中作为人名使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a masculine given name, common in India; in English contexts it is used as a person’s first name.","zh":"男性名字，常见于印度；在英语语境中用作人的名字（名）。"},"examples":[{"en":"Arvind is my coworker in the engineering team.","zh":"Arvind 是我工程团队的同事。"},{"en":"Please welcome Arvind to the stage.","zh":"请欢迎 Arvind 上台。"}]}],"phonetic":"/ˈɑr.vɪnd/","extraExplanation":["“Arvind”主要源自梵语/印度语言传统，常被解释为与“莲花（lotus）”有关，因莲花在南亚文化中象征纯洁与智慧。","作为专有名词（人名），英语里通常不翻译含义，而是直接按读音拼写与称呼。正式场合可用 Mr. + 姓氏；熟悉后可直接叫 Arvind。","发音提示：重音通常在第一音节 AR-，结尾的 d 清晰但不需要特别用力。"]}
{"word":"Arvo","summary":{"en":"“Arvo” most commonly means “afternoon” in informal Australian/New Zealand English; it can also be a Finnish male name.","zh":"“Arvo”最常见的意思是在澳大利亚/新西兰英语中指“下午”的口语说法；也可以是芬兰男性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, mainly Australian & New Zealand English) Afternoon.","zh":"（非正式，主要用于澳大利亚/新西兰英语）下午。"},"examples":[{"en":"Let’s meet this arvo for a coffee.","zh":"我们今天下午见面喝杯咖啡吧。"},{"en":"I’ll finish the report this arvo and send it to you.","zh":"我今天下午把报告写完发给你。"},{"en":"The kids have soccer practice in the arvo.","zh":"孩子们下午有足球训练。"}]},{"partOfSpeech":"n.","definition":{"en":"A male given name (common in Finland), sometimes used as a short form of names like Arvid/Arvo-related forms depending on language and family tradition.","zh":"男性名字（在芬兰较常见）；在某些语境中也可能作为其他相近名字的简称，取决于语言与家族习惯。"},"examples":[{"en":"Arvo is a traditional Finnish name.","zh":"Arvo 是一个传统的芬兰名字。"},{"en":"Arvo introduced himself and shook my hand.","zh":"Arvo 自我介绍并和我握手。"}]}],"synonyms":["afternoon","PM (informal)"],"phonetic":"/ˈɑrvoʊ/","extraExplanation":["“arvo”是“afternoon”的口语缩略，常见于澳大利亚/新西兰的日常聊天、短信或社交媒体：this arvo（今天下午）、tomorrow arvo（明天下午）。","它带有明显的澳新英语地域色彩；在其他英语地区使用时，可能需要补充说明或直接说“afternoon”。"]}
{"word":"arvo","summary":{"en":"Arvo is mainly used in English as a Finnish-origin male name; in Finnish it can also mean “value” (and informally “afternoon”).","zh":"Arvo 在英语中主要作为源自芬兰语的男性名字使用；在芬兰语里还可表示“价值”（口语中也可指“下午”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a male given name (from Finnish), seen in English mainly as a person’s name.","zh":"男性名字（源自芬兰语）；在英语里主要作为人名出现。"},"examples":[{"en":"Arvo Pärt is a famous Estonian composer.","zh":"阿尔沃·帕特是一位著名的爱沙尼亚作曲家。"},{"en":"I met someone named Arvo at the conference.","zh":"我在会议上认识了一个叫 Arvo 的人。"}]},{"partOfSpeech":"n.","definition":{"en":"(Finnish, not standard English) “value; worth.”","zh":"（芬兰语，非标准英语）“价值；值得的东西”。"},"examples":[{"en":"In Finnish, arvo can mean “value,” as in “human value.”","zh":"在芬兰语里，arvo 可以表示“价值”，例如“人的价值”。"},{"en":"They discussed the arvo of education in society. (Finnish-influenced usage)","zh":"他们讨论了教育在社会中的价值。（受芬兰语影响的用法）"}]},{"partOfSpeech":"n.","definition":{"en":"(Finnish, informal) “afternoon.”","zh":"（芬兰语，口语）“下午”。"},"examples":[{"en":"In Finnish, hyvää arvoa means “good afternoon.”","zh":"在芬兰语里，hyvää arvoa 的意思是“下午好”。"}]}],"synonyms":["(name) —","(Finnish ‘value’) value","worth"],"phonetic":"/ˈɑrvoʊ/","extraExplanation":["在英语语境中，Arvo 最常见的是人名，发音往往按英语习惯读作 /ˈɑrvoʊ/。","如果你是在芬兰文化/语言环境里看到 arvo，它更可能是普通名词，常指“价值”，在社会议题里也很常见（如“人的尊严与价值”）。","“下午”这个义项属于芬兰语口语用法；在英语写作中通常不会把 arvo 当作“下午”来用，除非是在引用芬兰语或营造地域风格。"]}
{"word":"Arvol","summary":{"en":"Arvol is an uncommon English-language personal name, used mainly as a masculine first name and sometimes as a surname.","zh":"Arvol 是一个较少见的英语人名，主要用作男性名，也有时用作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a masculine given name (first name), uncommon in modern English use","zh":"男性名字（名），在现代英语中较少见"},"examples":[{"en":"Arvol moved to Chicago for work.","zh":"Arvol 为了工作搬到了芝加哥。"},{"en":"My grandfather’s name was Arvol.","zh":"我祖父的名字叫 Arvol。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname) in some English-speaking communities","zh":"在一些英语社群中也可作为姓氏使用"},"examples":[{"en":"Ms. Arvol will join us for the meeting.","zh":"Arvol 女士将参加我们的会议。"}]}],"synonyms":["Arvel","Arvil","Arvo","Arvin"],"phonetic":"/ˈɑr.vəl/","extraExplanation":["“Arvol”在英语世界里相对少见，更多时候出现在人名记录中（尤其是美国的较老一代）。","它的来源并不十分固定；有时被认为与相近名字如 Arvel / Arvil / Arvo 有关联（拼写与发音在不同地区或家族中会变化）。","作为人名使用时，首字母通常大写：Arvol。"]}
{"word":"Arvonia","summary":{"en":"Arvonia is a proper name, most commonly referring to a small community in Virginia, USA, associated with slate quarrying.","zh":"Arvonia 是专有名词，最常指美国弗吉尼亚州的一个小社区，并与板岩采石业相关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a small unincorporated community in Buckingham County, Virginia, U.S., known for slate quarrying (often connected with the Buckingham Slate industry).","zh":"美国弗吉尼亚州白金汉县的一个非建制小社区，以板岩采石业闻名（常与“白金汉板岩”产业相关）。"},"examples":[{"en":"She grew up near Arvonia, Virginia, where slate roofs are common.","zh":"她在弗吉尼亚州的阿尔沃尼亚附近长大，那一带常见板岩屋顶。"},{"en":"The company sources roofing slate from the Arvonia area.","zh":"这家公司从阿尔沃尼亚一带采购屋顶用板岩。"}]}],"phonetic":"/ɑrˈvoʊniə/","extraExplanation":["“Arvonia”常见于美国地名语境，尤其指弗吉尼亚州白金汉县的社区。该地区与板岩采石历史联系紧密，因此在建筑材料（如屋顶板岩）相关话题中也会出现。","关于词源：有资料认为该地名可能受威尔士地名/词根影响（与威尔士北部的“Arfon/Arvon”相关），但不同来源的说法不完全一致；在写作中更稳妥的做法是把它当作专有地名使用。"]}
{"word":"Arvonio","summary":{"en":"“Arvonio” is most likely a proper name rather than a common English word; its meaning depends on where you found it.","zh":"“Arvonio”更可能是专有名词而非常见英文单词；含义需要结合出现的语境来确定。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (likely a personal name, username, brand name, or place name). It is not a standard, widely recognized English vocabulary word, so its meaning depends on context.","zh":"专有名词（很可能是人名、用户名、品牌名或地名）。它不是常见、标准的英文词汇，因此具体含义取决于语境。"},"examples":[{"en":"Arvonio posted the update in our group chat.","zh":"Arvonio 在我们的群聊里发布了更新。"},{"en":"I’m not sure what Arvonio refers to—could you share a sentence or where you saw it?","zh":"我不确定 Arvonio 指的是什么——你能提供一句原文或你在哪里看到的吗？"}]}],"synonyms":["(no direct synonyms; proper name)"],"phonetic":"ɑrˈvoʊnioʊ","extraExplanation":["“Arvonio”更像是专有名称而不是词典词汇：可能是人名/网名、公司或产品名、甚至是地名的拼写变体。若你告诉我它出现的场景（例如一段句子、网站/书名/游戏/社交平台），我可以更准确地解释含义、来源和常见用法。"]}
{"word":"arvos","summary":{"en":"“Arvos” is usually a proper name, not a common English word; its meaning depends on context.","zh":"“Arvos”通常是专有名词（人名/品牌等），不是常见英语词；具体含义需看语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (surname or given name). It is not a standard English vocabulary word, so its meaning depends on the person, place, brand, or context where you saw it.","zh":"专有名词（姓氏或名字）。它不是标准英语词汇，因此含义取决于你看到它时对应的人名、地名、品牌或具体语境。"},"examples":[{"en":"Arvos Johnson will speak at the meeting today.","zh":"Arvos Johnson 今天会在会议上发言。"},{"en":"I couldn’t find a dictionary meaning for “Arvos”; it may be a name or a brand.","zh":"我在词典里找不到 “Arvos” 的释义；它可能是名字或品牌。"}]}],"phonetic":"/ˈɑrvoʊz/","extraExplanation":["“Arvos”在英语里不常见，很多情况下是人名/姓氏的拼写。它也可能来自其他语言（例如芬兰语词根“arvo-”常与“价值/荣誉”等含义相关），但具体含义需要看你看到它的来源与上下文。","如果你能提供一句原文（例如广告、文章句子、标题或对话），我可以更准确判断它是名字、缩写、还是拼写错误（比如你是否想查的是“arrows”“Arvo’s”等）。"]}
{"word":"ARVs","summary":{"en":"ARVs usually means antiretroviral drugs used to treat HIV.","zh":"ARVs 通常指用于治疗 HIV 的抗逆转录病毒药物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Antiretroviral drugs; medicines used to treat HIV by stopping the virus from making copies of itself (often used as a plural noun).","zh":"抗逆转录病毒药物；用于治疗 HIV（艾滋病病毒感染）的药物，通过抑制病毒复制来控制病情（常用复数形式）。"},"examples":[{"en":"Many people with HIV take ARVs every day to keep the virus under control.","zh":"许多 HIV 感染者每天服用 ARVs 来控制病毒。"},{"en":"The clinic provides ARVs and regular checkups.","zh":"诊所提供 ARVs 并安排定期复查。"},{"en":"Missing doses of ARVs can make treatment less effective.","zh":"漏服 ARVs 可能会降低治疗效果。"}]},{"partOfSpeech":"n.","definition":{"en":"All-road vehicles (a less common meaning; sometimes used informally).","zh":"全地形/多路况车辆（较少见的含义；有时为非正式用法）。"},"examples":[{"en":"They rented ARVs to drive on dirt roads and rocky paths.","zh":"他们租了 ARVs 来走土路和碎石路。"}]}],"synonyms":["antiretrovirals","antiretroviral drugs","HIV meds","ART medications"],"phonetic":"ˌeɪ ɑr ˈviːz","extraExplanation":["在公共卫生语境中，ARVs 通常指 antiretrovirals（抗逆转录病毒药物）。也常与 ART（antiretroviral therapy，抗逆转录病毒治疗）一起出现：ART 指“治疗方案/治疗过程”，ARVs 更强调“药物本身”。","发音多按字母读：A-R-Vs。由于与 HIV 相关，交流时注意隐私与尊重（如避免在不必要场合公开他人用药情况）。"]}
{"word":"Arvy","summary":{"en":"Arvy is most commonly used as a personal name or nickname; it can also be an online handle with person-specific meaning.","zh":"Arvy 最常见用法是人名或昵称；也可能是网络用户名/品牌名，含义因人而异。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name or nickname (often a variant spelling of Arvie/Arvin, and sometimes used as a nickname for names like Harvey in casual contexts).","zh":"人名或昵称（常见为 Arvie/Arvin 的变体拼写；在口语里有时也会被当作 Harvey 等名字的昵称用法）。"},"examples":[{"en":"Arvy is a nickname his friends use at school.","zh":"Arvy 是他在学校里朋友们叫他的昵称。"},{"en":"My cousin Arvy moved to California last year.","zh":"我表哥 Arvy 去年搬到加州了。"}]},{"partOfSpeech":"other","definition":{"en":"(rare, informal) a brand- or username-style spelling used online; meaning depends on the person or account.","zh":"（较少见，非正式）网络上常见的“账号名/品牌名式”拼写；具体含义取决于使用者。"},"examples":[{"en":"ArvyGaming is the name of his YouTube channel.","zh":"ArvyGaming 是他的 YouTube 频道名。"},{"en":"She signs her art posts as Arvy.","zh":"她在艺术贴文里用 Arvy 署名。"}]}],"synonyms":["Arvie","Arvin","Harvey (nickname context)"],"phonetic":"/ˈɑrvi/","extraExplanation":["“Arvy”在英语里不是常见词汇，更常见的是作为姓名/昵称出现，因此通常不在标准词典里列为普通单词。","如果你是在句子里看到“Arvy”，最可靠的判断方法是看它是否大写、是否指代某个人或账号名。","可能的相关名字（更常见）：Arvie, Arvin, Harvey。"]}

