{"word":"ary","summary":{"en":"“-ary” is a common English suffix used to form words meaning “related to” (adjectives) or “a place/person connected with” (nouns).","zh":"“-ary”是英语常见后缀：可构成表示“与……有关”的形容词，也可构成表示“……的场所/相关的人”的名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(suffix) Used to form adjectives meaning “related to” or “connected with.”","zh":"（后缀）用于构成形容词，表示“与……有关的 / ……方面的”。"},"examples":[{"en":"military = related to the army","zh":"military = 与军队有关的"},{"en":"budgetary issues affect every department.","zh":"预算方面的问题会影响每个部门。"}]},{"partOfSpeech":"other","definition":{"en":"(suffix) Used to form nouns meaning “a place for” or “a person connected with.”","zh":"（后缀）用于构成名词，表示“……的场所”或“与……有关的人”。"},"examples":[{"en":"library = a place for books","zh":"library = 放书/借书的地方（图书馆）"},{"en":"aviary = a place for birds","zh":"aviary = 养鸟/关鸟的地方（鸟舍、鸟园）"}]}],"phonetic":"/ˌɛri/","extraExplanation":["“-ary”常见来源之一是拉丁语后缀“-arius”，很多英语单词通过法语进入英语后形成“-ary”。因此它在拼写上很常见，但发音会因单词而变：如 dictionary /ˈdɪkʃəˌnɛri/，primary /ˈpraɪˌmɛri/。学习时更建议按“整词”记读音，而不是只凭后缀推读音。"]}
{"word":"Arya","summary":{"en":"Arya is a personal name; in some South Asian contexts it is linked to a root meaning “noble,” and many people recognize it from the character Arya Stark.","zh":"Arya 是一个人名；在部分南亚语境中与“高贵/尊贵”的词根相关，许多人也因《权力的游戏》角色 Arya Stark 而熟悉它。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (used for any gender, but often feminine in modern English-speaking contexts). It is used in several cultures and is commonly understood as a personal name.","zh":"人名（可用于任何性别，但在现代英语语境中常更偏女性）。在多种文化中使用，英语里通常被理解为一个名字。"},"examples":[{"en":"Arya introduced herself at the beginning of the meeting.","zh":"Arya 在会议开始时做了自我介绍。"},{"en":"Do you know how to spell Arya?","zh":"你知道 Arya 怎么拼吗？"}]},{"partOfSpeech":"n.","definition":{"en":"(South Asian usage) a name related to Sanskrit/Indo-Iranian roots meaning “noble” or “honorable.”","zh":"（南亚语境）与梵语/印伊语系词根相关的名字，常被解释为“高贵的、值得尊敬的”。"},"examples":[{"en":"They chose the name Arya because it carries the sense of “noble.”","zh":"他们选了 Arya 这个名字，因为它带有“高贵”的含义。"}]},{"partOfSpeech":"n.","definition":{"en":"a well-known fictional character name, especially Arya Stark from *Game of Thrones*.","zh":"知名虚构人物名，尤其指《权力的游戏》中的 Arya Stark（艾莉亚·史塔克）。"},"examples":[{"en":"Arya is one of the most popular characters in *Game of Thrones*.","zh":"Arya 是《权力的游戏》中最受欢迎的角色之一。"},{"en":"She dressed up as Arya Stark for Halloween.","zh":"她万圣节装扮成 Arya Stark。"}]}],"synonyms":["Aria (similar-looking name)","Ariya (variant spelling)"],"phonetic":"/ˈɑr.jə/","extraExplanation":["在英语里，Arya 有时会被和 **Aria**（/ˈɑːriə/，常指“咏叹调”或女生名）混淆；两者拼写和含义都不同。","在不同文化中，Arya 的性别使用可能不同；在当代英语流行文化影响下，很多人会首先联想到《权力的游戏》里的 Arya。"]}
{"word":"arya","summary":{"en":"Arya is a personal name; it can also refer to the famous character Arya Stark from Game of Thrones.","zh":"Arya 是一个人名；也常指《权力的游戏》中的知名角色艾莉亚·史塔克。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (usually feminine) used in several cultures; in South Asia it is often linked to Sanskrit/Persian roots meaning “noble” or “honorable.”","zh":"一个人名（多为女性名），在多种文化中使用；在南亚语境里常与梵语/波斯语词源相关，含义常被解释为“高贵的、尊贵的”。"},"examples":[{"en":"Arya is a popular baby name in many countries today.","zh":"Arya 是当今许多国家都很受欢迎的宝宝名字。"},{"en":"Her name, Arya, means “noble” in some traditions.","zh":"在一些传统中，她的名字 Arya 被解释为“高贵”。"}]},{"partOfSpeech":"n.","definition":{"en":"a well-known fictional character name, especially Arya Stark from the TV series and novels Game of Thrones / A Song of Ice and Fire.","zh":"一个知名的虚构角色名，尤指电视剧《权力的游戏》及小说《冰与火之歌》中的艾莉亚·史塔克（Arya Stark）。"},"examples":[{"en":"Arya is one of my favorite characters in Game of Thrones.","zh":"Arya 是我在《权力的游戏》里最喜欢的角色之一。"},{"en":"People sometimes choose the name Arya because of the character.","zh":"有些人会因为这个角色而选择取名 Arya。"}]}],"synonyms":["Aria (similar sound, different meaning)"],"phonetic":"/ˈɑːrjə/","extraExplanation":["“Arya”在英语里通常作为专有名词使用（人名），首字母大写：Arya。","不要和“aria”（咏叹调）混淆：aria 是音乐术语，发音相近但含义完全不同。","在不同语言与文化里，“Arya/Ārya”可能有不同的性别使用习惯与含义来源；在现代英语语境中，多被当作中性或偏女性的名字。"]}
{"word":"Aryaman","summary":{"en":"Aryaman is the name of a Vedic/Hindu deity linked to friendship and hospitality, and it’s also used as a modern male given name (especially in South Asia).","zh":"Aryaman（阿梨耶曼）既是吠陀/印度教中的神名（与友谊、待客之道等相关），也常被用作现代男性人名（尤见于南亚）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Hinduism, especially early Vedic tradition) a deity associated with friendship, hospitality, social bonds, and sometimes the Sun as one of the Ādityas.","zh":"（印度教，尤指早期吠陀传统）一位与友谊、待客之道、社会纽带相关的神祇；有时也作为太阳神系的一员，被视为“阿底提耶”（Ādityas）之一。"},"examples":[{"en":"In the Rigveda, Aryaman is invoked as a protector of friendship and social order.","zh":"在《梨俱吠陀》中，人们祈请阿梨耶曼守护友谊与社会秩序。"},{"en":"Some texts list Aryaman among the Adityas, a group of solar-associated deities.","zh":"一些文献把阿梨耶曼列为阿底提耶之一——一组与太阳相关的神祇。"}]},{"partOfSpeech":"n.","definition":{"en":"A male given name used mainly in South Asia, drawn from the name of the Vedic deity.","zh":"男性名字，主要见于南亚地区，源自同名吠陀神祇。"},"examples":[{"en":"Aryaman is a common modern name in India.","zh":"Aryaman 是印度常见的现代人名。"},{"en":"His parents chose the name Aryaman for its meaning of loyalty and friendship.","zh":"他的父母选择 Aryaman 这个名字，是因为它带有忠诚与友谊的寓意。"}]}],"synonyms":["Vedic deity","Aditya (category)","Hindu god (general)"],"phonetic":"ˈɑrjəmən","extraExplanation":["“Aryaman”来自梵语传统，英文学术写作中常直接用此转写，也可能见到写作“Āryaman”。在不同资料里，他的职能会有侧重差异：有的强调“盟友/伙伴关系与款待宾客”的规范，有的则把他放进与太阳、宇宙秩序相关的神祇体系（Ādityas）中。","学习阅读时可留意语境：在宗教/神话讨论中多指神名；在新闻、社交媒体或人物介绍中通常就是人名。"]}
{"word":"Aryan","summary":{"en":"“Aryan” most safely means “Indo-Iranian” in linguistics/history, but it is also a term heavily misused in racist ideology (especially Nazi), so context matters.","zh":"“Aryan”在语言学/历史中多指“印度-伊朗（语族/人群）”，但也曾被纳粹等种族主义意识形态严重滥用，因此必须看语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(in linguistics/history) relating to or describing the Indo-Iranian peoples and languages (especially ancient peoples of Iran and northern India).","zh":"（语言学/历史）指与印欧语系中“印度-伊朗语族”（尤其古代伊朗与北印度地区的人群与语言）有关的。"},"examples":[{"en":"In some textbooks, “Aryan” is used as an older term for the Indo-Iranian branch of Indo-European languages.","zh":"在一些教材里，“Aryan”被当作较旧的说法，用来指印欧语系中的“印度-伊朗语族”。"},{"en":"Ancient Sanskrit and Avestan are often discussed in connection with early Aryan culture.","zh":"古代梵语和阿维斯陀语常常与早期“雅利安”文化一起讨论。"}]},{"partOfSpeech":"n.","definition":{"en":"a person belonging to the ancient Indo-Iranian peoples; sometimes used in older writing to mean an Indo-Iranian speaker.","zh":"（历史用语）古代印度-伊朗人之一；在较旧的著作中也可指说印度-伊朗语的人。"},"examples":[{"en":"The article compares what we can know about early Aryans from language and archaeology.","zh":"这篇文章比较了我们能从语言与考古学中了解的早期雅利安人。"}]},{"partOfSpeech":"adj.","definition":{"en":"(often offensive or misleading) used in racist ideology—especially Nazi ideology—to mean a so-called “racially superior” white person.","zh":"（常具冒犯性/误导性）在种族主义思想（尤指纳粹意识形态）中被用来指所谓“更优越的白人种族”。"},"examples":[{"en":"The museum explains how the Nazis misused the word “Aryan” to promote racism.","zh":"博物馆解释了纳粹如何滥用“Aryan”一词来宣扬种族主义。"},{"en":"Be careful: “Aryan” in this sense is tied to hate speech and extremist groups.","zh":"请注意：这种用法与仇恨言论和极端组织有关。"}]}],"synonyms":["Indo-Iranian","Indo-Iranian languages","Indo-Iranian peoples"],"phonetic":"/ˈɛriən/","extraExplanation":["“Aryan”来自古印度语和古伊朗语中表示“高贵/自己人”的词根（如梵语 ā́rya-）。在现代学术语境中更推荐使用更精确的术语“Indo-Iranian（印度-伊朗）”，因为“Aryan”在19–20世纪被误用并被纳粹种族主义严重污染。","如果你在历史或语言学文章里看到“Aryan”，通常是在讨论古代印度-伊朗语族；若出现在政治宣传、身份标签或极端组织语境中，则很可能是带有种族主义色彩，需要高度警惕。"]}
{"word":"aryan","summary":{"en":"“Aryan” mainly has a historical/linguistic meaning (Indo-Iranian peoples/languages), but it is also strongly associated with Nazi racist ideology in a harmful, offensive sense.","zh":"“Aryan”主要有历史/语言学含义（印伊人群与语言），但也与纳粹种族主义的有害、冒犯性用法强相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the ancient Indo-Iranian peoples and languages (especially early Iranian and North Indian groups).","zh":"（语言学/历史）指古代“印伊人/印伊语族”（尤其与早期伊朗与北印度相关的民族与语言）。"},"examples":[{"en":"In historical linguistics, “Aryan” can refer to early Indo-Iranian languages.","zh":"在历史语言学中，“Aryan”可以指早期的印伊语系语言。"},{"en":"Some ancient texts used the term to describe certain groups in the region.","zh":"一些古代文献用这个词来描述该地区的某些群体。"}]},{"partOfSpeech":"n.","definition":{"en":"A person belonging to the ancient Indo-Iranian groups (a historical/academic use).","zh":"（历史/学术用法）指古代印伊人群的一员。"},"examples":[{"en":"The museum exhibit discussed the migrations of early Aryans in South Asia.","zh":"博物馆展览讨论了早期印伊人在南亚的迁徙。"}]},{"partOfSpeech":"n.","definition":{"en":"A term used in Nazi racial ideology to mean a supposed “white” or “Nordic” race; this use is widely considered offensive and scientifically incorrect.","zh":"（纳粹种族主义用语）用来指所谓“白人/北欧人种”的概念；这种用法被广泛认为冒犯且不符合科学。"},"examples":[{"en":"Nazi propaganda misused the word “Aryan” to promote racist ideas.","zh":"纳粹宣传滥用了“Aryan”一词来鼓吹种族主义观念。"},{"en":"Many writers avoid this sense because of its hateful historical associations.","zh":"许多作者会避免这种含义，因为它与仇恨历史紧密相关。"}]}],"synonyms":["Indo-Iranian","Indo-Aryan (language branch)"],"phonetic":"ˈɛriən","extraExplanation":["这个词在学术语境（语言学、古代史）里常与“印伊语族/印伊人群”有关；但在20世纪被纳粹意识形态扭曲为种族概念，因此在日常英语里很敏感。写作或交流中，若你想表达“印伊语族”，更安全清晰的说法通常是 Indo-Iranian 或 Indo-Aryan（指印度-雅利安语支），并明确是语言/历史语境。","词源上与古代自称 *arya*（大意为“高贵/自己人”）有关，但现代“种族”意义并非原本学术含义。"]}
{"word":"Aryanise","summary":{"en":"Aryanise means to forcibly make something “Aryan,” especially the Nazi-era practice of taking Jewish property or businesses and transferring them to non-Jewish owners.","zh":"Aryanise 指“雅利安化”，尤其是纳粹时期强制剥夺犹太人财产/企业并转移给非犹太人所有的做法。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something or someone “Aryan,” especially (historically) by forcing Jewish-owned businesses or property to be transferred to non-Jewish owners under Nazi rule; also spelled “Aryanize.”","zh":"使某物或某人成为“雅利安”（尤其指历史上纳粹统治时期，通过强制将犹太人拥有的企业或财产转移给非犹太人来进行所谓“雅利安化”；也拼作 Aryanize）。"},"examples":[{"en":"During the Nazi era, many Jewish businesses were forcibly Aryanised.","zh":"在纳粹时期，许多犹太人企业被强制“雅利安化”。"},{"en":"The book describes how laws were used to Aryanise property and exclude Jews from public life.","zh":"这本书描述了法律如何被用来“雅利安化”财产，并将犹太人排除出公共生活。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something match a racist ideology about “Aryans” (a usage now mainly found in historical writing or criticism).","zh":"使某事物符合关于“雅利安人”的种族主义意识形态（这种用法如今主要见于历史叙述或批判性语境）。"},"examples":[{"en":"Propaganda tried to Aryanise national culture by rewriting history.","zh":"宣传试图通过改写历史来“雅利安化”国家文化。"}]}],"synonyms":["Aryanize","expropriate (in this context)","confiscate (in this context)"],"phonetic":"/ˈɛriənaɪz/","extraExplanation":["该词高度带有历史与意识形态色彩，最常与纳粹德国的“Arisierung（雅利安化）”政策相关：通过威胁、法律与暴力手段剥夺犹太人的财产与生计。现代英语中多用于历史研究、纪实写作或批判性讨论，日常场合很少使用。","拼写上，英式英语常见 -ise（Aryanise），美式英语更常见 -ize（Aryanize）。"]}
{"word":"Aryanised","summary":{"en":"Aryanised means “made ‘Aryan’,” most often referring to Nazi-era forced transfer of Jewish-owned property or institutions to non-Jewish control.","zh":"Aryanised 意为“被雅利安化的”，最常指纳粹时期将犹太人财产或机构强制转移给非犹太人控制。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(historical, Nazi-era) Transferred from Jewish ownership or control to “Aryan” (non-Jewish) ownership—especially businesses, property, jobs, or cultural institutions.","zh":"（历史用语，纳粹时期）被“雅利安化”的：指把原由犹太人拥有或控制的企业、财产、职位或文化机构，强行转移给所谓“雅利安人”（非犹太人）拥有或控制。"},"examples":[{"en":"During the 1930s, many Jewish-owned shops were Aryanised under Nazi policies.","zh":"在20世纪30年代，许多犹太人经营的商店在纳粹政策下被“雅利安化”。"},{"en":"The museum’s collection was partly Aryanised and later became the subject of restitution claims.","zh":"这家博物馆的部分馆藏曾被“雅利安化”，后来引发了归还（追索）诉求。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) Made to seem “Aryan” or aligned with the idea of an “Aryan” identity; rebranded or reshaped to fit that ideology.","zh":"（较少见）被塑造成“雅利安”形象的；为迎合“雅利安”身份观念而被重新包装或改造的。"},"examples":[{"en":"Some place names were changed to create an Aryanised version of local history.","zh":"有些地名被更改，以塑造一种“雅利安化”的地方历史叙事。"}]}],"synonyms":["Aryanized","expropriated (context-dependent)","confiscated (context-dependent)","seized (context-dependent)"],"phonetic":"/ˈɛriəˌnaɪzd/","extraExplanation":["“Aryanised”（也常拼作 Aryanized）来自动词 Aryanise/Aryanize。该词与纳粹种族主义意识形态密切相关，带有强烈的历史与道德负担；在现代语境中通常用于历史研究、法律追索（如财产返还/赔偿）或纪实写作。","纳粹语境中的“雅利安化”（German: Arisierung）常指通过胁迫、歧视性法规与低价强买等方式，将犹太人的经济与社会地位系统性剥夺并转移给非犹太人。"]}
{"word":"Aryanising","summary":{"en":"**Aryanising** means making something “Aryan,” and historically refers to Nazi policies of forcing Jewish property and businesses into non‑Jewish hands.","zh":"**Aryanising** 指将某物“雅利安化”；在历史语境中常特指纳粹强制把犹太人的财产与企业转给非犹太人的政策。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"present participle of **Aryanise/Aryanize**: to make something or someone “Aryan,” or to claim they are Aryan (often by changing names, identity, or classification).","zh":"**Aryanise/Aryanize** 的现在分词：使某物/某人成为“雅利安人的”，或宣称其为雅利安人（常通过改名、改变身份或重新分类）。"},"examples":[{"en":"The regime tried to **Aryanising** the school curriculum by removing minority voices.","zh":"该政权试图通过删除少数族裔声音来**将学校课程“雅利安化”**。"},{"en":"Some officials focused on **Aryanising** surnames to make them sound more “acceptable.”","zh":"一些官员把重点放在**把姓氏“雅利安化”**，使其听起来更“可接受”。"}]},{"partOfSpeech":"v.","definition":{"en":"(historical, Nazi Germany) the forced transfer of Jewish-owned businesses, homes, or assets to non‑Jewish (“Aryan”) owners; a form of state-sponsored theft and persecution.","zh":"（历史用语，纳粹德国）强制将犹太人拥有的企业、住房或资产转移给非犹太（“雅利安”）所有者；一种由国家推动的掠夺与迫害。"},"examples":[{"en":"The family lost their shop during the **Aryanising** of local businesses.","zh":"在对本地企业进行**“雅利安化”掠夺**时，这家人失去了他们的商店。"},{"en":"Historians document how **Aryanising** policies enriched some citizens at the expense of Jewish communities.","zh":"历史学家记录了**“雅利安化”政策**如何以牺牲犹太社区为代价让一些公民获利。"}]}],"synonyms":["Aryanizing","Aryanisation","Aryanization","Germanisation (context-dependent)","assimilation (context-dependent)"],"phonetic":"/ˈɛriənaɪzɪŋ/","extraExplanation":["“Aryanising/Aryanization（雅利安化）”与纳粹意识形态密切相关，常出现在二战与大屠杀研究语境中。它不仅指文化或身份层面的“同化/改造”，更常特指对犹太人财产的系统性剥夺与强制转让，因此带有强烈的历史伤痛与道德负担。","现代英语写作中如果只是想表达“同化、去少数化、文化清洗”，通常会选择更中性的词（如 assimilation, cultural erasure, ethnic cleansing 等，视语境而定），以避免不必要的纳粹联想。"]}
{"word":"Aryanism","summary":{"en":"Aryanism is a racist ideology claiming an “Aryan” race is superior, strongly linked to Nazi and white supremacist beliefs.","zh":"Aryanism（雅利安主义）是一种宣称“雅利安人”优越的种族主义意识形态，常与纳粹与白人至上主义相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a racist ideology that claims an “Aryan” (often imagined as Northern European) race is superior to other peoples; strongly associated with Nazi ideology and white supremacy","zh":"一种种族主义意识形态，宣称“雅利安人”（常被想象为北欧/日耳曼人）优于其他族群；与纳粹意识形态和白人至上主义密切相关"},"examples":[{"en":"Aryanism was used to justify discrimination and violence in Nazi Germany.","zh":"在纳粹德国，“雅利安主义”被用来为歧视与暴力辩护。"},{"en":"Many museums and textbooks discuss Aryanism as an example of pseudoscientific racism.","zh":"许多博物馆和教材把“雅利安主义”作为“伪科学种族主义”的案例来讨论。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) the belief or movement promoting an “Aryan” identity, sometimes used loosely in extremist propaganda","zh":"（较少见）宣扬“雅利安”身份的信念或运动；有时在极端主义宣传中被泛用"},"examples":[{"en":"Online platforms sometimes ban groups promoting Aryanism because of hate speech.","zh":"一些网络平台会封禁宣扬雅利安主义的团体，因为其涉及仇恨言论。"}]}],"synonyms":["white supremacy","Nazi racial ideology","racist ideology","pseudoscientific racism"],"phonetic":"/ˈer.i.əˌnɪz.əm/","extraExplanation":["“Aryan”一词在语言学/历史学里原本与“印度-伊朗语族”或“印度-雅利安语”（Indo-Aryan）等概念有关，指某些古代语言与族群的自称或学术分类；但在19—20世纪被种族主义者错误挪用，把它扭曲成“北欧白人优越”的说法。","在严肃写作中，如果是指纳粹或白人至上主义语境，常用“racist ideology / white supremacist ideology”等更清晰的表述，并说明其为“pseudoscientific”（伪科学）以避免误解。","拼写易混：Aryanism（雅利安主义，种族主义语境常见）≠ Arianism（阿里乌派/阿里乌主义，基督教早期神学争论，与种族无关）。"]}
{"word":"aryanism","summary":{"en":"Aryanism is a racist ideology claiming “Aryan” superiority, strongly associated with Nazi and white-supremacist thinking.","zh":"Aryanism 指宣称“雅利安人”优越的种族主义意识形态，常与纳粹及白人至上主义相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a set of racial ideas claiming that “Aryans” (often defined as white or Northern European people) are superior to other groups; historically linked to white supremacy and Nazi ideology","zh":"一种种族主义思想体系，宣称“雅利安人”（常被错误地等同于白人或北欧/日耳曼人）优于其他群体；在历史上与白人至上主义和纳粹意识形态密切相关"},"examples":[{"en":"Aryanism was used to justify discrimination and violence.","zh":"“雅利安主义”曾被用来为歧视与暴力辩护。"},{"en":"Many historians explain how Nazi Aryanism shaped propaganda and policy.","zh":"许多历史学者解释纳粹的“雅利安主义”如何影响宣传与政策。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a mistaken or simplified use of “Aryan” ideas taken from early language and history studies, especially when people confuse a linguistic term with a racial category","zh":"（较少见）对“雅利安”概念的误用或简化，常源于早期语言学/历史研究；尤其指把语言学术语错误地当作种族类别"},"examples":[{"en":"Some people repeat Aryanism without realizing that “Aryan” originally referred to language and ancient self-identification, not a modern “race.”","zh":"有些人传播“雅利安主义”，却没意识到“Aryan”最初与语言和古代自称有关，并非现代意义上的“种族”。"}]}],"synonyms":["white supremacy","Nazi racial ideology","racial supremacy"],"phonetic":"/ˈer.i.əˌnɪz.əm/","extraExplanation":["“Aryan”一词在学术语境中常与“印欧语系/印伊语支”等语言与古代历史相关；但在19—20世纪，欧洲一些思想家将其扭曲为“种族”概念，发展出种族等级论。","纳粹德国把“雅利安”与“日耳曼/北欧”身份绑定，用作排斥与迫害的工具；因此在现代公共语境中，Aryanism通常被视为极端主义与仇恨意识形态。","使用该词时需注意语境：在讨论历史、意识形态或批判种族主义时更常见；若只是谈语言学或古代史，通常不使用Aryanism，而会说Indo-Iranian / Indo-European 等更准确的术语。"]}
{"word":"Aryanization","summary":{"en":"Aryanization is a historical term for the Nazi process of taking Jewish property and removing Jews from economic and public life by transferring assets to non-Jews.","zh":"Aryanization（雅利安化）指纳粹时期通过强迫转让与掠夺，使犹太人失去财产、职位与社会经济地位，并将资产转交给非犹太人的历史过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) The Nazi policy and practice of forcing Jews to give up businesses, property, and jobs, transferring them to “Aryan” (non-Jewish) Germans; also, the process of making an institution or area officially “non-Jewish.”","zh":"（历史）纳粹德国强迫犹太人交出企业、财产与职位，并将其转移给被称为“雅利安”（非犹太）德国人的政策与做法；也指将某机构或领域“去犹太化/改为非犹太”之过程。"},"examples":[{"en":"Aryanization led to the confiscation and forced sale of many Jewish-owned businesses in the 1930s.","zh":"“雅利安化”导致许多犹太人拥有的企业在20世纪30年代被没收或被迫贱卖。"},{"en":"The museum’s exhibit explains how Aryanization worked through laws, intimidation, and paperwork.","zh":"博物馆的展览说明了“雅利安化”如何通过法律、恐吓与文书流程来实施。"}]},{"partOfSpeech":"n.","definition":{"en":"(broader, less common) Any forced or deliberate attempt to remove Jewish influence or ownership from an organization or cultural life, especially in Nazi-controlled territories.","zh":"（更广义，较少见）任何强制或刻意从组织或文化生活中清除犹太人影响或所有权的做法，尤指纳粹控制地区。"},"examples":[{"en":"In occupied territories, Aryanization was used to reshape local economies and public life.","zh":"在被占领地区，“雅利安化”被用来重塑当地经济与公共生活。"}]}],"synonyms":["expropriation","confiscation","forced transfer","dispossession"],"phonetic":"/ˌɑːriənaɪˈzeɪʃən/","extraExplanation":["“Aryanization”是与大屠杀（Holocaust）背景紧密相关的历史术语，带有强烈的暴力、迫害与掠夺含义；在写作或讨论时通常需要清楚标注其历史语境，避免被误用为中性词。","这里的“Aryan（雅利安）”是纳粹意识形态中的种族概念，并非语言学/历史学中“Indo-Aryan（印度-雅利安语族）”或“伊朗-雅利安”等学术用法。","相关搭配常见：Aryanization of property/businesses（对财产/企业的“雅利安化”）、forced sale（被迫出售）、expropriation/confiscation（征收/没收）。"]}
{"word":"aryanization","summary":{"en":"Aryanization is the Nazi-era forced transfer of Jewish-owned property and businesses to non-Jewish (“Aryan”) owners.","zh":"“雅利安化”指纳粹时期强制将犹太人财产与企业转移给非犹太人（所谓“雅利安人”）的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Nazi policy and process (especially in 1930s–1940s Germany and annexed territories) of forcing Jewish people and other targeted groups to give up ownership/control of businesses, property, and jobs, transferring them to so‑called “Aryan” (non‑Jewish) Germans—often through coercion and violence.","zh":"“雅利安化”：纳粹在20世纪30—40年代德国及其占领区推行的政策与过程，强迫犹太人及其他被迫害群体放弃企业、财产与职位的所有权/控制权，把它们转移给所谓“雅利安人”（非犹太的德国人），常伴随胁迫与暴力。"},"examples":[{"en":"After 1938, many Jewish-owned shops were taken over through aryanization.","zh":"1938年后，许多犹太人经营的商店在“雅利安化”过程中被接管。"},{"en":"The museum exhibition explains how aryanization reshaped local economies and ruined families.","zh":"博物馆展览解释了“雅利安化”如何改变当地经济并摧毁许多家庭。"}]}],"synonyms":["forced transfer","expropriation","confiscation","dispossession"],"phonetic":"/ˌɛri.ə.naɪˈzeɪ.ʃən/","extraExplanation":["这是一个高度历史化、带有强烈暴力与种族主义背景的术语，主要用于学术研究、历史叙述与纪念语境。日常表达中不宜随意使用，以免造成伤害或误解。","词源上来自“Aryan（雅利安人）+ -ization（……化）”。纳粹将“雅利安”作为伪科学的种族分类，用来排斥与迫害犹太人等群体；该概念在现代学术与公共话语中通常以批判、反思的方式提及。"]}
{"word":"Aryanize","summary":{"en":"Aryanize means to make something “Aryan,” especially the Nazi-era practice of removing Jews and transferring their property or roles to non-Jews.","zh":"Aryanize 指“雅利安化”，尤指纳粹时期将犹太人排除并把其财产或社会角色转移给非犹太人的做法。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(historical) To force a person, organization, or property to become “Aryan,” especially under Nazi policy by removing Jews and transferring Jewish-owned businesses, jobs, or cultural roles to non-Jews.","zh":"（历史用语）使某人/机构/财产被迫“雅利安化”，尤指纳粹政策下将犹太人排除出经济与社会生活，并把犹太人拥有的企业、职位或文化角色转移给非犹太人。"},"examples":[{"en":"During the 1930s, many Jewish-owned shops in Germany were forcibly Aryanized.","zh":"在20世纪30年代，德国许多犹太人经营的商店被强制“雅利安化”。"},{"en":"The museum’s records show how collections were Aryanized through coercion and confiscation.","zh":"博物馆的档案显示，馆藏如何在胁迫与没收中被“雅利安化”。"}]}],"synonyms":["expropriate (in this context)","confiscate","seize","forcibly transfer","purge (from positions)"],"phonetic":"/ˈɛriəˌnaɪz/","extraExplanation":["这是一个强烈带有历史与政治色彩的词，主要与纳粹德国对犹太人的系统性迫害相关，因此在现代英语中多用于历史研究、档案叙述或批判性语境，日常交流中很少使用。","词源上来自“Aryan（雅利安）+ -ize（使成为……）”。需要注意，“Aryan”在纳粹意识形态里被扭曲为所谓“种族”概念；在语言学/历史学里它本指印欧语系中某些古代族群与语言传统，含义不同。"]}
{"word":"aryanize","summary":{"en":"A historical verb meaning to forcibly transfer Jewish-owned property to non-Jewish (“Aryan”) owners under Nazi rule.","zh":"一个历史动词，指在纳粹统治下强迫将犹太人财产转给非犹太人（所谓“雅利安人”）所有。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(historical, Nazi Germany) to force a business, organization, or property owned by Jews (or other targeted groups) to be transferred to “Aryan” (non-Jewish) ownership, often under coercion and at unfair prices.","zh":"（历史用语，纳粹德国）指强迫犹太人（或其他被迫害群体）拥有的企业、组织或财产转到所谓“雅利安人”（非犹太人）名下，通常带有胁迫与不公平低价。"},"examples":[{"en":"The Nazi regime sought to aryanize Jewish-owned businesses through laws, threats, and forced sales.","zh":"纳粹政权通过法律、威胁和强迫出售来“雅利安化”犹太人拥有的企业。"},{"en":"Many families lost their shops when local officials moved to aryanize the neighborhood economy.","zh":"当地方官员推动社区经济“雅利安化”时，许多家庭失去了他们的店铺。"}]}],"synonyms":["expropriate (in this context)","seize","confiscate","forcibly transfer"],"phonetic":"/ˈɛriəˌnaɪz/","extraExplanation":["这是一个高度敏感的历史词汇，主要与纳粹反犹政策相关（德语常见对应为 Arisierung / “Aryanization”）。它描述的是制度化掠夺：通过歧视性法规、行政压力与暴力威胁，迫使被迫害者“自愿”转让资产。现代语境中使用该词通常是为了讨论或批判这段历史，而不是中性描述。"]}
{"word":"Aryanized","summary":{"en":"“Aryanized” is a historical Nazi-era term meaning made “Aryan,” especially by forcibly removing Jewish ownership or influence.","zh":"“Aryanized”是纳粹时期的历史用语，指被“雅利安化”，尤其是通过强制手段剥夺犹太人的所有权或影响。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(historical, often offensive) Changed to fit Nazi racial ideology; especially, made “Aryan” by removing Jewish ownership, influence, or identity (e.g., taking over Jewish-owned businesses or forcing non-Jewish control).","zh":"（历史用语，常被视为冒犯）按纳粹种族意识形态“雅利安化”；尤指通过剥夺犹太人的所有权、影响或身份，使某事物被迫变为“雅利安人的”（如强行接管犹太人企业、改为非犹太人控制）。"},"examples":[{"en":"During the Nazi era, many Jewish-owned shops were seized and Aryanized.","zh":"在纳粹时期，许多犹太人经营的商店被没收并被“雅利安化”。"},{"en":"The museum note explains how the company was Aryanized in 1938.","zh":"博物馆说明解释了这家公司在1938年如何被“雅利安化”。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “Aryanize”: to carry out the process of Aryanization.","zh":"“Aryanize”的过去式/过去分词：实施“雅利安化”的过程。"},"examples":[{"en":"The property was Aryanized and transferred to a new owner under discriminatory laws.","zh":"该财产被“雅利安化”，并在歧视性法律下转给了新业主。"}]}],"synonyms":["expropriated","confiscated","seized","forcibly transferred","nationalized (sometimes, context-dependent)"],"phonetic":"/ˈɛriənaɪzd/","extraExplanation":["“Aryanized / Aryanization（雅利安化）”是纳粹德国的官方与宣传用语之一，与反犹迫害密切相关，常指通过法律、胁迫与暴力把犹太人的企业、房产、职位与文化生活强行转给“非犹太人”。在学术与历史写作中会出现，但日常表达应谨慎使用，并明确其历史背景与伤害性。","在现代英语中更中性的表达常用：“expropriated/ confiscated from Jewish owners（从犹太业主手中强行没收）”“forced transfer（强制转让）”“Nazi seizure（纳粹没收/侵占）”。"]}
{"word":"Aryanizing","summary":{"en":"“Aryanizing” most often refers to Nazi-era racist “Aryanization”: excluding Jews and transferring Jewish property to non-Jews; the term is historically loaded and used cautiously.","zh":"“Aryanizing”多指纳粹时期的种族主义“雅利安化”：排斥犹太人并将其财产转给非犹太人；该词历史负担沉重，使用需谨慎。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “Aryanize”) to make something or someone fit an “Aryan” category—especially in Nazi ideology; often refers to racist policies that excluded, persecuted, or erased Jews and other targeted groups.","zh":"（“Aryanize”的现在分词）使某物或某人被归入“雅利安人”范畴——尤其指纳粹意识形态中的做法；常指排犹及迫害、抹除其他被针对群体的种族主义政策。"},"examples":[{"en":"The regime was Aryanizing public life by banning Jewish professionals from many jobs.","zh":"该政权通过禁止犹太专业人士从事许多工作来“雅利安化”公共生活。"},{"en":"The novel portrays a family business slowly being taken over as the town is Aryanizing.","zh":"这部小说描写在小镇被“雅利安化”的过程中，一家族企业逐渐被夺走。"}]},{"partOfSpeech":"v.","definition":{"en":"(historical) transferring Jewish-owned businesses, property, or cultural assets to non-Jewish ownership under Nazi pressure or law; often translated as “Aryanization.”","zh":"（历史）在纳粹压力或法律之下，将犹太人拥有的企业、财产或文化资产转移给非犹太人；常译为“雅利安化/雅利安化政策”。"},"examples":[{"en":"Documents show the company was Aryanizing the shop by forcing a sale far below its value.","zh":"文件显示该公司通过强迫以远低于价值的价格出售来“雅利安化”那家商店。"},{"en":"Museums have researched artworks taken during the period when the economy was Aryanizing Jewish assets.","zh":"博物馆研究了在经济对犹太资产进行“雅利安化”时期被夺走的艺术品。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare/outdated) describing language or culture as “Aryan,” based on an older (and often misleading) racial labeling of Indo-European peoples; generally avoided in modern writing.","zh":"（罕见/过时）用“雅利安”来描述语言或文化，源于早期（且常误导性的）对印欧人群的种族化标签；现代写作中通常避免使用。"},"examples":[{"en":"Some older texts speak of “Aryanizing” culture, but modern scholars reject that racial framing.","zh":"一些旧文本谈到对文化进行“雅利安化”，但现代学者否定这种种族化框架。"}]}],"synonyms":["Aryanization","Nazification (not identical)","expropriating (context-dependent)"],"phonetic":"/ˈɛriəˌnaɪzɪŋ/","extraExplanation":["“Aryanizing / Aryanization（雅利安化）”在英语里高度关联纳粹德国：包括把犹太人逐出职业与公共生活、强迫转让企业与财产、掠夺文化资产等。这是带有强烈历史创伤与种族主义色彩的用语，使用时通常需要明确其历史语境与批判立场。","“Aryan（雅利安）”在语言学中原本可指与印欧语系相关的古老术语（如“Indo-Aryan languages 印度-雅利安语支”），但纳粹将其扭曲为“优等种族”的概念；因此在涉及人群身份时极易引发误解或冒犯。"]}
{"word":"aryans","summary":{"en":"“Aryans” can mean ancient Indo-Iranian/Indo-Aryan peoples in scholarly contexts, but it is also used in a racist, Nazi-linked sense that is widely considered offensive.","zh":"“Aryans”在学术语境可指古代印伊/印度-雅利安相关人群，但也有与纳粹种族主义相关、普遍被视为冒犯的用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of Aryan: in historical linguistics and ancient history, people who spoke early Indo-Iranian languages (especially Indo-Aryan) and whose cultures spread into parts of South Asia and Iran.","zh":"Aryan 的复数：在历史语言学与古代史语境中，指使用早期印伊语系（尤其是印度-雅利安语支）语言的人群及其文化，后来传播到南亚与伊朗等地区。"},"examples":[{"en":"Some historians discuss how early Aryans influenced language and religion in South Asia.","zh":"一些历史学者会讨论早期雅利安人如何影响南亚的语言与宗教。"},{"en":"The term “Indo-Aryans” is often used more precisely than “Aryans.”","zh":"“印度-雅利安人（Indo-Aryans）”常被认为比“Aryans”更精确。"}]},{"partOfSpeech":"n.","definition":{"en":"A controversial and often offensive use: people claimed (especially by Nazi ideology and later white-supremacist groups) to be a “racially superior” white group.","zh":"一个有争议、且常带冒犯性的用法：被纳粹意识形态以及后来的白人至上主义团体宣称为“优等种族”的白人群体。"},"examples":[{"en":"Nazi propaganda used the word “Aryans” to promote a racist ideology.","zh":"纳粹宣传使用“Aryans”来推行种族主义意识形态。"},{"en":"In modern contexts, this usage is widely rejected as pseudoscientific and hateful.","zh":"在现代语境中，这种用法普遍被否定，认为是伪科学且带仇恨的说法。"}]}],"synonyms":["Indo-Aryans","Indo-Iranians","Indo-Iranian peoples"],"phonetic":"/ˈɛriənz/","extraExplanation":["“Aryan”最初与语言/文化有关：源自梵语 ā́rya（意为“高贵的、自己人”之类的称呼），在学术语境里常指“印度-伊朗/印度-雅利安”相关人群与语言。","19—20世纪欧洲一些思想把语言学概念错误地“种族化”，纳粹更将其扭曲为“白人优越”的政治口号；因此在一般英语表达中直接用 Aryans 容易引发误解或冒犯。更安全的说法通常是 Indo-Iranian peoples / Indo-Aryans（学术语境）或明确说明指纳粹意识形态（历史语境）。"]}
{"word":"aryballi","summary":{"en":"“aryballi” doesn’t appear to be a common English word; it’s likely a misspelling or a proper name.","zh":"“aryballi”看起来不是常见英语词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries. It may be a misspelling, a username, or a proper name.","zh":"这不是常见英语词典里的标准单词；可能是拼写错误、用户名或专有名词（人名/地名/品牌名）。"},"examples":[{"en":"I couldn’t find “aryballi” in a dictionary—did you mean “airball” or “Ari Bali”?","zh":"我在词典里找不到“aryballi”；你是不是想写“airball”或“Ari Bali”？"}]}],"extraExplanation":["你可以告诉我你想表达的意思或它出现的句子吗？我就能更准确判断：\n1）你是不是想查 **airball**（篮球术语：投篮完全没碰到篮筐/篮板）\n2）还是某个名字（如 Ari / Bali 的组合）\n3）或者是某个语言里的词（非英语）\n\n把原句贴出来最有效。"]}
{"word":"aryballoi","summary":{"en":"Aryballoi are small ancient Greek flasks for oil or perfume (plural of “aryballos”).","zh":"Aryballoi指古希腊用来装油或香油的小陶瓶（“aryballos”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small ancient Greek pottery flasks used to hold oil or perfume, often carried by athletes or used in bathing; plural of “aryballos.”","zh":"（古希腊）用于盛装橄榄油或香油的小陶壶/小油瓶；为“aryballos”的复数。"},"examples":[{"en":"Archaeologists found several aryballoi near the remains of a bathhouse.","zh":"考古学家在一处浴场遗迹附近发现了几只aryballoi（小油瓶）。"},{"en":"Greek athletes used aryballoi to carry oil for rubbing on their bodies before training.","zh":"古希腊运动员会用aryballoi随身携带油，在训练前涂抹身体。"}]}],"synonyms":["aryballos (singular)","oil flasks","perfume flasks"],"phonetic":"/ˌærɪˈbælɔɪ/","extraExplanation":["“Aryballos”（单数）是古希腊常见的一种小型容器，通常有圆鼓的瓶身和小口，方便倒出少量油。油在古希腊体育与日常清洁中很重要：运动员会抹油并用刮身器（strigil）刮去油与灰尘。","在博物馆或考古报告中更常见的是复数形式（如“aryballoi were found…”），因为出土文物往往成组记录。","相关器型词：lekythos（常见于盛油的细颈瓶，常与葬礼或日常用油相关）、alabastron（另一种盛香油/香膏的容器）。"]}
{"word":"aryballoid","summary":{"en":"Aryballoid means “aryballos-shaped,” describing a small vessel that looks like an ancient Greek round oil flask.","zh":"aryballoid指“球形油瓶式/类似aryballos的”，常用于描述外形像古希腊圆形油瓶的小器物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shaped like an aryballos (a small, round ancient Greek flask used for oil or perfume).","zh":"呈“球形油瓶”（aryballos，一种古希腊用来装油或香料的小圆瓶）形状的；类似球形油瓶的。"},"examples":[{"en":"The museum displayed an aryballoid flask from the 6th century BCE.","zh":"博物馆展出了一件公元前6世纪的球形油瓶式小瓶。"},{"en":"Archaeologists found an aryballoid vessel near the athlete’s bathing area.","zh":"考古学家在运动员沐浴区附近发现了一件球形油瓶式器皿。"}]},{"partOfSpeech":"n.","definition":{"en":"An aryballoid vessel or container (one that resembles an aryballos).","zh":"球形油瓶式器物；外形类似古希腊球形油瓶的容器。"},"examples":[{"en":"Several aryballoids were recovered from the tomb, likely used for scented oil.","zh":"从墓葬中出土了几件球形油瓶式器物，可能用来盛放香油。"}]}],"synonyms":["aryballos-shaped","-oid (suffix meaning “-shaped/-like”)"],"phonetic":"/ˌærɪˈbælɔɪd/","extraExplanation":["“aryballoid”多见于考古、艺术史与博物馆说明文字，描述器物“像aryballos那样的形制”。aryballos本身常与古希腊运动文化相关：运动员会把橄榄油装在这种小瓶里，用于涂抹身体、清洁等。","词形上，后缀“-oid”在英语里常表示“……状/类似……的”（如：ovoid=卵形的，android=仿人的）。因此aryballoid直观理解就是“像aryballos的”。"]}
{"word":"aryballos","summary":{"en":"An aryballos is a small ancient Greek flask for oil or perfume.","zh":"aryballos 指古希腊用于盛放油或香料的小型球形瓶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, round ancient Greek flask (often with a narrow neck and one handle) used to hold oil or perfume, especially for bathing or athletics.","zh":"（古希腊的）球形小油瓶/香油瓶（常有细颈与单柄），用于盛放橄榄油或香油，常见于沐浴或体育活动场景。"},"examples":[{"en":"The museum displayed a Corinthian aryballos decorated with running animals.","zh":"博物馆展出了一只科林斯风格的 aryballos，上面绘有奔跑的动物图案。"},{"en":"Ancient athletes carried an aryballos of olive oil to rub on their skin before exercise.","zh":"古代运动员会带着一只装橄榄油的 aryballos，在运动前涂抹身体。"},{"en":"In the excavation report, several aryballoi were found near the bath area.","zh":"在发掘报告中，浴场附近发现了几只 aryballos。"}]}],"synonyms":["oil flask","perfume flask","ancient Greek oil bottle"],"phonetic":"ˌærɪˈbæləs","extraExplanation":["aryballos（复数 aryballoi）常见于公元前7—5世纪的古希腊陶器中，体积小、便于携带，有时会用绳子系在手腕或挂在身上。","它与古希腊体育文化联系紧密：运动员用油涂抹身体，运动后再用刮片（strigil）刮去油和尘土。","在艺术与考古语境里，aryballos 的器形与纹饰常被用来帮助断代与判断产地（如科林斯陶器）。"]}
{"word":"aryballus","summary":{"en":"An aryballus is a small ancient Greek oil or perfume flask, often associated with athletes and bathing.","zh":"aryballus 指古希腊常见的小型香油/香水瓶，常与运动员、沐浴和涂油习俗相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, round or pear-shaped ancient Greek (and later Roman) flask used to hold scented oil or perfume, especially by athletes for rubbing on the body.","zh":"（古希腊，后亦见于古罗马的）小型油瓶/香油瓶，常呈圆形或梨形，常供运动员盛放并涂抹香油用。"},"examples":[{"en":"In the museum case, a painted aryballus sits beside a bronze strigil.","zh":"在博物馆的展柜里，一个彩绘的aryballus（香油瓶）放在一把青铜刮身板（strigil）旁边。"},{"en":"Ancient athletes carried an aryballus filled with olive oil to the gymnasium.","zh":"古代运动员会带着装满橄榄油的aryballus去体育馆。"},{"en":"The archaeologist found a tiny aryballus near the bathing area.","zh":"考古学家在浴场附近发现了一个小小的aryballus。"}]}],"synonyms":["oil flask","perfume flask","unguent jar"],"phonetic":"/ˌærɪˈbæləs/","extraExplanation":["词源来自希腊语 aryballos。它常与古希腊体育文化一起出现：运动员先涂油，再用刮身板（strigil）刮去油与汗垢。","在艺术与考古语境中，aryballus 不只是“瓶子”，也常指一种特定形制的陶器类型；与形体较细长的 alabastron（长颈香膏瓶）经常被并列讨论。"]}
{"word":"arybballi","summary":{"en":"“arybballi” is not a recognized English word; it likely needs correction or context.","zh":"“arybballi”不是常见英语单词；很可能需要更正拼写或提供上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"This doesn’t appear to be a standard English word. It may be a misspelling, a name, or a word from another language.","zh":"这看起来不是标准英语单词，可能是拼写错误、人名，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “arybballi” in an English dictionary—could you check the spelling?","zh":"我在英语词典里找不到“arybballi”——你能确认一下拼写吗？"},{"en":"If you tell me where you saw it (a song, game, message), I can help figure it out.","zh":"如果你告诉我你在哪里看到的（歌曲、游戏、消息等），我可以帮你判断它的意思。"}]}],"phonetic":"/ˌɑːriˈbɑːli/","extraExplanation":["你可以把更多信息发我：1）你想查的正确拼写（区分大小写也可能重要）；2）它出现的完整句子/上下文；3）你认为它可能相关的单词（比如你想表达的是某个英语单词）。我也可以根据发音或上下文帮你推测最可能的词。"]}
{"word":"aryepiglottic","summary":{"en":"An anatomical adjective meaning “related to the arytenoid cartilages and the epiglottis,” especially the connecting folds in the larynx.","zh":"解剖学形容词：指与杓状软骨和会厌相关，尤其指喉部连接二者的杓会厌襞/结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the arytenoid cartilages and the epiglottis in the larynx (voice box), especially describing the folds/ligaments that connect them.","zh":"（解剖）与喉部的杓状软骨和会厌有关的；尤指连接二者的杓会厌襞/韧带。"},"examples":[{"en":"The doctor examined swelling along the aryepiglottic fold.","zh":"医生检查了杓会厌襞处的肿胀。"},{"en":"Aryepiglottic muscles help narrow the opening of the larynx during swallowing.","zh":"杓会厌肌在吞咽时有助于缩小喉入口。"}]}],"synonyms":["(anatomy) of the aryepiglottic fold","(medical) laryngeal (broader)"],"phonetic":"/ˌɛriˌɛpɪˈɡlɑtɪk/","extraExplanation":["“ary- / aryt-”来自“arytenoid（杓状软骨）”，“epiglottic”来自“epiglottis（会厌）”。因此 aryepiglottic 常用于医学/解剖语境，最常见的搭配是 aryepiglottic fold（杓会厌襞）与 aryepiglottic ligament（杓会厌韧带）。"]}
{"word":"aryepiglottidean","summary":{"en":"A medical adjective meaning “related to the aryepiglottis/aryepiglottic folds in the larynx.”","zh":"医学形容词，指“与喉部的杓会厌部/杓会厌皱襞相关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the aryepiglottis (the tissue folds connecting the arytenoid cartilages to the epiglottis in the larynx).","zh":"与杓会厌部（连接杓状软骨与会厌、位于喉部的组织皱襞）有关的。"},"examples":[{"en":"Inflammation can cause swelling in the aryepiglottidean folds, affecting the airway.","zh":"炎症可能导致杓会厌皱襞肿胀，从而影响气道。"},{"en":"The doctor examined the aryepiglottidean region during the laryngoscopy.","zh":"医生在喉镜检查中观察了杓会厌区域。"}]}],"synonyms":["aryepiglottic"],"phonetic":"/ˌærɪˌɛpɪˈɡlɑtiən/","extraExplanation":["这是一个偏医学/解剖学的词，常见于“aryepiglottidean folds（杓会厌皱襞）”“aryepiglottidean region（杓会厌区域）”。在现代英文医学写作中，更常用同义词形容词“aryepiglottic”。","词形可拆解理解：ary-（杓状软骨相关）+ epiglottis（会厌）+ -ean（……的）。"]}
{"word":"aryl","summary":{"en":"Aryl means “related to an aromatic ring” or “an aromatic-ring substituent group” in chemistry.","zh":"Aryl 在化学中指“芳基的/与芳香环有关的”，或指“芳香环来源的取代基（芳基）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Relating to, or containing, an aryl group (a group derived from an aromatic ring such as benzene).","zh":"（化学）芳基的；与芳基有关的；含芳基的（芳基通常来自苯等芳香环）。"},"examples":[{"en":"Aryl halides are less reactive in some substitution reactions than alkyl halides.","zh":"在一些取代反应中，芳基卤化物的反应性比烷基卤化物更低。"},{"en":"This drug candidate includes an aryl ring to improve binding.","zh":"这个候选药物分子包含一个芳基环以增强结合能力。"}]},{"partOfSpeech":"n.","definition":{"en":"(Chemistry) An aryl group; a substituent derived from an aromatic hydrocarbon, such as phenyl (C6H5–).","zh":"（化学）芳基；来自芳香烃的取代基，例如苯基（C6H5–）。"},"examples":[{"en":"Replace the aryl with a smaller group to reduce the molecule’s size.","zh":"把芳基换成更小的基团以减小分子尺寸。"},{"en":"The reaction couples an aryl to a carbon chain.","zh":"该反应把一个芳基偶联到一段碳链上。"}]}],"synonyms":["aromatic (related)","aryl group","phenyl (a common type of aryl)"],"phonetic":"/ˈærəl/","extraExplanation":["“Aryl”主要用于有机化学与药物化学文献中，常见搭配有 aryl group（芳基）、aryl ring（芳环）、aryl halide（芳基卤化物）。","词源上，aryl 由“aromatic（芳香的）”缩写演变而来；与 alkyl（烷基）相对：alkyl 来自脂肪族链，aryl 来自芳香环。"]}
{"word":"arylamine","summary":{"en":"An arylamine is an aromatic-ring-containing amine (an amine group attached to an aryl group).","zh":"arylamine 指“芳基胺”，即胺基连接在芳香环（芳基）上的化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an aromatic amine; an organic compound that contains an amine group (–NH2, –NHR, or –NR2) attached to an aryl (aromatic ring) group","zh":"芳基胺；一种含有胺基（–NH2、–NHR 或 –NR2）并与芳基（芳香环）相连的有机化合物"},"examples":[{"en":"Aniline is a simple arylamine used to make dyes and plastics.","zh":"苯胺是一种简单的芳基胺，可用于制造染料和塑料。"},{"en":"Some arylamines can be hazardous, so workers must use protective equipment.","zh":"某些芳基胺可能有危害，因此工作人员必须使用防护装备。"}]}],"synonyms":["aromatic amine"],"phonetic":"/ˌærəlˈæmin/","extraExplanation":["“aryl-”指“芳基”（来自芳香族环，如苯环），“-amine”指“胺”。因此 arylamine 字面意思就是“带芳香环的胺”。","在工业与材料领域，芳基胺常见于染料、橡胶添加剂、药物与聚合物中间体等；但也有一些芳基胺与健康风险相关，使用时需遵循实验室/职业安全规范（通风、手套、护目镜等）。"]}
{"word":"arylamino","summary":{"en":"A chemistry term for an amino group attached to an aromatic (aryl) ring, or compounds/substituents containing that linkage.","zh":"化学术语：指与芳香环（芳基）相连的氨基/氨基基团，或含这种连接结构的取代基或化合物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Describing an amino group (–NH– or –NR–) that is attached to an aryl group (an aromatic ring), or a compound that contains this aryl–amino linkage.","zh":"（化学）指“芳基氨基”的：氨基（–NH– 或 –NR–）与芳基（芳香环）相连，或指含有这种“芳基–氨基”连接的化合物。"},"examples":[{"en":"The molecule contains an arylamino substituent on the benzene ring.","zh":"该分子在苯环上含有一个芳基氨基取代基。"},{"en":"Aryl amino groups often affect a dye’s color and light absorption.","zh":"芳基氨基常会影响染料的颜色与吸光性质。"}]},{"partOfSpeech":"n.","definition":{"en":"An arylamino group (used as a naming element in chemistry, often before a noun, e.g., “arylamino derivative”).","zh":"芳基氨基（作为化学命名要素使用，常置于名词前，如“芳基氨基衍生物”）。"},"examples":[{"en":"Researchers synthesized a series of arylamino derivatives.","zh":"研究人员合成了一系列芳基氨基衍生物。"}]}],"synonyms":["aryl amino","anilino (specific: phenylamino)"],"phonetic":"/ˌærəlˈæməˌnoʊ/","extraExplanation":["“aryl-”表示芳基（来自芳香烃的取代基，如苯基 phenyl），“amino”表示含氮的氨基相关结构。把它们合在一起，arylamino 通常强调“氮与芳香环相连”。","在有机合成、染料与药物化学里，这类基团很常见，因为芳香环与含氮基团会显著改变分子的电子性质，从而影响颜色、反应性与生物活性。"]}
{"word":"arylate","summary":{"en":"A chemistry term: an aryl-derived carboxylate/ester, or the act of adding an aryl (aromatic ring) group to a molecule.","zh":"化学术语：指芳香族羧酸根/其盐或酯等衍生物；也可指把芳基（芳香环基团）引入分子中的“芳基化”过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) a salt, ion, or ester derived from an aromatic carboxylic acid; in general use, an aromatic “carboxylate” compound.","zh":"（化学）由芳香族羧酸衍生的盐、离子或酯；广义上指芳香族“羧酸根/羧酸盐（carboxylate）”类化合物。"},"examples":[{"en":"In this reaction, the product is an arylate that can be purified by recrystallization.","zh":"在这个反应中，产物是一种 arylate，可通过重结晶纯化。"},{"en":"Some catalysts help form arylate intermediates before the final product appears.","zh":"一些催化剂会先形成 arylate 中间体，然后才生成最终产物。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Chemistry) to introduce an aryl group (an aromatic ring group) into a molecule; to arylate.","zh":"（化学）把芳基（带芳香环的基团）引入某个分子中；进行芳基化（arylation）。"},"examples":[{"en":"The chemist arylated the compound to improve its stability.","zh":"化学家对该化合物进行了芳基化，以提高其稳定性。"},{"en":"This method can arylate alcohols under mild conditions.","zh":"这种方法能在温和条件下对醇进行芳基化。"}]}],"synonyms":["aryl ester","aromatic carboxylate","arylate (as: arylate/arylation)"],"phonetic":"/ˈærəˌleɪt/","extraExplanation":["“arylate”在日常英语中很少见，主要用于化学/材料科学文献。它与“aryl（芳基）”同源：aryl 指含苯环等芳香环的取代基。","名词用法常与 carboxylate（羧酸盐/羧酸根）语境相关；动词用法更常写作 arylate / arylation（芳基化）来描述反应类型。"]}
{"word":"arylated","summary":{"en":"“Arylated” means a molecule has had an aryl (aromatic ring) group added, or describes the product after arylation.","zh":"“Arylated”指分子被引入芳基（芳香环）后的状态，也可指芳基化后的产物。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Chemistry) to attach an aryl group (an aromatic ring such as phenyl) to a molecule; past tense/past participle form of “arylate.”","zh":"（化学）将芳基（如苯基等芳香环）连接到分子上；“arylate”的过去式/过去分词。"},"examples":[{"en":"The researchers arylated the amine to improve the compound’s activity.","zh":"研究人员对该胺进行芳基化，以提高化合物的活性。"},{"en":"After the reaction, the substrate was successfully arylated under mild conditions.","zh":"反应后，该底物在温和条件下成功发生了芳基化。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) having an aryl group attached; modified by arylation.","zh":"（化学）带有芳基的；经过芳基化改性的。"},"examples":[{"en":"An arylated product often shows different solubility from the starting material.","zh":"芳基化产物的溶解性常常与起始原料不同。"},{"en":"They compared arylated and non-arylated versions of the same molecule.","zh":"他们比较了同一分子的芳基化与非芳基化版本。"}]}],"synonyms":["aryl-substituted","phenylated (more specific)","aryl-functionalized"],"phonetic":"ˈærəˌleɪtɪd","extraExplanation":["“Aryl（芳基）”指从芳香烃（最常见是苯）去掉一个氢后得到的取代基，例如 phenyl（苯基，C6H5–）。因此 arylated 通常出现在有机合成或药物化学文献里，表示“引入芳香环取代基”。","常见相关术语：arylation（芳基化，名词），to arylate（进行芳基化，动词）。有时也会看到更具体的说法如 phenylated（苯基化）。"]}
{"word":"arylating","summary":{"en":"“Arylating” means introducing an aryl (aromatic ring) group into a molecule in a chemical reaction.","zh":"“Arylating”指在化学反应中向分子引入芳基（芳香环）进行芳基化。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"adding an aryl group (an aromatic ring such as phenyl) to a molecule; taking part in a chemical reaction that introduces an aryl group","zh":"给分子引入芳基（如苯基等芳香环）；指进行“芳基化”反应"},"examples":[{"en":"The chemist is arylating the substrate to improve its stability.","zh":"化学家正在对底物进行芳基化，以提高其稳定性。"},{"en":"Arylating the ring can change the compound’s color and reactivity.","zh":"对环进行芳基化会改变化合物的颜色和反应性。"}]}],"synonyms":["arylation (process)","introducing an aryl group","aryl-substituting"],"phonetic":"/ˈærəˌleɪtɪŋ/","extraExplanation":["“arylating”是动词“arylate”的现在分词/动名词形式，常见于有机化学与药物化学文献。","“aryl-”表示“芳基”，通常来自芳香烃（例如苯环）；常见反应语境包括交叉偶联（如Suzuki、Heck等）来实现芳基化。","在论文或实验记录中，你可能会看到：arylating agent（芳基化试剂）、arylation (n. 芳基化)、aryl group（芳基）。"]}
{"word":"arylation","summary":{"en":"Arylation is the chemical introduction of an aryl (aromatic ring) group into a molecule.","zh":"arylation 指在化学反应中把芳基（芳香环基团）引入分子的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A chemical reaction or process in which an aryl group (an aromatic ring such as phenyl) is introduced into a molecule, often to change its properties.","zh":"芳基化：一种化学反应或过程，把芳基（含芳香环的基团，如苯基）引入到分子中，常用于改变分子的性质。"},"examples":[{"en":"Arylation is commonly used to modify drug candidates and improve their activity.","zh":"芳基化常用于修饰候选药物分子，以提高其活性。"},{"en":"The team achieved arylation of the heteroarene under mild conditions.","zh":"研究团队在温和条件下实现了对杂芳烃的芳基化。"}]}],"synonyms":["aryl group introduction","aryl substitution","(context) aromatic substitution"],"phonetic":"/ˌærəˈleɪʃən/","extraExplanation":["词源：aryl 来自“aromatic（芳香的）”相关概念，表示“芳基”；-ation 表示“……的过程/作用”。因此 arylation 直译就是“引入芳基的过程”。","学习提示：在有机化学里，常见类似构词还有 alkylation（烷基化）、acylation（酰基化）。它们都表示“把某种基团接到分子上”。","常见语境：科研论文与实验描述中常见，如“C–H arylation（C–H 键芳基化）”“cross-coupling arylation（交叉偶联芳基化）”。"]}
{"word":"arylide","summary":{"en":"Arylide is a type of synthetic organic pigment (often yellow) used in inks, paints, and plastics.","zh":"Arylide 指一种合成有机颜料（常见为黄色），用于油墨、涂料和塑料着色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a synthetic organic pigment (often yellow) made from aromatic (aryl) compounds, widely used in paints, inks, plastics, and coatings.","zh":"芳基类合成有机颜料（常见为黄色），由芳香族（aryl）化合物制成，广泛用于涂料、油墨、塑料和涂层。"},"examples":[{"en":"Arylides are common pigments in printing inks because they give bright, clean yellows.","zh":"芳基颜料在印刷油墨中很常见，因为它们能呈现明亮、干净的黄色。"},{"en":"The manufacturer switched from a dye to an arylide pigment for better light resistance.","zh":"厂家从染料改用芳基颜料，以获得更好的耐光性。"}]}],"synonyms":["arylide pigment","organic pigment","arylide yellow"],"phonetic":"/ˈɛrəˌlaɪd/","extraExplanation":["“Arylide”常在材料与色彩领域出现，尤其指“芳基黄色（arylide yellow）”一类有机颜料。与“dye（染料）”不同，pigment（颜料）通常不溶于介质，而是以微粒分散在油墨/涂料中，因此更适合涂层、塑料着色等。","在实际产品资料里，你可能会看到它以色号或颜料编号出现（如某些“PY”开头的黄颜料代号）。具体耐光性、耐溶剂性与安全/环保信息需以产品的MSDS/技术数据表为准。"]}
{"word":"aryls","summary":{"en":"“Aryls” is the plural of “aryl,” meaning aromatic ring substituent groups used in organic chemistry.","zh":"“Aryls” 是 “aryl”（芳基）的复数，指有机化学中作为取代基的芳香环基团。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an aromatic ring group (like phenyl) treated as a unit in chemistry; it usually comes from an aromatic hydrocarbon by removing one hydrogen and is used as a substituent in larger molecules.","zh":"（化学）芳基：把一个芳香环（如苯基）当作一个整体的基团；通常指芳香烃去掉一个氢原子后形成的取代基，用于更大的分子结构中。"},"examples":[{"en":"Many medicines contain aryl groups because aromatic rings can change how a drug interacts with the body.","zh":"很多药物含有芳基，因为芳香环会影响药物与人体的相互作用。"},{"en":"The chemist replaced a methyl group with an aryl group to improve the compound’s stability.","zh":"化学家把甲基换成芳基，以提高该化合物的稳定性。"},{"en":"Aryl halides are often used as starting materials in cross-coupling reactions.","zh":"芳基卤化物常用作交叉偶联反应的起始原料。"}]}],"synonyms":["aryl group","aromatic group","phenyl (a type of aryl)"],"phonetic":"/ˈerəl/","extraExplanation":["“aryl”常见于有机化学命名中，表示“带芳香环特征的取代基”。最常见的例子是 phenyl（苯基，C6H5–），属于一种 aryl。","不要把 aryl（芳基）和 alkyl（烷基，如 methyl 甲基）混淆：aryl 含芳香环并具有芳香性；alkyl 来自烷烃链。","你输入的 “aryls” 是复数形式；单数是 “aryl”。"]}
{"word":"Aryn","summary":{"en":"Aryn is a given name, often used as a modern variant spelling of Erin or Aaron.","zh":"Aryn 是一个人名，常见于 Erin 或 Aaron 的现代变体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (first name), used for any gender; a modern spelling variant of names like Erin or Aaron.","zh":"人名（名字），可用于任何性别；常见于 Erin 或 Aaron 等名字的现代变体拼写。"},"examples":[{"en":"Aryn introduced herself as the new project manager.","zh":"Aryn 介绍自己是新来的项目经理。"},{"en":"I met Aryn at a school event last year.","zh":"我去年在学校活动上认识了 Aryn。"}]}],"synonyms":["Erin","Aaron"],"phonetic":"/ˈærɪn/","extraExplanation":["“Aryn”通常不是常见词汇意义上的英文单词，而是一个拼写较个性化的名字。不同家庭可能赋予不同来源与读音：有人把它当作 Erin（常与爱尔兰地名/人名相关）的变体，也有人把它当作 Aaron（源自希伯来语传统男性名）的变体。最稳妥的做法是礼貌询问本人偏好的读音与拼写。"]}
{"word":"Aryo-dravidian","summary":{"en":"Aryo-Dravidian means “connected to both Indo-Aryan and Dravidian,” especially in South Asian language/culture contexts; as a noun it can be a historical, often outdated label for mixed ancestry.","zh":"Aryo-Dravidian 指“与印欧-雅利安和达罗毗荼两者相关”，多用于南亚语言/文化语境；作名词时可指一种历史上常见但如今多被视为过时的“混合血统”标签。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both Indo-Aryan (Aryan) and Dravidian peoples, cultures, or languages, especially in the context of South Asia.","zh":"与南亚的印欧-雅利安（Aryan/Indo-Aryan）和达罗毗荼（Dravidian）两者的人群、文化或语言都相关的；常用于描述两者之间的关系或互动。"},"examples":[{"en":"The article discusses Aryo-Dravidian contact and how it shaped vocabulary in several Indian languages.","zh":"这篇文章讨论了雅利安—达罗毗荼的接触，以及它如何影响了若干印度语言的词汇。"},{"en":"Some researchers study Aryo-Dravidian influences in regions where Indo-Aryan and Dravidian languages meet.","zh":"一些研究者会在印欧-雅利安语与达罗毗荼语交界的地区研究“雅利安—达罗毗荼”的相互影响。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical, often outdated) A person or group described as having both Indo-Aryan and Dravidian ancestry or characteristics.","zh":"（历史用法，常被视为过时）指被描述为同时具有印欧-雅利安与达罗毗荼血统或特征的人或群体。"},"examples":[{"en":"Older colonial-era writings sometimes used “Aryo-Dravidian” as a racial category, but modern scholarship generally avoids this label.","zh":"较早的殖民时期著作有时把“Aryo-Dravidian”当作一种“种族类别”，但现代学术写作通常避免这种标签。"}]}],"synonyms":["Indo-Aryan–Dravidian","Indo-Aryan and Dravidian","Indo-Aryan–Dravidian contact"],"phonetic":"/ˌɑːrioʊ drəˈvɪdiən/","extraExplanation":["“Aryo-Dravidian”常见于19—20世纪的语言学与人类学语境，但其中的“Aryan/雅利安”在历史上曾被误用为“种族”概念，带有殖民时期的分类色彩，容易引发误解与敏感联想。","现代语言学更倾向用更精确、较中性的术语：Indo-Aryan（印欧-雅利安语支）与 Dravidian（达罗毗荼语系），并用“language contact（语言接触）/areal influence（区域影响）”来描述相互作用，而不是用“混合种族”式的表述。"]}
{"word":"Aryo-indian","summary":{"en":"Aryo-Indian is a mostly historical term meaning “Indo-Aryan,” relating to North Indian peoples, languages, or culture.","zh":"Aryo-Indian多用于历史语境，意思大致相当于“Indo-Aryan（印度-雅利安）”，指与北印度的人群、语言或文化相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often historical or less common) relating to the Indo-Aryan peoples, languages, or culture of the Indian subcontinent; similar in meaning to “Indo-Aryan.”","zh":"（常见于历史语境或较少使用）与印度次大陆的印欧语系“印度-雅利安”人群、语言或文化有关；含义接近“Indo-Aryan（印度-雅利安）”。"},"examples":[{"en":"Some older books use “Aryo-Indian” to describe Indo-Aryan languages such as Hindi and Bengali.","zh":"一些较早的书会用“Aryo-Indian”来指称如印地语、孟加拉语等印度-雅利安语言。"},{"en":"The museum label mentions Aryo-Indian influences in North Indian art.","zh":"博物馆的说明牌提到北印度艺术中的“Aryo-Indian（印度-雅利安）”影响。"}]},{"partOfSpeech":"n.","definition":{"en":"a person (especially in older writing) considered to belong to the Indo-Aryan peoples of India.","zh":"（尤见于旧文献）被认为属于印度“印度-雅利安”人群的人。"},"examples":[{"en":"In the 19th century, some writers classified communities as “Aryo-Indians,” though the term is uncommon today.","zh":"在19世纪，一些作者把某些社群归为“Aryo-Indians”，但这个说法如今并不常见。"}]}],"synonyms":["Indo-Aryan","Indo-Aryan languages","Indo-Aryan peoples"],"phonetic":"/ˌɑːrioʊ ˈɪndiən/","extraExplanation":["“Aryo-Indian”不是现代英语里很常用、也不算很标准的术语；学术与新闻写作中更常见的是“Indo-Aryan（印度-雅利安）”。\n\n另外，“Aryan/雅利安”一词在欧洲历史中曾被种族主义者挪用，因此在跨文化交流中容易引起误解。若你想表达语言家族或历史文化，优先用“Indo-Aryan”通常更准确、更中性。"]}
{"word":"aryteno","summary":{"en":"“aryteno-” is a medical word part meaning “related to the arytenoid cartilage” in the larynx (voice box).","zh":"“aryteno-”是医学构词成分，表示“与喉部的杓状软骨有关”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a medical combining form meaning “related to the arytenoid cartilage” (small cartilages in the larynx/voice box that help control the vocal cords).","zh":"医学构词成分，表示“与杓状软骨有关”。杓状软骨位于喉（声盒）内，参与控制声带运动与发声。"},"examples":[{"en":"The doctor noted aryteno- involvement when discussing the laryngeal exam.","zh":"医生在讨论喉镜检查时提到可能涉及 aryteno-（杓状软骨相关）结构。"},{"en":"In anatomy terms, aryteno- appears in words like arytenoid cartilage.","zh":"在解剖学术语中，aryteno- 常见于诸如 arytenoid cartilage（杓状软骨）这样的词。"}]}],"phonetic":"/ˌærɪˈtiːnoʊ/","extraExplanation":["“aryteno-”多用于专业医学/解剖学词汇中，常见搭配包括：arytenoid（杓状的/杓状软骨的）、arytenoepiglottic（杓会厌的，如 arytenoepiglottic fold 杓会厌襞）。","词源来自希腊语，原意与“勺/舀勺（ladle）”形状有关，指杓状软骨外形像小勺。"]}
{"word":"arytenoepiglottic","summary":{"en":"An anatomical adjective meaning “related to the arytenoid cartilages and the epiglottis.”","zh":"解剖学形容词，表示“与杓状软骨和会厌有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the arytenoid cartilages and the epiglottis (parts of the larynx/throat involved in breathing and swallowing).","zh":"与杓状软骨和会厌有关的（位于喉部、与呼吸和吞咽相关的结构）。"},"examples":[{"en":"The arytenoepiglottic folds help protect the airway during swallowing.","zh":"杓会厌襞在吞咽时帮助保护气道。"},{"en":"Inflammation near the arytenoepiglottic region can affect the voice.","zh":"杓会厌区域附近的炎症可能会影响发声。"}]}],"synonyms":["aryepiglottic"],"phonetic":"/əˌrɪtəˌnoʊˌɛpɪˈɡlɑtɪk/","extraExplanation":["这个词多见于医学/解剖学语境，常与“fold(s)（襞）”一起出现：arytenoepiglottic folds（杓会厌襞）。它们是喉入口两侧的黏膜褶皱，从会厌延伸到杓状软骨附近。","拼写上也常见变体/相关词：aryepiglottic（更常见，意思相近）。临床上提到该区域，通常与吞咽保护、喉入口结构或声音问题有关。"]}
{"word":"arytenoid","summary":{"en":"A medical term for one of two laryngeal cartilages that move the vocal cords.","zh":"医学用语：喉部两块杓状软骨之一，负责带动/控制声带。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Either of a pair of small, pyramid-shaped cartilages in the larynx (voice box) that help control the vocal cords and are essential for breathing and speaking.","zh":"（杓状软骨）喉（声盒）里一对小的金字塔状软骨之一，帮助控制声带，对呼吸和发声很重要。"},"examples":[{"en":"Inflammation around the arytenoids can make your voice sound hoarse.","zh":"杓状软骨周围发炎会让声音听起来沙哑。"},{"en":"The doctor checked the movement of the arytenoid cartilage during the exam.","zh":"检查时医生观察了杓状软骨的活动情况。"}]}],"synonyms":["arytenoid cartilage"],"phonetic":"/əˈrɪtəˌnɔɪd/","extraExplanation":["“arytenoid”常用于医学语境，尤其是耳鼻喉科（ENT）与发声/嗓音治疗。日常英语里较少见，但在谈到声带、喉部结构时会出现。","词源来自希腊语，含义与“像勺子/壶口形状的”有关，描述其外形。"]}
{"word":"arytenoidal","summary":{"en":"“Arytenoidal” means “related to the arytenoid cartilages in the larynx,” often used in medical or voice-science contexts.","zh":"“arytenoidal”指“与喉部杓状软骨有关的”，多用于医学或发声相关语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the arytenoid cartilages (two small cartilages in the larynx/voice box) that help control the vocal cords.","zh":"与杓状软骨有关的；杓状软骨的（杓状软骨位于喉部，帮助控制声带）。"},"examples":[{"en":"Arytenoidal movement helps open and close the vocal cords during breathing and speaking.","zh":"杓状软骨的运动有助于在呼吸和说话时打开和关闭声带。"},{"en":"The doctor noted arytenoidal swelling during the laryngeal exam.","zh":"医生在喉镜检查中发现杓状软骨区域有肿胀。"}]}],"synonyms":["arytenoid","laryngeal (broader)"],"phonetic":"/əˌrɪtənˈɔɪd(ə)l/","extraExplanation":["“arytenoid”来自希腊语，意思大致为“像勺子（或壶嘴）一样的”。“arytenoidal”是其形容词形式，常见于耳鼻喉科（ENT）与语音/发声相关的医学语境。","学习时可把它拆开理解：arytenoid（杓状软骨）+ -al（……的）→ arytenoidal（杓状软骨的/相关的）。"]}
{"word":"arythmia","summary":{"en":"Arrhythmia means an irregular heartbeat.","zh":"Arrhythmia 指“心律不齐/心跳不规律”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) an irregular heartbeat—too fast, too slow, or uneven in rhythm.","zh":"（医学）心律不齐：心跳节律不规则，可能过快、过慢或忽快忽慢。"},"examples":[{"en":"The doctor said the dizziness might be caused by an arrhythmia.","zh":"医生说头晕可能是心律不齐引起的。"},{"en":"Some arrhythmias are harmless, but others need treatment.","zh":"有些心律不齐并不危险，但有些需要治疗。"},{"en":"He wore a heart monitor to check for arrhythmia during sleep.","zh":"他戴了心脏监测器来检查睡眠时是否出现心律不齐。"}]}],"synonyms":["irregular heartbeat","cardiac arrhythmia","heart rhythm disorder"],"phonetic":"/əˈrɪðmiə/","extraExplanation":["你输入的拼写“arythmia”更常见的标准拼写是 **arrhythmia**（英式/美式都常用这个拼写）。","词根提示：来自希腊语 *a-*（无、非）+ *rhythm*（节律），字面意思是“没有正常节律”。","这是医学术语；日常交流里也常说 **irregular heartbeat**（心跳不规律）来表达相近意思。"]}
{"word":"arythmias","summary":{"en":"Arrhythmias are irregular heartbeats.","zh":"Arrhythmias 指心律失常（不规则心跳）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Irregular heartbeats (the plural of arrhythmia); the heart beats too fast, too slow, or in an uneven pattern.","zh":"（arrhythmia 的复数）心律失常；心脏跳动过快、过慢或节律不规则。"},"examples":[{"en":"The doctor said the patient has arrhythmias and needs monitoring.","zh":"医生说病人有心律失常，需要监测。"},{"en":"Some arrhythmias are harmless, but others can be serious.","zh":"有些心律失常无害，但有些可能很严重。"},{"en":"Caffeine can sometimes trigger arrhythmias in sensitive people.","zh":"咖啡因有时会在敏感人群中诱发心律失常。"}]}],"synonyms":["irregular heartbeats","irregular rhythm","heart rhythm problems"],"phonetic":"əˈrɪðmiəz","extraExplanation":["你输入的拼写是“arythmias”，常见正确拼写是“arrhythmias”（双 r）。在医学语境中最常用的是单数“arrhythmia”（心律失常）和复数“arrhythmias”。","词根提示：前缀 a- 表示“无/不”，rhythm 表示“节律”，合起来就是“没有正常节律”。"]}
{"word":"arythmic","summary":{"en":"“Arythmic” usually means “arrhythmic”: irregular in rhythm, especially an irregular heartbeat.","zh":"“arythmic”通常指“arrhythmic”：节奏不规律的，尤指心跳不齐。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Usually spelled “arrhythmic”) lacking a regular rhythm; not happening in a steady, regular pattern—especially used about the heartbeat.","zh":"（通常拼作“arrhythmic”）无规律节奏的；不规则发生的——尤其指心跳不齐。"},"examples":[{"en":"The doctor said his heartbeat was arrhythmic and needed monitoring.","zh":"医生说他的心跳不齐，需要监测。"},{"en":"On the ECG, the beats looked arrhythmic rather than steady.","zh":"在心电图上，心跳看起来是不规则的，而不是稳定的。"}]}],"synonyms":["irregular","uneven","unsteady","out of rhythm"],"phonetic":"/əˈrɪðmɪk/","extraExplanation":["“arythmic”常见于拼写错误或较少见的变体；医学与常用英语里更标准的拼写是 **arrhythmic**（对应名词 **arrhythmia**“心律失常”）。","词源上与希腊语前缀 **a-**（“不、无”）+ **rhythm**（“节奏”）有关，所以核心意思就是“没有规律的节奏”。"]}
{"word":"arythmical","summary":{"en":"Arrhythmical means “without a regular rhythm” or, in medicine, “having an irregular heartbeat.”","zh":"arrhythmical 指“没有规则节奏的”，医学上也可指“心律不齐的/心跳不规则的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no regular rhythm; not rhythmic; irregular in beat or timing.","zh":"没有规则节奏的；不合拍的；节拍或时间上不规律的。"},"examples":[{"en":"The poem feels arrhythmical, with uneven stresses in each line.","zh":"这首诗读起来节奏不规则，每行的重音不均匀。"},{"en":"He played an arrhythmical pattern on the drums to create tension.","zh":"他用鼓敲出不规则的节奏型来营造紧张感。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Relating to an irregular heartbeat; arrhythmic.","zh":"（医学）与心律不齐有关的；心跳不规则的。"},"examples":[{"en":"The monitor showed an arrhythmical heartbeat.","zh":"监护仪显示心跳不规律。"},{"en":"She was treated for arrhythmical episodes.","zh":"她因间歇性心律不齐而接受治疗。"}]}],"synonyms":["irregular","unrhythmic","offbeat","out of rhythm","arrhythmic"],"phonetic":"/ˌæˈrɪðmɪkəl/","extraExplanation":["你输入的 **arythmical** 常见是拼写误差，更标准的拼法是 **arrhythmical**（也常见 **arrhythmic**）。英语里 **rrh** 这一串字母来源于希腊语 *rhythmos*（节奏），所以看起来不太直观。","在日常英语里，谈音乐/诗歌更常用 **irregular rhythm** 或 **not rhythmic**；医学语境里更常用 **arrhythmic**（如 *arrhythmic heartbeat*）。"]}
{"word":"arythmically","summary":{"en":"Arrhythmically means “in an irregular rhythm; without a steady beat.”","zh":"arrhythmically 指“以不规则的节奏；没有稳定拍子或规律地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an irregular rhythm; without a steady beat or pattern (often in music, speech, movement, or biological rhythms such as the heartbeat).","zh":"以不规则的节奏；没有稳定的拍子或规律（常用于音乐、说话、动作或生理节律如心跳）。"},"examples":[{"en":"The drummer played arrhythmically, making the music feel uneasy and tense.","zh":"鼓手以不规则的节奏演奏，让音乐听起来不安而紧张。"},{"en":"The lights flashed arrhythmically, like a faulty signal.","zh":"灯光不规则地闪烁，像是信号故障。"},{"en":"After the sprint, his heart seemed to beat arrhythmically for a moment.","zh":"冲刺后，他的心跳似乎有一瞬间不太规律。"}]}],"synonyms":["irregularly","out of rhythm","without a steady beat","unevenly"],"phonetic":"/əˈrɪðmɪkli/","extraExplanation":["“arythmically”常见为拼写变体或误拼；更标准的拼写通常是 **arrhythmically**（对应名词 *arrhythmia* / 形容词 *arrhythmic*）。","词源与构词：来自希腊语 *a-*（无、不）+ *rhythmos*（节奏），因此核心意思是“没有规律的节奏”。在音乐评论中常用来描述刻意打破拍点的效果；在医学语境中则与心律不齐相关。"]}
