{"word":"Arzachel","summary":{"en":"Arzachel is best known as the name of a prominent lunar crater; it is also a historical Latinized name for the astronomer Al-Zarqali.","zh":"Arzachel 最常指月球上一座著名的大型环形山；它也可指天文学家 Al‑Zarqali 的拉丁化姓名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Arzachel: a large impact crater on the Moon, near the center of the Moon’s near side (often mentioned in lunar maps and astronomy guides).","zh":"Arzachel（阿尔扎赫尔）：月球上的一个大型撞击坑，位于月球近地面中部附近（常见于月面地图与天文资料）。"},"examples":[{"en":"Arzachel is easy to spot through a small telescope because of its sharp rim and central peak.","zh":"用小型望远镜很容易找到 Arzachel，因为它的坑缘很清晰，而且有中央峰。"},{"en":"The trio of craters Ptolemaeus, Alphonsus, and Arzachel forms a famous region for beginner lunar observers.","zh":"托勒密坑、阿方索斯坑和 Arzachel 这组三个环形山构成了月面观测新手很有名的一片区域。"}]},{"partOfSpeech":"n.","definition":{"en":"Arzachel: a Latinized name associated with the medieval astronomer Al-Zarqali (Arzachel), sometimes used in historical or astrological texts.","zh":"Arzachel（阿尔扎赫尔）：中世纪天文学家阿尔-扎尔卡利（Al‑Zarqali）的拉丁化名字，有时见于历史或占星相关文献。"},"examples":[{"en":"Some older sources refer to Al-Zarqali by the name Arzachel.","zh":"一些较早的资料会用 Arzachel 来称呼 Al‑Zarqali。"},{"en":"The text credits Arzachel with improved astronomical tables used in medieval Europe.","zh":"该文献称 Arzachel 改进了在中世纪欧洲使用的天文历表。"}]}],"synonyms":["(lunar crater) Arzachel crater","(historical name) Al-Zarqali"],"phonetic":"ˈɑr.zə.kəl","extraExplanation":["“Arzachel”通常被视为 Al‑Zarqali 的拉丁化形式。许多月球地名来自历史上的天文学家与科学家，因此这个月坑名称与该人物渊源相关。"]}
{"word":"arzan","summary":{"en":"Arzan usually means “cheap/inexpensive” in South Asian English, and it can also be a personal name.","zh":"Arzan 通常在南亚英语里表示“便宜的/不贵的”，也可用作人名。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(South Asian English; from Persian/Urdu) cheap; inexpensive; low-priced.","zh":"（南亚英语；源自波斯语/乌尔都语）便宜的；价格低的。"},"examples":[{"en":"This fabric is arzan, but it won’t last long.","zh":"这块布很arzan（便宜），但不耐用。"},{"en":"We’re looking for an arzan hotel near the station.","zh":"我们在找车站附近比较arzan（便宜）的旅馆。"}]},{"partOfSpeech":"n.","definition":{"en":"A given name (used in some cultures), especially for men.","zh":"人名（一些文化中使用的名字），多见于男性。"},"examples":[{"en":"Arzan will join the meeting at 3 p.m.","zh":"Arzan 会在下午三点参加会议。"}]}],"synonyms":["cheap","inexpensive","affordable","low-cost"],"phonetic":"/ɑrˈzɑn/","extraExplanation":["“arzan/arzān”常见于波斯语、乌尔都语等语言里，意思是“便宜的”。在英语语境中，它不算标准常用词，更多出现在南亚地区的英语、移民社区交流、或带有当地语言色彩的表达中。正式写作里通常用“cheap / inexpensive / affordable”。"]}
{"word":"Arzava","summary":{"en":"Arzava is the name of an ancient Late Bronze Age kingdom/region in western Anatolia, known mainly from Hittite records.","zh":"Arzava 指晚青铜时代安纳托利亚西部的古代王国/地区名称，主要见于赫梯文献记载。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) An ancient kingdom or region in western Anatolia (modern-day Turkey), known from Hittite records in the Late Bronze Age.","zh":"（专有名词）安纳托利亚西部（今土耳其一带）的古代王国或地区名，主要见于晚青铜时代的赫梯文献。"},"examples":[{"en":"Arzava is mentioned in Hittite texts as a political power in western Anatolia.","zh":"在赫梯文献中，Arzava 被提到是安纳托利亚西部的一个政治势力。"},{"en":"Some historians connect Arzava with later regions associated with western Anatolian peoples.","zh":"一些历史学者把 Arzava 与后来安纳托利亚西部诸族群相关的地区联系起来。"}]}],"synonyms":["Arzawa"],"phonetic":"/ɑrˈzɑːvə/","extraExplanation":["“Arzava”更常见的学术拼写是“Arzawa”（同一名称的不同转写）。中文里有时译作“阿尔扎瓦/阿尔扎瓦王国”。","它大致活跃于公元前14—13世纪左右，与赫梯帝国既有外交往来也有冲突；在赫梯资料中常被当作西部的重要对手或盟友之一。","由于主要信息来自赫梯楔形文字记录，Arzava 的疆域与内部结构在学界仍有争议；一般认为其核心可能在以弗所（Ephesus）附近或更广泛的爱琴海沿岸地区。"]}
{"word":"arzava","summary":{"en":"A Bronze Age kingdom/region in western Anatolia, known from Hittite records.","zh":"青铜时代安纳托利亚西部的王国/地区，主要见于赫梯文献记载。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Arzawa (also spelled Arzava) was a Bronze Age kingdom/region in western Anatolia (in today’s Turkey), known from Hittite-era records.","zh":"Arzawa（亦拼作 Arzava）是青铜时代安纳托利亚西部（今土耳其境内）的一个王国/地区，主要见于赫梯时代的文献记载。"},"examples":[{"en":"Arzawa is often mentioned in Hittite texts as an important western neighbor and rival.","zh":"在赫梯文献中，Arzawa 常被提到，是西方重要的邻国与对手。"},{"en":"Some historians connect Arzawa’s cities with later Greek-speaking areas of Anatolia.","zh":"一些历史学者认为，Arzawa 的部分城邦可能与后来的小亚细亚希腊语地区有关联。"}]}],"phonetic":"/ɑrˈzɑvə/","extraExplanation":["“Arzawa/Arzava”多见于学术与历史语境，普通英语日常对话中很少使用。","它在公元前14–13世纪左右的赫梯史料中较突出；你可能会在介绍“赫梯帝国（Hittites）”“阿玛尔奈书信（Amarna letters）”或“青铜时代安纳托利亚”时看到这个名称。","英文中更常见的拼写是 **Arzawa**；**Arzava**属于较少见的转写/拼写变体。"]}
{"word":"Arzawa","summary":{"en":"Arzawa is the name of a Bronze Age kingdom/region in western Anatolia, mainly known from Hittite-era texts.","zh":"Arzawa（阿尔扎瓦）是青铜时代安纳托利亚西部的王国/地区名称，主要见于赫梯时期文献。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an ancient kingdom or region in western Anatolia (in modern-day Turkey), known from Bronze Age records, especially Hittite texts","zh":"安纳托利亚西部（今土耳其一带）的古代王国或地区名，主要见于青铜时代文献，尤其是赫梯文献"},"examples":[{"en":"Arzawa often appears in Hittite records as a western rival or neighbor.","zh":"在赫梯的记录中，阿尔扎瓦常被提到，是其西方的对手或邻国。"},{"en":"Some historians connect Arzawa with later areas of Lydia or the Aegean coast.","zh":"一些历史学者把阿尔扎瓦与后来的吕底亚或爱琴海沿岸地区联系起来。"}]},{"partOfSpeech":"n.","definition":{"en":"the name used in ancient diplomatic and political contexts for a group of western Anatolian states or a shifting coalition","zh":"在古代外交与政治语境中，用来指代安纳托利亚西部若干城邦/国家的集合，或一个变化的联盟"},"examples":[{"en":"Letters mention Arzawa as if it were a single power, though its borders may have changed over time.","zh":"书信中把阿尔扎瓦当作单一势力来提及，但其疆界可能随时间而变化。"}]}],"phonetic":"/ɑrˈzɑwə/","extraExplanation":["“Arzawa/阿尔扎瓦”更多是历史学与考古学用语，不是现代国家名。它主要出现在赫梯帝国（Hittites）相关的楔形文字文献里，时间大致在公元前2千纪后期。","关于阿尔扎瓦的确切位置与范围，学界并非完全一致；常见观点认为它位于安纳托利亚西部，可能靠近以弗所（Ephesus）一带，但“阿尔扎瓦”有时也可能指一组相关政体而非固定疆域的国家。","相关名词（便于延伸阅读）：Hittite（赫梯）、Anatolia（安纳托利亚）、Mira（米拉）、Seha River Land（塞哈河之地）、Wilusa（维鲁萨，常被拿来与特洛伊研究联系比较）。"]}
{"word":"arzawa","summary":{"en":"Arzawa: an ancient Late Bronze Age kingdom/region in western Anatolia, known mainly from Hittite sources.","zh":"Arzawa：青铜时代晚期安纳托利亚西部的古代王国/地区，主要通过赫梯文献为人所知。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient kingdom or region in western Anatolia (modern-day Turkey) during the Late Bronze Age, known from Hittite records.","zh":"阿尔扎瓦（Arzawa）：青铜时代晚期位于安纳托利亚西部（今土耳其一带）的古代王国或地区，主要见于赫梯文献记载。"},"examples":[{"en":"Arzawa appears in Hittite texts as an important western neighbor and sometimes a rival.","zh":"在赫梯文献中，阿尔扎瓦常被描写为赫梯在西方的重要邻国，有时也是对手。"},{"en":"Some historians connect Arzawa with the broader cultural landscape that later included Lydia and Ionia.","zh":"一些历史学者把阿尔扎瓦与后来出现的吕底亚、伊奥尼亚等更广泛的文化版图联系起来。"}]}],"synonyms":["Arzawa Kingdom","Arzawan realm"],"phonetic":"/ɑrˈzɑwə/","extraExplanation":["“Arzawa”多见于学术写作与历史类阅读，不是现代日常英语词汇。作为专有名词，通常首字母大写：Arzawa。","它与赫梯帝国（Hittite Empire）的外交与战争关系经常被讨论；部分资料会提到阿尔扎瓦后来分裂或被整合为若干小国（如米拉、塞哈河地等，英文常写 Mira、Seha River Land）。","发音在英语里可能因学者或语言背景略有差异；初学者可以按 /ɑrˈzɑwə/ 近似读。"]}
{"word":"arzrunite","summary":{"en":"“arzrunite” is not a standard English word; please provide context or check spelling.","zh":"“arzrunite”不是标准英语词；请提供上下文或检查拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a recognized standard English word; it may be a misspelling, a username, or a fictional/proper name.","zh":"不是标准英语词；可能是拼写错误、用户名，或虚构/专有名词。"},"examples":[{"en":"I couldn’t find “arzrunite” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英文词典里找不到“arzrunite”——你能把它出现的句子发我吗？"},{"en":"If you meant “arsonist,” the spelling is different.","zh":"如果你想写的是“arsonist（纵火犯）”，拼写不一样。"}]}],"phonetic":"/ɑrˈzruːnaɪt/","extraExplanation":["“arzrunite”看起来不像常见英语词形（不符合常见词根/后缀组合），所以更像是：1）拼写误差；2）游戏/小说中的专有名词；3）用户名或品牌名。","你可以告诉我：它来自哪里（书/游戏/网站）、大概意思、或给出上下文句子。我就能判断是否是某个词的误拼（例如接近 arsonist / azurite / arsenite 等），并给出正确词条。"]}
{"word":"arzun","summary":{"en":"“Arzun” is not a standard English word; it is most likely a proper name or a misspelling.","zh":"“Arzun”不是标准英语词汇；更可能是专有名词（名字/地名）或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare/uncertain term in English; most often seen as a personal or place name (a proper noun) rather than a standard English vocabulary word.","zh":"在英语中非常少见/不确定的词；最常见的用法是作为人名或地名（专有名词），而不是常规英语词汇。"},"examples":[{"en":"Arzun is not a common English word; it may be a name in your context.","zh":"Arzun 不是常见英语单词；在你的语境里它可能是一个名字。"},{"en":"Could you share a sentence with “Arzun” so I can identify what it means?","zh":"你能提供一个包含“Arzun”的句子吗？这样我可以判断它的意思。"}]}],"phonetic":"/ɑrˈzuːn/","extraExplanation":["“arzun”在主流英文词典里通常查不到，因此我无法给出像常用词那样可靠、固定的释义。它更可能是：\n1）人名/地名的拼写；\n2）外来语的拉丁字母转写；\n3）拼写错误。\n\n一个常见的可能误拼是 **arson**（纵火），拼写接近但含义完全不同。如果你想查的是“arson”或别的词，请告诉我原句或来源（书、歌词、游戏、聊天等），我可以帮你准确定位。"]}
