{"word":"AW","summary":{"en":"“aw” is an interjection showing sympathy, disappointment, or affection; “AW” can also be a context-dependent abbreviation.","zh":"“aw”是表示同情、惋惜或喜爱的感叹词；“AW”也可作需看语境的缩写。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"Used to show sympathy, disappointment, or gentle affection (often like “oh no” or “that’s sweet”).","zh":"（感叹词）用于表达同情、失望或温柔的喜爱（常类似“哎呀/唉/好可爱呀”）。"},"examples":[{"en":"Aw, are you okay? That looked painful.","zh":"哎呀，你没事吧？看起来很疼。"},{"en":"Aw, we missed the bus.","zh":"唉，我们错过公交了。"},{"en":"Aw, that puppy is so cute!","zh":"哇（哎呀），那只小狗太可爱了！"}]},{"partOfSpeech":"other","definition":{"en":"Abbreviation used in specific fields or names (meaning depends on context), e.g., atomic weight, airworthiness, or U.S. postal code for Aruba (AW).","zh":"（缩写）在特定领域或名称中使用，含义取决于语境，例如 atomic weight（原子量）、airworthiness（适航性）等；也可能出现在地区/代码中。"},"examples":[{"en":"The table lists each element’s AW (atomic weight).","zh":"表格列出了每种元素的 AW（原子量）。"},{"en":"Check the AW requirements before the aircraft test.","zh":"飞机测试前要检查适航性（AW）要求。"}]}],"synonyms":["oh","aww","oh no","oops"],"phonetic":"/ɔ/","extraExplanation":["“aw”在口语里很常见，语气通常比较温柔、带点可怜或惋惜的感觉；写在聊天中也常用来表达“心软了/被萌到了”。","拼写上常见重复来加强情绪：awww（更强烈的“太可爱了/好心疼”）。","注意区分“aw”（同情/惋惜）和“awe”（敬畏、惊叹的名词/动词）。"]}
{"word":"aw","summary":{"en":"“Aw” is an interjection used to express sympathy, affection/cuteness, or mild disappointment.","zh":"“aw”是感叹词，用来表达同情、怜爱/觉得可爱，或轻微的失望。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"Used to show sympathy, tenderness, or that something is cute or touching.","zh":"用于表达同情、怜爱，或觉得某事很可爱/很感人。"},"examples":[{"en":"Aw, are you okay?","zh":"啊/哎呀，你还好吗？"},{"en":"Aw, that puppy is so cute!","zh":"哇（好可爱）！那只小狗太萌了！"},{"en":"Aw, I’m sorry that happened to you.","zh":"哎呀，真遗憾你遇到这种事。"}]},{"partOfSpeech":"int.","definition":{"en":"Used to show mild disappointment or annoyance (often in a playful way).","zh":"用于表达轻微的失望或小小的不满（常带玩笑语气）。"},"examples":[{"en":"Aw, we just missed the bus.","zh":"哎呀，我们刚好错过公交了。"},{"en":"Aw, come on—just one more game!","zh":"哎，拜托——再玩一局嘛！"}]}],"synonyms":["aww","oh","ah","hey"],"phonetic":"/ɔ/","extraExplanation":["在口语和网络聊天里常写作“aww”来加强语气，拖得越长通常表示“越可爱/越心疼/越感动”。","“aw”也可能因语境不同而接近“oh/ah/hey”的感觉；具体情绪（同情、觉得可爱、失望）主要靠语气和上下文判断。"]}
{"word":"awa","summary":{"en":"“awa” is usually a cute internet interjection like “aww,” but in formal contexts it may be the acronym “AWA.”","zh":"“awa”通常是网络上的软萌感叹（类似“aww”），但在正式语境中也可能是缩写“AWA”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(Internet, informal) A cute, soft interjection—often like “aww” or a small gasp—used to show surprise, shyness, or something is adorable.","zh":"（网络用语，非正式）一种可爱、软萌的感叹，常相当于“aww/啊好可爱”或轻轻倒吸一口气，用来表示惊讶、害羞或觉得很萌。"},"examples":[{"en":"Awa… that kitten is so tiny!","zh":"Awa……那只小猫也太小了吧！"},{"en":"You remembered my birthday? Awa, thank you!","zh":"你还记得我生日？Awa，谢谢你！"},{"en":"She replied with “awa” and a bunch of hearts.","zh":"她回了个“awa”，还发了一堆爱心。"}]},{"partOfSpeech":"other","definition":{"en":"(Also written AWA) An abbreviation that can stand for different organizations or phrases depending on context (e.g., names of associations).","zh":"（也写作 AWA）缩写，具体含义取决于语境（例如某些协会或机构名称的缩写）。"},"examples":[{"en":"In this email, AWA refers to an industry association.","zh":"在这封邮件里，AWA 指的是一个行业协会。"},{"en":"Could you tell me what AWA stands for here?","zh":"你能告诉我这里的 AWA 代表什么吗？"}]}],"synonyms":["aww","wow","aw"],"phonetic":"/ˈɑwə/","extraExplanation":["“awa”在英文圈常见于二次元/聊天语境，带有卖萌、轻声惊讶的感觉；也有人把它当作表情拟声（像小嘴张开）。不同社群含义会有差异。","如果出现在正式文本（文件、邮件、机构名）里，更可能是缩写 AWA；要结合上下文（行业、地区、标题）才能确定全称。"]}
{"word":"Awabakal","summary":{"en":"Awabakal refers to an Aboriginal Australian people and their traditional language from the Lake Macquarie–Newcastle region of New South Wales.","zh":"Awabakal 指澳大利亚新南威尔士州麦格理湖—纽卡斯尔一带的原住民群体（阿瓦巴卡尔人）及其传统语言（阿瓦巴卡尔语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an Aboriginal Australian people whose traditional lands are around Lake Macquarie and the Newcastle area in New South Wales, Australia","zh":"阿瓦巴卡尔人：澳大利亚原住民群体之一，传统领地主要在新南威尔士州的麦格理湖（Lake Macquarie）及纽卡斯尔（Newcastle）一带"},"examples":[{"en":"The Awabakal people are the Traditional Owners of land around Lake Macquarie.","zh":"阿瓦巴卡尔人是麦格理湖周边土地的传统所有者（传统守护者）。"},{"en":"We begin by acknowledging Awabakal Country and paying respect to Elders past and present.","zh":"我们首先致谢阿瓦巴卡尔人的土地，并向过去与现在的长者致敬。"}]},{"partOfSpeech":"n.","definition":{"en":"the language traditionally spoken by the Awabakal people (often called the Awabakal language)","zh":"阿瓦巴卡尔语：阿瓦巴卡尔人传统使用的语言（常称 Awabakal language）"},"examples":[{"en":"Researchers have worked with the community to support the revival of Awabakal.","zh":"研究者与社区合作，支持阿瓦巴卡尔语的复振。"},{"en":"Some local place names come from Awabakal.","zh":"一些当地地名源自阿瓦巴卡尔语。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Awabakal people, their language, or their culture","zh":"与阿瓦巴卡尔人、阿瓦巴卡尔语或其文化有关的"},"examples":[{"en":"The museum has an Awabakal cultural exhibition.","zh":"博物馆有一个与阿瓦巴卡尔文化相关的展览。"},{"en":"She attended an Awabakal community event in Newcastle.","zh":"她在纽卡斯尔参加了一个阿瓦巴卡尔社区活动。"}]}],"synonyms":["Awabakal people","Awabakal language","Awabakal Country"],"phonetic":"/ˌɑːwəˈbɑːkəl/","extraExplanation":["“Awabakal”通常需要首字母大写，用作族群名或专名；在澳大利亚语境中也常见搭配“Awabakal Country”（阿瓦巴卡尔人的土地/家园）来表达对传统领地的尊重。","历史上，传教士与语言学者Lancelot Threlkeld曾记录过阿瓦巴卡尔语资料；如今不少地方会使用这些记录与社区知识来支持语言与文化的传承与复振。","使用时尽量遵循当地社区与机构的写法与致谢方式（Acknowledgement of Country），这在公共演讲、学校与正式活动中很常见。"]}
{"word":"awabakal","summary":{"en":"Awabakal refers to an Aboriginal Australian people from the Lake Macquarie/Newcastle area of NSW, and to their language; it can also be used as an adjective about them.","zh":"Awabakal 指新南威尔士州麦觉理湖/纽卡斯尔一带的澳大利亚原住民阿瓦巴卡尔人及其语言，也可作形容词表示“与阿瓦巴卡尔相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an Aboriginal Australian people (First Nations) traditionally from the area around Lake Macquarie and Newcastle in New South Wales, Australia","zh":"澳大利亚原住民（第一民族）之一：传统上居住在新南威尔士州的麦觉理湖（Lake Macquarie）与纽卡斯尔（Newcastle）一带的阿瓦巴卡尔人"},"examples":[{"en":"The Awabakal are the Traditional Custodians of land around Lake Macquarie.","zh":"阿瓦巴卡尔人是麦觉理湖一带土地的传统守护者。"},{"en":"Many local place names come from Awabakal language and culture.","zh":"许多当地地名源自阿瓦巴卡尔语言与文化。"}]},{"partOfSpeech":"n.","definition":{"en":"the traditional language of the Awabakal people (often referred to as the Awabakal language)","zh":"阿瓦巴卡尔语：阿瓦巴卡尔人的传统语言（常称“Awabakal language”）"},"examples":[{"en":"Some community programs support learning Awabakal in local schools.","zh":"一些社区项目支持在当地学校学习阿瓦巴卡尔语。"},{"en":"Researchers have recorded word lists from Awabakal speakers in historical documents.","zh":"研究者在历史文献中记录了阿瓦巴卡尔语使用者的词汇表。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Awabakal people, their language, or their Country (traditional lands)","zh":"与阿瓦巴卡尔人、阿瓦巴卡尔语或其“Country/传统领地”有关的"},"examples":[{"en":"The museum hosted an Awabakal cultural event.","zh":"博物馆举办了一场阿瓦巴卡尔文化活动。"},{"en":"We began the meeting with an Acknowledgement of Country for Awabakal land.","zh":"我们在会议开始时对阿瓦巴卡尔之地进行了“承认传统领地”的致意。"}]}],"synonyms":["Awabakal people","Awabakal language"],"phonetic":"ˌɑːwəˈbɑːkəl","extraExplanation":["“Awabakal”在澳大利亚语境中通常作为专名使用，首字母大写。它既可指族群，也可指语言；在写作中可用更明确的说法，如“the Awabakal people / the Awabakal language”。","澳大利亚常见表达“Country”（首字母有时大写）在原住民语境里指与族群身份、文化、精神与祖传土地相连的整体概念，不仅仅是“国家”。","在公共场合常见的“Welcome to Country / Acknowledgement of Country”是对传统守护者的尊重性仪式或致意；使用时应遵循当地社区的惯例与指导。"]}
{"word":"awabi","summary":{"en":"Awabi means “abalone” in Japanese, commonly used on Japanese food menus.","zh":"Awabi 是日语“鲍鱼”的说法，常用于日式料理菜单中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Japanese) abalone; a type of edible sea snail, often served in sushi or sashimi.","zh":"（日语）鲍鱼；一种可食用的海螺，常见于寿司或刺身中。"},"examples":[{"en":"The sushi chef offered awabi as a seasonal special.","zh":"寿司师傅把 awabi（鲍鱼）作为当季特供。"},{"en":"Awabi can be served raw, lightly grilled, or simmered.","zh":"Awabi 可以生吃、轻烤，或炖煮后食用。"}]}],"synonyms":["abalone"],"phonetic":"/ɑˈwɑːbi/","extraExplanation":["「awabi」来自日语「あわび」（常写作汉字「鮑」）。在英语菜单上也常直接写作 *awabi*，尤其是在日式餐厅，用来强调食材的日式语境。","点餐时常见相关搭配：*awabi sushi*（鲍鱼寿司）、*awabi sashimi*（鲍鱼刺身）、*grilled awabi*（烤鲍鱼）。有些英文菜单会改用更通用的 *abalone*。"]}
{"word":"awacian","summary":{"en":"“Awacian” is not a standard English word; it’s likely a misspelling or a name.","zh":"“awacian”不是标准英语单词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a proper name (e.g., a username, place name, or a fictional term).","zh":"不是标准英语单词，更可能是拼写错误或专有名词（如用户名、地名或虚构词）。"},"examples":[{"en":"I can’t find “awacian” in standard dictionaries—could you share the sentence where you saw it?","zh":"我在常见词典里找不到“awacian”——你能把它出现的句子发我看看吗？"},{"en":"If you meant “Caucasian,” it refers to a person of European ancestry in many contexts.","zh":"如果你想写的是“Caucasian”，在很多语境中它指欧洲血统的人（白人）。"}]}],"phonetic":"/əˈweɪʃən/","extraExplanation":["“awacian”最常见的情况是拼写误差。请你提供：1）它出现的完整句子；2）你想表达的意思（人种/地点/名字/游戏设定等）；3）是否来自某个作品或游戏。","如果你原本想写的是“Caucasian”（常见拼写接近），需要注意它是与“种族/族裔”相关的词，在不同国家与语境里可能较敏感；写作时更推荐用更具体、更中性的表达（例如“a person of European descent/ancestry”）以避免冒犯或误解。"]}
{"word":"AWACS","summary":{"en":"AWACS refers to an airborne radar-based early-warning and command system, often meaning the aircraft itself.","zh":"AWACS 指基于空中雷达的预警与指挥系统，常也直接指预警机。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an airborne early-warning and control system (usually a radar aircraft) that detects aircraft or missiles from far away and directs military operations","zh":"空中预警与指挥系统（通常指装有雷达的预警机），用于远距离发现飞机或导弹并指挥军事行动"},"examples":[{"en":"The navy requested AWACS support to monitor the airspace over the fleet.","zh":"海军请求 AWACS 支援，以监控舰队上空的空域。"},{"en":"AWACS aircraft can track many targets at the same time.","zh":"AWACS 预警机可以同时跟踪多个目标。"}]}],"synonyms":["AEW&C (airborne early warning and control)","airborne early-warning aircraft","E-3 Sentry (specific aircraft)"],"phonetic":"/ˈeɪwæks/","extraExplanation":["AWACS 是缩写，来自 Airborne Warning and Control System（空中预警与指挥系统）。在新闻报道里，AWACS 既可指“系统能力”，也常直接指“预警机/预警指挥机”本身。","相关概念：AEW&C（Airborne Early Warning and Control，空中预警与控制）是更宽泛的称呼；著名机型如美国的 E-3 Sentry 常被称为 AWACS。"]}
{"word":"awacs","summary":{"en":"AWACS is a military radar-and-command aircraft used for early warning and airspace control.","zh":"AWACS指用于空中预警与指挥控制的军用雷达预警机。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Airborne Warning and Control System: an aircraft with powerful radar and communication equipment used to detect other aircraft and coordinate military operations.","zh":"空中预警与控制系统：装有强大雷达与通信设备的飞机，用于探测空中目标并指挥协调军事行动。"},"examples":[{"en":"The AWACS plane monitored the airspace and guided the fighters toward the incoming aircraft.","zh":"AWACS预警机监视空域，并引导战斗机接近来袭飞机。"},{"en":"During the operation, AWACS provided early warning and coordinated communication between units.","zh":"在行动中，AWACS提供预警，并协调各部队之间的通信。"}]}],"synonyms":["airborne early warning aircraft","AEW&C (airborne early warning and control)","radar plane"],"phonetic":"/ˈeɪ.wæks/","extraExplanation":["AWACS通常指由美国波音E-3“望楼”（Sentry）等机型代表的预警机类型；在中文里常说“预警机”或“空中预警机”。","读法上常逐字母读作“A-W-A-C-S”，也有人把它当作一个词读成类似“AY-wacks”。","在军事新闻与历史语境中，AWACS常与“制空权”“指挥控制（C2）”“态势感知”等概念一起出现。"]}
{"word":"Awad","summary":{"en":"Awad is a name (first name or last name) often found in Arabic-speaking cultures.","zh":"Awad 是一个常见于阿拉伯语文化中的人名（名或姓）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a personal name (given name or family name), commonly used in Arabic-speaking communities","zh":"人名（名字或姓氏），在阿拉伯语社群中较常见"},"examples":[{"en":"Awad lives in Chicago now, but his family is originally from Sudan.","zh":"Awad 现在住在芝加哥，但他家最初来自苏丹。"},{"en":"Ms. Awad will lead today’s meeting.","zh":"Awad 女士将主持今天的会议。"}]}],"synonyms":["Awwad","Awadh"],"phonetic":"/əˈwɑːd/","extraExplanation":["Awad 常见为阿拉伯姓名的拉丁字母拼写；不同地区或家庭可能有不同转写方式与读音（例如 Awad / Awwad / Awadh）。","作为名字时，有时与阿拉伯语词根含义相关（不同来源可能解释为“补偿、回报”等），但具体含义会因拼写与地区而异；若需要准确含义，最好结合其阿拉伯语原拼写来确认。"]}
{"word":"Awadhi","summary":{"en":"Awadhi is a North Indian language (often viewed as a Hindi dialect) from the Awadh region, and it can also describe things connected to that region and culture.","zh":"Awadhi 指阿瓦德地区的一种北印度语言（常被视为印地语方言），也可作形容词表示与该地区及其文化有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a language (often called a dialect of Hindi) spoken mainly in the Awadh region of Uttar Pradesh, India","zh":"阿瓦迪语（Awadhi）：主要在印度北方邦阿瓦德（Awadh）地区使用的一种语言（也常被视为印地语的方言）"},"examples":[{"en":"Awadhi is widely spoken in the districts around Ayodhya and Lucknow.","zh":"阿瓦迪语在阿约提亚和勒克瑙周边的许多地区使用很广。"},{"en":"Some folk songs and oral stories are traditionally performed in Awadhi.","zh":"一些民歌和口述故事传统上会用阿瓦迪语表演。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Awadh region or to the Awadhi language and culture","zh":"与阿瓦德地区有关的；与阿瓦迪语及其文化有关的"},"examples":[{"en":"He studies Awadhi literature and regional history.","zh":"他研究阿瓦迪语文学和地方历史。"},{"en":"The museum has an exhibit on Awadhi cuisine and customs.","zh":"博物馆有一个关于阿瓦德菜系与风俗的展览。"}]}],"synonyms":["Avadhi","Awadhi language"],"phonetic":"/əˈwɑːdi/","extraExplanation":["“Awadhi”也常见拼写为“Avadhi”。它属于印欧语系的印度-雅利安语支，与印地语/乌尔都语在语法和词汇上有亲缘关系，但在发音、词汇与表达习惯上具有明显地域特色。","在文学与文化中，阿瓦迪语常与北印度的民间叙事、歌谣传统联系在一起；许多学习者也会在讨论北印度史诗与宗教文学传统时遇到这一名称。"]}
{"word":"awadhi","summary":{"en":"Awadhi is a Hindi dialect from the Awadh region of northern India.","zh":"Awadhi 是印度北部阿瓦德地区的一种印地语方言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a dialect of Hindi spoken mainly in the Awadh (Oudh) region of Uttar Pradesh, India","zh":"阿瓦迪语（方言）：主要在印度北方邦阿瓦德（Awadh/Oudh）地区使用的印地语方言"},"examples":[{"en":"Awadhi is widely heard in everyday life in parts of Uttar Pradesh.","zh":"在北方邦的一些地区，日常生活中很常听到阿瓦迪语。"},{"en":"Some famous songs and poems are written in Awadhi.","zh":"一些著名的歌曲和诗歌是用阿瓦迪语写成的。"}]}],"synonyms":["Awadhī","dialect of Hindi"],"phonetic":"/əˈwɑːdi/","extraExplanation":["“Awadhi”也常写作“Awadhi language”，中文有时译作“阿瓦德语/阿瓦迪语”。它与标准印地语近缘，但在发音、词汇和语法上有自己的特点。","文化上，Awadhi常与北印度的民间传统和宗教文学联系在一起；最常被提到的经典是图尔西达斯（Tulsidas）的史诗《Ramcharitmanas》，常被认为使用了Awadhi（或与其非常接近的语言形式）。"]}
{"word":"awaft","summary":{"en":"Awaft means floating or being carried lightly through the air, often in literary descriptions.","zh":"Awaft 指“轻轻飘浮、随风飘来/飘去”，多用于文学或描写性语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"floating or being carried lightly through the air (often used in phrases like “waft/awaft on the wind”).","zh":"（轻轻地）在空中飘浮；被风轻轻带着（常见于“waft/awaft on the wind”等搭配）。"},"examples":[{"en":"The smell of fresh bread came wafting/awaft on the morning air.","zh":"新鲜面包的香味随着清晨的空气飘来。"},{"en":"A few petals drifted awaft across the lake.","zh":"几片花瓣轻轻飘过湖面。"}]},{"partOfSpeech":"adj.","definition":{"en":"(literary) carried or drifting in the air; floating.","zh":"（文学用法）被风带着的；飘浮的。"},"examples":[{"en":"She listened to the awaft music from the street below.","zh":"她听着从楼下街道飘来的音乐。"},{"en":"An awaft ribbon of smoke rose from the chimney.","zh":"一缕飘散的烟从烟囱升起。"}]}],"synonyms":["wafting","drifting","floating","borne (on the wind)","carried"],"phonetic":"/əˈwæft/","extraExplanation":["“awaft”较少单独使用，更多见于文学或较正式的描写中，强调“轻、柔、飘”的感觉。日常英语更常用“wafting”“drifting”“floating”。","词源上，“a-”是古英语里表示“在……之中/向……的”前缀（类似“afloat, asleep”），加上“waft（飘送）”，形成“awaft（飘着/飘来）”。"]}
{"word":"awag","summary":{"en":"“Awag” is not a standard spelling; it usually means “a wag,” a witty person who jokes and teases playfully.","zh":"“awag”不是标准拼写；通常指“a wag”，意为机智爱开玩笑、喜欢逗趣的人。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Usually written as “a wag”) a person who likes to joke and tease others in a clever, playful way; a witty joker.","zh":"（通常写作“a wag”）爱开玩笑、爱逗人、很机智的“逗趣的人/诙谐的人”。"},"examples":[{"en":"He’s a wag—he kept the whole team laughing during the long meeting.","zh":"他很会逗趣——在冗长的会议里一直把整个团队逗笑。"},{"en":"Don’t take her comments too seriously; she’s a bit of a wag.","zh":"别太当真她的话；她有点爱开玩笑。"}]}],"synonyms":["joker","wit","tease","prankster"],"phonetic":"ə ˈwæɡ","extraExplanation":["“awag”并不是常见的标准英文拼写；更常见的是分开写作“a wag”。“wag”本义与“摇摆/摆动”有关（如狗摇尾巴），引申出“爱逗趣、爱打趣的人”的用法。","在较正式或现代口语中，也可以用“joker”“funny guy/gal”“tease”来表达类似意思；“wag”带一点英式、略文雅或书面风味。"]}
{"word":"await","summary":{"en":"Await means “wait for” or “be in store for,” and it takes a direct object (no “for”).","zh":"await 表示“等待/期待”或“（未来）等待着”，是及物动词，后面直接接宾语（通常不加 for）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to wait for someone or something (often a bit formal); to expect something to arrive or happen","zh":"等待（某人或某事）（语气较正式）；期待某事发生或到来"},"examples":[{"en":"We are awaiting the test results.","zh":"我们正在等待检测结果。"},{"en":"A taxi was awaiting us outside the hotel.","zh":"一辆出租车在酒店外等着我们。"},{"en":"I’ll await your reply.","zh":"我会等你的回复。"}]},{"partOfSpeech":"vt.","definition":{"en":"to be going to happen to someone; to be in the future for someone (often about something important or uncertain)","zh":"（某事）将发生在（某人）身上；（未来）等待着（某人）（常指重要或不确定的事）"},"examples":[{"en":"A difficult decision awaits you.","zh":"一个艰难的决定在等着你。"},{"en":"We don’t know what awaits us after graduation.","zh":"我们不知道毕业后会有什么在等着我们。"}]}],"synonyms":["wait for","expect","anticipate","look forward to"],"phonetic":"/əˈweɪt/","extraExplanation":["“await”是及物动词，后面直接加宾语：await the bus / await your answer；一般不说“await for”。","语气上，“await”比“wait (for)”更正式，常用于书面语、通知、邮件或文学表达。","常见搭配：await a reply/response、await results/confirmation、await approval、await trial。"]}
{"word":"awaited","summary":{"en":"“Awaited” means “waited for” or “expected,” used as the past form of “await” or as an adjective meaning “long-anticipated.”","zh":"“awaited”表示“已等待/已期待”，既可作“await”的过去式/过去分词，也可作形容词表示“期待已久的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense / past participle of “await”) waited for; expected or hoped for.","zh":"（await 的过去式/过去分词）等待；期待；盼望。"},"examples":[{"en":"We awaited the test results anxiously.","zh":"我们焦急地等待考试结果。"},{"en":"They awaited news from home.","zh":"他们在等待家里的消息。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective) expected for a long time; anticipated.","zh":"（形容词）久候的；期待已久的；盼望已久的。"},"examples":[{"en":"At last, the awaited email arrived.","zh":"终于，那封期待已久的邮件来了。"},{"en":"Her awaited return made everyone feel relieved.","zh":"她盼望已久的归来让大家都松了一口气。"}]}],"synonyms":["expected","anticipated","long-awaited","hoped-for","waited-for"],"phonetic":"/əˈweɪtɪd/","extraExplanation":["“awaited”常见有两种用法：\n1) 动词形式：作为“await”的过去式/过去分词（如：We have awaited…）。\n2) 形容词形式：放在名词前，表示“期待已久的”（如：the awaited moment）。","“await”比“wait for”更正式一些，常用于书面语或较正式的表达：await a reply / await results。日常口语更常说 wait for a reply。"]}
{"word":"awaiter","summary":{"en":"“Awaiter” means a person who is waiting, especially in formal or literary English.","zh":"“awaiter”指“等待的人/等候者”，较正式或偏文学用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is waiting for something to happen or for someone to arrive","zh":"等待某事发生或等待某人到来的人；等候者"},"examples":[{"en":"As an anxious awaiter, she kept checking her phone for the final decision.","zh":"作为一个焦急的等候者，她不断查看手机等待最终决定。"},{"en":"The station was full of awaiters hoping to see loved ones step off the train.","zh":"车站里满是等候者，盼着亲人从火车上下来。"}]}],"synonyms":["waiter (in the sense of “one who waits”)","person waiting","onlooker (sometimes, depending on context)"],"phonetic":"/əˈweɪtər/","extraExplanation":["“awaiter”不算常用词，更常见的说法是“someone who is waiting / a person waiting”，或用更具体的词如“passenger（乘客）”“guest（宾客）”“visitor（来访者）”。","它来自动词“await（等待）”，常见于较正式或文学性的语境，用来强调“等待中的人”这一身份。"]}
{"word":"awaiters","summary":{"en":"“Awaiters” means people who are waiting; in computing it can mean async “awaiter” objects.","zh":"“awaiters”指等候的人；在计算机语境中也可指异步编程里的“awaiter（等待器）”对象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who are waiting for something or someone; people who await","zh":"等待某事或某人的人；等候者"},"examples":[{"en":"The award ceremony began after all the awaiters were seated.","zh":"颁奖典礼在所有等候者就座后开始。"},{"en":"A long line of awaiters formed outside the theater.","zh":"剧院外排起了一长队等候入场的人。"}]},{"partOfSpeech":"n.","definition":{"en":"(computing, especially C#/.NET) objects used in asynchronous programming that represent or handle “waiting” for a task to complete","zh":"（计算机领域，尤指 C#/.NET）异步编程中的“等待器/等待对象”，用于表示或处理等待任务完成"},"examples":[{"en":"In this library, custom awaiters control how tasks resume after completion.","zh":"在这个库中，自定义 awaiters 用来控制任务完成后如何继续执行。"},{"en":"The method returns an awaiter that signals when the operation is done.","zh":"该方法返回一个 awaiter，用来在操作完成时发出信号。"}]}],"synonyms":["waiters","those waiting","onlookers","spectators"],"phonetic":"/əˈweɪtərz/","extraExplanation":["“awaiters”是“awaiter”的复数。日常英语里更常见的表达是“people who are waiting”或“those waiting”。","在编程语境中，尤其是 C# 里，“awaiter”是一个专门术语（与 async/await 相关），通常出现在技术文档或源码中，而不用于日常对话。"]}
{"word":"awaiting","summary":{"en":"“Awaiting” means waiting for or expecting something, often in a more formal or written style.","zh":"“awaiting” 表示“等待/期待”，语气更正式、更书面。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"waiting for something to happen or for someone/something to arrive; expecting","zh":"等待（某事发生或某人/某物到来）；期待中的"},"examples":[{"en":"We are awaiting your reply.","zh":"我们在等待你的回复。"},{"en":"Two guests are awaiting you in the lobby.","zh":"有两位客人在大厅等你。"},{"en":"Everyone was awaiting the results of the exam.","zh":"大家都在等待考试结果。"}]},{"partOfSpeech":"v.","definition":{"en":"(present participle of “await”) to wait for; to expect something/someone","zh":"（await 的现在分词）等待；期待（某事/某人）"},"examples":[{"en":"I’m awaiting confirmation from the airline.","zh":"我在等航空公司的确认。"},{"en":"They are awaiting the doctor’s call.","zh":"他们在等医生的电话。"}]}],"synonyms":["waiting","expecting","pending"],"phonetic":"/əˈweɪtɪŋ/","extraExplanation":["“await” 比 “wait for” 更正式、更书面，常用于邮件、公告、报道中：awaiting your response / awaiting approval。","常见搭配：awaiting + 名词（awaiting payment/approval/confirmation）。一般不说 *awaiting for*（错误用法）。"]}
{"word":"Awaitlala","summary":{"en":"“Awaitlala” isn’t a standard English word; you may mean “await” = to wait for something/someone, often in a formal style.","zh":"“Awaitlala”不是标准英语词；你可能想问“await”，表示等待某事/某人，语气较正式。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"This exact form is not a standard English word. It looks like a misspelling or a username. If you meant “await,” it means to wait for something (often something expected).","zh":"这个拼写本身不是标准英语单词，看起来像拼写错误或用户名。如果你想问的是“await”，意思是“等待（某事，通常是预期会发生的事）”。"},"examples":[{"en":"“Awaitlala” isn’t in most dictionaries—did you mean “await”?","zh":"“Awaitlala”在大多数词典里找不到——你是不是想写“await”？"}]},{"partOfSpeech":"vt.","definition":{"en":"to wait for something to happen or for someone to arrive","zh":"等待某事发生或等待某人到来"},"examples":[{"en":"We await your reply.","zh":"我们等待你的回复。"},{"en":"A warm meal awaited us at home.","zh":"家里有一顿热饭在等着我们。"}]}],"synonyms":["wait for","expect","look forward to"],"phonetic":"/əˈweɪt/","extraExplanation":["“await”更正式，常见于邮件/通知：We await your response. 口语里更常用“wait for”：I’m waiting for your reply。","“await”也可以表示“（某事）在前方等着你/即将发生”：A surprise awaits you（你将迎来一个惊喜）。"]}
{"word":"awaitlala","summary":{"en":"“Await” means to wait for or expect something; it’s a more formal way to say “wait for.”","zh":"“await”表示等待或期待某事发生/到来，比“wait for”更正式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to wait for something (or someone) to happen or arrive; to expect something that will happen in the future","zh":"等待（某事/某人）发生或到来；期待（将要发生的事）"},"examples":[{"en":"We are awaiting your reply.","zh":"我们在等待你的回复。"},{"en":"A difficult decision awaits you.","zh":"一个艰难的决定在等着你。"}]},{"partOfSpeech":"v.","definition":{"en":"to be ready for and likely to happen to someone (often used with something unpleasant or challenging)","zh":"（常指不愉快或具挑战的事）即将发生在某人身上；在前方等着某人"},"examples":[{"en":"If you don’t back up your files, trouble may await.","zh":"如果你不备份文件，麻烦可能就在前面等着。"},{"en":"New opportunities await after graduation.","zh":"毕业后新的机会在等着你。"}]}],"synonyms":["wait for","expect","anticipate"],"phonetic":"/əˈweɪt/","extraExplanation":["“await”比“wait for”更正式，常见于书面语、通知、邮件（如 business email）中：We await your response.","语法小提示：await后面可以直接接宾语（await your reply），而wait通常要用“wait for + 宾语”（wait for your reply）。"]}
{"word":"awaits","summary":{"en":"“awaits” means “waits for” or “is waiting for,” often in a formal tone.","zh":"“awaits”表示“在等待/等待着”，常较正式，也可表示“（某事）在前方等着（将发生）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(third-person singular of “await”) to wait for something or someone, often with expectation; to be ready for something that will happen.","zh":"（await 的第三人称单数）等待某人/某物（常带期待）；（事情）即将发生、在前方等着。"},"examples":[{"en":"The students await the exam results.","zh":"学生们在等待考试成绩。"},{"en":"A warm welcome awaits you at the door.","zh":"门口有热情的欢迎在等着你。"},{"en":"No one knows what awaits us next year.","zh":"没人知道明年等待我们的是什么。"}]}],"synonyms":["waits for","expects","anticipates","looks forward to"],"phonetic":"əˈweɪts","extraExplanation":["“await”比“wait for”更正式、更书面一些；口语里更常说“wait for”。","“awaits”用于主语是第三人称单数（he/she/it/单数名词）时：e.g., “A challenge awaits.”","“await”后面通常直接接宾语（await + noun/pronoun），不像“wait”常需要介词：wait for + noun/pronoun。"]}
{"word":"awakable","summary":{"en":"“Awakable” means “able to be awakened,” but it’s rare; “wakeable/awakenable” are more common.","zh":"awakable 表示“可被唤醒的”，但较少见；更常用 wakeable / awakenable。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to be awakened; not so deeply asleep that waking is impossible (rare; more common: “wakeable” or “awakenable”).","zh":"可被叫醒的；（睡得不太沉）能被唤醒的（较少见；更常用：wakeable / awakenable）。"},"examples":[{"en":"He was sick, but still awakable when the nurse called his name.","zh":"他生病了，但护士喊他的名字时他还是能被叫醒。"},{"en":"Keep the baby lightly covered so she stays comfortable and awakable.","zh":"给宝宝盖薄一点，让她既舒服也更容易被叫醒。"}]}],"synonyms":["wakeable","awakenable","rouseable"],"phonetic":"/əˈweɪkəbəl/","extraExplanation":["“awakable”在现代英语中很少见，多数场合母语者会用“wakeable”（更口语）或“awakenable”（更正式）。","构词上相当于 awake + -able（“可……的”）。注意：awake常见搭配是“be awake（醒着）”，而表达“叫醒某人”更常用 wake (someone) up / awaken (someone)。"]}
{"word":"Awake","summary":{"en":"“Awake” most commonly means “not sleeping.” It can also mean “to wake up” or “to awaken interest/awareness.”","zh":"“Awake”最常见意思是“醒着的”。它也可表示“醒来”，或“唤起兴趣/意识”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not sleeping; conscious and able to notice things","zh":"醒着的；未入睡的；有意识并能注意到周围事物的"},"examples":[{"en":"I was still awake at midnight, thinking about tomorrow.","zh":"我到半夜还醒着，一直在想明天的事。"},{"en":"Are you awake? I need to tell you something.","zh":"你醒着吗？我有件事要跟你说。"}]},{"partOfSpeech":"vi.","definition":{"en":"to wake up (stop sleeping)","zh":"醒来；从睡眠中醒"},"examples":[{"en":"I woke up early and lay awake for an hour.","zh":"我很早就醒了，然后清醒地躺了一个小时。"},{"en":"She woke the baby up, and he stayed awake.","zh":"她把宝宝叫醒了，宝宝就一直醒着。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make someone become interested in or aware of something","zh":"唤起（兴趣/意识）；使开始注意到某事"},"examples":[{"en":"The film awakened my interest in history.","zh":"那部电影唤起了我对历史的兴趣。"},{"en":"The news woke people up to the seriousness of the problem.","zh":"这条新闻让人们意识到问题的严重性。"}]}],"synonyms":["alert","conscious","awake (up)","wake","awaken"],"phonetic":"/əˈweɪk/","extraExplanation":["“awake”既可以作形容词（awake），也可以作动词（awake / awaken）。日常更常用的动词是“wake (up)”。例如：wake up（醒来/叫醒）比 awake 更口语自然。","常见搭配：stay awake（保持清醒）、be wide awake（完全清醒）、lie awake（躺着睡不着）、awake to sth（意识到……）。","词形提示：awake–awoke–awoken（较正式/文学）；awaken–awakened–awakened（更常见于“唤起、唤醒意识”的意思）。"]}
{"word":"awake","summary":{"en":"“Awake” means not sleeping, and it can also mean to wake up or to wake someone up (more formal).","zh":"awake 表示“醒着的”，也可作动词表示“醒来”或“唤醒（较正式）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not sleeping; conscious and able to notice what is happening","zh":"醒着的；未睡着的；有意识并能注意到周围情况的"},"examples":[{"en":"Are you awake, or should I call you back later?","zh":"你醒着吗，还是我晚点再打给你？"},{"en":"I was awake all night worrying about the exam.","zh":"我整晚都醒着，担心考试。"},{"en":"The baby is finally awake and ready to eat.","zh":"宝宝终于醒了，准备吃东西了。"}]},{"partOfSpeech":"v.","definition":{"en":"to wake up; to become conscious after sleeping","zh":"醒来；从睡眠中变得清醒"},"examples":[{"en":"I usually awake at 6 a.m. on weekdays.","zh":"我工作日通常早上六点醒来。"},{"en":"She awoke suddenly when the phone rang.","zh":"电话响时她突然醒来。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cause someone to wake up (often in writing or formal style)","zh":"唤醒；使某人醒来（常用于书面或较正式语境）"},"examples":[{"en":"The noise awoke the whole neighborhood.","zh":"噪音把整个社区都吵醒了。"},{"en":"Try not to awake the children.","zh":"尽量别把孩子们吵醒。"}]}],"synonyms":["alert","conscious","wake","awaken"],"phonetic":"/əˈweɪk/","extraExplanation":["“awake”既可作形容词也可作动词。动词过去式常见为“awoke”，过去分词常见为“awoken”（也可见“awaked”，但较少用）。","常见搭配：stay awake（保持清醒/不睡）、be wide awake（非常清醒）、awake to（意识到：be awake to the danger＝意识到危险）。在文学或较正式语境中，awake也可引申为“唤起（情感/意识）”，如“awake curiosity”（唤起好奇心）。"]}
{"word":"awakeable","summary":{"en":"Awakeable means “able to be awakened,” sometimes used in medical/technical writing.","zh":"Awakeable 指“可被唤醒的”，有时用于医学或技术写作。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to be awakened; not impossible to wake up (often used in medical or technical contexts).","zh":"可被唤醒的；可以叫醒的（常见于医学或技术语境）。"},"examples":[{"en":"The patient is awakeable with loud verbal cues.","zh":"用大声口头呼唤可以把病人唤醒。"},{"en":"If your child is awakeable, try speaking softly before turning on the lights.","zh":"如果孩子还能叫醒，先轻声说话再开灯。"}]},{"partOfSpeech":"adj.","definition":{"en":"able to be brought to awareness or alertness (more figurative, less common).","zh":"（比喻）可被唤起意识/警觉的（较少见）。"},"examples":[{"en":"Curiosity is awakeable when the topic feels personal.","zh":"当话题与自己有关时，好奇心更容易被唤起。"},{"en":"A good story makes empathy feel awakeable again.","zh":"一个好故事会让同理心再次变得可被唤起。"}]}],"synonyms":["rousable","arousable","wakenable","able to be awakened"],"phonetic":"/əˈweɪkəbəl/","extraExplanation":["“awakeable”在日常英语里比较少见，更常见的表达是“can be awakened / can be woken (up)”或“rousable（可唤醒的）”。","构词上是 awake + -able（表示“能够……的”），类似于“readable（可读的）”“breakable（易碎的）”。在医疗记录中也可能看到“arousable / rousable”等更固定的术语。"]}
{"word":"awaked","summary":{"en":"“Awaked” is an archaic/poetic form of the past tense or past participle of “awake.”","zh":"“awaked”是“awake”的过时/诗意用法的过去式或过去分词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"an old-fashioned or poetic past tense/past participle of “awake” (today usually “awoke” or “awoken”).","zh":"“awake”的过时/诗歌用法的过去式或过去分词（现代英语通常用“awoke”或“awoken”）。"},"examples":[{"en":"He awaked before dawn and listened to the rain.","zh":"他在黎明前醒来，听着雨声。"},{"en":"She lay still, as if newly awaked from a dream.","zh":"她一动不动地躺着，仿佛刚从梦中醒来。"}]}],"synonyms":["awoke","awoken","woke (up)"],"phonetic":"/əˈweɪkt/","extraExplanation":["“awaked”在现代日常英语里很少用，更多见于旧文学、宗教文本或模仿古风/诗意的写作。","现代常用搭配：过去式用“awoke”（I awoke suddenly. 我突然醒来），过去分词用“awoken”（I have awoken early all week. 我这周一直很早醒来）。"]}
{"word":"awaken","summary":{"en":"Awaken means to wake up, to wake someone up, or to stir a feeling or awareness.","zh":"Awaken 指“醒来/叫醒”，也可引申为“唤起情感、兴趣或意识”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to wake up; to stop sleeping","zh":"醒来；从睡眠中醒"},"examples":[{"en":"I usually awaken at 6 a.m. on weekdays.","zh":"我平日通常早上6点醒来。"},{"en":"She awakened suddenly because of the noise.","zh":"她被噪音突然吵醒了。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make someone wake up","zh":"唤醒某人"},"examples":[{"en":"Please awaken me if I fall asleep on the train.","zh":"如果我在火车上睡着了，请叫醒我。"},{"en":"The alarm awakened the whole house.","zh":"闹钟把整栋房子都吵醒了。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cause a feeling, interest, or idea to begin; to make something become active or strong","zh":"唤起（情感/兴趣/想法）；激发；使觉醒"},"examples":[{"en":"The film awakened my interest in history.","zh":"这部电影唤起了我对历史的兴趣。"},{"en":"The speech awakened hope in the audience.","zh":"那场演讲唤起了观众的希望。"}]}],"synonyms":["wake (up)","rouse","arouse","stir"],"phonetic":"/əˈweɪkən/","extraExplanation":["“Awaken”比“wake (up)”更正式一些，也更常见于书面语、文学或演讲中。日常口语里更常说“wake up”。","语法上，“awaken”既可作及物动词（awaken someone/something），也可作不及物动词（I awaken）。过去式/过去分词常见两种：awakened（更常用、更规则）与 awoke/awoken（较文学或强调时出现）。","引申义里，“awaken”常用于谈“意识/良知/兴趣/希望”的觉醒或被激发：awaken awareness / awaken curiosity / awaken a desire。"]}
{"word":"awakenable","summary":{"en":"Awakenable means “able to be awakened” (literally or figuratively).","zh":"Awakenable 指“可被唤醒的”，也可引申为“可被唤起/激发的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to be awakened (woken up), or able to be made aware/active after being dormant","zh":"可被唤醒的；（也可指）可被唤起、激发的（从沉睡/停滞状态变得活跃或有意识）"},"examples":[{"en":"The patient is awakenable and responds to simple questions.","zh":"病人可以被唤醒，并能回答简单问题。"},{"en":"After the alarm, she was awakenable but still very groggy.","zh":"闹钟响后她能被叫醒，但仍然很迷糊。"},{"en":"His curiosity is awakenable when you give him a real problem to solve.","zh":"只要给他一个需要解决的真实问题，他的好奇心就能被激发出来。"}]}],"synonyms":["arousable","wakeable","rouseable","able to be awakened"],"phonetic":"əˈweɪkənəbəl","extraExplanation":["“awakenable”由动词“awaken（唤醒）”+后缀“-able（能够……的/可被……的）”构成，意思直观但在日常英语中比较少见。更常用的表达是“able to be awakened / can be awakened”，或在医学语境中用“arousable（可唤醒的）”。"]}
{"word":"awakened","summary":{"en":"“Awakened” means “woken up” or “made aware,” and it’s also the past form of “awaken.”","zh":"“awakened”意为“醒来的/被唤醒的”或“开始意识到的”，也可作“awaken”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"no longer asleep; woken up","zh":"醒着的；被唤醒的"},"examples":[{"en":"I was awakened by a loud noise outside.","zh":"我被外面一声巨响吵醒了。"},{"en":"She sat up, fully awakened and alert.","zh":"她坐起身来，完全清醒而警觉。"}]},{"partOfSpeech":"adj.","definition":{"en":"suddenly aware of something, especially a feeling, problem, or new idea","zh":"（对某事）突然意识到；觉醒（尤指情感、问题或新想法）"},"examples":[{"en":"Many people have awakened to the dangers of misinformation online.","zh":"许多人已经意识到网络虚假信息的危险。"},{"en":"His speech awakened hope in the crowd.","zh":"他的演讲唤起了人群的希望。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “awaken”: to wake someone up, or to begin to feel/realize something","zh":"“awaken”的过去式/过去分词：唤醒；使开始感觉到/意识到"},"examples":[{"en":"The storm awakened everyone in the house.","zh":"暴风雨把屋里所有人都吵醒了。"},{"en":"Travel awakened her interest in history.","zh":"旅行唤起了她对历史的兴趣。"}]}],"synonyms":["woke","aroused","stirred","alerted","aware"],"phonetic":"/əˈweɪkənd/","extraExplanation":["“awaken”比“wake (up)”更书面、更有文学感，常用于强调一种“逐渐或深刻的觉醒”（如awaken interest/hope/awareness）。日常口语里更常说“wake up”。","用法提示：awaken可以及物（awaken someone）也可以不及物（I awakened suddenly）。作为形容词“awakened”常见于“an awakened mind/awakened awareness”（觉醒的心智/意识）。"]}
{"word":"awakener","summary":{"en":"An awakener is someone or something that wakes people up or sparks awareness and action.","zh":"awakener 指叫醒者或唤醒意识/行动的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that wakes someone/something up, or that causes awareness, interest, or action to begin","zh":"叫醒者；唤醒者（使人/事物醒来或引发觉醒、兴趣或行动的人或事物）"},"examples":[{"en":"My alarm clock is the main awakener in our house.","zh":"我家的主要“唤醒者”就是闹钟。"},{"en":"For many readers, that novel was an awakener of social awareness.","zh":"对许多读者来说，那本小说唤醒了社会意识。"},{"en":"A good teacher can be an awakener of curiosity.","zh":"一位好老师可以唤醒学生的好奇心。"}]}],"synonyms":["waker","rouser","catalyst","stimulus","wake-up call"],"phonetic":"/əˈweɪkənər/","extraExplanation":["“awakener”由动词 awaken（唤醒）加上表示“人/物”的后缀 -er 构成，意思直观，但在现代英语里不算常用。日常更常见的表达是 wake-up call（警醒/提醒）、something that awakens…（使……觉醒的事物）、或用更自然的名词如 catalyst（催化剂/触发因素）、alarm clock（闹钟）。","在文学或宗教语境中，“awakener”偶尔带有象征意味，指“带来觉醒的人/事”，例如“awakener of the spirit（唤醒灵魂者）”。"]}
{"word":"awakeners","summary":{"en":"“Awakeners” means people or things that wake someone up or trigger awareness.","zh":"“Awakeners”指叫醒他人或促使人觉醒、意识到某事的人或事物（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or things that wake someone up (literally) or make someone become alert, aware, or interested (figuratively).","zh":"唤醒者；叫醒的人或事物（字面），也可指让人警觉、觉醒或产生兴趣的人或事物（引申）。"},"examples":[{"en":"The loud church bells were the town’s early awakeners.","zh":"响亮的教堂钟声是小镇清晨的“唤醒者”。"},{"en":"For many readers, that book became an awakener of social awareness.","zh":"对许多读者来说，那本书成了社会意识的“觉醒者”。"}]}],"synonyms":["wake-up call","alarm","rouser","catalyst","eye-opener"],"phonetic":"/əˈweɪkənɚ/","extraExplanation":["“awakeners”是名词复数；单数是“awakener”。常见动词是“awaken”（更常用）或“wake (up)”。在日常英语里，“awakener”相对少见，更常说“alarm clock / wake-up call / something that woke me up”。","引申用法里，“awakener”可以接近“a wake-up call（警钟）”或“a catalyst（催化剂）”，强调“促使人意识到某事”的作用。"]}
{"word":"awakening","summary":{"en":"Awakening means waking up or becoming aware; it can also refer to a broader cultural or spiritual shift.","zh":"awakening 指醒来或意识到，也可指文化或精神层面的觉醒与转变。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or process of waking up or becoming aware of something (an event, change, or realization).","zh":"醒来；觉醒；意识到某事的过程（一次事件、变化或领悟）。"},"examples":[{"en":"I had an awakening at dawn and couldn’t fall back asleep.","zh":"我在黎明时醒来，就再也睡不着了。"},{"en":"Her awakening to the unfairness of the system changed how she voted.","zh":"她开始意识到制度的不公平，这改变了她的投票选择。"}]},{"partOfSpeech":"n.","definition":{"en":"A period in which a group of people suddenly becomes very interested in a new idea, art form, or social movement.","zh":"（群体）对新观念、艺术形式或社会运动突然产生强烈兴趣的时期。"},"examples":[{"en":"The city experienced a cultural awakening after the new museum opened.","zh":"新博物馆开馆后，这座城市经历了一次文化复兴/觉醒。"},{"en":"Many people talk about an environmental awakening in recent years.","zh":"很多人谈到近年来的环保觉醒。"}]},{"partOfSpeech":"n.","definition":{"en":"A spiritual or religious moment of deep understanding or renewed faith.","zh":"灵性/宗教上的顿悟或信仰的重新觉醒。"},"examples":[{"en":"He described his awakening as a turning point in his life.","zh":"他把这次灵性觉醒形容为人生的转折点。"},{"en":"The retreat helped her find a sense of awakening and peace.","zh":"这次静修帮助她获得了觉醒感与平静。"}]}],"synonyms":["waking","realization","awareness","reawakening","revival","enlightenment"],"phonetic":"/əˈweɪkənɪŋ/","extraExplanation":["“awakening”常与介词搭配：an awakening to + 名词/动名词（对……的觉醒/意识到）；an awakening of + 名词（……的觉醒，如 curiosity 的觉醒）。","与“waking”相比，“awakening”更常带有“意识改变、思想转变”的含义；“waking”更偏向生理上的醒来。","文学与文化中常见用法：Kate Chopin 的小说《The Awakening》（《觉醒》）探讨女性自我意识与社会束缚，因此该词在文学语境里常带“自我觉醒”的色彩。"]}
{"word":"awakeningly","summary":{"en":"Awakeningly means “in a way that wakes someone up or makes them suddenly aware.”","zh":"awakeningly 表示“以使人醒来或突然觉察的方式（带有唤醒、启发效果）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that causes someone to wake up or become aware; in an awakening manner","zh":"以使人醒来或觉醒的方式；以唤醒、启发的方式"},"examples":[{"en":"The cold air hit him awakeningly, and he suddenly realized how late it was.","zh":"冷空气带着一种“唤醒感”扑面而来，他突然意识到已经很晚了。"},{"en":"Her words landed awakeningly, making the group reconsider their assumptions.","zh":"她的话起到了“点醒”的作用，让大家重新审视自己的想法。"}]}],"synonyms":["eye-openingly","revealingly","strikingly","bracingly"],"phonetic":"/əˈweɪkənɪŋli/","extraExplanation":["“awakeningly”在现代英语中很少见，写作里更常用的表达是“in an awakening way / in a wake-up call kind of way / in an eye-opening way”，或者直接用更常见的副词“eye-openingly”。","词根来自“awake/awaken（醒来；唤醒）”。当它用于比喻意义时，通常强调“让人意识到真相、问题或新的观点”，类似中文的“发人深省、点醒、醍醐灌顶”。"]}
{"word":"awakenings","summary":{"en":"Awakenings means times of waking up, or (figuratively) moments of sudden realization and new awareness.","zh":"Awakenings 指“醒来/苏醒的时刻”，也可引申为“顿悟、觉醒（意识上的新认识）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the acts or moments of waking up; times when someone becomes awake or alert","zh":"醒来；苏醒的时刻；变得清醒或警觉的瞬间"},"examples":[{"en":"I had several awakenings during the night because of the noise.","zh":"因为噪音，我晚上醒了好几次。"},{"en":"Light sleep often leads to frequent awakenings.","zh":"浅睡眠常常会导致频繁醒来。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) sudden realizations or new awareness, especially about feelings, ideas, or social issues","zh":"（引申）觉醒；顿悟；意识的苏醒（尤指对情感、观念或社会问题的新认识）"},"examples":[{"en":"College can be a time of political awakenings for many students.","zh":"对许多学生来说，大学可能是政治意识觉醒的时期。"},{"en":"Her awakenings about mental health changed how she treated herself.","zh":"她对心理健康的觉醒改变了她对待自己的方式。"}]}],"synonyms":["wake-ups","arousals","realizations","epiphanies","awareness"],"phonetic":"/əˈweɪkənɪŋz/","extraExplanation":["“Awakenings”也常作为作品名出现：例如神经学家 Oliver Sacks 的纪实作品《Awakenings》（后改编为电影《无语问苍天》），讲述一些患者在治疗后短暂“苏醒/觉醒”的经历。这里的 awakenings 同时包含字面“醒来”和引申“意识恢复”的双重含义。"]}
{"word":"awakenment","summary":{"en":"A rare noun meaning “awakening”—the process of waking up or becoming aware.","zh":"一个很少见的名词，意思相当于“awakening”：醒来或意识到某事的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) The act or process of waking up, or of becoming aware (emotionally, spiritually, or intellectually).","zh":"（罕用）醒来或被唤醒的过程；（引申）在情感、精神或思想上的觉醒。"},"examples":[{"en":"After months of grief, she felt an awakenment of hope.","zh":"在数月的悲伤之后，她感到希望正在觉醒。"},{"en":"The book describes an awakenment to social injustice.","zh":"这本书描述了人们对社会不公的觉醒。"}]}],"synonyms":["awakening","arousal","realization","enlightenment","wakefulness"],"phonetic":"/əˈweɪkənmənt/","extraExplanation":["“awakenment”在现代英语中非常少见，更多时候人们会用“awakening”（更常见、自然）或“arousal”（更偏生理/激起）来表达类似意思。","它常出现在较文学化或仿古的表达里，用来营造一种“庄重、缓慢展开的觉悟/醒悟”的氛围。写作时如果追求自然地道，通常建议改用“awakening”。"]}
{"word":"awakens","summary":{"en":"“Awakens” means “wakes up,” “becomes aware,” or “causes someone/something to wake or feel interest.”","zh":"“awakens”表示“醒来”“意识到”，也可表示“使醒来/唤起兴趣或感情”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of a person or animal) wakes up; stops sleeping.","zh":"（人或动物）醒来；不再睡觉。"},"examples":[{"en":"She awakens early every day to study.","zh":"她每天很早醒来学习。"},{"en":"He awakens in the middle of the night and can’t fall back asleep.","zh":"他半夜醒来，怎么也睡不着。"}]},{"partOfSpeech":"v.","definition":{"en":"becomes aware of something; begins to understand or notice something clearly.","zh":"意识到；开始明白或清楚地注意到某事。"},"examples":[{"en":"He awakens to the fact that he needs to change.","zh":"他意识到自己需要改变。"},{"en":"The city awakens to the importance of protecting its river.","zh":"这座城市开始意识到保护河流的重要性。"}]},{"partOfSpeech":"vt.","definition":{"en":"causes someone or something to wake up or become active; stirs a feeling or interest.","zh":"使醒来；使活跃；唤起（感情或兴趣）。"},"examples":[{"en":"The loud noise awakens the baby.","zh":"巨大的噪音把宝宝吵醒了。"},{"en":"That book awakens her curiosity about history.","zh":"那本书唤起了她对历史的好奇心。"}]}],"synonyms":["wakes up","rises","realizes","becomes aware","arouses","stirs"],"phonetic":"/əˈweɪkənz/","extraExplanation":["“awakens”是动词“awaken”的第三人称单数（he/she/it awakens）。在日常口语里，人们更常说“wakes up”（醒来）或“realizes”（意识到）；“awaken”更偏书面、文学或正式语境。","常见搭配：awaken to (the fact/idea…)（意识到……）；awaken someone’s interest/curiosity（唤起某人的兴趣/好奇心）。"]}
{"word":"awakes","summary":{"en":"“Awakes” means “wakes up” or “becomes aware,” and it’s the third-person singular form of “awake.”","zh":"“awakes”表示“醒来/醒着”或“意识到”，是动词“awake”的第三人称单数形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(third-person singular of “awake”) to wake up; to stop sleeping.","zh":"（awake 的第三人称单数）醒来；从睡眠中醒。"},"examples":[{"en":"He awakes at 6 a.m. every day.","zh":"他每天早上六点醒来。"},{"en":"She often awakes in the middle of the night.","zh":"她经常半夜醒来。"}]},{"partOfSpeech":"v.","definition":{"en":"(third-person singular of “awake”) to become aware of something; to start to realize something.","zh":"（awake 的第三人称单数）意识到；开始察觉/明白某事。"},"examples":[{"en":"The public awakes to the danger of the scam.","zh":"公众开始意识到这场骗局的危险。"},{"en":"He slowly awakes to the fact that he needs help.","zh":"他慢慢意识到自己需要帮助。"}]}],"synonyms":["wakes (up)","rouses","stirs","becomes aware","realizes"],"phonetic":"əˈweɪks","extraExplanation":["“awakes”是动词“awake”的第三人称单数（he/she/it awakes）。在现代英语里，日常更常用“wakes (up)”：He wakes up at 6. “awake”更偏书面或文学一些。","动词变化常见两套：awake–awoke–awoken（也可 awake–awaked–awaked，较少见）。相近词“awaken”语气更正式：awaken–awakened–awakened。"]}
{"word":"awaking","summary":{"en":"“Awaking” means waking up from sleep, or being in the process of waking up.","zh":"“awaking”表示“醒来”，也可形容“正在醒来、未完全清醒”的状态。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"the act of waking up; coming out of sleep","zh":"醒来；从睡眠中醒过来"},"examples":[{"en":"I remember awaking to the sound of rain on the window.","zh":"我记得我是被窗户上的雨声吵醒的。"},{"en":"She kept awaking during the night because of the noise.","zh":"因为噪音，她整晚不停醒来。"}]},{"partOfSpeech":"adj.","definition":{"en":"in the process of waking up; not fully awake yet","zh":"正在醒来；还没有完全清醒"},"examples":[{"en":"He lay still, half-awaking, trying to understand where he was.","zh":"他一动不动地躺着，半醒半睡，努力弄清自己在哪里。"},{"en":"In the early morning light, the house felt quiet and awaking.","zh":"清晨的光线里，房子安静而渐渐苏醒。"}]}],"synonyms":["waking","waking up","awakening (noun form)","coming to"],"phonetic":"/əˈweɪkɪŋ/","extraExplanation":["“awaking”是动词“awake”的现在分词/动名词形式，在现代英语里更常见的名词形式是“awakening”（如：a spiritual awakening 精神觉醒）。","“awake”偏口语和日常；“awaken”更正式/文学一些，常用于“awaken interest/feelings”（唤起兴趣/情感）。"]}
{"word":"awakings","summary":{"en":"“Awakings” means repeated times of waking up, or (figuratively) moments of sudden awareness.","zh":"“Awakings”指多次醒来；也可引申为突然觉醒、顿悟的时刻。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural noun) moments or instances of waking up from sleep; times when someone becomes awake.","zh":"（复数名词）醒来的时刻；从睡眠中醒来的次数。"},"examples":[{"en":"He had several awakenings during the night because of the noise.","zh":"因为噪音，他夜里醒了好几次。"},{"en":"After my first awakening, I couldn’t fall asleep again.","zh":"第一次醒来后，我就再也睡不着了。"}]},{"partOfSpeech":"n.","definition":{"en":"(Plural noun, figurative) moments of suddenly understanding something or becoming more aware.","zh":"（复数名词，引申）顿悟；突然意识到或变得更清醒的时刻。"},"examples":[{"en":"Travel can lead to awakenings about other cultures.","zh":"旅行可能带来对其他文化的觉醒与理解。"},{"en":"Her awakenings about healthy habits came slowly, not overnight.","zh":"她对健康习惯的觉醒是慢慢发生的，不是一夜之间。"}]}],"synonyms":["awakenings","wake-ups","arousals","realizations"],"phonetic":"/əˈweɪkɪŋz/","extraExplanation":["“awakings”在现代英语里不如“awakenings”常见；很多情况下母语者更倾向用“awakenings”来表示“醒来次数/觉醒时刻”。不过在诗歌、较旧的写法或为了节奏/押韵时，也可能看到“awakings”。"]}
{"word":"awald","summary":{"en":"“awald” isn’t standard English; it’s usually meant as “a wald” = a forest (German-origin).","zh":"“awald” 不是标准英语，通常是想写 “a wald”，意为“森林/林地”（源自德语）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. Most often, people mean “a wald,” using *wald* (a German-derived word) to mean “a forest/woodland,” especially in place names or writing that refers to German landscapes.","zh":"不是标准英语单词。多数情况下，人们想表达的是 “a wald”，其中 *wald* 是源自德语的词，意思是“森林/林地”，常见于地名或描写德国景观的文字中。"},"examples":[{"en":"We hiked through a wald near the village before sunset.","zh":"我们在日落前穿过村子附近的一片森林。"},{"en":"The guide explained that “Schwarzwald” literally means “Black Forest,” a famous wald in Germany.","zh":"导游解释说 “Schwarzwald” 字面意思是“黑森林”，是德国著名的一片森林。"}]}],"synonyms":["forest","woods","woodland"],"phonetic":"/ə ˈwɔld/","extraExplanation":["*Wald* 是德语“森林”的常用词。在英语里，它多见于专有名词（如 Schwarzwald“黑森林”）或带有德国文化/地理背景的描写中。你输入的 **awald** 很可能是把 “a wald” 写成了一个词，或是拼写错误。若你本来想查的是别的词（例如 *AWOL*、*world* 等），可以告诉我上下文句子，我可以帮你确认。"]}
{"word":"awalim","summary":{"en":"Awalim refers to educated female entertainers in historical Egypt, known especially for singing, music, and poetry.","zh":"Awalim 指埃及历史上以歌唱、音乐与诗歌见长的受教育女艺人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In 18th–19th century Egypt, educated female entertainers—especially singers, poets, and musicians—who performed at private gatherings (sometimes also associated with elite social life).","zh":"（多指18–19世纪埃及的）受过教育的女艺人，尤指在私密场合表演的歌者、诗人或乐师（有时也与上层社交圈相关联）。"},"examples":[{"en":"In some 19th-century travel writing, the awalim are described as singing and reciting poetry at wedding celebrations.","zh":"在一些19世纪的游记中，awalim 被描述为在婚礼庆典上歌唱并吟诵诗歌。"},{"en":"The novel mentions an awalim troupe hired to entertain guests in a wealthy household.","zh":"小说提到一个 awalim 表演团受雇在富裕人家招待宾客。"}]}],"synonyms":["female entertainers","singers","musicians"],"phonetic":"/əˈwɑːlɪm/","extraExplanation":["“Awalim”来自阿拉伯语复数‘awālim（单数‘ālima，意为“有学问的女性/女学者”）。在英语语境里，它常被用来指埃及历史上的一类女表演者，与更广泛的“belly dancers（肚皮舞者）”不完全等同；她们常以歌唱、诗歌与音乐才艺著称，表演场合多为室内或私人聚会。","在一些欧洲旅行者的记述中，相关群体可能被混用或带有时代偏见；阅读时可注意区分历史语境与刻板印象。"]}
{"word":"awalt","summary":{"en":"AWALT is internet slang meaning “All Women Are Like That,” a biased generalization about women (often negative).","zh":"AWALT是网络缩写，意思是“所有女人都那样”，属于带偏见的以偏概全说法（常含贬义）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Internet slang, acronym) “All Women Are Like That” — a sweeping generalization used to claim that all women share the same (usually negative) traits or motives.","zh":"（网络俚语/缩写）“All Women Are Like That”的缩写——一种以偏概全的说法，用来声称所有女性都一样（通常带贬义或阴谋论色彩）。"},"examples":[{"en":"Some forums use “AWALT” to dismiss women’s experiences instead of listening to them.","zh":"一些论坛用“AWALT”来否定女性的经历，而不是认真倾听。"},{"en":"He wrote “AWALT” in the comments, which turned the discussion hostile.","zh":"他在评论里写了“AWALT”，让讨论变得充满敌意。"},{"en":"If you want to be respectful, avoid phrases like “AWALT” and talk about specific behaviors instead.","zh":"如果你想表达尊重，避免用“AWALT”这类话，改为讨论具体行为。"}]}],"synonyms":["all women are like that","all women are the same","not all women (counter-phrase)"],"phonetic":"/ˈeɪ.wɔlt/","extraExplanation":["“AWALT”常见于部分男性向社群（如“manosphere”相关圈子）中，带有明显的刻板印象与性别偏见；在很多场合会被视为厌女用语。","它的核心问题是把个体差异抹平，用“所有女性都……”来解释复杂的人际关系，容易引发对立。更合适的表达方式是用“some people / in my experience / a few individuals”等限定词，或描述具体情境。"]}
{"word":"Awan","summary":{"en":"Awan most commonly means “cloud” in Malay/Indonesian; it can also be used as a personal name.","zh":"Awan最常见的意思是马来语/印尼语里的“云”；也可用作人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Loanword, Malay/Indonesian) a cloud in the sky; a visible mass of water droplets or ice crystals floating in the air.","zh":"（外来词：马来语/印尼语）天空中的“云”；由水滴或冰晶组成、漂浮在空气中的可见团块。"},"examples":[{"en":"In Indonesian, “awan” means “cloud.”","zh":"在印尼语里，“awan”意思是“云”。"},{"en":"The awan drifted slowly across the blue sky.","zh":"云缓慢地飘过蓝天。"}]},{"partOfSpeech":"other","definition":{"en":"A given name used in some cultures (especially in Southeast Asia); in English it may appear as a personal name or brand name.","zh":"在一些文化中使用的人名（尤其在东南亚）；在英语语境中也可能作为姓名或品牌名出现。"},"examples":[{"en":"Awan introduced himself at the meeting.","zh":"Awan在会议上做了自我介绍。"},{"en":"I saw the name Awan on the guest list.","zh":"我在宾客名单上看到了Awan这个名字。"}]}],"synonyms":["cloud"],"phonetic":"/əˈwɑn/","extraExplanation":["“Awan”主要见于马来语与印尼语日常用语；在英语里通常不会把它当作常用词汇，更多是在谈到东南亚语言、文化，或作为人名时出现。"]}
{"word":"awan","summary":{"en":"“Awan” usually means “cloud” in Indonesian/Malay; it can also be a personal name.","zh":"“awan”多指印尼语/马来语的“云”；也可作人名使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Indonesian/Malay) a cloud.","zh":"（印尼语/马来语）云、云朵。"},"examples":[{"en":"Look—there’s a dark awan above the mountains.","zh":"看——山上方有一团乌云（awan）。"},{"en":"The sky is full of awan today.","zh":"今天天空布满云（awan）。"}]},{"partOfSpeech":"n.","definition":{"en":"A given name (often used in South and Southeast Asia).","zh":"人名（在南亚与东南亚较常见）。"},"examples":[{"en":"Awan will join the meeting later.","zh":"Awan 稍后会参加会议。"}]}],"synonyms":["cloud"],"phonetic":"/ˈɑwɑn/","extraExplanation":["“awan”不是常见英语词汇；它主要来自印尼语和马来语，意思是“云”。如果你想表达英语里的“云”，最常用的词是 cloud。","在一些文化语境中，“Awan”也可作名字使用；作为名字时通常首字母大写。"]}
{"word":"awane","summary":{"en":"“Awane” is not a standard English word; you probably meant “awake” (not sleeping; to wake up).","zh":"“awane”不是标准英文词；你可能想写“awake”（醒着的；醒来）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended) not sleeping; able to notice and respond to things.","zh":"（可能想写）醒着的；警觉的；能注意到并回应周围事物的。"},"examples":[{"en":"Are you still awake?","zh":"你还醒着吗？"},{"en":"She stayed awake to finish her homework.","zh":"她一直醒着把作业做完。"},{"en":"Stay awake while driving at night.","zh":"夜间开车要保持清醒/警觉。"}]},{"partOfSpeech":"v.","definition":{"en":"(Likely intended) to wake up; to stop sleeping.","zh":"（可能想写）醒来；不再睡觉。"},"examples":[{"en":"I usually awake at 6 a.m.","zh":"我通常早上六点醒来。"},{"en":"He awoke suddenly because of the noise.","zh":"他被噪音突然吵醒了。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Literary) to make someone become interested in or aware of something.","zh":"（偏文学）唤起（兴趣/意识/情感）。"},"examples":[{"en":"The movie awoke her curiosity about history.","zh":"这部电影唤起了她对历史的好奇心。"},{"en":"Travel can awake a sense of wonder.","zh":"旅行能唤起惊奇感。"}]}],"synonyms":["alert","conscious","wake up"],"phonetic":"/əˈweɪk/","extraExplanation":["“awane”不是常见英文单词，最可能是把“awake”拼错了。","“awake”的过去式/过去分词常见有两种：规则形式“awaked”（较少见）和更常用的“awoke / awoken”。例如：I awoke early. / I have awoken from a dream."]}
{"word":"awanting","summary":{"en":"Awanting means “lacking or missing,” often in formal/literary English, especially in phrases like “not awanting.”","zh":"Awanting 意为“缺少的/欠缺的”，偏正式或文学用法，常见于 “not awanting（不缺少）” 等表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"lacking; missing; not present when needed.","zh":"缺少的；欠缺的；需要时却没有的。"},"examples":[{"en":"Courage was not awanting during the crisis.","zh":"在危机时刻，并不缺少勇气。"},{"en":"If anything is found awanting, we will fix it immediately.","zh":"如果发现有什么欠缺，我们会立刻补上。"}]},{"partOfSpeech":"adj.","definition":{"en":"not failing or falling short; adequate (often used in the pattern “not awanting”).","zh":"不至于不足；还算充足（常见于“not awanting”结构）。"},"examples":[{"en":"Food and water were not awanting on the journey.","zh":"旅途中食物和水还算充足。"},{"en":"His patience was not awanting with beginners.","zh":"他对初学者颇有耐心。"}]}],"synonyms":["lacking","missing","absent","deficient","inadequate"],"phonetic":"/əˈwɔntɪŋ/","extraExplanation":["“awanting”也常写作“a-wanting”，属于较老派、文学/正式的用法；其中的 a- 是古英语里表示“处于某种状态”的前缀（类似 *asleep, afloat*）。现代英语更常用 *lacking / missing / absent / in short supply*。","常见搭配：*found awanting*（被发现有欠缺/不合格），以及否定结构 *not awanting*（不缺少/还算充足），多见于书面语、演讲或文学叙述。"]}
{"word":"awanyu","summary":{"en":"“awanyu” isn’t a common English word; it’s likely a name or username.","zh":"“awanyu”不是常见英文词；更可能是名字或用户名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a proper name, username, or a romanization (for example, Chinese pinyin) used to represent someone’s name.","zh":"不是标准英文单词。更可能是专有名词（人名）、用户名，或某种拼音/音译形式（例如中文拼音）来表示名字。"},"examples":[{"en":"My gaming ID is Awanyu.","zh":"我的游戏ID是 Awanyu。"},{"en":"Awanyu posted a comment under the video.","zh":"Awanyu 在视频下留言了。"}]}],"phonetic":"/əˈwɑn.ju/","extraExplanation":["“Awanyu”在英语词典里通常查不到，因此没有固定、权威的读音与词义。","如果你是在某段文字里看到的，或这是某个人名/地名/品牌名，请把完整句子或来源发我，我可以帮你判断它应当怎么读、是什么意思。","如果你想表达的是别的英文词，也可能是拼写错误；你可以告诉我你想表达的中文意思（比如“晚雨/万语/婉玉”等），我再帮你对应到合适的英文或拼音写法。"]}
{"word":"awapuhi","summary":{"en":"Awapuhi is a Hawaiian ginger (shampoo ginger) known for its fragrant juice used in traditional hair and skin care.","zh":"Awapuhi 是一种夏威夷姜科植物（洗发姜），以可用于传统护发护肤的芳香汁液闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Hawaiian ginger plant (especially shampoo ginger) whose fragrant juice is traditionally used for hair and skin care.","zh":"一种夏威夷姜科植物（尤指“洗发姜/洗发姜花”），其芳香汁液传统上用于护发、护肤。"},"examples":[{"en":"She rubbed awapuhi juice into her hair like a natural conditioner.","zh":"她把 awapuhi 的汁液揉进头发里，当作天然护发素。"},{"en":"In Hawaiʻi, awapuhi is valued for its fresh scent and soothing feel.","zh":"在夏威夷，awapuhi 因清新的香味和舒缓的触感而受到喜爱。"}]}],"synonyms":["shampoo ginger","pinecone ginger","Zingiber zerumbet"],"phonetic":"/ˌɑːwəˈpuːhi/","extraExplanation":["“Awapuhi”来自夏威夷语，常指“洗发姜”（shampoo ginger，学名 *Zingiber zerumbet*）。它的花苞里会积聚清香的液体，传统上可直接挤出使用，像天然的洗发/护发用品。","在英语里它多用于介绍夏威夷植物、传统护理方式或旅游文化语境；也常作为护发产品香型或成分名出现。"]}
{"word":"Award","summary":{"en":"“Award” means a prize/honor, or the act of giving one (also used for official decisions like court payments).","zh":"Award 既可指“奖项/荣誉”，也可作动词表示“授予/颁发”；在法律等正式语境还可指“裁定给付”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a prize or honor given to someone for an achievement (often in school, sports, arts, or work)","zh":"（因成就而获得的）奖项；奖品；荣誉（常见于学校、体育、艺术或工作）"},"examples":[{"en":"She won an award for best actor.","zh":"她获得了最佳演员奖。"},{"en":"The science award recognizes students’ creativity.","zh":"这个科学奖表彰学生的创造力。"}]},{"partOfSpeech":"vt.","definition":{"en":"to give someone a prize, honor, or official decision (often money, a medal, or a contract)","zh":"授予；颁发（奖项/荣誉）；（正式）判给、裁定给予（常指奖金、奖章或合同）"},"examples":[{"en":"The jury awarded her first prize.","zh":"评审团授予她一等奖。"},{"en":"The court awarded him damages.","zh":"法院判给他损害赔偿金。"}]}],"synonyms":["prize","honor","accolade","grant","present"],"phonetic":"/əˈwɔɹd/","extraExplanation":["词源小贴士：award 来自表示“看待、考虑”的古法语/拉丁语词根，后来引申为“经过评判后给予（奖励或裁定）”。因此它常与评审、法庭、官方决定等语境连用。","常见搭配：win/receive/get an award（获奖）；give/present an award（颁奖）；award sth to sb（把某物授予某人）；be awarded for sth（因某事被授奖）。","区分：award 通常指“有评选/裁定过程的奖或授予”；prize 更强调“比赛中的奖品”；reward 多指“对行为的回报/酬谢（不一定有评审）”。"]}
{"word":"award","summary":{"en":"An award is a prize or official decision; to award means to give a prize, honor, or officially grant something.","zh":"award 表示“奖项/裁决”；作动词表示“授予奖项/荣誉”或“（官方）判给、裁定给予”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A prize, honor, or official decision given to someone for an achievement or as recognition.","zh":"（因成就而获得的）奖项、荣誉；（官方的）裁决、判给"},"examples":[{"en":"She won an award for best actress.","zh":"她获得了最佳女演员奖。"},{"en":"The judge’s award gave the money to the injured worker.","zh":"法官的裁决把赔偿金判给了受伤的工人。"}]},{"partOfSpeech":"v.","definition":{"en":"To give someone a prize, honor, or official decision (such as money or a contract).","zh":"授予（奖项/荣誉）；（官方）判给、裁定给予（钱款/合同等）"},"examples":[{"en":"The school awards scholarships to top students.","zh":"学校把奖学金授予成绩最好的学生。"},{"en":"The company was awarded a large government contract.","zh":"这家公司被授予了一份大型政府合同。"}]}],"synonyms":["prize","honor","reward","grant","bestow"],"phonetic":"/əˈwɔrd/","extraExplanation":["“award”常见搭配：\n- win/receive/get an award 获奖/得到奖项\n- give/present an award 颁奖\n- be awarded + 奖项/金额/合同 被授予/被判给\n\n与近义词区别：\n- award：通常更正式，强调“经过评审或权威决定”而给予。\n- prize：强调比赛或竞争中的“奖品/奖”，更口语。\n- reward：强调因帮助、表现或提供信息而给的“酬谢/赏金/奖励”。"]}
{"word":"awardable","summary":{"en":"“Awardable” means eligible to be awarded (able to receive an award, prize, grant, credits, or points).","zh":"“awardable”表示“可授予的、具备获奖/获资助资格的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be awarded; eligible to receive an award, prize, or grant. (Example: The scholarship is awardable to students with strong grades.)","zh":"可授予的；有资格获得奖项、奖金或资助的。（例：该奖学金可授予成绩优秀的学生。）"},"examples":[{"en":"The prize is awardable only to first-year students.","zh":"该奖项只授予一年级学生。"},{"en":"These points are awardable if you follow the rules.","zh":"如果你遵守规则，就可以获得这些积分。"}]}],"synonyms":["eligible","qualifying","grantable"],"phonetic":"/əˈwɔrdəbəl/","extraExplanation":["“awardable”多见于较正式的场景（如学校政策、竞赛规则、合同/条款、基金与补助说明），表示“在规则或条件满足时，可以被授予”。","常见搭配：awardable scholarship/grant/prize（可授予的奖学金/资助/奖项）、awardable credits/points（可获得的学分/积分）。","与“awarded”不同：awarded表示“已经被授予”；awardable强调“有资格/符合条件、可以被授予（但还未必已发放）”。"]}
{"word":"awarded","summary":{"en":"“Awarded” means something was officially given or granted as a prize, honor, payment, or decision.","zh":"“awarded”表示某物被正式授予/判给，常指奖项、荣誉、补偿金或裁决结果。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of award: to officially give someone a prize, honor, or a decision (often by a judge or organization).","zh":"award 的过去式/过去分词：正式授予某人奖项、荣誉或裁决（常由评委、机构或法官作出）。"},"examples":[{"en":"She was awarded a scholarship for her excellent grades.","zh":"她因成绩优异而被授予奖学金。"},{"en":"The court awarded him compensation for the injury.","zh":"法院判给他因受伤而获得的赔偿。"},{"en":"They awarded the contract to a local company.","zh":"他们把合同授予了一家本地公司。"}]},{"partOfSpeech":"adj.","definition":{"en":"given as a prize or officially granted (used as an adjective, often before a noun).","zh":"作为奖励被授予的；正式颁发的（作形容词用，常放在名词前）。"},"examples":[{"en":"The awarded funds must be used for research.","zh":"获批的资金必须用于研究。"},{"en":"He proudly displayed his awarded medal.","zh":"他自豪地展示了他被授予的奖章。"}]}],"synonyms":["granted","given","bestowed","conferred","allocated"],"phonetic":"/əˈwɔrdɪd/","extraExplanation":["“awarded”常以被动语态出现：be awarded + 奖项/金额/机会（如 be awarded a prize / be awarded $5,000）。","也常见结构：award A to B（把A授予B）或 award B A（给B授予A）；以及 award A to B / award B A（同义但语序不同）。"]}
{"word":"awardee","summary":{"en":"An awardee is a person who receives an award, prize, honor, or grant.","zh":"awardee 指获得奖项、荣誉或资助的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who receives an award, prize, honor, or grant","zh":"获奖者；受奖人；（奖学金、补助金等的）受领者"},"examples":[{"en":"Each awardee received a certificate and a small gift.","zh":"每位获奖者都收到了一张证书和一份小礼物。"},{"en":"The scholarship awardees must submit a report at the end of the year.","zh":"奖学金获得者必须在年底提交一份报告。"},{"en":"She thanked the organizers on behalf of all the awardees.","zh":"她代表所有获奖者感谢主办方。"}]}],"synonyms":["recipient","winner","honoree","prizewinner","grantee"],"phonetic":"/əˌwɔrˈdi/","extraExplanation":["“awardee”常用于较正式的场合（如典礼、公告、基金会/学校文件）。日常口语里，人们也常说“winner”（赢家/得奖者）或“recipient”（领取者）来表达类似意思。"]}
{"word":"awardees","summary":{"en":"“Awardees” means the people who receive an award or prize (plural of awardee).","zh":"“awardees”指“获奖者/领奖人”，是 awardee 的复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who have received an award or prize; recipients of an award.","zh":"获奖者；领奖人；奖项获得者。"},"examples":[{"en":"The awardees will be announced at the ceremony tonight.","zh":"获奖者将于今晚的颁奖典礼上公布。"},{"en":"All awardees must submit a short biography for the program.","zh":"所有获奖者都必须为节目册提交一份简短的个人简介。"}]}],"synonyms":["recipients","winners","prizewinners","honorees"],"phonetic":"/əˌwɔrˈdiːz/","extraExplanation":["“awardee”由“award（奖项/授予）+ -ee（受事者后缀）”构成，-ee 表示“动作的接受者”，常见类似词有 employee（雇员）、trainee（受训者）、refugee（难民）。","“awardees”是复数形式。正式场合（如奖学金、科研基金、颁奖典礼）中常用；日常口语里也常说 winners（获胜者/赢家）或 recipients（接受者），但“awardee”更强调“被授予奖项”的身份。"]}
{"word":"awarder","summary":{"en":"“Awarder” means the person or organization that gives an award or formally grants something.","zh":"“Awarder”指颁奖者或授予方（个人或机构）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or organization that gives an award or formally grants something (such as a prize, scholarship, or contract)","zh":"颁奖者；授予方（个人或机构，正式授予奖项、奖学金、合同等）"},"examples":[{"en":"The awarder of the scholarship will announce the winners next week.","zh":"该奖学金的授予方将于下周公布获奖者。"},{"en":"Please check the awarder’s requirements before you apply.","zh":"申请前请先确认授予方的要求。"}]}],"synonyms":["awarding body","grantor","issuer","donor"],"phonetic":"/əˈwɔrdər/","extraExplanation":["“awarder”在日常英语中不算最常用，更常见的说法是：the organization giving the award / the awarding body（颁发机构）/ the grantor（授予人，偏法律/合同语境）。在正式文件、招标或合同语境里，“awarder”会更常出现。"]}
{"word":"awarders","summary":{"en":"“Awarders” means the people or organizations that give awards or prizes.","zh":"“awarders”指颁发奖项或奖励的人或机构（颁奖者/授予者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or organizations that give (award) prizes, honors, or money to someone.","zh":"颁奖者；授予者（指颁发奖项、荣誉或奖金的人或机构）。"},"examples":[{"en":"The awarders announced the winners at the end of the ceremony.","zh":"颁奖者在典礼结束时宣布了获奖者。"},{"en":"Different awarders may use different standards to judge the same work.","zh":"不同的颁奖机构对同一作品可能有不同的评判标准。"},{"en":"The awarders reviewed all applications before making a decision.","zh":"授予方在做出决定前审阅了所有申请材料。"}]}],"synonyms":["grantors","presenters","donors","awarding bodies"],"phonetic":"/əˈwɔrdɚz/","extraExplanation":["“awarder”是“award”的施予者（给出奖励的人/机构）；相对的常见词是“awardee / recipient”，指获奖者/受领者。写作中也常用“the awarding body（颁奖机构）”来表达更正式。"]}
{"word":"awarding","summary":{"en":"“Awarding” means giving or officially deciding a prize, honor, money, or a contract; it can also mean the process of doing so.","zh":"“Awarding”指授予/颁发奖项、荣誉、金钱或合同等；也可指授予/颁发的过程。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"giving someone a prize, honor, money, or a decision (present participle of “award”).","zh":"（award 的现在分词）授予（奖项/荣誉/金钱/裁决）；颁发。"},"examples":[{"en":"They are awarding scholarships to students with strong academic records.","zh":"他们正在把奖学金授予学业表现优秀的学生。"},{"en":"The committee is awarding first prize to the youngest finalist.","zh":"评委会将一等奖颁给最年轻的决赛选手。"},{"en":"The judge is awarding damages to the injured worker.","zh":"法官判给受伤工人损害赔偿金。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of giving or officially deciding who receives something (often used as a noun).","zh":"颁发/授予的行为或过程；评奖与授奖（常作名词用）。"},"examples":[{"en":"The awarding of the contract will be announced next week.","zh":"合同的授予结果将于下周公布。"},{"en":"She questioned the awarding of the medal to a controversial figure.","zh":"她质疑把奖章授予一位有争议的人物。"}]}],"synonyms":["granting","giving","presenting","bestowing","conferring"],"phonetic":"əˈwɔrdɪŋ","extraExplanation":["“awarding”最常见是动词进行时/现在分词：be awarding（正在颁发/授予）。也常用于名词结构：the awarding of + 名词（……的授予/颁发）。","常见搭配：award a prize/medal/scholarship/grant/contract；award damages（判赔）。注意：award sb sth（授予某人某物）或 award sth to sb（把某物授予某人）。"]}
{"word":"awardment","summary":{"en":"Awardment is a rare noun meaning the act of awarding or something that is awarded.","zh":"Awardment 是个少见名词，表示“授予/颁发的行为”或“被授予的东西”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) The act of giving someone an award, prize, or official decision; the act of granting something.","zh":"（少见）授予、颁发（奖项/决定/权利等）的行为；授予某物。"},"examples":[{"en":"The awardment of the scholarship was announced at the ceremony.","zh":"奖学金的授予在典礼上公布。"},{"en":"After weeks of review, the awardment of the contract went to a local company.","zh":"经过数周审查后，合同最终授予了一家本地公司。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) Something that is awarded or granted.","zh":"（少见）被授予的东西；授予物（如奖项、权利、合同等）。"},"examples":[{"en":"The grant was the largest awardment the program had ever given.","zh":"这笔资助是该项目迄今为止发放过最大的一次授予。"}]}],"synonyms":["awarding","granting","conferral","bestowal","award"],"phonetic":"/əˈwɔrdmənt/","extraExplanation":["“awardment”在现代英语中非常不常见，很多情况下会用更自然的词来替代：\n- 表示“授予/颁发的行为”：用 “award” 或 “the awarding (of …)”（如：the awarding of the prize）。\n- 表示“奖项/授予物”：直接用 “award / prize / grant”。\n在正式写作里也常见 “conferral”（授予学位/荣誉）或 “granting”（授予权利/许可）。"]}
{"word":"awards","summary":{"en":"Awards are prizes or honors; to award means to officially give a prize or decide that someone should receive something (like damages).","zh":"awards 指奖项/荣誉；award 作动词指正式授予奖项，或（法律上）裁定给予（如赔偿）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Prizes or honors given to recognize achievement, excellence, or contribution.","zh":"为表彰成就、卓越表现或贡献而颁发的奖项或荣誉。"},"examples":[{"en":"The film won three awards at the international festival.","zh":"这部电影在国际电影节上获得了三个奖项。"},{"en":"She has received awards for her volunteer work.","zh":"她因志愿服务获得了奖项。"}]},{"partOfSpeech":"v.","definition":{"en":"To give someone a prize, honor, or official decision (often by an organization, judge, or committee).","zh":"授予（某人）奖项/荣誉；（常指机构、法官或委员会）裁定给予。"},"examples":[{"en":"They award scholarships to students with strong grades.","zh":"他们把奖学金授予成绩优秀的学生。"},{"en":"The judge awarded damages to the injured worker.","zh":"法官裁定赔偿给受伤的工人。"}]}],"synonyms":["prize","honor","trophy","grant","confer"],"phonetic":"/əˈwɔrd/","extraExplanation":["“award”作名词常见搭配：win/receive an award（获奖），be nominated for an award（入围/提名），present/give an award（颁奖）。","“award”在法律语境里很常见，表示“裁定给予（金钱/赔偿）”，比如 award damages（裁定赔偿）。注意与“reward（奖励/报酬）”区分：award更正式、常由权威机构颁发；reward更强调“回报”或“悬赏”。"]}
{"word":"Aware","summary":{"en":"Aware means knowing/realizing something, or being alert and attentive.","zh":"aware表示“知道/意识到”，也可表示“警觉、留心”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Knowing or realizing something; conscious of a fact or situation.","zh":"知道的；意识到（某事）的。"},"examples":[{"en":"I’m aware of the problem, and I’m working on it.","zh":"我知道这个问题，并正在处理。"},{"en":"She wasn’t aware that the meeting time had changed.","zh":"她不知道会议时间已经改了。"},{"en":"Are you aware of how loud the music is?","zh":"你意识到音乐有多大声吗？"}]},{"partOfSpeech":"adj.","definition":{"en":"Alert and paying attention to what is happening; mindful of possible danger or change.","zh":"警觉的；留心的（对可能的危险或变化）。"},"examples":[{"en":"Stay aware of your surroundings when you travel.","zh":"旅行时要留心周围环境。"},{"en":"Drivers should be aware in bad weather.","zh":"天气不好时司机应更警觉。"}]}],"synonyms":["conscious","mindful","informed","alert","attentive"],"phonetic":"/əˈwɛr/","extraExplanation":["“aware”常见搭配：be aware of（知道/意识到），be aware that + 从句（知道/意识到……）。","语气差别：aware偏“意识到/知道”，常用于较正式或中性的表达；如果强调“突然意识到”，可用realize。"]}
{"word":"aware","summary":{"en":"Aware means knowing or noticing something, or being attentive to what’s happening around you.","zh":"aware 指“知道/意识到某事”，也可指“警觉、留心周围情况”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Knowing about or noticing something; conscious and informed.","zh":"意识到的；知道的；察觉到的。"},"examples":[{"en":"I’m aware of the problem, and we’re working on a solution.","zh":"我知道这个问题，我们正在想办法解决。"},{"en":"Are you aware that the meeting starts at 9 a.m.?","zh":"你知道会议早上九点开始吗？"}]},{"partOfSpeech":"adj.","definition":{"en":"Careful to notice and understand what is happening around you; attentive.","zh":"警觉的；留心的；善于观察周围情况的。"},"examples":[{"en":"Stay aware of your surroundings when you’re walking at night.","zh":"晚上走路时要注意周围环境。"},{"en":"Good teachers are aware of how students feel in class.","zh":"好的老师能察觉学生在课堂上的感受。"}]}],"synonyms":["conscious","mindful","alert","informed"],"phonetic":"/əˈwɛr/","extraExplanation":["常见搭配：be aware of（意识到/知道），become aware of（开始意识到），raise awareness (of)（提高对……的认识/意识）。","易混词：aware 强调“知道/察觉到”；conscious 既可指“有意识的/清醒的”，也可指“有某种自觉（如 self-conscious 不自在）”；mindful 强调“有意地留心、记在心上”，语气更温和。","语体提示：在正式语境中常用 “be aware that + 从句”，如 “We are aware that delays may occur.”（我们知道可能会延误）。"]}
{"word":"awaredom","summary":{"en":"“awaredom” is a very rare, nonstandard noun meaning “awareness.” In most contexts, use “awareness.”","zh":"“awaredom”是非常少见的非标准名词，意思接近“awareness（意识/觉察）”。大多数情况下建议用“awareness”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard / very rare) The state or condition of being aware; awareness.","zh":"（非标准/非常少见）觉察的状态；意识、认知。"},"examples":[{"en":"The article argues that environmental awaredom is rising among young people.","zh":"这篇文章认为，年轻人的环保意识正在提高。"},{"en":"In meditation, people practice awaredom of the present moment.","zh":"在冥想中，人们练习对当下的觉察。"}]}],"synonyms":["awareness","consciousness","mindfulness"],"phonetic":"əˈwɛr.dəm","extraExplanation":["“awaredom”并不是常见标准词，更常用的说法是 **awareness**（意识；觉察）。你可能会在个人写作、网络用语或创意文本里看到“awaredom”。","词缀 **-dom** 表示“……的状态/领域/范围”，常见于 **freedom**（自由）、**kingdom**（王国）。因此“aware + -dom”可以被理解为“觉察的状态/领域”，但在正式写作中建议用 **awareness**。","如果你是在拼写检查或写作中遇到它，有可能是把 **awareness** 拼错了。"]}
{"word":"Awareness","summary":{"en":"Awareness means understanding or noticing something, especially what is happening around you or within you.","zh":"Awareness 指对某事的了解与觉察，尤其是对周围情况或自身状态的注意与意识。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Knowledge or understanding of something; noticing what is happening around you or inside you.","zh":"意识；了解；觉察（对某事的认识，或对周围/自身情况的注意与感知）。"},"examples":[{"en":"Public awareness of climate change has increased in recent years.","zh":"近年来，公众对气候变化的意识提高了。"},{"en":"She has a strong awareness of other people’s feelings.","zh":"她对他人的感受有很强的觉察。"},{"en":"Drivers need situational awareness in heavy traffic.","zh":"在拥堵车流中，司机需要良好的情境觉察能力。"}]},{"partOfSpeech":"n.","definition":{"en":"In health and psychology, a conscious state of noticing thoughts, emotions, or bodily sensations.","zh":"（健康与心理学）自我觉察；对想法、情绪或身体感受的有意识关注。"},"examples":[{"en":"Breathing exercises can improve awareness of stress in the body.","zh":"呼吸练习能提高对身体压力信号的觉察。"},{"en":"Mindfulness training builds awareness without judgment.","zh":"正念训练帮助建立不带评判的觉察。"}]}],"synonyms":["consciousness","understanding","knowledge","recognition","mindfulness"],"phonetic":"əˈwɛrnəs","extraExplanation":["“awareness”常与介词 of 连用（awareness of…），表示“对……的意识/认识”。也常用于固定搭配：raise awareness（提高意识）、increase awareness（增强认识）、public awareness（公众意识）、self-awareness（自我觉察）、situational awareness（情境觉察）。"]}
{"word":"awareness","summary":{"en":"Awareness means being conscious of something and understanding its importance; it can also mean sensitivity to social or cultural issues.","zh":"Awareness 指对某事的意识与认知、对其重要性的理解；也可指对社会或文化议题的关注与敏感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Knowledge or understanding that something exists, is happening, or is important; being conscious and attentive.","zh":"对某事存在、正在发生或重要性的认识；有意识并留意。"},"examples":[{"en":"Public awareness of climate change has grown in recent years.","zh":"近年来，公众对气候变化的认知提高了。"},{"en":"Her awareness of other people’s feelings makes her a good team leader.","zh":"她对他人感受的体察让她成为一位优秀的团队领导。"},{"en":"He walked with an awareness of the traffic around him.","zh":"他走路时留意着周围的车流。"}]},{"partOfSpeech":"n.","definition":{"en":"A special interest or sensitivity toward a social issue, identity, or cultural difference (often used in phrases like “cultural awareness”).","zh":"对社会议题、身份或文化差异的关注与敏感度（常用于“cultural awareness”等短语）。"},"examples":[{"en":"The workshop builds cultural awareness in the workplace.","zh":"这场培训提升了职场中的文化意识。"},{"en":"Good travel writing shows awareness of local customs.","zh":"好的旅行写作会体现对当地习俗的了解与尊重。"}]}],"synonyms":["consciousness","recognition","understanding","attention","mindfulness","sensitivity"],"phonetic":"/əˈwɛrnəs/","extraExplanation":["词根提示：aware（意识到的）+ -ness（名词后缀），所以 awareness 表示“意识/认知”的状态。","常见搭配：raise awareness（提高认知/唤起关注），lack awareness（缺乏意识），self-awareness（自我觉察），situational awareness（态势感知；对周围环境的警觉与理解）。","语体与语境：在公益、教育与职场培训中，awareness 常带有“倡导与关注”的意味（如 mental health awareness）。"]}
{"word":"awarn","summary":{"en":"“awarn” is not standard English; it usually means “warn” (to alert someone to danger or a problem).","zh":"“awarn”不是标准英语；通常相当于“warn”，表示提醒/警告某人注意危险或问题。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Nonstandard) A misspelling or rare dialect form of “warn,” meaning to tell someone about danger or a possible problem so they can avoid it or prepare.","zh":"（非标准）“awarn”通常是“warn”的拼写错误或少见方言写法，意思是提醒/警告某人注意危险或可能的问题，以便避免或做好准备。"},"examples":[{"en":"The sign is meant to warn drivers about ice on the road.","zh":"这个标志是用来提醒司机路面结冰。"},{"en":"I tried to warn him, but he didn’t listen.","zh":"我试着警告他，但他没听。"},{"en":"Please warn me if the schedule changes.","zh":"如果日程有变化，请提前提醒我。"}]}],"synonyms":["warn","alert","caution","notify"],"phonetic":"/wɔrn/","extraExplanation":["“awarn”在现代标准英语里几乎不用；写作或考试中应使用“warn”。","有时在旧文本、方言拼写或口语转写中会看到在动词前加 a- 的形式，但这不是标准拼写。若你是在某段原文里看到“awarn”，多半可按“warn”来理解。"]}
{"word":"awarrant","summary":{"en":"A warrant is usually a legal document giving authority (like a search or arrest warrant). It can also mean a justification or reason, and as a verb it means to justify or make something necessary.","zh":"warrant 常指法律上的“授权令”（如搜查令、逮捕令）；也可指“依据/理由”。作动词表示“证明……有理/使……有必要”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Law) An official document that gives legal permission to do something, especially to search a place or arrest someone.","zh":"（法律）授权令；（尤指）搜查令、逮捕令。"},"examples":[{"en":"The police obtained a search warrant before entering the apartment.","zh":"警方在进入公寓前取得了搜查令。"},{"en":"He was arrested on an outstanding warrant.","zh":"他因一份未执行的逮捕令而被逮捕。"}]},{"partOfSpeech":"n.","definition":{"en":"A good reason or justification for a belief or action; support for thinking something is true.","zh":"正当理由；依据；（认为某事属实的）凭据。"},"examples":[{"en":"There is no warrant for believing that rumor.","zh":"没有任何依据可以相信那个谣言。"},{"en":"Her success gives warrant to his confidence in the team.","zh":"她的成功为他对团队的信心提供了依据。"}]},{"partOfSpeech":"vt.","definition":{"en":"To make something seem reasonable or necessary; to justify or support it.","zh":"使正当；证明……有理；为……提供依据。"},"examples":[{"en":"The evidence warrants further investigation.","zh":"这些证据足以支持进一步调查。"},{"en":"Nothing warrants that kind of rude behavior.","zh":"没有任何理由可以为那种粗鲁行为开脱。"}]}],"synonyms":["authorization","order","permit","justification","grounds","support"],"phonetic":"/ˈwɔrənt/","extraExplanation":["“awarrant”通常是把“a warrant”（一份/一个授权令）连写了。正确写法一般是分开：a warrant。","“warrant”在法律语境最常见（search warrant / arrest warrant）。在较正式的书面语里也常表示“依据、理由”，比如“no warrant for …”。"]}
{"word":"awaruite","summary":{"en":"“awaruite” is not a recognized standard English word; it’s likely a typo or a non-English term.","zh":"“awaruite”不是标准英语词；更可能是拼写错误或非英语词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a word from another language written in Roman letters.","zh":"不是标准英语单词。可能是拼写错误，或是其他语言用拉丁字母（罗马字）写出来的词。"},"examples":[{"en":"I can’t find “awaruite” in an English dictionary—could you check the spelling?","zh":"我在英语词典里找不到“awaruite”——你能检查一下拼写吗？"},{"en":"Did you mean “aware,” “overwrite,” or something else?","zh":"你想表达的是“aware（意识到）”、“overwrite（覆盖/覆写）”，还是别的词？"}]}],"phonetic":"/ˌeɪwəˈruːiːt/","extraExplanation":["“awaruite”看起来不像常见英语单词。如果你告诉我：1）它出现的句子/上下文；2）你想表达的中文意思；或3）它是不是人名、地名、品牌名、游戏/动漫用语，我就能更准确地帮你判断。","如果你是想查某个近似拼写的英语词，也可以把几个可能的拼法都发来（例如：awarite / overwrite / favorite 等），我可以逐个解释差异与用法。"]}
{"word":"awash","summary":{"en":"Awash means covered with water or flooded, and it can also mean “full of” something in large amounts (like money, rumors, or emotion).","zh":"Awash 指“被水淹没/被水覆盖”，也可引申为“充斥着、大量涌入”（如金钱、谣言、情绪等）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"covered with water; flooded or filled with a lot of liquid (or sometimes emotion).","zh":"被水覆盖的；泛滥的；（也可指情绪/信息）大量涌来的。"},"examples":[{"en":"After the storm, the streets were awash with rainwater.","zh":"暴风雨过后，街道被雨水淹没了。"},{"en":"The newsroom was awash in rumors after the announcement.","zh":"公告发布后，新闻编辑部里谣言四起、铺天盖地。"}]},{"partOfSpeech":"v.","definition":{"en":"to cover with water; to flood or wash over.","zh":"（水）淹没；冲刷；漫过。"},"examples":[{"en":"Waves awash the rocks at high tide.","zh":"涨潮时海浪冲刷着岩石。"},{"en":"Rain awashed the path, making it hard to walk.","zh":"雨水淹过小路，让人很难走。"}]}],"synonyms":["flooded","waterlogged","inundated","overflowing","swamped"],"phonetic":"/əˈwɑʃ/","extraExplanation":["“awash”常出现在新闻与写作里，搭配很固定：be awash with/in + 名词，表示“充满/大量涌入”（既可指水，也可指金钱、信息、谣言、情绪等）。","在航海语境中，boat/ship is awash 表示甲板被浪打得进水、被水覆盖，是一种危险状态。"]}
{"word":"awaste","summary":{"en":"“A waste” means something is not worth the time, money, or effort; “waste” also works as a verb meaning to use or lose something carelessly.","zh":"“a waste”表示不值得、白费（时间/金钱/精力等）；“waste”也可作动词，表示不小心或不恰当地使用/失去而造成浪费。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Commonly written as “a waste”) something that is not a good or useful use of something (such as time, money, or effort).","zh":"（常写作 “a waste”）不划算的使用；浪费（时间、金钱、精力等）。"},"examples":[{"en":"Scrolling for hours can feel like a waste of time.","zh":"刷手机刷了好几个小时可能会觉得是在浪费时间。"},{"en":"Buying that expensive tool was a waste of money for me.","zh":"对我来说买那个很贵的工具是在浪费钱。"},{"en":"Don’t let your hard work go to waste.","zh":"别让你的努力白费。"}]},{"partOfSpeech":"v.","definition":{"en":"to spoil or lose something valuable because you did not use it in time or in the right way.","zh":"（使）白白失去；（因未及时/未恰当使用而）浪费掉。"},"examples":[{"en":"We wasted a lot of food because we bought too much.","zh":"我们买太多了，结果浪费了很多食物。"},{"en":"I don’t want to waste this opportunity.","zh":"我不想错过/浪费这个机会。"}]}],"synonyms":["a loss","a poor use","squander","throw away"],"phonetic":"/ə ˈweɪst/","extraExplanation":["“awaste”不是常见的标准拼写，通常是把短语 “a waste” 连写了。更自然的写法是分开写：a waste（名词短语）。","常见搭配：a waste of time/money/energy；waste time/money；go to waste（白白浪费/腐坏）；waste away（逐渐消瘦；逐渐衰弱）。"]}
{"word":"awat","summary":{"en":"“Await” means “to wait for” something/someone, or that something (often a future event) is waiting to happen to you.","zh":"“await”表示“等待某事/某人”，也可表示“（未来的事情）将发生在你身上/在等着你”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to wait for something to happen or for someone to arrive (often in a formal or written style)","zh":"等待（某事发生或某人到来；常用于较正式/书面语）"},"examples":[{"en":"We are awaiting your reply.","zh":"我们正在等待你的回复。"},{"en":"A warm welcome awaited them at home.","zh":"回到家时，热情的欢迎在等着他们。"}]},{"partOfSpeech":"v.","definition":{"en":"to be going to happen to someone; to be waiting for someone in the future (often something good or bad)","zh":"（未来）将降临于某人；等待着某人（常指好事或坏事）"},"examples":[{"en":"A difficult decision awaits you.","zh":"一个艰难的决定在等着你。"},{"en":"If we don’t act now, worse problems may await us.","zh":"如果我们现在不采取行动，更糟的问题可能在等着我们。"}]}],"synonyms":["wait for","expect","anticipate"],"phonetic":"/əˈweɪt/","extraExplanation":["你输入的“awat”在英语里不常见，最可能是拼写成了 **await**。如果你其实想查的是缩写/名字（比如某个机构简称 AWAT），告诉我具体语境我也可以帮你确认。"]}
{"word":"awatch","summary":{"en":"“awatch” is usually just “a watch” (a timepiece). Rarely, “a-watch” can mean “on watch/guard.”","zh":"“awatch”通常是把“a watch（手表/表）”连写了；极少数情况下“a-watch”可指“值守/警戒”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard single English word; most often it is a misspelling or run-together form of “a watch” (an object you wear or carry to tell time).","zh":"不是标准的英文单词；最常见是把两个词连写，实际想表达 “a watch”（手表/表，用来计时）。"},"examples":[{"en":"I bought a watch for my dad.","zh":"我给爸爸买了一块手表。"},{"en":"Do you have a watch? I need to check the time.","zh":"你有手表吗？我想看一下时间。"}]},{"partOfSpeech":"phrase","definition":{"en":"(Rare/archaic) Sometimes seen as “a-watch,” meaning “on watch” (keeping guard, watching for danger).","zh":"（少见/古旧用法）有时写作 “a-watch”，意思接近 “on watch”（值守、站岗、警戒）。"},"examples":[{"en":"The guard stayed on watch through the night.","zh":"守卫整晚都在值守。"},{"en":"They kept watch for any movement.","zh":"他们警戒着任何动静。"}]}],"synonyms":["timepiece","wristwatch","keep watch","stand guard","be on guard"],"phonetic":"ə ˈwɑtʃ","extraExplanation":["更自然的写法通常是分开写：**a watch**。如果你想表达“站岗/值班”，更常用的搭配是 **on watch** 或 **keep watch**，而不是把它写成一个词。"]}
{"word":"awater","summary":{"en":"“awater” is an archaic word meaning “on/in the water; afloat,” and sometimes (poetically) “eyes full of tears.”","zh":"“awater”是古语，常指“在水上/在水里；漂浮”，诗歌里也可指“泪水盈眶”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Archaic) on or in the water; afloat; set on the water.","zh":"（古语）在水上；在水中；漂浮着；放到水里。"},"examples":[{"en":"The little boat was awater before sunrise.","zh":"那只小船在日出前就已漂在水上。"},{"en":"They set the nets awater and waited.","zh":"他们把网放到水里，然后等待。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare/poetic) troubled or overflowing, as if with water (often describing eyes).","zh":"（少见/诗歌用法）像含着水一样的；湿润欲滴的（常形容眼睛）。"},"examples":[{"en":"Her eyes were awater with tears.","zh":"她的眼睛泪水盈眶。"}]}],"synonyms":["afloat","on the water","in the water","watery (eyes)","tearful"],"phonetic":"/əˈwɔtər/","extraExplanation":["“awater”主要见于较老的英语或诗歌里；现代英语更常用 on the water / afloat / in the water，或用 watery / brimming with tears 来表达“泪汪汪”。","前缀 a- 在古英语/中古英语里常表示“处于……状态/在……之中”（如 asleep, awake, ablaze）。因此 awater 字面可理解为“处于水中/在水上”。"]}
{"word":"awave","summary":{"en":"Awave means moving or flowing like waves, especially used in literary description (e.g., flags awave).","zh":"Awave 指像波浪一样起伏或飘动，常用于较文学化的描写（如 flags awave）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(usually used after a noun) moving like a wave; waving or fluttering.","zh":"（多用于名词后）像波浪一样起伏的；飘扬的；摇曳的。"},"examples":[{"en":"The flags were awave in the strong wind.","zh":"旗帜在大风中迎风飘扬。"},{"en":"Her hair was awave as she ran down the hill.","zh":"她跑下山时，头发随风起伏飘动。"}]},{"partOfSpeech":"adv.","definition":{"en":"in waves; in a wave-like motion (often after the verb).","zh":"呈波浪状地；以波浪般的方式（常放在动词后）。"},"examples":[{"en":"The tall grass moved awave across the field.","zh":"高高的草在田野里波浪般起伏。"},{"en":"Banners streamed awave above the crowd.","zh":"横幅在人群上方波浪般飘动。"}]}],"synonyms":["waving","fluttering","rippling","undulating","billowing"],"phonetic":"/əˈweɪv/","extraExplanation":["“awave”常见于较文学化或描写性较强的语境，尤其是“名词 + be + awave”（如 flags/leaves/hair awave）。日常口语里更常说“waving / fluttering / rippling”。","前缀 a- 在一些较旧或固定表达中表示“处于……状态”（如 afloat, asleep, ablaze）。因此 awave 可理解为“处在波动/起伏的状态”。"]}
{"word":"Away","summary":{"en":"“Away” means at/to a distance or not present; it can also mean continuously (e.g., “work away”) and “away” in sports means playing at the opponent’s place.","zh":"“Away”表示在/到远处或不在场；也可表示“持续不停地”（如 work away）；在体育中指“客场的”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"to or at a distance from a place, person, or thing; not here","zh":"到/在远处；不在这里"},"examples":[{"en":"Go away and leave me alone, please.","zh":"请走开，让我一个人待一会儿。"},{"en":"The school is only two miles away.","zh":"学校只有两英里远。"},{"en":"She looked away when I spoke to her.","zh":"我跟她说话时，她把目光移开了。"}]},{"partOfSpeech":"adj.","definition":{"en":"not present; absent (often used after the verb “be”)","zh":"不在场的；缺席的（常放在 be 后）"},"examples":[{"en":"Mr. Lee is away on a business trip.","zh":"李先生出差去了，不在。"},{"en":"I’ll be away for a few days.","zh":"我会离开几天。"}]},{"partOfSpeech":"adv.","definition":{"en":"continuously or repeatedly; without stopping","zh":"不停地；持续地"},"examples":[{"en":"The kids were laughing away in the next room.","zh":"孩子们在隔壁房间里笑个不停。"},{"en":"She worked away all afternoon.","zh":"她整个下午都在不停地工作。"}]},{"partOfSpeech":"adj.","definition":{"en":"used in sports to describe the team playing at the opponent’s place, not at home","zh":"（体育）客场的"},"examples":[{"en":"They won their first away game this season.","zh":"他们赢得了本赛季第一场客场比赛。"}]}],"synonyms":["distantly","elsewhere","off","absent","apart"],"phonetic":"/əˈweɪ/","extraExplanation":["常见搭配：\n- away from…：远离……（Stay away from the edge. 远离边缘。）\n- go away：走开/离开（也可表示“消失”：The pain went away. 疼痛消失了。）\n- far away：很远\n- right away：立刻、马上\n- give away：赠送；泄露秘密；暴露（语义与“away=离开自己”有关）\n- throw away：扔掉、丢弃\n\n语感提示：away 常表达“从这里/从说话者身边移开”的方向感，所以与 go/look/run 等动作动词搭配非常自然。"]}
{"word":"away","summary":{"en":"Away usually means “at/to a distance” or “not here.” It can also mean “off/removed,” “continuing,” or “away (visitor) in sports.”","zh":"Away 常表示“在/到远处、离开这里”，也可表示“移走/消失”“持续不停地”，或体育中的“客场（的）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"to or at a distance from a person or place; not here","zh":"到（或在）远处；离开这里"},"examples":[{"en":"Please step away from the edge.","zh":"请从边缘往后退一点。"},{"en":"I’m away from home this week.","zh":"我这周不在家。"},{"en":"The beach is only five minutes away.","zh":"海滩只有五分钟的路程。"}]},{"partOfSpeech":"adv.","definition":{"en":"off; removed; so as to disappear or be taken from a place","zh":"离开原处；被移走；（使）消失/不见"},"examples":[{"en":"Put your phone away during the meeting.","zh":"开会时把手机收起来。"},{"en":"The stain won’t wash away.","zh":"这个污渍怎么洗也洗不掉。"},{"en":"The wind blew the papers away.","zh":"风把纸吹走了。"}]},{"partOfSpeech":"adv.","definition":{"en":"used to show that something continues (often until it is finished)","zh":"（用于表示持续进行，常指直到完成）不停地"},"examples":[{"en":"Keep working away—you’re doing great.","zh":"继续干下去——你做得很好。"},{"en":"She was typing away all afternoon.","zh":"她整个下午都在不停地打字。"}]},{"partOfSpeech":"adj.","definition":{"en":"happening at the opponent’s place, not your own (sports)","zh":"（体育）客场的（在对方场地进行的）"},"examples":[{"en":"They won their first away game of the season.","zh":"他们赢了本赛季第一场客场比赛。"},{"en":"Our next match is away.","zh":"我们下一场比赛是客场。"}]}],"synonyms":["elsewhere","apart","off","far","distant","absent"],"phonetic":"/əˈweɪ/","extraExplanation":["“away”非常常见，常和介词组成固定搭配：away from（远离/避免接触），例如：Stay away from the fire.（离火远点。）","在口语里，“five minutes away / two miles away”表示“距离……有多远/要多久”，不一定真的“离开”。","“away”也常出现在短语动词里（意思会变化）：put away（收好）、throw away（扔掉）、give away（赠送/泄露）、run away（逃跑）。"]}
{"word":"awayness","summary":{"en":"Awayness means a sense or state of being away—distant, remote, or emotionally withdrawn.","zh":"Awayness 指一种“在远处/离开”的感觉或状态，可指偏远，也可指情感上的疏离与抽离。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or feeling of being away, distant, or withdrawn (physically or emotionally)","zh":"离开、疏远或抽离的状态或感觉（可以是身体上的，也可以是情感上的）"},"examples":[{"en":"After the argument, there was a new awayness between them.","zh":"争吵之后，他们之间多了一种疏离感。"},{"en":"Her awayness made it hard to know what she was really thinking.","zh":"她那种心不在焉、抽离的样子让人很难知道她真正的想法。"},{"en":"The cabin’s awayness was exactly what we needed to rest.","zh":"那间小木屋的偏远正是我们休息所需要的。"}]}],"synonyms":["distance","remoteness","detachment","absence","aloofness"],"phonetic":"/əˈweɪnəs/","extraExplanation":["“awayness”由“away + -ness”构成，意思直观，但在现代英语中比较少见，更常见的替代表达有：distance（疏离/距离）、remoteness（偏远）、detachment（抽离）、absence（缺席）、aloofness（冷淡疏远）。","它既可指“地理上的远”，也可指“心理上的远”（情感抽离、心不在焉）。在描写人物气质、关系冷却或氛围隔离时，有时会被文学或较具风格的写作采用。"]}
{"word":"awaynesses","summary":{"en":"Awaynesses (plural of awayness) means states or feelings of being away—distance, absence, or emotional detachment.","zh":"awaynesses 是 awayness 的复数，指“远离/不在场/疏离”的状态或感觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or feeling of being away; distance, absence, or emotional detachment","zh":"“离开”的状态或感觉；距离、缺席，或情感上的疏离"},"examples":[{"en":"After months abroad, she felt a strange awayness from her old routine.","zh":"在国外待了几个月后，她对以前的日常生活产生了一种奇怪的疏离感。"},{"en":"His silence created an awayness between them at dinner.","zh":"他的沉默让晚餐时他们之间产生了隔阂。"},{"en":"The awayness of the mountains made the village seem quiet and safe.","zh":"群山的遥远感让这个村庄显得安静又安全。"}]}],"synonyms":["distance","absence","remoteness","detachment","separateness"],"phonetic":"/əˈweɪnəsɪz/","extraExplanation":["“awaynesses”是名词“awayness”的复数形式，但这个词在现代英语中很少见，更常用的表达是“distance / absence / remoteness / detachment”。","“awayness”常出现在文学或描写性写作里，用来表达一种氛围：不只是物理上的远，也可能是心理或情感上的“远离”。"]}
{"word":"aways","summary":{"en":"“Aways” most often means “away games/matches” (sports). It can rarely be a poetic/dialect form of “away.”","zh":"“Aways”最常见指体育中的“客场比赛”。极少情况下也可作诗歌/方言里的“away（离开/在远处）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(sports, informal) Away games or away matches (games played at the opponent’s place, not your home field/court).","zh":"（体育/非正式）客场比赛；作客比赛（在对手主场进行的比赛）。"},"examples":[{"en":"This season we have more aways than homes in the first month.","zh":"这个赛季第一个月，我们的客场比赛比主场比赛还多。"},{"en":"Our record in aways is better than our record at home.","zh":"我们客场战绩比主场战绩更好。"}]},{"partOfSpeech":"adv.","definition":{"en":"(rare, poetic or dialect) Away; toward another place or at a distance (an uncommon form of “away”).","zh":"（罕见/诗歌或方言）离开；到别处；在远处（“away”的不常见形式）。"},"examples":[{"en":"He wandered aways into the hills and didn’t return until nightfall.","zh":"他一路走到远山里，直到天黑才回来。"}]}],"synonyms":["away games","away matches","road games"],"phonetic":"/əˈweɪz/","extraExplanation":["“aways”最常见是在体育语境里当名词用，意思是“客场比赛们”。日常英语里更常说 away games / away matches，而不是直接说 aways。","很多学习者会把 aways 和 always 混淆：always（总是）更常见；aways（客场/罕见的“离开”）语义不同。"]}
{"word":"AWB","summary":{"en":"AWB most commonly means “air waybill,” an air-cargo shipping document; it can also mean “automated/automatic weather broadcast” in aviation.","zh":"AWB 最常见指“航空运单”；在航空领域也可指“自动气象广播”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbrev.) Air waybill: a shipping document used for air cargo that lists the sender, receiver, flight details, and tracking information.","zh":"（缩写）航空运单：用于空运货物的运输文件，记录发货人、收货人、航班信息及追踪编号等。"},"examples":[{"en":"Please send me the AWB number so I can track the shipment.","zh":"请把航空运单（AWB）号码发给我，这样我可以追踪货物。"},{"en":"The warehouse can’t release the cargo without the AWB.","zh":"没有航空运单（AWB），仓库无法放货。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbrev.) Automated/Automatic Weather Broadcast: a radio service that continuously announces local airport weather conditions to pilots.","zh":"（缩写）自动气象广播：向飞行员持续播报机场当地天气情况的无线电服务。"},"examples":[{"en":"Listen to the AWB before approaching the airport.","zh":"进近机场前先收听自动气象广播（AWB）。"},{"en":"The AWB reported low visibility this morning.","zh":"今天早上自动气象广播（AWB）报告能见度很低。"}]}],"phonetic":"/ˌeɪ dʌbəl.juː ˈbiː/","extraExplanation":["在国际物流与外贸语境里，AWB 最常见的就是 Air Waybill（航空运单）。它类似于海运的 B/L（Bill of Lading），但通常不具备“物权凭证”性质；更多是运输合同与收货/交付凭证，并用于查询追踪（tracking）。","AWB 常与快递/空运公司（如 DHL/UPS/FedEx 或航空公司货运部门）的“AWB number（运单号）”一起出现，是沟通清关、提货、对账时的关键信息。"]}
{"word":"awber","summary":{"en":"“Awber” is usually a proper name (not a common English word). It may also be a misspelling of a similar name like “Auber.”","zh":"“Awber”通常是专有名词（人名/姓氏），不是常见英语词；也可能是类似名字（如 “Auber”）的误拼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A family name (surname) or given name. It is not a standard English vocabulary word and is mainly used as a proper noun (a person’s name).","zh":"一个姓氏或名字。“Awber”不是标准英语词汇，主要作为专有名词（人名）使用。"},"examples":[{"en":"Dr. Awber will see you now.","zh":"Awber 医生现在要见你。"},{"en":"I met someone named Awber at the conference.","zh":"我在会议上认识了一个叫 Awber 的人。"}]},{"partOfSpeech":"other","definition":{"en":"A misspelling or rare variant of other names/words (often confused with “Auber,” a French surname, or similar-looking words).","zh":"其他名字/词的拼写错误或罕见变体（常与法语姓氏 “Auber”等相似形式混淆）。"},"examples":[{"en":"Did you mean Auber (the composer) rather than Awber?","zh":"你是想说作曲家 Auber，而不是 Awber 吗？"},{"en":"The record lists “Awber,” but it may be a typo.","zh":"记录上写的是 “Awber”，但可能是拼写错误。"}]}],"synonyms":["Auber (possible intended form)"],"phonetic":"/ˈɔbər/","extraExplanation":["“Awber”在常见英语词典里通常查不到作为普通词汇的条目。如果你是在文学作品里看到它，最可能是人物姓氏/名字，或是对其他词（如“Auber”）的误拼。","如果你能提供一句原文（它出现的句子/段落），我可以更准确判断它指的是人名、地名，还是某个词的拼写错误。"]}
{"word":"awd","summary":{"en":"AWD most commonly means “all-wheel drive,” a car system that can power all four wheels for better traction.","zh":"AWD最常见的意思是“全轮驱动”，一种可为四个车轮提供动力以增强抓地力的汽车系统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(initialism) All-wheel drive: a vehicle system where power can be sent to all four wheels to improve traction, especially on wet, snowy, or uneven roads.","zh":"（缩写）四轮驱动/全轮驱动：一种车辆系统，可将动力分配给四个车轮，以提升抓地力，尤其在雨雪或路况不佳时更有用。"},"examples":[{"en":"This SUV has AWD, so it feels more stable in the snow.","zh":"这辆SUV是AWD，所以在雪地里开起来更稳。"},{"en":"AWD helps with traction, but it doesn’t automatically mean shorter braking distance.","zh":"AWD有助于抓地力，但不代表刹车距离就一定更短。"},{"en":"If you often drive in rain or light snow, AWD can be a practical choice.","zh":"如果你经常在雨天或小雪天开车，AWD会是个实用的选择。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common, business/service) Average wait time/delay used in reports or customer-service metrics.","zh":"（较少见，商业/服务）平均等待时间/平均延迟：用于报表或客服指标中的缩写。"},"examples":[{"en":"Our AWD dropped from 6 minutes to 3 minutes after we added more staff.","zh":"我们增加人手后，平均等待时间（AWD）从6分钟降到3分钟。"},{"en":"The dashboard tracks AWD and customer satisfaction together.","zh":"这个仪表板同时跟踪AWD和客户满意度。"}]}],"synonyms":["all-wheel drive","4WD (often used loosely)","4x4 (often used loosely)"],"phonetic":"/ˌeɪˌdʌbəlˌjuːˈdiː/","extraExplanation":["在汽车语境里，AWD（全轮驱动）和4WD/4x4（四驱）常被混用，但通常AWD更偏“自动分配动力、适合铺装路面+轻度恶劣天气”；4WD更偏“可手动切换/更强越野能力”。不同品牌定义也可能不完全一致。","学习提示：AWD一般读作字母“A-W-D”。写作时多用于汽车配置说明（e.g., AWD model / AWD system）。"]}
{"word":"awe","summary":{"en":"Awe is deep wonder and respect (sometimes with fear), and it can also mean to make someone feel that way.","zh":"awe 指带有敬意的强烈惊叹（有时夹杂畏惧）；也可作动词表示“使人敬畏/惊叹”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong feeling of wonder and respect, often mixed with fear, when you see or experience something powerful, beautiful, or very great.","zh":"（面对强大、壮丽或伟大之物时的）敬畏；惊叹（常夹杂一丝害怕）。"},"examples":[{"en":"We watched the rocket launch in awe.","zh":"我们敬畏地看着火箭发射。"},{"en":"The child stared at the huge waterfall with awe.","zh":"孩子敬畏地盯着那座巨大的瀑布。"}]},{"partOfSpeech":"vt.","definition":{"en":"To fill someone with awe; to make someone feel deep wonder and respect.","zh":"使敬畏；使惊叹。"},"examples":[{"en":"The cathedral’s size and detail awed the visitors.","zh":"大教堂的规模和细节让游客们惊叹不已。"},{"en":"I was awed by her courage in a difficult time.","zh":"在艰难时期她的勇气让我十分敬佩。"}]}],"synonyms":["wonder","amazement","reverence","admiration"],"phonetic":"/ɔ/","extraExplanation":["“awe”常与“in”搭配：in awe (of ...) 表示“对……敬畏/惊叹”。例如：in awe of nature（对大自然心生敬畏）。","语气上，“awe”比“surprise（惊讶）”更庄重、更深；它更接近“敬佩 + 惊叹”，有时还带一点“畏”。","常见固定搭配：awe-inspiring（令人敬畏的、震撼的），stand in awe（肃然起敬）。"]}
{"word":"AWEA","summary":{"en":"AWEA is the abbreviation for the American Wind Energy Association, a former U.S. wind industry trade group.","zh":"AWEA 是 American Wind Energy Association（美国风能协会）的缩写，曾是美国风电行业组织。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"American Wind Energy Association: a U.S. trade group that represented the wind power industry (companies involved in wind energy).","zh":"美国风能协会：美国风电行业的行业组织（代表风能相关企业与机构）。"},"examples":[{"en":"AWEA released an annual report on U.S. wind power growth.","zh":"AWEA 发布了关于美国风电增长的年度报告。"},{"en":"She attended an AWEA conference to learn about wind turbine technology.","zh":"她参加了 AWEA 的会议，了解风力涡轮机技术。"}]}],"synonyms":["American Wind Energy Association","ACP (American Clean Power Association)"],"phonetic":"/ˌeɪˌdʌbəl.juːˌiːˈeɪ/","extraExplanation":["AWEA 是缩写，通常按字母逐个读作 “A-W-E-A”。","该组织在 2020 年与其他团体合并，成为 American Clean Power Association（美国清洁电力协会，常写作 ACP）。因此在较新的新闻与报告中，你可能更常见到 ACP，而不是 AWEA。"]}
{"word":"awearied","summary":{"en":"Awearied means very tired (a literary/old-fashioned form of wearied).","zh":"awearied 意为“非常疲倦”，是 wearied 的文学/古旧写法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(literary/old-fashioned) very tired; worn out.","zh":"（文学/较古旧）非常疲倦的；精疲力尽的。"},"examples":[{"en":"After walking all day, they were awearied and silent.","zh":"走了一整天后，他们精疲力尽，沉默不语。"},{"en":"He sat down by the road, awearied from the long journey.","zh":"他在路边坐下，长途跋涉后早已疲惫不堪。"}]}],"synonyms":["wearied","weary","tired","exhausted","fatigued"],"phonetic":"/əˈwɪrid/","extraExplanation":["“awearied”是“wearied”（疲倦的）的文学化/古风写法，在现代日常英语里很少用，更多出现在诗歌、圣经式语言或古典文学中。","前缀 a- 在一些古旧表达里表示“处于……状态”，类似于 afoot（步行着）、asleep（睡着的）。因此 awearied 可以理解为“处于疲惫状态”。"]}
{"word":"aweary","summary":{"en":"Aweary is an old-fashioned word meaning “tired” or “weary.”","zh":"aweary 是较古老的用法，意思是“疲倦的；劳累的”（同 weary）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic or literary) tired; weary.","zh":"（古语/文学用语）疲倦的；劳累的。"},"examples":[{"en":"After a long day of travel, they were aweary and ready to rest.","zh":"经过一天的长途跋涉，他们已疲惫不堪，只想休息。"},{"en":"He grew aweary of the constant noise in the city.","zh":"他渐渐厌倦了城市里持续不断的喧闹。"}]}],"synonyms":["weary","tired","fatigued","worn out"],"phonetic":"/ˈwɪri/","extraExplanation":["“aweary”多见于较早期的英语或诗歌/圣经式文风中，相当于现代英语的“weary”。其中前缀 a- 在古英语/中古英语里常见，用来表示“处于某种状态”（类似“asleep, afloat, awake”）。现代日常写作通常用“weary”更自然。"]}
{"word":"aweather","summary":{"en":"Aweather is an archaic word meaning “outdoors and exposed to the weather.”","zh":"aweather 是一个较少见的古词，意思是“在户外、暴露在风雨中/在露天”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic) Outdoors and exposed to the weather; in the open air.","zh":"（古义）在户外、暴露在风雨中；在露天。"},"examples":[{"en":"The tools were left aweather all night and got rusty.","zh":"工具整夜被放在露天，结果生锈了。"},{"en":"In older writing, people might say the travelers slept aweather.","zh":"在较早的文字里，人们可能会说旅人“露宿在外”。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Archaic) In the open air; outside, not under shelter.","zh":"（古义）在露天；在外面（不在遮蔽处）。"},"examples":[{"en":"Keep the grain indoors; don’t leave it aweather.","zh":"把谷物放在室内；别把它放在露天。"},{"en":"They stood aweather, waiting for the storm to pass.","zh":"他们站在户外，等暴风雨过去。"}]}],"synonyms":["outdoors","outside","in the open air","exposed to the elements"],"phonetic":"/əˈwɛðər/","extraExplanation":["“a-”在古英语/早期现代英语中常用作前缀，表示“处于某种状态/在某处”（如 aflame 着火的、asleep 睡着的）。aweather 就是“在风雨中、在露天”的意思。","这个词如今很少用，现代英语更常说 outdoors / outside / exposed to the weather。"]}
{"word":"aweband","summary":{"en":"Awe means a deep feeling of wonder and respect (sometimes fear), and it can also mean to greatly impress someone.","zh":"Awe 指强烈的惊叹与敬畏（有时带一点害怕/震撼），也可作动词表示“使人惊叹”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong feeling of wonder, admiration, and sometimes fear, often caused by something powerful, vast, or beautiful","zh":"（因宏大、强大或美丽之物而产生的）敬畏；惊叹（常带一点害怕或震撼）"},"examples":[{"en":"We watched the rocket launch in awe.","zh":"我们怀着敬畏之心观看火箭发射。"},{"en":"The Grand Canyon filled her with awe.","zh":"大峡谷让她充满震撼与敬畏。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make someone feel great wonder, admiration, and respect","zh":"使（某人）敬畏；使惊叹"},"examples":[{"en":"The musician’s skill awed the audience.","zh":"这位音乐家的技艺让观众惊叹不已。"},{"en":"I was awed by how calm he stayed under pressure.","zh":"我被他在压力下依然冷静的表现震撼到了。"}]}],"synonyms":["wonder","amazement","reverence","admiration","astonish (v.)","impress (v.)"],"phonetic":"/ɔ/","extraExplanation":["“aweband”不是常见英语单词，可能是拼写错误或品牌/用户名。你可能想查的是 **awe**（敬畏/惊叹）。如果你想表达“令人敬畏的”，更常用 **awesome** 或 **awe-inspiring**。","常见搭配：**in awe (of)**（对……感到敬畏/惊叹），如 *in awe of nature*（对大自然感到敬畏）。文学与宗教语境中也常用 *awe* 来表达面对“崇高/神圣”时的震撼与敬畏感。"]}
{"word":"awed","summary":{"en":"Awed means feeling strong wonder and respect, often mixed with amazement.","zh":"awed 表示感到强烈的惊叹与敬畏，常带有震撼感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"filled with wonder, respect, or amazement (often mixed with a little fear)","zh":"充满敬畏、惊叹（常带一点点害怕或震撼）的"},"examples":[{"en":"We stood awed beneath the huge redwood trees.","zh":"我们站在巨大的红杉树下，满怀敬畏。"},{"en":"The students were awed by the scientist’s discovery.","zh":"学生们对那位科学家的发现感到震撼与敬佩。"},{"en":"She gave an awed whisper when the lights came on.","zh":"灯亮起时，她惊叹地低声说道。"}]}],"synonyms":["amazed","impressed","overwhelmed","astonished","in awe"],"phonetic":"/ɔd/","extraExplanation":["“awed”来自名词/动词“awe”（敬畏；使敬畏）。常见搭配：be awed by + 人/事（对……感到敬畏）；be awed at + 事物/场景（对……感到惊叹）。语气比“impressed”更强，更强调“震撼、庄严、伟大到让人屏息”的感觉。"]}
{"word":"awedly","summary":{"en":"“Awedly” means “in an awed way,” showing wonder or respectful amazement.","zh":"“awedly”表示“敬畏地/惊叹地”，带着崇敬与惊奇的情绪。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in an awed way; with a feeling of wonder, admiration, or respectful fear","zh":"敬畏地；带着惊叹、钦佩或带点害怕的心情"},"examples":[{"en":"The children stared awedly at the fireworks.","zh":"孩子们敬畏地盯着烟火看。"},{"en":"She listened awedly as the scientist explained the discovery.","zh":"科学家讲解这项发现时，她带着惊叹的神情认真听着。"},{"en":"He looked awedly at the ancient temple’s huge stone pillars.","zh":"他敬畏地望着古老寺庙巨大的石柱。"}]}],"synonyms":["in awe","with awe","wonderingly","admiringly","reverently"],"phonetic":"/ˈɔdli/","extraExplanation":["“Awedly”来自形容词“awed”（感到敬畏的），而“awed”来自名词/动词“awe”（敬畏、惊叹）。它不算特别常用，写作中更常见的替代说法有“in awe”或“with awe”。例如：\"They stared in awe.\"（他们惊叹地凝视。）","注意不要和“oddly”（奇怪地）混淆；拼写相近但意思完全不同。"]}
{"word":"awedness","summary":{"en":"Awedness means the feeling or state of being awed—deep wonder and respect.","zh":"Awedness 指“感到敬畏/惊叹”的状态，但更常用的说法是 awe 或 in awe。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or quality of being awed; feeling deep wonder, respect, or amazement.","zh":"敬畏（或惊叹）的状态；一种深深的惊奇、尊敬或震撼感。"},"examples":[{"en":"She spoke with awedness after seeing the Grand Canyon for the first time.","zh":"她第一次看到大峡谷后，带着敬畏与惊叹说话。"},{"en":"The children stared in silent awedness at the fireworks.","zh":"孩子们默默地看着烟花，满是惊叹与震撼。"}]}],"synonyms":["awe","wonder","amazement","admiration"],"phonetic":"/ˈɔd.nəs/","extraExplanation":["“awedness”是由形容词“awed”（感到敬畏/惊叹的）加名词后缀“-ness”构成，语法上没问题，但在真实英语中不算常用。","更自然、更常见的表达通常是用名词“awe”（敬畏/惊叹）或短语“a sense of awe / in awe”：例如 “They looked in awe.” 或 “She felt a sense of awe.”"]}
{"word":"awee","summary":{"en":"“awee” is a nonstandard spelling, most often meaning “aww!” (a cute reaction), and sometimes meaning “a wee” = “a little.”","zh":"“awee”是非标准拼写，最常见表示“aww!”（觉得可爱/心疼的反应），有时也表示“a wee”=“一点点/一会儿”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(informal) A cute or playful spelling of “aww,” used to show affection, sympathy, or that something is sweet.","zh":"（非正式）“aww”的可爱/撒娇式拼写，用来表示喜欢、心疼、或觉得某事很可爱。"},"examples":[{"en":"Awee, that puppy is so tiny!","zh":"Awee，那只小狗也太小了吧！"},{"en":"Awee, I’m sorry you had a hard day.","zh":"Awee，今天你辛苦了（我好心疼）。"}]},{"partOfSpeech":"other","definition":{"en":"(sometimes, especially in Scottish/Irish-influenced writing) A nonstandard spelling of “a wee,” meaning “a little; a short time.”","zh":"（有时见于带苏格兰/爱尔兰风格的写法）“a wee”的非标准拼写，意思是“一点点；一小会儿”。"},"examples":[{"en":"Wait awee—I’ll be right back.","zh":"等一小会儿——我马上回来。"},{"en":"Can you move it awee to the left?","zh":"你能把它往左挪一点点吗？"}]}],"synonyms":["aww","aw","a wee","a little","for a bit"],"phonetic":"/ɔː/","extraExplanation":["“awee”不是标准拼写，更多出现在聊天、可爱风文案或拟声用法中。正式写作一般用“aww”。","如果你想表达“有点儿/一会儿”，更常见的写法是分开写“a wee”（偏英式/苏格兰英语语感），美式英语里通常用“a little”或“for a bit”。"]}
{"word":"aweek","summary":{"en":"“aweek” is a nonstandard form; the correct standard spelling is “a week” (seven days).","zh":"“aweek”是非标准写法；标准拼写是“a week”，表示“一周/七天”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Nonstandard spelling) usually means “a week” (seven days). In standard English, write it as two words: “a week.”","zh":"（非标准拼写）通常表示“a week”，即“一周/七天”。标准英语应写作两个词：a week。"},"examples":[{"en":"I’ll be on vacation for a week.","zh":"我会休假一周。"},{"en":"It took me a week to finish the book.","zh":"我花了一周时间读完这本书。"},{"en":"See you in a week.","zh":"一周后见。"}]}],"synonyms":["a week","seven days","one week"],"phonetic":"/ə ˈwik/","extraExplanation":["“aweek”作为连写形式在现代英语里不常见，容易被当作拼写错误。写作“a week”更清楚、更符合考试与正式写作规范。","如果你想表达“每周一次/每周”，常用：every week / weekly；不要写成“aweek”。"]}
{"word":"aweel","summary":{"en":"A Scots/Scottish-dialect form of “well,” used as an interjection or meaning “all right / in good health.”","zh":"“aweel”是苏格兰/Scots 方言里“well”的写法，可作语气词“嗯/那么”，也可表示“还好/健康”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(Scottish / Scots dialect) “Well,” used to start a sentence, show mild surprise, agreement, or to move the conversation along (similar to “well then”).","zh":"（苏格兰/苏格兰英语方言）“嗯/那么/好吧”，常用来开启一句话、表示轻微惊讶或赞同，或推动对话继续（类似“well then”）。"},"examples":[{"en":"Aweel, I didn’t expect to see you here.","zh":"嗯/好吧，我没想到会在这里见到你。"},{"en":"Aweel then, let’s get started.","zh":"那么，我们开始吧。"},{"en":"“Aweel!” he said, laughing, “that’s a surprise.”","zh":"“哎呀/嗯！”他笑着说，“真是个意外。”"}]},{"partOfSpeech":"adj.","definition":{"en":"(Scottish / Scots dialect) “Well; all right; in good health or condition.”","zh":"（苏格兰/苏格兰英语方言）“很好/还行；健康；状况良好。”"},"examples":[{"en":"Are you aweel after the trip?","zh":"旅行后你还好/身体还行吗？"},{"en":"She’s no aweel today, so she stayed home.","zh":"她今天不太舒服，所以待在家里。"}]}],"synonyms":["well","well then","all right","okay"],"phonetic":"/əˈwil/","extraExplanation":["“aweel”多见于苏格兰英语/Scots 口语与文学对白里，相当于标准英语里的“well”。有时也会写作“a weel”。","如果你原本想查的是标准英语“awe”（敬畏/惊叹），也可以告诉我，我可以把“awe”的词条一起给你对比。"]}
{"word":"aweg","summary":{"en":"“aweg” isn’t standard English; it’s usually a typo (often for “awe,” “awed,” or “away”).","zh":"“aweg”不是标准英语词，通常是拼写错误（常见想写的是 “awe / awed / away”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a typo or misspelling (commonly of “awe,” “awed,” or “away,” depending on context).","zh":"不是标准英语单词；多见于拼写错误（常见可能想写的是 “awe / awed / away”，需看上下文）。"},"examples":[{"en":"I think you meant “awe” (a feeling of wonder), not “aweg.”","zh":"我想你可能想写的是 “awe”（敬畏/惊叹），而不是 “aweg”。"},{"en":"If you meant “away,” you could write: “He walked away.”","zh":"如果你想表达 “away（离开）”，可以写：“He walked away.”"}]}],"phonetic":"/ɔ/","extraExplanation":["“aweg”在常见词典里没有收录，通常是键盘误按或输入法导致的拼写错误。要判断你想表达哪个词，可以把它放进完整句子里（例如你原句是什么），我就能帮你纠正并解释。","如果你想表达“敬畏/惊叹”的感觉，最可能的目标词是 awe（/ɔ/）；如果是“离开/不在”，可能是 away；如果是“感到敬畏（被震撼到）”，可能是 awed。"]}
{"word":"awegian","summary":{"en":"“awegian” is not standard English; it’s likely a misspelling of “aweigh” or “Aegean.”","zh":"“awegian” 不是标准英语词；很可能是 “aweigh” 或 “Aegean” 的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard/incorrect spelling; not a recognized English word in dictionaries. It is most likely a typo or mishearing of another word (commonly “aweigh” as in “anchors aweigh,” or sometimes “Aegean,” the sea/region).","zh":"非标准/错误拼写；不是词典中认可的英语单词。很可能是别的词的拼写错误或听错，常见可能是 “aweigh”（如短语 “anchors aweigh”），也可能是 “Aegean”（爱琴海/爱琴地区）。"},"examples":[{"en":"I couldn’t find “awegian” in a dictionary—did you mean “aweigh” in “anchors aweigh”?","zh":"我在词典里找不到 “awegian”——你是不是想说短语 “anchors aweigh” 里的 “aweigh”？"},{"en":"If you meant “Aegean,” it refers to the Aegean Sea near Greece and Turkey.","zh":"如果你想写的是 “Aegean”，它指靠近希腊和土耳其的爱琴海。"}]}],"phonetic":"/əˈweɪdʒən/","extraExplanation":["“anchors aweigh” 里的 **aweigh** 意思是“（锚）已离底/起锚”，常见于航海语境，也因美国海军歌曲《Anchors Aweigh》而更广为人知。","**Aegean**（爱琴的）常出现在历史、地理与文学语境（如古希腊文明、群岛、海上贸易），拼写与发音都与 “aweigh” 不同。","如果你能提供原句（awegian 出现的上下文），我可以更准确判断你想表达哪个词，并给出更贴切的释义与用法。"]}
{"word":"aweigh","summary":{"en":"A nautical word meaning “raised up and clear of the bottom,” especially used for an anchor.","zh":"航海用语，指“被吊起、离底”，尤用于表示“锚已起（离海底）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nautical) lifted up and no longer resting on the bottom; said especially of an anchor that has been raised clear.","zh":"（航海用语）被吊起、离底；尤指“锚已起离海底”。"},"examples":[{"en":"At dawn, the anchor was aweigh and the ship began to move.","zh":"天一亮，锚就起离海底了，船开始移动。"},{"en":"The captain waited until the anchor was aweigh before giving full power.","zh":"船长等到锚完全起离海底后才下令全速前进。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Nautical) up; lifted; off the ground or seabed (often used after a verb like “be” or “get”).","zh":"（航海用语）向上；被提起；离开地面或海底（常跟在 be / get 等动词后）。"},"examples":[{"en":"Once the anchor is aweigh, keep clear of the chain.","zh":"一旦锚起了，务必远离锚链。"},{"en":"They got the anchor aweigh after a few minutes of hard work.","zh":"他们费了几分钟力气，终于把锚起离海底了。"}]}],"synonyms":["raised","lifted","off the bottom","hoisted"],"phonetic":"əˈweɪ","extraExplanation":["“aweigh”主要是航海词，来自古英语/中古英语中与“重量、悬挂”相关的表达，意思是“被吊起、离底”。","最常见搭配是“anchor aweigh”（锚起），也因美国海军军歌《Anchors Aweigh》而广为人知。注意：正确写法是“aweigh”，不是“away”。"]}
{"word":"aweing","summary":{"en":"“aweing” is usually a misspelling; the standard form is “awing,” meaning causing awe or filling someone with awe.","zh":"“aweing”通常是误拼；规范写法多为“awing”，表示“令人敬畏的/使人心生敬畏”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Spelling note) “aweing” is a common misspelling. The correct -ing form of “awe” is usually “awing” (present participle of “awe”).","zh":"（拼写提示）“aweing”常见于误拼。动词 “awe” 的 -ing 形式通常写作 “awing”（“awe”的现在分词）。"},"examples":[{"en":"I often see “aweing” online, but most dictionaries list the -ing form as “awing.”","zh":"我经常在网上看到 “aweing”，但大多数词典把 -ing 形式写作 “awing”。"}]},{"partOfSpeech":"adj.","definition":{"en":"(awing) filling someone with awe; making someone feel deep respect and wonder.","zh":"（awing）使人产生敬畏与惊叹；让人感到深深的尊敬与震撼。"},"examples":[{"en":"The awing beauty of the mountains left us silent.","zh":"群山令人敬畏的美让我们一时无言。"},{"en":"The teacher’s stories were awing to the children.","zh":"老师的故事让孩子们心生敬畏与惊叹。"}]},{"partOfSpeech":"v.","definition":{"en":"(awing) to fill someone with awe; to impress someone strongly with greatness, power, or beauty.","zh":"（awing）使某人心生敬畏；以伟大、力量或美强烈震撼/打动某人。"},"examples":[{"en":"The speaker was awing the audience with her confidence.","zh":"演讲者用她的自信震撼了听众。"},{"en":"Seeing the ocean at night was awing me more than I expected.","zh":"夜里看见大海带给我的震撼超乎预期。"}]}],"synonyms":["awe-inspiring","astonishing","amazing","impressive","overwhelming"],"phonetic":"/ˈɔ.ɪŋ/","extraExplanation":["“awe” 是一个以元音字母 + 静音 e 结尾的词，通常加 -ing 时会去掉 e（例如: make → making），所以更常见、也更规范的是 “awing”，而不是 “aweing”。","日常英语里，比起单独用 “awing”，更常见的是形容词 “awe-inspiring”（令人敬畏的、令人叹为观止的）或短语 “in awe of”（对……心生敬畏）。"]}
{"word":"aweless","summary":{"en":"“Aweless” is a rare adjective meaning “not awe-inspiring; lacking awe.” In everyday English, people usually choose more common words like “underwhelming” or “uninspiring.”","zh":"“aweless”是很少见的形容词，意为“不令人敬畏/不够震撼”。日常英语里通常用“underwhelming / uninspiring”等更常见的说法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not inspiring awe; lacking a feeling of wonder or deep respect.","zh":"不令人敬畏的；缺乏“敬畏/惊叹”之感的。"},"examples":[{"en":"The performance was fine, but it was aweless—nothing truly unforgettable.","zh":"表演还不错，但不够令人惊叹——没有真正让人难忘的地方。"},{"en":"After seeing so many famous landmarks, the small museum felt aweless to him.","zh":"看过那么多著名地标后，那家小博物馆让他觉得没什么震撼感。"}]}],"synonyms":["underwhelming","uninspiring","unremarkable","ordinary","not awe-inspiring"],"phonetic":"/ˈɔləs/","extraExplanation":["“aweless”在现代英语中非常少见，很多情况下会被认为不自然或像拼写错误。你更常会看到/用到：","更地道的表达通常是：“uninspiring / unremarkable / underwhelming / ordinary / not awe-inspiring”。例如：The view was underwhelming.（景色有点让人失望/不够震撼。）","如果你本来想表达“很棒、很厉害”，最可能想写的是“awesome”（了不起的；很棒的）。"]}
{"word":"awelessness","summary":{"en":"Awelessness means a lack of awe—no feeling of deep wonder or respect.","zh":"Awelessness 指“缺乏敬畏/惊叹之情”，即没有深深的惊奇或尊敬感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of not feeling awe (deep respect, wonder, or amazement); a lack of awe.","zh":"缺乏敬畏、惊叹或赞叹的状态；没有“敬畏感”。"},"examples":[{"en":"His awelessness in the cathedral surprised his friends.","zh":"他在大教堂里毫无敬畏感，这让朋友们很惊讶。"},{"en":"Some people show awelessness toward nature because they spend little time outdoors.","zh":"有些人对大自然缺乏敬畏感，因为他们很少在户外待着。"}]}],"synonyms":["lack of awe","absence of awe","indifference","unimpressed attitude"],"phonetic":"ˈɔləsnəs","extraExplanation":["“awelessness”非常少见，在日常英语里几乎不用；更自然的说法是“a lack of awe”“absence of awe”“no sense of awe”。","它是由“aweless（没有敬畏的）+ -ness（名词后缀）”构成的“自造式/派生式”名词，语法上说得通，但不常见。","如果你原本想表达“很棒、很厉害的程度”，常见词是“awesomeness（棒极了/厉害）”，不是“awelessness”。"]}
{"word":"Awellimiden","summary":{"en":"“Awellimiden” isn’t recognized as a common English word; it’s likely a misspelling or a name.","zh":"“Awellimiden” 不是常见英语单词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It looks like a misspelling or a name/username.","zh":"不是标准英语单词。看起来像拼写错误，或是人名/用户名。"},"examples":[{"en":"I can’t find “Awellimiden” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里找不到 “Awellimiden”——你能把它出现的句子发给我吗？"}]}],"extraExplanation":["如果你是在输入一个短语，可能想写的是：\n- a well-limited（限制得当的）\n- a well-minded（想法良善的，但不常用）\n- a well-aimed（瞄得很准的）\n- well-imagined（构思得很好的）\n请把上下文句子或你想表达的中文意思发我，我可以帮你确认最准确的词/短语，并给出正确发音与用法。"]}
{"word":"awellimiden","summary":{"en":"“awellimiden” isn’t a recognized English word; it’s likely a misspelling of “well-meaning” or “well-intentioned.”","zh":"“awellimiden” 不是标准英语词；很可能是 “well-meaning” 或 “well-intentioned” 的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a typed-together phrase. Common intended words/phrases include “well-meaning” or “well-intentioned.”","zh":"这不是一个标准英语单词。可能是拼写错误或把多个词连在一起了。常见的可能目标词/短语是 “well-meaning”（出于好意的）或 “well-intentioned”（本意良好的）。"},"examples":[{"en":"I can’t find “awellimiden” in a dictionary—did you mean “well-meaning”?","zh":"我在词典里找不到 “awellimiden”——你是不是想写 “well-meaning”？"},{"en":"She made a well-meaning comment, but it still hurt his feelings.","zh":"她的评论是出于好意的，但还是伤到了他的感受。"},{"en":"He’s well-intentioned, but his advice isn’t always helpful.","zh":"他本意良好，但他的建议不一定总有帮助。"}]}],"synonyms":["well-meaning","well-intentioned","kindly","benevolent"],"extraExplanation":["如果你愿意，请把你想表达的整句话发出来，或告诉我这个词出现的语境（聊天、歌词、文章等）。我可以帮你判断最可能的正确拼写与含义。","常见的相关表达：well-meaning（出于好意的）、well-intentioned（本意良好的）、with good intentions（出于好意）。"]}
{"word":"Awendaw","summary":{"en":"Awendaw is a town name in South Carolina, USA.","zh":"Awendaw 是美国南卡罗来纳州的一个城镇名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A small town in Charleston County, South Carolina, USA (in the Lowcountry region, northeast of Charleston).","zh":"美国南卡罗来纳州查尔斯顿县的一个小镇（位于“低地地区”，在查尔斯顿东北方向）。"},"examples":[{"en":"We drove through Awendaw on the way to the Francis Marion National Forest.","zh":"我们去弗朗西斯·马里昂国家森林的路上经过了阿温多（Awendaw）。"},{"en":"Awendaw is a quiet place with access to beaches and nature trails nearby.","zh":"阿温多（Awendaw）很安静，附近有海滩和自然步道。"}]}],"synonyms":["Awendaw, South Carolina","Awendaw (SC)"],"phonetic":"/əˈwɛn.dɔː/","extraExplanation":["“Awendaw”是地名（专有名词），日常写作中通常不加冠词：说“in Awendaw / near Awendaw”，不说“in the Awendaw”。","读音在当地可能有细微差异；学习时把重音放在第二音节（-WEN-）更自然。","该地名一般被认为与当地原住民语言/地名传统有关，但具体词源在公开资料中常有不同说法；使用时可尊重其作为历史地名的文化背景。"]}
{"word":"awes","summary":{"en":"“Awes” is informal slang for “awesome.”","zh":"“awes”是“awesome”的非正式缩写（俚语），意思是“很棒/太赞了”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Short for “awesome”; used to say something is very good, impressive, or exciting.","zh":"（非正式）“awesome”的缩写；表示某事很棒、很厉害、很令人兴奋。"},"examples":[{"en":"That concert was awes!","zh":"那场演唱会太棒了！"},{"en":"You got the job? Awes—congrats!","zh":"你拿到那份工作了？太棒了——恭喜！"},{"en":"Thanks for the help—you're awes.","zh":"谢谢你的帮忙——你真厉害。"}]}],"synonyms":["awesome","great","amazing","fantastic","excellent","cool"],"phonetic":"/ɔz/","extraExplanation":["“awes”多见于口语、短信、聊天或社交媒体，是非常随意的表达。正式写作、邮件或面试中建议用“awesome / great / excellent”。","有时也会写成“awes!”作为感叹用法，语气更像“太赞了！”","注意别与“awe”（敬畏、惊叹）混淆；“awe”是名词/动词，语气更偏“震撼、敬畏”。"]}
{"word":"Awesome","summary":{"en":"“Awesome” commonly means “very great/impressive” or, in a more formal sense, “inspiring awe.” It’s also used as an excited response: “Awesome!”","zh":"“Awesome”常指“非常棒/很厉害”，更正式时可指“令人敬畏”。也可作感叹用语：“太棒了！”"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Used to show strong approval, excitement, or admiration (common in casual spoken and written English).","zh":"用于表达强烈的赞同、兴奋或钦佩（常见于口语和非正式书面语）。"},"examples":[{"en":"Awesome! Thanks for your help.","zh":"太棒了！谢谢你的帮助。"},{"en":"That movie was awesome.","zh":"那部电影太精彩了。"},{"en":"Awesome—let’s get started.","zh":"太好了——我们开始吧。"}]},{"partOfSpeech":"adj.","definition":{"en":"Very impressive or extremely good; great.","zh":"令人印象深刻的；非常好的；很棒的。"},"examples":[{"en":"She did an awesome job on the presentation.","zh":"她的演讲做得非常出色。"},{"en":"You have an awesome idea.","zh":"你这个主意太棒了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Causing awe; inspiring wonder or respectful fear (more formal/literary).","zh":"令人敬畏的；引起惊叹或肃然起敬的（更正式/文学用法）。"},"examples":[{"en":"The view from the mountain was truly awesome.","zh":"山顶的景色确实令人敬畏。"},{"en":"We felt an awesome silence in the old cathedral.","zh":"在古老的大教堂里，我们感到一种令人肃然的寂静。"}]},{"partOfSpeech":"int.","definition":{"en":"An exclamation meaning “Great!” or “Nice!”","zh":"感叹词，表示“太好了！”“真棒！”"},"examples":[{"en":"Awesome! You passed the test.","zh":"太棒了！你考试通过了。"},{"en":"Awesome—see you tomorrow.","zh":"太好了——明天见。"}]}],"synonyms":["great","excellent","amazing","fantastic","impressive","wonderful"],"phonetic":"/ˈɔsəm/","extraExplanation":["“awesome”原本更接近“令人敬畏的”（来自“awe=敬畏、惊叹”），带一点庄重甚至“令人害怕的宏大感”。现代美式英语里，它常被口语化成“很棒、超赞”。","语气与场合：在正式写作或商务邮件里，通常用“great / excellent / impressive”更稳妥；“awesome”更偏轻松、友好。"]}
{"word":"awesome","summary":{"en":"Awesome means “really great” in daily English, and more formally it can mean “awe-inspiring; causing wonder and respect.”","zh":"Awesome 在日常英语里多指“很棒、非常好”；在更正式语境中也可指“令人敬畏、震撼人心的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Extremely good, impressive, or enjoyable (common in everyday speech).","zh":"非常好、令人印象深刻或很棒（口语中最常见的意思）。"},"examples":[{"en":"That movie was awesome—I want to watch it again.","zh":"那部电影太棒了——我还想再看一遍。"},{"en":"You did an awesome job on your presentation.","zh":"你的展示做得太棒了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Causing awe; inspiring wonder or respect, sometimes a little fear (more formal/literary).","zh":"令人敬畏的；让人惊叹甚至带点畏惧（更正式/文学用法）。"},"examples":[{"en":"The night sky in the desert is truly awesome.","zh":"沙漠里的夜空真的令人敬畏。"},{"en":"They stood in awesome silence before the huge waterfall.","zh":"他们站在巨大的瀑布前，敬畏地沉默着。"}]}],"synonyms":["great","excellent","amazing","wonderful","fantastic","impressive","incredible","awe-inspiring"],"phonetic":"/ˈɔsəm/","extraExplanation":["“awesome”最初更偏“令人敬畏/震撼”的正式含义（与“awe=敬畏、惊叹”相关）。在现代日常英语中，它经常“语义弱化”，变成泛指“很棒、很好”。在正式写作里，如果你只是想表达“很好”，可考虑用更具体的词（如 excellent, impressive, great）来显得更精准。"]}
{"word":"awesomely","summary":{"en":"“Awesomely” means “in a very impressive/excellent way,” and informally it can also mean “very/extremely.”","zh":"“Awesomely”表示“非常出色/令人惊叹地”，口语中也可作强调，表示“非常/极其”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a very impressive, exciting, or excellent way.","zh":"以非常棒、令人兴奋或出色的方式。"},"examples":[{"en":"You did awesomely on the test.","zh":"你这次考试考得太棒了。"},{"en":"The band played awesomely tonight.","zh":"乐队今晚演出得非常精彩。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Informal) Very; extremely (used to emphasize a description).","zh":"（非正式）非常；极其（用于强调）。"},"examples":[{"en":"That movie was awesomely funny.","zh":"那部电影好笑极了。"},{"en":"We had an awesomely good time at the beach.","zh":"我们在海边玩得特别开心。"}]}],"synonyms":["excellently","impressively","amazingly","remarkably","extremely"],"phonetic":"/ˈɔsəmli/","extraExplanation":["“awesomely”来自形容词“awesome”（很棒的/令人敬畏的）加副词后缀“-ly”。现代口语里，“awesome”更多表示“很棒”，而较传统/较正式的“awe”含义更接近“敬畏、震撼”。因此在不同语境下，“awesomely”既可表示“精彩极了”，也可能带一点“震撼、令人敬畏”的感觉。","在正式写作中，人们更常用“extremely / remarkably / exceptionally”来替代“awesomely”，因为“awesomely”偏口语、偏随意。"]}
{"word":"awesomeness","summary":{"en":"Awesomeness means the quality of being extremely impressive or excellent; it’s often used informally to praise something as “very cool.”","zh":"Awesomeness 指“非常令人惊叹/很棒”的特质；常用于口语中夸赞某事“太酷/太赞了”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being extremely impressive, enjoyable, or inspiring; greatness","zh":"令人惊叹、非常棒的特质；卓越、了不起"},"examples":[{"en":"The awesomeness of the sunset made everyone stop and stare.","zh":"那场日落的震撼之美让大家都停下来注视。"},{"en":"I love the awesomeness of this song—it always lifts my mood.","zh":"我喜欢这首歌的超棒感觉——它总能让我心情变好。"},{"en":"Her awesomeness isn’t just talent; it’s also her kindness.","zh":"她的“了不起”不只是才华，还有她的善良。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a fun, enthusiastic way to say that something is very cool or excellent","zh":"（非正式）用来表达“太酷了/太棒了”的说法"},"examples":[{"en":"The new café is pure awesomeness.","zh":"这家新咖啡馆简直太赞了。"},{"en":"Thanks for your help—you’re awesomeness!","zh":"谢谢你的帮忙——你太给力了！（口语）"}]}],"synonyms":["greatness","excellence","impressiveness","coolness","wonder"],"phonetic":"/ˈɔsəm.nəs/","extraExplanation":["“awesomeness”来自形容词“awesome”（令人敬畏的、极好的）+名词后缀“-ness”（表示“……的状态/特质”）。","传统上“awe”与“敬畏、震撼”有关，所以在较正式或更文学的语境里，“awesome/awesomeness”可能带有“宏大到让人敬畏”的感觉；现代口语里更常表示“很棒、很酷”。","注意语域：正式写作中更常用“excellence, greatness, impressiveness”等替代；“awesomeness”更偏口语、网络表达。"]}
{"word":"awest","summary":{"en":"Awst means “toward the west,” and more rarely “western.” It is a literary or old-fashioned word.","zh":"awest 表示“向西”，较少见时也可表示“西面的”。它多见于文学或较旧的用法。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"toward the west; in a westerly direction","zh":"向西；朝西方"},"examples":[{"en":"The clouds drifted awest as the wind changed.","zh":"风向改变后，云向西飘去。"},{"en":"We watched the sun sink awest beyond the hills.","zh":"我们看着太阳在群山那边向西落下。"}]},{"partOfSpeech":"adj.","definition":{"en":"situated in the west; western (rare/old-fashioned)","zh":"位于西方的；西面的（较少见/较旧用法）"},"examples":[{"en":"An awest ridge blocked the view of the sea.","zh":"西面的山脊挡住了海景。"},{"en":"They traveled through the awest counties in early spring.","zh":"他们在初春穿行于西部的郡县。"}]}],"synonyms":["westward","to the west","westwards","western (adj., rare sense)"],"phonetic":"/əˈwɛst/","extraExplanation":["“awest”较少见，带有文学/古风色彩，常见于诗歌、航海或叙事描写中，用来替代更常用的“westward / to the west”。","构词上可理解为 a-（表示“处于……中/朝向……”的古英语或方言前缀，如 asleep, aboard）+ west（西）。"]}
{"word":"awestricken","summary":{"en":"Awestricken means extremely filled with awe—deep wonder and respect, sometimes mixed with fear.","zh":"awestricken 表示“被强烈的敬畏感震撼”，常含惊叹与肃然起敬，偶尔夹杂些害怕。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Filled with sudden and often overwhelming awe (a strong feeling of wonder, respect, or fear) at something impressive or frightening.","zh":"因敬畏（强烈的惊叹、尊敬或带点害怕）而震撼的；目瞪口呆的。"},"examples":[{"en":"We stood awestricken as the rocket lifted off into the night sky.","zh":"火箭升空冲向夜空时，我们敬畏得说不出话来。"},{"en":"She was awestricken by the size of the ancient temple.","zh":"那座古老寺庙的宏伟让她震撼不已。"},{"en":"The audience fell silent, awestricken, after the powerful speech.","zh":"那段有力的演讲结束后，观众安静下来，满是震撼与敬畏。"}]}],"synonyms":["awe-struck","in awe","overawed","astonished","speechless"],"phonetic":"/ˈɔˌstrɪkən/","extraExplanation":["词形上是由“awe（敬畏）+ stricken（被击中的/被打动的）”组成，语感上比“amazed（惊讶）”更庄重、更强烈，常带一点点恐惧或肃然起敬。","常见搭配：be awestricken by/at sth（被……震撼）。也可见拼写变体：awe-stricken（带连字符）。"]}
{"word":"awestrike","summary":{"en":"“Awestrike” means to overwhelm someone with awe; the adjective form is usually written “awestruck.”","zh":"“awestrike”指使人心生敬畏、深受震撼；其形容词形式通常写作“awestruck”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to fill someone with awe (a strong feeling of wonder, respect, or amazement); to impress or overwhelm deeply","zh":"使某人心生敬畏（强烈的惊叹、尊敬或震撼）；深深震撼、令人大为折服"},"examples":[{"en":"The vast night sky awestruck the hikers into silence.","zh":"浩瀚的夜空让徒步者们心生敬畏，安静了下来。"},{"en":"Her performance awestruck the audience with its power and grace.","zh":"她的表演以力量与优雅震撼了观众。"},{"en":"He was awestruck by the ancient temple’s scale.","zh":"他被那座古老寺庙的宏伟规模所震撼。"}]},{"partOfSpeech":"adj.","definition":{"en":"deeply impressed or overwhelmed with awe (often used as an adjective, more commonly written as “awestruck”)","zh":"（形容词用法）感到敬畏的、目瞪口呆的（更常写作“awestruck”）"},"examples":[{"en":"She stood awestruck in front of the waterfall.","zh":"她站在瀑布前，惊叹得说不出话。"},{"en":"The children were awestruck when the rockets launched.","zh":"火箭发射时，孩子们震撼得目不转睛。"}]}],"synonyms":["awe","astonish","amaze","stun","overwhelm","leave someone speechless"],"phonetic":"/ˈɔːstraɪk/","extraExplanation":["“awestrike/awestruck”由“awe（敬畏、惊叹）+ strike（击中、震撼）”构成，语感上带有“被震撼击中”的画面感。","现代英语里更常见的是形容词“awestruck”，以及动词短语“to fill someone with awe / to leave someone awestruck”。“awestrike”作为动词较少见，写作时可用更常见的表达以更自然。"]}
{"word":"awestruck","summary":{"en":"Awestruck means extremely impressed and full of wonder (often with respect or slight fear).","zh":"Awestruck 指因惊奇与敬畏而非常震撼、惊叹的状态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Filled with wonder and amazement, often mixed with a little fear or deep respect; extremely impressed.","zh":"（因惊奇、敬畏而）目瞪口呆的；惊叹不已的；充满敬畏的。"},"examples":[{"en":"The children were awestruck by the fireworks.","zh":"孩子们被烟花震撼得目瞪口呆。"},{"en":"I stood awestruck in front of the Grand Canyon.","zh":"我站在大峡谷前，惊叹不已。"},{"en":"The audience fell silent, awestruck by her voice.","zh":"观众安静下来，被她的嗓音深深震撼。"}]}],"synonyms":["amazed","astonished","spellbound","in awe","wonderstruck","stunned"],"phonetic":"/ˈɔːstrʌk/","extraExplanation":["“awe”指“敬畏/惊叹”，常见于宏大、神圣、壮丽或极其出色的事物带来的强烈感受；“awestruck”字面像“被敬畏击中”，强调当下被震住的状态。","常见搭配：be/stand/sit awestruck；look awestruck；awestruck silence（震撼的沉默）。也常与by/at连用：awestruck by/at something。"]}
{"word":"aweto","summary":{"en":"“aweto” is not a recognized English word; it’s likely a misspelling or a name.","zh":"“aweto”不是常见英文词汇；更可能是拼写错误或专有名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a name/username.","zh":"不是标准英文单词，可能是拼写错误，或是人名／用户名。"},"examples":[{"en":"I couldn’t find “aweto” in an English dictionary—did you mean “awe” or “toward”?","zh":"我在英文词典里找不到“aweto”——你是想写“awe（敬畏）”还是“toward（朝向）”吗？"},{"en":"Please share a full sentence with “aweto” so I can guess the intended meaning.","zh":"请给我一个包含“aweto”的完整句子，我才能更准确判断你想表达的意思。"}]}],"extraExplanation":["“aweto”看起来像是拼写合并或打字错误。常见的接近形式可能包括：\n- awe /ɔ/：名词，表示“敬畏、惊叹”。\n- a way to：短语，表示“一个……的方法/途径”。（比如：a way to learn English）\n- toward /təˈwɔrd/：介词，“朝向；对于”。\n\n把你看到它的上下文（句子/段落）发来，我可以帮你确定最可能的词，并给出正确用法与例句。"]}
{"word":"awfu","summary":{"en":"“awfu” is a misspelling; the correct word is “awful,” meaning very bad or very unpleasant.","zh":"“awfu”是拼写错误；正确单词是“awful”，意思是“非常糟糕/非常不舒服”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A common misspelling of “awful.”","zh":"“awful”的常见拼写错误。"},"examples":[{"en":"I think you meant “awful”: The weather was awful today.","zh":"你可能想写“awful”：今天天气很糟糕。"},{"en":"Correct spelling: awful, not awfu.","zh":"正确拼写：awful，不是awfu。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Correct word: “awful”) Very bad; unpleasant; causing strong dislike.","zh":"（正确单词：awful）非常糟糕的；令人不快的；让人很反感的。"},"examples":[{"en":"That was an awful movie.","zh":"那是一部很糟糕的电影。"},{"en":"I feel awful after eating too much.","zh":"我吃太多之后感觉很难受。"},{"en":"There was an awful smell in the room.","zh":"房间里有一股很难闻的气味。"}]}],"synonyms":["terrible","horrible","bad","dreadful","lousy"],"phonetic":"/ˈɔfəl/","extraExplanation":["“awful”在较老或较正式的用法里也可表示“令人敬畏的、庄严可怖的”（接近 awe-inspiring），但现代口语中最常见的是“很糟糕/很难受”。"]}
{"word":"Awful","summary":{"en":"“Awful” most commonly means very bad or unpleasant; it can also mean extremely serious or shocking.","zh":"“Awful”最常表示“非常糟糕/令人不快”，也可表示“严重得令人震惊/可怕”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Very bad or unpleasant; of extremely poor quality.","zh":"非常糟糕的；令人不愉快的；质量极差的。"},"examples":[{"en":"The food was awful, so we left early.","zh":"食物太难吃了，所以我们早早离开了。"},{"en":"I had an awful headache all day.","zh":"我头痛得厉害，一整天都不舒服。"},{"en":"That was an awful mistake to make.","zh":"那是个非常糟糕的错误。"}]},{"partOfSpeech":"adj.","definition":{"en":"Extremely serious or shocking; causing fear or strong negative feelings.","zh":"严重得令人震惊的；可怕的；让人害怕或反感的。"},"examples":[{"en":"They heard the awful news that the flight was canceled.","zh":"他们听到航班取消的糟糕消息。"},{"en":"The movie shows the awful reality of war.","zh":"这部电影展现了战争可怕的现实。"}]}],"synonyms":["terrible","horrible","dreadful","very bad"],"phonetic":"/ˈɔfəl/","extraExplanation":["“awful”原意与“awe（敬畏）”有关，早期有“令人敬畏的、庄严的”之意；现代英语里更常用作“糟糕的、可怕的”。在口语中也常用来加强语气，比如“awfully tired（累极了）”，但这种用法通常出现在“awfully + 形容词/副词”的结构里。"]}
{"word":"awful","summary":{"en":"Awful usually means “very bad/unpleasant” or “very serious.” Informally, it can also mean “very/really” to emphasize an adjective.","zh":"Awful 通常表示“非常糟糕/令人不快”或“非常严重”。在非正式口语中也可作副词，表示“非常/很”用于强调。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Very bad or unpleasant; causing strong dislike or discomfort.","zh":"非常糟糕的；令人不快的；让人强烈反感或不舒服的。"},"examples":[{"en":"The food tasted awful, so we didn’t finish it.","zh":"食物尝起来很难吃，所以我们没吃完。"},{"en":"I had an awful day at work.","zh":"我工作上过了糟糕的一天。"},{"en":"There was an awful smell in the room.","zh":"房间里有一股难闻的气味。"}]},{"partOfSpeech":"adj.","definition":{"en":"Very serious or severe; extremely unpleasant in degree.","zh":"严重的；可怕的（程度很强）。"},"examples":[{"en":"She had an awful headache all morning.","zh":"她整个上午头疼得厉害。"},{"en":"The storm caused awful damage to the town.","zh":"暴风雨给小镇造成了严重破坏。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Informal) Extremely; very (used to emphasize).","zh":"（非正式）非常；很（用于加强语气）。"},"examples":[{"en":"I’m awful tired today.","zh":"我今天累得要命。"},{"en":"That movie was awful funny.","zh":"那部电影特别好笑。"}]}],"synonyms":["terrible","horrible","bad","dreadful","unpleasant"],"phonetic":"/ˈɔfəl/","extraExplanation":["“awful” 原本与 “awe”（敬畏）有关，早期可表示“令人敬畏的、庄严可畏的”。现代英语中多为负面含义（“糟糕的、可怕的”），但在口语里也会用作强调语气（awful + adj.），含义接近 “really/very”。","注意与 “terrible / horrible / bad” 的语气差别：日常聊天里 “awful” 常用于主观体验（味道、天气、一天过得怎样），语气比 “bad” 强，但通常不如描述灾难时的 “horrible” 那么沉重。"]}
{"word":"awfuller","summary":{"en":"“Awfuller” is a nonstandard way to say “more awful.” Prefer “more awful” in standard English.","zh":"“awfuller”是“more awful（更糟糕）”的非标准说法；标准英语更常用“more awful”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Nonstandard comparative form of “awful,” meaning “more awful” (more very bad, unpleasant, or of poor quality). In modern English, people usually say “more awful,” not “awfuller.”","zh":"“awful（糟糕的、非常不好的）”的非标准比较级，意思是“更糟糕、更糟”。现代英语通常说“more awful”，而不是“awfuller”。"},"examples":[{"en":"This version is more awful than the last one.","zh":"这个版本比上一个更糟糕。"},{"en":"(Nonstandard) The weather today is awfuller than yesterday.","zh":"（非标准）今天的天气比昨天更糟。"}]}],"synonyms":["more awful","worse (in many contexts)","more terrible"],"phonetic":"/ˈɔfələr/","extraExplanation":["“awfuller”在当代标准英语里很少见，常被视为口语化、方言化或带有“故意夸张/孩子气”的表达。写作或正式场合建议用“more awful”。\n比较级用法：短词常加 -er（taller），但“awful”通常不用“awfuller”，而用“more + 形容词”的结构（more awful）。"]}
{"word":"awfullest","summary":{"en":"“Awfullest” means “the most awful,” usually “the worst/most unpleasant.” It’s uncommon; in formal writing, “worst” or “most awful” is more typical.","zh":"“awfullest”表示“最糟糕的/最令人不快的”。较少见；正式写作更常用“worst”或“most awful”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Superlative of “awful”) the most awful—very bad, unpleasant, or of the lowest quality.","zh":"（“awful”的最高级）最糟糕的、最令人不快的；质量最差的。"},"examples":[{"en":"That was the awfullest movie I’ve ever seen.","zh":"那是我看过最糟糕的一部电影。"},{"en":"This is the awfullest day of my week.","zh":"这是我这周最糟糕的一天。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) the most awe-inspiring or solemn; extremely impressive in a serious way.","zh":"（较少见）最令人敬畏的、最庄严的；以严肃方式令人震撼的。"},"examples":[{"en":"In older writing, people sometimes spoke of the awfullest power of nature.","zh":"在较早的写作里，人们有时会说到大自然最令人敬畏的力量。"}]}],"synonyms":["worst","most awful","terrible","horrible"],"phonetic":"/ˈɔfəlɪst/","extraExplanation":["“awfullest”在现代英语里不太常见；更常见的拼写是“awfulest”（两个都可理解，但很多写作场合会避免用这种最高级形式）。","在正式写作中，人们通常用“worst”或“most awful”来代替：e.g., “the worst day” / “the most awful day”。","“awful”历史上曾更接近“awe-full”（充满敬畏、庄严）的意思，但现代口语里更常用来表示“很糟糕/很差”。"]}
{"word":"Awfully","summary":{"en":"Awfully means “very/extremely” (often informal emphasis) or “in a very bad way.”","zh":"Awfully 表示“非常/极其”（常作强调）或“糟糕地/可怕地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Very; extremely (used to emphasize an adjective or adverb, often in informal speech).","zh":"非常；极其（用于强调形容词或副词，口语中常见）。"},"examples":[{"en":"I’m awfully sorry I’m late.","zh":"我非常抱歉我迟到了。"},{"en":"That’s awfully kind of you.","zh":"你真是太好了。"},{"en":"It’s awfully cold today.","zh":"今天冷得厉害。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a very bad, unpleasant, or shocking way.","zh":"很糟糕地；令人不快地；可怕地。"},"examples":[{"en":"The whole plan went awfully wrong.","zh":"整个计划糟糕透了。"},{"en":"The child was treated awfully at the old school.","zh":"那个孩子在原来的学校被对待得很不好。"}]}],"synonyms":["very","extremely","really","terribly","badly"],"phonetic":"/ˈɔfli/","extraExplanation":["“Awfully”原本和“awful（可怕的）”有关，所以即使作加强语气（=very）时，常带一点“过分/厉害得不太妙”的色彩。但在固定表达如“awfully sorry / awfully kind”里，这种负面感觉会变弱，更多是礼貌、委婉的强调。","语体上略偏英式、稍带旧式礼貌感（尤其在“awfully sorry”这类表达中）。在更中性、现代的口语里，也常用“really / very / so”来替换。"]}
{"word":"awfully","summary":{"en":"“Awfully” usually means “very/extremely,” and sometimes means “badly/in an unpleasant way.”","zh":"“awfully”通常表示“非常/极其”，有时也表示“糟糕地/令人不快地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Very; extremely (used to emphasize an adjective or adverb, often in a slightly informal tone).","zh":"非常；极其（用来强调形容词或副词，语气常略口语化）。"},"examples":[{"en":"I’m awfully sorry I’m late.","zh":"我非常抱歉我迟到了。"},{"en":"It’s awfully cold today.","zh":"今天冷得要命/非常冷。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a bad, unpleasant, or worrying way.","zh":"糟糕地；令人不快/令人担忧地。"},"examples":[{"en":"The accident was handled awfully by the company.","zh":"公司对这起事故处理得很糟糕。"},{"en":"She felt awfully after hearing the news.","zh":"听到这个消息后，她感觉很难受/很不好。"}]}],"synonyms":["very","extremely","really","terribly","badly"],"phonetic":"/ˈɔfəli/","extraExplanation":["“awfully”最初与“awful（可怕的）”相关，所以它既可以表示“糟糕地”，也常被用作强调副词表示“非常”。在现代英语里，“I’m awfully sorry”通常只是礼貌且强烈的道歉，并不表示“可怕地抱歉”。","语体提示：在英式英语里，“awfully”作“非常”更常见、更自然一些；美式英语中也会用，但“really/very/so”更日常。正式写作中避免过度使用，以免显得主观或夸张。"]}
{"word":"Awfulness","summary":{"en":"Awfulness means extreme badness or something very unpleasant/horrible.","zh":"Awfulness 指“极度糟糕/令人不快/可怕”，也可指“糟糕透顶的事物或处境”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being very bad, unpleasant, or horrible; extreme unpleasantness.","zh":"非常糟糕、令人不快或可怕的性质；极度的糟糕/不适。"},"examples":[{"en":"Everyone agreed on the awfulness of the weather during the storm.","zh":"大家都同意暴风雨期间的天气非常糟糕。"},{"en":"He couldn’t forget the awfulness of the accident.","zh":"他忘不了那场事故的可怕之处。"}]},{"partOfSpeech":"n.","definition":{"en":"A very bad thing or situation; something horrible.","zh":"非常糟糕的事物或处境；可怕的东西。"},"examples":[{"en":"The movie was full of violence and other awfulness.","zh":"这部电影充满暴力和其他令人不适的东西。"},{"en":"She tried to find something positive in the middle of all the awfulness.","zh":"在一片糟糕之中，她努力寻找积极的东西。"}]}],"synonyms":["horror","terribleness","horribleness","dreadfulness","badness","misery"],"phonetic":"/ˈɔf(ə)lnəs/","extraExplanation":["“awfulness”来自形容词“awful”（可怕的、糟糕的）+ 名词后缀“-ness”（表示“……的性质/状态”）。\n注意：在口语里“awful”有时也被用来表示“非常、极其”（如“awfully nice”=“非常好”），但“awfulness”通常仍保留负面含义。"]}
{"word":"awfulness","summary":{"en":"Awfulness means the state or degree of being extremely bad or very unpleasant.","zh":"Awfulness 指“极其糟糕/非常令人不快”的状态或程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being extremely bad, unpleasant, or unacceptable.","zh":"极糟糕；非常令人不快；不可接受的程度。"},"examples":[{"en":"I was shocked by the awfulness of the food.","zh":"我被那食物的难吃程度震惊了。"},{"en":"She couldn’t believe the awfulness of the situation.","zh":"她不敢相信情况竟然糟糕到这种地步。"}]},{"partOfSpeech":"n.","definition":{"en":"Great unpleasantness or seriousness of something (often used to express strong emotion).","zh":"（常用于强调情绪）令人难受的严重性；可怕程度。"},"examples":[{"en":"He tried to laugh, but the awfulness of the news made it impossible.","zh":"他想笑一笑，但消息的可怕程度让他做不到。"},{"en":"The book shows the awfulness of war in everyday life.","zh":"这本书展现了战争在日常生活中的可怕与残酷。"}]}],"synonyms":["badness","terribleness","horribleness","dreadfulness","atrocity"],"phonetic":"/ˈɔf(ə)lnəs/","extraExplanation":["“awfulness”来自形容词“awful”。现代英语里“awful”多表示“很糟/很可怕”，因此“awfulness”常指“糟糕的程度”。注意在较早或更正式的用法中，“awful”也可能含有“令人敬畏的（awe-inspiring）”之意，但“awfulness”在当代通常不表示“庄严/令人敬畏”，而是偏负面。","语气上，“awfulness”较口语且带强烈情绪，日常表达也常用“how awful it is/was”或“the terrible nature of …”来替换，以显得更自然或更正式。"]}
{"word":"AWG","summary":{"en":"AWG most commonly means American Wire Gauge, a standard for wire thickness.","zh":"AWG 最常指美国线规（American Wire Gauge），用于表示电线粗细的标准。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"American Wire Gauge: a standard system used (mainly in the U.S. and Canada) to describe the thickness (diameter) of electrical wire.","zh":"美国线规：一种主要在美国和加拿大使用的标准，用来表示电线的粗细（直径）。"},"examples":[{"en":"For a long cable run, you may need a thicker wire, like 12 AWG.","zh":"如果电缆距离很长，你可能需要更粗的线，比如 12 AWG。"},{"en":"This lamp cord is 18 AWG, which is common for light-duty use.","zh":"这条台灯电源线是 18 AWG，常用于轻负载场景。"},{"en":"Check the AWG rating before connecting the wire to a high-current device.","zh":"把电线接到大电流设备之前，先检查它的 AWG 规格。"}]}],"synonyms":["wire gauge","gauge"],"phonetic":"/ˌeɪdʌbəlˈjuːˌdʒiː/","extraExplanation":["AWG 是“线径/线规”体系：数字越小，电线越粗、通常可承载的电流越大；数字越大，电线越细。","很多产品会同时写 AWG 和截面积（如 mm²）。在非北美地区，工程上更常直接用 mm² 表示线的截面积。"]}
{"word":"awhape","summary":{"en":"“awhape” isn’t a standard English word; it’s probably a typo (often something like “a shape,” “shape,” or “reshape”).","zh":"“awhape”不是标准英语单词；很可能是拼写/打字错误（常见可能是“a shape / shape / reshape”等）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a typo, so its meaning depends on what you intended to write.","zh":"不是标准英语单词。很可能是拼写错误/打字错误，具体含义取决于你原本想写的词。"},"examples":[{"en":"I can’t find “awhape” in a dictionary—did you mean “a shape” or “reshape”?","zh":"我在词典里找不到“awhape”——你是不是想写“a shape（一个形状）”或“reshape（重塑/改造）”？"},{"en":"Could you show the full sentence with “awhape” so I can guess the correct word?","zh":"你能把包含“awhape”的完整句子发我吗？这样我可以帮你判断正确的词。"}]}],"phonetic":"/əˈweɪp/","extraExplanation":["“awhape”看起来像把两个词连在一起或字母顺序/按键出错。常见可能：\n1) a shape（一个形状）\n2) shape（形状；塑造）\n3) reshape（重塑；改造）\n4) whap（拟声词/动词：猛击；啪的一声）\n把你想表达的中文意思或原句发来，我可以帮你准确匹配并给出用法。"]}
{"word":"awheel","summary":{"en":"Awheel means “on wheels,” “with wheels,” or “rolling/moving on wheels.”","zh":"Awheel 表示“在轮子上 / 带轮子的 / 在轮子上滚动前进的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a vehicle or object) having wheels; fitted with wheels.","zh":"（车辆或物体）有轮子的；装有轮子的。"},"examples":[{"en":"The library now has awheel carts to move heavy books easily.","zh":"图书馆现在有带轮子的推车，方便搬运沉重的书。"},{"en":"They converted the old table into an awheel serving cart.","zh":"他们把旧桌子改造成一辆带轮子的餐车。"}]},{"partOfSpeech":"adv.","definition":{"en":"moving or ready to move on wheels; rolling along.","zh":"在轮子上移动的；滚动前进的。"},"examples":[{"en":"With the suitcase awheel, traveling became much easier.","zh":"有了带轮子的行李箱，旅行轻松多了。"},{"en":"The toy car went awheel across the floor.","zh":"玩具车在地板上滚着跑。"}]}],"synonyms":["on wheels","wheeled","rolling"],"phonetic":"/əˈwiːl/","extraExplanation":["“awheel”由前缀 a-（表示“处于……状态/在……”）+ wheel 组成，意思就是“在轮子上/有轮子的”。在现代英语里它不算常用，更常见的说法是 on wheels、wheeled（形容词）等。","有时会出现在较文学或较旧的用法中，强调“滚动着前进”的画面感。"]}
{"word":"awheft","summary":{"en":"A Scots dialect word meaning “askew” or “to one side.”","zh":"一个苏格兰方言词，意思是“歪斜的/偏向一边的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Scots/dialect) Not straight; slanting or sideways; askew.","zh":"（苏格兰方言）不直的；倾斜的；歪斜的。"},"examples":[{"en":"The picture on the wall was hanging awheft.","zh":"墙上的画挂歪了。"},{"en":"His hat sat awheft after the strong wind.","zh":"大风过后，他的帽子戴得歪歪斜斜的。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Scots/dialect) In a slanting way; to one side; not straight.","zh":"（苏格兰方言）歪着；斜着；偏向一边地。"},"examples":[{"en":"The door swung awheft and wouldn’t close properly.","zh":"门斜着摆动，关不严。"},{"en":"She smiled awheft, as if unsure what to say.","zh":"她歪着嘴笑了笑，好像不太确定该说什么。"}]}],"synonyms":["askew","crooked","slanted","tilted","awry"],"phonetic":"/əˈwɛft/","extraExplanation":["“awheft”多见于苏格兰英语（Scots）或受其影响的方言写法，在标准英语里更常用 askew / crooked / slanted 来表达“歪、斜”。","在文学或地方口语中，它常用来描写物体“挂歪了/摆歪了”，也可引申形容表情或姿态“不太正、不太对劲”。"]}
{"word":"awhet","summary":{"en":"Awhet is an old-fashioned word meaning “keen or stimulated,” especially of curiosity or appetite.","zh":"Awhet 是较古老的用法，意思是“被激起的、渴望的”，常指好奇心或食欲被勾起。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic/literary) eager, keen, or stimulated—especially of curiosity, interest, or appetite.","zh":"（古语/文学用语）被激起的；渴望的；兴致勃勃的（尤指好奇心、兴趣或食欲被“吊起来”）。"},"examples":[{"en":"The mysterious letter left her curiosity awhet.","zh":"那封神秘的信让她的好奇心被彻底勾起来。"},{"en":"A few hints were enough to keep the audience awhet.","zh":"几句暗示就足以让观众兴致盎然、期待不已。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) a sharpening or a stimulus that makes someone more eager (often in the phrase “on awhet”).","zh":"（少见）使人更渴望的刺激/引子；（常见于短语）“on awhet”表示“被吊起胃口、兴致正浓”。"},"examples":[{"en":"The appetizer was only a whet—meant to put everyone on awhet for the main course.","zh":"那道开胃菜只是个“引子”，让大家对主菜更加期待。"}]}],"synonyms":["eager","keen","intrigued","stimulated","piqued"],"phonetic":"/əˈwɛt/","extraExplanation":["“awhet”多见于较旧或偏文学的英语里，本质上来自“a whet”（一个“whet”）的连写。whet原意是“磨利（刀刃）”，引申为“激起（食欲/兴趣）”。现代英语里更常用的表达是：whet your appetite / whet your curiosity / pique your interest（激起兴趣）。","常见搭配提示：on awhet（兴致被激起、正期待）属于偏古风的说法，现代写作里可以用 eager / intrigued / excited / keen 来替换，更自然。"]}
{"word":"awhile","summary":{"en":"“Awhile” most commonly means “for a short time” and is used as an adverb (e.g., “Wait awhile.”).","zh":"“awhile”最常见意思是“短时间地/一会儿”，多作副词使用（如：Wait awhile.）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"for a short time; for a while","zh":"一会儿；短时间内"},"examples":[{"en":"Wait here awhile, please.","zh":"请在这里等一会儿。"},{"en":"I haven’t seen her for awhile.","zh":"我有一阵子没见到她了。"},{"en":"Let’s rest awhile before we keep walking.","zh":"我们继续走之前先休息一会儿吧。"}]},{"partOfSpeech":"n.","definition":{"en":"a short period of time (often used after “a” or “for”)","zh":"一段短时间（常与 a 或 for 连用）"},"examples":[{"en":"It took a while to understand the instructions, but only awhile to finish the task.","zh":"理解说明花了一些时间，但完成任务只用了一会儿。"},{"en":"Stay for a while; I’ll be back in awhile.","zh":"待一会儿；我一会儿就回来。"}]}],"synonyms":["for a while","briefly","for a short time"],"phonetic":"/əˈwaɪl/","extraExplanation":["“awhile”通常是副词，意思是“短时间地”。常见对比：\n- awhile（副词）= for a short time：Wait awhile.\n- a while（名词短语）= a period of time：Wait a while.\n简单记法：能不能换成“for a short time”。能换→awhile；如果前面需要冠词 a 或介词 for，通常用 a while（for a while）。","在美式英语里，“in a while”更常见（表示“过一会儿/不久”）；而“in awhile”有时也会出现，但较不规范或更口语。考试或正式写作更建议用“in a while”。"]}
{"word":"awhir","summary":{"en":"“Awhir” means whirring or spinning fast, often used to describe machines, wheels, or even a busy mind.","zh":"“awhir”表示嗡嗡作响地飞快旋转（也可引申为思绪飞转/忙乱兴奋），常见于“all awhir”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"whirring; spinning or moving with a fast, humming sound (often used in the phrase “all awhir”).","zh":"嗡嗡作响的；飞快旋转/运转的（常用于短语“all awhir”）。"},"examples":[{"en":"The ceiling fan was all awhir in the summer heat.","zh":"夏天很热，吊扇嗡嗡地飞快转着。"},{"en":"My mind was awhir with questions after the meeting.","zh":"开完会后，我脑子里问题转个不停。"}]},{"partOfSpeech":"adv.","definition":{"en":"in a whirring, rapidly spinning way; with a humming sound.","zh":"嗡嗡地；飞快旋转地。"},"examples":[{"en":"The bicycle wheels went awhir as he rode downhill.","zh":"他骑车下坡时，车轮嗡嗡地飞快转起来。"},{"en":"The little drone lifted off, blades awhir.","zh":"小无人机起飞了，螺旋桨嗡嗡作响。"}]}],"synonyms":["whirring","spinning","buzzing","humming","in a whirl"],"phonetic":"/əˈwɝː/","extraExplanation":["“awhir”是比较文学化/描写性的用法，现代口语里更常说“whirring”或“spinning fast”。","开头的 a- 常见于较旧的英语（多源自 on- / a- 的形式），表示“处于某种状态/正在进行”，类似：asleep（睡着的）、awake（醒着的）、afire（着火的）等。","常见搭配：all awhir（全都嗡嗡转/一片忙乱），也可引申形容“思绪飞转、心情兴奋”。"]}
{"word":"awhirl","summary":{"en":"“Awhirl” means spinning or swirling quickly, often in a poetic/literary style; it can also describe thoughts or feelings moving in a confused, busy way.","zh":"“awhirl”表示快速旋转、飞旋（多用于诗意/文学表达），也可形容思绪或情绪翻腾、纷乱。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"spinning or turning quickly around (often used in a poetic or literary way).","zh":"（常见于诗歌/文学）飞旋的；快速旋转的。"},"examples":[{"en":"The leaves were awhirl in the wind.","zh":"树叶在风中飞旋。"},{"en":"My thoughts were awhirl after the unexpected news.","zh":"听到意外的消息后，我的思绪翻涌不定。"}]},{"partOfSpeech":"adv.","definition":{"en":"in a spinning or swirling way; moving around quickly.","zh":"（以）旋转、打转的方式；飞旋地。"},"examples":[{"en":"Dust rose and blew awhirl across the road.","zh":"尘土扬起，在路上打着旋儿吹过。"},{"en":"The dancers’ skirts flew awhirl as they turned.","zh":"舞者旋转时裙摆飞舞打旋。"}]}],"synonyms":["spinning","whirling","swirling","in a whirl","reeling"],"phonetic":"/əˈwɝl/","extraExplanation":["“awhirl”里的 a- 是一种较旧的英语前缀，常见于文学表达（如 afloat, asleep, ablaze）。它通常表示“处于……状态/正在……之中”，所以 awhirl 有“处在旋转状态中”的感觉，语气比普通的 “spinning” 更具画面感、也更偏诗意。"]}
{"word":"awian","summary":{"en":"Avian means “related to birds,” and can also mean “a bird” in formal/scientific contexts.","zh":"Avian 意为“与鸟类有关的”，在正式/科学语境中也可作名词表示“鸟类”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Adjective) Related to birds; of or belonging to birds.","zh":"（形容词）与鸟类有关的；鸟的；属于鸟类的。"},"examples":[{"en":"Scientists study avian migration patterns every year.","zh":"科学家每年研究鸟类的迁徙规律。"},{"en":"The clinic specializes in avian medicine for parrots and other pet birds.","zh":"这家诊所专门为鹦鹉等宠物鸟提供鸟类医疗。"}]},{"partOfSpeech":"n.","definition":{"en":"(Noun) A bird (often used in scientific or formal writing).","zh":"（名词）（常用于科学或正式语境）鸟类；鸟。"},"examples":[{"en":"This island is home to many rare avians.","zh":"这个岛上生活着许多稀有鸟类。"},{"en":"The researcher recorded the calls of several avians at dawn.","zh":"研究人员在黎明记录了几种鸟类的鸣叫声。"}]}],"synonyms":["bird-related","ornithic","birdlike"],"phonetic":"/ˈeɪviən/","extraExplanation":["“awian”不是常见的英语单词；你很可能想写的是“avian”。“avian”来自拉丁语 avis（鸟），常见于科学、医学与新闻报道中（如 avian flu=禽流感）。","语体提示：日常口语里更常说“bird(s)”，而“avian”更正式、更书面。"]}
{"word":"awide","summary":{"en":"Awide is a rare, poetic word meaning “wide open” or “far apart.”","zh":"Awide 是较少见、偏文学的词，意思是“敞开着”或“相距很远/分得很开”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Rare/poetic) far apart; spread widely; wide open.","zh":"（罕见/诗歌用法）相距很远；大大张开；分得很开。"},"examples":[{"en":"With arms awide, she ran to greet her friend.","zh":"她双臂大大张开，跑去迎接朋友。"},{"en":"The gates stood awide in the old tale.","zh":"在那个古老的故事里，大门敞开着。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare/poetic) wide open; fully opened.","zh":"（罕见/诗歌用法）敞开的；完全打开的。"},"examples":[{"en":"The door was awide, letting in cold air.","zh":"门敞开着，让冷空气进来。"}]}],"synonyms":["wide open","far apart","spread out"],"phonetic":"/əˈwaɪd/","extraExplanation":["“awide”是比较古旧、带文学色彩的写法，常见于诗歌或叙事文中。现代英语更常用“wide (open)”或“far apart”。","它可以理解为前缀 a-（表示“处于某种状态”，如 asleep, afloat）+ wide。"]}
{"word":"awiggle","summary":{"en":"Awiggle (also a-wiggle) means wiggling or moving with quick twisting motions, often used after “set/get.”","zh":"awiggle（也写作 a-wiggle）指“扭来扭去、摆动”，常接在 set/get 后表示“开始扭动起来”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Wiggling; moving with small quick twists from side to side (often used after a verb like “set” or “get”).","zh":"扭来扭去的；左右小幅度快速摆动的（常放在动词后面，如 set/get）。"},"examples":[{"en":"The fish was set awiggle in the net.","zh":"那条鱼在网里挣得扭来扭去。"},{"en":"The puppy got awiggle when it saw its owner.","zh":"小狗一看到主人就兴奋得扭来扭去。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a wiggling way; with a twisting motion.","zh":"以扭动的方式；扭扭摆摆地。"},"examples":[{"en":"The ribbon moved awiggle in the wind.","zh":"缎带在风里扭扭摆摆地飘动。"},{"en":"He danced awiggle across the stage as a joke.","zh":"他开玩笑似的扭来扭去地跳过舞台。"}]}],"synonyms":["wiggling","wriggling","squirming"],"phonetic":"/əˈwɪɡəl/","extraExplanation":["“awiggle”常写作“a-wiggle”。这里的 a- 是英语里较老的用法，带有“处于……状态/正在……”的感觉（类似 awake、afire 中的 a-），所以常见搭配是 set/get + a-wiggle（让……开始扭动/开始扭动起来）。","这个词偏口语、带点俏皮感，也常见于儿童故事或描写动物动作的文字里；正式写作里更常用 wiggling 或 wriggling。"]}
{"word":"awikiwiki","summary":{"en":"“Awikiwiki” is usually a playful form of “wikiwiki,” meaning “quick/fast” (from Hawaiian).","zh":"“Awikiwiki”通常是“wikiwiki”的俏皮写法；“wikiwiki”源自夏威夷语，意为“快/迅速”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Often written “wikiwiki”) Hawaiian word meaning “quick; fast,” sometimes used in Hawaiian English as an informal way to say “hurry” or “quickly.”","zh":"（常写作“wikiwiki”）夏威夷语，意思是“快；迅速”。在夏威夷英语里也可非正式地表示“快点/赶紧”。"},"examples":[{"en":"We need to leave wikiwiki, or we’ll miss the bus.","zh":"我们得快点走，不然要错过公交了。"},{"en":"She said, “Come wikiwiki!”","zh":"她说：“快点来！”"}]},{"partOfSpeech":"n.","definition":{"en":"A playful/creative spelling or username based on “wikiwiki” (quick/fast); not a standard English dictionary word on its own.","zh":"一种基于“wikiwiki（快）”的俏皮拼写/网名写法；本身不是标准英语词条。"},"examples":[{"en":"My online handle is Awikiwiki because I like the idea of being quick.","zh":"我的网名是Awikiwiki，因为我喜欢“迅速”的感觉。"}]}],"synonyms":["quick","fast","hurry (informal)","rapid"],"phonetic":"əˌwɪkiˈwɪki","extraExplanation":["“wikiwiki”来自夏威夷语，重复是常见的构词方式，用来加强语气（类似“更……/很……”的感觉），所以“wikiwiki”有“很快、快快”的味道。","它也和互联网里的“wiki（维基）”有关：据常见说法，第一批“Wiki”网页系统的名字灵感就来自“wikiwiki（快）”。在檀香山机场曾有“Wiki Wiki Shuttle（快捷接驳车）”的标识，也让这个词更为人知。"]}
{"word":"awin","summary":{"en":"“Awin” is usually a company name in affiliate marketing; it may also be a misspelling/merged form of “a win” meaning a success.","zh":"“Awin”通常指联盟营销平台的公司名；也可能是把“a win”（一次成功/胜利）连写或写错。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Awin: a brand name for an affiliate marketing network (a company/service that connects advertisers with publishers who promote products for a commission).","zh":"Awin：一家“联盟营销/推广”平台（把广告主和推广者连接起来，推广成功后按佣金结算的公司/服务）。"},"examples":[{"en":"She joined Awin to find affiliate programs for her blog.","zh":"她加入了 Awin，为自己的博客寻找联盟推广项目。"},{"en":"Our store runs an affiliate campaign through Awin.","zh":"我们店通过 Awin 运行联盟推广活动。"}]},{"partOfSpeech":"phrase","definition":{"en":"(Often intended) a win: a success or victory (written as two words).","zh":"（常见本意）a win：一次成功/胜利（通常写作两个词）。"},"examples":[{"en":"Getting the visa was a win for our whole team.","zh":"拿到签证对我们整个团队来说都是一次胜利。"},{"en":"That small improvement is still a win.","zh":"那个小进步也算一次成功。"}]}],"synonyms":["a victory","a success","affiliate network"],"phonetic":"/əˈwɪn/","extraExplanation":["“Awin”通常是专有名词（公司名），常见于电商、营销、内容创作领域。若你是想表达“一个胜利/一次成功”，英语里一般写作“a win”（分开写）。","如果你是在某个句子/聊天记录里看到“awin”，也可能只是把“a win”连写了；具体含义需要看上下文。"]}
{"word":"awing","summary":{"en":"“Awing” means “causing awe” and is most often the -ing form of the verb “awe.”","zh":"“Awing”表示“使人敬畏/惊叹”，通常是动词“awe”的 -ing 形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"present participle of “awe”: to fill someone with awe (a strong feeling of wonder and respect, sometimes mixed with fear).","zh":"“awe”的现在分词：使某人产生敬畏之情（强烈的惊叹与尊敬，有时夹杂一点害怕）。"},"examples":[{"en":"The view from the mountaintop was awing the hikers into silence.","zh":"山顶的景色让徒步者心生敬畏，安静了下来。"},{"en":"Her talent is still awing the audience night after night.","zh":"她的才华依然一晚又一晚地让观众惊叹不已。"}]},{"partOfSpeech":"adj.","definition":{"en":"used like an adjective (less common): inspiring awe; awe-inspiring.","zh":"作形容词用（较少见）：令人敬畏的；令人惊叹的（≈ awe-inspiring）。"},"examples":[{"en":"It was an awing display of skill.","zh":"那是一场令人惊叹的技艺展示。"}]}],"synonyms":["awe-inspiring","astonishing","breathtaking","majestic"],"phonetic":"/ˈɔːɪŋ/","extraExplanation":["“awing”在现代英语里不算常见；很多时候更自然的表达是“awe-inspiring / awesome”。","注意不要和“owing”（由于；欠……的）混淆：awing 来自 awe（敬畏），owing 来自 owe（欠）。"]}
{"word":"awingly","summary":{"en":"“Awingly” means “in a way that inspires awe; very impressively.”","zh":"“awingly”表示“以令人敬畏/惊叹的方式；非常震撼地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that causes or expresses awe; impressively; awe-inspiringly.","zh":"以令人敬畏的方式；令人惊叹地；震撼人心地。"},"examples":[{"en":"The mountains rose awingly above the valley.","zh":"群山在山谷之上巍然耸立，令人敬畏。"},{"en":"She spoke of the night sky awingly, as if it were sacred.","zh":"她谈起夜空时语带敬畏，仿佛那是神圣之物。"}]}],"synonyms":["awe-inspiringly","impressively","majestically","in an awed way"],"phonetic":"ˈɔɪŋli","extraExplanation":["“awingly”较少见，更常见的表达是“in an awed way”（以敬畏的方式）或“awe-inspiringly / impressively”（令人惊叹地）。","它来自“awe”（敬畏、惊叹）→“awing”（使人敬畏的）→“awingly”（副词）。写作中可用来营造宏大、庄严或带宗教感的氛围。"]}
{"word":"awink","summary":{"en":"“A wink” means a quick one-eye blink used as a friendly or joking signal; in “in a wink,” it means very quickly.","zh":"“a wink”指眨一下眼，常用作友好或玩笑式暗示；在短语“in a wink”中表示“一眨眼、很快”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a quick closing and opening of one eye, often used to show friendliness, humor, or a secret understanding","zh":"（眨）一下眼；常用来表示友好、开玩笑或“心照不宣”的暗示"},"examples":[{"en":"She gave me a wink to show she was joking.","zh":"她朝我眨了下眼，表示她是在开玩笑。"},{"en":"He ended the message with a wink.","zh":"他用“眨眼”的暗示语气结束了信息。"}]},{"partOfSpeech":"phrase","definition":{"en":"(in phrases like “in a wink”) a very short time; instantly","zh":"（用于短语 in a wink）一眨眼的工夫；立刻"},"examples":[{"en":"I’ll be back in a wink.","zh":"我马上就回来。"},{"en":"The kids fell asleep in a wink.","zh":"孩子们一眨眼就睡着了。"}]}],"synonyms":["a quick wink","in an instant","in a flash"],"phonetic":"/ə ˈwɪŋk/","extraExplanation":["“awink”通常不是标准拼写，更常见的是分开写作“a wink”（眨一下眼）。如果你是在聊天里看到“awink”，很可能是把空格省略了。","“wink”在英语文化里常带有轻松、调侃或默契的感觉；但在正式场合或跨文化交流中，对陌生人眨眼可能会被误解为不礼貌或过于亲密。"]}
{"word":"awiwi","summary":{"en":"“awiwi” is not a standard English word; it’s likely a typo, name, or non-English term.","zh":"“awiwi”不是标准英语词；可能是拼写错误、名字/昵称或非英语词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a typo, a username/nickname, or a word from another language.","zh":"不是标准英语单词。更可能是拼写错误、用户名/昵称，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “awiwi” in an English dictionary—did you mean another word?","zh":"我在英语词典里找不到“awiwi”——你是不是想写别的词？"},{"en":"“Awiwi” might be a screen name rather than a vocabulary word.","zh":"“Awiwi”可能是网名，而不是词汇。"}]}],"phonetic":"/ɑˈwiːwiː/","extraExplanation":["“awiwi”在英语里没有固定、常见的词义，因此很难给出准确释义。你可以告诉我它出现的句子/上下文，或你想表达的意思（比如“发音像什么”、想写的是不是“a wee”（一点点）、“awry”（出错地）、或“wiwi/wee-wee”（儿童用语：小便）等），我就能帮你对照最可能的词并解释用法。"]}
{"word":"AWK","summary":{"en":"“awk” is an informal short form of “awkward,” and “AWK” is also the name of a Unix text-processing language/tool.","zh":"“awk”常作“awkward（尴尬的）”的非正式缩写；“AWK”也指 Unix 的文本处理语言/工具。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Awkward; strange or uncomfortable.","zh":"（非正式）尴尬的；别扭的；让人不自在的。"},"examples":[{"en":"That was an awk moment when nobody knew what to say.","zh":"那一刻很尴尬，大家都不知道该说什么。"},{"en":"Sorry if this is awk, but can I ask you a question?","zh":"不好意思如果这样有点尴尬，但我能问你个问题吗？"}]},{"partOfSpeech":"n.","definition":{"en":"A Unix text-processing programming language/tool (often written as “AWK”).","zh":"Unix 系统中的文本处理编程语言/工具（常写作“AWK”）。"},"examples":[{"en":"I used AWK to extract the second column from a log file.","zh":"我用 AWK 从日志文件里提取了第二列。"},{"en":"AWK is handy for quick data cleanup in the terminal.","zh":"在终端里做快速数据清理时，AWK 很好用。"}]}],"synonyms":["awkward","cringey","uncomfortable"],"phonetic":"/ɔk/","extraExplanation":["“awk”作为网络/口语缩写，通常来自“awkward（尴尬的）”，常见于聊天、社交媒体和短信中。写作时较随意，不适合正式邮件或学术写作。","“AWK”是一种经典的命令行文本处理工具/语言，名字来自三位作者 Alfred Aho、Peter Weinberger、Brian Kernighan 的姓氏首字母。与“awk（尴尬的）”是同形不同源。"]}
{"word":"awk","summary":{"en":"A command-line text-processing tool/language on Unix-like systems, often used for column-based data and pattern matching.","zh":"Unix 类系统上的文本处理工具/语言，常用于按列处理数据与模式匹配。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Unix command-line tool and programming language used to search, match patterns, and process text (especially line by line, split into fields/columns).","zh":"Unix 命令行工具与编程语言，用于搜索、按模式匹配并处理文本（常按“行”读取，并按字段/列分割处理）。"},"examples":[{"en":"I used awk to extract the second column from a log file.","zh":"我用 awk 从日志文件里提取第二列。"},{"en":"This script uses awk to filter lines that contain “ERROR”.","zh":"这个脚本用 awk 过滤包含“ERROR”的行。"},{"en":"In Unix pipelines, awk is often combined with grep and sort.","zh":"在 Unix 的管道命令中，awk 常与 grep、sort 搭配使用。"}]}],"synonyms":["gawk","nawk","text-processing tool","scripting language"],"phonetic":"/ɔk/","extraExplanation":["awk 这个名字来自三位作者的姓氏首字母：Alfred Aho、Peter Weinberger、Brian Kernighan（常见于 Unix 文化与经典书籍《The AWK Programming Language》）。","常见用法是：awk 'pattern { action }' file，例如按空格分列后用 $1、$2 表示第 1、第 2 列；默认逐行处理，因此非常适合清洗文本与快速处理日志。"]}
{"word":"awkly","summary":{"en":"Awkwardly means “in an awkward way,” often describing uncomfortable social moments or clumsy movement.","zh":"Awkwardly 表示“尴尬地/笨拙地/不顺畅地”，常用于社交场合的不自在或动作不协调。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is uncomfortable, clumsy, or not smooth/easy.","zh":"以不舒服、笨拙或不顺畅的方式；尴尬地。"},"examples":[{"en":"He smiled awkwardly and didn’t know what to say.","zh":"他尴尬地笑了笑，不知道该说什么。"},{"en":"She walked awkwardly in high heels.","zh":"她穿着高跟鞋走得很别扭。"},{"en":"The conversation ended awkwardly.","zh":"谈话尴尬地结束了。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that causes difficulty because something is not arranged conveniently.","zh":"（安排、位置等）不便利地；别扭地。"},"examples":[{"en":"The TV is awkwardly placed in the corner.","zh":"电视机摆在角落里，位置很别扭。"},{"en":"The meeting was scheduled awkwardly, right during lunch.","zh":"会议时间安排得很不合适，正好在午饭时间。"}]}],"synonyms":["clumsily","uncomfortably","uneasily","in an embarrassing way"],"phonetic":"ˈɔkwɚdli","extraExplanation":["“awkly” 不是常见英文单词，通常是把 **awkwardly** 拼错了。正确拼法：a-w-k-w-a-r-d-l-y。","词根提示：**awkward**（尴尬的/笨拙的）+ **-ly**（副词后缀）→ “以尴尬/笨拙的方式”。","常见搭配：smile awkwardly（尴尬地笑）、laugh awkwardly（尴尬地笑出声）、stand/sit awkwardly（别扭地站/坐）。"]}
{"word":"awkward","summary":{"en":"Awkward means clumsy or hard to handle, or socially uncomfortable/embarrassing, or simply not convenient.","zh":"awkward 表示“笨拙/不顺手”，也可表示“社交尴尬/不自在”，还可指“时机或情况不方便、棘手”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not smooth or graceful; clumsy or difficult to handle.","zh":"不顺畅的；笨拙的；难以操作或处理的。"},"examples":[{"en":"The box was an awkward shape, so it wouldn’t fit in the car.","zh":"箱子的形状很别扭，所以塞不进车里。"},{"en":"He made an awkward movement and nearly dropped the glass.","zh":"他动作很笨拙，差点把杯子掉了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Socially uncomfortable or embarrassing; causing people to feel tense or unsure.","zh":"社交上令人尴尬或不自在的；让人紧张、不知所措的。"},"examples":[{"en":"There was an awkward silence after her joke.","zh":"她讲完笑话后出现了尴尬的沉默。"},{"en":"It’s awkward to run into your boss at a party.","zh":"在派对上碰到老板会很尴尬。"},{"en":"I felt awkward asking for help.","zh":"我觉得开口求助很不自在。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not convenient; difficult because of timing, position, or circumstances.","zh":"不方便的；因时间、位置或情况而棘手的。"},"examples":[{"en":"Can we talk later? This is an awkward time.","zh":"我们晚点再谈好吗？现在不是个方便的时间。"},{"en":"The hotel is nice, but it’s in an awkward location without public transportation.","zh":"酒店不错，但位置不方便，没公共交通。"}]}],"synonyms":["clumsy","uncomfortable","embarrassing","uneasy","inconvenient"],"phonetic":"/ˈɔkwɚd/","extraExplanation":["“awkward”常用来描述两类“别扭”：一是动作/形状/操作上的不顺手（clumsy, hard to handle），二是社交氛围上的尴尬（awkward silence、awkward moment）。学会用名词搭配会更自然：awkward silence（尴尬的沉默）、awkward question（尴尬的问题）、awkward situation（尴尬/棘手的处境）。","语气上，“awkward”比“embarrassing”更轻一些：embarrassing 更强调“丢脸/难堪”，awkward 更强调“气氛不对劲、不知道怎么继续”。"]}
{"word":"awkwarder","summary":{"en":"“Awkwarder” means “more awkward,” though “more awkward” is more common in modern English.","zh":"“awkwarder”表示“更尴尬／更别扭／更难处理”，但现代英语中更常用“more awkward”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative form of “awkward”: more awkward; causing more discomfort, embarrassment, or difficulty than something else.","zh":"“awkward”的比较级：更尴尬的／更别扭的／更难处理的（比另一件事更让人不舒服或更不顺手）。"},"examples":[{"en":"This conversation is getting awkwarder by the minute.","zh":"这段对话每过一分钟就更尴尬一点。"},{"en":"The second chair is awkwarder to carry because it’s heavier and wider.","zh":"第二把椅子更难搬，因为它更重也更宽。"},{"en":"It felt awkwarder to ask for help the second time.","zh":"第二次开口求助时感觉更别扭。"}]}],"synonyms":["more awkward","more uncomfortable","more embarrassing","more clumsy","more difficult"],"phonetic":"ˈɔkwɚdɚ","extraExplanation":["“awkwarder”在语法上是正确的比较级，但在现代英语里，很多人更常用“more awkward”。尤其在正式写作中，“more awkward”更自然、更常见。","“awkward”的最高级可以是“awkwardest”（也有人用“most awkward”）。","常见搭配：awkward moment（尴尬时刻）, awkward silence（尴尬的沉默）, awkward to use/carry（用起来／拿起来不顺手）。"]}
{"word":"awkwardest","summary":{"en":"“Awkwardest” means “the most awkward,” often describing the most embarrassing, uncomfortable, clumsy, or hard-to-handle situation or moment.","zh":"“awkwardest”意为“最尴尬／最别扭／最笨拙／最难处理的”，常用来描述最令人不自在或最难应对的时刻或情况。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative form of “awkward”: the most awkward (most uncomfortable, embarrassing, clumsy, or difficult to handle).","zh":"“awkward”的最高级：最尴尬的／最别扭的／最笨拙的／最难处理的。"},"examples":[{"en":"That was the awkwardest silence I’ve ever experienced.","zh":"那是我经历过最尴尬的沉默。"},{"en":"This is the awkwardest part of the conversation—talking about money.","zh":"这段对话里最别扭的部分就是谈钱。"},{"en":"He chose the awkwardest moment to ask for a favor.","zh":"他挑了一个最不合时宜（最尴尬）的时刻来求帮忙。"}]}],"synonyms":["most awkward","most embarrassing","most uncomfortable","clumsiest (when about movement)","most inconvenient"],"phonetic":"/ˈɔkwərdɪst/","extraExplanation":["“awkwardest”是形容词“awkward”的最高级。日常口语里更常见的是“most awkward”（尤其在较正式或强调语气时），但“awkwardest”也很自然、常用。","“awkward”既可以形容社交场合的尴尬（awkward silence / awkward moment），也可以形容动作笨拙（awkward movement）或事情难处理（an awkward problem）。根据上下文理解更准确。"]}
{"word":"awkwardish","summary":{"en":"Awkwardish means “a little awkward,” often used casually to soften the feeling of discomfort or social clumsiness.","zh":"Awkwardish 指“有点尴尬/不自然”，多用于口语，语气比 awkward 更缓和。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"somewhat awkward; a little uncomfortable, clumsy, or socially uneasy (informal).","zh":"有点尴尬的；有点笨拙的；略显不自然的（非正式）"},"examples":[{"en":"The meeting was awkwardish at first, but it got better after everyone introduced themselves.","zh":"会议一开始有点尴尬，但大家自我介绍之后就好多了。"},{"en":"I gave an awkwardish laugh because I didn’t understand the joke.","zh":"我没听懂那个笑话，只好尴尬地笑了一下。"},{"en":"It was an awkwardish moment when they realized they had both dated the same person.","zh":"当他们发现两个人都和同一个人交往过时，场面有点尴尬。"}]}],"synonyms":["slightly awkward","somewhat awkward","a bit awkward","mildly awkward"],"phonetic":"/ˈɔkwɚdɪʃ/","extraExplanation":["“-ish” 是英语里很常见的后缀，表示“有点……/大概……/不完全是……”。所以 awkwardish 比 awkward 更柔和，常用来弱化语气，让评价听起来没那么严厉。","awkwardish 很口语、偏随意，写正式邮件或学术写作时通常用 slightly awkward / somewhat awkward 更合适。"]}
{"word":"awkwardly","summary":{"en":"Awkwardly means “in an embarrassing, clumsy, or inconvenient way.”","zh":"awkwardly 意为“尴尬地/笨拙地/不方便地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an uncomfortable, embarrassing, or socially clumsy way.","zh":"以尴尬的、别扭的、不自在的方式（社交上不顺、让人不舒服）。"},"examples":[{"en":"He laughed awkwardly and changed the subject.","zh":"他尴尬地笑了笑，然后换了话题。"},{"en":"They stood awkwardly in silence, not sure what to say.","zh":"他们别扭地沉默着站着，不知道该说什么。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a physically clumsy or ungraceful way; without smooth control.","zh":"以笨拙的、不够协调的方式（动作不利落、不优雅）。"},"examples":[{"en":"She walked awkwardly in high heels.","zh":"她穿着高跟鞋走得很不稳。"},{"en":"He held the box awkwardly, so it kept slipping.","zh":"他笨拙地抱着箱子，所以箱子一直在滑。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a difficult, inconvenient, or hard-to-manage way.","zh":"以棘手的、不方便的、难处理的方式。"},"examples":[{"en":"The meeting was scheduled awkwardly between two important classes.","zh":"会议时间安排得很不方便，夹在两节重要课之间。"},{"en":"The desk was awkwardly placed near the door.","zh":"书桌放的位置很别扭，靠近门口。"}]}],"synonyms":["clumsily","embarrassingly","uncomfortably","inelegantly"],"phonetic":"/ˈɔkwɚdli/","extraExplanation":["“awkwardly”来自形容词“awkward”（尴尬的/笨拙的/不方便的）加副词后缀“-ly”。口语里最常见的是描述社交尴尬：laughed awkwardly（尴尬地笑）、smiled awkwardly（尴尬地笑/微笑）、paused awkwardly（尴尬地停顿）。","易混点：awkwardly（动作或社交“别扭/尴尬”）不等于“sadly（难过地）”或“rudely（粗鲁地）”；它更强调“不自然、没处理好、让人不舒服”。"]}
{"word":"awkwardness","summary":{"en":"Awkwardness means an uncomfortable, embarrassing feeling or situation, or clumsiness/lack of ease in movement.","zh":"Awkwardness 指尴尬、不自在的情绪或场面，也可指动作不协调的笨拙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being awkward; an uncomfortable or embarrassing feeling or situation","zh":"尴尬；不自在（的状态或情境）；笨拙感"},"examples":[{"en":"There was a moment of awkwardness after no one laughed at the joke.","zh":"没人对那个笑话发笑后，现场出现了一阵尴尬。"},{"en":"He tried to break the awkwardness by changing the subject.","zh":"他试图通过换个话题来打破尴尬。"},{"en":"I felt awkwardness at the party because I didn’t know anyone.","zh":"我在派对上感到不自在，因为我谁也不认识。"}]},{"partOfSpeech":"n.","definition":{"en":"lack of grace, skill, or ease in movement or action; clumsiness","zh":"笨拙；不灵活；动作不协调"},"examples":[{"en":"His awkwardness with chopsticks made everyone smile kindly.","zh":"他用筷子时的笨拙让大家善意地笑了。"},{"en":"With practice, the awkwardness in her movements disappeared.","zh":"经过练习，她动作中的笨拙消失了。"}]}],"synonyms":["embarrassment","discomfort","unease","clumsiness","inelegance"],"phonetic":"/ˈɔkwɚdnəs/","extraExplanation":["“awkwardness”来自形容词“awkward”（尴尬的/笨拙的）+ 名词后缀“-ness”，表示“……的状态/性质”。","在日常口语里，“awkwardness”常指社交场合的尴尬氛围；也可以指身体动作或技能上的不熟练。要表达“感到尴尬”，常用：feel awkward / feel embarrassed。","常见搭配：social awkwardness（社交尴尬/社交不自在）、break the awkwardness（打破尴尬）、an awkward silence（尴尬的沉默）。"]}
{"word":"awkwardnesses","summary":{"en":"“Awkwardnesses” is the plural of “awkwardness,” meaning multiple moments of embarrassment, multiple clumsy/unnatural features, or multiple complications.","zh":"“awkwardnesses”是“awkwardness”的复数，指多次尴尬时刻、多处笨拙/不自然之处，或多项棘手麻烦。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"social discomfort or embarrassment, especially in conversation or unfamiliar situations (plural form).","zh":"（复数）社交上的尴尬、不自在，尤指在交谈或陌生场合中的窘迫感。"},"examples":[{"en":"There were a few awkwardnesses at the dinner, but everyone tried to be polite.","zh":"晚餐时出现了几次尴尬场面，但大家都尽量保持礼貌。"},{"en":"She laughed to hide the awkwardnesses of meeting her ex again.","zh":"她用笑来掩饰再次见到前任时的尴尬。"}]},{"partOfSpeech":"n.","definition":{"en":"clumsy or unnatural features in movement, design, writing, or performance (plural form).","zh":"（复数）动作、设计、写作或表演中的笨拙、不自然之处。"},"examples":[{"en":"The early draft has awkwardnesses in tone and pacing.","zh":"早期稿在语气和节奏上有些不自然之处。"},{"en":"With practice, the awkwardnesses in his speech became less noticeable.","zh":"经过练习，他讲话中的生硬感就不那么明显了。"}]},{"partOfSpeech":"n.","definition":{"en":"difficult or inconvenient aspects of a situation; complications (plural form).","zh":"（复数）情境中的棘手之处、不便之处；麻烦与波折。"},"examples":[{"en":"Traveling with small children comes with its own awkwardnesses.","zh":"带小孩旅行会有各种不便和麻烦。"},{"en":"The plan worked, despite a few awkwardnesses in scheduling.","zh":"尽管日程安排上有些棘手之处，计划还是成功了。"}]}],"synonyms":["embarrassments","discomforts","clumsinesses","inelegances","complications"],"phonetic":"/ˈɔkwərdnəsɪz/","extraExplanation":["“awkwardness”通常是不可数名词（表示一种尴尬/不自然的“状态”），但当你想强调“多次尴尬时刻/多个不自然之处/一堆麻烦点”时，就会用复数“awkwardnesses”。在写作里，复数用法常见于分析文章或评论（如：指出一篇文章的多处别扭之处）。"]}
{"word":"AWL","summary":{"en":"AWL most commonly means the Academic Word List, a high-frequency academic vocabulary list used in English study.","zh":"AWL 最常指 Academic Word List（学术词汇表），用于英语学习的高频学术词汇清单。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Academic Word List: a well-known list of common word families used in academic texts (often used in English learning and teaching).","zh":"学术词汇表（Academic Word List）：一份常见于学术英语文章中的高频词族清单，常用于英语学习与教学。"},"examples":[{"en":"My teacher asked me to study the AWL to improve my academic writing.","zh":"老师让我学习 AWL 来提升学术写作能力。"},{"en":"Words like “analyze” and “method” are often taught as AWL vocabulary.","zh":"像 analyze（分析）和 method（方法）这样的词常被当作 AWL 词汇来教。"},{"en":"This reading passage includes many AWL words, so it feels more formal.","zh":"这篇阅读里有很多 AWL 词，所以读起来更正式、更学术。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) An abbreviation that can have different meanings depending on the context (for example, in specific fields or organizations).","zh":"（较少见）在不同语境下可能代表不同含义的缩写（例如某些领域或机构名称）。"},"examples":[{"en":"In this course, AWL refers to the Academic Word List.","zh":"在这门课里，AWL 指的是 Academic Word List（学术词汇表）。"},{"en":"Always check what AWL means in a document, because abbreviations vary.","zh":"缩写的含义会变化，所以在文件里要先确认 AWL 的具体意思。"}]}],"synonyms":["Academic Word List","academic vocabulary list"],"phonetic":"ˌeɪ dʌbəlˌjuː ˈɛl","extraExplanation":["AWL 最常指语言学习领域的 Academic Word List（学术词汇表），由 Averil Coxhead（2000）整理，包含 570 个“词族”（word families），目的是帮助学习者掌握在学术文章中跨学科高频出现、但不属于最基础通用词表的词汇。","AWL 常用于雅思/托福/大学英语写作与阅读训练；学习时通常会按“词族”扩展同根词（如 analyze → analysis, analytical），并结合学术语境练习固定搭配（collocations）。"]}
{"word":"awl","summary":{"en":"“awl” usually means a pointed hand tool for making holes; “AWL” can also mean the Academic Word List.","zh":"“awl”通常指用于戳孔的尖锥工具；“AWL”也可指学术词汇表（Academic Word List）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small pointed tool used for making holes (especially in leather, wood, or cloth) or for marking where a hole should be.","zh":"锥子；尖孔器（用于在皮革、木头或布料上戳孔或做定位记号的小尖工具）"},"examples":[{"en":"The shoemaker used an awl to punch holes in the leather.","zh":"鞋匠用锥子在皮革上打孔。"},{"en":"Mark the spot with an awl before you drill.","zh":"钻孔前先用锥子在位置上做个记号。"}]},{"partOfSpeech":"other","definition":{"en":"Academic Word List (AWL): a commonly used list of important academic English vocabulary, often studied for university reading and writing.","zh":"学术词汇表（AWL）：常用的学术英语核心词汇清单，常用于大学英语阅读与写作词汇学习。"},"examples":[{"en":"I’m learning words from the AWL to improve my academic writing.","zh":"我在学 AWL 里的词来提升学术写作。"},{"en":"Many EAP courses teach the AWL to help students read journal articles.","zh":"许多学术英语课程会教 AWL，帮助学生阅读期刊文章。"}]}],"synonyms":["bradawl","punch (tool)","gimlet"],"phonetic":"/ɔl/","extraExplanation":["“awl”作工具名词时，常见于手工皮具、制鞋、木工等场景；与“drill（电钻）”不同，awl通常用于戳孔或做定位孔。","作为缩写的“AWL（Academic Word List）”在英语学习领域很常见，尤其在备考雅思/托福的学术阅读写作或EAP课程中；是否指这个缩写通常要看上下文。"]}
{"word":"awless","summary":{"en":"Flawless means perfect or with no mistakes.","zh":"flawless 表示“完美无瑕、没有错误或缺点”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no flaws; perfect or without mistakes.","zh":"完美无瑕的；没有缺点或错误的。"},"examples":[{"en":"Her performance was flawless from start to finish.","zh":"她的表演从头到尾都完美无瑕。"},{"en":"The plan sounded flawless, but we still tested it twice.","zh":"这个计划听起来天衣无缝，但我们还是测试了两次。"},{"en":"He spoke flawless English after living in the U.S. for years.","zh":"他在美国生活多年后，说一口非常地道、几乎无可挑剔的英语。"}]}],"synonyms":["perfect","impeccable","faultless","unblemished"],"phonetic":"/ˈflɔləs/","extraExplanation":["“awless”通常是“flawless”的拼写错误；正确拼写是 flawless。","构词：flaw（缺点/瑕疵）+ -less（无……的）→ flawless（没有瑕疵的）。","语用提示：flawless 常用来夸赞表现、外观、计划等“几乎没有可挑剔之处”，比一般的 “very good” 更强。"]}
{"word":"awlessness","summary":{"en":"“Awlessness” is not standard; you probably mean “flawlessness” (perfect, without flaws).","zh":"“awlessness” 不是标准用法；你多半想写 “flawlessness”（完美、无瑕疵）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard/rare) The state of having no flaws; perfect quality. In modern English, people almost always use “flawlessness.”","zh":"（非标准/少见）毫无瑕疵的状态；完美的品质。现代英语中通常用 “flawlessness”。"},"examples":[{"en":"The reviewer praised the diamond’s flawlessness.","zh":"评论者称赞这颗钻石毫无瑕疵。"},{"en":"Her performance had an air of flawlessness.","zh":"她的表演带着一种近乎完美的感觉。"}]}],"synonyms":["flawlessness","perfection","impeccability"],"phonetic":"/ˈflɔləsnəs/","extraExplanation":["“awlessness” 很可能是拼写错误或非常少见的变体。更常见、标准的写法是 “flawlessness”（无瑕疵、完美）。\n也有人把它误写成 “lawlessness”（无法无天、无秩序），两者意思完全不同：\n- flawlessness = 没有缺点\n- lawlessness = 没有法律约束/混乱"]}
{"word":"awls","summary":{"en":"“Awls” is the plural of “awl,” a sharp tool used for making holes or marking points in materials such as leather or wood.","zh":"“Awls”是“awl”的复数，指用于在皮革、木材等材料上戳孔或定位的尖头工具（锥子/打孔锥）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of awl) A small pointed hand tool used to make holes or mark points in materials like leather, wood, or fabric.","zh":"（awl 的复数）一种尖头的手工工具，用来在皮革、木材或布料上戳孔或做定位记号。"},"examples":[{"en":"The leatherworker used awls to punch neat holes for the stitches.","zh":"皮革匠用锥子（awls）打出整齐的孔，方便走线缝合。"},{"en":"Keep the awls in a safe case—they’re very sharp.","zh":"把锥子收在安全的盒子里——它们很锋利。"}]}],"synonyms":["borer","punch","bradawl"],"phonetic":"/ɔl/","extraExplanation":["“awl”常见于皮革工艺、鞋匠（cobbler）修鞋、木工等场景；它不是用来“切割”的刀，而是用来“戳孔/定位”的尖锥工具。","单数是“an awl”，复数是“awls”。发音里“w”不发音，听起来像“all”。"]}
{"word":"awlwort","summary":{"en":"Awlwort is a small water or wetland plant with narrow, awl-shaped leaves, especially *Subularia aquatica*.","zh":"Awlwort 指一种水生或湿地小植物，叶子细长如锥子，常特指 *Subularia aquatica*。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small aquatic or wetland plant with narrow, awl-shaped leaves (usually referring to *Subularia aquatica*)","zh":"一种生长在水中或湿地的小型植物，叶子细长呈“锥子状”（常指水生植物 *Subularia aquatica*，中文常译作“水锥叶草”等）"},"examples":[{"en":"Awlwort grows in shallow lakes and clean, cold water.","zh":"awlwort 常生长在浅湖里，以及干净、寒冷的水域中。"},{"en":"The botanist recorded awlwort as an indicator of very clear water.","zh":"植物学家把 awlwort 记录为“水质非常清澈”的指示植物。"}]}],"synonyms":["Subularia aquatica","water awlwort"],"phonetic":"/ˈɔlˌwɝt/","extraExplanation":["“awlwort”由 awl（锥子、钻子）+ wort（古英语里常指“植物/草药”）组成，因此字面意思接近“锥叶草”。现代英语里 -wort 多保留在一些植物名中（如 St. John’s wort）。","在自然写作或生态学语境中，awlwort 往往出现在描述湖泊、水质、湿地植被的文本里；它不是日常生活中的常用词。","拼写提醒：如果你想查的是“awkward（尴尬的/笨拙的）”，拼写和意思都不同。你也可以告诉我上下文，我可以帮你确认。"]}
{"word":"awlworts","summary":{"en":"Awlwort(s) are small plants with awl-shaped leaves, especially the aquatic species *Subularia aquatica*.","zh":"Awlwort(s) 指叶子细长尖锐像锥子的植物，常指水生种 *Subularia aquatica*。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small plant (genus *Subularia*, especially *Subularia aquatica*) with narrow, awl-shaped leaves, often found in shallow water or wet places; also called **water awlwort**","zh":"一种小型植物（亚属 *Subularia*，尤指水生的 *Subularia aquatica*），叶子细长尖锐像锥子，常生于浅水或潮湿地；也叫 **water awlwort（水生锥叶草）**"},"examples":[{"en":"Water awlwort grows in clean, shallow lakes and ponds.","zh":"水生锥叶草生长在干净的浅湖和池塘里。"},{"en":"The survey recorded awlworts in a protected wetland.","zh":"调查记录到在一处受保护的湿地里有锥叶草。"}]}],"synonyms":["water awlwort"],"phonetic":"/ˈɔlˌwɝt/","extraExplanation":["这个词比较少见，属于植物学用词。词源上可以拆开理解：**awl** 指“锥子/尖针状工具”，**wort** 是古英语里“植物/草本”的意思（常见于植物名，如 *St. John’s wort*）。因此 **awlwort** 字面意思就是“叶子像锥子一样的草”。","如果你本来想输入的是 **“all words”** 或其他拼写相近的词，也可以告诉我上下文句子，我可以帮你确认正确单词。"]}
{"word":"awm","summary":{"en":"AWM is an abbreviation; most commonly it refers to the Australian War Memorial, but it can also mean anti-war movement or (informally online) Asian women depending on context.","zh":"AWM 是缩写；最常见指澳大利亚战争纪念馆（Australian War Memorial），也可能指反战运动（anti-war movement），或在部分网络语境中指“亚洲女性”，需结合上下文判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Australian War Memorial, a national museum and memorial in Canberra that commemorates Australians who served and died in war.","zh":"（缩写）Australian War Memorial（澳大利亚战争纪念馆），位于堪培拉的国家级纪念馆与博物馆，用于纪念在战争中服役与牺牲的澳大利亚人。"},"examples":[{"en":"We visited the AWM to learn about Australia’s military history.","zh":"我们参观了 AWM，了解澳大利亚的军事历史。"},{"en":"The AWM has exhibitions, archives, and a remembrance area.","zh":"AWM 有展览、档案资料以及纪念区域。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) anti-war movement, organized public action opposing war.","zh":"（缩写）anti-war movement（反战运动），指反对战争的有组织公众行动。"},"examples":[{"en":"In the 1960s, the AWM grew as more people protested the war.","zh":"在20世纪60年代，随着更多人抗议战争，AWM（反战运动）不断发展。"},{"en":"Some historians study how the AWM influenced public opinion.","zh":"一些历史学者研究反战运动（AWM）如何影响公众舆论。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., informal internet use) a shorthand for “Asian women,” often seen in dating or demographic discussions; use carefully because it can sound objectifying depending on context.","zh":"（缩写，网络非正式用法）“Asian women（亚洲女性）”的简写，常见于约会或人口统计讨论；因语境不同可能带有物化意味，使用时需谨慎。"},"examples":[{"en":"That forum uses AWM as a demographic label, but it can feel impersonal.","zh":"那个论坛把 AWM 当作人口标签使用，但可能显得不够尊重、很“冷冰冰”。"},{"en":"It’s clearer and more respectful to write “Asian women” in formal writing.","zh":"在正式写作中直接写 “Asian women（亚洲女性）”更清晰也更尊重。"}]}],"synonyms":["Australian War Memorial (full form)","anti-war movement (full form)"],"phonetic":"/ˌeɪˌdʌbəljuːˈɛm/","extraExplanation":["英文缩写 AWM 的含义非常依赖语境：在澳大利亚相关内容里最常指 Australian War Memorial；在政治/历史讨论里可能指 anti-war movement；在网络论坛里也可能作为族群/性别标签出现。阅读时可结合主题、地区与上下文判断。"]}
{"word":"awmbrie","summary":{"en":"“awmbrie” is not a recognized English word; it’s likely a misspelling (e.g., “Brie,” “Aubrey,” or “ombre”).","zh":"“awmbrie”不是常见英语词，可能是拼写错误（如“Brie”“Aubrey”或“ombre”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a username/brand name.","zh":"不是标准英语单词，可能是拼写错误，或是用户名/品牌名。"},"examples":[{"en":"I can’t find “awmbrie” in an English dictionary—could you share the sentence it comes from?","zh":"我在英语词典里找不到“awmbrie”，你能给我它所在的句子吗？"},{"en":"Did you mean “Brie” (the cheese) or “Aubrey” (a name)?","zh":"你是不是想写“Brie”（布里奶酪）或“Aubrey”（人名）？"}]}],"extraExplanation":["“awmbrie”看起来像拼写错误或自造词。最常见的接近词有：\n- **Brie**：一种法国软质奶酪（常见于菜单/超市）\n- **Aubrey**：常见英文名（男女皆可）\n- **ombré**（常写作 ombre）：“渐变色”的意思（时尚/发色/设计中常见；带重音符时是法语写法）\n如果你提供上下文（句子、领域、你想表达的中文意思），我可以更准确判断你要找的词。"]}
{"word":"awmous","summary":{"en":"“awmous” is not a standard English word; it’s probably a misspelling.","zh":"“awmous”不是标准英语单词；很可能是拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or typing error.","zh":"不是标准英语单词，可能是拼写或输入错误。"},"examples":[{"en":"I couldn’t find “awmous” in a dictionary—did you mean “anonymous,” “famous,” or “enormous”?","zh":"我在词典里找不到“awmous”——你是不是想写“anonymous（匿名的）”、“famous（著名的）”或“enormous（巨大的）”？"}]}],"extraExplanation":["“awmous”常见于把某个以 -mous 结尾的词打错/漏打字母（例如 anonymous, famous, enormous）。如果你把原句发我（包含前后文），我可以帮你确定你想表达的词，并解释正确用法与例句。"]}
{"word":"awn","summary":{"en":"An awn is a stiff bristle on the head/seed of some grasses or grains.","zh":"awn 指某些禾草或谷物种子（穗）上的硬刺状“芒”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a stiff, bristle-like part on some grasses or grains (such as wheat or barley), usually growing from the tip of the seed covering","zh":"（禾本科植物种子上的）芒；（小麦、大麦等的）芒刺"},"examples":[{"en":"Be careful—those dry grass awns can stick to your socks.","zh":"小心——那些干草的芒刺会扎进你的袜子里。"},{"en":"Barley has long awns that give the head a spiky look.","zh":"大麦有很长的芒，所以穗子看起来很刺。"},{"en":"The dog got an awn stuck in its fur after running through the field.","zh":"狗跑过草地后，有一根芒刺卡在了毛里。"}]}],"synonyms":["bristle","beard (of grain)","spike (informal)"],"phonetic":"/ɔn/","extraExplanation":["“awn”是植物学/农业里常见的词，指谷物或野草种子外层上长出的硬刺状结构。野外徒步时，某些草的芒刺容易黏在衣物或动物毛发上，甚至可能刺入皮肤。"]}
{"word":"awned","summary":{"en":"“Awned” means “having awns” or is the past form of “awn” (to develop/provide awns).","zh":"“awned”表示“具芒的”，也可作“awn（长芒/使具芒）”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “awn” (to grow or develop an awn, or to provide something with awns).","zh":"“awn”的过去式/过去分词（长出芒；或使……长芒/具芒）。"},"examples":[{"en":"By late summer, the barley had awned and turned golden.","zh":"到了夏末，大麦长出芒并变成金黄色。"},{"en":"The botanist noted that the seeds were awned, which helped them cling to animals.","zh":"植物学家注意到这些种子带芒，这有助于它们粘附在动物身上。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective) having an awn; tipped with a bristle-like extension (common in grasses and grains).","zh":"（形容词）具芒的；顶端带有针状/刚毛状延伸物的（常见于禾本科植物和谷物）。"},"examples":[{"en":"Some awned grasses can irritate a dog’s nose or ears if the awns get stuck.","zh":"有些具芒的草如果芒刺卡住，可能会刺激狗的鼻子或耳朵。"},{"en":"The awned spikelets are a key clue for identifying this species.","zh":"具芒的小穗是辨认该物种的重要线索。"}]}],"synonyms":["bearded (botany)","bristled","bristle-tipped"],"phonetic":"/ɔnd/","extraExplanation":["“芒（awn）”常见于大麦、燕麦等谷物以及许多野生禾草。它通常像细针或硬毛，能帮助种子传播（比如勾住动物毛发）或钻入土壤。日常英语里“awned”多见于植物学、农业或宠物护理（例如提醒狗狗避免芒刺扎入皮肤/耳道）。"]}
{"word":"awner","summary":{"en":"An uncommon noun related to “awn”: something that has or produces awns (bristle-like tips on grasses/grains).","zh":"一个较少见的名词，和“awn（芒）”相关：指带芒或会长出芒的东西。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant part (or a tool) that has awns, or something that produces awns (bristle-like tips on grasses and grains)","zh":"（植物学）有芒的部分（或带芒的工具）；能长出芒的东西（芒指禾本科植物或谷物上细长的刺状尖端）"},"examples":[{"en":"In some grasses, the awner helps the seed move and settle into soil.","zh":"在一些禾草中，“带芒结构”能帮助种子移动并钻入土壤。"},{"en":"This variety is an awner, with long, stiff bristles on the grain head.","zh":"这个品种是“带芒的”，穗上有又长又硬的刺状芒。"}]}],"synonyms":["awned plant","awn-bearing (as an adjective)"],"phonetic":"/ˈɔnɚ/","extraExplanation":["“awner”比较少见，多出现在植物学或农学语境里；更常见的基础词是“awn”（芒、芒刺）。","注意不要和“owner”（物主、主人）混淆：拼写不同、意思完全不同，但读音在美式英语里可能很接近。"]}
{"word":"awning","summary":{"en":"An awning is an outside cover that sticks out from a building or vehicle to give shade or shelter.","zh":"awning 指从建筑或车辆外伸的遮阳/挡雨篷，用来提供阴凉或遮蔽。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cover made of cloth, plastic, or metal that extends from a building or vehicle to provide shade and protection from sun or rain","zh":"（建筑物或车辆外伸的）遮阳篷；雨篷"},"examples":[{"en":"We sat under the awning to stay out of the rain.","zh":"我们坐在遮阳篷下躲雨。"},{"en":"The café’s striped awning made the entrance easy to spot.","zh":"咖啡馆的条纹遮阳篷让入口很容易被看到。"},{"en":"Please retract the awning when the wind gets strong.","zh":"风大时请把遮阳篷收起来。"}]},{"partOfSpeech":"v.","definition":{"en":"to provide or cover with an awning","zh":"给……安装遮阳篷；用遮阳篷遮住"},"examples":[{"en":"They awninged the patio to create more shade.","zh":"他们给露台装了遮阳篷来增加阴凉。"},{"en":"The shop was awninged in bright blue fabric.","zh":"这家店用亮蓝色布料的遮阳篷遮着。"}]}],"synonyms":["canopy","overhang","sunshade"],"phonetic":"/ˈɔːnɪŋ/","extraExplanation":["“awning”常见于街景与商铺语境（如café/shop/storefront awning）。在美式英语里，住宅常见“retractable awning”（可伸缩遮阳篷），房车/露营车上也常见“RV awning”。","易混词：awning（外伸的遮阳/挡雨装置） vs. canopy（更像“顶棚/篷盖”，可能独立支撑或覆盖更大面积） vs. umbrella（伞）。"]}
{"word":"awninged","summary":{"en":"“Awninged” means “having an awning” or “shaded/covered by an awning.”","zh":"“awninged”表示“有遮篷的”或“被遮篷遮盖/遮阴的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Having an awning; covered or shaded by an awning.","zh":"（罕见）有遮篷的；被遮篷覆盖或遮阴的。"},"examples":[{"en":"We sat in the awninged patio, out of the midday sun.","zh":"我们坐在有遮篷的露台下，避开正午的太阳。"},{"en":"An awninged shopfront kept the window display cool.","zh":"带遮篷的店面让橱窗陈列保持凉爽。"}]}],"synonyms":["awning-covered","canopied","shaded"],"phonetic":"/ˈɔnɪŋd/","extraExplanation":["“awninged”是由名词“awning（遮篷/雨篷）”加形容词后缀“-ed”构成，意思是“带有……的/被……覆盖的”。在现代英语里更常见的表达是“with an awning”“under an awning”或“awning-covered”。","这种词形有一点文学/描写风格（descriptive），偶尔出现在叙述环境、建筑或街景的文字中。"]}
{"word":"awnings","summary":{"en":"Awnings are coverings that extend outward to provide shade and shelter, commonly over doors, windows, or outdoor seating.","zh":"Awnings 指向外伸出的遮篷/雨篷，用来遮阳挡雨，常见于门窗或户外座位上方。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cover (usually made of fabric, metal, or plastic) that extends from the outside of a building to provide shade and protection from sun or rain.","zh":"（通常由布、金属或塑料制成的）遮篷；雨篷（从建筑外墙伸出，用来遮阳或挡雨）。"},"examples":[{"en":"They installed an awning over the front door to keep the rain off the steps.","zh":"他们在前门上方装了一个雨篷，这样雨就不会打湿台阶。"},{"en":"The café’s striped awnings made the outdoor seating more comfortable in the heat.","zh":"咖啡馆的条纹遮篷让户外座位在炎热天气里更舒服。"}]},{"partOfSpeech":"n.","definition":{"en":"A shade or protective cover on a vehicle, such as an RV or a boat.","zh":"（车辆或船只上的）遮篷（如房车或船的遮阳/挡雨装置）。"},"examples":[{"en":"We rolled out the RV awning before cooking outside.","zh":"我们在户外做饭前把房车遮篷放了出来。"},{"en":"The boat has an awning to block the afternoon sun.","zh":"这艘船有遮篷，可以挡住下午的太阳。"}]}],"synonyms":["canopy","overhang","shade","sunshade"],"phonetic":"/ˈɔːnɪŋz/","extraExplanation":["“Awning”常见于店面或咖啡馆外墙：如“storefront awning（店面遮篷）”“retractable awning（可伸缩遮篷）”。在美国街景里，带条纹的遮篷常让人联想到传统小店或餐馆的门面风格。"]}
{"word":"awnless","summary":{"en":"Awnless means “without an awn,” especially describing certain grasses or grains.","zh":"awnless 意为“无芒的”，常用于描述某些禾草或谷物没有芒刺。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having no awn (no bristle-like “beard” on a seed or flower part, especially in grasses).","zh":"（植物学）无芒的；没有芒的（芒指禾本科植物种子或花部上的针状/刺毛状“芒刺”）。"},"examples":[{"en":"The breeder selected awnless wheat to make harvesting easier.","zh":"育种者选择无芒小麦，以便更容易收割。"},{"en":"Awnless varieties are often preferred because they are less irritating to livestock.","zh":"无芒品种常更受欢迎，因为对牲畜的刺激更小。"}]}],"synonyms":["unawned","beardless (in botany/agriculture)"],"phonetic":"/ˈɔn.ləs/","extraExplanation":["“awnless”主要用于农业和植物学语境，常见搭配有：awnless wheat（无芒小麦）、awnless barley（无芒大麦）。","“芒（awn）”是禾本科植物常见的细长硬刺，可能会扎手、刺激动物口鼻或影响加工，因此无芒品种在饲用、收割和处理上有时更方便。"]}
{"word":"awnlike","summary":{"en":"Awnlike describes something that looks like a stiff bristle (an awn) found on grasses.","zh":"awnlike 表示“像芒刺一样的、芒状的（细长坚硬的刺）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling an awn (a stiff bristle or “beard” on the seed head of many grasses).","zh":"像芒（许多禾本科植物种子或穗上坚硬的刺状“芒针/芒刺”）的。"},"examples":[{"en":"Under a magnifying glass, the grass seeds show awnlike bristles that help them cling to fur.","zh":"在放大镜下，这些草籽能看到芒状的细刺，有助于黏在动物毛上。"},{"en":"The plant has awnlike tips along the husk.","zh":"这株植物的外壳边缘有芒状的尖端。"}]}],"synonyms":["bristly","needlelike","spiky","bearded"],"phonetic":"/ˈɔnˌlaɪk/","extraExplanation":["“awn”是植物学词，常指禾本科（如小麦、燕麦、狗尾草）穗或籽粒上那种细长、硬、尖的芒刺。日常英语里不常单独用“awnlike”，多见于植物描述、野外观察笔记或科普文章。"]}
{"word":"awns","summary":{"en":"Awns are the stiff bristles on the seed heads of certain grasses and grains.","zh":"awns 指某些禾草/谷物穗上用于护种或传播的硬刺状“芒”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Awns: stiff, hair-like bristles that grow from the tips or backs of some grasses and grains (such as barley), often helping the plant protect or spread its seeds.","zh":"芒（复数）：一些禾本科植物（如大麦）穗上长出的细长硬刺/芒刺，常用于保护或传播种子。"},"examples":[{"en":"Barley awns can feel sharp if you run your hand along the head of the plant.","zh":"大麦的芒刺摸起来可能很扎手。"},{"en":"The dry awns help the seeds catch on animals and spread to new places.","zh":"干燥的芒刺能让种子粘在动物身上，从而传播到新的地方。"},{"en":"Some varieties are bred to have shorter awns for easier harvesting.","zh":"有些品种会育种成较短的芒刺，以便更容易收割。"}]}],"synonyms":["bristles","spikes (informal)","beards (of grain, informal)"],"phonetic":"/ɔn/","extraExplanation":["“awn”常见于植物学/农业语境，指谷物或野草穗上的“芒”。在中文里常说“麦芒、稻芒”。","在文学或描写性写作中，awns 有时用来营造“干燥、粗糙、带刺”的触感意象（例如秋天草穗刮过衣袖的感觉）。"]}
{"word":"awny","summary":{"en":"Awny describes a warm yellow-brown or orange-brown color, often used in poetic or descriptive writing.","zh":"awny 指带暖调的黄褐色/赤褐色，常用于较具描写性或文学性的表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a warm, light brown or orange-brown color (often used for hair, skin, animals, or light).","zh":"赤褐色的；黄褐色的（常形容头发、皮肤、动物毛色或光线的暖棕色）。"},"examples":[{"en":"In the afternoon sun, the hills looked awny and dry.","zh":"在午后的阳光下，山丘看起来呈黄褐色，很干燥。"},{"en":"She has awny hair that turns golden in summer.","zh":"她的头发是赤褐色的，夏天会变得更金黄。"},{"en":"The deer’s awny coat blends into the forest.","zh":"鹿的黄褐色皮毛与森林环境融为一体。"}]}],"synonyms":["tawny","tan","amber","golden-brown"],"phonetic":"/ˈɔni/","extraExplanation":["“awny”是比较文学、描写性较强的颜色词，比常见的“brown / tan”更带有“暖、带橘调的黄褐色”的感觉，常见于描写自然景色、动物毛色或光线氛围的文字。","词源上与“awn”（谷物穗上细长的芒）有关，因此也会让人联想到“成熟麦穗/干草”的色调与质感。"]}
{"word":"awoke","summary":{"en":"“Awoke” is the past tense of “awake,” meaning “woke up,” and it can also mean “became aware” in a more literary style.","zh":"“awoke”是“awake”的过去式，意思是“醒来”；也可（较书面/文学）表示“意识到、觉察到”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Simple past tense of “awake”: to wake up from sleep.","zh":"“awake”的一般过去式：从睡眠中醒来。"},"examples":[{"en":"I awoke at dawn and heard birds outside.","zh":"我在黎明时醒来，听到外面有鸟叫。"},{"en":"She awoke suddenly when the phone rang.","zh":"电话一响，她突然醒了。"}]},{"partOfSpeech":"v.","definition":{"en":"To become aware of something; to realize or “awaken” to a feeling or idea (more literary).","zh":"意识到、领悟到某事；对某种感受或想法“觉醒”（更偏文学/书面语）。"},"examples":[{"en":"He awoke to the fact that he had been misled.","zh":"他意识到自己被误导了。"},{"en":"Over time, the town awoke to new possibilities.","zh":"随着时间推移，这座小镇意识到新的可能性。"}]}],"synonyms":["woke up","awakened","roused"],"phonetic":"/əˈwoʊk/","extraExplanation":["“awoke”比较常见于书面语或叙述性文字（如小说、故事），日常口语里更常说“woke up”。例如：口语更自然是“I woke up late.”；叙事写作可能用“I awoke to silence.”来营造氛围。","常见搭配：awoke to + 名词/事实（awoke to the truth / awoke to danger）；awoke with + 感受（awoke with a headache 我醒来时头痛）。","相关形式：awake（原形/形容词“醒着的”），awaken（更正式/文学），awoken（过去分词，用于完成时：I have awoken / I have woken up）。"]}
{"word":"awoken","summary":{"en":"“Awoken” is the past participle of “awake,” meaning “woken up” or “made aware,” often used in more formal or literary English.","zh":"“awoken”是“awake”的过去分词，表示“醒来/被叫醒”或“被唤起意识”，语气较正式或文学化。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"the past participle of “awake,” meaning “woken up” or “made aware.”","zh":"“awake”的过去分词，意思是“醒来/被叫醒的”，或“被唤起意识、察觉到的”。"},"examples":[{"en":"I had awoken early and couldn’t fall back asleep.","zh":"我很早就醒了，怎么也睡不着。"},{"en":"She was awoken by a loud noise outside.","zh":"她被外面的巨响吵醒了。"},{"en":"The film left me awoken to how unfair the system can be.","zh":"那部电影让我意识到制度可能有多么不公平。"}]},{"partOfSpeech":"v.","definition":{"en":"a past participle used with “have/has/had” to form perfect tenses of “awake.”","zh":"作过去分词，与“have/has/had”连用，构成“awake”的完成时。"},"examples":[{"en":"He has awoken from his nap.","zh":"他已经从小睡中醒来了。"},{"en":"By the time I arrived, they had already awoken.","zh":"等我到的时候，他们已经醒了。"}]}],"synonyms":["woken","awakened","roused (from sleep)","alerted (to a fact)"],"phonetic":"/əˈwoʊkən/","extraExplanation":["“awoken”常见于较正式或文学化的表达；日常口语里更常用“woken”（wake 的过去分词）或直接用“woke”（过去式）。","“awake”的形式变化：awake（原形）/ awoke（过去式）/ awoken（过去分词）。注意“awaken”也是相关动词：awaken / awakened / awakened，语气也偏正式。"]}
{"word":"AWOL","summary":{"en":"AWOL means absent without permission, originally a military term.","zh":"AWOL 指“未经许可缺席/擅自离岗”，源自军事用语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Absent without official permission; without authorization (often used about soldiers, students, or employees).","zh":"未获正式许可而缺席；擅自离岗/缺勤（常用于军人、学生或员工）。"},"examples":[{"en":"Two soldiers were reported AWOL after they missed roll call.","zh":"两名士兵点名时没到，被通报为擅自离队（AWOL）。"},{"en":"He’s been AWOL from work all week without calling in.","zh":"他一整周都没来上班，也没请假或打电话说明。"}]},{"partOfSpeech":"v.","definition":{"en":"To be absent without permission.","zh":"未经许可而缺席；擅自离岗/离队。"},"examples":[{"en":"If you AWOL from the unit, you can face serious consequences.","zh":"如果你擅自离队，可能会面临严重后果。"}]}],"synonyms":["absent without leave","unauthorized absence","missing (informal)","absent (general)"],"phonetic":"/ˈeɪ.wɑːl/","extraExplanation":["AWOL 是缩写，来自美军用语 “Absent Without Leave”（未经批准擅自缺席/离队）。在新闻或口语里也会泛指“人突然消失、不告而别”。","语气上常带有“失职/违规”的暗示：比单纯的 absent 更严厉。用于日常场景时要注意语境，避免不必要的指责。"]}
{"word":"awol","summary":{"en":"AWOL means absent without permission, especially from military duty; informally it can mean missing or absent unexpectedly.","zh":"AWOL 指“未经许可缺席/擅自离队”，原本多用于军事语境；口语中也可指“突然不见、缺席”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"absent from one’s military unit or duty without permission (a serious offense).","zh":"（军队/执勤）未经许可擅自离队、离岗（严重违纪/违法）。"},"examples":[{"en":"The soldier was reported AWOL after missing roll call for two days.","zh":"那名士兵两天没参加点名，被报告为 AWOL（擅自离队）。"},{"en":"Going AWOL can lead to military punishment.","zh":"擅自离队可能会受到军法惩处。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) missing or not where you should be; absent without explanation.","zh":"（非正式）不见了；（该出现却）缺席、失踪。"},"examples":[{"en":"My phone went AWOL somewhere between the café and the subway.","zh":"我的手机在咖啡馆到地铁之间的路上“不见了”。"},{"en":"Two team members were AWOL on the day of the presentation.","zh":"演示当天有两名队员缺席了。"}]},{"partOfSpeech":"adv.","definition":{"en":"without permission; in a state of being absent.","zh":"未经许可地；处于擅离/缺席状态。"},"examples":[{"en":"He has been AWOL since Monday.","zh":"他从周一开始就一直擅自缺席。"}]}],"synonyms":["absent without leave","missing","absent","gone"],"phonetic":"/ˈeɪ.wɔl/","extraExplanation":["AWOL 是缩写，来自美军用语 “Absent Without Leave”（未经批准离队）。在美国语境里，它常和军事纪律联系在一起，因此在正式场合用来形容军人更贴切。","在日常口语中，AWOL 被扩展为“突然不见/缺席”，带一点幽默或责备的语气。常见搭配：go AWOL（突然消失/擅自离开），be AWOL（处于缺席状态）。","书面语里有时会写作 A.W.O.L.，但现代写法多为 awol/AWOL。"]}
{"word":"Awolowo","summary":{"en":"Awolowo usually refers to Obafemi Awolowo, an influential Nigerian nationalist and politician.","zh":"Awolowo通常指尼日利亚重要民族主义者与政治人物奥巴费米·阿沃洛沃。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Obafemi Awolowo (1909–1987), a major Nigerian nationalist, lawyer, writer, and politician, widely regarded as a key leader of the Yoruba people and an influential figure in Nigeria’s independence era and early post-independence politics.","zh":"奥巴费米·阿沃洛沃（Obafemi Awolowo，1909–1987）：尼日利亚重要的民族主义者、律师、作家与政治人物，常被视为约鲁巴民族的关键领袖之一，也是尼日利亚独立前后早期政治的重要影响者。"},"examples":[{"en":"In Nigerian political history, Awolowo is often discussed alongside other independence-era leaders.","zh":"在尼日利亚政治史中，人们常把阿沃洛沃与其他独立时期的领袖一起讨论。"},{"en":"Our class read an excerpt from Awolowo’s writings on governance and education.","zh":"我们课堂读了一段阿沃洛沃关于治理与教育的著作选段。"}]}],"synonyms":["Obafemi Awolowo","Chief Awolowo"],"phonetic":"/ɑːwəˈloʊwoʊ/","extraExplanation":["“Awolowo”通常在英文语境中指人名（专有名词），而不是普通词汇，因此一般不用于变形或派生。","在尼日利亚文化与公共讨论中，他常与教育改革、社会福利理念、地区政治与联邦制等议题联系在一起。","在书面语中，你也可能看到缩写或称呼如“Chief Awolowo”（酋长/首领阿沃洛沃，属尊称）或“Obafemi Awolowo”。"]}
{"word":"awols","summary":{"en":"AWOLs means repeated cases (or sometimes people) of being absent without permission; it comes from the military term AWOL.","zh":"AWOLs 指多次“未经许可擅自离岗/无故缺勤”的情况（有时也指这些人），源自军事缩写 AWOL。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of AWOL; instances of being absent from duty or work without permission (originally a military term).","zh":"AWOL 的复数；指未经许可擅自离岗/缺勤的情况（原本是军事用语）。"},"examples":[{"en":"The report shows three AWOLs this month in the unit.","zh":"报告显示这个月该分队有三次擅自离岗的记录。"},{"en":"HR is tracking repeated AWOLs as a serious policy violation.","zh":"人力资源部门把反复无故缺勤（AWOLs）视为严重违反规定。"}]},{"partOfSpeech":"n.","definition":{"en":"people who are AWOL; individuals absent without permission (less common).","zh":"擅自离岗的人、无故缺勤的人（较不常见）。"},"examples":[{"en":"The commander ordered the AWOLs to return immediately.","zh":"指挥官命令那些擅自离岗的人立刻归队。"}]}],"synonyms":["unauthorized absences","unexcused absences","absences without leave"],"phonetic":"/ˈeɪˌwɔl/","extraExplanation":["AWOL 是缩写，来自 military phrase “Absent Without Leave”（未经批准擅自离岗）。在日常英语里也常用来形容“人突然不见/没来”，但正式场合（军队、公司制度）语气更严肃。","常见用法：be AWOL（adj./adv. 用法），例如：He’s been AWOL for two days. 你输入的 “awols” 通常是把 AWOL 当名词来数次数（AWOLs）。"]}
{"word":"awonder","summary":{"en":"Wonder can mean a feeling of amazement/curiosity, an amazing thing, or the verb “to be curious/ask yourself.”","zh":"Wonder 可以表示“惊叹/好奇的感觉”、“奇迹般的事物”，也可以作动词表示“想知道/感到好奇”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(noun) A feeling of surprise and curiosity, often mixed with admiration, when you see or think about something new, beautiful, or hard to explain.","zh":"（名词）对新奇、美好或难以解释的事物产生的惊奇与好奇，常带有赞叹。"},"examples":[{"en":"The children looked at the stars with wonder.","zh":"孩子们带着惊叹望着星星。"},{"en":"It’s a moment of pure wonder.","zh":"那是一个纯粹令人惊叹的时刻。"}]},{"partOfSpeech":"n.","definition":{"en":"(noun) A remarkable or amazing person or thing.","zh":"（名词）奇迹般的人或事物；令人惊叹的东西。"},"examples":[{"en":"The ancient temple is a wonder of engineering.","zh":"这座古老的寺庙是工程学的奇迹。"},{"en":"She’s a wonder at solving puzzles.","zh":"她解谜非常厉害，简直是个奇才。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb) To feel curious or to think about something and want to know more; to ask yourself a question.","zh":"（动词）感到好奇；想弄清楚；心里在问。"},"examples":[{"en":"I wonder what time the store closes.","zh":"我想知道商店几点关门。"},{"en":"She wondered if he was telling the truth.","zh":"她在想他是不是在说实话。"},{"en":"“I wonder…” he said quietly.","zh":"“我在想……”他轻声说道。"}]}],"synonyms":["amazement","awe","marvel","curiosity","astonishment"],"phonetic":"/ˈwʌndɚ/","extraExplanation":["你输入的“awonder”通常不是标准拼写，更常见的是分开写成短语 “a wonder”（一个奇迹/一件令人惊叹的事）。例如：It’s a wonder you made it on time.（你居然准时到了，真是奇迹。）","常见句型：I wonder + wh- 从句（我想知道……）；I wonder if/whether…（我在想是否……）。在礼貌表达中，“I wonder if you could…” 常用来委婉提出请求：I wonder if you could help me.（不知你能否帮我一下。）"]}
{"word":"awork","summary":{"en":"Awook (awork) is an old-fashioned word meaning “working” or “in operation,” often used in phrases like “set someone awork.”","zh":"“awork”是较古老的表达，意思是“在工作中/在运转”，常见于“set someone awork”等搭配。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(archaic or literary) Working; in operation; actively doing something.","zh":"（古语或文学用语）在工作中；在运转；积极忙着做某事。"},"examples":[{"en":"By dawn, the whole village was awork in the fields.","zh":"天一亮，全村人都在田里忙开了。"},{"en":"Once the plan is approved, we’ll set the team awork immediately.","zh":"计划一旦获批，我们就会立刻让团队开始干起来。"},{"en":"You can hear the machines awork behind the wall.","zh":"你能听到墙后机器在运转。"}]}],"synonyms":["at work","working","busy","in operation"],"phonetic":"/əˈwɝːk/","extraExplanation":["“awork”相当于“at work / in operation”，现在较少单独使用，更常见于固定搭配“set/put (someone) awork”（让某人开始工作）或描写性的文学语境。日常口语中通常直接说“at work”“working”“busy”。","拼写提示：它不是常见的现代单词“a work”（一件作品/一项工作）。比如：a work of art（一件艺术作品）。"]}
{"word":"aworry","summary":{"en":"“aworry” means “worried; anxious,” often in old-fashioned or dialect style (also written “a-worry”).","zh":"“aworry”表示“担心的、焦虑的”，多见于较旧或方言风格（也常写作“a-worry”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"worried; anxious (often used in older, poetic, or dialect writing, sometimes written as “a-worry”).","zh":"担心的；焦虑的（常见于较旧、诗歌或方言用法，也常写作“a-worry”）。"},"examples":[{"en":"Don’t go aworry about it—we’ll figure it out.","zh":"别为这事儿担心——我们会想办法解决的。"},{"en":"She sat by the window, aworry for her son’s safe return.","zh":"她坐在窗边，担心儿子能平安归来。"}]},{"partOfSpeech":"adv.","definition":{"en":"in a worried way; anxiously (less common; usually appears in set, old-fashioned phrasing).","zh":"以担忧的方式；焦虑地（较少见，多出现在固定的旧式表达中）。"},"examples":[{"en":"He kept looking at the clock, aworry and restless.","zh":"他不停地看钟，焦虑又坐立不安。"}]}],"synonyms":["worried","anxious","concerned","uneasy"],"phonetic":"/əˈwɝi/","extraExplanation":["“aworry / a-worry”里的 a- 是英语里较古老的一种前缀用法（类似 a-going, a-coming），在民谣、圣经风格、乡村/方言写作中更常见。现代日常英语通常直接说 “worried / anxious”。"]}
{"word":"aworth","summary":{"en":"“Aworth” is an archaic form of “worth,” meaning valuable or deserving.","zh":"“aworth”是“worth”的古语形式，表示“有价值/值得、配得上”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(archaic/obsolete) worth; having value; worthy of something.","zh":"（古语/已废用）值得的；有价值的；配得上的。"},"examples":[{"en":"In some older writings, “aworth” is used where we would now say “worth.”","zh":"在一些较早的文章里，“aworth”会用在我们现在会说“worth”的地方。"},{"en":"This book is aworth reading if you enjoy history. (modern English: “worth reading”)","zh":"如果你喜欢历史，这本书值得一读。（现代英语：worth reading）"}]}],"synonyms":["worth","worthy","valuable"],"phonetic":"/əˈwɝθ/","extraExplanation":["“aworth”不是现代标准英语中的常用拼写，通常只会在中古英语、方言或仿古文风里看到。学习与使用时，日常写作几乎一律用“worth / worthy”。","词首的 a- 在古英语/中古英语里有时可表示“处于某种状态”（类似 asleep, afloat）。在“aworth”里可理解为一种古拼写/古形态，而不是现代可自由添加的前缀。"]}
{"word":"awreak","summary":{"en":"“awreak” is not a standard word; you probably mean “wreak,” meaning “to cause (especially damage) or inflict (revenge).”","zh":"“awreak”不是标准单词；你可能想写“wreak”，意思是“造成（尤指破坏/伤害）或施加（报复）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Likely intended: “wreak”) to cause something (especially harm, damage, or a strong effect) to happen; to inflict.","zh":"（你可能想写的是：wreak）造成（尤指伤害、破坏或强烈影响）；施加（报复等）。"},"examples":[{"en":"The storm wreaked havoc on the coastline.","zh":"这场暴风雨对海岸造成了严重破坏。"},{"en":"He vowed to wreak revenge on those who betrayed him.","zh":"他发誓要向背叛他的人报仇。"},{"en":"Careless rumors can wreak real damage to someone’s reputation.","zh":"不负责任的谣言会对一个人的名誉造成真实的伤害。"}]}],"synonyms":["cause","inflict","bring about","unleash"],"phonetic":"/rik/","extraExplanation":["“awreak”不是常见英文单词，最可能是把 **wreak** 拼错了。","**wreak** 常和 **havoc** 搭配（wreak havoc = “造成大破坏/大混乱”），这是非常固定、很常见的表达。","易混淆：**wreak**（造成/施加） vs **wreck**（毁坏；残骸）。例如：wreak havoc（造成破坏）；The car was wrecked（车被撞坏了）。"]}
{"word":"awreck","summary":{"en":"“a wreck” means being in terrible condition (especially emotionally) or something badly damaged.","zh":"“a wreck”表示（尤其情绪上）状态很糟/崩溃，或某物严重损坏、破败不堪。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"in a very bad physical or emotional condition; extremely upset, tired, or damaged (often said as “a wreck” or “an emotional wreck”).","zh":"身心状况很糟；非常沮丧、疲惫或受创（常说“a wreck / an emotional wreck”）。"},"examples":[{"en":"After the exam, I was a wreck and just wanted to sleep.","zh":"考完试后我整个人都崩溃了，只想睡觉。"},{"en":"He was an emotional wreck after the breakup.","zh":"分手后他情绪几乎崩溃。"},{"en":"I’m a wreck without coffee in the morning.","zh":"早上没咖啡我就状态很差。"}]},{"partOfSpeech":"phrase","definition":{"en":"a person or thing that is badly damaged or in poor shape (literal or figurative).","zh":"严重损坏、状况很差的人或物（可指字面或比喻）。"},"examples":[{"en":"The old bike is a wreck, but it still moves.","zh":"那辆旧自行车都快散架了，但还能骑。"},{"en":"After the storm, the house was a wreck.","zh":"暴风雨过后，房子被毁得不成样子。"}]}],"synonyms":["a mess","in bad shape","devastated","broken","ruined"],"phonetic":"/ə rɛk/","extraExplanation":["“awreck”通常不是标准拼写。更常见的写法是分开写成 “a wreck”。如果你想表达“失事/残骸”，单独用名词 “wreck” 也很常见：a shipwreck（沉船/海难）。"]}
{"word":"awrist","summary":{"en":"Awrist is a rare word meaning “on/around the wrist.”","zh":"awrist 是一个较少见的词，意思是“在手腕上/绕在手腕周围”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(rare) On the wrist; around the wrist.","zh":"（罕见）在手腕上；绕在手腕周围。"},"examples":[{"en":"He wore the string awrist like a simple bracelet.","zh":"他把那根绳子戴在手腕上，就像一条简单的手链。"},{"en":"She tied the ribbon awrist to remember the promise.","zh":"她把丝带系在手腕上，用来提醒自己那个承诺。"}]}],"synonyms":["on the wrist","around the wrist"],"phonetic":"/əˈrɪst/","extraExplanation":["“awrist”是比较少见、带有古风/文学色彩的用法，结构上类似“abed（在床上）”“aboard（在船上/在车上）”这种以a-开头表示“在……状态/位置”的词。现代英语里更常用的表达是“on his/her wrist”或“around the wrist”。","如果你本来想查的是常用词“wrist（手腕）”，也可以告诉我，我可以给你更常见的用法和搭配（如 sprained wrist、wristwatch 等）。"]}
{"word":"awrong","summary":{"en":"Wrong means not correct or not morally right; it can also mean an unfair action or, as an adverb, in an incorrect way.","zh":"Wrong 表示“不正确/不对（道德上也可）”；也可作名词指“不公或错事”，作副词表示“错误地”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not correct; not true; not appropriate or morally right.","zh":"错误的；不正确的；不合适的；（道德上）不对的"},"examples":[{"en":"Your answer is wrong.","zh":"你的答案是错的。"},{"en":"It feels wrong to lie to a friend.","zh":"对朋友撒谎感觉不对。"},{"en":"If I’m wrong, please correct me.","zh":"如果我错了，请纠正我。"}]},{"partOfSpeech":"n.","definition":{"en":"A bad or unfair action; something harmful done to someone.","zh":"不公正的行为；伤害他人的事；过错"},"examples":[{"en":"They tried to right the wrongs of the past.","zh":"他们试图纠正过去的不公。"},{"en":"He apologized for the wrong he had done.","zh":"他为自己做过的错事道歉。"}]},{"partOfSpeech":"adv.","definition":{"en":"In an incorrect way; wrongly.","zh":"错误地；不正确地"},"examples":[{"en":"I guessed wrong.","zh":"我猜错了。"},{"en":"The package was delivered wrong.","zh":"包裹送错了（方式/地点）。"}]}],"synonyms":["incorrect","mistaken","false","unfair","immoral"],"phonetic":"/rɔŋ/","extraExplanation":["“awrong”通常不是英语单词，常见情况是把“a wrong”（一个错误/一件不公正的事）连写了，或是把“wrong”拼错了。","“a wrong”里“wrong”多作名词使用，表示“一个错误/一件不公”；例如：That decision was a wrong that hurt many people.（那个决定是一种不公，伤害了很多人。）"]}
{"word":"awry","summary":{"en":"Awry means “wrong or not as planned,” and it can also mean “crooked or not straight,” often used in the phrase “go awry.”","zh":"Awry 表示“出错、未按计划进行”，也可表示“歪斜、不直”，常用于短语 go awry。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not in the expected or correct way; wrong or out of order","zh":"不如预期的；出错的；走样的"},"examples":[{"en":"Our plans went awry when the train was canceled.","zh":"火车取消后，我们的计划就泡汤了。"},{"en":"The schedule is a bit awry, so we’ll start later.","zh":"时间安排有点乱，所以我们会晚点开始。"}]},{"partOfSpeech":"adv.","definition":{"en":"away from a straight line; crooked or not aligned","zh":"偏离直线的；歪斜的；不对齐的"},"examples":[{"en":"His tie was awry after the long flight.","zh":"长途飞行后，他的领带歪了。"},{"en":"The picture frame hung slightly awry on the wall.","zh":"墙上的相框挂得有点歪。"}]}],"synonyms":["wrong","off","out of order","misaligned","crooked"],"phonetic":"/əˈraɪ/","extraExplanation":["“go awry”是最常见搭配，意思是“出岔子/出问题/不按计划进行”。在较正式或书面语中也常见。","词源上与“wry（扭曲的、歪的）”有关，因此既可形容事情“变糟/出错”，也可形容物体“歪斜”。"]}
{"word":"Awshar","summary":{"en":"“Awshar” isn’t a common English vocabulary word; it’s likely a name or a misspelling. Share a sentence or intended meaning for an accurate match.","zh":"“Awshar”不是常见英语词汇；更可能是名字或拼写有误。请给出原句或想表达的意思，我可以帮你找到正确词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a proper name (e.g., a person’s name) or a misspelling/variant of another word.","zh":"不是标准英语词汇；更可能是专有名词（如人名/地名）或某个单词的拼写错误/变体。"},"examples":[{"en":"I couldn’t find “Awshar” in a standard English dictionary—do you mean a name or another word?","zh":"我在常见英语词典里找不到“Awshar”——你是指人名，还是想写另一个单词？"},{"en":"If “Awshar” is a name, its meaning depends on the language and culture it comes from.","zh":"如果“Awshar”是名字，它的含义取决于其来源语言与文化。"}]}],"extraExplanation":["“Awshar”很可能是：\n1）人名/网名（这种情况下英语词典通常不会收录）；\n2）拼写接近但不同的英文词。你可以告诉我它出现在哪个句子里，或你想表达的中文意思，我就能帮你定位最可能的正确词。\n\n常见的相近拼写/读音候选（仅供你对照）：\n- “OSHA”（美国职业安全与健康管理局的缩写）\n- “Awh” 或 “Aw”（表示感叹/犹豫的语气词）\n- “ashore”（在岸上；拼写不一样但有时口语听感会混）"]}
{"word":"awshar","summary":{"en":"“awshar” is not a recognized English word; it’s likely a misspelling or a name.","zh":"“awshar”不是常见英语单词；更可能是拼写错误或名字。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a misspelling, a username, or a personal/place name.","zh":"不是标准英语单词；更可能是拼写错误、用户名，或人名/地名。"},"examples":[{"en":"I couldn’t find “awshar” in an English dictionary—did you mean a different word?","zh":"我在英语词典里找不到“awshar”——你是不是想写另一个词？"},{"en":"If “Awshar” is a name, the spelling and pronunciation can vary by language.","zh":"如果“Awshar”是名字，不同语言里的拼写和读法可能会不一样。"}]}],"phonetic":"ˈɑʃɑr","extraExplanation":["“awshar”看起来不像常见英语词汇，更像：\n1）把别的英文词打错了；或\n2）某种语言（如阿拉伯语、南亚语言等）的音译名字/地名。\n\n你可以告诉我你想表达的意思、它出现的句子，或你想查的正确拼写，我就能给出准确释义。","你可能想查的相近英文词（请确认拼写）：\n- washer（洗衣机；垫圈）\n- ashlar（精加工的方石；建筑用石材）\n- Oscar（奥斯卡；人名）"]}
{"word":"AWST","summary":{"en":"AWST is the abbreviation for Australian Western Standard Time (UTC+8), used in Western Australia.","zh":"AWST是“澳大利亚西部标准时间”的缩写（UTC+8），用于西澳大利亚州。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Australian Western Standard Time: the standard time used in Western Australia (UTC+8).","zh":"澳大利亚西部标准时间：西澳大利亚州使用的标准时间（UTC+8）。"},"examples":[{"en":"The meeting starts at 9:00 AM AWST.","zh":"会议在澳大利亚西部标准时间（AWST）上午9点开始。"},{"en":"Perth operates on AWST, which is UTC+8.","zh":"珀斯使用AWST，也就是UTC+8。"}]}],"synonyms":["Australian Western Standard Time","UTC+8"],"phonetic":"/ˌeɪ dʌbəl.juː ˌɛs ˈtiː/","extraExplanation":["AWST常见于航班、线上会议、客服时间与国际日程中，通常指西澳（含珀斯）所在时区的标准时间。","注意：有时你会看到“WST”（Western Standard Time），但它在不同国家可能指不同地区；写“AWST”更明确是“澳大利亚西部标准时间”。"]}
{"word":"AWU","summary":{"en":"AWU is an initialism with multiple possible meanings; commonly it refers to an Academic Writing Unit in university settings.","zh":"AWU是有多种可能含义的首字母缩写；在大学语境中常指Academic Writing Unit（学术写作支持部门）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation/initialism for different names (the exact meaning depends on context). Often read as the letters “A-W-U.”","zh":"缩写/首字母词（具体含义取决于语境），通常按字母读作“A-W-U”。"},"examples":[{"en":"What does AWU stand for in this email?","zh":"这封邮件里的AWU代表什么？"},{"en":"Different schools use AWU in different ways, so check the document title or sender.","zh":"不同学校对AWU的用法可能不同，所以要看文件标题或发件人来判断。"}]},{"partOfSpeech":"other","definition":{"en":"(common in universities) Academic Writing Unit: a department that helps students improve academic writing.","zh":"（高校中常见）Academic Writing Unit：为学生提供学术写作支持的部门/单位。"},"examples":[{"en":"I booked an appointment with the AWU to work on my essay.","zh":"我预约了AWU来修改我的论文。"},{"en":"The AWU offers workshops on citation and paragraph structure.","zh":"AWU会开设关于引用格式和段落结构的工作坊。"}]},{"partOfSpeech":"other","definition":{"en":"(in sports/organizations) a set of initials for a union/association name, e.g., Asia Wrestling Union in some contexts.","zh":"（体育/组织语境）某个联盟或协会名称的首字母缩写，例如在一些语境中指Asia Wrestling Union（亚洲摔跤联盟）。"},"examples":[{"en":"She competed in an event organized under the AWU rules.","zh":"她参加了按AWU规则组织的比赛。"},{"en":"Search “AWU + wrestling” if the text is about tournaments.","zh":"如果文本是关于比赛的，可以用“AWU + wrestling”来检索确认。"}]}],"synonyms":["initialism","abbreviation","acronym"],"phonetic":"ˌeɪˌdʌbəl.juːˈjuː","extraExplanation":["“AWU”是典型的缩写词，离开上下文很难唯一确定含义。你可以提供一句原文（例如邮件标题、课程页面、公告），我就能帮你判断最可能的释义。","读音通常按字母拼读（A-W-U），而不是像普通单词那样连读。"]}
{"word":"awunctive","summary":{"en":"“Subjunctive” is a grammar term for verb forms used to express wishes, demands, suggestions, or unreal/uncertain situations.","zh":"“Subjunctive” 是语法术语，指用于表达愿望、要求、建议或不真实/不确定情况的动词形式（虚拟语气）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Grammar) relating to the subjunctive mood: a verb form used to express wishes, suggestions, demands, or situations that are unreal/uncertain.","zh":"（语法）虚拟语气的：一种动词形式，用来表达愿望、建议、要求，或不真实/不确定的情况。"},"examples":[{"en":"In formal English, “If I were you…” uses the subjunctive “were,” not “was.”","zh":"在较正式的英语中，“If I were you…” 用虚拟语气的 “were”，而不是 “was”。"},{"en":"The teacher insisted that he be on time.","zh":"老师坚持要求他准时（这里用 “be” 表示虚拟语气）。"}]},{"partOfSpeech":"n.","definition":{"en":"the subjunctive mood itself; a set of verb forms used for these meanings in a language.","zh":"虚拟语气本身；一种语言中用于表达上述含义的一组动词形式。"},"examples":[{"en":"Some learners find the subjunctive confusing at first.","zh":"一些学习者一开始会觉得虚拟语气很难。"},{"en":"In modern English, the subjunctive is most common in fixed patterns like “I suggest that…”","zh":"在现代英语中，虚拟语气最常见于 “I suggest that…” 这类固定结构。"}]}],"synonyms":["conditional (related, not the same)","irrealis (linguistics)"],"phonetic":"/səbˈdʒʌŋktɪv/","extraExplanation":["你输入的 “awunctive” 很可能是拼写误差；最接近且常见的词是 “subjunctive”（虚拟语气）。","常见结构速记：\n1) 建议/要求类：suggest/insist/require + that + 主语 + 动词原形（he be / she go）。\n2) 与事实相反：If + 过去式（常用 were）…（If I were…）。\n3) 固定表达：God bless you; Long live…（较正式/文学化）。"]}
