{"word":"AY","summary":{"en":"“Ay” is usually an interjection meaning “yes/hey,” and it can also mean the letter name “A.”","zh":"“AY/ay”常作感叹词，表示“嗯/是/喂”；也可作名词指字母“A”的读法。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"used to express agreement, acknowledgment, or to call someone’s attention (similar to “yes,” “hey,” or “oh”).","zh":"（感叹词）用于表示同意、回应，或引起注意（类似“是的/嗯”“喂”“哦”）。"},"examples":[{"en":"Ay, I understand what you mean.","zh":"嗯，我明白你的意思。"},{"en":"Ay! Watch out!","zh":"喂！小心！"}]},{"partOfSpeech":"n.","definition":{"en":"the name of the letter “A” (used in spelling, learning the alphabet, or talking about grades).","zh":"（名词）字母“A”的读法（用于拼写、学字母表或谈论成绩等级）。"},"examples":[{"en":"“Apple” starts with an ay.","zh":"“apple”以字母A开头。"},{"en":"She got an A (an ay) on the test.","zh":"她考试得了A。"}]}],"synonyms":["aye","yeah","yes","hey"],"phonetic":"/eɪ/","extraExplanation":["“ay”也常写作“aye”，在英国（尤其苏格兰）或较传统/文学化语境里更常见，表示“yes/是”。在正式投票中也会用：vote “aye” 表示赞成（相对的是 “nay” 反对）。","作为引起注意的感叹词时，“ay/aye”带点口语或地域色彩；日常美式英语更常用“yeah/yes/hey”。"]}
{"word":"ay","summary":{"en":"“Ay” is an old-fashioned/formal way to say “yes,” especially in voting; it can also be a literary sigh or the name of the letter A.","zh":"“ay”多用于正式表决中表示“同意/是”，也可作文学化的感叹词，或指字母A的读音/赞成票。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(used to say “yes,” especially in formal voting or old-fashioned/literary speech)","zh":"（表示“是/同意”，常见于正式表决或较古老/文学化的用法）"},"examples":[{"en":"All in favor, say “ay.”","zh":"赞成的请说“ay/同意”。"},{"en":"The motion passed with more ayes than noes.","zh":"该动议以“赞成票”多于“反对票”通过。"}]},{"partOfSpeech":"int.","definition":{"en":"(literary/old-fashioned) used to express surprise, regret, or complaint","zh":"（文学/旧式）用于表达惊讶、惋惜或抱怨"},"examples":[{"en":"Ay, what a pity we arrived too late.","zh":"唉，我们到得太晚了，真可惜。"},{"en":"Ay me, I have made a terrible mistake.","zh":"唉呀（可叹），我犯了个大错。"}]},{"partOfSpeech":"n.","definition":{"en":"the name of the letter “A”; also an affirmative vote (“an ay/aye”)","zh":"字母“A”的读音；也可指“赞成票/赞成的表决”"},"examples":[{"en":"Write an A—an ay—at the top of the page.","zh":"在页顶写一个A（读作ay）。"},{"en":"She cast her vote as an ay.","zh":"她投了赞成票。"}]}],"synonyms":["yes","yeah","aye"],"phonetic":"/eɪ/","extraExplanation":["在现代英语里，表示“同意/是”的拼法更常见的是 **aye**（尤其在议会表决等正式语境）。**ay** 常见于固定表达如 “All in favor, say ay.”","**Ay me!** 是较古典/诗歌化的感叹（类似“唉呀/可叹”），现代日常口语中通常不用。"]}
{"word":"ayacahuite","summary":{"en":"Ayacahuite is a pine tree (Pinus ayacahuite), commonly called the Mexican white pine.","zh":"Ayacahuite 指一种松树（Pinus ayacahuite），常称“墨西哥白松”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tall pine tree native to Mexico and Central America, known for its long, soft needles and large cones; also called the Mexican white pine","zh":"一种原产于墨西哥与中美洲的高大松树，以细长柔软的松针和较大的球果著称；也叫“墨西哥白松”"},"examples":[{"en":"Ayacahuite is often planted as an ornamental pine in mild climates.","zh":"在气候温和的地区，ayacahuite 常被作为观赏松树栽种。"},{"en":"The ayacahuite pine produces long needles that give it a graceful look.","zh":"Ayacahuite 松长而柔软的松针让它看起来很飘逸。"}]}],"synonyms":["Mexican white pine","ayacahuite pine","Pinus ayacahuite"],"phonetic":"/ˌaɪ.ə.kəˈwiː.teɪ/","extraExplanation":["“Ayacahuite”是一个植物学常用名，常对应学名 **Pinus ayacahuite**。在一般英文语境里，你也会看到 **Mexican white pine**（墨西哥白松）这个更直观的名称。","词源上通常认为它来自墨西哥土著语言（常见说法指向纳瓦特尔语 Nahuatl 的相关词形），后来经由西班牙语/拉丁化拼写进入植物学命名体系。"]}
{"word":"Ayacucho","summary":{"en":"Ayacucho is a place name in Peru: a city and regional capital, also the name of the surrounding region, and it is famous in history for the 1824 Battle of Ayacucho.","zh":"Ayacucho（阿亚库乔）是秘鲁的地名：一座城市兼大区首府，也是该大区名称；同时因1824年的“阿亚库乔战役”而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in the Andes of southern-central Peru (also called Huamanga), and the capital of the Ayacucho Region.","zh":"秘鲁中南部安第斯山区的一座城市（也称华曼加 Huamanga），也是阿亚库乔大区的首府。"},"examples":[{"en":"She traveled to Ayacucho to learn about Andean weaving traditions.","zh":"她去阿亚库乔学习安第斯纺织编织传统。"},{"en":"Ayacucho sits at a high altitude, so visitors should take it easy the first day.","zh":"阿亚库乔海拔较高，所以游客第一天最好放慢节奏。"}]},{"partOfSpeech":"n.","definition":{"en":"A region (administrative area) of Peru with Ayacucho as its capital.","zh":"秘鲁的一个行政区（大区），首府为阿亚库乔。"},"examples":[{"en":"The project supports rural communities across the Ayacucho Region.","zh":"该项目支持阿亚库乔大区各地的农村社区。"}]},{"partOfSpeech":"n.","definition":{"en":"In history, the Battle of Ayacucho (1824), a decisive battle that helped secure independence for Peru and much of Spanish South America.","zh":"历史上“阿亚库乔战役”（1824年），一场关键战役，推动秘鲁及西班牙在南美多地的独立进程。"},"examples":[{"en":"The Battle of Ayacucho is often taught as a turning point in South American independence.","zh":"阿亚库乔战役常被作为南美独立运动的转折点来讲授。"},{"en":"A monument commemorates those who fought at Ayacucho in 1824.","zh":"一座纪念碑纪念1824年在阿亚库乔作战的人们。"}]}],"synonyms":["Huamanga (historic/alternate name for the city)"],"phonetic":"/ˌaɪ.əˈkuː.tʃoʊ/","extraExplanation":["“Ayacucho”一名常被解释为源自克丘亚语（Quechua），aya（亡者/灵魂）+ kuchu（角落/地方），因此有“亡者之地/灵魂之角落”等说法；不同资料对词源细节可能略有差异。","这座城市在殖民时期也被称为“Huamanga”。在现代秘鲁语境中，Ayacucho除了是地名，也常让人联想到当地的安第斯民俗艺术（如木雕、织品）以及20世纪后期该地区曾经历的社会冲突历史。"]}
{"word":"ayah","summary":{"en":"An “ayah” is a South Asian term for a nanny or nursemaid, especially in Indian historical or cultural contexts.","zh":"“ayah”指南亚（尤指印度）语境中的保姆/奶妈，常带有地域与历史色彩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A nursemaid or nanny in South Asia (especially in India), often employed to care for children in a household.","zh":"（尤指印度等南亚地区的）保姆／奶妈，受雇在家庭中照顾孩子。"},"examples":[{"en":"When they moved to Mumbai, they hired an ayah to look after the baby during the day.","zh":"他们搬到孟买后，雇了一位 ayah 白天照看宝宝。"},{"en":"In some older books about British India, an ayah is a trusted nanny who travels with the family.","zh":"在一些描写英属印度的旧书里，ayah 常指跟着家庭出行、深受信任的保姆。"}]}],"synonyms":["nanny","nursemaid","babysitter","caretaker"],"phonetic":"/ˈaɪ.ə/","extraExplanation":["“ayah”常见于英式英语与历史语境（如殖民时期的“Anglo-Indian”用语）。现代英语中更常用“nanny / babysitter / domestic helper”等表达；在写作或翻译时，用“ayah”会带有明显的地域与时代色彩。","词源上与印地语/乌尔都语中的“āyā（照看孩子的女仆/保姆）”有关，因此多用于南亚文化背景。"]}
{"word":"ayahausca","summary":{"en":"Ayahuasca is a traditional Amazonian psychoactive ceremonial drink.","zh":"Ayahuasca（常译“死藤水”）是一种源自亚马逊地区、用于传统仪式的致幻草药饮品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A psychoactive brew traditionally used by Indigenous peoples in the Amazon for spiritual/ceremonial purposes, usually made from a vine (Banisteriopsis caapi) combined with other plants.","zh":"一种具有致幻作用的传统草药饮品，源自亚马逊地区的原住民灵性/仪式用途，通常由一种藤本植物（如“卡皮藤”Banisteriopsis caapi）与其他植物共同煮制而成。"},"examples":[{"en":"Some Amazonian communities use ayahuasca in ceremonies led by experienced healers.","zh":"一些亚马逊地区的社群会在有经验的疗愈者带领下，在仪式中使用死藤水。"},{"en":"Ayahuasca has attracted international attention, but it can be risky and is not legal everywhere.","zh":"死藤水在国际上受到关注，但它可能有风险，而且并非在所有地方都合法。"}]}],"synonyms":["plant brew","psychoactive tea","shamanic brew"],"phonetic":"/ˌaɪəˈwɑskə/","extraExplanation":["你输入的“ayahausca”常见拼写是 **ayahuasca**。在西语语境中也常写作 **ayahuasca**；中文常译为“死藤水”。","从文化角度看，ayahuasca 与特定原住民传统与宗教实践密切相关；在讨论或旅行体验时，尽量避免将其当作“娱乐性致幻剂”来描述，以示尊重。","安全与法律提醒：ayahuasca 可能与某些药物（尤其是抗抑郁药等）产生危险相互作用，并且在不同国家/地区的法律地位差异很大；如需了解应咨询专业医疗与当地法规信息。"]}
{"word":"ayahs","summary":{"en":"“Ayahs” is the plural of “ayah,” meaning either (1) a nanny/nursemaid in South or Southeast Asia, or (2) verses of the Qur’an.","zh":"“Ayahs”是“ayah”的复数，可指（1）南亚/东南亚语境中的保姆/奶妈，或（2）《古兰经》的经文（章节中的一节）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a nursemaid or nanny (often in South or Southeast Asia), traditionally employed to care for children in a household","zh":"（常指南亚或东南亚家庭中的）保姆、奶妈（传统上负责照看孩子的女佣）"},"examples":[{"en":"When they lived in India, the family hired two ayahs to help with the children.","zh":"他们住在印度时，家里雇了两位保姆帮忙照看孩子。"},{"en":"The ayah carried the baby and soothed her to sleep.","zh":"保姆抱着婴儿，哄她入睡。"}]},{"partOfSpeech":"n.","definition":{"en":"a verse (or sign) in the Qur’an; one of its numbered units","zh":"《古兰经》中的一节（经文）；编号的基本单位"},"examples":[{"en":"He quoted an ayah from the Qur’an during the discussion.","zh":"讨论中他引用了《古兰经》中的一节经文。"},{"en":"This surah has many ayahs about mercy and justice.","zh":"这一章里有许多关于仁慈与公正的经文。"}]}],"synonyms":["nanny","nursemaid","caretaker"],"phonetic":"/ˈaɪə/","extraExplanation":["“ayah（保姆）”多见于英国殖民时期及其相关文学/回忆录语境，常用来指在印度等地受雇照看儿童的女性佣人；现代英语里仍可见，但带有明显地域与历史背景。","“ayah（经文）”来自阿拉伯语 āyah，意为“迹象、标志”，在宗教语境中指《古兰经》的一节；这一义项与“保姆”的 ayah 并非同源。"]}
{"word":"ayahuasca","summary":{"en":"Ayahuasca is a traditional Amazonian ceremonial brew with psychoactive effects.","zh":"Ayahuasca（死藤水）是亚马逊传统仪式用的含精神活性成分的草药饮料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A powerful traditional Amazonian brew made from plants (usually including the Banisteriopsis caapi vine) that contains psychoactive substances and is used in Indigenous ceremonies and, more recently, in some spiritual or therapeutic contexts.","zh":"一种源自亚马逊地区的传统草药饮料（通常含有卡皮藤 Banisteriopsis caapi 等植物），含有致幻/精神活性成分，用于原住民仪式，也在近年被一些人用于灵性或治疗相关场景。"},"examples":[{"en":"Some Indigenous communities in the Amazon use ayahuasca in ceremonies for healing and guidance.","zh":"亚马逊的一些原住民社群会在仪式中使用死藤水，用于疗愈与寻求指引。"},{"en":"In recent years, ayahuasca has attracted international attention, but its use carries legal and health risks.","zh":"近些年死藤水受到国际关注，但使用它可能带来法律与健康风险。"}]}],"synonyms":["the ayahuasca brew","yagé","yage"],"phonetic":"/ˌaɪ.əˈwɑs.kə/","extraExplanation":["词源与文化背景：ayahuasca 来自克丘亚语（Quechua），常被解释为“灵魂之藤/死者之藤”（“aya”≈灵魂/亡者，“huasca”≈藤/绳）。在许多亚马逊原住民传统中，它与宗教仪式、疗愈与社群知识体系紧密相关。","使用语境提醒：英语中 ayahuasca 常出现在 anthropological (人类学)、spiritual retreat（灵修营）、psychedelic research（迷幻研究）等语境；讨论时建议尊重其原住民文化意义，避免把它仅当作“迷幻药”来猎奇化。","发音与拼写：英语里常见读法为 /ˌaɪ.əˈwɑːs.kə/；也可能看到拼写变体，但 ayahuasca 是最常见形式。"]}
{"word":"Ayahuca","summary":{"en":"“Ayahuca” is usually a misspelling of ayahuasca, a traditional Amazonian ceremonial drink known for intense mind-altering effects.","zh":"“Ayahuca”通常是 ayahuasca（死藤水）的误拼，指一种亚马逊地区的传统仪式饮料，以强烈的致幻/改变意识效果著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A misspelling or variant spelling of ayahuasca: a traditional Amazonian plant drink used in some Indigenous spiritual and healing ceremonies; it is also known for causing strong changes in perception (hallucinations).","zh":"（常见误拼）ayahuasca（死藤水）：一种亚马逊地区的传统植物饮料，在一些原住民的灵性与疗愈仪式中使用；也以引发强烈的知觉改变（致幻体验）而闻名。"},"examples":[{"en":"I think “Ayahuca” is usually spelled “ayahuasca.”","zh":"我觉得 “Ayahuca” 通常拼作 “ayahuasca”。"},{"en":"Ayahuasca ceremonies are part of some Indigenous Amazonian traditions.","zh":"死藤水仪式是一些亚马逊原住民传统的一部分。"},{"en":"People should be cautious when discussing ayahuasca because it can be risky and is illegal in some places.","zh":"谈到死藤水时人们应保持谨慎，因为它可能有风险，而且在一些地方是非法的。"}]}],"synonyms":["ayahuasca","yagé","yage"],"phonetic":"/ˌaɪ.ə.wəˈskɑ/","extraExplanation":["“Ayahuasca”一词常被解释为源自克丘亚语（Quechua），大意与“灵魂/亡者之藤”相关，但不同社群与资料会有细微差异。","死藤水在文化上与某些亚马逊原住民的宗教、疗愈与社群仪式紧密相连。把它仅当作“致幻饮料/迷幻药”来谈，可能会忽略其文化与宗教语境。","现代语境中常见于“灵性旅游（spiritual tourism）/仪式体验”等讨论；同时也涉及健康风险、药物相互作用与法律限制等议题。"]}
{"word":"ayahuca","summary":{"en":"Ayahuasca is a traditional Amazonian psychoactive ceremonial tea used in some Indigenous spiritual and healing practices.","zh":"Ayahuasca 指一种亚马逊地区传统的致幻性仪式用草药茶，在部分原住民的灵性与疗愈实践中使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A psychoactive Amazonian tea (a traditional ceremonial brew) made from certain plants, especially the ayahuasca vine, used by some Indigenous groups for healing and spiritual rituals.","zh":"一种来自亚马逊地区的致幻性草药茶（传统仪式性饮品），由特定植物制成，尤其常以“死藤/灵藤”（ayahuasca vine）为主要原料；在一些原住民社群中用于疗愈与宗教/灵性仪式。"},"examples":[{"en":"Some documentaries discuss the cultural and spiritual use of ayahuasca in parts of the Amazon.","zh":"一些纪录片会介绍在亚马逊部分地区，ayahuasca 在文化与灵性仪式中的使用。"},{"en":"People should research the health risks and local laws before traveling for an ayahuasca ceremony.","zh":"在为参加 ayahuasca 仪式而旅行前，人们应先了解健康风险与当地法律。"}]}],"synonyms":["Amazonian ceremonial brew","psychedelic tea"],"phonetic":"/ˌaɪ.əˈwɑː.skə/","extraExplanation":["“ayahuca”常见于对“ayahuasca”的误拼或误听；更常见、较标准的拼法是 ayahuasca。","该词来自南美原住民语言（常见说法指源于克丘亚语系），在当地语境中与传统医药、仪式、世界观紧密相关；跨文化讨论时应尊重其宗教与文化意义。","在许多国家/地区，其活性成分可能涉及管制物质；健康方面也可能与心理状态、用药相互作用等风险有关，学习词义时可同时留意相关背景。"]}
{"word":"Ayala","summary":{"en":"Ayala is most commonly a surname, and it can also refer to place names or to major Philippine brands/companies (e.g., Ayala Corporation).","zh":"Ayala 最常见是姓氏；也可指地名，或指菲律宾的重要品牌/企业（如阿亚拉集团）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Spanish (and Latin American/Filipino) family name (surname).","zh":"一个常见的西班牙语姓氏（也常见于拉丁美洲与菲律宾等地）。"},"examples":[{"en":"Ms. Ayala will lead the meeting today.","zh":"Ayala 女士今天将主持会议。"},{"en":"My friend’s last name is Ayala.","zh":"我朋友的姓是 Ayala。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used for several locations (for example, towns or neighborhoods) in Spanish-speaking regions and beyond.","zh":"一个地名：在多个地区被用作城镇或地区名称（常见于西语地区及其他地方）。"},"examples":[{"en":"We drove through Ayala on our way to the coast.","zh":"我们去海边的路上开车经过 Ayala。"},{"en":"The festival is held in Ayala every spring.","zh":"这个节日每年春天在 Ayala 举行。"}]},{"partOfSpeech":"n.","definition":{"en":"a well-known company name in the Philippines, especially in “Ayala Corporation” and places branded with “Ayala” (e.g., business districts, malls).","zh":"菲律宾常见的企业/品牌名，尤其指“阿亚拉集团（Ayala Corporation）”以及以 Ayala 命名的商业区、商场等。"},"examples":[{"en":"She works for Ayala Corporation in Makati.","zh":"她在马卡蒂的阿亚拉集团工作。"},{"en":"Let’s meet at an Ayala Mall after class.","zh":"下课后我们在一家 Ayala 商场见。"}]}],"synonyms":["(proper noun)"],"phonetic":"/aɪˈɑːlə/","extraExplanation":["“Ayala”常被视为西班牙姓氏，也与西班牙巴斯克地区的地名渊源有关（常见解释是来自阿拉瓦省的 Ayala/Aiara 山谷一带）。","作为专有名词时通常不翻译；在中文语境中常音译为“阿亚拉”。在阅读新闻或地图时，可通过上下文判断是“人名、地名”还是“公司/品牌名”。"]}
{"word":"ayapana","summary":{"en":"Ayapana is a South American aromatic plant, and it can also refer to a herbal tea made from its leaves.","zh":"Ayapana 指一种原产南美的芳香植物，也可指用其叶子泡的花草茶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical plant (Ayapana triplinervis) from South America, often grown for its aromatic leaves","zh":"一种原产南美的热带芳香植物（学名 Ayapana triplinervis），常因其叶片有香气而栽培"},"examples":[{"en":"Ayapana is sometimes grown in home gardens for its fragrant leaves.","zh":"Ayapana 有时会在家庭花园里种植，因为它的叶子很香。"},{"en":"The ayapana plant has long, green leaves with a strong herbal scent.","zh":"Ayapana 这种植物有细长的绿色叶子，带有明显的草本香味。"}]},{"partOfSpeech":"n.","definition":{"en":"an herbal infusion (tea) made from the leaves of the ayapana plant","zh":"用 ayapana 植物叶子泡制的草本饮品（花草茶）"},"examples":[{"en":"Some people drink ayapana tea for its pleasant aroma.","zh":"有些人会喝 ayapana 茶，因为它闻起来很舒服。"},{"en":"In some regions, ayapana is prepared as a simple leaf infusion.","zh":"在一些地区，人们会把 ayapana 用叶子简单冲泡成饮品。"}]}],"synonyms":["Ayapana triplinervis","ayapana tea"],"phonetic":"/ˌaɪəˈpænə/","extraExplanation":["“Ayapana”常见于植物学与草药文化语境，来源与南美（尤其亚马孙流域周边）的民间使用有关。不同地区对它的称呼、拼写与具体指代的近缘植物可能略有差异；如果你在读食谱、草药书或园艺资料，最好对照拉丁学名确认。"]}
{"word":"ayatollah","summary":{"en":"An ayatollah is a senior Shia Muslim religious leader; in English it can also mean a very strict authority figure (figuratively).","zh":"“ayatollah”指什叶派伊斯兰教的高级宗教领袖；在英语中也可作比喻，指非常强硬的权威人物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A high-ranking religious leader in Shia Islam, especially in Iran, who is recognized for advanced learning and authority to interpret Islamic law.","zh":"（什叶派伊斯兰教的）大阿亚图拉/阿亚图拉；高级宗教领袖，尤指在伊朗，因学识与宗教权威而被认可，可解释伊斯兰教法。"},"examples":[{"en":"Ayatollah Ali Khamenei is Iran’s Supreme Leader.","zh":"阿里·哈梅内伊是伊朗最高领袖（阿亚图拉）。"},{"en":"Some senior clerics are addressed as ayatollahs because of their religious scholarship.","zh":"一些资深教士因其宗教学术地位而被称为“阿亚图拉”。"}]},{"partOfSpeech":"n.","definition":{"en":"In English, sometimes used metaphorically for a strict, powerful, or uncompromising authority figure (often critical or humorous).","zh":"（英语中引申）用来比喻非常强硬、权力很大或不妥协的权威人物（常带批评或讽刺意味）。"},"examples":[{"en":"In the office, he acted like an ayatollah about rules and procedures.","zh":"在办公室里，他对规章制度的态度强硬得像个“阿亚图拉”。"},{"en":"The columnist called the leader an “ayatollah” of austerity.","zh":"专栏作者把那位领导称为紧缩政策的“阿亚图拉”（比喻其强硬）。"}]}],"synonyms":["cleric","religious leader","Shia scholar","authority figure (figurative)"],"phonetic":"/ˌaɪəˈtoʊlə/","extraExplanation":["“Ayatollah”源自阿拉伯语，常被解释为“真主的标志/象征”。它主要是什叶派（尤其是十二伊玛目派）中的宗教头衔，通常授予在伊斯兰法学等领域达到很高学术与宗教地位的学者。","在伊朗语境中，“Ayatollah”常与政治权力相关（例如最高领袖），但在更广泛的宗教语境里它首先是学术与宗教权威的称号。用作英语比喻时，可能带有刻板印象或贬义，写作与交流中建议注意场合与尊重。"]}
{"word":"ayatollahs","summary":{"en":"“Ayatollahs” are high-ranking Shiite religious leaders (plural of “ayatollah”); it can also be used figuratively for strict, controlling people.","zh":"“Ayatollahs”指什叶派的高级宗教领袖（“ayatollah”的复数）；也可比喻指严苛、专断、爱管控的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a high-ranking Shiite Muslim religious leader or scholar (especially in Iran and Iraq); “ayatollahs” is the plural form of “ayatollah.”","zh":"（什叶派伊斯兰教）高级宗教领袖或学者（尤指伊朗、伊拉克）；“ayatollahs”为“ayatollah”的复数。"},"examples":[{"en":"Many ayatollahs are respected for their religious scholarship.","zh":"许多阿亚图拉因其宗教学术而备受尊敬。"},{"en":"The news report mentioned several ayatollahs in Qom.","zh":"新闻报道提到了库姆的几位阿亚图拉。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative, often critical) people seen as strict, authoritarian, or controlling about rules or beliefs.","zh":"（比喻用法，常带批评）指对规则或信念非常严苛、专断、爱管控的人。"},"examples":[{"en":"Some colleagues called the policy committee the “ayatollahs of compliance.”","zh":"有些同事把政策委员会称为“合规的阿亚图拉”（指极端严苛的人）。"},{"en":"He wasn’t an ayatollah about grammar—he just wanted clarity.","zh":"他并不是语法方面的“阿亚图拉”——他只是希望表达清楚。"}]}],"synonyms":["clerics","religious leaders","Shiite scholars","hardliners (figurative)"],"phonetic":"/ˌaɪəˈtoʊlə/","extraExplanation":["“Ayatollah”源自阿拉伯语，常被译为“真主的标志/迹象”。在什叶派语境里，它是宗教学者的头衔之一；在英文新闻中常与伊朗政治与宗教体系一起出现。","在比喻用法中，它通常带贬义，暗示“教条、强硬、爱干涉”。用在真实宗教人物上时，最好避免这种语气，以免显得不尊重。"]}
{"word":"Aycliffe","summary":{"en":"Aycliffe is a proper noun used mainly as a place name in County Durham, England.","zh":"Aycliffe 主要作为英国达勒姆郡的地名使用，属于专有名词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A place name in northeast England, best known as (Great) Aycliffe village and the nearby town Newton Aycliffe in County Durham.","zh":"英国英格兰东北部的地名，最常见指达勒姆郡（County Durham）的（大）埃克利夫（Great Aycliffe）村，以及附近的新埃克利夫（Newton Aycliffe）镇。"},"examples":[{"en":"She grew up in Aycliffe, County Durham, before moving to Newcastle.","zh":"她在达勒姆郡的埃克利夫长大，后来搬到了纽卡斯尔。"},{"en":"The factory is located near Newton Aycliffe.","zh":"那家工厂位于新埃克利夫附近。"}]}],"phonetic":"/ˈeɪklɪf/","extraExplanation":["“Aycliffe”多见于英国地名与姓氏语境中。常见写法包括 Great Aycliffe（村名）与 Newton Aycliffe（城镇名）。","词源上通常解释为古英语元素的组合：āc（oak，橡树）+ clif（cliff/slope，悬崖/坡地），大意与“有橡树的坡地/悬崖”有关。"]}
{"word":"Aydelotte","summary":{"en":"Aydelotte is a family name (surname).","zh":"Aydelotte 是一个姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name), most commonly found in the United States; used to refer to people or families with this last name.","zh":"一个姓氏（家族姓），在美国较常见；用于指代拥有该姓的人或家族。"},"examples":[{"en":"Ms. Aydelotte will present the report at the meeting.","zh":"Aydelotte 女士将在会议上汇报这份报告。"},{"en":"I’m emailing Dr. Aydelotte to ask about office hours.","zh":"我在给 Aydelotte 博士发邮件询问办公时间。"}]}],"synonyms":["(no true synonyms; it is a proper name)"],"phonetic":"/ˈeɪdəˌlɑt/","extraExplanation":["“Aydelotte”通常作为专有名词使用（姓氏）。在英文里，姓氏一般不翻译含义，常见做法是保留拼写；在中文语境可按音译（例如“艾德洛特/艾德洛蒂”等），但具体译法会因个人偏好或既有译名而不同。","发音在不同家庭或地区可能略有差异；如果你指的是某位具体人物（如作家、学者或公众人物），我可以根据那个人的常见读音与背景补充更准确的信息。"]}
{"word":"Ayden","summary":{"en":"Ayden is a modern spelling of the given name Aidan, often linked to the Irish name Aodhán and associated with the idea of “little fire.”","zh":"Ayden 是英文名，常被视为 Aidan 的现代拼写，追溯到爱尔兰语名字 Aodhán，常与“小火焰/热烈”这一含义相关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name (usually masculine) used in English-speaking countries; a modern spelling variant of Aidan.","zh":"（通常为男性的）英文名字；Aidan 的一种现代拼写变体。"},"examples":[{"en":"Ayden is starting kindergarten this fall.","zh":"Ayden 今年秋天要上幼儿园了。"},{"en":"We named our son Ayden because we liked how it sounds.","zh":"我们给儿子取名 Ayden，因为我们喜欢这个名字的读音。"}]},{"partOfSpeech":"other","definition":{"en":"(name origin) a name ultimately from Irish Aodhán, often explained as meaning “little fire” or “fiery.”","zh":"（名字词源）源自爱尔兰语 Aodhán，常被解释为“小火焰/火一般的、热烈的”。"},"examples":[{"en":"Ayden is often said to mean “little fire,” though meanings of names can vary by source.","zh":"Ayden 常被说成意思是“小火焰”，不过名字含义在不同资料里可能略有差异。"},{"en":"In class, Ayden asked how to spell his name for the worksheet.","zh":"课堂上，Ayden 问练习单上他的名字怎么拼。"}]}],"synonyms":["Aidan","Aiden"],"phonetic":"/ˈeɪdən/","extraExplanation":["Ayden 在美国在 2000 年代到 2010 年代非常流行，属于当时一批“发音像 Aidan，但拼写更现代”的名字之一。","常见拼写/近似名字：Aidan、Aiden、Aden；女生有时会用 Ayden/Aiden，但更常见的女生拼写是 Aidan 的变体如 Aida（并不完全同源）。","在正式写作中，名字通常首字母大写；作自我介绍时可以说：“Hi, I’m Ayden. It’s spelled A-Y-D-E-N.”"]}
{"word":"Aydendron","summary":{"en":"Aydendron is not a standard English word; it is likely a proper name or a coined term, possibly suggesting a connection to “tree” via “-dendron.”","zh":"Aydendron 不是常见英语词；更可能是专名或自造词，且可能借由 “-dendron” 暗示与“树”有关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Aydendron (rare/possibly coined) is not a standard English dictionary word; it is most likely a proper name (e.g., a person, place, brand, or fictional term).","zh":"Aydendron（较罕见/可能为自造词）不是常见英语词典收录的词；更可能是专有名词（如人名、地名、品牌名或虚构设定用语）。"},"examples":[{"en":"I couldn’t find a dictionary entry for “Aydendron,” so it may be a name or a fantasy term.","zh":"我在词典里查不到 “Aydendron”，所以它可能是一个名字或奇幻作品里的词。"},{"en":"Aydendron appears to be used as a username online rather than a common English word.","zh":"Aydendron 看起来更像是网络用户名，而不是常见英语词。"}]},{"partOfSpeech":"other","definition":{"en":"Possible formed meaning (interpretation): a made-up word combining a name like “Ayden” with Greek-based “-dendron” (“tree”), suggesting something like “Ayden’s tree” or “tree-like.”","zh":"可能的构词含义（推测）：把类似人名 “Ayden” 与源自希腊语的 “-dendron”（意为“树”）组合，可能暗示“Ayden 的树”或“像树一样的事物”。"},"examples":[{"en":"In a fantasy story, “Aydendron” could be the name of a sacred tree or a tree-spirit.","zh":"在奇幻故事里，“Aydendron” 可能是神圣之树或树灵的名字。"},{"en":"The author named the kingdom’s main world-tree Aydendron.","zh":"作者把王国的世界之树命名为 Aydendron。"}]}],"synonyms":["proper name","coined term","fantasy name"],"phonetic":"ˈaɪdɛnˌdrɑn","extraExplanation":["“dendron” 来自希腊语 δένδρον（déndron，意为“树”），常见于与“树/分支结构”有关的词里，例如 dendrite（树突，神经元的分枝）。因此如果 Aydendron 是自造词或专有名词，它在气质上容易让人联想到“树、分枝、生命之树”等意象。","如果你告诉我它出现的语境（比如书名/游戏/一句话/你想表达的含义），我可以更准确地判断它是专有名词、拼写变体，还是某个作品的术语。"]}
{"word":"aydendron","summary":{"en":"“aydendron” isn’t a standard English word; it’s likely a misspelling or a proper name.","zh":"“aydendron”不是标准英语词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most likely a misspelling or a proper name (e.g., a username, place, character, or brand).","zh":"不是标准英语单词；更可能是拼写错误或专有名词（如用户名、地名、角色名或品牌名）。"},"examples":[{"en":"I couldn’t find “aydendron” in an English dictionary—do you mean “rhododendron” or “dendron”?","zh":"我在英文词典里找不到“aydendron”——你是不是想写“rhododendron（杜鹃花属）”或“dendron（树/树状结构）”？"}]}],"phonetic":"/ˈaɪdənˌdrɑn/","extraExplanation":["“aydendron”在常见英英词典中没有固定词条，因此很可能是：\n1）拼写接近的词：rhododendron（杜鹃花/杜鹃花属植物）、dendron（表示“树/树状”的构词成分或少见词）、dendrite（树突）。\n2）专有名词：例如把人名 Ayden/Aiden 与 -dron/-dendron 组合出来的名称。\n如果你告诉我它出现的语境（句子/文章/游戏/植物名），我可以更准确地判断你想查的是哪个词。"]}
{"word":"Aydin","summary":{"en":"Aydin is usually a Turkish male given name meaning “enlightened/bright,” and it can also refer to a city/province in western Turkey (Aydın).","zh":"Aydin 通常是土耳其男性名字，意为“开明/明亮”；也可指土耳其西部的城市与省（Aydın）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (mostly Turkish) meaning “enlightened,” “bright,” or “intellectual.”","zh":"（多为土耳其语）人名，常表示“开明的 / 明亮的 / 有学识的”。"},"examples":[{"en":"Aydin is a common boy’s name in Turkey.","zh":"Aydin 是土耳其常见的男孩名字。"},{"en":"Her colleague Aydin speaks both Turkish and English.","zh":"她的同事 Aydin 会说土耳其语和英语。"}]},{"partOfSpeech":"n.","definition":{"en":"a city and province in western Turkey, often written as Aydın in Turkish.","zh":"土耳其西部的城市与省名（土耳其语常写作 Aydın）。"},"examples":[{"en":"They traveled from Izmir to Aydin by train.","zh":"他们坐火车从伊兹密尔到 Aydin。"},{"en":"Aydin Province is known for figs and olive groves.","zh":"Aydin 省以无花果和橄榄林闻名。"}]}],"synonyms":["Aydın"],"phonetic":"/aɪˈdiːn/","extraExplanation":["土耳其语拼写常为 **Aydın**，其中的字母 **ı**（无点 i）发音不等同于英语的 i。英语环境里常简化写成 **Aydin**。","作为人名时，词源与土耳其语中“明亮、开明、有见识”相关，常带有积极的文化含义。"]}
{"word":"Aydlett","summary":{"en":"Aydlett is a small unincorporated community in northeastern North Carolina, USA.","zh":"Aydlett 是美国北卡罗来纳州东北部的一个非建制小社区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small unincorporated community in Currituck County, in northeastern North Carolina (USA), near the Outer Banks region","zh":"（美国）北卡罗来纳州东北部柯里塔克县（Currituck County）的一个非建制社区，靠近外滩群岛（Outer Banks）地区"},"examples":[{"en":"We drove through Aydlett on our way to the Outer Banks.","zh":"我们去外滩群岛的路上开车经过了Aydlett。"},{"en":"Aydlett is a quiet community in Currituck County, North Carolina.","zh":"Aydlett 是北卡罗来纳州柯里塔克县一个安静的小社区。"}]}],"phonetic":"/ˈeɪdlət/","extraExplanation":["Aydlett 是地名（专有名词），通常不翻译，只进行音译或直接使用原拼写。","在美国，“unincorporated community（非建制社区）”指未设立独立市政政府的居住地，行政与公共服务多由县（county）层级负责。"]}
{"word":"aye","summary":{"en":"Aye means “yes,” often used informally, in some British/Scottish dialects, and in nautical speech (“Aye, aye, sir”).","zh":"Aye表示“是的”，多见于英式/苏格兰方言或航海用语（如“Aye, aye, sir”表示“明白并会执行”）。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"used to say “yes,” to agree, or to show you accept something (often informal or dialectal)","zh":"（常为非正式或方言用法）表示“是的/同意/接受”"},"examples":[{"en":"Aye, I can do that for you.","zh":"是的，我可以帮你做。"},{"en":"“Are you coming?” “Aye.”","zh":"“你来吗？”“来/是的。”"}]},{"partOfSpeech":"int.","definition":{"en":"used by sailors to mean “yes,” especially in the phrase “Aye, aye, sir” (“I understand and will obey”)","zh":"（航海用语）表示“是，明白并会执行”，常见于“Aye, aye, sir（遵命/明白）”"},"examples":[{"en":"Aye, aye, captain! We’ll change course.","zh":"遵命，船长！我们会改航向。"},{"en":"The crew answered, “Aye, aye, sir.”","zh":"船员回答：“明白，长官。”"}]}],"synonyms":["yes","yeah (informal)","certainly","sure"],"phonetic":"/aɪ/","extraExplanation":["“Aye”常见于苏格兰英语、英格兰北部方言、以及传统航海口令中；在美式日常口语里较少用，更常见的是“yes / yeah”。","注意别和字母“I”（我）混淆：它们拼写不同，但在一些口音里听起来可能接近。"]}
{"word":"ayegreen","summary":{"en":"“Ayegreen” is not a standard English word; it’s usually a name/handle. If read as “aye + green,” it can suggest an “evergreen/always green” idea, but that use is nonstandard.","zh":"“Ayegreen”不是标准英语单词，多用作名字/网名；若按“aye + green”理解，可暗示“常青/永远绿色”的意象，但并非固定用法。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English dictionary word; most often seen as a username, brand name, or coined term (e.g., online handle).","zh":"不是标准英语词典词；最常见于用户名、品牌名或自造词（如网络昵称）。"},"examples":[{"en":"Ayegreen is the name she uses on social media.","zh":"Ayegreen 是她在社交媒体上使用的名字。"},{"en":"I couldn’t find “ayegreen” in a dictionary, so it may be a made-up name.","zh":"我在词典里找不到“ayegreen”，所以它可能是自造的名称。"}]},{"partOfSpeech":"other","definition":{"en":"If interpreted as “aye + green,” it can suggest “always green” (similar in feeling to “evergreen”), though this is not an established phrase in modern English.","zh":"如果按“aye（一直/永远）+ green（绿色/常青）”来理解，可表达“永远常绿/常青”（语感接近 evergreen），但这并不是现代英语中的固定短语。"},"examples":[{"en":"In his logo, “Ayegreen” hints at an always-fresh, evergreen image.","zh":"在他的标识里，“Ayegreen”暗示一种永远清新、常青的形象。"},{"en":"People might read Ayegreen as “evergreen,” meaning something that stays relevant.","zh":"人们可能会把 Ayegreen 理解成“evergreen”，表示一直不过时、长期有价值。"}]}],"synonyms":["evergreen","always-green","green"],"phonetic":"/ˈaɪˌɡriːn/","extraExplanation":["“aye”在苏格兰英语（Scots English）里常用作“yes”（是的），也可带有“always/ever（总是/永远）”的意思；但把它和“green”合成“ayegreen”并不常见，因此更像是刻意的命名风格。","如果你是想查某个更常见的词，可能是：evergreen（常青的；经久不衰的）、green（绿色的；环保的）、aye（是的/永远——多见于苏格兰或文学语境）。"]}
{"word":"ayelp","summary":{"en":"“Yelp” means a short, sharp cry, or to make such a cry, often from pain or surprise.","zh":"“yelp”指短促尖锐的叫声，也可作动词表示发出这种叫声，常因疼痛或惊讶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short, sharp cry (often from pain, surprise, or excitement), especially like a dog’s sound","zh":"（常因疼痛、惊讶或兴奋发出的）短促尖叫声；（尤指）像狗发出的叫声"},"examples":[{"en":"The dog let out a yelp when it stepped on a thorn.","zh":"狗踩到刺时发出一声尖叫。"},{"en":"I heard a yelp of pain from the next room.","zh":"我听到隔壁房间传来一声痛叫。"}]},{"partOfSpeech":"v.","definition":{"en":"to give a short, sharp cry","zh":"（因疼痛、惊讶等）短促地尖叫；（像狗一样）叫一声"},"examples":[{"en":"He yelped when the cold water hit him.","zh":"冷水泼到他身上时，他尖叫了一声。"},{"en":"The puppy yelped and ran under the table.","zh":"小狗叫了一声，跑到桌子底下。"}]}],"synonyms":["cry","yelI","squeal","shriek","howl"],"phonetic":"/jɛlp/","extraExplanation":["“ayelp”本身不是常见英文单词；你可能想输入的是 **yelp**，或是短语 **a yelp**（“一声尖叫”）。","**yelp** 常被认为是拟声词（onomatopoeia），模仿短促尖锐的叫声。","注意：**Yelp**（首字母大写）也可能指美国的点评网站/应用。"]}
{"word":"ayen","summary":{"en":"Ayen is not a common English word; it’s usually used as a name (person or place) and depends on context.","zh":"Ayen 不是常见英语词，通常作为人名或地名使用，含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Ayen (proper noun) is an uncommon name in English. It may appear as a personal name (given name or surname), and its pronunciation/spelling can vary by language and region.","zh":"Ayen（专有名词）在英语里并不常见，可能作为人名（名或姓）出现；不同语言/地区中拼写和读法可能不一样。"},"examples":[{"en":"Ayen introduced herself at the meeting.","zh":"Ayen 在会议上做了自我介绍。"},{"en":"I saw the name Ayen on the class list.","zh":"我在班级名单上看到了 Ayen 这个名字。"}]},{"partOfSpeech":"other","definition":{"en":"Ayen can also be a place name in some regions (for example, a town name used in parts of Africa), depending on the context.","zh":"Ayen 也可能是某些地区的地名（例如在非洲部分地区会出现这样的城镇名），具体要看语境。"},"examples":[{"en":"They traveled through Ayen during their trip.","zh":"他们旅行途中经过了 Ayen。"}]}],"phonetic":"/ˈaɪ.ən/","extraExplanation":["“Ayen”不是常见英语词汇，所以如果你是在句子里看到它，通常需要结合上下文判断：是人名、地名，还是别的语言的音译/拼写变体。","有时它可能是你想查的单词的拼写误差，比如 Ayan、Amen、Allen、Ion 等。你可以把完整句子发来，我可以帮你确认最可能的意思。"]}
{"word":"ayenbite","summary":{"en":"A rare Middle English noun meaning deep remorse or repentance—guilt that “bites back.”","zh":"一个罕见的中古英语名词，表示深切的懊悔或悔改，强调内疚像“回咬”一样折磨人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"remorse; a painful feeling of guilt that seems to “bite back” after doing wrong","zh":"懊悔；因做错事而产生的强烈内疚感，像“反噬/回咬”一样折磨人"},"examples":[{"en":"After lying to his friend, he felt deep ayenbite and couldn’t sleep.","zh":"对朋友撒谎后，他感到深深的懊悔，难以入睡。"},{"en":"She confessed because the ayenbite of conscience was too strong.","zh":"她之所以坦白，是因为良心的谴责（懊悔感）太强烈。"}]},{"partOfSpeech":"n.","definition":{"en":"repentance; regret that leads someone to want to change their behavior","zh":"悔改；促使人想改正行为的后悔与自责"},"examples":[{"en":"His ayenbite made him apologize and try to make things right.","zh":"他的悔改之心让他道歉，并努力弥补过错。"}]}],"synonyms":["remorse","repentance","compunction","guilt"],"phonetic":"/ˈaɪənˌbaɪt/","extraExplanation":["“ayenbite”来自中古英语：ayen-（again，再一次）+ bite（咬）。字面意思像“再咬一口/回咬”，用来形容错误行为带来的良心刺痛与懊悔。","这个词最有名的出现是在14世纪作品《Ayenbite of Inwyt》（常译《良心的回咬/良心的谴责》）中，其中 inwyt 意为“conscience（良心）”。现代英语里这个词非常罕见，多见于文学研究或历史语境。"]}
{"word":"ayens","summary":{"en":"Alien means (1) a being from outer space, (2) a non-citizen (formal/legal), or (3) strange and unfamiliar.","zh":"alien 可指（1）外星生物，（2）外国人/非公民（正式或法律用语），或（3）陌生、异样的。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from another planet; a creature from outer space","zh":"外星人；来自外太空的生物"},"examples":[{"en":"In many movies, aliens visit Earth in spaceships.","zh":"在很多电影里，外星人乘坐飞船来到地球。"},{"en":"Do you believe aliens exist somewhere in the universe?","zh":"你相信宇宙里某处存在外星人吗？"}]},{"partOfSpeech":"n.","definition":{"en":"someone who is not a citizen of a country (often used in legal or formal contexts)","zh":"外国人；外侨（法律或正式语境常用）"},"examples":[{"en":"The law treats citizens and aliens differently in some cases.","zh":"在某些情况下，法律对公民和外国人的待遇不同。"},{"en":"He was registered as a legal alien before becoming a citizen.","zh":"在成为公民之前，他登记为合法外国人。"}]},{"partOfSpeech":"adj.","definition":{"en":"strange, unfamiliar, or very different from what you know","zh":"陌生的；异样的；与熟悉事物很不一样的"},"examples":[{"en":"The customs felt alien to her at first.","zh":"起初这些风俗对她来说很陌生。"},{"en":"He had an alien expression, as if he didn’t recognize anyone.","zh":"他的表情很异样，仿佛谁都不认识。"}]}],"synonyms":["extraterrestrial","foreigner","strange","unfamiliar"],"phonetic":"/ˈeɪliən/","extraExplanation":["你输入的“ayens”更像是“aliens”的拼写或发音误写。正确拼写通常是：alien（单数）/ aliens（复数）。","“alien”在科幻语境里最常见是“外星人”；在美国英语的法律/新闻中也会用来指“非公民”，但日常口语里更常说“immigrant（移民）”或“foreign national（外国公民）”，以避免冷冰冰或带有距离感。"]}
{"word":"ayenst","summary":{"en":"Against means “in opposition to,” “competing with,” “touching/pressed to,” “as protection from,” or “in contrast to.”","zh":"Against 常表示“反对”“与……对抗/比赛”“靠着/贴着”“防/抗”“与……对照/以……为背景”。"},"definitions":[{"partOfSpeech":"prep.","definition":{"en":"(Preposition) In opposition to; not in favor of.","zh":"（介词）反对；不赞成。"},"examples":[{"en":"I’m against the plan because it costs too much.","zh":"我反对这个计划，因为它太贵了。"},{"en":"They voted against the new rule.","zh":"他们投票反对这项新规定。"}]},{"partOfSpeech":"prep.","definition":{"en":"(Preposition) Competing with; facing an opponent in a game, fight, or comparison.","zh":"（介词）与……对抗；与……比赛；和……相比。"},"examples":[{"en":"Our team will play against theirs tomorrow.","zh":"我们队明天要和他们队比赛。"},{"en":"It’s hard to compete against a much larger company.","zh":"和规模大得多的公司竞争很难。"}]},{"partOfSpeech":"prep.","definition":{"en":"(Preposition) Touching or pressed to; supported by a surface.","zh":"（介词）倚着；靠着；贴着。"},"examples":[{"en":"He leaned against the wall.","zh":"他靠在墙上。"},{"en":"Put the ladder against the tree.","zh":"把梯子靠在树上。"}]},{"partOfSpeech":"prep.","definition":{"en":"(Preposition) Preventing or protecting from something harmful; as a defense.","zh":"（介词）防；抗；预防（不好的事）。"},"examples":[{"en":"This vaccine protects against the flu.","zh":"这种疫苗可以预防流感。"},{"en":"They saved money against future problems.","zh":"他们存钱以防将来出现问题。"}]},{"partOfSpeech":"prep.","definition":{"en":"(Preposition) In contrast to a background or standard; seen or measured relative to something.","zh":"（介词）以……为背景；与……对照；相对于（标准）。"},"examples":[{"en":"The mountains looked dark against the sunset.","zh":"群山在晚霞的映衬下显得很暗。"},{"en":"Check your results against last year’s data.","zh":"把你的结果和去年的数据对照一下。"}]}],"synonyms":["opposed to","versus","in opposition to","contrary to","against (touching) ≈ on/against (context-dependent)"],"phonetic":"/əˈɡɛnst/","extraExplanation":["你输入的“ayenst”很可能是拼写错误；正确拼写是 **against**。常见错拼还包括 *agianst*。","发音上，against 在美式英语里常见弱读，口语里 /ə-/ 很轻，结尾 /-st/ 要发清楚。","常见搭配：**against the law**（违法）、**against the rules**（违反规则）、**against my will**（违背我的意愿）、**against all odds**（克服重重困难）。","语义区分小提示：表示“反对”常用 be against；表示“靠着”常用 lean/put something against；表示“防护”常用 protect/guard against。"]}
{"word":"Ayer","summary":{"en":"Ayer is usually a proper noun in English: a surname (notably A. J. Ayer) or a place name (e.g., Ayer, Massachusetts).","zh":"Ayer 在英语里通常是专有名词：一个姓氏（如哲学家 A. J. Ayer）或一个地名（如美国马萨诸塞州的 Ayer）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), best known in English from the British philosopher A. J. Ayer.","zh":"一个英文里的姓氏（家族姓），在英语世界中较有名的是英国哲学家 A. J. Ayer。"},"examples":[{"en":"In class we read a short piece by A. J. Ayer about language and meaning.","zh":"课上我们读了一段 A. J. Ayer（艾耶尔）关于语言与意义的文字。"},{"en":"The author’s last name is Ayer, spelled A-Y-E-R.","zh":"这位作者的姓是 Ayer，拼作 A-Y-E-R。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name in English (for example, “Ayer, Massachusetts” in the U.S.).","zh":"一个英文地名（例如美国的 “Ayer, Massachusetts / 马萨诸塞州的艾耶尔”）。"},"examples":[{"en":"She lives near Ayer, Massachusetts.","zh":"她住在马萨诸塞州的艾耶尔附近。"},{"en":"The train stops at Ayer before heading to Boston.","zh":"火车去波士顿前会在艾耶尔停靠。"}]}],"phonetic":"/ˈaɪər/","extraExplanation":["在西班牙语里，ayer 是“小写”的常用词，意思是“昨天”。但在英语中，Ayer（首字母大写）通常被当作专有名词（姓氏或地名）来使用，发音也不同。"]}
{"word":"Ayers","summary":{"en":"“Ayers” is most commonly a surname; it can also appear as an old-fashioned plural spelling related to “air/airs,” though that usage is rare today.","zh":"“Ayers”最常见是姓氏；也可能出现在与“air/airs（空气）”相关的古旧复数拼写中，但这种用法如今很少见。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname).","zh":"姓氏（家族姓）。"},"examples":[{"en":"Dr. Ayers will see you now.","zh":"艾尔斯医生现在要见你。"},{"en":"My teacher’s last name is Ayers.","zh":"我老师的姓是艾尔斯。"}]},{"partOfSpeech":"other","definition":{"en":"Plural form of the rare/old spelling “ayer/ayre,” meaning “air” (not common in modern English).","zh":"罕见/古旧拼写“ayer/ayre”的复数，意思是“空气”（现代英语中不常用）。"},"examples":[{"en":"In old writing, you may see “ayres” used where modern English would use “airs.”","zh":"在旧文献里，你可能会看到用“ayres”来表示现代英语的“airs（空气/气息）”。"}]}],"phonetic":"/ɛrz/","extraExplanation":["“Ayers”也常出现在地名或历史称呼中，例如“Ayers Rock”曾是澳大利亚乌鲁鲁（Uluru）的旧称。如今更常用“Uluru”，这是对当地阿南古（Anangu）原住民文化与地名传统的尊重；在正式写作或旅游信息中通常建议使用“Uluru”。"]}
{"word":"ayes","summary":{"en":"“Ayes” means “yes” (plural of “aye”) and often refers to votes in favor in formal settings.","zh":"“ayes”是“aye”的复数，表示“同意/是”，也常指正式表决中的“赞成票/赞成方”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “aye”: a word meaning “yes,” especially used in formal voting or to show agreement","zh":"“aye”的复数：表示“是/同意”，常用于正式表决或表示赞同"},"examples":[{"en":"All in favor, say “aye”—the ayes have it.","zh":"赞成的请说“aye”——赞成票占多数。"},{"en":"I heard several ayes from the back of the room.","zh":"我听到房间后排有好几声“同意”。"}]},{"partOfSpeech":"n.","definition":{"en":"votes in favor; the people who voted “yes” in a decision","zh":"赞成票；投“同意”的人（或这一方）"},"examples":[{"en":"The motion passed with 23 ayes and 12 nays.","zh":"该动议以23票赞成、12票反对通过。"},{"en":"The chair asked the ayes to raise their hands.","zh":"主席请赞成的一方举手。"}]}],"synonyms":["yeses","votes in favor","approvals"],"phonetic":"/aɪz/","extraExplanation":["“ayes and nays”是英美议会或会议里常见的固定搭配：ayes 表示“赞成”，nays 表示“反对”。在日常口语里，人们通常说 yes / yeah，而 aye 更偏正式或带有历史、文学/戏剧色彩。"]}
{"word":"Ayesha","summary":{"en":"Ayesha is a common female given name, often used in Muslim communities; it’s a spelling variant of Aisha/Aysha.","zh":"Ayesha 是常见的女性名字，多见于穆斯林群体；常被视为 Aisha/Aysha 的拼写变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A female given name (a proper noun), common among Muslims and in South Asian, Middle Eastern, and African communities; also spelled Aisha/Aysha.","zh":"女性名字（专有名词），在穆斯林群体以及南亚、中东、非洲等地区较常见；也常拼作 Aisha / Aysha。"},"examples":[{"en":"Ayesha is my classmate; she moved here from Karachi.","zh":"Ayesha 是我的同学；她从卡拉奇搬来这里。"},{"en":"Please ask Ayesha if she can join the meeting at 3 p.m.","zh":"请问一下 Ayesha 她能不能参加下午三点的会议。"}]}],"synonyms":["Aisha","Aysha"],"phonetic":"/ɑːˈjiːʃə/","extraExplanation":["“Ayesha”常被视为阿拉伯语女性名“Aisha/A’isha”的一种英语拼写变体。该名字与伊斯兰传统中先知穆罕默德的妻子之一“Aisha”有关，因此在许多穆斯林家庭中具有文化与宗教上的亲切感。","不同地区的读法和拼写会有差异：Ayesha / Aisha / Aysha 都可能指同一个名字。英文交流中，礼貌做法是询问对方偏好的发音与拼写（例如用于邮件署名）。"]}
{"word":"AYH","summary":{"en":"AYH is a casual texting abbreviation for “Are you home?”","zh":"AYH 是聊天中常用的缩写，意思是“你在家吗？”"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(texting, informal) Abbreviation for “Are you home?” used to ask someone if they are at home right now.","zh":"（短信/聊天，非正式）“Are you home?” 的缩写，用来问对方现在是否在家。"},"examples":[{"en":"AYH? I’m downstairs.","zh":"AYH？我在楼下。"},{"en":"Text me when AYH so I can call.","zh":"你到家（AYH）后发我消息，我再打给你。"}]}],"synonyms":["Are you home?","R u home?","Home?"],"phonetic":"/ˌeɪ waɪ ˈeɪtʃ/","extraExplanation":["“AYH”最常见于英文短信或聊天里，通常按字母读（A-Y-H），语气很口语、很简短。","注意：缩写在不同圈子里可能有别的含义（比如某些组织/群组名）。如果你是在特定文章、游戏或社群里看到的，给我上下文句子，我可以帮你确认准确意思。"]}
{"word":"ayield","summary":{"en":"Yield means to produce results or amounts, or to give way/let others go first; as a noun, it means production or investment return.","zh":"Yield表示“产出/带来结果”或“让步/让行”；作名词时表示“产量”或“投资收益”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to produce or provide (a result, profit, or amount of something)","zh":"（产出、带来）产生；出产；带来（结果、利润或数量）"},"examples":[{"en":"This farm yields about 2,000 kilos of rice a year.","zh":"这个农场每年出产大约2000公斤大米。"},{"en":"Regular practice can yield better results.","zh":"规律练习可以带来更好的结果。"}]},{"partOfSpeech":"v.","definition":{"en":"to give way or stop resisting; to surrender or agree to something after pressure","zh":"（让步或停止抵抗）屈服；让步；同意（通常是在压力之下）"},"examples":[{"en":"He refused to yield to pressure.","zh":"他拒绝向压力让步。"},{"en":"The enemy finally yielded.","zh":"敌军最终投降了。"}]},{"partOfSpeech":"v.","definition":{"en":"to move aside to allow someone or something to pass","zh":"（让路）避让；让行"},"examples":[{"en":"Cars must yield to pedestrians at the crosswalk.","zh":"汽车在斑马线前必须礼让行人。"},{"en":"Please yield to oncoming traffic.","zh":"请让行于对向来车。"}]},{"partOfSpeech":"n.","definition":{"en":"the amount produced (e.g., crops), or the return/profit from an investment","zh":"（产量）产出量；（收益）回报率；收益"},"examples":[{"en":"The apple yield was low this year because of the weather.","zh":"由于天气原因，今年苹果产量很低。"},{"en":"Bonds usually offer a steady yield.","zh":"债券通常提供稳定的收益。"}]}],"synonyms":["produce","generate","provide","surrender","give way","concede","let pass","return"],"phonetic":"/jild/","extraExplanation":["你输入的“ayield”可能是把“a yield（一个收益/产量）”连在一起写了，常见单词是“yield”。","常用变形：yielded（过去式/过去分词），yielding（现在分词）。","交通标志“YIELD”在美国很常见，意思是“减速并让行”，不一定完全停下，除非有行人或车需要先通过。"]}
{"word":"ayin","summary":{"en":"Ayin is the Hebrew letter ע (and the traditional sound associated with it in Semitic linguistics).","zh":"Ayin 指希伯来字母 ע，以及闪米特语言学中与之相关的传统辅音音。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The 16th letter of the Hebrew alphabet (ע), also used in Jewish and Semitic-language studies to represent a historical throat sound.","zh":"希伯来字母表的第16个字母（ע），在犹太与闪米特语言研究中也用来表示一种历史上的喉音/咽音。"},"examples":[{"en":"In Hebrew class, we practiced writing ayin (ע) and memorizing its name.","zh":"在希伯来语课上，我们练习写 ayin（ע），并记住它的字母名称。"},{"en":"Some textbooks transliterate Arabic and Hebrew with symbols for ayin to show older pronunciation differences.","zh":"有些教材在转写阿拉伯语和希伯来语时会用符号标出 ayin，以体现较早的发音差异。"}]},{"partOfSpeech":"n.","definition":{"en":"A consonant sound in Semitic linguistics traditionally associated with the letter ʿayin, often described as a pharyngeal (throat) sound in languages like Arabic.","zh":"闪米特语言学中与字母 ʿayin 对应的一种辅音音位，常被描述为类似阿拉伯语中的“咽音/喉音”。"},"examples":[{"en":"Modern Hebrew usually does not pronounce the ayin sound distinctly, but Arabic often does.","zh":"现代希伯来语通常不再清晰地区分 ayin 的音，但阿拉伯语里往往仍会发出来。"}]}],"synonyms":["ʿayin","ayin (ע)"],"phonetic":"ˈaɪɪn","extraExplanation":["“Ayin”常见的另一种拼写是“ayin/ʿayin”。在学术转写里，开头的弯引号样符号（ʿ）用来提示这是一个特殊的历史辅音，不是普通的元音开头。","字母名“ayin”在闪米特语言里与“眼睛”有关（希伯来语 עַיִן 也可表示“眼/泉眼”），所以你有时会在词源或文化介绍里看到“eye/spring”的解释。"]}
{"word":"Ayina","summary":{"en":"Ayina is most commonly used in English as a personal name; its meaning depends on cultural/language background.","zh":"Ayina 在英语中最常见用法是人名；具体含义取决于其文化与语言背景。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a personal name (given name). It is used in different cultures, and the meaning can vary by language and region.","zh":"人名（名字）。在不同文化中都可能使用，其含义会因语言与地区而不同。"},"examples":[{"en":"Ayina moved to the U.S. last year for school.","zh":"Ayina 去年为了上学搬到了美国。"},{"en":"I’m not sure how to pronounce Ayina—could you say it for me?","zh":"我不确定 Ayina 怎么读，你能读给我听吗？"}]}],"phonetic":"/aɪˈiːnə/","extraExplanation":["“Ayina”在英语里通常被当作专有名词（人名）来使用，所以词典里未必有固定释义。不同地区可能有不同来源与含义，也可能是其他名字（如“Aina”）的变体拼写。","如果你告诉我它来自哪种语言/国家（例如：加纳、埃塞俄比亚、印度等）或你想表达的具体含义，我可以进一步查证其词源、文化含义与更贴近的发音。"]}
{"word":"ayins","summary":{"en":"Ayins is the plural of ayin, the Hebrew letter ע, and can also refer to the traditional sound linked to that letter in Semitic languages.","zh":"Ayins 是 ayin 的复数，指希伯来字母 ע；也可指在某些闪米特语中与该字母相关的传统发音。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the 16th letter of the Hebrew alphabet: ע (called “ayin”)","zh":"希伯来字母表第16个字母：ע（名称为“ayin”）"},"examples":[{"en":"In Hebrew dictionaries, you can look up words under the letter ayin (ע).","zh":"在希伯来语词典里，你可以按字母 ayin（ע）来查词。"},{"en":"The word is spelled with an ayin at the beginning.","zh":"这个词开头用的是字母 ayin。"}]},{"partOfSpeech":"n.","definition":{"en":"(linguistics) the sound traditionally associated with the letter ayin in some Semitic languages, often described as a deep throat (pharyngeal) consonant","zh":"（语言学）在一些闪米特语中与字母 ayin 相关的传统发音，常被描述为一种较深的“喉/咽部”辅音"},"examples":[{"en":"Some learners find the ayin sound difficult because it comes from deep in the throat.","zh":"一些学习者觉得 ayin 的发音很难，因为它发声位置很靠喉咙深处。"},{"en":"Modern Israeli Hebrew usually does not clearly pronounce the ayin sound.","zh":"现代以色列希伯来语里，ayin 的传统音值通常不会被清晰发出来。"}]}],"synonyms":["ayin","ע","ʿayin"],"phonetic":"ˈaɪ.ɪnz","extraExplanation":["“ayins”是“ayin”的复数，常见于讨论拼写、字母顺序或文本校勘（比如比较不同手稿里某个词是否写了 ע）。","在英语写作中，ayin 也常被写作 ‘ayin 或 ʿayin（带一个类似反引号/弯引号的符号），用来提示它在传统语音里不是普通的元音字母。"]}
{"word":"Aylesbury","summary":{"en":"Aylesbury is a town in Buckinghamshire, England; it also appears in the name of the Aylesbury duck.","zh":"Aylesbury 是英格兰白金汉郡的一座城镇；它也用于“艾尔斯伯里鸭”的名称中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a town in Buckinghamshire, England (often known as the county town of Buckinghamshire).","zh":"英格兰白金汉郡的一座城镇（常被称为白金汉郡的郡治/郡城）。"},"examples":[{"en":"She lives in Aylesbury and commutes to London for work.","zh":"她住在艾尔斯伯里，上班通勤去伦敦。"},{"en":"We stopped in Aylesbury for lunch on the way to Oxford.","zh":"我们去牛津的路上在艾尔斯伯里停下来吃午饭。"}]},{"partOfSpeech":"adj.","definition":{"en":"used to describe a traditional British breed of duck (the Aylesbury duck), known for its white feathers.","zh":"（用于指）英国传统家鸭品种“艾尔斯伯里鸭”，以白色羽毛闻名。"},"examples":[{"en":"Aylesbury duck was once a famous local product of the area.","zh":"艾尔斯伯里鸭曾是当地非常有名的特产。"}]}],"phonetic":"/ˈeɪlzˌbɛri/","extraExplanation":["Aylesbury 是英国英格兰东南部白金汉郡的重要城镇，日常英语中通常作为地名使用；在写地址时常见 “Aylesbury, Buckinghamshire”。","“Aylesbury duck（艾尔斯伯里鸭）”与该地历史上的养鸭业有关，因此地名也常出现在食物、菜单或农业语境中。"]}
{"word":"aylesbury","summary":{"en":"Aylesbury is a town in Buckinghamshire, England; it can also refer to things from that town or to the Aylesbury duck breed.","zh":"Aylesbury 指英国英格兰白金汉郡的城镇；也可指与该地相关的事物，或“艾尔斯伯里鸭”这一鸭品种。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A market town in Buckinghamshire, England (the county town).","zh":"英国英格兰白金汉郡（Buckinghamshire）的集镇，也是该郡的郡治所在地。"},"examples":[{"en":"Aylesbury is about an hour by train from London.","zh":"从伦敦坐火车到艾尔斯伯里大约一小时。"},{"en":"They moved to Aylesbury for a quieter lifestyle.","zh":"他们搬到艾尔斯伯里，想过更安静的生活。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the town of Aylesbury.","zh":"与艾尔斯伯里（Aylesbury）有关的；来自该地的。"},"examples":[{"en":"She works for the Aylesbury council.","zh":"她在艾尔斯伯里的市政部门工作。"},{"en":"We took an Aylesbury bus into the town center.","zh":"我们坐艾尔斯伯里的公交车进了市中心。"}]},{"partOfSpeech":"n.","definition":{"en":"A large white domestic duck breed originally associated with Aylesbury, once raised for meat.","zh":"艾尔斯伯里鸭：一种大型白色家鸭品种，因与艾尔斯伯里有关而得名，过去常用于肉用养殖。"},"examples":[{"en":"The Aylesbury was once a famous duck breed in England.","zh":"艾尔斯伯里鸭曾是英国很有名的鸭品种。"},{"en":"Some farms still keep Aylesbury ducks for heritage breeding.","zh":"一些农场仍饲养艾尔斯伯里鸭，用于保种繁育。"}]}],"synonyms":["Aylesbury (place name)"],"phonetic":"/ˈeɪlzˌbɛri/","extraExplanation":["“Aylesbury”是专有名词，常见于英国地名语境；作形容词时通常放在名词前（如 Aylesbury station）。","发音里重音在第一个音节：AYLZ-buh-ree（/ˈeɪlzˌbɛri/）。"]}
{"word":"ayless","summary":{"en":"Ayless is a rare/dialect word meaning “healthy; not ill,” and it can also be a surname.","zh":"Ayless 是一个罕见/方言词，意思是“健康的；不生病的”，也可以作姓氏。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare/archaic, dialect) Not ill; free from sickness; healthy.","zh":"（罕见/古旧/方言）不生病的；无病的；健康的。"},"examples":[{"en":"After a few days of rest, he felt ayless again.","zh":"休息了几天后，他又觉得自己恢复健康了。"},{"en":"The old poem praises an ayless body and a quiet mind.","zh":"那首老诗赞美“无病之身”和“宁静之心”。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname).","zh":"姓氏（人名）。"},"examples":[{"en":"Dr. Ayless will see you now.","zh":"Ayless 医生现在可以为你看诊。"}]}],"synonyms":["healthy","well","hale","sound"],"phonetic":"/ˈeɪləs/","extraExplanation":["“ayless”多见于古英语/苏格兰或英格兰北部方言拼写，可理解为由“ail”（生病）衍生出的否定意义：不生病、无恙。现代英语里更常用的表达是“healthy / well / free from illness”。","如果你是想查更常见的词，可能是拼写相近的“ageless（不显老的）”或“aimless（无目的的）”。"]}
{"word":"aylet","summary":{"en":"Aylet is usually a name (variant of Hebrew Ayelet, “doe/gazelle”) and is also commonly a misspelling of “eyelet.”","zh":"Aylet 通常是人名（希伯来语 Ayelet 的变体，意为“母鹿/瞪羚”），也常被用作 eyelet（孔眼）的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Name) A variant spelling of Ayelet, a Hebrew female given name meaning “doe” (a female deer) or “gazelle.”","zh":"（人名）Ayelet 的一种拼写变体，源自希伯来语的女性名字，意为“母鹿”或“瞪羚”。"},"examples":[{"en":"Aylet is a less common spelling of the name Ayelet.","zh":"Aylet 是名字 Ayelet 的一种较少见的拼写。"},{"en":"Aylet told her friends the name comes from Hebrew.","zh":"Aylet 告诉朋友们，这个名字源自希伯来语。"}]},{"partOfSpeech":"other","definition":{"en":"Often a misspelling of “eyelet,” a small hole (usually reinforced with metal) for a lace, string, or cord.","zh":"常被当作“eyelet”的误拼：指用于穿鞋带/绳子的“小孔”（通常有金属孔眼加固）。"},"examples":[{"en":"If you meant the small hole for laces, the correct spelling is eyelet.","zh":"如果你想表达鞋带孔，正确拼写是 eyelet。"},{"en":"One eyelet on the shoe was broken.","zh":"鞋子上的一个鞋带孔坏了。"}]}],"synonyms":["Ayelet","eyelet"],"phonetic":"/aɪˈlɛt/","extraExplanation":["“Ayelet/ Aylet”在以色列及犹太文化语境中较常见，来源于希伯来语，常与自然、敏捷与优雅的意象相关。","如果你是在服装、鞋类、手工或五金语境里看到“aylet”，很可能是把“eyelet（孔眼/鸡眼扣）”拼错了；在购物或说明书里建议用 eyelet 搜索更准确。"]}
{"word":"Aylett","summary":{"en":"Aylett is mainly a surname (and occasionally a given name), and less commonly a place name.","zh":"Aylett 主要是姓氏（偶尔作名字），较少情况下也可作地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surname (family name), and sometimes a given name, used in English-speaking contexts.","zh":"一个英文语境中使用的姓氏（家族姓），有时也可作名字。"},"examples":[{"en":"Dr. Aylett will see you at 3 p.m.","zh":"Aylett 医生会在下午三点见你。"},{"en":"My teacher’s last name is Aylett.","zh":"我老师的姓是 Aylett。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name (less common), found in some English-speaking regions.","zh":"一个地名（较少见），在部分英语地区可以见到。"},"examples":[{"en":"We drove through Aylett on our way to Richmond.","zh":"我们去里士满的路上开车经过了 Aylett。"}]}],"phonetic":"/ˈeɪlɪt/","extraExplanation":["Aylett 多见于英美姓氏系统中，属于专有名词（proper noun）。在书写时通常首字母大写；用于称呼时可与头衔连用，如 Mr. Aylett / Ms. Aylett / Dr. Aylett。","作为地名时，具体所指取决于语境；在美国弗吉尼亚州有名为 Aylett 的社区，因此有时会在地址或行程中看到。"]}
{"word":"ayllu","summary":{"en":"An Andean kin-based community unit that shares land and mutual obligations.","zh":"安第斯地区以亲属关系为核心、共享土地并承担互助义务的传统共同体单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In the Andes (especially in Quechua- and Aymara-speaking regions), a traditional kin-based community or clan-like group that shares land, work, and mutual responsibilities.","zh":"（安第斯地区，尤指克丘亚语与艾马拉语文化中）一种以血缘/亲属关系为核心的传统共同体（类似氏族或村社），成员共享土地、劳作，并承担互助义务。"},"examples":[{"en":"In many Andean villages, the ayllu organizes community work and mutual aid.","zh":"在许多安第斯村落里，ayllu 负责组织社区劳作与互助。"},{"en":"The researcher studied how land is managed within an ayllu.","zh":"这位研究者考察了 ayllu 内部如何管理土地。"},{"en":"For her, returning to the ayllu meant reconnecting with family and tradition.","zh":"对她来说，回到 ayllu 意味着重新与家族和传统建立联系。"}]}],"synonyms":["kin group","clan","community","extended family group"],"phonetic":"ˈaɪ.ju","extraExplanation":["“ayllu”源自克丘亚语，是理解印加及安第斯社会结构的重要概念：它不只是“村庄”，更强调亲属网络、共同拥有/使用资源，以及以互惠（如共同劳作、互相帮忙）维系的社会关系。","在英文写作中常以斜体 ayllu 出现，指一种文化特有的制度与身份归属；语境多见于人类学、历史、拉美研究等领域。"]}
{"word":"Aylmar","summary":{"en":"Aylmar is a rare proper name, often a variant spelling of Aylmer; Aylmer is also known as a character in Hawthorne’s “The Birth-Mark.”","zh":"Aylmar是较少见的专有名词，常被视为Aylmer的拼写变体；Aylmer也因霍桑《胎记》中的人物而为人所知。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a proper name (usually a surname, sometimes a given name); “Aylmar” is a less common spelling, often a variant of “Aylmer.”","zh":"专有名词（多为姓氏，也可作名字）；“Aylmar”较少见，常被视为“Aylmer”的异拼/变体。"},"examples":[{"en":"Dr. Aylmar will see you now.","zh":"艾尔马医生现在可以见你了。"},{"en":"Her last name is Aylmar, spelled A-Y-L-M-A-R.","zh":"她的姓是Aylmar，拼作A-Y-L-M-A-R。"}]},{"partOfSpeech":"n.","definition":{"en":"(literary reference, usually spelled “Aylmer”) a character name—Aylmer is the scientist-husband in Nathaniel Hawthorne’s short story “The Birth-Mark.”","zh":"（文学指代，通常拼作“Aylmer”）人物名——Aylmer是纳撒尼尔·霍桑短篇小说《胎记》（The Birth-Mark）中的科学家丈夫。"},"examples":[{"en":"In Hawthorne’s “The Birth-Mark,” Aylmer becomes obsessed with removing his wife’s tiny mark.","zh":"在霍桑的《胎记》中，Aylmer痴迷于去除妻子脸上的小胎记。"}]}],"synonyms":["Aylmer"],"phonetic":"/ˈeɪlmɚ/","extraExplanation":["“Aylmer”这个名字常被认为与古英语人名有关（如Æthel-开头的名字，含“高贵/贵族”的意思）。现实中多作姓氏；“Aylmar”更像较少见的拼写变体，正式写作时最好确认当事人/文本的准确拼法。","如果你是在文学或历史语境里看到“Aylmar”，很可能是“Aylmer”的误拼；在搜索资料时可以同时用两种拼写检索。"]}
{"word":"Aylmer","summary":{"en":"Aylmer is usually a male first name; it can also refer to a place in Quebec, Canada, and a well-known character in Hawthorne’s “The Birth-Mark.”","zh":"Aylmer 通常是男性名字；也可指加拿大魁北克省的一个地名，以及霍桑《胎记》中的著名人物名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name).","zh":"男性名字（名）。"},"examples":[{"en":"Aylmer is my grandfather’s name.","zh":"Aylmer 是我祖父的名字。"},{"en":"We named our son Aylmer after a family tradition.","zh":"我们按家族传统给儿子取名叫 Aylmer。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name, especially Aylmer, a district of the city of Gatineau in Quebec, Canada (formerly a separate town).","zh":"地名：加拿大魁北克省加蒂诺市的 Aylmer 区（曾为独立城镇）。"},"examples":[{"en":"She lives in Aylmer, near Ottawa.","zh":"她住在 Aylmer，靠近渥太华。"},{"en":"We drove through Aylmer on our way to Gatineau Park.","zh":"我们去加蒂诺公园的路上开车经过了 Aylmer。"}]},{"partOfSpeech":"n.","definition":{"en":"a fictional character name, most famously Aylmer, a scientist in Nathaniel Hawthorne’s short story “The Birth-Mark.”","zh":"文学人物名：最著名的是霍桑短篇《胎记》（“The Birth-Mark”）中的科学家 Aylmer。"},"examples":[{"en":"In Hawthorne’s story, Aylmer tries to remove his wife’s birthmark.","zh":"在霍桑的故事里，Aylmer 试图去除妻子的胎记。"},{"en":"Aylmer is often discussed as a symbol of obsessive perfectionism.","zh":"Aylmer 常被用来讨论“执迷完美”的象征。"}]}],"synonyms":["(as a name) Elmer (similar-sounding)"],"phonetic":"/ˈeɪlmər/","extraExplanation":["Aylmer 作为人名多见于英语文化圈，发音重音在第一音节。","词源上常被认为与古英语人名有关（如 Æthelmaer 一类的形式），含有“高贵/贵族”等成分；现代拼写与含义主要作为专名使用。","霍桑《胎记》中 Aylmer 这个人物常被解读为对科学狂热与“追求完美的代价”的批评；在文学课堂与英文阅读材料里较常出现。"]}
{"word":"Aylsworth","summary":{"en":"Aylsworth is mostly used as a surname (family name), and only rarely as a given name.","zh":"Aylsworth 多用于姓氏，偶尔也可作名字。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname).","zh":"姓氏（家族名）。"},"examples":[{"en":"Dr. Aylsworth will lead today’s seminar.","zh":"Aylsworth 博士将主持今天的研讨会。"},{"en":"My teacher’s last name is Aylsworth.","zh":"我老师的姓是 Aylsworth。"}]},{"partOfSpeech":"other","definition":{"en":"a given name used rarely (more common as a surname).","zh":"罕见的名字（更常见作姓氏）。"},"examples":[{"en":"They named their son Aylsworth to honor a relative.","zh":"他们给儿子取名 Aylsworth 以纪念一位亲属。"}]}],"synonyms":["Aylesworth"],"phonetic":"ˈeɪlzˌwɝθ","extraExplanation":["Aylsworth 通常被视为英语系姓氏的拼写形式之一，常见的相关拼写有 Aylesworth。此类姓氏往往源自地名（“来自某地的人”）或家族传统，因此具体含义常与某个地点或家族历史相关。"]}
{"word":"Aylward","summary":{"en":"Aylward is mainly a surname (family name), and more rarely a given name.","zh":"Aylward 主要是一个姓氏（家族姓），较少情况下也可作名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname) of English or Irish origin; used to refer to a person with that last name","zh":"一个英语或爱尔兰语源的姓氏；用来指代姓为 Aylward 的人"},"examples":[{"en":"Dr. Aylward will see you at 3 p.m.","zh":"Aylward 医生会在下午三点见你。"},{"en":"I met Ms. Aylward at the conference.","zh":"我在会议上见到了 Aylward 女士。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a given name, usually based on the surname","zh":"（较少见）用作名字，通常由姓氏演变而来"},"examples":[{"en":"Aylward is an uncommon first name today.","zh":"Aylward 现在作为名字并不常见。"}]}],"synonyms":["(no direct synonyms; it is a proper name)"],"phonetic":"/ˈeɪlwərd/","extraExplanation":["Aylward 通常被看作源自中古英语人名元素（与“noble/guardian”等含义相关的构词成分有关），也常见于爱尔兰（有时与爱尔兰姓氏传统相关）。作为专有名词，它本身不表示“一个普通词汇的意思”，主要功能是辨认身份。","在英文写作里，遇到不熟悉的姓氏时，可以关注大小写：Aylward 首字母大写通常表示人名/姓氏；若出现在地址簿、学术引用、公司名称中，也多为姓氏或品牌名。"]}
{"word":"Aym","summary":{"en":"Likely meaning: “aim” — to direct toward a target, or a goal/purpose.","zh":"很可能是“aim”：指“瞄准/针对”，或“目标/目的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to point or direct something (such as a weapon, camera, or effort) toward a target or goal","zh":"把（武器、镜头或努力等）对准目标；以……为目标"},"examples":[{"en":"Aim the camera at the mountains.","zh":"把相机对准群山。"},{"en":"We are aiming to finish the project by Friday.","zh":"我们计划在周五前完成这个项目。"},{"en":"Her advice is aimed at helping beginners.","zh":"她的建议是针对帮助初学者的。"}]},{"partOfSpeech":"n.","definition":{"en":"a purpose or goal; something you try to achieve","zh":"目的；目标"},"examples":[{"en":"The main aim of the course is to improve speaking skills.","zh":"这门课的主要目标是提高口语能力。"},{"en":"Their aim is simple: provide safe, affordable housing.","zh":"他们的目标很简单：提供安全、可负担的住房。"}]}],"synonyms":["goal","purpose","target","intend","plan"],"phonetic":"/eɪm/","extraExplanation":["“Aym”在英语里不常见，很多情况下是“aim”的拼写错误或非标准写法；“aim”的发音是 /eɪm/。","“aim”既可以指“对准”（具体动作），也可以指“目标”（抽象目的）。常见搭配：aim at（瞄准/针对）、aim to do（力求做某事）、with the aim of（以……为目的）。","“AYM”也可能是缩写（不同领域含义不同）。如果你是在特定文章、游戏、公司或聊天里看到的“Aym”，告诉我上下文，我可以帮你判断它是不是缩写或人名。"]}
{"word":"Aymara","summary":{"en":"Aymara refers to an Indigenous people of the Andes (especially Bolivia and Peru), their language, and things related to their culture.","zh":"Aymara 指安第斯地区的原住民族艾马拉人、他们的语言艾马拉语，以及与其文化相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an Indigenous people who mainly live in the Andes around Lake Titicaca (especially in Bolivia and Peru, also Chile and Argentina)","zh":"艾马拉人；主要居住在的的喀喀湖周边安第斯山区的原住民族（以玻利维亚、秘鲁为主，也分布于智利和阿根廷）"},"examples":[{"en":"Many Aymara communities live on the Altiplano in Bolivia.","zh":"许多艾马拉社群生活在玻利维亚的高原地区。"},{"en":"The museum worked with Aymara leaders to present the history respectfully.","zh":"博物馆与艾马拉领袖合作，以尊重的方式呈现这段历史。"}]},{"partOfSpeech":"n.","definition":{"en":"the Indigenous language spoken by the Aymara people","zh":"艾马拉语；艾马拉人使用的原住民语言"},"examples":[{"en":"She is learning Aymara to speak with her grandparents.","zh":"她正在学习艾马拉语，好和祖父母交流。"},{"en":"The school offers classes in Spanish and Aymara.","zh":"这所学校提供西班牙语和艾马拉语课程。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Aymara people or their language and culture","zh":"与艾马拉人、艾马拉语或其文化相关的；艾马拉的"},"examples":[{"en":"They performed Aymara music at the festival.","zh":"他们在节日上表演了艾马拉音乐。"},{"en":"The sign includes Aymara words alongside Spanish.","zh":"标牌上除了西班牙语，还写了艾马拉语词汇。"}]}],"synonyms":["Aymara people","Aymara language"],"phonetic":"/aɪˈmɑːrə/","extraExplanation":["“Aymara”是一个专名，英语里常写作大写，既可指“艾马拉人”，也可指“艾马拉语”。","在一些语境中也会见到更具体的说法：the Aymara people（艾马拉民族）、the Aymara language（艾马拉语）。","谈到原住民族与语言时，英语表达上更强调尊重与准确：例如优先使用群体自称（若明确）以及使用people/community等中性词。"]}
{"word":"aymara","summary":{"en":"Aymara refers to an Indigenous Andean people, their language, and anything related to their culture.","zh":"Aymara 指安第斯地区的艾马拉族群、艾马拉语，以及与其文化相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an Indigenous people living mainly in the Andes around Bolivia, Peru, and northern Chile","zh":"艾马拉人：主要居住在安第斯山区（以玻利维亚、秘鲁及智利北部为主）的原住民族群成员"},"examples":[{"en":"Many Aymara communities live near Lake Titicaca.","zh":"许多艾马拉社区居住在的的喀喀湖附近。"},{"en":"The museum has an exhibit about Aymara history and weaving.","zh":"博物馆有一个关于艾马拉历史与织布艺术的展览。"}]},{"partOfSpeech":"n.","definition":{"en":"the Indigenous language spoken by the Aymara people","zh":"艾马拉语：艾马拉人使用的原住民语言"},"examples":[{"en":"She speaks Aymara at home and Spanish at school.","zh":"她在家说艾马拉语，在学校说西班牙语。"},{"en":"This phrasebook includes basic Aymara greetings.","zh":"这本会话手册包含基础的艾马拉语问候语。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Aymara people or their language and culture","zh":"与艾马拉人、艾马拉语或其文化相关的"},"examples":[{"en":"They studied Aymara traditions of farming at high altitude.","zh":"他们研究了艾马拉人在高海拔地区的传统农耕方式。"},{"en":"The class listened to Aymara music and learned key vocabulary.","zh":"课堂上听了艾马拉音乐，并学习了一些关键词汇。"}]}],"synonyms":["Aymaran (adj.)"],"phonetic":"/aɪˈmɑːrə/","extraExplanation":["“Aymara”既可指族群也可指语言；写作时常用大写。谈到语言时也可写作“the Aymara language”。","艾马拉语与克丘亚语（Quechua）同为安第斯地区重要原住民语言，但两者是不同语言；很多当地人会同时使用西班牙语与原住民语言（双语/多语）。","在一些文学与人类学作品中，会出现与安第斯世界观相关的表达（如对时间与空间的理解），但日常学习中先掌握其作为“民族/语言/文化”的基本用法最实用。"]}
{"word":"Aymaran","summary":{"en":"Aymaran means “related to the Aymara people/culture” or “the Aymara language(s).”","zh":"Aymaran 指“与艾马拉人/文化相关的”，也可指“艾马拉语（或艾马拉语言群）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Aymara people or their culture in the Andes (especially Bolivia, Peru, and northern Chile).","zh":"（形容词）与安第斯地区的艾马拉人或其文化有关（尤指玻利维亚、秘鲁和智利北部）。"},"examples":[{"en":"Aymaran communities have lived around Lake Titicaca for centuries.","zh":"艾马拉人社群在的的喀喀湖周边生活了数百年。"},{"en":"She is studying Aymaran history and traditions.","zh":"她正在学习艾马拉人的历史与传统。"}]},{"partOfSpeech":"n.","definition":{"en":"the Aymara language, or the group (family) of related languages sometimes called the Aymaran languages.","zh":"（名词）艾马拉语；或指有时被称为“艾马拉语族/艾马拉语言群”的相关语言群。"},"examples":[{"en":"He can speak Aymaran as well as Spanish.","zh":"他会说艾马拉语，也会说西班牙语。"},{"en":"Some linguists classify Aymaran as a small language family in the Andes.","zh":"一些语言学家把艾马拉语视为安第斯地区的一个小语系。"}]}],"synonyms":["Aymara","Aymara language","Andean indigenous (context-dependent)"],"phonetic":"/aɪˈmɑrən/","extraExplanation":["“Aymaran”常用来表示“艾马拉语（Aymara）相关的”，也可指“艾马拉语族/语言群”。日常英语里更常见的说法是“Aymara”（既可作名词也可作形容词）；“Aymaran”相对更偏学术、语言学语境。","发音里重音通常落在第二个音节：ay-MAR-an。","与“American/European”等词一样，-an 结尾常表示“属于……的人/语言/文化”的形容词或名词形式。"]}
{"word":"aymaran","summary":{"en":"Aymaran means “related to the Aymara people or their language,” and can also mean an Aymara person or the Aymara language.","zh":"Aymaran 指“与艾马拉民族或其语言有关的”，也可指艾马拉人或艾马拉语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Aymara people, their language, or their culture (mainly in the Andes of Bolivia, Peru, and Chile)","zh":"与艾马拉（Aymara）民族、其语言或文化有关的（主要分布在玻利维亚、秘鲁和智利的安第斯地区）"},"examples":[{"en":"She is studying Aymaran grammar for her linguistics class.","zh":"她在语言学课上学习艾马拉语的语法。"},{"en":"Aymaran traditions remain strong around Lake Titicaca.","zh":"的的喀喀湖周边地区的艾马拉传统依然很强。"}]},{"partOfSpeech":"n.","definition":{"en":"a member of the Aymara people, or an Aymara language (a variety of Aymara)","zh":"艾马拉人；（也可指）艾马拉语（或其一种变体）"},"examples":[{"en":"Many Aymarans are bilingual in Spanish and Aymara.","zh":"许多艾马拉人会说西班牙语和艾马拉语两种语言。"},{"en":"He interviewed Aymaran speakers in rural communities.","zh":"他在乡村社区采访了说艾马拉语的人。"}]}],"synonyms":["Aymara"],"phonetic":"/aɪˈmɑrən/","extraExplanation":["“Aymaran”常见于语言学或人类学语境，用来指“艾马拉语系/艾马拉语言群”或与之相关的文化现象；日常表达里更常见的说法是“Aymara (people/language)”来指“艾马拉人/艾马拉语”。","地理与文化背景：艾马拉人主要生活在安第斯高原地区（尤其是玻利维亚西部、秘鲁南部），与克丘亚（Quechua）文化同处安第斯文明圈，但语言不同。"]}
{"word":"Aymaras","summary":{"en":"Aymaras refers to the Aymara people, an Indigenous group in the Andes, and can also refer to their language (Aymara).","zh":"Aymaras 指安第斯地区的艾马拉族群，也可指他们使用的语言（艾马拉语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an Indigenous people who mainly live in the Andes around western Bolivia, southern Peru, and northern Chile","zh":"艾马拉人：主要居住在安第斯山脉地区（以玻利维亚西部为主，也包括秘鲁南部和智利北部）的原住民族成员"},"examples":[{"en":"Many Aymaras live near Lake Titicaca.","zh":"许多艾马拉人居住在的的喀喀湖附近。"},{"en":"The museum has an exhibit on Aymara culture and weaving.","zh":"博物馆有一个关于艾马拉文化与编织的展览。"}]},{"partOfSpeech":"n.","definition":{"en":"the Indigenous language spoken by the Aymara people (also called Aymara)","zh":"艾马拉语：艾马拉人使用的原住民语言（也可写作 Aymara）"},"examples":[{"en":"She is learning Aymara to communicate with her grandparents.","zh":"她正在学习艾马拉语，以便和祖父母交流。"},{"en":"Some schools offer classes in Spanish and Aymara.","zh":"一些学校提供西班牙语和艾马拉语的课程。"}]}],"synonyms":["Aymara people","Aymara (language)"],"phonetic":"/aɪˈmɑːrə/","extraExplanation":["英语里常见拼写是 Aymara（单数/形容词）与 Aymaras（复数名词）。例如：an Aymara woman（一位艾马拉女性）/ Aymara traditions（艾马拉传统）/ the Aymaras（艾马拉人这个群体）。","Aymara 与 Quechua（克丘亚语/克丘亚人）常一起出现在安第斯地区的历史与文化语境中，但它们是不同的民族与语言。"]}
{"word":"Ayme","summary":{"en":"Ayme is most commonly used as a personal name (a variant spelling of Amy) or as a surname.","zh":"Ayme 通常用作人名（Amy 的变体拼写）或姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (a variant spelling of “Amy”), usually pronounced the same as Amy","zh":"人名（常见为“Amy”的变体拼写），通常与 Amy 同音"},"examples":[{"en":"Ayme is my classmate; her name is spelled A‑y‑m‑e.","zh":"Ayme 是我的同学；她的名字拼作 A‑y‑m‑e。"},{"en":"Ayme Nguyen will present the project today.","zh":"Ayme Nguyen 今天将做项目展示。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname)","zh":"姓氏（家族姓）"},"examples":[{"en":"Dr. Ayme works in the cardiology department.","zh":"Ayme 医生在心脏科工作。"},{"en":"The email is last name + first name, so “Ayme.Jordan@…”.","zh":"邮箱格式是“姓+名”，所以是“Ayme.Jordan@…”。"}]}],"synonyms":["Amy"],"phonetic":"/ˈeɪmi/","extraExplanation":["“Ayme”在英语语境里多被当作名字或姓氏使用，最常见的读法与“Amy”相同（/ˈeɪmi/）。有时也会受到法语拼写的影响，让人联想到法语里与“爱/喜爱”相关的词（如 *aimer* “爱”、*aimé* “被爱的”），但在英文里通常仍按人名来理解。"]}
{"word":"ayme","summary":{"en":"“Ayme” is mainly used as a personal name, often linked to the French “Aimée,” meaning “beloved.”","zh":"“Ayme”主要用作人名，常与法语“Aimée”相关，含义为“被爱的人/心爱的人”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name (usually feminine), a spelling variant of the French name “Aimée,” meaning “beloved.”","zh":"人名（多为女性名），常被视为法语名字“Aimée”的一种拼写变体，意思是“被爱的人 / 心爱的人”。"},"examples":[{"en":"Ayme introduced herself at the start of the meeting.","zh":"Ayme 在会议开始时做了自我介绍。"},{"en":"Her name is Ayme—A-Y-M-E.","zh":"她的名字是 Ayme——拼作 A-Y-M-E。"}]}],"synonyms":["Aimée"],"phonetic":"/eɪˈmeɪ/","extraExplanation":["“Ayme”在英语里不是常见词汇，更常见的是法语名字“Aimée”（带重音符号 é）。在英文环境中，有时会把“Aimée”简化或改写成“Ayme”。","如果你本来想查的是动词/名词“aim”（目标、瞄准），那是另一个词：aim /eɪm/。你可以告诉我你想表达的句子，我可以帮你确认是哪一个。"]}
{"word":"Aymer","summary":{"en":"Aymer is a historical male given name and surname, often found in medieval contexts.","zh":"Aymer 是一个带有历史色彩的男性名字或姓氏，常见于中世纪相关语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a masculine given name and surname, used especially in medieval and historical contexts","zh":"（男性）名字或姓氏，常见于中世纪与历史语境"},"examples":[{"en":"Aymer is a character name you might see in a medieval novel.","zh":"Aymer 这个名字你可能会在中世纪题材的小说里见到。"},{"en":"The record mentions Aymer as a landholder in the 1300s.","zh":"这份记录提到 Aymer 在 14 世纪是个地主。"}]}],"synonyms":["Aimer","Aimery","Aymeric"],"phonetic":"/ˈeɪmər/","extraExplanation":["Aymer 多被视为中古英语/盎格鲁-诺曼语圈里的名字形式，常与 Aimer、Aimery、Aymeric 等拼写变体相关。","历史上较知名的人物之一是 Aymer de Valence（艾默·德·瓦朗斯，约 1275–1324），英格兰的彭布罗克伯爵；因此该名字在英国中世纪史与相关文学/历史写作中偶尔出现。","名字词源一般被认为与中古法语/诺曼法语传统有关，并可追溯到更早的日耳曼语人名构词（不同资料对具体来源解释略有差异）。"]}
{"word":"Aymoro","summary":{"en":"“Aymoro” is usually a nonstandard spelling of “Aymara,” the people and language of the Andes.","zh":"“Aymoro”通常是“Aymara”的非标准拼写，指安第斯地区的艾马拉人及其语言。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare or nonstandard spelling of “Aymara,” referring to the Aymara people or the Aymara language in the Andes (especially Bolivia and Peru).","zh":"“Aymara”的罕见或非标准拼写，指安第斯地区（尤其玻利维亚、秘鲁）的艾马拉人或艾马拉语。"},"examples":[{"en":"In most English sources, you will see “Aymara,” not “Aymoro.”","zh":"在大多数英文资料里，你会看到“Aymara”，而不是“Aymoro”。"},{"en":"She is studying the Aymara language spoken around Lake Titicaca.","zh":"她正在学习的艾马拉语在的的喀喀湖周边地区使用。"}]}],"synonyms":["Aymara","Aymaran"],"phonetic":"/aɪˈmɔːroʊ/","extraExplanation":["“Aymoro”在英语中不常见，很多情况下是拼写误差或地区性转写。较标准的英语写法是“Aymara”（人/语言）；形容词也常见“Aymaran”。","若你是在某本书、地图或家族姓氏中看到“Aymoro”，它也可能是专有名词（如人名/地名）的特定拼写；可以告诉我出处，我能帮你更准确判断。"]}
{"word":"aymoro","summary":{"en":"“Aymoro” is an uncommon variant spelling of “Aymara” (the Aymara people/language).","zh":"“Aymoro”是“Aymara（艾马拉人／艾马拉语）”的不常见异拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a less common spelling of “Aymara,” referring to the Aymara people and/or their language in the Andes (especially Bolivia and Peru).","zh":"“Aymara（艾马拉）”的不常见拼写形式，指安第斯地区（尤指玻利维亚、秘鲁）的艾马拉人及／或其语言。"},"examples":[{"en":"Some older sources use “Aymoro,” but today “Aymara” is the standard spelling in English.","zh":"一些较早的资料会用 “Aymoro”，但如今英语里更标准的拼写是 “Aymara”。"},{"en":"The museum’s exhibit includes Aymara (Aymoro) textiles from the Andes.","zh":"博物馆展览包含来自安第斯的艾马拉（Aymoro）纺织品。"}]}],"synonyms":["Aymara","Aimara (less common variant)"],"phonetic":"/aɪˈmɔːroʊ/","extraExplanation":["“Aymoro”在现代英语中很少见，通常被视为“Aymara”的异拼或旧拼。更常用且更容易被查到/理解的写法是“Aymara”。","“Aymara”既可指民族（the Aymara people），也可指语言（the Aymara language）。在正式写作中，建议根据语境明确是“people”还是“language”。"]}
{"word":"Ayn","summary":{"en":"“Ayn” most commonly refers to the Arabic letter ع, or it can be used as a personal name (e.g., Ayn Rand).","zh":"“Ayn”最常见指阿拉伯字母ع，也可作人名（如作家Ayn Rand）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the 18th letter of the Arabic alphabet (ع), often transliterated as “ʿ” or “ayn,” representing a throat sound that does not exist in English.","zh":"阿拉伯字母表的第18个字母（ع），常被转写为“ʿ”或“ayn”，表示一种英语里没有的喉音。"},"examples":[{"en":"In Arabic transliteration, the symbol (ʿ) often stands for the letter ayn.","zh":"在阿拉伯语转写中，符号（ʿ）常用来表示字母ayn。"},{"en":"Learners may find the sound of ayn difficult because English doesn’t have it.","zh":"学习者可能会觉得ayn的发音很难，因为英语里没有这种音。"}]},{"partOfSpeech":"other","definition":{"en":"a given name (used in some cultures) or a proper name; for example, “Ayn” is the first name of the writer Ayn Rand.","zh":"人名/专有名词（在一些文化中作为名字使用）；例如作家Ayn Rand（安·兰德）的名字就叫Ayn。"},"examples":[{"en":"Ayn Rand wrote the novel Atlas Shrugged.","zh":"Ayn Rand写了小说《Atlas Shrugged》（《阿特拉斯耸耸肩》）。"},{"en":"His daughter’s name is Ayn.","zh":"他女儿的名字叫Ayn。"}]}],"synonyms":["ʿayn","ain"],"phonetic":"/aɪn/","extraExplanation":["“Ayn/ʿayn”来自阿拉伯语 عَيْن（ʿayn），这个词本身在阿拉伯语里还有“眼睛”“泉水/水源”等意思；因此在地名、人名或词汇里出现时，常带有文化与语言背景。","英语中写作 ayn、ain、或用符号 ʿ（叫“ayn sign”）来表示该字母/音；不同系统（学术转写、护照拼写等）会导致拼写差异。"]}
{"word":"Aynat","summary":{"en":"Aynat is usually a personal name, often a variant of the Hebrew name Einat (“spring/fountain”).","zh":"Aynat 通常是人名，多被看作希伯来语名字 Einat 的变体，意为“泉水/清泉”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name (usually feminine), a variant spelling/transliteration of the Hebrew name “Einat,” meaning “spring” or “fountain.”","zh":"人名（多为女性名），常被视为希伯来语名字“Einat”的另一种拼写/音译，含义为“泉水、清泉”。"},"examples":[{"en":"Aynat is a less common spelling; you may also see it written as Einat.","zh":"Aynat 是比较少见的拼写；你也可能看到写作 Einat。"},{"en":"Aynat introduced herself and explained that her name means “spring.”","zh":"Aynat 自我介绍时解释说，她的名字有“清泉”的意思。"}]}],"synonyms":["Einat"],"phonetic":"ˈaɪ.næt","extraExplanation":["“Aynat”在英语语境里通常不会作为普通词汇使用，而是作为专有名词（人名）出现。不同拼写多与音译习惯有关：有的人用 “Ay-” 来更接近自己习惯的发音或拼写风格。"]}
{"word":"ayne","summary":{"en":"“Ayne” is a dialect/archaic spelling, most often meaning “own” in Scots; less commonly it can represent “one.”","zh":"“ayne”是方言/古语拼写，最常见于苏格兰英语中表示“own（自己的）”；较少情况下可表示“one（一个/一人）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Scots, dialect) one’s own; belonging to oneself.","zh":"（苏格兰英语/方言）自己的；属于自己的。"},"examples":[{"en":"He did it o’ his ayne free will.","zh":"他是出于自己的自由意志去做的。"},{"en":"Mind your ayne business.","zh":"管好你自己的事。"}]},{"partOfSpeech":"pron.","definition":{"en":"(Archaic/dialect) “one” (a person or single unit); a variant spelling of “ain/ane/one.”","zh":"（古语/方言）“one（一个/一人）”的变体拼写，也见于 ain/ane/one。"},"examples":[{"en":"Ayne must choose wisely.","zh":"一人必须做出明智的选择。"}]}],"synonyms":["own","one (archaic)","ain (dialect)","ane (Scots)"],"phonetic":"/eɪn/","extraExplanation":["“ayne”常见于苏格兰英语（Scots）文本里，对应现代英语的“own”。在较老的拼写体系中，ane/ayne等形式也可能表示“one”。如果你是在诗歌、民谣或历史文献中看到它，通常要结合上下文判断是“own”还是“one”。"]}
{"word":"Aynor","summary":{"en":"Aynor is typically a proper noun: a personal name or the name of a town in South Carolina.","zh":"Aynor 通常是专有名词：可作人名，也可指美国南卡罗来纳州的一个城镇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name used for a person; it may also refer to a small town in South Carolina, USA.","zh":"专有名词：可作人名；也可能指美国南卡罗来纳州的一个小镇“Aynor”。"},"examples":[{"en":"Aynor is a small town in Horry County, South Carolina.","zh":"Aynor 是美国南卡罗来纳州霍里县的一个小镇。"},{"en":"I met someone named Aynor at the conference.","zh":"我在会议上认识了一个叫 Aynor 的人。"}]}],"phonetic":"/ˈeɪnər/","extraExplanation":["“Aynor”在英语里通常不是常见词汇，更常见的是作为专有名词（地名或人名）。如果你是在某个特定文本/游戏/作品里看到它，含义可能是作者自造名或角色名，需要结合上下文判断。","地名“Aynor”在美国读法通常近似“AY-ner”（开头像 day 的 /eɪ/ 音）。"]}
{"word":"Ayntab","summary":{"en":"Ayntab is a historical/alternative name for the Turkish city now called Gaziantep.","zh":"Ayntab 是土耳其城市加济安泰普（Gaziantep）的历史旧称/别称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A historical name for the city now officially called Gaziantep, in southeastern Turkey; also spelled Antep.","zh":"土耳其东南部城市加济安泰普（Gaziantep）的历史旧称，也常写作 Antep。"},"examples":[{"en":"My great-grandparents lived in Ayntab, which is now known as Gaziantep.","zh":"我的曾祖父母住在 Ayntab，也就是如今的加济安泰普。"},{"en":"Some older documents refer to the city as Ayntab or Antep.","zh":"一些较早的文献会把这座城市写作 Ayntab 或 Antep。"}]}],"synonyms":["Gaziantep","Antep","Aintab"],"phonetic":"/ˈaɪn.tɑːb/","extraExplanation":["Ayntab（也常见作 Aintab）是英语里对该城旧称的一种转写形式；现代土耳其官方名称是 Gaziantep，“Gazi-”意为“老兵/战功卓著者（荣誉称号）”，是后来加上的荣誉前缀。","在历史、族群研究、家族谱系或旧地图资料中更容易见到 Ayntab/Antep 这种写法；在当代旅行与新闻语境中通常使用 Gaziantep。"]}
{"word":"Ayo","summary":{"en":"“Ayo” is a slang greeting or attention-getter like “hey/yo,” and it can also be a personal name.","zh":"“Ayo” 常用作俚语招呼或引起注意（类似“嘿/哟”），也可以作为人名使用。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(slang) A casual greeting or call for attention, similar to “hey!” or “yo!”","zh":"（俚语）随意的招呼或引起注意的说法，相当于“嘿！”“哟！”"},"examples":[{"en":"Ayo, what’s up?","zh":"Ayo，最近怎么样？"},{"en":"Ayo! Wait for me!","zh":"Ayo！等等我！"}]},{"partOfSpeech":"n.","definition":{"en":"A personal name used in several cultures (for example, as a nickname or given name).","zh":"人名：在多种文化中使用的名字（例如昵称或名字）。"},"examples":[{"en":"Ayo is my cousin’s name.","zh":"Ayo 是我表亲的名字。"}]}],"synonyms":["hey","yo","hiya","excuse me (to get attention)"],"phonetic":"/ˈaɪ.oʊ/","extraExplanation":["在英语口语里，**ayo** 常见于比较随意的场合（朋友之间、网络/弹幕、说唱文化等）。语气一般比 “hello” 更随便、更像是在“喊人”。\n在正式场合（邮件、面试、对老师/上司）不建议用，用 “Hi/Hello/Excuse me” 更合适。","拼写上也可能见到 **“ayo!”** 当作感叹词；有时人们写 **“Ayo”** 只是把 “yo” 前面加一个强调的 a-，带一点更强的起势感。"]}
{"word":"ayond","summary":{"en":"“Beyond” means on the other side of, past a limit, or outside someone’s ability; it can also mean farther away or “in addition.”","zh":"“Beyond” 表示“在……另一边/越过界限/超出能力或范围”；也可作副词表示“更远处”或“此外（and beyond）”。"},"definitions":[{"partOfSpeech":"prep.","definition":{"en":"(preposition) On the farther side of; past (a place, limit, or boundary).","zh":"（介词）在……的那一边；越过（某个地方、界限或范围）。"},"examples":[{"en":"The river is just beyond the trees.","zh":"河就在树林那边。"},{"en":"Don’t go beyond the city limits.","zh":"不要越过市区界限。"}]},{"partOfSpeech":"prep.","definition":{"en":"(preposition) More than; exceeding (a number, degree, or level).","zh":"（介词）多于；超过（数量、程度或水平）。"},"examples":[{"en":"The repairs will cost beyond $500.","zh":"维修费用会超过500美元。"},{"en":"It’s beyond my budget right now.","zh":"这超出了我现在的预算。"}]},{"partOfSpeech":"prep.","definition":{"en":"(preposition) Outside the ability, understanding, or control of someone; not possible for them.","zh":"（介词）超出（能力/理解/控制范围）；对某人来说做不到。"},"examples":[{"en":"This math problem is beyond me.","zh":"这道数学题我做不出来。"},{"en":"The decision is beyond our control.","zh":"这个决定不是我们能控制的。"}]},{"partOfSpeech":"adv.","definition":{"en":"(adverb) Farther away; to or at a greater distance.","zh":"（副词）在更远处；更远地。"},"examples":[{"en":"The mountains and beyond were covered in snow.","zh":"群山以及更远处都被雪覆盖了。"},{"en":"Look beyond and you’ll see the sea.","zh":"往更远处看，你会看到大海。"}]},{"partOfSpeech":"adv.","definition":{"en":"(adverb) In addition; furthermore (often in the phrase “and beyond”).","zh":"（副词）此外；而且（常见于“and beyond”）。"},"examples":[{"en":"She taught us patience and beyond.","zh":"她教会我们耐心等更多东西。"},{"en":"They offer basic support and beyond.","zh":"他们提供基础支持以及更多服务。"}]}],"synonyms":["past","over","outside","further","farther"],"phonetic":"/bɪˈjɑnd/","extraExplanation":["“ayond” 不是标准英语单词，最常见是把 “beyond” 拼错了。","常见搭配：beyond repair（无法修复）、beyond belief（难以置信）、beyond recognition（面目全非/完全认不出）、beyond doubt（毫无疑问）、go beyond（超越/不止于）。","语感提示：beyond + 名词/代词 常表示“超出范围”；而 “look beyond …” 常带有“不要只看表面、放眼更长远”的意思。"]}
{"word":"ayont","summary":{"en":"Ayont is a dialect word meaning “beyond” or “on the far side,” common in Scottish/Northern English usage.","zh":"Ayont 是方言词，意思是“在……那边/越过”，常见于苏格兰和英格兰北部用法。"},"definitions":[{"partOfSpeech":"prep.","definition":{"en":"(dialect, especially Scottish/Northern English) beyond; on the far side of; further than.","zh":"（方言，尤见于苏格兰/英格兰北部）在……那边；越过；更远处。"},"examples":[{"en":"The village lies ayont the hills.","zh":"那个村庄在群山那边。"},{"en":"He lives ayont the river, so it takes longer to visit.","zh":"他住在河的那边，所以去拜访要更久。"}]},{"partOfSpeech":"adv.","definition":{"en":"(dialect) farther away; over there; beyond.","zh":"（方言）更远处；那边；在远方。"},"examples":[{"en":"Wait for me ayont, near the gate.","zh":"你在那边靠近大门的地方等我。"},{"en":"The road stretches ayont into the mist.","zh":"那条路一直延伸到雾的那边。"}]}],"synonyms":["beyond","past","over","on the far side (of)","further"],"phonetic":"/eɪˈɑnt/","extraExplanation":["“ayont”多见于苏格兰英语（Scots）以及英格兰北部方言，语气带有地方色彩。在现代标准英语里通常用“beyond / on the far side of / over there”来替换。","在文学与民歌中偶尔出现，用来营造乡土、古朴或地域氛围。"]}
{"word":"ayous","summary":{"en":"Ayous is a light West African hardwood (and the tree it comes from), commonly used for plywood and interior wood products.","zh":"Ayous 指一种来自西非的轻质阔叶木（也可指该树种），常用于胶合板和室内木制品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a light, pale, soft hardwood from a West African tree, often used for plywood, interior panels, furniture, and model-making.","zh":"（木材）阿尤斯木：一种来自西非的浅色、较软且重量轻的阔叶木，常用于胶合板、室内板材、家具和模型制作等。"},"examples":[{"en":"This plywood core is made from ayous, so it’s lightweight and easy to cut.","zh":"这块胶合板的芯材是阿尤斯木，所以重量轻，也容易切割。"},{"en":"Many guitars and acoustic panels use ayous because it’s easy to shape.","zh":"很多吉他和吸音板会用阿尤斯木，因为它很容易加工成型。"}]},{"partOfSpeech":"n.","definition":{"en":"the West African tree that produces ayous wood (also known by trade names such as obeche).","zh":"（树）产阿尤斯木的西非树种（贸易中也常称为 obeche 等）。"},"examples":[{"en":"Ayous grows in tropical West Africa and is harvested for timber.","zh":"阿尤斯树生长在西非热带地区，常被采伐作为木材来源。"}]}],"synonyms":["obeche","wawa","African whitewood"],"phonetic":"/aɪˈuːs/","extraExplanation":["“Ayous”多用于木材贸易语境，实际常与“obeche（奥贝奇）”指同一种或非常接近的木材来源（常见学名：Triplochiton scleroxylon）。不同国家/行业可能更常用其中一个名称。","作为轻软木材，ayous 常用于室内用途；若用于结构性或户外环境，通常需要额外的表面处理与防潮防虫措施。"]}
{"word":"Ayr","summary":{"en":"Ayr is mainly a place name in Scotland (a town and a river), and it can also be a surname.","zh":"Ayr主要是苏格兰的地名（城镇名与河流名），也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A town in southwest Scotland, on the Firth of Clyde; the county town of South Ayrshire.","zh":"艾尔：苏格兰西南部的一座城镇，位于克莱德湾沿岸；南艾尔郡（South Ayrshire）的行政中心。"},"examples":[{"en":"We spent the weekend in Ayr and walked along the beach.","zh":"我们在艾尔度过了周末，还沿着海滩散步。"},{"en":"Ayr is not far from Glasgow by train.","zh":"从格拉斯哥坐火车到艾尔不远。"}]},{"partOfSpeech":"n.","definition":{"en":"A river in Scotland (the River Ayr), flowing through the town of Ayr.","zh":"艾尔河：苏格兰的一条河流（River Ayr），流经艾尔镇。"},"examples":[{"en":"The River Ayr runs through the center of the town.","zh":"艾尔河穿过城镇中心。"},{"en":"They followed the Ayr upstream for a short hike.","zh":"他们沿着艾尔河向上游走了一小段徒步路线。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname (family name).","zh":"艾尔：一个姓氏。"},"examples":[{"en":"Her last name is Ayr.","zh":"她的姓是艾尔。"}]}],"synonyms":["Ayrshire (related region)"],"phonetic":"/er/","extraExplanation":["“Ayr”是专有名词，常见搭配有：Ayr, Scotland（苏格兰艾尔）、the River Ayr（艾尔河）。","在苏格兰文化中，艾尔郡（Ayrshire）与诗人罗伯特·彭斯（Robert Burns）关系密切；你可能会在文学或旅游资料里看到“Ayr/Ayrshire”。"]}
{"word":"ayre","summary":{"en":"Ayre is an old spelling of air, and it can also mean a song or melody in older literary/musical English.","zh":"Ayre 是 air 的古拼写；在较早的文学/音乐英语中也可指一首歌或一段旋律。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic spelling) Air; the invisible mixture of gases around us; the atmosphere.","zh":"（古拼写）空气；我们周围看不见的气体；大气。"},"examples":[{"en":"Open the window and let some fresh air in.","zh":"打开窗户，让新鲜空气进来。"},{"en":"In old poems, you may see “ayre” where modern English uses “air.”","zh":"在古诗文里，你可能会看到“ayre”，而现代英语用“air”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Archaic/literary) A song or tune; a melody (especially in older English, e.g., Renaissance music).","zh":"（古义/文学）歌曲；曲调；旋律（尤指文艺复兴时期等较早英语语境）。"},"examples":[{"en":"The singer performed a gentle ayre accompanied by a lute.","zh":"歌者在鲁特琴伴奏下演唱了一首柔和的古曲。"},{"en":"The play ends with an ayre sung by the actors.","zh":"这出戏以演员合唱的一支曲子作结。"}]}],"synonyms":["air","atmosphere","melody","tune","song"],"phonetic":"/er/","extraExplanation":["“ayre”多见于早期现代英语（约16–17世纪）的拼写，常出现在诗歌、戏剧与旧乐谱中；现代写法通常是“air”。","在音乐史里，“ayre/air”常指抒情短歌或优美旋律，和“aria（咏叹调）”有相关但不完全相同：aria更偏歌剧体裁；ayre更常见于更早期、较简洁的歌曲形式。"]}
{"word":"Ayres","summary":{"en":"Ayres is most commonly a surname; in older usage it can also mean “tunes/songs” (plural of ayre/air), especially in music titles.","zh":"Ayres 最常见是姓氏；在较旧用法中也可指“曲调/歌曲”（ayre/air 的复数），尤其见于音乐作品标题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname)","zh":"姓氏（人名）"},"examples":[{"en":"Dr. Ayres will see you now.","zh":"Ayres 医生现在要见你。"},{"en":"She met Professor Ayres at a conference.","zh":"她在一次会议上遇到了 Ayres 教授。"}]},{"partOfSpeech":"n.","definition":{"en":"(archaic, usually in titles) plural of “ayre/air,” meaning tunes or songs","zh":"（古旧用法，常见于书名/标题）“ayre/air”的复数，指曲调、歌曲"},"examples":[{"en":"The old book was titled Ayres for the Lute.","zh":"那本旧书的标题是《鲁特琴曲集（Ayres for the Lute）》。"},{"en":"In older English, “ayres” could mean musical airs—simple melodies.","zh":"在较早期的英语中，“ayres”可指“air（曲调）”——比较简单的旋律。"}]}],"synonyms":["(archaic sense) airs","tunes","songs"],"phonetic":"/ɛrz/","extraExplanation":["“Ayres”在现代英语里最常见的是姓氏，读音与“airs”相同。不同家庭的姓氏来源可能不同，常见与职业、地名或古老拼写变体有关。","作为“曲调/歌曲”的意思来自较早的拼写（ayre/air），在文艺复兴到巴洛克时期的音乐出版物标题里较常见，例如给鲁特琴（lute）或人声的歌曲集。现在日常英语通常用“airs”或更直接的“songs/tunes”。"]}
{"word":"Ayrshire","summary":{"en":"Ayrshire is a region in southwest Scotland; it’s also the name of a dairy cattle breed from that area.","zh":"Ayrshire 指苏格兰西南部的艾尔郡；也指起源于当地的一种乳牛品种。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A historic county (and current council area) in southwest Scotland, on the Firth of Clyde, known for farming, coastal towns, and connections to poet Robert Burns.","zh":"苏格兰西南部的一个历史郡（现为地方行政区），临克莱德湾，以农业、海滨城镇及与诗人罗伯特·彭斯的关联而闻名。"},"examples":[{"en":"My ancestors came from Ayrshire in Scotland.","zh":"我的祖先来自苏格兰的艾尔郡（Ayrshire）。"},{"en":"We visited Ayrshire to see Burns-related sites and coastal villages.","zh":"我们去艾尔郡参观与彭斯相关的景点和海边村落。"}]},{"partOfSpeech":"n.","definition":{"en":"A dairy cattle breed originally from Ayrshire, Scotland, valued for milk production.","zh":"一种起源于苏格兰艾尔郡的乳牛品种，以产奶能力著称。"},"examples":[{"en":"The farm keeps Ayrshire cows for milk.","zh":"这家农场饲养艾尔夏牛（Ayrshire cows）来产奶。"},{"en":"Ayrshire cattle are known for being hardy and good grazers.","zh":"艾尔夏牛以耐寒健壮、善于放牧而出名。"}]}],"synonyms":["County of Ayr (historical)"],"phonetic":"/ˈɛrʃɪr/","extraExplanation":["“Ayrshire”常读作“AIR-sheer”。在英国英语里有时会听到略不同的读法。","艾尔郡常被分为 North Ayrshire、East Ayrshire、South Ayrshire（北/东/南艾尔郡）等行政区名称。","文学文化上，苏格兰民族诗人 Robert Burns（罗伯特·彭斯）与艾尔郡关系很深，因此当地有不少与彭斯相关的景点与纪念活动。"]}
{"word":"ayrshire","summary":{"en":"Ayrshire is a place in southwest Scotland and also the name of a dairy cattle breed from that region.","zh":"Ayrshire既指苏格兰西南部的艾尔郡，也指起源于当地的一种奶牛品种。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historic county in southwest Scotland, on the Firth of Clyde (now divided into several council areas).","zh":"苏格兰西南部的历史郡名，位于克莱德湾沿岸（现已划分为多个地方行政区）。"},"examples":[{"en":"My grandparents grew up in Ayrshire, near the coast.","zh":"我祖父母在艾尔郡长大，住在海边附近。"},{"en":"Ayrshire is often associated with the poet Robert Burns.","zh":"艾尔郡常常与诗人罗伯特·彭斯联系在一起。"}]},{"partOfSpeech":"n.","definition":{"en":"a breed of red-and-white dairy cattle originally from Ayrshire, known for good milk production.","zh":"艾尔夏牛：一种起源于艾尔郡的红白花奶牛品种，以产奶性能好而闻名。"},"examples":[{"en":"The farm keeps Ayrshire cattle for milk.","zh":"这家农场饲养艾尔夏牛来产奶。"},{"en":"Ayrshires are valued for their hardiness and efficient grazing.","zh":"艾尔夏牛因耐粗饲、善于放牧而受到重视。"}]}],"synonyms":["(place) County of Ayr","(cattle) Ayrshire cattle"],"phonetic":"/ˈerʃɪr/","extraExplanation":["“Ayrshire”来自苏格兰的地名“Ayr”（艾尔河/艾尔镇一带）。在文化上，它常与苏格兰民族诗人Robert Burns（罗伯特·彭斯）相关，因为他曾生活并创作于这一地区。","作为牛的品种名时，Ayrshire通常首字母大写；在农牧语境中更常见。"]}
{"word":"ays","summary":{"en":"“Ays” most commonly means “yes” votes (plural of “aye”) in formal voting contexts.","zh":"“ays”最常见意思是正式表决中的“赞成票/同意的回应”（“aye”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “ay”: votes or responses meaning “yes,” especially in formal voting.","zh":"“ay”的复数：表示“赞成/同意”的投票或回应，常用于正式表决。"},"examples":[{"en":"All those in favor, say “aye”—the ayes have it.","zh":"赞成的请说“aye”——赞成票占多数。"},{"en":"The motion passed with 42 ayes and 18 noes.","zh":"该提案以42票赞成、18票反对通过。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) plural of “A”: multiple instances of the letter A, usually written as “A’s.”","zh":"（较少见）字母A的复数：多个字母A，通常写作“A’s”。"},"examples":[{"en":"Your name has two A’s in it.","zh":"你的名字里有两个A。"}]}],"synonyms":["yes votes","affirmatives","ayes (common spelling)"],"phonetic":"/eɪz/","extraExplanation":["在英语表决用语中，“aye”（读音同“eye”）表示“赞成”，反对通常说“no”。因此“ayes and noes”常见于议会、会议记录等正式场景。","书写上，“ayes”是正确复数；但表示字母时更常写作“A’s”，避免与“as”混淆。"]}
{"word":"Aythya","summary":{"en":"Aythya is the scientific genus name for several kinds of diving ducks.","zh":"Aythya 是若干种潜水鸭的科学属名（潜鸭属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of diving ducks (family Anatidae) that includes scaups, pochards, and related species.","zh":"（鸟类）潜鸭属：鸭科中的一个潜水鸭类属，包括斑背潜鸭（scaup）、红头潜鸭（pochard）等近缘种。"},"examples":[{"en":"The redhead duck belongs to the genus Aythya.","zh":"红头潜鸭属于潜鸭属（Aythya）。"},{"en":"Researchers compared migration patterns across several Aythya species.","zh":"研究人员比较了几种潜鸭属（Aythya）物种的迁徙模式。"},{"en":"In winter, many Aythya ducks gather on large lakes and reservoirs.","zh":"冬季，许多潜鸭属（Aythya）的鸭会聚集在大型湖泊和水库。"}]}],"synonyms":["diving duck (general term)","pochard (common group name)","scaup (common group name)"],"phonetic":"/ˈaɪθiə/","extraExplanation":["这是一个拉丁化的学名（属名），日常英语对话里更常直接说具体物种名（如 scaup、redhead、canvasback），或泛称 diving duck（潜水鸭）。","词源常追溯到古希腊语 aithuia（古文献中提到的一种水鸟，可能指某类潜水鸟/海鸟），后来被用于现代生物分类学命名。"]}
{"word":"aythya","summary":{"en":"“aythya” is not a standard English word; it is most likely a misspelling of “Ayutthaya,” the historic Thai city.","zh":"“aythya”不是标准英语词；最可能是“Ayutthaya（大城府／阿瑜陀耶）”的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A misspelling or shortened form sometimes used for “Ayutthaya,” a historic city and former capital of Siam (Thailand).","zh":"常见于对 “Ayutthaya（大城府／阿瑜陀耶）” 的拼写错误或简写；Ayutthaya 是泰国历史名城、暹罗旧都。"},"examples":[{"en":"I think “aythya” is meant to be “Ayutthaya,” the old capital of Thailand.","zh":"我觉得“aythya”应该是指“Ayutthaya（大城府／阿瑜陀耶）”，也就是泰国的旧都。"},{"en":"We visited Ayutthaya to see the ancient temple ruins.","zh":"我们去大城府（Ayutthaya）参观古代寺庙遗址。"}]}],"synonyms":["Ayutthaya"],"phonetic":"/ˌɑːjuːˈtaɪə/","extraExplanation":["“Ayutthaya”在英语里常见发音接近“ah-yoo-TAI-uh”。你写的“aythya”很可能是因为转写系统不同或打字省略导致。","如果你想查的其实是另一个词（例如人名、品牌名或某种缩写），可以告诉我它出现的句子或语境，我能更准确判断。"]}
{"word":"ayu","summary":{"en":"Ayu is a Japanese freshwater fish (sweetfish), often eaten grilled.","zh":"Ayu 指日本的淡水鱼“香鱼”（sweetfish），常见吃法是盐烤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a freshwater fish from Japan (Plecoglossus altivelis), often called “sweetfish,” eaten especially grilled and lightly salted","zh":"香鱼（日本的一种淡水鱼，学名 *Plecoglossus altivelis*），英文常称“sweetfish（甜鱼）”，常见做法是盐烤等"},"examples":[{"en":"We ordered grilled ayu at the riverside restaurant.","zh":"我们在河边餐馆点了盐烤香鱼。"},{"en":"Ayu is a seasonal summer delicacy in Japan.","zh":"香鱼在日本是夏季的时令美味。"}]}],"synonyms":["sweetfish"],"phonetic":"/ˈaɪ.juː/","extraExplanation":["“Ayu（香鱼）”是日语外来词，在英语菜单或日本文化语境中比较常见，写作 *ayu*，有时也会看到 *sweetfish*（更直观的英文名）。","香鱼常被描述为带有淡淡“瓜类/甜香”的气味，因此有“sweetfish”的称呼；日本料理里最典型的是“盐烤（shioyaki）”。"]}
{"word":"Ayubite","summary":{"en":"Ayubite usually means “Ayyubid”: relating to (or a person of) the Ayyubid dynasty in the medieval Middle East.","zh":"Ayubite 通常等同于 Ayyubid：指中世纪中东阿尤布王朝的（或其成员/支持者）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often capitalized) Relating to the Ayyubid (also spelled Ayubid/Ayubite) dynasty, a Muslim ruling family in the Middle East during the 1100s–1200s.","zh":"（常大写）与阿尤布王朝（亦拼作 Ayyubid / Ayubid / Ayubite）有关的；指12—13世纪中东的一个穆斯林统治王朝。"},"examples":[{"en":"Some textbooks describe Saladin’s government as an Ayubite dynasty based in Egypt and Syria.","zh":"一些教材把萨拉丁的政权描述为以埃及和叙利亚为中心的阿尤布王朝。"},{"en":"The museum has coins from the Ayubite period.","zh":"博物馆里有阿尤布时期的硬币。"}]},{"partOfSpeech":"n.","definition":{"en":"A person connected with or supporting the Ayyubid dynasty.","zh":"阿尤布王朝的成员；或支持阿尤布王朝的人。"},"examples":[{"en":"In the chronicle, an Ayubite is sent to negotiate a truce.","zh":"在那部编年史中，一位阿尤布王朝的人被派去谈判停战。"}]}],"synonyms":["Ayyubid","Ayubid"],"phonetic":"aɪˈjuːbaɪt","extraExplanation":["“Ayubite”在英语里并不是最常见的拼写；更常见的是 **Ayyubid**（或 Ayubid）。它指的是由萨拉丁（Saladin）建立的王朝，在十字军东征时期的历史叙述中经常出现。","名字来源于阿拉伯语 **Ayyūb**（“艾尤卜”），也对应《圣经》中的“约伯（Job）”这一人物名；但在英语实际用法中，“Ayubite”更常用于王朝/政治历史语境，而不是宗教人物的“追随者”这一意义。"]}
{"word":"ayubite","summary":{"en":"Ayubite (more commonly: Ayyubid) refers to the medieval dynasty of Saladin, or things/people connected to it.","zh":"Ayubite（更常见拼写为 Ayyubid）指萨拉丁家族建立的中世纪阿尤布王朝，或与该王朝相关的人与事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person belonging to the Ayyubid (Ayubid) dynasty, or someone connected with that dynasty in medieval Middle Eastern history","zh":"阿尤布王朝（阿尤布王朝/阿尤比王朝）的人；或与该王朝相关的人（中世纪中东历史语境）"},"examples":[{"en":"Saladin is the most famous leader associated with the Ayubites.","zh":"萨拉丁是与阿尤布王朝最相关、也最著名的领袖。"},{"en":"The museum label describes the coin as Ayubite, dating to the 12th century.","zh":"博物馆的说明牌把这枚钱币标为“阿尤布王朝的”，年代为12世纪。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Ayyubid (Ayubid) dynasty or its period, culture, or rule","zh":"与阿尤布王朝或其时代、文化、统治相关的"},"examples":[{"en":"They studied Ayubite architecture in Cairo and Damascus.","zh":"他们研究了开罗和大马士革的阿尤布王朝时期建筑。"},{"en":"The book gives an overview of Ayubite politics after the Crusades began.","zh":"这本书概述了十字军东征开始后阿尤布王朝时期的政治。"}]}],"synonyms":["Ayyubid","Ayubid","Saladin’s dynasty (contextual)"],"phonetic":"/aɪˈjuːbaɪt/","extraExplanation":["“Ayubite”在英文里比较少见，更常见的拼写是“Ayyubid”（也写作“Ayubid”），指由萨拉丁家族建立的王朝（12—13世纪），主要统治埃及、叙利亚等地。学术写作、博物馆说明和历史类文本里更可能看到“Ayyubid”。","在一些语境中，它也可能被用来泛指“与萨拉丁及其政权相关的事物”（如钱币、建筑风格、历史时期）。如果你是在某篇文章或展签里看到该词，提供句子我可以帮你确认具体指向。"]}
{"word":"ayudante","summary":{"en":"“Ayudante” in English is most commonly “assistant” (a helper, often in a job role).","zh":"西语“ayudante”英语最常对应“assistant”，指在工作或职责上协助他人的人（助理/助手）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person whose job is to help another person (often someone more senior) with work or duties","zh":"助理；助手（通常指协助更高职位者完成工作的人）"},"examples":[{"en":"She works as an assistant to the manager.","zh":"她是经理的助理。"},{"en":"Ask my assistant to schedule the meeting.","zh":"让我的助理安排会议时间。"}]},{"partOfSpeech":"adj.","definition":{"en":"helping someone; used to describe a role that supports the main worker","zh":"辅助的；协助的（用于描述支持主要工作人员的角色）"},"examples":[{"en":"He has an assistant coach who helps plan training.","zh":"他有一位助理教练，帮忙制定训练计划。"},{"en":"She is an assistant professor at the university.","zh":"她是这所大学的助理教授。"}]}],"synonyms":["helper","aide","support staff","assistant"],"phonetic":"/əˈsɪstənt/","extraExplanation":["西班牙语“ayudante”在英语里最常见的对应是 assistant（较正式，常用于职场/学校），也可以用 helper（更口语，偏“帮手”）。在餐饮业里，“ayudante de cocina”常译为 kitchen assistant 或 kitchen helper。","在一些职业头衔中，assistant 表示级别或职务：assistant manager（副经理/助理经理）、assistant professor（助理教授，学术职称的一部分），含义取决于具体体系。"]}
{"word":"Ayudhya","summary":{"en":"Ayudhya is an alternate English spelling of Ayutthaya, a famous historic city in Thailand with major temple ruins.","zh":"Ayudhya 是 Ayutthaya（大城）的另一种英文拼法，指泰国著名的历史古城与寺庙遗址。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historical city in central Thailand (also spelled Ayutthaya), once the capital of the Kingdom of Ayutthaya and now a UNESCO World Heritage site known for its temple ruins.","zh":"泰国中部的一座历史名城（也常拼作 Ayutthaya），曾是大城王国的首都；现为联合国教科文组织世界文化遗产，以古寺庙遗址闻名。"},"examples":[{"en":"We took a day trip from Bangkok to Ayudhya to see the ancient temples.","zh":"我们从曼谷一日往返去大城（Ayudhya）参观古老的寺庙。"},{"en":"Ayudhya was once one of Southeast Asia’s great trading and diplomatic centers.","zh":"大城（Ayudhya）曾是东南亚重要的贸易与外交中心之一。"}]}],"synonyms":["Ayutthaya"],"phonetic":"ɑːˈjuːθjə","extraExplanation":["“Ayudhya”是对泰语名称的另一种英语转写，更常见的现代拼法是“Ayutthaya”。两者指同一地点；在旅游信息与历史书写中可能会交替出现。","历史上“大城王国”（Kingdom of Ayutthaya，约1350–1767）影响深远；城市遗址中常见佛塔（stupa/chedi）与寺庙（temple/wat）的残迹，适合用来理解泰国历史与佛教文化。"]}
{"word":"ayuntamiento","summary":{"en":"Ayuntamiento means a municipal government (city/town council) or the town/city hall building, especially in Spain.","zh":"Ayuntamiento 指市政机构（市议会/市政府）或市政厅大楼，尤其常见于西班牙语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Spain and some Spanish-speaking contexts) the town/city council; the municipal government that manages local public services and administration.","zh":"（西班牙及部分西语语境）市政厅／市议会；负责本地公共事务与行政的市政机构。"},"examples":[{"en":"You can register your address at the ayuntamiento.","zh":"你可以在市政厅登记住址。"},{"en":"The ayuntamiento approved a new plan for public transportation.","zh":"市议会通过了新的公共交通方案。"}]},{"partOfSpeech":"n.","definition":{"en":"(Also used for the building) the town hall/city hall where the municipal government offices are located.","zh":"（也可指建筑）市政厅大楼／市政府大楼。"},"examples":[{"en":"We met in front of the ayuntamiento at noon.","zh":"我们中午在市政厅门口见面。"},{"en":"The ayuntamiento is in the main square.","zh":"市政厅在主广场上。"}]}],"synonyms":["city council","municipal government","city hall","town hall"],"phonetic":"/ˌaʝun.taˈmjento/","extraExplanation":["在西班牙旅游或办理手续时很常见：如户籍/住址登记（empadronamiento）、婚姻登记、缴纳部分地方税费、申请停车许可等，通常都在 ayuntamiento 办理。","英语里根据语境可译为 city council（偏“机构/议会”）或 city hall / town hall（偏“建筑/办公地点”）。"]}
{"word":"ayuntamientos","summary":{"en":"Ayuntamientos is the plural of the Spanish word ayuntamiento, meaning town/city councils or municipal governments (and sometimes the town hall building).","zh":"ayuntamientos 是西班牙语 ayuntamiento 的复数，指“市议会/市政府（有时也指市政厅大楼）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish, plural) town halls; city councils; municipal governments (the local governing bodies of a town or city).","zh":"（西班牙语，复数）市政厅；市议会；市政府（城镇/城市的地方政府机构）。"},"examples":[{"en":"In Spain, many services are managed by the ayuntamientos, such as local permits and public spaces.","zh":"在西班牙，许多事务由各地的ayuntamientos（市政府/市政厅）管理，比如本地许可证和公共空间。"},{"en":"The ayuntamientos announced new rules for recycling.","zh":"各地市政府（ayuntamientos）宣布了新的回收规定。"}]}],"synonyms":["municipal governments","city councils","town councils","town halls"],"phonetic":"/a.jun.taˈmjɛn.tos/","extraExplanation":["“Ayuntamiento”常指西班牙（也可见于部分拉美地区）城镇/城市的地方自治机关，相当于“municipal council / town council”。它既可指“市政机构”，也可指“市政厅大楼”（town hall）。在新闻语境里，多数时候是指“地方政府/市政当局”。","词形：单数 ayuntamiento（一个市政府/市政厅），复数 ayuntamientos（多个市政府/市政厅）。"]}
{"word":"Ayurveda","summary":{"en":"Ayurveda is India’s traditional medical system that aims to keep health through balance, using diet, lifestyle, and herbs.","zh":"阿育吠陀是印度的传统医学体系，主张通过饮食、生活方式和草药等方式保持身心平衡与健康。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional system of medicine from India that focuses on balancing the body, mind, and spirit through diet, lifestyle, herbal remedies, and other practices.","zh":"阿育吠陀：源自印度的传统医学体系，强调通过饮食、生活方式、草药等方法来平衡身心与精神。"},"examples":[{"en":"She started studying Ayurveda to improve her sleep and digestion.","zh":"她开始学习阿育吠陀来改善睡眠和消化。"},{"en":"In Ayurveda, food is often chosen based on your body type and balance.","zh":"在阿育吠陀中，食物常根据你的体质与平衡状态来选择。"}]}],"synonyms":["traditional Indian medicine","Ayurvedic medicine"],"phonetic":"/ˌaɪ.ərˈveɪ.də/","extraExplanation":["“Ayurveda”来自梵语：āyus（生命）+ veda（知识/学问），常被解释为“生命的科学”。","在英语里它通常作为不可数名词使用（study/practice Ayurveda），有时也会说 “Ayurvedic medicine/therapy”（阿育吠陀医学/疗法）。","常见相关词：dosha（体质/能量类型，常见为 vata, pitta, kapha）、herbal remedies（草药疗法）、holistic（整体性的）。","文化提示：阿育吠陀在印度具有深厚传统，但在不同国家的“阿育吠陀疗法”质量与监管可能不同；涉及健康问题时，最好与专业医疗人员沟通。"]}
{"word":"ayurveda","summary":{"en":"Ayurveda is a traditional Indian system of medicine focused on balancing health through lifestyle, diet, and natural therapies.","zh":"阿育吠陀是印度传统医学体系，重在通过生活方式、饮食与自然疗法来维持身心平衡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional system of medicine from India that focuses on balancing the body and mind through diet, lifestyle, herbs, and practices like yoga and massage","zh":"阿育吠陀：源自印度的传统医学体系，强调通过饮食、生活方式、草药以及瑜伽、按摩等方法来平衡身心"},"examples":[{"en":"She started studying Ayurveda to improve her digestion and sleep.","zh":"她开始学习阿育吠陀来改善消化和睡眠。"},{"en":"Ayurveda often recommends daily routines, such as regular meals and adequate rest.","zh":"阿育吠陀常常建议建立日常规律，比如按时吃饭和充足休息。"},{"en":"Some people use Ayurvedic herbs, but it’s wise to check safety and quality first.","zh":"有些人会使用阿育吠陀草药，但最好先确认安全性和品质。"}]}],"synonyms":["traditional Indian medicine","holistic medicine","natural medicine","integrative health"],"phonetic":"/ˌaɪ.jɚˈveɪ.də/","extraExplanation":["“Ayurveda”来自梵语：āyus（生命）+ veda（知识），常被解释为“生命的知识/学问”。","阿育吠陀在英语语境中常与“holistic（整体的）”“wellness（身心健康）”一起出现；但它并不等同于现代西医。若涉及草药或疗法，尤其是孕期、慢性病或正在用药的人，更应咨询专业人士并注意产品来源与重金属等安全问题。","文化上，阿育吠陀在南亚地区历史悠久，也常与瑜伽、冥想等生活方式一起被介绍到英语世界。常见相关词：dosha（体质/能量类型）、herbal remedies（草药疗法）、detox（排毒，营销语境中需谨慎理解）。"]}
{"word":"ayurvedas","summary":{"en":"“Ayurvedas” is the plural form of “Ayurveda,” referring to multiple Ayurvedic traditions, practices, or (less commonly) texts.","zh":"“Ayurvedas”是“Ayurveda”的复数，指多种阿育吠陀流派/实践，或（较少见）相关典籍。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of Ayurveda; traditional Indian systems of health and medicine (or different Ayurvedic traditions/practices).","zh":"Ayurveda（阿育吠陀/印度传统医学）的复数；指多种阿育吠陀体系、流派或实践。"},"examples":[{"en":"Many spas advertise ayurvedas and other traditional healing methods.","zh":"许多水疗中心宣传阿育吠陀等传统疗法。"},{"en":"The book compares different ayurvedas across regions of India.","zh":"这本书比较了印度各地区不同的阿育吠陀传统。"}]},{"partOfSpeech":"n.","definition":{"en":"in some contexts, “Ayurvedas” can refer to the classic Ayurvedic texts or bodies of knowledge (used less commonly in everyday English).","zh":"在某些语境中，“Ayurvedas”也可指阿育吠陀的经典典籍或知识体系（日常英语中较少这样用）。"},"examples":[{"en":"Scholars study the Ayurvedas alongside other ancient medical writings.","zh":"学者将阿育吠陀典籍与其他古代医学著作一同研究。"}]}],"synonyms":["Ayurvedic traditions","Ayurvedic practices","Ayurvedic medicine (general)"],"phonetic":"ˌaɪjɚˈveɪdə","extraExplanation":["“Ayurveda”来自梵语：āyus（生命）+ veda（知识），常译为“生命之学”。英语里更常用单数“Ayurveda”指整套医学体系；复数“ayurvedas”通常用来强调“多种做法/流派”，而不是简单表示“很多次的Ayurveda”。","学习提示：如果你想说“阿育吠陀疗法/治疗”，英语更常见的表达是 “Ayurvedic medicine/treatment/therapy”。"]}
{"word":"Ayurvedic","summary":{"en":"Ayurvedic means “related to Ayurveda,” the traditional Indian system of medicine and wellness.","zh":"Ayurvedic意为“与阿育吠陀有关的”，指源自印度的传统医学与养生体系。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Ayurveda, a traditional system of medicine that developed in India and focuses on balancing body, mind, and lifestyle","zh":"与阿育吠陀（Ayurveda）有关的；阿育吠陀是源自印度的传统医学体系，强调通过身心与生活方式的平衡来维护健康"},"examples":[{"en":"She drinks Ayurvedic herbal tea to help with digestion.","zh":"她喝阿育吠陀草本茶来帮助消化。"},{"en":"Ayurvedic treatments often include diet changes, massage, and herbs.","zh":"阿育吠陀疗法常包括饮食调整、按摩和草药。"}]}],"synonyms":["Ayurveda-related","traditional Indian (medicine)"],"phonetic":"/ˌaɪ.jʊrˈveɪ.dɪk/","extraExplanation":["“Ayurvedic”来自梵语“Āyurveda”，常被译为“生命的知识/科学”（āyus=生命，veda=知识）。在英语中常用于健康与养生语境，如“ayurvedic medicine / ayurvedic doctor / ayurvedic massage”。","在跨文化语境里，产品宣传中常用“Ayurvedic”表示“源自阿育吠陀传统”。但是否有效与安全会因个人体质、产品质量与监管标准而不同；涉及草药或补充剂时，英语里也常见建议“consult a healthcare professional（咨询医护人员）”。"]}
{"word":"Ayuthea","summary":{"en":"Ayuthea is a less common spelling of Ayutthaya, the historic former capital city (and sometimes the kingdom) in Thailand.","zh":"Ayuthea是Ayutthaya（大城）的较少见拼写，指泰国的历史古都（有时也指阿瑜陀耶王国）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Variant spelling) Ayutthaya: a historic city in central Thailand, north of Bangkok, famous for its temple ruins and as a former capital.","zh":"（拼写变体）大城（Ayutthaya）：泰国中部一座历史名城，位于曼谷以北，以古寺遗址闻名，曾为古都。"},"examples":[{"en":"We took a day trip from Bangkok to Ayuthea (Ayutthaya) to see the temple ruins.","zh":"我们从曼谷一日往返去Ayuthea（大城）看古寺遗址。"},{"en":"Ayuthea was once the center of a powerful kingdom in Southeast Asia.","zh":"Ayuthea曾是东南亚一个强盛王国的中心。"}]}],"synonyms":["Ayutthaya","Phra Nakhon Si Ayutthaya","Kingdom of Ayutthaya"],"phonetic":"/ɑːˈjuːtəˌjɑː/","extraExplanation":["“Ayuthea”在英文里不如标准拼写“Ayutthaya”常见；旅游书、地图与联合国教科文组织（UNESCO）材料中通常用“Ayutthaya”。","Ayutthaya也指“阿瑜陀耶王国（Kingdom of Ayutthaya, 1351–1767）”，语境不同可能指城市或历史王国。"]}
{"word":"Ayuthia","summary":{"en":"Ayuthia usually refers to Ayutthaya: a historic city in Thailand and also the former Kingdom of Ayutthaya (1351–1767).","zh":"Ayuthia 通常指 Ayutthaya（大城）：泰国的历史古城，也可指阿瑜陀耶王国（1351–1767）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A historic city in central Thailand, officially called Ayutthaya (Phra Nakhon Si Ayutthaya), famous for temple ruins and its former role as a capital.","zh":"（专有名词）泰国中部的一座历史名城，通常写作 Ayutthaya（全名 Phra Nakhon Si Ayutthaya），以古寺遗址闻名，曾是古都。"},"examples":[{"en":"We took a day trip from Bangkok to Ayutthaya to see the ancient temples.","zh":"我们从曼谷去大城府（Ayutthaya）一日游，参观古老寺庙。"},{"en":"Ayutthaya was once one of Southeast Asia’s most important trading cities.","zh":"大城（Ayutthaya）曾是东南亚最重要的贸易城市之一。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical) The Kingdom of Ayutthaya (1351–1767), a major Thai kingdom centered on the city of Ayutthaya.","zh":"（历史）大城王朝／阿瑜陀耶王国（1351–1767），以大城为中心的泰国重要王国。"},"examples":[{"en":"The Kingdom of Ayutthaya maintained diplomatic and trade relations with many foreign powers.","zh":"阿瑜陀耶王国与许多外国势力保持外交与贸易往来。"},{"en":"After the fall of Ayutthaya in 1767, Thailand entered a new political era.","zh":"1767 年大城陷落后，泰国进入新的政治时代。"}]}],"synonyms":["Ayutthaya","Phra Nakhon Si Ayutthaya","Kingdom of Ayutthaya"],"phonetic":"/ɑːˌjuːtəˈjɑː/","extraExplanation":["“Ayuthia”常见于非标准拼写或旧式转写，更常见、较标准的英文写法是“Ayutthaya”。如果你是在地图、课本或历史资料里看到“Ayuthia”，通常指的就是同一个地方／王国。","Ayutthaya 的遗址区被联合国教科文组织列为世界文化遗产（Ayutthaya Historical Park），以佛塔（chedi/stupa）与古寺遗址著名。"]}
{"word":"Ayutthaya","summary":{"en":"Ayutthaya is a historic Thai city (and former capital) famous for its temple ruins; it can also refer to the Kingdom of Ayutthaya (1351–1767).","zh":"Ayutthaya 指泰国历史名城“大城府/大城”，以寺庙遗址闻名；也可指历史上的“大城王国”（1351–1767）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A historic city in central Thailand, north of Bangkok; it was the capital of the Kingdom of Ayutthaya and is known for its temple ruins (a UNESCO World Heritage Site).","zh":"泰国中部的一座历史名城，位于曼谷以北；曾是大城王国的首都，以寺庙遗址闻名（联合国教科文组织世界文化遗产）。"},"examples":[{"en":"We took a day trip from Bangkok to Ayutthaya to see the old temples.","zh":"我们从曼谷一日往返去大城府参观古寺庙。"},{"en":"Ayutthaya’s ruins show how important the city was for trade and culture.","zh":"大城府的遗址展现了这座城市在贸易与文化上的重要性。"}]},{"partOfSpeech":"n.","definition":{"en":"The Kingdom of Ayutthaya (1351–1767), a major Siamese/Thai kingdom that influenced politics, religion, and art in the region.","zh":"大城王国（1351–1767），暹罗/泰国历史上重要的王朝国家，对区域政治、宗教与艺术影响深远。"},"examples":[{"en":"The Kingdom of Ayutthaya maintained diplomatic ties with European powers.","zh":"大城王国曾与欧洲列强保持外交往来。"},{"en":"Many Thai cultural traditions developed during the Ayutthaya period.","zh":"许多泰国文化传统在大城时期逐渐发展成形。"}]}],"synonyms":["Ayudhya","Ajutthaya","Kingdom of Ayutthaya","Ayutthaya Historical Park"],"phonetic":"/ˌɑː.juːˈtɑː.jə/","extraExplanation":["“Ayutthaya”常见两种指代：①今天的“大城府/大城（历史公园）”这个城市与遗址；②历史上的“大城王国”。阅读旅游文章多指前者，读历史书或学术文章常指后者。","英文里有时也会看到旧式拼写“Ajutthaya”或“Ayudhya”，都指同一地名的不同转写。"]}
{"word":"ayuyu","summary":{"en":"“ayuyu” is not a standard English word; it’s usually a nickname/username or an expressive sound whose meaning depends on context.","zh":"“ayuyu”不是标准英语词；多见于昵称/用户名或表达语气的拟声音，意思要看具体语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare or nonstandard form in English, usually seen as a username, nickname, or a transliterated personal name (not a dictionary word in standard English).","zh":"英文中很少见、非标准的形式，通常作为用户名、昵称，或外来语的人名音译（不是标准英语词典词汇）。"},"examples":[{"en":"My gaming ID is Ayuyu.","zh":"我的游戏ID是 Ayuyu。"},{"en":"Ayuyu posted a new video today.","zh":"Ayuyu 今天发了一个新视频。"}]},{"partOfSpeech":"int.","definition":{"en":"(Informal) An expressive sound used in online posts, comics, or fandom contexts (e.g., cute/cheering/crying vibe), depending on the community; meaning is determined by context.","zh":"（非正式）网络贴文、漫画或同人圈里用的拟声/表达音（可带可爱、打气、哭喊等语气），具体含义取决于语境与圈子习惯。"},"examples":[{"en":"Ayuyu! I finally finished the exam!","zh":"Ayuyu！我终于考完了！"},{"en":"She typed “ayuyu…” to show she felt embarrassed.","zh":"她打了“ayuyu…”来表示自己有点尴尬。"}]}],"synonyms":["(as a name) handle","(as a sound) interjection"],"phonetic":"aɪˈjuːjuː","extraExplanation":["“ayuyu”不是常见英语词，所以在英语学习中通常把它当作专有名词（网名/昵称）或拟声词来理解。若它来自特定语言（例如日语、韩语、某个游戏/动画角色口癖），含义会更具体；你可以告诉我你在哪里看到它（句子或来源），我可以帮你按那个语境解释。"]}
{"word":"aywhere","summary":{"en":"“aywhere” is a misspelling; the correct form is “anywhere” = in/to any place.","zh":"“aywhere”是拼写错误；正确是“anywhere”，表示“在/到任何地方”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Common misspelling) The correct word is “anywhere,” meaning in any place or to any place.","zh":"（常见拼写错误）正确拼写是 “anywhere”，意思是“在任何地方/到任何地方”。"},"examples":[{"en":"Do you want to eat anywhere in town?","zh":"你想在城里任何地方吃饭吗？"},{"en":"I can’t find my keys anywhere.","zh":"我到处都找不到我的钥匙。"}]}],"synonyms":["anyplace","wherever"],"phonetic":"/ˈeniˌwɛr/","extraExplanation":["“aywhere”通常是把“anywhere”打错了：少了字母 n。","“anywhere”常用于否定句（not…anywhere / can’t…anywhere）表示“哪里都不”。","相关表达：anywhere else（别的任何地方）；from anywhere（从任何地方）；go anywhere（去任何地方）。"]}
{"word":"Ayyubid","summary":{"en":"Ayyubid refers to the Ayyubid Dynasty (late 12th–mid-13th century) and people/things connected to it, especially in Egypt and Syria.","zh":"Ayyubid 指阿尤布王朝（12世纪末至13世纪中期）及与其相关的人或事物，尤指埃及与叙利亚地区。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Ayyubid Dynasty, a Muslim ruling family that governed parts of Egypt, Syria, and nearby regions in the late 1100s to mid-1200s.","zh":"与阿尤布王朝有关的；指一个在12世纪末至13世纪中期统治埃及、叙利亚及周边地区的穆斯林王朝（家族）。"},"examples":[{"en":"Ayyubid architecture can still be seen in parts of Cairo and Damascus.","zh":"在开罗和大马士革的一些地方仍能看到阿尤布王朝时期的建筑。"},{"en":"The museum has coins from the Ayyubid period.","zh":"这家博物馆收藏有阿尤布王朝时期的硬币。"}]},{"partOfSpeech":"n.","definition":{"en":"a member of the Ayyubid ruling family or someone associated with the Ayyubid Dynasty.","zh":"阿尤布王朝的成员；与阿尤布王朝有关的人。"},"examples":[{"en":"Saladin was an Ayyubid who became famous during the Crusades.","zh":"萨拉丁是阿尤布王朝的人物，并在十字军东征时期声名显赫。"},{"en":"The chronicler described the Ayyubids as skilled administrators.","zh":"编年史作者把阿尤布王朝的人描述为善于行政管理。"}]}],"synonyms":["Ayyubid dynasty","Ayyubid period","Ayyubids"],"phonetic":"/aɪˈjuːbɪd/","extraExplanation":["“Ayyubid”来自家族祖先“艾尤布（Ayyub）”的名字；最知名的统治者是萨拉丁（Saladin），他在1187年收复耶路撒冷，使“阿尤布王朝/阿尤布王朝时期（Ayyubid period）”在英语历史写作中常与“十字军东征（the Crusades）”一起出现。","在学术与博物馆语境里常见搭配：Ayyubid dynasty（阿尤布王朝）、Ayyubid Egypt/Syria（阿尤布时期的埃及/叙利亚）、Ayyubid art/architecture/coinage（阿尤布艺术/建筑/钱币）。"]}
{"word":"ayyubid","summary":{"en":"Ayyubid means “connected with the Ayyubid dynasty,” or a member of that dynasty.","zh":"Ayyubid指“与阿尤布王朝有关的”，也可指该王朝（或其统治家族）的成员。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Ayyubids, a Muslim dynasty that ruled parts of Egypt, Syria, and nearby regions in the 1100s–1200s","zh":"与阿尤布王朝（12–13世纪统治埃及、叙利亚及周边地区的穆斯林王朝）有关的"},"examples":[{"en":"Ayyubid rulers rebuilt Cairo’s defenses and strengthened the city’s walls.","zh":"阿尤布王朝的统治者重建了开罗的防御工事，并加固了城墙。"},{"en":"The museum has an Ayyubid-era metal bowl decorated with Arabic inscriptions.","zh":"博物馆里有一只阿尤布王朝时期的金属碗，上面装饰着阿拉伯文铭文。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from, or a member of, the Ayyubid dynasty or its ruling family","zh":"阿尤布王朝的人；尤指该王朝或其统治家族的成员"},"examples":[{"en":"Saladin is the most famous Ayyubid in medieval history.","zh":"萨拉丁是中世纪历史上最著名的阿尤布王朝人物。"},{"en":"The chronicle describes the Ayyubids’ alliances and rivalries in the region.","zh":"这部编年史描述了阿尤布王朝在该地区的结盟与对立。"}]}],"synonyms":["Ayyubid dynasty","Ayyubid period","Ayyubid-era"],"phonetic":"/aɪˈjuːbɪd/","extraExplanation":["“Ayyubid”来自阿拉伯语“al-Ayyūbī”，意为“阿尤布（Ayyub）的后裔/家族”，阿尤布是萨拉丁之父的名字。","阿尤布王朝常与十字军东征背景一起出现：萨拉丁于1187年收复耶路撒冷，使“Ayyubid”在英语历史写作中常与“Crusades（十字军）”“Levant（黎凡特）”等词同域出现。"]}
