{"word":"AZ","summary":{"en":"AZ most commonly means Arizona; A–Z (A to Z) means “from beginning to end” or “in alphabetical order.”","zh":"AZ 最常见指美国亚利桑那州；A–Z（A to Z）表示“从头到尾/包罗万象”或“按字母顺序”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Arizona (U.S. state abbreviation used in addresses, maps, and official documents).","zh":"亚利桑那州（美国州名缩写，常用于地址、地图和官方文件）。"},"examples":[{"en":"She lives in Phoenix, AZ.","zh":"她住在亚利桑那州的菲尼克斯（Phoenix）。"},{"en":"Please write your city and state: Tucson, AZ.","zh":"请写上你的城市和州：图森，AZ（亚利桑那州）。"}]},{"partOfSpeech":"phrase","definition":{"en":"(Often written A–Z or A to Z) covering everything; from beginning to end; in alphabetical order.","zh":"（常写作 A–Z 或 A to Z）包罗万象；从头到尾；按字母顺序。"},"examples":[{"en":"The guide covers New York City from A to Z.","zh":"这本指南从 A 到 Z 介绍了纽约市的方方面面。"},{"en":"Please list the names A–Z.","zh":"请把这些名字按 A–Z（字母顺序）列出来。"}]}],"synonyms":["Arizona","A to Z","alphabetical","from beginning to end"],"phonetic":"/ˌeɪˈziː/","extraExplanation":["在美国邮政地址中，“AZ”是亚利桑那州的两字母官方缩写（类似 CA=加州，NY=纽约州）。写地址时通常州缩写要大写。","“A–Z / A to Z”在英语里很常用来表示“全部、完整范围”，也常用在词典、目录、清单等场景中表示“按字母顺序排列”。"]}
{"word":"az","summary":{"en":"AZ most commonly means the U.S. state Arizona; it can also mean “A–Z,” from beginning to end.","zh":"AZ最常见表示美国亚利桑那州；也可表示“A到Z”，即“从头到尾”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Arizona, a state in the southwestern United States (postal abbreviation: AZ).","zh":"（缩写）美国亚利桑那州（邮政缩写：AZ）。"},"examples":[{"en":"She lives in Phoenix, AZ.","zh":"她住在亚利桑那州（AZ）的凤凰城。"},{"en":"The package was shipped to Tucson, AZ.","zh":"包裹被寄到亚利桑那州（AZ）的图森。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., informal) A–Z; covering everything from beginning to end (often written as “A to Z” or “A-Z”).","zh":"（缩写，非正式）从A到Z；表示“从头到尾、应有尽有”。"},"examples":[{"en":"The guide explains the process A–Z.","zh":"这本指南把流程从头到尾讲清楚了。"},{"en":"They offer services from A–Z.","zh":"他们提供从头到尾的一整套服务。"}]}],"synonyms":["Arizona","A to Z","A–Z"],"phonetic":"/ˌeɪˈziː/","extraExplanation":["在正式书写中，“Arizona”几乎总是写作大写“AZ”，尤其用于地址（州名后常接邮编）。","表示“从A到Z”的含义时，更常见的写法是“A to Z”或“A–Z”；单独写“az”不如这些形式常见，容易引起歧义。"]}
{"word":"aza","summary":{"en":"“AZA” most commonly refers to the Association of Zoos and Aquariums; “aza-” is also a chemistry prefix related to nitrogen.","zh":"“AZA”最常指美国动物园与水族馆协会；“aza-”也可作化学前缀，表示与氮有关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Abbrev.) Association of Zoos and Aquariums (a U.S. organization that accredits zoos and aquariums).","zh":"（缩写）美国动物园与水族馆协会（负责对动物园和水族馆进行认证的机构）。"},"examples":[{"en":"The zoo is AZA-accredited, which means it meets high standards of animal care.","zh":"这家动物园通过了AZA认证，这通常表示它在动物照护方面达到较高标准。"},{"en":"Many families check whether a facility is in the AZA directory before visiting.","zh":"很多家庭在参观前会先查看该场馆是否在AZA名录中。"}]},{"partOfSpeech":"other","definition":{"en":"(Chemistry) A prefix meaning “containing nitrogen” or “nitrogen substituted for carbon” in a molecule (used in chemical names).","zh":"（化学）前缀，表示“含氮”或“以氮取代碳”（用于化学命名）。"},"examples":[{"en":"In chemistry, “aza-” is used in names like azabenzene.","zh":"在化学中，“aza-”常见于如 azabenzene 这类名称中。"},{"en":"The prefix indicates a nitrogen atom has replaced a carbon atom in the ring.","zh":"这个前缀表示环中有一个碳原子被氮原子取代。"}]}],"synonyms":["(AZA) Association of Zoos and Aquariums","(aza-) nitrogen-containing (in naming)"],"phonetic":"/ˌeɪziːˈeɪ/","extraExplanation":["在英文里单独写成“aza”并不算常用词；最常见的是大写“AZA”（美国动物园与水族馆协会）的缩写。","如果你看到“AZA-accredited”，通常与动物园/水族馆的行业认证与标准有关。","如果你是在化学课本里看到“aza-”，它属于命名用语，常出现在含氮杂环或类似结构的化合物名称中。"]}
{"word":"azadirachta","summary":{"en":"Azadirachta is the plant genus best known for neem (Azadirachta indica).","zh":"Azadirachta 是一个植物属，最出名的成员是 neem（印度楝／苦楝，Azadirachta indica）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of trees in the mahogany family (Meliaceae), best known for the neem tree (Azadirachta indica).","zh":"楝科（Meliaceae）中的一个树属，最著名的是印度楝／苦楝（neem，Azadirachta indica）。"},"examples":[{"en":"Azadirachta indica, a species in the genus Azadirachta, is commonly called the neem tree.","zh":"Azadirachta 属中的 Azadirachta indica 这种树，通常被称为 neem（印度楝／苦楝）。"},{"en":"Some natural pesticides are made from Azadirachta (neem) extracts.","zh":"一些天然杀虫剂是由 Azadirachta（neem）提取物制成的。"}]}],"synonyms":["neem (common name, especially for Azadirachta indica)","Azadirachta indica (a species name)"],"phonetic":"/ˌæzədaɪˈræktə/","extraExplanation":["“Azadirachta”是一个拉丁化的植物学名称，常与“neem（印度楝／苦楝）”相关。日常英语中，人们更常说“neem”而不是“Azadirachta”。","词源常被解释为来自波斯语相关表达（常见说法为 azad-dirakht，意为“高贵/自由之树”一类的含义），后被用于植物分类命名。","在文化与生活应用上，neem 在南亚地区常见于传统草本与日用品（如肥皂、护肤品）以及农业中的植物源防虫用途；但作为植物提取物使用时应注意剂量与安全性。"]}
{"word":"azadrachta","summary":{"en":"Azadirachta is the scientific genus name best known for the neem tree.","zh":"Azadirachta 是植物学属名，最常指著名的印度楝（neem）等树木。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of trees in the mahogany family, especially the neem tree (Azadirachta indica), known for medicinal and insect-repelling uses","zh":"楝属（楝科）的一类树木，尤指印度楝/苦楝（neem，学名 Azadirachta indica），常因药用与驱虫用途而闻名"},"examples":[{"en":"Neem (Azadirachta indica) is widely used in traditional medicine and natural pest control.","zh":"印度楝（Azadirachta indica）常用于传统医药和天然防虫。"},{"en":"Researchers studied extracts from Azadirachta leaves for their potential antibacterial effects.","zh":"研究人员研究了楝属树叶提取物可能具有的抗菌作用。"}]}],"synonyms":["neem","Azadirachta indica"],"phonetic":"/ˌæzədaɪˈræktə/","extraExplanation":["你输入的 **azadrachta** 很可能是 **Azadirachta** 的拼写误差。Azadirachta 是拉丁化的植物学属名，常见于学术文章、药用/精油/农用杀虫相关资料。","词源常被认为与波斯语/印地语等语言有关，常见解释是源自类似 **āzād dirakht**（“自由之树”）的表达，后来进入植物学拉丁命名体系。"]}
{"word":"azafran","summary":{"en":"Azafrán is the Spanish word for saffron, a costly spice that adds flavor and a golden color; it can also describe a saffron-like yellow-orange color.","zh":"Azafrán 是西班牙语的“藏红花”，一种昂贵香料，可增香并让食物呈金黄色；也可指类似藏红花的黄橙色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish word) saffron: a very expensive spice made from the dried red stigmas of a crocus flower, used to add a golden color and a distinctive flavor to food.","zh":"（西班牙语）藏红花：由番红花（藏红花）花朵的红色柱头干燥制成的昂贵香料，用来给食物增添金黄色泽和独特风味。"},"examples":[{"en":"In Spanish, “azafrán” means “saffron,” which is used in paella.","zh":"在西班牙语里，“azafrán”就是“藏红花”，常用于西班牙海鲜饭（paella）。"},{"en":"A tiny pinch of azafrán can color an entire pot of rice.","zh":"只要一点点藏红花就能让一整锅米饭上色。"}]},{"partOfSpeech":"adj.","definition":{"en":"By extension, a deep yellow-orange color like the color saffron produces.","zh":"引申义：藏红花色；类似藏红花染出的深黄橙色。"},"examples":[{"en":"She wore a scarf in an azafrán shade.","zh":"她戴着一条藏红花色调的围巾。"}]}],"synonyms":["saffron","crocus spice","golden-yellow (color)"],"phonetic":"/ˌɑːzəˈfrɑːn/","extraExplanation":["“azafrán”是西班牙语拼写（重音在最后一音节：a-za-FRÁN）。在英语里更常用的词是“saffron”。","这个词源自阿拉伯语“za‘farān（زعفران）”，通过中世纪地中海贸易进入欧洲多种语言；在西班牙饮食文化中尤其常见。"]}
{"word":"azafrin","summary":{"en":"Azafrin is a rare/old noun meaning saffron or a saffron-like yellow dye/pigment.","zh":"Azafrin 是一个罕见/旧用名词，指藏红花或类似藏红花的黄色染料/色素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a yellow-orange coloring substance; an old or rare word used for saffron or a saffron-like dye/pigment","zh":"（罕见/旧用）黄色或橙黄色的着色物质；可指藏红花（saffron）或类似藏红花的染料/色素"},"examples":[{"en":"In older texts, azafrin may refer to saffron used for coloring food.","zh":"在一些较早的文本中，azafrin 可能指用来给食物上色的藏红花。"},{"en":"The fabric was tinted with an azafrin-like yellow dye.","zh":"这块布用一种类似 azafrin 的黄色染料染色。"}]}],"synonyms":["saffron","yellow dye","pigment"],"phonetic":"/ˈæzəfrɪn/","extraExplanation":["“Azafrin”在现代英语中非常少见，更多时候你会看到更常用的词 **saffron（藏红花）**。如果你是在配料表、旧书或跨语言文本里看到它，它可能是对“藏红花/黄色染料”的一种旧式或变体拼写。","词源上，它可能与西班牙语 **azafrán**（藏红花）同源，而 azafrán 又来自阿拉伯语 **za‘farān**（藏红花）。","如果你能提供看到它的句子或出处（例如书名、网页、配料表），我可以更准确判断它指的是“香料藏红花”还是“色素/染料”。"]}
{"word":"Azal","summary":{"en":"Azal most commonly means the beginningless eternal past in Islamic thought; it is also used as a personal name.","zh":"Azal 常指伊斯兰思想中的“无始的永恒过去”；也可作人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Eternity in the past; the timeless beginningless past (used especially in Islamic philosophy/theology, often contrasted with \"abad,\" eternity in the future).","zh":"无始的永恒过去；没有起点的久远之昔（多用于伊斯兰哲学/神学中，常与“abad”（无终的永恒未来）相对）。"},"examples":[{"en":"In some Islamic texts, \"azal\" refers to God's existence with no beginning.","zh":"在一些伊斯兰文本中，“azal”指真主的存在无始无终，尤其强调“无始”。"},{"en":"The poet wrote about a love that seemed to come from azal and last into the future.","zh":"诗人写到一种仿佛来自“azal”（亘古以前）并延续到未来的爱情。"}]},{"partOfSpeech":"other","definition":{"en":"A given name (more common in Arabic-, Persian-, Turkish-, and South Asian contexts).","zh":"人名（在阿拉伯语、波斯语、土耳其语及南亚语境中较常见）。"},"examples":[{"en":"Azal is my classmate's name.","zh":"Azal 是我同学的名字。"},{"en":"They named their son Azal for its sense of timelessness.","zh":"他们给儿子取名 Azal，取其“永恒、无始”的含义。"}]}],"synonyms":["eternity (past)","the timeless past","primeval time"],"phonetic":"/əˈzɑːl/","extraExplanation":["词源上常与阿拉伯语概念相关，表示“无始之久远”。在宗教与哲学语境中，常见搭配是“azal and abad”，分别指“无始的永恒过去”和“无终的永恒未来”。","作为人名时，含义往往与“永恒、久远、超越时间”相关；不同地区的拼写与读音可能略有差异。"]}
{"word":"Azalea","summary":{"en":"Azalea is a flowering shrub known for its colorful spring blooms, often grown in gardens.","zh":"Azalea 指开花繁茂、色彩鲜艳的杜鹃花灌木，常见于春季花园栽培。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flowering shrub with bright, showy blooms (often pink, purple, red, or white), commonly grown in gardens; many azaleas are types of rhododendron","zh":"杜鹃花（常指“皋月杜鹃/西洋杜鹃”等园艺品种）；一种开花繁茂、色彩鲜艳的灌木，常用于庭院栽培；许多杜鹃花在植物分类上属于石楠属（Rhododendron）"},"examples":[{"en":"The azaleas bloom every spring in my neighborhood.","zh":"我家附近的杜鹃花每年春天都会盛开。"},{"en":"She planted azaleas along the walkway for a burst of color.","zh":"她在人行道旁种了杜鹃花，让颜色更鲜亮。"}]}],"synonyms":["rhododendron (related)","flowering shrub"],"phonetic":"/əˈzeɪliə/","extraExplanation":["“Azalea”一词源自希腊语，含义与“干燥”有关（早期欧洲人观察到某些种类生长在较干燥的土坡上）。在英语文化中，azalea 常让人联想到“春天的花景、庭院美化、节庆花展”。","在美国南部，“Azalea Festival（杜鹃花节）”很常见，例如北卡罗来纳州的相关花节活动。","小提醒：部分杜鹃花（以及杜鹃属植物）对宠物有毒，若家中有猫狗，种植或摆放时要留意。"]}
{"word":"azalea","summary":{"en":"Azalea is a bright-flowering shrub often grown as an ornamental garden plant.","zh":"Azalea 指开花鲜艳的观赏性灌木“杜鹃花”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flowering shrub with bright, showy blooms (often pink, red, purple, or white), commonly grown in gardens; many kinds are part of the rhododendron family","zh":"杜鹃花（常指“西洋杜鹃/映山红类”的杜鹃属或杜鹃花类灌木），开花鲜艳，常见粉、红、紫、白等颜色，常作园艺观赏植物"},"examples":[{"en":"The azaleas in our yard bloom every spring.","zh":"我们院子里的杜鹃花每年春天都会开。"},{"en":"She planted azaleas along the front walkway for color.","zh":"她在前门走道旁种了杜鹃花来增添色彩。"},{"en":"In the park, the azaleas were in full bloom after a warm week.","zh":"暖和了一周后，公园里的杜鹃花开得正盛。"}]}],"synonyms":["rhododendron (related plant)","flowering shrub"],"phonetic":"/əˈzeɪliə/","extraExplanation":["“Azalea”来自希腊语，原意与“干燥”有关，早期欧洲人注意到这种植物常生长在较干的坡地或林缘。现代植物分类上，许多所谓“azalea”被归入杜鹃属（Rhododendron）。","在美国文化里，杜鹃花常与春天、庭院景观联系在一起；在一些地区（如美国南部）春季会有以杜鹃花为主题的花展或节庆活动。","学习小提示：英语里常见搭配是“azaleas in bloom / plant azaleas / a row of azaleas”。复数通常用“azaleas”。"]}
{"word":"Azaleah","summary":{"en":"Azaleah is most often a variant spelling of azalea (a colorful flowering shrub) and is also used as a given name.","zh":"Azaleah 多为 azalea（杜鹃花/观赏灌木）的变体拼写，也可用作人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flowering shrub with colorful blooms, commonly grown as an ornamental plant; azaleas are closely related to rhododendrons.","zh":"杜鹃花（常见观赏灌木），花色鲜艳；与石楠属/杜鹃属植物（rhododendrons）关系密切。"},"examples":[{"en":"The garden is full of azaleas in spring.","zh":"春天花园里开满了杜鹃花。"},{"en":"She planted pink azaleas along the walkway.","zh":"她在小路旁种了粉色的杜鹃花。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name (usually feminine) used in English; often chosen for its floral association.","zh":"（常作女性名的）人名；常因“花”的意象而被选用。"},"examples":[{"en":"Azaleah is a unique name inspired by the flower.","zh":"Azaleah 是个受花名启发、很特别的名字。"},{"en":"Azaleah introduced herself at the meeting.","zh":"Azaleah 在会上做了自我介绍。"}]}],"synonyms":["azalea","rhododendron"],"phonetic":"/əˈzeɪliə/","extraExplanation":["“Azaleah”更常见的是“azalea”的变体拼写（多见于人名）。标准植物名通常拼作“azalea”。","在英语文化里，用花名取名很常见（如 Lily, Rose, Violet）。Azaleah/Azalea 也带有“明亮、盛放、春天”的联想。"]}
{"word":"azaleamum","summary":{"en":"“Azalea mum” usually means a chrysanthemum variety with azalea-like flowers.","zh":"“azalea mum”通常指花型像杜鹃花的菊花品种/盆栽菊。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of chrysanthemum (“mum”) with blooms shaped like an azalea; often sold as a potted autumn flower","zh":"一种“菊花（mum）”，花型像杜鹃花（azalea）；常作为秋季盆栽花卉出售"},"examples":[{"en":"The garden center had azalea mums in purple and bronze.","zh":"园艺店有紫色和古铜色的杜鹃型菊花。"},{"en":"She decorated the porch with azalea mums for fall.","zh":"她用杜鹃型菊花装饰门廊迎接秋天。"}]}],"synonyms":["azalea chrysanthemum","florist's mum","chrysanthemum"],"phonetic":"əˈzeɪliə mʌm","extraExplanation":["“mum”是chrysanthemum（菊花）的常见口语简称；在英式英语中，mum也常表示“妈妈”，但在“azalea mum”里通常指“菊花”。","“azalea mum”更多是园艺/花卉市场上的俗称或商品名，不一定是严格的植物学分类名称；不同商家可能把花型相近的菊花品种都这样称呼。"]}
{"word":"azaleas","summary":{"en":"Azaleas are colorful flowering shrubs commonly grown in gardens.","zh":"azaleas 指色彩鲜艳、常用于园艺栽培的杜鹃花灌木。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Azaleas are flowering shrubs with bright blossoms (often pink, red, white, or purple), commonly grown in gardens; they are closely related to rhododendrons.","zh":"杜鹃花（灌木类开花植物，花色鲜艳，常见粉、红、白、紫等），常用于园艺栽培；与石楠/杜鹃属植物（rhododendron）关系密切。"},"examples":[{"en":"The azaleas in our yard bloom every spring.","zh":"我们院子里的杜鹃花每年春天都会开。"},{"en":"She planted azaleas along the front walkway for color.","zh":"她在前院小路旁种了杜鹃花来增添色彩。"},{"en":"After the rain, the azaleas looked even more vibrant.","zh":"下过雨后，杜鹃花看起来更鲜艳了。"}]}],"synonyms":["rhododendron","flowering shrub"],"phonetic":"əˈzeɪliə","extraExplanation":["“azalea”在英文里常指园艺中常见的杜鹃花灌木，很多品种属于杜鹃属（Rhododendron）的一个类群，因此你有时会看到“azaleas and rhododendrons”并列，用来区分外观或园艺习惯上的不同。","在美国南部（例如乔治亚州、北卡罗来纳州），杜鹃花常见于庭院与公园景观；“Azalea Trail（杜鹃花步道）”之类的活动/景点名称也很常见，用来指春季赏花路线。"]}
{"word":"Azalia","summary":{"en":"Azalia is most commonly used as a feminine name; it can also appear as a less common spelling of “azalea,” the flowering shrub.","zh":"Azalia 最常见用作女性名字；也可能作为“azalea（杜鹃花）”的不常见拼写出现。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a feminine given name (also spelled Azalea in some contexts).","zh":"女性名字（在某些语境中也会写作 Azalea）。"},"examples":[{"en":"Azalia moved to Chicago for graduate school.","zh":"Azalia 为了读研究生搬到了芝加哥。"},{"en":"Azalia is a popular baby name in some countries.","zh":"Azalia 在一些国家是比较受欢迎的宝宝名字。"}]},{"partOfSpeech":"n.","definition":{"en":"a less common spelling of “azalea,” a flowering shrub with bright blossoms.","zh":"“azalea（杜鹃花/映山红）”的不太常见拼写，指一种开鲜艳花朵的灌木。"},"examples":[{"en":"The garden is full of azaleas in spring. (Often spelled “azalea.”)","zh":"春天花园里开满了杜鹃花。（通常拼作“azalea”。）"},{"en":"She planted an azalea near the front porch.","zh":"她在门廊前种了一株杜鹃花。"}]}],"synonyms":["Azalea (common spelling for the flower)"],"phonetic":"/əˈzeɪliə/","extraExplanation":["在英文里更常见的植物拼写是 **azalea**；“Azalia”更常见于人名或品牌名。若你是在写花的名字，通常建议用 **azalea**。","名字 **Azalia** 常被认为带有花的联想（像 Azalea 一样），给人“明亮、温柔、春天感”的印象，但不同文化/家庭取名含义可能不同。"]}
{"word":"Azan","summary":{"en":"Azan is the Islamic call to prayer announced from a mosque.","zh":"Azan 指伊斯兰教从清真寺发出的礼拜呼唤（宣礼）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Islamic call to prayer, traditionally recited or sung from a mosque (often by a muezzin) to announce that it is time for one of the five daily prayers","zh":"（伊斯兰教）宣礼；唤礼：通常由清真寺宣礼员诵唱，用来提醒穆斯林到五次礼拜的时间"},"examples":[{"en":"At dawn, the azan echoed through the neighborhood.","zh":"黎明时分，宣礼声在街区回荡。"},{"en":"We paused our conversation when we heard the azan from the nearby mosque.","zh":"听到附近清真寺的宣礼后，我们暂停了谈话。"},{"en":"During Ramadan, some people notice the azan more often because daily routines change.","zh":"在斋月期间，由于作息改变，有些人会更常注意到宣礼声。"}]}],"synonyms":["adhan","call to prayer"],"phonetic":"ɑːˈzɑːn","extraExplanation":["“Azan”常见于英语对伊斯兰文化的介绍中，也常拼作“adhan”（更接近阿拉伯语发音）。它不仅是“通知”，也具有宗教仪式与社区生活的象征意义。","在不同地区，宣礼的旋律与诵唱风格可能不同；有的地方通过扩音器播放，有的则更为克制。旅行或写作时，描述宣礼声时注意语气中立、尊重当地习俗会更得体。"]}
{"word":"azan","summary":{"en":"Azan is the Islamic call to prayer, announcing it is time to pray.","zh":"Azan 指伊斯兰教的宣礼（唤拜），用于宣告礼拜时间到。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Islam) the call to prayer, traditionally recited from a mosque to announce that it is time for one of the five daily prayers; also spelled adhan.","zh":"（伊斯兰教）宣礼（唤拜），通常由清真寺宣告礼拜时间（一天五次礼拜之一）开始；也常拼作 adhan。"},"examples":[{"en":"At dawn, the azan echoed across the neighborhood.","zh":"黎明时分，宣礼声在社区上空回荡。"},{"en":"Visitors paused quietly when they heard the azan from the mosque.","zh":"游客听到清真寺传来的宣礼声时，安静地停了下来。"},{"en":"The documentary explains what the azan means and when it is recited.","zh":"这部纪录片解释了宣礼的含义以及诵读的时间。"}]}],"synonyms":["adhan","call to prayer"],"phonetic":"/ɑːˈzɑːn/","extraExplanation":["“Azan”是“adhan（أذان）”的另一种英语拼写/转写形式，不同地区与语言背景会选择不同拼法，但指的都是同一件事。","宣礼通常由“muezzin（宣礼员）”诵读，用来提醒穆斯林到指定时间进行礼拜；在一些地方会用扩音设备播送。","在英语写作中，如果你想更常见、更标准的拼写，学术或新闻语境里常用“adhan”；“azan”也很常见，尤其在南亚等地区背景的英语中。"]}
{"word":"Azana","summary":{"en":"Azana is usually a personal name (a proper noun), with meaning that varies by culture.","zh":"Azana 通常是人名/专名，含义会因文化与来源而异。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (often feminine) and sometimes a family name; its meaning depends on the language/culture of the person or family using it.","zh":"人名（多作女性名，也可作姓氏）；具体含义取决于使用者的语言与文化背景。"},"examples":[{"en":"Azana is a common name in her community, so people can pronounce it easily.","zh":"Azana 在她的社群里很常见，所以大家都很会读。"},{"en":"I met Azana at the conference and asked how to say her name correctly.","zh":"我在会议上认识了 Azana，并问她名字怎么正确发音。"}]},{"partOfSpeech":"n.","definition":{"en":"a proper noun used in names of people, brands, or organizations.","zh":"专有名词：用于人名、品牌名或机构名等。"},"examples":[{"en":"Azana is also the name of a local business.","zh":"Azana 也是一家本地公司的名字。"}]}],"phonetic":"/əˈzɑːnə/","extraExplanation":["“Azana”更常见于姓名/专名语境，不像普通词汇那样有固定、通用的词典释义。不同地区可能有不同来源与含义。","学习时要注意拼写相近词：**asana**（瑜伽体式）/əˈsɑːnə/；以及 **azan/adhan**（伊斯兰“唤礼”，召集礼拜的呼唤）。如果你是在特定文章、歌曲或文化语境里看到“Azana”，给我一句原句，我可以帮你判断它指的是什么。"]}
{"word":"Azande","summary":{"en":"Azande refers to an ethnic group in Central Africa and the language they speak.","zh":"Azande 指中非地区的阿赞德民族，也可指他们所说的阿赞德语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a people (ethnic group) mainly living in South Sudan, the northeastern Democratic Republic of the Congo, and the Central African Republic","zh":"阿赞德人（主要分布在南苏丹、刚果民主共和国东北部与中非共和国的民族）"},"examples":[{"en":"The Azande are known for rich oral traditions and storytelling.","zh":"阿赞德人以丰富的口述传统与讲故事文化闻名。"},{"en":"An anthropologist studied village life among the Azande in Central Africa.","zh":"一位人类学家研究了中非地区阿赞德人的村落生活。"}]},{"partOfSpeech":"n.","definition":{"en":"the language spoken by the Azande people (often called Zande)","zh":"阿赞德语（阿赞德人使用的语言，亦常称作 Zande）"},"examples":[{"en":"He learned basic greetings in Azande before traveling.","zh":"出发旅行前，他学了一些阿赞德语的基本问候语。"},{"en":"The interview was recorded in Azande and later translated into English.","zh":"采访以阿赞德语录制，之后翻译成英文。"}]}],"synonyms":["Zande"],"phonetic":"/ɑːˈzæn.deɪ/","extraExplanation":["“Azande”常作为人名/族名和语言名使用；在学术写作中也常见拼写“Zande”。","阿赞德人曾因英国人类学家 E. E. Evans-Pritchard 的经典民族志研究而为英语世界所熟知，尤其涉及社会组织与信仰体系等主题。"]}
{"word":"azande","summary":{"en":"Azande refers to a Central African people (the Zande), their language, or anything related to their culture.","zh":"Azande 指中非的阿赞德（赞德）民族、他们的语言，或与其文化相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Central African ethnic group (also called the Zande), mainly living in South Sudan, the Democratic Republic of the Congo, and the Central African Republic","zh":"阿赞德人（又称赞德人）：中非的一个民族，主要分布在南苏丹、刚果民主共和国和中非共和国"},"examples":[{"en":"The Azande are known for rich storytelling traditions.","zh":"阿赞德人以丰富的讲故事传统而闻名。"},{"en":"An anthropologist lived with the Azande to learn about daily life and beliefs.","zh":"一位人类学家与阿赞德人共同生活，以了解他们的日常生活与信仰。"}]},{"partOfSpeech":"n.","definition":{"en":"the language spoken by the Azande people; often referred to as Zande","zh":"阿赞德语（常也称赞德语）：阿赞德人使用的语言"},"examples":[{"en":"She is learning Azande to communicate with local elders.","zh":"她正在学习阿赞德语，以便与当地长者交流。"},{"en":"Some books list the language as Zande rather than Azande.","zh":"一些书把这种语言写作“Zande（赞德语）”而不是“Azande（阿赞德语）”。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Azande people or their language and culture","zh":"与阿赞德人、阿赞德语或其文化有关的"},"examples":[{"en":"Azande customs vary across different regions.","zh":"阿赞德习俗在不同地区有所差异。"},{"en":"The museum displayed Azande art and musical instruments.","zh":"博物馆展出了阿赞德艺术品和乐器。"}]}],"synonyms":["Zande"],"phonetic":"/əˈzæn.di/","extraExplanation":["“Azande / Zande”常出现在人类学与非洲研究中，尤其因英国人类学家E. E. Evans-Pritchard对阿赞德社会与“巫术/占卜”观念的经典研究而广为人知。","拼写上既可用 Azande（常指“阿赞德人/阿赞德语”）也可见 Zande（更短的变体）；两者在英文资料中有时可互换，但具体用法会随作者与学科习惯而变。"]}
{"word":"azans","summary":{"en":"“Azans” means the Muslim calls to prayer (plural of azan/adhan).","zh":"“azans”指穆斯林的宣礼/唤礼（azan/adhan 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Muslim call to prayer (a public announcement that it is time to pray), usually recited from a mosque; plural of “azan.”","zh":"（伊斯兰教）宣礼/唤礼（提醒礼拜时间的呼唤），常由清真寺诵唱；“azan”的复数。"},"examples":[{"en":"At dawn, the azans echoed across the neighborhood.","zh":"黎明时分，宣礼声在社区上空回荡。"},{"en":"In some cities, you can hear several azans from different mosques.","zh":"在一些城市，你能听到来自不同清真寺的多处宣礼声。"}]}],"synonyms":["adhan","call to prayer"],"phonetic":"/ɑːˈzɑːnz/","extraExplanation":["“Azan”也常拼作“adhan”。这是伊斯兰文化中非常重要、日常可听见的宗教呼唤，一天通常有五次，对应五次礼拜时间。不同地区的诵唱风格与音调可能不同。"]}
{"word":"Azar","summary":{"en":"Azar can mean “chance/randomness” in Spanish (often in the phrase al azar), and it is also used as a personal name in several cultures.","zh":"Azar 在西班牙语中可指“偶然/随机”（常见于 al azar），同时也是多种文化中使用的人名或姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) chance; randomness; luck (often in the sense of something happening without planning).","zh":"（西班牙语）偶然；随机；运气（常指未计划、非刻意发生的事情）。"},"examples":[{"en":"The meeting happened by azar, not because we planned it.","zh":"这次见面是偶然发生的，并不是我们计划好的。"},{"en":"He chose a book al azar from the shelf.","zh":"他从书架上随手（随机）挑了一本书。"}]},{"partOfSpeech":"n.","definition":{"en":"A given name or surname in several cultures (e.g., Persian, Arabic, Turkish); used as a person’s name.","zh":"人名/姓氏（见于多种文化中，如波斯语、阿拉伯语、土耳其语等）。"},"examples":[{"en":"Azar is her family name.","zh":"Azar 是她的姓。"},{"en":"I met someone named Azar at the conference.","zh":"我在会议上认识了一个叫 Azar 的人。"}]}],"synonyms":["chance","randomness","luck","coincidence"],"phonetic":"/ɑˈzɑr/","extraExplanation":["在西班牙语里，azar 常出现在固定搭配 **al azar**，意思是“随机地、随意地、碰巧”。例如：**elegir al azar**（随机选择）、**encontrar al azar**（偶然遇到）。","作为人名时，Azar 在不同语言中可能有不同来源与含义；比如在波斯语中 **Āzar/آذر** 常与“火”相关，也可指波斯历中的一个月份名称。具体含义要看个人/家族的语言与文化背景。"]}
{"word":"Azarcon","summary":{"en":"Azarcon is a lead-based folk remedy that is highly toxic and can cause lead poisoning.","zh":"Azarcon 是一种含铅的民间药物，毒性很强，可能引发铅中毒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional folk medicine (often an orange-red powder) made from lead compounds, historically used especially in some Latin American communities to treat stomach problems; it is highly toxic and can cause lead poisoning","zh":"一种含铅化合物制成的传统民间药粉（常呈橘红色），历史上在一些拉丁美洲社群中用于治疗胃部不适；但毒性极强，可能导致铅中毒"},"examples":[{"en":"The doctor asked whether the child had been given azarcon, because lead poisoning was suspected.","zh":"医生询问孩子是否服用过azarcon，因为怀疑是铅中毒。"},{"en":"Some families once used azarcon as a home remedy for empacho (an upset stomach).","zh":"一些家庭曾把azarcon当作治疗“empacho”（消化不良/胃不适）的家庭偏方。"}]}],"synonyms":["lead-based folk remedy","red lead (context-dependent)","greta (regional)"],"phonetic":"/ˌɑzɑrˈkoʊn/","extraExplanation":["“Azarcon”常被译作“红丹/铅丹（含铅药粉）”，在美国公共卫生语境中多与儿童铅中毒案例相关。它并非安全的药物，现代医学与公共卫生机构普遍警告不要使用。","该词在英语中多出现在医疗、毒理学、公共卫生或移民健康教育资料里；有时也会提到它的别名（如 greta）。"]}
{"word":"Azaria","summary":{"en":"Azaria is a personal name; it is also related to the biblical name Azariah, often interpreted as “Yah(weh) has helped.”","zh":"Azaria 是一个人名；也与圣经名字 Azariah 相关，常被解释为“耶和华（上帝）曾帮助”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A personal name (given name). It is often used for boys, and sometimes for girls, depending on culture and family tradition.","zh":"人名（名字）。常见为男名，也可能用作女名，取决于文化背景和家庭习惯。"},"examples":[{"en":"Azaria is my classmate; he just moved here from another state.","zh":"Azaria 是我的同学；他刚从另一个州搬来。"},{"en":"They named their son Azaria because they liked the sound of it.","zh":"他们给儿子取名 Azaria，因为喜欢这个名字的读音。"}]},{"partOfSpeech":"n.","definition":{"en":"In the Bible, Azariah (a longer form of Azaria) is the name of several people. The name is commonly understood to mean “Yah(weh) has helped.”","zh":"在《圣经》中，Azariah（Azaria 的较长形式）是多个人物的名字。这个名字通常被理解为“耶和华帮助了（我）”。"},"examples":[{"en":"Azariah appears as a name in several Old Testament passages.","zh":"Azariah 这个名字在《旧约》的多个段落中出现。"},{"en":"Some families choose Azaria/Azariah for its biblical meaning: “God has helped.”","zh":"一些家庭选择 Azaria/Azariah，是因为它的圣经含义：“上帝曾帮助（我）”。"}]}],"synonyms":["Azariah"],"phonetic":"/əˈzɛriə/","extraExplanation":["Azaria/Azariah 源自希伯来语，常被分析为“azar（帮助）+ yah（雅/耶和华的缩写）”。因此在英语文化里，它既被当作宗教/传统名字使用，也因读音独特而被现代家庭采用。","拼写与读音提示：Azaria 常被读作“uh-ZAIR-ee-uh”（更接近美式 /əˈzɛriə/），而 Azariah 往往是 “uh-zuh-RY-uh”（不同家庭可能有差异）。"]}
{"word":"Azariah","summary":{"en":"Azariah is a Hebrew-origin male name found in the Bible and used today as a given name.","zh":"Azariah 是一个源自希伯来语、出自《圣经》的男性名字，如今也常用作英文名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a masculine given name of Hebrew origin, used especially in Jewish and Christian communities","zh":"一个源自希伯来语的男性名字，常见于犹太和基督宗教文化圈"},"examples":[{"en":"Azariah is a biblical name that some families choose for its meaning.","zh":"Azariah 是一个《圣经》中的名字，有些家庭因为它的含义而选用。"},{"en":"We named our son Azariah and call him “Aza” at home.","zh":"我们给儿子取名 Azariah，在家里叫他“Aza”。"}]},{"partOfSpeech":"n.","definition":{"en":"a name shared by several people in the Bible, including (1) one of the three young men in the Book of Daniel (known as Abednego in another name form) and (2) several priests and kings in the Old Testament","zh":"《圣经》中多个人物共用的名字，例如：（1）《但以理书》中三位少年之一（在另一种名字形式中称为 Abednego/亚伯尼歌），（2）《旧约》中若干祭司与君王"},"examples":[{"en":"In the Book of Daniel, Azariah is one of the faithful youths.","zh":"在《但以理书》中，Azariah 是忠信的少年之一。"},{"en":"Some Bible translations mention Azariah in genealogies and priestly lists.","zh":"一些《圣经》译本会在家谱或祭司名录中提到 Azariah。"}]}],"synonyms":["Azaryah","Azarias"],"phonetic":"/ˌæzəˈraɪə/","extraExplanation":["Azariah 来自希伯来语名字 עֲזַרְיָה (Azaryah)，常被解释为“耶和华帮助/上帝帮助”。在英语语境中它通常作为专有名词（人名）使用，书写首字母大写。","在《但以理书》的故事里，Azariah 与 Hananiah、Mishael 常一起出现；他们在巴比伦宫廷中也被赐予新名字（如 Azariah 对应 Abednego）。因此你可能会在不同译本或文化背景中看到不同名字形式。"]}
{"word":"azarole","summary":{"en":"A Mediterranean hawthorn tree, or its small apple-like fruit.","zh":"一种地中海山楂树，或其像小苹果的果实。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small Mediterranean hawthorn tree (Crataegus azarolus), or its yellow to red, apple-like fruit","zh":"阿扎罗勒（也叫地中海山楂）树（Crataegus azarolus），或其黄到红色、像小苹果的果实"},"examples":[{"en":"In parts of the Mediterranean, people sometimes make jam from azarole fruit.","zh":"在地中海的一些地区，人们有时会用阿扎罗勒果做果酱。"},{"en":"The garden guide listed azarole as an ornamental hawthorn with edible berries.","zh":"园艺指南把阿扎罗勒列为一种可观赏的山楂类植物，果实可食用。"}]}],"synonyms":["Mediterranean hawthorn","azarole hawthorn","Crataegus azarolus"],"phonetic":"/ˈæzəˌroʊl/","extraExplanation":["“azarole”是比较少见的植物词，多见于植物学、园艺或地中海饮食文化相关语境。","它指的通常是“Crataegus azarolus”（一种山楂属植物），中文也常按音译或归为“地中海山楂/阿扎罗勒山楂”。","词源一般认为与地中海地区的阿拉伯语借词有关（常见解释为经由西班牙语/意大利语等进入英语）。"]}
{"word":"Azarria","summary":{"en":"Azarria is a personal name, often seen as a variant of Azariah/Azaria meaning “God has helped.”","zh":"Azarria 是一个人名，常被视为 Azariah/Azaria 的变体，常见含义为“上帝已经帮助”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (proper noun); a modern variant spelling of the Hebrew name Azariah/Azaria, often interpreted as “helped by God” or “God has helped.”","zh":"人名（专有名词）；常被视为希伯来名字 Azariah / Azaria 的现代变体拼写，常见释义为“上帝帮助的人 / 上帝已经帮助”。"},"examples":[{"en":"Azarria is my sister’s name.","zh":"Azarria 是我姐姐的名字。"},{"en":"Azarria wrote her name on the top of the paper.","zh":"Azarria 把自己的名字写在纸的上方。"},{"en":"In the story, Azarria is a brave character who protects her friends.","zh":"在故事里，Azarria 是一个勇敢的角色，会保护朋友们。"}]}],"synonyms":["Azaria","Azariah","Azariya"],"phonetic":"/əˈzæriə/","extraExplanation":["“Azarria”更常见于当代取名与创意拼写；在英语语境中，它通常被当作女性名使用，但本质上属于可用于任何性别的名字（取决于个人与文化）。","它与《圣经》中较常见的名字“Azariah / Azaria”有关（来源于希伯来语），因此有些人会把它与宗教或家族传统联系起来。不同家庭对含义的解释可能略有差异。","拼写相近的名字还有：Azaria, Azariah, Azariya, Azariah 等；发音也可能随地区与个人偏好略有变化。"]}
{"word":"azaserine","summary":{"en":"Azaserine is a natural antibiotic mainly used in labs to inhibit glutamine-related cellular pathways.","zh":"Azaserine（阿扎丝氨酸）是一种天然抗生素，现代主要用于实验室中抑制与谷氨酰胺相关的细胞代谢通路。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a naturally occurring antibiotic and research chemical that can inhibit the use of the amino acid glutamine in cells, often used in laboratory studies (especially cancer and metabolism research).","zh":"阿扎丝氨酸：一种天然来源的抗生素/研究用化合物，可抑制细胞对氨基酸“谷氨酰胺（glutamine）”的利用，常用于实验室研究（尤其是癌症与代谢研究）。"},"examples":[{"en":"Azaserine is mainly used in research rather than as a common clinical antibiotic.","zh":"阿扎丝氨酸主要用于科研，而不是常见的临床抗生素。"},{"en":"In the experiment, azaserine was added to block glutamine-dependent pathways.","zh":"在实验中加入阿扎丝氨酸以阻断依赖谷氨酰胺的代谢通路。"}]}],"synonyms":["O-diazoacetyl-L-serine","AZA (common abbreviation in papers)"],"phonetic":"/əˈzæsəriːn/","extraExplanation":["它最早作为微生物产生的抗生素被发现，但在现代更常见的用途是作为“谷氨酰胺类似物”来干扰细胞代谢与核苷酸合成相关反应，因此常出现在生物化学、药理学与肿瘤学研究文献中。","在科研语境里，你可能会看到它与“glutamine metabolism（谷氨酰胺代谢）”“amidotransferase（酰胺转移酶）抑制”等关键词一起出现。"]}
{"word":"azathioprine","summary":{"en":"Azathioprine is an immunosuppressant medicine used for transplant patients and some autoimmune diseases.","zh":"Azathioprine（硫唑嘌呤）是一种免疫抑制药，用于移植后防排斥及部分自身免疫疾病治疗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a prescription medicine that suppresses the immune system, used to prevent organ-transplant rejection and to treat some autoimmune diseases (for example, rheumatoid arthritis or inflammatory bowel disease).","zh":"一种处方免疫抑制剂，用于预防器官移植后的排斥反应，也用于治疗某些自身免疫性疾病（如类风湿性关节炎、炎症性肠病等）。"},"examples":[{"en":"After the kidney transplant, he took azathioprine to help prevent rejection.","zh":"肾移植后，他服用硫唑嘌呤来帮助预防排斥反应。"},{"en":"Her doctor discussed azathioprine as a possible long-term treatment for her autoimmune condition.","zh":"医生和她讨论了硫唑嘌呤，作为治疗其自身免疫疾病的一个长期方案。"}]}],"synonyms":["Imuran","Azasan"],"phonetic":"/ˌæzəˈθaɪ.ə.priːn/","extraExplanation":["硫唑嘌呤属于免疫抑制药，常见注意点包括：可能增加感染风险、需要定期抽血监测血细胞计数与肝功能；与某些药物（如别嘌醇 allopurinol）可能有重要相互作用，需由医生调整剂量。","在英语医学语境中，它通常作为不可数名词使用（“take azathioprine”），也常与剂量单位连用（“50 mg of azathioprine”）。"]}
{"word":"Azazel","summary":{"en":"Azazel is a name from biblical and later religious traditions, referring either to a wilderness figure in the scapegoat ritual or to a demonic/fallen-angel figure in later writings and modern fiction.","zh":"Azazel 是出自圣经及后续宗教传统的专名：可指《利未记》中与“替罪羊”仪式相关的旷野存在，也可指后世文献与现代作品里常见的恶魔/堕落天使形象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A name for a demonic or fallen-angel figure in some Jewish and later Christian and Islamic traditions; often portrayed as a powerful evil spirit.","zh":"在一些犹太传统及后来的基督教、伊斯兰传统中出现的魔鬼或堕落天使之名；常被描绘为强大的邪灵。"},"examples":[{"en":"In some stories, Azazel is described as a fallen angel who taught humans forbidden knowledge.","zh":"在一些传说中，Azazel 被描述为堕落天使，向人类传授禁忌的知识。"},{"en":"The novel uses Azazel as a symbol of temptation and moral collapse.","zh":"这部小说把 Azazel 用作诱惑与道德崩塌的象征。"}]},{"partOfSpeech":"n.","definition":{"en":"In the Hebrew Bible (especially Leviticus), a wilderness figure associated with the ritual of sending away a “scapegoat,” symbolically carrying the community’s sins.","zh":"在《希伯来圣经》（尤其《利未记》）中，与“替罪羊”仪式相关的旷野存在；象征性地承载并带走群体的罪。"},"examples":[{"en":"Leviticus mentions sending a goat into the wilderness for Azazel.","zh":"《利未记》提到把一只山羊送入旷野，归于 Azazel。"},{"en":"The teacher explained how the Azazel ritual connects to the idea of a scapegoat.","zh":"老师解释了 Azazel 的仪式如何与“替罪羊”的概念相连。"}]}],"synonyms":["demon","fallen angel"],"phonetic":"/ˈæzəˌzɛl/","extraExplanation":["“Azazel”最早出现在《利未记》的赎罪日（Yom Kippur）仪式语境里：两只公山羊，一只献祭，另一只被“送走”到旷野，象征把罪带离营地；英语里的 scapegoat（替罪羊）概念常与此相关。","在后来的犹太文献（如《以诺书》传统）中，Azazel更常被塑造成堕落天使/恶魔形象，这也影响了后世基督教与流行文化（小说、影视、游戏）里的用法。","作为专名，它通常大写 Azazel；在现代作品中常被借用来表达“诱惑、堕落、黑暗力量”等象征意义，具体设定会随作品不同而变化。"]}
{"word":"azazel","summary":{"en":"Azazel is a name from biblical tradition tied to the scapegoat ritual, later often portrayed as a demon; it can also be used metaphorically for a scapegoat.","zh":"Azazel 源自圣经传统，与“替罪羊”放逐仪式相关；后期常被描写为恶魔，也可作“替罪羊”隐喻使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In the Hebrew Bible) a mysterious figure or wilderness entity associated with the Day of Atonement ritual, when a goat was sent into the desert “for Azazel.”","zh":"（《希伯来圣经》中）与赎罪日仪式相关的神秘人物或荒野实体；仪式中有一只羊被送入旷野，“归于阿撒泻勒（Azazel）”。"},"examples":[{"en":"In Leviticus, one goat is sacrificed and the other is sent into the wilderness for Azazel.","zh":"在《利未记》中，一只山羊被献祭，另一只被送进旷野归于 Azazel。"},{"en":"Some readers interpret Azazel as a place in the desert rather than a person.","zh":"有些读者把 Azazel 理解为旷野中的某个地点，而不是一个“人物”。"}]},{"partOfSpeech":"n.","definition":{"en":"(In later Jewish and Christian tradition, and in modern fantasy) a demon or fallen-angel figure often linked to sin, corruption, or forbidden knowledge.","zh":"（在后期犹太/基督宗教传统及现代奇幻作品中）常被描写为恶魔或堕落天使形象，常与罪恶、腐化或禁忌知识相关。"},"examples":[{"en":"The novel portrays Azazel as a tempter who offers power at a cost.","zh":"这部小说把 Azazel 写成诱惑者：给人力量，却要付出代价。"},{"en":"In some stories, Azazel appears as a powerful demon with a long history.","zh":"在一些故事里，Azazel 被塑造成有悠久背景的强大恶魔。"}]},{"partOfSpeech":"n.","definition":{"en":"By extension (informal), a symbol of a scapegoat—someone or something blamed to remove guilt from others.","zh":"引申义（非正式）：替罪羊的象征——为了让他人摆脱罪责而被归咎的人或事。"},"examples":[{"en":"He felt like an Azazel for the team’s mistakes.","zh":"他觉得自己成了团队错误的“Azazel”（替罪羊）。"},{"en":"The article uses Azazel as a metaphor for scapegoating in politics.","zh":"这篇文章用 Azazel 作隐喻，讨论政治中的“甩锅/替罪羊”。"}]}],"synonyms":["scapegoat (metaphor)","demon (in later tradition)"],"phonetic":"/ˈæzəˌzɛl/","extraExplanation":["Azazel 这个词最常出现在《利未记》16章“赎罪日”（Yom Kippur）的仪式里：两只公山羊抽签，一只“归耶和华”献祭，另一只“归 Azazel”被放逐到旷野，象征把罪带离群体。这也是英语里 scapegoat（替罪羊）一词背后的重要文化来源之一。","关于 Azazel 的确切含义学界并无定论：有人认为它是旷野中的某个地方名，有人认为它指某种荒野精灵/实体；在后来的宗教与民间传统中，它逐渐被人格化为恶魔或堕天使。","现代英语里 Azazel 常作为文学、影视、游戏中的专名使用；写作或翻译时通常不意译，保留为 Azazel。中文常见译名有“阿撒泻勒/阿撒兹勒”等，版本不同拼法会有差异。"]}
{"word":"Azbine","summary":{"en":"“Azbine” is not standard English; it is most likely a misspelling of “has-been.”","zh":"“Azbine”不是标准英语；它很可能是“has-been”的误拼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard spelling) A likely misspelling or phonetic spelling of “has-been,” meaning someone who was once famous or successful but is no longer popular or important.","zh":"（非标准拼写）很可能是对“has-been”的误拼或按发音拼写，指曾经很有名/成功，但如今不再受欢迎或不再重要的人。"},"examples":[{"en":"I think you mean “has-been,” not “azbine.”","zh":"我觉得你想写的是“has-been”，不是“azbine”。"},{"en":"He used to be a star, but he worries people now see him as a has-been.","zh":"他以前是明星，但他担心人们现在把他看作“过气人物”。"}]}],"synonyms":["has-been","former star","once-famous person"],"phonetic":"/ˌhæzˈbin/","extraExplanation":["“Azbine”在英语里不是常见或标准的单词拼写，通常会出现在口语转写、网络拼写或英语学习者按听到的读音来拼写时。","“has-been”带有贬义或不礼貌的语气，用在真实的人身上可能冒犯；更中性的说法可以是“former star / once-famous person / no longer in the spotlight（不再处于聚光灯下的人）”。","如果你指的是人名、品牌名或游戏/动漫里的专有名词，请告诉我它出现的句子或语境，我可以按正确含义解释。"]}
{"word":"azedarac","summary":{"en":"Azedarac (more commonly spelled azedarach) is a name for the chinaberry tree (Melia azedarach).","zh":"Azedarac（更常拼作 azedarach）指苦楝树/中国楝（Melia azedarach）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical or subtropical tree (Melia azedarach), commonly called chinaberry or Persian lilac, with clusters of small purple flowers and yellow berries.","zh":"苦楝树（学名 Melia azedarach），又常称“楝树/苦楝”“中国楝（chinaberry）”或“波斯丁香（Persian lilac）”；开淡紫色小花，结黄色浆果。"},"examples":[{"en":"Chinaberry (azedarach) trees bloom in spring with small, fragrant purple flowers.","zh":"苦楝树（azedarach）在春天开出成簇的淡紫色芳香小花。"},{"en":"The yellow berries of the azedarach tree look pretty, but they can be toxic if eaten.","zh":"苦楝树的黄色果实看起来很漂亮，但误食可能有毒。"}]}],"synonyms":["azedarach","chinaberry","Persian lilac","Melia azedarach"],"phonetic":"/ˌeɪzəˈdærək/","extraExplanation":["“azedarac”更常见的拼写是 **azedarach**，多用于植物学语境，指 **Melia azedarach**。日常英语里更常说 **chinaberry** 或 **Persian lilac**。","词源常被追溯到波斯语/阿拉伯语的外来词，后来进入拉丁学名与英语植物名称中；因此拼写看起来不太“像英语常见单词”。"]}
{"word":"azedarach","summary":{"en":"Azedarach is a tree (Melia azedarach), often called the chinaberry, grown mainly as an ornamental.","zh":"azedarach 指楝树（Melia azedarach），常称 chinaberry，多作观赏树。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tree (Melia azedarach) with fragrant purple flowers and yellow berries, native to Asia and widely planted as an ornamental; also called the chinaberry or Persian lilac","zh":"楝树（学名 Melia azedarach），开香味紫花、结黄色浆果，原产亚洲，常作观赏树；亦称“苦楝/楝树、chinaberry（楝树）、Persian lilac（波斯丁香）”"},"examples":[{"en":"The street was lined with azedarach trees that dropped yellow berries in autumn.","zh":"街道两旁种着楝树，秋天会掉落黄色的浆果。"},{"en":"In some regions, azedarach is planted for shade, but its berries are not safe to eat.","zh":"在一些地区，人们种楝树来遮阴，但它的浆果不可食用。"}]}],"synonyms":["chinaberry (tree)","Persian lilac","Melia azedarach"],"phonetic":"/ˌæzəˈdærək/","extraExplanation":["“azedarach”多见于植物学/园艺语境，作为学名的一部分（Melia azedarach）来使用；日常英语里更常说 chinaberry tree。","注意区分：Persian lilac 是楝树的别名之一，但它不是常见园艺植物“丁香”（lilac，Syringa 属）。","楝树的果实、叶等对人和宠物可能有毒；在阅读英文资料或园艺说明时常会看到相关提醒。"]}
{"word":"Azeglio","summary":{"en":"Azeglio is an Italian surname, most commonly recognized from Massimo d’Azeglio, a major figure in 19th‑century Italy.","zh":"Azeglio 是意大利姓氏，最常见的知名用法来自马西莫·达泽格里奥，他是19世纪意大利的重要人物。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an Italian surname, best known from Massimo d’Azeglio (1798–1866), a writer, painter, and statesman of the Italian unification movement.","zh":"意大利姓氏，最常见于马西莫·达泽格里奥（Massimo d’Azeglio，1798–1866）这一名字；他是作家、画家与政治家，参与意大利统一运动。"},"examples":[{"en":"I’m reading a biography of Massimo d’Azeglio and his role in early Italian politics.","zh":"我正在读马西莫·达泽格里奥的传记，了解他在意大利早期政治中的作用。"},{"en":"Some streets in Italy are named after d’Azeglio, so you may see “Via d’Azeglio” on maps.","zh":"意大利有些街道以达泽格里奥命名，所以你可能会在地图上看到“Via d’Azeglio（达泽格里奥街）”。"}]}],"synonyms":["d’Azeglio (common full form)"],"phonetic":"/ɑˈzeɪljoʊ/","extraExplanation":["“d’Azeglio”里的 d’ 是意大利语 di 的缩写，常见于姓氏中，含义接近“来自……/……家的”。在历史语境中，Massimo d’Azeglio 与意大利“复兴运动（Risorgimento）”有关；他曾任撒丁王国首相（1852–1853），其政治与文化影响常在意大利近代史课程或相关读物中出现。"]}
{"word":"Azeito","summary":{"en":"“Azeito” is usually a Portuguese-influenced way to refer to olive oil (more commonly spelled “azeite” in Portuguese).","zh":"“Azeito”通常是受葡萄牙语影响用来指“橄榄油”的写法（葡语更常见拼写为“azeite”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Loanword/variant spelling) olive oil, especially in Portuguese or Portuguese-influenced food contexts; often refers to extra-virgin olive oil used for cooking or finishing dishes.","zh":"（外来词/拼写变体）橄榄油，常见于葡萄牙语或受葡萄牙饮食影响的语境；常指用于烹饪或最后淋在菜上的（特级初榨）橄榄油。"},"examples":[{"en":"Drizzle a little azeito over the salad before serving.","zh":"上桌前在沙拉上淋一点 azeito（橄榄油）。"},{"en":"In Portuguese cooking, azeito is used to flavor fish, soups, and vegetables.","zh":"在葡萄牙料理里，azeito（橄榄油）常用来给鱼、汤和蔬菜增香。"}]}],"synonyms":["olive oil","extra-virgin olive oil"],"phonetic":"/əˈzeɪtoʊ/","extraExplanation":["“Azeito”在英语里不算常见标准词形，更常见的葡萄牙语拼写是 **azeite**（橄榄油）。如果你是在菜单、超市标签或葡语食谱里看到它，多半是借用葡语词或品牌/店名的写法。"]}
{"word":"azelaic","summary":{"en":"Azelaic means “related to azelaic acid,” commonly mentioned in skincare and dermatology.","zh":"azelaic 表示“与壬二酸有关的”，常见于护肤与皮肤科语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to azelaic acid, a chemical used especially in skincare and medicine.","zh":"与壬二酸（azelaic acid）有关的；（尤指）用于护肤或医疗的壬二酸相关的。"},"examples":[{"en":"My dermatologist recommended an azelaic acid cream for acne.","zh":"皮肤科医生建议我用壬二酸乳膏来改善痘痘。"},{"en":"Azelaic products are often used to help with redness and dark spots.","zh":"含壬二酸的产品常用来改善泛红和色沉。"}]}],"synonyms":["nonanedioic (technical)"],"phonetic":"/əˈziːleɪɪk/","extraExplanation":["“Azelaic”通常出现在固定搭配“azelaic acid（壬二酸）”里，单独使用较少。壬二酸常见于皮肤科/护肤语境，常被用来帮助应对痤疮、酒糟鼻相关泛红，以及炎症后色素沉着（痘印）。不同国家/地区对其浓度与销售方式（处方/非处方）可能不同，使用时可参考医生或产品说明。"]}
{"word":"azelate","summary":{"en":"“Azelate” is a chemistry word meaning a salt or ester made from azelaic acid.","zh":"“Azelate”是化学用语，指由壬二酸形成的盐或酯（壬二酸盐/壬二酸酯）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a salt or ester of azelaic acid (a nine‑carbon dicarboxylic acid).","zh":"壬二酸（azelaic acid）形成的盐或酯；即“壬二酸盐/壬二酸酯”。"},"examples":[{"en":"In the lab, they prepared a diethyl azelate to study its physical properties.","zh":"在实验室里，他们制备了壬二酸二乙酯（diethyl azelate）来研究它的物理性质。"},{"en":"Some plasticizers are made from azelates because they can improve flexibility.","zh":"一些增塑剂由壬二酸盐/壬二酸酯制成，因为它们能提高材料的柔韧性。"}]}],"synonyms":["azelaic acid salt","azelaic acid ester"],"phonetic":"/ˈæzəˌleɪt/","extraExplanation":["“-ate”常见于化学命名，表示“某种酸的盐或酯”（例如 sulfate 硫酸盐/酯，nitrate 硝酸盐/酯）。因此 azelate 通常指“azelaic acid（壬二酸）”的盐或酯。","azelaic acid（壬二酸）在护肤领域也很常见（如用于痤疮、酒糟等的外用成分），但严格来说那叫 azelaic acid；“azelate”更常出现在化工/材料或有机合成语境里（如 diethyl azelate）。"]}
{"word":"Azelea","summary":{"en":"Azalea is a flowering shrub known for its bright, colorful blossoms, often seen in gardens.","zh":"Azalea 指杜鹃花（观赏灌木），以色彩鲜艳的花朵著称，常见于花园与绿化中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flowering shrub with bright, showy blossoms (often pink, red, white, or purple), commonly grown in gardens","zh":"杜鹃花（灌木）；一种开艳丽花朵的观赏植物（常见粉、红、白、紫等颜色）"},"examples":[{"en":"The azalea in our yard blooms every spring.","zh":"我们院子里的杜鹃花每年春天都会开花。"},{"en":"They planted azaleas along the walkway for color.","zh":"他们在人行道旁种了杜鹃花来增添色彩。"}]}],"synonyms":["flowering shrub","rhododendron (related)"],"phonetic":"/əˈzeɪliə/","extraExplanation":["你输入的“Azelea”更常见的标准拼写是“azalea”。","Azalea 常见于庭院与公园绿化；在美国南部（如乔治亚州等地）春季成片盛开很有代表性。","园艺语境里，azalea 常与 rhododendron（杜鹃属的“石楠杜鹃/杜鹃”）一起提及；日常英语里很多人把 azalea 当作一种常见的观赏杜鹃花来理解。"]}
{"word":"Azelfafage","summary":{"en":"“Azelfafage” is not recognized as a standard English word; it’s probably a misspelling or a made-up/proper name term.","zh":"“Azelfafage” 不是标准英语词；大概率是拼写错误或自造词/专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling, username, or invented term. If you share the sentence or where you saw it, I can help identify the intended word.","zh":"不是标准英语单词；更可能是拼写错误、用户名或自造词。如果你提供它出现的句子或来源，我可以帮你判断原本想表达的词。"},"examples":[{"en":"I searched dictionaries, but “Azelfafage” doesn’t appear to be an English word.","zh":"我查了词典，但 “Azelfafage” 似乎不是英语单词。"},{"en":"Can you give the full sentence where you found “Azelfafage”?","zh":"你能把包含 “Azelfafage” 的完整句子发给我吗？"}]}],"phonetic":"/ˌæzɛlˈfɑfɪdʒ/","extraExplanation":["这个词看起来像是把几个片段拼在一起（例如可能包含 “Azelf-” 之类的专有名词片段），也可能是把某个常见词（如 suffrage / sewage / sausage 等）打错了。最有效的办法是：把它出现的上下文（前后各一两句）、来源（书/游戏/网页/聊天）以及你想表达的意思发来，我可以据此推测正确拼写与含义。"]}
{"word":"azelfafage","summary":{"en":"“azelfafage” is not a standard English word; it’s likely a typo or a made-up term.","zh":"“azelfafage”不是标准英语单词；更可能是拼写错误或自造词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a recognized English word in standard dictionaries; it may be a misspelling, a username, or a made-up/fictional term.","zh":"不是标准英语词典中的词；可能是拼写错误、用户名，或自造/虚构词。"},"examples":[{"en":"I can’t find “azelfafage” in a dictionary—could it be a typo?","zh":"我在词典里找不到“azelfafage”——会不会是拼写错误？"},{"en":"If you tell me where you saw the word, I can guess the intended meaning.","zh":"如果你告诉我你在哪儿看到这个词，我可以帮你推测原本想表达的意思。"}]}],"phonetic":"/ˌæzəlˈfæfɪdʒ/","extraExplanation":["这个词看起来不像常见英语构词模式，可能是把某个词打错了。你可以把上下文句子贴出来，或告诉我是否来自游戏/小说/社交媒体。","如果你想查的是发音相近或拼写相近的词，我也可以按你的用途（比如写作、口语、考试）给出几个可能候选。"]}
{"word":"azeotrope","summary":{"en":"An azeotrope is a liquid mixture that boils at a constant temperature and can’t be fully separated by simple distillation because the vapor has the same composition as the liquid.","zh":"共沸物/共沸混合物是一种沸腾时温度恒定、气液组成相同的液体混合物，因此无法用简单蒸馏完全分离。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A mixture of two or more liquids that boils at a constant temperature and keeps the same composition in both the liquid and the vapor, so it cannot be fully separated by simple distillation.","zh":"（共沸物/共沸混合物）由两种或多种液体组成的混合物，在一定压力下会以恒定温度沸腾，且液相与气相组成相同，因此无法用简单蒸馏完全分离。"},"examples":[{"en":"Ethanol and water form an azeotrope, so you can’t get 100% ethanol by simple distillation.","zh":"乙醇和水会形成共沸混合物，所以用简单蒸馏无法得到 100% 的乙醇。"},{"en":"The lab report explained why an azeotrope makes purification harder.","zh":"实验报告解释了为什么共沸混合物会让纯化更困难。"}]}],"synonyms":["constant-boiling mixture"],"phonetic":"/eɪˈziː.ə.troʊp/","extraExplanation":["“azeotrope”常见于化学、化工与制药语境。很多学习者会把它理解成“沸点相同的混合物”，更准确的是：它在沸腾时，蒸气的组成和原液一样，因此蒸馏不会让组成继续改变。","常见例子是乙醇-水在常压下约 95.6% 乙醇（体积分数附近）的共沸点；工业上若要得到更高纯度，会用共沸蒸馏、加入干燥剂、分子筛等方法。","词源上 a- 表示“否/不”，zeo- 与“沸腾”相关，-trope 有“转变/变化”的含义；整体可理解为“沸腾时不改变（组成）的混合物”。"]}
{"word":"azeotropic","summary":{"en":"Azeotropic means a mixture that boils at a fixed point and can’t be separated by simple distillation because vapor and liquid have the same composition.","zh":"azeotropic 指“共沸的”：混合物以固定沸点沸腾且蒸气与液体组成相同，因此不能用简单蒸馏分离。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Describing a liquid mixture that boils at a constant temperature and keeps the same composition in the vapor and the liquid, so it cannot be separated into pure components by simple distillation.","zh":"（化学）指“共沸的”：一种液体混合物在沸腾时温度恒定，且蒸气与液体的组成相同，因此不能用简单蒸馏把各组分分离成纯物质。"},"examples":[{"en":"An azeotropic mixture of ethanol and water cannot be fully separated by simple distillation.","zh":"乙醇和水的共沸混合物无法用简单蒸馏完全分离。"},{"en":"This solvent forms an azeotropic blend, so we need a different purification method.","zh":"这种溶剂会形成共沸混合物，所以我们需要用别的纯化方法。"}]}],"synonyms":["constant-boiling","azeotrope-related"],"phonetic":"ˌeɪzi.oʊˈtrɑpɪk","extraExplanation":["“Azeotropic”来自“azeotrope（共沸物）”。在实验室和化工生产中，它常与“distillation（蒸馏）”一起出现：因为共沸现象会让蒸馏在某一比例处“卡住”，所以常改用共沸蒸馏（加入第三组分/夹带剂）、分子筛脱水、萃取等方法。","常见例子（因压力不同而略有变化）：乙醇-水在常压下约95.6%乙醇处形成共沸；盐酸-水也会形成共沸组成。"]}
{"word":"azeotropism","summary":{"en":"Azeotropism is the tendency of a liquid mixture to form an azeotrope, making it boil at a constant composition and hard to separate by simple distillation.","zh":"Azeotropism 指混合液形成共沸物的共沸性/共沸现象，导致沸腾时组成恒定，从而难以用简单蒸馏分离。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) The behavior or condition of forming an azeotrope— a mixture of liquids that boils at a constant temperature and keeps the same composition in both liquid and vapor, so it cannot be fully separated by simple distillation.","zh":"（化学）共沸现象/共沸性：指液体混合物形成“共沸物（azeotrope）”的性质或状态——在某一固定温度下沸腾，气相与液相组成相同，因此用简单蒸馏无法把各组分完全分离。"},"examples":[{"en":"Ethanol and water show azeotropism, so ordinary distillation cannot produce 100% ethanol.","zh":"乙醇和水会发生共沸现象，所以普通蒸馏无法得到 100% 的乙醇。"},{"en":"To overcome azeotropism, the lab used a drying agent and a different separation method.","zh":"为了克服共沸性，实验室使用了干燥剂并改用其他分离方法。"}]}],"synonyms":["azeotropy","azeotropic behavior"],"phonetic":"/əˈziː.əˌtroʊ.pɪz.əm/","extraExplanation":["“azeotropism”来自“azeotrope（共沸物）”。日常与教材中更常见的说法是“azeotropy（共沸性/共沸现象）”。","共沸的关键点：混合物在共沸点时蒸气组成=液体组成，因此反复蒸馏也不会继续富集某一组分。工业上常用共沸蒸馏、加萃取剂（entrainer）、膜分离或化学干燥等方法来处理。"]}
{"word":"azeotropy","summary":{"en":"Azeotropy is when a liquid mixture boils at a constant temperature and composition, making it difficult to separate by simple distillation.","zh":"共沸性指混合液在恒定温度与恒定组成下沸腾，导致难以用简单蒸馏分离。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the property of a liquid mixture to boil at a constant temperature with a fixed composition, so the vapor has the same composition as the liquid (making the mixture hard to separate by ordinary distillation)","zh":"（化学）共沸性；指液体混合物在沸腾时以恒定温度、恒定组成蒸发，且蒸气与液体组成相同，因此难以用普通蒸馏分离"},"examples":[{"en":"Because of azeotropy, ethanol and water cannot be completely separated by simple distillation.","zh":"由于共沸性，乙醇和水无法通过简单蒸馏被完全分离。"},{"en":"The lab used a different method to break the azeotropy and obtain a purer solvent.","zh":"实验室采用了其他方法来打破共沸，以获得更纯的溶剂。"}]}],"synonyms":["constant-boiling behavior","azeotropic behavior"],"phonetic":"ˌeɪziˈɑtrəpi","extraExplanation":["“Azeotropy / azeotrope（共沸）”常见于化工与有机实验中：例如乙醇-水在常压下会形成共沸混合物，所以市售“95%酒精”常与此有关。要进一步提高纯度，往往需要改变压力（减压/加压蒸馏）、加入带水剂（如分子筛）、或采用萃取/共沸蒸馏等手段。","词源上，“azeo-”来自希腊语，带有“不可沸腾改变”的含义，强调其沸腾时组成不再变化这一关键特征。"]}
{"word":"Azerbaidzhan","summary":{"en":"Azerbaidzhan is an uncommon spelling of Azerbaijan, a country on the Caspian Sea in the South Caucasus.","zh":"Azerbaidzhan 是 Azerbaijan（阿塞拜疆）的不常见拼写，指里海沿岸南高加索地区的一个国家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Less common spelling of) Azerbaijan, a country in the South Caucasus region, located between Eastern Europe and Western Asia, on the Caspian Sea.","zh":"（较少见的拼写）Azerbaijan（阿塞拜疆），位于南高加索、介于东欧与西亚之间、濒临里海的国家。"},"examples":[{"en":"Azerbaidzhan is more often spelled Azerbaijan in modern English.","zh":"在现代英语中，Azerbaidzhan 更常写作 Azerbaijan。"},{"en":"Baku is the capital city of Azerbaijan (Azerbaidzhan).","zh":"巴库是阿塞拜疆（Azerbaidzhan/Azerbaijan）的首都。"}]}],"synonyms":["Azerbaijan"],"phonetic":"/ˌɑːzərbaɪˈdʒɑːn/","extraExplanation":["“Azerbaidzhan”多见于较早或受俄语/法语转写影响的拼法：俄语“Азербайджан”常被转写成带“dzh”的形式，用来表示英语里类似 /dʒ/（j 的音）。现代英语标准拼写通常是“Azerbaijan”。","在正式写作（新闻、学术、护照/地图等）中建议使用“Azerbaijan”。对应的形容词/国籍是“Azerbaijani”（阿塞拜疆的；阿塞拜疆人）。"]}
{"word":"Azerbaijan","summary":{"en":"A country in the South Caucasus; capital: Baku.","zh":"南高加索国家；首都：巴库。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A country in the South Caucasus, located between Eastern Europe and Western Asia, on the western shore of the Caspian Sea. Its capital is Baku.","zh":"阿塞拜疆（国家）：位于南高加索地区，介于东欧与西亚之间，濒临里海西岸。首都是巴库。"},"examples":[{"en":"Azerbaijan is famous for its oil and gas industry.","zh":"阿塞拜疆以石油和天然气产业闻名。"},{"en":"She traveled to Azerbaijan for a conference in Baku.","zh":"她去阿塞拜疆的巴库参加会议。"}]}],"synonyms":["Republic of Azerbaijan"],"phonetic":"/ˌɑːzərbaɪˈdʒɑːn/","extraExplanation":["“Azerbaijan”是国家名，英语里一般不可加冠词（不说 *the Azerbaijan*）。但如果说“阿塞拜疆的政府/经济”等，可以用“the government/economy of Azerbaijan”。","形容词和国民称呼通常用 **Azerbaijani**（阿塞拜疆的；阿塞拜疆人/语言），例如：Azerbaijani culture / an Azerbaijani speaker。","地理上它属于“South Caucasus（南高加索）”地区，常与邻国 Georgia（格鲁吉亚）和 Armenia（亚美尼亚）一起出现于新闻与历史语境中。"]}
{"word":"Azerbaijanese","summary":{"en":"Azerbaijanese means “from Azerbaijan” or “a person from Azerbaijan,” but “Azerbaijani” is more common in modern English.","zh":"Azerbaijanese 指“阿塞拜疆的/阿塞拜疆人”，但现代英语中更常用 Azerbaijani。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Azerbaijan or its people, language, or culture; Azerbaijani.","zh":"与阿塞拜疆或其人民、语言、文化有关的；阿塞拜疆的（亦作 Azerbaijani）。"},"examples":[{"en":"Azerbaijanese cuisine often features rice, herbs, and grilled meats.","zh":"阿塞拜疆菜常见米饭、香草和烤肉。"},{"en":"She is studying Azerbaijanese history and culture.","zh":"她在学习阿塞拜疆的历史与文化。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Azerbaijan; an Azerbaijani.","zh":"阿塞拜疆人；阿塞拜疆的居民（亦作 Azerbaijani）。"},"examples":[{"en":"Many Azerbaijanese live in Baku, the capital city.","zh":"许多阿塞拜疆人住在首都巴库。"},{"en":"He met an Azerbaijanese student at the conference.","zh":"他在会议上遇到了一位阿塞拜疆学生。"}]}],"synonyms":["Azerbaijani","from Azerbaijan"],"phonetic":"/ˌæzɚˌbaɪdʒɑːnˈiːz/","extraExplanation":["“Azerbaijanese”在英语里能用，但现代英文更常用、更标准的说法是“Azerbaijani”（既可作形容词也可作名词）。在写作或正式场合，通常建议用“Azerbaijani”。","“Azerbaijanese”有时会被理解为“来自阿塞拜疆的（人）”，但在学术、新闻与外交语境中，“Azerbaijani”出现频率更高。"]}
{"word":"azerbaijanese","summary":{"en":"“Azerbaijanese” is an uncommon word; standard English uses “Azerbaijani” for the people, language, and anything related to Azerbaijan.","zh":"“Azerbaijanese” 不常用；标准英语通常用 “Azerbaijani” 来指阿塞拜疆的人民、语言及相关事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon) relating to Azerbaijan, its people, language, or culture. In modern English, “Azerbaijani” is the standard word.","zh":"（不常用）与阿塞拜疆及其人民、语言或文化有关的。现代英语更常用、更标准的说法是 “Azerbaijani”。"},"examples":[{"en":"Azerbaijani (not “Azerbaijanese”) is the usual adjective in English.","zh":"英语里通常用 “Azerbaijani”（而不是 “Azerbaijanese”）作形容词。"},{"en":"She’s studying Azerbaijani music and culture.","zh":"她在学习阿塞拜疆的音乐和文化。"}]},{"partOfSpeech":"n.","definition":{"en":"(Uncommon) a person from Azerbaijan. “An Azerbaijani” is the more standard form.","zh":"（不常用）阿塞拜疆人。更标准的说法是 “an Azerbaijani”。"},"examples":[{"en":"He is an Azerbaijani living in the U.S.","zh":"他是一位住在美国的阿塞拜疆人。"},{"en":"Many Azerbaijanis speak Azerbaijani and Russian.","zh":"许多阿塞拜疆人会说阿塞拜疆语和俄语。"}]}],"synonyms":["Azerbaijani","Azeri"],"phonetic":"ˌɑːzərbaɪˈdʒɑːniːz","extraExplanation":["“Azerbaijanese” 在英语里很少见，日常写作与新闻、学术语境一般用 “Azerbaijani”。\n\n“Azəri / Azeri” 有时也被用作简称，但在正式场合更建议用 “Azerbaijani”。\n\n注意区分：Azerbaijani（语言/形容词/民族称谓） vs. Azerbaijan (国家名)。例如：Azerbaijani language（阿塞拜疆语），the Republic of Azerbaijan（阿塞拜疆共和国）。"]}
{"word":"Azerbaijani","summary":{"en":"Azerbaijani means “from Azerbaijan,” and it can refer to an Azerbaijani person or the Azerbaijani language.","zh":"Azerbaijani 表示“阿塞拜疆的”，也可指“阿塞拜疆人”或“阿塞拜疆语”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Azerbaijan, its people, or its culture.","zh":"（形容词）与阿塞拜疆、阿塞拜疆人或其文化有关的。"},"examples":[{"en":"Azerbaijani music often features traditional instruments like the tar.","zh":"阿塞拜疆音乐常常会用到塔尔琴等传统乐器。"},{"en":"She studies Azerbaijani history at university.","zh":"她在大学学习阿塞拜疆历史。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Azerbaijan.","zh":"（名词）阿塞拜疆人。"},"examples":[{"en":"Many Azerbaijanis speak Azerbaijani and also Russian or English.","zh":"许多阿塞拜疆人会说阿塞拜疆语，也可能会说俄语或英语。"},{"en":"An Azerbaijani told us about local customs in Baku.","zh":"一位阿塞拜疆人给我们介绍了巴库的当地习俗。"}]},{"partOfSpeech":"n.","definition":{"en":"the official language of Azerbaijan (also called Azerbaijani Turkic or Azeri).","zh":"（名词）阿塞拜疆的官方语言（也称 Azerbaijani Turkic 或 Azeri，即“阿塞拜疆语/阿塞里语”）。"},"examples":[{"en":"I can read a little Azerbaijani, but I can’t speak it fluently yet.","zh":"我能读一点阿塞拜疆语，但还不能流利地说。"},{"en":"The sign is written in Azerbaijani and English.","zh":"标牌用阿塞拜疆语和英语写成。"}]}],"synonyms":["Azeri"],"phonetic":"/ˌɑːzərbaɪˈdʒɑːni/","extraExplanation":["“Azerbaijani”在英文里既可指“阿塞拜疆的/阿塞拜疆人”，也常指“阿塞拜疆语”。在日常交流中，你也会看到“**Azeri**”这个较短的说法，但在正式场合（新闻、学术、政府文件）“Azerbaijani”更常用、更稳妥。","拼写提示：Azerbaijani 里常见的难点是结尾 **-ijani**。发音重音通常落在最后一部分（-JAH-）。"]}
{"word":"azerbaijani","summary":{"en":"Azerbaijani means “from Azerbaijan” and can refer to the people or the language.","zh":"Azerbaijani 意为“阿塞拜疆的”，也可指阿塞拜疆人或阿塞拜疆语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Azerbaijan, its people, or its culture","zh":"与阿塞拜疆、阿塞拜疆人民或其文化有关的"},"examples":[{"en":"Azerbaijani music often features instruments like the tar and kamancha.","zh":"阿塞拜疆音乐常使用塔尔琴（tar）和卡曼恰（kamancha）等乐器。"},{"en":"We tried Azerbaijani cuisine, including plov and dolma.","zh":"我们品尝了阿塞拜疆菜，包括抓饭（plov）和多尔玛（dolma）。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Azerbaijan; an Azerbaijani citizen","zh":"阿塞拜疆人；阿塞拜疆公民"},"examples":[{"en":"She is an Azerbaijani living in the United States.","zh":"她是一位住在美国的阿塞拜疆人。"},{"en":"Many Azerbaijanis speak more than one language.","zh":"许多阿塞拜疆人会说不止一种语言。"}]},{"partOfSpeech":"n.","definition":{"en":"the official language of Azerbaijan (Azerbaijani/Azeri), a Turkic language","zh":"阿塞拜疆语（Azerbaijani/Azeri），阿塞拜疆的官方语言，属突厥语族"},"examples":[{"en":"He is learning Azerbaijani to talk with his relatives.","zh":"他在学阿塞拜疆语，以便和亲戚交流。"},{"en":"This book is written in Azerbaijani.","zh":"这本书是用阿塞拜疆语写的。"}]}],"synonyms":["Azeri"],"phonetic":"/ˌɑːzərbaɪˈdʒɑːni/","extraExplanation":["“Azerbaijani”在英语里通常既可作形容词（Azerbaijani food/culture）也可作名词，名词既能指“阿塞拜疆人”，也能指“阿塞拜疆语”。","“Azeri”也常见，有时更口语化；在正式写作中用“Azerbaijani”更稳妥、更中性。","作为国籍/民族/语言名称，通常首字母大写：Azerbaijani。"]}
{"word":"Azerbaijanian","summary":{"en":"Azerbaijanian means “from Azerbaijan” or “a person from Azerbaijan,” but “Azerbaijani” is more common in modern English.","zh":"Azerbaijanian 指“阿塞拜疆的/来自阿塞拜疆的”或“阿塞拜疆人”，但现代英语中更常用 Azerbaijani。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Azerbaijan, its people, or its culture","zh":"（与）阿塞拜疆及其人民、文化有关的；阿塞拜疆的"},"examples":[{"en":"Azerbaijanian music often features the string instrument called the tar.","zh":"阿塞拜疆的音乐常常会使用一种叫作 tar（塔尔琴）的弦乐器。"},{"en":"We tried several Azerbaijanian dishes at the festival.","zh":"我们在节庆活动上尝了几道阿塞拜疆菜。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Azerbaijan","zh":"阿塞拜疆人"},"examples":[{"en":"She is an Azerbaijanian living in Chicago.","zh":"她是一位住在芝加哥的阿塞拜疆人。"}]}],"synonyms":["Azerbaijani"],"phonetic":"/ˌɑːzərbaɪˈdʒɑːni/","extraExplanation":["“Azerbaijanian”在英语里能用，但更常见、更标准的拼写是“**Azerbaijani**”（既可作形容词，也可指“阿塞拜疆人/阿塞拜疆语”）。在新闻、学术写作和日常表达中通常优先用“Azerbaijani”。","如果你要表达“阿塞拜疆语”，英语里最常说“**the Azerbaijani language**”或直接“**Azerbaijani**”。"]}
{"word":"azerbaijanian","summary":{"en":"A less common spelling of “Azerbaijani,” meaning ‘from Azerbaijan’ or ‘a person from Azerbaijan.’","zh":"“Azerbaijani”的较少见拼写，指“阿塞拜疆的”或“阿塞拜疆人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Azerbaijan or to the Azerbaijani people, language, or culture (a less common variant spelling of “Azerbaijani”).","zh":"阿塞拜疆的；阿塞拜疆人/阿塞拜疆语/阿塞拜疆文化的（较少见的拼写形式，常见写法为 “Azerbaijani”）。"},"examples":[{"en":"Azerbaijanian cuisine often includes dishes like plov and dolma.","zh":"阿塞拜疆菜常见的有抓饭（plov）和葡萄叶包肉（dolma）等。"},{"en":"She is studying Azerbaijanian music traditions for her project.","zh":"她正在为项目研究阿塞拜疆的音乐传统。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Azerbaijan; an Azerbaijani person (less common spelling).","zh":"阿塞拜疆人；阿塞拜疆籍人士（较少见的拼写）。"},"examples":[{"en":"Several Azerbaijanians attended the cultural festival in our city.","zh":"有几位阿塞拜疆人参加了我们城市的文化节。"},{"en":"He met an Azerbaijanian who spoke both Azerbaijani and Russian.","zh":"他遇到一位阿塞拜疆人，会说阿塞拜疆语和俄语。"}]}],"synonyms":["Azerbaijani"],"phonetic":"/ˌɑːzərbaɪˈdʒɑːni/","extraExplanation":["“Azerbaijanian”在英语里能理解，但在新闻、学术与官方语境中更常用、也更推荐的拼写是 “Azerbaijani”。","注意区分：Azerbaijani 既可指“阿塞拜疆人”，也常指“阿塞拜疆语”（语言名），而不是 “Azerbaijanian language”。"]}
{"word":"Azerbaijanis","summary":{"en":"Azerbaijanis are people from Azerbaijan or belonging to the Azerbaijani ethnic group.","zh":"Azerbaijanis 指阿塞拜疆人，既可指来自阿塞拜疆的人，也可指阿塞拜疆族群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people from Azerbaijan, or an ethnic group native to the region (also called Azerbaijanis)","zh":"阿塞拜疆人；来自阿塞拜疆的人，或该地区的一个民族（也可指“阿塞拜疆族”）"},"examples":[{"en":"Many Azerbaijanis speak Azerbaijani as their first language.","zh":"许多阿塞拜疆人以阿塞拜疆语为母语。"},{"en":"Azerbaijanis live both in Azerbaijan and in neighboring countries.","zh":"阿塞拜疆人不仅生活在阿塞拜疆，也生活在周边国家。"}]}],"synonyms":["Azerbaijani people","ethnic Azerbaijanis"],"phonetic":"/ˌɑːzərbaɪˈdʒɑːniz/","extraExplanation":["“Azerbaijanis”是复数名词；单数是“Azerbaijani”。在英语中，表示国籍/民族的人群名词有时可作复数（Azerbaijanis），有时也可作形容词（Azerbaijani food 阿塞拜疆食物）。","在不同语境中，“Azerbaijani”既可指国籍（阿塞拜疆公民），也可指民族/族群；为了更精确，可以说“the Azerbaijani people”（阿塞拜疆人民）或“ethnic Azerbaijanis”（阿塞拜疆族/阿塞拜疆族裔）。"]}
{"word":"Azeria","summary":{"en":"“Azeria” is a rare proper name, often used as a nonstandard variant for Azerbaijan/Azeri-related terms or as a fictional name.","zh":"“Azeria”较少见，常被当作与阿塞拜疆/阿塞拜疆人相关词的非标准写法，或作为虚构作品中的名字。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare/unclear proper name. In many contexts it is used as a variant spelling (or misspelling) referring to Azerbaijan or to something related to the Azeri/Azerbaijani people.","zh":"一个较少见、含义不够固定的专有名词。在不少语境中，它被当作“Azerbaijan（阿塞拜疆）”或“Azeri/Azerbaijani（阿塞拜疆的/阿塞拜疆人）”相关的变体拼写或误拼。"},"examples":[{"en":"Some online posts use “Azeria” when they actually mean Azerbaijan.","zh":"一些网络帖子用“Azeria”，但其实想表达的是“Azerbaijan（阿塞拜疆）”。"},{"en":"The character name “Azeria” appears in a few games and stories, but its meaning depends on the specific work.","zh":"“Azeria”作为角色名出现在一些游戏和故事里，但具体含义取决于作品设定。"}]}],"synonyms":["Azerbaijan","Azerbaijani","Azeri"],"phonetic":"/əˈzɪəriə/","extraExplanation":["“Azeria”不是现代英语里常见、标准的地名或民族名。更常见的相关词是：Azerbaijan（国家名，阿塞拜疆）、Azeri/Azerbaijani（民族/语言/形容词：阿塞拜疆人；阿塞拜疆语；阿塞拜疆的）。","如果你是在写作或正式场合想表达国家或民族，通常建议用“Azerbaijan / Azerbaijani / Azeri”，避免“Azeria”造成读者困惑。你也可以告诉我你看到“Azeria”的句子/出处，我可以帮你判断它在那里的具体意思。"]}
{"word":"Azha","summary":{"en":"Azha is most commonly used as a person’s name or a romanized form of a name from another language.","zh":"Azha 最常见的用法是人名，或来自其他语言姓名的拉丁字母拼写形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a personal name (given name or nickname), used in different cultures; it may also be a romanization of names written in other scripts (for example, 阿扎 in Chinese).","zh":"人名（名或昵称）；也可能是把其他文字体系中的名字用拉丁字母拼写出来的形式（例如中文里的“阿扎”）。"},"examples":[{"en":"Azha is my friend from school.","zh":"Azha 是我在学校的朋友。"},{"en":"How do you spell Azha?","zh":"Azha 怎么拼写？"},{"en":"Azha can be written differently depending on the language.","zh":"根据不同语言，Azha 可能有不同的写法。"}]}],"synonyms":["(no direct synonym; it is a name)"],"phonetic":"ˈɑːʒɑː","extraExplanation":["“Azha”不是一个固定、全球通用的英语词汇，更常见的是作为姓名/昵称出现。不同地区对它的读音与来源可能不同；如果你告诉我它来自哪种语言或你看到它的上下文（例如一段句子、国家/地区、人物/作品名），我可以给出更准确的含义和用法。"]}
{"word":"azha","summary":{"en":"Azha is usually a name/nickname (often a transliteration), not a standard English word.","zh":"Azha 通常是人名/昵称（常为音译），不是标准英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A personal name or nickname used in different languages and communities; it is not a standard English vocabulary word, so its meaning depends on the cultural/linguistic background (e.g., a transliteration).","zh":"人名或昵称，可见于不同语言与社群；它不是标准英语词汇，因此具体含义取决于其文化/语言背景（常见为音译）。"},"examples":[{"en":"Azha is a nickname my friend uses online.","zh":"Azha 是我朋友在网上用的昵称。"},{"en":"I’m not sure how to pronounce Azha—could you tell me which language it comes from?","zh":"我不确定 Azha 怎么读——你能告诉我它来自哪种语言吗？"}]}],"synonyms":["(no direct synonyms; depends on origin)"],"phonetic":"/ˈɑːʒə/","extraExplanation":["“Azha”在英语里通常不会作为词典词条出现，更常见的情况是：1）人名/昵称；2）从其他语言音译到拉丁字母的拼写（例如中文拼音对应的音译名）。如果你能告诉我它出现的语境（人名？游戏ID？歌词？还是某种语言里的词？），我可以给出更准确的发音、含义和用法。"]}
{"word":"Azide","summary":{"en":"An azide is a chemical compound or ion (N₃⁻) used in chemistry; some azides can be hazardous or explosive.","zh":"Azide 指叠氮化物或叠氮根（N₃⁻），常见于化学领域；部分叠氮化物具有危险性或爆炸性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (or the azide ion, N₃⁻) related to hydrazoic acid; many azides are used in chemistry and some can be explosive.","zh":"叠氮化物；（也指）叠氮根 N₃⁻。与叠氮酸相关的一类化合物，常用于化学实验与工业中，其中一些具有爆炸性。"},"examples":[{"en":"Sodium azide is commonly used in laboratories, but it must be handled carefully.","zh":"叠氮化钠在实验室中很常见，但必须小心操作。"},{"en":"In this reaction, the azide ion acts as a nucleophile.","zh":"在这个反应中，叠氮根作为亲核试剂起作用。"},{"en":"Some azides can decompose rapidly and release gas.","zh":"一些叠氮化物会快速分解并释放气体。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing something that contains an azide group (—N₃) or involves azides.","zh":"（化学）叠氮的；含有叠氮基（—N₃）或与叠氮化物有关的。"},"examples":[{"en":"They synthesized an azide compound for further testing.","zh":"他们合成了一种叠氮化合物用于进一步测试。"},{"en":"The azide reagent was added slowly under cooling.","zh":"叠氮试剂在冷却条件下被缓慢加入。"}]}],"synonyms":["azide ion","N3-"],"phonetic":"/ˈæ.zaɪd/","extraExplanation":["词源提示：azide 来自法语 azote（“氮”）相关构词；在化学语境里通常与“含氮的叠氮基 —N₃”联系在一起。","安全提示（学习用常识）：一些叠氮化物具有毒性或爆炸风险；在真实实验或工业场景中应遵循专业的安全规范与指导。"]}
{"word":"azide","summary":{"en":"An azide is a compound containing the N₃⁻ group, widely used in chemistry and sometimes hazardous.","zh":"Azide 指含 N₃⁻ 叠氮基的化合物，常用于化学中，但有时具有危险性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound that contains the azide group (N₃⁻), often used in laboratories and some industrial products (some azides can be explosive or highly toxic).","zh":"叠氮化物（含叠氮基 N₃⁻ 的化合物），常用于实验室和部分工业产品（某些叠氮化物可能具有爆炸性或高毒性）。"},"examples":[{"en":"Sodium azide is used in some chemical reactions as a source of the azide group.","zh":"叠氮化钠在一些化学反应中用作提供叠氮基的来源。"},{"en":"The lab stored azide solutions in clearly labeled containers for safety.","zh":"实验室为安全起见，将叠氮化物溶液存放在清晰标注的容器中。"},{"en":"Because some azides are unstable, they must be handled with great care.","zh":"由于某些叠氮化物不稳定，必须非常小心地处理。"}]}],"synonyms":["azide compound","N3− compound","sodium azide (common example)"],"phonetic":"/ˈæzaɪd/","extraExplanation":["“azide”来自“azo-”（与氮有关）+ “-ide”（表示阴离子或化合物的后缀），常指含 N₃⁻ 的盐或有机叠氮化合物。","在化学安全语境中常会特别提醒：部分叠氮化物（尤其是重金属叠氮化物）可能对震动、摩擦或受热敏感，存在爆炸风险；叠氮化钠也具有毒性。学习或工作中看到该词时，通常与实验室安全规范一起出现。","常见相关词：azide group（叠氮基）、organic azide（有机叠氮化物）、sodium azide（叠氮化钠）。"]}
{"word":"azides","summary":{"en":"Azides are compounds that contain the azide group (N3−).","zh":"Azides 指含有叠氮基（N3−）的化合物（叠氮化物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of azide: chemical compounds or ions containing the azide group (N₃⁻), often used in labs and industry (some are reactive or explosive).","zh":"azide（叠氮化物）的复数：含有叠氮基（N₃⁻）的化合物或离子，常用于实验室与工业（有些反应性强或具有爆炸性）。"},"examples":[{"en":"Some azides are used to make airbags inflate quickly.","zh":"一些叠氮化物被用来让安全气囊快速充气。"},{"en":"In the lab, we store azides carefully and label them clearly.","zh":"在实验室里，我们会谨慎保存叠氮化物并清楚标示。"}]}],"synonyms":["azide compounds","azide salts"],"phonetic":"/ˈæ.zaɪdz/","extraExplanation":["“azide/azides”属于化学词汇，常见于无机化学与材料/药物相关文献。常见例子有 sodium azide（叠氮化钠）与 organic azides（有机叠氮化物）。部分叠氮化物对热、摩擦或冲击较敏感，实际操作应遵循安全规范。"]}
{"word":"azido","summary":{"en":"Azido means “containing an azide (–N₃) group,” commonly used in chemical names.","zh":"Azido 指“含有叠氮基（–N₃）”，常用于化学命名中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Containing an azide group (–N₃), or relating to azides; used especially in chemical names.","zh":"（化学）含有叠氮基（–N₃）的；与叠氮化物有关的；常用于化学命名中。"},"examples":[{"en":"Azido groups are often used in “click chemistry” to connect molecules quickly.","zh":"叠氮基常用于“点击化学”，用来快速连接分子。"},{"en":"The lab used an azido compound to label the protein for imaging.","zh":"实验室使用一种含叠氮基的化合物给蛋白质做标记以便成像。"},{"en":"In the name “azidomethane,” “azido-” shows the molecule contains an –N₃ group.","zh":"在“azidomethane（叠氮甲烷）”这个名称中，“azido-”表示该分子含有–N₃基团。"}]},{"partOfSpeech":"other","definition":{"en":"A prefix in chemical terminology meaning “azide/–N₃ substituent.”","zh":"（化学术语中的）前缀，表示“叠氮/–N₃取代基”。"},"examples":[{"en":"You may see “azido-” in names like azidoethyl or azidobenzene.","zh":"你可能会在如 azidoethyl（叠氮乙基）或 azidobenzene（叠氮苯）这样的名称中看到“azido-”。"}]}],"synonyms":["azide (adj.)"],"phonetic":"əˈzaɪdoʊ","extraExplanation":["“Azido”多见于化学与生物化学语境，尤其是材料科学、药物化学和生物标记。许多叠氮化合物具有潜在危险性（如受热、受冲击可能分解），在实验室需要严格按安全规范操作。"]}
{"word":"aziethane","summary":{"en":"“aziethane” isn’t a recognized English word; it likely needs confirmation of spelling or context.","zh":"“aziethane”不是常见/规范英语词；需要确认拼写或语境才能判断含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it may be a misspelling, a username, or a made-up/brand name. Please provide the context or the intended spelling.","zh":"不是标准英语单词；可能是拼写错误、用户名，或自造/品牌名称。请提供使用语境或你想查的正确拼写。"},"examples":[{"en":"I couldn’t find “aziethane” in a dictionary—where did you see it?","zh":"我在词典里找不到“aziethane”——你是在哪里看到它的？"},{"en":"If you meant a chemical name, please share the full sentence or the source.","zh":"如果你指的是化学名称，请把完整句子或出处发我。"}]}],"extraExplanation":["“aziethane”看起来像把两个部分拼在一起的词（例如类似 *-ethane* 这种化学命名后缀），但它并不是常见或规范的英语词条。","你可能想写的是：\n- **azithromycin**（阿奇霉素，药名）\n- **ethane**（乙烷，化学名词）\n- 或其他以 **-ethane** 结尾的化合物名称\n把你看到它的句子贴出来，我可以根据语境判断最可能的词。"]}
{"word":"Azikiwe","summary":{"en":"Azikiwe usually refers to Nnamdi Azikiwe, Nigeria’s first President, or to people/places named after him.","zh":"Azikiwe通常指尼日利亚第一任总统恩纳姆迪·阿齐基韦，或指以他命名的人与机构/地点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Nnamdi Azikiwe (1904–1996), a Nigerian nationalist leader, writer, and politician; the first President of Nigeria (1963–1966). He is often called “Zik.”","zh":"恩纳姆迪·阿齐基韦（1904–1996），尼日利亚民族主义领袖、作家与政治家；尼日利亚第一任总统（1963–1966）。常被称为“Zik（齐克）”。"},"examples":[{"en":"Azikiwe is remembered as a key figure in Nigeria’s independence movement.","zh":"阿齐基韦被视为尼日利亚独立运动中的关键人物。"},{"en":"In history class, we learned that Azikiwe helped shape modern Nigerian politics through journalism and public speeches.","zh":"在历史课上，我们学习到阿齐基韦通过新闻工作和公开演讲影响了现代尼日利亚政治。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname that may refer to people, institutions, or places named after Nnamdi Azikiwe (for example, Nnamdi Azikiwe University or Nnamdi Azikiwe International Airport).","zh":"阿齐基韦（Azikiwe）这一姓氏也常用来指以恩纳姆迪·阿齐基韦命名的人、机构或地点（如阿齐基韦大学、阿齐基韦国际机场）。"},"examples":[{"en":"My flight arrives at the Azikiwe International Airport in Abuja.","zh":"我的航班抵达阿布贾的阿齐基韦国际机场。"},{"en":"She studied political science at Nnamdi Azikiwe University.","zh":"她在阿齐基韦大学学习政治学。"}]}],"synonyms":["Nnamdi Azikiwe","Zik"],"phonetic":"/əˈziːkweɪ/","extraExplanation":["在英语语境里，Azikiwe多作为专有名词出现，通常不加冠词；指具体的人名或以他命名的机构/地点。","他通过创办和经营报纸推动民族意识，因此在一些资料中也会被称为“journalist（新闻人）”或“statesman（政治家）”。在尼日利亚文化与政治史讨论中，这是一个辨识度很高的名字。"]}
{"word":"Azilian","summary":{"en":"Azilian refers to a late Ice Age prehistoric culture of western Europe, or to things connected with it.","zh":"Azilian 指西欧晚冰期的一种史前文化（阿济利文化），也可指与之相关的事物或人群。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Azilian culture, a prehistoric (late Ice Age) culture of western Europe","zh":"阿济利文化的；与阿济利文化有关的（西欧晚冰期/旧石器时代末期的史前文化）"},"examples":[{"en":"Archaeologists found Azilian-style painted pebbles in a cave in southern France.","zh":"考古学家在法国南部的一处洞穴中发现了阿济利文化风格的彩绘卵石。"},{"en":"The site shows a transition from Magdalenian to Azilian tools.","zh":"该遗址显示出从马格德林文化到阿济利文化工具的过渡。"}]},{"partOfSpeech":"n.","definition":{"en":"the Azilian culture or the people associated with it","zh":"阿济利文化；阿济利人（指与该文化相关的人群）"},"examples":[{"en":"The Azilian is often discussed as a bridge between the Paleolithic and the Mesolithic in parts of Europe.","zh":"在欧洲部分地区，阿济利文化常被视为连接旧石器时代与中石器时代的桥梁。"},{"en":"Researchers compare the Azilian with neighboring traditions to understand regional change.","zh":"研究者把阿济利文化与周边传统进行比较，以理解区域变化。"}]}],"synonyms":["Azilian culture","Epipaleolithic (context)"],"phonetic":"/əˈzɪliən/","extraExplanation":["“Azilian”一词来自法国比利牛斯地区的洞穴遗址 Mas d’Azil（阿济勒洞穴），因此常译作“阿济利（文化）”。","阿济利文化大致处于冰期结束前后，以小型燧石器（microliths）与彩绘卵石等遗物而较知名；在入门阅读中常与更早的 Magdalenian（马格德林文化）对比出现。"]}
{"word":"azilian","summary":{"en":"“Brazilian” means a person from Brazil or something related to Brazil.","zh":"“Brazilian”指巴西人，或与巴西有关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person from Brazil, or someone of Brazilian nationality.","zh":"巴西人；巴西国籍的人。"},"examples":[{"en":"She is a Brazilian who moved to California for work.","zh":"她是巴西人，为了工作搬到了加州。"},{"en":"Many Brazilians speak Portuguese as their first language.","zh":"许多巴西人以葡萄牙语为母语。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to Brazil, its people, language, or culture.","zh":"巴西的；与巴西、巴西人、语言或文化有关的。"},"examples":[{"en":"Brazilian coffee is popular around the world.","zh":"巴西咖啡在世界各地都很受欢迎。"},{"en":"They cooked a Brazilian-style barbecue for the party.","zh":"他们为聚会做了巴西风味的烧烤。"}]}],"synonyms":["from Brazil","Brazil (adj. use in some contexts)"],"phonetic":"/brəˈzɪliən/","extraExplanation":["你输入的“azilian”通常是把“Brazilian”（巴西的/巴西人）拼错了，正确拼写是 **Brazilian**（B-r-a-z-i-l-i-a-n）。","发音上要注意中间的 **-zil-** 音节（/zɪl/），很多拼写错误来自漏掉开头的 **Br-** 或把 **z** 写错。"]}
{"word":"Azilian-tardenoisian","summary":{"en":"Azilian-tardenoisian refers to the Azilian and Tardenoisian prehistoric traditions in western Europe, often mentioned together in archaeology.","zh":"Azilian-tardenoisian 指西欧史前的阿兹利文化与塔德努瓦文化两种考古传统，常在考古学中合称或并列讨论。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Azilian and Tardenoisian archaeological traditions (late Upper Paleolithic to Mesolithic) in western Europe, often discussed together when describing post–Ice Age hunter-gatherer cultures and their tools/art.","zh":"与西欧旧石器时代晚期至中石器时代的阿兹利文化（Azilian）与塔德努瓦文化（Tardenoisian）两种考古传统有关的；常用于合称或并列讨论冰期后狩猎采集人群及其工具/艺术。"},"examples":[{"en":"The paper compares Azilian-tardenoisian stone tools from northern France and Belgium.","zh":"这篇论文比较了法国北部与比利时的阿兹利—塔德努瓦石器工具。"},{"en":"Some museums label the layer as Azilian-tardenoisian to show a transitional period after the Ice Age.","zh":"有些博物馆把该地层标注为“阿兹利—塔德努瓦”，以强调冰期后过渡阶段。"}]},{"partOfSpeech":"n.","definition":{"en":"the combined or overlapping Azilian and Tardenoisian cultural horizon, treated as a single topic in archaeology.","zh":"（考古学）被合并或并列讨论的“阿兹利与塔德努瓦”文化范围/文化阶段（作为一个研究主题）。"},"examples":[{"en":"She specializes in the Azilian-tardenoisian of western Europe.","zh":"她专攻西欧的阿兹利—塔德努瓦文化阶段研究。"}]}],"synonyms":["Mesolithic","Epipaleolithic","Azilian","Tardenoisian"],"phonetic":"/əˈzɪliən ˌtɑr-dəˈnwɑ-zi-ən/","extraExplanation":["这是一个学术性很强的复合术语，通常出现在考古学、史前史与博物馆说明中。Azilian 多与法国/比利牛斯一带的晚期旧石器—早期中石器过渡有关；Tardenoisian 常与法国北部及邻近地区的中石器“小型石片（microlith）”传统相关。","写法上常见连字符（Azilian-tardenoisian），表示“并列/合称的范围”，不一定意味着两者完全相同；有时用于强调它们在时间或技术上的连续与重叠。","相关术语常见：Mesolithic（中石器时代）、Epipaleolithic（旧石器时代末期/后旧石器）。"]}
{"word":"azilut","summary":{"en":"Azilut is a Kabbalistic term for the highest spiritual world, often translated as “Emanation.”","zh":"Azilut 是卡巴拉用语，指“四界”中最高的灵性世界，常译为“流溢界/发出界”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Jewish Kabbalah) the highest of the Four Worlds, often translated as “Emanation,” the spiritual realm closest to the Divine.","zh":"（犹太神秘主义卡巴拉中）“四界”之首，常译为“流溢界/发出界”，指最接近神性的最高灵性领域。"},"examples":[{"en":"In some Kabbalistic writings, Azilut is described as the world of pure divinity.","zh":"在一些卡巴拉著作中，Azilut 被描述为纯粹神性的世界。"},{"en":"They studied the Four Worlds—Azilut, Beriah, Yetzirah, and Assiah—to understand levels of spiritual reality.","zh":"他们学习“四界”——Azilut、Beriah、Yetzirah、Assiah——以理解灵性实相的层次。"}]}],"synonyms":["Atzilut","the World of Emanation"],"phonetic":"/ˈɑːtsiˌluːt/","extraExplanation":["“Azilut”也常拼作“Atzilut”（更常见），来自希伯来语 אֲצִילוּת（atzilut），与“流溢/发出（emanation）”的观念相关：指万有从神性源头“流出”的最高层次。","在“四界”体系里，它通常被放在最上层：Azilut（流溢界）→ Beriah（创造界）→ Yetzirah（形成界）→ Assiah（行动/物质界）。不同传统对细节解释会略有差异。"]}
{"word":"Azimech","summary":{"en":"“Azimech” is not a standard English word; it’s usually a name/coinage, and it may sometimes be a misspelling of “azimuth.”","zh":"“Azimech”不是常见英语词；通常是名字/自造词，也可能偶尔是 “azimuth（方位角/方位）” 的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name or coined term; not a standard dictionary word in modern English. It may be used as a username, brand name, character name, or a made-up word in fiction or games.","zh":"专有名词或自造词；在现代英语里不是常见词典词条。可能用作用户名、品牌名、角色名，或出现在小说/游戏中的自创词。"},"examples":[{"en":"Azimech is the name of the robot in my story.","zh":"Azimech 是我故事里那个机器人的名字。"},{"en":"Search results suggest Azimech is mostly used as a username.","zh":"搜索结果显示 Azimech 多用于用户名。"}]},{"partOfSpeech":"other","definition":{"en":"Sometimes a misspelling of “azimuth” (the direction/angle used in navigation and astronomy).","zh":"有时是 “azimuth”（方位角/方位）的拼写错误，用于导航和天文学。"},"examples":[{"en":"If you meant azimuth, it refers to direction measured as an angle from north.","zh":"如果你想写的是 azimuth，它指从正北开始测量的方向角。"}]}],"synonyms":["(for the name/coinage) none","(if you meant azimuth) bearing","direction"],"phonetic":"ˈæzɪmɛk","extraExplanation":["“Azimech”看起来像由两部分拼成：Azim-（可能让人联想到阿拉伯语/波斯语人名词根，含“伟大/强大”的意思）+ -mech（英语里常作为“mechanical/机械”的缩写）。因此在科幻或游戏语境里，它很适合作为“机械系角色/组织”的名称。","如果你告诉我它出现的具体语境（例如一本书、一款游戏、一段对话），我可以更准确地解释它指什么，并给出更贴切的例句和相关词。"]}
{"word":"azimech","summary":{"en":"“Azimech” is not a common English word; it likely refers to “azimuth,” the angle/direction measured from north along the horizon.","zh":"“azimech”不是常见英语词；很可能指“azimuth（方位角）”，即沿地平线从正北起算的方向/角度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Not a standard English word.) This looks like a misspelling of “azimuth,” a term used in navigation and astronomy meaning the direction of something measured as an angle from north (or from a reference direction) along the horizon.","zh":"（不是标准英语单词。）这看起来像是“azimuth（方位角）”的拼写错误：在航海与天文学中，表示某个方向在地平线上相对于正北（或某个参考方向）的角度。"},"examples":[{"en":"The ship’s radar showed the storm at an azimuth of 120 degrees.","zh":"船上的雷达显示风暴在方位角120度的方向。"},{"en":"In astronomy, azimuth helps describe where a star appears in the sky.","zh":"在天文学中，方位角用于描述恒星在天空中的位置方向。"}]}],"synonyms":["bearing","direction","heading"],"phonetic":"/ˈæzəməθ/","extraExplanation":["“azimuth”常与“altitude（高度角）”一起使用：altitude表示从地平线向上抬升的角度；azimuth表示沿地平线绕一圈的方向角。","如果“azimech”是某个专有名词（人名、公司名、产品名或游戏/小说术语），请告诉我使用场景或给一句原句，我可以按你的语境解释。"]}
{"word":"azimene","summary":{"en":"“Azimene” is not a standard English word; it is likely a name/username or a misspelling.","zh":"“Azimene” 不是标准英文词；多半是名字/用户名或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is most likely a personal name, username, brand name, or a misspelling of another word.","zh":"不是常见英语词典中的标准词；更可能是人名、用户名、品牌名，或是其他词的拼写错误。"},"examples":[{"en":"“Azimene” is not listed as an English vocabulary word; could you share the sentence where you saw it?","zh":"“Azimene” 不像是标准英文词汇；你能提供你看到它的句子吗？"},{"en":"I think “Azimene” might be a username rather than a dictionary word.","zh":"我觉得 “Azimene” 可能是用户名，而不是词典里的单词。"}]}],"phonetic":"/ˌæzɪˈmiːn/","extraExplanation":["从拼写来看，它可能是以下词的误拼或变体（请结合上下文确认）：\n1）azimuth（方位角/方位）：常见于地图、航海、天文等语境。\n2）某些语言的人名（如阿拉伯语系名字的转写）在英文中会出现不同拼法。\n\n如果你把它出现的句子、领域（游戏/地理/数学/人名等）或截图发我，我可以更准确判断它想表达的词以及正确含义与用法。"]}
{"word":"azimethylene","summary":{"en":"Azimethylene is a rare, older chemistry term meaning aziridine (ethylene imine), a three‑membered nitrogen ring compound.","zh":"Azimethylene 是较少见的旧化学名，指 aziridine（氮丙啶/乙撑亚胺），一种三元含氮环化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) An older name for aziridine: a small, three‑membered ring compound containing one nitrogen atom (a cyclic amine), sometimes called “ethylene imine.”","zh":"（化学）“aziridine（氮丙啶）”的旧称：一种含一个氮原子的三元环含氮化合物（环状胺），有时也称“ethylene imine（乙撑亚胺）”。"},"examples":[{"en":"Aziridine (formerly called azimethylene) is a strained ring and can react easily.","zh":"氮丙啶（旧称 azimethylene）是张力很大的小环，因此容易发生反应。"},{"en":"Some older chemistry texts use the name azimethylene instead of aziridine.","zh":"一些较老的化学教材会用 azimethylene 来指代 aziridine。"}]}],"synonyms":["aziridine","ethylene imine"],"phonetic":"/ˌæzɪˈmɛθəˌlin/","extraExplanation":["这个词在现代化学文献中非常少见，多出现在早期/旧版教材或命名体系里。学习时更建议记常用名 aziridine（氮丙啶）或别名 ethylene imine（乙撑亚胺），检索资料也更容易。"]}
{"word":"azimide","summary":{"en":"Azimide is a rare, older chemistry word that generally corresponds to “azide” in modern usage.","zh":"Azimide 是一个较少见的旧式化学术语，现代用法通常对应 azide（叠氮化物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical term (now rare) referring to an azide, or to compounds related to hydrazoic acid (HN₃); historically used in older chemistry writing","zh":"（化学用语，较少见）指“叠氮化物（azide）”，或与叠氮酸（hydrazoic acid，HN₃）相关的化合物；多见于较早期的化学文献"},"examples":[{"en":"In older texts, “azimide” is sometimes used where modern chemistry would say “azide.”","zh":"在较早的文献中，“azimide”有时用来表示现代化学所说的“azide（叠氮化物）”。"},{"en":"The paper mentions azimide compounds, but the terminology is outdated.","zh":"这篇论文提到“azimide”化合物，但术语已经过时。"}]}],"synonyms":["azide","hydrazoic acid (older/related)"],"phonetic":"/ˈæzɪˌmaɪd/","extraExplanation":["“Azimide”属于历史性/过时用法：现代更常用的是“azide（叠氮化物）”。在阅读老教材或老论文时遇到该词，通常可先按“azide”理解，再结合上下文确认它指的是叠氮基（–N₃）相关的物质还是更具体的化合物名称。","注意安全：不少叠氮化物（尤其是重金属叠氮化物）具有爆炸性或高毒性；如果是在实验/工作语境中看到该词，应按危险化学品规范处理。"]}
{"word":"azimin","summary":{"en":"“Azimin” is usually a name, not an English vocabulary word.","zh":"“Azimin”通常是人名，不是英语常用词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. In English contexts, “Azimin” is most likely used as a personal name (given name or surname) from another language, rather than a vocabulary word.","zh":"不是标准英语词汇。在英语语境中，“Azimin”更可能是外来的人名（名或姓），而不是英语词汇。"},"examples":[{"en":"I met Azimin at the conference yesterday.","zh":"我昨天在会议上认识了Azimin。"},{"en":"Azimin Khan wrote the report.","zh":"Azimin Khan写了那份报告。"}]}],"phonetic":"/ˈɑːzɪmɪn/","extraExplanation":["“Azimin”在英语词典里通常查不到作为普通词的释义。如果你是在短信/作业/歌词里看到的，可能是：\n1）人名（常见于南亚、东南亚或阿拉伯语背景的姓名拼写之一）；\n2）拼写误差：你可能想写的是 **azimuth**（方位角，导航/天文用语）或 **examine**（检查、考试）。\n如果你告诉我出现它的句子或语境，我可以更准确判断。"]}
{"word":"azimine","summary":{"en":"Azimine is a rare, old word for a tropical American fruit (or its tree), related to the pawpaw (*Asimina*).","zh":"Azimine 是一个罕见的旧词，指热带美洲的一种水果（或其果树），与 pawpaw（番木瓜属 *Asimina*）有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic) A tropical American fruit (or the tree that bears it), related to the pawpaw (genus *Asimina*).","zh":"（罕见/旧用）一种热带美洲水果（或其果树），与北美“pawpaw”（番木瓜属 *Asimina*）相关。"},"examples":[{"en":"In some older travel writing, “azimine” refers to a local pawpaw-like fruit.","zh":"在一些较早的游记里，“azimine”用来指一种类似北美 pawpaw 的当地水果。"},{"en":"The explorer described tasting azimine along the riverbank.","zh":"探险者描述自己在河岸边品尝了 azimine。"}]}],"synonyms":["pawpaw (Asimina)","asimina","Asimina"],"phonetic":"/ˌæzɪˈmiːn/","extraExplanation":["“azimine”在现代英语中几乎不用，更常见的拼法/相关词是 **asimina**（植物属名）或 **pawpaw**。不同地区“pawpaw”也可能指木瓜（papaya），容易混淆：北美的 pawpaw 通常指 *Asimina triloba*（番木瓜属的一种），而热带的 papaya 是另一种植物。","词源上常被认为与西班牙语/葡萄牙语的相关形式有关，进一步可能来自加勒比地区原住民语言（常见说法指向泰诺语一类的来源）。"]}
{"word":"azimino","summary":{"en":"A rare chemistry combining form meaning “having an azimino (nitrogen-rich) group,” mainly seen in chemical names.","zh":"一个少见的化学构词形式，表示“含 azimino（富氮）基团”，主要见于化学名称中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Chemistry, combining form) Referring to or containing an azimino group—a nitrogen-rich functional group used in chemical naming, often discussed alongside azides and related compounds.","zh":"（化学，构词形式）指“含有叠氮/富氮的 azimino（叠氮亚胺）基团”的，用于化学命名的前缀/词根，常与叠氮（azide）等相关化合物一起讨论。"},"examples":[{"en":"In older chemical names, azimino- may appear as a prefix describing a nitrogen-rich substituent.","zh":"在一些较早的化学命名中，azimino- 可能作为前缀出现，用来描述一种富含氮的取代基。"},{"en":"This term is mainly used in chemical nomenclature rather than everyday English.","zh":"这个词主要用于化学命名，而不是日常英语。"}]}],"synonyms":["azimino- (combining form)"],"phonetic":"/ˌæzɪˈmiːnoʊ/","extraExplanation":["azimino- 属于非常专业、偏旧式的化学构词成分，在现代资料中更常见的是用更标准化的系统命名（如 IUPAC）来直接描述具体结构；因此你在一般词典里可能很难查到它。","如果你能提供看到它的完整化学名或句子语境，我可以帮你判断它在该名称里具体指的基团/结构。"]}
{"word":"aziminobenzene","summary":{"en":"Aziminobenzene is a (less common) name for benzotriazole, a nitrogen-containing aromatic compound often used to prevent metal corrosion.","zh":"Aziminobenzene 是 benzotriazole（苯并三唑）的较少见名称，属于含氮芳香化合物，常用于金属防腐蚀（缓蚀）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound also known as benzotriazole (a benzene ring fused to a triazole ring), used especially as a corrosion inhibitor and in chemical synthesis","zh":"一种化学化合物，也称“苯并三唑（benzotriazole）”（苯环与三唑环稠合），常用于防腐蚀/缓蚀以及化学合成"},"examples":[{"en":"Aziminobenzene (benzotriazole) is often added to protect copper from corrosion.","zh":"Aziminobenzene（苯并三唑）常被添加用来保护铜免受腐蚀。"},{"en":"In the lab, we used aziminobenzene as a starting material for making triazole-based molecules.","zh":"在实验室里，我们用 aziminobenzene 作为起始原料来合成含三唑结构的分子。"}]}],"synonyms":["benzotriazole","BTA"],"phonetic":"/ˌæzɪˌmiːnoʊˈbɛnziːn/","extraExplanation":["“Aziminobenzene”是较旧或较少见的名称，现代文献中更常用“benzotriazole（苯并三唑）”来指同一类/同一种结构。","读法上可以把它拆成：azi-（与含氮结构相关的构词片段）+ imino（亚胺/含氮基团相关）+ benzene（苯）。在一般英语交流中更常见的仍是“benzotriazole”。"]}
{"word":"azimuth","summary":{"en":"Azimuth is the horizontal angle from a reference direction (usually true north) to a target direction, used in navigation and astronomy.","zh":"Azimuth（方位角）是从参考方向（通常正北）沿地平线量到目标方向的水平角度，常用于导航与天文测量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In navigation, astronomy, and surveying, the angle measured along the horizon from a reference direction (usually true north) to the direction of an object.","zh":"（导航、天文学、测量中）方位角：沿地平线从参考方向（通常为正北）到目标方向所测得的角度。"},"examples":[{"en":"The hiker checked the compass to find the azimuth to the next peak.","zh":"徒步者查看罗盘，确定通往下一座山峰的方位角。"},{"en":"In astronomy class, we recorded the azimuth of the sun at sunset.","zh":"在天文学课上，我们记录了日落时太阳的方位角。"}]}],"synonyms":["bearing","horizontal angle","compass bearing"],"phonetic":"/ˈæzəˌmʊθ/","extraExplanation":["词源来自阿拉伯语，经中世纪拉丁语进入英语；在科学与工程语境中很常见。","方位角常用度数表示（0°–360°）：0°通常代表正北，90°代表正东，180°代表正南，270°代表正西。具体约定可能因领域或工具略有不同。","相关词汇：bearing（方位/航向，常更偏导航用语）、altitude/elevation（高度角，与azimuth一起描述天空中物体的位置）。"]}
{"word":"azimuthal","summary":{"en":"Azimuthal means “related to azimuth,” i.e., direction/angle around a central point, especially in navigation, astronomy, and physics.","zh":"azimuthal 指“与方位角有关的”，即围绕中心点的水平角度/方向，常见于导航、天文与物理等领域。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an azimuth (the horizontal angle or direction measured around a central point, usually in navigation, astronomy, or physics).","zh":"与“方位角”有关的；方位角的（方位角指围绕中心点在水平面上测量的角度/方向，常用于导航、天文或物理）。"},"examples":[{"en":"Azimuthal measurements help sailors keep the correct direction at sea.","zh":"方位角测量能帮助水手在海上保持正确航向。"},{"en":"The telescope can rotate azimuthally to track an object across the sky.","zh":"望远镜可以进行方位方向的旋转，以追踪天空中的目标。"}]},{"partOfSpeech":"adj.","definition":{"en":"In mathematics/physics: depending on or varying with the azimuth angle around an axis (often in cylindrical or spherical coordinates).","zh":"（数学/物理）随方位角变化的；与绕轴的方位角有关的（常见于柱坐标或球坐标）。"},"examples":[{"en":"In a perfectly symmetric system, there is no azimuthal variation.","zh":"在完全对称的系统中，不会出现随方位角变化的差异。"},{"en":"The model includes an azimuthal component of the velocity.","zh":"该模型包含速度的一个方位角分量。"}]}],"synonyms":["directional","angular","circumferential","rotational"],"phonetic":"/ˌæzəˈmuːθəl/","extraExplanation":["“azimuthal”来自名词“azimuth”（方位角）。在英语里常与“radial（径向的）”“polar（极向的/极坐标的）”“cylindrical（柱坐标的）”一起出现，用来描述方向或坐标系中的分量。常见搭配：azimuthal angle（方位角）、azimuthal symmetry（方位对称/轴对称的一种表述）、azimuthal rotation（绕方位方向旋转）。"]}
{"word":"azimuthally","summary":{"en":"Azimuthally means “in terms of direction/angle around a point on the horizontal plane.”","zh":"azimuthally 表示“就方位角而言；沿水平面绕某点的方向/角度地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to azimuth (the horizontal angle or direction around a central point, usually measured from north or from a reference direction).","zh":"以与方位角（azimuth）有关的方式；沿水平面绕中心点的方向/角度（通常从正北或参考方向起算）。"},"examples":[{"en":"The antenna is rotated azimuthally to point toward the satellite.","zh":"天线沿方位方向旋转，以对准卫星。"},{"en":"We adjusted the camera azimuthally until the target was centered.","zh":"我们沿水平方向调整相机，直到目标居中。"}]}],"synonyms":["horizontally (in direction)","around a central axis","circumferentially"],"phonetic":"/ˌæzəˈmuːθəli/","extraExplanation":["“azimuthally”来自名词“azimuth（方位角）+ -ally”。常见于地理、导航、天文学、雷达/天线工程、物理与数学（如圆柱坐标系）等语境，用来强调“绕垂直轴/在水平面上改变方向”，区别于“vertically（竖直方向）”或“radially（径向）”。"]}
{"word":"azimuths","summary":{"en":"Azimuths are measured horizontal angles from a reference direction (often north) to an object’s direction.","zh":"Azimuths（方位角）是从参考方向（常为正北）到目标方向的水平角度测量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the horizontal angle (usually measured in degrees) from a fixed direction (often north) to the direction of an object, used in navigation, surveying, astronomy, and mapping","zh":"（方位角）从一个固定方向（常为正北）到目标方向在水平面上的角度（通常以度数表示），用于导航、测量、天文与制图"},"examples":[{"en":"The pilot checked the azimuths to confirm the aircraft was heading toward the waypoint.","zh":"飞行员核对各个方位角，确认飞机正朝着航路点飞去。"},{"en":"In astronomy class, we recorded the sun’s azimuths at different times of day.","zh":"在天文学课上，我们记录了太阳在一天不同时刻的方位角。"}]}],"synonyms":["bearings","headings","directions"],"phonetic":"/ˈæzɪməθs/","extraExplanation":["“Azimuths” 是 “azimuth” 的复数形式。在实际使用中，你常会看到它和 “bearing（方位/方位角）” 放在一起比较：bearing 更偏“朝向/方位”的表达，而 azimuth 更偏“以北为基准、用角度精确测量”的技术用语。","词源上，azimuth 通过中世纪拉丁语进入英语，源自阿拉伯语中表示“方向/路径”的相关词形，因此在天文与航海语境里很常见。"]}
{"word":"azine","summary":{"en":"Azine is mainly a chemistry term for nitrogen-containing ring compounds and appears in many chemical names; it can also refer to a class of dyes.","zh":"Azine 主要是化学术语，指含氮杂环化合物，也常出现在许多化学品名称中；另外也可指一类染料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) Any of a class of nitrogen-containing heterocyclic compounds (ring-shaped molecules) related to pyridine; also used as a name element in many chemical compounds (e.g., atrazine).","zh":"（化学）一类含氮杂环化合物（环状分子），与吡啶等结构相关；也常作为许多化学物质名称中的组成部分（如 atrazine 阿特拉津）。"},"examples":[{"en":"Azines are important building blocks in organic chemistry.","zh":"Azine（类化合物）是有机化学中重要的结构基础。"},{"en":"Atrazine is a herbicide whose name contains “-azine.”","zh":"Atrazine（阿特拉津）是一种除草剂，它的名称中含有“-azine”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Dye chemistry) A type of synthetic dye containing an azine ring (often called an “azine dye”).","zh":"（染料化学）含有 azine 环结构的一类合成染料（常称为“azine 染料”）。"},"examples":[{"en":"Some older textile dyes are classified as azine dyes.","zh":"一些较早期的纺织染料被归类为 azine 染料。"}]}],"synonyms":["nitrogen heterocycle","heteroaromatic compound","azine dye"],"phonetic":"/ˈeɪziːn/","extraExplanation":["在英文里，-azine 常见于化学命名中：既可以指“含氮杂环的一类化合物”，也常作为“某种含 azine 环结构的化合物/药剂”的词尾（如 atrazine、simazine）。日常英语中很少单独用 azine，更多是在专业或学术语境中出现。"]}
{"word":"azines","summary":{"en":"Azines are nitrogen-containing heterocyclic compounds, most often mentioned in chemistry (e.g., triazines).","zh":"Azines 指一类含氮的杂环化合物，主要用于化学语境（如三嗪等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) Any of a class of nitrogen-containing heterocyclic compounds, especially ring structures related to pyridine; also used in names ending in “-azine” (e.g., triazine).","zh":"（化学）一类含氮杂环化合物，尤指与吡啶等相关的环状结构；也常作为以“-azine”结尾的化学名称成分（如三嗪 triazine）。"},"examples":[{"en":"Triazines are azines that contain three nitrogen atoms in the ring.","zh":"三嗪是一类杂环中含有三个氮原子的 azine（含氮杂环化合物）。"},{"en":"The paper discusses the synthesis of several azines for pharmaceutical research.","zh":"这篇论文讨论了多种 azine 的合成，用于药物研究。"}]}],"synonyms":["nitrogen heterocycle","heterocyclic compound"],"phonetic":"/ˈeɪziːn/","extraExplanation":["“Azine/azines”通常出现在化学语境，日常英语里很少单独使用；更常见的是出现在具体化合物名称中（如 triazine, tetrazine 等）。","词尾“-azine”在化学命名中常提示“含氮杂环”的家族特征，但不同具体词（如 hydrazine）不一定都严格属于同一结构类型，最好结合具体化合物来理解。"]}
{"word":"azinphosmethyl","summary":{"en":"Azinphos-methyl is a very toxic organophosphate insecticide that has been widely restricted or banned.","zh":"阿津磷甲基是一种高毒性的有机磷杀虫剂，已在许多地区被严格限制或禁用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a highly toxic organophosphate insecticide (a farm chemical used to kill insects), formerly used on fruit and nut crops; it has been widely restricted or banned in many countries because it can harm human health and wildlife.","zh":"一种高毒性的有机磷杀虫剂（用于杀死害虫的农业化学品），曾用于果树与坚果等作物；由于可能危害人体健康与野生动物，在许多国家已被严格限制或禁用。"},"examples":[{"en":"Azinphos-methyl was once used to control pests in orchards.","zh":"阿津磷甲基曾用于果园害虫防治。"},{"en":"Because it is very toxic, azinphos-methyl is no longer allowed in many places.","zh":"由于毒性很强，许多地区已不再允许使用阿津磷甲基。"}]}],"synonyms":["azinphos-methyl","Guthion"],"phonetic":"/əˌzɪnˌfɑsˈmɛθəl/","extraExplanation":["“azinphos-methyl”常见写法带连字符，也可能写作“azinphosmethyl”。它属于有机磷农药，这类物质通常通过影响昆虫与人类的神经系统相关酶来起作用，因此对非目标生物也可能有风险。","它在美国曾以商品名“Guthion”较为人所知；后来因健康与环境风险评估结果，逐步被取消或严格限制使用。不同国家/地区法规不一，若在阅读新闻或标签时遇到该词，通常与农药监管、残留标准或职业暴露安全有关。"]}
{"word":"aziola","summary":{"en":"“Aziola” is not a standard English vocabulary word; it’s usually used as a name or label (person/brand/place) and needs context to interpret.","zh":"“Aziola”不是常见英文词汇；通常作为人名/品牌/地名等标签使用，具体含义需结合上下文判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare proper noun (name). In English, “Aziola” is not a standard dictionary word; it most often appears as a personal name, brand name, place name, or username with no single fixed meaning.","zh":"一个较少见的专有名词（名字）。在英语里，“Aziola”不是常见词典词汇；多用于人名、品牌名、地名或网名，本身没有统一固定含义。"},"examples":[{"en":"Aziola is listed as the author of the blog post.","zh":"Aziola 被列为这篇博客文章的作者。"},{"en":"I saw “Aziola” on the label, so it may be a brand name.","zh":"我在标签上看到“Aziola”，所以它可能是个品牌名。"}]}],"phonetic":"/ˌɑːziˈoʊlə/","extraExplanation":["“Aziola”在英语语料中不常见，因此很可能是专有名称（如姓氏、名字、店名、产品名）或拼写变体。要准确解释通常需要上下文（例如：它出现在哪个国家/平台/领域？是一段话里的什么角色？）。","如果你本来想查的是类似拼写的常见词，可能是：azalea（杜鹃花/映山红）、aureola（光环）、areola（乳晕/晕圈）等；把原句发我，我可以帮你判断。"]}
{"word":"Aziza","summary":{"en":"Aziza is most commonly a feminine given name meaning “beloved/precious” or “mighty,” and it can also refer to a spirit in some West African folklore.","zh":"Aziza 最常见是女性名字，常含“珍爱/珍贵”或“强大”的意思；在一些西非民间传说中也可指一种精灵或超自然存在。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A feminine given name used in several cultures, especially in Arabic- and Swahili-speaking communities; commonly interpreted as “beloved,” “precious,” or “powerful/mighty.”","zh":"女性名字，常见于阿拉伯语与斯瓦希里语等文化圈；常被理解为“被珍爱的人 / 珍贵的 / 强大有力的”。"},"examples":[{"en":"Aziza is a popular girls’ name in some Muslim families.","zh":"Aziza 是一些穆斯林家庭里常见的女孩名字。"},{"en":"We named our daughter Aziza to honor her grandmother.","zh":"我们给女儿取名 Aziza 是为了纪念她的外祖母。"},{"en":"Aziza introduced herself politely at the meeting.","zh":"Aziza 在会议上礼貌地做了自我介绍。"}]},{"partOfSpeech":"n.","definition":{"en":"(In some West African folklore) a type of supernatural being or spirit, sometimes described as small, forest-dwelling, and linked to magic or knowledge.","zh":"（在一些西非民间传说中）一种超自然存在/精灵，有时被描绘为身形小、栖居森林，并与魔法或知识相关。"},"examples":[{"en":"In the story, the hunter believes the aziza can teach secret skills.","zh":"在故事里，猎人相信 aziza 能教他秘密的本领。"},{"en":"The tale warns children not to wander into the forest where the aziza live.","zh":"这个故事告诫孩子不要走进据说 aziza 栖居的森林。"}]}],"synonyms":["Azizah","Aziza(h)","Aziz (related name)"],"phonetic":"/əˈziːzə/","extraExplanation":["作为人名时，Aziza 常被视为源自阿拉伯语词根“ʿazīz”（意为“珍贵的、受尊敬的、强大的”），也常见于东非（如斯瓦希里语环境）与非裔社群。不同地区对名字含义的侧重可能不同，但通常都带有积极、赞美的意味。","如果你指的是某位具体人物（例如书中角色、歌手或身边的人），我也可以帮你根据语境解释或找相关信息。"]}
{"word":"azlactone","summary":{"en":"Azlactone is a reactive oxazolone-type chemical used as a building block in synthesis and polymer chemistry.","zh":"Azlactone 是一种反应性较强的噁唑（啉）酮类化学物质，常用于有机合成与聚合物化学。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (an oxazolone ring) used as a reactive building block in organic synthesis and in making polymers, often because it reacts easily with amines and alcohols","zh":"（化学）一种“氮杂内酯/噁唑啉酮”环状化合物，常用作有机合成与高分子材料中的活性中间体，因为它容易与胺、醇等发生反应"},"examples":[{"en":"The lab used an azlactone to attach a dye to the polymer surface.","zh":"实验室用一种azlactone把染料连接到聚合物表面。"},{"en":"Azlactones are useful intermediates for making amino‑acid derivatives.","zh":"Azlactone常作为合成氨基酸衍生物的有用中间体。"}]}],"synonyms":["oxazolone","oxazolinone"],"phonetic":"/ˈæz.læk.toʊn/","extraExplanation":["azlactone 常见于材料科学与生物偶联（bioconjugation）语境：它的环结构“张力/活性”较高，容易被胺（—NH₂）开环，因此常被用来把分子（如药物、荧光染料）“接枝”到聚合物或表面上。","在文献中 azlactone 有时也会被归到 oxazolone（噁唑酮/噁唑啉酮）这一类名称下；具体结构会随取代基不同而变化。"]}
{"word":"Azle","summary":{"en":"Azle is most commonly a place name: a city in North Texas near Fort Worth; it can also be a surname.","zh":"Azle 最常见是地名：美国德州北部、靠近沃斯堡的一座城市；也可作姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A city in North Texas, USA (in Tarrant and Parker counties), near Fort Worth.","zh":"美国德克萨斯州北部的一座城市（位于塔兰特县与帕克县），靠近沃斯堡。"},"examples":[{"en":"Azle is a small city northwest of Fort Worth.","zh":"Azle 是沃斯堡西北方向的一座小城市。"},{"en":"She grew up in Azle, Texas.","zh":"她在德州的 Azle 长大。"}]},{"partOfSpeech":"other","definition":{"en":"A family name (surname), less commonly used than the place name.","zh":"一个姓氏（不如地名常见）。"},"examples":[{"en":"Mr. Azle will speak at the meeting today.","zh":"Azle 先生今天将在会议上发言。"}]}],"phonetic":"/ˈæzli/","extraExplanation":["“Azle”在英语里通常读作两音节，重音在第一音节：AZ-lee。","作为地名时常见写法是“Azle, Texas”。如果你是在地址、新闻或地图上看到它，基本可以确定是德州的这座城市。"]}
{"word":"azlon","summary":{"en":"Azlon is a protein-based manufactured fiber used in textiles, often added to fabrics to make them feel softer and more silky.","zh":"Azlon 是一种由天然蛋白质再生制成的人造纤维，用于纺织品中，常用于提升布料的柔软与丝滑触感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a manufactured textile fiber made from regenerated natural proteins (such as soy, milk/casein, peanut, or corn protein), used in some fabrics for a soft, silk-like feel","zh":"（纺织）蛋白质人造纤维：由天然蛋白质（如大豆、牛奶酪蛋白、花生或玉米蛋白）再生制成的纤维，常用于布料以获得柔软、类似丝绸的手感"},"examples":[{"en":"This sweater blend includes azlon for extra softness.","zh":"这件混纺毛衣含有 azlon，让手感更柔软。"},{"en":"Azlon is sometimes marketed as a more ‘natural-feeling’ man‑made fiber.","zh":"Azlon 有时会被宣传为更“接近天然触感”的人造纤维。"}]}],"synonyms":["protein fiber","regenerated protein fiber"],"phonetic":"/ˈæz.lɑn/","extraExplanation":["Azlon 更常见于服装标签或纺织材料介绍中，属于“纤维名称（generic fiber name）”，不是某一家公司的品牌名。","历史上曾出现过以牛奶蛋白（casein）或大豆蛋白制作的纤维；实际穿着体验与耐用度会因配方与工艺差异而不同，常与棉、涤纶、羊毛等混纺。"]}
{"word":"azlons","summary":{"en":"“Azlons” isn’t a standard English word; it’s likely a typo or a proper/specialized name.","zh":"“azlons”不是标准英语单词；更可能是拼写错误或专有/领域名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a proper name, or a term from a specific community/game/brand.","zh":"不是标准英语单词。可能是拼写错误、人名/地名，或某个圈子/游戏/品牌中的专有词。"},"examples":[{"en":"I couldn’t find “azlons” in a regular English dictionary—can you share the sentence you saw it in?","zh":"我在常见英语词典里找不到“azlons”——你能把它出现的句子发我吗？"},{"en":"If you meant “as long as,” the meaning changes a lot depending on context.","zh":"如果你想写的是“as long as”，意思会因语境不同而变化很大。"}]}],"phonetic":"/æzˈlɑnz/","extraExplanation":["“azlons”在主流英语语料和常见词典中没有稳定词条。最常见的情况是拼写输入错误（比如漏空格、字母顺序错、自动纠错失败）。","如果你是想表达短语“as long as”（只要/既然/在……期间），请把原句贴出来，我可以帮你判断是哪一种用法。"]}
{"word":"Aznavour","summary":{"en":"Aznavour usually refers to Charles Aznavour, a legendary French chanson singer-songwriter and actor.","zh":"Aznavour 通常指传奇法国香颂歌手、词曲作者兼演员夏尔·阿兹纳武尔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Charles Aznavour (1924–2018), a French singer-songwriter and actor, famous for emotionally expressive chansons.","zh":"夏尔·阿兹纳武尔（Charles Aznavour，1924–2018），法国歌手、词曲作者兼演员，以情感浓烈的法语香颂闻名。"},"examples":[{"en":"My parents love Charles Aznavour’s songs.","zh":"我父母很喜欢夏尔·阿兹纳武尔的歌。"},{"en":"Aznavour is often mentioned as one of the great voices of French chanson.","zh":"阿兹纳武尔常被称为法语香颂最伟大的嗓音之一。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname; may refer to people with the family name Aznavour (or Aznavourian).","zh":"姓氏；可指姓 Aznavour（或 Aznavourian）的人。"},"examples":[{"en":"Aznavour is a well-known surname in music history because of Charles Aznavour.","zh":"由于夏尔·阿兹纳武尔，Aznavour 这个姓氏在音乐史上很有名。"}]}],"phonetic":"/ˌɑz.nəˈvʊr/","extraExplanation":["“Aznavour”在英语语境里最常指法国歌手 Charles Aznavour。他的作品属于“chanson（香颂）”传统：重视歌词叙事与情感表达，常以城市生活、爱情、孤独等主题打动听众。","他也因亚美尼亚血统而受到亚美尼亚社群的敬重；在文化与慈善领域都很有影响力。","常见相关词：chanson（法语香颂/法语抒情歌曲）、ballad（抒情民谣/叙事歌）、crooner（低沉温柔嗓音的流行男歌手）。"]}
{"word":"azo","summary":{"en":"A chemistry term meaning “containing an –N=N– (azo) group,” commonly related to dyes.","zh":"化学术语，指“含 –N=N–（偶氮基）”，常与染料相关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Chemistry, combining form) used to describe compounds that contain an –N=N– (azo) group, often found in dyes.","zh":"（化学，构词成分）用于描述含有 –N=N–（偶氮基）的化合物，常见于染料中。"},"examples":[{"en":"Azo dyes are widely used to color textiles.","zh":"偶氮染料被广泛用于纺织品着色。"},{"en":"The label says it contains an azo compound.","zh":"标签上写着它含有一种偶氮化合物。"}]},{"partOfSpeech":"n.","definition":{"en":"(Chemistry) an azo dye or azo compound (often used as a modifier, e.g., “azo dye”).","zh":"（化学）偶氮染料或偶氮化合物（常作修饰语使用，如“azo dye”）。"},"examples":[{"en":"Some countries regulate certain azo dyes in clothing.","zh":"一些国家对服装中的某些偶氮染料有管制。"},{"en":"This experiment compares different azo compounds.","zh":"这个实验比较不同的偶氮化合物。"}]}],"synonyms":["azo-","diazene (related)","azo dye (related term)"],"phonetic":"/ˈeɪzoʊ/","extraExplanation":["“azo- / azo”主要出现在化学与材料相关语境里：偶氮基（–N=N–）常让分子具有鲜艳颜色，因此“azo dyes（偶氮染料）”在工业染色中很常见。","学习上可以把它当作一个前缀来记：看到“azo-”通常就联想到“含N=N键、与染料/颜色相关”。"]}
{"word":"azobacter","summary":{"en":"Azotobacter is a nitrogen-fixing soil bacterium often discussed in agriculture and soil science.","zh":"Azotobacter 是能固氮的土壤细菌，常见于农业与土壤科学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Azotobacter: a genus of free-living soil bacteria that can fix nitrogen (turn nitrogen gas in the air into forms plants can use).","zh":"Azotobacter（固氮菌属）：一类生活在土壤中的自由生活细菌，能固氮（把空气中的氮气转化为植物可利用的形态）。"},"examples":[{"en":"Azotobacter helps enrich soil by fixing nitrogen naturally.","zh":"Azotobacter 通过天然固氮帮助提升土壤肥力。"},{"en":"Some farmers use biofertilizers that contain Azotobacter.","zh":"一些农民会使用含有 Azotobacter 的生物肥料。"}]}],"synonyms":["nitrogen-fixing bacteria","Azotobacter (standard spelling)"],"phonetic":"/ˌæzoʊtəˈbæktər/","extraExplanation":["你输入的“azobacter”更常见的标准拼写是 **Azotobacter**（固氮菌属）。它属于“自由生活固氮菌”，不需要与豆科植物共生也能固定空气中的氮。","在农业与环保语境中，它常被提到与“生物肥料（biofertilizer）”“土壤健康（soil health）”相关；但实际效果会受土壤条件（有机质、湿度、酸碱度等）影响。"]}
{"word":"azobenzene","summary":{"en":"Azobenzene is a compound made of two benzene rings connected by an –N=N– (azo) link, known for its use in dyes and light-responsive chemistry.","zh":"偶氮苯是由两个苯环通过 –N=N–（偶氮键）连接的化合物，常见于染料相关结构，也因其对光的响应特性而在化学中很重要。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound with two benzene rings linked by an azo group (–N=N–), often used as a basic structure in dyes and as a model compound in chemistry.","zh":"偶氮苯：一种化合物，由两个苯环通过偶氮基（–N=N–）连接而成，常作为染料结构的基础，也常用于化学研究中的示范化合物。"},"examples":[{"en":"Azobenzene is a classic example used to study light-driven molecular changes.","zh":"偶氮苯是研究光驱动分子变化的经典例子。"},{"en":"Some azo dyes are based on an azobenzene-like structure.","zh":"一些偶氮染料以类似偶氮苯的结构为基础。"}]}],"synonyms":["diphenyldiazene"],"phonetic":"/ˌeɪzoʊˈbɛnzin/","extraExplanation":["偶氮苯很有名的一点是“光致异构化”：在紫外光/可见光照射下，它可以在反式（trans）与顺式（cis）两种构型之间转换，因此常用于讲解“分子开关”“光响应材料”等概念。","在染料化学中，“偶氮（azo）”结构很常见，但并非所有含偶氮结构的物质都等同于偶氮苯；偶氮苯特指两个苯环通过 –N=N– 相连的那一种。"]}
{"word":"azobenzil","summary":{"en":"“Azobenzil” is a rare/technical term that may refer to an azo aromatic compound, but it is often nonstandard and may be a misspelling of “azobenzene” or a related chemical name.","zh":"“Azobenzil” 是较少见的专业用词，可能指含偶氮结构的芳香族化合物，但常见情况是非标准写法或把 “azobenzene（偶氮苯）” 等词拼写错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A (rare/technical) chemical name used to refer to an azo‑linked aromatic compound, typically in discussions of dyes or organic chemistry; in many contexts it may be a misspelling or nonstandard form of related terms like “azobenzene” or “benzil.”","zh":"（罕见/专业）一种用于指代含偶氮（–N=N–）连接的芳香族化合物的名称，常见于染料或有机化学语境；但在许多场合它可能是拼写错误或非标准写法，常被误写为与 “azobenzene（偶氮苯）” 或 “benzil（联苯乙二酮）” 等相关的词。"},"examples":[{"en":"The paper mentions “azobenzil,” but the structure shown looks closer to azobenzene.","zh":"论文里写了 “azobenzil”，但画出的结构看起来更像偶氮苯（azobenzene）。"},{"en":"If you’re searching a database, try “azobenzene” as well, because “azobenzil” may not be a standard entry.","zh":"如果你在数据库里检索，也可以试试 “azobenzene”，因为 “azobenzil” 可能不是标准词条。"}]}],"synonyms":["azobenzene (possible intended term)"],"phonetic":"ˌeɪzoʊˈbɛnzɪl","extraExplanation":["“azo-” 前缀来自“偶氮/氮氮双键（–N=N–）”，在英文里常见于偶氮染料相关名词（如 azobenzene）。","你写的 “azobenzil” 在通用英语与常见化学命名中不太常见；很多学习者或文献录入时容易把 azobenzene（偶氮苯）与 benzil（联苯乙二酮）等词混淆或拼写成类似形式。","如果你能提供上下文（例如文章截图、化学式、或你想表达的中文名），我可以帮你确认最可能的正确英文术语。"]}
{"word":"azobenzoic","summary":{"en":"Azobenzoic means “related to azobenzoic acid,” a chemistry term for an azo-containing aromatic compound.","zh":"azobenzoic 指“与偶氮苯甲酸有关的”，是化学中描述含偶氮基并具有芳香结构的化合物的术语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to azobenzoic acid, a chemical compound that contains an azo group (–N=N–) connecting aromatic (benzene) rings.","zh":"与“偶氮苯甲酸”有关的；指一种含有偶氮基（–N=N–）并连接芳香（苯环）结构的化合物。"},"examples":[{"en":"Researchers prepared an azobenzoic derivative to study how light can change a molecule’s shape.","zh":"研究人员制备了一种偶氮苯甲酸衍生物，以研究光如何改变分子的形状。"},{"en":"The paper describes azobenzoic compounds that can act as photoswitches.","zh":"该论文描述了可作为“光开关”的偶氮苯甲酸类化合物。"}]},{"partOfSpeech":"n.","definition":{"en":"Short for azobenzoic acid (used mainly in chemistry contexts).","zh":"“偶氮苯甲酸”的简称（主要用于化学语境）。"},"examples":[{"en":"In the synthesis step, azobenzoic was purified by recrystallization.","zh":"在合成步骤中，偶氮苯甲酸通过重结晶进行纯化。"}]}],"synonyms":["azobenzoic acid (when used as a noun)","azo-benzoic (variant spelling)"],"phonetic":"/ˌeɪzoʊbɛnˈzoʊɪk/","extraExplanation":["“azo-（偶氮-）”表示分子中含有–N=N–结构；“benzoic（苯甲酸的）”与苯环及苯甲酸骨架相关。许多偶氮化合物与染料、材料科学、以及“光致异构化（例如顺/反转换）”研究有关，但具体性质取决于分子结构与取代基。"]}
{"word":"azobenzol","summary":{"en":"Azobenzol is an older name for azobenzene, a dye-related organic compound with an –N=N– link that can switch shape under light.","zh":"Azobenzol 是偶氮苯（azobenzene）的旧称：一种含 –N=N– 偶氮键的有机化合物，可用于染料，也能在光照下发生构型变化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Azobenzene; an organic chemical compound (C12H10N2) with two benzene rings linked by an azo group (–N=N–), used in dyes and as a light‑responsive (photo-switchable) molecule in research.","zh":"偶氮苯（azobenzene）；一种有机化合物（C12H10N2），由两个苯环通过偶氮基（–N=N–）连接，常用于染料工业，也常作为“受光可开关”的分子用于科研。"},"examples":[{"en":"Azobenzol is better known today as azobenzene in most chemistry texts.","zh":"在大多数化学教材里，azobenzol 现在更常被称为 azobenzene（偶氮苯）。"},{"en":"Azobenzene can change shape when exposed to light, which makes it useful in materials research.","zh":"偶氮苯在光照下可以改变分子构型，因此在材料研究中很有用。"}]}],"synonyms":["azobenzene"],"phonetic":"/ˌeɪzoʊˈbɛnzin/","extraExplanation":["“azobenzol”是较旧的拼写/名称，现代英语更常用“azobenzene”。在阅读老的化学文献或德语影响较强的资料时更可能见到“azobenzol”。","偶氮苯最典型的特性是顺反异构（trans/cis）可在光照下互相转化，因此常被用来做“分子开关”或“光响应材料”的示例分子。","相关词：azo- 表示含有 –N=N–（偶氮基）的化合物；很多合成染料属于“偶氮染料（azo dyes）”。"]}
{"word":"azoblack","summary":{"en":"Azoblack is a black synthetic azo dye, used as a colorant or stain.","zh":"Azoblack 指一种黑色的合成偶氮染料，可作着色剂或染色剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a black synthetic dye from the azo family, used as a colorant (often in textiles, inks, or laboratory staining).","zh":"一种黑色的合成偶氮类染料，用作着色剂（常见于纺织、油墨或实验室染色）。"},"examples":[{"en":"The fabric was colored with an azoblack dye to achieve a deep, stable black.","zh":"这块布用一种偶氮黑染料上色，以得到深而稳定的黑色。"},{"en":"Some labs use azoblack-type dyes to stain proteins so they are easier to see.","zh":"有些实验室会使用偶氮黑类染料来染蛋白质，使其更容易观察。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or colored with an azoblack dye; very dark black in appearance.","zh":"与偶氮黑染料有关的；用偶氮黑染料着色的；呈现很深的黑色。"},"examples":[{"en":"The label had an azoblack background with white lettering.","zh":"标签是偶氮黑色的底，上面配白色字。"}]}],"synonyms":["Azo Black","azo dye","black dye"],"phonetic":"ˌeɪzoʊˈblæk","extraExplanation":["“azo-”来自“偶氮（azo）”，指含有 -N=N-（偶氮键）的一大类化合物，许多人工染料属于这一类。","“Azoblack / Azo Black”有时是商品名或类别名，不同厂家/配方可能对应不同具体化学物质；在阅读实验步骤或安全资料（SDS）时最好核对准确的化学名称与编号。","部分偶氮染料在某些条件下可能分解产生芳香胺等物质，是否安全取决于具体品种与用途；工业或实验室使用应遵循相应安全规范。"]}
{"word":"azoch","summary":{"en":"“azoch” isn’t a standard English word; it’s likely a misspelling or a proper/fantasy name.","zh":"“azoch”不是标准英语单词；多半是拼写错误或专有/虚构名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most likely a misspelling or a name/term from a specific context (e.g., a username, brand, or fictional word).","zh":"不是标准英语单词；更可能是拼写错误，或来自特定语境的名称/术语（如用户名、品牌名或虚构词）。"},"examples":[{"en":"I couldn’t find “azoch” in a standard dictionary—could you share the sentence you saw it in?","zh":"我在常见词典里查不到“azoch”——你能提供它出现的句子吗？"},{"en":"If you meant “azoic,” the spelling is different and the meaning changes.","zh":"如果你想写的是“azoic”，拼写不同，意思也会变。"}]}],"phonetic":"ˈeɪzɑk","extraExplanation":["“azoch”在主流英语词典中没有常见词条。最常见的情况是：\n1）拼写误差：你可能想写的是 **azoic**（意为“无生命的/无生物的”，常用于地质学语境），或其他相近拼写的词。\n2）专有名词/虚构词：可能来自游戏、小说、社群ID、品牌等。\n如果你把“azoch”所在的整句（或前后各一两句）贴出来，我可以根据语境判断它最可能的含义和正确拼写。"]}
{"word":"azocochineal","summary":{"en":"Azocochineal is a synthetic red food dye (an azo dye), often labeled as E124.","zh":"Azocochineal 是一种合成红色食品色素（偶氮染料），常标示为 E124。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a synthetic red azo dye used as a food coloring (often listed on labels as E124, also called Ponceau 4R or Cochineal Red A).","zh":"一种合成的红色偶氮染料，用作食品着色剂（标签上常见为 E124，也称 Ponceau 4R 或 Cochineal Red A）。"},"examples":[{"en":"Some candies get their bright red color from azocochineal.","zh":"有些糖果鲜红的颜色来自 azocochineal（偶氮胭脂红）。"},{"en":"The ingredient list says “E124 (azocochineal).”","zh":"配料表写着“E124（azocochineal）”。"}]}],"synonyms":["Ponceau 4R","Cochineal Red A","E124"],"phonetic":"/ˌeɪzoʊˌkɑtʃəˈnil/","extraExplanation":["“azo-（偶氮）”表示含有偶氮结构（—N=N—）的染料类别，常见于合成色素。","azocochineal 在不同国家/地区的标示方式可能不同：有时直接写名称，有时写编号（如 E124）。如果你在阅读食品标签，编号和名称通常指向同一种色素。","少数人可能对某些合成色素敏感；如有过敏史或儿童摄入问题，建议参考当地食品安全机构的说明。"]}
{"word":"azocoralline","summary":{"en":"Azocoralline is an uncommon term for a red azo dye, and it can also describe something colored with that dye.","zh":"Azocoralline 是一个较少见的词，指一种红色偶氮染料；也可作形容词表示“用该染料着色的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a red synthetic azo dye (coloring agent), sometimes used in laboratory staining or as a pigment.","zh":"一种红色的合成偶氮染料（着色剂），有时用于实验室染色或作颜料。"},"examples":[{"en":"The technician prepared an azocoralline solution for staining the sample.","zh":"技术员配制了偶氮珊瑚红（azocoralline）溶液来给样本染色。"},{"en":"Azocoralline produces a strong red color in certain staining protocols.","zh":"在某些染色流程中，azocoralline 会呈现较强的红色效果。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or colored with azocoralline (showing a coralline-like red).","zh":"与 azocoralline 有关的；用其着色的（呈珊瑚红/紫红色）。"},"examples":[{"en":"The report mentioned an azocoralline pigment in the mixture.","zh":"报告提到该混合物中含有一种 azocoralline 色素。"}]}],"synonyms":["azo dye","red dye","pigment","coralline red"],"phonetic":"ˌeɪzoʊˈkɔrəlaɪn","extraExplanation":["“azo-”表示“偶氮”（含 -N=N- 的化学结构），这类染料通常颜色鲜艳、用途广，但在不同国家/行业中对其安全与合规要求可能不同。若你是在食品、化妆品或纺织领域看到该词，建议对照具体法规与产品标准确认其允许用途。","该词较少见，实际文献中也可能以连字符或大小写变体出现（如 azo-coralline / Azo Coralline）。如果你能提供看到它的句子或领域（染色、材料、食品等），我可以帮你更精确地对应到具体化学品或用法。"]}
{"word":"azocorinth","summary":{"en":"Azocorinth is a (mostly historical) synthetic azo dye used to make a deep purplish‑red color.","zh":"Azocorinth 指一种（多见于旧资料的）合成偶氮染料，用于呈现深紫红/酒红色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a synthetic azo dye that produces a deep purplish‑red (“corinth”) color, formerly used in coloring textiles, inks, or paints","zh":"一种合成偶氮染料，可呈现深紫红色（“科林斯红/葡萄酒红”），过去常用于纺织品、油墨或颜料着色"},"examples":[{"en":"The sample was tinted with azocorinth to achieve a deep wine‑red shade.","zh":"样品用 azocorinth 着色，以得到深葡萄酒红的色调。"},{"en":"Older dye catalogs list azocorinth among early synthetic reds.","zh":"较早的染料目录把 azocorinth 列为早期的合成红色染料之一。"}]}],"synonyms":["azo dye","synthetic dye","corinth red dye"],"phonetic":"/ˌeɪzoʊˈkɔrɪnθ/","extraExplanation":["“azo-”表示“偶氮-”，常见于偶氮染料名称（含—N=N—结构），这类染料在19世纪后期到20世纪初广泛用于纺织印染。","“corinth”在颜色语境里常指一种深红紫/酒红色（类似“corinthian red / wine red”），因此 azocorinth 的命名多半是在说明它呈现的色相而非产地。"]}
{"word":"azocyanide","summary":{"en":"Azocyanide is a technical chemistry term for a compound containing both an azo (–N=N–) group and a cyanide (–CN) group.","zh":"Azocyanide 是化学专业术语，指同时含偶氮基（–N=N–）与氰基（–CN）的化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound that contains an azo group (–N=N–) and a cyanide group (–CN); used mainly as a technical term in chemistry.","zh":"（化学）含有偶氮基（–N=N–）与氰基（–CN）的化合物；主要用于化学专业语境的术语。"},"examples":[{"en":"Azocyanide is a specialized term you may see in organic chemistry texts rather than in everyday English.","zh":"Azocyanide 是一个更常见于有机化学教材、而非日常英语的专业词。"},{"en":"The paper discussed the stability of an azocyanide intermediate under different temperatures.","zh":"这篇论文讨论了某种 azocyanide 中间体在不同温度下的稳定性。"}]}],"synonyms":["azo cyanide","azo nitrile (related term)"],"phonetic":"/ˌeɪzoʊˈsaɪənaɪd/","extraExplanation":["词形拆解：azo- 表示“偶氮（含 –N=N–）”，cyanide 表示“氰化物/氰基（–CN）”。因此 azocyanide 通常是按结构来命名的化学术语。","使用与安全：含“cyanide/氰”相关结构的物质往往具有潜在毒性或危险性；即使只是结构命名，也应避免在非专业条件下接触或处理。","语料频率：该词较少出现在通用词典中，更常见于学术论文、专利或化学数据库。"]}
{"word":"azocyclic","summary":{"en":"Azocyclic means “related to a cyclic compound involving an azo (–N=N–) linkage.”","zh":"Azocyclic 意为“与含偶氮键（–N=N–）的环状化合物相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Describing a ring-shaped (cyclic) compound that contains an azo group (–N=N–) as part of the structure, or is otherwise characterized by an azo linkage in a cyclic system.","zh":"（化学）指含有偶氮基（–N=N–）并与环状（环系）结构相关的化合物；即偶氮键位于环结构中或与环系相连、具有代表性。"},"examples":[{"en":"Researchers synthesized an azocyclic compound to study how light can trigger changes in its shape.","zh":"研究人员合成了一种偶氮环状化合物，用来研究光如何触发其构型变化。"},{"en":"Some azocyclic dyes show strong color changes under UV light.","zh":"一些偶氮环状染料在紫外光下会出现明显的变色现象。"}]}],"synonyms":["azo-containing cyclic","azo-cyclic"],"phonetic":"ˌeɪzoʊˈsaɪklɪk","extraExplanation":["“azocyclic”是较少见的术语，常出现在有机/材料化学语境中。学习时要特别留意它可能被写成或被误用为“azacyclic（氮杂环的）”：azacyclic 指“环里含氮原子（N）”，而 azocyclic 强调的是“偶氮键 –N=N–”。如果你是在论文或专利里看到该词，最好结合结构式或上下文确认具体指的是哪一类。"]}
{"word":"azodicarboxylic","summary":{"en":"Azodicarboxylic describes chemicals containing an azo (–N=N–) group and carboxyl-related groups, often mentioned in names of organic reagents.","zh":"azodicarboxylic 用于描述含偶氮（–N=N–）与羧酸相关基团的化学结构，常见于有机试剂/化合物名称中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a chemical structure that contains an azo group (–N=N–) together with carboxyl groups (–COOH) or carboxylate-related groups (e.g., esters).","zh":"（化学）指含有偶氮基（–N=N–）并同时含有羧基（–COOH）或与羧酸相关的基团（如酯基）的；偶氮二羧基的。"},"examples":[{"en":"Azodicarboxylic compounds are often used as strong oxidizing or activating reagents in organic synthesis.","zh":"偶氮二羧基化合物常被用作有机合成中的强氧化剂或活化试剂。"},{"en":"Diethyl azodicarboxylate (DEAD) is a well-known azodicarboxylic reagent.","zh":"偶氮二甲酸二乙酯（DEAD）是一种著名的偶氮二羧基试剂。"}]}],"synonyms":["azo-dicarboxylic (hyphenated form)"],"phonetic":"/ˌeɪzoʊˌdaɪkɑrˈbɑksɪlɪk/","extraExplanation":["“azodicarboxylic”多见于化学命名中，常用来修饰具体物质名称，如：azodicarboxylic acid（偶氮二羧酸）、diethyl azodicarboxylate（偶氮二甲酸二乙酯，缩写DEAD）。在有机化学里，这类试剂常与Mitsunobu反应等内容一起出现。","构词拆解有助记忆：azo-（偶氮，指–N=N–）+ di-（二）+ carboxyl-（羧基）+ -ic（形容词后缀）。"]}
{"word":"azodiphenyl","summary":{"en":"Azodiphenyl is another name for azobenzene, an azo compound with two phenyl rings linked by –N=N–, used especially in dyes and research.","zh":"Azodiphenyl 是偶氮苯（azobenzene）的别称，是由 –N=N– 连接两个苯环的偶氮化合物，常见于染料与科研领域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound also known as azobenzene (C6H5–N=N–C6H5), consisting of two phenyl rings linked by an azo (–N=N–) group; used in dyes and in chemical research.","zh":"一种化学物质，又称“偶氮苯”（C6H5–N=N–C6H5），由两个苯基通过偶氮基（–N=N–）连接而成；常用于染料及化学研究。"},"examples":[{"en":"Azodiphenyl (azobenzene) is a classic example of an azo compound.","zh":"azodiphenyl（偶氮苯）是偶氮化合物的经典例子。"},{"en":"Some azo dyes are made from compounds related to azodiphenyl.","zh":"一些偶氮染料由与 azodiphenyl 相关的化合物制成。"},{"en":"In the lab, azodiphenyl can undergo light-driven changes in shape (isomerization).","zh":"在实验室里，azodiphenyl 可能发生由光驱动的构型变化（异构化）。"}]}],"synonyms":["azobenzene","diphenyl azo compound"],"phonetic":"/ˌeɪzoʊˈdaɪfɛnəl/","extraExplanation":["“azo-” 表示含有偶氮基（–N=N–），“diphenyl” 指“两个苯环/两个苯基”。因此 azodiphenyl 这个名称直观地描述了它的结构：两个苯环被 –N=N– 连接。","在现代教材与研究中，这个物质更常用名称是 azobenzene（偶氮苯）。它常被用来讲解“顺反异构（E/Z 或 trans/cis）”与“光致异构化”等概念，也与偶氮染料的发展史有关。"]}
{"word":"azodisulphonic","summary":{"en":"Azodisulphonic is a chemistry adjective meaning “related to or containing an azo group with disulfonic (sulfonic acid) features,” often referring to azodisulphonic acid or similar compounds.","zh":"azodisulphonic 是化学用形容词，表示“与偶氮二磺酸有关或含有偶氮结构并带有二磺酸（磺酸）特征”，常用于指偶氮二磺酸或类似化合物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Relating to or containing the chemical group found in azodisulphonic acid (an “azo-” unit linked to sulfonic acid groups).","zh":"（化学）与偶氮二磺酸有关的；含有偶氮（azo）结构并带有磺酸基/二磺酸基特征的。"},"examples":[{"en":"Azodisulphonic compounds are mainly discussed in advanced inorganic and industrial chemistry.","zh":"偶氮二磺酸类化合物主要出现在较深入的无机与工业化学讨论中。"},{"en":"In the paper, an azodisulphonic intermediate was proposed before the final product formed.","zh":"论文提出在最终产物生成前会出现一个偶氮二磺酸型的中间体。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Referring specifically to azodisulphonic acid itself or its salts, depending on context.","zh":"（较少见）在语境中也可专指“偶氮二磺酸”本身或其盐类。"},"examples":[{"en":"The reagent was described as azodisulphonic in older sources, though modern texts often use a different standardized name.","zh":"一些较旧资料把该试剂写作“azodisulphonic”，但现代教材更常用规范化的命名。"}]}],"synonyms":["azodisulfonic (US spelling)","azo-disulfonic"],"phonetic":"/ˌeɪzoʊdaɪsʌlˈfɑːnɪk/","extraExplanation":["“azo-”表示含有–N=N–（偶氮）键；“disulphonic/ disulfonic”表示含有两个与磺酸相关的官能团。英式拼写常见“sulph-”（如 sulphonic），美式多用“sulf-”（如 sulfonic）。在现代化学命名中，这类词更常作为系统命名的一部分出现，而不是日常英语词汇。"]}
{"word":"azoeosin","summary":{"en":"A lab dye (an azo form of eosin) used mainly for staining or fluorescence in microscopy.","zh":"一种实验室用染料（曙红的偶氮衍生物），主要用于显微镜下的染色或荧光观察。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a red fluorescent dye made by combining an azo group with eosin; used mainly in laboratories (especially microscopy and histology) for staining tissues or as a tracer.","zh":"一种把“偶氮基（azo）”与“曙红（eosin）”结合制成的红色荧光染料；主要用于实验室（尤其显微镜/组织学）中的组织染色或作为示踪剂。"},"examples":[{"en":"The lab used azoeosin to stain thin tissue sections for microscopic observation.","zh":"实验室用 azoeosin 给薄的组织切片染色，以便在显微镜下观察。"},{"en":"Under the right light, azoeosin can fluoresce and help highlight specific structures.","zh":"在合适的光照下，azoeosin 会发出荧光，帮助突出某些结构。"}]}],"synonyms":["azo dye","eosin-based dye","histological stain"],"phonetic":"/ˌeɪzoʊˈiːoʊsɪn/","extraExplanation":["词形提示：azoeosin = azo（偶氮，常见于“偶氮染料”）+ eosin（曙红，一类常用于生物染色的染料）。","使用场景多在生物/医学实验室语境中；日常英语里很少出现，更多见于实验步骤、试剂清单或组织学染色方法描述。"]}
{"word":"azoerythrin","summary":{"en":"Azoerythrin is a rare technical word for a red azo-type pigment or dye.","zh":"Azoerythrin 是一个较少见的专业词，指红色的偶氮类色素或染料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a red pigment or dye that belongs to the azo (–N=N–) chemical family; a rare, technical term mainly seen in older chemistry/biology writing","zh":"偶氮红色素／染料：属于“偶氮（–N=N–）”化学家族的一类红色色素或染料；较罕见，多见于较旧的化学或生物学文献"},"examples":[{"en":"Azoerythrin was described as a red azo pigment in early laboratory notes.","zh":"在早期的实验记录中，azoerythrin 被描述为一种红色的偶氮色素。"},{"en":"The paper mentions azoerythrin, but it is not a common term in modern textbooks.","zh":"这篇论文提到 azoerythrin，但它在现代教材里并不常见。"}]}],"synonyms":["red azo dye","azo pigment","red dye"],"phonetic":"/ˌeɪzoʊɪˈrɪθrɪn/","extraExplanation":["词形拆解有助于理解：azo- 通常指“偶氮”（含 –N=N– 结构），eryth- / erythrin 与“红色”相关（如 erythrocyte=红细胞）。因此该词整体含义可理解为“偶氮类的红色染料/色素”。","这是非常专业且少见的词；若你是在阅读论文或旧书遇到它，常可用更通用的说法替换：red azo dye（红色偶氮染料）或 azo pigment（偶氮颜料）。"]}
{"word":"Azof","summary":{"en":"“Azof” is an uncommon spelling of “Azov,” referring to the Sea of Azov or the city of Azov.","zh":"“Azof”是“Azov（亚速）”的少见拼法，常指亚速海或亚速市。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A less common English spelling of “Azov,” used in some older maps or transliterations; it usually refers to the Sea of Azov (a sea connected to the Black Sea) or the city of Azov in southern Russia.","zh":"“Azov（亚速）”的不太常见英文拼写，多见于旧地图或不同转写方式；通常指亚速海（与黑海相连的海域）或俄罗斯南部的亚速市。"},"examples":[{"en":"Some historical sources spell the name as “Azof,” but modern English usually uses “Azov.”","zh":"一些历史资料把它拼作“Azof”，但现代英语通常用“Azov”。"},{"en":"The Sea of Azov is sometimes labeled “Sea of Azof” in older English texts.","zh":"在较旧的英文文本里，亚速海有时会标注为“Sea of Azof”。"}]}],"synonyms":["Azov","Sea of Azov"],"phonetic":"/əˈzɔf/","extraExplanation":["“Azof”主要属于音译/转写差异：同一个俄语地名（Азов）在不同年代、不同语言系统里会出现不同拼法。学习时可把它当作“Azov”的变体拼写，检索资料时用“Azov”通常更容易找到现代信息。"]}
{"word":"azofication","summary":{"en":"Azofication is a chemistry term meaning the formation of an azo (–N=N–) compound, especially in dye-making.","zh":"Azofication 是化学术语，指生成含 –N=N– 偶氮基的化合物，尤用于制备偶氮染料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) The process of forming an azo compound (a molecule containing an –N=N– “azo” group), often used in making azo dyes.","zh":"（化学）偶氮化：生成偶氮化合物（含 –N=N–“偶氮”基）的过程，常见于偶氮染料的制备。"},"examples":[{"en":"In dye chemistry, azofication is used to create bright, stable colors for fabrics.","zh":"在染料化学中，偶氮化常用于制造颜色鲜艳且稳定的织物染料。"},{"en":"The lab report described azofication as the key step that produced the azo dye.","zh":"实验报告把偶氮化描述为生成偶氮染料的关键步骤。"}]}],"synonyms":["azo coupling","azo dye formation","azo compound formation"],"phonetic":"/ˌeɪzoʊfɪˈkeɪʃən/","extraExplanation":["“azofication”是比较少见、偏专业的词，多出现在有机化学/染料工业语境。更常见的相关表达包括“azo coupling（偶氮偶合反应）”“azo dye formation（偶氮染料生成）”。","偶氮染料（azo dyes）在纺织与印染史上非常重要，因为它们能提供多种鲜艳色彩；但部分偶氮染料可能在特定条件下分解产生芳香胺，因此现代使用会受到法规与安全评估的约束。"]}
{"word":"azofier","summary":{"en":"“Azofier” isn’t recognized as a standard English word; it’s probably a misspelling or a name.","zh":"“azofier”不是标准英语词；很可能是拼写错误或名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling, a brand/name, or a rare technical coinage (possibly based on the prefix “azo-,” related to nitrogen compounds and dyes).","zh":"不是标准英语词。更可能是拼写错误、品牌/名字，或非常少见的技术造词（可能来自前缀“azo-”，与含氮化合物、偶氮染料有关）。"},"examples":[{"en":"I can’t find “azofier” in major dictionaries—could you share the sentence you saw it in?","zh":"我在主流词典里查不到“azofier”——你能把看到它的句子发我吗？"},{"en":"If you meant “ozonifier,” it refers to a device that produces ozone.","zh":"如果你想写的是“ozonifier”，它指“臭氧发生器/产生臭氧的装置”。"}]}],"synonyms":["(no standard synonyms—unclear meaning)"],"phonetic":"/əˈzoʊ.faɪ.ɚ/","extraExplanation":["“azo-”是一个常见的化学前缀，来自表示“氮”的词根，常见于“azo dye（偶氮染料）”“azo compound（偶氮化合物）”。如果“azofier”出现在化工/材料语境里，可能是某种“使……偶氮化/引入偶氮基团”的装置或药剂的非标准写法或商标名。","如果你提供上下文（完整句子、领域：化学/游戏ID/产品名等），我可以更准确判断它到底想表达哪个词，并给出正确拼写与含义。"]}
{"word":"azoflavine","summary":{"en":"Azoflavine is a yellow synthetic dye used mainly for staining and other lab purposes, and it was sometimes used historically as an antiseptic.","zh":"Azoflavine 指一种黄色合成染料，主要用于实验室染色等用途；历史上也曾被用作消毒剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a yellow synthetic dye (an azo dye), used especially in laboratories and sometimes historically as an antiseptic or biological stain","zh":"（一种）黄色合成染料（偶氮染料），常用于实验室；历史上也曾用于消毒或作为生物染色剂"},"examples":[{"en":"The technician used azoflavine to stain the sample for easier viewing under the microscope.","zh":"技术员用 azoflavine 给样本染色，以便在显微镜下更容易观察。"},{"en":"Early medical texts mention azoflavine as a topical antiseptic, though it is less common today.","zh":"早期医学文献提到 azoflavine 可外用作消毒剂，但如今已不太常见。"}]}],"synonyms":["azo dye","yellow dye","biological stain"],"phonetic":"/ˌeɪzoʊˈfleɪviːn/","extraExplanation":["“azo-”表示“偶氮（—N=N—）”，这类结构常见于合成染料，因此 azoflavine 通常指“偶氮类的黄色染料”。","由于是化学品名称/商品名用法可能因地区与年代而异，在论文或说明书里最好结合配方、CAS 号或具体用途来确认指的是哪一种具体染料。"]}
{"word":"azoformamide","summary":{"en":"Azoformamide is a specialized chemistry term for an azo-containing amide compound used as a blowing agent to make foam materials.","zh":"Azoformamide 是化学专业词，指含偶氮基的酰胺类化合物，常用作发泡剂制造泡沫材料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound containing an azo group (–N=N–) and amide groups, used mainly as a blowing/foaming agent (a substance that releases gas) in making foam plastics and rubber.","zh":"一种含有偶氮基（–N=N–）和酰胺基的化学化合物，主要用作发泡剂（释放气体的物质），用于制造泡沫塑料和橡胶等材料。"},"examples":[{"en":"Azoformamide can be added to certain plastics to help create a lightweight foam structure.","zh":"在某些塑料中加入 azoformamide 可帮助形成轻质的泡沫结构。"},{"en":"During heating, the blowing agent (such as azoformamide) releases gas that expands the material.","zh":"加热过程中，发泡剂（如 azoformamide）会释放气体，使材料膨胀。"}]}],"synonyms":["blowing agent","foaming agent"],"phonetic":"/ˌeɪzoʊfɔrˈmæmaɪd/","extraExplanation":["这是较偏专业的化工词汇，常见于材料工程、塑料/橡胶配方与“发泡剂（blowing agent）”相关的技术文本中。","名称可拆解理解：azo- 表示“偶氮（含 –N=N–）”；-formamide 表示与“甲酰胺/酰胺”相关的结构。理解词根有助于你在化学英文里推测词义。","与它相关的更常见术语包括 blowing agent（发泡剂）、foam（泡沫材料）、decompose on heating（受热分解）等。"]}
{"word":"azoformic","summary":{"en":"A rare chemistry adjective meaning “related to azoformic acid/azoformic compounds.”","zh":"一个较少见的化学形容词，表示“与偶氮甲酸（及其化合物）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Relating to azoformic acid or its derivatives; containing an –N=N– (azo) group attached to formic-acid–like carboxyl groups.","zh":"（化学）与偶氮甲酸（azoformic acid）或其衍生物有关的；含有 –N=N–（偶氮）基团并与类似甲酸/羧酸基团相连的。"},"examples":[{"en":"The paper describes the preparation of an azoformic compound used as an oxidizing reagent.","zh":"论文描述了制备一种用作氧化试剂的偶氮甲酸类化合物。"},{"en":"Azoformic derivatives are mainly discussed in older organic-chemistry literature.","zh":"偶氮甲酸衍生物主要见于较早的有机化学文献中。"}]}],"synonyms":["azodicarboxylic (technical)","azo (in chemistry contexts)"],"phonetic":"/ˌeɪzoʊˈfɔrmɪk/","extraExplanation":["这是非常专业且较少见的词，多用于旧式或特定学术语境。日常英语几乎不会用到。","azo- 表示“偶氮”，指 –N=N– 这一类结构；formic 表示“甲酸的/与甲酸有关的”。因此 azoformic 通常是在描述“含偶氮结构且与羧酸体系相关”的化合物或性质。","在现代文献中，相关概念更常用更具体的名称（例如直接写出化合物名，如 azodicarboxylic 等），而不是用 azoformic 这一较老的形容词。"]}
{"word":"azofy","summary":{"en":"“Azofy” isn’t a standard English word; it’s likely a name or invented term with meaning that depends on context.","zh":"“Azofy” 不是标准英语单词；更可能是名字或自造词，含义取决于具体语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as a made-up term (e.g., a username, brand name, or character name) without a fixed dictionary meaning.","zh":"不是标准英语词汇；更常见于自造词（如用户名、品牌名或角色名），没有固定的词典释义。"},"examples":[{"en":"Azofy is my online handle on gaming platforms.","zh":"Azofy 是我在游戏平台上的网名。"},{"en":"I couldn’t find a dictionary meaning for “azofy.”","zh":"我查不到 “azofy” 的词典释义。"}]}],"phonetic":"/əˈzoʊfi/","extraExplanation":["“azofy” 看起来更像专有名称或自造词，而不是通用英语单词。如果你是在某个句子、歌曲、游戏、社群里看到的，它可能在那个圈子里有特定含义。你可以把原句发我，我就能根据上下文判断更准确的意思。","也有可能是拼写误差：比如你想查的是某个相近拼写的词。把你想表达的中文意思告诉我（例如“搞笑/傻乎乎/让人尴尬”等），我也可以帮你找到最合适的英文单词。"]}
{"word":"azogallein","summary":{"en":"“Azogallein” is a Tolkien-related fictional battle cry meaning “to war/to battle.”","zh":"“Azogallein”是托尔金相关的虚构战斗呼号，意为“上战场/开战”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A cry in Tolkien’s fictional language used as a battle-chant meaning “to war!” or “to battle!”","zh":"托尔金虚构语言中的战斗呼号，意思类似“上战场！”“开战！”"},"examples":[{"en":"In the story, the characters shout “Azogallein!” before charging into battle.","zh":"在故事里，角色们在冲锋前高喊“Azogallein！”"},{"en":"The chant “Azogallein!” signals that the fight is about to begin.","zh":"“Azogallein！”这个呼号表示战斗即将开始。"}]}],"synonyms":["to war!","to battle!","charge!","attack!"],"phonetic":"/ˌɑːzoʊɡəˈleɪn/","extraExplanation":["“Azogallein”并不是现代英语单词，而是J.R.R.托尔金作品相关的虚构语汇（常被视作奥克语/黑暗阵营的喊声）。它通常被理解为类似口号式的“to war / to battle”。","在真实写作或口语中一般不会用到；更多出现在奇幻文学讨论、同人作品、角色扮演（LARP/桌游）或引用《霍比特人》《指环王》相关语境时。","发音在粉丝圈可能略有差异；如果你是在某本书、电影字幕或游戏里看到的，也可以把原句发我，我能帮你确认它在那一幕的具体用法与情绪色彩。"]}
{"word":"azogreen","summary":{"en":"Azogreen usually refers to a green azo dye/pigment (often as a product name) used to color materials.","zh":"Azogreen 通常指一种绿色偶氮染料/颜料（也常作商品名），用于给材料着色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a synthetic green dye/pigment in the azo-dye family, used for coloring materials (often in textiles, inks, or laboratory staining), sometimes appearing as a product/brand name","zh":"一种偶氮类（azo）合成绿色染料/颜料，用于给材料着色（常见于纺织、油墨或实验室染色），有时也以产品/品牌名形式出现"},"examples":[{"en":"The fabric was dyed with an azo green colorant to achieve a bright, stable green.","zh":"为了得到鲜亮且稳定的绿色，这块布使用了偶氮绿色染料进行染色。"},{"en":"Check the label carefully—some azo dyes have usage restrictions in certain countries.","zh":"要仔细查看标签——某些偶氮染料在一些国家/地区有使用限制。"}]}],"synonyms":["Azo Green","azo dye","synthetic dye","colorant"],"phonetic":"ˈeɪzoʊ ɡriːn","extraExplanation":["“azo-”来自含有 -N=N-（偶氮键）的化学结构。偶氮染料颜色范围很广，常用于工业染色；但不同具体化学品的安全性与法规要求差异很大。","“Azogreen / Azo Green”有时是非标准拼写或商品名；如果你能提供出现它的上下文（例如产品成分表、论文、包装或句子），我可以更精确地对应到具体化学名称或用途。"]}
{"word":"azogrenadine","summary":{"en":"“Azogrenadine” is not a standard English word; it may be a name or a blend suggesting “azo dye–colored grenadine syrup.”","zh":"“azogrenadine”不是标准英语词；可能是专有名词，或指“用偶氮染料上色的 grenadine（石榴糖浆）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or unclear term; it is not a common English word found in major dictionaries. It may be a made-up word, a brand/user name, or a misspelling.","zh":"非标准或含义不清的词；在主要英语词典中不常见。可能是自造词、品牌/用户名，或拼写错误。"},"examples":[{"en":"I couldn’t find “azogrenadine” in a dictionary—did you mean “grenadine”?","zh":"我在词典里找不到“azogrenadine”——你是不是想写“grenadine（石榴糖浆）”？"},{"en":"If “azogrenadine” is a product name, please share a sentence or a link so I can explain it accurately.","zh":"如果“azogrenadine”是产品名，请给我一个例句或链接，我才能更准确地解释。"}]},{"partOfSpeech":"other","definition":{"en":"(Possible interpretation) A blend of “azo-” (relating to certain chemical dyes) + “grenadine” (a sweet syrup used in drinks), suggesting grenadine colored with an azo dye.","zh":"（可能的解释）由“azo-（与某些化学偶氮染料有关）”+“grenadine（用于饮料的甜糖浆/石榴糖浆）”拼合而成，暗示“用偶氮染料上色的石榴糖浆”。"},"examples":[{"en":"Some inexpensive “grenadine” syrups use red food coloring rather than real pomegranate.","zh":"一些便宜的“grenadine（石榴糖浆）”会用红色食用色素，而不是真正的石榴。"},{"en":"If you meant “azo + grenadine,” you might be talking about artificial coloring in drink syrup.","zh":"如果你指的是“azo + grenadine”，那可能是在说饮料糖浆里的人工色素。"}]}],"synonyms":["grenadine","red food coloring","azo dye"],"phonetic":"ˌeɪzoʊˈɡrɛnəˌdin","extraExplanation":["“azo- / 偶氮-”常见于化学词汇，指含有 -N=N- 结构的一类化合物；许多红色/橙色的合成染料属于偶氮染料（也用于某些食用色素）。","“grenadine”在英语里通常指鸡尾酒/气泡水里用的甜糖浆，传统上带石榴风味；但在商业产品中也可能主要是糖浆+香精+色素。","如果你是在小说、游戏或特定社区里看到“azogrenadine”，它也可能是专有名词（角色名、昵称、品牌名）。给我上下文我可以更精确地释义。"]}
{"word":"azohumic","summary":{"en":"A rare scientific adjective meaning “related to humic substances that contain or are modified with an azo (–N=N–) group.”","zh":"一个较少见的科学形容词，表示“与含偶氮（–N=N–）结构或被偶氮基团改性的腐殖质/腐殖酸类物质有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry/soil science) Relating to azo- compounds (with an –N=N– group) that are associated with humic substances, or to humic material modified by azo (–N=N–) groups.","zh":"（化学/土壤科学）指与腐殖质有关的偶氮化合物（含 –N=N– 基团），或指被引入偶氮（–N=N–）基团而改性的腐殖质/腐殖酸类物质。"},"examples":[{"en":"Researchers compared the binding ability of azohumic material with regular humic acid.","zh":"研究人员比较了偶氮腐殖质材料与普通腐殖酸的结合能力。"},{"en":"Azohumic compounds can change how dyes or metals interact with soil organic matter.","zh":"偶氮腐殖质化合物可能改变染料或金属与土壤有机质的相互作用。"}]}],"synonyms":["azo-humic","humic (context-dependent)"],"phonetic":"/ˌeɪzoʊˈhjuːmɪk/","extraExplanation":["“azohumic”非常少见，多出现在专业论文（如土壤化学、环境化学、染料/吸附研究）中。日常英语里几乎不用。","词形可拆解理解：azo- 表示“偶氮（–N=N–）”，humic 表示“腐殖质的/腐殖酸相关的”。因此它通常是描述某类与腐殖质相关、并带有偶氮结构的物质或材料。","如果你是在文献里看到它，也可能与更常见的词一起出现，如 humic acid（腐殖酸）、azo dye（偶氮染料）、soil organic matter（土壤有机质）。"]}
{"word":"azoic","summary":{"en":"Azoic means “without life,” especially in geology or biology.","zh":"azoic 指“无生命的”，多用于地质或生物语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Geology/biology) Not containing life; relating to a time or place where no living organisms exist or existed.","zh":"（地质/生物）无生命的；指不存在或曾不存在生物的时期或环境。"},"examples":[{"en":"Scientists once described some ancient rock layers as azoic, meaning they found no fossils there.","zh":"科学家曾把一些古老的岩层描述为“azoic（无生命的）”，意思是在那里没有发现化石。"},{"en":"Near a volcanic vent, the water can be temporarily azoic because of extreme heat and chemicals.","zh":"在火山喷口附近，水体可能因极端高温和化学物质而暂时呈现无生命状态。"}]}],"synonyms":["lifeless","barren","uninhabited","sterile"],"phonetic":"/eɪˈzoʊɪk/","extraExplanation":["词源提示：a- 表示“无/不”，zo- 来自希腊语 zōion（动物/生物），-ic 表示“……的”。所以 azoic 字面意思就是“没有生命的”。","使用场景：azoic 常用于地质年代或环境描述（如早期地球、缺乏化石的地层），也可用于强调某处因条件极端而“暂时没有生命迹象”。日常英语里更常用 lifeless 或 barren。"]}
{"word":"azoimide","summary":{"en":"Azoimide is an old term for hydrazoic acid (HN₃), a very toxic and potentially explosive acid.","zh":"Azoimide 是叠氮酸/氢叠氮酸（HN₃）的旧称，是一种剧毒且可能爆炸的酸。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a highly poisonous, explosive chemical acid with the formula HN₃; also called hydrazoic acid","zh":"一种剧毒且具有爆炸性的化学酸，化学式为 HN₃；也叫“叠氮酸 / 氢叠氮酸（hydrazoic acid）”"},"examples":[{"en":"Azoimide is an older name for hydrazoic acid (HN₃).","zh":"Azoimide 是 hydrazoic acid（HN₃，叠氮酸/氢叠氮酸）的旧称。"},{"en":"Because azoimide can be explosive, it must be handled only with proper safety procedures.","zh":"由于 azoimide 可能具有爆炸性，必须在严格的安全规范下操作。"}]}],"synonyms":["hydrazoic acid","HN3"],"phonetic":"/ˌeɪzoʊˈaɪmaɪd/","extraExplanation":["“azoimide”多见于较早的化学文献中，现代更常用名称是“hydrazoic acid（叠氮酸/氢叠氮酸）”。","该物质具有强毒性和潜在爆炸危险；学习或查阅资料时若涉及实验操作，应以正规安全指南与专业人员指导为准。"]}
{"word":"azoisobutyronitrile","summary":{"en":"Azoisobutyronitrile (AIBN) is a chemical used to start free‑radical reactions, especially polymerization.","zh":"偶氮二异丁腈（AIBN）是一种常用的自由基引发剂，尤其用于聚合反应。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (often shortened to AIBN) used as a free‑radical initiator, especially to start polymerization reactions in making plastics and resins.","zh":"一种化学化合物（常缩写为 AIBN），常用作自由基引发剂，尤其用于启动聚合反应，以制备塑料和树脂等材料。"},"examples":[{"en":"AIBN (azoisobutyronitrile) is commonly used to initiate radical polymerization in the lab.","zh":"在实验室里，AIBN（azoisobutyronitrile，偶氮二异丁腈）常用于引发自由基聚合。"},{"en":"The reaction mixture was heated so that azoisobutyronitrile could decompose and generate radicals.","zh":"将反应混合物加热，使偶氮二异丁腈分解并产生自由基。"}]}],"synonyms":["AIBN","2,2'-azobis(2-methylpropionitrile)"],"phonetic":"/ˌæzoʊˌaɪsoʊbjuːtəˌroʊnaɪˈtrɪl/","extraExplanation":["Azoisobutyronitrile 的常见缩写是 AIBN；在化学文献中你更常看到这个缩写。","它受热会分解产生自由基并放出氮气，因此常被用作“引发剂”。这也是为什么很多实验会在加热条件下使用它。","安全提示（学习用途）：AIBN 通常被标注为有危险性（如受热分解、可能有爆炸/火灾风险等）；实际使用应遵循实验室安全规范与化学品 SDS。"]}
{"word":"azole","summary":{"en":"An azole is a nitrogen‑containing five‑membered aromatic ring, and the term is also used for many “-azole” medicines, especially antifungals.","zh":"Azole（唑）指含氮的五元芳香杂环结构，也常用来泛指许多以“-azole”结尾的药物（尤其是抗真菌药）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of aromatic five‑membered ring in organic chemistry that contains nitrogen (and often other atoms such as oxygen or sulfur), found in many important compounds","zh":"（有机化学）一类含氮（常也含氧或硫等杂原子）的五元芳香杂环结构，常见于许多重要化合物中"},"examples":[{"en":"Imidazole is an azole ring found in many biological molecules.","zh":"咪唑是一种常见于许多生物分子中的唑类环结构。"},{"en":"Chemists study azoles because they appear in medicines and dyes.","zh":"化学家研究唑类化合物，因为它们出现在药物和染料中。"}]},{"partOfSpeech":"n.","definition":{"en":"a broad name for medicines—especially antifungals—whose chemical names often end in “-azole” (e.g., fluconazole, ketoconazole)","zh":"（广义）常指名称以“-azole”结尾的一类药物（尤其是抗真菌药），如 fluconazole（氟康唑）、ketoconazole（酮康唑）"},"examples":[{"en":"The doctor prescribed an azole to treat the fungal infection.","zh":"医生开了一种唑类药来治疗真菌感染。"},{"en":"Some azoles can interact with other medications, so ask a pharmacist.","zh":"一些唑类药可能与其他药物相互作用，所以可以咨询药师。"}]}],"synonyms":["azole ring","azole compound","five-membered heterocycle","(drug class) azole antifungal"],"phonetic":"ˈæzoʊl","extraExplanation":["“azole/唑”在化学命名里很常见：看到药名或化合物名以“-azole”结尾，往往提示它含有“唑类杂环”结构。很多抗真菌药属于这一类，但并不是所有“-azole”结尾的词都一定是药物，仍要看具体语境。"]}
{"word":"azoles","summary":{"en":"Azoles are nitrogen-containing ring compounds; in medicine, they often refer to azole antifungal drugs.","zh":"Azoles 指含氮五元杂环化合物；在医学语境中常指唑类抗真菌药。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of nitrogen-containing five-membered ring compounds in organic chemistry (the “azole” family), such as imidazole and triazole.","zh":"（有机化学）一类含氮的五元杂环化合物（“唑”类），如咪唑、三唑等。"},"examples":[{"en":"In organic chemistry, azoles are important building blocks for many medicines.","zh":"在有机化学中，唑类是许多药物的重要结构单元。"},{"en":"The researcher compared the reactivity of different azoles under the same conditions.","zh":"研究人员在相同条件下比较了不同唑类化合物的反应性。"}]},{"partOfSpeech":"n.","definition":{"en":"A class of antifungal drugs that contain an azole ring, used to treat fungal infections (e.g., fluconazole, ketoconazole).","zh":"（药物）含唑环的抗真菌药物类别，用于治疗真菌感染（如氟康唑、酮康唑）。"},"examples":[{"en":"Azoles are commonly prescribed for yeast infections.","zh":"唑类药物常用于治疗念珠菌（酵母菌）感染。"},{"en":"Some azoles can interact with other medicines, so patients should check with a doctor or pharmacist.","zh":"某些唑类药物可能与其他药物相互作用，因此患者应咨询医生或药师。"}]}],"synonyms":["azole compounds","azole antifungals","imidazoles","triazoles"],"phonetic":"/ˈeɪzoʊlz/","extraExplanation":["“Azoles”是“azole”的复数。很多抗真菌药英文名常以“-azole”结尾（如 fluconazole），这是因为它们的分子结构里含有“唑环”。","常见亚类包括 imidazoles（咪唑类）与 triazoles（三唑类）；在医学英语里，提到“azoles”往往指这一大类抗真菌药。"]}
{"word":"azolitmin","summary":{"en":"Azolitmin is the dye in litmus used to show acidity or basicity by changing color.","zh":"Azolitmin 指石蕊中的染料，用变色来显示溶液的酸性或碱性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a blue dye mixture obtained from litmus (from lichens), used as an acid–base indicator that turns red in acidic conditions and blue in basic conditions","zh":"石蕊（或石蕊素）中的一种蓝色染料混合物，可作酸碱指示剂：酸性变红，碱性变蓝"},"examples":[{"en":"The lab used azolitmin paper to check whether the solution was acidic or basic.","zh":"实验室用含石蕊染料的试纸来检测溶液是酸性还是碱性。"},{"en":"Azolitmin changes color around neutral pH, which makes it useful for quick tests.","zh":"石蕊染料在接近中性 pH 时会变色，因此适合做快速检测。"}]}],"synonyms":["litmus","litmus dye","litmus paper (related)"],"phonetic":"əˈzoʊlɪtˌmɪn","extraExplanation":["“azolitmin”在日常英语里不常见；更常见的说法是“litmus”或“litmus paper（石蕊试纸）”。","石蕊（litmus）传统上来自地衣提取物，常用于基础化学课做酸碱性初步判断；它不是精密测量 pH 的工具，但非常直观。"]}
{"word":"Azolla","summary":{"en":"Azolla is a small floating water fern often used as a natural fertilizer, especially in rice farming.","zh":"Azolla 指一种漂浮水面的微小蕨类（满江红），常用于农业（尤其稻田）作天然绿肥。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tiny floating water fern (genus Azolla), often found on ponds and rice fields; it is widely used in agriculture as a natural fertilizer because it helps add nitrogen to the water/soil.","zh":"满江红（Azolla 属），一种漂浮在水面的微小蕨类植物，常见于池塘和稻田；在农业中常用作天然绿肥，因为它能帮助增加水体/土壤中的氮。"},"examples":[{"en":"Farmers sometimes grow azolla in rice paddies to reduce the need for chemical fertilizer.","zh":"农民有时会在稻田里养殖满江红，以减少对化学肥料的需求。"},{"en":"A thin layer of azolla covered the pond like a green carpet.","zh":"一层薄薄的满江红像绿色地毯一样覆盖在池塘表面。"},{"en":"Researchers study azolla for its fast growth and ability to improve soil health.","zh":"研究人员研究满江红的快速生长能力以及它改善土壤健康的作用。"}]}],"synonyms":["mosquito fern","water fern"],"phonetic":"/əˈzɑːlə/","extraExplanation":["“Azolla”常被称为“mosquito fern（蚊子蕨）”。它与蓝藻（如念珠藻 Anabaena）共生，能够固氮，因此在水稻种植中常作为“绿肥”使用，也可帮助抑制部分杂草与减少藻类爆发。","词源来自新拉丁语属名 Azolla；在科学写作中通常首字母大写表示“属”（Azolla），日常语境可小写表示这种植物（azolla）。"]}
{"word":"azolla","summary":{"en":"Azolla is a small floating water fern, sometimes used in rice farming as a natural fertilizer.","zh":"Azolla（满江红）是一种漂浮水面的水生蕨类，有时用于稻作中作天然绿肥。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small floating water fern (genus Azolla), often found on ponds and rice fields; it can rapidly cover the water surface.","zh":"满江红（Azolla属），一种漂浮在水面的微小水生蕨类，常见于池塘和稻田；繁殖快，容易覆盖水面。"},"examples":[{"en":"Azolla formed a green mat on the pond after a week of warm weather.","zh":"温暖天气持续一周后，满江红在池塘表面形成了一层绿色“地毯”。"},{"en":"Some farmers grow azolla in rice paddies to improve the soil naturally.","zh":"一些农民在稻田里养满江红，用更自然的方式改良土壤。"}]}],"synonyms":["water fern","mosquito fern"],"phonetic":"əˈzɑlə","extraExplanation":["“Azolla”常被称为“水上绿肥”，因为它与固氮蓝藻共生（如Anabaena），能把空气中的氮转化为植物可用的养分，因此在部分地区的稻作体系里被用来减少化肥使用。","在生态管理中，满江红既可能有益（覆盖抑藻、提供栖息地），也可能造成问题（过度繁殖导致水体缺氧、影响其他水生生物），需视环境与管理方式而定。"]}
{"word":"azomethine","summary":{"en":"Azomethine is a chemistry term for compounds featuring the –CH=N– group (often called Schiff bases).","zh":"Azomethine 是化学术语，指含有 –CH=N– 基团的化合物（常称为席夫碱）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (or part of a compound) that contains the azomethine group, typically written as –CH=N–; many azomethines are also called Schiff bases.","zh":"一种（或含有某部分的）化学化合物，特征是含有偶氮甲烯基/亚胺键，通常写作 –CH=N–；许多“azomethine”也被称为席夫碱（Schiff base）。"},"examples":[{"en":"The dye’s color comes from an azomethine group in its structure.","zh":"这种染料的颜色来自其结构中的 azomethine（–CH=N–）基团。"},{"en":"In the lab, we prepared an azomethine by reacting an aldehyde with an amine.","zh":"在实验室里，我们通过让醛与胺反应来制备一种 azomethine（席夫碱）。"}]}],"synonyms":["Schiff base","imine"],"phonetic":"/ˌeɪzoʊˈmɛθiːn/","extraExplanation":["这是一个偏专业的有机化学词。很多教材更常用更通用的词是 imine（亚胺）或 Schiff base（席夫碱）；“azomethine”常用于强调 –CH=N– 这一官能团，尤其在染料、配位化学与材料化学的语境里。","词源上可拆为 azo-（含氮相关的构词成分）+ methine（“亚甲基/亚甲次基”相关的旧称），用来提示该结构中含氮并与碳形成双键。"]}
{"word":"azon","summary":{"en":"“Amazon” most commonly refers to the tech company; it can also mean the Amazon River/rainforest, or (less commonly) a woman warrior from Greek myth.","zh":"“Amazon”最常指亚马逊公司；也可指亚马逊河/雨林；较少见的意思是希腊神话中的女战士。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Amazon (proper noun): a large American technology and e-commerce company best known for online shopping, cloud computing (AWS), and digital services.","zh":"亚马逊（专有名词）：一家美国大型科技与电商公司，以网购平台、云计算（AWS）和数字服务闻名。"},"examples":[{"en":"I ordered the book on Amazon and it arrived the next day.","zh":"我在亚马逊上订了那本书，第二天就到了。"},{"en":"Many websites run on Amazon Web Services (AWS).","zh":"很多网站运行在亚马逊云服务（AWS）上。"}]},{"partOfSpeech":"other","definition":{"en":"the Amazon (proper noun): the Amazon River and the surrounding rainforest region in South America.","zh":"亚马逊（专有名词）：指南美的亚马逊河及其周围的热带雨林地区。"},"examples":[{"en":"The Amazon rainforest is home to incredible biodiversity.","zh":"亚马逊雨林拥有惊人的生物多样性。"},{"en":"Scientists study how climate change affects the Amazon River basin.","zh":"科学家研究气候变化如何影响亚马逊河流域。"}]},{"partOfSpeech":"n.","definition":{"en":"Amazon (noun, less common): a tall, strong woman; also from Greek myth, an “Amazon” was a woman warrior.","zh":"Amazon（名词，不太常用）：指高大强壮的女性；也源自希腊神话，指“亚马逊女战士”。"},"examples":[{"en":"In Greek myths, the Amazons were known as skilled warriors.","zh":"在希腊神话中，亚马逊人以善战著称。"},{"en":"The heroine is portrayed as an Amazon—brave and independent.","zh":"女主角被塑造成“亚马逊式”的人物——勇敢而独立。"}]}],"synonyms":["Amazon.com","the Amazon rainforest","Amazon River","AWS"],"phonetic":"/ˈæməˌzɑn/","extraExplanation":["你输入的“azon”在英语里通常不是一个常见单词；多数情况下人们想写的是“Amazon”。如果你本来要查的是别的词（比如拼写相近的 a zone / ozone / azone），告诉我上下文句子，我可以帮你精准定位。","“Amazon（亚马逊）”这个名称常被认为来自希腊语的“Amazones”（亚马逊女战士）。公司名借用了“规模巨大、覆盖广”的联想；而“the Amazon”作为地理名词通常特指亚马逊河与雨林区域。"]}
{"word":"azonal","summary":{"en":"Azonal means not following natural climatic/latitudinal zones, often because local conditions dominate.","zh":"Azonal 指“非地带性的”，不按气候/纬度自然分带分布，常因局地条件占主导。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not arranged in natural zones (especially climatic or latitudinal zones); not dependent on climate zones","zh":"非地带性的；不按自然地带（尤其是气候或纬度带）分布的；不受气候带控制的"},"examples":[{"en":"A river valley can create azonal vegetation that differs from the surrounding region.","zh":"河谷可能形成非地带性植被，与周围地区不同。"},{"en":"These wetlands are considered azonal because local water conditions matter more than latitude.","zh":"这些湿地被认为是非地带性的，因为当地水文条件比纬度更关键。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of soil) shaped mainly by local factors such as parent material, drainage, or topography rather than by regional climate","zh":"（指土壤）主要由母质、排水、地形等局地因素决定，而不是由区域气候决定的"},"examples":[{"en":"Sandy dunes often have azonal soils because the parent material dominates soil formation.","zh":"沙丘常见非地带性土壤，因为母质对成土过程起主导作用。"},{"en":"Mountain slopes can show azonal soil patterns over short distances.","zh":"山坡在很短距离内也可能呈现非地带性土壤分布。"}]}],"synonyms":["nonzonal","local","site-specific"],"phonetic":"/eɪˈzoʊnəl/","extraExplanation":["“azonal”常见于地理学、生态学、土壤学等学术语境，用来对比“zonal（地带性的）”。“地带性”强调随纬度/气候带呈规律分布；“非地带性”则强调由局部条件（如河流冲积、地下水、盐分、地形屏障、人类活动）造成的“打破规律”的分布。","词源上可理解为 a-（否定）+ zonal（地带性的），即“没有地带性特征”。在日常英语中较少使用，多见于专业文章或教材。"]}
{"word":"azonaphthalene","summary":{"en":"A chemical term for an azo compound based on a naphthalene ring, often related to azo dyes.","zh":"指以萘环为骨架、含偶氮基的化学物质，常与偶氮染料相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A compound in which an azo group (–N=N–) is attached to a naphthalene ring; often used as an intermediate or component in making azo dyes.","zh":"（化学）一种含有偶氮基（–N=N–）并与萘环相连的化合物；常作为偶氮染料的组成部分或合成中间体。"},"examples":[{"en":"Some azonaphthalene derivatives are used to produce bright, long-lasting dyes.","zh":"一些偶氮萘衍生物可用于制备色泽鲜艳、耐久的染料。"},{"en":"The lab synthesized an azonaphthalene compound to study its color and stability.","zh":"实验室合成了一种偶氮萘化合物，用来研究它的颜色和稳定性。"}]}],"synonyms":["azo naphthalene","azonaphthalene compound","azonaphthalene derivative"],"phonetic":"ˌeɪzoʊ ˈnæfθəliːn","extraExplanation":["“azo-”表示含有偶氮基（–N=N–），这类结构常见于“偶氮染料”（azo dyes），颜色通常来自分子中可吸收可见光的共轭体系。","“naphthalene（萘）”是由两个苯环融合而成的芳香族结构；当偶氮基连到萘环上时，往往会影响染料的颜色深浅与耐光性。","该词多出现在有机化学/染料化学语境中，日常英语里很少用；具体物质性质会因取代基不同而差异很大。"]}
{"word":"azonic","summary":{"en":"Azonic means “not zonal”—not following a zone-by-zone pattern, especially in geography or ecology.","zh":"Azonic 指“非地带性的”，即不按带状/分区规律分布（多见于地理与生态语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not arranged in zones or belts; not following the usual latitudinal “zonal” pattern (often used in geography, climate, soils, or ecology).","zh":"（尤用于地理、气候、土壤、生态等）非地带性的；不按常见的纬度“地带”规律分布的。"},"examples":[{"en":"Because of the mountains, rainfall here is azonic rather than neatly zonal.","zh":"由于山脉影响，这里的降雨分布是非地带性的，而不是整齐的带状分布。"},{"en":"The region has azonic vegetation shaped mainly by altitude and local winds.","zh":"该地区的植被呈非地带性，主要由海拔和局地风决定。"}]}],"synonyms":["azonal","nonzonal","non-zonal"],"phonetic":"/eɪˈzɑnɪk/","extraExplanation":["“azonic”由前缀 a-（表示“无、非”）+ zone（带、区）构成，字面意思是“没有地带/不成带”。学术写作中更常见的近义词是 **azonal**（非地带性的）。它常用来强调：某种分布/格局主要由局地因素（地形、海拔、洋流、风向、岩性等）决定，而不是由纬度带来的宏观分带规律决定。"]}
{"word":"azonium","summary":{"en":"A chemistry term for a positively charged species related to an azo (—N=N—) group, often occurring as an azonium salt.","zh":"化学术语：与偶氮（—N=N—）结构相关的带正电物种，常以偶氮鎓盐形式出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A positively charged ion (or compound) derived from an azo group (—N=N—), typically formed by protonation or substitution, and often found in certain dye-related reactions as an “azonium salt.”","zh":"（化学）由偶氮基（—N=N—）衍生出来的带正电的离子或化合物，通常因质子化或取代而形成，常以“偶氮鎓盐（azonium salt）”形式出现在某些染料相关反应中。"},"examples":[{"en":"Under strongly acidic conditions, some azo compounds can form an azonium ion.","zh":"在强酸条件下，一些偶氮化合物会形成偶氮鎓离子。"},{"en":"The paper discussed the stability of azonium salts used in dye synthesis.","zh":"这篇论文讨论了用于染料合成的偶氮鎓盐的稳定性。"}]}],"synonyms":["azo cation","azonium salt"],"phonetic":"/əˈzoʊniəm/","extraExplanation":["“azonium”主要出现在有机化学/染料化学语境中，和“azo（偶氮）”有关；“-onium”这个后缀常表示“带正电的离子”（如 ammonium 铵离子、oxonium 氧鎓离子），因此 azonium 也可理解为“与偶氮结构相关的阳离子/盐”。","它属于专业术语，日常英语中几乎不会用到；阅读化学文章时更常见到的相关词是 azo compound（偶氮化合物）、diazonium salt（重氮盐）等，注意 diazonium 与 azonium 不是同一个概念。"]}
{"word":"azons","summary":{"en":"“Azons” is most likely a misspelling of “Amazons”: women warriors in Greek myth, or things related to Amazon (the company).","zh":"“azons”很可能是“Amazons”的误拼：指希腊神话的亚马逊女战士，或与亚马逊公司相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Women warriors in Greek mythology; by extension, a strong, tall, or athletic woman.","zh":"（复数）希腊神话中的亚马逊女战士；引申为强壮、高大或擅长运动的女性。"},"examples":[{"en":"In Greek myths, the Amazons were fierce warriors who lived apart from men.","zh":"在希腊神话中，亚马逊人是勇猛的女战士，常被描写为与男性分居。"},{"en":"She’s an amazon on the basketball court—fast, strong, and fearless.","zh":"她在篮球场上像个“女战士”——又快又强，毫不畏惧。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) People or things connected with “Amazon,” especially the company Amazon or its services.","zh":"（复数）与“Amazon（亚马逊）”有关的人或事物，尤指亚马逊公司或其服务。"},"examples":[{"en":"Many sellers rely on Amazon’s marketplaces to reach customers.","zh":"许多卖家依靠亚马逊的平台来触达顾客。"},{"en":"Amazon’s delivery network has expanded quickly in recent years.","zh":"近年来，亚马逊的配送网络扩张得很快。"}]}],"synonyms":["women warriors","warrior women","strong woman","Amazon (company)"],"phonetic":"/ˈæməˌzɑnz/","extraExplanation":["“azons”很可能是拼写不完整或拼错，最常见对应是 **Amazons**（Amazon 的复数）。如果你想查的是别的词（比如人名、品牌或缩写），可以告诉我上下文句子。","**Amazon / Amazons** 在英语里有两个常见文化来源：①希腊神话中的“亚马逊女战士”；②现代公司 **Amazon**（电商与云服务等）。语境不同，含义差异很大。"]}
{"word":"azoology","summary":{"en":"“Azoology” is not standard; it is almost certainly meant to be “zoology” (the study of animals).","zh":"“azoology”不是标准词；几乎可以确定想写的是“zoology（动物学）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard) Likely a misspelling of “zoology”: the scientific study of animals.","zh":"（非标准用法）很可能是“zoology（动物学）”的拼写错误：研究动物的科学。"},"examples":[{"en":"I’m taking zoology this semester to learn about animal behavior.","zh":"我这学期要修动物学，学习动物行为。"},{"en":"Zoology covers topics like evolution, anatomy, and habitats.","zh":"动物学涵盖进化、解剖和栖息地等主题。"}]}],"synonyms":["animal science","study of animals","animal biology"],"phonetic":"/zoʊˈɑlədʒi/","extraExplanation":["“azoology”不是常见或标准英语单词；在作业、论文或考试中建议使用正确拼写“zoology”。","词根提示：zoo-（动物）+ -logy（……学/研究），合起来就是“动物学”。"]}
{"word":"azoospermia","summary":{"en":"Azoospermia means there are no sperm cells in the semen.","zh":"azoospermia 指精液中没有精子细胞的情况（无精子症）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the condition of having no sperm cells in the semen","zh":"无精子症；精液中没有精子细胞的状况"},"examples":[{"en":"After the lab test, the doctor explained that the semen sample showed azoospermia.","zh":"化验后，医生解释说精液样本显示为无精子症。"},{"en":"Azoospermia can be a cause of male infertility, but treatment depends on the reason.","zh":"无精子症可能导致男性不育，但治疗方式取决于具体原因。"}]}],"synonyms":["absence of sperm","aspermia (related but not identical)"],"phonetic":"/ˌeɪzoʊspɝˈmiə/","extraExplanation":["词源：azoo- 来自 a-（“没有”）+ zoo-（与“生命/动物”相关，源自希腊语 zōion“动物/生物”），-spermia 与 sperm（精子）相关，合起来表示“没有精子”。","医学语境里常见的两类：梗阻性无精子症（产生了精子但输精管道堵塞）与非梗阻性无精子症（睾丸产精功能受影响）。具体诊断通常需要多次精液分析，并结合激素检查、影像或遗传检测等，由专业医生评估。","拼写提示：a- + zoo + spermia，中间是 “zoo” 而不是 “zo”。"]}
{"word":"azoparaffin","summary":{"en":"A technical chemistry term for an azo-containing paraffin/alkane-like compound (with an –N=N– group).","zh":"化学术语：指含偶氮基（–N=N–）的石蜡类/烷烃样化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound that is essentially a paraffin (alkane-like hydrocarbon) containing an azo group (–N=N–); it is mainly a technical term used in organic chemistry, not common in everyday English.","zh":"一种含有偶氮基（–N=N–）的“石蜡类/烷烃样”有机化合物；主要是有机化学中的技术用语，日常英语中很少使用。"},"examples":[{"en":"In the lab notes, the researcher mentioned an azoparaffin as an intermediate in the synthesis.","zh":"在实验记录中，研究人员提到一种偶氮石蜡作为合成中的中间体。"},{"en":"Azoparaffin compounds can decompose under heat and may release nitrogen gas.","zh":"偶氮石蜡类化合物在加热下可能分解，并可能释放氮气。"}]}],"synonyms":["azoalkane","azo compound"],"phonetic":"ˌeɪzoʊˈpærəfɪn","extraExplanation":["“azo-”表示“偶氮”（含 –N=N– 键），“paraffin”在化学语境里常泛指烷烃/饱和烃骨架。这个词更常见于专业文献或专利中；不同作者可能用它泛指“含偶氮基的烷烃（azoalkanes）”一类物质。","如果你是在某篇论文/产品说明里看到 azoparaffin，建议同时提供上下文句子或化学结构式，因为它可能不是严格的单一标准名称，而是类别性称呼。"]}
{"word":"azophen","summary":{"en":"“Azophen” is a rare chemistry term for azo–phenyl related compounds, often connected with dye chemistry.","zh":"“Azophen”是较少见的化学用语，指与“偶氮（–N=N–）+苯基”相关的化合物，常与染料化学有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry, rare) Relating to or containing both an azo group (–N=N–) and a phenyl (benzene-ring) group; used in names of certain dye-related compounds.","zh":"（化学，较少用）指含有偶氮基（–N=N–）并与苯基（苯环）相关的；常见于某些染料相关化合物的命名中。"},"examples":[{"en":"Some azophen compounds were studied because azo dyes can show strong colors.","zh":"一些 azophen 化合物会被研究，因为偶氮染料往往颜色很鲜艳。"},{"en":"The lab report mentioned an azophen intermediate formed during the synthesis.","zh":"实验报告提到在合成过程中形成了一个 azophen 中间体。"}]},{"partOfSpeech":"n.","definition":{"en":"An azophen compound (a chemical substance of this type).","zh":"一种 azophen 类化合物（指这类物质本身）。"},"examples":[{"en":"This azophen is used only for research, not for consumer products.","zh":"这种 azophen 仅用于科研，不用于消费品。"}]}],"synonyms":["azo (related)","azobenzene-related"],"phonetic":"/ˈæzoʊˌfɛn/","extraExplanation":["“azo-”通常表示含有偶氮键 –N=N–；“phen- / phenyl”与苯环有关。很多偶氮类物质与染料、颜料相关（例如“azobenzene/偶氮苯”是更常见的词）。","如果你是在论文/配方/材料说明中看到“azophen”，它可能是某个更长化学名的缩写或旧式命名的一部分。把上下文句子发来，我可以帮你确定具体指的是哪一种化合物。"]}
{"word":"azophenetole","summary":{"en":"Azophenetole is a specific azo organic chemical, historically linked to yellow dyes.","zh":"Azophenetole 是一种特定的偶氮有机化学物质，历史上与黄色染料有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (an azo compound) once used as a yellow dye or dye intermediate; it is related to azobenzene and contains a phenetole (ethoxybenzene) group.","zh":"一种偶氮化合物（含 -N=N- 的有机物），过去曾用作黄色染料或染料中间体；与偶氮苯相关，结构中含有苯乙醚（phenetole/ethoxybenzene）基团。"},"examples":[{"en":"Azophenetole was studied as an early synthetic dye material.","zh":"Azophenetole 曾被研究作为早期的合成染料材料。"},{"en":"The label says the sample contains an azo compound such as azophenetole.","zh":"标签上写着该样品含有偶氮化合物，例如 azophenetole。"}]}],"synonyms":["azo phenetole","(an) azo compound"],"phonetic":"/ˌeɪzoʊˈfɛnəˌtoʊl/","extraExplanation":["“azo-”表示含有偶氮基（-N=N-），这类化合物常与染料颜色有关，因为它们往往能吸收可见光。","在现代语境中，这个词多见于化学/材料学文献或安全数据表（SDS），日常英语中几乎不用。"]}
{"word":"azophenine","summary":{"en":"Azophenine is a synthetic azo dye, mostly referenced in historical or technical chemistry contexts.","zh":"Azophenine 是一种合成偶氮染料，多见于化学技术或历史文献语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a synthetic azo dye (a dye containing an –N=N– group), historically used for coloring materials and in laboratory contexts.","zh":"一种合成的偶氮染料（含有 –N=N– 偶氮基团的染料），历史上用于材料着色及部分实验室用途。"},"examples":[{"en":"Older chemistry texts mention azophenine as an example of an azo dye.","zh":"一些较早的化学教材会提到 azophenine 作为偶氮染料的例子。"},{"en":"Because many early dyes raised safety concerns, azophenine is mainly discussed historically rather than used today.","zh":"由于许多早期染料存在安全性争议，azophenine 如今更多是被当作历史资料讨论，而非日常使用。"}]}],"synonyms":["azo dye"],"phonetic":"/ˌeɪzoʊˈfɛnaɪn/","extraExplanation":["“azo-” 来自“azote/氮”的词源，用来提示这类化合物与氮有关；偶氮染料的核心特征是含有 –N=N– 结构，常见于多种合成染料家族。","在现代语境里，这个词多出现在化学史、染料化学或文献检索中；若涉及实际应用，需要结合具体法规与安全数据（如 SDS）来判断是否可用。"]}
{"word":"azophenol","summary":{"en":"Azophenol is a phenol-containing compound with an azo (–N=N–) linkage, often used in dye chemistry.","zh":"Azophenol（偶氮苯酚）是含苯酚结构并带有偶氮（–N=N–）键的化合物，常用于染料相关的化学中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (or class of compounds) in which a phenol ring is connected to another group by an azo linkage (–N=N–); often used as an intermediate in making dyes or indicators.","zh":"偶氮苯酚；指含有苯酚环并通过偶氮键（–N=N–）与另一部分相连的化合物（或一类化合物），常用于染料或指示剂的合成中间体。"},"examples":[{"en":"In the lab, we synthesized an azophenol as a starting material for an azo dye.","zh":"在实验室里，我们合成了一种偶氮苯酚，作为偶氮染料的起始原料。"},{"en":"Some azophenol derivatives change color depending on pH, so they can be used in indicators.","zh":"某些偶氮苯酚衍生物会随 pH 改变颜色，因此可用于酸碱指示剂。"}]}],"synonyms":["azo phenol","azophenolic compound"],"phonetic":"/ˌeɪzoʊˈfiːnɔl/","extraExplanation":["词源上，azo- 表示“偶氮（含 –N=N–）”，phenol 表示“苯酚”。这类结构常见于偶氮染料体系中，颜色来自分子中共轭体系对可见光的吸收。","在实际使用中需注意：某些偶氮化合物可能具有毒性或在特定条件下产生潜在风险；实验与工业应用应遵守化学品安全规范（如通风、手套与废液处理）。"]}
{"word":"azophenyl","summary":{"en":"Azophenyl is a chemistry term for a phenyl group connected through an azo (–N=N–) linkage, common in azo dyes.","zh":"Azophenyl 是化学术语，指通过偶氮键（–N=N–）连接的苯基结构，常见于偶氮染料等化合物中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Relating to, or describing, a phenyl group connected through an azo linkage (–N=N–); used mainly in naming azo dyes and related aromatic compounds.","zh":"（化学）指与偶氮键（–N=N–）相连的苯基；主要用于偶氮染料及相关芳香族化合物的命名与描述。"},"examples":[{"en":"Many brightly colored azo dyes contain an azophenyl unit in their structure.","zh":"许多颜色鲜艳的偶氮染料结构中含有“偶氮苯基（azophenyl）”单元。"},{"en":"The report describes an azophenyl substituent attached to the ring, which changes the compound’s color.","zh":"报告描述了一个连接在芳环上的偶氮苯基取代基，它会改变化合物的颜色。"}]},{"partOfSpeech":"n.","definition":{"en":"A structural unit (substituent) consisting of a phenyl group linked via an azo group (–N=N–), discussed in organic chemistry and dye chemistry.","zh":"一种结构单元（取代基）：苯基通过偶氮基（–N=N–）连接形成的基团，常见于有机化学与染料化学的讨论中。"},"examples":[{"en":"Chemists compared two molecules that differ only by the presence of an azophenyl group.","zh":"化学家比较了两种只在是否含有偶氮苯基（azophenyl）这一点上不同的分子。"},{"en":"Adding an azophenyl group can increase conjugation and affect light absorption.","zh":"引入偶氮苯基（azophenyl）可能增强共轭效应，并影响对光的吸收。"}]}],"synonyms":["azo-phenyl (variant spelling)","azobenzene-related (general context)"],"phonetic":"/ˌeɪzoʊˈfɛnəl/","extraExplanation":["“azo-”源自法语/德语传统化学命名，表示含有偶氮键 –N=N–；“phenyl”指苯基（C6H5–）。因此 azophenyl 通常出现在专业化学语境（论文、材料/染料说明书）中，日常英语里很少用。","偶氮化合物常与“颜色/染料”联系在一起，因为 –N=N– 与芳香环形成的共轭体系容易吸收可见光；这也是很多偶氮染料色彩鲜艳的原因。"]}
{"word":"azophenylene","summary":{"en":"Azophenylene is a chemistry term for an azo (–N=N–) group connected to a phenylene ring unit, common in azo dyes.","zh":"Azophenylene 是化学术语，指偶氮基（–N=N–）与亚苯基（苯环片段）相连的结构单元，常见于偶氮染料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical term for a structural unit in organic chemistry where an azo group (–N=N–) is linked to a phenylene ring (a benzene ring fragment), often occurring in azo dyes and related compounds","zh":"化学术语：指有机结构单元，其中偶氮基（–N=N–）与亚苯基/苯撑（来自苯环的片段）相连，常见于偶氮染料及相关化合物中"},"examples":[{"en":"Many brightly colored azo dyes contain an azophenylene segment in their molecular backbone.","zh":"许多颜色鲜艳的偶氮染料在分子骨架中含有“azophenylene（偶氮-亚苯基）”片段。"},{"en":"The paper discusses how the azophenylene unit affects light absorption in the visible range.","zh":"这篇论文讨论了 azophenylene 结构单元如何影响可见光范围内的吸收。"}]}],"synonyms":["azophenylene unit","azo-phenylene group","azo-linked phenylene"],"phonetic":"/ˌeɪzoʊˈfɛnəliːn/","extraExplanation":["这是一个较少出现在日常英语里的专业词，更多见于化学论文、材料科学、染料化学等语境。","词形可拆解理解：azo- 表示“偶氮（–N=N–）”，phenylene 表示“亚苯基/苯撑（C6H4 片段）”。在命名上，它强调的是“结构片段/基团”，而不是一个常见的独立物质名称。"]}
{"word":"Azophi","summary":{"en":"Azophi is an older Western name for the astronomer al-Sufi, famous for his work on stars and constellations.","zh":"Azophi 是对天文学家 al-Sufi（苏菲）的较早西方称呼，以研究恒星与星座著称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Latinized/Western name used for the Persian astronomer Abd al-Rahman al-Sufi (903–986), known for describing stars and constellations in detail","zh":"对波斯天文学家阿卜杜勒·拉赫曼·苏菲（Abd al-Rahman al-Sufi，903–986）的拉丁化/西方称呼，他以细致描述恒星与星座而闻名"},"examples":[{"en":"Azophi’s descriptions of the night sky influenced later Islamic and European astronomy.","zh":"Azophi 对夜空的描述影响了后来的伊斯兰与欧洲天文学。"},{"en":"In some older star charts, you may see the name Azophi instead of al-Sufi.","zh":"在一些较旧的星图里，你可能会看到 Azophi 这个名字，而不是 al-Sufi。"}]}],"synonyms":["al-Sufi","Abd al-Rahman al-Sufi"],"phonetic":"əˈzoʊfi","extraExplanation":["“Azophi”常见于较早的欧洲/拉丁传统文献，是对“al-Sufi（苏菲）”的音译或拉丁化写法之一。","al-Sufi 最著名的作品是《恒星之书》（Book of Fixed Stars），在托勒密《天文学大成》的基础上结合观测，记录恒星位置与亮度，并描述星座图像。","他对仙女座星系的早期记载（在肉眼可见条件下的“云状星”描述）常被引用为重要的历史观测之一。"]}
{"word":"azophosphin","summary":{"en":"Azophosphin is a (historical) name for a red azo dye, mainly noted for use as a stain.","zh":"Azophosphin 是一种（偏历史用法的）红色偶氮染料，主要见于作为染色剂/生物染色剂的语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a synthetic red azo dye formerly used as a biological stain and in some dyeing applications.","zh":"一种合成的红色偶氮染料，早期常用于生物染色，也可用于某些染色/着色用途。"},"examples":[{"en":"The slide was stained with azophosphin to make the tissue structures easier to see.","zh":"这张玻片用 azophosphin（偶氮磷红）染色，使组织结构更容易观察。"},{"en":"Older lab manuals sometimes list azophosphin among common red dyes for microscopy.","zh":"一些较老的实验手册会把 azophosphin 列为显微镜常用的红色染料之一。"}]}],"synonyms":["azo dye","red dye","biological stain"],"phonetic":"/ˌeɪzoʊˈfɑsˌfɪn/","extraExplanation":["这是一个相对冷门、偏历史用法的化学/染色名称。词中“azo-”常指“偶氮（—N=N—）”结构，许多偶氮染料因此呈现鲜明的红、橙、黄等颜色。不同资料可能会把它写作近似拼法（如带 -e 的形式），具体对应的化学结构也可能因命名体系与时代而异；阅读文献时最好结合上下文（染色方法、颜色、用途）确认。"]}
{"word":"azophosphore","summary":{"en":"“Azophosphore” is not a standard English word; it likely comes from chemical roots (azo- + phosphor/phosphore) and may be a specialized term or a misspelling.","zh":"“Azophosphore”不是标准英语词汇；它可能由化学词根（azo- + phosphor/phosphore）构成，属于专业术语或拼写误差。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A very rare or nonstandard term (not found in common English dictionaries). It appears to be built from chemical word parts: azo- (related to nitrogen, often the N=N “azo” group) + phosphor/phosphore (related to phosphorus or phosphorescence).","zh":"一个非常罕见或非标准的词（常见英语词典中通常查不到）。它看起来由化学词素构成：azo-（与氮有关，常指 N=N 的“偶氮”基）+ phosphor/phosphore（与磷或“磷光/荧光”有关）。"},"examples":[{"en":"I couldn’t find “azophosphore” in a standard English dictionary; it may be a specialized chemistry term or a misspelling.","zh":"我在标准英语词典里找不到“azophosphore”；它可能是某个专业化学术语，或是拼写错误。"},{"en":"If you meant an “azo phosphor,” you might be referring to a pigment/dye material that combines azo chemistry with phosphor-like properties.","zh":"如果你想写的是“azo phosphor（偶氮荧光粉/磷光材料）”，你可能在指结合了偶氮化学与荧光粉性质的颜料/材料。"}]}],"synonyms":["azo compound","phosphor","phosphorus-related compound"],"phonetic":"/ˌeɪzoʊˈfɑsfɔr/","extraExplanation":["这个词更像法语/科技文本里的造词（phosphore 在法语里可指“磷”或“发光物质”），英语里更常见的是 phosphorus（磷）、phosphor（荧光粉/发光体）、phosphorescent（磷光的）以及 azo compound（偶氮化合物）。","如果你能提供出现它的句子、学科领域（例如染料、材料、无机/有机化学）或原文拼写（是否为 azophosphor / azophosphore / azo-phosphore），我可以更准确地解释含义与用法。"]}
{"word":"azoprotein","summary":{"en":"Azoprotein is a lab-made protein linked to an azo group (–N=N–), often used as an antigen or colored marker in experiments.","zh":"Azoprotein（偶氮蛋白）是与偶氮基（–N=N–）化学偶联的实验用蛋白，常作为抗原或有色标记物使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a protein that has been chemically linked to an azo group (–N=N–), often used in laboratories as an antigen or as a colored marker in experiments","zh":"偶氮蛋白：指与偶氮基（–N=N–）发生化学偶联的蛋白质，常用于实验室中作为抗原或带颜色的标记物"},"examples":[{"en":"Researchers injected an azoprotein to study how the immune system reacts to a modified protein.","zh":"研究人员注射偶氮蛋白，以研究免疫系统对“被改造”的蛋白质会如何反应。"},{"en":"The dye was attached to the protein, forming an azoprotein that could be tracked more easily.","zh":"染料被连接到蛋白质上，形成偶氮蛋白，从而更容易被追踪。"}]}],"synonyms":["azo-conjugated protein","azo dye–protein conjugate","hapten–protein conjugate (related)"],"phonetic":"/ˌeɪzoʊˈproʊtiːn/","extraExplanation":["“azo-”来自“偶氮（azo）”，指含有 –N=N– 结构的化学基团；“azoprotein”通常不是自然存在的蛋白，而是通过化学方法把偶氮染料或含偶氮结构的化合物连接到蛋白上得到的实验材料。","在免疫学/生物化学中，偶氮蛋白常用于研究“半抗原（hapten）-载体（carrier）”概念：小分子（如某些染料）本身不易引发免疫反应，但与蛋白结合后更容易被免疫系统识别。"]}
{"word":"Azor","summary":{"en":"Azor is mainly used as a male personal name; it also appears as a name in the Bible (Matthew’s genealogy).","zh":"Azor 主要作男性人名使用；它也作为《圣经》（《马太福音》家谱）中的人名出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (a personal name).","zh":"Azor（阿佐尔）：男性名字（人名）。"},"examples":[{"en":"His name is Azor, but his friends call him A.","zh":"他叫 Azor，但朋友们叫他 A。"},{"en":"Azor is not very common in English, so people may ask how to spell it.","zh":"Azor 在英语里不算常见，所以别人可能会问怎么拼。"}]},{"partOfSpeech":"n.","definition":{"en":"a person’s name found in the Bible (in the Gospel of Matthew), listed in the genealogy of Jesus.","zh":"《圣经》中出现的人名：在《马太福音》的耶稣家谱里出现的 Azor。"},"examples":[{"en":"Azor appears in the genealogy in Matthew 1.","zh":"Azor 出现在《马太福音》第一章的家谱中。"},{"en":"Some people choose the name Azor because of its biblical connection.","zh":"有些人因为它与《圣经》有关而选择 Azor 这个名字。"}]}],"synonyms":["(as a name) no direct synonyms"],"phonetic":"/ˈeɪzɔr/","extraExplanation":["在英语里，Azor 通常被当作专有名词（人名）来用；词典里有时会标为 “proper noun（专有名词）”。本回答用 n. 来对应“名词”。","另外，在西班牙语中小写的 azor 是常见名词，意思是“一种鹰（苍鹰/雀鹰类）”。如果你是在西语语境里看到的，含义可能不同。"]}
{"word":"Azores","summary":{"en":"The Azores are a Portuguese archipelago in the Atlantic Ocean; the name is also used in meteorology for the Azores High.","zh":"亚速尔群岛是葡萄牙在大西洋上的群岛；在气象学中该名称也可指“亚速尔高压”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of nine Portuguese islands in the Atlantic Ocean, known for volcanic landscapes, green scenery, and mild weather.","zh":"亚速尔群岛（葡萄牙在大西洋中的九座岛屿组成的群岛），以火山地貌、葱郁景色和温和气候闻名。"},"examples":[{"en":"The Azores are a popular destination for hiking and whale watching.","zh":"亚速尔群岛是徒步旅行和观鲸的热门目的地。"},{"en":"She flew to the Azores from Lisbon for a week-long vacation.","zh":"她从里斯本飞到亚速尔群岛度假一周。"}]},{"partOfSpeech":"n.","definition":{"en":"In weather and climate talk, “the Azores” can refer to the Azores High, a high-pressure system near the islands that influences Atlantic and European weather.","zh":"在气象语境中，“the Azores”有时指“亚速尔高压”（靠近群岛的高压系统），会影响大西洋及欧洲的天气。"},"examples":[{"en":"A stronger Azores High can bring drier conditions to parts of southern Europe.","zh":"更强的亚速尔高压可能给欧洲南部部分地区带来更干燥的天气。"}]}],"synonyms":["the Azores","Azores Islands"],"phonetic":"/əˈzɔrˌiz/","extraExplanation":["“Azores”常与定冠词连用说成“the Azores”，因为它指的是一组岛屿（群岛）。","名称来源与葡萄牙探险时代有关；英语中保留了葡萄牙语复数形式的拼写与用法。"]}
{"word":"Azorian","summary":{"en":"Azorian means “from the Azores” or “a person from the Azores.”","zh":"Azorian 指“来自亚速尔群岛的”，也可指“亚速尔人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Azores (a group of Portuguese islands in the Atlantic Ocean), or to the people/culture from there.","zh":"（形容词）与亚速尔群岛（葡萄牙在大西洋的群岛）有关的；或与当地人/文化有关的。"},"examples":[{"en":"Azorian dairy products and cheeses are well known in Portugal.","zh":"亚速尔的乳制品和奶酪在葡萄牙很有名。"},{"en":"She studies Azorian traditions and folk music.","zh":"她研究亚速尔的传统和民间音乐。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from the Azores, or someone of Azorean heritage.","zh":"（名词）亚速尔人；具有亚速尔血统的人。"},"examples":[{"en":"Many Azorians moved abroad in the 20th century.","zh":"20世纪许多亚速尔人移居海外。"},{"en":"He is an Azorian who grew up on São Miguel island.","zh":"他是亚速尔人，在圣米格尔岛长大。"}]}],"synonyms":["Azorean"],"phonetic":"/əˈzɔriən/","extraExplanation":["“Azorian”一般与地理/族群有关：Azores（亚速尔群岛）→ Azorean / Azorian（两者都可用，但现代英语里 *Azorean* 更常见；*Azorian* 也会出现，尤其在专名或特定语境中）。","在历史与政治语境中，*Project Azorian*（“阿佐里安计划”）是冷战时期一项著名的美国中央情报局行动代号，用于打捞苏联潜艇残骸；这里的 *Azorian* 属于专名的一部分，并不单纯表示“亚速尔的”。"]}
{"word":"azorian","summary":{"en":"Azorian means ‘from or relating to the Azores’ (also used for a person from there).","zh":"Azorian 指“亚速尔群岛的/与亚速尔群岛有关的”，也可指“亚速尔群岛人”（常见替代词为 Azorean）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Azores (a group of Portuguese islands in the Atlantic Ocean), or to the people, culture, or language from there; Azorean","zh":"与亚速尔群岛（葡萄牙在大西洋上的群岛）有关的；亚速尔群岛的；亚速尔人的（相当于 Azorean）"},"examples":[{"en":"Azorian music often features folk instruments and sea-themed songs.","zh":"亚速尔群岛的音乐常常包含民间乐器和海洋主题的歌曲。"},{"en":"She cooks several Azorian dishes that her grandparents taught her.","zh":"她会做几道祖父母教她的亚速尔群岛菜。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from the Azores; an Azorean","zh":"亚速尔群岛人（相当于 Azorean）"},"examples":[{"en":"Many Azorians settled in parts of New England and California.","zh":"许多亚速尔群岛人曾在新英格兰和加州的一些地区定居。"}]}],"synonyms":["Azorean","from the Azores"],"phonetic":"/əˈzɔriən/","extraExplanation":["“Azorian”在英语里不如“Azorean”常见，但意思基本相同；在正式写作或新闻报道中更常看到“Azorean”。","亚速尔群岛属于葡萄牙，官方语言是葡萄牙语；因此“Azorian/Azorean”在文化语境里常与葡萄牙传统、海洋生活、移民社区等话题相关。"]}
{"word":"Azorin","summary":{"en":"Azorín is the pen name of a major Spanish essayist and writer, linked to the Generation of ’98.","zh":"Azorín 是西班牙重要散文家/作家的笔名，与“98一代”密切相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Azorín: the pen name of José Martínez Ruiz (1873–1967), a Spanish writer and essayist associated with Spain’s “Generation of ’98.”","zh":"Azorín：西班牙作家、散文家何塞·马丁内斯·鲁伊斯（1873–1967）的笔名，常被归入“98一代”（Generation of ’98）。"},"examples":[{"en":"Azorín is often studied alongside other Generation of ’98 writers.","zh":"Azorín 常与其他“98一代”作家一起被研究。"},{"en":"In class, we read an essay by Azorín about Spanish landscapes and memory.","zh":"课上我们读了一篇 Azorín 写的文章，主题是西班牙的风景与记忆。"}]}],"synonyms":["José Martínez Ruiz","Azorín (with accent: Azorín)","Generation of '98 writer"],"phonetic":"/ˌɑːzoʊˈrin/","extraExplanation":["“Azorín”是笔名（pseudonym），本名为 José Martínez Ruiz；英语写作里常保留重音符号写作“Azorín”，但也会看到不带重音的“Azorin”。","“98一代”指19世纪末西班牙在战争失利与社会危机后出现的一批作家与思想者，他们常关注国家认同、历史反思与乡土风景。Azorín 的散文以细腻观察、节奏舒缓和对时间与记忆的描写而闻名。"]}
{"word":"azorite","summary":{"en":"Azorite (often spelled azurite) is a deep-blue copper mineral used as an ore, pigment, and decorative stone.","zh":"Azorite（常见拼写为 azurite）是深蓝色的含铜矿物，可作铜矿石、蓝色颜料与装饰石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A deep-blue mineral (a copper carbonate) often found with malachite, valued as an ore of copper and used as a blue pigment and decorative stone.","zh":"蓝铜矿（一种含铜碳酸盐矿物），常与孔雀石共生；可作铜矿石，也常被用作蓝色颜料和装饰性宝石/观赏石。"},"examples":[{"en":"The museum displayed azorite alongside malachite in the mineral collection.","zh":"博物馆在矿物馆藏中把蓝铜矿和孔雀石一起展出。"},{"en":"Historically, artists ground azorite into a powder to make a vivid blue pigment.","zh":"在历史上，画家会把蓝铜矿磨成粉末来制成鲜艳的蓝色颜料。"}]}],"synonyms":["azurite","blue copper ore"],"phonetic":"/ˈæʒəˌraɪt/","extraExplanation":["“Azorite”更常见的标准拼写是“azurite”（蓝铜矿）。你写的“azorite”可能是拼写变体或拼写错误；如果你在某本书、标签或游戏/小说里看到“azorite”，也可能是作者刻意采用的异拼写。","词源上与表示“蓝色”的词根有关（可联想到“azure”= 天蓝色）。在艺术史中，蓝铜矿颜料曾很重要，但它在某些情况下会随时间变色（比如向绿色矿物转变），因此在古画修复与鉴定中也会被提及。"]}
{"word":"azorubine","summary":{"en":"Azorubine is a synthetic red food/cosmetic dye, also called carmoisine (E122).","zh":"Azorubine 是一种合成红色食用/化妆品染料，也叫 carmoisine（E122）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a synthetic red azo dye used as a food coloring and in cosmetics; also known as carmoisine (food additive code E122).","zh":"一种合成的红色偶氮染料，用作食品着色剂和化妆品染料；又称 carmoisine（食品添加剂编号 E122）。"},"examples":[{"en":"The ingredient list mentioned azorubine (E122) as a coloring agent.","zh":"配料表中提到 azorubine（E122）作为着色剂。"},{"en":"Some people choose snacks without azorubine to avoid artificial dyes.","zh":"有些人会选择不含 azorubine 的零食来避免人工色素。"}]}],"synonyms":["carmoisine","E122","red azo dye"],"phonetic":"/ˌeɪzoʊˈruːbiːn/","extraExplanation":["Azorubine 属于“偶氮染料（azo dye）”，颜色鲜红，常见于糖果、甜点、饮料等产品的着色。","不同地区法规与标示要求可能不同：在欧洲常以 E122 标示；在美国则不常见于食品（更常见的红色食用色素是 Red 40）。购买跨境食品时可留意标签。","少数人可能对某些人工色素敏感；如果你对色素有不适史，建议查看配料表或咨询专业人士。"]}
{"word":"azosulphine","summary":{"en":"Azosulphine is a synthetic red azo dye used mainly for staining and coloring.","zh":"Azosulphine 是一种合成的红色偶氮染料，主要用于染色与着色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a synthetic red azo dye (a colorant made from an “azo” chemical group), used especially in laboratories for staining and sometimes as an industrial or food colorant under related names.","zh":"一种人工合成的红色偶氮染料（含“偶氮”结构的着色剂），常用于实验室染色，也可在工业染色或某些食品/药品着色中以相关名称出现。"},"examples":[{"en":"The tissue section was stained with azosulphine to highlight certain structures.","zh":"这张组织切片用 azosulphine（偶氮磺品红）染色，以凸显某些结构。"},{"en":"Azosulphine is an azo dye, so it is handled with care in the lab.","zh":"Azosulphine 属于偶氮染料，因此在实验室里需要谨慎操作。"}]}],"synonyms":["azosulfine","azo dye","red dye"],"phonetic":"/ˌeɪzoʊˈsʌlfaɪn/","extraExplanation":["“azosulphine”中“sulph-”是英式拼写（对应美式常见的“sulf-”）。在不同领域或产品标签上，这类染料可能以近似名称或编号出现（例如某些红色偶氮染料的商品名/别名），具体指代需结合配方、标准编号或供应商信息确认。"]}
{"word":"azosulphonic","summary":{"en":"A chemistry adjective for substances that contain both an azo (–N=N–) and a sulfonic acid (–SO3H) group, often related to dyes.","zh":"化学形容词，指同时含有偶氮基（–N=N–）与磺酸基（–SO3H）的物质，常与染料相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Relating to or containing both an azo group (–N=N–) and a sulfonic acid group (–SO3H), often used to describe certain dyes or dye intermediates.","zh":"（化学）指含有偶氮基（–N=N–）和磺酸基（–SO3H）的；常用于描述某些染料或染料中间体。"},"examples":[{"en":"Many azo dyes become water‑soluble when they contain an azosulphonic group.","zh":"许多偶氮染料含有偶氮磺酸基后会变得易溶于水。"},{"en":"The report mentions an azosulphonic compound used in textile coloring.","zh":"报告提到一种用于纺织品着色的偶氮磺酸类化合物。"}]}],"synonyms":["azosulfonic","azo-sulfonic","azo sulfonic"],"phonetic":"/ˌeɪzoʊsʌlˈfɑːnɪk/","extraExplanation":["“azosulphonic”更常见的拼写是“azosulfonic”（美式英语倾向用 -fon-，英式/传统化学文献中有时见 -phon- 这一旧式拼法）。","偶氮（azo）结构常见于染料分子骨架；引入磺酸基（–SO3H）通常能提高染料在水中的溶解度，并增强其对纤维的亲和性（因此在纺织染色中常见）。"]}
{"word":"azotaemia","summary":{"en":"Azotaemia is the buildup of nitrogen-containing waste in the blood, usually due to impaired kidney function.","zh":"Azotaemia 指血液中含氮代谢废物堆积升高，通常与肾功能受损有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical condition in which waste products containing nitrogen (especially urea and creatinine) build up in the blood, usually because the kidneys are not working well.","zh":"（医学）氮质血症：血液中含氮代谢废物（尤其是尿素、肌酐）升高的情况，通常与肾功能不良有关。"},"examples":[{"en":"The patient showed signs of azotaemia after dehydration and reduced urine output.","zh":"患者在脱水、尿量减少后出现了氮质血症的迹象。"},{"en":"Blood tests revealed elevated urea and creatinine, consistent with azotaemia.","zh":"血液检查显示尿素和肌酐升高，与氮质血症相符。"}]}],"synonyms":["azotemia","uremia (related, often more severe/clinical syndrome)"],"phonetic":"/ˌæzoʊtəˈmiə/","extraExplanation":["该词常见于英式拼写 azotaemia，美式拼写更常见为 azotemia，含义相同。","词源可拆解为 azo-（与“氮”有关）+ -aemia（血液状况），字面意思是“血中氮（类物质）增多”。","临床上常按原因分为：肾前性（如脱水/低灌注）、肾性（肾实质损伤）、肾后性（尿路梗阻）。日常英语中不常用，更多出现在化验单、病历或医学科普中。"]}
{"word":"azotate","summary":{"en":"Azotate is an old term for a nitrate (a nitric-acid salt).","zh":"Azotate 是“硝酸盐（nitrate）”的旧式说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(old-fashioned/chemistry) a nitrate; a salt or ester of nitric acid (NO₃⁻).","zh":"（旧式/化学）硝酸盐；硝酸（HNO₃）的盐或酯（含 NO₃⁻）。"},"examples":[{"en":"In older chemistry books, an “azotate” usually means a nitrate salt.","zh":"在较旧的化学书里，azotate 通常指“硝酸盐”。"},{"en":"Silver azotate was an old name for silver nitrate.","zh":"silver azotate 是硝酸银（silver nitrate）的旧称。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare) to make or treat something so that it becomes a nitrate (to nitrate).","zh":"（罕见）使……形成硝酸盐；对……进行硝化处理（即 nitrate）。"},"examples":[{"en":"The text describes azotating the solution before testing it.","zh":"文章描述了在检测前对溶液进行“azotating（硝化/成硝酸盐处理）”。"}]}],"synonyms":["nitrate","nitric-acid salt"],"phonetic":"/ˈæzəˌteɪt/","extraExplanation":["“Azotate” 多见于18–19世纪的英文科学写作，现代英语里几乎都用更常见、更标准的 “nitrate”。","词根与法语 “azotate” 有关；早期化学中 “azote” 指“氮”（nitrogen），因此这类词常与含氮化合物的旧命名体系相关。"]}
{"word":"azote","summary":{"en":"“Azote” is an old term meaning nitrogen.","zh":"“azote”是表示“氮”的旧称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Nitrogen; an older or less common term used mainly in historical or scientific writing.","zh":"氮；一种较旧或不太常用的说法，多见于历史或科学语境。"},"examples":[{"en":"Early chemists sometimes used the word “azote” for nitrogen.","zh":"早期化学家有时用“azote”来指氮。"},{"en":"In French scientific history, “azote” appears in discussions of air and respiration.","zh":"在法国科学史中，“azote”常出现在有关空气与呼吸的讨论里。"}]}],"synonyms":["nitrogen","N (chemical symbol)"],"phonetic":"/əˈzoʊt/","extraExplanation":["“azote”源自法语 azote，词根来自希腊语 a-（不）+ zōē（生命），意思是“无生命的”，因为氮气本身不支持呼吸和燃烧。后来英语里更通用的名称变成了 nitrogen（与“硝石/硝酸盐”相关）。在现代英语中，azote 多用于历史化学、旧文献或特定翻译语境。"]}
{"word":"azotea","summary":{"en":"Spanish for a flat rooftop/roof terrace used as an outdoor space.","zh":"西班牙语：指可使用的平屋顶或屋顶露台。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flat rooftop or roof terrace, often used as an outdoor space (common in Spanish-speaking countries).","zh":"（西班牙语）平屋顶；屋顶露台（常可上去活动、晾晒或休息）。"},"examples":[{"en":"We watched the sunset from the azotea.","zh":"我们在屋顶露台上看日落。"},{"en":"In some cities, people dry clothes on the azotea.","zh":"在一些城市里，人们会在屋顶上晾衣服。"},{"en":"The party moved upstairs to the azotea because it was cooler.","zh":"因为更凉快，聚会转移到楼上的屋顶露台。"}]}],"synonyms":["rooftop","roof terrace","terrace","flat roof"],"phonetic":"/ˌɑzoʊˈteɪə/","extraExplanation":["“azotea”在拉丁美洲和西班牙都能用，但语感常指“可使用的平屋顶/露台”，不只是一般的“屋顶（roof）”。在城市住宅里，它可能是公共或半公共空间，用来晾晒、种植物、乘凉或聚会。","词源上常认为与阿拉伯语有关（伊比利亚半岛历史上受阿拉伯语影响很深），因此在西语里保留了以 a- 开头的外来词特征。"]}
{"word":"azoted","summary":{"en":"“Azoted” is a rare adjective meaning “containing nitrogen” or “treated with nitrogen,” especially in older scientific writing or metallurgy.","zh":"“Azoted”是较少见的形容词，意为“含氮的”或“经氮处理的”，多见于旧式科学用语或金属加工语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"containing nitrogen; treated with nitrogen (often to harden metal).","zh":"含氮的；经过氮处理的（常指为使金属更坚硬而进行氮化处理）。"},"examples":[{"en":"The azoted steel surface became harder and more resistant to wear.","zh":"经过氮化处理的钢表面变得更坚硬、更耐磨。"},{"en":"Some older scientific texts describe certain compounds as “azoted,” meaning nitrogen-bearing.","zh":"一些较早的科学文献会把某些化合物称为“azoted”，意思是“含氮的”。"}]}],"synonyms":["nitrogenous","nitrided","nitrogen-treated"],"phonetic":"/əˈzoʊtɪd/","extraExplanation":["“azoted”来自“azote（氮）”。“azote”是18—19世纪较常见的“氮”的旧称，源自法语（意为“无生命”，因为氮气不支持燃烧和呼吸）。现代英语里更常用“nitrogenous（含氮的）”或在金属加工语境中用“nitrided / nitrided steel（氮化的/氮化钢）”。"]}
{"word":"azotemia","summary":{"en":"Azotemia means abnormally high nitrogen waste (like urea/creatinine) in the blood, often linked to reduced kidney function.","zh":"Azotemia 指血液中含氮代谢废物（如尿素、肌酐）异常升高，常与肾功能下降有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical condition in which nitrogen waste products (especially urea and creatinine) build up in the blood, usually because the kidneys are not filtering properly","zh":"（医学）氮质血症：血液中含氮代谢废物（尤其是尿素、肌酐）升高，通常因肾脏过滤功能受损所致"},"examples":[{"en":"The lab results showed azotemia, so the doctor checked the patient’s kidney function.","zh":"化验结果显示氮质血症，所以医生进一步检查了病人的肾功能。"},{"en":"Dehydration can sometimes cause mild azotemia that improves after fluids.","zh":"脱水有时会引起轻度氮质血症，补液后可能改善。"}]}],"synonyms":["raised blood urea nitrogen (BUN)","elevated creatinine","uremia (related but not identical)"],"phonetic":"/ˌæzoʊˈtiːmiə/","extraExplanation":["词源提示：azotemia 来自法语/科学词根 azote（“氮”，历史上用于指氮气）+ -emia（“血液中的……”，表示血液状态）。","临床上常见的分类有：肾前性（如脱水、低灌注）、肾性（肾实质损伤）、肾后性（尿路梗阻）。不过日常交流中多笼统指“肾功能相关的血氮升高”。","它是“化验/指标异常”的描述，不等同于“尿毒症（uremia）”。尿毒症通常意味着更严重的毒素累积并伴随明显症状。"]}
{"word":"azotemias","summary":{"en":"“Azotemias” is the plural of “azotemia,” meaning high nitrogen waste levels in the blood, often related to kidney problems.","zh":"“azotemias”是“azotemia（氮质血症）”的复数，指血液中含氮废物升高，常与肾功能问题相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical condition in which there is an abnormally high level of nitrogen-containing waste products (especially urea and creatinine) in the blood, usually because the kidneys are not filtering properly","zh":"（医学）氮质血症：血液中含氮代谢废物（尤其是尿素、肌酐）异常升高的状态，通常与肾脏过滤功能受损有关"},"examples":[{"en":"The patient’s blood tests showed azotemia, so the doctor checked kidney function.","zh":"病人的血液检查显示有氮质血症，所以医生进一步评估肾功能。"},{"en":"Dehydration can cause prerenal azotemia, which may improve after fluids.","zh":"脱水可能导致肾前性氮质血症，补液后可能改善。"}]}],"synonyms":["azotemia","elevated BUN and creatinine","renal insufficiency (related, not identical)"],"phonetic":"/ˌæzəˈtiːmiə/","extraExplanation":["“azotemias”是“azotemia”的复数形式，常见于医学论文或病例汇总中（例如讨论不同类型或不同患者的多例氮质血症）。","临床上常按原因分为肾前性（如脱水、出血）、肾性（肾实质损伤）、肾后性（尿路梗阻）。注意：azotemia指实验室/生化异常；更严重并伴随症状时常用“uremia（尿毒症）”来描述。"]}
{"word":"azotemic","summary":{"en":"Azotemic means having abnormally high nitrogen waste in the blood, often due to kidney problems or dehydration.","zh":"Azotemic 指血中含氮废物异常升高的“氮质血症”状态，常与肾功能问题或脱水有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Having azotemia: an abnormally high level of nitrogen-containing waste products (especially urea and creatinine) in the blood, often linked to kidney dysfunction or dehydration.","zh":"（医学）氮质血症的；指血液中含氮代谢废物（尤其是尿素、肌酐）异常升高，常与肾功能受损或脱水有关。"},"examples":[{"en":"The patient became azotemic after severe dehydration from vomiting.","zh":"患者因呕吐导致严重脱水后出现氮质血症（变得“azotemic”）。"},{"en":"An azotemic lab result can signal reduced kidney filtration.","zh":"出现氮质血症的化验结果可能提示肾脏滤过功能下降。"}]}],"synonyms":["azotemic (state of azotemia)","uremic (related but not identical; often more severe)"],"phonetic":"/ˌeɪzoʊˈtiːmɪk/","extraExplanation":["“azotemic”来自“azotemia”（氮质血症）。词根“azote-”与“nitrogen（氮）”有关，医学里常用来指含氮废物（如尿素、肌酐）的累积。","临床上常见搭配：become/turn azotemic（出现氮质血症）、azotemic patient（氮质血症患者）、azotemic state（氮质血症状态）。常与“acute kidney injury (AKI)（急性肾损伤）”“renal failure（肾衰竭）”等一起讨论。","相关词：azotemia（名词，氮质血症）；uremia（尿毒症，通常更严重且伴随症状）；BUN（blood urea nitrogen，血尿素氮）；creatinine（肌酐）。"]}
{"word":"azotenesis","summary":{"en":"Azotenesis is a rare term meaning the formation/production of nitrogen or nitrogenous substances (often in biology/medicine).","zh":"Azotenesis 是一个罕见词，指氮或含氮物质的形成/生成（常见于生物学或医学语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) The formation or production of nitrogen or nitrogen-containing (nitrogenous) substances, especially in a biological/physiological context.","zh":"（罕见）氮或含氮（氮质）物质的形成或生成，尤指生物/生理学语境中的生成过程。"},"examples":[{"en":"Some older medical texts used the term azotenesis when discussing how the body forms nitrogenous waste products.","zh":"一些较早的医学文献会用 azotenesis 来讨论人体如何形成含氮的代谢废物。"},{"en":"Researchers compared diets to see whether they changed azotenesis in laboratory animals.","zh":"研究人员比较不同饮食，观察是否会改变实验动物的含氮物质生成。"}]}],"synonyms":["azotogenesis","nitrogen formation","nitrogen metabolism (related)"],"phonetic":"ˌæzoʊˈtɛnəsɪs","extraExplanation":["azotenesis 现在几乎不常用，更常见的相关词有 nitrogen metabolism（氮代谢）、nitrogenous waste formation（含氮废物形成）等。","词根 azote 来自法语，历史上曾用来指“氮”（nitrogen）；-genesis / -enesis 表示“生成、形成”。因此该词整体可理解为“氮的生成/含氮物质的形成”。","学习时也要留意拼写相近但意义不同的词：azotemia（氮质血症，血液中含氮废物升高）更常见，属于临床诊断术语。"]}
{"word":"azotes","summary":{"en":"“Azotes” is an uncommon plural form meaning nitrogen or nitrogen-containing substances, mostly seen in older or French-influenced scientific English.","zh":"“Azotes”是不常见的复数形式，多见于较旧或受法语影响的科学英语中，指“氮”或“含氮物质/化合物”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of azote) Nitrogen; the chemical element N (especially in older or French-influenced scientific writing).","zh":"（azote 的复数）氮；化学元素 N（多见于较旧或受法语影响的科学写作中）。"},"examples":[{"en":"Older chemistry texts sometimes call nitrogen “azote,” and may refer to different “azotes” in compounds.","zh":"较早的化学书有时把氮称为“azote”，并可能在谈化合物时提到不同的“azotes”。"},{"en":"Most modern English writing uses “nitrogen,” not “azote(s).”","zh":"现代英语通常用“nitrogen”，而不是“azote(s)”。"}]},{"partOfSpeech":"n.","definition":{"en":"Nitrogen-containing substances or compounds (an older, less common sense).","zh":"含氮物质；含氮化合物（较旧、较少见的用法）。"},"examples":[{"en":"The report discussed “azotes” found in organic materials.","zh":"报告讨论了在有机材料中发现的“azotes”（含氮物质）。"},{"en":"In modern terms, they were describing nitrogen compounds.","zh":"用现代术语说，他们描述的是含氮化合物。"}]}],"synonyms":["nitrogen","nitrogen compounds"],"phonetic":"əˈzoʊts","extraExplanation":["“Azote”源自法语，是18世纪拉瓦锡时期的命名：a-（无）+ zoe（生命），意思是“不能维持生命的气体”。当时认为它不支持呼吸与燃烧，所以这样命名。现代英语几乎一律用“nitrogen”。"]}
{"word":"azotetrazole","summary":{"en":"Azotetrazole is a nitrogen‑rich chemical compound often mentioned in energetic‑materials research.","zh":"Azotetrazole 是一种高含氮化合物，常见于含能材料相关研究。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a high‑nitrogen chemical compound (an azo‑linked pair of tetrazole rings), mainly discussed in chemistry and energetic‑materials research.","zh":"一种高含氮化合物（由“偶氮键”连接的两个四唑环），主要出现在化学与含能材料研究语境中。"},"examples":[{"en":"Azotetrazole is studied as a nitrogen‑rich building block for energetic materials.","zh":"Azotetrazole 常被研究为高含氮含能材料的基础结构单元。"},{"en":"Because azotetrazole can be sensitive, it is handled only under strict safety protocols.","zh":"由于 azotetrazole 可能较敏感，通常只能在严格的安全规范下操作。"}]}],"synonyms":["azo tetrazole","5,5′-azotetrazole"],"phonetic":"/ˌeɪzoʊtɛˈtræzoʊl/","extraExplanation":["词源提示：azo- 常指“偶氮（–N=N–）”，tetrazole 指“四唑环（含四个氮的五元环）”；因此 azotetrazole 字面上就是“含偶氮键的四唑类化合物”。","语境与注意：该词多见于科研论文、材料与爆炸物/推进剂相关讨论中；并非日常英语词汇。涉及实验或储存时通常强调“敏感性、热稳定性、冲击/摩擦风险”等安全信息。"]}
{"word":"azoth","summary":{"en":"Azoth is a historical term meaning either a mystical alchemical essence (often tied to transformation) or, in older chemistry, nitrogen.","zh":"Azoth 是历史用语：既可指炼金术中的神秘“精华/万能之物”，也可在旧化学文献中指“氮”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Alchemy, historical) A mystical “universal medicine/solvent” or life-force substance, often linked with mercury and the idea of a purified essence.","zh":"（炼金术，历史用语）一种神秘的“万能药/万能溶剂”或生命本质的物质概念，常与水银（汞）等意象相关，指被提炼出的精华。"},"examples":[{"en":"In some alchemical writings, azoth is described as the key to transformation and renewal.","zh":"在一些炼金术著作中，azoth 被描述为转化与再生的关键。"},{"en":"The novel uses “azoth” as a symbol of secret knowledge and hidden power.","zh":"这部小说把“azoth”用作秘密知识与隐藏力量的象征。"}]},{"partOfSpeech":"n.","definition":{"en":"(Archaic, chemistry) An old name for nitrogen.","zh":"（古旧用法，化学）氮的旧称。"},"examples":[{"en":"Older texts may refer to nitrogen as azoth.","zh":"较早的文献可能把氮称为 azoth。"},{"en":"The term “azoth” is rarely used in modern chemistry classes.","zh":"“azoth”在现代化学课堂中很少使用。"}]}],"synonyms":["nitrogen (archaic sense)","universal solvent (alchemy-related)","elixir (literary/alchemical context)"],"phonetic":"/ˈeɪzɑθ/","extraExplanation":["“azoth”来自法语“azote”（氮），词源与希腊语表示“无生命”的成分有关：早期认为氮气不能维持呼吸与燃烧。后来在炼金术传统中，“azoth”又被赋予更神秘的含义，常指一种能带来转化、净化或“万灵药”般力量的本质。","在文学与奇幻作品里，azoth 常被当作象征性词汇使用（象征奥秘、炼成、重生），不一定指真实存在的化学物质。"]}
{"word":"azothionium","summary":{"en":"Azothionium is an extremely rare, nonstandard noun—probably a chemistry-related name—suggesting a nitrogen–sulfur ‘-onium’ ion/compound, but its exact meaning depends on the source.","zh":"Azothionium 是一个极少见、非标准的名词，可能与化学命名有关，暗示含氮与硫的“—onium”离子/化合物，但确切含义取决于具体来源。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very rare or nonstandard term, likely used as a scientific/proprietary name in chemistry. By its parts (azoth- “nitrogen” + thio- “sulfur” + -onium “positively charged ion”), it suggests a nitrogen–sulfur compound or cation.","zh":"一个非常少见、非标准的词，可能作为化学中的科学/专有名称使用。按构词（azoth-“氮” + thio- “硫” + -onium “带正电的离子”）来看，它暗示与含氮、含硫的化合物或阳离子有关。"},"examples":[{"en":"The paper mentions azothionium only in a list of experimental reagents, without defining it clearly.","zh":"论文里只是在实验试剂清单中提到 azothionium，但并没有清楚地定义它。"},{"en":"If ‘azothionium’ is a trade name, check the product label or CAS number for the exact chemical identity.","zh":"如果“azothionium”是商品名，最好查看产品标签或 CAS 号来确认具体化学物质。"}]}],"synonyms":["(no common synonyms; context-dependent)"],"phonetic":"/əˌzɑːθaɪˈoʊniəm/","extraExplanation":["这个词在常见英语词典中几乎查不到，更多可能出现在专业论文、专利、或产品名里。不同来源可能指向不同具体化学物质，因此最可靠的做法是：结合上下文（领域、配方、用途）并寻找 CAS 号、结构式或完整系统命名。","构词小提示：azoth- 早期英语里与“氮”（nitrogen）有关（来自法语 azote），thio- 表示“硫”，-onium 常见于带正电的离子名称（如 ammonium）。这些线索只能帮助猜大方向，不能代替正式鉴定。"]}
{"word":"azoths","summary":{"en":"Azoth is an alchemical term for a mythical transformative substance, and it can also be an old word for nitrogen.","zh":"Azoth 指炼金术中的神秘转化物质，也可作“氮”的旧称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Alchemy) A mystical “universal medicine” or transformative substance—often linked with the philosopher’s stone—said to purify, heal, or transmute materials.","zh":"（炼金术）一种神秘的“万能药”或转化之物，常与“贤者之石”相关，据说能净化、治愈或使物质发生转化。"},"examples":[{"en":"In old alchemical texts, azoth was described as the key to transformation.","zh":"在古老的炼金术文献中，azoth 被描述为转化的关键。"},{"en":"The novel uses “azoth” as a symbol of spiritual purification.","zh":"这部小说用“azoth”象征精神上的净化。"}]},{"partOfSpeech":"n.","definition":{"en":"(Archaic) An old name for nitrogen, especially in older European scientific writing.","zh":"（古义）氮的旧称，常见于较早的欧洲科学著作中。"},"examples":[{"en":"Some historical chemistry sources refer to nitrogen as azoth.","zh":"一些历史化学资料把氮称为 azoth。"},{"en":"The term “azoth” is rare in modern science classes.","zh":"“azoth”这个词在现代科学课堂里很少见。"}]}],"synonyms":["philosopher’s stone (related)","universal medicine (related)","nitrogen (archaic meaning)"],"phonetic":"ˈæzɑθ","extraExplanation":["“azoths”是复数形式，单数是“azoth”。现代英语里更常见的用法出现在奇幻文学、游戏或象征性写作中，用来营造“炼金术/神秘学”的氛围。","词源与文化：azoth常被解释为象征“万物之始与终”（有人牵连到字母A到Z的意象），并与炼金术传统（如帕拉塞尔苏斯等）相关；但在现代科学语境里通常不用它来指代氮。"]}
{"word":"azotic","summary":{"en":"“Azotic” means “related to nitrogen,” mostly in older or technical usage.","zh":"“azotic” 指“与氮有关/含氮的”，多见于旧文献或少数专业语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to nitrogen (an older or technical way to say “nitrogenous”).","zh":"与氮有关的；含氮的（较旧或较专业的说法，近似 nitrogenous）。"},"examples":[{"en":"In older chemistry texts, “azotic” compounds are often what we now call nitrogen-containing compounds.","zh":"在较早的化学书里，“azotic” compounds 常指我们现在说的“含氮化合物”。"},{"en":"The report mentions azotic emissions, meaning emissions involving nitrogen compounds.","zh":"报告提到 azotic emissions，意思是涉及氮化合物的排放。"}]}],"synonyms":["nitrogenous","nitric (context-dependent)","nitrogen-related"],"phonetic":"/əˈzɑːtɪk/","extraExplanation":["“Azotic” 来自法语 azote（氮的旧称）。18 世纪化学家拉瓦锡（Lavoisier）用 azote 命名氮，含义是“无生命的”（a- + zoe/zoon），因为纯氮不能支持燃烧或呼吸。现代英语里更常用 nitrogen / nitrogenous，azotic 多见于旧文献或少数技术语境。"]}
{"word":"azotin","summary":{"en":"Azotin is a rare term meaning “nitrogen-containing; nitrogenous,” and sometimes a nitrogen-containing substance.","zh":"Azotin 是个罕用词，通常表示“含氮的（nitrogenous）”，有时也可指“含氮物质/化合物”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Containing nitrogen; nitrogenous.","zh":"（罕用）含氮的；含有氮元素的。"},"examples":[{"en":"Some older texts describe “azotin compounds,” meaning nitrogen-containing substances.","zh":"一些较早的文献会写“azotin compounds”，意思是“含氮化合物”。"},{"en":"The term is rare today; modern chemistry usually says “nitrogenous.”","zh":"这个词现在很少用；现代化学通常说“nitrogenous（含氮的）”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare) A nitrogen-containing substance or compound.","zh":"（极罕用）含氮物质；含氮化合物。"},"examples":[{"en":"The lab report listed several azotins alongside carbon-based materials.","zh":"实验报告把几种含氮物质与含碳材料一起列出。"}]}],"synonyms":["nitrogenous","nitro- (as a prefix)","N-containing (technical writing)"],"phonetic":"/æˈzoʊtɪn/","extraExplanation":["“azotin”在现代英语里非常少见，很多时候可能是拼写差异、旧式用词，或从法语/其他语言借来的写法。法语里“azote”指“氮”（nitrogen），来自希腊语词根，历史上有“无生命”的含义（因为氮气不支持燃烧与呼吸）。","如果你是在化学课本、旧论文或产品成分表里看到“azotin”，也可能是特定作者/地区的用法或品牌名。若能提供句子语境，我可以更准确判断它指的是“含氮的（nitrogenous）”，还是某个专有名词。"]}
{"word":"azotine","summary":{"en":"Azotine is a rare term meaning “related to or containing nitrogen.”","zh":"Azotine 是一个很少见的词，意思是“与氮有关的/含氮的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/technical) Related to nitrogen; containing nitrogen; nitrogenous.","zh":"（罕见/技术用语）与氮有关的；含氮的；氮质的。"},"examples":[{"en":"Some older chemistry texts describe “azotine compounds” as substances that contain nitrogen.","zh":"一些较早的化学教材会用“azotine compounds（含氮化合物）”来指含有氮的物质。"},{"en":"The lab report mentioned an azotine odor, meaning it was associated with nitrogen-based chemicals.","zh":"实验报告提到一种“azotine”的气味，意思是与含氮化学品有关的气味。"}]}],"synonyms":["nitrogenous","nitrogen-based","azotic"],"phonetic":"ˈæzəˌtaɪn","extraExplanation":["“azotine”在现代英语里非常少见，更常用的是 nitrogenous（含氮的）或 nitrogen-based（以氮为基础的）。","词根 azot- 来自法语 azote（旧称“氮”）。18世纪化学家拉瓦锡（Lavoisier）用 a-（无）+ zōē（生命，希腊语）来命名，表达“不能维持呼吸/生命”的想法；如今标准术语是 nitrogen。"]}
{"word":"azotise","summary":{"en":"A rare technical verb meaning “to add nitrogen to; to make nitrogen-containing.”","zh":"较少见的技术动词，意为“使含氮；向……引入氮”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to add nitrogen to something; to treat or convert a substance so it contains nitrogen (used mainly in chemistry and industrial processes)","zh":"（主要用于化学/工业）使含氮；向……引入氮；用含氮试剂处理使其含氮"},"examples":[{"en":"The researchers azotised the compound to change its reactivity.","zh":"研究人员对该化合物进行了含氮化处理，以改变它的反应性。"},{"en":"Some industrial steps azotise materials to improve stability.","zh":"一些工业步骤会对材料进行引氮处理，以提高稳定性。"}]}],"synonyms":["azotize","nitrogenate","nitrogenize"],"phonetic":"/əˈzoʊtaɪz/","extraExplanation":["“azotise”是英式拼写；美式更常写作“azotize”。","词根“azot-”来自旧称“azote（氮）”，因此该词通常与“引入氮/含氮化”有关。实际写作中较少见，很多场合会用更直观的“nitrogenate / nitrogenize（使含氮）”。"]}
{"word":"azotised","summary":{"en":"Azotised means “nitrogen-treated” or “made nitrogen-rich,” often in technical contexts.","zh":"Azotised 指“经加氮（含氮化）处理的/使富含氮的”，多用于技术或专业语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"treated with nitrogen or a nitrogen-containing compound; made nitrogen-rich (often used in chemistry or industrial contexts).","zh":"经“加氮/含氮化处理”的；使含氮量增加的（多用于化学或工业语境）。"},"examples":[{"en":"The surface was azotised to improve hardness and wear resistance.","zh":"表面经过加氮化处理，以提高硬度和耐磨性。"},{"en":"Azotised fertilizers release nitrogen slowly into the soil.","zh":"加氮处理的肥料会把氮缓慢释放到土壤中。"}]},{"partOfSpeech":"v.","definition":{"en":"past form/past participle of “azotise/azotize”: to treat something with nitrogen or introduce nitrogen into it.","zh":"“azotise/azotize”的过去式/过去分词：对某物进行加氮处理或向其中引入氮。"},"examples":[{"en":"The technician azotised the metal parts before final polishing.","zh":"技术员在最终抛光前对金属部件进行了加氮处理。"},{"en":"Once azotised, the material can behave differently under heat.","zh":"经过加氮处理后，这种材料在受热时可能表现不同。"}]}],"synonyms":["nitrogen-treated","nitrogenated","nitrided","azotized"],"phonetic":"/əˈzoʊtaɪzd/","extraExplanation":["“azote”是“氮”的旧称（来自法语，意为“无生命的”，因为氮气不支持燃烧与呼吸）。因此 azotise/azotize 字面意思就是“加氮/含氮化”。","该词多见于较专业的材料科学/化学语境；日常英语里更常见的是 nitrogen-treated（经加氮处理的）或 nitrided（渗氮的）。"]}
{"word":"azotises","summary":{"en":"Azotises means “treats with nitrogen” or “makes nitrogen-containing,” mainly in technical contexts.","zh":"azotises 指“用氮处理/使含氮化”，主要见于技术或科学语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(3rd person singular present) to treat something with nitrogen, or to convert it into a nitrogen-containing form (used mainly in technical/scientific writing).","zh":"（第三人称单数现在时）用氮处理某物，或使其转变为含氮的形式（主要用于技术/科学语境）。"},"examples":[{"en":"The process azotises the mixture to reduce unwanted reactions with oxygen.","zh":"该过程用氮处理混合物，以减少与氧发生的不必要反应。"},{"en":"In some industrial settings, the chamber azotises the gas stream before storage.","zh":"在一些工业场景中，设备会先对气流进行氮化处理再储存。"}]}],"synonyms":["nitrogenates","treats with nitrogen","purges with nitrogen"],"phonetic":"əˈzoʊtaɪz","extraExplanation":["“azotises” 来自动词 “azotise”（美式更常见拼写为 “azotize”）。词根 “azote” 是法语里对“氮”的旧称（历史上曾认为它“不支持生命”，与英文 nitrogen 的命名史有关）。","该词不常用于日常英语，更常见的表达通常是 “nitrogenate / treat with nitrogen / purge with nitrogen”。"]}
{"word":"azotising","summary":{"en":"Azotising means introducing nitrogen into a material (nitrogenizing), especially as an industrial or chemical treatment.","zh":"Azotising 指向材料中引入氮（氮化/加氮处理），多用于工业或化学处理语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of adding nitrogen (or nitrogen compounds) to something; nitrogenizing","zh":"（向某物）加入氮（或含氮化合物）的过程；使其氮化"},"examples":[{"en":"The steel undergoes azotising to improve surface hardness and wear resistance.","zh":"这种钢材经过氮化处理，以提高表面硬度和耐磨性。"},{"en":"Azotising can be done in a controlled furnace atmosphere.","zh":"氮化处理可以在可控的炉内气氛中进行。"}]},{"partOfSpeech":"v.","definition":{"en":"adding nitrogen to; treating something so that nitrogen is introduced (present participle of “azotise/azotize”)","zh":"正在加氮；用氮处理（“azotise/azotize”的现在分词）"},"examples":[{"en":"They are azotising the metal parts before final polishing.","zh":"他们在最终抛光前正在对金属零件进行氮化处理。"},{"en":"The technician explained the risks of azotising at too high a temperature.","zh":"技术员解释了温度过高进行氮化处理的风险。"}]}],"synonyms":["nitrogenizing","nitriding (technical)","adding nitrogen"],"phonetic":"əˈzoʊtaɪzɪŋ","extraExplanation":["“azot-”来自法语 azote（旧称“氮”，意为“无生命的”），因此 azotise/azotize 在一些科技语境中可理解为“引入氮/使氮化”。","拼写上，英式常见 azotise / azotising，美式更常见 azotize / azotizing；含义通常相同，但多用于化学、冶金等专业领域。"]}
{"word":"azotite","summary":{"en":"Azotite is an uncommon, older term meaning “nitrite.”","zh":"Azotite 是较少见的旧用词，意思是“亚硝酸盐（nitrite）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry, uncommon/older use) A nitrite; a salt or ester of nitrous acid (HNO₂).","zh":"（化学，较少见/旧用法）亚硝酸盐；亚硝酸（HNO₂）的盐或酯。"},"examples":[{"en":"In older chemistry texts, “azotite” may be used where modern writers say “nitrite.”","zh":"在较早的化学文献里，“azotite”有时用来表示现代所说的“nitrite（亚硝酸盐）”。"},{"en":"Sodium azotite (more commonly: sodium nitrite) can be written as NaNO₂.","zh":"sodium azotite（更常见写法：sodium nitrite，亚硝酸钠）可写作 NaNO₂。"}]}],"synonyms":["nitrite"],"phonetic":"/əˈzoʊtaɪt/","extraExplanation":["词源上与法语/早期化学命名有关：*azote* 指“氮”（字面含义接近“无生命”），因此 *azotite* 在一些旧式体系里用于指与“含氮的亚硝酸”相关的盐类。现代英语中通常直接用 **nitrite**，所以你在当代教材或论文里很少见到 *azotite*。"]}
{"word":"azotize","summary":{"en":"Azotize means to add nitrogen to something or make it nitrogenous; it’s a rare, older scientific term.","zh":"azotize 指给某物加氮或使其含氮化；属于较少见、偏旧的科学用语。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to add nitrogen to something; to make it nitrogenous (often through chemical treatment)","zh":"使……含氮；给……加氮（常指用化学方法处理）"},"examples":[{"en":"Some fertilizers are designed to azotize the soil so crops can grow faster.","zh":"有些肥料旨在给土壤加氮，使作物长得更快。"},{"en":"The process helps azotize organic material during industrial treatment.","zh":"在工业处理中，这个过程有助于使有机材料含氮化。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare) to convert something into nitrogen (older term: “azote”) or to treat it with nitrogen gas","zh":"（罕见）使……转变为氮（旧称 azote）；用氮气处理……"},"examples":[{"en":"In older scientific writing, authors might say a substance was azotized by exposure to nitrogen.","zh":"在较早的科学文献里，作者可能会说某物因接触氮而“被氮化（azotized）”。"}]}],"synonyms":["nitrogenate","enrich with nitrogen","add nitrogen to","nitrify (related, but not identical)"],"phonetic":"/əˈzoʊ.taɪz/","extraExplanation":["“azotize”源自早期化学用语“azote”（指氮）。现代英语里更常见、更自然的说法通常是 “add nitrogen to… / nitrogenate… / enrich… with nitrogen”，所以在当代日常与学术写作中它比较少见。"]}
{"word":"azotized","summary":{"en":"Azotized is a technical word meaning “nitrogen-containing” or “treated to introduce nitrogen,” and it can also describe fabric treated in an azo-dye process.","zh":"Azotized 是较专业的词，指“含氮的/经处理引入氮的”，也可指在偶氮染料工艺中处理过的织物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(chemistry) Containing nitrogen; treated so that nitrogen is introduced into a substance.","zh":"（化学）含氮的；经处理使物质引入氮（或氮基团）的。"},"examples":[{"en":"The sample was azotized to improve its chemical reactivity.","zh":"该样品经过含氮处理（azotized），以提高其化学反应性。"},{"en":"Researchers compared azotized and non-azotized materials under the same conditions.","zh":"研究人员在相同条件下比较了含氮处理与未处理的材料。"}]},{"partOfSpeech":"adj.","definition":{"en":"(dyeing/textiles) Treated as part of an azo-dye process, especially to create or fix color on fabric.","zh":"（染整/纺织）在偶氮染料工艺中进行处理的，尤指用于生成或固色于织物的。"},"examples":[{"en":"The cotton was azotized before the final dye bath.","zh":"棉布在最后一道染浴前进行了偶氮化处理（azotized）。"},{"en":"Azotized fabrics can show stronger, more stable shades.","zh":"经过偶氮化处理的织物颜色可能更浓、更稳定。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past form of “azotize”: to introduce nitrogen into something or to apply an azo-related treatment (technical use).","zh":"“azotize”的过去式/过去分词：使……含氮；或进行偶氮相关处理（技术用语）。"},"examples":[{"en":"They azotized the solution and then measured the change in color.","zh":"他们对溶液进行了含氮处理（azotized），随后测量颜色变化。"}]}],"synonyms":["nitrogenated","nitrided (context-specific)","azo-treated","nitrogen-containing"],"phonetic":"/əˈzoʊtaɪzd/","extraExplanation":["“azote”是早期对“氮（nitrogen）”的称呼，源自法语，常被解释为“无生命的”（因氮气不支持燃烧与呼吸）。因此 azotize/azotized 在较旧或专业文献中常指“引入氮”或“与氮相关的处理”。","在现代英语里，这个词非常少见，更常见的表达是 nitrogenated / nitrided（材料学中的“渗氮”）或使用更具体的工艺名（如 azo dye process）。"]}
{"word":"azotizes","summary":{"en":"“Azotizes” means “adds nitrogen to; treats something by introducing nitrogen,” and it is a rare, technical verb form.","zh":"“azotizes”意为“使含氮/引入氮进行处理”，是较少见的专业动词形式（第三人称单数）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Chemistry) to add nitrogen to something; to treat or modify a substance by introducing nitrogen (e.g., in a chemical process).","zh":"（化学）使含氮；向某物中引入氮，或用氮进行处理/改性（用于化学过程）。"},"examples":[{"en":"The catalyst azotizes the compound, changing its reactivity.","zh":"该催化剂使化合物发生含氮化，从而改变其反应性。"},{"en":"In this step, the mixture azotizes under high pressure.","zh":"在这一步，混合物在高压下发生含氮化处理。"}]},{"partOfSpeech":"v.","definition":{"en":"(Less common) to convert something into a form rich in nitrogen or “azote” (an older term for nitrogen).","zh":"（较少见）使某物转变为富含氮的形式；“azote”（旧称“氮”）化。"},"examples":[{"en":"Some older texts say the process azotizes the air in the chamber.","zh":"一些较早的文献说，该过程会使腔室中的空气“氮化”。"}]}],"synonyms":["nitrogenate","nitrogenize","add nitrogen to"],"phonetic":"əˈzoʊtaɪz","extraExplanation":["“azotizes”是动词“azotize”的第三人称单数现在时（he/she/it azotizes）。该词非常偏专业，主要出现在化学或早期科学写作中。","“azote”是“氮”的旧称，源自法语（意为“无生命”），因为氮气不支持燃烧与呼吸；现代英语更常用“nitrogen”以及“nitrogenate / nitrogenize”等表达。"]}
{"word":"azotizing","summary":{"en":"Azotizing means carrying out a nitrogen-related chemical treatment, often to form an azo compound for dyes.","zh":"azotizing 指进行与氮相关的化学处理，常指生成偶氮化合物以用于染料。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Chemistry) The process of treating something with nitrogen or converting it into a nitrogen-containing form; especially, forming an azo compound (often used in dye-making).","zh":"（化学）使物质与氮有关地发生处理或转化为含氮形式；尤指生成偶氮化合物（常见于染料制造）。"},"examples":[{"en":"The technician is azotizing the aromatic compound to prepare an azo dye.","zh":"技术员正在对芳香族化合物进行偶氮化处理，以制备偶氮染料。"},{"en":"Azotizing is a key step in some industrial colorant processes.","zh":"在一些工业着色剂工艺中，偶氮化是关键步骤。"}]}],"synonyms":["nitrogenating","diazotizing (related in dye chemistry)"],"phonetic":"/əˈzoʊtaɪzɪŋ/","extraExplanation":["“azotize / azotizing”属于化学与工业染料领域的专业词汇，日常英语中很少使用。阅读化工、染料、纺织整理或有机合成相关资料时更常见。","词根“azot-”来自“azote（旧称：氮）”，因此该词通常与“引入氮/形成含氮结构（尤其是偶氮基 -N=N-）”相关。"]}
{"word":"Azotobacter","summary":{"en":"Azotobacter is a group of soil bacteria known for fixing nitrogen and helping plant growth.","zh":"Azotobacter（固氮菌属）是一类以固氮著称的土壤细菌，有助于提高土壤肥力和植物生长。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of free-living soil bacteria that fix nitrogen (turn nitrogen in the air into forms plants can use).","zh":"固氮菌属（生活在土壤中的自由生活细菌，能把空气中的氮转化为植物可利用的形态）。"},"examples":[{"en":"Azotobacter can improve soil fertility by fixing atmospheric nitrogen.","zh":"固氮菌属可以通过固定空气中的氮来提高土壤肥力。"},{"en":"Some farmers use biofertilizers containing Azotobacter to support plant growth.","zh":"一些农民会使用含固氮菌属的生物肥料来促进植物生长。"},{"en":"In microbiology class, we learned how Azotobacter differs from symbiotic nitrogen-fixing bacteria.","zh":"在微生物课上，我们学习了固氮菌属与共生固氮细菌的不同。"}]}],"synonyms":["nitrogen-fixing bacteria","free-living nitrogen fixer","biofertilizer bacteria"],"phonetic":"/əˌzoʊtəˈbæk.tɚ/","extraExplanation":["词源提示：azo- 与“氮”（nitrogen）有关，-bacter 相关于“细菌”。这个名字强调它与“固氮”能力的联系。","使用语境：常见于农业、土壤科学与微生物学文章中，讨论“生物肥料、土壤健康、减少化学氮肥使用”等话题。"]}
{"word":"azotobacter","summary":{"en":"Azotobacter is a type of soil bacteria known for fixing nitrogen from the air.","zh":"Azotobacter（固氮菌属）是一类以固氮著称的土壤细菌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of free-living soil bacteria that convert nitrogen from the air into forms plants can use (nitrogen fixation).","zh":"固氮菌属：一种生活在土壤中的自由生活细菌，能把空气中的氮转化为植物可利用的形式（固氮作用）。"},"examples":[{"en":"Azotobacter helps improve soil fertility by fixing atmospheric nitrogen.","zh":"固氮菌属通过固定空气中的氮来帮助提高土壤肥力。"},{"en":"Some farmers use biofertilizers containing Azotobacter to support plant growth.","zh":"一些农民会使用含固氮菌属的生物肥料来促进作物生长。"},{"en":"In microbiology class, we learned how Azotobacter forms protective cysts in harsh conditions.","zh":"在微生物课上，我们学到固氮菌属在恶劣环境下会形成保护性囊体。"}]}],"synonyms":["nitrogen-fixing bacteria","free-living nitrogen fixer"],"phonetic":"əˌzoʊtəˈbæk.tɚ","extraExplanation":["词源提示：azoto- 来自法语/希腊语词根，和“氮（nitrogen）”有关；-bacter 指“细菌”。所以它的名字直观地暗示了“与氮相关的细菌”。","学习延伸：它属于“自由生活固氮菌”（不一定要和豆科植物共生），常出现在农业与土壤生态学语境中，常与“biofertilizer（生物肥料）”“nitrogen fixation（固氮）”一起出现。"]}
{"word":"Azotobacterieae","summary":{"en":"Azotobacterieae is a scientific taxonomic name for a group of soil bacteria associated with *Azotobacter*, known for nitrogen fixation.","zh":"Azotobacterieae 是与固氮菌属相关的一类土壤细菌的科学分类名称，以固氮能力而被提及。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a taxonomic group (a tribe) of nitrogen-fixing bacteria related to the genus *Azotobacter*, found especially in soil.","zh":"一种细菌分类单元（“族/部”级别），与固氮菌属（*Azotobacter*）相关，常见于土壤环境，具有固氮能力。"},"examples":[{"en":"Some older microbiology texts classify *Azotobacter* and its close relatives under the tribe Azotobacterieae.","zh":"一些较早的微生物学教材会把固氮菌属及其近缘类群归入 Azotobacterieae 这一族。"},{"en":"Azotobacterieae are often mentioned when discussing free-living nitrogen fixation in agricultural soils.","zh":"在讨论农业土壤中的“自由生活型固氮”时，常会提到 Azotobacterieae。"}]}],"synonyms":["Azotobacter group","azotobacter-like bacteria"],"phonetic":"/ˌeɪzoʊˌbæk.tɪˈrɪ.iːiː/","extraExplanation":["这是一个偏“旧式/文献中常见”的分类名称：不同年代与不同分类系统（基于形态、生理或基因序列）对细菌的分组可能不一样，所以你在新旧资料里可能会看到归属变化。","词形来源：Azo-（与氮有关）+ bacter（细菌）+ -ieae（拉丁化的分类后缀，常用于表示某一“族/部”层级）。"]}
{"word":"azotobacterieae","summary":{"en":"Azotobacterieae is an older taxonomic name for a group of nitrogen-fixing bacteria related to *Azotobacter*.","zh":"Azotobacterieae 是一个较旧的分类名称，指与固氮菌属 *Azotobacter* 相关的一类固氮细菌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a taxonomic group (historically treated as a tribe) of nitrogen-fixing bacteria related to the genus *Azotobacter*.","zh":"一种细菌的分类群（历史上常被视为“族/tribe”），与固氮菌属 *Azotobacter* 相关，能把空气中的氮转化为可利用的氮化合物。"},"examples":[{"en":"Some older microbiology texts mention Azotobacterieae when describing aerobic nitrogen-fixing bacteria.","zh":"一些较早的微生物学教材在介绍好氧固氮细菌时会提到 Azotobacterieae。"},{"en":"Researchers compared strains once placed in Azotobacterieae using modern genetic methods.","zh":"研究人员用现代遗传学方法比较了过去曾被归入 Azotobacterieae 的菌株。"}]}],"synonyms":["Azotobacteraceae (related term)","Azotobacter (related genus)"],"phonetic":"/əˌzoʊtoʊbækˌtɪriˈiːaɪ/","extraExplanation":["这个词多见于较旧的分类体系或特定文献中；现代分类更常用的是以“科（-aceae）/属（genus）”等层级来表述，例如你可能更常看到 *Azotobacteraceae* 或直接用 *Azotobacter*（固氮菌属）。","拼写上你给出的 “Azotobacterieae” 以 -eae 结尾，常见于某些“族/tribe”名称；不同年代或不同作者的分类处理可能不一致。检索文献时可同时用近似拼写与相关上位分类一起查。"]}
{"word":"azotoluene","summary":{"en":"Azotoluene is an azo-containing toluene compound used mainly in dye/pigment chemistry.","zh":"Azotoluene（偶氮甲苯）是含偶氮基的甲苯类化合物，主要用于染料/颜料化学。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound containing an azo group (–N=N–) and a toluene ring; often used as an intermediate in making dyes and pigments.","zh":"一种含有偶氮基（–N=N–）并与甲苯芳环相连的化合物；常用于染料与颜料制造的中间体。"},"examples":[{"en":"Some synthetic dyes are made from azo compounds such as azotoluene.","zh":"一些合成染料由偶氮化合物制成，例如偶氮甲苯。"},{"en":"Azotoluene is mainly discussed in industrial and organic chemistry contexts, not in everyday English.","zh":"“azotoluene（偶氮甲苯）”主要出现在工业与有机化学语境中，并不常用于日常英语。"}]}],"synonyms":["azo toluene","azotoluol"],"phonetic":"/ˌeɪzoʊˈtɑːljuːin/","extraExplanation":["“azo-（偶氮-）”表示分子中含有 –N=N– 的结构，这类结构常与颜色有关，因此许多“azo compounds（偶氮化合物）”与染料、颜料工业联系紧密。","该词属于专业化学词汇；不同资料可能把它作为一类相关异构体/衍生物的统称，具体结构需看上下文（例如取代位置、制备路线等）。"]}
{"word":"azotometer","summary":{"en":"An azotometer is a lab device for measuring nitrogen gas volume, often used in nitrogen analysis.","zh":"azotometer（测氮计）是一种用于测量氮气体积、常用于含氮分析的实验室仪器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A laboratory instrument used to measure the volume of nitrogen gas produced or present in a chemical reaction (often for analyzing nitrogen content in a sample).","zh":"一种实验室仪器，用于测量化学反应中产生或存在的氮气（N₂）体积，常用于测定样品中的含氮量。"},"examples":[{"en":"In the analysis, the technician collected the released nitrogen and read its volume on the azotometer.","zh":"在该分析中，技术员收集释放出的氮气，并在测氮计上读出其体积。"},{"en":"Older nitrogen-determination methods sometimes used an azotometer instead of modern automated analyzers.","zh":"较早的含氮测定方法有时会使用测氮计，而不是现代自动分析仪。"}]}],"synonyms":["nitrogen meter","gas burette (in nitrogen measurement contexts)"],"phonetic":"/əˌzoʊˈtɑːmɪtɚ/","extraExplanation":["“Azoto-”来自法语/希腊语词根，意为“氮”（nitrogen）；“azotometer”字面意思就是“测量氮的仪器”。","它常出现在经典分析化学语境中（例如早期的氮含量测定），现代实验室更常见的是元素分析仪或气相色谱等设备。"]}
{"word":"azotorrhea","summary":{"en":"Azotorrhea is a medical term for unusually high excretion of nitrogen (especially urea) in urine.","zh":"Azotorrhea 指尿液中异常大量排出含氮废物（尤指尿素）的医学术语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) The excretion of an unusually large amount of nitrogen-containing waste (especially urea) in the urine.","zh":"（医学）氮质尿：尿液中排出异常大量含氮废物（尤指尿素）。"},"examples":[{"en":"The doctor noted azotorrhea and ordered tests to check kidney function and protein breakdown.","zh":"医生注意到氮质尿，并安排检查以评估肾功能和蛋白质分解情况。"},{"en":"Severe illness or a very high-protein diet can sometimes be associated with azotorrhea.","zh":"严重疾病或极高蛋白饮食有时可能与氮质尿有关。"},{"en":"In the report, azotorrhea was described as increased urinary nitrogen loss over several days.","zh":"报告中将氮质尿描述为连续数日尿氮排出增加。"}]}],"synonyms":["azoturia","increased urinary nitrogen (loss)","nitrogenuria"],"phonetic":"/ˌeɪzoʊtəˈriə/","extraExplanation":["该词较少见，属于医学/生理学术语，常出现在实验数据或病历记录中。日常英语里更常见的相关说法是“high urea in urine（尿中尿素偏高）”或“increased urinary nitrogen（尿氮增加）”。","词源上，azo- 与“氮（nitrogen）”相关，-rrhea 表示“流出/分泌”（如 diarrhea 腹泻），整体含义就是“含氮物质排出过多”。"]}
{"word":"azotorrhoea","summary":{"en":"Azotorrhoea is a rare medical term meaning unusually high excretion of nitrogen (especially urea) in urine.","zh":"Azotorrhoea 是较少见的医学术语，指尿中氮（尤其尿素）排出异常增多。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) An abnormally large excretion of nitrogenous waste (especially urea) in the urine.","zh":"（医学）尿中含氮废物（尤其是尿素）排出量异常增多。"},"examples":[{"en":"The lab report suggested azotorrhoea, so the doctor checked the patient’s diet and kidney function.","zh":"化验报告提示可能有氮质尿（azotorrhoea），所以医生检查了患者的饮食和肾功能。"},{"en":"Azotorrhoea can sometimes appear with fever or a very high‑protein diet.","zh":"发热或极高蛋白饮食有时会出现氮质尿（azotorrhoea）。"}]}],"synonyms":["azoturia","nitrogenuria"],"phonetic":"/ˌeɪzoʊtəˈriə/","extraExplanation":["词源提示：azoto- 来自法语/希腊语传统中对“氮（nitrogen）”的称呼（azote），-rrhoea 表示“流出、过量排出”。因此这个词整体就有“含氮物质过量排出”的意思。","使用场景：该词非常偏医学与生化检验语境，日常英语中几乎不用；临床上更常见的相关词是 azoturia（氮尿）或用更通俗的说法描述“尿素/尿氮升高、氮排泄增加”。"]}
{"word":"Azotos","summary":{"en":"Azotos is the Greek (New Testament) name for the ancient city of Ashdod.","zh":"Azotos 是古城亚实突（Ashdod）的希腊语名称，常见于《新约》语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Greek name for Ashdod, an ancient coastal city in the southern Levant (in today’s Israel), mentioned in the Bible (especially in the New Testament).","zh":"亚锁都（Azotos）：亚实突（Ashdod）的希腊语名称；古代地中海沿岸城市（今以色列境内），在《圣经》中出现，尤其见于《新约》。"},"examples":[{"en":"In Acts 8:40, Philip is said to have passed through Azotos.","zh":"《使徒行传》8:40 记载腓利经过了亚锁都（Azotos）。"},{"en":"Some English Bible translations use “Azotus,” while others use “Ashdod.”","zh":"一些英文《圣经》译本用 “Azotus”，另一些则用 “Ashdod（亚实突）”。"}]}],"synonyms":["Ashdod","Azotus"],"phonetic":"/əˈzoʊtəs/","extraExplanation":["Azotos（也常写作 Azotus）来自希腊语形式，指的就是旧约中常见的非利士五大城之一“亚实突（Ashdod）”。在希腊化时代和《新约》语境里，地名常以希腊语拼写出现，因此会看到 Azotos/Azotus 这种写法。","如果你是在地图、历史书或《圣经》里遇到 “Azotos”，通常可以直接对应到现代地名 Ashdod（亚实突）。"]}
{"word":"azotous","summary":{"en":"Azotous means “containing nitrogen,” and it is an older/less common word for nitrogenous.","zh":"azotous 意为“含氮的”，是较旧、较少用的 nitrogenous 的说法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing nitrogen; nitrogenous.","zh":"含氮的；氮质的。"},"examples":[{"en":"Many azotous compounds are important in living organisms because nitrogen is part of proteins.","zh":"许多含氮化合物在生物体内很重要，因为蛋白质中含有氮。"},{"en":"Older chemistry books may describe certain fertilizers as azotous materials.","zh":"较早的化学书可能会把某些肥料称为“含氮物质（azotous materials）”。"}]}],"synonyms":["nitrogenous","nitric (in some contexts)"],"phonetic":"/ˈæzəˌtoʊs/","extraExplanation":["“azotous”是较少见、偏旧式的科学用词，更常见的现代表达是“nitrogenous”。","“azote”一词源自法语，历史上用来指“氮”（nitrogen）。因此“azotous”字面意思就是“与氮有关/含氮的”。"]}
{"word":"azoturia","summary":{"en":"Azoturia is a medical term for abnormally high nitrogenous wastes in urine; in veterinary use, it can also refer to a horse “tying-up” disorder (an older term).","zh":"Azoturia 指尿中含氮代谢废物异常增多；在兽医语境中，它也可作马“系住病/僵住病”（旧称）之意。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the presence of unusually high levels of nitrogen-containing wastes (especially urea) in the urine","zh":"（医学）尿中含氮代谢废物（尤其是尿素）异常增多；尿氮升高"},"examples":[{"en":"The lab report suggested azoturia, so the doctor ordered kidney function tests.","zh":"化验报告提示可能有尿氮升高，因此医生安排了肾功能检查。"},{"en":"Severe dehydration can contribute to azoturia because the urine becomes more concentrated.","zh":"严重脱水会使尿液更浓缩，从而可能导致尿氮升高。"}]},{"partOfSpeech":"n.","definition":{"en":"(veterinary) an older term for a muscle disorder in horses often called “tying-up” (exertional rhabdomyolysis), historically linked to dark urine after exercise","zh":"（兽医）旧称马“系住病/僵住病”（运动性横纹肌溶解），过去常与运动后出现深色尿相关"},"examples":[{"en":"The vet warned that some horses are prone to azoturia if they rest for days and then exercise hard.","zh":"兽医提醒：有些马休息几天后突然剧烈运动，容易发生“系住病”（旧称 azoturia）。"},{"en":"Today, many veterinarians prefer the term exertional rhabdomyolysis rather than azoturia.","zh":"如今许多兽医更常用“运动性横纹肌溶解”来替代 azoturia 这一旧称。"}]}],"synonyms":["(medical) excess urinary nitrogen","(related) hyperurea in urine","(veterinary, modern term) exertional rhabdomyolysis","tying-up (horses)"],"phonetic":"/ˌæzoʊˈtjʊriə/","extraExplanation":["词源提示：azot- 来自法语/希腊语系，和“氮（nitrogen）/含氮物质”相关；-uria 表示“尿/尿中状况”（常见于 medical terms，如 hematuria 血尿）。","使用场景：在人类医学中，它多指“尿里含氮废物偏高”；在马科动物的语境里，azoturia 常是历史用法，现代更推荐使用更精确的诊断名词（exertional rhabdomyolysis）。"]}
{"word":"azoturias","summary":{"en":"Azoturias is the plural of azoturia: either (1) excess nitrogenous wastes in urine, or (2) in horses, a muscle-breakdown condition (“tying-up”).","zh":"Azoturias 是 azoturia 的复数：可指（1）尿中含氮废物（尤指尿素）异常增多；也可在马匹兽医语境中指“tying-up（运动后肌溶解）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of azoturia: an unusually high amount of nitrogen-containing waste products (especially urea) in the urine","zh":"azoturia 的复数：尿中含氮代谢废物（尤指尿素）异常增多的情况"},"examples":[{"en":"The lab report mentioned azoturias as a sign of possible kidney stress.","zh":"化验报告提到“azoturias”，提示可能存在肾脏压力/负担。"},{"en":"Doctors investigate azoturias by checking blood urea nitrogen (BUN) and urine tests.","zh":"医生会通过血尿素氮（BUN）和尿检来进一步评估 azoturias。"}]},{"partOfSpeech":"n.","definition":{"en":"(veterinary) the plural of azoturia: a painful muscle disorder in horses, often called “tying-up,” linked to muscle breakdown after exercise","zh":"（兽医）azoturia 的复数：马匹一种疼痛性的肌肉疾病，常被称为“tying-up（拴住病/运动后肌溶解）”，与运动后肌肉分解有关"},"examples":[{"en":"The vet warned that sudden hard workouts can trigger azoturias in some horses.","zh":"兽医提醒，突然的高强度训练可能会诱发某些马的 azoturias。"},{"en":"Signs of azoturias include stiffness and reluctance to move after exercise.","zh":"azoturias 的表现可能包括僵硬、运动后不愿走动。"}]}],"synonyms":["azoturia (singular)","excess urea in urine (general sense)","tying-up (horse)","exertional rhabdomyolysis (horse)"],"phonetic":"/ˌæzoʊˈtjʊriəz/","extraExplanation":["“azot-”来自法语/希腊语传统中对“氮（nitrogen）”的称呼，因此 azoturia 字面上与“含氮物质的尿”相关。","在英语医学语境里，azoturia 较少作为日常临床常用词；更常见的相关表达是 elevated urea/urea in urine、azotemia（血中含氮废物升高）等。","在马匹兽医学里，azoturia 常专指“运动性横纹肌溶解（exertional rhabdomyolysis）/tying-up”，与人类医学里“尿中尿素增多”的一般含义有所区别，阅读文章时要看上下文。"]}
{"word":"Azov","summary":{"en":"Azov usually refers to a place name (the city of Azov in Russia or the Sea of Azov). In some news contexts, it can also refer to a Ukrainian military unit called “Azov.”","zh":"Azov（亚速）通常是地名（俄罗斯的亚速市或亚速海）；在部分新闻语境中也可能指名为“亚速”的乌克兰军事部队。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a city in southwestern Russia near the mouth of the Don River (also called Azov).","zh":"亚速：俄罗斯西南部的一座城市，位于顿河入海口附近。"},"examples":[{"en":"Azov is located near the Don River, not far from the Sea of Azov.","zh":"亚速位于顿河附近，离亚速海不远。"},{"en":"The traveler passed through Azov on the way to Rostov-on-Don.","zh":"旅行者在前往顿河畔罗斯托夫的途中经过了亚速。"}]},{"partOfSpeech":"other","definition":{"en":"the Sea of Azov, a shallow sea connected to the Black Sea, between southern Ukraine and southwestern Russia.","zh":"亚速海：连接黑海的一片浅海，位于乌克兰南部与俄罗斯西南部之间。"},"examples":[{"en":"The Sea of Azov is known for being relatively shallow.","zh":"亚速海以水深较浅而闻名。"},{"en":"Ports along the Sea of Azov are important for regional shipping.","zh":"亚速海沿岸港口对区域航运很重要。"}]},{"partOfSpeech":"other","definition":{"en":"in modern news contexts, “Azov” may refer to Ukraine’s Azov unit (a military formation).","zh":"在当代新闻语境中，“Azov/亚速”也可能指乌克兰的“亚速”部队（一个军事编制）。"},"examples":[{"en":"In some reports, “Azov” refers to a specific Ukrainian military unit rather than a place.","zh":"在一些报道中，“Azov/亚速”指的是乌克兰某支特定部队，而不是地名。"},{"en":"Be careful with context: “Azov” can mean the sea, the city, or the unit.","zh":"要注意上下文：“Azov/亚速”可能指亚速海、亚速市，或该部队。"}]}],"synonyms":["Sea of Azov"],"phonetic":"/ˈɑːzɔːv/","extraExplanation":["“Azov/Азов”的英文写法来自俄语/乌克兰语的转写；在地图与新闻中常见。","学习时建议搭配关键词判断含义：the Sea of Azov（亚速海）、the city of Azov（亚速市）、Azov unit/regiment（亚速部队）。","由于该词在国际新闻中可能涉及战争与政治争议，阅读时更要核对来源与语境，避免把地名与组织名称混淆。"]}
{"word":"azovernine","summary":{"en":"“over nine” means more than nine; sometimes it can mean around/after 9 o’clock depending on context.","zh":"“over nine”通常表示“超过九个/多于九”；在特定语境下也可指“大约九点左右或九点之后”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"more than nine (used to talk about a number, amount, or group larger than 9)","zh":"超过九个；多于九（用于数量、金额或人数大于9）"},"examples":[{"en":"There were over nine people waiting in line.","zh":"排队等候的人超过九个。"},{"en":"The trip will take over nine hours by bus.","zh":"坐公交这趟行程要超过九个小时。"}]},{"partOfSpeech":"phrase","definition":{"en":"(less common) around or after 9 o’clock, depending on context","zh":"（较少见）大约九点左右或九点之后（取决于语境）"},"examples":[{"en":"Let’s talk over nine tonight, after dinner.","zh":"我们今晚九点左右（或九点之后）吃完晚饭再聊。"}]}],"synonyms":["more than nine","above nine","greater than nine"],"phonetic":"ˌoʊvɚ ˈnaɪn","extraExplanation":["“azovernine”不是常见的英文单词，看起来更像把“over nine”连写在一起（例如用户名、标签或输入时少了空格）。如果你原本想表达“截至九点/从九点起”，更常见的说法是“as of nine (o’clock)”或“from nine (o’clock)”。你想表达的是“数量超过9”，还是“时间到/从9点开始”？我可以按你的意思给出更准确的词条。"]}
{"word":"azox","summary":{"en":"“azox” is a chemistry form used in compound names to mean “containing an azoxy group (–N=N(O)–).”","zh":"“azox”是化学构词成分，用于化合物名称中，表示“含偶氮氧基（–N=N(O)–）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a chemistry combining form meaning “related to an azoxy group” (a functional group with the pattern –N=N(O)–), often used in names of organic compounds.","zh":"（化学）构词成分，表示“与偶氮氧基有关”的；常用于有机化合物命名，指含有 –N=N(O)– 这一官能团的结构。"},"examples":[{"en":"Azoxybenzene is an azox compound containing the –N=N(O)– group.","zh":"偶氮氧基苯（azoxybenzene）是一种含有 –N=N(O)– 的“azox”类化合物。"},{"en":"In older texts, “azox-” may appear in compound names to signal an azoxy linkage.","zh":"在较早的文献中，“azox-”可能出现在化合物名称里，用来提示含有偶氮氧键连接。"}]}],"synonyms":["azoxy-"],"phonetic":"/ˈeɪzɑks/","extraExplanation":["“azox- / azoxy-”通常出现在有机化学命名中：azoxy 指“偶氮氧基”，结构核心是两个氮之间形成 N=N，并且其中一个氮与氧相连（N→O 或写作 N(O)）。这类化合物常见于染料化学和有机反应体系中。","日常英语中几乎不会单独使用“azox”，更多是作为词根出现在专业术语（如 azoxybenzene）里。"]}
{"word":"azoxazole","summary":{"en":"A rare chemistry term referring (often loosely) to an oxazole-related nitrogen–oxygen aromatic heterocycle.","zh":"一个较少见的化学术语，通常（有时较宽泛地）指与恶唑相关的含氮-含氧芳香杂环。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A type of nitrogen–oxygen heterocyclic ring system related to oxazole; the term is sometimes used loosely or inconsistently to refer to oxazole-like aromatic compounds used as building blocks in medicinal chemistry.\nExamples: • en: This drug candidate contains an azoxazole-like ring. • zh: 这个候选药物含有类似 azoxazole 的环结构。 • en: Researchers used the azoxazole unit to tune fluorescence. • zh: 研究人员用 azoxazole 片段来调节荧光性质。","zh":"（化学）一种与 oxazole（恶唑）相关的含氮-含氧杂环骨架；该词在不同资料中可能存在不够统一的用法，有时被宽泛地用来指“类似 oxazole 的芳香杂环”，常见于药物化学中的结构片段。\n例句：• en: This drug candidate contains an azoxazole-like ring. • zh: 这个候选药物含有类似 azoxazole 的环结构。 • en: Researchers used the azoxazole unit to tune fluorescence. • zh: 研究人员用 azoxazole 片段来调节荧光性质。"},"examples":[{"en":"This drug candidate contains an azoxazole-like ring.","zh":"这个候选药物含有类似 azoxazole 的环结构。"},{"en":"Researchers used the azoxazole unit to tune fluorescence.","zh":"研究人员用 azoxazole 片段来调节荧光性质。"}]}],"synonyms":["oxazole","isoxazole","heterocycle"],"phonetic":"/ˌeɪzoʊˈɑksəˌzoʊl/","extraExplanation":["这个词在日常英语中几乎不用，主要出现在化学/药学语境里；不同数据库或论文中可能把它当作某种“恶唑类（oxazole-like）”杂环的泛称。","如果你其实想查的是更常见、定义更明确的词，可能是：oxazole（恶唑）或 isoxazole（异恶唑）。你也可以把原句/来源贴出来，我可以按上下文帮你确定具体指哪一种结构。"]}
{"word":"azoxime","summary":{"en":"Azoxime is a rare chemistry term for an azoxy/oxime-related organic compound, mainly seen in scientific writing.","zh":"Azoxime 是一个较少见的化学术语，指与偶氮氧基/肟相关的有机化合物，主要见于科研写作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A rare technical term for an organic compound (or class of compounds) that involves an azoxy-type nitrogen–oxygen linkage (often written as –N=N(O)–) in connection with an oxime-related structure; mainly used in chemical research contexts rather than everyday English.","zh":"（化学）一个较少见的专业术语，指含有偶氮氧基样氮-氧键（常写作 –N=N(O)–）并与肟（oxime）相关结构相连的有机化合物（或此类化合物）；多见于化学研究语境，不用于日常英语。"},"examples":[{"en":"Azoxime derivatives were prepared to study how the N–O linkage affects reactivity.","zh":"研究人员制备了 azoxime 衍生物，以考察 N–O 键对反应活性的影响。"},{"en":"The paper reports the synthesis of an azoxime intermediate under mild conditions.","zh":"论文报道了在温和条件下合成一种 azoxime 中间体。"}]}],"synonyms":["oxime (related term)","azoxy compound (related term)"],"phonetic":"/æˈzɑkˌsim/","extraExplanation":["这是非常偏专业的化学词汇，通常只会在研究论文、专利或化学命名中出现。一般学习英语时不常见；若你是在读文献遇到它，最好结合原文给出的结构式或 IUPAC 名称来确认它具体指哪一种“azoxime”结构。","构词上可拆成 a-（加强/连接成分）+ zo（与 azo“偶氮”相关）+ oxime（肟）。其中 oxime 在有机化学里常见，指含有 C=NOH（或其衍生形式）的官能团。"]}
{"word":"azoxine","summary":{"en":"Azoxine is a chemistry term for compounds containing an azoxy group (–N=N(O)–), sometimes used as dyes or analytical reagents.","zh":"Azoxine 是化学术语，指含偶氮氧基（–N=N(O)–）的化合物，有时用于染料或分析试剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a class of organic compounds that contain an azoxy group (–N=N(O)–), often used as intermediates in chemical synthesis or as dyes/reagents in analysis.","zh":"一类含有“偶氮氧基”（–N=N(O)–）的有机化合物，常用作化学合成的中间体，或作为染料/分析试剂。"},"examples":[{"en":"Azoxines are studied in organic chemistry because the –N=N(O)– group affects color and reactivity.","zh":"在有机化学中会研究 azoxine（类化合物），因为 –N=N(O)– 基团会影响颜色与反应性。"},{"en":"In some lab methods, an azoxine-based reagent can help measure metal ions by forming a colored complex.","zh":"在一些实验方法中，含 azoxine 结构的试剂可通过生成有色络合物来测定金属离子。"}]}],"synonyms":["azoxy compound","azoxy derivative"],"phonetic":"/əˈzɑːksiːn/","extraExplanation":["这是一个偏化学领域的词，日常英语中很少见。它与“azo-（偶氮）”相关：azo 通常指 –N=N–，而 azoxy/azoxine 相关结构多了一个氧（–N=N(O)–），因此常与颜色（染料）和分析化学中的显色反应联系在一起。","不同文献里 azoxine 有时也会被用作某些特定商品名/试剂名的一部分（例如用于金属离子比色测定的试剂），具体含义需结合上下文（论文、试剂说明书）。"]}
{"word":"azoxonium","summary":{"en":"A rare chemistry term for an azoxy-related oxonium-type cation (often a reactive intermediate or salt).","zh":"一个少见的化学术语，指与偶氮氧基相关、氧带正电的“氧鎓型”阳离子（常见于中间体或盐）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Organic chemistry) A positively charged ion related to an azoxy group (–N=N(O)–), where the oxygen bears the positive charge (an oxonium-type center); usually discussed as a reactive intermediate or in “azoxonium salts.”","zh":"（有机化学）与偶氮氧基（–N=N(O)–）有关的一类带正电的离子，其中氧原子带正电（类似氧鎓离子中心）；多作为反应中间体或以“azoxonium salts（偶氮氧鎓盐）”形式被讨论。"},"examples":[{"en":"The mechanism proposes formation of an azoxonium ion before the rearrangement step.","zh":"该机理提出在重排步骤之前会生成一个偶氮氧鎓离子。"},{"en":"Azoxonium salts can act as strong electrophiles in certain synthetic reactions.","zh":"在某些合成反应中，偶氮氧鎓盐可作为很强的亲电试剂。"}]}],"synonyms":["azoxonium ion","azoxy oxonium cation"],"phonetic":"/ˌeɪzɑkˈsoʊniəm/","extraExplanation":["这是非常专业且少见的化学术语，通常出现在研究论文或高级有机化学语境中，而不是一般英语词汇。","词形上可拆解为：azo-（与“偶氮 N=N”有关）+ oxonium（氧鎓离子，表示“氧带正电的离子”）。"]}
{"word":"azoxy","summary":{"en":"Azoxy is a chemistry term meaning “related to or containing the –N=N(O)– group,” often seen as the prefix azoxy- in compound names.","zh":"Azoxy 是化学术语，表示“与或含有 –N=N(O)– 基团有关”，常以 azoxy- 作为前缀出现在化合物名称中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) relating to an azoxy group or azoxy compounds, which contain the linkage –N=N(O)– between two parts of a molecule.","zh":"（化学）与“偶氮氧基/氧化偶氮基”（azoxy）或含有 –N=N(O)– 键的偶氮氧基化合物有关的。"},"examples":[{"en":"Azoxy compounds often have distinctive colors and are studied in dye chemistry.","zh":"偶氮氧基化合物常常具有明显的颜色，在染料化学中会被研究。"},{"en":"The paper describes the synthesis of an azoxy derivative from an aromatic precursor.","zh":"这篇论文描述了由芳香族前体合成一种偶氮氧基衍生物的方法。"}]},{"partOfSpeech":"other","definition":{"en":"a combining form (azoxy-) used in chemical names to indicate the presence of an –N=N(O)– group.","zh":"（构词）化学命名中的构词成分（azoxy-），表示分子中含有 –N=N(O)– 基团。"},"examples":[{"en":"Azoxybenzene is named for the azoxy- linkage in its structure.","zh":"Azoxybenzene（偶氮氧基苯）这个名称来自其结构中的 azoxy- 连接键。"}]}],"synonyms":["azoxy-"],"phonetic":"əˈzɑksi","extraExplanation":["“azoxy”主要出现在化学语境里，日常英语中几乎不会单独使用。它与“azo-（偶氮，–N=N–）”相关，但“azoxy”多了一个氧，结构上常写作 –N=N(O)–。"]}
{"word":"azoxyanisole","summary":{"en":"Azoxyanisole is a scientific term for a specific chemical compound, often used in research (not everyday English).","zh":"Azoxyanisole 是一个科研用语，指一种特定化学化合物（不属于日常英语词汇）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (often referring to 4,4′-azoxyanisole) used in research, especially in studies of liquid crystals and, historically, in some cancer research models.","zh":"一种化学化合物（常指 4,4′-偶氮氧基茴香醚），用于科研，尤其常见于液晶研究；历史上也曾用于某些癌症研究模型。"},"examples":[{"en":"Azoxyanisole is sometimes used as a model compound in liquid-crystal experiments.","zh":"Azoxyanisole 有时被用作液晶实验中的模型化合物。"},{"en":"Handle azoxyanisole with appropriate lab safety procedures and protective equipment.","zh":"处理 azoxyanisole 时应遵守实验室安全规范并佩戴防护装备。"}]}],"synonyms":["4,4′-azoxyanisole","PAA (in some research contexts)"],"phonetic":"/əˌzɑːksiˈænɪsoʊl/","extraExplanation":["词形拆分有助于记忆：azo- 表示“偶氮（与氮相关的结构）”，oxy- 表示“氧/含氧”，anisole 指“茴香醚（methoxybenzene）”。整体是化学命名构词，并非日常英语词汇。","它常见于化学与材料科学语境（例如“液晶相/mesophase”相关文献）。如果你在论文里看到它，通常是在讨论特定分子结构与材料性质。"]}
{"word":"azoxybenzene","summary":{"en":"Azoxybenzene is a yellow organic compound used mainly in chemistry research, related to azobenzene.","zh":"Azoxybenzene（氧偶氮苯）是一种黄色有机化合物，主要用于化学研究，与偶氮苯相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a yellow organic chemical compound (C12H10N2O) related to azobenzene, used mainly in chemical research and synthesis.","zh":"一种黄色的有机化合物（C12H10N2O），与偶氮苯相关，主要用于化学研究与合成。"},"examples":[{"en":"Azoxybenzene is often prepared in the lab as part of studying azo and azoxy compounds.","zh":"在实验室里，人们常制备 azoxybenzene 来研究偶氮与氧偶氮类化合物。"},{"en":"The sample turned yellow, which is typical of azoxybenzene and related dyes.","zh":"样品变成黄色，这常见于 azoxybenzene 及其相关染料类物质。"}]}],"synonyms":["oxygenated azobenzene (descriptive)"],"phonetic":"/əˌzɑːksiˈbɛnziːn/","extraExplanation":["从词源看：azo- 表示“偶氮（含 N=N 相关结构）”，oxy- 表示“氧/含氧”，benzene 表示“苯”。azoxybenzene（氧偶氮苯）可以理解为“带氧的偶氮苯相关化合物”。","它属于较专业的化学名词，日常英语交流中很少出现，多见于有机化学、染料化学或科研文献中。","注意与 azobenzene（偶氮苯）区分：两者结构相近，但 azoxybenzene 多一个与“氧”相关的结构特征，因此性质与用途也会有差异。"]}
{"word":"azoxybenzoic","summary":{"en":"A chemistry term meaning “related to or made of azoxybenzoic (azoxy + benzoic-acid) compounds,” often referring to azoxybenzoic acid or its derivatives.","zh":"化学术语，表示“与偶氮氧基苯甲酸（azoxy + benzoic）类化合物有关/由其构成”，常指偶氮氧基苯甲酸或其衍生物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Relating to or containing an azoxy group (–N(O)=N–) attached to a benzoic-acid ring; often used to describe compounds such as azoxybenzoic acid.","zh":"（化学）指含有“偶氮氧基”（–N(O)=N–）并连接在苯甲酸环上的；常用于描述如“偶氮氧基苯甲酸”等化合物。"},"examples":[{"en":"Researchers tested an azoxybenzoic derivative for its thermal properties.","zh":"研究人员测试了一种偶氮氧基苯甲酸衍生物的热学性质。"},{"en":"The paper reports the synthesis of an azoxybenzoic acid intermediate.","zh":"论文报道了一个偶氮氧基苯甲酸中间体的合成。"}]},{"partOfSpeech":"n.","definition":{"en":"An azoxybenzoic compound, especially azoxybenzoic acid (a specific aromatic carboxylic acid).","zh":"偶氮氧基苯甲酸类化合物；尤指“偶氮氧基苯甲酸”（一种特定的芳香族羧酸）。"},"examples":[{"en":"Azoxybenzoic is mainly encountered in older organic-chemistry literature.","zh":"“azoxybenzoic”主要出现在较早的有机化学文献中。"}]}],"synonyms":["azoxybenzoic acid (specific compound)"],"phonetic":"/əˌzɑːksiˌbɛnˈzoʊɪk/","extraExplanation":["这个词基本属于专业化学用语，日常英语几乎不会用到。多见于化学论文、专利或材料科学语境（例如液晶、热性质、合成路线等）。","构词上可拆为 azoxy（含氮氧结构的官能团）+ benzoic（与苯甲酸/苯甲酸基相关）。看到它时，通常需要结合具体名词（如 acid, derivative, compound）来判断指的是哪一种具体结构。"]}
{"word":"azoxynaphthalene","summary":{"en":"Azoxynaphthalene is a specialized chemical name for an azo compound derived from naphthalene, mainly seen in chemistry contexts.","zh":"Azoxynaphthalene 是一个化学专用名词，指由萘衍生的偶氮类化合物，主要出现在化学语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (an azo compound) derived from naphthalene, containing an azo linkage (–N=N–) and an oxygen-containing group; used mainly in chemical research and sometimes related to dye chemistry.","zh":"一种由萘（naphthalene）衍生的偶氮类有机化合物，含有偶氮键（–N=N–）并带有含氧基团；主要用于化学研究，有时与染料化学相关。"},"examples":[{"en":"Azoxynaphthalene is studied as an example of an azo compound based on a naphthalene structure.","zh":"Azoxynaphthalene 常被用来作为“以萘为骨架的偶氮化合物”的研究例子。"},{"en":"The lab handled azoxynaphthalene with care and stored it in a labeled container.","zh":"实验室小心处理 azoxynaphthalene，并将其存放在贴有标签的容器中。"}]}],"synonyms":["azo compound","naphthalene derivative"],"phonetic":"əˌzɑksiˈnæfθəliːn","extraExplanation":["这是一个相对“专业/学术”的化学名词，日常英语中很少出现。常见的学习重点是：它的构词方式与化学命名习惯。","词形可拆解理解：azo- 表示“偶氮（含 –N=N–）”；-oxy- 常与“含氧/氧化相关”概念有关；naphthalene 指“萘”（两环芳香烃）。","阅读化学英文时，类似名词通常不翻译成普通词，而是直接用化学名或其对应的中文化学译名；更重要的是在上下文中识别它属于“化合物名称”。"]}
{"word":"azoxyphenetole","summary":{"en":"Azoxyphenetole is a specialized chemistry term for an azoxy aromatic ether used mainly in research (especially liquid crystal studies).","zh":"Azoxyphenetole 是一个化学专业词，指一种偶氮氧类芳香醚，主要用于科研（尤其液晶研究）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A chemical compound (an azoxy aromatic ether) used mainly in organic chemistry research and in studies of liquid crystals; not a common everyday word.","zh":"一种化学化合物（偶氮氧类芳香醚），主要用于有机化学研究及液晶相关研究；日常英语中很少使用。"},"examples":[{"en":"Azoxyphenetole is sometimes mentioned in papers about nematic liquid crystals.","zh":"在一些关于向列型液晶的论文中会提到 azoxyphenetole。"},{"en":"The lab synthesized azoxyphenetole to compare its phase transitions with related compounds.","zh":"实验室合成了 azoxyphenetole，用来与相关化合物比较其相变行为。"}]}],"synonyms":["(technical) azoxy aromatic ether","(related term) phenetole (structure-related)"],"phonetic":"/əˌzɑːk.siˈfɛn.əˌtoʊl/","extraExplanation":["这是一个偏专业的化学名词，常见于学术论文、材料科学与有机合成语境。一般不会出现在日常对话或通用考试词汇中。","词形可拆看：azoxy-（偶氮氧基相关）+ phenetole（与“乙氧基苯/苯乙醚”相关的结构）。实际具体结构需以化学式或文献定义为准。"]}
{"word":"azoxytoluidine","summary":{"en":"Azoxytoluidine is a specialized chemical name for an azoxy-derived toluidine compound, mainly seen in dye chemistry and research contexts.","zh":"Azoxytoluidine 是一种专业化学名词，指甲苯胺的偶氮氧衍生物，主要出现在染料化学与研究语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (an aromatic amine with an azoxy group) derived from toluidine; used mainly as an intermediate in making dyes and in chemical research.","zh":"一种化学化合物（含“偶氮氧/azoxy”基团的芳香胺），由甲苯胺（toluidine）衍生而来；主要用于染料合成的中间体及化学研究。"},"examples":[{"en":"Azoxytoluidine is sometimes mentioned in older literature on azo and azoxy dye chemistry.","zh":"在较早的偶氮与偶氮氧染料化学文献中，有时会提到 azoxytoluidine。"},{"en":"In industry, compounds like azoxytoluidine may be handled as dye intermediates under strict safety controls.","zh":"在工业中，像 azoxytoluidine 这类化合物可能作为染料中间体使用，并需要严格的安全管控。"}]}],"synonyms":["azoxy toluidine","azoxy-toluidine","(possible specific forms) 4,4′-azoxytoluidine"],"phonetic":"/əˌzɑːk.siˌtoʊˈluː.ə.diːn/","extraExplanation":["这是一个相对专业、在日常英语中几乎不会出现的化学名词。不同资料中可能会指向不同“位置异构体”（例如在苯环上取代位置不同），因此在阅读论文或安全数据表（SDS/MSDS）时，最好同时核对其具体结构式或CAS号。","此类芳香胺/染料中间体常与健康与环境风险评估相关；若在实验或工作场景遇到，请以所在机构的安全规范与SDS为准（如通风、防护手套、避免吸入与皮肤接触等）。"]}
{"word":"Azpurua","summary":{"en":"Azpurua is most commonly used as a Basque-origin surname, and it can also appear as a place name tied to the Basque region of Spain.","zh":"Azpurua 最常见作巴斯克起源的姓氏，也可能作为与西班牙巴斯克地区相关的地名出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name), most commonly found in Spanish-speaking contexts, originally of Basque origin.","zh":"一个姓氏（家族姓），常见于西班牙语语境中，起源多与巴斯克地区有关。"},"examples":[{"en":"Her last name is Azpurua, and her family is from northern Spain.","zh":"她的姓是 Azpurua，她的家族来自西班牙北部。"},{"en":"I saw the name Azpurua on the author list of the research paper.","zh":"我在那篇论文的作者名单里看到了 Azpurua 这个名字。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name (toponym) connected to the Basque region; it may refer to small local areas or historical place names in Spain.","zh":"一个地名（地名用语），与巴斯克地区有关；可能指西班牙境内较小的地方或历史地名。"},"examples":[{"en":"The map lists Azpurua as a local place name in the region.","zh":"地图上把 Azpurua 标为该地区的一个地名。"}]}],"synonyms":["(no direct synonyms; it is a proper name)"],"phonetic":"/ˌɑspuˈruːə/","extraExplanation":["“Azpurua”常被视为巴斯克语来源的姓氏/地名。巴斯克地区（横跨西班牙北部与法国西南部）有不少姓氏来自地形、村落或家族所在地，因此同一个词既可能是姓氏，也可能出现在地名中。","这是专有名词，英文里通常首字母大写；发音在不同语言环境（西语/巴斯克语/英语）中会有差异，英语里多按拼写近似读。"]}
{"word":"Azrael","summary":{"en":"Azrael is a proper noun most commonly used for the angel associated with death in some traditions, and it’s also used as a personal or fictional character name.","zh":"Azrael 常作专有名词，最常指一些传统中与“死亡”相关的天使，也常被用作人名或虚构角色名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In some Jewish, Islamic, and later popular traditions) the angel associated with death—often described as the being who takes souls at the moment of death.","zh":"（在部分犹太教、伊斯兰教及后来的大众文化传统中）与“死亡”相关的天使，常被描述为在死亡时带走灵魂的存在。"},"examples":[{"en":"In the novel, Azrael appears as a quiet figure who guides the dead rather than punishing them.","zh":"在小说中，Azrael 以安静的形象出现，负责引导亡者，而不是惩罚他们。"},{"en":"Some people use “Azrael” as another name for the “angel of death.”","zh":"有些人会用 “Azrael” 来指代“死亡天使”。"}]},{"partOfSpeech":"n.","definition":{"en":"A personal name or fictional character name (often chosen for its dark, mysterious, or mythic association).","zh":"人名或虚构角色名（常因其“神秘、黑暗或神话感”的联想而被采用）。"},"examples":[{"en":"The comic book introduces a hero named Azrael with a troubled past.","zh":"这部漫画介绍了一位名叫 Azrael 的英雄，他有着坎坷的过去。"},{"en":"They named their cat Azrael after a character from a cartoon.","zh":"他们把猫取名 Azrael，是因为一部动画里的角色。"}]}],"synonyms":["angel of death"],"phonetic":"ˈæzreɪəl","extraExplanation":["“Azrael”常见拼写也有“Azrail”等，来源与宗教与民间传说的传播有关；不同文化与作品对他的形象差异很大：有的强调“引导灵魂”、有的强调“令人畏惧”。","在正式宗教语境中，具体说法可能因教派与文本而不同；在日常英语里，它更多作为神话/文学/影视中的专名或象征使用。"]}
{"word":"azrael","summary":{"en":"Azrael: a traditional name for the Angel of Death; also used in modern culture as a death-related symbol or character name.","zh":"Azrael：传统上指“死亡天使”；现代文化中也常被借用为与死亡相关的象征或角色名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Azrael is a name for the Angel of Death in some Jewish, Islamic, and later folklore traditions—often described as an angel who takes souls at the time of death.","zh":"Azrael（阿兹拉尔/亚兹拉伊勒）在部分犹太教、伊斯兰教及后世民间传说中被称为“死亡天使”，常被描述为在死亡之时带走灵魂的天使。"},"examples":[{"en":"In some stories, Azrael appears as the angel who comes when a person’s life ends.","zh":"在一些故事里，Azrael 会在一个人生命结束时出现。"},{"en":"The novel uses Azrael as a symbol of death and the fear of the unknown.","zh":"这部小说用 Azrael 作为死亡与未知恐惧的象征。"}]},{"partOfSpeech":"n.","definition":{"en":"By extension, “Azrael” can refer to any death-bringing figure in literature, art, games, or pop culture (often as a character name).","zh":"引申用法中，“Azrael”也可指文学、艺术、游戏或流行文化里任何与死亡相关或带来死亡的形象（常作为角色名）。"},"examples":[{"en":"The game’s villain is named Azrael to give him a darker, death-related image.","zh":"游戏里的反派被命名为 Azrael，以营造更黑暗、与死亡相关的形象。"},{"en":"The band titled the song “Azrael” to suggest loss and mourning.","zh":"乐队把歌曲命名为《Azrael》，用来暗示失去与哀悼。"}]}],"synonyms":["Angel of Death","death angel","grim reaper (similar idea)"],"phonetic":"/ˈæzreɪəl/","extraExplanation":["该名字常被解释为源自闪米特语系传统（如希伯来语/阿拉伯语的相关表达），在不同宗教与传说体系中的形象细节并不完全一致；有的文本会强调他“奉命收取灵魂”，也有作品把他艺术化为“死亡的象征”。","文学与流行文化里借用“Azrael”时，往往不严格对应宗教教义，而更侧重营造氛围（阴影、终结、审判、宿命等）。读到时可以先判断语境：是在谈宗教传说，还是在用作象征或角色名。"]}
{"word":"Azral","summary":{"en":"Azral is a rare spelling of Azrael, a name associated with the angel of death in several religious traditions and often used in fiction.","zh":"Azral 是 Azrael 的较少见拼写，常与多种宗教传统中的“死亡天使”意象相关，也常用于小说、游戏等虚构作品中的命名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a less common spelling of “Azrael,” the angel of death in some Jewish, Christian, and especially Islamic traditions; also used as a personal name inspired by that figure","zh":"“Azrael（阿兹拉伊勒）”的较少见拼写形式；在部分犹太教、基督教（较少）以及尤其是伊斯兰传统中指“死亡天使”；也常被借用作人名"},"examples":[{"en":"In some stories, Azral (Azrael) is described as the angel who takes souls at the time of death.","zh":"在一些传说中，Azral（Azrael）被描述为在死亡时带走灵魂的天使。"},{"en":"The fantasy novel names its mysterious character Azral to suggest an association with death.","zh":"这部奇幻小说把一位神秘角色命名为 Azral，以暗示他与死亡有关。"}]}],"synonyms":["Azrael","Azrail"],"phonetic":"/ˈæzreɪəl/","extraExplanation":["“Azral”更常见的拼写是“Azrael”。在伊斯兰文化语境中常见的称呼还有“ʿAzrāʾīl（عزرائيل）”，中文有时译作“阿兹拉伊勒”。不同作品会因转写系统不同而出现 Azral / Azrael / Azrail 等变体。","作为文学或游戏角色名时，这个名字常用来营造“死亡、终结、审判、灵魂”等意象；使用时要注意宗教语境的敏感性与尊重。"]}
{"word":"Azriel","summary":{"en":"Azriel is mainly a Hebrew-origin male name; it can also refer to an angelic figure in some traditions or in fiction.","zh":"Azriel 主要是一个源自希伯来语的男性名字；在某些传统或虚构作品中也可指天使形象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A masculine given name of Hebrew origin, used in Jewish and English-speaking cultures.","zh":"一个源自希伯来语的男性名字，在犹太文化与英语国家中都有使用。"},"examples":[{"en":"Azriel is a popular name in some Jewish communities.","zh":"Azriel 在一些犹太社群中是常见名字。"},{"en":"They named their son Azriel to honor a family tradition.","zh":"他们给儿子取名 Azriel，以纪念家族传统。"}]},{"partOfSpeech":"n.","definition":{"en":"In some religious or mythic traditions, the name of an angelic figure (usage varies by source).","zh":"在某些宗教或神话传统中，一个天使形象的名字（不同来源的说法不一）。"},"examples":[{"en":"In some stories, Azriel is described as an angelic being.","zh":"在一些故事里，Azriel 被描写为天使般的存在。"},{"en":"The novel uses Azriel as a symbolic name for a guardian figure.","zh":"这部小说把 Azriel 作为象征性的名字，用在一个守护者角色身上。"}]}],"synonyms":["Asriel","Azrael"],"phonetic":"/ˈæzriəl/","extraExplanation":["Azriel 通常被认为来自希伯来语（常见解释为“上帝是我的帮助/神帮助我”一类的含义）。","它也出现在《圣经》人名中（不同译本拼写可能不同），并在部分犹太/基督宗教相关传说与现代流行文化作品中被用作天使或守护者式角色的名字；具体设定会随作品与传统而变。"]}
{"word":"Aztec","summary":{"en":"“Aztec” refers to the people and culture of a powerful pre-Spanish empire in central Mexico, and also describes things related to them.","zh":"“Aztec”指墨西哥中部西班牙征服前强大帝国的阿兹特克民族及其文化，也可作形容词表示“与阿兹特克相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Aztec people (the Nahua-speaking peoples who built a major empire in central Mexico before the Spanish conquest)","zh":"阿兹特克人（西班牙征服前在墨西哥中部建立强大帝国的纳瓦语族民族）"},"examples":[{"en":"The Aztecs built Tenochtitlan on an island in a lake.","zh":"阿兹特克人在湖中的岛上建造了特诺奇蒂特兰。"},{"en":"Many Aztec myths and symbols are still studied today.","zh":"许多阿兹特克神话与象征至今仍被研究。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Aztec people, their empire, or their language and culture","zh":"阿兹特克的；与阿兹特克民族、帝国、语言或文化有关的"},"examples":[{"en":"We saw Aztec stone carvings in the museum.","zh":"我们在博物馆看到了阿兹特克石雕。"},{"en":"The course covers Aztec history and religion.","zh":"这门课涵盖阿兹特克历史与宗教。"}]}],"synonyms":["Mexica (often used in historical context)","Nahua (broader linguistic-cultural term)"],"phonetic":"/ˈæz.tɛk/","extraExplanation":["“Aztec”常被用来泛指“墨西哥（Mexica）人”及其帝国，但在学术语境中也可能更严格地区分：Mexica 是帝国核心族群；“Aztec”有时是更宽泛的称呼。日常英语里两者常混用。"]}
{"word":"aztec","summary":{"en":"Aztec refers to the Aztec people and their culture/empire in central Mexico before the Spanish conquest.","zh":"Aztec 指阿兹特克人，以及他们在西班牙征服前在墨西哥中部建立的文化与帝国。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Aztecs, a powerful Indigenous people and empire in central Mexico before the Spanish conquest (especially in the 14th–16th centuries).","zh":"与阿兹特克人有关的；阿兹特克人是在西班牙征服之前（尤其14–16世纪）活跃于墨西哥中部的强大原住民族与帝国。"},"examples":[{"en":"We learned about Aztec history and the city of Tenochtitlan in class.","zh":"我们在课上学习了阿兹特克历史和特诺奇蒂特兰这座城市。"},{"en":"The museum has Aztec art, including stone carvings and jewelry.","zh":"博物馆里有阿兹特克艺术品，包括石雕和饰品。"}]},{"partOfSpeech":"n.","definition":{"en":"a member of the Aztec people.","zh":"阿兹特克人；阿兹特克族的一员。"},"examples":[{"en":"The Aztecs built impressive temples and large cities.","zh":"阿兹特克人建造了宏伟的神庙和大型城市。"}]}],"synonyms":["Mexica (more specific in some contexts)"],"phonetic":"/ˈæzˌtɛk/","extraExplanation":["英语里通常写作“Aztec”，首字母大写，因为它是民族/文化/语言名称（专有名词）。","“Aztec”常被用作一个方便的总称；更精确的说法有时会用“Mexica（墨西加人）”来指建立特诺奇蒂特兰并统治核心地区的群体。不同语境下用词可能不同。"]}
{"word":"Azteca","summary":{"en":"“Azteca” is the Spanish form meaning “Aztec,” used for the people/culture or as an adjective, and also appears in names like “TV Azteca.”","zh":"“Azteca”是“Aztec（阿兹特克）”的西班牙语形式，可指阿兹特克人/文化或作形容词，也常出现在如“TV Azteca”等名称中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) an Aztec person; a member of the Indigenous people who formed a powerful empire in central Mexico before the Spanish conquest.","zh":"（西班牙语）阿兹特克人；指西班牙征服之前在墨西哥中部建立强大帝国的原住民民族成员。"},"examples":[{"en":"In Spanish, “Azteca” can mean an Aztec person.","zh":"在西班牙语里，“Azteca”可以指“阿兹特克人”。"},{"en":"The museum has many Azteca artifacts from central Mexico.","zh":"这家博物馆收藏了许多来自墨西哥中部的阿兹特克文物。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Spanish) relating to the Aztecs; Aztec.","zh":"（西班牙语）阿兹特克的；与阿兹特克有关的。"},"examples":[{"en":"They studied Azteca history in class.","zh":"他们在课上学习了阿兹特克历史。"},{"en":"She bought a book about Azteca mythology and gods.","zh":"她买了一本关于阿兹特克神话与诸神的书。"}]},{"partOfSpeech":"n.","definition":{"en":"a name used in brands or organizations connected with Mexico or Spanish-language media (for example, “TV Azteca”).","zh":"常用于与墨西哥或西语媒体有关的品牌/机构名称（例如“TV Azteca”）。"},"examples":[{"en":"TV Azteca is a major television network in Mexico.","zh":"TV Azteca 是墨西哥一家重要的电视台。"},{"en":"The documentary aired on an Azteca channel.","zh":"这部纪录片在 Azteca 旗下的频道播出。"}]}],"synonyms":["Aztec"],"phonetic":"/ɑsˈtɛkə/","extraExplanation":["“Azteca”是西班牙语形式；英语里更常见的是“Aztec”。在西班牙语中，形容词会随名词性别变化：阳性常写作“azteco”，阴性为“azteca”。","历史上“阿兹特克（Aztec）”常用来指墨西哥（Mexica）及其同盟建立的帝国与文化；日常语境里两者有时会被混用，但在学术写作中可能会更精确地区分。"]}
{"word":"azteca","summary":{"en":"Azteca means “Aztec”: an Aztec person, or something related to Aztec culture and history.","zh":"azteca 意为“阿兹特克”：可指阿兹特克人，也可指与阿兹特克文化与历史有关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an Aztec person; a member of the Aztec people (often used in Spanish, and sometimes seen in English names or titles).","zh":"阿兹特克人；阿兹特克族成员（常见于西班牙语，也常出现在一些英文名称或标题中）"},"examples":[{"en":"The museum has a room dedicated to Azteca art and symbols.","zh":"这家博物馆有一个展厅专门展示阿兹特克艺术和符号。"},{"en":"She is studying Azteca history in Mexico City.","zh":"她正在墨西哥城学习阿兹特克历史。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to the Aztec people, their culture, language, or empire.","zh":"阿兹特克的；与阿兹特克民族、文化、语言或帝国有关的"},"examples":[{"en":"They visited an Azteca temple site outside the city.","zh":"他们参观了城外的一处阿兹特克神庙遗址。"},{"en":"The design includes Azteca patterns inspired by ancient carvings.","zh":"这个设计采用了受古代雕刻启发的阿兹特克纹样。"}]}],"synonyms":["Aztec"],"phonetic":"/ˈæzˌtɛk/","extraExplanation":["“azteca”是西班牙语，对应英语最常见的词是“Aztec”。在英文里你更常看到“Aztec civilization / Aztec empire（阿兹特克文明/帝国）”。","阿兹特克文明位于今天的墨西哥中部，首都为特诺奇提特兰（Tenochtitlan），与特奥蒂瓦坎、玛雅等文明常被一起提到，但它们并不是同一个时代或同一个文化。","“Azteca”也常作为品牌名、球队名、餐馆名等出现，用来强调“墨西哥/原住民风格/传统图案”等文化联想；在这种情况下，它更像专有名词的一部分。"]}
{"word":"Aztecan","summary":{"en":"Aztecan means “related to the Aztecs,” and can also refer to an Aztec person (less common than Aztec).","zh":"Aztecan 指“与阿兹特克有关的”，也可指阿兹特克人（但不如 Aztec 常用）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Aztecs or their culture, history, or language(s).","zh":"与阿兹特克人（Aztec）或其文化、历史、语言有关的。"},"examples":[{"en":"The museum has a large collection of Aztecan art.","zh":"这家博物馆收藏了大量阿兹特克艺术品。"},{"en":"We studied Aztecan myths in class.","zh":"我们在课上学习了阿兹特克神话。"}]},{"partOfSpeech":"n.","definition":{"en":"An Aztec person; someone connected with Aztec civilization (often used in historical contexts).","zh":"阿兹特克人；与阿兹特克文明有关的人（多用于历史语境）。"},"examples":[{"en":"The chronicler described how the Aztecans built their city on a lake.","zh":"编年史作者描述了阿兹特克人如何在湖上建城。"}]}],"synonyms":["Aztec"],"phonetic":"/æzˈtiːkən/","extraExplanation":["“Aztecan”在日常英语里不如“Aztec”常见：很多情况下直接说“Aztec art / Aztec culture”更自然。“Aztecan”更像一种较正式或学术化的形容词，用来强调“属于阿兹特克体系/传统”。","注意不要和语言学术语“Uto-Aztecan（尤托-阿兹特克语系）”混淆：那是一个很大的语言家族，包含纳瓦特尔语（Nahuatl，阿兹特克常用语言）等。有人会用“Aztecan”在语言学里指该语系的某一分支或相关语言，但具体用法取决于学术语境。"]}
{"word":"aztecan","summary":{"en":"Aztecan means “related to the Aztecs,” and in linguistics it can also refer to the Aztecan branch of the Uto-Aztecan language family.","zh":"Aztecan 表示“与阿兹特克有关”；在语言学中也可指乌托-阿兹特克语系中的阿兹特克分支（及其语言）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Aztecs (the Indigenous people and empire centered in central Mexico before the Spanish conquest) or to their culture, language, or art.","zh":"与阿兹特克人（西班牙征服前以墨西哥中部为中心的原住民及其帝国）及其文化、语言或艺术有关的。"},"examples":[{"en":"The museum has an Aztecan exhibit with stone carvings and ceremonial objects.","zh":"博物馆有一个阿兹特克相关的展区，展出石雕和祭祀用品。"},{"en":"She is studying Aztecan mythology in a Latin American history course.","zh":"她在拉丁美洲历史课上学习阿兹特克神话。"}]},{"partOfSpeech":"n.","definition":{"en":"a member of the Aztec people; an Aztec.","zh":"阿兹特克人；阿兹特克族成员。"},"examples":[{"en":"According to the story, the Aztecan traveled and founded a new city.","zh":"据传说，这位阿兹特克人迁徙并建立了一座新城。"}]},{"partOfSpeech":"adj.","definition":{"en":"(linguistics) relating to the Aztecan branch within the Uto-Aztecan language family, or to languages in that branch.","zh":"（语言学）与乌托-阿兹特克语系中的“阿兹特克分支”有关，或指该分支的语言。"},"examples":[{"en":"Nahuatl is often discussed in the context of Aztecan languages.","zh":"纳瓦特尔语常在“阿兹特克分支语言”的语境中被讨论。"},{"en":"The paper compares sound changes in several Aztecan varieties.","zh":"这篇论文比较了几种阿兹特克分支语言变体的语音变化。"}]}],"synonyms":["Aztec","Nahua (context-dependent)"],"phonetic":"ˈæz.tə.kən","extraExplanation":["“Aztecan”在一般语境里常被当作“Aztec（阿兹特克的）”的形容词使用，但在学术写作中更常见的是“Aztec”描述文化/历史，而“Aztecan”常出现在语言学分类（如 Uto-Aztecan 语系下的分支）中。","注意与“Aztec（阿兹特克）”“Nahua（纳瓦人）”“Nahuatl（纳瓦特尔语）”区分：历史上“Aztec”常指特诺奇蒂特兰等地区的相关族群与帝国；“Nahua”更偏向族群/语言共同体；“Nahuatl”是语言名称。"]}
{"word":"Aztecs","summary":{"en":"The Aztecs were a major civilization and empire in central Mexico before the Spanish conquest.","zh":"阿兹特克人是西班牙征服前墨西哥中部的重要文明与帝国。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A people and civilization in central Mexico that built a powerful empire before the Spanish conquest (14th–16th centuries).","zh":"阿兹特克人；阿兹特克文明：西班牙征服前（约14—16世纪）在墨西哥中部建立强大帝国的民族与文明。"},"examples":[{"en":"The Aztecs built the city of Tenochtitlan on an island in a lake.","zh":"阿兹特克人在湖中的岛上建造了特诺奇蒂特兰城。"},{"en":"Spanish conquest drastically changed the Aztecs’ world.","zh":"西班牙的征服彻底改变了阿兹特克人的世界。"}]}],"synonyms":["Mexica (more specific)"],"phonetic":"/ˈæz.tɛks/","extraExplanation":["“Aztec”常用来泛指以特诺奇蒂特兰为核心的帝国，但更准确的自称是“Mexica（墨西加人）”。在学术或博物馆语境里，有时会区分“Aztec（广义文化圈）”与“Mexica（帝国核心族群）”。","复数形式通常是“Aztecs”，作形容词用时常写作“Aztec”，例如：Aztec culture / Aztec art（阿兹特克文化／艺术）。"]}
{"word":"aztecs","summary":{"en":"“Aztecs” refers to the Aztec people (Mexica) and their civilization in central Mexico before the Spanish conquest.","zh":"“Aztecs”指阿兹特克人（墨西加人）及其在西班牙征服前位于墨西哥中部的文明/帝国。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Indigenous people (also called the Mexica) who built a powerful empire in central Mexico before the Spanish conquest (14th–16th centuries)","zh":"阿兹特克人（也常称“墨西加人”）：西班牙征服前（14—16世纪）在墨西哥中部建立强大帝国的原住民民族"},"examples":[{"en":"The Aztecs built their capital, Tenochtitlan, on an island in Lake Texcoco.","zh":"阿兹特克人在特斯科科湖的岛上建立了他们的首都特诺奇蒂特兰。"},{"en":"In history class, we studied the Aztecs, the Maya, and the Inca.","zh":"在历史课上，我们学习了阿兹特克、玛雅和印加文明。"}]},{"partOfSpeech":"n.","definition":{"en":"the civilization/culture of the Aztecs, known for large cities, farming systems, art, and complex religion","zh":"阿兹特克文明/文化：以大型城市、农业体系、艺术与复杂宗教而闻名"},"examples":[{"en":"Aztecs are often discussed for their architecture and calendars.","zh":"谈到阿兹特克文明时，人们常提到他们的建筑和历法。"},{"en":"Many museum exhibits show Aztecs’ stone carvings and ceremonial objects.","zh":"许多博物馆展览展示了阿兹特克的石雕和仪式用品。"}]}],"synonyms":["Mexica","Aztec people","Aztec civilization"],"phonetic":"/ˈæzˌtɛks/","extraExplanation":["“Aztecs”在英文里常被当作一个总称；在学术语境中也会用“Mexica（墨西加人）”来更准确地指代核心族群，他们是“三方同盟”（Tenochtitlan、Texcoco、Tlacopan）的主导力量。","常见搭配：Aztec Empire（阿兹特克帝国）、Aztec civilization（阿兹特克文明）、Aztec capital Tenochtitlan（阿兹特克首都特诺奇蒂特兰）。拼写上首字母通常大写（Aztecs），因为是专有名词。"]}
{"word":"azthionium","summary":{"en":"“Azthionium” is not a standard English word; it’s most likely a coined name (often for a fictional material or element).","zh":"“azthionium” 不是标准英语词，更可能是人为创造的名称（常见于虚构材料或元素）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare or nonstandard term; not recognized as an established English word in major modern dictionaries. It is most likely a coined name (for example, a fictional substance, element, spell, or product name).","zh":"一个罕见或非标准的词；在主要现代英语词典中不被视为正式英语词。更可能是人为创造的名称（例如虚构的物质、元素、法术或产品名）。"},"examples":[{"en":"In the story, the engine runs on azthionium, a fuel found only on distant moons.","zh":"在故事里，这台引擎使用 azthionium 作为燃料，而这种燃料只在遥远的卫星上才能找到。"},{"en":"The game calls azthionium a “legendary alloy,” but it doesn’t exist outside the game world.","zh":"游戏里把 azthionium 称为“传奇合金”，但在游戏世界之外并不存在。"}]}],"synonyms":["fictional element","made-up substance","invented material"],"phonetic":"/æzˈθaɪoʊniəm/","extraExplanation":["从拼写看，-ium 结尾常用于化学元素或金属名称（如 sodium, titanium），因此 azthionium 很容易让人联想到“某种元素/材料”。不过它并不是常见或被广泛收录的英语词。","如果你是在小说、游戏、论文或某个品牌/用户名中看到它，含义通常由该作品或语境自行定义。你可以把出现它的句子或来源贴出来，我可以根据上下文帮你确定它在那里的具体意思和更自然的译法。"]}
{"word":"Azuela","summary":{"en":"Azuela most commonly refers to the Mexican novelist Mariano Azuela, known for The Underdogs; it can also be a Spanish surname.","zh":"Azuela 通常指墨西哥小说家马里亚诺·阿苏埃拉（《败军之将》作者）；也可作为西班牙语姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Mexican novelist (Mariano Azuela, 1873–1952), best known for writing about the Mexican Revolution, especially in his novel The Underdogs.","zh":"墨西哥小说家马里亚诺·阿苏埃拉（Mariano Azuela，1873–1952），以描写墨西哥革命最著名，代表作为《败军之将》（The Underdogs）。"},"examples":[{"en":"Mariano Azuela is often taught as an early voice of Mexican Revolution literature.","zh":"马里亚诺·阿苏埃拉常被视为墨西哥革命文学的早期代表作家。"},{"en":"In The Underdogs, Azuela portrays how war can change ordinary people.","zh":"在《败军之将》中，阿苏埃拉描写了战争如何改变普通人。"}]},{"partOfSpeech":"n.","definition":{"en":"a Spanish-language surname.","zh":"西班牙语姓氏“阿苏埃拉”。"},"examples":[{"en":"Azuela is a common surname in parts of Mexico.","zh":"Azuela 在墨西哥部分地区是较常见的姓氏。"},{"en":"My professor’s last name is Azuela.","zh":"我教授的姓是 Azuela（阿苏埃拉）。"}]}],"synonyms":["Mariano Azuela (proper name)","Los de abajo (original title of The Underdogs)"],"phonetic":"/ɑːˈzwɛlə/","extraExplanation":["阿苏埃拉最常与《败军之将》（The Underdogs，西语原名 Los de abajo）联系在一起。这部小说以较写实、直接的方式呈现革命中的混乱、理想与失落，因此经常被当作理解“革命并不总是浪漫化叙事”的重要文学作品。"]}
{"word":"Azuero","summary":{"en":"Azuero most commonly refers to Panama’s Azuero Peninsula; it can also be a Spanish-language surname.","zh":"Azuero最常指巴拿马的阿苏埃罗半岛；也可作西班牙语姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A peninsula in southern Panama, known for its traditional culture, folklore, and beaches; it includes the provinces of Herrera and Los Santos.","zh":"巴拿马南部的阿苏埃罗半岛，以传统文化、民俗与海滩闻名；主要包含埃雷拉省和洛斯桑托斯省。"},"examples":[{"en":"They traveled to the Azuero Peninsula to see traditional festivals and visit small towns.","zh":"他们去阿苏埃罗半岛旅行，观看传统节庆并探访小镇。"},{"en":"Azuero is famous in Panama for its folk music, dances, and handmade crafts.","zh":"在巴拿马，阿苏埃罗以民间音乐、舞蹈和手工艺闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"A Spanish-language surname, especially found in Panama and parts of Latin America.","zh":"西班牙语姓氏，在巴拿马及拉丁美洲部分地区较常见。"},"examples":[{"en":"Her last name is Azuero.","zh":"她的姓是Azuero。"}]}],"synonyms":["Azuero Peninsula"],"phonetic":"/ɑˈzwɛroʊ/","extraExplanation":["“Azuero”在英语里通常指地名（Azuero Peninsula）。写作时常用定冠词或搭配：the Azuero Peninsula；也可直接说 Azuero（语境清楚时）。","文化上，阿苏埃罗地区常被视为巴拿马传统民俗文化的重要中心之一（如传统服饰、舞蹈与节庆）。"]}
{"word":"azulejo","summary":{"en":"An azulejo is a decorative painted ceramic tile, especially associated with Spain and Portugal.","zh":"Azulejo 指一种装饰性的彩绘釉面陶瓷砖，尤与西班牙和葡萄牙相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a painted and usually glazed ceramic tile (common in Spain and Portugal), often used to decorate walls, floors, and public buildings","zh":"（西班牙、葡萄牙常见的）彩绘釉面陶瓷砖，常用于装饰墙面、地面和公共建筑"},"examples":[{"en":"The old courtyard was covered with blue-and-white azulejos.","zh":"那座老院子里铺满了蓝白相间的彩绘釉面瓷砖。"},{"en":"In Lisbon, you can see azulejo panels telling stories on building facades.","zh":"在里斯本，你能看到建筑外墙上的瓷砖壁画，用图像讲故事。"},{"en":"The museum restored the azulejos to protect them from moisture.","zh":"博物馆修复了这些瓷砖，以防受潮损坏。"}]}],"synonyms":["decorative tile","ceramic tile","glazed tile","tile panel"],"phonetic":"/ˌæzəˈleɪhoʊ/","extraExplanation":["“Azulejo”来自西班牙语/葡萄牙语，常指带图案的装饰瓷砖；在葡萄牙尤其常见，整面墙会用瓷砖拼成大型画面（面板/壁画）。","颜色上常见蓝白（受历史上钴蓝颜料与审美影响），但也有多色与现代设计。","相关文化场景：教堂、车站、庭院、喷泉、街道门牌与外墙装饰等；因此在旅行写作或建筑艺术语境中很常见。"]}
{"word":"azulejos","summary":{"en":"Azulejos are decorative glazed ceramic tiles, especially traditional Portuguese/Spanish ones (often blue-and-white).","zh":"Azulejos 指装饰性的釉面彩绘瓷砖，尤指葡萄牙/西班牙传统瓷砖（常见蓝白风格）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Painted or patterned glazed ceramic tiles, especially the traditional blue-and-white decorative tiles used in Portugal and Spain to cover walls, stairways, fountains, and building facades.","zh":"（复数名词）彩绘或带图案的釉面陶瓷砖，尤指葡萄牙和西班牙传统的（常见蓝白色）装饰瓷砖，用于铺墙面、楼梯、喷泉或建筑外立面。"},"examples":[{"en":"The old train station is famous for its azulejos showing scenes from local history.","zh":"这座老火车站以描绘本地历史场景的葡式彩绘瓷砖而闻名。"},{"en":"We admired the blue-and-white azulejos on the church walls.","zh":"我们欣赏了教堂墙上蓝白相间的彩绘瓷砖。"},{"en":"Her kitchen backsplash uses modern azulejos with geometric patterns.","zh":"她的厨房防溅墙用了带几何图案的现代彩绘瓷砖。"}]}],"synonyms":["glazed tiles","decorative ceramic tiles","Portuguese tiles","ceramic wall tiles"],"phonetic":"/ˌɑzuˈleɪʒoʊz/","extraExplanation":["“azulejos”常用于旅行、建筑与艺术语境，英语里多直接借用这个词（保持复数形式）。单数在原语言中是“azulejo”，英语里也偶尔会用，但更常见的是直接说“azulejos”。","词源可追溯到阿拉伯语“al-zulaij”（抛光小石/瓷片），反映了伊比利亚半岛历史上的文化交流。葡萄牙的阿祖莱茹（azulejos）尤其有名，常用来讲故事或记录宗教、历史与日常生活场景。"]}
{"word":"azulene","summary":{"en":"Azulene is a deep-blue hydrocarbon used in chemistry and sometimes associated with essential oils.","zh":"薁烯是一种深蓝色的烃类化合物，常见于化学领域，也与某些精油成分有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a deep-blue organic compound (a hydrocarbon, C10H8) related to naphthalene, used in chemical research and sometimes found in essential oils.","zh":"（化学）薁烯；一种深蓝色的有机化合物（烃，C10H8），与萘结构相关，用于化学研究，也可在某些精油中发现。"},"examples":[{"en":"Azulene is unusual because it is intensely blue, unlike most hydrocarbons.","zh":"薁烯很特别，因为它呈现强烈的蓝色，而大多数烃并不显色。"},{"en":"Some essential oils contain small amounts of azulene-related compounds.","zh":"一些精油中含有少量与薁烯相关的化合物。"}]}],"synonyms":["azulene (chemical name)"],"phonetic":"ˈæzjəˌlin","extraExplanation":["“azulene”这个词源与西班牙语/葡萄牙语的“azul（蓝色）”有关，名字就来自它显著的蓝色外观。","薁烯虽然化学式与萘相同（同分异构体），但分子结构不同，因而呈现明显的蓝色，并常被用作讲解“结构影响性质”的经典例子。","日常护肤或精油领域里，人们有时会提到带蓝色的“chamazulene（母菊薁烯）”，它与“azulene（薁烯）”相关但不是同一个分子；阅读成分表时要注意区分。"]}
{"word":"azuline","summary":{"en":"Azuline means “azure-blue,” a vivid sky-blue color, often used in literary descriptions.","zh":"Azuline 意为“蔚蓝/天蓝色的”，多用于文学或描写性语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Azure-blue; having a deep sky-blue color (often used in poetic or descriptive writing).","zh":"天蓝色的；蔚蓝的（常用于诗意或描写性的文字中）。"},"examples":[{"en":"The lake looked azuline in the morning light.","zh":"清晨的光里，湖水呈现出蔚蓝的颜色。"},{"en":"She wore an azuline scarf that matched the winter sky.","zh":"她戴着一条天蓝色的围巾，和冬日的天空很相配。"},{"en":"Poets sometimes describe the sea as azuline to emphasize its clear, bright blue.","zh":"诗人有时用“azuline”形容大海，以强调它清澈明亮的蓝色。"}]}],"synonyms":["azure","sky-blue","cerulean","deep blue"],"phonetic":"/ˈæʒəˌlaɪn/","extraExplanation":["“azuline”较少用于日常口语，更常见于文学、艺术评论或颜色描写中；日常表达里通常用“blue / deep blue / sky-blue / azure”。","词源上与“azure（蔚蓝、天蓝）”有关；后缀“-ine”常用于表示“具有……性质/颜色的”。"]}
{"word":"azulite","summary":{"en":"Azulite is a rarely used name (often a variant of azurite) for a deep-blue copper carbonate mineral.","zh":"Azulite 是一个较少见的名称（常作为 azurite 的变体/误拼），指深蓝色的碳酸铜矿物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a blue mineral (a copper carbonate) used as an ore of copper and sometimes as a gemstone; often a less common name or misspelling of azurite","zh":"一种蓝色矿物（碳酸铜矿物），可作为铜矿石，有时也作宝石材料；常被视为“azurite（蓝铜矿）”的不常见别称或误拼"},"examples":[{"en":"The museum displayed a deep-blue azulite specimen from an old copper mine.","zh":"博物馆展出了一块来自旧铜矿的深蓝色 azulite（蓝色矿物）标本。"},{"en":"Some sellers label azurite as “azulite,” so it’s good to check the scientific name.","zh":"有些商家会把 azurite 标成“azulite”，所以最好核对一下学名。"}]}],"synonyms":["azurite","blue copper ore"],"phonetic":"/ˈæʒəˌlaɪt/","extraExplanation":["“Azul-”与西班牙语/葡萄牙语的“azul（蓝色）”有关，因此这个词看起来像“蓝色的矿物”。在英语里更标准、常见的名称通常是“azurite（蓝铜矿）”。如果你在矿物或宝石语境中看到“azulite”，多数情况下指的就是蓝铜矿或与其相近的蓝色含铜矿物。"]}
{"word":"azulmic","summary":{"en":"“azulmic” isn’t a recognized English word; it’s likely a name or invented term.","zh":"“azulmic”不是常见英语词，更可能是名称或自造词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a proper name (e.g., a username, brand, or invented term). Without context, it has no widely accepted dictionary meaning.","zh":"不是标准英语单词；更可能是专有名称（如用户名、品牌名或自造词）。缺少语境时，没有公认的词典释义。"},"examples":[{"en":"I couldn’t find “azulmic” in an English dictionary—do you mean a brand or a username?","zh":"我在英文词典里找不到“azulmic”——你是指品牌名还是用户名吗？"},{"en":"In this game, Azulmic is the name of a character.","zh":"在这个游戏里，Azulmic 是一个角色的名字。"}]}],"phonetic":"əˈzuːlmɪk","extraExplanation":["“azul”在西班牙语里常见意思是“蓝色”。“azulmic”看起来像是把“azul”和“mic（麦克风/缩写）”或其他片段拼在一起的造词，但这只是基于词形的猜测。","如果你告诉我它出现在哪（例如一段文本、产品、歌曲、游戏、账号名），我可以更准确判断它的意思、来源，以及更自然的英文用法。"]}
{"word":"azumbre","summary":{"en":"Azumbre is an old Spanish/Latin American unit of liquid volume, roughly quart-like but variable by region.","zh":"Azumbre 是西班牙/拉美旧制的液体容量单位，类似“夸脱”，但因地区而异。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Spanish and Latin American unit for measuring liquid volume (an old “quart”-like measure), varying by region and time.","zh":"（西班牙及拉美旧制）液体容量单位，类似“一夸脱”的传统量度，但不同地区与年代的数值不一。"},"examples":[{"en":"The recipe mentions an azumbre of wine, a measurement used in older Spanish texts.","zh":"这份食谱写到“一 azumbre 的葡萄酒”，这是旧西班牙文本里常见的量度。"},{"en":"In historical records, an azumbre could represent roughly a couple of liters, depending on the place.","zh":"在历史记录中，azumbre 的容量因地区而异，大致可能接近两升左右。"}]}],"synonyms":["old Spanish liquid measure","Spanish quart (approx.)","traditional volume unit"],"phonetic":"ɑˈzum.breɪ","extraExplanation":["“azumbre”常见于历史、贸易、民俗或旧食谱语境，不是现代日常计量单位。","它的具体容量因地区差异很大；传统上常被描述为某个更大单位（如 arroba）的分数（例如 1/8），所以换算时需要看当时当地的标准。","词源一般认为与阿拉伯语来源有关（伊比利亚半岛历史上受阿拉伯语影响较深），因此属于带有历史文化背景的借词。"]}
{"word":"azure","summary":{"en":"Azure means bright sky-blue, often used poetically for the color of a clear sky or sea.","zh":"Azure 指明亮的天蓝色（蔚蓝色），常带有文学和诗意色彩，用来形容晴空或大海的蓝。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Bright blue, like a clear sky on a sunny day.","zh":"天蓝色的；蔚蓝的（像晴天的天空一样的明亮蓝色）。"},"examples":[{"en":"She wore an azure dress that matched the summer sky.","zh":"她穿了一件天蓝色的连衣裙，和夏日的天空很相配。"},{"en":"The lake looked azure in the morning light.","zh":"在清晨的光线下，湖水看起来蔚蓝。"}]},{"partOfSpeech":"n.","definition":{"en":"A bright sky-blue color.","zh":"天蓝色；蔚蓝色。"},"examples":[{"en":"Azure is often used in paintings to show a calm sky.","zh":"在绘画里，“azure”常用来表现宁静的天空。"},{"en":"He chose azure for the logo to feel fresh and open.","zh":"他为标志选择了天蓝色，让人感觉清新开阔。"}]}],"synonyms":["sky-blue","cerulean","sapphire","blue"],"phonetic":"/ˈæʒər/","extraExplanation":["“azure”这个词在诗歌和文学里很常见，因为它比普通的“blue”更有画面感，常用来描写“湛蓝的天空/海面”，带有一种明亮、清澈、浪漫的气氛。常见搭配有：azure sky（蔚蓝天空）、azure sea（碧海）。","词源来自阿拉伯语中表示“青金石（lapis lazuli）”的词，经由法语进入英语；青金石是一种深蓝色矿石，因此这个词和“蓝色的珍贵颜料/宝石色”有历史关联。"]}
{"word":"azurean","summary":{"en":"Azurean means “sky-blue” and is mainly a literary adjective.","zh":"azurean 意为“天蓝色的/蔚蓝的”，主要是文学性用法的形容词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Sky-blue; relating to the color of a clear blue sky (often used in poetic or literary writing).","zh":"天蓝色的；蔚蓝的；与晴朗天空的蓝色有关（常用于诗歌或文学描写）。"},"examples":[{"en":"The lake looked azurean under the midday sun.","zh":"正午阳光下，湖面呈现出蔚蓝的色彩。"},{"en":"She described an azurean horizon fading into gold at dusk.","zh":"她描写黄昏时分蔚蓝的地平线渐渐融入金色。"}]}],"synonyms":["azure","sky-blue","cerulean","blue"],"phonetic":"/əˈʒʊriən/","extraExplanation":["“azurean”比较少见，更多出现在文学/诗歌里，用来营造画面感。日常英语里更常用“azure”或“sky-blue”。","它来自“azure（蔚蓝、天蓝色）”，词尾“-an”常用于构成形容词，表示“与……有关/具有……特征”。"]}
{"word":"azured","summary":{"en":"Azured means sky-blue or tinted blue, and it’s often used in literary or poetic descriptions.","zh":"azured 指“蔚蓝的/天蓝色的”或“被染成蓝色的”，多用于文学或诗意描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Sky-blue; having the color of a clear blue sky (literary).","zh":"天蓝色的；蔚蓝的（偏文学用法）。"},"examples":[{"en":"We watched clouds drift across the azured sky.","zh":"我们看着云朵飘过蔚蓝的天空。"},{"en":"The lake looked azured in the morning light.","zh":"清晨的光线里，湖水显得一片蔚蓝。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made blue; tinted or colored blue (often used poetically as a past participle).","zh":"被染成蓝色的；呈蓝色调的（常作过去分词的诗意用法）。"},"examples":[{"en":"Her dress was azured with dye to match the sea.","zh":"她的裙子用染料染成蓝色，以配合海的颜色。"},{"en":"The distant hills were azured by haze.","zh":"远处的山丘被薄雾染上一层蓝。"}]}],"synonyms":["azure","sky-blue","cerulean","blue","sapphire"],"phonetic":"/ˈæʒərd/","extraExplanation":["“azured”来自颜色词“azure”（天蓝色、蔚蓝），在现代英语里更常见的是“azure”作形容词（an azure sky）。而“azured”多见于诗歌或描写性文字，用来强调“被染成蓝/呈现蓝色的”这种画面感。"]}
{"word":"azureness","summary":{"en":"Azureness means the quality of being bright azure blue—especially the sky-like blueness seen in nature or art.","zh":"Azureness 指“蔚蓝（天蓝）”的特质，常用于自然景色或艺术描写中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of being azure (bright, sky-like blue); blueness.","zh":"蔚蓝色；天蓝色的特质（蓝得像天空一样）。"},"examples":[{"en":"She admired the azureness of the sky after the storm.","zh":"暴风雨过后，她欣赏天空的蔚蓝。"},{"en":"The lake’s azureness made the mountains look even darker.","zh":"湖水的蔚蓝让群山显得更深沉。"},{"en":"In the painting, the azureness behind the clouds suggests calm and distance.","zh":"在这幅画里，云后的蔚蓝暗示着宁静与遥远。"}]}],"synonyms":["blueness","azure hue","sky-blue color","cerulean tone"],"phonetic":"/ˈæʒɚnəs/","extraExplanation":["“azureness”是由形容词“azure（蔚蓝的）+ -ness（表示性质/状态的名词后缀）”构成，意思很直观：某物“有多蓝、蓝得有多像天空”。","这个词在日常英语中不算常见，更偏文学/描写性用法；普通表达更常用“blueness”或直接用“the blue of the sky/lake”。","在写作中用“azureness”会带一点诗意和画面感，常用于自然景色、绘画或抒情描写。"]}
{"word":"azureous","summary":{"en":"“Azureous” means sky-blue or azure-colored, often used in literary description.","zh":"“azureous”意为天蓝色/蔚蓝色，多用于文学性的描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the color of a clear blue sky; azure-colored.","zh":"天蓝色的；蔚蓝的（像晴朗天空的蓝色）。"},"examples":[{"en":"She wore an azureous scarf that matched the summer sky.","zh":"她戴着一条天蓝色的围巾，和夏日的天空很相配。"},{"en":"Azureous light spilled across the ocean at dawn.","zh":"黎明时分，蔚蓝的光洒在海面上。"},{"en":"The poem describes an azureous horizon fading into mist.","zh":"这首诗描写了天蓝色的地平线渐渐隐入薄雾。"}]}],"synonyms":["azure","sky-blue","cerulean","sapphire-blue"],"phonetic":"/ˈæʒərəs/","extraExplanation":["“azureous”较少见，更多出现在诗歌或描写性文学中，用来营造画面感；日常英语里更常用“azure”或“sky-blue”。","词源上与“azure”（蔚蓝）同源，常用来形容天空、海洋、宝石或带有清澈蓝色调的光。"]}
{"word":"azures","summary":{"en":"“Azures” usually means multiple shades/areas of bright sky-blue, often in poetic description; rarely, it can be a verb meaning “to make blue.”","zh":"“azures”通常指多种/多处明亮的天蓝色（常见于诗意描写）；较少见时也可作动词，表示“使变蓝/染蓝”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of “azure”: bright sky-blue colors, or blue skies/sea seen poetically","zh":"“azure”的复数：明亮的天蓝色（或诗意地指蓝天/蓝海）"},"examples":[{"en":"The painter mixed several azures to capture the changing sky.","zh":"画家调了几种天蓝色来表现天空的变化。"},{"en":"In the poem, “summer azures” suggests endless blue skies.","zh":"在诗中，“summer azures”暗示无尽的蓝天。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare) makes something become blue; colors something sky-blue","zh":"（罕见）使……变蓝；把……染成天蓝色"},"examples":[{"en":"The evening light azures the distant mountains.","zh":"傍晚的光把远处的山染成了蓝色。"}]}],"synonyms":["sky blues","blues","cerulean shades","heavens (poetic)"],"phonetic":"ˈæʒərz","extraExplanation":["“azure”来自阿拉伯语 al-lāzward（青金石），经由法语进入英语。最常见用法是形容词/名词表示“天蓝色”。“azures”作为名词复数，常出现在诗歌或较文学化的描写里，用来营造开阔、清澈的意象。","作为动词 “to azure” 在现代英语中非常少见，多用于文学/诗意表达；日常更常说 “turn blue / make (something) blue”。"]}
{"word":"azurine","summary":{"en":"Azurine is a rare word meaning “azure, sky-blue,” used as an adjective or as a noun for the color/pigment.","zh":"Azurine 是个较罕见的词，表示“蔚蓝、天蓝”，可作形容词，也可作名词指这种颜色/颜料。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Having the color of azure; bright sky-blue.","zh":"（罕用）天蓝色的；蔚蓝的。"},"examples":[{"en":"The painter chose an azurine background to make the white flowers stand out.","zh":"画家选了蔚蓝的背景，让白花更显眼。"},{"en":"Under the clear noon light, the sea looked almost azurine.","zh":"在正午清澈的阳光下，大海看起来几乎是天蓝色的。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) An azurine color or dye/pigment; something that is azurine.","zh":"（罕用）天蓝色（或天蓝色染料/颜料）；呈天蓝色之物。"},"examples":[{"en":"She added a touch of azurine to cool the overall tone of the painting.","zh":"她加了一点天蓝色来降低画面的暖度。"},{"en":"The fabric was dyed in deep azurine.","zh":"这块布被染成了深天蓝色。"}]}],"synonyms":["azure","sky-blue","cerulean","cobalt","turquoise"],"phonetic":"/ˈæʒəˌriːn/","extraExplanation":["“azurine”在现代英语中很少见，更多出现在诗歌、绘画评论或较文学化的描写里，用来营造“天空/海洋般的蓝”的意象。","它与更常见的“azure（蔚蓝）”同源；词尾“-ine”常用于表示“具有……性质/颜色的”，因此可理解为“带有蔚蓝色调的”。","近义词可用更常见的：azure, sky-blue, cerulean, cobalt (更深更浓), turquoise (偏绿蓝)。"]}
{"word":"azurite","summary":{"en":"Azurite is a deep-blue copper mineral used as an ore, gemstone, or blue pigment.","zh":"Azurite（蓝铜矿）是一种深蓝色的含铜矿物，可用作铜矿石、宝石或蓝色颜料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A blue mineral (a copper carbonate) often found with malachite, used as an ore of copper and also used as a gemstone or pigment.","zh":"一种蓝色矿物（含铜的碳酸盐矿物），常与孔雀石共生；既可作铜矿石，也可作宝石或颜料使用。"},"examples":[{"en":"The museum displayed an azurite specimen with deep, royal-blue crystals.","zh":"博物馆展出了一块方解石样的蓝铜矿标本，上面有深邃的宝蓝色晶体。"},{"en":"In some old paintings, artists used azurite to create vivid blue areas.","zh":"在一些古老的画作中，画家会用蓝铜矿作颜料来画出鲜艳的蓝色区域。"}]}],"synonyms":["blue copper mineral","copper carbonate mineral"],"phonetic":"/ˈæʒəˌraɪt/","extraExplanation":["“azurite”与“azure（蔚蓝色）”同源，常让人联想到非常纯净、浓郁的蓝色。","作为颜料时，蓝铜矿在欧洲中世纪与文艺复兴时期较常见；它的蓝色明亮，但在某些条件下可能会随时间变化（例如与孔雀石的转变有关），因此在艺术史语境中偶尔会被提到。","易混词：azurite（蓝铜矿，矿物/颜料/宝石） vs. azure（蔚蓝的，颜色/形容词）。"]}
{"word":"azurites","summary":{"en":"Azurites are pieces of the deep-blue mineral azurite (plural), used as copper ore and sometimes as pigment or gemstone material.","zh":"Azurites 指“蓝铜矿”的复数：深蓝色含铜矿物，可作铜矿石，也可用作颜料或宝石材料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a deep-blue copper mineral (azurite), sometimes used as an ore of copper and as a blue pigment or gemstone (plural form)","zh":"蓝铜矿（azurite）的复数：一种深蓝色的含铜矿物，可作铜矿石，也可作蓝色颜料或宝石材料"},"examples":[{"en":"The museum displayed several azurites with bright, velvet-blue crystals.","zh":"博物馆展出了几块蓝铜矿，晶体呈明亮的天鹅绒蓝色。"},{"en":"In some paintings, azurites were ground into pigment to make rich blue tones.","zh":"在一些绘画中，人们会把蓝铜矿磨成颜料，用来呈现浓郁的蓝色调。"}]}],"synonyms":["azurite (plural: azurites)","blue copper mineral"],"phonetic":"/ˈæʒəˌraɪts/","extraExplanation":["“Azurite”源自法语/拉丁语中表示“蓝色”的词根，和“azure（天蓝色）”同源。","蓝铜矿常与孔雀石（malachite，绿色）一起出现；两者都是含铜矿物。古代艺术中也可能用蓝铜矿颜料，但它的稳定性和色彩持久性通常不如更昂贵的青金石颜料（ultramarine）。"]}
{"word":"azurmalachite","summary":{"en":"Azurmalachite is a blue-and-green decorative mineral stone made from a mixture of azurite and malachite.","zh":"Azurmalachite（蓝绿铜矿）是由蓝铜矿与孔雀石混合/共生形成的蓝绿相间装饰性矿石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A blue-and-green copper carbonate mineral mixture of azurite and malachite, often used as an ornamental stone.","zh":"一种由蓝铜矿（azurite）与孔雀石（malachite）混合形成的蓝绿相间的铜碳酸盐矿物，常用作装饰性宝石或观赏石。"},"examples":[{"en":"The pendant is carved from azurmalachite, showing swirls of deep blue and vivid green.","zh":"这枚吊坠由蓝绿铜矿雕成，呈现深蓝与鲜绿交织的纹理。"},{"en":"Collectors value azurmalachite for its striking color contrast.","zh":"收藏者很看重蓝绿铜矿强烈的色彩对比。"}]}],"synonyms":["azurite-malachite","azur-malachite","blue-and-green copper carbonate stone"],"phonetic":"/ˌæʒɚˈmæl.əˌkaɪt/","extraExplanation":["“azurmalachite”不是日常高频词，更常见于矿物学、珠宝与手工艺领域；有时也会写作“azur-malachite”。","它本质上不是一个“全新单独矿物”，而是蓝铜矿与孔雀石共生或互相交替生成的材料，因此颜色常呈蓝绿相间、带条带或云纹。","因为含铜矿物较软、也可能对酸性物质敏感，作为饰品或摆件通常建议避免碰酸、避免长时间浸水，并轻柔清洁。"]}
{"word":"azurous","summary":{"en":"Azurous means “azure-blue,” like a clear sky (mainly poetic/literary).","zh":"azurous 指“天蓝色/蔚蓝色”，像晴朗天空的蓝（多见于诗意或文学描写）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the color of a clear blue sky; azure-colored (a poetic or literary word).","zh":"天蓝色的；蔚蓝的（较文学/诗意用法）。"},"examples":[{"en":"The azurous sky stretched above the mountains.","zh":"蔚蓝的天空铺展在群山之上。"},{"en":"She wore an azurous scarf that matched the sea.","zh":"她戴着一条天蓝色的围巾，与大海相映。"}]}],"synonyms":["azure","sky-blue","cerulean","sapphire-blue"],"phonetic":"/əˈʒʊrəs/","extraExplanation":["“azurous”比较少见，日常英语更常用“azure”（adj./n. 天蓝色的；天蓝色）。在诗歌、描写性散文里，用“azurous”会显得更有画面感、更文艺。"]}
{"word":"azury","summary":{"en":"Azury means sky-blue or azure-colored (a less common form of azurey).","zh":"azury 表示“蔚蓝的、天蓝色的”，是较少见的用法（常视为 azurey 的变体）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Blue like a clear sky; having the color of azure (a bright, vivid blue).","zh":"天蓝色的；蔚蓝的（像晴朗天空一样的蓝色）。"},"examples":[{"en":"She wore an azury scarf that matched the summer sky.","zh":"她戴着一条蔚蓝色的围巾，和夏日天空很相配。"},{"en":"Azury water stretched out beyond the rocks.","zh":"岩石外延伸着一片蔚蓝的海水。"}]}],"synonyms":["azure","sky-blue","cerulean","blue"],"phonetic":"/ˈæʒəri/","extraExplanation":["“azury”较少见，常被当作“azurey”的变体，意思基本相同：带有“azure（蔚蓝）”的颜色或感觉。","更常用的写法是“azure”（名词/形容词：蔚蓝；蔚蓝的）或“azure-blue”。在正式写作中，用“azure”通常更自然。"]}
{"word":"Azusa","summary":{"en":"Azusa is mainly a proper name: a city in Southern California, or a shorthand reference to the historic Azusa Street Revival in Los Angeles.","zh":"Azusa 主要是专有名词：可指加州南部的一座城市，也可在宗教史语境中指洛杉矶著名的“阿祖萨街大复兴”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in Los Angeles County, California, in the San Gabriel Valley (often mentioned in local news, commuting, and Southern California geography).","zh":"美国加利福尼亚州洛杉矶县的一座城市，位于圣盖博谷（常见于南加州地理、通勤与本地新闻语境）。"},"examples":[{"en":"She lives in Azusa and commutes to downtown Los Angeles.","zh":"她住在阿祖萨（Azusa），通勤去洛杉矶市中心上班。"},{"en":"The train line makes it easy to travel from Azusa to other parts of L.A. County.","zh":"这条火车线路让人从阿祖萨前往洛杉矶县其他地区更方便。"}]},{"partOfSpeech":"n.","definition":{"en":"(In religious history) Short for “Azusa Street,” referring to the Azusa Street Revival (1906–1909) in Los Angeles, an influential event in early Pentecostal/charismatic Christianity.","zh":"（宗教史）“Azusa Street（阿祖萨街）”的简称，指 1906–1909 年在洛杉矶发生的“阿祖萨街大复兴”，对早期五旬节派/灵恩派基督教影响深远。"},"examples":[{"en":"The book discusses Azusa and the spread of Pentecostal worship worldwide.","zh":"这本书讨论了“阿祖萨（街）”以及五旬节式敬拜如何传播到全球。"},{"en":"Some churches trace their traditions back to Azusa Street.","zh":"一些教会把自己的传统追溯到阿祖萨街。"}]}],"synonyms":["Azusa, California","Azusa Street"],"phonetic":"əˈzuːsə","extraExplanation":["“Azusa”多作为专有名词使用：要么指加州城市，要么在宗教语境中指“Azusa Street（阿祖萨街）”。写作时通常不加冠词（不说 *the Azusa*）。","地名“Azusa”普遍被认为与当地原住民语言或早期西语地名传统有关；在历史与文化文章中偶尔会解释其词源。"]}
{"word":"azygo","summary":{"en":"“azygo” isn’t a standard English word; it most likely refers to “as you go” (during the process) or “pay-as-you-go” (pay only for what you use).","zh":"“azygo”不是标准英文单词；它很可能指“as you go”（在过程中/边做边进行）或“pay-as-you-go”（按量付费/用多少付多少）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Likely intended) “as you go”: while you are doing something; gradually during a process, rather than all at once at the start.","zh":"（可能想写）“as you go”：在做某事的过程中；边做边进行/逐步地，而不是一开始就全部完成。"},"examples":[{"en":"You don’t have to plan every detail—just make decisions as you go.","zh":"你不必把每个细节都计划好——边做边决定就行。"},{"en":"Pay as you go, so you don’t spend too much at once.","zh":"用多少付多少，这样就不会一次花太多钱。"}]},{"partOfSpeech":"adj.","definition":{"en":"“pay-as-you-go”: a system where you pay only for what you use (common for phone plans, utilities, software, and public services).","zh":"“pay-as-you-go（按量付费/用多少付多少）”：一种只为实际使用的部分付费的方式（常见于电话套餐、水电费、软件服务、公共服务等）。"},"examples":[{"en":"I chose a pay-as-you-go phone plan because I don’t call often.","zh":"我选了按量付费的手机套餐，因为我不常打电话。"},{"en":"This cloud service is pay-as-you-go, so costs change month to month.","zh":"这个云服务是按量付费，所以费用每个月会变化。"}]}],"synonyms":["gradually","along the way","step by step","as you proceed"],"phonetic":"æz ju ɡoʊ","extraExplanation":["“as you go”在口语和写作中都很常见，强调“边做边调整/慢慢来”的过程感。","如果你输入的“azygo”是品牌名、用户名、或你想查的是别的词（比如 easygoing / easy-go），告诉我你看到它的完整句子或上下文，我可以更准确解释。"]}
{"word":"Azygobranchia","summary":{"en":"Azygobranchia is an older zoological term for a group of gastropod mollusks once defined by having an unpaired gill.","zh":"Azygobranchia 是动物学中的旧术语，曾用来指一类以“鳃不成对（单鳃）”为特征的腹足类软体动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology, older classification) A former taxonomic group of marine snails (gastropods) characterized by having an unpaired (“single”) gill, as opposed to paired gills.","zh":"（动物学，旧分类）一种已较少使用的分类群，指某些海螺/海洋腹足类（gastropods），其特征是只有一枚（不成对的）鳃，与成对鳃相对。"},"examples":[{"en":"In some older zoology books, certain sea snails were placed in Azygobranchia because they were thought to have a single gill.","zh":"在一些较早的动物学书籍中，某些海螺曾被归入 Azygobranchia，因为它们被认为只有一枚鳃。"},{"en":"Modern taxonomy rarely uses the name Azygobranchia, but you may still see it in historical literature.","zh":"现代分类学很少再使用 Azygobranchia 这个名称，但在历史文献中仍可能看到。"}]}],"synonyms":["(historical/obsolete) unpaired-gilled gastropods"],"phonetic":"/əˌzaɪɡoʊˈbræŋkiə/","extraExplanation":["词源可拆解理解：a- 表“无/不”，zygo- 表“成对/结合（yoked）”，branchia 表“鳃”。因此 Azygobranchia 字面意思就是“无成对鳃（不成双的鳃）”。","这是一个偏“历史用语/旧分类”的名称：早期分类常按外部形态（如鳃的数目与位置）分组；随着解剖学与系统发育研究发展，这类分组方式多被更现代的分类体系取代。"]}
{"word":"azygobranchia","summary":{"en":"Azygobranchia is a scientific name for a (historical) group of sea slugs, noted for having unpaired gills.","zh":"Azygobranchia 是一个（偏历史的）海蛞蝓分类名称，特点常被概括为“鳃不成对”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a taxonomic group (traditionally a suborder) of opisthobranch sea slugs, described as having gills that are not paired (e.g., not arranged as a matching left–right pair).","zh":"无对鳃类：一种海蛞蝓（后鳃类软体动物）的传统分类群（常作亚目），其特征常被描述为鳃不成对（不呈左右对称的一对）。"},"examples":[{"en":"Some older zoology texts place certain sea slugs in Azygobranchia based on gill structure.","zh":"一些较早的动物学教材会根据鳃的结构把某些海蛞蝓归入 Azygobranchia。"},{"en":"The term Azygobranchia appears mostly in historical classifications rather than modern field guides.","zh":"Azygobranchia 这个术语多见于历史性的分类体系，而较少出现在现代的野外图鉴中。"}]}],"synonyms":["(no exact everyday synonym; used as a taxonomic name)"],"phonetic":"/ˌeɪzaɪɡoʊˈbræŋkiə/","extraExplanation":["词源拆解：a- 表示“无/不”；zygo- 来自希腊语，和“成对、连接”有关；-branchia 表示“鳃”。整体意思接近“无对（不成对）的鳃”。","这是偏学术、偏历史的分类名称。不同年代与不同学者的软体动物分类方案可能不一致，所以在现代文献中你可能会看到它被合并、改名或较少使用。"]}
{"word":"Azygobranchiata","summary":{"en":"Azygobranchiata is an older taxonomic term for certain gastropod mollusks described as having a single, unpaired gill.","zh":"Azygobranchiata 是一个较旧的分类学术语，用于指一些被描述为只有一个（不成对）鳃的腹足类软体动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology, taxonomy) A former scientific grouping of gastropod mollusks characterized by having an unpaired (single) gill, contrasted with groups that have paired gills.","zh":"（动物学/分类学）一种旧的腹足类软体动物分类群，特征是只有一个（不成对的）鳃；与具有成对鳃的类群相对。"},"examples":[{"en":"In older malacology texts, some sea snails were placed in Azygobranchiata based on gill structure.","zh":"在较早的软体动物学文献中，一些海螺会因鳃的结构而被归入 Azygobranchiata。"},{"en":"Modern classifications often replace Azygobranchiata with more detailed evolutionary groupings.","zh":"现代分类体系往往用更细致的演化类群来取代 Azygobranchiata。"}]}],"synonyms":["(no common everyday synonym; historical taxonomic label)"],"phonetic":"ˌeɪzaɪɡoʊbræŋkiˈeɪtə","extraExplanation":["词源提示：Azygobranchiata 可拆为 a-（不、无）+ zygo-（成对）+ branchia（鳃），字面意思接近“无成对鳃者”。","使用场景：它多见于历史性的分类系统或旧版教材/论文；在现代系统分类中可能被视为过时或不再常用。","学习建议：阅读相关资料时，可同时检索“单鳃/不成对鳃（unpaired gill）”“腹足类（gastropods）”“软体动物学（malacology）”，以便理解该术语出现的背景。"]}
{"word":"azygobranchiata","summary":{"en":"Azygobranchiata is a dated zoological term for certain gastropods described as having a single gill.","zh":"Azygobranchiata 是动物学中的旧术语，指被描述为只有一个鳃的某些腹足类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology, dated) A former taxonomic group of gastropod mollusks characterized by having a single gill (one ctenidium), rather than a paired set of gills.","zh":"（动物学，旧分类）一种旧时使用的腹足类软体动物分类群，特征是只有一个鳃（一个栉鳃/鳃栉），而不是一对鳃。"},"examples":[{"en":"In older zoology texts, some sea snails were placed in the Azygobranchiata because they were thought to have only one gill.","zh":"在较早的动物学教材里，一些海螺曾被归入 Azygobranchiata，因为它们被认为只有一个鳃。"},{"en":"Modern classifications usually avoid the term Azygobranchiata and use updated evolutionary groupings instead.","zh":"现代分类通常不再使用 Azygobranchiata，而改用更新的系统发育分群。"}]}],"synonyms":["Azygobranchia","monobranchiate (dated)"],"phonetic":"/ˌeɪzɪɡoʊbræŋkiˈeɪtə/","extraExplanation":["词源提示：a- 表示“无/不”，-zygo- 来自希腊语 *zygon*（“成对、轭”），-branchia 表示“鳃”。整体意思就是“非成对的鳃/单鳃”。","这是偏“历史术语”：你更可能在老式分类、博物学著作或旧版生物教材中看到它；现代学术文献一般会用更符合系统发育（演化关系）的分类名称。"]}
{"word":"azygobranchiate","summary":{"en":"Azygobranchiate describes animals (especially some mollusks) whose gills are not arranged in left–right pairs.","zh":"azygobranchiate 指（尤指某些软体动物）鳃不成左右成对分布的“无成对鳃的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Zoology) Having unpaired gills; not having gills arranged in matched left–right pairs.","zh":"（动物学）无成对鳃的；鳃不呈左右对称成对分布的。"},"examples":[{"en":"Some marine snails are described as azygobranchiate because their gills are not paired.","zh":"有些海螺被描述为 azygobranchiate（无成对鳃的），因为它们的鳃不是成对的。"},{"en":"In older zoology texts, certain gastropods were grouped by whether they were azygobranchiate or had paired gills.","zh":"在较早的动物学教材中，一些腹足类会按是否 azygobranchiate（无成对鳃）或具有成对鳃来分组。"}]}],"synonyms":["unpaired-gilled","non-paired-gilled"],"phonetic":"ˌæzaɪɡoʊˈbræŋkiˌeɪt","extraExplanation":["词源拆解：a-（否定，“不”）+ zygo-（“成对、连接”，同 root 见于 zygote 受精卵）+ branch- / -branchia（“鳃”）。合起来就是“没有成对鳃的”。","这是偏“旧式/专业”的分类描述词，多见于动物学或无脊椎动物学的文献里，日常英语中极少使用。"]}
{"word":"azygomatous","summary":{"en":"Anatomy/zoology term meaning “without a zygomatic (cheekbone) arch.”","zh":"解剖/动物学术语，指“无颧弓（颧骨弓）的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"lacking a zygomatic arch (cheekbone arch); not having the cheekbone structure called the zygoma.","zh":"无颧弓的；缺少颧骨（颧弓）结构的。"},"examples":[{"en":"Some small mammals have an azygomatous skull, meaning the cheekbone arch is absent.","zh":"一些小型哺乳动物的头骨是“无颧弓的”，也就是缺少颧弓结构。"},{"en":"The specimen was described as azygomatous in the anatomical notes.","zh":"在解剖记录中，这个标本被描述为“无颧弓的”。"}]}],"synonyms":["azygomatic","lacking a zygomatic arch","without a zygoma"],"phonetic":"/əˌzaɪɡoʊˈmeɪtəs/","extraExplanation":["词源结构：a- 表示“无、缺少”（如 asymmetrical 不对称的），zygomatous 来自 zygoma（颧骨/颧弓）。因此 azygomatous 直译就是“没有颧弓的”。","使用场景：多见于解剖学、古生物学或动物分类学的描述，用来说明某些动物头骨是否具有颧弓（这常与咀嚼肌附着、咬合方式等相关）。","相关词：azygomatic（更常见的写法/同义）、zygomatic（有颧骨/颧弓的）。"]}
{"word":"azygos","summary":{"en":"“Azygos” most commonly refers to the azygos vein in anatomy; more generally, it can mean “unpaired.”","zh":"“azygos”最常指解剖学中的“奇静脉”；更一般地也可表示“非成对的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy) The azygos vein: a large vein running along the right side of the spine that drains blood from the chest wall and upper back into the superior vena cava.","zh":"（解剖）奇静脉：位于脊柱右侧的一条较大静脉，把胸壁和上背部的静脉血回流到上腔静脉。"},"examples":[{"en":"On the CT scan, the doctor noted enlargement of the azygos vein.","zh":"在CT扫描中，医生注意到奇静脉增粗。"},{"en":"Blood from parts of the chest wall can drain through the azygos system.","zh":"胸壁部分区域的血液可以通过奇静脉系统回流。"}]},{"partOfSpeech":"adj.","definition":{"en":"(General/literary) Not paired; single or unpaired.","zh":"（一般/文学用法）不成对的；单一的。"},"examples":[{"en":"In older texts, “azygos” can describe an unpaired structure in the body.","zh":"在较早的文本中，“azygos”可用来形容人体内不成对的结构。"}]}],"synonyms":["azygos vein","unpaired"],"phonetic":"/əˈzaɪɡəs/","extraExplanation":["“azygos”来自希腊语词根：a-（不、无）+ zygos（轭、成对）。因此它常用来表示“非成对的”，在医学里最常见指“奇静脉（azygos vein）”，因为它位于右侧、相对“单独”。","相关常见搭配：azygos vein（奇静脉）、azygos system（奇静脉系统）、hemiazygos vein（半奇静脉，位于左侧的相关血管）。"]}
{"word":"azygoses","summary":{"en":"“Azygoses” is a rare technical plural meaning multiple cases of something being unpaired (especially in biology/botany).","zh":"“azygoses”是罕见的术语复数，指多个“不成对/单生”的情况（尤用于生物学/植物学）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural, technical) Instances or cases of an unpaired condition—especially in biology/botany, where a structure (such as a leaflet) occurs singly rather than in a paired arrangement.","zh":"（复数，术语）“不成对/单生”状态的多个例子或情况——尤用于生物学/植物学中，指某种结构（如小叶）单独出现，而不是成对排列。"},"examples":[{"en":"In some specimens, the researcher noted several azygoses in the leaflets along the rachis.","zh":"在一些标本中，研究者记录到叶轴上小叶出现了多处“单生/不成对”的情况。"},{"en":"The report compares normal paired growth with occasional azygoses in early development.","zh":"该报告比较了正常的成对生长与早期发育中偶尔出现的“单生/不成对”现象。"}]}],"synonyms":["unpaired occurrences","instances of unpaired structure","single (unpaired) cases"],"phonetic":"ˌeɪzaɪˈɡoʊsiz","extraExplanation":["“azygosis”的词源来自希腊语：a-（不、无）+ zygos（轭、成对/配对），字面意思就是“无配对”。因此复数“azygoses”表示“多个不成对的例子/情况”。","这个词非常少见，写作和科研中更常见的是形容词“azygous”（不成对的、单生的）或直接描述为“unpaired / single”。如果你是在解剖学语境下看到它，通常会更常见到“azygos（奇静脉）”等相关词，但那是不同的词形和用法。"]}
{"word":"azygosperm","summary":{"en":"A very rare biology term meaning an “unpaired” sperm/male gamete; often confused with azoospermia (no sperm in semen).","zh":"一个非常罕见的生物学词，指“未成对的”精子/雄性配子；常被误认为 azoospermia（无精子症：精液中无精子）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, biology) A sperm cell or male gamete described as “unpaired” or not joined in a pairing process (used in some specialized zoology/botany writing).","zh":"（罕见；生物学）指被描述为“未成对/不成对”的精子或雄性配子，即没有参与某种“配对/结合”过程的精细胞（多见于特定的动物学/植物学文献）。"},"examples":[{"en":"In some older zoology texts, the term azygosperm is used for an unpaired male gamete.","zh":"在一些较早的动物学教材中，azygosperm 用来指“不成对的”雄性配子。"},{"en":"The paper contrasts paired gametes with an azygosperm stage in the reproductive cycle.","zh":"这篇论文将成对的配子与生殖周期中的 azygosperm 阶段作对比。"}]}],"synonyms":["(related) unpaired gamete","(often intended) azoospermia","(related) azoospermic"],"phonetic":"/ˌeɪzaɪˈɡoʊspɝm/","extraExplanation":["这个词非常罕见，现代英语里几乎不在医学/生殖科语境中使用。很多人想表达的其实是 **azoospermia / azoospermic**（无精子症/无精子），意思是“精液中没有精子”，拼写很容易混淆。","词源构词可理解为 a-（不、无）+ zygo-（成对、结合；同源于 zygote“受精卵/合子”）+ sperm（精子）。因此它更像是“未配对的精子/配子”的描述性用语，而不是常见临床诊断名词。"]}
{"word":"azygospore","summary":{"en":"An azygospore is a thick-walled, resting sexual spore (especially in some fungi/algae) that helps survival in harsh conditions.","zh":"azygospore 指一种厚壁的休眠性有性孢子（常见于部分真菌/藻类），用于在恶劣环境中存活。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thick-walled resting spore formed by the fusion of two similar gametes (sexual cells), especially in certain fungi (e.g., bread molds) and some algae; it can survive harsh conditions and later germinate.","zh":"（尤指某些真菌如面包霉及部分藻类中）由两个相似的配子融合形成的厚壁休眠孢子；能在恶劣环境中存活，之后再萌发。"},"examples":[{"en":"In many zygomycete fungi, the azygospore helps the organism survive drought or cold.","zh":"在许多接合菌类真菌中，azygospore（接合孢子）能帮助生物体度过干旱或寒冷。"},{"en":"Under the microscope, an azygospore often appears as a dark, thick-walled spore.","zh":"在显微镜下，azygospore 常呈现为颜色较深、壁较厚的孢子。"}]}],"synonyms":["zygospore","resting spore"],"phonetic":"/ˌeɪzaɪˈɡɑːspɔr/","extraExplanation":["词源提示：前缀 a- 常有“无/不”的意思，zygo- 来自“结合/接合”。在部分文献中，azygospore 也可能指“未完成正常接合过程而形成的类似接合孢子结构”（类似但不完全等同于典型 zygospore）；具体用法会随研究对象与教材而略有差异。"]}
{"word":"azygote","summary":{"en":"A rare biology term meaning “not formed by fertilization,” or an embryo/organism that develops without fertilization.","zh":"生物学中的罕见词，表示“非受精形成的”，也可指“未受精而发育的胚胎/个体”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) not formed from the union of sperm and egg; produced without fertilization.","zh":"（生物）非由精子与卵子结合形成的；未经受精产生的。"},"examples":[{"en":"Some insects can produce offspring in an azygote way through parthenogenesis.","zh":"有些昆虫可以通过孤雌生殖以“非受精（azygote）”的方式产生后代。"},{"en":"In this species, a few embryos develop as azygotes when mates are unavailable.","zh":"在这个物种中，当缺少配偶时，有些胚胎会以非受精的方式发育。"}]},{"partOfSpeech":"n.","definition":{"en":"an organism or embryo that develops without fertilization (rare).","zh":"（罕见）未经过受精而发育的个体或胚胎。"},"examples":[{"en":"The paper compared zygotes with azygotes to study early development.","zh":"这篇论文比较了受精卵与“非受精发育的胚胎”，以研究早期发育。"}]}],"synonyms":["asexual","parthenogenetic","unfertilized"],"phonetic":"/ˌeɪˈzaɪɡoʊt/","extraExplanation":["这个词在现代英语里非常少见，多出现在生物学/胚胎学语境中。学习时更常遇到的是 zygote（受精卵）以及 parthenogenesis（孤雌生殖）。","拼写上也容易被误读为短语 “a zygote”（一个受精卵）。如果你是在普通文章里看到它，建议结合上下文确认是不是分词/断句造成的误会。"]}
{"word":"azygous","summary":{"en":"“Azygous” means “unpaired,” and in anatomy it commonly refers to the azygos vein.","zh":"“azygous”意为“不成对的”；在解剖学中常与“奇静脉（azygos vein）”相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy) Not paired; existing as a single structure rather than one of a pair.","zh":"（解剖）不成对的；不是一对中的一个，而是单独存在的结构。"},"examples":[{"en":"In human anatomy, most veins are paired, but some are azygous.","zh":"在人类解剖中，大多数静脉是成对的，但也有一些是不成对的（azygous）。"},{"en":"The term “azygous” can describe any unpaired organ or vessel.","zh":"“azygous”这个词可用来描述任何不成对的器官或血管。"}]},{"partOfSpeech":"n.","definition":{"en":"(Anatomy) The azygos vein: a major vein running up the right side of the spine that helps drain blood from the chest wall into the superior vena cava.","zh":"（解剖）奇静脉：沿脊柱右侧向上走行的一条重要静脉，帮助将胸壁等部位的血液引流入上腔静脉。"},"examples":[{"en":"The radiology report noted enlargement of the azygous vein.","zh":"影像学报告提到奇静脉增粗（扩大）。"},{"en":"Blood from the chest wall can drain into the azygous vein.","zh":"来自胸壁的血液可回流入奇静脉。"}]}],"synonyms":["unpaired","single","azygos (vein)"],"phonetic":"/ˈæzɪɡəs/","extraExplanation":["词源提示：来自希腊语 a-（“不、无”）+ zygos（“轭；成对”），字面意思就是“非成对的”。在医学英语里常见于“azygous/azygos vein（奇静脉）”等固定搭配。","拼写提醒：医学上更常见的拼写是 **azygos**（尤其指“azygos vein”）；**azygous** 也可见，用作形容词强调“不成对”。"]}
{"word":"azyme","summary":{"en":"Azyme means “unleavened”—made without yeast, especially bread used in religious or historical contexts.","zh":"azyme 表示“无酵的/未发酵的”，尤指不用酵母制作的面包，常见于宗教或历史语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"without yeast or other leavening; unleavened (especially of bread).","zh":"无酵的；未发酵的（尤指面包）。"},"examples":[{"en":"During Passover, many Jewish families eat azyme bread (unleavened bread).","zh":"逾越节期间，许多犹太家庭会吃无酵饼（未发酵的面饼）。"},{"en":"The recipe uses azyme dough, so it stays flat and crisp.","zh":"这个食谱使用无酵面团，所以成品会比较薄而脆。"}]}],"synonyms":["unleavened"],"phonetic":"/əˈzaɪm/","extraExplanation":["“azyme”较常见于宗教或历史语境，尤其与《圣经》中的“无酵饼”有关（如逾越节、圣餐传统）。日常英语里更常用“unleavened”。","词源来自希腊语 a-（不）+ zymē（酵母/发酵），字面意思就是“没有酵母”。"]}
{"word":"azymite","summary":{"en":"Azymite refers to someone (or something) associated with using unleavened bread in the Eucharist, especially in historical East–West Christian contexts.","zh":"Azymite 指与圣餐使用无酵饼有关的人或事物，常见于基督教东西方历史争论语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Christian (especially in the Western/Latin Church) who uses unleavened bread in the Eucharist/Communion.","zh":"（尤指西方/拉丁教会的）在圣餐中使用无酵饼的基督徒；亦可指“无酵派”。"},"examples":[{"en":"In medieval debates, some writers accused the Azymites of changing the traditional bread used in the Eucharist.","zh":"在中世纪的争论中，一些作者指责“无酵派”改变了圣餐中传统使用的面饼。"},{"en":"The term “Azymite” was often used by Byzantine authors when criticizing Latin practices.","zh":"拜占庭作者在批评拉丁礼做法时，常用“Azymite（无酵派）”一词。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the use of unleavened bread, especially in the Eucharist.","zh":"与（尤其是圣餐中）使用无酵饼有关的；无酵饼的。"},"examples":[{"en":"They argued over azymite versus leavened bread in church liturgy.","zh":"他们就礼仪中使用无酵饼还是发酵面包展开争论。"},{"en":"Some texts describe “azymite” customs as characteristic of the Latin rite.","zh":"有些文本把“无酵饼的”习俗描述为拉丁礼的特征。"}]}],"synonyms":["unleavened","azymous","Latin-rite (context-dependent)"],"phonetic":"/ˈæzaɪˌmaɪt/","extraExplanation":["“Azymite”来自希腊语 a-（不）+ zymē（酵母/发酵），字面意思是“无酵的”。","这是一个带有历史争议色彩的词：中世纪东西教会分歧中，“圣餐用无酵饼还是发酵饼”曾是争论点之一；在一些东正教或拜占庭文献里，“Azymite”有时带批评或贬义，用来指称拉丁教会。现代英语中该词很少见，多用于历史或宗教研究语境。"]}
{"word":"azymous","summary":{"en":"Azymous means “unleavened,” especially referring to bread made without yeast, often in religious contexts.","zh":"azymous 指“无酵的”，尤指不加酵母制作的面包，常见于宗教语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of bread or dough) made without yeast or another leavening agent; unleavened.","zh":"（指面包或面团）不加酵母或其他发酵剂的；无酵的。"},"examples":[{"en":"During Passover, many Jewish families eat azymous bread (matzo).","zh":"在逾越节期间，许多犹太家庭会吃无酵饼（matzo）。"},{"en":"The recipe uses azymous dough, so it won’t rise much in the oven.","zh":"这个食谱用的是无酵面团，所以在烤箱里不会怎么膨起。"},{"en":"In some religious traditions, azymous bread is used for ceremonies.","zh":"在一些宗教传统中，仪式会使用无酵饼。"}]}],"synonyms":["unleavened","yeast-free","unfermented"],"phonetic":"/ˈæzɪməs/","extraExplanation":["“azymous”比较书面、少见，日常英语更常说“unleavened”。","词源来自希腊语 a-（不）+ zymē（发酵/酵母），与宗教语境联系很强，常见于谈论逾越节的无酵饼（matzo/matzah）或某些基督教礼仪用饼。"]}
