{"word":"BAA","summary":{"en":"“baa” is the sound a sheep makes, or the verb meaning “to make that sound.”","zh":"“baa”指羊（或山羊）的“咩”叫声，也可作动词表示“咩咩叫”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the sound a sheep or goat makes; a sheep’s “bleat.”","zh":"（羊或山羊的）咩咩叫声；羊叫声。"},"examples":[{"en":"We heard a loud baa from the field.","zh":"我们从田里听到一声很响的“咩”。"},{"en":"The lamb answered its mother with a soft baa.","zh":"小羊用轻轻的“咩”回应了妈妈。"}]},{"partOfSpeech":"v.","definition":{"en":"to make the sound of a sheep or goat.","zh":"（羊或山羊）咩咩叫；发出羊叫声。"},"examples":[{"en":"The sheep began to baa when the farmer arrived.","zh":"农夫一来，羊就开始咩咩叫。"},{"en":"Don’t baa at people—it’s rude, even as a joke.","zh":"别对着别人学羊叫——就算开玩笑也不礼貌。"}]}],"synonyms":["bleat"],"phonetic":"/bɑː/","extraExplanation":["“baa”是拟声词（onomatopoeia），用来模仿羊叫的声音。英语里更正式/更常见的词是“bleat”（作名词或动词都可以）。","在英语童谣《Baa, Baa, Black Sheep》中，“baa”常用来表现小羊说话/回应的感觉，因此也常出现在儿童绘本和启蒙读物里。"]}
{"word":"baa","summary":{"en":"“Baa” is the sound sheep (and sometimes goats) make, and it can be used as a noun, verb, or interjection.","zh":"“baa”表示羊（有时也指山羊）的叫声，可作名词、动词或感叹词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the sound a sheep or goat makes; “baah.”","zh":"（羊或山羊发出的）“咩”的叫声"},"examples":[{"en":"We could hear sheep baaing in the field.","zh":"我们能听到田里羊在咩咩叫。"},{"en":"The lamb gave a loud baa when it saw its mother.","zh":"小羊看到妈妈时大声“咩”了一下。"}]},{"partOfSpeech":"v.","definition":{"en":"to make the sound of a sheep or goat.","zh":"（像羊一样）咩咩叫"},"examples":[{"en":"The sheep baaed all night.","zh":"那只羊整夜都在咩咩叫。"},{"en":"Stop baaing and tell me what you want.","zh":"别光咩咩叫了，告诉我你想要什么。"}]},{"partOfSpeech":"int.","definition":{"en":"used to represent the sound of a sheep in writing or speech.","zh":"（拟声词，用来表示羊叫声）咩"},"examples":[{"en":"“Baa!” said the sheep in the children’s book.","zh":"儿童书里羊说：“咩！”"},{"en":"The kid shouted, “Baa, baa!” to imitate a sheep.","zh":"小孩喊“咩、咩！”来模仿羊叫。"}]}],"synonyms":["bleat"],"phonetic":"/bɑ/","extraExplanation":["“baa”是拟声词（onomatopoeia），用字母来模仿动物声音。不同语言对同一种声音的写法会不同：英语常写baa/baah，中文常写“咩”。","在英语里常见的搭配是“baa + -ing”（baaing）或“baaed”。也常用于形容人像羊一样发出单调的声音，带一点幽默或嘲讽意味。"]}
{"word":"baaed","summary":{"en":"“Baaed” means “made the sound ‘baa’,” the past form of “baa.”","zh":"“baaed”表示“发出咩咩声”，是“baa”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"past tense and past participle of “baa” (to make the sound of a sheep or goat).","zh":"“baa”的过去式和过去分词（指羊或山羊发出“咩咩”叫声）。"},"examples":[{"en":"The lamb baaed loudly when it couldn’t find its mother.","zh":"小羊找不到妈妈时大声咩咩叫。"},{"en":"All night, the sheep baaed in the field.","zh":"整晚羊群都在田里咩咩叫。"}]}],"synonyms":["bleated"],"phonetic":"/bɑd/","extraExplanation":["“baaed”是由拟声词动词“baa”加过去式“-ed”构成，拼写上看起来有点不常见，但在描述动物叫声的写作中是标准用法。也有人会用更常见的同义词“bleated”（尤指羊发出叫声）。"]}
{"word":"baahling","summary":{"en":"“Baahling” is usually a nonstandard spelling for “bawling,” meaning crying loudly or shouting loudly.","zh":"“baahling”通常是非标准写法，多半指“bawling”，意思是大声哭（或大声喊）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"cry loudly and uncontrollably (often in an upset or childish way).","zh":"（通常指很伤心或像小孩一样）大声哭闹、嚎啕大哭。"},"examples":[{"en":"The baby was bawling because she was hungry.","zh":"宝宝因为饿了在大声哭闹。"},{"en":"He came home bawling after the argument.","zh":"他吵完架回家时哭得很厉害。"}]},{"partOfSpeech":"v.","definition":{"en":"shout or speak very loudly.","zh":"大声喊叫；高声说话。"},"examples":[{"en":"Someone was bawling my name from across the street.","zh":"有人在街对面大声喊我的名字。"},{"en":"Stop bawling and talk to me calmly.","zh":"别再大喊了，冷静点跟我说。"}]}],"synonyms":["crying","sobbing","wailing","yelling","shouting"],"phonetic":"/ˈbɔlɪŋ/","extraExplanation":["“baahling”不是标准拼写，更常见的可能是 **bawling**（大哭/大喊）。如果你想表达羊叫的“咩——”，标准拼写通常是 **baaing**（或 **baa-ing**）。另外口语里 **balling** 也很常见：在俚语中可表示“很成功/很有钱”（balling），但拼写和意思都不同。"]}
{"word":"baaing","summary":{"en":"“Baaing” means making the sound a sheep makes (“baa”).","zh":"“baaing”指像羊一样发出“咩咩”的叫声。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"making the sound “baa” (the typical cry of a sheep or goat); the present participle of “baa.”","zh":"发出“咩”的叫声（羊或山羊常见的叫声）；“baa”的现在分词。"},"examples":[{"en":"We heard sheep baaing in the field.","zh":"我们听到田野里羊在咩咩叫。"},{"en":"The baaing grew louder as we walked closer to the barn.","zh":"我们走近谷仓时，咩咩声越来越大。"}]}],"synonyms":["bleating","braying (wrong animal; usually a donkey)","crying (general)"],"phonetic":"/ˈbeɪ.ɪŋ/","extraExplanation":["“baa”是拟声词（onomatopoeia），用来模仿羊的叫声，所以“baaing”常用于描写乡村、牧场等场景，带有很强的画面感。","拼写提示：常见形式是“baaing”（baa + ing）。有时也会看到“baa-ing”的写法，但不如前者常见。"]}
{"word":"Baal","summary":{"en":"Baal usually refers to an ancient Canaanite god (a “lord” figure), often mentioned in the Bible; it can also mean a demon name in later Western tradition.","zh":"Baal 通常指古代迦南的神祇“巴力”（意为“主/主人”，《圣经》中常作为异教神出现）；在后来的西方传统里也可指某个恶魔之名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in ancient Near Eastern religions) a title meaning “lord/master,” and commonly the name of a Canaanite storm and fertility god, often mentioned in the Bible as a false god or idol.","zh":"（古代近东宗教中）意为“主/主人”的称号，也常指迦南人的风暴与丰饶之神“巴力（Baal）”；在《圣经》中常被提到为“异教神/偶像”。"},"examples":[{"en":"In the Bible, the Israelites are sometimes warned not to worship Baal.","zh":"在《圣经》中，以色列人有时被警告不要敬拜巴力。"},{"en":"Archaeologists study inscriptions that mention Baal in ancient Canaan.","zh":"考古学家研究古代迦南铭文中提到“巴力”的内容。"}]},{"partOfSpeech":"n.","definition":{"en":"In later Western tradition, Baal is sometimes treated as the name of a demon in demonology and literature.","zh":"在后来的西方传统中，“Baal”有时在恶魔学与文学作品里被当作某个恶魔的名字。"},"examples":[{"en":"Some fantasy stories use Baal as the name of a powerful demon.","zh":"一些奇幻故事会用“Baal”来称呼强大的恶魔。"}]}],"synonyms":["idol","false god"],"phonetic":"ˈbeɪ.əl","extraExplanation":["“Baal”源自闪米特语族词根，基本义是“主人/主宰”。在不同地区与不同文献里，它既可能是“称号”，也可能被当作特定神祇的专名，因此语境很重要。","英语里通常大写为“Baal”作为专名；复数形式有时写作“Baalim”（多见于宗教或学术语境）。"]}
{"word":"baal","summary":{"en":"Baal is the name/title of an ancient Semitic deity (or “lord”) often mentioned in the Bible and ancient Near Eastern history.","zh":"Baal（巴力）是古代闪米特地区神祇的名称/称号（意为“主”），常见于《旧约》及古代近东历史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) An ancient Semitic god (especially a Canaanite/Phoenician deity), often associated with storms, rain, and fertility; in the Hebrew Bible, “Baal” is frequently used as a symbol of idol worship opposed to the worship of Yahweh (God).","zh":"（专有名词）古代闪米特民族的神祇（尤指迦南/腓尼基的神），常与风暴、降雨与丰饶相关；在《希伯来圣经/旧约》中，“Baal（巴力）”常被用作“偶像崇拜”的象征，与对耶和华（上帝）的敬拜相对立。"},"examples":[{"en":"In some biblical stories, prophets criticize people for worshiping Baal instead of God.","zh":"在一些《圣经》故事中，先知批评人们敬拜巴力而不是上帝。"},{"en":"The name Baal appears in ancient Near Eastern history and religious studies.","zh":"“Baal（巴力）”这个名字常出现在古代近东历史与宗教研究中。"}]},{"partOfSpeech":"n.","definition":{"en":"A general title meaning “lord/master” used in some ancient Semitic languages; sometimes it appears as part of place names or personal names in historical texts.","zh":"在一些古代闪米特语言中作“主/主人”的通称；在历史文献里有时会出现在地名或人名的一部分。"},"examples":[{"en":"In older texts, “baal” could mean “lord,” depending on the language and context.","zh":"在较早的文献中，“baal”在特定语言与语境下也可能表示“主人/主”。"}]}],"synonyms":["Bel","pagan deity","idol (in biblical context)"],"phonetic":"/ˈbeɪ.əl/","extraExplanation":["“Baal（巴力）”并非只指一个“唯一的神”，在不同地区与时期可能指不同的地方神或以“巴力”作为称号的神祇（类似“主神/本地守护神”的概念）。","在英语文化语境中，Baal常因《旧约》叙事而带有强烈的负面色彩（象征“偶像崇拜”）。在学术或历史语境中，通常更中性，侧重其在古代近东宗教体系中的位置。"]}
{"word":"Baal-berith","summary":{"en":"Baal-berith is a Canaanite god mentioned in the Bible, often understood as “Baal/lord of the covenant.”","zh":"Baal-berith 是《圣经》提到的迦南神祇，常被理解为“盟约之主/立约之巴力”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Canaanite deity mentioned in the Bible, whose name is often understood as “Baal (lord) of the covenant,” worshiped at Shechem.","zh":"《圣经》中提到的迦南神祇，名称常被理解为“盟约之主/立约之巴力”，据记载在示剑（Shechem）一带受人敬拜。"},"examples":[{"en":"In the Book of Judges, some people turned to the worship of Baal-berith.","zh":"在《士师记》中，有些人转而敬拜巴力·比利土（Baal-berith）。"},{"en":"The name Baal-berith is often translated as “lord of the covenant.”","zh":"Baal-berith 这个名字常被译为“盟约之主”。"}]}],"synonyms":["Baal","El-berith (related name)"],"phonetic":"/ˌbeɪ.əl ˈbɛr.ɪθ/","extraExplanation":["“Baal”在古代近东语境里可指“主、主人”，也常作为巴力神系的称号；“berith”对应希伯来语“盟约/契约”。因此这个名字既可能强调与盟约有关的崇拜，也可能反映当地政治或宗教结盟的背景。","Baal-berith主要出现在《士师记》8:33与9:4等处，常与以色列人背离耶和华、转向外邦神祇的叙事主题相关。","有些译本或注释会提到相关称呼如“El-berith”（“盟约之神”），可能与同一地区、相近崇拜传统有关，但在学术与译注中仍存在不同解释。"]}
{"word":"Baal-worshiper","summary":{"en":"A Baal-worshiper is someone who worships Baal, often mentioned in the Bible as an idolater.","zh":"Baal-worshiper 指敬拜巴力的人，在《圣经》语境中常被视为拜偶像者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who worships Baal (an ancient Semitic/Canaanite god), especially as mentioned in the Bible; often used negatively to mean an idol-worshiper","zh":"敬拜巴力（古代闪米特/迦南地区的神祇）的人；在《圣经》语境中常带贬义，指拜偶像的人"},"examples":[{"en":"In the Old Testament, prophets often condemned Baal-worshipers for abandoning their faith.","zh":"在《旧约》中，先知常谴责巴力崇拜者离弃信仰。"},{"en":"The term “Baal-worshiper” is sometimes used metaphorically to accuse someone of serving false ideals.","zh":"“Baal-worshiper”有时被用作比喻，用来指责某人追随虚假的理想。"}]}],"synonyms":["Baalist","idolater","pagan"],"phonetic":"/ˈbeɪ.əl ˈwɝː.ʃə.pɚ/","extraExplanation":["“Baal”常见于《圣经》叙事中，通常与以色列人被引诱去“拜偶像”的主题相关，因此“Baal-worshiper”在宗教或文学语境里往往带有强烈批评色彩。","在英文写法上也可见作 Baal worshiper（不加连字符）或复数 Baal-worshipers。"]}
{"word":"Baal-worshipper","summary":{"en":"A “Baal-worshipper” is someone who worships Baal; in English it often implies idol worship and is used mainly in biblical, historical, or literary contexts.","zh":"“Baal-worshipper”指崇拜巴力的人；英语中常带“偶像崇拜”的贬义，多用于《圣经》、历史或文学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who worships Baal (a name used in the Bible for certain ancient Near Eastern gods), often mentioned in English as an example of idol worship","zh":"崇拜巴力（《圣经》中对古代近东某些神祇的称呼）的人；英语里常用来指“偶像崇拜者”的典型例子"},"examples":[{"en":"In the story, the prophet challenges the Baal-worshippers to prove whose god is real.","zh":"在故事里，先知挑战巴力崇拜者，看看谁的神才是真实的。"},{"en":"The novel uses “Baal-worshipper” as a metaphor for someone who blindly follows money or power.","zh":"这部小说用“巴力崇拜者”来比喻盲目追随金钱或权力的人。"}]}],"synonyms":["idolater","pagan (in biblical/historical context)","Baalist (rare)"],"phonetic":"/ˈbeɪ.əl ˈwɝː.ʃɪ.pɚ/","extraExplanation":["“Baal”源自闪米特语族词根，原意接近“主人/主宰”。在《旧约》中，“巴力”常被当作以色列人应当拒绝的外邦神祇崇拜的代表，因此英语里带有强烈的宗教与道德评判色彩。","在现代英语里，这个词多出现在宗教讨论、文学修辞或历史语境中；日常交流中较少使用，且可能显得指责性很强。"]}
{"word":"Baal-worshipping","summary":{"en":"Baal-worshipping means worshipping the ancient god Baal, or (more broadly) being idolatrous—treating false gods or other things like money/power as idols.","zh":"Baal-worshipping 指崇拜古代神祇巴力；也可泛指崇拜偶像、把虚假对象（如金钱/权力）当作神来追随。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often disapproving) Worshipping Baal (an ancient Near Eastern god), or behaving as if one follows such worship.","zh":"（常含贬义）崇拜巴力（古代近东的一位神祇）；或表现得仿佛追随此类崇拜。"},"examples":[{"en":"In the Bible, some kings are criticized for leading the people into Baal-worshipping practices.","zh":"在《圣经》中，有些君王因带领百姓从事崇拜巴力的行为而受到谴责。"},{"en":"The writer uses “Baal-worshipping” as a symbol of turning away from one’s faith.","zh":"作者用“崇拜巴力的”来象征背离自己的信仰。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used more generally to mean devoted to false gods or idols; idolatrous.","zh":"更广义地指崇奉假神或偶像的；崇拜偶像的。"},"examples":[{"en":"The prophet condemns the nation’s Baal-worshipping heart—chasing power and wealth like idols.","zh":"先知谴责这个国家“崇拜巴力般”的内心——把权力和财富当作偶像去追逐。"},{"en":"In literature, “Baal-worshipping” sometimes describes any corrupt, idol-driven religion.","zh":"在文学中，“崇拜巴力的”有时用来指任何被偶像与腐败驱动的宗教。"}]}],"synonyms":["idolatrous","idol-worshipping","pagan (in some contexts)"],"phonetic":"/ˈbeɪəl ˌwɝːʃɪpɪŋ/","extraExplanation":["“Baal”常见于《旧约圣经》语境，原是迦南/腓尼基地区多位地方神祇的称号之一（常与风暴、丰收相关），在以色列宗教传统中常被视为与耶和华信仰对立。","英文里把某事称为“Baal-worshipping”通常带有强烈的道德批评色彩，暗示“背离正道、崇拜虚假对象”。在现代写作中也可能被借用来比喻对金钱、权力、名望等的‘偶像化’。","拼写提示：可写作 Baal-worshipping（英式连字符较常见）。也会看到 Baal worshiping（美式常用单 l 的 worshiping；是否加连字符取决于写作风格）。"]}
{"word":"Baalat","summary":{"en":"Baalat is a Canaanite/Phoenician goddess title meaning “Lady,” especially used for Baalat Gebal (“Lady of Byblos”).","zh":"Baalat是迦南/腓尼基语中意为“女主人/女神”的称号，尤常指“比布鲁斯的女神”Baalat Gebal。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A title and name for a Canaanite/Phoenician goddess meaning “Lady,” often used for a local patron goddess (especially Baalat Gebal, “Lady of Byblos”).","zh":"（专有名词）迦南/腓尼基语中的女神称号与名称，意为“女主人/女神”，常指某地的守护女神（尤其指“比布鲁斯的女神”Baalat Gebal）。"},"examples":[{"en":"Archaeologists have found inscriptions that mention Baalat as a protective goddess of the city.","zh":"考古学家发现了一些铭文，提到Baalat是这座城市的守护女神。"},{"en":"Some texts refer to Baalat Gebal, the “Lady of Byblos,” in Phoenician religion.","zh":"一些文献提到腓尼基宗教中的Baalat Gebal，即“比布鲁斯的女神”。"}]}],"synonyms":["Baalat Gebal","Lady of Byblos"],"phonetic":"/ˈbeɪ.ə.læt/","extraExplanation":["“Baalat”（也写作 Baʿalat）来自闪米特语词根：Baal（主、主人）对应阳性称号；Baalat 是其阴性形式，字面就是“女主人/女主”。因此它既可作为“称号”（类似“圣母/女王”那样的尊称），也可在特定地区被当作“神名”来使用。","在不同城市或神庙语境里，Baalat 可能指不同的女神形象（地方性很强）。最常被提到的是“Baalat Gebal（比布鲁斯的女神）”，有时会与埃及或希腊罗马世界中的女神形象发生“同一化/对应”解读（不同文化把对方的神与自己的神做类比）。","拼写与转写差异常见：Baalat / Baalat / Baʿalat；有时也会出现在“Baalath”等相近形式中（取决于语言与学术转写系统）。"]}
{"word":"Baalath","summary":{"en":"Baalath is a biblical place name, meaning a town/place associated with Baal.","zh":"Baalath 是《圣经》中的地名，含义与“巴力（Baal）相关的城镇/地点”有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A place name in the Bible (Hebrew: “Baalath/Baʿalath”), referring to one or more towns in ancient Canaan/Israel associated with worship of the god Baal; often translated as “(place) of Baal” or “Baal’s town.”","zh":"《圣经》中的地名（希伯来语：Baalath/Baʿalath），指古代迦南/以色列境内的一处或多处城镇，与巴力（Baal）崇拜有关；常被理解为“巴力之城/巴力所属之地”。"},"examples":[{"en":"In some Bible translations, Baalath is listed among towns in the tribal territories of Israel.","zh":"在一些《圣经》译本中，Baalath 被列为以色列各支派疆域中的城镇之一。"},{"en":"Scholars debate whether references to Baalath point to the same site or to different places with a similar name.","zh":"学者们讨论《圣经》中提到的 Baalath 是否指同一地点，或是不同但名称相近的地方。"}]}],"synonyms":["(no direct synonyms; sometimes treated as a variant of related biblical place names)"],"phonetic":"/ˈbeɪəˌlæθ/","extraExplanation":["Baalath 不是常见英语词汇，更像“专有名词/地名”。它与 Baal（巴力，古代近东地区被崇拜的一位神祇）有关，因此带有强烈的宗教与历史背景。","《圣经》中地名有时会因抄本、音译、以及不同译本传统而出现拼写差异或对应不同遗址的情况；查阅时可同时关注 Baalath、Baalathah、Baʿalath 等变体。"]}
{"word":"baalath","summary":{"en":"Baalath is a biblical proper name: mainly a place name in ancient Canaan/Israel, and sometimes a “Lady” title linked to Canaanite/Phoenician religion (related to Baal).","zh":"Baalath 是《圣经》中的专有名词：主要作古代迦南/以色列的地名；有时也作与迦南/腓尼基宗教相关的“女主”称号（与巴力 Baal 有关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name in the Bible, referring to one or more towns in ancient Canaan/Israel (mentioned in books such as Joshua and Kings)","zh":"《圣经》中的地名，指古代迦南/以色列境内的一个或多个城镇（见《约书亚记》《列王纪》等）"},"examples":[{"en":"Baalath is listed among towns connected with Israel’s tribal territories in the Old Testament.","zh":"《旧约》中把 Baalath 列为与以色列支派领地相关的城镇之一。"},{"en":"Some readers meet the name Baalath when studying the geography of ancient Israel.","zh":"有些读者在学习古代以色列地理时会看到 Baalath 这个名字。"}]},{"partOfSpeech":"n.","definition":{"en":"(also spelled Baalat) a title/name meaning “Lady,” used for a female deity in some Canaanite/Phoenician religious contexts, related to the god Baal","zh":"（亦作 Baalat）意为“女主/女主人”的称号或名字，在部分迦南/腓尼基宗教语境中用来指一位女神，与男神 Baal（巴力）相关"},"examples":[{"en":"In some sources, Baalath/Baalat appears as a “Lady” figure connected with local worship.","zh":"在一些资料中，Baalath/Baalat 被视为与地方崇拜相关的“女主”形象。"},{"en":"The name Baalath is linguistically related to Baal, but it can point to different local traditions.","zh":"从词源上看 Baalath 与 Baal 有关联，但在不同地区传统中所指可能不尽相同。"}]}],"synonyms":["Baalat"],"phonetic":"/ˈbeɪ.əˌlæθ/","extraExplanation":["“Baalath”多被英语读者当作专有名词（地名/神名）来理解。它与闪米特语词根 *baʿal*（意为“主人、主宰”）相关；女性形式可理解为“女主人/女主”。","《圣经》中的地名往往在不同译本、抄本或学术研究里出现拼写差异与定位争议，因此同一个名称有时可能对应不止一个地点。"]}
{"word":"Baalbeer","summary":{"en":"“Baalbeer” is not a standard English word; it is most likely a proper name or invented term, and its meaning depends on context.","zh":"“Baalbeer”不是标准英语词汇；更可能是专有名词或自造词，含义取决于具体语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or very rare term in English; most often seen as a proper name (e.g., a username, character name, or brand). Without context, it does not have a fixed dictionary meaning.","zh":"英语中非常少见或不规范的词；最常见是专有名词（如用户名、角色名或品牌名）。缺乏语境时，没有固定的词典释义。"},"examples":[{"en":"The account name “Baalbeer” appears in several gaming forums.","zh":"“Baalbeer”这个账号名出现在一些游戏论坛里。"},{"en":"If “Baalbeer” is a character, the story should explain what the name refers to.","zh":"如果“Baalbeer”是角色名，故事里最好解释这个名字指什么。"}]}],"synonyms":["(none—proper name/invented term)"],"phonetic":"ˈbeɪəlˌbɪr","extraExplanation":["“Baalbeer”不属于常见英语词汇，可能是自造词或拼写变体。你可以告诉我它出现的句子/领域（游戏、小说、地名、品牌等），我就能更准确地解释。","它看起来像“Baal + beer”的组合：Baal（巴力，古代近东的神名）+ beer（啤酒）。如果是这种玩梗/命名，通常带有宗教或奇幻氛围的暗示，但这属于语境推断。","也可能是拼写误差：例如你想找的是“Baalbek”（黎巴嫩的巴勒贝克，著名古罗马遗址）或“Baal”这个词本身。"]}
{"word":"Baalbek","summary":{"en":"Baalbek is an ancient city in Lebanon known for its huge Roman temple ruins.","zh":"Baalbek（巴勒贝克）是黎巴嫩的一座古城，以巨大的罗马神庙遗址闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient city in eastern Lebanon, famous for its monumental Roman temples and archaeological ruins (a UNESCO World Heritage Site).","zh":"黎巴嫩东部的一座古城，以宏伟的罗马神庙与考古遗址闻名（联合国教科文组织世界遗产）。"},"examples":[{"en":"We visited Baalbek to see the Temple of Bacchus.","zh":"我们去巴勒贝克参观了巴克斯神庙。"},{"en":"Baalbek’s ruins are among the best-preserved Roman sites in the region.","zh":"巴勒贝克的遗址是该地区保存最完好的罗马遗址之一。"},{"en":"The documentary explains how Baalbek influenced later architecture in the Middle East.","zh":"纪录片解释了巴勒贝克如何影响了后来中东的建筑。"}]}],"synonyms":["Heliopolis (Roman name)"],"phonetic":"/ˈbɑːl.bɛk/","extraExplanation":["“Baalbek”常被音译为“巴勒贝克”。其名称常被认为与古代闪米特神祇“Baal（巴力）”有关。","在罗马时期，这里也被称为“Heliopolis（太阳城）”，以巨型神庙群著名，尤其是朱庇特神庙、巴克斯神庙等。","在英语里它是专有名词，通常首字母大写；既可指“城市/遗址本身”，也可指“巴勒贝克神庙群/遗址群”。"]}
{"word":"Baalic","summary":{"en":"“Baalic” means “connected with Baal or the worship of Baal,” mostly used in religious or historical contexts.","zh":"“Baalic”意为“与巴力或巴力崇拜有关的”，多用于宗教或历史语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Baal (an ancient Semitic/Canaanite deity) or to the worship of Baal.","zh":"与“巴力”（古代闪米特/迦南地区的神祇）有关的；或指对巴力的崇拜。"},"examples":[{"en":"Archaeologists found objects linked to Baalic rituals at the site.","zh":"考古学家在遗址中发现了与巴力崇拜仪式相关的器物。"},{"en":"Some biblical texts criticize Baalic worship among the Israelites’ neighbors.","zh":"一些《圣经》文本批评以色列人邻邦中的巴力崇拜。"}]}],"synonyms":["Baal-worshiping","idolatrous (context-dependent)"],"phonetic":"/ˈbeɪ.ə.lɪk/","extraExplanation":["“Baalic”主要出现在宗教研究、古代近东史、圣经研究等语境中。日常英语里很少用，更常见的表达是“Baal worship / Baal worshipper”。","在《圣经》相关语境里，Baal 常与多神崇拜或“异教”相联系，因此“Baalic”有时会带批判或贬义色彩；学术写作中一般更中性。","Baal（巴力）在不同地区与时期可能指不同地方神或称号（类似“主/主人”之意），所以在阅读资料时要注意具体历史背景。"]}
{"word":"Baalim","summary":{"en":"“Baalim” is a biblical plural meaning “the Baals”—multiple local Baal gods/idols worshiped in ancient Canaan.","zh":"“Baalim”是《圣经》中的复数形式，意为“众巴力/巴力众神”，指古迦南地区被崇拜的多个巴力神祇或偶像。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biblical) the plural of Ba‘al; the local Baal gods worshiped in ancient Canaan, often mentioned in the Bible as false gods opposed to the worship of Yahweh/God.","zh":"（《圣经》用语）Baal（巴力）的复数；指古迦南各地被崇拜的“巴力”神祇群体，常在《圣经》中作为与敬拜上帝相对立的“外邦/假神”出现。"},"examples":[{"en":"The prophets condemned the people for turning from God to the Baalim.","zh":"先知谴责百姓离弃上帝去敬拜巴力众神（Baalim）。"},{"en":"In some Bible translations, “Baalim” refers to many local Baal idols rather than one god.","zh":"在一些《圣经》译本中，“Baalim”指多个地方性的巴力偶像，而不只是一个神。"}]}],"synonyms":["the Baals","false gods","idols"],"phonetic":"/ˈbeɪəlɪm/","extraExplanation":["“Baal”原本在闪语中有“主人、主宰”的意思；在迦南宗教语境里，常指与丰收、雨水、风暴等相关的神。用复数“Baalim”往往强调各地不同称号、不同祭祀中心的“巴力”形态。","该词多见于较为直译或保留原文风格的《圣经》英文译本；现代读者也常见到写作“the Baals”。"]}
{"word":"baalim","summary":{"en":"Baalim means “the Baals”—plural Canaanite gods or idols mentioned in the Bible.","zh":"Baalim 意为“众巴力”，指《圣经》中提到的多个迦南神祇或偶像。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biblical) the Baals; plural of Baʿal—local Canaanite gods or idols, often mentioned in the Hebrew Bible as objects of forbidden worship.","zh":"（《圣经》用语）“众巴力”；Baal（巴力）的复数，指迦南各地的神祇或偶像，常在《希伯来圣经》中作为被禁止敬拜的对象出现。"},"examples":[{"en":"The prophets condemned the people for turning to the Baalim.","zh":"先知谴责百姓转而敬拜“众巴力”。"},{"en":"In the story, worship of the Baalim is contrasted with worship of the LORD.","zh":"故事中将敬拜“众巴力”和敬拜耶和华形成对比。"}]}],"synonyms":["Baals","false gods","idols"],"phonetic":"ˈbeɪəlɪm","extraExplanation":["“Baalim”来自希伯来语 ba‘alim（בְּעָלִים），是 Ba‘al（“主人/主宰”）的复数形式。在古代近东语境里，它可以指不同地区的“巴力”崇拜（不止一个神像或神祇），所以英文常用复数来强调“各地的巴力”。","在英文写作中它多见于宗教研究、圣经注释或文学化的叙述；有时也会写作 “Baals”（较口语/现代拼写），但 “Baalim”更带古典或经文色彩。"]}
{"word":"Baalis","summary":{"en":"Baalis is a biblical proper name: an Ammonite king mentioned in Jeremiah 40:14.","zh":"Baalis（巴利斯）是《圣经》中的专有名词：在《耶利米书》40:14提到的亚扪王。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper name) A king of the Ammonites mentioned in the Bible (Jeremiah 40:14), said to have encouraged Ishmael to assassinate Gedaliah, the Babylonian-appointed governor of Judah.","zh":"（专有名词）《圣经》（《耶利米书》40:14）中提到的亚扪人王“巴利斯”，据说他唆使以实玛利刺杀被巴比伦任命为犹大总督的基大利。"},"examples":[{"en":"In Jeremiah 40:14, Baalis is named as the Ammonite king behind a plot against Gedaliah.","zh":"在《耶利米书》40:14中，巴利斯被提到是针对基大利阴谋背后的亚扪王。"},{"en":"The story links Baalis to political intrigue during Judah’s Babylonian period.","zh":"这个故事把巴利斯与犹大在巴比伦时期的政治阴谋联系起来。"}]}],"synonyms":["Baalis (biblical figure)","King of Ammon"],"phonetic":"ˈbeɪəlɪs","extraExplanation":["“Baalis”来自希伯来文音译（常见转写作 Baʿalis / Baalis），名字中可能包含“Baal（巴力）”这一古代近东常见的神祇称呼成分，但在英语里它主要作为《圣经》人物名字来使用，而不是普通词汇。","文化语境上，亚扪（Ammon）是古代约旦河东的民族/地区名；相关叙事出现在犹大亡国、巴比伦势力控制当地政局的背景下，因此常被用于讨论古代近东政治关系与圣经历史叙事。"]}
{"word":"Baalish","summary":{"en":"Baalish is a rare Bible-related form: usually the name Baalis (king of Ammon), and sometimes a very rare adjective meaning “related to Baal.”","zh":"Baalish 是较罕见的《圣经》相关形式：通常指亚扪王 Baalis 的另一种拼写，也偶尔作极少见的形容词，表示“与巴力/巴力崇拜有关”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Bible, rare) A proper name referring to Baalis (also spelled Baalish), a king of Ammon mentioned in the Old Testament.","zh":"（《圣经》用语，较罕见）专有名词，指亚扪人的王“巴阿利斯/巴阿利什”（Baalis/Baalish），出现在《旧约》中。"},"examples":[{"en":"In Jeremiah 40:14, Baalish (Baalis) is named as the king of the Ammonites.","zh":"在《耶利米书》40:14中，巴阿利什（Baalis）被提到是亚扪人的王。"},{"en":"Some translations spell the name as Baalis rather than Baalish.","zh":"一些译本把这个名字拼作 Baalis，而不是 Baalish。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Very rare) Related to Baal or the worship of Baal.","zh":"（非常罕见）与“巴力”（Baal）或对巴力的崇拜有关的。"},"examples":[{"en":"The text criticizes Baalish practices in the region.","zh":"文本批评了当地与巴力崇拜有关的做法。"},{"en":"Scholars sometimes use Baalish as a loose adjective meaning “Baal-related.”","zh":"学者有时把 Baalish 当作宽泛的形容词，表示“与巴力相关的”。"}]}],"synonyms":["Baalis","Baalite"],"phonetic":"/ˈbeɪəlɪʃ/","extraExplanation":["“Baal-”来自古代闪米特语族词根，常有“主、主人”的意思；在《圣经》语境里，Baal（巴力）多指迦南地区的神祇及其崇拜，因此相关人名或词形在不同译本/转写中会出现拼写差异，如 Baalis / Baalish。","如果你是在现代英文材料里看到 “Baalish”，很多情况下它要么是对 Baalis 的另一种拼写，要么是作者临时造的形容词，意思接近 “Baal-related / Baal-worshipping”。"]}
{"word":"baalish","summary":{"en":"“Baalish” means “connected with Baal or Baal-worship,” usually in a negative religious sense.","zh":"“Baalish”意为“与巴力或巴力崇拜有关的”，多用于宗教语境，常带贬义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Baal (a Canaanite deity mentioned in the Bible), or to the worship of Baal; often used in a negative, “idolatrous” sense in religious writing.","zh":"与“巴力”（《圣经》中提到的迦南神祇）有关的；或指对巴力的崇拜；常在宗教语境中带有贬义，含“偶像崇拜的”之意。"},"examples":[{"en":"Some sermons condemned the festival as a Baalish practice.","zh":"一些布道把这个节日谴责为“巴力式”的做法（带有偶像崇拜色彩）。"},{"en":"In the story, the king turns from Baalish rites to the worship of God.","zh":"在故事里，国王从“巴力式”的仪式转向敬拜上帝。"}]}],"synonyms":["Baal-worshipping","idolatrous","pagan"],"phonetic":"/ˈbeɪəlɪʃ/","extraExplanation":["“Baalish”在现代英语里很少见，更常见的表达是“Baal worship / Baal-worshipping（崇拜巴力的）”。它多出现在宗教讲道、圣经注释或带有宗教色彩的文学作品中，用来指责“背离正统信仰、转向偶像崇拜”。","Baal（巴力）是古代近东地区的神名/称号之一，常与迦南宗教相关。《旧约》叙事中，巴力崇拜常被描写为与以色列对耶和华的信仰冲突。"]}
{"word":"Baalism","summary":{"en":"Baalism means the worship of Baal, and by extension (often negatively) idolatry or treating something like a false god.","zh":"Baalism 指对巴力的崇拜，并可引申（多带贬义）为偶像崇拜或把某物当作“假神”来崇敬。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The worship of Baal (a Canaanite deity), especially in ancient Middle Eastern religions; also used more broadly to mean idol worship condemned in the Bible.","zh":"对巴力（迦南地区的神祇）的崇拜，尤指古代中东宗教中的相关祭祀；也可更广义地指《圣经》中所谴责的偶像崇拜。"},"examples":[{"en":"Some biblical writers describe Baalism as a major temptation for the Israelites.","zh":"一些《圣经》作者把巴力崇拜描写成以色列人面临的一大诱惑。"},{"en":"In older religious writings, “Baalism” can be used as a negative label for idolatry.","zh":"在较早的宗教著作中，“Baalism”有时被用作对偶像崇拜的贬义称呼。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, rare) A strong devotion to worldly power, wealth, or pleasure, treated like a false god.","zh":"（比喻义，较少见）对权力、财富或享乐的强烈迷恋，把它们当作“假神”来崇拜。"},"examples":[{"en":"The essay warns against modern forms of Baalism—treating money as the highest good.","zh":"这篇文章警惕现代形式的“巴力崇拜”——把金钱当作最高的善。"}]}],"synonyms":["Baal worship","idolatry","pagan worship"],"phonetic":"/ˈbeɪ.əˌlɪz.əm/","extraExplanation":["“Baal”在闪米特语族中有“主人、主宰”的意思，因此历史上“Baal”既可指特定神祇，也可能作为多位地方神的称号出现。不同地区对巴力的形象与职能（如与丰饶、风暴相关）并不完全一致。","在《旧约》中，巴力崇拜常与以色列人对耶和华的信仰形成对立，因此“Baalism”在英语宗教语境里往往带有强烈的贬义，强调“背离正信/陷入偶像崇拜”。","拼写注意：Baalism（常见）也可见 Baalism / Baal worship 等表达；作为学术或宗教史讨论时，语气相对中性；在劝诫性文本中则更具批判色彩。"]}
{"word":"baalism","summary":{"en":"Baalism means the worship of Baal, and more broadly can refer to idol worship or devotion to false gods.","zh":"Baalism 指巴力崇拜；也可泛指偶像崇拜或对假神的信奉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the worship of Baal (a name used in the ancient Near East for various local gods, often linked with fertility and storms), especially as described in the Bible; more generally, devotion to false gods or idol worship","zh":"巴力崇拜（古代近东对不同地方神祇的称呼，常与生育与风暴有关），尤指《圣经》中所描述的对巴力的崇拜；也可泛指对假神的崇拜或偶像崇拜"},"examples":[{"en":"In the Old Testament, Baalism is often condemned as a rival to the worship of Yahweh.","zh":"在《旧约》中，巴力崇拜常被谴责为与敬拜耶和华相对立的信仰。"},{"en":"The prophet’s speech warns the people not to return to Baalism.","zh":"先知的讲话警告百姓不要再回到巴力崇拜。"},{"en":"Some writers use “Baalism” metaphorically to criticize blind devotion to wealth or power.","zh":"一些作者会把“巴力崇拜”作比喻，用来批评对金钱或权力的盲目崇拜。"}]}],"synonyms":["idolatry","pagan worship","false worship"],"phonetic":"/ˈbeɪəˌlɪzəm/","extraExplanation":["“Baal”在闪米特语系中原意接近“主人/主宰”。在古代迦南及周边地区，不同城邦可能都有各自称为“Baal”的神祇，因此“Baalism”并不总是指同一个具体神。","在英语文化语境里，“Baalism”多见于宗教、历史与文学讨论，尤其与《圣经》中以色列人与迦南宗教冲突的叙事相关。现代写作中也可能被借用为“偶像化崇拜”的隐喻。"]}
{"word":"baalisms","summary":{"en":"Baalism means the worship of Baal, often discussed in biblical history, and can also mean idolatry in a broader, critical sense.","zh":"Baalism 指对“巴力”的崇拜，常见于《圣经》历史讨论；也可广义指带批判色彩的偶像崇拜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the worship of Baal (an ancient Near Eastern god), especially as described in the Bible; by extension, a pagan or idolatrous religion viewed as opposed to biblical worship","zh":"巴力崇拜（古代近东神祇“巴力”的崇拜，尤指《圣经》中所描述的）；引申为被视为与《圣经》信仰对立的异教/偶像崇拜"},"examples":[{"en":"In the Old Testament, prophets often condemn Baalism among the Israelites.","zh":"在《旧约》中，先知常常谴责以色列人中的巴力崇拜。"},{"en":"The historian noted how Baalism and other local cults influenced the region’s religious life.","zh":"这位历史学家指出，巴力崇拜和其他地方性祭祀如何影响该地区的宗教生活。"},{"en":"Some writers use “Baalism” as a metaphor for putting wealth or power above moral principles.","zh":"一些作者把“Baalism”当作隐喻，指把财富或权力置于道德原则之上。"}]}],"synonyms":["Baal worship","idolatry","paganism"],"phonetic":"/ˈbeɪ.əlˌɪzəm/","extraExplanation":["“baalisms”是复数形式，通常表示不同形式的巴力崇拜，或在修辞上泛指各种“偶像崇拜”的做法/倾向。","“Baal”原意与“主/主人”相关，在古代迦南及周边地区可指多个地方性神祇称号；《圣经》语境里常把对巴力的敬拜作为与耶和华信仰相对的对象，因此“Baalism”在宗教/文学讨论中常带有批判色彩。"]}
{"word":"Baalist","summary":{"en":"A Baalist is a worshipper of Baal, or something connected to Baal-worship.","zh":"Baalist 指“拜巴力者”，也可作形容词表示“与巴力崇拜有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who worships Baal (an ancient Semitic/Canaanite deity), or someone associated with Baal-worship","zh":"拜巴力者；巴力崇拜者（巴力为古代闪米特/迦南地区的神祇）"},"examples":[{"en":"In the Bible, prophets often condemn the Baalists for abandoning their covenant.","zh":"在《圣经》中，先知常常谴责拜巴力者背弃盟约。"},{"en":"The novel uses “Baalist” as a label for characters seen as corrupt or idolatrous.","zh":"这部小说用“Baalist”来指代被视为堕落或崇拜偶像的人物。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Baal or Baal-worship","zh":"与巴力或巴力崇拜有关的"},"examples":[{"en":"Archaeologists study Baalist practices to understand ancient religion in the region.","zh":"考古学家研究与巴力相关的崇拜习俗，以理解该地区的古代宗教。"}]}],"synonyms":["Baal worshipper","idolater","pagan (context-dependent)"],"phonetic":"/ˈbeɪəlɪst/","extraExplanation":["“Baal”常被解释为“主、主人”的意思，在古代近东不同地区可能指不同的神祇或称号；在《旧约》叙事里，巴力崇拜常与“背离信仰、崇拜偶像”联系在一起，因此“Baalist”在宗教或文学语境中有时带明显贬义。","现代日常英语中很少使用“Baalist”，多见于宗教研究、历史写作或引用《圣经》的文学作品。"]}
{"word":"baalist","summary":{"en":"A “Baalist” is someone who worships Baal, an ancient Near Eastern god.","zh":"“Baalist”指崇拜古代近东神祇“巴力”的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who worships Baal (an ancient Near Eastern god) or follows the religion centered on Baal","zh":"拜巴力者；巴力崇拜者（崇拜古代近东神祇“巴力”的人，或信奉以巴力为中心的宗教者）"},"examples":[{"en":"The prophet condemned the Baalists for turning away from their faith.","zh":"先知谴责巴力崇拜者背离了他们的信仰。"},{"en":"In some biblical stories, Baalists are portrayed as rivals to the worship of Yahweh.","zh":"在一些《圣经》故事里，巴力崇拜者被描写为对耶和华信仰的对立者。"}]}],"synonyms":["worshiper of Baal","Baal-worshiper"],"phonetic":"ˈbeɪəlɪst","extraExplanation":["“Baal”源自闪族语言，原意接近“主”“主人”，在不同地区可指不同的地方神或与丰饶、风暴相关的神祇。英语里的“Baalist”多见于宗教史、圣经研究或文学化表达中，日常英语里并不常用。","相关词：Baal（巴力），Baal worship（巴力崇拜），Baalism（巴力崇拜/巴力宗教，较少见）。"]}
{"word":"Baalistic","summary":{"en":"Baalistic means “related to Baal or the worship of Baal,” and is often used in biblical or historical contexts.","zh":"Baalistic 意为“与巴力或崇拜巴力有关的”，多用于《圣经》、历史或宗教语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Baal (an ancient Near Eastern god) or to the worship of Baal; characteristic of Baal worship.","zh":"与巴力（古代近东的神祇）有关的；与崇拜巴力相关的；具有巴力崇拜特征的。"},"examples":[{"en":"The prophet condemned the Baalistic practices of the people.","zh":"先知谴责了民众的巴力式（崇拜巴力的）行为。"},{"en":"Some texts describe Baalistic rituals as part of ancient Canaanite religion.","zh":"一些文献把巴力式仪式描述为古代迦南宗教的一部分。"}]}],"synonyms":["Baal-worshipping","idolatrous","pagan"],"phonetic":"/beɪˈælɪstɪk/","extraExplanation":["“Baal”常见于《圣经》相关语境，指迦南/腓尼基地区崇拜的神祇（常与风暴、丰饶等概念相关）。在《旧约》叙事中，“崇拜巴力”往往被描写为以色列人偏离对耶和华的信仰，因此“Baalistic”在宗教或文学批评中常带有负面色彩（如“偶像崇拜、异教崇拜”之意）。","该词比较少见，写作中更常用的表达包括 “Baal worship / Baal worshipping” 或更泛化的 “idolatrous（偶像崇拜的）”。"]}
{"word":"Baalite","summary":{"en":"A Baalite is a worshipper of Baal, or something connected to Baal worship.","zh":"Baalite 指巴力的崇拜者，或与巴力崇拜有关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a worshipper or follower of Baal (an ancient Canaanite deity mentioned in the Bible)","zh":"巴力的崇拜者／信徒（巴力是《圣经》中提到的古代迦南神祇）"},"examples":[{"en":"In the story, the prophet challenges the Baalites to prove whose god is real.","zh":"在故事中，先知挑战巴力的信徒，要求他们证明谁的神才是真实的。"},{"en":"Some kings were criticized for allowing Baalite practices in the kingdom.","zh":"有些君王因容许巴力崇拜的做法在国中盛行而受到批评。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the worship of Baal; connected with Baalites","zh":"与巴力崇拜有关的；与巴力信徒相关的"},"examples":[{"en":"The text describes Baalite rituals as a sign of religious conflict.","zh":"文本把巴力崇拜的仪式描述为宗教冲突的象征。"},{"en":"Archaeologists debate whether certain objects had a Baalite religious use.","zh":"考古学家争论某些器物是否具有与巴力崇拜相关的宗教用途。"}]}],"synonyms":["Baal-worshipper","Baalist","worshipper of Baal"],"phonetic":"ˈbeɪəˌlaɪt","extraExplanation":["“Baal”在古代西闪语中有“主人、主宰”的意思，因此在不同地区可能指不同的地方神；《旧约》中常把“巴力崇拜”与以色列人对耶和华的信仰对立起来。","“Baalite”在宗教或文学语境里有时带贬义色彩，用来指被视为“异教/偶像崇拜”的人或做法；现代写作中使用时注意语境与文化敏感度。"]}
{"word":"baalite","summary":{"en":"Baalite means a worshiper of Baal, or something connected with Baal worship.","zh":"Baalite 指拜巴力者，或与巴力崇拜有关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who worships Baal (an ancient Near Eastern god), especially as mentioned in the Bible","zh":"巴力的崇拜者；（尤指《圣经》中提到的）拜巴力者"},"examples":[{"en":"In the story, the prophet challenges the Baalites to prove whose god is real.","zh":"在故事里，先知挑战拜巴力者证明究竟谁的神才是真神。"},{"en":"Some passages describe Baalites as people who turned away from the worship of Yahweh.","zh":"有些经文把拜巴力者描述为背离耶和华信仰的人。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the worship of Baal or to Baal worshipers","zh":"与巴力崇拜有关的；拜巴力者的"},"examples":[{"en":"The text condemns certain Baalite rituals.","zh":"文本谴责某些与拜巴力有关的仪式。"},{"en":"They removed Baalite symbols from the temple.","zh":"他们把圣殿里的巴力崇拜符号移走了。"}]}],"synonyms":["worshiper of Baal","idolater (context-dependent)","pagan (broad, context-dependent)"],"phonetic":"ˈbeɪ.ə.laɪt","extraExplanation":["“Baal”（巴力）是古代迦南/腓尼基地区常见的神名与称号（原意有“主”“主人”之意），在《旧约圣经》中常被当作以色列人应当远离的异教崇拜对象，因此“Baalite”在宗教文本里通常带有强烈的负面评价色彩。","拼写提示：常见形式是复数 **Baalites**；发音上把它当作“Baal + -ite（表示…的人/派别）”。"]}
{"word":"Baalitical","summary":{"en":"Baalitical means “connected with Baal or the worship of Baal,” often used in biblical/historical contexts to imply idolatry.","zh":"Baalitical 指“与巴力或巴力崇拜有关的”，多用于《圣经》/历史语境，常含“偶像崇拜”的贬义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Baal (an ancient Near Eastern deity) or to the worship of Baal; often used to describe pagan or idolatrous religious practices in biblical or historical writing.","zh":"与巴力（古代近东的一位神祇）有关的；或指对巴力的崇拜。常见于《圣经》或历史语境中，用来形容异教/偶像崇拜的宗教行为。"},"examples":[{"en":"Some biblical writers condemn Baalitical rites as forms of idol worship.","zh":"一些《圣经》作者谴责巴力崇拜的仪式，认为那是偶像崇拜。"},{"en":"The historian described the conflict as a struggle between Hebrew worship and Baalitical practices.","zh":"那位历史学家把这场冲突描述为希伯来信仰与巴力崇拜之间的较量。"}]}],"synonyms":["Baalic","Baalite","idolatrous","pagan"],"phonetic":"/ˌbeɪəˈlɪtɪkəl/","extraExplanation":["“Baalitical”较少见，更多时候你会看到“Baalic / Baalite / Baal-worship（巴力崇拜的）”。在英语宗教与文学语境里，它常带有强烈的贬义色彩，用来指“背离一神信仰、转向偶像崇拜”。","Baal（巴力）在古代迦南地区被视为与风暴、丰产等相关的神祇名称或称号；在《旧约》叙事中，巴力崇拜常被用来对比以色列人对耶和华的敬拜。"]}
{"word":"baalitical","summary":{"en":"“Political” means related to politics or (of a person) interested/active in politics.","zh":"“Political” 表示“政治的；与政治有关的”，也可形容人“关心/参与政治的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to politics (government, public affairs, or how power is organized and used in society).","zh":"政治的；与政府、公共事务或社会权力运作有关的。"},"examples":[{"en":"She avoids political discussions at family dinners.","zh":"她在家庭晚餐时会避免谈政治。"},{"en":"The company made a political decision to support the new policy.","zh":"公司作出了支持新政策的政治性决定。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of a person) Interested or active in politics; having strong opinions about public issues.","zh":"（指人）关心或参与政治的；对公共议题有强烈看法的。"},"examples":[{"en":"He became more political after the election.","zh":"选举之后，他变得更关心政治了。"},{"en":"My roommate is very political and follows the news closely.","zh":"我室友很关心政治，经常密切关注新闻。"}]}],"synonyms":["governmental","civic","public","partisan"],"phonetic":"/pəˈlɪtɪkəl/","extraExplanation":["你输入的 **baalitical** 通常不是标准英文单词，更可能是 **political** 的拼写错误（把 p 写成 b、把 o 写成 aa 之类）。如果你指的是别的词（例如人名、品牌名或特定梗），可以告诉我上下文句子，我可以帮你确认。","常见搭配：**political party** 政党；**political system** 政治体制；**political debate** 政治辩论；**political pressure** 政治压力。"]}
{"word":"Baalize","summary":{"en":"Baalize is a rare verb meaning to turn someone/something toward the worship of Baal, often used more broadly to criticize idol worship.","zh":"Baalize 是一个较少见的动词，意为使转向对巴力的崇拜，也常泛指（带批评地）使走向偶像崇拜。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone/something follow or resemble the worship of Baal; to turn toward idol worship (used mostly in religious or historical writing).","zh":"使某人/某事走向对巴力（Baal）的崇拜；使转向偶像崇拜（多用于宗教或历史语境，较少见）。"},"examples":[{"en":"Some writers warned that the nation was being baalized by foreign religious practices.","zh":"一些作者警告说，这个国家正因外来宗教习俗而被“巴力化”（走向偶像崇拜）。"},{"en":"In his sermon, he used “baalize” to mean replacing faith with the worship of power and wealth.","zh":"在布道中，他用“baalize”来指用权力与财富的崇拜取代信仰。"}]}],"synonyms":["idolize","paganize","corrupt"],"phonetic":"/ˈbeɪəlaɪz/","extraExplanation":["“Baal（巴力）”出现在《圣经》中，常被描述为古代迦南地区的神祇形象。在一些宗教语境里，Baal 也被用作“偶像崇拜”的象征，因此 baalize 往往带有强烈的批评意味。","这个词非常少见，日常英语更常用 idolize（盲目崇拜）、paganize（使异教化）、corrupt（使堕落/腐化）等词来表达相近含义，具体取决于语境。"]}
{"word":"baalize","summary":{"en":"“Baalize” is an archaic verb meaning to worship Baal or to lead someone into Baal worship, often used critically in religious contexts.","zh":"“baalize”是古用动词，指崇拜巴力或使人转向崇拜巴力，常用于宗教语境并带有批评意味。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Archaic) To worship Baal, or to make someone follow the worship of Baal (a Canaanite deity mentioned in the Bible).","zh":"（古用）崇拜巴力；使某人改信／转向崇拜巴力（《圣经》中提到的迦南神祇）。"},"examples":[{"en":"The prophet warned the people not to baalize or copy the rites of their neighbors.","zh":"先知警告百姓不要去“崇拜巴力”，也不要模仿邻国的宗教仪式。"},{"en":"In some old writings, the word baalize is used to criticize turning away from God.","zh":"在一些旧文献里，baalize 用来批评人背离上帝。"}]}],"synonyms":["idolize (in a religious sense)","paganize","convert (context-dependent)"],"phonetic":"/ˈbeɪəlaɪz/","extraExplanation":["“baalize”主要出现在较旧的宗教/文学文本中，现代英语里很少用。它来自“Baal（巴力）+ -ize（使……化/使成为）”，常带有强烈的批评色彩，指“陷入偶像崇拜、背离正统信仰”。","Baal（巴力）在《旧约》中常与“偶像崇拜”“异教仪式”等主题相关，因此“baalize”在语气上往往不只是“改信”，还暗含“被引诱、堕落”的评价。"]}
{"word":"Baalized","summary":{"en":"“Baalized” is a rare word meaning influenced by the worship of Baal—used to criticize idolatry, literally or as a metaphor.","zh":"“Baalized”是个罕见词，指受巴力崇拜影响、走向偶像崇拜的（也可比喻把某物当神来崇拜）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, literary) Turned toward the worship of Baal; influenced by idolatry (especially in a Biblical context).","zh":"（罕见/文学用语）变得崇拜巴力（Baal）的；受偶像崇拜影响的（尤指《圣经》语境）。"},"examples":[{"en":"The prophet condemned the Baalized nation for abandoning its covenant.","zh":"先知谴责这个“巴力化”的民族背弃了盟约。"},{"en":"In the sermon, “Baalized hearts” meant people who treated money like a god.","zh":"在那篇布道里，“巴力化的心”指把金钱当作神来崇拜的人。"}]},{"partOfSpeech":"v.","definition":{"en":"Past form of “baalize”: to make someone worship Baal or to lead them into idolatry.","zh":"“baalize”的过去式：使某人崇拜巴力，或把人引向偶像崇拜。"},"examples":[{"en":"He warned that false teachers had Baalized the community.","zh":"他警告说，假师傅已经把社群带向“巴力式的偶像崇拜”。"},{"en":"The story portrays how quickly the people were Baalized by their neighbors’ customs.","zh":"故事描写人们如何很快被邻邦的习俗“巴力化”。"}]}],"synonyms":["idolatrous","paganized","idol-worshiping","corrupted by idolatry"],"phonetic":"/ˈbeɪ.əˌlaɪzd/","extraExplanation":["“Baal（巴力）”是古代近东（尤其迦南/腓尼基）常见的神祇称号与名字，在《旧约》中常与以色列人被指责“转向偶像崇拜”的叙事相连。因此 Baalized 常带有强烈的宗教批评色彩，也可在现代比喻为“把某物当神一样崇拜”（如金钱、权力、名望）。","该词非常少见，多见于神学写作、宗教讲道或较旧的文学文本里；日常英语更常用 idolatrous（偶像崇拜的）、corrupted by idolatry（被偶像崇拜腐化的）、paganized（异教化的）等表达。"]}
{"word":"Baalizing","summary":{"en":"Baalizing is a rare word meaning “idolizing” or promoting false, Baal-like worship—often used as a criticism of excessive admiration.","zh":"Baalizing 是个罕见词，指把人或事物偶像化、神化，类似“巴力式的错误崇拜”，常用于批评过度崇拜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) The act of turning someone or something into an idol, or promoting worship/idolatry—especially linked to the biblical god Baal; often used to criticize excessive admiration as “false worship.”","zh":"（罕见）把某人或某物“神化”、当作偶像来崇拜；尤指与《圣经》中“巴力（Baal）”崇拜相关的偶像崇拜之意，常用于批评过度崇拜或盲目追随。"},"examples":[{"en":"Some critics warned that celebrity culture was Baalizing fame and money.","zh":"一些评论者警告说，名人文化是在把名望和金钱“巴力化”，当作偶像来崇拜。"},{"en":"The essay argues that modern politics can slip into Baalizing leaders instead of judging their actions.","zh":"这篇文章认为，现代政治可能会滑向对领导人的“巴力化”崇拜，而不是评判他们的行为。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “Baalize”: to idolize; to lead others into (or practice) Baal-like worship or idolatry.","zh":"“Baalize”的现在分词：把……当偶像崇拜；使……陷入（或实行）类似“巴力崇拜”的偶像崇拜。"},"examples":[{"en":"By treating the brand as sacred, the ad campaign was Baalizing a product.","zh":"把品牌说得神圣不可侵犯，这个广告活动是在把产品“巴力化”。"},{"en":"He accused the movement of Baalizing power rather than serving people.","zh":"他指责该运动是在“巴力化”权力，而不是服务人民。"}]}],"synonyms":["idolizing","worshiping","deifying","making an idol of","venerating"],"phonetic":"/ˈbeɪəlaɪzɪŋ/","extraExplanation":["“Baal”（巴力）在《圣经》语境中常被视为与以色列信仰相对立的偶像崇拜对象，因此由其构成的“Baalize/Baalizing”多带强烈批判色彩，常用于宗教、政治或社会评论中，暗示“把不该崇拜的东西当神一样崇拜”。","该词非常少见，日常英语中更常用的表达有：idolizing（偶像化）、worshiping（崇拜）、deifying（神化）、making an idol of…（把……当偶像）。"]}
{"word":"Baalman","summary":{"en":"Baalman is most commonly used as a surname (a proper name for a person or family).","zh":"Baalman 最常见的用法是姓氏（指某个人或家族的专有名称）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), typically used as a proper noun for a person or family.","zh":"（常见作专有名词）姓氏/家族名，用来指某个人或某个家族。"},"examples":[{"en":"Ms. Baalman will join the meeting at 3 p.m.","zh":"Baalman 女士将于下午三点参加会议。"},{"en":"I saw the name “Baalman” on the email signature.","zh":"我在邮件签名里看到了“Baalman”这个名字。"}]}],"phonetic":"/ˈbɑːlmən/","extraExplanation":["“Baalman”通常被当作姓氏使用，因此首字母要大写。发音会因家族语言背景而不同；在英语语境中常按拼写读作类似“BAL-mən”。如果你是在某本书、电影或某个品牌/地名里看到它，也可能是特定人物或专名，需要结合具体语境确认。"]}
{"word":"Baals","summary":{"en":"“Baals” is the plural of “Baal”: ancient Canaanite deities called “lord,” and in biblical/figurative use, false gods or anything treated like an idol.","zh":"“Baals”是“Baal（巴力）”的复数：指古代迦南等地被称为“主”的诸神；在《圣经》及引申用法中也指假神/偶像，或任何被人当作偶像崇拜的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of Baal) one of several ancient Semitic/Canaanite deities called “Baal,” a title meaning “lord,” often linked with fertility and storms.","zh":"（Baal 的复数）古代闪米特/迦南地区被称为“Baal”的诸神之一；“Baal”原意为“主/领主”，常与丰饶、风暴等崇拜相关。"},"examples":[{"en":"Archaeologists found inscriptions that mention different Baals worshiped in nearby cities.","zh":"考古学家发现铭文提到邻近城邦崇拜的不同“巴力诸神”。"},{"en":"Some texts describe local Baals as protectors of agriculture and rainfall.","zh":"一些文献把各地的巴力神描写成守护农业与降雨的神祇。"}]},{"partOfSpeech":"n.","definition":{"en":"In the Bible and later Jewish/Christian writing, “Baals” can mean false gods or idols (often contrasted with worship of the God of Israel).","zh":"在《圣经》及后来的犹太/基督教传统中，“Baals”可指“假神/偶像”（常与对以色列之神的信仰相对）。"},"examples":[{"en":"The prophets criticized people for turning from God to the Baals.","zh":"先知谴责人们离弃上帝去敬拜巴力诸偶像。"},{"en":"The story uses “Baals” as a symbol of idolatry.","zh":"这个故事用“Baals”象征偶像崇拜。"}]},{"partOfSpeech":"n.","definition":{"en":"Figuratively: powerful things people obsess over or treat as ultimate—money, fame, ideology, etc.","zh":"比喻：人们过度迷恋、奉为“至高”的事物，如金钱、名声、意识形态等。"},"examples":[{"en":"He warned that modern Baals can distract us from what matters most.","zh":"他警告说，现代的“巴力”会让我们偏离真正重要的事。"},{"en":"For her, success had become a Baal.","zh":"对她来说，成功已经成了一个“巴力”（被奉为至高的东西）。"}]}],"synonyms":["idols","false gods","pagan gods"],"phonetic":"/beɪəlz/","extraExplanation":["“Baal/巴力”在古代近东并不总是单一神名，更常是“主、主人”的称号；不同城市可能有自己的“巴力”（因此英语里常见复数 Baals）。","在英语里，Baal/Baals 常带有强烈的宗教与文学色彩，尤其在《旧约》中与“偶像崇拜”相关；写作者有时借用它来批评把某种欲望或权力当作“神”来崇拜。","发音上常读作 /beɪ.əl/（两音节），复数加 -s 成 /beɪ.əlz/。"]}
{"word":"baals","summary":{"en":"“baals” is the plural of Baal, referring to multiple Baal deities or idols linked to Baal worship, especially in biblical contexts.","zh":"“baals”是 Baal（巴力）的复数，常用于《圣经》语境，指多种“巴力”神祇或与巴力崇拜相关的偶像/假神。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of Baal) In the Bible and ancient Near Eastern contexts, “baals” refers to different local forms of Baal—Canaanite storm/fertility gods—or to idols/false gods associated with Baal worship.","zh":"（Baal 的复数）在《圣经》和古代近东语境中，baals 指不同地方性形态的“巴力”（迦南的风暴/丰饶之神），也可泛指与巴力崇拜相关的偶像、假神。"},"examples":[{"en":"The prophets criticized the people for worshiping the baals instead of God.","zh":"先知责备百姓敬拜巴力诸神（baals），而不是敬拜上帝。"},{"en":"The text mentions tearing down altars built for the baals.","zh":"经文提到拆毁为巴力诸神（baals）建立的祭坛。"}]}],"synonyms":["idols","false gods","pagan gods"],"phonetic":"/beɪəlz/","extraExplanation":["常见写法：多见于宗教/历史语境；作为专名或神祇名通常首字母大写（Baals），但在一些译本或讨论“偶像/假神”时也可能写作小写（baals）。","文化背景：古代迦南地区“Baal（巴力）”常作为“主/主人”的称号，用于不同地方的神祇，因此复数 baals 可指“各地的巴力形态/诸巴力”。"]}
{"word":"Baalshem","summary":{"en":"Baalshem refers to a Jewish folk religious healer/mystic, and it can also relate to the title connected with the Baal Shem Tov, a key figure behind early Hasidic tradition.","zh":"Baalshem 指犹太民间宗教中的疗愈者／神秘主义者；也可指与“巴尔谢姆托夫”（哈西德传统的重要源头人物）相关的称谓。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Jewish religious healer or mystic (especially in Eastern Europe) believed to have special knowledge of sacred names and to perform protective or healing acts through prayers and amulets.","zh":"（尤指东欧犹太传统中的）“巴尔谢姆”：被认为掌握神圣之名、通过祈祷与护符进行祈福、保护或治病的犹太宗教疗愈者／神秘主义者。"},"examples":[{"en":"In the story, the villagers go to a Baalshem for a blessing and protection.","zh":"在故事里，村民去找一位巴尔谢姆求祝福与护佑。"},{"en":"Some old folktales describe a Baalshem who heals the sick through prayer.","zh":"一些古老民间传说描写巴尔谢姆通过祈祷为病人疗愈。"}]},{"partOfSpeech":"n.","definition":{"en":"A title associated with the Baal Shem Tov (Israel ben Eliezer), the influential 18th‑century Jewish spiritual teacher linked to the rise of Hasidic Judaism.","zh":"与“巴尔谢姆托夫”（以色列·本·以利以则，18世纪重要犹太灵修导师）相关的称谓；他与哈西德派犹太教的兴起密切相关。"},"examples":[{"en":"Many Hasidic traditions trace their roots back to the Baal Shem Tov.","zh":"许多哈西德派传统都追溯其根源到巴尔谢姆托夫。"}]}],"synonyms":["Baal Shem","Baal Shem Tov (related term)"],"phonetic":"/ˌbɑːl ˈʃɛm/","extraExplanation":["“Baal Shem”来自希伯来语，字面意思是“名字（圣名）的主人／掌握者”（常被理解为掌握上帝圣名的人）。英语里也常写作 Baal Shem、Ba'al Shem；你给的 Baalshem 属于连写形式。","在犹太文化语境中，它并不等同于一般意义的“魔法师”；更常出现在民间宗教、护符（amulet）、祈祷与传说故事的背景中。阅读相关文本时，注意其宗教与历史语境，避免与其他宗教中含“Baal（巴力）”的概念混淆。"]}
{"word":"baalshem","summary":{"en":"Baal shem is a Jewish term for a mystic/wonder-worker; it’s also used in the title “Baal Shem Tov,” a major figure in early Hasidism.","zh":"Baal shem 是犹太传统中对“神秘主义者/行神迹者”的称呼；也常见于称号“Baal Shem Tov”，指哈西德早期的重要人物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Judaism) A Jewish mystic or wonder-worker, believed to have special spiritual power through using sacred names of God; literally “master of the (Divine) Name.”","zh":"（犹太教）指犹太神秘主义者或行神迹者，被认为能通过使用上帝的圣名获得特殊灵力；字面意为“圣名之主/掌名者”。"},"examples":[{"en":"In some stories, a baal shem heals the sick by prayer and sacred names.","zh":"在一些故事里，baal shem 通过祈祷和神圣之名为病人治病。"},{"en":"The term baal shem appears in Jewish folklore about spiritual healers.","zh":"“baal shem”一词常见于有关灵性医者的犹太民间传说中。"}]},{"partOfSpeech":"n.","definition":{"en":"Often used as a title in the phrase “Baal Shem Tov,” referring to Rabbi Israel ben Eliezer (c. 1700–1760), a key founder of Hasidic Judaism.","zh":"常用于短语“Baal Shem Tov（巴尔·谢姆·托夫）”，指以色列·本·以利以谢拉比（约1700–1760），哈西德犹太教的重要奠基人物之一。"},"examples":[{"en":"Many Hasidic traditions trace their inspiration to the Baal Shem Tov.","zh":"许多哈西德传统都将其精神源头追溯到 Baal Shem Tov。"},{"en":"We read a brief biography of the Baal Shem Tov in class.","zh":"我们在课上读了一篇关于 Baal Shem Tov 的简短传记。"}]}],"synonyms":["Jewish mystic","wonder-worker","faith healer","Baal Shem Tov"],"phonetic":"/ˌbɑːəl ˈʃɛm/","extraExplanation":["“Baal Shem”来自希伯来语：ba‘al（主人/掌管者）+ shem（名字）。在犹太传统里，“Name（名）”常作为对上帝的敬称或代称，因此“master of the Name”带有宗教敬畏的含义。","英语中常见写法有 Baal Shem、Ba'al Shem；有时会连写为 Baalshem（较少见，多见于转写/排版习惯）。在正式写作中常保留空格或撇号。"]}
{"word":"baar","summary":{"en":"“baar” is not standard English; it’s often a Hindi/Urdu romanization meaning “time/occasion” (e.g., “ek baar” = “once”).","zh":"“baar”不是标准英语，常为印地语/乌尔都语“baar”的拉丁字母写法，意思是“次/回/时候”（如“ek baar”=“一次”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not standard English) A romanization of the Hindi/Urdu word “baar” (बार/بار), meaning “time; occasion,” often heard in Hinglish/Urdu mixing (e.g., “ek baar” = “once”). In formal English, use “time,” “once,” or “again.”","zh":"（非标准英语）印地语/乌尔都语“baar”（बार/بار）的拉丁字母写法，意思是“次；回；时候”，常见于印地语/乌尔都语与英语混用（如“ek baar”=“一次”）。正式英语中通常用“time / once / again”。"},"examples":[{"en":"Can you do it one more baar? (Hinglish; in English: “one more time” or “again”)","zh":"你能再做一次 baar 吗？（印英混用；英语应说“one more time/again”）"},{"en":"Ek baar listen to me, please. (In English: “Listen to me once, please.”)","zh":"请你听我说一次。（英语：Listen to me once, please.）"}]}],"synonyms":["time","occasion","once","again"],"phonetic":"/bɑr/","extraExplanation":["“baar”不是常见的英语单词；在英语写作或考试中不建议使用。若你想表达“次数/一次/再一次”，更自然的英语是：once（一次）、again（再一次）、one more time（再来一次）、times（次数）。","它的发音在口语里常接近英语“bar”。如果你其实想查的是英语单词“bar”（酒吧/条形/阻挡等），告诉我你的语境，我可以按“bar”给你完整释义。"]}
{"word":"BaaS","summary":{"en":"BaaS most commonly means “Backend as a Service” in software, and can also mean “Banking as a Service” in fintech.","zh":"BaaS在软件领域通常指“后端即服务”，在金融科技领域也可指“银行即服务”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Backend as a Service: a cloud service that provides ready-made backend features (like user login, databases, file storage, and push notifications) so developers can build apps faster without managing servers.","zh":"后端即服务：一种云服务，提供现成的后端功能（如用户登录、数据库、文件存储、推送通知等），让开发者无需自己维护服务器也能更快开发应用。"},"examples":[{"en":"We used a BaaS to add user authentication and a database in one day.","zh":"我们用了一个BaaS，一天内就加好了用户认证和数据库。"},{"en":"With a BaaS, the team can focus on the app’s design instead of server maintenance.","zh":"有了BaaS，团队可以把精力放在应用设计上，而不是服务器维护。"}]},{"partOfSpeech":"n.","definition":{"en":"Banking as a Service: a model where licensed banks provide banking infrastructure (like accounts, cards, and payments) through APIs, so other companies can offer financial products.","zh":"银行即服务：一种模式，由持牌银行通过API提供银行基础设施（如账户、银行卡、支付等），让其他公司也能对外提供金融产品。"},"examples":[{"en":"The fintech launched a new debit card program using BaaS APIs.","zh":"这家金融科技公司通过BaaS API上线了新的借记卡项目。"},{"en":"BaaS lets a retail brand offer payment and wallet features without becoming a bank.","zh":"BaaS让零售品牌无需成为银行，也能提供支付和钱包功能。"}]}],"synonyms":["Backend as a Service","mBaaS (mobile Backend as a Service)","Banking-as-a-Service"],"phonetic":"/bi eɪ eɪ ɛs/","extraExplanation":["“BaaS”是缩写，常见读法是逐字母读（B-A-A-S）。在科技语境里更常指“Backend as a Service”，在金融/合规语境里常指“Banking as a Service”。","看到“BaaS”时可以用上下文判断：如果周围出现app、database、push notifications、Firebase等，多半是“后端即服务”；如果出现API、cards、payments、licensed bank、fintech等，多半是“银行即服务”。"]}
{"word":"baas","summary":{"en":"“Baas” means “boss,” mainly used in South African English.","zh":"“baas”主要用于南非英语，意思是“老板/上司”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South African English, from Afrikaans) A boss; an employer or person in charge.","zh":"（南非英语，源自南非荷兰语）老板；雇主；负责人。"},"examples":[{"en":"Ask the baas if you can leave early today.","zh":"去问问老板你今天能不能早走。"},{"en":"The baas hired two new workers this week.","zh":"老板这周雇了两名新工人。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical/colonial context) A master; the person who holds authority over workers or servants.","zh":"（历史/殖民语境）主人；对工人或仆役有支配权的人。"},"examples":[{"en":"In older texts, workers might call the landowner “baas.”","zh":"在较早的文本里，工人可能会称地主为“baas”。"}]}],"synonyms":["boss","employer","manager","chief"],"phonetic":"/bɑs/","extraExplanation":["“baas”常见于南非英语，来自南非荷兰语（Afrikaans），与荷兰语“baas（老板）”同源。","在现代口语里它多表示“老板/上司”，但在某些历史或种族隔离相关语境中可能带有不平等的权力含义；使用时注意场合与对象。"]}
{"word":"baases","summary":{"en":"“Baases” is usually a misspelling of “bases,” the plural of “base” (foundations/grounds; also baseball bases).","zh":"“baases”通常是“bases”的拼写错误；“bases”是“base”的复数，常指基础/依据，也可指棒球的垒位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of base: the foundations or main parts something is built on; the basic facts/ideas that support a plan or argument.","zh":"base 的复数：基础、根基；（计划/论点的）依据、基本事实或主要部分。"},"examples":[{"en":"The report is based on several reliable sources, but its bases are still limited.","zh":"这份报告基于几个可靠来源，但它的依据仍然有限。"},{"en":"Trust and clear communication are the bases of a good relationship.","zh":"信任和清晰沟通是一段良好关系的基础。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of base (sports): the four positions a runner can reach in baseball/softball (first base, second base, third base, home base).","zh":"base 的复数（体育）：棒球/垒球中跑者要依次到达的垒位（如一垒、二垒、三垒、本垒）。"},"examples":[{"en":"He ran the bases quickly after hitting a double.","zh":"他打出二垒安打后迅速跑过各个垒位。"},{"en":"Practice includes fielding and running the bases.","zh":"训练内容包括守备和跑垒。"}]}],"synonyms":["foundations","grounds","fundamentals","basis"],"phonetic":"/ˈbeɪsiz/","extraExplanation":["“baases”通常是拼写错误，更常见的正确拼法是 **bases**（/ˈbeɪsiz/）。\n另外也有人想写 **basses**（复数：低音；或 bass 鱼），发音和意思都不同：**bases** /ˈbeɪsiz/，**basses** /ˈbæsɪz/ 或 /ˈbeɪsɪz/（视词义而定）。如果你想查的是“basses”，告诉我句子语境我可以帮你确认。"]}
{"word":"baaskaap","summary":{"en":"Baaskaap means domination or supremacy, especially the historical white dominance associated with apartheid in South Africa.","zh":"Baaskaap 指“支配/霸权”，尤指南非种族隔离时期与白人统治相关的历史性“白人霸权”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South African English, from Afrikaans) dominance or control over others; historically, the political and social dominance of white people under apartheid.","zh":"（南非英语，源自南非荷兰语）对他人的支配或控制；历史上常特指种族隔离时期白人对社会与政治的统治/霸权。"},"examples":[{"en":"The writer criticized baaskaap and called for equal rights for all citizens.","zh":"这位作者批判“baaskaap”（白人霸权/支配），并呼吁所有公民享有平等权利。"},{"en":"Many activists saw apartheid as a system designed to preserve baaskaap.","zh":"许多行动者认为，种族隔离制度就是为了维持“baaskaap”（统治/霸权）而设计的。"}]}],"synonyms":["domination","supremacy","hegemony","white supremacy (context-specific)"],"phonetic":"/ˈbɑskɑp/","extraExplanation":["“baaskaap”来自南非荷兰语：baas（“老板/主人”）+ -kaap（“地位/统治”相关构词），常带有强烈的历史与政治色彩。它经常出现在讨论殖民主义、种族不平等、以及南非种族隔离（apartheid）历史的语境中。","由于该词与种族压迫历史紧密相关，在日常对话中使用可能显得非常尖锐甚至冒犯；学习者更常在新闻、历史写作或批评性语境中遇到它。"]}
{"word":"baaskaaps","summary":{"en":"Baaskaaps is a South African term (from Afrikaans) meaning domination or “master rule,” often associated with apartheid-era white supremacy.","zh":"Baaskaaps 是南非用语（源自南非荷兰语），指“支配/主宰/主人统治”，常与种族隔离时期的白人至上统治相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South African English, from Afrikaans) A belief or policy that one group should rule over others; domination or “mastery,” especially linked to apartheid-era white supremacy.","zh":"（南非英语，源自南非荷兰语）主张某一群体统治他人的观念或政策；支配/“主宰”，常与种族隔离时期的白人至上与统治思想相关。"},"examples":[{"en":"The slogan was criticized for promoting baaskaaps over equality.","zh":"这句口号因宣扬“baaskaaps”（支配/主宰）而非平等而受到批评。"},{"en":"Many writers describe apartheid as a system built on baaskaaps.","zh":"许多作家把种族隔离描写成建立在“baaskaaps”（统治/压迫）之上的制度。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Describing attitudes or actions that try to dominate or control others in a “master-over-subject” way.","zh":"（较少见）形容带有“主子压人/强行支配”意味的态度或行为。"},"examples":[{"en":"His baaskaaps behavior at work made colleagues uncomfortable.","zh":"他在工作中的“baaskaaps式”作风让同事不舒服。"}]}],"synonyms":["domination","supremacy","oppression","mastery","hegemony"],"phonetic":"/ˈbɑskɑps/","extraExplanation":["“Baaskaaps”常被视为“baaskap”（意为“主人的统治/主宰”）的变体拼写或复数形式；在现实语境中多出现在政治评论、历史讨论或反种族主义写作里。","这是高度文化与历史负载的词，使用时要注意语境：它通常用于批判支配、压迫与特权结构，而不是中性地表示“领导”或“管理”。","相关词/表达：domination（支配）, supremacy（至上主义）, apartheid（种族隔离）, master–servant relations（主仆关系）等。"]}
{"word":"baaskap","summary":{"en":"Baaskap means “white domination/boss rule,” a term tied to apartheid-era South Africa.","zh":"Baaskap 指“白人主宰/主子统治”，与南非种族隔离时期密切相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South African, historical/political) White domination or “boss rule,” especially the idea that white people should control political and social power under apartheid-era thinking.","zh":"（南非，历史/政治）“白人主宰/白人统治”（字面近似“老板统治”），尤指种族隔离时期主张白人应掌握政治与社会权力的观念。"},"examples":[{"en":"Many activists condemned baaskap as a justification for apartheid.","zh":"许多活动人士谴责“baaskap”是为种族隔离辩护的说法。"},{"en":"The speech was criticized for promoting baaskap and racial inequality.","zh":"这场演讲因宣扬“baaskap”和种族不平等而受到批评。"},{"en":"He studied how baaskap shaped laws and everyday life in South Africa.","zh":"他研究“baaskap”如何影响南非的法律与日常生活。"}]}],"synonyms":["white domination","white supremacy","racial domination","apartheid ideology"],"phonetic":"/ˈbɑːs.kɑːp/","extraExplanation":["“baaskap”源自南非荷兰语/南非语（Afrikaans）：baas（“老板/主子”）+ -kap（类似英语 -ship，表示“……状态/制度”），整体含义接近“主子地位/主宰权”。在英语语境中它多出现在关于南非种族隔离（apartheid）的历史与政治讨论里，通常带强烈负面评价色彩。","使用时要注意：这是高度敏感的政治历史词汇。若在写作中使用，建议明确其历史背景，并避免用来描述现实群体为“应然”的统治方式。"]}
{"word":"Baastan","summary":{"en":"“Baastan” is usually a Persian/Dari romanization meaning “ancient/antiquity,” often seen in titles or names rather than as a common English word.","zh":"“Baastan”多为波斯语/达里语的音译，意思接近“古代/上古（antiquity）”，在英文里常出现在书名或专名中，而不是常用英语词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(From Persian/Dari) ancient; relating to antiquity.","zh":"（源自波斯语/达里语）古代的；与上古、古文明有关的。"},"examples":[{"en":"The museum has a section on Iran-e Baastan (ancient Iran).","zh":"这家博物馆有一个“伊朗-巴斯坦（古代伊朗）”展区。"},{"en":"She studies Baastan architecture and pre-Islamic art.","zh":"她研究古代建筑以及伊斯兰之前的艺术。"}]},{"partOfSpeech":"n.","definition":{"en":"(From Persian/Dari) antiquity; the ancient past (often used in titles or names).","zh":"（源自波斯语/达里语）古代；上古时代（常见于书名、机构名或专名中）。"},"examples":[{"en":"His book focuses on Baastan and the rise of early empires.","zh":"他的书聚焦于古代以及早期帝国的兴起。"},{"en":"The lecture covered Baastan in Central Asia.","zh":"讲座讨论了中亚的古代历史。"}]},{"partOfSpeech":"other","definition":{"en":"A proper name/romanization used in some cultures; not a standard English dictionary word by itself.","zh":"一种在部分文化中使用的专名/音译写法；本身并非标准英语词条。"},"examples":[{"en":"Baastan is the brand name of their handmade rugs.","zh":"Baastan 是他们手工地毯的品牌名。"},{"en":"I met someone named Baastan at the conference.","zh":"我在会议上认识了一个叫 Baastan 的人。"}]}],"synonyms":["ancient","antiquity","the ancient past"],"phonetic":"/bɑːˈstɑːn/","extraExplanation":["“Baastan/ Bāstān（باستان）”在波斯语里常指“古代、上古、古文明”，在英文中多见于伊朗研究、历史、人文类文章的专名（如书名、展区名）或音译词。","如果你原本想查的是英文单词 **bastion**（堡垒/支柱）或 **Boston**（波士顿），告诉我语境/句子，我可以为你对比解释与发音。"]}

