{"word":"BAE","summary":{"en":"“BAE/bae” is common slang for a romantic partner or a sweet nickname; it’s also sometimes explained as “before anyone else.”","zh":"“BAE/bae”常见俚语，指恋人或甜蜜昵称；也有人把它解释为“before anyone else（在任何人之前）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a romantic partner (boyfriend/girlfriend), or a sweet nickname for someone you love","zh":"恋人（男/女朋友）；对喜欢的人用的甜蜜昵称"},"examples":[{"en":"I’m going out with my bae tonight.","zh":"我今晚要和我的恋人出去。"},{"en":"Happy birthday, bae!","zh":"生日快乐呀，宝贝！"},{"en":"Bae, can you call me when you get home?","zh":"宝贝，你到家后能给我打个电话吗？"}]},{"partOfSpeech":"other","definition":{"en":"an internet backronym for “before anyone else” (often said as an explanation of the slang word)","zh":"网络上的“反向缩写”解释：before anyone else（在任何人之前/最重要的人）"},"examples":[{"en":"Some people say bae stands for “before anyone else.”","zh":"有些人说 bae 代表“before anyone else（在任何人之前）”。"}]}],"synonyms":["babe","baby","sweetheart","boo","honey"],"phonetic":"/beɪ/","extraExplanation":["“bae”多用于口语和社交媒体，语气偏亲昵、俏皮；在正式写作或正式场合不太合适。","它常被认为源自英语中的“babe/baby（宝贝）”的简写或变体；“before anyone else”更多是后来流行的趣味解释，并非一定是原始来源。","大小写都能见到（BAE/bae），但更常见的是小写“bae”。"]}
{"word":"bae","summary":{"en":"“Bae” is informal slang for a romantic partner or a term of affection, and it can also mean someone is very attractive.","zh":"“bae”是非正式俚语，常指恋人/对象或亲昵称呼；也可用来夸人很有魅力、很好看。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, slang) A romantic partner; a term of affection meaning “baby” or “before anyone else.”","zh":"（非正式/俚语）爱人、对象；亲昵称呼，类似“宝贝”，也常被理解为“before anyone else（在任何人之前）”。"},"examples":[{"en":"Good morning, bae. Did you sleep well?","zh":"早安，bae（宝贝）。你睡得好吗？"},{"en":"I’m going out with my bae tonight.","zh":"我今晚要和我的对象出去。"},{"en":"That song is dedicated to my bae.","zh":"那首歌献给我的宝贝/恋人。"}]},{"partOfSpeech":"adj.","definition":{"en":"(internet slang) Used as a playful compliment meaning someone is very attractive.","zh":"（网络俚语）用来俏皮地夸人很有魅力/很好看。"},"examples":[{"en":"You’re looking like bae in that outfit.","zh":"你穿这套也太好看了吧。"},{"en":"He’s totally bae.","zh":"他真的很有魅力/很帅。"}]}],"synonyms":["babe","baby","sweetheart","honey","boo"],"phonetic":"/beɪ/","extraExplanation":["“bae”在2010年代的社交媒体与流行音乐中广泛流行。有人把它当作“before anyone else”的缩写，但在语言学上更常见的看法是：它是“babe/baby”的缩短形式，用作亲昵称呼。","语域提醒：它非常口语、偏年轻化；在正式写作、职场邮件或对不熟的人使用，可能显得不合适或过于暧昧。"]}
{"word":"Baecher","summary":{"en":"“Baecher” is usually a German-origin surname, sometimes an alternate spelling of “Bächer,” and it may connect to the German word for “cup.”","zh":"“Baecher”通常是德语背景的姓氏，有时是“Bächer”的替代拼写，并可能与德语中“杯子”一词有关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname), most often of German origin; sometimes used as an alternate spelling of the German surname “Bächer.”","zh":"（姓氏）常见于德语背景的姓；有时是德语姓“Bächer”的另一种拼写法。"},"examples":[{"en":"Dr. Baecher will present the research at the conference.","zh":"Baecher 博士将在会议上发表这项研究。"},{"en":"I found an article written by someone named Baecher.","zh":"我找到一篇作者姓 Baecher 的文章。"}]},{"partOfSpeech":"other","definition":{"en":"(Rare; from German) A spelling variant related to German “Becher,” meaning “cup” or “goblet,” seen mainly in names or older transliterations.","zh":"（少见；源自德语）与德语“Becher”（意为“杯子/高脚杯”）相关的拼写变体，多见于人名或较早的转写。"},"examples":[{"en":"The museum label lists the donor as “Baecher,” a name linked to the German word for “cup.”","zh":"博物馆标签上捐赠者写作“Baecher”，这个名字与德语里“杯子”的词有关。"}]}],"synonyms":["(surname) Bächer","(related German form) Becher"],"phonetic":"/ˈbɛkər/","extraExplanation":["“ae”常用来代替德语变音符号“ä”（例如把“Bächer”写成“Baecher”），尤其在不方便输入变音符号的场合（护照、旧式打字、早期电脑系统等）。","如果你是在论文、目录或族谱里看到 Baecher，它通常不是英语普通词汇，而是专有名词（人名/姓）。读音在英语里会因家庭或地区而不同；常见的英语读法可近似为“BEH-ker/BEK-er”。"]}
{"word":"BAEd","summary":{"en":"BAEd = Bachelor of Arts in Education (an education/teaching bachelor’s degree).","zh":"BAEd = Bachelor of Arts in Education（教育学文学学士，教育/师范方向本科学位）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Bachelor of Arts in Education,” an undergraduate degree focused on teaching and education (common in school names, résumés/CVs, and university programs).","zh":"“Bachelor of Arts in Education（教育学文学学士）”的缩写，指以教学与教育为核心的本科（常见于学校项目名称、简历等）。"},"examples":[{"en":"She earned a BAEd and now teaches English at a middle school.","zh":"她获得了 BAEd 学位，现在在一所中学教英语。"},{"en":"Minimum requirement: BAEd or an equivalent teaching degree.","zh":"最低要求：BAEd 或同等的师范/教育类学位。"}]}],"synonyms":["B.A.Ed.","Bachelor of Arts in Education","BEd","Bachelor of Education"],"phonetic":"/ˌbiː eɪ ˈiːd/","extraExplanation":["不同国家/地区的写法可能不一样：有的学校写 BAEd，有的写 B.A.Ed.；也常见 BEd（Bachelor of Education，教育学学士）。具体含义以学校官方项目名称为准。","在求职或学术文件中，首次出现时常写全称，后面再用缩写：Bachelor of Arts in Education (BAEd)。"]}
{"word":"Baeda","summary":{"en":"Baeda is a Latinized spelling of Bede, a famous English monk and historian.","zh":"Baeda 是 Bede（比德）的拉丁化拼写，指一位著名的英格兰修士与历史学家。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Latinized spelling of **Bede** (also called **the Venerable Bede**), an English monk and historian (673–735) famous for writing early history of England","zh":"**Bede（可敬的比德）**的拉丁化拼写之一；英格兰修士与历史学家（673–735），以记录早期英格兰历史的著作闻名"},"examples":[{"en":"In some older books, you may see the name written as **Baeda** instead of **Bede**.","zh":"在一些较旧的书里，你可能会看到名字写作 **Baeda**，而不是 **Bede**。"},{"en":"**Baeda** is best known for his work *Ecclesiastical History of the English People*.","zh":"**Baeda** 最著名的作品是《英吉利教会史》（*Ecclesiastical History of the English People*）。"}]}],"synonyms":["Bede","the Venerable Bede"],"phonetic":"/ˈbiːdə/","extraExplanation":["“Baeda”常见于拉丁文或学术写作的拼写体系中，用来指同一个历史人物“Bede”。中世纪文献里人名拼写不统一很常见。","Bede 的《英吉利教会史》是研究早期英格兰（尤其是基督教传播与各王国历史）的重要来源。"]}
{"word":"Baedeker","summary":{"en":"Baedeker means a travel guidebook, originally the famous Baedeker series and sometimes used as a general term for a guidebook.","zh":"Baedeker 指旅行指南书，原本特指著名的《贝德克旅游指南》系列，有时也泛指“旅游指南”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a travel guidebook, especially one giving practical details about places (hotels, routes, sights); originally a famous series of guidebooks.","zh":"旅行指南（书），尤其指提供酒店、路线、景点等实用信息的旅游手册；最初特指著名的《贝德克旅游指南》系列。"},"examples":[{"en":"Before the trip, she bought a Baedeker to plan which museums to visit.","zh":"出发前，她买了一本 Baedeker 来规划要参观哪些博物馆。"},{"en":"He traveled with a Baedeker in his bag and notes in the margins.","zh":"他旅行时包里带着一本 Baedeker，还在书页空白处做了笔记。"}]},{"partOfSpeech":"n.","definition":{"en":"a copy of the Baedeker guidebook series (often capitalized), published by the Baedeker company.","zh":"（常大写）指由贝德克出版社出版的《贝德克旅游指南》系列中的一本。"},"examples":[{"en":"The library has an 1890 Baedeker for Italy in the rare-books room.","zh":"图书馆的珍本室里有一本 1890 年的《意大利 Baedeker 指南》。"}]}],"synonyms":["guidebook","travel guide","tourist guide","handbook"],"phonetic":"/ˈbeɪdəkər/","extraExplanation":["“Baedeker”源自德国出版商 Karl Baedeker（卡尔·贝德克）。19世纪到20世纪初，这套指南以信息细致、评价标准化而出名，因此在英语里一度被当作“权威旅行指南”的代称。","在较老的文学作品或历史语境中，你可能会看到“a Baedeker”泛指任何旅行指南；现代英语里更常用 general terms like “guidebook” 或具体品牌（如 Lonely Planet、Rough Guides）。"]}
{"word":"baedeker","summary":{"en":"A Baedeker is a travel guidebook, especially the classic ones originally published by Karl Baedeker; it can also mean any detailed guidebook for travelers.","zh":"Baedeker 指旅行指南，尤其是最初由卡尔·贝德克尔出版的经典指南；也可泛指详尽的旅游攻略书。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a travel guidebook (originally one published by the German publisher Karl Baedeker); by extension, any detailed guidebook for travelers","zh":"旅行指南（原指德国出版商卡尔·贝德克尔出版的《贝德克尔旅行指南》；也可泛指详尽的旅行指南）"},"examples":[{"en":"She bought a Baedeker before her first trip to Italy.","zh":"她第一次去意大利旅行前买了一本《贝德克尔旅行指南》。"},{"en":"In the early 1900s, many tourists relied on a Baedeker to plan routes and hotels.","zh":"在20世纪初，许多游客依靠《贝德克尔旅行指南》来规划路线和选择旅馆。"},{"en":"He treated the city like a Baedeker, listing museums, cafés, and walking tours in order.","zh":"他把这座城市当作一本旅行指南一样，有条理地列出博物馆、咖啡馆和步行路线。"}]}],"synonyms":["guidebook","travel guide","handbook (for travelers)","tourist guide"],"phonetic":"/ˈbeɪdəkɚ/","extraExplanation":["“Baedeker”来自19世纪德国出版商 Karl Baedeker 的姓氏。他的红皮旅行指南以信息详尽、可靠著称，因此在英语里逐渐被用来泛指“旅行指南”。在文学作品中也常用来表现人物旅行时的“按图索骥”或带点老派、经典的旅行方式。"]}
{"word":"Baedekerian","summary":{"en":"Baedekerian describes something written or organized like a classic Baedeker travel guide: detailed, systematic, and practical for sightseeing.","zh":"Baedekerian 指“像经典贝德克旅行指南那样”的风格：细致、系统、偏重实用观光信息。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to, characteristic of, or resembling a Baedeker travel guide—especially in being very detailed, systematic, and focused on practical sightseeing information.","zh":"与《贝德克旅行指南》（Baedeker）有关的；具有其特点的——尤指细致、系统、偏重实用观光信息的（写法/风格）。"},"examples":[{"en":"The article gives a Baedekerian description of the old town, listing hotels, prices, and walking routes.","zh":"这篇文章用“贝德克式”的笔法描写老城区，列出旅馆、价格和步行路线。"},{"en":"Her Baedekerian notes covered every museum’s hours and the best time to visit.","zh":"她的“贝德克式”笔记把每家博物馆的开放时间和最佳参观时段都写全了。"}]}],"synonyms":["guidebook-like","touristic","travel-guide","catalog-like","methodical"],"phonetic":"/ˌbaɪˌdɛkɪˈrɪən/","extraExplanation":["“Baedekerian”来自19世纪德国出版商 Karl Baedeker 的旅行指南系列（常见为红封皮），以信息密集、路线清晰、细节周到著称。英语里用这个词，常带一点文学或评论口吻，表示一种“像旅行手册那样”冷静、条理化、实用主义的描写方式。","在写作/评论中，它有时隐含对“过于清单化、缺少情感或想象”的轻微调侃，但也可以是中性或褒义，强调可靠与全面。"]}
{"word":"baedekerian","summary":{"en":"Baedekerian describes travel or planning that follows a classic guidebook style—organized, standard, and focused on famous sights.","zh":"Baedekerian 指“像经典旅行指南那样”的旅行/安排：有条理、标准化、以知名景点为主。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to, characteristic of, or resembling a Baedeker travel guide—especially travel that is carefully planned, guidebook-led, and focused on standard “must-see” sights.","zh":"与《贝德克旅行指南》（Baedeker）有关的；（旅行方式）像按经典旅行指南行程那样的，按部就班打卡“必去景点”的。"},"examples":[{"en":"Their Baedekerian itinerary left almost no time for wandering or surprises.","zh":"他们那种“按旅行指南走”的行程几乎不给随意逛逛或惊喜留时间。"},{"en":"The tour felt Baedekerian: efficient, informative, and a little predictable.","zh":"这趟团游很“指南式”：高效、信息量大，但也有点可预料。"},{"en":"She avoided Baedekerian tourism and chose small neighborhoods instead.","zh":"她不想走那种“照攻略打卡”的旅游方式，而是去逛小街区。"}]}],"synonyms":["guidebook-style","by-the-book","touristy","formulaic"],"phonetic":"/ˌbeɪ.dəˈkɪr.i.ən/","extraExplanation":["“Baedeker”原是19世纪德国出版商Karl Baedeker编写的旅行指南系列，以详细、权威、路线清晰闻名。英语里把某种旅行风格形容为“Baedekerian”，常带一点文学式的语气：既可中性表示“很有条理”，也可略带讽刺，暗示“太按攻略、缺少即兴与个人发现”。","这个词多见于评论、随笔或旅行写作中，日常口语更常说“guidebook-style”或“by-the-book travel”。"]}
{"word":"baedekers","summary":{"en":"“Baedekers” means travel guidebooks, especially the famous Baedeker guides, and can also refer generally to detailed travel guides.","zh":"“Baedekers”指旅行指南书，尤指著名的《贝德克尔旅行指南》，也可泛指详尽的旅游指南。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"travel guidebooks, especially the classic guidebooks published by the German firm Baedeker (often used to mean any detailed tourist guide)","zh":"旅行指南书，尤指德国“贝德克尔（Baedeker）”公司出版的经典旅行指南（也常泛指任何内容详尽的旅游指南）"},"examples":[{"en":"Before the trip, she studied a stack of Baedekers and marked the museums she wanted to see.","zh":"出发前，她翻看了一摞《贝德克尔旅行指南》，并标出了想去的博物馆。"},{"en":"In old novels, travelers often carry Baedekers along with a map and a notebook.","zh":"在一些老小说里，旅行者常常带着《贝德克尔旅行指南》，再加上一张地图和一本笔记本。"}]}],"synonyms":["travel guides","guidebooks","tourist guides"],"phonetic":"/ˈbeɪdəkɚz/","extraExplanation":["“Baedeker”原本是德国出版商卡尔·贝德克尔（Karl Baedeker）的姓氏。他的旅行指南在19世纪到20世纪初非常权威，常见特征是红色封面、信息详尽（路线、住宿、景点评价等）。因此在英语里，Baedeker/ Baedekers 有时被当作普通名词使用，泛指“旅行指南”。","在文学语境中，提到 Baedekers 往往带有“旧式旅行/欧洲大旅行（Grand Tour）”的时代氛围，暗示旅行者讲究规划、按指南游览。"]}
{"word":"Baek","summary":{"en":"“Baek” most commonly refers to a Korean surname; it can also mean “one hundred” in Korean (백).","zh":"“Baek”最常见指韩国姓氏；它也可表示韩语里的“一百”（백）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Korean family name (surname), often also spelled Paik or Baik (백).","zh":"韩国姓氏“Baek”（常见也拼作 Paik / Baik，对应韩文“백”）。"},"examples":[{"en":"Her last name is Baek, so in Korea people may call her “Baek 씨 (Mr./Ms. Baek).”","zh":"她姓 Baek，所以在韩国人们可能会称呼她“Baek 씨（某某先生/女士）”。"},{"en":"The actor’s name is Baek, written as 백 in Korean.","zh":"这位演员的姓是 Baek，韩文写作“백”。"}]},{"partOfSpeech":"n.","definition":{"en":"the Korean word for “one hundred” (백), usually seen in romanization as baek.","zh":"韩语里“100 / 一百”的说法（백），罗马字常写作 baek。"},"examples":[{"en":"In Korean, 100 won can be written as “백 원 (baek won).”","zh":"在韩语里，100韩元可以写作“백 원（baek won）”。"},{"en":"The number 300 is “삼백 (sam-baek)” in Korean.","zh":"数字300在韩语里是“三百（삼백，sam-baek）”。"}]},{"partOfSpeech":"n.","definition":{"en":"a Korean given name element (part of a first name), used in some names.","zh":"可作为韩语名字中的一部分（名的音节/元素）。"},"examples":[{"en":"Baek can appear in a Korean first name, depending on the person’s chosen hanja and spelling.","zh":"Baek 可能出现在韩国人的名字里，具体含义会因所选汉字与拼写而不同。"}]}],"synonyms":["Paik","Baik","백"],"phonetic":"/bɛk/","extraExplanation":["“Baek”通常来自韩语罗马字转写（romanization）。在更早或不同系统里，你也可能看到同一个姓写成“Paik / Baik”，并不是不同的家族，很多时候只是转写习惯不同。","在韩语连读或构词时，“백(baek)”可能与后面的音节发生轻微发音变化（比如与某些辅音相邻时听起来不那么像清晰的/k/），但常见拼写仍是 baek。"]}
{"word":"Baekeland","summary":{"en":"Baekeland is most commonly the name of the chemist Leo Baekeland, famous for inventing Bakelite.","zh":"Baekeland最常指化学家利奥·贝克兰德，以发明电木（Bakelite）而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Leo Hendrik Baekeland (1863–1944), a Belgian-American chemist best known for inventing Bakelite, one of the first widely used synthetic plastics.","zh":"利奥·亨德里克·贝克兰德（1863–1944），比利时裔美国化学家，以发明电木（Bakelite）——最早广泛使用的合成塑料之一——而闻名。"},"examples":[{"en":"Baekeland’s invention of Bakelite helped launch the modern plastics industry.","zh":"贝克兰德发明电木，推动了现代塑料工业的发展。"},{"en":"In many science museums, you can find exhibits about Baekeland and early plastics.","zh":"在许多科学博物馆里，你都能看到关于贝克兰德与早期塑料的展品。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname; used to refer to the Baekeland family name, especially in historical or scientific contexts.","zh":"姓氏；常用于历史或科学语境中指“贝克兰德”这个家族姓。"},"examples":[{"en":"The name Baekeland appears often in the history of chemistry.","zh":"在化学史中，“Baekeland（贝克兰德）”这个名字经常出现。"}]}],"synonyms":["Leo Baekeland"],"phonetic":"/ˈbeɪk.lənd/","extraExplanation":["“Baekeland”常与“Bakelite（电木）”一起出现。电木是一种热固性塑料，早期常用于电话外壳、收音机机壳、电器绝缘部件等，因此在工业设计与材料史上很有代表性。","读音提示：英语中常把重音放在第一个音节（BAKE-）。"]}
{"word":"Bael","summary":{"en":"Bael is a South Asian tree and its hard-shelled fruit, used in foods and traditional remedies.","zh":"Bael 指一种南亚树木及其硬壳果实，常用于食品与传统疗法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tropical tree native to South Asia (Aegle marmelos), whose hard-shelled fruit is used in food and traditional medicine.","zh":"一种原产南亚的热带树（木橘／贝尔果树，Aegle marmelos），其硬壳果实常用于食物与传统疗法。"},"examples":[{"en":"Bael trees are common in parts of India and Sri Lanka.","zh":"在印度和斯里兰卡的一些地区，贝尔果树很常见。"},{"en":"In some traditions, people make herbal drinks from bael fruit.","zh":"在一些传统中，人们会用贝尔果做草本饮品。"}]},{"partOfSpeech":"n.","definition":{"en":"The hard-shelled fruit of the bael tree, sometimes used to make drinks, jams, or desserts.","zh":"贝尔果树结的硬壳果实（贝尔果／木橘），可用来做饮料、果酱或甜点。"},"examples":[{"en":"She bought dried bael to brew a mild tea.","zh":"她买了干贝尔果来泡一杯温和的茶。"},{"en":"Bael sherbet is a popular summer drink in some regions.","zh":"在一些地区，贝尔果饮（sherbet）是很受欢迎的夏日饮品。"}]}],"synonyms":["Bengal quince","Aegle marmelos"],"phonetic":"/beɪl/","extraExplanation":["“bael”也常被称为“Bengal quince”（孟加拉榅桲）或“wood apple”（木苹果），但不同地区对“wood apple”的指代有时会混用，购买时可看学名 Aegle marmelos 以确认。","在印度文化中，贝尔叶与湿婆神（Shiva）的崇拜相关，常见于寺庙供奉场景；同时在阿育吠陀（Ayurveda）等传统体系里，贝尔果也常被提及。"]}
{"word":"bael","summary":{"en":"Bael is a South Asian tropical tree (Aegle marmelos) and its hard-shelled fruit, commonly used in foods, drinks, and traditional culture.","zh":"Bael 指一种南亚热带树（木橘/贝尔果树，Aegle marmelos）及其坚硬外壳的果实，常用于食物饮品与传统文化场景。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tropical tree native to South Asia (Aegle marmelos), whose fruit and leaves are used in food and traditional medicine.","zh":"一种原产南亚的热带树（木橘/贝尔果树，Aegle marmelos），其果实与叶子常用于食物和传统疗法。"},"examples":[{"en":"Bael trees grow well in hot, dry climates.","zh":"贝尔果树在炎热、干燥的气候里长得很好。"},{"en":"In some regions, bael leaves are offered in religious ceremonies.","zh":"在一些地区，人们会在宗教仪式中供奉贝尔叶。"}]},{"partOfSpeech":"n.","definition":{"en":"The hard-shelled fruit of the bael tree, used for drinks, desserts, and preserves.","zh":"贝尔果树的果实（外壳坚硬），常用来做饮品、甜点或果酱/蜜饯。"},"examples":[{"en":"She made a refreshing bael drink with water and a little sugar.","zh":"她用水和一点糖做了一杯清爽的贝尔果饮。"},{"en":"Ripe bael has a sweet, aromatic smell.","zh":"成熟的贝尔果闻起来香甜浓郁。"}]}],"synonyms":["Bengal quince","stone apple"],"phonetic":"/beɪl/","extraExplanation":["“bael”常见于南亚语境（尤其是印度、斯里兰卡、孟加拉等）。在英语里它多指Aegle marmelos这棵树或其果实。","在印度文化中，贝尔叶（bael leaves）常与湿婆神（Shiva）的敬拜相关；在传统医学（如阿育吠陀）里，贝尔果也常被用于描述助消化、缓解腹泻等用途（具体功效与用法应以医学建议为准）。","常见近似名包括“Bengal quince”和“stone apple”。有时会与“wood apple”混淆，但“wood apple”在植物学上可能指另一种不同的果树。"]}
{"word":"Baelbeer","summary":{"en":"Baelbeer means the bael fruit (bael berry), a South Asian fruit often used in drinks and teas.","zh":"Baelbeer 指木橘果（bael fruit/bael berry），一种常用于饮品或茶的南亚水果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fruit (or the plant’s fruit) from the bael tree, used in South and Southeast Asia; often written as “bael berry” and sometimes used to mean bael fruit in general.","zh":"（印度木橘树的）木橘果；常写作“bael berry”，有时泛指木橘这种果实（多见于南亚与东南亚地区）。"},"examples":[{"en":"In some markets, baelbeer is sold dried for tea.","zh":"在一些市场里，木橘果（baelbeer）会以干果形式出售，用来泡茶。"},{"en":"The drink was flavored with baelbeer pulp and a little honey.","zh":"这杯饮料用木橘果肉调味，并加了一点蜂蜜。"}]}],"synonyms":["bael","bael fruit","bael berry","Bengal quince","stone apple"],"phonetic":"/ˈbeɪəlˌbɛri/","extraExplanation":["“Baelbeer”不是最常见的标准拼写，更常见的是“bael fruit / bael berry / bael (fruit)”。如果你是在标签、网店或地方性用法里看到“Baelbeer”，通常指的就是印度木橘（Aegle marmelos）的果实。","木橘在印度与周边地区常用于饮品、甜点或草本调理（例如木橘饮/木橘茶）。在英语语境里，它也可能被称为“Bengal quince”或“stone apple”。"]}
{"word":"Baer","summary":{"en":"Baer is most commonly a surname, often linked to German roots; it can be mistaken for “bear” or “bare.”","zh":"Baer 最常见是姓氏，常与德语渊源有关；也容易被误看成 “bear” 或 “bare”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname), often of German or Jewish (Ashkenazi) origin.","zh":"一个姓氏（家族姓），常见于德语区或犹太（阿什肯纳兹）背景。"},"examples":[{"en":"Lauren Baer spoke at the community meeting.","zh":"劳伦·贝尔在社区会议上发言。"},{"en":"My professor’s last name is Baer.","zh":"我教授的姓是 Baer。"}]},{"partOfSpeech":"other","definition":{"en":"A spelling that may be confused with “bear” (the animal) or “bare” (without covering).","zh":"一种拼写上容易与 “bear”（熊/忍受）或 “bare”（赤裸的/无覆盖的）混淆的形式。"},"examples":[{"en":"Did you mean Baer (a surname) or bear (the animal)?","zh":"你指的是 Baer（姓氏）还是 bear（动物熊）？"},{"en":"The words “Baer,” “bear,” and “bare” can sound similar in English.","zh":"在英语里，“Baer”“bear”“bare”的读音可能很像。"}]}],"phonetic":"/bɛr/","extraExplanation":["“Baer”常被视为德语姓氏的转写形式，和德语 Bär（意思是“熊”）有关；因此在英语环境里，它的读音经常与“bear”相同或非常接近。","如果你是在句子里看到“Baer”，通常是人名或地名；而“bear/bare”则是常用词（动物/忍受 vs. 赤裸/露出），需要根据上下文判断。"]}
{"word":"baer","summary":{"en":"“Baer” is most commonly a surname; in learner writing it’s often a misspelling of “bear.”","zh":"“Baer”最常见是姓氏；在学习者写作中也常是“bear”的误拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), often of German or Jewish (Ashkenazi) origin.","zh":"姓氏（常见于德语或犹太〔阿什肯纳兹〕背景的人名）。"},"examples":[{"en":"Dr. Baer will speak at the conference tomorrow.","zh":"贝尔博士明天将在会议上发言。"},{"en":"I saw Baer listed as the author of this article.","zh":"我看到这篇文章的作者署名是 Baer。"}]},{"partOfSpeech":"other","definition":{"en":"a spelling sometimes used by mistake for “bear” (the animal) or “bear” (to carry/endure).","zh":"有时是对“bear”（熊；携带/忍受）的误拼写。"},"examples":[{"en":"If you mean the animal, the correct spelling is “bear,” not “baer.”","zh":"如果你指的是动物，正确拼写是“bear”，不是“baer”。"},{"en":"“I can’t baer it” should be “I can’t bear it.”","zh":"“I can’t baer it” 应该写成 “I can’t bear it”。"}]}],"synonyms":["bear"],"phonetic":"/bɛr/","extraExplanation":["“Baer”常见于姓名（如演员/作者的姓）。在英语学习中，很多人会把“bear /bɛr/”误写成“baer”，因为元音组合看起来像德语/荷兰语的拼写习惯。","如果你告诉我你的句子语境（比如是人名、动物、还是“忍受/承担”），我可以帮你确认到底应该用“Baer”还是“bear”。"]}
{"word":"Baeria","summary":{"en":"Baeria is a botanical genus (Asteraceae) of small wildflowers, mainly from western North America.","zh":"Baeria 是一个植物属名（菊科），指主要分布于北美西部的一类小型野花。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small flowering plants in the sunflower family (Asteraceae), native mainly to western North America; some species have yellow, daisy-like flowers.","zh":"（植物）贝瑞菊属：菊科（Asteraceae）的一类小型开花植物属，主要原产于北美西部；部分种类开黄色、类似雏菊的花。"},"examples":[{"en":"Baeria is a genus in the sunflower family (Asteraceae).","zh":"Baeria 是菊科（Asteraceae）中的一个植物属。"},{"en":"In spring, some Baeria species produce small yellow, daisy-like blooms.","zh":"在春季，一些 Baeria 物种会开出小巧的黄色、雏菊状花朵。"},{"en":"The field guide lists Baeria among common wildflowers of western North America.","zh":"这本野外图鉴把 Baeria 列为北美西部常见的野花之一。"}]}],"synonyms":["(no common synonym; a scientific genus name)"],"phonetic":"/ˈbɪriə/","extraExplanation":["Baeria 通常作为拉丁学名使用，所以首字母大写；单复数在英文里常见写法是“Baeria (genus)”来指代该属，“Baeria species”指该属的不同物种。","日常英语里它不算常用词，更常见于植物学、自然观察、野花图鉴等语境。"]}
{"word":"baeria","summary":{"en":"Baeria is a botanical genus name for certain wildflowers in the sunflower family, especially in western North America.","zh":"Baeria 是一个植物属名，指菊科的一些野花，主要见于北美西部。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small flowering plants in the sunflower family (Asteraceae), found mainly in western North America; some species are called “goldfields.”","zh":"（植物）贝里亚属：菊科（向日葵科）的一属小型开花植物，主要分布于北美西部；其中一些物种俗称“金色花田”（goldfields）。"},"examples":[{"en":"Baeria species often bloom in spring across parts of California.","zh":"贝里亚属的一些物种常在春季于加州部分地区开花。"},{"en":"The survey recorded Baeria among other native wildflowers in the grassland.","zh":"调查在草地上记录到贝里亚属植物以及其他本地野花。"}]}],"synonyms":["goldfields (common name for some species)"],"phonetic":"/ˈbɛriə/","extraExplanation":["“Baeria”是植物学拉丁学名（属名），在一般英语日常对话中不常见，更多出现在植物图鉴、生态调查、园艺或自然观察的语境中。","英语里属名通常首字母大写并用斜体书写（*Baeria*）；复数讨论多个物种时，常说“Baeria species”（贝里亚属的物种）。"]}
{"word":"Baerl","summary":{"en":"“Baerl” is not a common English word; it is usually a misspelling of “barrel,” or a name/surname in some contexts.","zh":"“Baerl”不是常见英语词；通常是“barrel”的拼写错误，或在某些场合用作姓名/姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling of “barrel.”","zh":"不是标准英语单词；最常见情况是把“barrel（桶；一桶的量）”拼错了。"},"examples":[{"en":"Did you mean “barrel”? (Example: a barrel of oil)","zh":"你是不是想写“barrel”？（例：a barrel of oil 一桶石油）"},{"en":"He rolled the barrel into the storage room.","zh":"他把桶滚进了储藏室。"}]},{"partOfSpeech":"other","definition":{"en":"A surname or name spelling found in some contexts (often influenced by German spelling), but not a common English vocabulary word.","zh":"在一些语境中可见的姓氏/名字拼写（常受德语拼写影响），但不是常见英语词汇。"},"examples":[{"en":"Ms. Baerl will lead today’s meeting.","zh":"Baerl 女士将主持今天的会议。"}]}],"synonyms":["barrel"],"phonetic":"/ˈbærəl/","extraExplanation":["“ae”在一些姓名/外来词拼写里常用来代替德语的“ä”（变音符号）。因此 Baerl 可能与德语姓名或拼写习惯有关。","如果你想表达“桶/一桶的量”，标准拼写是 barrel；美式发音 /ˈbærəl/。"]}
{"word":"Baerman","summary":{"en":"“Baerman” is mainly used as a surname (a last name).","zh":"“Baerman”主要用作姓氏（人名的姓）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname). It is not a common everyday English vocabulary word; it’s usually used as a person’s last name.","zh":"姓氏（家族姓）。它不是常见的日常英语词汇，通常用作人的姓。"},"examples":[{"en":"Professor Baerman will give a lecture tomorrow.","zh":"Baerman 教授明天会做讲座。"},{"en":"I found an article by Baerman and his colleagues.","zh":"我找到了一篇由 Baerman 和他的同事撰写的文章。"}]}],"phonetic":"ˈbɛrmən","extraExplanation":["“Baerman”多见于人名拼写，可能与德语/意第绪语系姓氏变体有关（如 Baermann、Bärmann、Berman 等）。在英语语境里通常不翻译其“字面意思”，而是按姓名使用。","注意不要和普通名词“barman”（酒吧男招待/调酒师）混淆：barman 是常用词，而 Baerman 通常是专有名词（姓氏）。"]}
{"word":"Baese","summary":{"en":"“Base” most often means a foundation or the main supporting part; it can also mean a main operating place, or the verb “to base (on).”","zh":"“Base”最常指“基础/底座”，也可指“基地/据点”，动词常用作“以……为依据/建立在……之上”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the bottom or supporting part of something; the foundation","zh":"底部；支撑部分；基础"},"examples":[{"en":"The statue stands on a stone base.","zh":"这座雕像立在石头底座上。"},{"en":"Trust is the base of a good relationship.","zh":"信任是良好关系的基础。"}]},{"partOfSpeech":"n.","definition":{"en":"the main place where a person or organization works or operates","zh":"（组织/人员的）基地；据点；总部"},"examples":[{"en":"The research team is based in Boston.","zh":"这个研究团队的基地在波士顿。"},{"en":"The hikers returned to base before dark.","zh":"徒步者在天黑前回到了大本营。"}]},{"partOfSpeech":"vt.","definition":{"en":"to use something as the main reason or starting point for decisions or actions","zh":"以……为根据；把……建立在……之上"},"examples":[{"en":"We based our plan on the latest data.","zh":"我们根据最新数据制定了计划。"},{"en":"The movie is based on a true story.","zh":"这部电影改编自真实故事。"}]},{"partOfSpeech":"vi.","definition":{"en":"to have your main place of work or activity in a particular location","zh":"以某地为总部/驻地；主要在某地开展活动"},"examples":[{"en":"She is based in New York but travels often.","zh":"她以纽约为工作基地，但经常出差。"}]},{"partOfSpeech":"adj.","definition":{"en":"not having good manners; not moral (less common, can sound strong or insulting)","zh":"粗俗的；卑鄙的（较少用，语气可能很重）"},"examples":[{"en":"That was a base remark.","zh":"那句话很粗俗/卑劣。"}]}],"synonyms":["foundation","basis","footing","groundwork","headquarters","camp","build on","derive from"],"phonetic":"/beɪs/","extraExplanation":["“Baese”不是常见英文单词，最可能是把“base”拼错了（多了一个e）。如果你想查的是人名/姓氏“Baese”，也可能存在，但不属于常用词汇；可以告诉我你看到它的句子或来源，我再帮你确认意思。"]}
{"word":"baeth","summary":{"en":"“baeth” is not standard; it’s usually a misspelling of “bath.”","zh":"“baeth”不是标准拼写；通常是把“bath（洗澡/浴缸）”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling of “bath.”","zh":"不是标准英语单词；最常见是把“bath（洗澡；浴缸）”拼错了。"},"examples":[{"en":"I think you meant “bath”: I’m going to take a bath.","zh":"我猜你想写“bath”：我要去洗个澡。"},{"en":"This spelling (“baeth”) isn’t used in standard English.","zh":"这种拼法（“baeth”）在标准英语里不使用。"}]},{"partOfSpeech":"n.","definition":{"en":"If you meant “bath”: a time when you wash your body in a tub or shower; also the tub itself.","zh":"如果你想写“bath”：洗澡（的过程/时间）；也可指浴缸。"},"examples":[{"en":"The kids take a bath every night.","zh":"孩子们每晚都洗澡。"},{"en":"The hotel room has a bath and a separate shower.","zh":"酒店房间里有浴缸，还有一个独立淋浴间。"},{"en":"A warm bath helps me relax.","zh":"泡个热水澡能让我放松。"}]},{"partOfSpeech":"vt.","definition":{"en":"If you meant “bath”: to wash someone or something (often a baby, pet, or wound).","zh":"如果你想写“bath”：给（人/动物）洗澡；清洗（伤口等）。"},"examples":[{"en":"She bathed the baby carefully.","zh":"她小心地给宝宝洗澡。"},{"en":"The nurse bathed the wound with clean water.","zh":"护士用干净的水清洗伤口。"}]}],"synonyms":["bathe","wash","soak"],"phonetic":"/bæθ/","extraExplanation":["“baeth”本身不常见；如果你是在读苏格兰英语/方言材料，可能你看到的是“baith”（意思是“both/两者都”）。如果你告诉我你看到“baeth”的句子或语境，我可以更准确判断你想查的是哪一个词。"]}
{"word":"baethan","summary":{"en":"“baethan” is an archaic/Old English form meaning “to bathe; to wash/cleanse,” sometimes “to soak/immerse.”","zh":"“baethan”多为古英语/古用法的写法，意为“洗澡；清洗/洁净”，有时也指“浸泡/浸入”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Archaic/Old English) to bathe; to wash or cleanse (someone or something), often in water.","zh":"（古英语/古用法）沐浴；清洗、洁净（某人或某物），常指用水清洗。"},"examples":[{"en":"In Old English texts, “bæþan” meant “to bathe” or “to wash.”","zh":"在古英语文本中，“bæþan”表示“洗澡”或“清洗”。"},{"en":"She warmed water to baethan the child before sleep. (archaic-style)","zh":"她把水加热，好在睡前给孩子沐浴。（仿古用法）"}]},{"partOfSpeech":"vt.","definition":{"en":"(Archaic/Old English) to soak or immerse (something) in water; to wet thoroughly.","zh":"（古英语/古用法）浸泡；使（某物）浸入水中或彻底弄湿。"},"examples":[{"en":"They baethan linen in the stream to soften it. (archaic-style)","zh":"他们把亚麻布在溪水里浸泡使其变软。（仿古用法）"}]}],"synonyms":["bathe","wash","cleanse","rinse","soak","immerse"],"phonetic":"/ˈbeɪθən/","extraExplanation":["“baethan”更常见的是把古英语动词写成现代字母的转写形式，对应古英语“bæþan”。其中字母“þ”(thorn) 发 /θ/（像 thin 里的 th），后来常被写成 “th”。因此你看到的 “baethan” 基本等同于现代英语 bathe /beɪð/（但古英语含义更偏“洗/浸洗”的动作）。","它不是现代英语里常用的标准拼写；如果你是在小说、历史资料、游戏/奇幻设定或古英语学习材料里见到的，多半是在营造中古/古英语氛围。"]}
{"word":"Baetis","summary":{"en":"Baetis is a scientific name for a genus of mayflies, especially mentioned in stream ecology and fly-fishing.","zh":"Baetis 是蜉蝣属的学名，常见于溪流生态与飞钓相关语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small mayflies (insects) whose aquatic nymphs live in streams and rivers; often used in fly-fishing and aquatic ecology contexts.","zh":"一种蜉蝣属（昆虫）的小型蜉蝣；其水生若虫生活在溪流与河流中，常见于飞钓用假蝇与水生生态研究语境。"},"examples":[{"en":"Baetis nymphs are common in clean, fast-moving streams.","zh":"在干净、流速快的溪流里，Baetis（蜉蝣属）的若虫很常见。"},{"en":"The angler tied a Baetis imitation for the afternoon hatch.","zh":"钓手绑了一只模仿 Baetis 的假蝇来应对下午的羽化高峰。"}]}],"synonyms":["mayfly (general)","Blue-winged Olive (BWO, common name in fly-fishing contexts)"],"phonetic":"/ˈbiːtɪs/","extraExplanation":["“Baetis”来自拉丁化的学名写法，日常英语里通常在生物学、昆虫学、环境监测与飞钓圈子里出现。它不是常用口语词。","在飞钓语境中，Baetis 常与“Blue-winged Olive (BWO)”一起出现；BWO是常见俗名/称呼之一，但不同地区可能指向不同的物种或近似类群。"]}
{"word":"baetuli","summary":{"en":"“Baetuli” means sacred stones (plural), worshiped as divine dwellings in ancient religions.","zh":"“baetuli”指（复数）古代宗教中被崇拜、被视为神灵居所的圣石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"sacred stones (plural), especially stones worshiped or treated as the dwelling place of a god in ancient Mediterranean and Near Eastern religions; “baetuli” is a learned/Latin-style plural of “baetyl(us).”","zh":"（复数）圣石；尤指在古代地中海与近东宗教中被崇拜、被视为神灵居所的石头；“baetuli”是较学术/拉丁式的复数形式，对应“baetyl(us)”（圣石）。"},"examples":[{"en":"Some ancient writers described baetuli as stones that were honored in temples and carried in rituals.","zh":"一些古代作者记载，baetuli 会在神庙中受敬奉，并在仪式中被抬着游行。"},{"en":"The museum label compared the carved idol to baetuli—sacred stones believed to hold divine power.","zh":"博物馆说明牌把这尊雕刻偶像与 baetuli 作比较——即被认为蕴含神力的圣石。"}]}],"synonyms":["baetyls","baetylus (pl.)","sacred stones","cult stones"],"phonetic":"/baɪˈtuːlaɪ/","extraExplanation":["“baetyl/baetylus（圣石）”一词常被认为与闪米特语族的 *bethel*（可理解为“神的居所/神之家”）有关，因此在宗教语境里常指“神灵降临或栖居之物”。","在一些古代叙述中，圣石可能是自然形成的石块、陨石，或经过简单打磨的柱状石；它们不一定有人形雕刻，却仍被视为神圣。","你输入的 “baetuli” 更像是学术写法或拉丁式复数；在更常见的现代英语里，你也会看到复数写作 “baetyls”。"]}
{"word":"baetulus","summary":{"en":"Baetulus is a rare form of baetylus: a sacred stone (often a meteorite) worshiped in ancient religions.","zh":"Baetulus 是较少见的拼写形式（同 baetylus），指古代宗教中被崇拜的圣石，常为陨石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sacred stone (often a meteorite) worshiped or treated as a dwelling-place of a god in some ancient Mediterranean and Near Eastern religions","zh":"（古代地中海与近东宗教中的）圣石；常指被崇拜的陨石，被认为是神灵居所的石头"},"examples":[{"en":"Ancient writers describe a baetylus as a “living” stone that people believed could speak or give omens.","zh":"古代作者把 baetylus 描写成“有生命”的石头，人们相信它能说话或预示吉凶。"},{"en":"The temple kept a baetylus as a focus for worship, much like an icon in later traditions.","zh":"神庙保存一块 baetylus 作为崇拜的中心，有点像后世传统中的圣像。"}]}],"synonyms":["baetylus","betyl","sacred stone","idol stone"],"phonetic":"/ˈbiːtɪləs/","extraExplanation":["“baetulus”多被视为 baetylus / betyl 的变体拼写（英语里更常见 baetylus 或 betyl）。词源常追溯到闪米特语系与“Bethel（神的居所）”相关的词根，因此含有“神居住的石头”的文化含义。","文学与历史语境里，它常出现在关于腓尼基、叙利亚、希腊-罗马宗教的描述中，用来指一种被供奉的“天降之石”（陨石）或神圣石块。"]}
{"word":"baetyl","summary":{"en":"A baetyl is a sacred stone—sometimes believed to be a meteorite—revered in ancient worship as a sign of divine presence.","zh":"baetyl 指一种古代崇拜中的圣石（有时被认为是陨石），被视为神明临在的象征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sacred stone (often thought to be a meteorite) that people in some ancient cultures believed was inhabited by a god or had divine power; a “holy stone” used in worship","zh":"（常被认为是陨石的）圣石；一些古代文化中被视为“神灵居住”或具有神力、用于崇拜的石头"},"examples":[{"en":"Archaeologists found references to a baetyl worshiped in a temple near the coast.","zh":"考古学家发现文献提到一块在海岸附近神庙中受人崇拜的圣石（baetyl）。"},{"en":"In ancient Mediterranean religions, a baetyl could serve as a physical symbol of a deity’s presence.","zh":"在古代地中海宗教中，圣石（baetyl）可能被用作神明临在的实体象征。"}]}],"synonyms":["sacred stone","holy stone","bethel stone"],"phonetic":"/ˈbeɪtəl/","extraExplanation":["这个词多用于考古学、宗教学、古典学语境，日常英语里很少见。","词源通常追溯到闪米特语系中与“神的居所/神的家”相关的词（常被联想到 *Bethel*），经由希腊语/拉丁语形式进入英语；因此它强调“被视为神圣的石头”，而不只是普通石块。","在一些研究讨论里，baetyl 常被解释为“可能是陨石而被崇拜”，因为陨石从天而降的特性容易被赋予神圣意义。"]}
{"word":"baetylic","summary":{"en":"Baetylic means “connected with a sacred stone (baetyl), often thought of as a fallen-from-the-sky stone.”","zh":"baetylic 指“与圣石（baetyl）有关的；常指被认为从天而降的神圣石头”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a sacred stone (a baetyl) that was worshiped or believed to have fallen from the sky (often a meteorite) in some ancient religions.","zh":"与“圣石”（baetyl）有关的；指在某些古代宗教中被崇拜或被认为从天而降（常被联想到陨石）的石头。"},"examples":[{"en":"The museum label described the object as a baetylic stone once used in ritual worship.","zh":"博物馆的说明牌把这件物品描述为一块曾用于仪式崇拜的“圣石”（baetylic stone）。"},{"en":"Scholars debate whether the altar originally held a baetylic meteorite.","zh":"学者们争论那座祭坛最初是否供奉过一块具有圣石意义的陨石。"}]}],"synonyms":["baetylic","sacred-stone (related)","cultic (contextual)"],"phonetic":"/biˈætɪlɪk/","extraExplanation":["“baetylic”来自“baetyl/baetylus”（圣石）这一概念，词源可追溯到希腊语 *baitulos*。在地中海与近东一些古代传统中，人们会把某些石头（有时是陨石）视为神圣之物并加以供奉。","这是非常罕见、偏学术/考古语境的形容词；日常英语中更常见的说法是用“sacred stone（圣石）”“meteorite worship（陨石崇拜）”等来表达相关意思。"]}
{"word":"baetyls","summary":{"en":"Baetyls are sacred stones in ancient religions, often believed to have fallen from the sky or to represent a god.","zh":"Baetyls 指古代宗教中的圣石，常被认为从天而降或象征（/承载）神明。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sacred stone (often a meteorite or an upright pillar-like stone) believed in some ancient cultures to be the home or symbol of a god; plural of “baetyl.”","zh":"（古代某些文化中的）圣石（常指陨石或竖立的石柱），被认为是神明的居所或象征；“baetyl”的复数。"},"examples":[{"en":"Ancient writers described baetyls as stones that people believed had fallen from the sky.","zh":"古代作者记载，baetyls 是人们认为从天而降的石头。"},{"en":"The museum exhibit includes a baetyl and explains why such baetyls were treated as holy objects.","zh":"博物馆展品中有一块 baetyl，并解释了为何这类 baetyls 会被视为圣物。"}]}],"synonyms":["sacred stones","betyls","holy stones"],"phonetic":"/ˈbeɪətɪlz/","extraExplanation":["“baetyl”来自希腊语 baitulos（也见写作 betyl），常用于描述地中海与近东古代宗教中的“圣石”崇拜。","在一些传统里，baetyls 可能是陨石（因“来自天空”而更具神圣性），也可能是人为竖立的石柱；它强调的是宗教象征意义，而不只是地质类别。","该词多见于考古、古典学、宗教学语境；日常英语里很少使用。"]}
{"word":"baetylus","summary":{"en":"Baetylus means a sacred stone—often a meteorite—revered as a divine symbol in ancient religions.","zh":"baetylus 指古代宗教中被崇拜的圣石，常与“陨石落地而成的神圣之石”相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sacred stone (often a meteorite) that was worshiped or treated as a divine symbol in some ancient religions; a “holy stone” used as an idol or oracle object","zh":"（古代宗教中的）圣石／神石（常为陨石），被崇拜或被视为神灵象征的石头；用作偶像或神谕媒介的圣物"},"examples":[{"en":"The museum label identified the black stone as a baetylus once honored in a temple.","zh":"博物馆的说明牌标明这块黑石是一块曾在神庙中受崇敬的圣石（baetylus）。"},{"en":"In some ancient accounts, a baetylus could “speak” through priests who interpreted signs around it.","zh":"在一些古代记载中，祭司会解读圣石（baetylus）周围的征兆，仿佛它能“说话”。"}]}],"synonyms":["betyl","sacred stone","holy stone","meteoritic stone","cult stone"],"phonetic":"/ˈbiːtələs/","extraExplanation":["词源与文化背景：baetylus 源自希腊语 baitulos（也见 betyl）。在地中海与近东的古代宗教语境中，它常指被视为“从天而降”的圣石（因此常与陨石联系在一起），被供奉在神庙中，象征神力或神的临在。现代学术写作里多用于讨论腓尼基、叙利亚—巴勒斯坦等地区的石崇拜与神庙圣物。"]}
{"word":"baetzner","summary":{"en":"Baetzner is mainly used as a German-origin surname (family name).","zh":"Baetzner 主要用作一个源自德语背景的姓氏（家族姓）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name), most often of German origin; a variant spelling of “Bätzner/Betzner,” sometimes written with “ae” instead of “ä.”","zh":"一个姓氏（家族姓），多见于德语背景；常被视为“Bätzner/Betzner”的变体拼写，有时用“ae”来替代“ä”。"},"examples":[{"en":"Ms. Baetzner will lead the meeting today.","zh":"Baetzner 女士今天将主持会议。"},{"en":"I found several Baetzners in the school directory.","zh":"我在学校名录里找到了好几位姓 Baetzner 的人。"},{"en":"The author’s last name is Baetzner.","zh":"这位作者的姓是 Baetzner。"}]}],"synonyms":["Betzner","Bätzner"],"phonetic":"/ˈbɛtsnər/","extraExplanation":["“Baetzner”更像是人名而不是常见英语词汇。英语里常见的德语姓名在移民或文件记录中会把“ä/ö/ü”写成“ae/oe/ue”，所以“Baetzner”可能对应德语拼写“Bätzner”。","在英文语境中，姓氏通常不翻译含义，只用来称呼或识别个人；发音也可能因家庭或地区习惯而不同。"]}
{"word":"Baeyer","summary":{"en":"“Baeyer” usually refers to the chemist Adolf von Baeyer or to chemical reactions/tests named after him.","zh":"“Baeyer”通常指化学家阿道夫·冯·拜耳，或指以他命名的化学反应/检验。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Adolf von Baeyer (1835–1917), a German chemist known for major work in organic chemistry (especially dyes and chemical structure) and for reactions and tests that carry his name.","zh":"阿道夫·冯·拜耳（1835–1917），德国化学家，以有机化学研究（尤其是染料与结构理论）著称；多种以他命名的反应与检验方法与其相关。"},"examples":[{"en":"Baeyer won the Nobel Prize in Chemistry in 1905 for his work on organic dyes.","zh":"拜耳因其在有机染料方面的研究而获得1905年诺贝尔化学奖。"},{"en":"In many textbooks, you’ll see the Baeyer–Villiger oxidation introduced in the chapter on carbonyl reactions.","zh":"在许多教材中，“拜耳–维利格氧化”常出现在羰基反应章节里。"}]}],"synonyms":["Adolf von Baeyer"],"phonetic":"/ˈbaɪ.ɚ/","extraExplanation":["“Baeyer”常见于化学名词中，用来纪念阿道夫·冯·拜耳，例如：Baeyer–Villiger oxidation（拜耳–维利格氧化，用过酸把酮/醛转成酯/羧酸）、Baeyer test（拜耳试验，常用冷稀碱性高锰酸钾检验不饱和键，出现褪色/生成棕色二氧化锰）。在一般英语语境中，它多作为专有名词（人名/反应名）出现。"]}
{"word":"Baez","summary":{"en":"Baez is a Spanish-origin surname, often recognized through famous figures like Joan Baez or Javier Báez.","zh":"Baez 是源自西班牙语的姓氏，常因琼·贝兹或哈维尔·巴埃兹等名人而为人所熟知。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname of Spanish origin; in English contexts it often refers to well-known people such as Joan Baez (an American folk singer and activist) or Javier Báez (a Puerto Rican professional baseball player).","zh":"一个源自西班牙语的姓氏；在英语语境中常指一些知名人物，例如琼·贝兹（美国民谣歌手与社会运动者）或哈维尔·巴埃兹（波多黎各职业棒球选手）。"},"examples":[{"en":"I’ve been listening to Joan Baez’s early folk songs.","zh":"我一直在听琼·贝兹早期的民谣歌曲。"},{"en":"Javier Báez made a great defensive play in last night’s game.","zh":"哈维尔·巴埃兹在昨晚的比赛中完成了一次精彩的防守。"}]}],"phonetic":"/baɪˈɛz/","extraExplanation":["“Báez”常见于西语文化圈（西班牙、拉丁美洲、加勒比地区等）。在英文媒体里有时会省略重音符号（á）写成“Baez”。","发音在英语里常被读作“bye-EZ”（如Joan Baez），但在更接近西班牙语的读法里更像两音节“ba-ES”。不同人物或家庭可能有自己的习惯读法。"]}

