{"word":"bah","summary":{"en":"“Bah” is an interjection showing annoyance or dismissiveness; it can also imitate a sheep’s sound.","zh":"“bah”是表示不耐烦/不屑的感叹词，也可用来模仿羊叫“咩”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"Used to show annoyance, disappointment, or that you think something is unimportant (similar to “humbug” or “whatever!”).","zh":"（感叹词）表示不耐烦、失望，或觉得某事不重要（类似“哼”“管它呢/算了吧”）。"},"examples":[{"en":"Bah! This computer is so slow today.","zh":"哼！这台电脑今天太慢了。"},{"en":"Bah, it’s not worth arguing about.","zh":"算了吧，这事不值得争。"}]},{"partOfSpeech":"int.","definition":{"en":"Used to imitate the sound of a sheep (“baa”), often in jokes or playful writing.","zh":"（感叹词）模仿羊的叫声“咩”，常用于玩笑或俏皮的文字里。"},"examples":[{"en":"The kid pointed at the sheep and said, “Bah!”","zh":"孩子指着那只羊说：“咩！”"}]}],"synonyms":["ugh","pah","humbug","whatever"],"phonetic":"/bɑ/","extraExplanation":["“bah”在英语里多见于书面表达（如对话、漫画、小说），用来传达一种强烈的情绪语气；日常口语中更常听到“ugh,” “whatever,” “come on,” 或“forget it.”","英式英语里“Bah!”常带一点夸张或戏谑的味道；著名用法如“Bah! Humbug!”（《圣诞颂歌》里斯克鲁奇的口头禅），表示对某事极其不屑。"]}
{"word":"Baha'i","summary":{"en":"Baha'i refers to a follower of the Bahá’í Faith or something connected to this religion.","zh":"Baha'i 指巴哈伊教的信徒，或指与巴哈伊信仰相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Bahá’í Faith, a religion that teaches the oneness of God, the unity of humanity, and harmony among religions","zh":"巴哈伊教（巴哈伊信仰）的信徒；该宗教强调上帝唯一、人类一体，以及宗教之间的和谐"},"examples":[{"en":"She is a Baha'i who volunteers in community service projects.","zh":"她是一位巴哈伊信徒，常参与社区服务项目。"},{"en":"Many Baha'i communities hold devotional gatherings that welcome people of different backgrounds.","zh":"许多巴哈伊社区会举办灵修聚会，欢迎不同背景的人参加。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Bahá’í Faith","zh":"巴哈伊教的；与巴哈伊信仰有关的"},"examples":[{"en":"They visited a Baha'i House of Worship while traveling.","zh":"他们旅行时参观了一座巴哈伊灵曦堂（礼拜堂）。"},{"en":"Baha'i teachings emphasize unity and service.","zh":"巴哈伊教义强调团结与服务。"}]}],"synonyms":["Bahá’í (alternative spelling)"],"phonetic":"/bəˈhaɪ/","extraExplanation":["“Bahá’í”源自阿拉伯语 Bahá（意为“荣耀/荣光”）。“Bahá’í Faith”通常译为“巴哈伊教/巴哈伊信仰”。英语中常见两种写法：带变音符号的 Bahá’í（更正式）与简写 Baha'i（更常见于日常输入）。","读音上，英语里常把重音放在第二个音节附近，且写作 Baha'i 时撇号表示一个轻微的停顿（对应原词中的喉塞音）。","文化常识：巴哈伊教起源于19世纪的波斯（今伊朗），强调宗教和谐、男女平等、教育与社会服务等理念。与人交流时，通常把它当作一种宗教名称，像 “Christian / Jewish / Muslim” 那样使用。"]}
{"word":"Baha'ullah","summary":{"en":"Bahá’u’lláh is the founder of the Bahá’í Faith and a key religious figure in Bahá’í belief.","zh":"Bahá’u’lláh（巴哈欧拉）是巴哈伊信仰的创立者，也是巴哈伊信徒信仰中的重要宗教人物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The founder of the Bahá’í Faith (1817–1892), regarded by Bahá’ís as a Messenger of God who taught the unity of humanity and the oneness of religions.","zh":"巴哈欧拉（1817–1892），巴哈伊信仰的创立者；巴哈伊信徒认为他是“上帝的使者”，其教导强调人类合一与宗教同源。"},"examples":[{"en":"Bahá’u’lláh’s writings are central texts in the Bahá’í Faith.","zh":"巴哈欧拉的著作是巴哈伊信仰的核心经典。"},{"en":"Many Bahá’ís refer to Bahá’u’lláh with great respect in prayers and conversation.","zh":"许多巴哈伊信徒在祈祷和交谈中都会非常尊敬地提到巴哈欧拉。"}]}],"synonyms":["Bahá’u’lláh","Bahaullah"],"phonetic":"/bəˌhɑːʊˈlɑː/","extraExplanation":["“Bahá’u’lláh”来自阿拉伯语，常译作“上帝的荣耀”。英文里会看到不同拼写（如 Baha'ullah / Bahá’u’lláh），主要是转写方式不同；带重音符号的写法更接近原语发音。","在英语写作中，这个词属于专有名词，通常首字母大写；在正式场合常用全名“Bahá’u’lláh”，并在首次出现时简要说明其身份（如“the founder of the Bahá’í Faith”）。"]}
{"word":"bahada","summary":{"en":"“bahada” isn’t standard English; it is often a misspelling of “bajada,” a desert landform made of merged alluvial fans.","zh":"“bahada”不是标准英语；它常是“bajada”的误拼，指由多个冲积扇并合形成的沙漠山前缓坡地貌。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“bahada” is not a standard English word. In many cases, people mean “bajada,” a geology term for a broad slope made from merged alluvial fans at the base of mountains (common in deserts).","zh":"“bahada”不是标准英语词。很多情况下人们想写的是地质学术语“bajada”，指山脚下由多个冲积扇连成的一大片缓坡（常见于沙漠地区）。"},"examples":[{"en":"I couldn’t find “bahada” in a dictionary—did you mean “bajada” in geology?","zh":"我在词典里找不到“bahada”——你是不是想说地质学里的“bajada”？"},{"en":"The dry valley ends in a bajada where sediments spread out from the mountains.","zh":"这条干旱山谷的尽头是一片bajada，沉积物从山地向外铺展开来。"}]}],"synonyms":["bajada","alluvial-fan complex","piedmont slope"],"phonetic":"/bəˈhɑdə/","extraExplanation":["“Bajada”来自西班牙语，原意与“下坡/下降”有关；在北美沙漠地貌描述中常用，指多个冲积扇（alluvial fans）在山前并合形成的连续缓坡。","如果你指的是其他语言（如人名、地名或阿拉伯语词根等）的“bahada”，告诉我你看到它的句子或来源，我可以按具体语境解释。"]}
{"word":"bahadur","summary":{"en":"Bahadur means “brave/courageous” in South Asian usage and is also used as a title or personal name.","zh":"Bahadur 在南亚语境中意为“勇敢”，也常用作称号或人名。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(South Asian English; from Hindi/Urdu) brave; courageous.","zh":"（南亚英语；源自印地语/乌尔都语）勇敢的；有胆量的。"},"examples":[{"en":"The villagers called him bahadur because he rescued a child from the river.","zh":"村民称他为 bahadur，因为他从河里救起了一个孩子。"},{"en":"In some stories, the bahadur soldier never gives up.","zh":"在一些故事里，那位 bahadur 的士兵从不放弃。"}]},{"partOfSpeech":"n.","definition":{"en":"a title or honorific meaning “the brave,” used in parts of South Asia (often after a name).","zh":"一种称号/敬称，意为“勇者”，在南亚部分地区使用（常接在人名后）。"},"examples":[{"en":"His grandfather was known as Karim Bahadur in the community.","zh":"在社区里，他的祖父被称为 Karim Bahadur。"},{"en":"Some historical figures used “Bahadur” as part of their royal style.","zh":"一些历史人物把 “Bahadur” 作为王号/尊号的一部分。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name or family name (especially in Afghanistan, Pakistan, India, and Nepal).","zh":"人名或姓氏（在阿富汗、巴基斯坦、印度、尼泊尔等地较常见）。"},"examples":[{"en":"Bahadur moved to New Jersey for graduate school.","zh":"Bahadur 为读研究生搬到了新泽西。"},{"en":"Ms. Bahadur will speak at the meeting tomorrow.","zh":"Bahadur 女士将于明天在会议上发言。"}]}],"synonyms":["brave","courageous","valiant","fearless"],"phonetic":"/bəˈhɑːdʊr/","extraExplanation":["“Bahadur/baḥādur”一词与波斯语、突厥语文化圈的“勇士/英雄”称号有关，后来进入乌尔都语、印地语等语言，并在南亚历史中常见于头衔与人名（如部分王室称号）。","英语语境里它多作为外来词出现：要么用作姓名/头衔，要么在南亚英语写作中用来形容“勇敢”。"]}
{"word":"bahadurs","summary":{"en":"Bahadurs is the plural of bahadur, meaning brave people or (in South Asian contexts) people bearing an honorific meaning “the brave”; it can also be a dated term for a male servant.","zh":"Bahadurs 是 bahadur 的复数，主要指勇士/勇敢的人；在南亚语境中也可指带有“勇者”敬称的人；另有较旧用法指男仆/勤务员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of bahadur) A brave person; a hero. In South Asian contexts, also a respectful title meaning “the brave” used after a person’s name.","zh":"（bahadur 的复数）勇敢的人；英雄。在南亚语境中也可作敬称/头衔，意为“勇者”，常放在人名之后。"},"examples":[{"en":"The story praises the bahadurs who defended their village.","zh":"这个故事歌颂了那些保卫村庄的勇士们。"},{"en":"In some historical records, several officers are listed as “Singh Bahadur,” and the text refers to them collectively as bahadurs.","zh":"在一些历史记载中，有几位军官被写作“Singh Bahadur”，文中把他们合称为 bahadurs。"}]},{"partOfSpeech":"n.","definition":{"en":"(older British/South Asian English) A male servant or orderly, especially in colonial-era usage.","zh":"（较旧的英式/南亚英语）男仆；勤务员（尤见于殖民时期语境）。"},"examples":[{"en":"In the novel, the officer calls for his bahadur to bring tea.","zh":"在小说里，那位军官叫他的勤务员端茶来。"},{"en":"This meaning can sound dated today, so be careful with the context.","zh":"这个用法如今听起来较陈旧，使用时要注意语境。"}]}],"synonyms":["heroes","brave men","warriors","honorees"],"phonetic":"/bəˈhɑːdərz/","extraExplanation":["“bahadur”源自波斯语/中亚语系的词根，意为“勇敢、英雄”。在南亚历史中它常作为荣誉称号出现（例如在莫卧儿、锡克等语境里），类似于“勇者/功臣”的称号，常放在人名后。","在殖民时期英语里，“bahadur”也被用来指某些男仆或勤务员，这个用法带有明显时代与阶层色彩；现代写作中如果使用，通常需要明确是历史/文学语境。"]}
{"word":"Bahai","summary":{"en":"Bahá’í refers to a follower of the Bahá’í Faith or something related to that religion.","zh":"Bahá’í 指巴哈伊信仰的信徒，或与巴哈伊教相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often capitalized) A member of the Bahá’í Faith, a world religion that teaches the unity of God, the unity of religions, and the unity of humanity.","zh":"（常大写）巴哈伊教（巴哈伊信仰）的信徒；该世界性宗教强调上帝唯一、宗教同源、人类一体。"},"examples":[{"en":"My neighbor is a Bahá’í and often volunteers in community service projects.","zh":"我的邻居是巴哈伊教徒，经常参加社区志愿服务。"},{"en":"Several Bahá’ís gathered for a devotional meeting at their home.","zh":"几位巴哈伊教徒在家里聚会进行祈祷敬拜。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to the Bahá’í Faith or its teachings.","zh":"巴哈伊教的；与巴哈伊信仰或其教义相关的。"},"examples":[{"en":"They visited a Bahá’í center to learn about interfaith activities.","zh":"他们参观了巴哈伊中心，了解跨宗教活动。"},{"en":"The class discussed Bahá’í writings about peace and unity.","zh":"课堂讨论了巴哈伊著作中关于和平与团结的内容。"}]}],"synonyms":["Baha'i","Baha'i Faith (for the religion)","Bahá’í Faith"],"phonetic":"/bəˈhɑːi/","extraExplanation":["“Bahá’í”常见写法带重音符号（á）和撇号（’），来源于阿拉伯语/波斯语背景；英语里也常见不带符号的写法“Baha'i”。","巴哈伊信仰兴起于19世纪的波斯（今伊朗），其核心之一是强调不同宗教在精神源头上的一致与人类整体的团结。","在英语书写中，若作名词指“信徒”（a Bahá’í / Bahá’ís）；作形容词修饰名词（Bahá’í teachings / Bahá’í community）。"]}
{"word":"bahai","summary":{"en":"Bahá’í means a person who follows the Bahá’í Faith, or something related to that religion.","zh":"Bahá’í 指巴哈伊信仰的信徒，或与巴哈伊教相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a follower of the Bahá’í Faith (a world religion that teaches the unity of God, religions, and humanity)","zh":"巴哈伊教（巴哈伊信仰）的信徒；该宗教强调上帝、宗教与人类的合一"},"examples":[{"en":"Her grandparents are Bahá’ís, and they celebrate holy days together.","zh":"她的祖父母是巴哈伊教徒，他们会一起庆祝圣日。"},{"en":"A local Bahá’í volunteered at the community literacy program.","zh":"一位当地巴哈伊教徒在社区扫盲项目中做志愿者。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Bahá’í Faith or its community","zh":"与巴哈伊教（巴哈伊信仰）或其社群有关的；巴哈伊教的"},"examples":[{"en":"They visited a Bahá’í center to learn about its teachings.","zh":"他们参观了巴哈伊中心来了解其教义。"},{"en":"The event included Bahá’í prayers and music.","zh":"活动包括巴哈伊祷文和音乐。"}]}],"synonyms":["Baha'i","Bahá’í Faith (for the religion)"],"phonetic":"/bəˈhaɪ/","extraExplanation":["“Bahá’í”常见写法带重音符号（á）和撇号（’），源自阿拉伯语/波斯语转写；日常英语里也常写作“Baha'i”。","“Bahá’í Faith”指宗教本身；“a Bahá’í”指个人信徒。一般大写，属于专有名词/专有形容词。"]}
{"word":"Bahaism","summary":{"en":"Bahaism is another name for the Bahá’í Faith, a 19th‑century monotheistic religion teaching the unity of God, religions, and humanity.","zh":"Bahaism 是巴哈伊信仰（巴哈伊教）的别称，起源于19世纪的一神教，强调上帝唯一、宗教同源与人类大同。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a monotheistic religion (the Bahá’í Faith) founded in 19th‑century Persia that teaches the unity of God, the unity of religions, and the unity of humanity.","zh":"巴哈伊教（巴哈伊信仰）：一种一神教，起源于19世纪的波斯，强调上帝唯一、宗教同源与人类大同。"},"examples":[{"en":"She has been studying the teachings of Bahaism for a world religions class.","zh":"她在世界宗教课上学习巴哈伊教的教义。"},{"en":"Bahaism emphasizes unity and cooperation among people of different backgrounds.","zh":"巴哈伊教强调不同背景的人之间的团结与合作。"}]}],"synonyms":["the Bahá’í Faith","Bahá’í religion"],"phonetic":"/bəˈhɑːɪzəm/","extraExplanation":["“Bahaism”在英文里可以用，但更常见、更尊重该群体自称的说法是“the Bahá’í Faith”（巴哈伊信仰），“Bahá’í”指“巴哈伊的/巴哈伊教徒”。","该信仰与波斯（今伊朗）的宗教历史有关：巴哈欧拉（Bahá’u’lláh）被认为是其创立者；在阅读英文资料时，常会看到其核心理念如“unity of humanity（人类大同）”“progressive revelation（渐进启示）”。"]}
{"word":"bahaism","summary":{"en":"Baha'ism is another name for the Bahá’í Faith, a religion teaching the unity of God, religion, and humanity.","zh":"Bahaism（Baha'ism）是巴哈伊信仰的另一种说法，主张上帝、宗教与人类的一体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a religion founded in 19th-century Persia (Iran), teaching the unity of God, the unity of religions, and the unity of humanity; also called the Bahá’í Faith.","zh":"巴哈伊教（19世纪在波斯/伊朗兴起的宗教），强调上帝的一体、宗教的一体与人类的一体；也称“巴哈伊信仰”。"},"examples":[{"en":"She learned about Baha'ism in a world religions class.","zh":"她在世界宗教课上了解了巴哈伊教。"},{"en":"Baha'ism emphasizes the oneness of humanity and the need for peace.","zh":"巴哈伊教强调人类一体以及和平的必要性。"},{"en":"A local community center hosted a talk on Baha'ism and interfaith dialogue.","zh":"当地社区中心举办了一场关于巴哈伊教与宗教间对话的讲座。"}]}],"synonyms":["Bahá’í Faith","Bahá’í religion"],"phonetic":"/bəˈhaɪ.ɪzəm/","extraExplanation":["“Baha'ism”在英文中相对少见，更常见、也更正式的说法是“the Bahá’í Faith / Bahá’í religion”。写作时常见重音符号“á”和撇号“’”，用于更接近原语言音译。","在文化语境里，讨论该宗教时常会提到其核心理念：世界和平、男女平等、教育的重要性，以及不同宗教传统之间的和谐。"]}
{"word":"Bahaist","summary":{"en":"A Bahaist is a follower of the Bahá’í Faith; it can also mean “related to the Bahá’í Faith.”","zh":"Bahaist 指巴哈伊教徒，也可作形容词表示“与巴哈伊教有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who follows the Bahá’í Faith (a world religion founded in 19th-century Persia/Iran, emphasizing the unity of humanity and religions).","zh":"巴哈伊教徒；巴哈伊信仰的信徒（巴哈伊教起源于19世纪的波斯/伊朗，强调人类与宗教的合一）。"},"examples":[{"en":"Her grandparents are Bahaists, and they often host community gatherings at home.","zh":"她的祖父母是巴哈伊教徒，他们经常在家里举办社区聚会。"},{"en":"Many Bahaists take part in interfaith activities to promote understanding.","zh":"许多巴哈伊教徒会参与跨宗教活动来促进理解。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Bahá’í Faith or its followers.","zh":"巴哈伊教的；与巴哈伊教或其信徒有关的。"},"examples":[{"en":"They visited a Bahaist center to learn about the religion’s teachings.","zh":"他们参观了一个巴哈伊中心，了解该宗教的教义。"},{"en":"The museum included a small Bahaist exhibit on modern religions.","zh":"博物馆里有一个关于现代宗教的小型巴哈伊展区。"}]}],"synonyms":["Bahá’í","Bahai"],"phonetic":"/bəˈhɑːɪst/","extraExplanation":["“Bahaist”在英语里可以用，但更常见、更被信徒偏好的写法是“Bahá’í”（名词/形容词都可用），复数为“Bahá’ís”。","注意拼写中的重音符号（á, í）在正式文本常见；不方便输入时也常写作“Bahai”。","谈论宗教身份时，使用对方自称（如“Bahá’í”）通常更礼貌、更符合文化敏感性。"]}
{"word":"bahaist","summary":{"en":"A Bahaist is a follower of the Bahá’í Faith; it can also mean “related to the Bahá’í Faith.”","zh":"Bahaist 指巴哈伊教信徒，也可作形容词表示“与巴哈伊信仰有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a follower of the Bahá’í Faith (a religion that began in 19th-century Persia/Iran and teaches the unity of humanity and religions).","zh":"巴哈伊教（Bahá’í）信徒；巴哈伊信仰的追随者（起源于19世纪波斯/伊朗，强调人类与宗教的合一）。"},"examples":[{"en":"Her neighbor is a Bahaist who volunteers in community education programs.","zh":"她的邻居是一位巴哈伊教徒，常在社区教育项目中做志愿者。"},{"en":"The museum hosted a talk by a Bahaist about interfaith dialogue.","zh":"博物馆举办了一场由巴哈伊教徒主讲的讲座，主题是跨宗教对话。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Bahá’í Faith or its followers.","zh":"与巴哈伊信仰或其信徒有关的；巴哈伊的。"},"examples":[{"en":"They visited a Bahaist center to learn about its teachings.","zh":"他们参观了巴哈伊中心来了解其教义。"},{"en":"The library has a small Bahaist section with introductory books.","zh":"图书馆有一个小小的巴哈伊专区，放着一些入门书籍。"}]}],"synonyms":["Bahá’í","Bahai","adherent of the Bahá’í Faith","follower of the Bahá’í Faith"],"phonetic":"/bəˈhɑɪst/","extraExplanation":["英语里更常见、也更标准的写法是 “Bahá’í”（带重音符号），指“巴哈伊的/巴哈伊教徒”。“Bahaist” 也能用，但在现代英语中相对少见，语气上更像“某某主义者（-ist）”。","书写时通常需要大写（Bahaist / Bahá’í），因为它与宗教/群体名称有关。发音中重音一般落在第二个音节附近（-HA-）。"]}
{"word":"Baham","summary":{"en":"“Baham” is an uncommon proper name (often a place name or surname), not a standard common English vocabulary word.","zh":"“Baham”多为不常见的专有名词（常见于地名或姓氏），并非标准的常用英语词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare proper name used as a place name or family name in some regions; in English it is not a common everyday word.","zh":"一个较少见的专有名词，可作地名或姓氏；在英语里不是常见的日常词汇。"},"examples":[{"en":"I found “Baham” on the map, but it seems to be a small local place name.","zh":"我在地图上看到了“Baham”，但它似乎是一个较小的地方名称。"},{"en":"Baham is a surname in some communities, though it isn’t widely known.","zh":"Baham 在一些社群中是姓氏，但并不广为人知。"}]}],"phonetic":"/bəˈhɑm/","extraExplanation":["“Baham”在英语中更常见的情况是拼写误差或省略：如果你想说加勒比海国家群岛，通常是 **the Bahamas**（巴哈马）；形容词/国籍是 **Bahamian**（巴哈马的/巴哈马人）。","如果你告诉我你看到“Baham”的具体句子或上下文（例如在书里、地图上、姓名里），我可以更准确判断它指的是哪个专名以及最自然的中文译法。"]}
{"word":"baham","summary":{"en":"“Baham” is uncommon in standard English and is usually a proper name or a misspelling of “the Bahamas.”","zh":"“Baham”在标准英语中不常见，多为人名/姓氏，或是“the Bahamas（巴哈马）”的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare proper name (surname or given name). In everyday English, “baham” is not a standard dictionary word; it is often a misspelling of “Bahamas.”","zh":"一个较少见的专有名词（可作姓或名）。在日常英语中，“baham”不是常见词；它经常是“The Bahamas（巴哈马）”的拼写错误。"},"examples":[{"en":"I saw the name Baham on the sign outside the office.","zh":"我在办公室外的牌子上看到了“Baham”这个名字。"},{"en":"Did you mean the Bahamas? “Baham” looks like a typo.","zh":"你是想说“the Bahamas（巴哈马）”吗？“baham”看起来像拼写错误。"}]}],"phonetic":"/bəˈhɑm/","extraExplanation":["“Baham”本身在常用英语里并不常见；如果你想表达国家/群岛，通常写作 **the Bahamas**（巴哈马群岛），读音更接近 /bəˈhɑməz/。","如果你能告诉我你看到“baham”的句子或上下文（例如地名、人名、游戏/小说名），我可以更准确地判断它指什么。"]}
{"word":"Bahama","summary":{"en":"Bahama refers to a person from the Bahamas or something related to the Bahamas (though “Bahamian” is more common).","zh":"Bahama 可指巴哈马人或与巴哈马有关的事物（但更常用 Bahamian）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from the Bahamas","zh":"巴哈马人（来自巴哈马的人）"},"examples":[{"en":"She is a Bahama who grew up in Nassau.","zh":"她是一位巴哈马人，在拿骚长大。"}]},{"partOfSpeech":"adj.","definition":{"en":"(often attributive) relating to the Bahamas, its people, or its culture","zh":"（常作定语）巴哈马的；与巴哈马人民或文化有关的"},"examples":[{"en":"They listened to Bahama music at the festival.","zh":"他们在节日上听巴哈马音乐。"},{"en":"The museum has a small Bahama art section.","zh":"博物馆里有一个小型的巴哈马艺术展区。"}]}],"synonyms":["Bahamian","the Bahamas","Bahama Islands"],"phonetic":"/bəˈhɑːmə/","extraExplanation":["“Bahama”常见于“Bahama Islands（巴哈马群岛）”等搭配中，但国家名称更常用复数形式“The Bahamas”。在日常英语里，人们更常说“a Bahamian（巴哈马人/巴哈马的）”来指人或形容词用法。","文化延伸：在餐饮与流行文化中会看到“Bahama Mama”（一种鸡尾酒/也可指风格化的名字）等用法，但它通常是专有名词或固定搭配。"]}
{"word":"bahama","summary":{"en":"“Bahama” usually refers to an island in the Bahamas; the country is most commonly called “the Bahamas.”","zh":"“Bahama”多指巴哈马群岛中的某一座岛；整个国家通常说“the Bahamas（巴哈马）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A single island of the Bahamas, or used as a shortened form referring to the Bahamas in general (more commonly said as “the Bahamas”).","zh":"（专有名词）指巴哈马群岛中的某一座岛；也可作为“巴哈马（群岛）”的简写，但更常见的说法是“the Bahamas（巴哈马）”。"},"examples":[{"en":"Many tourists visit Bahama islands for their clear water and beaches.","zh":"很多游客去巴哈马的岛屿是为了那里的清澈海水和海滩。"},{"en":"They planned a trip to the Bahamas, not just one Bahama island.","zh":"他们计划去巴哈马（整个国家/群岛）旅行，而不只是某一座巴哈马的岛。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Adjective, attributive) Related to the Bahamas (often written “Bahamian” in formal English).","zh":"（形容词，用于名词前）与巴哈马有关的（正式英语里常用“Bahamian”表示“巴哈马的/巴哈马人”）。"},"examples":[{"en":"Bahama beaches are famous, but “Bahamian beaches” is more standard English.","zh":"“Bahama beaches（巴哈马海滩）”可以理解，但更标准的说法是“Bahamian beaches”。"},{"en":"She loves Bahamian music and food.","zh":"她很喜欢巴哈马的音乐和食物。"}]}],"synonyms":["the Bahamas (for the country)","Bahamian (related adjective)"],"phonetic":"/bəˈhɑmə/","extraExplanation":["在英文里，这个国家通常写作并说作 **the Bahamas**（复数形式），例如：*I’m traveling to the Bahamas.* 单说 **Bahama** 更像是指其中一座岛，或在口语/广告语中作为简写。","表示“巴哈马人/巴哈马的”更常见、也更自然的词是 **Bahamian**（巴哈马人；巴哈马的）。"]}
{"word":"Bahamas","summary":{"en":"The Bahamas: an Atlantic island country/archipelago near Florida, famous for beaches; capital Nassau.","zh":"巴哈马：靠近佛罗里达的大西洋群岛国家/群岛地区，以海滩闻名；首都拿骚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A country made up of many islands in the Atlantic Ocean (southeast of Florida), known for beaches and tourism; its capital is Nassau.","zh":"巴哈马（国名）：位于大西洋、佛罗里达州东南方向的群岛国家，以海滩与旅游业闻名；首都是拿骚。"},"examples":[{"en":"My family visited the Bahamas during winter break.","zh":"我家在寒假去巴哈马旅行。"},{"en":"The Bahamas is famous for clear blue water and coral reefs.","zh":"巴哈马以清澈的蓝色海水和珊瑚礁而出名。"}]},{"partOfSpeech":"n.","definition":{"en":"A geographic island chain/region (used especially when talking about the islands rather than the government).","zh":"巴哈马群岛/巴哈马地区（更强调“这些岛屿”这片地理区域，而不一定指国家政府）。"},"examples":[{"en":"Many ships pass through the Bahamas on the way to the Caribbean.","zh":"许多船只在前往加勒比海的途中会经过巴哈马群岛。"},{"en":"The Bahamas’ islands stretch over a large area of ocean.","zh":"巴哈马群岛在海上延伸的范围很广。"}]}],"synonyms":["The Commonwealth of The Bahamas"],"phonetic":"/bəˈhɑːməz/","extraExplanation":["用法小提示：英语里这个国名通常写作 The Bahamas（前面常加定冠词 the），因为它指“很多岛屿组成的群岛”。例如：The Bahamas is/are… 两种动词都能见到，但现代新闻与写作中更常用单数 is，把它当作一个国家来看。","发音与拼写：Bahamas 里重音常在第二个音节（-HA-）。中文常译为“巴哈马”。"]}
{"word":"bahamas","summary":{"en":"The Bahamas is an Atlantic island country made up of many islands, with Nassau as its capital.","zh":"巴哈马是位于大西洋的群岛国家，由许多岛屿组成，首都是拿骚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An island country in the Atlantic Ocean, southeast of Florida, made up of many islands and cays; its capital is Nassau.","zh":"巴哈马：位于大西洋、佛罗里达州东南方的群岛国家，由许多岛屿与珊瑚小岛（cays）组成；首都是拿骚（Nassau）。"},"examples":[{"en":"My aunt is traveling to the Bahamas next week.","zh":"我阿姨下周要去巴哈马旅行。"},{"en":"The Bahamas is famous for clear water and beautiful beaches.","zh":"巴哈马以清澈的海水和美丽的海滩闻名。"},{"en":"Nassau is the capital of the Bahamas.","zh":"拿骚是巴哈马的首都。"}]}],"synonyms":["the Bahama Islands"],"phonetic":"/bəˈhɑːməz/","extraExplanation":["“the Bahamas”通常与定冠词the一起使用，因为它指的是“群岛”（很多岛屿的集合），类似的还有“the Philippines（菲律宾）”“the Maldives（马尔代夫）”。","拼写与大小写：作为国家名称要大写Bahamas；作形容词时常用Bahamian（巴哈马的 / 巴哈马人）。"]}
{"word":"Bahamian","summary":{"en":"“Bahamian” means a person from The Bahamas, or something relating to The Bahamas.","zh":"“Bahamian”指巴哈马人/巴哈马裔的人，也可指与巴哈马有关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from The Bahamas, or someone of Bahamian origin.","zh":"巴哈马人；巴哈马裔的人。"},"examples":[{"en":"She is Bahamian and grew up in Nassau.","zh":"她是巴哈马人，在拿骚长大。"},{"en":"Many Bahamians speak English as an official language.","zh":"许多巴哈马人使用英语作为官方语言。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to The Bahamas or its people, culture, or things from there.","zh":"巴哈马的；与巴哈马或其人民、文化及相关事物有关的。"},"examples":[{"en":"We tried Bahamian food, including conch salad.","zh":"我们尝了巴哈马美食，包括海螺沙拉。"},{"en":"Bahamian music often blends Caribbean rhythms.","zh":"巴哈马音乐常融合加勒比节奏。"}]}],"synonyms":["from The Bahamas","Bahamian (nationality adjective)"],"phonetic":"/bəˈheɪmiən/","extraExplanation":["“Bahamian”来自国名“The Bahamas”。英语里很多国家/地区的国民与形容词形式相同（如 Canadian, Jamaican），既可作名词也可作形容词。","文化语境：在旅行、新闻或体育中常见该词；谈到语言时，巴哈马的官方语言是英语，日常口语中也常听到巴哈马英语（Bahamian English）的特色表达。"]}
{"word":"bahamian","summary":{"en":"“Bahamian” means from The Bahamas, or a person from The Bahamas.","zh":"“Bahamian”表示“巴哈马的”，也可指“巴哈马人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to The Bahamas or its people, culture, or language.","zh":"巴哈马的；与巴哈马及其人民、文化或语言有关的。"},"examples":[{"en":"She loves Bahamian music and dances.","zh":"她很喜欢巴哈马的音乐和舞蹈。"},{"en":"We tried Bahamian food like conch fritters.","zh":"我们尝了巴哈马食物，比如海螺饼。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from The Bahamas.","zh":"巴哈马人；巴哈马居民。"},"examples":[{"en":"Many Bahamians speak English as the official language.","zh":"许多巴哈马人把英语作为官方语言。"},{"en":"He is a Bahamian who grew up in Nassau.","zh":"他是巴哈马人，在拿骚长大。"}]}],"synonyms":["from The Bahamas","Bahamian (national)"],"phonetic":"/bəˈheɪmiən/","extraExplanation":["“Bahamian”常与首都Nassau（拿骚）以及当地文化元素一起出现，例如Junkanoo（传统街头庆典与音乐游行）和海螺（conch）料理。","书写时通常首字母大写：Bahamian（国籍/族群/形容词）。"]}
{"word":"bahamians","summary":{"en":"Bahamians are people from the Bahamas.","zh":"Bahamians 指“巴哈马人”，即来自巴哈马的居民或公民。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People from the Bahamas; citizens or natives of the Bahamas.","zh":"巴哈马人；来自巴哈马的居民或公民。"},"examples":[{"en":"Many Bahamians work in tourism and hospitality.","zh":"许多巴哈马人在旅游与酒店服务业工作。"},{"en":"Bahamians celebrate Junkanoo with music, dancing, and colorful costumes.","zh":"巴哈马人用音乐、舞蹈和绚丽的服装庆祝“Junkanoo”（扬卡努）节。"}]}],"synonyms":["people of the Bahamas","Bahamian people"],"phonetic":"/bəˈheɪmiənz/","extraExplanation":["“Bahamians”是复数形式；单数是“Bahamian”（一个巴哈马人）。","“Bahamian”也可作形容词，表示“巴哈马的/巴哈马人的”，如：Bahamian food（巴哈马美食）、Bahamian culture（巴哈马文化）。","巴哈马是加勒比地区的岛国，以海岛旅游闻名；在文化语境里常会提到Junkanoo（重要的传统节庆）以及海洋相关的生活方式。"]}
{"word":"bahan","summary":{"en":"Bahan is an Indonesian/Malay word meaning “material” or “ingredient.”","zh":"bahan 是印尼语/马来语，意思是“材料/原料/配料”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Indonesian/Malay) material; ingredient; raw stuff used to make something.","zh":"（印尼语/马来语）材料；原料；（做某物的）用料。"},"examples":[{"en":"We need better bahan for this product.","zh":"我们需要更好的 bahan（材料）来做这个产品。"},{"en":"What bahan do you use for the soup?","zh":"这道汤你用哪些 bahan（食材/配料）？"}]}],"synonyms":["material","ingredient","raw material"],"phonetic":"/ˈbɑːhɑːn/","extraExplanation":["“bahan”常见于印尼语/马来语语境：例如“bahan makanan”（食材/食品原料）、“bahan baku”（原材料）、“bahan kimia”（化学品/化学原料）。在英语对话里偶尔会被保留原词使用，通常出现在东南亚的商业、工厂、烹饪或日常交流中。"]}
{"word":"bahar","summary":{"en":"*Bahar* most commonly means “spring/springtime” in Persian, Urdu, and Turkish, and it is also used as a personal name.","zh":"*Bahar* 最常见的意思是“春天/春季”（在波斯语、乌尔都语、土耳其语中），也常被用作人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Persian/Urdu/Turkish) the season of spring; springtime.","zh":"（源自波斯语/乌尔都语/土耳其语）春天；春季。"},"examples":[{"en":"In Persian poetry, *bahar* often symbolizes hope and new beginnings.","zh":"在波斯诗歌里，*bahar* 常象征希望与新的开始。"},{"en":"They called the festival “Bahar,” celebrating the arrival of spring.","zh":"他们把这个节日叫作“Bahar”，庆祝春天的到来。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name (used for all genders in some cultures), often associated with “spring.”","zh":"人名（在一些文化中可为男女皆用），常与“春天”的意象相关。"},"examples":[{"en":"Bahar is a common name in Iran and Turkey.","zh":"Bahar 是伊朗和土耳其较常见的名字。"},{"en":"Bahar said she loves how her name means “spring.”","zh":"Bahar 说她很喜欢自己的名字，因为它有“春天”的意思。"}]}],"synonyms":["spring","springtime","vernal season"],"phonetic":"/bɑːˈhɑːr/","extraExplanation":["“Bahar/بهار”在波斯语与乌尔都语中非常常见，文学里常与“复苏、青春、希望、花开”并列出现；在土耳其语里也主要指“春天”。","作为人名时，通常带有积极、温暖的联想，类似英文名“Spring”带来的感觉。"]}
{"word":"bahasa","summary":{"en":"“Bahasa” means “language” in Indonesian/Malay and is commonly seen in “Bahasa Indonesia/Melayu.”","zh":"“Bahasa”在印尼语/马来语中意为“语言”，常见于“Bahasa Indonesia/Melayu”等名称中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Indonesian and Malay) “language”; often used in names like “Bahasa Indonesia” (the Indonesian language) or “Bahasa Melayu” (the Malay language).","zh":"（印尼语和马来语中）“语言”；常用于名称中，如“Bahasa Indonesia”（印尼语）或“Bahasa Melayu”（马来语）。"},"examples":[{"en":"I’m learning Bahasa Indonesia this year.","zh":"我今年在学印尼语。"},{"en":"In Malay, the word “bahasa” means “language.”","zh":"在马来语中，“bahasa”的意思是“语言”。"}]}],"synonyms":["language"],"phonetic":"/bəˈhɑːsə/","extraExplanation":["在英语语境里，有些人会把“Bahasa”当成“印尼语”本身来用（如 *I speak Bahasa*）。但在印尼语/马来语里，“bahasa”单独说更像“语言”这个泛称；更自然、准确的说法是 *Bahasa Indonesia*（印尼语）或 *Bahasa Melayu*（马来语）。"]}
{"word":"Bahaullah","summary":{"en":"Bahá’u’lláh is the founder of the Bahá’í Faith and a central religious figure whose teachings emphasize unity and peace.","zh":"巴哈欧拉是巴哈伊信仰的创立者与核心宗教人物，其教导强调合一与和平。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bahá’u’lláh: the title and name of Mírzá Ḥusayn-‘Alí Núrí (1817–1892), the founder of the Bahá’í Faith, regarded by Bahá’ís as a Messenger of God who taught unity, peace, and the oneness of humanity.","zh":"巴哈欧拉（Bahá’u’lláh）：米尔扎·侯赛因-阿里·努里（1817–1892）的尊称与名字，巴哈伊信仰的创立者；巴哈伊信徒认为他是“上帝的使者”，其教导强调人类一体、和平与合一。"},"examples":[{"en":"Bahá’u’lláh wrote many works, including the Kitáb-i-Aqdas.","zh":"巴哈欧拉著作甚多，其中包括《至圣经》（Kitáb-i-Aqdas）。"},{"en":"Many Bahá’ís visit sites connected with Bahá’u’lláh in the Haifa–Acre area.","zh":"许多巴哈伊信徒会前往与巴哈欧拉相关的圣地，主要在海法—阿卡一带。"},{"en":"In the Bahá’í Faith, Bahá’u’lláh’s teachings focus on the unity of humankind.","zh":"在巴哈伊信仰中，巴哈欧拉的教导强调人类的合一。"}]}],"synonyms":["Bahá’u’lláh (standard spelling)","Baha'u'llah (common English spelling)"],"phonetic":"/bəˈhɑːʊˌlɑː/","extraExplanation":["“Bahá’u’lláh”源自阿拉伯语，常译为“上帝的荣耀”（Glory of God），属于尊称性质的名字，因此在英文里通常大写并保留重音符号（Bahá’u’lláh）。","书写上也常见简化形式“Bahaullah”（不带重音符号），但在正式出版物与学术写作中更常用“Bahá’u’lláh”。","读写提示：英文中常见的拼写变体还包括“Baha'u'llah”。在引用其著作或宗教语境中，尊称用法较多。"]}
{"word":"bahaullah","summary":{"en":"Bahá’u’lláh is the title/name of the 19th-century founder of the Bahá’í Faith.","zh":"Bahá’u’lláh（巴哈欧拉）是19世纪巴哈伊信仰创立者的尊号/称名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bahá’u’lláh: the title/name of Mírzá Ḥusayn-‘Alí Núrí (1817–1892), the Prophet-Founder of the Bahá’í Faith, whose writings and teachings are central to that religion.","zh":"巴哈欧拉（Bahá’u’lláh）：米尔扎·侯赛因-阿里·努里（1817–1892）的尊号/称名，被巴哈伊信仰奉为创立者与先知，其著作与教导是该宗教的核心。"},"examples":[{"en":"Many Bahá’ís read passages from Bahá’u’lláh’s writings in daily prayer.","zh":"许多巴哈伊信徒会在每日祈祷时诵读巴哈欧拉著作中的段落。"},{"en":"Bahá’u’lláh taught about the unity of humanity and the importance of peace.","zh":"巴哈欧拉教导人类一体与和平的重要性。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension) the sacred figure referred to in Bahá’í texts and community life, often mentioned with honorific language.","zh":"（引申）在巴哈伊经典与社群生活中被尊称与敬称的神圣人物。"},"examples":[{"en":"In the meeting, someone quoted Bahá’u’lláh to encourage kindness.","zh":"在聚会中，有人引用巴哈欧拉的话来鼓励善意。"}]}],"synonyms":["Bahá’u’lláh","Baha'u'llah","Prophet-Founder of the Bahá’í Faith"],"phonetic":"/bəˈhɑːʊˌlɑː/","extraExplanation":["“Bahá’u’lláh”是阿拉伯语/波斯语语境中的尊号，常被解释为“上帝的荣耀”（Glory of God）。英文写法里常见重音符号与撇号（Bahá’u’lláh），用于更接近原语发音；日常写作中也有人简写为Bahaullah或Baha'u'llah。","在英语文章里，这个词通常当作专有名词使用；许多正式宗教写作会在其名字后加上敬语（如“Bahá’u’lláh wrote…”并配合尊敬语气），属于文化与宗教礼仪的一部分。"]}
{"word":"Bahawalpur","summary":{"en":"Bahawalpur is a city in Punjab, Pakistan, and historically it was the capital of the former State of Bahawalpur.","zh":"Bahawalpur（巴哈瓦尔布尔）是巴基斯坦旁遮普省的一座城市；历史上曾是巴哈瓦尔布尔土邦的首府。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in Punjab province, Pakistan, known for its historic palaces, desert landscapes nearby (the Cholistan Desert), and as a regional cultural and educational center.","zh":"巴哈瓦尔布尔：巴基斯坦旁遮普省的一座城市，以历史宫殿、邻近的乔里斯坦沙漠景观，以及区域性的文化与教育中心而闻名。"},"examples":[{"en":"Bahawalpur is a major city in southern Punjab, Pakistan.","zh":"巴哈瓦尔布尔是巴基斯坦旁遮普省南部的重要城市。"},{"en":"Many visitors use Bahawalpur as a gateway to explore the Cholistan Desert.","zh":"许多游客把巴哈瓦尔布尔当作探索乔里斯坦沙漠的门户。"}]},{"partOfSpeech":"n.","definition":{"en":"Historically, the capital of the former princely state (the State of Bahawalpur) during the British colonial period in South Asia.","zh":"历史上指“巴哈瓦尔布尔土邦/土王国”的首府（英属印度时期南亚的一个藩属土邦）。"},"examples":[{"en":"Before joining Pakistan, the State of Bahawalpur had Bahawalpur as its capital.","zh":"在并入巴基斯坦之前，巴哈瓦尔布尔土邦以巴哈瓦尔布尔为首府。"}]}],"synonyms":["(no direct synonyms; related: Punjab, Pakistan, Cholistan Desert)"],"phonetic":"/bəˈhɑːwəlpʊr/","extraExplanation":["“Bahawalpur”是乌尔都语/旁遮普语语境中常见的地名拼写；英文新闻与旅游资料中多以该拼写出现。","城市周边常被提及的文化地标包括努尔玛哈尔（Noor Mahal）等宫殿建筑；相关旅游语境里也常与“Cholistan Desert（乔里斯坦沙漠）”一起出现。"]}
{"word":"bahawder","summary":{"en":"“Bahawder” is usually a variant spelling of *bahadur*: a South Asian honorific meaning “brave/hero,” often used in historical titles and names.","zh":"“bahawder”通常是 *bahadur* 的一种异拼：南亚历史语境中的荣誉称号，意为“勇敢/英雄”，常见于头衔或姓名中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asia, historical) A title of honor meaning “brave” or “hero,” used for respected soldiers, nobles, or officials in the Mughal and British Indian periods.","zh":"（南亚，历史用语）荣誉称号，意为“勇敢的／英雄的”，在莫卧儿时期及英属印度时期用于称呼受尊敬的军人、贵族或官员。"},"examples":[{"en":"In old records, he is listed as “Khan Bahadur” for his service.","zh":"在旧档案里，他因服役有功被记载为“Khan Bahadur（汗·巴哈杜尔）”。"},{"en":"The officer was addressed as “Bahadur” as a mark of respect.","zh":"人们以“Bahadur（巴哈杜尔）”称呼那位军官，以示尊敬。"}]},{"partOfSpeech":"adj.","definition":{"en":"Brave; courageous. (Often used as an epithet or part of a name/title rather than in everyday conversation.)","zh":"勇敢的；英勇的。（常作头衔/称号或名字的一部分，而非日常口语常用形容词。）"},"examples":[{"en":"The story praises the bahadur warrior who protected his village.","zh":"故事赞颂那位保护村庄的英勇战士。"}]}],"synonyms":["brave","heroic","valiant","honorific title"],"phonetic":"/ˈbɑːhəˌdʊr/","extraExplanation":["你写的 **bahawder** 常见于对南亚词 **bahadur/bahadar** 的不同拼写（音译差异）。在英语材料里更常见的拼写是 **bahadur**，也常出现在复合头衔里，如 **Khan Bahadur**、**Rai Bahadur** 等，属于特定历史语境用语。"]}
{"word":"bahay","summary":{"en":"“bahay” is a Tagalog word meaning “house/home.”","zh":"“bahay”是他加禄语，意思是“房子/家”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Tagalog) a house; a home (the place where someone lives).","zh":"（他加禄语/菲律宾语）房子；家（人居住的地方）。"},"examples":[{"en":"Nasa bahay ako ngayon.","zh":"我现在在家。"},{"en":"Malaki ang bahay nila.","zh":"他们的房子很大。"},{"en":"Uuwi na ako sa bahay.","zh":"我就要回家了。"}]}],"synonyms":["house","home"],"phonetic":"/bɑˈhaɪ/","extraExplanation":["“bahay”是菲律宾（他加禄语）里最常见的“房子/家”一词。口语里常见搭配：\n- “sa bahay”= 在家\n- “umuwi”/“uuwi”= 回家（动词），如 “Uuwi na ako.”（我该回家了。）\n读音上通常重音在第二音节：ba-HAY。"]}
{"word":"bahera","summary":{"en":"Bahera is a South Asian term for a tropical tree (Terminalia bellirica) and especially its dried medicinal fruit used in Ayurveda.","zh":"Bahera 是南亚常用词，指一种热带树（Terminalia bellirica）及其常用于阿育吠陀的药用干果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In South Asian English) a large tropical tree (Terminalia bellirica) and its medicinal fruit, used especially in Ayurveda.","zh":"（南亚英语）诃子属的一种热带大树（Terminalia bellirica，诃子/毗诃梨树）及其药用果实，尤用于阿育吠陀（Ayurveda）等传统医学。"},"examples":[{"en":"The clinic sells bahera powder as a traditional herbal supplement.","zh":"这家诊所有卖 bahera 粉，作为传统草本补充品。"},{"en":"In some Ayurvedic recipes, bahera is combined with other fruits to support digestion.","zh":"在一些阿育吠陀配方里，bahera 会和其他果实一起搭配，用于帮助消化。"}]},{"partOfSpeech":"n.","definition":{"en":"The dried fruit of the bahera tree used as an ingredient in herbal medicine.","zh":"（特指）bahera 树的干燥果实，用作草药成分。"},"examples":[{"en":"The label lists bahera as one of the main ingredients.","zh":"标签上写着 bahera 是主要成分之一。"},{"en":"She added a small amount of bahera to the mixture.","zh":"她在混合物里加了一点 bahera。"}]}],"synonyms":["baheda","bibhitaki","beleric myrobalan","Terminalia bellirica"],"phonetic":"/bəˈhɛrə/","extraExplanation":["“Bahera”常见于印度/南亚草药语境，也常拼作 baheda / bahada；在英语草药市场上有时会写作 “beleric myrobalan”。","它常与 amla（余甘子）和 haritaki（诃黎勒）一起组成著名的阿育吠陀配方 Triphala（“三果”）。","作为外来词，其读音与拼写在不同地区可能不一致；若你是从某个包装、文章或姓名里看到它，也可能是人名/地名的转写。"]}
{"word":"Bahia","summary":{"en":"Bahia is a state in northeastern Brazil (capital: Salvador) and can also be an older name for Salvador.","zh":"Bahia（巴伊亚）是巴西东北部的一个州（首府：萨尔瓦多），也可在旧文献中指萨尔瓦多。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a state in northeastern Brazil, on the Atlantic coast; its capital is Salvador.","zh":"巴西东北部的一个州，濒临大西洋；首府为萨尔瓦多（Salvador）。"},"examples":[{"en":"She traveled through Bahia to experience Afro-Brazilian culture and music.","zh":"她穿行在巴伊亚州，去体验非裔巴西人的文化和音乐。"},{"en":"Bahia’s capital, Salvador, is famous for its colorful historic center.","zh":"巴伊亚州首府萨尔瓦多以色彩斑斓的历史城区而闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) a name once used for Salvador, Brazil, especially in older texts.","zh":"（历史用法）在较早的文本中，“Bahia”曾被用来指巴西城市萨尔瓦多。"},"examples":[{"en":"In some older writings, “Bahia” refers to what we now call Salvador.","zh":"在一些旧文献中，“Bahia”指的就是今天的萨尔瓦多。"}]}],"synonyms":["State of Bahia (Brazil)"],"phonetic":"/bəˈhiːə/","extraExplanation":["“Bahia”来自葡萄牙语，和“baía（海湾）”同源。历史上该地区与“Baía de Todos os Santos（万圣湾）”关系密切，因此在英文里也常见到与海湾相关的解释或背景。","在文化语境中，Bahia常让人联想到巴西非裔文化（如坎东布雷宗教传统、卡波耶拉、桑巴与阿谢音乐等）以及殖民时期的历史建筑与节庆。"]}
{"word":"bahiaite","summary":{"en":"Bahiaite is a rare mineral whose name comes from Bahia, Brazil.","zh":"Bahiaite 是一种稀有矿物，名称源自巴西的巴伊亚州。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral named after the state of Bahia in Brazil.","zh":"（矿物）巴伊亚石：一种以巴西巴伊亚州（Bahia）命名的稀有矿物。"},"examples":[{"en":"Bahiaite is named for Bahia, Brazil, where it was first identified.","zh":"Bahiaite 以巴西的巴伊亚州命名，因为它最初在当地被鉴定出来。"},{"en":"The museum’s mineral collection includes a small specimen labeled “bahiaite.”","zh":"这家博物馆的矿物收藏中有一小块标注为“bahiaite”的标本。"}]}],"phonetic":"/bəˈhi.aɪt/","extraExplanation":["“-ite”是矿物名称中很常见的后缀，通常表示“某某石/某某矿物”。因此 bahia + -ite 字面上就是“巴伊亚（地方名）+ 矿物后缀”。","由于它是较冷门的矿物名，在一般英语语境中很少出现，更多见于矿物学、地质学资料、标本标签或学术文章中。"]}
{"word":"Bahima","summary":{"en":"Bahima refers to an ethnic community in southwestern Uganda, traditionally linked to cattle herding, and can also describe things related to them.","zh":"Bahima指乌干达西南部的巴希马族群（传统与牧牛文化相关），也可作形容词表示“与巴希马人有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of people (an ethnic community) in southwestern Uganda, traditionally associated with cattle herding; also called the Hima.","zh":"（乌干达西南部的）巴希马人/巴希马族；传统上与牧牛文化相关的族群，也常称为Hima。"},"examples":[{"en":"The Bahima are often described in histories of the Ankole region.","zh":"巴希马人常出现在关于安科勒地区的历史记载中。"},{"en":"Some Bahima families have traditionally kept large cattle herds.","zh":"一些巴希马家庭传统上饲养大量牛群。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Bahima people or their culture.","zh":"与巴希马人或其文化有关的；巴希马人的。"},"examples":[{"en":"He studied Bahima pastoral traditions and local storytelling.","zh":"他研究了巴希马人的游牧传统和当地口述故事。"}]}],"synonyms":["Hima","Abahima (variant)"],"phonetic":"/bəˈhiːmə/","extraExplanation":["“Bahima”常被当作复数族名使用（类似“the Maasai”）；单数有时写作“Muhima”，语言/地区不同也会有拼写差异。","在东非语境中，族群称呼有时会牵涉历史与社会身份（例如与“Ankole/Banyankole”等群体关系），写作或交流时建议尊重当事人自称与当地用法。"]}
{"word":"bahima","summary":{"en":"“Bahima” is usually a transliteration of Arabic bahīmah, meaning an animal/beast, especially livestock; it’s not a common everyday English word.","zh":"“Bahima”通常是阿拉伯语 bahīmah 的音译，指动物/牲畜；并非英语日常常用词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a borrowed word (from Arabic, often written as bahīmah) meaning an animal or beast, especially livestock or a domesticated four-legged animal.","zh":"外来词（源自阿拉伯语，常写作 bahīmah），意思是“动物/牲畜”，尤指家养的四足动物或畜牧业中的牲口。"},"examples":[{"en":"In some Islamic texts, the word bahīmah refers to domesticated animals such as cattle, sheep, or goats.","zh":"在一些伊斯兰文本中，bahīmah 可指牛、羊、山羊等家畜。"},{"en":"The phrase bahīmat al-an‘ām is often translated as “the cattle/livestock.”","zh":"短语 bahīmat al-an‘ām 常被译为“牲畜/家畜”。"}]},{"partOfSpeech":"other","definition":{"en":"a personal or place name in some regions (usage varies); not a standard modern English vocabulary word.","zh":"在某些地区也可能作为人名或地名出现（用法不一）；并非标准现代英语词汇。"},"examples":[{"en":"I’m not sure what “Bahima” refers to here—could it be a person’s name or a place?","zh":"我不确定这里的“Bahima”指什么——可能是人名或地名吗？"}]}],"synonyms":["livestock","cattle","animal","beast"],"phonetic":"/bɑːˈhiːmə/","extraExplanation":["“bahima/bahīmah”更常见于把阿拉伯语音译到英文的语境中，而不是英语母语者日常使用的词。不同书写（bahima, bahīmah, bahimah）通常是因为不同的音译系统。","如果你本来想查的是英文单词 behemoth（巨兽、庞然大物）或 Brahma（梵天/婆罗门相关），告诉我上下文或句子，我可以帮你确认正确拼写与含义。"]}
{"word":"bahisti","summary":{"en":"“bahisti” isn’t recognized as a standard English word; context is needed to identify it.","zh":"“bahisti”不是标准英语词；需要上下文才能确认其含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name, or a word from another language (for example, Turkish).","zh":"不是标准英语单词。它可能是拼写错误、人名/地名，或来自其他语言（例如土耳其语）。"},"examples":[{"en":"I couldn’t find “bahisti” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里找不到“bahisti”，你能把它出现的句子发我吗？"},{"en":"If it’s Turkish, it may relate to “bahis” (a bet), but I need context to be sure.","zh":"如果它是土耳其语，可能与“bahis”（赌注/打赌）有关，但我需要上下文才能确定。"}]}],"extraExplanation":["“bahisti”很可能不是英语词汇。如果你是从某段文字里看到的，请提供完整句子或来源（书/网站/聊天记录），我可以帮你判断它是拼写错误、专有名词，还是外来语。","如果你想查的是英语里类似拼写的词，也请告诉我你想表达的意思（例如：押注、辩论、支持者、恐怖分子等），我可以给出最接近的英文词及用法。"]}
{"word":"Bahmad","summary":{"en":"“Bahmad” is most commonly a proper name (a person’s name) rather than an English vocabulary word.","zh":"“Bahmad”最常见是专有名词（人名），而不是英语词汇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a personal name (given name or family name). In English contexts, it is usually treated as a proper noun and capitalized.","zh":"人名（名字或姓氏）。在英语语境中通常作为专有名词使用，并且要大写。"},"examples":[{"en":"Bahmad introduced himself at the meeting.","zh":"Bahmad 在会议上做了自我介绍。"},{"en":"I received an email from Ms. Bahmad.","zh":"我收到了 Bahmad 女士的邮件。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a place name or organization name, depending on context.","zh":"（较少见）地名或机构名，具体取决于语境。"},"examples":[{"en":"The report mentioned Bahmad as a local partner.","zh":"报告中提到 Bahmad 是当地合作方。"}]}],"synonyms":["(no direct synonyms; it’s a name)"],"phonetic":"/bəˈmɑd/","extraExplanation":["“Bahmad”并不是常见的英语词汇，更常见的是作为人名出现；不同地区可能有不同拼写与发音习惯。","如果这是你在文章/对话里看到的词，请告诉我完整句子或它出现的国家/语言背景，我可以更准确地判断它是名字、地名还是缩写。"]}
{"word":"Bahmani","summary":{"en":"Bahmani refers to the Bahmani Sultanate (1347–1527) in India’s Deccan region, or anything connected to it.","zh":"Bahmani 指印度德干地区的巴赫马尼苏丹国（约1347—1527年），也可指与其相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(history) A medieval Muslim dynasty and state in the Deccan (south-central India), ruling roughly from 1347 to 1527; also called the Bahmani Sultanate.","zh":"（历史）巴赫马尼王朝/巴赫马尼苏丹国：中世纪时期位于印度德干地区（印度中南部）的伊斯兰王朝与政权，约统治于1347年至1527年。"},"examples":[{"en":"The Bahmani Sultanate helped shape the culture and architecture of the Deccan.","zh":"巴赫马尼苏丹国对德干地区的文化与建筑产生了重要影响。"},{"en":"After the Bahmani state weakened, several smaller sultanates rose in its place.","zh":"巴赫马尼政权衰落后，多个较小的苏丹国在其旧地崛起。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the Bahmani dynasty or its culture, art, language, or period.","zh":"（形容词）与巴赫马尼王朝有关的；巴赫马尼时期的（文化、艺术、语言等）。"},"examples":[{"en":"The museum displays Bahmani coins and inscriptions.","zh":"博物馆展出了巴赫马尼时期的硬币和铭文。"},{"en":"Researchers study Bahmani-era forts across the Deccan plateau.","zh":"研究者在德干高原各地考察巴赫马尼时期的堡垒。"}]}],"synonyms":["Bahmanid","Bahmani Sultanate"],"phonetic":"/bɑːˈmɑːni/","extraExplanation":["“Bahmani”常见于历史与艺术史语境，尤其与德干地区的伊斯兰建筑、宫廷文化和波斯语影响相关。","在英文写作中也会看到拼写变体或相关形式，如 Bahmanid（巴赫马尼的、巴赫马尼王朝的），多用于学术文献或地图/博物馆说明。"]}
{"word":"bahmani","summary":{"en":"Bahmani refers to the Bahmani Sultanate (a Deccan kingdom in India, 14th–16th centuries) and related people, culture, and historical items.","zh":"Bahmani 指巴赫曼尼苏丹国（印度德干地区14—16世纪的政权）及其相关人物、文化与历史遗存。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Bahmani Sultanate, a Muslim-ruled kingdom in the Deccan region of India (14th–16th centuries).","zh":"与巴赫曼尼苏丹国有关的；指印度德干地区（14—16世纪）的一个穆斯林王朝/国家。"},"examples":[{"en":"Bahmani architecture influenced later Deccan styles.","zh":"巴赫曼尼建筑影响了后来德干地区的建筑风格。"},{"en":"The city became important during the Bahmani period.","zh":"这座城市在巴赫曼尼时期变得重要。"}]},{"partOfSpeech":"n.","definition":{"en":"A ruler, subject, or person connected with the Bahmani Sultanate; also used for things (coins, art, records) from that state.","zh":"巴赫曼尼苏丹国的统治者/臣民/相关人物；也可指该国时期的事物（如钱币、艺术品、文献）。"},"examples":[{"en":"The museum has a collection of Bahmani coins.","zh":"博物馆收藏了一批巴赫曼尼钱币。"},{"en":"Historians compare the Bahmanis with neighboring Deccan powers.","zh":"历史学家会把巴赫曼尼人（或巴赫曼尼政权）与周边德干势力作比较。"}]}],"synonyms":["Deccan (contextual)","Deccan Sultanates (related term)"],"phonetic":"/bɑːˈmɑːni/","extraExplanation":["“Bahmani”通常见于历史与艺术史语境，最常指“Bahmani Sultanate（巴赫曼尼苏丹国，约1347–1527）”。它在德干地区的政治与文化发展中很关键，后来分裂出若干“德干苏丹国（Deccan Sultanates）”，对建筑（如拱券、陵墓、清真寺）与波斯文化传统在南亚的传播有影响。","词形上常见搭配：Bahmani Sultanate（苏丹国）、Bahmani dynasty（王朝）、Bahmani period（时期）、Bahmani architecture（建筑）、Bahmani coinage（铸币）。"]}
{"word":"Bahmanid","summary":{"en":"“Bahmanid” means connected with the Bahmani Sultanate in the Deccan (India) or a person associated with it.","zh":"“Bahmanid”指与印度德干的巴赫曼尼苏丹国有关，或指与该政权相关的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Bahmani Sultanate (a Muslim-ruled kingdom in the Deccan region of India, 14th–16th centuries).","zh":"与巴赫曼尼苏丹国（印度德干地区的穆斯林王朝/政权，14—16世纪）有关的。"},"examples":[{"en":"Bahmanid architecture often features large domes and ornate arches.","zh":"巴赫曼尼时期的建筑常见大型穹顶与精美拱门。"},{"en":"The map shows several Bahmanid fortifications across the Deccan plateau.","zh":"地图显示德干高原上分布着多处巴赫曼尼时期的防御工事。"}]},{"partOfSpeech":"n.","definition":{"en":"a person (especially a ruler or subject) connected with the Bahmani Sultanate.","zh":"巴赫曼尼苏丹国相关的人（尤指其统治者或臣民）。"},"examples":[{"en":"The chronicle describes the policies of a Bahmanid ruler.","zh":"史书描述了一位巴赫曼尼统治者的政策。"},{"en":"Merchants, scholars, and Bahmanids interacted in the Deccan’s cosmopolitan cities.","zh":"在德干的多元城市中，商人、学者与巴赫曼尼人彼此往来。"}]}],"synonyms":["Bahmani (more common)","Deccan (contextual)"],"phonetic":"/bɑːmɑːˈnɪd/","extraExplanation":["“Bahmanid”源自“Bahmani（巴赫曼尼）”，常用于历史研究中指巴赫曼尼苏丹国及其时代的文化、建筑与政治。该政权后来分裂为若干“德干苏丹国”（Deccan Sultanates），因此在阅读史料时也常看到它与这些后继国家并列出现。"]}
{"word":"bahmanid","summary":{"en":"Bahmanid refers to the Bahmani Sultanate dynasty in the Deccan (southern India) and things or people connected to it.","zh":"Bahmanid 指与印度南部德干地区的巴赫马尼苏丹国（巴赫曼王朝）及其相关人物或事物有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often capitalized) Relating to the Bahmanids, the Muslim dynasty (the Bahmani Sultanate) that ruled much of the Deccan in southern India in the 14th–16th centuries.","zh":"（常大写）与巴赫曼王朝/巴赫马尼苏丹国有关的；指14—16世纪统治印度南部德干地区的重要穆斯林王朝。"},"examples":[{"en":"Bahmanid rulers helped make the Deccan a major center of Indo-Islamic culture.","zh":"巴赫曼王朝的统治者推动德干地区成为印伊斯兰文化的重要中心。"},{"en":"The fort’s architecture shows strong Bahmanid influence.","zh":"这座堡垒的建筑体现出明显的巴赫曼王朝风格影响。"}]},{"partOfSpeech":"n.","definition":{"en":"A member, ruler, or supporter of the Bahmanid dynasty; a person connected with the Bahmani Sultanate.","zh":"巴赫曼王朝的人；巴赫马尼苏丹国的成员、统治者或支持者；与该王朝有关的人。"},"examples":[{"en":"Some Bahmanids later served in successor states after the sultanate weakened.","zh":"在苏丹国衰落后，一些巴赫曼王朝相关人物后来在继承政权中任职。"},{"en":"The chronicle mentions a Bahmanid who commissioned a new mosque.","zh":"史书提到一位巴赫曼王朝人物主持修建了一座新清真寺。"}]}],"synonyms":["Bahmani (adj./n.)","of the Bahmani Sultanate"],"phonetic":"/bɑːhˈmɑːnɪd/","extraExplanation":["“Bahmanid”来自“Bahmani”（巴赫马尼），常用于历史与艺术史语境，尤其讨论德干地区的伊斯兰政治、建筑与文学传统。","学习时可同时记：Bahmani Sultanate（巴赫马尼苏丹国/巴赫曼王朝政权）、Deccan（德干高原）。"]}
{"word":"Bahner","summary":{"en":"“Bahner” is usually a surname; less commonly it can mean a railway worker in German-related contexts.","zh":"“Bahner”通常是姓氏；在与德语相关的语境中较少见地可指“铁路员工”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"姓氏；家族姓（常见于英语语境中的姓）"},"examples":[{"en":"Dr. Bahner will speak at the conference tomorrow.","zh":"Bahner 医生将于明天在会议上发言。"},{"en":"My teacher’s last name is Bahner.","zh":"我老师的姓是 Bahner。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common; from German) a railway worker; someone connected with railways.","zh":"（较少见；源自德语）铁路员工；与铁路工作相关的人"},"examples":[{"en":"In older German usage, a Bahner might be someone who works for the railway.","zh":"在较早的德语用法里，Bahner 可能指在铁路部门工作的人。"},{"en":"The character is described as a Bahner, proud of his job on the trains.","zh":"这个角色被描写为一名 Bahner，对自己在列车上的工作感到自豪。"}]}],"phonetic":"/ˈbɑnɚ/","extraExplanation":["“Bahner”在英语里最常见是姓氏。它可能与德语词根有关：Bahn 表示“铁路/轨道”，因此 Bahner 在德语语境中可指“铁路系统从业者”。","英文中遇到 Bahner 时，多半不需要翻译成普通名词；在写作或引用人名时通常保持原拼写，并按英语习惯读音。"]}
{"word":"bahnung","summary":{"en":"“Bahnung” is a German term most often used in neuroscience/psychology to mean facilitation—prior activity makes a later response more likely or stronger.","zh":"“Bahnung”是德语词，在神经科学/心理学中多指“易化/促通”——先前活动让后续反应更容易发生或更强。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(German; neuroscience/psychology) facilitation: making a neural pathway or response more likely/stronger because of prior activity (similar to priming).","zh":"（德语；神经科学/心理学）易化/促通：由于先前的活动，使某条神经通路或反应更容易发生、更强。"},"examples":[{"en":"In this model, repeated stimulation causes Bahnung, so the reflex becomes stronger over time.","zh":"在这个模型中，反复刺激会产生 Bahnung，因此反射会随着时间变得更强。"},{"en":"Researchers discussed Bahnung to explain why a cue speeds up later recognition.","zh":"研究者用 Bahnung 来解释为什么一个线索会加快之后的识别。"}]},{"partOfSpeech":"n.","definition":{"en":"(German; general/literary) the act of paving the way or creating a path/route (less common in English texts; usually appears in translated or academic writing).","zh":"（德语；一般/文学）“开路/铺路、开辟路径”的行为（在英文中较少见，多见于翻译或学术语境）。"},"examples":[{"en":"The author uses Bahnung as a metaphor for “paving the way” toward modern ideas.","zh":"作者用 Bahnung 作隐喻，表示“为现代观念铺路”。"}]}],"synonyms":["facilitation","priming","sensitization","paving the way"],"phonetic":"/ˈbɑːnʊŋ/","extraExplanation":["“Bahnung”来自德语“Bahn”（轨道、道路、路线），字面有“开辟道路/铺设通道”的意思；因此在神经科学中很自然地借来指“让某条通路更畅通、更容易被激活”。","在英文文献里，它常被直接译为“facilitation（易化/促通）”或与“priming（启动）”并提；如果你是在读神经生理或心理学论文，通常把它理解为“先前刺激提高后续反应概率/强度”。"]}
{"word":"baho","summary":{"en":"“baho” is an informal Tagalog/Filipino word meaning “stink/bad smell,” used especially in Filipino English contexts.","zh":"“baho”是他加禄语/菲律宾语的口语词，表示“臭味/很臭”，常见于菲律宾英语语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Tagalog/Filipino, informal) a bad smell; stink.","zh":"（他加禄语/菲律宾语，口语）臭味；臭气。"},"examples":[{"en":"Baho! Something in the fridge is spoiled.","zh":"好臭！冰箱里有东西坏了。"},{"en":"The trash started to smell—ang baho.","zh":"垃圾开始发臭了——好“baho”。"}]},{"partOfSpeech":"v.","definition":{"en":"(Tagalog/Filipino, informal) to smell bad; to stink.","zh":"（他加禄语/菲律宾语，口语）发臭；很臭。"},"examples":[{"en":"Your shoes smell bad—baho na.","zh":"你的鞋子很臭——都“baho”了。"},{"en":"If you leave the fish out, it will stink.","zh":"如果把鱼放在外面不冷藏，它会发臭。"}]}],"synonyms":["stink","bad smell","smelly"],"phonetic":"/ˈbɑhoʊ/","extraExplanation":["“baho”主要是菲律宾（尤其是他加禄语）里的常用口语词，常见于日常吐槽“好臭”。在英语对话中，多出现在菲律宾英语或与菲律宾文化相关的语境里，常与“ang”（定冠词，类似“the”）搭配，如“Ang baho!”=“好臭！”","发音在英语里常被近似读成 /ˈbɑhoʊ/（重音在前），但不同地区可能略有差异。"]}
{"word":"bahoe","summary":{"en":"“bahoe” isn’t a standard English word; it most likely means “bayou,” a slow, marshy waterway in the southern U.S.","zh":"“bahoe”不是标准英语词；它很可能指“bayou”，即美国南部常见的缓慢、沼泽化水道。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Probably a misspelling of “bayou”: a slow-moving stream or marshy channel, especially in the southern U.S. (notably Louisiana).","zh":"很可能是“bayou”的拼写错误：指缓慢流动的小河道或沼泽水道，尤指美国南部（尤其路易斯安那）。"},"examples":[{"en":"They took a boat through the bayou at sunrise.","zh":"他们在日出时乘船穿过沼泽水道。"},{"en":"The house sits near a bayou, so mosquitoes are common in summer.","zh":"这房子靠近一条沼泽水道，所以夏天蚊子很多。"}]}],"synonyms":["stream","marsh channel","slough (regional)"],"phonetic":"/ˈbaɪ.uː/","extraExplanation":["“bayou”一词常与美国南部的湿地文化联系在一起，尤其是路易斯安那的法裔/克里奥尔文化与卡津（Cajun）地区。","在文学与影视中，bayou 常被用来营造“湿热、神秘、野性”的氛围（例如描写沼泽、鳄鱼、浓密水草等意象）。"]}
{"word":"bahoo","summary":{"en":"bahoo: a South Asian term meaning “daughter-in-law,” often spelled “bahu.”","zh":"bahoo：南亚语境词，意为“儿媳”，更常见拼写为 bahu。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English) A daughter-in-law (the wife of one’s son), especially in Indian family contexts.","zh":"（南亚英语）儿媳；儿子的妻子（尤用于印度等南亚家庭语境）。"},"examples":[{"en":"In many Indian families, the bahoo may live with her husband’s parents after marriage.","zh":"在许多印度家庭里，儿媳（bahoo/bahu）结婚后可能会和丈夫的父母同住。"},{"en":"The drama focuses on tensions between the mother-in-law and the bahoo.","zh":"这部电视剧聚焦婆婆和儿媳之间的矛盾。"}]},{"partOfSpeech":"other","definition":{"en":"A less common spelling of “bahu,” seen in transliteration from Hindi/Urdu and related languages.","zh":"“bahu”的一种不太常见拼写，常见于从印地语/乌尔都语等语言音译到英文时。"},"examples":[{"en":"You may also see it written as bahu, bahoo, or bahooji in informal romanization.","zh":"在非正式的拉丁字母拼写里，你可能会看到 bahu、bahoo，甚至 bahooji 等写法。"}]}],"synonyms":["daughter-in-law","bahu"],"phonetic":"/ˈbɑːhuː/","extraExplanation":["“bahu/बाहू”在印地语等语言里指“儿媳”。在英语中多作为文化语境词使用，常见于描述印度家庭关系、电视剧（如家庭伦理剧）或移民社区叙事。","拼写“bahoo”通常是把长音“uː”用“oo”表示的音译习惯；更常见、较标准的英文转写是“bahu”。"]}
{"word":"Bahr","summary":{"en":"Bahr is mainly used as an Arabic word meaning “sea,” and it can also be a surname in English.","zh":"Bahr 主要用作源自阿拉伯语的词，意思是“海”，也可以是英语中的姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Arabic) the sea; a large body of salt water.","zh":"（源自阿拉伯语）海；大片咸水水域。"},"examples":[{"en":"In Arabic, bahr means “sea,” as in “Bahr al-Ahmar” (the Red Sea).","zh":"在阿拉伯语里，bahr 的意思是“海”，例如 “Bahr al-Ahmar”（红海）。"},{"en":"The word bahr appears in some place names and titles across the Middle East.","zh":"bahr 这个词会出现在中东一些地名和称号中。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname), used in English for some people and families.","zh":"姓氏（人名/家族名），英语中有些人使用。"},"examples":[{"en":"Ms. Bahr will present the report this afternoon.","zh":"Bahr 女士将在今天下午汇报。"},{"en":"I saw the name Bahr on the conference schedule.","zh":"我在会议日程上看到了 Bahr 这个名字。"}]}],"synonyms":["sea","ocean"],"phonetic":"/bɑr/","extraExplanation":["Bahr（بحر）在阿拉伯语中非常常见，除了“海”以外，在一些文学或修辞语境里也可引申为“广阔、无边无际”。","它常用于专名：例如“Bahr al-Ahmar”（红海），以及若干地名/称号组合。作为姓氏时，发音往往会随家庭或地区习惯而略有不同。"]}
{"word":"Bahrain","summary":{"en":"Bahrain is a small Middle Eastern island country in the Persian Gulf; its capital is Manama.","zh":"巴林是位于波斯湾的中东小型岛国，首都是麦纳麦。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small island country in the Persian Gulf (Middle East), officially called the Kingdom of Bahrain, with Manama as its capital.","zh":"巴林：位于波斯湾（中东）的小型岛国，官方名称为“巴林王国”，首都为麦纳麦（Manama）。"},"examples":[{"en":"My friend moved to Bahrain for a job in finance.","zh":"我的朋友为了金融行业的工作搬去了巴林。"},{"en":"Bahrain is connected to Saudi Arabia by the King Fahd Causeway.","zh":"巴林通过法赫德国王大桥与沙特阿拉伯相连。"},{"en":"The Formula 1 Bahrain Grand Prix is held at the Bahrain International Circuit.","zh":"F1巴林大奖赛在巴林国际赛道举行。"}]}],"synonyms":["Kingdom of Bahrain"],"phonetic":"bɑːˈreɪn","extraExplanation":["“Bahrain”是专有名词，英语里常与定冠词连用的情况较少（通常直接说“Bahrain”），但正式国名可说“the Kingdom of Bahrain”。","形容词/国籍常用“Bahraini”（巴林的；巴林人）。例如：Bahraini culture（巴林文化），a Bahraini student（巴林学生）。","词源上常被认为与阿拉伯语“双海/两片海”的说法有关（常见解释），在介绍地理与历史时可能会提到。"]}
{"word":"Bahrein","summary":{"en":"“Bahrein” is an uncommon/older spelling of Bahrain, a country in the Persian Gulf.","zh":"“Bahrein”是 Bahrain（巴林）的不常见或较旧拼写，指波斯湾的国家巴林。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A less common spelling of Bahrain, an island country in the Persian Gulf (Middle East).","zh":"Bahrain（巴林）的较少见拼写；巴林是波斯湾（中东）的一个岛国。"},"examples":[{"en":"Some older maps spell Bahrain as “Bahrein.”","zh":"一些较早的地图会把 Bahrain 拼写成 “Bahrein”。"},{"en":"He worked in Bahrain (sometimes written “Bahrein” in older texts).","zh":"他在巴林工作（在一些旧资料里也可能写作 “Bahrein”）。"}]}],"synonyms":["Bahrain"],"phonetic":"/bɑːˈreɪn/","extraExplanation":["“Bahrein”多见于较旧的英文资料，或受德语/法语等转写习惯影响的拼法；现代英语中标准拼写通常是 “Bahrain”。","在正式写作、新闻、护照/签证、学术引用中，建议使用标准拼写 “Bahrain”。若需要形容词形式，常用 “Bahraini”（巴林的；巴林人）。"]}
{"word":"baht","summary":{"en":"“Baht” is the currency unit of Thailand.","zh":"“baht”指泰国的货币单位（泰铢）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The basic unit of money in Thailand.","zh":"泰国的货币单位（基本货币单位）。"},"examples":[{"en":"How many baht is this street food?","zh":"这份街头小吃多少钱（多少泰铢）？"},{"en":"I exchanged 100 dollars into baht at the airport.","zh":"我在机场把100美元换成了泰铢。"},{"en":"The hotel costs 2,000 baht per night.","zh":"这家酒店每晚2000泰铢。"}]}],"synonyms":["Thai baht","THB"],"phonetic":"/bɑt/","extraExplanation":["“baht”是泰国的官方货币单位，符号常写作฿，代码是THB（Thai Baht）。在日常用语里，人们会说“baht”来表示金额；更小的单位叫“satang”（萨当），1 baht = 100 satang，但在实际生活中萨当不如以前常见。"]}
{"word":"bahts","summary":{"en":"“Bahts” means multiple baht, the currency units of Thailand.","zh":"“bahts”指多个baht（泰铢），即泰国货币单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of baht; units of Thailand’s currency","zh":"baht（泰铢）的复数；泰国货币单位"},"examples":[{"en":"These noodles cost 60 bahts.","zh":"这份面花了60泰铢。"},{"en":"I exchanged dollars for bahts at the airport.","zh":"我在机场把美元换成了泰铢。"},{"en":"The hotel charges 1,500 bahts per night.","zh":"这家酒店每晚收费1,500泰铢。"}]}],"synonyms":["Thai baht","THB"],"phonetic":"/bɑt/","extraExplanation":["“baht”是泰国货币单位，国际代码常写作THB，符号是“฿”。在实际英语中，金额后面更常见用不变的“baht”（如“60 baht”），但“bahts”也能理解，尤其在强调“许多单位”时会出现。"]}
{"word":"Bahuma","summary":{"en":"“Bahuma” is typically a proper name; its meaning depends on where and how it’s used.","zh":"“Bahuma”通常是专有名词；具体含义取决于使用地点与语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (not a common English vocabulary word). It may be used as a personal name, family name, or place name depending on context.","zh":"专有名词（不是常见英语词汇）。可能用作人名、姓氏或地名，具体含义取决于语境。"},"examples":[{"en":"I saw the name Bahuma on the registration list.","zh":"我在报名名单上看到了 Bahuma 这个名字。"},{"en":"Bahuma is written differently in different documents, so please confirm the correct spelling.","zh":"Bahuma 在不同文件里的拼写不一致，所以请确认正确拼写。"}]}],"phonetic":"/bəˈhuːmə/","extraExplanation":["“Bahuma”不是英语里常见的词条，更像是来自某种语言/文化背景的名字或地名。若你告诉我它出现的国家、语言、句子语境（例如：人名、公司名、村庄名），我可以更准确地解释含义、常见用法与可能的来源。"]}
{"word":"bahuma","summary":{"en":"“bahuma” is not a standard English word; it is most likely a misspelling of “Bahama/Bahamas.”","zh":"“bahuma”不是标准英文词，更可能是“Bahama/Bahamas（巴哈马）”的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A likely misspelling of “Bahama” or “Bahamas,” referring to the Caribbean islands (the Commonwealth of The Bahamas).","zh":"很可能是“Bahama”或“Bahamas”的拼写误写，指加勒比海的巴哈马群岛（巴哈马国）。"},"examples":[{"en":"We’re planning a trip to the Bahamas next winter.","zh":"我们计划明年冬天去巴哈马旅行。"},{"en":"She bought a Bahama-style straw hat at the market.","zh":"她在集市买了一顶巴哈马风格的草帽。"}]}],"synonyms":["Bahamas","Bahama","Bahamian"],"phonetic":"/bəˈhɑːmə/","extraExplanation":["“bahuma”并不是常见或标准的英文单词。更常见的相关词是：Bahama（单数，较少用）与 the Bahamas（复数形式，更常用，用来指国家/群岛）。","发音与拼写提示：Bahamas 重音在第二个音节（ba-HA-mas），写作 Bahamas，不是 *bahuma*。","相关词：Bahamian（巴哈马的；巴哈马人）。"]}
{"word":"bahur","summary":{"en":"“bahur” is usually a proper name or place name, not a common English vocabulary word.","zh":"“bahur”通常是人名或地名，并非英语里的常用词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. Most often seen as a proper name (a person’s name) or a place name (e.g., “Bahur/Bahour” in India).","zh":"不是标准英语单词。最常见的用法是专有名词（人名）或地名（例如印度的“Bahur/Bahour”一带）。"},"examples":[{"en":"Bahur is used as a given name in some cultures.","zh":"“Bahur”在一些文化中可作为名字使用。"},{"en":"We drove through Bahur on the way to Puducherry.","zh":"我们去本地治里的路上开车经过了Bahur。"}]}],"phonetic":"/bəˈhʊr/","extraExplanation":["“bahur”在英语词典里通常查不到，因此更像是音译/拼写变体或专有名词。你可以告诉我它出现的句子或语境（例如人名、地名、歌词/社交媒体用语），我就能更准确判断含义。","如果你想查的是发音相近的英语词，可能是：bather（游泳者/洗澡的人）、bar（酒吧/栏杆）、behave（表现/举止）等；请确认原拼写。"]}
{"word":"bahut","summary":{"en":"“Bahut” most commonly means “very/a lot” in South Asian English; more rarely, it’s a French loanword meaning an ornate chest or cabinet.","zh":"“bahut”最常见于南亚英语，表示“很/非常/很多”；较少见时为法语借词，指一种（常较华丽的）箱柜或储物柜。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(South Asian English; from Hindi/Urdu) “very; a lot; much; many,” used as an intensifier.","zh":"（南亚英语；源自印地语/乌尔都语）“很；非常；很多；许多”，用作强调程度/数量的词。"},"examples":[{"en":"This is bahut important for tomorrow’s exam.","zh":"这对明天的考试非常重要。"},{"en":"We had bahut fun at the wedding.","zh":"我们在婚礼上玩得特别开心。"},{"en":"Bahut people came to the event.","zh":"来了很多人参加活动。"}]},{"partOfSpeech":"n.","definition":{"en":"(Furniture, less common in modern English) A large chest or cabinet, often ornate; originally a French word for a type of coffer/sideboard.","zh":"（家具词；现代英语中较少见）一种大型箱柜/储物柜，常较为华丽；原为法语，指一种柜箱或餐边柜。"},"examples":[{"en":"In the antique shop, a carved bahut stood against the wall.","zh":"在古董店里，一只雕花的 bahut 靠墙摆着。"},{"en":"The museum displayed a 17th‑century bahut with metal fittings.","zh":"博物馆展出了一只带金属包角的17世纪 bahut。"}]}],"synonyms":["very","a lot","so (informal)","many","much","chest","cabinet","coffer"],"phonetic":"/bəˈhuːt/","extraExplanation":["“bahut”在不同语境里来源不同：\n1）在印度、巴基斯坦等地区的英语（South Asian English）中，人们常直接借用印地语/乌尔都语“bahut”（बहुत/بہت），意思是“很/非常/很多”。在口语里很常见。\n2）在较少见的英语家具用法里，“bahut”来自法语，指一种箱柜、柜箱或餐边储物家具，多见于艺术史、古董与博物馆说明文字中。"]}
{"word":"bahuts","summary":{"en":"“Bahuts” means more than one bahut—large chests or cabinets used for storage, often in antique or historical contexts.","zh":"“bahuts”是 bahut 的复数，指多只大型储物箱/柜，常见于古董或历史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of bahut: a large chest or cabinet (often an old-fashioned or antique piece of furniture) used for storage.","zh":"bahut 的复数：大箱子或储物柜（常指旧式或古董家具），用于存放物品。"},"examples":[{"en":"The museum displayed several carved bahuts from the 18th century.","zh":"博物馆展出了几只18世纪的雕花 bahut（大箱柜）。"},{"en":"They kept blankets and winter clothes in the bahuts in the hallway.","zh":"他们把毯子和冬衣放在走廊里的 bahut（储物箱柜）里。"}]}],"synonyms":["chests","cabinets","trunks","armoires (similar, but not exact)"],"phonetic":"/bɑˈhuːts/","extraExplanation":["“bahut”源自法语，多见于艺术史、古董家具或欧洲室内设计语境。在现代日常英语里不算常用，写作或展览说明中更常见。","在法语里也可指“柜台/收银台”（如商店柜台），但英语借词里最常用的意义是“箱柜、储物柜”。"]}
{"word":"Bahutu","summary":{"en":"“Bahutu” means “the Hutu people,” a less common/older plural form seen in writing about Rwanda and Burundi.","zh":"“Bahutu”指“胡图人（Hutu people）”，在关于卢旺达、布隆迪的写作中较旧或较不常见，常作复数用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plural term meaning “the Hutu people,” especially in older or region-specific writing about Rwanda and Burundi","zh":"（复数用法）指“胡图人（Hutu people）”，常见于较旧或特定地区语境下对卢旺达、布隆迪的描述"},"examples":[{"en":"Some older historical texts use “Bahutu” to refer to the Hutu people in Rwanda and Burundi.","zh":"一些较早的历史文本会用“Bahutu”来指代卢旺达和布隆迪的胡图人。"},{"en":"Today, many writers prefer “Hutu” as the more standard English term.","zh":"如今，许多作者更倾向使用更标准的英文说法“Hutu”。"}]}],"synonyms":["Hutu"],"phonetic":"/bɑˈhuːtuː/","extraExplanation":["“Ba-”在卢旺达语/基隆迪语等班图语中常是表示“人们/复数人群”的前缀，因此“Ba-hutu”直译接近“胡图人们”。英语里更常见的写法是“Hutu（胡图人）”。","该词常出现在殖民时期或较旧的民族分类叙述中；在当代语境谈及卢旺达、布隆迪族群与历史时，建议使用更中性、具体的表达，并注意相关议题的敏感性。"]}
{"word":"bahutu","summary":{"en":"“Bahutu” means the Hutu people as a group (plural form), mainly in Rwanda and Burundi.","zh":"“Bahutu”指胡图人这一族群（复数称呼），主要分布在卢旺达和布隆迪。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"the Hutu people collectively (plural form), an ethnic group mainly in Rwanda and Burundi","zh":"胡图人（复数称呼），主要分布在卢旺达和布隆迪的一个族群"},"examples":[{"en":"In some texts, “Bahutu” is used to mean the Hutu people as a group.","zh":"在一些文章里，“Bahutu”用来指整个胡图族群。"},{"en":"The history of Rwanda often discusses relations between the Bahutu and the Batutsi.","zh":"卢旺达的历史常常讨论胡图人（Bahutu）与图西人（Batutsi）之间的关系。"}]}],"synonyms":["Hutu"],"phonetic":"/bɑˈhuːtuː/","extraExplanation":["“Ba-”在一些班图语中是表示复数“人们/……族人”的前缀，所以 Bahutu 可理解为“胡图人们/胡图族人（复数）”。相对地，单数有时写作 Muhutu（一个胡图人）。","这个词常出现在历史与社会政治语境中，尤其涉及卢旺达与布隆迪的族群关系与殖民时期分类。使用时建议保持中性、尊重与准确，避免把复杂的身份与历史简化成刻板印象。"]}
{"word":"bahuvrihi","summary":{"en":"Bahuvrihi is a linguistics term for an exocentric compound (like “redhead”) whose meaning points to something outside the compound.","zh":"Bahuvrihi 是语言学术语，指“离心复合词”（如 redhead），整体意义指向复合词之外的对象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(linguistics) An exocentric compound noun whose meaning refers to something outside the compound itself, often describing a person or thing by a characteristic (e.g., “redhead” = a person with a red head/hair).","zh":"（语言学）离心复合词：一种复合名词，其整体意义不直接指向复合词内部的成分，而是指向外部的某个对象，常用来描述人或事物的特征（如 redhead“红头发的人”）。"},"examples":[{"en":"“Redhead” is a classic example of a bahuvrihi compound.","zh":"“redhead”（红头发的人）是典型的离心复合词（bahuvrihi）。"},{"en":"In English, bahuvrihi compounds often describe people, like “blockhead” or “loudmouth.”","zh":"在英语中，bahuvrihi 常常用来形容人，比如 “blockhead”（笨蛋）或 “loudmouth”（大嘴巴/话多的人）。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing a compound word that is exocentric (a bahuvrihi compound).","zh":"（形容词用法）指“离心复合的；属于 bahuvrihi 这一类复合词的”。"},"examples":[{"en":"“White-collar” can be analyzed as a bahuvrihi compound meaning “a person who wears a white collar.”","zh":"“white-collar”可分析为 bahuvrihi 复合词，意思是“穿白领衬衫的人”，即白领人士。"}]}],"synonyms":["exocentric compound","exocentric compound word"],"phonetic":"/ˌbɑːhʊˈvriːhi/","extraExplanation":["Bahuvrihi 源自梵语 bahu-vrīhi，字面意思是“多米的人/拥有很多米的人”。它在古代语法传统中用来指一种复合词：词的表面成分说的是“某个特征”，但真正指的是“具有该特征的人/物”。","在英语语法里，它常与 endocentric（向心）复合词对比：blackbird（黑鸟）是向心复合词，仍然是一种“鸟”；而 redhead（红头发的人）不是一种“头”，而是“人”，所以是 bahuvrihi（离心复合词）。","这个术语主要出现在语言学/语法学教材或学术写作中，日常英语交流里很少直接说 bahuvrihi。"]}
{"word":"bahuvrihis","summary":{"en":"Bahuvrihis are exocentric compounds that describe someone/something with a certain trait (e.g., “redhead” = a person with a red head).","zh":"Bahuvrihis 指一种离心复合词：用复合词表达特征，实际指“具有该特征的人或物”（如 redhead 指红发的人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of compound (especially in Sanskrit and in linguistic description) whose meaning refers to someone or something that has the quality expressed by the compound, rather than naming the thing directly; an “exocentric” compound.","zh":"一种复合词类型（尤见于梵语及语言学描述）：复合词的意义指向“具有该特征的人或物”，而不是直接指称该事物本身；属于“离心复合词/外指复合词”。"},"examples":[{"en":"In linguistics, “redhead” is often explained as a bahuvrihi: it means “a person with a red head,” not a kind of head.","zh":"在语言学中，“redhead（红发的人）”常被解释为 bahuvrihi：它的意思是“头发/头呈红色的人”，而不是一种“头”。"},{"en":"The Sanskrit word bahuvrīhi literally means “much-rice,” referring to “someone who has much rice,” i.e., a rich person.","zh":"梵语 bahuvrīhi 字面意思是“很多米”，实际指“拥有很多米的人”，也就是富人。"},{"en":"The teacher asked us to find bahuvrihi compounds in English like “loudmouth” and “bigwig.”","zh":"老师让我们找出英语里的 bahuvrihi 复合词，比如 “loudmouth（大嘴巴的人）”和 “bigwig（大人物）”。"}]}],"synonyms":["exocentric compounds","bahuvrihi compounds","possessive compounds"],"phonetic":"/ˌbɑːhuːˈvriːhiːz/","extraExplanation":["“bahuvrihi”来自梵语 बहुव्रीहि（bahu- “多的” + vrīhi “米”）。它本身是一个典型例子：词的字面组合不等于它真正指称的对象。","在语言学里，bahuvrihi 常与“endocentric（向心复合词）”对比：如 “blackbird” 通常指一种“鸟”（中心是 bird）；而 bahuvrihi 如 “redhead” 指“人”，中心不在复合词内部，因此也常被称作“exocentric compound（离心复合词）”。","英语里常见的类似结构包括：bigmouth（嘴很大/爱乱说话的人）、paleface（白脸人，用法有文化敏感性）、four-eyes（戴眼镜的人，可能带嘲讽）。使用时需注意语境与礼貌。"]}
