{"word":"Bai","summary":{"en":"“Bai” is most commonly a Chinese surname and can also refer to the Bai ethnic group in China; it may also be used as a personal name.","zh":"“Bai”最常见的是中文姓氏“白”，也可指中国的白族；在某些情况下也可作人名使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Chinese surname (family name).","zh":"白（中国姓氏）。"},"examples":[{"en":"Her last name is Bai, spelled B-A-I.","zh":"她的姓是 Bai，拼作 B-A-I。"},{"en":"Mr. Bai will speak at the meeting tomorrow.","zh":"白先生明天会在会议上发言。"}]},{"partOfSpeech":"n.","definition":{"en":"the Bai people, an ethnic group in China, mainly living in Yunnan Province.","zh":"白族（中国的一个民族，主要分布在云南省）。"},"examples":[{"en":"She is Bai and grew up in Dali, Yunnan.","zh":"她是白族，在云南大理长大。"},{"en":"Bai culture is known for its music and traditional architecture.","zh":"白族文化以音乐和传统建筑闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name used in some cultures (less common in English contexts).","zh":"Bai（人名；在英语语境中相对少见）。"},"examples":[{"en":"Bai is the main character in this short story.","zh":"Bai 是这篇短篇小说的主角。"}]}],"phonetic":"/baɪ/","extraExplanation":["在英语里，“Bai”多见于中文姓名的拼音：可能是姓（白），也可能是名字的一部分。作为姓时常写在最后（e.g., “Li Bai” 在英文里通常写作“Li Bai”，而英文习惯的“名-姓”顺序有时会导致混淆）。","“Bai”作为拼音对应的汉字不止“白”，也可能是“柏/摆/拜”等；仅凭拼写无法确定具体汉字，需要看本人提供的中文写法或语境。"]}
{"word":"bai","summary":{"en":"“bai” is most often seen in English as Pinyin spelling, a Chinese surname “Bai,” or an abbreviation (BAI).","zh":"“bai”在英语中多见于：汉语拼音拼写、中文姓氏Bai（白），或缩写（BAI）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A syllable written in Roman letters used to spell/pronounce many Chinese words in Hanyu Pinyin (not a standalone English word by itself).","zh":"“bai”是汉语拼音中的一个音节（罗马字母拼写），本身通常不算一个独立的英语单词。"},"examples":[{"en":"In Pinyin, “bai” can appear in many words, depending on the tone.","zh":"在拼音里，“bai”会出现在很多词中，但要看声调。"},{"en":"Please type the Pinyin: bai (with the correct tone mark).","zh":"请输入拼音：bai（并标注正确的声调符号）。"}]},{"partOfSpeech":"n.","definition":{"en":"A Chinese family name, usually written as “Bai” in English.","zh":"中文姓氏“白”，英语里常写作“Bai”。"},"examples":[{"en":"Her last name is Bai.","zh":"她的姓是Bai（白）。"},{"en":"Mr. Bai will lead the meeting today.","zh":"白先生今天将主持会议。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation for organizations or terms (e.g., Bank Administration Institute). Meaning depends on context.","zh":"作为缩写用于某些机构或术语（例如 Bank Administration Institute，美国银行管理协会）；具体含义取决于语境。"},"examples":[{"en":"She earned a certificate through BAI.","zh":"她通过BAI获得了一项证书。"}]}],"synonyms":["(sound-alike) bye"],"phonetic":"/baɪ/","extraExplanation":["在汉语里，“bai”加不同声调会对应不同意思：bái（白/白色）、bǎi（百/一百）、bài（拜/拜访/失败）等。英语写作时通常需要上下文或标注声调才能确定是哪一个词。"]}
{"word":"Baiae","summary":{"en":"Baiae is an ancient Roman resort on the Bay of Naples; in literature it can mean a place of luxury and indulgence.","zh":"Baiae 指古罗马那不勒斯湾的度假胜地；在文学中也可引申为奢华放纵之地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient Roman seaside resort town on the Bay of Naples (near modern Bacoli, Italy), famous for luxury villas, baths, and pleasure life.","zh":"拜亚（Baiae）：古罗马时期那不勒斯湾沿岸的海滨度假胜地（今意大利巴科利附近），以奢华别墅、温泉浴场与享乐生活闻名。"},"examples":[{"en":"We read about Baiae as a glamorous resort where wealthy Romans spent the summer.","zh":"我们读到拜亚是个迷人的度假胜地，富有的罗马人常去那里避暑。"},{"en":"Archaeologists have found submerged ruins of villas near Baiae.","zh":"考古学家在拜亚附近发现了被海水淹没的别墅遗址。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literary) A symbol of luxury, indulgence, or moral looseness—used to suggest a decadent “pleasure resort.”","zh":"（文学用法）奢靡、放纵或风气浮华的象征；用来暗示“享乐之地/纵情之所”。"},"examples":[{"en":"In the poem, the city is described as a modern Baiae of endless parties.","zh":"诗中把这座城市描写成现代的“拜亚”，派对无休无止。"},{"en":"Some writers contrasted strict Roman virtue with the temptations of Baiae.","zh":"一些作家把严肃的罗马美德与拜亚的诱惑作对比。"}]}],"synonyms":["ancient Roman resort","Roman seaside resort","pleasure resort (literary)"],"phonetic":"ˈbaɪ.iː","extraExplanation":["拜亚在古罗马以温泉与海滨别墅著名，属于当时上流社会的度假圈；后来因地热与地面沉降（布拉迪塞ism）导致部分遗址沉入海中，如今在“坎皮佛莱格雷伊（火山群）”一带可见水下考古。","古典作家（如贺拉斯、塞涅卡等）常提到拜亚，语气有时带批评：它不仅是旅游胜地，也常被当作“奢华与放纵”的文化意象。"]}
{"word":"Baianism","summary":{"en":"Baianism is the theological doctrine linked to Michael Baius, focused on issues like grace, original sin, and free will, and historically condemned by the Catholic Church.","zh":"Baianism（巴尤主义）指与米歇尔·巴尤斯相关的神学观点，聚焦恩宠、原罪与自由意志等问题，历史上曾被天主教会谴责。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a set of Catholic theological ideas associated with Michael Baius (Michel de Bay, 1513–1589), especially his views on grace, original sin, and human freedom; later condemned by the Catholic Church.","zh":"“巴尤主义”（Baianism）：与天主教神学家米歇尔·巴尤斯（Michael Baius / Michel de Bay）相关的一套神学观点，主要涉及恩宠、原罪与人的自由意志等议题；后来被天主教会谴责。"},"examples":[{"en":"In some histories of theology, Baianism is discussed as an early controversy about grace and free will.","zh":"在一些神学史著作中，“巴尤主义”常被当作关于恩宠与自由意志的早期争论来讨论。"},{"en":"The author contrasts Baianism with later debates that also tried to explain how divine grace works.","zh":"作者将“巴尤主义”与后来的相关争论作对比，这些争论同样试图解释神的恩宠如何发挥作用。"}]}],"synonyms":["Baius’s doctrine","Baiism (rare)"],"phonetic":"/ˈbeɪənɪzəm/","extraExplanation":["“Baianism”来自人名 Baius（拉丁化形式），指向鲁汶（Louvain）学派的神学争论背景。它并不是日常英语词汇，更多出现在宗教史、神学或教会史写作中。","历史上，巴尤斯的一些命题在16世纪后期被教宗文件谴责（常在学术文本中与“恩宠”“原罪”“功德”“自由意志”等关键词一起出现）。"]}
{"word":"baianism","summary":{"en":"Baianism is a rare term for beliefs based on the Báb’s Bayán writings, closely tied to early Bábí religious history.","zh":"Baianism 是个罕见词，指以巴布的《Bayán》著作为基础的信仰思想，和早期巴比教历史密切相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A religious doctrine or movement based on the Bayán, the key writings of the Báb; often treated as a variant spelling of “Bayánism,” connected historically to Bábism and the later development of the Baháʼí Faith.","zh":"（罕见）以《Bayán》（巴布的重要著作）为核心的宗教思想或运动；常被视为“Bayánism / Bayán 主义”的异拼写，历史上与巴比教（Bábism）以及后来巴哈伊信仰的发展有关。"},"examples":[{"en":"Some 19th‑century sources refer to early Bábí teachings as Baianism.","zh":"一些19世纪的资料把早期巴比教的教义称作 Baianism。"},{"en":"In academic writing today, “Bayánism” is more common than “Baianism.”","zh":"在今天的学术写作中，“Bayánism”比“Baianism”更常见。"}]}],"synonyms":["Bayánism","Bayanism","(historical context) Bábism"],"phonetic":"/ˈbaɪ.ənˌɪzəm/","extraExplanation":["“Bayán / Baian”来自阿拉伯语/波斯语，意思接近“宣示、阐明、说明”。在宗教史语境里，它特指巴布（The Báb）的著作《Bayán》。","“Baianism”在现代英语中非常少见，多出现在较早的英文文献或转写（音译）不统一的情况下。检索资料时，建议同时搜“Bayánism / Bayanism / Bábism”。"]}
{"word":"baicalin","summary":{"en":"Baicalin is a natural compound found in Chinese skullcap, often discussed in herbal medicine and scientific research.","zh":"黄芩苷是黄芩中的一种天然成分，常见于草药与科学研究相关语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural chemical (a flavonoid glycoside) found especially in the root of Chinese skullcap (Scutellaria baicalensis), studied for possible anti-inflammatory, antioxidant, and antiviral effects","zh":"黄芩苷：一种天然化学成分（黄酮类苷），主要存在于黄芩（Scutellaria baicalensis）的根中；常被研究其潜在的抗炎、抗氧化与抗病毒作用"},"examples":[{"en":"Baicalin is one of the main active compounds in Chinese skullcap.","zh":"黄芩苷是黄芩中的主要活性成分之一。"},{"en":"Researchers are studying baicalin for its possible anti-inflammatory effects.","zh":"研究人员正在探索黄芩苷可能具有的抗炎作用。"},{"en":"The supplement label lists baicalin as an ingredient extracted from Scutellaria baicalensis.","zh":"该补充剂标签上写明其成分之一为从黄芩中提取的黄芩苷。"}]}],"synonyms":["baicalein-7-O-glucuronide","Chinese skullcap flavonoid"],"phonetic":"/ˈbaɪkəlɪn/","extraExplanation":["“baicalin”常见于药理学/天然产物化学和中药相关语境；在中医药里，黄芩（Huangqin）被广泛使用，而“黄芩苷”是其中被重点研究的成分之一。","英文里它通常被当作不可数名词使用（如：contains baicalin）。在更专业的化学语境中，也可能出现其别名，如“baicalein-7-O-glucuronide”。","学习提醒：在保健品或研究新闻中看到“studied for / may help with …”时，常表示“正在研究/可能有帮助”，并不等同于已被证实的临床疗效。"]}
{"word":"baidak","summary":{"en":"Baidak is a historical East Slavic term for a large river boat/barge, especially associated with the Dnieper River and Cossack-era transport.","zh":"Baidak 是东斯拉夫地区的历史词，指大型河船/驳船，常与第聂伯河及哥萨克时期的运输有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A large river boat or barge used in Ukraine/Russia, especially on the Dnieper River in Cossack times, for transporting people and goods.","zh":"（历史用语）“baidak（байдак）”：一种在乌克兰/俄罗斯河流上使用的大型河船或驳船，尤其常见于哥萨克时期第聂伯河流域，用于载人和运货。"},"examples":[{"en":"Merchants loaded grain onto a baidak to send it downriver.","zh":"商人把谷物装上 baidak，顺流运送下去。"},{"en":"In some historical accounts, Cossacks traveled in baidaks along the Dnieper.","zh":"在一些历史记载中，哥萨克人乘 baidak 沿第聂伯河行进。"}]}],"synonyms":["river barge","riverboat","cargo boat"],"phonetic":"/ˈbaɪdæk/","extraExplanation":["“baidak”源自东斯拉夫语言（常见拼写：Ukrainian/俄语的“байдак”转写），多出现在历史、民族志或航运相关文本中。在现代日常英语里很少见，通常作为文化/历史专有名词使用。","读音在英语里不算固定；常见的英语读法可按“BY-dak”来记。"]}
{"word":"baidar","summary":{"en":"Baidar is a traditional skin-covered kayak-like boat used in Alaska and the Aleutian region.","zh":"Baidar 指阿拉斯加及阿留申地区使用的传统兽皮蒙皮、类似皮划艇的船。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of skin-covered boat (similar to a kayak) traditionally used by Indigenous peoples in Alaska and the Aleutian Islands; sometimes used as a general term for a traditional kayak-style craft.","zh":"（传统）皮革蒙皮小船，类似皮划艇；原为阿拉斯加与阿留申群岛原住民常用的船只，有时泛指传统“皮艇式”船。"},"examples":[{"en":"The hunters paddled a baidar quietly along the coast.","zh":"猎人们沿着海岸安静地划着一艘baidar。"},{"en":"In the museum, we saw a baidar made with a wooden frame and animal skin.","zh":"在博物馆里，我们看到一艘用木骨架和兽皮制作的baidar。"}]}],"synonyms":["kayak","baidarka","skin boat"],"phonetic":"ˈbaɪdɑr","extraExplanation":["“baidar”多见于历史、民族志（人类学/民族学）或探险记述中，属于较少见词。英语里也常见拼写/相关词：baidarka（常指阿留申式多舱皮艇）。","该词与阿拉斯加地区的海上生活文化有关，通常强调其传统材料（木架+兽皮）与适航性。"]}
{"word":"baidarka","summary":{"en":"A baidarka is a traditional Aleut skin-covered kayak used in Alaska’s cold seas.","zh":"baidarka指阿拉斯加阿留申人传统使用的皮革覆面的海上皮艇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of skin-covered kayak traditionally used by the Aleut (Unangan) people of Alaska, often designed for speed and rough, cold seas","zh":"（阿拉斯加阿留申/乌南甘人传统使用的）皮艇；一种以兽皮覆盖骨架的独木舟式海上皮艇，常为高速与寒冷风浪海况而设计"},"examples":[{"en":"The museum displayed a baidarka made with a wooden frame and stretched seal skin.","zh":"博物馆展出了一艘以木质骨架和拉紧的海豹皮制成的baidarka。"},{"en":"Early explorers wrote about Aleut hunters traveling far offshore in baidarkas.","zh":"早期探险者记载阿留申猎人乘坐baidarka远离海岸到外海活动。"}]}],"synonyms":["kayak","skin boat","Aleut kayak"],"phonetic":"/baɪˈdɑrkə/","extraExplanation":["词源与文化背景：baidarka一词常被认为是从俄语转入英语（与俄语中对当地皮艇的称呼有关），用于指阿留申群岛与阿拉斯加沿岸原住民的传统海上皮艇。","与现代“kayak（皮划艇）”相比，baidarka更强调特定的地域与传统结构（如流线型船体、皮革覆面），常出现在历史、民族志与博物馆语境中。"]}
{"word":"baidarkas","summary":{"en":"A baidarka is a traditional Aleut skin-covered kayak used in Alaska and the Aleutian Islands.","zh":"baidarka 指阿留申（Unangan）人在阿拉斯加与阿留申群岛使用的传统皮覆皮艇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of skin-covered kayak traditionally used by Aleut (Unangan) people in Alaska and the Aleutian Islands, often long and narrow and sometimes having two or three cockpits","zh":"一种传统皮艇（皮覆独木舟/皮艇），最初由阿留申（Unangan）人在阿拉斯加及阿留申群岛使用；通常细长，有时有两到三个座舱"},"examples":[{"en":"The museum displayed a baidarka made with a wooden frame and sea-lion skin.","zh":"博物馆展出了一艘用木架和海狮皮制成的 baidarka（传统皮艇）。"},{"en":"Early explorers wrote about Aleut hunters traveling far offshore in baidarkas.","zh":"早期探险者记载阿留申猎人乘 baidarka 出海很远狩猎。"}]}],"synonyms":["kayak","skin boat","umiak (related but different)"],"phonetic":"/baɪˈdɑrkə/","extraExplanation":["“Baidarka”一词常见于阿拉斯加与北太平洋地区的历史与民族志（人类学）资料中，指阿留申（Unangan）传统海上狩猎与交通工具；在现代英语里也可泛指仿制或受其启发的传统皮艇。","复数形式是 baidarkas；也可见到拼写变体（如 baidarka/baidarkah，视资料而定）。"]}
{"word":"Baidicheng","summary":{"en":"Baidicheng is a famous historic site (“White Emperor City”) in Fengjie, Chongqing, near the Three Gorges, often referenced in Chinese history and poetry.","zh":"白帝城是重庆奉节、三峡附近著名的历史遗址（“白帝城/白帝之城”），常见于中国历史典故与诗歌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historic site and scenic area in Fengjie County, Chongqing, China, traditionally translated as “White Emperor City,” known for Three Gorges landscapes and famous stories from the Three Kingdoms period.","zh":"白帝城：中国重庆市奉节县的一处历史遗址与风景名胜，常译为“白帝城/白帝城遗址”，以三峡风光与三国故事闻名。"},"examples":[{"en":"We visited Baidicheng before taking a boat through the Three Gorges.","zh":"我们去三峡游船之前先参观了白帝城。"},{"en":"Baidicheng is often mentioned in Chinese history and literature classes.","zh":"白帝城在中国历史与文学课里常常被提到。"}]}],"synonyms":["Baidi City","White Emperor City"],"phonetic":"/ˌbaɪdiːˈtʃʌŋ/","extraExplanation":["“Baidicheng”是拼音写法（Báidìchéng）。英文里有时也写作“Baidi City”或直译“White Emperor City”。","白帝城在文化上常与三国时期刘备托孤（把后事托付给诸葛亮）的传说联系在一起，因此在中文语境中带有“历史转折、托付重任”的象征意味。","文学上很常见的相关作品是李白《早发白帝城》（常译为“Departing from Baidi City at Dawn”）。因此在英文阅读中看到“Baidi City/Baidicheng”时，可能不仅是地名，也是在指向这首诗的意境与典故。"]}
{"word":"Baidya","summary":{"en":"“Baidya” most commonly means an Ayurvedic doctor/traditional healer in South Asia; it can also be a South Asian surname and, in Bengal, the name of a historical community.","zh":"“Baidya”最常见指南亚的阿育吠陀医生/传统医者；也可作南亚姓氏；在孟加拉语境中还可指一个历史社群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asia) An Ayurvedic physician or traditional healer; a practitioner of Ayurveda. Also spelled “vaidya.”","zh":"（南亚）阿育吠陀医生／传统医者；从事阿育吠陀医学的人。也可拼作“vaidya”。"},"examples":[{"en":"She visited a baidya for herbal treatment and dietary advice.","zh":"她去找一位baidya做草药治疗并咨询饮食建议。"},{"en":"In some villages, the baidya is respected as a community healer.","zh":"在一些村庄里，baidya作为社区医者很受尊敬。"}]},{"partOfSpeech":"n.","definition":{"en":"A South Asian surname (especially in Nepal and parts of India); sometimes associated with families connected to traditional medicine.","zh":"南亚的姓氏（尤其见于尼泊尔和印度部分地区）；有时与传统医药相关的家族有关联。"},"examples":[{"en":"Ms. Baidya will speak at the health workshop tomorrow.","zh":"Baidya女士明天将在健康讲座上发言。"}]},{"partOfSpeech":"n.","definition":{"en":"In Bengal, a social group/caste historically associated with learning and medical practice (usage depends on region and context).","zh":"在孟加拉地区，历史上与教育和行医相关的社会群体／种姓（具体用法因地区与语境而异）。"},"examples":[{"en":"The text mentions the Baidya community in colonial Bengal.","zh":"这篇文章提到了殖民时期孟加拉的Baidya群体。"}]}],"synonyms":["vaidya","Ayurvedic doctor","traditional healer"],"phonetic":"/ˈbaɪdiə/","extraExplanation":["“Baidya”常被视为“Vaidya”的地区性拼写或音译差异：Vaidya源自梵语，意为“懂医术的人/医生”，在尼泊尔、孟加拉语地区等地更常见写作Baidya。","在谈到“种姓/社群”含义时，需要注意语境与敏感性：这类身份标签在不同地区的历史与现实意义差异很大，日常交流中更常把Baidya当作姓氏或职业称呼。"]}
{"word":"baidya","summary":{"en":"Baidya is most commonly a Bengali South Asian surname, historically connected to traditional physicians; it can also refer to the Baidya community in Bengal.","zh":"Baidya 常见为孟加拉地区的南亚姓氏，历史上与传统医师有关；也可指孟加拉的 Baidya 社群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a South Asian surname, especially common among Bengali speakers; it is historically associated with traditional physicians (vaidya).","zh":"一个南亚姓氏，尤其常见于孟加拉语使用者；历史上与传统医师（vaidya）有关。"},"examples":[{"en":"Mr. Baidya will join the meeting at 3 p.m.","zh":"Baidya 先生将在下午三点参加会议。"},{"en":"Her last name is Baidya, a surname often found in Bengal.","zh":"她的姓是 Baidya，这个姓在孟加拉地区很常见。"}]},{"partOfSpeech":"n.","definition":{"en":"a member of the Baidya (Vaidya) community in Bengal, traditionally linked with medicine and scholarship.","zh":"（印度孟加拉地区的）Baidya（Vaidya）社群成员；传统上与医学和学术有关。"},"examples":[{"en":"In some historical texts, Baidyas are described as a learned medical community.","zh":"在一些历史文献中，Baidya 被描述为一个有学识的医者社群。"}]}],"synonyms":["Vaidya"],"phonetic":"/ˈbaɪdjə/","extraExplanation":["“Baidya”与梵语/巴利语系的“vaidya”（意为“医生、医师”）有关，在英语语境中多作为专有名词（姓氏或社群名称）使用，因此通常首字母大写：Baidya。","不同地区与家族对该名称的拼写可能不同（如 Baidya / Vaidya），发音也会随本地方言略有变化；在英文交流中，最稳妥的做法是尊重当事人的自我拼写与读法。"]}
{"word":"baie","summary":{"en":"“Baie” is a French word meaning “bay” or “berry,” most often seen in place names or French contexts.","zh":"“Baie”是法语词，意思是“海湾”或“浆果”，多见于地名或法语语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(French) a bay; a broad inlet of the sea where the land curves inward.","zh":"（法语）海湾；海岸线向内弯曲形成的海面凹入处。"},"examples":[{"en":"They sailed into the baie and anchored near the town.","zh":"他们驶入海湾，在小镇附近抛锚。"},{"en":"The map labels the area as “Baie de…”","zh":"地图把那片区域标注为“Baie de…”（……海湾）。"}]},{"partOfSpeech":"n.","definition":{"en":"(French) a berry; a small, juicy fruit (often used in culinary or botanical contexts).","zh":"（法语）浆果；一种小而多汁的果实（常见于烹饪或植物学语境）。"},"examples":[{"en":"The recipe calls for a mix of baies like strawberries and raspberries.","zh":"这份食谱需要混合一些“baies”（浆果类），比如草莓和覆盆子。"},{"en":"In French, “baies” can refer to many kinds of berries.","zh":"在法语里，“baies”可以泛指多种浆果。"}]}],"synonyms":["bay","berry"],"phonetic":"/bɛ/","extraExplanation":["“baie”主要是法语词，在英语里多见于地名（如 Baie-Comeau）或法语原文/菜单/旅行资料中。日常英语通常直接说 bay（海湾）或 berry（浆果）。","发音方面：标准法语“baie”接近英语里“bet”的元音（/bɛ/），但不读出结尾的辅音。"]}
{"word":"Baiel","summary":{"en":"Bail most commonly means money paid for someone’s temporary release from jail, and it can also mean to bail someone out, quit a situation, or scoop water out of a boat.","zh":"bail 最常见指“保释金”，也可表示“保释某人/帮某人脱困”、（口语）“退出/撤离”，以及“把船里的水舀出去”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(law) Money paid to the court so a person accused of a crime can be released from jail while waiting for trial.","zh":"（法律）保释金：为了在等待审判期间获释而交给法院的一笔钱。"},"examples":[{"en":"The judge set bail at $5,000.","zh":"法官将保释金定为5000美元。"},{"en":"He was released on bail after the hearing.","zh":"听证会后他交保释金获释。"}]},{"partOfSpeech":"vt.","definition":{"en":"To release someone from jail by paying bail (or by arranging legal bail).","zh":"（通过交保释金等方式）保释；使某人取保候审。"},"examples":[{"en":"Her family bailed her out the next day.","zh":"她家人第二天把她保释出来了。"},{"en":"They hired a lawyer to bail him out.","zh":"他们请了律师来帮他办理保释。"}]},{"partOfSpeech":"vi.","definition":{"en":"To leave a difficult or unpleasant situation; to quit suddenly.","zh":"（非正式）退出；临时打退堂鼓；突然不干了。"},"examples":[{"en":"He bailed on the plan at the last minute.","zh":"他在最后一刻退出了计划。"},{"en":"If the job feels unsafe, you can bail.","zh":"如果工作让你觉得不安全，你可以退出。"}]},{"partOfSpeech":"v.","definition":{"en":"To remove water from a boat using a container.","zh":"（用容器）把船里的水舀出去；排水。"},"examples":[{"en":"We had to bail water out of the canoe.","zh":"我们得把独木舟里的水舀出去。"},{"en":"She kept bailing while he paddled.","zh":"他划桨时，她一直在舀水排水。"}]},{"partOfSpeech":"n.","definition":{"en":"A curved handle on a bucket or container (or a bar-like handle on some items).","zh":"（桶等的）提梁；弓形把手。"},"examples":[{"en":"The bucket’s bail broke.","zh":"桶的提梁断了。"}]}],"synonyms":["bond","release (on bail)","bail out","quit","leave","scoop (water)"],"phonetic":"/beɪl/","extraExplanation":["你输入的“Baiel”不是常见英文单词，最可能是拼写成了 **bail**（尤其常见于“保释/保释金”或“退出/撤离”这两个意思）。如果你想查的是别的词（例如人名、地名或品牌），可以告诉我上下文句子，我再帮你确认。"]}
{"word":"Baiera","summary":{"en":"Baiera: an extinct, ginkgo-like fossil plant genus name used in paleobotany.","zh":"Baiera：古植物学中使用的一个已灭绝、类银杏植物的化石属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific genus name for extinct, ginkgo-like trees known mainly from fossils (common in the Mesozoic era).","zh":"（生物/古植物学）“Baiera”是一个已灭绝的、类似银杏的植物属名，主要通过化石被认识（多见于中生代）。"},"examples":[{"en":"Baiera fossils are often discussed in studies of Mesozoic plant life.","zh":"在研究中生代植物群时，经常会提到 Baiera 的化石。"},{"en":"The leaf shape of Baiera is sometimes compared with modern ginkgo leaves.","zh":"Baiera 的叶形有时会拿来与现代银杏叶作比较。"}]}],"synonyms":["(no common everyday synonyms; scientific name)"],"phonetic":"/ˈbaɪərə/","extraExplanation":["“Baiera”通常出现在学术语境（论文、博物馆说明牌、化石图鉴）中，日常英语里很少用。","如果你本来想查的是地名或人名，可能是拼写接近的词：如 Bavaria（巴伐利亚）或 Bayer（拜耳）。你可以告诉我上下文句子，我可以帮你确认。"]}
{"word":"baiera","summary":{"en":"“baiera” is not a standard English word; it’s likely a misspelling or a name/foreign word. Provide context to identify the intended word.","zh":"“baiera”不是标准英文词；更可能是拼写错误或人名/外来词。请提供语境以确定你想表达的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“baiera” is not a standard English word in common dictionaries. It may be a misspelling or a word from another language used as a name.","zh":"“baiera”不是常见的标准英文词（一般词典中没有）。它可能是拼写错误，或是其他语言的词/名字。"},"examples":[{"en":"I couldn’t find “baiera” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英文词典里找不到“baiera”——你能把它出现的句子发我吗？"},{"en":"Maybe you meant “barrier” or “Bavaria,” depending on the context.","zh":"根据语境，你可能想写的是“barrier（障碍）”或“Bavaria（巴伐利亚）”。"}]}],"extraExplanation":["如果你能提供：1）它出现的完整句子；2）你想表达的中文意思；3）是否是人名/地名/品牌名，我可以更准确判断。","常见的可能目标词：\n- barrier（障碍/屏障）拼写相近但差较大\n- Bavaria（巴伐利亚，德国一州）有时会被误拼\n- Bayer（拜耳，德国公司/姓氏）也可能被误写成类似形式"]}
{"word":"baiginet","summary":{"en":"A bayonet is a long knife attached to a rifle; it can also mean to stab with it or to attach it.","zh":"bayonet 指“刺刀”（可装在步枪上的长刀）；也可作动词表示“用刺刀刺/装刺刀”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a weapon consisting of a long, sharp knife that can be attached to the end of a rifle","zh":"（可装在步枪枪口上的）刺刀"},"examples":[{"en":"The soldier fixed a bayonet to his rifle.","zh":"士兵把刺刀装到步枪上。"},{"en":"The museum displays rifles with bayonets from the 1800s.","zh":"博物馆展出了19世纪的带刺刀步枪。"}]},{"partOfSpeech":"v.","definition":{"en":"to attack or stab with a bayonet; to attach a bayonet to a rifle","zh":"用刺刀刺；给步枪装上刺刀"},"examples":[{"en":"They were trained to bayonet straw targets during drills.","zh":"训练时，他们被要求用刺刀刺稻草靶。"},{"en":"The troops were ordered to bayonet their rifles before advancing.","zh":"部队被命令在前进前给步枪装上刺刀。"}]}],"synonyms":["knife (context-dependent)","dagger (similar shape)","blade","stab (v., related action)"],"phonetic":"/ˈbeɪ.ə.nɛt/","extraExplanation":["你输入的“baiginet”常见是拼写错误，标准拼写通常是 **bayonet**。","bayonet 源自法语 *baïonnette*，常与法国城市 Bayonne 联系在一起（传统说法）。在现代英语里，它既可指“刺刀”本身，也可作动词表示“装刺刀/用刺刀刺”。","在文学与历史叙述中，bayonet 常用来营造近距离战斗的紧张感；也常出现在固定搭配如 **at the point of a bayonet**（在刺刀威逼下）。"]}
{"word":"baign","summary":{"en":"“baign” is not a standard English word; it’s usually a French-related fragment or a misspelling (often of *beignet* or a form of *baigner*).","zh":"“baign”不是标准英语词；通常是与法语相关的词形片段或拼写错误（常见为想写 *beignet*，或来自 *baigner* 的变形）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare/nonstandard spelling in English; most often seen as a French-based form related to *baigner* (“to bathe”), or as part of French words/names (e.g., *baigne*, *baignade*). In general English writing, it’s usually a misspelling or incomplete form rather than a standard word.","zh":"英语中非常少见、非标准的拼写；多见于与法语 *baigner*（“洗澡/浸泡”）相关的词形，或出现在法语词/人名中（如 *baigne*, *baignade*）。在一般英语写作里通常是拼写错误或不完整词形，而不是标准单词。"},"examples":[{"en":"I think you meant **beignet** (a French-style doughnut), not **baign**.","zh":"我觉得你想写的是 **beignet**（法式甜甜圈），不是 **baign**。"},{"en":"The menu used several French words, and I saw a fragment like **baign** that was probably from *baigner*.","zh":"菜单用了不少法语词，我看到像 **baign** 这样的片段，可能是从 *baigner* 来的。"}]}],"synonyms":["(no standard English synonyms)"],"phonetic":"/beɪn/","extraExplanation":["“baign”本身不是常见英语词条。如果你是在读法语或看到法语借词：*baigner* 表示“（在水中）洗澡、浸泡”；其变形如 *baigne*（他/她洗澡）在法语里常见。","如果你的目标是英语单词，最容易混淆的是 **beignet**（常见于美国路易斯安那/新奥尔良文化的法式甜点）或 **bain**（法语“浴”，在英语里多出现在固定短语中，如 *bain-marie* “隔水加热”）。"]}
{"word":"baignet","summary":{"en":"“Baignet” is usually a misspelling of “beignet,” a French-style fried pastry dusted with powdered sugar, famous in New Orleans.","zh":"“baignet”通常是“beignet”的误拼：一种撒糖粉的法式油炸甜点，在美国新奥尔良很有名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A square (or rectangular) French-style fried pastry, usually served hot and covered with powdered sugar; especially associated with New Orleans.","zh":"一种法式油炸甜点（常见为方形或长方形），通常趁热撒上糖粉食用；尤其与美国新奥尔良饮食文化相关。"},"examples":[{"en":"We stopped at a café in New Orleans for coffee and beignets.","zh":"我们在新奥尔良的一家咖啡馆停下来，点了咖啡和法式油炸甜点（beignets）。"},{"en":"The beignet was crispy outside and soft inside.","zh":"这个 beignet 外酥里软。"}]}],"synonyms":["beignet","fritter","doughnut"],"phonetic":"/ˈbɛn.jeɪ/","extraExplanation":["“baignet”常见是拼写错误，正确拼法通常是“beignet”。发音也按“beignet”来读。","Beignet 源自法语，意思大致是“油炸面团/小点心”。在美国，新奥尔良法裔克里奥尔（Creole）文化中非常有代表性，常与 Café du Monde 等咖啡馆联系在一起。"]}
{"word":"baigneuse","summary":{"en":"Baigneuse is a French word used in English mainly for a female bather, especially as an art subject (a nude or bathing woman in a painting or sculpture).","zh":"Baigneuse 是法语词，在英语中多用于指“女浴者”，尤常见于艺术语境，指以沐浴/浴女为主题的绘画或雕塑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from French) a woman who is bathing; a female bather.","zh":"（法语借词）正在洗浴/游泳的女子；女浴者。"},"examples":[{"en":"The novel opens with a baigneuse stepping into the sea at dawn.","zh":"小说以一位女浴者黎明走入海中开场。"},{"en":"On the poster, a baigneuse sits on the sand and dries her hair.","zh":"海报上，一位女浴者坐在沙滩上擦干头发。"}]},{"partOfSpeech":"n.","definition":{"en":"In art, a painting or sculpture showing a (usually nude) female bather.","zh":"（艺术）以（通常为裸体的）“女浴者”为主题的绘画或雕塑。"},"examples":[{"en":"The museum label describes the work as a study of a baigneuse.","zh":"博物馆的说明牌把这件作品描述为一幅“女浴者”习作。"},{"en":"Cézanne is famous for scenes of baigneuses by the water.","zh":"塞尚以描绘水边的“女浴者”场景闻名。"}]}],"synonyms":["female bather","bather","bathing woman","(art) bather figure"],"phonetic":"/bɛnˈjøz/","extraExplanation":["“baigneuse”是法语“baigner（洗澡/浸泡）”的阴性名词形式。英语里多见于艺术史、评论或法语语境中，带有一种“法式/文学式”色彩。","在艺术语境中，它常和法语复数“baigneuses”一起出现，尤其用来指19世纪末至20世纪初绘画中常见的“浴女/沐浴者”母题（如塞尚等）。"]}
{"word":"baigneuses","summary":{"en":"Baigneuses is a French plural noun meaning “female bathers,” often used in art to describe paintings of women bathing.","zh":"Baigneuses 是法语复数名词，意为“女沐浴者／女泳者”，在艺术语境中常指“描绘女性沐浴”的绘画题材。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(French, plural) women who are bathing or swimming; female bathers.","zh":"（法语复数）正在洗澡或游泳的女性；女沐浴者／女泳者。"},"examples":[{"en":"The painting shows baigneuses by the river.","zh":"这幅画描绘了河边的女沐浴者。"},{"en":"In summer, the beach was full of baigneuses and children.","zh":"夏天，海滩上到处都是女泳者和孩子们。"}]},{"partOfSpeech":"n.","definition":{"en":"(Art/literature) a common French label for artworks featuring nude or semi-nude women bathing (e.g., in Impressionist painting).","zh":"（艺术／文学）法语中常用来指“沐浴的女性”这一绘画题材（常见于印象派等作品中，通常为裸或半裸女性沐浴场景）。"},"examples":[{"en":"Renoir often painted baigneuses in warm light.","zh":"雷诺阿常在温暖的光线里描绘沐浴的女性。"},{"en":"The museum’s catalog lists the work under “Baigneuses.”","zh":"博物馆的图录把这件作品归在“Baigneuses（沐浴的女性）”条目下。"}]}],"synonyms":["female bathers","bathers","bathing women","swimmers"],"phonetic":"/bɛɲˈøz/","extraExplanation":["“baigneuses”是法语名词“baigneuse”（女沐浴者／女泳者）的复数形式；对应的阳性形式是“baigneurs”（男沐浴者／男泳者）。","在英语艺术语境里，人们有时直接借用法语标题或分类词“Baigneuses”，尤其在谈论19世纪法国绘画（如雷诺阿、塞尚等）时。作为作品标题时常大写。"]}
{"word":"baignoire","summary":{"en":"“Baignoire” is a French word sometimes used in English to mean “bathtub.”","zh":"“baignoire”是法语词，在英文中偶尔用来表示“浴缸”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A bathtub; a bath (used mainly as a French word in English, especially in hotel or travel contexts).","zh":"浴缸；（洗）澡（多作为法语词在英文中使用，常见于旅馆/旅行语境）。"},"examples":[{"en":"The room has a baignoire rather than a shower stall.","zh":"这间房配的是浴缸（baignoire），不是淋浴间。"},{"en":"She asked the hotel staff if the suite included a baignoire.","zh":"她问酒店工作人员套房里是否有浴缸。"}]}],"synonyms":["bathtub","bath","tub"],"phonetic":"/bæŋˈnwɑr/","extraExplanation":["“baignoire”是法语，来自“baigner”（洗澡、浸泡）。在英语里并不常用；更常见的说法是“bathtub”或“bath”。你可能会在法国/法语地区的酒店介绍、房型说明里看到它。","在英语语境中使用“baignoire”会带有一点“法式/旅行/酒店说明书”的感觉；日常口语通常直接说“bathtub”。"]}
{"word":"Baiism","summary":{"en":"“Baiism” is an uncommon term that refers to the beliefs or cultural traditions of the Bai people in China.","zh":"“Baiism”是不常见的说法，通常指中国白族的信仰或文化传统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon) The beliefs, customs, or cultural practices associated with the Bai people (an ethnic group in Yunnan, China).","zh":"（不常见）指与白族（中国云南的一个民族）相关的信仰、风俗或文化实践。"},"examples":[{"en":"The museum’s exhibit explores Baiism through clothing, festivals, and household rituals.","zh":"博物馆的展览通过服饰、节庆和家庭仪式来呈现“白族文化/白族习俗”（Baiism）。"},{"en":"Some writers use “Baiism” loosely to mean traditional Bai folk religion and local customs.","zh":"有些作者会比较宽泛地用“Baiism”来指白族的传统民间信仰与地方习俗。"}]}],"synonyms":["Bai culture","Bai traditions","Bai folk religion (context-dependent)"],"phonetic":"/ˈbaɪˌɪzəm/","extraExplanation":["“Baiism”不是英语里很常用、很标准的术语；更常见的说法是“Bai culture”（白族文化）、“Bai traditions”（白族传统）或更具体的表达（如“Bai folk religion/rituals”白族民间信仰/仪式）。","如果你是在书名、论文或特定语境中看到“Baiism”，它可能是作者自造或翻译时的用法，含义通常需要结合上下文确认。"]}
{"word":"baijiu","summary":{"en":"Baijiu is a strong traditional Chinese distilled liquor, often served at banquets and toasts.","zh":"Baijiu 指中国传统烈性蒸馏酒“白酒”，常用于宴席与敬酒场合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Chinese distilled liquor, usually made from sorghum (and sometimes other grains), known for its strong aroma and high alcohol content","zh":"白酒；中国传统蒸馏烈酒，常以高粱（也可能混合其他谷物）为原料，特点是香气浓烈、酒精度较高"},"examples":[{"en":"At the banquet, the host poured baijiu for each guest and offered a toast.","zh":"在宴会上，主人给每位客人倒了白酒并敬酒。"},{"en":"Baijiu can taste very strong to people who try it for the first time.","zh":"对白酒初次尝试的人来说，它的味道可能会觉得很烈。"}]}],"synonyms":["Chinese liquor","Chinese spirit","sorghum spirit"],"phonetic":"/ˈbaɪˌdʒoʊ/","extraExplanation":["“白酒”拼音是 báijiǔ，字面意思是“白色的酒/清澈的酒”。英语里常直接用拼音借词 baijiu。","白酒在中国的社交场合很常见，尤其在正式宴请、婚礼、商务饭局等场景里常用于“敬酒（to toast）”。如果你不想喝，可以礼貌说：I’ll just have a small one. / I can’t drink alcohol, but thank you.","常见相关说法：a shot of baijiu（一小杯白酒）；to toast / a toast（敬酒/祝酒）；drink responsibly（适量饮酒）。","文化补充：白酒有不同“香型”（如浓香、酱香、清香等），风味差异很大；很多人对某些香型会更适应。"]}
{"word":"Baikadamov","summary":{"en":"Baikadamov is a surname, and it can also refer specifically to the Kazakh composer Bakhytzhan Baikadamov in cultural or music contexts.","zh":"Baikadamov 是一个姓氏；在文化或音乐语境中也常特指哈萨克作曲家巴赫特詹·拜卡达莫夫。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A surname (family name), most commonly found in Kazakhstan and other Russian-speaking contexts.","zh":"一个姓氏（家族姓），常见于哈萨克斯坦及其他俄语文化语境中。"},"examples":[{"en":"My classmate’s last name is Baikadamov.","zh":"我同学的姓是 Baikadamov。"},{"en":"The article cites Baikadamov as one of the contributors.","zh":"这篇文章引用了 Baikadamov 作为贡献者之一。"}]},{"partOfSpeech":"other","definition":{"en":"Often used to refer to Bakhytzhan Baikadamov, a Kazakh composer; in this sense it functions like a proper name in music and cultural history.","zh":"常用来指哈萨克作曲家巴赫特詹·拜卡达莫夫（Bakhytzhan Baikadamov）；在音乐与文化史语境中相当于专有名词。"},"examples":[{"en":"Our music teacher mentioned Baikadamov in a lesson on Kazakh choral music.","zh":"我们的音乐老师在讲哈萨克合唱音乐时提到了 Baikadamov。"},{"en":"A concert program included works by Baikadamov.","zh":"音乐会节目单中包含了 Baikadamov 的作品。"}]}],"synonyms":["(surname)","(proper name)"],"phonetic":"/baɪˈkɑːdəˌmɑːv/","extraExplanation":["“Baikadamov”多为音译姓氏；在英语中通常不翻译含义，而是按原拼写/音译使用。","在中亚与俄语文化圈中，姓氏常用于正式场合（如论文、新闻、节目单）来指代人物；若要更礼貌、更清晰，可加上名（given name）或头衔（Mr./Ms./Dr.）。","该词的读音在英语里可能因来源语言（俄语/哈萨克语）与个人偏好而略有差异；正式场合可参考当事人自报读音或权威媒体/机构用法。"]}
{"word":"Baikadamova","summary":{"en":"Baikadamova is a feminine-form surname (family name), especially in Russian/Kazakh naming contexts.","zh":"Baikadamova 是一个姓氏的女性形式，常见于俄语/哈萨克语相关的命名语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a feminine-form surname (family name), used especially in Russian- and Kazakh-influenced naming; the feminine counterpart of Baikadamov.","zh":"（姓氏）常见于受俄语与哈萨克语影响的命名体系中；Baikadamov 的阴性（女性）形式。"},"examples":[{"en":"Ms. Baikadamova presented her research at the conference.","zh":"Baikadamova 女士在会议上展示了她的研究。"},{"en":"In the program, the composer is listed as Baikadamova.","zh":"在节目单上，这位作曲家被写作 Baikadamova。"}]}],"synonyms":["Baikadamov (masculine form)"],"phonetic":"/ˌbaɪkəˈdɑːməvə/","extraExplanation":["“Baikadamova”多见于俄语书写体系里的姓氏形式：男性姓常以 -ov 结尾（Baikadamov），女性姓常以 -ova 结尾（Baikadamova）。在英文语境中，这类姓氏通常不翻译，只按原拼写使用。","拼写大小写很重要：作为姓氏一般首字母大写（Baikadamova）。如果你是在书名、论文或名单里看到它，通常指“某位姓 Baikadamova 的人”，具体含义取决于上下文。"]}
{"word":"Baikal","summary":{"en":"Baikal usually refers to Lake Baikal in Russia, a famous deep, ancient freshwater lake; sometimes it can mean the surrounding region.","zh":"Baikal 通常指俄罗斯的贝加尔湖（深且古老的著名淡水湖），有时也可指其周边地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Lake Baikal, a large freshwater lake in southern Siberia, Russia, famous for being extremely deep and very old.","zh":"贝加尔湖（Lake Baikal），位于俄罗斯西伯利亚南部的巨大淡水湖，以“非常深、非常古老”而闻名。"},"examples":[{"en":"Lake Baikal is one of the clearest lakes in the world.","zh":"贝加尔湖是世界上最清澈的湖泊之一。"},{"en":"They traveled to Baikal in winter to see the ice formations.","zh":"他们在冬天去贝加尔湖看冰层的奇景。"},{"en":"The documentary explains why Baikal is so important for biodiversity.","zh":"这部纪录片解释了贝加尔湖为何对生物多样性如此重要。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) The Baikal region or area around Lake Baikal.","zh":"（较少见）贝加尔湖周边地区（泛指“贝加尔地区”）。"},"examples":[{"en":"Local cultures in the Baikal region have long depended on the lake.","zh":"贝加尔地区的地方文化长期以来都依赖这座湖。"},{"en":"Wildfires can affect air quality around Baikal.","zh":"野火可能影响贝加尔湖周边的空气质量。"}]}],"synonyms":["Lake Baikal"],"phonetic":"/ˈbaɪkɑːl/","extraExplanation":["“Baikal”通常直接指贝加尔湖；在新闻或地理语境中，也可能指“贝加尔湖周边地区”。","贝加尔湖常被称为“西伯利亚的蓝眼睛”，也是俄罗斯文学与纪实作品中常出现的地名意象，常用来传达辽阔、寒冷、纯净、神秘等氛围。"]}
{"word":"baikalite","summary":{"en":"Baikalite is a rare green decorative stone named after Lake Baikal in Russia.","zh":"Baikalite 指一种以俄罗斯贝加尔湖命名的罕见绿色装饰石材。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare green ornamental stone (a mineral variety) found especially in the Lake Baikal region of Russia, sometimes described as a kind of “Baikal jade.”","zh":"一种较少见的绿色观赏石（矿物的变种），主要产于俄罗斯贝加尔湖一带，有时被称作“贝加尔玉/贝加尔翡翠”（类似玉石的装饰性石材）。"},"examples":[{"en":"The museum label says the pendant is carved from baikalite from Siberia.","zh":"博物馆的说明牌写着这枚吊坠是用西伯利亚的贝加尔石（baikalite）雕刻的。"},{"en":"Collectors value baikalite for its deep green color and polish.","zh":"收藏者看重贝加尔石（baikalite）深绿色的色泽和良好的抛光效果。"}]}],"synonyms":["Baikal jade","ornamental stone","jade (loosely)"],"phonetic":"/ˈbaɪkəˌlaɪt/","extraExplanation":["“Baikalite”这个名称来自俄罗斯的贝加尔湖（Lake Baikal）。它属于较偏地质/矿物学与宝石收藏领域的词，在日常英语中不常见。不同资料对其具体矿物归类可能会有差异，但在使用时通常指贝加尔湖附近出产、可用于雕刻或装饰的绿色石材。"]}
{"word":"baikerinite","summary":{"en":"“Baikerinite” is not a standard English word; it’s likely a misspelling or a specialized proper name.","zh":"“baikerinite”不是标准英语词，可能是拼写错误或某个专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a made-up word, or a specialized proper name (for example, a brand name, username, or the name of a mineral/chemical).","zh":"这不是标准英语词汇。它可能是拼写错误、造词，或某个专门领域的专有名称（例如品牌名、用户名，或矿物/化学物质名称）。"},"examples":[{"en":"I couldn’t find “baikerinite” in a dictionary—could you share the sentence where you saw it?","zh":"我在词典里找不到“baikerinite”——你能把你看到它的句子发我吗？"},{"en":"If you mean “biker,” that’s a person who rides a motorcycle.","zh":"如果你想说的是“biker”，那指骑摩托车的人。"},{"en":"If you mean “Bakelite,” it’s an early type of plastic.","zh":"如果你想说的是“Bakelite（电木）”，那是一种早期塑料。"}]}],"phonetic":"/baɪˈkɛrɪnaɪt/","extraExplanation":["如果你告诉我它出现的上下文（句子/领域：地质、化学、游戏、小说等），我可以更准确判断它是否是：\n1）某个矿物名（很多矿物以 -ite 结尾）；\n2）人名/地名的派生词；\n3）你想输入的近似词（如 biker, bicarbonate, Bakelite 等）。\n也欢迎你发一张截图或链接。"]}
{"word":"baikerite","summary":{"en":"“Baikerite” appears to be a rare mineral name used mainly in specialist geology contexts.","zh":"“baikerite”看起来是一种主要出现在专业地质/矿物学语境中的罕见矿物名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral name (used in geology/mineralogy), referring to a specific naturally occurring inorganic compound found in some rock deposits","zh":"（地质/矿物学）一种罕见矿物的名称，指在某些岩石矿床中发现的特定天然无机化合物"},"examples":[{"en":"Bai​kerite is rarely mentioned outside specialist mineralogy references.","zh":"“baikerite”在矿物学专业资料之外很少被提及。"},{"en":"The field guide listed baikerite as a minor mineral in the deposit.","zh":"野外指南把“baikerite”列为该矿床中的次要矿物。"}]}],"synonyms":["(no common synonyms; proper mineral name)"],"phonetic":"/ˈbaɪkəˌraɪt/","extraExplanation":["“baikerite”不是常见英语词汇，更像是矿物名或专有名词。在公开的通用词典中通常查不到。","它也可能是拼写差异或误拼：不少矿物名以“-ite”结尾（表示“某某矿物/岩石”），例如 calcite（方解石）、graphite（石墨）。如果你是在论文、矿物清单或标签上看到它，建议提供上下文或来源（书名/数据库/句子），我可以帮你确认是否应为其他更常见的拼写（如 bakerite 等）。"]}
{"word":"baikie","summary":{"en":"“Baikie” is likely a misspelling of “bikie,” an Australian/NZ informal word for a motorcyclist, often implying a motorcycle gang member.","zh":"“baikie”很可能是“bikie”的误拼；“bikie”是澳新英语的非正式说法，指摩托车骑手，且常暗示摩托车帮派成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Australia, New Zealand, informal) A person who rides a motorcycle; especially a member of a motorcycle gang (often linked with organized crime).","zh":"（澳大利亚/新西兰，非正式）摩托车骑手；尤指摩托车帮派成员（常与有组织犯罪联系，带贬义或警务语境色彩）。"},"examples":[{"en":"Police arrested several bikies after the fight outside the nightclub.","zh":"警方在夜店外的斗殴事件后逮捕了几名摩托车帮派成员。"},{"en":"In Australia, the word “bikie” often suggests a gang member, not just a rider.","zh":"在澳大利亚，“bikie”常常让人想到帮派成员，而不只是一般骑士。"}]}],"synonyms":["motorcyclist","biker","outlaw biker","motorcycle gang member"],"phonetic":"/ˈbaɪki/","extraExplanation":["你输入的“baikie”更常见的拼写是 **bikie**（澳新英语俚语）。如果你本来想查的是别的词（比如名字、品牌或其他语言的词），可以告诉我使用场景/句子，我再帮你确认正确拼写与含义。","“bikie”在澳大利亚媒体与法律新闻中很常见，通常指“摩托车黑帮成员”（如 outlaw motorcycle gang）。因此在正式写作中需注意语气与偏见，可用更中性的说法如 “motorcyclist”（摩托车骑士/骑手）来表达普通骑手。"]}
{"word":"Baikonur","summary":{"en":"Baikonur is best known as the Baikonur Cosmodrome, a major space launch site in Kazakhstan, and it can also refer to the nearby city.","zh":"“Baikonur”最常指哈萨克斯坦的拜科努尔航天发射场，也可指附近同名城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a spaceport in Kazakhstan (the Baikonur Cosmodrome), historically used by the Soviet Union and still used by Russia for launching spacecraft and satellites.","zh":"拜科努尔（位于哈萨克斯坦的航天发射场，即“拜科努尔航天发射场”），历史上由苏联使用，至今仍是俄罗斯发射航天器和卫星的重要基地。"},"examples":[{"en":"Yuri Gagarin launched into space from Baikonur in 1961.","zh":"1961年，尤里·加加林从拜科努尔升空进入太空。"},{"en":"Many Soyuz missions have departed from Baikonur.","zh":"许多“联盟号”任务都是从拜科努尔起飞的。"}]},{"partOfSpeech":"n.","definition":{"en":"the nearby city that supports the spaceport; it shares the same name: Baikonur.","zh":"为航天发射场提供配套支持的附近城市，也叫“拜科努尔”。"},"examples":[{"en":"Engineers live and work in Baikonur during launch preparations.","zh":"在发射准备期间，工程师会在拜科努尔生活和工作。"}]}],"synonyms":["Baikonur Cosmodrome","spaceport","cosmodrome"],"phonetic":"/ˌbaɪkəˈnʊr/","extraExplanation":["“Baikonur”常见搭配是“Baikonur Cosmodrome（拜科努尔航天发射场）”。它最初是苏联的关键航天基地，后来所在地区成为哈萨克斯坦领土；俄罗斯目前以租赁方式继续使用该发射场。","在一些历史资料里，“Baikonur”一度被用作误导性的地名（与真正的发射地不完全对应），用于保密；因此你可能会在旧文献中看到不同的地理指称方式。"]}
{"word":"Bail","summary":{"en":"Bail most commonly means temporary release from custody (or the money paid for it). It can also mean to scoop water out of a boat, or (informally) to leave suddenly.","zh":"Bail最常指“保释/保释金”；也可指“把船里的水舀出去”；口语中还可表示“临时退出、突然离开”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"temporary release from custody while waiting for trial, usually with money or a promise to return","zh":"（保释）在等待审判期间的暂时释放，通常需交钱或承诺按时出庭"},"examples":[{"en":"The judge granted him bail, and he went home that night.","zh":"法官准许他保释，他当晚就回家了。"},{"en":"She was released on bail while the case continued.","zh":"案件审理期间，她被保释释放。"}]},{"partOfSpeech":"n.","definition":{"en":"money paid to secure someone’s temporary release from custody","zh":"（保释金）为获得暂时释放而缴纳的款项"},"examples":[{"en":"His family couldn’t afford the bail.","zh":"他的家人付不起保释金。"},{"en":"They posted bail the next morning.","zh":"他们第二天早上缴纳了保释金。"}]},{"partOfSpeech":"vt.","definition":{"en":"to release someone from custody by paying bail or promising they will appear in court","zh":"（使）保释；通过缴纳保释金或担保出庭而获释"},"examples":[{"en":"They bailed him out after the arrest.","zh":"他被逮捕后，他们把他保释出来了。"},{"en":"A lawyer helped bail her out quickly.","zh":"律师帮她很快办好了保释。"}]},{"partOfSpeech":"v.","definition":{"en":"to remove water from a boat using a container","zh":"（把船里的水）舀出去；排水"},"examples":[{"en":"We had to bail water out of the boat during the storm.","zh":"暴风雨中我们不得不把船里的水舀出去。"},{"en":"He grabbed a bucket and started bailing.","zh":"他拿起一个桶开始舀水。"}]},{"partOfSpeech":"vi.","definition":{"en":"to leave suddenly, often to avoid trouble or because you no longer want to be involved","zh":"（口语）临时退出；突然离开（常为避麻烦或不想继续参与）"},"examples":[{"en":"I’m sorry—I have to bail early.","zh":"抱歉——我得提前走了。"},{"en":"Don’t bail on me when things get hard.","zh":"事情变难时别抛下我不管。"}]}],"synonyms":["bond","release","post bond","scoop out","leave","back out"],"phonetic":"/beɪl/","extraExplanation":["“Bail”在法律语境里指“保释/保释金”。常见搭配：grant bail（准许保释）、set bail（设定保释金额）、post bail（缴纳保释金）、be released on bail（获得保释）。不同国家和地区的保释制度细节可能不同。","“Bail out”除了“把（某人）保释出来”，还常指“救助/纾困（公司、银行等）”：The government bailed out the airline.（政府救助了这家航空公司。）"]}
{"word":"bail","summary":{"en":"“Bail” most commonly means money paid to release an accused person until trial; as a verb it can mean to release someone on bail, to leave suddenly (informal), or to scoop water out of a boat.","zh":"“Bail”最常指“保释金”；作动词可指“保释某人”、（口语）“突然离开/临时退出”，或“把船里的水舀出去”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Money paid to a court to allow a person accused of a crime to be released from jail until their trial, with the promise they will return.","zh":"（保释）向法院缴纳的一笔钱，使被指控犯罪的人在审判前可以暂时获释，并承诺按时出庭。"},"examples":[{"en":"He was released on bail after his family paid $5,000.","zh":"他家人支付了5000美元后，他获得保释出狱。"},{"en":"The judge denied bail because the suspect might flee.","zh":"法官因嫌疑人可能逃跑而拒绝保释。"}]},{"partOfSpeech":"vt.","definition":{"en":"To release someone from jail by paying bail or promising the court that they will return.","zh":"（通过交保释金或作出保证）使某人获得保释、从拘留中释放。"},"examples":[{"en":"They bailed him out the next morning.","zh":"他们第二天早上把他保释出来了。"},{"en":"Her lawyer tried to bail her out before the weekend.","zh":"她的律师试图在周末前把她保释出来。"}]},{"partOfSpeech":"vi.","definition":{"en":"To leave a place or situation quickly, especially to avoid trouble or because you no longer want to stay.","zh":"（口语）匆忙离开；（尤指为避开麻烦或不想继续）溜走、退出。"},"examples":[{"en":"It was getting awkward, so I bailed early.","zh":"气氛变得尴尬，所以我提前溜了。"},{"en":"He bailed on the plan at the last minute.","zh":"他在最后一刻退出了计划。"}]},{"partOfSpeech":"v.","definition":{"en":"To remove water from a boat using a container; also, the water removed from a boat.","zh":"（用容器）把船里的水舀出去；（也可指）舀出的水。"},"examples":[{"en":"We had to bail water out of the canoe after the storm.","zh":"暴风雨后我们不得不把独木舟里的水舀出去。"},{"en":"The boat was leaking, so they kept bailing.","zh":"船在漏水，所以他们一直在往外舀水。"}]}],"synonyms":["bond","release","secure release","leave (informal)","ditch (informal)","scoop out"],"phonetic":"/beɪl/","extraExplanation":["在美国法律语境中，bail（保释金）常与“出庭保证”绑定：若被告按时出庭，保释金可能退还；若不到庭，可能“forfeit bail”（没收保释金）。","口语里常见固定搭配：bail out（把某人保释出来/在经济上救助）、bail on（临时爽约/退出）。注意语气：bail on 往往带有“不负责任”的负面评价。"]}
{"word":"bailable","summary":{"en":"Bailable means legally allowed to be released on bail; less commonly, able to be bailed out (of water).","zh":"bailable 指“可保释的”；较少见也可指“可把水舀（抽）出去的（如船）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Law) Allowed to be released from jail after paying bail or meeting bail conditions.","zh":"（法律）可保释的；符合保释条件的（交保证金或满足条件后可获释）。"},"examples":[{"en":"The judge decided the offense was bailable, so he could await trial at home.","zh":"法官认为该罪名可保释，所以他可以在家等待审判。"},{"en":"Not every charge is bailable, especially if the person is a flight risk.","zh":"并非所有指控都可保释，尤其是当当事人有潜逃风险时。"}]},{"partOfSpeech":"adj.","definition":{"en":"Able to be bailed out (especially of a boat) by removing water.","zh":"（尤指船）可排水的；可以把水舀（抽）出去的。"},"examples":[{"en":"The small boat is bailable with a bucket if it takes on water.","zh":"这艘小船如果进水，可以用桶把水舀出去。"}]}],"synonyms":["eligible for bail","bondable","releasable on bail"],"phonetic":"/ˈbeɪləbəl/","extraExplanation":["“bailable”主要用于英美法律语境，指案件或罪名在法律上允许保释（release on bail）。是否“bailable”通常取决于罪名严重性、是否有逃跑或危害社会的风险、以及当地法律规定。","注意区分：bail（保释金/保释）是名词和动词；bail out（帮助脱困/紧急跳伞；也可指把船里的水舀出去）是常见短语；bailable 是形容词。"]}
{"word":"bailage","summary":{"en":"Bailage is a rare historical word meaning a bailiff’s district/jurisdiction or the bailiff’s office.","zh":"bailage 是罕见的历史用词，指执达吏的辖区/管辖范围，或执达吏的职务与行政体系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) The district or jurisdiction governed by a bailiff; the area under a bailiff’s authority.","zh":"（历史用语）由“执达吏/地方行政官”（bailiff）管理的辖区；其管辖范围。"},"examples":[{"en":"In medieval records, the town was listed as part of the bailage of a nearby castle.","zh":"在中世纪的档案中，这个城镇被列为附近城堡所属的执达吏辖区。"},{"en":"Taxes were collected differently depending on which bailage a village belonged to.","zh":"一个村庄隶属于哪个执达吏辖区，征税方式就可能不同。"}]},{"partOfSpeech":"n.","definition":{"en":"A bailiff’s office, rank, or administrative system (the institution, not just the place).","zh":"执达吏的职务/职位，或其行政体系（指制度而不只是地域）。"},"examples":[{"en":"The charter described the duties attached to the bailage.","zh":"该特许状描述了执达吏职务所附带的职责。"}]}],"synonyms":["bailiage","bailiwick","jurisdiction","district"],"phonetic":"/ˈbeɪliɪdʒ/","extraExplanation":["“bailage”在现代英语中非常少见，更多见的形式是 **bailiage**（同义、较常见拼写）。有时也会与 **bailiwick**（执达吏辖区/职权范围）一起比较理解。","该词多出现在中世纪或近代早期的法律、土地与税务文献中；日常英语里通常不会用到。"]}
{"word":"Bailar","summary":{"en":"“Bailar” is a Spanish verb meaning “to dance.”","zh":"“Bailar”是西班牙语动词，意思是“跳舞”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Spanish) to dance; to move your body rhythmically to music.","zh":"（西班牙语）跳舞；随着音乐有节奏地摆动身体。"},"examples":[{"en":"They love to bailar at family parties.","zh":"他们喜欢在家庭聚会上跳舞。"},{"en":"She learned to bailar salsa when she lived in Mexico.","zh":"她住在墨西哥时学会了跳萨尔萨舞。"}]}],"synonyms":["dance"],"phonetic":"/baɪˈlɑr/","extraExplanation":["“bailar”是西班牙语动词（不定式），相当于英文的“to dance”。日常中你也会看到变位形式：yo bailo（我跳舞）、tú bailas（你跳舞）、él/ella baila（他/她跳舞）、nosotros bailamos（我们跳舞）。","在英语语境里把它当作外来词使用时，常出现在拉丁舞、派对或文化场景中（例如：bailar salsa / bailar tango）。"]}
{"word":"baile","summary":{"en":"“Baile” most commonly refers to a Spanish-style dance/dancing, and it can also mean “town” in Irish (often in place names).","zh":"“Baile”最常指西班牙语中的“舞/舞蹈”，也可指爱尔兰语里的“城镇”（常见于地名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a dance; dancing (from Spanish, often used when talking about Spanish/Latin dance or culture)","zh":"舞；舞蹈（源自西班牙语，常用于谈论西班牙/拉丁舞或相关文化）"},"examples":[{"en":"They performed a traditional Spanish baile at the festival.","zh":"他们在节日上表演了一段传统的西班牙舞。"},{"en":"The class focuses on flamenco baile and basic footwork.","zh":"这节课重点练习弗拉门戈舞和基础脚步。"}]},{"partOfSpeech":"n.","definition":{"en":"(Irish) a town or settlement; often seen in Irish place names","zh":"（爱尔兰语）城镇；聚落（常见于爱尔兰地名中）"},"examples":[{"en":"In Irish, “baile” can mean “town,” as in some place names.","zh":"在爱尔兰语中，“baile”可以表示“城镇”，常出现在一些地名里。"},{"en":"Dublin’s Irish name includes “Baile,” meaning “town.”","zh":"都柏林的爱尔兰语名称中含有“Baile”，意思是“城镇”。"}]}],"synonyms":["dance","dancing","flamenco (context)","town (Irish sense)","village (Irish sense)"],"phonetic":"ˈbaɪleɪ","extraExplanation":["在英语里你可能会在两种场景看到 baile：\n1）西班牙语借词：baile 在西语里就是“舞/舞蹈”，英语写作中常用来营造西班牙文化氛围，尤其在谈弗拉门戈（flamenco）时。\n2）爱尔兰语地名元素：baile 表示“城镇/聚落”，常出现在爱尔兰语地名中（例如一些以 Baile 开头的地名）。\n\n发音在英语里可能会因来源不同而变化；下面给的是较常见的英语近似读法。"]}
{"word":"bailed","summary":{"en":"“Bailed” is the past form of “bail,” meaning either left suddenly/quit (informal), paid for someone’s release from jail, or removed water from a boat.","zh":"“bailed”是“bail”的过去式，可表示（口语）突然离开/退出，也可表示“保释（出狱）”或“把船里的水舀出去（排水）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of “bail”) to leave a place or situation suddenly, often to avoid trouble or because you don’t want to continue (informal).","zh":"（“bail”的过去式/过去分词）突然离开某个地方或退出某件事，常因不想继续或想避开麻烦（非正式）。"},"examples":[{"en":"He bailed before the meeting ended.","zh":"会议还没结束他就溜了。"},{"en":"I’m sorry—I bailed on dinner because I felt sick.","zh":"抱歉——我因为不舒服就爽约没去吃晚饭。"},{"en":"Don’t bail on your teammates when things get hard.","zh":"事情变难时别丢下队友不管。"}]},{"partOfSpeech":"vt.","definition":{"en":"(law) to pay money so someone can be released from jail until their trial; or to be released this way.","zh":"（法律）支付保释金使某人暂时获释等待审判；或（某人）被保释获释。"},"examples":[{"en":"His family bailed him out the next morning.","zh":"第二天早上他家人把他保释出来了。"},{"en":"She was bailed and must return to court next month.","zh":"她已获保释，但必须下个月出庭。"}]},{"partOfSpeech":"vt.","definition":{"en":"to remove water from a boat using a container (a bailer), especially to stop it from sinking.","zh":"用容器把船里的水舀出去（排水），以免下沉。"},"examples":[{"en":"We bailed water for an hour after the storm.","zh":"暴风雨后我们舀水排了一个小时。"},{"en":"They bailed the canoe as it started taking on water.","zh":"独木舟开始进水时，他们赶紧把水舀出去。"}]}],"synonyms":["left","quit","backed out","ditched (informal)","posted bail","scooped out (water)"],"phonetic":"/beɪld/","extraExplanation":["“bail”在口语里很常见，尤其是搭配：bail (on someone/something)=爽约/中途退出；bail out (of something)=从困境中抽身或退出（也可指“帮助某人脱困”）。不同语境下可能是“溜走”、也可能是“保释”或“排水”，看上下文判断。"]}
{"word":"bailee","summary":{"en":"A bailee is the party that temporarily holds and must take care of someone else’s property under a bailment.","zh":"bailee指在寄托/保管关系中暂时占有并负有保管责任的一方（受托保管人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or organization that temporarily receives and is legally responsible for someone else’s property (the goods) under a bailment agreement.","zh":"（受托保管人）在“寄托/保管（bailment）”关系中，暂时接收并对他人财物负有法律责任的人或机构。"},"examples":[{"en":"When you leave your car with a valet, the parking company becomes the bailee.","zh":"你把车交给代客泊车时，停车公司就成了受托保管人（bailee）。"},{"en":"The warehouse acted as a bailee for the importer’s goods until delivery.","zh":"仓库在交付前作为进口商货物的受托保管人。"},{"en":"As a bailee, the shop must take reasonable care of the items you leave for repair.","zh":"作为受托保管人，店家必须对你送修的物品尽到合理的保管义务。"}]}],"synonyms":["custodian","holder","depositary"],"phonetic":"/ˌbeɪˈli/","extraExplanation":["“bailee”是法律英语常见词，来自“bailment（寄托/保管关系）”。三方常一起出现：bailor（寄托人/交付保管者）→把物交给→bailee（受托保管人）→所交付的物→bailment（法律关系）。","日常生活中的例子：干洗店、维修店、寄存柜/行李寄存处、仓库、代客泊车等都可能在法律上成为bailee。","bailee通常不是物品的“所有人”，但对物品负有“合理注意义务（reasonable care）”。如果因疏忽导致损坏/丢失，可能要承担责任。"]}
{"word":"bailees","summary":{"en":"“Bailees” is the plural of “bailee,” meaning people/organizations who temporarily hold someone else’s property and must care for and return it.","zh":"“Bailees”是“bailee”的复数，指在法律上的寄托/保管关系中暂时保管他人财物并负有照管与归还义务的人或机构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of bailee) People or organizations that temporarily receive and hold someone else’s property under a legal arrangement (a bailment), with a duty to take reasonable care of it and return it.","zh":"（bailee 的复数）在“寄托/保管（bailment）”法律关系下，暂时接收并保管他人财物的人或机构；有义务合理照管并在约定时归还。"},"examples":[{"en":"In the contract, the storage company and its employees are the bailees responsible for the goods.","zh":"在合同中，仓储公司及其员工是对货物负有责任的受寄人（bailees）。"},{"en":"Hotels are often considered bailees of guests’ luggage when they take it into their custody.","zh":"当酒店接管客人的行李时，酒店通常被视为行李的受寄人（bailees）。"}]}],"synonyms":["custodians","holders","depositaries"],"phonetic":"/ˌbeɪˈliː/","extraExplanation":["“bailee/bailees”常见于英美法语境，日常英语里不常用。相关概念：bailor（委托人/寄托人，把财物交出去的人）与 bailee（受寄人/受托保管人，接收并保管的人）。典型场景包括寄存行李、干洗店保管衣物、修理厂保管车辆等。","注意它与“bail（保释）”是不同词源和不同含义：bailee 主要与财物保管（bailment）有关，而保释的“bail”与刑事程序相关。"]}
{"word":"bailer","summary":{"en":"A bailer is a bucket/scoop (or sometimes a person/device) used to remove water by bailing it out, especially from a boat.","zh":"bailer 指用来舀水排水的桶/勺状工具（有时也指舀水的人或排水装置），常见于船只排水场景。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A container (often a bucket or scoop) used to remove water from a boat or another place by dipping and pouring.","zh":"（常为桶或勺状器具）舀水并倒出，用来把船里或其他地方的水舀出去的工具。"},"examples":[{"en":"Keep a bailer in the canoe in case rainwater collects inside.","zh":"在独木舟里放一个舀水器，以防雨水积在船舱里。"},{"en":"He used a small bailer to scoop water out of the leaking boat.","zh":"他用一个小舀水器把漏水的船里的水舀出去。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or device that bails water out (removes water).","zh":"舀水的人；（更常见于技术语境）排水装置。"},"examples":[{"en":"On small fishing boats, someone may act as the bailer during rough weather.","zh":"在小渔船上，遇到风浪时可能需要有人专门负责舀水。"},{"en":"The emergency kit included a pump and a manual bailer.","zh":"应急包里有一个抽水泵和一个手动舀水器。"}]}],"synonyms":["scoop","bucket","dipper","bailing bucket"],"phonetic":"/ˈbeɪlər/","extraExplanation":["“bailer”来自动词“to bail”，意思是“把水舀出去/排出”。在日常英语里更常用的搭配是“bailer bucket（舀水桶）”或直接说“a bucket to bail water out”。","注意不要和“bailor”混淆：bailor（更法律/金融）指“保释担保人”或“出让财产的一方”，发音相近但含义不同。"]}
{"word":"bailers","summary":{"en":"“Bailers” usually means tools (or people) that scoop water out; informally, it can also mean people who suddenly leave or quit.","zh":"“bailers”通常指舀水/排水的工具或舀水的人；在口语中也可指临时离开或放弃的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a container or tool used to scoop water (or other liquid) out of a boat, tank, or hole","zh":"（把水等液体）舀出、排出用的容器或工具；（船上的）舀水器"},"examples":[{"en":"Keep a bailer in the boat in case rainwater collects inside.","zh":"船上要备一个舀水器，以防雨水积在船里。"},{"en":"They used a plastic bailer to remove water from the flooded canoe.","zh":"他们用一个塑料舀水器把独木舟里的积水舀出去。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who removes water from a boat by scooping it out","zh":"舀水排水的人；（把船里水舀出去的）舀水者"},"examples":[{"en":"Two bailers worked nonstop to keep the small boat from sinking.","zh":"两名舀水者不停地舀水，才让小船没有沉下去。"},{"en":"He acted as a bailer while the others rowed.","zh":"其他人划船时，他负责舀水排水。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) people who suddenly leave a place or give up on a plan (“bail” on something)","zh":"（非正式）临时跑路的人；临阵退出的人（对某事“bail on”）"},"examples":[{"en":"A few bailers left the party early when the music got too loud.","zh":"音乐太吵后，有几个人提前从派对溜了。"},{"en":"Don’t be bailers—stay and help finish the project.","zh":"别临阵退出——留下来把项目做完。"}]}],"synonyms":["scoop","dipper","ladle","water bailer","quitter (informal)","flake (informal)"],"phonetic":"/ˈbeɪlər/","extraExplanation":["“bailers”是复数。核心动词 bail 一方面指“把水舀出去/排出去”（常见于船只进水的语境），另一方面在口语里也常指“突然离开、放弃计划”（bail on someone/something）。所以 bailer 既可以是“舀水工具/舀水的人”，也可能在非正式语境里指“跑路的人”。"]}
{"word":"Bailey","summary":{"en":"Bailey is most commonly a personal name (first name or surname). It can also mean the outer courtyard of a medieval castle.","zh":"Bailey 最常见是人名（名字或姓氏）；也可指中世纪城堡外墙内的外院/庭院。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name or surname (family name); also used as a place or business name","zh":"人名（名字或姓氏）；也常用作地名或机构/品牌名"},"examples":[{"en":"Bailey is my sister’s name.","zh":"Bailey 是我姐姐的名字。"},{"en":"Mr. Bailey will lead the meeting today.","zh":"Bailey 先生今天将主持会议。"},{"en":"We met at Bailey Park after school.","zh":"放学后我们在 Bailey 公园见面。"}]},{"partOfSpeech":"n.","definition":{"en":"in a medieval castle, the open courtyard area inside the outer walls (often contrasted with the inner stronghold, the keep)","zh":"（中世纪城堡）外墙内的庭院/外院（常与城堡主楼 keep 相对）"},"examples":[{"en":"The villagers gathered in the bailey for safety.","zh":"村民们聚集在外院里寻求安全。"},{"en":"The soldiers moved from the bailey to the keep.","zh":"士兵们从外院进入主楼。"}]}],"synonyms":["courtyard (castle sense)","outer court (castle sense)"],"phonetic":"/ˈbeɪli/","extraExplanation":["作为人名：Bailey 在英语国家可用于男性或女性（更常见于中性名），近几十年在北美作为名字的使用度上升。","词源提示：城堡义的 bailey 来自中古英语，和“有围墙的外院/围场”的概念有关；在城堡结构里常见搭配是 “motte-and-bailey（土丘与外院城堡）”。","文化小提示：Bailey 也是一些知名作品或人物的姓氏，例如电影《It’s a Wonderful Life（美好人生）》中的 George Bailey。"]}
{"word":"bailey","summary":{"en":"Bailey most commonly means the outer courtyard/defended enclosure of a medieval castle; it’s also a common English name (Bailey).","zh":"Bailey 常指中世纪城堡的外堡/外院（外层防御围合区）；也常用作英文人名或姓氏（贝利）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the outer wall or enclosed courtyard of a castle, especially the area inside the outer defenses (also called an “outer ward”).","zh":"（城堡的）外堡；外院：指城堡外层防御墙内的围合空间或院落（也可称“外城/外围庭院”）。"},"examples":[{"en":"The villagers took shelter in the castle’s bailey during the attack.","zh":"袭击时，村民们躲进城堡的外堡里避难。"},{"en":"Markets were sometimes held in the outer bailey near the gate.","zh":"市场有时会在靠近城门的外堡举行。"}]},{"partOfSpeech":"n.","definition":{"en":"a surname or given name (Bailey).","zh":"贝利（Bailey）：英文常见的姓氏或名字。"},"examples":[{"en":"Bailey moved to Chicago for a new job.","zh":"贝利为了新工作搬到了芝加哥。"},{"en":"My friend’s last name is Bailey.","zh":"我朋友的姓是贝利。"}]}],"synonyms":["outer ward","courtyard","enclosure"],"phonetic":"ˈbeɪli","extraExplanation":["“bailey（外堡/外院）”常出现在中世纪城堡语境里，尤其是“motte-and-bailey（土丘与外堡）”城堡结构：motte 指高起的土丘（上建主塔/要塞），bailey 是旁边较大的围场，用于住人、存放物资、饲养牲畜等。","在英国，“the Old Bailey”指伦敦的中央刑事法院（Central Criminal Court），这里的 Bailey 是地名来源，用法与“城堡外堡”相关但属于专有名词语境。"]}
{"word":"baileys","summary":{"en":"Baileys usually refers to Baileys Irish Cream, a sweet Irish cream liqueur often enjoyed in coffee, over ice, or in desserts.","zh":"Baileys 通常指“百利甜（爱尔兰奶油利口酒）”，常加咖啡、加冰饮用或用于甜点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Baileys (also Baileys Irish Cream) is a brand of Irish cream liqueur—an alcoholic drink made with Irish whiskey, cream, and sweet flavoring, often served in coffee or over ice.","zh":"Baileys（也常说 Baileys Irish Cream）是一种爱尔兰奶油利口酒品牌——用爱尔兰威士忌、奶油和甜味调制的酒，常加在咖啡里或加冰饮用。"},"examples":[{"en":"She added a splash of Baileys to her coffee after dinner.","zh":"晚饭后，她在咖啡里加了一点百利甜。"},{"en":"We served Baileys over ice as a dessert drink.","zh":"我们把百利甜加冰当作餐后甜酒来喝。"},{"en":"This cake recipe uses Baileys for a creamy flavor.","zh":"这个蛋糕配方用百利甜来增加奶香风味。"}]},{"partOfSpeech":"n.","definition":{"en":"Baileys can also be a family name or place name (less common in everyday conversation).","zh":"Baileys 也可以是姓氏或地名（在日常对话中较少见）。"},"examples":[{"en":"Ms. Baileys will join the meeting at 3 p.m.","zh":"Baileys 女士会在下午三点参加会议。"}]}],"synonyms":["Baileys Irish Cream","Irish cream liqueur","Irish cream"],"phonetic":"/ˈbeɪliz/","extraExplanation":["在中文里常把 Baileys 翻成“百利甜”，其中“甜”强调它偏甜、奶香浓，口感更像甜品饮料。","常见搭配：Baileys + 冰块（on the rocks）、加进咖啡（类似“爱尔兰咖啡”的甜奶油版本）、或用于烘焙甜点。","它属于含酒精饮品（利口酒），不同地区酒精度数可能略有差异；点单或购买时注意是否需要出示年龄证明。"]}
{"word":"Baileyton","summary":{"en":"Baileyton is a U.S. place name used for several towns/communities.","zh":"Baileyton是美国的一个地名，用于多个城镇/社区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A place name (proper noun): Baileyton is the name of several small towns/communities in the United States (for example, in Tennessee, Alabama, and Virginia).","zh":"地名（专有名词）：“Baileyton”是美国多个小城镇/社区的名称（例如田纳西州、阿拉巴马州、弗吉尼亚州等地）。"},"examples":[{"en":"Baileyton, Tennessee is a small town in Greene County.","zh":"田纳西州的Baileyton是格林县（Greene County）的一个小镇。"},{"en":"I drove through Baileyton on my way to the next town.","zh":"我在去下一个城镇的路上开车经过了Baileyton。"},{"en":"Our meeting address says “Baileyton, AL,” so make sure you choose the Alabama one.","zh":"我们的会议地址写的是“Baileyton, AL（阿拉巴马州）”，所以要选对是阿拉巴马的那个。"}]}],"synonyms":["(no direct synonyms; it is a proper place name)"],"phonetic":"/ˈbeɪliˌtʌn/","extraExplanation":["“Baileyton”属于典型的英语地名构词：常见为姓氏/人名“Bailey” + “-ton”。“-ton”来自古英语，常表示“城镇、聚居地”。因此它大致可理解为“Bailey家的城镇/聚落”（多为历史上以某位地主、早期定居者或家族命名）。","由于美国存在不止一个Baileyton，书写地址时通常会加州缩写（如 TN, AL, VA）来避免混淆。"]}
{"word":"Baileyville","summary":{"en":"Baileyville is a proper noun used as a town/community name (often Baileyville, Maine, USA).","zh":"Baileyville 是一个地名专有名词，用作城镇/社区名称（常指美国缅因州的 Baileyville）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun), used for towns or small communities—most commonly referring to Baileyville, Maine, USA.","zh":"地名（专有名词），用于城镇或小型社区——最常见指美国缅因州的 Baileyville（贝利维尔）。"},"examples":[{"en":"Baileyville is a small town in Washington County, Maine.","zh":"Baileyville 是美国缅因州华盛顿县的一个小镇。"},{"en":"We drove through Baileyville on our way to the Canadian border.","zh":"我们去加拿大边境的路上开车经过了 Baileyville。"}]}],"phonetic":"/ˈbeɪliˌvɪl/","extraExplanation":["“Baileyville” 这种地名常见于英语国家，由人名/姓氏 Bailey + 后缀 -ville 组成；-ville 来自法语，常表示“城镇、聚落”，所以整体常有“贝利家族/名叫贝利的人建立或相关的镇”之意。","美国可能存在不止一个叫 Baileyville 的地方；具体含义通常取决于上下文（州名、县名、邮编等）。"]}
{"word":"bailiage","summary":{"en":"Bailliage is a historical term meaning a district governed by a bailiff, especially in medieval France.","zh":"Bailliage 是历史用语，指由执达吏/地方官管理的辖区，尤用于中世纪法国。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Historical) a district or area under the authority of a bailiff (a local legal/administrative officer), especially in medieval France and some European systems.","zh":"（历史用语）“辖区 / 行政司法区”：由执达吏/地方司法行政官（bailiff）管理的地区，尤指中世纪法国及部分欧洲制度中的行政司法区。"},"examples":[{"en":"In medieval France, a bailliage handled taxes and local justice.","zh":"在中世纪法国，bailliage 负责征税和地方司法。"},{"en":"The document lists villages that belonged to the bailliage of the town.","zh":"文件列出了隶属于该城镇 bailliage 的村庄。"}]}],"synonyms":["bailiwick","jurisdiction","district"],"phonetic":"/ˈbeɪliɪdʒ/","extraExplanation":["你输入的 **bailiage** 常见于对 **bailliage** 的拼写误写；标准拼写多为 **bailliage**（也可见 **bailiwick** 在英语里表示“管辖范围/职责范围”，但语体更现代、更常用）。","**bailliage** 来自法语，和 **bailli**（司法/行政官）同源；在历史研究、法律史、欧洲中世纪语境中更常出现，日常英语里较少用。"]}
{"word":"bailiaries","summary":{"en":"“Biliary” means related to bile or the bile-carrying system (gallbladder and bile ducts).","zh":"“biliary”指与胆汁或胆道系统（胆囊、胆管等）有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to bile (a digestive fluid made by the liver) or to the organs and tubes that carry bile (the biliary system, such as the gallbladder and bile ducts).","zh":"与胆汁（肝脏产生的消化液）有关的；或与输送胆汁的器官与管道（胆道系统，如胆囊与胆管）有关的。"},"examples":[{"en":"The doctor ordered tests to check for biliary disease.","zh":"医生安排检查以确认是否有胆道疾病。"},{"en":"A gallstone can block a biliary duct and cause pain.","zh":"胆结石可能堵住胆管并引起疼痛。"},{"en":"She had surgery for a biliary obstruction.","zh":"她因胆道梗阻接受了手术。"}]}],"synonyms":["of bile","gallbladder-related","bile-duct-related"],"phonetic":"/ˈbɪl.iˌɛr.i/","extraExplanation":["你输入的“bailiaries”很可能是拼写错误；常见正确拼写是 **biliary**（形容词）。如果你想表达“胆道的/胆汁的（问题、系统、疾病等）”，通常用 *biliary*。","常见搭配：*biliary tract*（胆道）、*biliary duct*（胆管）、*biliary colic*（胆绞痛）、*biliary obstruction*（胆道梗阻）。","词源小提示：*biliary* 来自拉丁语 *bilis*（胆汁）。"]}
{"word":"bailiary","summary":{"en":"“Biliary” means related to bile, the gallbladder, or the bile ducts.","zh":"“Biliary”表示“与胆汁、胆囊或胆道有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to bile (a digestive fluid) or the bile ducts and gallbladder.","zh":"与胆汁有关的；与胆道（胆管）或胆囊有关的。"},"examples":[{"en":"The doctor ordered biliary imaging to check for a blockage.","zh":"医生安排了胆道影像检查，以确认是否有阻塞。"},{"en":"Biliary pain can happen when a gallstone blocks the bile duct.","zh":"当胆结石堵塞胆管时，可能出现胆道疼痛。"}]}],"synonyms":["of the bile ducts","gallbladder-related (contextual)"],"phonetic":"/ˈbɪl.iˌer.i/","extraExplanation":["你输入的“bailiary”通常是拼写错误，正确拼写更常见的是 **biliary**（胆汁的／胆道的）。这个词多用于医学语境，如 *biliary tract*（胆道）、*biliary colic*（胆绞痛）。词根来自拉丁语 *bilis*（胆汁）。"]}
{"word":"Bailie","summary":{"en":"Bailie is a Scottish term for a town official or local magistrate, and it can also be used as a title or a surname.","zh":"Bailie是苏格兰用语，指城镇官员或地方治安官；也可作头衔或姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scotland) A local magistrate or municipal officer, similar to a “bailiff” or town official.","zh":"（苏格兰）地方治安官或市政官员，类似“执达吏/市政官”。"},"examples":[{"en":"In many Scottish towns, the bailie represented local authority in civic matters.","zh":"在许多苏格兰城镇，bailie在市政事务中代表地方权力。"},{"en":"The bailie chaired the meeting and announced the decision.","zh":"bailie主持会议并宣布决定。"}]},{"partOfSpeech":"n.","definition":{"en":"A Scottish title used before a person’s name for someone who holds (or held) that office.","zh":"（苏格兰）用于姓名前的称号，指担任（或曾担任）该职位的人。"},"examples":[{"en":"Bailie McDonald spoke on behalf of the council.","zh":"Bailie McDonald代表市议会发言。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname).","zh":"姓氏（Bailie）。"},"examples":[{"en":"Her last name is Bailie.","zh":"她的姓是Bailie。"}]}],"synonyms":["bailiff","magistrate","civic official","town councillor"],"phonetic":"/ˈbeɪli/","extraExplanation":["“bailie”主要见于苏格兰英语与苏格兰历史语境，在现代日常英语中不常用；在阅读苏格兰题材小说、历史资料或地方新闻时更常遇到。","词源上与“bailiff”同源（都与“管理、执行职务”的概念有关），但“bailie”通常更偏向城镇/市政层面的官职。"]}
{"word":"bailie","summary":{"en":"Bailie is a Scottish term for a town official or magistrate, and it can also be a surname.","zh":"Bailie 是苏格兰用语，指城镇官员或地方治安官，也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Scottish municipal officer or magistrate (similar to an alderman), especially in earlier times","zh":"（苏格兰）市政官员；地方治安官（旧时用法，类似市议员或地方官）"},"examples":[{"en":"The bailie helped settle disputes in the town.","zh":"这位市政官帮助调解镇上的纠纷。"},{"en":"In the old records, a bailie is listed among the city officials.","zh":"在旧档案中，“bailie”被列为城市官员之一。"}]},{"partOfSpeech":"n.","definition":{"en":"a surname (family name), especially in Scotland (often spelled Baillie)","zh":"姓氏（家族名），在苏格兰较常见（也常拼作 Baillie）"},"examples":[{"en":"Her last name is Bailie.","zh":"她的姓是 Bailie。"}]}],"synonyms":["magistrate","town official","alderman (roughly similar)"],"phonetic":"/ˈbeɪli/","extraExplanation":["“bailie/baillie”源自中古法语 *bailli*（地方行政长官、司法官），与英语里的 *bailiff*（法警；执达员）同源。现代英语中它多见于苏格兰历史语境、法律/市政史资料，或作为姓氏出现。","在文学中，苏格兰题材作品（例如华尔特·司各特 Walter Scott 的历史小说）里偶尔会出现 *bailie* 指城镇官员。"]}
{"word":"bailieries","summary":{"en":"Bailliery means a bailiff’s district or jurisdiction (rare today).","zh":"Bailliery 指执达吏的辖区/管辖范围（现代英语中较罕见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic) A district or area of authority administered by a bailiff; similar to a bailiwick.","zh":"（罕见/古旧）由执达吏（bailiff）管辖的行政区或司法辖区；类似 bailiwick（管辖范围、职责范围）。"},"examples":[{"en":"In medieval records, the village was listed as part of the bailliery of the local lord.","zh":"在中世纪的档案中，这个村庄被记为当地领主管辖的 bailliery（辖区）之一。"},{"en":"The court’s power did not extend beyond its bailliery.","zh":"法院的权力不超出其 bailliery（管辖区）。"}]}],"synonyms":["bailiwick","jurisdiction","district"],"phonetic":"/ˈbeɪləri/","extraExplanation":["你输入的 **bailieries** 很可能是拼写变体或拼写错误；英语里更常见的形式是 **bailliery**（复数 **baillieries**）或更常用的同义词 **bailiwick**。","**bailliery/bailli-** 这一词根与中世纪的行政与司法体系有关，来源与法语/诺曼法语传统相关，因此在现代英语里多见于历史、法律史或档案语境。"]}
{"word":"bailiery","summary":{"en":"A rare historical word meaning the jurisdiction or district governed by a bailiff; similar to “bailiwick.”","zh":"一个少见的历史词，指执达吏/地方官的管辖区或职权范围，近似于“bailiwick（管辖范围）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) The district, jurisdiction, or office of a bailiff (an official who administered a local area); a bailiwick.","zh":"（历史用语）执达吏/地方官的管辖区或职权范围；相当于“bailiwick（管辖范围）”。"},"examples":[{"en":"In medieval records, a bailliery often appears as a local administrative district under a bailiff.","zh":"在中世纪的文献记录中，bailliery 常指由执达吏管理的地方行政区。"},{"en":"The dispute was handled within the bailliery rather than by the central court.","zh":"这起纠纷在该管辖区内处理，而不是交由中央法院。"}]}],"synonyms":["bailiwick","jurisdiction","district","domain"],"phonetic":"/ˈbeɪləri/","extraExplanation":["这个词非常少见，多见于历史研究、古文献或地方志语境。常与中古欧洲的行政体系相关：bailiff（执达吏/地方行政官）负责征税、治安、司法执行等事务，因此 bailliery 指他的辖区或职务范围。","拼写上容易与更常见的 bailiwick 混淆；现代英语中通常用 bailiwick 来表示“某人的职责范围/擅长领域”。"]}
{"word":"bailies","summary":{"en":"“Bailies” is most often the plural of “bailie” (a Scottish municipal officer) and can also be the plural of “bailey” (a castle’s outer courtyard).","zh":"“bailies”多指“bailie（苏格兰市政官员/地方治安官）”的复数，也可指“bailey（城堡外庭）”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of bailie: a local magistrate or municipal officer (especially in Scotland).","zh":"bailie 的复数：地方治安官或市政官员（尤指苏格兰）。"},"examples":[{"en":"In old Scottish records, the bailies oversaw local markets and disputes.","zh":"在旧的苏格兰档案里，bailies 负责监管集市并处理纠纷。"},{"en":"The town council met with the bailies to discuss public order.","zh":"镇议会与这些市政官员（bailies）会面，讨论治安问题。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of bailey: the outer courtyard of a castle, inside the walls.","zh":"bailey 的复数：城堡城墙内的外庭/外院（城堡的外部庭院）。"},"examples":[{"en":"Archaeologists found workshops in the castle’s outer bailies.","zh":"考古学家在城堡外庭（outer bailies）发现了作坊遗迹。"},{"en":"People gathered in the bailies during the festival.","zh":"节日期间，人们聚集在城堡的庭院（bailies）里。"}]}],"synonyms":["magistrates","municipal officers","castle courtyards","outer courts"],"phonetic":"/ˈbeɪliz/","extraExplanation":["很多学习者会把 **bailies** 和 **dailies** 混淆：**dailies** 才是“日报；（影视）每日样片”的常用拼写与说法；**bailies** 通常是较少见的历史/地域用法（如苏格兰的市政官员）或城堡结构术语的复数。"]}
{"word":"bailieship","summary":{"en":"Bailieship is an old term meaning the office, authority, jurisdiction, or term of a bailie (especially a Scottish local magistrate).","zh":"Bailieship 是较古旧的词，指（尤指苏格兰）地方治安官 bailie 的职务、权力/辖区或任期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the office, authority, or jurisdiction of a bailie (a local magistrate or official, especially in Scotland).","zh":"（尤指苏格兰）bailie（地方官/治安官）的职务、权力或管辖范围。"},"examples":[{"en":"In old Scottish records, disputes were sometimes settled within the bailieship rather than a higher court.","zh":"在一些古老的苏格兰档案中，纠纷有时会在该治安官的管辖范围（bailieship）内解决，而不是上诉到更高法院。"},{"en":"He was appointed to the bailieship of the burgh for a term of one year.","zh":"他被任命担任该自治市镇的治安官职务（bailieship），任期一年。"}]},{"partOfSpeech":"n.","definition":{"en":"the period or term during which someone holds the position of bailie.","zh":"担任 bailie（地方官/治安官）职务的任期。"},"examples":[{"en":"During her bailieship, new rules were introduced for market trading.","zh":"在她担任治安官的任期（bailieship）内，市场交易出台了新规定。"}]}],"synonyms":["office","jurisdiction","magistracy","tenure"],"phonetic":"/ˈbeɪliʃɪp/","extraExplanation":["“bailieship”较为古旧、地域性强，主要见于苏格兰历史文献与法律/市政记录中；现代英语里更常见的是直接用“bailie”，或用更通用的说法如“office/jurisdiction of a magistrate”。","词尾“-ship”常用于表示“身份、职务、状态或领域”（如 friendship, leadership），因此 bailie + -ship 可理解为“治安官的职位/辖区/任期”。"]}
{"word":"bailiff","summary":{"en":"A bailiff is usually a court officer who maintains order and assists the judge; historically it can also mean an official who managed land or collected rent.","zh":"bailiff通常指法庭法警，维持秩序并协助法官；历史上也可指管理土地或收租的官员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A court official who keeps order in the courtroom, announces the judge, and may escort jurors, witnesses, or prisoners.","zh":"（法庭）法警；负责维持法庭秩序、宣布法官入庭，并可能押送陪审员、证人或被告的人。"},"examples":[{"en":"The bailiff asked everyone to stand as the judge entered.","zh":"法警要求大家在法官入庭时起立。"},{"en":"During the trial, the bailiff escorted the jury in and out of the courtroom.","zh":"审判期间，法警护送陪审团进出法庭。"}]},{"partOfSpeech":"n.","definition":{"en":"In some places (especially historically), an official who manages land or collects rents for an estate or local authority.","zh":"（某些地区，尤指历史上）庄园/地方的管理官；负责管理土地或收取租金的官员。"},"examples":[{"en":"In older novels, the bailiff often visits tenants to collect rent.","zh":"在一些较老的小说里，管理官（bailiff）常去找佃户收租。"}]}],"synonyms":["court officer","court attendant","sheriff's deputy","marshal"],"phonetic":"/ˈbeɪ.lɪf/","extraExplanation":["“bailiff”在美式英语里最常见的是“法庭法警”。在英国英语中，你也可能见到“court bailiff”或“enforcement agent”，指负责执行法院命令、追讨欠款或收回财产的人；不同地区的具体职责会有差异。","词源上与“bail（保释/担保）”同源，来自古法语词根，含有“照管、负责”的意思，所以它的核心概念是“被授权去管理/执行的人”。"]}
{"word":"bailiffry","summary":{"en":"Bailiffry means a bailiff’s office/duties or the district under a bailiff’s authority.","zh":"bailiffry 指执达吏/法警的职务与职责，或其管辖范围（辖区）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the office, position, or duties of a bailiff (an official who enforces court orders or manages property)","zh":"（bailiff 的）职务、职位或职责；执达吏/法警的职权范围"},"examples":[{"en":"He was appointed to the bailiffry of the county court.","zh":"他被任命为该郡法院的执达吏（法警）职位。"},{"en":"Records from the 1600s mention the bailiffry as part of the local administration.","zh":"17世纪的档案把“bailiffry（执达吏职务）”记为地方行政体系的一部分。"}]},{"partOfSpeech":"n.","definition":{"en":"the area or district where a bailiff has authority; a bailiff’s jurisdiction","zh":"执达吏/法警的管辖区；其职权辖区"},"examples":[{"en":"The dispute happened within the bailiffry, so the bailiff handled it.","zh":"纠纷发生在该执达吏的辖区内，因此由他处理。"},{"en":"The town lay just outside the bailiffry.","zh":"这个城镇刚好在该辖区之外。"}]}],"synonyms":["bailiwick","jurisdiction","office","authority"],"phonetic":"/ˈbeɪlɪfri/","extraExplanation":["“bailiffry”是较古老、较少见的词，常见于历史文献、法律史或地方行政的语境。现代英语里更常用的近义词包括“bailiwick”（指某人的管辖范围/职责范围）以及更直白的“jurisdiction”（管辖权/辖区）。"]}
{"word":"bailiffs","summary":{"en":"Bailiffs are officials who enforce rules—most commonly court officers who assist the judge and maintain order; historically (esp. in the UK) they could also manage estates or collect rents.","zh":"bailiffs 指负责执行与管理的官员——最常见是法院法警，协助法官并维持秩序；历史上（尤指英国）也可指庄园管事或收租人员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a court officer who keeps order in the courtroom, helps the judge, and may escort jurors or deliver documents","zh":"（法院的）法警；法庭执行官（维持法庭秩序、协助法官、带领陪审团或递送文件等）"},"examples":[{"en":"The bailiff asked everyone to stand when the judge entered.","zh":"法警要求法官入庭时大家起立。"},{"en":"After the verdict, the bailiff escorted the jury out of the courtroom.","zh":"宣判后，法警护送陪审团离开法庭。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in British English, historical or formal) an official who manages an estate or is responsible for collecting rents/taxes and enforcing rules","zh":"（尤指英式英语，较历史/正式）庄园管事；收租/征税并执行管理规定的官员"},"examples":[{"en":"In old stories, the bailiff collected rent for the landowner.","zh":"在旧故事里，管事为地主收租。"},{"en":"The estate hired a bailiff to oversee the fields and workers.","zh":"庄园雇了一位管事来管理田地和工人。"}]}],"synonyms":["court officer","court attendant","marshal (US, in some contexts)","estate manager (historical)"],"phonetic":"/ˈbeɪlɪf/","extraExplanation":["在美式英语里，bailiff 最常指“法庭里的法警”。在英式英语中，它也常见于历史或法律语境，指管理庄园、收租或执行规定的人。","词源来自中古法语，和“管理、看管”有关，所以核心含义是“负责执行与管理的人”。"]}
{"word":"bailiffship","summary":{"en":"Bailiffship means the position/term of a bailiff, or historically the area a bailiff controls.","zh":"bailiffship 指执达吏的职位/任期；历史上也可指其管辖区域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the office, job, or term of service of a bailiff (an official who keeps order in court or manages legal/property duties)","zh":"执达吏（或法庭警卫等）的职位、职务，或任期"},"examples":[{"en":"During his bailiffship, he was responsible for keeping order in the courtroom.","zh":"在他担任执达吏期间，他负责维持法庭秩序。"},{"en":"Her bailiffship ended after two years of service.","zh":"她的执达吏任期在服务两年后结束。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) the district or area under a bailiff’s authority; a bailiwick","zh":"（历史用法）由执达吏管辖的区域；管区"},"examples":[{"en":"The village lay within the bailiffship of the local manor.","zh":"这个村庄属于当地庄园执达吏的管区。"},{"en":"Records describe tax disputes across the bailiffship.","zh":"档案记载了该管区内的税务纠纷。"}]}],"synonyms":["office","post","tenure","bailiwick"],"phonetic":"/ˈbeɪlɪfˌʃɪp/","extraExplanation":["“bailiffship”由“bailiff（执达吏/法庭警卫）+ -ship（表示职位、身份或任期，如 friendship, leadership）”构成，因此常用来强调“职位/任期/管辖范围”。在现代英语里更常见的相关词是“bailiff”本身，以及表示管辖领域的“bailiwick”。"]}
{"word":"bailiffwick","summary":{"en":"Bailiwick means someone’s area of responsibility or expertise; historically, it was a bailiff’s jurisdiction.","zh":"bailiwick 指某人的职责或专长范围；历史上也指执达吏等官员的管辖区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person’s area of responsibility, expertise, or special interest (what they are in charge of or know best).","zh":"某人的职责范围、专长领域或特别熟悉/感兴趣的范围（“管得到、懂得最多的那一块”）。"},"examples":[{"en":"Budget planning isn’t really my bailiwick—ask Mei, she handles finance.","zh":"预算规划不太算我的专长——去问美，她负责财务。"},{"en":"Public health policy is within the minister’s bailiwick.","zh":"公共卫生政策属于部长的职责范围。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical) The district or legal jurisdiction controlled by a bailiff.","zh":"（历史用法）执达吏/治安官等官员所管辖的地区或司法辖区。"},"examples":[{"en":"In medieval records, the village is listed as part of the bailiwick of York.","zh":"在中世纪的档案里，这个村庄被列为约克的一个辖区（bailiwick）的一部分。"}]}],"synonyms":["area","domain","sphere","province","jurisdiction","field"],"phonetic":"/ˈbeɪliwɪk/","extraExplanation":["“bailiwick”常被误写成“bailiffwick”。标准拼写是 bailiwick。","词源上与“bailiff（执达吏/地方官）”有关：-wick/-wic 表示“居住地、区域”。因此它先有“辖区”的意思，后来引申为“职责/专长范围”。"]}
{"word":"bailing","summary":{"en":"“Bailing” usually means removing water from a boat; informally it can mean leaving suddenly (“bailing out”); in legal contexts it can relate to getting someone released on bail.","zh":"“bailing”通常指把船里的水舀出/排出；口语里也可指临时退出（bailing out）；法律语境下与“保释”相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of removing water from a boat or container (using a bucket, pump, etc.)","zh":"把船或容器里的水舀出/排出（水）"},"examples":[{"en":"The canoe was leaking, so we started bailing as fast as we could.","zh":"独木舟在漏水，所以我们开始尽可能快地把水舀出去。"},{"en":"After the storm, the fishermen spent an hour bailing water from the boat.","zh":"暴风雨过后，渔民花了一个小时把船里的积水排出去。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) the act of leaving a situation suddenly, especially to avoid trouble or responsibility; often used as “bailing out”","zh":"（非正式）临时退出、突然离开（尤指为躲麻烦或逃避责任）；常用作“bailing out”"},"examples":[{"en":"He apologized for bailing at the last minute.","zh":"他为自己最后一刻临时退出而道歉。"},{"en":"Don’t count on her—she has a habit of bailing out when things get hard.","zh":"别太指望她——一旦事情变难，她就常常临阵退出。"}]},{"partOfSpeech":"n.","definition":{"en":"the process of arranging for someone to be released from jail by paying bail; often used as “bailing (someone) out”","zh":"（法律）交保释金使人获释的过程；常用作“bailing (someone) out”"},"examples":[{"en":"She spent the night bailing her brother out of jail.","zh":"她花了一整晚为哥哥办理保释出狱的事。"},{"en":"They called a lawyer to help with the bailing process.","zh":"他们联系了律师来协助办理保释手续。"}]}],"synonyms":["scooping (out)","pumping out","backing out","quitting","dropping out"],"phonetic":"/ˈbeɪlɪŋ/","extraExplanation":["“bailing”来自动词 bail。常见搭配：bail out（退出/救助/保释）。语境不同含义差很大：在水上活动里多指“把水舀出去”；在口语里常指“临阵退出”；在法律语境里指“保释”。","注意拼写区别：bail（保释/把水舀出）≠ bale（打包成捆，如 bale of hay 一捆干草）。有些学习者会把 bailing 和 baling 混淆。"]}
{"word":"bailiwick","summary":{"en":"Bailiwick means your particular area of expertise or responsibility; historically, it was a sheriff’s jurisdiction.","zh":"bailiwick 指某人的专长或职责范围；历史上也指治安官的管辖区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"someone’s area of special knowledge, responsibility, or influence; a topic or kind of work they are good at","zh":"（某人的）专长范围；职责/影响范围；擅长的领域"},"examples":[{"en":"Marketing isn’t really my bailiwick—I work on product design.","zh":"市场营销不太算我的专长——我做的是产品设计。"},{"en":"Local housing issues fall within the city council’s bailiwick.","zh":"本地住房问题属于市议会的职责范围。"}]},{"partOfSpeech":"n.","definition":{"en":"the area (especially a district) controlled by a sheriff; a jurisdiction (historical or formal)","zh":"（尤指历史上）郡治安官的管辖区；司法/行政辖区（较正式或旧式）"},"examples":[{"en":"In old records, the sheriff’s bailiwick covered several nearby towns.","zh":"在旧档案里，治安官的管辖区包括附近几个城镇。"}]}],"synonyms":["specialty","area of expertise","domain","province","jurisdiction"],"phonetic":"/ˈbeɪliˌwɪk/","extraExplanation":["“bailiwick”原指“治安官（bailiff）的辖区（-wick=区域/村镇）”，后来在现代英语里更常被借用为比喻义：某人“熟悉、擅长或负责的领域”。","语体上偏正式，常见搭配：within someone’s bailiwick（在某人的职责/专长范围内）、not my bailiwick（不归我管/不是我擅长的）。"]}
{"word":"bailiwicks","summary":{"en":"Bailiwicks means areas of responsibility or expertise (plural of bailiwick).","zh":"bailiwicks 是 bailiwick 的复数，指多个“职责范围/专长领域”（也可指历史上的多个辖区）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Someone’s area of responsibility, expertise, or activity; the things they are in charge of or know best.","zh":"某人的职责范围、专长领域或主要负责的事务。"},"examples":[{"en":"Cybersecurity isn’t really in my bailiwick—ask the IT team.","zh":"网络安全不是我的专长——去问 IT 团队吧。"},{"en":"Hiring and training are in her bailiwick, so she’ll lead the interviews.","zh":"招聘和培训是她的职责范围，所以她会主导面试。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical) A district or area under the authority of a bailiff (an official who managed local law and order).","zh":"（历史义）由法警/地方官（bailiff）管辖的地区或辖区。"},"examples":[{"en":"In medieval records, a bailiwick referred to land administered by a bailiff.","zh":"在中世纪文献中，bailiwick 指由地方官管理的土地辖区。"}]}],"synonyms":["domain","area","field","realm","sphere","jurisdiction","specialty","province"],"phonetic":"ˈbeɪliwɪk","extraExplanation":["“bailiwick”来自中古英语，原意与“bailiff（法警/地方官）”有关，指其管辖区。现代英语里多用比喻义，表示“你的地盘/你负责的范围/你的专业领域”。","你输入的“bailiwicks”是复数形式，表示多个职责范围或多个辖区。"]}
{"word":"Baillaud","summary":{"en":"Baillaud is a French surname, often seen in astronomy history (e.g., Benjamin Baillaud).","zh":"Baillaud 是一个法国姓氏，常见于天文学史（如本雅明·拜约）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A French surname, best known from notable people in science (especially astronomy), such as Benjamin Baillaud (1848–1934).","zh":"一个法国姓氏，因科学界（尤其天文学界）名人而较为人熟知，例如本雅明·拜约（Benjamin Baillaud，1848–1934）。"},"examples":[{"en":"Baillaud was a key figure in early international cooperation in astronomy.","zh":"拜约是早期天文学国际合作中的重要人物。"},{"en":"I saw Baillaud mentioned in a history of observatories in France.","zh":"我在一本关于法国天文台历史的书里看到提到拜约。"}]}],"phonetic":"/baɪˈjoʊ/","extraExplanation":["“Baillaud”常出现在天文学史与天文机构史的语境中。最常被提及的是Benjamin Baillaud：他曾参与推动国际天文学组织与合作（如与测时、测经度、天文观测协调相关的工作），因此在学术史料中较常见。","作为专有名词（姓氏），“Baillaud”本身通常不翻译；中文多采用音译“拜约/拜欧”等（不同译名可能并存）。"]}
{"word":"bailli","summary":{"en":"A medieval French royal official who governed a district and administered justice.","zh":"中世纪法国的王室地方官，管理辖区并行使司法权。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in medieval France) a royal officer who governed a district, collected revenue, and administered justice; similar to a bailiff or sheriff.","zh":"（中世纪法国）王室官员，负责管理一个辖区、征税/收取收入并主持司法；类似于执达吏或郡长。"},"examples":[{"en":"The bailli oversaw the king’s taxes and courts in the region.","zh":"这位 bailli 负责该地区国王的税收与法庭事务。"},{"en":"In the novel, the villagers feared the bailli’s authority.","zh":"在小说中，村民们畏惧 bailli 的权力。"}]}],"synonyms":["bailiff","royal official","sheriff","magistrate"],"phonetic":"/baɪˈiː/","extraExplanation":["“bailli”来自法语历史用语，常见于关于中世纪法国的历史书、小说或学术写作中；现代日常英语里不常用，更常用的对应词是“bailiff（执达吏）”“sheriff（郡长）”或更泛化的“royal official（王室官员）”。","相关文化背景：在法国封建与王权扩张时期，bailli 往往代表国王在地方行使行政、财政与司法权力；南法有时会出现相近角色“sénéchal（总管/王室地方长官）”。"]}
{"word":"bailliage","summary":{"en":"A historical term for a bailiff’s (bailli’s) jurisdiction or administrative district, especially in medieval France.","zh":"历史用语：司法官（bailli/执达吏）管辖的辖区或行政区，尤指中世纪法国。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A district or jurisdiction governed by a bailiff (especially in medieval France); the area under a bailli’s authority.","zh":"（历史用语）由司法官/执达吏（尤其是中世纪法国的“bailli”）管辖的辖区；其职权范围。"},"examples":[{"en":"In medieval France, the king divided the realm into bailliages for administration and justice.","zh":"在中世纪法国，国王把王国内部分为若干个 bailliage，用于行政管理与司法。"},{"en":"The dispute was tried in the local bailliage rather than in a distant royal court.","zh":"这起纠纷在当地的 bailliage 受审，而不是在遥远的王室法庭。"}]}],"synonyms":["bailiwick","jurisdiction","district"],"phonetic":"ˈbaɪliɪdʒ","extraExplanation":["“bailliage”是法语借词，常见于历史、法律史或中世纪研究语境；英语日常中很少使用。","相关人物“bailli”（王室司法/行政官）可类比为代表君权在地方行使司法与行政职能的官员；其管辖范围就称为“bailliage”。","英语里更常用的近似词是“bailiwick”（职责范围/管辖区），但“bailliage”更偏法国历史制度的专用术语。"]}
{"word":"Baillie","summary":{"en":"“Baillie” most commonly appears as a surname, and in Scottish historical contexts it can also mean a town magistrate/municipal officer (variant: “bailie”).","zh":"“Baillie”最常见作姓氏；在苏格兰历史语境中也可指市镇法官/市政官（变体拼写：bailie）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Scottish local official (historically), similar to a town magistrate or municipal officer; also spelled “bailie.”","zh":"（苏格兰历史上）地方官员/市政官，类似市镇法官或市政执事；也拼作“bailie”。"},"examples":[{"en":"In old Scottish towns, a baillie helped enforce local laws and manage civic affairs.","zh":"在旧时的苏格兰城镇里，baillie 会协助执行地方法规并管理市政事务。"},{"en":"The museum label mentions a baillie who served the burgh in the 1700s.","zh":"博物馆的说明牌提到一位在18世纪为该自治市（burgh）服务的 baillie。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname); sometimes used as a given name.","zh":"姓氏（也偶尔用作名字）。"},"examples":[{"en":"Dr. Baillie will present the findings at the conference.","zh":"Baillie 博士将在会议上展示研究结果。"},{"en":"Her last name is Baillie, spelled B-A-I-L-L-I-E.","zh":"她的姓是 Baillie，拼作 B-A-I-L-L-I-E。"}]}],"synonyms":["bailie"],"phonetic":"/ˈbeɪli/","extraExplanation":["“Baillie”作官职名时更偏苏格兰语/历史语境，现代英语里更常见的是拼法“bailie”，并且多出现在历史书写、地名介绍或档案材料中。","“Baillie”作为姓氏在英语世界较常见；文学与历史上也可见到著名人物，如苏格兰剧作家 Joanna Baillie（乔安娜·贝利）。"]}
{"word":"baillie","summary":{"en":"“Baillie” is usually a Scottish surname, and it can also be a Scottish spelling of “bailie,” a historical town official or magistrate.","zh":"“Baillie”通常是苏格兰姓氏；也可作苏格兰拼写的“bailie”，指历史上的市政官员/治安官。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), common in Scotland and other English-speaking places","zh":"（人名）姓氏“Baillie”，在苏格兰及其他英语地区较常见"},"examples":[{"en":"My professor’s last name is Baillie.","zh":"我教授的姓是 Baillie。"},{"en":"She traced the Baillie family history back to Scotland.","zh":"她把 Baillie 家族的历史追溯到苏格兰。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scottish) a variant spelling of “bailie”: a local magistrate or town official in Scotland (historical/official use)","zh":"（苏格兰）“bailie”的一种拼写：指地方治安官/市政官员（多为历史或正式语境）"},"examples":[{"en":"In old Scottish towns, a bailie (also spelled Baillie) helped govern the burgh.","zh":"在旧时的苏格兰城镇里，bailie（也可写作 Baillie）协助管理自治市。"},{"en":"The records mention a Baillie who handled local disputes.","zh":"记录中提到一位 Baillie 负责处理地方纠纷。"}]}],"synonyms":["Bailey (surname variant)","bailie (Scottish official)"],"phonetic":"/ˈbeɪli/","extraExplanation":["“Baillie”常让学习者困惑，因为它既可能是姓氏，也可能是苏格兰英语里“bailie”的变体拼写。阅读历史文本或苏格兰背景作品时，看到首字母大写的 Baillie 更可能是头衔/职位或姓氏，需要结合上下文判断。","发音通常与更常见的姓“Bailey”相同；拼写不同但读音接近，检索资料时可同时搜索 Baillie / Bailey / bailie。"]}
{"word":"Baillieu","summary":{"en":"Baillieu is a surname, especially well known in Australian contexts, and it also appears in names of institutions (e.g., a library).","zh":"Baillieu 是一个姓氏，在澳大利亚语境中较知名，也常见于机构名称中（如图书馆）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), most notably connected with Australia (e.g., the Baillieu family in business, philanthropy, and public life).","zh":"一个姓氏（家族姓），在澳大利亚语境中尤为常见/知名（例如与商界、慈善与公共事务相关的 Baillieu 家族）。"},"examples":[{"en":"The Baillieu family has supported several cultural and educational projects in Australia.","zh":"Baillieu 家族在澳大利亚支持了多个文化与教育项目。"},{"en":"I visited the Baillieu Library at the University of Melbourne.","zh":"我参观了墨尔本大学的 Baillieu 图书馆。"}]}],"phonetic":"/ˈbeɪljuː/","extraExplanation":["“Baillieu”多被视为法语来源的姓氏，常见读法接近“BAY-lyoo”（/ˈbeɪljuː/）。在澳大利亚，除了作为人名，也会出现在机构或建筑名称中（如图书馆、基金会等），通常是为了纪念或标示与该家族的捐助/历史关联。"]}
{"word":"baillone","summary":{"en":"“baillone” is not a common English word; it’s probably a misspelling or a proper name.","zh":"“baillone”不是常见英语单词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a proper name (surname/place).","zh":"不是标准英语单词，可能是拼写错误，或是专有名词（如姓氏/地名）。"},"examples":[{"en":"I can’t find “baillone” in major English dictionaries—could you mean “balloon” or “bail bond”?","zh":"在主要英语词典里找不到“baillone”——你是不是想写“balloon（气球）”或“bail bond（保释保证金）”？"},{"en":"If “Baillone” is a person’s name, please share the sentence so I can explain it in context.","zh":"如果“Baillone”是人名，请把完整句子发来，我可以结合语境解释。"}]}],"phonetic":"/ˌbeɪˈloʊn/","extraExplanation":["“baillone”看起来像拼写偏差：常见的接近词包括 balloon（气球）、bail（保释/保释金）、baillon/baillone（可能是法语或意大利语姓氏的拼写变体）。","如果你是从图片/手写体/字幕里看到的，这类词最容易被误读。把原句、来源语言（英语/法语/意大利语等）或截图发来，我能更准确判断。"]}
{"word":"Baillonella","summary":{"en":"Baillonella is a scientific genus name for certain large African rainforest trees (Sapotaceae).","zh":"Baillonella 是一个植物学属名，指非洲雨林中山榄科的一类大型乔木。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of large African tropical trees in the sapodilla family (Sapotaceae), best known for the species Baillonella toxisperma (often called moabi), valued for its oil-rich seeds and timber.","zh":"（植物）鲍利奥内拉属：非洲热带的大型乔木属，属于山榄科（Sapotaceae）。最著名的物种是 Baillonella toxisperma（常称“莫阿比树/非洲山榄”），因其富含油脂的种子和木材而被重视。"},"examples":[{"en":"Baillonella is a botanical name you may see in research on Central African rainforest trees.","zh":"Baillonella 是一个植物学名称，你可能会在关于中非雨林树种的研究中看到它。"},{"en":"The species Baillonella toxisperma is often discussed in connection with moabi oil production.","zh":"物种 Baillonella toxisperma 常与“莫阿比油”的生产一起被讨论。"}]}],"synonyms":["moabi (common name for Baillonella toxisperma)"],"phonetic":"/ˌbaɪəˈnɛlə/","extraExplanation":["“Baillonella”是拉丁化的科学命名，常见于植物分类学或生态学文献中；日常英语里更常用的往往是具体物种的俗名（如 moabi）。","该属（尤其是 B. toxisperma）在部分地区与食用油、传统用途和木材贸易相关，因此也常出现在“雨林保护/可持续利用”的语境里。"]}
{"word":"baillonella","summary":{"en":"Baillonella is the scientific genus name for certain tropical African trees in the Sapotaceae family.","zh":"Baillonella 是山榄科中一类非洲热带树木的科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical African trees in the sapodilla family (Sapotaceae), especially known for species valued for timber and oil.","zh":"非洲热带地区的一类树木属名（山榄科 Sapotaceae），尤其以可产优质木材与油脂的物种而为人所知。"},"examples":[{"en":"Baillonella is a genus in the Sapotaceae family found in tropical Africa.","zh":"Baillonella 是山榄科的一个属，分布在非洲热带地区。"},{"en":"The best-known Baillonella species is harvested for its wood and oil.","zh":"Baillonella 中最知名的物种常因木材和油脂而被采伐利用。"}]}],"synonyms":["moabi (common name for a well-known species)"],"phonetic":"/ˌbaɪəˈloʊnɛlə/","extraExplanation":["“Baillonella”是拉丁化的科学属名，常见于植物学、林业与生态保护领域；日常英语里并不常用。","学习时可以把它当作“某某属（genus）”来理解：它不是单一的一棵树，而是一组近缘树种的分类名称。","你可能更常看到的具体物种名是 **Baillonella toxisperma**，英文里常被称为 **moabi**（莫阿比树），在中非一些地区与木材、食用/化妆用油脂以及保护议题有关。"]}
{"word":"Bailly","summary":{"en":"“Bailly” is most commonly a French-origin surname; more rarely, it can be an older spelling of “bailli,” a historical local official (similar to a bailiff).","zh":"“Bailly”最常见是法语来源的姓氏；较少见时也可作“bailli”的旧式拼写，指历史上的地方官员（类似执达吏/司法行政官）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), often of French origin","zh":"（姓氏）常见的法语来源姓氏"},"examples":[{"en":"Marie Bailly is listed as a contributor in the report.","zh":"报告中列出了玛丽·贝伊（Bailly）作为撰稿人。"},{"en":"I met Dr. Bailly at the conference.","zh":"我在会议上见到了贝伊医生。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical, rare in modern English) a variant spelling of French “bailli,” meaning a local royal officer or administrator—similar to a “bailiff”","zh":"（历史用法；现代英语较少）法语“bailli”的一种拼写，指地方的王室官员/行政长官，类似“执达吏/地方司法行政官”"},"examples":[{"en":"In some older texts, “Bailly” appears as a title for a local official.","zh":"在一些较旧的文本中，“Bailly”会作为地方官员的头衔出现。"},{"en":"The bailli (sometimes spelled Bailly) collected taxes and enforced orders.","zh":"bailli（有时拼作 Bailly）负责征税并执行命令。"}]}],"synonyms":["(surname) —","(historical sense) bailli","bailiff"],"phonetic":"/ˈbaɪli/","extraExplanation":["“Bailly”更常见于人名（姓）。如果你是在阅读历史材料或中世纪题材文本，可能会遇到它作为“bailli”的变体拼写；但现代英语里更常用的对应词通常是“bailiff”。","著名同姓人物包括18世纪法国天文学家兼巴黎市长 Jean-Sylvain Bailly（让-西尔万·贝伊）。"]}
{"word":"bailment","summary":{"en":"A legal arrangement where someone temporarily holds another person’s property and must return it as agreed.","zh":"一种法律上的保管/寄托安排：他人暂时占有你的物品，并需按约归还。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A legal relationship in which one person (the bailor) temporarily gives personal property to another person (the bailee) to hold, use, or transport, with the duty to return it (or deal with it as agreed).","zh":"（法律）寄托/保管关系：一方（寄托人）将动产暂时交给另一方（受托保管人）保管、使用或运输，并负有按约定返还（或按约处理）的义务。"},"examples":[{"en":"When you leave your coat at a restaurant’s coat check, a bailment is created.","zh":"你把外套交给餐厅的寄存处时，就形成了一个保管（bailment）关系。"},{"en":"The garage became the bailee when it stored the customer’s car overnight.","zh":"修车厂替顾客把车过夜存放时，就成为受托保管人（bailee）。"},{"en":"The contract described the bailment and required the company to return the equipment in good condition.","zh":"合同说明了该保管关系，并要求公司把设备完好归还。"}]}],"synonyms":["custody","entrustment","deposit","care","keeping"],"phonetic":"/ˈbeɪlmənt/","extraExplanation":["bailment 常见于英美普通法体系（common law）的财产法与合同法语境，核心点是“占有/控制权的临时转移”，但所有权通常仍在寄托人（bailor）手中。","典型场景包括：行李寄存、干洗店收衣、停车场代管车辆、快递/运输保管等。","与“sale（买卖）”不同：买卖是所有权转移；与“gift（赠与）”不同：赠与通常不要求返还。bailment 的关键是返还义务与保管注意义务（care/duty）。"]}
{"word":"bailments","summary":{"en":"“Bailments” (plural of “bailment”) refers to legal situations where someone temporarily holds another person’s property for a purpose, and must return it or deal with it as agreed.","zh":"“Bailments”（bailment 的复数）指法律上的寄托/保管关系：他人暂时占有你的动产以实现某目的，并应按约定返还或处理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Law) The temporary transfer of possession of personal property to someone else, with the agreement that it will be returned or handled for a specific purpose.","zh":"（法律）“寄托/保管”关系：把动产暂时交给他人占有（不转移所有权），约定其按特定目的保管、使用或处理，并在之后归还或按约定交付。"},"examples":[{"en":"Leaving your car with a parking garage can create a bailment.","zh":"把车交给停车场代为保管，可能构成一种寄托（保管）关系。"},{"en":"The courier accepted the package as a bailment and had a duty to take reasonable care of it.","zh":"快递员接收包裹后形成寄托关系，并负有合理注意义务。"},{"en":"In a bailment, ownership stays with the owner, but possession is transferred temporarily.","zh":"在寄托关系中，所有权仍属于原主人，但占有会暂时转移。"}]}],"synonyms":["custody (legal)","entrustment","deposit (civil law)","safekeeping"],"phonetic":"/ˈbeɪlmənt/","extraExplanation":["“bailments”是“bailment”的复数形式，多用于法律语境或合同/侵权纠纷中。常见角色：bailor（寄托人/交付保管者）与 bailee（受托保管人）。","是否构成bailment常取决于：是否实际交付占有、是否有返还或按约定处理的意思表示，以及受托人是否承担一定的注意义务。不同类型（如无偿保管、有偿保管）可能对应不同的注意义务标准。"]}
{"word":"bailo","summary":{"en":"“Bailo” isn’t a common English word; it’s usually a name or a typo for “bail out.” In Spanish, it means “I dance.”","zh":"“bailo” 不是常见英语词；通常是人名或把 “bail out” 拼错了。在西班牙语里它表示“我跳舞”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as (1) a name (surname/brand) or (2) a misspelling of “bail out.”","zh":"不是标准英语单词；最常见的是（1）人名/品牌名，或（2）把 “bail out” 拼错了。"},"examples":[{"en":"I couldn’t find “bailo” in the dictionary—did you mean “bail out”?","zh":"我在词典里找不到 “bailo”——你是不是想写 “bail out”？"},{"en":"Bailo is also used as a family name in some places.","zh":"Bailo 在一些地方也会作为姓氏使用。"}]},{"partOfSpeech":"v.","definition":{"en":"In Spanish (not English), “bailo” means “I dance.”","zh":"在西班牙语中（不是英语），“bailo” 的意思是“我跳舞”。"},"examples":[{"en":"Spanish: Yo bailo salsa los fines de semana.","zh":"西语：我周末跳萨尔萨舞。"}]}],"synonyms":["bail out","bail"],"phonetic":"ˈbaɪloʊ","extraExplanation":["如果你想表达英语里的“保释/救助/退出”，很可能你要找的是：bail（保释；把水舀出）或 bail out（紧急离开；救助；（金融）纾困）。你可以把你的句子发来，我可以帮你确定最合适的词。"]}
{"word":"bailor","summary":{"en":"A bailor is the party who gives property to another person/company to hold temporarily, expecting it to be returned or handled as agreed.","zh":"bailor 指把动产暂时交给他人/公司保管或处理，并期待按约归还或处置的一方（寄托人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or company that temporarily gives possession of personal property to someone else (the bailee) under an agreement that it will be returned or handled in a certain way.","zh":"（保管寄托关系中的）寄托人；把动产交由他人（受托保管人）暂时占有、并约定返还或按约处理的人/公司。"},"examples":[{"en":"The bailor left the car with the repair shop, which acted as the bailee.","zh":"寄托人把车交给修理店保管并维修，而修理店就是受托保管人。"},{"en":"Under the contract, the bailor can demand the equipment back at the end of the rental period.","zh":"按照合同，租期结束时寄托人可以要求归还设备。"}]}],"synonyms":["owner (in a bailment)","depositor","lessor (in some contexts)"],"phonetic":"/ˈbeɪ.lɚ/","extraExplanation":["“bailor”常见于法律与商业语境（如租赁、寄存、维修、仓储、运输）。关键点是：寄托人通常仍保有所有权（ownership），只是把占有/控制（possession/control）暂时交出去。","容易和“bailee（受托保管人）”混淆：bailee 是接收并负有保管义务的一方；bailor 是交付并通常有权取回的一方。","词源上与“bail”（保释）不是同一概念；这里的 bail 源自表示“交付、托付”的含义。"]}
{"word":"bailors","summary":{"en":"“Bailors” is the plural of “bailor”: the owner who hands over property temporarily to a bailee in a bailment.","zh":"“bailors”是“bailor”的复数：在寄托/保管（bailment）关系中，把财物暂时交给受托人（bailee）的所有者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or organization that temporarily gives possession of personal property to another (the bailee) under a legal arrangement called a bailment, while still keeping ownership","zh":"（法律）出托人；把动产交由他人（受托人）暂时保管或使用的人/机构（所有权仍归出托人）"},"examples":[{"en":"In a rental agreement, the company is the bailor and the customer is the bailee.","zh":"在租赁协议中，公司是出托人（bailor），顾客是受托人（bailee）。"},{"en":"The bailors demanded the return of their equipment after the project ended.","zh":"项目结束后，出托人要求归还他们的设备。"}]}],"synonyms":["owners (in a bailment)","depositors","lessors (in some contexts)"],"phonetic":"/ˈbeɪlərz/","extraExplanation":["“bailors”是“bailor”的复数，多用于合同、租赁、寄存、维修保管等法律/商业语境。常见搭配：bailor and bailee（出托人与受托人）、bailment agreement（寄托/保管协议）、return the property（返还财物）。","容易与“bailer(s)”混淆：bailer 指“舀水器/舀水的人”（如船上舀水的工具），发音相同或相近，但含义完全不同。法律语境一般写 bailor(s)。"]}
{"word":"bailout","summary":{"en":"Bailout means financial or practical help that saves someone or an organization from serious trouble; it can also mean to rescue by giving such help.","zh":"bailout 指“救助/纾困”（多为财政或政策援助），也可作动词表示“出手救助、解围（常通过提供资金）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"money, help, or an action that saves a person, company, or country from serious trouble (often financial trouble)","zh":"“救助；纾困”：用金钱、援助或措施把个人、公司或国家从严重困境（常为财务危机）中解救出来"},"examples":[{"en":"The government approved a bailout for the failing banks.","zh":"政府批准了对濒临倒闭银行的救助。"},{"en":"Many taxpayers opposed the bailout because it used public money.","zh":"许多纳税人反对这次救助，因为它动用了公共资金。"},{"en":"Without a bailout, the airline said it would cut thousands of jobs.","zh":"这家航空公司表示，如果没有救助就将裁减数千个岗位。"}]},{"partOfSpeech":"vt.","definition":{"en":"to help someone or something out of serious trouble, especially by providing money","zh":"（用资金等）救助；纾困：帮助某人或某事摆脱严重困境，尤指提供资金支持"},"examples":[{"en":"The central bank stepped in to bail out the company.","zh":"央行出手救助了这家公司。"},{"en":"Her parents bailed her out after the business lost money.","zh":"生意亏损后，她父母出钱帮她渡过难关。"}]}],"synonyms":["rescue","financial aid","relief","support","lifeline","emergency funding"],"phonetic":"/ˈbeɪlˌaʊt/","extraExplanation":["“bailout”在新闻与经济语境里非常常见，尤其指政府或机构对“大而不倒”的行业/公司提供紧急资金或政策支持。2008年全球金融危机中美国的银行救助（bank bailout）让这个词被广泛讨论。","和“bail”相关但不同：bail（保释金）是法律语境；bail out（把某人从困境中救出来/提供钱）是更广义的“解围”。因此“a bailout”多指“救助方案/救助资金”，而“bail someone out”多指“救某人”。"]}
{"word":"bailouts","summary":{"en":"Bailouts are financial rescues—often by the government—to save failing institutions, or more generally any help that gets someone out of trouble.","zh":"Bailouts 指“纾困/救助”：多为政府对濒危机构的财政救助；也可泛指任何让人脱困的援助。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Money, loans, or other help given to save a company, bank, or economy from serious trouble (often by the government).","zh":"（通常由政府提供的）纾困/救助资金或援助，用来挽救陷入严重困境的公司、银行或经济体系。"},"examples":[{"en":"After the financial crisis, several banks survived only because of government bailouts.","zh":"金融危机后，一些银行之所以能撑下去，主要是因为政府的纾困。"},{"en":"Taxpayers were angry about the bailout of a failing airline.","zh":"纳税人对救助一家濒临倒闭的航空公司感到愤怒。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of helping someone out of a difficult situation, especially by paying money or taking responsibility.","zh":"（帮人）脱困；尤其指用钱解围或替人承担责任。"},"examples":[{"en":"His parents gave him a bailout when he couldn’t pay his rent.","zh":"他付不起房租时，父母出钱帮他解了围。"},{"en":"She asked her friend for a last-minute bailout.","zh":"她向朋友求助，希望对方临时救她一把。"}]}],"synonyms":["rescues","financial assistance","government aid","relief","lifeline"],"phonetic":"/ˈbeɪlˌaʊts/","extraExplanation":["“bailout”由短语动词“bail out”演变而来：bail 原指把船里的水舀出去（让船不沉），后来引申为“把（人/组织）从危险中救出来”。","在新闻语境里，bailout 常带有价值判断：支持者认为是“防止系统性崩溃”，反对者认为会造成“道德风险”（moral hazard），让企业更敢冒险，因为觉得出事会被救。"]}
{"word":"bailpiece","summary":{"en":"A bailpiece is a small part that forms or serves as a bail (loop/handle) used for hanging, carrying, or attaching something.","zh":"bailpiece 指构成或充当提环/吊环的一个小部件，用于悬挂、提拿或连接物品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small part or fitting that forms a bail (a loop or handle), especially the loop/attachment that lets something be carried, hung, or connected (for example, on jewelry, small hardware, or instruments).","zh":"（尤指五金、小器具或首饰上的）提环/吊环部件；用于提拿、悬挂或连接的环状配件。"},"examples":[{"en":"The pendant’s bailpiece was bent, so the chain wouldn’t sit straight.","zh":"吊坠的吊环部件弯了，所以项链挂起来不正。"},{"en":"A replacement bailpiece can help you attach the tag securely.","zh":"换一个提环部件可以让你把标签牢固地挂上去。"}]}],"synonyms":["bail","loop","bail fitting","hanger","attachment"],"phonetic":"/ˈbeɪlˌpis/","extraExplanation":["这个词比较少见，通常出现在工艺、五金或首饰制作语境里。核心意思是“bail（提环/吊环）的一部分”。在日常英语里，人们更常说 bail（吊环/提环）、bail/loop fitting（吊环配件）或 pendant bail（吊坠吊环）。"]}
{"word":"bails","summary":{"en":"“Bails” most often refers to (1) bail money/legal release, or (2) the verb “bails,” meaning to pay bail or help someone out of trouble.","zh":"“bails”最常指（1）保释金/保释制度，或（2）动词第三人称“bails”，表示缴保释金或（口语）帮人脱困。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(law) Money paid to the court so a person who has been arrested can be released while waiting for trial; also, the system/process of releasing someone with this money and conditions.","zh":"（法律）保释金；也指“保释”这一制度/程序：交钱并遵守条件，在审判前获释。"},"examples":[{"en":"The judge set bail at $5,000.","zh":"法官将保释金定为5000美元。"},{"en":"She couldn’t afford bail, so she stayed in jail until the hearing.","zh":"她付不起保释金，所以在听证会前一直被关押。"},{"en":"He was released on bail and had to report to the court weekly.","zh":"他获准保释，但必须每周向法院报到。"}]},{"partOfSpeech":"vt.","definition":{"en":"To pay money so that an arrested person can be released while waiting for trial.","zh":"为被捕者缴纳保释金，使其在审判前获释。"},"examples":[{"en":"His family bailed him out the next morning.","zh":"第二天早上他家人把他保释出来了。"},{"en":"They hired a lawyer to bail her out quickly.","zh":"他们请了律师尽快把她保释出来。"}]},{"partOfSpeech":"vt.","definition":{"en":"To help someone out of trouble, often by giving money or practical support (informal).","zh":"（非正式）帮某人摆脱麻烦（常指出钱或提供实际帮助）。"},"examples":[{"en":"Can you bail me out? I forgot my wallet.","zh":"你能救个急吗？我忘带钱包了。"},{"en":"My friend bailed me out when I missed the deadline.","zh":"我错过截止日期时，朋友帮我解了围。"}]},{"partOfSpeech":"n.","definition":{"en":"Metal bars/rails on a boat that help support a tarp or keep water out; also, a horse’s protective collar in some contexts (less common).","zh":"（较少见）船上的横木/护栏（可支撑篷布或挡水）；在某些语境中也可指马具的护颈部件。"},"examples":[{"en":"The canvas was stretched over the bails of the boat.","zh":"帆布被拉伸并固定在船的横木上。"}]}],"synonyms":["bond","surety","post bail","release on bail","help out","rescue"],"phonetic":"/beɪlz/","extraExplanation":["“bails”最常见的用法来自名词“bail（保释金）”的复数，或动词“bail（保释/解围）”的第三人称单数（he/she bails）。","常见搭配：set bail（定保释金）、post bail（缴保释金）、out on bail（获准保释在外）、bail someone out（把某人保释出来/帮某人解围）。注意：bail out 在口语里非常常用，含义不一定和法律有关。"]}
{"word":"bailsman","summary":{"en":"A bailsman is a person who acts as a surety by providing bail so someone can be released from jail.","zh":"bailsman 指为他人提供保释金或担保、帮助其从监狱获释的人（保释担保人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who provides bail (money or a guarantee) to secure someone’s release from jail; a surety.","zh":"为他人提供保释金或担保以帮助其获释的人；保释担保人。"},"examples":[{"en":"His uncle agreed to act as his bailsman so he could wait for trial at home.","zh":"他叔叔同意做他的保释担保人，这样他就能在家等待审判。"},{"en":"The judge asked whether a reliable bailsman was available.","zh":"法官询问是否有可靠的保释担保人。"}]}],"synonyms":["surety","bail surety","guarantor","bail bondsman"],"phonetic":"/ˈbeɪlz.mən/","extraExplanation":["“bailsman”是较少见、偏法律用语的拼写与用法。在美国日常语境里，更常见的说法是“bail bondsman”（保释担保经纪人/保释金代理人），指以收取费用为职业、替人办理保释担保的人。","在一些英语国家或法律语境中，“bailsman”更接近“surety”（担保人）：不一定是职业经纪人，可能是亲友或第三方为被告提供担保。"]}
{"word":"bailsmen","summary":{"en":"“Bail bondsmen” are people/companies who provide bail for a fee to help someone get released from jail before trial.","zh":"“Bail bondsmen”指（通常收取费用的）保释担保人/保释经纪人，帮助被拘押者在审判前通过保释获释。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or company that provides bail money (usually for a fee) so an arrested person can be released from jail while waiting for court.","zh":"（通常收取费用的）保释担保人/保释经纪人：为被逮捕的人提供保释金担保，使其在等待出庭期间可暂时获释。"},"examples":[{"en":"After the arrest, his family called a bail bondsman to help him get out of jail.","zh":"他被捕后，家人联系了保释经纪人，帮助他先从监狱里出来。"},{"en":"The bail bondsman charged a fee and required collateral.","zh":"保释担保人收取费用，并要求提供抵押物。"}]}],"synonyms":["bail bondsman","bondsman","surety","bail agent"],"phonetic":"/ˈbeɪl ˌbɑndzmən/","extraExplanation":["你写的 **bailsmen** 多半是拼写误差。英语里更常见的是 **bail bondsmen**（复数），单数是 **bail bondsman**。也有人直接说 **bondsman / bondsmen**。","**bail bondsman** 主要出现在美国的刑事司法语境：在一些州，被告可以通过“保释金（bail）”换取候审期间的自由；如果家里拿不出全额保释金，可能会找保释经纪人垫付或担保，并支付一定比例的费用。不同国家/地区制度差异很大，并非所有地方都有这一职业或做法。"]}
{"word":"bailwood","summary":{"en":"“Bailwood” is most commonly used as a surname.","zh":"“Bailwood”最常见的用法是作为姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(usually a proper noun) a surname (family name).","zh":"（通常作专有名词）姓氏（家族名）。"},"examples":[{"en":"Ms. Bailwood will lead the meeting today.","zh":"Bailwood 女士今天将主持会议。"},{"en":"I found an article by Dr. Bailwood.","zh":"我找到一篇由 Bailwood 博士撰写的文章。"}]}],"phonetic":"/ˈbeɪlˌwʊd/","extraExplanation":["“Bailwood”在现代英语里并不是常见词汇，更常见的是作为人名（姓氏）出现，因此一般不会像普通名词那样有固定的词义。","如果你是在某段文字里看到的“bailwood”，也有可能是拼写/识别错误。常见容易混淆的词包括：balsa wood（轻木）、firewood（柴火）、bail out（保释/紧急撤离）等。你可以把原句发我，我可以帮你判断最可能的意思。"]}
{"word":"Baily","summary":{"en":"“Baily” is usually a variant spelling of “bailey,” meaning a castle’s outer courtyard/defended enclosure; it’s also a surname.","zh":"“Baily”通常是“bailey”的拼写变体，可指城堡的外院/外堡；也常用作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled “bailey”) the outer wall or courtyard of a medieval castle, often protected by a moat or defenses.","zh":"（通常拼作“bailey”）中世纪城堡的外院/外堡（常有壕沟或防御设施保护）。"},"examples":[{"en":"Visitors walked across the bridge into the castle’s outer bailey.","zh":"游客穿过桥走进城堡的外院（外堡）。"},{"en":"The soldiers gathered in the bailey before entering the main keep.","zh":"士兵们先在外院集合，然后进入主楼。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname), and sometimes a given name; “Baily” is a less common spelling variant of “Bailey.”","zh":"姓氏（有时也作名字）；“Baily”是“Bailey”的较少见拼法。"},"examples":[{"en":"Her last name is Baily, but people often misspell it as Bailey.","zh":"她的姓是Baily，但人们常把它拼成Bailey。"},{"en":"Mr. Baily will join the meeting at 3 p.m.","zh":"Baily先生会在下午三点参加会议。"}]}],"synonyms":["castle courtyard","outer court","enclosure (castle context)"],"phonetic":"/ˈbeɪli/","extraExplanation":["“Baily”更常见于人名拼写；表示“城堡外院/外堡”的词通常写作“bailey”。\n\n词源上，“bailey”来自中古法语（与“围栏/城墙”相关），因此常出现在描写中世纪城堡结构的历史书或奇幻文学中。常见搭配有：outer bailey（外院/外堡）、inner bailey（内院）。"]}
{"word":"Bain","summary":{"en":"“Bain” is most often a surname or part of a company name; it can also be a place name, and rarely a French-style word meaning “bath.”","zh":"“Bain”最常见是姓氏或公司名的一部分；也可作地名；少数情况下带法语色彩，表示“洗浴/浴池”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname); also used in names of organizations such as Bain & Company.","zh":"姓氏；也常用于机构名称中，如咨询公司 Bain & Company（贝恩公司）。"},"examples":[{"en":"She works at Bain & Company as a consultant.","zh":"她在贝恩公司做咨询顾问。"},{"en":"The report was prepared by Bain for the client.","zh":"这份报告是贝恩为客户准备的。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name (used for some towns/areas, especially in French-speaking regions).","zh":"地名（用于一些城镇或地区名称，尤其在法语地区常见）。"},"examples":[{"en":"He traveled through Bain during his trip in France.","zh":"他在法国旅行时经过了一个叫 Bain 的地方。"}]},{"partOfSpeech":"n.","definition":{"en":"(from French) a bath; used in some English contexts for spa/bath-related terms.","zh":"（源自法语）洗浴、浴池；在英语中偶见于与温泉/洗浴相关的表达。"},"examples":[{"en":"The hotel offers a mineral bain (bath) in its spa.","zh":"这家酒店的水疗中心提供矿物浴。"}]}],"synonyms":["(French sense) bath"],"phonetic":"/beɪn/","extraExplanation":["“Bain”最常见的英语用法是专有名词（姓氏或公司名）。在英文新闻或商业语境里，看到“Bain”常指“Bain & Company（贝恩咨询）”或“Bain Capital（贝恩资本）”，需要结合上下文判断。","“bain”作为“洗浴”的意思更偏法语色彩，英语里多出现在较正式或带异国风格的水疗/酒店宣传语中。"]}
{"word":"bain","summary":{"en":"“Bain” is uncommon in everyday English; it usually means “bath” in French-style spa contexts, or it can be a surname.","zh":"“Bain” 在日常英语中不常见：多指法语语境里的“浴/泡浴”（常见于水疗相关），也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from French, used mainly in spa or beauty contexts) a bath; a bathing treatment.","zh":"（源自法语，多用于水疗/美容语境）“浴、泡浴”；一种沐浴护理。"},"examples":[{"en":"The menu offers a lavender bain to help you relax.","zh":"菜单上有薰衣草泡浴（bain），帮助你放松。"},{"en":"She booked a mineral bain at the spa.","zh":"她在水疗馆预约了矿物泡浴护理。"}]},{"partOfSpeech":"other","definition":{"en":"a family name (surname).","zh":"（专有名词）姓氏：Bain。"},"examples":[{"en":"Her last name is Bain.","zh":"她的姓是 Bain。"},{"en":"Mr. Bain will lead the meeting today.","zh":"Bain 先生今天将主持会议。"}]}],"synonyms":["bath","soak","water bath"],"phonetic":"/beɪn/","extraExplanation":["在英语里，单独使用的 bain 比较少见，常见于法语借词或搭配中，例如 **bain-marie**（隔水加热/水浴锅）里的 bain 就是“浴、水浴”的意思。","如果你是在小说/歌词/菜单里看到 bain，通常不是常用英语词，而是为了营造法式风格或指代水疗项目。若你能提供句子，我可以帮你判断具体含义。"]}
{"word":"Bainbridge","summary":{"en":"“Bainbridge” is usually a surname or a U.S. place name (e.g., Bainbridge Island).","zh":"“Bainbridge”通常是姓氏或美国的地名（如贝恩布里奇岛）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"（姓氏）贝恩布里奇。"},"examples":[{"en":"John Bainbridge moved to Chicago for a new job.","zh":"约翰·贝恩布里奇为了一份新工作搬到了芝加哥。"},{"en":"The article was written by Dr. Bainbridge.","zh":"这篇文章由贝恩布里奇博士撰写。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used for several locations, especially in the U.S. (for example, Bainbridge Island in Washington).","zh":"（地名）“贝恩布里奇”，美国多地使用的地名（例如华盛顿州的贝恩布里奇岛）。"},"examples":[{"en":"We took a ferry to Bainbridge Island near Seattle.","zh":"我们乘渡轮去了西雅图附近的贝恩布里奇岛。"},{"en":"She grew up in Bainbridge, Georgia.","zh":"她在佐治亚州的贝恩布里奇长大。"}]}],"phonetic":"/ˈbeɪnˌbrɪdʒ/","extraExplanation":["“Bainbridge”常见于英语世界的姓氏与地名。作为姓氏多源自英国，属于地名姓（人们以居住地或出身地命名）。","在美国语境中最常被提到的可能是华盛顿州的 Bainbridge Island（贝恩布里奇岛），因靠近西雅图、渡轮通勤而知名。不同州也可能有叫 Bainbridge 的城镇，因此看到该词时可结合上下文判断是人名还是地名。"]}
{"word":"Bainbrudge","summary":{"en":"“Bainbrudge” is likely meant to be “Bainbridge,” a proper name used for people and places.","zh":"“Bainbrudge”很可能是“Bainbridge”的误拼，属于人名或地名的专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Likely misspelling of) Bainbridge: a proper name used as a surname and as the name of several places in the U.S. (for example, Bainbridge Island in Washington).","zh":"（可能是拼写错误，通常指）Bainbridge：专有名词，可作姓氏，也常作为美国一些地名（例如华盛顿州的贝恩布里奇岛）。"},"examples":[{"en":"We took the ferry from Seattle to Bainbridge Island.","zh":"我们从西雅图坐渡轮去贝恩布里奇岛。"},{"en":"Dr. Bainbridge will see you at 3 p.m.","zh":"贝恩布里奇医生下午三点会见你。"}]}],"phonetic":"/ˈbeɪnˌbrɪdʒ/","extraExplanation":["“Bainbrudge”在英语中不常见，更常见的拼写是“Bainbridge”。如果你是在读地图、名单或书名，建议核对原文是否为“Bainbridge”。","Bainbridge作为地名在美国多处出现；作为姓氏也较常见。发音一般按“bain + bridge”来理解，重音在前半部分。"]}
{"word":"bainie","summary":{"en":"“Bainie” is not a standard spelling; it usually refers to “beanie,” a close-fitting hat (often knitted).","zh":"“bainie”不是标准拼写；通常指“beanie”，一种贴头的帽子（多为针织毛线帽）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly spelled “beanie”) a small, close-fitting hat, often made of knitted wool.","zh":"（常拼作“beanie”）无檐贴头的帽子，常为针织毛线帽。"},"examples":[{"en":"It’s cold today—grab a beanie before you go out.","zh":"今天很冷——出门前戴上你的毛线帽。"},{"en":"She wore a black beanie and a hoodie.","zh":"她戴着黑色针织帽，穿着连帽衫。"}]},{"partOfSpeech":"n.","definition":{"en":"(US, informal) a propeller cap (a hat with a small propeller on top), often associated with children or a playful style.","zh":"（美式口语）带小螺旋桨的帽子（螺旋桨帽），常让人联想到小孩或搞怪风格。"},"examples":[{"en":"He showed up wearing a beanie with a tiny propeller, joking around.","zh":"他戴着一顶带小螺旋桨的帽子出现，开着玩笑。"}]}],"synonyms":["knit cap","woolly hat","stocking cap"],"phonetic":"/ˈbiːni/","extraExplanation":["“bainie”不是常见英文拼写；最可能是把“beanie”拼错了。","“beanie”在日常英语里通常指针织帽（冬天保暖用）。在某些语境里也可指“螺旋桨帽”，但较少见。"]}
{"word":"Baining","summary":{"en":"Baining refers to an ethnic group in East New Britain (Papua New Guinea), their language(s), and things related to their culture.","zh":"Baining 指巴布亚新几内亚东新不列颠省的拜宁族/拜宁人，也可指其语言（拜宁诸语）及与其文化相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a people (an ethnic group) in East New Britain, Papua New Guinea","zh":"（巴布亚新几内亚东新不列颠省的）拜宁人；拜宁族"},"examples":[{"en":"The Baining live in the interior of East New Britain in Papua New Guinea.","zh":"拜宁人居住在巴布亚新几内亚东新不列颠省的内陆地区。"},{"en":"Researchers have recorded Baining traditions through interviews and community events.","zh":"研究者通过访谈和社区活动记录了拜宁族的传统。"}]},{"partOfSpeech":"n.","definition":{"en":"the language(s) spoken by the Baining people (often discussed as the Baining languages)","zh":"拜宁语（通常指“拜宁诸语”，即拜宁人所使用的一组语言）"},"examples":[{"en":"Some communities speak Baining languages that are distinct from nearby tongues.","zh":"一些社区使用的拜宁诸语与周边语言有明显差异。"},{"en":"Learning basic greetings in Baining can help visitors communicate respectfully.","zh":"学习一些拜宁语的基本问候语能帮助访客更有礼貌地交流。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Baining people, their culture, or their language(s)","zh":"拜宁人的；与拜宁文化或拜宁语有关的"},"examples":[{"en":"The museum displayed Baining cultural artifacts alongside local photographs.","zh":"博物馆展出了拜宁文化文物，并配有当地照片。"},{"en":"She wrote a short report on Baining music and dance.","zh":"她写了一份关于拜宁音乐与舞蹈的简短报告。"}]}],"synonyms":["(proper name; no true synonyms)"],"phonetic":"/ˈbaɪnɪŋ/","extraExplanation":["“Baining”常见于人类学、语言学与地理语境中，属于专有名词/专有形容词，通常首字母大写。","有些资料会提到“Baining Fire Dance（拜宁火舞）”，这是一种在节庆场合出现的传统表演形式；不同社区的具体做法可能不同，描述时适合注明来源与场合以示尊重。"]}
{"word":"baining","summary":{"en":"“Baining” most commonly refers to an ethnic group (and related languages/culture) in East New Britain, Papua New Guinea, and can also be used as an adjective meaning “of the Baining.”","zh":"“Baining”常指巴布亚新几内亚东新不列颠省的拜宁族（及其语言/文化），也可作形容词表示“拜宁的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a people (an ethnic group) living mainly in East New Britain, Papua New Guinea; also used for their language(s) and culture","zh":"（巴布亚新几内亚东新不列颠省的）拜宁人；也可指其语言与文化"},"examples":[{"en":"The Baining people are known for their traditional fire dance ceremonies.","zh":"拜宁人以传统的火舞仪式而闻名。"},{"en":"Researchers documented Baining languages to help preserve local culture.","zh":"研究人员记录拜宁诸语言，以帮助保存当地文化。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Baining people, their languages, or their region","zh":"与拜宁人、其语言或其地区有关的"},"examples":[{"en":"We visited a Baining village during our trip to East New Britain.","zh":"我们在东新不列颠旅行时参观了一个拜宁村落。"},{"en":"The museum displayed Baining artifacts and masks.","zh":"博物馆展出了拜宁的器物与面具。"}]}],"synonyms":["(proper noun; no close everyday synonyms)"],"phonetic":"/ˈbaɪnɪŋ/","extraExplanation":["“Baining”在日常英语里不常见，多出现在人类学、地理或旅行语境中。若你原本想查的是拼写相近的词：banning（禁止）/ˈbænɪŋ/ 或 “baning”（较少见的拼写），告诉我你要的语境，我可以帮你确认。"]}
{"word":"bainite","summary":{"en":"Bainite is a heat-treatment microstructure in steel, formed at intermediate temperatures, known for combining strength and toughness.","zh":"贝氏体是钢在中等温度热处理下形成的显微组织，常以强度与韧性兼具著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A microstructure in steel (and some other alloys) formed during heat treatment, typically at temperatures between those that form pearlite and martensite; it is usually a mixture of ferrite and fine carbides and is valued for good strength and toughness.","zh":"（钢及部分合金在热处理时形成的）贝氏体组织；通常在形成珠光体与马氏体之间的温度范围生成，一般由铁素体与细小碳化物组成，常因兼具强度与韧性而受重视。"},"examples":[{"en":"Holding the steel at an intermediate temperature produced bainite instead of martensite.","zh":"把钢保温在中等温度会形成贝氏体，而不是马氏体。"},{"en":"Bainitic steel can offer a useful balance of strength and toughness for certain parts.","zh":"贝氏体钢在某些零件上能提供强度与韧性的良好平衡。"}]}],"synonyms":["upper bainite","lower bainite"],"phonetic":"ˈbeɪnaɪt","extraExplanation":["“bainite”一词来自金属学家 Edgar C. Bain 的姓氏，用来纪念他在钢的显微组织研究中的贡献。","在热处理与等温转变（如 austempering，等温淬火）讨论中很常见；学习时可把它放在“珠光体 pearlite—贝氏体 bainite—马氏体 martensite”的组织与冷却/保温条件对比框架里理解。","常见细分有 upper bainite（上贝氏体）与 lower bainite（下贝氏体），主要差异与形成温度及碳化物形态有关。"]}
{"word":"Bains","summary":{"en":"“Bains” most commonly means “baths” (plural of bain, often in spa/place-name contexts) or it can be a surname.","zh":"“Bains”最常见表示“浴、澡”（bain 的复数，多见于温泉/地名语境），也可作为姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plural form of “bain,” meaning a bath (often used in place names, spa contexts, or older/literary English).","zh":"“bain”的复数，意为“沐浴、澡”（常见于地名、温泉/水疗语境或较古典/文学用法）。"},"examples":[{"en":"The old travel guide recommended the town’s mineral bains for sore muscles.","zh":"那本旧旅行指南推荐该镇的矿物浴（温泉浴）来缓解肌肉酸痛。"},{"en":"In some place names, “bains” signals a spa town built around baths.","zh":"在一些地名中，“bains”暗示这是围绕浴场/温泉发展起来的疗养小镇。"}]},{"partOfSpeech":"n.","definition":{"en":"a surname (family name).","zh":"姓氏（人名）。"},"examples":[{"en":"Dr. Bains will see you at 3 p.m.","zh":"Bains 医生会在下午三点见你。"}]}],"synonyms":["baths","spa baths"],"phonetic":"/beɪnz/","extraExplanation":["“bains”也常作为法语出现，意思就是“浴场/澡堂/温泉浴”（如 Les Bains、Bains-les-Bains 等）。在英语语境里看到它，有时是借用法语或出现在地名中。","发音上，如果是英文里当作复数或姓氏，通常读 /beɪnz/；如果是在明显的法语短语/地名里，可能更接近法语读法。"]}
{"word":"Bainter","summary":{"en":"Bainter is mainly used as a surname (a family name), not a common everyday vocabulary word.","zh":"Bainter 主要用作姓氏（人名），不是常见的日常英文词汇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"（人名）姓氏。"},"examples":[{"en":"Dr. Bainter will lead today’s seminar.","zh":"班特博士将主持今天的研讨会。"},{"en":"I met someone named Bainter at the conference.","zh":"我在会议上遇到一位姓（或名）叫 Bainter 的人。"}]}],"phonetic":"ˈbeɪntər","extraExplanation":["“Bainter”在日常英语中不是常见的普通词，更多见于人名/姓氏。","如果你想查的是常用词，可能是拼写接近的“banter”（轻松的玩笑、打趣）。你可以告诉我上下文句子，我可以帮你确认。"]}
{"word":"Bainville","summary":{"en":"Bainville is usually a proper noun: a small commune in northeastern France, or a French surname (notably Jacques Bainville).","zh":"Bainville 通常是专有名词：法国东北部的一个市镇名，或法语姓氏（如雅克·班维尔）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name (a commune) in northeastern France, in the Vosges department","zh":"（地名）法国东北部孚日省的一个市镇（Bainville）"},"examples":[{"en":"My friend’s family comes from Bainville in the Vosges region of France.","zh":"我朋友的家族来自法国孚日地区的 Bainville。"},{"en":"The hiking route passes small villages near Bainville.","zh":"这条徒步路线会经过 Bainville 附近的一些小村庄。"}]},{"partOfSpeech":"n.","definition":{"en":"a French surname; most famously associated with Jacques Bainville (1879–1936), a French historian and political writer","zh":"（姓氏）法语姓氏；最知名的相关人物是雅克·班维尔（Jacques Bainville，1879–1936），法国历史学家与政治评论作家"},"examples":[{"en":"In a reading list on French political history, Bainville is often mentioned as a conservative commentator.","zh":"在法国政治史的阅读书单里，Bainville 常被提到是一位保守派评论者。"}]}],"phonetic":"/ˈbeɪnviːl/","extraExplanation":["“Bainville”多见于专有名词（地名或姓氏），在英文语境中通常不翻译，只在中文里按音译写作“班维尔/班维勒”等；具体译法会因人名或地名而略有不同。","若你是在阅读法国历史/政治类文章中遇到“Bainville”，很可能指 Jacques Bainville。他与20世纪初法国的政治思想讨论有关；理解时可把它当作“作者/评论者的姓”。"]}
{"word":"baioc","summary":{"en":"“baioc” isn’t a standard English word; it’s likely a typo, name, or abbreviation.","zh":"“baioc”不是标准英语单词，可能是拼写错误、专有名词或缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a typo, a name, or an abbreviation; please confirm the intended spelling or meaning.","zh":"不是标准英语单词。可能是拼写错误、人名/地名，或缩写；请确认你想查的正确拼写或含义。"},"examples":[{"en":"I couldn’t find “baioc” in a dictionary—did you mean “bayou” or “bailout”?","zh":"我在词典里找不到“baioc”——你是不是想写“bayou（河湾/沼泽水道）”或“bailout（救助/纾困）”？"},{"en":"Can you tell me where you saw the word “baioc” (a sentence or a screenshot)?","zh":"你能告诉我你在哪里看到“baioc”吗（给我一句上下文或截图）？"}]}],"extraExplanation":["“baioc”在常见英语词典中不收录。它可能是：\n1）拼写误差：例如 bayou / bailout / biopic / biotech 等；\n2）专有名词：人名、品牌名、游戏ID、地名；\n3）缩写：需要具体领域（医学、金融、学校、公司等）才能判断。\n把你看到它的完整句子发我，我可以更准确判断。"]}
{"word":"baiocchi","summary":{"en":"*Baiocchi* is the plural of *baiocco*, a historical Italian coin, and can also mean “money/small change” in Italian-influenced informal use.","zh":"*baiocchi* 是 *baiocco*（旧时意大利硬币）的复数；在受意大利语影响的非正式用法中也可泛指“钱/零钱”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A former Italian coin used especially in central Italy and the Papal States; the plural of *baiocco*.","zh":"（历史用语）旧时意大利的一种硬币，尤指意大利中部及教皇国使用的“baiocco”的复数。"},"examples":[{"en":"In the novel, he paid a few baiocchi for bread and wine.","zh":"在小说里，他花了几枚拜奥科（baiocchi）买面包和葡萄酒。"},{"en":"The document lists taxes in baiocchi and other local coins.","zh":"这份文件用拜奥科（baiocchi）和其他地方货币来记录税额。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, Italian-influenced) Money; small change.","zh":"（非正式，受意大利语影响）钱；零钱。"},"examples":[{"en":"I don’t have enough baiocchi on me for the bus fare.","zh":"我身上没有足够的零钱付公交车费。"},{"en":"He saved his baiocchi little by little.","zh":"他一点一点地攒钱。"}]}],"synonyms":["baiocco","coin(s)","cash","small change"],"phonetic":"/baɪˈɑːki/","extraExplanation":["“baiocco/baiocchi”源自意大利语，常见于描写18–19世纪意大利（尤其教皇国）社会生活的历史材料、旅行记和文学作品中。英语里多作为外来词出现，通常用来营造地域与年代氛围。","在现代意大利语口语里，它有时会被引申为“钱/零花钱”的说法，但在英语语境中这种用法比较少见，更多仍指历史货币。"]}
{"word":"baiocco","summary":{"en":"Baiocco is a historical small coin from the Papal States, and it can also mean a tiny amount of money.","zh":"baiocco 指教皇国时期的小额铜币，也可引申为“一点点钱/小钱”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A small copper coin formerly used in the Papal States (central Italy), worth a very small amount of money.","zh":"（历史）意大利教皇国（意大利中部）曾使用的一种小额铜币，面值很小。"},"examples":[{"en":"In old Roman accounts, a loaf of bread might cost a few baiocchi.","zh":"在旧时罗马的账本里，一条面包可能只要几个baiocchi。"},{"en":"He joked that his purse held only baiocchi—almost nothing at all.","zh":"他开玩笑说自己钱袋里只有baiocchi——几乎等于没钱。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative, Italian-influenced usage) A tiny amount of money; “pocket change.”","zh":"（引申，受意大利语影响的用法）一点点钱；“零花钱/小钱”。"},"examples":[{"en":"Don’t worry about it—it’s just a few baiocchi.","zh":"别担心——那只是几个baiocchi而已。"},{"en":"They argued over baiocchi while ignoring the bigger problem.","zh":"他们为了几块小钱争来争去，却忽视了更大的问题。"}]}],"synonyms":["penny","farthing","small change","pocket change"],"phonetic":"/baɪˈɑːkoʊ/","extraExplanation":["baiocco（复数常见作 baiocchi）主要出现在历史文本、小说或讨论意大利旧币制的语境中。对英语读者来说，它常被用来营造“旧时代意大利/罗马”的氛围，类似英语里提到 farthing（法寻，旧英国小币）那种感觉。","在英文资料里也可能见到拼写变体（如 bajocco），属于转写差异。"]}
{"word":"bairagi","summary":{"en":"Bairagi means a Hindu renunciant/ascetic who gives up worldly life; it can also loosely refer to someone very detached and simple-living.","zh":"bairagi指印度教的出家修行者/遁世苦行者；也可引申指对世俗欲望很淡、生活极简的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Hindu renunciant (holy person) who gives up ordinary worldly life, often living simply and focusing on spiritual practice; commonly used in North India.","zh":"（印度教）出家修行者、遁世苦行者；放下世俗生活、过简朴生活并专注灵修的人（多见于印度北部语境）。"},"examples":[{"en":"After his family died, he chose to live as a bairagi and travel from temple to temple.","zh":"家人去世后，他选择做一名bairagi，在寺庙之间云游。"},{"en":"In the novel, the bairagi is portrayed as calm, detached, and unwilling to fight for money or status.","zh":"在小说中，bairagi被描写得冷静超脱，不愿为金钱或地位争斗。"}]},{"partOfSpeech":"n.","definition":{"en":"(by extension, sometimes informal) a person who seems detached from ordinary desires, living very simply or avoiding social life.","zh":"（引申义，略口语）对欲望较淡、生活极简或刻意远离社交与世俗追求的人。"},"examples":[{"en":"Ever since he left the city, his friends joke that he’s become a bairagi.","zh":"自从他离开城市后，朋友们开玩笑说他成了个bairagi。"}]}],"synonyms":["ascetic","renunciant","monk (roughly)","holy man (contextual)","sadhu (related term)"],"phonetic":"/baɪˈrɑːɡi/","extraExplanation":["“Bairagi”源自印度诸语言（如印地语/孟加拉语等）的宗教与文化语境，常与“vairāgya（离欲、出离心）”相关，强调对世俗欲望的淡泊与精神修行。","在印度文学与民间叙事中，bairagi形象常被用来象征“超脱、清贫、云游、修行”，有时也会被浪漫化或被用作对“看破红尘”的比喻。使用时注意：它是带有宗教身份与社会历史背景的词，放到一般英语语境里最好加上简短解释。"]}
{"word":"Bairam","summary":{"en":"Bairam is a Muslim holiday, often referring to Eid celebrations (especially in South Asian English).","zh":"Bairam指穆斯林节日，常在南亚英语中用来指开斋节或宰牲节等“Eid”庆祝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Muslim festival, especially Eid al-Fitr (after Ramadan) or Eid al-Adha; a common spelling in South Asia for “Bayram.”","zh":"穆斯林节日，尤指开斋节（斋月结束后）或宰牲节；在南亚地区常用拼写，对应“Bayram”。"},"examples":[{"en":"Many families visit relatives and share sweets on Bairam.","zh":"许多家庭在拜拉姆节（Bairam）走亲访友并分享甜点。"},{"en":"The school will be closed for Bairam tomorrow.","zh":"学校明天因拜拉姆节放假。"},{"en":"He greeted his neighbors by saying, “Happy Bairam!”","zh":"他对邻居说：“拜拉姆节快乐！”"}]}],"synonyms":["Eid","Bayram","Eid al-Fitr","Eid al-Adha"],"phonetic":"/ˈbaɪrəm/","extraExplanation":["“Bairam”常见于印度、巴基斯坦、孟加拉等地的英语用法；在土耳其语中更常见拼写是“Bayram”，意思是“节日/庆典”。","在新闻或文学作品里，你可能会看到“Bairam”特指两大伊斯兰节日：Eid al-Fitr（开斋节）与Eid al-Adha（宰牲节）。在不同国家，庆祝方式（如礼拜、探亲、施舍、共享食物）会有所差异。","大小写提示：作为节日名称通常要大写（Bairam）。"]}
{"word":"bairam","summary":{"en":"Bairam (also spelled Bayram) is a Turkish term for a major religious festival, especially Eid, and can also mean a holiday or celebration.","zh":"Bairam（也拼作 Bayram）是土耳其语文化中对重要宗教节日（尤指开斋节或宰牲节）的称呼，也可泛指假日或庆典。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Turkey and some neighboring regions) a major religious festival, especially the Muslim holidays Eid al-Fitr or Eid al-Adha; also used more generally to mean a public holiday or celebration.","zh":"（在土耳其及部分周边地区）重要的宗教节日，尤指伊斯兰教的开斋节（Eid al-Fitr）或宰牲节（Eid al-Adha）；也可泛指公众假日或庆祝日。"},"examples":[{"en":"Many families travel to visit relatives for Bairam.","zh":"许多家庭会在拜拉姆节期间出行探亲。"},{"en":"Shops may close or keep shorter hours during Bairam.","zh":"在拜拉姆节期间，商店可能会关门或缩短营业时间。"},{"en":"She greeted her neighbors by saying, “Happy Bairam!”","zh":"她向邻居问候说：“拜拉姆节快乐！”"}]}],"synonyms":["Bayram","Eid","Eid al-Fitr","Eid al-Adha"],"phonetic":"/baɪˈrɑːm/","extraExplanation":["“Bairam”更常见的拼写是“Bayram”，源自土耳其语，意思接近“节日/庆典”。在英语里它多用于指土耳其语文化语境中的开斋节或宰牲节。","常见搭配：the Bairam holiday / Bairam celebrations / Happy Bairam（节日问候）。不同地区对节日名称与习俗可能略有差异，写作或翻译时可根据具体国家与宗教背景选择用“Eid al-Fitr / Eid al-Adha”或“Bayram/Bairam”。"]}
{"word":"Baird","summary":{"en":"Baird is mainly a Scottish surname; it can also refer to the inventor John Logie Baird, associated with early television.","zh":"Baird 主要是一个（多见于苏格兰的）姓氏；也可指与早期电视相关的发明家约翰·洛吉·贝尔德。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), most commonly Scottish; used to refer to a person with this last name","zh":"姓氏（常见于苏格兰）；用来指姓 Baird 的人"},"examples":[{"en":"My teacher’s last name is Baird.","zh":"我老师的姓是 Baird。"},{"en":"Dr. Baird will see you now.","zh":"Baird 医生现在要见你。"}]},{"partOfSpeech":"n.","definition":{"en":"John Logie Baird (1888–1946), a Scottish inventor often credited with demonstrating early television systems","zh":"约翰·洛吉·贝尔德（1888–1946），苏格兰发明家，常被认为展示了早期电视系统的人之一"},"examples":[{"en":"John Logie Baird is known for early work on television.","zh":"约翰·洛吉·贝尔德因早期电视研究而闻名。"},{"en":"In a history lesson, we read about Baird’s television experiments.","zh":"在历史课上，我们读到贝尔德的电视实验。"}]}],"phonetic":"/bɛrd/","extraExplanation":["Baird 常被英语使用者当作专有名词（人名）来看，因此在句子中通常大写：Baird。","词源上多认为来自苏格兰盖尔语/古英语相关形式，含义常被解释为“吟游诗人/诗人（bard）”的变体或相关姓氏；也可能与地名或职业称呼有关。不同家族来源可能不完全相同。","在英文中称呼对方时，若对方是医生、教授等，常用称号 + 姓：Dr. Baird / Professor Baird。"]}
{"word":"Bairdford","summary":{"en":"Bairdford is a place name in Pennsylvania, USA.","zh":"Bairdford 是美国宾夕法尼亚州的一个地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small community (unincorporated area) in Allegheny County, Pennsylvania, USA, near the Allegheny River.","zh":"美国宾夕法尼亚州阿勒格尼县的一个小社区（非建制地区），靠近阿勒格尼河。"},"examples":[{"en":"Bairdford is a quiet place north of Pittsburgh.","zh":"Bairdford 是匹兹堡以北一个安静的地方。"},{"en":"She grew up near Bairdford and knows the river towns well.","zh":"她在 Bairdford 附近长大，对那一带的河畔小镇很熟悉。"}]}],"phonetic":"/ˈbɛrd.fɔrd/","extraExplanation":["“Bairdford”是专有名词（地名），常见于地址、新闻、地图或人物经历描述中。","词尾“-ford”在英语地名里很常见，原意是“浅滩、可涉水过河之处”，因此许多含“-ford”的地名往往与河流或过河点有关。"]}
{"word":"bairdi","summary":{"en":"“bairdi” is a Latinized scientific-name ending meaning “of Baird,” used to honor someone named Baird.","zh":"“bairdi”是学名中的拉丁化加词，意为“贝尔德的/为纪念贝尔德（Baird）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(in biology) A Latin species name ending used in scientific names to mean “of Baird,” honoring a person with the surname Baird.","zh":"（生物学）拉丁化的物种加词结尾，用于学名中，表示“贝尔德的/为纪念贝尔德（Baird）”。"},"examples":[{"en":"In some scientific names, the epithet “bairdi” indicates the species was named after Baird.","zh":"在一些学名中，加词“bairdi”表示该物种是以贝尔德（Baird）命名的。"},{"en":"Researchers compared two populations and noted that the form labeled “bairdi” differed slightly in plumage.","zh":"研究人员比较了两个人群，并指出标为“bairdi”的类型在羽色上略有差异。"}]}],"phonetic":"/ˈbɛərdi/","extraExplanation":["“bairdi”常见于拉丁学名（属名 + 种加词）中，属于种加词（specific epithet）。它通常是纪念命名者想致敬的人（姓Baird），例如美国博物学家 Spencer Fullerton Baird。","发音在英语语境里一般按英文姓氏Baird来读，所以常听到类似“BEAR-dee”的读法；但在严格拉丁读法或不同语言环境中也可能有细微差别。"]}
{"word":"bairn","summary":{"en":"“Bairn” is a regional word (Scotland/Northern England) meaning “child.”","zh":"“bairn”是地域用词（苏格兰/英格兰北部），意思是“孩子”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in Scotland and Northern England) a child, especially a young child.","zh":"（尤指苏格兰和英格兰北部用法）小孩；幼儿。"},"examples":[{"en":"In Scotland, people might say, “She’s just a wee bairn.”","zh":"在苏格兰，人们可能会说：“她还是个小小的娃（wee bairn）。”"},{"en":"The story is told through the eyes of a bairn growing up in a small village.","zh":"这个故事从一个在小村庄长大的孩子的视角讲述。"}]}],"synonyms":["child","kid","youngster"],"phonetic":"/bɛrn/","extraExplanation":["“bairn”是带有地域特色的词：在苏格兰英语（Scots/Scottish English）以及英格兰北部方言里很常见，在其他地区通常会用“child”或“kid”。","它常常出现在苏格兰文化语境中（比如民谣、小说对白、地方口语），用来营造亲切、朴实或地方色彩。常见搭配“wee bairn”（小小孩）。"]}
{"word":"bairnie","summary":{"en":"“Bairnie” is a Scottish word meaning “a small child,” used affectionately.","zh":"“bairnie”是苏格兰用语，亲昵地表示“（小）孩子”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scottish English, informal) a small child; a little one.","zh":"（苏格兰英语，非正式）小孩；小宝宝。"},"examples":[{"en":"The bairnie fell asleep in his mum’s arms.","zh":"小宝宝在妈妈怀里睡着了。"},{"en":"She used to tell stories to the bairnies by the fire.","zh":"她过去常在炉火旁给孩子们讲故事。"}]}],"synonyms":["child","kid","little one","kiddo","bairn"],"phonetic":"/ˈbɛrni/","extraExplanation":["“bairnie”是苏格兰用语“bairn（孩子）”的昵称/小称形式，相当于英语里的“kiddo / little one”。在苏格兰文学与民谣中较常见（如罗伯特·彭斯等作品里常见类似的苏格兰方言用词），带有亲昵、家常的语气。"]}
{"word":"bairnish","summary":{"en":"Bairnish means ‘childlike/childish,’ especially in Scottish usage.","zh":"bairnish 意为“孩子气的、像孩子一样的”，尤其常见于苏格兰用法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Childlike or childish; having the qualities of a child (often used in Scottish English).","zh":"孩子气的；像孩子一样的（常见于苏格兰英语）"},"examples":[{"en":"His bairnish excitement made everyone smile.","zh":"他那种孩子气的兴奋让大家都笑了。"},{"en":"Don’t be so bairnish—think it through first.","zh":"别这么孩子气——先想清楚再说。"}]}],"synonyms":["childish","childlike","immature","infantile","juvenile"],"phonetic":"/ˈbɛər.nɪʃ/","extraExplanation":["“bairnish”主要见于苏格兰英语（Scots/Scottish English），来自“bairn”（小孩、孩子）。在现代日常美式英语中不常用；更常见的对应词是“childish”（偏贬：幼稚）或“childlike”（偏褒：天真、童真）。如果你在英文学作品里看到它，往往用来营造苏格兰地域色彩或口语氛围。"]}
{"word":"bairnishness","summary":{"en":"Bairnishness means “childlike quality/childishness,” with a Scottish or literary flavor.","zh":"bairnishness 指“孩童般的特质/孩子气”，带有苏格兰或文学语感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being childlike; childishness (often in a Scottish or literary tone).","zh":"孩童般的特质；稚气、孩子气（常带苏格兰或文学语感）。"},"examples":[{"en":"There was a bairnishness in his excitement, as if every gift were a miracle.","zh":"他的兴奋里带着一种孩童般的稚气，仿佛每份礼物都是奇迹。"},{"en":"The novel captures the bairnishness of small-town summers—sticky hands, scraped knees, and big dreams.","zh":"这部小说写出了小镇夏天的孩子气——黏糊糊的手、擦破的膝盖和很大的梦想。"}]}],"synonyms":["childlikeness","childishness","innocence","naivety","youthfulness"],"phonetic":"/ˈber.nɪʃ.nəs/","extraExplanation":["“bairnishness”来自苏格兰语/英格兰北部方言 *bairn*（孩子）+ 形容词后缀 *-ish*（有点像……的）+ 名词后缀 *-ness*（……的性质）。因此它带有明显的地域与文学色彩，在现代日常英语里更常用的是 *childishness* 或 *childlikeness*。","语气上：*childlike* 往往偏正面（天真、纯真），*childish* 往往偏负面（幼稚、不成熟）；*bairnishness* 介于两者之间，具体褒贬取决于语境。"]}
{"word":"bairnlier","summary":{"en":"“Bairnlier” is a rare Scots-style comparative meaning “more childlike/childish.”","zh":"“bairnlier” 很少见，多带苏格兰方言色彩，意思是“更像小孩的/更孩子气的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(comparative of *bairnly*) more childlike or childish; having qualities of a child.","zh":"（*bairnly* 的比较级）更孩子气的；更像小孩的（多为苏格兰英语/方言用法）。"},"examples":[{"en":"His jokes were even bairnlier than before, full of silly wordplay.","zh":"他的玩笑比以前更孩子气，满是傻乎乎的文字游戏。"},{"en":"As she relaxed, her face grew bairnlier and softer.","zh":"她一放松下来，神情就更像小孩，更柔和了。"}]}],"synonyms":["more childlike","more childish","more juvenile"],"phonetic":"/ˈbɛrnliɚ/","extraExplanation":["“bairn”是苏格兰英语（Scots）里“孩子”的意思，来源与古英语有关；“bairnly”表示“像孩子的/孩子气的”，而“bairnlier”是其比较级（more childlike）。","这个词非常少见，现代英语里通常会直接说“more childlike / more childish”。在文学或地域性写作中，用它能营造苏格兰口吻或乡土氛围。"]}
{"word":"bairnliest","summary":{"en":"“Bairnliest” means “most childlike,” a Scots/Scottish-English word.","zh":"“bairnliest”意为“最孩子气/最童真”，属于苏格兰/苏格兰英语用词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Most childlike; showing the greatest innocence, simplicity, or youthful qualities (a Scots/Scottish-English word, from “bairn” = child).","zh":"最孩子气的；最天真、最纯真、最具童稚气质的（苏格兰/苏格兰英语用词，源自 bairn=孩子）。"},"examples":[{"en":"Of all the portraits, this one has the bairnliest smile—open and trusting.","zh":"在所有肖像里，这一幅的笑容最“孩子气”——坦率又充满信任。"},{"en":"He kept a bairnliest wonder about the sea, even as an old man.","zh":"即使到了老年，他仍对大海保持着最童真的好奇。"}]}],"synonyms":["most childlike","most innocent","most youthful","most guileless"],"phonetic":"ˈbɛrnliəst","extraExplanation":["“bairnliest”多见于苏格兰语境或带有苏格兰风格的文学写作中，用来营造一种质朴、乡土、带童真气息的语感。日常美式英语里更常用的替代说法有：most childlike / most innocent / most youthful。","词根“bairn”在苏格兰英语中很常见，意思是“孩子”。你可能在苏格兰民谣或苏格兰作家（例如罗伯特·彭斯 Robert Burns 的相关作品/语境）里遇到它，用来强调亲昵、家庭与乡村氛围。"]}
{"word":"bairnliness","summary":{"en":"Bairnliness means “childlikeness,” often with a warm, innocent, literary/Scottish flavor.","zh":"bairnliness 指“童真、孩子气”，带有较温暖、偏文学/苏格兰方言的色彩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being like a child; childlikeness (often suggesting innocence, simplicity, or a playful, youthful spirit).","zh":"孩子气；童真（常指天真、单纯或活泼的孩子般气质）。"},"examples":[{"en":"There was a warm bairnliness in her laughter that made everyone relax.","zh":"她的笑声里有一种温暖的童真，让大家都放松下来。"},{"en":"The poem captures the bairnliness of a summer day—curious, bright, and carefree.","zh":"这首诗捕捉了夏日的童真——好奇、明亮而无忧无虑。"}]}],"synonyms":["childlikeness","innocence","youthfulness","playfulness"],"phonetic":"/ˈbɛərnlinəs/","extraExplanation":["“bairnliness”来自苏格兰英语（Scots）里的“bairn”（孩子）+ “-liness”（表示“……的状态/性质”）。因此它更常见于文学、方言色彩浓的写作或带有苏格兰文化背景的文本中。","语感上它通常比普通的“childishness”更偏正面、更温柔：强调童真的可爱与纯净，而不是幼稚或不成熟。"]}
{"word":"bairnly","summary":{"en":"“Bairnly” means “childlike,” mainly used in Scots or Northern English contexts.","zh":"“bairnly”意为“孩子般的/童稚的”，主要见于苏格兰或英格兰北部方言语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Scots / Northern English) Childlike; relating to a child (a “bairn”).","zh":"（苏格兰语/英格兰北部方言）孩子般的；与孩子（bairn）有关的。"},"examples":[{"en":"He had a bairnly excitement about the first snowfall.","zh":"他对第一场雪有一种孩子般的兴奋。"},{"en":"The poem remembers a bairnly voice calling from the yard.","zh":"这首诗回忆起院子里传来的童稚的呼唤。"}]}],"synonyms":["childlike","youthful","innocent","boyish","girlish"],"phonetic":"/ˈbɛrnli/","extraExplanation":["“bairnly”来自方言词“bairn”（意为“孩子”），常见于苏格兰与英格兰北部的文学或带地方色彩的写作中。它的语气往往带有温柔、朴素、怀旧的感觉。","在现代标准英语里，更常用的对应词是“childlike”（偏褒义：天真、纯真）或“childish”（偏贬义：幼稚、不成熟）。写作时可根据语气选择。"]}
{"word":"bairns","summary":{"en":"“Bairns” means “children” in Scottish and Northern English dialect.","zh":"“bairns”是苏格兰及英格兰北部方言里“孩子们”的意思。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scotland & Northern England, dialect) children; kids (plural of “bairn”).","zh":"（苏格兰及英格兰北部方言）孩子们；小孩（“bairn”的复数）。"},"examples":[{"en":"The village school was full of bairns every morning.","zh":"村里的学校每天早上都挤满了孩子们。"},{"en":"She looked after the bairns while their parents worked.","zh":"父母工作时，她照看孩子们。"},{"en":"In the story, the bairns play by the sea all summer.","zh":"在故事里，孩子们整个夏天都在海边玩。"}]}],"synonyms":["children","kids","youngsters","weans"],"phonetic":"/bɛrnz/","extraExplanation":["“bairn / bairns”常见于苏格兰英语（Scots）和英格兰北部口语、民谣与文学作品中，用来营造地方色彩。现代标准英语里通常说 children / kids。","词源与古英语/古北欧相关，和现代英语 child 同义，但语感更朴素、乡土。读到它时，可把它理解为带有地域风味的“孩子们”。"]}
{"word":"Bairnsfather","summary":{"en":"Bairnsfather usually refers to Bruce Bairnsfather, the British WWI cartoonist famous for “Old Bill,” and can also describe his dry, trench-humor style.","zh":"Bairnsfather 通常指一战英国漫画家布鲁斯·贝恩斯法瑟（“Old Bill”之父），也可引申为带有他那种战壕冷幽默风格的作品或表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bruce Bairnsfather (1887–1959), a British cartoonist best known for his World War I trench cartoons, especially the character “Old Bill.”","zh":"布鲁斯·贝恩斯法瑟（Bruce Bairnsfather，1887–1959），英国漫画家，以第一次世界大战战壕漫画闻名，代表角色是“Old Bill（老比尔）”。"},"examples":[{"en":"Bairnsfather’s cartoons captured the humor and hardship of trench life in World War I.","zh":"贝恩斯法瑟的漫画描绘了一战战壕生活中的幽默与艰辛。"},{"en":"The character Old Bill became Bairnsfather’s most famous creation.","zh":"“Old Bill（老比尔）”成了贝恩斯法瑟最著名的创作。"}]},{"partOfSpeech":"adj.","definition":{"en":"(By extension) Something in the style of Bairnsfather’s wartime cartoons—dry humor about soldiering and everyday hardship.","zh":"（引申）指“贝恩斯法瑟式”的一战漫画风格：用略带冷幽默的方式表现当兵与日常困境。"},"examples":[{"en":"The poster uses a very Bairnsfather kind of humor—grim, but oddly comforting.","zh":"这张海报带有很“贝恩斯法瑟式”的幽默——有点苦涩，但又莫名让人安心。"}]}],"synonyms":["Bruce Bairnsfather","Old Bill (character)"],"phonetic":"/ˈbɛrnzˌfɑðər/","extraExplanation":["“Bairnsfather”多见于英国文化与一战史相关语境。读到这个名字时，常常是在谈战争宣传画、报刊漫画、或一战士兵的日常与心理。","他最常被引用的一句（出自漫画）是 “If you knows of a better ’ole, go to it!”（大意：要是你知道更好的坑，就去那儿吧！），用来调侃战壕环境的糟糕与士兵的自嘲精神。"]}
{"word":"bairnteam","summary":{"en":"A Scots dialect word meaning “children” as a group (one’s offspring).","zh":"苏格兰方言词，指“一群孩子/子女（作为整体的后代）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scots, dialect) a group of children; one’s children as a collective (offspring).","zh":"（苏格兰英语/方言）一群孩子；（作为整体的）子女、后代。"},"examples":[{"en":"She was busy looking after her bairnteam while her husband worked.","zh":"她忙着照看自己的孩子们，而丈夫在外工作。"},{"en":"The old song tells of a mother feeding her bairnteam through a hard winter.","zh":"那首老歌讲的是一位母亲在艰难的冬天里养活她的一群孩子。"}]}],"synonyms":["children","kids","offspring","family"],"phonetic":"/ˈbɛrnˌtim/","extraExplanation":["“bairn”在苏格兰英语中常指“孩子”，在英国北部一些地区也能听到；“team”在较旧或方言用法里可表示“家里的一伙人/一群”，所以“bairnteam”整体就是“孩子们/子女”。","该词带有明显的地域与文学色彩，常见于苏格兰民谣、地方故事或历史文本中；现代日常英语更常用“children”“kids”“offspring”。","近义表达（更常见）：children, kids, one’s family, offspring（语气更书面）。"]}
{"word":"bairnteem","summary":{"en":"“bairnteem” isn’t a standard English word; it’s probably a misspelling (often of Scottish “bairn,” meaning “child”) or a combined phrase.","zh":"“bairnteem”不是标准英语词；很可能是拼写错误（常见可能是苏格兰词“bairn”，意为“孩子”）或把短语连写了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a non-English/Scottish dialect form.","zh":"不是标准英语单词。很可能是拼写错误，或来自非英语/苏格兰方言的写法。"},"examples":[{"en":"I couldn’t find “bairnteem” in a dictionary—could you share the sentence where you saw it?","zh":"我在词典里找不到“bairnteem”——你能把它出现的句子发我吗？"},{"en":"Did you mean “bairn” (a Scottish word meaning “child”)?","zh":"你是不是想写“bairn”（苏格兰用语，意思是“孩子”）？"},{"en":"If you meant “barn team,” it would usually be written as two words.","zh":"如果你想表达“barn team”，通常会写成两个词。"}]}],"phonetic":"/ˈbɛrnˌtim/","extraExplanation":["“bairn”是苏格兰英语/苏格兰语（Scots）里常见的词，意思是“孩子”，在一些文学作品或地方口语中会出现。","你输入的“bairnteem”可能是把两个部分连在一起（例如 bairn + team/teem/time）造成的拼写混合。请提供上下文句子或你想表达的中文意思，我可以帮你确认正确词形并给出准确释义。"]}
{"word":"bairntime","summary":{"en":"“Bairntime” means childhood, especially in Scottish dialect.","zh":"“bairntime”指“童年/小时候”，多用于苏格兰方言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scottish, dialect) Childhood; the time when someone is a child.","zh":"（苏格兰方言）童年；小时候的时期。"},"examples":[{"en":"I mind the stories my granny told me in my bairntime.","zh":"我还记得我童年时奶奶给我讲的故事。"},{"en":"In her bairntime, winters felt longer and darker.","zh":"在她的童年里，冬天似乎更长、更黑。"}]}],"synonyms":["childhood","youth","early years"],"phonetic":"/ˈbɛrnˌtaɪm/","extraExplanation":["“bairntime”主要见于苏格兰英语/方言：bairn = “孩子”，time = “时期”，合起来就是“当孩子的那段时间”。在更通用的现代英语里，通常说 childhood 或 when I was a child。","你可能在苏格兰文学或带有苏格兰口语色彩的作品里遇到它，用来营造地域感与怀旧的语气；日常标准美式英语中较少使用。"]}
{"word":"bairnwort","summary":{"en":"“Bairnwort” is a Scottish dialect word meaning “daisy.”","zh":"“bairnwort”是苏格兰方言词，意思是“雏菊”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scottish dialect, old-fashioned) a daisy; especially the common daisy.","zh":"（苏格兰方言，旧式用法）雏菊；尤指普通雏菊。"},"examples":[{"en":"In old Scots writing, you may see “bairnwort” used for the little daisies in a field.","zh":"在一些较早的苏格兰英语作品里，你可能会看到用“bairnwort”来指田野里的小雏菊。"},{"en":"The children picked bairnwort and made flower chains.","zh":"孩子们采了雏菊，编成花环。"}]}],"synonyms":["daisy","common daisy"],"phonetic":"/ˈbɛrnˌwɝt/","extraExplanation":["“bairnwort”由 Scots（苏格兰英语/苏格兰方言）里的 bairn（小孩）+ wort（古英语里常见的“草本植物/药草”后缀）组成。因为雏菊常被孩子采来玩（如编花环），所以得名。","wort 这个词在很多植物名里出现（如 St John’s wort“圣约翰草”），现代英语里多带有“旧式/植物名”色彩。"]}
{"word":"Bairoil","summary":{"en":"“Bairoil” is most likely a brand/proper name related to oil products, not a standard English vocabulary word.","zh":"“Bairoil”多半是与油类产品相关的品牌/专有名称，而不是标准英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a proper name (brand/company name) that may refer to an oil-related product (for example, lubricating oil). It is not a common dictionary word in everyday English.","zh":"专有名词（品牌/公司名），可能指与“油”有关的产品（如润滑油）。它不是英语日常用语里常见的词典词。"},"examples":[{"en":"I couldn’t find clear instructions because “Bairoil” seems to be a brand name, not a standard English word.","zh":"我找不到明确的说明，因为“Bairoil”看起来是品牌名，而不是标准英语单词。"},{"en":"If Bairoil is a product label, check the bottle for the exact spelling and the manufacturer’s name.","zh":"如果 Bairoil 是产品标签，建议看瓶身确认准确拼写和厂家信息。"}]}],"synonyms":["(brand name; no direct synonyms)"],"phonetic":"/ˈbaɪ.rɔɪl/","extraExplanation":["“Bairoil”在通用英语词典里不常见，更像是商标、公司名或产品名。不同地区/行业可能会有同名品牌，因此含义需要结合你看到它的场景（例如：汽车机油、工业润滑油、护肤油等）。","如果你其实想查的是“bay oil”（月桂/香叶类精油的一种，常见于香氛或头发护理语境），请告诉我你看到的原句或图片，我可以按“bay oil”给你更准确的释义与用法。"]}
{"word":"Bais","summary":{"en":"Bias means an unfair preference or tendency, or the act of influencing something unfairly.","zh":"Bias 指偏见/偏向，也可指使判断或结果受到不公平影响。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A preference or unfair tendency that affects how you think, judge, or act (often without realizing it).","zh":"（常常不自觉的）偏见；偏向；倾向，会影响你的看法、判断或行为。"},"examples":[{"en":"The study tried to reduce bias by using a larger, more diverse sample.","zh":"这项研究通过使用更大、更多样的样本来尽量减少偏差。"},{"en":"We all have biases, so it’s important to check our assumptions.","zh":"我们每个人都有偏见，所以重要的是要检查自己的想当然。"}]},{"partOfSpeech":"vt.","definition":{"en":"To influence someone or something unfairly toward a particular opinion or result.","zh":"使产生偏向；使（判断/结果）受到不公平影响。"},"examples":[{"en":"The wording of the question may bias the answers.","zh":"问题的措辞可能会使回答产生偏向。"},{"en":"Try not to let one bad experience bias your view of the whole group.","zh":"尽量别让一次不好的经历影响你对整个群体的看法。"}]}],"synonyms":["prejudice","partiality","favoritism","leaning","inclination"],"phonetic":"/ˈbaɪəs/","extraExplanation":["你输入的“Bais”在英文里不常见；更常见的单词是“bias”（偏见/偏向）。如果你确实想查“Bais”（例如人名、地名或其他语言的词），可以告诉我上下文（在哪看到的、句子是什么）。","常见搭配：implicit bias（隐性偏见）、confirmation bias（确认偏误/确认偏差）、media bias（媒体偏向）、gender/racial bias（性别/种族偏见）。","区分用法：bias（偏见/偏向）强调“倾向”；prejudice（成见/偏见）更强调对某群体的负面先入为主；error（错误）不一定来自偏向。"]}
{"word":"bais","summary":{"en":"Bias means an unfair preference or a systematic leaning that affects judgment or results.","zh":"Bias 指不公平的偏见/偏向，或使结果偏离真实的系统性偏差。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a preference or prejudice that makes you favor one person, group, or idea over another, often in an unfair way","zh":"偏见；偏向（对某人、某群体或某观点的偏爱或成见，常带不公平）"},"examples":[{"en":"The study tried to reduce bias in its results.","zh":"这项研究试图减少结果中的偏差。"},{"en":"She has a bias against online learning.","zh":"她对线上学习有偏见。"}]},{"partOfSpeech":"n.","definition":{"en":"a systematic error in a test, process, or data that pushes results away from the truth","zh":"（统计/测量中的）系统性偏差（使结果偏离真实值的规律性误差）"},"examples":[{"en":"Sampling bias can happen when the survey misses certain groups.","zh":"当调查遗漏某些群体时，可能会出现抽样偏差。"},{"en":"The algorithm showed bias because of the data it was trained on.","zh":"这个算法出现偏差，是因为它使用的训练数据带有偏向。"}]},{"partOfSpeech":"vt.","definition":{"en":"to influence unfairly; to cause someone or something to lean in a particular direction","zh":"使产生偏见；使偏向（不公平地影响，导致倾向某一方）"},"examples":[{"en":"Try not to let one bad experience bias your judgment.","zh":"尽量不要让一次不好的经历影响你的判断。"},{"en":"The headline may bias readers before they see the facts.","zh":"标题可能会在读者看到事实之前就影响他们的看法。"}]},{"partOfSpeech":"n.","definition":{"en":"a diagonal direction in fabric; cut diagonally (often written as “on the bias”)","zh":"（布料的）斜纹方向；斜裁（常写作 on the bias）"},"examples":[{"en":"She cut the fabric on the bias so it would drape better.","zh":"她把布料斜裁，这样垂坠感会更好。"}]}],"synonyms":["prejudice","partiality","leaning","preference","discrimination","skew"],"phonetic":"/ˈbaɪəs/","extraExplanation":["你输入的 “bais” 很可能是 “bias” 的拼写错误。常见搭配：bias against（对……有偏见）、bias toward/towards（偏向……）、implicit bias（隐性偏见）、confirmation bias（确认偏误）。","在日常写作中，bias 常指“不公平的偏向/成见”；在统计与数据领域，bias 更偏向“系统性偏差”。语境不同，中文对应会略有差异。"]}
{"word":"Baisakh","summary":{"en":"Baisakh is a South Asian month name, especially the first month of the Bengali calendar (mid‑April to mid‑May).","zh":"Baisakh是南亚常见的月份名称，尤其指孟加拉历的第一个月（约公历4月中旬至5月中旬）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the first month of the Bengali calendar (and also a month name used in other South Asian calendars, often spelled “Vaisakh/Vaisakha”), usually falling around mid‑April to mid‑May in the Gregorian calendar","zh":"孟加拉历的第一个月（在其他南亚历法中也常用作月份名称，常拼作“Vaisakh/Vaisakha”），通常大致对应公历4月中旬到5月中旬"},"examples":[{"en":"Pohela Boishakh is celebrated on the first day of Baisakh in Bangladesh.","zh":"在孟加拉国，人们在Baisakh的第一天庆祝孟历新年（Pohela Boishakh）。"},{"en":"Their wedding date was set for the middle of Baisakh.","zh":"他们把婚期定在Baisakh的中旬。"}]}],"synonyms":["Boishakh","Vaisakh","Vaisakha"],"phonetic":"/ˈbaɪsɑːk/","extraExplanation":["“Baisakh/Boishakh（孟加拉语常见拼法）”与“Vaisakh/Vaisakha（梵语/印地语等常见拼法）”指的是同一历法月份的不同转写方式。","它在不同地区常与重要节日相连：例如孟加拉的新年（Pohela Boishakh）在Baisakh初一；旁遮普地区的“Baisakhi/ Vaisakhi”多在四月中旬，名称相近但语境可能不同。"]}
{"word":"baisakh","summary":{"en":"Baisakh is a South Asian calendar month—most commonly the first month of the Bengali calendar (April–May).","zh":"Baisakh 是南亚历法中的一个月份，最常指孟加拉历的第一个月（约公历四月至五月）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the first month of the Bengali calendar (and related regional calendars), usually falling in April–May","zh":"（孟加拉历及相关地区历法的）第一个月，通常在公历四月至五月之间"},"examples":[{"en":"Pohela Boishakh is celebrated on the first day of Baisakh.","zh":"孟加拉新年（Pohela Boishakh）在拜萨克（Baisakh）的第一天庆祝。"},{"en":"The heat often increases in Baisakh in Bangladesh and West Bengal.","zh":"在孟加拉国和印度西孟加拉邦，拜萨克（Baisakh）时天气常常更热。"}]}],"synonyms":["Boishakh","Baishakh","Vaisakh"],"phonetic":"/ˈbaɪsɑk/","extraExplanation":["“Baisakh”也常见拼写为“Boishakh / Baishakh / Vaisakh”。不同语言与转写系统会导致拼写差异，但多指同一个历月概念。","不要与锡克教的重要节日“Baisakhi（也写作Vaisakhi）”混淆：Baisakhi通常指四月中旬的丰收/新年相关庆典；而Baisakh更常指“月份”本身。"]}
{"word":"Baisden","summary":{"en":"Baisden is mainly used as a surname (family name), and occasionally as a proper name in titles or names of places/organizations.","zh":"Baisden 主要用作姓氏，偶尔也会作为专有名称出现在地名或机构名称中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A family name (surname).","zh":"姓氏（家族姓）。"},"examples":[{"en":"My teacher’s last name is Baisden.","zh":"我老师的姓是 Baisden。"},{"en":"She signed the form as Jordan Baisden.","zh":"她以 Jordan Baisden 的名字在表格上签名。"}]},{"partOfSpeech":"other","definition":{"en":"A proper name that may also appear as part of a place name, organization name, or brand (less common; depends on context).","zh":"专有名词，也可能出现在地名、机构名或品牌名中（较少见，取决于语境）。"},"examples":[{"en":"I found the address under Baisden in the directory.","zh":"我在通讯录里用 Baisden 找到了这个地址。"}]}],"phonetic":"/ˈbeɪzdən/","extraExplanation":["Baisden 通常是英语环境中的姓氏，不是常见的普通词汇，所以在不同文本里它的具体指代（某个人、某个家族、某个地点或机构）需要看上下文。","读音常见为 /ˈbeɪzdən/（类似 “BAYZ-dən”）。拼写上有时可能与 Baysden、Basden 等变体混淆；查找资料或人名时可尝试这些相近拼写。"]}
{"word":"baisemain","summary":{"en":"Baisemain means a formal kiss on the hand, used as a respectful greeting (often old-fashioned or European in tone).","zh":"baisemain 指“吻手礼/亲手礼”，一种以吻手背表示尊敬的正式问候（语感偏传统、偏欧式）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a kiss on the back of a person’s hand, or the formal act of kissing someone’s hand as a sign of respect or greeting (often in old-fashioned or European-style etiquette).","zh":"亲手礼；吻手（吻对方手背，作为尊敬或问候的礼节，多见于较传统或欧洲礼仪场合）。"},"examples":[{"en":"He greeted the duchess with a quick baisemain.","zh":"他以一个简短的吻手礼向公爵夫人致意。"},{"en":"In the novel, the hero offers a baisemain to show courtesy, not romance.","zh":"在小说里，男主角行吻手礼是为了表示礼貌，并非示爱。"}]}],"synonyms":["hand kiss","kiss on the hand","hand-kissing"],"phonetic":"ˈbeɪs.mæn","extraExplanation":["“baisemain”来自法语：baiser（亲吻）+ main（手），字面就是“亲吻手”。英语里多用于描写文学作品、历史场景或带有法式/欧式氛围的社交礼仪，因此语体偏书面、偏雅。","在现代日常英语里更常说 hand kiss / kiss (someone’s) hand；而 baisemain 常带一点“古典、上流社交、礼仪感”的色彩。","文化上并非所有场合都合适：不同国家/地区、宗教与个人界限对肢体接触的接受度差异很大，实际使用时要考虑对方意愿与当地习俗。"]}
{"word":"Baishakh","summary":{"en":"Baishakh is the first month of the Bengali calendar, often linked with Bengali New Year celebrations.","zh":"Baishakh 是孟加拉历的第一个月，常与孟加拉新年庆祝活动相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the first month of the Bengali calendar (and related regional calendars), usually falling in mid-April to mid-May; it is often associated with Bengali New Year celebrations.","zh":"孟加拉历（及相关地区历法）的第一个月，通常对应公历4月中旬到5月中旬；常与孟加拉新年庆祝活动相关。"},"examples":[{"en":"Pohela Boishakh marks the first day of Baishakh and the Bengali New Year.","zh":"Pohela Boishakh 标志着 Baishakh 的第一天，也就是孟加拉新年。"},{"en":"In Bangladesh, many people celebrate in Baishakh with fairs, music, and traditional food.","zh":"在孟加拉国，许多人会在 Baishakh 期间用集市、音乐和传统食物来庆祝。"}]}],"synonyms":["Boishakh"],"phonetic":"/ˈbaɪʃɑːk/","extraExplanation":["“Baishakh”也常见拼写为“Boishakh”。在孟加拉语（Bangla）中写作“বৈশাখ”。","Baishakh 的第一天叫“Pohela Boishakh”（孟加拉新年）。在孟加拉国与印度西孟加拉邦都很重要，常见游行、民俗集市与穿传统服饰等活动。","发音上，英语里常把开头读成类似“bye-”，后半部分接近“shahk”；不同地区的英语口音会略有差异。"]}
{"word":"Baiss","summary":{"en":"“Baiss” is most commonly a surname; it is not a standard English vocabulary word.","zh":"“Baiss”最常见是姓氏；不是标准英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“Baiss” is not a common English word; it is usually seen as a surname (family name).","zh":"“Baiss”不是常见的英语词；通常作为姓氏（家族姓名）出现。"},"examples":[{"en":"Dr. Baiss will present the research results tomorrow.","zh":"Baiss 博士将于明天展示研究结果。"},{"en":"I emailed Ms. Baiss to confirm the meeting time.","zh":"我给 Baiss 女士发邮件确认会议时间。"}]}],"phonetic":"/beɪs/","extraExplanation":["如果你想查的是常见单词，可能是拼写误差：最常见的相近词是 “bass”。“bass”有两种常见意思：① 低音（音乐/声音里很低的部分）；② 鲈鱼（一种鱼）。另外也有人把 “basis”（基础）误拼成类似形式。","你可以告诉我你看到 “Baiss” 的句子或上下文，我可以帮你判断它到底是人名（姓氏）还是你想查的单词（如 bass / basis）。"]}
{"word":"baister","summary":{"en":"“Baister” is likely a misspelling of “baster”: a tool for pouring pan juices over food, or the action of basting while cooking.","zh":"“baister”很可能是“baster”的拼写错误：指“淋汁器”，也可相关地指烹饪时“淋汁”的动作（baste）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly) a kitchen tool used to suck up and pour hot liquid (like pan juices or melted butter) over food, especially meat, while it cooks.","zh":"（常用）“淋汁器/吸汁器”：一种厨房工具，用来吸取热汤汁（如烤盘肉汁或融化黄油）并在烹饪时淋在食物（尤其是肉类）上。"},"examples":[{"en":"Use a baster to pour the pan juices over the turkey every 30 minutes.","zh":"用淋汁器每30分钟把烤盘里的肉汁淋到火鸡上。"},{"en":"She bought a new baster for Thanksgiving cooking.","zh":"她为了感恩节做饭买了一个新的淋汁器。"}]},{"partOfSpeech":"vt.","definition":{"en":"to pour fat or liquid over food while it is cooking to keep it moist and add flavor (often used for roasting meat).","zh":"（烹饪）在食物烹调过程中反复把油脂或汁液淋在上面，使其保持湿润并增加风味（常用于烤肉）。"},"examples":[{"en":"Baste the chicken with butter to keep it from drying out.","zh":"用黄油不断给鸡肉淋汁，避免变干。"},{"en":"The recipe says to baste occasionally during roasting.","zh":"食谱说烘烤过程中要不时地淋汁。"}]}],"synonyms":["baste","turkey baster","drizzle (general)","spoon over (general)"],"phonetic":"ˈbeɪstɚ","extraExplanation":["“baister”不是常见的标准英语拼写；你可能想查的是 **baster**（淋汁器/淋汁）或动词 **baste**（淋汁）。在烹饪语境里，**baste** 是动作，**baster** 是工具。"]}
{"word":"Bait","summary":{"en":"“Bait” means an attractive thing used to catch fish/animals or to tempt people; as a verb, it means to put out bait, lure someone, or provoke someone on purpose.","zh":"“bait”指（捕捉用的）诱饵或（引人上当的）诱因；作动词可指上饵、引诱，也可指故意挑衅/激怒别人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Food or another substance used to attract and catch fish or animals (for example, on a hook or in a trap).","zh":"（钓鱼或捕捉动物用的）饵，诱饵（如鱼钩上的饵或陷阱里的饵）"},"examples":[{"en":"Worms are common bait for fishing.","zh":"蚯蚓是常见的钓鱼鱼饵。"},{"en":"The trap was set with bait inside.","zh":"陷阱里放了诱饵。"}]},{"partOfSpeech":"n.","definition":{"en":"Something that tempts or lures someone into doing something, often by offering an advantage.","zh":"（引诱别人上当的）诱惑物，诱因（常指用好处来吸引人）"},"examples":[{"en":"Free gifts were used as bait to get people to sign up.","zh":"他们用免费赠品作诱饵让人注册。"},{"en":"Don’t take the bait—he’s trying to start an argument.","zh":"别上当——他是在挑衅，想引起争吵。"}]},{"partOfSpeech":"vt.","definition":{"en":"To place bait on a hook or in a trap; to lure something or someone by offering an attraction.","zh":"（在鱼钩/陷阱上）放饵；用诱因引诱（某人或某物）"},"examples":[{"en":"She baited the hook with a small piece of shrimp.","zh":"她用一小块虾肉给鱼钩上饵。"},{"en":"Scammers bait people with messages about “easy money.”","zh":"骗子用“轻松赚钱”的信息来诱骗别人。"}]},{"partOfSpeech":"vt.","definition":{"en":"To deliberately annoy, tease, or provoke someone into reacting.","zh":"（故意）激怒，挑衅，逗弄（使对方反应）"},"examples":[{"en":"He tried to bait her into losing her temper.","zh":"他想挑衅她，让她发火。"},{"en":"Ignore the trolls—they’re just baiting you.","zh":"别理那些喷子——他们只是想激你。"}]}],"synonyms":["lure","temptation","enticement","hook","tease","provoke"],"phonetic":"/beɪt/","extraExplanation":["“bait”常用于网络语境：**clickbait**（标题党/诱导点击的内容），以及网络安全里的“baiting”（用诱饵诱导受害者下载或泄露信息）。","固定搭配：**take the bait**（上钩/中计）；**rise to the bait**（被激怒而回应）。","词源上与“咬（bite）”有关：诱饵是让动物去“咬”的东西，因此引申出“引诱、挑衅”的抽象含义。"]}
{"word":"bait","summary":{"en":"“Bait” means something used to lure (like fishing bait), or the act of tempting/provoking someone.","zh":"“bait”指用来引诱的东西（如鱼饵/诱饵），也指引诱或挑衅他人的行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Food or something attractive used to tempt an animal (especially fish) into being caught, or to lure someone into doing something.","zh":"（尤指钓鱼用的）鱼饵；（引诱他人上当或采取某种行为的）诱饵。"},"examples":[{"en":"Worms are common bait for fishing.","zh":"蚯蚓是常见的钓鱼饵。"},{"en":"The email looked like free money, but it was bait for a scam.","zh":"那封邮件看起来像是白送的钱，但其实是诈骗的诱饵。"}]},{"partOfSpeech":"v.","definition":{"en":"To tempt or lure someone or an animal, often into a trap or an argument.","zh":"引诱；诱使（进入陷阱或引发争吵等）。"},"examples":[{"en":"They tried to bait the dog with treats.","zh":"他们用零食引诱那只狗。"},{"en":"Don’t let the comments bait you into arguing online.","zh":"别被那些评论激得去网上争吵。"}]},{"partOfSpeech":"v.","definition":{"en":"To intentionally annoy or provoke someone (often: “bait someone”).","zh":"故意惹恼；挑衅（常用：bait someone）。"},"examples":[{"en":"The bully kept baiting him in class.","zh":"那个霸凌者在课堂上一直挑衅他。"},{"en":"She refused to be baited by rude questions.","zh":"她拒绝被无礼的问题激怒。"}]}],"synonyms":["lure","temptation","decoy","enticement","provoke"],"phonetic":"/beɪt/","extraExplanation":["“bait”既有中性用法（钓鱼饵），也常带负面含义（诱骗、挑衅）。在网络语境里很常见：clickbait（标题党/诱导点击的内容）、rage-bait（故意激怒以获取流量）。","常见搭配：take the bait（上钩/中计）；bait and switch（先用低价或诱人条件吸引，再换成更贵/更差的东西，一种不诚信营销手法）。","词源上与“bite（咬）”有关，最初指“让动物去咬的东西”，后来引申为“诱使人上当”的意思。"]}
{"word":"baited","summary":{"en":"“Baited” means ‘lured with bait’ (literal) or ‘provoked/tricked into reacting’ (informal online).","zh":"“baited”可指“上了诱饵的/用诱饵引诱的”（字面），也可指“被挑衅或被引诱而中招反应了”（网络口语）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “bait”: to attract or trap with something tempting (bait), or to deliberately annoy/provoke someone.","zh":"“bait”的过去式/过去分词：用诱饵引诱或诱捕；或故意挑衅、激怒某人。"},"examples":[{"en":"The fisherman baited the hook with worms.","zh":"钓鱼的人用蚯蚓给鱼钩上饵。"},{"en":"He felt the reporter was baiting him with rude questions.","zh":"他觉得记者用无礼的问题在故意挑衅他。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having bait on it; prepared with bait (often about a hook, trap, or lure).","zh":"（鱼钩、陷阱等）已上饵的；放了诱饵的。"},"examples":[{"en":"She tossed the baited line into the water.","zh":"她把上了饵的鱼线抛进水里。"},{"en":"The baited trap was placed near the hole.","zh":"放了诱饵的陷阱被放在洞口附近。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal, especially online/gaming) Tricked or lured into reacting; successfully provoked into making a mistake or showing emotion.","zh":"（非正式，常见于网络/游戏）被“钓”到反应了；被引诱上当、被成功激怒从而失误或露出情绪。"},"examples":[{"en":"I got baited into arguing in the comments.","zh":"我被钓到在评论区吵起来了。"},{"en":"Their team baited our tank and then ambushed the backline.","zh":"他们队把我们的坦克引出来后，埋伏了后排。"}]}],"synonyms":["lured","tempted","provoked","taunted","tricked","enticed"],"phonetic":"/ˈbeɪtɪd/","extraExplanation":["“bait”本义是“诱饵”，引申为“用诱因把人引到某种反应”。所以在网络语境里，“(get) baited”常指被引战、被带节奏、被人用话术或操作引诱到做出对方想要的回应。常见搭配：get baited（中招）、don’t take the bait（别上钩/别理会挑衅）、rage bait（引怒内容）。"]}
{"word":"baiter","summary":{"en":"A baiter is someone who uses bait to lure or train animals, or (informally) someone who provokes others to get a reaction.","zh":"baiter 指使用诱饵引诱/训练动物的人；也可（非正式）指故意挑衅他人、引发反应的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who uses bait to lure, trap, or test animals (for example, a fisherman using bait, or someone training dogs with bait).","zh":"使用诱饵来引诱、捕捉或测试动物的人（例如用鱼饵钓鱼的人，或用食物诱导训练动物的人）。"},"examples":[{"en":"The fisherman is a skilled baiter who knows which bait works in each season.","zh":"那位钓鱼者很会用饵，知道每个季节该用什么鱼饵。"},{"en":"In training, the baiter held a treat to guide the puppy to sit.","zh":"训练时，引导者拿着零食引导小狗坐下。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a person who deliberately provokes others online or in public, trying to get an angry reaction.","zh":"（非正式）故意在网上或公共场合挑衅他人、引发愤怒反应的人。"},"examples":[{"en":"Don’t argue with the baiter—just block and move on.","zh":"别跟挑衅者吵，直接拉黑就好。"},{"en":"The comments section was full of baiters posting insults to start fights.","zh":"评论区里满是挑衅者，用辱骂来挑起争吵。"}]}],"synonyms":["provocateur","troll","instigator"],"phonetic":"/ˈbeɪtər/","extraExplanation":["“bait”本义是“诱饵/引诱”。因此 baiter 直译就是“使用诱饵的人”。在网络语境里，bait 也常指“钓鱼式挑衅/引战（rage-bait, clickbait）”，所以 baiter 可指故意激怒他人的人。","注意：baiter 在英语里偶尔会出现在低俗双关语（与“masturbator”相关的谐音梗）中。正式写作或不熟悉语境时，建议改用更中性的词，如 “provocateur / troll”。"]}
{"word":"baiters","summary":{"en":"“Baiters” are either people who use bait to lure animals (e.g., fishing), or people who provoke others for a reaction (often online).","zh":"“baiters”既可指用诱饵引动物的人（如钓鱼），也可指故意挑衅他人以激起反应的人（常见于网络）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who use bait (food or another attractant) to lure animals, especially for fishing or hunting.","zh":"使用诱饵（食物或其他引诱物）来引动物的的人，尤指钓鱼或狩猎的人。"},"examples":[{"en":"The baiters set up near the river before sunrise to catch trout.","zh":"这些放诱饵的人天没亮就到河边布置，想钓到鳟鱼。"},{"en":"Some baiters prefer live bait because it moves naturally in the water.","zh":"有些放诱饵的人更喜欢用活饵，因为在水里动作更自然。"}]},{"partOfSpeech":"n.","definition":{"en":"People who intentionally provoke others to get an emotional reaction; instigators (often online).","zh":"故意挑衅他人、引发情绪反应的人；挑事者（常见于网络）。"},"examples":[{"en":"Don’t reply to baiters in the comments—mute or report them instead.","zh":"别在评论区回复那些挑衅者——直接静音或举报更好。"},{"en":"The moderator removed several baiters who kept starting arguments.","zh":"版主移除了几个不断挑起争吵的挑事者。"}]}],"synonyms":["trolls","provocateurs","instigators","anglers (fishing context)","trappers (hunting context)"],"phonetic":"/ˈbeɪtɚz/","extraExplanation":["“baiter”来自动词“bait”（用诱饵引诱；或故意激怒）。在网络语境里常见搭配是“rage-bait”（用夸张/冒犯内容引人发火）和“clickbait”（标题党）。注意：在某些非正式场合，“baiter”可能被拿来做低俗双关，因此正式写作中建议用更明确的词，如“provocateur / instigator / troll”。"]}
{"word":"baitfish","summary":{"en":"Baitfish are small fish used to catch bigger fish, or small prey fish that larger predators feed on.","zh":"Baitfish 指用来钓大鱼的小鱼，也可泛指在生态中被大鱼捕食的小型鱼类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small fish used as bait to catch larger fish","zh":"（钓鱼用的）饵鱼；用来引诱大鱼上钩的小鱼"},"examples":[{"en":"We used live baitfish to catch bass.","zh":"我们用活饵鱼来钓鲈鱼。"},{"en":"The fisherman threw a net to collect baitfish near the shore.","zh":"渔夫在岸边撒网捕捉饵鱼。"}]},{"partOfSpeech":"n.","definition":{"en":"small fish that larger fish hunt and eat (often schooling near the surface)","zh":"（生态语境）被大鱼捕食的小型鱼类（常成群在水面附近活动）"},"examples":[{"en":"Seabirds circled where baitfish were pushing to the surface.","zh":"海鸟在饵鱼被逼到水面的位置上空盘旋。"},{"en":"When the baitfish move in, the bigger predators follow.","zh":"饵鱼一游进来，更大的掠食鱼类就会跟着出现。"}]}],"synonyms":["bait","forage fish","prey fish"],"phonetic":"/ˈbeɪtˌfɪʃ/","extraExplanation":["“baitfish”常见于钓鱼与海洋生态的语境，既可以指“拿来当鱼饵的小鱼”，也可以更泛指“食物链底层、被捕食的小型鱼群”。常见的baitfish包括鲱鱼（herring）、沙丁鱼（sardine）、鳀鱼（anchovy）等（具体因地区而异）。","词形上多写作一个词 baitfish；复数通常也是 baitfish（也可见 baitfishes，但较少）。"]}
{"word":"baith","summary":{"en":"“Baith” is a Scots/dialect form of “both.”","zh":"“baith”是苏格兰英语/方言中“both（两者都）”的写法。"},"definitions":[{"partOfSpeech":"det.","definition":{"en":"(Scots / dialect) both; used to refer to two people or things together.","zh":"（苏格兰英语/方言）两者都；指两个人或两样东西一起。"},"examples":[{"en":"Baith of them are coming to the party.","zh":"他们两个都会来参加聚会。"},{"en":"She invited baith her parents.","zh":"她邀请了父母两人。"}]},{"partOfSpeech":"pron.","definition":{"en":"(Scots / dialect) both (as a pronoun, meaning “the two”).","zh":"（苏格兰英语/方言）（作代词）两者；两个人/两样东西。"},"examples":[{"en":"I like apples and pears—I'll take baith.","zh":"我喜欢苹果和梨——我两个都要。"},{"en":"Baith were tired after the long walk.","zh":"走了很久以后，两个人都累了。"}]}],"synonyms":["both"],"phonetic":"/beɪθ/","extraExplanation":["“baith”主要见于苏格兰英语（Scots）和带苏格兰口音/用词的写作中；在标准英语里通常用“both”。","在文学或对话里用“baith”常用来营造地域色彩与口语感，例如描写苏格兰人物时会用这种拼写来表现发音与身份。"]}
{"word":"baiting","summary":{"en":"Baiting usually means provoking someone to get a reaction; it can also mean putting bait on a hook/trap, or (historically) cruelly provoking animals for entertainment.","zh":"Baiting通常指为引发反应而挑衅或激怒他人；也可指挂饵/投饵；历史上还可指以挑逗动物为乐的残忍行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"teasing or provoking someone (often repeatedly) to make them angry or to get a reaction; harassment by provocation","zh":"（常指反复）挑衅、逗弄或激怒某人以引起反应；带有挑衅意味的骚扰"},"examples":[{"en":"Ignore the baiting and focus on your work.","zh":"别理会那些挑衅，专心做你的事。"},{"en":"His constant baiting made the meeting tense.","zh":"他不断的挑衅让会议气氛变得紧张。"},{"en":"Online baiting can quickly turn a small disagreement into a fight.","zh":"网络上的挑衅很容易把小分歧变成争吵。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of putting bait on a hook or in a trap to attract fish or animals","zh":"（钓鱼或设陷阱时）挂饵、投饵；用诱饵引来鱼或动物"},"examples":[{"en":"Baiting the hook is easier with smaller pieces of worm.","zh":"用更小块的虫子更容易把鱼钩挂饵。"},{"en":"The guide showed us the proper baiting technique.","zh":"向导教我们正确的挂饵技巧。"}]},{"partOfSpeech":"n.","definition":{"en":"cruel entertainment or abuse involving provoking an animal (e.g., bull-baiting, bear-baiting)","zh":"（旧时或不当行为）挑逗/虐待动物作乐（如斗牛前的“诱斗”、挑逗熊等）"},"examples":[{"en":"Bear-baiting is illegal in many places because it is cruel.","zh":"许多地方禁止“挑逗熊取乐”，因为这很残忍。"},{"en":"The museum exhibit explained how animal baiting was used as entertainment in the past.","zh":"博物馆展览介绍了过去人们如何把挑逗动物当作娱乐。"}]},{"partOfSpeech":"adj.","definition":{"en":"provoking or teasing someone, often to get an emotional response","zh":"挑衅的；逗弄激怒人的（常为引发情绪反应）"},"examples":[{"en":"She gave him a baiting smile to see if he would react.","zh":"她带着挑衅的笑容看他会不会有反应。"},{"en":"His baiting tone made it hard to stay calm.","zh":"他那种挑衅的语气让人很难保持冷静。"}]}],"synonyms":["provocation","teasing","taunting","harassment","needling"],"phonetic":"/ˈbeɪtɪŋ/","extraExplanation":["“baiting”常带负面评价，强调故意引人“上钩”或失控。在网络语境里很常见，比如baiting someone into an argument（引人吵架）或rage-bait（用内容激怒人以获取流量）。","注意区分bait（诱饵/引诱）与debate（辩论）：baiting不是理性讨论，而是为了刺激对方反应的挑衅。"]}
{"word":"baitingly","summary":{"en":"Baitingly means “in a deliberately teasing or provoking way, to get a reaction.”","zh":"baitingly 表示“以故意挑逗/挑衅的方式说或做，以激起对方反应”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a teasing, taunting, or deliberately provocative way—often to try to annoy someone or get a reaction.","zh":"以挑逗、嘲弄或故意挑衅的方式（常用来惹怒对方或激起反应）。"},"examples":[{"en":"He smiled baitingly, waiting for her to lose her temper.","zh":"他带着挑衅的微笑，等着她发脾气。"},{"en":"“Is that the best you can do?” she asked baitingly.","zh":"“这就是你能做到的最好程度吗？”她挑衅地问。"},{"en":"The headline was written baitingly to attract clicks and outrage.","zh":"这个标题写得很“钓人”，用来吸引点击和激起愤怒。"}]}],"synonyms":["provocatively","tauntingly","teasingly","goadingly","incitingly"],"phonetic":"/ˈbeɪtɪŋli/","extraExplanation":["“baitingly”来自动词 bait（诱饵；引诱/激怒）+ -ing + 副词后缀 -ly。它强调“故意把人‘钓’起来”的语气，多见于描写表情、语气、提问或标题：smile/look/ask/speak baitingly。","语感上它比 teasingly（开玩笑地逗）更尖锐、更有攻击性；也常接近 provocatively（挑衅地）或 tauntingly（嘲弄地）。"]}
{"word":"baits","summary":{"en":"“Baits” can mean multiple pieces of bait (food/items used to attract animals), or it can be the verb form meaning “attract/trick” or “provoke.”","zh":"“baits”既可作名词表示“诱饵（复数）”，也可作动词表示“引诱/诱骗”或“挑衅、激怒”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of bait) Food or another item used to attract an animal, especially for fishing or trapping.","zh":"（bait 的复数）诱饵；（尤指钓鱼或捕捉动物用的）饵料。"},"examples":[{"en":"Worms and small shrimp are common baits for fishing.","zh":"蚯蚓和小虾是常见的钓鱼饵料。"},{"en":"The hunter set out different baits to attract the animals.","zh":"猎人摆放了不同的诱饵来引动物上钩。"}]},{"partOfSpeech":"v.","definition":{"en":"(third-person singular of bait) To attract or trick someone or something by offering something tempting; to tease or provoke someone.","zh":"（bait 的第三人称单数）用诱饵引诱/诱骗；（也指）挑逗、激怒（某人）。"},"examples":[{"en":"The ad baits people with a “limited-time offer.”","zh":"这则广告用“限时优惠”来引诱人们下单。"},{"en":"He baits his opponents to make them lose their temper.","zh":"他挑衅对手，让他们失去冷静。"}]}],"synonyms":["lures","enticements","attractants","tempts","entices","provokes"],"phonetic":"/beɪt/","extraExplanation":["“bait”在网络语境里常见于 clickbait（标题党/诱导点击的内容）。它强调用很诱人的标题或封面“钓”你点进去。"]}
{"word":"baittle","summary":{"en":"“Battle” means a fight (literal or figurative) or to fight/struggle against something.","zh":"“battle”指（字面或比喻的）战斗/斗争，也可作动词表示与……作战或抗争。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fight between armies, groups, or people; a violent struggle","zh":"（军队、团体或个人之间的）战斗；搏斗"},"examples":[{"en":"The two armies met in a fierce battle.","zh":"两军展开了激烈的战斗。"},{"en":"She is fighting a battle against cancer.","zh":"她正在与癌症作斗争。"}]},{"partOfSpeech":"v.","definition":{"en":"to fight against someone or something, especially in a difficult situation","zh":"与……作战；与……斗争（尤指困难处境中）"},"examples":[{"en":"They battled for control of the city.","zh":"他们为争夺这座城市的控制权而战。"},{"en":"He is battling anxiety every day.","zh":"他每天都在与焦虑作斗争。"}]}],"synonyms":["fight","combat","struggle","clash"],"phonetic":"/ˈbæt̬əl/","extraExplanation":["你输入的“baittle”很可能是拼写错误，常见目标词是 **battle**（战斗）。正确拼写：b-a-t-t-l-e。","小提示：**battle** 里有两个 t（tt）。也常与 **fight**（更口语）搭配：fight a battle / battle against something。","常见搭配：**a fierce battle**（激烈的战斗）、**win/lose a battle**（赢/输一场战斗）、**battle against disease**（与疾病斗争）。"]}
{"word":"baitworm","summary":{"en":"A baitworm is a worm used as bait for fishing.","zh":"baitworm 指用来钓鱼的虫饵（蚯蚓或海蚯蚓等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a worm (often a marine worm) used as bait for fishing","zh":"（常指海蚯蚓等）用来钓鱼的虫饵、蚯蚓饵"},"examples":[{"en":"We bought baitworms at the tackle shop before going fishing.","zh":"我们去钓鱼前在渔具店买了虫饵。"},{"en":"Baitworms work well for catching flounder and other bottom fish.","zh":"虫饵很适合用来钓比目鱼等底栖鱼类。"}]}],"synonyms":["bait worm","fishing worm","earthworm (when used as bait)","bloodworm (type of baitworm)","lugworm (type of baitworm)"],"phonetic":"/ˈbeɪtˌwɝm/","extraExplanation":["在北美的钓鱼语境里，baitworm 常是泛称，可能指普通蚯蚓（earthworm）或海边常见的沙蚕/海蚯蚓（如 bloodworm、lugworm）。具体是哪一种，通常看你在哪里买、在哪钓、钓什么鱼。","写法上 baitworm 也常写成 bait worm（分开写）。口语里更常说 worms for bait 或 simply worms。"]}
{"word":"baitylos","summary":{"en":"A baitylos is a sacred stone—often thought to be a meteorite—revered as containing or representing divine power in ancient religions.","zh":"baitylos 指古代宗教中被崇拜的圣石，常与陨石相关，被认为承载或代表神力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sacred stone (often a meteorite) worshiped in some ancient religions and believed to be inhabited by a god or to have divine power.","zh":"（古代宗教中的）圣石；常指陨石或被奉为神圣的石头，被认为有神灵居住或具有神力。"},"examples":[{"en":"In some ancient temples, a baitylos was treated as the physical presence of a deity.","zh":"在一些古代神庙里，baitylos 被视为神明的实体化身。"},{"en":"Archaeologists debate whether certain black stones were baityloi or simply symbolic markers.","zh":"考古学家争论某些黑色石头究竟是 baityloi（圣石）还是仅仅象征性的标记。"}]}],"synonyms":["baetylus","sacred stone","cult stone"],"phonetic":"/biˈtaɪləs/","extraExplanation":["也常拼作 **baetylus**（复数 **baetyli**）。词源常追溯到闪米特语系（如腓尼基语/希伯来语相关词根），大意与“神的居所/神圣之屋”有关，因此指被当作神灵载体来崇拜的石头。","在古地中海与近东文化中，这类“圣石”有时与陨石联系在一起，因为从天而降的石头更容易被理解为“来自神界”。在英文历史与宗教研究写作里，这个词多出现在讨论古代崇拜、神庙仪式或象征物的语境。"]}
{"word":"baiza","summary":{"en":"“Baiza” is usually a name, not a common English word.","zh":"“Baiza”通常是人名，不是常见英语单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A personal name (given name or surname). It is not a standard English vocabulary word and is usually used as someone’s name.","zh":"人名（名字或姓氏）。它不是标准英语词汇，通常用作某人的名字。"},"examples":[{"en":"Baiza is my classmate.","zh":"Baiza 是我的同学。"},{"en":"I met Dr. Baiza at the conference.","zh":"我在会议上见到了 Baiza 医生。"}]}],"phonetic":"/ˈbaɪzə/","extraExplanation":["“Baiza”更常见于姓名或音译（把其他语言的名字用拉丁字母写出来），因此在英英词典里通常查不到固定词义。","如果你是在某个句子里看到 baiza（小写）或它其实是一个短语/拼写变体，请把原句发来，我可以根据上下文判断它的准确含义与读音。"]}
{"word":"baizas","summary":{"en":"“baizas” is not a recognized standard English word; it’s likely a misspelling or a name.","zh":"“baizas”不是常见的标准英语词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name, or a word from another language.","zh":"不是标准英语词。可能是拼写错误、人名，或来自其他语言的词。"},"examples":[{"en":"I can’t find “baizas” in standard English dictionaries—could you tell me where you saw it?","zh":"我在标准英语词典里找不到“baizas”——你是在哪里看到它的？"},{"en":"If you meant “bazaar,” the spelling is different.","zh":"如果你想写的是“bazaar（集市）”，那拼写不一样。"}]}],"phonetic":"ˈbaɪzəz","extraExplanation":["“baizas”很可能是：\n1）拼错：常见相近词包括 bazaar（集市）、basis（基础/根据）、bias（偏见/偏向）等；\n2）专有名词：比如人名/账号名/地名；\n3）外来语或某种语言的词。\n\n为了更准确：请告诉我你看到它的句子/上下文，或你想表达的意思（中文也可以）。"]}
{"word":"baize","summary":{"en":"Baize is a thick felt-like cloth (often green), especially used on billiard tables and desks; rarely, it can mean to cover something with this cloth.","zh":"Baize 指一种厚实的台呢（常为绿色），多用于铺台球桌或书桌；很少情况下也可作动词，表示用这种布包覆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a thick, soft woolen cloth (often green) used to cover billiard/pool tables, writing desks, and doors to reduce noise or protect surfaces","zh":"一种厚实柔软的毛呢布（常为绿色），常用来铺台球桌、书写桌面或包门，以降噪或保护表面"},"examples":[{"en":"The pool table was covered in green baize.","zh":"那张台球桌铺着绿色的台呢。"},{"en":"He wrote letters on a desk topped with baize to keep the paper from sliding.","zh":"他在铺着台呢的书桌上写信，纸张不容易滑动。"},{"en":"In old houses, a baize-covered door helped muffle sounds from the servants’ area.","zh":"在老房子里，包着台呢的门能减弱仆人区传来的声音。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cover or line something with baize (rare)","zh":"用台呢包覆或衬垫某物（较少见）"},"examples":[{"en":"They baized the tabletop to protect it from scratches.","zh":"他们用台呢包住桌面以防刮花。"}]}],"synonyms":["felt","woolen cloth","table cloth (context-specific)","to cover","to line"],"phonetic":"/beɪz/","extraExplanation":["“baize”在英式生活场景里很常见：台球桌面常说“green baize”。一些老式英国住宅或文学作品中也会提到“green baize door（绿色台呢门）”，指用厚布包门以隔音、保暖，常带有“楼上/楼下（主人与仆人区分）”的时代氛围。"]}
{"word":"baize-covered","summary":{"en":"“Baize-covered” describes something covered with thick baize cloth, especially a table or door.","zh":"“baize-covered”指“覆盖着厚台呢布的”，常形容桌子或门。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"covered with baize (a thick, felt-like woolen cloth), often used on tables or doors to reduce noise or protect the surface","zh":"覆盖着台呢（baize，一种厚实、类似毡的呢绒布）的；常用于桌面或门上以减噪或保护表面"},"examples":[{"en":"The committee met around a baize-covered table in the old town hall.","zh":"委员会在老市政厅里一张铺着台呢的桌子旁开会。"},{"en":"He set the cards down carefully on the baize-covered surface.","zh":"他小心地把纸牌放在铺着台呢的桌面上。"},{"en":"The baize-covered door helped keep the hallway quiet.","zh":"那扇包着台呢的门有助于让走廊更安静。"}]}],"synonyms":["baize-topped","cloth-covered","felt-covered"],"phonetic":"/ˈbeɪz ˌkʌvərd/","extraExplanation":["“baize”常见于英式语境，指一种厚实、耐磨的呢绒布，传统上多为绿色，常铺在台球桌、纸牌桌或办公桌上，也会用来包门以减少碰撞声。","在文学或历史叙述中，“baize-covered table/door”常用来营造“旧式机关、委员会会议、正式而略显陈旧的室内空间”的氛围。"]}
{"word":"baized","summary":{"en":"“Baized” means “covered with baize,” a thick cloth often used for quieting or protecting surfaces.","zh":"“baized”指“用台呢包覆的”，台呢是一种常用于隔音或保护表面的厚布。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"covered with baize (a thick, soft woolen cloth), often to reduce noise or protect surfaces.","zh":"用台呢（厚实柔软的毛织物）包覆的，常用于隔音或保护表面。"},"examples":[{"en":"The courtroom door was baized to muffle the sound from the hall.","zh":"法庭的门用台呢包覆，以减弱走廊传来的声音。"},{"en":"She pushed aside the baized curtain and stepped into the office.","zh":"她拨开台呢门帘，走进办公室。"}]},{"partOfSpeech":"v.","definition":{"en":"(Less common) past tense/past participle of “baize”: to cover something with baize.","zh":"（较少见）“baize”的过去式/过去分词：用台呢包覆（某物）。"},"examples":[{"en":"The table was baized to protect the polished wood.","zh":"桌面用台呢包覆，以保护抛光的木头。"}]}],"synonyms":["baize-covered","cloth-covered","felted"],"phonetic":"/beɪzd/","extraExplanation":["“baize”（台呢）在英美文化里常见于台球桌面（绿色台呢）以及一些公共建筑的门、门帘或墙面包覆，用来降噪、保温或显得更“庄重”。因此在文学或老式描写中，baized door / baized curtain 往往带有“安静、正式、封闭”的氛围感。"]}
{"word":"baizes","summary":{"en":"“Baizes” means multiple pieces or types of baize, a thick cloth often used on billiard tables or as protective lining.","zh":"“Baizes”指多块或多种“baize（台呢布）”，常见于台球桌面或作为保护衬布。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of baize: a thick, coarse woolen (or wool-like) cloth, often used to cover tables (especially billiard tables) or to line surfaces for protection.","zh":"baize 的复数：一种厚实、较粗的呢绒（或仿呢绒）布料，常用来覆盖桌面（尤其是台球桌），或用作衬里以起到保护作用。"},"examples":[{"en":"The old pool hall had several tables covered in worn green baizes.","zh":"那家老台球厅里有好几张桌子都铺着磨旧的绿色台呢布。"},{"en":"Different baizes are used to reduce noise and protect delicate instruments in cases.","zh":"不同的台呢布会用来降低噪音，并在箱子里保护精密仪器。"}]}],"synonyms":["felt","woolen cloth","table felt","cloth covering"],"phonetic":"/ˈbeɪzɪz/","extraExplanation":["“Baize”最常让人联想到台球桌面的绿色绒布；在英式语境里也常指用来铺桌、做隔音或防刮衬垫的厚布。","“Baizes”作为复数，多用于强调“不同种类/多块台呢布”，在日常英语里单数“baize”更常见。"]}
{"word":"baizing","summary":{"en":"Baizing means covering or lining something with baize (a thick woolen cloth), usually for protection or a soft surface.","zh":"Baizing 指用台呢/粗呢（厚实的羊毛布）给物品包覆或衬里，多用于保护或提供柔软表面。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of covering something with baize (a thick woolen cloth), often for protection or a soft surface","zh":"用台呢/粗呢（baize，一种厚实的羊毛布）覆盖某物的行为或过程，常用于保护或形成柔软表面"},"examples":[{"en":"The craftsman finished the baizing of the tabletop to prevent scratches.","zh":"工匠完成了桌面的台呢包覆，以防刮花。"},{"en":"Baizing the inside of the case helps cushion the instrument.","zh":"给盒子内部铺上台呢能起到缓冲保护乐器的作用。"}]},{"partOfSpeech":"v.","definition":{"en":"covering or lining (something) with baize","zh":"用台呢/粗呢覆盖或衬里（某物）"},"examples":[{"en":"They are baizing the display boards to make the pins hold better.","zh":"他们正在给展示板包台呢，让图钉更容易固定。"},{"en":"The workshop offered baizing services for jewelry boxes.","zh":"这家工坊提供首饰盒的台呢包衬服务。"}]}],"synonyms":["covering with baize","lining","padding","felting (similar idea, not identical)"],"phonetic":"/ˈbeɪzɪŋ/","extraExplanation":["“baizing”来自“baize”（台呢/粗呢）。baize 常见于台球桌（绿色台呢）、告示板或抽屉内衬等，能减少摩擦、保护表面并提升手感。日常英语里更常说“cover/line with baize”，而“baizing”更偏工艺、制作或说明书语境。"]}

