{"word":"Baja","summary":{"en":"Baja usually refers to the Baja California peninsula in Mexico, and it can also describe things from that region or the famous off-road races held there.","zh":"Baja 通常指墨西哥的下加利福尼亚半岛，也可作形容词表示“巴哈地区的”，或指当地著名的越野赛事（如巴哈1000）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a common short name for the Baja California peninsula in northwestern Mexico (including the Mexican states Baja California and Baja California Sur).","zh":"“下加利福尼亚”（Baja California）的常用简称，指墨西哥西北部的下加利福尼亚半岛（包括下加利福尼亚州与南下加利福尼亚州）。"},"examples":[{"en":"They’re planning a road trip down Baja to see the beaches.","zh":"他们计划沿着巴哈（下加利福尼亚半岛）自驾去看海滩。"},{"en":"Fresh fish tacos are popular in Baja.","zh":"巴哈的鲜鱼塔可很有名。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to Baja California or the Baja peninsula.","zh":"与下加利福尼亚（巴哈）地区有关的；巴哈半岛的。"},"examples":[{"en":"We booked a Baja tour for snorkeling.","zh":"我们订了一个巴哈地区的浮潜行程。"},{"en":"Baja cuisine often features seafood and citrus.","zh":"巴哈风味常以海鲜和柑橘类食材为特色。"}]},{"partOfSpeech":"n.","definition":{"en":"(often in names) an off-road race held in Baja California, especially the Baja 1000.","zh":"（常用于赛事名称）在巴哈地区举办的越野赛事，尤指“巴哈1000”（Baja 1000）。"},"examples":[{"en":"He trained for months to race the Baja 1000.","zh":"他为了参加巴哈1000训练了好几个月。"},{"en":"The team built a truck for Baja racing.","zh":"车队为巴哈越野赛打造了一辆赛车。"}]}],"synonyms":["Baja California","the Baja peninsula"],"phonetic":"/ˈbɑːhɑː/","extraExplanation":["“Baja”来自西班牙语，原意是“低的、下方的”。“Baja California”历史上与“Alta California（上加利福尼亚）”相对；后者大致对应今天美国的加利福尼亚州一带。","英语里单独说“Baja”，常见于旅行、冲浪、潜水、美食（如 Baja-style fish tacos）以及越野赛事（Baja 1000）的语境中。","发音上英语使用西班牙语风格的 /h/ 音（像英文的 h），所以常读作“BAH-hah”。"]}
{"word":"baja","summary":{"en":"“Baja” most commonly refers to the Baja California region/peninsula in Mexico, and can also describe things associated with that area (e.g., Baja racing, Baja-style food).","zh":"“Baja”最常指墨西哥的下加利福尼亚地区/半岛；也可作形容词表示“与该地区相关的”（如Baja越野赛、Baja风格美食）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A peninsula and Mexican state/region in northwest Mexico, officially Baja California and Baja California Sur; in English it often refers to the Baja California Peninsula.","zh":"（专有名词）墨西哥西北部的“下加利福尼亚”地区/半岛，主要指下加利福尼亚半岛（分为下加利福尼亚州与南下加利福尼亚州）。"},"examples":[{"en":"They drove down Baja to go surfing near Ensenada.","zh":"他们一路开车南下穿过Baja，在恩塞纳达附近冲浪。"},{"en":"Baja California is known for deserts, beaches, and great seafood.","zh":"下加利福尼亚以沙漠、海滩和很棒的海鲜闻名。"}]},{"partOfSpeech":"adj.","definition":{"en":"(In English) Describing something from or associated with Baja California, especially off-road racing or a regional style (e.g., food).","zh":"（英语用法）形容与下加利福尼亚有关的事物，常见于越野赛车或当地风格（如饮食）。"},"examples":[{"en":"He bought a Baja truck for off-road trips.","zh":"他买了一辆“Baja风格”的卡车，用来跑越野。"},{"en":"We tried Baja-style fish tacos.","zh":"我们尝了下Baja风格的炸鱼塔可。"}]}],"synonyms":["Baja California","Baja California Peninsula"],"phonetic":"ˈbɑːhɑː","extraExplanation":["“Baja”来自西班牙语，意思是“低、下（lower）”。因此 Baja California 字面是“下（低）加利福尼亚”，对应更北的 Alta California（上加利福尼亚；历史上指今天美国加州一带）。","英语里单独说 “Baja” 多用于地名与文化语境（旅行、冲浪、海鲜、越野赛事如 Baja 1000）。在书写上常首字母大写：Baja。"]}
{"word":"bajada","summary":{"en":"Bajada usually means a broad, gently sloping alluvial apron at the base of mountains; it can also mean a downhill descent (from Spanish).","zh":"bajada 通常指山麓由多个冲积扇汇合形成的大片缓坡状冲积沉积地；也可指（源自西语的）下坡/下降路段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Geography, especially in the U.S. Southwest) a broad, gently sloping deposit of gravel/sand at the base of mountains, formed when several alluvial fans merge into one continuous apron.","zh":"（地理学，尤指美国西南）山麓处由多条冲积扇连成的一大片缓坡状沉积地（冲积裙/冲积坡），常由砂砾等物质堆积而成。"},"examples":[{"en":"After heavy rains, water spread across the bajada and carried new gravel downslope.","zh":"暴雨之后，水流在冲积坡上铺开，把新的砾石向下带走。"},{"en":"Many desert towns are built on a bajada between the mountains and the valley floor.","zh":"许多沙漠城镇建在山地与谷底之间的冲积坡上。"}]},{"partOfSpeech":"n.","definition":{"en":"(In Spanish or in outdoor-sports contexts) a downhill stretch or descent.","zh":"（来自西语或户外运动语境）下坡路段；下滑；下降。"},"examples":[{"en":"The trail has a long bajada before it levels out near the river.","zh":"这条步道有一段很长的下坡，靠近河边时才变平。"}]}],"synonyms":["alluvial apron","alluvial slope","(for sense 2) descent","downhill"],"phonetic":"/bəˈhɑːdə/","extraExplanation":["“bajada”源自西班牙语，字面意思是“下降/下坡”。在英语里最常见的是地理学用法，尤其在美国西南（如亚利桑那、新墨西哥）讨论沙漠地貌时常见。","地貌上，bajada 常被理解为“多个冲积扇（alluvial fans）在山前连在一起形成的连续缓坡”，比单个冲积扇规模更大、更连续。"]}
{"word":"Bajadero","summary":{"en":"Bajadero means a downward place or route—a slope, descent, or ramp—used especially in Spanish-speaking settings.","zh":"Bajadero 指下坡处或下行的路/通道（斜坡、下坡路、坡道），多见于西语语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(chiefly in Spanish-speaking regions) a place or path that goes down, such as a slope, descent, ramp, or steep drop-off.","zh":"（多见于西语地区）下坡处、下行的路；可指斜坡、下坡路、坡道或陡降处。"},"examples":[{"en":"The trail ends at a bajadero that drops toward the river.","zh":"这条小径尽头有个 bajadero，向河边陡然下去。"},{"en":"Drive slowly—the bajadero is steep and the road is narrow.","zh":"慢点开——这个 bajadero 很陡，而且路很窄。"}]},{"partOfSpeech":"n.","definition":{"en":"a sloping access point or landing area, especially leading down to water or a road (like a small ramp).","zh":"（尤指通向水边或道路的）下行通道/下坡入口；类似小坡道、下水点。"},"examples":[{"en":"Fishermen used the bajadero to reach the shore.","zh":"渔民用 bajadero 下到岸边。"},{"en":"We parked near the bajadero and carried the kayak down.","zh":"我们把车停在 bajadero 附近，把皮划艇搬下去。"}]}],"synonyms":["slope","descent","downhill","ramp","drop-off"],"phonetic":"/ˌbɑːhəˈdɛroʊ/","extraExplanation":["“Bajadero”来自西班牙语，源于动词“bajar”（下去、降低）。在英语中多作为地域性借词出现（如描写拉美或加勒比地区的地形/道路），在一般英语会更常用“slope / descent / ramp”。"]}
{"word":"Bajaj","summary":{"en":"“Bajaj” is an Indian surname and a well-known business/brand name in India.","zh":"“Bajaj”是印度常见姓氏，也常指印度知名企业/品牌名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a common Indian surname, especially associated with a major Indian business family and its companies (e.g., Bajaj Auto, Bajaj Finserv).","zh":"一个常见的印度姓氏；也常用来指与著名的印度商业家族及其企业相关的“Bajaj”（如 Bajaj Auto、Bajaj Finserv）。"},"examples":[{"en":"Bajaj Auto is one of India’s best-known motorcycle and scooter makers.","zh":"Bajaj Auto 是印度最知名的摩托车和踏板车制造商之一。"},{"en":"She works for Bajaj Finserv in Pune.","zh":"她在浦那的 Bajaj Finserv 工作。"}]}],"phonetic":"/bəˈdʒɑːdʒ/","extraExplanation":["“Bajaj”在英语语境里多作为专有名词出现：要么是人的姓氏，要么指“Bajaj集团”及其品牌。写作上通常首字母大写。","发音在英语中常近似 /bə-JAHJ/；不同地区口音会有轻微差异。"]}
{"word":"Bajan","summary":{"en":"“Bajan” means “Barbadian”: from Barbados, a person from Barbados, or the local Bajan (English-based) creole/dialect.","zh":"“Bajan”意为“巴巴多斯的/巴巴多斯人”，也可指巴巴多斯的英语系克里奥尔语/方言。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Barbados (its people, culture, or things from there); Barbadian.","zh":"与巴巴多斯有关的；巴巴多斯的（人、文化或事物）。"},"examples":[{"en":"She loves Bajan music and food, especially flying fish.","zh":"她很喜欢巴巴多斯的音乐和食物，尤其是飞鱼。"},{"en":"We visited a Bajan village on the east coast of Barbados.","zh":"我们参观了巴巴多斯东海岸的一个巴巴多斯村庄。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Barbados; a Barbadian.","zh":"巴巴多斯人；巴巴多斯居民。"},"examples":[{"en":"As a Bajan, he grew up going to the beach every weekend.","zh":"作为一个巴巴多斯人，他从小几乎每个周末都去海边。"},{"en":"Many Bajans live and work abroad.","zh":"许多巴巴多斯人在海外生活和工作。"}]},{"partOfSpeech":"n.","definition":{"en":"the English-based creole/dialect spoken in Barbados (often called Bajan Creole).","zh":"巴巴多斯使用的英语系克里奥尔语/方言（常称“Bajan Creole”）。"},"examples":[{"en":"He can switch between Standard English and Bajan easily.","zh":"他能在标准英语和巴巴多斯克里奥尔语之间自如切换。"},{"en":"Some phrases in Bajan may sound fast to new learners.","zh":"对初学者来说，巴巴多斯克里奥尔语里有些表达听起来很快。"}]}],"synonyms":["Barbadian"],"phonetic":"/ˈbeɪdʒən/","extraExplanation":["“Bajan”通常读作“BAY-jən”，是“Barbadian”的常见简称与俗称，在当地与加勒比语境中很常用。","写作上多用大写“Bajan”，尤其指族群身份（a Bajan）、文化（Bajan culture）或语言（Bajan/ Bajan Creole）。","在文学与文化作品中，“Bajan”常用来强调巴巴多斯的本土身份与日常语言（例如人物对话中夹用Bajan来呈现地域特色）。"]}
{"word":"bajan","summary":{"en":"“Bajan” means “from Barbados” or “a person from Barbados,” and it can also refer to Barbados’s local dialect/creole.","zh":"“Bajan”指“巴巴多斯的/来自巴巴多斯的人”，也可指巴巴多斯当地的英语方言/克里奥尔语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Barbados or its people, culture, or dialect (especially the local English-based creole).","zh":"（形容）与巴巴多斯（Barbados）或其人民、文化、方言有关的（尤其指当地的英语克里奥尔语）。"},"examples":[{"en":"Bajan food often features flying fish and cou-cou.","zh":"巴巴多斯（Bajan）美食常见飞鱼和玉米糊（cou-cou）。"},{"en":"She grew up speaking Bajan at home and Standard English at school.","zh":"她在家讲巴巴多斯方言（Bajan），在学校讲标准英语。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Barbados; a Barbadian (informal/common in everyday use).","zh":"（名词）巴巴多斯人；巴巴多斯居民（较口语、常用）。"},"examples":[{"en":"He’s a Bajan who moved to New York for work.","zh":"他是巴巴多斯人（Bajan），为了工作搬到了纽约。"},{"en":"Many Bajans celebrate Crop Over every year.","zh":"许多巴巴多斯人（Bajans）每年都会庆祝丰收节（Crop Over）。"}]}],"synonyms":["Barbadian"],"phonetic":"/ˈbeɪdʒən/","extraExplanation":["“Bajan”通常读作类似“bay-jun”，是“Barbadian（巴巴多斯的/巴巴多斯人）”在当地与加勒比地区常见的简称，用作自称时很普遍。","语言学习里提到的“Bajan”常特指巴巴多斯的英语克里奥尔语（Bajan Creole/ Bajan dialect）；在正式写作中也会用“Barbadian English”来表述。"]}
{"word":"Bajardo","summary":{"en":"Bajardo is usually a proper name—most commonly a surname, and sometimes the name of a town in Liguria, Italy.","zh":"Bajardo 通常是专有名词——多见于姓氏，也可能指意大利利古里亚大区的一座小镇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a proper name (most often a surname)","zh":"专有名词（多见于姓氏）"},"examples":[{"en":"Ms. Bajardo will lead the meeting today.","zh":"Bajardo 女士今天将主持会议。"},{"en":"I saw the name Bajardo on the guest list.","zh":"我在宾客名单上看到了 Bajardo 这个名字。"}]},{"partOfSpeech":"other","definition":{"en":"a place name: Bajardo, a small town (comune) in Liguria, Italy","zh":"地名：Bajardo，意大利利古里亚大区的一个小镇（市镇）"},"examples":[{"en":"Bajardo is a quiet hill town in northern Italy.","zh":"Bajardo 是意大利北部一座安静的山城。"},{"en":"They visited Bajardo while traveling through Liguria.","zh":"他们在利古里亚旅行时去了 Bajardo。"}]}],"phonetic":"/bəˈhɑr.doʊ/","extraExplanation":["“Bajardo”在英语里不是常见词汇，通常作为人名或地名出现，因此含义要靠具体语境判断。","作为地名时，它指意大利利古里亚（Liguria）的一座市镇；在英文文本里常与“in Liguria / in Italy”等搭配出现。"]}
{"word":"bajardo","summary":{"en":"“Bajardo” is generally a proper name (often a Spanish surname), not an English vocabulary word with a standard dictionary meaning.","zh":"“Bajardo”通常是专有名词（常见为西班牙语姓氏），不是有固定词义的英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most commonly seen as a Spanish-language surname or a proper name (e.g., a family name).","zh":"不是标准英语单词；最常见为西班牙语背景的姓氏或专有名词（如人名/家族姓）。"},"examples":[{"en":"Her last name is Bajardo.","zh":"她的姓是 Bajardo。"},{"en":"I’m not sure how to spell Bajardo—could you write it out?","zh":"我不确定 Bajardo 怎么拼——你可以写出来吗？"}]}],"synonyms":["(no direct English synonyms; it functions as a name)"],"phonetic":"bɑˈhɑrdoʊ","extraExplanation":["“Bajardo”更像是西班牙语体系中的专名（姓氏/地名/品牌名等），在英语词典里通常查不到固定词义。","如果你是在阅读/作业里遇到的，给我一句原句或说明它是人名、地名还是你想找的英语单词的拼写，我可以帮你判断是否为拼写错误（例如可能想写的是别的英语词）。"]}
{"word":"bajarigar","summary":{"en":"Bajarigar is likely a misspelling of “bazigar/baazigar,” meaning a juggler/acrobat, and figuratively a clever trickster.","zh":"bajarigar 很可能是 “bazigar/baazigar” 的误拼：本义指杂技/把戏表演者，引申可指善于耍手段、玩转局面的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a juggler, acrobat, or trick-performing entertainer (a South Asian word, often seen in Hindi/Urdu contexts; also spelled “baazigar/bazigar”).","zh":"杂技演员；魔术/把戏表演者（南亚语境常见的词，常见拼写为“baazigar/bazigar”）。"},"examples":[{"en":"In the village fair, a bazigar entertained the crowd with quick hand tricks.","zh":"在乡村集市上，一位bazigar用快速的手上把戏逗乐了人群。"},{"en":"The story compares the hero to a bazigar—someone who can deceive or surprise others.","zh":"故事把主角比作bazigar——一个能迷惑或出其不意的人。"}]},{"partOfSpeech":"n.","definition":{"en":"figuratively, a clever person who “plays” situations skillfully, sometimes in a manipulative way.","zh":"（比喻）善于“玩转”局势的人；有时含“耍手段、操纵”的意味。"},"examples":[{"en":"He acted like a bazigar in business, always turning problems into advantages.","zh":"他在生意场上像个bazigar，总能把问题变成优势。"},{"en":"Don’t trust every promise—some people are bazigars with words.","zh":"别轻信每个承诺——有些人很会用语言耍花招。"}]}],"synonyms":["juggler","acrobat","performer","trickster","conjurer"],"phonetic":"/ˈbɑːzɪɡɑr/","extraExplanation":["“bajarigar”更像是拼写误差；你可能想查的是“baazigar / bazigar（巴兹加尔）”。这个词常见于印地语/乌尔都语语境，来自波斯语词根：bāzī（游戏、表演、把戏）+ -gar（从事某事的人），字面有“玩把戏的人/表演者”的意思。","流行文化里，“Baazigar”也可能让人想到1990年代宝莱坞电影《Baazigar》（片名可理解为“赌徒/高手/玩弄局面的人”一类的意象），因此在一些语境中会带一点“善于算计、出奇制胜”的比喻色彩。"]}
{"word":"Bajau","summary":{"en":"Bajau refers to the Sama-Bajau people of maritime Southeast Asia, their languages, and anything related to their culture.","zh":"Bajau 指海洋东南亚的萨玛-巴瑶族（巴瑶人）、他们的语言，以及与其文化相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an Austronesian ethnic group (also called Sama-Bajau) living mainly in maritime Southeast Asia, especially in the southern Philippines, Malaysia (Sabah), and Indonesia.","zh":"巴瑶人／巴瑶族（亦称萨玛-巴瑶），南岛语系的一个民族，主要分布在海洋东南亚地区，如菲律宾南部、马来西亚（沙巴）和印度尼西亚。"},"examples":[{"en":"The Bajau have long histories of fishing and seafaring across Southeast Asia.","zh":"巴瑶族在东南亚有悠久的捕鱼和航海历史。"},{"en":"Researchers worked with Bajau communities to document traditional boat-building skills.","zh":"研究人员与巴瑶社区合作，记录传统造船技艺。"}]},{"partOfSpeech":"n.","definition":{"en":"the languages/dialects spoken by the Bajau (often grouped under the Sama-Bajau languages).","zh":"巴瑶语（通常归入萨玛-巴瑶语群的语言或方言）。"},"examples":[{"en":"She is learning Bajau to communicate with her grandparents.","zh":"她正在学习巴瑶语，以便和祖父母交流。"},{"en":"Bajau has different varieties depending on the island and community.","zh":"巴瑶语因岛屿和社区不同而有不同变体。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Bajau people or their language and culture.","zh":"巴瑶的；与巴瑶族或其语言、文化有关的。"},"examples":[{"en":"They performed a Bajau dance at the cultural festival.","zh":"他们在文化节上表演了巴瑶舞。"},{"en":"The museum displayed Bajau artifacts from coastal villages.","zh":"博物馆展出了来自沿海村落的巴瑶族文物。"}]}],"synonyms":["Sama-Bajau","Sama"],"phonetic":"ˈbɑːdʒaʊ","extraExplanation":["“Bajau”在英文里有时会被不够准确地与“Sea Gypsies（海上吉普赛人）”等称呼混用；在正式或尊重的语境中，更建议直接用“Bajau”或“Sama-Bajau”。","巴瑶族内部多样性很大：有些群体传统上更常居海上或靠海生活，也有不少群体长期在陆地定居；因此描述时避免把所有巴瑶人都概括成“住在船上”。"]}
{"word":"bajau","summary":{"en":"Bajau refers to a seafaring Austronesian people of maritime Southeast Asia, and it can also describe things related to their culture or languages.","zh":"Bajau 指东南亚海域以航海传统著称的南岛语系民族（巴瑶族），也可作形容词表示“巴瑶族的/与其文化或语言相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an Austronesian ethnic group from maritime Southeast Asia, found especially in the southern Philippines, Malaysia (Sabah), and Indonesia, traditionally known for a seafaring way of life.","zh":"巴瑶族人；东南亚海域的南岛语系民族成员，主要分布在菲律宾南部、马来西亚（沙巴）和印度尼西亚一带，传统上以航海与海上生活闻名。"},"examples":[{"en":"The Bajau have rich maritime traditions, including fishing and boat-building.","zh":"巴瑶族拥有丰富的海洋传统，包括捕鱼和造船。"},{"en":"A museum exhibit highlighted Bajau music, weaving, and daily life in coastal villages.","zh":"一场博物馆展览展示了巴瑶族的音乐、编织与沿海村落的日常生活。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Bajau people, their languages, or their culture.","zh":"巴瑶族的；与巴瑶族、其语言或文化相关的。"},"examples":[{"en":"She is studying Bajau oral stories and how they are passed down in families.","zh":"她在研究巴瑶族口述故事以及它们如何在家族中代代相传。"},{"en":"The documentary features Bajau communities living near coral reefs.","zh":"这部纪录片呈现了生活在珊瑚礁附近的巴瑶族社群。"}]}],"synonyms":["Sama-Bajau","Sama"],"phonetic":"/bəˈdʒaʊ/","extraExplanation":["“Bajau”常与“Sama-Bajau”并用：学术与官方语境中，许多群体更倾向用“Sama”（自称）或“Sama-Bajau”来概括相关社群；不同地区内部差异很大。","英语里有时会把巴瑶族称作“Sea Gypsies”（海上吉普赛人），但这个说法可能带有刻板印象或冒犯色彩；在正式或尊重的表达中更建议用“Bajau”或“Sama-Bajau”。","在拼写上也可能见到“Badjao”等变体，多与不同地区的转写习惯有关。"]}
{"word":"Bajer","summary":{"en":"“Bajer” is usually a surname in English contexts; in Polish-influenced usage it can mean a gimmick or smooth talk/pick-up line.","zh":"“Bajer”在英语语境里多为姓氏；在受波兰语影响的用法中可指噱头或花言巧语/搭讪台词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A family name (surname). It is not a standard English vocabulary word, but you may see it as a person’s last name.","zh":"姓氏（人名）。它不是标准英语词汇，但你可能会把它当作人的姓氏看到。"},"examples":[{"en":"Dr. Bajer will speak at the conference tomorrow.","zh":"Bajer 医生将于明天在会议上发言。"},{"en":"I found an article written by someone named Bajer.","zh":"我找到一篇作者姓 Bajer 的文章。"}]},{"partOfSpeech":"n.","definition":{"en":"(From Polish, informal) A gimmick, flashy trick, or a smooth “line,” especially used to impress someone (similar to a pick-up line).","zh":"（源自波兰语，非正式）噱头、花招；也可指用来讨好/打动别人的“套话/撩人话”（类似搭讪台词）。"},"examples":[{"en":"That ad is full of cheap bajer—nothing really new.","zh":"那个广告全是廉价噱头——其实没什么新东西。"},{"en":"He tried some bajer to impress her, but she didn’t buy it.","zh":"他试着用一些“花言巧语/把戏”去打动她，但她不吃这一套。"}]}],"synonyms":["surname","gimmick","trick","pick-up line","smooth talk"],"phonetic":"/ˈbaɪər/","extraExplanation":["“Bajer”在英语里通常不是常见词汇：如果你是在英文环境中看到它，最常见的情况是人名（姓氏）。","如果你是在波兰语或受波兰语影响的语境里看到“bajer”，它可指“噱头/花招”，也可指用来撩人或说服人的“话术”。","容易与英语单词混淆：badger（獾；纠缠）、buyer（买家）、Bayer（拜耳，品牌/姓氏）。可以结合上下文判断。"]}
{"word":"bajillion","summary":{"en":"A humorous, informal word meaning “an extremely large number.”","zh":"一个幽默的非正式说法，表示“极其庞大的数量”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An informal, humorous way to say “a very large (often unknown) number.” It is not an exact number.","zh":"（非正式、幽默）表示“非常非常多、数不清的一大堆”。不是精确数字。"},"examples":[{"en":"I’ve told you a bajillion times to lock the door.","zh":"我已经跟你说过无数次要锁门了。"},{"en":"There were a bajillion things to do before the trip.","zh":"旅行前有一大堆事情要做。"},{"en":"That app has a bajillion users now.","zh":"那个应用现在有超级多的用户。"}]}],"synonyms":["zillion","gazillion","a ton (of)","countless","a million (informal)"],"phonetic":"/bəˈdʒɪljən/","extraExplanation":["“bajillion”是英语里常见的夸张说法（hyperbole），用来强调“多到不可思议”，语气轻松、带点抱怨或搞笑。","它模仿真实数字词（如 million, billion, trillion）的构词方式：在“billion”前加上虚构的“baj-”，表示“随便一个巨大的数字”。在正式写作、学术或商务场合不建议使用。","常见搭配：a bajillion + plural noun（a bajillion emails）；bajillion times（无数次）；bajillions of + noun（bajillions of reasons）。"]}
{"word":"bajito","summary":{"en":"“Bajito” means “short/little” or “quiet/low (in volume)” in Spanish, often with an affectionate or gentle tone.","zh":"“bajito”是西语，常表示“矮矮的/小个子的”或“轻声的/音量低的”，语气多较亲切柔和。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Spanish; diminutive of \"bajo\") short or little; low in height or level (often said in a gentle/affectionate way).","zh":"（西语；“bajo”的指小/昵称形式）矮矮的、小个子的；低低的（常带亲切、柔和的语气）。"},"examples":[{"en":"El niño es bajito para su edad.","zh":"这个男孩就年龄来说有点矮。"},{"en":"Pon la mesa más bajita, por favor.","zh":"请把桌子放低一点/矮一点。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Spanish) quiet/low (in volume), spoken or played softly.","zh":"（西语）声音小的、低声的；（音乐/说话）轻轻地。"},"examples":[{"en":"Habla bajito; el bebé está durmiendo.","zh":"小声点说；宝宝在睡觉。"},{"en":"Pon la música bajito.","zh":"把音乐调小声一点。"}]}],"synonyms":["bajo","pequeño","de poca estatura","suave (volumen)","en voz baja"],"phonetic":"/bɑˈhitoʊ/","extraExplanation":["“bajito”是“bajo（低/矮）”的指小词，常见于口语。指小词在西班牙语里不仅表示“更小”，也常带亲昵、委婉或缓和语气（类似中文的“矮矮的/小小的/轻轻地”）。","用在音量时，西语里也很常见“hablar bajito（小声说）”“música bajita（小点声的音乐）”。不少地区会把它当作很自然的口语表达，即使语法上看起来像形容词。"]}
{"word":"bajo","summary":{"en":"Bajo is a Spanish loanword used in English mainly for “bass/low register” in music, and sometimes for a “shoal/sandbank” in nautical contexts.","zh":"Bajo 是从西班牙语借入英语的词，主要表示音乐中的“低音/低音声部”，在航海语境中有时也指“浅滩/沙洲”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Music, from Spanish) the bass part or bass instrument/voice; the low register in music.","zh":"（音乐用语，源自西班牙语）低音声部；低音乐器/低音嗓音；音乐中的低音音域。"},"examples":[{"en":"In the ensemble, the bajo keeps the harmony grounded.","zh":"在合奏中，低音（bajo）让和声更稳定。"},{"en":"The singer moved from alto to bajo for the final verse.","zh":"歌手在最后一段从女低音转到更低的低音（bajo）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Nautical/Geography, from Spanish) a shoal or sandbank in shallow water.","zh":"（航海/地理用语，源自西班牙语）浅滩；沙洲（浅水区的砂质堆积）。"},"examples":[{"en":"The boat slowed down to avoid the bajo near the reef.","zh":"船放慢速度以避开礁石附近的浅滩（bajo）。"},{"en":"Local fishermen know where the bajos form after storms.","zh":"当地渔民知道暴风雨后浅滩（bajo）会在哪里形成。"}]},{"partOfSpeech":"adj.","definition":{"en":"“Lower” or “low,” especially in Spanish place names or phrases used in English contexts.","zh":"“较低的/低处的”，常见于英语语境中借用的西班牙语地名或短语里。"},"examples":[{"en":"They stayed in the bajo part of the valley, where it was warmer.","zh":"他们住在山谷较低（bajo）的地方，那里更暖和。"}]}],"synonyms":["bass","low register","shoal","sandbank","shallows"],"phonetic":"/ˈbɑhoʊ/","extraExplanation":["“bajo”本来是西班牙语常用词，基本意思是“低的、下面的”。英语里它多作为借词出现在两类语境：①音乐（指低音声部/低音乐器）；②航海与地理（在一些拉美/加勒比地区相关资料或航海图中指“浅滩、沙洲”）。","发音在英语里通常把西班牙语字母 j 读成接近 /h/ 的音（而不是英语的 /dʒ/）。"]}
{"word":"bajocco","summary":{"en":"Bajocco is a historical Italian small coin, and by extension it can mean a tiny amount of money.","zh":"Bajocco指意大利（教皇国时期）的旧小额硬币，引申也可表示“很少的一点钱”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A small Italian coin formerly used in the Papal States (plural: bajocchi).","zh":"（历史用语）意大利教皇国旧时使用的一种小额硬币（复数：bajocchi）。"},"examples":[{"en":"In the old records, the fee is listed as ten bajocchi.","zh":"在旧档案里，这笔费用写的是十个bajocchi。"},{"en":"He paid in bajocchi, the kind of small change people used in Rome long ago.","zh":"他用bajocchi付账，那是很久以前罗马人用的零钱。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) A very small amount of money; almost nothing.","zh":"（引申义）很少的一点钱；几乎不值一提的钱。"},"examples":[{"en":"He didn’t earn a bajocco from the deal.","zh":"这笔交易他一点钱都没赚到。"},{"en":"They offered him a bajocco for a week of work.","zh":"他们让他干一周活儿却只给一点点钱。"}]}],"synonyms":["penny","pittance","small change","peanuts","farthing"],"phonetic":"/bəˈdʒɑˌkoʊ/","extraExplanation":["这个词来自意大利语 bajocco（也写作 baiocco）。它原本指教皇国（Papal States）时期的一种小额货币单位，因此在英语里多见于历史写作、旅行记、或带有“旧时风味”的文学语境中。后来也常被借用来夸张地表示“微不足道的一点钱”。"]}
{"word":"bajochi","summary":{"en":"Bajochi are old small coins from the Papal States; it’s the plural of “bajocco.”","zh":"bajochi 指教皇国旧时使用的小面额硬币，是 bajocco 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an old small coin used in the Papal States (central Italy); plural of “bajocco.”","zh":"（历史）教皇国（意大利中部）曾使用的一种小面额硬币；为 bajocco 的复数。"},"examples":[{"en":"In the novel, a loaf of bread costs only a few bajochi.","zh":"小说里，一条面包只要几个 bajochi。"},{"en":"He emptied his pocket and found some old bajochi from his travels in Italy.","zh":"他掏空口袋，发现了几枚旅行意大利时留下的旧 bajochi。"}]}],"synonyms":["bajocco","old coin","Papal States coin"],"phonetic":"/bɑˈjoʊki/","extraExplanation":["“bajochi”更常见的写法是意大利语复数形式，单数是“bajocco”。它属于历史货币词汇，常出现在描写19世纪前后意大利（尤其教皇国）生活的文学或历史语境中。","如果你是在别的语境里看到“bajochi”（例如人名、品牌名、网络用语），也可能不是这个词；可以把原句发我，我能帮你判断。"]}
{"word":"Bajocian","summary":{"en":"Bajocian refers to a Middle Jurassic geologic stage (about 170–168 million years ago) and things from that time.","zh":"Bajocian（巴柔阶）指中侏罗世的一个地质时代（约1.70亿—1.68亿年前），也可指该时期的地层或相关事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Geology) A stage (age) of the Middle Jurassic period, about 170–168 million years ago, used to date rocks and fossils.","zh":"（地质）中侏罗世的一个地质时代（阶），约为1.70亿—1.68亿年前，用于给岩石与化石定年与对比。"},"examples":[{"en":"These ammonite fossils are typical of the Bajocian stage.","zh":"这些菊石化石是巴柔阶（Bajocian）的典型代表。"},{"en":"The limestone was deposited during the Bajocian, when shallow seas covered the area.","zh":"这片石灰岩形成于巴柔阶，当时浅海覆盖了该地区。"}]},{"partOfSpeech":"n.","definition":{"en":"The Bajocian stage itself (a unit of geologic time) or rocks formed during that time.","zh":"巴柔阶这一地质时间单位本身，或指形成于该时期的岩层/地层。"},"examples":[{"en":"The report focuses on the Bajocian of western Europe.","zh":"这份报告重点研究西欧的巴柔阶地层。"},{"en":"A boundary marker helps geologists identify the start of the Bajocian.","zh":"一个界线标志帮助地质学家识别巴柔阶的开始。"}]}],"synonyms":["Middle Jurassic stage","geologic stage","Jurassic age"],"phonetic":"/bəˈdʒoʊʃiən/","extraExplanation":["“Bajocian”源自法国诺曼底城市Bayeux的拉丁名（Baiocae / Bajocae），因此在地质学文献中常见于欧洲侏罗纪地层研究。","它主要用于地层学与古生物学语境，日常英语中很少出现；常与“Middle Jurassic（中侏罗世）”“stage/age（阶/期）”“ammonite（菊石）”等词一起出现。"]}
{"word":"bajocian","summary":{"en":"Bajocian refers to a Middle Jurassic geologic stage (about 170–168 million years ago).","zh":"Bajocian 指中侏罗世的一个地质阶段——巴柔期（约1.70亿—1.68亿年前）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Geology) relating to the Bajocian Age, a stage of the Middle Jurassic period (about 170–168 million years ago).","zh":"（地质）与巴柔期（Bajocian）有关的；巴柔期是中侏罗世的一个地质时期（约1.70亿—1.68亿年前）。"},"examples":[{"en":"These limestone layers contain Bajocian ammonite fossils.","zh":"这些石灰岩层含有巴柔期的菊石化石。"},{"en":"The report describes Bajocian marine environments in western Europe.","zh":"报告描述了西欧地区巴柔期的海洋环境。"}]},{"partOfSpeech":"n.","definition":{"en":"(Geology) the Bajocian Age itself; the time interval in the Middle Jurassic known as the Bajocian.","zh":"（地质）巴柔期本身；指中侏罗世中称为“巴柔期”的那段时间。"},"examples":[{"en":"The fossil record here is especially rich in the Bajocian.","zh":"这里的化石记录在巴柔期尤为丰富。"},{"en":"This species first appears in the early Bajocian.","zh":"这种物种最早出现在巴柔期早期。"}]}],"synonyms":["Middle Jurassic stage","Jurassic (context-dependent)"],"phonetic":"/bəˈdʒoʊʃən/","extraExplanation":["“Bajocian”这个名称来自法国诺曼底城市巴约（Bayeux）的拉丁名相关形式（Bajocae）。地质年代命名中常用欧洲地名来指代最早研究或典型地层所在地。"]}
{"word":"bajoire","summary":{"en":"“bajoire” is not a recognized English word; it’s likely a misspelling or from another language.","zh":"“bajoire”不是常见的英语词，可能是拼写错误或外来词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. “bajoire” does not appear in major English dictionaries and is most likely a misspelling or a word from another language.","zh":"不是标准英语单词。“bajoire”在主流英语词典中通常查不到，更可能是拼写错误或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “bajoire” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里查不到“bajoire”——你能把看到它的句子发我吗？"},{"en":"Maybe “bajoire” is a misspelling; the correct word depends on the context.","zh":"“bajoire”可能是拼错了；具体正确单词要看上下文。"}]}],"extraExplanation":["你可能想写的是下面这些比较常见、且拼写接近的词之一（但需要你提供上下文才能确定）：\n1) boudoir（/ˈbuːdwɑr/）：（尤指旧式住宅中的）女士更衣室/闺房，也可指私密的卧室场景。\n2) abjure（/æbˈdʒʊr/）：正式用语，表示“公开放弃（信仰/主张/权利）”。\n3) bazaar（/bəˈzɑr/）：集市、市场（尤其指中东/南亚风格的市集）。\n把你看到“bajoire”的句子或截图发来，我可以帮你精准判断是哪一个。"]}
{"word":"bajonado","summary":{"en":"“Bajonado” is Spanish/Spanglish slang meaning feeling very down or low-energy (sometimes a comedown).","zh":"“Bajonado”是西语/Spanglish 俚语，表示很低落、没劲（有时指兴奋或饮酒/药物后的低潮）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Spanglish/Spanish slang, mainly Latin American) Feeling very down, low-energy, or discouraged; having a “comedown” after excitement or after drinking/drugs.","zh":"（西语/Spanglish 俚语，常见于拉美）情绪很低落、提不起劲、很丧；也可指兴奋/饮酒或药物之后的“下坠感/低潮期”。"},"examples":[{"en":"After the party, I woke up super bajonado and didn’t want to talk to anyone.","zh":"派对之后我醒来特别 bajonado，谁都不想理。"},{"en":"He got bajonado when he didn’t get the job offer.","zh":"他没拿到工作 offer 后就很 bajonado。"},{"en":"Don’t take it personally—she’s just bajonado today.","zh":"别往心里去——她今天只是有点 bajonado。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who is feeling down or discouraged (used informally).","zh":"（口语）情绪低落的人、很丧的人。"},"examples":[{"en":"I’ve been a bajonado all week, but I’m trying to cheer up.","zh":"我这周一直很 bajonado，但我在努力打起精神。"}]}],"synonyms":["down","bummed out","low","discouraged","having a comedown"],"phonetic":"/ˌbɑː.hoʊˈnɑː.doʊ/","extraExplanation":["“bajonado”来自西语动词/概念“bajar”（下降）与名词“bajón”（情绪或状态的下滑、低潮）。在不同国家用法和语气会有差异：有些地方更偏“心情低落/没劲”，有些地方也会指“宿醉或嗨完后的低潮”。","英语里更常用的近似表达包括：down, bummed out, depressed（更严重/临床含义要谨慎）, having a comedown。"]}
{"word":"BAJour","summary":{"en":"“Bonjour” is a French way to say “hello/good day,” sometimes borrowed in English.","zh":"“Bonjour”是法语的“你好/日安”，英语中也常借用来打招呼。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"a French greeting meaning “hello” or “good day,” sometimes used in English to sound friendly or playful","zh":"法语问候语，意为“你好 / 日安”；在英语中也会被借用来显得友好或带点俏皮"},"examples":[{"en":"Bonjour! Welcome to the café.","zh":"Bonjour！欢迎来到咖啡馆。"},{"en":"He greeted everyone with a cheerful “bonjour.”","zh":"他用一句欢快的“bonjour”向大家打招呼。"}]}],"synonyms":["hello","hi","good day"],"phonetic":"/ˌbɔːnˈʒʊr/","extraExplanation":["“Bonjour”是法语里最常见的日间招呼语之一（大致等于英语的 “Hello/Good morning/Good afternoon”），通常在白天使用；晚上更常说“Bonsoir”。","你输入的“BAJour”很可能是在写“Bonjour”的变体或拼写误差：标准拼写是 B-o-n-j-o-u-r。"]}
{"word":"bajra","summary":{"en":"Bajra means pearl millet, a common grain in South Asia used for flour and flatbreads.","zh":"bajra 指珍珠粟（常见于南亚），常磨粉做烤饼等主食。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English) Pearl millet, a hardy cereal grain grown especially in India and parts of Africa, often ground into flour for flatbreads.","zh":"（南亚英语）珍珠粟／小米的一种（印度常称“bajra/बाजरा”），耐旱的谷物，常磨成粉做饼等主食。"},"examples":[{"en":"In Rajasthan, many families eat bajra roti during winter.","zh":"在拉贾斯坦邦，很多家庭冬天会吃bajra烤饼（bajra roti）。"},{"en":"The farmer planted bajra because it can grow well with little rain.","zh":"农民种bajra，因为它在少雨条件下也能长得很好。"},{"en":"This porridge is made from roasted bajra flour.","zh":"这碗粥是用烘烤过的bajra粉做的。"}]}],"synonyms":["pearl millet","millet"],"phonetic":"/ˈbɑːdʒrə/","extraExplanation":["“Bajra”是印地语/多种印度语言里的常用词，英文里多出现在印度饮食与农业语境中。常见搭配有：bajra roti（珍珠粟薄饼）、bajra flour（珍珠粟粉）、bajra khichdi（珍珠粟杂烩粥/饭）。","在健康与饮食话题里，bajra常被提到是“无麸质（gluten-free）”的谷物之一；但是否适合个人饮食仍要看具体需求与加工方式。","文学/文化上，bajra常与印度干旱地区（如拉贾斯坦、古吉拉特）冬季饮食、乡村生活与耐旱农作联系在一起，带有朴素、家常的文化意象。"]}
{"word":"Bajrangbali","summary":{"en":"Bajrangbali is a widely used devotional name for Hanuman, highlighting his great strength and protective power.","zh":"Bajrangbali 是对哈努曼的常用敬称，强调他的强大力量与护佑之力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Hinduism) A devotional name/title for Hanuman, the monkey-god known for strength, courage, and loyal service to Lord Rama.","zh":"（印度教）哈努曼（猴神）的敬称/称号之一，以力量、勇气以及对罗摩（Rama）的忠诚著称。"},"examples":[{"en":"Many devotees chant “Jai Bajrangbali” to seek protection and courage.","zh":"许多信众会念“Jai Bajrangbali”（胜利归于巴金格巴利）来祈求护佑与勇气。"},{"en":"In the Ramayana, Bajrangbali helps Rama rescue Sita from Lanka.","zh":"在《罗摩衍那》中，Bajrangbali（哈努曼）帮助罗摩从楞伽救出悉多。"}]}],"synonyms":["Hanuman","Maruti","Anjaneya","Pavanputra"],"phonetic":"/bəˈdʒrʌŋɡbɑːli/","extraExplanation":["“Bajrangbali”常见于北印度语境，是对哈努曼的亲切敬称：bajrang（常解释为“像金刚/雷霆般坚硬、强壮”）+ bali（“强者、勇士”）。因此这个称呼强调哈努曼的力量与护法属性。","常见呼喊“Jai Bajrangbali!”属于宗教/民间敬语，类似“向某神明致敬、祈愿得胜与护佑”。在英语语境中通常保留原词拼写，用作专有名词。"]}
{"word":"bajree","summary":{"en":"Bajree means pearl millet (a grain) in South Asian English.","zh":"bajree 指“珍珠粟/珍珠小米”（一种谷物），多见于南亚英语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English) Pearl millet; the grain and plant used for flour and flatbreads, especially in India and Pakistan.","zh":"（南亚英语）珍珠粟/珍珠小米（bajra/bajri）；一种常用来磨粉做饼的谷物及其作物，常见于印度和巴基斯坦。"},"examples":[{"en":"In winter, many families eat bajree roti with vegetables.","zh":"冬天，很多家庭会吃珍珠粟饼（bajree roti）配蔬菜。"},{"en":"This flour is made from bajree and has a nutty taste.","zh":"这种面粉是用珍珠粟（bajree）做的，带点坚果香。"}]}],"synonyms":["pearl millet","bajra","bajri","millet"],"phonetic":"/ˈbɑːdʒri/","extraExplanation":["“bajree”常见于南亚英语写法，也常拼作“bajri”或“bajra”。在印度西部（如马哈拉施特拉、古吉拉特、拉贾斯坦）很常见，因耐旱、适合在较贫瘠土地种植而重要。","常见搭配：bajree roti（珍珠粟饼/杂粮饼）、bajree flour（珍珠粟粉）。在正式或国际语境中，更常用“pearl millet”来说明。"]}
{"word":"bajri","summary":{"en":"Bajri means pearl millet, a common grain used in South Asian cooking.","zh":"Bajri 指珍珠小米（珍珠黍），是南亚饮食中常见的谷物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Pearl millet; the small, round grain of the pearl millet plant, widely eaten in parts of India and neighboring regions.","zh":"珍珠小米（亦称“珍珠黍”）；一种小而圆的杂粮，在印度及周边地区很常见、常食用。"},"examples":[{"en":"In winter, many families cook bajri porridge to stay warm.","zh":"冬天，很多家庭会煮 bajri 粥来暖身。"},{"en":"She made bajri roti and served it with yogurt and vegetables.","zh":"她做了 bajri 烙饼（roti），配酸奶和蔬菜一起吃。"},{"en":"Bajri is gluten-free and often used as a wheat alternative.","zh":"Bajri 不含麸质，常被用作小麦的替代选择。"}]}],"synonyms":["pearl millet","millet","bajra"],"phonetic":"/ˈbɑːdʒri/","extraExplanation":["“bajri”多见于英语里对南亚食材的借用表达，尤其在印度菜语境中。更常见的拼写是“bajra”，两者通常指同一种谷物——pearl millet。","在饮食文化中，bajri 常被磨成粉做 roti（饼）、bhakri（较厚的饼，常见于马哈拉施特拉等地），或煮成粥；也常被认为较“耐寒/耐旱”的作物。"]}
{"word":"bajulate","summary":{"en":"“Bajulate” is a rare, old-fashioned verb meaning to carry or bear a burden.","zh":"“bajulate”是一个很罕见的古语动词，意思是“负重/承担重担”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to carry or bear a load; to act as a porter (very rare/archaic)","zh":"负重；像搬运工一样搬运（非常少见/古语）"},"examples":[{"en":"In older texts, “bajulate” can mean to carry a heavy burden for someone else.","zh":"在较早的文本里，“bajulate”可表示替他人负担沉重的负荷。"},{"en":"He seemed born to bajulate other people’s problems at work.","zh":"他似乎天生就要在工作中替别人扛下各种麻烦。"}]}],"synonyms":["carry","bear","shoulder","lug","transport"],"phonetic":"/ˈbædʒəˌleɪt/","extraExplanation":["“bajulate”源自拉丁语 bajulus，意为“搬运工/挑夫/抬担者”。因此它带有“肩挑背扛、替人承受”的画面感。","这个词在现代英语里几乎不使用，更常见的替代表达是 carry, bear, shoulder (a burden), lug。"]}
{"word":"bajury","summary":{"en":"“Bajury” is not a standard English word; you likely mean “jury,” a group that decides a court case or judges a competition.","zh":"“bajury”不是标准英语单词；你可能想写的是“jury”，指法庭的陪审团或比赛的评审团。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of people chosen to listen to evidence in a court and decide whether someone is guilty or not (or to decide on damages in a civil case).","zh":"（法庭中的）陪审团：被选出来在法庭上听取证据，并决定被告是否有罪（或在民事案件中决定赔偿金额）的一组人。"},"examples":[{"en":"The jury found him guilty.","zh":"陪审团裁定他有罪。"},{"en":"The judge gave instructions to the jury before deliberations.","zh":"法官在陪审团评议前给了他们指示。"},{"en":"She served on a jury last year.","zh":"她去年担任过陪审员。"}]},{"partOfSpeech":"n.","definition":{"en":"A committee that judges a competition and chooses winners.","zh":"（比赛/评选的）评审团：负责评判并选出获胜者的委员会。"},"examples":[{"en":"A jury will select the best photo.","zh":"评审团将选出最佳照片。"},{"en":"The jury awarded first prize to a young composer.","zh":"评审团把一等奖颁给了一位年轻作曲家。"}]}],"synonyms":["panel","committee","jurors"],"phonetic":"ˈdʒʊri","extraExplanation":["“bajury”不是常见英语单词，最可能是把“jury”（陪审团）拼错了，或者是输入时多打了字母。你如果想表达“陪审团/评审团”，标准拼写是 jury。"]}

