{"word":"Bak","summary":{"en":"“bak” most commonly refers to a “.bak” backup file in computing; it can also be a nonstandard texting form of “back.”","zh":"“bak”最常见指计算机中的“.bak”备份文件；也可作“back”的非正式短信拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(computing) A backup copy of a file, often shown with the filename extension “.bak”.","zh":"（计算机）备份文件；常见于文件扩展名“.bak”，表示原文件的备份副本。"},"examples":[{"en":"I found a .bak file next to the document—it's probably an older backup.","zh":"我在文档旁边发现了一个.bak文件——它可能是较旧的备份。"},{"en":"Before editing the settings, make a backup so you can restore it if something goes wrong.","zh":"修改设置前先做个备份，这样出问题时可以还原。"}]},{"partOfSpeech":"other","definition":{"en":"An informal spelling/short form people sometimes use for “back,” especially in texting or usernames (not standard in formal writing).","zh":"“back”的非正式拼写/简写；有时用于短信、网名等（正式写作中不标准）。"},"examples":[{"en":"I’ll be bak in 5 minutes.","zh":"我5分钟后就回来（bak）。"},{"en":"Text me when you’re bak home.","zh":"你到家后（bak）给我发消息。"}]}],"synonyms":["backup (file)","copy","saved version"],"phonetic":"/bæk/","extraExplanation":["“.bak”文件在Windows和一些软件里很常见：程序为了防止误删或误改，会自动把旧版本另存为同名的“.bak”。通常可以通过重命名（去掉.bak并恢复原扩展名）来尝试还原，但不保证所有.bak都能直接打开。"]}
{"word":"baka","summary":{"en":"“Baka” is a Japanese slang insult meaning “idiot/fool,” often used in anime/manga contexts in English.","zh":"“Baka”是源自日语的俚语骂人词，意为“笨蛋/傻瓜”，在英语里多见于动漫语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, from Japanese) An insulting word meaning “idiot,” “fool,” or “stupid person,” often used in anime/manga fandom.","zh":"（俚语，源自日语）侮辱性用语，意为“笨蛋/傻瓜/蠢人”，常见于动漫圈用语。"},"examples":[{"en":"He keeps calling his friend “baka” as a joke, like saying “you idiot.”","zh":"他一直开玩笑叫朋友“baka”，就像说“你这个笨蛋”。"},{"en":"Some subtitles translate “baka!” as “Idiot!” or “Stupid!”","zh":"一些字幕把“baka!”翻译成“笨蛋！”或“蠢货！”"}]},{"partOfSpeech":"int.","definition":{"en":"Used as an exclamation/insult meaning “Idiot!” “Dummy!” or “You’re so stupid!”","zh":"用作感叹/骂人话，表示“笨蛋！”“傻瓜！”或“你真蠢！”"},"examples":[{"en":"“Baka!” she shouted, then walked away.","zh":"“笨蛋！”她喊了一声，然后转身走开。"},{"en":"In some romantic-comedy anime, “baka” can sound teasing rather than truly angry.","zh":"在一些恋爱喜剧动漫里，“baka”听起来更像撒娇式的吐槽，而不一定是真生气。"}]}],"synonyms":["idiot","fool","dummy","moron","stupid"],"phonetic":"/ˈbɑkə/","extraExplanation":["“ばか（馬鹿）”是日语常见的骂人词，语气从“傻瓜”到更强的侮辱都有，取决于关系、语调和场合。现实生活中对不熟的人使用可能很不礼貌。","在英语语境里，“baka”多出现在动漫/二次元社群，常带“引用台词/玩梗”的感觉；但在非圈内或正式场合，用英语的“idiot/fool”更自然。","常见相关表达：\"baka yarō\"（更粗鲁，类似“蠢货/混蛋”）","文学/流行文化提示：它在英文里主要属于流行文化借词（anime/manga），不属于标准正式英语词汇。"]}
{"word":"Bakairi","summary":{"en":"Bakairi refers to an Indigenous people of central Brazil and also to their traditional language.","zh":"Bakairi 指巴西中部的一个原住民族群，也可指他们的传统语言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Native American (Indigenous) people of central Brazil, mainly in the state of Mato Grosso","zh":"巴卡伊里人：巴西中部（主要在马托格罗索州）的一个原住民族群"},"examples":[{"en":"The Bakairi are one of several Indigenous peoples living in Mato Grosso, Brazil.","zh":"巴卡伊里人是居住在巴西马托格罗索州的多个原住民族群之一。"},{"en":"Some Bakairi communities work to protect their land and cultural traditions.","zh":"一些巴卡伊里社区致力于保护土地与文化传统。"}]},{"partOfSpeech":"n.","definition":{"en":"the language traditionally spoken by the Bakairi people","zh":"巴卡伊里语：巴卡伊里人传统使用的语言"},"examples":[{"en":"Linguists have documented parts of the Bakairi language to help preserve it.","zh":"语言学家记录了巴卡伊里语的部分内容，以帮助保存这门语言。"},{"en":"Young people may speak Portuguese at school and Bakairi at home.","zh":"年轻人可能在学校说葡萄牙语，在家里说巴卡伊里语。"}]}],"synonyms":["Bakairí","(related) Indigenous peoples of Brazil","(related) Cariban languages (classification context)"],"phonetic":"ˌbɑːkaɪˈriː","extraExplanation":["“Bakairi”有时也写作“Bakairí”（带重音符号），不同拼写常见于不同学术或出版传统。","这是一个专有名词（民族名/语言名）。在英语写作中通常首字母大写：Bakairi。"]}
{"word":"bakairi","summary":{"en":"“bakairi” isn’t an English dictionary word; it’s probably a misspelling or a romanized foreign term/name.","zh":"“bakairi”不是英语词典词汇；更可能是拼写错误或外语/人名的罗马字写法。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. “bakairi” is likely a misspelling, a username/proper name, or a romanization from another language (often Japanese).","zh":"不是标准英语单词。“bakairi”很可能是拼写错误、用户名/专有名词，或来自其他语言的罗马字（常见为日语）。"},"examples":[{"en":"I couldn’t find “bakairi” in an English dictionary—did you mean “bakery” or “bizarre”?","zh":"我在英语词典里找不到“bakairi”——你是不是想写“bakery（面包店）”或“bizarre（古怪的）”？"},{"en":"If “Bakairi” is a person’s name, please share the context so I can help explain it.","zh":"如果“Bakairi”是人名，请提供上下文，我就能更准确地解释。"}]}],"phonetic":"/ˌbɑːkɑːˈiːri/","extraExplanation":["“bakairi”看起来像日语罗马字：其中“baka”常被理解为“笨蛋/傻瓜”（带有冒犯性，使用要谨慎），但“bakairi”本身并不是一个常见、固定的英语或日语词条。若你能提供一句原文或来源（歌曲/动漫/社交媒体/游戏等），我可以帮你判断它到底指什么。"]}
{"word":"bakal","summary":{"en":"“Bakal” is an Indonesian/Malay word commonly meaning “will/going to,” and it can also mean “prospective/to-be” or “seed/basic material.”","zh":"“bakal”是印尼语/马来语常用词，常表示“将要/打算”，也可表示“未来的/准……的”或“种子/基础原料”。"},"definitions":[{"partOfSpeech":"aux.","definition":{"en":"(Indonesian/Malay, informal) used like “will / going to” to talk about a future plan or expectation.","zh":"（印尼语/马来语，口语）相当于“将要/打算”，用于表达将来的计划或预期。"},"examples":[{"en":"In Indonesian, “Saya bakal pergi besok” means “I’m going tomorrow.”","zh":"在印尼语里，“Saya bakal pergi besok”的意思是“我明天要去/我明天会去”。"},{"en":"“Bakal” often sounds more casual than the standard “akan.”","zh":"“bakal”通常比较口语，比更标准的“akan”更随意。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Indonesian/Malay) prospective; future; “to-be” (used before a noun).","zh":"（印尼语/马来语）未来的；准……的（放在名词前）。"},"examples":[{"en":"In Malay, “bakal suami” means “husband-to-be.”","zh":"在马来语里，“bakal suami”意思是“准丈夫/未婚夫”。"},{"en":"“bakal doktor” can mean “a future doctor.”","zh":"“bakal doktor”可以表示“未来的医生/准医生”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Indonesian/Malay) a seed/germ; or basic material/starting stock for making something.","zh":"（印尼语/马来语）种子/萌芽；也可指制作某物的原料/基础材料。"},"examples":[{"en":"In Indonesian, “bakal” can refer to the seed of an idea (the beginning of something).","zh":"在印尼语里，“bakal”可以指“想法的种子/开端”。"},{"en":"It may also mean the basic materials needed before work can start.","zh":"它也可指开始工作前需要准备的基础原料。"}]}],"synonyms":["(future marker) will","(future marker) going to","(formal Indonesian) akan","(prospective) future","(prospective) to-be"],"phonetic":"/bɑˈkɑl/","extraExplanation":["“bakal”不是标准英语单词，主要见于印尼语和马来语语境。若你在英文聊天或社媒中看到，通常是说话者夹用印尼语/马来语，或在讨论相关文化与语言。","在印尼语里，正式写作更常用“akan”表示“将要”；“bakal”更口语，也可能带一点“很可能会”的语气。"]}
{"word":"Bakalai","summary":{"en":"Bakalai usually refers to an ethnic group in Central Africa and sometimes to their associated language.","zh":"Bakalai 通常指中非的巴卡莱族群，有时也指其相关语言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Bantu ethnic group in Central Africa (mainly in Gabon and nearby areas).","zh":"（巴卡莱人）中非的一个班图族群，主要分布在加蓬及周边地区。"},"examples":[{"en":"The Bakalai are one of the many ethnic groups in Gabon.","zh":"巴卡莱人是加蓬众多族群之一。"},{"en":"Some cultural studies in Central Africa mention the Bakalai in discussions of local communities.","zh":"一些关于中非的文化研究在讨论地方社群时会提到巴卡莱人。"}]},{"partOfSpeech":"n.","definition":{"en":"the language associated with the Bakalai people (usage depends on the source; it may appear as a regional language name).","zh":"（巴卡莱语）与巴卡莱族群相关的语言名称（不同资料用法可能不一，常作为地区语言名出现）。"},"examples":[{"en":"The report lists Bakalai among several local languages spoken in the region.","zh":"报告将巴卡莱语列为该地区使用的几种地方语言之一。"}]}],"phonetic":"/ˌbɑːkəˈlaɪ/","extraExplanation":["“Bakalai”通常作为专有名词使用，首字母大写；在学术或地理资料中更常见。","由于非洲族群与语言名称在不同文献里可能存在不同拼写或分类方式，查阅时可同时搜索相近拼写（例如不同的转写形式）以获得更完整的信息。"]}
{"word":"bakalai","summary":{"en":"“bakalai” isn’t recognized as a standard English word; please provide context or the intended spelling.","zh":"“bakalai”不是标准英语词；请提供语境或你想要的正确拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a transliteration from another language, or a proper name.","zh":"不是标准英语单词。可能是拼写错误、其他语言的音译，或人名/地名。"},"examples":[{"en":"I couldn’t find “bakalai” in an English dictionary—could you share a sentence where you saw it?","zh":"我在英语词典里找不到“bakalai”，你能给我它出现的句子吗？"},{"en":"Is it a name, a brand, or a word from another language?","zh":"它是名字、品牌，还是其他语言的词？"}]}],"extraExplanation":["“bakalai”看起来更像是音译/拼写变体。常见的情况包括：\n1) 你想查的是发音相近的英语词（例如：*bacalao* 西语“鳕鱼”、*baklava* “巴克拉瓦甜点”、或人名/地名）。\n2) 来自某种语言的词（例如南亚/东欧/非洲语言的罗马字拼写）。\n\n为了准确解释：请告诉我它的来源（在哪看到的、是什么语境），或给我你想表达的中文意思/发音，我可以帮你定位最可能的正确词。"]}
{"word":"Bakalei","summary":{"en":"“Bakalei” is usually a proper name, not a common English word; meaning depends on context.","zh":"“Bakalei”通常是专有名称而非常见英语单词；含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Bakalei: not a standard English vocabulary word; most often it is used as a proper name (a person’s name, username, brand name, or place name), so its meaning depends on the specific context.","zh":"Bakalei：不是标准英语词汇；更常见的是作为专有名称（人名、用户名、品牌名或地名）使用，因此含义取决于具体语境。"},"examples":[{"en":"I saw the name “Bakalei” in a game chat, but I don’t know what it refers to.","zh":"我在游戏聊天里看到了“Bakalei”这个名字，但不知道它指什么。"},{"en":"Bakalei is the artist name they use online.","zh":"Bakalei 是他们在网上使用的艺名。"}]}],"phonetic":"ˌbækəˈleɪ","extraExplanation":["“Bakalei”在常见英英词典里并不是固定词条，所以很可能是：①音译/外来语（来自其他语言）；②人名或姓氏；③自创词或网名。","如果你能提供它出现的句子、来源（歌曲/小说/游戏/社交媒体）或语言背景，我可以更准确地判断它的含义、可能的词源，以及是否对应某个已知词或拼写变体。"]}
{"word":"bakalei","summary":{"en":"“bakalei” is not a common English word; it is likely a name or transliteration and needs context to interpret.","zh":"“bakalei”不是常见英语词；多半是名字或音译，需要上下文才能判断含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a personal name, a brand/user name, or a transliteration from another language. In English dictionaries, it usually does not have an established meaning.","zh":"不是标准英语词；更可能是人名、品牌/用户名，或其他语言的音译。在英语词典中通常没有固定释义。"},"examples":[{"en":"I couldn’t find a dictionary definition for “bakalei”; it may be a name or a spelling variant.","zh":"我查不到“bakalei”的词典释义；它可能是名字或拼写变体。"},{"en":"If you tell me the context (a sentence, a song, a product), I can help figure out what “bakalei” refers to.","zh":"如果你给我上下文（句子、歌曲、产品等），我可以帮你判断“bakalei”指什么。"}]}],"phonetic":"/ˌbɑːkəˈleɪ/","extraExplanation":["“bakalei”看起来像音译/拼写变体：有时人们其实想写的是 **Bakelite**（一种早期塑料，/ˈbeɪkəˌlaɪt/）或其他相近拼写（例如姓氏、地名、网络ID）。如果你把它出现的完整句子贴出来，我可以更准确地给出含义、用法和可能的正确拼写。"]}
{"word":"Bakatan","summary":{"en":"“Bakatan” is not recognized as a common English word; it’s likely a name, a misspelling, or a non-English term.","zh":"“Bakatan”不是常见英语词；更可能是人名/地名、拼写错误或非英语词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name (proper noun), or a word from another language.","zh":"不是标准英语单词。可能是拼写错误、专有名词（人名/地名/品牌），或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “Bakatan” in an English dictionary—do you mean a person’s name or a place?","zh":"我在英文词典里找不到“Bakatan”——你是指人名还是地名吗？"},{"en":"If you share the sentence where you saw “Bakatan,” I can explain what it likely means.","zh":"如果你把看到“Bakatan”的句子发给我，我可以更准确地判断它的意思。"}]}],"phonetic":"/ˈbɑːkɑːtɑːn/","extraExplanation":["“Bakatan”看起来更像专有名词或外来语的音译/拼写变体，而不是常见英语词汇。","如果你想查的是某种俚语或某个语言（例如菲律宾语、日语等）里的词，请告诉我：它出现的完整句子、语言/地区、以及你想表达的意思（例如骂人、夸奖、地名、人名等）。我就能给出更可靠的释义与用法。"]}
{"word":"bakatan","summary":{"en":"“Bakatan” is internet slang from Japanese meaning a cute, teasing “silly/idiot,” often used as a nickname or username.","zh":"“Bakatan”是源自日语的网络用语，带可爱调侃意味的“笨蛋/傻瓜”，常用作昵称或网名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Internet slang, from Japanese) A teasing nickname meaning “silly/idiot (but kind of cute),” formed from baka (“idiot; silly”) + -tan (a cutesy version of the honorific -chan).","zh":"（网络俚语，源自日语）带调侃但偏可爱的称呼，意思接近“笨蛋/傻瓜（但有点萌）”，由 baka（笨蛋；傻）+ -tan（-chan 的撒娇/卖萌变体）组成。"},"examples":[{"en":"Stop it, bakatan—you forgot your keys again.","zh":"别闹了，bakatan——你又忘带钥匙了。"},{"en":"Fans call the character “bakatan” as a cute, teasing nickname.","zh":"粉丝用“bakatan”来称呼这个角色，带点可爱又调侃的味道。"}]},{"partOfSpeech":"n.","definition":{"en":"A username, nickname, or character label used in anime/gaming communities; meaning depends on the person using it.","zh":"在二次元/游戏圈里常见的网名、昵称或角色称呼；具体含义取决于使用者。"},"examples":[{"en":"Bakatan is my handle on Discord.","zh":"Bakatan 是我在 Discord 上的用户名。"}]}],"synonyms":["baka","silly","dummy (informal)","goofball (informal)"],"phonetic":"ˈbɑːkəˌtɑːn","extraExplanation":["“bakatan”不是标准英语词典里的常用词，更像是日语梗在英文语境中的借用。使用时要注意场合与关系亲疏：对陌生人说可能显得不礼貌。","-tan 带有更“幼/萌/撒娇”的语感，常见于粉丝文化或角色称呼；如果你只是想表达“笨蛋”，更常见的日语借词是 “baka”。"]}
{"word":"Bake","summary":{"en":"Bake means to cook food with dry heat (usually in an oven).","zh":"Bake 指用干热（通常在烤箱中）烘烤食物。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to cook food with dry heat, usually in an oven","zh":"（通常用烤箱）烘烤；烤制"},"examples":[{"en":"I’m going to bake some cookies tonight.","zh":"我今晚要烤一些饼干。"},{"en":"Bake the potatoes at 400°F (200°C) for about an hour.","zh":"把土豆用400°F（200°C）烤大约一小时。"},{"en":"She baked a cake for her friend’s birthday.","zh":"她为朋友的生日烤了一个蛋糕。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become baked (to be cooked by dry heat)","zh":"被烘烤；烤熟"},"examples":[{"en":"The bread is baking in the oven.","zh":"面包正在烤箱里烤着。"},{"en":"Let the casserole bake for 30 minutes.","zh":"让砂锅菜烤30分钟。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of baking; a batch of baked food (especially bread)","zh":"烘烤过程；（尤指面包的）一炉/一批烘焙品"},"examples":[{"en":"The bakery does two bakes a day.","zh":"那家面包店一天烤两炉。"},{"en":"This bake needs about 25 minutes.","zh":"这次烘烤需要大约25分钟。"}]}],"synonyms":["roast","cook","oven-bake","broil (US, different method)","toast (for bread)"],"phonetic":"/beɪk/","extraExplanation":["“bake”强调用“干热”烹饪，常见于烤箱；与“boil（煮）/steam（蒸）”不同，也和“fry（煎炸）”的用油方式不同。","日常口语里，“baked”也可形容“晒得很热/热得发烫”（如：The sun baked the sidewalk. 太阳把人行道晒得发烫）。"]}
{"word":"bake","summary":{"en":"Bake means to cook with dry heat (usually in an oven), and it can also mean to harden or become very hot from heat.","zh":"Bake 指用干热（通常在烤箱里）烘烤；也可指因热而变硬/定型，或热得难受。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to cook food using dry heat in an oven (or similar heat source), especially bread, cakes, and cookies","zh":"（用烤箱等）以干热方式烘烤食物，尤指面包、蛋糕、饼干等"},"examples":[{"en":"I’m going to bake a cake for her birthday.","zh":"我打算为她的生日烤一个蛋糕。"},{"en":"Bake the cookies for 10–12 minutes.","zh":"把饼干烤10到12分钟。"},{"en":"He baked fresh bread every weekend.","zh":"他每个周末都会烤新鲜面包。"}]},{"partOfSpeech":"v.","definition":{"en":"to become hard, dry, or fixed because of heat or long exposure (often used for clay, paint, or the sun)","zh":"因受热或长时间暴露而变硬、变干或定型（常用于陶土、油漆或日晒）"},"examples":[{"en":"Leave the clay in the sun to bake.","zh":"把陶土放在太阳下晒到变硬。"},{"en":"The paint needs time to bake on in the heat.","zh":"油漆需要在热度下烘干固化。"}]},{"partOfSpeech":"v.","definition":{"en":"to be very hot; to heat intensely (often describing weather)","zh":"非常炎热；强烈加热（常用于形容天气）"},"examples":[{"en":"We were baking in the summer sun.","zh":"我们在夏日烈阳下热得受不了。"},{"en":"The desert heat baked the ground.","zh":"沙漠的高温把地面烤得发烫。"}]},{"partOfSpeech":"n.","definition":{"en":"an act or period of baking; baked goods (less common)","zh":"一次烘烤的过程/时段；烘焙食品（较少见）"},"examples":[{"en":"This bake will take about 30 minutes.","zh":"这次烘烤大约需要30分钟。"},{"en":"They sold homemade bakes at the school fair.","zh":"他们在学校义卖会上卖自制烘焙食品。"}]}],"synonyms":["roast","cook","oven-bake","heat","harden"],"phonetic":"/beɪk/","extraExplanation":["“bake”在口语里也常出现在被动或进行时中表示“被晒/被烤得很热”，如“I'm baking out here.”（我在这儿快热化了）。","常见搭配：bake a cake / bake bread / bake cookies；bake at 350°F（以350华氏度烘烤）；bake for 20 minutes（烤20分钟）；baked goods（烘焙食品）。"]}
{"word":"bake sale","summary":{"en":"a fundraiser selling homemade baked goods","zh":"通过售卖自制烘焙食品来筹款的义卖活动"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an event where people sell homemade baked goods to raise money for a school, charity, or community group","zh":"（为学校、慈善或社区团体筹款的）烘焙义卖／糕点义卖活动"},"examples":[{"en":"Our class is holding a bake sale to raise money for the school trip.","zh":"我们班要办一场烘焙义卖来为学校旅行筹款。"},{"en":"She volunteered at the bake sale and sold cookies and brownies.","zh":"她在烘焙义卖做志愿者，卖饼干和布朗尼。"},{"en":"The bake sale outside the library brought in over $300 for the shelter.","zh":"图书馆外的烘焙义卖为收容所筹到300多美元。"}]}],"synonyms":["fundraiser","charity sale","food fundraiser","benefit sale"],"phonetic":"/ˈbeɪk seɪl/","extraExplanation":["在美国和加拿大的学校、教会、社区活动中很常见：大家自制蛋糕、饼干、松饼等来卖，收入用于班费、社团活动或慈善捐助。","有时也会看到类似说法：charity bake sale（慈善烘焙义卖）、school bake sale（学校烘焙义卖）。"],"etymology":"由 bake（烘烤）+ sale（售卖）组成的名词短语，字面义为“卖烘焙食品的活动”，在英语国家常用于指以筹款为目的的社区/学校义卖。","mnemonic":["拆开记：bake=烘焙，sale=卖；合起来就是“卖烘焙食品（通常为筹款）的活动”。","联想中文场景：学校门口的“爱心义卖”，只不过主角是蛋糕/饼干。"]}
{"word":"bake-out","summary":{"en":"Bake-out means heating a space or equipment to drive out moisture or unwanted chemical vapors; it can also mean warming and airing out a room to reduce smells.","zh":"Bake-out 指通过加热让空间或设备排出水分与挥发性污染物；也可泛指“加热+通风散味”的处理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A process of heating a building, room, or equipment (often in a vacuum or controlled air) to drive out unwanted moisture or chemical vapors (volatile contaminants).","zh":"“烘烤除气/烘烤除湿”过程：通过加热建筑、房间或设备（常在真空或受控空气环境中）把水分或挥发性化学物质排出。"},"examples":[{"en":"Before astronauts arrived, the cabin went through a bake-out to reduce chemical odors.","zh":"在宇航员进入之前，舱体要进行一次 bake-out，以减少化学气味。"},{"en":"The lab scheduled a bake-out overnight to remove moisture from the instrument.","zh":"实验室安排夜间 bake-out，把仪器里的水分烘干排出。"}]},{"partOfSpeech":"n.","definition":{"en":"A “heat-and-air-out” period for a space (such as a newly painted room) to lessen smells and improve air quality.","zh":"（较口语）把空间加热并通风一段时间，以减轻新装修/新油漆等气味、改善空气。"},"examples":[{"en":"After painting, we did a bake-out with the windows open.","zh":"油漆后我们开窗做了一次 bake-out 来散味。"},{"en":"The landlord recommended a bake-out before we moved in.","zh":"房东建议我们搬进去前先做个 bake-out。"}]}],"synonyms":["bakeout","outgassing bake","thermal bake","heat treatment","airing-out"],"phonetic":"/ˈbeɪk ˌaʊt/","extraExplanation":["bake-out 常见于航天、半导体、光学、洁净室等领域，目的是减少“outgassing（放气/逸出气体）”：材料在真空或高温下释放出的挥发物可能污染镜面、芯片或传感器。","写法上也可见 bakeout / bake out，但在技术语境里用连字符 bake-out 很常见。"]}
{"word":"bakeapple","summary":{"en":"Bakeapple is a regional name (especially in Newfoundland and Labrador) for the cloudberry, a golden-orange berry often used in jams and desserts.","zh":"bakeapple 是一种地方说法（多见于加拿大纽芬兰与拉布拉多），指云莓/北极莓，一种金橙色浆果，常用来做果酱和甜点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cloudberry (an orange-yellow berry) especially in Newfoundland and Labrador, Canada; also the plant that produces it.","zh":"（加拿大纽芬兰与拉布拉多等地的说法）云莓/北极莓（一种橙黄色的浆果）；也可指结这种果的植物。"},"examples":[{"en":"We picked bakeapples on the bog and made jam.","zh":"我们在泥炭沼泽上采了云莓（bakeapples），做了果酱。"},{"en":"Bakeapple jam is a traditional treat in Newfoundland.","zh":"云莓果酱是纽芬兰的传统美食。"}]}],"synonyms":["cloudberry"],"phonetic":"/ˈbeɪkˌæpəl/","extraExplanation":["“bakeapple”主要是加拿大大西洋地区（尤其是纽芬兰与拉布拉多）的地方用词；在更广泛的英语世界里更常说“cloudberry”。","这种浆果常生长在寒冷地区的泥炭沼泽（bog）与湿地，成熟时呈金橙色，常被用来做果酱、派、甜点或搭配奶制品。"]}
{"word":"bakeapples","summary":{"en":"Bakeapples are cloudberries, a northern golden berry commonly used in jams and desserts (especially in Newfoundland and Labrador).","zh":"Bakeapples 指云莓，一种北方金橙色浆果，常做果酱和甜点（尤见于纽芬兰与拉布拉多）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a regional (especially Newfoundland and Labrador, Canada) word for cloudberries: small golden-orange berries that grow in northern bogs and are often used in jams, pies, and desserts.","zh":"（地区用语，尤指加拿大纽芬兰与拉布拉多）云莓：一种生长在北方沼泽地、呈金橙色的小浆果，常用于做果酱、派和甜点。"},"examples":[{"en":"In Newfoundland, people pick bakeapples in late summer and make jam.","zh":"在纽芬兰，人们会在夏末采摘 bakeapples（云莓）并做成果酱。"},{"en":"The restaurant served bakeapple cheesecake with a tangy, honey-like flavor.","zh":"这家餐厅端上了 bakeapple（云莓）芝士蛋糕，味道酸甜，带点蜂蜜般的香气。"}]}],"synonyms":["cloudberries","cloudberry"],"phonetic":"/ˈbeɪkˌæpəlz/","extraExplanation":["“bakeapple(s)”是加拿大大西洋省份（尤其纽芬兰与拉布拉多）非常有代表性的地方说法；在更通用的英语里更常说“cloudberry”。","这个词通常以复数“bakeapples”出现，表示这种果实的集合（像说“blueberries”一样），即使指一类食物也常用复数。"]}
{"word":"bakeboard","summary":{"en":"“Bakeboard” usually means a board used for baking tasks, but it’s an uncommon spelling; “baking board/pastry board” is more standard.","zh":"“bakeboard”通常指烘焙用的板，但这种写法不常见；更标准的是 baking board / pastry board。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flat board used for baking work, especially for rolling dough or handling baked goods (a rare/nonstandard spelling; more commonly written as “baking board” or “pastry board”).","zh":"（罕见/非标准拼写）用于烘焙操作的平板，例如擀面、整形或搬运烘焙食品的板；更常写作 baking board / pastry board（烘焙板/揉面板）。"},"examples":[{"en":"She floured the bakeboard before rolling out the pie crust.","zh":"她在烘焙板上撒了些面粉，然后开始擀派皮。"},{"en":"Put the cookies on the bakeboard so they’re easy to carry to the oven.","zh":"把饼干放到烘焙板上，这样更方便端到烤箱旁。"}]}],"synonyms":["baking board","pastry board","dough board"],"phonetic":"/ˈbeɪkˌbɔrd/","extraExplanation":["“bakeboard”在现代英语里非常少见，很多情况下人们会写成两个词：baking board / pastry board。","如果你本来想表达的是篮球或运动场馆里的“篮板”，正确拼写通常是 backboard（/ˈbækˌbɔrd/），意思完全不同。"]}
{"word":"baked","summary":{"en":"“Baked” most often means cooked in an oven; informally it can also mean very tired/hot, or intoxicated. It’s also the past form of “bake.”","zh":"“baked”最常指“烤熟的”；口语中也可指“累坏了/热得受不了”，或俚语“嗨了”。同时它还是“bake”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"cooked in an oven using dry heat","zh":"（用烤箱干热）烘烤熟的"},"examples":[{"en":"I brought baked potatoes for dinner.","zh":"我带了烤土豆当晚餐。"},{"en":"The bakery sells freshly baked bread every morning.","zh":"那家面包店每天早上卖新鲜出炉的面包。"}]},{"partOfSpeech":"adj.","definition":{"en":"very tired, worn out, or overheated (informal)","zh":"（非正式）很累的；累坏的；热得受不了的"},"examples":[{"en":"After the hike, I was completely baked.","zh":"徒步之后，我累坏了。"},{"en":"We were baked in the afternoon sun.","zh":"下午的太阳把我们晒得受不了。"}]},{"partOfSpeech":"adj.","definition":{"en":"intoxicated, especially from cannabis (slang)","zh":"（俚语）嗨了；（尤指）吸食大麻后醉/飘了"},"examples":[{"en":"He got baked and forgot where he parked the car.","zh":"他嗨了，忘了车停在哪儿。"},{"en":"They were acting baked and laughing at everything.","zh":"他们看起来嗨了，什么都笑。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “bake”","zh":"“bake”的过去式和过去分词"},"examples":[{"en":"She baked a cake for her sister’s birthday.","zh":"她为妹妹的生日烤了一个蛋糕。"},{"en":"The cookies were baked for twelve minutes.","zh":"饼干烤了十二分钟。"}]}],"synonyms":["roasted","oven-baked","cooked","exhausted","worn out","high","intoxicated"],"phonetic":"/beɪkt/","extraExplanation":["“baked”作俚语表示“嗨了/吸大麻后飘了”，在正式场合（学校、工作、正式写作）应避免使用。","“baked”还能引申为“被热烤着/晒得发烫”，常见搭配：baked in the sun（在太阳下被晒得很热）。"]}
{"word":"baked beans","summary":{"en":"Beans cooked in sauce, often a canned side dish.","zh":"用酱汁慢煮的豆子，常见为罐装配菜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A dish of beans cooked slowly in a sauce (often tomato-based, sometimes sweet), usually sold in cans and served hot.","zh":"焗豆；茄汁豆（把豆子用酱汁慢煮的菜，常见为罐装加热食用）"},"examples":[{"en":"He heated a can of baked beans for a quick lunch.","zh":"他加热了一罐焗豆当作快速午餐。"},{"en":"Baked beans are a common side dish at barbecues in the U.S.","zh":"在美国，焗豆是烧烤时常见的配菜。"},{"en":"In the U.K., baked beans are often served on toast.","zh":"在英国，焗豆常常配吐司一起吃。"}]}],"synonyms":["beans in tomato sauce","canned beans","baked haricot beans"],"phonetic":"/ˌbeɪkt ˈbiːnz/","extraExplanation":["文化用法：英式“beans on toast（吐司配焗豆）”是很典型的家常快餐；美式焗豆常偏甜、带烟熏或培根风味，常与烧烤、热狗等搭配。","用词提示：在日常英语里，baked beans通常指“罐装茄汁豆/焗豆”这一类固定菜品，不一定真的“烤过”。"],"etymology":"源自英文 baked（烘烤的/焗的）+ beans（豆子）。早期做法常在烤箱或炖锅里长时间慢煮；后来发展出广泛流行的罐装食品，尤其在英美饮食文化中常见。","mnemonic":["把它想成“被烤/焗过的豆子”：baked（焗）+ beans（豆）= 焗豆。","联想英式经典搭配：beans on toast（吐司+焗豆），一听就能记住这个菜名。"]}
{"word":"baked chicken","summary":{"en":"Oven-cooked chicken, typically seasoned and roasted until done.","zh":"烤箱烤熟的鸡肉（通常调味后烤制）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Chicken cooked in an oven with dry heat, usually seasoned and roasted until done.","zh":"用烤箱干热烤熟的鸡肉（通常会调味，烤到熟透）。"},"examples":[{"en":"I’m making baked chicken with lemon and garlic for dinner.","zh":"我晚饭要做柠檬蒜香烤鸡。"},{"en":"Baked chicken is a healthier option than fried chicken.","zh":"烤鸡通常比炸鸡更健康。"},{"en":"She packed baked chicken and vegetables for lunch.","zh":"她午饭带了烤鸡和蔬菜。"}]}],"synonyms":["oven-baked chicken","roast chicken","roasted chicken","baked poultry"],"phonetic":"/beɪkt ˈtʃɪkən/","extraExplanation":["美式英语里，“baked chicken”常指“烤箱烤的鸡肉/鸡腿/鸡胸”等；菜单上也可能写作“oven-baked chicken”或“roast chicken”（更强调整鸡烤制）。","口语点餐时也常说：“I’ll have the baked chicken.”（我要烤鸡这道菜。）"],"etymology":"“baked”来自古英语，意为“用热烘烤”；“chicken”来自中古英语，原指“小鸡/幼鸡”，后来也指鸡肉。合起来就是“用烤箱烤的鸡（肉）”。","mnemonic":["把 baked 想成“被烤的/烘焙的”，baked chicken 就是“被烤过的鸡”。","联想：bake（烤）+ chicken（鸡）→ “烤鸡”。"]}
{"word":"Baked Earth","summary":{"en":"hardened, dried ground or heat-hardened earth material","zh":"干硬开裂的地面；或经加热硬化的泥土材料"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Soil or ground that has been dried and hardened by strong heat (often the sun), becoming hard and sometimes cracked.","zh":"被强烈热量（常指太阳）烘干并变硬的土地；常会变硬甚至开裂。"},"examples":[{"en":"After weeks without rain, the riverbank turned into baked earth.","zh":"连续几周不下雨后，河岸变成了干硬的土地。"},{"en":"Her shoes kicked up dust from the baked earth.","zh":"她的鞋子从干硬的土地上踢起了尘土。"}]},{"partOfSpeech":"phrase","definition":{"en":"Earth (clay/soil) used as a building or craft material after being hardened by heat, such as in bricks or pottery.","zh":"经加热硬化后用作材料的泥土（黏土/土壤），如砖或陶器中的材料。"},"examples":[{"en":"Many traditional homes were built from baked earth bricks.","zh":"许多传统房屋是用土坯（烘硬的泥砖）建成的。"},{"en":"The bowls were made from baked earth and painted by hand.","zh":"这些碗用陶土烧制而成，并手工上彩。"}]}],"synonyms":["parched ground","hardened soil","sun-baked ground","dry earth","baked clay"],"phonetic":"/beɪkt ɝθ/","extraExplanation":["在文学或描写性写作中，baked earth常用来营造“干旱、炎热、荒凉”的画面；类似表达还有“parched land（龟裂的旱地）”。","与“adobe（土坯）”不同：adobe通常指“晒干的泥砖（未必进窑烧）”；baked earth更强调“被热烘硬/烧硬”的结果。"],"etymology":"来自“baked（烘烤的、被热烤干的）+ earth（土地/泥土）”。字面组合，用来描述“被热烤硬的地面/泥土”，也可引申到“烧制后的泥土制品”。","mnemonic":["把baked理解成“烤过的”：baked earth = “像被烤过一样硬的地”。联想中文“旱得像烤地皮”。","earth=“土”，baked=“烤/焙”：合起来就是“焙土/烤土”，容易想到“土变硬、开裂”。"]}
{"word":"baked potato","summary":{"en":"a whole potato baked in its skin and often served with toppings","zh":"带皮整颗烤制的土豆，常配各种配料食用"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a whole potato cooked in its skin, usually in an oven, and often served with toppings such as butter, sour cream, cheese, or chives","zh":"（带皮）烤土豆；通常整颗烤熟后切开，加黄油、酸奶油、奶酪、细香葱等配料食用"},"examples":[{"en":"I’ll have a baked potato with butter and sour cream, please.","zh":"我想要一份烤土豆，加黄油和酸奶油，谢谢。"},{"en":"Baked potatoes are an easy side dish for steak or chicken.","zh":"烤土豆是牛排或鸡肉的简单配菜。"},{"en":"She microwaved the potato first and then finished it in the oven to make the skin crispy.","zh":"她先用微波炉把土豆加热熟，再进烤箱烤一会儿，让外皮更酥。"}]}],"synonyms":["jacket potato","oven-baked potato","stuffed potato"],"phonetic":"/ˈbeɪkt pəˈteɪtoʊ/","extraExplanation":["在美式餐馆里，baked potato 常作为“side（配菜）”出现，点餐时服务员可能会问你要哪些 toppings（配料）。","有时也会听到 jacket potato（英式英语），意思基本相同，强调“带皮（像穿了外套）”。"],"etymology":"由 baked（烤熟的）+ potato（土豆）构成的常见食物名称；作为固定搭配在英语里长期用于指“带皮整颗烤制的土豆”。","mnemonic":["baked=烤的，potato=土豆，合起来就是“烤土豆”。可联想：烤（bake）出来的“土豆”香味。","把 jacket potato 记成“穿夹克的土豆”＝带皮烤土豆，更好记。"]}
{"word":"baked prawns","summary":{"en":"Oven-baked prawns, often seasoned or sauced.","zh":"用烤箱烘烤并调味/加酱的对虾（大虾）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Prawns (large shrimp) cooked in an oven, often with butter, garlic, herbs, or sauce.","zh":"烤箱烘烤的对虾（大虾/明虾），常配黄油、蒜、香草或酱汁。"},"examples":[{"en":"We had baked prawns with garlic butter and lemon for dinner.","zh":"晚餐我们吃了蒜香黄油柠檬烤对虾。"},{"en":"The menu recommends baked prawns served with rice or bread.","zh":"菜单推荐烤对虾配米饭或面包一起吃。"}]}],"synonyms":["baked shrimp","roasted prawns","oven-baked shrimp","garlic prawns","butter prawns"],"phonetic":"/beɪkt prɔnz/","extraExplanation":["在美式英语里，日常口语常用“shrimp”；“prawns”更常见于菜单、较正式或英式/澳式语境。很多时候两者都被统称为“虾”，但在生物学上有细分差别。","“baked”通常指烤箱烘烤（oven-baked）；如果是明火烧烤更常说“grilled prawns”。","点餐/写菜名时也常见：garlic baked prawns（蒜香烤虾）、butter-baked prawns（黄油烤虾）、baked prawns with cheese（芝士焗烤虾，常用baked/au gratin）。"],"etymology":"“baked”来自古英语，意为“用热烘烤”；“prawn”来自中古英语，指一种可食用的甲壳类（与shrimp相近）。合起来就是“用烤箱烤的对虾/大虾”。","mnemonic":["bake≈“烘焙/烤”，联想“烤面包(baked bread)”；prawn≈“大虾”，合起来就是“烤的大虾”。","把prawn联想成“爬(爪)的虾”：有爪子、个头更大，更像菜单里说的“对虾”。"]}
{"word":"baked sesame cake","summary":{"en":"A baked pastry or bread topped with sesame seeds.","zh":"一种表面带芝麻的烤制点心或面饼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cake- or bread-like pastry that is baked and topped with (or mixed with) sesame seeds.","zh":"一种烤制的点心/面饼，表面撒有（或拌有）芝麻。"},"examples":[{"en":"I grabbed a baked sesame cake from the bakery for breakfast.","zh":"我从面包店买了一个烤芝麻饼当早餐。"},{"en":"The baked sesame cake was crisp outside and soft inside.","zh":"这个烤芝麻饼外脆里软。"},{"en":"She served baked sesame cakes with tea.","zh":"她配着茶端上了烤芝麻饼。"}]}],"synonyms":["sesame cake","sesame bun","sesame pastry","sesame flatbread","sesame bread","shaobing"],"phonetic":"/beɪkt ˈsɛsəmi keɪk/","extraExplanation":["在不同地区，这个说法可能对应不同的食物：在中式语境里常让人想到“芝麻烧饼/芝麻饼”（外皮较酥、带芝麻香）；在西式语境里也可能泛指任何带芝麻的烤制小点心。点餐时如果想更具体，可以补充形状与口感，比如 sesame bun（芝麻小圆面包）、sesame flatbread（芝麻薄饼）。"],"etymology":"由三个常用词组合而成：baked（烤制的）+ sesame（芝麻）+ cake（饼/糕）。在英语里 cake 不一定是“奶油蛋糕”，也常指“饼状点心/糕点”。","mnemonic":["把它拆开记：baked=烤的；sesame=芝麻；cake=饼/糕。合起来就是“烤的芝麻饼”。","记住 cake 不只等于“蛋糕”，也可表示“饼状点心”，类似中文里“饼/糕”都可能用 cake 来概括。"]}
{"word":"baked wheat cake","summary":{"en":"a baked flour-based cake made from wheat","zh":"用小麦面粉烘烤制成的饼/蛋糕类食物"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A cake-like baked food made mainly from wheat flour; a general description that can refer to items like a wheat cake, small loaf, biscuit, or scone depending on context.","zh":"主要用小麦面粉做成并烘烤的“蛋糕/饼状”食物；是一个泛称，具体可能指小麦饼、小面包、饼干或司康，取决于语境。"},"examples":[{"en":"For breakfast, she ate a baked wheat cake with butter and honey.","zh":"早餐她吃了一个烤制的小麦饼，配黄油和蜂蜜。"},{"en":"The recipe makes a lightly sweet baked wheat cake that pairs well with tea.","zh":"这个食谱做出来的是微甜的烤小麦蛋糕/饼，很适合配茶。"},{"en":"In some places, a “baked wheat cake” is closer to a small bread than a dessert cake.","zh":"在一些地方，“烤小麦蛋糕/饼”更像小面包，而不是甜点蛋糕。"}]}],"synonyms":["wheat cake","wheat bread","small loaf","biscuit","scone","flatbread"],"phonetic":"/beɪkt wiːt keɪk/","extraExplanation":["英语里的 cake 有时也泛指“饼状食物”（不一定是甜点蛋糕）。如果你想更明确：甜点可说 wheat cake；像面包可说 small wheat loaf 或 wheat bread；像司康可说 wheat scone。"],"etymology":"由三个常见英语词组合而成：baked（烘烤的）+ wheat（小麦）+ cake（蛋糕/饼）。这不是固定成语，更像对食物的描述性短语。","mnemonic":["把它拆开记：baked=烤的，wheat=小麦，cake=蛋糕/饼；合起来就是“烤的小麦饼/蛋糕”。","记联想：wheat（小麦）≈“维特/麦”，看到 wheat 就想到“麦类主食”。"]}
{"word":"bakehead","summary":{"en":"“Bakehead” is informal slang for a frequent cannabis user or someone who is very high.","zh":"“bakehead”是非正式俚语，指经常使用大麻的人，或指当下嗨得很厉害的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, informal) A person who uses cannabis a lot; a “pothead.”","zh":"（俚语，非正式）经常吸食/使用大麻的人；“大麻迷”。"},"examples":[{"en":"Some of his friends are bakeheads, so they talk about weed all the time.","zh":"他有些朋友是大麻迷，所以他们总是在聊大麻。"},{"en":"He’s trying to stop hanging out with bakeheads and focus on school.","zh":"他在努力不再跟那些大麻迷混在一起，把重心放回学业上。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang, informal) Someone who is very high (intoxicated), especially from marijuana.","zh":"（俚语，非正式）处在很嗨/很“上头”的状态的人，尤指因大麻而醉嗨。"},"examples":[{"en":"After the party, a couple of bakeheads were still laughing at nothing.","zh":"派对结束后，还有几个人嗨得不行，对着空气傻笑。"},{"en":"I can’t drive—I'm basically a bakehead right now.","zh":"我不能开车——我现在基本上嗨到不行。"}]}],"synonyms":["pothead","stoner","weedhead"],"phonetic":"/ˈbeɪkˌhɛd/","extraExplanation":["“bakehead”是由“baked（嗨了、被大麻影响）+ head（某类人）”构成的俚语，语气带调侃甚至贬义，不适合正式场合。","在不同地区该词并不常见；更常见的说法是“pothead / stoner”。","注意语境：涉及药物/成瘾话题时，用词容易冒犯他人；正式写作可用“cannabis user / marijuana user”。"]}
{"word":"bakehouse","summary":{"en":"A bakehouse is a place where bread and other baked goods are made, similar to a bakery.","zh":"bakehouse 指制作面包等烘焙食品的地方，类似 bakery（面包店/烘焙店）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A building or place where bread and other baked goods are made; a bakery (often used in names, or in historical contexts).","zh":"烘焙房；面包房（常见于店名或较具历史语境中，类似“bakery”）。"},"examples":[{"en":"We bought warm rolls from the bakehouse on the corner.","zh":"我们在街角的面包房买了热乎乎的小面包。"},{"en":"In the old village, the bakehouse supplied bread for the whole community.","zh":"在那个老村子里，这家烘焙房为整个社区供应面包。"}]}],"synonyms":["bakery","bakeshop"],"phonetic":"/ˈbeɪkˌhaʊs/","extraExplanation":["“bakehouse”在现代英语里不如“bakery”常用，但在英国、澳大利亚等地的店名（如 *Something Bakehouse*）里很常见，给人一种更传统、手作、社区小店的感觉。","历史上，“bakehouse”也可指庄园、军营或大户人家专门用来烤面包的独立建筑（与住宅分开，主要因为烤炉有火灾风险）。"]}
{"word":"bakehouses","summary":{"en":"“Bakehouses” is the plural of “bakehouse”: places where bread and other baked goods are made.","zh":"“bakehouses”是“bakehouse”的复数：指制作面包等烘焙食品的场所。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A building or place where bread and other food are baked; a bakery or a room with ovens used for baking.","zh":"烘焙房；面包房；烤炉房（用于烤面包等食物的建筑或场所）。"},"examples":[{"en":"Fresh bread is delivered every morning from the bakehouse.","zh":"新鲜面包每天早上都会从烘焙房送来。"},{"en":"The restaurant has its own bakehouse for pastries and pies.","zh":"这家餐厅有自己的烘焙房，用来做酥点和馅饼。"}]}],"synonyms":["bakeries","bakeshops","ovens (in context)","bake rooms"],"phonetic":"/ˈbeɪkˌhaʊs/","extraExplanation":["“bakehouse”在历史上也常指“公共烤炉房/公用烘焙房”：一些城镇或庄园会设立集中烤炉，居民把面团送去统一烘烤。这种用法在历史题材作品或旧文献中更常见。"]}
{"word":"Bakelite","summary":{"en":"Bakelite is an early hard plastic widely used in vintage electrical and household items.","zh":"Bakelite（电木）是一种早期的硬质塑料，常见于复古电器和家庭用品中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hard, early synthetic plastic (a phenol-formaldehyde resin), often used for electrical parts and household goods, especially in the early-to-mid 1900s","zh":"（电木）一种早期的硬质合成塑料（酚醛树脂），常用于电器部件和家用品，尤指20世纪上半叶"},"examples":[{"en":"The old radio has a Bakelite case that still looks shiny.","zh":"那台老收音机有一个电木外壳，看起来仍然很有光泽。"},{"en":"Many early telephones were made from Bakelite because it resists heat and electricity.","zh":"许多早期电话用电木制造，因为它耐热且绝缘。"}]}],"synonyms":["phenolic resin","phenol-formaldehyde resin"],"phonetic":"/ˈbeɪkəlaɪt/","extraExplanation":["“Bakelite”源自发明者 Leo Baekeland（利奥·贝克兰德）的姓氏，是人类历史上第一批成功大规模商业化的合成塑料之一（约1907年）。","在复古文化中，“Bakelite”常让人联想到旧式电话、收音机、插座、厨房把手以及古董首饰等，带有明显的“怀旧/复古”风格联想。"]}
{"word":"bakelite","summary":{"en":"Bakelite is an early hard, heat-resistant plastic used in many vintage electrical and household items.","zh":"Bakelite（电木）是一种早期的坚硬耐热塑料，常见于复古电器与日用品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hard, heat-resistant early plastic (a phenolic resin), used especially in older electrical parts, radios, telephones, and kitchenware","zh":"电木；酚醛树脂（一种早期塑料），坚硬且耐热，常见于老式电器部件、收音机、电话与厨具"},"examples":[{"en":"Many vintage radios have Bakelite cases.","zh":"很多复古收音机的外壳是电木做的。"},{"en":"The electrician replaced the cracked Bakelite switch plate.","zh":"电工把裂开的电木开关面板换掉了。"},{"en":"Collectors like the warm, glossy look of Bakelite jewelry.","zh":"收藏家喜欢电木饰品温润、有光泽的质感。"}]}],"synonyms":["phenolic resin","phenolic plastic"],"phonetic":"/ˈbeɪkəˌlaɪt/","extraExplanation":["“Bakelite”来自发明者利奥·贝克兰（Leo Baekeland）的姓氏。它在20世纪早期非常流行，被认为是第一批可大规模生产的合成塑料之一。","电木常见特征：质地硬、较重、耐热、可抛光；许多老物件（电话听筒、插座面板、收音机旋钮）会用到。"]}
{"word":"bakelize","summary":{"en":"“Bakelize” is not standard; it likely refers to “balkanize,” meaning to fragment into smaller, often competing parts.","zh":"“bakelize”不是标准用词；多半指“balkanize”，意为把整体分裂成更小、常彼此竞争的部分。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Likely a misspelling) To divide a country, organization, or group into smaller parts that often compete or conflict with each other; to fragment.","zh":"（很可能是拼写错误）把一个国家、组织或群体分裂成更小的部分，这些部分往往彼此竞争或冲突；使碎片化。"},"examples":[{"en":"The new policy could balkanize the company into rival departments.","zh":"这项新政策可能会让公司分裂成互相对立的部门。"},{"en":"Some critics worry that social media is balkanizing public discussion.","zh":"一些批评者担心社交媒体正在让公共讨论碎片化。"}]}],"synonyms":["fragment","divide","splinter","break up","partition"],"phonetic":"/ˈbɔlkəˌnaɪz/","extraExplanation":["“bakelize”不是常见英语单词；最可能想写的是 **balkanize**（源自“Balkanize / Balkanization”）。该词来自欧洲“巴尔干地区（the Balkans）”在历史上多次分裂为小国家的背景，因此带有“分裂、碎片化（常伴随冲突）”的含义。","常见搭配：balkanize a country/society/party; be balkanized (被分裂、被碎片化)。"]}
{"word":"Bakeman","summary":{"en":"Bakeman is most commonly a surname; rarely, it can mean a baker in older usage.","zh":"Bakeman 最常见为姓氏；极少情况下在旧式用法中可指“面包师”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"（常见）姓氏：Bakeman（贝克曼/贝克曼姓）"},"examples":[{"en":"Dr. Bakeman will speak at the conference tomorrow.","zh":"Bakeman 博士将于明天在会议上发言。"},{"en":"My English teacher’s last name is Bakeman.","zh":"我英语老师的姓是 Bakeman。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare/old-fashioned) a person who bakes bread and other baked goods; a baker.","zh":"（罕见/旧式）面包师；烘焙师（同 baker）"},"examples":[{"en":"In older records, you may see the word “bakeman” used for someone who made bread for a living.","zh":"在较旧的记录中，你可能会看到用 “bakeman” 指以做面包为生的人。"},{"en":"The bakeman rose early to prepare bread for the market.","zh":"那位面包师很早起床，为集市准备面包。"}]}],"synonyms":["baker"],"phonetic":"/ˈbeɪkmən/","extraExplanation":["Bakeman 多见于英语国家的姓氏，来源与职业有关：早期很多姓氏来自一个人的工作（如 Baker、Smith）。Bakeman 可理解为“做面包的人/与面包师相关的人”的姓氏形式。","作为普通名词 “bakeman” 在现代英语里很少用；日常更常说 baker。"]}
{"word":"bakemeat","summary":{"en":"Bakemeat is an old-fashioned word for baked meat, especially meat baked inside a pie.","zh":"Bakemeat 是一个较古老的词，指烤（焙）肉，尤指馅饼/酥皮里烤的肉馅。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic) Baked meat, especially meat baked in a pie or pastry.","zh":"（古语）烤（焙）肉；尤指包在馅饼/酥皮里烘烤的肉馅。"},"examples":[{"en":"In old recipes, bakemeat often meant the meat filling for a pie.","zh":"在古老食谱里，bakemeat 常指馅饼里的肉馅。"},{"en":"They served bakemeat in a crust, like an early meat pie.","zh":"他们把 bakemeat 包在饼皮里端上来，像早期的肉馅派。"}]}],"synonyms":["baked meat","meat filling","pie filling"],"phonetic":"/ˈbeɪkˌmit/","extraExplanation":["bakemeat 是较古老的英语用词，现代英语里更常说 baked meat 或 meat filling（肉馅）。","在文艺作品中它常让人联想到“古早/中世纪风格”的饮食场景；例如莎士比亚《罗密欧与朱丽叶》中就出现过这个词，用来营造当时的生活氛围。"]}
{"word":"bakemeats","summary":{"en":"Bakemeats is an archaic plural noun meaning baked treats like pastries, pies, and cakes.","zh":"bakemeats 是古语复数名词，指糕饼点心等烘焙甜食（如派、蛋糕、酥点）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually plural, archaic) Baked foods—especially pastries, pies, cakes, or other sweet or rich items served as treats.","zh":"（多用复数，古语）烘焙食品；尤指点心、糕饼、派、蛋糕等甜或较油润的烤制食品。"},"examples":[{"en":"At the fair, the table was covered with bakemeats and sugared fruits.","zh":"集市上，桌子摆满了各式糕饼点心和糖渍水果。"},{"en":"The innkeeper offered bakemeats to travelers as a special treat.","zh":"旅店老板拿出烘焙点心招待旅人，算是一份特别的款待。"}]}],"synonyms":["pastries","baked goods","desserts","sweetmeats"],"phonetic":"/ˈbeɪkˌmits/","extraExplanation":["这是较古老的英语词，常见于文学或历史语境中；现代英语更常说 pastries / baked goods / desserts。","在早期英语里，meat 不一定指“肉”，也可泛指“食物”；因此 bakemeats 字面像“烤的肉”，实际多指“烤制的食物/点心”。","你可能在莎士比亚等早期文学中见到它，用来营造旧时节庆、宴会或民俗氛围。"]}
{"word":"Bakemeier","summary":{"en":"Bakemeier is a surname, most commonly associated with German heritage.","zh":"Bakemeier 是一个姓氏，常见于具有德国血统/背景的人名中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), most commonly of German origin.","zh":"一个姓氏（家族姓），多见于德语背景。"},"examples":[{"en":"Dr. Bakemeier will speak at the conference tomorrow.","zh":"巴克迈尔博士将于明天在会议上发言。"},{"en":"My teacher’s last name is Bakemeier.","zh":"我老师的姓是 Bakemeier。"}]}],"phonetic":"/ˈbɑːkaɪˌmaɪər/","extraExplanation":["“Bakemeier”通常被认为源自德语姓氏：其中“Meier/Meier”在中世纪德语里常与“管家、佃农、农庄管理者”等身份有关；前半部分“Bake-”可能与职业或地名有关（不同家族来源可能不同），因此更准确的家族溯源需要结合具体地区与族谱记录。","英文语境中它多作为专有名词使用：首字母大写，不加冠词（不说 *a Bakemeier*，而说 *Mr./Ms. Bakemeier*）。发音在美国可能因家庭习惯略有差异。"]}
{"word":"baken","summary":{"en":"“Baken” is usually a misspelling of “bacon,” or an archaic form meaning “baked.”","zh":"“baken”多半是“bacon（培根）”的拼写错误，或是表示“烤好的”的古老形式。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard spelling; most commonly a misspelling of “bacon” or “baked/baken” (an archaic form meaning “baked”).","zh":"非标准拼写；最常见是把“bacon（培根）”拼错，或指“baked/baken（烤好的）”（较古老用法，意为“烤过的”）。"},"examples":[{"en":"Did you mean “bacon” (the meat) instead of “baken”?","zh":"你是不是想写“bacon（培根）”，而不是“baken”？"},{"en":"In some older texts, you may see “baken” meaning “baked,” but modern English uses “baked.”","zh":"在一些较旧的文本里可能会看到“baken”表示“baked（烤好的）”，但现代英语一般用“baked”。"}]}],"synonyms":["bacon","baked"],"phonetic":"/ˈbeɪkən/","extraExplanation":["“baken”本身不是现代英语里的常用词。如果你是在菜单、购物清单或早餐语境里看到/想写它，99% 的情况是指“bacon（培根）”。\n\n如果你想表达“烤好的面包/食物”，现代英语通常写“baked”（如：baked bread / baked chicken）。\n\n也可能是人名/姓氏（如 Baken），这时属于专有名词，含义取决于具体个人或地名。"]}
{"word":"bakeout","summary":{"en":"Bakeout is a technical process of heating equipment (especially vacuum systems) to remove moisture and trapped gases.","zh":"Bakeout 指在技术领域通过加热设备（尤其真空系统）来去除水汽与吸附气体的烘烤除气过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Engineering) The process of heating equipment—especially a vacuum chamber or scientific instrument—to drive off water and other gases so it becomes cleaner and reaches a better vacuum.","zh":"（工程/科研）通过加热设备（尤其是真空腔体或仪器）来“赶出”水汽和其他气体，使系统更干净、真空度更高的过程（烘烤除气/烘烤脱气）。"},"examples":[{"en":"Before the experiment, the technician did a bakeout of the vacuum chamber overnight.","zh":"实验前，技术员把真空腔体做了通宵的 bakeout（烘烤除气）。"},{"en":"A proper bakeout helps reduce outgassing and improves the pressure stability.","zh":"合适的 bakeout 能减少放气（outgassing），让压力更稳定。"}]},{"partOfSpeech":"n.","definition":{"en":"A period of time when something is heated to remove moisture or unwanted substances (often used in technical or industrial settings).","zh":"（常用于技术/工业语境）把某物加热一段时间以去除水分或不需要物质的“烘烤阶段/烘干处理”。"},"examples":[{"en":"The new coating needs a short bakeout to remove residual solvents.","zh":"新涂层需要短时间 bakeout 来去除残留溶剂。"},{"en":"The manual recommends a two-hour bakeout after maintenance.","zh":"说明书建议维护后进行两小时的 bakeout。"}]}],"synonyms":["bake-out","outgassing reduction","vacuum bake","thermal degassing"],"phonetic":"/ˈbeɪkˌaʊt/","extraExplanation":["“Bakeout”常见于真空技术、半导体设备、表面科学与粒子加速器等领域。原理是升温会让材料表面与内部吸附的水分/气体更快释放，再由真空泵抽走，从而降低“outgassing（放气）”。","写法上也常见连字符 bake-out，或写作 bakeout cycle（烘烤循环）。在通用日常英语里不常用，更偏专业术语。"]}
{"word":"bakeoven","summary":{"en":"A bake oven is an oven used for baking; in everyday English, people usually just say “oven.”","zh":"bake oven 指用于烘焙的烤箱；日常英语里通常直接说 oven。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an oven used for baking bread, cakes, and other foods (usually written as “bake oven” or simply “oven”)","zh":"烘烤用的烤箱（通常写作“bake oven”或直接说“oven”）"},"examples":[{"en":"Preheat the bake oven to 350°F before you put in the cookies.","zh":"把饼干放进去之前，先把烤箱预热到350华氏度。"},{"en":"The bakery’s bake oven runs all day to make fresh bread.","zh":"面包店的烤箱整天运转来烤新鲜面包。"}]}],"synonyms":["oven","baking oven","bread oven"],"phonetic":"ˈbeɪk ˌʌvən","extraExplanation":["“bakeoven”通常不是标准拼写；更常见的写法是分开写“bake oven”，口语和日常写作里直接用“oven”也最自然。","在英式英语里也常说“baking oven”。如果是厨房电器，一般用“oven”；如果强调烘焙用途，可以说“bake oven / baking oven”。"]}
{"word":"bakepan","summary":{"en":"A bake pan is a pan or tray used to bake food in the oven.","zh":"bake pan 指用于烤箱烘焙食物的烤盘/烤盘托盘。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A pan or tray used for baking food in an oven (for example, cakes, bread, cookies, or roasted vegetables).","zh":"烤盘；烘焙用的平底盘或烤盘（用于烤蛋糕、面包、饼干或蔬菜等）。"},"examples":[{"en":"Grease the bake pan before you pour in the cake batter.","zh":"把蛋糕糊倒进去之前，先在烤盘上抹点油。"},{"en":"Put the cookies on a bake pan and bake for 10 minutes.","zh":"把饼干放在烤盘上，烤10分钟。"}]}],"synonyms":["baking pan","baking tray","oven pan","cookie sheet","sheet pan"],"phonetic":"ˈbeɪk pæn","extraExplanation":["“bakepan”更常见的写法是分开写成“bake pan”，日常也常用更具体的词：\n- cookie sheet（饼干烤盘，通常较扁平）\n- baking tray（烤盘/烤托盘，英式更常见）\n- cake pan（蛋糕模/蛋糕烤盘，通常有边、有深度）\n- roasting pan（烤肉盘，通常更深、更大）"]}
{"word":"Baker","summary":{"en":"Baker usually means a person who makes baked goods; it can also mean a bakery (less common) or a last name.","zh":"Baker 通常指“面包师/烘焙师”；也可指“面包店”（较少见）或作为姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person whose job is to make and sell bread, cakes, and other baked foods","zh":"面包师；烘焙师（制作并售卖面包、蛋糕等烘焙食品的人）"},"examples":[{"en":"The baker starts work before sunrise to prepare fresh bread.","zh":"面包师在日出前就开始工作，准备新鲜面包。"},{"en":"We bought croissants from a local baker.","zh":"我们从当地的烘焙师那里买了羊角面包。"}]},{"partOfSpeech":"n.","definition":{"en":"a shop where bread, cakes, and other baked foods are made or sold (also called a bakery)","zh":"面包店；烘焙店（也常说 bakery）"},"examples":[{"en":"There’s a baker on the corner that sells amazing cinnamon rolls.","zh":"街角有一家面包店，肉桂卷特别好吃。"},{"en":"I stopped by the baker to pick up a birthday cake.","zh":"我去面包店取了一个生日蛋糕。"}]},{"partOfSpeech":"n.","definition":{"en":"someone with the family name Baker","zh":"贝克（姓氏）"},"examples":[{"en":"My English teacher’s last name is Baker.","zh":"我的英语老师姓贝克。"}]}],"synonyms":["baking professional","bread maker","pastry chef (for desserts)","bakery (for the shop)"],"phonetic":"/ˈbeɪkər/","extraExplanation":["“Baker”最常见的意思是“面包师/烘焙师”，来自古英语的职业称呼，所以也很常见作为姓氏（如：Tom Baker）。","在英美日常口语中，如果要明确指“面包店”，更常说 bakery；baker 更常指“做面包的人”，但在一些地方口语里也会用 baker 指店铺。"]}
{"word":"baker","summary":{"en":"A baker is a person who makes baked foods like bread and cakes, either professionally or at home.","zh":"baker 指制作面包、蛋糕等烘焙食品的人，可指职业面包师，也可指在家烘焙的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person whose job is making bread, cakes, and other baked goods, usually in a bakery","zh":"面包师；烘焙师（职业：制作面包、蛋糕等烘焙食品的人）"},"examples":[{"en":"The baker starts work before sunrise to prepare fresh bread.","zh":"面包师在日出前就开始工作，准备新鲜面包。"},{"en":"We bought croissants from a local baker.","zh":"我们从当地的面包师（或面包店）那里买了可颂。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who bakes at home, especially as a hobby","zh":"（尤指在家）烘焙爱好者；在家做烘焙的人"},"examples":[{"en":"She’s a talented baker who makes cookies for her friends.","zh":"她是一位很有天赋的烘焙爱好者，会为朋友们做饼干。"},{"en":"As a baker, he loves trying new cake recipes on weekends.","zh":"作为一名烘焙爱好者，他周末喜欢尝试新的蛋糕配方。"}]}],"synonyms":["bread maker","pastry chef","baker (home)","cook (baking)"],"phonetic":"/ˈbeɪkər/","extraExplanation":["“baker”来自“bake”（烘烤、烘焙）+ “-er”（表示“做某事的人”），是很常见的“职业/身份”构词方式，如：teacher（教书的人）、driver（开车的人）。","在英语文化里，baker 常与“清晨工作、手作面包、社区面包店”联系在一起。也常见于姓氏（Baker），源自祖先的职业。"]}
{"word":"baker-like","summary":{"en":"“Baker-like” means resembling a baker in appearance, smell, or manner.","zh":"“baker-like”表示在外表、气味或举止上“像面包师一样”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"resembling a baker; having qualities you associate with a baker (for example, smelling like fresh bread, wearing baking clothes, or acting in a warm, homey way).","zh":"像面包师的；具有你会联想到面包师的特征（例如有新鲜面包的气味、穿着烘焙工作服，或给人温暖居家的感觉）。"},"examples":[{"en":"The kitchen had a baker-like smell of warm yeast and butter.","zh":"厨房里有一种像面包师店里那样的气味：温热的酵母和黄油香。"},{"en":"He wore a flour-dusted apron that made him look baker-like.","zh":"他穿着一条沾满面粉的围裙，让他看起来很像面包师。"},{"en":"Her baker-like patience helped the beginners learn the recipe step by step.","zh":"她那种“面包师般”的耐心帮助初学者一步步学会了这道食谱。"}]}],"synonyms":["bakerish","like a baker","bread-baking","homey"],"phonetic":"/ˈbeɪkərˌlaɪk/","extraExplanation":["“-like”是常见后缀，表示“像……一样、具有……特征”。例如：childlike（孩子般的）、business-like（公事公办的/像做生意一样的）、home-like（像家一样的）。","“baker-like”在日常英语里不算非常固定的常用词，更常见的表达是：like a baker（像个面包师一样）或 bakerish（较少见）。写作中用连字符（baker-like）能强调这是临时组合的形容词。"]}
{"word":"bakerdom","summary":{"en":"Bakerdom means the world or community of bakers and baking.","zh":"Bakerdom 指“烘焙界/面包师群体”，即与面包师和烘焙相关的圈子与领域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The profession, community, or world of bakers; the collective realm of baking and those who do it.","zh":"烘焙师这一职业或群体；“烘焙界/面包师圈子”，指与烘焙相关的人与世界。"},"examples":[{"en":"She became well known in bakerdom for her sourdough techniques.","zh":"她因自己的天然酵母技巧在烘焙界小有名气。"},{"en":"News about new ovens spread quickly through bakerdom.","zh":"新烤箱的消息很快在面包师圈子里传开了。"}]}],"synonyms":["the baking world","the baking community","the world of baking","bakers (collectively)"],"phonetic":"/ˈbeɪkərdəm/","extraExplanation":["“-dom”是英语中表示“领域、状态、群体”的后缀，常见于 kingdom（王国）、freedom（自由）、officialdom（官僚群体）。因此 bakerdom 字面意思就是“面包师的领域/群体”。","bakerdom 属于比较少见、带点幽默或文艺色彩的用法，更常见的说法是 the baking world / the baking community / the world of baking。"]}
{"word":"bakeress","summary":{"en":"“Bakeress” means a female baker; it’s rare and old-fashioned, and “baker” is preferred today.","zh":"“Bakeress”指“女面包师/女烘焙师”，用法较少且偏旧式；现代多用中性的“baker”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman who bakes bread, cakes, etc.; a female baker (now rare and old-fashioned).","zh":"女面包师；女烘焙师（如今较少用、偏旧式）"},"examples":[{"en":"In older books you may see “bakeress” used for a woman who made and sold bread.","zh":"在较早的书里，你可能会看到“bakeress”用来指制作并出售面包的女性。"},{"en":"Today, most people simply say “baker,” regardless of gender.","zh":"如今，大多数人不分性别都直接说“baker（面包师/烘焙师）”。"}]}],"synonyms":["baker","woman baker","female baker"],"phonetic":"/ˈbeɪkərəs/","extraExplanation":["“bakeress”里的后缀“-ess”常用来表示“女性……”，如 actress（女演员）、waitress（女服务员）。现代英语中越来越倾向用不分性别的职业名词（如 baker、actor、server），因为更中性、也更符合当代职场语境。","在现代写作中，除非你是在引用历史文本、描写旧时代职业称呼或刻意使用复古语气，一般不建议使用“bakeress”。"]}
{"word":"bakeries","summary":{"en":"“Bakeries” is the plural of “bakery”: shops or places where baked goods are made and sold.","zh":"“bakeries”是“bakery”的复数：指制作并出售烘焙食品的面包店/烘焙店或烘焙区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Shops where bread, cakes, pastries, and other baked goods are made and sold.","zh":"烘焙店；面包店（制作并出售面包、蛋糕、点心等烘焙食品的店）"},"examples":[{"en":"There are several bakeries near the train station.","zh":"火车站附近有好几家面包店。"},{"en":"We stopped at a bakery to buy fresh croissants.","zh":"我们在一家烘焙店停下来买新鲜的可颂。"}]},{"partOfSpeech":"n.","definition":{"en":"Places (or sections of a store) where baked goods are produced, especially in supermarkets or large kitchens.","zh":"烘焙区；烘焙间（尤其指超市或大型厨房里制作烘焙食品的区域）"},"examples":[{"en":"The supermarket’s bakery makes bread every morning.","zh":"这家超市的烘焙区每天早上做面包。"},{"en":"Employees in the bakery start work before sunrise.","zh":"烘焙间的员工在日出前就开始工作。"}]}],"synonyms":["bakeshops","bread shops","pastry shops"],"phonetic":"/ˈbeɪkəriz/","extraExplanation":["“bakeries”是“bakery”的复数形式。单数用法：a bakery；复数用法：two bakeries。","发音小提示：-ry 结尾常读作 /ri/，所以 bakery 听起来像“BAKE-uh-ree”。","文化语境：在美式英语里，bakery 既可以指独立面包店，也常指超市里的“烘焙区”（the bakery）。"]}
{"word":"bakerite","summary":{"en":"Bakerite is a rare mineral name used mainly in geology/mineralogy.","zh":"Bakerite 是一种罕见矿物的名称，主要用于地质/矿物学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (a calcium borosilicate) found in a few places and mainly discussed in geology/mineralogy","zh":"一种罕见矿物（钙硼硅酸盐类），只在少数地点发现，主要用于地质学/矿物学讨论"},"examples":[{"en":"Bakerite is a rare mineral that collectors sometimes look for at old mining sites.","zh":"Bakerite 是一种罕见矿物，收藏者有时会在旧矿区寻找它。"},{"en":"The report lists bakerite among several boron-bearing minerals in the area.","zh":"报告把 bakerite 列为该地区几种含硼矿物之一。"}]}],"synonyms":["(no common synonyms; it’s a proper mineral name)"],"phonetic":"ˈbeɪkəˌraɪt","extraExplanation":["“Bakerite”以 -ite 结尾，常见于矿物名称（如 calcite、granite）。它通常以发现者、研究者或相关地点的姓氏“Baker”来命名。","在日常英语里几乎不用；更多见于矿物学书籍、标本标签或学术文章。"]}
{"word":"bakerless","summary":{"en":"Bakerless means “without a baker” (and more rarely, “not professionally baked”).","zh":"bakerless 指“没有面包师的/缺少烘焙师的”（较少见时也可指“非专业烘焙的”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without a baker; lacking someone whose job is to bake bread, cakes, etc.","zh":"没有面包师的；缺少烘焙师的。"},"examples":[{"en":"After the old bakery closed, the town felt bakerless for months.","zh":"老面包店关门后，小镇有好几个月都像是“没有面包师”一样。"},{"en":"We were bakerless this weekend, so we bought bread instead of making it.","zh":"这个周末我们没人烘焙，所以买了面包而不是自己做。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not made by a baker; homemade or not professionally baked (rare/creative usage).","zh":"非面包师制作的；非专业烘焙的（较少见/较有创意的用法）。"},"examples":[{"en":"These are bakerless cookies—imperfect, but delicious.","zh":"这些饼干不是专业烘焙做的——不完美，但很好吃。"},{"en":"She brought a bakerless loaf from her tiny apartment oven.","zh":"她用小公寓的烤箱带来了一条非专业烤的面包。"}]}],"synonyms":["without a baker","no baker","unstaffed (bakery)","not professionally baked","homemade"],"phonetic":"/ˈbeɪkɚləs/","extraExplanation":["“bakerless”不是常见词，更像是临时造词或文学/口语里的创意表达。英语里“-less”表示“没有……/缺少……”，如 homeless（无家可归的）、sugarless（无糖的）。因此 bakerless 很直观地表达“缺少面包师/没有专业烘焙者”。在正式写作中，更常用的说法是 “without a baker,” “no baker,” 或 “not professionally baked.”"]}
{"word":"bakerlike","summary":{"en":"“Bakerlike” means resembling a baker or having baker-like qualities.","zh":"“bakerlike”表示“像面包师的/具有面包师特征的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a baker or typical of a baker (especially in appearance, manner, or smell).","zh":"像面包师的；具有面包师特征的（尤指外貌、举止或气味）。"},"examples":[{"en":"He had a bakerlike warmth, always offering people something fresh to eat.","zh":"他有一种像面包师般的温暖，总爱给人递上新鲜的吃食。"},{"en":"The room smelled bakerlike, full of yeast and sweet bread.","zh":"房间里有种面包师般的味道，充满了酵母和甜面包的香气。"}]}],"synonyms":["bakerly","bakery-scented","yeasty","flour-dusted"],"phonetic":"/ˈbeɪkərˌlaɪk/","extraExplanation":["“bakerlike”由名词 baker（面包师）+ 后缀 -like 组成，意思是“像……一样/具有……特征”。它不算常见，更常用的表达是 “like a baker” 或用更具体的形容词（如 flour-dusted 沾满面粉的、yeasty 有酵母味的、bakery-scented 有烘焙香的）。"]}
{"word":"bakerly","summary":{"en":"“Bakerly” is usually a brand name for bakery products; as a rare adjective, it means “like a baker; related to baking.”","zh":"“Bakerly”多见为烘焙食品品牌名；作罕见形容词时，意为“像面包师的；与烘焙有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/archaic) Like a baker; relating to baking or the work of a baker.","zh":"（罕见/古语）像面包师的；与烘焙或面包师工作有关的。"},"examples":[{"en":"The old poem mentions a “bakerly” smell drifting through the street.","zh":"那首老诗提到街上飘着一种“面包师般的”香味。"},{"en":"He wore a bakerly apron, dusted with flour.","zh":"他穿着一条带着面粉的、很“面包师风”的围裙。"}]},{"partOfSpeech":"n.","definition":{"en":"A brand name for packaged bakery goods (especially French-style items) sold in the U.S.; often written with a capital B: Bakerly.","zh":"（专有名词）在美国销售的包装烘焙食品品牌名（常见为法式风格产品）；常写作 Bakerly。"},"examples":[{"en":"I bought Bakerly croissants for breakfast.","zh":"我买了 Bakerly 的可颂当早餐。"},{"en":"Bakerly is often found in the bakery or refrigerated section of supermarkets.","zh":"Bakerly 常见于超市的烘焙区或冷藏区。"}]}],"synonyms":["baker’s","bakery-related","baker-like"],"phonetic":"/ˈbeɪkɚli/","extraExplanation":["“bakerly”作为普通形容词非常少见，现代英语里更常用的是“baker’s”（面包师的）、“baker-like”（像面包师的）或“bakery”（面包店/烘焙的）。","如果你是在超市或包装上看到“Bakerly”，那通常是品牌名而不是通用词；品牌名在语义上不一定遵循常规构词规则。"]}
{"word":"Bakerman","summary":{"en":"“Bakerman” usually means a male baker (less common than “baker”) or can be a surname/name.","zh":"“Bakerman”通常指男面包师（不如“baker”常用），也可能是姓氏/名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a man whose job is to bake or sell bread and other baked goods; a male baker (less common than “baker”)","zh":"（较少用）男面包师；烘焙或售卖面包等烘焙食品的男人（不如“baker”常见）"},"examples":[{"en":"The bakerman starts work before dawn to prepare fresh bread.","zh":"面包师在天亮前就开始工作，准备新鲜面包。"},{"en":"A bakerman delivered rolls to the neighborhood every morning.","zh":"一位面包师每天早上把小圆面包送到社区。"}]},{"partOfSpeech":"n.","definition":{"en":"a surname or name (e.g., “Bakerman”)","zh":"姓氏或名字（如“Bakerman”）"},"examples":[{"en":"Ms. Bakerman will lead the meeting today.","zh":"Bakerman 女士今天将主持会议。"},{"en":"I saw the name Bakerman on the mailbox.","zh":"我在邮箱上看到“Bakerman”这个名字。"}]}],"synonyms":["baker","bread seller","bread maker"],"phonetic":"/ˈbeɪkərmæn/","extraExplanation":["“Bakerman”在现代英语里不算常用职业词，更常见的说法是“baker”。写成一个词（Bakerman）也可能是姓氏、品牌名或作品名，需要结合上下文判断。"]}
{"word":"bakers","summary":{"en":"“Bakers” usually means the plural of “baker”: people who bake and often sell bread and other baked goods.","zh":"“bakers”通常是“baker”的复数，指从事烘焙（常也销售）面包、蛋糕等烘焙食品的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people whose job is to bake bread, cakes, and other baked goods (plural of “baker”)","zh":"面包师；烘焙师（baker 的复数）"},"examples":[{"en":"Local bakers start work before sunrise to prepare fresh bread.","zh":"本地的面包师会在日出前开始工作，准备新鲜面包。"},{"en":"The bakers decorated the cupcakes with colorful icing.","zh":"烘焙师用彩色糖霜装饰了纸杯蛋糕。"},{"en":"We bought pastries from a group of bakers at the weekend market.","zh":"我们在周末市集从一群烘焙师那里买了糕点。"}]}],"synonyms":["bread makers","pastry chefs","bakers (plural)"],"phonetic":"/ˈbeɪkərz/","extraExplanation":["“bakers”常出现在短语 **baker’s dozen**（烘焙师的一打）里，意思是 **13个**。传统上为了避免少给、被罚或让顾客满意，面包师会在“一打（12个）”之外多给1个。"]}
{"word":"Bakersfield","summary":{"en":"Bakersfield is a city in California; it can also refer to the influential “Bakersfield sound” style of country music.","zh":"Bakersfield 指加州的一座城市；在音乐语境中也可指影响深远的“贝克斯菲尔德之声”乡村乐风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in Kern County, California, in the southern Central Valley of the United States.","zh":"美国加利福尼亚州克恩县的一座城市，位于中央谷地南部。"},"examples":[{"en":"Bakersfield is about a two-hour drive north of Los Angeles, depending on traffic.","zh":"从洛杉矶开车到贝克斯菲尔德大约两小时，视路况而定。"},{"en":"She moved to Bakersfield for a job in agriculture and logistics.","zh":"她为了农业和物流相关的工作搬到了贝克斯菲尔德。"}]},{"partOfSpeech":"n.","definition":{"en":"In music and culture, a shorthand for the “Bakersfield sound,” a style of country music known for a raw, guitar-forward feel (associated with artists like Buck Owens and Merle Haggard).","zh":"在音乐与文化语境中，常指“贝克斯菲尔德之声”（Bakersfield sound）——一种更直接、吉他更突出的乡村音乐风格（常与巴克·欧文斯、梅尔·哈格德等人相关）。"},"examples":[{"en":"This track has a Bakersfield vibe—bright guitars and a driving rhythm.","zh":"这首歌很有“贝克斯菲尔德”的味道：明亮的吉他和强劲的节奏。"},{"en":"He grew up listening to Bakersfield sound records.","zh":"他从小听“贝克斯菲尔德之声”的唱片长大。"}]}],"phonetic":"ˈbeɪkərzˌfiːld","extraExplanation":["“Bakersfield”是专有名词（地名），写作时首字母大写；通常不加冠词（不说 *the Bakersfield*），但可以说 *the Bakersfield area*（贝克斯菲尔德地区）。","词源上，这个地名来自早期定居者/土地拥有者的姓氏（Baker），后缀 *-field* 意为“田野、土地”。","在美国文化里，除了地理位置外，它也常因乡村音乐传统与“Bakersfield sound”而被提及，这是一种与纳什维尔风格相对、更加朴实硬朗的声音。"]}
{"word":"bakersfield","summary":{"en":"Bakersfield is a city in California’s Central Valley (U.S.).","zh":"Bakersfield 是美国加州中央谷地的一座城市（贝克斯菲尔德）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in Kern County, California, in the southern part of the Central Valley (U.S.).","zh":"贝克斯菲尔德（Bakersfield）：美国加利福尼亚州克恩县的一座城市，位于加州中央谷地南部。"},"examples":[{"en":"My cousin lives in Bakersfield, about two hours north of Los Angeles.","zh":"我表亲住在贝克斯菲尔德，离洛杉矶往北大约两小时车程。"},{"en":"Bakersfield is known for its hot, dry summers.","zh":"贝克斯菲尔德以炎热、干燥的夏天著称。"},{"en":"We drove through Bakersfield on our way to Sequoia National Park.","zh":"我们去红杉国家公园的路上开车经过了贝克斯菲尔德。"}]}],"synonyms":["Bakersfield, California"],"phonetic":"/ˈbeɪkərzˌfiːld/","extraExplanation":["“Bakersfield”常作为地名使用，首字母大写；作形容词时可写作“Bakersfield + 名词”（如 Bakersfield area 贝克斯菲尔德地区）。","文化上有“Bakersfield sound（贝克斯菲尔德之声）”，指20世纪中期在当地兴起的一种乡村音乐风格，与纳什维尔更偏“柔和、管弦”的风格相比，它更直接、吉他更突出（常提到 Buck Owens、Merle Haggard 等）。","该地也常与加州农业、石油产业以及中央谷地的地理与气候特点联系在一起。"]}
{"word":"bakership","summary":{"en":"“Bakership” (rare) means the baker’s trade or the state of being a baker.","zh":"“Bakership”（较少用）指面包师的行业/职业，或做面包师的身份。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the occupation, trade, or business of a baker; the state of being a baker (rare/old-fashioned).","zh":"（较少用/略旧）面包师的职业或行业；做面包师的身份/状态。"},"examples":[{"en":"He learned bakership from his father and later opened a small shop.","zh":"他从父亲那里学会了做面包师这一行，后来开了一家小店。"},{"en":"In older writing, “bakership” can mean the baker’s trade rather than a building.","zh":"在较早的写法里，“bakership”常指面包师这一行，而不是某栋建筑。"}]}],"synonyms":["baking","the baking trade","baker’s trade","baking profession"],"phonetic":"ˈbeɪkərˌʃɪp","extraExplanation":["“bakership”在现代英语里不常见，更常用的是“baking”（烘焙/烘焙工作）或“the baking trade”（烘焙行业）。","后缀“-ship”常用来构成抽象名词，表示“身份、状态、职业或关系”（如：friendship 友谊，leadership 领导力）。因此 bakership 字面上就是“面包师的身份/行业”。"]}
{"word":"Bakerstown","summary":{"en":"Bakerstown is a proper noun used as the name of a town or community.","zh":"Bakerstown是用作城镇或社区名称的专有名词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun): the name of a town or community called “Bakerstown.”","zh":"地名（专有名词）：“Bakerstown”这一城镇或社区的名称。"},"examples":[{"en":"I grew up near Bakerstown, so I know the area well.","zh":"我在Bakerstown附近长大，所以对那一带很熟。"},{"en":"The meeting will be held at the library in Bakerstown.","zh":"会议将在Bakerstown的图书馆举行。"}]}],"synonyms":["(place name)"],"phonetic":"/ˈbeɪkərz.taʊn/","extraExplanation":["“Bakerstown”是英语常见的地名构词：Baker（面包师/姓氏）+ -town（城镇）。很多美国地名用“某人的姓氏 + town”来表示“某人建立或与之相关的城镇”。","由于不同州可能都有同名地点，具体指哪里通常要看上下文（例如州名、县名或邮编）。"]}
{"word":"Bakersville","summary":{"en":"Bakersville is a U.S. place name, most often referring to Bakersville, North Carolina.","zh":"Bakersville 是美国的地名，最常指北卡罗来纳州的贝克斯维尔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun): the name of several towns/communities in the United States, most commonly referring to Bakersville, North Carolina.","zh":"地名（专有名词）：美国若干城镇/社区的名称，最常见指美国北卡罗来纳州的 Bakersville（贝克斯维尔）。"},"examples":[{"en":"We drove through Bakersville on our way to the mountains.","zh":"我们去山区的路上开车经过了贝克斯维尔。"},{"en":"She lives near Bakersville, North Carolina.","zh":"她住在北卡罗来纳州贝克斯维尔附近。"}]}],"synonyms":["(proper noun) place name","town/community name"],"phonetic":"/ˈbeɪkərzˌvɪl/","extraExplanation":["“Bakersville”不是一个常见英语词汇，而是地名，因此通常首字母大写。","美国有不止一个叫 Bakersville 的地方（例如北卡罗来纳州、加利福尼亚州等），阅读或查地图时要结合州名/上下文来确认具体指哪一个。","这类地名常来自早期定居者的姓氏（如 Baker）+ “-ville”（表示“城镇/聚落”）。"]}
{"word":"Bakerton","summary":{"en":"Bakerton is most commonly a proper noun used as a place name, and it can also be a surname.","zh":"Bakerton最常见是地名（专有名词），也可以用作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun), used for towns or small communities called “Bakerton.”","zh":"地名（专有名词）：用于名为“Bakerton”的城镇或小型社区。"},"examples":[{"en":"She grew up in Bakerton before moving to the city.","zh":"她在Bakerton长大，后来搬去了城市。"},{"en":"Bakerton is a small place, so most people know each other.","zh":"Bakerton是个小地方，所以大多数人彼此都认识。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"姓氏。"},"examples":[{"en":"Ms. Bakerton will lead today’s meeting.","zh":"Bakerton女士将主持今天的会议。"}]}],"synonyms":["—"],"phonetic":"/ˈbeɪkərtən/","extraExplanation":["“-ton”常见于英语地名，源自古英语，常表示“城镇/村庄/聚居地”（类似“镇、村”）。因此Bakerton这类词形看起来很像地名。","发音通常按拼写读作“BAKER + ton”，即“烘焙师/面包师（baker）+ 镇（-ton）”。不同地区可能有轻微口音差异。"]}
{"word":"Bakery","summary":{"en":"A bakery is a place where baked goods like bread and cakes are made and sold.","zh":"Bakery 指制作并出售面包、蛋糕等烘焙食品的地方，也可指商店/超市/酒店里的烘焙部门。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a shop where bread, cakes, and other baked goods are made and sold","zh":"面包店；烘焙坊（制作并出售面包、蛋糕等烘焙食品的店）"},"examples":[{"en":"I stopped by the bakery to buy fresh bread.","zh":"我去面包店买了新鲜面包。"},{"en":"This bakery is famous for its croissants.","zh":"这家烘焙坊的可颂很有名。"}]},{"partOfSpeech":"n.","definition":{"en":"the room, area, or business where baking is done (often as part of a larger store or factory)","zh":"烘焙间；烘焙部门；烘焙业（进行烘焙工作的区域或业务）"},"examples":[{"en":"The supermarket has its own bakery in the back.","zh":"这家超市后面有自己的烘焙区。"},{"en":"She works in the bakery at a hotel.","zh":"她在一家酒店的烘焙部门工作。"}]}],"synonyms":["bakeshop","pastry shop"],"phonetic":"/ˈbeɪkəri/","extraExplanation":["在英语里，bakery 通常强调“店/部门”的概念；如果强调“烘焙食品”，常用 baked goods 或 pastries（偏甜点）。","常见搭配：bakery shop（面包店）、in-store bakery（店内烘焙区）、artisan bakery（手工烘焙坊）、bakery aisle（超市烘焙区那一排）。"]}
{"word":"bakery","summary":{"en":"A bakery is a place where baked goods are made and sold, or the baking area itself.","zh":"bakery 指制作并售卖烘焙食品的店，也可指进行烘焙的场所/部门。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A shop where bread, cakes, cookies, and other baked goods are made and sold.","zh":"面包店；烘焙坊（制作并售卖面包、蛋糕、饼干等烘焙食品的店）"},"examples":[{"en":"I stopped by the bakery to buy fresh bread.","zh":"我去面包店买了新鲜的面包。"},{"en":"This bakery is famous for its chocolate croissants.","zh":"这家烘焙坊以巧克力可颂很有名。"},{"en":"The bakery opens at 7 a.m., so you can grab breakfast there.","zh":"这家面包店早上7点开门，所以你可以在那里买早餐。"}]},{"partOfSpeech":"n.","definition":{"en":"The place or room where baking is done, especially in a restaurant, hotel, or factory.","zh":"烘焙间；烘焙工房（尤指餐厅、酒店或工厂里进行烘焙的场所）"},"examples":[{"en":"Only staff are allowed in the bakery behind the café.","zh":"咖啡馆后面的烘焙间只允许员工进入。"},{"en":"The smell from the bakery filled the whole building.","zh":"烘焙间的香味充满了整栋楼。"}]}],"synonyms":["bakeshop","bread shop","pastry shop"],"phonetic":"/ˈbeɪkəri/","extraExplanation":["在北美，“bakery”既可指街边面包店（常卖面包、甜点、咖啡），也可指大型工厂的烘焙部门。常见搭配：a neighborhood bakery（社区面包店）、a wholesale bakery（批发烘焙厂）、bakery section（烘焙区，超市里常见）。","词源提示：bakery 来自 bake（烘烤）+ -ery（表示“场所/行业”的后缀，如 brewery 啤酒厂）。"]}
{"word":"bakery-related","summary":{"en":"Bakery-related means connected with a bakery or the baking business (products, work, costs, equipment, etc.).","zh":"bakery-related 指与面包店或烘焙行业相关的（产品、工作、成本、设备等）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with a bakery or with making/selling baked goods (such as bread, cakes, and pastries).","zh":"与面包店或烘焙食品（如面包、蛋糕、酥点）的制作、销售有关的。"},"examples":[{"en":"We discussed bakery-related costs like flour, butter, and packaging.","zh":"我们讨论了与烘焙相关的成本，比如面粉、黄油和包装。"},{"en":"She has bakery-related work experience, including making pastries and serving customers.","zh":"她有与烘焙相关的工作经验，包括制作酥点和接待顾客。"},{"en":"The shop sells bakery-related equipment such as mixers and baking trays.","zh":"这家店出售与烘焙相关的设备，比如搅拌机和烤盘。"}]}],"synonyms":["baking-related","bakery-associated","baking-associated","bakeshop-related"],"phonetic":"/ˈbeɪkəri rɪˈleɪtɪd/","extraExplanation":["“bakery-related”是由名词“bakery（面包店/烘焙坊）”+“related（相关的）”构成的复合形容词，常用连字符连接，尤其在名词前作定语：bakery-related products / bakery-related business。","在更正式或更长的表达中，也可用“related to bakeries”或“related to baking”替换；“bakery-related”更偏向“面包店/烘焙行业层面”，而“baking-related”更偏向“烘焙这个动作/技能层面”。"]}
{"word":"bakery-scented","summary":{"en":"“Bakery-scented” means smelling like a bakery—warm bread or sweet baked goods.","zh":"“bakery-scented”指“闻起来像面包店/烘焙坊一样”的香味，多为热面包或甜点的温暖甜香。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Smelling like a bakery (for example, warm bread, butter, vanilla, cinnamon, or fresh pastries).","zh":"带有烘焙坊/面包店气味的（例如热面包、黄油、香草、肉桂或刚出炉甜点的香味）。"},"examples":[{"en":"The apartment felt cozy, bakery-scented, and warm.","zh":"这间公寓让人觉得很舒服，带着烘焙坊的香气，又很温暖。"},{"en":"She lit a bakery-scented candle that smelled like vanilla and cinnamon rolls.","zh":"她点了一支烘焙坊香氛蜡烛，闻起来像香草和肉桂卷。"}]}],"synonyms":["bready-smelling","fresh-baked","pastry-scented","vanilla-scented","cinnamon-scented"],"phonetic":"/ˈbeɪkəri ˌsɛntɪd/","extraExplanation":["“bakery-scented”是由名词+过去分词（bakery + scented）构成的复合形容词，常用于描写“氛围感”的气味：温暖、甜香、让人放松，常见于广告文案、家居香氛、小说描写等。","写作上也常见类似结构：coffee-scented（咖啡香的）、rain-scented（带雨后气味的）、smoke-scented（带烟味的）。","注意：它通常表达“好闻的烘焙香”，如果想强调“油烟味/面粉味”等更具体的气味，可以改写为 “smelling of flour/grease” 或 “with a yeasty smell”。"]}
{"word":"Bakes","summary":{"en":"“Bakes” usually means “cooks in an oven” (he/she/it bakes). It can also mean “gets extremely hot,” especially in the sun.","zh":"“bakes”通常表示“（他/她/它）烘烤、烤制（在烤箱里）”。也可表示“（在阳光下等）被晒得很热、发烫”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"third-person singular form of “bake”: to cook food (especially bread, cakes, cookies) using dry heat in an oven","zh":"“bake”的第三人称单数：用干热（通常在烤箱里）把食物烤熟（尤指面包、蛋糕、饼干等）"},"examples":[{"en":"She bakes bread every Sunday.","zh":"她每个星期天都烤面包。"},{"en":"He bakes the cookies for 12 minutes.","zh":"他把饼干烤12分钟。"},{"en":"This recipe bakes best at 350°F (175°C).","zh":"这个食谱在350华氏度（约175摄氏度）烤效果最好。"}]},{"partOfSpeech":"v.","definition":{"en":"to become very hot because of strong heat or sunlight (informal)","zh":"（非正式）因强烈热量或阳光而变得很热、被晒得发烫"},"examples":[{"en":"The sidewalk bakes in the summer sun.","zh":"人行道在夏日阳光下晒得发烫。"},{"en":"The car bakes if you leave it in the sun.","zh":"车子如果停在太阳下，会被晒得很热。"}]}],"synonyms":["roasts","cooks","heats","broils (US, for strong top heat)"],"phonetic":"/beɪks/","extraExplanation":["“bakes”常见于现在时第三人称单数（he/she/it bakes）。也可用于描述东西在太阳下“烤晒”般变热，这个用法更偏口语、形象表达。","搭配很常见：bake bread/cake/cookies；bake at 350°F；bake for 20 minutes。"]}
{"word":"bakes","summary":{"en":"“Bakes” most commonly means “cooks in an oven” (third-person singular of bake). It can also mean “is made very hot by the sun/heat,” and less commonly refers to homemade baked goods.","zh":"“bakes”最常见是 bake 的第三人称单数，表示“用烤箱烘烤”。也可表示“被太阳/高温晒得很热”，较少见时可指自制烘焙点心等。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(third-person singular of “bake”) to cook food with dry heat, usually in an oven.","zh":"（动词 bake 的第三人称单数）用干热烹调食物，通常指用烤箱烘烤。"},"examples":[{"en":"She bakes bread every weekend.","zh":"她每个周末都会烤面包。"},{"en":"This recipe bakes at 350°F for 30 minutes.","zh":"这个食谱需要在 350°F（约175°C）下烘烤30分钟。"}]},{"partOfSpeech":"v.","definition":{"en":"(of the sun/heat) to make something very hot; to feel uncomfortably hot.","zh":"（指太阳/高温）使……被晒得很热；（人）热得难受。"},"examples":[{"en":"The sun bakes the pavement all afternoon.","zh":"太阳整个下午把路面晒得发烫。"},{"en":"It bakes in this room with the windows closed.","zh":"窗户关着，这个房间热得像在烤。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural noun, less common) baking sessions or baked items, especially homemade baked goods.","zh":"（复数名词，较少见）烘焙活动/一炉炉烘烤；也可指自制烘焙食品（点心等）。"},"examples":[{"en":"Her weekend bakes usually include cookies and muffins.","zh":"她周末做的烘焙通常有饼干和玛芬。"}]}],"synonyms":["roasts","cooks","toasts","heats","scorches"],"phonetic":"/beɪks/","extraExplanation":["“bakes”最常见是动词“bake”的第三人称单数形式（he/she/it bakes）。英式和美式都常用“baked goods”指“烘焙食品”；口语里也会用“home bakes”来指家里做的点心。"]}
{"word":"bakeshop","summary":{"en":"A bakeshop is a shop (bakery) that makes and sells baked goods like bread and cakes.","zh":"bakeshop 指制作并出售面包、蛋糕等烘焙食品的店（即面包店/烘焙坊）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small shop where bread, cakes, pastries, and other baked goods are made and sold; a bakery.","zh":"烘焙店；面包店（制作并出售面包、蛋糕、点心等烘焙食品的店铺）；烘焙坊。"},"examples":[{"en":"I stopped by the bakeshop for fresh bread on my way home.","zh":"我回家路上去烘焙店买了新鲜面包。"},{"en":"The bakeshop window was filled with cookies and small cakes.","zh":"烘焙店的橱窗里摆满了饼干和小蛋糕。"},{"en":"This neighborhood bakeshop has been open for 30 years.","zh":"这家社区烘焙店已经开了30年。"}]}],"synonyms":["bakery","pastry shop","bakehouse"],"phonetic":"/ˈbeɪkˌʃɑp/","extraExplanation":["“bakeshop”在美式英语里能用，但更常见、更中性的说法是“bakery”。“bakeshop”有时给人一种“小店、手作、老式”的感觉。","常见搭配：bakeshop/bakery near me（附近的面包店）、local bakeshop（本地烘焙店）、artisan bakery（手工烘焙店）、pastry shop（偏甜点的店）。"]}
{"word":"bakeshops","summary":{"en":"“Bakeshops” means multiple bake shops—stores that bake and sell bread, cakes, and other baked goods.","zh":"“bakeshops”指多家烘焙店，即烘焙并售卖面包、蛋糕等烘焙食品的店铺。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plural form of “bake shop”: shops that bake and sell bread, cakes, cookies, and other baked goods","zh":"“bake shop”的复数：烘焙并出售面包、蛋糕、饼干等烘焙食品的店铺"},"examples":[{"en":"There are several bakeshops near the station that sell fresh bread every morning.","zh":"车站附近有好几家烘焙店，每天早上都卖新鲜面包。"},{"en":"Local bakeshops often make traditional pastries for holidays.","zh":"本地的烘焙店经常在节日制作传统点心。"}]}],"synonyms":["bakeries","pastry shops","bake shops"],"phonetic":"/ˈbeɪkˌʃɑps/","extraExplanation":["“bakeshops”在英文里更常写成分开或加连字符的形式：bake shops / bake-shops；最常见、最自然的说法通常是“bakery”（面包店/烘焙坊）。","语感上，“bake shop”强调“烘焙并售卖的店”；而“bakery”既可指店铺，也可指烘焙工坊（生产场所），使用范围更广。"]}
{"word":"bakestone","summary":{"en":"A bakestone is a flat stone used for baking bread or cakes, like a traditional griddle or baking stone.","zh":"bakestone 指用于烘烤面包或饼的平石板，类似传统铁板或烤石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A flat stone (or stone slab) used for baking, especially for baking bread or cakes over a fire; similar in function to a griddle or baking stone.","zh":"（用于烘烤的）烤石／烤板：一种平坦的石板，用来在火上或炉边烤面包、饼等；功能类似于铁板或烤盘。"},"examples":[{"en":"The villagers cooked oatcakes on a bakestone by the hearth.","zh":"村民们在壁炉边用烤石烤燕麦饼。"},{"en":"In old kitchens, a bakestone was heated before the dough was placed on it.","zh":"在旧式厨房里，会先把烤石烧热，再把面团放上去。"}]}],"synonyms":["baking stone","griddle","hot stone","stone griddle","pizza stone"],"phonetic":"/ˈbeɪkˌstoʊn/","extraExplanation":["“bakestone”多见于英国（尤其是威尔士与英格兰部分地区）的历史/方言语境，也常写作“bake-stone”。在现代英语里更常用的说法是“baking stone / pizza stone”（烤石/披萨石）或“griddle”（铁板）。"]}
{"word":"bakeware","summary":{"en":"Bakeware means the pans, trays, and dishes you use for baking in an oven.","zh":"Bakeware 指用于烤箱烘焙的烤盘、烤模、烤碟等器具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Tools and containers used for baking in an oven, such as pans, trays, and baking dishes.","zh":"烘焙器具；烘焙用的容器（如烤盘、烤模、烤碟等），用于烤箱烘烤。"},"examples":[{"en":"I bought new bakeware to make brownies and muffins.","zh":"我买了新的烘焙器具来做布朗尼和玛芬。"},{"en":"Nonstick bakeware makes it easier to remove cakes without breaking them.","zh":"不粘烘焙器具能让蛋糕更容易脱模、不容易碎。"},{"en":"Glass bakeware can cook differently than metal, so watch the baking time.","zh":"玻璃烘焙器具的受热方式可能和金属不同，所以要留意烘烤时间。"}]}],"synonyms":["baking pans","baking equipment","ovenware"],"phonetic":"/ˈbeɪkˌwɛr/","extraExplanation":["“bakeware”是由“bake（烘烤）+ ware（器皿/用品）”组成的复合词。英语里常见类似构词：cookware（炊具）、tableware（餐具）、silverware（银器/刀叉餐具，主要是美式用法）。","使用场景上，“bakeware”通常特指进烤箱用的器具；而“cookware”更偏向炉灶（平底锅、汤锅等）。购买时常会看到材质分类：metal/aluminum（导热快）、glass（保温性强）、ceramic（适合焗烤）、silicone（柔软易脱模）。"]}
{"word":"Bakewell","summary":{"en":"Bakewell is a town in Derbyshire, England, and it also refers to a famous British dessert (Bakewell tart).","zh":"Bakewell 是英国德比郡的一座城镇，也常指一种著名的英国甜点（贝克韦尔挞）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small market town in Derbyshire, England, in the Peak District, known as a tourist base and for its food traditions (especially the Bakewell tart/pudding).","zh":"英国英格兰德比郡（Derbyshire）的一座小集镇，位于峰区国家公园（Peak District），以旅游和地方美食传统著名（尤其是 Bakewell tart / Bakewell pudding）。"},"examples":[{"en":"We stopped in Bakewell for a walk by the river and a cup of tea.","zh":"我们在贝克韦尔停下来，沿河散步并喝了杯茶。"},{"en":"Bakewell is a popular place to visit when you’re exploring the Peak District.","zh":"探索峰区时，贝克韦尔是很受欢迎的旅游地点。"}]},{"partOfSpeech":"n.","definition":{"en":"(short for “Bakewell tart”) a traditional British dessert made with a pastry base, jam, and an almond filling, named after the town of Bakewell.","zh":"（“Bakewell tart”的简称）一种传统英国甜点：酥皮底加果酱与杏仁馅（常见为杏仁奶油馅），因贝克韦尔镇而得名。"},"examples":[{"en":"I bought a Bakewell from the bakery—sweet jam and almond on top.","zh":"我从面包店买了一个贝克韦尔挞——上面有甜果酱和杏仁。"},{"en":"For dessert, she served Bakewells with tea.","zh":"甜点她端上了贝克韦尔挞配茶。"}]}],"synonyms":["Bakewell tart"],"phonetic":"/ˈbeɪk.wɛl/","extraExplanation":["在英国饮食语境里，Bakewell 常让人联想到两种甜点：Bakewell tart（常见做法是酥皮+果酱+杏仁奶油馅，上面可能有杏仁片或糖霜）以及 Bakewell pudding（更像湿润的布丁/馅饼口感）。不同店家与地区配方会有差异。","作为地名时，Bakewell 的发音与拼写固定；在旅游宣传或菜单上看到 Bakewell，通常要根据上下文判断是“地名”还是“甜点”。"]}
{"word":"Bakhmut","summary":{"en":"Bakhmut is a city in eastern Ukraine, often mentioned in English news because of major fighting there, and it can also refer to the Battle of Bakhmut.","zh":"Bakhmut（巴赫穆特）是乌克兰东部的一座城市；在英语新闻中常因当地激烈战事而被提及，也可指“巴赫穆特战役”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in eastern Ukraine (Donetsk Oblast), known internationally in recent years as a major location in the Russia–Ukraine war; it is also a regional center for salt and wine-making industries.","zh":"乌克兰东部顿涅茨克州的一座城市；近年因俄乌战争中的重要战场而广为人知，也与当地的盐业和葡萄酒产业有关。"},"examples":[{"en":"Bakhmut became a symbol of heavy fighting during the Russia–Ukraine war.","zh":"巴赫穆特在俄乌战争中成为激烈战斗的象征。"},{"en":"Before the war, some people knew Bakhmut for its salt mines and local sparkling wine.","zh":"战前，一些人因盐矿和当地起泡酒而知道巴赫穆特。"}]},{"partOfSpeech":"n.","definition":{"en":"The Battle of Bakhmut: the extended series of battles and military operations in and around the city, widely reported in news and analysis.","zh":"“巴赫穆特战役”：围绕该市及其周边持续进行的一系列战斗与军事行动，常见于新闻与评论。"},"examples":[{"en":"Many reports describe the Battle of Bakhmut as a long and costly campaign.","zh":"许多报道将巴赫穆特战役描述为一场漫长且代价高昂的战役。"},{"en":"Analysts debated the strategic value of holding Bakhmut.","zh":"分析人士就坚守巴赫穆特的战略价值展开讨论。"}]}],"synonyms":["Artemivsk (historical name)","Artyomovsk (Russian-language variant)"],"phonetic":"ˈbɑkmuːt","extraExplanation":["“Bakhmut”是英语中常见的乌克兰地名转写形式；你也可能看到“Artemivsk/Artyomovsk（阿尔乔莫夫斯克）”，这是苏联时期及部分俄语语境中使用的旧称。","作为地名，它在英语里通常不加冠词（不说 *the Bakhmut*），可以用作地点状语：in Bakhmut / near Bakhmut。新闻中也常用“Bakhmut”指代该地的战线或战区（转喻用法）。"]}
{"word":"bakhshi","summary":{"en":"Bakhshi is a term that can mean either a Central Asian epic singer/storyteller or (historically) a Mughal military paymaster/administrator.","zh":"Bakhshi一词可指中亚的史诗歌手/说书艺人，也可（历史上）指莫卧儿时期负责军饷与军务行政的官员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Central Asia) A traditional folk performer—often an epic singer, storyteller, and sometimes a healer/shamanic figure—who performs long oral poems with music.","zh":"（中亚）一种传统民间艺人——常是史诗歌手、讲述者，有时也带有治病或萨满式角色——以音乐伴奏表演长篇口头史诗。"},"examples":[{"en":"The bakhshi performed an epic that lasted for hours, accompanied by a lute-like instrument.","zh":"这位bakhshi在类似鲁特琴的乐器伴奏下表演了一部持续数小时的史诗。"},{"en":"In the village, people invited a bakhshi to sing stories of heroes at the wedding.","zh":"在村里，人们请来一位bakhshi在婚礼上吟唱英雄故事。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical, South Asia) A military administrator/paymaster in the Mughal period; an official responsible for army records, salaries, or recruitment (often spelled bakshi).","zh":"（历史用语，南亚）莫卧儿时期的军政官员/军饷官；负责军队名册、薪饷或征募等事务（常拼作 bakshi）。"},"examples":[{"en":"The bakhshi kept careful records of soldiers and their pay.","zh":"这位bakhshi仔细记录士兵名册和军饷。"},{"en":"In some histories of the Mughal court, the office is written as “bakshi.”","zh":"在一些莫卧儿宫廷史著中，这个官职会写作“bakshi”。"}]}],"synonyms":["bard","minstrel","storyteller","epic singer","paymaster","military administrator"],"phonetic":"/ˈbɑːkʃi/","extraExplanation":["“bakhshi”在不同地区含义差异较大：在乌兹别克、土库曼等中亚语境中更常指民间史诗歌手/说唱艺人；在南亚史料里则常见拼写“bakshi”，指军队行政与军饷相关的官职。阅读时可根据国家/时代判断。","在中亚文学与民俗研究中，bakhshi 常与口头传统（oral tradition）相关，表演内容可能包括英雄史诗、家族传说与道德故事。"]}
{"word":"Bakhtiari","summary":{"en":"Bakhtiari refers to an Iranian ethnic group, their language (a Luri variety), or anything related to their culture.","zh":"Bakhtiari 指伊朗的巴赫蒂亚里人、他们的语言（常被视为卢尔语的一种），或与其文化相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Bakhtiari people, an Iranian ethnic group traditionally known for pastoral nomadism in the Zagros Mountains (southwestern Iran)","zh":"巴赫蒂亚里人（伊朗的一个民族群体，传统上以扎格罗斯山脉〔伊朗西南部〕的游牧放牧生活著称）"},"examples":[{"en":"The Bakhtiari have a long history in southwestern Iran.","zh":"巴赫蒂亚里人在伊朗西南部有着悠久的历史。"},{"en":"A Bakhtiari family may move seasonally with their herds.","zh":"巴赫蒂亚里家庭可能会随着牲畜进行季节性迁徙。"}]},{"partOfSpeech":"n.","definition":{"en":"the Bakhtiari language/dialect (often considered a variety of Luri) spoken by many Bakhtiari people","zh":"巴赫蒂亚里语（常被视为卢尔语〔Luri〕的一种方言，许多巴赫蒂亚里人使用）"},"examples":[{"en":"He can speak Bakhtiari as well as Persian.","zh":"他既会说巴赫蒂亚里语，也会说波斯语。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Bakhtiari people, their culture, or their language","zh":"巴赫蒂亚里的；与巴赫蒂亚里人、其文化或语言有关的"},"examples":[{"en":"Bakhtiari music often features strong rhythms.","zh":"巴赫蒂亚里的音乐常常节奏鲜明。"},{"en":"They studied Bakhtiari migration routes in the Zagros.","zh":"他们研究了扎格罗斯山区巴赫蒂亚里人的迁徙路线。"}]}],"synonyms":["Bakhtiari people","Bakhtiari language","Luri (related)"],"phonetic":"/bɑkˈtiɑri/","extraExplanation":["“Bakhtiari”通常指伊朗西南部的一个部族联盟/民族群体，历史上以“季节性迁徙放牧”（游牧或半游牧）闻名，相关研究常涉及扎格罗斯山脉的跨季节迁徙路线。","英语里它多作为专有名词使用，首字母常大写；也可用作姓氏或地名相关用法，需依上下文判断。"]}
{"word":"bakhtiari","summary":{"en":"Bakhtiari refers to an ethnic group in southwestern Iran, their language, or anything related to them.","zh":"Bakhtiari 指伊朗西南部的巴赫蒂亚里族群、其语言，或与其相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Bakhtiari people, a Lur (Iranian) ethnic group in southwestern Iran","zh":"巴赫蒂亚里人（伊朗西南部的卢尔族/伊朗语族族群之一）成员"},"examples":[{"en":"Many Bakhtiari families traditionally practiced seasonal migration between summer and winter pastures.","zh":"许多巴赫蒂亚里家庭传统上会在夏季与冬季牧场之间进行季节性迁徙。"},{"en":"She is Bakhtiari and grew up hearing tribal songs and stories at home.","zh":"她是巴赫蒂亚里人，从小在家里听部落歌曲和故事长大。"}]},{"partOfSpeech":"n.","definition":{"en":"the Bakhtiari language (often considered a dialect of Luri), spoken by many Bakhtiari people","zh":"巴赫蒂亚里语（常被视为卢尔语的一种方言），为许多巴赫蒂亚里人使用"},"examples":[{"en":"He can speak Bakhtiari as well as Persian.","zh":"他会说巴赫蒂亚里语，也会说波斯语。"},{"en":"Some words in Bakhtiari are close to other Luri varieties.","zh":"巴赫蒂亚里语里的一些词与其他卢尔语变体很接近。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Bakhtiari people, their culture, or their language","zh":"与巴赫蒂亚里人、其文化或语言有关的"},"examples":[{"en":"The museum has a small collection of Bakhtiari rugs.","zh":"这家博物馆收藏了一小批巴赫蒂亚里地毯。"},{"en":"Bakhtiari music often features strong rhythms suited for dancing.","zh":"巴赫蒂亚里音乐常有适合舞蹈的强烈节奏。"}]}],"synonyms":["Bakhtiyari"],"phonetic":"/ˌbækˈtiːɑːri/","extraExplanation":["“Bakhtiari”也常拼作“Bakhtiyari”。它不仅指族群与语言，也常用于指与其相关的地毯（Bakhtiari rugs）、传统迁徙生活方式与部落历史等文化元素。"]}
{"word":"Bakhtiyari","summary":{"en":"Bakhtiyari refers to an Iranian tribal people (and their dialect) from southwestern Iran, and it can also mean “related to them.”","zh":"Bakhtiyari 指伊朗西南部的巴赫蒂亚里部族人（及其方言），也可作形容词表示“与其相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a large Lur-speaking tribal group in southwestern Iran, traditionally known for pastoral nomadism","zh":"（伊朗西南部）巴赫蒂亚里人：一个讲卢尔语（Luri）的大型部族群体成员，传统上以游牧放牧生活闻名"},"examples":[{"en":"The Bakhtiyari have a long history in the Zagros Mountains.","zh":"巴赫蒂亚里人在扎格罗斯山脉有着悠久的历史。"},{"en":"A researcher recorded Bakhtiyari migration routes for a cultural project.","zh":"一位研究者为文化项目记录了巴赫蒂亚里人的迁徙路线。"}]},{"partOfSpeech":"n.","definition":{"en":"the Iranian dialect/variety spoken by the Bakhtiyari people (often written as Bakhtiari)","zh":"巴赫蒂亚里语/方言：巴赫蒂亚里人使用的伊朗语支方言（常拼作 Bakhtiari）"},"examples":[{"en":"She can understand Bakhtiyari as well as other Luri varieties.","zh":"她能听懂巴赫蒂亚里语，也能听懂其他卢尔语变体。"},{"en":"The story was translated into Bakhtiyari to reach local audiences.","zh":"这篇故事被翻译成巴赫蒂亚里语，以便接触当地读者。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Bakhtiyari people, their culture, or their dialect","zh":"巴赫蒂亚里（的）：与巴赫蒂亚里人、其文化或其方言相关的"},"examples":[{"en":"Bakhtiyari music often features strong rhythms and local instruments.","zh":"巴赫蒂亚里音乐常有鲜明的节奏和地方乐器。"},{"en":"They visited a Bakhtiyari village during their trip to Iran.","zh":"他们在伊朗旅行时参观了一个巴赫蒂亚里村庄。"}]}],"synonyms":["Bakhtiari"],"phonetic":"/ˌbɑk.tiˈjɑr.i/","extraExplanation":["“Bakhtiyari”更常见的英文拼写是“Bakhtiari”。中文常见译名有“巴赫蒂亚里”。","巴赫蒂亚里人主要分布在伊朗西南部的扎格罗斯山区一带（如恰哈马哈勒-巴赫蒂亚里省及周边）。他们在伊朗近现代历史与地方社会结构中具有影响力。","英语里该词多出现在人类学、历史、地理与音乐文化等语境中；作为形容词时通常直接放在名词前（如 Bakhtiyari tribe / Bakhtiyari dialect）。"]}
{"word":"Bakhytzhan Baikadamov","summary":{"en":"A Kazakh personal name, often referring to a Soviet-era Kazakh composer connected with choral music.","zh":"哈萨克人名，常指与合唱音乐相关的苏联时期哈萨克作曲家。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A Kazakh personal name; most commonly refers to Bakhytzhan Baikadamov, a Soviet-era Kazakh composer and choral music figure.","zh":"一个哈萨克人名；最常见指苏联时期的哈萨克作曲家、合唱音乐人物巴赫特詹·拜卡达莫夫。"},"examples":[{"en":"Our music history class briefly discussed Bakhytzhan Baikadamov and Kazakh choral traditions.","zh":"我们的音乐史课简要提到了巴赫特詹·拜卡达莫夫以及哈萨克合唱传统。"},{"en":"The program notes mentioned Baikadamov as a composer from Kazakhstan in the Soviet period.","zh":"节目单说明提到拜卡达莫夫是苏联时期来自哈萨克斯坦的作曲家。"}]}],"phonetic":"/bɑːˈhiːtʒɑːn baɪˈkɑːdəˌmɔːv/","extraExplanation":["读法提示：英语语境里常把 Bakhytzhan 读成近似“bah-HEET-zhahn”，Baikadamov 读成近似“bye-KAH-duh-mov”。实际发音会因哈萨克语/俄语口音而变化。","如果你是在找某一位具体人物（例如作曲家、学者或运动员），最好补充一句领域或作品名，我可以帮你确认对应人物与常见中文译名。"],"etymology":"这是一个从哈萨克语/俄语转写到拉丁字母的姓名：Bakhytzhan（常见也写作 Bakytzhan）+ Baikadamov（俄语式姓氏拼写常见 -ov 结尾）。不同资料的拼写差异通常来自不同的转写体系。","mnemonic":["把 Bakhytzhan 拆成 “bakhyt + zhan”：很多突厥语人名里 -zhan/-jan 有“亲爱的/灵魂”的感觉，可联想成“幸福（bakhyt）+ 真（zhan）”。","Baikadamov 末尾 -ov 常见于俄语体系姓氏，可联想到“这是苏联/俄语转写体系里常见的姓氏形式”。"]}
{"word":"bakie","summary":{"en":"“Bake” means to cook food in an oven with dry heat; it can also mean to become very hot under strong sun or heat.","zh":"“bake”表示用烤箱等干热方式烘烤食物；也可表示在强烈阳光或热量下变得很热。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to cook food in an oven using dry heat","zh":"（用烤箱等）烘烤；烤制（用干热烹饪）"},"examples":[{"en":"She baked a chocolate cake for his birthday.","zh":"她为他的生日烤了一个巧克力蛋糕。"},{"en":"Bake the potatoes for 45 minutes.","zh":"把土豆烤45分钟。"}]},{"partOfSpeech":"v.","definition":{"en":"(of the sun or heat) to make someone or something very hot","zh":"（阳光或热量）把……晒得很热；炙烤"},"examples":[{"en":"The sun baked the sidewalk all afternoon.","zh":"太阳把人行道晒了一整个下午。"},{"en":"We were baking in the car with no air conditioning.","zh":"车里没有空调，我们热得像在蒸一样。"}]}],"synonyms":["roast","cook","heat","toast"],"phonetic":"/beɪk/","extraExplanation":["“bakie”不是常见的标准英语拼写；很多情况下可能是把“bake”（烘烤）拼错了。","如果你想表达“面包师”，常用词是“baker”；“面包店/烘焙店”是“bakery”。你也可以告诉我你看到“bakie”的句子，我能更准确判断意思。"]}
{"word":"baking","summary":{"en":"“Baking” most often means the activity or process of cooking food in an oven; it can also mean “very hot” (as in “baking sun”).","zh":"“baking”常指用烤箱烹饪的“烘焙/烘烤”活动或过程；也可形容“非常热”，如“baking sun（灼热的太阳）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity or skill of making food (especially bread, cakes, and cookies) by cooking it in an oven","zh":"烘焙；烤制（尤指用烤箱制作面包、蛋糕、饼干等的活动或技能）"},"examples":[{"en":"I started baking during the weekend to relax.","zh":"我周末开始烘焙来放松。"},{"en":"Baking bread takes time, but the smell is worth it.","zh":"烤面包很费时间，但香味很值得。"}]},{"partOfSpeech":"n.","definition":{"en":"cooking food in an oven using dry heat","zh":"（用干热）烘烤；焙烤"},"examples":[{"en":"Baking turns the batter into a soft cake.","zh":"烘烤会把面糊变成松软的蛋糕。"},{"en":"The recipe calls for baking at 350°F for 25 minutes.","zh":"食谱要求用350华氏度烘烤25分钟。"}]},{"partOfSpeech":"adj.","definition":{"en":"very hot; feeling as if it is burning (often used before a noun)","zh":"酷热的；灼热的（常用作定语）"},"examples":[{"en":"We walked through the baking sun.","zh":"我们在灼热的太阳下行走。"},{"en":"It was baking hot in the car.","zh":"车里热得像蒸笼一样。"}]}],"synonyms":["cooking (in an oven)","roasting","oven-baking","scorching (for weather)","sweltering"],"phonetic":"/ˈbeɪkɪŋ/","extraExplanation":["“baking”作名词时，既可以指“烘焙这项活动/爱好”，也可以更具体地指“烘烤这一烹饪过程”。语境中如果谈配方、温度、时间，通常更偏“烘烤过程”；如果谈兴趣、课程、店铺，则更偏“烘焙活动”。","口语里“baking hot”很常见，意思是“非常热”，带有夸张色彩；也常见表达有“boiling hot / roasting hot”。"]}
{"word":"baking soda","summary":{"en":"sodium bicarbonate used for leavening, cleaning, and deodorizing","zh":"用于膨松、清洁和除味的碳酸氢钠（小苏打）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Sodium bicarbonate: a white powder used in baking to help dough rise, and also used for cleaning and deodorizing.","zh":"小苏打（碳酸氢钠）：一种白色粉末，用于烘焙使面团膨松，也常用于清洁和除味。"},"examples":[{"en":"Add a teaspoon of baking soda to help the pancakes rise.","zh":"加入一茶匙小苏打，能让煎饼更蓬松。"},{"en":"Baking soda can remove odors from the refrigerator.","zh":"小苏打可以去除冰箱里的异味。"},{"en":"She used baking soda and water to scrub the stained sink.","zh":"她用小苏打和水刷洗有污渍的水槽。"}]}],"synonyms":["sodium bicarbonate","bicarbonate of soda","NaHCO3"],"phonetic":"/ˈbeɪkɪŋ ˈsoʊdə/","extraExplanation":["在烘焙中，小苏打是“化学膨松剂”：遇到酸性材料（如酸奶、柠檬汁、红糖、可可粉等）会产生二氧化碳气泡，让面糊变松软。","不要和“baking powder（泡打粉）”混淆：泡打粉通常已混有酸性成分和淀粉，更“即用型”；小苏打常需要配合酸性材料才效果好。"],"etymology":"“baking”表示“烘焙用的”，“soda”早期指从植物灰或矿物中得到的碱性盐类；“baking soda”在现代英语里特指碳酸氢钠（sodium bicarbonate）。","mnemonic":["“baking（烘焙）+ soda（苏打）”→“烘焙用的苏打”＝小苏打。","记住中文名“苏打（soda）”和“小（baking soda）”：小苏打常用于厨房的小帮手（膨松、除味、清洁）。"]}
{"word":"baking tray","summary":{"en":"A baking tray is a flat oven pan used for baking or roasting food.","zh":"baking tray 指烤箱用的浅烤盘，用来烘焙或烤制食物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A flat (often rectangular) metal pan used to bake or roast food in the oven, such as cookies, vegetables, or chicken.","zh":"烤盘；烘焙/烤箱用的金属浅盘，常用于烤饼干、蔬菜或烤肉等。"},"examples":[{"en":"Put the cookies on a baking tray and bake them for 12 minutes.","zh":"把饼干放在烤盘上，烤 12 分钟。"},{"en":"Line the baking tray with baking paper to stop the food from sticking.","zh":"在烤盘上铺烘焙纸，防止食物粘住。"},{"en":"Roast the vegetables on a baking tray with olive oil and salt.","zh":"把蔬菜放在烤盘上，加橄榄油和盐来烤。"}]}],"synonyms":["sheet pan","baking sheet","cookie sheet"],"phonetic":"/ˈbeɪkɪŋ treɪ/","extraExplanation":["英式英语里常说 baking tray；美式英语更常用 sheet pan 或 baking sheet。若是四周更高、用于装液体或蛋糕糊的，常叫 roasting pan（烤肉盘）或 cake pan（蛋糕模）。","相关搭配：rimmed baking tray（有边烤盘）、nonstick baking tray（不粘烤盘）、line the tray（给烤盘铺纸/垫子）、preheat the oven（预热烤箱）。"]}
{"word":"baking-hot","summary":{"en":"Baking-hot means extremely hot, especially weather or a place that feels like an oven.","zh":"baking-hot 表示“酷热的”，多形容天气或环境热得像烤箱一样。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Extremely hot (usually about the weather or a place), in a way that feels like you are being “baked.”","zh":"酷热的；热得像在被“烘烤”（常形容天气或环境）。"},"examples":[{"en":"It was baking-hot outside, so we stayed in the shade.","zh":"外面酷热难当，所以我们待在阴凉处。"},{"en":"The apartment gets baking-hot in the afternoon sun.","zh":"这间公寓下午晒太阳时会变得特别热。"},{"en":"We walked across the baking-hot sand to the water.","zh":"我们走过滚烫的沙子去到海边。"}]}],"synonyms":["scorching","boiling (informal)","sweltering","blistering","sizzling (informal)"],"phonetic":"/ˈbeɪkɪŋ hɑt/","extraExplanation":["“baking-hot”是比“very hot”更强烈、更有画面感的说法，带有夸张的口语色彩，强调热得让人难受。","拼写上常见带连字符（baking-hot），也可写作不加连字符的“baking hot”（尤其在非正式写作中）。","常搭配：baking-hot day/sun/afternoon/sand；不太用于形容人（一般说 someone is “baking” 在太阳下晒得发烫）。"]}
{"word":"bakingly","summary":{"en":"“Bakingly” is a rare adverb meaning “by baking” or “in an oven-like, intensely hot way.”","zh":"“bakingly”是个罕见副词，可指“通过烘烤”，也可指“像烤炉一样炙热地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to baking (heating food in an oven); by baking.","zh":"以烘焙的方式；通过烘烤。"},"examples":[{"en":"The bread was cooked bakingly in a hot stone oven.","zh":"面包在热石烤炉里以烘烤的方式烤熟了。"},{"en":"She prepared the vegetables bakingly rather than frying them.","zh":"她用烘烤的方式处理蔬菜，而不是油炸。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Rare) In a very hot, oven-like way; intensely hot.","zh":"（罕见）像烤炉一样炙热地；热得像在烘烤。"},"examples":[{"en":"The afternoon sun beat down bakingly on the pavement.","zh":"午后的太阳炙烤般地照在路面上。"},{"en":"It was bakingly hot in the unshaded room.","zh":"没有遮阴的房间里热得像在烘烤。"}]}],"synonyms":["intensely","scorchingly","blazingly","by baking","in a baking way"],"phonetic":"/ˈbeɪkɪŋli/","extraExplanation":["“bakingly”是由形容词/现在分词“baking”（烘烤的；炎热的）加副词后缀“-ly”构成，但在现代英语中非常少见。表达“炙热地”更常用“blazingly / scorching(ly) / intensely”。","用于形容天气或阳光的“baking hot”很常见；如果你想更自然地表达副词含义，通常会说“the sun beat down fiercely / the heat was intense”。"]}
{"word":"bakings","summary":{"en":"“Bakings” usually means multiple instances of baking, and more rarely can mean baked goods.","zh":"“Bakings”通常指多次/多批次的烘焙；较少见时也可指烘焙食品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of cooking food in an oven; plural form meaning multiple times/instances of baking","zh":"烘焙；烤制（复数：指多次/多次进行的烘焙过程）"},"examples":[{"en":"I did two bakings today: one for bread and one for cookies.","zh":"我今天烘焙了两次：一次做面包，一次做饼干。"},{"en":"Different bakings can change the color and texture of the cake.","zh":"不同的烘烤方式会改变蛋糕的颜色和口感。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) baked items made during baking; baked goods","zh":"（较少见）烘焙出来的食物；烘焙点心/烤制食品"},"examples":[{"en":"She brought some homemade bakings to share at the meeting.","zh":"她带了一些自制的烘焙点心来在会议上分享。"},{"en":"The shop sells fresh bakings every morning.","zh":"这家店每天早上卖新鲜出炉的烘焙食品。"}]}],"synonyms":["baking sessions","batches (of baking)","baked goods","pastries"],"phonetic":"/ˈbeɪkɪŋz/","extraExplanation":["“bakings”作“烘焙食品”时更偏英式或地区性用法；在美式英语里更常说 baked goods、pastries、treats 等。","注意区分：baking（不可数）常指“烘焙（这件事/过程）”；bakings（复数）更强调“多次烘焙”或“多批次烘焙出来的东西”。"]}
{"word":"Bakke","summary":{"en":"“Bakke” is usually a surname; in U.S. contexts it often refers to the 1978 Supreme Court case about affirmative action in admissions.","zh":"“Bakke”通常是姓氏；在美国语境中也常指 1978 年关于大学招生平权措施的最高法院判例（巴基案）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A surname (family name), originally from Scandinavian languages (common in Norway).","zh":"姓氏（家族名），源自斯堪的纳维亚语言（在挪威等地较常见）。"},"examples":[{"en":"Mr. Bakke moved to the U.S. for graduate school.","zh":"Bakke 先生为了读研究生搬到了美国。"},{"en":"Bakke is a fairly common last name in parts of Norway.","zh":"在挪威的一些地区，Bakke 是比较常见的姓氏。"}]},{"partOfSpeech":"other","definition":{"en":"In U.S. history and law, “Bakke” often refers to the Supreme Court case Regents of the University of California v. Bakke (1978), about affirmative action in college admissions.","zh":"在美国历史与法律语境中，“Bakke”常指 1978 年的美国最高法院案件“加州大学董事会诉巴基案”（Regents of the University of California v. Bakke），涉及大学招生中的平权措施（affirmative action）。"},"examples":[{"en":"The Bakke case is frequently discussed in debates about affirmative action.","zh":"巴基案常在关于平权措施的讨论中被提及。"},{"en":"In class, we read excerpts from Regents v. Bakke.","zh":"课上我们阅读了《Regents v. Bakke》的节选。"}]}],"synonyms":["(surname)","(in law) Regents v. Bakke","the Bakke case"],"phonetic":"/ˈbɑki/","extraExplanation":["“Bakke”在英语里通常不当作普通词汇使用，而是作为专有名词（人名/姓氏）。因此在文章或新闻中看到“Bakke”，往往需要根据上下文判断：是在说某个人，还是在引用那起著名的最高法院判例。","关于巴基案：法院裁定“严格配额式”的录取做法不可取，但“把种族作为多因素之一进行整体评估”在一定范围内可能被允许。它常被视为美国高等教育平权政策讨论的重要起点之一。"]}
{"word":"Bakki","summary":{"en":"“Bakki” most commonly refers to a Bakki Shower filter in koi/fish-keeping, or it may be a proper name/brand.","zh":"“Bakki”最常见是指锦鲤/养鱼圈的 Bakki Shower 淋滤系统；也可能是人名或品牌名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Koi/fish-keeping) A “Bakki Shower”: a waterfall-style trickle filter used to improve water quality by letting water flow over filter media and absorb oxygen.","zh":"（锦鲤/养鱼圈）“Bakki Shower（巴奇淋滤）”：一种瀑布式滴流过滤系统，让水流过滤材并充分接触空气，以提升溶氧与水质。"},"examples":[{"en":"Many koi keepers use a Bakki shower to increase oxygen and reduce ammonia.","zh":"很多锦鲤玩家会用 Bakki shower 来提高溶氧、降低氨含量。"},{"en":"The Bakki filter works best with strong flow and good ventilation.","zh":"Bakki 过滤通常在水流强、通风好的条件下效果最好。"}]},{"partOfSpeech":"other","definition":{"en":"A personal name or brand name (used as a proper noun).","zh":"人名或品牌名（作为专有名词使用）。"},"examples":[{"en":"Bakki is the name on the label, so it might be a brand.","zh":"标签上写着 Bakki，所以它可能是个品牌名。"}]}],"synonyms":["Bakki shower","trickle filter","shower filter"],"phonetic":"/ˈbɑːki/","extraExplanation":["“Bakki Shower”这个说法在英语里多见于锦鲤池/水族过滤领域，属于圈内用语；在一般英语词典中不一定作为常见词条收录。","如果你指的是别的“Bakki”（例如某种语言里的词、地名、昵称等），告诉我它出现的句子或领域，我可以给出更准确的释义与用法。"]}
{"word":"baklava","summary":{"en":"Baklava is a sweet layered pastry with nuts and syrup or honey.","zh":"Baklava 是一种夹坚果并淋糖浆或蜂蜜的多层甜酥点心。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rich, sweet pastry made of many thin layers of dough (phyllo), filled with chopped nuts, and soaked with syrup or honey","zh":"巴克拉瓦（一种甜点）：用多层薄面皮（phyllo）夹坚果碎烤制，再淋上糖浆或蜂蜜的浓甜点心"},"examples":[{"en":"For dessert, we shared a piece of baklava with pistachios and honey.","zh":"甜点我们分享了一块开心果蜂蜜巴克拉瓦。"},{"en":"Baklava is popular in many countries around the Eastern Mediterranean and the Middle East.","zh":"巴克拉瓦在东地中海和中东许多国家都很受欢迎。"},{"en":"The baklava was so sweet that a small slice was enough.","zh":"巴克拉瓦太甜了，一小片就足够了。"}]}],"synonyms":["nut pastry","layered pastry","phyllo pastry dessert"],"phonetic":"/bɑːkˈlɑːvə/","extraExplanation":["“Baklava”常见读法为 /bɑːkˈlɑːvə/（美式 IPA）。它通常与土耳其、希腊、黎凡特等地区的甜点文化相关；不同地区会在坚果种类（开心果、核桃等）、香料（如肉桂）与糖浆风味（玫瑰水/橙花水）上有所差异。","在英语里它既可数也可不可数：a piece of baklava（一块巴克拉瓦）；some baklava（一些巴克拉瓦）。","常见搭配：baklava pastry（巴克拉瓦点心）、pistachio/walnut baklava（开心果/核桃巴克拉瓦）、honey/syrup-soaked baklava（浸蜂蜜/糖浆的巴克拉瓦）。"]}
{"word":"baklavas","summary":{"en":"“Baklavas” means more than one piece of baklava, a nut-filled layered pastry soaked in syrup or honey.","zh":"“Baklavas”指多块 baklava（果仁夹心的多层酥皮甜点），通常会浸/淋糖浆或蜂蜜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of baklava: a sweet, rich pastry made of many thin layers of dough (phyllo), filled with chopped nuts, and soaked in syrup or honey.","zh":"baklava（果仁千层酥甜点）的复数：一种甜而浓郁的酥皮点心，由多层薄面皮（phyllo）叠成，夹碎坚果，并淋上糖浆或蜂蜜。"},"examples":[{"en":"They brought a box of baklavas to share after dinner.","zh":"他们晚饭后带来一盒 baklavas（果仁千层酥甜点）大家一起分享。"},{"en":"At the festival, we tried pistachio baklavas and walnut baklavas.","zh":"在节日上，我们尝了开心果的 baklavas 和核桃的 baklavas。"}]}],"synonyms":["baklava","pastries","desserts"],"phonetic":"/bɑˈklɑvəz/","extraExplanation":["“Baklava”常见于土耳其、希腊及更广泛的中东与巴尔干饮食文化中；在英语里既可当作不可数名词（Some baklava），也可数（one baklava / two baklavas）。","拼写提示：复数通常加 -s（baklavas）。有时菜单上也会把“baklava”直接当复数使用，这是常见的餐饮用法。"]}
{"word":"baklawa","summary":{"en":"Baklawa is a sweet layered pastry with nuts and syrup (also spelled baklava).","zh":"Baklawa（也拼作 baklava）是一种夹坚果并淋糖浆/蜂蜜的多层酥皮甜点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rich Middle Eastern pastry made of many thin layers of dough (phyllo), filled with chopped nuts, and sweetened with syrup or honey","zh":"巴克拉瓦（中东甜点）：用多层薄面皮（酥皮/菲洛面皮）夹坚果碎，再浇糖浆或蜂蜜制成的甜点"},"examples":[{"en":"For dessert, we ordered baklawa with pistachios and honey syrup.","zh":"甜点我们点了开心果巴克拉瓦，上面浇了蜂蜜糖浆。"},{"en":"She brought homemade baklawa to share during the holiday celebration.","zh":"节日庆祝时，她带了自制的巴克拉瓦和大家分享。"},{"en":"Baklawa is very sweet, so I usually eat a small piece with coffee.","zh":"巴克拉瓦很甜，所以我通常配咖啡吃一小块。"}]}],"synonyms":["baklava"],"phonetic":"/bɑːkˈlɑːvə/","extraExplanation":["“baklawa”常见的另一种拼写是“baklava”。不同地区（如土耳其、希腊、黎凡特等）会在坚果种类（开心果/核桃/杏仁）、香料和糖浆风味上有所差异。","它常出现在节庆与待客场合，在许多中东与地中海文化里象征分享与款待。"]}
{"word":"baklawas","summary":{"en":"Baklava is a very sweet layered pastry with nuts and syrup or honey.","zh":"Baklava（巴克拉瓦）是一种夹坚果、浇糖浆或蜂蜜的多层甜酥点心。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sweet dessert pastry made of thin layers of dough (phyllo), filled with chopped nuts, and soaked with syrup or honey.","zh":"一种甜点酥皮点心：用多层薄面皮（phyllo/filo）夹碎坚果，烤后再浇上糖浆或蜂蜜。"},"examples":[{"en":"I tried baklava for the first time at a Greek restaurant.","zh":"我第一次吃巴克拉瓦是在一家希腊餐厅。"},{"en":"The baklava was very sweet and sticky because of the honey syrup.","zh":"这份巴克拉瓦因为蜂蜜糖浆而非常甜、很黏。"},{"en":"For the holidays, she made baklava with pistachios and walnuts.","zh":"过节时，她用开心果和核桃做了巴克拉瓦。"}]}],"synonyms":["nut pastry","phyllo pastry (general)"],"phonetic":"/bɑkˈlɑvə/","extraExplanation":["“baklawas”常见于对“baklava”的误拼或变体拼写；标准英语拼写通常是 **baklava**（也可见到 baklawa）。","baklava 广见于东地中海与中东地区（如土耳其、希腊、阿拉伯地区等）的甜点文化；不同地区在用坚果（开心果/核桃/杏仁）、香料与糖浆配方上会有差异。","点餐或写作时，用 “baklava” 更容易被理解；可搭配表达：*a piece of baklava*（一块巴克拉瓦）、*pistachio baklava*（开心果巴克拉瓦）。"]}
{"word":"bakli","summary":{"en":"“bakli” isn’t a recognized English word; it’s likely a misspelling (e.g., badly, balky) or a non-English term.","zh":"“bakli”不是常见英语词；多半是拼写错误（如 badly、balky）或外来词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“bakli” is not a standard English word. It may be a misspelling or a name/word from another language.","zh":"“bakli”不是标准英语单词；可能是拼写错误，或来自其他语言的人名/词。"},"examples":[{"en":"I couldn’t find “bakli” in an English dictionary—did you mean a different word?","zh":"我在英语词典里查不到“bakli”——你是不是想写另一个词？"},{"en":"If you tell me the sentence, I can guess the correct spelling.","zh":"如果你把它放进句子里，我可以帮你猜正确拼写。"}]}],"phonetic":"/ˈbækli/","extraExplanation":["你可能想输入的词：\n1) badly /ˈbædli/（副词）：糟糕地；非常\n2) balky /ˈbɔki/（形容词）：（人/动物/机器）倔强的、不肯配合的；（机器）故障多的\n3) baklava /ˌbɑkləˈvɑ/（名词）：巴克拉瓦（中东/地中海常见的甜点）\n把“bakli”出现的上下文句子发我，我可以更准确判断。"]}
{"word":"Bakongo","summary":{"en":"Bakongo refers to a Central African people of the Kongo region and also describes things related to their culture and language.","zh":"Bakongo 指中非刚果地区的巴刚果民族，也可作形容词表示与其文化或语言有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Bantu-speaking people from the Kongo region of Central Africa, especially in today’s Democratic Republic of the Congo, Republic of the Congo, and Angola","zh":"巴刚果人：中非刚果地区的班图语族民族，主要分布在今天的刚果民主共和国、刚果共和国和安哥拉等地"},"examples":[{"en":"The Bakongo have a rich tradition of music and storytelling.","zh":"巴刚果人拥有丰富的音乐与口述故事传统。"},{"en":"Many Bakongo communities live on both sides of the Congo River.","zh":"许多巴刚果社群分布在刚果河两岸。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Bakongo people, their language varieties, or their culture","zh":"巴刚果人的；与巴刚果语言或文化有关的"},"examples":[{"en":"The museum featured Bakongo art, including carved figures and textiles.","zh":"博物馆展出了巴刚果艺术，包括雕刻人像与纺织品。"},{"en":"She is researching Bakongo cultural beliefs and rituals.","zh":"她正在研究巴刚果的文化信仰与仪式。"}]}],"synonyms":["Kongo (people)","Kikongo (language, related term)"],"phonetic":"/bɑˈkɔŋɡoʊ/","extraExplanation":["“Bakongo”常被用作民族名称；其语言通常称为“Kikongo（基孔戈语）”，在不同地区还有多种方言/变体。","历史上，巴刚果人与“刚果王国（Kingdom of Kongo）”有密切关联；在阅读历史、人类学或非洲宗教研究材料时会经常遇到该词。"]}
{"word":"bakongo","summary":{"en":"Bakongo refers to the Kongo people of Central Africa, and also means “related to their culture or language.”","zh":"Bakongo 指中非的刚果族，也可作形容词表示“与其文化或语言有关”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Kongo (Bantu) ethnic group, traditionally from the Congo Basin region, especially in what is now the Democratic Republic of the Congo, the Republic of the Congo, and northern Angola.","zh":"刚果族（班图语系）的一员，传统上分布在刚果河流域地区，主要在今刚果民主共和国、刚果共和国及安哥拉北部一带。"},"examples":[{"en":"Many Bakongo communities live on both sides of the Congo River.","zh":"许多刚果族社群分布在刚果河两岸。"},{"en":"The museum has an exhibit on Bakongo art and spiritual traditions.","zh":"博物馆有一个关于刚果族艺术与精神传统的展览。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Bakongo people, their language (Kikongo), or their culture.","zh":"与刚果族、其语言（吉刚果语/Kikongo）或其文化有关的。"},"examples":[{"en":"They studied Bakongo history in a class on Central Africa.","zh":"他们在一门中非课程里学习刚果族历史。"},{"en":"The song includes Bakongo rhythms and call-and-response patterns.","zh":"这首歌融入了刚果族的节奏与呼应式演唱。"}]}],"synonyms":["Kongo (people)","the Kongo"],"phonetic":"/bəˈkɔŋɡoʊ/","extraExplanation":["“Ba-”在许多班图语中是表示“人们/族群”的复数前缀，因此“Bakongo”字面上可理解为“刚果人们”。单数有时写作“(Mu)Kongo”。","英文里也常见写法“Kongo people / the Kongo”，指族群时用“Bakongo”较常见；指历史政体则常说“the Kingdom of Kongo（刚果王国）”。","他们的语言通常称为“Kikongo（吉刚果语）”，在中非地区有多种方言与变体。"]}
{"word":"bakra","summary":{"en":"Bakra means a goat (often a male goat) in South Asian English, and informally it can mean a dupe or easy target.","zh":"Bakra在南亚英语里指（常指公）山羊；口语中也可比喻为“冤大头/容易受骗的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English, from Hindi/Urdu) a goat, especially a male goat.","zh":"（南亚英语，源自印地语/乌尔都语）山羊，尤指公山羊。"},"examples":[{"en":"For Eid, many families buy a bakra from the market.","zh":"开斋节时，很多家庭会从市场买一只bakra（公山羊）。"},{"en":"The bakra wandered into the yard and started eating the plants.","zh":"那只bakra（山羊）走进院子，开始啃植物。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, South Asian slang) a person who is easily fooled or made to pay; a dupe or “easy target.”","zh":"（非正式，南亚俚语）容易被骗、被宰的人；“冤大头”。"},"examples":[{"en":"Don’t be a bakra—read the contract before you sign.","zh":"别当bakra（冤大头）——签字前先把合同看清楚。"},{"en":"The scammer looked for a bakra who wouldn’t ask questions.","zh":"骗子在找一个不多问、好下手的bakra（受骗者）。"}]}],"synonyms":["goat","billy goat","dupe","sucker","easy target"],"phonetic":"/ˈbɑːkrə/","extraExplanation":["“Bakra”在北印度和巴基斯坦的语言环境里很常见，原意是“山羊”。因为“宰羊/卖羊”容易让人联想到“被宰”，所以在口语里也发展出“被坑的人、好骗的人（冤大头）”这一层比喻义。使用第二个含义时要注意语境：在正式场合可能显得不礼貌。"]}
{"word":"Bakshaish","summary":{"en":"Bakshish means a tip or small payment (sometimes like a bribe) for service, and it can also mean a small charitable gift.","zh":"Bakshish 指小费/酬谢金（有时带“打点费、变相贿赂”的含义），也可指小额施舍。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small amount of money given as a tip, gratuity, or (sometimes) an unofficial payment to get help or faster service, especially in parts of the Middle East and South Asia","zh":"（尤指中东、南亚等地的）小费；酬谢金；（有时指）为获得帮助或加快办事而给的“打点费/变相贿赂”"},"examples":[{"en":"The guide expected a little bakshish at the end of the tour.","zh":"导游希望在行程结束时得到一点bakshish（小费）。"},{"en":"He slipped the porter some bakshish to carry the bags upstairs.","zh":"他塞给搬运工一点bakshish，请他把行李搬上楼。"},{"en":"In some places, a “bakshish” can feel like a bribe rather than a tip.","zh":"在一些地方，“bakshish”可能更像贿赂而不是小费。"}]},{"partOfSpeech":"n.","definition":{"en":"a small gift or money given as charity (alms)","zh":"施舍；救济（给穷人或需要帮助者的小额金钱或礼物）"},"examples":[{"en":"They gave bakshish to people begging outside the temple.","zh":"他们给寺庙外乞讨的人一些bakshish（施舍）。"}]}],"synonyms":["tip","gratuity","bribe","handout","alms"],"phonetic":"/ˈbɑkʃiʃ/","extraExplanation":["拼写上也常见 baksheesh / backsheesh。这个词源自波斯语（bakshīsh，“给予/赠与”），在阿拉伯语、土耳其语及南亚语境中也很常见。","语感上既可能是“合乎习惯的小费/酬谢”，也可能带有“非正式打点、灰色费用”的暗示。旅行写作里常用来表达这种文化差异：给钱可能是礼貌，也可能让人不舒服，取决于场景与当地规范。"]}
{"word":"bakshaish","summary":{"en":"Bakshish means a small tip or gift, and sometimes an unofficial payment (bribe) depending on context.","zh":"Bakshish 指小费或小礼物/施舍；在某些语境下也可指为办事而给的变相贿赂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small sum of money given as a tip, gratuity, or sometimes an unofficial payment to get a service (often in parts of the Middle East, South Asia, and North Africa)","zh":"（在中东、南亚、北非等地常见的）小费；酬金；有时也指为办事而给的“私下打点费/变相贿赂”"},"examples":[{"en":"The guide expected a little bakshish after the tour.","zh":"导游在游览结束后希望得到一点小费（bakshish）。"},{"en":"Some travelers feel uncomfortable when people ask for bakshish in busy markets.","zh":"有些旅行者在热闹市场里被人索要小费（bakshish）时会感到不自在。"},{"en":"The official hinted at bakshish to speed up the paperwork.","zh":"那名官员暗示要给点“打点费”（bakshish）才能加快手续。"}]},{"partOfSpeech":"n.","definition":{"en":"a small gift or charitable donation given to someone in need","zh":"（给穷人或有需要者的）施舍；小礼物；慈善捐助"},"examples":[{"en":"She handed out bakshish to the children outside the temple.","zh":"她在寺庙外给孩子们一些施舍（bakshish）。"},{"en":"He offered bakshish as a gesture of kindness.","zh":"他给了点施舍（bakshish）以示善意。"}]}],"synonyms":["tip","gratuity","handout","alms","bribe (context-dependent)"],"phonetic":"ˈbɑkʃiʃ","extraExplanation":["“Bakshish”常见拼写为 bakshish，也有人写作 baksheesh；你输入的“bakshaish”属于不太常见的变体拼写。","这个词在英语里多出现在旅行、殖民/历史题材或描写当地社会习俗的语境中。使用时要注意文化敏感：在一些地方它更接近“惯例小费/谢礼”，但在另一些语境里可能带有“打点、行贿”的负面含义，具体取决于场景。","词源可追溯到波斯语（与“赠与/施予”有关），并通过多种语言进入英语。"]}
{"word":"baksheesh","summary":{"en":"Baksheesh means a small tip or, sometimes, a bribe for special treatment, often used in Middle Eastern and South Asian contexts.","zh":"baksheesh 指（多见于中东和南亚语境的）小费/赏钱；有时也指为获得特殊照顾而给的贿赂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small tip or gratuity, especially in parts of the Middle East and South Asia","zh":"（尤指中东和南亚一些地区的）小费、赏钱"},"examples":[{"en":"The guide expected a little baksheesh after the tour.","zh":"导游在行程结束后期待给一点赏钱。"},{"en":"In some places, people use “baksheesh” to mean a small payment for help.","zh":"在一些地方，“baksheesh”也可指为获得帮助而付的一小笔钱。"}]},{"partOfSpeech":"n.","definition":{"en":"a bribe given to get special treatment or speed up a service (often informal or disapproving)","zh":"贿赂、打点钱（为获得特殊照顾或加快办理，常带有非正式或贬义）"},"examples":[{"en":"He implied that a bit of baksheesh would make the paperwork move faster.","zh":"他暗示如果“打点一下”，手续会办得更快。"},{"en":"The company has a strict policy against paying baksheesh.","zh":"公司严格禁止支付任何形式的“打点费”。"}]}],"synonyms":["tip","gratuity","handout","bribe","payoff"],"phonetic":"ˌbækˈʃiʃ","extraExplanation":["词源来自波斯语/阿拉伯语等语言（常见于旅行写作与殖民时期相关文本中），在英语里多用于描述某些地区的社会习惯。","语境提示：在旅游场景中它可能只是“给小费”，但在办事场景中也可能被理解为“贿赂”。如果不确定含义，用更中性的 tip（小费）或 bribe（贿赂）表达更清楚。"]}
{"word":"baksheeshes","summary":{"en":"“Baksheeshes” means tips or small payments (sometimes bribes), used especially in Middle Eastern/South Asian contexts.","zh":"“baksheeshes”指小费/赏钱（有时带“贿赂、好处费”的含义），多见于中东/南亚相关语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of baksheesh) small tips or gratuities, especially in parts of the Middle East, North Africa, and South Asia; sometimes used to mean a bribe.","zh":"（baksheesh 的复数）小费、赏钱（常见于中东、北非和南亚语境）；有时也指“贿赂”。"},"examples":[{"en":"We left a few baksheeshes for the hotel staff.","zh":"我们给酒店员工留了一些小费。"},{"en":"The official hinted that a few baksheeshes would make the paperwork move faster.","zh":"那名官员暗示给点“好处费”手续会办得更快。"}]}],"synonyms":["tips","gratuities","handouts","bribes"],"phonetic":"ˌbɑkˈʃiʃ","extraExplanation":["“baksheesh”来自波斯语/阿拉伯语等语言传统，在英语里常用来指旅行时遇到的“讨要小费/赏钱”的情况；在某些语境也会被理解为“变相索贿”。使用时要注意场合：如果是在描述服务行业的惯例，可用“tip/gratuity”；如果涉及不当交易，更准确的词是“bribe”。","英语里更常见的形式是单数“baksheesh”当作不可数或可数名词使用；“baksheeshes”这种复数形式存在，但相对少见。"]}
{"word":"bakshi","summary":{"en":"“Bakshi” can refer to a Mughal-era official (often a military paymaster/administrator) or be used as a surname.","zh":"“Bakshi”既可指莫卧儿时期的官职（常与军饷/军务管理相关），也可作为姓氏使用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a South Asian (especially Mughal-era) title for an official, often a military paymaster/administrator or a high-ranking officer in charge of troops and salaries (also spelled “bakhshi”).","zh":"（南亚，尤指莫卧儿时期的）官职称号，常指军队的军饷/薪资管理官、军务行政官，或负责军队与军饷的高级军官（也拼作“bakhshi”）。"},"examples":[{"en":"In some Mughal records, the bakshi kept lists of soldiers and arranged their pay.","zh":"在一些莫卧儿时期的记录中，bakshi 负责登记士兵名单并安排发放军饷。"},{"en":"The general reported to the bakshi about troop numbers and expenses.","zh":"将军向 bakshi 汇报兵力人数与开支。"}]},{"partOfSpeech":"other","definition":{"en":"a surname (family name), found in several communities, especially among people with South Asian or Middle Eastern heritage.","zh":"姓氏（家族名），见于多个社群，尤其常见于南亚或中东背景的人群。"},"examples":[{"en":"Ms. Bakshi will lead today’s meeting.","zh":"Bakshi 女士将主持今天的会议。"},{"en":"I read an article by Bakshi on film and culture.","zh":"我读过一篇由 Bakshi 撰写、关于电影与文化的文章。"}]}],"synonyms":["bakhshi","paymaster","military administrator"],"phonetic":"ˈbʌkʃi","extraExplanation":["“Bakshi / Bakhshi”常被认为与波斯语/中亚行政体系有关，后来进入南亚宫廷与军政制度用语。英文史料里拼写不统一：bakshi、bakhshi 都可能出现。","作为姓氏时，不一定与历史官职有直接关系；更多是家族传统或地区语言转写的结果。"]}
{"word":"bakshis","summary":{"en":"Baksheesh (also spelled bakshish/bakshis) means a tip or small gift of money, sometimes an unofficial payment for help.","zh":"Baksheesh（也拼作 bakshish/bakshis）指小费或小额赏钱；有时也指为获得便利而给的非正式“好处费”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small gift of money given as a tip (and sometimes as an unofficial payment to get help or special treatment), especially in parts of the Middle East and South Asia","zh":"（尤指中东、南亚地区）给的小费；也可指为获得帮助或特殊待遇而给的“好处费/变相贿赂”"},"examples":[{"en":"The guide expected a little baksheesh after the tour.","zh":"导游在行程结束后期待给一点小费（baksheesh）。"},{"en":"Some travelers complain that officials ask for baksheesh at checkpoints.","zh":"有些旅行者抱怨在检查站会有人索要“好处费”（baksheesh）。"}]}],"synonyms":["tip","gratuity","handout","bribe (in some contexts)"],"phonetic":"/bækˈʃiʃ/","extraExplanation":["“bakshis”常见作“baksheesh / bakshish”的变体拼写，英文里多把它当作不可数名词使用（some baksheesh），也有人写复数表示多次或多笔给付。","词源大致来自波斯语/乌尔都语等语言，意为“赠与、赏钱”。在旅行语境中它可能只是小费，但在某些情境也带有“打点、变相行贿”的含义，使用时要注意当地法律与文化。"]}
{"word":"bakshish","summary":{"en":"Bakshish means a tip, small gift, or sometimes a bribe in certain travel/cultural contexts.","zh":"Bakshish 指小费/小礼物，在某些语境下也可指带贿赂意味的“打点费”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small payment given as a tip or as a bribe, especially in parts of the Middle East, South Asia, and North Africa","zh":"（尤指中东、南亚、北非等地的）小费；（有时带贿赂意味的）“打点费”"},"examples":[{"en":"The driver expected a little bakshish after carrying our bags.","zh":"司机帮我们搬了行李后，期待我们给一点 bakshish（小费）。"},{"en":"The officer hinted that a bakshish would make the problem disappear.","zh":"那位官员暗示给点 bakshish（打点费）问题就能消失。"}]},{"partOfSpeech":"n.","definition":{"en":"a small gift or charitable handout (money or goods), sometimes asked for by strangers","zh":"（有时由陌生人索要的）小礼物；施舍（钱或物）"},"examples":[{"en":"Children asked tourists for bakshish near the entrance.","zh":"入口附近有孩子向游客讨 bakshish（施舍/小礼物）。"}]}],"synonyms":["tip","gratuity","handout","alms","bribe (context-dependent)"],"phonetic":"ˈbɑkʃiʃ","extraExplanation":["这个词常见于旅行语境，带有明显的地域文化色彩：在一些地方它可能只是“小费/心意”，但在另一些情境下也可能指“打点/行贿”。如果涉及公务人员或办理手续时被暗示要 bakshish，务必留意当地法律与安全风险。","词源上多认为来自波斯语，通过阿拉伯语等语言传播，英文里通常用来指“当地习惯性的给钱/给礼物”。"]}
{"word":"bakshished","summary":{"en":"“Bakshished” means “gave bakshish”—tipped or paid a small gratuity, sometimes implying a bribe.","zh":"“bakshished”指“给了bakshish”——付小费/酬谢钱；有时也暗含行贿。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “bakshish”: to give someone a small sum of money as a tip, gratuity, or (sometimes) a bribe, especially in parts of the Middle East, South Asia, and North Africa.","zh":"“bakshish”的过去式/过去分词：给人一小笔钱当作小费、酬谢钱；有时也指（带有不正当意味的）贿赂，常见于中东、南亚、北非等语境。"},"examples":[{"en":"We bakshished the porter for carrying our bags.","zh":"我们给搬运行李的行李员付了点小费。"},{"en":"The tourist admitted he had bakshished an official to speed up the paperwork.","zh":"那位游客承认他给官员塞了钱来加快手续。"}]}],"synonyms":["tipped","gratuity-paid","bribed","slipped (someone) money"],"phonetic":"ˈbɑkʃiʃt","extraExplanation":["“Bakshish / baksheesh”源自波斯语/阿拉伯语等语言，英语里多出现在旅行写作、殖民时期记述或带有地域色彩的叙事中。语气可能中性（小费/酬谢）也可能负面（行贿），要看上下文。","在一些地区，“不给bakshish会被刁难”的刻板印象常见于西方旅行文本中；实际情况因国家、城市、行业而异，表达时注意避免以偏概全。"]}
{"word":"bakshishes","summary":{"en":"“Bakshishes” means tips or small money gifts (sometimes bribes), especially in certain regions such as the Middle East and South Asia.","zh":"“bakshishes”指小费或赏钱（有时也指打点钱/贿赂），多见于中东、南亚等地区语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small gift of money given as a tip, gratuity, or sometimes a bribe, especially in parts of the Middle East, North Africa, and South Asia","zh":"（尤指中东、北非、南亚等地的）小费、赏钱；有时也指（为办事方便而给的）“打点钱”/贿赂"},"examples":[{"en":"The guide expected a few bakshishes at the end of the tour.","zh":"导游期待在行程结束时能收到一些小费。"},{"en":"Travelers are often told to keep small bills for bakshishes.","zh":"人们常建议旅行者准备一些零钱用来给小费。"},{"en":"He refused to pay bakshishes to speed up the paperwork.","zh":"他拒绝为了加快手续而付“打点钱”。"}]}],"synonyms":["tip","gratuity","handout","bribe (context-dependent)"],"phonetic":"/ˈbɑkʃiʃ/","extraExplanation":["“bakshishes”是“bakshish”的复数形式。这个词来自波斯语背景，在许多国家的英语语境里常带有“当地习惯的小费/赏钱”的意思；但在某些场景也可能暗示不太透明的“给钱办事”。使用时要注意语境与礼貌。"]}
{"word":"bakshishing","summary":{"en":"“Bakshishing” means giving (or the act of giving) a small tip or unofficial payment—sometimes implying a bribe—especially in South Asian/Middle Eastern contexts.","zh":"“Bakshishing”指给（或给予的行为）小费/打点费，有时带贿赂意味，常用于南亚或中东相关语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"giving a small tip or unofficial payment (often seen as a bribe) to get better service or to make something happen more easily, especially in South Asia or the Middle East.","zh":"给小费或“打点费”（常带有贿赂意味）以换取更好的服务或让事情更顺利，尤指在南亚或中东语境中。"},"examples":[{"en":"The guide hinted that a little bakshishing would help us skip the line.","zh":"导游暗示给点 bakshishing（打点费）能让我们免排队。"},{"en":"In some places, people feel pressured to pay bakshishing for paperwork to move faster.","zh":"在一些地方，人们会感到不得不付 bakshishing 才能让手续办得更快。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of giving such a tip or unofficial payment.","zh":"给予这种小费或“打点费”的行为。"},"examples":[{"en":"They avoided bakshishing and insisted on using the official process.","zh":"他们不搞 bakshishing，坚持走正规流程。"},{"en":"The traveler wrote about bakshishing in his diary, unsure whether it was polite tipping or corruption.","zh":"这位旅行者在日记里写到 bakshishing，不确定这到底是礼貌性给小费还是腐败。"}]}],"synonyms":["baksheesh","tip","gratuity","payoff","bribe (context-dependent)"],"phonetic":"/bækˈʃiːʃɪŋ/","extraExplanation":["“bakshishing”常被视为“baksheesh / bakshish”的变体拼写，多见于旅行写作或带地域色彩的英语表达。来源与波斯语/阿拉伯语/乌尔都语等相关，核心含义是“赏钱、施舍、打赏”。在英语语境里，它有时中性（类似小费），但也常带负面含义（暗示需要“打点”或行贿）。使用时要注意场合与语气，以免对某个地区或文化造成刻板印象。"]}
{"word":"bakso","summary":{"en":"Bakso is an Indonesian-style meatball, often served in broth with noodles.","zh":"Bakso 是印尼风味的肉丸，常做成肉丸汤并搭配面条。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An Indonesian meatball (usually made from beef, chicken, or fish), commonly served in a savory broth with noodles or rice noodles.","zh":"（印尼）肉丸（通常用牛肉、鸡肉或鱼肉制成），常与面条/米粉一起放在咸鲜汤里食用。"},"examples":[{"en":"I ordered a bowl of bakso with noodles and chili sauce.","zh":"我点了一碗加面条和辣酱的 bakso（印尼肉丸汤）。"},{"en":"Bakso is one of the most popular street foods in Indonesia.","zh":"Bakso 是印尼最受欢迎的街头小吃之一。"}]}],"synonyms":["Indonesian meatball","meatball soup"],"phonetic":"/ˈbɑk.soʊ/","extraExplanation":["“Bakso”是印尼语借词，在英语里通常直接用来指一种印尼风味的肉丸汤（常见搭配：bakso soup / bakso noodles）。在印尼街头很常见，也经常出现在印尼餐馆菜单上。","有些地区会写作“baso”（口语/地方拼法），但“bakso”更常见、更标准。点餐时常见配料词：mie（面）、bihun（米粉）、tahu（豆腐）、pangsit（馄饨/炸云吞）。"]}
{"word":"Bakst","summary":{"en":"Bakst usually refers to Léon Bakst, a Russian artist best known for influential ballet costume and stage designs.","zh":"Bakst通常指列昂·巴克斯特，一位以影响深远的芭蕾服装与舞台设计闻名的俄罗斯艺术家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Léon Bakst (1866–1924), a Russian artist and stage/costume designer, famous for his bold, colorful designs for ballet and theater, especially with the Ballets Russes.","zh":"列昂·巴克斯特（1866–1924），俄罗斯艺术家、舞台与服装设计师，以大胆绚丽的芭蕾与戏剧舞台/服装设计著称，尤以为“俄罗斯芭蕾舞团（Ballets Russes）”的作品闻名。"},"examples":[{"en":"The exhibition includes costume sketches by Bakst for the Ballets Russes.","zh":"这场展览包括巴克斯特为俄罗斯芭蕾舞团绘制的服装草图。"},{"en":"Bakst’s designs helped shape the modern image of early 20th-century ballet.","zh":"巴克斯特的设计影响了20世纪初芭蕾的现代形象。"}]}],"synonyms":["Léon Bakst"],"phonetic":"/bækst/","extraExplanation":["“Bakst”通常指人名：Léon Bakst（列昂·巴克斯特）。他与迪亚吉列夫（Sergei Diaghilev）的Ballets Russes合作，使舞台美术与服装设计成为演出视觉风格的核心之一，常被认为对现代舞台设计与时尚产生了重要影响。","在艺术史语境里，你可能会看到“Bakst style / Bakst-inspired”，通常在说一种强烈色彩、东方主义（exotic）元素与装饰性很强的舞台/服装视觉风格。"]}
{"word":"bakt","summary":{"en":"“bakt” is not standard English; it’s usually a misspelling of “baked.”","zh":"“bakt”不是标准英语，通常是把“baked”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard spelling that is usually a typo or casual texting for “baked” (past tense/past participle of bake).","zh":"非标准拼写，通常是拼写错误或随意打字时把“baked”（bake 的过去式/过去分词）写成“bakt”。"},"examples":[{"en":"I think you meant “baked,” not “bakt.”","zh":"我觉得你想写的是“baked”，不是“bakt”。"},{"en":"The cookies are baked now.","zh":"饼干现在烤好了。"}]}],"synonyms":["baked"],"phonetic":"/bækt/","extraExplanation":["“bakt”在标准英语里不是常用词。最常见情况是把“baked /beɪkt/”误拼成“bakt”。如果你想表达“支持/背书”，可能是想写“backed”。","另外，“bakt”在某些其他语言（如荷兰语/瑞典语等）里可能是动词形式，意思接近“烤/烘焙”。如果你是在特定语境（例如外语文本、名字、缩写）里看到它，可以告诉我原句，我可以帮你精准判断。"]}
{"word":"bakteria","summary":{"en":"Bacteria are microscopic organisms; some are beneficial and some cause illness.","zh":"Bacteria 指细菌：微小的生物，有些有益、有些会致病。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Microscopic living organisms (single-celled). Some bacteria are helpful (e.g., in digestion or making yogurt), and some can cause disease.","zh":"细菌：一种微小的（单细胞）生物。有些细菌有益（如帮助消化、制作酸奶），有些会致病。"},"examples":[{"en":"Wash your hands to remove bacteria.","zh":"洗手可以去除细菌。"},{"en":"Some bacteria help keep your gut healthy.","zh":"有些细菌有助于维持肠道健康。"},{"en":"The lab tested the water for bacteria.","zh":"实验室检测了水中是否有细菌。"}]}],"synonyms":["germs","microbes","microorganisms"],"phonetic":"/bækˈtɪriə/","extraExplanation":["“bakteria”通常是把英文 **bacteria** 误拼，或受其他语言拼写影响（如部分欧洲语言里用 k 的转写）。英语标准拼写是 **bacteria**。","**bacteria** 在英语里常被当作复数（对应单数 **bacterium**）。口语中也常把 **bacteria** 当作不可数或单数来用（例如 “There is bacteria…”），但在正式写作中更推荐：**There are bacteria** / **a bacterium**。"]}
{"word":"Baktria","summary":{"en":"Baktria (Bactria) is the name of an ancient Central Asian region, roughly in modern northern Afghanistan.","zh":"Baktria（Bactria）指中亚的一个古代地区，大致在今天阿富汗北部一带。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(also spelled Bactria) An ancient region in Central Asia, famous in Greek, Persian, and Silk Road history; it was located roughly in today’s northern Afghanistan and nearby areas.","zh":"（也拼作 Bactria）中亚的一个古代地区，在希腊、波斯及丝绸之路历史中很有名；大致位于今天的阿富汗北部及其周边地区。"},"examples":[{"en":"Alexander the Great campaigned in Baktria during his conquest of the Persian Empire.","zh":"亚历山大大帝在征服波斯帝国时曾在巴克特里亚（Baktria）作战。"},{"en":"Baktria is often mentioned in discussions of Silk Road trade and cultural exchange.","zh":"谈到丝绸之路的贸易与文化交流时，常会提到巴克特里亚（Baktria）。"}]}],"synonyms":["Bactria","Bactrian region"],"phonetic":"/ˈbæktriə/","extraExplanation":["“Baktria”较常见于学术或历史文本中的转写；在英语里更常用的拼法是 **Bactria**。","巴克特里亚在古代是重要的交通与文化交汇地，曾被阿契美尼德波斯、亚历山大帝国以及后来的希腊化王国（如希腊-巴克特里亚王国）影响。"]}
{"word":"baktun","summary":{"en":"A baktun is a large time unit in the Maya Long Count calendar (144,000 days, about 394 years).","zh":"baktun 是玛雅长纪历中的大时间单位（144,000天，约394年）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In the Maya Long Count calendar, a unit of time equal to 144,000 days (about 394 years).","zh":"玛雅长纪历（Long Count）中的一个时间单位，等于144,000天（约394年）。"},"examples":[{"en":"A baktun is a major unit in the Maya Long Count calendar.","zh":"baktun 是玛雅长纪历中的一个重要时间单位。"},{"en":"Many people talked about the end of a baktun in 2012, but it did not mean the end of the world.","zh":"很多人谈到2012年一个 baktun 的结束，但这并不意味着世界末日。"},{"en":"Historians use baktun dates to place Maya events on a timeline.","zh":"历史学家用 baktun 日期来把玛雅事件放到时间轴上。"}]}],"synonyms":["Maya Long Count period","Mayan calendar cycle"],"phonetic":"/ˈbɑkˌtun/","extraExplanation":["“baktun”来自尤卡坦玛雅语（常见拼写为 bʼakʼtun），大意与“捆/束（katun 的集合）”有关，是玛雅历法分层单位之一。","玛雅长纪历把时间按单位累积记录：kin（1天）→ uinal（20天）→ tun（360天）→ katun（7,200天）→ baktun（144,000天）。","2012年引发的“世界末日”说法多为误读：对玛雅历法来说，一个 baktun 结束更像一个大周期的翻页，而不是终结。"]}
{"word":"Baku","summary":{"en":"Baku is the capital city of Azerbaijan on the Caspian Sea.","zh":"巴库是阿塞拜疆首都，位于里海沿岸。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The capital and largest city of Azerbaijan, located on the western coast of the Caspian Sea.","zh":"巴库：阿塞拜疆的首都和最大城市，位于里海西岸。"},"examples":[{"en":"Baku is the capital of Azerbaijan.","zh":"巴库是阿塞拜疆的首都。"},{"en":"Many visitors go to Baku to see the Old City and the seaside boulevard.","zh":"很多游客去巴库参观老城和海滨大道。"},{"en":"Baku sits on the Caspian Sea, not far from Central Asia and the Caucasus Mountains.","zh":"巴库坐落在里海边，靠近中亚地区和高加索山脉。"}]}],"phonetic":"/ˈbɑːkuː/","extraExplanation":["巴库在历史上因石油产业而闻名，19世纪末到20世纪初曾是世界重要的产油地之一，因此也常被提到与“石油繁荣”“工业城市发展”等主题相关。","城市里有被列入世界遗产的“巴库古城”（Icherisheher），同时也有现代地标（如火焰塔），常被用来对比“传统与现代并存”的城市形象。"]}
{"word":"baku","summary":{"en":"Baku most commonly refers to the capital of Azerbaijan; it can also mean a nightmare-eating creature in Japanese folklore.","zh":"Baku 最常指阿塞拜疆首都“巴库”；也可指日本传说中“吃噩梦的貘/食梦兽”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The capital and largest city of Azerbaijan, on the Caspian Sea.","zh":"巴库：阿塞拜疆的首都和最大城市，位于里海沿岸。"},"examples":[{"en":"Baku is known for its mix of modern architecture and an old walled city.","zh":"巴库以现代建筑与古老的城墙老城并存而闻名。"},{"en":"The conference was held in Baku, Azerbaijan.","zh":"这场会议在阿塞拜疆的巴库举行。"}]},{"partOfSpeech":"n.","definition":{"en":"In Japanese folklore, a creature said to eat nightmares (bad dreams).","zh":"（日本民间传说）貘/食梦兽：据说会吃掉噩梦的生物。"},"examples":[{"en":"In some stories, people ask the baku to eat their bad dreams.","zh":"在一些故事里，人们会请求貘把他们的噩梦吃掉。"},{"en":"The character is inspired by the baku, a nightmare-eating spirit.","zh":"这个角色的灵感来自“貘”，一种吃噩梦的灵兽。"}]}],"phonetic":"/bɑˈku/","extraExplanation":["“Baku（貘）”在日本传说里常被描绘为能吞食噩梦的灵兽。它的形象与汉字“貘”（古代对一种动物的称呼，后常被理解为类似食梦的神兽）有关，也常被现代动漫与游戏借用作角色原型。"]}
{"word":"Bakuba","summary":{"en":"Bakuba refers to the Kuba people of the DRC (and sometimes their language), especially in cultural or museum contexts.","zh":"Bakuba 指刚果（金）库巴人（有时也指其语言），常用于文化、艺术或博物馆语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Kuba (Bakuba) people, an ethnic group in the Democratic Republic of the Congo (DRC) known for rich artistic traditions (especially textiles, masks, and sculpture)","zh":"巴库巴人；库巴人（刚果民主共和国的一个民族，以纺织品、面具与雕刻等艺术传统著称）"},"examples":[{"en":"The museum displayed a Bakuba mask used in ceremonies.","zh":"博物馆展出了一件用于仪式的巴库巴面具。"},{"en":"Bakuba textiles are admired for their complex geometric patterns.","zh":"巴库巴纺织品以复杂的几何图案而闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"the language (or languages) associated with the Kuba/Bakuba people (often discussed as part of the larger Bantu language family)","zh":"巴库巴语／库巴语（与库巴人相关的语言，常被归入更大的班图语系讨论）"},"examples":[{"en":"Some people in the region speak Bakuba at home and use French at school.","zh":"当地有些人在家说巴库巴语，在学校使用法语。"}]}],"synonyms":["Kuba","Kuba people"],"phonetic":"/bəˈkuːbə/","extraExplanation":["“Bakuba”常见于人类学、艺术史与博物馆语境中。有时它与“Kuba”互换使用：Kuba更像是对“库巴王国/库巴联盟”的统称，而“Bakuba”在部分资料中强调“库巴人/库巴群体”的人。","在艺术与设计领域，你可能会看到“Bakuba cloth/raffia cloth（巴库巴布/拉菲草布）”，指以草纤维编织并刺绣装饰的传统织物，常被用来研究非洲几何纹样与现代设计的联系。"]}
{"word":"bakuba","summary":{"en":"Bakuba usually refers to the Kuba people of the D.R. Congo, and by extension their language and cultural arts.","zh":"Bakuba 通常指刚果民主共和国的库巴人，也可引申指其语言与文化艺术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Kuba people (also spelled “Bakuba”), an ethnic group in the Democratic Republic of the Congo","zh":"库巴人（也拼作 Bakuba），刚果民主共和国的一个民族"},"examples":[{"en":"The Bakuba are known for their rich artistic traditions.","zh":"库巴人以其丰富的艺术传统而闻名。"},{"en":"She studied Bakuba history for her African studies class.","zh":"她在非洲研究课上学习了库巴人的历史。"}]},{"partOfSpeech":"n.","definition":{"en":"the Kuba language(s) or Kuba cultural works (especially art such as textiles, masks, and sculpture)","zh":"库巴人的语言或文化作品（尤指纺织品、面具、雕塑等艺术）"},"examples":[{"en":"The museum displayed Bakuba textiles with complex geometric patterns.","zh":"博物馆展出了带有复杂几何图案的库巴纺织品。"},{"en":"He read about Bakuba art in a book on Central Africa.","zh":"他在一本关于中非的书里读到了库巴艺术。"}]}],"synonyms":["Kuba","Kuba people"],"phonetic":"/bəˈkuːbə/","extraExplanation":["“Bakuba”常见于较早的英文资料里，用来指库巴人或库巴王国相关文化；现代写法中也常直接用“Kuba”。在正式写作时，可以先用“Kuba (Bakuba)”标注一次，后面统一用一种拼写。","这是族群名称，语境上尽量避免把它当作泛指“非洲部落”的标签；更合适的说法是具体到“the Kuba people / Kuba Kingdom / Kuba art”。"]}
{"word":"bakuchi","summary":{"en":"“Bakuchi” is a Japanese word for gambling, often implying risky or illicit betting.","zh":"“bakuchi”是日语“赌博”的说法，常暗含冒险或非法赌博的语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Japanese word meaning gambling; a gamble or betting activity (often with a negative sense, like “illicit” or “reckless” gambling).","zh":"日语词，意为“赌博”；指赌博行为或赌局（常带贬义，如“非法/冒险的赌博”）。"},"examples":[{"en":"In the novel, he loses his savings to bakuchi and has to start over.","zh":"小说里，他因为沉迷 bakuchi（赌博）输光积蓄，只能重新开始。"},{"en":"The film shows how bakuchi can destroy families.","zh":"电影展现了 bakuchi（赌博）如何毁掉一个家庭。"}]}],"synonyms":["gambling","betting","wagering"],"phonetic":"/bɑˈkuːtʃi/","extraExplanation":["“bakuchi（博打）”是日语词，常见于日语语境或带日本文化背景的英语写作中。英语里更常用的对应词是 “gambling / betting”。","在日本语感里，“bakuchi”往往比中性词“tobaku（賭博）”更带有“粗野、地下、风险很大”的色彩，具体取决于作品与语境。","相关表达：bakuchi-uchi（博打打ち，赌徒/职业赌客，较口语或带旧时气息）。"]}
{"word":"bakuchii","summary":{"en":"“bakuchii” is usually a romanized Japanese-style term used online, often connected to “gambling,” or used as a nickname/tag rather than an English word.","zh":"“bakuchii”通常是带日语罗马字风格的网络用法，多与“赌博”相关，或作为昵称/标签使用，并非标准英语词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A romanized Japanese word (not standard English) often used to refer to gambling or a gamble; sometimes seen as a name or stylized spelling online.","zh":"一个日语罗马字写法（不是标准英语），常用来表示“赌博 / 赌局”；在网络上也可能被当作名字或风格化拼写使用。"},"examples":[{"en":"The character’s nickname “bakuchii” comes from the Japanese word for gambling.","zh":"角色的外号“bakuchii”来自日语里表示“赌博”的词。"},{"en":"In some fan communities, people use “bakuchii” as a stylized tag rather than an English word.","zh":"在一些同人圈里，人们用“bakuchii”作为风格化标签，而不是英语单词。"}]}],"synonyms":["gambling","a gamble","betting"],"phonetic":"/ˌbɑːkuːˈtʃiː/","extraExplanation":["“bakuchii”看起来像把日语「博打／ばくち」（bakuchi，意为“赌博、赌局”）用罗马字写出来，再做了拉长音或可爱化的拼写（把结尾写成 -ii）。不同圈子/作品里也可能是专有名词或昵称，因此具体含义要看上下文。","如果你是在某部作品、游戏、账号名里看到的，也可能只是人名/ID，并不一定有固定词义。你可以把原句或出处发我，我可以按语境更准确解释。"]}
{"word":"bakuchiol","summary":{"en":"Bakuchiol is a plant-based skincare ingredient often used as a gentler alternative to retinol.","zh":"Bakuchiol 是一种植物来源的护肤成分，常被用作较温和的“视黄醇替代选择”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant-derived skincare ingredient (from the babchi plant) used in creams and serums, often described as a gentler alternative to retinol for improving the look of fine lines, uneven tone, and acne.","zh":"一种植物来源的护肤成分（多来自补骨脂/babchi），常用于面霜与精华中，常被称为较温和的“视黄醇（retinol）替代选择”，用于改善细纹、肤色不均与痘痘等问题的外观。"},"examples":[{"en":"This serum contains bakuchiol for a retinol-like effect with less irritation.","zh":"这款精华含有 bakuchiol，主打类似视黄醇的效果，但刺激性更低。"},{"en":"People with sensitive skin often try bakuchiol before moving on to retinol.","zh":"敏感肌的人常会先尝试 bakuchiol，再考虑使用视黄醇。"},{"en":"She uses bakuchiol at night and always wears sunscreen during the day.","zh":"她晚上用 bakuchiol，白天一定会涂防晒。"}]}],"synonyms":["retinol alternative","plant-based anti-aging ingredient","botanical retinol (marketing term)"],"phonetic":"/bəˈkuːtʃiˌɔl/","extraExplanation":["“Bakuchiol”常见于护肤品营销语境，被称为“植物A醇”。但它并不是维A类（retinoid），作用机理与研究证据与视黄醇不完全相同；更合适的理解是：它可能在某些皮肤表现上带来相似的改善趋势。","发音小提示：重音通常在第二音节 -KOO-（ba-KOO-chi-ol）。","使用习惯上常见“夜间使用+白天防晒”的搭配；即使它通常被认为更温和，也仍可能因个体差异出现刺激或过敏，建议先做局部测试（patch test）。"]}
{"word":"bakul","summary":{"en":"Bakul usually means a woven basket in Malay/Indonesian; in some South Asian contexts it can also refer to the fragrant bakul tree/flower.","zh":"Bakul通常在马来语/印尼语里指编织的篮子；在部分南亚语境中也可指有香花的bakul树/花。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Malay/Indonesian) a basket, often woven (e.g., for carrying goods at a market).","zh":"（马来语/印尼语）篮子；常指编织的提篮（如在市场装货、携带物品用）。"},"examples":[{"en":"She put the vegetables into a bakul at the market.","zh":"她在市场把蔬菜放进一个bakul（提篮）里。"},{"en":"He carried a bakul of fruit home.","zh":"他提着一篮（bakul）水果回家。"}]},{"partOfSpeech":"n.","definition":{"en":"(South Asia) the bakul tree/flower (Mimusops elengi), known for its fragrant blossoms.","zh":"（南亚）bakul树/花（Mimusops elengi，常因花香而出名）。"},"examples":[{"en":"The bakul flowers smelled sweet in the evening.","zh":"傍晚时，bakul花闻起来很香。"}]}],"synonyms":["basket","wicker basket","woven basket"],"phonetic":"/bəˈkul/","extraExplanation":["“bakul”不是常见的英语单词，多用于东南亚语境（马来语/印尼语）中指“篮子”。在英语对话或旅行写作里，你可能会看到它作为外来词保留原名，旁边会加上解释（例如：bakul, a woven basket）。","在南亚语境里，“bakul”也可能指一种开香花的树（学名 Mimusops elengi）。不同地区对同一植物的俗名不一样，所以遇到时可根据上下文（市场/装东西 vs. 花香/树木）判断。"]}
{"word":"bakula","summary":{"en":"Bakula most commonly refers to the fragrant flower (or tree) Mimusops elengi, and it can also be a South Asian given name.","zh":"Bakula 通常指香花（或其树）Mimusops elengi，也可作南亚人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tropical evergreen tree (Mimusops elengi) native to South and Southeast Asia, known for its small, very fragrant white flowers; the flower itself is also called a bakula.","zh":"（热带）常绿乔木“鸡蛋花榄仁”（Mimusops elengi，常见英文名 Spanish cherry / bullet wood），以小而浓香的白花著称；也可指这种花本身。"},"examples":[{"en":"The temple courtyard was filled with the sweet scent of bakula flowers.","zh":"寺庙庭院里弥漫着 bakula 花的甜香。"},{"en":"In summer, the bakula tree blooms at night and perfumes the air.","zh":"夏天 bakula 树常在夜间开花，空气里都是香味。"}]},{"partOfSpeech":"n.","definition":{"en":"A given name used in South Asia, often associated with the bakula flower (a symbol of fragrance and beauty in classical poetry).","zh":"人名（南亚常见），常与 bakula 花相关联（在古典诗歌中象征芳香与美）。"},"examples":[{"en":"Bakula introduced herself as a student of classical literature.","zh":"Bakula 自我介绍说她在学习古典文学。"}]}],"synonyms":["bakul","Spanish cherry","bullet wood"],"phonetic":"/bəˈkuːlə/","extraExplanation":["“Bakula”源自梵语（Sanskrit）传统，在印度古典文学与诗歌中常用来指一种以“幽香”著称的花，因此也常出现在意象表达里（如夜香、清雅、含蓄之美）。","植物学上多对应 Mimusops elengi；在不同地区拼写也可见 bakul / bakula。阅读英文资料时，常会与别名 Spanish cherry、bullet wood 互相指代。"]}
{"word":"Bakunda","summary":{"en":"“Bakunda” is usually a proper name (person/family/clan name). Its meaning varies by language and region.","zh":"“Bakunda”通常是专有名词（人名/姓氏/氏族名），其含义会随语言与地区而变化。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname or given name used in several countries; the exact meaning depends on the language and family/clan background.","zh":"一个在多个国家/地区使用的姓氏或名字；具体含义取决于所属语言与家族/氏族背景。"},"examples":[{"en":"Ms. Bakunda will join the meeting at 3 p.m.","zh":"Bakunda 女士将于下午三点参加会议。"},{"en":"Bakunda is a family name in his community.","zh":"Bakunda 是他所在社区里的一个姓氏。"}]},{"partOfSpeech":"other","definition":{"en":"in some Bantu-language naming patterns, a form that may refer to a group of people connected to a clan/place/name (often using the plural prefix “Ba-” meaning “people”).","zh":"在一些班图语族的命名习惯中，可能指与某个氏族/地点/名称相关的一群人（常见复数前缀“Ba-”有“人们、族人”之意）。"},"examples":[{"en":"In some contexts, Bakunda can be interpreted as “the Kunda people.”","zh":"在某些语境中，Bakunda 可被理解为“库恩达族人/库恩达人”。"},{"en":"The term appears in names and local histories, depending on the region.","zh":"这个词会出现在姓名与地方史料中，但因地区而异。"}]}],"synonyms":["(no direct English synonym; depends on the specific name/context)"],"phonetic":"/bəˈkʌn.də/","extraExplanation":["“Bakunda”更常见于专有名词（人名/姓氏/族名）语境，而不是英语词典里的普通词汇。","在不少班图语族语言中，“Ba-”常作为“复数的人/族人”的前缀（类似表示“某某人们”），但不同地区与语言的构词规则不完全相同，所以需要结合具体国家、语言（如社区使用的本地语言）、以及上下文来确定准确含义。","如果你能提供：出现的句子、国家/地区、或它是人名还是地名/族名，我可以把释义写得更精确。"]}
{"word":"bakunda","summary":{"en":"“Bakunda” is most commonly seen as a Bantu-language form meaning “they love/like,” or as a proper name (surname/place name) in East/Central Africa.","zh":"“bakunda”最常见要么是班图语言中的形式，表示“他们喜欢/爱”，要么是东非/中非语境中的专有名词（如姓氏/地名）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Kinyarwanda/Kirundi; also seen in some related Bantu languages) “they love/they like.”","zh":"（卢旺达语/基隆迪语；也见于一些相关班图语）“他们喜欢/他们爱”。"},"examples":[{"en":"Bakunda umupira w’amaguru.","zh":"他们喜欢足球。"},{"en":"Abana bakunda kuririmba.","zh":"孩子们喜欢唱歌。"}]},{"partOfSpeech":"other","definition":{"en":"A proper name (e.g., a family name or place name) in some East/Central African contexts.","zh":"一个专有名词（如姓氏或地名），在一些东非/中非语境中会出现。"},"examples":[{"en":"Ms. Bakunda will speak at the meeting.","zh":"Bakunda 女士将在会议上发言。"},{"en":"I saw “Bakunda” listed as a last name.","zh":"我看到“Bakunda”被列为一个姓氏。"}]}],"synonyms":["they love","they like"],"phonetic":"/bəˈkʌndə/","extraExplanation":["“bakunda”常见于班图语系语言的动词变化中：词根“kunda”常表示“喜欢/爱”，前缀“ba-”常对应第三人称复数“他们”。不同语言/方言在拼写与用法上可能略有差异。","如果你是在英文文章里看到“Bakunda”，它更可能是人名/姓氏；如果是在卢旺达语或基隆迪语句子里看到，则通常是“他们喜欢/爱”的意思。"]}
{"word":"Bakunin","summary":{"en":"Bakunin is best known as a major Russian anarchist thinker who opposed authoritarian state power.","zh":"Bakunin最常指俄国无政府主义思想家巴枯宁，以反对专制与国家集权而著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Mikhail Bakunin (1814–1876), a Russian revolutionary and one of the most influential early thinkers of anarchism, known for opposing authoritarian government and criticizing Marx’s idea of a centralized state.","zh":"米哈伊尔·巴枯宁（1814–1876），俄国革命者、早期无政府主义的重要思想家之一；以反对专制政府、并批评马克思关于中央集权国家的设想而闻名。"},"examples":[{"en":"Bakunin argued that freedom requires rejecting oppressive state power.","zh":"巴枯宁认为，自由需要拒绝压迫性的国家权力。"},{"en":"In political theory class, we compared Marx and Bakunin on revolution and the role of the state.","zh":"在政治理论课上，我们比较了马克思和巴枯宁对革命以及国家角色的看法。"}]},{"partOfSpeech":"other","definition":{"en":"(Sometimes used in phrases) Ideas associated with Bakunin; Bakunin’s approach to anarchism and revolutionary politics.","zh":"（常用于搭配/短语中）指与巴枯宁相关的思想：巴枯宁式的无政府主义与革命政治观点。"},"examples":[{"en":"The article discusses Bakunin’s influence on later anarchist movements.","zh":"这篇文章讨论了巴枯宁对后来的无政府主义运动的影响。"},{"en":"Some historians describe this as a Bakunin-style suspicion of centralized authority.","zh":"一些历史学家把这称为一种“巴枯宁式”对中央集权权威的警惕。"}]}],"synonyms":["Mikhail Bakunin","Bakuninism (related term)"],"phonetic":"/bəˈkuːnɪn/","extraExplanation":["“Bakunin”是姓氏，中文常译作“巴枯宁”。在英语写作里常见于政治哲学、思想史与工人运动史语境。","他与马克思在“第一国际”（国际工人协会）内部的路线之争很著名：巴枯宁更强调反国家、反集权的革命道路。","相关派生词：Bakuninism（巴枯宁主义）偶尔出现于学术文本中，用来概括其思想立场。"]}
{"word":"Bakuninism","summary":{"en":"Bakuninism is Bakunin’s revolutionary anarchist ideology that opposes the state and hierarchy and promotes collective, self-managed society.","zh":"巴枯宁主义是巴枯宁的革命无政府主义思想：反对国家与等级权威，主张集体所有与社会自我管理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a political philosophy linked to Mikhail Bakunin that emphasizes revolutionary anarchism, rejecting the state and other hierarchical authority, and supporting collective ownership and direct action.","zh":"“巴枯宁主义”：与米哈伊尔·巴枯宁相关的政治思想，主张革命性的无政府主义，反对国家与其他等级权威，支持集体所有与直接行动。"},"examples":[{"en":"The article compares Marxism and Bakuninism in the early socialist movement.","zh":"这篇文章比较了早期社会主义运动中的马克思主义与巴枯宁主义。"},{"en":"Bakuninism argues that a strong state cannot be a tool of liberation.","zh":"巴枯宁主义认为，强大的国家不可能成为解放的工具。"},{"en":"In class, we discussed how Bakuninism influenced later anarchist groups.","zh":"课上我们讨论了巴枯宁主义如何影响后来的无政府主义团体。"}]}],"synonyms":["anarchism","revolutionary anarchism","collectivist anarchism","anti-statism"],"phonetic":"/bəˈkuːnɪnɪzəm/","extraExplanation":["巴枯宁主义通常被视为“集体主义无政府主义”（collectivist anarchism）的代表：主张推翻国家与资本主义，通过工人/社群的联合与自治来组织社会，而不是建立一个“过渡性的强国家”。","历史语境上，它常出现在第一国际（国际工人协会）内部与马克思主义路线的争论中：核心分歧之一是“是否可以通过夺取国家政权来实现解放”。","在英语写作里，Bakuninism多用于学术或历史讨论，有时也会被批评者用作带立场的标签；使用时最好说明你指的是巴枯宁的哪些具体主张。"]}
{"word":"bakuninism","summary":{"en":"Bakuninism is Bakunin’s anti-authoritarian anarchist political philosophy, opposed to the state and hierarchical power.","zh":"巴枯宁主义是一种反权威的无政府主义政治思想，反对国家与等级化权力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a political philosophy based on the ideas of Mikhail Bakunin: revolutionary, anti-authoritarian anarchism that opposes the state and hierarchical power, often linked to collectivist (shared) ownership.","zh":"“巴枯宁主义”：以米哈伊尔·巴枯宁思想为核心的政治理念；强调革命性的反权威无政府主义，反对国家与等级权力结构，常与集体主义（共同占有/共享）观念相关。"},"examples":[{"en":"Bakuninism argues that real freedom cannot exist under a powerful state.","zh":"巴枯宁主义认为，在强大的国家机器之下不可能有真正的自由。"},{"en":"Some historians describe the split in the workers’ movement as a conflict between Marxism and Bakuninism.","zh":"一些历史学家把工人运动的分裂描述为马克思主义与巴枯宁主义之间的冲突。"}]}],"synonyms":["Bakuninist anarchism","collectivist anarchism","anarchism (broader)"],"phonetic":"/bəˈkuːnɪnɪzəm/","extraExplanation":["“Bakuninism”来自俄国革命者米哈伊尔·巴枯宁（Mikhail Bakunin, 1814–1876）的姓氏 + “-ism”（……主义）。常见于政治思想史语境。","它通常被归入“无政府主义（anarchism）”的一支，强调反对国家、反对集中权力与等级组织，主张通过群众的直接行动与革命来实现社会变革。","与马克思主义的经典分歧点常被概括为：是否需要一个过渡性的“工人国家/无产阶级专政”。巴枯宁倾向认为国家权力会自我强化，最终背离解放目标。"]}
{"word":"Bakuninist","summary":{"en":"“Bakuninist” means a person or idea connected to Mikhail Bakunin’s anarchist, anti-authoritarian politics.","zh":"“Bakuninist”指与巴枯宁的无政府主义、反权威政治思想相关的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a follower of Mikhail Bakunin’s anarchist ideas, especially the belief that the state should be abolished and replaced by voluntary cooperation.","zh":"巴枯宁主义者；巴枯宁派（指追随米哈伊尔·巴枯宁的无政府主义思想的人，尤其主张废除国家机器、以自愿合作取代之）。"},"examples":[{"en":"Some 19th‑century activists identified themselves as Bakuninists within the broader anarchist movement.","zh":"一些19世纪的活动家在更广泛的无政府主义运动中自称为巴枯宁主义者。"},{"en":"The newspaper criticized the Bakuninists for rejecting participation in parliamentary politics.","zh":"这份报纸批评巴枯宁主义者拒绝参与议会政治。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or characteristic of Bakunin’s version of anarchism, often emphasizing anti-authoritarian revolution and distrust of centralized power.","zh":"巴枯宁主义的；具有巴枯宁式无政府主义特征的（常强调反权威革命与对集中权力的不信任）。"},"examples":[{"en":"The group’s platform took a strongly Bakuninist stance against centralized leadership.","zh":"该团体的纲领对集中式领导采取了强烈的巴枯宁主义立场。"},{"en":"His writing combines socialist language with a Bakuninist suspicion of the state.","zh":"他的写作把社会主义话语与巴枯宁主义对国家的不信任结合在一起。"}]}],"synonyms":["anarchist","anti-authoritarian","libertarian socialist"],"phonetic":"/bəˈkuːnɪnɪst/","extraExplanation":["“Bakuninist”来自俄国革命思想家米哈伊尔·巴枯宁（Mikhail Bakunin, 1814–1876）的姓名。巴枯宁是19世纪无政府主义的重要代表之一，常与马克思在“第一国际”（国际工人协会）中的路线分歧一起被提及。","在英语语境里，这个词多见于政治史、思想史或学术写作；日常对话里更常用更宽泛的词如 “anarchist（无政府主义者）”。"]}
{"word":"bakuninist","summary":{"en":"Bakuninist = a person (or idea) connected to Mikhail Bakunin’s collectivist anarchism.","zh":"Bakuninist＝与巴枯宁的集体主义无政府主义相关的人或思想。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a follower of Mikhail Bakunin or his political ideas, especially collectivist anarchism (anti-state, pro-worker self-organization).","zh":"巴枯宁主义者；追随米哈伊尔·巴枯宁或其政治思想的人，尤指集体主义无政府主义（反国家、强调工人自组织）。"},"examples":[{"en":"Some 19th-century radicals called themselves Bakuninists and rejected any form of state power.","zh":"一些19世纪的激进派自称巴枯宁主义者，并拒绝任何形式的国家权力。"},{"en":"In the debate, he argued from a Bakuninist perspective, warning that a “workers’ state” could become another kind of oppression.","zh":"在辩论中，他从巴枯宁主义者的立场出发，警告“工人国家”可能变成另一种压迫。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Mikhail Bakunin or to Bakuninist ideas; advocating Bakunin-style anarchism.","zh":"巴枯宁（主义）的；与巴枯宁或巴枯宁主义思想相关的；主张巴枯宁式无政府主义的。"},"examples":[{"en":"The group published a Bakuninist pamphlet criticizing centralized political parties.","zh":"该团体出版了一本巴枯宁主义小册子，批评集中的政党组织。"},{"en":"Her essay takes a Bakuninist view of revolution as a bottom-up movement.","zh":"她的文章以巴枯宁主义的观点看待革命，认为革命应由下而上推动。"}]}],"synonyms":["anarchist","collectivist anarchist","anti-statist"],"phonetic":"/bəˈkuːnɪnɪst/","extraExplanation":["“Bakuninist”来自俄国革命思想家米哈伊尔·巴枯宁（Mikhail Bakunin, 1814–1876）的姓氏。该词多出现在政治史、思想史或无政府主义相关讨论中，日常英语里不常用。","巴枯宁与马克思在“第一国际”（International Workingmen’s Association）中曾发生著名分歧：巴枯宁更强调反对任何形式的国家与集中权力，主张通过工人和社群的自发联合与自治来实现社会变革。"]}
{"word":"bakupari","summary":{"en":"“bakupari” is not a standard English word; its meaning likely depends on context (name or transliteration).","zh":"“bakupari”不是标准英语单词；很可能是专名或音译词，需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. “bakupari” is likely a proper name (person/place/brand) or a transliterated word from another language, so its meaning depends on context.","zh":"不是标准英语单词。“bakupari”很可能是专有名词（人名/地名/品牌等）或其他语言的音译词，因此含义需要结合语境判断。"},"examples":[{"en":"I couldn’t find “bakupari” in an English dictionary—where did you see it?","zh":"我在英语词典里查不到“bakupari”——你是在哪里看到的？"},{"en":"Is “bakupari” a name, a place, or a product? If you share the sentence, I can help interpret it.","zh":"“bakupari”是人名、地名还是产品名？如果你把整句话发来，我可以帮你判断意思。"}]}],"extraExplanation":["目前在常见英语词典与语料中，“bakupari”并不常见，可能是：\n1）拼写有误（例如少打/多打字母）；\n2）来自其他语言的音译（如日语、南亚语言等）；\n3）专有名词（社交账号、游戏ID、店名、歌曲名）。\n\n如果你能提供：出现的平台/领域（游戏、动漫、地理、菜名等）、原句或截图，我可以更准确地给出含义与用法。"]}
{"word":"Bakutu","summary":{"en":"Bakutu is a loanword (often from Japanese) meaning “gambler,” commonly used to describe a high-stakes gambler type in stories or pop culture.","zh":"Bakutu 常被当作源自日语的外来词，意思是“赌徒”，在故事或流行文化中常指“豪赌/高风险下注”的赌徒形象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(From Japanese) an (often illegal) gambler; a member of a traditional Japanese gambling group.","zh":"（源自日语）赌徒（常指非法赌博者）；传统日本赌博团体成员。"},"examples":[{"en":"In some historical stories, a bakutu lives by gambling and quick deals.","zh":"在一些历史故事里，bakutu 靠赌博和快速交易为生。"},{"en":"The film shows a bakutu who wants to leave the gambling life behind.","zh":"电影里描写了一位想告别赌博生活的 bakutu。"}]},{"partOfSpeech":"n.","definition":{"en":"A term used in pop culture (games, anime, online communities) to evoke a “high-stakes gambler” character type.","zh":"在流行文化（游戏、动漫、网络社群）中，用来指“豪赌/高风险下注”的赌徒角色类型。"},"examples":[{"en":"He built his character as a bakutu—calm, sharp, and always betting big.","zh":"他把角色设定成 bakutu——冷静、精明、总是下大注。"},{"en":"Some fans use “bakutu” as a cool label for a gambler archetype.","zh":"一些粉丝把“bakutu”当作很酷的称呼，用来指赌徒原型角色。"}]}],"synonyms":["gambler","high roller","bettor"],"phonetic":"/bɑˈkuːtuː/","extraExplanation":["“Bakutu”更常见的罗马字写法是 **bakuto**，对应日语 **博徒（ばくと）**，意思是“赌徒”。如果你是在某个作品、人名、地名或品牌里看到“Bakutu”，也可能是作者的拼写变体。","历史与文化背景：在日本近世社会中，“博徒”常与地下赌博、灰色地带组织有联系；在文学与影视里也常被塑造成“靠胆识与运气吃饭”的人物形象。","相关词：**gambler**（赌徒，普通英语词）、**high roller**（豪客/大赌客）、**bet big**（下重注）。"]}
{"word":"bakutu","summary":{"en":"“bakutu” isn’t recognized as a common English word; it’s likely a misspelling or a non-English/proper-name form.","zh":"“bakutu”不是常见英语词；更可能是拼写错误或外语/专有名词的写法。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username/proper name, or a romanized word from another language.","zh":"不是标准英语单词。可能是拼写错误、用户名/专有名词，或来自其他语言的拉丁字母转写。"},"examples":[{"en":"I can’t find “bakutu” in an English dictionary—where did you see it?","zh":"我在英语词典里查不到“bakutu”——你是在哪里看到的？"},{"en":"If you meant a name (Bakutu), please tell me the country or context.","zh":"如果你指的是名字（Bakutu），请告诉我国家或使用语境。"}]}],"phonetic":"/bəˈkuːtuː/","extraExplanation":["“bakutu”在常见英语词典中没有固定词条。它更像是：\n1）拼写误差（例如你想写的是别的英文单词）；\n2）专名（人名、地名、网名、品牌名）；\n3）其他语言的转写。\n\n如果你能补充一句原句/截图，或告诉我它来自哪种语言/地区，我可以帮你确认真正的词、含义和更自然的英文表达。","一个常见的相近转写是日语「博徒」(bakuto)，意为“赌徒/赌客”（较旧或文学化的用法）。但“bakutu”是否就是它，需要你的语境来确认。"]}
{"word":"bakwarda","summary":{"en":"Backward means ‘toward the back/in reverse’ or ‘behind in progress’ (correct spelling of ‘bakwarda’).","zh":"Backward 意为“向后/倒着”或“落后、不够先进”；“bakwarda”应为 backward 的拼写错误。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Correct spelling: backward) Moving toward the back; behind; in the opposite direction from forward.","zh":"（正确拼写：backward）向后（的）；在后面；与“向前”相反的方向。"},"examples":[{"en":"Take one step backward.","zh":"向后退一步。"},{"en":"She leaned backward to look up at the sky.","zh":"她向后仰头看天空。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Correct spelling: backward) Less advanced than expected; not developing quickly; behind others in progress.","zh":"（正确拼写：backward）落后的；发展缓慢的；进度不如预期的。"},"examples":[{"en":"The project is running backward compared with the plan.","zh":"这个项目的进度比计划落后。"},{"en":"He felt backward in math this semester.","zh":"这学期他觉得自己的数学落后了。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Correct spelling: backward) Toward the back or to an earlier point in time or order; in reverse.","zh":"（正确拼写：backward）向后；往回；倒着（按时间或顺序回退）。"},"examples":[{"en":"Don’t walk backward on the stairs.","zh":"不要在楼梯上倒退着走。"},{"en":"She counted backward from ten.","zh":"她从十开始倒数。"}]}],"synonyms":["back","rearward","in reverse","behind","regressive"],"phonetic":"ˈbækwɚd","extraExplanation":["“bakwarda”看起来像是把 backward 拼错了：常见错误是漏掉字母 c（写成 *bakward*），或多加字母（如 *bakwarda*）。正确拼写是 **backward**（美式常用；英式也常见 **backwards** 作副词）。","小提示：**back + ward**，其中 **-ward** 表示“朝……方向”（如 *forward, inward, outward*），所以 *backward* 就是“朝后”。"]}
{"word":"Bakwena","summary":{"en":"Bakwena: a Tswana-speaking people/clan in Southern Africa, traditionally linked with the crocodile totem.","zh":"Bakwena：南部非洲的一个茨瓦纳语族群/氏族，传统上与鳄鱼图腾相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A Tswana-speaking people/clan in Southern Africa (especially in Botswana and South Africa), traditionally associated with the totem of the crocodile.","zh":"（专有名词）南部非洲的一个茨瓦纳语族群/氏族（主要在博茨瓦纳与南非），传统图腾与“鳄鱼”有关。"},"examples":[{"en":"The Bakwena are one of the major Tswana groups in Botswana.","zh":"Bakwena 是博茨瓦纳主要的茨瓦纳族群之一。"},{"en":"In local history lessons, students may learn about Bakwena leaders and migration stories.","zh":"在地方历史课上，学生可能会学习 Bakwena 的领袖与迁徙故事。"}]}],"synonyms":["Kwena people"],"phonetic":"/bɑˈkweɪnə/","extraExplanation":["“Bakwena”来自班图语系常见的人称/族群前缀：Ba- 常指“人们/某族人”。“-kwena”与茨瓦纳语中“鳄鱼”（kwena）有关，因此该族群常被称为“鳄鱼族/以鳄鱼为图腾的人”。","这是一个族群名称，通常首字母大写（Bakwena）。在不同资料中也可能看到相关拼写或对应称呼，如与“Kwena/Kwena people”相关的用法。"]}
{"word":"Bakweri","summary":{"en":"Bakweri refers to an ethnic group in southwest Cameroon and also to the language they speak.","zh":"Bakweri 指喀麦隆西南部的巴克韦里民族，也可指他们所说的巴克韦里语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an ethnic group in southwest Cameroon, traditionally living around Mount Cameroon.","zh":"（巴克韦里人）喀麦隆西南部的一个民族成员，传统上居住在喀麦隆山（Mount Cameroon）周边。"},"examples":[{"en":"The Bakweri are one of the indigenous peoples of the Mount Cameroon region.","zh":"巴克韦里人是喀麦隆山地区的原住民族之一。"},{"en":"Bakweri communities have a strong connection to the land around the mountain.","zh":"巴克韦里社区与山周边的土地有很深的联系。"}]},{"partOfSpeech":"n.","definition":{"en":"the Bantu language spoken by the Bakweri people.","zh":"（巴克韦里语）巴克韦里人使用的一种班图语。"},"examples":[{"en":"Some children learn Bakweri at home and English at school.","zh":"有些孩子在家里学巴克韦里语，在学校学英语。"},{"en":"Bakweri is one of the local languages of Cameroon.","zh":"巴克韦里语是喀麦隆的地方语言之一。"}]}],"synonyms":["Bakweri people","Bakweri language"],"phonetic":"/bəˈkwɛri/","extraExplanation":["“Bakweri”既可指“民族”（the Bakweri people），也可指他们的语言（the Bakweri language）。在阅读人类学、历史或非洲研究资料时常见。","喀麦隆是多语言国家，除英语、法语外，还有许多本地语言；因此在语境中要注意“Bakweri”是指人还是指语言。","拼写上常见变体包括 Bakweri / Bakwiri（资料或转写系统不同导致）。"]}
{"word":"Bakwiri","summary":{"en":"Bakwiri refers to an ethnic group in southwest Cameroon near Mount Cameroon; it can also describe things related to their culture.","zh":"Bakwiri 指喀麦隆西南部喀麦隆山附近的巴夸里民族；也可作形容词表示与其文化相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a people (ethnic group) from the Mount Cameroon area in southwest Cameroon, especially around Buea and Limbe","zh":"巴夸里人（喀麦隆西南部喀麦隆山一带的民族，主要分布在布埃亚、林贝附近）"},"examples":[{"en":"The Bakwiri are one of the communities living on the slopes of Mount Cameroon.","zh":"巴夸里人是居住在喀麦隆山山坡上的社区之一。"},{"en":"She is Bakwiri and grew up near Buea.","zh":"她是巴夸里人，在布埃亚附近长大。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Bakwiri people or their culture","zh":"巴夸里人的；与巴夸里文化相关的"},"examples":[{"en":"The museum displayed Bakwiri cultural artifacts.","zh":"博物馆展出了巴夸里文化的文物。"}]}],"synonyms":["Bakweri"],"phonetic":"/bɑːˈkwɪəri/","extraExplanation":["“Bakwiri”也常见作“Bakweri”（另一种常用拼写）。在英语文章里，这类民族名称有时既可作名词（a Bakwiri / the Bakwiri），也可作形容词（Bakwiri traditions）。","在历史与文化语境中，Bakwiri常与喀麦隆山（Mount Cameroon）、沿海城镇林贝（Limbe，旧称Victoria）以及殖民时期的土地与种植园议题一同出现。"]}
{"word":"bakwiri","summary":{"en":"Bakwiri refers to the indigenous Bakwiri people of the Mount Cameroon area, their language (often spelled Bakweri), and anything related to their culture.","zh":"Bakwiri 指喀麦隆喀麦隆山一带的巴夸里族群，也可指其语言（常拼作 Bakweri）以及与其文化相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an indigenous people living mainly on the slopes of Mount Cameroon (especially around Buea and Limbe), in Cameroon","zh":"巴夸里人（喀麦隆的一个原住民族，主要居住在喀麦隆山一带，如布埃亚、林贝附近）"},"examples":[{"en":"The Bakwiri have long lived on the fertile land around Mount Cameroon.","zh":"巴夸里人长期居住在喀麦隆山周边肥沃的土地上。"},{"en":"She is Bakwiri, and her family is from the Buea area.","zh":"她是巴夸里人，她的家人来自布埃亚一带。"}]},{"partOfSpeech":"n.","definition":{"en":"the Baki(w)iri language (usually called Bakweri), spoken in Southwest Cameroon","zh":"巴夸里语（常见拼写为 Bakweri；喀麦隆西南部使用的一种语言）"},"examples":[{"en":"He can greet visitors in Bakwiri as well as in English.","zh":"他不仅会用英语，也会用巴夸里语向来访者问候。"},{"en":"Some local stories are recorded in Bakwiri/Bakweri.","zh":"一些当地故事以巴夸里语（Bakwiri/Bakweri）记录下来。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Bakwiri people or their language and culture","zh":"与巴夸里人、其语言或文化相关的"},"examples":[{"en":"They served Bakwiri dishes made with local plantains and fish.","zh":"他们端上了用当地芭蕉和鱼做的巴夸里风味菜肴。"},{"en":"The museum includes Bakwiri cultural artifacts.","zh":"博物馆里有巴夸里文化的器物。"}]}],"synonyms":["Bakweri"],"phonetic":"/bɑːˈkwɪri/","extraExplanation":["“Bakwiri”常见于英语文献中作为族名或形容词；也常见拼写变体“Bakweri”。在学术与新闻语境里，有时会同时出现两种拼写，指向同一族群/语言。"]}

