{"word":"BAM","summary":{"en":"“Bam” is a sound-effect word for something sudden and loud, and it can also mean a sudden hit or the act of hitting hard.","zh":"“Bam”常作拟声词表示突然响亮的“砰”，也可指一次撞击或“猛击/撞上”的动作。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"Used as a sound effect to show a sudden loud impact or surprise, like something hitting or happening instantly.","zh":"（拟声词）用来表示突然、响亮的撞击声或突发事件，强调“砰的一下/突然发生”。"},"examples":[{"en":"Bam! The door slammed shut.","zh":"砰！门猛地关上了。"},{"en":"I turned the corner and—bam—there he was.","zh":"我一转弯——突然——他就在那儿。"},{"en":"Bam, the lights went out.","zh":"突然一下，灯全灭了。"}]},{"partOfSpeech":"n.","definition":{"en":"A sudden hit, impact, or loud striking sound.","zh":"突然的一击/撞击；砰的一声。"},"examples":[{"en":"There was a bam from upstairs, and everyone looked up.","zh":"楼上传来“砰”的一声，大家都抬头看。"},{"en":"He heard a bam against the wall.","zh":"他听到墙上“砰”的一声。"}]},{"partOfSpeech":"vt.","definition":{"en":"To hit or strike something hard; to crash into something.","zh":"猛击；撞上。"},"examples":[{"en":"He bammed his knee on the table.","zh":"他膝盖猛地撞到桌子上了。"},{"en":"The ball bammed into the window.","zh":"球猛地撞上了窗户。"}]}],"synonyms":["bang","wham","pow","smack"],"phonetic":"/bæm/","extraExplanation":["“bam”常见于漫画、电影字幕和口语叙述中，用来制造画面感：强调动作突然、声音很响或结果很直接。写作中也可用破折号（—bam—）来表现突如其来的转折。"]}
{"word":"bam","summary":{"en":"“Bam” means a sudden loud hit/explosion sound, and it can also mean to make that sound (hit or slam).","zh":"“bam”表示“砰”的巨响，也可作动词表示“猛击/砰地关上”，还可作拟声感叹词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sudden loud sound, especially one made by an удар, explosion, or something hitting a surface.","zh":"（尤指撞击、爆炸或重物落地造成的）砰的一声，巨响。"},"examples":[{"en":"We heard a loud bam, and the door flew open.","zh":"我们听到“砰”的一声巨响，门一下子被撞开了。"},{"en":"The book fell off the table with a bam.","zh":"书从桌上掉下来，“砰”的一声。"}]},{"partOfSpeech":"v.","definition":{"en":"To hit, shut, or put something down with a sudden loud noise.","zh":"（使）猛击；砰地关上；砰地放下。"},"examples":[{"en":"He bammed the door shut because he was angry.","zh":"他因为生气把门“砰”地一声关上了。"},{"en":"Don’t bam the lid—close it gently.","zh":"别把盖子“砰”地一声盖上——轻轻关上。"}]},{"partOfSpeech":"int.","definition":{"en":"Used to represent the sound of an удар or explosion in speech, stories, comics, or lyrics.","zh":"（拟声词）表示撞击或爆炸的声音，常用于口语、故事、漫画或歌词里。"},"examples":[{"en":"Bam! The fireworks lit up the sky.","zh":"砰！烟花点亮了天空。"},{"en":"In the comic, the punch is written as “BAM!”","zh":"在漫画里，那一拳旁边写着“BAM!”。"}]}],"synonyms":["bang","boom","thud","slam"],"phonetic":"/bæm/","extraExplanation":["“bam”是拟声词（onomatopoeia），用声音来“模仿声音”。英语里常见的类似词还有“bang”（砰/嘭）、“boom”（轰）、“thud”（咚，闷响）。","口语里“bam”也常用来强调“突然、立刻发生”，例如：“And then, bam, everything changed.”（然后一下子，一切都变了。）这种用法更像语气词。"]}
{"word":"BAMAF","summary":{"en":"BAMAF is an informal variant of BAMF, praising someone as extremely tough or impressive (originally from a vulgar phrase).","zh":"BAMAF是BAMF的非正式变体，用来夸人非常硬核/厉害（来源于一句含粗口的缩写）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(slang, informal) A spelling/variant of “BAMF,” meaning a very tough, impressive, or fearless person; originally short for a vulgar phrase (“badass motherf***er”), often softened to avoid writing the profanity.","zh":"（俚语，非正式）“BAMF”的一种写法/变体，指“很厉害、很硬核、很让人佩服的人”；最初来自一句带脏话的缩写（“badass motherf***er”），常用这种写法来回避直接写粗口。"},"examples":[{"en":"She fixed the car on the side of the road by herself—total BAMAF.","zh":"她一个人在路边把车修好了——简直太硬核了（BAMAF）。"},{"en":"He’s not trying to sound rude; he just means you did something really impressive—BAMAF.","zh":"他不是想说粗话；他只是想表达你做得非常厉害——BAMAF。"}]}],"synonyms":["BAMF","badass","tough","legend","beast (slang)"],"phonetic":"/ˈbæmˌæf/","extraExplanation":["BAMAF并不是非常标准、通用的缩写；更常见的是BAMF。不同圈子也可能把BAMAF当作某个组织、学校或项目名称的首字母缩写，所以如果你是在特定文本/社群里看到的，给我一句原句我可以更准确判断。","语体提醒：它来源于带粗口的表达，即使写成BAMAF/BAMF也可能显得粗鲁；在正式场合（工作邮件、课堂写作等）不建议使用。"]}
{"word":"bamah","summary":{"en":"Bamah means a biblical “high place,” a raised site used for worship or sacrifice.","zh":"Bamah 指《圣经》中的“高处／丘坛”，即在高地上的敬拜或献祭地点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In the Hebrew Bible (Old Testament), a “high place”: an elevated site used for worship or sacrifice, sometimes connected with non‑Israelite religious practices.","zh":"（圣经希伯来语词）“高处／丘坛”：指建在高地上的敬拜或献祭地点，有时与以色列以外的宗教崇拜有关。"},"examples":[{"en":"The prophet criticized people for worshiping at the bamah instead of in the temple.","zh":"先知批评人们在丘坛（bamah）敬拜，而不是在圣殿里敬拜。"},{"en":"Archaeologists debate whether a hilltop altar was a bamah or part of a different ritual site.","zh":"考古学家争论一处山顶祭坛究竟是不是丘坛（bamah），还是另一种仪式场所。"}]}],"synonyms":["high place","hill shrine","cult site"],"phonetic":"/ˈbɑːmə/","extraExplanation":["“bamah”是从希伯来语音译来的学术用语，常见于圣经研究、考古和宗教学语境；英语里也会用复数形式“bamot”。","中文常译为“丘坛／高处”。在某些经文传统中，它既可能指地方性的敬拜场所，也常带有“非正统或被批评的崇拜地点”的含义，具体要看上下文。"]}
{"word":"Bamako","summary":{"en":"Bamako is the capital and largest city of Mali in West Africa.","zh":"Bamako（巴马科）是西非国家马里的首都和最大城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the capital and largest city of Mali, in West Africa, located on the Niger River","zh":"巴马科：马里（西非国家）的首都和最大城市，位于尼日尔河沿岸"},"examples":[{"en":"Bamako is the capital of Mali.","zh":"巴马科是马里的首都。"},{"en":"Many travelers visit Bamako before exploring other parts of Mali.","zh":"许多游客会先到巴马科，再去探索马里的其他地区。"},{"en":"Bamako sits on the Niger River and is an important cultural and economic center.","zh":"巴马科坐落在尼日尔河畔，是重要的文化与经济中心。"}]}],"synonyms":["capital of Mali","Bamako, Mali"],"phonetic":"/ˈbɑːməkoʊ/","extraExplanation":["“Bamako”是专有名词（地名），一般不加冠词；但在表示“巴马科市”这一整体时也可说“the city of Bamako”。","在新闻与国际关系语境中，常见搭配有“the Bamako government（巴马科政府，指马里中央政府）”“Bamako talks/accord（巴马科会谈/协议）”，用于指在巴马科举行的谈判或协议。"]}
{"word":"Bamalip","summary":{"en":"“Bamalip” is not a common English word; it’s likely a name/brand or a misspelling, so the meaning depends on context.","zh":"“Bamalip”不是常见英语词；更可能是名称/品牌或拼写错误，具体含义需要看上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or unclear term; not recognized as a common English word. It is most likely a proper name (e.g., a username, brand, product name, or place name) or a misspelling of another word.","zh":"非标准或含义不明的词；不属于常见英语词汇。更可能是专有名词（如用户名、品牌、产品名、地名等）或其他词的拼写错误。"},"examples":[{"en":"I saw “Bamalip” in a post, but I can’t find it in a dictionary—what does it mean here?","zh":"我在帖子里看到“Bamalip”，但词典里查不到——这里它是什么意思？"},{"en":"Could you share the sentence where you found “Bamalip”? It might be a brand name or a username.","zh":"你能把包含“Bamalip”的那句话发我吗？它可能是品牌名或用户名。"}]}],"phonetic":"ˈbæməˌlɪp","extraExplanation":["“Bamalip”不像是标准英语词。如果你能提供上下文（整句话/截图/链接、出现的平台、是否是人名或公司名），更容易判断含义。","它也可能是拼写误差：例如把两个词连写、大小写变化（BamaLip / Bama lip），或把相近字母打错。你可以确认是否想表达某个更常见的词。"]}
{"word":"bamalip","summary":{"en":"“bamalip” is not a standard English word; it’s likely a misspelling (possibly of “lip balm”).","zh":"“bamalip”不是标准英语词，可能是拼写错误（例如想写“lip balm / 润唇膏”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username/brand name, or a word from another language.","zh":"不是标准英语单词。可能是拼写错误、用户名/品牌名，或来自其他语言的词。"},"examples":[{"en":"I can’t find “bamalip” in standard English dictionaries—could you check the spelling?","zh":"在常见英语词典里找不到“bamalip”——你能确认一下拼写吗？"},{"en":"Did you mean “lip balm” (a product you put on your lips to prevent dryness)?","zh":"你是不是想说“lip balm”（润唇膏，用来防止嘴唇干裂）？"}]}],"extraExplanation":["“bamalip”很像把两个词连在一起或拼写打错了。一个常见可能是“lip balm（润唇膏）”，有时在口语或打字时会把顺序/字母弄乱。","如果你告诉我它出现的句子、语境（聊天/游戏/品牌/歌曲等）或原文截图，我可以更准确判断它可能是什么词或短语。"]}
{"word":"Bamana","summary":{"en":"Bamana refers to the Bamana (Bambara) people of Mali, their language, or anything related to their culture.","zh":"Bamana 指马里的巴马纳族（班巴拉族）、巴马纳语（常称班巴拉语），或与其文化相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Bamana (Bambara) people, an ethnic group mainly in Mali, West Africa.","zh":"巴马纳族（班巴拉族）成员；主要分布在西非马里。"},"examples":[{"en":"Many Bamana communities live in central and southern Mali.","zh":"许多巴马纳族社群居住在马里中部和南部。"},{"en":"The museum displayed Bamana masks and textiles.","zh":"博物馆展出了巴马纳族的面具和纺织品。"}]},{"partOfSpeech":"n.","definition":{"en":"the Bamana language (often called Bambara), a widely spoken Manding language in Mali.","zh":"巴马纳语（常称班巴拉语）；马里使用广泛的曼丁语支语言。"},"examples":[{"en":"She learned Bamana to communicate more easily while working in Mali.","zh":"她学习巴马纳语，以便在马里工作时更容易交流。"},{"en":"This greeting is common in Bamana.","zh":"这种问候语在巴马纳语中很常见。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Bamana people, their language, or their culture.","zh":"与巴马纳族、巴马纳语或其文化有关的。"},"examples":[{"en":"Bamana music often features complex rhythms.","zh":"巴马纳族音乐常包含复杂的节奏。"},{"en":"They visited a Bamana cultural center.","zh":"他们参观了一个巴马纳文化中心。"}]}],"synonyms":["Bambara","Bamana language","Bambara language"],"phonetic":"ˈbɑːmənə","extraExplanation":["“Bamana”和“Bambara”在英语里常被交替使用：Bamana更接近族群/语言的自称与拼写，而Bambara是法语与殖民时期文献中更常见的外来拼写。学习或查资料时，两种拼写都可能出现。","语言学上，Bamana（Bambara）通常被归入Manding/曼丁语组，在马里具有重要的通用语地位（在市场、媒体、日常交流中非常常见）。"]}
{"word":"Bamangwato","summary":{"en":"Bamangwato refers mainly to a major Tswana people/chiefdom in Botswana (centered historically around Serowe) and, less commonly, to their associated Setswana variety.","zh":"Bamangwato 主要指博茨瓦纳的一个重要茨瓦纳族群/传统酋邦（历史中心在塞罗韦一带），较少情况下也可指与其相关的茨瓦纳语变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a major Tswana ethnic group (and traditional chiefdom) in Botswana, historically centered around Serowe in the Central District","zh":"博茨瓦纳主要的茨瓦纳族群之一（及其传统酋邦/部族政体），历史中心在中部区的塞罗韦（Serowe）一带"},"examples":[{"en":"The Bamangwato are one of the largest Tswana groups in Botswana.","zh":"巴芒瓦托人是博茨瓦纳规模最大的茨瓦纳族群之一。"},{"en":"Serowe is often described as a historic center of the Bamangwato chiefdom.","zh":"塞罗韦常被称为巴芒瓦托酋邦的历史中心。"}]},{"partOfSpeech":"n.","definition":{"en":"the Setswana language/dialect variety associated with the Bamangwato people (often discussed under broader Setswana varieties)","zh":"与巴芒瓦托人相关的茨瓦纳语（Setswana）方言/变体（常在“茨瓦纳语诸变体”框架下讨论）"},"examples":[{"en":"Some words and pronunciations can differ slightly in Bamangwato speech compared with other Setswana varieties.","zh":"与其他茨瓦纳语变体相比，巴芒瓦托人的说法在个别词汇和发音上可能略有差异。"}]}],"synonyms":["Bangwato","Ngwato"],"phonetic":"/ˌbɑːmɑːŋˈwɑːtoʊ/","extraExplanation":["“Bamangwato”来自班图语系常见的人称/族群前缀：Ba- 常表示“人们/某族人”；“Ngwato/ Mangwato”与该族的名称相关。因此 Bamangwato 大致可理解为“（Ngwato 这一支的）人们”。","在英语资料中你也会看到拼写变体或相关称呼，如 **Bangwato**、**Ngwato**。在不同历史时期与不同转写系统下，拼写可能有所差异。"]}
{"word":"bamangwato","summary":{"en":"Bamangwato: a major Tswana people/community in central Botswana, also referring to their historical chiefdom/territory.","zh":"Bamangwato：博茨瓦纳中部重要的茨瓦纳族群/社群，也可指其历史上的酋邦/领地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Tswana (Setswana-speaking) people and traditional community in Botswana, centered historically in the Central District (notably around Serowe); also used to refer to their former chiefdom/territory.","zh":"博茨瓦纳的一个茨瓦纳（讲塞茨瓦纳语）族群与传统社群，历史上主要分布在该国中部地区（尤以塞罗韦 Serowe 一带著名）；也可指其旧时的酋邦/部族领地。"},"examples":[{"en":"The Bamangwato have played an important role in Botswana’s modern political history.","zh":"巴芒瓦托人在博茨瓦纳的现代政治史中扮演了重要角色。"},{"en":"Serowe is often described as a major cultural center for the Bamangwato.","zh":"塞罗韦常被认为是巴芒瓦托人的重要文化中心。"}]}],"synonyms":["Bangwato","BaNgwato","Ngwato"],"phonetic":"ˌbɑːmɑːŋˈwɑːtoʊ","extraExplanation":["“Bamangwato”常见的拼写也包括“Bangwato / BaNgwato”。在班图语族语言中，前缀“Ba-”常用来表示“某某人/某族人（复数）”，因此该词多指“Ngwato人”。","历史上与该社群相关的知名人物包括酋长Khama III，以及后来成为博茨瓦纳首任总统的Seretse Khama；这些人物使该名称在历史与政治语境中更常出现。","阅读或检索资料时，可同时尝试“Bangwato”“Ngwato”“Tswana”等关键词，以找到更多相关背景。"]}
{"word":"Bamar","summary":{"en":"Bamar refers to the largest ethnic group in Myanmar and also describes things related to them.","zh":"Bamar 指缅甸最大的族群“巴马族/缅族”，也可作形容词表示“巴马族的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the largest ethnic group in Myanmar (Burma), traditionally centered in the country’s central lowlands.","zh":"（缅甸的）巴马族人；缅族人（缅甸最大的族群，主要分布在中部平原地区）。"},"examples":[{"en":"Many Bamar people speak Burmese as their first language.","zh":"许多巴马族人以缅甸语为母语。"},{"en":"Myanmar is home to the Bamar and many other ethnic groups.","zh":"缅甸不仅有巴马族，还有许多其他族群。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Bamar people or their culture and language variety.","zh":"巴马族的；与巴马族文化或其语言变体有关的。"},"examples":[{"en":"Bamar cultural traditions have strongly influenced mainstream Myanmar culture.","zh":"巴马族的文化传统对缅甸主流文化影响很大。"},{"en":"The festival includes Bamar music and dance.","zh":"节庆活动包含巴马族音乐与舞蹈。"}]}],"synonyms":["Burman","Burmese (sometimes, less precise for ethnicity)"],"phonetic":"/ˈbɑː.mɑːr/","extraExplanation":["“Bamar”指的是缅甸境内的“巴马族/缅族”（一个族群）。而“Burmese”在英语里常有两种用法：一是指“缅甸人/缅甸的”（国籍或泛指全国），二是指“缅甸语”。因此在讨论族群身份时，用“Bamar”更准确，也更尊重多民族语境。","“Burman”是较旧或较少使用的写法/说法，现代写作中常用“Bamar”。在正式写作里，最好根据语境区分：民族（Bamar）vs. 国籍/国家（Myanmar/Burmese）。"]}
{"word":"bambacciata","summary":{"en":"A rare Italian loanword meaning “a childish act/remark; nonsense.”","zh":"一个罕见的意大利语借词，意为“幼稚的行为/话；胡闹；无聊的废话”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Italian loanword, rare in English) a childish act, remark, or piece of nonsense; childishness.","zh":"（意大利语借词，在英语中很少见）幼稚的行为/话；胡闹；孩子气。"},"examples":[{"en":"He dismissed the argument as a bambacciata and moved on.","zh":"他把那个论点斥为幼稚的胡闹，然后继续往下说。"},{"en":"Stop the bambacciate and speak seriously.","zh":"别再幼稚胡闹了，认真说话。"}]}],"synonyms":["childishness","nonsense","foolishness","immaturity","tomfoolery"],"phonetic":"/ˌbɑm.boʊ.tʃiˈɑː.tə/","extraExplanation":["“bambacciata”（更常见的意大利语拼写也写作“bambocciata”）源自表示“孩子/幼童”的词根（与意大利语 bambino 同源），常用于批评某人言行幼稚、无聊或不成熟。","它不是常用英语词；在英文文本中多见于引述意大利语、文学译文、或带有意大利文化语境的写作中。"]}
{"word":"bamban","summary":{"en":"Bamban is most commonly a Philippine place name (a municipality in Tarlac) and can also refer to the Bamban River.","zh":"Bamban 最常见是菲律宾的地名（打拉省的一个市镇），也可指 Bamban 河。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a town (municipality) in Tarlac province, on the island of Luzon in the Philippines.","zh":"菲律宾吕宋岛打拉省（Tarlac）的一个市镇（municipality），名为 Bamban。"},"examples":[{"en":"Bamban is a municipality in Tarlac, Central Luzon.","zh":"Bamban 是菲律宾中吕宋地区打拉省的一个市镇。"},{"en":"They visited Bamban to see family and attend a local festival.","zh":"他们去 Bamban 探亲并参加当地的节庆活动。"}]},{"partOfSpeech":"other","definition":{"en":"the name of a river in the Philippines (Bamban River), associated with the area around Bamban.","zh":"菲律宾的一条河流名称（Bamban River，Bamban 河），与 Bamban 一带相关。"},"examples":[{"en":"The Bamban River flows through parts of Tarlac.","zh":"Bamban 河流经打拉省的部分地区。"}]}],"phonetic":"/bɑmˈbɑn/","extraExplanation":["“Bamban”在英语里通常作为专有名词出现（地名/河名），不是常见的英语普通词汇。写作时一般首字母大写：Bamban。","如果你是在其他语境（例如某种方言、姓名、品牌、或网络用语）看到“bamban”，告诉我出现的句子/平台，我可以帮你判断具体含义。"]}
{"word":"Bambara","summary":{"en":"Bambara refers to a major ethnic group in Mali and their widely spoken language (also called Bamana), and it can also be an adjective meaning “related to them.”","zh":"Bambara 指马里的主要民族之一“班巴拉人”及其广泛使用的语言“班巴拉语（亦称巴马纳语）”，也可作形容词表示“与其相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a major ethnic group in Mali (West Africa), also found in neighboring countries","zh":"班巴拉人；西非马里等地的主要民族之一"},"examples":[{"en":"Many Bambara people live in central and southern Mali.","zh":"许多班巴拉人居住在马里中部和南部。"},{"en":"The museum displayed Bambara masks used in traditional ceremonies.","zh":"博物馆展出了用于传统仪式的班巴拉面具。"}]},{"partOfSpeech":"n.","definition":{"en":"the Mande language widely spoken in Mali; also called Bamana","zh":"班巴拉语（马里广泛使用的曼德语支语言）；也称巴马纳语"},"examples":[{"en":"She is learning Bambara to communicate with her host family in Mali.","zh":"她正在学习班巴拉语，以便与马里的寄宿家庭交流。"},{"en":"This health poster is written in French and Bambara.","zh":"这张健康海报用法语和班巴拉语写成。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Bambara people or their language and culture","zh":"班巴拉人的；班巴拉语的；与班巴拉文化有关的"},"examples":[{"en":"He studies Bambara music traditions.","zh":"他研究班巴拉音乐传统。"},{"en":"The book includes a short Bambara glossary.","zh":"这本书附有一小段班巴拉语词汇表。"}]}],"synonyms":["Bamana"],"phonetic":"/bæmˈbɑrə/","extraExplanation":["“Bambara”在英语里常用作外来称呼；许多使用者更常自称语言为“Bamana”（巴马纳语）。","班巴拉语在马里很常见，常作为通用语（lingua franca）使用；在日常生活、市场交易和广播中都很常听到。","英语中民族/语言名称通常首字母大写：Bambara。"]}
{"word":"bambara","summary":{"en":"Bambara refers to an ethnic group in Mali, their Mande language (also called Bamana), and anything related to their culture.","zh":"Bambara 指马里的班巴拉民族、他们使用的曼德语族语言（也称 Bamana），以及与其文化相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a major ethnic group in Mali (West Africa), also found in neighboring countries","zh":"班巴拉人：西非马里的主要民族之一（也分布在周边国家）"},"examples":[{"en":"Many Bambara people live in and around Bamako, Mali’s capital.","zh":"许多班巴拉人居住在马里首都巴马科及其周边地区。"},{"en":"The museum featured Bambara masks and sculpture.","zh":"博物馆展出了班巴拉面具和雕塑。"}]},{"partOfSpeech":"n.","definition":{"en":"the Mande language spoken by the Bambara people; also called Bamana","zh":"班巴拉语：班巴拉人使用的一种曼德语族语言，也称Bamana（巴马纳语）"},"examples":[{"en":"She is learning Bambara for fieldwork in Mali.","zh":"她正在学习班巴拉语，以便在马里开展田野工作。"},{"en":"This phrasebook includes basic Bambara greetings.","zh":"这本短语手册收录了基本的班巴拉语问候语。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Bambara people, their language, or their culture","zh":"班巴拉（人/语/文化）的；与班巴拉相关的"},"examples":[{"en":"Bambara music often features strong rhythm and call-and-response singing.","zh":"班巴拉音乐常以强烈节奏与呼应式演唱为特点。"},{"en":"He collected Bambara folktales.","zh":"他收集了班巴拉民间故事。"}]}],"synonyms":["Bamana"],"phonetic":"/bɑmˈbɑːrə/","extraExplanation":["“Bambara”常见于人类学、语言学与艺术史语境。语言名称也常写作“Bamana”，很多当代使用者更偏好“Bamana”这一自称。","班巴拉语在马里具有重要的通用语地位，日常交流中使用广泛；书写上既可见拉丁字母拼写，也可能见到本地区其他书写传统。","在艺术领域，“Bambara”常用来指与马里相关的面具、雕塑与仪式艺术；描述时建议避免把多样的马里文化一概而论。"]}
{"word":"Bamberg","summary":{"en":"Bamberg is a historic city in northern Bavaria, Germany, especially known for its UNESCO-listed old town and smoked beer.","zh":"Bamberg（班贝格）是德国巴伐利亚州北部的历史名城，以世界遗产古城区和烟熏啤酒闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A historic city in northern Bavaria, Germany, known for its old town, cathedral, and traditional smoked beer (Rauchbier).","zh":"德国巴伐利亚州北部的一座历史名城，以古城区、大教堂和传统烟熏啤酒（Rauchbier）闻名。"},"examples":[{"en":"We spent a weekend in Bamberg exploring the old town.","zh":"我们在班贝格度过了一个周末，逛了古城区。"},{"en":"Bamberg is famous for its Rauchbier, a beer with a smoky flavor.","zh":"班贝格以烟熏啤酒闻名，那是一种带烟熏风味的啤酒。"}]}],"synonyms":["Bamberg (city)"],"phonetic":"/ˈbɑmˌbɝɡ/","extraExplanation":["“Bamberg”常被直接音译为“班贝格”。它的古城区被列为联合国教科文组织世界遗产，因此在旅行、建筑史与欧洲中世纪城市研究中经常被提到。","班贝格在文化语境里也常与“弗兰肯（Franconia）”联系在一起：它属于巴伐利亚州，但饮食与方言等地方特色更偏弗兰肯地区。"]}
{"word":"Bamberger","summary":{"en":"“Bamberger” most often means a person from Bamberg, Germany, and it is also used as a surname.","zh":"“Bamberger”常指来自德国班贝格的人，也可作姓氏使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Bamberg, a historic city in Bavaria, Germany; someone connected with Bamberg.","zh":"班贝格人；（与德国巴伐利亚州历史名城班贝格有关的）人"},"examples":[{"en":"At the festival, a Bamberger explained the city’s famous smoked beer tradition.","zh":"在节日上，一位班贝格人介绍了这座城市著名的熏制啤酒传统。"},{"en":"She became a proud Bamberger after living in Bamberg for ten years.","zh":"在班贝格生活了十年后，她成了自豪的班贝格人。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname), originally indicating someone (or their ancestors) came from Bamberg.","zh":"班贝格（姓氏）；原本表示某人（或其祖先）来自班贝格"},"examples":[{"en":"Professor Bamberger will speak at the conference tomorrow.","zh":"班贝格教授将于明天在会议上发言。"},{"en":"In older records, the name Bamberger often appears in German-speaking communities.","zh":"在较早的记录中，Bamberger 这个姓氏常见于德语社群。"}]}],"synonyms":["(demonym) Bamberg resident","(surname) family name"],"phonetic":"/ˈbɑmbɚɡɚ/","extraExplanation":["“Bamberger”通常是地名衍生的称呼：Bamberg（班贝格）+ -er（表示“来自……的人”），类似于 New Yorker（纽约人）。","作为姓氏时，它在德语地区（也包括一些犹太家庭的姓氏传统）中出现，用来标记家族的地理来源。"]}
{"word":"Bambi","summary":{"en":"Bambi is the name of a famous fictional fawn, and informally it can mean a young, innocent, inexperienced person.","zh":"Bambi 是著名的虚构小鹿角色名；在口语中也可指天真、缺乏经验的年轻人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a famous fictional young deer (a fawn), best known from the Disney film *Bambi*","zh":"著名的虚构小鹿（幼鹿）角色，因迪士尼电影《小鹿斑比》而广为人知"},"examples":[{"en":"My little cousin loves watching *Bambi*.","zh":"我小表妹很喜欢看《小鹿斑比》。"},{"en":"The fawn in the picture looks like Bambi.","zh":"照片里的幼鹿看起来像斑比。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a very young, innocent, or inexperienced person","zh":"（非正式）天真、年纪轻或缺乏经验的人"},"examples":[{"en":"He’s a bit of a Bambi in the big city—everything is new to him.","zh":"在大城市里他有点像“斑比”——什么都觉得新鲜、经验不足。"},{"en":"Don’t worry if you feel like a Bambi on your first day at work.","zh":"如果你上班第一天觉得自己像个“斑比”，也别担心。"}]}],"synonyms":["fawn","innocent","newbie","rookie"],"phonetic":"/ˈbæmbi/","extraExplanation":["“Bambi”最早来自奥地利作家费利克斯·萨尔滕（Felix Salten）1923年的小说《Bambi, a Life in the Woods》，后来迪士尼在1942年改编成动画电影，使这个名字在英语文化中几乎成为“小鹿/幼鹿”的象征。","口语里把人叫作“a Bambi”通常带有“稚嫩、单纯、容易受伤”的感觉；语气多半不算恶意，但在正式场合可能显得不够礼貌，使用时要注意语境。"]}
{"word":"Bambie","summary":{"en":"“Bambi” is best known as the fictional fawn from Disney, and it can also mean someone very innocent or naive (informal).","zh":"“Bambi”最常指迪士尼作品中的小鹿斑比；也可（非正式）指非常天真或不谙世事的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bambi: a famous fictional young deer (a fawn), best known from the Disney film *Bambi* (1942). People also use “Bambi” as a name or nickname.","zh":"Bambi：著名的虚构小鹿（幼鹿）角色，最广为人知的是迪士尼动画电影《小鹿斑比》（1942）。人们也会把“Bambi”当作名字或昵称。"},"examples":[{"en":"My little sister loves *Bambi* and watches it every winter.","zh":"我妹妹很喜欢《小鹿斑比》，每年冬天都会看。"},{"en":"They named their puppy Bambi because she looks gentle and shy.","zh":"他们给小狗取名叫Bambi，因为她看起来温柔又害羞。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) A person—often a young woman—seen as very innocent, gentle, or a bit naive.","zh":"（非正式）形容一个人——常指年轻女性——非常天真、温柔，或有点不谙世事。"},"examples":[{"en":"In that tough workplace, she was seen as a bit of a “Bambi.”","zh":"在那个强硬的职场里，她被看作有点“太天真的人”。"},{"en":"He talks confidently, but he’s a Bambi when it comes to office politics.","zh":"他讲话很自信，但在办公室政治方面他其实很“单纯”。"}]}],"synonyms":["fawn","innocent (person)","naive (person)"],"phonetic":"/ˈbæmbi/","extraExplanation":["“Bambi”最早来自奥地利作家Felix Salten 1923年的小说《Bambi, a Life in the Woods》，后来被迪士尼改编成动画电影（1942）。在英语文化中，“Bambi”常带有“柔弱、无辜、需要保护”的联想，因此偶尔会被借用来形容人。"]}
{"word":"bambini","summary":{"en":"Bambini means “children/kids” (Italian plural), often used in arts or Italian-flavored contexts.","zh":"bambini意为“孩子们/小朋友们”（意大利语复数），常用于艺术或带意大利风格的语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Italian loanword) children; kids (plural). In English it’s often used in arts contexts (e.g., opera or choir) or playfully to mean “the little ones.”","zh":"（意大利语借词）孩子们；小朋友们（复数）。英语里常见于艺术语境（如歌剧、合唱团）或带点俏皮地指“小家伙们”。"},"examples":[{"en":"The opera includes a chorus of bambini who sing in the final scene.","zh":"这部歌剧在最后一幕有一群孩子合唱。"},{"en":"The restaurant is family-friendly—bambini are welcome.","zh":"这家餐厅很适合家庭——欢迎小朋友。"}]}],"synonyms":["children","kids","little ones"],"phonetic":"/bɑmˈbiːni/","extraExplanation":["“Bambini”是意大利语复数形式，单数是“bambino”（男孩/男童）或“bambina”（女孩/女童）。在英语中借用时，通常不严格区分性别，常泛指“孩子们”。","在正式英语写作里，更常用“children / kids”；“bambini”多见于歌剧、合唱、旅游餐饮（如菜单、招牌）等带意大利风格的语境，或作为幽默/亲昵的表达。"]}
{"word":"bambino","summary":{"en":"Bambino means a baby/young child, and it can also refer to Babe Ruth in baseball.","zh":"bambino 指婴儿/小宝宝；在棒球语境中也可特指贝比·鲁斯（Babe Ruth）的外号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a baby or very young child (often used as a friendly nickname)","zh":"婴儿；小宝宝（常作亲昵称呼）"},"examples":[{"en":"Come here, bambino—let me see your smile.","zh":"过来，小宝贝——让我看看你的笑容。"},{"en":"They welcomed their first bambino last spring.","zh":"他们去年春天迎来了第一个宝宝。"}]},{"partOfSpeech":"n.","definition":{"en":"(in baseball) a nickname for Babe Ruth, a famous American player","zh":"（棒球）“巴比诺”，贝比·鲁斯（Babe Ruth）的外号"},"examples":[{"en":"“The Bambino” changed baseball with his power hitting.","zh":"“巴比诺”以强力打击改变了棒球运动。"},{"en":"Some fans know the story of the “Curse of the Bambino.”","zh":"一些球迷知道“巴比诺魔咒”的故事。"}]}],"synonyms":["baby","infant","kid","little one","Babe Ruth (The Bambino)"],"phonetic":"/bæmˈbiːnoʊ/","extraExplanation":["“bambino”是意大利语，字面意思是“男宝宝/小男孩”；在英语里常被当作带点异国情调的亲昵称呼，不一定只指男孩，也可泛指“小宝宝”。","棒球文化中，“The Bambino”特指传奇球员Babe Ruth；“Curse of the Bambino（巴比诺魔咒）”是与波士顿红袜队长期无缘冠军相关的著名民间说法。"]}
{"word":"bambinos","summary":{"en":"“Bambinos” means “kids/young children,” often said in a warm, playful way.","zh":"“bambinos”表示“小朋友/孩子们”，常带亲切、俏皮的口吻。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of “bambino”) young children; kids (often used in a warm, slightly playful way).","zh":"（“bambino”的复数）小孩；孩子（常带亲昵、略俏皮的语气）。"},"examples":[{"en":"The restaurant is family-friendly, so the bambinos are welcome.","zh":"这家餐厅很适合家庭来，所以欢迎小朋友们。"},{"en":"Keep an eye on the bambinos near the pool.","zh":"泳池边要看好孩子们。"}]},{"partOfSpeech":"n.","definition":{"en":"A friendly nickname for a group of kids (sometimes used by adults, teachers, or caregivers).","zh":"对一群孩子的亲切称呼（有时被大人、老师或照护者使用）。"},"examples":[{"en":"Alright, bambinos—line up and let’s go!","zh":"好啦，小朋友们——排好队，我们出发！"},{"en":"The coach told the bambinos to warm up first.","zh":"教练让小朋友们先热身。"}]}],"synonyms":["kids","children","little ones","youngsters"],"phonetic":"/bɑmˈbiːnoʊz/","extraExplanation":["“bambino”是意大利语“孩子”的意思，英语里多借用来营造一种可爱、温馨或带点意大利风情的语气。常见于餐厅、旅行、育儿场景或轻松的口语表达中。","在正式写作中更常用“children/kids”；“bambinos”更偏口语、带风格色彩。"]}
{"word":"Bambo","summary":{"en":"“Bambo” is usually a misspelling; the common word is “bamboo,” a tall plant with hollow stems used for many products.","zh":"“Bambo”通常是拼写错误；常见单词是“bamboo（竹子）”，指茎中空且用途广泛的植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tall tropical plant with hard, hollow stems; the stems are used to make furniture, paper, building materials, and many other things","zh":"竹子；一种热带/亚热带植物，茎坚硬中空，可用于制作家具、纸张、建材等"},"examples":[{"en":"There’s a bamboo forest near the temple.","zh":"寺庙附近有一片竹林。"},{"en":"The restaurant uses bamboo chopsticks.","zh":"那家餐厅使用竹筷。"},{"en":"Pandas mainly eat bamboo.","zh":"熊猫主要吃竹子。"}]}],"synonyms":["bamboo (plant)","cane (sometimes, for similar stems)"],"phonetic":"/bæmˈbuː/","extraExplanation":["“Bambo”通常不是标准英语单词；最常见的正确拼写是 **bamboo**（竹子）。如果你想表达“欺骗、迷惑”，你可能想写的是 **bamboozle**（动词，意为“蒙骗、忽悠”）。","词源小知识：**bamboo** 通过葡萄牙语 *bambu* 进入英语，和早期欧洲人在亚洲、非洲接触到这种植物有关。","常见搭配：bamboo forest（竹林），bamboo shoots（竹笋），bamboo furniture（竹制家具），bamboo flooring（竹地板）。"]}
{"word":"bambocciade","summary":{"en":"Bambocciade are artworks—especially 17th‑century genre paintings—showing lively everyday scenes of ordinary people.","zh":"bambocciade 指描绘普通人日常生活场景的风俗画/题材作品，尤与17世纪“班博乔派”相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(art history) Paintings or artworks that depict everyday, sometimes rough or humorous scenes of common people (street life, peasants, taverns), especially in the 17th‑century Italian/Dutch “Bamboccianti” tradition.","zh":"（艺术史）描绘普通人日常生活（街头、农民、酒馆等）且常带粗犷或诙谐气息的风俗画/题材作品，尤指17世纪意大利/荷兰“班博乔派（Bamboccianti）”传统中的作品。"},"examples":[{"en":"The exhibition included several bambocciade showing busy Roman streets and tavern scenes.","zh":"这场展览展出了几幅bambocciade，描绘罗马街头的热闹与酒馆场景。"},{"en":"Critics once dismissed bambocciade as “low” subjects, but today they’re valued for their social detail.","zh":"评论家曾把bambocciade视为“低俗”题材，但如今人们重视它们所呈现的社会细节。"}]}],"synonyms":["genre painting","low-life scene","everyday-life scene","Bamboccianti-style genre scene"],"phonetic":"ˌbɑmboʊtʃiˈɑdeɪ","extraExplanation":["词源与背景：bambocciade 来自意大利语（常见单数 bambocciata / 复数 bambocciate；英语里有时也直接借用复数形式），与“Bamboccianti”画家群体有关。该名称源于绰号 Il Bamboccio（意为“胖娃娃/木偶般的小孩”），指画家 Pieter van Laer（彼得·范·拉尔）的外号。他在罗马活动，其风俗画风格影响了一批追随者。","用法提示：这个词在现代英语中较为学术/专业，主要出现在艺术史写作、博物馆图录与展览说明中。"]}
{"word":"bambochade","summary":{"en":"“bambochade” isn’t a recognized English word; it most likely refers to “bamboozle” (to trick or confuse someone).","zh":"“bambochade” 不是常见英语词；最可能是指 “bamboozle”（欺骗或迷惑某人）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling of “bamboozled” or “bamboozle.”","zh":"不是标准英语单词；很可能是把 “bamboozled / bamboozle” 拼错了。"},"examples":[{"en":"I couldn’t find “bambochade” in a dictionary—did you mean “bamboozled”?","zh":"我在词典里找不到 “bambochade”——你是不是想写 “bamboozled”？"},{"en":"If you meant “bamboozle,” it means to trick someone.","zh":"如果你想写的是 “bamboozle”，它的意思是“欺骗某人”。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Likely intended) “bamboozle”: to trick, confuse, or deceive someone.","zh":"（可能想表达的词）“bamboozle”：欺骗、迷惑、蒙蔽某人。"},"examples":[{"en":"The fake website bamboozled some shoppers into paying twice.","zh":"那个假网站骗得一些顾客付了两次钱。"},{"en":"Don’t let flashy ads bamboozle you—read the details.","zh":"别被花哨广告忽悠——要看清细节。"},{"en":"I was completely bamboozled by his confident explanation.","zh":"他讲得太自信了，把我彻底唬住了。"}]}],"synonyms":["trick","fool","deceive","mislead","con","hoodwink","dupe"],"phonetic":"/ˌbæmˈbuːzəl/","extraExplanation":["“bamboozle”常用于口语，语气偏轻松/带点幽默：表示“被忽悠、被耍、被绕晕”。如果是在正式写作中，也可以用更中性的词：deceive（欺骗）、mislead（误导）、trick（耍弄）。","如果你能把这个词放进一句完整的句子里（你看到它的地方/上下文），我也可以更准确判断你到底想写哪个词。"]}
{"word":"bamboche","summary":{"en":"Bamboche means a lively, often boozy party or spree (a rare, literary word).","zh":"bamboche 指热闹（常带饮酒）的狂欢聚会或放纵的一阵子（较少见、偏文学用词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lively, often noisy party or bout of drinking; revelry, a spree (rare, literary).","zh":"热闹（常带喧闹与饮酒）的聚会；狂欢；纵酒作乐（英语中较少见，偏文学用法）。"},"examples":[{"en":"After the exams, they went on a midnight bamboche that lasted until sunrise.","zh":"考试结束后，他们来了一场狂欢到天亮的午夜聚会。"},{"en":"He wrote about Paris nights of bamboche and cheap wine.","zh":"他写到巴黎夜晚的狂欢与廉价葡萄酒。"}]},{"partOfSpeech":"v.","definition":{"en":"to party hard; to carouse (very rare).","zh":"狂欢作乐；纵酒狂饮（非常少见）。"},"examples":[{"en":"They bamboched through the weekend and regretted it on Monday.","zh":"他们整个周末都在狂欢，周一就后悔了。"}]}],"synonyms":["revelry","spree","carouse","binge","party"],"phonetic":"/bɑmˈboʊʃ/","extraExplanation":["“bamboche”是法语借词，法语里常指“狂欢、纵酒作乐的聚会”。在英语中出现频率很低，多见于描写放纵夜生活的文学或带法式风味的语境。","发音上英语往往更“英文化”，末尾常读成类似“sh”的音；如果你在阅读中遇到它，把它理解为“revelry / spree（狂欢、放纵的一阵子）”通常最贴切。"]}
{"word":"Bamboo","summary":{"en":"Bamboo is a fast-growing plant with hollow stems, widely used as a strong, light material; it can also describe things made from bamboo.","zh":"Bamboo 指生长迅速、茎中空的竹子，也可作形容词表示“竹制的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tall, fast-growing plant (a type of grass) with hollow, woody stems, common in Asia and used to make many products.","zh":"竹子；一种高大、生长迅速的植物（属于禾本科草类），茎中空而坚硬，常见于亚洲，可用于制作多种物品。"},"examples":[{"en":"We planted bamboo along the fence for privacy.","zh":"我们在篱笆旁种了竹子来遮挡视线。"},{"en":"The table is made of bamboo, so it’s light but strong.","zh":"这张桌子是竹制的，所以很轻但很结实。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made from bamboo; using bamboo as the material.","zh":"竹制的；由竹子制成的。"},"examples":[{"en":"She bought a bamboo basket at the market.","zh":"她在市场买了一个竹篮。"},{"en":"Bamboo flooring is popular because it looks clean and modern.","zh":"竹地板很受欢迎，因为看起来干净又现代。"}]}],"synonyms":["bamboo plant","bamboo stalk","cane (sometimes, depending on context)"],"phonetic":"/bæmˈbuː/","extraExplanation":["“bamboo”在英语里通常是不可数名词（some bamboo），但也可以指“几株/一片竹子”时用复数（bamboos），尤其在植物学或谈不同种类时。","竹子在东亚文化中常象征“坚韧、正直、虚心”（中空但挺直）。英语文学里也常用“bamboo”营造亚洲意象或热带/园林氛围。","常见搭配：bamboo shoots（竹笋，食物）；bamboo grove（竹林）；bamboo forest（竹林/竹子森林）；bamboo rod/pole（竹竿）。"]}
{"word":"bamboo","summary":{"en":"Bamboo is a fast-growing plant with hollow woody stems, widely used as a material; it can also describe things made from bamboo.","zh":"bamboo 指竹子（生长快、茎中空的植物），也可作形容词表示“竹制的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tall, fast-growing plant with hollow, woody stems (culms), common in Asia and used for building, furniture, paper, and many other products.","zh":"竹子；一种生长很快、茎中空且呈木质的高大植物，常见于亚洲，被广泛用于建筑、家具、造纸等。"},"examples":[{"en":"The house has bamboo floors.","zh":"这栋房子铺的是竹地板。"},{"en":"Bamboo grows quickly in warm, wet climates.","zh":"竹子在温暖潮湿的气候里长得很快。"},{"en":"They made a fence from bamboo poles.","zh":"他们用竹竿做了一个栅栏。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made of bamboo (often describing objects, materials, or a light yellow-green color).","zh":"竹制的；（也可指）竹子般的浅黄绿色的。"},"examples":[{"en":"She carried a bamboo basket.","zh":"她提着一个竹篮。"},{"en":"He wore a bamboo hat to block the sun.","zh":"他戴着一顶竹帽遮阳。"}]}],"synonyms":["bamboo plant","bamboo cane","reed (similar but not the same plant)"],"phonetic":"/bæmˈbuː/","extraExplanation":["“Bamboo”在英语文化里常与“柔韧但坚韧（flexible but strong）”的意象联系在一起：弯而不折。","在文学与流行文化中，竹子常用来营造“东方/亚洲氛围”或自然宁静的场景；写作时注意避免把亚洲文化简单符号化，可结合具体地域与真实用途来表达。","常见搭配：bamboo shoot（竹笋，食材）；bamboo grove/forest（竹林）；bamboo pole（竹竿）；bamboo curtain（“竹幕”，冷战时期对中国的隐喻说法，类似 iron curtain）。"]}
{"word":"bamboos","summary":{"en":"“Bamboos” most commonly means the plural of “bamboo,” referring to bamboo plants (often different kinds or separate clumps).","zh":"“bamboos”最常见是“bamboo（竹子）”的复数，用来指多种竹子或多丛/多根竹子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of bamboo: tall, fast-growing woody grasses with hollow stems, often used for building, furniture, and food (bamboo shoots).","zh":"bamboo 的复数：一种高大、快速生长的木质禾本科植物（竹子），茎多为空心，常用于建材、家具和食物（竹笋）。"},"examples":[{"en":"Pandas mainly eat bamboos and bamboo leaves.","zh":"熊猫主要吃竹子和竹叶。"},{"en":"The garden has different bamboos that grow at different heights.","zh":"这个花园里有不同品种的竹子，高度各不相同。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of bamboo (rare): to hit or punish with a bamboo stick, or to force someone to do something.","zh":"bamboo 的第三人称单数（较少见）：用竹棍打/惩罚；或强迫某人做某事。"},"examples":[{"en":"In some historical accounts, an officer bamboos a prisoner as punishment.","zh":"在一些历史记载中，有官员用竹棍打犯人作为惩罚。"}]}],"synonyms":["bamboo plants","bamboo stalks","bamboo canes"],"phonetic":"/bæmˈbuːz/","extraExplanation":["日常英语里更常用的是不可数或集合用法的 “bamboo”（如：Bamboo grows quickly. / a bamboo forest）。说“many bamboos”通常是在强调“不同种类的竹子”或“几根/几丛竹子”。","与 bamboo 形近但意思不同的词是 “bamboozle”（使困惑、蒙骗）。两者没有直接的词义关系，学习时注意区分。"]}
{"word":"bamboozle","summary":{"en":"“Bamboozle” means to trick or confuse someone, often in a playful or informal way.","zh":"“bamboozle”指欺骗或把人弄糊涂，语气常较口语、有时带点诙谐。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to trick or confuse someone, often by using misleading information or clever talk","zh":"欺骗；蒙骗；把某人搞糊涂（常用误导信息或花言巧语）"},"examples":[{"en":"The salesman tried to bamboozle her into buying a more expensive model.","zh":"推销员想骗她买更贵的型号。"},{"en":"I was completely bamboozled by the complicated instructions.","zh":"我被那些复杂的说明弄得一头雾水。"}]}],"synonyms":["trick","deceive","con","hoodwink","mislead"],"phonetic":"/ˌbæmˈbuːzəl/","extraExplanation":["“bamboozle”语气比较口语、带点幽默感，有时强调“被绕晕/被忽悠”，不一定是非常严重的诈骗。","词源不太确定，可能来自18世纪的俚语；因为听起来俏皮，所以在日常对话、新闻评论里也很常见。","近义词辨析：scam 常指“骗局/诈骗”（更严重、更有预谋）；deceive 更正式；con 是口语（如 con artist）。"]}
{"word":"bamboozled","summary":{"en":"Bamboozled means tricked or thoroughly confused.","zh":"bamboozled 指“被忽悠/被骗了”或“被搞得一头雾水”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to trick, confuse, or fool someone (often in a playful or surprising way)","zh":"欺骗、蒙骗；把人弄糊涂（常带一点戏弄或出其不意的感觉）"},"examples":[{"en":"I got bamboozled by an online scam.","zh":"我被网络诈骗给骗了。"},{"en":"The puzzle bamboozled me at first.","zh":"这道谜题一开始把我搞糊涂了。"},{"en":"Don’t let the flashy ads bamboozle you into buying something you don’t need.","zh":"别让花哨的广告把你忽悠得去买不需要的东西。"}]},{"partOfSpeech":"adj.","definition":{"en":"completely confused or fooled","zh":"被彻底弄糊涂的；被骗得团团转的"},"examples":[{"en":"I was totally bamboozled by what he said.","zh":"他说的话让我完全摸不着头脑。"},{"en":"She looked bamboozled when the rules changed suddenly.","zh":"规则突然变了，她看起来一脸懵。"}]}],"synonyms":["tricked","fooled","deceived","confused","misled"],"phonetic":"/bæmˈbuːzəld/","extraExplanation":["“bamboozle”常见于口语和轻松语境，比起很严肃的“deceive/defraud”，语气更偏“忽悠、把人绕晕”。不过在谈到诈骗（scam）时也很常用。"]}
{"word":"bamboozlement","summary":{"en":"Bamboozlement means the act of tricking or confusing someone.","zh":"bamboozlement 指“欺骗或蒙蔽人的行为”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of tricking or confusing someone, often by using clever lies, misleading information, or distraction.","zh":"欺骗、蒙蔽或把人搞糊涂的行为；常指用花言巧语、误导信息或转移注意力来骗人。"},"examples":[{"en":"The contract was full of legal jargon, and it felt like pure bamboozlement.","zh":"合同里满是法律术语，让人感觉完全是在蒙人。"},{"en":"She realized the “limited-time offer” was just marketing bamboozlement.","zh":"她意识到所谓“限时优惠”只是营销套路、用来忽悠人的。"},{"en":"Don’t let their confidence become a form of bamboozlement.","zh":"别让他们的自信变成一种迷惑你的手段。"}]}],"synonyms":["deception","trickery","fraud","con","misdirection","hoodwinking"],"phonetic":"/bæmˈbuːz(ə)lmənt/","extraExplanation":["“bamboozlement”比较少见，更常用的是动词“bamboozle”（骗、忽悠）或名词“bamboozling”（欺骗的行为）。它带一点幽默或口语化的语气，常用于表达“被绕晕了/被忽悠了”的感受。","词源上与17世纪英语里的“bamboozle”相关，可能是当时的俚语创造词；在现代文化里常出现在轻松调侃的语境，比如广告、推销、花招。"]}
{"word":"bamboozler","summary":{"en":"A bamboozler is someone who deceives or tricks people.","zh":"bamboozler 指“欺骗、忽悠他人的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who tricks, fools, or deceives others (someone who bamboozles).","zh":"骗子；耍花招愚弄他人的人（使人上当的人）。"},"examples":[{"en":"Don’t let that smooth-talking bamboozler talk you into paying upfront.","zh":"别让那个嘴甜的骗子把你哄得先付款。"},{"en":"The email looked official, but it was written by a bamboozler trying to steal passwords.","zh":"那封邮件看起来很官方，但其实是骗子写的，想偷密码。"}]}],"synonyms":["trickster","con artist","swindler","deceiver","fraud"],"phonetic":"/bæmˈbuːzlər/","extraExplanation":["“bamboozler”来自动词“bamboozle”（欺骗、蒙骗）。这个词语气偏口语，常带一点幽默或不屑，用来形容爱耍手段、把人绕晕的人。","“bamboozle”在英语里大约17世纪开始流行，词源不太确定；因此它带有一种俚语式、夸张的“把人忽悠住”的感觉。"]}
{"word":"bamboozlers","summary":{"en":"“Bamboozlers” means people who deceive or trick others.","zh":"“bamboozlers”指欺骗、蒙人、耍花招的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who trick, deceive, or confuse others on purpose (plural of “bamboozler”).","zh":"骗子；耍花招欺骗或故意迷惑别人的人（“bamboozler”的复数）。"},"examples":[{"en":"Online bamboozlers often use fake photos to win your trust.","zh":"网络骗子常用假照片来骗取你的信任。"},{"en":"The audience laughed when the magician revealed how he had bamboozled them.","zh":"当魔术师揭开自己如何“把大家唬住”时，观众都笑了。"}]}],"synonyms":["tricksters","con artists","swindlers","frauds","deceivers"],"phonetic":"/bæmˈbuːzlərz/","extraExplanation":["“bamboozler”来自动词“bamboozle”（骗、唬、蒙）。这个词在英语里带一点口语和幽默感，常用于形容“被耍得团团转”的情况，但在严肃场合也可以指真正的欺诈。","常见搭配：bamboozle someone into doing something（把某人骗到去做某事）、get bamboozled（被蒙骗/被唬住）。"]}
{"word":"bamboozles","summary":{"en":"“Bamboozles” means “tricks or confuses (someone).”","zh":"“bamboozles”意思是“（把某人）骗了/忽悠了/弄糊涂了”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to trick or confuse someone, often by using lies, fancy words, or complicated details","zh":"用谎话、花言巧语或复杂细节欺骗或迷惑某人"},"examples":[{"en":"The scammer bamboozles people with fake emails that look official.","zh":"骗子用看起来很官方的假邮件来骗（迷惑）人们。"},{"en":"The salesperson bamboozles customers by adding hidden fees.","zh":"销售人员用隐藏费用来蒙骗顾客。"},{"en":"I felt bamboozled by all the technical jargon.","zh":"我被一堆技术术语弄得一头雾水（感觉被忽悠了）。"}]}],"synonyms":["tricks","fools","deceives","dupes","misleads","confuses"],"phonetic":"/bæmˈbuːzəlz/","extraExplanation":["“bamboozle”常带有口语色彩，语气比“deceive（欺骗）”更生动，暗含“把人绕晕/忽悠”的感觉。","词源不确定，可能来自17世纪的俚语，因此听起来有点“滑稽”，也常用于轻松或讽刺的语境。"]}
{"word":"bamboozling","summary":{"en":"“Bamboozling” means tricking or confusing someone, often through clever or misleading talk.","zh":"“bamboozling”指用花言巧语或误导手段蒙骗别人，或把人弄得很困惑。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"tricking or confusing someone, often by using clever talk or deceptive actions","zh":"（用花言巧语或欺骗手段）蒙骗、唬住、使困惑"},"examples":[{"en":"The salesperson was bamboozling customers with fake “limited-time” deals.","zh":"那个推销员用假的“限时优惠”来蒙骗顾客。"},{"en":"I felt bamboozled by all the complicated paperwork.","zh":"一堆复杂的文件让我感觉被唬得一头雾水。"},{"en":"Don’t let flashy ads bamboozle you—compare the facts.","zh":"别被花哨广告忽悠了——要对比事实。"}]}],"synonyms":["tricking","deceiving","misleading","confusing","conning"],"phonetic":"/bæmˈbuːzəlɪŋ/","extraExplanation":["“bamboozle”常带有口语色彩，语气比“deceive（欺骗）”更轻一些，强调“把人绕晕/忽悠住”的感觉；也可用于“被信息量或复杂性弄糊涂”，不一定有人恶意欺骗。","词源常被认为来自18世纪的俚语，具体来源不确定；因为发音有趣，这个词在英语里常用于生动、带点幽默的表达。"]}
{"word":"Bambos","summary":{"en":"Bamboo is a tall grass, and its hard stems are widely used as a material.","zh":"Bamboo 指竹子（植物），也指竹材（可用来制作和建造的材料）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tall, fast-growing grass with hard, hollow stems, common in Asia and other warm regions","zh":"竹子；一种高大、生长很快的禾本科植物，茎坚硬且中空，常见于亚洲及温暖地区"},"examples":[{"en":"Pandas eat bamboo almost all day.","zh":"熊猫几乎一整天都在吃竹子。"},{"en":"There’s a bamboo forest near the temple.","zh":"寺庙附近有一片竹林。"}]},{"partOfSpeech":"n.","definition":{"en":"the hard stem of this plant used as a material for building, furniture, or tools","zh":"竹材；竹子的茎，用作建筑、家具或工具材料"},"examples":[{"en":"The chair is made of bamboo.","zh":"这把椅子是用竹子做的。"},{"en":"They built a simple fence from bamboo poles.","zh":"他们用竹竿搭了一个简易篱笆。"}]},{"partOfSpeech":"adj.","definition":{"en":"made of bamboo; relating to bamboo","zh":"竹制的；与竹子有关的"},"examples":[{"en":"She carries a bamboo basket.","zh":"她提着一个竹篮。"},{"en":"We ordered bamboo chopsticks.","zh":"我们点了竹筷。"}]}],"synonyms":["bamboo plant","bamboo stalk","cane (sometimes, for the stem)"],"phonetic":"/bæmˈbuː/","extraExplanation":["“Bambos”本身在英语里不算常见词；很多学习者其实想查的是 **bamboo**（竹子）。如果你指的是人名、品牌名或地名（例如希腊语人名/姓氏），告诉我具体语境，我可以按正确词条解释。","词源小知识：**bamboo** 可能通过荷兰语或葡萄牙语（与东南亚语言接触）进入英语，因此拼写和发音与很多常见拉丁/希腊词根不太一样。","相关文化用法：**bamboo ceiling**（“竹子天花板”）是指亚裔等群体在职场中遇到的隐形晋升障碍；属于社会文化语境中的固定搭配。"]}
{"word":"bambos","summary":{"en":"Bamboo is a tall plant with hollow stems; it also means the strong material made from it. The plural is bamboos.","zh":"Bamboo 指“竹子”，也可指“竹材”。复数是 bamboos。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tall tropical plant with hollow stems (canes), often used for building, furniture, and crafts; the material from this plant","zh":"竹子；竹材（热带或亚热带植物，茎中空，常用于建筑、家具和手工艺）"},"examples":[{"en":"There’s a bamboo forest near the temple.","zh":"寺庙附近有一片竹林。"},{"en":"They made a chair from bamboo.","zh":"他们用竹子做了一把椅子。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) more than one bamboo plant, or different kinds of bamboo","zh":"（复数）多株竹子；不同种类的竹子"},"examples":[{"en":"Bamboos grow quickly in warm, wet climates.","zh":"竹子在温暖潮湿的气候里长得很快。"}]}],"synonyms":["bamboo plant","cane (similar in shape)"],"phonetic":"/bæmˈbuː/","extraExplanation":["你输入的 **bambos** 很可能是拼写错误，常见正确拼法是 **bamboo**（单数）和 **bamboos**（复数）。","**bamboo → bamboos** 是规则复数：直接加 -s。也可以用 **bamboo** 作不可数名词，表示“竹材”：e.g., *Bamboo is a strong material.*（竹材很结实。）"]}
{"word":"bamboula","summary":{"en":"Bamboula refers to an Afro-Caribbean drum and the drumming/dance traditions or gatherings connected to it.","zh":"Bamboula 指一种非裔加勒比的鼓，也可指与之相关的鼓乐、舞蹈或历史上的聚会。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of Afro-Caribbean (especially Haitian/Creole and Louisiana Creole) drum, and by extension the music or dance associated with it","zh":"一种非裔加勒比（尤指海地克里奥尔与路易斯安那克里奥尔文化中的）鼓；也可泛指与之相关的音乐或舞蹈"},"examples":[{"en":"The museum displayed a bamboula drum used in community celebrations.","zh":"博物馆展出了一面在社区庆典中使用过的 bamboula 鼓。"},{"en":"In the story, the night filled with bamboula—drumming and dancing that brought everyone together.","zh":"故事里，夜晚充满了 bamboula——鼓声与舞步把大家凝聚在一起。"}]},{"partOfSpeech":"n.","definition":{"en":"(Louisiana/Caribbean history) a public gathering or dance event where people played drums and danced, often connected to African diaspora traditions","zh":"（路易斯安那/加勒比历史）一种公众聚会或舞会，人们击鼓起舞，常与非洲侨民传统相关"},"examples":[{"en":"Historical accounts describe Sunday bamboulas where enslaved people gathered to sing and dance.","zh":"历史记载描述了周日的 bamboula：被奴役的人们聚在一起唱歌跳舞。"}]}],"synonyms":["drum (general)","Afro-Caribbean drumming","Creole dance (contextual)"],"phonetic":"/bæmˈbuːlə/","extraExplanation":["“bamboula”与非裔与克里奥尔文化传统密切相关，在历史语境中常被用来指路易斯安那（如新奥尔良）某些聚会与鼓舞活动。使用时建议尊重其文化来源，并避免把它当作泛泛的“异国风情”标签。","该词在不同地区可能带有不同社会语境；在个别语境中也可能出现带有贬义或刻板印象的用法。阅读旧文献时注意说话者立场与时代背景。"]}
{"word":"Bambuba","summary":{"en":"“Bambuba” is not a common English dictionary word; it’s likely a proper name and needs context to interpret.","zh":"“Bambuba” 不是常见的英语词典词汇；更可能是专有名词，需要上下文才能判断含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“Bambuba” is not a standard English word. It most often appears as a proper name (for a person, product, place, or username). If you saw it in a specific sentence, its meaning depends on that context.","zh":"“Bambuba” 不是常见的英语词汇。它更常见的是专有名称（人名、产品名、地名或网名等）。如果你是在某个句子里看到它，含义需要结合上下文才能确定。"},"examples":[{"en":"I couldn’t find a dictionary meaning for “Bambuba”; it may be a brand name.","zh":"我查不到 “Bambuba” 的词典释义；它可能是一个品牌名。"},{"en":"Is “Bambuba” the name of a song, a person, or an app?","zh":"“Bambuba” 是歌曲名、人名，还是应用名？"}]}],"phonetic":"/bæmˈbuːbə/","extraExplanation":["如果你想查“Bambuba”的准确含义，请把你看到它的完整句子、出处（网页/书/歌词/游戏/应用等）或你想表达的语言告诉我。\n另外，它可能是拼写误差：常见相近拼写有 **bamboo**（竹子）、或某些外来词/人名（不同语言中可能存在类似拼写）。"]}
{"word":"bambuba","summary":{"en":"“Bambuba” is not a standard English word; it is usually a misspelling of “bamboo” or a proper name depending on context.","zh":"“bambuba”不是标准英语词；通常是“bamboo（竹子）”的拼写错误，或在特定语境中作为专有名词使用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as a misspelling of “bamboo.”","zh":"不是标准英语单词；最常见的情况是把“bamboo（竹子）”拼错了。"},"examples":[{"en":"I couldn’t find “bambuba” in a dictionary—did you mean “bamboo”?","zh":"我在词典里找不到“bambuba”——你是不是想写“bamboo（竹子）”？"},{"en":"Please check the spelling: bamboo, not bambuba.","zh":"请检查拼写：是 bamboo，不是 bambuba。"}]},{"partOfSpeech":"other","definition":{"en":"A possible proper name (e.g., a brand, username, or place name), depending on context.","zh":"可能是专有名词（例如品牌名、用户名或地名），具体取决于语境。"},"examples":[{"en":"“Bambuba” appears to be a brand name in this ad, so it may not have a dictionary meaning.","zh":"在这则广告里“Bambuba”看起来像品牌名，所以它可能没有词典里的固定含义。"}]}],"synonyms":["bamboo (if that’s what you meant)"],"phonetic":"/bæmˈbuːbə/","extraExplanation":["英语里常见的是 bamboo（/bæmˈbuː/，竹子）。如果你想查的是“竹子/竹制品/竹林”等相关表达，我也可以按 bamboo 给你更完整的词义、搭配与例句。","如果你能提供一句包含“bambuba”的原句或截图，我可以判断它是拼写错误、外来词，还是专有名词。"]}
{"word":"bambuco","summary":{"en":"Bambuco is a traditional Colombian Andean folk music and dance style, and it can also mean a song/piece written in that style.","zh":"Bambuco（班布科）是哥伦比亚安第斯地区的传统民间音乐与舞蹈风格，也可指以该风格创作的曲子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Colombian folk music style and dance from the Andean region, usually in a moderate tempo and often written in a 6/8 feel (sometimes heard against 3/4).","zh":"班布科（bambuco）：哥伦比亚安第斯地区的传统民间音乐与舞蹈风格，速度多为中等，常带有6/8的律动（有时也会听到与3/4交织的感觉）。"},"examples":[{"en":"They played a bambuco on guitars and sang in Spanish.","zh":"他们用吉他演奏了一首班布科，并用西班牙语歌唱。"},{"en":"At the festival, dancers performed bambuco in traditional clothing.","zh":"在节庆上，舞者们穿着传统服饰表演班布科舞。"}]},{"partOfSpeech":"n.","definition":{"en":"a piece of music (a song or instrumental) in the bambuco style.","zh":"班布科风格的曲子（可为歌曲或器乐曲）。"},"examples":[{"en":"This bambuco is one of the most popular pieces in the region.","zh":"这首班布科是当地最受欢迎的曲子之一。"}]}],"synonyms":["Colombian folk music","Andean folk dance","traditional Colombian dance"],"phonetic":"bɑmˈbuːkoʊ","extraExplanation":["“Bambuco”在哥伦比亚文化中很有代表性，常与安第斯山区的地方身份认同联系在一起。","在学习与使用时，可以把它当作专有的“音乐类型/舞蹈名称”，通常不加冠词或按语境加a/the（a bambuco / the bambuco they danced）。"]}
{"word":"bambuk","summary":{"en":"“Bambuk” is a rare/nonstandard spelling meaning “bamboo” (the plant), sometimes also referring to bamboo poles or items.","zh":"“bambuk”是较少见/不标准的拼写，意思通常等同于“bamboo（竹子）”，有时也可指竹竿或竹制物品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard/rare in English) A variant spelling of “bamboo,” the tall, fast-growing plant with hollow woody stems, often used for building and making items.","zh":"（英语中不标准/较少见）“bamboo（竹子）”的变体拼写；指一种生长快、茎中空的高大植物，常用于建筑和制作物品。"},"examples":[{"en":"The sign says “bambuk,” but in English you usually write “bamboo.”","zh":"牌子上写的是“bambuk”，但英语里通常写“bamboo”。"},{"en":"They built a simple fence from bambuk/bamboo poles.","zh":"他们用竹竿做了一个简易的栅栏。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) Something made from bamboo, especially a pole or stick.","zh":"（少见）竹制品；尤指竹竿、竹棍。"},"examples":[{"en":"He carried a bambuk/bamboo stick as a walking staff.","zh":"他拿着一根竹杖当拐杖用。"}]}],"synonyms":["bamboo","bamboo cane","cane"],"phonetic":"/bæmˈbʊk/","extraExplanation":["“bambuk”在标准英语里不常见，更多时候出现在其他语言的转写/拼写里（例如一些东欧或中亚语言中表示“竹子”的形式）。如果你是在学英语写作，建议使用最常见的拼写“bamboo”。"]}
{"word":"Bambusa","summary":{"en":"Bambusa is the scientific genus name for many bamboo plants.","zh":"Bambusa 是许多竹类植物的科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical and subtropical bamboo plants, often grown for construction materials, crafts, and landscaping","zh":"（植物学）簕竹属／麻竹属（Bambusa），一种热带与亚热带竹类植物的属名，常用于建材、工艺品与园林绿化"},"examples":[{"en":"Bambusa species are widely planted in warm climates for fast-growing screening and shade.","zh":"Bambusa 属的竹子常在温暖地区种植，用来快速形成遮挡和树荫。"},{"en":"Some Bambusa bamboos are used to make poles, fences, and simple furniture.","zh":"一些 Bambusa 竹类可用来制作竹竿、篱笆和简易家具。"}]}],"synonyms":["bamboo (general term)"],"phonetic":"/bæmˈbuːsə/","extraExplanation":["Bambusa 是拉丁学名（属名），在英文里常当作专有名词使用，通常首字母大写并用斜体（Bambusa）。日常英语里更常见的通用词是 bamboo（竹子）。","不同地区对 Bambusa 相关竹种的中文俗名不完全一致；在园艺与贸易语境中，可能会看到具体物种名（例如 Bambusa vulgaris）。"]}
{"word":"bambusa","summary":{"en":"Bambusa is a plant genus of bamboo, often mentioned in gardening and botanical contexts.","zh":"Bambusa 指“竹属”的植物学属名，常见于园艺与植物学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical and subtropical bamboo plants, often grown for ornamental use and for building materials (some species have thick, woody stems).","zh":"一种竹属植物（Bambusa，竹属），多生于热带与亚热带；常用于观赏、建材等（部分种类竹竿粗壮、木质化明显）。"},"examples":[{"en":"Many gardeners plant Bambusa to create a fast-growing privacy screen.","zh":"许多园艺爱好者种植 Bambusa 来做快速生长的绿篱/隐私屏障。"},{"en":"In some regions, Bambusa species are used to make fences and simple furniture.","zh":"在一些地区，人们用 Bambusa 的竹材制作篱笆和简易家具。"}]}],"synonyms":["bamboo (general term)","bamboo genus"],"phonetic":"/bæmˈbuːsə/","extraExplanation":["“Bambusa”是拉丁化的植物学属名，英语里常用作学名（通常首字母大写），指“竹属”这一整类植物，而不是某一种具体的竹子。日常口语中更常说“bamboo（竹子）”。","在园艺或生态语境里，你可能会看到“clumping bamboo（丛生型竹）”与“running bamboo（蔓延型竹）”的区分；Bambusa 里很多种类偏向丛生型，但具体仍要看物种与品种。"]}
{"word":"Bambuseae","summary":{"en":"Bambuseae is the scientific term for a plant tribe that includes many bamboo species.","zh":"Bambuseae 是一个植物“族”的学名，包含许多竹类物种。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific name for a tribe (a classification group) of grasses that includes many bamboo species.","zh":"（植物学）竹亚科中的一个“族”（分类单位）的学名，包含许多竹类植物。"},"examples":[{"en":"In plant taxonomy, Bambuseae is a tribe within the grass family that includes many woody bamboos.","zh":"在植物分类学中，Bambuseae 是禾本科中的一个族，包含许多木质竹类。"},{"en":"Some species used for building and crafts belong to Bambuseae.","zh":"一些用于建筑和手工艺的竹种属于 Bambuseae。"}]}],"synonyms":["bamboo tribe","bamboos (general term)"],"phonetic":"/bæmˈbjuːziˌiː/","extraExplanation":["“Bambuseae”是拉丁化的学术名称，常见于植物志、论文、标本标签等正式语境；日常英语里更常说“bamboo(s)”或“bamboo tribe”。","分类层级中，“tribe（族）”通常位于“subfamily（亚科）”之下、“genus（属）”之上；因此它不是单一物种，而是一组相关属的集合。"]}
{"word":"bambuseae","summary":{"en":"Bambuseae is the scientific (taxonomic) name for a tribe of bamboos in the grass family.","zh":"Bambuseae 是禾本科中竹类“族”的学名（分类名称）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific name for the bamboo tribe in the grass family (Poaceae), including many true bamboos","zh":"（生物学）竹亚族/竹族的学名，隶属禾本科（Poaceae），包含许多“真正的竹类”"},"examples":[{"en":"In plant taxonomy, Bambuseae is a tribe within the grass family that includes many woody bamboos.","zh":"在植物分类学中，Bambuseae 是禾本科下的一个族，包含许多木质竹类。"},{"en":"Researchers compared leaf structures across Bambuseae to study bamboo evolution.","zh":"研究人员比较了 Bambuseae 各类群的叶片结构，以研究竹类的演化。"}]}],"synonyms":["bamboo tribe (informal)","tribe Bambuseae"],"phonetic":"/ˌbæm.bjuˈsiː.iː/","extraExplanation":["“Bambuseae”是拉丁化的分类名称，常见于学术论文、植物志、标本标签等语境，日常英语中很少使用。","分类层级上，“tribe（族）”通常位于“subfamily（亚科）”之下、“genus（属）”之上；Bambuseae 属于禾本科（Poaceae）中与竹类相关的一支。","词源上与“bamboo（竹子）”同源：Bambu- 表示竹类，-eae 是植物分类中常见的拉丁化后缀。"]}
{"word":"Bambute","summary":{"en":"Bambute: a less common spelling of “Bambuti,” referring to Indigenous forest peoples of the Ituri Rainforest (e.g., the Mbuti).","zh":"Bambute：较少见的“Bambuti”拼写变体，指伊图里雨林的原住民森林族群（如 Mbuti）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a variant spelling of “Bambuti,” referring collectively to several Indigenous forest-dwelling hunter-gatherer peoples of the Ituri Rainforest region (DR Congo), such as the Mbuti","zh":"“Bambuti”的一种拼写变体，泛指刚果（金）伊图里雨林一带的多个原住民森林狩猎采集族群（如 Mbuti/M布提人）"},"examples":[{"en":"Some older anthropology books use the word “Bambute” for the Mbuti people of the Ituri Forest.","zh":"一些较早的人类学书籍会用“Bambute”来指伊图里森林的 Mbuti（姆布提）人。"},{"en":"Today, many writers prefer the community’s specific name rather than the general label “Bambute/Bambuti.”","zh":"如今，许多作者更倾向于使用社群的具体名称，而不是笼统地称为“Bambute/Bambuti”。"}]}],"synonyms":["Bambuti","Mbuti"],"phonetic":"/bɑmˈbuːti/","extraExplanation":["“Bambute/Bambuti”多见于较早的英文资料，带有把多个族群合并称呼的倾向；在当代写作中更推荐使用具体族名（如 Mbuti、Efe 等），以示尊重与准确。","该词常与“Pygmy（俾格米人）”一起出现；但“Pygmy”在一些语境中可能带有简化甚至冒犯意味，因此需要谨慎使用，并优先采用当事群体自称或更精确的族群名称。"]}
{"word":"bambute","summary":{"en":"Bambute refers to an Indigenous people (and sometimes their language) in the Ituri rainforest region of the D.R. Congo; spelling varies (Bambuti/Mbuti).","zh":"Bambute 指刚果（金）伊图里雨林地区的原住民族群（有时也指其语言）；拼写常见变体为 Bambuti/Mbuti。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(also spelled Bambuti or Mbuti) a group of Indigenous forest-dwelling peoples in the Ituri rainforest region of the Democratic Republic of the Congo.","zh":"（也拼作 Bambuti 或 Mbuti）指居住在刚果民主共和国伊图里雨林一带的森林原住民族群之一。"},"examples":[{"en":"The book describes the Bambute communities of the Ituri forest.","zh":"这本书描写了伊图里森林中的 Bambute 社群。"},{"en":"Some researchers use the spelling “Mbuti” instead of “Bambute.”","zh":"一些研究者会用 “Mbuti” 这个拼法来代替 “Bambute”。"}]},{"partOfSpeech":"n.","definition":{"en":"the language(s) associated with these peoples (usage varies by source).","zh":"指与该族群相关的语言（不同资料的用法不一）。"},"examples":[{"en":"The article includes a short word list from a Bambute language variety.","zh":"文章收录了一小段来自某种 Bambute 语言变体的词表。"}]}],"synonyms":["Bambuti","Mbuti"],"phonetic":"/bɑmˈbuːti/","extraExplanation":["“Bambute”在英语里多见于人类学/民族志语境；日常英语中不常用。","谈到族群名称时，建议优先使用当事社群更常自称或学界更通行、且更尊重的称呼（常见为“Mbuti”），并避免把不同群体笼统归为“pygmies（俾格米人）”而忽略其差异。"]}
{"word":"Bambuti","summary":{"en":"Bambuti is an older term for the Mbuti people of the Ituri Rainforest (DR Congo), often replaced today by “Mbuti.”","zh":"Bambuti 是较早的称呼，用于指刚果（金）伊图里雨林的姆布蒂人；如今多用更准确的称呼 Mbuti。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a term used in older anthropology for the Mbuti people (and sometimes other Indigenous forest-dwelling groups) of the Ituri Rainforest in the Democratic Republic of the Congo; also used as a plural for the people as a group","zh":"（多见于早期人类学文献）指刚果民主共和国伊图里雨林的姆布蒂人（有时也泛指其他雨林狩猎采集群体）；也可作复数，指这一族群整体"},"examples":[{"en":"Some older books refer to the Mbuti as the Bambuti of the Ituri Forest.","zh":"一些较早的书把姆布蒂人称为伊图里森林的“Bambuti”。"},{"en":"Today, many writers prefer the name “Mbuti” rather than “Bambuti.”","zh":"如今，许多作者更倾向使用“姆布蒂人（Mbuti）”，而不是“Bambuti”。"}]}],"synonyms":["Mbuti","Ituri forest hunter-gatherers (contextual)"],"phonetic":"/bɑmˈbuːti/","extraExplanation":["“Bambuti”常见于20世纪较早的西方民族志/人类学写作中，有时带有把不同族群一概而论的倾向。更尊重、也更准确的写法通常是使用族群自称或更常用的名称，如“Mbuti（姆布蒂人）”。在写作中如果必须使用“Bambuti”，建议说明其为历史用语或引文用语，并尽量采用当代学术与当事群体更认可的称呼。"]}
{"word":"Bamby","summary":{"en":"“Bamby” is usually a misspelling of “Bambi,” the famous young deer; it can also be used as a name, or informally to mean someone innocent or naïve.","zh":"“Bamby”通常是“Bambi（小鹿斑比）”的误拼；也可作人名/昵称，或非正式指天真、不谙世事的人。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Often spelled “Bambi”) a famous fictional young deer, best known from Disney’s film, used as a symbol of innocence and vulnerability.","zh":"（常拼作 Bambi）著名的虚构小鹿形象，最广为人知来自迪士尼电影，常被用来象征天真与脆弱。"},"examples":[{"en":"When I was a kid, I cried during Bambi.","zh":"我小时候看《小鹿斑比》时哭了。"},{"en":"The fawn looked like Bambi in the tall grass.","zh":"那只小鹿在高草里看起来像斑比。"}]},{"partOfSpeech":"n.","definition":{"en":"A given name or nickname (usually feminine) based on “Bambi.”","zh":"源自“Bambi”的人名或昵称（通常用于女性）。"},"examples":[{"en":"Her friends call her Bambi.","zh":"她的朋友叫她斑比（Bambi）。"},{"en":"Bambi is listed as her stage name.","zh":"Bambi 被写作她的艺名。"}]},{"partOfSpeech":"n.","definition":{"en":"Informal: an innocent, naïve, or very young person (sometimes used teasingly, and can sound rude depending on tone).","zh":"非正式：指天真、不谙世事或很年轻的人（有时带调侃意味，语气不当可能显得无礼）。"},"examples":[{"en":"He’s new to city life—don’t treat him like some Bambi.","zh":"他刚来城市生活——别把他当成什么“斑比”一样欺负。"},{"en":"She felt like a Bambi on her first day at work.","zh":"她上班第一天觉得自己像只“斑比”，很懵懂。"}]}],"synonyms":["innocent person","naïf","newbie"],"phonetic":"/ˈbæmbi/","extraExplanation":["“Bambi”最早来自奥地利作家费利克斯·萨尔登（Felix Salten）1923年的小说《Bambi, a Life in the Woods》，后来由迪士尼在1942年改编成动画电影《Bambi》，使这个名字在英语世界几乎成了“天真小鹿”的文化符号。","你输入的“Bamby”更像是“Bambi”的常见误拼；如果你指的是某个品牌、网名或特定人物，也可能有其他含义。"]}
{"word":"BAMF","summary":{"en":"BAMF is a vulgar slang term meaning an extremely impressive, tough, or highly capable person (or describing something as extremely impressive).","zh":"BAMF 是带粗口色彩的俚语，表示“非常厉害、强悍、很能干的人”，也可作形容词表示“非常厉害的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, vulgar) An impressive, tough, fearless, or highly capable person; someone who seems extremely cool or powerful.","zh":"（俚语，粗俗）很厉害、很强悍、很无畏或非常能干的人；给人感觉特别酷或很有气场的人。"},"examples":[{"en":"After she negotiated that deal in one meeting, everyone said she was a BAMF.","zh":"她在一场会议里就谈成了那笔交易，大家都说她简直是个 BAMF。"},{"en":"He’s a BAMF on the basketball court—calm under pressure and hard to stop.","zh":"他在篮球场上是个 BAMF——压力下也很冷静，很难被防住。"}]},{"partOfSpeech":"adj.","definition":{"en":"(slang, vulgar) Extremely impressive, tough, or high-performing.","zh":"（俚语，粗俗）非常厉害的、强悍的、表现极佳的。"},"examples":[{"en":"That was a BAMF move—bold and perfectly timed.","zh":"那一招太 BAMF 了——大胆而且时机刚刚好。"},{"en":"She delivered a BAMF presentation and won the room.","zh":"她做了一场非常 BAMF 的演讲，把全场都镇住了。"}]}],"synonyms":["badass","legend","beast","powerhouse","total pro"],"phonetic":"bæmf","extraExplanation":["BAMF 通常被理解为 “badass motherf***er” 的缩写，因此带有明显粗口色彩。虽然在朋友之间或某些网络语境里可能表示强烈称赞，但在正式场合、职场、学校或对不熟的人使用会显得冒犯或不礼貌。","更中性、礼貌的替代表达：badass（较口语但不含明显脏话）、awesome、impressive、tough、a total pro（非常专业的人）。"]}
{"word":"Bamford","summary":{"en":"Bamford is most commonly a surname and also a place name in England.","zh":"Bamford最常见是姓氏，也可作英格兰的地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"（英）姓氏：班福德。"},"examples":[{"en":"Helen Bamford is listed as the author of the report.","zh":"报告的作者名单里写着海伦·班福德。"},{"en":"Mr. Bamford will join us for the meeting tomorrow.","zh":"班福德先生明天会参加我们的会议。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name in England (used for several towns/villages).","zh":"（英格兰）地名：班福德（用于多个城镇/村庄）。"},"examples":[{"en":"They drove through Bamford on their way to the national park.","zh":"他们开车经过班福德，前往国家公园。"},{"en":"Bamford is a small village with beautiful countryside nearby.","zh":"班福德是个小村庄，附近有美丽的乡村风景。"}]}],"synonyms":["(surname)","(place name)"],"phonetic":"ˈbæmfərd","extraExplanation":["“Bamford”常见于英国姓氏与地名。作为地名时，英格兰不同地区可能都有叫Bamford的地方（例如德比郡等）。","词源上一般认为与古英语有关，常被解释为类似“树木旁的浅滩/渡口（ford）”之意；很多英国地名都由自然地貌（河流、渡口、树林等）组合而来。"]}
{"word":"Bamian","summary":{"en":"“Bamian” usually refers to Bamiyan, a region in central Afghanistan, or describes things related to that area.","zh":"“Bamian”通常指阿富汗中部的巴米扬地区（Bamiyan），或表示与该地区相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an alternative spelling of “Bamiyan,” a region (valley/province) in central Afghanistan.","zh":"“Bamiyan（巴米扬）”的另一种拼写，指阿富汗中部的一个地区（山谷/省）。"},"examples":[{"en":"Bamian (Bamiyan) is known for its dramatic cliffs and highland scenery.","zh":"Bamian（Bamiyan，巴米扬）以壮观的峭壁和高原景色闻名。"},{"en":"The traveler wrote about visiting Bamian in a winter journal.","zh":"那位旅行者在冬季游记里写到了去Bamian的经历。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Bamiyan (the Bamiyan region/culture).","zh":"与Bamiyan（巴米扬地区/文化）有关的。"},"examples":[{"en":"They studied Bamian history in a course on Central Asia.","zh":"他们在一门中亚课程中学习了巴米扬的历史。"},{"en":"The museum displayed Bamian artifacts and photographs.","zh":"博物馆展出了与巴米扬有关的文物和照片。"}]}],"synonyms":["Bamiyan"],"phonetic":"/bəˈmiːən/","extraExplanation":["“Bamiyan/巴米扬”在国际上更常见的拼写是 Bamiyan。这里曾有著名的巴米扬大佛（雕刻在悬崖上的巨型佛像），在21世纪初遭到破坏，因此常出现在历史、文化遗产与新闻语境中。","作为地名或地名形容词时，英语里常见搭配有：Bamiyan Valley（巴米扬山谷）、Bamiyan Province（巴米扬省）。"]}
{"word":"Bamileke","summary":{"en":"Bamileke refers to an ethnic group from western Cameroon, and it can also describe anything related to their languages or culture.","zh":"Bamileke 指喀麦隆西部的巴米勒凯族群成员，也可作形容词表示与其语言或文化有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an ethnic group (a cluster of related peoples) from western Cameroon, especially in the Grassfields region","zh":"（喀麦隆西部、尤指草原高地区的）巴米勒凯人；巴米勒凯族群成员"},"examples":[{"en":"Many Bamileke families live in the West Region of Cameroon.","zh":"许多巴米勒凯家庭生活在喀麦隆西部大区。"},{"en":"She is Bamileke and speaks one of the local Grassfields languages at home.","zh":"她是巴米勒凯人，在家里会说一种当地的草原高地语言。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Bamileke people, their languages, or their culture","zh":"巴米勒凯人的；与巴米勒凯族群、语言或文化有关的"},"examples":[{"en":"Bamileke cultural traditions include distinctive music and art.","zh":"巴米勒凯文化传统包含很有特色的音乐与艺术。"},{"en":"He is researching Bamileke history and migration patterns.","zh":"他在研究巴米勒凯的历史与迁徙模式。"}]}],"synonyms":["Bamiléké"],"phonetic":"/ˌbɑːmiˈleɪkeɪ/","extraExplanation":["“Bamileke”常见于英语学术与新闻写作中；法语拼写常见为“Bamiléké”（带重音符号），因为喀麦隆同时使用英语与法语。","严格说，“Bamileke/ Bamiléké”常被用作一个“族群集合”的统称，内部包含多种彼此相关、但并不完全相同的语言与群体。写作时如果强调语言，可说“a Bamileke (Grassfields) language”或指明具体语言名称。","复数在英语里通常不变（many Bamileke people），也可见到加-s（Bamilekes），但在正式语境里前者更常见。"]}
{"word":"Bamiyan","summary":{"en":"Bamiyan is a place name in central Afghanistan, famous for its valley scenery and the historical site of the Bamiyan Buddhas.","zh":"Bamiyan（巴米扬）是阿富汗中部的地名，以山谷风光与巴米扬大佛遗址等历史文化遗产而闻名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A city and valley in central Afghanistan, known for its mountain landscape and historical sites along old Silk Road routes.","zh":"（巴米扬）阿富汗中部的一座城市与山谷地区，以壮丽山地景观以及丝绸之路相关的历史遗迹而闻名。"},"examples":[{"en":"Bamiyan is a quiet valley surrounded by high mountains in central Afghanistan.","zh":"巴米扬是阿富汗中部一个被高山环绕的宁静山谷。"},{"en":"Many travelers visit Bamiyan for its history and dramatic scenery.","zh":"许多旅行者前往巴米扬，欣赏其历史与壮阔景色。"}]},{"partOfSpeech":"other","definition":{"en":"Used to refer to the famous historical heritage of the area, especially the niches where the Bamiyan Buddhas once stood.","zh":"也可用来指该地区著名的历史文化遗产，尤其是“巴米扬大佛”曾经所在的石窟佛龛与相关遗址。"},"examples":[{"en":"The story of Bamiyan often comes up in discussions about protecting cultural heritage.","zh":"谈到保护文化遗产时，人们常会提到巴米扬的故事。"},{"en":"Photos of Bamiyan show the large cliff niches carved into the rock face.","zh":"巴米扬的照片常能看到岩壁上开凿出的巨大佛龛。"}]}],"phonetic":"/ˌbɑːmiˈjɑːn/","extraExplanation":["“Bamiyan”在英语里通常作为地名专有名词使用，首字母大写：Bamiyan。","巴米扬因“巴米扬大佛”（Bamiyan Buddhas）而闻名：两尊巨型佛像曾雕刻在悬崖上，2001年被炸毁；该遗址与周边文化景观被列入联合国教科文组织世界遗产名录（也曾被列为濒危遗产）。","学习时常见搭配：Bamiyan Valley（巴米扬山谷）、the Bamiyan Buddhas（巴米扬大佛）、cultural heritage（文化遗产）。"]}
{"word":"bammed","summary":{"en":"“Bammed” is an informal past tense of “bam,” meaning either “hit suddenly/hard” or (in some UK/Scottish use) “trick/fool.”","zh":"“bammed”多为非正式用法，是“bam”的过去式，可表示“猛击/砰地撞上”，也可在部分英式/苏格兰口语中表示“欺骗/愚弄”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"slang past tense of “bam”: to hit or strike (someone/something) hard or suddenly.","zh":"俚语，动词“bam”的过去式：猛击；突然用力打（某人/某物）。"},"examples":[{"en":"The ball bammed off the wall and rolled back to us.","zh":"球猛地撞到墙上，又滚回到我们这边。"},{"en":"He bammed the door shut because he was angry.","zh":"他因为生气，把门“砰”地一声关上了。"}]},{"partOfSpeech":"v.","definition":{"en":"(UK/Scottish informal) past tense of “bam”: to trick, fool, or hoax someone.","zh":"（英式/苏格兰口语）动词“bam”的过去式：骗；耍；愚弄（某人）。"},"examples":[{"en":"I realized they’d bammed me with a fake story.","zh":"我意识到他们用一个假故事把我骗了。"},{"en":"Don’t worry—she was just bamming you.","zh":"别担心——她只是逗你/耍你而已。"}]}],"synonyms":["hit","slam","smack","wallop","trick","fool","hoax"],"phonetic":"/bæmd/","extraExplanation":["“bammed”在标准英语里不算常见拼写/用词，更多见于口语、方言或网络表达。很多时候人们想写的是“bummed”（感到沮丧的/扫兴的）。如果你告诉我上下文句子，我可以帮你判断到底是哪一个意思。"]}
{"word":"bamming","summary":{"en":"“Bamming” usually means hitting/knocking with a loud ‘bam’ sound; in some UK/Ireland/Scotland slang, it can also mean teasing or fooling someone.","zh":"“bamming”通常指“砰砰地撞/敲”；在部分英伦/爱尔兰/苏格兰口语里也可指“逗弄、忽悠（开玩笑式）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"hitting, striking, or making something hit with a loud, heavy sound (present participle of “bam”).","zh":"（“bam”的现在分词）用力撞击/猛击，或发出“砰”的一声重响。"},"examples":[{"en":"Someone kept bamming on the door, so I finally went to see what was wrong.","zh":"有人一直砰砰地敲门，所以我终于去看看出了什么事。"},{"en":"He came in bamming his bag down on the table.","zh":"他进来把包“砰”地一声放到桌上。"}]},{"partOfSpeech":"v.","definition":{"en":"(Informal, chiefly UK/Ireland/Scotland) teasing, fooling, or tricking someone; saying something not meant seriously (present participle of “bam”).","zh":"（非正式，多见于英国/爱尔兰/苏格兰）逗弄、忽悠、骗（多为开玩笑式的“耍人”）；说些并非认真的话。"},"examples":[{"en":"Are you bamming me, or is that story actually true?","zh":"你是在忽悠我，还是真的？"},{"en":"Stop bamming him—he’s taking you seriously.","zh":"别逗他了——他当真了。"}]}],"synonyms":["knocking","banging","slamming","thumping","teasing","fooling","tricking"],"phonetic":"/ˈbæmɪŋ/","extraExplanation":["“bamming”更常被看作动词“bam”的现在分词：在美式英语里多偏向“砰地撞/敲”的拟声用法；而“to bam (someone)”表示“忽悠/耍人”则更偏英伦、爱尔兰和苏格兰的口语/方言用法。","如果你是在网络语境里看到“bamming”，也可能只是把“bam”当作夸张的声音或动作来写（例如描述摔门、敲桌）。"]}
{"word":"bamoth","summary":{"en":"Bamoth is a Biblical place name meaning “high places,” associated with Israel’s journey and the region of Moab.","zh":"Bamoth 是《圣经》中的地名，意为“高处／邱坛”，与以色列人的行程及摩押地区有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biblical) A place name meaning “high places,” mentioned in the Old Testament (often linked to the region of Moab).","zh":"（圣经用语）地名，意为“高处／高地（敬拜之处）”，见于《旧约》，常与摩押地区相关。"},"examples":[{"en":"In Numbers, the Israelites traveled past Bamoth during their journey.","zh":"《民数记》中记载，以色列人在旅程中经过了巴末（Bamoth）。"},{"en":"Some translations treat Bamoth as a location connected with nearby “high places.”","zh":"有些译本把 Bamoth 视为与附近“邱坛／高处”相关的地点。"}]}],"synonyms":["high places","Bamoth-baal"],"phonetic":"/bəˈmoʊθ/","extraExplanation":["“Bamoth”来自希伯来语词根，常被解释为“高处”的复数形式（类似于 *bamah* “高处/邱坛”）。在古代近东文化中，“高处”常与祭祀或敬拜地点相关，因此这个地名也带有宗教与地理的双重含义。","在英文圣经研究/注释中，你也可能见到相关地名如 **Bamoth-baal**（与巴力有关的“高处”），以及更常见的术语 **high places**（邱坛/高处敬拜场所）。"]}
{"word":"Bamoth-baal","summary":{"en":"Bamoth-baal is a biblical place name meaning “high places of Baal,” located in or connected with Moab.","zh":"Bamoth-baal 是圣经中的地名，意为“巴力的高处/高冈”，与摩押地区有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name in the Hebrew Bible, referring to a Moabite “high place” (a raised site used for worship), associated with the god Baal.","zh":"《希伯来圣经/旧约》中的地名，指摩押地的一处“高处/高冈”（常用于宗教祭祀的高地），与巴力（Baal）崇拜有关。"},"examples":[{"en":"In some Bible translations, Bamoth-baal is listed among places in Moab.","zh":"在一些圣经译本中，Bamoth-baal 被列为摩押的一些地名之一。"},{"en":"The name Bamoth-baal literally suggests “high places of Baal.”","zh":"Bamoth-baal 这个名字字面上有“巴力的高处/高冈”之意。"}]}],"synonyms":["Bamoth Baal"],"phonetic":"/ˈbeɪməθ ˈbeɪəl/","extraExplanation":["这是一个专有名词，常见于《民数记》（Numbers）等经文的地名列表中；不同译本可能在拼写、连字符（Bamoth-baal / Bamoth Baal）上略有差异。","Baal（巴力）是古代近东地区常见的称呼/神名之一；“high place（高处）”在圣经语境里常指设在山丘或高地的祭祀场所，因此这个地名带有明显的宗教与历史背景。"]}
{"word":"bams","summary":{"en":"“bams” usually means multiple loud hits/noises (“bams”), or “bams” as a verb meaning “hits hard.”","zh":"“bams”通常指多声“砰砰”的撞击/巨响，或作动词表示“猛击、猛撞”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “bam”: a sudden loud hit or noise; also the sound word people write to show something happens suddenly.","zh":"“bam”的复数：突然的撞击声/巨响；也可作拟声词，表示事情“砰”地一下发生。"},"examples":[{"en":"We heard two bams from the hallway, then everything went quiet.","zh":"我们听到走廊里传来两声“砰砰”，然后就安静了。"},{"en":"The comic showed bams and booms as the door slammed shut.","zh":"漫画里用“bam”和“boom”来表现门“砰”地关上。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of “bam” (informal): to hit or knock something hard and suddenly.","zh":"“bam”的第三人称单数（非正式）：猛地撞击、重击。"},"examples":[{"en":"He bams the desk when he gets frustrated.","zh":"他一沮丧就会猛拍桌子。"},{"en":"The wind bams the window all night.","zh":"风整夜把窗户撞得砰砰响。"}]}],"synonyms":["bangs","slams","thuds"],"phonetic":"/bæm/","extraExplanation":["“bam”常见于漫画、字幕、口语叙述中，是拟声词（onomatopoeia），强调“突然、用力、很响”的感觉。英语里类似的还有“bang / boom / pow”。","大写“BAM”也可能是缩写（如 Brooklyn Academy of Music）。写作“BAMs”时，有时指多个名为BAM的机构/项目，但这取决于具体语境。"]}
{"word":"BAMusEd","summary":{"en":"Bemused means confused or puzzled, and it can also mean mildly amused—often both at the same time.","zh":"Bemused 主要指“困惑/茫然”，也可指“带点困惑的轻微好笑”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"confused or puzzled, often because something is surprising or hard to understand","zh":"困惑的；茫然的（常因事情出乎意料或难以理解）"},"examples":[{"en":"She looked bemused by the complicated instructions.","zh":"这些复杂的说明让她看起来很困惑。"},{"en":"I was bemused to hear my name called when I hadn’t signed up.","zh":"我没报名却听到叫我的名字，感到很诧异又困惑。"}]},{"partOfSpeech":"adj.","definition":{"en":"mildly amused, sometimes with a small smile (often mixed with confusion)","zh":"有点被逗乐的；忍俊不禁的（常带一点困惑）"},"examples":[{"en":"He gave a bemused smile at the child’s serious questions.","zh":"他对孩子一本正经的问题露出一丝忍俊不禁的笑。"},{"en":"Her friends were bemused by her unusual hobby.","zh":"她的朋友们对她不寻常的爱好感到有点好笑又有点不解。"}]}],"synonyms":["puzzled","confused","perplexed","baffled","amused"],"phonetic":"/bəˈmjuzd/","extraExplanation":["“bemused”常被误用成“amused（被逗乐的）”。更标准的核心含义是“困惑/茫然”，但在现代口语与写作中，也常表示“带着困惑的轻微好笑”。如果你想表达纯粹“觉得好笑”，用“amused”更直接；想表达“好笑但也不太懂/有点无语”，用“bemused”更贴切。"]}

