{"word":"BAO","summary":{"en":"Bao usually means a Chinese steamed bun with filling; in all caps (BAO), it can also be a context-specific acronym (e.g., in astronomy).","zh":"Bao 通常指中式夹馅蒸包；全大写 BAO 也可能是特定领域的缩写（如天文学）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Chinese-style steamed bun, often filled with meat, vegetables, or sweet paste; also used for similar folded buns (including some that are steamed and then lightly pan-fried).","zh":"（中式）包子；常指内有馅的蒸制面点；也可泛指类似的中式夹馅小圆面包（有时先蒸后略煎）。"},"examples":[{"en":"I ordered two pork baos and a bowl of noodles.","zh":"我点了两个猪肉包子和一碗面。"},{"en":"These baos are filled with red bean paste.","zh":"这些包子里包的是红豆沙。"},{"en":"Bao is one of my favorite comfort foods in winter.","zh":"冬天包子是我最爱的暖心食物之一。"}]},{"partOfSpeech":"n.","definition":{"en":"(often in all caps) an abbreviation used in some fields for specific technical terms, depending on context (for example, in astronomy: baryon acoustic oscillations).","zh":"（常全大写）在某些领域中用作缩写；具体含义取决于语境（例如天文学中的“重子声学振荡”）。"},"examples":[{"en":"The paper discusses BAO measurements from galaxy surveys.","zh":"这篇论文讨论了星系巡天中的 BAO 测量。"},{"en":"In this context, BAO refers to a pattern in the large-scale structure of the universe.","zh":"在这里，BAO 指的是宇宙大尺度结构中的一种模式。"}]}],"synonyms":["steamed bun","bun","dumpling (informal/loose)"],"phonetic":"/baʊ/","extraExplanation":["“bao（包）”在英文里多指中式夹馅面点，常见写法是 bao，复数可写 baos。若你想表达“包子”，也常见更具体的说法：baozi（包子）。在海外餐馆菜单上，bao 有时也会指“刈包/荷叶饼式夹肉”（常译作 pork belly bao），形式可能不是圆形包子，点餐时可看图片或询问。"]}
{"word":"baobab","summary":{"en":"A baobab is a large, thick-trunked tree (mainly in Africa) known for storing water and living a very long time.","zh":"baobab 指猴面包树：树干粗大能储水、寿命很长，主要见于非洲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large African (and some Australian/Madagascan) tree with a very thick trunk that stores water; it is famous for its long life and distinctive “upside-down” silhouette.","zh":"猴面包树（主要分布于非洲，也见于澳大利亚/马达加斯加的一类大树）；树干粗大可储水，以寿命长、外形像“倒着长的树”而著名。"},"examples":[{"en":"The baobab can survive long dry seasons by storing water in its trunk.","zh":"猴面包树能把水储存在树干里，从而熬过漫长的旱季。"},{"en":"We saw a huge baobab near the village, and its branches looked like roots reaching into the sky.","zh":"我们在村子附近看到一棵巨大的猴面包树，它的枝条看起来像伸向天空的树根。"},{"en":"In stories set in Africa, the baobab is often described as an ancient, wise tree.","zh":"在以非洲为背景的故事里，猴面包树常被描写成古老而智慧的树。"}]}],"synonyms":["Adansonia (genus name)","African baobab"],"phonetic":"/ˈbaʊbæb/","extraExplanation":["“baobab”常指木棉科猴面包树属（Adansonia）的树。著名的“生命之树（Tree of Life）”称号来自它在干旱地区提供水分、果实与树荫的生态与文化价值。","文化小知识：在《小王子》（The Little Prince）里，baobab 被写成会在星球上疯狂生长、必须及时拔除的“危险树苗”，是一种寓言式的象征写法。"]}
{"word":"baobab tree","summary":{"en":"a huge, water-storing tree from Africa and Madagascar","zh":"一种非洲和马达加斯加常见、树干能储水的巨树"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large African (and Malagasy) tree with a very thick trunk that stores water, known for its long life and large fruit.","zh":"一种非洲（及马达加斯加）的大树，树干非常粗大、能储水，以长寿和巨大的果实而闻名。"},"examples":[{"en":"We saw a baobab tree near the village, with a trunk wider than a small house.","zh":"我们在村子附近看到一棵猴面包树，树干比小房子还粗。"},{"en":"In the dry season, the baobab tree can survive because it stores water in its trunk.","zh":"在旱季，猴面包树能存活下来，因为它把水储存在树干里。"},{"en":"Baobab fruit is sometimes used to make drinks and snacks.","zh":"猴面包树的果实有时用来制作饮料和零食。"}]}],"synonyms":["monkey-bread tree","baobab"],"phonetic":"/ˈbaʊbæb/","extraExplanation":["中文里常译为“猴面包树”，对应的英文别名是“monkey-bread tree”。","它常被称为“生命之树”（tree of life），因为能储水、在干旱地区为人和动物提供食物与荫凉；在一些非洲与马达加斯加的民间故事中也很常见。"],"etymology":"“baobab”一词常被认为来自阿拉伯语“bū ḥibāb”（大意与“有许多籽/种子”相关），后来经欧洲语言传播并固定为英语拼写。","mnemonic":["把 baobab 看成“bao + bab”：联想到中文“包包”（bao），树干像一个大“包”能装水。","读音 /ˈbaʊbæb/ 里有 “bow”（/baʊ/）的感觉：想象树干大到要“弯腰（bow）”才抱得住。"]}
{"word":"baobabs","summary":{"en":"Baobabs are large, long-lived African trees with thick trunks; the word can also mean their edible fruit.","zh":"Baobabs 指猴面包树（非洲粗壮长寿的大树），也可指其可食用的果实。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large African tree with a very thick trunk, known for storing water; it can live for a very long time (plural: baobabs).","zh":"猴面包树（非洲一种树干极粗、能储水、寿命很长的大树；复数：baobabs）。"},"examples":[{"en":"Baobabs can survive long dry seasons because their trunks store water.","zh":"猴面包树能熬过漫长旱季，因为它们的树干可以储存水分。"},{"en":"We saw several baobabs across the savanna.","zh":"我们在稀树草原上看到了好几棵猴面包树。"}]},{"partOfSpeech":"n.","definition":{"en":"the fruit of the baobab tree, often used in drinks and foods.","zh":"猴面包树的果实（常用于饮品和食物中）。"},"examples":[{"en":"Baobab fruit powder is added to smoothies for a slightly sour taste.","zh":"猴面包树果粉常被加进冰沙里，带一点微酸的味道。"}]}],"synonyms":["monkey-bread tree"],"phonetic":"ˈbeɪoʊbæb","extraExplanation":["“baobab”一词常与非洲文化与自然景观联系在一起，被称为“生命之树”，因为它能在干旱环境中储水并提供食物与遮荫。","在文学中，《小王子》（The Little Prince）里“baobabs（猴面包树）”被用作隐喻：如果不及时清除小问题，可能会长成难以控制的大麻烦。"]}
{"word":"BAOR","summary":{"en":"BAOR is an abbreviation for the British Army of the Rhine, a British force stationed in (West) Germany after WWII, especially during the Cold War.","zh":"BAOR是“莱茵河英国驻军”的缩写，指二战后英国在（西）德国驻扎的部队，尤以冷战时期最常见。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for British Army of the Rhine, the British Army force stationed in (West) Germany after World War II, mainly during the Cold War","zh":"British Army of the Rhine（莱茵河英国驻军）的缩写：二战后英国在（西）德国驻扎的陆军部队，主要活跃于冷战时期"},"examples":[{"en":"He served in BAOR in West Germany during the 1980s.","zh":"他在20世纪80年代于西德的BAOR服役。"},{"en":"The museum has photos of BAOR units stationed along the Rhine.","zh":"博物馆里有BAOR部队在莱茵河沿岸驻扎时的照片。"}]}],"synonyms":["British Army of the Rhine"],"phonetic":"/ˌbiː eɪ oʊ ˈɑːr/","extraExplanation":["BAOR（British Army of the Rhine）通常读作字母缩读（B-A-O-R）。它在冷战语境中很常见，指英国在西德的主要陆军部署，用于北约（NATO）防务体系。","历史上，BAOR从1945年开始逐步成形，冷战时期承担重要前沿防御任务；1990年代后随着欧洲安全格局变化而缩编/调整。"]}
{"word":"Baoule","summary":{"en":"Baoulé refers to an Akan-related ethnic group in central Côte d’Ivoire, their language, and things related to their culture.","zh":"Baoulé 指科特迪瓦中部的鲍莱族、鲍莱语，以及与其文化相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a people (ethnic group) in central Côte d’Ivoire (Ivory Coast), traditionally part of the larger Akan cultural family","zh":"（鲍莱族）科特迪瓦（象牙海岸）中部的一个民族，传统上属于更大的阿坎（Akan）文化族群"},"examples":[{"en":"Many Baoulé communities live in central Côte d’Ivoire.","zh":"许多鲍莱族社群居住在科特迪瓦中部。"},{"en":"Baoulé traditions include storytelling, music, and community ceremonies.","zh":"鲍莱族的传统包括讲故事、音乐和社区仪式。"}]},{"partOfSpeech":"n.","definition":{"en":"the Kwa language spoken by the Baoulé people","zh":"鲍莱语：鲍莱族使用的一种夸语支（Kwa）语言"},"examples":[{"en":"She can speak Baoulé and French.","zh":"她会说鲍莱语和法语。"},{"en":"The greeting was written in Baoulé.","zh":"这句问候语是用鲍莱语写的。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Baoulé people or their language and culture","zh":"与鲍莱族（或其语言、文化）有关的"},"examples":[{"en":"Baoulé art is known for carved wooden masks.","zh":"鲍莱族艺术以木雕面具闻名。"},{"en":"They studied Baoulé culture in a West African history class.","zh":"他们在西非历史课上学习了鲍莱族文化。"}]}],"synonyms":["Baoule","Baule","Bawle"],"phonetic":"/ˌbɑːuːˈleɪ/","extraExplanation":["“Baoulé”是法语拼写（科特迪瓦官方语言之一是法语），英语里也常直接沿用该写法；有时会看到不带重音符号的“Baoule”。","鲍莱族常被归入阿坎（Akan）族群体系之中；在阅读人类学或西非历史资料时，你可能会同时看到“Akan / Baoulé / Côte d’Ivoire”这些词一起出现。"]}

