{"word":"BaP","summary":{"en":"BaP usually means benzo[a]pyrene, a harmful pollutant used to assess health and cancer risk.","zh":"BaP 通常指苯并[a]芘，是一种有害污染物，常用于评估健康与致癌风险。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation for benzo[a]pyrene, a toxic chemical found in soot, cigarette smoke, and charred foods; it is used as an indicator of pollution and cancer risk in environmental and health studies.","zh":"benzo[a]pyrene（苯并[a]芘）的缩写，一种有毒化学物质，常见于烟尘、香烟烟雾和烤焦食物中；在环境与健康研究中常用作污染与致癌风险的指标。"},"examples":[{"en":"Researchers measured BaP levels in roadside air samples.","zh":"研究人员测量了路边空气样本中的 BaP 含量。"},{"en":"Cigarette smoke contains BaP, which is linked to increased cancer risk.","zh":"香烟烟雾中含有 BaP，并与更高的癌症风险相关。"},{"en":"He tries not to eat meat that is heavily charred, because it may contain BaP.","zh":"他尽量不吃烤得很焦的肉，因为可能含有 BaP。"}]}],"synonyms":["benzo[a]pyrene","benzoapyrene"],"phonetic":"/ˌbiː eɪ ˈpiː/","extraExplanation":["“BaP”通常在环境科学、毒理学与食品安全语境中出现，写作 benzo[a]pyrene 时中间的“[a]”表示分子结构中的连接位置，是化学命名的一部分。","日常对话中很少直接说“BaP”，更多出现在检测报告、论文或新闻科普里；读法常按字母读“B-A-P”。"]}
{"word":"Bap","summary":{"en":"“Bap” most commonly means a soft bread roll in the UK, and it can also mean to hit or tap lightly (or the hit itself).","zh":"“bap”最常见指（英国）软面包小圆/面包卷；也可指轻轻打/拍/敲，或指那一下轻击。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in the UK) a soft bread roll; a bun.","zh":"（尤指英国）软面包小圆/面包卷；小圆面包。"},"examples":[{"en":"I’ll have a bacon bap for breakfast.","zh":"我早餐要一个培根面包卷。"},{"en":"She made chicken salad and served it in baps.","zh":"她做了鸡肉沙拉，用小圆面包夹着吃。"}]},{"partOfSpeech":"v.","definition":{"en":"to hit someone or something (often lightly); to give a quick strike.","zh":"（常指轻轻地）打、拍、敲；迅速击打一下。"},"examples":[{"en":"He bapped the ball with his hand to keep it in the air.","zh":"他用手拍了一下球，让它不落地。"},{"en":"The cat bapped the toy and it rolled away.","zh":"猫拍了一下玩具，玩具就滚走了。"}]},{"partOfSpeech":"n.","definition":{"en":"a light hit or tap.","zh":"轻打；轻拍；一下。"},"examples":[{"en":"He gave the door a bap to see if anyone was inside.","zh":"他轻敲了一下门，看看里面有没有人。"}]}],"synonyms":["roll","bun","bread roll","tap","hit","smack"],"phonetic":"/bæp/","extraExplanation":["“bap”表示“面包小圆”时，属于英式英语里比较口语、地域性强的说法；在美国更常说 roll / bun。","动词“bap”在口语里有点俏皮、轻松的感觉，常用于小孩、宠物或不太严重的“拍一下/敲一下”的动作。"]}
{"word":"bap","summary":{"en":"“Bap” most commonly means a quick hit/tap; in the UK it can also mean a bread roll.","zh":"“bap”常指轻轻地打/拍一下；在英国口语中也可指一种面包卷。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to hit or strike someone or something, often quickly and not very hard","zh":"（快速地）打、拍、敲（某人或某物），通常不算很重"},"examples":[{"en":"He bapped me on the shoulder to get my attention.","zh":"他拍了拍我的肩膀来引起我的注意。"},{"en":"She bapped the ball across the table with her hand.","zh":"她用手把球啪地一下拍过桌面。"}]},{"partOfSpeech":"n.","definition":{"en":"a quick hit or tap","zh":"轻轻的一下打/拍/敲"},"examples":[{"en":"I felt a bap on the back of my head.","zh":"我感觉后脑勺被轻轻敲了一下。"}]},{"partOfSpeech":"n.","definition":{"en":"(UK, informal) a soft bread roll","zh":"（英式非正式）小圆面包/面包卷"},"examples":[{"en":"I’ll have a bacon bap, please.","zh":"请给我来一个培根面包卷。"},{"en":"In some parts of the UK, people call a bread roll a “bap.”","zh":"在英国的一些地方，人们把面包卷叫作“bap”。"}]}],"synonyms":["tap","hit","smack","thump","roll (UK)","bun (UK)"],"phonetic":"/bæp/","extraExplanation":["“bap”作“打/拍”的意思带有拟声感，像中文里“啪”那种短促的声音，语气通常比较口语。","“bap”作“面包卷”主要见于英国及苏格兰的日常用语；在不同地区也可能叫 bun、roll、cob 等。"]}
{"word":"BAPCO","summary":{"en":"BAPCO most commonly refers to Bahrain Petroleum Company.","zh":"BAPCO 最常见的意思是“巴林石油公司”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bahrain Petroleum Company (an oil company in Bahrain; often used as a proper name or abbreviation).","zh":"巴林石油公司（位于巴林的石油公司名称，常作为专有名词或缩写使用）。"},"examples":[{"en":"BAPCO is a major player in Bahrain’s energy sector.","zh":"BAPCO 是巴林能源领域的重要企业。"},{"en":"He worked at BAPCO for ten years as a refinery engineer.","zh":"他在 BAPCO 当了十年炼油工程师。"}]}],"synonyms":["Bahrain Petroleum Company"],"phonetic":"/ˈbæpkoʊ/","extraExplanation":["BAPCO 通常读作“Bap-co”，在新闻、商业文件和行业报告中多以缩写出现。","BAPCO 与“Bapco Energies”在一些语境中会有关联：后者是巴林在能源领域使用的集团/品牌名称。具体指代可能随文件年代与写法而变化，阅读时可结合上下文确认。"]}
{"word":"BAPCT","summary":{"en":"“BAPCT” is not a standard English word; it is most likely a field-specific acronym whose meaning depends on context.","zh":"“BAPCT”不是标准英语单词，更可能是某一领域的缩写，具体含义需要结合上下文判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An uncommon acronym/initialism with no single widely accepted meaning in general English. Its meaning depends on the specific field (e.g., a company name, a course code, a medical/technical abbreviation, or a username).","zh":"一个不常见的缩略词/首字母缩写，在通用英语里没有唯一、广泛公认的含义。它的意思取决于具体领域（例如公司名、课程代码、医学/技术缩写或用户名）。"},"examples":[{"en":"I saw “BAPCT” in the document, but there was no explanation of what it stands for.","zh":"我在文件里看到“BAPCT”，但没有解释它代表什么。"},{"en":"Can you tell me what BAPCT means in your class notes?","zh":"你能告诉我在你的课堂笔记里 BAPCT 是什么意思吗？"}]}],"synonyms":["(acronym)","(initialism)"],"phonetic":"/ˌbiː eɪ piː siː tiː/","extraExplanation":["“BAPCT”这种全大写形式通常是首字母缩写（initialism）。最可靠的做法是：查看它出现的上下文（例如标题、同一段落是否首次拼出全称），或直接询问写作者/老师。","如果你把它出现的句子、所在领域（如医学、工程、学校课程、公司/组织）或截图发我，我可以帮你更准确地推测全称与含义。"]}
{"word":"Baphia","summary":{"en":"Baphia is a genus of African plants (Fabaceae), known in part for species used for dye wood such as camwood.","zh":"Baphia（巴菲亚属）是非洲豆科植物的一属，其中一些物种因可提供染料木（如 camwood）而被提及。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of African flowering plants in the bean family (Fabaceae), including trees/shrubs whose wood may be used for dyes or timber (e.g., camwood).","zh":"（植物）巴菲亚属：非洲豆科植物的一属，包含一些灌木或小乔木；其木材在部分种类中可用于染料或木材用途（如“camwood/红木染料木”）。"},"examples":[{"en":"Camwood comes from a species in the genus Baphia.","zh":"“camwood（红木染料木）”来自巴菲亚属（Baphia）中的某些物种。"},{"en":"Baphia plants are native to parts of tropical Africa.","zh":"巴菲亚属植物原产于非洲热带地区的部分区域。"}]}],"synonyms":["camwood (for some species, e.g., Baphia nitida)"],"phonetic":"ˈbæfiə","extraExplanation":["“Baphia”多用于植物学/林业/染料相关语境，日常英语里很少见，通常出现在学名或科普文章中。","常见相关物种之一是 Baphia nitida，其木材粉末在一些地区被用作红色染料，英语俗名常见为 camwood。","词源上常被认为与表示“染色”的希腊语词根有关（与 dye/染料这一用途呼应）。"]}
{"word":"baphia","summary":{"en":"Baphia is a botanical genus name for certain African trees/shrubs, some of which provide red dye (camwood).","zh":"Baphia 是植物学上的属名（巴菲亚属），指一些非洲树木/灌木；其中部分种可提供红色染料（camwood）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of African trees and shrubs (pea family) whose heartwood is sometimes used to make a red dye (camwood).","zh":"一种非洲产的豆科树木或灌木属（巴菲亚属）；其心材有时可用来制作红色染料（camwood，俗称“非洲红木染料/红木”）。"},"examples":[{"en":"Camwood dye can be made from the heartwood of some Baphia species.","zh":"一些巴菲亚属植物的心材可以用来制作 camwood 红色染料。"},{"en":"In botany class, we learned that Baphia belongs to the legume (pea) family.","zh":"在植物学课上，我们学到巴菲亚属属于豆科（豌豆科）植物。"}]}],"synonyms":["camwood (related term)"],"phonetic":"/ˈbæfiə/","extraExplanation":["“Baphia”多见于植物学/拉丁学名语境（如 Baphia nitida）。日常英语里并不常用；更常见的相关词是“camwood”（指可作染料的木材或染料本身）。","词源上与希腊语中表示“染、浸染”的词根有关，因此常与染料用途联系在一起。"]}
{"word":"Baphomet","summary":{"en":"Baphomet is a symbolic occult figure (often depicted with a goat’s head) that is sometimes linked in popular culture to Satanism, though meanings vary by context.","zh":"巴风特是一种神秘学象征形象（常被画成羊头），在流行文化中有时与撒旦教联系，但其含义随语境而变化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a symbolic figure often shown as a human-like being with a goat’s head, used in some occult or esoteric traditions; in modern popular culture it is sometimes (often inaccurately) treated as a symbol of Satanism","zh":"巴风特（常被描绘为“羊头人身”的象征形象），用于某些神秘学/秘传传统；在现代流行文化中也常（且常不准确地）被当作撒旦教或“恶魔崇拜”的象征"},"examples":[{"en":"The museum exhibit explained how Baphomet became a popular image in modern occult art.","zh":"博物馆展览解释了巴风特如何成为现代神秘主义艺术中常见的形象。"},{"en":"Some people mistakenly assume that any image of Baphomet is linked to illegal or harmful practices.","zh":"有些人会误以为只要出现巴风特的图像就和违法或有害行为有关。"}]}],"synonyms":["occult symbol","esoteric figure","goat-headed figure"],"phonetic":"/ˈbæfəˌmɛt/","extraExplanation":["“Baphomet”这个词最早常与中世纪“圣殿骑士团（Knights Templar）”的指控联系在一起，但历史学界普遍认为这些指控带有政治与宗教斗争背景，证据复杂且不充分。","19世纪法国作家与神秘学者埃利法斯·列维（Éliphas Lévi）绘制的“羊头人身、雌雄同体、手势象征上下相应”的形象，对今天大众对巴风特的典型印象影响最大。","在当代，“巴风特”有时被一些团体用作象征（例如强调个人主义、反权威等理念的符号化表达），但它在不同语境下含义差异很大；遇到时最好结合具体来源与使用者意图理解。"]}
{"word":"baphomet","summary":{"en":"Baphomet is an occult symbolic figure (often shown with a goat’s head) whose meaning depends on historical and cultural context.","zh":"巴风特是神秘学中的象征形象（常见为羊头人身），其含义取决于具体历史与文化语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Baphomet: a symbolic figure used in some Western occult or esoteric traditions, often depicted as a human-like figure with a goat’s head; it is commonly associated (in modern culture) with ideas of occultism or Satanism, though meanings vary by group and context.","zh":"巴风特（Baphomet）：西方某些神秘学/秘传传统中的象征形象，常被描绘为“羊头人身”的形象；在现代文化中常与“神秘主义或撒旦教”联系在一起，但不同团体与语境下的含义并不相同。"},"examples":[{"en":"The novel used Baphomet as a symbol of forbidden knowledge rather than literal evil.","zh":"那部小说把巴风特当作“禁忌知识”的象征，而不是字面意义上的邪恶。"},{"en":"The museum label explained that the image of Baphomet is often misunderstood in popular culture.","zh":"博物馆的说明牌解释说，大众文化里对巴风特的形象常有误解。"}]}],"synonyms":["occult symbol","esoteric figure","goat-headed figure"],"phonetic":"/ˈbæfəˌmɛt/","extraExplanation":["“Baphomet”一词最早常被提到的历史语境之一与中世纪对圣殿骑士团（Knights Templar）的指控有关：有人声称他们崇拜名为“Baphomet”的偶像，但史料与说法复杂，学界对其真实性与来源有争议。","19世纪法国神秘学作家埃利法斯·列维（Éliphas Lévi）绘制的“山羊头人形”形象（常被称为“巴风特”）对后世影响很大：它被解读为“对立统一/平衡”（如光与暗、上与下等）的象征，而不仅仅是“恶魔”。","在当代英语中，Baphomet经常出现在恐怖、游戏、金属音乐、都市传说等流行文化里，因此语气可能带有猎奇或宗教敏感性；在正式写作中，最好说明你指的是“象征形象/艺术母题”还是“某些宗教团体的符号”。"]}
{"word":"Baphomet-like","summary":{"en":"“Baphomet-like” means resembling the occult Baphomet figure (often horned and goat‑headed), suggesting a dark ritual/occult aesthetic.","zh":"“Baphomet-like”指外观或风格像“巴风特”这种神秘学形象（常见为长角山羊头），常暗示黑暗、仪式感或邪典审美。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling Baphomet (a horned, goat‑headed occult figure), especially in a dark, satanic, or ritualistic visual style.","zh":"类似“巴风特”（一种长角、山羊头的神秘学形象）的；尤指带有黑暗、撒旦式或仪式感的视觉风格。"},"examples":[{"en":"The album cover features a Baphomet-like figure with horns and wings.","zh":"这张专辑封面上有一个类似巴风特的长角、有翅膀的人物。"},{"en":"Some viewers said the costume looked Baphomet-like because of the goat head and pentagram details.","zh":"一些观众说这套服装看起来像巴风特，因为有山羊头和五角星等细节。"}]}],"synonyms":["Baphomet-esque","goat-headed","occult-looking","satanic-looking","demonic-looking"],"phonetic":"/ˈbæfəˌmɛt laɪk/","extraExplanation":["“Baphomet（巴风特）”常与西方神秘学、炼金术与近代某些宗教/反宗教符号联系在一起；现代最常见的视觉来源是19世纪法国神秘学家Éliphas Lévi绘制的“有翼山羊头形象”。在流行文化中它常被用来传达“禁忌、邪典、仪式、黑暗审美”等氛围，但在不同语境里也可能只是风格化引用，不一定代表真实宗教立场。","写作时注意语气：在描述艺术、服装或图像时用“Baphomet-like”通常是审美/符号层面的比较；若用于评价人或群体，可能带有冒犯或污名化含义，需谨慎。"]}
{"word":"Baphometic","summary":{"en":"Baphometic means “related to Baphomet” or “having occult/dark, Baphomet-associated imagery or atmosphere.”","zh":"Baphometic 指“与巴风特有关的”，或“带有神秘学/阴暗的巴风特相关意象与氛围的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Baphomet (a symbolic figure often linked to occult or Satanic imagery), or to ideas/images associated with that figure.","zh":"与“巴风特”（Baphomet，一种常与神秘学或撒旦意象相关的象征形象）有关的；带有巴风特相关观念或图像特征的。"},"examples":[{"en":"The album cover uses baphometic imagery to create a dark, occult mood.","zh":"这张专辑封面使用了巴风特式的意象，营造出阴暗的神秘氛围。"},{"en":"Some viewers thought the sculpture looked baphometic, even though the artist denied any religious meaning.","zh":"一些观众觉得那座雕塑看起来很“巴风特式”，尽管艺术家否认有任何宗教含义。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Suggesting something sinister, occult, or “demonic” in style or atmosphere.","zh":"（引申）风格或氛围给人以阴森、神秘学或“恶魔式”联想的。"},"examples":[{"en":"The story’s baphometic tone comes more from its shadows and symbols than from any actual monsters.","zh":"这篇故事的“巴风特式”氛围更多来自阴影和象征，而不是现实中的怪物。"}]}],"synonyms":["Baphomet-like","occult","esoteric","satanic (often used loosely)","demonic (figurative)"],"phonetic":"/ˌbæfəˈmɛtɪk/","extraExplanation":["“Baphometic”来自“Baphomet（巴风特）”。Baphomet在历史上曾与中世纪对圣殿骑士团的指控相关；19世纪法国神秘学家Eliphas Lévi（埃利法斯·列维）绘制的“长着山羊头的有翼形象”让它在现代流行文化中定型。","现代语境里，Baphomet常被当作一种“象征符号”使用（例如在某些艺术、金属乐、恐怖题材或部分宗教/反宗教话语中）。使用该词时要注意：它可能带有强烈的宗教与文化敏感性，也常被误解为等同于“撒旦”。","拼写提示：更常见的形容词是“Baphomet-like”或“Baphometian”；“baphometic”能用但较少见，多见于文学/评论或风格描写。"]}
{"word":"baphometic","summary":{"en":"Baphometic means “related to Baphomet” or “having dark, occult-style imagery.”","zh":"baphometic 指“与巴风特有关的”，或“带有黑暗、神秘学风格意象的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Baphomet (a symbolic figure often associated with occult or Satanic imagery).","zh":"与“巴风特”（一种常与神秘学或撒旦意象相关的象征形象）有关的。"},"examples":[{"en":"The album cover uses baphometic imagery to create a dark, occult mood.","zh":"这张专辑封面使用了巴风特式的意象来营造黑暗的神秘氛围。"},{"en":"Some viewers found the statue’s baphometic style unsettling.","zh":"有些观众觉得那座雕像的巴风特式风格令人不安。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Dark, sinister, or occult-looking in a way that suggests ritual or esoteric symbolism.","zh":"（引申）带有黑暗、阴森或神秘仪式感的（让人联想到隐秘象征体系的）。"},"examples":[{"en":"The film’s lighting makes the room feel almost baphometic.","zh":"电影的灯光让房间显得几乎有种巴风特式的阴森感。"},{"en":"He described the artwork as baphometic, full of horns and hidden symbols.","zh":"他形容那幅作品很“巴风特式”，充满了角与隐藏的符号。"}]}],"synonyms":["occult","esoteric","satanic","infernal","sinister","Baphomet-like"],"phonetic":"ˌbæfəˈmɛtɪk","extraExplanation":["“Baphometic”来自“Baphomet（巴风特）”。历史上该名词曾与中世纪对圣殿骑士团的指控联系在一起，但现代大众更常见的形象源自19世纪法国神秘学作家埃利法斯·列维（Éliphas Lévi）绘制的“有翼、山羊头”象征图。","在当代文化中，Baphomet常被用于哥特/金属音乐、美术与影视等的“黑暗神秘”视觉元素；也会出现在某些宗教或政治表达中。使用时要注意语境与受众的宗教敏感性。","“Baphometic”并不是非常常用的标准词；更常见的表达有“Baphomet-like（像巴风特的）”、“occult（神秘学的）”、“satanic（撒旦式的，语气更强）”。"]}
{"word":"bapistery","summary":{"en":"A baptistery is a place used for Christian baptism, usually in or near a church.","zh":"baptistery 指用于举行基督教洗礼的场所，通常在教堂内或附近。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common spelling: baptistery) A part of a church (or a separate small building) used for Christian baptism, often containing a baptismal font or pool.","zh":"（常见拼写：baptistery）教堂里（或独立的小建筑）用于举行基督教洗礼的地方，通常设有洗礼池或洗礼盆。"},"examples":[{"en":"The old church’s baptistery has a small stone font.","zh":"这座古老教堂的洗礼堂里有一个小石制洗礼盆。"},{"en":"They visited the baptistery to see the historic mosaics.","zh":"他们参观了洗礼堂，去看那些历史悠久的马赛克壁画。"}]}],"synonyms":["baptismal chapel","baptismal room","baptistry (less common)"],"phonetic":"/ˈbæp.tə.ster.i/","extraExplanation":["“bapistery”多半是“baptistery”的拼写错误；正确拼写包含“t”。","在一些欧洲城市（如意大利），洗礼堂常是独立建筑，可能以壁画、马赛克或穹顶装饰而闻名。","词源与“baptize（施洗）”同源，来自希腊语，核心含义与“浸入水中/施洗”有关。"]}
{"word":"BAppArts","summary":{"en":"BAppArts is an abbreviation for Bachelor of Applied Arts, a practical, career-focused undergraduate arts degree.","zh":"BAppArts是Bachelor of Applied Arts（应用艺术学士）的缩写，指偏实践、就业导向的本科艺术类学位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbr.) Bachelor of Applied Arts: an undergraduate degree focused on practical, career-oriented arts and design-related studies (the exact program content depends on the school).","zh":"（缩写）应用艺术学士：一种以实践与就业导向为主的本科艺术类学位（具体课程与方向因学校而异）。"},"examples":[{"en":"She earned a BAppArts in graphic design and now works at an advertising agency.","zh":"她取得了平面设计方向的BAppArts（应用艺术学士），现在在一家广告公司工作。"},{"en":"The job posting says a BAppArts or equivalent degree is preferred.","zh":"招聘信息写明优先考虑BAppArts或同等学历。"}]}],"synonyms":["Bachelor of Applied Arts","Applied Arts degree"],"phonetic":"/ˌbiː ˌæp ˈɑrts/","extraExplanation":["“BAppArts”常见于学校官网、成绩单、简历/LinkedIn等正式场合，属于学位名称缩写。不同国家与院校的缩写可能不同，也可能写作“B.A.A.”或直接写全称“Bachelor of Applied Arts”。","“Applied Arts（应用艺术）”通常强调把艺术与设计用于实际产品与服务中（如平面设计、视觉传达、工业/产品设计、媒体制作等），与偏研究或理论的“Fine Arts（纯艺术）”相比更注重实践与行业技能。"]}
{"word":"Bapt","summary":{"en":"“Bapt.” is a written abbreviation for “Baptist” or “baptism,” mostly seen in formal or church-related contexts.","zh":"“Bapt.”是“Baptist（浸礼宗）”或“baptism（洗礼/浸礼）”的书面缩写，多见于正式或教会相关语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) used in writing to mean “Baptist” or “baptism,” especially in church records, names of organizations, or formal documents.","zh":"（缩写）书面用法，表示“浸礼宗（Baptist）”或“洗礼/浸礼（baptism）”，常见于教会记录、机构名称或正式文件中。"},"examples":[{"en":"He was listed as “Bapt.” in the parish register.","zh":"他在教区登记簿上被标注为“Bapt.”。"},{"en":"The school’s name includes “Bapt.” because it was founded by a Baptist church.","zh":"学校名称里有“Bapt.”，因为它由浸礼宗教会创办。"}]}],"synonyms":["Baptist (full form)","baptism (full form)"],"phonetic":"/bæpt/","extraExplanation":["“Bapt.”在现代日常英语里不常单独使用；更常见的是完整拼写：Baptist（浸礼宗/浸礼会的；浸礼宗信徒）、baptism（洗礼/浸礼）、baptize（施洗/施浸）。","在一些欧洲语言或旧式英文记录中，也可能把与“施洗”相关的词简写为“Bapt.”，例如出生/受洗登记。阅读历史档案时更常遇到。"]}
{"word":"bapt","summary":{"en":"“bapt.” is an abbreviation meaning “baptism” or “baptized,” mainly in church or genealogy records.","zh":"“bapt.”是“洗礼/受洗”的缩写，主要见于教会或家谱记录。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Abbreviation) baptism; baptized (often used in church records or genealogy).","zh":"（缩写）洗礼；受洗（常见于教会记录或家谱资料中）。"},"examples":[{"en":"bapt. 12 May 1843, St. Mary’s Church","zh":"受洗：1843年5月12日，圣玛丽教堂"},{"en":"The record says “bapt.,” not “born,” so it lists the baptism date.","zh":"记录写的是“bapt.”而不是“born”，所以列的是受洗日期。"}]}],"synonyms":["baptized","baptism"],"phonetic":"/bæpt/","extraExplanation":["在英文家谱或教会文献里，常见缩写包括：bapt.（baptized/ baptism 受洗）、b.（born 出生）、d.（died 去世）、bur.（buried 安葬）。注意“bapt.”记录的是受洗时间，不一定等于出生时间。"]}
{"word":"Baptanodon","summary":{"en":"Baptanodon is an extinct Late Jurassic ichthyosaur genus, historically described as toothless and often linked to Ophthalmosaurus.","zh":"Baptanodon 是一种已灭绝的晚侏罗世鱼龙类属，早期被认为无牙，且常与（或并入）Ophthalmosaurus（眼龙）相关联。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct genus of ichthyosaurs (marine reptiles) from the Late Jurassic; it was once thought to be toothless and is often treated as closely related to, or even the same as, Ophthalmosaurus.","zh":"一种已灭绝的鱼龙类（海生爬行动物）属，生活在晚侏罗世；因最初被认为“无牙”而得名，后来常被认为与（甚至可能等同于）Ophthalmosaurus（眼龙）关系非常接近。"},"examples":[{"en":"Baptanodon is a famous ichthyosaur name found in older paleontology books.","zh":"Baptanodon 是一些较早期古生物学书籍中常见的鱼龙名称。"},{"en":"Some researchers classify Baptanodon specimens as Ophthalmosaurus because they share many features.","zh":"有些研究者会把 Baptanodon 的标本归入 Ophthalmosaurus（眼龙），因为它们有许多共同特征。"},{"en":"The fossil was identified as Baptanodon from Late Jurassic rock layers in North America.","zh":"这块化石被鉴定为 Baptanodon，来自北美的晚侏罗世岩层。"}]}],"synonyms":["Ophthalmosaurus","ichthyosaur"],"phonetic":"/ˌbæp.təˈnoʊ.dɑn/","extraExplanation":["词源小提示：Baptanodon 由希腊语构词而来，常被解释为与“潜入/浸入”（baptein/bapto）和“无牙”（an- + odon/odous，牙）有关——因为早期描述时以为它没有牙齿，后来发现可能只是牙齿保存不完整或很小。","在古生物学里，属名（genus）会随着新化石和新分析而调整；因此你可能在不同资料里看到 Baptanodon 被单独使用，或被并入 Ophthalmosaurus。"]}
{"word":"baptanodon","summary":{"en":"Baptanodon is an extinct ichthyosaur genus from the Late Jurassic, known from North American fossils.","zh":"Baptanodon 是一种晚侏罗世的已灭绝鱼龙属，主要依据北美出土化石而知。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct genus of large marine reptiles (ichthyosaurs) that lived during the Late Jurassic period; known from fossils found mainly in North America.","zh":"一种已灭绝的海生爬行动物属（鱼龙类），生活在晚侏罗世；其化石主要发现于北美。"},"examples":[{"en":"Baptanodon fossils have been used to study how ichthyosaurs adapted to life in the open ocean.","zh":"研究人员利用Baptanodon的化石来了解鱼龙如何适应远洋生活。"},{"en":"In a museum exhibit on Jurassic seas, you might see Baptanodon displayed alongside other ichthyosaurs.","zh":"在介绍侏罗纪海洋的博物馆展览中，你可能会看到Baptanodon与其他鱼龙一起展出。"}]}],"synonyms":["ichthyosaur","marine reptile"],"phonetic":"/bæpˈtænəˌdɑn/","extraExplanation":["Baptanodon 是古生物学里的属名，常见于学术或博物馆语境，不是日常英语词汇。","词源上可拆为 Greek bapt-（“潜入/浸入”相关）+ -odon（“牙齿”），但对学习者来说更重要的是把它当作专有名词：一种鱼龙。"]}
{"word":"baptise","summary":{"en":"Baptise means to perform Christian baptism with water; it can also mean to officially name or launch something new (spelled baptize in American English).","zh":"Baptise 指用水举行基督教施洗礼；也可指为新事物正式命名或启用（美式英语常拼作 baptize）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Christianity) To perform a religious ceremony using water to welcome someone into the Christian faith; to baptize.","zh":"（基督教）用水举行宗教仪式，使某人加入基督信仰；给……施洗（同 baptize）。"},"examples":[{"en":"The baby will be baptised next Sunday at the local church.","zh":"这个婴儿将在下周日于当地教堂受洗。"},{"en":"She was baptised when she was twelve.","zh":"她十二岁时受了洗。"}]},{"partOfSpeech":"vt.","definition":{"en":"To officially name or start something new; to ‘christen’ it (often used in writing and journalism).","zh":"为新事物正式命名或宣告开始；“为……命名/开张”（常见于书面语或新闻语境）。"},"examples":[{"en":"The press baptised the new policy “a turning point.”","zh":"媒体把这项新政策称为“转折点”。"},{"en":"They baptised the ship with a short ceremony before its first voyage.","zh":"他们在首航前用简短仪式为这艘船举行命名/启用仪式。"}]}],"synonyms":["baptize","christen","name","initiate"],"phonetic":"/bæpˈtaɪz/","extraExplanation":["英式拼写是 baptise，美式拼写更常见的是 baptize；两者意思相同，只是拼写习惯不同。","在基督教文化里，baptise/baptize 通常象征“洁净、重生、加入信仰团体”。不同教派的做法可能不同：有的用少量水洒在头上，有的会全身浸入水中。","“baptise/christen something”也可带一点比喻意味：给新事物取一个被大家接受的名字，或用某次事件让某物“正式登场”。"]}
{"word":"baptised","summary":{"en":"“Baptised” means someone has been baptized—given the Christian rite of baptism; it can also be used figuratively for being initiated into something new.","zh":"“baptised”表示“受洗/施洗”（基督教洗礼）；也可作比喻，指被带入或初次经历某个新领域。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle of baptise/baptize) to perform a Christian ceremony in which someone is washed with water or immersed in water as a sign of joining the faith.","zh":"（baptise/baptize 的过去式/过去分词）为某人施行基督教的“洗礼/浸礼”，用水洗洒或浸入水中，象征加入信仰。"},"examples":[{"en":"She was baptised when she was a baby.","zh":"她还是婴儿时就受洗了。"},{"en":"He was baptised at the local church last Sunday.","zh":"他上周日在当地教堂受洗了。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) to introduce someone or something to a new experience in a way that feels like an initiation.","zh":"（比喻）让某人/某物经历一种“入门式”的新体验，好像经过了某种正式的开始。"},"examples":[{"en":"The first week at the new job baptised her into the world of deadlines.","zh":"新工作的第一周让她算是“入门”了截止日期的世界。"}]}],"synonyms":["baptized","christened","initiated"],"phonetic":"/bæpˈtaɪzd/","extraExplanation":["“baptised”是英式拼写；美式更常写作“baptized”。两者意思相同。","在不同基督教传统中，洗礼方式可能不同：有的用点水（sprinkling/pouring），有的用浸入水中（immersion）。"]}
{"word":"baptises","summary":{"en":"“Baptises” means “performs baptism on” (religious) or, figuratively, “initiates someone into a new experience.”","zh":"“baptises”指“为某人施洗”（宗教），也可比喻“使某人初次经历并进入某种体验/考验”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(third-person singular of baptise/baptize) to perform a Christian baptism on someone; to officially welcome someone into the Christian church using water as a symbol of faith.","zh":"（baptise/baptize 的第三人称单数）为某人施洗；用水作为信仰象征，使其正式加入基督教会。"},"examples":[{"en":"The priest baptises the baby on Sunday.","zh":"神父在周日为婴儿施洗。"},{"en":"In some churches, the pastor baptises new members in a river.","zh":"在一些教会里，牧师会在河里为新成员施洗。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) to introduce someone to a new experience in a sudden or intense way; to “initiate” someone.","zh":"（比喻）让某人突然或强烈地经历新事物；使某人“初次体验/入门”。"},"examples":[{"en":"The first big project baptises new employees into real workplace pressure.","zh":"第一个大项目让新员工真正“体验到”职场压力。"},{"en":"A tough winter storm baptises the newcomers into life in the north.","zh":"一场严冬风暴让新来的人初次体会北方生活。"}]}],"synonyms":["baptizes","christens","initiates","introduces"],"phonetic":"/bæpˈtaɪzɪz/","extraExplanation":["“baptises”常见于英式拼写 baptise；美式通常写作 “baptizes”。意思相同，只是拼写习惯不同。","宗教语境中，baptise/baptize 指“洗礼”，不同教派方式可能不同（如点水、浸水等），但都强调象征性的洁净与信仰归属。","比喻用法里常带有“让人第一次吃到苦头/接受考验”的语气，类似 initiate someone into… / give someone a baptism of fire（经受严峻考验）。"]}
{"word":"Baptisia","summary":{"en":"Baptisia is a North American plant genus known as false indigo, valued for hardy growth and showy flower spikes.","zh":"Baptisia（假靛蓝）是北美原产的植物属，因耐性强、花序醒目而常用于园艺。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of North American flowering plants in the pea family (Fabaceae), commonly called false indigo, often grown in gardens for its tall flower spikes.","zh":"一种北美原产的开花植物属（豆科），常称“假靛蓝”，因花序高挺、适合园艺种植而常见。"},"examples":[{"en":"Baptisia is a tough perennial that can handle drought once it’s established.","zh":"假靛蓝是一种很耐养的多年生植物，成活后能耐旱。"},{"en":"The gardener planted Baptisia near the back of the border for its tall blooms.","zh":"园丁把假靛蓝种在花境后排，因为它的花序很高。"}]}],"synonyms":["false indigo"],"phonetic":"/bæpˈtɪziə/","extraExplanation":["“Baptisia”常见园艺名是“false indigo（假靛蓝）”。早期北美殖民时期，人们曾用某些Baptisia物种做蓝色染料的替代来源，但染色效果通常不如真正的靛蓝植物（Indigofera）。","常见种：Baptisia australis（蓝花假靛蓝）。在英文园艺语境里，有时会直接用属名Baptisia来泛指这类观赏植物。"]}
{"word":"baptisia","summary":{"en":"Baptisia is a group of North American plants known as wild (or false) indigo, often used as an ornamental garden plant.","zh":"Baptisia 指北美的一类植物（野靛蓝/假靛蓝），常作为观赏植物栽培。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of North American flowering plants (pea family) commonly called wild indigo or false indigo; often grown in gardens and sometimes used in herbal products","zh":"北美原生的一类开花植物属（豆科），常见英文名为“wild indigo / false indigo（野靛蓝/假靛蓝）”；常用于园艺种植，也偶见于草本制品"},"examples":[{"en":"Baptisia blooms in late spring and attracts many pollinators.","zh":"Baptisia 通常在晚春开花，会吸引许多传粉昆虫。"},{"en":"The garden designer used baptisia for its tall flower spikes and drought tolerance.","zh":"园艺设计师选用 baptisia，因为它花序高挑，而且耐旱。"},{"en":"Some herbal labels mention baptisia, but you should check safety information first.","zh":"有些草本产品会标注含有 baptisia，但最好先确认其安全信息。"}]}],"synonyms":["wild indigo","false indigo"],"phonetic":"/bæpˈtɪziə/","extraExplanation":["“Baptisia”多作为植物学名称使用，日常语境里更常见的是通俗名：wild indigo（野靛蓝）或 false indigo（假靛蓝）。","词源与“染色”有关：与希腊语中表示“浸染/染色”的词根相关（也与英语 baptize 同源），因为早期有人用它来尝试制作类似靛蓝的染料。","在园艺中它因耐旱、耐寒、寿命长而受欢迎；但若涉及“草药/内服”，不同物种与剂量的安全性差异大，建议谨慎并咨询专业人士。"]}
{"word":"baptisias","summary":{"en":"Baptisia (often called wild indigo) is a North American flowering plant genus popular in gardens.","zh":"Baptisia（常称野靛蓝）是北美原生的开花植物属，常用于园艺观赏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Baptisia: a genus of North American flowering plants in the pea family, often called wild indigo, grown for their upright flower spikes (blue, purple, yellow, or white).","zh":"Baptisia：北美原生的一类豆科开花植物属，常称“野靛蓝（wild indigo）”，因其直立的花序（蓝/紫/黄/白等）而常被栽培观赏。"},"examples":[{"en":"Baptisia is a hardy perennial that can handle heat and drought once established.","zh":"Baptisia 是一种很耐养的多年生植物，一旦扎根后能耐热也耐旱。"},{"en":"The gardener planted Baptisia near the fence for its tall spring blooms.","zh":"园丁把 Baptisia 种在篱笆旁边，利用它春季高挑的花。"},{"en":"Some people call Baptisia “wild indigo,” but it’s mainly used as an ornamental today.","zh":"有人把 Baptisia 叫“野靛蓝”，但如今主要作为观赏植物。"}]}],"synonyms":["wild indigo"],"phonetic":"/bæpˈtɪʒiə/","extraExplanation":["“baptisias”多半是拼写或复数用法（Baptisia 的复数也可写作 Baptisias），常见于园艺语境（如“我种了几株 baptisias”）。","Baptisia 这个名字看起来像 baptism（洗礼），但这里指植物学属名；部分种类过去曾被用来制作类似靛蓝的染料，因此英文俗名有 wild indigo。","写作时如果指具体一种植物，常用物种名：例如 Baptisia australis（蓝花野靛蓝）。"]}
{"word":"baptisin","summary":{"en":"“Baptisin” is likely a misspelling of “baptism,” meaning the Christian ceremony of being baptized, or figuratively a first severe test (“a baptism of fire”).","zh":"“baptisin”很可能是“baptism（洗礼）”的拼写误差，指基督教的受洗仪式；也可引申为首次严峻考验（a baptism of fire）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended) a Christian religious ceremony in which a person is washed with water or immersed in water as a sign of becoming part of the church; also, the act of baptizing.","zh":"（可能想写）“洗礼”：基督教的宗教仪式，用水浇洒或浸入水中，象征加入教会；也指施洗这一行为。"},"examples":[{"en":"She was baptized as a baby, so she has a baptism certificate.","zh":"她婴儿时受过洗，所以有一张洗礼证明。"},{"en":"The church held a baptism on Sunday morning.","zh":"教会在周日早上举行了洗礼仪式。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension) a first difficult experience that teaches someone what something is really like (“a baptism of fire”).","zh":"（引申）第一次艰难经历，使人真正见识到某事的现实（如“baptism of fire”）。"},"examples":[{"en":"The new teacher’s first week was a real baptism of fire.","zh":"这位新老师的第一周真是一次“火的洗礼”（非常艰难的考验）。"}]}],"synonyms":["christening (often for babies in some churches)","initiation (figurative)","rite (religious ceremony)"],"phonetic":"/ˈbæp.tɪ.zəm/","extraExplanation":["你写的“baptisin”在英文里不常见，通常是拼写或输入法误差。最常见的目标词是 **baptism**（名词：洗礼）或 **baptizing**（动名词/现在分词：施洗、正在施洗）。","词源小知识：baptism 来自希腊语 *baptizein*，原意与“浸入水中”有关，所以很多教派会用“浸礼”的方式施洗。","常见搭配：baptism certificate（洗礼证明）、baptism ceremony/service（洗礼仪式）、be baptized（受洗）、a baptism of fire（首次严峻考验）。"]}
{"word":"baptising","summary":{"en":"Baptising means performing or taking part in a baptism ceremony (and sometimes naming a ship or ‘initiating’ something in a figurative way).","zh":"baptising 指施行或参与洗礼仪式；也可指为船只命名，或比喻“让某事开始/进入新阶段”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of baptizing; giving someone baptism, usually by water, as a Christian religious ceremony","zh":"施洗；施行洗礼（通常用水给人施洗的基督教宗教仪式）"},"examples":[{"en":"The church held a baptising for three infants on Sunday.","zh":"教会在周日为三名婴儿举行了施洗礼。"},{"en":"Only a pastor or priest can lead the baptising in some traditions.","zh":"在一些传统中，只有牧师或神父才能主持施洗。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “baptise/baptize”: performing baptism; also used to mean officially naming a ship, or starting something in a new way (figurative)","zh":"“baptise/baptize”的现在分词：正在施洗；也可指为船只举行命名仪式，或（比喻）让某事“开启新阶段”"},"examples":[{"en":"They are baptising new members at the river today.","zh":"他们今天在河边为新成员施洗。"},{"en":"The navy is baptising the new ship with a traditional ceremony.","zh":"海军用传统仪式为新舰举行命名礼。"},{"en":"The first heavy rain was baptising the newly planted garden.","zh":"第一场大雨像是在“洗礼”新栽的花园。（比喻）"}]}],"synonyms":["baptizing","christening","initiating"],"phonetic":"/bæpˈtaɪzɪŋ/","extraExplanation":["“baptising”是英式拼法；美式更常写作“baptizing”。两者意思相同。","在基督教语境里，baptise/baptize常与“洗礼、加入信仰团体、象征新生”相关；不同教派做法可能不同（如洒水、浸水等）。"]}
{"word":"baptism","summary":{"en":"Baptism is a Christian ceremony using water to welcome someone into the faith; it can also mean a person’s first difficult, reality-check experience (often “a baptism of fire”).","zh":"baptism 指基督教以水进行、象征加入信仰的洗礼；也可比喻“第一次严峻考验”，常见于 a baptism of fire。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Christian religious ceremony in which a person is welcomed into the faith by being washed with water or immersed in water","zh":"（基督教）洗礼：用水洒洗或浸水的宗教仪式，象征加入信仰与灵性洁净"},"examples":[{"en":"She was baptized as a baby, but she chose to be baptized again as an adult.","zh":"她婴儿时受过洗，但成年后选择再次受洗。"},{"en":"In some churches, baptism happens by full immersion in a river or a pool.","zh":"在一些教会里，洗礼会在河里或池子里全身浸入进行。"}]},{"partOfSpeech":"n.","definition":{"en":"a first strong experience of something difficult or serious that teaches you what it is really like (often used in the phrase “a baptism of fire”)","zh":"（比喻）初次严峻考验：第一次经历艰难或严肃的事情，让人真正见识到其难度（常见于短语“baptism of fire”）"},"examples":[{"en":"Her first week as a nurse in the emergency room was a baptism of fire.","zh":"她在急诊室当护士的第一周就是一次严峻的考验。"},{"en":"The new manager’s first big crisis became his baptism into leadership.","zh":"新经理第一次面对重大危机，成了他进入领导角色的“洗礼”。"}]}],"synonyms":["christening","initiation","rite","rite of passage","a baptism of fire"],"phonetic":"/ˈbæp.tɪz.əm/","extraExplanation":["“baptism”来自希腊语词根，含有“浸入/洗”的意思。不同基督教传统对洗礼形式与意义的强调不同：有的强调婴儿洗礼，有的强调信徒在有意识的信仰选择后受洗。","常见搭配：be baptized（受洗）；baptismal（洗礼的，如 baptismal font 洗礼池/洗礼盆）；a baptism of fire（严峻的初次考验，多用于工作、战争或高压场景）。"]}
{"word":"baptism-like","summary":{"en":"“Baptism-like” means similar to baptism, often suggesting cleansing, initiation, or a fresh start.","zh":"“baptism-like”意为“像洗礼一样的”，常引申为净化、入门或重新开始。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling baptism (a Christian religious ceremony using water to mark joining the faith), especially in meaning a cleansing, initiation, or symbolic “fresh start.”","zh":"像“洗礼”的；类似基督教用水进行的洗礼仪式，常引申为“净化、入门、重新开始”的象征。"},"examples":[{"en":"For her, moving to a new city felt baptism-like—a chance to begin again.","zh":"对她来说，搬到新城市像一次洗礼——给了她重新开始的机会。"},{"en":"The retreat included a baptism-like ritual of washing hands to symbolize letting go of stress.","zh":"这次静修包含了一个类似洗礼的仪式：洗手来象征放下压力。"}]}],"synonyms":["baptismal","initiatory","purifying","ritual-like","symbolic"],"phonetic":"/ˈbæp.tɪz.əm laɪk/","extraExplanation":["“baptism-like”通常出现在描写或评论中（尤其是文学、新闻评论、随笔），用来强调“象征性的净化/转变”。在宗教语境里，baptism 指基督教的圣礼（sacrament），带有“进入信仰群体”的意义；在非宗教语境里，用它作比喻时，表达的是经历某件事后“被改变、获得新身份或新阶段”的感觉。","写作中要注意语气：对某些人来说，baptism 是非常神圣的宗教概念；如果用于比喻（例如商业、娱乐或个人生活），最好确保语境尊重、不轻佻。"]}
{"word":"baptismal","summary":{"en":"Baptismal means “connected with baptism,” and it can also refer to the baptismal font in a church.","zh":"baptismal 表示“与洗礼有关的”，也可指教堂里的“洗礼池/洗礼盆”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to baptism (a Christian ceremony of initiation, usually involving water).","zh":"与“洗礼/受洗”（基督教的入教仪式，通常与水有关）有关的；洗礼的。"},"examples":[{"en":"The church keeps baptismal records for every child who is baptized there.","zh":"教会会保存每个在这里受洗的孩子的洗礼记录。"},{"en":"She wore a baptismal gown that had been in the family for generations.","zh":"她穿了一件家族传了好几代的受洗礼服。"}]},{"partOfSpeech":"n.","definition":{"en":"A baptismal font (the basin or container used to hold water for baptism).","zh":"（常用复数）洗礼池/洗礼盆：用于盛放洗礼用水的容器。"},"examples":[{"en":"They placed flowers near the baptismal at the front of the church.","zh":"他们把花摆在教堂前方的洗礼池旁。"}]}],"synonyms":["of baptism","christening (BrE, often for infants)"],"phonetic":"/bæpˈtɪzməl/","extraExplanation":["词源提示：baptismal 来自 baptism（洗礼）+ 形容词后缀 -al，表示“与……有关的”。在教会语境里常见搭配有 baptismal gown（受洗礼服）、baptismal name（教名/受洗名）、baptismal records（洗礼登记册）、baptismal font（洗礼池）。","文化语境：在英语里，baptismal 多用于宗教或正式语域；日常口语更常说 “baptism” + 名词（如 baptism certificate 洗礼证明）。"]}
{"word":"baptismally","summary":{"en":"An adverb meaning “in relation to baptism; in a baptismal way.”","zh":"副词，表示“与洗礼有关；在洗礼意义上”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to baptism (the Christian rite of initiation with water).","zh":"以与“洗礼”（基督教用水进行的入教仪式）有关的方式；在洗礼意义上。"},"examples":[{"en":"In many churches, a person is considered baptismally initiated into the community.","zh":"在许多教会中，一个人被认为在洗礼意义上已被接纳进入共同体。"},{"en":"The writer describes the river as a place where people are baptismally renewed.","zh":"作者把这条河描写成一个使人们在洗礼意义上得到更新的地方。"}]}],"synonyms":["in baptism","in a baptismal way","through baptism"],"phonetic":"/bæpˈtɪz.mə.li/","extraExplanation":["“baptismally”比较少见，多用于宗教、神学或较正式的写作中。日常表达里更常说：“in baptism / through baptism / in a baptismal way”。","构词：baptism（洗礼）+ -al（……的）→ baptismal（洗礼的）+ -ly（副词）→ baptismally。"]}
{"word":"baptisms","summary":{"en":"“Baptisms” means religious ceremonies of baptism, or figuratively, first tough experiences that initiate someone into a new role.","zh":"“baptisms”指（基督宗教等的）洗礼，也可比喻让人初次经历严峻考验、进入新阶段的经历。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The religious ceremony (especially in Christianity) in which a person is formally admitted into the faith, traditionally using water (by sprinkling, pouring, or immersion).","zh":"（尤指基督宗教中的）洗礼：用水（洒水、浇水或浸水）进行的宗教仪式，象征正式加入信仰团体。"},"examples":[{"en":"The church held baptisms on Sunday morning.","zh":"教会在周日早晨举行洗礼。"},{"en":"In many traditions, infant baptisms are common.","zh":"在许多传统中，婴儿洗礼很常见。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) A first difficult experience that ‘initiates’ someone into a new job, role, or situation (often in the phrase “baptism of fire”).","zh":"（比喻）首次艰难的经历，使人“入门/受考验”并适应新工作或新角色（常见于短语“baptism of fire”）。"},"examples":[{"en":"Her first live debate was a baptism of fire.","zh":"她第一次现场辩论就是一场严峻的考验。"},{"en":"The rookie’s first game felt like a baptism of fire.","zh":"新人的第一场比赛感觉像是“火的洗礼”。"}]}],"synonyms":["christening","initiation","rite","ceremony"],"phonetic":"/ˈbæp.tɪ.zəm/","extraExplanation":["“baptisms”是复数形式；单数是“baptism”。在不同教派中，洗礼的做法和象征意义会不同：有的强调婴儿洗礼（家庭与教会的承诺），有的强调信徒在理解信仰后受洗（公开表达个人信仰）。","词源上与希腊语有关，核心含义是“浸入/洗净”，因此英语里也容易引申出“经历考验后被塑造/被带入新阶段”的比喻用法，如“baptism of fire”。"]}
{"word":"Baptist","summary":{"en":"Baptist refers to a member of, or something related to, the Protestant Christian tradition that emphasizes baptism and personal faith.","zh":"Baptist 指浸礼宗（浸信会）的信徒，或与该新教教派相关的事物；其特点是强调受洗与个人信仰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a Protestant Christian church (the Baptists) that emphasizes baptism (especially of believers) and personal faith","zh":"浸礼宗（浸信会）成员；一种新教基督教派，强调（尤其是信徒的）受洗与个人信仰"},"examples":[{"en":"She was raised as a Baptist and still attends a Baptist church.","zh":"她从小在浸礼宗家庭长大，现在仍去浸信会教堂做礼拜。"},{"en":"Many Baptists practice believer’s baptism instead of infant baptism.","zh":"许多浸礼宗信徒实行“信徒受洗”，而不是“婴儿洗礼”。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Baptist church or its beliefs","zh":"浸礼宗的；与浸信会或其信仰有关的"},"examples":[{"en":"He teaches at a Baptist college.","zh":"他在一所浸礼宗背景的学院任教。"},{"en":"They joined a Baptist congregation in their new town.","zh":"他们在新城镇加入了一个浸信会会众团体。"}]}],"synonyms":["(n.) Baptists","(adj.) Baptist (as modifier)","Protestant (broader term)"],"phonetic":"/ˈbæp.tɪst/","extraExplanation":["“Baptist”来自“baptize（施洗、施行洗礼）”。浸礼宗在英语世界（尤其美国南部）影响较大，常见搭配有“Baptist church（浸信会教堂）”“Southern Baptist（南方浸信会）”。","文化上，“Baptist”常与强调个人信仰选择、讲道传统、教会自治等联系在一起；但不同浸信会团体在礼拜形式与教义细节上也可能有差异。"]}
{"word":"baptist","summary":{"en":"“Baptist” means a person who belongs to the Baptist Christian tradition, or something related to Baptists.","zh":"“Baptist”指浸信会教徒，或与浸信会相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a Protestant Christian group (Baptists) who believe that baptism should be done for people who personally choose to believe, often by immersing them in water","zh":"浸信会教徒；浸礼宗信徒（新教的一支，主张受洗应基于个人信仰告白，常以全身浸入水中的方式施行）"},"examples":[{"en":"Her grandparents are Baptist, so they go to a Baptist church every Sunday.","zh":"她的祖父母是浸信会教徒，所以他们每周日都去浸信会教堂。"},{"en":"He was baptized as an adult in a Baptist tradition.","zh":"他在浸信会传统中成年后接受了洗礼。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Baptists or to a Baptist church","zh":"浸信会的；与浸信会或浸信会教堂有关的"},"examples":[{"en":"They attended a Baptist service while visiting family.","zh":"他们探亲时参加了一次浸信会礼拜。"},{"en":"She sings in the Baptist choir.","zh":"她在浸信会诗班唱歌。"}]}],"synonyms":["(adj.) Protestant (general)","(n.) Baptist believer"],"phonetic":"/ˈbæptɪst/","extraExplanation":["“Baptist”来自“baptize（施洗）”，再往上可追溯到希腊语词根，含有“浸入水中”的意思，这也与许多浸信会教会常采用“全身浸礼”有关。","在美国文化中，“Baptist”常见于教会名称（如“First Baptist Church”），并在部分地区具有明显的社区与历史色彩；不过不同浸信会团体在礼拜风格与组织结构上也可能差异很大。"]}
{"word":"Baptista","summary":{"en":"Baptista is mainly a name (given name or surname) and is also the name of a character in Shakespeare’s *The Taming of the Shrew*.","zh":"Baptista 主要用作人名（名或姓），也指莎士比亚《驯悍记》中的人物。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A masculine given name or surname (often from Italian/Portuguese), related to the idea of “baptist” or “one who baptizes.”","zh":"男性名字或姓氏（常见于意大利语/葡萄牙语背景），含义与“施洗者/施行洗礼的人”相关。"},"examples":[{"en":"His last name is Baptista, and his family is from Brazil.","zh":"他姓Baptista，家人来自巴西。"},{"en":"Baptista is a common surname in Portuguese-speaking countries.","zh":"Baptista 是葡语国家比较常见的姓氏。"}]},{"partOfSpeech":"other","definition":{"en":"Baptista Minola: a character in Shakespeare’s play *The Taming of the Shrew*, the father of Bianca and Katharina.","zh":"巴普蒂斯塔·米诺拉：莎士比亚戏剧《驯悍记》中的人物，比安卡与凯瑟琳娜的父亲。"},"examples":[{"en":"In *The Taming of the Shrew*, Baptista tries to arrange his daughters’ marriages.","zh":"在《驯悍记》中，Baptista 试图安排女儿们的婚事。"},{"en":"Baptista’s rule about Bianca’s marriage drives much of the plot.","zh":"Baptista 关于比安卡婚事的规定推动了剧情发展。"}]}],"synonyms":["Baptiste","Bautista"],"phonetic":"/bæpˈtiːstə/","extraExplanation":["“Baptista”源自拉丁语/希腊语词根，与“baptize（施洗）”同源；在不同语言中常见拼写变体包括 Baptista、Baptiste 等。","在英语课堂或文学讨论里提到 Baptista，常指《驯悍记》里的父亲角色；在日常语境里则更可能是人名（姓或名）。"]}
{"word":"Baptiste","summary":{"en":"Baptiste is a French proper name (given name or surname), often connected to “Jean-Baptiste” (John the Baptist).","zh":"Baptiste是一个法语人名或姓氏，常与“Jean-Baptiste”（施洗者约翰）有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a French given name or surname (a proper name), common in French-speaking places such as France, Haiti, and parts of Canada.","zh":"一个法语名字或姓氏（专有名词），在法国、海地、加拿大部分法语区等地很常见。"},"examples":[{"en":"My classmate Baptiste is from Quebec.","zh":"我的同学Baptiste来自魁北克。"},{"en":"The author Baptiste wrote about life in Haiti.","zh":"作者Baptiste写了关于海地生活的作品。"}]},{"partOfSpeech":"n.","definition":{"en":"(often in the form “Jean-Baptiste”) a name that refers to John the Baptist in Christian tradition; used in many French names.","zh":"（常见形式为“Jean-Baptiste”）源自基督教传统中的“施洗者约翰”的名字成分，常用于法语姓名中。"},"examples":[{"en":"His full name is Jean-Baptiste Martin.","zh":"他的全名是Jean-Baptiste Martin。"},{"en":"Many historical figures in French-speaking countries were named Jean-Baptiste.","zh":"在法语国家里，许多历史人物名叫Jean-Baptiste。"}]}],"synonyms":["Jean-Baptiste (related form)","Baptist (related word, different meaning)"],"phonetic":"/bæpˈtiːst/","extraExplanation":["“Baptiste”来自法语，与“baptize（施洗、洗礼）”同源，和基督教中的“施洗者约翰（John the Baptist）”有关。在法语文化里，它既可以单独作为名字/姓氏，也常作为复合名的一部分（如Jean-Baptiste）。注意：它是人名/姓氏，不等同于英文宗教名词“Baptist（浸礼宗教徒/浸礼宗的）”。"]}
{"word":"baptisteries","summary":{"en":"Baptisteries are buildings or church rooms specially used for Christian baptism.","zh":"baptisteries 指专门用于基督教施洗的建筑或教堂内的洗礼空间（baptistery 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of baptistery) a separate building or a special room in a church used for Christian baptism (especially by immersion).","zh":"（baptistery 的复数）洗礼堂：专门用于基督教施洗（尤其是全身浸入式洗礼）的独立建筑或教堂内的专用房间。"},"examples":[{"en":"Many early churches had baptisteries next to the main sanctuary.","zh":"许多早期教堂在主礼拜堂旁边设有洗礼堂。"},{"en":"The guide explained why baptisteries were often built as separate structures.","zh":"导游解释了为什么洗礼堂常常被建成独立的建筑。"}]}],"synonyms":["baptismal chapels","baptismal rooms","baptismal fonts (related, not the room)"],"phonetic":"/ˈbæp.təˌstɪriz/","extraExplanation":["“baptistery”常见于基督宗教建筑史语境：在晚期古罗马与中世纪早期，洗礼常在复活节等重要节期集中举行，因此洗礼堂可能规模较大，并与主堂分离，常见圆形或八角形平面（象征“新生/第八日”）。","著名例子包括意大利佛罗伦萨的圣若望洗礼堂（Battistero di San Giovanni）。在英文导览、艺术史、建筑史文本中，“baptisteries”常用来指这些历史建筑群。"]}
{"word":"baptistery","summary":{"en":"A baptistery is a place in or near a church where baptisms are performed.","zh":"baptistery 指教堂内或附近用于举行洗礼的场所。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A part of a church (or a separate small building) used for baptism, often containing a baptismal font or a baptism pool.","zh":"（教堂内的）洗礼堂/洗礼室；或独立的小礼拜建筑，用于举行受洗仪式，通常有洗礼池或洗礼盆。"},"examples":[{"en":"The tour guide led us into the baptistery and pointed out the ancient baptismal font.","zh":"导游带我们走进洗礼堂，指着那座古老的洗礼盆。"},{"en":"In some churches, the baptistery is a separate building next to the main sanctuary.","zh":"在一些教堂里，洗礼堂是主礼拜堂旁边的一栋独立建筑。"}]}],"synonyms":["baptismal chapel","baptismal room"],"phonetic":"/ˈbæp.tə.stɚ.i/","extraExplanation":["在基督教传统中，“baptistery”通常指专门用于施行洗礼（baptism）的空间。早期教会有时会把洗礼堂建成独立的建筑（尤其在大型教堂或主教座堂附近），因为洗礼在当时常被视为重要而隆重的仪式。","词源上与“baptize（施洗）”同源，来自希腊语词根，核心含义与“浸入水中/洗净”相关。"]}
{"word":"Baptistic","summary":{"en":"Baptistic means “related to Baptists or emphasizing baptism,” often used in academic or descriptive writing.","zh":"Baptistic 指“与浸信会有关”或“强调洗礼/浸礼”，多用于学术或描述性语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Baptist church or Baptist beliefs and practices.","zh":"与浸信会（Baptist）或其信仰与实践有关的。"},"examples":[{"en":"The seminary is known for its Baptistic approach to church life.","zh":"这所神学院以其偏浸信会传统的教会观而闻名。"},{"en":"Some congregations prefer Baptistic worship styles, while others follow different traditions.","zh":"有些会众更偏好浸信会风格的敬拜方式，而另一些则遵循不同的传统。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to baptism (the religious ritual), especially in a way emphasizing it strongly.","zh":"与“洗礼/浸礼”这一宗教仪式有关的；尤指特别强调洗礼的重要性。"},"examples":[{"en":"His paper discussed Baptistic themes in early Christian writings.","zh":"他的论文讨论了早期基督教著作中与洗礼相关、强调洗礼的重要主题。"},{"en":"The debate focused on whether the community’s practices were overly Baptistic.","zh":"争论的焦点在于这个群体的做法是否过度强调洗礼。"}]}],"synonyms":["Baptist","Baptistical","baptismal"],"phonetic":"/bæpˈtɪstɪk/","extraExplanation":["“Baptistic”在现代英语中相对少见，很多情况下更常用“Baptist”（如：Baptist church, Baptist tradition）。当写作或学术语境中需要强调“具有浸信会色彩/倾向”而不一定是正式隶属某个浸信会宗派时，才更可能用“Baptistic”。","词根来自“baptize”（施洗/施浸）。浸信会传统通常强调信徒在有个人信仰告白之后受洗（常见为浸入式），因此“Baptistic”有时也会带出“强调信徒受洗”的含义。"]}
{"word":"baptistic","summary":{"en":"Baptistic means “related to Baptists/Baptist churches” or “related to baptism in a Baptist way.”","zh":"baptistic 指“与浸信宗/浸信会有关的”，也可指“与浸信宗所强调的施洗方式有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Baptist church or to Baptists (a Protestant Christian group known especially for teaching that baptism should be for believers).","zh":"与浸信会或浸信宗（新教基督教一支，尤强调“信徒受洗”）有关的；浸信宗的。"},"examples":[{"en":"She attended a Baptistic church while living in the South.","zh":"她住在南方时参加过一间浸信宗教会。"},{"en":"The school has a Baptistic background but welcomes students of many faiths.","zh":"这所学校有浸信宗背景，但欢迎不同信仰的学生。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to baptism or the practice of baptizing, especially in the manner emphasized by Baptists.","zh":"与洗礼或施洗的做法有关的（尤指浸信宗所强调的方式）。"},"examples":[{"en":"Their discussion focused on Baptistic views of baptism and church membership.","zh":"他们的讨论聚焦在浸信宗对洗礼与教会成员资格的看法上。"}]}],"synonyms":["Baptist","Baptistic (rare)","baptismal (broader)"],"phonetic":"/bæpˈtɪstɪk/","extraExplanation":["“Baptistic”在英语中相对少见，更常见的是“Baptist”（名词/形容词）来指浸信会或浸信宗的人与事物；“Baptistic”通常用于更学术或强调“浸信宗特色/立场”的语境。","浸信宗常被提到的特点之一是“believer’s baptism”（信徒受洗），通常指人在有信仰告白之后再受洗（而不是婴儿洗礼）。"]}
{"word":"Baptistical","summary":{"en":"“Baptistical” means “related to baptism,” but it’s rare; “baptismal” is more common.","zh":"“baptistical”意为“与洗礼有关的”，但较少用；更常见的是“baptismal”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to baptism (the Christian religious ceremony of washing with water as a sign of joining the faith).","zh":"与“洗礼”有关的；洗礼的（指基督教中用水洗涤、象征加入信仰的仪式）。"},"examples":[{"en":"The church prepared a baptistical service for the new members.","zh":"教会为新成员准备了一场洗礼仪式。"},{"en":"In the novel, the baptistical scene marks the character’s new beginning.","zh":"在小说中，洗礼的场景象征着人物的新开始。"}]}],"synonyms":["baptismal","baptizing (rare)"],"phonetic":"/bæpˈtɪstɪkəl/","extraExplanation":["“baptistical”在现代英语中比较少见，更常用的是“baptismal”（如：baptismal font 洗礼盆、baptismal vows 洗礼誓言）。如果你想写得自然、常见，通常优先选“baptismal”。","词根来自“baptize（施洗/洗礼）”，常见于宗教语境、文学描写或较正式的写作中。"]}
{"word":"Baptistown","summary":{"en":"“Baptistown” is a proper noun used as a place name for certain towns/communities.","zh":"“Baptistown”是地名（专有名词），指一些城镇或社区的名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun): the name of a town or community called “Baptistown,” found in some English-speaking regions (especially the United States).","zh":"地名（专有名词）：“Baptistown”是一些地区（尤其美国）城镇或社区的名称。"},"examples":[{"en":"We drove through Baptistown on our way to the state park.","zh":"我们去州立公园的路上开车经过了Baptistown。"},{"en":"She grew up in Baptistown, New Jersey.","zh":"她在新泽西州的Baptistown长大。"}]}],"synonyms":["(no direct synonym; it is a specific place name)"],"phonetic":"/ˈbæp.tɪs.taʊn/","extraExplanation":["“Baptistown”通常由“Baptist（浸信会/浸礼宗）+ town（城镇）”构成，属于常见的英语地名构词方式，往往暗示早期定居者或当地历史与浸信会教派有关。","作为地名时，拼写通常固定为一个词并大写；发音在不同地区可能略有差异。"]}
{"word":"baptistries","summary":{"en":"“Baptistries” means places in or near churches where baptisms are carried out.","zh":"“baptistries”指教堂内或附近专门举行洗礼的场所（洗礼堂/洗礼间）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of baptistry: a special part of a church (or a separate small building) where baptisms are performed, often containing a baptismal font or pool.","zh":"baptistry 的复数：教堂中（或独立的小建筑里）专门用来举行洗礼的地方，通常有洗礼池或洗礼盆。"},"examples":[{"en":"The tourists admired the mosaics in the ancient baptistries.","zh":"游客们欣赏了那些古老洗礼堂里的马赛克壁画。"},{"en":"In some older churches, baptistries are separate buildings near the entrance.","zh":"在一些较古老的教堂里，洗礼堂是靠近入口的独立建筑。"},{"en":"The guide explained why baptistries were often built with an octagonal shape.","zh":"导游解释了为什么洗礼堂常常建成八角形。"}]}],"synonyms":["baptismal chapels","baptismal rooms","baptism places"],"phonetic":"/ˈbæp.tɪ.striz/","extraExplanation":["“baptistry”来自“baptize（施洗）”，与基督教的“洗礼”传统有关。早期基督教中，洗礼有时会在较大的水池中进行，因此一些洗礼堂会像小型礼拜堂一样独立建造。","在艺术与建筑史里，著名的洗礼堂常以雕刻、马赛克装饰闻名，例如意大利一些城市的洗礼堂常被视为重要地标。"]}
{"word":"baptistry","summary":{"en":"A baptistry is a place—often in or near a church—where baptisms are performed.","zh":"baptistry 指（教堂内或附近的）举行洗礼的地方/洗礼堂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small building or a special area in a church used for baptism (the Christian ceremony of using water to welcome someone into the faith).","zh":"（教堂内或附近的）洗礼堂；施洗处（用于举行基督教“洗礼”的专门建筑或区域）。"},"examples":[{"en":"The old cathedral has a separate baptistry next to the main church.","zh":"那座古老的大教堂在主堂旁边有一座独立的洗礼堂。"},{"en":"Visitors can see the baptistry’s baptismal font, where many local children were baptized.","zh":"游客可以看到洗礼堂里的洗礼池，许多当地孩子曾在这里受洗。"}]}],"synonyms":["baptistery","baptismal chapel"],"phonetic":"/ˈbæp.tə.stɹi/","extraExplanation":["“baptistry”来自“baptize”（施洗、洗礼）。在西方教堂建筑中，洗礼堂常见于教堂入口附近，象征“进入信仰”。有些历史名胜的洗礼堂本身就是独立建筑（例如意大利佛罗伦萨的圣若望洗礼堂）。","常见相关词：baptism（洗礼）、baptize（施洗/施洗礼）、baptismal font（洗礼池/洗礼盆）、baptistery（baptistry 的另一种拼写，含义相同）。"]}
{"word":"baptists","summary":{"en":"Baptists are people who belong to Baptist churches, a Protestant Christian group that emphasizes believer’s baptism (often by immersion).","zh":"Baptists 指浸信会（浸礼宗）信徒；该新教宗派强调信徒自愿受洗，常以浸水方式施洗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"members of a Christian Protestant group (the Baptist churches) that teaches baptism should be done for people who personally choose faith, often by full immersion in water.","zh":"浸信会（或浸礼宗）的信徒；一种新教基督宗派，强调应在个人自愿信仰后受洗，且常以全身浸入水中的方式施洗。"},"examples":[{"en":"Many Baptists practice baptism by immersion.","zh":"许多浸信会信徒实行全身浸水的施洗方式。"},{"en":"In the U.S., Baptists are one of the largest Protestant groups.","zh":"在美国，浸信会是规模最大的几个新教群体之一。"},{"en":"The church down the street is Baptist, so many of my neighbors are Baptists.","zh":"街对面的教会是浸信会的，所以我的许多邻居是浸信会信徒。"}]}],"synonyms":["Baptist (singular)","Baptist Christians","members of the Baptist church"],"phonetic":"/ˈbæptɪsts/","extraExplanation":["“Baptists”是复数形式；单数是“a Baptist”（一位浸信会信徒）。作为形容词更常用单数形式“Baptist”，如：a Baptist church（浸信会教会）、Baptist tradition（浸信会传统）。","“Baptist”这个名称来自“baptize”（施洗/洗礼）。浸信会在英语文化中常与“成人或信徒自愿受洗”“地方教会自治”等观念相关。不同国家与地区的浸信会群体在礼拜风格、神学立场上可能有差异。"]}
{"word":"baptizable","summary":{"en":"“Baptizable” means able or eligible to receive baptism.","zh":"“baptizable”意为“可受洗的／有资格接受洗礼的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able or eligible to be baptized (to receive the Christian rite of baptism).","zh":"可受洗的；有资格受洗的（指可接受基督教“洗礼/受洗”仪式）。"},"examples":[{"en":"In some churches, only adults who can express their faith are considered baptizable.","zh":"在一些教会里，只有能表达自己信仰的成年人才被认为是可受洗的。"},{"en":"The family asked when their baby would be baptizable according to local customs.","zh":"这家人询问按照当地习俗，他们的宝宝何时才算可受洗。"}]}],"synonyms":["eligible for baptism","able to be baptized","fit for baptism"],"phonetic":"/bæpˈtaɪzəbəl/","extraExplanation":["“baptizable”主要用于宗教语境，尤其在基督教传统中讨论“谁可以受洗、何时受洗、受洗条件”等问题。不同宗派对婴儿洗礼、成人洗礼、受洗资格与程序可能有不同理解，因此该词常出现在教会规章、神学讨论或正式写作中。"]}
{"word":"baptize","summary":{"en":"Baptize most commonly means to perform a Christian water ceremony of initiation; it can also mean to name something or to put someone through a tough first experience (“baptize by fire”).","zh":"baptize 常指（基督教）施洗；也可指（正式）命名，或比喻让某人经历艰难的首次考验（“火的洗礼”）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To perform a Christian religious ceremony in which someone is washed with water (by dipping in water or by pouring/sprinkling) as a sign of joining the faith.","zh":"（基督教）为某人施洗：用浸入水中或洒/倒水的方式进行宗教仪式，象征加入信仰。"},"examples":[{"en":"They plan to baptize their baby next month at the church.","zh":"他们计划下个月在教堂为宝宝施洗。"},{"en":"He was baptized as an adult after studying Christianity.","zh":"他在学习基督教后，成年时接受了洗礼。"}]},{"partOfSpeech":"vt.","definition":{"en":"To officially give someone a name; to name something (often in a formal or symbolic way).","zh":"（正式或象征性地）给……命名；为……取名。"},"examples":[{"en":"The explorers baptized the river “St. Mary’s” on their maps.","zh":"探险者在地图上把那条河命名为“圣玛丽河”。"},{"en":"Critics baptized the movement with a new label that quickly spread.","zh":"评论家给这场运动贴上了一个新标签，并迅速传播开来。"}]},{"partOfSpeech":"vt.","definition":{"en":"To introduce someone to a difficult or new experience, often suddenly (e.g., “baptize by fire”).","zh":"（比喻）让某人首次经历艰难或全新的体验，常带有“突然、严酷”的意味（如“baptize by fire”）。"},"examples":[{"en":"The first week on the job baptized her by fire.","zh":"入职第一周就让她经历了“火的洗礼”。"},{"en":"The young team was baptized by fire in the championship game.","zh":"这支年轻队伍在冠军赛中经历了严峻考验。"}]}],"synonyms":["christen","initiate","name"],"phonetic":"/bæpˈtaɪz/","extraExplanation":["“baptize”源自希腊语，核心意思是“浸入（水中）”。在不同教派中，施洗方式可能不同：有的强调全身浸水（immersion），有的使用洒水或倒水（sprinkling/pouring）。","常见搭配：be baptized（接受洗礼），baptize someone into + religion/church（使某人加入某宗教/教会），a baptism（洗礼；也可指“艰难的初体验”，如 a baptism of fire）。","文学/文化中，“baptism”常被用作象征：通过痛苦、挑战或转变而“重生/更新”。比喻用法不一定带宗教含义，但常保留“重要转折点”的感觉。"]}
{"word":"baptized","summary":{"en":"“Baptized” usually means someone has received Christian baptism; it can also mean being tested by a difficult first experience, or being officially named/introduced (e.g., a ship).","zh":"“baptized”通常指（人）受洗；也可比喻第一次经历严峻考验，或指（如船只等）被正式命名/启动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person) Having received baptism in a Christian ceremony (usually with water) as a sign of joining the faith.","zh":"（指人）受洗的；接受基督教洗礼的（通常用水作为加入信仰的象征）。"},"examples":[{"en":"She was baptized as a baby.","zh":"她在婴儿时期受了洗。"},{"en":"He wasn’t baptized, but he attended church with his family.","zh":"他没有受洗，但会和家人一起去教堂。"}]},{"partOfSpeech":"adj.","definition":{"en":"Introduced to something new or difficult for the first time; tested by a first experience (figurative use).","zh":"（比喻）第一次接触并经历某事（通常是困难或严肃的事）；经受“初体验”的考验。"},"examples":[{"en":"He was baptized by fire on his first day at the job.","zh":"他上班第一天就经历了“火的洗礼”。"},{"en":"The new team was baptized by a tough schedule.","zh":"新团队被高强度的日程“洗礼”了一番。"}]},{"partOfSpeech":"adj.","definition":{"en":"Named or officially introduced (often used for a ship, project, or event; similar to “christened”).","zh":"（常指船只、项目或活动）被命名的；被正式启动/介绍的（类似 christened）。"},"examples":[{"en":"The ship was baptized with a bottle of champagne.","zh":"那艘船用一瓶香槟举行了命名仪式。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense / past participle of “baptize.”","zh":"baptize 的过去式 / 过去分词。"},"examples":[{"en":"The priest baptized the child last Sunday.","zh":"上周日，牧师给那个孩子施了洗礼。"}]}],"synonyms":["christened","initiated","confirmed (religious)","welcomed into the faith"],"phonetic":"/ˈbæpˌtaɪzd/","extraExplanation":["“baptized”最常见与基督教相关：baptism（洗礼）在不同教派做法不同，有的会给婴儿施洗，有的强调成年人在有信仰选择后再受洗。","比喻用法里常见固定表达“be baptized by fire”（经历严峻考验、接受磨炼），语气比“have a hard first day”更文学化、更强调强度。","用于船只命名时在英语文化里很常见，常与“christen”近义；有时会有象征性动作（如用香槟在船体上敲碎）。"]}
{"word":"baptizee","summary":{"en":"A baptizee is the person receiving baptism.","zh":"baptizee 指“正在接受洗礼或刚受洗的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is being baptized or has just been baptized","zh":"受洗者；正在接受洗礼或刚受洗的人"},"examples":[{"en":"The baptizee wore a simple white robe during the ceremony.","zh":"受洗者在仪式中穿着一件朴素的白袍。"},{"en":"Family members gathered to support the baptizee at the church.","zh":"家人聚在教堂里支持受洗者。"}]}],"synonyms":["baptism candidate","candidate for baptism","the person being baptized"],"phonetic":"/ˌbæp.təˈzi/","extraExplanation":["“baptizee”较为正式、偏宗教语境，日常英语里更常说“the person being baptized”或在某些教会传统里说“candidate (for baptism)”（受洗候选人）。","词尾“-ee”常表示“动作的承受者/接受者”（例如：employee 雇员、trainee 受训者、interviewee 受访者），因此 baptizee 就是“接受洗礼的人”。"]}
{"word":"baptizement","summary":{"en":"Baptizement means the ceremony/act of baptism, but it’s a rare, old-fashioned term.","zh":"baptizement 指“洗礼/施洗”的仪式或行为，但属于较少用、偏旧式的词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or ceremony of baptizing someone; baptism (a rare or old-fashioned word)","zh":"为某人施洗的行为或仪式；洗礼（较少用或较旧式的说法）"},"examples":[{"en":"The church recorded the child’s baptizement in its official register.","zh":"教会在正式名册上记录了这个孩子的受洗（施洗）信息。"},{"en":"In the novel, her baptizement marks a new beginning in her life.","zh":"在小说中，她的受洗象征着人生的新开始。"}]}],"synonyms":["baptism","christening"],"phonetic":"/bæpˈtaɪzmənt/","extraExplanation":["“baptizement”在现代英语中较少见，日常更常用“baptism”。你可能会在较旧的宗教文本、历史材料或文学作品里看到“baptizement”。","词根来自“baptize”（施洗），与希腊语中“浸入（以水洗礼）”的含义有关；因此它常带有基督教语境。"]}
{"word":"baptizer","summary":{"en":"A baptizer is a person who performs baptism; it can also refer to John the Baptist (John the Baptizer).","zh":"baptizer 指施行洗礼的人；也可指圣经中的施洗者约翰（John the Baptist）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who baptizes someone (especially in a Christian ceremony)","zh":"为他人施行洗礼的人（尤指基督教仪式中）"},"examples":[{"en":"The baptizer gently poured water over the infant’s head during the ceremony.","zh":"施洗者在仪式中轻轻把水倒在婴儿的头上。"},{"en":"In many churches, a pastor or priest acts as the baptizer.","zh":"在许多教会里，牧师或神父担任施洗者。"}]},{"partOfSpeech":"n.","definition":{"en":"(often capitalized) John the Baptist, the biblical figure known for baptizing people in the Jordan River","zh":"（常大写）“施洗者”约翰：圣经人物，以在约旦河为人施洗而闻名"},"examples":[{"en":"In the Bible, the Baptizer calls people to repent and be baptized.","zh":"在《圣经》中，施洗者呼吁人们悔改并接受洗礼。"},{"en":"Some older texts refer to John as “John the Baptizer.”","zh":"一些较早的文本把约翰称为“John the Baptizer（施洗者约翰）”。"}]}],"synonyms":["baptist (person who baptizes)","officiant","minister","pastor","priest"],"phonetic":"/ˈbæpˌtaɪzər/","extraExplanation":["“baptizer”来自动词 baptize（施洗、洗礼）+ 表示“做某事的人”的 -er。现代英语中更常见的说法是 “the one who baptizes”（施洗的人）或在宗教语境里直接用 “pastor/priest/minister”（牧师/神父/传道人）。","在宗教与文化语境中，“baptize”不仅指“用水的仪式”，也常象征“开始新的信仰生活/新的身份”。不同教派对洗礼的方式（洒水、浸水）与施行者资格可能不同。"]}
{"word":"baptizers","summary":{"en":"“Baptizers” means people who perform baptisms for others.","zh":"“baptizers”指为他人施行洗礼的人（施洗者），是“baptizer”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who baptize others (perform the religious rite of baptism)","zh":"为他人施洗的人；施洗者（执行“洗礼”这一宗教仪式的人）"},"examples":[{"en":"In many churches, baptizers are usually pastors or priests.","zh":"在许多教会里，施洗者通常是牧师或神父。"},{"en":"The new members thanked the baptizers after the ceremony.","zh":"仪式结束后，新成员向施洗者表示感谢。"}]}],"synonyms":["baptizer","minister (in this context)","priest (in this context)"],"phonetic":"/ˈbæpˌtaɪzɚ/","extraExplanation":["“baptizers”是复数形式，单数是“baptizer”。常见相关词：\n- baptism：洗礼（名词）\n- to baptize：施洗、施行洗礼（动词）\n不同基督教传统中，施洗的方式可能不同（如洒水、浸水），但核心意义通常与加入信仰群体、象征更新有关。"]}
{"word":"baptizes","summary":{"en":"“Baptizes” means “performs baptism on someone,” and it can also mean “officially begins/launches something” or “gives a name” in a formal style.","zh":"“baptizes”意为“为……施洗（受洗）”；也可比喻“为……揭开序幕/正式开启”，或在较正式语境中表示“给……命名”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(In Christianity) to perform a religious ceremony using water to welcome someone into the church; to baptize someone.","zh":"（基督教）为某人施洗（用水进行宗教仪式），使其加入教会。"},"examples":[{"en":"The priest baptizes the baby in the church on Sunday.","zh":"牧师/神父在星期天的教堂里为婴儿施洗。"},{"en":"In this tradition, the minister baptizes new members with water.","zh":"在这一传统中，牧师用水为新成员施洗。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Figurative) to officially start or begin something in a special way; to ‘launch’ it.","zh":"（比喻）以某种特别的方式正式开始；为……揭开序幕。"},"examples":[{"en":"The team baptizes the new stadium with a big opening game.","zh":"球队用一场盛大的揭幕赛为新球场揭开序幕。"},{"en":"The town baptizes the festival season with fireworks.","zh":"小镇用烟花为节庆季拉开序幕。"}]},{"partOfSpeech":"vt.","definition":{"en":"To give a name to someone or something (often used in a formal or literary style).","zh":"（较正式/文学用法）给……命名。"},"examples":[{"en":"The writer baptizes the hero with a memorable name.","zh":"作家给主人公取了一个令人难忘的名字。"},{"en":"The sailors baptizes the ship before its first voyage.","zh":"水手们在首航前为船举行命名/祝福仪式。"}]}],"synonyms":["christen","initiate","name","baptize (base form)"],"phonetic":"/bəpˈtaɪz/","extraExplanation":["“baptizes”是动词“baptize”的第三人称单数现在时（he/she/it baptizes）。对应的常见形式还有：baptize（原形），baptized（过去式/过去分词），baptizing（现在分词）。","“baptize/施洗”在基督教文化中很重要：不同宗派做法不同，有的会给婴儿施洗，有的强调成年人在理解信仰后受洗；方式也可能是洒水、浇水或全身浸入水中（immersion）。","比喻用法里，“baptize”常带有“以……为开始标志/用某事开启”的感觉，语气比较文学或修辞；日常口语中更常用 start / launch / inaugurate。"]}
{"word":"baptizing","summary":{"en":"Baptizing means performing baptism (a water-based Christian rite) or, figuratively, giving something its first official start or introduction.","zh":"baptizing 指“施行洗礼（基督教仪式）”，也可引申为“让某物首次正式启用/亮相”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"the act of performing baptism (a Christian religious ceremony), usually by using water to officially welcome someone into the church","zh":"施行洗礼（基督教宗教仪式）的行为，通常用水为人举行入教仪式"},"examples":[{"en":"The priest is baptizing the baby this Sunday.","zh":"神父这周日要为婴儿施行洗礼。"},{"en":"They were baptizing new members in the river.","zh":"他们在河里为新成员施行洗礼。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) giving something its first official use, name, or introduction; initiating something in a new role","zh":"（比喻）使某物首次正式启用/定名/亮相；让某事进入新阶段"},"examples":[{"en":"The coach is baptizing the rookie by putting her in the starting lineup.","zh":"教练让新人首发，算是让她正式“出道”。"},{"en":"The team is baptizing the new stadium with its first game tonight.","zh":"球队今晚用第一场比赛为新球场“揭幕”。"}]}],"synonyms":["baptizing (religious sense): christening","initiating","inaugurating","launching"],"phonetic":"/bæpˈtaɪzɪŋ/","extraExplanation":["“baptizing”来自动词“baptize”的现在分词/动名词形式。宗教语境中，baptize 指“施洗、施行洗礼”；不同教派做法可能不同（如洒水、浸水），但核心含义都是“通过洗礼加入或确认信仰共同体”。","比喻用法里，baptize 常带有“第一次、正式开始、带点仪式感”的感觉，例如“baptize a ship”（为船举行命名/下水仪式）。"]}
{"word":"Baptlsta","summary":{"en":"Baptista is a proper name meaning “Baptist,” and it’s also a Shakespeare character’s name (Baptista Minola).","zh":"Baptista 是专有名词，含义相当于“施洗者/与洗礼相关的人”，也可指莎士比亚《驯悍记》中的角色 Baptista Minola。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Baptista (often misspelled as “Baptlsta”) is a proper name—usually a surname or given name—especially in Portuguese or Italian contexts, meaning “Baptist” (a person who baptizes, or associated with baptism).","zh":"Baptista（常被误写为“Baptlsta”）是专有名词，通常作姓氏或名字，在葡萄牙语或意大利语语境中较常见，含义相当于“施洗者/与洗礼有关的人（Baptist）”。"},"examples":[{"en":"Dr. Baptista will speak at the conference tomorrow.","zh":"Baptista 博士明天将在会议上发言。"},{"en":"Her last name is Baptista, and her family is from Portugal.","zh":"她的姓是 Baptista，家人来自葡萄牙。"}]},{"partOfSpeech":"other","definition":{"en":"In literature, Baptista is the name of Baptista Minola, a character in Shakespeare’s *The Taming of the Shrew* (the father of Katherine and Bianca).","zh":"在文学作品中，Baptista 指莎士比亚《驯悍记》里的角色 Baptista Minola（凯瑟琳与比安卡的父亲）。"},"examples":[{"en":"In *The Taming of the Shrew*, Baptista controls who may marry his daughters.","zh":"在《驯悍记》中，Baptista 掌控女儿们的婚事安排。"}]}],"synonyms":["Baptist","John the Baptist"],"phonetic":"/bæpˈtiːstə/","extraExplanation":["“Baptista”源自拉丁语 *baptista*，意为“施洗者”。因此它常与“John the Baptist（施洗约翰）”的称呼在意义上相关。","你输入的“Baptlsta”很可能是把字母 **i** 误写成了小写 **l**（在某些字体里很像）。如果你想查的是别的词（比如某个人名/地名），告诉我上下文我可以再确认。"]}
{"word":"Baptornis","summary":{"en":"Baptornis is an extinct genus of Cretaceous diving birds known from North American fossils.","zh":"Baptornis 指白垩纪晚期的一属已灭绝潜水鸟类，化石主要来自北美。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of extinct, loon-like diving birds from the Late Cretaceous period, known from fossils in North America.","zh":"（古生物）浸鸟属：已灭绝的一属潜水鸟类，外形有点像䴙䴘/潜鸟，生活在白垩纪晚期，化石主要发现于北美。"},"examples":[{"en":"Baptornis is often discussed alongside other Cretaceous diving birds in museum exhibits.","zh":"在博物馆展览中，浸鸟属（Baptornis）常与其他白垩纪潜水鸟类一起被介绍。"},{"en":"Scientists study Baptornis fossils to learn how early birds adapted to swimming and diving.","zh":"科学家研究浸鸟属的化石，以了解早期鸟类如何适应游泳与潜水。"}]}],"synonyms":["hesperornithiform (diving bird)"],"phonetic":"/bæpˈtɔrnɪs/","extraExplanation":["词源提示：名称来自希腊语词根 *bapt-*（“浸入、蘸入”）与 *ornis*（“鸟”），直译可理解为“会潜水的鸟”。","背景补充：浸鸟属通常被归入与“海鸟类/潜水鸟类”相关的一支（常与 Hesperornis 等白垩纪潜水鸟一起讨论）。它们以水中推进为主，常被用来说明鸟类演化中“适应水生生活”的多样性。"]}
{"word":"baptornis","summary":{"en":"Baptornis is an extinct genus of flightless, diving seabirds from the Late Cretaceous.","zh":"Baptornis 是一种已灭绝的白垩纪晚期不会飞、擅长潜水的海鸟属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct genus of large, flightless, diving seabirds from the Late Cretaceous period, related to Hesperornis, known from fossils in North America.","zh":"一种已灭绝的鸟类属（白垩纪晚期），体型较大、不会飞、擅长潜水的海鸟，与“鱼鸟属（Hesperornis）”近缘，化石主要发现于北美。"},"examples":[{"en":"Baptornis was a flightless diver that likely used its legs to propel itself underwater.","zh":"Baptornis 是一种不会飞的潜水鸟，可能主要靠双腿在水下推进。"},{"en":"Fossils of Baptornis help scientists understand how early seabirds adapted to life in the ocean.","zh":"Baptornis 的化石帮助科学家了解早期海鸟如何适应海洋生活。"}]}],"synonyms":["hesperornithine (group name)","Hesperornis (related genus)"],"phonetic":"/bæpˈtɔrnɪs/","extraExplanation":["“Baptornis”常见于古生物学与博物馆展览文字中，属于“鱼鸟类（hesperornithines）”的一员：它们多为擅长游泳、不会飞的海鸟，生活在白垩纪的海域环境。","词源上常被解释为源自希腊语元素，含有“潜水/下沉”的意涵（bapto-）加上“鸟”（-ornis），用来突出其潜水习性。"]}

