{"word":"BAU","summary":{"en":"BAU most commonly means “business as usual” (things continue normally). In crime-related contexts, it can mean the FBI “Behavioral Analysis Unit.”","zh":"BAU最常见指“照常进行/一切如常（business as usual）”；在犯罪题材语境中也可指FBI“行为分析组（Behavioral Analysis Unit）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"abbreviation for “business as usual,” meaning things continue normally, without major change (often after a disruption).","zh":"“business as usual”的缩写，指“照常进行/一切如常”，常用于说明在某种干扰之后仍恢复或保持正常运作。"},"examples":[{"en":"After the brief power outage, it was BAU within an hour.","zh":"短暂停电后，不到一小时就恢复照常运作（BAU）。"},{"en":"The company said it’s BAU despite the leadership change.","zh":"公司表示尽管领导层更换，业务仍照常（BAU）。"}]},{"partOfSpeech":"other","definition":{"en":"abbreviation for “Behavioral Analysis Unit,” a specialized FBI unit often mentioned in crime news and TV dramas (e.g., profiling).","zh":"“Behavioral Analysis Unit（行为分析组）”的缩写，指FBI的一个专门单位，常出现在犯罪新闻或美剧中（与犯罪心理分析/画像相关）。"},"examples":[{"en":"She works with the FBI BAU on serial crime cases.","zh":"她与FBI行为分析组（BAU）合作处理连环案件。"},{"en":"The show features agents from the BAU.","zh":"这部剧的主角是BAU探员。"}]}],"synonyms":["business as usual","normal operations","as usual"],"phonetic":"/ˌbi eɪ ˈju/","extraExplanation":["在职场邮件、Slack、社交媒体里，BAU最常见的意思是“business as usual”。它通常带一点“别担心/没大变化/按计划继续”的语气。","发音通常是逐个字母念（B-A-U），因此在口语里也可能直接说“business as usual”来避免别人没听懂。","如果在犯罪题材语境（新闻、纪录片、美剧）中看到BAU，常指FBI的Behavioral Analysis Unit；具体含义要看上下文。"]}
{"word":"baubee","summary":{"en":"“Baubee” is a rare spelling of the Scottish word “bawbee,” meaning a small coin or a tiny amount of money.","zh":"“baubee”是苏格兰词“bawbee”的少见拼写，指小面额硬币或很少的钱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scotland, historical) A small Scottish coin (often a sixpence), or by extension a very small amount of money.","zh":"（苏格兰，历史用语）一种小面额的苏格兰硬币（常指六便士），也可引申为“一点点钱”。"},"examples":[{"en":"He didn’t have a bawbee to his name.","zh":"他身无分文。"},{"en":"I wouldn’t pay a bawbee for that broken watch.","zh":"那块坏表我一文都不想花。"}]}],"synonyms":["bawbee","sixpence","small change","a pittance"],"phonetic":"/ˈbɔːbi/","extraExplanation":["“baubee”多被视为苏格兰方言词 **bawbee** 的一种拼写变体（也常写作 *bawbee*）。在现代英语里很少用，更多出现在苏格兰文学、民谣或历史语境中。","在苏格兰诗歌与民间用语里，它常带有“零钱、微不足道的钱”的语气色彩；例如罗伯特·彭斯（Robert Burns）的作品和苏格兰民谣中会见到类似用法。"]}
{"word":"baubees","summary":{"en":"“Baubees” is the plural of “baubee,” a very small-value old Scottish coin, and it can also mean a trivial amount of money.","zh":"“Baubees”是“baubee”的复数，原指面值很小的旧苏格兰硬币，也可引申为“一点点钱/不值钱的东西”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scots, historical) A small Scottish coin of low value (equal to six pence Scots); plural: baubees.","zh":"（苏格兰方言，历史）一种面值很小的苏格兰硬币（约合苏格兰币六便士）；复数：baubees。"},"examples":[{"en":"He didn’t have two baubees to rub together.","zh":"他穷得叮当响（字面：连两枚小硬币都凑不出来）。"},{"en":"In old Scots stories, a baubee was pocket change—almost nothing.","zh":"在一些苏格兰老故事里，baubee 就是零零钱，几乎不值什么。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, informal) Something of very little value; a trivial amount of money.","zh":"（引申，非正式）几乎不值钱的东西；一点点钱。"},"examples":[{"en":"The old phone sold for a few baubees at the market.","zh":"那部旧手机在市场上只卖了几个小钱。"},{"en":"Don’t do all that work for a handful of baubees.","zh":"别为了那么点小钱干那么多活。"}]}],"synonyms":["small change","pennies","coppers","a pittance","next to nothing"],"phonetic":"ˈbɔbi","extraExplanation":["“Baubee”是苏格兰英语（Scots）里的词，常出现在老式文学、民谣或带地方色彩的对白中。你可能会在罗伯特·彭斯（Robert Burns）的作品或苏格兰题材写作里看到它。","常见固定说法：not to have two baubees to rub together，意思是“穷得很”。"]}
{"word":"bauble","summary":{"en":"A bauble is a small showy ornament or trinket, often used for Christmas tree decorations.","zh":"bauble 指小而华丽但常较廉价的小饰物/小玩意儿，也常指圣诞树上的装饰挂饰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, cheap, showy ornament or piece of jewelry; a trinket.","zh":"小而廉价、华而不实的装饰品或首饰；小饰物。"},"examples":[{"en":"She bought a few colorful baubles at the street market.","zh":"她在街市买了几个颜色鲜艳的小饰物。"},{"en":"The box was full of old baubles from past holidays.","zh":"盒子里装满了过去节日留下的小装饰品。"},{"en":"He prefers meaningful gifts, not just shiny baubles.","zh":"他更喜欢有意义的礼物，而不只是闪亮的小玩意儿。"}]},{"partOfSpeech":"n.","definition":{"en":"A decorative ball or ornament, especially one hung on a Christmas tree.","zh":"（尤指挂在圣诞树上的）装饰球；圣诞挂饰。"},"examples":[{"en":"We hung red and gold baubles on the Christmas tree.","zh":"我们把红色和金色的圣诞挂饰挂在圣诞树上。"},{"en":"One glass bauble fell and shattered on the floor.","zh":"一个玻璃挂饰掉下来，在地上摔碎了。"}]}],"synonyms":["trinket","ornament","knickknack","toy (informal)"],"phonetic":"/ˈbɔbəl/","extraExplanation":["“Bauble”常带一点评价意味：强调“好看但价值不高/不够重要”。如果你想中性表达“装饰品”，也可以用“ornament”。","在文学里，“bauble”有时象征虚荣或表面的光彩。莎士比亚《李尔王》中曾用“bauble”指弄臣的笏（带装饰的小杖），暗含对权力与体面的讽刺。"]}
{"word":"baublery","summary":{"en":"Baublery means cheap, showy decorative trinkets or jewelry.","zh":"Baublery 指便宜、浮夸、华而不实的装饰小物或首饰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"cheap, showy ornaments or jewelry; trinkets valued more for decoration than real worth","zh":"华而不实的小饰品（常指便宜、浮夸的装饰物或珠宝）；小玩意儿"},"examples":[{"en":"The market stalls were filled with baublery—sparkly bracelets and plastic crowns.","zh":"集市摊位上摆满了华而不实的小饰品——亮闪闪的手链和塑料王冠。"},{"en":"She cleared the drawer of old baublery she never wore anymore.","zh":"她把抽屉里那些再也不戴的旧小饰品都清理掉了。"},{"en":"He preferred simple clothes, not flashy baublery.","zh":"他更喜欢朴素的穿着，不喜欢花哨的小饰品。"}]}],"synonyms":["trinkets","baubles","cheap jewelry","knickknacks","tinsel","gaudiness"],"phonetic":"/ˈbɔbəlri/","extraExplanation":["“baublery” 是由 “bauble（小装饰品）+ -ry（表示一类东西的后缀）”构成的名词，语气常带一点贬义：强调“看起来很闪、但不值钱/不够有品味”。","拼写上也常见 “baubly” 或 “baublery/baublery” 这类变体；更常用的核心词是 “bauble”。"]}
{"word":"baubles","summary":{"en":"Baubles are small, shiny decorations or trinkets, often valued more for appearance than worth.","zh":"Baubles 指小而闪亮的装饰品或小首饰，通常好看但价值不高。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small, showy, often inexpensive decorations or jewelry; trinkets.","zh":"小而花哨、常常不值钱的装饰品或首饰；小玩意儿。"},"examples":[{"en":"The shop window was filled with shiny baubles and colorful ribbons.","zh":"橱窗里摆满了闪亮的小饰品和五颜六色的丝带。"},{"en":"She wore a few baubles on her wrist, but nothing too expensive.","zh":"她手腕上戴了几件小首饰，但都不贵。"},{"en":"The kids loved hanging baubles on the Christmas tree.","zh":"孩子们很喜欢把小挂饰挂在圣诞树上。"}]}],"synonyms":["trinkets","ornaments","knickknacks","tchotchkes"],"phonetic":"/ˈbɔbəlz/","extraExplanation":["“Bauble”常带一点评价意味：强调“好看但不太有价值/有点俗气”。所以在文学或评论里，也可用来暗示“表面光鲜、内里空洞”的东西。","常见搭配：Christmas tree baubles（圣诞树挂饰）、shiny/cheap/gaudy baubles（闪亮的/廉价的/俗艳的小饰品）。"]}
{"word":"baubling","summary":{"en":"“Baubling” is not a standard word; it’s most likely “babbling”: unclear or nonstop chatter, or the soft sound of a stream.","zh":"“baubling” 不是标准单词；多半是 “babbling”：指含糊或不停的喋喋不休，也可指小溪的潺潺声。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not standard) Likely a misspelling of “babbling.”","zh":"（非标准拼写）很可能是 “babbling” 的拼写错误。"},"examples":[{"en":"I couldn’t find “baubling” in a dictionary—did you mean “babbling”?","zh":"我在词典里找不到 “baubling”——你想写的是 “babbling” 吗？"}]},{"partOfSpeech":"adj.","definition":{"en":"Talking in a rapid, silly, or unclear way; continuous chatter that is hard to understand or not very meaningful.","zh":"（说话）又快又含糊/没重点地喋喋不休；让人听不太懂或不太有意义的闲聊。"},"examples":[{"en":"He kept babbling about random things because he was nervous.","zh":"他因为紧张，一直胡乱地说个不停。"},{"en":"Stop babbling and tell me what happened.","zh":"别胡说八道了，告诉我发生了什么。"}]},{"partOfSpeech":"n.","definition":{"en":"The sound of someone talking quickly and continuously in an unclear or childish way.","zh":"（名词）含糊、幼稚或不停的说话声；叽里咕噜的讲话声。"},"examples":[{"en":"I heard babbling from the next room.","zh":"我听到隔壁房间传来叽里咕噜的说话声。"},{"en":"The baby’s babbling made everyone smile.","zh":"宝宝咿咿呀呀的声音让大家都笑了。"}]},{"partOfSpeech":"adj.","definition":{"en":"The gentle, continuous sound of moving water (like a small stream).","zh":"（水声）小溪等流水轻柔、连续的潺潺声。"},"examples":[{"en":"We fell asleep to the babbling of the brook.","zh":"我们在小溪潺潺的水声中睡着了。"},{"en":"A babbling stream ran behind the house.","zh":"房子后面有一条潺潺流淌的小溪。"}]}],"synonyms":["chattering","rambling","prattling","jabbering","gibbering"],"phonetic":"/ˈbæbəlɪŋ/","extraExplanation":["“babbling” 来自动词 “babble”，常见两类语境：\n1）人：紧张、兴奋、喝醉、害怕时说话没条理（带点负面：没重点、听不清）。\n2）婴儿：学习说话时的咿呀学语（中性或偏可爱）。\n另外还有文学里常见的拟声用法：形容小溪“babble”（潺潺作响），给人宁静、自然的画面感。"]}
{"word":"Baubo","summary":{"en":"Baubo is a figure from Greek myth who makes Demeter laugh during her mourning, often through bawdy humor, and is linked to fertility and the Eleusinian tradition.","zh":"鲍博是希腊神话人物：在得墨忒耳哀痛时用粗俗幽默逗笑她，常与生育主题及厄琉西斯传统相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, an older woman (sometimes described as a servant) who makes the goddess Demeter laugh during her grief, often through a bold, obscene joke or gesture; associated with fertility themes and the Eleusinian tradition.","zh":"（希腊神话）鲍博：一位年长女性（有时被写作仆人/侍女），在得墨忒耳悲痛时用大胆甚至粗俗的玩笑或姿态让女神发笑；常与生育崇拜及厄琉西斯传统相关。"},"examples":[{"en":"In some versions of the myth, Baubo cheers Demeter with a shocking joke.","zh":"在某些神话版本中，鲍博用令人震惊的笑话逗得墨忒耳振作起来。"},{"en":"The name Baubo is often mentioned in discussions of the Eleusinian Mysteries.","zh":"谈到厄琉西斯秘仪时，人们常会提到“鲍博”这个名字。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A symbol or artistic motif representing bawdy humor linked to fertility or female sexuality, used in references to ancient ritual culture.","zh":"（较少见）一种象征或艺术母题：指与生育、女性性相关的粗俗幽默意象，常用于古代仪式文化的讨论中。"},"examples":[{"en":"The exhibit included a Baubo-like figure as a fertility symbol.","zh":"展览中包含一个类似“鲍博”的形象，作为生育象征。"}]}],"synonyms":["(mythology) Iambe (a related figure in some versions)"],"phonetic":"ˈbaʊboʊ","extraExplanation":["“Baubo”通常出现在得墨忒耳（Demeter）因女儿珀耳塞福涅（Persephone）失踪而悲伤的故事里。她的“逗笑”行为在一些文本中带有明显的猥亵/露骨成分，现代读者可能会觉得突兀，但在古代语境里常与“以笑驱散悲痛”“与丰产/生育相关的仪式性幽默”联系在一起。","与其相关的文化背景常被提到的是“厄琉西斯秘仪（Eleusinian Mysteries）”，这是古希腊著名的宗教仪式传统之一。不同来源对鲍博的身份与细节描写不完全一致。","相关词/概念可对照理解：Demeter（得墨忒耳）、Persephone（珀耳塞福涅）、Eleusinian Mysteries（厄琉西斯秘仪）、bawdy humor（粗俗/黄段子式幽默）、fertility cult（生育崇拜）。"]}
{"word":"baubo","summary":{"en":"Baubo is a figure from Greek mythology who makes Demeter laugh during her mourning for Persephone.","zh":"鲍波是希腊神话人物，以逗笑哀悼珀耳塞福涅的得墨忒耳而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) An old woman (or female figure) who uses bawdy jokes or exposing herself to make Demeter laugh, helping ease Demeter’s grief during the search for Persephone.","zh":"（希腊神话）一位老妇人（或女性形象），用粗俗玩笑或掀衣露体来逗得得墨忒耳发笑，从而缓解她在寻找珀耳塞福涅时的悲伤。"},"examples":[{"en":"In some versions of the myth, Baubo makes Demeter laugh so she can accept food again.","zh":"在某些版本的神话里，鲍波把得墨忒耳逗笑，使她愿意再次进食。"},{"en":"The figure of Baubo is often discussed in studies of ancient ritual and fertility symbolism.","zh":"在研究古代仪式与生殖崇拜象征时，人们常会讨论“鲍波”这一形象。"}]}],"synonyms":["Iambe","Iambê","Baubo figure (mythic)"],"phonetic":"/ˈbaʊboʊ/","extraExplanation":["“Baubo”常被视为与厄琉西斯秘仪（Eleusinian Mysteries）相关的边缘人物：她用“打破禁忌的笑”来让哀恸中的得墨忒耳恢复与人间的联系（进食、说话、继续行动）。","在古典文献中，这个角色有时也被称作“Iambe/Ιάμβη”（与“讽刺/戏谑的诗体 iambic”相关联），不同作者与传统会出现姓名与细节差异。","现代学术与艺术里，Baubo有时被用来讨论“女性身体、幽默与权力”的主题，但这些解读属于后世阐释，不等同于古希腊人的单一观点。"]}
{"word":"Bauchi","summary":{"en":"Bauchi is a name used for a city in northeastern Nigeria and for Bauchi State, the state where that city is the capital.","zh":"Bauchi（包奇）既指尼日利亚东北部的一座城市（包奇州首府），也可指包奇州本身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in northeastern Nigeria and the capital of Bauchi State","zh":"尼日利亚东北部的城市，包奇州（Bauchi State）的首府"},"examples":[{"en":"She traveled to Bauchi for a conference on education.","zh":"她去包奇参加一个关于教育的会议。"},{"en":"Bauchi is a gateway to exploring parts of northeastern Nigeria.","zh":"包奇是探索尼日利亚东北部一些地区的门户城市之一。"}]},{"partOfSpeech":"n.","definition":{"en":"Bauchi State, a state in northeastern Nigeria","zh":"包奇州：尼日利亚东北部的一个州"},"examples":[{"en":"The project supports small farmers across Bauchi State.","zh":"该项目支持包奇州各地的小农户。"},{"en":"Bauchi State borders several other states in the region.","zh":"包奇州与该地区的多个州接壤。"}]}],"synonyms":["Bauchi State (when referring to the state)"],"phonetic":"/ˈbaʊ.tʃi/","extraExplanation":["“Bauchi”既可指城市（州府），也常指同名的“包奇州”。在新闻与地图语境中，需看是否出现“State”来判断是州还是城市。","发音上，英语里常读作 /ˈbaʊ.tʃi/，其中“bau”类似“bow”（像“包”的开头接近“豹/包”的音），结尾“chi”读作“chee”（类似“奇/契”的音）。"]}
{"word":"bauchle","summary":{"en":"Probably “buckle”: a clasp for fastening, or the action of fastening/bending under pressure.","zh":"很可能是 “buckle”：指扣环/带扣，或指扣上、在压力下弯曲变形。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended word) a metal or plastic clasp used to fasten a belt or strap.","zh":"（很可能你想查的词）扣环；带扣（用来扣住皮带或带子的金属/塑料扣件）。"},"examples":[{"en":"He tightened his belt and snapped the buckle closed.","zh":"他收紧皮带，把带扣“啪”地扣上。"},{"en":"The backpack strap has a broken buckle.","zh":"背包带子的扣环坏了。"}]},{"partOfSpeech":"v.","definition":{"en":"to fasten something with a buckle, or to bend/collapse because of pressure.","zh":"用扣环扣住；（在压力下）弯曲、塌陷。"},"examples":[{"en":"Please buckle your seat belt.","zh":"请系好安全带。"},{"en":"The floorboards started to buckle in the heat.","zh":"地板在高温下开始起拱变形。"}]}],"synonyms":["clasp","fastener","clip","bend","warp"],"phonetic":"/ˈbʌkəl/","extraExplanation":["“bauchle”本身不是常见英语单词，更多情况下是把 **buckle** 拼错了（常见错误：把 /k/ 的音写成 *ch* 之类）。如果你看到的是人名/姓氏（如 Bauchle），发音会因家庭或地区而不同。","固定搭配：**buckle up**（系好安全带；也可引申为“做好准备”）。在美式英语里，飞机、汽车安全提示中最常见。"]}
{"word":"Baucis","summary":{"en":"Baucis is a mythological figure known for humble hospitality and faithful marriage, often mentioned with her husband Philemon.","zh":"Baucis（鲍西斯）是神话人物，以朴素的好客与忠贞的婚姻著称，常与丈夫 Philemon（菲勒蒙）一起被提及。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek and Roman mythology, an elderly woman who, with her husband Philemon, kindly welcomed the gods Zeus and Hermes (Jupiter and Mercury). She is often used as a symbol of humble hospitality and devoted marriage.","zh":"（希腊/罗马神话）鲍西斯：与丈夫菲勒蒙一起热情接待化身凡人的宙斯与赫尔墨斯（罗马名朱庇特与墨丘利），常被用来象征朴素的好客之道与忠贞的婚姻。"},"examples":[{"en":"The poem praises the couple as modern-day Baucis and Philemon, generous even in poverty.","zh":"这首诗称赞这对夫妻是当代的“鲍西斯与菲勒蒙”，即使贫穷也依然慷慨好客。"},{"en":"In Ovid’s story, Baucis offers simple food and a warm welcome to strangers.","zh":"在奥维德的故事里，鲍西斯用朴素的食物与热情的态度招待陌生人。"}]}],"synonyms":["Baucis and Philemon","hospitable host","devoted couple"],"phonetic":"/ˈbɔsɪs/","extraExplanation":["“Baucis and Philemon”的故事最有名的来源是罗马诗人奥维德（Ovid）的《变形记》（Metamorphoses）。两位老人以简陋却真诚的款待接待了伪装成旅人的神明；而村民冷漠拒绝，后来受到惩罚。","文学里提到“Baucis”常带有象征意义：强调“朴素但真挚的善意”“对陌生人的款待（hospitality）”以及“相守到老的伴侣关系”。在写作中常与“Philemon”成对出现。"]}
{"word":"bauckie","summary":{"en":"“Bauckie” is usually a proper name (surname/username), not a standard English vocabulary word.","zh":"“Bauckie”通常是专有名词（姓氏/网名），不是常见的标准英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare or nonstandard word in English; most often seen as a surname, username, or nickname (a proper name) rather than a dictionary word.","zh":"英语中非常少见、非标准的词；最常见的用法是作为姓氏、用户名或昵称（专有名词），而不是常规词典词汇。"},"examples":[{"en":"I saw the name “Bauckie” in the game lobby.","zh":"我在游戏大厅里看到了“Bauckie”这个名字。"},{"en":"Bauckie is the author’s surname on the cover.","zh":"Bauckie 是封面上作者的姓氏。"}]}],"phonetic":"/ˈbɔki/","extraExplanation":["“bauckie”不是常见英语词典词条，所以它的含义高度依赖语境（例如：人名、网名、地名、品牌名）。如果你能给我一句包含它的原句或告诉我它出现的场景，我可以更准确判断。","它也可能是拼写误差或变体拼写。常见的相近拼写包括：balky（倔强的/不配合的）、Bucky（人名/昵称）、buckeye（七叶树或俄亥俄州人的昵称）等。"]}
{"word":"bauckiebird","summary":{"en":"A Scottish/UK dialect word for a scarecrow, sometimes also used for a bogeyman-like scare figure.","zh":"苏格兰/英国方言词，指“稻草人/吓鸟的装置”，有时也可引申为“用来吓人的东西（类似鬼怪）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scottish/UK dialect) A scarecrow; something put in a field or garden to frighten birds away.","zh":"（苏格兰/英国方言）稻草人；放在田地或花园里用来吓走鸟的东西。"},"examples":[{"en":"The farmer set up a bauckiebird to keep the crows off the barley.","zh":"农夫立起一个“bauckiebird”（稻草人），不让乌鸦啄大麦。"},{"en":"We made a rough bauckiebird from old clothes and a stick.","zh":"我们用旧衣服和一根木棍做了个简易的稻草人。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) Something or someone used as a threat to scare others, especially children; a bogeyman-like figure.","zh":"（较少见）用来吓唬人的“吓人东西/吓唬人的人”（类似“鬼怪/床底怪”）。"},"examples":[{"en":"He joked that the strict teacher was a real bauckiebird.","zh":"他开玩笑说那位严厉的老师简直像个“bauckiebird”（用来吓人的人）。"}]}],"synonyms":["scarecrow","bogeyman","bogle","bogey"],"phonetic":"/ˈbɔkiˌbɝd/","extraExplanation":["这个词主要见于苏格兰与英国部分地区的方言/旧用法。拼写有时也会分开写作 bauckie bird。","bauckie 在苏格兰英语里可指“稻草人、吓唬人的东西”，和表示“妖怪/怪物”的 bogle（用来吓小孩的鬼怪）在意义上有联系；因此 bauckiebird 既可指田里的“吓鸟装置”，也可引申为“吓人的人/物”。"]}
{"word":"baud","summary":{"en":"Baud is the symbol rate in communications: the number of signal changes per second.","zh":"baud 表示通信中的符号率：每秒信号变化（符号）次数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In telecommunications) a unit that measures the rate of signaling—how many signal changes (symbols) happen each second.","zh":"（通信领域）波特率：衡量信号传输中“符号变化”速度的单位，即每秒发生多少次信号变化（符号/状态改变）。"},"examples":[{"en":"This modem supports 2400 baud.","zh":"这台调制解调器支持 2400 波特率。"},{"en":"Baud rate and bit rate are not always the same.","zh":"波特率和比特率并不总是相同。"}]}],"synonyms":["symbol rate"],"phonetic":"/bɔd/","extraExplanation":["“baud”来自法国工程师 Émile Baudot（埃米尔·博多）的姓氏，他发明了博多码（Baudot code），早期电报通信常用。","学习提示：baud（符号率）≠ bps（比特率）。如果一种调制方式每个符号携带不止 1 个比特（例如每个符号表示 4 种状态=2 比特），那么 bps 可能大于 baud。","常见混淆：日常口语里人们有时把 baud 当作“传输速度”，但在严格技术语境中应区分它与 bit rate。"]}
{"word":"baudekin","summary":{"en":"Baudekin means a luxurious, often gold-woven fabric used in medieval times for fine clothing and hangings.","zh":"baudekin 指一种中世纪常见的华贵织物，常织入金线，用于高级服装与帷幔等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rich, luxurious fabric (often woven with gold thread), used historically for fine clothing, hangings, or church decorations; “cloth of gold.”","zh":"一种华贵的织物（常织入金线），历史上用于高级服装、帷幔或教堂装饰；相当于“金织锦/金线织物”。"},"examples":[{"en":"The knight wore a cloak of baudekin that shimmered in the torchlight.","zh":"骑士披着一件金光闪闪的baudekin斗篷，在火把光下熠熠生辉。"},{"en":"Medieval records mention altar cloths made of baudekin for important festivals.","zh":"中世纪的记录提到，重要节日会使用baudekin制作的祭坛布。"},{"en":"In the romance, the hall is hung with baudekin and embroidered banners.","zh":"在这部骑士传奇中，大厅挂着baudekin帷幔和绣旗。"}]}],"synonyms":["cloth of gold","brocade","rich fabric","gold brocade"],"phonetic":"/ˈbɔdəˌkɪn/","extraExplanation":["这是一个较罕见、带中古色彩的词，常见于中世纪题材的文学、史料或宗教艺术语境。现代英语里更常用的相关词有 cloth of gold（“金线织物/金织锦”）或 brocade（“织锦”）。","词源上常被认为与中世纪贸易与地名有关（如与 Baghdad/“巴格达”相关的织物称呼传统），因此带有“东方舶来奢侈品”的历史联想。"]}
{"word":"baudekins","summary":{"en":"Baudekins are rich medieval silk fabrics—often with gold thread—or items (like coverings or cushions) made from that fabric.","zh":"baudekins 指中世纪常织入金线的华丽丝织物，或由这种织物制成的罩布、坐垫等陈设品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a luxurious medieval fabric (or cloth) made of silk, often woven with gold thread; commonly used for fine clothing, hangings, or ceremonial coverings.","zh":"一种中世纪的奢华织物（或布料），以丝绸为主，常织入金线；多用于华服、帷幔或仪式性覆盖物。"},"examples":[{"en":"The chronicler describes nobles dressed in baudekins and velvet.","zh":"史官记载贵族身着织金绸（baudekins）与天鹅绒。"},{"en":"A canopy of baudekins was hung above the throne for the ceremony.","zh":"仪式上，王座上方悬挂着织金绸（baudekins）制成的华盖。"}]},{"partOfSpeech":"n.","definition":{"en":"(by extension, historical) a cushion, cover, or decorative furnishing made from this fabric.","zh":"（引申义，史料用法）用这种织金绸制作的坐垫、罩布或装饰性陈设品。"},"examples":[{"en":"She placed a small reliquary on a baudekin to honor it.","zh":"她把小圣髑匣放在织金绸垫布（baudekin）上以示敬意。"},{"en":"The altar was dressed with baudekins during festivals.","zh":"节庆时，祭坛会铺设织金绸布（baudekins）装饰。"}]}],"synonyms":["cloth of gold","brocade","rich silk","baldachin (related context)"],"phonetic":"/ˈbɔːdəˌkɪnz/","extraExplanation":["“baudekins”是“baudekin”的复数，多见于历史、文学或博物馆说明文字中，现代日常英语很少用。","词源上与中世纪欧洲对东方奢侈丝织品的称呼有关；在拼写与用法上也常与“baldachin”（华盖、宝座上方的帷幔）一起出现在描写宫廷与宗教仪式的语境中。"]}
{"word":"Baudelaire","summary":{"en":"Baudelaire: a famous French poet and critic, author of *The Flowers of Evil*.","zh":"Baudelaire：著名法国诗人、评论家，《恶之花》作者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Charles Baudelaire (1821–1867), a major French poet and critic, best known for the poetry collection *Les Fleurs du mal* (*The Flowers of Evil*).","zh":"夏尔·波德莱尔（1821–1867），法国重要的诗人、评论家，以诗集《恶之花》（*Les Fleurs du mal*）最为著名。"},"examples":[{"en":"Baudelaire’s *The Flowers of Evil* explores beauty, desire, and the darker sides of city life.","zh":"波德莱尔的《恶之花》探讨美、欲望，以及都市生活更阴暗的一面。"},{"en":"Many later writers admired Baudelaire for his modern, intense imagery.","zh":"许多后来的作家欣赏波德莱尔现代而强烈的意象表达。"}]}],"synonyms":["Charles Baudelaire"],"phonetic":"/ˌboʊdəˈlɛr/","extraExplanation":["“Baudelaire”常被视为现代诗的重要源头之一：他把19世纪巴黎的都市经验、感官刺激与精神焦虑写进诗里，影响了象征主义（Symbolism）以及后来现代主义文学。","《恶之花》在当时曾因“伤风败俗”遭到起诉并被要求删改部分诗篇；这段历史常被用来说明文学与社会道德规范之间的张力。"]}
{"word":"baudery","summary":{"en":"“Baudery” is a misspelling of “bawdry,” meaning sexually suggestive, crude humor or lewdness.","zh":"“baudery”多为“bawdry”的误拼，指带性暗示的粗俗笑料或淫秽。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard spelling) Bawdry: rude or humorous talk, writing, or behavior about sex; lewdness.","zh":"（非标准拼写）bawdry：带有性暗示的粗俗/下流的谈话、文字或行为；淫秽。"},"examples":[{"en":"The comedian’s routine relied on bawdry rather than clever wordplay.","zh":"那位喜剧演员的段子主要靠下流梗，而不是巧妙的文字游戏。"},{"en":"The novel was criticized for its bawdry and crude jokes.","zh":"这部小说因其淫秽内容和低俗笑话而受到批评。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A lewd person (a “bawd”), or the business of arranging sexual encounters (historical usage).","zh":"（较少见）淫媒/拉皮条的人（bawd）；或撮合性交易的勾当（历史用法）。"},"examples":[{"en":"In older texts, a bawd might be described as living by “bawdry.”","zh":"在较早的文本里，淫媒可能被描述为靠“bawdry”谋生。"}]}],"synonyms":["bawdry","lewdness","smut","crudeness","raunchiness"],"phonetic":"/ˈbɔːdri/","extraExplanation":["“baudery”常见于拼写错误；标准拼写通常是 **bawdry**（名词）或 **bawdiness**（名词），对应形容词是 **bawdy**（下流的、带性暗示的）。","语体提示：这个词带有明显的负面评价色彩，用于正式写作时要谨慎；在文学评论里可能用来描述作品的“低俗色情笑料”。"]}
{"word":"Baudette","summary":{"en":"Baudette is a city in northern Minnesota near the Canadian border.","zh":"Baudette 是美国明尼苏达州北部、靠近加拿大边境的一座城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small city in northern Minnesota, USA, near the Canadian border (Lake of the Woods County).","zh":"美国明尼苏达州北部的一座小城市，靠近加拿大边境（位于伍兹湖县）。"},"examples":[{"en":"Baudette is known as a gateway to Lake of the Woods.","zh":"Baudette 常被称为通往伍兹湖（Lake of the Woods）的门户。"},{"en":"We drove through Baudette on our way to the border crossing.","zh":"我们开车经过 Baudette，前往边境口岸。"}]}],"phonetic":"/boʊˈdɛt/","extraExplanation":["Baudette 属于专有名词（地名），英语里通常首字母大写；在口语或写作中常与周边地理名词一起出现，如 Lake of the Woods（伍兹湖）、Minnesota（明尼苏达州）、Canadian border（加拿大边境）。"]}
{"word":"Baudin","summary":{"en":"Baudin usually refers to the French explorer Nicolas Baudin or, more generally, a French surname used for various people/places.","zh":"Baudin 通常指法国探险家尼古拉·博丹，也可泛指一个法国姓氏（用于不同人物或地点）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) Nicolas Baudin (1754–1803), a French explorer best known for leading a major scientific voyage to map parts of Australia’s coastline (often called the Baudin expedition).","zh":"（专有名词）尼古拉·博丹（1754–1803），法国探险家，以率领大型科学考察航行、测绘澳大利亚部分海岸线而闻名（常称“博丹远征/博丹考察队”）。"},"examples":[{"en":"Nicolas Baudin led a French expedition to Australia in the early 1800s.","zh":"尼古拉·博丹在19世纪初带领法国远征队前往澳大利亚。"},{"en":"Some Australian place names still reflect the work of Baudin’s team.","zh":"澳大利亚的一些地名至今仍能反映出博丹团队的工作。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A French surname; it may refer to various people or places with the name Baudin.","zh":"（专有名词）法国姓氏；也可指代名为 Baudin 的不同人物或地点。"},"examples":[{"en":"Baudin is a common French family name.","zh":"Baudin 是一个较常见的法国姓氏。"},{"en":"I found “Baudin” on a map, but it referred to a place, not the explorer.","zh":"我在地图上看到“Baudin”，但它指的是一个地点，而不是那位探险家。"}]}],"phonetic":"/boʊˈdæn/","extraExplanation":["“Baudin 远征”（1800–1804）是法国政府资助的科学航行，目标之一是更系统地测绘澳大利亚海岸并收集动植物标本。它与同时期英法在澳大利亚周边的航海探索有密切关联。","在英语文本中，Baudin 常作为历史人物名出现（首字母大写）。在学术或地图语境里，也可能指以他或其航行为名的海湾、岛屿、地名等；需要结合上下文判断。"]}
{"word":"Baudoin","summary":{"en":"Baudoin is usually a French-origin surname and sometimes a given name, related to Baudouin/Baldwin.","zh":"Baudoin 通常是源自法语背景的姓氏，也偶尔作名字使用，与 Baudouin/Baldwin（鲍德温）相关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname), often of French origin; in English contexts it is sometimes pronounced like “Baldwin.”","zh":"（姓氏）常见于法语背景的姓；在英语语境中有时读音接近“Baldwin（鲍德温）”。"},"examples":[{"en":"Professor Baudoin will lead today’s seminar.","zh":"鲍杜安教授将主持今天的研讨课。"},{"en":"She traced her family history back to the Baudoin line in France.","zh":"她把家族历史追溯到法国的鲍杜安家族分支。"}]},{"partOfSpeech":"other","definition":{"en":"a given name (first name) in some French-speaking traditions; related to the name “Baudouin/Baldwin.”","zh":"（名字）在一些法语文化中用作名；与“Baudouin / Baldwin（鲍德温）”同源或相关。"},"examples":[{"en":"Baudoin is a rare first name in the U.S.","zh":"Baudoin 在美国是比较少见的名字。"},{"en":"The character named Baudoin appears in a historical novel.","zh":"历史小说里出现了一个名叫 Baudoin 的角色。"}]}],"synonyms":["Baudouin","Baldwin"],"phonetic":"/ˈboʊdwɪn/","extraExplanation":["“Baudoin”多见于法语地区或有法语渊源的家族姓氏；在英语环境里常出现不同的本地化读法。","它常被视为“Baudouin”的变体拼写；而“Baudouin”与英语名“Baldwin（鲍德温）”在历史上有关联（源自日耳曼语系的人名传统）。","因为是专有名词，实际发音往往取决于本人/家族习惯或当地传统；在北美有时会按类似“BOH-dwin”的方式读。"]}
{"word":"Baudouin","summary":{"en":"Baudouin is a French male name (related to Baldwin) and is famously associated with Belgian kings, especially King Baudouin.","zh":"Baudouin 是法语男性名字（与 Baldwin/鲍德温相关），并常用于指比利时君主，尤其是博杜安国王。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A male given name (French form of “Baldwin”), used especially in French-speaking contexts; also the name of several European rulers, notably Belgian kings.","zh":"男性名字（“Baldwin/鲍德温”的法语形式），常见于法语语境；也用于指多位欧洲君主，尤其是比利时国王。"},"examples":[{"en":"King Baudouin was a well-known monarch of Belgium in the 20th century.","zh":"博杜安国王是20世纪比利时著名的君主。"},{"en":"In French, “Baudouin” is a common historical name for rulers and nobles.","zh":"在法语中，“Baudouin”是君主与贵族常见的历史名字。"}]}],"synonyms":["Baldwin"],"phonetic":"/ˈboʊdwɪn/","extraExplanation":["“Baudouin”最广为人知的用法之一是比利时国王博杜安（King Baudouin，1930–1993），在法语语境中常写作 Baudouin，在英语语境中有时会对应为 Baldwin（鲍德温）。","词源上与日耳曼语系人名有关，常被解释为由表示“勇敢/大胆”的成分与表示“朋友/保护者”的成分组合而来，因此带有“勇敢的朋友/保护者”之类的传统含义。"]}
{"word":"baudrons","summary":{"en":"An old Scots word meaning “cats,” especially old female cats.","zh":"一个较古老的苏格兰用词，指“猫”，尤指老母猫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"cats (plural of *baudron*), especially an old female cat; a Scots/old-fashioned word.","zh":"猫（*baudron* 的复数），尤指老母猫；苏格兰语/古旧用法。"},"examples":[{"en":"In the old tale, the witch kept several baudrons in her cottage.","zh":"在那个古老的故事里，女巫在小屋里养了几只老猫。"},{"en":"The poem mentions “auld baudrons” curling by the fire.","zh":"诗里提到“老猫”蜷在火炉旁。"}]}],"synonyms":["cats","old cats","(Scots) auld baudrons"],"phonetic":"/ˈbɔdrənz/","extraExplanation":["“baudron(s)”多见于苏格兰英语（Scots）或较古老的文学作品中，现代日常英语一般直接说 *cat* 或 *old cat*。","在苏格兰文学与民谣语境里，*auld baudrons* 常带一点戏谑或乡野气息，用来描写一只上了年纪的猫（常暗示母猫）。"]}
{"word":"baudronses","summary":{"en":"“baudronses” is an archaic Scots word meaning “cats.”","zh":"“baudronses”是古老的苏格兰英语用词，意思是“猫（复数）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic/Scots) Cats (plural), especially referring to a cat in a folksy or old-fashioned way.","zh":"（古语/苏格兰英语）猫（复数），带有民间口吻或旧式说法的“猫”。"},"examples":[{"en":"In old Scots stories, a witch might keep several baudronses by the fire.","zh":"在一些古老的苏格兰故事里，女巫可能在炉火旁养着几只“baudronses”（猫）。"},{"en":"The barn was quiet except for the baudronses hunting mice.","zh":"谷仓里很安静，只有那些猫在抓老鼠。"}]}],"synonyms":["cats","pussycats","mousers"],"phonetic":"/ˈbɔːdrənzɪz/","extraExplanation":["“baudrons/baudron”是苏格兰方言里对“猫”的旧称，带一点民间故事、乡村口吻的感觉；“baudronses”可以看作是用 -es 构成的古式复数（类似更口语化或更古旧的复数写法）。","在英语文学里，苏格兰作家（如一些民谣、故事体作品）会用“baudrons”来营造地域色彩与年代感；现代英语中很少见，更多出现在历史文本或仿古文风里。"]}
{"word":"bauds","summary":{"en":"Bauds are units for symbol rate: how many signal symbols per second a system transmits.","zh":"Bauds（波特）是符号率单位：表示系统每秒传输多少个信号符号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a unit that measures how many signal symbols are transmitted per second in a communication channel (symbol rate).","zh":"（通信中的）波特率单位：表示每秒传输的“信号符号”数量（符号率）。"},"examples":[{"en":"This modem runs at 2400 bauds.","zh":"这台调制解调器的速率是 2400 波特。"},{"en":"In a noisy line, engineers may lower the bauds to improve reliability.","zh":"在噪声较大的线路上，工程师可能会降低波特率来提高可靠性。"}]}],"synonyms":["symbol rate","baud rate"],"phonetic":"/bɔd/","extraExplanation":["“baud(s)”是“baud”的复数形式，常见于技术说明书。","baud（符号率）不一定等于 bps（每秒比特数）。如果每个符号只代表 1 个比特，那么 baud = bps；但若使用更复杂的调制方式（例如一个符号代表多个比特），bps 会大于 baud。"]}
{"word":"Bauer","summary":{"en":"Bauer is mainly a German-origin surname; in chess/German contexts it can also mean a pawn.","zh":"Bauer 主要是源自德语的姓氏；在棋类/德语语境中也可指国际象棋的“兵”（pawn）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), originally German.","zh":"（姓氏）鲍尔/鲍尔（源自德语的姓）。"},"examples":[{"en":"Trevor Bauer is a professional baseball pitcher.","zh":"特雷弗·鲍尔是一名职业棒球投手。"},{"en":"In my class, Bauer is a common last name.","zh":"在我班里，Bauer 是一个常见的姓。"}]},{"partOfSpeech":"n.","definition":{"en":"(from German, used in chess contexts) a pawn.","zh":"（源自德语，在国际象棋语境中）兵/卒（pawn）。"},"examples":[{"en":"He sacrificed a Bauer to open the file.","zh":"他牺牲了一个兵来打开这条线。"},{"en":"In some German chess books, a pawn is called a Bauer.","zh":"在一些德语棋书里，pawn（兵）被称为 Bauer。"}]}],"synonyms":["(surname)","pawn"],"phonetic":"/ˈbaʊər/","extraExplanation":["“Bauer”在德语里本义是“农民/佃农”，因此也常被解释为“出身农民的姓氏”。在国际象棋中，德语把“兵（pawn）”称为“Bauer”，所以你可能会在德语棋谱、棋书或讨论里看到它。"]}
{"word":"Bauera","summary":{"en":"Bauera is the name of an Australian genus of flowering shrubs, used especially in botanical names.","zh":"Bauera 指澳大利亚的一属开花灌木，常见于植物学名中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering shrubs (family Cunoniaceae) native to Australia, known for small, star-shaped flowers; commonly called bauera (e.g., “pink bauera”).","zh":"（植物）澳大利亚原生的一属开花灌木（绣球花目/昆兰科 Cunoniaceae），花朵多为小型星形；常被称为“bauera（鲍埃拉/鲍厄拉）”，如“粉红 bauera”。"},"examples":[{"en":"Pink bauera is often grown as a garden shrub in Australia.","zh":"粉红 bauera 常被作为澳大利亚花园里的观赏灌木种植。"},{"en":"The botanic label reads: Bauera rubioides.","zh":"植物园的标签写着：Bauera rubioides（鲁比欧叶鲍埃拉）。"}]}],"synonyms":["bauera (common name usage)"],"phonetic":"/ˈbaʊərə/","extraExplanation":["“Bauera”是拉丁化的植物属名，常用来纪念人物（多为植物学家或插画家）。在英文里遇到它，通常出现在植物学名（属名+种加词）或园艺介绍中。","作为属名时，英文写法首字母要大写（Bauera）；如果当作常见名（common name）使用，有时会写成小写 bauera。"]}
{"word":"Bauernbrot","summary":{"en":"Bauernbrot is a rustic German farmer’s bread—hearty, crusty, and often made with rye and/or wheat.","zh":"Bauernbrot指德式农夫/乡村面包：结实耐嚼、外壳厚，常用黑麦和/或小麦制作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional German “farmer’s bread”: a rustic, hearty loaf (often rye and/or wheat) with a thick crust and a dense, flavorful crumb.","zh":"德式“农夫面包/乡村面包”：一种传统德国粗犷、扎实的面包，多以黑麦和/或小麦制成，外壳厚、内里紧实、风味浓郁。"},"examples":[{"en":"I bought a loaf of Bauernbrot for breakfast and sliced it for butter and jam.","zh":"我买了一条Bauernbrot当早餐，切片后抹黄油和果酱。"},{"en":"Bauernbrot pairs well with cheese, cold cuts, and soup.","zh":"Bauernbrot很适合搭配奶酪、冷切肉和汤。"},{"en":"The menu says the sandwich is served on Bauernbrot.","zh":"菜单上写这款三明治用Bauernbrot面包做。"}]}],"synonyms":["German farmer’s bread","rustic German bread","country bread (German-style)"],"phonetic":"/ˈbaʊərnˌbroʊt/","extraExplanation":["“Bauernbrot”是德语：Bauern=农民/农夫，Brot=面包，字面意思是“农夫面包”。在英语语境里通常直接借用这个德语词，表示一种德式乡村风格的面包类型。","不同面包店的Bauernbrot配方差异很大：有的偏黑麦、酸种味更明显；有的加入更多小麦粉，口感会更松软一些。它常见于德国早餐（Frühstück）或晚餐冷食拼盘（Abendbrot）。"]}
{"word":"baufrey","summary":{"en":"“baufrey” isn’t a recognized English word; it’s likely a misspelling or a proper name—please provide context.","zh":"“baufrey”不是常见英语词，可能是拼写错误或专有名词；请提供上下文以便确认。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a surname/place name, or a coined term.","zh":"不是标准英语单词，可能是拼写错误、姓氏/地名，或自造词。"},"examples":[{"en":"I can’t find “baufrey” in major English dictionaries—could you share the sentence where you saw it?","zh":"我在主要英语词典里查不到“baufrey”——你能把它出现的句子发我吗？"},{"en":"If you meant “beau” or “buffet,” the meaning changes a lot, so context matters.","zh":"如果你想写的是“beau”或“buffet”，意思会差很多，所以需要上下文。"}]}],"phonetic":"N/A","extraExplanation":["“baufrey”看起来更像拼写误差或专有名词（人名/地名/品牌名）。你可以告诉我：1）它出现的完整句子；2）是否来自法语/德语/游戏/小说；3）你想表达的意思。我就能帮你确认最可能的正确拼写与含义。","可能的相近拼写（仅供排查）：Beau（男友/追求者），buffet（自助餐/打击），Balfrey/Beaufrey（较少见的姓氏拼写变体）。"]}
{"word":"bauge","summary":{"en":"“Bauge” is usually a proper noun, most commonly referring to the French town Baugé (often written “Baugé”). It can also be a less common surname.","zh":"“Bauge”通常是专有名词，最常见指法国小镇Baugé（常写作“Baugé”）。它也可以是较少见的姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a place name (proper noun): Baugé, a historic town in western France (now part of the commune Baugé-en-Anjou in Maine-et-Loire).","zh":"地名（专有名词）：Baugé，法国西部的一座历史小镇（现并入曼恩-卢瓦尔省的Baugé-en-Anjou市镇）。"},"examples":[{"en":"They stopped for lunch in Baugé while traveling through the Loire Valley region.","zh":"他们在穿越卢瓦尔河谷地区时，在Baugé停下来吃午饭。"},{"en":"The old castle near Baugé is a popular local attraction.","zh":"Baugé附近的古堡是当地很受欢迎的景点。"}]},{"partOfSpeech":"other","definition":{"en":"a surname: Bauge (less common), used as a family name in some countries.","zh":"姓氏：Bauge（较少见），在一些国家作为家族姓氏使用。"},"examples":[{"en":"Ms. Bauge will speak at the meeting tomorrow.","zh":"Bauge女士将于明天在会议上发言。"}]}],"synonyms":["Baugé","Baugé-en-Anjou"],"phonetic":"/boʊˈʒeɪ/","extraExplanation":["“Baugé”在法语里通常带重音符号（é），英语文本中有时会省略写成“Bauge”。法语读音更接近“bo-ZHAY”，英语里多用近似的读法。","如果你本来想查的是别的单词（例如拼写相近的词），告诉我上下文句子，我可以帮你确认正确拼写和词义。"]}
{"word":"Baugh","summary":{"en":"Baugh is most commonly a surname (family name).","zh":"Baugh 最常见的用法是姓氏（家族姓）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname); also used as a given name in rare cases","zh":"姓氏；也很少用作名字"},"examples":[{"en":"My professor’s last name is Baugh.","zh":"我教授的姓是 Baugh。"},{"en":"The article was written by Dr. Baugh.","zh":"这篇文章是由 Baugh 博士写的。"}]}],"phonetic":"/bɔ/","extraExplanation":["“Baugh”主要见于英语国家的人名（姓氏）。不同家庭的读法可能略有差异，但在美式英语里常读作类似“baw”。","词源可能来自不同来源：有的与古英语/中古英语里表示“树枝”的词（与同音词 bough 相关）有关；也有人认为它可能是威尔士语姓氏（如 Bach 等）的英语化拼写。具体要看家族背景。","学习提示：不要把 Baugh（人名）和 bough（树枝）在拼写上混淆；读音可能相近，但语法功能不同。"]}
{"word":"Baughman","summary":{"en":"Baughman is most commonly a surname (family name).","zh":"Baughman 最常见的意思是姓氏（家族名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname); a proper noun used to identify a person or family","zh":"鲍曼（常见姓氏）；专有名词，用来指代某个人或家族"},"examples":[{"en":"Ms. Baughman will join the meeting at 3 p.m.","zh":"鲍曼女士将于下午三点参加会议。"},{"en":"I’m emailing Dr. Baughman about the assignment.","zh":"我正在给鲍曼博士发邮件询问作业。"}]},{"partOfSpeech":"n.","definition":{"en":"a name that may appear in place names, building names, or institutions (usually honoring someone with that surname)","zh":"也可出现在地名、建筑名或机构名中（通常是为纪念同姓的人）"},"examples":[{"en":"The lecture is at the Baughman Auditorium.","zh":"讲座在鲍曼礼堂举行。"}]}],"phonetic":"/ˈbɔmən/","extraExplanation":["“Baughman”多见于美国的姓氏用法。拼写里“augh”容易让学习者误读；实际发音常接近“baw-”。","该姓氏常被认为与德语姓氏“Bachmann”（意为“溪边的人/住在小溪旁的人”）有渊源，属于移民背景下的拼写变化之一。"]}
{"word":"Bauhaus","summary":{"en":"Bauhaus refers to a major German school (1919–1933) and the influential modern design style it created—simple, functional, and suited to modern life and mass production.","zh":"Bauhaus（包豪斯）既指1919–1933年的德国重要艺术设计学校，也指其影响深远的现代设计风格：简洁、强调功能、适应现代生活与工业量产。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A famous German art, design, and architecture school (1919–1933) known for simple, functional design and for uniting art with modern industry.","zh":"包豪斯：德国著名的艺术、设计与建筑学校（1919–1933），以简洁、功能至上的设计风格，以及将艺术与现代工业结合的理念而闻名。"},"examples":[{"en":"Bauhaus designers believed everyday objects should be both useful and beautiful.","zh":"包豪斯的设计师认为日常物品应该既实用又美观。"},{"en":"The museum’s new building shows clear Bauhaus influence: clean lines and almost no decoration.","zh":"博物馆的新馆明显受到包豪斯影响：线条干净、几乎没有装饰。"}]},{"partOfSpeech":"n.","definition":{"en":"The design style associated with the Bauhaus school, often characterized by geometric forms, minimal ornament, and a focus on function.","zh":"包豪斯风格：与包豪斯学派相关的设计风格，常见特点是几何形、极少装饰、强调功能性。"},"examples":[{"en":"She decorated her apartment in a Bauhaus style with simple furniture and bold primary colors.","zh":"她用包豪斯风格来装饰公寓：简洁的家具和醒目的原色。"},{"en":"This chair is Bauhaus—practical, modern, and made for mass production.","zh":"这把椅子很“包豪斯”：实用、现代，并且适合量产。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to the Bauhaus school or its style.","zh":"与包豪斯（学校或风格）有关的；具有包豪斯风格的。"},"examples":[{"en":"The poster has a Bauhaus look: strong typography and clear shapes.","zh":"这张海报很有包豪斯味道：字体有力量、图形清晰。"},{"en":"They chose Bauhaus principles for the redesign—less clutter, more purpose.","zh":"他们用包豪斯原则来改版——更少杂乱，更有目的性。"}]}],"synonyms":["modernist design","functional design","International Style (related)"],"phonetic":"/ˈbaʊ.haʊs/","extraExplanation":["“Bauhaus”在德语里字面意思接近“建筑之屋/建造之家”（Bau=建造，Haus=房子）。它强调把美术、工艺、建筑与工业生产结合起来，因此对现代平面设计、家具、建筑、字体排版影响很大。","常与包豪斯一起被提到的人物/关键词包括：Walter Gropius（格罗皮乌斯，创办者）、Paul Klee（保罗·克利）、Wassily Kandinsky（康定斯基）；以及“form follows function（形式追随功能）”“less is more（少即是多）”等现代主义设计观念。"]}
{"word":"Bauhinia","summary":{"en":"Bauhinia is a tropical plant (orchid tree), and it can also specifically mean the Hong Kong orchid tree, a symbol of Hong Kong.","zh":"Bauhinia 指紫荆属的热带植物（兰花树/洋紫荆）；也可特指香港的洋紫荆，是香港象征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical tree or shrub in the genus *Bauhinia* (the orchid tree), known for showy, orchid-like flowers.","zh":"紫荆属（*Bauhinia*）的热带乔木或灌木（常称“兰花树/洋紫荆”），以花朵艳丽、形似兰花而闻名。"},"examples":[{"en":"The bauhinia outside the library blooms with purple flowers every spring.","zh":"图书馆外的紫荆每年春天都会开出紫色的花。"},{"en":"Some bauhinia leaves look like two lobes, almost like a butterfly shape.","zh":"有些紫荆的叶子呈两裂状，看起来有点像蝴蝶。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in Hong Kong) the Hong Kong orchid tree (*Bauhinia blakeana*), a common ornamental flower and a symbol of Hong Kong.","zh":"（尤指香港）洋紫荆（*Bauhinia blakeana*），常见观赏花卉，也是香港的象征。"},"examples":[{"en":"The bauhinia is featured on Hong Kong’s flag and coins.","zh":"洋紫荆出现在香港的旗帜和硬币上。"},{"en":"During the festival, streets were decorated with bauhinia motifs.","zh":"节庆期间，街道上装饰了洋紫荆图案。"}]}],"synonyms":["orchid tree","Hong Kong orchid tree","purple bauhinia"],"phonetic":"/baʊˈhɪniə/","extraExplanation":["“Bauhinia”源自拉丁化的人名，用来纪念瑞士植物学家包恩兄弟（Bauhin）。","香港旗帜上的“区花”是五瓣白色的洋紫荆（*Bauhinia blakeana*），每瓣上有红色花蕊图案；在英语语境里提到 bauhinia，常与香港的城市符号联想在一起。","中文里“紫荆/洋紫荆/香港紫荆”在日常使用中有时会混用；若需要更精确，建议配合学名（如 *Bauhinia blakeana*）确认。"]}
{"word":"bauhinias","summary":{"en":"Bauhinias = multiple Bauhinia plants (orchid trees), valued for their showy flowers.","zh":"Bauhinias 指多种紫荆属（兰花树/洋紫荆）植物，常因花朵艳丽而栽培。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of bauhinia: trees or shrubs of the genus Bauhinia, often grown for their orchid-like flowers (some are called “orchid trees”).","zh":"bauhinia 的复数：指紫荆属（Bauhinia）的多种树或灌木，常因兰花般的花朵而栽培（有些也被称为“兰花树/洋紫荆”）。"},"examples":[{"en":"Bauhinias are often planted along streets for their showy spring blossoms.","zh":"紫荆属植物常被种在街道两旁，因为春天开花很艳丽。"},{"en":"In warm climates, bauhinias can grow into small shade trees.","zh":"在温暖气候里，紫荆属植物可以长成小型遮阴树。"}]}],"synonyms":["orchid trees","bauhinia plants"],"phonetic":"/baʊˈhɪniəz/","extraExplanation":["“Bauhinia”是一个植物属名，常见园艺用途是观花与行道树。不同地区把不同物种称作“orchid tree”（兰花树/洋紫荆），中文里也可能与“紫荆”（某些近缘或不同属的植物俗称）混用，实际指哪一种要看地区与物种。","属名Bauhinia来自16世纪的瑞士博物学家Bauhin兄弟；其叶片常呈“对称分裂”的形态，据说让人联想到两兄弟的名字。"]}
{"word":"bauk","summary":{"en":"Balk (also spelled baulk) means to hesitate/refuse, or to block progress; in baseball it means a pitching violation.","zh":"Balk（英式拼作 baulk）可指犹豫/拒绝，也可指阻碍进展；在棒球中指“投手犯规”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to hesitate or refuse to do something because it seems difficult, dangerous, or unacceptable","zh":"因觉得困难、危险或不可接受而犹豫、退缩或拒绝去做"},"examples":[{"en":"She balked at the idea of moving across the country alone.","zh":"她一想到要独自搬到全国另一头就退缩了。"},{"en":"Some parents balk at paying extra fees for after-school programs.","zh":"一些家长不愿意为课后项目支付额外费用。"}]},{"partOfSpeech":"vt.","definition":{"en":"to stop something from happening; to block or hinder progress","zh":"阻止某事发生；妨碍、阻挠进展"},"examples":[{"en":"A lack of funding balked the plan to build a new library.","zh":"资金不足使新图书馆的建设计划受阻。"},{"en":"Heavy traffic balked our attempt to arrive on time.","zh":"严重堵车妨碍了我们准时到达。"}]},{"partOfSpeech":"n.","definition":{"en":"an unexpected obstacle or hindrance; something that stops progress","zh":"障碍；阻碍进展的事物"},"examples":[{"en":"The biggest balk was the cost of repairs.","zh":"最大的障碍是维修费用。"}]},{"partOfSpeech":"n.","definition":{"en":"(baseball) an illegal action by the pitcher meant to deceive runners, resulting in a penalty","zh":"（棒球）投手的“投手犯规”（试图欺骗跑垒员的非法动作），会被判罚"},"examples":[{"en":"The pitcher was called for a balk, and the runner advanced to second base.","zh":"投手被判投手犯规，跑垒员推进到二垒。"}]}],"synonyms":["hesitate","refuse","recoil","obstruct","hinder","block"],"phonetic":"/bɔk/","extraExplanation":["“bauk”通常是拼写误差；更常见的形式是 **balk**（美式常用）或 **baulk**（英式常用），意思相同。","在日常英语里，最常用的是动词搭配 **balk at + 名词/动名词**：balk at paying / balk at the idea。","棒球里的 **balk** 是固定术语，和“犹豫”无关；如果你在体育新闻里看到，多半指“投手犯规”。"]}
{"word":"Baul","summary":{"en":"A Baul is a Bengali wandering folk singer and spiritual seeker, famous for mystical songs.","zh":"Baul 指孟加拉地区的游方民间歌者与灵性追寻者，以神秘主义歌曲闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Bauls, a group of wandering folk singers and spiritual seekers from Bengal (in India and Bangladesh), known for mystical songs and a simple way of life","zh":"“鲍尔派/鲍尔人”的成员：来自孟加拉（印度与孟加拉国一带）的游方民间歌者与灵性追寻者，以神秘主义歌曲与简朴生活方式著称"},"examples":[{"en":"We heard a Baul singing with an ektara at a village fair in Bengal.","zh":"我们在孟加拉的乡村集市上听到一位鲍尔人用独弦琴（ektara）演唱。"},{"en":"Baul songs often talk about love, the soul, and the search for the divine within.","zh":"鲍尔歌曲常常谈论爱、灵魂，以及向内寻找神性。"},{"en":"She’s studying Baul music as part of a course on South Asian folk traditions.","zh":"她正在学习鲍尔音乐，作为南亚民间传统课程的一部分。"}]}],"synonyms":["minstrel","folk singer","wandering singer"],"phonetic":"/baʊl/","extraExplanation":["“Baul”常见于文化与音乐语境，尤其与孟加拉地区的民歌传统相关。英语里有时把“Baul songs / Baul music”当作固定搭配。","鲍尔传统常被描述为融合了不同宗教与哲学元素（如奉爱传统与苏非思想等）的民间神秘主义。著名人物包括拉隆·法基尔（Lalon Fakir）。","拼写与大小写：作为族群/传统名称通常大写 Baul；作形容用法也常见，如 “Baul singer / Baul tradition”。"]}
{"word":"baul","summary":{"en":"Baul refers to a Bengali wandering mystic singer, or the folk tradition of their music and poetry.","zh":"Baul 指孟加拉地区的流浪神秘主义歌者，也可指其民间音乐与诗歌传统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Baul tradition: a Bengali folk mystic and wandering singer, especially from West Bengal (India) and Bangladesh","zh":"巴乌尔传统的成员：来自印度西孟加拉与孟加拉国一带的孟加拉民间神秘主义者与流浪歌者"},"examples":[{"en":"We listened to a Baul sing with an ektara at a village festival.","zh":"我们在乡村庆典上听一位巴乌尔歌者用独弦琴（ektara）演唱。"},{"en":"Bauls often travel from place to place, sharing spiritual songs.","zh":"巴乌尔歌者常常四处游走，传唱带有灵性与哲思的歌曲。"}]},{"partOfSpeech":"n.","definition":{"en":"the Baul tradition or style of music and poetry","zh":"巴乌尔传统；巴乌尔的音乐与诗歌风格"},"examples":[{"en":"She is studying Baul as a form of devotional folk music.","zh":"她正在研究巴乌尔，把它视为一种带有敬神色彩的民间音乐形式。"}]}],"synonyms":["minstrel","folk singer","wandering singer"],"phonetic":"/baʊl/","extraExplanation":["“Baul（巴乌尔）”并不是常见英语日常词汇，更常出现在南亚文化、宗教与民族音乐相关语境中；在英文里常写作 Baul / Bauls（复数）。","巴乌尔歌曲常谈“内在的神/人”“爱与自由”等主题，融合民间哲思与神秘主义色彩；印度诗人泰戈尔（Tagore）曾受其影响并在作品与演讲中提及。"]}
{"word":"bauld","summary":{"en":"“Bauld” is mainly a Scots/dialect spelling of “bold,” and it can also appear as a surname or a misspelling of “Barbauld.”","zh":"“Bauld”主要是苏格兰方言中“bold”的变体拼写；也可作为姓氏，或是对“Barbauld”的误拼。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Scots, dialect) A spelling/variant of “bold”: brave, daring, not easily afraid; sometimes also meaning impudent or outspoken.","zh":"（苏格兰方言）“bold”的变体拼写：勇敢的、大胆的；有时也可指冒失的、直言不讳的。"},"examples":[{"en":"He was bauld enough to speak up when everyone else stayed silent.","zh":"当其他人都沉默时，他大胆地站出来发声。"},{"en":"In some older Scottish writing, “bauld” is simply another way to write “bold.”","zh":"在一些较早的苏格兰文本中，“bauld”只是“bold”的另一种拼写。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname); most famously seen in the name of the English writer Anna Laetitia Barbauld (sometimes misspelled as “Bauld”).","zh":"姓氏；最常见于英国作家 Anna Laetitia Barbauld（有时会被误拼为“Bauld”）。"},"examples":[{"en":"I saw “Bauld” in the document, but the author likely meant “Barbauld.”","zh":"我在文件里看到“Bauld”，但作者很可能想写的是“Barbauld”。"}]}],"synonyms":["bold","brave","daring"],"phonetic":"/bɔld/","extraExplanation":["“bauld”常出现在苏格兰英语（Scots）或模仿苏格兰口音/拼写的文学作品里，用来营造地域或时代氛围。","如果你是在诗歌或文学史里看到“Bauld”，也可能是对诗人兼散文家 Anna Laetitia Barbauld（18世纪）的拼写误差；她的姓正确拼法是 Barbauld。"]}
{"word":"baulea","summary":{"en":"“Baulea” is not a common English word; it’s usually a romanized spelling of the Romanian place name “Bâlea,” as in Lake Bâlea.","zh":"“Baulea” 不是常见英语词，多半是罗马尼亚地名 “Bâlea” 的拉丁化/无变音符拼写（如贝莱亚湖）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (place name), often seen as “Bâlea” in Romanian; it refers to places in the Făgăraș Mountains of Romania (e.g., Lake Bâlea / Bâlea Lac).","zh":"专有名词（地名），常见罗马尼亚语拼写为 “Bâlea”；指罗马尼亚法格拉什山脉一带的地点（如 Bâlea Lake／Bâlea Lac：贝莱亚湖）。"},"examples":[{"en":"We drove the Transfăgărășan Highway and stopped at Lake Bâlea.","zh":"我们开车走了特兰斯法加拉尚公路，在贝莱亚湖停留。"},{"en":"“Baulea” is sometimes used in English texts when Romanian diacritics aren’t available.","zh":"在无法输入罗马尼亚语变音符号时，英文文本里有时会用 “Baulea” 来代替。"}]}],"phonetic":"/ˈbaʊ.li.ə/","extraExplanation":["“Bâlea”里的 â 是罗马尼亚语的变音符号；在不方便输入时，人们可能用 “Baulea/Balea” 这类近似拼写。","如果你本来想查的是英语单词 **bauble**（小装饰品、廉价小玩意儿），也可能是拼写误差；告诉我你想表达的语境，我可以一起对比讲解。"]}
{"word":"bauleah","summary":{"en":"“Bauleah” is not a standard English word; it’s usually a name/handle, or possibly a variant of “Baule/Baoulé” (a people/language in Côte d’Ivoire).","zh":"“Bauleah”不是标准英语词汇；通常是名字/网名，也可能是 “Baule/Baoulé”（科特迪瓦的民族/语言）的变体拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. Most commonly seen as a personal name, username, or a creative spelling rather than a dictionary entry.","zh":"不是标准英语单词。最常见于人名、用户名或创意拼写，而不是词典词条。"},"examples":[{"en":"My online handle is Bauleah.","zh":"我的网名是 Bauleah。"},{"en":"Bauleah signed the email at the bottom.","zh":"邮件末尾署名是 Bauleah。"}]},{"partOfSpeech":"other","definition":{"en":"Possible variant spelling of “Baule,” referring to the Baoulé (Baule) people or their language in Côte d’Ivoire (Ivory Coast).","zh":"可能是 “Baule” 的变体拼写，可指科特迪瓦（象牙海岸）的包莱族（Baoulé/Baule）或其语言。"},"examples":[{"en":"She is Baule (Baoulé) and speaks the language at home.","zh":"她是包莱族（Baoulé/Baule），在家里会说这门语言。"},{"en":"This song includes Baule words from Côte d’Ivoire.","zh":"这首歌里包含来自科特迪瓦的 Baule 语词。"}]}],"synonyms":["(for the ethnic/language sense) Baule","Baoulé","Baoule"],"phonetic":"/baʊˈliːə/","extraExplanation":["“Baule”更常见的拼写也包括 **Baoulé / Baoule**。如果你指的是民族/语言，建议你告诉我你看到它的上下文（比如一段文字、歌曲、名字、地点），我可以帮你确认最准确的含义与拼写。","如果“Bauleah”是人名：英语里很多名字有不同的创意拼写，通常没有固定词义；但我也可以根据发音、来源（法语区/非洲语源等）帮你推测可能的文化背景。"]}
{"word":"baulk","summary":{"en":"Baulk means to hesitate/refuse, or to block/prevent; as a noun it can mean an obstacle or a thick wooden beam.","zh":"baulk 表示“犹豫/退缩或拒绝”，也可表示“阻碍/使受挫”；作名词可指“障碍”或“木梁/大木方”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to hesitate or refuse to do something because you feel uncertain, nervous, or unwilling","zh":"因犹豫、不安或不愿意而退缩；不愿做某事"},"examples":[{"en":"She didn’t baulk at the challenge; she accepted it immediately.","zh":"她没有被挑战吓退，而是立刻接受了。"},{"en":"I baulked at paying that much for a ticket.","zh":"我一听要付那么多票钱就有些退缩。"}]},{"partOfSpeech":"v.","definition":{"en":"to stop, block, or prevent something from happening; to frustrate a plan","zh":"阻碍；使受挫；妨碍某事发生或使计划落空"},"examples":[{"en":"A lack of funding baulked the project.","zh":"资金不足使这个项目受挫。"},{"en":"Heavy snow baulked our attempt to drive over the mountain pass.","zh":"大雪阻碍了我们开车翻越山口的尝试。"}]},{"partOfSpeech":"n.","definition":{"en":"an obstacle or something that prevents progress","zh":"障碍物；阻碍进展的事物"},"examples":[{"en":"They removed every baulk in the negotiation process.","zh":"他们清除了谈判过程中的每一个障碍。"}]},{"partOfSpeech":"n.","definition":{"en":"a thick wooden beam or piece of timber (also used in some sports contexts)","zh":"（厚）木梁；大木方（亦见于部分运动/专门语境）"},"examples":[{"en":"The builder set the baulk across the supports.","zh":"工人把木梁架在支撑物上。"}]}],"synonyms":["balk","hesitate","shrink from","refuse","recoil","obstruct","hinder","thwart","block"],"phonetic":"/bɔk/","extraExplanation":["“baulk”是“balk”的常见拼写变体（在英式英语中更常见）。两者意思基本相同：作动词时常表示“犹豫/退缩”或“阻碍”，作名词时可指“障碍物”。","在体育或专门领域里，“baulk”还可指特定的木梁/木方；如果你在一般阅读中看到，多半还是“退缩/阻碍”的动词用法。"]}
{"word":"baulked","summary":{"en":"Baulked means “hesitated/refused or was stopped,” or “prevented/thwarted,” and is a spelling variant of balked.","zh":"baulked 表示“犹豫/退缩或突然停下”，也可表示“阻止/挫败”，是 balked 的另一种拼写。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Past tense/past participle of baulk) to hesitate, refuse, or stop suddenly because you feel unwilling, unsure, or shocked.","zh":"（baulk 的过去式/过去分词）因不愿意、不确定或吃惊而犹豫、退缩、拒绝或突然停下。"},"examples":[{"en":"She baulked at the idea of quitting her job without a plan.","zh":"她一想到没有计划就辞职就退缩了。"},{"en":"He baulked when asked to speak in front of the whole class.","zh":"当被要求在全班面前发言时，他犹豫了。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Past tense/past participle of baulk) to prevent something from happening; to block or frustrate a plan or attempt.","zh":"（baulk 的过去式/过去分词）阻止某事发生；阻挠、挫败（计划或尝试）。"},"examples":[{"en":"A lack of funding baulked the project.","zh":"资金不足使该项目受挫。"},{"en":"Their escape was baulked by the locked door.","zh":"上锁的门阻止了他们逃走。"}]},{"partOfSpeech":"v.","definition":{"en":"(Especially of a horse) to stop short and refuse to go forward.","zh":"（尤指马）突然止步不前，拒绝继续前进。"},"examples":[{"en":"The horse baulked at the jump.","zh":"那匹马在障碍前突然停住，不肯跳。"}]}],"synonyms":["balked","hesitated","refused","recoiled","flinched","thwarted","blocked"],"phonetic":"/bɔkt/","extraExplanation":["“baulked”多见于英式拼写“baulk”；美式更常写作“balked”。两者意思通常相同。","在日常英语里，最常见搭配是“baulk at + 名词/动名词”（对……退缩/不愿做）。"]}
{"word":"baulkier","summary":{"en":"**Baulkier** means “more balky/baulky”: more stubborn or harder to manage.","zh":"**baulkier** 表示“更不配合/更固执”或“更难操作/更麻烦”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative form of **baulky/balky**: more unwilling to cooperate or move; more stubborn or resistant.","zh":"**baulky/balky** 的比较级：更不配合、更不愿意行动；更固执、抗拒。"},"examples":[{"en":"The horse got **baulkier** when it heard the loud trucks.","zh":"马听到大卡车的噪音后变得**更不肯走**了。"},{"en":"He became **baulkier** about answering questions after the argument.","zh":"争吵之后，他对回答问题变得**更抗拒**了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of a plan, machine, or system) more difficult to manage; more awkward or unreliable.","zh":"（指计划、机器或系统）更难操作/推进；更别扭或更不可靠。"},"examples":[{"en":"As the software updates piled up, the system grew **baulkier** and slower.","zh":"随着软件更新越积越多，系统变得**更难用**也更慢了。"},{"en":"The new process is **baulkier** than the old one.","zh":"新流程比旧流程**更麻烦**。"}]}],"synonyms":["more stubborn","more resistant","more uncooperative","more awkward","more unwieldy"],"phonetic":"/ˈbɔkiɚ/","extraExplanation":["“**baulkier**”来自形容词 **baulky**（也常拼作 **balky**）。**baulk** 更偏英式拼写，**balk** 更偏美式拼写，但两者意思基本相同。","常见固定搭配：**a balky/baulky horse**（不肯走的马）；**balky engine**（动不动就出问题/不好使的引擎）。"]}
{"word":"baulkiest","summary":{"en":"“Baulkiest” means “the most stubborn or uncooperative; hardest to get working or moving.”","zh":"“baulkiest” 表示“最倔强/最不配合的；最难推动或最难正常运转的（多指机器）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative form of **baulky**: the most unwilling to cooperate or move; stubborn or resistant (often of a person, animal, or machine).","zh":"**baulky** 的最高级：最不配合的；最倔强的；最不肯动/最难推动的（常指人、动物或机器）。"},"examples":[{"en":"Of all the printers in the office, this one is the **baulkiest**—it jams every day.","zh":"办公室里所有打印机中，这台最**不配合**——每天都卡纸。"},{"en":"The horse was at its **baulkiest** when it saw the loud traffic.","zh":"马一看到嘈杂的车流就变得最**倔强**、最不肯走。"}]}],"synonyms":["most balky","most stubborn","most uncooperative","most recalcitrant"],"phonetic":"ˈbɔki","extraExplanation":["**baulky** 是 **balky** 的一种拼写变体（更偏英式/较少见）。在美式英语里更常见的是 **balky**。它既可以形容“固执不配合的人/动物”，也常形容“运转不顺、老出毛病的机器”。"]}
{"word":"baulking","summary":{"en":"Baulking means hesitating/refusing, or obstructing progress; it’s the British spelling of “balking.”","zh":"baulking 指犹豫/拒绝，或阻碍进展；是 “balking” 的英式拼写。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"hesitating or refusing to do something; stopping because you feel unsure or unwilling","zh":"犹豫或拒绝去做某事；因为不确定或不情愿而停下"},"examples":[{"en":"She agreed to help, without baulking at the extra work.","zh":"她同意帮忙，没有因为额外的工作而犹豫。"},{"en":"He baulked at the idea of moving to a new city.","zh":"他对搬去新城市这个想法很抗拒。"}]},{"partOfSpeech":"vt.","definition":{"en":"to hinder or obstruct something; to prevent progress","zh":"阻碍；妨碍；使进展受阻"},"examples":[{"en":"A lack of funding is baulking the project.","zh":"资金不足正在阻碍这个项目的推进。"},{"en":"Technical problems baulked their plans.","zh":"技术问题妨碍了他们的计划。"}]},{"partOfSpeech":"vi.","definition":{"en":"(of a horse) to stop suddenly and refuse to move, often out of fear or stubbornness","zh":"（指马）突然停住并拒绝前进，常因害怕或倔强"},"examples":[{"en":"The horse baulked at the noisy traffic.","zh":"那匹马被嘈杂的车流吓得停住不走了。"}]}],"synonyms":["hesitating","refusing","backing off","resisting","hindering","obstructing"],"phonetic":"/ˈbɔkɪŋ/","extraExplanation":["“baulking”是英式拼写，更常见的美式拼写是“balking”。两者读音和意思相同。","在日常英语里，最常见的搭配是“baulk/balk at + 名词/动名词”，表示“对……望而却步/不愿接受”。例如：baulk at the cost（嫌贵、不愿付）/ baulk at telling the truth（不愿说实话）。","文学和新闻写作中，“baulk/balk”常用来表达“原则性抗拒”或“因代价太高而退缩”，语气比简单的“don’t want”更正式一些。"]}
{"word":"baulks","summary":{"en":"“Baulks” usually means “hesitates/refuses/obstructs” (as the verb “balks,” British spelling). It can also be the plural noun meaning “large wooden beams.”","zh":"“baulks”通常是动词“balks”的英式拼写，表示“犹豫/拒绝/阻挠”。也可作名词复数，指“大木梁”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(3rd person singular of) balk: to hesitate or stop because you are unwilling, uncertain, or afraid to continue.","zh":"（动词 balk 的第三人称单数）犹豫不前；因不情愿/不确定/害怕而停下或不继续。"},"examples":[{"en":"He baulks at the idea of quitting his job without a plan.","zh":"他一想到没计划就辞职就犹豫了。"},{"en":"She baulks when asked to speak in front of a big group.","zh":"当被要求在大群人面前发言时，她会退缩。"}]},{"partOfSpeech":"v.","definition":{"en":"(3rd person singular of) balk: to refuse to accept or do something; to resist.","zh":"（动词 balk 的第三人称单数）拒绝接受或去做；抗拒。"},"examples":[{"en":"The company baulks at paying higher wages this year.","zh":"公司今年拒绝支付更高的工资。"},{"en":"Some people baulk at signing a long contract.","zh":"有些人抗拒签一份很长的合同。"}]},{"partOfSpeech":"vt.","definition":{"en":"(3rd person singular of) balk: to prevent something from happening; to frustrate or obstruct a plan.","zh":"（动词 balk 的第三人称单数）阻挠；使（计划等）受挫；妨碍。"},"examples":[{"en":"Bad weather baulks our weekend trip.","zh":"坏天气让我们的周末旅行泡汤了。"},{"en":"A lack of funding baulks the project.","zh":"资金不足使项目受挫。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of baulk: a large piece of timber (a beam), or a thick, rough plank (more common in British English).","zh":"baulk 的复数：大木梁；粗厚木板（英式用法更常见）。"},"examples":[{"en":"They lifted the baulks onto the truck for the renovation.","zh":"他们把一根根大木梁抬上卡车用于翻修。"},{"en":"Old baulks of wood lay stacked behind the barn.","zh":"谷仓后面堆着几根旧木梁。"}]}],"synonyms":["balks","hesitates","refuses","resists","objects","stops short","obstructs","thwarts"],"phonetic":"/bɔk/","extraExplanation":["“baulks”是英式拼写；美式更常写作“balks”。两者读音相同。","常见搭配：baulk/balk at + 名词/动名词（对……感到犹豫/抗拒），如 baulk at paying more（不愿多付钱）。","名词 baulk（木梁）主要见于英式语境与建筑/木工语域；日常美式英语里更常用 beam/plank。"]}
{"word":"baulky","summary":{"en":"Baulky means unwilling to move or cooperate, or awkward/unreliable to handle; it’s a less common spelling of balky.","zh":"baulky 指不肯继续/不配合，或难操作、不可靠；是 balky 的较少见拼写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Refusing to proceed or cooperate; stubborn or hesitant (often used of a person or an animal).","zh":"（人或动物）不肯继续、不配合；倔强的、犹豫不前的。"},"examples":[{"en":"The horse got baulky at the gate and wouldn’t move forward.","zh":"那匹马在门口变得不肯走，怎么也不往前。"},{"en":"He became baulky when asked to change his plan at the last minute.","zh":"被要求临时改计划时，他就开始不配合了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Difficult to use or manage; awkward or unreliable (often used of a machine or system).","zh":"难以操作或管理的；别扭的、不可靠的（常形容机器或系统）。"},"examples":[{"en":"The old printer is baulky and jams every few pages.","zh":"那台旧打印机很不可靠，每打印几页就卡纸。"},{"en":"Their payment system is baulky, so the checkout takes forever.","zh":"他们的付款系统很别扭，所以结账要等很久。"}]}],"synonyms":["balky","stubborn","uncooperative","hesitant","temperamental"],"phonetic":"/ˈbɔki/","extraExplanation":["“baulky”是“balky”的另一种拼写（更常见于英式英语）。在美式英语里通常写作“balky”。两者意思相同。"]}
{"word":"Baum","summary":{"en":"Baum is usually a German-origin surname meaning “tree,” and it can also refer to the author L. Frank Baum (The Wonderful Wizard of Oz).","zh":"Baum 通常是一个德语来源的姓氏，意思是“树”；也可指《绿野仙踪》作者 L. Frank Baum。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname of German origin (from German Baum, meaning “tree”).","zh":"一个德语来源的姓氏（源自德语 Baum，意思是“树”）。"},"examples":[{"en":"Her last name is Baum, and her family originally came from Germany.","zh":"她的姓是 Baum，她家族最初来自德国。"},{"en":"I saw the name Baum on the office door.","zh":"我在办公室门牌上看到 Baum 这个名字。"}]},{"partOfSpeech":"n.","definition":{"en":"(often in U.S. culture) L. Frank Baum, the American author best known for The Wonderful Wizard of Oz.","zh":"（在美国文化中常指）L. Frank Baum，美国作家，以《绿野仙踪》（The Wonderful Wizard of Oz）最著名。"},"examples":[{"en":"We read a chapter from Baum’s The Wonderful Wizard of Oz in class.","zh":"我们在课上读了 Baum 的《绿野仙踪》中的一章。"},{"en":"Many Oz stories are connected to Baum’s original books.","zh":"许多“奥兹国”故事都与 Baum 的原著有关。"}]}],"synonyms":["(as a meaning in German) tree","(related name) Oz author"],"phonetic":"/baʊm/","extraExplanation":["“Baum”在德语里就是“树”，所以作为姓氏时带有很常见的“自然/地名/职业来源”的欧洲姓氏特点。","L. Frank Baum（1856–1919）写的《The Wonderful Wizard of Oz》（1900）后来被改编成非常有影响力的电影与音乐剧，使“Baum”这个姓在英语世界里更容易被认出来。"]}
{"word":"Baumann","summary":{"en":"Baumann is mainly a German-language surname; it can also appear in specialized terms named after a person.","zh":"Baumann 主要是德语系姓氏；也可能出现在以人物命名的专业术语中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a German-language surname (family name), found in Germany, Switzerland, Austria, and among their descendants abroad.","zh":"一个德语系常见的姓氏（家族姓），常见于德国、瑞士、奥地利及其海外移民后裔。"},"examples":[{"en":"Dr. Baumann will present the research at the conference.","zh":"鲍曼博士将在会议上展示这项研究。"},{"en":"I emailed Ms. Baumann to confirm the appointment.","zh":"我给鲍曼女士发邮件确认预约。"}]},{"partOfSpeech":"n.","definition":{"en":"in specific fields, a name used in eponyms (terms named after a person) such as a ‘Baumann’ method, test, or classification, depending on the context.","zh":"在某些专业领域中，用于“人名命名术语”（以某人命名的术语），如“Baumann 方法/测试/分型”等，具体含义取决于语境。"},"examples":[{"en":"The paper compares the Baumann classification with other scoring systems.","zh":"这篇论文将鲍曼分型与其他评分体系进行比较。"},{"en":"Ask your professor which Baumann method the course refers to.","zh":"问问你的教授这门课指的是哪一种鲍曼方法。"}]}],"synonyms":["(surname) Baumann","(related surnames) Baum","Baumgartner"],"phonetic":"/ˈbaʊmən/","extraExplanation":["“Baumann”多源自德语：Baum（树）+ Mann（人），字面可理解为“与树有关的人/住在树旁的人/樵夫”等类型的职业或地名姓氏来源。","在英语语境中它通常读作 /ˈbaʊmən/，但不同家族可能会保留更接近德语的读法。"]}
{"word":"Baumbaugh","summary":{"en":"“Baumbaugh” is most commonly a surname (last name).","zh":"“Baumbaugh”最常见的用法是一个姓氏（英文姓）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), used to refer to a person or family with that last name","zh":"（姓氏）鲍姆博（Baumbaugh），用作人名的姓"},"examples":[{"en":"Ms. Baumbaugh will lead today’s meeting.","zh":"Baumbaugh 女士将主持今天的会议。"},{"en":"I’m emailing Dr. Baumbaugh about the assignment.","zh":"我正在给 Baumbaugh 博士发邮件讨论作业。"}]}],"synonyms":["(proper noun) last name","family name","surname"],"phonetic":"/ˈbɔm.bɔk/","extraExplanation":["“Baumbaugh”多见于英语语境中的姓氏，通常被认为与德语词根有关：baum（树）这一词根在许多德裔姓氏中常见。结尾“-baugh”在一些美国家族姓氏里可能是拼写演变的结果，也可能与德语/宾夕法尼亚德语（Pennsylvania Dutch）姓氏的英文化有关。","常见的相关拼写变体可能包括：Baumbach、Baumback、Baumbaugh 等；不同家族的来源与读音习惯可能略有差异。正式场合不确定读音时，可以礼貌地询问本人偏好的读法。"]}
{"word":"Baume","summary":{"en":"“Baume” is commonly seen as a French-style word meaning “balm,” and it can also refer to the Baumé scale for liquid density.","zh":"“Baume”常见作法语风格的“香膏/润肤膏”，也可指用于测量液体密度的“波美度（Baumé刻度）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in product names, from French) a balm— a soothing, soft ointment or cream used for skin or lips.","zh":"（多见于产品名，源自法语）润肤膏/香膏——用于皮肤或嘴唇、具有舒缓与滋润作用的软膏或乳霜。"},"examples":[{"en":"This baume helps soothe dry hands in winter.","zh":"这款润肤膏能在冬天舒缓干燥的双手。"},{"en":"She applied a baume to her lips before going outside.","zh":"她出门前在嘴唇上涂了润唇膏。"}]},{"partOfSpeech":"n.","definition":{"en":"(often written “Baumé” or “Baumé scale”) a measurement scale used with a hydrometer to show how dense a liquid is (common in chemistry, brewing, and winemaking).","zh":"（常写作“Baumé / Baumé scale”）波美度——用比重计测量液体密度（浓度）的一种刻度，常见于化学、酿造与葡萄酒领域。"},"examples":[{"en":"The juice measured 12 degrees Baumé before fermentation.","zh":"发酵前，这批果汁测得为 12°波美度。"},{"en":"Use a hydrometer to check the Baumé reading of the solution.","zh":"用比重计检查溶液的波美度读数。"}]}],"synonyms":["balm","ointment","salve","Baumé scale"],"phonetic":"/boʊˈmeɪ/","extraExplanation":["“Baumé”来自18世纪法国化学家 Antoine Baumé 的姓氏；英语里常见写法带重音符号é。日常生活中你看到不带重音的“baume”，多半是法语风格的产品命名，意思接近英语的 balm（香膏/润肤膏）。"]}
{"word":"baume","summary":{"en":"“Baumé (°Bé)” is a common hydrometer scale for measuring a liquid’s density, and it can also refer to the hydrometer itself.","zh":"“Baumé（°Bé，波美度）”是测量液体密度/比重的常用比重计刻度，也可指波美比重计这种仪器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A hydrometer scale used to measure the density (specific gravity) of liquids; often written as “degrees Baumé” (°Bé).","zh":"（化学）波美比重计刻度：用来测量液体密度（比重）的刻度体系，常写作“波美度”（°Bé）。"},"examples":[{"en":"The syrup is 35 degrees Baumé, so it’s quite concentrated.","zh":"这种糖浆是35波美度，所以浓度很高。"},{"en":"The lab recorded the solution’s density in °Bé using a Baumé hydrometer.","zh":"实验室用波美比重计以°Bé记录了溶液的密度。"}]},{"partOfSpeech":"n.","definition":{"en":"A Baumé hydrometer (the instrument calibrated to the Baumé scale).","zh":"波美比重计（按波美刻度校准的测量密度的仪器）。"},"examples":[{"en":"We used a Baumé to check the brine before adding the vegetables.","zh":"我们在加入蔬菜前用波美比重计测了盐水的浓度。"}]}],"synonyms":["Baumé scale","degrees Baumé","hydrometer scale"],"phonetic":"/boʊˈmeɪ/","extraExplanation":["“Baumé/波美”来自18世纪法国化学家 Antoine Baumé。波美度在传统工业里很常见，比如糖浆、盐水、酿造、化工溶液等，用来快速估计浓度或比重。","注意：波美刻度对“比水重的液体”和“比水轻的液体”有不同换算方式，所以看到°Bé时通常要结合液体类型与温度说明来理解。"]}
{"word":"Baumeister","summary":{"en":"Baumeister is most commonly a German surname; it can also mean “master builder” in German contexts.","zh":"Baumeister 最常见为德语姓氏；在德语语境中也可指“建筑大师/总建筑师”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a German surname (family name). In English, it is most often seen as the last name of specific people.","zh":"德语姓氏（家族姓）。在英语语境中多作为某些人的姓氏出现。"},"examples":[{"en":"Roy Baumeister is known for his research in social psychology.","zh":"罗伊·鲍迈斯特（Roy Baumeister）因其社会心理学研究而知名。"},{"en":"In the article, Baumeister argues that self-control can get tired over time.","zh":"在那篇文章中，鲍迈斯特提出自我控制可能会随着时间而“疲劳”。"}]},{"partOfSpeech":"n.","definition":{"en":"(from German) a “master builder” or “building master”; historically, a person in charge of construction work (used mainly in German contexts).","zh":"（源自德语）“建筑大师/总建筑师”；历史上指负责建筑工程的人（主要用于德语语境）。"},"examples":[{"en":"In German history texts, a Baumeister could oversee major building projects.","zh":"在德国历史文本中，Baumeister 可能负责监督大型建筑工程。"},{"en":"The word Baumeister literally connects to building and mastery.","zh":"Baumeister 这个词字面上与“建造”和“精通/大师”有关。"}]}],"synonyms":["family name","surname","master builder (German-context meaning)"],"phonetic":"/ˈbaʊmaɪstər/","extraExplanation":["发音提示：英语里读这个姓氏时常按德语成分来处理，Baum（“树/木”，也常被联想到“建造”相关词根）+ Meister（“大师/师傅”）。不同家庭或地区可能有不同读法，但在美式英语中常见近似为 /ˈbaʊmaɪstər/。","文化/语境：如果你是在心理学或社会科学中看到 Baumeister，最常指美国心理学家 Roy F. Baumeister（常被引用于“自我控制/意志力”等研究话题）。"]}
{"word":"baumhauerite","summary":{"en":"Baumhauerite is a rare lead–arsenic sulfosalt mineral found in some ore deposits.","zh":"Baumhauerite（鲍姆豪维石）是一种罕见的铅—砷硫盐矿物，见于部分矿床中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (a sulfosalt of lead and arsenic) that occurs in some ore deposits.","zh":"一种罕见的矿物（铅和砷的硫盐矿物），常见于某些矿床中。"},"examples":[{"en":"Baumhauerite is sometimes found alongside other lead-bearing sulfosalt minerals.","zh":"鲍姆豪维石有时会与其他含铅的硫盐矿物伴生。"},{"en":"The sample contained small crystals of baumhauerite in a gray metallic matrix.","zh":"这块样品在灰色金属质基底中含有少量鲍姆豪维石晶体。"}]}],"synonyms":["a mineral","lead–arsenic sulfosalt"],"phonetic":"/ˌbaʊmˈhaʊəraɪt/","extraExplanation":["“baumhauerite”是矿物学专用词，通常用于地质报告、矿物标本说明和学术文献中，日常英语里几乎不会出现。","词名源自人名（常见于以发现者或研究者命名的矿物）。在阅读矿物名称时，后缀“-ite”常表示“某种矿物/岩石”。"]}
{"word":"baumier","summary":{"en":"Baumier is a rare word (often from French) used to describe a balsamic, resinous, balm-like scent or taste.","zh":"Baumier 是较少见的词（常带法语色彩），用来形容香气或风味带有香脂、树脂、药膏般温润的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare; mainly in perfumery/wine writing) Having a balsamic, resinous, soothing scent or flavor; “balmy,” like balm.","zh":"（罕用；多见于香水/品酒文字）带有香脂般、树脂般、令人舒缓的香气或风味；有“香脂/药膏”气息的。"},"examples":[{"en":"The perfume opens with a baumier note of pine resin and incense.","zh":"这款香水一开始有一种带松脂与乳香气息的香脂调（baumier）。"},{"en":"Some writers describe the finish as warm and baumier, like balsam and honey.","zh":"有些作者形容它的余味温暖而带香脂感（baumier），像香脂和蜂蜜。"}]},{"partOfSpeech":"n.","definition":{"en":"A balsamic/resinous note in a scent or flavor (a “balmy” character).","zh":"香气或风味中的“香脂/树脂”调性（带“药膏般温润”的特征）。"},"examples":[{"en":"I like the baumier in this candle—it feels cozy and calming.","zh":"我喜欢这支蜡烛的香脂调（baumier），让人觉得温暖放松。"}]}],"synonyms":["balsamic","resinous","balmy","incense-like"],"phonetic":"/boʊˈmjɛr/","extraExplanation":["这个词更常见于法语语境（源自“baume/香脂、膏药”相关用词），英语里属于少见的“风味/香调描写词”，在香水、品酒笔记或香氛文案中偶尔出现。","不要和“Baumé（波美）比重计/波美度”（用于测液体密度的单位与量表）混淆；那是另一个专有名词体系。"]}
{"word":"Baun","summary":{"en":"“Baun” is usually a proper name; rarely, it can be a variant spelling of “bawn” (a walled enclosure in Irish contexts).","zh":"“Baun”通常是专有名词（人名/地名）；少数情况下可作为“bawn”的变体拼写，指爱尔兰语境中的围墙院落。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (surname or place name). It is not a common everyday English vocabulary word and usually refers to a specific person, family, or location.","zh":"专有名词（姓氏或地名）。它不是常见的日常英语词汇，通常指特定的人、家族或地点。"},"examples":[{"en":"Ms. Baun will join the meeting at 3 p.m.","zh":"Baun 女士将在下午三点参加会议。"},{"en":"They live near Baun Lake.","zh":"他们住在 Baun 湖附近。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, regional) A variant spelling of “bawn,” meaning a walled enclosure or courtyard, especially in Irish historical contexts.","zh":"（罕见/地域用法）“bawn”的一种拼写变体，指有围墙的院落或围地，常见于爱尔兰历史语境。"},"examples":[{"en":"The old tower house had a bawn to protect animals and supplies.","zh":"那座古老的塔楼旁有一圈围墙院落，用来保护牲畜和物资。"},{"en":"In some texts, you may see the spelling “baun” for “bawn.”","zh":"在一些文本中，你可能会看到用 “baun” 来拼写 “bawn”。"}]}],"synonyms":["(as a name) none","(if meaning “bawn”) enclosure","courtyard"],"phonetic":"/baʊn/","extraExplanation":["在英语里“Baun”最常见是人名/地名（大写开头）。如果你是在读历史或地理材料，且语境与爱尔兰城堡、塔楼、防御工事有关，它可能是“bawn（围墙院落）”的变体拼写。","如果你原本想查的是发音相近的词（如 bound /baʊnd/、bawn /bɔn/、bun /bʌn/），告诉我句子语境，我可以帮你确认正确拼写与意思。"]}
{"word":"baun","summary":{"en":"Baun is a regional noun meaning a walled enclosure or courtyard, especially in Irish/Scottish historical contexts.","zh":"baun 是地区性名词，指有围墙的圈地或院落，常见于爱尔兰/苏格兰的历史与建筑语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a walled enclosure, courtyard, or fort-like yard (especially in Irish/Scottish use, often around a tower house or farmhouse).","zh":"（尤见于爱尔兰/苏格兰用法）有围墙的圈地、院落；（常指塔屋或农舍周围的）防护性院子/围场。"},"examples":[{"en":"The old tower house still has a stone baun around it.","zh":"那座古老的塔屋周围仍有一圈石砌的围场（baun）。"},{"en":"They walked through the baun before entering the main building.","zh":"他们穿过院落（baun），才进入主楼。"}]}],"synonyms":["enclosure","courtyard","yard","walled yard"],"phonetic":"/bɔn/","extraExplanation":["这个词在现代日常英语里不常见，更常出现在爱尔兰的历史、建筑或地名语境中。你可能会在地名或古建筑介绍里看到（例如某些“Bawn”“Baun”相关的地名）。","词源通常与盖尔语中表示“白色/墙”的词有关，因此常与“石墙围起来的院子/圈地”这一意象联系在一起。"]}
{"word":"bauno","summary":{"en":"“bauno” isn’t a standard English word; it’s likely a misspelling (e.g., “bonus,” “banjo”) or a name.","zh":"“bauno” 不是标准英语单词；更可能是拼写错误（如 bonus、banjo）或人名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“bauno” is not a standard English word. It may be a misspelling or a name. Possible intended words include: “bonus” (extra reward), “banjo” (a musical instrument), or Italian “buono” (meaning “good”). Examples (if you meant “bonus”): 1) en: You’ll get a bonus at the end of the year. zh: 你会在年底拿到奖金。 2) en: As a bonus, the app is free. zh: 作为额外福利，这个应用是免费的。","zh":"“bauno” 不是标准英语单词，可能是拼写错误或人名。你可能想写：bonus（奖金/额外好处）、banjo（班卓琴，一种乐器），或意大利语 buono（意思是“好”）。例句（如果你想表达 bonus）：1）en: You’ll get a bonus at the end of the year. zh: 你会在年底拿到奖金。2）en: As a bonus, the app is free. zh: 作为额外福利，这个应用是免费的。"},"examples":[{"en":"Did you mean “bonus” (extra money/benefit) or “banjo” (a musical instrument)?","zh":"你想写的是 “bonus”（奖金/额外好处）还是 “banjo”（一种乐器）？"}]}],"synonyms":["bonus","banjo","buono"],"extraExplanation":["我不确定你要查的词是哪一个：能否告诉我它出现的句子、你想表达的意思，或是它来自哪种语言/名字？我就能给出准确的发音、词性和例句。"]}
{"word":"Baure","summary":{"en":"“Baure” usually refers to an Indigenous people of Bolivia and their endangered Arawakan language; it can also be a Bolivian place name (often spelled “Baures”).","zh":"“Baure”通常指玻利维亚的巴乌雷族及其濒危的阿拉瓦克语系语言；也可作玻利维亚地名（常拼作“Baures”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an Indigenous people of the Bolivian Amazon (mainly in the Beni Department).","zh":"玻利维亚亚马孙地区的原住民族之一（主要分布在贝尼省）。"},"examples":[{"en":"The Baure people have lived in the Bolivian lowlands for centuries.","zh":"巴乌雷人世世代代生活在玻利维亚的低地地区。"},{"en":"Some cultural projects aim to preserve Baure traditions and oral history.","zh":"一些文化项目致力于保护巴乌雷的传统与口述历史。"}]},{"partOfSpeech":"other","definition":{"en":"the Arawakan language traditionally spoken by the Baure people; today it is endangered.","zh":"巴乌雷人传统使用的阿拉瓦克语系语言；如今属于濒危语言。"},"examples":[{"en":"A few community classes teach Baure to younger learners.","zh":"一些社区课程向年轻学习者教授巴乌雷语。"},{"en":"Researchers have documented Baure vocabulary and stories.","zh":"研究者记录了巴乌雷语的词汇与故事。"}]},{"partOfSpeech":"other","definition":{"en":"a place name in Bolivia (e.g., the town/municipality of Baures in the Beni Department).","zh":"玻利维亚的地名（例如贝尼省的包雷斯镇／市镇）。"},"examples":[{"en":"They traveled to Baures in Beni to visit family.","zh":"他们前往贝尼省的包雷斯探亲。"}]}],"synonyms":["Baures (place-name spelling)"],"phonetic":"/ˈbaʊ.reɪ/","extraExplanation":["“Baure / Baures”常见于西班牙语语境的地名与民族／语言名称；英文中多以专有名词使用，是否加 -s（Baures）取决于具体地名或写法。","如果你原本想查的是别的英文单词（例如拼写相近的 bore / bower / barrow），告诉我上下文句子，我可以帮你确认。"]}
{"word":"baure","summary":{"en":"Baure refers to an indigenous people of Bolivia and the Arawakan language associated with them.","zh":"Baure 指玻利维亚的一个原住民族及其相关的阿拉瓦克语系语言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a people of Bolivia, and the Arawakan language traditionally spoken by them (also called Baure language)","zh":"玻利维亚的一个原住民族（鲍雷人/巴乌雷人），以及他们传统使用的一种阿拉瓦克语系语言（鲍雷语/巴乌雷语）"},"examples":[{"en":"Baure is an Arawakan language once widely spoken in the Beni region of Bolivia.","zh":"鲍雷语属于阿拉瓦克语系，过去在玻利维亚贝尼地区曾被广泛使用。"},{"en":"Some community programs aim to revitalize the Baure language and pass it on to younger generations.","zh":"一些社区项目致力于复兴鲍雷语，并把它传给年轻一代。"}]}],"synonyms":["Baure language"],"phonetic":"ˈbaʊreɪ","extraExplanation":["“Baure”在英语里通常作为专有名词使用，指一个族群或语言名称。不同资料可能会把中文译作“鲍雷/巴乌雷”，属于音译差异。","如果你原本想查的是拼写相近的英文单词（如 bore, bourse, beurre 等），告诉我你想表达的中文意思或给我一句例句，我可以帮你定位正确词。"]}
{"word":"Bauru","summary":{"en":"Bauru can mean a city in São Paulo state, Brazil, or a popular Brazilian roast-beef-and-cheese sandwich named after that city.","zh":"Bauru 可指巴西圣保罗州的包鲁市，也可指一种以该地命名的巴西包鲁三明治（常见为烤牛肉+奶酪等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in the state of São Paulo, Brazil.","zh":"（巴西）包鲁市：位于巴西圣保罗州的一座城市。"},"examples":[{"en":"Bauru is an important regional hub in the interior of São Paulo state.","zh":"包鲁是圣保罗州内陆的重要区域枢纽。"},{"en":"She took a bus from São Paulo to Bauru to visit family.","zh":"她从圣保罗乘巴士到包鲁探亲。"}]},{"partOfSpeech":"n.","definition":{"en":"A Brazilian sandwich, usually made with roast beef, melted cheese, and tomato (often on French bread), popularly associated with the city of Bauru.","zh":"包鲁三明治：一种巴西三明治，通常用烤牛肉、融化的奶酪和番茄制作（常用法棍/长面包），因与包鲁市有关而得名。"},"examples":[{"en":"I ordered a bauru with extra cheese.","zh":"我点了一份加奶酪的包鲁三明治。"},{"en":"In some cafés, a “bauru” refers to a specific roast-beef-and-cheese sandwich.","zh":"在一些咖啡馆里，“bauru”指一种特定的烤牛肉加奶酪三明治。"},{"en":"The menu lists bauru alongside other Brazilian snacks.","zh":"菜单上把包鲁三明治和其他巴西小吃一起列出。"}]}],"phonetic":"/baʊˈru/","extraExplanation":["“Bauru（包鲁）”作为三明治名称在巴西很常见，但不同地区做法会有变化：有的用火腿代替牛肉，或加入腌黄瓜、生菜等。点单时如果不确定，可以询问店里“bauru”具体包含哪些配料。","该三明治名称常被认为与包鲁市有关：传说是一位来自包鲁的顾客/学生在圣保罗的餐馆提出了特定搭配，后来这种搭配流行并以“Bauru”命名。不同来源对细节说法不一，但“以地名命名食物”的现象在英语和葡语里都很常见（如 hamburger 也带有地名色彩）。"]}
{"word":"Bausch","summary":{"en":"“Bausch” is mainly a surname, widely recognized from “Bausch + Lomb,” a major eye-health company.","zh":"“Bausch”主要是一个姓氏，最常见于“Bausch + Lomb（博士伦）”，一家知名的眼健康公司。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A surname (family name), most famously seen in the company name “Bausch + Lomb,” an American eye-health company known for contact lenses and lens-care products.","zh":"一个姓氏（家族姓），最常见于公司名“Bausch + Lomb”（博士伦），这是一家以隐形眼镜及护理产品等眼健康业务闻名的美国公司。"},"examples":[{"en":"She wears Bausch + Lomb contact lenses.","zh":"她戴的是博士伦（Bausch + Lomb）的隐形眼镜。"},{"en":"The report mentions Bausch + Lomb’s new lens-care solution.","zh":"报告提到了博士伦的新款镜片护理液。"}]},{"partOfSpeech":"other","definition":{"en":"Used as a proper name for people (e.g., a last name) in English-language contexts.","zh":"在英语语境中用作人名（例如姓氏）。"},"examples":[{"en":"Dr. Bausch will present the research today.","zh":"Bausch 博士今天将展示这项研究。"}]}],"phonetic":"/baʊʃ/","extraExplanation":["“Bausch”常被英语使用者读作 /baʊʃ/（类似“boush”），拼写看起来像英语但来源多与德语姓氏有关。","“Bausch + Lomb（博士伦）”之所以广为人知，是因为与眼镜镜片、隐形眼镜和眼部护理产品相关；在日常英语里看到“Bausch”多半是在品牌或公司名称中。"]}
{"word":"Bauske","summary":{"en":"“Bauske” is mainly used as a surname (a proper name), not a standard English word.","zh":"“Bauske”主要用作姓氏（专有名词），不是标准英语词汇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surname (family name). It is not a common English vocabulary word; you will mostly see it as a last name in records, emails, or citations.","zh":"一个姓氏（家族名）。它不是常见的英语词汇，通常只会在名单、邮件署名或引用中作为姓出现。"},"examples":[{"en":"Ms. Bauske will lead today’s meeting.","zh":"Bauske 女士将主持今天的会议。"},{"en":"If you have questions, email Dr. Bauske.","zh":"如有问题，请发邮件给 Bauske 博士。"}]}],"phonetic":"ˈbaʊski","extraExplanation":["“Bauske”更像是专有名词（人名/姓），因此一般不会像普通单词那样有固定的词义、同义词或词形变化。","读音在不同家庭/地区可能不同；上面给的是在英语环境中较常见的读法。若你指的是地名、品牌名或某个特定文本中的用法，请提供更多上下文，我可以按实际来源补充解释。"]}
{"word":"Bausman","summary":{"en":"Bausman is usually a proper noun: a surname, and also the name of a small community in Pennsylvania, USA.","zh":"Bausman 通常是专有名词：常见为姓氏，也可指美国宾夕法尼亚州的一个小社区地名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname).","zh":"一个姓氏（家族姓）。"},"examples":[{"en":"Ms. Bausman will lead today’s meeting.","zh":"Bausman 女士将主持今天的会议。"},{"en":"I met a researcher named Dr. Bausman at the conference.","zh":"我在会议上认识了一位叫 Bausman 博士的研究者。"}]},{"partOfSpeech":"other","definition":{"en":"A place name: Bausman, an unincorporated community in Pennsylvania, USA.","zh":"一个地名：美国宾夕法尼亚州的 Bausman（非建制社区）。"},"examples":[{"en":"They drove through Bausman on the way to Pittsburgh.","zh":"他们去匹兹堡的路上经过了 Bausman。"}]}],"phonetic":"/ˈbaʊzmən/","extraExplanation":["“Bausman”通常作为专有名词使用（人名/姓氏或地名），一般不翻译，只做音译或直接保留拼写。","作为姓氏时，多见于英语语境中的姓氏写法；在正式场合可用 Mr./Ms./Dr. + Bausman 称呼。","读音在不同家庭或地区可能略有差异；若用于特定人物，最好以其本人或当地习惯读法为准。"]}
{"word":"bauson","summary":{"en":"A “bosun” is a ship’s officer who supervises the deck crew and equipment; it’s a common spoken form of “boatswain.”","zh":"“bosun”指船上的水手长，负责管理甲板船员与器材；是“boatswain”的常用口语写法/拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A ship’s officer in charge of the deck crew and the ship’s equipment (also spelled “boatswain”).","zh":"（船上的）水手长；负责甲板船员与船上器材管理的高级船员（也拼作 boatswain）。"},"examples":[{"en":"The bosun assigned tasks to the deck crew before sunrise.","zh":"天还没亮，水手长就给甲板船员分配了任务。"},{"en":"Ask the bosun where to store the ropes and tools.","zh":"问问水手长绳索和工具该放在哪里。"}]}],"synonyms":["boatswain"],"phonetic":"/ˈboʊsən/","extraExplanation":["“Bauson”不是常见的英语词形；很多时候是把“bosun”听写/拼写成了“bauson”。“bosun”是“boatswain”的口语/传统拼写，来源于航海用语。"]}
{"word":"bausond","summary":{"en":"Bausond is a Scots dialect word meaning “white-faced” or “having a white blaze,” usually describing cows or horses.","zh":"Bausond 是苏格兰方言词，意思是“白面/脸上有白色额纹”，常用来形容牛或马。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Scots, dialect) Having a white blaze or white face marking (especially of a cow or horse).","zh":"（苏格兰方言）指（尤指牛或马）脸上有白色斑纹/白面（常指从额头到鼻梁的一道白纹）。"},"examples":[{"en":"A bausond cow stood near the gate, easy to spot in the dusk.","zh":"一头白面牛站在门边，黄昏里也很容易认出来。"},{"en":"He bought a bausond mare with a bright white blaze down her face.","zh":"他买了一匹白面母马，脸上有一条很显眼的白色额纹。"}]}],"synonyms":["white-faced","blazed (face-marked)"],"phonetic":"/ˈbɔːsənd/","extraExplanation":["“bausond”（也常拼作“bawsand / bawsint”）多见于苏格兰英语/苏格兰方言（Scots），在现代通用英语里很少用，更多出现在乡村描写、民谣或文学作品中。","它通常用来形容家畜的脸部白色“blaze（额纹）”。如果你想用更常见的现代英语，可以说：a cow with a white face / a horse with a white blaze.","在苏格兰文学里偶尔能见到类似词形来增加地方色彩；如果你是在诗歌或老文本里遇到它，这往往是“方言词”而不是拼错。"]}
{"word":"bauta","summary":{"en":"A bauta is a traditional Venetian mask used for anonymity, especially during Carnival.","zh":"bauta 指威尼斯传统的面具（常用于狂欢节），象征匿名与隐藏身份。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Venetian mask (often white) worn with a cloak and a tricorn hat, especially during Carnival; it traditionally helped the wearer stay anonymous","zh":"（威尼斯传统）巴乌塔面具：常与斗篷和三角帽一起佩戴，尤在狂欢节期间使用；传统上用于遮掩身份、保持匿名"},"examples":[{"en":"During the Venice Carnival, some people wear a bauta to hide their identity.","zh":"在威尼斯狂欢节期间，有些人会戴上巴乌塔面具来隐藏身份。"},{"en":"The actor appeared in a bauta and a black cloak, creating a mysterious look.","zh":"那位演员戴着巴乌塔面具、披着黑斗篷登场，显得很神秘。"}]}],"synonyms":["Venetian mask","Carnival mask"],"phonetic":"ˈbaʊtə","extraExplanation":["“Bauta”源自意大利（威尼斯）文化，不是常见英语词汇，但在谈到威尼斯狂欢节、面具传统、艺术史与旅行语境时会出现。","在历史上，bauta不仅用于节庆，有时也与“匿名参与公共生活”（如社交、政治场合）相关。文学与戏剧中常借它象征“隐藏身份、自由行动、暧昧与秘密”。"]}
{"word":"Bautain","summary":{"en":"Bautain is usually a French surname, often referring to the philosopher Louis Bautain.","zh":"Bautain通常是法语姓氏，在英语中多指哲学家路易·博坦。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A French surname; most commonly recognized in English in reference to Louis Bautain (1796–1867), a French Catholic philosopher and theologian.","zh":"一个法语姓氏；在英语语境中最常见的是指路易·博坦（Louis Bautain，1796–1867），法国天主教哲学家与神学家。"},"examples":[{"en":"The article mentions Bautain in a discussion of 19th-century Catholic philosophy.","zh":"这篇文章在讨论19世纪天主教哲学时提到了Bautain（博坦）。"},{"en":"Bautain’s ideas are sometimes compared with other French religious thinkers of his time.","zh":"Bautain（博坦）的观点有时会与同时代其他法国宗教思想家作比较。"}]}],"phonetic":"/boʊˈtæn/","extraExplanation":["“Bautain”通常不会作为普通英语词汇使用，而是作为专有名词（姓氏）出现；因此在英文文本中多见于历史、哲学或神学背景。","法语原音更接近鼻化元音（类似“bo-TÃ”），但英语里常按拼写进行近似读法。"]}
{"word":"Bautista","summary":{"en":"Bautista is most commonly a Spanish surname or given name; it can also mean “Baptist” in Spanish, especially in religious names and contexts.","zh":"Bautista最常见为西班牙语姓氏或名字；在宗教语境中也可表示西语的“Baptist（施洗者／浸礼宗）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Spanish (and Spanish-influenced) surname or given name; common in Latin America and among Spanish-speaking communities","zh":"西班牙语（及受其影响地区）常见的姓氏或名字；在拉丁美洲与西语社群中很常见"},"examples":[{"en":"José Bautista is a former Major League Baseball player.","zh":"何塞·包蒂斯塔（José Bautista）是前美国职棒大联盟球员。"},{"en":"Her last name is Bautista.","zh":"她的姓是包蒂斯塔。"}]},{"partOfSpeech":"n.","definition":{"en":"(in Spanish) “Baptist”; often used in names and religious contexts","zh":"（西班牙语）“施洗者／浸礼宗信徒（Baptist）”；常用于人名与宗教语境"},"examples":[{"en":"The church is called Iglesia Bautista in Spanish.","zh":"这座教会在西班牙语里叫“Iglesia Bautista”（浸礼会教会）。"},{"en":"Juan Bautista is the Spanish name for John the Baptist.","zh":"“Juan Bautista”是“John the Baptist（施洗约翰）”的西班牙语说法。"}]}],"synonyms":["Baptist (meaning-related)"],"phonetic":"/bɔːˈtiːstə/","extraExplanation":["“Bautista”源自西班牙语“bautizar（施洗／施浸）”，与英语“baptize（施洗）”“Baptist（浸礼宗／施洗者）”同源。","在西语文化里，“(Nombre) Bautista”常带有宗教色彩，尤其与《圣经》人物“施洗约翰（Juan Bautista）”相关。"]}
{"word":"Bautram","summary":{"en":"Bautram is most likely a rare proper name (usually a surname), not a common English vocabulary word.","zh":"Bautram 多半是较少见的专有名词（通常为姓氏），不是常见的英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare proper name (usually a surname). It may also appear as a spelling variation of similar-sounding family names, so its exact meaning depends on the specific person, family, or record.","zh":"一个较少见的专有名词（通常为姓氏）。也可能是某些发音相近姓氏的拼写变体，因此具体含义取决于对应的人、家族或文献记录。"},"examples":[{"en":"Dr. Bautram will present the research findings today.","zh":"Bautram 博士今天将展示研究结果。"},{"en":"I’m not sure if ‘Bautram’ is spelled correctly—could you confirm the surname?","zh":"我不确定“Bautram”的拼写是否正确——你能确认一下姓氏吗？"}]}],"phonetic":"ˈbaʊtrəm","extraExplanation":["“Bautram”在常见英语词典中通常不作为普通词条出现，更可能是人名/姓氏或地名的拼写。若你是在护照、成绩单、公司名录或家谱资料中看到它，建议核对来源文件（例如是否应为其他更常见的拼写）。你也可以告诉我它出现的语境（国家/地区、句子、是否为人名或地名），我可以帮你更准确地判断读音与可能的对应形式。"]}
{"word":"bautta","summary":{"en":"A bautta is a traditional Venetian full-face mask, famously worn at Carnival and historical masquerades.","zh":"Bautta是威尼斯传统的全脸面具，以狂欢节和历史化装舞会中的佩戴最为著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Venetian mask (often white) that covers the whole face and typically has a protruding chin, historically worn with a cloak and a tricorn hat","zh":"（威尼斯传统面具）“bautta（包塔）”面具，常为白色，覆盖整张脸并带有突出的下巴部位；历史上常与斗篷和三角帽一起佩戴"},"examples":[{"en":"At the Venice Carnival, some people wear a bautta with a black cloak and a tricorn hat.","zh":"在威尼斯狂欢节上，有些人会戴着bautta面具，配黑色斗篷和三角帽。"},{"en":"The museum displays a bautta used for masquerade balls in the 18th century.","zh":"博物馆展出了一副18世纪化装舞会使用过的bautta面具。"}]}],"synonyms":["Venetian mask","carnival mask","masquerade mask"],"phonetic":"/baʊˈtɑː/","extraExplanation":["“Bautta”来自意大利语/威尼斯方言，常被视为威尼斯“匿名文化”的象征：戴上它后不易辨认身份，因此过去不仅用于节庆，也可能出现在社交场合甚至政治生活中。","这种面具的下巴部位通常向前突出，佩戴者更容易说话、进食、饮酒，因此适合长时间参与舞会与公共活动。"]}
{"word":"Bautzen","summary":{"en":"Bautzen is a town in Saxony, eastern Germany, known for its medieval old town and Sorbian culture.","zh":"Bautzen（包岑）是德国东部萨克森州的一座城镇，以中世纪老城风貌和索布文化闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a town in eastern Germany (Saxony), known for its medieval old town, towers, and as a cultural center of the Sorbian (Wendish) minority; also the name of a former Nazi prison and later East German prison located there.","zh":"德国东部（萨克森州）的一座城镇，以中世纪老城与塔楼闻名，也是索布人（温德人）少数民族的重要文化中心；该地也因曾有纳粹时期及后来东德时期的监狱而为人所知。"},"examples":[{"en":"We stopped in Bautzen to see the old town and its historic towers.","zh":"我们在包岑（Bautzen）停留，去看老城和历史悠久的塔楼。"},{"en":"Bautzen is one of the cultural hubs of the Sorbian community in Germany.","zh":"包岑（Bautzen）是德国索布人社区的文化中心之一。"},{"en":"The novel mentions Bautzen to evoke the atmosphere of eastern Germany’s borderlands.","zh":"小说提到包岑（Bautzen），用来营造德国东部边境地带的氛围。"}]}],"synonyms":["Budyšin (Upper Sorbian name)"],"phonetic":"/ˈbaʊtsən/","extraExplanation":["Bautzen 的德语读音常让英语学习者困惑：字母组合 -au- 在德语里多发 /aʊ/（类似英语 now 的元音），而 -tz- 常对应清晰的 /ts/ 音。","这座城市也有索布语名称 Budyšin（上索布语），在双语路牌、节庆与传统中可见索布文化的存在。"]}
{"word":"bauxite","summary":{"en":"Bauxite is the main rock/ore used to produce aluminum.","zh":"bauxite 指“铝土矿”，是生产铝的主要矿石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A reddish-brown rock that is the main ore (source) of aluminum.","zh":"铝土矿；一种红褐色岩石，是提炼铝的主要矿石（来源）。"},"examples":[{"en":"Australia is one of the world’s largest producers of bauxite.","zh":"澳大利亚是世界上最大的铝土矿生产国之一。"},{"en":"Bauxite is refined into alumina, and then turned into aluminum metal.","zh":"铝土矿先被精炼成氧化铝（alumina），再制成金属铝。"}]}],"synonyms":["aluminum ore","aluminium ore"],"phonetic":"/ˈbɔk.saɪt/","extraExplanation":["词源与读法提示：bauxite 来自法语地名 Les Baux（法国普罗旺斯地区），最早在当地被发现并命名。英语中重音通常在第一个音节。"]}
{"word":"bauxites","summary":{"en":"“Bauxites” means more than one bauxite ore—rocks mined as the main source of aluminum.","zh":"“Bauxites”指多块/多种铝土矿，即作为铝主要来源而开采的矿石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of bauxite: a reddish-brown rock that is the main ore (source) of aluminum.","zh":"bauxite（铝土矿）的复数：一种红褐色岩石，是铝的主要矿石（来源）。"},"examples":[{"en":"Australia exports large amounts of bauxites for aluminum production.","zh":"澳大利亚出口大量铝土矿，用于生产铝。"},{"en":"The company tested several bauxites to find the best grade for refining.","zh":"公司检测了几种铝土矿，以找到最适合精炼的品位。"}]}],"synonyms":["bauxite ores","aluminum ore","aluminium ore"],"phonetic":"/ˈbɔkˌsaɪts/","extraExplanation":["“bauxite”源自法国普罗旺斯地区的Les Baux（雷博），最早在附近被发现并命名。铝土矿并不是单一矿物，而是多种含铝矿物（如水铝石、勃姆石等）的混合物，因此不同产地的铝土矿成分与颜色会有差异。"]}
{"word":"bauxitic","summary":{"en":"Bauxitic means “related to or rich in bauxite,” especially in soils or rock layers.","zh":"bauxitic 指“与铝土矿有关或富含铝土矿的”，多用于土壤或岩层描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or containing bauxite (the main ore of aluminum), often describing soil, rock, or deposits rich in aluminum minerals.","zh":"与铝土矿有关的；含有铝土矿的（常用于描述富含铝矿物的土壤、岩石或矿床）。"},"examples":[{"en":"The region has bauxitic soils formed by long-term weathering in a warm, wet climate.","zh":"该地区有铝土矿质土壤，这是在温暖潮湿气候下长期风化形成的。"},{"en":"Engineers evaluated the bauxitic layer before planning the mine.","zh":"工程师在规划矿山之前评估了铝土矿质地层。"}]}],"synonyms":["bauxite-rich","aluminum-bearing"],"phonetic":"/bɔkˈsɪtɪk/","extraExplanation":["“bauxitic”来自“bauxite（铝土矿）”。铝土矿是生产铝的重要原料，因此在地质、采矿、环境与土壤学语境中很常见。","地质文章里常见搭配：bauxitic soil（铝土矿质土壤）、bauxitic laterite（铝土矿质红土/铁铝土）、bauxitic deposit（铝土矿矿床）。"]}
{"word":"bauxitite","summary":{"en":"Bauxitite is a geology term for a rock composed mainly of bauxite (aluminum-rich) material.","zh":"Bauxitite 是地质学术语，指主要由铝土矿（富铝物质）组成的岩石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rock made mostly of bauxite minerals (aluminum-rich materials), often discussed in geology as bauxite-bearing or bauxite-derived rock.","zh":"一种主要由铝土矿矿物组成的岩石（富含铝的物质），地质学中常指含铝土矿或由铝土矿形成的岩石。"},"examples":[{"en":"The geologist mapped a layer of bauxitite above the limestone.","zh":"地质学家在石灰岩之上标绘出一层铝土岩。"},{"en":"Bauxitite can indicate past tropical weathering conditions.","zh":"铝土岩可能表明过去曾经历热带风化环境。"}]}],"synonyms":["bauxite","bauxite rock","laterite (related)"],"phonetic":"/bɑkˈsaɪtaɪt/","extraExplanation":["词形：bauxitite = bauxite（铝土矿）+ -ite（常见于矿物/岩石名称的后缀，表示“某种矿物或岩石”）。","用法提示：这个词非常专业，在一般英语里更常见的是 bauxite（铝土矿）。在地质报告或学术语境中才更可能看到 bauxitite。","背景：铝土矿是提炼铝的重要原料；“bauxitite”强调的是“岩石/岩相”层面的称呼，而不只是矿石商品名。"]}
