{"word":"Bav","summary":{"en":"“Bav” is most commonly an abbreviation for Bavaria, and sometimes an informal short form of “Bavarian.”","zh":"“Bav”最常见是“Bavaria（巴伐利亚）”的缩写，有时也可作“Bavarian（巴伐利亚的/巴伐利亚人）”的非正式简称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Bavaria (a federal state in southeast Germany); used in writing, maps, or formal names (e.g., “Bav. State Library”).","zh":"（缩写）巴伐利亚（德国东南部的一个联邦州）；常见于书面语、地图或机构名称中（如“巴伐利亚州立图书馆”）。"},"examples":[{"en":"Munich is the capital of Bav. (Bavaria).","zh":"慕尼黑是巴伐利亚（Bav.）的首府。"},{"en":"The exhibition is hosted by the Bav. State Museum.","zh":"该展览由巴伐利亚州立博物馆主办。"}]},{"partOfSpeech":"other","definition":{"en":"(informal) Short for “Bavarian” (a person from Bavaria or something related to Bavaria).","zh":"（非正式）“Bavarian（巴伐利亚的/巴伐利亚人）”的简称。"},"examples":[{"en":"He’s a Bav, so he grew up in southern Germany.","zh":"他是巴伐利亚人，所以在德国南部长大。"},{"en":"We tried some Bav food like pretzels and sausages.","zh":"我们尝了一些巴伐利亚食物，比如椒盐卷饼和香肠。"}]}],"synonyms":["Bavaria (full form)","Bavarian (full form)"],"phonetic":"/bæv/","extraExplanation":["“Bav.”更常见于书面缩写（尤其是地名、机构名、学术引用或地图标注）。日常口语里，人们通常直接说“Bavaria / Bavarian”，单独说“a Bav”相对少见，可能出现在较随意或特定语境中。"]}
{"word":"bavardage","summary":{"en":"Bavardage means light, casual chatter, sometimes suggesting talk that is unnecessary or not very serious.","zh":"bavardage 指轻松的闲聊/聊天，有时暗示内容不重要或多余的“话多”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"light, casual talk; chatter (often implying a lot of talking without much substance)","zh":"闲聊；喋喋不休的聊天（常带有“话多但内容不重要”的含义）"},"examples":[{"en":"The meeting was delayed by unnecessary bavardage.","zh":"会议因为不必要的闲聊而被耽搁了。"},{"en":"I enjoy a little bavardage over coffee with friends.","zh":"我喜欢和朋友喝咖啡时随便聊聊天。"},{"en":"Please keep the bavardage down during the lecture.","zh":"上课期间请不要闲聊。"}]}],"synonyms":["chatter","small talk","babble","idle talk","banter"],"phonetic":"/ˌbævərˈdɑʒ/","extraExplanation":["这是法语词，来自法语动词 *bavarder*（闲聊、唠嗑）。在英语里它属于较“文雅/书面”的借用词，常用于写作中带一点风格感，表达“闲聊、碎碎念”的氛围。","语气上通常比 *conversation*（对话）更轻、更随意；有时也会暗示“话多、分散注意力”，接近 *chatter* / *small talk*。"]}
{"word":"Bavaria","summary":{"en":"Bavaria is a state in southeast Germany; historically, it was also a kingdom/territory in older European history.","zh":"Bavaria 指德国东南部的联邦州“巴伐利亚”；在历史语境中也可指曾经的巴伐利亚王国/领地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A federal state (region) in southeast Germany, famous for Munich, the Alps, and traditions like Oktoberfest.","zh":"巴伐利亚（德国东南部的联邦州/地区），以慕尼黑、阿尔卑斯山以及啤酒节等传统闻名。"},"examples":[{"en":"Munich is the capital of Bavaria.","zh":"慕尼黑是巴伐利亚的首府。"},{"en":"She traveled through Bavaria to see castles and mountain villages.","zh":"她穿越巴伐利亚，去看城堡和山间村庄。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical) A kingdom/territory in Central Europe; in older texts it may refer to the former Kingdom of Bavaria.","zh":"（历史）中欧的一个王国/领地；在旧文献中可指“巴伐利亚王国”。"},"examples":[{"en":"In the 19th century, Bavaria was a kingdom within the German states.","zh":"在19世纪，巴伐利亚是德意志诸邦中的一个王国。"},{"en":"The novel is set in a rural corner of Bavaria before German unification.","zh":"这部小说的背景设定在德国统一前的巴伐利亚乡村一隅。"}]}],"synonyms":["Bayern (German name)"],"phonetic":"/bəˈvɛriə/","extraExplanation":["“Bavaria”对应德语“Bayern”。英语中“Bavarian”表示“巴伐利亚的/巴伐利亚人”，例如：Bavarian culture（巴伐利亚文化）、a Bavarian accent（巴伐利亚口音）。","文化联想：英语语境里提到Bavaria常让人想到啤酒与啤酒馆文化、传统服饰（如Lederhosen/Dirndl）、以及新天鹅堡（Neuschwanstein）等。"]}
{"word":"Bavarian","summary":{"en":"Bavarian means “from Bavaria in southern Germany,” or a person from Bavaria.","zh":"Bavarian 指“巴伐利亚的（德国南部）”，也可指“巴伐利亚人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Bavaria (a state in southern Germany), its people, or its culture.","zh":"与巴伐利亚（德国南部的一个州）及其人民或文化有关的；巴伐利亚的。"},"examples":[{"en":"We tried Bavarian food like pretzels and roast pork.","zh":"我们尝了巴伐利亚食物，比如椒盐脆饼和烤猪肉。"},{"en":"She studies Bavarian traditions and folk music.","zh":"她研究巴伐利亚的传统和民间音乐。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Bavaria.","zh":"巴伐利亚人（来自巴伐利亚的人）。"},"examples":[{"en":"He’s a Bavarian who moved to Berlin for work.","zh":"他是巴伐利亚人，为了工作搬到了柏林。"}]}],"synonyms":["from Bavaria","Bavaria-related"],"phonetic":"/bəˈveriən/","extraExplanation":["“Bavarian”常让人联想到慕尼黑（Munich）、啤酒花园（beer gardens）和十月节（Oktoberfest）。不过巴伐利亚文化很多元，既有城市文化也有乡村传统。","语言方面，“Bavarian”有时也指“巴伐利亚方言/语言”（Bavarian dialect），属于德语的方言群；但在一般英语语境里，多数时候指“巴伐利亚的（文化/人）”。"]}
{"word":"bavarian","summary":{"en":"Bavarian means “from Bavaria (southern Germany)” and can describe its culture/dialect, or a person from there.","zh":"Bavarian 表示“来自德国南部巴伐利亚的”，可形容其文化/方言，也可指巴伐利亚人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Bavaria, a state in southern Germany, or to its people, culture, or dialects.","zh":"（与）巴伐利亚（德国南部一州）有关的；（与）巴伐利亚人、文化或方言有关的。"},"examples":[{"en":"We tried Bavarian food like pretzels and white sausages.","zh":"我们尝了巴伐利亚美食，比如椒盐卷饼和白香肠。"},{"en":"She speaks a Bavarian dialect at home.","zh":"她在家里说一种巴伐利亚方言。"},{"en":"The museum has a collection of Bavarian folk art.","zh":"那家博物馆收藏了一批巴伐利亚民间艺术品。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Bavaria.","zh":"巴伐利亚人。"},"examples":[{"en":"Many Bavarians celebrate local festivals with traditional music and clothing.","zh":"许多巴伐利亚人会用传统音乐和服饰来庆祝本地节日。"}]}],"synonyms":["Bavaria-related","from Bavaria"],"phonetic":"/bəˈvɛriən/","extraExplanation":["“Bavarian”来自“Bavaria”（德语 Bayern）。在英语语境里常见搭配有 Bavarian culture/food/beer/dialect。需要注意的是，“Bavarian”既可指地区文化（如慕尼黑、阿尔卑斯地区的传统），也可指语言上的“巴伐利亚方言/口音”，与标准德语（Standard German）有所不同。","文化提示：英语中提到“Bavarian”时，常会联想到 Oktoberfest（啤酒节）、lederhosen（皮短裤）、dirndl（传统连衣裙）等符号，但巴伐利亚文化本身比这些刻板印象更丰富多样。"]}
{"word":"bavarois","summary":{"en":"Bavarois is a French term for Bavarian cream—a chilled, molded creamy dessert.","zh":"bavarois 指“巴伐利亚奶油”，一种冷食、可定型脱模的奶油甜点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cold, creamy dessert (Bavarian cream), usually made with milk/cream, eggs, sugar, gelatin, and flavoring, served set in a mold or as a filling.","zh":"（法语借词）巴伐利亚奶油甜点；一种冷食奶油布丁/慕斯类甜品，常用牛奶/奶油、鸡蛋、糖、明胶和香草等调味制成，凝固后脱模食用或作夹馅。"},"examples":[{"en":"For dessert, we had a vanilla bavarois topped with fresh berries.","zh":"甜点我们吃了香草口味的巴伐利亚奶油，上面配了新鲜莓果。"},{"en":"The chef piped bavarois into the tart shells as a light, creamy filling.","zh":"主厨把巴伐利亚奶油挤进塔皮里，作为轻盈绵密的内馅。"}]}],"synonyms":["Bavarian cream","bavarian crème","cream dessert"],"phonetic":"/ˌbævəˈrwɑː/","extraExplanation":["“bavarois”来自法语，字面意思与“巴伐利亚（Bavaria）”有关，英语里常等同于“Bavarian cream”。在菜单上看到它，通常指一种用明胶定型、口感介于布丁与慕斯之间的冷甜点。"]}
{"word":"bavaroise","summary":{"en":"A chilled molded dessert made from flavored custard mixed with whipped cream (often set with gelatin).","zh":"一种将调味蛋奶糊与打发奶油混合并冷藏定型的甜点（常用吉利丁凝固）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A light, chilled dessert made by combining a flavored custard (often with gelatin) with whipped cream, then letting it set in a mold; also called Bavarian cream.","zh":"（冷藏）巴伐利亚奶油甜点：把调味的蛋奶糊（常加入吉利丁）与打发奶油混合后冷却凝固，通常用模具定型；也叫“Bavarian cream”。"},"examples":[{"en":"For dessert, they served a vanilla bavaroise topped with fresh berries.","zh":"甜点上，他们端出香草巴伐利亚奶油，上面点缀新鲜莓果。"},{"en":"The chef poured the mixture into a mold and chilled the bavaroise overnight.","zh":"厨师把混合物倒入模具中，让巴伐利亚奶油冷藏一整夜凝固。"}]}],"synonyms":["Bavarian cream","Bavarian crème"],"phonetic":"/ˌbævəˈrwɑːz/","extraExplanation":["“bavaroise”是法语词（意为“巴伐利亚式的”），在甜点语境里专指一种“蛋奶糊＋打发奶油（常加吉利丁）”的冷藏定型甜品。英语里更常见的说法是“Bavarian cream”。","在菜单上看到bavaroise时，多半指可切块、成型的冷甜点；而“Bavarian cream”有时也可指用作泡芙/甜甜圈的馅料（质地更偏可挤的奶油馅）。"]}
{"word":"bavaroy","summary":{"en":"“bavaroy” is not standard; it likely means “bavarois,” a Bavarian-cream-style dessert.","zh":"“bavaroy”不常见，可能是“bavarois”的误拼，指一种类似巴伐利亚奶油的定型甜点。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“bavaroy” is not a standard English word. It is most likely a misspelling of “bavarois,” a French word used in English for a creamy, molded dessert (a type of Bavarian cream).","zh":"“bavaroy”不是标准英文词。它很可能是“bavarois”的拼写错误；“bavarois”在英文中常用来指一种奶油质地、通常会定型成模具形状的甜点（类似巴伐利亚奶油）。"},"examples":[{"en":"The menu lists a mango bavarois for dessert.","zh":"菜单上甜点有芒果 bavarois（巴伐利亚奶油甜点）。"},{"en":"She made a strawberry bavarois in a round mold.","zh":"她用圆形模具做了草莓 bavarois（定型奶油甜点）。"}]}],"synonyms":["bavarois","Bavarian cream"],"phonetic":"/ˌbævəˈrwɑː/","extraExplanation":["“Bavarois”是法语词，字面意思与“巴伐利亚（Bavaria）”相关，因此英文里也常说“Bavarian cream（巴伐利亚奶油）”。如果你想表达“巴伐利亚的/巴伐利亚人”，更常用的英文是“Bavarian（adj./n.）”。","如果你告诉我你是在菜单、姓名、品牌还是游戏/小说里看到“bavaroy”，我也可以帮你判断它最可能指什么以及正确拼写。"]}
{"word":"bavary","summary":{"en":"Bravery means courage—being brave in the face of fear or danger.","zh":"Bravery 指勇气——在恐惧或危险面前表现勇敢。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended: **bravery**) the quality of being brave; courage, especially when facing danger, fear, or difficulty.","zh":"（可能想写：**bravery**）勇敢；勇气，尤指在面对危险、恐惧或困难时的勇敢。"},"examples":[{"en":"It takes bravery to tell the truth when you might be judged.","zh":"在可能被评判的时候说出真相需要勇气。"},{"en":"The firefighters showed great bravery during the rescue.","zh":"消防员在救援中表现出极大的勇敢。"},{"en":"She admired his quiet bravery in difficult times.","zh":"她敬佩他在艰难时期那种沉静的勇气。"}]}],"synonyms":["courage","valor","boldness","fearlessness"],"phonetic":"/ˈbreɪvəri/","extraExplanation":["“bavary”常见是拼写错误，最接近的常用词是 **bravery**（勇敢）。如果你其实想问的是 **Bavaria**（德国的“巴伐利亚”），告诉我上下文（句子/主题），我可以改为解释那个词。"]}
{"word":"bavenite","summary":{"en":"Bavenite is a rare zeolite mineral found in rock cavities.","zh":"Bavenite 是一种罕见的沸石族矿物，常见于岩石空洞中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (a zeolite) that is typically pale yellow to colorless and forms in cavities of rocks; it is a calcium beryllium aluminosilicate.","zh":"一种罕见矿物（沸石族），通常呈浅黄色至无色，常在岩石空洞中生成；其成分为含铍的钙铝硅酸盐。"},"examples":[{"en":"Bavenite is most often studied by mineral collectors and geologists rather than used in everyday products.","zh":"Bavenite 多见于矿物收藏与地质研究领域，而不是日常用品中。"},{"en":"The specimen contained bavenite crystals growing inside a small cavity of the host rock.","zh":"这块标本里有 bavenite 晶体，生长在围岩的小空洞中。"}]}],"synonyms":["(no common synonyms)"],"phonetic":"ˈbævəˌnaɪt","extraExplanation":["Bavenite 的名称来自意大利的 Baveno（巴韦诺），早期在当地被识别与描述，因此以地名命名。","它常与沸石类矿物一起出现在火成岩或变质岩的裂隙/空洞中；在地质语境里更常见。"]}
{"word":"bavette","summary":{"en":"Bavette is a thin, flavorful French-style cut of beef steak, often similar to flank or skirt steak.","zh":"bavette通常指一种法式常见的薄切、风味浓郁的牛排部位，常与腹胁或裙边牛排相近。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a thin, flavorful cut of beef steak (often called “bavette steak”), usually taken from the flank or nearby area and commonly used in French-style cooking","zh":"（牛肉的）“bavette”牛排，一种较薄但风味浓郁的牛肉部位，常来自腹胁/腹侧一带，常见于法式料理"},"examples":[{"en":"We ordered bavette with fries and a pepper sauce.","zh":"我们点了bavette牛排，配薯条和胡椒酱。"},{"en":"Bavette is best cooked quickly on high heat and sliced against the grain.","zh":"bavette最好用大火快速煎烤，然后逆着纹理切片。"},{"en":"The butcher recommended bavette as a cheaper alternative to skirt steak.","zh":"肉铺老板推荐bavette，作为裙边牛排更实惠的替代选择。"}]}],"synonyms":["bavette steak","flank steak (often similar)","skirt steak (often similar)"],"phonetic":"/bəˈvɛt/","extraExplanation":["“Bavette”是法语词，原意与“围嘴/围裙”有关；在料理里常指形状像“围裙”的一块薄牛肉，因此英文菜单上多指“bavette steak”。","不同国家/肉铺的分割方式可能不完全一致：有时bavette会被归到flank（腹胁）或与skirt steak（裙边牛排）相近的部位；点餐或购买时可以询问具体来自哪里以及推荐的熟度。","口感要点：这类部位纤维较明显，切的时候“逆纹切（against the grain）”会更嫩。"]}
{"word":"baviaantje","summary":{"en":"“Baviaantje” is a South African term meaning “little/young baboon,” and can also be a playful word for a mischievous child.","zh":"“baviaantje”是南非用语，意思是“小/幼年狒狒”，也可戏称“调皮捣蛋的孩子”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South African English/Afrikaans borrowing) A small baboon; a young baboon. (Literally “little baboon.”)","zh":"（南非英语/南非荷兰语借词）小狒狒；幼年狒狒。（字面意思是“狒狒宝宝/小狒狒”。）"},"examples":[{"en":"We saw a baviaantje clinging to its mother near the roadside.","zh":"我们在路边看到一只小狒狒紧紧抱着它的妈妈。"},{"en":"The ranger warned us not to feed the baviaantjes.","zh":"护林员警告我们不要喂小狒狒。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, regional) A cheeky or mischievous child (used playfully).","zh":"（非正式、地区用法）调皮捣蛋的孩子（多为开玩笑的称呼）。"},"examples":[{"en":"Come here, you little baviaantje—what are you up to?","zh":"过来呀，你这个小捣蛋鬼——又在搞什么？"},{"en":"He’s a real baviaantje when he’s bored.","zh":"他一无聊就特别调皮。"}]}],"synonyms":["baby baboon","young baboon","little rascal (figurative)"],"phonetic":"/ˌbɑːviˈɑːntʃi/","extraExplanation":["“baviaantje”常见于南非语境，源自南非荷兰语（Afrikaans）：baviaan（狒狒）+ -tjie（常见的小称/指小后缀，相当于英语的 “-let” 或口语里的 “little”）。","在南非野外旅游或关于开普敦附近（如开普半岛）狒狒出没的报道中，可能会看到这个词。对游客提示通常强调：不要投喂、保持距离、注意食物管理。"]}
{"word":"Bavian","summary":{"en":"Bavian is a South African word meaning “baboon,” and it can also be an insulting term for a badly behaved person.","zh":"Bavian 是南非常用词，意思是“狒狒”；也可作辱骂用语，指没教养或行为粗鲁的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South African English) A baboon; especially the chacma baboon.","zh":"（南非英语）狒狒；尤指大狒狒（chacma baboon）。"},"examples":[{"en":"We saw a troop of bavian near the roadside in the Cape.","zh":"我们在开普地区的路边看到一群狒狒。"},{"en":"Don’t feed the bavian—they can become aggressive around people.","zh":"别喂狒狒——它们在靠近人时可能会变得有攻击性。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, sometimes offensive) A rude term for a foolish, badly behaved, or ugly person.","zh":"（非正式用语，部分语境可能冒犯）用来骂人，指愚蠢、粗鲁没教养或难看的人。"},"examples":[{"en":"He called the referee a ‘bavian’ and got sent off.","zh":"他骂裁判“bavian”，结果被罚下场。"},{"en":"Try not to use words like ‘bavian’ for people—it can be insulting.","zh":"尽量别用“bavian”来形容人——这可能很侮辱人。"}]}],"synonyms":["baboon","chacma baboon"],"phonetic":"/ˈbɑviən/","extraExplanation":["“bavian”源自南非的南非荷兰语（Afrikaans），本义就是“狒狒”。在南非英语里也常见，属于明显的地域用词。","当它被用来骂人时，通常带有“像狒狒一样粗鲁/没教养”的贬义；对不熟悉当地文化的人来说容易显得不礼貌，建议谨慎使用。"]}
{"word":"bavian","summary":{"en":"Babian means a baboon (especially in South African English), and informally it can be an insulting word for a stupid or badly behaved person.","zh":"Babian 指“狒狒”（尤见于南非英语）；口语中也可作侮辱性用语，指“蠢人/行为粗鲁的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a baboon (a kind of large monkey), especially in South African English","zh":"狒狒（大型猴类），尤用于南非英语"},"examples":[{"en":"Tourists were warned not to feed the babians near the picnic area.","zh":"游客被提醒不要在野餐区附近喂狒狒。"},{"en":"A babian sat on the roadside, watching the cars go by.","zh":"一只狒狒坐在路边，看着汽车驶过。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, offensive) a stupid or badly behaved person","zh":"（非正式，带侮辱性）蠢人；行为粗鲁的人"},"examples":[{"en":"Don’t be a babian—think before you speak.","zh":"别像个蠢人一样——说话前先想想。"},{"en":"He called the referee a “babian,” which started an argument.","zh":"他骂裁判是“babian”，结果引发了争吵。"}]}],"synonyms":["baboon","primate","(informal, offensive) idiot","(informal, offensive) fool"],"phonetic":"/ˈbɑːviən/","extraExplanation":["“babian”主要见于南非语境，来自南非荷兰语（Afrikaans）baviaan（=baboon）。在南非英语里它既可指动物，也可作骂人话；第二种用法语气很冲，可能冒犯他人，学习者应谨慎使用。"]}
{"word":"baviere","summary":{"en":"“Bavière” is the French name for Bavaria, a state in southeastern Germany.","zh":"“Bavière”是“巴伐利亚”的法语名称，指德国东南部的一个联邦州。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun; French spelling) Bavaria, a state (federal region) in southeastern Germany.","zh":"（专有名词；法语拼写）巴伐利亚，德国东南部的一个联邦州。"},"examples":[{"en":"Munich is the capital of Bavaria (French: Bavière).","zh":"慕尼黑是巴伐利亚（法语：Bavière）的首府。"},{"en":"She studied the history of Bavaria in the 19th century.","zh":"她研究了19世纪巴伐利亚的历史。"}]}],"synonyms":["Bavaria","Bayern"],"phonetic":"/bəˈvɛriə/","extraExplanation":["“Bavière”是法语中对“Bavaria（巴伐利亚）”的写法与称呼；英语里更常用“Bavaria”，德语为“Bayern”。","巴伐利亚以慕尼黑（Munich）、新天鹅堡（Neuschwanstein Castle）以及啤酒文化与慕尼黑啤酒节（Oktoberfest）闻名。"]}
{"word":"bavin","summary":{"en":"Bavin means a bundle of dry sticks used for fuel, especially to start a fire.","zh":"Bavin 指一捆用来当燃料的枯枝细柴，常用于引火生火。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bundle of dry sticks, twigs, or brushwood used as fuel (often for lighting a fire).","zh":"（常指用来生火的）一捆枯枝、细柴、灌木枝条。"},"examples":[{"en":"They gathered bavins to start the fire before nightfall.","zh":"他们捡来一捆细柴，好在天黑前生火。"},{"en":"In older stories, a bavin often burns quickly and helps larger logs catch.","zh":"在一些较早的故事里，“bavin”常指燃得很快、用来引燃大木柴的一捆细枝。"}]}],"synonyms":["kindling","bundle of sticks","brushwood","twigs"],"phonetic":"/ˈbævɪn/","extraExplanation":["“bavin”是较古老、偏英式/方言色彩的词，现代英语更常说“bundle of sticks / kindling / faggot（英式旧用法）”。","它常出现在历史文本、乡村生活描写或文学作品中，用来营造“旧时生火取暖”的生活场景。注意：英式英语里“faggot”在不同语境可能有冒犯含义，学习时更安全的替代说法是“kindling”。"]}
{"word":"Bavius","summary":{"en":"Bavius is the name of a mocked Roman poet and, by extension, a literary label for a bad poet or hack writer.","zh":"Bavius 原指一位被嘲讽的古罗马诗人；引申可指蹩脚诗人或拙劣写手。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A minor Roman poet (1st century BCE) mocked by other poets; his name became associated with poor poetry.","zh":"巴维乌斯（Bavius）：古罗马一位小诗人（公元前1世纪），常被其他诗人嘲讽；其名字后来与“拙劣诗作”联系在一起。"},"examples":[{"en":"In Virgil’s poetry, Bavius is mentioned as a writer people joke about.","zh":"在维吉尔的诗中，Bavius 被提到，常作为人们拿来开玩笑的写作者。"},{"en":"Some critics treat Bavius as a symbol of forgettable verse.","zh":"一些评论家把 Bavius 当作“乏善可陈的诗句”的象征。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative, literary) A bad poet or hack writer; a person whose writing is widely considered poor.","zh":"（文学性引申）拙劣的诗人；蹩脚写手（作品被普遍认为很差的人）。"},"examples":[{"en":"He dismissed the new poet as a mere Bavius.","zh":"他把那位新诗人贬为不过是个“Bavius”式的蹩脚诗人。"},{"en":"Don’t be a Bavius—revise your lines until they sound natural.","zh":"别当“Bavius”——把句子反复修改到读起来自然为止。"}]}],"synonyms":["poetaster","hack (writer)","bad poet"],"phonetic":"/ˈbeɪviəs/","extraExplanation":["Bavius 之所以出名，主要不是因为作品流传，而是因为被罗马大诗人维吉尔（Virgil）在《牧歌》（Eclogues）中点名嘲讽；后来一些作家也沿用他和另一位常被并提的 Maevius 作为“烂诗人”的代称。","现代英语里把某人叫作 “a Bavius” 属于较少见、偏文学的用法，带有古典典故色彩；更日常的说法通常是 hack writer、bad poet、poetaster（贬义）。"]}
{"word":"Bavon","summary":{"en":"“Bavon” is usually a name (proper noun), not a common English word.","zh":"“Bavon”通常是人名等专有名词，不是常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (surname or given name). It is not a common English vocabulary word and usually refers to a person, brand, or character name.","zh":"专有名词（姓氏或名字）。它不是常见英语词汇，通常用来指某个人、品牌或角色名。"},"examples":[{"en":"Bavon Lewis started the meeting with a short introduction.","zh":"Bavon Lewis 用一段简短的介绍开始了会议。"},{"en":"I saw the name Bavon on the guest list.","zh":"我在宾客名单上看到了 Bavon 这个名字。"}]}],"synonyms":["proper name","personal name"],"phonetic":"/ˈbævɑn/","extraExplanation":["“Bavon”在主流英语词典里一般不作为常用词条出现，因此更可能是人名/姓氏、公司或产品名、游戏/小说角色名，或是其他词的拼写误差。","如果你本来想查的是发音相近或拼写相似的词，可能是：Bavaria（巴伐利亚）、Bavarian（巴伐利亚的）、baton（指挥棒/接力棒）、baron（男爵）。你可以告诉我它出现的句子/语境，我可以帮你确认最可能的意思。"]}
{"word":"bavoso","summary":{"en":"Bavoso is an Italian word meaning “slobbery/drooling,” and informally it can describe a sleazy, creepy person or behavior.","zh":"bavoso 是意大利语，原意是“流口水的/满是口水的”，口语中也可形容“猥琐、油腻、令人不适”的人或言行。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Italian loanword) Slobbery; drooling; covered with saliva.","zh":"（意大利语借词）流口水的；满是口水的。"},"examples":[{"en":"The baby was bavoso after chewing on the toy.","zh":"宝宝咬玩具后弄得满是口水（bavoso）。"},{"en":"His bavoso kiss made her pull away.","zh":"他那种带着口水的亲吻让她立刻躲开了。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, Italian) A sleazy or creepy person; someone who behaves in a gross, overly sexual, or “slimy” way.","zh":"（非正式，意大利语）令人恶心/猥琐的人；行为“油腻”、带有骚扰意味的人。"},"examples":[{"en":"She warned her friends that he was a real bavoso.","zh":"她提醒朋友们：他真的是个很猥琐的人（bavoso）。"},{"en":"Don’t be bavoso—stop making comments about people’s bodies.","zh":"别那么猥琐——别对别人的身材评头论足。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal, Italian) Sleazy; creepy; “slimy” in behavior or tone.","zh":"（非正式，意大利语）猥琐的；油腻的；令人不适的（多指言行）。"},"examples":[{"en":"That was a bavoso joke, and it made everyone uncomfortable.","zh":"那个笑话太猥琐了，让大家都很不舒服。"},{"en":"He kept sending bavoso messages late at night.","zh":"他半夜一直发很油腻/猥琐的信息。"}]}],"synonyms":["slobbery","drooly","slimy","sleazy","creepy","gross"],"phonetic":"/bɑˈvoʊzoʊ/","extraExplanation":["“bavoso”主要是意大利语词，在英语里不算常见；你更可能在意大利语语境、字幕、或意大利社交媒体里看到它。","字面意思和“口水/黏液”有关，所以引申到形容人的言行“黏糊糊、让人反感”，常带有“性骚扰式的油腻/猥琐”语气。","在英语里表达类似意思，更常用的词有：creepy, sleazy, gross, slimy；形容“流口水”则常用 drooly / slobbery。"]}
