{"word":"baw","summary":{"en":"“Baw” is mainly a dialect word meaning “ball,” and it can also be an informal spelling of “bawl” (to cry loudly).","zh":"“baw”主要是方言词，表示“球”；也可作非正式拼写，等同于“bawl”（大声哭喊）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scotland, Northern England) a ball; especially a child’s play ball.","zh":"（苏格兰、英格兰北部方言）球；尤指孩子玩的球。"},"examples":[{"en":"The kids were kicking a baw around the yard.","zh":"孩子们在院子里踢着一个球玩。"},{"en":"He threw the baw to his brother.","zh":"他把球扔给了他哥哥。"}]},{"partOfSpeech":"v.","definition":{"en":"(Dialect/Informal spelling) to cry loudly; a spelling variant of “bawl.”","zh":"（方言/非正式拼写）大声哭喊；相当于 “bawl” 的一种拼写。"},"examples":[{"en":"The baby started to baw when it got hungry.","zh":"宝宝一饿就开始大哭。"},{"en":"He was bawing with laughter.","zh":"他笑到大声嚷叫/大笑不止。"}]}],"synonyms":["ball","bawl"],"phonetic":"/bɔ/","extraExplanation":["“baw”作“球”时主要见于苏格兰英语（Scots）与英格兰北部口语/文学写作，用来营造地方色彩；在标准美式英语里通常说“ball”。","“baw”作动词多是对“bawl”的口语化拼写（常见于对白、方言书写或歌词），正式写作里建议用“bawl”。"]}
{"word":"bawarchi","summary":{"en":"“Bawarchi” means a (South Asian) cook or chef, often one who cooks Indian/Pakistani food.","zh":"“Bawarchi”指（南亚语境中的）厨师/做饭的人，常带有印度或巴基斯坦料理的语感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English) a cook or chef, especially a professional who prepares food in an Indian/Pakistani style.","zh":"（南亚英语）厨师、做饭的人，尤指擅长印度/巴基斯坦风味的专业厨师。"},"examples":[{"en":"We hired a bawarchi to cook for the wedding guests.","zh":"我们请了一位bawarchi为婚礼宾客做饭。"},{"en":"The restaurant’s bawarchi makes excellent biryani.","zh":"这家餐馆的bawarchi做的印度香饭（biryani）非常棒。"}]}],"synonyms":["cook","chef","caterer"],"phonetic":"/bəˈwɑːrtʃi/","extraExplanation":["“Bawarchi”常见于印度、巴基斯坦等地的英语语境里，带有明显的南亚文化色彩；在更通用的国际英语中，通常用“cook / chef”。","词源上与波斯语—乌尔都语/印地语传统有关，历史上常指宫廷或富裕家庭中的专职厨师。","“Bawarchi”也是一部印度经典电影的片名（《Bawarchi》，1972），因此在流行文化中也常被认作“厨师”的象征称呼。"]}
{"word":"bawbee","summary":{"en":"A Scots word for a small, low-value coin; often used to mean “a tiny amount of money.”","zh":"苏格兰用语，指小面值硬币，常引申为“少得可怜的一点钱”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scotland, historical) A small Scottish coin of low value; by the 18th century it commonly meant a halfpenny, and more generally “a small amount of money.”","zh":"（苏格兰，历史用语）一种面值很小的苏格兰硬币；到18世纪常指“半便士”，也可泛指“一点点钱”。"},"examples":[{"en":"I haven’t a bawbee left till payday.","zh":"发薪日前我一文不剩。"},{"en":"He wouldn’t spend a bawbee more than he had to.","zh":"他能省则省，连一点小钱都不愿多花。"},{"en":"In old Scots stories, a bawbee could buy something small at the market.","zh":"在一些老苏格兰故事里，一枚 bawbee 还能在集市上买点小东西。"}]}],"synonyms":["penny","halfpenny","small change","not a cent (similar meaning)"],"phonetic":"/ˈbɔːbi/","extraExplanation":["“bawbee”主要出现在苏格兰英语（Scots）与较老的文学/民间故事里，带有明显地域色彩；在现代日常英语里很少用，更多是为了营造“苏格兰风味”或时代感。","它常被用来夸张表达“钱很少/完全没钱”（not a bawbee），语气类似于美式英语里的“not a cent”。"]}
{"word":"bawbees","summary":{"en":"“Bawbees” is a Scottish word meaning small coins or a tiny amount of money (originally a Scottish halfpenny).","zh":"“bawbees”是苏格兰用词，表示零钱或很少的钱（原指苏格兰的半便士硬币）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scotland, informal) Small coins or a very small amount of money; historically, a Scottish halfpenny coin.","zh":"（苏格兰口语）零钱；很少的钱；历史上指一种苏格兰的半便士硬币。"},"examples":[{"en":"I’ve not got a bawbee on me—can you spot me the bus fare?","zh":"我身上一文钱都没有——你能先借我车费吗？"},{"en":"He won’t spend a bawbee more than he has to.","zh":"能省则省，他一分钱都不愿多花。"},{"en":"She didn’t make a bawbee from the deal.","zh":"这笔交易她一分钱都没赚到。"}]}],"synonyms":["small change","pennies","a penny","ha'penny","loose change"],"phonetic":"/ˈbɔːbiz/","extraExplanation":["“bawbee / bawbees”是典型的苏格兰英语（Scots）用词，常见于带地方色彩的对白、民谣或文学中，用来营造“很穷/很抠门/只是零钱”的语感。","常见固定说法：not have a bawbee（身无分文）、not worth a bawbee（不值一文）、without a bawbee（没钱）。","词源常被认为与法语有关，可能来自表示低面值钱币的说法（如 *bas billon* 一类的“低成色硬币”概念），后来在苏格兰口语中定型。","在书面上多见于苏格兰题材作品或方言写作；在现代日常英语中更常用 penny / small change 来表达。"]}
{"word":"bawble","summary":{"en":"Bawble (usually spelled bauble) means a small trinket, or something flashy but not truly valuable.","zh":"bawble（通常拼作 bauble）指小饰物，也可指华而不实、看似耀眼却没价值的东西。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(also spelled: bauble) a small, cheap, decorative object; a trinket.","zh":"（也拼作：bauble）小而便宜的装饰品；小饰物。"},"examples":[{"en":"She bought a few bawbles at the souvenir shop.","zh":"她在纪念品店买了几个小饰物。"},{"en":"The box was full of old bawbles and keepsakes.","zh":"盒子里装满了旧的小饰物和纪念品。"}]},{"partOfSpeech":"n.","definition":{"en":"something showy but of little real value; a glittery “toy” that distracts people.","zh":"华而不实的东西；看起来耀眼但没什么实际价值、容易分散注意力的“玩意儿”。"},"examples":[{"en":"Fame can be a bawble if it pulls you away from what matters.","zh":"名声如果让你远离真正重要的事，也可能只是个华而不实的玩意儿。"}]}],"synonyms":["trinket","knickknack","ornament","gadget","toy"],"phonetic":"/ˈbɔbəl/","extraExplanation":["“bawble”更常见的现代拼法是“bauble”。在当代英语里，“bauble”用得远多于“bawble”，后者常见于较旧的拼写或特定文本中。","在文学语境中，bauble/bawble 有时会带一点讽刺意味，暗示“闪亮但空洞”的吸引力（例如把名利、虚荣比作小玩具）。"]}
{"word":"bawcock","summary":{"en":"An old-fashioned term of praise for a man: “fine fellow.”","zh":"一个古老的赞美性称呼，指“好小伙 / 好汉”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) A term of address meaning “fine fellow,” “good man,” or “handsome young man,” used as friendly praise.","zh":"（古语）对人的称呼，表示“好小伙 / 好汉 / 俊朗之人”，带有亲切赞赏的语气。"},"examples":[{"en":"Come on, bawcock—tell us what happened.","zh":"来吧，好小伙——告诉我们发生了什么。"},{"en":"In older plays, a soldier might call his friend “bawcock” as a compliment.","zh":"在较早的戏剧里，士兵可能会称朋友为“bawcock”来表示赞美。"}]}],"synonyms":["fine fellow","good fellow","lad (old-fashioned)","my good man (contextual)"],"phonetic":"/ˈbɔkˌkɑk/","extraExplanation":["这是一个带有“戏剧/古英语风格”的称呼，现代日常英语几乎不用；如果你在书里看到，常见于喜剧或历史题材的对白，用来营造年代感。","词源通常认为来自法语 *beau coq*（字面“漂亮的公鸡”），后来在英语里变成对男性的夸赞性称呼。","它在莎士比亚时代及其后的一些戏剧文本中出现过；读到时可以把它理解为带点俏皮的“好兄弟/好小子”。"]}
{"word":"bawcocks","summary":{"en":"“Bawcocks” is an archaic plural noun meaning “fine fellows” or a friendly old-fashioned way to address men.","zh":"“bawcocks”是古英语复数名词，意思是“好汉/好兄弟”，带复古、亲昵的称呼语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic, informal) A fine fellow; a lively, brave, or cheerful man (often used as a friendly form of address).","zh":"（古语/非正式）好汉；精神小伙儿；勇敢或快活的男子（常作亲昵称呼）。"},"examples":[{"en":"Come on, my bawcock, we’ll get through this together.","zh":"来吧，我的好兄弟，我们一起熬过去。"},{"en":"The old sailor called every young deckhand “bawcock.”","zh":"那位老水手把每个年轻水手都称作“好小子/好兄弟”。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “bawcock.”","zh":"“bawcock”的复数形式。"},"examples":[{"en":"He greeted the men as “bawcocks,” as if they were old friends.","zh":"他称那些人为“bawcocks”，仿佛大家都是老朋友。"}]}],"synonyms":["good fellow","old chap","mate","pal"],"phonetic":"/ˈbɔˌkɑk/","extraExplanation":["“bawcock”是非常古老的英语口语，现代日常几乎不用；更常见于文学、戏剧或带复古风格的对白。","它常被认为与“brave cock（勇敢的公鸡）”之类的表达有关，用来夸人有胆识、很精神。","在莎士比亚戏剧中可以见到类似用法（多作亲昵的称呼），因此带有一点戏剧化、复古的语气。"]}
{"word":"bawd","summary":{"en":"“Bawd” is an old-fashioned word for a madam (a woman who runs sex workers), and more rarely for a pimp.","zh":"“bawd”是旧式用语，常指妓院女老板/鸨母；更少见时也指皮条客。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A woman who manages sex workers; a madam (old-fashioned and often used in historical or literary contexts).","zh":"（旧式/文学用语）妓院女老板；鸨母（管理性工作者的女性）。"},"examples":[{"en":"In the old novel, the bawd runs a house on the edge of town.","zh":"在那本老小说里，鸨母在城镇边缘经营一家馆子。"},{"en":"The play portrays the bawd as a shrewd businesswoman.","zh":"这部戏把鸨母刻画成精明的生意人。"}]},{"partOfSpeech":"n.","definition":{"en":"A person (not necessarily a woman) who procures clients for sex workers; a pimp (rare, old-fashioned).","zh":"（罕见/旧式）为性工作者拉客的人；皮条客。"},"examples":[{"en":"The law punished the bawd for arranging illegal meetings.","zh":"法律惩罚了那个拉皮条的人，因为他安排了非法交易。"}]}],"synonyms":["madam","brothel-keeper","pimp (rare for this sense)"],"phonetic":"/bɔd/","extraExplanation":["“bawd”是带强烈负面色彩的词，现代英语里不常用，更多出现在历史叙述、文学作品或戏剧里（例如莎士比亚时代的作品会出现类似词汇）。日常表达中如需更中性，可以用“madam”（妓院女老板）或“pimp”（皮条客，仍偏贬义）。"]}
{"word":"bawdier","summary":{"en":"“Bawdier” means “more bawdy”: more rude or sexually suggestive, usually in a joking way.","zh":"“bawdier”意为“更粗俗/更带性暗示的”，多指带成人尺度的玩笑或内容。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"comparative of “bawdy”: more humorously rude or sexually suggestive (often about jokes, songs, stories, or behavior)","zh":"“bawdy”的比较级：更粗俗的、带性暗示的（常指笑话、歌曲、故事或行为）"},"examples":[{"en":"The later episodes got bawdier and relied more on sexual jokes.","zh":"后来的几集变得更下流，更多依赖黄色笑话。"},{"en":"His second speech was bawdier than the first, which made some people uncomfortable.","zh":"他的第二次演讲比第一次更露骨，让一些人感到不舒服。"}]}],"synonyms":["raunchier","cruder","more risqué","more lewd"],"phonetic":"/ˈbɔdiər/","extraExplanation":["“bawdy / bawdier / bawdiest”多用于描述幽默或内容的“尺度”，语气带有批评或提醒意味；在正式场合通常应避免。","词源上与中世纪英语中表示“放荡、淫秽”的含义相关；现代用法里常指“带成人内容的玩笑或语言”，不一定是直接的粗口。"]}
{"word":"bawdies","summary":{"en":"“Bawdies” is the plural noun meaning prostitutes or sexually “immoral” people (archaic), and sometimes people who like or use dirty jokes.","zh":"“Bawdies”是名词复数，主要指（古旧/文学）妓女或被认为放荡的人；有时也指爱讲黄色笑话的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic or literary) Prostitutes; sexually promiscuous or “immoral” people (especially women, in older usage).","zh":"（古旧/文学用语）妓女；（旧时尤指女性）被认为放荡或“淫乱”的人。"},"examples":[{"en":"The novel describes the tavern as a place frequented by thieves and bawdies.","zh":"小说把那家酒馆描写成小偷和妓女常出没的地方。"},{"en":"In old city records, “bawdies” often appears as a label for women accused of prostitution.","zh":"在旧时的城市记录里，“bawdies”常用来指被指控卖淫的女性。"}]},{"partOfSpeech":"n.","definition":{"en":"People who enjoy or use sexually rude language; makers of “dirty” jokes (less common).","zh":"（较少见）爱说粗俗色情话的人；讲“黄色笑话”的人。"},"examples":[{"en":"The comedian was criticized by some as catering to bawdies.","zh":"有人批评那位喜剧演员迎合爱听黄色笑话的人。"},{"en":"The play mixes wit and satire, but a few scenes are clearly for bawdies.","zh":"这出戏融合机智与讽刺，但有几场明显是给喜欢低俗内容的人看的。"}]}],"synonyms":["prostitutes","sex workers","harlots (archaic)","lewd people","dirty-joke tellers"],"phonetic":"/ˈbɔdiz/","extraExplanation":["“bawdies”是名词复数，单数是“bawdy”（表示“妓女/淫乱之人”的旧义）。在现代英语里更常见的是形容词“bawdy”（粗俗色情的，如 bawdy jokes）。","在英文学传统中（如莎士比亚时代的戏剧与讽刺文学），“bawdy”常与酒馆、娼馆（brothel）和“下流笑话”相关联，带有明显的时代色彩与道德评判。现代写作中使用时要注意语境，避免对女性的刻板与贬损。"]}
{"word":"bawdiest","summary":{"en":"“Bawdiest” means “the most sexually humorous or rude/risqué.”","zh":"“bawdiest”表示“最带性笑话或最粗俗暧昧的（最高级）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Most bawdy; having the strongest or most obvious sexual humor or rude sexual references (often in jokes, stories, songs, or comedy).","zh":"最下流的／最色情粗俗的；带有最强烈或最明显的性笑话或露骨性暗示（常见于笑话、故事、歌曲或喜剧中）。"},"examples":[{"en":"That movie is the bawdiest comedy I’ve seen all year.","zh":"那部电影是我今年看过最“黄”的喜剧。"},{"en":"The comedian saved the bawdiest jokes for the late-night show.","zh":"那位喜剧演员把最露骨的笑话留到深夜节目里讲。"}]}],"synonyms":["raunchiest","dirtiest","most risqué","naughtiest"],"phonetic":"ˈbɔdiɪst","extraExplanation":["“bawdiest”是形容词“bawdy”的最高级（bawdy → bawdier → bawdiest）。常用来形容“带性暗示、荤段子、低俗但带幽默”的内容。","语气上不一定是严厉指责：有时是轻松评价（比如形容成人向喜剧），但在正式场合或对不熟的人使用可能显得冒犯。更中性的替换说法有“raunchiest”（更直白粗俗）或“most risqué”（更委婉、偏“大胆/暧昧”）。"]}
{"word":"bawdily","summary":{"en":"“Bawdily” means “in a lewd/sexually suggestive way,” often describing jokes, talk, or performances.","zh":"“bawdily”表示“以猥亵、带性暗示的方式”，常用来形容笑话、言谈或表演风格。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is humorously or openly about sex; in a lewd or indecent manner.","zh":"以（带点玩笑或直白的）色情、猥亵的方式；下流地。"},"examples":[{"en":"He joked bawdily during the party, which made some guests uncomfortable.","zh":"他在聚会上开了些下流的玩笑，让一些客人感到不舒服。"},{"en":"The comedian spoke bawdily, so the show was not suitable for children.","zh":"那位喜剧演员说话很黄，所以这场演出不适合儿童。"}]}],"synonyms":["lewdly","obscenely","vulgarly","crudely"],"phonetic":"/ˈbɔːdəli/","extraExplanation":["“bawdily”来自形容词“bawdy”（下流的、带性暗示的），常用来描述笑话、对话或表演的风格，语气通常带“粗俗但想逗笑”的感觉。","使用场景上更偏正式或书面（比如评论、报道）里用来批评或描述内容“涉黄/不雅”；日常口语更常说“in a dirty way / with dirty jokes / sexually”.","注意语域：这是带强烈负面色彩的词，在正式场合或对不熟的人使用可能显得冒犯。"]}
{"word":"bawdiness","summary":{"en":"Bawdiness means crude or openly sexual humor, talk, or writing.","zh":"Bawdiness 指粗俗或露骨的性幽默、言谈或文字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Humor, talk, or writing that is openly and often crudely sexual; lewdness.","zh":"带有露骨（常较粗俗）性意味的幽默、谈话或文字；淫秽、下流。"},"examples":[{"en":"The movie relies on bawdiness rather than clever jokes.","zh":"这部电影更多依靠下流的性笑料，而不是机智的笑话。"},{"en":"Some readers enjoy the novel’s bawdiness, but others find it offensive.","zh":"有些读者喜欢这本小说里露骨的性描写，但也有人觉得冒犯。"}]}],"synonyms":["lewdness","crudeness","raunchiness","ribaldry","smuttiness"],"phonetic":"/ˈbɔːdinəs/","extraExplanation":["“bawdiness”来自“bawdy”（下流的、淫秽的），而“bawdy”又与“bawd”（旧时指“妓院的老鸨/拉皮条的人”）有关，因此这个词常带有“粗俗、露骨”的评价色彩。","在文学与戏剧中（如某些莎士比亚喜剧），可能会出现带“双关”的性暗示；学术或评论里用“bawdiness”多是在描述这种风格或语气，而不一定是在赞同。日常表达中也可以用更中性的说法，如“sexual humor（性笑话）/raunchy jokes（粗俗的笑话）”。"]}
{"word":"bawdinesses","summary":{"en":"“Bawdinesses” means instances or kinds of bawdy, sexually suggestive, crude humor or behavior (plural of “bawdiness”).","zh":"“bawdinesses”指粗俗、带性暗示的幽默/言谈/行为等的多种表现或多次出现（bawdiness 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being bawdy; rude or sexually suggestive humor, talk, or behavior (plural form).","zh":"“bawdiness”的复数形式；指粗俗或带明显性暗示的幽默、言谈或行为的特质。"},"examples":[{"en":"The movie relies on bawdinesses that some viewers may find offensive.","zh":"这部电影依赖一些粗俗露骨的笑料，有些观众可能会觉得被冒犯。"},{"en":"Different cultures have different tolerances for public bawdinesses.","zh":"不同文化对公开的粗俗性暗示接受度不同。"}]}],"synonyms":["crudeness","lewdness","vulgarity","ribaldry","sexual innuendo"],"phonetic":"ˈbɔdinəsɪz","extraExplanation":["“bawdinesses”是名词复数，单数更常见：bawdiness。","词根 bawdy 与“粗俗、下流（常带性暗示）”相关，属于带强烈语体色彩的词；在正式写作中通常会用更委婉的表达，如 “crude humor / sexual innuendo”。","使用时要注意语境：它往往带批评或不赞同的态度，而不是中性描述。"]}
{"word":"bawdric","summary":{"en":"A medieval-style shoulder belt worn across the body to carry a sword or horn; a variant spelling of “baldric.”","zh":"一种中世纪风格的斜挎肩带，用于挂剑或号角；是“baldric”的异体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a belt worn diagonally across the chest to support a sword, horn, or other object (an older/variant spelling of “baldric”).","zh":"（旧式/变体拼写）斜挂在胸前的肩带，用来挂剑、号角或其他物品（同“baldric”）。"},"examples":[{"en":"The knight wore a bawdric to carry his sword at his side.","zh":"骑士斜挎着一条bawdric，把剑挂在身侧。"},{"en":"In the festival parade, the reenactors’ bawdrics held their drinking horns.","zh":"在节庆游行中，历史重演者的bawdric用来挂饮酒号角。"}]}],"synonyms":["baldric","sword belt","shoulder belt"],"phonetic":"ˈbɔdrɪk","extraExplanation":["“bawdric”多见于中古或早期英语文本，是“baldric”的异体拼写；现代英语里更常用“baldric”。","常出现在中世纪题材（骑士、狩猎、仪式服饰）中：它不是普通腰带，而是从一侧肩膀斜跨到对侧腰间的带子，用来承重与展示身份/装饰。"]}
{"word":"bawdrick","summary":{"en":"An old word for a shoulder belt worn across the body, often used to carry a sword.","zh":"指一种古代的斜挎带/肩带，常用于挂剑等物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) a belt worn over one shoulder and across the chest, especially to carry a sword or horn; a kind of bandolier.","zh":"（古语）斜挎在肩上、横过胸前的皮带，常用于挂剑或号角；类似“斜挎带/子弹带”。"},"examples":[{"en":"In old paintings, the knight’s sword hangs from a bawdrick across his chest.","zh":"在一些古画里，骑士的剑就挂在横过胸前的bawdrick（斜挎带）上。"},{"en":"The messenger wore a bawdrick to carry his horn while riding.","zh":"信使骑马时用bawdrick（斜挎带）挂着号角。"}]}],"synonyms":["baldrick","bandolier","shoulder strap","sword belt"],"phonetic":"/ˈbɔdrɪk/","extraExplanation":["“bawdrick”多见于较早的英语拼写，现代更常见的拼写是“baldrick”。它属于历史/文学语境用词，日常英语里通常会用“strap”“shoulder belt”或“bandolier”来表达类似意思。","如果你是从影视作品看到这个词：英剧《Blackadder》里有角色名“Baldrick”（常译作“巴尔德里克”），那是人名，不是这个物品名，但两者拼写接近，容易混淆。"]}
{"word":"bawdrics","summary":{"en":"Bawdrics (usually spelled **baldrics**) are shoulder belts worn across the chest, often for carrying a sword or similar gear.","zh":"bawdrics（更常拼作 **baldrics**）指斜挎在肩上、横跨胸前的带子，常用于挂剑等装备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of **baldric**: a belt worn over one shoulder and across the chest, often used to carry a sword, horn, or other item (common in historical or fantasy contexts).","zh":" **baldric** 的复数：斜挎在一侧肩膀并横跨胸前的带子，常用于挂剑、号角等物品（多见于历史或奇幻语境）。"},"examples":[{"en":"The guard wore **bawdrics** decorated with metal studs.","zh":"卫兵佩戴着镶有金属铆钉的**斜挎带（bawdrics）**。"},{"en":"In the novel, the knights’ **bawdrics** held their swords at the ready.","zh":"在小说里，骑士的**斜挎带（bawdrics）**把剑固定在随时可拔的位置。"}]}],"synonyms":["shoulder belt","sword belt","bandolier (similar)"],"phonetic":"/ˈbɔldrɪks/","extraExplanation":["“bawdrics”通常被认为是 **baldric(s)** 的罕见拼写或拼写错误；现代英语里更常见的形式是 **baldric / baldrics**。","这个词多出现在中世纪题材、史诗文学或奇幻作品中，用来营造“骑士/武装”的画面感。"]}
{"word":"bawdries","summary":{"en":"“Bawdries” means obscene or lewd jokes/language (and sometimes immoral sexual behavior).","zh":"“bawdries”指下流猥亵的笑话/语言，也可指淫乱或与卖淫相关的行为（较少用）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Indecent or obscene talk, jokes, or writing; lewd humor (plural of “bawdry”).","zh":"下流/猥亵的言谈、笑话或文字；淫秽的幽默（“bawdry”的复数）。"},"examples":[{"en":"The editor removed a few bawdries that would offend readers.","zh":"编辑删掉了一些可能冒犯读者的下流内容。"},{"en":"The play is full of bawdries and teasing double meanings.","zh":"这部戏充满了猥亵笑料和挑逗性的双关语。"}]},{"partOfSpeech":"n.","definition":{"en":"Immoral sexual behavior or involvement with prostitution (less common today).","zh":"不道德的性行为；与卖淫相关的行径（现代较少用）。"},"examples":[{"en":"The novel criticizes the bawdries of the city’s nightlife.","zh":"这部小说批评了城市夜生活中的淫乱行径。"}]}],"synonyms":["obscenities","lewd jokes","dirty jokes","crude humor","smut","vulgarity"],"phonetic":"/ˈbɔdriz/","extraExplanation":["“bawdry/bawdries”多见于文学、戏剧评论或较正式的写作中，用来描述带有猥亵色彩的笑话、对白或描写；日常口语里更常用 dirty jokes / crude humor / obscene language。","在莎士比亚及英国早期戏剧中，角色常用双关语制造“bawdy”效果；批评文章有时会用 bawdries 来概括这些“下流笑料”。"]}
{"word":"bawdry","summary":{"en":"Bawdry means risqué sexual humor or, more formally, sexual immorality.","zh":"bawdry 指带性暗示的粗俗/挑逗性幽默；也可较正式地指淫乱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Humorous or slightly shocking talk, jokes, or writing about sex; risqué humor.","zh":"关于性的粗俗/挑逗性玩笑或谈话；带点露骨的黄色幽默。"},"examples":[{"en":"The comedian’s act relied on bawdry, so it wasn’t suitable for kids.","zh":"那位喜剧演员的表演很靠黄色笑话，所以不适合孩子。"},{"en":"Some readers enjoy the novel’s bawdry, while others find it tasteless.","zh":"有些读者喜欢小说里的露骨调侃，但也有人觉得低俗。"}]},{"partOfSpeech":"n.","definition":{"en":"Sexual immorality or lewd behavior (a more formal, older use).","zh":"淫乱行为；淫荡（较正式、偏旧的用法）。"},"examples":[{"en":"The town leaders preached against gambling and bawdry.","zh":"镇上的领袖宣讲反对赌博和淫乱。"},{"en":"In older writings, “bawdry” often appears alongside words like “vice.”","zh":"在较早的作品中，“bawdry”常与“vice（恶习）”等词并列出现。"}]}],"synonyms":["risqué humor","raunchiness","lewdness","vulgarity","smut"],"phonetic":"/ˈbɔdri/","extraExplanation":["“bawdry”常见于文学评论、戏剧史或比较正式的语境里，比起日常口语中的“dirty jokes / raunchy humor”更书面。","词源与“bawd”（旧时指“妓院老板/拉皮条的人”）有关，因此带有“与卖淫相关、下流”的色彩。","在英语文学里常用来形容一些作品的“低俗但搞笑”的性暗示，例如谈到莎士比亚戏剧中的双关语时，有时会说含有“bawdry”。"]}
{"word":"bawds","summary":{"en":"“Bawds” is the plural of “bawd,” meaning a brothel-keeper (madam/procuress), and it can also be an old-fashioned insult.","zh":"“bawds”是“bawd”的复数，指经营妓院的鸨母/拉皮条者；也可作较旧的侮辱语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person (usually a woman) who runs a brothel; a madam or procuress","zh":"（通常指女性）经营妓院的人；鸨母；拉皮条的人"},"examples":[{"en":"In the old story, the bawd arranges meetings between clients and sex workers.","zh":"在这个旧故事里，鸨母安排嫖客与性工作者见面。"},{"en":"The novel describes a bawd who profits from other people’s misery.","zh":"小说描写了一位靠他人痛苦获利的鸨母。"}]},{"partOfSpeech":"n.","definition":{"en":"(insult, old-fashioned) a person seen as morally corrupt or sexually vulgar","zh":"（侮辱语，较旧）被认为道德败坏或言行粗俗、淫荡的人"},"examples":[{"en":"The word was used as an insult in earlier English, though it sounds archaic today.","zh":"这个词在早期英语里可作辱骂用语，但如今听起来很古旧。"}]}],"synonyms":["madam","brothel-keeper","procuress","pimp (related)"],"phonetic":"/bɔd/","extraExplanation":["“bawd”是较古老、带强烈贬义的词，现代英语中更常见的是“madam”（妓院老板娘）、“pimp”（皮条客，常指男性）或更中性的“sex work”“sex worker”等表达。","在文学里常见于早期现代英语作品（如莎士比亚时代的戏剧），用于刻画社会底层、道德批判或讽刺语境。使用时要注意场合与文化敏感性，避免在现实语境中随意指称他人。"]}
{"word":"bawdship","summary":{"en":"Bawdship means the practice or occupation of a bawd—pimping or profiting from prostitution (archaic, strongly negative).","zh":"Bawdship 指“淫媒/拉皮条”的行当或行为（古语，强烈贬义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the occupation, behavior, or practice of a bawd (a person who manages or profits from prostitution); pimping; procuring","zh":"拉皮条的行当或行为；经营/牟利于卖淫的行为；（古）淫媒业"},"examples":[{"en":"In some old texts, bawdship is condemned as a corrupting force in the city.","zh":"在一些古老文本中，bawdship 被谴责为腐化城市风气的力量。"},{"en":"The play describes a character who falls into bawdship to survive.","zh":"这部戏写到一个角色为求生计而沦为拉皮条。"}]}],"synonyms":["pimping","procuring","pandering","running a brothel"],"phonetic":"/ˈbɔdʃɪp/","extraExplanation":["“bawdship”非常少见且带有强烈贬义，多出现在早期现代英语（如16–17世纪的文学/戏剧）或仿古风格中。日常英语里通常不用这个词，更常见的说法是“pimping / procuring / running a brothel”等（视具体含义而定）。","词源上由“bawd”（淫媒、鸨母/拉皮条者）+ 后缀“-ship”（表示“状态、职业、身份/行当”，如“friendship, leadership”）构成，强调“作为bawd的身份或行当”。"]}
{"word":"bawdstrot","summary":{"en":"“bawdstrot” isn’t a recognized English word; it’s likely a misspelling or a name. Provide context to identify the intended word.","zh":"“bawdstrot”不是常见英文词；可能是拼写错误或专有名词。请提供上下文以确认你想查的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a name/handle rather than a dictionary entry.","zh":"不是标准英语单词；更可能是拼写错误，或是人名/用户名等专有形式。"},"examples":[{"en":"I couldn’t find “bawdstrot” in major English dictionaries—can you share the sentence you saw it in?","zh":"我在主要英语词典里查不到“bawdstrot”——你能把它出现的句子发我吗？"}]}],"extraExplanation":["“bawdstrot”看起来像把几个英文词拼在一起或打错了字。最接近的常见词根可能是：\n- bawdy（adj. 粗俗的、下流的，常指带性暗示的玩笑/内容）\n- bawd（n. 拉皮条者；也可泛指“做皮肉生意的中间人”，属于带历史色彩且较冒犯的词）\n- strut / trot（v. 大摇大摆地走 / 小跑）\n如果你告诉我它来自哪里（游戏ID、小说、歌词、社交媒体、或一整句原文），我可以更准确判断它是不是：①拼写错误；②专有名词；③把两个词组合成的昵称/绰号。"]}
{"word":"bawdy","summary":{"en":"“Bawdy” describes crude, often humorous sexual language or content; in older usage it can relate to brothels.","zh":"bawdy 指带性内容的粗俗（常带玩笑意味）的言语或作品；旧用法可指与妓院/卖淫相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Humor, talk, or writing that is about sex in a crude but often playful way.","zh":"（幽默、谈话或文字）粗俗但常带玩笑意味的色情/性内容的。"},"examples":[{"en":"The movie has some bawdy jokes, so it’s not suitable for kids.","zh":"这部电影有一些下流的黄色笑话，所以不适合小孩。"},{"en":"The comedian is known for bawdy stories and sharp timing.","zh":"这位喜剧演员以荤段子和精准的节奏感闻名。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to prostitution or sexually immoral behavior (older or more formal usage).","zh":"（较旧或较正式用法）与卖淫或放荡行为有关的。"},"examples":[{"en":"In older novels, a “bawdy house” refers to a brothel.","zh":"在一些旧小说里，“bawdy house”指妓院。"}]}],"synonyms":["risqué","lewd","raunchy","crude","off-color"],"phonetic":"/ˈbɔdi/","extraExplanation":["“bawdy”常用来形容“带性暗示、露骨但偏搞笑”的内容，语气比直接说“pornographic（色情的）”更偏“粗俗笑料/黄段子”。","常见搭配：bawdy joke（荤笑话）、bawdy humor（低俗色情幽默）、bawdy song（带黄色内容的歌谣）。","文化小贴士：在英美语境里，称作品“bawdy”往往意味着“成人向的粗口/性笑话”，不一定是严肃的色情内容；在正式场合最好避免使用或加以解释语境。"]}
{"word":"bawdyhouse","summary":{"en":"“Bawdyhouse” means a brothel, and it sounds old-fashioned or rude.","zh":"“bawdyhouse”指“妓院”，带古旧或粗俗语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A brothel; a house where people pay for sexual services (a rude/old-fashioned word).","zh":"妓院；卖淫场所（较粗俗或带古旧色彩的说法）。"},"examples":[{"en":"The novel mentions a bawdyhouse in the port district.","zh":"小说提到港口区的一家妓院。"},{"en":"In old laws, a “bawdyhouse” was often listed as a public nuisance.","zh":"在旧法律里，“bawdyhouse”常被列为一种妨害公共秩序的场所。"}]}],"synonyms":["brothel","whorehouse","bordello"],"phonetic":"/ˈbɔdiˌhaʊs/","extraExplanation":["“bawdy”原意是“下流的、猥亵的”，所以bawdyhouse字面就是“猥亵之屋”。这个词在现代英语里较少用于日常对话，更多出现在历史文本、法律语言或文学作品中。","更中性/常见的说法有“brothel”。在正式或新闻语境中，也可能看到“sex work establishment（性工作场所）”等更委婉的表达。"]}
{"word":"bawdyhouses","summary":{"en":"“Bawdyhouses” means brothels (an old-fashioned, often judgmental term).","zh":"“bawdyhouses”指“妓院”，属于较古老且带评判色彩的说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Brothels; buildings where people pay for sexual services (often an old-fashioned or historical term).","zh":"妓院；提供有偿性服务的场所（多为较古老/历史语境用语）。"},"examples":[{"en":"In some 18th-century cities, bawdyhouses were quietly tolerated but officially illegal.","zh":"在一些18世纪的城市里，妓院常被默许存在，但在法律上仍属非法。"},{"en":"The novel describes a neighborhood of taverns, gambling rooms, and bawdyhouses.","zh":"这部小说描写了一个充满酒馆、赌坊和妓院的街区。"}]}],"synonyms":["brothels","houses of prostitution","bordellos","whorehouses"],"phonetic":"/ˈbɔdiˌhaʊzɪz/","extraExplanation":["“bawdyhouse”来自形容词“bawdy”（下流的、猥亵的）+ “house”（房子），因此语气较粗俗、带道德评判色彩。现代英语更常用中性一些的说法，如“brothel”。","在历史/文学作品中，这个词常用于描写城市底层生活、社会风气或法律与道德的冲突；在正式场合或需要尊重的语境中应避免使用，以免冒犯。"]}
{"word":"bawhorse","summary":{"en":"“Bawhorse” is not a standard English word; it’s usually a misspelling of “sawhorse” or “workhorse.”","zh":"“bawhorse”不是标准英语词，通常是把“sawhorse”或“workhorse”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A very rare/nonstandard spelling that is not widely recognized in modern English; it is often a misspelling of “sawhorse” (a wooden/metal support used when cutting wood) or sometimes “workhorse” (a dependable worker).","zh":"一种非常少见/非标准的拼写，现代英语中并不常见；常见情况是把“sawhorse”（锯木用的支架/马凳）拼错了，有时也可能是把“workhorse”（可靠的主力、勤恳干活的人/物）拼错了。"},"examples":[{"en":"I couldn’t find “bawhorse” in the dictionary—did you mean “sawhorse” for cutting wood?","zh":"我在词典里找不到“bawhorse”——你是不是想说用来锯木头的“sawhorse”？"},{"en":"That machine is a real workhorse; “bawhorse” is probably just a typo.","zh":"那台机器真是主力干将；“bawhorse”很可能只是打错了。"}]}],"synonyms":["sawhorse","trestle","workhorse"],"phonetic":"/ˈbɔrˌhɔrs/","extraExplanation":["“sawhorse”指木工里用来支撑木板的架子，也叫“trestle”。“workhorse”常用于比喻，表示“干活主力/很可靠的人或设备”。如果你能提供一句包含“bawhorse”的原句或出处（书名、网页链接、截图），我可以更准确判断它到底想表达哪个词。"]}
{"word":"bawke","summary":{"en":"“Bawke” is a rare, nonstandard form usually related to “balk/baulk” (to hesitate or refuse) or dialect “bawk” (to retch).","zh":"“bawke”很少见、非标准，通常与“balk/baulk”（退缩、拒绝）有关；在部分方言中也可指“干呕”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare or nonstandard spelling, usually a dialect/archaic form of “bawk/balk/baulk.” Most often it refers to hesitating or refusing to do something, or (in some dialects) to retch.","zh":"一种很少见、非标准的拼写，通常是“bawk/balk/baulk”的方言或古体写法。多指犹豫/拒绝去做某事；在某些方言里也可指作呕、干呕。"},"examples":[{"en":"He bawked at the idea of speaking in public.","zh":"他一想到要当众讲话就退缩了/犹豫了。"},{"en":"Some dialects use bawk/bawke to mean “to retch.”","zh":"有些方言里用bawk/bawke表示“干呕”。"}]}],"synonyms":["balk","baulk","hesitate","refuse","draw back"],"phonetic":"/bɔk/","extraExplanation":["“bawke”不是现代英语里的常用标准拼写；如果你是在正规写作或考试中使用，通常应改为 **balk**（美式常见）或 **baulk**（英式常见），意思是“畏缩、回避、拒绝继续做”。","如果你是在小说、历史文本或苏格兰/北英格兰方言语境中看到它，它可能是为了表现口音或年代感而采用的变体拼写；具体含义要结合上下文判断。","你可以把看到的原句（前后各一两句）贴出来，我可以帮你精确判断这里的意思和更自然的现代改写。"]}
{"word":"bawl","summary":{"en":"Bawl means to cry very loudly, or to shout loudly (often “bawl out”).","zh":"Bawl 指放声大哭；也可指大声喊叫（常用 bawl out）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to cry loudly and noisily, often because you are upset, hurt, or very emotional","zh":"（因难过、疼痛或情绪强烈而）放声大哭，号哭"},"examples":[{"en":"The baby started to bawl when he got hungry.","zh":"宝宝一饿就开始哇哇大哭。"},{"en":"She bawled after reading the sad ending of the novel.","zh":"她读到小说的悲伤结局后放声大哭。"},{"en":"He fell off his bike and bawled in pain.","zh":"他从自行车上摔下来，疼得大哭起来。"}]},{"partOfSpeech":"v.","definition":{"en":"to shout or speak loudly and roughly (often used with “out”)","zh":"大声粗鲁地喊（常与 out 连用）"},"examples":[{"en":"The coach bawled out instructions from the sidelines.","zh":"教练在场边大声吼着指示。"},{"en":"Someone bawled out his name across the street.","zh":"有人在街对面大声喊他的名字。"}]}],"synonyms":["cry","sob","wail","yell","shout"],"phonetic":"/bɔl/","extraExplanation":["“bawl”通常带有“声音很大、控制不住”的感觉，比“cry”更夸张、更吵；也比“sob”（抽泣，断断续续地哭）更偏向“放声哭”。","口语里常见短语：bawl your eyes out（哭得很厉害）；bawl out sb（把某人臭骂/吼一顿）。注意 bawl out 多指责骂式的大喊，而不是普通的“叫出来”。"]}
{"word":"bawled","summary":{"en":"Bawled means “cried loudly” or “shouted loudly,” and it is the past form of bawl.","zh":"bawled 是 bawl 的过去式，意思是“放声大哭/大声哭闹”或“粗声大喊”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"cried loudly and openly (often in a rough, noisy way)","zh":"大声哭喊；放声大哭（常带有吵闹、粗放的感觉）"},"examples":[{"en":"The baby bawled all night.","zh":"婴儿整晚都在大声哭闹。"},{"en":"He bawled when he heard the bad news.","zh":"他听到坏消息时放声大哭。"}]},{"partOfSpeech":"v.","definition":{"en":"shouted in a loud, rough voice","zh":"大声吼叫；粗声喊叫"},"examples":[{"en":"She bawled his name across the street.","zh":"她隔着街大声喊他的名字。"},{"en":"The coach bawled instructions from the sidelines.","zh":"教练在场边大声吼着指令。"}]}],"synonyms":["sobbed","wept","yelled","shouted","cried"],"phonetic":"/bɔld/","extraExplanation":["“bawled”是动词“bawl”的过去式/过去分词。它通常比“cried”更强调声音很大、情绪外露，可能带点“吵闹”的感觉，所以常用来形容小孩哭闹或人在失控时的大哭。","常见相关短语：bawl out（口语）= 痛骂、狠狠训斥：The manager bawled him out for being late.（经理因他迟到把他狠狠骂了一顿。）"]}
{"word":"bawler","summary":{"en":"A bawler is someone who cries very loudly (most common) or someone who shouts loudly.","zh":"bawler 指哭得很大声的人（最常见），也可指大声喊叫的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person (often a child) who cries loudly and for a long time","zh":"（常指小孩）大哭大闹的人；哭得很响、很久的人"},"examples":[{"en":"The baby was a real bawler on the long flight.","zh":"那次长途飞行中，宝宝一直哭得很厉害。"},{"en":"He was a bawler as a kid, but he grew out of it.","zh":"他小时候很爱大哭大闹，但后来慢慢改掉了。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who shouts or calls out loudly (sometimes used humorously)","zh":"大声喊叫的人（有时带点调侃意味）"},"examples":[{"en":"You don’t need to be such a bawler—just speak normally.","zh":"你不用这么大声喊——正常说话就行。"},{"en":"In the crowded market, every vendor seemed like a bawler.","zh":"在拥挤的市场里，每个摊贩都像是在大声吆喝。"}]}],"synonyms":["crybaby","screecher","shouter","yeller"],"phonetic":"/ˈbɔlər/","extraExplanation":["“bawler”来自动词“bawl”（大哭；大声喊叫）。在日常口语里，它多用来形容哭得特别大声的人，常见搭配是“a real bawler”。用来形容“大声喊叫的人”时，语气可能略带批评或开玩笑，具体取决于语境。"]}
{"word":"bawlers","summary":{"en":"“Bawlers” means people who cry or shout very loudly, often in an uncontrolled or annoying way.","zh":"“bawlers”指大声哭闹或大喊大叫的人，常带有失控、吵闹甚至令人烦的语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who cry loudly or complain in a noisy, uncontrolled way.","zh":"大声哭闹的人；嚎哭者（也可指大声抱怨的人）。"},"examples":[{"en":"The daycare staff calmed the bawlers with snacks and a story.","zh":"托儿所工作人员用点心和故事安抚那些哭闹的孩子。"},{"en":"Ignore the online bawlers and focus on the facts.","zh":"别理网上那些吵闹抱怨的人，把注意力放在事实本身。"}]},{"partOfSpeech":"n.","definition":{"en":"People who shout or call out loudly (sometimes for attention, sales, or cheering).","zh":"大声喊叫的人（有时为引人注意、推销或助威而大喊）。"},"examples":[{"en":"Street bawlers tried to attract customers outside the market.","zh":"市场外的叫卖者大声吆喝来吸引顾客。"},{"en":"A few bawlers in the crowd kept yelling during the speech.","zh":"人群中有几个大喊大叫的人在演讲时不停叫嚷。"}]}],"synonyms":["crybabies","wailers","shouters","yellers","ranters"],"phonetic":"/ˈbɔlərz/","extraExplanation":["“bawlers”是名词复数，单数是“bawler”。常由动词“bawl”（大声哭/喊）派生，语气偏负面，带有“吵闹、失控”的感觉。","注意发音与“ball”（球）不同：bawl 的元音更像 /ɔ/（类似“aw”音）。","在文学或叙事里，bawler 常用来塑造“吵闹、粗鲁、失态”的人物形象；正式写作中可用更中性的词，如“people who are crying/shouting loudly”。"]}
{"word":"bawley","summary":{"en":"A regional British word for a small sailing fishing boat, especially from the Thames Estuary area.","zh":"英国地区词，指一种小型帆装渔船，尤见于泰晤士河口一带。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(British, regional) A small sailing fishing boat, especially one used on the Thames Estuary and nearby coasts.","zh":"（英式、地区用语）一种小型帆装渔船，尤指用于泰晤士河口及其附近海岸的渔船。"},"examples":[{"en":"The museum has a restored bawley from the Thames Estuary.","zh":"博物馆里有一艘修复过的泰晤士河口bawley渔船。"},{"en":"Local fishermen once took their bawleys out at dawn to set nets.","zh":"当地渔民过去常在拂晓驾着bawley出海下网。"}]}],"synonyms":["fishing boat","smack (regional)","small sailboat"],"phonetic":"/ˈbɔli/","extraExplanation":["“bawley”主要见于英国英格兰东南部沿海（如Essex、Kent一带）的历史与航海语境；在现代日常英语里不常用，更常在地方史、渔业史或博物馆说明中出现。","有时也会写作“bawley boat”。如果你是在姓名/地名里看到Bawley，那通常是专有名词（姓氏或地名），不一定与渔船含义相关。"]}
{"word":"bawling","summary":{"en":"“Bawling” means crying very loudly and intensely, or the loud crying itself.","zh":"“Bawling”指放声大哭（哭得很凶），也可指这种大哭的行为/声音。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"crying loudly and uncontrollably (usually from sadness, pain, or strong emotion).","zh":"（通常因悲伤、疼痛或强烈情绪而）放声大哭，哭得很凶。"},"examples":[{"en":"The child was bawling after he fell down and scraped his knee.","zh":"孩子摔倒擦破膝盖后，哭得很凶。"},{"en":"She was bawling her eyes out when she heard the bad news.","zh":"她听到坏消息时哭得稀里哗啦。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of crying loudly; loud, intense crying.","zh":"放声大哭；大声、强烈的哭泣。"},"examples":[{"en":"We could hear bawling from the next room.","zh":"我们能听到隔壁房间传来的大哭声。"}]},{"partOfSpeech":"v.","definition":{"en":"cry loudly (often used in continuous forms like “is bawling”).","zh":"放声大哭（常用于进行时，如 is bawling）。"},"examples":[{"en":"He’s bawling because he doesn’t want to leave.","zh":"他在大哭，因为他不想走。"}]}],"synonyms":["cry","sob","weep","wail"],"phonetic":"/bɔl/","extraExplanation":["“bawl”比“cry”更强调声音大、情绪失控，语气更强烈；比“sob”更侧重“喊着哭”，而“sob”更像抽噎、断断续续地哭。","常见搭配：bawl your eyes out（哭得很厉害）；bawl like a baby（像小孩一样大哭）。注意在正式写作中可用更中性的“cry”或“weep”。"]}
{"word":"bawls","summary":{"en":"“Bawls” means cries or shouts loudly; it’s usually the present-tense verb form of “bawl.”","zh":"“bawls”表示大声哭喊或吼叫；通常是动词“bawl”的第三人称单数形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Verb, present tense) to cry or shout loudly and noisily; “bawls” is the third-person singular form of “bawl.”","zh":"（动词，现在时）大声哭喊或吼叫；“bawls”是“bawl”的第三人称单数形式。"},"examples":[{"en":"The baby bawls whenever he’s hungry.","zh":"宝宝一饿就会大哭。"},{"en":"He bawls at the team when they make the same mistake again.","zh":"他们又犯同样的错误时，他就对团队大声吼叫。"}]},{"partOfSpeech":"n.","definition":{"en":"(Noun, plural) loud cries or shouts; the plural form of “bawl.”","zh":"（名词，复数）大声的哭喊或吼叫；“bawl”的复数形式。"},"examples":[{"en":"We heard bawls of laughter from the next room.","zh":"我们听到隔壁房间传来阵阵大笑的喊声。"},{"en":"Her bawls echoed down the hallway.","zh":"她的哭喊声在走廊里回荡。"}]}],"synonyms":["cries","wails","shouts","yells"],"phonetic":"/bɔlz/","extraExplanation":["“bawl”通常带有“不受控制、声音很大”的感觉，可用于人或动物（例如孩子大哭、某人吼人）。如果是“哭得很伤心但不一定很吵”，常用“cry”；如果是“喊叫/吼叫”更中性一点，可用“shout”或“yell”。","常见搭配：bawl out sb.（把某人痛骂一顿）；bawl one’s eyes out（哭得稀里哗啦/大哭一场）。"]}
{"word":"bawly","summary":{"en":"“Bawly” is a rare/nonstandard word meaning loud or prone to bawling (crying/shouting).","zh":"“bawly”较少见且不太标准，常用来表示“吵闹的、爱大声哭喊/嚷嚷的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard/rare) Loud, noisy, or tending to bawl (cry or shout).","zh":"（非标准/罕见）吵闹的；爱大声哭喊或大声嚷嚷的。"},"examples":[{"en":"The baby got bawly as soon as the lights went out.","zh":"灯一关，宝宝就开始大声哭闹。"},{"en":"After the game, the fans were bawly in the street.","zh":"比赛结束后，球迷在街上吵吵闹闹。"}]}],"synonyms":["noisy","loud","rowdy","crying","boisterous"],"phonetic":"/ˈbɔli/","extraExplanation":["“bawly”不是常见的标准英语拼写。在日常学习中，你更可能会遇到：\n1) bawling /ˈbɔlɪŋ/（大哭；大声喊叫）；\n2) bawl /bɔl/（哭喊；叫嚷）；\n3) bawdy（粗俗下流的，意思完全不同，容易误拼）。\n如果你是在歌词、方言对话或网络文本里看到“bawly”，它多半是在用“bawl”的感觉来形容“很吵、爱嚷嚷/爱哭”。"]}
{"word":"bawn","summary":{"en":"A bawn is a walled enclosure or yard, especially by a historic Irish fortified house; less commonly, a deer enclosure.","zh":"bawn 指围墙围起来的院落/围场，尤指历史上爱尔兰堡宅旁的防御性围院；较少见时也指鹿苑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an enclosed yard or fortified enclosure, especially one attached to a (historical) Irish fortified house or tower house","zh":"（尤指历史上爱尔兰塔楼式宅邸/堡宅旁的）围院；（带防御性质的）院落、围场"},"examples":[{"en":"The castle ruins still show the stone wall of the old bawn.","zh":"城堡遗址里仍能看到旧时围院的石墙。"},{"en":"In the 1600s, settlers were encouraged to build a bawn for protection.","zh":"在17世纪，人们常被鼓励修建围院以作防御。"}]},{"partOfSpeech":"n.","definition":{"en":"a fenced area where deer are kept (less common)","zh":"（较少见）鹿苑；围起来养鹿的地方"},"examples":[{"en":"The estate kept deer in a bawn near the woods.","zh":"庄园在林子旁围出一块地方养鹿。"}]}],"synonyms":["enclosure","courtyard","walled yard","paddock","deer park"],"phonetic":"/bɔn/","extraExplanation":["“bawn”源自爱尔兰语 *bábhún*，大意是“牛圈/围场”。在英语历史语境中，它常与爱尔兰殖民与防御建筑有关：一些塔楼式住宅旁会建带围墙的院落，用来保护牲畜与居民。阅读爱尔兰历史或文学材料时更常见。"]}
{"word":"bawneen","summary":{"en":"“Bawneen” means a traditional Irish flannel jacket/short coat, often linked with rural Ireland.","zh":"“bawneen”指爱尔兰传统的法兰绒短外套/夹克，常与爱尔兰乡村生活相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Irish flannel jacket or short coat, often light-colored (sometimes undyed) and associated with rural life in Ireland.","zh":"（爱尔兰传统服饰）一种法兰绒短外套/夹克，常为浅色（有时为未染色的本色），常与爱尔兰乡村生活联系在一起。"},"examples":[{"en":"In the story, the old fisherman wore a bawneen to keep warm on the windy shore.","zh":"在故事里，那位老渔夫穿着一件bawneen，在多风的海岸边保暖。"},{"en":"The museum display includes a bawneen, showing what people in rural Ireland once wore for everyday work.","zh":"博物馆展柜里有一件bawneen，展示了过去爱尔兰乡村人们日常劳作时的穿着。"}]}],"synonyms":["Irish flannel jacket","short coat","work jacket"],"phonetic":"/bɔːˈniːn/","extraExplanation":["“bawneen”是带有地域文化色彩的词，常见于描写爱尔兰乡村人物与民俗风貌的英语文学或叙事作品中，用来营造地方气息。","词源通常与爱尔兰语（Gaelic）有关；在阅读中你可以把它理解为“带有爱尔兰特色的粗呢/法兰绒短外套”。"]}
{"word":"Bawra","summary":{"en":"Bawra means “crazy/irrational,” often playfully “love-crazy” in South Asian contexts.","zh":"Bawra 指“疯狂/不理智”，在南亚语境中也常带俏皮的“为爱痴狂/着迷”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(South Asian English; from Hindi/Urdu) crazy, mad, or irrational—often used in a playful/romantic way to mean “love-crazy” or “obsessed.”","zh":"（南亚英语；源自印地语/乌尔都语）疯狂的、发疯的、不理智的；也常带俏皮/浪漫语气，指“为爱痴狂、着迷”。"},"examples":[{"en":"He’s bawra about cricket—he watches every match.","zh":"他对板球简直痴迷——每场比赛都看。"},{"en":"Don’t be bawra; think before you act.","zh":"别犯傻/别冲动；做事前先想想。"},{"en":"In the song, she calls him bawra because he’s love-crazy.","zh":"在那首歌里，她叫他“bawra”，因为他为爱痴狂。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) a crazy person; someone acting irrationally.","zh":"（非正式）疯子；行为不理智的人。"},"examples":[{"en":"Stop acting like a bawra and calm down.","zh":"别像个疯子一样，冷静点。"}]}],"synonyms":["crazy","mad","obsessed","love-struck","irrational"],"phonetic":"/ˈbɑːwrə/","extraExplanation":["“Bawra/baawra”常见于印地语与乌尔都语，也会以南亚英语的形式出现在对话、影视与歌词中。语气有时不是真骂人，更像调侃或表达“痴迷/着魔”（尤其在爱情语境）。","拼写可能见到 bawra / baawra；长元音的写法（aa）更强调发音更长。"]}
{"word":"bawra","summary":{"en":"Bawra means “crazy/mad,” and can also suggest being wildly obsessed or lovesick in South Asian usage.","zh":"bawra 常指“疯的/发狂的”，在南亚语境里也可带“痴迷、为爱痴狂”的意思。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(South Asian English; from Hindi/Urdu) crazy, mad, or acting in a wild/irrational way.","zh":"（南亚英语；源自印地语/乌尔都语）疯的、发狂的；行为冲动或不理性。"},"examples":[{"en":"He’s gone bawra since the final exam ended.","zh":"期末考一结束，他就变得有点“bawra”（疯疯癫癫的）。"},{"en":"Don’t drive bawra—slow down.","zh":"别开得那么“bawra”（不要鲁莽/失控）——慢一点。"}]},{"partOfSpeech":"n.","definition":{"en":"a crazy person; someone acting irrationally (informal).","zh":"疯子；行为不理性的人（非正式）。"},"examples":[{"en":"Only a bawra would try that stunt without practice.","zh":"没练过就敢做那种动作的，简直是个“bawra”（疯子）。"}]}],"synonyms":["crazy","mad","wild","irrational","obsessed","lovesick"],"phonetic":"/ˈbɑːwrə/","extraExplanation":["“bawra/baawra”常见于印地语/乌尔都语语境（也会出现在南亚英语里），除了“疯、发狂”，在歌词或文学里也常带有“为爱痴狂、痴迷到失去理智（lovesick/infatuated）”的浪漫色彩。","拼写会因转写而不同：bawra / baawra / bawaraa 等；读音也会因地区口音略有差异。"]}
{"word":"bawrel","summary":{"en":"“Barrel” most commonly means a large container (a barrel), and it can also mean a gun’s tube (the barrel). As a verb, it means to move very fast and forcefully.","zh":"“barrel”最常指“大桶/圆筒形容器”；也可指“枪管”。作动词时表示“飞奔、猛冲（常带喧闹或失控感）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large round container, usually made of wood or metal, used for storing liquids (like oil or wine) or other materials.","zh":"（通常木制或金属制的）桶；大圆筒形容器，用来装液体（如油、酒）或其他物品。"},"examples":[{"en":"They stored the wine in oak barrels.","zh":"他们把葡萄酒存放在橡木桶里。"},{"en":"A barrel of oil can be very expensive.","zh":"一桶石油可能非常贵。"}]},{"partOfSpeech":"n.","definition":{"en":"The long metal tube of a gun through which a bullet is fired.","zh":"（枪的）枪管；枪膛外的长金属管。"},"examples":[{"en":"The barrel of the rifle was cold to the touch.","zh":"步枪的枪管摸起来很冰。"}]},{"partOfSpeech":"v.","definition":{"en":"To move very fast, often in a noisy or uncontrolled way.","zh":"（常指喧闹或不太可控地）飞奔；猛冲。"},"examples":[{"en":"A truck barreled down the street.","zh":"一辆卡车沿着街道呼啸而过。"},{"en":"He barreled into the room without knocking.","zh":"他没敲门就冲进了房间。"}]}],"synonyms":["cask","drum","container","rush","charge"],"phonetic":"/ˈbærəl/","extraExplanation":["你输入的“bawrel”不是常见英文单词；最可能是拼写错误，目标词是“barrel”。如果你其实想查别的词（例如某个名字、方言词、或特定语境里的用法），告诉我出现它的句子，我可以更准确判断。"]}
{"word":"bawsint","summary":{"en":"“bawsint” isn’t recognized as a standard English word; it’s likely a typo or a name/slang term.","zh":"“bawsint”不是标准英语词；更可能是拼写错误，或人名/特定圈子俚语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name, or slang from a specific community. Please share the sentence or where you saw it so I can identify the intended word.","zh":"不是标准英语单词。可能是拼写错误、人名，或某个圈子/地区的俚语。请提供它出现的句子或来源，我可以帮你判断原本想表达的词。"},"examples":[{"en":"I couldn’t find “bawsint” in a dictionary—could it be a typo?","zh":"我在词典里找不到“bawsint”——它会不会是拼写错了？"},{"en":"Can you paste the full sentence that includes “bawsint”?","zh":"你可以把包含“bawsint”的完整句子贴出来吗？"}]}],"phonetic":"/ˈbɔːzɪnt/","extraExplanation":["从字形上看，“bawsint”很像打字时把字母顺序弄乱或漏/多打了字母的结果。常见的可能性包括你原本想输入的词（例如某个常见词的拼写变形）或专有名词（用户名、地名、游戏ID等）。\n\n如果你告诉我：1）它出现的语境（聊天、歌曲、游戏、文章），2）前后各一句，3）你想表达的大概意思（中文也可以），我就能更准确地给出对应的正确单词、读音和用法。"]}
{"word":"bawsunt","summary":{"en":"“Bawsunt” is likely a misspelling of “bosun,” meaning the deck officer who supervises the crew and maintenance on a ship.","zh":"“bawsunt”很可能是“bosun”的误拼，指船上的水手长，负责管理甲板船员与维护工作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly spelled “bosun”) a ship’s officer in charge of the deck crew, equipment, and maintenance.","zh":"（常拼作“bosun”）水手长：船上负责甲板水手、器材和日常维护的军士/高级船员。"},"examples":[{"en":"The bosun assigned the crew to clean the deck before dawn.","zh":"水手长在天亮前给船员分配了清洁甲板的任务。"},{"en":"Ask the bosun if the ropes and anchors are ready.","zh":"问一下水手长缆绳和锚是否准备好了。"}]}],"synonyms":["boatswain","deck boss","petty officer"],"phonetic":"/ˈboʊsən/","extraExplanation":["“bawsunt”不是标准英文拼写；它很可能是你听到的发音写法，最接近的常用词是“bosun”（也可写作更正式的“boatswain”）。","“bosun/boatswain”源自航海用语，传统上负责甲板事务与水手管理。在现代英语里多用于航海、海军、海事小说或影视作品中。"]}
{"word":"bawtie","summary":{"en":"A bow tie is a formal necktie tied into a bow; it can also describe things shaped like a bow tie.","zh":"bow tie 指“领结”，也可形容“领结形”的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A necktie made from a short, narrow band of fabric tied into a bow at the front of the neck, often worn with formal clothes.","zh":"领结：一种短而窄的领带，在脖子前方系成蝴蝶结形状，常与正式服装搭配。"},"examples":[{"en":"He wore a black bow tie with his tuxedo.","zh":"他穿燕尾服时戴了一条黑色领结。"},{"en":"For the wedding, the groomsmen matched their bow ties to the theme color.","zh":"婚礼上伴郎们把领结颜色与主题色搭配一致。"}]},{"partOfSpeech":"adj.","definition":{"en":"Shaped like a bow tie (two triangular ends with a narrow center).","zh":"领结形的；形状像蝴蝶领结（两端宽、中间窄）。"},"examples":[{"en":"The pasta was bow-tie pasta, also called farfalle.","zh":"这种意大利面是领结面，也叫 farfalle。"}]}],"synonyms":["bow-tie","neckwear (general)","black tie (context: formal wear)"],"phonetic":"/ˈboʊ taɪ/","extraExplanation":["你输入的“bawtie”常见为拼写错误，通常指的是“bow tie”。","“bow tie”在美国文化里常与正式场合（婚礼、舞会、黑领结晚宴）联系在一起；也可以作为个人风格标志（例如一些教授、主持人或服务行业制服）。","“bow-tie pasta（领结面）”是比喻用法，因为形状像领结。"]}
{"word":"bawties","summary":{"en":"Bowties are bow-shaped neckties, usually worn for formal occasions; sometimes the word also refers to bow-shaped accessories or decorations.","zh":"Bowties 指领结（蝴蝶形领带），多用于正式场合；有时也可泛指蝴蝶结形的配饰或装饰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bowties: neckties made of a short ribbon tied into two loops (a “bow”), often worn for formal events.","zh":"领结：一种用短带子打成蝴蝶形（两个环状“翅膀”）的领带，常用于正式场合。"},"examples":[{"en":"He wore a black bowtie to the wedding.","zh":"他在婚礼上戴了一个黑色领结。"},{"en":"The waiter’s uniform includes a white shirt and a bowtie.","zh":"服务员的制服包括白衬衫和领结。"},{"en":"Some people prefer bowties over long ties for formal dinners.","zh":"有些人参加正式晚宴时更喜欢领结而不是长领带。"}]},{"partOfSpeech":"n.","definition":{"en":"Bowties (informal): bow-shaped ties or accessories used on clothing, hair, or decoration.","zh":"（非正式）蝴蝶结式系带或配饰：用于衣服、头发或装饰的蝴蝶结形配件。"},"examples":[{"en":"Her dress has little bowties on the sleeves.","zh":"她的裙子袖子上有小蝴蝶结装饰。"},{"en":"The gift box was decorated with red bowties.","zh":"礼盒上装饰着红色蝴蝶结。"}]}],"synonyms":["bow tie","necktie (general)","bow (decoration)"],"phonetic":"/ˈboʊˌtaɪz/","extraExplanation":["“bawties”通常不是标准拼写；多数情况下是把“bowties（领结/蝴蝶结）”拼错了。标准写法是 bow tie（单数），bowties（复数）。","文化用法：在美式英语里，bow tie 常和正式着装（black tie/white tie）、乐队演出、服务行业制服等联系在一起；也常带一点“学院派/俏皮”的风格。"]}
{"word":"bawty","summary":{"en":"“Bawty” is Caribbean/Jamaican slang for “big/attractive butt” (adj.) or “buttocks” (n.).","zh":"“bawty”多为加勒比/牙买加俚语，作形容词指“翘臀/臀部好看”，作名词指“屁股/臀部”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(slang, Caribbean/Jamaican English) having large or attractive buttocks; curvy in a way that emphasizes the hips/butt.","zh":"（俚语，加勒比/牙买加英语）臀部较大或好看；偏“翘臀/曲线感强”的身材描述。"},"examples":[{"en":"That dancer is bawty, and the crowd went wild.","zh":"那个舞者很bawty，观众都嗨了。"},{"en":"She posted a photo and people commented, “Bawty!”","zh":"她发了照片，大家评论：“Bawty！”"}]},{"partOfSpeech":"n.","definition":{"en":"(slang, Caribbean/Jamaican English) the buttocks; a person’s backside.","zh":"（俚语，加勒比/牙买加英语）臀部；屁股。"},"examples":[{"en":"He fell and landed right on his bawty.","zh":"他摔了一跤，正好坐到屁股上。"},{"en":"The song keeps repeating “bawty” in the chorus.","zh":"那首歌副歌一直重复“bawty”。"}]}],"synonyms":["booty","butt","curvy"],"phonetic":"/ˈbɔti/","extraExplanation":["“bawty”常见于牙买加英语/帕托瓦（Jamaican Patois）与舞厅（dancehall）音乐文化语境里，和身材、跳舞相关的夸赞或调侃比较多。正式写作里不常用。","容易和“bawdy /ˈbɔdi/”（粗俗、下流的）混淆；两者拼写和语感接近，但“bawdy”是更常见的标准英语词。若你是在歌词或社媒看到“bawty”，通常指“翘臀/屁股”而不是“下流”。"]}

