{"word":"Bax","summary":{"en":"“Bax” is most commonly a surname or a context-dependent abbreviation/label.","zh":"“Bax”最常见是姓氏，或在特定语境中作为缩写/代号使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname); sometimes used as a given name in informal contexts","zh":"姓氏；有时在非正式语境中也可作为名字使用"},"examples":[{"en":"Ms. Bax will lead the meeting this afternoon.","zh":"Bax 女士将主持今天下午的会议。"},{"en":"I saw a paper by Bax and colleagues on language learning.","zh":"我看到了一篇由 Bax 及其同事撰写的语言学习论文。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation used in some fields or brand names; meaning depends on context (e.g., a company name or a technical label)","zh":"在某些领域或品牌名中使用的缩写；具体含义取决于语境（例如公司名或技术标签）"},"examples":[{"en":"The shipment was handled by BAX.","zh":"这批货运由 BAX 处理。"},{"en":"Check whether “BAX” in this document refers to a product code or a company.","zh":"确认这份文件里的“BAX”指的是产品编码还是公司。"}]}],"phonetic":"/bæks/","extraExplanation":["“Bax”本身不是常见的英语词汇，更常见为人名（姓）或缩写。遇到它时，最有效的方法是看上下文：是否出现在作者署名、邮件落款、公司/物流名称、产品型号或文件代号里。","读音通常与“backs”相同（末尾是 /ks/ 的清辅音组合），但如果它是人名，个别人也可能有不同读法。"]}
{"word":"Baxie","summary":{"en":"“Baxie” isn’t standard English; it’s often a pinyin-style spelling for Chinese 把戏 (bǎxì): a trick or gimmick.","zh":"“Baxie”不是标准英语词；常见用法是把中文“把戏（bǎxì）”用拼音式写法表示，意为花招/噱头。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not a standard English word) A spelling that looks like pinyin/romanization for the Chinese word 把戏 (bǎxì), meaning a trick, stunt, or gimmick—often used to criticize someone’s “little tricks.”","zh":"（不是标准英语单词）常见于把中文“把戏（bǎxì）”用拼音/罗马字写成“baxie”，意思是“把戏、花招、噱头”，常带有贬义，指“耍的小手段”。"},"examples":[{"en":"Don’t play those baxie—just tell me the truth.","zh":"别耍那些把戏了，直接告诉我真相。"},{"en":"That marketing “baxie” fooled a lot of people.","zh":"那个营销“把戏”骗了不少人。"},{"en":"People online call it “baxie” when someone uses cheap tricks to win an argument.","zh":"网上有人会把用低级手段赢辩论的行为叫作“baxie（把戏）”。"}]},{"partOfSpeech":"n.","definition":{"en":"A personal or brand name (rare). In English contexts, it’s usually just a name with no dictionary meaning.","zh":"人名或品牌名（较少见）。在英语语境里通常只是名字本身，没有固定词典义。"},"examples":[{"en":"Baxie is the name of their new product line.","zh":"Baxie 是他们新产品线的名字。"}]}],"synonyms":["trick","gimmick","stunt","ploy"],"phonetic":"/ˈbɑːʃi.eɪ/","extraExplanation":["“Baxie”这种写法在英语词典里一般查不到；如果你是在社交媒体、游戏、字幕或聊天里看到的，它多半是在用拉丁字母写中文（类似把“kung fu”那样写出来）。","标准拼音通常写作“bǎxì”（带声调）；没有声调时可能被随意写成“baxi / baxie”等不同形式。"]}
{"word":"Baxley","summary":{"en":"“Baxley” is usually a proper noun: either a city in Georgia, USA, or a surname.","zh":"“Baxley”通常是专有名词：要么指美国乔治亚州的一座城市，要么是一个姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in Appling County, in the state of Georgia, USA","zh":"（美国）乔治亚州阿普灵县的一座城市：巴克斯利（Baxley）"},"examples":[{"en":"She grew up in Baxley, Georgia, before moving to Atlanta.","zh":"她在乔治亚州的巴克斯利长大，后来搬到了亚特兰大。"},{"en":"The conference will be held near Baxley this year.","zh":"今年的会议将在巴克斯利附近举行。"}]},{"partOfSpeech":"n.","definition":{"en":"a surname (family name)","zh":"姓氏：Baxley（巴克斯利）"},"examples":[{"en":"Ms. Baxley will lead the meeting today.","zh":"Baxley 女士今天将主持会议。"},{"en":"I saw the name Baxley on the list of donors.","zh":"我在捐助者名单上看到了 Baxley 这个名字。"}]}],"phonetic":"/ˈbæksli/","extraExplanation":["Baxley 多见于英语国家的姓氏与地名用法。作为地名时，常见写法是 “Baxley, Georgia”。在口语或新闻里，如果没有州名或上下文，听者通常需要根据语境判断是“人名（姓）”还是“地名”。"]}
{"word":"Baxter","summary":{"en":"Baxter is most commonly a surname (and sometimes a first name). In older Scottish/Northern English, it can also mean “baker.”","zh":"Baxter 最常见是姓氏（也可作名）。在较旧的苏格兰/英格兰北部用法中，还可表示“面包师”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname); also used as a given name in English-speaking countries","zh":"（常见）姓氏；也可作英文名"},"examples":[{"en":"My professor’s last name is Baxter.","zh":"我教授的姓是 Baxter。"},{"en":"They named their son Baxter after his grandfather.","zh":"他们给儿子取名 Baxter，以纪念祖父。"}]},{"partOfSpeech":"n.","definition":{"en":"(chiefly Scottish/Northern English, old-fashioned) a baker; originally often a female baker","zh":"（主要见于苏格兰/英格兰北部、较旧用法）面包师；原本常指女性面包师"},"examples":[{"en":"In old records, a “baxter” was someone who baked bread for the community.","zh":"在旧档案中，“baxter”指为社区烤面包的人。"},{"en":"The village baxter sold fresh loaves every morning.","zh":"村里的面包师每天早上卖新鲜面包。"}]}],"synonyms":["Baker (for the occupation meaning)"],"phonetic":"/ˈbækstər/","extraExplanation":["“Baxter”作为姓氏多源自职业名称：古英语/中古英语里与“bake（烘烤）”同源的词形，后来在苏格兰和英格兰北部保留为“baxter（面包师）”。","在英语里，有些职业名后来变成姓氏很常见，比如 Baker（面包师）、Smith（铁匠）、Taylor（裁缝）。Baxter属于同一类。"]}
{"word":"baxter","summary":{"en":"“Baxter” is most commonly a surname; in older Scottish English it can also mean “a baker.”","zh":"“Baxter”最常见是姓氏；在较旧的苏格兰英语中也可指“面包师”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(usually capitalized) A surname / family name. Examples: “My doctor is Dr. Baxter.” “Baxter is a common last name in English-speaking countries.”","zh":"（通常大写）姓氏。例： “我的医生是Baxter医生。” “Baxter是在英语国家较常见的姓氏之一。”"},"examples":[{"en":"My teacher’s last name is Baxter.","zh":"我老师的姓是Baxter。"},{"en":"Have you met Ms. Baxter yet?","zh":"你见过Baxter女士了吗？"}]},{"partOfSpeech":"n.","definition":{"en":"(Scotland, old-fashioned) A baker; a person whose job is making bread and other baked goods. Examples: “In old Scots records, a baxter supplied bread to the town.”","zh":"（苏格兰；较旧用法）面包师；烘焙师。例： “在旧苏格兰档案中，baxter会为城镇供应面包。”"},"examples":[{"en":"In the novel, the baxter wakes up before dawn to bake bread.","zh":"在小说里，那位baxter天没亮就起床烤面包。"},{"en":"The village baxter was known for oatcakes.","zh":"村里的baxter以燕麦饼出名。"}]}],"synonyms":["(sense 2) baker"],"phonetic":"/ˈbækstər/","extraExplanation":["“Baxter”作为职业姓（occupational surname）与“baker（面包师）”同源，尤其见于苏格兰与英格兰北部的历史语境。许多英语姓氏来自职业，如 Smith（铁匠）、Taylor（裁缝）、Baker（面包师）。","当它指“姓氏”时，不需要翻译含义，直接音译/保留拼写即可；当出现在历史或文学语境中，才可能把它理解为“面包师”。"]}
{"word":"Baxterian","summary":{"en":"Baxterian means “connected to Richard Baxter or his teachings,” and it can also mean “a follower of Baxter.”","zh":"Baxterian 指“与理查德·巴克斯特或其思想有关的”，也可指“巴克斯特的追随者”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Richard Baxter (a 17th-century English Puritan pastor and writer) or to his religious views and writings, especially his moderate Puritan theology and practical, devotional style.","zh":"与理查德·巴克斯特（17世纪英国清教徒牧师、作家）或其宗教观点与著作有关的；尤指其较温和的清教徒神学立场与重实践、重灵修的写作风格。"},"examples":[{"en":"The professor assigned a Baxterian reading on practical Christian ethics.","zh":"教授布置了一篇带有巴克斯特风格的阅读材料，主题是基督教实践伦理。"},{"en":"Her sermon had a Baxterian tone—direct, pastoral, and focused on daily conduct.","zh":"她的讲道带有巴克斯特式的语气——直白、牧者式关怀，并强调日常行为。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who follows or is strongly influenced by Richard Baxter’s teachings (often used in historical or theological contexts).","zh":"巴克斯特的追随者或深受其教导影响的人（多用于历史或神学语境）。"},"examples":[{"en":"Some Baxterians argued for a more moderate approach within Puritanism.","zh":"一些巴克斯特派主张在清教徒传统中采取更温和的路线。"}]}],"synonyms":["Baxterite","Puritan (context-dependent)","Reformed (broad, context-dependent)"],"phonetic":"/bækˈstɪriən/","extraExplanation":["“Baxterian”来自人名 Richard Baxter（1615–1691）。他以《The Saints’ Everlasting Rest》（常译《圣徒永恒的安息》）等灵修与牧养作品闻名，写作强调实际的信仰生活与道德操练。","该词在现代英语里较少用于日常对话，更常见于宗教史、英国清教徒研究或神学讨论中。"]}
{"word":"baxterian","summary":{"en":"Baxterian means “related to Richard Baxter or his theology,” and can also mean a follower of Baxter’s views.","zh":"Baxterian 指“与理查德·巴克斯特或其神学思想有关”，也可指“巴克斯特思想的追随者”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Richard Baxter (1615–1691) or to his religious ideas, especially in English Puritan and Protestant theology.","zh":"与理查德·巴克斯特（Richard Baxter，1615–1691）或其宗教思想有关的，尤指英国清教徒与新教神学传统中的观点。"},"examples":[{"en":"The minister’s sermons had a distinctly Baxterian focus on practical Christian living.","zh":"这位牧师的讲道带有明显的巴克斯特式特色，强调基督徒生活的实践层面。"},{"en":"Some historians describe the movement as partly Baxterian rather than strictly Calvinist.","zh":"一些历史学者认为这场运动在某种程度上更偏巴克斯特式，而不完全是严格的加尔文主义。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who follows or supports Richard Baxter’s theological views.","zh":"拥护或追随理查德·巴克斯特神学观点的人。"},"examples":[{"en":"He was labeled a Baxterian by his opponents in the debate.","zh":"在那场争论中，他被对手贴上了“巴克斯特派”的标签。"}]}],"synonyms":["Baxterite","Puritan (context-dependent)","Protestant (broad, context-dependent)"],"phonetic":"/bækˈstɪriən/","extraExplanation":["“Baxterian”来自英国清教徒牧师与神学家 Richard Baxter 的姓氏。学习时可把它理解为“巴克斯特（的思想/风格）”。","巴克斯特常被认为强调信仰与道德生活的实践性（例如家庭敬虔、良心与日常行为），在一些争论中也与更“严格”的加尔文主义立场形成对比。具体含义往往取决于讨论的神学语境。","在文学与宗教写作里，你可能会看到对他著作《The Saints’ Everlasting Rest》（《圣徒永恒的安息》）的引用；谈到“Baxterian spirituality/ethics”时，多指这种偏重实践与敬虔生活的传统。"]}
{"word":"Baxterianism","summary":{"en":"Baxterianism is the theology linked to Richard Baxter, often seen as a moderate Calvinist approach that stresses sincere faith, obedience, and practical Christian living.","zh":"巴克斯特主义是与理查德·巴克斯特相关的神学思想，常被视为温和的加尔文主义取向，强调真诚的信心、顺服与实践性的基督徒生活。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A theological position associated with the English Puritan pastor Richard Baxter (1615–1691), often described as a moderate form of Calvinism that emphasizes practical holiness, sincere faith, and obedience, and that allows a more “conditional” view of salvation than strict Calvinism.","zh":"“巴克斯特主义”：与英国清教徒牧师理查德·巴克斯特（1615–1691）相关的一种神学立场，常被视为较温和的加尔文主义，强调实践性的圣洁生活、真诚的信心与顺服，并在救恩问题上比严格加尔文主义更强调“条件性”。"},"examples":[{"en":"Some historians describe Baxterianism as a middle way between strict Calvinism and Arminianism.","zh":"一些历史学者把巴克斯特主义描述为严格加尔文主义与亚米念主义之间的“中间道路”。"},{"en":"In his sermons, the pastor drew on Baxterianism to stress repentance, faith, and a changed life.","zh":"在讲道中，这位牧师借鉴巴克斯特主义来强调悔改、信心以及生命的改变。"}]}],"synonyms":["Baxter’s theology","moderate Calvinism (context-dependent)"],"phonetic":"/ˌbækˈstɪriəˌnɪzəm/","extraExplanation":["“Baxterianism”主要出现在宗教史、清教徒研究、以及17世纪英国教会争论的语境中，属于学术性较强的术语，日常英语里很少用。","该词源自人物姓氏 Baxter + 后缀 -ian（表示“……的/与……有关的人或思想”）+ -ism（表示“主义/体系”）。","在不同学者或宗派文献中，“巴克斯特主义”的界定可能略有差异；有时也被用来指巴克斯特对“称义”“救赎之约”等问题的特定看法。"]}
{"word":"baxterianism","summary":{"en":"Baxterianism is a Protestant theological approach linked to Richard Baxter, known for practical piety and a moderate form of Calvinist thought.","zh":"巴克斯特主义是与理查德·巴克斯特相关的新教神学取向，以务实的敬虔生活与较温和的加尔文主义思想著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Protestant theological tradition based on the teachings of Richard Baxter (17th‑century English Puritan), often emphasizing practical, moderate Calvinism, personal piety, and a “middle way” on topics like grace, faith, and salvation.","zh":"源自17世纪英国清教徒理查德·巴克斯特（Richard Baxter）的新教神学传统；常强调务实、较温和的加尔文主义、个人敬虔生活，以及在“恩典—信心—救恩”等议题上的折中或“中间路线”。"},"examples":[{"en":"The pastor’s writings show a clear influence of Baxterianism, focusing on devotion and moral discipline.","zh":"这位牧师的著作明显受巴克斯特主义影响，强调灵修与道德自律。"},{"en":"In her thesis, she compares Baxterianism with stricter forms of Calvinism in seventeenth-century England.","zh":"在论文中，她比较了巴克斯特主义与17世纪英格兰更严格的加尔文主义。"}]}],"synonyms":["Baxter’s theology","Puritan theology (context-dependent)"],"phonetic":"/ˌbækˈstɪriəˌnɪzəm/","extraExplanation":["“Baxterianism”来自Richard Baxter（1615–1691）。他以《The Saints’ Everlasting Rest》（《圣徒永恒的安息》）等著作闻名，主张信仰不仅是教义争论，也应落实在悔改、圣洁生活与牧养实践上。","在教会史语境中，这个词多见于学术写作，用来指一种较“温和/调和”的清教徒神学立场；日常英语中很少使用。"]}
{"word":"Baxterite","summary":{"en":"A Baxterite is a follower of (or something related to) the Puritan writer Richard Baxter and his moderate religious views.","zh":"Baxterite 指巴克斯特派（理查德·巴克斯特的追随者），或与其较温和的清教徒观点相关的。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a follower of Richard Baxter (1615–1691), a Puritan pastor and writer; more broadly, someone associated with Baxter’s moderate Puritan theology.","zh":"巴克斯特派（理查德·巴克斯特的追随者）；也可泛指与巴克斯特较温和的清教徒神学立场有关的人。"},"examples":[{"en":"In the late 1600s, a Baxterite might support a more moderate approach than some strict Puritans.","zh":"在17世纪后期，巴克斯特派可能会支持比某些严厉清教徒更温和的做法。"},{"en":"The historian describes him as a Baxterite who valued practical faith and moral discipline.","zh":"历史学家把他描述为巴克斯特派，重视实践性的信仰与道德自律。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Richard Baxter or his religious views.","zh":"与理查德·巴克斯特或其宗教观点有关的。"},"examples":[{"en":"The book discusses Baxterite ideas about church unity.","zh":"这本书讨论了巴克斯特派关于教会合一的观点。"},{"en":"Their community followed a Baxterite style of preaching focused on daily conduct.","zh":"他们的群体遵循巴克斯特派的讲道风格，强调日常行为。"}]}],"synonyms":["Baxter follower","Puritan (general, broader term)"],"phonetic":"/ˈbækstərˌraɪt/","extraExplanation":["“Baxterite”来自人物名 Richard Baxter。Baxter 是17世纪英格兰清教徒牧师与作家，著有《The Saints’ Everlasting Rest（圣徒永恒的安息）》。在英国宗教史语境中，这个词多见于学术写作，日常英语里很少用。"]}
{"word":"baxtone","summary":{"en":"“Baxtone” is not a standard English dictionary word; it’s likely a name/brand/username or a misspelling.","zh":"“baxtone”不是标准英语词汇；更可能是名字/品牌/用户名，或是误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a proper name (a surname, username, or brand name), or a misspelling of a similar-looking word.","zh":"不是标准英语词汇。更可能是专有名词（姓氏、用户名或品牌名），或是与其他单词拼写相近的误拼。"},"examples":[{"en":"I couldn’t find “baxtone” in an English dictionary—do you mean a person’s name or a brand?","zh":"我在英语词典里找不到“baxtone”——你是指人名还是品牌名？"},{"en":"If “Baxtone” is your username, keep the same spelling everywhere for consistency.","zh":"如果“Baxtone”是你的用户名，建议在各处保持同一拼写以保持一致。"}]}],"phonetic":"/ˈbækstoʊn/","extraExplanation":["“baxtone”在常见英语语料与词典中不属于高频或规范词条。你可能想写的是：\n- Baxter（常见姓氏）\n- backbone（“脊梁；骨干”，形近但意思差很多）\n- back tone / bass tone（“背景音/低音”，取决于上下文）\n如果你告诉我它出现的句子或场景（例如音乐、品牌、游戏ID、地名等），我可以更准确地解释。"]}
{"word":"Baxy","summary":{"en":"“Baxy” is usually a name or made-up label, not a standard English word; its meaning depends on context.","zh":"“Baxy”通常是名字或自造标签，不是标准英语常用词；具体意思要看上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (often a nickname, username, or brand name). It is not a standard English dictionary word, so its meaning depends on the person, product, or context using it.","zh":"专有名词（常见于昵称、用户名或品牌名）。它不是标准英语词典里的常用词，所以含义取决于具体的人、产品或使用场景。"},"examples":[{"en":"‘Baxy’ is my online username.","zh":"“Baxy”是我的网名/用户名。"},{"en":"We met someone named Baxy at the event.","zh":"我们在活动上认识了一个叫Baxy的人。"}]}],"synonyms":["(no direct synonyms; varies by context)"],"phonetic":"/ˈbæksi/","extraExplanation":["“Baxy”在英语里更像是自造词或名字，而不是常见词汇。如果你是在文章、游戏、歌曲、品牌或某个句子里看到它，可以把原句发我，我能根据上下文判断它具体指什么。","如果你其实想查的是发音或拼写相近的词，最常见的可能是：\n- boxy（/ˈbɑksi/）：‘方方的、盒子形的’\n- Baxie / Baxi：可能是人名、地名或品牌的拼写变体（如某些公司名）"]}

