{"word":"bay","summary":{"en":"Bay most commonly means a sea inlet partly surrounded by land; it can also mean a marked section of a building/area, and less commonly refers to a dog’s howl or a reddish-brown horse color.","zh":"bay最常见意思是“海湾”；也可指“（建筑/区域的）隔间、车位/停靠区”；较少见时指“狗的长声吠叫”或“（马的）枣红色”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A part of the sea (or a large lake) that is partly enclosed by land; a wide inlet of water.","zh":"（海或大湖的）海湾；一部分被陆地环绕的水域；宽阔的海水入口。"},"examples":[{"en":"We watched the sunset over the bay.","zh":"我们在海湾边看日落。"},{"en":"The ship entered the bay to avoid the storm.","zh":"船驶入海湾以躲避风暴。"}]},{"partOfSpeech":"n.","definition":{"en":"A space or section in a building or structure, often separated by beams, columns, or walls (e.g., a parking bay).","zh":"（建筑或结构中的）隔间；分隔出来的区域（如停车位、停靠区）。"},"examples":[{"en":"Park in the first bay on the left.","zh":"把车停在左边第一个车位。"},{"en":"The hospital has a separate emergency bay.","zh":"这家医院有独立的急救区。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Of a dog or wolf) to make a long, deep sound; to howl loudly.","zh":"（狗或狼）长声吠叫；嚎叫。"},"examples":[{"en":"We heard the hounds baying in the distance.","zh":"我们听到远处猎犬在长声吠叫。"}]},{"partOfSpeech":"adj.","definition":{"en":"Reddish-brown in color, especially used for horses (a bay horse).","zh":"（尤指马）枣红色的；红棕色的。"},"examples":[{"en":"She rode a calm bay mare.","zh":"她骑着一匹温顺的枣红色母马。"}]}],"synonyms":["inlet","cove","gulf","berth","stall","howl"],"phonetic":"/beɪ/","extraExplanation":["“bay”作“海湾”时，常见于地名：如 San Francisco Bay（旧金山湾）、Bay of Bengal（孟加拉湾）。","“bay”作“隔间/停靠区”在美式英语里很常见：parking bay（停车位/停车区）、loading bay（装卸区/货台）。","“bay”作“狗的长声吠叫”多见于文学或狩猎语境（hounds baying）。","“bay”作“枣红色（马）”主要用于描述马的毛色；常搭配：bay horse, bay mare, bay gelding。"]}
{"word":"Baya","summary":{"en":"Baya can mean a South/Southeast Asian weaverbird famous for woven hanging nests, or it can be used as a name (notably the Algerian artist Baya).","zh":"Baya 可指以编织悬挂鸟巢著称的南亚/东南亚织巢鸟，也可作人名（艺术史中常指阿尔及利亚艺术家 Baya）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a weaverbird (especially the baya weaver) found in South and Southeast Asia, known for making hanging, woven nests.","zh":"一种织巢鸟（尤指“织巢雀/巴亚织巢鸟”），分布于南亚和东南亚，以编织悬挂式鸟巢而闻名。"},"examples":[{"en":"The baya builds a strong hanging nest from grass fibers.","zh":"巴亚织巢鸟会用草纤维编织结实的悬挂鸟巢。"},{"en":"We saw a baya weaver near the rice fields.","zh":"我们在稻田附近看到了织巢雀。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name or name used for people and places; in art history, it often refers to the Algerian artist Baya (Baya Mahieddine).","zh":"人名或地名；在艺术史语境中常指阿尔及利亚艺术家 Baya（巴亚·马希丁）。"},"examples":[{"en":"Baya’s paintings are known for bright colors and imaginative figures.","zh":"Baya 的画作以明亮的色彩和富有想象力的人物形象著称。"},{"en":"Baya is also used as a first name in several cultures.","zh":"Baya 在多种文化中也可作为名字使用。"}]}],"synonyms":["baya weaver","weaverbird"],"phonetic":"ˈbaɪ.ə","extraExplanation":["“baya（织巢雀）”这个用法常见于自然纪录片与鸟类书籍中，通常出现在短语“baya weaver / baya weaverbird”。它因复杂的“编织巢”行为而经常被用来象征勤劳或精巧的手工。","作为人名时，Baya（1931–1998）是阿尔及利亚重要的现代艺术家之一；在艺术写作中直接用单名“Baya”指代她很常见，类似于英文中用“Picasso”指代毕加索。"]}
{"word":"baya","summary":{"en":"Baya usually means the baya weaver, a small Asian bird that builds woven hanging nests.","zh":"Baya 通常指巴亚织雀，一种会编织悬挂巢穴的亚洲小鸟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small Asian weaverbird (the baya weaver) known for making complex, hanging nests woven from grass.","zh":"（亚洲）一种小型织雀（“巴亚织雀”），以用草编织复杂的悬挂巢穴而闻名。"},"examples":[{"en":"We saw a baya building its hanging nest in a palm tree.","zh":"我们看到一只巴亚织雀在棕榈树上搭建它的悬挂巢穴。"},{"en":"The baya is famous for its carefully woven, bottle-shaped nests.","zh":"巴亚织雀以精心编织的瓶状巢穴而出名。"}]}],"synonyms":["baya weaver","weaverbird"],"phonetic":"/ˈbaɪə/","extraExplanation":["“baya”在英语里通常指“baya weaver（巴亚织雀）”，常见于南亚（如印度、斯里兰卡等）。它们的巢常做成下垂的“袋/瓶”形，有时会一串串挂在同一棵树上，这一点在自然纪录片和英语科普文章里很常见。","在一些南亚语言中也能见到“baya/baayaa”等形式，但在英语词典语境里最常用的就是指这种鸟。若你想问的是人名或其他语言里的意思，也可以告诉我具体语境。"]}
{"word":"bayadeer","summary":{"en":"Bayadeer means an Indian temple dancer (historically, in older European/English writing), and it also refers to that character type in Western arts like ballet.","zh":"bayadeer 指（旧时欧美文献中的）印度寺庙舞女，也可指西方艺术（如芭蕾）中“印度舞姬”的角色类型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a (historical) Indian temple dancer, especially in older European writing; similar to the term “devadasi.”","zh":"（历史用语）印度的寺庙舞女，尤指旧时欧洲文献中的叫法；含义接近“devadasi（奉献给神的女舞者）”。"},"examples":[{"en":"The novel describes a bayadeer performing a ritual dance at a temple festival.","zh":"小说描写一位 bayadeer 在寺庙庆典上表演仪式舞。"},{"en":"In some 19th-century travel books, the word “bayadeer” appears when writers talk about Indian dance traditions.","zh":"在一些19世纪的游记里，作者谈到印度舞蹈传统时会用到“bayadeer”这个词。"}]},{"partOfSpeech":"n.","definition":{"en":"a “bayadere” character type in Western art (ballet, opera, painting): an exoticized temple dancer from India.","zh":"（西方艺术中）“bayadere/bayadeer”这一角色类型：被异国情调化的印度寺庙舞者形象。"},"examples":[{"en":"La Bayadère is a famous ballet about a temple dancer and a forbidden love.","zh":"《舞姬》（La Bayadère）是一部著名芭蕾舞剧，讲述寺庙舞女与禁忌之恋。"}]}],"synonyms":["devadasi","temple dancer","dancer"],"phonetic":"/ˌbaɪəˈdɪr/","extraExplanation":["“bayadeer / bayadere”多见于较旧的英文资料，来源于法语 *bayadère*，而法语又借自葡萄牙语 *bailadeira*（女舞者，来自动词 *bailar*“跳舞”）。","在现代英语写作中，直接使用“devadasi”或更具体的说法（如“temple dancer”）通常更准确，也更能避免把复杂的历史与宗教传统简单化、异国情调化。","文学与艺术里常见的“bayadere”形象（例如芭蕾《La Bayadère》）属于欧洲浪漫主义时期对“东方”的想象，阅读时可留意其中的时代视角与文化偏见。"]}
{"word":"bayadeers","summary":{"en":"“Bayadeers” is an older plural word for Indian temple dancers, used mostly in historical Western writing.","zh":"“bayadeers”是一个较旧的复数词，指印度的庙宇舞女，多见于历史性的西方写作中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Temple dancers of India, especially in older Western writing; a plural form of “bayadere/bayadère.”","zh":"（复数名词）印度的庙宇舞女（在较早的西方作品中常见）；为“bayadere/bayadère”的复数形式。"},"examples":[{"en":"In the old novel, the traveler describes watching the bayadeers perform at the festival.","zh":"在那本旧小说里，旅行者描写了在节庆上观看庙宇舞女表演。"},{"en":"The painting shows bayadeers dancing in bright silk costumes.","zh":"这幅画描绘了庙宇舞女穿着鲜艳的丝绸服饰起舞。"}]}],"synonyms":["bayaderes","bayadères","temple dancers"],"phonetic":"/ˌbaɪəˈdɪrz/","extraExplanation":["“bayadeers”是较少见的拼写，更常见的是法语形式“bayadères”或英语化的“bayaderes”。这个词多出现在19世纪及更早的西方旅行记、歌剧与文学中，带有当时的异国情调想象；现代语境谈到印度相关传统时，更常用更具体、更中性的称呼。","词源大致经由法语“bayadère”，与葡萄牙语中表示“女舞者”的词有关；因此它属于带有历史色彩的外来词。"]}
{"word":"bayadere","summary":{"en":"Bayadere means an (often historically Western-described) Indian temple dancer, and it also refers to the ballet role/style popularized by *La Bayadère*.","zh":"Bayadere 指（多见于历史上的西方称呼）印度“寺庙舞女”，也可指芭蕾《舞姬》及其相关角色/意象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A female dancer in India, especially one associated (sometimes romantically or inaccurately in old Western writing) with temple dancing; a “temple dancer.”","zh":"（历史用语）印度的女舞者，尤指（在旧时西方文字中常带浪漫化或误解）与寺庙舞蹈相关的“寺庙舞女”。"},"examples":[{"en":"In older travel books, the writer describes a bayadere performing for visiting nobles.","zh":"在较早的游记里，作者描写一位 bayadere 为来访的贵族表演。"},{"en":"The museum note explains that the term “bayadere” is an outdated Western label for Indian dancers.","zh":"博物馆说明指出，“bayadere”是西方过去对印度舞者的一种较过时的称呼。"}]},{"partOfSpeech":"n.","definition":{"en":"A dancer (or role) in Western ballet and art inspired by the idea of an Indian temple dancer, especially in the ballet *La Bayadère*.","zh":"（西方芭蕾/艺术语境）受“印度寺庙舞女”意象启发的舞者（或角色），尤指芭蕾舞剧《La Bayadère（舞姬）》中的角色。"},"examples":[{"en":"She dreamed of dancing the lead bayadere in *La Bayadère*.","zh":"她梦想在《舞姬》中饰演女主角 bayadere。"},{"en":"The costume designer created jewelry and veils to match the bayadere’s look.","zh":"服装设计师制作了珠宝和面纱来贴合 bayadere 的形象。"}]}],"synonyms":["temple dancer","dancer","ballet role"],"phonetic":"/ˌbaɪəˈdɛr/","extraExplanation":["词源提示：bayadere/bayadère 来自葡萄牙语 *bailadeira*（“女舞者”），与动词 *bailar*（跳舞）有关，后来进入法语并在英语中使用。","文化提醒：在现代语境里，这个词常见于芭蕾与艺术作品中；若用来指真实的印度舞者，可能带有殖民时期的外来标签与刻板印象，写作时可改用更具体的说法（如“Indian classical dancer / 印度古典舞者”）以更尊重、更准确。","文学/艺术关联：*La Bayadère*（《舞姬》）是19世纪经典芭蕾作品之一，因此该词在舞蹈评论与演出宣传中较常出现。"]}
{"word":"bayaderes","summary":{"en":"Bayaderes means the plural of bayadere: Indian temple dancers, or (in ballet) the dancers/roles called bayaderes, especially in La Bayadère.","zh":"Bayaderes 是 bayadere 的复数：指印度寺庙舞女；也可指芭蕾（尤其《舞姬》）中被称为“舞姬”的群舞舞者/角色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of bayadere: a (traditionally) Indian temple dancer, often pictured in Western art and literature as an “exotic” dancer.","zh":"bayadere 的复数：指（传统上）印度的寺庙舞女；在西方艺术与文学中常被描绘为带有“异域风情”的舞者。"},"examples":[{"en":"In the old opera, the bayaderes dance to welcome the guests.","zh":"在那部老歌剧里，bayaderes（寺庙舞女们）跳舞迎接宾客。"},{"en":"Some 19th‑century novels mention bayaderes to create an exotic atmosphere.","zh":"一些19世纪小说会写到 bayaderes，用来营造“异域”的氛围。"}]},{"partOfSpeech":"n.","definition":{"en":"(arts, especially ballet) female dancers in a work titled or themed around a “bayadere,” such as the ballet La Bayadère.","zh":"（艺术用法，尤指芭蕾）在以“bayadere/寺庙舞女”为主题或标题的作品中出现的女舞者，如芭蕾《舞姬》（La Bayadère）中的舞姬们。"},"examples":[{"en":"The bayaderes enter in a line before the main soloist appears.","zh":"主独舞出现前，bayaderes（群舞舞姬）排成一列入场。"},{"en":"She was cast as one of the bayaderes in La Bayadère.","zh":"她在《舞姬》中饰演其中一位 bayaderes（舞姬/群舞演员）。"}]}],"synonyms":["temple dancers","(ballet) dancers of La Bayadère","Indian classical dancers (more neutral)"],"phonetic":"/ˌbaɪəˈdɛr/","extraExplanation":["“bayadere / bayadères”来自法语 *bayadère*，再追溯到葡萄牙语 *bailadeira*（意为“女舞者”）。这个词是欧洲人在殖民时期对印度舞者的称呼之一，因此在现代语境里可能带有“西方凝视/异域化”的色彩；写作或讨论时可根据场合改用更中性的说法，如“Indian classical dancer（印度古典舞者）”。","拼写提示：你输入的 **bayaderes** 常见于英语文本中作为复数形式；法语拼写的复数常写作 **bayadères**（带重音符号）。"]}
{"word":"bayal","summary":{"en":"“Bayal” is not a common English word; it is usually a name or a misspelling of “bail.”","zh":"“bayal”不是常见英语词；通常是人名/地名，或把“bail”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard word in modern English. It is most often seen as a proper name (a surname or place name) or as a misspelling of “bail.”","zh":"不是现代英语中的常见词。多见于专有名词（姓氏或地名），或作为“bail”的拼写错误。"},"examples":[{"en":"Dr. Bayal will present the research tomorrow.","zh":"Bayal 医生将于明天展示研究成果。"},{"en":"I think you meant “bail,” not “bayal.”","zh":"我想你想写的是“bail”，不是“bayal”。"}]}],"phonetic":"/ˈbaɪ.əl/","extraExplanation":["“Bayal”在英语词典里通常不会作为普通词条出现；如果你是在法律/新闻语境里看到的，最可能是“bail”（保释；保释金）。如果你能给我一句原文（含上下文），我可以帮你判断它到底是人名、地名，还是拼写错误。"]}
{"word":"Bayam","summary":{"en":"Bayam is an Indonesian/Malay word for a leafy green, usually amaranth greens (sometimes translated as spinach).","zh":"Bayam 是印尼语/马来语中对一种绿叶菜的称呼，通常指苋菜叶（有时会译为菠菜）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Indonesian/Malay) A leafy green vegetable commonly cooked in soups or stir-fries; usually refers to amaranth greens, sometimes loosely translated as “spinach.”","zh":"（印尼语/马来语）一种常见的绿叶蔬菜，常用来煮汤或清炒；通常指“苋菜/苋菜叶”，有时也会被宽泛地译为“菠菜”。"},"examples":[{"en":"In Indonesia, bayam is often cooked in a light garlic soup.","zh":"在印尼，bayam 常被煮成清淡的蒜香蔬菜汤。"},{"en":"She bought bayam at the market and stir-fried it with chili.","zh":"她在市场买了 bayam，用辣椒清炒。"}]}],"synonyms":["amaranth (greens)","spinach (menu translation)"],"phonetic":"/ˈbaɪ.əm/","extraExplanation":["在不同地区，“bayam”指的具体叶菜可能略有差异：在印尼语里多指苋菜类（amaranth greens），英文菜单上常见翻译为“spinach”，但并不总是西方常见的菠菜（Spinacia oleracea）。点餐或查食谱时，可以结合图片或学名/英文名确认。"]}
{"word":"Bayamo","summary":{"en":"Bayamo is a city in eastern Cuba, historically important and closely linked to Cuba’s national anthem.","zh":"Bayamo 指古巴东部城市巴亚莫，历史地位重要，并与古巴国歌渊源很深。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in eastern Cuba (Granma Province), known for its role in Cuba’s independence history and for being associated with the Cuban national anthem.","zh":"巴亚莫（古巴东部格拉玛省的城市），以古巴独立历史中的重要地位以及与古巴国歌相关而闻名。"},"examples":[{"en":"Bayamo is often mentioned in Cuban history lessons because it was a key city in the independence movement.","zh":"在古巴历史课上常会提到巴亚莫，因为它是独立运动中的关键城市。"},{"en":"The song connected to Bayamo later became Cuba’s national anthem.","zh":"与巴亚莫相关的一首歌后来成为古巴国歌。"}]}],"phonetic":"/baɪˈɑːmoʊ/","extraExplanation":["“Bayamo”在文化语境中常让人联想到《La Bayamesa》（《巴亚莫之歌》），这首歌在19世纪古巴独立战争时期广为传唱，后来发展为古巴国歌（西语名《Himno de Bayamo》意为“巴亚莫颂歌/巴亚莫国歌”）。","英语中提到Bayamo通常指“城市”，但在古巴文化或音乐史的语境里，也可能是在指与该城相关的国歌/歌曲传统；遇到标题或歌曲名时要结合上下文判断。"]}
{"word":"bayamo","summary":{"en":"Bayamo usually refers to a historic city in eastern Cuba; it can also refer to the early anthem associated with that city and Cuba’s national anthem.","zh":"Bayamo通常指古巴东部具有历史意义的城市巴亚莫；也可指与该城及古巴国歌相关的早期颂歌称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in eastern Cuba (capital of Granma Province), known for its role in Cuba’s independence history.","zh":"（古巴）巴亚莫：古巴东部城市，格拉玛省省会，以其在古巴独立历史中的重要地位而闻名。"},"examples":[{"en":"Bayamo is one of the oldest cities in Cuba.","zh":"巴亚莫是古巴最古老的城市之一。"},{"en":"He traveled from Santiago de Cuba to Bayamo by bus.","zh":"他坐公交从圣地亚哥（古巴）前往巴亚莫。"}]},{"partOfSpeech":"n.","definition":{"en":"a name used for Cuba’s early revolutionary anthem associated with the city of Bayamo (linked to “La Bayamesa,” the Cuban national anthem).","zh":"“巴亚莫”（颂歌/国歌称呼）：指与巴亚莫这座城市相关的早期革命颂歌称呼，常与《La Bayamesa》（古巴国歌）相联系。"},"examples":[{"en":"The song is sometimes called the “Hymn of Bayamo” because it was born in that city.","zh":"这首歌有时被称为“巴亚莫之歌/巴亚莫颂”，因为它诞生于那座城市。"},{"en":"In history class, we learned how Bayamo became connected to Cuba’s national anthem.","zh":"历史课上，我们学习了“巴亚莫”如何与古巴国歌产生联系。"}]}],"synonyms":["(proper noun) none common in English"],"phonetic":"/baɪˈɑːmoʊ/","extraExplanation":["“Bayamo”在英语里通常作为专有名词使用（首字母大写），最常指古巴东部城市巴亚莫。","巴亚莫在古巴独立运动史中具有象征意义；与《La Bayamesa》（古巴国歌）相关的“Bayamo/Hymn of Bayamo”这一叫法，来源于国歌在巴亚莫的历史背景。"]}
{"word":"Bayamon","summary":{"en":"Bayamón is most commonly a city/municipality in northern Puerto Rico near San Juan.","zh":"Bayamón最常指波多黎各北部、靠近圣胡安的一座城市与自治市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A major city and municipality in northern Puerto Rico, part of the San Juan metropolitan area.","zh":"波多黎各北部的一座主要城市与自治市，属于圣胡安都会区的一部分。"},"examples":[{"en":"Bayamón is close to San Juan, so many people commute between the two.","zh":"巴亚蒙离圣胡安很近，所以很多人会在两地通勤。"},{"en":"She grew up in Bayamón, Puerto Rico.","zh":"她在波多黎各的巴亚蒙长大。"}]},{"partOfSpeech":"n.","definition":{"en":"Bayamón River, a river in Puerto Rico (often mentioned in local geography).","zh":"巴亚蒙河：波多黎各的一条河流（在当地地理语境中常被提到）。"},"examples":[{"en":"The Bayamón River runs through areas near the city.","zh":"巴亚蒙河流经靠近这座城市的一些地区。"}]}],"phonetic":"/ˌbaɪ.əˈmoʊn/","extraExplanation":["拼写提示：西班牙语中常写作“Bayamón”，最后一个音节有重音符号（ó）；在英文语境里有时会写成不带重音的“Bayamon”。","发音提示：英文读法通常接近“bye-uh-MOHN”；如果按西班牙语习惯，更像“bah-yah-MON”（重音在最后一节）。"]}
{"word":"bayamos","summary":{"en":"“Bayamos” is uncommon in English and is usually a Spanish-based proper name linked to Bayamo, Cuba.","zh":"“Bayamos”在英语中不常见，通常是与古巴城市 Bayamo（巴亚莫）相关的西班牙语专名用法。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a rare term in English, usually seen as a Spanish-based proper name related to Bayamo (a city in Cuba); it may refer to people/things from Bayamo or be used as a surname/place-related name.","zh":"英语中很少见的词，通常作为源自西班牙语的专有名词出现，与古巴城市 Bayamo（巴亚莫）有关；可能指“来自巴亚莫的人/事物”，或作为姓氏/地名相关用法。"},"examples":[{"en":"Some historical accounts mention Bayamo and the Bayamos who supported the independence movement.","zh":"一些历史记载会提到巴亚莫（Bayamo）以及支持独立运动的“巴亚莫人（Bayamos）”。"},{"en":"The exhibit included music and documents connected to Bayamo; a few labels used the word Bayamos.","zh":"展览包含与巴亚莫有关的音乐和文献；有些标签使用了“Bayamos”这个词。"}]}],"synonyms":["Bayamo (related form)"],"phonetic":"/baɪˈɑːmoʊs/","extraExplanation":["“Bayamos”并不是常见英语词汇，更像是西班牙语/拉美语境中的专名变体。最常见的相关词是 Bayamo（古巴东部城市），英语资料里偶尔会把“来自 Bayamo 的人”写成类似复数形式来表达群体（用法不固定）。","如果你原本想查的是西班牙语“vayamos”（我们走吧/让我们去……，来自 ir=to go 的虚拟式），拼写可能写错了；告诉我你想表达的句子，我可以帮你确认。"]}
{"word":"bayano","summary":{"en":"Bayano usually refers to a Maroon resistance leader in 16th‑century Panama, and it also appears in Panamanian place names (Bayano River/Lake).","zh":"Bayano 通常指16世纪巴拿马的马龙反抗领袖，也用于巴拿马地名（如 Bayano 河/湖）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A 16th‑century African (Mandinka) leader who led an enslaved people’s rebellion in Spanish Panama and formed Maroon communities; often remembered as a symbol of resistance.","zh":"（专有名词）16世纪在西班牙统治的巴拿马领导奴隶起义并建立“马龙社群”（逃亡奴隶社区）的非洲（曼丁卡）领袖；常被视为反抗与自由的象征。"},"examples":[{"en":"In Panamanian history, Bayano is often mentioned as a leader of Maroon resistance.","zh":"在巴拿马历史中，Bayano 常被提到是马龙反抗运动的领袖。"},{"en":"Some writers use Bayano as a symbol of courage and freedom.","zh":"一些作家会用 Bayano 来象征勇气与自由。"}]},{"partOfSpeech":"n.","definition":{"en":"(Geography) The name of places in Panama, such as the Bayano River and Lake Bayano, associated with the same historical name.","zh":"（地理）巴拿马一些地名，如 Bayano 河与 Bayano 湖；名称与同一历史人物/称呼相关。"},"examples":[{"en":"They drove past Lake Bayano on their way east from Panama City.","zh":"他们从巴拿马城向东出发时经过了 Bayano 湖。"},{"en":"The Bayano River is an important river in Panama.","zh":"Bayano 河是巴拿马一条重要的河流。"}]}],"synonyms":["(no direct synonyms; proper name)"],"phonetic":"/baɪˈɑːnoʊ/","extraExplanation":["“Bayano”在英语里通常作为专有名词出现，不是常见的日常词汇。历史人物 Bayano 常被归入拉丁美洲“马龙（Maroons）”历史：指逃离奴役、在偏远地区建立自治社区的人群。","不同资料对 Bayano 的生平细节记载可能不完全一致（例如名字来源、具体年代与结局），但他作为反抗殖民奴役的象征意义较为稳定。"]}
{"word":"Bayar","summary":{"en":"“Bayar” most commonly means “to pay” in Indonesian/Malay, and it can also be used as a personal name/surname.","zh":"“Bayar”最常见的意思是印尼语/马来语中的“付款/支付”，也可作人名或姓氏。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Indonesian/Malay) to pay (money), or to pay for something.","zh":"（印尼语/马来语）付款；支付（费用/账单等）。"},"examples":[{"en":"Saya mau bayar sekarang.","zh":"我想现在付款。"},{"en":"Tolong bayar tagihan listriknya.","zh":"请把电费账单付一下。"},{"en":"Kamu bisa bayar pakai kartu?","zh":"你可以用卡支付吗？"}]},{"partOfSpeech":"other","definition":{"en":"A personal name or surname used in some cultures (a proper noun).","zh":"人名或姓氏（专有名词），在一些文化中使用。"},"examples":[{"en":"Bayar is my family name.","zh":"Bayar 是我的姓。"},{"en":"I met a student named Bayar.","zh":"我认识一位叫 Bayar 的学生。"}]}],"synonyms":["pay (English equivalent)","lunasi (Indonesian: pay off/settle)","membayar (Indonesian/Malay: to pay)"],"phonetic":"/ˈbaɪ.jɑr/","extraExplanation":["在印尼语/马来语里，bayar 非常常用，多见于购物、餐厅、账单、转账等场景；口语里也常说 “bayar dulu”（先付钱）或 “sudah bayar”（已经付过）。","如果你指的是人名/地名，请告诉我所在国家或语境（例如护照姓名、公司名、地图上的地点），我可以给出更准确的读音与背景。"]}
{"word":"Bayard","summary":{"en":"Bayard usually refers to a famous French knight (a symbol of honor), and it can also be a personal name or a legendary horse in old literature.","zh":"Bayard通常指法国著名骑士（荣誉与骑士精神的象征），也可作人名/姓氏，或在古代文学中指传说名马。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Pierre Terrail, Seigneur de Bayard (c. 1473–1524), a famous French knight and soldier, remembered as “the knight without fear and without reproach.”","zh":"（历史人物）巴亚尔骑士：皮埃尔·泰拉伊（约1473–1524），著名法国骑士与军人，以“无畏无瑕的骑士”闻名。"},"examples":[{"en":"In French history, Bayard is often praised for his courage and honor.","zh":"在法国历史中，巴亚尔常因勇气与荣誉感而受到称颂。"},{"en":"The author compared the hero to Bayard to highlight his chivalry.","zh":"作者把主人公比作巴亚尔，以突出他的骑士精神。"}]},{"partOfSpeech":"n.","definition":{"en":"A given name or surname (especially in French- and English-speaking contexts).","zh":"（姓名）用作名字或姓氏（在法语与英语语境中较常见）。"},"examples":[{"en":"Her last name is Bayard, a family name with French roots.","zh":"她姓Bayard，这是一个带有法国渊源的姓氏。"},{"en":"Bayard Rustin played an important role in the American civil rights movement.","zh":"贝亚德·鲁斯廷在美国民权运动中发挥了重要作用。"}]},{"partOfSpeech":"n.","definition":{"en":"In literature (especially French medieval romance), the name of a legendary horse; by extension, a spirited or heroic horse.","zh":"（文学）在（尤其是法国中世纪传奇）中指一匹传说名马“Bayard”；引申为骏马、英勇的马。"},"examples":[{"en":"In old romances, Bayard is the brave horse who carries heroes through danger.","zh":"在古老的传奇故事里，Bayard是载着英雄闯过险境的勇敢骏马。"},{"en":"He jokingly called his fast bicycle “Bayard.”","zh":"他开玩笑把自己很快的自行车叫作“Bayard”。"}]}],"synonyms":["Chevalier de Bayard","Pierre Terrail"],"phonetic":"/ˈbaɪ.ərd/","extraExplanation":["“Bayard骑士”在法语文化里常被当作“理想骑士（chivalry）”的象征：勇敢、讲荣誉、守信。英语里在写作或演讲中提到Bayard，往往是借用这种文化联想。","文学中的名马“Bayard”出现在一些法国史诗/传奇传统中；在英语文本里偶尔会用作典故，表达“可靠的坐骑、英雄的伙伴”这类形象。"]}
{"word":"bayard","summary":{"en":"Bayard usually refers to a famous French knight celebrated for chivalry, and sometimes to a legendary horse in medieval tales; rarely, it can mean a bay-colored horse in literary English.","zh":"Bayard 通常指以骑士精神闻名的法国骑士巴亚尔；有时也指中世纪传说中的名马；较少情况下在文学英语中可指枣红色的马。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(proper noun) A famous French knight, Pierre Terrail, seigneur de Bayard (1473–1524), often remembered as “the knight without fear and without reproach.”","zh":"（专有名词）法国著名骑士巴亚尔：皮埃尔·泰拉伊（1473–1524），常被称为“无畏无瑕的骑士”。"},"examples":[{"en":"In French history lessons, Bayard is praised as a model of chivalry.","zh":"在法国历史课里，巴亚尔常被赞为骑士精神的典范。"},{"en":"The novel portrays its hero as a modern Bayard—brave, honorable, and loyal.","zh":"小说把主人公塑造成“现代的巴亚尔”——勇敢、正直、忠诚。"}]},{"partOfSpeech":"n.","definition":{"en":"(literary, proper noun) A legendary heroic horse named Bayard, appearing in medieval French stories.","zh":"（文学/传说，专有名词）中世纪法国故事中出现的传奇英雄马“巴亚尔”。"},"examples":[{"en":"The tale speaks of Bayard, the wondrous horse that carries its rider through danger.","zh":"故事讲到神奇的马“巴亚尔”，载着骑手穿越险境。"},{"en":"Some medieval poems mention Bayard alongside famous knights and battles.","zh":"一些中世纪诗歌把“巴亚尔”和著名骑士、战役并提。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, literary) A bay-colored horse; sometimes used as a poetic word for a steed.","zh":"（罕见/文学）一匹枣红色（棕红色）的马；也可作诗意用法泛指“骏马”。"},"examples":[{"en":"The rider mounted his bayard and set off before dawn.","zh":"骑手跨上他的枣红马，天未亮就出发了。"}]}],"synonyms":["chivalrous knight","paragon (of honor)","steed","horse"],"phonetic":"/ˈbeɪ.ərd/","extraExplanation":["“Bayard”在英语里多作为文化典故出现：一方面指法国历史人物“无畏无瑕的骑士”巴亚尔；另一方面也可能指中世纪史诗/传奇中的名马。遇到文章里用“a Bayard”来形容某人，通常是在称赞其勇敢、正直、有骑士风度。"]}
{"word":"bayardly","summary":{"en":"“Bayardly” means chivalrous—brave, honorable, and courteous in a knightly way.","zh":"“bayardly”指“有骑士精神的”——勇敢、正直、讲礼节、重荣誉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Chivalrous; brave, honorable, and courteous (like an ideal knight).","zh":"（像理想骑士那样）侠义的；勇敢而正直、有礼的。"},"examples":[{"en":"He offered a bayardly apology, taking responsibility without making excuses.","zh":"他用一种很有骑士风度的方式道歉，承担责任而不找借口。"},{"en":"In the novel, the hero’s bayardly conduct wins respect even from his enemies.","zh":"在小说里，主角的骑士式行为甚至赢得了敌人的尊敬。"}]}],"synonyms":["chivalrous","gallant","knightly","honorable","valiant"],"phonetic":"/ˈbeɪ.ərd.li/","extraExplanation":["“bayardly”来自“Bayard”。Bayard通常指法国文艺复兴时期的骑士皮埃尔·泰赖尔（Pierre Terrail, seigneur de Bayard），绰号“无畏无瑕的骑士”（the knight without fear and without reproach）。因此这个词带有“骑士精神/高尚勇敢、讲荣誉和礼节”的文化联想。","这是一个非常少见的词，更常见的替代表达有：chivalrous, gallant, knightly, honorable。"]}
{"word":"bayards","summary":{"en":"“Bayards” is usually the plural of Bayard, often a name linked to the famous French knight; more rarely it can mean “bay-colored horses” in older usage.","zh":"“Bayards”通常是 Bayard 的复数，多与那位著名法国骑士相关的名称；更少见时在古语里可指“枣红色的马（群）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of Bayard) a name used for Sir Bayard (the French knight famed as “the knight without fear and without reproach”), or for something named after him.","zh":"（Bayard 的复数）可指法国骑士“巴亚尔”（以“无畏且无可指摘的骑士”闻名），或指以他命名的人、马、舰艇、地点等。"},"examples":[{"en":"The novel mentions several “Bayards” as symbols of honorable courage.","zh":"小说里提到几个“Bayards”，用来象征高尚与勇气。"},{"en":"Two Bayards in the stable were named after the legendary knight.","zh":"马厩里有两匹名叫 Bayard 的马，是以那位传奇骑士命名的。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare/archaic) plural of bayard: a bay-colored horse; by extension, a trusty horse.","zh":"（罕见/古语）bayard 的复数：枣红色（栗色）的马；引申为可靠的坐骑。"},"examples":[{"en":"In older texts, “bayards” may simply mean bay horses.","zh":"在较古老的文本里，“bayards”可能只是指枣红色的马。"},{"en":"The traveler praised his bayards for their steady pace.","zh":"旅人称赞他的几匹 bayards 步伐稳健。"}]}],"synonyms":["honorable knight (sense)","paragon (figurative sense)","bay horses (archaic sense)"],"phonetic":"/ˈbeɪ.ərd/","extraExplanation":["“Bayard”最常见的文化来源是法国历史人物 Pierre Terrail, seigneur de Bayard（约1473–1524），绰号“sans peur et sans reproche”（无畏且无可指摘）。在英语里，Bayard 有时被借用来指“正直、勇敢、值得信赖的人”，带一点文学/历史色彩。","如果你是在某篇文章或游戏/作品里看到“Bayards”，很可能是专有名词复数（多个名为 Bayard 的人/物）。要判断含义，可以看上下文是否谈到骑士、荣誉、或马匹。"]}
{"word":"bayberries","summary":{"en":"Bayberries are the waxy berries of the bayberry (wax myrtle) shrub, especially in North America.","zh":"Bayberries 指香杨梅/杨梅蜡树（wax myrtle）灌木的带蜡质浆果，尤常见于北美语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bayberries: the small, usually grayish-blue berries of the bayberry (wax myrtle) shrub, especially known for a waxy coating once used to make candles.","zh":"bayberries：杨梅蜡树/香杨梅（wax myrtle / bayberry）灌木的浆果，常呈灰蓝色，表面有蜡质涂层，过去常被用来制作蜡烛。"},"examples":[{"en":"The air smelled fresh where bayberries grew near the shore.","zh":"海边长着香杨梅的地方，空气闻起来很清新。"},{"en":"Colonists sometimes made bayberry candles from the wax on the berries.","zh":"殖民时期的人们有时会用浆果表面的蜡来做香杨梅蜡烛。"}]}],"synonyms":["wax myrtle berries","bayberry (berries)"],"phonetic":"/ˈbeɪˌbɛriz/","extraExplanation":["注意区分：英文的 bayberry 通常指北美的“wax myrtle / bayberry”（可提取蜡做蜡烛），并不等同于中文常说的“杨梅”（英语更常叫 Chinese bayberry / yangmei）。","文化小知识：在美国文学与民间传统里，bayberry candles 常与冬季、圣诞、新英格兰（New England）等意象相关，常被当作带香气的节日蜡烛。"]}
{"word":"bayberry","summary":{"en":"Bayberry is a fragrant shrub/tree with waxy berries, known especially for making traditional candles.","zh":"Bayberry 指一种有香叶与蜡质果实的灌木/小乔木，尤以制作传统杨梅蜡烛而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small shrub or tree (especially in North America) with fragrant leaves and waxy berries, often used for making candles and sometimes for flavoring","zh":"一种小灌木或小乔木（尤指北美的杨梅属植物），叶子有香味、果实带蜡质；常用来制蜡烛，有时也用于调味"},"examples":[{"en":"Bayberry shrubs grow well in sandy soil near the coast.","zh":"杨梅属灌木很适合在海岸附近的沙质土壤里生长。"},{"en":"They made bayberry candles as a traditional winter craft.","zh":"他们把做杨梅蜡烛当作传统的冬季手工活动。"}]}],"synonyms":["wax myrtle"],"phonetic":"/ˈbeɪˌbɛri/","extraExplanation":["“Bayberry”在北美文化里常让人联想到“bayberry candle（杨梅蜡烛）”：早期殖民地时期，人们会从果实表面的蜡质中提取蜡来做蜡烛，带有淡淡的清香。因为制作不易，这类蜡烛也象征着节日与传统手工。","不要与中文常说的“杨梅”（学名 *Myrica rubra*，英语常叫 *Chinese bayberry* 或 *yangmei*）混淆：英语里的“bayberry”通常指北美的杨梅属植物，如 *Myrica pensylvanica*（northern bayberry）。"]}
{"word":"baybolt","summary":{"en":"“Baybolt” is most commonly a surname; as a general English word it is rare/unclear without context.","zh":"“Baybolt”最常见是姓氏；作为普通英语词汇很少见，需结合上下文确认含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A family name (surname). It is not a common everyday English vocabulary word.","zh":"（专有名词）一个姓氏（家族名）。它不是英语里常见的日常词汇。"},"examples":[{"en":"Ms. Baybolt will be joining the team next week.","zh":"Baybolt 女士下周将加入团队。"},{"en":"The letter was addressed to Dr. Baybolt.","zh":"这封信是寄给 Baybolt 医生的。"}]},{"partOfSpeech":"other","definition":{"en":"(Rare/uncertain as a common noun) Sometimes seen as a misspelling or as two words (“bay bolt”). If you meant a specific object or term, more context is needed.","zh":"（罕见/不确定的普通名词用法）有时可能是拼写错误，或其实是两个词（“bay bolt”）。如果你指的是某个具体物品或术语，需要更多上下文才能确定。"},"examples":[{"en":"Did you mean “bay bolt” (two words) or the surname “Baybolt”?","zh":"你是指两个词“bay bolt”，还是姓氏“Baybolt”？"}]}],"phonetic":"ˈbeɪ.boʊlt","extraExplanation":["“Baybolt”在现代英语词典中通常不会作为常见名词出现；更常见的情况是人名/姓氏。","如果你是在某本书、某个行业（如机械、船舶、建筑）或某个游戏/地名里看到它，请把原句贴出来，我可以根据上下文判断它是不是专门术语、误拼，或是作者取的名字。"]}
{"word":"Bayboro","summary":{"en":"Bayboro is a U.S. place name (a town name).","zh":"Bayboro 是美国的地名（城镇名）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A place name (proper noun). It most commonly refers to small towns in the United States, such as Bayboro, North Carolina, or Bayboro, Florida.","zh":"地名（专有名词）。最常见指美国的城镇名称，例如北卡罗来纳州的 Bayboro 或佛罗里达州的 Bayboro。"},"examples":[{"en":"She grew up in Bayboro, North Carolina, near the coast.","zh":"她在北卡罗来纳州的 Bayboro 长大，靠近海岸。"},{"en":"Our meeting is in Bayboro, so I’ll send you the address.","zh":"我们的会议在 Bayboro，我会把地址发给你。"}]}],"synonyms":["(place name)"],"phonetic":"/ˈbeɪbɔːroʊ/","extraExplanation":["Bayboro 由 “bay（海湾）” + “-boro（= borough，意为城镇/自治镇的后缀）”构成，整体给人“海湾边的城镇”的感觉。英语里不少地名会用 -boro/-borough（如 Greensboro, Peterborough）。","在阅读或订票/导航时，遇到 Bayboro 最好结合“州（state）”或“县（county）”来确认具体地点，因为同名地名可能出现在不同州。"]}
{"word":"baybush","summary":{"en":"A baybush is a bay (bay laurel) shrub whose leaves are aromatic and often used as bay leaves in cooking.","zh":"baybush 指月桂（香叶月桂）灌木/小乔木，叶片芳香，常作香叶用于烹饪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bush or small tree of bay (usually sweet bay/bay laurel), whose aromatic leaves are used in cooking.","zh":"月桂（多指香叶月桂/甜月桂）的一种灌木或小乔木；其芳香叶片常用于烹饪。"},"examples":[{"en":"She grew a baybush by the kitchen door and picked a few leaves for soup.","zh":"她在厨房门边种了一棵月桂灌木，煮汤时摘了几片叶子。"},{"en":"The garden smelled spicy after the rain, especially near the baybush.","zh":"雨后花园带着辛香味，尤其是月桂灌木附近。"}]}],"synonyms":["bay bush","bay laurel","sweet bay","laurel"],"phonetic":"/ˈbeɪˌbʊʃ/","extraExplanation":["“baybush”在现代英语中不算常见，更常写作“bay bush”或直接说“bay laurel / sweet bay”。在英美语境里它通常指可食用的月桂（Laurus nobilis），其叶就是烹饪用的“bay leaf（香叶）”。不要与“mountain bay / California bay”等其他“bay”类植物混淆，它们的香味更冲，部分人会觉得刺激。","文化小知识：古罗马与希腊传统中，月桂与荣誉、胜利相关（如“laurel wreath”月桂冠）；英语里“rest on your laurels”意为“躺在功劳簿上”。"]}
{"word":"baycuru","summary":{"en":"“baycuru” doesn’t appear to be a standard English word; it’s likely a proper noun or a misspelling/variant. Provide context for an accurate meaning.","zh":"“baycuru”看起来不是标准英语词，更可能是专有名词或误拼/变体；请提供上下文以便准确解释。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a proper noun (a name, username, brand, or place name) or a misspelling/variant from another language.","zh":"不是标准英语词。更可能是专有名词（人名/网名/品牌/地名）或来自其他语言的拼写变体/误拼。"},"examples":[{"en":"I couldn’t find “baycuru” in an English dictionary—do you mean a name or a place?","zh":"我在英语词典里找不到“baycuru”——你是指人名还是地名？"},{"en":"If you tell me the sentence where you saw “baycuru,” I can help you interpret it.","zh":"如果你把看到“baycuru”的句子发给我，我可以帮你判断它的意思。"}]}],"phonetic":"/ˈbeɪkjuːruː/","extraExplanation":["目前在常见英语词典与语料中找不到“baycuru”作为英语词汇的可靠记录。它可能是：\n1）专有名词（人名/账号名/品牌名）；\n2）来自某种语言的音译或拼写变体；\n3）误拼。\n如果你提供来源（哪本书/哪段文字/哪个国家或语言环境、上下文句子），我可以更准确地解释。","如果你本来想查的是发音或拼写相近的英语词，可能是：\n- “bayou” /ˈbaɪuː/（美国南部的河汊、沼泽水道）\n- “bizarre” /bɪˈzɑr/（古怪的）\n- “backup” /ˈbækʌp/（备份/后援）\n你也可以告诉我你想表达的中文意思，我帮你反查最合适的英文词。"]}
{"word":"Bayda","summary":{"en":"Bayda is most commonly a proper name (place name) seen in Arabic-speaking regions, often written as Al Bayda. It can also reflect an Arabic origin linked to “white/bright.”","zh":"Bayda 最常见是专名（地名），多见于阿拉伯语地区，常写作 Al Bayda；其来源常与阿拉伯语中“白色/明亮”的含义有关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a place name (proper noun) used for several towns and regions in the Arab world, especially Al Bayda in Libya and Al Bayda in Yemen.","zh":"（专有名词）地名，用于阿拉伯世界的多个城镇或地区，尤其指利比亚的拜达（Al Bayda）和也门的拜达（Al Bayda）。"},"examples":[{"en":"She grew up in Al Bayda, Libya, before moving abroad.","zh":"她在利比亚的拜达（Al Bayda）长大，后来移居国外。"},{"en":"News reports mentioned heavy rain near Al Bayda in Yemen.","zh":"新闻报道提到也门拜达（Al Bayda）附近出现强降雨。"}]},{"partOfSpeech":"other","definition":{"en":"a transliteration from Arabic that can relate to the idea of “white/bright” and also appears in words connected to “egg” in Arabic.","zh":"（音译词）源自阿拉伯语的拼写形式，常与“白色/明亮”的含义相关；也会出现在与阿拉伯语“鸡蛋”相关的词形中。"},"examples":[{"en":"The surname Bayda is sometimes explained as coming from an Arabic root meaning “white.”","zh":"Bayda 这个姓氏有时被解释为源自一个表示“白色”的阿拉伯语词根。"},{"en":"In Arabic, you may see similar spellings when words are transliterated into English letters.","zh":"在阿拉伯语词汇用英文字母音译时，你可能会看到类似的拼写。"}]}],"synonyms":["Al Bayda","Al-Bayda","Baydaʾ (variant transliteration)"],"phonetic":"/ˈbaɪdə/","extraExplanation":["“Bayda/Al Bayda/Al-Bayda”常见于阿拉伯语音译：al-（الـ）相当于英语的 the，Bayda 往往对应阿拉伯语 البيضاء（al-bayḍāʾ），字面含义常被解释为“白色的/洁白的”。因此很多以 Al Bayda 命名的地方，可能与当地地貌颜色（如浅色土壤、石灰岩、沙地）或象征意义有关。","不同国家的“Al Bayda”不是同一个城市：常见的包括利比亚的 Al Bayda（拜达）与也门的 Al Bayda（拜达省/拜达市）。阅读英文材料时可通过国家名、上下文或拼写（是否带 Al、是否连字符）来区分。"]}
{"word":"Bayeau","summary":{"en":"Bayeux is a town in Normandy, France, famous for the Bayeux Tapestry about the Norman Conquest (1066).","zh":"Bayeux（巴约）是法国诺曼底的城镇，以讲述1066年诺曼征服的“贝叶挂毯”闻名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper noun) A town in Normandy, France, best known for the Bayeux Tapestry.","zh":"（专有名词）法国诺曼底地区的一个城镇，以“贝叶挂毯（Bayeux Tapestry）”最为著名。"},"examples":[{"en":"We visited Bayeux as a base for seeing the Normandy beaches.","zh":"我们以巴约（Bayeux）为据点，去参观诺曼底的海滩。"},{"en":"Bayeux is famous for preserving the Bayeux Tapestry.","zh":"巴约以保存“贝叶挂毯”而闻名。"}]},{"partOfSpeech":"phrase","definition":{"en":"(In the phrase “Bayeux Tapestry”) A famous medieval embroidered cloth that tells the story of the Norman Conquest of England (1066).","zh":"（用于短语“Bayeux Tapestry / 贝叶挂毯”）一幅著名的中世纪刺绣长卷，讲述1066年诺曼征服英格兰的故事。"},"examples":[{"en":"The Bayeux Tapestry shows scenes of ships, soldiers, and the Battle of Hastings.","zh":"贝叶挂毯展示了船只、士兵以及黑斯廷斯战役等场景。"},{"en":"In history class, we learned about 1066 through the Bayeux Tapestry.","zh":"在历史课上，我们通过贝叶挂毯了解了1066年。"}]}],"synonyms":["Bayeux Tapestry","Normandy","Battle of Hastings"],"phonetic":"/baɪˈjuː/","extraExplanation":["“Bayeau”在英语里不常见，很多时候是把法语地名“Bayeux”（巴约）拼错了。英语里常见读法接近“by-YOO”（/baɪˈjuː/），但法语原音更接近“bay-uh”（音更圆、结尾不发/k/一类的音）。","“Bayeux Tapestry”严格说并不是编织（tapestry），而是刺绣（embroidery）。它在英语文化与历史写作中经常被引用，用来形象说明诺曼征服以及中世纪叙事图像的作用。"]}
{"word":"bayed","summary":{"en":"“Bayed” means “made a long, loud sound,” especially dogs howling; less commonly, it can mean “chased and trapped (by dogs).”","zh":"“bayed”表示“发出拖长而响亮的声音”（常指狗嚎叫）；较少见时也可表示“被追赶并围困住（尤指猎犬）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense and past participle of “bay”: made a long, loud sound (often a dog howling or a person shouting loudly).","zh":"“bay”的过去式/过去分词：发出又长又响的声音（常指狗嚎叫，也可指人大声喊叫）。"},"examples":[{"en":"The hounds bayed all night outside the camp.","zh":"猎犬在营地外嚎叫了一整夜。"},{"en":"He bayed for help when he saw the fire spreading.","zh":"他看到火势蔓延时大声呼救。"}]},{"partOfSpeech":"v.","definition":{"en":"(Less common) Past tense/past participle of “bay” meaning to chase, surround, and trap (especially by dogs).","zh":"（较少见）“bay”的过去式/过去分词：追赶并围住、逼到走投无路（尤指猎犬把猎物围困住）。"},"examples":[{"en":"The deer was bayed by the pack near the river.","zh":"那只鹿在河边被犬群围困住了。"}]}],"synonyms":["howled","yelled","barked","cried out","called out"],"phonetic":"/beɪd/","extraExplanation":["“bay”用作动词时最常见的画面是狗（尤其是猎犬）发出低沉、拖长的嚎叫声，英语里常用来营造紧张或荒野的氛围。文学描写中也常见“baying hounds”（嚎叫的猎犬）来表达追逐、恐惧或压迫感。"]}
{"word":"Bayer","summary":{"en":"Bayer most commonly refers to the German company; less commonly, it can mean a person from Bavaria.","zh":"Bayer 最常指德国“拜耳公司”；较少见时也可指“巴伐利亚人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large German life-sciences company (pharmaceuticals, consumer health, and crop science), known for products such as aspirin","zh":"拜耳：一家德国大型生命科学公司（制药、健康消费品与作物科学），以阿司匹林等产品闻名"},"examples":[{"en":"Bayer is headquartered in Leverkusen, Germany.","zh":"拜耳总部位于德国勒沃库森。"},{"en":"The medicine was originally sold under the Bayer brand.","zh":"这种药最初以拜耳品牌销售。"},{"en":"Bayer invests heavily in research and development.","zh":"拜耳在研发方面投入很大。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a person from Bavaria, a region in southern Germany","zh":"（较少见）巴伐利亚人：来自德国南部巴伐利亚地区的人"},"examples":[{"en":"He’s a Bayer who grew up near Munich.","zh":"他是巴伐利亚人，在慕尼黑附近长大。"},{"en":"Some older texts use “Bayer” to mean “Bavarian.”","zh":"一些较旧的文本中用“Bayer”表示“巴伐利亚人”。"}]}],"synonyms":["(for the demonym) Bavarian"],"phonetic":"/ˈbaɪ.ər/","extraExplanation":["“Bayer”在英语中常作为专有名词使用，最常指“拜耳公司”。在新闻或商业语境里，通常直接说 Bayer；在中文里常译为“拜耳”。","历史文化补充：拜耳与“阿司匹林（aspirin）”关系密切。Aspirin 早期曾是拜耳的重要品牌名之一，但后来在一些国家逐渐成为通用名。"]}
{"word":"Bayern","summary":{"en":"“Bayern” is the German name for Bavaria, and it can also refer to FC Bayern Munich in sports contexts.","zh":"“Bayern”是“巴伐利亚州”的德语名称；在体育语境中也常指“拜仁慕尼黑足球俱乐部”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper noun) The German name for Bavaria, a state in southeastern Germany.","zh":"（专有名词）“Bayern”是德国巴伐利亚州（Bavaria）的德语名称，位于德国东南部。"},"examples":[{"en":"Munich is the capital city of Bayern (Bavaria).","zh":"慕尼黑是Bayern（巴伐利亚州）的首府。"},{"en":"She traveled through Bayern and visited several castles.","zh":"她穿越了Bayern，参观了好几座城堡。"}]},{"partOfSpeech":"other","definition":{"en":"(Proper noun, sports) Short for FC Bayern Munich, a famous German professional football (soccer) club.","zh":"（专有名词，体育）常指“拜仁慕尼黑足球俱乐部”（FC Bayern Munich），德国著名职业足球队。"},"examples":[{"en":"Bayern won the match 3–1.","zh":"拜仁以3比1赢下了比赛。"},{"en":"He’s a Bayern fan and watches every game.","zh":"他是拜仁球迷，每场比赛都看。"}]}],"synonyms":["Bavaria","FC Bayern Munich","Bayern Munich"],"phonetic":"/ˈbaɪ.ɚn/","extraExplanation":["“Bayern”在英语语境里常与英文名“Bavaria”互换使用；在旅游、历史、美食（如pretzel 椒盐卷饼、beer 啤酒文化）等话题中更常见。","在体育新闻里单独说“Bayern”，通常默认指拜仁慕尼黑（FC Bayern Munich）；中文里也常简称“拜仁”。","大小写提示：作为专有名词应大写（Bayern）；不要与英文单词混用成小写。"]}
{"word":"Bayesian","summary":{"en":"Bayesian describes Bayes-based reasoning or statistics that update probabilities as new evidence appears; it can also mean a person who uses this approach.","zh":"Bayesian 指与贝叶斯定理相关的推理/统计方法（用新证据更新概率），也可指使用该方法的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Bayes’ theorem or to a way of reasoning that updates beliefs using new evidence","zh":"与贝叶斯定理有关的；指一种用新证据不断更新“信念/概率判断”的推理方法"},"examples":[{"en":"Bayesian methods are widely used in machine learning and data science.","zh":"贝叶斯方法在机器学习和数据科学中被广泛使用。"},{"en":"A Bayesian model can combine past knowledge with new data.","zh":"贝叶斯模型可以把已有知识与新数据结合起来。"},{"en":"She prefers a Bayesian approach because it makes uncertainty explicit.","zh":"她更喜欢贝叶斯方法，因为它能更清楚地表达不确定性。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who supports or uses Bayesian statistics","zh":"使用或支持贝叶斯统计的人；贝叶斯学派的人"},"examples":[{"en":"As a Bayesian, he starts with a prior and updates it as evidence comes in.","zh":"作为一名贝叶斯学派的人，他会先设定先验，再随着证据出现不断更新。"},{"en":"The debate between Bayesians and frequentists is common in statistics classes.","zh":"在统计课上，贝叶斯学派与频率学派的讨论很常见。"}]}],"synonyms":["probabilistic","inferential","statistical"],"phonetic":"/ˈbeɪziən/","extraExplanation":["“Bayesian”来自18世纪英国数学家与牧师 Thomas Bayes（托马斯·贝叶斯）的名字。核心思想是：面对不确定问题时，先有一个“先验”(prior) 判断；得到新证据后，用贝叶斯定理把它更新成“后验”(posterior) 判断。","在日常语言里，Bayesian 往往暗示“根据新信息调整想法”的思维方式；在技术语境（统计、AI、医学检验等）里，则更具体地指一整套概率建模与推断方法。"]}
{"word":"bayesian","summary":{"en":"Bayesian: related to Bayes’s theorem; updating beliefs with new evidence, often using probability.","zh":"Bayesian：与贝叶斯定理相关；指用概率在获得新证据后更新判断/信念的推理或统计方法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Bayes’s theorem and a way of reasoning that updates what you believe when you get new evidence (often using probabilities).","zh":"与贝叶斯定理有关的；指一种在获得新证据后更新信念/判断的推理方法（常用概率来表达）。"},"examples":[{"en":"Bayesian methods let you update your estimate as new data arrives.","zh":"贝叶斯方法能让你在新数据到来时更新你的估计。"},{"en":"The team used a Bayesian model to predict customer demand.","zh":"团队使用了贝叶斯模型来预测客户需求。"},{"en":"Bayesian thinking is useful when you’re uncertain and information comes in step by step.","zh":"当你不确定、信息又是逐步到来时，贝叶斯思维很有用。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who uses or supports Bayesian methods (especially in statistics or data science).","zh":"（尤指统计学或数据科学中）使用或支持贝叶斯方法的人；贝叶斯学派的人。"},"examples":[{"en":"She’s a Bayesian who prefers probabilistic models.","zh":"她是贝叶斯学派的人，更偏好概率模型。"},{"en":"Bayesians often talk about ‘priors’ and ‘posteriors.’","zh":"贝叶斯学派的人常谈“先验”和“后验”。"}]}],"synonyms":["probabilistic","statistical (context-dependent)","inference-based (context-dependent)"],"phonetic":"/ˈbeɪziən/","extraExplanation":["“Bayesian”来自18世纪英国数学家 Thomas Bayes（托马斯·贝叶斯）。在学术写作中常大写（Bayesian），尤其当它指一种统计学派或具体方法时；一般描述性用法有时也会小写。","学习时可以把它理解为：先有一个“初始看法/先验（prior）”，看到新证据后用规则更新，得到“更新后的看法/后验（posterior）”。"]}
{"word":"bayeta","summary":{"en":"Bayeta usually means a soft cleaning cloth (a borrowed Spanish word); it can also mean a coarse woolen cloth (baize).","zh":"Bayeta 通常指柔软的清洁擦布（多为西语借词）；也可指粗毛呢布/台呢（baize）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a soft cleaning cloth, often like a flannel or chamois, used for wiping and polishing (especially in Latin American Spanish-influenced contexts).","zh":"（常见于受西语影响的语境）抹布/擦拭布，通常较柔软（像法兰绒或鹿皮布），用于擦拭、清洁或抛光。"},"examples":[{"en":"Wipe the table with a bayeta before the guests arrive.","zh":"客人来之前，用一块 bayeta 把桌子擦干净。"},{"en":"He used a bayeta to polish the car’s dashboard.","zh":"他用 bayeta 把汽车仪表台擦亮。"}]},{"partOfSpeech":"n.","definition":{"en":"a kind of coarse woolen cloth; baize (a fabric sometimes used for coverings, like on tables).","zh":"一种粗毛呢布；台呢（baize），有时用于桌面等覆盖布。"},"examples":[{"en":"The old counter was covered with green bayeta.","zh":"那张旧柜台上铺着绿色的 bayeta（台呢）。"}]}],"synonyms":["cleaning cloth","rag","wipe","dishcloth","chamois","baize"],"phonetic":"/baɪˈeɪtə/","extraExplanation":["“bayeta”源自西班牙语，在英语里多见于双语社区、移民语境或对话中直接借用，指“擦拭用的抹布/擦布”。在一些地区它也可指一种布料（类似台呢/粗毛呢）。","在日常生活中，如果你在英文对话里用“bayeta”，通常是在保留西语词汇的文化语感；更通用的英语说法是 “cleaning cloth / rag / wipe / microfiber cloth”。"]}
{"word":"bayete","summary":{"en":"“Bayete” is a (rare) loanword meaning a thick, soft woolen cloth like baize/flannel.","zh":"“bayete”是较少见的外来词，指一种类似台呢/法兰绒的厚软毛织布。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a soft, thick woolen cloth (similar to baize or flannel), often used for table coverings, polishing, or lining.","zh":"一种柔软、较厚的毛织布（类似台呢/法兰绒），常用于桌面覆盖、擦拭抛光或作衬里。"},"examples":[{"en":"The billiard table was covered with green bayete.","zh":"台球桌上铺着绿色的台呢（bayete）。"},{"en":"He wiped the metal with a piece of bayete to make it shine.","zh":"他用一块bayete擦拭金属，让它发亮。"}]}],"synonyms":["baize","flannel","woolen cloth"],"phonetic":"/baɪˈeɪteɪ/","extraExplanation":["“bayete”多见于西班牙语/葡萄牙语语境，是借词；在英语里比较少用，阅读中遇到时通常可理解为“厚绒毛呢/台呢/擦拭布”一类的织物。","发音在不同语言里差异较大；如果你是在特定国家/地区的文本里看到它（例如西语材料或拉美语境），其读音和具体指代可能会更偏向当地用法。"]}
{"word":"Bayfield","summary":{"en":"Bayfield is most commonly a place name (several towns in the U.S. and Canada), and it can also be a surname.","zh":"Bayfield 最常见是地名（美国和加拿大有多处同名城镇/社区），也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun) used for several towns/communities, especially Bayfield, Wisconsin (USA), Bayfield, Colorado (USA), and Bayfield, Ontario (Canada).","zh":"（专有名词）地名：用于多个城镇/社区的名称，较常见的有美国威斯康星州的 Bayfield、美国科罗拉多州的 Bayfield，以及加拿大安大略省的 Bayfield。"},"examples":[{"en":"We spent the weekend in Bayfield, Wisconsin, and visited the shore of Lake Superior.","zh":"我们在威斯康星州的 Bayfield 过了周末，还去了苏必利尔湖的湖岸。"},{"en":"She moved to Bayfield, Colorado, for a quieter lifestyle.","zh":"她搬到科罗拉多州的 Bayfield，想过更安静的生活。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"（专有名词）姓氏：Bayfield。"},"examples":[{"en":"Mr. Bayfield will lead the meeting this afternoon.","zh":"Bayfield 先生今天下午将主持会议。"}]}],"phonetic":"/ˈbeɪˌfiːld/","extraExplanation":["Bayfield 通常由 bay（海湾）+ field（田野/原野）构成，常见于英语世界的地名命名方式，带有“海湾附近的田野/开阔地”的意象。","因为 Bayfield 在不同国家和州/省都可能出现，写作或交流时最好补充地区信息（如 Bayfield, WI / Bayfield, CO / Bayfield, ON），以避免混淆。"]}
{"word":"baygall","summary":{"en":"Baygall is a regional word for the aromatic wetland shrub sweet gale (bog myrtle), historically used to flavor ale and repel insects.","zh":"Baygall 是一种地区性说法，指湿地芳香灌木 sweet gale（沼泽香桃木），历史上常用来给麦酒调味并驱虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, aromatic shrub (sweet gale / bog myrtle, Myrica gale) that grows in wet, boggy areas, especially in northern Europe; its leaves were traditionally used for scenting beer and as an insect repellent","zh":"一种生长在沼泽湿地的芳香小灌木（香桃木/沼泽香桃木，学名 Myrica gale），常见于北欧一带；其叶子传统上用于给啤酒增香，或用来驱虫"},"examples":[{"en":"In Scotland, baygall was once added to ale to give it a bitter, spicy scent.","zh":"在苏格兰，baygall 曾被加入麦酒中，带来微苦而辛香的气味。"},{"en":"The boggy path was lined with baygall, and the air smelled fresh and herbal.","zh":"湿软的小路两旁长着 baygall，空气里有一种清新草本的香味。"}]}],"synonyms":["sweet gale","bog myrtle","Myrica gale"],"phonetic":"/ˈbeɪˌɡɔl/","extraExplanation":["这个词多见于英国（尤其苏格兰、英格兰北部）等地区性用法，现代日常英语里不常见；更常用的名称是 sweet gale 或 bog myrtle。","历史上，baygall 常被用作“gruit”（一种在啤酒花普及前用于调味啤酒的草药混合物）的一部分，也因为气味浓郁而被用于驱虫或熏香。"]}
{"word":"Bayh","summary":{"en":"Bayh is mainly a U.S. surname, and it is widely recognized from the name Bayh–Dole Act.","zh":"Bayh 主要是美国姓氏；也因《Bayh–Dole 法案》这一名称而广为人知。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname), best known in U.S. politics and law through people such as Senator Birch Bayh.","zh":"姓氏（家族名）；在美国政治与法律领域较知名，例如美国参议员 Birch Bayh。"},"examples":[{"en":"Senator Birch Bayh helped shape major U.S. constitutional and education policy debates.","zh":"参议员 Birch Bayh 参与并影响了美国重要的宪法与教育政策讨论。"},{"en":"The last name Bayh is often mentioned in discussions of the Bayh–Dole Act.","zh":"在讨论《Bayh–Dole 法案》时，经常会提到 Bayh 这个姓。"}]},{"partOfSpeech":"other","definition":{"en":"Used as part of the name of the Bayh–Dole Act, a U.S. law about inventions from federally funded research.","zh":"用于《Bayh–Dole 法案》的名称中；该美国法律涉及联邦资助研究产生的发明与专利（技术转移）。"},"examples":[{"en":"The Bayh–Dole Act lets universities license inventions created with federal research funding.","zh":"《Bayh–Dole 法案》允许大学对联邦资助研究产生的发明进行许可（授权）管理。"},{"en":"Many technology-transfer offices cite Bayh–Dole when explaining patent licensing.","zh":"许多高校/机构的技术转移办公室在解释专利许可时会引用《Bayh–Dole 法案》。"}]}],"synonyms":["(no direct synonyms; proper noun)"],"phonetic":"/baɪ/","extraExplanation":["“Bayh”常被读作 /baɪ/（类似英文 bye 的音）。作为专有名词，它本身不表示“一个普通词义”，主要是姓名或法律名称的一部分。","《Bayh–Dole Act》（1980）全名常译为《拜杜法案/贝-多尔法案》，与参议员 Birch Bayh 和参议员 Bob Dole 的姓有关。该法案对美国高校与科研机构的专利与成果转化制度影响很大。"]}
{"word":"bayhead","summary":{"en":"Bayhead means the inner end of a bay; in coastal science it can also refer to a “bayhead delta.”","zh":"bayhead 指海湾的湾头（最里面）；在海岸科学中也可指“湾头三角洲”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the inner end of a bay (the part farthest from the open sea), where rivers may enter and sediment often builds up","zh":"海湾的湾头、湾的最里面（离外海最远的部分），常是河流汇入、泥沙堆积的区域"},"examples":[{"en":"They built a small marina near the bayhead because the water was calmer there.","zh":"他们在湾头附近建了一个小码头，因为那里的水更平静。"},{"en":"The river slows down at the bayhead and drops sediment.","zh":"河流在湾头处减速，并沉积泥沙。"}]},{"partOfSpeech":"n.","definition":{"en":"(geology/coastal science) a delta formed at the head of a bay","zh":"（地质/海岸科学）湾头三角洲：在海湾湾头形成的三角洲"},"examples":[{"en":"Researchers mapped the bayhead delta to understand past flooding.","zh":"研究人员绘制了湾头三角洲的地图，以了解过去的洪水情况。"}]}],"synonyms":["head of the bay","inner bay","upper bay"],"phonetic":"/ˈbeɪˌhɛd/","extraExplanation":["“bayhead”在日常英语里不算常见，更常见的说法是“the head of the bay”。在海岸地貌学里，它常出现在复合词“bayhead delta（湾头三角洲）”中。","注意不要和地名混淆：有些地方名会写作“Bay Head”（如美国新泽西州的一个小镇），而“Bayhead”也可能作为个别地名或机构名称出现，具体需看上下文。"]}
{"word":"baying","summary":{"en":"Baying means making a long, loud howl (like hounds or wolves), and it can also describe people loudly demanding something in an aggressive way.","zh":"Baying 指猎犬或狼等发出长而响的嚎叫；也可比喻人群带攻击性地大声叫嚷、要求某事。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(of a dog, wolf, etc.) making a long, loud howl or deep bark","zh":"（狗、狼等）发出长而响的嚎叫（低沉的吠叫）"},"examples":[{"en":"We could hear hounds baying in the distance.","zh":"我们能听到远处猎犬在嚎叫。"},{"en":"The dog kept baying at the moon all night.","zh":"那只狗整晚对着月亮嚎叫。"},{"en":"A pack of wolves was baying beyond the trees.","zh":"一群狼在树林外嚎叫。"}]},{"partOfSpeech":"vi.","definition":{"en":"(figurative) shouting angrily or demanding something loudly and repeatedly","zh":"（比喻）怒吼般地叫嚷；大声反复要求（某事）"},"examples":[{"en":"Reporters were baying for answers outside the courthouse.","zh":"记者们在法院外大声嚷嚷要答案。"},{"en":"Some fans were baying for the coach to be fired.","zh":"一些球迷大声要求解雇教练。"}]}],"synonyms":["howling","yowling","barking","clamoring","jeering"],"phonetic":"/ˈbeɪɪŋ/","extraExplanation":["“baying”来自动词“bay”（猎犬的嚎叫声）。在文学或新闻里常用来营造“群体情绪高涨、带攻击性”的画面，比如“the crowd was baying for blood”（群情激愤、嗜血般地叫嚷），语气通常偏负面。"]}
{"word":"bayish","summary":{"en":"“Bayish” is rare/nonstandard; it can mean “bay-like,” but it’s often a misspelling of “boyish.”","zh":"“bayish”很少见/不规范；可勉强理解为“像海湾的”，但更常见是把“boyish（少年感的）”拼错。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Nonstandard or very rare word. If used, it usually means “somewhat like a bay” or “having the feeling of a bay (a coastal inlet).”","zh":"非标准或非常少见的词。若有人使用，通常表示“有点像海湾的 / 带有海湾氛围的”。"},"examples":[{"en":"The coastline here is bayish, with small inlets and calm water.","zh":"这里的海岸线有点“海湾状”，有很多小海湾，水面也比较平静。"},{"en":"We stayed in a bayish cove that felt protected from the wind.","zh":"我们住在一个有点像海湾的海湾里，感觉能挡住风。"}]},{"partOfSpeech":"other","definition":{"en":"Often a misspelling of “boyish” (meaning like a boy; youthful).","zh":"常见于把“boyish（男孩般的、少年气的）”拼错。"},"examples":[{"en":"If you meant “boyish”: He has a boyish smile.","zh":"如果你想写的是“boyish”：他有一种少年感的笑容。"},{"en":"If you meant “boyish”: She prefers a boyish haircut.","zh":"如果你想写的是“boyish”：她更喜欢偏中性、少年感的发型。"}]}],"synonyms":["bay-like","coastal","inlet-like","boyish (if that’s what you meant)"],"phonetic":"/ˈbeɪɪʃ/","extraExplanation":["“bayish”在英语里不算常用词；很多时候更可能是拼写错误。","英语后缀“-ish”常表示“有点……的 / 大约…… / 带……风格的”，比如 greenish（有点绿）、sixish（大约六点）、childish（孩子气的）。如果你是想表达“有点像海湾的”，用 bay-like / somewhat like a bay 会更自然。"]}
{"word":"bayldonite","summary":{"en":"Bayldonite is a rare bright-green copper–lead arsenate mineral.","zh":"bayldonite（贝尔登石）是一种罕见的亮绿色含铜、铅砷酸盐矿物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare green mineral made mainly of copper and lead arsenate (often found as crusts or small crystals).","zh":"一种罕见的绿色矿物，主要成分是含铜和铅的砷酸盐（常见为结壳状或细小晶体）。"},"examples":[{"en":"The rock sample contains small patches of bayldonite on the surface.","zh":"这块岩石样品表面有一些小片状的贝尔登石。"},{"en":"Bayldonite is sometimes collected by mineral enthusiasts because of its bright green color.","zh":"由于颜色鲜绿色，贝尔登石有时会被矿物爱好者收藏。"}]}],"phonetic":"/ˈbeɪldəˌnaɪt/","extraExplanation":["bayldonite 属于矿物学词汇，日常英语中很少出现，更多见于地质报告、矿物目录或博物馆标签。","词源上通常被认为来自人名 Bayldon（用于纪念相关人士），后缀 -ite 常用于表示“某某矿物/岩石”（如 calcite 方解石、malachite 孔雀石）。","由于含砷（arsenate），在实际处理矿物标本时通常需要注意安全与防尘。"]}
{"word":"Bayle","summary":{"en":"Bayle is most commonly the name of the French philosopher Pierre Bayle, and it can also be a surname.","zh":"Bayle 最常见指法国哲学家皮埃尔·贝尔，也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Pierre Bayle (1647–1706), a French philosopher and writer known for his skeptical thinking and for promoting religious toleration.","zh":"皮埃尔·贝尔（1647–1706），法国哲学家与作家，以怀疑主义思想以及提倡宗教宽容而闻名。"},"examples":[{"en":"In our philosophy class, we read a short passage from Bayle on toleration.","zh":"在哲学课上，我们读了一段贝尔关于宽容的文字。"},{"en":"Some historians say Bayle influenced later Enlightenment thinkers.","zh":"一些历史学者认为贝尔影响了后来的启蒙思想家。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname).","zh":"姓氏（如：Bayle）。"},"examples":[{"en":"Dr. Bayle will lead the discussion today.","zh":"贝尔博士今天将主持讨论。"},{"en":"Her last name is Bayle, spelled B-A-Y-L-E.","zh":"她的姓是 Bayle，拼作 B-A-Y-L-E。"}]}],"phonetic":"/beɪl/","extraExplanation":["“Bayle”作为历史人物通常指皮埃尔·贝尔。他最著名的作品之一是《历史与批判辞典》（Historical and Critical Dictionary），通过大量注释与评论展示对权威与传统观点的质疑，也为后来更重视理性与思想自由的启蒙运动提供了思想土壤。"]}
{"word":"Bayless","summary":{"en":"Bayless is most commonly a surname; rarely, it can mean “without bay (laurel) leaves.”","zh":"Bayless 最常见是姓氏；较少见时可表示“没有月桂叶的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper name) A family name (surname).","zh":"（专有名词）姓氏。"},"examples":[{"en":"Rick Bayless is a well-known American chef.","zh":"Rick Bayless 是一位知名的美国厨师。"},{"en":"Ms. Bayless will speak at the meeting tomorrow.","zh":"Bayless 女士将于明天在会议上发言。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) Without bay (laurel) leaves; not flavored or decorated with bay leaves.","zh":"（罕见）不含月桂叶的；未用月桂叶调味或点缀的。"},"examples":[{"en":"The original recipe is bayless, so it tastes a bit simpler.","zh":"原始配方不放月桂叶，所以味道更朴素一些。"},{"en":"He made a bayless stew because he didn’t have any bay leaves.","zh":"他做了一个不放月桂叶的炖菜，因为家里没有月桂叶。"}]}],"synonyms":["(adj.) without bay leaves","(adj.) no bay leaves"],"phonetic":"/ˈbeɪləs/","extraExplanation":["“Bayless”最常见的用法是英语姓氏，而不是日常词汇。","在现代英语中，形容词“bayless”较少见；如果想表达“没有放月桂叶”，更自然的说法通常是“without bay leaves”或“no bay leaves.”"]}
{"word":"baylet","summary":{"en":"“Baylet” is a rare word meaning a small bay or inlet; it can also be a surname.","zh":"“Baylet”较罕见，可指“小海湾/小港湾”，也可能是姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) A small bay or inlet (a small curved part of a coast where the sea comes in).","zh":"（罕见）小海湾；小港湾（海水进入陆地的弧形海岸凹入处）。"},"examples":[{"en":"The fishermen anchored their boat in a quiet baylet near the rocks.","zh":"渔民把船停泊在岩石旁一个安静的小海湾里。"},{"en":"A narrow path led down to a sheltered baylet.","zh":"一条狭窄的小路通向一个避风的小海湾。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname): Baylet.","zh":"姓氏：Baylet（拜莱特／贝莱特等音译）。"},"examples":[{"en":"Dr. Baylet will see you now.","zh":"Baylet 医生现在可以见你了。"}]}],"synonyms":["small bay","inlet","cove"],"phonetic":"/ˈbeɪlət/","extraExplanation":["“baylet”在现代英语里非常少见，更常见的词是“bay”（海湾）或“inlet”（小海湾/水道入口）。如果你是在阅读中遇到它，也有可能是地名、姓氏，或是把其他词拼错了（例如 bay leaf /bey leaf/ “月桂叶”，或 ballet “芭蕾”）。如果你能提供上下文句子，我可以帮你确认具体含义。"]}
{"word":"Bayley","summary":{"en":"Bayley is mainly a surname or given name, most often a spelling variant of Bailey.","zh":"Bayley 主要用作姓氏或名字，常见为 Bailey 的变体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A family name (surname); a spelling variant of “Bailey.”","zh":"姓氏；是“Bailey”的一种拼写变体。"},"examples":[{"en":"Dr. Bayley will speak at the conference tomorrow.","zh":"贝利博士明天将在会议上发言。"},{"en":"I saw Bayley listed on the class roster.","zh":"我在班级名单上看到了 Bayley 这个名字。"}]},{"partOfSpeech":"n.","definition":{"en":"A given name (first name), used for any gender but more commonly for boys in some places.","zh":"名字（名）；可用于任何性别，但在一些地区更常见于男孩。"},"examples":[{"en":"Bayley is starting a new job next week.","zh":"Bayley 下周开始新工作。"}]}],"synonyms":["Bailey"],"phonetic":"/ˈbeɪli/","extraExplanation":["“Bayley”通常被视为“Bailey”的变体拼写。在英语文化里，Bailey/ Bayley 常与中古英语职业词源有关（与管理者、执达吏/管家一类角色相关）。","学习时也可以顺带认识同音的普通名词“bailey”（城堡的外院/外墙围起的庭院），常见于中世纪城堡语境；但作为人名时一般不带这个含义。"]}
{"word":"baylike","summary":{"en":"Baylike means shaped like a bay or having bay-like coastal features.","zh":"Baylike 指“呈海湾状的、类似海湾特征的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having the shape or characteristics of a bay (a curved part of a coast where the sea pushes into the land)","zh":"呈海湾状的；类似海湾特征的（指海岸线向内弯入、海水伸入陆地的地方）"},"examples":[{"en":"The coastline here is baylike, with a gentle curve and calm water.","zh":"这里的海岸线呈海湾状，弧度柔和，海水平静。"},{"en":"A baylike inlet makes a safe place for small boats.","zh":"海湾状的海湾入口为小船提供了安全停泊处。"}]}],"synonyms":["bay-shaped","crescent-shaped","curved"],"phonetic":"/ˈbeɪˌlaɪk/","extraExplanation":["“baylike”在实际写作中更常见的形式是带连字符的“bay-like”。它属于描述地形的形容词，多用于地理、旅游、环境类文本。","注意不要和“bay leaf”（月桂叶）混淆；“baylike”通常与海岸地貌有关，而不是香料或植物。"]}
{"word":"Baylis","summary":{"en":"Baylis is most commonly a surname, and it can also appear in some brand or company names.","zh":"Baylis 最常见是英文姓氏，也可能出现在某些品牌或公司名称中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname); used to refer to a person whose last name is Baylis","zh":"姓氏“Baylis”；用于指代姓 Baylis 的人"},"examples":[{"en":"Dr. Baylis will see you at 3 p.m.","zh":"Baylis 医生会在下午三点见你。"},{"en":"I met Ms. Baylis at the conference.","zh":"我在会议上认识了 Baylis 女士。"}]},{"partOfSpeech":"n.","definition":{"en":"a name used by some companies or brands (for example, in product names); meaning depends on the specific brand or context","zh":"一些公司或品牌名称中的“Baylis”（例如出现在产品名里）；具体含义取决于品牌或语境"},"examples":[{"en":"This lotion is from Baylis & Harding.","zh":"这款润肤露来自 Baylis & Harding。"}]}],"phonetic":"/ˈbeɪlɪs/","extraExplanation":["“Baylis”多见于英语国家的姓氏。其词源常被认为与中古英语/古法语中表示“执达吏、管家（bailiff）”一类的职业称呼有关，因此属于“职业姓氏”（像 Smith、Baker 那样）。具体家族来源仍会因地区与族谱而不同。","作为人名/姓氏时，通常需要首字母大写：Baylis；用在称呼中可搭配 Mr./Ms./Dr. 等。"]}
{"word":"Baylor","summary":{"en":"“Baylor” most commonly refers to Baylor University in Texas; it can also be a surname.","zh":"“Baylor”最常指美国德州的贝勒大学；也可作英文姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a private Christian (Baptist-rooted) university in Waco, Texas, USA","zh":"美国德克萨斯州韦科市的一所私立基督教（源于浸信会传统）大学：贝勒大学"},"examples":[{"en":"She was accepted to Baylor and plans to study biology.","zh":"她被贝勒大学录取了，打算学习生物学。"},{"en":"Baylor is known for strong programs in business and health sciences.","zh":"贝勒大学以商科和健康科学等强势专业而闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname)","zh":"（姓氏）贝勒"},"examples":[{"en":"Mr. Baylor will speak at the meeting this afternoon.","zh":"贝勒先生将于今天下午在会议上发言。"},{"en":"Her last name is Baylor.","zh":"她的姓是贝勒。"}]}],"synonyms":["Baylor University (when referring to the school)"],"phonetic":"/ˈbeɪlər/","extraExplanation":["“Baylor”最常见的指代是“Baylor University（贝勒大学）”。它位于德州的Waco（韦科），校队常被称为“Baylor Bears（贝勒熊）”。在美国语境中，单独说“Baylor”通常就默认指这所大学。","词源上，“Baylor”也可作为英文姓氏使用；在不同地区可能对应不同家族的拼写与来源。"]}
{"word":"Bayly","summary":{"en":"Bayly is most commonly a surname, usually a less common spelling of “Bailey.” In older usage it can also be a variant spelling of “bailey,” a castle courtyard/outer enclosure.","zh":"Bayly 最常见的是姓氏，通常是 “Bailey” 的较少见拼写；在较早用法中也可作为 “bailey”（城堡外庭/外堡）的拼写变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname); a less common spelling of “Bailey.”","zh":"姓氏；“Bailey”的一种较少见的拼写形式。"},"examples":[{"en":"Dr. Bayly will see you now.","zh":"Bayly 医生现在会见你。"},{"en":"Her last name is Bayly, spelled B-A-Y-L-Y.","zh":"她的姓是 Bayly，拼写是 B-A-Y-L-Y。"}]},{"partOfSpeech":"n.","definition":{"en":"a spelling variant of “bailey” (historical term), meaning the outer wall or courtyard of a castle.","zh":"“bailey”的一种拼写变体（历史用语），指城堡的外庭/外堡（内外城墙之间的院落）。"},"examples":[{"en":"In older texts, you may see “bayly” used where modern English prefers “bailey.”","zh":"在较早的文本中，你可能会看到用 “bayly” 来表示现代英语更常写的 “bailey”。"}]}],"synonyms":["Bailey","Bayley"],"phonetic":"/ˈbeɪli/","extraExplanation":["作为姓氏时，Bayly 通常被视为 Bailey 的变体拼写。Bailey 这个姓在英语世界很常见，来源可能与中世纪的职业或职务有关（例如负责管理事务的人），也可能与地名/建筑术语有关（如城堡外庭 bailey）。","在阅读历史文献或家谱资料时，同一个家族姓氏可能出现多种拼写（如 Bailey/Bayly/Bayley），这在标准拼写尚未统一的年代尤其常见。"]}
{"word":"bayman","summary":{"en":"Bayman usually means a coastal person—often a fisherman—who works around a bay; a much rarer meaning relates to hunting with baying hounds.","zh":"Bayman 通常指在海湾附近生活或以海湾为生的人（常为渔民）；更罕见的含义与使用会“baying”的猎犬狩猎有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who lives, works, or fishes around a bay (a curved area of sea or lake along the coast); often used regionally for a coastal fisherman.","zh":"（多为地区用法）住在海湾附近、在海湾工作或在海湾捕鱼的人；常指沿海渔民。"},"examples":[{"en":"Many baymen in the area make their living from oysters and clams.","zh":"当地很多“baymen（湾区渔民）”靠养殖或采捕牡蛎和蛤蜊为生。"},{"en":"He learned boating from the baymen who knew every channel and tide.","zh":"他从那些熟知每条水道和潮汐的湾区渔民那里学会了驾船。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a hunter or dog-handler connected with hounds that bay (bark loudly while tracking or cornering an animal).","zh":"（罕见）与“baying（追踪或围困猎物时的高声吠叫）”猎犬相关的猎人或驯犬人。"},"examples":[{"en":"In older hunting stories, a bayman may be mentioned alongside the hounds.","zh":"在一些较老的狩猎故事里，可能会把“bayman”与猎犬一起提到。"}]}],"synonyms":["fisherman","oysterman","clammer","coastal fisherman","local fisherman"],"phonetic":"/ˈbeɪmən/","extraExplanation":["“Bayman”在现代英语里并不是高频词，更常见于特定地区与行业语境（例如美国东北部沿海社区，有时用来指在海湾采捕贝类、捕鱼的人）。写作或口语中若想更通用，可以改用 “fisherman,” “oysterman,” “clammer,” 或 “local fisherman”。"]}
{"word":"baymen","summary":{"en":"Baymen are people who live and work on a bay, especially traditional fishers or shellfish harvesters.","zh":"baymen 指在海湾地区生活、工作的人，尤指传统渔民或贝类采集者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) People who make their living on or near a bay, especially by fishing, oystering, crabbing, or boating; the plural of “bayman.”","zh":"（复数）以海湾及其周边为生的人，尤指靠捕鱼、挖牡蛎/蛤蜊、捕蟹或航运为业的人；为 bayman 的复数。"},"examples":[{"en":"The baymen headed out at dawn to check their crab pots.","zh":"这些湾区渔民天一亮就出海去查看蟹笼。"},{"en":"Local baymen know the tides and channels better than anyone.","zh":"当地的湾民最了解潮汐和航道。"},{"en":"The festival celebrates the history of the baymen and their seafood traditions.","zh":"这个节日庆祝湾民的历史与海鲜传统。"}]}],"synonyms":["fishermen","fishers","oystermen","watermen","seafarers"],"phonetic":"/ˈbeɪmən/","extraExplanation":["“bayman/baymen”是比较地域性的用法，在美国东海岸（如切萨皮克湾一带）常用来指从事捕蟹、打捞牡蛎等工作的人，带有浓厚的地方生活与传统意味。","在加拿大纽芬兰与拉布拉多等地区，“baymen”有时也可泛指居住在海湾沿岸小社区的人（与城市居民相对），强调乡镇/外港社区的身份。","中美洲伯利兹历史上也出现过专名意义的“Baymen”，指早期在当地从事伐木、贸易与定居的英国移民群体；在历史语境里常需大写。"]}
{"word":"Bayminette","summary":{"en":"Bay Minette is a city in Alabama, USA, and the county seat of Baldwin County.","zh":"Bay Minette 是美国阿拉巴马州的一座城市，也是鲍德温县的县城。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small city in southwestern Alabama, USA; the county seat of Baldwin County.","zh":"美国阿拉巴马州西南部的一座小城市；鲍德温县（Baldwin County）的县城（行政中心）。"},"examples":[{"en":"Bay Minette is the county seat of Baldwin County, Alabama.","zh":"Bay Minette 是阿拉巴马州鲍德温县的县城。"},{"en":"She grew up near Bay Minette before moving to Mobile.","zh":"她在 Bay Minette 附近长大，后来搬到莫比尔（Mobile）。"}]}],"phonetic":"/beɪ ˌmɪˈnɛt/","extraExplanation":["“Bay Minette”是专有名词，常见写法是分开两词：Bay Minette。","词源通常被认为与法语有关：minette可指“小的/可爱的（女性化）”之类的含义，因此地名常被解释为“大致相当于‘小海湾’或‘可爱的小海湾’的命名传统”，但具体历史来源在不同资料中会有细微差异。","在美国地名里，Bay（海湾）常与附近的地理环境相关；学习时可以把它当作地理专名来记：用于地址、新闻、旅行与地域背景介绍。"]}
{"word":"Baynebridge","summary":{"en":"Baynebridge is typically a proper name and is often a misspelling of Bainbridge.","zh":"Baynebridge通常是专有名词，多为Bainbridge的误拼或变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Baynebridge (often a misspelling of “Bainbridge”) is used as a proper name, usually a place name or a family name.","zh":"Baynebridge（常见为“Bainbridge”的拼写误写）通常作为专有名词使用，多指地名或姓氏。"},"examples":[{"en":"I think “Baynebridge” is a spelling mistake—did you mean Bainbridge Island in Washington?","zh":"我觉得“Baynebridge”可能是拼写错误——你是不是想说华盛顿州的贝恩布里奇岛（Bainbridge Island）？"},{"en":"Her last name is sometimes written as Baynebridge, but the family spells it Bainbridge.","zh":"她的姓有时会被写成Baynebridge，但家族的拼法是Bainbridge。"}]}],"synonyms":["Bainbridge"],"phonetic":"/ˈbeɪnˌbrɪdʒ/","extraExplanation":["“Bainbridge”是更常见、也更标准的拼写：在英语世界里既可作姓氏，也常见于地名（例如美国的Bainbridge Island、Bainbridge, Georgia等）。","如果你是在找某个具体地点/人名，建议核对原文来源（地图、证件、书名页等），因为“Baynebridge”更像变体或误拼。"]}
{"word":"bayness","summary":{"en":"“Bayness” is a rare word meaning the quality of being bay (reddish-brown), usually describing a horse’s coat color.","zh":"“bayness”很少见，通常指“栗色/枣红色（马毛色）”这种特征或状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being bay (reddish-brown), especially referring to a horse’s coat color","zh":"“栗色/枣红色（马毛色）”的状态或特征（多用于描述马的毛色）"},"examples":[{"en":"The colt’s bayness became darker as it matured.","zh":"这匹小马长大后，栗色的毛色变得更深了。"},{"en":"She admired the mare’s bayness in the sunlight.","zh":"她很欣赏那匹母马在阳光下的栗色毛色。"}]}],"synonyms":["bay color","bay coloring","bay coat"],"phonetic":"/ˈbeɪnəs/","extraExplanation":["“bay”在马术语境里常指一种毛色：身体呈红褐色（枣红/栗色），鬃毛与四肢下部常为黑色；加上名词后缀“-ness”可以构成“……的性质/状态”。不过“bayness”在现代英语里非常少见，更常说“bay coat / bay coloring / bay color”。","如果你想表达“生意/业务”，正确拼写是“business”；如果你指姓氏，常见拼写是“Baynes”（人名/姓氏）。"]}
{"word":"Bayogoula","summary":{"en":"Bayogoula is a historical Indigenous tribe name from Louisiana and also a Louisiana place name derived from that tribe (often seen as “Bayou Goula”).","zh":"Bayogoula 既是路易斯安那地区历史上的一个原住民族群名称，也可作由此演变而来的当地地名（常见为 “Bayou Goula”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Native American (Indigenous) people historically living along the lower Mississippi River area in what is now Louisiana, known from French colonial records.","zh":"（历史上）居住在今美国路易斯安那州密西西比河下游地区的一个原住民族群名称，常见于法国殖民时期的记载。"},"examples":[{"en":"French colonial documents mention the Bayogoula living near the Mississippi River in the early 1700s.","zh":"法国殖民时期的文献提到，18世纪初 Bayogoula 人生活在密西西比河附近。"},{"en":"The Bayogoula are part of the complex history of Indigenous nations in Louisiana.","zh":"Bayogoula 是路易斯安那原住民族群复杂历史的一部分。"}]},{"partOfSpeech":"n.","definition":{"en":"A Louisiana place name derived from the tribal name (seen in forms like “Bayou Goula”), referring to local areas such as a bayou/community.","zh":"源自该族群名称的路易斯安那地名（常见拼写如 “Bayou Goula”），可指当地的河湾/沼泽水道或社区等。"},"examples":[{"en":"Some maps show the name in the form Bayou Goula in Louisiana.","zh":"一些地图上会以 Bayou Goula 的形式标注这个路易斯安那地名。"},{"en":"The place name Bayogoula reflects the region’s Indigenous and French colonial past.","zh":"地名 Bayogoula 体现了当地的原住民与法殖民历史背景。"}]}],"synonyms":["Bayou Goula (variant place-name form)"],"phonetic":"/ˌbaɪoʊˈɡuːlə/","extraExplanation":["“Bayogoula”多见于历史与地名语境，现代更常在路易斯安那看到相关地名拼写“Bayou Goula”。它通常被认为与当地原住民语言与法语转写有关，但不同史料对具体词源细节可能有差异。"]}
{"word":"bayogoula","summary":{"en":"Bayou Goula: a Louisiana place name (a bayou/area and nearby community).","zh":"Bayou Goula：路易斯安那州的地名（指一条巴尤水道/地区及附近社区）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name in Louisiana, U.S.—most commonly referring to the Bayou Goula area/stream and the nearby community in Iberville Parish.","zh":"美国路易斯安那州的地名——常指“Bayou Goula（巴尤古拉）”这条水道及其附近的社区（位于艾伯维尔教区）。"},"examples":[{"en":"We drove through Bayou Goula on the way to Baton Rouge.","zh":"我们去巴吞鲁日的路上开车经过了 Bayou Goula（巴尤古拉）。"},{"en":"The fishing spots near Bayou Goula are popular with locals.","zh":"Bayou Goula 附近的钓鱼点很受当地人欢迎。"}]}],"synonyms":["Bayou Goula, Louisiana","Bayou Goula (bayou)"],"phonetic":"/ˌbaɪ.oʊ ˈɡuːlə/","extraExplanation":["“bayou”在路易斯安那一带常指低缓流动的河汊、沼泽水道，属于当地典型地貌与文化词汇。","“Goula”与当地原住民部族名称有关（历史上有 Bayou Goula/“Goula” 相关称呼），因此这个地名带有地区历史与族群记忆的痕迹。"]}
{"word":"bayok","summary":{"en":"Bayok is a traditional Maranao poetic chant or love song (sometimes also a courtship dance).","zh":"Bayok 指马拉瑙族传统的吟唱/情歌（有时也指求偶舞蹈）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Maranao (Philippines) poetic chant or love song, often performed in courtship settings; sometimes also refers to the accompanying courtship dance","zh":"（菲律宾）马拉瑙族传统的吟唱/情歌，多用于求偶或恋爱场景；有时也指配套的求偶舞蹈"},"examples":[{"en":"At the cultural night, a singer performed a bayok as a form of traditional courtship poetry.","zh":"在文化之夜，一位歌者演唱了 bayok，作为一种传统的求偶诗歌。"},{"en":"The festival featured bayok performances that highlighted Maranao heritage.","zh":"节庆活动安排了 bayok 表演，展示马拉瑙族的文化传承。"}]}],"synonyms":["traditional love song","poetic chant","courtship song"],"phonetic":"/baɪˈjɑk/","extraExplanation":["“Bayok”多见于菲律宾棉兰老岛马拉瑙（Maranao）文化语境中，常被介绍为传统情歌/抒情吟唱，也可能与求偶舞蹈或表演传统相关。不同地区与资料对其侧重点（“歌/吟唱”或“舞”）可能略有差异。","如果你是在聊天、游戏ID、或社交媒体上看到“bayok”，也可能是人名/昵称/地名的拼写；你可以贴出一句原文，我可以按具体语境解释。"]}
{"word":"bayonet","summary":{"en":"A bayonet is a knife that attaches to a rifle; it can also mean to stab with one.","zh":"bayonet 指可装在步枪上的刺刀；也可作动词表示用刺刀刺/攻击。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long, sharp knife that can be attached to the end of a rifle and used as a weapon","zh":"刺刀（可装在步枪枪口上的长而尖的刀，用作武器）"},"examples":[{"en":"The soldier fixed a bayonet to his rifle before moving forward.","zh":"士兵前进前把刺刀装到步枪上。"},{"en":"The museum displayed an old rifle with a bayonet beside it.","zh":"博物馆展出了一支旧步枪，旁边放着一把刺刀。"}]},{"partOfSpeech":"v.","definition":{"en":"to attack, stab, or threaten with a bayonet","zh":"用刺刀刺；用刺刀攻击或威胁"},"examples":[{"en":"He was trained to bayonet an enemy in close combat (though modern armies rarely use this).","zh":"他受训在近距离格斗中用刺刀刺敌人（不过现代军队很少这样做）。"}]}],"synonyms":["knife (general)","blade","stabbing weapon"],"phonetic":"/ˈbeɪ.ə.nɛt/","extraExplanation":["“Bayonet”常出现在战争史、军事训练和文学作品中，用来象征近身搏斗的残酷与紧张。现代战争中刺刀实战用途减少，但在一些军队里仍保留作为训练、仪式或备用工具。","词源上一般认为与法语有关（早期与法国地名 Bayonne 相关的说法很常见），反映了它在欧洲军事史中的传播。"]}
{"word":"bayoneted","summary":{"en":"Bayoneted means “stabbed with a bayonet,” usually describing a violent injury in a military or conflict context.","zh":"Bayoneted 指“被刺刀刺伤/刺穿”，多用于军事或冲突语境，描述较暴力的伤害。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle) Stabbed or pierced with a bayonet (a knife attached to the end of a rifle).","zh":"（过去式/过去分词）用刺刀刺伤或刺穿（刺刀是装在步枪枪口上的刀刃）。"},"examples":[{"en":"The soldier was bayoneted during the close combat.","zh":"在近身搏斗中，那名士兵被刺刀刺伤。"},{"en":"The report said several people were bayoneted in the chaos.","zh":"报告称在混乱中有几人遭到刺刀刺伤。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective, in passive form) Having been stabbed with a bayonet.","zh":"（形容词，被动形式）被刺刀刺过的；遭刺刀刺伤的。"},"examples":[{"en":"They treated a bayoneted victim at the field hospital.","zh":"他们在战地医院救治了一名被刺刀刺伤的伤者。"}]}],"synonyms":["stabbed","pierced","skewered","wounded"],"phonetic":"/ˌbeɪəˈnɛt/","extraExplanation":["“bayonet”最初指一种军用刺刀，后来也可作动词，表示“用刺刀刺”。“bayoneted”通常出现在战争叙述、历史写作或新闻报道中，语气较沉重，涉及暴力场景时在表达上可注意语境与敏感性。","在英语里也常见被动结构：be bayoneted（被刺刀刺伤）。更中性或泛化的说法可用 stabbed / wounded。"]}
{"word":"bayoneteer","summary":{"en":"A bayoneteer is someone who fights with a bayonet; rarely, it can mean to stab with a bayonet.","zh":"bayoneteer 指使用刺刀作战的人；很少也可作动词，表示用刺刀刺。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a soldier (or person) who fights with a bayonet attached to a rifle","zh":"使用（步枪）刺刀作战的士兵；刺刀手"},"examples":[{"en":"In the old war film, a bayoneteer charges across the field.","zh":"在那部老战争电影里，一名刺刀手冲过战场。"},{"en":"The officer ordered the bayoneteers to advance in a line.","zh":"军官命令刺刀手排成一线前进。"}]},{"partOfSpeech":"v.","definition":{"en":"to stab or attack with a bayonet (rare)","zh":"（罕见）用刺刀刺；用刺刀攻击"},"examples":[{"en":"The text describes soldiers who bayoneteered anyone who resisted.","zh":"文中描述士兵用刺刀刺杀任何反抗的人。"}]}],"synonyms":["bayonet fighter","infantryman (context)","to bayonet (verb)"],"phonetic":"/ˌbeɪəˈnɪtɪr/","extraExplanation":["“bayoneteer”在现代英语中不常见，更常用的说法是“soldier with a bayonet / bayonet fighter”或直接用动词“to bayonet（用刺刀刺）”。","这个词多见于历史叙述、战争回忆录或文学/影视里的战争场景描写，尤其涉及步兵近距离白刃战。"]}
{"word":"bayoneting","summary":{"en":"Bayoneting means stabbing with a bayonet, or figuratively attacking someone harshly.","zh":"Bayoneting 指用刺刀刺杀/刺伤，也可比喻用尖刻方式猛烈攻击他人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of stabbing someone with a bayonet (a knife fixed to the end of a rifle)","zh":"用刺刀（装在步枪前端的刀）刺伤/刺杀人的行为"},"examples":[{"en":"The soldiers were trained in bayoneting techniques.","zh":"士兵们接受了刺刀刺杀技巧的训练。"},{"en":"The report described close combat, including bayoneting in the trenches.","zh":"报告描述了近距离战斗，包括在战壕里的刺刀格斗。"}]},{"partOfSpeech":"vt.","definition":{"en":"stabbing someone with a bayonet; attacking with a bayonet","zh":"用刺刀刺（某人）；用刺刀攻击"},"examples":[{"en":"He was accused of bayoneting a wounded enemy.","zh":"他被指控用刺刀刺伤一名受伤的敌人。"},{"en":"In the novel, the scene of bayoneting is written to show the brutality of war.","zh":"在小说里，刺刀刺杀的场景用来展现战争的残酷。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) attacking someone harshly with words or actions","zh":"（比喻）用言语或行动猛烈攻击、咄咄逼人"},"examples":[{"en":"During the debate, he kept bayoneting his opponent with personal insults.","zh":"在辩论中，他不断用人身攻击“刺”对手。"},{"en":"She felt bayoneted by the critic’s harsh comments.","zh":"她觉得自己被评论家的刻薄话语狠狠“刺伤”。"}]}],"synonyms":["stabbing","impaling","spearing","skewering","assaulting"],"phonetic":"ˈbeɪəˌnɛtɪŋ","extraExplanation":["“bayoneting”来自动词 bayonet（刺刀/用刺刀刺）。它通常出现在战争叙述与军事训练语境中，带有强烈的暴力与历史记忆；在新闻或写作中使用时要注意场合与语气。","比喻用法多见于政治辩论、评论写作，强调“尖锐、带刺的攻击”，语气偏负面。"]}
{"word":"bayonets","summary":{"en":"Bayonets are knife-like blades attached to rifles; the word can also be a verb meaning to stab with one or to attach it.","zh":"bayonets 指装在步枪上的刺刀（复数）；也可作动词，表示用刺刀刺或把刺刀装到枪上。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A knife-like blade that attaches to the end of a rifle, used as a weapon (especially in the military).","zh":"（尤指军队用的）刺刀：一种装在步枪枪口上的刀形刃器，用作武器。"},"examples":[{"en":"The soldiers fixed their bayonets before moving forward.","zh":"士兵们在前进前把刺刀装上。"},{"en":"The museum displayed an old rifle with a bayonet.","zh":"博物馆展出了一支带刺刀的旧步枪。"}]},{"partOfSpeech":"v.","definition":{"en":"To stab or attack someone with a bayonet; to fit a bayonet onto a rifle.","zh":"用刺刀刺（或攻击）；给步枪装上刺刀。"},"examples":[{"en":"In the film, the guard threatened to bayonet the intruder.","zh":"在电影里，卫兵威胁要用刺刀刺入侵者。"},{"en":"They were ordered to bayonet the rifles and stand watch.","zh":"他们被命令把刺刀装到步枪上并站岗。"}]}],"synonyms":["knife (general)","blade","dagger (similar)","stab (verb)","impale (verb)"],"phonetic":"/ˈbeɪəˌnɛts/","extraExplanation":["“Bayonet(s)”是“bayonet”的复数形式。作为动词时更常见于军事语境、历史叙述或影视作品中，日常生活里不太常用。","词源与文化背景：bayonet常被认为与法国城市Bayonne有关（据说早期这种刀具在当地流行），因此它带有明显的欧洲早期火器战争色彩。现代军队仍可能配备，但实战使用频率远低于历史时期。","文学/报道中常见的引申用法：bayonet也会用来强调“以武力压迫/强行推进”的画面感（例如“bayonets fixed”常用来渲染紧张、威慑或冲突升级）。"]}
{"word":"bayonetted","summary":{"en":"Bayonetted means stabbed or wounded with a bayonet; less commonly, it can be used figuratively for a harsh, forceful attack.","zh":"Bayonetted 指“被刺刀刺伤/用刺刀刺”，较少情况下可作比喻，表示被强硬、咄咄逼人地攻击。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"stabbed or wounded with a bayonet (a knife fixed to the end of a rifle)","zh":"用刺刀（装在步枪枪口的刀）刺伤或捅伤；被刺刀刺中的"},"examples":[{"en":"The soldier was bayonetted during the close combat.","zh":"那名士兵在近身搏斗中被刺刀刺伤。"},{"en":"The report described several people as having been bayonetted.","zh":"报告称有数人遭到刺刀刺伤。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative, less common) attacked or pushed through harshly and forcefully","zh":"（比喻，较少见）以粗暴、强硬的方式攻击或强行推进"},"examples":[{"en":"In the debate, he felt bayonetted by a series of aggressive questions.","zh":"在辩论中，他觉得自己被一连串咄咄逼人的问题“刺”得措手不及。"}]}],"synonyms":["stabbed","pierced","impaled","knifed"],"phonetic":"/ˌbeɪəˈnɛtɪd/","extraExplanation":["“bayonetted”是动词“bayonet”的过去式/过去分词。它多出现在战争史、军事叙述或新闻报道中，语气往往严肃，带有暴力与伤害的含义；写作时要注意场合与敏感度。","名词“bayonet”（刺刀）源自法语，常被认为与法国城市Bayonne有关（历史上与刀具制作联系密切）。"]}
{"word":"bayonetting","summary":{"en":"Bayonetting means stabbing or attacking with a bayonet; it can be used as a noun (the act) or as the -ing form of “bayonet.”","zh":"Bayonetting 指用刺刀刺击或攻击；既可作名词表示“刺刀刺击行为”，也可作动词 bayonet 的 -ing 形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of stabbing or attacking someone with a bayonet (a blade fixed to the end of a rifle)","zh":"用刺刀（装在步枪枪口的刀刃）刺击或攻击他人的行为"},"examples":[{"en":"The soldier was trained in bayonetting during basic training.","zh":"这名士兵在基础训练中学习了刺刀刺击。"},{"en":"The novel describes bayonetting as a brutal part of close combat.","zh":"这部小说将刺刀刺击描写为近身战中残酷的一部分。"}]},{"partOfSpeech":"v.","definition":{"en":"(present participle/gerund of “bayonet”) using a bayonet to stab or attack","zh":"（bayonet 的现在分词/动名词）用刺刀刺击或攻击"},"examples":[{"en":"He was accused of bayonetting a wounded enemy soldier.","zh":"他被指控用刺刀刺伤一名受伤的敌军士兵。"},{"en":"The film avoids showing soldiers bayonetting anyone directly.","zh":"这部电影避免直接呈现士兵用刺刀刺人的画面。"}]}],"synonyms":["stabbing with a bayonet","bayonet attack","spearing (with a bayonet)","impaling (with a bayonet)"],"phonetic":"/ˌbeɪ.əˈnɛtɪŋ/","extraExplanation":["“bayonetting”常见于英式拼写，双写 -tt-；美式英语更常写作“bayoneting”。","这个词语义较为血腥，常出现在战争史、军事训练或文学/影视对近身战的描写中；日常对话里较少使用。"]}
{"word":"bayong","summary":{"en":"Bayong is a traditional woven market bag/basket used in Southeast Asia.","zh":"Bayong 指东南亚常见的传统编织市场袋/篮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woven shopping bag or basket (often made from pandan leaves, buri/palm, or other natural fibers), common in Southeast Asia","zh":"（东南亚常见的）编织购物袋/篮（常用班兰叶、棕榈叶等天然纤维编成）"},"examples":[{"en":"She carried vegetables home in a bayong from the wet market.","zh":"她从传统市场用一个 bayong 把蔬菜带回家。"},{"en":"Bring a bayong to reduce plastic bag use.","zh":"带一个 bayong 出门可以减少塑料袋的使用。"}]}],"synonyms":["woven bag","market bag","shopping bag","basket"],"phonetic":"ˈbaɪ.jɔŋ","extraExplanation":["“bayong”常见于菲律宾英语（Philippine English）或马来/印尼语借词语境中，指一种耐用的传统编织袋，过去多用于赶集买菜，现在也常被当作环保可重复使用袋的象征。","在正式的国际英语里不算常用词；如果面对不熟悉东南亚文化的听众，可以补充说明为“a woven market bag”。"]}
{"word":"Bayonne","summary":{"en":"Bayonne is the name of a city in New Jersey (USA) and also a city in southwestern France.","zh":"Bayonne 是地名，可指美国新泽西州的巴约讷市，也可指法国西南部的巴约讷市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in northeastern New Jersey, U.S., on a peninsula between Newark Bay and New York Bay (near Jersey City).","zh":"美国新泽西州东北部的一座城市，位于纽瓦克湾与纽约湾之间的半岛上（靠近泽西城）。"},"examples":[{"en":"She commutes from Bayonne to Manhattan by train and subway.","zh":"她从巴约讷通勤到曼哈顿，先坐火车再换地铁。"},{"en":"The Bayonne Bridge connects New Jersey to Staten Island.","zh":"巴约讷大桥连接新泽西州与史泰登岛。"}]},{"partOfSpeech":"n.","definition":{"en":"a city in southwestern France, near the Atlantic coast, known for Basque influence and as the place associated with Bayonne ham.","zh":"法国西南部的一座城市，靠近大西洋海岸，以巴斯克文化影响著称，也常与“巴约讷火腿”联系在一起。"},"examples":[{"en":"We visited Bayonne in France and tried local ham at a market.","zh":"我们去了法国的巴约讷，在市场上尝了当地的火腿。"},{"en":"Bayonne sits near the border region with strong Basque culture.","zh":"巴约讷位于边境附近的地区，巴斯克文化氛围很浓。"}]}],"synonyms":["(no direct synonyms; proper place name)"],"phonetic":"/baɪˈoʊn/","extraExplanation":["“Bayonne”是专有名词（地名），英语里通常不翻译含义而是音译为“巴约讷”。","美国的新泽西州 Bayonne 与法国的 Bayonne 不是同一个地方；阅读或听力中可通过上下文（New Jersey / France、桥梁、火腿等）来判断指的是哪一个。"]}
{"word":"bayou","summary":{"en":"A bayou is a slow-moving, swampy waterway, especially in the southern United States.","zh":"bayou 指（尤指美国南部的）水流缓慢、常见于湿地的河汊或沼泽水道。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A slow-moving stream or a marshy waterway, especially in the southern U.S. (notably Louisiana), often surrounded by wetlands.","zh":"（尤指美国南部、路易斯安那一带的）河汊、沼泽水道；通常水流缓慢、周围多湿地。"},"examples":[{"en":"They took a boat tour through the bayou at sunset.","zh":"他们在日落时分乘船游览了那片河汊湿地水道。"},{"en":"Alligators and herons are common sights in the bayou.","zh":"在河汊里，经常能看到短吻鳄和苍鹭。"},{"en":"After the heavy rain, the bayou rose and flooded nearby roads.","zh":"大雨过后，河汊水位上涨，淹没了附近的道路。"}]}],"synonyms":["swampy waterway","marsh channel","slough","creek (regional)"],"phonetic":"/ˈbaɪ.u/","extraExplanation":["“bayou”常让人联想到路易斯安那的克里奥尔/卡津文化、湿地生态与音乐意象（例如“bayou country”）。它并不等同于普通“river”，更强调湿地环境里的缓慢水道、支流或回水区。","词源上常见解释是来自路易斯安那地区的法语用法，并可能与当地原住民语言有关；在美国英语中带有明显的地域色彩。"]}
{"word":"Bayougoula","summary":{"en":"Bayougoula (often “Bayou Goula”) is a place name for a small community in Louisiana, USA.","zh":"Bayougoula（常写作“Bayou Goula”）是美国路易斯安那州一个小社区的地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small community (unincorporated area) in Iberville Parish, Louisiana, USA; often written as “Bayou Goula.”","zh":"美国路易斯安那州伊伯维尔教区的一个小社区（非建制地区）；常写作“Bayou Goula”。"},"examples":[{"en":"She grew up near Bayougoula in southern Louisiana.","zh":"她在路易斯安那州南部的Bayougoula附近长大。"},{"en":"The road to Bayou Goula runs along the Mississippi River.","zh":"通往Bayou Goula的路沿着密西西比河延伸。"}]}],"synonyms":["Bayou Goula"],"phonetic":"/ˌbaɪ.oʊ ˈɡuːlə/","extraExplanation":["“Bayou”是路易斯安那常见地名元素，源自当地语言经法语影响，常指低洼地带的缓流小河/水道；“Goula”一般被认为与当地原住民部族名称有关。因此该地名带有明显的路易斯安那法语与原住民文化交织的历史痕迹。","英文中此类地名通常作为专有名词使用：首字母大写；也常见两词写法“Bayou Goula”。"]}
{"word":"bayous","summary":{"en":"“Bayous” are slow, marshy waterways, especially in the southern U.S.","zh":"“Bayous”指（尤指美国南部的）缓慢、沼泽化的水道/河汊。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A slow-moving stream or a marshy channel, especially in the southern United States (plural of “bayou”).","zh":"（bayou 的复数）缓慢流动的小河/水道或沼泽水渠，尤指美国南部地区的河汊与湿地水道。"},"examples":[{"en":"Alligators are often seen in the bayous of Louisiana.","zh":"在路易斯安那的 bayous（沼泽水道）里经常能看到短吻鳄。"},{"en":"The small town sits between pine forests and winding bayous.","zh":"这个小镇坐落在松林与蜿蜒的沼泽水道之间。"},{"en":"After heavy rain, the bayous can overflow into nearby neighborhoods.","zh":"大雨过后，这些沼泽水道可能会漫溢到附近社区。"}]}],"synonyms":["marsh","swamp","creek","channel","wetlands"],"phonetic":"ˈbaɪ.uː","extraExplanation":["“Bayou”在美国文化中常让人联想到路易斯安那等墨西哥湾沿岸的湿地景观，以及卡津（Cajun）与克里奥尔（Creole）文化。词源常被认为与当地法语/地区用法有关，表示低洼、湿润、流速很慢的水道。","使用上，“bayou(s)”通常带有地域色彩；在其他地方更常用“marsh / swamp / creek / channel”等更通用的词。"]}
{"word":"Baypines","summary":{"en":"Bay Pines is a place name in Florida, and it can also refer to the VA medical center located there.","zh":"Bay Pines 是佛罗里达州的地名，也常用来指当地的退伍军人事务部（VA）医疗中心。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a community/area in Pinellas County on Florida’s Gulf Coast, near St. Petersburg; often used as a place name (proper noun).","zh":"（专有名词）美国佛罗里达州皮尼拉斯县的一个社区/地区，靠近圣彼得堡；常作为地名使用。"},"examples":[{"en":"My uncle lives in Bay Pines, Florida, close to the beach.","zh":"我叔叔住在佛罗里达州的 Bay Pines，离海滩很近。"},{"en":"We drove through Bay Pines on the way to St. Petersburg.","zh":"我们去圣彼得堡的路上开车经过了 Bay Pines。"}]},{"partOfSpeech":"n.","definition":{"en":"the VA Bay Pines Healthcare System, a U.S. Department of Veterans Affairs medical center in Bay Pines, Florida (often shortened to “Bay Pines VA”).","zh":"（常指）美国退伍军人事务部在佛罗里达州 Bay Pines 的医疗系统/医疗中心（常简称 “Bay Pines VA”）。"},"examples":[{"en":"He has an appointment at Bay Pines VA next week.","zh":"他下周要去 Bay Pines VA 复诊。"},{"en":"Many veterans receive care through the Bay Pines healthcare system.","zh":"许多退伍军人在 Bay Pines 的医疗系统接受治疗。"}]}],"synonyms":["Bay Pines, FL","Bay Pines VA"],"phonetic":"/beɪ paɪnz/","extraExplanation":["“Bay” 指“海湾”，“pines” 指“松树”。这个地名大致有“海湾边的松树林/松树海湾”之意，符合佛罗里达沿海地区常见的自然景观命名方式。","在真实语境里，人们说 “Bay Pines” 往往是指地点；说 “Bay Pines VA” 更明确地指退伍军人医院系统。"]}
{"word":"Bayport","summary":{"en":"Bayport is a proper name for several U.S. places and also a famous fictional town in the Hardy Boys mysteries.","zh":"Bayport 是美国多个地方的地名，也是《哈迪兄弟》侦探故事中很有名的虚构小镇名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun) used for several towns/communities in the United States.","zh":"一个地名（专有名词），在美国有多个城镇/社区使用这个名称。"},"examples":[{"en":"Bayport, New York is on Long Island.","zh":"Bayport（纽约州）位于长岛。"},{"en":"She moved to Bayport for a quieter life near the water.","zh":"她搬到 Bayport，想在水边过更安静的生活。"}]},{"partOfSpeech":"n.","definition":{"en":"a fictional town, best known as the hometown of the Hardy Boys in classic American mystery stories.","zh":"一个虚构的小镇，最出名的是作为《哈迪兄弟》经典美国侦探小说中的家乡。"},"examples":[{"en":"Many Hardy Boys adventures begin in Bayport.","zh":"许多《哈迪兄弟》的冒险故事都从 Bayport 开始。"},{"en":"In the book, the detectives return to Bayport after solving the case.","zh":"在书里，侦探破案后回到 Bayport。"}]}],"phonetic":"/ˈbeɪˌpɔrt/","extraExplanation":["“Bayport”由 bay（海湾）+ port（港口）组成，所以常见于靠海/靠湖、有港口或临水的地方名。","作为虚构地名时，它与美国青少年侦探系列《The Hardy Boys（哈迪兄弟）》联系最紧密；在不同版本中，Bayport 的具体地理位置有时会被写得比较模糊。"]}
{"word":"Bayreuth","summary":{"en":"Bayreuth is a city in Bavaria, Germany, and it often also refers to the famous annual Bayreuth Festival for Wagner operas.","zh":"Bayreuth（拜罗伊特）是德国巴伐利亚州的城市；在语境中也常指以演出瓦格纳歌剧闻名的年度“拜罗伊特音乐节”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in Bavaria, Germany, best known for its strong connection to the composer Richard Wagner and for hosting major classical music events.","zh":"德国巴伐利亚州的一座城市，以与作曲家理查德·瓦格纳（Richard Wagner）的密切关联以及举办重要古典音乐活动而闻名。"},"examples":[{"en":"Bayreuth is a small city in northern Bavaria with a big cultural reputation.","zh":"拜罗伊特是巴伐利亚北部的一座小城，却拥有很高的文化声誉。"},{"en":"Many opera lovers travel to Bayreuth in the summer.","zh":"许多歌剧爱好者会在夏天前往拜罗伊特。"}]},{"partOfSpeech":"n.","definition":{"en":"(Often in context) The Bayreuth Festival, an annual opera festival famous for performances of Wagner’s works.","zh":"（常见语境）拜罗伊特音乐节：每年举行的歌剧节，以演出瓦格纳作品而闻名。"},"examples":[{"en":"She finally got tickets to Bayreuth after years of waiting.","zh":"她等了多年，终于买到了拜罗伊特音乐节的门票。"},{"en":"Bayreuth is closely associated with Wagner’s operas.","zh":"拜罗伊特与瓦格纳的歌剧紧密相连。"}]}],"synonyms":["(for the festival context) Bayreuth Festival"],"phonetic":"/ˈbaɪrɔɪt/","extraExplanation":["“Bayreuth”在英语里通常指城市本身，但在音乐/歌剧圈里也常被当作“Bayreuth Festival（拜罗伊特音乐节）”的简称使用。","瓦格纳为自己的作品建造了专门的剧院“Festspielhaus（节日剧院）”，其声学与舞台设计影响深远，因此拜罗伊特在西方古典音乐文化中具有象征意义。"]}
{"word":"Bays","summary":{"en":"“Bays” usually means multiple “bays” (sea inlets or sections/compartments), and it can also mean bay leaves in cooking; as a verb form, it means “(a dog) bays” = howls.","zh":"“Bays”通常是“bay”的复数：海湾/隔间（区位），也可指烹饪用的月桂叶；作动词形式时表示“（狗等）长嚎”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “bay”: a part of the sea (or a large lake) that is partly surrounded by land.","zh":"“bay”的复数：海湾；（或大湖的）湾，部分被陆地环绕的水域。"},"examples":[{"en":"We spent the afternoon swimming in the quiet bays along the coast.","zh":"我们下午在海岸边安静的几个海湾里游泳。"},{"en":"Many bays provide safe places for boats to anchor.","zh":"许多海湾为船只提供安全的停泊处。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “bay”: a section or compartment in a building or vehicle, often separated by beams, walls, or markings.","zh":"“bay”的复数：间隔；分隔区；（建筑、仓库、车库等的）隔间/区位。"},"examples":[{"en":"The warehouse has separate loading bays for different trucks.","zh":"这个仓库有给不同卡车使用的独立装卸区。"},{"en":"Please park in one of the open bays.","zh":"请停在空的车位之一。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “bay”: the leaves of the bay laurel used as a cooking herb; “bay leaves.”","zh":"“bay”的复数：月桂叶（烹饪香料），即“bay leaves”。"},"examples":[{"en":"Add two bays to the soup and remove them before serving.","zh":"往汤里放两片月桂叶，出锅前把它们捞出。"},{"en":"The stew tastes better after simmering with bays.","zh":"炖菜加了月桂叶小火慢煮后味道更好。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of “bay”: (of a dog, wolf, etc.) to make a long, loud sound; to howl.","zh":"“bay”的第三人称单数： （狗、狼等）长嚎；吠叫（通常指拉长的叫声）。"},"examples":[{"en":"At night, the hound bays at the moon.","zh":"夜里，猎犬对着月亮长嚎。"},{"en":"The dogs bay when they catch a scent.","zh":"狗闻到气味时会长声吠叫。"}]}],"synonyms":["inlets","coves","harbors","compartments","sections","parking spaces","howls"],"phonetic":"/beɪ/","extraExplanation":["“bays”本身通常不是一个独立词条，而是“bay”的复数（海湾/隔间/月桂叶等）或动词“bay”的第三人称单数（指动物长嚎）。具体含义要看上下文：比如 coastal bays（沿海海湾）、loading bays（装卸区）、bay leaves（常说bays或bay leaves）。"]}
{"word":"bays","summary":{"en":"“Bays” is usually the plural of “bay,” meaning sea inlets or separate sections (like service bays). It can also mean dogs/wolves howling (“bays”), bay leaves, or a reddish-brown horse color.","zh":"“bays”通常是“bay”的复数，指多个海湾或多个隔间/工位（如维修工位）。也可指（狗/狼）长声吠叫、月桂叶，或马的枣红色毛色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of bay) A broad inlet of the sea or a large, curved area of water partly enclosed by land.","zh":"（bay 的复数）海湾；由陆地部分环抱、向海伸入的大片水域。"},"examples":[{"en":"The boat sailed through several bays along the coast.","zh":"那艘船沿海岸航行，经过了好几个海湾。"},{"en":"Many towns grew up around natural bays because the water is calmer there.","zh":"许多城镇在天然海湾周围发展起来，因为那里水面更平静。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural of bay) A separate section or space in a building, vehicle, or structure, often one of several similar parts.","zh":"（bay 的复数）（建筑、车辆或结构中的）隔间；分区；（一排中相似的）一个单元。"},"examples":[{"en":"The mechanic pulled the car into one of the service bays.","zh":"修理工把车开进了其中一个维修工位。"},{"en":"Please park in the loading bays at the back of the store.","zh":"请停在商店后面的装卸区。"}]},{"partOfSpeech":"v.","definition":{"en":"(third-person singular of bay) To make a long, loud sound (especially said of dogs or wolves).","zh":"（bay 的第三人称单数）（尤指狗或狼）长声吠叫；嗥叫。"},"examples":[{"en":"At night, the dog bays at the moon.","zh":"夜里，那只狗对着月亮长声吠叫。"},{"en":"The hounds bay loudly when they catch a scent.","zh":"猎犬闻到气味时会大声吠叫。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural of bay) A bay tree or its leaves, used as a seasoning (often called “bay leaf”).","zh":"（bay 的复数）月桂树；月桂叶（常作香料，称 bay leaf）。"},"examples":[{"en":"Add two bays to the soup and remove them before serving.","zh":"在汤里放两片月桂叶，端上桌前把它们捞出。"},{"en":"The recipe calls for dried bays to flavor the stew.","zh":"这道菜需要用干月桂叶给炖菜增香。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural of bay) A reddish-brown color, especially describing a horse.","zh":"（bay 的复数）枣红色；（尤指马的）枣红色毛色。"},"examples":[{"en":"Two bays and a black horse were in the field.","zh":"田里有两匹枣红马和一匹黑马。"},{"en":"The stable keeps several bays for riding lessons.","zh":"马厩里养了好几匹枣红马用于骑乘课。"}]}],"synonyms":["inlets","coves","harbors","sections","compartments","stalls"],"phonetic":"/beɪ/","extraExplanation":["“bays”最常见是名词复数：多个海湾/多个隔间（如 service bays 维修工位、loading bays 装卸区）。也可能是动词 bay（长声吠叫）的第三人称单数：He bays at night.","常见相关表达：at bay 表示“被逼到绝境但仍在抵抗/被围困”；如 The deer was brought to bay（猎物被逼到无路可退）。"]}
{"word":"Bayshore","summary":{"en":"Bayshore means the shoreline of a bay, and it’s also commonly used as a place name for areas near a bay.","zh":"Bayshore 指“海湾的岸线/湾岸”，也常用作靠近海湾的地区、道路等的地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the land along the edge of a bay; the shoreline of a bay","zh":"（海湾的）湾岸；海湾边的岸线"},"examples":[{"en":"We walked along the bayshore at sunset.","zh":"我们在日落时沿着湾岸散步。"},{"en":"New houses are being built near the bayshore.","zh":"湾岸附近正在建新房。"}]},{"partOfSpeech":"n.","definition":{"en":"(often capitalized) used in names of towns, neighborhoods, roads, or parks located near a bay","zh":"（常大写）用于地名/道路名/公园名等，表示“靠海湾的……/湾岸的……”"},"examples":[{"en":"She lives in Bayshore, a community near the water.","zh":"她住在Bayshore，一个靠近水边的社区。"},{"en":"Take Bayshore Road and turn left at the light.","zh":"走Bayshore Road，在红绿灯处左转。"}]}],"synonyms":["bayfront","shoreline","coastline","waterfront"],"phonetic":"/ˈbeɪˌʃɔr/","extraExplanation":["“Bayshore”是由 bay（海湾）+ shore（海岸）组成的复合词，在英语地名中很常见；因此看到大写的 Bayshore 时，通常是在指具体地点或道路名称。"]}
{"word":"Bayside","summary":{"en":"Bayside means “next to a bay” or “the area along a bay.”","zh":"Bayside 指“在海湾旁的”，或“海湾边一带”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a place) next to or along a bay (a part of the sea partly surrounded by land).","zh":"（地点）位于海湾旁的；沿海湾的。"},"examples":[{"en":"They rented a small apartment in a bayside neighborhood.","zh":"他们在一个海湾旁的社区租了一间小公寓。"},{"en":"We had lunch at a bayside café with a view of the boats.","zh":"我们在一家临海湾的咖啡馆吃午饭，可以看到船只。"}]},{"partOfSpeech":"n.","definition":{"en":"the area next to a bay; the shore or district along a bay.","zh":"海湾边一带；临海湾的岸边或地区。"},"examples":[{"en":"On weekends, the bayside gets busy with walkers and cyclists.","zh":"周末海湾边会有很多散步和骑行的人。"},{"en":"A new park opened on the bayside.","zh":"海湾边新开了一个公园。"}]}],"synonyms":["by the bay","seaside (similar)","coastal (broader)"],"phonetic":"/ˈbeɪˌsaɪd/","extraExplanation":["“Bayside”也常作为专有名词使用：很多城市或社区名叫 Bayside（例如纽约皇后区的一个社区）。在这种情况下通常要大写。","在流行文化中，“Bayside”还是一支美国乐队的名字；同样作为专有名词需大写。"]}
{"word":"baysmelt","summary":{"en":"Baysmelt is a small coastal-bay fish (a type of smelt), used for food or bait.","zh":"baysmelt 指生活在海湾沿岸的一种小型胡瓜鱼，可食用或作鱼饵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, slender fish (a kind of smelt) that lives in coastal bays and is sometimes eaten or used as bait","zh":"一种生活在海湾沿岸的小型细长鱼（胡瓜鱼的一种），有时可食用或用作鱼饵"},"examples":[{"en":"We bought fried baysmelt at the harbor market.","zh":"我们在港口市场买了炸海湾胡瓜鱼。"},{"en":"Baysmelt are often used as bait for larger fish.","zh":"海湾胡瓜鱼常被用作钓大鱼的鱼饵。"}]}],"synonyms":["smelt","bay smelt"],"phonetic":"/ˈbeɪ smɛlt/","extraExplanation":["“baysmelt”通常也会写作“bay smelt”。它不是一个日常常用词，更多出现在钓鱼、海鲜市场或自然科普语境里。","不同地区对“smelt/胡瓜鱼”的叫法和具体鱼种可能不完全一致；在北美语境里，它常指生活在近岸水域的小型鱼类，常见做法包括油炸、盐烤等。"]}
{"word":"baysmelts","summary":{"en":"Baysmelts are small silvery fish called bay smelts (plural).","zh":"baysmelts 指“湾胡瓜鱼/湾银鱼”的复数，即多条这种小型银色鱼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small silvery fish (bay smelt); the plural form refers to more than one.","zh":"（湾胡瓜鱼 / 湾银鱼）一种小型、银色的鱼；复数形式表示多条这种鱼。"},"examples":[{"en":"In winter, baysmelts gather near the shore in large schools.","zh":"冬天，湾胡瓜鱼会成群聚集在近岸水域。"},{"en":"The fishermen brought in buckets of baysmelts for the market.","zh":"渔民把一桶桶湾胡瓜鱼运到市场出售。"}]}],"synonyms":["bay smelts","smelts"],"phonetic":"/ˈbeɪ smɛlts/","extraExplanation":["“baysmelts”通常写作“bay smelts”（两个词），其中 smelt 是一种小型鱼类的统称；在英语里也常用作单数“a bay smelt”。","在北美语境中，smelt 常和季节性捕捞、油炸小鱼（fried smelts）等饮食文化联系在一起；不同地区对“bay smelt”的具体物种指代可能略有差异。"]}
{"word":"Baytown","summary":{"en":"Baytown: a city near Houston, Texas, USA.","zh":"Baytown：美国德克萨斯州休斯敦附近的一座城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in Texas, USA, near Houston on Galveston Bay; known for its petrochemical industry and as a port/industrial area.","zh":"美国德克萨斯州的一座城市，靠近休斯敦、位于加尔维斯顿湾附近；以石化工业以及港口/工业区闻名。"},"examples":[{"en":"Baytown is about a 30-minute drive east of Houston.","zh":"Baytown在休斯敦以东，开车大约30分钟。"},{"en":"She got a job at a refinery in Baytown.","zh":"她在Baytown的一家炼油厂找到了工作。"},{"en":"We stopped in Baytown on the way to the coast.","zh":"我们去海边的路上在Baytown停了一下。"}]}],"synonyms":["(proper noun) none; related: Houston area city","town","city"],"phonetic":"/ˈbeɪ.taʊn/","extraExplanation":["Baytown 是专有名词（地名），通常不加冠词：说 “in Baytown / from Baytown”，而不是 “in the Baytown”。","它位于德州哈里斯县（部分延伸到钱伯斯县），靠近加尔维斯顿湾与休斯敦航道，历史上与石油、炼化与化工产业联系紧密。"]}
{"word":"Bayview","summary":{"en":"Bayview is most often a place name, and it can also mean “a view of a bay,” especially in housing or travel contexts.","zh":"Bayview 多用于地名；也可表示“海湾景观”，常见于住房或旅游语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name used for towns, neighborhoods, streets, parks, etc., especially in English-speaking countries; it often suggests the area is near a bay or has a view of one.","zh":"（专有名词）常见地名，用于城镇、社区、街道、公园等；通常暗示该地靠近海湾或能看到海湾。"},"examples":[{"en":"She moved to Bayview because it’s close to the water.","zh":"她搬到 Bayview，因为那里离海边很近。"},{"en":"Take the Bayview exit and follow the signs to downtown.","zh":"从 Bayview 出口下去，然后按指示牌去市中心。"}]},{"partOfSpeech":"n.","definition":{"en":"a view of a bay (the sea or a large inlet), especially from a house, hotel, or high place.","zh":"海湾景观；从房子、酒店或高处看到的海湾景色。"},"examples":[{"en":"Our room has a beautiful bayview.","zh":"我们的房间有很美的海湾景观。"},{"en":"They chose an apartment with a bayview and lots of natural light.","zh":"他们选了一套能看到海湾、采光也很好的公寓。"}]}],"synonyms":["bayside","waterfront (context-dependent)"],"phonetic":"/ˈbeɪˌvjuː/","extraExplanation":["“Bayview”常见于英语国家的地名（toponym）。它通常由 bay（海湾）+ view（景观）组成，因此带有“临湾/看海湾”的意象。具体指哪里要看语境：比如同一国家里可能有多个叫 Bayview 的社区或道路。","作为普通名词表示“海湾景观”时，英语里更常写作两词 bay view 或作形容词 bay-view（如 a bay-view room）。不过在房产广告中也可能直接写成 Bayview。"]}
{"word":"Bayville","summary":{"en":"Bayville is a proper noun used as a place name, often meaning a town by a bay; it can refer to multiple locations.","zh":"Bayville 是一个地名（专有名词），常指靠海湾的城镇；可能对应多个不同地点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A place name (proper noun), usually referring to a town or community located by a bay; it may refer to different places in the U.S. and elsewhere depending on context (e.g., Bayville, New York; Bayville, New Jersey).","zh":"地名（专有名词），通常指靠近海湾（bay）的城镇或社区；具体指哪一个“Bayville”要看语境（例如美国纽约州的 Bayville、美国新泽西州的 Bayville 等）。"},"examples":[{"en":"I grew up in Bayville, but I moved to the city for work.","zh":"我在 Bayville 长大，但为了工作搬去了大城市。"},{"en":"Which Bayville do you mean—New York or New Jersey?","zh":"你说的是哪个 Bayville——纽约的还是新泽西的？"},{"en":"Bayville is a quiet waterfront community.","zh":"Bayville 是一个安静的滨水社区。"}]}],"synonyms":["(place name; no true synonyms)"],"phonetic":"/ˈbeɪˌvɪl/","extraExplanation":["“Bayville”是由 bay（海湾）+ -ville（城镇）构成的典型英语地名结构。-ville 来自法语，常见于北美地名（如 Nashville）。","由于它是专有名词，写作时首字母必须大写；口语或写作中最好加上州/省或国家来避免歧义（如 Bayville, NY）。"]}
{"word":"baywood","summary":{"en":"Baywood is wood from a bay tree (often bay laurel), or a regional label for wood from trees locally called “bay.”","zh":"Baywood 指月桂等“bay”类树木的木材；也可能是地区性的统称，具体树种因地而异。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"wood from a bay tree (such as bay laurel), sometimes used for small woodworking or decorative purposes.","zh":"月桂树（或其他“bay”类树木）的木材；有时用于小型木工或装饰。"},"examples":[{"en":"The box was carved from baywood and had a light, pleasant smell.","zh":"这个盒子用月桂木雕成，带着淡淡的清香。"},{"en":"Some artisans choose baywood for small crafts and inlay work.","zh":"一些工匠会选用月桂木来做小工艺品或镶嵌。"}]},{"partOfSpeech":"n.","definition":{"en":"A general term used in some areas for wood from certain trees locally called “bay” (the exact species can vary by region).","zh":"在一些地区对“bay（海湾/月桂）”这一类当地俗称树木的木材的统称（具体树种因地区而异）。"},"examples":[{"en":"The supplier listed the material as baywood, but the species wasn’t specified.","zh":"供应商把材料写成“baywood”，但没标明具体树种。"},{"en":"Ask what kind of baywood it is if you need a consistent color and grain.","zh":"如果你需要颜色和纹理一致，最好问清楚“baywood”具体是哪种木材。"}]}],"synonyms":["bay laurel wood","laurel wood"],"phonetic":"/ˈbeɪwʊd/","extraExplanation":["“baywood”不是非常常见的日常词，更常见于木材、工艺或商品描述中。由于不同地区把不同树种叫作“bay”，所以在采购或写作时，最好补充具体树种名称（例如 bay laurel/月桂）。"]}
{"word":"baywoods","summary":{"en":"Baywoods usually means woods with bay trees, or it can be a place name (a neighborhood/park) called “Baywoods.”","zh":"Baywoods 通常指长有月桂树等“bay tree”的树林；也常用作地名（社区/公园等）名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon) A wooded area where bay trees (such as bay laurel) grow; woods characterized by bay trees.","zh":"（不常见）长有月桂树等“bay tree”的林地；以月桂树为特征的树林。"},"examples":[{"en":"We hiked through the baywoods near the coast, where the air smelled faintly of bay leaves.","zh":"我们穿过海岸附近的月桂树林徒步，空气里有淡淡的月桂叶香。"},{"en":"The trail enters baywoods and then opens onto a sandy beach.","zh":"小径进入月桂树林后，又通向一片沙滩。"}]},{"partOfSpeech":"n.","definition":{"en":"A proper name for a place (e.g., a neighborhood, subdivision, park, or apartment complex) called “Baywoods.”","zh":"专有名词：名为“Baywoods”的地点（如社区、小区、公园或公寓名）。"},"examples":[{"en":"She lives in Baywoods, a quiet neighborhood on the edge of town.","zh":"她住在 Baywoods，一个位于城镇边缘的安静社区。"},{"en":"The meeting will be held at Baywoods Park at 6 p.m.","zh":"会议将于晚上六点在 Baywoods Park 举行。"}]}],"synonyms":["bay woods","bay grove","woodland","forest"],"phonetic":"/ˈbeɪwʊdz/","extraExplanation":["“bay”在地名里常指“海湾”，所以 Baywoods 也可能是“海湾边的树林/林区”的意思；但在自然语境里，“bay tree”通常指月桂（bay laurel），也就是香叶（bay leaf）的来源。","这个词在日常英语里不算常见，更常见的表达是“bay woods”（分开写）或更泛的“woodland/forest”。"]}
{"word":"bayz","summary":{"en":"“Bayz” is not standard English; it’s usually a misspelling of “bays” or a proper name.","zh":"“bayz”不是标准英语；通常是“bays”的误拼，或是专有名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or incorrect spelling. In most contexts, people mean “bays” (plural of “bay”), or it may be a username/brand name.","zh":"一种不规范/错误拼写。在多数语境里，人们可能想写的是“bays”（“bay”的复数）；也可能是用户名或品牌名。"},"examples":[{"en":"Did you mean “bays” (plural of bay), like “two bays along the coast”?","zh":"你是不是想写“bays”（bay 的复数），比如“海岸边有两个海湾”？"},{"en":"If “bayz” is a name (a shop or username), the spelling depends on that specific name.","zh":"如果“bayz”是名字（店名或用户名），拼写就以该名称的官方写法为准。"}]}],"synonyms":["bays (likely intended)"],"phonetic":"/beɪz/","extraExplanation":["“bay”最常见的意思是“海湾/港湾”（名词）；在建筑或车库里也可以指“隔间/车位”（如 parking bay）。所以你如果是想表达复数，一般写作 “bays”。","如果你告诉我你看到“bayz”的句子或上下文（例如游戏/社交媒体/地名/歌词），我可以更准确判断它指什么。"]}
