{"word":"baz","summary":{"en":"“Baz” can mean “a lot” in some NZ/Aus slang, a common placeholder word in programming (after foo/bar), or a nickname for Barry.","zh":"“baz”可指（新西兰/澳大利亚口语）“很多”，也可指编程示例中的常用占位词（foo/bar/baz），还可作Barry的昵称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, chiefly New Zealand/Australia) A lot; loads; a large amount or number.","zh":"（非正式，多见于新西兰/澳大利亚）很多；大量。"},"examples":[{"en":"We’ve got baz of time—no need to rush.","zh":"我们时间多得很——不用赶。"},{"en":"There were baz people at the concert.","zh":"演唱会现场人特别多。"}]},{"partOfSpeech":"n.","definition":{"en":"(computing) A made-up placeholder word used in examples, often after “foo” and “bar.”","zh":"（计算机领域）示例里用的占位词，常跟在“foo”和“bar”之后出现。"},"examples":[{"en":"In the code sample, replace foo, bar, and baz with your real variable names.","zh":"在代码示例中，把foo、bar、baz换成你真实的变量名。"},{"en":"The tutorial uses foo/bar/baz to show the pattern without using real data.","zh":"教程用foo/bar/baz来展示规律，而不使用真实数据。"}]},{"partOfSpeech":"n.","definition":{"en":"A nickname, especially for someone named Barry (e.g., “Baz”).","zh":"昵称，尤其常用作Barry（巴里）的昵称（如“Baz”）。"},"examples":[{"en":"Baz is coming over after work.","zh":"Baz下班后会过来。"},{"en":"Everyone calls him Baz, but his full name is Barry.","zh":"大家都叫他Baz，但他的全名是Barry。"}]}],"synonyms":["lots (slang sense)","tons","loads","placeholder name"],"phonetic":"/bæz/","extraExplanation":["在编程语境里，“foo / bar / baz”是非常常见的占位组合，用来代表“随便什么变量/函数名”，避免把注意力放到具体业务名词上。它们类似中文里说的“甲乙丙”或“某某”。这种用法在教程、文档、讨论问题时尤其常见。","“baz（很多）”这一用法带有明显地区色彩（新西兰/澳大利亚口语），在美式英语里不算常见；在美国更常用a lot of / tons of / loads of来表达“很多”。"]}
{"word":"bazaar","summary":{"en":"Bazaar means a market with many stalls (and in U.S. English, sometimes a charity fair).","zh":"Bazaar 指有许多摊位的集市；在美式英语中也可指义卖会/慈善市集。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a market (often outdoors) with many small stalls or shops selling goods; in the U.S., it can also mean a charity fair where items are sold to raise money","zh":"集市；（常见于露天、由许多小摊位组成的）市场；在美国也可指“义卖会/慈善市集”"},"examples":[{"en":"We wandered through the bazaar and bought spices, tea, and handmade scarves.","zh":"我们逛了集市，买了香料、茶叶和手工围巾。"},{"en":"The school held a winter bazaar to raise money for the library.","zh":"学校举办了冬季义卖会，为图书馆筹款。"}]}],"synonyms":["market","marketplace","fair","street market","flea market"],"phonetic":"/bəˈzɑr/","extraExplanation":["“bazaar”常让人联想到中东、南亚等地区热闹的传统市集（如伊斯坦布尔的大巴扎 Grand Bazaar）。在英语里它既可指那种历史悠久、摊位密集的市场，也可在美式语境中指社区或学校举办的义卖集市（charity bazaar）。","词源来自波斯语 bāzār（市场），后来经由多种语言进入英语，因此在文化色彩上常带有“异国风情、琳琅满目、热闹喧嚣”的联想。"]}
{"word":"bazaars","summary":{"en":"“Bazaars” is the plural of “bazaar,” meaning traditional markets with many sellers, or charity fairs where goods are sold to raise money.","zh":"“bazaars”是“bazaar”的复数，指有许多摊贩的传统市集/集市，也可指为筹款而举办的义卖会、慈善市集。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A market (often in the open air or a large hall) where many sellers offer goods, especially in the Middle East, South Asia, or other regions with a traditional marketplace culture.","zh":"（常指露天或大棚内的）集市、市场；（尤指中东、南亚等地传统的）市集。"},"examples":[{"en":"We wandered through the bazaar and bought spices, tea, and handmade scarves.","zh":"我们逛了市集，买了香料、茶叶和手工围巾。"},{"en":"In many old cities, the bazaar is the social and commercial heart of the neighborhood.","zh":"在许多古老城市里，传统市集往往是社区的社交与商业中心。"}]},{"partOfSpeech":"n.","definition":{"en":"A fundraising event or fair where items are sold, often for charity (common in American English: “charity bazaar”).","zh":"（为筹款而办的）义卖会、慈善市集。"},"examples":[{"en":"The school held a charity bazaar to raise money for new library books.","zh":"学校举办了义卖会，为图书馆的新书筹款。"},{"en":"She volunteered at the church bazaar on Saturday.","zh":"她周六在教堂的义卖市集做志愿者。"}]}],"synonyms":["markets","open-air markets","souks","fairs","charity fairs"],"phonetic":"/bəˈzɑr/","extraExplanation":["“bazaar”源自波斯语，常用来描绘具有浓厚地方色彩的传统市场：摊位密集、商品多样，可能按行业分区（如金匠街、香料街）。旅行写作里它也常用来营造“热闹、充满叫卖声与香气”的氛围。","单数是 bazaar；复数常见两种：bazaars（更常见）和 bazaars/bazaars（标准写法为 bazaars）。在英语里也有人用“bazaar”作比喻，形容场面像集市一样热闹、信息或选择很多（如 a bazaar of ideas）。"]}
{"word":"Bazaine","summary":{"en":"Bazaine is a French surname, most commonly referring to Marshal François Achille Bazaine of the Franco-Prussian War.","zh":"Bazaine 是法国姓氏，最常指普法战争时期的巴赞元帅（François Achille Bazaine）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a French surname, best known from Marshal François Achille Bazaine (1811–1888), a commander in the Franco-Prussian War.","zh":"一个法国姓氏，最常见的指代是法军将领弗朗索瓦·阿希尔·巴赞（1811–1888），他在普法战争中很有名。"},"examples":[{"en":"Bazaine is often mentioned in discussions of the Franco-Prussian War.","zh":"在讨论普法战争时，人们常常会提到巴赞（Bazaine）。"},{"en":"Some historians argue that Bazaine’s decisions contributed to France’s defeat at Metz.","zh":"一些历史学家认为，巴赞的决策促成了法国在梅斯（Metz）的失败。"}]}],"phonetic":"/bəˈzeɪn/","extraExplanation":["“Bazaine”在英语语境里通常作为专有名词出现，多指“巴赞元帅”。他在1870年普法战争中率军被围于梅斯并最终投降，导致大批法军被俘，因此在法国历史记忆中常带有争议色彩。","读音上，英语里常见近似“bə-ZAYN”（美式习惯），但在法语原音中更接近“ba-ZEN”。不同语言的读法差异，常见于法国人名在英语中的音译与习惯读音。"]}
{"word":"Bazar","summary":{"en":"Bazar means a traditional market with many stalls (often in the Middle East/South Asia), or a charity sale. It’s a variant spelling of “bazaar.”","zh":"Bazar 指传统集市（多见于中东/南亚），也可指慈善义卖会；是 bazaar 的变体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A marketplace where many small shops or stalls sell goods, especially in the Middle East or South Asia (also spelled \"bazaar\").","zh":"集市；市场（尤指中东或南亚常见的“市集”，也常拼作 bazaar）。"},"examples":[{"en":"We walked through the bazar and bought spices and handmade scarves.","zh":"我们逛了集市，买了香料和手工围巾。"},{"en":"The old city’s bazar is famous for its jewelry and carpets.","zh":"老城的集市以珠宝和地毯闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"A sale or fair (often for charity) where many items are sold in one place.","zh":"义卖会；慈善集市（常为筹款而举办）。"},"examples":[{"en":"Our school held a charity bazar to raise money for the library.","zh":"我们学校举办了慈善义卖会，为图书馆筹款。"},{"en":"She donated homemade cookies to the church bazar.","zh":"她把自制饼干捐给了教会的义卖会。"}]}],"synonyms":["bazaar","market","marketplace","fair","charity sale"],"phonetic":"/bəˈzɑr/","extraExplanation":["“bazar”是“bazaar”的常见变体拼写；在英语里更常见的标准拼写是“bazaar”。在阅读旅行文章或历史文化相关内容时两种拼写都可能出现。","这个词最常让人联想到传统市集：狭窄街巷、摊位密集、可讨价还价（bargain/haggle），是一种具有地域文化色彩的购物场景。"]}
{"word":"bazar","summary":{"en":"A bazaar is a market with many stalls (often traditional), or a charity/fundraising sale.","zh":"bazaar 指（传统的）集市/市场，也可指义卖会或募款集市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A market (often in the open air) with many small shops or stalls, especially common in the Middle East or South Asia.","zh":"（常指露天的）集市/市场，有许多小店或摊位，尤见于中东或南亚地区。"},"examples":[{"en":"We bought spices and tea at the bazaar.","zh":"我们在集市上买了香料和茶。"},{"en":"The old city’s bazaar was crowded and noisy.","zh":"老城的集市又拥挤又吵闹。"}]},{"partOfSpeech":"n.","definition":{"en":"A charity sale or fundraising event where many items are sold at tables or booths.","zh":"（慈善）义卖会/募款集市（在桌位或摊位上售卖物品的活动）。"},"examples":[{"en":"The school held a holiday bazaar to raise money for new books.","zh":"学校举办了节日义卖会，为新书筹款。"},{"en":"She donated handmade crafts to the church bazaar.","zh":"她把手工艺品捐给了教会义卖会。"}]}],"synonyms":["market","marketplace","fair","flea market"],"phonetic":"/bəˈzɑr/","extraExplanation":["你输入的 **bazar** 常见为 **bazaar** 的另一种拼写（更标准、更常见的是 bazaar）。这个词来自波斯语 *bāzār*，后来进入英语，常用来描绘“摊位密集、讨价还价、气味与声音很丰富”的传统市场氛围。","文学与文化语境中，bazaar 往往带有“异域风情/传统商业街区”的画面感；在美式英语里也常见于学校、教会举办的筹款义卖（类似中文的“跳蚤市场/义卖会”）。"]}
{"word":"bazars","summary":{"en":"Bazaar (also spelled bazar; plural: bazaars/bazars) means a busy market with many stalls, or a fundraising sale/fair.","zh":"Bazaar（也拼作 bazar；复数：bazaars/bazars）指热闹的集市/市场，也可指为筹款举办的义卖会。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural: bazaars; also spelled bazars) A market, especially one with many small shops or stalls selling different goods; often associated with the Middle East or South Asia.","zh":"（复数：bazaars；也拼作 bazars）集市；（尤指）由许多小摊位/小店组成的市场，常让人联想到中东或南亚地区的市集。"},"examples":[{"en":"We bought spices and handmade scarves at the bazaar.","zh":"我们在集市上买了香料和手工围巾。"},{"en":"The old city’s bazaar is crowded on weekends.","zh":"老城区的集市周末很拥挤。"}]},{"partOfSpeech":"n.","definition":{"en":"A fundraising sale or fair where people sell things to raise money (often for charity).","zh":"（为筹款/慈善）义卖会；慈善集市。"},"examples":[{"en":"The school held a holiday bazaar to raise money for new books.","zh":"学校举办了节日义卖会，为新书筹款。"},{"en":"She volunteered at the church bazaar on Saturday.","zh":"她周六在教堂的义卖会上做志愿者。"}]}],"synonyms":["market","marketplace","fair","flea market","charity sale"],"phonetic":"/bəˈzɑr/","extraExplanation":["“bazaar”一词源自波斯语 bāzār，后来经由阿拉伯语等语言传播到英语。英语里也常见较短的拼写“bazar”，两者意思相同；“bazars”就是“bazar”的复数拼法。","文化语境中，bazaar 常带有“热闹、多摊位、可讨价还价”的氛围联想；而在英美语境里，school/church bazaar 多指“义卖/筹款活动”，不一定是传统街市。"]}
{"word":"Bazatha","summary":{"en":"“Bazatha” is not a common standard English word; it is likely a proper noun or a misspelling/variant that needs context to interpret.","zh":"“Bazatha”不是常见的标准英语词；更可能是专名或拼写变体，需要语境才能确定含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare or non-standard word in English; most likely a proper name (person/place/company) or a misspelling/variant of another word. It does not appear as an established English vocabulary item in common dictionaries.","zh":"在英语中非常罕见或不属于标准词汇；更可能是专有名词（人名/地名/品牌名）或其他词的拼写变体/误拼。常见词典里通常不收录为正式英语单词。"},"examples":[{"en":"I couldn’t find “Bazatha” in a standard dictionary—do you mean a name or a word from another language?","zh":"我在常见词典里找不到“Bazatha”——你是指一个名字，还是来自其他语言的词？"},{"en":"If “Bazatha” is a place or brand, its meaning depends on the local language and context.","zh":"如果“Bazatha”是地名或品牌名，它的含义通常取决于当地语言与使用语境。"}]}],"phonetic":"/bəˈzæθə/","extraExplanation":["“Bazatha”看起来更像专有名词或外来词的音译/拼写。你可以把它出现的句子、来源（书名/游戏/影片/网页/人名/地名）发我，我就能更准确判断它的含义与用法。","常见的可能性：①误拼成接近“bazaar”（集市、市场）；②来自阿拉伯语/南亚语言等的词或人名；③虚构作品中的专名。"]}
{"word":"baze","summary":{"en":"“Baze” is usually a nonstandard spelling of “base,” or a proper name (surname/given name).","zh":"“Baze”通常是“base”的非标准拼写，或作为人名/姓氏等专有名词使用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Most often) a misspelling or playful spelling of “base.”","zh":"（最常见）“base”的拼写错误或一种玩笑/非正式拼写。"},"examples":[{"en":"I think you mean “base,” not “baze.”","zh":"我觉得你想写的是“base”，不是“baze”。"},{"en":"In some usernames, people spell it “baze” to look unique.","zh":"有些用户名会把它写成“baze”来显得更特别。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name or given name (e.g., the character Baze Malbus in Star Wars: Rogue One).","zh":"姓氏或名字（例如《星球大战：侠盗一号》中的角色 Baze Malbus）。"},"examples":[{"en":"Baze Malbus is a character in Rogue One.","zh":"Baze Malbus 是《侠盗一号》里的一个角色。"},{"en":"I met someone whose last name is Baze.","zh":"我遇到过一个姓 Baze 的人。"}]}],"synonyms":["base (intended spelling)"],"phonetic":"/beɪz/","extraExplanation":["“baze”在标准英语词典里不是常见的独立词条；你在写作或考试中一般应使用“base”。","如果你是在问发音：作为姓名/专有名词时常读作 /beɪz/（类似“bays”）；但如果你本来想写的是“base”，标准发音是 /beɪs/。"]}
{"word":"Bazigar","summary":{"en":"Bazigar means a magician/juggler or, figuratively, a clever trickster—commonly used in South Asian contexts.","zh":"Bazigar 指（南亚语境的）魔术师/杂耍艺人，也可比喻为耍手段的狡黠人物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian use) A magician, juggler, or performer who does tricks; an entertainer known for sleight of hand or skillful stunts.","zh":"（南亚语境）魔术师、杂耍艺人；以手法或高超技巧表演“把戏”的表演者。"},"examples":[{"en":"The bazigar amazed the crowd with card tricks and quick hands.","zh":"那位bazigar用纸牌魔术和敏捷的手法让观众惊叹。"},{"en":"At the fair, a bazigar performed juggling and small illusions for children.","zh":"在集市上，一位bazigar为孩子们表演杂耍和小魔术。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) A clever trickster or schemer—someone who manipulates situations skillfully, often to deceive.","zh":"（比喻）耍手段的人、狡黠的操纵者；擅长用计或欺骗来达成目的的人。"},"examples":[{"en":"Some people saw him as a bazigar who could talk his way out of any problem.","zh":"有些人觉得他像个bazigar，总能靠三寸不烂之舌脱身。"},{"en":"In the story, the bazigar wins by deception rather than strength.","zh":"在故事里，这个bazigar靠欺骗而不是力量取胜。"}]}],"synonyms":["magician","juggler","performer","illusionist","trickster","schemer"],"phonetic":"/ˈbɑːzɪɡɑːr/","extraExplanation":["“Bazigar/baazigar”常见于乌尔都语、印地语等南亚语言的转写，含义接近“表演把戏的人（魔术师/杂耍者）”。拼写可能见到 Baazigar / Bazigar。","在流行文化中，“Baazigar”也是一部著名的印度电影片名，因此有时人们会先联想到该电影，再引申到“擅长手段/玩弄计谋的人”的比喻用法。"]}
{"word":"bazigar","summary":{"en":"Bazigar means a trick-performing entertainer (like a juggler), and figuratively an ace or highly skillful person (common in South Asian contexts).","zh":"Bazigar指会耍把戏的表演者（如杂耍艺人），也可引申为“高手/能手”（多见于南亚语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English; from Urdu/Hindi) A performer, especially a juggler or entertainer who does tricks.","zh":"（南亚英语；源自乌尔都语/印地语）表演者，尤指杂耍艺人、耍把戏的艺人。"},"examples":[{"en":"A bazigar drew a crowd by juggling knives and telling jokes.","zh":"一位bazigar一边抛接小刀一边讲笑话，吸引了很多围观的人。"},{"en":"The children laughed as the bazigar performed magic tricks.","zh":"bazigar表演魔术把戏时，孩子们笑个不停。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) A very skillful person; an ace who can handle situations cleverly.","zh":"（引申）很厉害的人；高手、能手，善于巧妙应对各种局面的人。"},"examples":[{"en":"In negotiations, she’s a real bazigar—always calm and strategic.","zh":"在谈判中，她真是个bazigar——总是冷静又有策略。"},{"en":"He’s a bazigar with numbers and can spot mistakes instantly.","zh":"他在数字方面是个bazigar，一眼就能看出错误。"}]}],"synonyms":["performer","juggler","entertainer","magician","ace","expert"],"phonetic":"/ˈbɑːzɪɡɑːr/","extraExplanation":["“bazigar”常见于南亚语境，来自波斯语词根：bāzī（游戏/表演）+ -gar（从事者），字面有“玩/演的人”的感觉。","在流行文化中，它也常让人联想到1993年印度宝莱坞电影《Baazigar》（常见拼写带双a），因此你可能在歌名、影评或对话中见到它。"]}
{"word":"Bazil","summary":{"en":"“Bazil” is usually a name and a less common spelling of “Basil.”","zh":"“Bazil”通常是人名，多为“Basil”的较少见拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a personal name (a spelling variant of “Basil”), used for boys/men in some languages and regions","zh":"人名（“Basil”的拼写变体），在一些语言与地区用作男性名字"},"examples":[{"en":"Bazil moved to New York for graduate school.","zh":"Bazil 为了读研究生搬到了纽约。"},{"en":"We invited Bazil to join our study group.","zh":"我们邀请 Bazil 加入我们的学习小组。"}]}],"synonyms":["Basil"],"phonetic":"/ˈbeɪzəl/","extraExplanation":["“Bazil”常见于中东欧/巴尔干等地区的姓名拼写习惯，也可能是家庭偏好的个性化拼写。英语里更常见的拼写是 “Basil”。","如果你指的是香草“罗勒”，标准英文拼写通常是 “basil”（注意：这是植物/调味料，不是人名）。"]}
{"word":"Bazin","summary":{"en":"“Bazin” most commonly refers to André Bazin, a major French film critic; it can also mean a glossy dyed cotton fabric popular in West Africa.","zh":"“Bazin”最常指法国著名电影评论家安德烈·巴赞；也可指西非流行的一种有光泽的染色棉布。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"André Bazin (1918–1958), a highly influential French film critic and theorist, known for ideas about realism in cinema and for helping shape modern film criticism.","zh":"安德烈·巴赞（André Bazin，1918–1958），法国极具影响力的电影评论家与理论家，以强调电影“现实主义”等观点闻名，并深刻影响了现代电影批评。"},"examples":[{"en":"In many film classes, students read Bazin’s essays on realism and long takes.","zh":"在很多电影课上，学生会阅读巴赞关于现实主义和长镜头的文章。"},{"en":"Bazin is often mentioned when discussing the history of film criticism.","zh":"讨论电影评论史时，人们常常会提到巴赞。"}]},{"partOfSpeech":"n.","definition":{"en":"A shiny, richly dyed damask-like cotton fabric commonly worn in West Africa (often in formal outfits).","zh":"（西非常见的）一种有光泽、染色鲜艳、类似提花缎纹的棉布，常用于制作正式服装。"},"examples":[{"en":"He wore a deep-blue bazin outfit for the celebration.","zh":"他在庆典上穿了一套深蓝色的巴赞布料服装。"},{"en":"Bazin fabric is popular for weddings and other formal events in parts of West Africa.","zh":"在西非一些地区，巴赞布料常用于婚礼等正式场合。"}]}],"synonyms":["André Bazin","bazin fabric","bazin riche"],"phonetic":"/bəˈzæn/","extraExplanation":["“Bazin”更常见的是姓氏（尤其指电影理论家安德烈·巴赞）。如果你是在电影语境里看到它，通常就是这个人名。","作为布料的“bazin”多出现在西非文化与服饰语境中，常与“bazin riche（昂贵/高级的巴赞布）”等说法连用。"]}
{"word":"Bazine","summary":{"en":"Bazine is a stiff, glossy fabric; it can also mean the West African polished cotton cloth called bazin.","zh":"Bazine 指一种挺括、有光泽的布料；也可指西非常见的抛光棉布 bazin（巴赞布）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of stiff, glossy cloth (often cotton or linen), traditionally used for dresses or lining; also refers to the West African polished cotton fabric known as “bazin.”","zh":"一种较硬、带光泽的布料（常为棉或麻），传统上用于连衣裙或内衬；也可指西非常见的抛光棉布“bazin（巴赞布）”。"},"examples":[{"en":"Her skirt was made of bazine, so it held its shape well.","zh":"她的裙子是用 bazine 做的，所以很挺括。"},{"en":"In some West African weddings, people wear brightly dyed bazin fabric.","zh":"在一些西非婚礼上，人们会穿颜色鲜艳的 bazin（巴赞布）。"}]}],"synonyms":["cloth","fabric","textile"],"phonetic":"/bəˈziːn/","extraExplanation":["“bazine / bazin”在英语里较少见，更多出现在服装、纺织品或文化介绍中。西非语境里常说“bazin riche（高档巴赞布）”，通常是经过抛光（发亮、变挺）的棉布，再进行染色，用于盛装与节庆服饰。"]}
{"word":"Baziotes","summary":{"en":"Baziotes usually refers to William Baziotes, an American Abstract Expressionist painter; it can also be a surname.","zh":"Baziotes通常指美国抽象表现主义画家威廉·巴齐奥特斯；也可作为姓氏使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"William Baziotes (1912–1963), an American painter associated with Abstract Expressionism, known for moody, dreamlike images with biomorphic (organic-looking) shapes.","zh":"威廉·巴齐奥特斯（William Baziotes，1912–1963），美国画家、抽象表现主义的重要人物之一，以带有朦胧梦境感、常见生物形（有机形态）图像的作品著称。"},"examples":[{"en":"Baziotes is often discussed alongside other Abstract Expressionists like Mark Rothko and Jackson Pollock.","zh":"巴齐奥特斯常与马克·罗斯科、杰克逊·波洛克等抽象表现主义画家并列讨论。"},{"en":"The museum’s modern art gallery includes a painting by Baziotes from the 1950s.","zh":"那家博物馆的现代艺术展厅收藏了一幅巴齐奥特斯1950年代的绘画作品。"},{"en":"In class, we compared Baziotes’s mysterious figures with Surrealist influences.","zh":"课堂上，我们把巴齐奥特斯作品中神秘的形象与超现实主义影响作了比较。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname (family name).","zh":"姓氏。"},"examples":[{"en":"The last name Baziotes is most commonly recognized because of the painter William Baziotes.","zh":"“Baziotes”这个姓氏最广为人知，多半是因为画家威廉·巴齐奥特斯。"}]}],"synonyms":["Abstract Expressionist","painter","artist","modernist"],"phonetic":"/ˈbæziˌoʊts/","extraExplanation":["“Baziotes”通常不当作普通英语单词使用，而是作为专有名词（人名/姓氏）。在艺术史语境里，它多指威廉·巴齐奥特斯。","他与抽象表现主义圈子有联系，但个人风格常带有更强的诗意与“梦境般”的气氛；不少评论会提到他受超现实主义（Surrealism）与生物形抽象（biomorphic abstraction）的影响。"]}
{"word":"Bazluke","summary":{"en":"“Bazluke” is not a standard English word; it’s most likely a name/username with meaning defined by context.","zh":"“Bazluke” 不是标准英语词汇；更可能是名字/用户名，其含义需结合语境确定。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare or nonstandard term in English; most often seen as a personal name, username, or brand. It does not have a widely accepted dictionary meaning.","zh":"英语中较少见或非标准用词；最常见是人名、用户名或品牌名，并没有公认的词典义。"},"examples":[{"en":"Online, Bazluke appears to be used mainly as a username.","zh":"在网上，Bazluke 主要看起来像是一个用户名。"},{"en":"If Bazluke is a brand name, its meaning depends on the creator’s intention.","zh":"如果 Bazluke 是品牌名，它的含义取决于创作者的设定。"}]}],"synonyms":["made-up word","screen name","nickname","brand name"],"phonetic":"/ˈbæzluːk/","extraExplanation":["这个词不像常见英语单词，更像“自造词/用户名”。如果你是在某个游戏、小说、动漫或社交平台看到的，我可以根据具体语境（例如一句完整句子、出处链接、角色设定）帮你判断它可能影射的含义。","从构词外观看，Baz- 可能让人联想到 bazaar（集市）或 basil（罗勒），-luke 可能让人联想到人名 Luke（卢克）。但这只是联想，不代表真实词源或固定含义。"]}
{"word":"bazoo","summary":{"en":"Bazoo is a slang word meaning “mouth,” often used when someone talks too much or too loudly.","zh":"bazoo 是俚语，表示“嘴”，常用来形容某人话太多或太吵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, informal) A person’s mouth, especially when they are talking too much or too loudly.","zh":"（俚语，非正式）嘴；尤指话太多或说话太大声的嘴。"},"examples":[{"en":"Shut your bazoo and listen for a minute.","zh":"闭上你的嘴，先听我说一分钟。"},{"en":"He’s been running his bazoo all day about that game.","zh":"他一整天都在喋喋不休地讲那场比赛。"}]}],"synonyms":["mouth","trap","yap","gob"],"phonetic":"/bəˈzuː/","extraExplanation":["“bazoo”带有调侃、责备的语气，常见搭配有“shut your bazoo”（闭嘴）和“run your bazoo”（不停地说）。在正式场合不建议使用。","词源不完全确定，但很多人认为它可能受“kazoo”（卡祖笛，一种会“嗡嗡”响的乐器）影响，因为都和“发出声音/吵闹”有关。"]}
{"word":"bazooka","summary":{"en":"A bazooka is a shoulder-fired rocket launcher; informally it can mean an overly powerful solution or tool.","zh":"bazooka 指肩扛式火箭筒；口语中也可指“过于强力/夸张的解决办法或工具”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a shoulder-fired rocket launcher; also the weapon itself","zh":"（肩扛式的）火箭筒；也可指这种武器本身"},"examples":[{"en":"The soldier carried a bazooka on his shoulder.","zh":"士兵把火箭筒扛在肩上。"},{"en":"In old war movies, you often see a bazooka used against tanks.","zh":"在老战争电影里，你常看到用火箭筒对付坦克。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) something very powerful or oversized used to solve a problem","zh":"（非正式）“大杀器”；用来解决问题的非常强力或过度的大工具/办法（常带夸张意味）"},"examples":[{"en":"We don’t need a bazooka for this small bug—just a simple fix.","zh":"这个小问题用不着“大炮打蚊子”——简单修一下就行。"},{"en":"He brought a bazooka of a camera to a casual family dinner.","zh":"他去随便的家庭晚餐还带了台“巨无霸”相机。"}]}],"synonyms":["rocket launcher","RPG (informal, general)","overkill (figurative)"],"phonetic":"/bəˈzuːkə/","extraExplanation":["“bazooka”一词最初是二战时期美军对一种火箭筒的昵称，后来成为通用名词。","在日常英语里，把某种方法或工具称为“bazooka”，通常是在强调“太强/太夸张”，语气常带幽默或批评（类似中文“大炮打蚊子”）。"]}
{"word":"bazookaman","summary":{"en":"“bazookaman” usually means a person who uses a bazooka, or a nickname for someone associated with bazookas/heavy firepower.","zh":"“bazookaman”通常指使用火箭筒的人，也可作外号/网名，表示与火箭筒或强大火力相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person (often a soldier, character, or player in a game) who uses or carries a bazooka; a “bazooka user.”","zh":"（常指士兵、角色或游戏玩家）使用/携带火箭筒的人；“火箭筒手”。"},"examples":[{"en":"In the game, the bazookaman can destroy tanks with one shot.","zh":"在游戏里，这个火箭筒手一发就能打爆坦克。"},{"en":"The director put a bazookaman in the background to show how chaotic the battle was.","zh":"导演在背景里安排了一个火箭筒手，用来表现战场的混乱。"}]},{"partOfSpeech":"n.","definition":{"en":"(often capitalized) a nickname or title for a specific character, username, or persona associated with bazookas or heavy firepower.","zh":"（常首字母大写）某个特定角色、用户名或人设的外号/称号，含“火力很猛、像火箭筒一样强”的意味。"},"examples":[{"en":"Online, he goes by Bazookaman because he loves explosive weapons in shooters.","zh":"在网上他用 Bazookaman 这个名字，因为他在射击游戏里很喜欢爆炸类武器。"},{"en":"Fans call him Bazookaman after that famous scene.","zh":"粉丝们因为那段名场面叫他 Bazookaman。"}]}],"synonyms":["bazooka man","rocket launcher operator","bazooka user"],"phonetic":"/bəˈzuːkə mæn/","extraExplanation":["“bazooka”最早是二战时期的美军反坦克火箭筒名称，后来在日常英语里也常泛指“火箭筒/肩扛式火箭发射器”。因此 bazookaman 这种合成词多见于口语、游戏圈、网名或非正式写法，并不是非常标准的词典词条。","拼写上更常见的形式是分开写或加连字符：bazooka man / bazooka-man。你看到的 bazookaman 往往更像一个ID或昵称。"]}
{"word":"bazookamen","summary":{"en":"“Bazookamen” means men who carry or use bazookas (rocket launchers), often in a military context.","zh":"“bazookamen”指携带或使用火箭筒的人（多见于军事语境），更常写作“bazooka men”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"men (especially soldiers or fighters) carrying or using bazookas (rocket launchers).","zh":"（尤指士兵或武装人员）携带或使用火箭筒（bazooka）的人。"},"examples":[{"en":"The bazookamen took cover before firing at the tank.","zh":"火箭筒手在向坦克开火前先寻找掩体。"},{"en":"In the movie, a team of bazookamen defends the bridge.","zh":"电影里，一队火箭筒兵守卫着那座桥。"}]}],"synonyms":["bazooka men","rocket launcher operators","anti-tank troops"],"phonetic":"/bəˈzuːkə mɛn/","extraExplanation":["“bazooka”原本是二战时期美军使用的一种反坦克火箭筒的俗称，后来也泛指肩扛式火箭发射器。把“bazooka + men”合在一起写成“bazookamen”并不算标准常用拼写，更常见写法是“bazooka men”或更正式的“bazooka operators / rocket launcher troops”。","在新闻或纪实语境中，通常会用更中性的表达来避免夸张色彩；“bazookamen”更像是口语、小说或电影评论中的说法。"]}
{"word":"bazookas","summary":{"en":"“Bazookas” is the plural of “bazooka,” usually meaning shoulder-fired rocket launchers; it can also be a humorous slang for something very big or powerful.","zh":"“bazookas”是“bazooka”的复数，通常指火箭筒；也可作幽默俚语，指非常大或很厉害的东西。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a shoulder-fired rocket launcher (a tube-like weapon used to shoot rockets)","zh":"火箭筒；反坦克火箭发射器（肩扛式、管状武器，用来发射火箭弹）"},"examples":[{"en":"The soldiers carried bazookas to defend against tanks.","zh":"士兵们携带火箭筒来防御坦克。"},{"en":"The movie shows a character firing a bazooka at a vehicle.","zh":"电影里有角色用火箭筒向一辆车开火。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, slang) something very large or powerful (often used humorously)","zh":"（非正式、俚语）很大或很厉害的东西（常带幽默语气）"},"examples":[{"en":"This new speaker system is a bazooka—it's unbelievably loud.","zh":"这套新音响太猛了——声音大得离谱。"},{"en":"He brought a bazooka of a camera to the concert.","zh":"他带了一台“巨炮”相机去演唱会。"}]}],"synonyms":["rocket launcher","launcher","anti-tank weapon","(slang) monster","(slang) beast"],"phonetic":"/bəˈzuːkə/","extraExplanation":["“bazooka”最早并不是武器名，而是20世纪早期美国一种滑稽的自制乐器名称，后来二战时期这种火箭筒外形像那种乐器，于是被士兵借用来命名。","在口语里把“bazooka”用来形容“很大/很猛”的东西通常是夸张说法；但它也可能出现在涉及身体的低俗俚语中，容易冒犯他人，学习时建议避免使用此类语境。"]}
{"word":"bazooms","summary":{"en":"“Bazooms” is an informal, often dated slang word for a woman’s breasts, usually used humorously but can be rude.","zh":"“bazooms”是指女性乳房的非正式俚语，常带老派玩笑感，但可能显得粗俗或冒犯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, informal) A woman’s breasts; used humorously or in a slightly crude way.","zh":"（俚语，非正式）女性的乳房；常带搞笑或略粗俗的语气。"},"examples":[{"en":"The comedian made a joke about “bazooms,” and some people in the audience looked uncomfortable.","zh":"喜剧演员拿“bazooms（胸部）”开玩笑，观众里有些人显得不太舒服。"},{"en":"That word is pretty dated—she asked him not to comment on her body.","zh":"这个词挺过时的——她让他别评论她的身体。"}]}],"synonyms":["breasts","boobs","chest"],"phonetic":"/bəˈzuːmz/","extraExplanation":["“bazooms”通常以复数形式出现，语气偏戏谑、物化，容易冒犯他人；在正式场合或与不熟的人交流时应避免使用。","这个词在英语中带有“老派/过时”的喜剧或漫画感，更多见于旧电影、脱口秀或夸张的口语表达。更中性的说法是“breasts”（较正式）或“chest”（更委婉）。"]}
{"word":"bazoos","summary":{"en":"“Bazoos” is the plural of “bazoo,” a slang word meaning “mouth,” often used humorously or to scold someone for talking too much.","zh":"“bazoos”是“bazoo”的复数，属俚语，意思是“嘴（巴）”，常带幽默或责备语气，指人话太多。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang) A mouth, especially as something that talks too much or makes a lot of noise.","zh":"（俚语）嘴；口，常指话太多或吵闹的嘴。"},"examples":[{"en":"Shut your bazoo and listen for a second.","zh":"把嘴闭上，先听我说一会儿。"},{"en":"He was running his bazoo all afternoon about the game.","zh":"他整个下午都在喋喋不休地聊那场比赛。"},{"en":"Keep it out of your bazoo—it’s too hot to eat yet.","zh":"别往嘴里塞——还太烫，不能吃。"}]}],"synonyms":["mouth","trap","gob","kisser"],"phonetic":"/bəˈzuː/","extraExplanation":["“bazoo”是比较口语、带点幽默或责备意味的美式俚语，常用于命令或抱怨（如“Shut your bazoo”）。语气通常不正式，有时会显得不礼貌，和不熟的人说要谨慎。","词源不太确定，但在20世纪美式口语中流行，用来夸张地指“嘴巴”或“吹牛的嘴”。","相关近义表达：“mouth”（嘴/爱说话的人）、“trap”（口/嘴，俚语）、“big mouth”（大嘴巴/爱泄密的人）、“run your mouth”（嘴碎/乱说话）。"]}
{"word":"bazzite","summary":{"en":"Bazzite is a Fedora-based Linux distribution aimed at a smooth, gaming-friendly desktop experience, using an immutable/atomic update model.","zh":"Bazzite 是基于 Fedora 的 Linux 发行版，面向顺滑且适合游戏的桌面体验，并采用不可变/原子化的更新模式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Fedora-based Linux operating system (distribution) designed to be easy to use, especially for gaming and modern desktop use; it uses an “immutable/atomic” system style where the core system is read-only and updates are applied as a whole.","zh":"一种基于 Fedora 的 Linux 操作系统（发行版），主打易用性，尤其面向游戏与现代桌面使用；采用“不可变/原子化”系统风格：核心系统只读，更新以整体方式应用。"},"examples":[{"en":"I installed Bazzite on my handheld PC to get a SteamOS-like gaming experience.","zh":"我在掌机 PC 上安装了 Bazzite，想获得类似 SteamOS 的游戏体验。"},{"en":"Bazzite updates the system as an atomic image, so rollbacks are easier if something breaks.","zh":"Bazzite 以原子镜像方式更新系统，所以如果出问题更容易回滚。"}]}],"synonyms":["Linux distribution","Fedora-based OS","immutable Linux"],"phonetic":"/ˈbæzaɪt/","extraExplanation":["Bazzite 常被拿来和 SteamOS 作比较：目标用户相似（游戏玩家/客厅或掌机设备），但它建立在 Fedora 的生态之上。","“不可变（immutable/atomic）系统”这类发行版通常把系统核心做成只读，通过镜像式更新来降低“装坏系统”的风险；需要装额外软件时，多用容器/Flatpak，或用分层安装（layering）。","在技术社区里，人们有时把它称为“Bazzite OS”，但日常也直接说 “Bazzite”。"]}

