{"word":"BC","summary":{"en":"BC most commonly means “before Christ” (years before 1 AD); it can also mean British Columbia (Canada) or, informally, “because” in texts.","zh":"BC最常见指“公元前”；也可指加拿大“不列颠哥伦比亚省”，在聊天中还可非正式表示“因为”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"before Christ; used to label years before the traditionally accepted birth year of Jesus (e.g., 300 B.C.).","zh":"公元前；用于标注传统上认为耶稣诞生之前的年份（如：公元前300年）。"},"examples":[{"en":"The pyramids in Egypt were built around 2600 B.C.","zh":"埃及金字塔大约建于公元前2600年。"},{"en":"Rome became a republic in 509 B.C.","zh":"罗马在公元前509年成为共和国。"}]},{"partOfSpeech":"other","definition":{"en":"British Columbia, a province in western Canada (often written as BC).","zh":"不列颠哥伦比亚省（加拿大西部的一个省，常写作BC）。"},"examples":[{"en":"Vancouver is a major city in BC.","zh":"温哥华是BC的重要城市。"},{"en":"She moved to BC for a new job.","zh":"她为了新工作搬到了BC。"}]},{"partOfSpeech":"other","definition":{"en":"because; an informal abbreviation used in texting and online messages.","zh":"because（因为）；短信或网络聊天中的非正式缩写。"},"examples":[{"en":"I can’t go bc I’m working late.","zh":"我去不了，因为我要加班。"},{"en":"He stayed home bc it was raining.","zh":"他待在家里，因为下雨了。"}]}],"synonyms":["BCE (for the time-label meaning)","British Columbia (for the place meaning)","because (for the texting meaning)"],"phonetic":"/biː siː/","extraExplanation":["在历史与学术写作中，越来越常见用“BCE/CE”（Before Common Era / Common Era，即“公元前/公元”）来替代“BC/AD”，表达更中性、跨宗教的年代标注。例如：300 BCE = 300 B.C.。"]}
{"word":"bc","summary":{"en":"“bc” commonly means “because” in informal texting, and it can also mean “B.C.” (Before Christ) when talking about dates.","zh":"“bc”常在非正式聊天中表示“because（因为）”，也可指“B.C.（公元前）”用于年代。"},"definitions":[{"partOfSpeech":"conj.","definition":{"en":"(texting/informal) because.","zh":"（短信/口语非正式）因为。"},"examples":[{"en":"I can’t go bc I’m sick.","zh":"我不能去，因为我生病了。"},{"en":"Turn the music down bc it’s late.","zh":"把音乐调小点，因为太晚了。"}]},{"partOfSpeech":"other","definition":{"en":"Before Christ; used in dating years before the traditional birth year of Jesus (often written B.C.).","zh":"公元前；用于表示传统上耶稣诞生之前年份（常写作 B.C.）。"},"examples":[{"en":"The pyramids were built around 2600 BC.","zh":"金字塔大约建于公元前2600年。"},{"en":"Rome was founded in 753 BC.","zh":"罗马建于公元前753年。"}]}],"synonyms":["because","since","as","BCE"],"phonetic":"/ˌbiːˈsiː/","extraExplanation":["“bc”是网络与短信里把“because”缩写的写法，适合私下聊天；在正式写作中建议写全 because，或用 since/as。","表示年代时更常见的中性写法是“BCE”（Before Common Era，公元前），对应“CE”（Common Era，公元），常用于学术与跨宗教语境。"]}
{"word":"BCAA","summary":{"en":"BCAA = branched-chain amino acids, a common sports nutrition supplement.","zh":"BCAA指支链氨基酸，是常见的运动营养补剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Branched-chain amino acids (leucine, isoleucine, and valine), often sold as a sports supplement to support muscle recovery or reduce fatigue.","zh":"支链氨基酸（亮氨酸、异亮氨酸、缬氨酸），常作为运动营养补剂销售，用于帮助肌肉恢复或减轻疲劳。"},"examples":[{"en":"Some people drink BCAA during workouts, but the benefits depend on your overall protein intake.","zh":"有些人会在训练中喝BCAA，但效果很大程度取决于你整体蛋白质摄入是否充足。"},{"en":"This product contains BCAA in a 2:1:1 ratio (leucine:isoleucine:valine).","zh":"这款产品的BCAA比例是2:1:1（亮氨酸：异亮氨酸：缬氨酸）。"},{"en":"If you already get enough protein from food, you may not need extra BCAA supplements.","zh":"如果你从食物中已经摄入足够蛋白质，可能不需要额外补充BCAA。"}]}],"synonyms":["branched-chain amino acids","leucine","isoleucine","valine"],"phonetic":"/ˌbiː siː eɪ ˈeɪ/","extraExplanation":["BCAA是缩写，写作BCAA；口语里通常按字母读“B-C-A-A”。","在健身文化中，BCAA常被宣传为“增肌/防分解”。但研究一般认为：如果日常蛋白质（尤其是必需氨基酸）摄入充足，额外补充BCAA的边际收益可能有限；对蛋白质摄入不足或空腹训练的人，体感上可能更有帮助。","常见于补剂标签的“2:1:1”指亮氨酸：异亮氨酸：缬氨酸的比例；亮氨酸在肌肉蛋白合成信号中更受关注。"]}
{"word":"BCBS","summary":{"en":"BCBS is an abbreviation most commonly meaning Blue Cross Blue Shield (health insurance) or, in finance, the Basel Committee on Banking Supervision.","zh":"BCBS 是缩写，最常指美国的 Blue Cross Blue Shield（医疗保险），在金融语境中也可指 Basel Committee on Banking Supervision（巴塞尔银行监管委员会）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Blue Cross Blue Shield (BCBS): a U.S. federation/brand of health insurance companies and plans.","zh":"Blue Cross Blue Shield（BCBS）：美国的医疗保险品牌与联合组织，由多家保险公司/健康计划组成。"},"examples":[{"en":"My employer offers BCBS health insurance.","zh":"我的雇主提供 BCBS 的医疗保险。"},{"en":"Check whether your doctor is in the BCBS network.","zh":"查一下你的医生是否在 BCBS 的医疗网络内。"}]},{"partOfSpeech":"other","definition":{"en":"Basel Committee on Banking Supervision (BCBS): an international group that sets banking supervision standards (often discussed in finance and regulation).","zh":"Basel Committee on Banking Supervision（BCBS，巴塞尔银行监管委员会）：制定银行监管标准的国际组织，常见于金融与监管语境。"},"examples":[{"en":"The BCBS issued new guidance on bank capital requirements.","zh":"BCBS 发布了关于银行资本要求的新指导意见。"},{"en":"Many countries align their rules with BCBS standards.","zh":"许多国家会让本国规则与 BCBS 标准接轨。"}]}],"synonyms":["Blue Cross Blue Shield","Basel Committee on Banking Supervision"],"phonetic":"/ˌbiː siː ˌbiː ˈɛs/","extraExplanation":["BCBS 是缩写，具体指什么取决于语境：在美国日常生活/保险语境里，最常指“Blue Cross Blue Shield”；在金融、银行监管、合规语境里，常指“Basel Committee on Banking Supervision（巴塞尔银行监管委员会）”。写作时第一次出现通常建议先写全称，再括号标注（BCBS）。"]}
{"word":"BCC","summary":{"en":"BCC means “Blind Carbon Copy,” an email feature that sends a hidden copy to someone.","zh":"BCC 指“密送”，用于在邮件中给某人发送隐藏副本。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(email) the “Blind Carbon Copy” field: people you add here will receive the email, but other recipients cannot see their addresses.","zh":"（电子邮件）密送栏（Blind Carbon Copy）：加入这里的人会收到邮件，但其他收件人看不到他们的邮箱地址。"},"examples":[{"en":"Please put the client in BCC so the team doesn’t see their address.","zh":"请把客户放在 BCC 里，这样团队成员就看不到对方的邮箱地址。"},{"en":"I added my manager to BCC for transparency.","zh":"我把经理加到 BCC 里，方便让他/她了解情况。"}]},{"partOfSpeech":"v.","definition":{"en":"to send someone a copy of an email using BCC (so their address is hidden).","zh":"用密送（BCC）方式给某人发送邮件副本（隐藏其邮箱地址）。"},"examples":[{"en":"I’ll BCC you on the reply.","zh":"我回复时会把你密送进去。"},{"en":"She BCCed herself to keep a record.","zh":"她把自己密送进去以便留存记录。"}]}],"synonyms":["blind carbon copy","BCC field","CC (related)"],"phonetic":"/ˌbiː siː ˈsiː/","extraExplanation":["BCC 常用于保护收件人隐私（例如群发时避免公开所有邮箱）。如果你想让“所有人都知道我抄送了谁”，用 CC；如果你不希望其他收件人看到某些人的地址，用 BCC。","礼貌提醒：不要用 BCC 来“暗中告状”或制造误会；在职场中，是否使用 BCC 往往涉及信任与沟通透明度。"]}
{"word":"BCD","summary":{"en":"BCD most commonly means “binary-coded decimal,” a digit-by-digit binary encoding used in electronics/computing.","zh":"BCD最常见的意思是“二进制编码十进制”，用于电子与计算机中按十进制每一位分别进行二进制编码的表示法。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) binary-coded decimal: a way to store or show numbers in computing/electronics where each decimal digit (0–9) is represented separately in binary form.","zh":"（缩写）二进制编码十进制：一种在计算机/电子领域表示数字的方法，把每一位十进制数字（0–9）分别用二进制编码表示。"},"examples":[{"en":"Some digital clocks use BCD to drive the display.","zh":"一些电子钟表用 BCD 来驱动显示。"},{"en":"The engineer converted the value from BCD to ordinary binary.","zh":"工程师把数值从 BCD 转换成普通二进制。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) In some technical contexts, “BCD” can appear in product names or labels (e.g., parts, chips, or files) as a short code; the exact meaning depends on the field.","zh":"（缩写）在一些技术语境中，“BCD”也可能出现在产品名或标签里（如零件、芯片或文件名）作为简写代码；具体含义取决于领域。"},"examples":[{"en":"Check the manual to see what “BCD” means on this device.","zh":"查看说明书，确认这个设备上 “BCD” 的具体含义。"}]}],"synonyms":["binary-coded decimal"],"phonetic":"/ˌbiː siː ˈdiː/","extraExplanation":["“BCD”通常读作字母串“B-C-D”，不是当作一个单词读。","在电子与计算机领域里，BCD常见于显示电路、计数器、老式计算器/数字表等；它的优点是十进制显示方便，但在存储效率上通常不如纯二进制。"]}
{"word":"bcd","summary":{"en":"“bcd/BCD” can mean the letter sequence B–C–D, or the acronym BCD meaning binary-coded decimal in computing.","zh":"“bcd/BCD”可指字母序列 B–C–D；也可指计算机领域缩写 BCD（二进制编码十进制）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"the letters B, C, and D said or written in order; sometimes used as a short label for something that comes after A (e.g., in lists or steps)","zh":"按顺序写或读出的字母 B、C、D；有时用作简短标记，表示在 A 之后的一组项目（如列表或步骤）"},"examples":[{"en":"In the alphabet, BCD comes right after A.","zh":"在字母表里，BCD 紧接在 A 后面。"},{"en":"Please complete sections A, then BCD.","zh":"请先完成 A 部分，然后完成 B、C、D 部分。"}]},{"partOfSpeech":"n.","definition":{"en":"an abbreviation for “binary-coded decimal,” a way of storing numbers where each decimal digit is represented in binary (often written as BCD)","zh":"“binary-coded decimal（二进制编码十进制）”的缩写：一种用二进制来表示十进制数字的存储方式（常写作 BCD）"},"examples":[{"en":"Some older calculators used BCD to represent digits.","zh":"一些较早的计算器用 BCD 来表示数字。"},{"en":"The clock chip stores the time in BCD format.","zh":"这个时钟芯片用 BCD 格式存储时间。"}]}],"phonetic":"/biː siː diː/","extraExplanation":["“bcd”如果写成大写“BCD”，更常被理解为缩写（尤其在电子与计算机领域指 binary-coded decimal）。如果只是小写“bcd”，很多时候只是随手输入的字母序列，没有固定含义，需结合上下文判断。"]}
{"word":"BCDIC","summary":{"en":"BCDIC is an early IBM character-encoding standard (Binary Coded Decimal Interchange Code), largely replaced later by EBCDIC and modern encodings like ASCII/Unicode.","zh":"BCDIC 是一种早期 IBM 使用的字符编码标准（二进制编码十进制交换码），后来多被 EBCDIC 以及更现代的 ASCII/Unicode 等编码取代。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(computing) A character-encoding standard called “Binary Coded Decimal Interchange Code,” used mainly in early IBM systems; a predecessor to EBCDIC.","zh":"（计算机）“二进制编码十进制交换码”（Binary Coded Decimal Interchange Code），一种早期（主要用于 IBM 系统的）字符编码标准；常被视为 EBCDIC 的前身。"},"examples":[{"en":"Some early IBM documents mention BCDIC as a predecessor to EBCDIC.","zh":"一些早期的 IBM 文档把 BCDIC 提到为 EBCDIC 的前身。"},{"en":"When converting old data, you may need to know whether the text was stored in BCDIC or ASCII.","zh":"在转换旧数据时，你可能需要知道文本是以 BCDIC 还是 ASCII 存储的。"}]}],"synonyms":["EBCDIC","ASCII","character encoding","BCD"],"phonetic":"ˌbiːsiːˈdɪk","extraExplanation":["BCDIC 的全称是 Binary Coded Decimal Interchange Code，属于早期字符编码的一种。后来 IBM 更常用的是 EBCDIC（Extended BCD Interchange Code）。现代计算中更常见的是 ASCII 或 Unicode（如 UTF-8）。","实际工作里你更可能在“遗留系统/老式主机（mainframe）数据迁移、文件解码、字符集转换”场景看到 BCDIC 这个术语。"]}
{"word":"BCE","summary":{"en":"BCE means “Before Common Era,” marking years before year 1; it’s a common neutral alternative to “BC.”","zh":"BCE 表示“公元前”，用于标注公元 1 年之前的年份；常作为更中性的“BC”替代。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbreviation) “Before Common Era”: used after a year to indicate dates before year 1 in the Gregorian/Christian calendar system, often used as a neutral alternative to “BC.”","zh":"（缩写）“公元前”：放在年份后面，表示公元 1 年之前的年份；常用作“BC（基督纪元前）”的较中性替代说法。"},"examples":[{"en":"The Great Pyramid of Giza was built around 2600 BCE.","zh":"吉萨大金字塔大约建于公元前 2600 年。"},{"en":"The Roman Republic began in 509 BCE.","zh":"罗马共和国始于公元前 509 年。"},{"en":"In many textbooks, BCE and CE are used instead of BC and AD.","zh":"在许多教材中，会用 BCE 和 CE 来代替 BC 和 AD。"}]}],"synonyms":["BC (traditional equivalent)"],"phonetic":"/ˌbiː siː ˈiː/","extraExplanation":["BCE 通常与 CE（Common Era，公元）配对使用：例如“44 BCE”（公元前 44 年）对应“2026 CE”（公元 2026 年）。数字体系与 BC/AD 相同，只是表达更偏学术与跨宗教语境。","书写习惯：BCE 放在年份后面（如 300 BCE），而“BCE 300”较少见。口语中常读作每个字母：B-C-E。"]}
{"word":"BCerE","summary":{"en":"“BCerE” is not a common English word; it likely functions as an acronym or a specialized label, and its meaning depends on context.","zh":"“BCerE”不是常见英语词汇；更可能是缩写或专业标记，其含义需要结合具体语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“BCerE” is not a standard English word. It is most likely an acronym, username, code, or a specialized label (for example in biology, gaming, or a file name).","zh":"“BCerE”不是常见的英语单词，更可能是缩写、用户名、代码或某个专业领域的标记（例如生物、游戏或文件名）。"},"examples":[{"en":"I saw “BCerE” in a document, but I’m not sure what it stands for.","zh":"我在一份文件里看到“BCerE”，但不确定它代表什么。"},{"en":"Could you tell me what “BCerE” means in this context?","zh":"你能告诉我“BCerE”在这个语境里是什么意思吗？"}]}],"phonetic":"/ˌbiː siː ˈɝː iː/","extraExplanation":["如果你能提供它出现的场景（例如：一句完整的句子、学科/行业、截图或链接），我可以更准确判断：\n- 是否是缩写（每个字母代表一个词）\n- 是否是专有名词（项目名、产品名、组织名）\n- 是否是技术标识（基因名、变量名、文件名等）\n另外，大小写可能很关键：BCerE 与 BCERE / bcerE 可能指不同的东西。"]}
{"word":"Bcf","summary":{"en":"Bcf = billion cubic feet, a unit for very large volumes of natural gas.","zh":"Bcf = 十亿立方英尺；用于表示天然气等的大体积数量单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation for “billion cubic feet,” a unit used (especially in the energy industry) to measure large volumes of natural gas.","zh":"“billion cubic feet（十亿立方英尺）”的缩写；常用于能源行业，表示天然气等的大体积数量单位。"},"examples":[{"en":"The field is estimated to contain 3 Bcf of recoverable gas.","zh":"该气田预计含有可采天然气 3 Bcf。"},{"en":"Daily output rose to 0.2 Bcf after the new wells came online.","zh":"新井投产后，日产量升至 0.2 Bcf。"}]}],"synonyms":["billion cubic feet","BCF (all caps)"],"phonetic":"/ˌbiː siː ˈɛf/","extraExplanation":["BCF 常见于油气新闻、公司报告与政府能源统计（如美国 EIA）。写作时常见格式有 Bcf（十亿立方英尺）与 MMcf（百万立方英尺）；注意 bcf（小写）有时也会被非正式使用，但正式报告更倾向于 Bcf。","在不同国家/地区，也可能用公制单位表示气量（如 bcm：billion cubic meters，十亿立方米），所以阅读国际资料时要留意单位换算与大小写。"]}
{"word":"bcf","summary":{"en":"BCF most commonly means “billion cubic feet,” a unit for large volumes of natural gas; it can also have other field-specific meanings.","zh":"BCF 最常见指“billion cubic feet（十亿立方英尺）”，用于表示大量天然气体积；在不同领域也可能有其他含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “billion cubic feet,” a unit used to measure large volumes of natural gas","zh":"“billion cubic feet（十亿立方英尺）”的缩写，用于衡量大量天然气的体积"},"examples":[{"en":"The report says the field can produce 2 Bcf of gas per day.","zh":"报告称该气田每天可生产 2 Bcf 的天然气。"},{"en":"Gas storage increased by 50 Bcf this week.","zh":"本周天然气库存增加了 50 Bcf。"}]},{"partOfSpeech":"other","definition":{"en":"(in some business/logistics contexts) an abbreviation for “bulk container freight,” meaning cargo shipped in large containers","zh":"（在部分商业/物流语境中）“bulk container freight（散装集装箱货运）”的缩写，指用大型集装箱运输的货物"},"examples":[{"en":"They specialize in BCF shipments for agricultural products.","zh":"他们专门做农产品的 BCF 货运。"}]},{"partOfSpeech":"other","definition":{"en":"(informal internet/texting) a short form some people use for “best close friend,” meaning a very close friend","zh":"（非正式网络/短信用语）有些人用来表示“best close friend（最亲密的朋友）”"},"examples":[{"en":"She’s been my BCF since middle school.","zh":"她从初中起就是我最亲密的朋友。"}]}],"synonyms":["billion cubic feet","Bcf (gas unit)"],"phonetic":"/bi si ɛf/","extraExplanation":["“BCF”最常见、最标准的用法是在能源行业，表示天然气体积单位“billion cubic feet”。如果你是在看能源新闻、库存数据（storage）、产量（production）或管道（pipeline）信息，几乎都指这一项。","缩写在不同领域可能含义不同；如果你能提供一句原文或告诉我出现场景（能源/物流/聊天等），我可以帮你确认最准确的意思。"]}
{"word":"BCG","summary":{"en":"BCG can mean Boston Consulting Group, the BCG vaccine for TB, or the BCG matrix in business.","zh":"BCG可指波士顿咨询公司、预防结核病的卡介苗（BCG疫苗），或商业分析中的BCG矩阵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Boston Consulting Group (a global management consulting firm).","zh":"波士顿咨询公司（全球知名的管理咨询公司）。"},"examples":[{"en":"She got an internship at BCG this summer.","zh":"她今年夏天在BCG（波士顿咨询公司）实习。"},{"en":"BCG advises companies on strategy and growth.","zh":"BCG为公司提供战略与增长方面的咨询。"}]},{"partOfSpeech":"n.","definition":{"en":"Bacillus Calmette–Guérin (BCG), a vaccine mainly used to help prevent severe forms of tuberculosis (TB), especially in children.","zh":"卡介苗（BCG疫苗），主要用于预防结核病（TB）的严重类型，尤其是儿童。"},"examples":[{"en":"Many countries give the BCG vaccine to newborns.","zh":"许多国家会给新生儿接种卡介苗（BCG）。"},{"en":"The doctor checked his arm for a BCG scar.","zh":"医生查看他的手臂是否有卡介苗疤痕。"}]},{"partOfSpeech":"n.","definition":{"en":"The BCG matrix (a business tool that compares products by market growth and market share, often grouped as stars, cash cows, question marks, and dogs).","zh":"BCG矩阵（商业分析工具，用市场增长率与市场份额来分类产品，常见四类：明星、现金牛、问号、瘦狗）。"},"examples":[{"en":"We used the BCG matrix to decide which products to invest in.","zh":"我们用BCG矩阵来决定投资哪些产品。"},{"en":"That brand is a cash cow in the BCG framework.","zh":"在BCG框架里，那个品牌是“现金牛”。"}]}],"synonyms":["Boston Consulting Group","BCG vaccine","Bacillus Calmette–Guérin","BCG matrix"],"phonetic":"/ˌbiː siː ˈdʒiː/","extraExplanation":["“BCG”是缩写，在不同领域含义差异很大：商业语境里最常指波士顿咨询公司或“BCG矩阵”；医疗语境里多指卡介苗（与结核病相关）。阅读或听到时，通常根据上下文（公司/战略/产品组合 vs. 疫苗/接种/结核）判断。"]}
{"word":"BCG-based","summary":{"en":"“BCG-based” means “based on BCG,” usually the Boston Consulting Group’s strategy models, or in medical contexts, based on the BCG vaccine strain.","zh":"“BCG-based”表示“以BCG为基础的”，通常指波士顿咨询公司的战略模型；在医学语境中则指以BCG（卡介苗菌株）为基础。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Based on or using a BCG framework or tool (especially the Boston Consulting Group’s strategy models, such as the BCG matrix).","zh":"以BCG框架或工具为基础的（尤其指波士顿咨询公司 Boston Consulting Group 的战略模型，如BCG矩阵）。"},"examples":[{"en":"We made a BCG-based portfolio plan to decide which products to invest in.","zh":"我们制定了一个基于BCG的产品组合规划，用来决定该投资哪些产品。"},{"en":"The report gives BCG-based recommendations on growth and cost control.","zh":"这份报告提出了基于BCG的增长与成本控制建议。"}]},{"partOfSpeech":"adj.","definition":{"en":"Based on BCG (Bacillus Calmette–Guérin), the vaccine strain used in tuberculosis prevention and some bladder cancer treatments.","zh":"以BCG（卡介苗菌株）为基础的（用于结核病预防，也用于部分膀胱癌治疗）。"},"examples":[{"en":"Researchers tested a BCG-based therapy to improve immune response.","zh":"研究人员测试了一种基于BCG的疗法来增强免疫反应。"},{"en":"The hospital uses BCG-based treatment for certain bladder cancer patients.","zh":"医院对部分膀胱癌患者采用基于BCG的治疗。"}]}],"synonyms":["BCG-driven","BCG-informed","BCG-oriented","BCG-derived"],"phonetic":"/ˌbiː siː ˈdʒiː beɪst/","extraExplanation":["“BCG”在英文里常见有两种含义：①商科/咨询领域的 Boston Consulting Group（波士顿咨询公司），相关的“BCG矩阵”常用来分析产品或业务（如明星、金牛、问题、瘦狗）。②医学领域的 Bacillus Calmette–Guérin（卡介苗/BCG菌株）。看到“BCG-based”时，最好根据上下文（strategy/portfolio vs. vaccine/therapy）判断具体指哪一种。"]}
{"word":"BCh","summary":{"en":"BCh is mainly an academic abbreviation, most often meaning “Bachelor of Surgery” as part of a medical degree (e.g., MB BCh).","zh":"BCh 主要是学位缩写，最常见指医学学位中的“外科学士”（如 MB BCh 的一部分）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation used in some universities for an academic degree; most commonly it refers to a medical degree meaning “Bachelor of Surgery” (often written with another degree, e.g., MB BCh, MB ChB, or BChir).","zh":"一些大学使用的学位缩写；最常见的是医学学位中的“外科学士”（常与其他学位并列出现，如 MB BCh、MB ChB 或 BChir）。"},"examples":[{"en":"She graduated with an MB BCh and started her internship at a teaching hospital.","zh":"她以 MB BCh（医学士/外科学士）毕业，并在教学医院开始实习。"},{"en":"In the UK and Ireland, the medical degree may include BCh as part of the full title.","zh":"在英国和爱尔兰，医学学位的全称中可能会包含 BCh。"}]},{"partOfSpeech":"other","definition":{"en":"less commonly, an abbreviation for “Bachelor of Chemical Science/Chemistry” in certain institutions or contexts (the exact meaning depends on the school).","zh":"较少见时，可指某些学校或语境中的“化学/化学科学学士”（具体含义取决于学校的官方写法）。"},"examples":[{"en":"Check the university catalog to confirm what BCh stands for in your program.","zh":"查看大学课程目录，以确认你的项目里 BCh 的具体含义。"}]}],"synonyms":["Bachelor of Surgery","ChB","BChir"],"phonetic":"biː siː eɪtʃ","extraExplanation":["“BCh”通常不是日常英语词汇，而是出现在学历证书、简历、学校官网等正式文本中的缩写。不同国家/学校对医学学位的缩写体系不完全一致：例如英国常见 “MBBS/MBChB”，而 “BCh” 可理解为其中的外科学位部分。遇到该缩写时，最可靠的做法是看它与哪些字母组合出现（如 MB BCh）以及学校的官方解释。"]}
{"word":"bch","summary":{"en":"“BCH” most commonly refers to Bitcoin Cash (a cryptocurrency), but it can also be a context-dependent set of initials.","zh":"“BCH”最常见指比特币现金（Bitcoin Cash）这种加密货币；也可能只是依上下文而定的首字母缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Bitcoin Cash, a cryptocurrency; “BCH” is its common ticker symbol on exchanges.","zh":"（缩写）Bitcoin Cash（比特币现金），一种加密货币；“BCH”常用作交易所上的代号（ticker）。"},"examples":[{"en":"BCH is listed on many crypto exchanges alongside BTC and ETH.","zh":"在许多加密货币交易所里，BCH 会和 BTC、ETH 一起被列出。"},{"en":"She paid the invoice in BCH instead of using a credit card.","zh":"她用 BCH 支付了账单，而不是刷信用卡。"}]},{"partOfSpeech":"other","definition":{"en":"(initialism) The letters “B-C-H” used as a short label in usernames, file names, project codes, etc., without a fixed meaning unless defined by context.","zh":"（首字母缩写）“B-C-H”这三个字母可用作用户名、文件名、项目代号等的简写；具体含义取决于上下文。"},"examples":[{"en":"The folder named “bch” contains the backup charts.","zh":"名为“bch”的文件夹里有备份图表。"},{"en":"In this document, BCH stands for “Behavior Change Handbook.”","zh":"在这份文件里，BCH 代表“行为改变手册”。"}]}],"synonyms":["Bitcoin Cash","B-C-H (initials)"],"phonetic":"/bi si eɪtʃ/","extraExplanation":["在加密货币语境中，BCH 几乎总是指 Bitcoin Cash（比特币现金），常与 BTC（Bitcoin）对比出现。","如果是在公司、学校或个人文件里看到 “bch”，它可能只是内部缩写或随手命名；最好查看前后文是否有 “BCH stands for …” 的说明。"]}
{"word":"Bchar","summary":{"en":"“Bchar” is an uncommon term, usually an informal computing label meaning a byte-based character, similar to “char.”","zh":"“Bchar”不常见，通常出现在技术语境里，非正式指“基于字节的字符”，含义接近“char/字符”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(computing, abbreviation) “Bchar” is not a standard English word; it is sometimes used informally to mean a character stored as bytes (i.e., a text symbol in a byte-based encoding), similar to “char.”","zh":"（计算机/缩写）“Bchar”不是标准英语单词；有时在技术语境中被非正式用来表示“以字节形式存储的字符”，意思接近“char/字符”。"},"examples":[{"en":"This field is stored as Bchar, so it holds one byte-based character.","zh":"这个字段用 Bchar 存储，所以它保存的是一个基于字节的字符。"},{"en":"If you need Unicode characters, Bchar may not be enough.","zh":"如果你需要 Unicode 字符，Bchar 可能不够用。"}]},{"partOfSpeech":"n.","definition":{"en":"(programming) A “char” type: a small unit used to store a single character; “Bchar” may be someone’s label for a byte-sized char.","zh":"（编程）“char”类型：用于存储单个字符的小单位；“Bchar”可能是某些人对“字节大小的 char”的自定义叫法。"},"examples":[{"en":"In C, a char usually stores one byte.","zh":"在 C 语言中，char 通常占用 1 个字节。"},{"en":"The variable is a Bchar, so it can store a single letter like 'A'.","zh":"这个变量是 Bchar，所以可以存一个字母，比如 'A'。"}]}],"synonyms":["character","char","letter","symbol"],"phonetic":"/biː tʃɑr/","extraExplanation":["在通用英语词典里通常查不到 “Bchar”。它更像是某个项目/文档里的自定义缩写。不同语言或数据库对字符类型的命名差异很大：例如有的系统区分“字节字符集（byte/char）”与“Unicode 字符（wide/nchar）”。","如果你是在某个具体环境（如某门语言、某个数据库、某份报错信息）里看到 Bchar，把原句/截图发我，我可以根据上下文给出更准确的解释。"]}
{"word":"BChE","summary":{"en":"BChE is an abbreviation for Bachelor of Chemical Engineering, an undergraduate degree.","zh":"BChE 是“化学工程学士”（本科化学工程学位）的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Bachelor of Chemical Engineering: an undergraduate university degree in chemical engineering.","zh":"化学工程学士：大学本科阶段的化学工程专业学位。"},"examples":[{"en":"She earned a BChE and then worked at an oil refinery.","zh":"她获得了化学工程学士学位（BChE），随后在一家炼油厂工作。"},{"en":"The job posting says a BChE or equivalent degree is required.","zh":"招聘信息写明需要化学工程学士（BChE）或同等学历。"}]}],"synonyms":["Bachelor of Chemical Engineering","BEng (Chemical Engineering)","BE (Chemical Engineering)","BS in Chemical Engineering"],"phonetic":"/ˌbiː siː eɪtʃ ˈiː/","extraExplanation":["BChE 通常写在简历、名片或学位证书上，表示“化学工程学士”。不同国家/学校的缩写可能不同：也常见 BEng (Chemical Engineering)、BE (Chemical Engineering) 或 BS in Chemical Engineering（美式写法更常见 BS）。","读法一般按字母读：B-C-H-E。正式写作中可首次写全称（Bachelor of Chemical Engineering），括号注明 BChE，之后再用缩写。"]}
{"word":"BChir","summary":{"en":"BChir is a UK abbreviation meaning Bachelor of Surgery, commonly seen in the Cambridge degree title “MB BChir.”","zh":"BChir是英国常见缩写，意为“外科学士”，常见于剑桥的学位名称“MB BChir”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(UK, abbreviation) Bachelor of Surgery; an undergraduate-level medical degree title used in some universities (especially the University of Cambridge), often written as “MB BChir.”","zh":"（英国，缩写）外科学士；一些大学（尤其剑桥大学）使用的医学学位名称，常与“MB”一起写作“MB BChir”。"},"examples":[{"en":"She graduated from Cambridge with an MB BChir.","zh":"她从剑桥大学毕业，获得了MB BChir学位。"},{"en":"His email signature includes “MB BChir, FRCS.”","zh":"他的邮件署名里写着“MB BChir, FRCS”。"}]}],"synonyms":["ChB","MBChB","MBBS","BS (Bachelor of Surgery in some systems)"],"phonetic":"/ˌbiː ˈkɪr/","extraExplanation":["“Chir”来自拉丁语/新拉丁语chirurgiae（外科），与英语surgery同源概念。","在英国，不同大学对医学学位的缩写不同：例如很多学校用MBBS或MBChB；剑桥传统上用MB BChir。","它多见于学术简历、名片、邮件署名等正式场合，日常口语里通常直接说“medical degree”或“medical school.”"]}
{"word":"bchs","summary":{"en":"“BCHS” is usually an abbreviation (often a high school name), and its exact meaning depends on context.","zh":"“BCHS”通常是缩写（常见为高中名称），具体含义要看上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation that can mean different things depending on context (often a school name or an organization). Common uses include “BCHS” = “_____ County High School” or “_____ Christian High School.”","zh":"一个缩写，具体含义取决于语境（常见于学校或机构名称）。常见用法包括：BCHS = “某某县高中（_____ County High School）”或“某某基督教高中（_____ Christian High School）”。"},"examples":[{"en":"My sister goes to BCHS this year.","zh":"我妹妹今年去BCHS读书。"},{"en":"Check the school website—BCHS might stand for “Bergen County High School.”","zh":"去看学校官网——BCHS可能指“卑尔根县高中”。"}]}],"synonyms":["abbreviation","acronym"],"phonetic":"/biː siː eɪtʃ ɛs/","extraExplanation":["“BCHS”不是一个固定的英语单词，更像是“首字母缩写”。在美国，很多高中名字会用缩写，例如“某某县高中（County High School）/某某基督教高中（Christian High School）”。如果你告诉我它出现在哪个句子、哪个城市或哪个网站上，我可以帮你更准确地判断它代表什么。"]}
{"word":"BCL","summary":{"en":"BCL is an abbreviation with multiple meanings; common ones include a law degree (Bachelor of Civil Law) and a biology/medicine term (the BCL protein/gene family, e.g., BCL-2).","zh":"BCL 是一个多义缩写；常见含义包括法律学位（Bachelor of Civil Law，民法学士）以及生物/医学术语（BCL 蛋白/基因家族，如 BCL-2）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation used in different fields; its meaning depends on context (for example, a degree title, a medical term, or an organization name).","zh":"一个在不同领域里使用的缩写；具体含义取决于语境（例如学位名称、医学术语或机构名称等）。"},"examples":[{"en":"In this article, BCL refers to a type of protein that helps control cell death.","zh":"在这篇文章中，BCL 指的是一种帮助控制细胞死亡的蛋白质。"},{"en":"She completed her BCL at Oxford.","zh":"她在牛津完成了 BCL 学位。"}]},{"partOfSpeech":"n.","definition":{"en":"Bachelor of Civil Law (BCL): a postgraduate law degree at some universities (especially Oxford).","zh":"民法学士（BCL）：一些大学（尤其是牛津）提供的研究生法律学位。"},"examples":[{"en":"He applied for the BCL program after finishing his undergraduate law degree.","zh":"他完成本科学位后申请了 BCL 项目。"},{"en":"The BCL is known for its rigorous tutorials and exams.","zh":"BCL 以严格的辅导课和考试著称。"}]},{"partOfSpeech":"n.","definition":{"en":"BCL (biology/medicine): a common label for the BCL family of proteins/genes (e.g., BCL-2), often discussed in cancer research.","zh":"BCL（生物/医学）：常用来指 BCL 蛋白/基因家族（如 BCL-2），常见于癌症研究语境。"},"examples":[{"en":"High BCL-2 expression can be linked to some cancers.","zh":"BCL-2 的高表达可能与某些癌症有关。"},{"en":"The study measured BCL gene activity in tumor samples.","zh":"研究测量了肿瘤样本中的 BCL 基因活性。"}]}],"synonyms":["initialism","abbreviation"],"phonetic":"/ˌbiː siː ˈɛl/","extraExplanation":["“BCL”是首字母缩略词（initialism），通常逐个字母读：B-C-L。因为它在不同专业里含义差别很大，阅读时要看上下文（比如法律、医学、生物、公司/机构名称等）。","如果你告诉我你看到 BCL 的句子或领域（例如论文、简历、医疗报告），我可以给出更准确的释义。"]}
{"word":"BCM","summary":{"en":"BCM most commonly means Business Continuity Management; less commonly it can mean billion cubic meters (bcm).","zh":"BCM 最常见指“业务连续性管理”；较不常见也可指“十亿立方米（bcm）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbr.) Business Continuity Management: the planning and processes an organization uses to keep critical operations running (or quickly restore them) during disruptions such as cyberattacks, power outages, or natural disasters.","zh":"（缩写）业务连续性管理：组织为在网络攻击、停电、自然灾害等中断期间维持关键业务运行或尽快恢复而制定的计划与流程。"},"examples":[{"en":"Our bank reviews its BCM plan every year to prepare for cyber incidents.","zh":"我们银行每年都会审查 BCM 计划，以应对网络安全事件。"},{"en":"BCM training helps staff know what to do during an emergency.","zh":"BCM 培训能帮助员工在紧急情况下知道该怎么做。"},{"en":"The audit found gaps in the company’s BCM documentation.","zh":"审计发现该公司的 BCM 文档存在缺口。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbr., less common) Billion cubic meters: a unit used to measure large volumes of water or natural gas (often written as bcm).","zh":"（缩写，较不常见）十亿立方米：用于衡量大量水或天然气的单位（常写作 bcm）。"},"examples":[{"en":"The pipeline is expected to deliver 10 bcm of gas per year.","zh":"该管道预计每年输送 10 bcm 的天然气。"},{"en":"Reservoir capacity was reported as 2.5 bcm after the rainy season.","zh":"雨季过后，水库库容被报告为 2.5 bcm。"}]}],"synonyms":["business continuity management","business continuity planning (BCP)","disaster recovery (DR)"],"phonetic":"/ˌbi si ˈɛm/","extraExplanation":["在职场语境里，BCM 最常指 Business Continuity Management，常与 BCP（Business Continuity Plan，业务连续性计划）、DR/DRP（Disaster Recovery/Plan，灾难恢复/计划）一起出现。","写法上，“BCM”多用于管理体系或项目名称；表示单位时常写作小写“bcm”，尤其在能源与水资源报道中。"]}
{"word":"BCom","summary":{"en":"BCom = Bachelor of Commerce, an undergraduate commerce/business degree.","zh":"BCom指商学/商业学士（Bachelor of Commerce），一种本科商科类学位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a university undergraduate degree in Commerce or Business (Bachelor of Commerce).","zh":"商学/商业学士学位（Bachelor of Commerce），大学本科商科类学位。"},"examples":[{"en":"She earned a BCom in Accounting and now works at an audit firm.","zh":"她取得了会计方向的BCom学位，现在在一家审计公司工作。"},{"en":"Many students choose a BCom to study finance, marketing, and management.","zh":"很多学生选择读BCom来学习金融、市场营销和管理。"},{"en":"His resume lists a BCom from the University of Cape Town.","zh":"他的简历上写着毕业于开普敦大学，获得BCom学位。"}]}],"synonyms":["Bachelor of Commerce","B.Com.","BComm","commerce degree"],"phonetic":"/ˌbiːˈkɑm/","extraExplanation":["“BCom”常见于英联邦国家/地区（如加拿大、澳大利亚、新西兰、南非、印度等）的学位体系；在美国更常见的对应说法是“BBA（Bachelor of Business Administration）”或“BS in Business”。","写法上也常见“B.Com.”或“BComm”。不同学校的BCom侧重点可能不同：有的更偏经济与商学理论，有的更偏职业导向（如会计、金融）。"]}
{"word":"BComm","summary":{"en":"BComm is an abbreviation for Bachelor of Commerce, a business-focused undergraduate degree (and sometimes the commerce program itself).","zh":"BComm是Bachelor of Commerce的缩写，指商学/商业方向的本科学位（有时也指商科项目本身）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bachelor of Commerce (an undergraduate university degree focused on business and commerce).","zh":"商学学士／商业学士（以商业与商科为主的本科大学学位）。"},"examples":[{"en":"She earned a BComm in Accounting and now works at a bank.","zh":"她取得了会计方向的BComm学位，现在在银行工作。"},{"en":"The job posting says a BComm or equivalent degree is preferred.","zh":"招聘信息写着优先考虑BComm或同等学历。"}]},{"partOfSpeech":"n.","definition":{"en":"A university program/major in Commerce, especially when used informally to refer to the course of study.","zh":"商科课程／商学专业（口语中指某个学校的商科项目或学习方向）。"},"examples":[{"en":"I’m in BComm at UBC, specializing in finance.","zh":"我在英属哥伦比亚大学读BComm，主修金融方向。"},{"en":"He switched from engineering to BComm after first year.","zh":"他大一后从工程转到了BComm（商科）。"}]}],"synonyms":["Bachelor of Commerce","B.Comm.","commerce degree","BBA (similar in some contexts)"],"phonetic":"/ˈbiː.kɑːm/","extraExplanation":["“BComm”常见于加拿大、澳大利亚、新西兰等英语国家的高校与简历中；在一些地区也会写作“B.Comm.”。","在美国语境里更常见的对应说法是“BBA (Bachelor of Business Administration)”或直接写“Bachelor’s in Business/Commerce”，因此跨国家申请或写英文简历时可考虑同时写全称以避免误解：e.g., “BComm (Bachelor of Commerce)”。"]}
{"word":"BCompSc","summary":{"en":"BCompSc means “Bachelor of Computer Science,” an undergraduate degree in computer science.","zh":"BCompSc 指“计算机科学学士”，即计算机科学本科（学士）学位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbreviation) Bachelor of Computer Science: an undergraduate university degree in computer science.","zh":"（缩写）计算机科学学士：大学本科层次的计算机科学学位。"},"examples":[{"en":"She earned a BCompSc and now works as a software engineer.","zh":"她获得了计算机科学学士（BCompSc）学位，现在是一名软件工程师。"},{"en":"The job posting says a BCompSc (or equivalent degree) is required.","zh":"招聘信息写明需要计算机科学学士（BCompSc）或同等学历。"},{"en":"On his resume, he listed: BCompSc, University of X, 2024.","zh":"在他的简历上，他写道：BCompSc，X大学，2024年。"}]}],"synonyms":["Bachelor of Computer Science","BSc (Computer Science)","BS in Computer Science","BCompSci"],"phonetic":"/ˌbiː kɑːmp ˈsaɪ/","extraExplanation":["BCompSc 常见于学校官网、成绩单、学位证书或简历中。不同国家/学校的写法可能不同：也可能写作 BSc (Computer Science)、BS in Computer Science、BCompSci 等，含义通常相近，但具体课程设置与授予学位名称以学校正式文件为准。","正式场合第一次出现时，常用“Bachelor of Computer Science (BCompSc)”的写法，之后再用缩写。"]}
{"word":"BComSc","summary":{"en":"BComSc is an abbreviation for a university degree, most often “Bachelor of Computer Science,” but it can vary by institution.","zh":"BComSc是大学学位的缩写，最常见指“计算机科学学士”，但在不同学校可能有不同含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) A degree title used by some universities, most commonly meaning “Bachelor of Computer Science.”","zh":"（缩写）某些大学使用的学位名称，最常见指“计算机科学学士”。"},"examples":[{"en":"She listed a BComSc on her résumé and then completed a master’s degree in AI.","zh":"她在简历上写了BComSc，之后又读了人工智能方向的硕士。"},{"en":"The job ad says applicants with a BComSc (or similar computing degree) are welcome.","zh":"招聘信息写明欢迎拥有BComSc（或类似计算机相关学位）的人申请。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) In some schools, a degree combining Commerce/Business and Science (meaning varies by institution).","zh":"（缩写）在部分学校也可指“商科/商业 + 理科”的复合学位（具体含义因学校而异）。"},"examples":[{"en":"At his university, BComSc includes business courses plus science electives.","zh":"在他的大学里，BComSc包含商科课程以及理科选修课。"},{"en":"Check the program page to confirm what BComSc stands for at your school.","zh":"请查看项目官网，确认你们学校的BComSc具体代表什么。"}]}],"synonyms":["BCompSc","BSc (Computer Science)","BSCS"],"phonetic":"/ˌbiː kɑm ˌɛs ˌsiː/","extraExplanation":["BComSc不是全球统一的标准缩写：更常见的写法是BCompSc（Bachelor of Computer Science）。如果你在证书、学校官网或成绩单上看到BComSc，最好以该校的官方项目名称为准。","写简历时可以在第一次出现时写全称以避免歧义，例如：“BComSc (Bachelor of Computer Science)”。"]}
{"word":"BCP","summary":{"en":"BCP most commonly means Business Continuity Plan (a plan to keep operations running during disruptions). In Internet standards, it can also mean Best Current Practice (an RFC category).","zh":"BCP最常见的意思是业务连续性计划（在中断事件中维持运营的方案）。在互联网标准中也可指最佳现行实践（RFC的一种文档类别）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbreviation) Business Continuity Plan: a written plan for how an organization will keep operating or quickly recover after emergencies (e.g., fire, cyberattack, power outage).","zh":"（缩写）业务连续性计划：用于说明组织在突发事件（如火灾、网络攻击、停电）发生时如何维持运作或快速恢复的书面方案。"},"examples":[{"en":"Our company updated its BCP after last year’s ransomware attack.","zh":"去年遭遇勒索软件攻击后，我们公司更新了BCP。"},{"en":"The audit found that the BCP didn’t include a plan for remote work.","zh":"审计发现该BCP没有包含远程办公的方案。"},{"en":"During the storm, the team followed the BCP to keep customer support running.","zh":"暴风雨期间，团队按照BCP来保证客服持续运转。"}]},{"partOfSpeech":"other","definition":{"en":"(abbreviation, computing/standards) Best Current Practice: an Internet standards document (an RFC series label) describing widely accepted practices.","zh":"（缩写，计算机/标准）最佳现行实践：互联网标准文档的一种（RFC系列标签），用来说明业内广泛认可的做法。"},"examples":[{"en":"This guideline is published as a BCP in the RFC series.","zh":"这份指南以RFC系列中的BCP形式发布。"},{"en":"The network team follows the BCP recommendations for secure routing.","zh":"网络团队遵循BCP对安全路由的建议。"}]}],"synonyms":["business continuity plan","continuity plan","disaster recovery plan (related)","Best Current Practice (RFC)"],"phonetic":"/bi si pi/","extraExplanation":["在商业语境里，BCP最常指“Business Continuity Plan（业务连续性计划）”。它通常与DRP（Disaster Recovery Plan，灾难恢复计划）一起出现：BCP更强调“业务如何持续”，DRP更偏“IT系统如何恢复”。","在邮件或会议里看到BCP时，最好根据上下文确认具体含义，因为在互联网工程领域也可能指“Best Current Practice（RFC中的一类文档）”。"]}
{"word":"BCPL","summary":{"en":"BCPL most commonly refers to an early programming language that influenced B and C.","zh":"BCPL最常指一种早期编程语言，对B语言和C语言有重要影响。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a simple, influential programming language created in the 1960s, designed mainly for writing compilers and system software; it strongly influenced the later B and C languages","zh":"一种诞生于20世纪60年代、结构简单但影响深远的编程语言，主要用于编写编译器与系统软件；对后来的B语言与C语言影响很大"},"examples":[{"en":"BCPL is often mentioned in the history of the C programming language.","zh":"BCPL常被提到，因为它出现在C语言的发展史里。"},{"en":"Early systems software was sometimes written in BCPL.","zh":"早期的一些系统软件有时会用BCPL编写。"}]},{"partOfSpeech":"n.","definition":{"en":"the abbreviation for “BCPL” (the letters B–C–P–L); in other fields it can have different meanings, so you may need to ask for the context","zh":"“BCPL”的缩写（即字母B–C–P–L）；在不同领域可能代表不同含义，通常需要结合上下文确认"},"examples":[{"en":"When someone says “BCPL,” ask whether they mean the programming language.","zh":"如果有人说“BCPL”，可以先确认对方是不是指那门编程语言。"}]}],"phonetic":"/ˌbiː siː piː ˈɛl/","extraExplanation":["BCPL全称通常写作 Basic Combined Programming Language，由英国计算机科学家 Martin Richards 在1960年代设计。它的思想与风格影响了B语言，进而影响了C语言，因此在“编程语言谱系/历史”类书籍与课程中经常出现。"]}
{"word":"BCR","summary":{"en":"BCR is an abbreviation most commonly meaning “B-cell receptor” in biology/medicine, and it can also mean “Business Change Request” in workplace/IT contexts; other meanings depend on the field.","zh":"BCR是一个缩写，最常见指生物/医学中的“B细胞受体”，也可指职场/IT中的“业务变更请求”；其他含义取决于具体领域。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbreviation) B-cell receptor; a protein complex on the surface of B cells that binds to antigens (used in immunology).","zh":"（缩写）B细胞受体；位于B细胞表面的蛋白复合体，用来识别并结合抗原（免疫学用语）。"},"examples":[{"en":"Researchers measured BCR signaling after the vaccine.","zh":"研究人员在接种疫苗后测量了BCR信号传导。"},{"en":"Abnormal BCR activity can be linked to some lymphomas.","zh":"异常的BCR活性可能与某些淋巴瘤有关。"}]},{"partOfSpeech":"other","definition":{"en":"(abbreviation) Business Change Request (or Change Request); a formal request to change a project, system, or process (common in workplaces/IT).","zh":"（缩写）业务变更请求（或变更请求）；对项目、系统或流程提出正式修改的申请（常见于职场/IT）。"},"examples":[{"en":"Please submit a BCR before changing the requirements.","zh":"在更改需求之前请先提交一份BCR。"},{"en":"The BCR was approved, so the team updated the timeline.","zh":"BCR获批后，团队更新了时间表。"}]},{"partOfSpeech":"other","definition":{"en":"(abbreviation) Bank for International Settlements’ Basel Committee on Banking Supervision sometimes uses related terms, but BCR can also mean “Basel Capital Requirements” in some finance contexts (less standardized; meaning depends on the document).","zh":"（缩写）在金融语境中，BCR有时指“巴塞尔资本要求”等相关说法（不够统一，具体含义取决于文件/机构）。"},"examples":[{"en":"The report compares BCR levels across different banks.","zh":"该报告比较了不同银行的BCR水平。"},{"en":"In this document, BCR refers to capital requirements under Basel rules.","zh":"在本文档中，BCR指巴塞尔规则下的资本要求。"}]}],"synonyms":["(for B-cell receptor) BCR complex","(for Business Change Request) change request (CR)"],"phonetic":"/ˌbiː siː ˈɑr/","extraExplanation":["“BCR”是缩写，在不同领域意思差异很大。阅读时通常需要看上下文（例如医学论文、IT工单、金融报告）或首次出现时是否有全称（如“BCR (B-cell receptor)”）。","作为字母缩写，口语里一般逐字母念：B-C-R。写作中建议第一次出现时写出全称，后面再用BCR。"]}
{"word":"BCS","summary":{"en":"BCS is an abbreviation with multiple meanings; common ones include Bachelor of Computer Science, British Computer Society, Business Continuity Strategy/Plan, and (in physics) BCS theory.","zh":"BCS 是一个多义缩写；常见含义包括：计算机科学学士、英国计算机学会、业务连续性策略/计划，以及（物理中的）BCS 超导理论。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation used for several different things; the meaning depends on the context (field, country, and sentence).","zh":"一个有多种含义的缩写；具体指什么取决于语境（领域、国家和句子）。"},"examples":[{"en":"On his résumé, BCS means Bachelor of Computer Science.","zh":"在他的简历里，BCS 指“计算机科学学士”（Bachelor of Computer Science）。"},{"en":"Our company reviewed the BCS after the power outage.","zh":"停电之后，我们公司重新审查了 BCS（业务连续性策略/方案）。"}]},{"partOfSpeech":"other","definition":{"en":"Bachelor of Computer Science (a university degree name used in some countries and schools).","zh":"计算机科学学士（一些国家和学校使用的学位名称）。"},"examples":[{"en":"She graduated with a BCS and now works as a software engineer.","zh":"她获得了计算机科学学士学位（BCS），现在做软件工程师。"}]},{"partOfSpeech":"other","definition":{"en":"British Computer Society (a professional organization for people working in IT in the UK).","zh":"英国计算机学会（英国的信息技术行业专业组织）。"},"examples":[{"en":"He joined the BCS to access professional training and certifications.","zh":"他加入了 BCS，以获得职业培训和认证资源。"}]},{"partOfSpeech":"other","definition":{"en":"Business Continuity Strategy/Plan (documents and actions to keep a business running during disruptions).","zh":"业务连续性策略/计划（在突发中断时维持企业运作的方案）。"},"examples":[{"en":"The BCS includes backup internet and remote-work procedures.","zh":"这份 BCS 包括网络备份和远程办公流程。"}]},{"partOfSpeech":"other","definition":{"en":"BCS (physics): a theory (Bardeen–Cooper–Schrieffer) explaining superconductivity.","zh":"BCS（物理）：巴丁–库珀–施里弗（Bardeen–Cooper–Schrieffer）超导理论。"},"examples":[{"en":"The lecture introduced BCS theory and the idea of Cooper pairs.","zh":"讲座介绍了 BCS 理论以及“库珀对”的概念。"}]}],"phonetic":"ˌbiː siː ˈɛs","extraExplanation":["在英文里，大写缩写（acronym/initialism）常常“一词多义”。如果你把含有 BCS 的完整句子或它出现的领域（例如：简历/大学专业/IT 组织/物理课/公司流程）发我，我可以帮你精准判断这里的 BCS 指哪一个。","读法通常是逐个字母读：B-C-S。正式写作中第一次出现时，常写全称并在后面括号标注缩写（例如：British Computer Society (BCS)）。"]}
{"word":"BCWP","summary":{"en":"BCWP is an EVM acronym for the budgeted value of work actually completed (earned value).","zh":"BCWP 是挣值管理术语，指按预算成本计算的“实际已完成工作”的价值（挣值）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Budgeted Cost of Work Performed; an earned value management (EVM) term meaning the value of the work actually completed, measured using the planned (budgeted) cost.","zh":"已完工作预算成本；挣值管理（EVM）术语，指按计划（预算）单价/成本来衡量“实际已完成”的工作价值。"},"examples":[{"en":"Our BCWP is lower than planned, so the project is behind schedule in terms of earned value.","zh":"我们的 BCWP 低于计划值，因此从挣值角度看项目进度落后。"},{"en":"The report lists BCWS, BCWP, and ACWP for each month.","zh":"报告按月列出了 BCWS、BCWP 和 ACWP。"},{"en":"If BCWP is greater than ACWP, the work is costing less than expected.","zh":"如果 BCWP 大于 ACWP，说明完成这些工作花费低于预期。"}]}],"synonyms":["EV","earned value"],"phonetic":"/ˌbiː siː ˌdʌbəl.juː ˈpiː/","extraExplanation":["BCWP 常见于项目管理/国防与工程合同文档中，是“Earned Value（EV，挣值）”的旧式缩写写法。","相关对比：BCWS（Budgeted Cost of Work Scheduled，计划完成工作预算成本/计划值PV）与 ACWP（Actual Cost of Work Performed，已完工作实际成本/实际成本AC）。","常用判断：进度偏差 SV = BCWP − BCWS；成本偏差 CV = BCWP − ACWP。"]}
{"word":"BCWS","summary":{"en":"BCWS is an EVM term meaning the budgeted cost (planned value) of the work scheduled to be done by a certain time.","zh":"BCWS 是挣值管理术语，指截至某一时间按计划应完成工作的预算成本（计划值）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Budgeted Cost of Work Scheduled; the planned value of work that should be completed by a certain date in Earned Value Management (EVM).","zh":"计划完成工作预算成本；在挣值管理（EVM）中，指截至某一日期“按计划应完成”的工作对应的预算成本（即计划值）。"},"examples":[{"en":"By the end of week 4, the BCWS is $120,000, meaning we planned to complete $120,000 worth of work.","zh":"到第4周末，BCWS为12万美元，表示我们计划完成相当于12万美元预算的工作量。"},{"en":"We compare BCWS with BCWP to see whether we are ahead of or behind schedule.","zh":"我们把BCWS和BCWP进行比较，以判断进度是超前还是落后。"}]}],"synonyms":["PV (Planned Value)"],"phonetic":"/ˌbiː siː ˌdʌbəl.juː ˈɛs/","extraExplanation":["BCWS 是项目管理“挣值管理（EVM）”里的传统术语，现代更常用的对应说法是 PV（Planned Value，计划值）。","常见对比：BCWS（计划做多少） vs. BCWP/EV（实际完成了多少“挣值”） vs. ACWP/AC（实际花了多少钱）。"]}

