{"word":"BD","summary":{"en":"BD is a common abbreviation with several meanings; the most frequent are business development, bipolar disorder, Blu-ray Disc, Bangladesh (code), and Bachelor of Divinity.","zh":"BD是常见缩写，含义不止一种；最常见包括业务拓展、双相情感障碍、蓝光光盘、孟加拉国（代码）以及神学学士。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation for “business development” (work focused on finding new customers, partnerships, and growth opportunities).","zh":"“business development（业务拓展）”的缩写，指寻找新客户、合作伙伴和增长机会的工作。"},"examples":[{"en":"She works in BD at a software company.","zh":"她在一家软件公司做BD（业务拓展）。"},{"en":"The BD team is meeting a potential partner tomorrow.","zh":"BD团队明天要和一个潜在合作伙伴见面。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation for “bipolar disorder” (a mental health condition involving shifts in mood, energy, and activity levels).","zh":"“bipolar disorder（双相情感障碍）”的缩写，一种会出现情绪、精力和活动水平波动的心理健康状况。"},"examples":[{"en":"He was diagnosed with BD and is getting treatment.","zh":"他被诊断为BD（双相情感障碍），正在接受治疗。"},{"en":"If you see “BD” in a medical note, it may refer to bipolar disorder.","zh":"如果你在医疗记录里看到“BD”，它可能指双相情感障碍。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation for “Blu-ray Disc,” a high-definition optical disc format.","zh":"“Blu-ray Disc（蓝光光盘）”的缩写，一种高清光盘格式。"},"examples":[{"en":"This movie is available on DVD and BD.","zh":"这部电影有DVD和BD（蓝光）版本。"},{"en":"My player supports BD playback.","zh":"我的播放器支持播放BD（蓝光）。"}]},{"partOfSpeech":"other","definition":{"en":"The two-letter country code for Bangladesh, seen in internet domains and official codes.","zh":"孟加拉国的两字母国家代码，常见于域名和官方编码。"},"examples":[{"en":"The website ends in .bd.","zh":"这个网站以 .bd 结尾。"},{"en":"BD is the country code for Bangladesh.","zh":"BD是孟加拉国的国家代码。"}]},{"partOfSpeech":"other","definition":{"en":"A short form for “Bachelor of Divinity,” a graduate degree in theology.","zh":"“Bachelor of Divinity（神学学士）”的缩写，一种神学领域的学位。"},"examples":[{"en":"He earned a BD before becoming a minister.","zh":"他在成为牧师之前获得了BD（神学学士）学位。"}]}],"synonyms":["biz dev (informal)","Blu-ray"],"phonetic":"/biː diː/","extraExplanation":["“BD”是缩写，具体含义高度依赖语境：在职场聊天里常指业务拓展；在医学语境中可能指双相情感障碍；在影音产品里常指蓝光光盘；在域名/国际代码里可能指孟加拉国。","书面正式表达时，第一次出现通常建议写全称（例如 business development），后面再用 BD，避免歧义。"]}
{"word":"bd","summary":{"en":"“BD” is a common abbreviation meaning “birthday,” “business development,” or the country code for Bangladesh, depending on context.","zh":"“BD”是常见缩写，语境不同可表示“生日（birthday）”“业务拓展（business development）”或“孟加拉国国家代码（Bangladesh）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation for “birthday.”","zh":"“birthday（生日）”的缩写。"},"examples":[{"en":"Happy BD! Hope you have a great day.","zh":"生日快乐（BD）！祝你今天过得很开心。"},{"en":"I can’t make it to your BD party, but I’ll call you later.","zh":"我去不了你的生日派对，但我晚点会打给你。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation for “business development,” meaning work focused on growing a company (new clients, partnerships, markets).","zh":"“business development（业务拓展/商务拓展）”的缩写，指推动公司增长的工作（开发客户、建立合作、开拓市场等）。"},"examples":[{"en":"She works in BD at a software company.","zh":"她在一家软件公司做BD（业务拓展）。"},{"en":"Our BD team is talking to potential partners.","zh":"我们的BD团队正在和潜在合作伙伴洽谈。"}]},{"partOfSpeech":"other","definition":{"en":"A country code abbreviation for Bangladesh.","zh":"孟加拉国（Bangladesh）的国家代码缩写。"},"examples":[{"en":"The package has “BD” on the address label.","zh":"包裹的地址标签上有“BD”。"},{"en":"His phone number starts with +880, the code for BD (Bangladesh).","zh":"他的电话号码以+880开头，这是BD（孟加拉国）的国家区号。"}]}],"synonyms":["b-day (for “birthday”)","biz dev (for “business development”)"],"phonetic":"/ˌbiːˈdiː/","extraExplanation":["“BD”在聊天/社交媒体里常指birthday（生日），很口语；在职场（尤其是互联网、外企、销售相关）更常指business development（业务拓展）。","因为“BD”是缩写，正式写作中通常应写全称（birthday / business development / Bangladesh），除非读者明确知道语境。"]}
{"word":"bd.","summary":{"en":"An abbreviation meaning either “twice daily” (medical) or “business development.”","zh":"缩写：可指“每日两次”（医学处方）或“业务拓展”（职场）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(chiefly UK, medical) Abbreviation meaning “twice a day,” used in prescriptions and medication instructions.","zh":"（主要英式医学用法）缩写，表示“一天两次”，常见于处方或用药说明。"},"examples":[{"en":"Take one tablet bd with food.","zh":"随餐每日两次，每次服用一片。"},{"en":"The label says bd, so you take it in the morning and evening.","zh":"标签写着 bd，所以早晚各服一次。"}]},{"partOfSpeech":"other","definition":{"en":"Initialism for “business development,” meaning the work of finding and growing business opportunities (common in job titles).","zh":"“business development”的首字母缩写，指“业务拓展/商务拓展”（也常见于职位名称）。"},"examples":[{"en":"She works in BD at a software company.","zh":"她在一家软件公司做商务拓展（BD）。"},{"en":"The BD team is meeting a potential client today.","zh":"商务拓展团队今天要见一个潜在客户。"}]}],"synonyms":["twice daily","two times a day","BID","business development","sales development"],"phonetic":"/ˌbiˈdi/","extraExplanation":["医学处方缩写在不同国家可能不一致：英式常见 “bd”，美式更常写 “BID/b.i.d.” 表示“一天两次”。拿到处方时以医生/药师说明为准。"],"etymology":"“bd.” 是缩写写法：医学里来自拉丁语用药频次表达体系（对应“twice daily/一天两次”的用法在英式处方中常见）；职场里的 “BD” 来自短语 business development 的首字母。","mnemonic":["把 bd 记成 “breakfast + dinner”：早饭一次、晚饭一次 → 一天两次。","职场 BD：把它联想成 “Build Deals（建立合作/交易）” → 业务拓展。"]}
{"word":"BDA","summary":{"en":"BDA is an abbreviation with several common meanings, especially Business Development Associate/Advisor, Big Data Analytics, Bluetooth Device Address, and (UK) British Dental Association.","zh":"BDA是一个多义缩写，常见含义包括：业务拓展专员/顾问、大数据分析、蓝牙设备地址，以及（英国）英国牙科协会。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(business) Business Development Associate/Advisor: a job title for someone who helps a company grow by finding new customers, partners, or sales opportunities.","zh":"（商业）业务拓展专员/顾问：帮助公司通过寻找新客户、合作伙伴或销售机会来增长的职位名称。"},"examples":[{"en":"She works as a BDA at a software startup, reaching out to potential clients.","zh":"她在一家软件初创公司做BDA，负责联系潜在客户。"},{"en":"The company hired two BDAs to open the new market in Texas.","zh":"公司雇了两名BDA来开拓德州的新市场。"}]},{"partOfSpeech":"n.","definition":{"en":"(data/tech) Big Data Analytics: the process of analyzing very large datasets to find patterns and support decisions.","zh":"（数据/科技）大数据分析：对海量数据进行分析以发现规律并辅助决策的过程。"},"examples":[{"en":"We use BDA to predict customer churn and improve retention.","zh":"我们用BDA来预测客户流失并提升留存。"},{"en":"BDA tools can help hospitals spot trends in patient outcomes.","zh":"BDA工具能帮助医院发现病人治疗结果的趋势。"}]},{"partOfSpeech":"n.","definition":{"en":"(networking) Bluetooth Device Address: a unique identifier for a Bluetooth device (often shortened to “device address”).","zh":"（网络/硬件）蓝牙设备地址：用于标识某个蓝牙设备的唯一编号（常简称为设备地址）。"},"examples":[{"en":"To pair the devices, the technician checked the BDA in the settings menu.","zh":"为了配对设备，技术人员在设置菜单里查看了BDA。"},{"en":"The log records the phone’s BDA when it connects to the speaker.","zh":"日志会在手机连接音箱时记录手机的BDA。"}]},{"partOfSpeech":"n.","definition":{"en":"(UK) British Dental Association: the main professional association for dentists in the United Kingdom.","zh":"（英国）英国牙科协会：英国牙医的主要行业协会。"},"examples":[{"en":"The dentist said the BDA had issued updated guidance.","zh":"牙医说BDA发布了更新的指导意见。"},{"en":"She attended a BDA conference in London.","zh":"她参加了在伦敦举办的BDA会议。"}]}],"synonyms":["abbrev.","acronym"],"phonetic":"/ˌbiː diː ˈeɪ/","extraExplanation":["BDA是缩略词，具体意思高度依赖语境（行业/国家/上下文）。在邮件、职位描述里最常见的是Business Development Associate/Advisor；在数据岗位或报告中可能指Big Data Analytics；在蓝牙/设备日志里则常见Bluetooth Device Address；在英国医疗新闻里可能是British Dental Association。","读字母时常说“B-D-A”。写作时第一次出现建议先写全称再加括号：Business Development Associate (BDA)。"]}
{"word":"bday","summary":{"en":"“bday” is an informal abbreviation of “birthday.”","zh":"“bday”是“birthday（生日）”的非正式缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal) Short for “birthday.” Used in texts, chats, and casual writing.","zh":"（非正式）“birthday（生日）”的缩写。常用于短信、聊天和随意的书写中。"},"examples":[{"en":"Happy bday! Hope you have a great day.","zh":"生日快乐！希望你今天过得很棒。"},{"en":"It’s my mom’s bday this weekend.","zh":"这周末是我妈妈的生日。"},{"en":"Don’t forget his bday—it's on May 3.","zh":"别忘了他的生日——是5月3号。"}]}],"synonyms":["birthday","b-day"],"phonetic":"/ˈbɝːθ.deɪ/","extraExplanation":["“bday”多见于社交媒体、短信、便条等非正式场景；在正式邮件、简历或正式邀请函中，建议写全“birthday”。","常见搭配：happy bday（生日快乐）、bday party（生日派对）、bday gift（生日礼物）。有时也会写作“b-day”，意思相同。"]}
{"word":"BDC","summary":{"en":"“BDC” is an initialism meaning different things by context; common meanings include Business Development Center and (in Canada) Business Development Bank of Canada.","zh":"“BDC”是语境相关的首字母缩写；常见含义包括“商务拓展中心”以及（在加拿大）“加拿大商业发展银行”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation pronounced as the letters “B-D-C”; its meaning depends on context (common in business, education, and technology).","zh":"由字母逐个读出的缩写“B-D-C”；具体含义取决于语境（常见于商业、教育与科技领域）。"},"examples":[{"en":"What does BDC stand for in this email?","zh":"这封邮件里的 BDC 是什么意思？"},{"en":"In our company, BDC usually refers to the Business Development Center.","zh":"在我们公司里，BDC 通常指商务拓展中心（Business Development Center）。"}]},{"partOfSpeech":"other","definition":{"en":"(business) Business Development Center — a team/office that finds leads, contacts customers, and supports sales (common in car dealerships and large companies).","zh":"（商业）商务拓展中心——负责获取线索、联系客户、支持销售的团队或部门（常见于汽车经销商或大型公司）。"},"examples":[{"en":"The BDC called me to confirm my test-drive appointment.","zh":"商务拓展中心（BDC）打电话给我确认试驾预约。"},{"en":"Our BDC handles inbound calls and schedules consultations.","zh":"我们的 BDC 负责接听来电并安排咨询。"}]},{"partOfSpeech":"other","definition":{"en":"(Canada, finance/politics) Business Development Bank of Canada — a Canadian government-owned bank that supports small and medium-sized businesses.","zh":"（加拿大，金融/政治）加拿大商业发展银行——加拿大国有银行，主要支持中小企业发展。"},"examples":[{"en":"She got a loan through BDC to expand her small business.","zh":"她通过 BDC 贷款来扩大自己的小生意。"},{"en":"BDC offers financing and advisory services for entrepreneurs.","zh":"BDC 为创业者提供融资和咨询服务。"}]}],"phonetic":"/ˌbiː diː ˈsiː/","extraExplanation":["“BDC”是典型的首字母缩写（initialism），通常按字母读作“B-D-C”。在不同国家/行业含义差别很大：在北美汽车行业里多指“Business Development Center”；在加拿大新闻或商业语境中，常见的是“Business Development Bank of Canada”。如果你告诉我它出现的句子或领域（邮件、公司部门、银行、课程等），我可以帮你锁定最准确的释义。"]}
{"word":"BDD","summary":{"en":"BDD most commonly means Behavior-Driven Development in software; in medical contexts it may refer to bipolar disorder (and sometimes other conditions).","zh":"BDD 最常见指软件领域的“行为驱动开发”；在医疗语境中可能指“双相障碍”（有时也可能指其他疾病缩写）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Behavior-Driven Development: a software development approach that uses human-readable examples (often written as “Given–When–Then”) to describe how a feature should behave, helping developers, testers, and product people share the same understanding.","zh":"行为驱动开发：一种软件开发方法，用人类可读的示例（常见格式为“Given–When–Then”）来描述功能应有的行为，帮助开发、测试与产品在同一理解上协作。"},"examples":[{"en":"We use BDD to turn user stories into clear acceptance tests.","zh":"我们用 BDD 把用户故事转化为清晰的验收测试。"},{"en":"In BDD, scenarios describe behavior from the user’s point of view.","zh":"在 BDD 中，场景从用户视角描述系统行为。"}]},{"partOfSpeech":"n.","definition":{"en":"Bipolar disorder (medical): a mental health condition involving shifts in mood, energy, and activity levels, including episodes of mania/hypomania and depression.","zh":"双相障碍（医学）：一种精神健康状况，表现为情绪、精力与活动水平的波动，可出现躁狂/轻躁狂与抑郁发作。"},"examples":[{"en":"BDD is sometimes used as an abbreviation for bipolar disorder in medical notes.","zh":"在一些医疗记录里，BDD 有时被用作“双相障碍”的缩写。"},{"en":"If you see BDD in a healthcare context, confirm the meaning from the document or clinician.","zh":"如果你在医疗语境中看到 BDD，最好结合文件或向专业人士确认其含义。"}]}],"synonyms":["Behavior-Driven Development","Given-When-Then","acceptance-test–driven development (ATDD)"],"phonetic":"/ˌbiː diː ˈdiː/","extraExplanation":["在软件语境里，BDD 常与 TDD（测试驱动开发）一起被提到：TDD 更偏“先写测试再写代码”，BDD 更强调“用业务可读的语言描述行为”，便于跨团队沟通。","BDD 的常见工具/格式包括 Gherkin 语法（Given/When/Then）以及 Cucumber、SpecFlow 等框架；但核心思想是“用示例对齐需求”，不依赖某个特定工具。","在医学语境中，缩写可能存在歧义；另外也有人用 BDD 指 Body Dysmorphic Disorder（躯体变形障碍），所以看到缩写时要结合上下文判断。"]}
{"word":"Bde","summary":{"en":"BDE is usually an abbreviation for Business Development Executive, but it can mean different things depending on context.","zh":"BDE通常是“Business Development Executive（业务拓展）”的缩写，但具体含义需结合语境判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbr.) Business Development Executive; a job title for someone who finds new customers or business opportunities.","zh":"（缩写）业务拓展专员/经理（BDE）；指负责开发新客户或新商机的职位。"},"examples":[{"en":"She works as a BDE for a software company and meets potential clients every week.","zh":"她在一家软件公司做BDE，每周都会拜访潜在客户。"},{"en":"The startup is hiring a BDE to grow sales in the U.S. market.","zh":"这家初创公司正在招聘BDE，来拓展美国市场的销售。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) A general abbreviation that can mean different things depending on the context (company, school, online community, etc.).","zh":"（缩写）在不同语境里可能代表不同含义的缩写（因公司、学校或网络圈子而异）。"},"examples":[{"en":"In this email, BDE refers to a role on their sales team.","zh":"在这封邮件里，BDE指的是他们销售团队中的一个岗位。"},{"en":"If you’re not sure what BDE means, ask for the full form.","zh":"如果你不确定BDE是什么意思，可以请对方写出全称。"}]}],"synonyms":["business development","BD","sales development (context-dependent)"],"phonetic":"/ˌbi di ˈi/","extraExplanation":["“BDE”最常见的职场含义是 Business Development Executive（业务拓展）。但在网络语境中也可能被用作其他缩写（例如某些社群会用它指代不同词组）。如果你能提供一句原文或使用场景（邮件/职位描述/聊天截图），我可以帮你判断最准确的意思。"]}
{"word":"bde","summary":{"en":"“BDE” most commonly means “Big Data Engineer” in tech contexts, and can also mean the internet slang “big dick energy” (informal, potentially vulgar) meaning confident, relaxed vibes.","zh":"“BDE”在技术语境中多指“大数据工程师”；也可作网络俚语“big dick energy”的缩写（较不正式且带粗俗来源），表示自信从容的气场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation (initialism) that can refer to a “Big Data Engineer,” a job focused on building and maintaining large-scale data systems.","zh":"缩写（首字母缩略语），可指“Big Data Engineer（大数据工程师）”，从事构建与维护大规模数据系统的岗位。"},"examples":[{"en":"She works as a BDE and builds data pipelines for the company.","zh":"她是一名BDE（大数据工程师），负责为公司搭建数据管道。"},{"en":"The job posting says they need a BDE with Spark experience.","zh":"招聘信息写着他们需要一位有Spark经验的BDE（大数据工程师）。"}]},{"partOfSpeech":"n.","definition":{"en":"(internet slang, informal; can be vulgar) short for “big dick energy,” meaning a confident, relaxed presence—often used to praise someone’s vibe, not literally about their body.","zh":"（网络俚语，非正式；含粗俗色彩）“big dick energy”的缩写，指一种自信、从容的气场；常用于夸一个人的“气场/状态”，并非字面谈论身体。"},"examples":[{"en":"He stayed calm under pressure—total BDE.","zh":"他在压力下依然很淡定——简直就是BDE（很有气场）。"},{"en":"That outfit gives BDE.","zh":"这套穿搭很有BDE那种自信从容的感觉。"}]}],"synonyms":["big data engineer","big dick energy","confident vibe","calm confidence"],"phonetic":"ˌbiː diː ˈiː","extraExplanation":["“BDE”是首字母逐个读出来的缩写，口语里通常读作“B-D-E”。具体含义高度依赖语境：职场/技术语境里常指“大数据工程师”；社交媒体语境里常指俚语“big dick energy”。","如果你在正式场合（邮件、课堂、工作汇报）看到或想使用“BDE”，建议优先确认是否指职位；俚语义带有粗俗来源，在正式语境中不推荐使用。"]}
{"word":"bdellatomy","summary":{"en":"Bdellatomy is a rare medical term meaning treatment by applying leeches (leeching/bloodletting).","zh":"bdellatomy 是一个罕见的医学词，指用水蛭吸血进行治疗（即水蛭疗法/放血疗法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine, rare/old-fashioned) Treatment by applying leeches to a patient to draw blood; leeching (a form of bloodletting).","zh":"（医学，罕见/旧式）用水蛭吸血来治疗；水蛭疗法/放血疗法的一种。"},"examples":[{"en":"In the 1800s, some doctors prescribed bdellatomy for fever and inflammation.","zh":"在19世纪，一些医生会用水蛭疗法（bdellatomy）来治疗发烧和炎症。"},{"en":"Today, leech therapy is used only in specific cases, so bdellatomy sounds very old-fashioned.","zh":"如今水蛭疗法只在少数特定情况使用，因此 bdellatomy 听起来很古老。"}]}],"synonyms":["leeching","hirudotherapy","bloodletting"],"phonetic":"/ˌdɛləˈtɑːmi/","extraExplanation":["词源提示：bdell- 来自希腊语 bdella，意为“水蛭（leech）”；-tomy 表示“切开/施行某种手术或操作”。合起来指“用水蛭进行的治疗/放血”。","文化与历史背景：在欧洲医学史上，放血（bloodletting）曾与“体液学说”相关，认为抽出“多余的血”可平衡身体。现代医学不再用它治疗一般疾病，但在显微外科（如皮瓣/断指再植）中，水蛭有时用于缓解静脉淤血，这更常被称为 hirudotherapy（现代术语）。","拼写提醒：你输入的 bdellatomy 很可能也会见到拼作 bdellotomy；两者在资料中常被当作同义的罕见词。"]}
{"word":"bdellid","summary":{"en":"Bdellid most commonly means a predatory mite in the family Bdellidae; it can also be an adjective meaning “related to bdellids.”","zh":"Bdellid 最常指短足螨科（Bdellidae）的一种捕食性螨；也可作形容词，表示“与短足螨有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small predatory mite belonging to the family Bdellidae (often found in soil, leaf litter, or on plants).","zh":"一种捕食性的小型螨，属于“短足螨科（Bdellidae）”，常见于土壤、落叶层或植物表面。"},"examples":[{"en":"Under the microscope, the student identified a bdellid moving quickly across the slide.","zh":"在显微镜下，学生辨认出一只短足螨在载玻片上快速爬行。"},{"en":"Some gardeners welcome bdellid mites because they can prey on tiny pests.","zh":"一些园艺爱好者欢迎短足螨，因为它们会捕食一些微小害虫。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to bdellids or to the family Bdellidae.","zh":"与短足螨（bdellid）或短足螨科（Bdellidae）有关的。"},"examples":[{"en":"The paper compared bdellid species found in dry and wet habitats.","zh":"这篇论文比较了干燥与潮湿环境中发现的短足螨物种。"}]}],"synonyms":["bdellid mite","Bdellidae mite"],"phonetic":"/ˈdɛlɪd/","extraExplanation":["“bdellid”主要是生物学/生态学里的专门词，日常英语里很少见。","词根来自希腊语 bdella（意为“水蛭/蚂蟥”）。不过现代用法中，bdellid 通常指一类“螨”（mites），不等同于水蛭。"]}
{"word":"Bdellidae","summary":{"en":"Bdellidae: a family of predatory mites.","zh":"Bdellidae：捕食性螨类的一个科（节螨科）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of small, fast-moving predatory mites that often live in soil, leaf litter, or on plants and may help control other tiny pests.","zh":"（节螨科）一类体型很小、行动迅速的捕食性螨类，常见于土壤、落叶层或植物上，可能帮助控制其他微小害虫。"},"examples":[{"en":"Bdellidae are predatory mites that feed on small arthropods and their eggs.","zh":"节螨科是捕食性螨类，会以小型节肢动物及其卵为食。"},{"en":"Researchers recorded several Bdellidae species in the garden soil sample.","zh":"研究人员在花园土壤样本中记录到多种节螨科物种。"}]}],"synonyms":["predatory mites (family Bdellidae)"],"phonetic":"/ˈdɛlaɪdi/","extraExplanation":["“Bdellidae”是生物分类学名称（科名），常用于学术写作与物种调查报告中。词源与拉丁化的希腊语有关：希腊语 bdella（意为“水蛭”）曾用来指某些吸附或捕食的小型生物，后来成为相关属名/科名的构词来源之一。","读写提示：在英文论文中常见写法为“the family Bdellidae”（节螨科），首字母大写，斜体通常只用于属名和种名，不用于科名。"]}
{"word":"bdellidae","summary":{"en":"Bdellidae = a family of predatory mites (“snout mites”).","zh":"Bdellidae＝长吻螨科，一类捕食性的螨。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of small predatory mites (arachnids), often called “snout mites,” that feed on other tiny arthropods such as pest mites.","zh":"（生）一种捕食性的螨类科（蛛形纲），常被称为“长吻螨/吻螨（snout mites）”，以其他微小节肢动物（如害螨）为食。"},"examples":[{"en":"Bdellidae are predatory mites that can help reduce populations of pest mites.","zh":"Bdellidae（长吻螨科）是捕食性螨类，可能有助于降低害螨数量。"},{"en":"In a microscope lab, students identified a Bdellidae mite by its long, pointed mouthparts.","zh":"在显微镜实验课上，学生通过它细长尖状的口器辨认出一只Bdellidae的螨。"}]}],"synonyms":["snout mites","predatory mites"],"phonetic":"/ˌdɛlˈaɪdi/","extraExplanation":["“Bdellidae”是生物分类学名称，指“长吻螨科”（一类捕食性螨）。在农业与生态学语境中，它们有时被提到是潜在的“天敌”生物，因为会捕食一些作物害螨或小型节肢动物。","词源上常被认为与希腊语 bdella（意为“水蛭”）有关，可能暗示其捕食习性；但日常英语里更多使用通俗名 snout mites（“长吻螨”）来帮助理解。"]}
{"word":"bdellium","summary":{"en":"Bdellium is a fragrant gum resin, known from ancient trade and sometimes mentioned in the Bible.","zh":"Bdellium 指一种芳香树脂（没药脂/香胶），常见于古代贸易与文献，也在部分《圣经》译本中出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fragrant gum resin from certain trees, used in perfume, incense, and traditional medicine (sometimes also used as a term for similar aromatic resins).","zh":"没药脂（某些树分泌的芳香树脂），用于香水、熏香和传统药用；有时也泛指类似的芳香树脂。"},"examples":[{"en":"Ancient traders sold bdellium along with frankincense and myrrh.","zh":"古代商人会把没药脂和乳香、没药一起贩卖。"},{"en":"The text describes a perfume made with bdellium resin.","zh":"文中描写了一种用没药脂树脂制成的香料。"}]},{"partOfSpeech":"n.","definition":{"en":"(literary/Biblical) a precious aromatic substance mentioned in the Bible, sometimes debated in translation and identification.","zh":"（文学/《圣经》用法）《圣经》中提到的一种珍贵芳香物质；其具体所指在翻译与考证中有争议。"},"examples":[{"en":"In some Bible translations, bdellium is listed among valuable natural products.","zh":"在一些《圣经》译本中，bdellium 被列为珍贵的天然产物之一。"},{"en":"Scholars discuss what bdellium may have referred to in the ancient Near East.","zh":"学者们会讨论在古代近东语境里 bdellium 可能具体指什么。"}]}],"synonyms":["gum resin","aromatic resin"],"phonetic":"ˈdɛliəm","extraExplanation":["词源上来自拉丁语/希腊语传统（bdellion），在古代文献中常与乳香（frankincense）、没药（myrrh）并列出现。","在中文里有时会被译作“没药脂/香胶”，但要注意它不等同于“没药（myrrh）”，两者是不同的树脂类香料。"]}
{"word":"bdelliums","summary":{"en":"Bdellium is a rare word meaning a fragrant resin used like incense or perfume.","zh":"Bdellium 是个较少见的词，指一种带香味的树脂，可像熏香或香水原料那样使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fragrant gum resin (from certain Commiphora trees) used in incense, perfume, and sometimes traditional medicine","zh":"没药属（Commiphora）某些树分泌的芳香树脂（胶质树脂），用于熏香、香水，有时也用于传统药用"},"examples":[{"en":"The ancient merchant sold bdellium and myrrh along the trade routes.","zh":"那位古代商人沿着商路贩卖乳香树脂（bdellium）和没药。"},{"en":"Some old texts describe bdellium as a sweet-smelling resin used for incense.","zh":"一些古文献把 bdellium 描述为一种带甜香、可用来焚香的树脂。"}]}],"synonyms":["resin","gum resin","incense resin"],"phonetic":"/ˈdɛliəm/","extraExplanation":["“bdellium”常见于《圣经》英译本（如《创世记》2:12）以及古代香料/药材记载中，因此带有明显的历史与宗教文本色彩。","拼写提示：标准单数是 bdellium，复数是 bdelliums。这个词比较少见，阅读历史、宗教或香料贸易相关材料时更可能遇到。"]}
{"word":"bdelloid","summary":{"en":"A bdelloid is a microscopic freshwater rotifer (or something related to it), famous for extreme survival and mostly asexual reproduction.","zh":"bdelloid 指蛭态轮虫（或与之相关的事物），这种微小淡水轮虫以强生存能力和主要无性生殖而著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tiny freshwater rotifer (a microscopic, wheel-bearing animal) of the group Bdelloidea, known for surviving harsh conditions and reproducing without males in most cases","zh":"蛭态轮虫（Bdelloidea），一种生活在淡水中的微小轮虫类动物，以能在恶劣环境中存活、且多以无性生殖（通常不需要雄性）而闻名"},"examples":[{"en":"Bdelloids can dry out for months and then become active again when water returns.","zh":"蛭态轮虫可以干燥休眠数月，等水分回来后又能恢复活动。"},{"en":"Scientists study bdelloid rotifers to understand long-term asexual reproduction.","zh":"科学家研究蛭态轮虫，以了解长期无性生殖是如何维持的。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to bdelloid rotifers or the group Bdelloidea","zh":"与蛭态轮虫或蛭态轮虫类群（Bdelloidea）有关的"},"examples":[{"en":"The paper describes bdelloid diversity in mountain streams.","zh":"这篇论文描述了山地溪流中的蛭态轮虫多样性。"}]}],"synonyms":["bdelloid rotifer","rotifer (general)"],"phonetic":"/ˈdɛlɔɪd/","extraExplanation":["“bdelloid”来自分类学名称 Bdelloidea，常见于生物学与生态学文章中。","蛭态轮虫常被提到的特点包括：耐受干旱（隐生/休眠状态）、对辐射和环境压力的较强耐受性，以及主要以雌性个体进行无性繁殖；因此在进化生物学中很有研究价值。"]}
{"word":"Bdelloida","summary":{"en":"Bdelloida: a scientific group of microscopic animals (bdelloid rotifers) known for surviving drying and often reproducing asexually.","zh":"Bdelloida：一种微小动物类群（蛭轮虫），以耐干燥生存和常见无性生殖而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific group (order/class within Rotifera) of microscopic freshwater animals called bdelloid rotifers, known for surviving drying out and for reproducing without males in many species","zh":"（生物分类）蛭轮虫类群（轮形动物门中的一支），是一类生活在淡水或潮湿环境中的微小动物，许多物种以无性生殖为主，并以耐干燥生存能力著称"},"examples":[{"en":"Bdelloida are often found in moss, puddles, and thin films of water.","zh":"蛭轮虫常见于苔藓、水洼以及很薄的一层水膜中。"},{"en":"Some researchers study Bdelloida to understand how animals can survive extreme drying.","zh":"一些研究人员研究蛭轮虫，以了解动物如何在极端干燥中存活。"},{"en":"Bdelloida are famous in biology classes for their long-term asexual reproduction.","zh":"在生物课上，蛭轮虫因其长期的无性生殖而出名。"}]}],"synonyms":["bdelloid rotifers","bdelloids"],"phonetic":"/ˈdɛlɔɪdɑ/","extraExplanation":["“Bdelloida”是拉丁化的生物分类名称，常见相关形容词/名词形式是“bdelloid”（蛭轮虫的）。在科普或论文里，你更常看到“bdelloid rotifers（蛭轮虫）”。","这类动物在干旱时可进入类似“休眠”的状态（常被描述为能耐受脱水），遇水后可恢复活动；因此常被用来研究极端环境生存机制。","不同教材/文献里分类层级可能写作order（目）或更细的分类单位；如果你是在读论文，建议对照该文使用的分类体系。"]}
{"word":"bdelloida","summary":{"en":"Bdelloidea: microscopic rotifers, famous for mostly asexual reproduction and drought survival.","zh":"Bdelloidea：一种微小轮虫类群，以几乎无性生殖与耐旱存活著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group (class) of microscopic freshwater animals called rotifers, known for mostly reproducing without males and for surviving drying out.","zh":"一种微小的淡水轮虫类群（一个“纲”），以几乎不需要雄性、主要进行无性生殖，以及能在干燥环境中存活而闻名。"},"examples":[{"en":"Bdelloidea are common in ponds, wet moss, and temporary puddles.","zh":"Bdelloidea 常见于池塘、潮湿的苔藓以及短暂形成的水坑中。"},{"en":"Scientists study Bdelloidea to understand asexual reproduction and long-term survival.","zh":"科学家研究 Bdelloidea，以了解无性生殖和长期生存机制。"}]}],"synonyms":["bdelloid rotifers","bdelloids"],"phonetic":"/dɛˈlɔɪdiə/","extraExplanation":["发音提示：开头的 b 通常不发音，可把它理解成“delloidea”。","生物学背景：Bdelloidea 常被称为“蛭形轮虫/无雄轮虫（bdelloid rotifers）”。它们以几乎全为雌性、长期无性繁殖而出名，是进化与遗传研究中的经典对象。","生态与适应：它们具有耐旱能力（干燥时进入类似“休眠”的状态，遇水后可恢复活动），因此能在苔藓、土壤表层等间歇性湿润环境中存活。"]}
{"word":"bdelloids","summary":{"en":"Bdelloids are tiny rotifers that often reproduce asexually and can survive drying out.","zh":"bdelloids 指蛭形轮虫：微小的轮虫类动物，常无性繁殖，并能在干燥后复苏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Tiny freshwater animals (a type of rotifer) in the group Bdelloidea, known for surviving harsh conditions and usually reproducing without males.","zh":"一种微小的淡水动物（轮虫的一类，称“蛭形轮虫纲/蛭形轮虫类”Bdelloidea），以能在恶劣环境中生存、且通常不需要雄性就能繁殖而闻名。"},"examples":[{"en":"Bdelloids live in ponds, puddles, and even wet moss.","zh":"蛭形轮虫常生活在池塘、水坑，甚至潮湿的苔藓里。"},{"en":"Scientists study bdelloids because many of them reproduce asexually.","zh":"科学家研究蛭形轮虫，因为其中许多种是无性繁殖的。"},{"en":"After drying out, bdelloids can become active again when water returns.","zh":"在干燥后，蛭形轮虫在水分恢复时还能再次活动。"}]}],"synonyms":["bdelloid rotifers","Bdelloidea","rotifers (general)"],"phonetic":"/ˈdɛlɔɪdz/","extraExplanation":["“bdelloids”是复数形式；单数常写作“bdelloid”。更完整的说法是“bdelloid rotifers（蛭形轮虫）”。","它们常被提到的原因：①长期以无性繁殖为主；②具有“隐生/耐旱复苏”（干燥时几乎停止代谢，遇水后恢复）的能力；③在进化与遗传研究中很有代表性。","词源提示：来自分类名“Bdelloidea”，与希腊语中表示“水蛭/蛭”的词根相关，形容其外形或运动方式。"]}
{"word":"bdellometer","summary":{"en":"A rare historical term for an instrument that measures how much blood a leech removes.","zh":"一个罕见的历史医学词，指测量水蛭吸出血量的器具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare or historical medical instrument used to measure the amount of blood taken by a leech during bloodletting.","zh":"（罕见/历史用语）一种用于测量水蛭放血时吸出血量的医疗器具。"},"examples":[{"en":"In the 1800s, some physicians used a bdellometer to estimate how much blood a leech had drawn.","zh":"在19世纪，一些医生会用 bdellometer 来估算水蛭吸出了多少血。"},{"en":"The museum display included leech jars and a bdellometer from early medical practice.","zh":"博物馆展柜里有水蛭罐，以及早期医疗实践中的 bdellometer。"}]}],"synonyms":["leech gauge","blood-loss measure (by leeches)","(historical) leech-measuring instrument"],"phonetic":"/ˌdɛləˈmɑtər/","extraExplanation":["词源可拆解为 bdello-（源自希腊语 bdella「水蛭」）+ -meter（测量器）。它属于非常冷僻的历史医学词汇，主要出现在讨论“水蛭放血/放血疗法”（bloodletting）的文献或博物馆语境中。","现代医学中几乎不会使用这个词；更常见的表达会直接说“measure the blood loss / the amount of blood drawn by leeches（测量失血量/水蛭吸血量）”。"]}
{"word":"Bdellostoma","summary":{"en":"Bdellostoma is a scientific genus name for hagfish.","zh":"Bdellostoma 是“盲鳗属”的学名（属名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of hagfish (jawless, eel-like marine animals) known for producing large amounts of slime as a defense; found mainly in the Southern Hemisphere","zh":"盲鳗属（海产无颌、鳗状的原始脊椎动物），以遇敌会分泌大量黏液自卫而著名，主要分布于南半球海域"},"examples":[{"en":"Bdellostoma is a genus of hagfish that can release slime to deter predators.","zh":"Bdellostoma 是一种盲鳗属动物，会释放黏液来吓退或阻止捕食者。"},{"en":"Researchers studied Bdellostoma to understand how its slime fibers form so quickly in seawater.","zh":"研究人员研究 Bdellostoma，以了解它的黏液纤维如何在海水中迅速形成。"}]}],"synonyms":["hagfish (common name)","slime eel (common name, informal)"],"phonetic":"/ˌdɛləˈstɑmə/","extraExplanation":["这是一个生物学中的拉丁化属名，常见于学术论文、动物分类和纪录片解说中；日常英语里更常用的普通名是 hagfish（盲鳗）。","词源可拆解为希腊语 bdella（“水蛭”）+ stoma（“嘴、口”），用于描述其口部特征；在现代使用中主要作为分类学名称。"]}
{"word":"bdellostoma","summary":{"en":"Bdellostoma is the scientific genus name for certain hagfish—jawless, eel-like marine scavengers famous for producing slime.","zh":"Bdellostoma 是部分盲鳗的科学属名（盲鳗属），为无颌、似鳗的海洋腐食动物，以分泌黏液著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of hagfish (jawless marine fish) found mainly in the Southern Hemisphere; members are eel-like scavengers known for producing large amounts of slime.","zh":"盲鳗属（无颌类海洋鱼的一属，主要分布于南半球）；外形似鳗，常以腐食为主，以能分泌大量黏液而闻名。"},"examples":[{"en":"In some museum collections, Bdellostoma specimens are preserved to study early vertebrate evolution.","zh":"在一些博物馆的馆藏中，会保存盲鳗属（Bdellostoma）的标本，用于研究早期脊椎动物的演化。"},{"en":"Bdellostoma is a type of hagfish, often discussed when talking about slime-producing animals.","zh":"盲鳗属（Bdellostoma）属于盲鳗类，谈到会产生黏液的动物时常会提到它。"}]}],"synonyms":["hagfish","genus Bdellostoma"],"phonetic":"/bəˈdɛloʊˌstoʊmə/","extraExplanation":["词源上常被解释为来自希腊语：bdella（“水蛭/吸血虫”）+ stoma（“口”），用于描述其口部结构与取食方式的联想。","它是生物学分类学中的拉丁化属名，通常首字母大写（Bdellostoma），并以斜体书写。","日常英语里更常用的通俗说法是 hagfish（盲鳗），而 Bdellostoma 多见于学术论文、物种名录与博物馆标本标签。"]}
{"word":"Bdellostomatidae","summary":{"en":"Bdellostomatidae is the scientific family name for certain hagfishes (slime-producing, jawless marine fish).","zh":"Bdellostomatidae 是部分盲鳗（会分泌黏液的无颌海鱼）的科学分类“科”名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of hagfishes (jawless, eel-like marine fish) found mainly in the Southern Hemisphere; members are often called “slime eels” because they can produce large amounts of mucus for defense.","zh":"盲鳗科：一种盲鳗（无颌、鳗状的海洋鱼类）的分类“科”，主要分布在南半球；其成员常被称为“黏液鳗/黏液鱼”，因为遇到危险时能分泌大量黏液自我保护。"},"examples":[{"en":"Bdellostomatidae includes several species of hagfish that live in cold southern oceans.","zh":"盲鳗科包含多种生活在南部寒冷海域的盲鳗。"},{"en":"In marine biology, Bdellostomatidae is discussed as an important group among jawless fishes.","zh":"在海洋生物学中，盲鳗科常被作为无颌类鱼的重要类群来讨论。"}]}],"synonyms":["hagfish family","slime eel family"],"phonetic":"/ˌdɛləstoʊˈmædɪdi/","extraExplanation":["这是一个生物分类学名（“科”= family），通常出现在学术文章、物种名录或博物馆资料中，日常英语里不常用。","词源上可拆解为希腊语成分：bdella（“水蛭”）+ stoma（“口”）+ -idae（动物分类学中表示“科”的后缀），与其口部结构和取食方式的早期描述有关。"]}
{"word":"bdellostomatidae","summary":{"en":"Bdellostomatidae is an older scientific family name for some hagfishes, often replaced by Myxinidae in modern classification.","zh":"Bdellostomatidae 是用于某些盲鳗的旧科名，现代分类中常以 Myxinidae 取代。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific family name (taxonomy) once used for some hagfishes; in many modern classifications these animals are placed in the family Myxinidae.","zh":"（生物分类学）曾用于某些盲鳗（hagfish）的一个科名；在许多较新的分类体系中，这些动物多归入黏盲鳗科 Myxinidae。"},"examples":[{"en":"Bdellostomatidae is an older family name you may see in some zoology references about hagfishes.","zh":"Bdellostomatidae 是一个较旧的科名，你可能会在一些关于盲鳗的动物学资料中看到。"},{"en":"In newer taxonomy, many species once listed under Bdellostomatidae are classified within Myxinidae.","zh":"在较新的分类中，许多曾被列入 Bdellostomatidae 的物种被归入 Myxinidae。"}]}],"synonyms":["Myxinidae (modern classification in many sources)"],"phonetic":"/ˌdɛl.oʊ.stoʊˈmæt.ɪ.diː/","extraExplanation":["这是拉丁化的生物学科名（family name），通常出现在学术论文、标本标签或旧版分类书中。不同作者与年代对盲鳗的科级划分可能不一致，因此检索资料时可同时查 Myxinidae（常见的现代用名）以及相关属名/俗名（如 hagfish、盲鳗）。"]}
{"word":"Bdellostomidae","summary":{"en":"Bdellostomidae is the scientific family name for certain hagfishes (jawless marine fish).","zh":"Bdellostomidae 是某些盲鳗（无颌海洋鱼类）的科学“科名”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of hagfishes (jawless marine fish) that includes the Pacific hagfish and related species","zh":"盲鳗科（无颌的海洋鱼类）的一科，包含太平洋盲鳗等相关物种"},"examples":[{"en":"Bdellostomidae are commonly called hagfishes and are known for producing large amounts of slime.","zh":"盲鳗科动物常被称为“盲鳗”，以能分泌大量黏液而闻名。"},{"en":"Researchers studied Bdellostomidae to understand how jawless fishes evolved.","zh":"研究人员通过研究盲鳗科来了解无颌鱼类的演化。"}]}],"synonyms":["hagfish (common name)","hagfish family (informal)"],"phonetic":"/ˌdɛləˈstɑːmɪdi/","extraExplanation":["“Bdellostomidae”是生物分类学中的“科名”，通常出现在学术文章、动物志或博物馆标本信息里；日常英语里更常说“hagfish（盲鳗）”。","词源上可拆为类似希腊语成分：bdella（蛭/水蛭）+ stoma（口）；早期命名常借用希腊/拉丁词根来描述外形或特征。"]}
{"word":"bdellostomidae","summary":{"en":"Bdellostomidae is a zoological family name for hagfishes, often considered an older/alternative name now usually treated under Myxinidae.","zh":"Bdellostomidae 是盲鳗的一个动物学科名，多见于旧资料；现代多归入或改用 Myxinidae。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name used in zoology for hagfishes (eel-like, jawless marine animals), often treated today as part of or synonymous with the family Myxinidae","zh":"（动物学）盲鳗（hagfish）的一科名；在现代分类中常被视为归入或等同于 Myxinidae（盲鳗科）的旧称/别称"},"examples":[{"en":"Bdellostomidae appears in some older zoology texts as a family name for hagfishes.","zh":"Bdellostomidae 这个科名在一些较早的动物学文献中用来指盲鳗。"},{"en":"In many modern classifications, species once placed in Bdellostomidae are listed under Myxinidae.","zh":"在许多现代分类体系里，过去归入 Bdellostomidae 的物种通常改列在 Myxinidae 之下。"}]}],"synonyms":["hagfish family","Myxinidae"],"phonetic":"/ˌdɛləˈstɑːmɪdi/","extraExplanation":["这是一个拉丁化的生物分类学名称（“科”级别）。在不同年代、不同作者的分类体系中，科名可能会调整或被合并，因此你会在旧文献里看到 Bdellostomidae，而在新资料里更多看到 Myxinidae。","词根提示：Bdello- 常与“水蛭/吸附、蠕动”等概念相关（源自希腊语），-stoma 表示“口”。不过在分类命名里，这些词根不一定准确描述该类群的所有特征，更重要的是作为固定名称来使用。"]}
{"word":"bdellotomy","summary":{"en":"Bdellotomy is a rare, old medical word meaning “leeching,” or drawing blood using leeches.","zh":"Bdellotomy 是一个罕见的古旧医学词，意思是“用水蛭吸血放血（leeching）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic, medicine) The use of leeches to draw blood; leeching (bloodletting by leeches).","zh":"（古旧用语，医学）用水蛭吸血放血；水蛭放血法。"},"examples":[{"en":"In older medical texts, bdellotomy was recommended to reduce swelling by drawing blood with leeches.","zh":"在一些较早的医学文献中，会建议用 bdellotomy（用水蛭吸血放血）来减轻肿胀。"},{"en":"Today, bdellotomy is rarely mentioned outside historical discussions of bloodletting.","zh":"如今，bdellotomy 除了在讨论放血疗法历史时，几乎不会被提到。"}]}],"synonyms":["leeching","leech therapy","hirudotherapy","bloodletting"],"phonetic":"/bəˈdɛləˌtoʊmi/","extraExplanation":["这个词非常罕见，多见于19世纪或更早的医学写作。词根 bdello- 来自希腊语，意为“水蛭（leech）”，-tomy 表示“切开/手术”，但在这里指的是“通过水蛭来放血”的做法。现代医学里更常见的说法是 leech therapy（蛭疗）或 hirudotherapy（蛭疗）。"]}
{"word":"Bdelloura","summary":{"en":"Bdelloura is a scientific genus name for small marine flatworms, often ectoparasites of horseshoe crabs.","zh":"Bdelloura 是一个学名属名，指一类小型海洋扁虫，常寄生在鲎（马蹄蟹）体表或鳃部。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small marine flatworms (turbellarians), often living as external parasites on horseshoe crabs","zh":"扁虫属（Bdelloura）：一类小型海洋扁形动物（涡虫类），常作为鲎（马蹄蟹）的体外寄生虫生活"},"examples":[{"en":"Bdelloura candida is commonly found on the gills of horseshoe crabs.","zh":"白色扁虫（Bdelloura candida）常见于鲎的鳃部。"},{"en":"Researchers examined Bdelloura to understand parasite–host relationships in coastal ecosystems.","zh":"研究人员研究扁虫属，以了解海岸生态系统中的寄生—宿主关系。"}]}],"synonyms":["flatworm","turbellarian"],"phonetic":"/bɪˈdɛl.jʊrə/","extraExplanation":["这是一个生物分类学名称（属名），通常首字母大写并用斜体书写：Bdelloura。日常英语中很少使用，多见于海洋生物学、寄生虫学和有关“鲎（horseshoe crab）”的学术文本。","词源上常被认为与希腊语中表示“水蛭/吸血虫”相关的词根有关，用来暗示其寄生生活方式；但在现代英语里主要作为拉丁化的学名使用。"]}
{"word":"bdelloura","summary":{"en":"“bdelloura” is not recognized as a standard English word; it is likely a misspelling or a proper noun. Share the context and I’ll identify it.","zh":"“bdelloura”不是常见英文单词，可能是拼写错误或专有名词。提供上下文我可以帮你确定意思。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"This doesn’t appear to be a standard English word. It may be a misspelling, a name, or a word from another language.","zh":"这看起来不是一个标准的英文单词，可能是拼写错误、人名/地名，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “bdelloura” in an English dictionary—could you check the spelling?","zh":"我在英文词典里找不到“bdelloura”——你能确认一下拼写吗？"},{"en":"If you tell me the sentence you saw it in, I can guess the intended word.","zh":"如果你把它出现的句子发给我，我可以帮你推测原本想表达的词。"}]}],"phonetic":"/ˌbiːdiːˈɛloʊrə/","extraExplanation":["我目前无法把“bdelloura”对应到常见英语词条。它很像：1）拼写被打乱/少了字母；2）专有名词（品牌、人名、游戏ID）；3）外来词的拉丁转写。","你可以发我以下任意信息，我就能更准确地解释：①你看到它的原句/上下文；②你想查的可能正确拼写（比如是否以“bell- / bedel- / bdell-”开头）；③它来自哪个领域（医学、文学、游戏、化妆品等）。"]}
{"word":"Bdellouridae","summary":{"en":"Bdellouridae is a biological family name for certain marine flatworms, many associated with horseshoe crabs.","zh":"Bdellouridae 是一个生物分类“科”名，指一类海生扁形动物，其中不少与鲎（马蹄蟹）共生或外寄生。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of small marine flatworms (planarians), many of which live as ectoparasites on horseshoe crabs.","zh":"（生物）Bdellouridae：海生扁形动物（涡虫/扁虫）的一科，许多种类以外寄生方式生活在鲎（马蹄蟹）体表。"},"examples":[{"en":"Bdellouridae are often found on the gills or underside of horseshoe crabs.","zh":"Bdellouridae 常见于鲎的鳃部或腹面。"},{"en":"The researcher identified the specimen as a member of Bdellouridae based on its body shape and habitat.","zh":"研究人员根据体形和栖息环境判断该标本属于 Bdellouridae。"}]}],"synonyms":["bdellourids"],"phonetic":"/ˌdɛˈlʊrɪdi/","extraExplanation":["这是一个分类学名称（“科”一级），多见于生物学与寄生虫学资料中；日常英语里几乎不会用到。","词源可追溯到希腊语 bdella（“水蛭/蚂蟥”），暗示其寄生或吸附的生活方式；后缀 -idae 表示动物分类中的“科”。"]}
{"word":"bdellouridae","summary":{"en":"Bdellouridae is a scientific family name for certain flatworms that live on horseshoe crabs.","zh":"Bdellouridae 是一个科学分类的“科”名，指一类常生活在马蹄蟹身上的扁形动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of small flatworms (triclads) that live as parasites or commensals on horseshoe crabs, especially in marine environments","zh":"（动物分类）马蹄蟹身上的一类小型扁形动物（涡虫纲/三岔涡虫类）的科名；多为寄生或共生，常见于海洋环境"},"examples":[{"en":"Researchers found Bdellouridae living on the gills of horseshoe crabs.","zh":"研究人员在马蹄蟹的鳃部发现了 Bdellouridae（该科扁虫）。"},{"en":"Bdellouridae are often discussed in studies of horseshoe crab symbionts.","zh":"Bdellouridae 常出现在关于马蹄蟹共生生物的研究中。"}]}],"synonyms":["Bdelloura (a related genus name)"],"phonetic":"/ˌdɛlʊˈrɪdi/","extraExplanation":["这是一个拉丁化的生物分类学名称（“科”），常用于学术语境；一般不用于日常英语对话。","词源上与希腊语 bdella（“水蛭”）相关，暗示其外形/生活方式与寄生生物相似；实际属于扁形动物而非水蛭。"]}
{"word":"bdellourids","summary":{"en":"Bdellourids are leeches in the family Bdellouridae, often associated with horseshoe crabs.","zh":"Bdellourids 指蛭科（Bdellouridae）的水蛭，常与鲎（马蹄蟹）有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Leeches of the family Bdellouridae, small parasitic or commensal leeches that commonly live on horseshoe crabs.","zh":"（复数）蛭科（Bdellouridae）的水蛭，体型较小，常寄生或共栖在鲎（马蹄蟹）身上。"},"examples":[{"en":"Researchers found bdellourids attached to the underside of a horseshoe crab.","zh":"研究人员在一只鲎的腹面发现了蛭科水蛭附着其上。"},{"en":"Bdellourids are often discussed in studies of horseshoe crab ecology.","zh":"蛭科水蛭常出现在有关鲎生态的研究中。"}]}],"synonyms":["bdellourid leeches"],"phonetic":"/ˈdɛl.əˌraɪdz/","extraExplanation":["“bdellourids”通常出现在生物学/动物学语境中，是“bdellourid”的复数形式，指一个分类群（蛭科 Bdellouridae）。","词根“bdello-”来自希腊语，和“leech（水蛭）”相关，因此这类词多用于学术命名与分类。","如果你本来想查的是别的拼写（例如某个专有名词或人名），可以把上下文句子发来，我可以帮你确认。"]}
{"word":"Bdellovibrio","summary":{"en":"Bdellovibrio is a genus of predatory bacteria that prey on other bacteria.","zh":"Bdellovibrio（蛭弧菌属）是一类会捕食其他细菌的细菌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tiny predatory bacteria that attack and kill other bacteria (especially Gram-negative bacteria), often studied for possible use in controlling harmful infections","zh":"（细菌属）蛭弧菌属：一种微小的“捕食性”细菌，会攻击并杀死其他细菌（尤其是革兰氏阴性菌），常用于研究其控制有害感染的潜力"},"examples":[{"en":"Bdellovibrio can invade certain bacteria and use them as a nutrient source.","zh":"蛭弧菌属的细菌可以侵入某些细菌，并将其作为营养来源。"},{"en":"Researchers are testing whether Bdellovibrio could help reduce antibiotic-resistant infections.","zh":"研究人员正在测试蛭弧菌属是否能帮助减少耐药性感染。"}]}],"synonyms":["predatory bacteria (contextual)","Bdellovibrio bacteriovorus (a well-known species)"],"phonetic":"/ˌdɛləˈvaɪbrioʊ/","extraExplanation":["“Bdellovibrio”来自希腊语词根：bdella（意为“水蛭”）+ vibrio（意为“弧菌/振动的”），名字暗示其像“寄生/捕食者”一样靠近并攻击其他细菌。","在科普或论文中，它常被称为“predatory bacteria（捕食性细菌）”。它并不是病毒，而是真正的细菌。"]}
{"word":"bdellovibrio","summary":{"en":"Bdellovibrio is a genus of predatory bacteria that kill other bacteria.","zh":"Bdellovibrio 指噬菌弧菌属：一类会捕食并杀死其他细菌的细菌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tiny predatory bacteria that hunt, invade, and kill other bacteria (especially Gram-negative bacteria); often studied for possible use in controlling harmful bacteria","zh":"噬菌弧菌属（一类微小的“捕食性”细菌，会追捕、侵入并杀死其他细菌，尤其常见于对革兰氏阴性菌的捕食；常被研究用于控制有害细菌）"},"examples":[{"en":"Bdellovibrio can attack certain Gram-negative bacteria in water and soil.","zh":"噬菌弧菌属的细菌可以在水体和土壤中攻击某些革兰氏阴性菌。"},{"en":"Some researchers study Bdellovibrio as a possible alternative tool to reduce antibiotic-resistant infections.","zh":"一些研究人员把噬菌弧菌属作为减少耐药感染的潜在替代手段来研究。"}]}],"synonyms":["predatory bacterium (general term)"],"phonetic":"/ˌbdɛloʊˈvaɪbrioʊ/","extraExplanation":["词源上，“Bdello-”来自希腊语，和“水蛭/吸附”的概念有关；“-vibrio”常用来指“弧菌/弯曲的杆状细菌”。","它的捕食方式常被描述为先附着到猎物细胞表面，再进入并在其内部繁殖，最终导致猎物细胞裂解（破裂）。"]}
{"word":"BDes","summary":{"en":"BDes is short for Bachelor of Design, an undergraduate degree in design.","zh":"BDes是Bachelor of Design（设计学学士）的缩写，指设计类本科学位。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Bachelor of Design: an undergraduate degree in design (e.g., graphic design, product/industrial design, fashion, interior, UX).","zh":"设计学学士：一种设计相关的本科学位（如平面设计、产品/工业设计、时装、室内、用户体验等）。"},"examples":[{"en":"She earned a BDes in Graphic Design and now works at a branding agency.","zh":"她获得了平面设计方向的BDes学位，现在在一家品牌设计公司工作。"},{"en":"The portfolio is a key part of applying to a BDes program.","zh":"作品集是申请BDes项目的关键部分。"}]},{"partOfSpeech":"other","definition":{"en":"A short label used in resumes, school catalogs, or email signatures to show the degree title (usage depends on the university/country).","zh":"一种常见缩写，用于简历、课程目录或邮件签名中标注学位名称（具体写法因学校/国家而异）。"},"examples":[{"en":"His signature reads: “Alex Chen, BDes (Hons), University of …”.","zh":"他的邮件签名写着：“Alex Chen，BDes（荣誉学位），……大学”。"},{"en":"In some places, the same degree may be listed as B.Design instead of BDes.","zh":"在一些地区，同一个学位可能写作B.Design，而不是BDes。"}]}],"synonyms":["Bachelor of Design","B.Design","BDes (Hons)"],"phonetic":"/biː dɛz/","extraExplanation":["“BDes”通常出现在英联邦国家（如加拿大、澳大利亚、新西兰、部分英国/南非院校）的网站与文凭上；在美国院校更常见的写法可能是“BFA (Design)”“BS/BA in Design”等。","有些学校会提供“BDes (Hons)”（荣誉学位），一般表示课程更深入、要求更高或包含研究/毕业论文。","写在简历里时，常见格式：Degree + Major + School + Year，例如：“BDes, Industrial Design, 2024”。"]}
{"word":"BDF","summary":{"en":"BDF is an initialism with multiple possible meanings; in networking it often means Bidirectional Forwarding Detection.","zh":"BDF 是一个可能有多种含义的缩写；在网络领域常指“双向转发检测”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation (initialism) for different phrases; the meaning depends on the field and context.","zh":"缩写（字母缩略词）；具体含义取决于领域和上下文。"},"examples":[{"en":"What does BDF stand for in this document?","zh":"在这份文件里，BDF 代表什么？"},{"en":"In tech writing, abbreviations like BDF should be defined the first time they appear.","zh":"在技术写作中，像 BDF 这样的缩写第一次出现时应该先解释清楚。"}]},{"partOfSpeech":"other","definition":{"en":"Bidirectional Forwarding Detection: a networking protocol used to quickly detect failures in network paths.","zh":"双向转发检测：一种网络协议，用于快速检测网络路径故障。"},"examples":[{"en":"We enabled BDF to detect link failures faster.","zh":"我们启用了 BDF 来更快检测链路故障。"},{"en":"BDF helps routers notice a broken connection in seconds.","zh":"BDF 能帮助路由器在几秒内发现连接中断。"}]},{"partOfSpeech":"other","definition":{"en":"Belgian Defence Forces (also written as Belgian Defense Forces): the armed forces of Belgium (context-dependent and not always the official label).","zh":"比利时国防军：比利时的武装力量（看语境使用，不一定是唯一或最官方的称呼）。"},"examples":[{"en":"He said he worked with the BDF during a training exercise.","zh":"他说他在一次训练演习中与 BDF 合作过。"}]}],"synonyms":["initialism","abbreviation"],"phonetic":"/biː diː ɛf/","extraExplanation":["BDF 通常读作字母（B-D-F）。它不是一个固定含义的单词，更像“缩写标签”。最稳妥的做法是看它出现的行业：网络/通信、军事、机构名称、文件格式等。","如果你把 BDF 出现的完整句子或截图发我，我可以根据上下文判断它最可能指什么，并给出更贴切的例句。"]}
{"word":"bdft","summary":{"en":"“bdft/BDFT” is not a common English word; it’s likely a context-specific abbreviation.","zh":"“bdft/BDFT”不是常见英语单词；更可能是依语境而定的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An initialism/abbreviation that is not a standard English word; its meaning depends on context (e.g., a project name, username, or shorthand in a specific community).","zh":"一个不属于常见英语词汇的首字母缩写/缩写；具体含义取决于语境（例如项目名、用户名或某个圈子的简写）。"},"examples":[{"en":"I saw “BDFT” in the chat, but I don’t know what it stands for.","zh":"我在聊天里看到“BDFT”，但我不知道它代表什么。"},{"en":"Could you tell me what “bdft” means in your message?","zh":"你能告诉我你消息里的“bdft”是什么意思吗？"}]}],"phonetic":"/bi di ɛf ti/","extraExplanation":["“bdft”很可能是某个领域（游戏、社群、公司内部、课程等）的缩写或打字误差。请提供你看到它的完整句子/截图，或告诉我它出现的场景（例如聊天、论文、代码、社交媒体），我才能准确解释。"]}
{"word":"bdl","summary":{"en":"BDL is usually an abbreviation; commonly “below detection limit” in lab results, and sometimes “business development lead” at work.","zh":"BDL 通常是缩写；常见指化验/检测中的“低于检出限”，也可能在职场中指“业务拓展负责人”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “below detection limit” (used in lab tests to mean the amount is too small to be reliably measured).","zh":"“below detection limit”的缩写，意为“低于检出限/检测限”（实验室检测中表示含量太低，无法可靠测出）。"},"examples":[{"en":"The pesticide level was reported as BDL.","zh":"农药残留水平被报告为 BDL（低于检出限）。"},{"en":"If the result is BDL, it doesn’t always mean zero—it means the test can’t detect it.","zh":"如果结果是 BDL，不一定代表为零，而是代表该检测方法测不出来。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation that can mean “business development lead” (a person who leads business growth efforts) in some workplaces.","zh":"在一些职场语境中可指“business development lead”，即“业务拓展负责人/商务拓展带头人”。"},"examples":[{"en":"Talk to the BDL about new partnership opportunities.","zh":"去和 BDL（业务拓展负责人）聊聊新的合作机会。"}]}],"synonyms":["below detection limit","below the limit of detection","undetectable (in a test)"],"phonetic":"ˌbiː diː ˈɛl","extraExplanation":["“BDL”不是一个固定的单词，更多是缩写；具体含义很依赖领域（实验室报告、公司职位、项目代号等）。如果你告诉我你在哪个场景看到（比如化验单/论文/公司聊天），我可以给出更准确的释义与用法。"]}
{"word":"bdle","summary":{"en":"“bdle” is not a standard English word; it’s likely a typo (often for “bridle” or “bundle”).","zh":"“bdle”不是标准英语单词；很可能是拼写/打字错误（常见可能是“bridle”或“bundle”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually a misspelling or typo.","zh":"不是标准英语单词；通常是拼写错误或打字错误。"},"examples":[{"en":"“bdle” isn’t an English word—did you mean “bridle” or “bundle”?","zh":"“bdle”不是英语单词——你想写的是“bridle（马缰绳/约束）”还是“bundle（一捆/捆绑）”吗？"},{"en":"If you tell me the sentence, I can guess the correct word.","zh":"如果你把它放进句子里，我可以帮你判断正确的单词。"}]}],"extraExplanation":["“bdle”最常见的情况是少打/漏打了字母。两个很常见的候选词：\n- bridle：/ˈbraɪdəl/（名词“马缰绳”；动词“控制、约束”）\n- bundle：/ˈbʌndəl/（名词“一捆”；动词“捆起来/匆忙穿衣、收拾”）\n把你想表达的中文意思或英文句子发我，我会帮你准确定位。"]}
{"word":"bdls","summary":{"en":"BDLS most commonly refers to Basic Disaster Life Support, a foundational disaster-response training course.","zh":"BDLS 最常指 Basic Disaster Life Support（基础灾难生命支持），一种灾难应对的基础培训课程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an acronym for “Basic Disaster Life Support,” an introductory training course that teaches fundamental skills for responding to disasters and large emergencies (e.g., triage, communication, safety).","zh":"“Basic Disaster Life Support（基础灾难生命支持）”的缩写；一种入门级培训课程，教授应对灾害和大型紧急事件的基本能力（如分诊、沟通与安全等）。"},"examples":[{"en":"She completed BDLS to prepare for volunteering during hurricane season.","zh":"她完成了 BDLS 培训，以便为飓风季的志愿服务做准备。"},{"en":"Our hospital encourages new staff to take BDLS and other emergency-response courses.","zh":"我们医院鼓励新员工参加 BDLS 等应急响应课程。"}]}],"synonyms":["Basic Disaster Life Support","disaster response training"],"phonetic":"/bi di ɛl ɛs/","extraExplanation":["BDLS 常见于美国的应急医学/公共卫生培训体系中，属于灾难应对课程的一部分；不同机构的课程内容与认证要求可能略有差异。","发音通常按字母逐个读：B-D-L-S。若你指的是其他领域的 “BDLS”（例如某个学校/公司/项目的缩写），告诉我上下文，我可以给出对应释义。"]}
{"word":"bdrm","summary":{"en":"“bdrm” is a common abbreviation for “bedroom,” mainly used in real-estate listings.","zh":"“bdrm”是“bedroom（卧室）”的常见缩写，主要用于房产/租房信息中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Abbrev.) bedroom; used especially in real-estate listings or floor plans (e.g., “2 bdrm apt”).","zh":"（缩写）卧室；常见于房产广告、户型图等（如“2 bdrm apt”=两居室公寓）。"},"examples":[{"en":"Bright 1 bdrm apartment near the subway.","zh":"明亮的1室（1卧）公寓，靠近地铁。"},{"en":"The house has 3 bdrm and 2 baths.","zh":"这套房子有3个卧室和2个卫生间。"}]}],"synonyms":["bedroom","BR (real estate)","bd (informal)"],"phonetic":"/ˈbɛdˌruːm/","extraExplanation":["“bdrm”几乎只用于非正式的书面场景（尤其是房源信息、租房广告、户型描述）。正式写作或日常对话通常写/说“bedroom”。","读法上，你可以直接理解为“bedroom”；如果需要念出来，有时会按字母读作“B-D-R-M”。"]}
{"word":"BDS","summary":{"en":"BDS most commonly means either (1) Boycott, Divestment, and Sanctions (a political campaign) or (2) Bachelor of Dental Surgery (a dentistry degree).","zh":"BDS最常见有两种含义：（1）抵制、撤资与制裁（政治行动/运动）；（2）牙科学士/口腔医学学士（牙科专业学位）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Boycott, Divestment, and Sanctions: a political campaign that urges people and institutions to avoid buying from, investing in, or supporting a country or organization, in order to pressure it to change policies.","zh":"“抵制、撤资与制裁”：一种政治行动/运动，呼吁个人或机构通过抵制消费、撤回投资或推动制裁来施压某个国家或组织改变政策。"},"examples":[{"en":"Some universities have debated whether to support BDS.","zh":"一些大学曾就是否支持BDS展开讨论。"},{"en":"The company faced calls for BDS from activist groups.","zh":"这家公司面临活动团体呼吁对其进行BDS（抵制/撤资/制裁）的压力。"}]},{"partOfSpeech":"n.","definition":{"en":"Bachelor of Dental Surgery: an undergraduate professional degree in dentistry in many countries.","zh":"“口腔医学学士/牙科学士”：许多国家的本科层级牙科/口腔医学专业学位。"},"examples":[{"en":"She earned her BDS and then started working at a dental clinic.","zh":"她获得了BDS学位，随后在一家牙科诊所工作。"},{"en":"In some countries, BDS graduates must complete an internship to get a license.","zh":"在一些国家，BDS毕业生需要完成实习才能取得执业资格。"}]}],"synonyms":["(political) boycott campaign","(education) dentistry degree"],"phonetic":"/ˌbiː diː ˈɛs/","extraExplanation":["“BDS”是缩写，具体含义强烈依赖语境。讨论新闻、国际政治或社运时，常指“Boycott, Divestment, and Sanctions”；在教育与职业背景（学校、学历、执照）中，多指牙科专业学位“Bachelor of Dental Surgery”。","作为字母缩写，口语中常逐字母读（B-D-S）。写作时第一次出现通常会先写全称再括号标注BDS。"]}
{"word":"bds","summary":{"en":"“BDS” is most commonly an abbreviation for the dental degree Bachelor of Dental Surgery, or for the political term Boycott, Divestment, Sanctions; in listings it can sometimes mean “beds/bedrooms.”","zh":"“BDS”最常见是牙科学位“牙科外科学士”的缩写，也可能指政治术语“抵制、撤资、制裁”；在房源等列表中有时也指“床位/卧室数”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Bachelor of Dental Surgery,” an undergraduate/professional degree in dentistry (common in the UK, India, and many other countries).","zh":"（缩写）“牙科外科学士”，牙科专业的本科/职业学位（在英国、印度等国家常见）。"},"examples":[{"en":"She studied for a BDS and now works as a dentist.","zh":"她读的是BDS，现在是一名牙医。"},{"en":"In some countries, a BDS is the standard dental degree.","zh":"在一些国家，BDS是牙科的标准学位。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Boycott, Divestment, Sanctions,” a political movement name; often used in news and social media.","zh":"（缩写）“抵制、撤资、制裁”，一种政治运动名称；常见于新闻与社交媒体。"},"examples":[{"en":"The article discussed debates about the BDS movement.","zh":"这篇文章讨论了围绕BDS运动的争议。"},{"en":"BDS is a term you may see in political discussions online.","zh":"你可能会在网上的政治讨论中看到“BDS”这个词。"}]},{"partOfSpeech":"other","definition":{"en":"a shorthand for “beds” in informal writing or listings (less common; context-dependent).","zh":"（缩写/简写）“beds（床位/卧室数）”的简写，用于非正式文本或列表（不太常见，取决于语境）。"},"examples":[{"en":"Apartment listing: 2 bds, 1 bath.","zh":"公寓信息：2 bds（两间卧室/两张床位），1卫。"},{"en":"Check whether “bds” means bedrooms or bed spaces in that listing.","zh":"要看清那条信息里的“bds”指的是卧室数还是床位数。"}]}],"synonyms":["Bachelor of Dental Surgery","Boycott, Divestment, Sanctions","beds (listing shorthand)"],"phonetic":"/biː diː ˈɛs/","extraExplanation":["“BDS”最常见的用法取决于语境：在教育/职业背景里多指牙科学位；在新闻政治语境里可能指“Boycott, Divestment, Sanctions”；在房屋租售信息里偶尔被用来简写“beds/bedrooms”。如果你把它放进一句话或给出出现的场景，我可以帮你精确判断。"]}
{"word":"bds.","summary":{"en":"an abbreviation indicating the number of bedrooms; also a political acronym in some contexts","zh":"表示卧室数量的缩写；在部分语境中也可指某政治运动的首字母缩写"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Abbreviation for “bedrooms,” used especially in real-estate or rental listings to show how many bedrooms a home has.","zh":"（常用于房产/租房信息的）“bedrooms”的缩写，表示卧室数量。"},"examples":[{"en":"2 bds., 1 bath, close to the subway.","zh":"两室一卫，靠近地铁。"},{"en":"The listing says 3 bds., so it should fit our family.","zh":"房源写着三卧室，所以应该够我们一家住。"}]},{"partOfSpeech":"other","definition":{"en":"Acronym for “Boycott, Divestment, and Sanctions,” a political movement name; often written as BDS (without a period).","zh":"“Boycott, Divestment, and Sanctions”的首字母缩写，指一项政治运动；更常写作 BDS（不加句号）。"},"examples":[{"en":"The article discussed the BDS movement and its goals.","zh":"那篇文章讨论了BDS运动及其目标。"},{"en":"Some campuses debate whether to support BDS.","zh":"一些校园里会辩论是否支持BDS。"}]}],"synonyms":["bedrooms","BDS","Boycott, Divestment, and Sanctions"],"phonetic":"/ˌbiːˌdiːˈɛs/","extraExplanation":["在房产/租房广告里，常见缩写还有：ba/bath（卫生间），sq ft（平方英尺），apt（公寓），w/d（洗衣机/烘干机）。看到“bds.”通常就是在这类信息里。"],"etymology":"主要是英语缩写：房产广告中用 bds. 代替 bedrooms 以节省版面；政治语境中的 BDS 来自三个英文词的首字母。","mnemonic":["把 bds. 拆开记：b = bed（床/卧室），ds 像复数提示 → 不止一个卧室。","看到房源标题里“2 bds.”，就直接联想中文“二室”。"]}
{"word":"BDSA","summary":{"en":"BDSA is an abbreviation most commonly meaning the British Dental Students’ Association, or in tech contexts, Big Data Security Analytics; the correct meaning depends on context.","zh":"BDSA是一个缩写，常见含义是“英国牙科学生协会”，在技术语境中也可指“大数据安全分析”；具体含义取决于上下文。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbr.) British Dental Students’ Association: a UK organization representing dental students.","zh":"（缩写）英国牙科学生协会：代表英国牙科学生的组织。"},"examples":[{"en":"She joined the BDSA to meet other dental students and attend conferences.","zh":"她加入了BDSA，以结识其他牙科学生并参加会议。"},{"en":"The BDSA released guidance for students on clinical training.","zh":"BDSA发布了关于临床培训的学生指南。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbr.) Big Data Security Analytics: using large-scale data analysis to detect and respond to cybersecurity threats.","zh":"（缩写）大数据安全分析：利用大规模数据分析来发现并应对网络安全威胁。"},"examples":[{"en":"The company invested in BDSA to detect unusual login behavior.","zh":"公司投入BDSA来检测异常登录行为。"},{"en":"BDSA tools can help security teams find patterns in attack data.","zh":"BDSA工具可以帮助安全团队在攻击数据中发现规律。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbr.) Other uses exist; the meaning depends on context (field, country, document).","zh":"（缩写）还有其他用法；具体含义取决于上下文（领域、国家、文件）。"},"examples":[{"en":"In this article, BDSA refers to a student association, not a technical term.","zh":"在这篇文章里，BDSA指的是学生协会，而不是技术术语。"}]}],"synonyms":["abbrev.","acronym"],"phonetic":"ˌbiː diː ɛs ˈeɪ","extraExplanation":["“BDSA”是首字母缩写，口语里通常按字母逐个读（B-D-S-A）。不同专业里可能指完全不同的事。你如果告诉我它出现的句子/行业（牙科、网络安全、学校社团等），我可以给出更准确的释义和更贴切的例句。"]}
{"word":"BDSM","summary":{"en":"BDSM is an umbrella term for consensual adult practices involving bondage/discipline, dominance/submission, and sadism/masochism.","zh":"BDSM 是指成年人在自愿同意下进行的束缚/调教、支配/臣服、施虐/受虐等相关实践的总称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of consensual adult sexual practices and relationship dynamics involving bondage/discipline, dominance/submission, and sadism/masochism","zh":"一种成年人之间在自愿同意下进行的性实践与关系互动的总称，包含束缚/调教、支配/臣服、施虐/受虐等元素"},"examples":[{"en":"BDSM always requires clear consent and communication.","zh":"BDSM 一定需要清晰的同意与沟通。"},{"en":"They discussed boundaries before trying BDSM activities.","zh":"他们在尝试 BDSM 活动前先讨论了界限与底线。"},{"en":"Some people explore BDSM as a form of role-play and trust-building.","zh":"有些人把 BDSM 作为角色扮演与建立信任的一种方式来探索。"}]}],"synonyms":["kink","sadomasochism","kink community"],"phonetic":"/ˌbiː diː ˌɛs ˈɛm/","extraExplanation":["BDSM 是一个缩写：B/D（Bondage & Discipline，束缚与调教）、D/s（Dominance & submission，支配与臣服）、S/M（Sadism & Masochism，施虐与受虐）。不同的人可能只对其中某一部分感兴趣，并不一定都包含。","在英语语境中，谈到 BDSM 时常强调“成年人、知情同意、可撤回的同意、事先约定边界与安全措施”。常见相关理念缩写有 SSC（Safe, Sane, Consensual：安全、理智、合意）与 RACK（Risk-Aware Consensual Kink：风险知情的合意癖好）。","在正式写作或不熟悉的场合，这个词较敏感；更中性的说法有 “kink” 或 “kink community”（癖好/性偏好社群），但含义不完全等同。"]}
{"word":"BDSM-related","summary":{"en":"BDSM-related means connected with BDSM as a topic, theme, interest, or type of content.","zh":"BDSM-related 指“与 BDSM 有关的”，用于描述主题、兴趣或内容类别。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with or referring to BDSM (bondage and discipline, dominance and submission, sadism and masochism), especially as a theme, interest, or content category","zh":"与 BDSM（束缚与调教、支配与臣服、施虐与受虐）有关的；尤指作为主题、兴趣或内容类别"},"examples":[{"en":"The survey asked about BDSM-related interests, but participation was anonymous.","zh":"这份调查询问了与 BDSM 相关的兴趣，但参与是匿名的。"},{"en":"Some bookstores separate BDSM-related fiction from general romance.","zh":"一些书店会把与 BDSM 相关的小说与普通言情类分开陈列。"},{"en":"Please avoid sharing BDSM-related material in this workplace chat.","zh":"请避免在工作群里分享与 BDSM 相关的内容。"}]}],"synonyms":["BDSM-themed","BDSM-focused","kink-related","fetish-related","adult-themed"],"phonetic":"/ˌbiː.diː.ɛsˈɛm rɪˈleɪtɪd/","extraExplanation":["“BDSM”是一个缩写，常被解释为：Bondage & Discipline（束缚与调教）、Dominance & Submission（支配与臣服）、Sadism & Masochism（施虐与受虐）。在写作中常见“BDSM-related / BDSM related / BDSM-themed”。","这是偏正式的分类用语，常见于媒体分级、研究、社群规则或内容标签中。日常交流中使用时要注意场合与对方舒适度。","“BDSM-related”本身比较中性，表示“与之相关”。如果想更委婉，可用“adult-themed（成人主题的）”“kink-related（性癖/情趣相关的）”（语气更口语）等。"]}
{"word":"BDT","summary":{"en":"BDT most commonly refers to the Bangladeshi taka (Bangladesh’s currency).","zh":"BDT 最常指孟加拉塔卡（孟加拉国货币）的代码。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) The ISO currency code for the Bangladeshi taka, the official currency of Bangladesh.","zh":"（缩写）孟加拉塔卡的国际货币代码（ISO 4217），孟加拉国的官方货币。"},"examples":[{"en":"The hotel charges 8,000 BDT per night.","zh":"这家酒店每晚收费 8,000 BDT（孟加拉塔卡）。"},{"en":"1 USD is about 110–120 BDT, depending on the rate.","zh":"1 美元大约等于 110–120 BDT（视汇率而定）。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., less common) In some technical or academic contexts, it can stand for “Binary Decision Tree.”","zh":"（缩写，较少见）在部分技术或学术语境中可指“二元决策树（Binary Decision Tree）”。"},"examples":[{"en":"We used a BDT model to classify the data.","zh":"我们使用 BDT 模型对数据进行分类。"}]}],"synonyms":["Bangladeshi taka","taka"],"phonetic":"/ˌbiː diː ˈtiː/","extraExplanation":["在实际英文场景里，BDT 最常见的意思是“孟加拉塔卡”。你也可能看到货币符号“৳”，例如：৳500（500 塔卡）。在银行、电商、机票酒店、汇款与外汇报价中常用 ISO 代码（如 BDT、USD、EUR）来避免歧义。"]}

