{"word":"bei","summary":{"en":"“bei” is usually pinyin (or an acronym), not a common standalone English word.","zh":"“bei”通常是拼音写法（或缩写），不是常见的英文独立词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A pinyin syllable used to write several different Mandarin sounds (depending on tone), often seen in Chinese names, place names, or language-learning contexts; not a standard standalone English word.","zh":"汉语拼音音节（根据声调不同表示不同的汉语读音与词义），常见于中文人名、地名或语言学习语境中；并非标准的英文独立词。"},"examples":[{"en":"In pinyin, “bei” can represent different words depending on the tone mark.","zh":"在拼音里，“bei”会因声调符号不同而代表不同的词。"},{"en":"The map labels it as “Bei Jing” in pinyin (more commonly written “Beijing”).","zh":"地图上用拼音标作“Bei Jing”（更常见的写法是“Beijing/北京”）。"},{"en":"Her given name is spelled Bei in English letters.","zh":"她的名字用英文拼写为 Bei。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation seen in some fields or organization names (the meaning depends on context).","zh":"某些领域或机构名称中出现的缩写（具体含义取决于语境）。"},"examples":[{"en":"In this document, BEI refers to a specific organization defined in the glossary.","zh":"在这份文件中，BEI 指代术语表里定义的某个机构。"}]}],"phonetic":"/beɪ/","extraExplanation":["“bei”在汉语拼音里常对应多种声调与词义，例如：bēi（杯，cup），běi（北，north），bèi（被，表示被动或“被子/覆盖物”）。英语里通常不会把“bei”当作普通词使用，多出现在拼音转写或缩写中。","如果你是想查中文“被（bèi）”的用法：它常用来标记被动句，比如“他被老师表扬了”（He was praised by the teacher）。"]}
{"word":"Beica","summary":{"en":"“Beica” is usually a proper name, not a common English word.","zh":"“Beica”通常是专有名词，不是常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (surname or place name) rather than a standard English vocabulary word; in English it is usually used only as a name.","zh":"一个专有名词（如姓氏或地名），不是常见的英语词汇；在英语里通常只作为名字使用。"},"examples":[{"en":"I met Ms. Beica at the conference.","zh":"我在会议上遇到了贝卡女士。"},{"en":"Beica is not a common English word; it may be someone’s name.","zh":"Beica 不是常见的英语单词；它可能是某个人的名字。"}]}],"phonetic":"/ˈbeɪkə/","extraExplanation":["“Beica”在英语词典里通常不作为普通词条出现，更常见于人名/地名/品牌名等场景。","如果你是在句子里看到的（例如：What does Beica mean?），把原句发我，我可以判断它是人名、地名，还是拼写误差（比如想写的是 *baker*、*Becca*、*beige* 等）。"]}
{"word":"beice","summary":{"en":"“Beice” is not a standard English word; it may be a misspelling of “bice” (a rare pigment name or a surname).","zh":"“beice”不是标准英语单词；它可能是“bice”的拼写错误（指一种罕见的颜料名，或作为姓氏）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A blue or green pigment used in painting, especially in older art; “blue bice” and “green bice” are traditional names for these colors.","zh":"（罕见）一种用于绘画的蓝色或绿色颜料，尤其见于较早期的艺术作品；传统上常说“blue bice（蓝拜斯）”“green bice（绿拜斯）”。"},"examples":[{"en":"In some older paintings, blue bice was used for skies and clothing.","zh":"在一些较早的绘画中，蓝拜斯（blue bice）常被用来画天空和衣服。"},{"en":"The conservator tested the paint and found traces of green bice.","zh":"修复师检测颜料后发现了绿拜斯（green bice）的痕迹。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper name) A surname.","zh":"（专有名词）姓氏。"},"examples":[{"en":"Ms. Bice will speak at the meeting today.","zh":"Bice 女士今天将在会议上发言。"}]}],"synonyms":["pigment (for the color meaning)"],"phonetic":"/baɪs/","extraExplanation":["“beice”本身在英语里不是常见单词，很多情况下可能是拼写错误。最接近的可能是：\n1) bice（/baɪs/）：一种旧时绘画颜料名，或姓氏；\n2) beige（/beɪʒ/）：“米色、浅褐色”。\n如果你告诉我你看到它的句子或上下文，我可以帮你确认到底是哪一个。"]}
{"word":"Beichner","summary":{"en":"Beichner is most commonly used as a surname (family name).","zh":"Beichner 最常见的用法是姓氏（家族姓）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname); used as a last name for people","zh":"姓氏；用作人的英文/德裔姓（家族姓）"},"examples":[{"en":"Dr. Beichner will speak at the conference tomorrow.","zh":"Beichner 博士明天将在会议上演讲。"},{"en":"Her last name is Beichner.","zh":"她的姓是 Beichner。"}]}],"phonetic":"/ˈbaɪk.nɚ/","extraExplanation":["“Beichner”多见于德语背景的姓氏（也可能是移民后保留的拼写）。英语里通常按姓氏来使用，首字母大写。","在学术语境中，你可能会遇到这类“姓氏 + 研究/量表/方法”的用法（例如用作者姓来指代某论文或量表）。如果你看到如“Beichner et al.”，其中“et al.”表示“以及其他作者”。"]}
{"word":"Beid","summary":{"en":"“Beid” is not common in modern English; it’s usually an archaic/Scots spelling linked to “bide” (stay, remain, endure/wait) or a misspelling of a more common word like “bead” or “bid.”","zh":"“Beid”在现代英语中不常见；通常是与“bide”（停留、忍受/等待）有关的古旧/苏格兰式拼写，或是把更常见的词（如 bead、bid）拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare/archaic spelling (found especially in Scots or older texts) related to “bide,” meaning to stay, remain, or endure; sometimes used with the sense of “wait.”","zh":"一种罕见/古旧拼写（在苏格兰英语或旧文本中更常见），与 bide 相关，意思是“停留、继续待着、忍受/熬过”；有时也带“等待”的含义。"},"examples":[{"en":"In older writing, you may see forms like “beid” where modern English would use “bide.”","zh":"在较旧的写法中，你可能会看到“beid”这种形式，而现代英语通常会用“bide”。"},{"en":"He beid at home through the storm. (archaic/Scots-style)","zh":"暴风雨期间他一直待在家里。（古旧/苏格兰式用法）"}]}],"synonyms":["bide","remain","stay","endure","wait"],"phonetic":"/biːd/","extraExplanation":["“Beid”在现代标准英语里几乎不用，很多时候更可能是拼写错误或变体拼写。常见的可能目标有：bead（珠子）、bid（出价/投标/请求）、bide（等待；停留；忍受）。如果你告诉我你看到它的句子或语境，我可以帮你判断最可能是哪一个词。","如果你想查的是“bead”：发音和拼写很接近，意思是“（项链等的）珠子；汗珠/水珠”。如果你想查的是“bid”：常见于拍卖（place a bid）或正式请求（bid you welcome）。"]}
{"word":"beid","summary":{"en":"“beid” isn’t a standard English word; it’s usually a misspelling.","zh":"“beid”不是标准英语词汇，通常是拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a typo or misspelling in informal writing (the intended word depends on context).","zh":"不是标准英语单词；多见于非正式写作中的拼写错误（具体想表达哪个词要看上下文）。"},"examples":[{"en":"I couldn’t find “beid” in the dictionary—did you mean “beige” or “bird”?","zh":"我在词典里找不到“beid”——你是不是想写“beige（米色）”或“bird（鸟）”？"},{"en":"Please check the spelling: “beid” is likely a typo.","zh":"请检查拼写：“beid”很可能是打错了。"}]}],"phonetic":"/biːd/","extraExplanation":["“beid”本身没有公认的固定含义或用法。如果你能提供一句包含它的原句，我可以根据语境推断你想表达的单词（常见可能：beige 米色、bird 鸟、bide 等）。"]}
{"word":"Beiderbecke","summary":{"en":"Beiderbecke usually refers to Bix Beiderbecke, a major early American jazz cornetist and composer.","zh":"Beiderbecke通常指早期美国爵士乐的重要人物比克斯·拜德贝克（短号手与作曲家）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) Leon “Bix” Beiderbecke (1903–1931), an influential American jazz cornetist and composer from the early jazz era, known for a cool, lyrical style.","zh":"（专有名词）利昂“比克斯”·拜德贝克（1903–1931），美国早期爵士乐中极具影响力的短号（cornet）演奏家与作曲家，以冷静、抒情、线条感强的风格著称。"},"examples":[{"en":"Bix Beiderbecke is often mentioned alongside Louis Armstrong when people talk about early jazz soloists.","zh":"谈到早期爵士乐独奏家时，人们常把比克斯·拜德贝克与路易斯·阿姆斯特朗并提。"},{"en":"The musician’s biography shows how Beiderbecke helped shape the sound of 1920s jazz.","zh":"这位音乐家的传记显示，拜德贝克在塑造20世纪20年代爵士乐声音方面起了重要作用。"}]},{"partOfSpeech":"n.","definition":{"en":"(Surname) A family name; in English texts it most commonly refers to Bix Beiderbecke.","zh":"（姓氏）一个姓；在英文语境中最常指爵士音乐家比克斯·拜德贝克。"},"examples":[{"en":"In the article, Beiderbecke refers to the cornet player, not a place.","zh":"在这篇文章里，Beiderbecke指的是那位短号手，而不是地名。"}]}],"synonyms":["Bix Beiderbecke","Bix"],"phonetic":"/ˈbaɪdərˌbɛk/","extraExplanation":["“Beiderbecke”在英语里更常见于音乐与文化写作中，尤其是关于早期爵士（Dixieland / early jazz）与20世纪20年代美国流行音乐的讨论。","他的代表曲常被提到，例如《In a Mist》（作曲/钢琴作品），也常与Frank Trumbauer等乐手的合作一起出现。","读到这个名字时，可以把它当作“一个人名/姓氏”，通常不翻译其含义，只做音译（如：拜德贝克）。"]}
{"word":"beige","summary":{"en":"Beige is a light brown color; it can be the name of the color (noun) or describe something that color (adjective).","zh":"Beige 指米色/浅棕色；既可作名词表示这种颜色，也可作形容词描述某物是这种颜色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a light brown color, like sand or unbleached fabric","zh":"米色；浅棕色（像沙子或未漂白布料的颜色）"},"examples":[{"en":"The walls are painted beige to keep the room calm and bright.","zh":"墙被刷成米色，让房间显得宁静又明亮。"},{"en":"He wore beige pants with a white shirt.","zh":"他穿着米色裤子配白衬衫。"}]},{"partOfSpeech":"adj.","definition":{"en":"having a light brown (beige) color","zh":"米色的；浅棕色的"},"examples":[{"en":"She chose a beige coat because it matches almost everything.","zh":"她选了一件米色外套，因为几乎百搭。"},{"en":"The carpet is beige, so it doesn’t show dirt easily.","zh":"地毯是米色的，所以不太显脏。"}]}],"synonyms":["tan","sand","khaki","cream (often lighter)","neutral"],"phonetic":"/beɪʒ/","extraExplanation":["“beige”常用来形容“低调、中性、无个性”的风格（尤其在时尚与室内设计语境）。例如：a beige outfit 可能暗示穿搭很保守、很安全。","发音小提示：美式里常读作 /beɪʒ/，末尾的“zh”音类似中文“日”开头的摩擦感（如英文 measure 里的 s）。"]}
{"word":"beigel","summary":{"en":"“Beigel” means “bagel,” a ring-shaped bread roll; it’s a less common spelling.","zh":"“Beigel”就是“bagel（贝果）”，一种环形面包；这是较少见的拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a ring-shaped bread roll (usually boiled then baked), often eaten with spreads or used for sandwiches; a spelling variant of “bagel.”","zh":"一种环形面包卷（通常先煮后烤），常抹酱食用或夹馅做三明治；“bagel”的拼写变体。"},"examples":[{"en":"I grabbed a beigel with cream cheese for breakfast.","zh":"我早餐拿了一个抹奶油奶酪的贝果。"},{"en":"This deli sells fresh beigels every morning.","zh":"这家熟食店每天早上都卖新鲜的贝果。"},{"en":"In some places, “beigel” is just another way to spell “bagel.”","zh":"在一些地方，“beigel”只是“bagel”的另一种拼法。"}]}],"synonyms":["bagel"],"phonetic":"/ˈbeɪɡəl/","extraExplanation":["“Beigel”这个拼写常见于英国或受意第绪语（Yiddish）影响的语境；来源与东欧犹太社群的传统面包有关。现代英语中更常用的拼写是“bagel”。"]}
{"word":"beiges","summary":{"en":"“Beiges” means several shades of beige (a light brown/yellowish-brown color) or items in those colors.","zh":"“beiges”指多种米色/浅褐色的色调，或这些颜色的物品（如衣物、油漆等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “beige”: light brown or pale yellowish-brown colors; also used for items or clothes in that color","zh":"“beige（米色/浅褐色）”的复数：指多种米色、浅褐色（也可指这种颜色的物品或衣服）"},"examples":[{"en":"The paint chart has several beiges that look good with white trim.","zh":"色卡上有好几种米色，和白色踢脚线很搭。"},{"en":"She tried on a few beiges before choosing a warmer shade.","zh":"她试了几件米色系的衣服，最后选了更偏暖的一种。"}]}],"synonyms":["neutral tones","tan shades","light browns"],"phonetic":"/ˈbeɪʒɪz/","extraExplanation":["在英语里，颜色词常常既能作形容词（a beige coat 米色外套），也能作名词（a beige 米色）。复数“beiges”通常出现在对“多种米色调/米色系”进行对比或选择的语境中。","文化语感上，beige 常被联想到“低调、中性、朴素”，有时也会带一点“保守/不抢眼”的感觉（取决于语境，并不一定是贬义）。"]}
{"word":"beigest","summary":{"en":"“Biggest” means the largest, or (figuratively) the most important/serious.","zh":"“biggest”表示“最大”，也可引申为“最重要/最严重”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative of “big”: the largest in size, amount, or degree.","zh":"“big”的最高级：最大的；数量/程度最高的。"},"examples":[{"en":"This is the biggest room in the house.","zh":"这是房子里最大的房间。"},{"en":"Who has the biggest slice of cake?","zh":"谁拿到了最大的一块蛋糕？"}]},{"partOfSpeech":"adj.","definition":{"en":"Most important, most serious, or most famous (used in a more figurative way).","zh":"（引申）最重要的；最严重的；最有名的。"},"examples":[{"en":"My biggest worry is not having enough time.","zh":"我最大的担心是时间不够。"},{"en":"That was the biggest news of the week.","zh":"那是本周最重大的新闻。"}]}],"synonyms":["largest","greatest","biggest (informal emphasis)","most important"],"phonetic":"/ˈbɪɡɪst/","extraExplanation":["你输入的 **beigest** 通常不是标准拼写；最常见的目标词是 **biggest**（big 的最高级）。\n另外，如果你想表达“最米色的”，英语更自然的说法是 **the most beige**，而不是 *beigest*。"]}
{"word":"beignet","summary":{"en":"A beignet is a French-style fried pastry (like a doughnut), commonly served with powdered sugar, especially in New Orleans.","zh":"beignet 指法式油炸点心（类似甜甜圈），常撒糖粉食用，在新奥尔良尤其有名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, square or round piece of fried dough (a type of doughnut), usually served hot and topped with powdered sugar","zh":"贝涅（法式油炸面团点心，一种甜甜圈），通常趁热吃并撒糖粉"},"examples":[{"en":"We ordered three beignets with coffee for breakfast.","zh":"我们早餐点了三份贝涅配咖啡。"},{"en":"The beignets were warm and covered in powdered sugar.","zh":"贝涅热乎乎的，上面撒满了糖粉。"},{"en":"In New Orleans, beignets are a famous local treat.","zh":"在新奥尔良，贝涅是一种很有名的本地小吃。"}]}],"synonyms":["doughnut","fried pastry","fritter"],"phonetic":"/bɛnˈjeɪ/","extraExplanation":["“Beignet”来自法语，字面有“油炸点心/小炸糕”的意思。英语里常指美国路易斯安那州（尤其新奥尔良）风格的贝涅：通常是方形的油炸面团，撒大量糖粉，常与咖啡（如加菊苣的咖啡）一起食用。","文化提示：在新奥尔良，Cafe du Monde 等老牌咖啡馆让 beignets 成为城市象征之一；很多旅游、电影和美食节目会用它来代表当地的法裔克里奥尔（Creole）饮食文化。"]}
{"word":"beignets","summary":{"en":"Beignets are sweet fried dough pastries, often served hot with powdered sugar, famously associated with New Orleans.","zh":"Beignets 指甜味油炸面点，常趁热撒糖粉食用，在文化上尤其与新奥尔良相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small piece of fried dough, usually served hot and covered with powdered sugar; often eaten as a sweet snack or breakfast.","zh":"一种油炸面团小点心，通常趁热吃并撒上糖粉；常作为甜点、零食或早餐。"},"examples":[{"en":"We ordered beignets and coffee for breakfast.","zh":"我们点了贝涅饼和咖啡当早餐。"},{"en":"The beignets were warm, fluffy, and covered in powdered sugar.","zh":"贝涅饼热乎乎的，松软蓬松，上面铺满了糖粉。"},{"en":"In New Orleans, beignets are a famous treat.","zh":"在新奥尔良，贝涅饼是一种很有名的点心。"}]}],"synonyms":["fried dough","doughnut (similar)","fritter (similar)"],"phonetic":"/ˈbɛnjeɪ/","extraExplanation":["“Beignets”是复数形式，单数是“beignet”。在美国文化里，它常与路易斯安那州的新奥尔良（New Orleans）联系在一起，尤其是法裔影响浓厚的克里奥尔/卡真饮食文化中常见。","词源来自法语“beignet”，大意是“油炸面点”。英文里通常直接借用法语拼写与读法。"]}
{"word":"beigy","summary":{"en":"“beigy” is not a standard spelling; it usually means “beige,” a light tan/cream color.","zh":"“beigy”不是标准拼写；通常指“beige（米色/浅驼色）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Commonly intended as) beige: a light brownish-yellow or pale tan color.","zh":"（通常想写的是）beige：米色、浅棕黄色、浅驼色。"},"examples":[{"en":"She wore a beige coat to match her boots.","zh":"她穿了一件米色外套来搭配靴子。"},{"en":"The walls are painted a soft beige, so the room feels calm.","zh":"墙刷成柔和的米色，所以房间感觉很安静。"}]},{"partOfSpeech":"n.","definition":{"en":"Beige as a color (the shade itself).","zh":"米色（这种颜色本身）。"},"examples":[{"en":"Beige goes well with white, black, and navy.","zh":"米色很适合搭配白色、黑色和海军蓝。"},{"en":"I prefer beige over bright colors for my living room.","zh":"客厅里我更喜欢米色而不是亮色。"}]}],"synonyms":["tan","cream","off-white","sand","khaki"],"phonetic":"/beɪʒ/","extraExplanation":["“beigy”不是标准英文拼写，最常见是把“beige（米色）”拼错了。正确拼写是 beige（结尾是 -ge）。","beige 的发音是 /beɪʒ/，结尾的音像法语借词里的 “zh”（类似中文“日/热”里更接近的浊音），不是 /g/ 的硬音。","在口语里，beige 也常引申表示“朴素、无聊、中规中矩”的风格（比如：a beige personality）。"]}
{"word":"Beiji","summary":{"en":"“Beiji” is pinyin most commonly meaning “the North Pole / the Arctic,” and it can also be a pinyin spelling for various names depending on the characters.","zh":"“Beiji”多指拼音“北极”（北极/北极地区），也可能是不同汉字的人名或地名的拼音写法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Mandarin pinyin) the North Pole; the Arctic region.","zh":"（源自汉语拼音）北极；北极地区。"},"examples":[{"en":"In Chinese, “Beiji” means the North Pole.","zh":"在中文里，“Beiji”指北极。"},{"en":"The researchers traveled to Beiji to study sea ice.","zh":"研究人员前往北极研究海冰。"}]},{"partOfSpeech":"n.","definition":{"en":"a Chinese given name or place name written as “Beiji” in pinyin (meaning depends on the Chinese characters).","zh":"用拼音写作“Beiji”的中文人名或地名（具体含义取决于汉字）。"},"examples":[{"en":"Her hometown is written as “Beiji” in pinyin, but it uses different characters.","zh":"她的家乡拼音写作“Beiji”，但用的是不同的汉字。"}]}],"synonyms":["the North Pole","the Arctic"],"phonetic":"/ˈbeɪ dʒiː/","extraExplanation":["“Beiji”通常对应汉字“北极”，拼音标准写法是“Běijí”（有声调）。英文语境里常直接说“the North Pole”或“the Arctic”。如果你指的是人名/地名，需要知道具体汉字才能确定意思。"]}
{"word":"Beijing","summary":{"en":"Beijing is the capital city of China and an important cultural and historical center.","zh":"Beijing 是中国的首都，也是重要的文化与历史中心。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The capital city of the People’s Republic of China, located in northern China; a major political, cultural, and historical center.","zh":"北京：中华人民共和国首都，位于中国北方；重要的政治、文化与历史中心。"},"examples":[{"en":"Beijing is the capital of China.","zh":"北京是中国的首都。"},{"en":"Many people visit Beijing to see the Great Wall and the Forbidden City.","zh":"很多人去北京旅游是为了看长城和故宫。"},{"en":"She moved to Beijing for work after graduation.","zh":"她毕业后为了工作搬到了北京。"}]}],"synonyms":["Peking (older spelling)"],"phonetic":"/ˌbeɪˈdʒɪŋ/","extraExplanation":["“Beijing”常见发音为 /ˌbeɪˈdʒɪŋ/（英语里重音在第二音节）。中文“北京”字面意思是“北方的首都”。","历史上北京也曾使用过其他英文写法，如“Peking”（较旧的拼写，常见于“Peking duck/北京烤鸭”等固定表达中）。"]}
{"word":"Beijinger","summary":{"en":"A Beijinger is someone from Beijing; it can also describe things related to Beijing or its people.","zh":"Beijinger 指北京人，也可作形容词表示“北京的/北京人的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Beijing, especially someone who was born or raised there","zh":"北京人；（尤指出生或成长于北京的）北京市民"},"examples":[{"en":"She’s a Beijinger who knows all the best noodle shops.","zh":"她是北京人，知道最好吃的面馆在哪里。"},{"en":"Many Beijingers commute to work by subway.","zh":"很多北京人坐地铁通勤。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Beijing or to people from Beijing","zh":"北京的；北京人的"},"examples":[{"en":"He speaks with a strong Beijinger accent.","zh":"他说话带着很重的北京口音。"},{"en":"We tried Beijinger-style breakfast: soy milk and fried dough sticks.","zh":"我们尝了北京风格的早餐：豆浆和油条。"}]}],"synonyms":["Beijing resident","Beijing native","(informal) Beijing local"],"phonetic":"/ˈbeɪˌdʒɪŋər/","extraExplanation":["“Beijinger”是常见的英语说法，比“Pekingese”更自然；“Pekingese”在英语里更常指“京巴犬”（一种北京犬）。","英文里也会说“a Beijing native”（北京土生土长的人）或“a resident of Beijing”（北京居民）。","“Beijinger”来自城市名“Beijing”加后缀“-er”（表示“某地的人”，如 New Yorker）。"]}
{"word":"beild","summary":{"en":"Build means to construct something or develop something gradually; as a noun, it means body type.","zh":"Build 表示“建造/搭建”或“逐步建立/增强”；作名词时表示“体格/体型”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make something by putting parts together; to construct","zh":"建造；搭建；组装"},"examples":[{"en":"They built a house near the river.","zh":"他们在河边建了一栋房子。"},{"en":"We’re building a model airplane.","zh":"我们在组装一架飞机模型。"}]},{"partOfSpeech":"v.","definition":{"en":"to develop or increase something gradually (skills, trust, strength, etc.)","zh":"逐步建立；培养；增强（技能、信任、力量等）"},"examples":[{"en":"She built confidence by practicing every day.","zh":"她通过每天练习建立了自信。"},{"en":"Good teams build trust over time.","zh":"好的团队会随着时间建立信任。"}]},{"partOfSpeech":"n.","definition":{"en":"the shape and strength of a person’s body; body type","zh":"体格；体型"},"examples":[{"en":"He has a strong build.","zh":"他体格健壮。"},{"en":"People of different builds may need different bike sizes.","zh":"不同体型的人可能需要不同尺寸的自行车。"}]}],"synonyms":["construct","make","create","develop","form"],"phonetic":"/bɪld/","extraExplanation":["你输入的“beild”很可能是拼写错误，常见目标词是“build”。如果你其实想查别的词（例如德语里的拼写），告诉我上下文句子，我可以更准确判断。"]}
{"word":"Beilul","summary":{"en":"Beilul is a small port town in southern Eritrea on the Red Sea.","zh":"Beilul（贝卢尔）是厄立特里亚南部红海沿岸的一座小港口城镇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small coastal town and port in southern Eritrea, on the Red Sea (near the Bab el-Mandeb strait)","zh":"贝卢尔：厄立特里亚南部红海沿岸的一座小城镇与港口（靠近曼德海峡）"},"examples":[{"en":"The research team landed in Beilul before traveling inland.","zh":"研究团队先在贝卢尔登陆，然后再向内陆出发。"},{"en":"Beilul is a remote port on the Red Sea coast of Eritrea.","zh":"贝卢尔是厄立特里亚红海沿岸一座偏远的港口。"}]}],"phonetic":"/beɪˈluːl/","extraExplanation":["“Beilul”多作为地名使用，日常英语里并不常见；在阅读新闻、地理或航运相关材料时更可能遇到。","由于是专有名词，不同资料可能出现拼写或转写差异；如果你是在某篇文章里看到它，给我上下文句子，我可以帮你确认指的是不是这个地点。"]}
{"word":"Bein","summary":{"en":"“Bein’/bein” is a casual, nonstandard spelling of “being,” used to show spoken style.","zh":"“Bein’/bein”是“being”的口语化、非标准拼写，用来表现口语说话的感觉。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal, nonstandard spelling) “being” (often used to show spoken pronunciation, especially with the final -g dropped: “bein’”).","zh":"（非正式、非标准拼写）“being（正在……/作为……）”，常用来表示口语里把词尾 -g 省略的发音（写作“bein’”）。"},"examples":[{"en":"I’m just bein’ honest with you.","zh":"我只是跟你说实话。"},{"en":"She was bein’ careful not to wake the baby.","zh":"她小心翼翼地不把宝宝吵醒。"},{"en":"Stop bein’ so hard on yourself.","zh":"别对自己这么苛刻。"}]}],"synonyms":["being"],"phonetic":"/ˈbiːɪn/","extraExplanation":["“bein / bein’”常见于歌词、小说对白、短信或社交媒体，用来营造口语感；在正式写作中应写作“being”。","另外，在苏格兰英语（Scots）里，bein 也可以作形容词，表示“舒适的、过得不错的/殷实的”，但在现代通用美式英语中很少见。"]}
{"word":"bein","summary":{"en":"“bein” is usually an informal spelling of “being” (often written “bein’”), meaning existence or a living creature, or the -ing form of “be.”","zh":"“bein”通常是“being”的非正式拼写（常写作“bein’”），可指“存在/生命体”，也可指“be”的-ing形式。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal spelling) “being,” especially in casual speech or writing, where the final “-g” is dropped (bein’).","zh":"（非正式拼写）“being”的口语/随意写法，常把词尾“-g”省略写成“bein’”。"},"examples":[{"en":"I’ve been bein’ careful lately.","zh":"我最近一直很小心。"},{"en":"Stop bein’ so hard on yourself.","zh":"别对自己这么苛刻。"}]},{"partOfSpeech":"n.","definition":{"en":"the state of existing; the fact of being alive or real.","zh":"存在（的状态）；真实或活着这一事实。"},"examples":[{"en":"She questioned the meaning of being.","zh":"她思考“存在”的意义。"},{"en":"Being honest matters more than being popular.","zh":"诚实比受欢迎更重要。"}]},{"partOfSpeech":"n.","definition":{"en":"a living creature; a person or animal (often used with an adjective).","zh":"生物；生命体；（常指人或动物，常与形容词搭配）。"},"examples":[{"en":"Humans are social beings.","zh":"人类是群居的生物。"},{"en":"Every living being needs water.","zh":"每个生命都需要水。"}]},{"partOfSpeech":"other","definition":{"en":"the present participle of “be,” used to form continuous tenses and descriptions.","zh":"“be”的现在分词，用于进行时和描述状态。"},"examples":[{"en":"She is being polite.","zh":"她（此刻）表现得很有礼貌。"},{"en":"Being late once is okay, but not every day.","zh":"迟到一次可以，但不能天天迟到。"}]}],"synonyms":["being","existence","creature","living thing"],"phonetic":"/ˈbiːɪn/","extraExplanation":["“bein”本身不是标准拼写：最常见的情况是把“being”写错，或用来模仿口语把词尾“-ing”读成“-in’”（如“goin’/doin’/bein’”），常见于对话、歌词、小说人物口吻中。正式写作建议用标准拼写“being”。"]}
{"word":"Being","summary":{"en":"Being can mean a person/living creature or the state of existing; it also functions as the -ing form of “be” in grammar.","zh":"Being 可指“人/生物”或“存在”；在语法中也可作 be 的 -ing 形式，用于进行时或作动名词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a living thing; a person or animal (often used as “human being”).","zh":"生物；（尤指）人（常用作 human being “人类/人”）。"},"examples":[{"en":"Human beings need sleep and clean water.","zh":"人类需要睡眠和干净的水。"},{"en":"The shelter helps injured animals and other living beings.","zh":"收容所帮助受伤的动物和其他生物。"}]},{"partOfSpeech":"n.","definition":{"en":"the fact or state of existing; existence (often used in philosophy).","zh":"存在；存在的状态（常见于哲学语境）。"},"examples":[{"en":"The novel reflects on love, time, and the meaning of being.","zh":"这部小说思考爱情、时间与“存在”的意义。"},{"en":"Questions about being have shaped Western philosophy for centuries.","zh":"关于“存在”的问题数百年来影响着西方哲学。"}]},{"partOfSpeech":"other","definition":{"en":"a form of “be” used to make continuous (progressive) tenses.","zh":"be 的现在分词，用于构成进行时。"},"examples":[{"en":"She is being very patient today.","zh":"她今天表现得很有耐心。"},{"en":"They are being interviewed right now.","zh":"他们正在接受采访。"}]},{"partOfSpeech":"n.","definition":{"en":"used after prepositions as a gerund meaning “to exist” or “to be in a certain role/state.”","zh":"作动名词（常在介词后），表示“存在”或“处于某种身份/状态”。"},"examples":[{"en":"I’m proud of being your friend.","zh":"我为能成为你的朋友而自豪。"},{"en":"He left without being seen.","zh":"他悄悄离开，没有被人看见。"}]}],"synonyms":["creature","person","individual","existence","entity"],"phonetic":"/ˈbiːɪŋ/","extraExplanation":["“being”作名词时很常见的搭配是：human being（人类/人）、living being（生物）。\n\n“is being + 形容词”通常强调“此刻的表现/暂时的状态”，例如：He is being rude.（他现在很无礼/态度很差。）这和较稳定的描述 He is rude.（他这个人就很无礼。）语气不同。"]}
{"word":"being","summary":{"en":"“Being” can mean a living creature, a person’s inner nature, the state of existence, or the -ing form of “be” used in continuous and passive-progressive structures.","zh":"“Being”既可表示生物/个体、人的本性或内在、以及“存在”，也可作“be”的现在分词，用于进行时或被动进行时结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A living creature; a person or animal (often used in a general or formal way).","zh":"生物；有生命的个体（人或动物，常用于较正式或概括的说法）。"},"examples":[{"en":"Human beings need sleep to stay healthy.","zh":"人类需要睡眠来保持健康。"},{"en":"Every living being deserves respect.","zh":"每一个生命都值得尊重。"}]},{"partOfSpeech":"n.","definition":{"en":"A person’s nature or inner self; who someone truly is.","zh":"本性；内在的自我；一个人真正的样子。"},"examples":[{"en":"Kindness is part of her being.","zh":"善良是她性格的一部分。"},{"en":"He felt peace deep within his being.","zh":"他在内心深处感到平静。"}]},{"partOfSpeech":"n.","definition":{"en":"The state of existing; existence (often in formal writing).","zh":"存在；生存状态（常见于较正式的写作）。"},"examples":[{"en":"We can’t prove the being of life on other planets yet.","zh":"我们还无法证明其他星球上生命的存在。"}]},{"partOfSpeech":"v.","definition":{"en":"The present participle of “be,” used to form continuous tenses and passive meanings with “being.”","zh":"“be”的现在分词，用于构成进行时，或在被动语态中用“being”表示动作正在发生。"},"examples":[{"en":"She is being very careful with the glass.","zh":"她正非常小心地拿着玻璃。"},{"en":"The bridge is being repaired this week.","zh":"这座桥本周正在维修。"},{"en":"Stop being rude.","zh":"别再这么没礼貌了。"}]}],"synonyms":["creature","living thing","existence","essence","entity"],"phonetic":"/ˈbiː.ɪŋ/","extraExplanation":["“being”作名词时常出现在更抽象或书面语的表达里，例如“human beings（人类）”“a sense of being（存在感）”。日常口语里更常直接说“person/people”“life/existence”。","在语法上，“being”常见于两种结构：①进行时：be + being（如 is being careful，强调当下行为或暂时状态）；②被动进行时：be + being + 过去分词（如 is being repaired，表示‘正在被……’）。"]}
{"word":"being-related","summary":{"en":"“Being-related” means connected with existence or the state of being.","zh":"“Being-related”指与“存在/成为（being）”或“存在层面的问题与体验”相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with existence or what it means to “be” (often used in philosophy, psychology, or spiritual writing).","zh":"与“存在/成为（being）”有关的；与“什么叫做存在”相关的（常见于哲学、心理学或灵性写作）。"},"examples":[{"en":"The book explores being-related questions like “Who am I?” and “What is my purpose?”","zh":"这本书探讨与存在有关的问题，比如“我是谁？”和“我的目的是什么？”"},{"en":"In therapy, people may discuss being-related needs such as feeling safe, seen, and valued.","zh":"在心理咨询中，人们可能会讨论与“存在感”相关的需求，比如感到安全、被看见、被重视。"}]}],"synonyms":["existential","ontological","related to being","existence-related"],"phonetic":"/ˈbiːɪŋ rɪˌleɪtɪd/","extraExplanation":["“being-related”不是非常固定的日常词汇，更像是作者临时造的复合形容词，用来表达“与存在（being）相关”。在学术写作里也可能用更常见的说法：existential（存在主义/存在层面的）、ontological（本体论的）、related to being（与存在有关）。","在哲学语境中，being 常与“存在、本体、现实的根基”相关；在心理学/自我成长语境中，being 常更偏“当下的状态、存在感、活着的体验”，与 doing（做事、行动）形成对比。"]}
{"word":"beingless","summary":{"en":"Beingless means lacking existence, life, or a sense of real presence (rare; often philosophical/poetic).","zh":"beingless 指缺乏存在、生命或存在感（较少见，多见于哲学或诗性表达）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Lacking existence, life, or a sense of “being”; empty of real presence (rare, often philosophical or poetic).","zh":"缺乏存在、生命或“存在感”；没有真实在场感（较少见，多用于哲学或诗性表达）。"},"examples":[{"en":"After the old shop closed, the street felt beingless and quiet.","zh":"老店关门后，这条街显得空荡、没有生气。"},{"en":"In the novel, the city is described as beingless, as if no one truly lives there.","zh":"小说里这座城市被写成“无存在感”的样子，仿佛没有人真正生活在其中。"}]},{"partOfSpeech":"adj.","definition":{"en":"Without a particular kind of being or identity; not having a defined self (rare).","zh":"没有某种特定的存在形态或身份；缺乏明确的自我（较少见）。"},"examples":[{"en":"He feared a beingless future where his work had no meaning.","zh":"他害怕一个“失去自我与意义”的未来。"}]}],"synonyms":["lifeless","empty","hollow","nonexistent","void"],"phonetic":"/ˈbiːɪŋləs/","extraExplanation":["“beingless”不是常见词，更常见的表达是“lifeless（死气沉沉的）”“empty（空的）”“hollow（空洞的）”“nonexistent（不存在的）”。写作中有时也会写作“being-less”，强调“缺乏存在/存在感”的概念。","在哲学语境里，being（存在）常与identity（身份/自我）或presence（在场）相关；因此 beingless 往往带有抽象、沉郁或诗意的色彩，而不是日常口语。"]}
{"word":"beingness","summary":{"en":"Beingness means the state of existing or a felt sense of presence/self, often in philosophical or spiritual contexts.","zh":"Beingness 指“存在”的状态或一种自我/临在感，常用于哲学或灵性语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of existing; the fact of “being” (often used in philosophy or spiritual writing)","zh":"存在的状态或性质；“作为存在者”的事实（常见于哲学或灵性语境）"},"examples":[{"en":"In meditation, she focused on simple beingness rather than achievements.","zh":"在冥想中，她关注的是单纯的存在感，而不是成就。"},{"en":"Some philosophers discuss beingness to ask what it means for anything to exist.","zh":"一些哲学家用“beingness”来探讨万物存在意味着什么。"}]},{"partOfSpeech":"n.","definition":{"en":"a person’s sense of self or presence—feeling that you are “here,” real, and alive","zh":"自我与临在感；感到“我在这里”、真实且活着的感觉"},"examples":[{"en":"After the accident, he slowly regained his beingness and confidence.","zh":"事故后，他慢慢找回了自我存在感和信心。"},{"en":"The quiet room helped her return to a calm beingness.","zh":"安静的房间让她回到一种平和的临在状态。"}]}],"synonyms":["existence","being","presence","selfhood","sense of self"],"phonetic":"/ˈbiɪŋnəs/","extraExplanation":["“beingness”不是日常高频词，更常见的说法是“existence（存在）”“being（存在/本体）”“sense of self（自我感）”。它带有更抽象、偏思想或修行的语气，用来强调“纯粹地存在/临在”，而非做事或获得结果。","在哲学中，它常与“being（存在）”的讨论相关（例如本体论：研究“存在是什么”）。在某些灵性或冥想文本里，它也常被用来指“当下的临在状态”。"]}
{"word":"beings","summary":{"en":"\"Beings\" means living creatures (plural of \"being\"), often used for humans, animals, or fictional/unknown creatures.","zh":"“beings”指“生物、有生命的存在”，是“being”的复数，常用于人类、动物或虚构/未知的生物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Living creatures (people, animals, or imaginary creatures); the plural of \"being.\"","zh":"生物；有生命的存在（人、动物或想象中的生物）。“being”的复数。"},"examples":[{"en":"Human beings need food, water, and sleep.","zh":"人类需要食物、水和睡眠。"},{"en":"Some stories describe strange beings from another world.","zh":"有些故事描写来自另一个世界的奇异生物。"},{"en":"Many living beings depend on the forest to survive.","zh":"许多生物依赖森林生存。"}]}],"synonyms":["creatures","living things","organisms","entities"],"phonetic":"/ˈbiːɪŋz/","extraExplanation":["“beings”最常见的用法是指“生物/存在物”（可数名词复数）。如果你想表达“存在、实在”这种抽象概念，英语更常用单数“being”（不可数或抽象用法），例如：the nature of being（存在的本质）。","固定搭配很常见：human beings（人类）、living beings（生物）、sentient beings（有感知能力的生命/众生，较书面或宗教语境）。在科幻或奇幻中，“beings”常指外星生物、神灵或未知存在。"]}
{"word":"beinked","summary":{"en":"“Be inked” is slang meaning “to have tattoos” or “to get tattooed.”","zh":"“be inked”是俚语，意思是“有纹身”或“去纹身/被纹身”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Slang) to have tattoos, or to get tattooed.","zh":"（俚语）有纹身；去纹身（被纹上墨）。"},"examples":[{"en":"He’s been inked since college—he has a sleeve on his left arm.","zh":"他从大学起就开始纹身——左臂有一整片“袖套”纹身。"},{"en":"She wants to be inked with a small lotus flower on her wrist.","zh":"她想在手腕上纹一个小莲花。"},{"en":"In that movie, the main character is heavily inked.","zh":"那部电影里，主角身上有很多纹身。"}]}],"synonyms":["tattooed","have a tattoo","get a tattoo","get inked"],"phonetic":"/bi ɪŋkt/","extraExplanation":["“ink”本义是“墨水”，口语里把“纹身”比喻成“上墨”。所以“get inked / be inked”在欧美文化中很常见，语气偏随意、带一点潮流或街头感。正式场合更常说“have a tattoo / get a tattoo”。","你输入的“beinked”更像是把短语“be inked”连写了；实际书写通常分开写：be inked。"]}
{"word":"beinly","summary":{"en":"“Benignly” means “in a kind/gentle way,” and in medical contexts, “in a harmless (benign) way.”","zh":"“benignly”表示“温和友善地”；在医学语境中表示“以良性/无害的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a kind, gentle, or friendly way; showing no harm or anger.","zh":"以和善、温和、友好的方式；不带恶意或怒气。"},"examples":[{"en":"She smiled benignly at the nervous child.","zh":"她温和地对那个紧张的孩子微笑。"},{"en":"He listened benignly, letting everyone finish speaking.","zh":"他和善地倾听，让每个人都把话说完。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Medical) In a harmless or non-dangerous way; not cancerous or serious.","zh":"（医学）以无害的方式；良性的（非癌性的/不严重的）。"},"examples":[{"en":"The tumor appeared to be growing benignly, without spreading.","zh":"肿瘤看起来是良性生长，没有扩散。"},{"en":"The doctor explained that the condition was behaving benignly.","zh":"医生解释说这种情况表现为良性。"}]}],"synonyms":["kindly","gently","warmly","amiably","harmlessly"],"phonetic":"/bəˈnaɪnli/","extraExplanation":["你输入的“beinly”在英语里不常见，最可能是把 **benignly** 拼错了（少写了“g”并且字母顺序有误）。","**benignly** 来自形容词 **benign**（和善的；良性的）。日常语境多指“态度温和”；医疗语境常指“良性、不危险”。"]}
{"word":"beinness","summary":{"en":"“Beinness” is not standard; it is usually a misspelling of “business,” meaning commerce, a company, or someone’s affairs.","zh":"“beinness”不是标准拼写，通常是“business”的拼写错误，可表示商业活动、公司/企业或某人的事情/事务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity of buying, selling, or providing goods and services to make money; commerce","zh":"商业活动；做买卖；经商"},"examples":[{"en":"Her family is in the restaurant business.","zh":"她家做餐饮生意。"},{"en":"Online business has grown quickly in recent years.","zh":"近年来线上商业发展很快。"}]},{"partOfSpeech":"n.","definition":{"en":"a company or organization that sells goods or services","zh":"公司；企业；商号"},"examples":[{"en":"He started a small business with a friend.","zh":"他和朋友合伙开了一家小公司。"},{"en":"Local businesses are closing because rent is too high.","zh":"因为租金太高，本地企业正在关门。"}]},{"partOfSpeech":"n.","definition":{"en":"a particular matter, responsibility, or task that concerns someone","zh":"事情；职责；该做的事"},"examples":[{"en":"It’s none of your business.","zh":"这不关你的事。"},{"en":"I have some business to take care of this afternoon.","zh":"我今天下午有些事情要处理。"}]}],"synonyms":["company","firm","commerce","trade","enterprise","affair","matter"],"phonetic":"/ˈbɪznəs/","extraExplanation":["“beinness”不是标准拼写，通常是把“business”拼错了。正确拼写是 business（发音里常把中间的 /i/ 弱化，所以听起来有点像“biz-ness”，容易写错）。"]}
{"word":"Beira","summary":{"en":"Beira most commonly refers to a port city in Mozambique; in Portuguese it can also mean “edge/border” or “shore/riverbank.”","zh":"Beira最常见指莫桑比克的港口城市“贝拉”；在葡萄牙语中也可作名词，表示“边缘/边界”或“岸边/河岸”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a port city in central Mozambique, on the Indian Ocean; an important regional center for trade and transport.","zh":"（莫桑比克）贝拉：位于莫桑比克中部、临印度洋的港口城市；是重要的区域贸易与交通中心。"},"examples":[{"en":"Beira is one of Mozambique’s major ports on the Indian Ocean.","zh":"贝拉是莫桑比克在印度洋沿岸的主要港口之一。"},{"en":"After the storm, aid supplies were delivered through Beira.","zh":"风暴过后，救援物资通过贝拉运送进入。"}]},{"partOfSpeech":"n.","definition":{"en":"(from Portuguese) the edge, rim, or border of something; the shore or riverbank.","zh":"（源自葡萄牙语）边缘、边；（海/河的）岸边、河岸。"},"examples":[{"en":"They sat on the beira of the river and watched the water.","zh":"他们坐在河岸边，看着水流。"},{"en":"Keep the paint on the beira of the frame, not on the glass.","zh":"把油漆涂在画框边缘，不要涂到玻璃上。"}]}],"synonyms":["edge","border","rim","shore","riverbank"],"phonetic":"/ˈbeɪrə/","extraExplanation":["“Beira”在英语里通常指莫桑比克的城市名；在葡语语境中则是常见名词，表示“边、岸”。如果你在地图、新闻（例如港口、气旋、救灾）里看到Beira，几乎都是指这座城市。","城市Beira常被读作英语化发音 /ˈbeɪrə/；而葡语“beira”的发音会有所不同（不同口音也会不同）。"]}
{"word":"beira","summary":{"en":"“Beira” most commonly refers to a port city in Mozambique; in Portuguese it also means “edge/brink.”","zh":"“Beira”最常见是莫桑比克的港口城市“贝拉”；在葡萄牙语中也可表示“边缘/岸边/边际”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a port city in central Mozambique, on the Indian Ocean (a proper noun).","zh":"（专有名词）莫桑比克中部的港口城市“贝拉”，位于印度洋沿岸。"},"examples":[{"en":"Beira is an important port for goods coming to and from Mozambique.","zh":"贝拉是莫桑比克重要的港口，许多货物经由这里进出。"},{"en":"After the cyclone, Beira needed major rebuilding.","zh":"飓风过后，贝拉需要大规模重建。"}]},{"partOfSpeech":"n.","definition":{"en":"(Portuguese) an edge, rim, or brink; the outer boundary of something.","zh":"（葡萄牙语）边缘、边界；（尤指）边沿、岸边、边际。"},"examples":[{"en":"He sat on the beira of the river and watched the water.","zh":"他坐在河边（beira）看着水流。"},{"en":"They live on the beira of town, not in the center.","zh":"他们住在城镇边缘（beira），不在市中心。"}]}],"synonyms":["edge","brink","rim","border","shore"],"phonetic":"/ˈbeɪrə/","extraExplanation":["“Beira”作为地名最常指莫桑比克的贝拉市；在英语材料里通常保留原拼写并按地名使用。","在葡萄牙语里，beira 常见于固定搭配：beira-mar（海边/海滨）、beira-rio（河边）、à beira de（在……边上；也可引申为“濒临/几乎要发生”）。"]}
{"word":"Beirne","summary":{"en":"Beirne is mainly used as an Irish-origin surname (a family name).","zh":"Beirne 主要用作源自爱尔兰的姓氏（家族姓）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A surname (family name), most commonly of Irish origin; it may also appear as a place name in some contexts.","zh":"一个姓氏（家族姓），多见于爱尔兰来源；在某些语境中也可能作为地名出现。"},"examples":[{"en":"Dr. Beirne will present the research results tomorrow.","zh":"Beirne 博士明天将展示研究结果。"},{"en":"I met a writer named Beirne at the book festival.","zh":"我在书展上认识了一位姓 Beirne 的作家。"}]}],"synonyms":["Byrne (variant spelling)","O’Byrne (related family name)"],"phonetic":"/ˈbɝːn/","extraExplanation":["Beirne 通常被视为爱尔兰姓氏的英译写法之一，和 O’Byrne / Byrne 等姓在拼写与来源上可能有关联（不同家族、地区会出现不同拼写变体）。实际发音会因家庭与地区而异；如果是某个具体人物的名字，最好以本人或官方读音为准。"]}
{"word":"Beirut","summary":{"en":"Beirut is the capital and largest city of Lebanon.","zh":"贝鲁特是黎巴嫩的首都和最大城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The capital and largest city of Lebanon, on the Mediterranean coast; an important cultural, financial, and historical center in the Middle East.","zh":"贝鲁特：黎巴嫩的首都和最大城市，位于地中海沿岸；是中东重要的文化、金融与历史中心。"},"examples":[{"en":"Beirut is the capital city of Lebanon.","zh":"贝鲁特是黎巴嫩的首都。"},{"en":"She studied architecture in Beirut.","zh":"她在贝鲁特学习建筑。"},{"en":"News from Beirut often reflects the region’s complex history.","zh":"来自贝鲁特的新闻常常反映该地区复杂的历史。"}]}],"synonyms":["Beyrouth (French spelling)"],"phonetic":"/beɪˈruːt/","extraExplanation":["“Beirut”在英语中通常作为专有名词使用，首字母必须大写。","贝鲁特常被称为“中东的巴黎”（the Paris of the Middle East），这是20世纪中期对其文化生活与国际化氛围的一种称呼；这一说法带有时代背景，并不等同于今天对城市的全面描述。","词源上，Beirut来自古代地名（腓尼基/古希伯来语等语源体系）中与“井、水源”相关的词根，因此有“多水井之地”的含义。"]}
{"word":"beisa","summary":{"en":"“Beisa” usually refers to the beisa oryx, an East African antelope.","zh":"“Beisa”通常指东非剑羚（beisa oryx），一种东非的羚羊。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A type of East African antelope: the beisa oryx, known for its long, straight horns and pale coat.","zh":"（专有名词）一种东非羚羊：东非剑羚（beisa oryx），以又长又直的角和浅色皮毛著称。"},"examples":[{"en":"We saw a beisa oryx grazing on the dry grassland in northern Kenya.","zh":"我们在肯尼亚北部的干燥草原上看到一只东非剑羚在吃草。"},{"en":"The beisa’s long horns help it defend itself from predators.","zh":"东非剑羚的长角有助于它抵御捕食者。"}]}],"synonyms":["beisa oryx","oryx"],"phonetic":"ˈbaɪsə","extraExplanation":["“Beisa”在英语里通常出现在动物名称“beisa oryx”（东非剑羚）中，单独使用时比较少见，多用于自然纪录片、动物学或野生动物旅行的语境。","如果你本来想查的是别的词（例如拼写接近的“BESA”“visa”“bias”等），可以告诉我上下文或你想表达的句子，我可以帮你确认正确拼写和含义。"]}
{"word":"beisance","summary":{"en":"Obeisance means a formal bow or act of paying respect, often in a ceremonial or old-fashioned context.","zh":"obeisance 指正式的鞠躬／致敬礼，常用于带仪式感或较古雅的场合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a respectful bow, curtsy, or other formal gesture showing respect; also, the act of paying respect (often in a ceremonial or old-fashioned way)","zh":"鞠躬／屈膝礼等表示敬意的正式礼节；也指（常带仪式感或较古雅的）致敬行为"},"examples":[{"en":"The visitors made a deep obeisance to the king.","zh":"来访者向国王深深鞠躬致敬。"},{"en":"She offered her obeisance at the memorial before speaking.","zh":"她在纪念碑前先致意致敬，然后才开口讲话。"}]}],"synonyms":["bow","deference","homage","respect"],"phonetic":"/oʊˈbeɪsəns/","extraExplanation":["“obeisance”语体偏正式、略带古典色彩，常用于宫廷、宗教、礼仪或文学描写中。日常口语里更常用“bow”“pay respects”。","词源上与“obey（服从）”同源，都与“顺从、尊敬”的观念有关；因此它有时会带一点“对权威表示臣服”的感觉，具体取决于语境。"]}
{"word":"Beisel","summary":{"en":"Beisel is mainly used as a surname (a proper family name).","zh":"Beisel 主要用作姓氏（专有的家族姓）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), most often found in German-speaking communities and among people of German heritage.","zh":"一个姓氏（家族姓），常见于德语地区及德裔人群中。"},"examples":[{"en":"Mr. Beisel will lead the meeting today.","zh":"Beisel 先生今天将主持会议。"},{"en":"Her last name is Beisel, and her grandparents came from Germany.","zh":"她姓 Beisel，她的祖父母来自德国。"}]},{"partOfSpeech":"n.","definition":{"en":"a name used for a person, business, or organization (a proper name), depending on context.","zh":"根据语境可作为人名、企业名或机构名使用的专有名称。"},"examples":[{"en":"You can email Beisel for more information.","zh":"你可以发邮件联系 Beisel 获取更多信息。"},{"en":"Beisel is listed as the author of the report.","zh":"报告的作者署名为 Beisel。"}]}],"synonyms":["(no direct synonyms—proper names usually don’t have synonyms)"],"phonetic":"/ˈbaɪzəl/","extraExplanation":["“Beisel”通常被视为德语姓氏（专有名词）。在英语里作为姓氏使用时一般不翻译，只需按原拼写与读音使用。","英语书写中，姓氏要首字母大写（Beisel）。在正式场合可用 Mr./Ms./Dr. + Beisel 来称呼。"]}
{"word":"Beitch","summary":{"en":"“Bitch” most literally means a female dog, but it is also a strongly offensive insult for a woman; as a verb, it can mean to complain a lot.","zh":"“bitch”字面义是“母狗”，但也常作对女性的强烈侮辱性脏话；作动词时可表示“不停抱怨/吐槽”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female dog (especially one used for breeding)","zh":"母狗；（尤指）用来繁殖的母犬"},"examples":[{"en":"The breeder has two bitches and one male dog.","zh":"这位繁育者有两只母犬和一只公犬。"},{"en":"Our neighbor’s bitch had puppies last week.","zh":"我们邻居家的母犬上周生了小狗。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang, offensive) a very rude word for a woman, used as an insult","zh":"（俚语，冒犯）对女性的粗俗侮辱性称呼"},"examples":[{"en":"He used an offensive slur at her during the argument.","zh":"他在争吵中对她使用了侮辱性的脏话。"},{"en":"That kind of language is unacceptable at work.","zh":"那种言语在工作场合是不可接受的。"}]},{"partOfSpeech":"v.","definition":{"en":"(slang) to complain a lot; to criticize in an annoyed way (often used as “bitch about”)","zh":"（俚语）抱怨个没完；（常用作 bitch about）对……不停挑剔/吐槽"},"examples":[{"en":"He kept bitching about the weather.","zh":"他一直在抱怨天气。"},{"en":"Don’t bitch about it—help fix it.","zh":"别光抱怨——动手解决吧。"}]}],"synonyms":["female dog (literal)","complain (verb sense)","grumble (verb sense)"],"phonetic":"/bɪtʃ/","extraExplanation":["你输入的“Beitch”很可能是在拼写“bitch”。“bitch”作为骂人话非常粗鲁、带有性别歧视色彩，在职场、学校和正式场合应避免使用。","在少数语境里，它可能被部分人“自我挪用”（朋友间开玩笑或强调态度，如“I’m a bad bitch”），但对学习者来说风险很高：即使你没有恶意，也很容易被理解为侮辱。更安全的替代表达：mean person（刻薄的人）、jerk（混蛋/讨厌的人，较口语）、rude（粗鲁的）、complain（抱怨）。"]}
{"word":"Beitnes","summary":{"en":"“Beitnes” is not standard English; it most likely means “bitness,” the 32-bit/64-bit property of a computer system.","zh":"“Beitnes” 不是标准英文；它很可能指 “bitness”，即电脑系统的 32 位/64 位属性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely misspelling) The number of bits used to represent a value in a computer system (for example, 32-bit or 64-bit).","zh":"（可能是拼写错误）在计算机系统中用来表示一个数值所使用的比特数（例如 32 位或 64 位）。"},"examples":[{"en":"This app only works on 64-bit systems, so check your device’s bitness.","zh":"这个应用只支持 64 位系统，所以要检查你设备的位数（bitness）。"},{"en":"The bitness of the operating system affects how much memory it can use.","zh":"操作系统的位数会影响它能使用多少内存。"}]}],"synonyms":["word size","architecture (informal context)"],"phonetic":"/ˈbɪtnəs/","extraExplanation":["“Beitnes”本身不是常见英文单词，最可能是把 **bitness** 拼错了（常见于电脑/系统设置语境）。","在 Windows 里你可能会看到 “System type: 64-bit operating system”（64 位操作系统）；这里说的就是系统的 **bitness**。常见搭配：**32-bit / 64-bit**, **system bitness**, **CPU architecture**。"]}
{"word":"Beitris","summary":{"en":"Beitris is an uncommon spelling of the female name Beatrice.","zh":"Beitris 是女性名字，通常被视为 Beatrice 的不常见拼写变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name; an uncommon spelling variant of “Beatrice,” sometimes used to reflect a particular language’s spelling or pronunciation","zh":"女性名字；“Beatrice（比阿特丽斯/比翠丝）”的不常见拼写变体，有时用来体现某种语言的拼写或读音"},"examples":[{"en":"Beitris is my grandmother’s name.","zh":"Beitris 是我祖母的名字。"},{"en":"Her name is Beitris, but some people misspell it as Beatrice.","zh":"她的名字是 Beitris，但有些人会把它写成 Beatrice。"},{"en":"Beitris introduced herself slowly so everyone could spell it correctly.","zh":"Beitris 放慢速度自我介绍，好让大家把名字拼对。"}]}],"synonyms":["Beatrice","Beatriz"],"phonetic":"/ˈbiːtrɪs/","extraExplanation":["“Beitris”在英语世界里并不算常见，更常见的形式是 Beatrice（或西语/葡语的 Beatriz）。在文学中最著名的 Beatrice 是但丁《神曲》中的“贝雅特丽齐”（Beatrice），象征引导与理想之爱。","Beatrice 这个名字常被认为来自拉丁语 Beatrix（意为“带来幸福/祝福的人”），也有人追溯到较早的 Viatrix（“旅行者/行者”）这一来源。不同地区会出现不同的拼写与读法变体。"]}
{"word":"Beitz","summary":{"en":"“Beitz” is most commonly used as a surname (last name).","zh":"“Beitz”最常见的用法是作为姓氏（英文中的 last name）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname), often of German origin","zh":"（常见为德语来源的）姓氏/家族姓"},"examples":[{"en":"Dr. Beitz will give a talk on Friday.","zh":"贝茨博士将于周五做报告。"},{"en":"I met someone named Beitz at the conference.","zh":"我在会议上认识了一个姓贝茨的人。"}]}],"synonyms":["(surname)"],"phonetic":"/baɪts/","extraExplanation":["“Beitz”通常作为姓氏使用，而不是日常英语词汇。发音多为/baɪts/（类似“bytes”）。","该姓氏常见于德语背景地区或移民社群中；不同家庭的拼写与读音也可能略有差异。"]}

