{"word":"Beja","summary":{"en":"Beja refers to an ethnic group in eastern Sudan and nearby areas, and also to their Cushitic language (Bedawiyet).","zh":"Beja 可指苏丹东部及周边地区的贝贾民族，也可指其所说的库施特语支语言（贝贾语/Bedawiyet）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a Muslim ethnic group living mainly in eastern Sudan, with communities in Eritrea and Egypt","zh":"贝贾人：主要居住在苏丹东部、并分布于厄立特里亚和埃及等地的穆斯林民族成员"},"examples":[{"en":"The Beja have a long history of living near the Red Sea hills.","zh":"贝贾人在红海沿岸的丘陵地区生活由来已久。"},{"en":"A Beja elder explained local traditions to the visitors.","zh":"一位贝贾族长者向来访者讲解当地传统。"}]},{"partOfSpeech":"n.","definition":{"en":"the Cushitic language spoken by the Beja people (also called Bedawiyet)","zh":"贝贾语：贝贾人所使用的库施特语支语言（也称 Bedawiyet）"},"examples":[{"en":"She is learning Beja to communicate with her neighbors.","zh":"她在学贝贾语，以便和邻居交流。"},{"en":"The research project recorded stories in Beja.","zh":"该研究项目录制了贝贾语的口述故事。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Beja people or their language and culture","zh":"贝贾（的）：与贝贾人、贝贾语或其文化有关的"},"examples":[{"en":"Beja communities maintain distinctive cultural practices.","zh":"贝贾社区保留着独特的文化习俗。"}]}],"synonyms":["Bedawiyet (for the language)"],"phonetic":"/ˈbeɪdʒə/","extraExplanation":["“Beja”在英语里通常既可指“贝贾人”（民族），也可指“贝贾语”（语言）。语境不同，含义会变化：谈人口与历史多指民族；谈语言学习、语料与记录多指语言。","贝贾人主要分布在苏丹东部红海沿岸一带，也有部分在厄立特里亚与埃及。贝贾语常被归入非洲亚细亚语系（Afroasiatic）的库施特语支（Cushitic）。","贝贾语也常见别称“Bedawiyet”（或拼作 Bidhaawyeet 等），在学术或语言资料中可能会看到这个名称。"]}
{"word":"beja","summary":{"en":"Beja refers to an ethnic group in the Red Sea region and to the language they speak.","zh":"Beja 指红海地区的贝贾民族，也可指他们所说的贝贾语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of people (an ethnic group) who traditionally live in parts of Sudan, Eritrea, and southeastern Egypt","zh":"贝贾人；主要分布在苏丹、厄立特里亚和埃及东南部等地的一个民族"},"examples":[{"en":"The Beja have a long history in the Red Sea region.","zh":"贝贾人在红海地区有着悠久的历史。"},{"en":"Some Beja communities still keep strong pastoral traditions.","zh":"一些贝贾人社群至今仍保留着浓厚的游牧与牧养传统。"}]},{"partOfSpeech":"n.","definition":{"en":"the language spoken by the Beja people (also called Beja/Bedawiyet)","zh":"贝贾语；贝贾人使用的语言（也常称 Bedawiyet/贝达维耶特语）"},"examples":[{"en":"She is studying Beja as part of her research on Red Sea cultures.","zh":"她正在学习贝贾语，作为研究红海文化的一部分。"}]}],"synonyms":["Beja people","Beja language","Bedawiyet (for the language)"],"phonetic":"/ˈbeɪdʒə/","extraExplanation":["“Beja”在英语里多写作大写（Beja），因为它通常指民族或语言名称。","贝贾人常与红海沿岸的历史贸易、游牧生活方式联系在一起；在不同资料中，语言名也可能写作“Bedawiyet/Beḍawye(t)”等变体。"]}
{"word":"bejabbers","summary":{"en":"“Bejabbers” is an old-fashioned exclamation used to show surprise or emphasis, often with an Irish-English flavor.","zh":"“Bejabbers”是较老派的感叹语，用来表示惊讶或强调，常带有爱尔兰英语的风格。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(old-fashioned, informal) An exclamation of surprise, annoyance, or emphasis; a mild oath similar to “good heavens!”","zh":"（过时、非正式）表示惊讶、恼火或强调的感叹语；一种较温和的“咒骂/誓语”，相当于“天哪！”"},"examples":[{"en":"Bejabbers! I didn’t expect to see you here.","zh":"Bejabbers！我没想到会在这儿见到你。"},{"en":"Bejabbers, that’s a lot of money for a small sandwich.","zh":"Bejabbers，这么小一个三明治竟然这么贵。"}]}],"synonyms":["good heavens","goodness gracious","blimey","by golly","jeez"],"phonetic":"/bəˈdʒæbərz/","extraExplanation":["这个词常被认为带有爱尔兰英语（Irish English）的风格色彩，来自“by jabbers / bejabbers”一类的委婉说法，用来避免直接说带宗教色彩的誓词（常被解释为对“by Jesus”等的委婉替代）。因此它听起来更像一种夸张、滑稽或复古的感叹。","在现代日常口语里并不常见，更可能出现在文学作品、历史题材对白、或刻意模仿“老派/爱尔兰口吻”的语境中。"]}
{"word":"bejabers","summary":{"en":"An old-fashioned Irish-English exclamation used as a mild swear word to express surprise or emphasis.","zh":"一种较老派的爱尔兰英语感叹词，作为温和的“发誓/感叹”用语来表达惊讶或强调。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(Irish English, old-fashioned) Used as a mild oath to show surprise, emphasis, or annoyance.","zh":"（爱尔兰英语，较老派）用作温和的感叹/誓词，表示惊讶、强调或不满。"},"examples":[{"en":"Bejabers! I didn’t expect to see you here.","zh":"哎呀（Bejabers）！我没想到会在这儿见到你。"},{"en":"Bejabers, that’s a big dog.","zh":"哎呀，那只狗真大。"}]}],"synonyms":["by japers","begorra","jeez","goodness"],"phonetic":"/bəˈdʒeɪbɚz/","extraExplanation":["这是带有爱尔兰口音/方言色彩的老式感叹词，常见于描写爱尔兰人物的文学或影视对白中。现代日常英语里并不常用，更多是为了营造“爱尔兰味”的语气。","它通常被认为是对宗教誓词的委婉说法（类似把更强烈的誓词“软化”），用来避免直接说出冒犯性的表达。"]}
{"word":"bejade","summary":{"en":"Bejade is a rare, literary verb meaning “to make weary or jaded.”","zh":"Bejade 是一个罕用的文学性动词，意思是“使疲倦或厌倦”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Literary/rare) to make someone tired, bored, or less interested; to weary or “jade.”","zh":"（文学/罕用）使人疲倦、厌倦或失去兴趣；使厌倦（= jade）。"},"examples":[{"en":"Years of the same routine had bejaded him, and he longed for a change.","zh":"多年一成不变的生活让他变得厌倦，他渴望改变。"},{"en":"She feared city life would bejade her sense of wonder.","zh":"她担心城市生活会让她对世界的好奇心变得麻木。"}]}],"synonyms":["jade","weary","tire","bore","ennui (noun)"],"phonetic":"/biˈdʒeɪd/","extraExplanation":["“bejade”属于较古旧/文学性的用法，现代英语更常用的表达是：jade, tire, weary, bore, jaded（形容词）。","词首 be- 在一些较老的英语词里有“使成为……、使发生……”的意思（如 befriend 使成为朋友、bewilder 使困惑）。因此 bejade ≈ “使变得 jaded/厌倦”。"]}
{"word":"bejan","summary":{"en":"Bejan is a Persian male given name (often spelled Bijan).","zh":"Bejan 是波斯语男性名字（常见拼写为 Bijan）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A Persian (Iranian) masculine given name, also spelled Bijan; used as a personal name.","zh":"波斯语（伊朗）男性名字，也常拼作 Bijan；用作人名。"},"examples":[{"en":"Bejan is a common Persian name, sometimes written as Bijan.","zh":"Bejan 是一个常见的波斯语名字，有时也写作 Bijan。"},{"en":"I met Bejan at a conference in Tehran.","zh":"我在德黑兰的一场会议上认识了 Bejan。"}]}],"synonyms":["Bijan"],"phonetic":"/beɪˈʒɑn/","extraExplanation":["Bejan / Bijan（常见转写：Bijan）在波斯文化中较有名，尤其因为史诗《列王纪》（Shahnameh）里有英雄人物“比詹（Bijan）”，与“玛尼杰（Manijeh）”的故事很著名。","由于是外来名字，不同人会用不同拼写（Bejan, Bijan 等），发音也可能因地区与个人习惯略有差异。"]}
{"word":"bejant","summary":{"en":"A bejant is a (historical, mostly Scottish/UK) word for a first-year student or newcomer.","zh":"bejant 指（多见于旧时苏格兰/英国语境的）大学新生或初来乍到的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a first-year university student; a newcomer (especially in older Scottish/UK university use)","zh":"（尤指旧时苏格兰/英国大学用语）一年级新生；新来者、菜鸟"},"examples":[{"en":"As a bejant, she felt lost during the first week of lectures.","zh":"作为一名新生，她在第一周的课上感到很迷茫。"},{"en":"Older students teased the bejants, but they also helped them find their classrooms.","zh":"高年级学生会逗新生玩，但也会帮他们找到教室。"}]},{"partOfSpeech":"adj.","definition":{"en":"new and inexperienced; freshly arrived","zh":"新来的；缺乏经验的（较少见）"},"examples":[{"en":"He looked bejant in the lab, unsure which equipment to use.","zh":"他在实验室里显得很生疏，不确定该用哪种设备。"}]}],"synonyms":["freshman","first-year student","newcomer","newbie","novice"],"phonetic":"/ˈbeɪʒənt/","extraExplanation":["“bejant”是较罕见、带历史色彩的词，常见于苏格兰大学传统语境，意思接近“freshman / newbie”。","词源与法语古词有关，原意类似“黄嘴小鸟”（比喻初来乍到、还不成熟的人），因此带一点点戏谑但不一定是侮辱。"]}
{"word":"bejape","summary":{"en":"Bejape is an old-fashioned verb meaning to trick or mock someone, or to play pranks.","zh":"Bejape 是古用动词，表示欺骗或戏弄某人，也可指开玩笑、恶作剧。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic) to trick, deceive, or make a fool of someone; to mock or joke at someone’s expense.","zh":"（古用）欺骗、戏弄（某人）；嘲弄、拿（某人）开玩笑。"},"examples":[{"en":"In the old tale, the clever servant bejaped his greedy master.","zh":"在那个古老故事里，机灵的仆人戏弄了贪婪的主人。"},{"en":"He felt bejaped when he learned the “gift” was only a prank.","zh":"当他得知那份“礼物”只是恶作剧时，他觉得自己被耍了。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Archaic) to act in a joking or mocking way; to play pranks.","zh":"（古用）开玩笑、恶作剧；以嘲讽的方式行事。"},"examples":[{"en":"They would bejape in the market, teasing passersby.","zh":"他们在集市上开着玩笑，逗弄路人。"}]}],"synonyms":["trick","fool","deceive","prank","make fun of","mock"],"phonetic":"/bɪˈdʒeɪp/","extraExplanation":["“bejape”很少见，主要出现在中古/早期英语文本中。它和更常见的“jape”（玩笑、戏弄）有关，前缀“be-”在古英语里常有“使……处于某种状态/对……做某事”的作用，所以“bejape”可理解为“对某人进行戏弄/欺骗”。现代英语里一般用“trick / fool / deceive / prank / make fun of”来表达类似意思。"]}
{"word":"bejaundice","summary":{"en":"Bejaundice is a rare verb meaning to make yellow with jaundice, or figuratively to make someone’s view biased and cynical.","zh":"Bejaundice 是很少见的动词，意思是使（因黄疸）发黄；也可比喻使人的看法变得偏颇、消极和多疑。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone or something jaundiced (yellowish from illness), or to cause jaundice","zh":"使（人或物）发黄；使患黄疸"},"examples":[{"en":"In old medical writing, contaminated water was said to bejaundice the skin.","zh":"在一些旧医学写作中，受污染的水被说成会使皮肤发黄。"},{"en":"The untreated infection seemed to bejaundice his eyes within days.","zh":"未治疗的感染似乎在几天内就让他的眼睛发黄。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) to affect someone’s attitude so they see things in an unfairly negative, suspicious, or cynical way","zh":"（比喻）使（看法）带偏见；使变得怀疑/愤世嫉俗"},"examples":[{"en":"A few bad experiences can bejaundice your view of the whole industry.","zh":"几次糟糕的经历就可能让你对整个行业产生偏见。"},{"en":"Don’t let one rude comment bejaundice your opinion of the class.","zh":"别让一句无礼的话就让你对这门课产生偏见。"}]}],"synonyms":["jaundice","yellow","taint","bias","embitter"],"phonetic":"/biˈdʒɔndɪs/","extraExplanation":["“bejaundice”非常少见，多见于旧式或文学化表达。现代英语更常用 make (someone) jaundiced / give (someone) jaundice，或用形容词 jaundiced（如 a jaundiced view 表示“偏颇、消极的看法”）。","词首 be- 是一种较古老的构词方式，常表示“使成为……/使处于某种状态”（如 befoul 使变脏、belittle 贬低）。"]}
{"word":"bejazz","summary":{"en":"Bejazz means “make something more lively or exciting,” and it’s closely related to the common expressions “jazz up” and “be jazzed (about).”","zh":"bejazz 表示“让某物更有活力或更精彩”，并与常见说法 jazz up 和 be jazzed (about) 密切相关。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something more lively, stylish, or exciting (often by adding a “jazz” feeling, e.g., energy, flair, or decoration)","zh":"使某物更有活力/更时髦/更有趣（带点“爵士感”的热闹与风格，比如增加能量、亮点或装饰）"},"examples":[{"en":"They bejazzed the presentation with short videos and colorful slides.","zh":"他们用短视频和彩色幻灯片让演示更生动。"},{"en":"A few fresh herbs can bejazz a simple soup.","zh":"加一点新鲜香草就能让普通的汤更有风味。"}]},{"partOfSpeech":"phrase","definition":{"en":"(related slang) to be very excited about something (more commonly said as “be jazzed (about)”)","zh":"（相关俚语）对某事非常兴奋/很期待（更常说“be jazzed (about)”）"},"examples":[{"en":"I’m jazzed about the concert this weekend.","zh":"我很期待这周末的演唱会。"},{"en":"She was jazzed to start her new job.","zh":"她对开始新工作感到很兴奋。"}]}],"synonyms":["jazz up","liven up","spice up","brighten up","add flair"],"phonetic":"/biˈdʒæz/","extraExplanation":["“bejazz”本身在现代英语里不算常见，更自然、更常用的表达通常是：jazz up（把……变得更有趣/更亮眼）以及 be jazzed (about)（对……很兴奋/很期待）。","“jazz up”偏口语，常用于“让外观/内容更吸引人”的场景：jazz up a room/outfit/speech（让房间/穿搭/演讲更出彩）。"]}
{"word":"bejel","summary":{"en":"Bejel is an infectious disease related to syphilis that spreads mainly through non-sexual close contact and affects the skin (and sometimes mouth/bones).","zh":"Bejel（贝杰尔病）是一种与梅毒相关的传染病，主要通过非性接触传播，多影响皮肤（有时累及口腔/骨骼）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a contagious bacterial infection (a form of non-venereal/endemic syphilis) that mainly affects the skin and sometimes the mouth and bones, usually spread through close non-sexual contact, especially among children in some warm, dry regions","zh":"贝杰尔病：一种具有传染性的细菌感染（属于非性传播/地方性梅毒的一种），主要影响皮肤，有时也会影响口腔和骨骼；通常通过密切的非性接触传播，常见于一些温暖干燥地区的儿童"},"examples":[{"en":"In some rural areas, bejel can spread among children through close household contact.","zh":"在一些农村地区，贝杰尔病可能通过家庭成员的密切接触在儿童之间传播。"},{"en":"The doctor considered bejel because the sores were consistent with endemic syphilis and there was no history of sexual exposure.","zh":"医生之所以考虑贝杰尔病，是因为溃疡与地方性梅毒相符，而且没有性接触史。"}]}],"synonyms":["endemic syphilis","non-venereal syphilis"],"phonetic":"/bəˈdʒɛl/","extraExplanation":["“Bejel”在医学上也常被称为“endemic syphilis（地方性梅毒）”或“non-venereal syphilis（非性传播梅毒）”。虽然属于梅毒相关疾病，但关键点是：它通常不是通过性行为传播，而是通过日常密切接触（例如共用生活用品、家庭近距离接触）传播。","词源上多见于医学文献与公共卫生语境，常与某些地区的生活条件、卫生条件有关。英语中它是专有医学词汇，日常对话很少使用。"]}
{"word":"bejeled","summary":{"en":"Bejeweled means decorated with jewels (also used as a verb: to decorate with jewels).","zh":"Bejeweled 意为“镶有宝石的/用珠宝装饰的”（也可作动词：用珠宝装饰）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"adj. Decorated with jewels; covered or set with gems. \nExamples: \n• en: She wore a bejeweled crown. zh: 她戴着一顶镶满宝石的王冠。 \n• en: The dancer’s costume was bejeweled and sparkling under the lights. zh: 舞者的服装镶有宝石，在灯光下闪闪发亮。","zh":"adj. 镶有宝石的；用珠宝装饰的。 \n例句：\n• en: She wore a bejeweled crown. zh: 她戴着一顶镶满宝石的王冠。 \n• en: The dancer’s costume was bejeweled and sparkling under the lights. zh: 舞者的服装镶有宝石，在灯光下闪闪发亮。"},"examples":[{"en":"She wore a bejeweled crown.","zh":"她戴着一顶镶满宝石的王冠。"},{"en":"The dancer’s costume was bejeweled and sparkling under the lights.","zh":"舞者的服装镶有宝石，在灯光下闪闪发亮。"}]},{"partOfSpeech":"vt.","definition":{"en":"vt. (Less common) To decorate something with jewels. \nExamples: \n• en: The artisans bejeweled the necklace with tiny diamonds. zh: 工匠用细小的钻石为项链镶饰。","zh":"vt.（较少见）用珠宝装饰；在……上镶嵌宝石。 \n例句：\n• en: The artisans bejeweled the necklace with tiny diamonds. zh: 工匠用细小的钻石为项链镶饰。"},"examples":[{"en":"The artisans bejeweled the necklace with tiny diamonds.","zh":"工匠用细小的钻石为项链镶饰。"}]}],"synonyms":["jeweled","gem-studded","ornamented","adorned","embellished"],"phonetic":"/bɪˈdʒuəld/","extraExplanation":["你输入的“bejeled”通常被视为拼写错误；标准拼写是 **bejeweled**（中间有 *we*）。在美式英语里更常用 **bejeweled**，意思是“镶满珠宝的/用珠宝装饰的”。","词源上可理解为前缀 **be-**（使……成为/使……带有）+ **jeweled**（镶有珠宝的），所以整体就是“使某物镶上珠宝”。","在流行文化里，Taylor Swift 有一首歌名叫《Bejeweled》，让这个词更常被看见。"]}
{"word":"bejeling","summary":{"en":"**Bejeweling** means decorating something with jewels (or making it look jewel-like and sparkling).","zh":"**Bejeweling** 指用珠宝装饰（或让某物看起来像镶了珠宝般闪亮华丽）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"Present participle/gerund of **bejewel**: to decorate something with jewels or gem-like ornaments; to make something look bright and fancy like it has jewels.","zh":"**bejewel** 的现在分词/动名词：用珠宝或类似宝石的装饰点缀（某物）；使某物看起来像镶上珠宝一样闪亮华丽。"},"examples":[{"en":"The designer is **bejeweling** the dress with tiny crystals.","zh":"设计师正在用细小的水晶来点缀这条裙子。"},{"en":"Her hair was **bejeweling** the whole look, thanks to the sparkling pins.","zh":"闪亮的发夹让她的发型为整体造型增色不少。"}]}],"synonyms":["decorate","adorn","embellish","ornament","gild"],"phonetic":"/bɪˈdʒuːəlɪŋ/","extraExplanation":["“bejeling” 不是常见的标准拼写；更可能是 **bejeweling**（动词 bejewel 的 -ing 形式）或 **bejewelling**（英式拼写，多一个 l）。","**bejewel** 常见于文学或广告语，带一点夸张的审美色彩：不仅指真正的宝石，也可比喻“用亮点装饰/点亮”某物。"]}
{"word":"bejelled","summary":{"en":"Bejeweled/bejewelled means decorated with jewels or glittering ornaments.","zh":"bejeweled/bejewelled 指“镶有宝石的；用闪亮饰物装饰的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"decorated with jewels or something that looks like jewels; covered in sparkly ornaments","zh":"镶有宝石的；像宝石一样闪亮装饰的"},"examples":[{"en":"She wore a bejeweled crown for the costume party.","zh":"她在化装舞会上戴了一顶镶满宝石的王冠。"},{"en":"The dancer’s bejeweled costume caught the stage lights.","zh":"舞者那件闪亮如宝石的服装在舞台灯光下格外耀眼。"}]},{"partOfSpeech":"vt.","definition":{"en":"(past form / past participle of “bejeweled”) to decorate with jewels or jewel-like ornaments","zh":"（bejeweled 的过去式/过去分词）用宝石或类似宝石的饰物装饰"},"examples":[{"en":"The artisan bejeweled the mask with tiny glass stones.","zh":"工匠用细小的玻璃宝石装饰了面具。"},{"en":"Her gown was bejeweled with beads and crystals.","zh":"她的礼服用珠子和水晶点缀得闪闪发光。"}]}],"synonyms":["jeweled","ornamented","adorned","decked out","embellished"],"phonetic":"/bɪˈdʒuːəld/","extraExplanation":["“bejelled”更常见的拼写是 **bejeweled**（美式）或 **bejewelled**（英式）。你输入的形式可能是拼写变体或误拼。两者意思相同。","这个词常用于文学或描述性写作，带有“华丽、耀眼、富丽”的感觉，不一定是真的宝石，也可以指水晶、亮片、玻璃珠等“像宝石一样”的装饰。"]}
{"word":"bejelling","summary":{"en":"“Bejelling” is not standard; it is usually a misspelling of “bejeweling,” meaning decorating something with jewels or jewel-like ornaments.","zh":"“bejelling”不是标准用法；通常是“bejeweling”的拼写错误，意思是用珠宝或类似珠宝的饰物来装饰某物。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Nonstandard spelling) likely meant: “bejeweling” — decorating something with jewels or jewel-like ornaments; making it look richly decorated.","zh":"（非标准拼写）多半是想写：“bejeweling”——用珠宝或类似珠宝的装饰点缀某物；使其看起来华丽。"},"examples":[{"en":"The costume designer was bejeweling the crown with glass stones.","zh":"服装设计师正在用玻璃宝石点缀王冠。"},{"en":"She spent the evening bejeweling her dress for the performance.","zh":"她花了一整晚为演出把裙子装饰得珠光闪闪。"}]}],"synonyms":["adorn","decorate","ornament","embellish","bedazzle"],"phonetic":"/bɪˈdʒuəlɪŋ/","extraExplanation":["“bejelling”在现代英语里几乎不作为标准词使用，常见情况是把“bejeweling/bejewelling”（给……镶嵌珠宝、装饰得华丽）拼错了。","“bejewel”的美式拼写常见为 bejeweled / bejeweling；英式拼写常见为 bejewelled / bejewelling。","如果你是在某个特定文本里看到“bejelling”，也可能是作者刻意的创意拼写；把原句发来我可以帮你判断更准确的意思。"]}
{"word":"bejesuit","summary":{"en":"“Bejesuit” isn’t standard; it’s likely “bejesus,” an informal word used in set phrases for strong fear or intensity.","zh":"“bejesuit”不是标准词；多半是“bejesus”的误拼，常用于固定表达，表示强烈的恐惧或猛烈程度。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a misspelling of “bejesus,” an informal word used in expressions meaning intense fear, surprise, or force.","zh":"这不是标准英语单词；更可能是把“bejesus”拼错了。“bejesus”是非正式用语，常出现在固定表达中，表示强烈的恐惧、惊讶或用力。"},"examples":[{"en":"I think you mean “bejesus,” as in “That noise scared the bejesus out of me.”","zh":"你可能想写的是“bejesus”，比如：“那声音把我吓坏了。”"},{"en":"Please check the spelling: it’s usually “bejesus,” not “bejesuit.”","zh":"请检查拼写：通常是“bejesus”，不是“bejesuit”。"}]},{"partOfSpeech":"n.","definition":{"en":"bejesus (informal): used in the phrase “scare the bejesus out of someone,” meaning to frighten someone very much.","zh":"bejesus（非正式）：用于短语“scare the bejesus out of someone”，意思是“把某人吓得不轻/吓坏了”。"},"examples":[{"en":"That horror movie scared the bejesus out of me.","zh":"那部恐怖片把我吓坏了。"},{"en":"Don’t sneak up on me—you scared the bejesus out of me!","zh":"别从背后悄悄靠近我——你把我吓死了！"}]},{"partOfSpeech":"n.","definition":{"en":"bejesus (informal): used in phrases like “beat/kick the bejesus out of” or “work the bejesus out of,” meaning to do something with great force or intensity (often rough or extreme).","zh":"bejesus（非正式）：用于“beat/kick the bejesus out of…”“work the bejesus out of…”等，表示“用很大力气/非常猛烈地……；把……折腾得很厉害”。"},"examples":[{"en":"The storm beat the bejesus out of the old dock.","zh":"暴风雨把旧码头折腾得很惨。"},{"en":"That workout really worked the bejesus out of me.","zh":"那次训练把我练得够呛。"}]}],"synonyms":["the heck (milder)","the hell (stronger)","daylights (in “scare the daylights out of”)","scare badly","frighten greatly"],"phonetic":"/bəˈdʒiːzəs/","extraExplanation":["“bejesus”是一种委婉/变形说法，源自对“Jesus（耶稣）”的避讳或弱化（类似用轻微变形来避免直接说宗教词）。因此它多见于口语和非正式写作。","常见固定搭配：scare the bejesus out of sb（把某人吓坏）、beat/kick the bejesus out of sb（狠揍某人；注意语气粗鲁）、work the bejesus out of sb（把某人累坏/折腾惨）。在正式场合建议改用：frighten someone badly / exhaust someone / damage something severely。"]}
{"word":"bejesus","summary":{"en":"“Bejesus” is an informal noun used mostly in set phrases to mean intense fear/shock (especially “scare the bejesus out of someone”), and it also works as a mild euphemistic oath for “Jesus.”","zh":"“bejesus”是非正式名词，多用于固定搭配，表示强烈的恐惧/震惊（尤指“scare the bejesus out of someone”把某人吓坏），也可作“Jesus”的委婉感叹/咒骂用语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, usually in set phrases) A strong feeling of fear, shock, or surprise—especially in “scare the bejesus out of (someone).”","zh":"（非正式，多用于固定搭配）强烈的恐惧、震惊或意外之感；常见于“scare the bejesus out of someone”（把某人吓坏）。"},"examples":[{"en":"That horror movie scared the bejesus out of me.","zh":"那部恐怖片把我吓坏了。"},{"en":"The alarm went off and nearly scared the bejesus out of everyone.","zh":"警报一响，几乎把大家都吓坏了。"},{"en":"Don’t sneak up on people—you’ll scare the bejesus out of them.","zh":"别悄悄靠近别人——会把人吓坏的。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, mild oath) A euphemistic form of “Jesus,” used in expressions like “what in the bejesus…?”","zh":"（非正式、较委婉的咒骂/感叹）“Jesus”的委婉说法，用于“what in the bejesus…?”（到底怎么回事/搞什么鬼…?）等表达。"},"examples":[{"en":"What in the bejesus is that noise?","zh":"那到底是什么声音？"},{"en":"Where in the bejesus did I put my keys?","zh":"我的钥匙到底放哪儿了？"}]}],"synonyms":["(scare) the living daylights","(scare) the life out of","freak out","terrify","shock"],"phonetic":"/bəˈdʒiːzəs/","extraExplanation":["“bejesus”源自对“Jesus”的委婉变体（避免直接提及宗教名词作为咒骂）。在美式英语里常见于口语与影视对白，语气较粗俗/强烈但不算最脏的那类。对宗教较敏感的场合（正式写作、职场、与虔诚信徒交流）建议避免使用或改用更中性的说法，如“scare me a lot / freak me out / what on earth…”。","常见固定搭配：scare the bejesus out of sb（把某人吓坏）；beat/work the bejesus out of sth（把某物弄得很厉害/很用力）；what/how/where in the bejesus…?（到底怎么…？）"]}
{"word":"bejewel","summary":{"en":"Bejewel means to decorate something with jewels, or figuratively to make it look glittering and richly adorned.","zh":"Bejewel 指用宝石装饰某物，也可比喻使某物看起来闪耀华丽、像镶满宝石。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to decorate (something) with jewels; to adorn richly","zh":"用宝石装饰；把……装点得华丽"},"examples":[{"en":"The crown was bejeweled with rubies and pearls.","zh":"王冠镶嵌着红宝石和珍珠。"},{"en":"She wore a bejeweled necklace to the ceremony.","zh":"她在典礼上戴着一条镶宝石的项链。"},{"en":"The costume designer bejeweled the dress for the final scene.","zh":"服装设计师为最后一幕把那条裙子点缀上宝石装饰。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) to add bright, precious-looking details to something","zh":"（比喻）为……增添闪亮、珍贵感的点缀"},"examples":[{"en":"Streetlights bejeweled the river at night with reflections.","zh":"夜里路灯的倒影让河面像镶满宝石一样闪烁。"},{"en":"Snow bejeweled the branches in the morning sun.","zh":"晨光下，积雪让树枝像点缀了宝石般晶亮。"}]}],"synonyms":["adorn","decorate","embellish","ornament","bedazzle"],"phonetic":"/bɪˈdʒuːəl/","extraExplanation":["“bejewel”里的前缀 be- 常见于动词，表示“使……处于某种状态/给……加上……”。因此 bejewel 字面意思就是“给……加上宝石”。","文学与描写性写作中常用其比喻义，强调“闪光、华丽、夺目”的视觉效果。"]}
{"word":"bejeweled","summary":{"en":"“Bejeweled” means decorated with jewels; it can also mean to decorate something with jewels (more literary).","zh":"“bejeweled”指“镶有珠宝的、珠光闪闪的”；也可作动词表示“用珠宝装饰”（较文学化）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Decorated with jewels; covered or set with sparkling gems.","zh":"镶有珠宝的；点缀着宝石的；珠光闪闪的。"},"examples":[{"en":"She wore a bejeweled crown at the ceremony.","zh":"她在典礼上戴着一顶镶满宝石的王冠。"},{"en":"A bejeweled clutch can make a simple outfit look fancy.","zh":"一只镶宝石的手拿包能让简单的穿搭看起来更华丽。"}]},{"partOfSpeech":"v.","definition":{"en":"To decorate something by adding jewels (often used in literature or a poetic style).","zh":"用珠宝装饰（某物）（常见于文学或较诗意的表达）。"},"examples":[{"en":"The artisans bejeweled the sword’s handle with rubies and gold.","zh":"工匠用红宝石和黄金装饰了剑柄。"},{"en":"In the story, the night sky was described as bejeweled with stars.","zh":"故事里形容夜空被繁星“镶嵌得珠光闪闪”。"}]}],"synonyms":["jewel-encrusted","adorned","ornate","decorated","bedazzled"],"phonetic":"/bɪˈdʒuːəld/","extraExplanation":["“bejeweled”更常当形容词使用，带有“奢华、华丽、闪耀”的感觉；动词用法相对少见，但在诗歌、童话或夸张描写里很常见。","常见搭配：bejeweled crown（宝石王冠）、bejeweled necklace（镶宝石项链）、bejeweled gown（缀满珠宝的礼服）。也可比喻：bejeweled with stars（像镶了宝石一样布满星星）。"]}
{"word":"bejeweling","summary":{"en":"Bejeweling means decorating something with jewels or jewel-like details, or (figuratively) making something sparkle and look richly adorned.","zh":"Bejeweling 指用珠宝或珠宝般的装饰点缀某物；也可作比喻，用来形容让事物闪耀、显得华丽。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"decorating something with jewels or jewel-like ornaments","zh":"用珠宝（或类似珠宝的装饰物）点缀/装饰某物"},"examples":[{"en":"The designer spent hours bejeweling the dress for the runway show.","zh":"设计师花了好几个小时给那件连衣裙镶嵌珠饰，准备走秀。"},{"en":"She was bejeweling a hairpin with tiny crystals.","zh":"她正在用小水晶装饰一支发簪。"}]},{"partOfSpeech":"v.","definition":{"en":"making something look more beautiful by adding bright, jewel-like details (often used in a poetic or descriptive way)","zh":"（常带文学/描写色彩）用闪亮如珠宝的细节让某物更美、更耀眼"},"examples":[{"en":"Moonlight was bejeweling the lake with silver sparkles.","zh":"月光为湖面点缀上银色的粼粼闪光。"},{"en":"Morning dew sat on the leaves, bejeweling the garden.","zh":"清晨的露珠停在叶片上，像珠饰一样点亮了花园。"}]}],"synonyms":["adorn","decorate","embellish","ornament","encrust"],"phonetic":"/bɪˈdʒuəlɪŋ/","extraExplanation":["“bejeweling”更常见的拼写是“bejeweling”（美式常见）或“bejewelling”（英式常见，双写l）。它来自动词“bejewel”（be- + jewel），意思是“使……如珠宝般华丽/为……镶上珠宝”。","在写作里它也常用于比喻：不一定真的有珠宝，而是强调“点点闪光、装点、增色”的画面感。"]}
{"word":"bejewelled","summary":{"en":"Bejewelled means decorated with jewels or shining as if covered in jewels.","zh":"Bejewelled 指“镶满宝石的/用珠宝装饰的”，也可比喻“像宝石般闪耀华丽”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"decorated or covered with jewels; adorned in a showy, sparkling way","zh":"镶满宝石的；用珠宝装饰的；（华丽地）点缀着宝石般闪耀的"},"examples":[{"en":"She wore a bejewelled crown for the ceremony.","zh":"仪式上她戴着一顶镶满宝石的王冠。"},{"en":"The museum displayed a bejewelled dagger from the royal collection.","zh":"博物馆展出了一把来自王室收藏的镶宝石匕首。"},{"en":"The city skyline looked bejewelled at night, glittering with lights.","zh":"夜晚的城市天际线像被宝石点缀一样，灯光闪烁。"}]}],"synonyms":["jeweled","adorned","ornate","decked out","gem-studded"],"phonetic":"/bɪˈdʒuəld/","extraExplanation":["“bejewelled”（美式常拼作 bejeweled）来自 be-（使……处于某种状态）+ jewel（宝石），字面意思是“使……像宝石一样/用宝石装饰”。在文学或描写中也常用于比喻：不一定真有宝石，而是形容“闪闪发亮、华丽夺目”。","常见搭配：bejewelled crown/tiara（王冠/头饰）、bejewelled necklace（镶宝石项链）、bejewelled sword/dagger（镶宝石的剑/匕首）。"]}
{"word":"bejewelling","summary":{"en":"Bejewelling means decorating something with jewels, or (figuratively) adding showy details to make it seem more impressive.","zh":"bejewelling 指用珠宝镶嵌/装饰某物；也可比喻用华丽细节点缀，让其看起来更出彩。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"decorating something by adding jewels or jewelry; making it sparkle with gems.","zh":"用宝石/珠宝装饰某物；使其镶嵌宝石、闪闪发光。"},"examples":[{"en":"The designer spent hours bejewelling the crown with emeralds.","zh":"设计师花了好几个小时用祖母绿给王冠镶嵌宝石。"},{"en":"She was bejewelling the costume for the stage show.","zh":"她正在为舞台演出把服装装饰上珠宝。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) adding attractive details that make something seem more impressive or beautiful.","zh":"（比喻）用华丽细节点缀，使某物显得更出彩/更漂亮。"},"examples":[{"en":"He was bejewelling his speech with fancy words to sound smarter.","zh":"他用华丽词藻来“点缀”演讲，想让自己听起来更聪明。"},{"en":"The app update is mostly bejewelling the interface, not fixing the main problems.","zh":"这次更新主要是在“美化”界面，并没有解决核心问题。"}]}],"synonyms":["adorning","decorating","embellishing","ornamenting","garnishing"],"phonetic":"/bɪˈdʒuəlɪŋ/","extraExplanation":["“bejewelling”是动词“bejewel”的现在分词/动名词形式，意思是“用珠宝装饰”。在美式英语里更常见的拼写是“bejeweling”（单写l），英式英语常写“bejewelling”（双写l）。","这个词带有比较文学化、华丽的语气，经常出现在描写服饰、王冠、宫廷或舞台造型的语境中。"]}
{"word":"bejewels","summary":{"en":"“Bejewels” means decorates something with jewels, or (figuratively) makes it seem bright and beautiful.","zh":"“bejewels”表示“用珠宝装饰/镶嵌”，也可比喻“使……更璀璨动人”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to decorate or cover something with jewels (or jewel-like ornaments)","zh":"用珠宝（或类似珠宝的饰物）装饰或镶嵌某物"},"examples":[{"en":"The designer bejewels the dress with small crystals.","zh":"设计师用小水晶来装饰这条裙子。"},{"en":"A gold crown bejeweled with rubies sat on the velvet pillow.","zh":"一顶镶着红宝石的金冠放在天鹅绒枕头上。"},{"en":"Streetlights bejewel the river at night, reflecting like gems on the water.","zh":"夜里路灯把河面点缀得像宝石一样，在水中闪烁倒影。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something look bright, beautiful, or valuable (often used figuratively)","zh":"（常作比喻）使某物显得更璀璨、更美或更珍贵"},"examples":[{"en":"Her smile bejewels an otherwise serious face.","zh":"她的微笑让原本严肃的脸显得格外明亮。"},{"en":"Memories bejewel the story, adding warmth and color.","zh":"回忆点亮了故事，为它增添温度与色彩。"}]}],"synonyms":["adorn","embellish","decorate","bedazzle","ornament"],"phonetic":"/bɪˈdʒuːəl/","extraExplanation":["“bejewels”是动词“bejewel”的第三人称单数现在时（he/she/it bejewels）。常见于描写服饰、王冠、建筑细节等的文学或广告语境，带有“华丽、闪耀”的画面感。"]}
{"word":"bejezebel","summary":{"en":"“Bejezebel!” is a rare, playful exclamation of surprise or annoyance.","zh":"“Bejezebel!” 是较少见、带俏皮感的感叹语，表示惊讶或不满。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"a playful or old-fashioned exclamation used to show surprise, annoyance, or emphasis (a mild swear substitute).","zh":"一种俏皮或略显老派的感叹语，用来表示惊讶、不满或强调（较温和的“替代脏话”）。"},"examples":[{"en":"Bejezebel! I didn’t expect the price to be that high.","zh":"Bejezebel！我没想到价格会这么高。"},{"en":"“Bejezebel,” he muttered when the bus pulled away.","zh":"“Bejezebel。”当公交车开走时，他小声嘀咕。"}]}],"synonyms":["geez","jeez","good grief","for heaven’s sake"],"phonetic":"/bɪˈdʒɛzəbəl/","extraExplanation":["这个词比较少见，多见于口语或带喜剧/夸张风格的写法；有时也会被拼作 bejeezebel 等。","它通常被当作“轻度咒骂/感叹”的替代说法，语气更像夸张吐槽而不是真正粗口。","不要与 Jezebel（常用作名词，指《圣经》中耶洗别/引申为‘放荡的女人’的贬义称呼）混淆；bejezebel 多为感叹用法。"]}
{"word":"bejig","summary":{"en":"“Bejig” is not standard; it is usually a misspelling of “beige,” meaning the light brown color (as an adjective or noun).","zh":"“bejig”不是标准拼写；通常是把“beige（米色/浅褐色）”拼错了，可作形容词或名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling of “beige,” a light brown or pale sand color.","zh":"不是标准英语单词；最常见是把“beige（米色/浅褐色）”拼错了。"},"examples":[{"en":"Did you mean “beige”? This wall looks beige to me.","zh":"你是不是想写“beige（米色）”？我觉得这面墙看起来是米色的。"}]},{"partOfSpeech":"adj.","definition":{"en":"Light brown; a pale, sandy color.","zh":"米色的；浅褐色的；带沙色的。"},"examples":[{"en":"She wore a beige coat to work.","zh":"她穿了一件米色外套去上班。"},{"en":"We chose beige curtains to match the sofa.","zh":"我们选了米色窗帘来搭配沙发。"}]},{"partOfSpeech":"n.","definition":{"en":"The color beige.","zh":"米色；浅褐色。"},"examples":[{"en":"Beige is popular for minimalist designs.","zh":"米色在极简风设计中很受欢迎。"}]}],"synonyms":["tan","sand-colored","light brown","cream (close, but lighter)"],"phonetic":"/beɪʒ/","extraExplanation":["“Beige”在日常表达里也常被引申为“平淡无奇、缺乏个性”（多用于评价风格、创意或个性），例如：His writing is a bit beige.（他的写作有点平淡。）","如果“bejig”是人名、品牌名、游戏ID或某种方言/网络用语，请告诉我你看到它的句子或场景，我可以按语境解释。"]}
{"word":"Bejou","summary":{"en":"“Bejou” is usually a misspelling of “bijou,” meaning something small, elegant, and often expensive (a jewel or a stylish compact place).","zh":"“Bejou”通常是“bijou”的误拼，意为“小巧精致、常较昂贵的东西（尤指珠宝）”，也可形容“小而精致/有格调的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly spelled “bijou”) a small, elegant, and often expensive item, especially a piece of jewelry.","zh":"（常见拼写为“bijou”）小巧精致、通常较昂贵的物品，尤指珠宝首饰。"},"examples":[{"en":"She wore a silver bijou on a thin chain around her neck.","zh":"她脖子上戴着一条细链子，上面有一件小巧的银饰。"},{"en":"The shop sells vintage bijoux and other small treasures.","zh":"这家店卖复古小首饰和其他小宝贝。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Commonly spelled “bijou”) small, neat, and attractively designed; compact but stylish.","zh":"（常见拼写为“bijou”）小巧的；精致的；虽不大但很有格调的。"},"examples":[{"en":"They rented a bijou apartment near the park.","zh":"他们在公园附近租了一间小巧精致的公寓。"},{"en":"It’s a bijou café with only four tables, but the coffee is excellent.","zh":"这是一家小而精的咖啡馆，只有四张桌子，但咖啡很棒。"}]}],"synonyms":["dainty","elegant","tiny","jewel","trinket","chic"],"phonetic":"/biˈʒu/","extraExplanation":["“bijou”来自法语，原意与“珠宝”有关；英语里既可作名词（小首饰/小巧贵重物），也常作形容词来形容房子、餐馆、酒店等“精致但不大”。","法语复数是“bijoux”，英语中有时也会用“bijoux”表示“许多小首饰/小宝贝”。","你输入的“Bejou”通常被认为是“bijou”的误拼；如果你指的是人名、品牌名或地名，可以告诉我上下文，我可以帮你确认。"]}
{"word":"bejuco","summary":{"en":"Bejuco means a tropical vine (liana) or the strong vine material used for tying and weaving.","zh":"bejuco指热带藤本（大藤本），也指可用于捆绑、编织的坚韧藤条。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical climbing vine (liana), or the tough vine/cord made from it, often used for tying, weaving, or making baskets and rope","zh":"（热带）藤本植物（大藤本/liana）；也指这种藤条本身（坚韧可用来捆绑、编织、制绳或做篮子）"},"examples":[{"en":"In some tropical regions, people cut bejuco to weave baskets and straps.","zh":"在一些热带地区，人们会砍取bejuco藤条来编织篮子和背带。"},{"en":"The hikers followed a path where thick bejuco vines hung across the trail.","zh":"徒步者沿着小路前行，粗壮的bejuco藤蔓垂挂在路上方。"}]}],"synonyms":["liana","vine","climber","rattan (similar use, not identical)"],"phonetic":"/beɪˈhuːkoʊ/","extraExplanation":["“Bejuco”是西班牙语词，在加勒比海与拉丁美洲（尤其是中美洲）很常见；在英语里多作为借词出现在自然、民族植物学或旅行写作中，意思接近“liana（大藤本）/vine（藤蔓）”。","词源上一般认为与加勒比地区的原住民语言有关（常见说法指向泰诺语一类来源），后来进入西班牙语并被英语在特定语境中借用。","文化语境里，bejuco常与手工编织、绑扎、传统篮具或简易绳索制作相关；阅读拉美题材作品时看到它，通常不译为具体某一单一物种，而理解为“可用的野生藤条/藤蔓”。"]}
{"word":"bejuggle","summary":{"en":"A rare, humorous verb meaning to make someone (or something) juggle many demands, or to manipulate facts as if juggling them.","zh":"一个罕见、带幽默感的动词：指让人忙于同时兼顾许多事情，或像杂耍一样摆弄事实/数据。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(rare, humorous) to keep (someone or yourself) busy juggling many tasks; to make something involve lots of careful balancing or switching.","zh":"（罕见、带幽默感）让（某人/自己）忙于同时处理很多事；使某事需要不断“兼顾、切换、平衡”。"},"examples":[{"en":"As a new parent, I feel constantly bejuggled by work, errands, and sleepless nights.","zh":"刚当上父母，我感觉一直被工作、杂事和失眠折腾得要同时兼顾很多东西。"},{"en":"The project bejuggled the team’s time between meetings and deadlines.","zh":"这个项目让团队的时间在会议和截止日期之间来回周旋。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare) to handle or manipulate (ideas, numbers, facts) in a tricky way, as if “juggling” them.","zh":"（罕见）像“抛接杂耍”一样巧妙甚至带点花招地摆弄（观点、数字、事实等）。"},"examples":[{"en":"He tried to bejuggle the statistics to make the plan look cheaper.","zh":"他试图用一些花招摆弄统计数据，让方案看起来更便宜。"},{"en":"Don’t bejuggle the facts—answer the question directly.","zh":"别在事实里耍花样——直接回答问题。"}]}],"synonyms":["juggle","manage","balance","handle","manipulate"],"phonetic":"/biˈdʒʌɡəl/","extraExplanation":["“bejuggle”不是常见标准词，更常见的是“juggle”。它由前缀 be-（有“使…处于某种状态/对…做某事”的感觉）+ juggle 组成，所以整体有“让…被迫杂耍般周旋/忙于兼顾”的语感，常用于诙谐表达。正式写作中建议用 juggle / manage / balance。"]}
{"word":"bejumble","summary":{"en":"“Bejumble” means to mix up or confuse completely by jumbling.","zh":"“bejumble”指把东西彻底弄乱，或把思路/信息搅得很混乱。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to jumble or mix up completely; to confuse by mixing things together","zh":"把……彻底弄乱；使……混乱、混淆"},"examples":[{"en":"The pages got bejumbled in my backpack, so the story didn’t make sense.","zh":"书页在我背包里被弄乱了，所以故事读起来不连贯。"},{"en":"A noisy group chat can bejumble your thoughts when you’re trying to study.","zh":"你在学习时，吵闹的群聊会把思路搅乱。"}]}],"synonyms":["jumble (up)","mix up","muddle","confuse","scramble"],"phonetic":"/biˈdʒʌmbəl/","extraExplanation":["“bejumble”在现代英语里比较少见，更多时候人们直接用“jumble (up)”或“mix up”。它的前缀“be-”有“使……处于某种状态/对……做某事”的感觉，让动作听起来更“彻底”或更有文学色彩。"]}
{"word":"bejumbled","summary":{"en":"“Bejumbled” means “jumbled or confused,” but it’s rare in modern English and often sounds playful.","zh":"“bejumbled”表示“混乱/被弄乱、困惑”，但在现代英语中很少用，语气常偏俏皮。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) confused or mixed up; jumbled (often used humorously or in playful writing).","zh":"（罕用）混乱的；被弄得七零八落的（常带幽默或俏皮语气）。"},"examples":[{"en":"After the long flight, my schedule was completely bejumbled.","zh":"长途飞行之后，我的作息完全被弄乱了。"},{"en":"The papers on his desk were so bejumbled that he couldn’t find the report.","zh":"他桌上的文件乱成一团，怎么也找不到那份报告。"},{"en":"I feel a bit bejumbled today—too many tasks at once.","zh":"我今天有点晕乱——一下子事情太多。"}]}],"synonyms":["jumbled","mixed up","confused","muddled","disordered"],"phonetic":"/biˈdʒʌmbəld/","extraExplanation":["“bejumbled”在现代英语里非常少见，更多时候人们直接用“jumbled / mixed up / confused”。它看起来像“be- + jumbled”，其中“be-”是较老或较文学/俏皮的前缀，用来强调“使……成为/处于某种状态”。","如果你是在写正式英文，建议改用更常见的表达：“My schedule is all jumbled up.” / “I’m confused.”"]}
{"word":"bejumbles","summary":{"en":"“Bejumbles” means “makes something messy or confused; jumbles up” (rare).","zh":"“bejumbles”意思是“把……弄乱/搅乱、使……混乱”（较罕见）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare) To mix up or put into a confused, messy order; to jumble.","zh":"（罕见）把……弄乱；把……搅乱；使……杂乱无章。"},"examples":[{"en":"The moving crew bejumbles the boxes when they don’t label them clearly.","zh":"搬家工人没有清楚贴标签时，就把箱子弄得乱七八糟。"},{"en":"Too many notifications can bejumble your thoughts.","zh":"太多通知会把你的思绪搅乱。"}]}],"synonyms":["jumble (up)","mix up","muddle","confuse","scramble"],"phonetic":"/biˈdʒʌmbəlz/","extraExplanation":["“bejumbles”是动词“bejumble”的第三人称单数（he/she/it bejumbles）。这个词比较少见，日常更常用“jumble (up) / mix up / confuse”。","前缀“be-”在一些英语词里有“使……处于某种状态/对……做某事”的感觉（如“bewilder”“befriend”），所以“bejumble”带有“使之变得杂乱”的意味。"]}
{"word":"bejumbling","summary":{"en":"“Bejumbling” means jumbling things up or confusing/muddling someone or something.","zh":"“bejumbling”指把东西弄乱，或使人/事变得困惑、混乱。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"mixing things up into a confused or untidy state; jumbling.","zh":"把东西搅乱、弄得杂乱无章；打乱。"},"examples":[{"en":"Bejumbling the papers made it hard to find the contract.","zh":"把文件弄乱后，就很难找到那份合同了。"},{"en":"Try not to keep bejumbling the cables—they’ll get tangled.","zh":"尽量别一直把电线弄乱——会缠在一起的。"}]},{"partOfSpeech":"vt.","definition":{"en":"confusing someone’s thoughts or understanding; muddling.","zh":"使（某人）困惑、思路混乱；把事情讲得更糊涂。"},"examples":[{"en":"All the contradictory advice kept bejumbling her decision.","zh":"互相矛盾的建议一直让她的决定更拿不定。"},{"en":"The long explanation only bejumbled the simple idea.","zh":"那段冗长的解释反而把简单的观点讲糊涂了。"}]}],"synonyms":["jumbling","muddling","mixing up","confusing","scrambling"],"phonetic":"/biˈdʒʌmbəlɪŋ/","extraExplanation":["“bejumble / bejumbling”在现代英语里非常少见，带有一点文艺或玩笑式的语感；日常更常用的是“jumble / muddle / mix up”。其中前缀“be-”在一些较旧或较文学的词里常有“使……成为某种状态”的感觉（如“bewilder”=使迷惑）。"]}
