{"word":"beo","summary":{"en":"“Beo” most commonly refers to a hill myna (a talking bird). In hospitality, “BEO” is an acronym for Banquet Event Order (an event details sheet).","zh":"“beo”常指八哥/山八哥（会学人说话的鸟）。在酒店会务行业里，“BEO”常作缩写，指宴会活动单（活动细节表）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hill myna (a glossy black tropical bird famous for mimicking human speech)","zh":"八哥（山八哥；一种有光泽的黑色热带鸟，以善于模仿人声著名）"},"examples":[{"en":"The beo can imitate whistles and even short phrases.","zh":"八哥会模仿口哨声，甚至能学短句。"},{"en":"In some Southeast Asian markets, people keep a beo as a talking pet bird.","zh":"在东南亚一些市场，人们会把八哥当作会说话的宠物鸟饲养。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbr., hospitality) Banquet Event Order: a document listing the details for a banquet or event (menu, schedule, room setup, staffing, etc.)","zh":"（缩写，酒店/会务）宴会活动单：记录宴会或活动细节的文件（菜单、流程、场地布置、人员安排等）"},"examples":[{"en":"Please check the BEO before the event starts.","zh":"活动开始前请核对宴会活动单。"},{"en":"The BEO says the room should be set up classroom-style.","zh":"宴会活动单上写着场地要按教室式布置。"}]}],"synonyms":["hill myna","myna"],"phonetic":"/ˈbiː.oʊ/","extraExplanation":["“beo”作为“八哥/山八哥”的称呼，多见于借词用法（在东南亚语境中更常见），英语里也更常直接说“hill myna”。","“BEO”作为缩写主要用于酒店、宴会、会务行业；在一般英语对话中不常见，但在相关工作场景里非常常用。"]}
{"word":"beode","summary":{"en":"“Beode” isn’t a standard English word; it’s usually a misspelling of “bode,” meaning “to foreshadow; to be a sign of (something future),” often in “bode well/ill.”","zh":"“beode”不是标准英语词，通常是“bode”的拼写错误；“bode”意为“预示、是……的征兆”，常见搭配为“bode well/ill（是好/坏兆头）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not standard) “beode” is usually a misspelling of “bode.”","zh":"（非标准）“beode”通常是“bode”的拼写错误。"},"examples":[{"en":"I think you meant “bode,” as in “That doesn’t bode well.”","zh":"我觉得你想写的是“bode”，比如“That doesn’t bode well（这不是个好兆头）。”"}]},{"partOfSpeech":"vi.","definition":{"en":"to be a sign of something that will happen in the future; to predict (often used with “well” or “ill”).","zh":"预示（未来会发生某事）；是……的征兆（常与“well/ill”连用）。"},"examples":[{"en":"Dark clouds bode ill for our picnic.","zh":"乌云密布，预示我们的野餐可能不顺利。"},{"en":"Her calm attitude bodes well for the interview.","zh":"她冷静的态度预示这次面试会很顺利。"},{"en":"These early results bode trouble for the team.","zh":"这些早期结果预示球队会遇到麻烦。"}]}],"synonyms":["foreshadow","portend","presage","signal"],"phonetic":"/boʊd/","extraExplanation":["“bode”在现代英语里带一点正式/书面语气，最常见的固定搭配是“bode well”（是好兆头）和“bode ill”（是不祥之兆）。","它常用来表达“迹象/征兆”所暗示的未来结果，比“predict”更强调“预示、兆头”的感觉。"]}
{"word":"Beograd","summary":{"en":"Beograd is the Serbian name for Belgrade, the capital city of Serbia.","zh":"Beograd 是贝尔格莱德的塞尔维亚语名称，指塞尔维亚的首都。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Belgrade—the capital and largest city of Serbia (its local/Serbian name is Beograd).","zh":"贝尔格莱德——塞尔维亚的首都和最大城市（当地/塞尔维亚语名称为 Beograd）。"},"examples":[{"en":"I’m flying to Beograd (Belgrade) for a business trip.","zh":"我要飞去 Beograd（贝尔格莱德）出差。"},{"en":"Beograd lies where the Sava River meets the Danube.","zh":"贝尔格莱德位于萨瓦河与多瑙河交汇处。"}]}],"synonyms":["Belgrade"],"phonetic":"/ˈbeɪoʊɡrɑːd/","extraExplanation":["“Beograd”在塞尔维亚语中由“beo-”（白色的）和“grad”（城市）组成，意思是“白城”。英语里更常用名称是“Belgrade”，在旅行、历史与新闻语境中也常见。"]}
{"word":"beon","summary":{"en":"“Be on” commonly means “turned on/working,” “scheduled or showing,” or “happening.” It can also mean “wearing.”","zh":"“be on” 常指“开着/在运转”、“（节目或活动）安排在进行/正在播出”或“正在发生”；也可指“穿着/戴着”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to be switched on; to be functioning (for lights, devices, machines)","zh":"（灯、设备、机器等）开着；在运转"},"examples":[{"en":"Is the air conditioner on? It feels cooler in here.","zh":"空调开着吗？这里感觉更凉快。"},{"en":"Leave the porch light on at night.","zh":"晚上把门廊的灯开着。"}]},{"partOfSpeech":"phrase","definition":{"en":"to be scheduled or shown/featured (for TV, events, performances)","zh":"（节目/活动/演出等）安排在进行；正在播出/上演"},"examples":[{"en":"What’s on TV tonight?","zh":"今晚电视上播什么？"},{"en":"The meeting is on for Monday at 10 a.m.","zh":"会议定在周一上午10点进行。"}]},{"partOfSpeech":"phrase","definition":{"en":"to be happening; to be underway (often used in questions)","zh":"正在发生；在进行（常用于提问）"},"examples":[{"en":"What’s going on? What’s on?","zh":"怎么了？发生什么事了？"},{"en":"There’s a festival on in the park this weekend.","zh":"这周末公园里有个节庆活动在举行。"}]},{"partOfSpeech":"phrase","definition":{"en":"to be wearing (clothes, accessories)","zh":"穿着；戴着"},"examples":[{"en":"She has a red coat on.","zh":"她穿着一件红色外套。"},{"en":"Do you have shoes on?","zh":"你穿鞋了吗？"}]}],"synonyms":["be switched on","be operating","be scheduled","be happening","take place"],"phonetic":"/bi ɑn/","extraExplanation":["“beon” 不是标准英文单词，通常是把短语 “be on” 连写了。写作时一般要分开：be on。","口语里 “on” 常和 “be” 连读，听起来像一个词；但正式写作仍建议分开写。"]}
{"word":"beonotan","summary":{"en":"“beonotan” isn’t a standard word; it likely refers to the phrase “be on,” meaning “happening/operating,” “wearing,” or “being alert/performing well.”","zh":"“beonotan”不是标准单词；它可能指短语“be on”，意思包括“正在发生/运行”“穿着/覆盖着”“保持警惕/状态很好”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Not a standard English word.) If you meant “be on,” it commonly means to be happening or operating, or (of a person) to be performing/acting in an energetic, effective way.","zh":"（不是标准英语单词。）如果你想表达的是“be on”，常见意思是：正在发生/正在运行；或（指人）状态很好、表现很“在线”。"},"examples":[{"en":"The meeting is on at 3 p.m.","zh":"会议在下午三点举行。"},{"en":"The lights are on, so someone must be home.","zh":"灯亮着，所以一定有人在家。"},{"en":"She was really on tonight—her jokes were perfect.","zh":"她今晚状态特别好——笑话讲得恰到好处。"}]},{"partOfSpeech":"phrase","definition":{"en":"“be on” can also mean to wear or have something covering your body or a surface.","zh":"“be on”也可以表示“穿着/戴着”，或“覆盖在……上”。"},"examples":[{"en":"He has a jacket on because it’s cold.","zh":"他穿着外套，因为天气冷。"},{"en":"There’s snow on the roof.","zh":"屋顶上有雪。"}]},{"partOfSpeech":"phrase","definition":{"en":"In informal warnings, “be on” (often “be on your guard”) can mean to be alert and ready for possible trouble.","zh":"在口语警告中，“be on”（常见于“be on your guard”）可表示保持警惕，提防麻烦。"},"examples":[{"en":"Be on your guard when you share personal information online.","zh":"在网上分享个人信息时要保持警惕。"}]}],"synonyms":["happen","take place","operate","run","be happening","be active"],"phonetic":"bi ɑn","extraExplanation":["“beonotan”看起来像把多个词连在一起或拼写错误。你想查的是哪一个？常见接近的表达有：\n1) be on（在进行/开着/状态在线）\n2) be on to (someone)（察觉、识破）\n3) notation（记号法；标记法）\n你可以告诉我你看到它的句子或上下文，我能更准确地解释。"]}
{"word":"beor","summary":{"en":"“beor” is an archaic Old English word meaning “beer.”","zh":"“beor”是古英语中的古词，意思是“啤酒”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic/Old English) beer; a fermented drink made from grain, similar to modern beer or ale.","zh":"（古英语/古词）啤酒；由谷物发酵制成的酒精饮料，类似现代的啤酒或艾尔（ale）。"},"examples":[{"en":"In some Old English texts, “beor” refers to a drink like beer or ale.","zh":"在一些古英语文本中，“beor”指的是类似啤酒或艾尔（ale）的饮料。"},{"en":"The poet describes warriors celebrating with beor in the hall.","zh":"诗人描写战士们在大厅里饮用“beor”庆祝。"}]}],"synonyms":["beer","ale"],"phonetic":"/bɛr/","extraExplanation":["“beor”主要出现在古英语语境里（大约公元5–11世纪），现代英语里通常不用；现代对应词一般是“beer”。","在史诗或仿古风格的作品中可能会见到（例如受古英语传统影响的奇幻/历史写作）。如果你是在现代对话或写作中想表达“啤酒”，用“beer”最自然。"]}
{"word":"Beora","summary":{"en":"“Beora” is typically a proper name, not a common English word; its meaning depends on where you saw it.","zh":"“Beora”通常是专有名词，并非常见英语词；具体含义取决于你在哪里看到它。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (not a standard modern English vocabulary word). “Beora” is most often used as a personal name, character name, or place name in specific works or communities; its meaning depends on the source.","zh":"专有名词（不是现代英语里的常见词汇）。“Beora”多作为人名、角色名或地名出现在特定作品或社群中；具体含义取决于出处。"},"examples":[{"en":"Beora is the name of a character in this story.","zh":"Beora 是这个故事里一个角色的名字。"},{"en":"I’m not sure how to pronounce Beora—could you say it out loud?","zh":"我不确定 Beora 怎么读——你能念一下吗？"}]}],"phonetic":"/biˈɔrə/","extraExplanation":["“Beora”在常见英语词典里通常查不到，因此更像是专名（人名/地名/作品设定名）。如果你能告诉我它出现的语境（例如哪本书、哪款游戏、哪段文本、或是哪种语言环境），我可以更准确地解释它的来源、含义和更自然的读法。","按英语读音习惯，它可能会被读成类似“bee-OR-uh”（重音在中间一节）或“BEE-uh-ruh”（取决于作者设定/地区口音）。"]}
{"word":"Beore","summary":{"en":"“Before” means earlier than a time/event, earlier in order/position, or previously.","zh":"“Before”表示在某时间/事件之前、在顺序/位置上在前，或表示“以前”。"},"definitions":[{"partOfSpeech":"prep.","definition":{"en":"Earlier than a particular time, event, or moment.","zh":"在（某个时间/事件）之前；早于。"},"examples":[{"en":"Please submit the form before Friday.","zh":"请在周五之前提交表格。"},{"en":"Wash your hands before you eat.","zh":"吃饭前要洗手。"}]},{"partOfSpeech":"prep.","definition":{"en":"Earlier than something or someone in order or position.","zh":"在……前面；在顺序/位置上先于。"},"examples":[{"en":"She comes before me in the lineup.","zh":"在队伍里她站在我前面。"},{"en":"In the alphabet, B comes before C.","zh":"在字母表里，B 在 C 前面。"}]},{"partOfSpeech":"adv.","definition":{"en":"At an earlier time; previously.","zh":"以前；先前。"},"examples":[{"en":"I’ve seen this movie before.","zh":"我以前看过这部电影。"},{"en":"We met before, didn’t we?","zh":"我们以前见过，对吗？"}]},{"partOfSpeech":"conj.","definition":{"en":"Earlier than the time when something else happens.","zh":"在……之前（引导时间状语从句）。"},"examples":[{"en":"Call me before you leave.","zh":"你离开之前给我打电话。"},{"en":"Think carefully before you decide.","zh":"你做决定之前要仔细想想。"}]}],"synonyms":["earlier","previously","prior to"],"phonetic":"/bɪˈfɔr/","extraExplanation":["你输入的“Beore”很可能是拼写错误，正确拼写是 **before**（常见错误：把 *f* 漏掉或位置写错）。","用法小提示：**before + 名词/动名词**（before class / before leaving）；或 **before + 从句**（before you leave）。"]}
{"word":"beorht","summary":{"en":"beorht is an Old English word meaning “bright, shining, glorious.”","zh":"beorht 是古英语词，意思是“明亮的、闪耀的、辉煌的/荣耀的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Old English) bright; shining; splendid; glorious.","zh":"（古英语）明亮的；闪耀的；辉煌的；荣耀的。"},"examples":[{"en":"In Old English poetry, a hero might be praised as beorht, meaning “glorious” or “radiant.”","zh":"在古英语诗歌中，英雄可能被称为 beorht，意思是“荣耀的”或“光辉的”。"},{"en":"The word beorht often described light from the sun, a torch, or gold.","zh":"beorht 常用来描写太阳、火把或黄金发出的光。"}]}],"synonyms":["bright","shining","radiant","glorious"],"phonetic":"/bɛɔrxt/","extraExplanation":["beorht 是古英语（约公元5—11世纪）的词，在现代英语里通常对应 bright（明亮的）。它也常作为人名构词成分出现，表示“光辉/荣耀”，例如 Beorhtwulf（可理解为“光辉的狼”之类的意象性名字）。","古英语里词尾的 -ht 常发成类似“k+h”的摩擦音（接近德语 ich/ach 的感觉），所以它的读音和现代英语的 bright 并不完全一样，但意义联系非常紧密。"]}
{"word":"beorhtian","summary":{"en":"“Beorhtian” is an Old English verb meaning “to shine/become bright” or “to brighten/illuminate.”","zh":"beorhtian 是古英语动词，意思是“发光/变亮”或“使明亮/照亮”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Old English, intransitive) to become bright; to shine or gleam.","zh":"（古英语，不及物）变亮；发光；闪耀。"},"examples":[{"en":"In Old English poetry, “beorhtian” can describe dawn beginning to shine.","zh":"在古英语诗歌中，beorhtian 可用来描写黎明开始发亮。"},{"en":"The sky seemed to beorhtian as the sun rose.","zh":"太阳升起时，天空仿佛渐渐明亮起来。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Old English, transitive) to make something bright; to illuminate or brighten.","zh":"（古英语，及物）使……明亮；照亮；使……增辉。"},"examples":[{"en":"A poet might say the torch beorhtian the hall.","zh":"诗人可能会说火把照亮了大厅。"},{"en":"They used firelight to beorhtian the room.","zh":"他们用火光把房间照亮。"}]}],"synonyms":["brighten","shine","illuminate","glisten","light up"],"phonetic":"/ˈbeɪɔrθiən/","extraExplanation":["“beorhtian” 是古英语（约公元5—11世纪）动词，和形容词 “beorht”（意为“明亮的、辉煌的”）同源。它常出现在古英语宗教文本与诗歌语境中，用来描写“光”的出现（如黎明、火光、神圣之光）。","该词不属于现代英语常用词；现代英语更常用 brighten / illuminate / shine 来表达相同意思。若在阅读《贝奥武夫》等古英语作品或其注释材料时遇到它，可把它理解为“变亮/照亮”。"]}
{"word":"beornan","summary":{"en":"Beornan is an archaic Old English-related form tied to beorn (“man; warrior”), with meaning depending on context (often “(of) the warriors/men”).","zh":"beornan 是与古英语 beorn（“男人；战士”）相关的古体屈折形式，具体含义依语境而定，常可理解为“（战士们/人们）的……”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Old English, archaic) An inflected form related to beorn (“man; warrior; nobleman”), often understood as “(of) the warriors/men,” depending on the sentence.","zh":"（古英语，古体）与 beorn（“男人；战士；贵族”）相关的屈折形式；在句子中常可理解为“战士们/人们的……”，具体含义取决于语境。"},"examples":[{"en":"In Old English poetry, forms like beorn and beornan refer to men or warriors in a heroic setting.","zh":"在古英语诗歌中，像 beorn 和 beornan 这样的形式常用来指“男人”或“战士”，多见于英雄史诗语境。"},{"en":"A translator might gloss beornan as “of the warriors” when it functions like a possessive form.","zh":"当它在语法上起类似所有格的作用时，译者可能会把 beornan 释为“战士们的……”。"}]}],"synonyms":["warrior","man","thane","nobleman"],"phonetic":"/ˈbeɔrnɑn/","extraExplanation":["“beorn”是古英语里常见的诗体用词之一，含义大致是“男子/战士/贵族”。“beornan”看起来像是古英语的屈折变化形式（不同格、数的词尾变化）。因为古英语的语法变化比较复杂，单独看到 beornan 很难给出唯一的现代英语对应，需要结合原句判断它在句中是作主语、宾语，还是表示“……的”。","如果你是在某段文本（例如《贝奥武甫》或仿古英语的作品）里看到 beornan，把原句贴出来我可以帮你准确判定它在那一句中的语法角色与更自然的中文翻译。"]}
{"word":"Beothuk","summary":{"en":"Beothuk: an Indigenous people of Newfoundland who are now extinct; also the language they spoke.","zh":"Beothuk：纽芬兰岛的原住民民族（现已灭绝）；也指他们曾使用的语言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a now-extinct Indigenous people who historically lived on the island of Newfoundland (in present-day Canada) before and during early European contact","zh":"贝奥图克人：历史上居住在纽芬兰岛（今加拿大）的原住民民族，现已灭绝"},"examples":[{"en":"The Beothuk lived mainly along Newfoundland’s coasts and rivers.","zh":"贝奥图克人主要生活在纽芬兰的海岸与河流沿岸。"},{"en":"Many museum exhibits discuss the Beothuk and early European settlement in Newfoundland.","zh":"许多博物馆展览会介绍贝奥图克人以及纽芬兰的早期欧洲殖民。"}]},{"partOfSpeech":"n.","definition":{"en":"the Indigenous language spoken by the Beothuk people (no longer spoken as a living community language)","zh":"贝奥图克语：贝奥图克人曾使用的原住民语言（作为社群活语言已不再使用）"},"examples":[{"en":"Only limited records of the Beothuk survive in notes made by outsiders.","zh":"贝奥图克语仅留下少量由外来者记录的资料。"}]}],"synonyms":["Beothuk people","Beothuk language"],"phonetic":"/ˈbeɪəθʊk/","extraExplanation":["“Beothuk”是纽芬兰岛原住民民族的名称，常见读法接近“BAY-uh-thook”。他们在与欧洲人接触与冲突、资源竞争、疾病等多重因素影响下逐渐消亡，历史上常被用来讨论殖民扩张与文化消失（cultural loss）等主题。","在加拿大语境中，谈到Beothuk时通常会特别强调尊重与准确性：尽量使用可靠史料与社区认可的叙述方式，并避免把“灭绝”当作猎奇话题。"]}
{"word":"beothuk","summary":{"en":"Beothuk refers to an extinct Indigenous people of Newfoundland, and also describes things related to them.","zh":"Beothuk 指纽芬兰岛上一支已灭绝的原住民民族，也可作形容词表示“与其相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a now-extinct Indigenous people who lived on the island of Newfoundland (in present-day Canada), known from early European contact and oral history.","zh":"贝奥图克人：曾居住在纽芬兰岛（今加拿大）的一支原住民民族，现已灭绝；主要通过早期欧洲人接触记录与口述传统为人所知。"},"examples":[{"en":"The Beothuk lived on Newfoundland before large-scale European settlement.","zh":"在大规模欧洲移民到来之前，贝奥图克人生活在纽芬兰岛上。"},{"en":"Many museum exhibits discuss Beothuk culture and the impacts of colonization.","zh":"许多博物馆展览会介绍贝奥图克文化以及殖民带来的影响。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Beothuk people or their language and culture.","zh":"与贝奥图克人（及其语言、文化）有关的；贝奥图克人的。"},"examples":[{"en":"Researchers study Beothuk artifacts to learn about daily life on the island.","zh":"研究者通过研究贝奥图克人的器物来了解岛上的日常生活。"}]}],"synonyms":["the Beothuk people"],"phonetic":"/ˈbiːəθʌk/","extraExplanation":["“Beothuk”常被认为来源于其自称词，含义接近“人/人们”。由于历史上的冲突、疾病与资源被挤压等多重因素，贝奥图克人逐渐消亡；19世纪早期相关记录更为集中。现代讨论这一词时，常出现在加拿大历史、原住民研究、殖民影响与文化遗产保护等语境中。"]}
{"word":"Beothukan","summary":{"en":"Beothukan means “connected with the Beothuk people (and their language/culture),” and it can also refer to the Beothuk language.","zh":"Beothukan 指“与贝奥图克人及其语言/文化相关的”，也可指贝奥图克语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Beothuk (an Indigenous people who historically lived on the island of Newfoundland, Canada), or to their language and culture","zh":"与贝奥图克人（加拿大纽芬兰岛曾经生活的原住民民族）及其语言、文化有关的"},"examples":[{"en":"Researchers study Beothukan history through maps, artifacts, and early written records.","zh":"研究人员通过地图、文物和早期文字记录来研究贝奥图克人的历史。"},{"en":"A museum exhibit included Beothukan tools and information about traditional life in Newfoundland.","zh":"博物馆展览展示了贝奥图克人的工具，并介绍了他们在纽芬兰的传统生活。"}]},{"partOfSpeech":"n.","definition":{"en":"the language of the Beothuk people (now extinct)","zh":"贝奥图克语（已灭绝）"},"examples":[{"en":"Only a small number of Beothukan words were recorded, so the language is not well understood.","zh":"贝奥图克语留下的词汇记录很少，因此人们对这种语言了解不多。"}]}],"synonyms":["Beothuk"],"phonetic":"/biːˈɑːθəkən/","extraExplanation":["“Beothukan”常见于学术写作（历史、人类学、语言学），日常英语里更常用“Beothuk”来指这个民族。","贝奥图克人是纽芬兰岛的原住民民族之一，19世纪初因疾病、冲突与资源压力等因素人口急剧减少；英语资料常提到他们的文化与语言记录非常有限。使用相关词汇时，英语语境中通常会避免把一个民族“浪漫化”或简单化，更倾向于尊重史料与当代原住民议题的敏感性。"]}
{"word":"beothukan","summary":{"en":"Beothukan means “of the Beothuk people” or “a Beothuk person,” referring to an Indigenous people of Newfoundland, Canada.","zh":"Beothukan 指“贝奥图克人的/与贝奥图克人有关的”或“贝奥图克族成员”，贝奥图克人是加拿大纽芬兰岛的原住民族。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Beothuk, an Indigenous people who historically lived on the island of Newfoundland (Canada).","zh":"与贝奥图克人（历史上居住在加拿大纽芬兰岛的原住民）有关的；贝奥图克人的。"},"examples":[{"en":"Researchers study Beothukan history through early records and archaeology.","zh":"研究人员通过早期文献与考古来研究贝奥图克人的历史。"},{"en":"The museum has a small exhibit on Beothukan culture in Newfoundland.","zh":"这家博物馆有一个关于纽芬兰贝奥图克文化的小型展览。"}]},{"partOfSpeech":"n.","definition":{"en":"a member of the Beothuk people.","zh":"贝奥图克人；贝奥图克族成员。"},"examples":[{"en":"Some accounts describe encounters between Europeans and Beothukans.","zh":"一些记载描述了欧洲人与贝奥图克人的接触。"},{"en":"She wrote a report about the life of a Beothukan woman mentioned in historical sources.","zh":"她写了一份报告，介绍历史资料中提到的一位贝奥图克女性的生活。"}]}],"synonyms":["Beothuk"],"phonetic":"/biˈoʊθʊkən/","extraExplanation":["“Beothuk”（常见单复数同形）是更常用的族名形式；“Beothukan”多用作形容词或强调“某个族人”时的名词形式。","贝奥图克人曾生活在纽芬兰岛，19世纪初因殖民扩张、资源冲突、疾病等因素人口急剧减少；常被提到的历史人物包括 Shanawdithit（有时被称为最后一位贝奥图克人）。","在写作中更尊重与准确的表达是：具体到地域与历史语境（如“Beothuk people of Newfoundland”），避免把复杂历史简化成单一原因。"]}
{"word":"Beowawe","summary":{"en":"Beowawe is a place name: a small community in Nevada known for nearby geothermal hot springs/geysers.","zh":"Beowawe 是一个地名：内华达州的小社区，因附近的地热温泉/间歇泉而知名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a small unincorporated community in north-central Nevada, U.S., known for nearby geothermal features (hot springs and geysers).","zh":"美国内华达州北中部的一个非建制小社区，以附近的地热景观（温泉与间歇泉）而闻名。"},"examples":[{"en":"We stopped in Beowawe on our road trip across northern Nevada.","zh":"我们在穿越内华达州北部的公路旅行中在 Beowawe 停了一下。"},{"en":"The area around Beowawe has geothermal activity, including hot springs.","zh":"Beowawe 周边有地热活动，包括温泉。"}]}],"phonetic":"/biːoʊˈwɑːwi/","extraExplanation":["Beowawe 常被当作地名使用（专有名词），所以在句子里通常不加冠词：例如 “in Beowawe / near Beowawe”。","它靠近曾经著名的 Beowawe Geysers（比奥瓦维间歇泉区）。后来由于地热开发与地貌变化，间歇泉活动大幅减弱，但周边仍以地热资源闻名。","发音上可以分成三段来记：bee-oh-WAH-wee（重音常落在 “WAH” 上）。"]}
{"word":"Beowulf","summary":{"en":"Beowulf is an Old English epic poem and also the name of its legendary hero.","zh":"Beowulf既指古英语史诗《贝奥武甫》，也指诗中的传奇英雄贝奥武甫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An Old English epic poem (c. 8th–11th century), one of the most important surviving works of early English literature, about the hero Beowulf battling monsters and a dragon.","zh":"《贝奥武甫》（约8–11世纪），现存最重要的古英语史诗之一，讲述英雄贝奥武甫与怪物及巨龙战斗的故事。"},"examples":[{"en":"We read Beowulf in literature class to learn about early English culture and hero stories.","zh":"我们在文学课上读《贝奥武甫》，以了解早期英国文化与英雄叙事。"},{"en":"The poem Beowulf mixes action with themes like courage, loyalty, and fate.","zh":"史诗《贝奥武甫》既有冒险情节，也探讨勇气、忠诚与命运等主题。"}]},{"partOfSpeech":"n.","definition":{"en":"The legendary hero in the poem, a Geatish warrior known for great strength and bravery.","zh":"史诗中的传奇英雄贝奥武甫——来自盖特人的战士，以强大力量与勇敢闻名。"},"examples":[{"en":"Beowulf defeats Grendel to protect the Danish king’s hall.","zh":"贝奥武甫击败格伦德尔，以保护丹麦国王的大厅。"},{"en":"In many retellings, Beowulf is shown as both a fearless fighter and a responsible leader.","zh":"在许多改写版本中，贝奥武甫既是无畏的战士，也是负责任的领袖。"}]}],"synonyms":["the Beowulf epic","Old English epic","Beowulf (the hero)"],"phonetic":"/ˈbeɪoʊˌwʊlf/","extraExplanation":["“Beowulf”通常按英语习惯大写，因为它既是作品名，也是人物名。","这部作品原文是古英语（Old English），与现代英语差异很大；很多学习者阅读时会使用现代英语译本或对照注释版。","故事背景主要在斯堪的纳维亚地区（如丹麦、瑞典一带），但作品对英语文学传统影响极深，常被视为“英语史诗”的代表。"]}
