{"word":"Beqaa","summary":{"en":"Beqaa usually refers to the Bekaa Valley in eastern Lebanon, a major agricultural and wine-growing region.","zh":"Beqaa通常指黎巴嫩东部的贝卡谷地，是重要的农业与葡萄酒产区。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a valley/region in eastern Lebanon, best known as the Bekaa (Beqaa) Valley, an important farming and wine-producing area between two mountain ranges","zh":"黎巴嫩东部的一个山谷/地区，最常见指贝卡谷地（Beqaa/Bekaa Valley），位于两条山脉之间，是重要的农业与葡萄酒产区"},"examples":[{"en":"They drove through the Beqaa Valley on the way from Beirut to Baalbek.","zh":"他们从贝鲁特去巴勒贝克的路上经过了贝卡谷地。"},{"en":"Many Lebanese wines come from the Beqaa region.","zh":"许多黎巴嫩葡萄酒产自贝卡地区。"}]}],"synonyms":["Bekaa","Bekaa Valley","Beqaa Valley"],"phonetic":"/bəˈkɑː/","extraExplanation":["“Beqaa”也常拼作“Bekaa”或“Biqāʿ”。这是从阿拉伯语转写到英语时产生的不同拼法。","贝卡谷地在历史与文化上很重要：附近有著名的巴勒贝克（Baalbek）古罗马遗址；同时这里也是黎巴嫩最主要的农业带之一。"]}
{"word":"bequalm","summary":{"en":"Becalm means to make something calm, especially the sea or wind; in nautical use, it can also mean leaving a sailboat stuck with no wind.","zh":"Becalm 指“使平静、使安静”，尤指风或海面；航海中也指“使帆船因无风而停滞”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something calm; to quiet or soothe (often used about wind or the sea)","zh":"使……平静；使……安静、缓和（常用于指风或海面）"},"examples":[{"en":"The rain finally stopped and the wind becalmed the sea.","zh":"雨终于停了，风也减弱了，海面平静下来。"},{"en":"Her steady voice becalmed the worried children.","zh":"她沉稳的声音让焦虑的孩子们平静下来。"}]},{"partOfSpeech":"vt.","definition":{"en":"(nautical) to leave a sailing ship without wind so it cannot move; to become stuck in a calm","zh":"（航海）使帆船因无风而无法前进；使（船）困于无风状态"},"examples":[{"en":"The sailboat was becalmed for hours in the middle of the bay.","zh":"那艘帆船在海湾中央无风停滞了好几个小时。"},{"en":"They feared they would be becalmed and miss the tide.","zh":"他们担心会遇到无风停航，从而错过潮汐。"}]}],"synonyms":["calm","soothe","quiet","still"],"phonetic":"/bɪˈkɑːm/","extraExplanation":["你输入的 **bequalm** 很可能是拼写错误；常见正确拼写是 **becalm**。","**becalm** 常见于较书面或航海语境：字面上与风停、海面变平有关，也可比喻“安抚情绪”。相关表达：**calm down**（冷静下来），**smooth the waters**（缓和紧张局面）。"]}
{"word":"bequeath","summary":{"en":"Bequeath means to leave something to someone in a will, or more generally to pass something on to future people.","zh":"Bequeath 指在遗嘱中把财物遗赠给某人，也可泛指把某种传统、影响或问题传给后人。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to leave money, property, or something valuable to someone in a will after you die","zh":"（在遗嘱中）把（金钱、财产或贵重物）遗赠给某人"},"examples":[{"en":"She bequeathed her house to her daughter in her will.","zh":"她在遗嘱中把房子遗赠给了女儿。"},{"en":"He bequeathed his book collection to the local library.","zh":"他把自己的藏书遗赠给了当地图书馆。"}]},{"partOfSpeech":"vt.","definition":{"en":"to pass on something such as a tradition, responsibility, or problem to later people or generations","zh":"把（传统、责任或问题等）传给后人；遗留给后代"},"examples":[{"en":"The leader bequeathed a strong sense of public service to the next generation.","zh":"这位领袖把强烈的公共服务精神传给了下一代。"},{"en":"Past decisions bequeathed serious challenges to the new team.","zh":"过去的决定给新团队遗留下了严重的挑战。"}]}],"synonyms":["leave (in a will)","will","pass on","hand down","grant"],"phonetic":"/bɪˈkwiːθ/","extraExplanation":["“bequeath”常见于较正式的语境，尤其是法律/遗嘱写作中。日常口语里更常用“leave (someone) something in a will”。","词源与“bequest（遗赠物/遗赠）”同源；“bequeath”强调“通过遗嘱正式留下”，语气比“give”更庄重。","文学与历史写作里也常用来谈“无形遗产”（价值观、传统、问题等），例如“bequeath a legacy（留下遗产/影响）”。"]}
{"word":"bequeathable","summary":{"en":"“Bequeathable” means something can be left to someone in a will.","zh":"“bequeathable”指某物可以通过遗嘱遗赠给他人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be legally given to someone in a will after the owner dies (usually property, money, or rights).","zh":"（通常指财产、金钱或权利）可在遗嘱中合法遗赠给他人的；可遗赠的。"},"examples":[{"en":"The house is bequeathable to his children under the terms of the will.","zh":"按照遗嘱条款，这套房子可以遗赠给他的孩子们。"},{"en":"Some digital accounts are not fully bequeathable without special instructions.","zh":"如果没有特别说明，一些数字账户并不完全可遗赠。"}]}],"synonyms":["inheritable","transferable (by will)","assignable (in a will context)"],"phonetic":"bɪˈkwiːðəbəl","extraExplanation":["“bequeathable”是较正式、偏法律/遗产规划语境的词，常见于遗嘱（will）、遗产（estate）、受益人（beneficiary）等话题。","与“inheritable（可继承的）”相比：bequeathable 更强调“通过遗嘱主动遗赠”；inheritable 更强调“依法/按血缘或规则继承”，不一定需要遗嘱。"]}
{"word":"bequeathal","summary":{"en":"Bequeathal means the act of leaving something to someone in a will, or the thing left (a bequest).","zh":"Bequeathal 指在遗嘱中把财产留给某人的“遗赠行为”，也可指遗嘱中留下的“遗赠物/遗产”（相当于 bequest）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of leaving money, property, or something valuable to someone in a will","zh":"（通过遗嘱）遗赠；遗产的指定转让（把财产留给某人这一行为）"},"examples":[{"en":"The bequeathal of the family home was clearly stated in the will.","zh":"遗嘱中清楚写明了老宅的遗赠安排。"},{"en":"After her death, the charity received a generous bequeathal.","zh":"她去世后，这家慈善机构收到了慷慨的遗赠。"}]},{"partOfSpeech":"n.","definition":{"en":"something that is left to someone in a will; a bequest","zh":"遗赠物；遗产（遗嘱中留给某人的具体财物或权益）"},"examples":[{"en":"Each grandchild received a small bequeathal, such as a watch or a ring.","zh":"每个孙辈都得到了一份小遗赠，比如手表或戒指。"},{"en":"The library’s rare books were an important bequeathal to the university.","zh":"图书馆的珍本书是留给大学的一项重要遗赠。"}]}],"synonyms":["bequest","legacy","inheritance"],"phonetic":"/bɪˈkwiːðəl/","extraExplanation":["“bequeathal”比“bequest”更正式、也更少见，法律或遗嘱相关语境中偶尔会用到；日常英语里更常说“bequest”。","相关词：bequeath（动词，遗赠）、inherit（继承；强调继承人得到）、legacy（遗产/遗留；也可指“精神遗产、影响”）。"]}
{"word":"bequeathed","summary":{"en":"“Bequeathed” means “left (something) to someone in a will,” and it can also mean “passed down” in a figurative sense.","zh":"“bequeathed”指“在遗嘱中把（财产）留给某人”，也可引申为“（比喻）传给/留下（传统、影响等）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle of bequeath) To leave money, property, or possessions to someone in a will after you die.","zh":"（bequeath 的过去式/过去分词）在遗嘱中把金钱、财产或物品留给某人。"},"examples":[{"en":"She bequeathed her house to her niece in her will.","zh":"她在遗嘱中把房子留给了外甥女。"},{"en":"He bequeathed a small sum of money to the local library.","zh":"他在遗嘱中把一小笔钱留给了当地图书馆。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) To pass down something non-physical, such as traditions, values, or problems, from one generation to the next.","zh":"（比喻）把传统、价值观或问题等“传给”下一代。"},"examples":[{"en":"They bequeathed a rich musical tradition to their children.","zh":"他们把丰富的音乐传统传给了孩子们。"},{"en":"The war bequeathed deep wounds to the country.","zh":"战争给这个国家留下了深重的创伤。"}]}],"synonyms":["left (to)","willed","passed down","handed down","conferred"],"phonetic":"/bɪˈkwiːðd/","extraExplanation":["“bequeath”是较正式/书面语，常见于法律语境（遗嘱、继承）。日常口语里更常用“leave (someone) something in a will”。","注意拼写里有“quea”，发音重音在第二音节：be-QUEATH。你输入的“bequeathed”常用作过去分词，也常见于被动语态：“was bequeathed to …”。"]}
{"word":"bequeather","summary":{"en":"A bequeather is someone who leaves property or gifts to others in a will.","zh":"bequeather 指在遗嘱中把财产或物品遗赠给他人的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who bequeaths (leaves) money, property, or personal items to someone in a will.","zh":"遗赠人；立遗嘱把财产（或物品）留给他人的人。"},"examples":[{"en":"The bequeather left her library of books to the local school in her will.","zh":"这位遗赠人在遗嘱中把自己的藏书留给了当地学校。"},{"en":"The bequeather named his two children as equal beneficiaries.","zh":"遗赠人指定他的两个孩子为同等受益人。"}]}],"synonyms":["testator","testatrix","will-maker","donor"],"phonetic":"/bɪˈkwiːðər/","extraExplanation":["“bequeather”来源于动词 bequeath（在遗嘱中遗赠）加后缀 -er（表示“做某事的人”）。在法律语境中，更常见、更正式的说法是 testator（男性或泛指立遗嘱者）和 testatrix（女性立遗嘱者，较少用），也常用 “the person who made the will”。"]}
{"word":"bequeathing","summary":{"en":"“Bequeathing” means leaving something to someone in a will, or (figuratively) passing something on to later generations.","zh":"“bequeathing”指通过遗嘱把财产遗赠给某人，也可比喻把传统、观念或问题留给后人。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to leave money, property, or something valuable to someone in a will; to pass something on to the next generation","zh":"（通过遗嘱）把金钱、财产或贵重物品遗赠给某人；把某物传给后代"},"examples":[{"en":"She is bequeathing her house to her two children.","zh":"她将把房子遗赠给她的两个孩子。"},{"en":"He bequeathed a large sum of money to the local library.","zh":"他遗赠给当地图书馆一大笔钱。"},{"en":"The writer bequeathed his notebooks to the university.","zh":"这位作家把自己的笔记本遗赠给了大学。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) to pass on an idea, tradition, or problem to later people or times","zh":"（比喻）把思想、传统或问题留给后人／后世"},"examples":[{"en":"They bequeathed a rich cultural tradition to future generations.","zh":"他们把丰富的文化传统留给了后代。"},{"en":"Past leaders bequeathed serious challenges to the new government.","zh":"过去的领导人给新政府留下了严峻的挑战。"}]}],"synonyms":["leave (in a will)","will","pass on","hand down"],"phonetic":"/bɪˈkwiːðɪŋ/","extraExplanation":["“bequeathing”是动词“bequeath”的现在分词/动名词形式，常见于更正式的法律或书面语境，尤其与“will（遗嘱）”“estate（遗产）”一起出现。","词源上与“be-（使……）+ queath（古英语中与‘说/宣布’相关）”有关，带有“正式宣布/规定把某物留给某人”的语感，因此比“give”更庄重。"]}
{"word":"bequeathment","summary":{"en":"A bequeathment is a gift of money or property left to someone in a will (or, less commonly, the act of doing so).","zh":"bequeathment 指遗嘱中的遗赠（遗赠物）；较少也可指遗赠这一行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Something (usually money or property) that is left to someone in a will; a gift made by will.","zh":"（通常指金钱或财产的）遗赠物；遗嘱中的遗赠。"},"examples":[{"en":"She received a small bequeathment from her aunt’s will.","zh":"她从姨妈的遗嘱中得到了一笔小额遗赠。"},{"en":"The museum used the bequeathment to support new exhibitions.","zh":"博物馆用这笔遗赠来支持新的展览。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of leaving money or property to someone in a will (less common).","zh":"（较少用）立遗嘱将财产遗赠给他人的行为。"},"examples":[{"en":"The bequeathment of his estate was clearly described in the document.","zh":"文件中清楚地描述了他对遗产的遗赠安排。"}]}],"synonyms":["bequest","legacy","inheritance (general)"],"phonetic":"/bɪˈkwiːðmənt/","extraExplanation":["“bequeathment”来自动词“bequeath”（在遗嘱中遗赠）。日常英语里更常说“a bequest”（遗赠物）或直接说“leave something to someone in a will”（在遗嘱中把……留给某人）。","语境多见于法律、遗产规划、慈善捐赠等正式场合；和一般的“gift/ present（礼物）”不同，它强调“通过遗嘱在身后转移财产”。"]}
{"word":"bequeaths","summary":{"en":"“Bequeaths” means formally leaving something to someone in a will, or (more broadly) passing on a legacy.","zh":"“bequeaths”表示在遗嘱中正式遗赠，也可泛指把某种精神或传统遗产传给后人。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to leave money, property, or rights to someone in a will after you die","zh":"（在遗嘱中）遗赠；把（金钱、财产或权利）留给某人"},"examples":[{"en":"She bequeaths her house to her daughter in her will.","zh":"她在遗嘱中把房子遗赠给女儿。"},{"en":"He bequeaths a large sum of money to the local hospital.","zh":"他遗赠了一大笔钱给当地医院。"}]},{"partOfSpeech":"v.","definition":{"en":"to pass something valuable (such as traditions, ideas, or a legacy) on to future generations","zh":"（比喻）把宝贵的事物（如传统、思想或精神遗产）传给后人"},"examples":[{"en":"The author bequeaths a powerful message of hope to readers.","zh":"这位作者把强有力的希望讯息留给读者。"},{"en":"Their grandparents bequeath stories and traditions that shape the family’s identity.","zh":"祖父母传下的故事与传统塑造了这个家庭的身份认同。"}]}],"synonyms":["leave","will","hand down","pass on"],"phonetic":"/bɪˈkwiːðz/","extraExplanation":["“bequeaths”是动词“bequeath”的第三人称单数现在时（he/she/it bequeaths）。在日常表达中，谈遗嘱更常见的说法是“leave (something) to (someone) in a will”。","用法上，“bequeath”语气较正式，常见于法律文件、遗嘱或正式写作；名词形式是“bequest”（遗赠物；遗赠）。"]}
{"word":"bequest","summary":{"en":"A bequest is something left to someone in a will; more broadly, it can mean a valued legacy passed down over time.","zh":"bequest 指在遗嘱中留给他人的遗赠；也可引申为代代相传的宝贵遗产。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Something (money, property, or rights) that a person gives to someone in a will after they die; a gift left in a will.","zh":"（在遗嘱中）遗赠；遗产中的赠与（通常指金钱、财产或权利）。"},"examples":[{"en":"She received a small bequest from her grandmother’s will.","zh":"她从祖母的遗嘱中得到了一笔小额遗赠。"},{"en":"The museum used his bequest to buy new artworks.","zh":"博物馆用他的遗赠购买了新的艺术品。"}]},{"partOfSpeech":"n.","definition":{"en":"A valuable thing (such as traditions, values, or knowledge) passed from the past to the present; a legacy.","zh":"（比喻）流传下来的宝贵事物；精神遗产（如传统、价值观或知识）。"},"examples":[{"en":"Freedom of speech is part of the nation’s bequest to later generations.","zh":"言论自由是这个国家留给后代的一份宝贵遗产。"},{"en":"Her scientific work is a bequest that still shapes medicine today.","zh":"她的科学成果是一份至今仍影响医学的遗产。"}]}],"synonyms":["legacy","inheritance","devise","gift (in a will)"],"phonetic":"/bɪˈkwɛst/","extraExplanation":["“bequest”常出现在法律与正式语境中，尤其是遗嘱（will）相关文件。较口语的说法常用“inheritance”（遗产）或“money/property left to someone in a will”（遗嘱中留给某人的钱/财产）。","近义区分：bequest 通常强调“在遗嘱中明确写明要给某人/某机构的具体赠与”；inheritance 更泛指继承到的财产总和；legacy 可指法律上的遗产，也常用于比喻“精神遗产/影响”。"]}
{"word":"bequests","summary":{"en":"“Bequests” means gifts or property left to someone in a will.","zh":"“bequests”指在遗嘱中留给他人或机构的遗赠（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Money, property, or a gift that someone leaves to a person or organization in their will.","zh":"（遗嘱中的）遗赠；遗产；遗留给某人或机构的财物/礼物"},"examples":[{"en":"In her will, she left several bequests to local charities.","zh":"她在遗嘱中给当地慈善机构留下了几笔遗赠。"},{"en":"The museum used the bequests to buy new artworks.","zh":"博物馆用这些遗赠购买了新的艺术品。"},{"en":"After the lawyer read the will, the family learned about the bequests.","zh":"律师宣读遗嘱后，家人们才知道有哪些遗赠。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of giving or leaving something to someone in a will (less common).","zh":"（较少用）在遗嘱中把某物留给某人的行为"},"examples":[{"en":"The bequests were carefully recorded in the legal documents.","zh":"这些遗赠行为被仔细记录在法律文件中。"},{"en":"His bequests reflected his lifelong values.","zh":"他的遗赠体现了他一生的价值观。"}]}],"synonyms":["inheritance","legacy","gift","donation","endowment"],"phonetic":"/bɪˈkwɛsts/","extraExplanation":["“bequests”是名词复数，单数是“a bequest”。在法律或正式语境里常见，尤其是谈遗嘱（will）、遗产规划（estate planning）时。","相关词：bequeath（vt. 遗赠；遗留）更像“动作/动词”，bequest更像“结果/名词（遗赠之物或条款）”。"]}
{"word":"bequirtle","summary":{"en":"An archaic verb meaning “to dress or cover with a skirt/kirtle.”","zh":"一个古语动词，意思是“给……穿上裙/长裙式衣物”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic) to dress or cover someone in a skirt-like garment; to clothe with a kirtle (a long dress or tunic).","zh":"（古语）给某人穿上裙状衣物；用“kirtle（长裙/束腰外衣）”为某人穿戴。"},"examples":[{"en":"In the old ballad, the lady was bequirtled in green before she entered the hall.","zh":"在那首古老民谣里，那位女士在进入大厅前被穿上了绿色长裙。"},{"en":"The actress was bequirtled for the medieval scene.","zh":"为了中世纪那场戏，女演员被穿上了长裙式服装。"}]}],"synonyms":["clothe","dress","garb","attire"],"phonetic":"/bɪˈkwɝtəl/","extraExplanation":["“be-”是古英语里常见的动词前缀之一，有“使……处于某种状态/给……加上……”的感觉（类似 bedeck=装饰）。","“quirtle”是“kirtle”的旧拼法，指中世纪常见的长裙或束腰外衣。这个词在现代英语中非常少见，多见于仿古文学、历史题材或诗歌语境。"]}
{"word":"bequote","summary":{"en":"“bequote” is a rare literary verb meaning “to quote” or “to fill with quotations.” In modern English, people usually say “quote.”","zh":"“bequote”是很少见的文学用动词，意思是“引用”或“在文本中大量加入引文”。现代英语一般直接用“quote”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(rare, literary) to quote; to supply a text or speech with quotations.","zh":"（罕见，文学用法）引用；在文字或讲话中加入引文/引语。"},"examples":[{"en":"The critic bequoted the poet to support her argument.","zh":"这位评论家引用了那位诗人的话来支持她的论点。"},{"en":"His essay is heavily bequoted, but not always well explained.","zh":"他的文章引用很多，但并不总是解释得很清楚。"}]}],"synonyms":["quote","cite"],"phonetic":"/bɪˈkwoʊt/","extraExplanation":["“bequote”非常少见，多见于较旧或带修辞色彩的写作。现代英语通常直接用“quote”。","词首“be-”在英语里有“使……处于某种状态/赋予……”的感觉（如 befriend, belittle）。因此 bequote 可理解为“用引语来‘装点/赋予’文本”。","如果你想表达“被引用/被引述”，更自然的说法是：be quoted（例如：She was quoted in the newspaper. 她在报纸上被引用了。）"]}
{"word":"beqwete","summary":{"en":"“Bequeath” means to leave something to someone in a will, or to pass down something (like values) to later generations.","zh":"“Bequeath”指在遗嘱中把财物遗赠给某人，也可指把价值观等非物质的东西传给后代。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to leave money, property, or valuable things to someone in a will after you die","zh":"（在遗嘱中）把钱财、财产或贵重物品遗赠给某人"},"examples":[{"en":"She bequeathed her house to her daughter in her will.","zh":"她在遗嘱中把房子遗赠给了女儿。"},{"en":"He bequeathed a large sum of money to a local hospital.","zh":"他在遗嘱中把一大笔钱捐赠（遗赠）给了当地医院。"},{"en":"The author bequeathed his papers to the university library.","zh":"这位作家把自己的手稿资料遗赠给了大学图书馆。"}]},{"partOfSpeech":"vt.","definition":{"en":"to pass on something non-material (such as traditions, ideas, or responsibilities) to future generations","zh":"把（传统、观念、责任等非物质的东西）传给后代；留下（遗产）"},"examples":[{"en":"The older generation bequeathed a strong sense of duty to the young.","zh":"老一辈把强烈的责任感传给了年轻人。"},{"en":"History has bequeathed many lessons to us.","zh":"历史给我们留下了许多教训。"}]}],"synonyms":["leave","will","pass down","hand down"],"phonetic":"/bɪˈkwiːð/","extraExplanation":["你输入的“beqwete”看起来不像常见英语单词；它很可能是拼写错误，最接近的常用词是 **bequeath**（常见于法律/遗嘱语境）。如果你想查的是别的词（比如 *beware*、*beget*、*bequest*），告诉我正确拼写或你想表达的中文意思，我可以再确认。","词源提示：**bequeath** 来自古英语，和“说/声明、交代”有关，所以它常和 *will*（遗嘱）一起出现。名词形式是 **bequest**（遗赠物；遗赠）。"]}
