{"word":"BeV","summary":{"en":"BEV most commonly means a battery electric vehicle; in informal use (often “bev”), it can also mean a beverage.","zh":"BEV 最常指纯电动汽车；在非正式用法中（常写作 bev）也可指饮料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbr.) battery electric vehicle: a car that runs only on electricity stored in a battery (no gasoline engine).","zh":"（缩写）纯电动汽车：只靠电池储存的电能行驶的汽车（没有汽油发动机）。"},"examples":[{"en":"Many cities are adding more charging stations to support BEVs.","zh":"许多城市正在增加更多充电站来支持纯电动汽车。"},{"en":"Compared with hybrids, BEVs produce no tailpipe emissions.","zh":"与混合动力车相比，纯电动汽车没有尾气排放。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, short for “beverage”) a drink, especially in casual speech or writing (often written as “bev”).","zh":"（非正式，beverage 的简写）饮料；（口语/随笔中）一杯喝的东西（常写作 bev）。"},"examples":[{"en":"Let’s grab a bev after class.","zh":"下课后我们去喝点饮料吧。"},{"en":"The menu has snacks and bevs.","zh":"菜单上有小吃和饮料。"}]}],"synonyms":["battery electric vehicle","electric car","beverage","drink"],"phonetic":"/biː iː viː/","extraExplanation":["“BEV”在汽车与新能源领域非常常见，常与“EV（电动车）”“PHEV（插电式混合动力）”“HEV（混合动力）”一起出现：BEV强调“只有电池+电机”，不包含任何燃油发动机。","表示“饮料”的“bev”更偏口语或休闲语境；正式场合建议用完整的“beverage”或直接说“drink”。"]}
{"word":"Bev","summary":{"en":"“Bev” is an informal word for a drink (short for “beverage”) and also a common nickname for Beverly.","zh":"“Bev”既可作“饮料（beverage的缩写）”的非正式说法，也常作人名 Beverly 的昵称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A drink; short for “beverage.”","zh":"（非正式）饮料；“beverage”的缩写。"},"examples":[{"en":"Can I grab a bev before the meeting starts?","zh":"会议开始前我能拿一杯饮料吗？"},{"en":"This café has great bevs—coffee, tea, and smoothies.","zh":"这家咖啡馆的饮料很棒——咖啡、茶和冰沙。"}]},{"partOfSpeech":"n.","definition":{"en":"A person’s nickname (usually for the name Beverly).","zh":"人名昵称（通常是 Beverly 的昵称）。"},"examples":[{"en":"Bev is coming to dinner tonight.","zh":"Bev 今晚来吃晚饭。"},{"en":"Her name is Beverly, but everyone calls her Bev.","zh":"她叫 Beverly，但大家都叫她 Bev。"}]}],"synonyms":["beverage","drink","Beverly (as the full name)"],"phonetic":"/bɛv/","extraExplanation":["“bev”作“饮料”的用法常见于口语、社交媒体、酒吧/咖啡馆点单语境（尤其在北美、澳洲等地更常见）。正式写作中一般用“beverage”或直接写具体饮品名。","作为昵称“Bev”，在英语文化里更常见于中老年群体（因为 Beverly 在20世纪更流行），但现在仍有人使用。"]}
{"word":"Bevan","summary":{"en":"Bevan is mainly a Welsh/UK surname and, less commonly, a masculine given name. In historical/political contexts it may refer to Aneurin Bevan, a key figure behind the NHS.","zh":"Bevan 主要是威尔士/英国常见的姓氏，也较少用作男性名字。在历史或政治语境中，它有时指英国政治人物 Aneurin Bevan（与NHS的建立密切相关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name), most commonly found in Wales and the UK.","zh":"一个姓氏（家族姓），在威尔士和英国较常见。"},"examples":[{"en":"Her last name is Bevan, and her family is originally from Wales.","zh":"她的姓是 Bevan，家族最初来自威尔士。"},{"en":"Mr. Bevan will lead the meeting today.","zh":"Bevan 先生今天将主持会议。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name (first name), usually masculine, used less commonly than the surname.","zh":"一个名字（名），通常为男性名，比作为姓氏更少见。"},"examples":[{"en":"Bevan is his first name, not his last name.","zh":"Bevan 是他的名字，不是姓。"},{"en":"They named their son Bevan to honor a relative.","zh":"他们给儿子取名 Bevan 来纪念一位亲人。"}]}],"phonetic":"/ˈbɛvən/","extraExplanation":["“Bevan”作为姓氏常被认为与威尔士语/威尔士地区有关。","在英国历史与社会政策语境中，Aneurin Bevan（常被称为“Nye Bevan”）非常有名：他在20世纪推动建立英国国家医疗服务体系（NHS）。因此在新闻、历史或政治类英文材料里看到“Bevan”，有时指的就是他或与NHS相关的讨论。","英文里专有名词通常首字母大写：Bevan。作为姓氏时常与称谓连用（Mr./Ms. Bevan）；作为名字时则像普通名一样使用。"]}
{"word":"bevaring","summary":{"en":"Bearing most commonly means your manner/attitude; it can also mean direction (navigation), a machine part (bearing), or relevance/impact (“have a bearing on”).","zh":"bearing 最常指“举止/态度”；也可指“方位（导航）”“轴承（机械）”，或“关系/影响”（have a bearing on）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Your manner, attitude, or the way you carry yourself (how you appear and behave).","zh":"举止；态度；仪态（你表现出来的样子与行为方式）。"},"examples":[{"en":"She spoke with a calm, confident bearing.","zh":"她说话时举止沉稳、自信。"},{"en":"His polite bearing made a good first impression.","zh":"他有礼的仪态给人留下了好印象。"}]},{"partOfSpeech":"n.","definition":{"en":"A direction or position, especially shown by a compass (often used in navigation).","zh":"方向；方位（尤指用罗盘/指南针表示的方向，常用于航海与定位）。"},"examples":[{"en":"The lighthouse was on a bearing of 120 degrees.","zh":"灯塔位于120度方位上。"},{"en":"Take a bearing and check the map.","zh":"先定个方位，再看地图。"}]},{"partOfSpeech":"n.","definition":{"en":"A machine part that supports and reduces friction between moving parts.","zh":"轴承（支撑并减少运动部件摩擦的机械零件）。"},"examples":[{"en":"The wheel made a noise because the bearing was worn out.","zh":"车轮发出噪音，因为轴承磨损了。"},{"en":"This motor needs new bearings.","zh":"这台电机需要更换新的轴承。"}]},{"partOfSpeech":"n.","definition":{"en":"A connection or relevance (often in the phrase 'have a bearing on').","zh":"关系；影响（常见搭配：have a bearing on，意为“与……有关/对……有影响”）。"},"examples":[{"en":"Does this information have any bearing on the decision?","zh":"这条信息对决定有影响吗？"},{"en":"His age has no bearing on his ability to do the job.","zh":"他的年龄与他完成这份工作的能力无关。"}]}],"synonyms":["manner","demeanor","attitude","direction","relevance"],"phonetic":"/ˈbɛrɪŋ/","extraExplanation":["你输入的“bevaring”不是常见英语单词；更可能是把英语“bearing”拼错了（少见拼法会导致查不到）。","常见搭配：\"bearings\"（复数）也可指“方位感/方向感”，如：\"I lost my bearings\"（我迷失方向/一时不知所措）。","词源提示：bearing 来自动词 bear（携带、承受、表现），所以它既能表示“举止（你如何表现）”，也能延伸到“方向”“关系/影响”等含义。"]}
{"word":"Bevash","summary":{"en":"“Bevash” is most likely a name or title; it isn’t a common English dictionary word.","zh":"“Bevash”更可能是人名或称呼；它不是常见的英语词典词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (surname or given name). It is not a common standard English vocabulary word, so its meaning depends on the person, place, brand, or context you mean.","zh":"专有名词（姓氏或名字）。它不是常见的标准英语词汇，因此含义取决于你指的人名、地名、品牌或具体语境。"},"examples":[{"en":"Mr. Bevash will join the meeting at 3 p.m.","zh":"Bevash 先生将于下午三点参加会议。"},{"en":"I’m not sure how to spell Bevash—could you confirm the spelling?","zh":"我不确定 Bevash 怎么拼写——你能确认一下拼写吗？"}]}],"synonyms":["(name; no direct synonyms)"],"phonetic":"/ˈbɛvæʃ/","extraExplanation":["“Bevash”在常见英语词典中不是一个固定词条，更可能是人名/姓氏、公司或品牌名，或某个词的拼写变体。","如果你想查的是某个“真正的英语单词”，你可以提供一句包含它的例句，或告诉我它来自哪里（比如小说、游戏、电影字幕、社交媒体、某个国家/语言），我就能更准确解释。","可能的拼写接近词包括：beverage（饮料）、bevy（一群；大量）、lavish（奢华的），但这需要你提供语境来确认。"]}
{"word":"bevatron","summary":{"en":"Bevatron: a historic high-energy proton accelerator at UC Berkeley used for early particle-physics experiments.","zh":"Bevatron：伯克利建造的历史性高能质子加速器，用于早期粒子物理实验。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large particle accelerator (a type of synchrotron) built at the University of California, Berkeley, in the 1950s, used to speed up protons to very high energies for nuclear and particle-physics experiments","zh":"（比伐特龙）一种大型粒子加速器（同步加速器的一种），20世纪50年代建于美国加州大学伯克利分校，用于将质子加速到极高能量以进行核物理与粒子物理实验"},"examples":[{"en":"The Bevatron played an important role in early high-energy physics research in the United States.","zh":"比伐特龙在美国早期高能物理研究中发挥了重要作用。"},{"en":"Scientists used the Bevatron to collide accelerated protons with targets and study the particles produced.","zh":"科学家用比伐特龙让被加速的质子撞击靶材，并研究产生的粒子。"}]}],"synonyms":["particle accelerator","synchrotron"],"phonetic":"/ˈbiːvəˌtrɑːn/","extraExplanation":["“Bevatron”这个名字来自能量单位“BeV”（billion electron volts，十亿电子伏特，后来常写作GeV）+“‑tron”（常见于加速器名称的后缀）。","它因与1955年反质子（antiproton）的发现相关而闻名，是粒子物理史上的重要设备。","在现代语境里，这个词多出现在科学史、物理教材或博物馆介绍中；日常英语里并不常用。"]}
{"word":"bevatrons","summary":{"en":"Bevatrons are large high-energy particle accelerators used in physics research.","zh":"Bevatrons 指用于物理研究的大型高能粒子加速器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of Bevatron: a large particle accelerator (a type of proton synchrotron) built to speed up charged particles to very high energies for physics research.","zh":"Bevatron 的复数：一种大型粒子加速器（质子同步加速器的一种），用于把带电粒子加速到极高能量以进行物理研究。"},"examples":[{"en":"In the 1950s, bevatrons helped scientists explore the behavior of protons at very high energies.","zh":"在20世纪50年代，bevatrons 帮助科学家研究高能量下质子的行为。"},{"en":"The discovery of the antiproton is often linked to experiments done at the Bevatron, one of the early bevatrons.","zh":"反质子的发现常与在 Bevatron 上进行的实验联系在一起；它是早期的 bevatrons 之一。"}]}],"synonyms":["particle accelerators","synchrotrons","proton synchrotrons"],"phonetic":"ˈbiːvəˌtrɑːn","extraExplanation":["“Bevatron”这个词来自“BeV（十亿电子伏，billion electron volts）+ -tron（常见于电子/粒子装置名称的后缀）”，意思是能把粒子加速到“BeV量级”的装置。","历史上最著名的 Bevatron 建于美国加州大学伯克利分校的劳伦斯伯克利国家实验室，20世纪中期在高能物理发展中非常关键。","日常英语里很少用复数“bevatrons”，更多会写作“Bevatron(s)”或直接说“particle accelerators / synchrotrons”。"]}
{"word":"beveil","summary":{"en":"Beveil is a rare, old-fashioned verb meaning “to veil; to cover or hide as if with a veil.”","zh":"Beveil 是一个罕见的古语动词，意思是“给……蒙上面纱；遮掩”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(rare/archaic) to cover or hide with a veil; to veil.","zh":"（罕见/古语）用面纱遮住；遮掩；使蒙上“面纱”。"},"examples":[{"en":"In old poems, the moon is sometimes described as beveiled by clouds.","zh":"在一些古诗里，月亮有时会被描写成被云“面纱般”遮住。"},{"en":"She beveiled her face before entering the temple.","zh":"她在进入寺庙前用面纱遮住了脸。"}]}],"synonyms":["veil","cover","conceal","shroud","mask"],"phonetic":"/bɪˈveɪl/","extraExplanation":["“beveil”在现代英语里非常少见，多见于较老的文学或仿古写法。日常表达通常用“veil”（遮住）或“cover / conceal”（覆盖/隐藏）。","前缀“be-”在古英语/中古英语里常用于把名词变成动词，表示“使……处于某种状态”（如: becloud = 使被云遮住）。因此“beveil”字面就是“使被面纱遮住”。"]}
{"word":"bevel","summary":{"en":"A bevel is a slanted edge; to bevel means to cut or shape something at an angle.","zh":"bevel 指“斜边/斜面”；作动词表示“把边缘斜切成角度”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a slanted edge or surface cut at an angle (not a 90° corner)","zh":"（边缘或表面）斜切的边；斜面（不是直角的边）"},"examples":[{"en":"The mirror has a bevel around the edge to catch the light.","zh":"这面镜子边缘有一圈斜边，用来反射光线。"},{"en":"Be careful—the bevel on the tile makes the seam look deeper.","zh":"小心，这块瓷砖的斜边会让拼缝看起来更深。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cut or shape an edge so it slopes at an angle","zh":"把……削成斜边；把……斜切"},"examples":[{"en":"They beveled the wood so the pieces fit together smoothly.","zh":"他们把木头削成斜边，让两块更平滑地拼接。"},{"en":"The glass was beveled for a more elegant finish.","zh":"玻璃被斜切处理，使成品更显精致。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become slanted or form a sloping edge","zh":"变成斜的；形成斜边"},"examples":[{"en":"The edge bevels slightly toward the bottom.","zh":"边缘向下方略微倾斜。"}]}],"synonyms":["chamfer","slant","slope","angle","bevel edge"],"phonetic":"/ˈbɛvəl/","extraExplanation":["“Bevel”常见于木工、金属加工、玻璃与平面设计领域：例如“beveled edge（斜边）”能减少尖锐感、提升外观，也能帮助零件更容易对齐拼接。","在设计软件里（如 Photoshop/Illustrator），bevel 也常指“斜面/浮雕”效果，让图形看起来更有立体感。"]}
{"word":"bevel gears","summary":{"en":"Cone-shaped gears for transferring rotation between intersecting shafts.","zh":"用于相交轴之间传递旋转的圆锥形齿轮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Gears with cone-shaped tooth surfaces that transmit rotation between intersecting shafts (often at a 90° angle).","zh":"锥齿轮：齿面呈圆锥形，用于在两根相交的轴之间传递旋转（常见为90°夹角）。"},"examples":[{"en":"A car’s differential uses bevel gears to send power to the wheels.","zh":"汽车差速器使用锥齿轮把动力传到车轮。"},{"en":"Bevel gears are common when the shafts meet at right angles.","zh":"当两根轴成直角相交时，锥齿轮很常见。"},{"en":"If the bevel gears aren’t aligned correctly, the gearbox will be noisy.","zh":"如果锥齿轮对不准，齿轮箱就会很吵。"}]}],"synonyms":["bevel gear","miter gear","angle gear","conical gear"],"phonetic":"/ˈbɛvəl ɡɪrz/","extraExplanation":["工程里常见的锥齿轮类型包括：直齿锥齿轮（straight bevel）、螺旋锥齿轮（spiral bevel）和准双曲面齿轮（hypoid，常用于汽车差速器）。其中“miter gear（等齿数锥齿轮）”是锥齿轮的一种特殊情况。"],"etymology":"“bevel”源自古法语，原指“斜角/斜切”；“gear”来自古诺尔斯语，原意与“装备、装置”相关，后来引申为“齿轮机构”。合起来指“带斜锥形齿面的齿轮”。","mnemonic":["“bevel”≈“斜/倒角（倒角=bevel）”，看到“be-vel”就联想到“斜的边”。","把“bevel”想成“锥形斜面”，锥齿轮的齿面正好是“圆锥斜面”。"]}
{"word":"beveled","summary":{"en":"Beveled describes an edge cut at a slant (a beveled edge). It can also be the past form of “bevel,” meaning to cut an edge at a slant.","zh":"beveled 表示“斜切的、倒角的（有斜面的边）”；也可作动词 bevel 的过去式/过去分词，表示“把边缘加工成斜面（倒角）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having an edge or surface cut at a slant (not a sharp 90° angle), often to make it smoother, safer, or decorative.","zh":"（边缘或表面）做成斜切的、倒角的（不是直角90°），常用于更平滑、更安全或更美观。"},"examples":[{"en":"The mirror has a beveled edge that catches the light nicely.","zh":"这面镜子有倒角边缘，能很好地反光。"},{"en":"Choose a beveled countertop to reduce sharp corners.","zh":"选择带倒角的台面可以减少尖锐的角。"},{"en":"The glass was beveled for a more elegant look.","zh":"玻璃做了斜切倒角，看起来更雅致。"}]},{"partOfSpeech":"v.","definition":{"en":"Past form of “bevel”: to cut or shape an edge so it slopes.","zh":"“bevel”的过去式/过去分词：把边缘切削或加工成斜面（倒角）。"},"examples":[{"en":"The carpenter beveled the door’s edge so it would close smoothly.","zh":"木工把门边倒了角，让门能顺畅关上。"},{"en":"The tile was beveled to create a cleaner seam.","zh":"瓷砖做了倒角处理，使接缝更整齐。"}]}],"synonyms":["chamfered","slanted","angled","tapered"],"phonetic":"/ˈbɛv(ə)ld/","extraExplanation":["“beveled/倒角”常见于装修与设计语境：beveled mirror（倒角镜）、beveled glass（倒角玻璃）、beveled edge（斜切边）、beveled frame（倒角框）。它强调“斜面过渡”，区别于圆弧过渡的 rounded edge（圆角/圆边）。","在印刷与装帧里也会看到相关用法，如 beveled type（有斜面的字体/字模效果）或描述书封、相框边缘的装饰性切面。"]}
{"word":"beveler","summary":{"en":"A beveler is usually a tool for making a slanted, rounded, or smoothed edge; less commonly, it can mean a person who does this work.","zh":"beveler通常指用来做倒角/修斜边的工具；较少情况下也可指从事倒角工作的工匠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tool or machine used to make a bevel (a slanted edge), especially in crafts like leatherworking, woodworking, or bookbinding","zh":"倒角器；斜边修整工具（用于做出斜面边缘，常见于皮革、木工或装订等工艺）"},"examples":[{"en":"She used a beveler to round and smooth the edges of the leather strap.","zh":"她用倒角器把皮革带的边缘修圆并磨顺。"},{"en":"A small beveler helps the corners look clean and professional.","zh":"小型倒角器能让边角看起来更干净、更专业。"}]},{"partOfSpeech":"n.","definition":{"en":"a person whose job is to cut or shape beveled edges (less common)","zh":"做倒角的人；修斜边的工匠（较少见）"},"examples":[{"en":"The beveler finished the edges before the pieces were assembled.","zh":"修斜边的工匠在组装之前完成了边缘处理。"}]}],"synonyms":["edge beveler","beveling tool","chamfer tool"],"phonetic":"/ˈbɛvələr/","extraExplanation":["“bevel”指“斜面/倒角”，常见于手工与制造业：例如木板边缘做斜切以防刮手、皮革边缘倒角以更耐用且更美观。","在皮革工艺里，beveler 往往是手持小工具（像刮削器），用来削掉边缘的锐角；不同尺寸适合不同厚度与弧度的皮革边。"]}
{"word":"bevelers","summary":{"en":"“Bevelers” usually means people who make bevels (slanted edges) or the tools used to create them.","zh":"“Bevelers”通常指制作倒角（斜边）的人，或用于制作倒角的工具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who make or cut bevels (slanted edges), especially in trades like woodworking, metalworking, glasswork, or stone cutting.","zh":"制作或切削倒角/斜边的人，常见于木工、金工、玻璃加工或石材加工等行业。"},"examples":[{"en":"The cabinet bevelers softened the sharp edges so the doors wouldn’t chip.","zh":"橱柜的倒角工把尖锐边缘处理得更圆滑，这样柜门就不容易崩边。"},{"en":"Experienced bevelers can match the same angle on every piece.","zh":"有经验的倒角工能让每一块材料的斜角都保持一致。"}]},{"partOfSpeech":"n.","definition":{"en":"Tools used to create a bevel (a slanted edge), such as a beveling tool or edge beveler.","zh":"用来做倒角/斜边的工具，例如倒角器或修边倒角刀。"},"examples":[{"en":"In leathercraft, bevelers help round the edge before burnishing.","zh":"在皮革工艺中，倒角器会先把边缘修圆，再进行打磨抛光。"},{"en":"The technician switched to a smaller beveler for tight corners.","zh":"技术员换用了更小的倒角工具来处理狭窄的角落。"}]}],"synonyms":["beveling tools","edge bevelers","chamfering tools","chamferers","craftspeople"],"phonetic":"/ˈbɛvələrz/","extraExplanation":["“bevel”指“斜切的边/倒角”，常见于加工工艺中，用来减少锋利边缘、提升安全性和美观度。","在不同领域里“beveler”可能指人（做倒角的人）或工具（倒角器）。如果你是在皮革或金属加工语境中看到它，通常更可能指工具。"]}
{"word":"beveling","summary":{"en":"Beveling is making an edge slanted (a bevel), often by cutting or grinding.","zh":"Beveling 指把边缘加工成斜面（倒角/削斜边），常通过切削或打磨完成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of cutting, grinding, or shaping an edge so it becomes slanted (not a sharp 90° corner); the act of making a bevel","zh":"把边缘切削/打磨成斜面的过程；倒角、削斜边的动作"},"examples":[{"en":"Beveling the tile edges helps them fit together smoothly.","zh":"把瓷砖边缘倒角可以让它们更顺滑地拼接在一起。"},{"en":"The carpenter finished the shelf by beveling the front edge.","zh":"木匠通过给搁板前沿倒角来完成收尾。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing an edge or cut that is slanted (beveled)","zh":"形容边缘或切口是斜面的；已倒角的"},"examples":[{"en":"Use a beveling tool to create a clean, angled edge.","zh":"用倒角工具做出干净的斜边。"},{"en":"The beveling cut makes the joint stronger and neater.","zh":"倒角切口让接合处更牢固也更美观。"}]}],"synonyms":["chamfering","edging","slant-cutting","angling"],"phonetic":"/ˈbɛvəlɪŋ/","extraExplanation":["“beveling”是动词bevel的现在分词/动名词形式，在工艺场景里常当名词用（表示“倒角/削斜边”这道工序）。","美式拼法常见为beveling；英式拼法也常写作bevelling（双写l）。","常见领域：木工、金属加工、瓷砖铺贴、玻璃加工；在设计/印刷软件里，bevel也可指让字或图形呈现“斜面立体效果”的处理。"]}
{"word":"bevelled","summary":{"en":"Bevelled means having a slanted, angled edge; it can also be the past form of “bevel” (to make such an edge).","zh":"bevelled 指“有斜边/倒角的”；也可作动词 bevel 的过去式/过去分词，表示“做倒角”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an edge or surface) cut at a slant (not at a right angle), forming an angled edge.","zh":"（边缘或表面）被切成斜面（不是直角）的；有倒角的。"},"examples":[{"en":"The mirror has a bevelled edge that catches the light.","zh":"这面镜子有倒角边缘，会反射光线。"},{"en":"Use a bevelled chisel to shape the corner neatly.","zh":"用带斜刃的凿子把角落修整得更利落。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “bevel”: to cut or shape an edge to form a sloping surface.","zh":"“bevel”的过去式/过去分词：把边缘切削或加工成斜面（倒角）。"},"examples":[{"en":"The glass was bevelled to make it safer and more decorative.","zh":"玻璃被做了倒角处理，使它更安全也更美观。"},{"en":"She bevelled the wood before painting it.","zh":"她在上漆前先把木头边缘做了倒角。"}]}],"synonyms":["beveled","slanted","angled","chamfered","sloped"],"phonetic":"/ˈbevəld/","extraExplanation":["“bevelled”是英式拼写；美式更常写作“beveled”。两者意思相同。","“bevel/倒角”常见于木工、金属加工、玻璃切割与平面设计（如图片或按钮的斜边效果）。倒角既能减少尖锐边缘带来的危险，也能增加装饰感。"]}
{"word":"beveller","summary":{"en":"Beveller (also spelled beveler) means a person or tool that makes a beveled (slanted) edge.","zh":"beveller（也拼作beveler）指制作斜边/倒角的人或工具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or tool that makes a bevel (a slanted edge) on wood, metal, leather, glass, etc.","zh":"给材料做斜边（倒角）的人；倒角工具（用于木材、金属、皮革、玻璃等）"},"examples":[{"en":"The beveller smoothed the edge so it wouldn’t cut anyone.","zh":"倒角工具把边缘磨平，避免割伤人。"},{"en":"In the workshop, the beveller is used before polishing the final surface.","zh":"在工坊里，通常会先用倒角工具，再进行最后的抛光。"}]},{"partOfSpeech":"n.","definition":{"en":"a craftsperson who decorates or finishes an edge by cutting it at an angle, especially in leatherwork and bookbinding.","zh":"（尤指皮革工艺、装帧）用斜切方式修饰、处理边缘的工匠"},"examples":[{"en":"A skilled beveller can make leather edges look clean and professional.","zh":"熟练的斜边处理工匠能让皮革边缘看起来干净、专业。"},{"en":"The bookbinder used a small beveller to finish the cover neatly.","zh":"装帧师用小型倒角工具把封面边缘收得很整齐。"}]}],"synonyms":["beveler","bevel tool","edge beveller","chamfer tool"],"phonetic":"/ˈbɛvələr/","extraExplanation":["“beveller”是“beveler”的另一种拼写（常见于英式拼写风格），美式英语里更常见“beveler”。两者意思相同，都与“bevel（斜面/倒角）”有关。"]}
{"word":"bevellers","summary":{"en":"“Bevellers” are people or tools that create a beveled (slanted) edge.","zh":"“Bevellers”指给边缘做斜边/倒角的工匠或工具（为 beveller 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or tools that make a bevel (a slanted edge) on a material such as wood, metal, glass, or paper.","zh":"给材料（如木头、金属、玻璃或纸张）做“斜边/倒角”（bevel）的工匠、工具或设备。"},"examples":[{"en":"The cabinet shop’s bevellers smooth the corners so the drawers don’t chip.","zh":"橱柜工坊的倒角工把边角磨顺，这样抽屉就不容易崩口。"},{"en":"In the workshop, bevellers prepared the metal plates before painting.","zh":"在车间里，倒角设备在喷漆前先处理金属板的边缘。"}]},{"partOfSpeech":"n.","definition":{"en":"(Printing/bookbinding) Tools or people who trim the edge of a page or block at an angle for a specific finish.","zh":"（印刷/装帧）把纸张或书块边缘修成斜面的工具或人员，用来做特定的边缘效果。"},"examples":[{"en":"Some older bookbinding methods used bevellers to create angled page edges.","zh":"一些较早的装帧工艺会用修边工具把书页边缘做成斜面。"}]}],"synonyms":["bevelers","chamferers","bevel tools","chamfer tools"],"phonetic":"/ˈbɛvələrz/","extraExplanation":["“bevellers”是“beveller”的复数形式；更常见的基础词是“bevel”（n./v. 斜边；把边缘削成斜面），在木工、金属加工里也常说“chamfer（倒角）”。在实际英语里，人们更常说“beveler/bevel tool/chamfer tool”，而“beveller”偏英式拼写（-ll-）。"]}
{"word":"bevelling","summary":{"en":"“Bevelling” means making a slanted edge (a bevel). It’s the British spelling of “beveling.”","zh":"“bevelling”指把边缘削成斜面（倒角/斜切），是美式“beveling”的英式拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of making an edge or surface slanted (not at a right angle); creating a bevel","zh":"把边缘或表面削成斜面的过程；倒角/斜切"},"examples":[{"en":"The carpenter finished the shelf by bevelling the front edge.","zh":"木匠通过给前沿倒角来完成这块搁板。"},{"en":"Bevelling helps the tiles meet neatly at the corner.","zh":"倒角能让瓷砖在拐角处更整齐地衔接。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “bevel”: making an edge slanted (instead of square)","zh":"“bevel”的现在分词：把边缘削成斜的（而不是直角）"},"examples":[{"en":"He is bevelling the frame so the pieces fit together smoothly.","zh":"他正在给框架倒角，让各部分更顺畅地拼合。"},{"en":"The designer suggested bevelling the letters to make them look more three-dimensional.","zh":"设计师建议把字做成斜边效果，让它们看起来更立体。"}]}],"synonyms":["beveling","chamfering","slanting","angling"],"phonetic":"/ˈbɛvəlɪŋ/","extraExplanation":["“bevelling”是英式拼写；美式更常写作“beveling”。在木工、金属加工、石材/瓷砖收口，以及平面设计与排版（如字体做斜切边、浮雕感）中都很常见。"]}
{"word":"bevelment","summary":{"en":"Bevelment means a slanted edge/surface, or the process/result of making an edge slanted (a bevel).","zh":"Bevelment 指斜边/斜面，或把边缘削成斜面的加工与结果（倒角）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a slanted edge or surface (a bevel), or the act/result of making something slanted at the edge","zh":"斜边；斜面；（把边缘削成斜面的）加工/处理；倒角的结果"},"examples":[{"en":"The mirror’s bevelment caught the light and made the frame look more elegant.","zh":"镜子的斜边反射了光线，让边框看起来更精致。"},{"en":"After the bevelment, the wooden board fit neatly against the corner.","zh":"倒角处理后，木板能整齐地贴合在墙角。"}]}],"synonyms":["bevel","beveled edge","chamfer","slant","slope"],"phonetic":"/ˈbɛvəlmənt/","extraExplanation":["“bevelment”比较偏技术/书面用语，日常英语里更常说“bevel”或“beveled edge”（斜边/倒角边）。常见于木工、金属加工、玻璃工艺、建筑装饰等语境。"]}
{"word":"bevels","summary":{"en":"“Bevels” means slanted edges/cuts, or it can mean “makes a slanted edge” (he/she/it bevels).","zh":"“Bevels”指“斜面/斜边（复数）”，也可作动词表示“（他/她/它）把边缘斜切/倒角”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Slanted or angled edges/cuts (the plural form of “bevel”).","zh":"斜面；斜切边（“bevel”的复数形式）。"},"examples":[{"en":"The carpenter sanded the bevels to make the corners safer to touch.","zh":"木匠把这些斜边打磨光滑，让角更安全、不刮手。"},{"en":"On the frame, the bevels catch the light and look more polished.","zh":"在相框上，这些斜面会反光，看起来更精致。"}]},{"partOfSpeech":"v.","definition":{"en":"Cuts or shapes something to have a slanted edge (third-person singular of “bevel”).","zh":"把……斜切；把……修成斜边（“bevel”的第三人称单数形式）。"},"examples":[{"en":"She bevels the glass edges to reduce sharpness.","zh":"她把玻璃边缘做成斜边，以减少锋利感。"},{"en":"This machine bevels metal pipes before welding.","zh":"这台机器会在焊接前把金属管口倒角（做斜边）。"}]}],"synonyms":["chamfers","slants","angled edges","inclines","slopes"],"phonetic":"/ˈbɛvəl/","extraExplanation":["“Bevel”在木工、金属加工里常对应中文的“倒角/斜切/斜边”。在设计与软件界面中也常见“bevel effect（浮雕/斜面效果）”，指让边缘看起来有立体感。"]}
{"word":"bevenom","summary":{"en":"“Bevenom” is a rare, old-fashioned verb meaning to poison or make something harmful, similar to “envenom.”","zh":"“bevenom”是少见、偏古风的动词，意为“使带毒/使有害”，相当于更常见的“envenom”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to fill with venom; to poison or make harmful (often used in older or literary English).","zh":"使充满毒液；使带毒、使有害（多见于较古老或文学语境）。"},"examples":[{"en":"The snake’s bite was feared because it could bevenom the blood quickly.","zh":"人们害怕那条蛇的咬伤，因为它可能很快使血液带毒。"},{"en":"Harsh words can bevenom a friendship and turn warmth into distrust.","zh":"刻薄的话会毒化一段友谊，把温暖变成不信任。"}]}],"synonyms":["envenom","poison","toxify","corrupt"],"phonetic":"/bɪˈvɛnəm/","extraExplanation":["“bevenom”是较少见、偏古风的动词，意思与更常见的“envenom”非常接近。现代英语里通常用“poison（使中毒）”“envenom（使带毒/使恶化）”或比喻用“poison”来表达“毒化（关系/气氛）”。","词形上可理解为“be-（使成为/使具有）+ venom（毒液）”。在文学里常用于强调某种东西被“灌入毒性”，也可比喻“让情绪、言语、政治气氛变得恶毒”。"]}
{"word":"Bever","summary":{"en":"“Bever” is mainly a proper name (surname/place name) and is often a misspelling of “beaver.”","zh":"“Bever”主要作专有名词（姓氏/地名），也常被用作“beaver（海狸）”的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname), or part of some place names (proper noun).","zh":"姓氏；也可作某些地名的一部分（专有名词）。"},"examples":[{"en":"Dr. Bever will lead the workshop tomorrow.","zh":"贝弗博士明天将主持这场工作坊。"},{"en":"She traced her family history back to the Bever line.","zh":"她把家族史追溯到贝弗这一支系。"}]},{"partOfSpeech":"other","definition":{"en":"Often a misspelling of “beaver,” a large, brown, semi-aquatic rodent known for building dams.","zh":"常见于把“beaver（海狸）”误拼成“Bever”；海狸是一种大型棕色半水生啮齿动物，以筑坝闻名。"},"examples":[{"en":"I think you meant “beaver,” not “Bever.”","zh":"我想你写的是“beaver（海狸）”，不是“Bever”。"},{"en":"We saw a beaver swimming near the riverbank.","zh":"我们看到一只海狸在河岸边游泳。"}]}],"synonyms":["(for the animal) beaver"],"phonetic":"/ˈbiːvɚ/","extraExplanation":["“Bever”本身在英语里不算常见的普通词汇，更多见于姓氏或地名的一部分。","如果你想查的是动物“海狸”，标准拼写是 beaver，读音相同/相近，但拼写多了一个字母 a。","在北美文化里，beaver 常与“勤劳、会建造”的形象联系在一起；加拿大也常用海狸作为象征之一。"]}
{"word":"bever","summary":{"en":"“Bever” is an old or dialect word meaning “a drink/refreshment,” and rarely “to drink.”","zh":"“bever”是较古老或方言用法，意思是“饮料/喝点东西”，也可极少用作动词“喝”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic or dialect) A drink or light refreshment; something to drink (often beer or another beverage).","zh":"（古语或方言）饮料；（常指）一点喝的东西（常为啤酒等）。"},"examples":[{"en":"After the long walk, they stopped at the inn for a bever.","zh":"走了很久之后，他们在小酒馆停下来喝点东西。"},{"en":"He asked if anyone wanted a bever before dinner.","zh":"他问晚饭前有没有人想先喝点饮料。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare) To drink; to take a drink.","zh":"（罕用）喝；饮用。"},"examples":[{"en":"They bevered by the fire to warm up.","zh":"他们在火边喝点东西取暖。"}]}],"synonyms":["drink","beverage","refreshment","tipple"],"phonetic":"ˈbevər","extraExplanation":["“bever”在现代英语中很少见，多出现在较早期的文学作品或英/苏格兰等地的方言语境里。日常表达里通常直接说“a drink / a beverage”。","注意不要和更常见的“beaver”（海狸）混淆；两者拼写很像，但“bever”更偏向“饮料/喝一杯”的旧用法。"]}
{"word":"beverage","summary":{"en":"“Beverage” is a more formal word for a prepared drink (like tea, coffee, juice, soda, or alcohol).","zh":"“Beverage” 是“饮料/饮品”的较正式说法，指茶、咖啡、果汁、汽水或酒精饮品等经过准备供饮用的饮料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A drink (not usually water), especially one that is prepared and meant to be consumed, such as tea, coffee, juice, soda, or alcohol.","zh":"饮料；（通常不指水的）饮品，尤指经过制作、供人饮用的饮料，如茶、咖啡、果汁、汽水或酒精饮品。"},"examples":[{"en":"Complimentary beverages are available in the lobby.","zh":"大堂提供免费饮料。"},{"en":"The restaurant serves hot and cold beverages.","zh":"这家餐厅供应热饮和冷饮。"},{"en":"Alcoholic beverages are not allowed in the dorm.","zh":"宿舍不允许携带酒精饮品。"}]},{"partOfSpeech":"vt.","definition":{"en":"To provide drinks for someone; to supply with a beverage (formal or rare in everyday speech).","zh":"（正式或较少见）为某人提供饮料；给……饮用。"},"examples":[{"en":"Guests were comfortably seated and fully beverage(d) before the show began.","zh":"演出开始前，客人已入座并被妥善提供了饮料。"}]}],"synonyms":["drink","refreshment (often plural: refreshments)","soft drink (non-alcoholic)","bevie (informal, mainly Australian/colloquial)"],"phonetic":"/ˈbɛvərɪdʒ/","extraExplanation":["在美国英语中，beverage 比 drink 更正式，常见于菜单、公告、酒店/航空服务、法律或规定（如“outside beverages not permitted”）。日常口语里通常说 a drink / drinks。","相关常见搭配：hot beverages（热饮）、cold beverages（冷饮）、soft beverages / soft drinks（不含酒精的饮料，常指汽水）、alcoholic beverages（酒精饮品）、beverage menu（饮料单）、beverage station（饮料区）。"]}
{"word":"beveraged","summary":{"en":"“Beveraged” usually means “supplied with drinks” or “having had drinks,” and it can also be the rare past form of the verb “(to) beverage.”","zh":"“beveraged”通常表示“有饮料供给的/喝过饮料的”，也可作较少见的动词“beverage”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Provided with a drink; having had a beverage.","zh":"（较少见）配有饮料的；喝过饮料的。"},"examples":[{"en":"Guests were seated and beveraged before the ceremony began.","zh":"客人入座后，在仪式开始前先享用了饮料。"},{"en":"A well-beveraged crowd cheered loudly at the concert.","zh":"一群喝了不少饮料的观众在演唱会上大声欢呼。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “beverage” used as a verb: to provide (someone) with a drink or drinks.","zh":"作为动词“beverage”的过去式/过去分词：给（某人）提供饮料。"},"examples":[{"en":"The host beveraged the guests with tea and sparkling water.","zh":"主人用茶和气泡水招待了客人。"},{"en":"They were beveraged while they waited for the meeting to start.","zh":"他们在等会议开始时有人提供饮料。"}]}],"synonyms":["served (with drinks)","supplied (with drinks)","refreshed","hydrated","imbibed (more formal)"],"phonetic":"/ˈbɛvərɪdʒd/","extraExplanation":["“beverage”主要是名词（饮料）。把它当动词用（to beverage）在现代英语里比较少见，带点幽默、文艺或“服务行业行话”的感觉。日常更常说：serve drinks / offer drinks / give someone a drink。"]}
{"word":"beverages","summary":{"en":"“Beverages” means drinks (often a formal word), and it can specifically refer to alcoholic drinks in official contexts.","zh":"“Beverages” 指饮料（较正式的说法）；在正式/法律语境中也可特指酒类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Drinks of any kind, especially ones other than water (such as tea, coffee, juice, soda, beer, or wine).","zh":"各种饮料，尤指除水以外的饮品（如茶、咖啡、果汁、汽水、啤酒或葡萄酒）。"},"examples":[{"en":"The hotel offers free beverages in the lobby every afternoon.","zh":"这家酒店每天下午在大堂提供免费饮料。"},{"en":"Outside food and beverages are not allowed in the theater.","zh":"影院内禁止携带外食和饮料。"},{"en":"Would you like a hot or cold beverage?","zh":"你想要热饮还是冷饮？"}]},{"partOfSpeech":"n.","definition":{"en":"Alcoholic drinks, often used in formal or legal contexts.","zh":"酒类饮品（常用于正式或法律语境）。"},"examples":[{"en":"The store sells alcoholic beverages to customers over 21.","zh":"这家商店向21岁以上的顾客出售酒类饮品。"},{"en":"No alcoholic beverages are permitted at this event.","zh":"本活动不允许携带或饮用酒类。"}]}],"synonyms":["drinks","refreshments","soft drinks","alcoholic drinks"],"phonetic":"/ˈbɛvərɪdʒɪz/","extraExplanation":["“Beverage(s)” 比 “drink(s)” 更正式，常见于菜单、告示、规定或合同中（如 “food and beverages”“alcoholic beverages”）。日常口语里更常说 “drinks”。","可数性：通常用复数 “beverages” 表示“（各种）饮料”；单数 “a beverage” 指“一杯/一种饮料”。","词源：来自法语/拉丁语系，含义是“可饮用之物”；因此语气比简单的 “drink” 更偏书面。"]}
{"word":"bevere","summary":{"en":"“bevere” is not standard English; it is usually a misspelling of “severe” (very serious/harsh).","zh":"“bevere” 不是标准英文；通常是把 “severe”（严重的/严厉的）拼错了。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Common misspelling) Usually intended to mean “severe”: very serious, harsh, or intense.","zh":"（常见拼写错误）通常想表达的是 severe：非常严重的、严厉的、强烈的。"},"examples":[{"en":"There’s a spelling mistake: “bevere” → “severe.”","zh":"这里有拼写错误：“bevere” → “severe”。"},{"en":"The storm caused severe damage to the town.","zh":"这场暴风雨对小镇造成了严重破坏。"},{"en":"She has severe allergies, so she carries medicine with her.","zh":"她过敏很严重，所以随身带着药。"}]}],"synonyms":["serious","harsh","intense","critical"],"phonetic":"/səˈvɪr/","extraExplanation":["“bevere” 不是标准英文单词。最常见的目标词是 **severe**（严重的/严厉的）。\n也有人会误打成接近 **beaver**（海狸），但语义通常不匹配：beaver 是名词，指一种动物。可以告诉我你的句子原文，我可以帮你确认你想写的是哪个词。"]}
{"word":"Beveridge","summary":{"en":"Beveridge is mainly a surname; historically it often points to William Beveridge and the influential 1942 Beveridge Report on social welfare in the UK.","zh":"Beveridge主要是一个姓；在历史语境中常指威廉·贝弗里奇以及对英国社会福利影响深远的1942年《贝弗里奇报告》。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname) of English origin; also used in names of notable people","zh":"（英式）姓氏；也用于一些知名人物的名字"},"examples":[{"en":"Sir William Beveridge was a British economist.","zh":"威廉·贝弗里奇爵士是一位英国经济学家。"},{"en":"I’m reading about Beveridge’s ideas on social welfare.","zh":"我在读关于贝弗里奇社会福利思想的内容。"}]},{"partOfSpeech":"other","definition":{"en":"in modern history, often refers to William Beveridge and his 1942 “Beveridge Report,” a key document that shaped the UK welfare state","zh":"在现代历史语境中，常指威廉·贝弗里奇及其1942年的《贝弗里奇报告》，该报告对英国福利国家的形成影响很大"},"examples":[{"en":"The Beveridge Report proposed a system of social insurance.","zh":"《贝弗里奇报告》提出了一套社会保险体系。"},{"en":"Many discussions of the welfare state mention Beveridge.","zh":"许多关于福利国家的讨论都会提到贝弗里奇。"}]}],"phonetic":"ˈbɛvərɪdʒ","extraExplanation":["“Beveridge”作为专有名词，最常见的文化/历史联想是《贝弗里奇报告》（1942）。它提出用“从摇篮到坟墓”的社会保障思路，应对贫困、疾病、无知、肮脏与失业等社会问题，对战后英国公共政策影响深远。"]}
{"word":"Beverie","summary":{"en":"“Beverie” is not a standard word; it is usually a misspelling of “reverie” (a pleasant daydream).","zh":"“Beverie”不是标准英文词；通常是把“reverie”（愉快的遐想/白日梦）拼错了。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard spelling) Usually intended to mean “reverie”: a pleasant daydream; a state of being lost in your thoughts.","zh":"（非标准拼写）通常想表达“reverie”：愉快的白日梦；出神、沉浸在思绪中的状态。"},"examples":[{"en":"She drifted into a reverie while watching the rain.","zh":"她看着雨不知不觉陷入了遐想。"},{"en":"His voice pulled me out of my reverie.","zh":"他的声音把我从出神中拉了回来。"}]}],"synonyms":["reverie","daydream","dreaminess","mind-wandering"],"phonetic":"/ˈrɛvəri/","extraExplanation":["“Beverie”不是常见英语单词，更多时候是把“reverie”（也可拼作“revery”）拼错了。","“reverie”来自法语，常用于较有文学感的表达，比“daydream”更正式、更诗意。"]}
{"word":"Beverle","summary":{"en":"“Beverle” is usually a misspelling or rare variant of the name “Beverly/Beverley,” also used in place names like Beverly Hills.","zh":"“Beverle”多半是“Beverly/Beverley”的少见拼写或误拼，也常见于地名，如 Beverly Hills。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A personal name (given name), usually spelled “Beverly” (also “Beverley” in the UK); “Beverle” is an uncommon spelling variant and may be a misspelling.","zh":"人名（名字），更常见的拼写是“Beverly”（英式也常见“Beverley”）；“Beverle”较少见，可能是非主流拼写或拼写错误。"},"examples":[{"en":"Beverly is my aunt’s name.","zh":"Beverly 是我阿姨的名字。"},{"en":"I think the correct spelling is Beverly, not Beverle.","zh":"我觉得正确的拼写是 Beverly，不是 Beverle。"}]},{"partOfSpeech":"n.","definition":{"en":"A name used for places, most famously in “Beverly Hills” (a city in California) and “Beverly” (a city in Massachusetts).","zh":"也可用于地名，最著名的是“Beverly Hills”（美国加州城市）以及“Beverly”（美国马萨诸塞州城市）。"},"examples":[{"en":"They stayed in Beverly Hills during their trip to Los Angeles.","zh":"他们去洛杉矶旅行时住在比佛利山庄（Beverly Hills）。"},{"en":"Beverly, Massachusetts is north of Boston.","zh":"马萨诸塞州的 Beverly 在波士顿北边。"}]}],"phonetic":"/ˈbɛvərli/","extraExplanation":["“Beverly / Beverley”最早来自英国地名 Beverley，词源与古英语有关，常被解释为“海狸（beaver）+ 溪流/水边（lea/ley）”，大意是“海狸出没的水边/溪流旁的空地”。","在美国文化里，“Beverly Hills”因为电影、电视剧与流行文化而非常有名（常与富裕社区、名人居住地联想在一起）。","如果你是在查单词而不是名字：请确认是否想输入“beverage（饮料）”或“revelry（狂欢）”等相近拼写的词。"]}
{"word":"Beverlee","summary":{"en":"Beverlee is a female first name, a variant spelling of Beverly.","zh":"Beverlee是一个女性名，属于Beverly的变体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feminine given name (a spelling variant of “Beverly”).","zh":"女性名字（“Beverly”的一种拼写变体）。"},"examples":[{"en":"Beverlee moved to Chicago for graduate school.","zh":"Beverlee为了读研究生搬到了芝加哥。"},{"en":"I met Beverlee at a community volunteer event.","zh":"我在一次社区志愿活动中认识了Beverlee。"}]}],"synonyms":["Beverly","Beverley","Bev (nickname)"],"phonetic":"/ˈbɛvɚli/","extraExplanation":["“Beverlee”通常被视为“Beverly”的变体拼写，更常见于20世纪中期的美国命名习惯中。它源自英国地名“Beverley”，词源大致与“海狸（beaver）”和“草地/空地（ley）”有关，因此常被解释为“海狸的草地/河畔草地”之类的意象。","在正式书写中，它属于专有名词（人名），首字母要大写：Beverlee。发音一般与“Beverly”相同。"]}
{"word":"Beverley","summary":{"en":"Beverley is a name (often feminine) and a place name in England; it’s also a common variant spelling of “Beverly.”","zh":"Beverley 可作人名（多为女性名）也可作英国地名；并且是 “Beverly” 的常见拼写变体。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name (usually feminine) and a family name; also a spelling variant of “Beverly.”","zh":"人名（多为女性名，也可作姓）；也是“Beverly”的一种拼写变体。"},"examples":[{"en":"Beverley is starting a new job next Monday.","zh":"Beverley 下周一开始新工作。"},{"en":"I met Beverley at a conference in Chicago.","zh":"我在芝加哥的一场会议上认识了 Beverley。"}]},{"partOfSpeech":"other","definition":{"en":"a place name, especially Beverley, a historic market town in East Yorkshire, England.","zh":"地名；尤指英格兰东约克郡的历史集镇 Beverley。"},"examples":[{"en":"We visited Beverley for its old minster and weekend market.","zh":"我们去 Beverley 参观了古老的大教堂和周末集市。"},{"en":"Beverley is not far from Hull in East Yorkshire.","zh":"Beverley 离东约克郡的赫尔（Hull）不远。"}]}],"synonyms":["Beverly"],"phonetic":"/ˈbɛvərli/","extraExplanation":["“Beverley / Beverly”在英语里常见作人名；两种拼写都正确，但在美国更常见的是“Beverly”，在英国你也会更常看到“Beverley”。","作为地名的 Beverley 位于英格兰，常与当地的 Beverley Minster（贝弗利大教堂）等历史文化景点相关。"]}
{"word":"Beverlie","summary":{"en":"Beverlie is mainly a personal name and a rarer spelling of Beverly; it can also be a surname.","zh":"Beverlie主要用作人名，是Beverly的较少见拼写；也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (usually feminine) and a less common spelling variant of “Beverly.”","zh":"人名（多为女性名），是“Beverly”的较少见拼写变体。"},"examples":[{"en":"Beverlie moved to Chicago for her new job.","zh":"Beverlie为了新工作搬到了芝加哥。"},{"en":"My aunt’s name is Beverlie, but she sometimes writes it as Beverly.","zh":"我阿姨叫Beverlie，但她有时写作Beverly。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname), though less common than the spelling “Beverly/Beverley.”","zh":"姓氏（不如“Beverly/Beverley”常见）。"},"examples":[{"en":"Dr. Beverlie will see you now.","zh":"Beverlie医生现在可以为您看诊了。"},{"en":"The email was signed “Jordan Beverlie.”","zh":"邮件署名为“Jordan Beverlie”。"}]}],"synonyms":["Beverly","Beverley"],"phonetic":"/ˈbɛvərli/","extraExplanation":["“Beverlie/Beverly/Beverley”源自英语地名与姓氏，常被解释为古英语 beofor（海狸）+ lēah（林间空地、草地），因此带有“海狸栖息的林地/草地”的意象。","在英语国家里，“Beverly”在20世纪曾是比较流行的女性名；“Beverlie”属于更个性化的拼写，发音通常不变。"]}
{"word":"Beverly","summary":{"en":"Beverly is used as a personal name and as a place name (notably Beverly Hills).","zh":"Beverly 既可作人名，也常作地名（尤其指比佛利山庄等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (usually for women today, but historically used for men too).","zh":"（人名）“Beverly”，如今多用于女性名，但历史上也曾用于男性。"},"examples":[{"en":"Beverly is my aunt’s name.","zh":"Beverly 是我阿姨的名字。"},{"en":"Beverly studied biology in college.","zh":"Beverly 在大学学的是生物。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name, especially Beverly Hills (a city in Los Angeles County, California) and Beverly (a city/town name in several English-speaking areas, such as Massachusetts in the U.S.).","zh":"（地名）“Beverly”，常见于地名，尤其是美国加州洛杉矶县的 Beverly Hills（比佛利山庄），以及美国马萨诸塞州等地的 Beverly（比佛利）。"},"examples":[{"en":"They stayed at a hotel in Beverly Hills.","zh":"他们住在比佛利山庄的一家酒店。"},{"en":"She grew up in Beverly, Massachusetts.","zh":"她在马萨诸塞州的比佛利长大。"}]}],"synonyms":["Bev (nickname)"],"phonetic":"/ˈbɛvərli/","extraExplanation":["“Beverly”源自英国英格兰的地名，常被解释为与古英语中“beaver（河狸）”相关的词根有关，含有“河狸出没的溪流/水边”之类的意象。后来该地名也发展为英语人名。","在美国文化里，“Beverly Hills”因为影视、名人和奢华生活方式而非常知名，因此“Beverly”在某些语境下会让人联想到“富裕、名流、好莱坞附近”的氛围。"]}
{"word":"beverly","summary":{"en":"Beverly is a proper noun used as a (usually female) first name and as a place name (e.g., Beverly Hills).","zh":"Beverly 是专有名词，可作（多为女性）人名，也可作地名（如 Beverly Hills 比佛利山庄）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name (usually feminine) used in English-speaking countries.","zh":"（多用于女性的）英文名字。"},"examples":[{"en":"Beverly is starting a new job next week.","zh":"Beverly 下周要开始一份新工作。"},{"en":"I met Beverly at a community event.","zh":"我在一次社区活动上认识了 Beverly。"}]},{"partOfSpeech":"other","definition":{"en":"a place name (a town/city/area), especially in the U.S. and the U.K.; often seen in names like Beverly Hills.","zh":"地名（城镇/城市/地区名），在美国和英国都常见；也常见于 Beverly Hills（比佛利山庄）等名称中。"},"examples":[{"en":"They drove through Beverly Hills on their trip to Los Angeles.","zh":"他们去洛杉矶旅行时开车经过了比佛利山庄。"},{"en":"She grew up in Beverly, Massachusetts.","zh":"她在马萨诸塞州的 Beverly 长大。"}]}],"synonyms":["Bev (nickname)"],"phonetic":"/ˈbɛvɚli/","extraExplanation":["“Beverly”最早是地名，来源于古英语，常被解释为“beaver（海狸）+ lea（林间空地/草地）”，大意是“海狸出没的草地/林地”。后来它也被用作人名。","文化提示：在流行文化中，“Beverly Hills”常让人联想到富裕社区与名人生活（如电视剧《Beverly Hills, 90210》），但“Beverly”本身作为名字并不一定带有这种含义。"]}
{"word":"Bevers","summary":{"en":"“Bevers” is most commonly a surname; rarely, it can appear as an archaic plural spelling related to “beaver.”","zh":"“Bevers”最常见是姓氏；少见情况下也可能是与“beaver（河狸）”有关的古体复数拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper noun) A surname (family name).","zh":"（专有名词）姓氏。"},"examples":[{"en":"Dr. Bevers will speak at the conference today.","zh":"Bevers 医生今天将在会议上发言。"},{"en":"I saw the name Bevers on the mailbox.","zh":"我在邮箱上看到了 Bevers 这个姓。"}]},{"partOfSpeech":"n.","definition":{"en":"(Noun, rare/archaic) Plural of “bever,” an old spelling of “beaver” (the animal).","zh":"（名词，少见/古体）“bever”的复数；“bever”是“beaver（河狸/海狸）”的旧拼法。"},"examples":[{"en":"In older texts, you may find bevers instead of beavers.","zh":"在较旧的文本中，你可能会看到 bevers 来代替 beavers。"},{"en":"The river once had many bevers building dams.","zh":"这条河里曾有许多河狸筑坝。"}]}],"synonyms":["(surname) last name","(archaic meaning) beavers"],"phonetic":"/ˈbiːvərz/","extraExplanation":["“Bevers”更常见的用法是姓氏（例如美国或欧洲一些家庭）。如果你是在阅读历史材料，才可能遇到 bever/bevers 这种旧拼法；现代英语通常只用 beaver/beavers。","如果你想表达动物“河狸”的复数，标准写法是 beavers。若你指的是某个地点、人名或品牌的“Bevers”，可以告诉我上下文，我可以帮你确认含义。"]}
{"word":"beverse","summary":{"en":"“Beverse” isn’t standard English; it’s likely a typo for “reverse” or “beverage.”","zh":"“beverse”不是标准英语单词；很可能是把“reverse”或“beverage”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling of “reverse” or “beverage,” depending on context.","zh":"不是标准英语单词；多数情况下是把“reverse（反转/倒车/相反的）”或“beverage（饮料）”拼错了，具体取决于上下文。"},"examples":[{"en":"I can’t find “beverse” in a dictionary—did you mean “reverse” (opposite / to turn back)?","zh":"我在词典里查不到“beverse”——你是不是想写“reverse”（相反的/反转）？"},{"en":"If you meant a drink, the correct word is “beverage,” not “beverse.”","zh":"如果你想表达“饮料”，正确的词是“beverage”，不是“beverse”。"}]}],"phonetic":"/bəˈvɝs/","extraExplanation":["“beverse”常见于输入法误触、听写或拼写混淆。你可以告诉我原句（或你想表达的中文意思），我就能确定你要的是“reverse（反向/颠倒）”“beverage（饮料）”，还是别的词。","快速判断：如果句子里有“方向、顺序、倒车、相反”，多半是 reverse；如果和“喝、饮品、酒水”有关，多半是 beverage。"]}
{"word":"bevesseled","summary":{"en":"Usually intended as “beveled/bevelled”: having a slanted edge; also the past form of “bevel.”","zh":"通常应为“beveled/bevelled（倒角的）”：边缘为斜面；也可作动词“bevel”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard spelling) Usually meant to be “beveled/bevelled”: having an edge cut at a slant (not a perfect right angle).","zh":"（非标准拼写）通常是指“beveled/bevelled（倒角的）”：边缘被切成斜面（不是直角）。"},"examples":[{"en":"The mirror has a beveled edge that catches the light.","zh":"这面镜子有倒角边缘，能反射出光泽。"},{"en":"Use a beveled frame to give the picture a more finished look.","zh":"用倒角相框能让照片看起来更精致。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past form of the verb “bevel”: to cut or shape an edge so it slopes.","zh":"动词“bevel”的过去式/过去分词：把边缘切削或加工成斜面（做倒角）。"},"examples":[{"en":"They beveled the wood so the pieces would fit together neatly.","zh":"他们把木头做了倒角，让各部件能整齐贴合。"},{"en":"The glass was beveled to reduce sharpness around the corners.","zh":"玻璃做了倒角，以减少角落处的锋利感。"}]}],"synonyms":["slanted","chamfered","angled","tapered"],"phonetic":"ˈbɛvəld","extraExplanation":["“bevesseled”在英语里不常见，通常是拼写错误。更常用的拼法是美式“beveled”和英式“bevelled”。","“bevel”（倒角/斜切边）在木工、金属加工、建筑、玻璃与图像设计里很常见：例如“beveled edge（倒角边）”“beveled glass（斜面玻璃）”。"]}
{"word":"bevesselled","summary":{"en":"A rare word meaning “supplied with vessels/veins/channels,” especially “rich in blood vessels.”","zh":"罕见词，意为“具有血管/脉络/管道的”，尤指“血管丰富的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having vessels (especially many blood vessels); well supplied with veins or channels","zh":"有（许多）血管/叶脉/管道的；血管丰富的（也可指叶片纹理明显）"},"examples":[{"en":"The tissue is highly bevesselled, so it heals quickly.","zh":"这块组织血管很丰富，所以愈合得很快。"},{"en":"In botany, a well‑bevesselled leaf often shows clear veins.","zh":"在植物学里，叶片“脉络丰富”时常能看到清晰的叶脉。"}]},{"partOfSpeech":"vt.","definition":{"en":"past form of a rare verb meaning “to furnish or supply with vessels (tubes, veins, channels, containers)”","zh":"罕见动词的过去式/过去分词：使具有管道/血管/脉络；为……配备容器"},"examples":[{"en":"The author described nature as bevesselled with rivers and streams.","zh":"作者描写大自然被河流与溪涧“布满脉络”。"}]}],"synonyms":["vascularized","veined","well supplied","laced (with)"],"phonetic":"/biˈvɛsəld/","extraExplanation":["“bevesselled”非常少见，多出现在较文学化或专业化（如植物学、解剖学）语境里，用来强调“像血管/脉络一样纵横分布”。日常英语更常用 vascularized（血管丰富的）、veined（有叶脉/纹理的）、laced with…（布满……）等表达。","前缀 be- 在英语里有“使成为/使具有/使布满”的感觉（如 bedecked“装饰着的”、beloved“被深爱的”）。因此 bevesselled 可以理解为“被‘血管/管道’化、布满脉络”。"]}
{"word":"beveto","summary":{"en":"Veto means the official power or act of stopping something from being approved, and it can also mean to officially reject something.","zh":"Veto 指“否决权/否决”，即用正式权力阻止某事获批或正式拒绝通过某事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(noun) An official power or decision to stop a plan, law, or action from being accepted or happening.","zh":"（名词）否决权；否决（指用正式权力阻止某项计划、法律或行动通过或实施）。"},"examples":[{"en":"The president used a veto to block the bill.","zh":"总统用否决权阻止了这项法案。"},{"en":"The proposal failed because of a veto from one member.","zh":"由于一名成员的否决，这项提案未能通过。"}]},{"partOfSpeech":"vt.","definition":{"en":"(verb, transitive) To officially refuse to accept or allow something (such as a decision or law).","zh":"（及物动词）否决；正式拒绝通过或不允许某事（如决定或法律）。"},"examples":[{"en":"The governor vetoed the new tax plan.","zh":"州长否决了新的税收计划。"},{"en":"Any country can veto the resolution.","zh":"任何国家都可以否决该决议。"}]}],"synonyms":["reject","block","forbid","disallow"],"phonetic":"/ˈviːtoʊ/","extraExplanation":["“beveto”本身不是常见英文单词，最可能是把 **veto** 拼错了。","**veto** 源自拉丁语，原意接近“我禁止”。在政治与国际关系语境中很常见：例如美国总统可以 veto 国会法案；联合国安理会常说某国“use/has a veto”（拥有/行使否决权）。常见搭配：**use/exercise a veto**（行使否决权），**veto power**（否决权），**veto a bill**（否决法案）。"]}
{"word":"bevie","summary":{"en":"“bevie” usually means an informal “drink” (often alcohol) in Scottish English; sometimes it’s a nonstandard spelling of “bevy.”","zh":"“bevie”通常在苏格兰英语里表示口语化的“饮料/喝一杯”（常指酒）；有时也被当作“bevy（一群/许多）”的非标准拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scottish, informal) a drink, especially an alcoholic drink; short for “beverage.”","zh":"（苏格兰英语，非正式）饮料，尤指酒精饮料；相当于“beverage”的简写/昵称。"},"examples":[{"en":"Let’s go out for a bevie after work.","zh":"下班后我们去喝一杯吧。"},{"en":"He had a couple of bevies with his friends at the pub.","zh":"他在酒吧和朋友喝了几杯。"}]},{"partOfSpeech":"n.","definition":{"en":"A less common spelling people use when they mean “bevy” (a group or large number of something).","zh":"一种不太常见的拼写；有时人们其实想写“bevy”（一群/许多）。"},"examples":[{"en":"I saw a bevie of tourists outside the museum. (Often written: “a bevy of tourists.”)","zh":"我看到博物馆外有一大群游客。（更常写作：a bevy of tourists。）"}]}],"synonyms":["drink","beverage","(for “bevy” sense) crowd","group","flock"],"phonetic":"/ˈbɛvi/","extraExplanation":["“bevie”主要出现在苏格兰口语/书面网络用语里，语气随意，常用于朋友间邀约喝酒。","如果你想表达“很多/一群”，标准拼写通常是“bevy”。在正式写作中建议用“beverage”（饮料）或“bevy”（一群/许多），避免让读者困惑。"]}
{"word":"Bevier","summary":{"en":"Bevier is usually a proper noun: a U.S. surname or a place name (notably a town in Missouri).","zh":"Bevier 通常是专有名词：美国常见的姓氏，或地名（尤其是密苏里州的一个城镇）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surname (family name), most commonly found in the United States.","zh":"一个姓氏（家族姓），在美国较常见。"},"examples":[{"en":"My history teacher’s last name is Bevier.","zh":"我历史老师的姓是 Bevier。"},{"en":"The letter was signed by Dr. Bevier.","zh":"这封信由 Bevier 医生署名。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name, especially Bevier, Missouri (a small city in the U.S.).","zh":"一个地名，尤其指美国密苏里州的 Bevier（一个小城）。"},"examples":[{"en":"She grew up in Bevier, Missouri.","zh":"她在密苏里州的 Bevier 长大。"},{"en":"The museum keeps records of coal mining near Bevier.","zh":"这家博物馆保存着 Bevier 附近煤矿开采的记录。"}]}],"phonetic":"/ˈbiːviɚ/","extraExplanation":["“Bevier”通常作为专有名词出现（人名/地名），不属于常见英语词汇，因此一般不用于普通句子中作“名词/动词”的词义变化。","作为地名时，Bevier（密苏里州）历史上与煤矿产业有关；在阅读美国地方史或家谱资料时可能会见到。"]}
{"word":"bevies","summary":{"en":"“Bevies” means “groups” or “large numbers,” especially used in a slightly literary style.","zh":"“bevies”指“成群/大批”，语气略偏书面或文学。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “bevy”: a group (especially of birds), or a large number of people or things seen together.","zh":"“bevy”的复数：一群（尤指鸟类），或一大群一起出现的人或事物。"},"examples":[{"en":"A few bevies of quail scattered across the field.","zh":"几群鹌鹑散落在田野里。"},{"en":"The film star arrived with bevies of fans outside the theater.","zh":"电影明星到达时，剧院外聚集着大批粉丝。"}]}],"synonyms":["groups","flocks","crowds","clusters","swarms"],"phonetic":"/ˈbɛviz/","extraExplanation":["“bevy”常见于较书面或文学化的语境，带有“成群结队、看起来很壮观”的感觉。传统上常与鸟类（如quail 鹌鹑）搭配，但现代英语里也常用于人（如fans、reporters）或事物（如questions、options）。"]}
{"word":"bevil","summary":{"en":"“Bevil” is an uncommon/older spelling of “bevel,” meaning a slanted edge or the act of cutting an edge at an angle.","zh":"“bevil”是“bevel”的少见/较旧拼写，表示“斜边/倒角”，或“把边缘斜切成角”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Variant spelling of “bevel”) A slanted edge or a cut made at an angle (not a perfect 90°).","zh":"（“bevel”的异体拼写）斜边；斜切面；把边缘以非直角切成的斜面。"},"examples":[{"en":"The carpenter planed a bevil on the board so the pieces would fit tightly.","zh":"木工把木板边缘刨出一个斜角，让两块木料能更紧密地贴合。"},{"en":"The glass was finished with a small bevil to soften the sharp edge.","zh":"玻璃边缘做了一个小斜角处理，以减少锋利感。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Variant spelling of “bevel”) To cut or shape an edge so it slopes at an angle.","zh":"（“bevel”的异体拼写）把（边缘）斜切；倒角；磨出斜面。"},"examples":[{"en":"Bevil the edge slightly before you paint it.","zh":"上漆前先把边缘稍微倒一下角。"},{"en":"They bevil the stone to create a clean border.","zh":"他们把石头边缘斜切，做出整齐的边界。"}]}],"synonyms":["bevel","chamfer","slant","angle"],"phonetic":"/ˈbɛvəl/","extraExplanation":["“bevil”在现代英语里很少用，更常见的标准拼写是“bevel”。你可能会在旧书、旧工程手册、或方言/历史文本中看到“bevil”。","相关常见搭配：bevel edge（倒角边/斜边）、bevel cut（斜切）、bevel (or bevelled) glass（斜边玻璃）。有时也会见到旧式说法“bevil square”，指一种用来量角或画斜角的木工工具（现代更常写作“bevel square”。）"]}
{"word":"bevillain","summary":{"en":"“bevillain” isn’t a standard word; it likely means “be (a) villain” or relates to “villain” (the bad character).","zh":"“bevillain”不是标准单词；多半表示“当（一个）反派/坏人”，或与“villain（反派）”相关。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Not a standard single word) Most likely a typo or a stylized spelling of the phrase “be villain,” meaning “to be a villain” or “to act like the bad character in a story.”","zh":"（不是标准的单个英文词）更可能是拼写错误或风格化写法，对应短语“be villain”，意思是“成为反派/坏人”或“表现得像故事里的反派”。"},"examples":[{"en":"In the game, you can choose to be villain or be hero.","zh":"在这个游戏里，你可以选择当反派或当英雄。"},{"en":"He joked, “Fine—I’ll be villain this time,” and made a dramatic entrance.","zh":"他开玩笑说：“好吧——这次我来当反派。”然后戏剧性地登场。"}]},{"partOfSpeech":"n.","definition":{"en":"A villain: a bad or evil character in a story; in real life, a person who does very harmful or immoral things.","zh":"villain：故事里的反派/坏人；现实中指做出严重伤害他人或不道德事情的人。"},"examples":[{"en":"The villain tries to stop the hero from saving the city.","zh":"反派试图阻止英雄拯救城市。"},{"en":"The film avoids a simple villain and shows everyone’s motives.","zh":"这部电影避免塑造“脸谱化反派”，而是展现了每个人的动机。"}]}],"synonyms":["be a villain","play the villain","bad guy","antagonist"],"phonetic":"/bi ˈvɪlən/","extraExplanation":["“be villain”在标准英语里更常说“be a villain”（需要冠词a），或者“play the villain”（扮演反派）。“bevillain”如果出现在ID、品牌名、歌名等场景里，可能是刻意合写的风格化写法。"]}
{"word":"bevilled","summary":{"en":"“Bevilled” means having a slanted, beveled edge; it’s also the past form of “bevel.”","zh":"“bevilled”指“带斜边/倒角的”，也可作“bevel（倒角）”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of an edge or surface) cut or shaped at an angle, not at 90°, so it slopes or is chamfered.","zh":"（边缘或表面）被切削或加工成斜角的；非直角的；有倒角的。"},"examples":[{"en":"The mirror has bevilled edges to make it look more elegant.","zh":"这面镜子有斜切的边缘，让它看起来更精致。"},{"en":"A bevilled tabletop edge feels smoother against your arms.","zh":"桌面做成倒角边缘，手臂靠上去会更舒服。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “bevel”: to cut or shape an edge so it slopes.","zh":"“bevel”的过去式/过去分词：把边缘切削或加工成斜面（倒角）。"},"examples":[{"en":"The carpenter bevilled the wood so the pieces would fit together neatly.","zh":"木匠把木头倒了角，这样各块才能严丝合缝。"},{"en":"The glass was bevilled before it was set into the frame.","zh":"玻璃在装入框架前先做了倒角处理。"}]}],"synonyms":["beveled","chamfered","slanted","angled"],"phonetic":"/ˈbɛvəld/","extraExplanation":["“bevilled”是英式拼写；美式更常写作“beveled”。两者意思相同。","常见于木工、金属加工、建筑装饰、玻璃镜面和排版/印刷（如“bevel effect”立体斜边效果）等语境。"]}
{"word":"Bevin","summary":{"en":"Bevin is mainly used as a surname; in historical contexts it often refers to Ernest Bevin, a major British politician after WWII.","zh":"Bevin 主要用作姓氏；在历史语境中常指二战后重要英国政治人物埃内斯特·贝文。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name), used especially in English-speaking countries","zh":"姓氏（家族名字），多见于英语国家"},"examples":[{"en":"Her last name is Bevin.","zh":"她的姓是 Bevin。"},{"en":"Mr. Bevin will call you back this afternoon.","zh":"Bevin 先生今天下午会回你电话。"}]},{"partOfSpeech":"n.","definition":{"en":"Ernest Bevin (1881–1951), a British labor leader and politician who served as Foreign Secretary after World War II","zh":"埃内斯特·贝文（1881–1951），英国工会领袖与政治家，二战后曾任外交大臣"},"examples":[{"en":"Ernest Bevin played an important role in shaping Britain’s postwar foreign policy.","zh":"埃内斯特·贝文在塑造英国战后外交政策方面起了重要作用。"},{"en":"In history class, we discussed Bevin’s influence in postwar Europe.","zh":"在历史课上，我们讨论了贝文对战后欧洲的影响。"}]}],"phonetic":"/ˈbɛvɪn/","extraExplanation":["“Bevin”常见于人名（尤其是姓氏）。如果你在阅读历史材料中看到它，往往指埃内斯特·贝文：他从工会运动崛起，二战期间参与英国劳动力动员，战后作为外交大臣参与欧洲安全格局与同盟关系的重建。"]}
{"word":"bevined","summary":{"en":"“Bevined” means covered with vines (a poetic/literary word).","zh":"“bevined”指“被藤蔓覆盖的/长满藤蔓的”，偏文学用语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with vines; having vines growing over or around something (often used in literary descriptions).","zh":"被藤蔓覆盖的；长满藤蔓的（常见于文学描写）"},"examples":[{"en":"The bevined cottage looked peaceful in the afternoon light.","zh":"那间被藤蔓覆盖的小屋在午后的阳光下显得很宁静。"},{"en":"We walked through a bevined archway into the garden.","zh":"我们穿过一座长满藤蔓的拱门走进花园。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare) To cover or surround with vines.","zh":"（罕见）用藤蔓覆盖；让藤蔓缠绕"},"examples":[{"en":"Over the years, ivy seemed to bevine the old stone wall.","zh":"多年以后，常春藤似乎把那堵老石墙都缠满了。"}]}],"synonyms":["vine-covered","covered in vines","overgrown with vines","ivy-covered"],"phonetic":"/bɪˈvaɪnd/","extraExplanation":["“bevined”多见于描写性文字（诗歌、小说、风景描写）。它由前缀“be-”（表示“使……处于某种状态/覆盖于”）+“vine”（藤蔓）构成，所以字面意思就是“使……长满藤蔓”。现代日常英语里更常用“covered in vines / vine-covered / overgrown with vines”。"]}
{"word":"Bevington","summary":{"en":"Bevington is mainly an English-language surname; in academic contexts it often refers to the Shakespeare scholar/editor David Bevington.","zh":"Bevington 主要是英语中的姓氏；在学术语境中常指莎士比亚研究者/编者 David Bevington。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name), originally English; it may refer to different people, such as the Shakespeare scholar David Bevington.","zh":"一个姓氏（家族姓），起源于英语语境；也可指不同的同姓名人物，例如莎士比亚研究学者 David Bevington。"},"examples":[{"en":"Our professor assigned an essay using Bevington’s edition of Shakespeare’s plays.","zh":"我们的教授要求用贝文顿（Bevington）编的莎士比亚剧作版本来写论文。"},{"en":"In the bibliography, list Bevington as the author or editor exactly as it appears on the title page.","zh":"在参考文献里，把 Bevington 按照扉页上的写法标为作者或编者。"}]}],"synonyms":["(surname)"],"phonetic":"/ˈbɛvɪŋtən/","extraExplanation":["“Bevington”在英语世界里更常见于学术引用，尤其是指美国学者 David Bevington（1931–2019），他编注过多种莎士比亚作品集与教材；在课堂、论文、参考文献中看到该姓的概率较高。","发音上注意重音通常在第一个音节：BEV-ing-ton。"]}
{"word":"Bevinsville","summary":{"en":"Bevinsville: a community/place name in Kentucky, USA.","zh":"Bevinsville：美国肯塔基州的一个社区/地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small unincorporated community (place name) in Floyd County, Kentucky, in the United States.","zh":"（地名）美国肯塔基州弗洛伊德县的一个小型非建制社区（社区名称）。"},"examples":[{"en":"Bevinsville is a quiet community in eastern Kentucky.","zh":"Bevinsville 是肯塔基州东部一个安静的社区。"},{"en":"She grew up near Bevinsville, Kentucky.","zh":"她在肯塔基州 Bevinsville 附近长大。"}]}],"phonetic":"ˈbɛvɪnzˌvɪl","extraExplanation":["“Bevinsville”属于专有名词（地名）。在英文里地名通常首字母大写，使用时常会加上州名或国家来帮助听者/读者定位，例如 “Bevinsville, Kentucky”。","“unincorporated community” 指未设立独立市政政府的社区，通常由县（county）层级提供公共服务。"]}
{"word":"Bevis","summary":{"en":"Bevis is mainly a personal name/surname; it can also refer to the medieval legendary hero Bevis of Hampton.","zh":"Bevis 主要是人名或姓氏；也可指中世纪传奇人物《Hampton 的 Bevis》。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a personal name (given name) and family name (surname), used mainly in English-speaking contexts","zh":"人名（名）或姓氏（姓），主要见于英语语境"},"examples":[{"en":"Dr. Bevis will see you now.","zh":"Bevis 医生现在见你。"},{"en":"Her last name is Bevis.","zh":"她的姓是 Bevis。"}]},{"partOfSpeech":"other","definition":{"en":"Bevis of Hampton: a medieval English romance and legendary hero (a character in old stories), sometimes referenced in literature and history","zh":"《Hampton 的 Bevis》：中世纪英语传奇故事及其英雄人物（古老传说中的角色），有时在文学与历史讨论中被提及"},"examples":[{"en":"The class read a summary of Bevis of Hampton.","zh":"课堂读了《Hampton 的 Bevis》的故事梗概。"},{"en":"Some medieval romances mention Bevis of Hampton as a famous hero.","zh":"一些中世纪传奇故事把 Hampton 的 Bevis 写成著名英雄。"}]}],"phonetic":"/ˈbiːvɪs/","extraExplanation":["“Bevis”通常不是普通词汇，而是专有名词（人名/姓氏）。在英文里写作大写 Bevis；如果你是在句子里看到它，多半是在指某个人。","“Bevis of Hampton”（也写作 “Sir Bevis of Hampton”）属于中世纪骑士传奇（romance）传统，类似亚瑟王传说那类故事；现代英语学习中不常见，但在文学、历史或地名文化讨论中可能出现。"]}
{"word":"bevoiled","summary":{"en":"“Bevoiled” is a rare, poetic word meaning “veiled” or “obscured,” and it is also the past form of “bevoil” (to cover or hide).","zh":"“bevoiled”是较罕见、偏诗意的词，意为“被面纱遮住的/被遮蔽的”，也可作动词“bevoil”的过去式/过去分词（遮盖、隐藏）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/poetic) Covered with a veil; hidden from clear view.","zh":"（罕见/诗意用法）被面纱遮住的；被遮蔽而不清晰的。"},"examples":[{"en":"Her face was bevoiled in the dim light.","zh":"昏暗的光线里，她的脸像是被面纱遮住一般。"},{"en":"The moon hung half-bevoiled by thin clouds.","zh":"月亮半被薄云遮蔽地悬在空中。"}]},{"partOfSpeech":"v.","definition":{"en":"Past form of “bevoil”: to veil or cover; to make something unclear or mysterious.","zh":"“bevoil”的过去式/过去分词：给……蒙上面纱；遮盖；使……变得不清晰或带神秘感。"},"examples":[{"en":"Fog bevoiled the harbor by morning.","zh":"到了早晨，雾气遮蔽了港口。"},{"en":"He spoke in phrases that bevoiled the truth.","zh":"他说话拐弯抹角，把真相遮得不清不楚。"}]}],"synonyms":["veiled","shrouded","obscured","hidden","clouded"],"phonetic":"/bɪˈvɔɪld/","extraExplanation":["“bevoiled”来自古/诗歌风格的动词“bevoil”（be- + veil）。现代英语更常用 veiled / shrouded / obscured。你更可能在文学、宗教或浪漫主义风格的描写里见到它，用来营造“朦胧、含蓄、神秘”的氛围。"]}
{"word":"bevomit","summary":{"en":"“Bevomit” means to vomit on something or someone (a rare, somewhat literary word).","zh":"“bevomit”指在某物或某人身上呕吐（较少见、略偏书面/夸张的用词）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to vomit on (someone or something); to cover with vomit","zh":"在（某人或某物）上呕吐；把……吐得满是呕吐物"},"examples":[{"en":"The baby bevomited my shirt during the flight.","zh":"宝宝在飞行途中吐在我衬衫上了。"},{"en":"The carpet was bevomited, so we had to clean it immediately.","zh":"地毯被吐脏了，所以我们必须立刻清理。"}]}],"synonyms":["vomit on","vomit over","throw up on","puke on"],"phonetic":"/bɪˈvɑmɪt/","extraExplanation":["“bevomit”是比较少见、偏书面/带幽默或夸张语气的动词，日常英语更常说“vomit on/over”或口语“throw up on”。在文学或叙述中用它，往往是为了强调“被吐得一塌糊涂”的画面感。"]}
{"word":"bevomited","summary":{"en":"“Be vomited” means something is thrown up (or, figuratively, spewed out) in the passive voice.","zh":"“be vomited”表示某物“被吐出来”（或比喻“被喷出/倾倒出来”），属于被动结构。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to be expelled from the stomach through vomiting (passive form)","zh":"（被动）被呕吐出来；从胃里被吐出"},"examples":[{"en":"The medicine was be vomited up within minutes.","zh":"药几分钟内就被吐了出来。"},{"en":"Some blood was be vomited after the accident, so they went to the ER.","zh":"事故后吐出了些血，所以他们去了急诊。"}]},{"partOfSpeech":"phrase","definition":{"en":"(figurative, often negative) to be spewed out suddenly in an unpleasant way, especially words, insults, or information","zh":"（比喻，常带贬义）被一股脑儿“喷出/倾倒”出来，尤指粗话、辱骂或令人反感的话"},"examples":[{"en":"Insults were be vomited across the comment section.","zh":"评论区里充满了被“喷”出来的辱骂。"},{"en":"Rumors were be vomited onto social media without any proof.","zh":"毫无证据的谣言被一股脑儿倒到了社交媒体上。"}]}],"synonyms":["be thrown up","be vomited up","be expelled","be spewed out","be spat out"],"phonetic":"/bi ˈvɑmɪtɪd/","extraExplanation":["“be vomited”是被动结构（be + 过去分词），表示“某物被吐出”。在更自然的英语里，常说“be vomited up”（把up加上更口语、更常见），或主动说“Someone vomited it up.”","比喻用法里，vomit带有强烈的厌恶感与攻击性，常用来形容“喷”脏话、恶意言论或令人不适的信息；正式写作中可改用更中性的词，如“spill out / pour out / blurt out”。","拼写提示：标准形式是“vomit”（不是 *vomitted*），过去分词是“vomited”。"]}
{"word":"bevomiting","summary":{"en":"“be vomiting” means “to be throwing up right now,” describing an ongoing action.","zh":"“be vomiting”表示“正在吐/正在呕吐”，强调动作正在进行。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to be in the act of vomiting; to be throwing up (present continuous form).","zh":"正在呕吐；正在吐（现在进行时表达）。"},"examples":[{"en":"She is vomiting, so please bring a bowl and some water.","zh":"她正在呕吐，请拿一个盆和一些水来。"},{"en":"If you are vomiting and can’t keep fluids down, seek medical help.","zh":"如果你一直呕吐、喝不下水，请及时就医。"}]}],"synonyms":["be throwing up","throw up","vomit"],"phonetic":"/bi ˈvɑmətɪŋ/","extraExplanation":["“be vomiting”是“be + V-ing（现在进行时）”结构，强调动作正在发生：I am vomiting / He is vomiting / They are vomiting。","日常口语里更常说“throw up”或“be throwing up”。“vomit”更偏正式或医学场景。","如果你输入的“bevomiting”是连写，标准写法通常分开写成“be vomiting”。"]}
{"word":"bevomits","summary":{"en":"“Bevomits” means “vomits on; covers with vomit,” and it’s a rare, more literary-sounding verb form.","zh":"“Bevomits”表示“吐在……上；用呕吐物弄脏/覆盖”，是较罕见、偏文学化的动词形式。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(rare) to vomit on; to cover something or someone with vomit (3rd person singular present: bevomits).","zh":"（罕见）呕吐在……上；把（某物/某人）吐得满是呕吐物（第三人称单数现在时：bevomits）。"},"examples":[{"en":"The sick passenger bevomits the seat in front of him.","zh":"那位生病的乘客吐在他前面的座位上。"},{"en":"In the story, the monster bevomits the hero’s armor, ruining the shine.","zh":"在故事里，怪物把呕吐物吐到英雄的盔甲上，弄得光泽尽失。"}]}],"synonyms":["vomit on","throw up on","puke on","spew on"],"phonetic":"/bɪˈvɑmɪts/","extraExplanation":["“bevomit”由前缀 be-（表示“使……处于某种状态/使……被……覆盖”，如 bedeck, besmirch）+ vomit 构成，语气更文学化、带夸张或厌恶色彩。现代英语里更常用 vomit on / throw up on / puke on。","这个词较少见，常出现在小说、戏剧或强调画面感的描写中；日常口语里用它会显得刻意或戏谑。"]}
{"word":"Bevon","summary":{"en":"Bevon is mainly used as a personal name (first name or surname), sometimes seen as a variant of Bevan.","zh":"Bevon 主要用作人名（名或姓），有时被视为 Bevan 的拼写变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name).","zh":"男性名字（名）。"},"examples":[{"en":"Bevon is my cousin’s first name.","zh":"Bevon 是我表弟的名字。"},{"en":"Bevon introduced himself at the start of the meeting.","zh":"Bevon 在会议开始时做了自我介绍。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname); sometimes a variant spelling of “Bevan.”","zh":"姓氏；有时是 “Bevan” 的拼写变体。"},"examples":[{"en":"Ms. Bevon will lead the workshop tomorrow.","zh":"Bevon 女士明天将主持工作坊。"},{"en":"The records list the name as Bevon in one place and Bevan in another.","zh":"记录中有的地方写 Bevon，有的地方写 Bevan。"}]}],"synonyms":["Bevan"],"phonetic":"/ˈbɛvən/","extraExplanation":["“Bevon” 多见于英语姓名中，本身不算常见词汇。它有时被视为威尔士姓氏 “Bevan” 的变体；而 “Bevan” 常被认为与威尔士语传统中的父系称呼有关（类似 “son of Evan / Evan 的儿子” 这一类来源）。","发音上多数英语使用者会读作重音在前的 /ˈbɛvən/。不同家庭或地区也可能有略微不同的读法与拼写传统。"]}
{"word":"bevor","summary":{"en":"“Bevor” is a German word meaning “before,” most commonly used as a conjunction to introduce a clause about an earlier event.","zh":"“bevor”是德语里的“在……之前”，最常见作连词，用来引出表示更早发生事件的从句。"},"definitions":[{"partOfSpeech":"conj.","definition":{"en":"(German) before; used to introduce something that happens earlier in time.","zh":"（德语）在……之前；用于引出更早发生的事情。"},"examples":[{"en":"Wash your hands bevor you eat. (Correct German: „Wasch dir die Hände, bevor du isst.“)","zh":"吃饭之前先洗手。（正确德语：Wasch dir die Hände, bevor du isst.）"},{"en":"Bevor we start, do you have any questions? (German: „Bevor wir anfangen, hast du noch Fragen?“)","zh":"开始之前，你还有问题吗？（德语：Bevor wir anfangen, hast du noch Fragen?）"}]},{"partOfSpeech":"prep.","definition":{"en":"(Less common in modern usage) before; used like a preposition in some set phrases or older style.","zh":"（现代较少见）在……之前；在一些固定说法或较旧表达中像介词一样使用。"},"examples":[{"en":"Bevor dem Essen gab es eine kurze Ansprache. (More natural modern German: „Vor dem Essen …“)","zh":"吃饭之前有一段简短讲话。（更自然的现代德语：Vor dem Essen …）"}]}],"synonyms":["vor (before, preposition)","ehe (before; more formal/literary)"],"phonetic":"/bəˈfɔr/","extraExplanation":["“bevor”最常见的用法是连词，后面通常接一个从句（常见结构：bevor + 句子）。例如：Bevor ich gehe, rufe ich dich an.（我走之前会给你打电话。）","如果你只想接名词短语（“在吃饭前”这类），现代德语更常用“vor + 名词”：vor dem Essen（吃饭前）。","别和“vorher”混淆：bevor 常用于连接两个动作/事件；vorher 更像副词，意思是“之前/先前”，常单独用：Ich habe dich vorher gesehen.（我之前见过你。）"]}
{"word":"bevors","summary":{"en":"“Before” means earlier than a time/event, or earlier than something happens; it can be a preposition, conjunction, or adverb.","zh":"“Before”表示“在……之前/以前”，可作介词、连词或副词使用。"},"definitions":[{"partOfSpeech":"prep.","definition":{"en":"earlier than (a time or event); in front of (something)","zh":"在……之前（时间/事件）；在……前面（位置）"},"examples":[{"en":"Please finish your homework before dinner.","zh":"请在晚饭前把作业完成。"},{"en":"He arrived before 8 a.m.","zh":"他在早上8点之前到的。"},{"en":"She stood before the mirror.","zh":"她站在镜子前。"}]},{"partOfSpeech":"conj.","definition":{"en":"earlier than the time when; prior to the moment that","zh":"在……之前（引导时间从句）"},"examples":[{"en":"Wash your hands before you eat.","zh":"吃饭前先洗手。"},{"en":"Think before you speak.","zh":"说话前先想一想。"}]},{"partOfSpeech":"adv.","definition":{"en":"at an earlier time; previously","zh":"以前；先前"},"examples":[{"en":"I’ve seen this movie before.","zh":"我以前看过这部电影。"},{"en":"We didn’t know each other before.","zh":"我们以前不认识。"}]}],"synonyms":["prior to","ahead of","earlier","previously"],"phonetic":"/bɪˈfɔr/","extraExplanation":["“bevors”在英语里不是标准拼写。你可能想写的是：\n1) “before”（最常见）：表示“在……之前”。\n2) “before’s”（较少见）：表示“before 的……/属于 before 的……”，通常只在讨论这个词本身时才会用（例如：the word “before’s” pronunciation）。\n另外，“bevor”是德语，意思也接近英语的“before/以前；在……之前”。"]}
{"word":"bevrage","summary":{"en":"Beverage means “a drink,” often in a more formal or general way than “drink.”","zh":"Beverage 意为“饮料/饮品”，语气通常比 drink 更正式或更概括。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A drink of any kind (often used for drinks other than water, such as tea, coffee, juice, soda, or alcohol).","zh":"饮料；饮品（泛指各种饮用液体，常用于除水以外的饮品，如茶、咖啡、果汁、汽水或酒精饮料）。"},"examples":[{"en":"What beverages do you have—coffee, tea, or juice?","zh":"你们有什么饮料——咖啡、茶还是果汁？"},{"en":"No outside food or beverages are allowed in the theater.","zh":"剧院内禁止携带外来食物或饮料。"},{"en":"They served light snacks and beverages at the meeting.","zh":"会议上提供了简单点心和饮料。"}]}],"synonyms":["drink","refreshment","soft drink"],"phonetic":"/ˈbɛvərɪdʒ/","extraExplanation":["你输入的 **bevrage** 通常是拼写错误；正确拼写是 **beverage**（中间是 **-er-**，不是 **-ra-**）。","词源上，beverage 来自表示“喝”的词根（与 drink 的概念相关）。在日常英文里，它比 drink 更正式、常见于菜单、告示、商务场合（如 food and beverages）。"]}
{"word":"bevue","summary":{"en":"A rare formal word meaning a foolish mistake or blunder.","zh":"较少见的正式用词，指愚蠢的错误或失误。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a foolish mistake; a blunder (a rare, formal word in English, borrowed from French).","zh":"愚蠢的错误；失误（英语中较少见、较正式的词，源自法语）。"},"examples":[{"en":"It was a minor bevue, but it embarrassed the team.","zh":"那只是个小失误，但让团队很尴尬。"},{"en":"The editor apologized for the bevue in the published article.","zh":"编辑为已发表文章中的失误道歉。"},{"en":"Calling her by the wrong name was a social bevue.","zh":"把她叫错名字是一种社交上的失礼/失误。"}]}],"synonyms":["blunder","gaffe","mistake","error","slip"],"phonetic":"/beɪˈvjuː/","extraExplanation":["“bevue”更常见的拼写是法语形式“bêvue”（带长音符号ê）。在现代英语里它很少使用，多见于较正式或带点文艺/讽刺语气的写作。日常表达一般用“mistake / blunder / gaffe”。"]}
{"word":"Bevus","summary":{"en":"“Bevus” is not a common English word; it is usually a proper name or identifier.","zh":"“Bevus”不是常见英文词；通常作为专有名词或标识符使用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English vocabulary word. It is most likely used as a proper name (a person’s name, username, or brand).","zh":"不是标准英文词汇，更常见的用法是作为专有名词（人名、用户名或品牌名）。"},"examples":[{"en":"Bevus is the name on the account, so please message Bevus directly.","zh":"Bevus 是账号上的名字，所以请直接联系 Bevus。"},{"en":"I’m not sure who Bevus is, but the email is signed “Bevus.”","zh":"我不确定 Bevus 是谁，但邮件落款是“Bevus”。"}]}],"phonetic":"/ˈbiːvəs/","extraExplanation":["“Bevus”在常见英语词典里通常查不到。如果你是想查某个相似单词，最常见的可能是 **bevy**（一群；大量），或 **Beavis**（人名/角色名）。\n如果你告诉我它出现的句子或语境（例如：文章、游戏、品牌、聊天记录），我可以更准确判断它的含义和用法。"]}
{"word":"Bevvy","summary":{"en":"“Bevvy” is informal slang for an alcoholic drink (often beer) or a few drinks; it can also mean a group of people, similar to “bevy.”","zh":"“Bevvy”是非正式俚语，多指酒精饮料（常为啤酒）或“喝几杯”；也可指“一群人”，类似“bevy”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an alcoholic drink (especially beer); also used to mean several drinks","zh":"（俚语）酒精饮料（尤指啤酒）；也可指“喝上几杯/多杯酒”"},"examples":[{"en":"Let’s grab a bevvy after work.","zh":"下班后去喝一杯吧。"},{"en":"He had a few bevvies at the pub and took a taxi home.","zh":"他在酒吧喝了几杯，然后打车回家了。"}]},{"partOfSpeech":"n.","definition":{"en":"a group of people (often women), used informally; similar to “bevy”","zh":"（非正式）一群人（常指一群女性）；类似 bevy"},"examples":[{"en":"A bevvy of girls walked into the café, laughing loudly.","zh":"一群女孩笑着走进了咖啡馆。"}]}],"synonyms":["drink","beer","booze (informal)","bevy (group)"],"phonetic":"/ˈbɛvi/","extraExplanation":["“bevvy”多见于英式英语与澳式英语的口语，常带轻松随意的语气；在正式写作中不太使用。","它通常被认为是“beverage（饮料）”的口语缩略/昵称式说法；而“bevy”是更常见的拼写，主要义为“一群（鸟/人，常指女性）”。在口语里两者有时会混用，但“bevvy”更容易让人联想到“喝酒”。"]}
{"word":"bevvy","summary":{"en":"“Bevvy” is an informal word for a drink (often alcohol) or, especially in British English, a bunch/a lot of something.","zh":"“bevvy”是非正式说法，可指饮料（常指酒），也可指“一群/很多”（尤见于英式英语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Informal) A drink, especially an alcoholic drink.","zh":"（非正式）饮料；尤指酒精饮料。"},"examples":[{"en":"Let’s grab a bevvy after work.","zh":"下班后我们去喝一杯吧。"},{"en":"He had a few bevvies and started telling jokes.","zh":"他喝了几杯酒，就开始讲笑话了。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, especially British) A group or a lot of something; a bunch.","zh":"（非正式，尤英式）一群；一堆；许多。"},"examples":[{"en":"A bevvy of reporters waited outside the courthouse.","zh":"一群记者在法院外等着。"},{"en":"They brought a bevvy of snacks for the trip.","zh":"他们为旅行带了一堆零食。"}]}],"synonyms":["drink","beverage","booze","bunch","crowd","lot"],"phonetic":"/ˈbɛvi/","extraExplanation":["“bevvy”是“beverage”的口语缩略说法，常见于英式英语（也能在美式语境里偶尔见到），语气随意、带点俏皮。","第二个意思“a bevvy of …”更偏固定搭配，常用于新闻或叙述中，带有“成群结队/数量不少”的感觉；类似表达还有“a bunch of… / a crowd of… / a flurry of…”等。"]}
{"word":"bevy","summary":{"en":"Bevy means a large, noticeable group (often people); it can also mean a group of female birds such as quail.","zh":"bevy 指“一大群、引人注意的一群”（多指人）；也可指“一群雌鸟（如鹌鹑）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large group of people or things, often seen together (especially in an attractive or noticeable way).","zh":"一大群（人或事物）；常指一群显眼或引人注意的。"},"examples":[{"en":"A bevy of reporters waited outside the courthouse.","zh":"一群记者在法院外等候。"},{"en":"She arrived with a bevy of friends.","zh":"她和一群朋友一起到场。"}]},{"partOfSpeech":"n.","definition":{"en":"A group of female animals (especially birds such as quail) kept together.","zh":"（动物）一群雌性（尤指鹌鹑等鸟类的一群）。"},"examples":[{"en":"We spotted a bevy of quail near the fence.","zh":"我们在篱笆附近看到一群鹌鹑。"}]}],"synonyms":["group","crowd","flock","cluster","collection"],"phonetic":"/ˈbɛvi/","extraExplanation":["“bevy”在现代英语里最常用来表示“一大群”，语气偏书面或带点文学色彩，常见搭配有：a bevy of reporters/beauties/guests.","传统上它也可特指“雌鸟的一群”（如鹌鹑），属于较旧或较专门的用法。"]}

