{"word":"Bexar","summary":{"en":"Bexar is a Texas place name, most commonly referring to Bexar County (San Antonio).","zh":"Bexar 是德州的地名，最常指贝克萨尔县（含圣安东尼奥）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bexar: a county in south-central Texas that includes the city of San Antonio; often seen in addresses and legal/government contexts (e.g., “Bexar County”).","zh":"Bexar：美国德克萨斯州中南部的一个县（贝克萨尔县），包含圣安东尼奥市；常见于地址、法院与政府文件中（如“Bexar County”）。"},"examples":[{"en":"She filed the paperwork at the Bexar County courthouse in San Antonio.","zh":"她在圣安东尼奥的贝克萨尔县法院递交了文件。"},{"en":"The property records are kept by the Bexar County Clerk’s Office.","zh":"房产记录由贝克萨尔县书记官办公室保存。"}]}],"phonetic":"/ˈbɛər/","extraExplanation":["“Bexar”在当地英语里常读作“bear”（/ˈbɛər/），与拼写看起来不太一致；在西班牙语来源中常见写法为“Béxar”。","历史上“San Antonio de Béxar”（圣安东尼奥·德·贝克萨尔）与西班牙殖民时期有关，因此在德州地名与机构名称中保留了这一拼写。"]}
{"word":"Bexhill","summary":{"en":"Bexhill is a seaside town in East Sussex, England (often meaning Bexhill-on-Sea).","zh":"Bexhill 是英国英格兰东萨塞克斯郡的海滨城镇（常指 Bexhill-on-Sea）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A seaside town in East Sussex, England, on the English Channel, known for its beaches and its early role in British motoring and modernist architecture (often referring to Bexhill-on-Sea).","zh":"英国英格兰东萨塞克斯郡的海滨小镇，位于英吉利海峡沿岸，以海滩、英国早期汽车文化以及现代主义建筑而闻名（常指“Bexhill-on-Sea”即“贝克斯希尔（滨海）”）。"},"examples":[{"en":"We spent the weekend in Bexhill and walked along the seafront.","zh":"我们周末去了贝克斯希尔，在海滨步道散步。"},{"en":"Bexhill is in East Sussex, not far from Hastings.","zh":"贝克斯希尔在东萨塞克斯郡，离黑斯廷斯不远。"},{"en":"The art exhibition is at the De La Warr Pavilion in Bexhill.","zh":"艺术展在贝克斯希尔的德拉瓦尔馆举办。"}]}],"synonyms":["Bexhill-on-Sea","East Sussex town","seaside resort"],"phonetic":"ˈbɛksˌhɪl","extraExplanation":["“Bexhill”是专有名词（地名），日常口语里常与“on-Sea”连用成“Bexhill-on-Sea”。","贝克斯希尔的德拉瓦尔馆（De La Warr Pavilion）是英国著名的现代主义建筑，也常出现在旅游介绍与文化活动信息中。","作为地名，它通常不加冠词：说“in Bexhill / from Bexhill”，而不是“in the Bexhill”。"]}
{"word":"Bexhill-on-Sea","summary":{"en":"Bexhill-on-Sea is a seaside town on England’s south coast in East Sussex.","zh":"Bexhill-on-Sea是英国英格兰东萨塞克斯郡南海岸的一座海滨小镇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A seaside town in East Sussex, on the south coast of England, known as a quiet resort and for its early-20th-century architecture (especially the De La Warr Pavilion).","zh":"英国英格兰东萨塞克斯郡南部海岸的一座海滨小镇，以安静的度假氛围和20世纪早期建筑闻名（尤其是德拉瓦尔展馆）。"},"examples":[{"en":"We spent the weekend in Bexhill-on-Sea to walk along the promenade.","zh":"我们在Bexhill-on-Sea度过周末，沿着海滨步道散步。"},{"en":"The De La Warr Pavilion in Bexhill-on-Sea is a famous modernist building.","zh":"Bexhill-on-Sea的德拉瓦尔展馆是一座著名的现代主义建筑。"}]}],"synonyms":["Bexhill"],"phonetic":"/ˌbɛksˌhɪl ɑn ˈsi/","extraExplanation":["“on-Sea”常见于英国城镇名称中，用来强调该地靠海、具海滨度假属性（例如“Town-on-Sea”一类的命名方式）。","Bexhill-on-Sea一般可简写为“Bexhill”，但在正式写作或旅行信息中常用全名以避免与其他地名混淆。"]}
{"word":"Bexley","summary":{"en":"Bexley is most commonly a place name (a borough in southeast London), and it can also refer to a city in Ohio or be used as a surname.","zh":"Bexley 最常见是地名（伦敦东南部的贝克斯利自治市），也可指俄亥俄州的一座城市，或作姓氏使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a district (borough) in southeast London, England, officially called the London Borough of Bexley.","zh":"英国英格兰伦敦东南部的一个行政区（自治市），官方名称为“贝克斯利伦敦自治市”。"},"examples":[{"en":"She lives in Bexley and commutes into central London for work.","zh":"她住在贝克斯利，上班通勤去伦敦市中心。"},{"en":"Bexley is in southeast London, near the River Thames.","zh":"贝克斯利位于伦敦东南部，靠近泰晤士河。"}]},{"partOfSpeech":"n.","definition":{"en":"a city in Ohio, USA, near Columbus.","zh":"美国俄亥俄州的一座城市，靠近哥伦布市。"},"examples":[{"en":"They moved to Bexley, Ohio for a quieter neighborhood.","zh":"他们搬到俄亥俄州的贝克斯利，想住在更安静的社区。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"一个姓氏。"},"examples":[{"en":"Dr. Bexley will see you at 3 p.m.","zh":"贝克斯利医生会在下午三点为你看诊。"}]}],"phonetic":"/ˈbɛksli/","extraExplanation":["“Bexley”多作为专有名词使用（地名或姓）。在书面英语中常见搭配包括：the London Borough of Bexley（贝克斯利伦敦自治市）、Bexleyheath（贝克斯利希思，属该区域的地名之一）、Bexley, Ohio（俄亥俄州贝克斯利）。","发音上注意：重音在第一音节（BEX-），结尾的 -ley 常读作 /li/，类似于 Hadley、Bradley 这类以 -ley 结尾的词。"]}

