{"word":"BF","summary":{"en":"“BF” is an informal abbreviation meaning “boyfriend” or “best friend,” depending on context.","zh":"“BF”是非正式缩写，可指“男朋友”或“最好的朋友”，具体看语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(texting/social media) boyfriend; a male romantic partner.","zh":"（短信/社交媒体）男朋友；男性恋人。"},"examples":[{"en":"My BF is picking me up after class.","zh":"我男朋友下课后来接我。"},{"en":"She posted a photo with her BF on Instagram.","zh":"她在 Instagram 上发了和男朋友的合照。"}]},{"partOfSpeech":"n.","definition":{"en":"(texting/social media) best friend; a very close friend.","zh":"（短信/社交媒体）最好的朋友；挚友。"},"examples":[{"en":"I’m going to the concert with my BF.","zh":"我要和我最好的朋友去看演唱会。"},{"en":"She’s my BF—we tell each other everything.","zh":"她是我最好的朋友——我们什么都互相分享。"}]}],"synonyms":["boyfriend","best friend","BFF (best friend forever)"],"phonetic":"/ˌbiːˈɛf/","extraExplanation":["“BF”多见于聊天、短信、评论区等非正式场合。口语里通常直接说“boyfriend”或“best friend”。","在不同语境中含义可能不一样：如果谈恋爱话题多半是“boyfriend”；如果是友情话题或同性朋友之间，也可能是“best friend”。必要时可以写全避免误会。"]}
{"word":"bf","summary":{"en":"“bf” is a common informal abbreviation for “boyfriend.”","zh":"“bf”是“boyfriend（男朋友）”的常见非正式缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an informal abbreviation for “boyfriend.”","zh":"“boyfriend（男朋友）”的非正式缩写。"},"examples":[{"en":"My bf is picking me up after class.","zh":"我男朋友下课后来接我。"},{"en":"She posted a photo with her bf on Instagram.","zh":"她在 Instagram 上发了一张和男朋友的合照。"}]},{"partOfSpeech":"other","definition":{"en":"(online/chat) a casual way to refer to a male romantic partner; sometimes used in texting or social media.","zh":"（网络/聊天）用来指代男性恋人或对象的随意说法，常见于短信或社交媒体。"},"examples":[{"en":"Is that your bf in the picture?","zh":"照片里那位是你男朋友吗？"},{"en":"I’m meeting my bf’s parents this weekend.","zh":"这周末我要去见我男朋友的父母。"}]}],"synonyms":["boyfriend","partner","SO (significant other)"],"phonetic":"/ˈbɔɪˌfrɛnd/","extraExplanation":["“bf”主要出现在聊天、评论、短信等非正式场合；在正式写作中建议写全称“boyfriend”。","有时“BF”也可能在特定领域代表别的意思（如工作缩写、技术术语等），需要结合上下文判断。"]}
{"word":"BFA","summary":{"en":"BFA most commonly means Bachelor of Fine Arts, an undergraduate degree focused on visual or performing arts.","zh":"BFA 最常见的意思是“艺术学士”，指以视觉艺术或表演艺术为重点的本科专业学位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bachelor of Fine Arts: an undergraduate university degree focused on studio art or performing arts (such as painting, graphic design, theater, or dance).","zh":"艺术学士：以艺术创作或表演艺术为核心的大学本科学位（如绘画、平面设计、戏剧、舞蹈等）。"},"examples":[{"en":"She earned a BFA in graphic design and now works at an ad agency.","zh":"她获得了平面设计的艺术学士学位，现在在一家广告公司工作。"},{"en":"I’m applying to art schools that offer a BFA program.","zh":"我正在申请提供艺术学士项目的艺术院校。"},{"en":"His portfolio was the most important part of his BFA application.","zh":"作品集是他申请艺术学士项目中最重要的部分。"}]}],"synonyms":["Bachelor of Fine Arts","fine arts degree"],"phonetic":"/ˌbiː ɛf ˈeɪ/","extraExplanation":["BFA 通常用于美国/加拿大等英语国家的教育体系中，常见对比是 BA（Bachelor of Arts，文学学士）。一般来说，BFA 更偏重“工作室/实践训练”（studio practice），课时里会有更多创作课与作品集要求；BA 往往包含更多通识与理论课程。但不同学校设置会有差异。","写在简历或邮件里常见格式：BFA, School/University, Major（例如：BFA, University of X, Painting）。口语里也常说 “a B-F-A” 来拼读这个缩写。"]}
{"word":"BFAMus","summary":{"en":"BFAMus is an academic abbreviation for “Bachelor of Fine Arts in Music.”","zh":"BFAMus 是学术缩写，表示“Bachelor of Fine Arts in Music（音乐方向的艺术学士学位）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation (used in school/program names) meaning “Bachelor of Fine Arts in Music,” i.e., an undergraduate degree focused on music performance/creation with a fine-arts emphasis","zh":"（多用于学校/专业名称的缩写）“Bachelor of Fine Arts in Music”的简称，指“音乐方向的艺术学士学位/音乐美术学士”，偏重音乐表演或创作并带有美术/艺术学院体系的培养特点"},"examples":[{"en":"She applied to the BFAMus program in vocal performance.","zh":"她申请了声乐表演方向的 BFAMus 项目。"},{"en":"The university lists BFAMus under its School of Fine Arts degrees.","zh":"该大学在艺术学院学位项目中列出了 BFAMus。"}]}],"synonyms":["BFA (Music)","BFA in Music","Bachelor of Fine Arts in Music"],"phonetic":"/biː ɛf eɪ mjuːz/","extraExplanation":["“BFAMus”不是最通用的英语日常词汇，更常见的写法是 **BFA (Music)**、**BFA in Music**，以及更常见的音乐本科学位 **BMus / BM (Bachelor of Music)**。不同学校命名不一：有的把音乐放在音乐学院（BMus），有的把音乐作为艺术学院体系下的方向（BFA in Music）。","读法通常按字母逐个读：B-F-A-MUS。正式写作中建议第一次出现时写全称：Bachelor of Fine Arts in Music (BFAMus)，之后再用缩写。"]}
{"word":"BFD","summary":{"en":"BFD: a sarcastic way to say something isn’t a big deal or isn’t impressive.","zh":"BFD：一种带讽刺的说法，表示“没什么大不了/不值得大惊小怪”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(slang, informal) Used sarcastically to mean “that’s not important/impressive,” or “who cares?” (often stands for “big f***ing deal,” sometimes softened to “big freaking deal”).","zh":"（俚语，非正式）带讽刺地表示“这没什么了不起/不重要”“有什么大不了的？”（常被解释为“big f***ing deal”，也常用较温和的“big freaking deal”）。"},"examples":[{"en":"He got a new phone—BFD. Everyone has one.","zh":"他买了新手机——有什么大不了的？大家都有。"},{"en":"You finished the report early? BFD. It was due yesterday.","zh":"你提前完成报告？有什么了不起的？其实昨天就该交了。"},{"en":"She acted like it was a BFD, but it really wasn’t.","zh":"她表现得好像很严重，但其实没那么夸张。"}]}],"synonyms":["not a big deal","who cares","so what","whatever","no biggie"],"phonetic":"/biː ɛf diː/","extraExplanation":["“BFD”通常用于短信、聊天、评论区等非正式场合，语气往往偏刻薄/不耐烦，可能会让对方感到被轻视；在职场或正式写作中不建议使用。","它原本含有粗口（f***），因此有些人会用“big freaking deal/ big frickin’ deal”来弱化；如果你不确定对方的接受度，用更中性的表达如“Not a big deal.”会更安全。"]}
{"word":"BFDC","summary":{"en":"BFDC is an acronym/initialism with multiple possible meanings; you need context to know what it stands for.","zh":"BFDC是一个可能有多种含义的首字母缩写；需要语境才能确定具体代表什么。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation that can stand for different phrases or organizations; its exact meaning depends on the context (industry, country, and document).","zh":"一个缩写，可能代表不同的词组或机构；具体含义取决于语境（行业、国家、文件来源等）。"},"examples":[{"en":"I saw “BFDC” in the report, but the document didn’t explain what it stands for.","zh":"我在报告里看到“BFDC”，但文件没有说明它代表什么。"},{"en":"Before using BFDC in a presentation, make sure your audience knows what it means.","zh":"在演示中使用BFDC之前，先确保听众知道它的含义。"}]},{"partOfSpeech":"other","definition":{"en":"(In some business or local-government contexts) a name used for a committee, corporation, or development center (for example, something like a “Business/Finance/Development Committee/Corporation/Center”).","zh":"（在一些商业或地方政府语境中）可能用作某个委员会、公司或发展中心的名称（例如类似“商业/金融/发展 委员会/公司/中心”的组合）。"},"examples":[{"en":"The city partnered with the BFDC to support small businesses.","zh":"该市与BFDC合作以支持小企业。"},{"en":"Please contact BFDC for details about the development program.","zh":"有关发展项目的详情请联系BFDC。"}]}],"synonyms":["acronym","initialism","abbreviation"],"phonetic":"/ˌbiː ɛf diː ˈsiː/","extraExplanation":["“BFDC”不是一个在通用英语里固定、单一的词。它更像是“首字母缩写”（initialism），通常需要看到它出现的完整句子、所在领域（如金融、政府、教育、军事、公司名称等）才能确定展开形式。","你可以把包含BFDC的原句/截图发来，或说明它出现在哪个国家、哪份文件、哪个行业，我就能更准确地帮你判断它是什么意思。"]}
{"word":"BFF","summary":{"en":"BFF means “best friend forever,” used for a very close friend or as a friendly message.","zh":"BFF 表示“best friend forever（永远的好朋友）”，用于指非常亲密的朋友或作为友好留言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person’s best friend; used especially for a very close friend.","zh":"最好的朋友；尤指关系非常亲密的朋友。"},"examples":[{"en":"Jenna is my BFF—we tell each other everything.","zh":"Jenna 是我的 BFF——我们什么都互相分享。"},{"en":"I’m hanging out with my BFF after school.","zh":"放学后我要和我的 BFF 一起玩。"}]},{"partOfSpeech":"phrase","definition":{"en":"“Best friends forever,” used as an informal label or message to show strong friendship.","zh":"“永远的好朋友”，作为非正式称呼或留言，用来表达深厚友谊。"},"examples":[{"en":"Happy birthday, BFF! Love you!","zh":"生日快乐，BFF！爱你！"},{"en":"They wrote “BFF” on their matching bracelets.","zh":"她们在配对的手链上写了“BFF”。"}]}],"synonyms":["best friend","close friend","bestie"],"phonetic":"/ˌbiː ɛf ˈɛf/","extraExplanation":["“BFF”是网络与短信中非常常见的缩写，来自“best friend(s) forever”。多用于口语、聊天、社交媒体，不太适合正式写作。","在不同文化或语境里，“Love you!”对朋友也很常见，通常表示亲密与关心，不一定是恋爱关系。"]}
{"word":"BFGoodrich","summary":{"en":"BFGoodrich is an American tire and rubber-products brand (often written B.F. Goodrich).","zh":"BFGoodrich 是一个美国轮胎与橡胶制品品牌（常写作 B.F. Goodrich）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A U.S. brand name best known for making tires and other rubber products (often written as B.F. Goodrich).","zh":"一个美国品牌名称，以生产轮胎和其他橡胶制品最为知名（常写作 B.F. Goodrich）。"},"examples":[{"en":"He put a set of BFGoodrich tires on his truck for better off-road grip.","zh":"他给卡车换了一套 BFGoodrich 轮胎，以获得更好的越野抓地力。"},{"en":"The ad compared BFGoodrich tires with other all-terrain brands.","zh":"广告把 BFGoodrich 轮胎和其他全地形品牌作了对比。"}]},{"partOfSpeech":"other","definition":{"en":"The company name historically associated with the B.F. Goodrich brand (in business and industrial contexts).","zh":"历史上与 B.F. Goodrich 品牌相关联的公司名称（多用于商业或工业语境）。"},"examples":[{"en":"In the 20th century, B.F. Goodrich expanded beyond tires into aerospace and industrial materials.","zh":"在20世纪，B.F. Goodrich 的业务从轮胎扩展到航空航天和工业材料。"},{"en":"The museum exhibit mentioned B.F. Goodrich as part of America’s rubber industry history.","zh":"博物馆展览提到 B.F. Goodrich，作为美国橡胶工业史的一部分。"}]}],"synonyms":["B.F. Goodrich","tire brand","all-terrain tire brand"],"phonetic":"/ˌbiː ˌɛf ˈɡʊd.rɪtʃ/","extraExplanation":["“BF”是创办人 Benjamin Franklin Goodrich 名字的缩写，因此常见写法是“B.F. Goodrich”。","该品牌与美国早期橡胶与轮胎工业关系密切；后来轮胎业务的品牌权利与运营经历过多次变动（如与米其林 Michelin 的合作/整合等），因此你可能会在不同语境下看到“品牌名”和“公司实体”并不完全等同。"]}
{"word":"BFHD","summary":{"en":"“BFHD” is an initialism whose meaning varies by context; you usually need the surrounding text or field to identify the intended expansion.","zh":"“BFHD”是一个含义依语境而定的首字母缩写；通常需要上下文或所属领域才能确定其具体全称与意思。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation (initialism) for a phrase; its exact meaning depends on the context (e.g., a specific industry, company, online community, or document).","zh":"一个缩写（首字母缩略词）；具体含义取决于语境（例如行业、公司、网络社群或文件）。"},"examples":[{"en":"What does “BFHD” mean in this message?","zh":"这条消息里的“BFHD”是什么意思？"},{"en":"I saw “BFHD” in a product listing, but it wasn’t explained.","zh":"我在商品信息里看到“BFHD”，但没有解释它的含义。"},{"en":"Can you tell me the full form of BFHD in this report?","zh":"你能告诉我这份报告里 BFHD 的全称是什么吗？"}]}],"phonetic":"/ˌbiː ɛf eɪtʃ ˈdiː/","extraExplanation":["“BFHD”不是一个在通用英语里非常固定、人人都懂的缩写（不像“FHD=Full HD”那样常见）。缩写往往在特定领域才有约定俗成的含义。","如果你把它出现的完整句子/截图，或告诉我它来自哪里（聊天、游戏、医学、工程、学校、公司、产品型号等），我可以更准确地给出对应的全称和解释。"]}
{"word":"BFQ","summary":{"en":"BFQ most often means the Big Five Questionnaire (a personality test), but it can also be an acronym with other meanings depending on context.","zh":"BFQ最常见指“大五人格问卷”（一种人格测评），但也可能是其他含义的缩写，需结合上下文判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation most commonly used for the Big Five Questionnaire, a personality test based on the “Big Five” traits (Openness, Conscientiousness, Extraversion, Agreeableness, Neuroticism).","zh":"常见缩写：指“大五人格问卷”（Big Five Questionnaire），一种基于“五大人格特质”（开放性、尽责性、外向性、宜人性、神经质）的性格测评工具。"},"examples":[{"en":"In our psychology class, we filled out the BFQ to learn about our personality traits.","zh":"在心理学课上，我们填写了BFQ来了解自己的人格特质。"},{"en":"The researcher used the BFQ to measure participants’ Big Five scores.","zh":"研究者使用BFQ来测量参与者的五大人格得分。"}]},{"partOfSpeech":"other","definition":{"en":"a less common abbreviation that can mean different things in different fields (for example, the name of a form, questionnaire, project, or organization).","zh":"较不常见：在不同领域可能代表不同事物（例如某种表格、问卷、项目或机构名称的缩写），需要结合上下文判断。"},"examples":[{"en":"What does BFQ stand for in this report?","zh":"在这份报告里，BFQ代表什么？"},{"en":"BFQ can have different meanings depending on the context.","zh":"BFQ会因语境不同而有不同含义。"}]}],"synonyms":["Big Five Questionnaire","Big Five personality test (general meaning)"],"phonetic":"/ˌbiː ɛf ˈkjuː/","extraExplanation":["在学术语境里，BFQ常指意大利学者开发的一套“大五人格问卷”量表；日常英语中并不是人人都认识这个缩写。第一次使用时，写作上通常会先写全称 Big Five Questionnaire (BFQ)。","如果你告诉我你看到BFQ的具体句子或领域（心理学/商业/网络/游戏等），我可以帮你确定最准确的含义。"]}
{"word":"BFR","summary":{"en":"BFR most commonly means “blood flow restriction,” a training method using a cuff/band to partly restrict blood flow during exercise.","zh":"BFR最常见指“血流限制”，即运动时用袖带/绑带部分限制血流的一种训练方法。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) blood flow restriction: a fitness/rehab method that uses a cuff or band to partially restrict blood flow to a limb during exercise, usually to build strength or muscle with lighter weights.","zh":"（缩写）血流限制：一种健身/康复训练方法，用袖带或绑带在运动时部分限制四肢的血流，通常用较轻重量来促进增肌或增强力量。"},"examples":[{"en":"My physical therapist recommended BFR training after my knee surgery.","zh":"我膝盖手术后，物理治疗师建议我做BFR训练。"},{"en":"BFR lets you get a tough workout using lighter loads.","zh":"BFR可以让你用更轻的负重也练得很“狠”。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., less common) a shorthand meaning depends on the field (for example, in aviation or business), so it needs context to interpret correctly.","zh":"（缩写，较少见）在不同领域含义不同（例如航空或商业），需要上下文才能准确理解。"},"examples":[{"en":"In this report, what does BFR stand for?","zh":"在这份报告里，BFR代表什么？"},{"en":"BFR can mean different things depending on the industry.","zh":"BFR在不同行业可能有不同含义。"}]}],"synonyms":["blood flow restriction training","occlusion training","KAATSU"],"phonetic":"/ˌbiː ɛf ˈɑːr/","extraExplanation":["在健身/康复语境里，BFR最常见的说法是“BFR training / BFR workout”。也常被称为“occlusion training（阻断/闭塞训练）”或“KAATSU（加压训练，日本术语）”。","BFR通常强调“部分限制静脉回流、动脉仍有供血”，所以不等于完全“截断”血流。实际使用要注意安全与专业指导，尤其是有心血管问题、血栓史等情况的人。"]}
{"word":"BFS","summary":{"en":"BFS most commonly means “breadth-first search,” a level-by-level graph/tree traversal algorithm.","zh":"BFS 最常见指“广度优先搜索”，一种按层遍历图/树的算法。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Computer science) Breadth-first search: an algorithm for exploring a graph/tree level by level, visiting all nearest nodes first (usually using a queue).","zh":"（计算机）广度优先搜索：一种按“层”遍历图/树的算法，先访问距离起点最近的节点（通常使用队列）。"},"examples":[{"en":"Use BFS to find the shortest path in an unweighted graph.","zh":"在无权图中，可以用 BFS 来找最短路径。"},{"en":"The code runs BFS from the starting node and records each node’s distance.","zh":"这段代码从起点运行 BFS，并记录每个节点的距离。"}]},{"partOfSpeech":"other","definition":{"en":"(Informal, rare) A shortened written form meaning “best friends” (plural), depending on the community/context.","zh":"（非正式，较少见）在某些圈子里可表示“最好的朋友们/死党们”（复数），含义依语境而定。"},"examples":[{"en":"We’ve been BFS since middle school.","zh":"我们从初中起就是死党。"}]}],"synonyms":["breadth-first search","level-order traversal"],"phonetic":"/biː ɛf ɛs/","extraExplanation":["在算法语境里，BFS 常与 DFS（深度优先搜索）对比：BFS 更适合“无权最短路”、按层扩展、找最近目标等任务；实现时最典型的数据结构是 queue（队列）。","书写时常直接写 BFS（全大写）；口语里通常逐个字母读作“B-F-S”。"]}
{"word":"BFT","summary":{"en":"BFT is an initialism (B-F-T) with multiple meanings; common uses include “Basic Fitness Test” and “Backflow Test/Testing,” depending on context.","zh":"BFT 是一个按字母读的首字母缩略语，含义不固定；常见用法包括“基础体能测试（Basic Fitness Test）”和“倒流测试（Backflow Test/Testing）”，需结合语境理解。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an initialism with several possible meanings; often used as a shorthand label in texts or professional fields (meaning depends on context).","zh":"一个有多种可能含义的首字母缩略语；常用于短信或专业领域作简写（具体含义取决于语境）。"},"examples":[{"en":"What does BFT stand for in this email?","zh":"这封邮件里的 BFT 是什么意思？"},{"en":"In this report, BFT refers to a test protocol, not a company name.","zh":"在这份报告里，BFT 指的是一种测试流程，不是公司名称。"}]},{"partOfSpeech":"other","definition":{"en":"(fitness / training) Basic Fitness Test (a simple test of general physical fitness).","zh":"（健身/训练）Basic Fitness Test：基础体能测试（用于评估一般体能的简易测试）。"},"examples":[{"en":"We have a BFT next week, so I’m running every day.","zh":"我们下周有 BFT，所以我每天都跑步。"},{"en":"The coach uses a BFT to check endurance and strength.","zh":"教练用 BFT 来检查耐力和力量。"}]},{"partOfSpeech":"other","definition":{"en":"(building / plumbing) Backflow Test / Backflow Testing (checking a backflow prevention device to keep water safe).","zh":"（建筑/管道）Backflow Test / Backflow Testing：倒流测试（检测防倒流装置以保障用水安全）。"},"examples":[{"en":"The city requires an annual BFT for this property.","zh":"市政府要求这处房产每年做一次 BFT。"},{"en":"Schedule the BFT before the inspection date.","zh":"在检查日期前把 BFT 预约好。"}]}],"synonyms":["initialism","acronym"],"phonetic":"/ˌbiː ɛf ˈtiː/","extraExplanation":["BFT 通常按字母读作 “B-F-T”。它不是一个固定词义的单词，更像一个“标签”。在不同领域（健身、工程、金融、科技、机构名称等）可能代表完全不同的短语。最好结合你看到它的场景（邮件主题、报告章节、聊天上下文）来判断。"]}

