{"word":"BH","summary":{"en":"“BH” is a common abbreviation meaning different things by context (often “Beverly Hills” or internet slang “butthurt”).","zh":"“BH”是常见缩写，含义取决于语境（常见为“比佛利山庄”或网络俚语“butthurt/玻璃心”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"the letters “B” and “H” spoken as an abbreviation (used for many different phrases or names).","zh":"字母缩写“BH”（可代表许多不同的词组或名称）。"},"examples":[{"en":"What does “BH” stand for in this message?","zh":"这条消息里的“BH”代表什么意思？"},{"en":"In the file name, BH is just an abbreviation.","zh":"在文件名里，BH只是一个缩写。"}]},{"partOfSpeech":"other","definition":{"en":"Beverly Hills (a wealthy city area in Los Angeles, California), often used in names like “BH.”","zh":"比佛利山庄（美国加州洛杉矶的富裕地区），常在名称中缩写为“BH”。"},"examples":[{"en":"They stayed at a hotel in BH.","zh":"他们住在比佛利山庄（BH）的一家酒店。"},{"en":"BH is famous for luxury shopping.","zh":"比佛利山庄（BH）以奢侈品购物闻名。"}]},{"partOfSpeech":"adj.","definition":{"en":"(internet slang, informal) “butthurt”: overly upset or offended, especially about something small.","zh":"（网络俚语，非正式）“butthurt”：因小事过度不开心或觉得被冒犯。"},"examples":[{"en":"Don’t get BH just because someone disagreed with you.","zh":"别因为别人不同意你就变得很“玻璃心”（BH）。"},{"en":"He sounded BH after the joke.","zh":"那个玩笑之后他听起来有点被冒犯（BH）。"}]}],"synonyms":["abbrev.","initials"],"phonetic":"/biː eɪtʃ/","extraExplanation":["“BH”非常依赖语境：在地名里常指 Beverly Hills；在聊天/论坛里有时是俚语 butthurt。不同圈子还可能有别的含义（如人名首字母、学校/公司缩写等）。如果你把原句或聊天截图发来，我可以帮你确定最准确的意思。"]}
{"word":"BHA","summary":{"en":"BHA is an abbreviation most commonly meaning a skincare exfoliant (beta hydroxy acid), but it can also mean a food/cosmetic preservative (butylated hydroxyanisole) or the British Horseracing Authority.","zh":"BHA是缩写，最常见指护肤成分β-羟基酸；也可指食品/化妆品防腐抗氧化剂丁基羟基茴香醚，或英国赛马管理机构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"beta hydroxy acid; a skincare ingredient used to exfoliate inside pores (often salicylic acid), commonly for oily or acne-prone skin.","zh":"β-羟基酸；护肤成分，能深入毛孔进行去角质（常指水杨酸），常用于油性或痘痘肌。"},"examples":[{"en":"This cleanser contains BHA to help reduce blackheads.","zh":"这款洁面含有BHA，有助于减少黑头。"},{"en":"If your skin is sensitive, start BHA slowly—once or twice a week.","zh":"如果你的皮肤敏感，BHA要慢慢用——每周一到两次开始。"}]},{"partOfSpeech":"n.","definition":{"en":"butylated hydroxyanisole; a chemical preservative/antioxidant used to prevent fats and oils in foods or cosmetics from going bad.","zh":"丁基羟基茴香醚（BHA）；一种防腐/抗氧化剂，用于防止食品或化妆品中的油脂变质。"},"examples":[{"en":"Some packaged foods list BHA as an antioxidant preservative.","zh":"一些包装食品会把BHA列为抗氧化防腐剂。"},{"en":"The label says it contains BHA and BHT.","zh":"标签上写着含有BHA和BHT。"}]},{"partOfSpeech":"n.","definition":{"en":"British Horseracing Authority; the organization that regulates horse racing in Great Britain.","zh":"英国赛马管理机构（British Horseracing Authority）；负责监管英国本土赛马运动的组织。"},"examples":[{"en":"The BHA announced new safety rules for races.","zh":"BHA发布了新的赛事安全规定。"},{"en":"The trainer appealed to the BHA after the penalty.","zh":"处罚之后，训练师向BHA提出申诉。"}]}],"synonyms":["beta hydroxy acid (for skincare meaning)","salicylic acid (common BHA)","British Horseracing Authority (full name)"],"phonetic":"/biː eɪtʃ eɪ/","extraExplanation":["“BHA”是缩写，在不同领域含义差别很大。日常网络语境里最常见的是护肤里的“β-羟基酸”；阅读配料表时也常见到防腐剂“butylated hydroxyanisole”。如果你能告诉我你在哪看到它（护肤品、食品配料、体育新闻等），我可以更精准解释。"]}
{"word":"BHA-treated","summary":{"en":"“BHA-treated” describes a product treated with the preservative antioxidant BHA to slow spoilage (especially rancidity in fats/oils).","zh":"“BHA-treated”指产品添加/经BHA抗氧化防腐剂处理，用来减缓变质，尤其是防止油脂酸败。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"treated with BHA (butylated hydroxyanisole), an antioxidant preservative added to help prevent fats/oils from going rancid.","zh":"经过BHA（丁基羟基茴香醚）处理的；添加了BHA这种抗氧化防腐剂，以帮助防止油脂酸败。"},"examples":[{"en":"The packaging says the nuts are BHA-treated to keep them fresh longer.","zh":"包装上写着这些坚果经过BHA处理，以延长保鲜时间。"},{"en":"Some consumers avoid BHA-treated foods and choose products labeled “no artificial preservatives.”","zh":"有些消费者会避免购买BHA处理过的食品，转而选择标注“无人工防腐剂”的产品。"}]}],"synonyms":["BHA-preserved","preservative-treated","antioxidant-treated"],"phonetic":"/ˌbiː eɪtʃ ˈeɪ ˈtriːtɪd/","extraExplanation":["BHA 是一种常见的合成抗氧化剂（食品添加剂），常用于含油脂的食品（如谷物、零食、坚果、口香糖底料）以及某些化妆品中，作用是减缓油脂氧化、避免产生“哈味/酸败味”。","在成分表或标签上可能写作 “BHA”、 “butylated hydroxyanisole”，或与 BHT、TBHQ 等一起出现。","“BHA-treated”多见于配料说明、产品描述或检测报告中，属于偏技术/标签语言；日常口语里更常说“contains BHA / with BHA preservative”。"]}
{"word":"Bhaadon","summary":{"en":"Bhaadon is a North Indian calendar month (about Aug–Sep), often linked with late-monsoon rainy season imagery.","zh":"Bhaadon 是北印度历法中的一个月份（约8—9月），常与雨季后期的意象相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A month in the North Indian (Hindi) calendar, roughly falling in August–September, associated with the late monsoon season.","zh":"北印度（印地语）历法中的一个月份，大致对应公历8—9月，常与雨季后期（季风）相关。"},"examples":[{"en":"Bhaadon often brings heavy rains in many parts of North India.","zh":"在北印度许多地区，Bhaadon 常常带来大雨。"},{"en":"They planned the village fair for Bhaadon, after the fields had enough water.","zh":"他们把乡村集市安排在 Bhaadon，等田里水分充足之后。"}]},{"partOfSpeech":"n.","definition":{"en":"In literature and everyday talk, the season/time of year represented by this month—especially a rainy, lush period.","zh":"在文学与日常表达中，也可指这个月份所代表的时节——尤其是多雨、草木繁盛的一段时期。"},"examples":[{"en":"The poem describes the Bhaadon sky, dark with clouds and full of thunder.","zh":"这首诗描写了 Bhaadon 的天空：乌云密布、雷声滚滚。"},{"en":"In Bhaadon, the air smells of wet earth and fresh leaves.","zh":"到了 Bhaadon，空气里有湿土和新叶的气味。"}]}],"synonyms":["Bhadon","Bhadrapada"],"phonetic":"/bɑːˈdɔːn/","extraExplanation":["“Bhaadon / Bhādōn”常见于印地语、旁遮普语等北印度语言的语境，也常被英译写作 Bhadon、Bhadun 等，是本地历法（月名）进入英语文本后的转写形式。","它大致对应印度传统历法中的“Bhadrapada（婆陀罗钵陀月）”，但不同地区的阴阳历算法会让起止日期略有差异。","在南亚文学（如民歌、诗歌、小说）里，Bhaadon 常被用来唤起“雨季、相思、丰饶、农事”等意象。"]}
{"word":"bhabar","summary":{"en":"Bhabar is the dry, gravelly foothill belt along the Himalayas where rivers often sink underground.","zh":"Bhabar指喜马拉雅山麓一条干燥、多砾石的地带，河水常在此渗入地下。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a narrow, dry, stony belt of land along the foothills of the Himalayas, where rivers often sink into porous gravel","zh":"喜马拉雅山麓的一条狭长、干燥多石的地带；河水常因砾石层疏松而渗入地下"},"examples":[{"en":"Villages in the Bhabar region often depend on wells because surface water disappears into the gravel.","zh":"在Bhabar地区，村庄常依靠水井，因为地表水会渗入砾石层而消失。"},{"en":"The river flows on the surface in the mountains but sinks when it reaches the Bhabar belt.","zh":"这条河在山地仍是地表径流，但到达Bhabar带时会渗入地下。"}]},{"partOfSpeech":"n.","definition":{"en":"(by extension) land or forest typical of this belt, especially in northern India and Nepal","zh":"（引申）指这种地带典型的土地或森林景观，常见于印度北部与尼泊尔一带"},"examples":[{"en":"The park protects forest ecosystems found in the Bhabar and nearby plains.","zh":"这座公园保护了Bhabar地带及其邻近平原的森林生态系统。"}]}],"synonyms":["Bhabar belt"],"phonetic":"/ˈbɑːbɑːr/","extraExplanation":["“Bhabar”多见于地理与生态学语境，常与“Terai（塔莱平原/湿润低地）”对比：Bhabar更干燥、砾石多、地表水少；而Terai地下水位更高、湿地更多。","词源一般认为来自印地语/乌尔都语等南亚语言，用来指代这一特定地貌带；在英文中常写作专名（首字母大写），如“the Bhabar belt”。"]}
{"word":"Bhabha","summary":{"en":"Bhabha is a surname, widely recognized through famous Indian figures; it also appears in physics terms like “Bhabha scattering.”","zh":"Bhabha 是一个姓氏，因著名印度人物而为英语世界熟知；它也出现在如“Bhabha scattering（巴巴散射）”等物理学术语中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname), best known in English through notable Indian figures such as Homi K. Bhabha (postcolonial theorist) and Homi J. Bhabha (physicist).","zh":"一个姓氏（Bhabha/巴巴），在英语语境中常因几位著名印度人物而被熟知，例如后殖民理论学者霍米·K·巴巴（Homi K. Bhabha）与物理学家霍米·J·巴巴（Homi J. Bhabha）。"},"examples":[{"en":"In our literature class, we read an excerpt from Bhabha’s writing on cultural identity.","zh":"在文学课上，我们读了巴巴（Bhabha）关于文化认同的一段文字。"},{"en":"The professor mentioned Bhabha when discussing postcolonial theory.","zh":"教授在讲后殖民理论时提到了巴巴（Bhabha）。"}]},{"partOfSpeech":"other","definition":{"en":"(in physics, in names of concepts) used in terms like “Bhabha scattering,” a type of electron–positron scattering named after the physicist Homi J. Bhabha.","zh":"（物理学术语中）用于“Bhabha scattering（巴巴散射）”等名称，指一种电子与正电子的散射过程，以物理学家霍米·J·巴巴命名。"},"examples":[{"en":"The textbook briefly explains Bhabha scattering in the chapter on particle interactions.","zh":"教材在粒子相互作用那一章简要讲了巴巴散射（Bhabha scattering）。"}]}],"phonetic":"ˈbɑːbɑː","extraExplanation":["在英语里，“Bhabha”通常作为专有名词出现，因此大小写一般要首字母大写。","霍米·K·巴巴（Homi K. Bhabha）常与“hybridity（文化杂糅）”“third space（第三空间）”等概念一起出现；霍米·J·巴巴则与核物理、粒子物理相关的命名术语更常见。"]}
{"word":"Bhadgaon","summary":{"en":"Bhadgaon is most commonly an older/alternative name for Bhaktapur, Nepal; it can also be a less-common place name in parts of India depending on context.","zh":"Bhadgaon 最常见是尼泊尔 Bhaktapur（巴克塔普尔）的旧称/别称；在印度部分地区也可能作为地名出现，但需依语境确认。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional name for Bhaktapur, a historic city in the Kathmandu Valley of Nepal, known for Newar culture, temples, and medieval architecture.","zh":"（常见旧称）尼泊尔加德满都谷地的历史名城“巴克塔普尔（Bhaktapur）”的传统称呼，以纽瓦尔文化、寺庙与中世纪建筑闻名。"},"examples":[{"en":"We took a day trip to Bhadgaon (Bhaktapur) to see the old squares and temples.","zh":"我们去了一趟巴德冈（巴克塔普尔）一日游，参观老广场和寺庙。"},{"en":"Some older travel books still call Bhaktapur by the name Bhadgaon.","zh":"一些较老的旅行书仍把 Bhaktapur 称作 Bhadgaon。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name used in parts of India for certain towns or areas (less common in international English); the exact location depends on the region and context.","zh":"（较少见）印度部分地区的地名用法，可能指某些城镇或区域；具体所指需结合地区与语境。"},"examples":[{"en":"The report mentions Bhadgaon in connection with nearby villages, so the exact area needs clarification.","zh":"报告提到 Bhadgaon 并与附近村庄相关，因此需要进一步确认具体指哪里。"}]}],"synonyms":["Bhaktapur"],"phonetic":"/ˌbɑːdˈɡaʊn/","extraExplanation":["“Bhadgaon”在英文语境里最常见是指尼泊尔的 Bhaktapur 的旧称/别称；在不少历史资料与老地图中仍会出现。现代官方与旅游常用名多为“Bhaktapur”。","作为地名（proper noun）使用时通常不加冠词：说“in Bhadgaon / from Bhadgaon”。若需更明确，可写作“Bhadgaon (Bhaktapur), Nepal”。"]}
{"word":"Bhado","summary":{"en":"Bhado is a South Asian term (especially Nepali) for the month roughly in late Aug–mid Sep.","zh":"Bhado 是南亚（尤指尼泊尔）对一个传统月份的称呼，约在公历8月下旬至9月中旬。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asia, especially Nepal and parts of North India) The month Bhādo/Bhādō—often used in Nepali and some regional Hindi/Urdu speech—roughly corresponding to late August to mid‑September in the Gregorian calendar.","zh":"（南亚用语，尤指尼泊尔及印度部分地区）“Bhado/भादो”指传统历法中的一个月份，约相当于公历的8月下旬到9月中旬。"},"examples":[{"en":"School usually starts after Bhado in many Nepali communities.","zh":"在许多尼泊尔社区里，学校常在 Bhado 之后开学。"},{"en":"The festival is celebrated in Bhado, when the monsoon is still strong.","zh":"这个节日会在 Bhado 庆祝，那时季风雨势仍然很强。"}]}],"synonyms":["Bhadra","Bhādra","Bhadon (regional)"],"phonetic":"ˈbɑːdoʊ","extraExplanation":["“Bhado/भादो”在不同地区可能对应不同历法体系（如尼泊尔常用的比克拉姆历 Bikram Sambat），因此与公历的具体起止日期每年会有少许浮动。","它也常与梵语/印地语里的“Bhadra（भाद्र）”相关联：在一些语境中，Bhado可被理解为口语化或地区性的称呼。"]}
{"word":"Bhadon","summary":{"en":"Bhadon is a North Indian name for the Hindu month Bhadrapada (around late Aug–Sep), often linked with the monsoon.","zh":"Bhadon是北印度等地对印度教历月份Bhadrapada的称呼（约公历8月下旬至9月），常与雨季相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In parts of India) the month of Bhadrapada in the Hindu calendar, usually falling around late August to September; often associated with the monsoon season.","zh":"（印度部分地区用语）印度教历的“婆陀罗钵陀月/薄伽陀月”（Bhadrapada），通常约在公历8月下旬到9月；常与雨季（季风）联系在一起。"},"examples":[{"en":"Many villages plan festivals in Bhadon, when the rains are still strong.","zh":"许多村庄会在Bhadon安排节庆，因为那时雨季仍然很明显。"},{"en":"He said he would return after Bhadon ends, when the roads are easier to travel.","zh":"他说会在Bhadon结束后回来，那时道路更好走。"}]}],"synonyms":["Bhadrapada","Bhado","Bhadra (regional)"],"phonetic":"/bəˈdɔːn/","extraExplanation":["“Bhadon”是北印度及周边地区常见的口语/方言写法，也可见作“Bhado(n)”，对应梵语来源的正式名称“Bhadrapada”。","不同地区采用的阴阳历（panchang）换月时间可能略有差异；大致相当于公历8–9月。此月常与雨季、农事以及一些重要节日（如克里希纳诞辰 Janmashtami、象头神节 Ganesh Chaturthi）相关。"]}
{"word":"bhadon","summary":{"en":"Bhadon is a North Indian name for the Hindu lunar month Bhādra/Bhādrapada (around Aug–Sep), often linked with the monsoon.","zh":"Bhadon是印度北部对印度阴历月份Bhādra/Bhādrapada（约在8—9月）的称呼，常与雨季相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In North India) the Hindu lunar month Bhādon/Bhādra, roughly falling in August–September; often associated with the monsoon season.","zh":"（印度北部用法）印度阴历月份“Bhadon/ Bhādra（也作Bhado）”，大致对应公历8—9月；常与雨季（季风）联系在一起。"},"examples":[{"en":"In Bhādon, the fields turn green after weeks of monsoon rain.","zh":"到了Bhadon，连下几周季风雨后，田野变得一片葱绿。"},{"en":"Many villages hold seasonal festivals during Bhadon.","zh":"许多村庄会在Bhadon期间举行应季的节庆活动。"}]}],"synonyms":["Bhādra","Bhādrapada","Bhado","Bhaadon"],"phonetic":"/ˈbɑːdɑːn/","extraExplanation":["“Bhadon（也常写作Bhaadon）”是许多北印度语言（如印地语、旁遮普语等）里对梵语“Bhādrapada / Bhādra”的常见口语/地方拼写。不同地区的历法换算到公历会有几天到数周的差异。","在文学或民歌里，Bhadon常被用来唤起“雨季、泥土气息、思念与等待”等意象，因为它通常处在印度季风最明显的时段。","拼写以“Bh-”开头反映了南亚语言的送气/浊送气音，英语里常用近似音来读，因此你可能会听到多种读法。"]}
{"word":"Bhadra","summary":{"en":"Bhadra is a Sanskrit-based name meaning “auspicious/good,” and it is also used for some Indian place and river names.","zh":"Bhadra 源自梵语，常作人名，含“吉祥/良善”之意；也用于印度的一些地名与河流名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (mostly used in South Asia), from Sanskrit roots meaning “auspicious,” “good,” or “fortunate.”","zh":"（人名）Bhadra（多见于南亚），源自梵语词根，常带有“吉祥、良善、幸运”的含义。"},"examples":[{"en":"Bhadra is a common name in parts of India and Nepal.","zh":"Bhadra 在印度和尼泊尔的一些地区是常见名字。"},{"en":"Her parents named her Bhadra to express hopes for a good life.","zh":"她的父母给她取名 Bhadra，寄托对美好人生的祝愿。"}]},{"partOfSpeech":"n.","definition":{"en":"(in Indian geography) the name of several places and natural features, especially rivers, in India.","zh":"（印度地名/地理）Bhadra 也可指印度的若干地名与自然地貌名称，尤其常见于河流名。"},"examples":[{"en":"They visited the Bhadra River during their trip in Karnataka.","zh":"他们在卡纳塔克邦旅行时参观了 Bhadra 河。"}]},{"partOfSpeech":"adj.","definition":{"en":"(from Sanskrit, used in cultural/religious contexts) “auspicious; blessed; favorable.”","zh":"（梵语词义，常见于文化/宗教语境）“吉祥的；受祝福的；有利的”。"},"examples":[{"en":"In some traditions, “bhadra” describes an auspicious time or sign.","zh":"在一些传统中，“bhadra”可用来形容吉祥的时刻或征兆。"}]}],"synonyms":["auspicious","fortunate","blessed"],"phonetic":"/ˈbʌdrə/","extraExplanation":["“Bhadra/ Bhadrā（梵语 भद्र / भद्रा）”在南亚文化里常用于人名、地名，也常作为复合词的一部分（例如表示“吉祥、良善”的意涵）。不同语言与地区的拼写与读音可能略有差异（如印地语、孟加拉语、尼泊尔语等的本地发音）。","如果你指的是印度历法里的月份，常见相关词是“Bhadrapada（भाद्रपद）”，有时口语或地区用法会简称为“Bhadra”。如果你告诉我你看到这个词的上下文（人名/地名/节日或历法），我可以更精确解释。"]}
{"word":"Bhadrapada","summary":{"en":"Bhadrapada is a month name in the Hindu lunar calendar, usually around August–September.","zh":"Bhadrapada 是印度教阴历中的一个月份名，通常对应公历8—9月左右。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In the Hindu lunar calendar) the month of Bhadrapada, usually falling in August–September.","zh":"（印度教阴历）婆陀罗波陀月（Bhadrapada），通常在公历8—9月之间。"},"examples":[{"en":"Ganesh Chaturthi is often celebrated during Bhadrapada.","zh":"象头神诞（Ganesh Chaturthi）常在婆陀罗波陀月期间庆祝。"},{"en":"Many regions receive heavy monsoon rains in Bhadrapada.","zh":"很多地区在婆陀罗波陀月会遇到较强的季风降雨。"}]}],"synonyms":["Bhadra","Bhadon","Bhado"],"phonetic":"ˌbɑːdrəˈpɑːdə","extraExplanation":["Bhadrapada 是印度传统历法中的一个“月名”，具体落在公历的几月会因地区采用的历法版本（如阿曼塔制 amanta、普尔尼曼塔制 purnimanta）以及当年的朔望月变化而略有差异。","在文化上，这段时间常与雨季（monsoon）联系紧密，也常出现重要节日与宗教活动（例如象头神诞、吉祥天女相关节日等，因地区而异）。","英文中也可见拼写或俗称如 Bhadra、Bhado(n)/Bhadon（更偏北印度口语/转写），但在学术或正式语境里 Bhadrapada 更常见。"]}
{"word":"Bhaga","summary":{"en":"Bhaga is a Sanskrit/Hindu term most often referring to a Vedic deity of fortune and “one’s share,” and more broadly the idea of a portion or good fortune.","zh":"Bhaga 多指梵语/印度教语境中的“福分、份额”，常用来称呼与好运和财富相关的吠陀神祇，也可泛指“分得的一份/福气”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Hindu (especially Vedic) tradition, Bhaga is a god associated with good fortune, wealth, and a fair share or portion of blessings.","zh":"在印度教（尤其是吠陀传统）中，Bhaga（婆伽/薄伽）是一位与福分、财富以及“应得的一份/份额”相关的神祇。"},"examples":[{"en":"In some Vedic hymns, Bhaga is invoked to bring good fortune to people.","zh":"在一些吠陀赞歌中，人们祈请 Bhaga 带来好运。"},{"en":"The name Bhaga is connected with the idea of receiving one’s rightful share of blessings.","zh":"Bhaga 这个名字与“获得应得的福分/份额”的观念有关。"}]},{"partOfSpeech":"n.","definition":{"en":"A Sanskrit word meaning “share, portion,” and by extension “fortune” or “prosperity,” often seen in South Asian religious or cultural contexts.","zh":"一个梵语词，意为“份额/部分”，并引申为“福气、兴盛”，常见于南亚宗教或文化语境。"},"examples":[{"en":"The Sanskrit root idea of bhaga relates to a portion or allotment.","zh":"梵语中 bhaga 的词根含义与“分配到的一份/份额”有关。"},{"en":"You may see bhaga in discussions of ancient Indian religion and language.","zh":"在关于古印度宗教与语言的讨论中，你可能会看到 bhaga 这个词。"}]}],"synonyms":["fortune","prosperity","share (in meaning)","portion (in meaning)"],"phonetic":"/ˈbɑːɡə/","extraExplanation":["在英文里，Bhaga 多作为宗教/文化专有名词出现，通常指吠陀时代与“福分、财富、份额”相关的神祇；在学术或翻译语境中也可能直接保留梵语词形 bhaga。","它与常见词族有关：例如 Bhagavān（常译“世尊/至尊者”）与 Bhagavad Gītā（《薄伽梵歌》）都共享同一词根意象，和“福德、尊贵、神圣的赐予”这类概念有联系。"]}
{"word":"bhaga","summary":{"en":"“Bhaga” is most commonly a proper name in Vedic Hindu tradition (a deity of fortune). In romanized Hindi, it can also mean “ran/ran away,” depending on context.","zh":"“Bhaga”最常见是吠陀印度教中的专名（与好运相关的神祇）；在印地语罗马字拼写中，也可能表示“跑了／逃走了”，需看语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Hinduism, Vedic tradition) Bhaga: a deity associated with good fortune, prosperity, and the distribution of shares or blessings.","zh":"（印度教／吠陀传统）Bhaga：与好运、财富以及“份额／福分”的分配有关的神祇。"},"examples":[{"en":"In some Vedic hymns, Bhaga is invoked to bring prosperity and blessings.","zh":"在一些吠陀赞歌中，人们会祈请 Bhaga 带来繁荣与祝福。"},{"en":"The name Bhaga is sometimes discussed in studies of early Vedic religion.","zh":"在研究早期吠陀宗教时，有时会讨论 Bhaga 这个名字。"}]},{"partOfSpeech":"other","definition":{"en":"(Hindi, informal borrowing/romanization) bhaga: a form of the verb ‘to run,’ often understood as “ran” or “(he) ran away,” depending on context.","zh":"（印地语；非正式拼写／罗马字转写）bhaga：动词“跑”的一种形式，常可理解为“跑了／逃走了”，具体看语境。"},"examples":[{"en":"He wrote in Hindi: “Woh bhaga,” meaning “He ran away.”","zh":"他用印地语写：“Woh bhaga”，意思是“他逃走了／他跑掉了”。"},{"en":"If you see “bhaga” in chat, it may be a romanized Hindi word rather than English.","zh":"如果你在聊天里看到“bhaga”，它可能是印地语的罗马字拼写，而不是英语单词。"}]}],"synonyms":["(deity) fortune-god","(Hindi sense) ran away","fled"],"phonetic":"ˈbɑːɡə","extraExplanation":["“Bhaga”在英语里并不是常见词。你可能在宗教学、神话学或南亚语言相关语境中见到它。","在吠陀文化里，“Bhaga”与“份额、福分、好运”的观念相关；在现代语境中更多作为专有名词出现。","如果你想查的是某个特定用法（例如人名、地名、歌词、或你看到的句子），把原句贴出来我可以更准确判断含义。"]}
{"word":"Bhagalpur","summary":{"en":"Bhagalpur is a city (and also a district) in Bihar, India, known for its Ganges-side location and silk industry.","zh":"Bhagalpur 是印度比哈尔邦的一座城市（也指同名地区），以恒河沿岸位置和丝绸产业闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in the state of Bihar, eastern India, located on the Ganges River.","zh":"印度东部比哈尔邦的一座城市，位于恒河沿岸。"},"examples":[{"en":"Bhagalpur is a city in Bihar on the Ganges River.","zh":"Bhagalpur 是比哈尔邦一座位于恒河边的城市。"},{"en":"They traveled from Patna to Bhagalpur by road.","zh":"他们从巴特那（Patna）乘车前往 Bhagalpur。"}]},{"partOfSpeech":"n.","definition":{"en":"A district/region in Bihar named after the city (Bhagalpur district).","zh":"以该城市命名的比哈尔邦行政区域（Bhagalpur 地区/县）。"},"examples":[{"en":"The project supports farmers in the Bhagalpur district.","zh":"该项目支持 Bhagalpur 地区的农民。"},{"en":"He works as a teacher in Bhagalpur district.","zh":"他在 Bhagalpur 地区当老师。"}]}],"synonyms":["Silk City (nickname)"],"phonetic":"/ˈbɑːɡəlpʊr/","extraExplanation":["Bhagalpur 常被称为“Silk City（丝绸之城）”，因当地的 Tussar silk（柞蚕丝/塔萨丝）织品闻名。","它位于恒河沿岸，历史上是重要的贸易与手工业地区；当地也有知名学府如 Tilka Manjhi Bhagalpur University。","英文中这是专有名词：通常首字母大写（Bhagalpur），不加冠词；说“in Bhagalpur / to Bhagalpur”。"]}
{"word":"bhagat","summary":{"en":"Bhagat most commonly means a (South Asian) religious devotee, sometimes a saint-like figure; it is also a common South Asian surname.","zh":"Bhagat 常指（南亚语境的）宗教虔诚信徒，有时指类似圣者的人物；也可作南亚常见姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In South Asian (especially Indian) contexts, a religious devotee; sometimes used for a holy person, saint, or spiritual follower.","zh":"在南亚（尤其印度）语境中，指宗教虔诚信徒；有时也指圣人、修行者或某位灵修传统的追随者。"},"examples":[{"en":"In the village, people spoke of him as a bhagat who lived a simple, devoted life.","zh":"在村里，人们说他是一位 bhagat，过着简朴而虔诚的生活。"},{"en":"The festival included songs honoring famous bhagats and their teachings.","zh":"节庆活动中有歌曲来赞颂著名的 bhagat 及其教导。"}]},{"partOfSpeech":"n.","definition":{"en":"A South Asian family name (surname).","zh":"南亚常见的姓氏。"},"examples":[{"en":"Her last name is Bhagat.","zh":"她的姓是 Bhagat。"}]}],"synonyms":["devotee","worshipper","follower","saint","ascetic"],"phonetic":"/ˈbʌɡət/","extraExplanation":["Bhagat 是从多种印度语言（如印地语、旁遮普语等）进入英语语境的外来词，常与“奉献/虔敬”（devotion）相关的宗教文化有关。不同地区与宗教传统里，它的指向可能从“一般信徒”到“受敬重的圣者/修行者”不等。","在英语文本中，是否大写常取决于用法：指姓氏或特定人物时通常大写（Bhagat）；作为普通名词时有时小写（bhagat）。"]}
{"word":"Bhagavad-Gita","summary":{"en":"The Bhagavad-Gita is a famous Hindu scripture about duty and spiritual life, told as a dialogue between Arjuna and Krishna.","zh":"《薄伽梵歌》是著名的印度教经典，通过阿周那与克里希那的对话讲述本分与灵性生活。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sacred Hindu scripture (part of the Indian epic the Mahabharata) presented as a dialogue between Prince Arjuna and the god Krishna about duty, ethics, and spiritual liberation.","zh":"《薄伽梵歌》（印度教经典，属于印度史诗《摩诃婆罗多》的一部分），以阿周那王子与神祇克里希那的对话形式，探讨责任（本分）、伦理与灵性解脱。"},"examples":[{"en":"Many people read the Bhagavad-Gita for guidance on how to act with courage and integrity.","zh":"许多人阅读《薄伽梵歌》，以寻求如何勇敢、正直行事的指引。"},{"en":"In a world literature class, we discussed the Bhagavad-Gita alongside the Iliad and the Bible.","zh":"在世界文学课上，我们把《薄伽梵歌》与《伊利亚特》和《圣经》一起讨论。"},{"en":"The Bhagavad-Gita teaches that doing your duty without attachment to results can be a spiritual practice.","zh":"《薄伽梵歌》强调：尽本分而不执着于结果，也可以是一种修行。"}]}],"synonyms":["the Gita","Bhagavad Gita","Bhagavadgita"],"phonetic":"/ˌbɑːɡəvəd ˈɡiːtɑː/","extraExplanation":["常见写法有 Bhagavad-Gita、Bhagavad Gita，也常简称为 the Gita（《歌》）。英文里它通常被当作专有名词使用，前面可加定冠词：the Bhagavad-Gita。","核心语境常围绕三个概念：dharma（法/本分/正道）、karma（业/行动）、yoga（瑜伽/修行之道）。这里的 “yoga” 不只指体式练习，更常指心性与灵性训练的路径。","在英语文化语境中，这部经典常被引用来讨论“在压力与道德困境中如何做正确的事”，因此在哲学、宗教研究、领导力与心理韧性等领域也会出现。"]}
{"word":"Bhagavadgita","summary":{"en":"The Bhagavadgita (Bhagavad Gita) is a major Hindu scripture teaching duty, right action, and devotion through a dialogue between Arjuna and Krishna.","zh":"《薄伽梵歌》（Bhagavadgita/Bhagavad Gita）是印度教重要经典，通过阿周那与奎师那的对话阐释职责、正当行动与奉爱思想。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sacred Hindu scripture, presented as a dialogue between Prince Arjuna and the god Krishna, teaching spiritual duty, right action, and devotion.","zh":"《薄伽梵歌》（也译《博伽梵歌》），印度教重要经典，以阿周那与奎师那的对话形式讲述灵性责任、正当行动与虔敬之道。"},"examples":[{"en":"In a world religions class, we read passages from the Bhagavad Gita.","zh":"在世界宗教课上，我们阅读了《薄伽梵歌》的节选。"},{"en":"The Bhagavad Gita discusses how to act with integrity even under pressure.","zh":"《薄伽梵歌》探讨了即使在压力之下也要如何正直行事。"}]}],"synonyms":["Bhagavad Gita","the Gita"],"phonetic":"/ˌbɑːɡəvəd ˈɡiːtə/","extraExplanation":["英文里常写作 Bhagavad Gita 或 The Bhagavad Gita；也常简称为 the Gita（“歌/颂”之意）。","它是史诗《摩诃婆罗多》（Mahabharata）中的一部分，背景是大战前夕的道德与心理挣扎，因此常被引用来讨论“职责（dharma）”“无执着的行动（karma yoga）”和“奉爱（bhakti）”等主题。","作为专有名词，英文书写通常首字母大写；引用时常见章节-诗句格式（如 2.47）。"]}
{"word":"Bhagavan","summary":{"en":"Bhagavan is a respectful title meaning “the Lord/the Blessed One,” used for God or a highly revered spiritual figure, especially in Indian religions.","zh":"Bhagavan 是表示“主/至福者”的尊称，常用于印度宗教中称呼神或极受崇敬的灵性人物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Hinduism, and sometimes in related Indian traditions) a title meaning “the Lord” or “the Blessed One,” used for God or for a highly revered divine figure (such as Vishnu, Krishna, or Shiva).","zh":"（主要用于印度教，也见于相关印度传统）意为“主”“至福者/具大福德者”的尊称，用来称呼神，或极受崇敬的神圣存在（如毗湿奴、克里希纳或湿婆）。"},"examples":[{"en":"Many Hindus call Krishna “Bhagavan” to show reverence.","zh":"许多印度教徒称克里希纳为“Bhagavan”，以示尊敬。"},{"en":"The text praises Bhagavan as the source of compassion and wisdom.","zh":"这部经典赞颂“Bhagavan”是慈悲与智慧的源头。"}]},{"partOfSpeech":"n.","definition":{"en":"a respectful form of address for a spiritually advanced teacher or saint (especially in Indian contexts).","zh":"（尤用于印度语境）对德高望重的灵性导师或圣者的尊称。"},"examples":[{"en":"Devotees waited to receive Bhagavan’s blessing.","zh":"信众等待接受“Bhagavan”的祝福。"},{"en":"In that community, they simply called the teacher “Bhagavan.”","zh":"在那个团体里，他们就直接称那位老师为“Bhagavan”。"}]}],"synonyms":["God","the Lord","the Blessed One","Bhagwan"],"phonetic":"/ˈbɑːɡəˌvɑːn/","extraExplanation":["“Bhagavan”来自梵语 Bhagavān（常见转写也有 Bhagwan）。它含有“具福德、具威德、具神圣力量”的意味，因此既可指至高神，也可作为对圣者/导师的敬称。","在一些佛教语境中，相关词形“Bhagavān/ Bhagavā”也可用作对佛陀的尊称（汉译常见“世尊”）。具体指谁通常要看宗教与文本背景。"]}
{"word":"bhagavat","summary":{"en":"Bhagavat is a respectful Sanskrit title meaning “the Blessed One/Lord,” used mainly for Vishnu/Krishna and sometimes for the Buddha.","zh":"Bhagavat 是梵语敬称，意为“有福者／主”，主要用于尊称毗湿奴／克里希那，有时也指佛陀。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Sanskrit honorific meaning “the Blessed One” or “the Lord,” used as a respectful title for a revered deity (especially Vishnu/Krishna in Hinduism) and sometimes for the Buddha in Buddhist texts.","zh":"（梵语敬称）意为“有福者／至尊者／主”，用于尊称受敬仰的神祇（尤其在印度教中指毗湿奴／克里希那），有时也用于佛教经典中对佛陀的尊称。"},"examples":[{"en":"In many Hindu traditions, Bhagavat is used as a title for Vishnu or Krishna.","zh":"在许多印度教传统中，Bhagavat 常作为毗湿奴或克里希那的尊称。"},{"en":"Some translations render Bhagavat as “the Blessed One.”","zh":"有些译本把 Bhagavat 译为“有福者”。"}]}],"synonyms":["Bhagavan","the Blessed One","the Lord"],"phonetic":"/ˈbɑːɡəvət/","extraExplanation":["Bhagavat 常见的更标准转写是 Bhagavān（或 Bhagavan）。“-vān”带有“具备、拥有（某种德性/力量）的人”的意思，因此整体可理解为“具足福德与尊贵者”。","在不同传统里，它可能指向不同对象：印度教中常指毗湿奴/克里希那；部分佛教（尤其巴利语传统中对应 Bhagavā）用作佛陀的尊号。阅读时可以根据上下文判断所指。","英文写作中有时会把它当作专有名词（Bhagavat）使用；也会在复合词中出现，如 Bhagavata（与《薄伽梵往世书》相关）。"]}
{"word":"bhagavata","summary":{"en":"Bhagavata most commonly refers to the Bhagavata Purana (Srimad Bhagavatam) or, more generally, a devotee of Krishna/Vishnu in a bhakti tradition.","zh":"Bhagavata最常指《薄伽梵往世书》（《圣薄伽梵书》），也可泛指奎师那/毗湿奴虔爱传统中的信徒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Hinduism) The Bhagavata Purana (also called the Srimad Bhagavatam), a major Sanskrit religious text centered on devotion (bhakti), especially to Krishna/Vishnu.","zh":"（印度教）《薄伽梵往世书》（也称《圣薄伽梵书》/《至尊圣典》），一部重要的梵文宗教经典，强调“虔爱（bhakti）”，尤其崇奉奎师那/毗湿奴。"},"examples":[{"en":"Many Hindus know stories of Krishna from the Bhagavata.","zh":"许多印度教徒通过《薄伽梵往世书》了解奎师那的故事。"},{"en":"The Bhagavata Purana is often read aloud during festivals and devotional gatherings.","zh":"《薄伽梵往世书》常在节庆和虔爱集会中被朗诵。"}]},{"partOfSpeech":"n.","definition":{"en":"A devotee (worshiper) of Bhagavan—commonly Vishnu or Krishna; a follower of a Vaishnava devotional tradition.","zh":"“薄伽梵（Bhagavan）”的信徒（崇拜者）——常指毗湿奴或奎师那的信众；毗湿奴派虔爱传统的追随者。"},"examples":[{"en":"He identified as a Bhagavata and practiced daily chanting.","zh":"他自称为一名Bhagavata（薄伽梵信徒），每天持诵圣名。"},{"en":"Bhagavata traditions emphasize loving devotion rather than ritual alone.","zh":"Bhagavata传统强调“爱与虔诚的奉献”，而不只是仪式本身。"}]}],"synonyms":["Bhagavata Purana","Srimad Bhagavatam","Bhagavatam","Vaishnava devotee","Krishna devotee"],"phonetic":"/ˌbɑːɡəˈvɑːtə/","extraExplanation":["“Bhagavata”来自梵语词根：Bhagavān（薄伽梵/至尊神）+ -ta（表示“与……有关的人/事”）。因此它既可指“与薄伽梵相关的经典”，也可指“薄伽梵的信徒”。","在英语中常见大小写差异：Bhagavata（更像专名/与经典相关）与 bhāgavata/bhagavata（更泛指“信徒”或“传统”）。不同学者的拼写也可能不同，如 Bhāgavata。"]}
{"word":"Bhagavatam","summary":{"en":"Bhagavatam usually means the Śrīmad Bhāgavatam (Bhāgavata Purāṇa), a major Hindu devotional scripture about Vishnu/Krishna.","zh":"Bhagavatam 通常指《Śrīmad Bhāgavatam》（《Bhāgavata Purāṇa／博伽梵往世书》），一部重要的印度教奉爱经典，主要关于毗湿奴／克里希纳。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) The Bhāgavatam, most commonly referring to the Śrīmad Bhāgavatam (also called the Bhāgavata Purāṇa), a major Hindu sacred text that tells stories of Vishnu/Krishna and teaches devotion (bhakti).","zh":"（专有名词）Bhāgavatam，最常指《Śrīmad Bhāgavatam》（也称《Bhāgavata Purāṇa／博伽梵往世书》），一部重要的印度教经典，讲述毗湿奴／克里希纳的故事，并强调虔爱（bhakti）修行。"},"examples":[{"en":"Many devotees read the Bhagavatam every morning as part of their worship.","zh":"许多信众把每天早晨诵读《Bhagavatam》当作礼拜的一部分。"},{"en":"The Bhagavatam includes famous stories about Krishna’s childhood.","zh":"《Bhagavatam》中包含许多著名的克里希纳童年故事。"},{"en":"In class, we compared the Bhagavatam with other Hindu Puranas.","zh":"课堂上我们把《Bhagavatam》和其他印度教《往世书》作了比较。"}]}],"synonyms":["Śrīmad Bhāgavatam","Bhāgavata Purāṇa","Bhagavata Purana"],"phonetic":"/ˌbɑːɡəˈvɑːtəm/","extraExplanation":["“Bhagavatam”源自梵语转写 Bhāgavatam（常见全名为 “Śrīmad Bhāgavatam”），在英文中通常直接指这部经典本身。不同译写还包括 Bhagavata Purana、Bhagavata Purāṇa。","该书在毗湿奴派（Vaishnavism）传统中地位很高，核心主题是“bhakti（虔爱/奉爱）”，常以颂诗形式呈现，常见场景有诵读（recitation）、讲解（discourse）、研读（study）。","注意大小写：作为书名/经典时通常大写 Bhagavatam；若泛指“与 Bhagavata（奉爱者）相关的传统/内容”，有时也会出现在较学术的语境中，但最常见仍是指这本书。"]}
{"word":"Bhai","summary":{"en":"“Bhai” means “brother” and is often used like “bro” in South Asian contexts.","zh":"“Bhai”意为“兄弟”，在南亚语境中也常像英语“bro”一样用作亲切称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English, from Hindi/Urdu) a brother; also a friendly way to address a male friend, like “bro.”","zh":"（南亚英语，源自印地语/乌尔都语）兄弟；也可作对男性朋友的亲切称呼，相当于“bro/兄弟”"},"examples":[{"en":"Bhai, can you help me for a minute?","zh":"兄弟，能帮我一下吗？"},{"en":"He’s not my real bhai, but we grew up together.","zh":"他不是我亲兄弟，但我们一起长大。"},{"en":"Thanks, bhai—really appreciate it.","zh":"谢谢你，兄弟——真的很感激。"}]}],"synonyms":["brother","bro","buddy","mate"],"phonetic":"/baɪ/","extraExplanation":["“bhai”在印度、巴基斯坦等地非常常见，既可指亲兄弟，也常用于称呼朋友或熟人，表达亲近与义气感，语气类似英语里的“bro / buddy”。","在不同地区口音里读音会有差别；写成英文时也常见“bhai”“bhaiyya/ bhaiya”（更口语、带点“哥哥/大哥”感觉）。","在正式英语写作中一般不用“bhai”，更适合用于对话、社交媒体、影视台词或表现南亚文化语境。"]}
{"word":"bhaiachara","summary":{"en":"Bhaiachara means “brotherhood” or community unity, especially in South Asian contexts.","zh":"Bhaiachara 指“兄弟情谊/团结互助”，多用于南亚语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English; from Hindi/Urdu) brotherhood; a feeling of close friendship, unity, and mutual support within a community or group.","zh":"（南亚英语；源自印地语/乌尔都语）兄弟情谊；群体或社区内部的团结、友爱与互相扶持的精神。"},"examples":[{"en":"In our neighborhood, bhaiachara matters more than politics.","zh":"在我们社区里，兄弟情谊比政治更重要。"},{"en":"The festival brought people together and strengthened bhaiachara.","zh":"节日把大家凝聚在一起，增强了团结友爱的精神。"},{"en":"He spoke about bhaiachara and respecting every community.","zh":"他谈到兄弟情谊，以及尊重每个社群。"}]}],"synonyms":["brotherhood","solidarity","unity","camaraderie","community spirit"],"phonetic":"/ˌbaɪˈtʃɑːrə/","extraExplanation":["“Bhaiachara”（也常拼作 bhai-chara / bhai chara / bhāīcārā）在印度、巴基斯坦等南亚语境里很常见，常用来强调“我们是一家人”的社会凝聚力与互助精神。","词源上由“bhai（兄弟）+ chara/chaara（行为、相处方式）”组成，含义接近“像兄弟一样相处”。","在公共演讲、社区活动、节庆或讨论社会和谐时经常出现，语气通常积极、温和、具有号召力。"]}
{"word":"bhaiachari","summary":{"en":"“Bhaiachari” means brotherhood—warm solidarity and mutual support (a Hindi/Urdu-based loanword).","zh":"“Bhaiachari”指“兄弟情/团结互助的氛围”（源自印地语/乌尔都语的借词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"brotherhood; a feeling of solidarity and friendly unity among people (a South Asian loanword, commonly from Hindi/Urdu “bhai-chara/bhai-chārā”).","zh":"兄弟情；团结互助、像兄弟一样的友好情谊（南亚语借词，常见源自印地语/乌尔都语“bhai-chara/bhai-chārā”）。"},"examples":[{"en":"In our neighborhood, people try to keep bhaiachari by helping each other during festivals.","zh":"在我们社区，大家会在节日期间互相帮忙，保持“bhaiachari”（兄弟情、团结氛围）。"},{"en":"The coach said the team needs bhaiachari, not ego.","zh":"教练说球队需要的是“bhaiachari”（团结精神），不是自我。"}]}],"synonyms":["brotherhood","solidarity","unity","camaraderie","community spirit"],"phonetic":"/ˌbaɪəˈtʃɑːri/","extraExplanation":["“bhaiachari”多见于网络拼写，常见变体有“bhai chara / bhaichara / bhaichारा”等；在英语语境里通常作为带文化色彩的借词使用，表示“像兄弟一样的团结、互挺”。","“bhai”在印地语/乌尔都语里是“兄弟”，而“chara/chārā”有“相处方式/情谊”的含义（口语中合起来强调群体内部的和睦与互助）。","使用时注意场合：它带有南亚文化社群语感；在正式英文写作中，常用“brotherhood/solidarity/community spirit”来替代，更通用。"]}
{"word":"Bhairav","summary":{"en":"Bhairav is either a fierce form of Shiva in Hinduism or the name of a serious, devotional Indian classical raga often performed at dawn.","zh":"Bhairav 可指印度教中湿婆神的威猛化身，也可指印度古典音乐中庄重虔敬、常在清晨演奏的 Bhairav 拉格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Hinduism) A fierce form/aspect of the god Shiva, often associated with protection, destruction of evil, and ascetic power; also used as a name for this deity in worship and temples.","zh":"（印度教）湿婆神（Shiva）的一种威猛化身/面相，常与守护、消灭邪恶与苦行力量相关；也可用作供奉或寺庙中此神祇的称呼。"},"examples":[{"en":"Many devotees visit a Bhairav temple to ask for protection.","zh":"许多信众会去拜谒拜拉瓦（Bhairav）寺庙以祈求庇护。"},{"en":"In some stories, Bhairav appears as a guardian who removes fear.","zh":"在一些传说里，Bhairav 以守护者的形象出现，驱除恐惧。"}]},{"partOfSpeech":"n.","definition":{"en":"(Indian classical music) A raga (melodic framework) called Bhairav, traditionally performed in the early morning and known for a serious, devotional mood.","zh":"（印度古典音乐）名为 Bhairav 的拉格（旋律框架），传统上多在清晨演奏，氛围庄重、带有虔敬感。"},"examples":[{"en":"The concert opened with Raga Bhairav at dawn.","zh":"音乐会在黎明以 Bhairav 拉格开场。"},{"en":"She practiced Bhairav to develop a calm, meditative tone.","zh":"她练习 Bhairav 拉格来培养沉静、冥想般的音色。"}]}],"synonyms":["Bhairava","Shiva (contextual)","Raga Bhairav"],"phonetic":"ˈbaɪrəv","extraExplanation":["“Bhairav”常见的梵语转写形式还有“Bhairava”。英语里也常把它当作专有名词使用，首字母大写更常见。","在文化语境中，Bhairav 往往带有“守护/威猛”的象征意义；在印度一些地区，人们会在特定节日或仪式中供奉他。","音乐里的“Raga Bhairav”常被描述为适合清晨（dawn）的拉格之一，强调肃穆、内省的情绪。"]}
{"word":"Bhairava","summary":{"en":"Bhairava is a fierce, protective form of Shiva in Hinduism, and the name also appears in temple and festival contexts.","zh":"Bhairava是印度教中湿婆的忿怒护法化身；该词也常用于相关寺庙、节庆与仪式的名称中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Hinduism) A fierce form of Shiva, often seen as a protector deity associated with time, destruction, and guardianship (especially of sacred places).","zh":"（印度教）湿婆（Shiva）的忿怒/威猛化身之一，常被视为护法神，与时间、毁灭与守护（尤其是圣地的守护）相关。"},"examples":[{"en":"In some temples, devotees pray to Bhairava for protection before beginning a journey.","zh":"在一些寺庙里，信众会在出行前向Bhairava祈求护佑。"},{"en":"Kala Bhairava is worshipped in parts of India and Nepal as a powerful guardian figure.","zh":"在印度与尼泊尔的一些地区，人们供奉“Kala Bhairava”作为强大的守护神。"}]},{"partOfSpeech":"n.","definition":{"en":"A name or title used in South Asian culture for related deities, temples, festivals, or iconography connected to Bhairava.","zh":"南亚文化中对与Bhairava相关的神祇、寺庙、节庆或神像形象的名称/称号。"},"examples":[{"en":"The festival includes a procession to the Bhairava shrine.","zh":"节庆活动包括前往Bhairava神龛的游行。"},{"en":"You may see “Bhairava” used in the names of local temples and rituals.","zh":"你可能会在当地寺庙与仪式的名称中看到“Bhairava”。"}]}],"synonyms":["Kala Bhairava","Bhairav","Shiva (related)"],"phonetic":"/baɪˈrɑːvə/","extraExplanation":["“Bhairava”源自梵语，常与“可畏、威猛”的含义相连，因此在宗教艺术中形象往往更肃穆甚至令人敬畏，但其核心角色常被理解为“护法”——以强势的方式守护正道与圣地。","不同地区对Bhairava的供奉与诠释会有差异：例如“Kala Bhairava”（意为“黑/时间的Bhairava”）在某些传统中与“时间、死亡与无常”的主题联系更紧密。","作为专有名词，英文中通常大写为 Bhairava；在跨文化语境下提及相关信仰与仪式时，尊重当地用法与称呼会更得体。"]}
{"word":"Bhairavi","summary":{"en":"Bhairavi is mainly the name of a raga in Indian classical music, and it is also used as a South Asian female given name linked to a Hindu goddess.","zh":"Bhairavi 主要指印度古典音乐中的一种拉格（旋律框架），也可作南亚女性名字，与一位印度教女神有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a raga (melodic framework) in Indian classical music, often associated with a peaceful, devotional, or “ending” mood and commonly performed toward the end of a concert.","zh":"（印度古典音乐中的）一类拉格/拉格（旋律框架），常带有宁静、虔敬或“收束/终曲”的氛围，演出中也常在音乐会末尾演奏。"},"examples":[{"en":"The concert closed with Bhairavi, leaving the audience calm and reflective.","zh":"音乐会以《Bhairavi》收尾，让观众感到平静而沉思。"},{"en":"She is learning Bhairavi on the sitar.","zh":"她正在学习用西塔琴演奏《Bhairavi》。"}]},{"partOfSpeech":"n.","definition":{"en":"a female given name used in South Asia, connected to the Hindu goddess Bhairavi (a form of Devi/Shakti).","zh":"（南亚常见的）女性名字，与印度教女神“Bhairavi”（天母/女神 Devi 或 Shakti 的一种形态）有关。"},"examples":[{"en":"Bhairavi introduced herself and explained that her name comes from a goddess.","zh":"Bhairavi 做了自我介绍，并解释她的名字来自一位女神。"},{"en":"Bhairavi is a popular name in some Indian communities.","zh":"在一些印度社群中，Bhairavi 是一个常见的名字。"}]}],"synonyms":["Raga Bhairavi","Raag Bhairavi","raga"],"phonetic":"/baɪˈrɑːvi/","extraExplanation":["“Bhairavi”在北印度斯坦（Hindustani）与南印度卡纳提克（Carnatic）传统中都出现，但具体音阶细节与常见演绎方式可能不同；对学习者来说，可先把它理解为“特定情绪与规则下的旋律类型”。","在印度古典音乐语境里，raga（拉格）不只是“曲子”，更像一套规定：哪些音更常用、如何上行/下行、常见装饰音与典型乐句等，因此同一个 Bhairavi 可以有很多不同版本的即兴与作品。","作为专有名词，英语中常大写 Bhairavi；在音乐节目单中也可能写作 “Raag Bhairavi” 或 “Raga Bhairavi”。"]}
{"word":"bhaiyachara","summary":{"en":"Bhaiyachara means “brotherhood” or strong solidarity and mutual support, especially in South Asian contexts.","zh":"Bhaiyachara 指“兄弟情谊/兄弟般的团结互助”，多见于南亚语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Brotherhood; a friendly feeling of solidarity, mutual support, and loyalty (often used in South Asian/Indian contexts).","zh":"兄弟情谊；兄弟般的团结互助与义气（常用于南亚/印度语境）。"},"examples":[{"en":"In our neighborhood, bhaiyachara matters more than money.","zh":"在我们社区里，兄弟情谊比钱更重要。"},{"en":"The team won because of their bhaiyachara and trust.","zh":"这支队伍靠兄弟情谊和信任赢了。"},{"en":"They helped each other during the festival—pure bhaiyachara.","zh":"他们在节日期间互相帮忙——这就是纯粹的兄弟情谊。"}]}],"synonyms":["brotherhood","solidarity","camaraderie","fellowship","unity"],"phonetic":"/ˌbaɪ.jəˈtʃɑː.rə/","extraExplanation":["“bhaiyachara”源自印地语/乌尔都语：bhai（兄弟）+ -chara/-chāra（相处方式、关系），常指一种重情重义、互相照应的群体氛围。","它既可以是积极的“团结、互助”，也可能在某些语境里暗含“讲义气、护自己人”的社交规则；具体褒贬要看上下文。","英文写作中通常用斜体或引号标出（bhaiyachara），或直接翻译为 brotherhood/solidarity，帮助不熟悉南亚文化的读者理解。"]}
{"word":"bhajan","summary":{"en":"A bhajan is an Indian devotional hymn, especially in Hindu practice, sung to praise a deity.","zh":"bhajan 指印度（尤指印度教）中的虔敬赞歌/唱诵，用于赞颂神祇与修行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A devotional song or hymn from Indian religious traditions, especially Hinduism, meant for singing in praise of a deity and for spiritual practice.","zh":"（印度宗教传统中的）虔敬歌曲／赞歌，尤指印度教中用来赞颂神祇、进行修行或祈祷的唱诵。"},"examples":[{"en":"They sang a bhajan together at the temple.","zh":"他们在寺庙里一起唱诵了一首bhajan（虔敬赞歌）。"},{"en":"Her grandmother plays the harmonium while the family sings bhajans in the evening.","zh":"她奶奶弹着簧风琴（harmonium），家人在傍晚一起唱bhajan。"},{"en":"The festival program included dance, prayers, and a short bhajan session.","zh":"节日活动安排包括舞蹈、祈祷和一段简短的bhajan唱诵。"}]}],"synonyms":["devotional song","hymn","kirtan (related)"],"phonetic":"/bəˈdʒɑːn/","extraExplanation":["Bhajan 常见于印度教的“敬神唱诵”传统，也会在一些印度文化/宗教社群活动中出现。形式上通常是集体合唱或领唱-和唱，歌词多为对神祇的赞颂、祈愿或教诲。","与 kirtan 相比：很多人会把两者都译作“赞歌/唱诵”。一般来说，kirtan 更常见为呼应式（call-and-response）的唱诵；bhajan 往往更像一首结构完整的虔敬歌曲（但实际使用中也常互相重叠）。","英语语境里使用 bhajan 时，通常保留其文化含义，不会简单等同于 church hymn（基督教圣诗）；翻译时可根据场景译为“印度教赞歌/虔敬赞歌/唱诵”。"]}
{"word":"bhakta","summary":{"en":"A bhakta is a devotee, especially in Hinduism.","zh":"bhakta 指（尤指印度教中的）虔诚信徒、奉献者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a devotee or worshipper, especially a person devoted to a Hindu deity or to a spiritual teacher (guru).","zh":"（尤指印度教中的）虔诚信徒；奉献者；（对某位神祇或上师）非常忠诚的崇拜者。"},"examples":[{"en":"In many temples, bhaktas gather to sing devotional songs.","zh":"在许多寺庙里，虔诚信徒会聚在一起唱颂歌。"},{"en":"He described himself as a bhakta of Krishna.","zh":"他形容自己是克里希纳的虔诚信徒。"},{"en":"The teacher reminded the group that a true bhakta serves others with humility.","zh":"老师提醒大家，真正的奉献者会以谦卑之心服务他人。"}]}],"synonyms":["devotee","worshipper","follower","disciple"],"phonetic":"/ˈbʌk.tə/","extraExplanation":["“Bhakta”来自梵语，和“bhakti（奉爱/虔敬之道）”同源。在英语里常见于印度教语境，尤其是谈到“Bhakti yoga（奉爱瑜伽/奉献之道）”时。","在一些国际性的印度教团体或相关英文资料中（如谈到唱诵、敬拜、供奉等修行），也会直接用 bhakta 指“修奉爱之道的人”。","用法提示：在英文中它通常作可数名词（a bhakta / bhaktas），语气偏宗教与文化专用词，日常英语里更常用 devotee、worshipper、follower 作为通用表达。"]}
{"word":"Bhaktapur","summary":{"en":"Bhaktapur is a historic city in Nepal’s Kathmandu Valley, known for temples, medieval architecture, and Newar culture.","zh":"Bhaktapur（巴克塔普尔）是尼泊尔加德满都谷地的历史名城，以寺庙、中世纪建筑与纽瓦尔文化闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historic city in the Kathmandu Valley of Nepal, famous for well-preserved medieval architecture, temples, and traditional Newar culture.","zh":"尼泊尔加德满都谷地的一座历史名城，以保存良好的中世纪建筑、寺庙与纽瓦尔（Newar）传统文化闻名。"},"examples":[{"en":"We took a day trip from Kathmandu to Bhaktapur to see the old squares and temples.","zh":"我们从加德满都出发去巴克塔普尔一日游，参观古老的广场和寺庙。"},{"en":"Bhaktapur is known for its brick streets, wood carvings, and lively festivals.","zh":"巴克塔普尔以红砖街道、木雕工艺和热闹的节庆而闻名。"}]}],"synonyms":["Bhaktapur (Durbar Square area)","Bhadgaon (older name/variant)"],"phonetic":"/ˌbʌk.təˈpʊr/","extraExplanation":["“Bhaktapur”常被译作“巴克塔普尔”，也有人按发音写作“巴德岗”（较旧的中文译名之一）。它曾是马拉王朝时期的重要都城之一，核心景点包括Bhaktapur Durbar Square（巴克塔普尔王宫广场）等世界文化遗产区域。","词源上常被解释为与梵语/尼泊尔语中表示“奉献/信徒（bhakta）”和“城市（pur/pura）”的成分有关，因此有“虔信者之城/奉献之城”之类的含义解读。"]}
{"word":"bhaktas","summary":{"en":"Bhaktas are devoted worshippers—especially followers who practice bhakti (loving devotion) in Hindu traditions.","zh":"Bhaktas 指虔诚信徒，尤指印度教中实践 bhakti（奉爱/虔爱）传统的信众。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a devoted follower or worshipper, especially someone who practices bhakti (loving devotion to a deity) in Hindu traditions; plural of *bhakta*","zh":"虔诚信徒；（尤指印度教中实践“虔爱/奉爱”（bhakti）传统的人）；*bhakta* 的复数"},"examples":[{"en":"The temple was filled with bhaktas singing and praying together.","zh":"寺庙里挤满了信众（bhaktas），大家一起唱诵祈祷。"},{"en":"Many bhaktas of Krishna celebrate festivals with music and dance.","zh":"许多克里希纳的信众会用音乐和舞蹈来庆祝节日。"},{"en":"She studied how bhaktas express devotion through chanting.","zh":"她研究信众如何通过诵唱来表达虔爱。"}]}],"synonyms":["devotees","worshippers","adherents","followers"],"phonetic":"ˈbʌk.tə","extraExplanation":["“Bhakta”来自梵语/印度语言语境，常见于印度教（也可见于某些与奉爱相关的宗教文化讨论）中，强调一种以“爱与奉献”为核心的信仰实践（bhakti）。","英语里常直接借用该词来指特定文化与宗教背景下的“奉爱者/虔诚追随者”。在一般场合也可用更中性的词如 *devotees*（信徒/追随者）来替换。","复数形式通常写作 *bhaktas*；在谈论某位神祇的信众时，也常见表达：*bhaktas of Vishnu/Krishna/Shiva* 等。"]}
{"word":"bhakti","summary":{"en":"Bhakti means loving devotion and worship toward a deity, and it can also refer to devotional traditions or movements in Hinduism.","zh":"Bhakti 指对神明的爱与虔敬，也可指印度教中强调个人奉爱的传统或运动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Devotion and loving worship toward a god (especially in Hinduism), often shown through prayer, chanting, and service.","zh":"（尤指印度教中的）虔诚奉爱：对神明的爱与敬拜，常通过祈祷、诵唱与服务来表达。"},"examples":[{"en":"In many Hindu traditions, bhakti is a path to spiritual liberation through love and devotion.","zh":"在许多印度教传统中，bhakti 被视为通过爱与奉献获得精神解脱的一条道路。"},{"en":"She practices bhakti by singing devotional songs and offering food at the temple.","zh":"她通过唱奉爱歌并在寺庙供奉食物来实践 bhakti。"}]},{"partOfSpeech":"n.","definition":{"en":"A religious movement or tradition that emphasizes personal devotion to a deity (often contrasted with ritual or philosophical paths).","zh":"（宗教）奉爱传统/运动：强调对某位神明的个人虔敬（常与偏重仪式或哲学思辨的路径相对）。"},"examples":[{"en":"The bhakti movement spread across India and made devotional worship widely accessible.","zh":"奉爱运动传播到印度各地，使奉爱式敬拜更普及、更易参与。"},{"en":"Bhakti traditions often highlight a close, personal relationship with the divine.","zh":"奉爱传统常强调与神建立亲密、个人化的关系。"}]}],"synonyms":["devotion","devotional worship","piety","reverence"],"phonetic":"/ˈbʌk.ti/","extraExplanation":["“bhakti”源自梵语词根 *bhaj-*（有“分享、参与、敬奉”的含义），进入英语后多用于宗教学、历史或文化语境。","英文中常与“Hinduism（印度教）”“devotional（奉爱的/虔敬的）”“chanting（诵唱）”“kirtan（克尔坦：呼唱式奉爱歌）”等词一起出现。","大小写：一般写作小写 *bhakti*；若指特定传统或流派，有时会写作 *Bhakti*。"]}
{"word":"bhaktimarga","summary":{"en":"Bhakti Marga means “the path of devotion,” and often refers to a modern Hindu devotional movement.","zh":"Bhakti Marga 意为“奉爱之道”，也常指一个现代印度教奉爱灵修团体/运动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bhakti Marga: a modern Hindu spiritual path and global movement that teaches devotion (bhakti) to God—often expressed through prayer, chanting, service, and worship. The name literally means “the path of devotion.”","zh":"Bhakti Marga：一个现代的印度教灵修道路与国际性团体，强调以“奉爱（bhakti）”亲近神/至上者，常通过祈祷、唱诵、服务与礼拜来实践。其名称直译为“奉爱的道路/奉爱之道”。"},"examples":[{"en":"She started attending Bhakti Marga satsangs to learn devotional chanting.","zh":"她开始参加 Bhakti Marga 的共修（satsang），学习奉爱唱诵。"},{"en":"Bhakti Marga emphasizes serving others as an act of devotion.","zh":"Bhakti Marga 强调把服务他人当作一种奉爱实践。"}]}],"synonyms":["bhakti yoga","the path of devotion","devotional path"],"phonetic":"ˈbʌk.ti ˈmɑr.ɡə","extraExplanation":["“Bhakti Marga”来自梵语：bhakti（奉爱、虔敬）+ mārga（道路、路径）。在印度宗教语境里，mārga 常用来指一种修行途径，如“知识之道（jñāna-mārga）”“行动之道（karma-mārga）”。","当代语境中，Bhakti Marga 也常特指一个国际灵修组织（与其活动、道场、共修形式相关）。不同地区的实践细节可能不同；阅读或交流时可根据上下文判断是指“奉爱之道（概念）”还是“Bhakti Marga（团体/机构）”。"]}
{"word":"bhaktis","summary":{"en":"“Bhaktis” is the plural of “bhakti,” meaning different forms or traditions of devotional love and worship, especially in Hindu contexts.","zh":"“Bhaktis”是“bhakti”的复数，指不同形式或传统的奉爱与敬拜，尤其用于印度教语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"forms or expressions of bhakti—devotional love and worship (especially in Hindu traditions); used as the plural of “bhakti.”","zh":"“bhakti”的复数：指各种形式或表达方式的虔爱与敬拜（尤指印度教传统中的奉爱/信爱）。"},"examples":[{"en":"The class compared different bhaktis, from singing hymns to quiet meditation.","zh":"这节课比较了不同的奉爱形式，从唱赞歌到安静冥想。"},{"en":"In the reading, the poet describes bhaktis offered through music and service.","zh":"在阅读材料里，诗人描写了通过音乐与服务所呈献的奉爱。"}]},{"partOfSpeech":"n.","definition":{"en":"devotional movements or traditions centered on bhakti (often in discussions of Indian religious history).","zh":"以奉爱为核心的宗教运动或传统（常用于讨论印度宗教史时）。"},"examples":[{"en":"Scholars study medieval bhaktis for their influence on vernacular literature.","zh":"学者研究中世纪的奉爱运动，因为它们影响了地方语言文学。"}]}],"synonyms":["devotion","devotional worship","piety","reverence"],"phonetic":"/ˈbʌk.ti/","extraExplanation":["“Bhakti”源自梵语，核心含义是对神明的“虔爱、信爱、奉献式的爱”。英语里常把 bhakti 当作不可数名词（talk about bhakti），但当人们想强调“不同类型/表现方式/传统”时，也会用复数 bhaktis。","相关常见搭配：bhakti yoga（奉爱瑜伽/信爱之道）、Bhakti movement（奉爱运动，约中世纪时期在南亚发展，强调以情感与个人奉献来亲近神明）。"]}
{"word":"bhalu","summary":{"en":"“Bhalu” is a Hindi/Urdu word meaning “bear,” sometimes used as a cute nickname.","zh":"“bhalu”是印地语/乌尔都语里“熊”的意思，也可能作为可爱的昵称使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(From Hindi/Urdu) a bear; used as a borrowed word or as a nickname in South Asian contexts.","zh":"（源自印地语/乌尔都语）熊；在南亚语境中常作为借词或昵称使用。"},"examples":[{"en":"In Hindi, “bhalu” means “bear.”","zh":"在印地语里，“bhalu”就是“熊”。"},{"en":"He joked that his friend is a “bhalu” because he looks big and cuddly.","zh":"他开玩笑说朋友像个“bhalu”，因为看起来又壮又软萌。"}]}],"synonyms":["bear"],"phonetic":"/ˈbɑːluː/","extraExplanation":["“bhalu”（印地语写作 भालू，常转写为 bhaalu/bhaloo）在日常口语里就是“熊”。在印度的童话、儿歌或儿童故事里也很常见，有时会带一点可爱、憨厚的感觉，类似英文里把人叫作 “teddy bear”。","如果你在英文对话中使用 “bhalu”，通常需要补一句解释（例如 “bhalu means bear in Hindi”），否则多数英语母语者不一定听得懂。"]}
{"word":"bhandar","summary":{"en":"Bhandar means a storehouse or supply room, especially in South Asian contexts, sometimes for community or religious donations.","zh":"Bhandar 指“仓库/储藏室”，多见于南亚语境，有时特指社区或宗教活动中存放捐赠物资的地方。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English, from Hindi/Urdu and related languages) a storehouse or storage place for goods or supplies; a granary or pantry.","zh":"（南亚英语，源自印地语/乌尔都语等）仓库；储藏室；粮仓/食品储备处。"},"examples":[{"en":"The village keeps rice in the bhandar for the monsoon season.","zh":"村里把大米存放在 bhandar 里，以备雨季之需。"},{"en":"Please put the extra blankets back in the bhandar.","zh":"请把多余的毯子放回储藏间（bhandar）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Often in religious/community contexts) a place where donated food or supplies are stored and managed for serving the community.","zh":"（常用于宗教/社区语境）存放并管理捐赠食物或物资、用于供给大众的库房/物资点。"},"examples":[{"en":"Volunteers organized the bhandar before the community meal.","zh":"志愿者在社区餐食前整理了 bhandar（物资库/食物储备处）。"},{"en":"Donations are recorded and kept in the bhandar.","zh":"捐赠物资会登记后存放在 bhandar 里。"}]}],"synonyms":["storehouse","pantry","warehouse","granary","stockroom","treasury"],"phonetic":"/bʌnˈdɑr/","extraExplanation":["“bhandar”常被认为来自梵语 **bhāṇḍāra**（库房、宝库），在印地语/乌尔都语、旁遮普语等语言中都能见到相近形式。","在英语里它多见于南亚背景的对话、移民社群或宗教/社区活动语境中；写作时有时会与更通用的词（storehouse/pantry/warehouse）并用以帮助读者理解。"]}
{"word":"bhandari","summary":{"en":"Bhandari is mainly used as a South Asian surname, and it can also be an occupational name historically meaning a storekeeper or treasurer.","zh":"Bhandari 主要用作南亚姓氏，也可能源自职业称呼，历史上有“管仓/司库”的含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a South Asian family name (surname), common in Nepal and parts of India","zh":"南亚常见的姓氏（家族姓），在尼泊尔及印度部分地区较常见"},"examples":[{"en":"My teacher’s last name is Bhandari.","zh":"我老师的姓是 Bhandari。"},{"en":"Ms. Bhandari will lead today’s meeting.","zh":"Bhandari 女士将主持今天的会议。"}]},{"partOfSpeech":"n.","definition":{"en":"a title or occupational name that historically referred to a storekeeper, treasurer, or someone in charge of supplies","zh":"一种源自职业/头衔的名字，历史上可指“管库房的人、司库、负责物资的人”"},"examples":[{"en":"In some communities, the name Bhandari is linked to ancestors who managed a storehouse.","zh":"在一些社群里，Bhandari 这个名字与祖先管理仓库有关。"}]}],"phonetic":"/bʌnˈdɑːri/","extraExplanation":["Bhandari 通常是音译/拼写形式的专名，在英文里多用作姓氏；因为是专有名词，是否需要冠词（a/the）取决于语境，一般直接用作姓名（如 Mr. Bhandari）。","词源上常被认为与印度语系中表示“库房、仓库、储藏”的词根相关，因此带有“管仓、司库”的含义；但不同地区与社群的历史脉络可能不同。"]}
{"word":"bhang","summary":{"en":"Bhang is a traditional South Asian edible cannabis preparation, often used in drinks or sweets.","zh":"Bhang是南亚传统的可食用大麻制剂，常加入饮料或甜点中食用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an edible preparation made from cannabis leaves and buds, traditionally used in South Asia, often mixed into drinks or sweets","zh":"（南亚传统的）大麻叶与花制成的可食用制剂，常加入饮料或甜点中食用"},"examples":[{"en":"In some parts of India, people drink bhang during certain festivals.","zh":"在印度的一些地区，人们在某些节日期间会饮用bhang。"},{"en":"The recipe called for bhang mixed with milk, nuts, and spices.","zh":"这份食谱需要把bhang与牛奶、坚果和香料混合。"}]}],"synonyms":["cannabis (general)","marijuana (general)","cannabis edible"],"phonetic":"/bɑŋ/","extraExplanation":["“bhang”主要指用大麻叶（有时也包括花）做成的可食用制品，和更浓缩的“hashish（大麻脂/大麻膏）”不完全一样；它常见的形式是加在牛奶饮料或甜点里，因此起效更慢、持续更久。","在文化语境里，它常被提到与南亚部分地区的节庆（如洒红节 Holi）或宗教传统有关；但不同地区的法律与社会接受度差异很大，旅行或阅读新闻时要注意当地法规与语境。"]}
{"word":"bhangi","summary":{"en":"“Bhangi” is a South Asian term that most commonly refers to a Dalit community historically linked to sanitation work and is often used as a slur; it can also mean someone intoxicated on bhang.","zh":"“Bhangi”在南亚语境中多指历史上与环卫/掏粪等工作相关的达利特群体称呼，且常带侮辱性；也可指服用bhang（大麻制品）后处于醉态的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asia) A person from a Dalit community historically forced into sanitation work (such as cleaning latrines); in modern usage it is often a caste label used as an insult.","zh":"（南亚）指历史上被迫从事清洁、掏粪等卫生工作的达利特（贱民）群体成员；现代语境中常被当作带侮辱性的种姓称呼。"},"examples":[{"en":"That word is often used as a slur, so it’s better to avoid it in polite conversation.","zh":"那个词常被当作辱骂用语，所以在正式或礼貌的交流中最好避免使用。"},{"en":"The novel shows how Bhangi families faced discrimination for generations.","zh":"这部小说展现了Bhangi家庭世世代代遭受歧视的处境。"}]},{"partOfSpeech":"n.","definition":{"en":"(India, informal) A person under the influence of bhang (a cannabis preparation).","zh":"（印度，非正式）指服用了bhang（大麻制品）而处于兴奋/醉态的人。"},"examples":[{"en":"During Holi, some people drink bhang, and a bhangi may act unusually cheerful or sleepy.","zh":"洒红节期间有些人会喝bhang，服用者（bhangi）可能会表现得异常兴奋或犯困。"}]}],"synonyms":["sanitation worker (neutral, context-specific)","manual scavenger (descriptive, context-specific)","person intoxicated on bhang (for the second sense)"],"phonetic":"/ˈbʌŋɡi/","extraExplanation":["“Bhangi”与南亚的种姓制度和“不可接触性”（untouchability）历史紧密相关。在英语或印地语/乌尔都语语境里，它常带有歧视色彩；除非是在讨论历史、社会议题或自我认同等必要场景，一般不建议使用。","更中性的说法常见于“sanitation worker（环卫工）”“manual scavenging（人工清掏排泄物的劳动）”等表达，具体用词取决于语境与当事人偏好。"]}
{"word":"bhangs","summary":{"en":"Bhangs are cannabis-based drinks or foods traditionally associated with parts of South Asia.","zh":"bhangs 指与南亚部分地区传统相关的、以大麻为原料的饮品或食品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually plural) An intoxicating drink or food made from cannabis leaves (often mixed into milk or sweets), traditionally used in parts of India and nearby regions.","zh":"（常用复数）由大麻叶制成的致醉饮料或食物（常拌入牛奶或甜点中），在印度及周边地区有传统使用。"},"examples":[{"en":"During Holi, some people drink bhangs mixed with milk.","zh":"在洒红节（Holi）期间，有些人会喝用牛奶调制的bhang。"},{"en":"The traveler was warned that bhangs can be much stronger than expected.","zh":"有人提醒那位旅行者：bhang 可能比想象中更强烈。"},{"en":"The menu mentioned bhangs, so we asked what ingredients were used.","zh":"菜单上写着 bhangs，所以我们问了用哪些原料。"}]}],"synonyms":["bhang","cannabis drink","edible cannabis (general)"],"phonetic":"/bɑŋ/","extraExplanation":["“bhang”是南亚语境中的文化词，常见于印度的节庆（如Holi）或宗教/传统场合；在英语里常直接借用原词，有时会写作复数“bhangs”来泛指这类饮品/制品。","需要注意法律与地域差异：不同国家和地区对含大麻成分的食品饮品管制不同；在阅读或旅行语境中看到该词，通常带有明确的文化背景。"]}
{"word":"Bhar","summary":{"en":"“Bhar” most often refers to a load/burden or a historical South Asian weight unit; it can also be a personal or family name.","zh":"“Bhar”多指“负担/一担（货）”或南亚历史上的重量单位；也可能是人名或姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asia) a load or burden; also used historically as a traditional unit of weight (the exact amount varied by region and time).","zh":"（南亚）“负担/一担（货）”；也可指旧时的传统重量单位（具体重量因地区和时代而异）。"},"examples":[{"en":"In older records, a “bhar” was used to describe a large load of goods.","zh":"在一些较早的记录里，“bhar”用来描述一大担货物。"},{"en":"The merchant paid tax on several bhar of grain.","zh":"商人按好几“bhar”（担）的谷物纳税。"}]},{"partOfSpeech":"other","definition":{"en":"A South Asian personal name or family name (a romanized spelling found in several languages).","zh":"南亚地区的人名或姓氏（多种语言的拉丁字母拼写形式之一）。"},"examples":[{"en":"Ms. Bhar will lead the meeting today.","zh":"Bhar 女士今天将主持会议。"}]}],"synonyms":["load","burden"],"phonetic":"/bɑr/","extraExplanation":["“Bhar”常被认为来自梵语/印地语等语言中的词根（如 bhāra），核心含义与“承载、负重”相关。作为“重量单位”时，它不是国际标准单位，不同地区的换算差异很大；阅读历史或贸易资料时通常需要看上下文或注释。"]}
{"word":"bhar","summary":{"en":"“bhar” is not a common English word; it’s usually a South Asian (e.g., Hindi/Urdu) transliteration meaning “fill,” and sometimes “burden/weight” in translated contexts.","zh":"“bhar”不是常见英语词，通常是南亚语言（如印地语/乌尔都语）的罗马字转写，主要表示“装满/填满”，在翻译语境中也可指“负担/重量”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(South Asian loanword; not standard in everyday English) to fill; to put something into a container until it is full.","zh":"（南亚语言借词；在日常英语中不常用）装满；填满（容器等）。"},"examples":[{"en":"In the Hindi line “paani bhar do,” bhar means “fill (it) with water.”","zh":"在印地语台词“paani bhar do”里，bhar 的意思是“把水装满/把水灌进去”。"},{"en":"Some English subtitles keep the word bhar to show local flavor, but they usually translate it as “fill.”","zh":"有些英文字幕会保留 bhar 来体现地方色彩，但通常会翻译成“fill（装满）”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common; from South Asian languages) a load, burden, or weight (often used inside phrases rather than alone in English).","zh":"（较少见；源自南亚语言）负担；重量；载荷（在英语里多出现在固定说法或翻译语境中）。"},"examples":[{"en":"In some translations, bhar can refer to the “weight” someone carries emotionally.","zh":"在一些翻译语境中，bhar 可以指一个人情感上背负的“重量/负担”。"}]}],"synonyms":["fill","load","burden"],"phonetic":"/bɑr/","extraExplanation":["“bhar”更常见于印地语/乌尔都语等南亚语言的罗马字转写，对应的词根常见写法如 भर (bhar-) ，核心含义与“装满/填满、承载/负担”相关。英语里它通常只在影视字幕、歌词、移民社群对话或文化解释中出现。","如果你本来想查的是英文单词“bar”，请告诉我，我可以给你“bar”（酒吧；条；阻挡等）的完整词条与用法对比。"]}
{"word":"bhara","summary":{"en":"“Bhara” is usually a Romanized Hindi/Urdu word meaning “full/filled,” and it can also be used as a surname or place name.","zh":"“bhara”多为印地语/乌尔都语的拉丁转写，表示“满的/装满的”，也可能是姓氏或地名。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Not standard English) A Romanized Hindi/Urdu word meaning “filled; full; loaded.”","zh":"（非标准英语）印地语/乌尔都语的拉丁转写，意思是“装满的；充满的；满载的”。"},"examples":[{"en":"The bus is bhara, so we’ll take the next one.","zh":"这班公交车已经坐满了（bhara），我们坐下一班吧。"},{"en":"My schedule is bhara today—I can’t meet in the afternoon.","zh":"我今天的日程排满了（bhara），下午没法见面。"}]},{"partOfSpeech":"n.","definition":{"en":"A South Asian surname or place name in Romanization (spelling varies), used as a proper name.","zh":"南亚地区的姓氏或地名的拉丁转写（拼写可能不同），用作专有名词。"},"examples":[{"en":"Mr. Bhara will join the meeting at 3 p.m.","zh":"Bhara 先生会在下午三点参加会议。"},{"en":"They traveled through villages near Bhara.","zh":"他们经过了 Bhara 附近的村庄。"}]}],"synonyms":["full","filled","packed","loaded"],"phonetic":"ˈbɑːrə","extraExplanation":["“bhara”常见于口语或聊天中的拉丁字母拼写，来源可能是印地语/乌尔都语“भरा/بھرا”（bharaa），本义是“被填满/装满”。在英文句子里使用时，通常出现在南亚英语（South Asian English）或双语者的混合表达中。","如果你本来想查的是英语单词（例如 bhara 的正确拼写可能是 barrow / barrel / bharal 等），可以告诉我你看到它的句子或语境，我能更准确判断。"]}
{"word":"bharal","summary":{"en":"Bharal means the blue sheep, a wild mountain animal from the Himalayas and Tibetan Plateau.","zh":"bharal 指“岩羊/蓝羊”，一种生活在喜马拉雅山与青藏高原的野生山地羊类动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wild sheep-like animal (Pseudois nayaur) living in the Himalayas and Tibetan Plateau, also called the blue sheep.","zh":"一种生活在喜马拉雅山与青藏高原的野生羊类动物（学名 Pseudois nayaur），也叫“岩羊”或“蓝羊”。"},"examples":[{"en":"Snow leopards often hunt bharal in the high mountains.","zh":"雪豹常在高山地区捕食岩羊（bharal）。"},{"en":"We saw a herd of bharal on a rocky slope in Ladakh.","zh":"我们在拉达克的岩石山坡上看到一群岩羊（bharal）。"}]}],"synonyms":["blue sheep"],"phonetic":"/bɑːˈrɑːl/","extraExplanation":["“Bharal”一词常见于自然纪录片、野生动物研究与登山旅行语境，指的就是英文里更常用的 “blue sheep”。虽然叫“蓝羊”，它的毛色多为灰蓝或石板色，便于在岩石环境中伪装。","在中文里，“bharal”常被译为“岩羊”，有时也会见到“蓝羊”的译法；不同地区对类似动物的俗名可能会混用，写作或翻译时可同时标注：bharal (blue sheep)。"]}
{"word":"Bharat","summary":{"en":"Bharat is a widely used Indian-language name for India, also linked to the legendary figure Bharata.","zh":"Bharat 是印度在多种本土语言中的常用名称，也与传说人物婆罗多（Bharata）相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the name for India in several Indian languages (especially Hindi); used officially alongside “India,” as in “India, that is Bharat.”","zh":"印度在多种印度语言（尤其是印地语）中的名称；在官方语境中常与“India”并用，如“India, that is Bharat（印度，即婆罗多）”。"},"examples":[{"en":"Bharat is the Hindi name for India.","zh":"Bharat 是印地语里对印度的称呼。"},{"en":"The Constitution begins, “India, that is Bharat.”","zh":"印度宪法开头写道：“India, that is Bharat（印度，即婆罗多）”。"}]},{"partOfSpeech":"n.","definition":{"en":"in Indian tradition, a legendary king (Bharata) whose name is linked to the idea of India as “the land of Bharata.”","zh":"在印度传统中，一位传说中的国王（Bharata/婆罗多）；其名与“婆罗多之地”这一对印度的称呼相关。"},"examples":[{"en":"Some texts connect the name Bharat to King Bharata.","zh":"一些文本将“Bharat”这一名称与婆罗多王联系起来。"}]}],"synonyms":["India","the Republic of India"],"phonetic":"/bəˈrɑːt/","extraExplanation":["“Bharat（婆罗多）”源自梵语“Bharata”，在印度的历史与宗教叙事中很常见。英文里写作 Bharat，多用于强调本土称呼、文化身份或官方文件措辞。","在国际英语新闻中，有时会看到关于“India vs. Bharat”的用法讨论；这通常涉及政治表达或身份认同语境，而并非简单的“改名”。"]}
{"word":"Bharata","summary":{"en":"Bharata is a legendary king in Hindu tradition; the name is also used as a poetic/formal term for India (often “Bharat”).","zh":"Bharata（婆罗多）是印度教传统中的传说国王；该词也可作印度的诗意/正式称呼（现代更常见为“Bharat/巴拉特”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Hindu tradition) a legendary king, an important ancestor figure whose name is linked to the Bharata dynasty and to the epic the Mahābhārata.","zh":"（印度教传统中）婆罗多：一位传说中的国王与重要祖先人物；其名字与“婆罗多王朝”以及史诗《摩诃婆罗多》相关。"},"examples":[{"en":"In the Mahabharata tradition, Bharata is remembered as an early ruler whose descendants shaped later stories.","zh":"在《摩诃婆罗多》的传统中，婆罗多被记为早期的统治者，他的后裔构成了后世故事的核心。"},{"en":"The term “Bharata dynasty” is used to connect many characters in ancient Indian legend.","zh":"“婆罗多王朝”这一说法常用来把许多印度古代传说人物联系起来。"}]},{"partOfSpeech":"n.","definition":{"en":"A poetic or formal name for India (often seen as “Bharat” in modern usage).","zh":"印度的诗意或正式名称（现代用法中更常见作“Bharat/巴拉特”）。"},"examples":[{"en":"Some speeches use Bharata as a respectful, traditional name for India.","zh":"一些演讲会用“Bharata/婆罗多”来作为对印度更庄重、传统的称呼。"},{"en":"You may see “Bharat” more often than “Bharata” in present-day writing.","zh":"在当代写作里，你更常见到“Bharat/巴拉特”而不是“Bharata/婆罗多”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to Bharata, ancient Indian legend, or (more broadly) traditional Indian culture.","zh":"与婆罗多、古印度传说或（更广义的）传统印度文化有关的。"},"examples":[{"en":"The museum has a section on Bharata legends and epic storytelling.","zh":"博物馆有一个展区介绍婆罗多相关传说与史诗叙事。"}]}],"synonyms":["Bharat","India (in formal/poetic context)","Bhārata (transliteration variant)"],"phonetic":"/bəˈrɑːtə/","extraExplanation":["“Bharata”常出现在《摩诃婆罗多》（Mahābhārata）相关语境中：史诗标题里的“Bhārata”大意是“婆罗多（后裔）的故事”。","现代印度宪法中常见表述是“India, that is Bharat（印度，即巴拉特）”。其中“Bharat/巴拉特”是更常见的现代写法；“Bharata/婆罗多”更偏古典或文学用法。","英文里它通常作为专有名词使用，大小写很关键：Bharata（专名）一般不写成小写。"]}
{"word":"bharata","summary":{"en":"Bharata is a proper noun that can mean “India (Bharat)” in traditional usage, and it is also the name of important figures in Hindu epics and legends.","zh":"Bharata 是专有名词，传统用法中可指“印度（Bharat）”，也可指印度史诗与传说中的重要人物之名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Sanskrit and many Indian languages) India; the traditional name of the country, often seen in the phrase “Bharat (Bharata)”.","zh":"（梵语及多种印度语言中）印度；印度的传统国名，常见于“Bharat（Bharata）”这一说法。"},"examples":[{"en":"The constitution refers to the country as “India, that is Bharat.”","zh":"宪法中将国家表述为“India，即 Bharat（印度）”。"},{"en":"Many cultural texts use the name Bharata to mean India as a civilization.","zh":"许多文化文本用 Bharata 来指代作为文明体的印度。"}]},{"partOfSpeech":"n.","definition":{"en":"A legendary ancient king in Hindu tradition, often considered an ancestor of the Bharata people and a namesake of “Bharata/Bharat” for India.","zh":"印度教传统中的传说古代君王，常被视为“婆罗多族（Bharata people）”的祖先，也被认为是“Bharata/Bharat（印度）”这一名称的来源之一。"},"examples":[{"en":"In some stories, Bharata is remembered as an ideal ruler.","zh":"在一些故事中，Bharata 被记为理想的君王。"},{"en":"The epic tradition connects Bharata to the broader history of ancient India.","zh":"史诗传统把 Bharata 与古代印度的更大历史叙事联系在一起。"}]},{"partOfSpeech":"n.","definition":{"en":"In the Ramayana, the name of Rama’s younger brother, known for loyalty and refusing to take the throne for himself.","zh":"《罗摩衍那》中罗摩的弟弟之名，以忠诚著称，并拒绝为自己夺取王位。"},"examples":[{"en":"Bharata ruled as a caretaker, honoring Rama’s rightful place.","zh":"Bharata 以“摄政/代治者”的身份治理国家，尊重罗摩的正当继承权。"},{"en":"The character Bharata is often cited as a model of duty and devotion.","zh":"人物 Bharata 常被视为尽责与忠诚的典范。"}]}],"synonyms":["Bharat","India"],"phonetic":"/bəˈrɑːtə/","extraExplanation":["“Bharata/Bharat”在现代语境里常直接等同于“印度”，例如官方与新闻中会出现“Bharat”这一国名用法；“Bharata”更偏古典/梵语形式。","英文写作中它通常作为专有名词使用，首字母大写；在不同译写系统里也可能看到 Bharat、Bhaarata 等拼写差异。","如果你是在舞蹈或戏剧语境里看到 Bharata，可能与《舞论》（Natyashastra）或 Bharatanatyam（婆罗多舞）相关，但这些是衍生用法，核心词仍与“Bharata”这一文化传统名称有关。"]}
{"word":"Bharathi","summary":{"en":"Bharathi is most commonly a proper name, especially referring to the Tamil poet and freedom activist Subramania Bharati; it is also used as a common Indian given name.","zh":"Bharathi 多用作专有名词：最常指泰米尔语诗人、独立运动人士苏布拉马尼亚·巴拉蒂；也可作为常见的印度人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper name) Subramania Bharati (also spelled Bharathi) (1882–1921), a famous Tamil poet, writer, and Indian independence activist, known for patriotic and socially reformist poems.","zh":"（专有名词）苏布拉马尼亚·巴拉蒂（也常拼作 Bharathi）（1882–1921），著名泰米尔语诗人、作家与印度独立运动人士，以爱国与社会改革主题的诗歌闻名。"},"examples":[{"en":"In Tamil literature class, we read poems by Bharathi about freedom and equality.","zh":"在泰米尔文学课上，我们读了 Bharathi 写的关于自由与平等的诗。"},{"en":"Bharathi’s songs are still performed at cultural events in Tamil Nadu.","zh":"Bharathi 的诗歌/歌曲至今仍常在泰米尔纳德邦的文化活动中演出。"}]},{"partOfSpeech":"n.","definition":{"en":"(Given name) A common Indian name used for any gender, often associated with learning, poetry, and culture.","zh":"（人名）印度常见名字，可用于不同性别，常让人联想到学习、诗歌与文化气质。"},"examples":[{"en":"Bharathi will join our team as a new intern next week.","zh":"Bharathi 下周会加入我们团队做新的实习生。"},{"en":"I met a Bharathi at the conference; she works in education.","zh":"我在会议上认识了一位叫 Bharathi 的人；她从事教育行业。"}]}],"synonyms":["Subramania Bharati","Subramania Bharathi","Bharati"],"phonetic":"/bʌˈrɑːti/","extraExplanation":["“Bharathi / Bharati”是从南亚语言转写到英语的拼法差异；结尾“-thi/-ti”的读音会因地区与个人习惯不同而变化。","在南印度语境里，提到“Bharathi”常常默认指诗人Subramania Bharati；而在日常交流中也可能只是人名，需要结合上下文判断。"]}
{"word":"Bharati","summary":{"en":"Bharati is mainly a common Indian name; in some traditions it can also be an honorific/title linked to Indian culture and learning.","zh":"Bharati 主要是常见的印度人名；在一些传统中也可作与印度文化与学识相关的敬称/称号。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A name (given name or surname), common in India; it is often associated with “Bharat” (India) and can suggest “Indian” or “of India.”","zh":"（人名/姓氏）在印度较常见；常与“Bharat（印度）”有关，含有“印度的/属于印度”的联想。"},"examples":[{"en":"Bharati Singh is a well-known Indian comedian.","zh":"Bharati Singh 是一位知名的印度喜剧演员。"},{"en":"I met Bharati at a cultural festival last year.","zh":"我去年在一个文化节上认识了 Bharati。"}]},{"partOfSpeech":"other","definition":{"en":"In some Hindu and Sanskrit-based traditions, “Bharati” can be an honorific/title, especially connected with learning, speech, or spiritual lineages (e.g., monastic names).","zh":"在一些印度教与梵语传统中，“Bharati”也可作敬称/称号使用，常与学问、言语或某些修行传承有关（如出家法名的一部分）。"},"examples":[{"en":"He was given the monastic name Bharati after taking vows.","zh":"他受戒后被赐予包含 Bharati 的出家法名。"},{"en":"In some contexts, Bharati is used as a respectful title rather than a family name.","zh":"在某些语境里，Bharati 更像是一种尊称，而不一定是姓氏。"}]}],"synonyms":["(name) Bharti","(related) Bharat","(related) Bharata"],"phonetic":"/bəˈrɑːti/","extraExplanation":["“Bharati”常见于英文转写（transliteration），来源与“Bharat/Bhārata（印度）”相关，因此有时也会被理解为“印度的”。不同地区与语言（如印地语、孟加拉语、泰米尔语等）拼写与读音可能略有差异。","在印度文化语境中，它既可能是普通人名，也可能出现在宗教/学术传统里作为称号或法名的一部分；具体含义通常要看说话者背景与上下文。"]}
{"word":"Bharatiya","summary":{"en":"Bharatiya means “Indian” and is especially common in official or cultural names connected to India.","zh":"Bharatiya 表示“印度的/印度人”，尤其常见于与印度相关的官方或文化类名称中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Indian; relating to India (a Hindi/Sanskrit-derived word often used in official names and organizations).","zh":"印度的；与印度有关的（源自印地语/梵语，常用于官方名称或机构名中）。"},"examples":[{"en":"The conference featured Bharatiya music, dance, and food.","zh":"这场会议展示了印度（Bharatiya）的音乐、舞蹈和食物。"},{"en":"She studies Bharatiya history as part of South Asian studies.","zh":"她在南亚研究中学习印度（Bharatiya）历史。"}]},{"partOfSpeech":"n.","definition":{"en":"An Indian person (less common in everyday English; usually used in Indian English or in formal/cultural contexts).","zh":"印度人（在日常英语中较少见，多见于印度英语或较正式/文化语境）。"},"examples":[{"en":"The award honors Bharatiya artists living abroad.","zh":"该奖项表彰生活在海外的印度艺术家。"}]}],"synonyms":["Indian","Indic"],"phonetic":"/bɑːrɑːˈtiːjə/","extraExplanation":["“Bharatiya”对应印地语/梵语“Bhartiya/भारतीय”，意思是“属于Bharat的人/事物”。“Bharat（भारत）”是印度的本土称呼之一，印度宪法中也常与“India”并列使用。","在英语新闻里你最常看到它出现在专有名词中，例如：Bharatiya Janata Party（印度人民党，常简称BJP）、Bharatiya Vidya Bhavan（文化教育机构名）等。此时通常保留原拼写，不翻译成“Indian”。","拼写上也常见变体“Bhartiya”（少一个a）。在英文写作中，如果不是专有名词，一般用更常见的“Indian”；用“Bharatiya”会带有更强的本土/文化认同色彩。"]}
{"word":"bharti","summary":{"en":"Bharti is usually an Indian personal name (given name or surname). It can also be a variant of Bharati/Bharathi, sometimes associated with India (Bharat) or learning/eloquence in Sanskrit-based traditions.","zh":"Bharti 通常是印度人名（名或姓）。它也可作 Bharati/Bharathi 的变体，在梵语文化传统中有时与“印度（Bharat）”或“学问、言语/口才”相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a common South Asian (especially Indian) given name or surname; also a spelling variant of “Bharati/Bharathi.”","zh":"常见的南亚（尤其印度）名字或姓氏；也可视为“Bharati/Bharathi”的一种拼写变体。"},"examples":[{"en":"Ms. Bharti will present the report today.","zh":"Bharti 女士今天会做报告。"},{"en":"My friend Bharti speaks Hindi and English.","zh":"我的朋友 Bharti 会说印地语和英语。"}]},{"partOfSpeech":"n.","definition":{"en":"in some contexts, “Bharti/Bharati” can mean “of Bharat (India),” and it may be associated with learning/eloquence (from a Sanskrit root meaning “speech/knowledge”).","zh":"在某些语境中，“Bharti/Bharati”可表示“属于Bharat（印度）的”；也可能与“言语/知识、学问与口才”相关（源自梵语词根，含“言语/知识”之意）。"},"examples":[{"en":"The poem praises Bharti as a symbol of India.","zh":"这首诗称颂 Bharti，把它视为印度的象征。"},{"en":"In some traditions, Bharati is linked with Saraswati, the goddess of learning.","zh":"在一些传统中，Bharati 与掌管学问的女神萨拉斯瓦蒂（Saraswati）有关联。"}]}],"synonyms":["Bharati","Bharathi"],"phonetic":"/bɑrˈti/","extraExplanation":["“Bharti”多见于印度北部语言环境（如印地语使用者）的人名/姓氏；拼写也常见 Bharati、Bharathi 等，差异通常来自不同地区的转写习惯。","如果你是在新闻或商业语境看到它，它也可能指某些机构或品牌名（例如以 Bharti 命名的企业集团）。具体含义需要结合上下文（句子、国家/地区、行业等）。"]}
{"word":"Bhat","summary":{"en":"“Bhat” is most commonly a South Asian surname; it can also refer (less commonly) to a traditional bard (bhatt) or to cooked rice (bhaat) in transliteration.","zh":"“Bhat”最常见是南亚姓氏；在较少见的用法中，也可指传统吟游诗人（bhatt）或音译中的熟米饭/米饭菜（bhaat）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A common South Asian (especially Indian) surname, often found among communities such as Kashmiri Pandits and some Brahmin groups in western and southern India.","zh":"一个常见的南亚（尤其是印度）姓氏，常见于克什米尔潘迪特以及印度西部、南部的一些婆罗门社群。"},"examples":[{"en":"Dr. Bhat will lead today’s seminar.","zh":"Bhat 医生将主持今天的研讨会。"},{"en":"My classmate’s last name is Bhat.","zh":"我同学的姓是 Bhat。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common in modern English) A bard or court poet in parts of South Asia; a traditional praise-singer (also spelled bhatt).","zh":"（现代英语中较少见）指南亚部分地区的吟游诗人或宫廷诗人；传统的颂歌歌手（也可拼作 bhatt）。"},"examples":[{"en":"In the story, a bhat recites poems praising the king.","zh":"在故事里，一位 bhat 朗诵诗歌来赞颂国王。"}]},{"partOfSpeech":"n.","definition":{"en":"(From South Asian languages; seen in transliteration) Cooked rice or a rice dish (often spelled bhaat).","zh":"（源自南亚语言的音译写法）熟米饭或米饭类菜肴（常拼作 bhaat）。"},"examples":[{"en":"They served bhaat with lentils for dinner.","zh":"他们晚餐端上了米饭配扁豆。"}]}],"synonyms":["bhatt","bhaat"],"phonetic":"/bɑt/","extraExplanation":["“Bhat”在英语语境里最常见是姓氏（如名片、邮件称呼中）。如果你想查的是泰国货币，请注意正确拼写是“baht”（泰铢），而不是“bhat”。","第二、第三个意思多见于对南亚文化/语言的转写（transliteration）：同一个词可能出现不同拼法（bhat/bhatt/bhaat），取决于原语言与转写习惯。"]}
{"word":"bhat","summary":{"en":"“Bhat” usually means cooked rice in South Asian contexts, and it can also be a less common spelling of “baht,” Thailand’s currency.","zh":"“bhat”常指南亚语境中的“熟米饭”，也可能是泰国货币“baht（泰铢）”的不常见拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English) Cooked rice; a simple rice dish (often used in Indian languages like Hindi/Marathi/Bengali).","zh":"（南亚英语）熟米饭；简单的米饭（常见于印地语/马拉地语/孟加拉语等语境中）。"},"examples":[{"en":"For lunch, they had bhat with lentil soup.","zh":"午饭他们吃了米饭（bhat）配扁豆汤。"},{"en":"In many homes, bhat is served with vegetables and yogurt.","zh":"在很多家庭里，米饭（bhat）常和蔬菜、酸奶一起上桌。"}]},{"partOfSpeech":"n.","definition":{"en":"A less common spelling of baht, the basic unit of money in Thailand.","zh":"baht 的较少见拼写形式：泰国货币“泰铢”的基本单位。"},"examples":[{"en":"The price is 80 baht (sometimes spelled bhat).","zh":"价格是80泰铢（baht，有时也写作 bhat）。"},{"en":"I exchanged dollars for baht at the airport.","zh":"我在机场把美元换成了泰铢。"}]}],"synonyms":["rice","cooked rice","baht (common spelling)"],"phonetic":"/bɑːt/","extraExplanation":["“bhat”作为“熟米饭”的意思，更多出现在南亚（印度及周边）英语或侨民英语里，因为它来自当地语言的借词。正式英语写作中，更常用一般词“rice”。","泰国货币标准拼写是“baht”。如果你在菜单、旅游帖子或非正式文本里看到“bhat”，通常是在写“baht”。"]}
{"word":"Bhatpara","summary":{"en":"Bhatpara is a city in West Bengal, India, near Kolkata.","zh":"Bhatpara是印度西孟加拉邦靠近加尔各答的一座城市。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A city (municipality) in the state of West Bengal, India, near Kolkata, known historically for jute mills and a large Bengali-speaking community.","zh":"印度西孟加拉邦的一座城市（市政区），靠近加尔各答；历史上以黄麻工厂等工业以及庞大的孟加拉语社群而闻名。"},"examples":[{"en":"My friend’s family lives in Bhatpara, just north of Kolkata.","zh":"我朋友的家住在Bhatpara，就在加尔各答北边。"},{"en":"Bhatpara has had an important role in the region’s industrial history.","zh":"Bhatpara在该地区的工业历史中曾扮演重要角色。"}]}],"synonyms":["Bhatpara, West Bengal","Bhatpara (near Kolkata)"],"phonetic":"/ˈbɑːt.pə.rə/","extraExplanation":["Bhatpara通常被当作专有名词（地名）使用；在英文写作中首字母大写。","它位于胡格利河（Hooghly River）附近，属于加尔各答都市圈的一部分。","在学习或旅行语境中，你可能会看到更具体的写法：Bhatpara, West Bengal 或 Bhatpara (near Kolkata)。"]}
{"word":"Bhatt","summary":{"en":"Bhatt is most commonly an Indian surname; in some contexts it can also name a historical scholar/poet community or title.","zh":"Bhatt 最常见是印度姓氏；在某些语境中也可指与学者/诗人相关的传统社群或称谓。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a South Asian (especially Indian) surname; also spelled Bhat in some transliterations.","zh":"南亚（尤其是印度）常见的姓氏；在一些转写中也写作 Bhat。"},"examples":[{"en":"Ms. Bhatt will present the report tomorrow.","zh":"Bhatt 女士明天将展示这份报告。"},{"en":"My classmate’s last name is Bhatt.","zh":"我同学的姓是 Bhatt。"}]},{"partOfSpeech":"n.","definition":{"en":"in some Indian contexts, a community/title historically associated with learned people such as scholars, priests, or bards (the exact meaning varies by region).","zh":"在一些印度语境中，指与“学者/祭司/吟游诗人”等传统角色相关的社群或称谓（各地区含义略有差异）。"},"examples":[{"en":"In the story, a Bhatt is invited to recite poems at the ceremony.","zh":"在故事里，一位 Bhatt 被邀请在仪式上吟诵诗歌。"},{"en":"The term Bhatt can refer to different groups depending on the region.","zh":"“Bhatt” 这个词在不同地区可能指不同群体。"}]}],"synonyms":["Bhat"],"phonetic":"/bʌt/","extraExplanation":["“Bhatt/Bhat”常见于印度多种语言与地区（如古吉拉特、旁遮普、克什米尔等）。英文里通常按拼写近似读音来读；在原本语言中可能带有更明显的送气/浊音或卷舌音，因此不同家庭在英语环境中的读法也可能不同。","如果你是在读人名（例如演员 Alia Bhatt、导演 Mahesh Bhatt），最稳妥的做法是参考本人采访中的自我介绍或权威媒体的读音。"]}
{"word":"Bhaunagar","summary":{"en":"“Bhaunagar” is usually a misspelling of Bhavnagar, a coastal city in Gujarat, India.","zh":"“Bhaunagar”通常是 Bhavnagar（巴夫纳加尔）的误拼；Bhavnagar 是印度古吉拉特邦的一座沿海城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A common misspelling of **Bhavnagar**, a coastal city in the state of Gujarat, India.","zh":"**Bhavnagar（巴夫纳加尔）**的常见误拼；它是印度古吉拉特邦的一座沿海城市。"},"examples":[{"en":"I think you mean **Bhavnagar**, not *Bhaunagar*.","zh":"我想你是指 **Bhavnagar**，不是 *Bhaunagar*。"},{"en":"My friend’s family is from **Bhavnagar** in Gujarat.","zh":"我朋友的家人在古吉拉特邦的 **Bhavnagar**。"}]}],"synonyms":["Bhavnagar"],"phonetic":"/ˈbʌv.nə.ɡɑr/","extraExplanation":["“Bhavnagar（巴夫纳加尔）”位于印度西部古吉拉特邦沿海，历史上曾是一个土邦（princely state）的首府之一。","英语里地名的拼写通常固定；当你看到 *Bhaunagar* 这种写法时，多半是输入错误或不同的转写习惯，标准拼写更常见的是 **Bhavnagar**。"]}
{"word":"bhava","summary":{"en":"Bhava is a Sanskrit/Pali noun meaning “becoming/existence” (often in Buddhist philosophy) or a heartfelt “mental attitude/state” (often in yoga/spiritual practice).","zh":"Bhava 是梵语/巴利语名词，可指（佛教哲学中的）“有/生成/存在”，也可指（瑜伽/灵性修行中的）“心境/情感态度”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Buddhism, Hindu philosophy) “becoming” or “existence,” especially the ongoing process of coming into being (often linked to rebirth).","zh":"（佛教/印度哲学）“有”“成为/生成”，指持续的存在与生起过程（常与轮回相关）。"},"examples":[{"en":"In Buddhist teachings, bhava is often discussed as a cause that leads to repeated rebirth.","zh":"在佛教教义中，bhava 常被讨论为导致反复轮回的一个原因。"},{"en":"Some texts describe bhava as the momentum of “becoming” that keeps life patterns repeating.","zh":"一些经典把 bhava 描述为推动“生成/成为”的动力，使生命模式不断重复。"}]},{"partOfSpeech":"n.","definition":{"en":"(in yoga/spiritual practice) a mental state, feeling, or attitude—especially the sincere emotion you bring to a practice or prayer.","zh":"（瑜伽/灵性修行）心境、情感或态度；尤指你带着怎样真诚的感受去练习或祈祷。"},"examples":[{"en":"Try to chant with a calm, respectful bhava.","zh":"试着以平静、尊重的 bhava（心境）来诵唱。"},{"en":"Her bhava during meditation was gentle and focused.","zh":"她冥想时的 bhava 很柔和、很专注。"}]}],"synonyms":["becoming","existence","state of being","attitude","mindset"],"phonetic":"/ˈbɑːvə/","extraExplanation":["“bhava”来自梵语/巴利语，在英文里多见于佛教学术写作、瑜伽课程或印度哲学语境。不同传统对它的解释会有细微差异：佛教里常与“有/生存/生成”及轮回机制相关；瑜伽与奉爱传统里则更常指“内在的情感与态度”（带着怎样的心去做）。","发音在英语中常读作“BAH-vuh”（美式 IPA 见下），但在不同老师/地区可能略有差别。"]}
{"word":"Bhavabhuti","summary":{"en":"Bhavabhuti: an influential 8th‑century Sanskrit poet and playwright from India.","zh":"Bhavabhuti（婆婆布提）：印度8世纪重要的梵语诗人、剧作家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An 8th‑century Sanskrit poet and playwright from India, famous for emotionally rich dramas.","zh":"婆婆布提：8世纪印度梵语诗人、剧作家，以情感浓烈的戏剧作品著称。"},"examples":[{"en":"Bhavabhuti is often mentioned alongside Kalidasa as a major classical Sanskrit dramatist.","zh":"婆婆布提常被与迦梨陀娑并列，作为重要的古典梵语戏剧家。"},{"en":"We read a short scene from Bhavabhuti’s play in our world literature class.","zh":"在世界文学课上，我们读了婆婆布提戏剧中的一个短场景。"}]}],"synonyms":["Sanskrit dramatist","classical Indian playwright"],"phonetic":"/ˌbɑːvəˈbuːti/","extraExplanation":["“Bhavabhuti”是人名（专有名词），常见于世界文学、印度古典文学与戏剧史的语境。","他的重要作品常被译作《勇士传》（Mahāvīracarita）、《摩罗提与摩达婆》（Mālatīmādhava）与《后罗摩传》（Uttararāmacarita），其中《后罗摩传》尤以细腻刻画“离别之情（哀愁、忧伤的情绪）”而常被讨论。","英语写作中通常直接用拼写“Bhavabhuti”，也可见到带变体转写的形式（如 Bhavabhūti）。在学术语境里，名字后常跟作品名或时代信息帮助读者定位。"]}
{"word":"bhavan","summary":{"en":"Bhavan means a building or house, commonly used in Indian English and in official building names.","zh":"Bhavan 指“建筑/房屋”，多见于印度英语，常用于官方或机构建筑名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a building or house (a word used in Indian English, especially in names of important buildings or institutions).","zh":"建筑物；房屋（常见于印度英语中，尤其用于重要建筑或机构名称）。"},"examples":[{"en":"The meeting will be held at the Bhavan on campus.","zh":"会议将在校园里的那座 Bhavan（大楼）举行。"},{"en":"Rashtrapati Bhavan is the official residence of India’s President.","zh":"Rashtrapati Bhavan（总统府）是印度总统的官邸。"}]}],"synonyms":["building","hall","house"],"phonetic":"/ˈbʌvən/","extraExplanation":["“Bhavan”（也常见拼写为 bhawan）源自梵语/印地语等南亚语言，基本意思是“居所、建筑”。在印度的公共场所或机构命名里很常见，相当于英语的 “building / hall / house”。","在英文语境中看到“X Bhavan”，通常就是“X大楼/馆”的意思，例如行政办公楼、文化中心或学生宿舍楼等。"]}
{"word":"Bhavani","summary":{"en":"Bhavani is a Hindu goddess name (an epithet of Parvati/Durga) and is also used as a personal and place name in India.","zh":"Bhavani 既是印度教女神名（帕尔瓦蒂/杜尔迦的称号之一），也常用作印度的人名与地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Hindu goddess name—an epithet of Parvati/Durga—often understood as “the life-giver” or “mother,” and used in prayers and devotional contexts.","zh":"印度教女神名——帕尔瓦蒂/杜尔迦（Parvati/Durga）的称号之一，常被理解为“赐予生命者/母亲”，多用于祈祷与敬神语境。"},"examples":[{"en":"Many devotees pray to Bhavani for protection and strength.","zh":"许多信徒向 Bhavani 祈求庇护与力量。"},{"en":"In some regions, Bhavani is invoked as a powerful form of the Mother Goddess.","zh":"在一些地区，人们把 Bhavani 作为强大的“母神”形态来祈请。"}]},{"partOfSpeech":"n.","definition":{"en":"A personal name (given name or surname) and also a place name in India (for example, Bhavani is a town/river name in Tamil Nadu).","zh":"人名（可作名字或姓氏），也可作印度地名（例如泰米尔纳德邦有名为 Bhavani 的城镇/河流）。"},"examples":[{"en":"Bhavani is my colleague’s first name.","zh":"Bhavani 是我同事的名字。"},{"en":"They visited Bhavani during their trip through Tamil Nadu.","zh":"他们在穿行泰米尔纳德邦旅行时去了 Bhavani。"}]}],"synonyms":["Durga","Parvati","Shakti","Devi"],"phonetic":"bəˈvɑːni","extraExplanation":["“Bhavani”来自梵语传统用名，常被解释为与“存在、生命、生成”相关的母性/创造力意象，因此在敬神语境里带有“守护、赐福、力量”的文化联想。","在英语文本中它通常作为专有名词出现：可能指女神称号、个人姓名或印度地名；写作时一般不加冠词（不说 *the Bhavani*，除非在特定修辞或说明中）。"]}
{"word":"bhavani","summary":{"en":"Bhavani is mainly a proper noun: a Hindu goddess name and a common personal name; it can also be a place name in India.","zh":"Bhavani 主要是专有名词：既是印度教女神名，也常作人名；在印度也可作地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bhavani is a Hindu goddess name (often understood as a form of the goddess Parvati/Durga) and is also used as a personal name, especially in India.","zh":"Bhavani 是印度教女神的名字（常被理解为帕尔瓦蒂/杜尔迦女神的一种形态），也常作为人名使用，尤其在印度。"},"examples":[{"en":"Bhavani is worshipped in several regions of India, especially in Maharashtra and Tamil Nadu.","zh":"Bhavani 在印度多个地区受到崇拜，尤其在马哈拉施特拉邦和泰米尔纳德邦。"},{"en":"Her name is Bhavani, and she’s from Chennai.","zh":"她叫 Bhavani，来自金奈（Chennai）。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name used in India (for example, Bhavani is a town/area name in Tamil Nadu).","zh":"在印度也可作地名使用（例如 Bhavani 是泰米尔纳德邦的城镇/地区名）。"},"examples":[{"en":"They stopped in Bhavani on the way to Coimbatore.","zh":"他们去哥印拜陀（Coimbatore）的路上在 Bhavani 停留了。"}]}],"phonetic":"/bʌˈvɑːni/","extraExplanation":["“Bhavani/भवानी”源自梵语语境，常被解释为与“存在、生命、生成（bhava）”相关的女神称号之一，带有“赐予生命与力量的母神”色彩。不同地区的传统中，Bhavani 可能与杜尔迦（Durga）、帕尔瓦蒂（Parvati）等女神形象相连。","作为英文语境中的专有名词，Bhavani 通常需要根据具体人名或地名来理解；书写时首字母大写（Bhavani）。在称呼他人时，最好确认对方偏好的发音与称呼方式。"]}
{"word":"Bhave","summary":{"en":"Bhave is usually a misspelling of **behave**: to act in a certain way or to be well-behaved; it can also describe how things (like software) function.","zh":"Bhave 通常是 **behave** 的误拼：指人的举止/守规矩；也可用于描述事物（如软件）如何运作。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Usually written as **behave**.) To act in a particular way; to control your actions and follow rules, especially in public.","zh":"（通常写作 **behave**。）举止、表现；（尤指在公共场合）守规矩、行为得体。"},"examples":[{"en":"Please behave in the library.","zh":"请在图书馆里遵守规定、保持得体。"},{"en":"The kids behaved well at the restaurant.","zh":"孩子们在餐厅里表现得很好。"},{"en":"He behaved like a professional during the meeting.","zh":"他在会议上表现得很专业。"}]},{"partOfSpeech":"v.","definition":{"en":"(Of something, like a machine or chemical) to work or respond in a particular way.","zh":"（指机器、系统、化学物质等）以某种方式运作或反应。"},"examples":[{"en":"The new software behaves differently on older phones.","zh":"这款新软件在旧手机上的运行表现不一样。"},{"en":"Some metals behave strangely at very low temperatures.","zh":"有些金属在极低温下会出现异常的反应/表现。"}]}],"synonyms":["act","conduct oneself","perform","function"],"phonetic":"/bɪˈheɪv/","extraExplanation":["“Bhave”本身在英语里不常见，最常见情况是把 **behave**（行为举止）拼错了；正确拼写是 **behave**。","另外，“Bhave”也可能是南亚（如印度）常见姓氏（专有名词）。如果你指的是人名/姓氏，请告诉我语境（句子或国家/文化背景），我可以按专有名词解释。"]}
{"word":"Bhavnagar","summary":{"en":"Bhavnagar is a city in Gujarat, western India.","zh":"Bhavnagar是印度西部古吉拉特邦的一座城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in the state of Gujarat, western India, located on the Gulf of Khambhat (Arabian Sea). It is known for its port history, diamond-related industry, and nearby cultural and religious sites.","zh":"印度西部古吉拉特邦的一座城市，位于坎贝湾（阿拉伯海）沿岸。以港口历史、与钻石相关的产业，以及周边的文化与宗教景点而闻名。"},"examples":[{"en":"Bhavnagar is a coastal city in Gujarat, India.","zh":"Bhavnagar（巴夫纳加尔）是印度古吉拉特邦的一座海滨城市。"},{"en":"Many travelers visit Bhavnagar as a starting point for nearby temples and coastal areas.","zh":"许多游客把Bhavnagar当作前往附近寺庙和海岸地区的起点。"},{"en":"He works in the diamond trade in Bhavnagar.","zh":"他在Bhavnagar从事钻石贸易相关工作。"}]}],"phonetic":"/ˈbɑːv.nəˌɡɑːr/","extraExplanation":["“Bhavnagar”是专有名词（地名），常见写法首字母大写。中文里常译作“巴夫纳加尔/巴夫那加尔”，不同媒体可能有不同译名。","词源上可拆看为“Bhavna + nagar”，其中“nagar”在印度许多地名中常见，含义接近“城镇/城市”。","学习与使用建议：在英文写作中可在首次出现时补充国家/邦名（Bhavnagar, Gujarat, India），帮助读者快速定位。"]}
{"word":"Bhayani","summary":{"en":"Bhayani is most commonly used as a South Asian (especially Indian) surname.","zh":"Bhayani 通常用作南亚（尤其印度）姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), most commonly found in South Asia (especially India). It refers to a person or family called “Bhayani.”","zh":"一个姓氏（家族姓），多见于南亚（尤其是印度）。表示名为“Bhayani”的人或家族。"},"examples":[{"en":"Ms. Bhayani will lead the meeting today.","zh":"Bhayani 女士今天将主持会议。"},{"en":"I received an email from Dr. Bhayani.","zh":"我收到了 Bhayani 博士的一封邮件。"}]}],"phonetic":"/bəˈjɑːni/","extraExplanation":["“Bhayani”通常是印度（如古吉拉特等地区）常见的姓氏之一。作为英语语境中的姓名使用时，一般不翻译其含义，而是按原拼写或按常见译法音译。","姓名的读音在不同家庭/地区可能略有差异；最稳妥的做法是在正式场合礼貌询问对方希望的发音（例如：‘How do you pronounce your last name?’）。"]}
{"word":"BHB","summary":{"en":"BHB most commonly means beta-hydroxybutyrate, a ketone body; it can also be a context-specific abbreviation for other names.","zh":"BHB 最常见指 β-羟丁酸（酮体）；也可能是在特定语境下代表其他名称的缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation for **beta‑hydroxybutyrate** (a ketone body made by the liver and used for energy, especially during fasting or a ketogenic diet).","zh":"**β-羟丁酸 / β-羟基丁酸**（beta‑hydroxybutyrate）的缩写；一种**酮体**，由肝脏产生，在禁食或生酮饮食时常被用作能量来源。"},"examples":[{"en":"My blood test showed elevated **BHB** after a 24-hour fast.","zh":"我禁食24小时后抽血检查显示 **BHB** 升高。"},{"en":"Some ketone meters measure **BHB** to track ketosis.","zh":"一些酮体检测仪会测 **BHB** 来追踪是否进入酮症。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation that can stand for different names depending on context (for example, an organization, a school, or a project).","zh":"在不同语境下可能代表不同名称的缩写（例如某个机构、学校或项目的简称）。"},"examples":[{"en":"In this email, **BHB** refers to our local branch office, not the medical term.","zh":"在这封邮件里，**BHB** 指的是我们当地的分部办公室，不是医学术语。"}]}],"synonyms":["beta-hydroxybutyrate","β-hydroxybutyrate","ketone body"],"phonetic":"/bi eɪtʃ bi/","extraExplanation":["在健康/健身和医学语境里，BHB 最常见就是指 β-羟丁酸（beta-hydroxybutyrate）。它常与另外两种酮体一起被提到：acetoacetate（乙酰乙酸）和 acetone（丙酮）。","如果你是在某篇文章、公司文件或聊天记录里看到 BHB，最好告诉我上下文（在哪个领域/句子里），我可以帮你确定它具体指什么。"]}
{"word":"BHC","summary":{"en":"BHC is a context-dependent abbreviation; common meanings include Behavioural Health Consultant, Bahrain Health Council, or a Business Honors College/program.","zh":"BHC是依语境而定的缩写；常见含义包括行为健康顾问、巴林健康委员会，或商学院荣誉项目/荣誉学院等。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Behavioural Health Consultant” (a mental-health professional who works with primary-care teams).","zh":"“Behavioural Health Consultant”的缩写（行为健康顾问：常在基层/全科医疗团队中提供心理健康支持的专业人员）。"},"examples":[{"en":"The clinic hired a BHC to support patients with stress and sleep problems.","zh":"诊所聘请了一位BHC来帮助有压力和睡眠问题的病人。"},{"en":"Your doctor may refer you to the BHC for brief counseling.","zh":"你的医生可能会把你转介给BHC做简短的心理咨询。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Bahrain Health Council” (an organization related to health policy in Bahrain).","zh":"“Bahrain Health Council”的缩写（巴林健康委员会：与巴林卫生政策相关的机构）。"},"examples":[{"en":"The report was issued by the BHC in Bahrain.","zh":"这份报告由巴林的BHC发布。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation used in business/education for “Business Honors College” or similar program names (varies by school).","zh":"在商业/教育领域中常指“Business Honors College（商学院荣誉项目/荣誉学院）”等类似名称的缩写（因学校而异）。"},"examples":[{"en":"She was accepted into the BHC program at her university.","zh":"她被大学的BHC项目录取了。"},{"en":"BHC students often take smaller, discussion-based classes.","zh":"BHC学生常上小班讨论课。"}]}],"synonyms":["(initialism)","abbreviation"],"phonetic":"biː eɪtʃ siː","extraExplanation":["“BHC”不是一个固定只对应一个意思的英语单词，更常见的是首字母缩写（acronym/initialism）。具体含义通常要看场景：医疗系统、某个国家的机构名称、或某所学校的项目简称。","发音上一般按字母逐个读（不是读成一个词）：B-H-C。写作中第一次出现时，正式文本通常会先写全称，再在括号里写BHC，后文再用缩写。"]}
{"word":"bhd","summary":{"en":"“Bhd.” is a Malaysian abbreviation meaning “Berhad,” used after company names to show the company is a public limited company.","zh":"“Bhd.”是马来西亚公司名称中的缩写，表示“Berhad（公众有限公司）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation used in Malaysia for “Berhad,” meaning “public limited company” (similar to “plc” in the UK). It appears after a company name.","zh":"马来西亚常见缩写，代表“Berhad”，意为“公众有限公司”（类似英国的“plc”）。通常放在公司名称后面。"},"examples":[{"en":"Maybank Berhad (Maybank Bhd.) is a major Malaysian bank.","zh":"马来亚银行（Maybank Berhad / Maybank Bhd.）是马来西亚的大型银行。"},{"en":"The contract was signed by ABC Bhd. and its overseas partner.","zh":"该合同由ABC Bhd.与其海外合作方签署。"}]}],"synonyms":["plc","public limited company"],"phonetic":"bɜrˈhɑːd","extraExplanation":["“Bhd.”来自马来语“Berhad”，常见于马来西亚公司的正式英文名称中。通常表示公司股份可由公众持有与交易（上市或可上市）。","在新加坡更常见的对应形式是“Ltd.”（Private Limited常写作“Pte. Ltd.”），而马来西亚常见“Bhd.”（Berhad）与“Sendirian Berhad (Sdn. Bhd.)”（私人有限公司）。"]}
{"word":"bheestie","summary":{"en":"A historical South Asian term for a water carrier, especially in colonial India.","zh":"历史上的南亚用语，指送水工，尤见于英属印度时期语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English, historical) A water carrier, especially in colonial India, who delivered water in a goatskin bag or similar container.","zh":"（南亚英语，历史用语）送水工；尤指英属印度时期用皮囊等容器送水的人。"},"examples":[{"en":"In the old bungalow, a bheestie came each morning to fill the water jars.","zh":"在那座旧洋房里，每天早晨都会有一位bheestie来把水罐装满。"},{"en":"The memoir describes the bheesties carrying water in skin bags through the heat.","zh":"回忆录描写了bheestie在酷热中背着皮囊送水。"}]}],"synonyms":["water carrier","bhisti"],"phonetic":"/ˈbiːsti/","extraExplanation":["这个词也常写作 **bhisti / bheeshtee** 等，属于殖民时期英语中对印度本地职业称呼的转写。现代英语里较少使用，多见于历史文本、旅行记、小说或回忆录。","词源一般追溯到印地语/乌尔都语 **bhishtī**，与波斯语中“天堂（paradise）”相关的词根有关，原意有“像在天堂里的人/与天堂有关的人”的色彩，后来用来指送水者（提供“甘露”般的水）。在阅读旧文本时，这类称呼可能带有时代背景与阶层视角，理解时可注意语境。"]}
{"word":"bheesties","summary":{"en":"Bheesties are historical South Asian water carriers, often mentioned in old writings about India.","zh":"bheesties 指历史上南亚的送水人，常见于旧时关于印度的英文记述。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asia, historical) A water carrier, especially one who carried water in a leather bag (mashk) and supplied it to homes, camps, or soldiers; plural: bheesties.","zh":"（南亚，历史用语）送水人、挑水工；尤指用皮水袋（mashk）背水、为住家、营地或士兵送水的人。复数：bheesties。"},"examples":[{"en":"In some old accounts of British India, bheesties brought water to the soldiers’ tents.","zh":"在一些关于英属印度的旧记载里，bheesties 会把水送到士兵的帐篷。"},{"en":"The traveler hired a bheestie to refill the water bags during the journey.","zh":"旅行者雇了一个 bheestie 在路途中给水袋补水。"}]}],"synonyms":["water carrier","bhishti"],"phonetic":"/ˈbiːsti/","extraExplanation":["“bheestie”多见于19世纪到20世纪早期的英文游记、军旅记述和殖民时期文献中，现代日常英语里很少用。","它来自印地语/乌尔都语等语言中的“bhishti（给水的人）”。在今天的写作中，如果要避免殖民语境色彩或让读者更易懂，常用更直白的说法如“water carrier / water seller”。"]}
{"word":"bheesty","summary":{"en":"A historical South Asian term for a water carrier (especially in colonial India).","zh":"南亚（尤指英属印度时期）对“送水工/运水者”的历史称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(India, historical) A person whose job is to carry and deliver water, especially in South Asia during the Mughal and British colonial periods; a water carrier (often carrying a leather water bag).","zh":"（印度/南亚，历史用语）送水工；挑水/运水的人，尤指莫卧儿与英属印度时期常见的背水送水者（常用皮制水袋）。"},"examples":[{"en":"In the hot season, a bheesty would bring water to homes and work sites.","zh":"在炎热的季节里，送水工会把水送到住家和工地。"},{"en":"The camp relied on a bheesty to keep drinking water available throughout the day.","zh":"营地依靠送水工，才能整天都有饮用水。"},{"en":"Some older travel writing mentions the bheesty with a leather water bag slung over his shoulder.","zh":"一些较早的游记会提到送水工把皮水袋搭在肩上。"}]}],"synonyms":["water carrier","bhishti","bhisti"],"phonetic":"ˈbiːsti","extraExplanation":["这个词也常写作 **bhishti / bhisti**。在现代英语里比较少见，多出现在历史叙述、殖民时期的回忆录或描写南亚日常生活的文字中。","词源通常认为来自波斯语 **bihishtī**（与“天堂/乐园”相关），进入南亚语言后用来指称送水的人。"]}
{"word":"bheid","summary":{"en":"Not a standard English word; likely a misspelling—please share context.","zh":"不是标准英语单词；很可能是拼写错误——请提供上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“bheid” is not a standard English word or a commonly recognized abbreviation, so it doesn’t have an accepted dictionary meaning.","zh":"“bheid” 不是标准英语单词，也不是常见缩写，因此没有公认的词典释义。"},"examples":[{"en":"I couldn’t find “bheid” in an English dictionary—did you mean “behind” or “behead”?","zh":"我在英语词典里找不到 “bheid”——你是不是想写 “behind（在……后面）” 或 “behead（斩首）”？"}]}],"extraExplanation":["你可能是拼写错误或漏打了字母。常见相近拼写包括：\n- behind（在……后面；落后）\n- behead（斩首；去掉……的头部）\n- biped（两足动物/双足的，常被误拼）\n\n如果你告诉我：1）你想表达的中文意思，或 2）这个词出现的句子/上下文，我可以帮你锁定正确单词并给出详细用法。"]}
{"word":"bheug","summary":{"en":"“bheug” isn’t an English word; please provide context or the intended spelling.","zh":"“bheug”不是英文单词；请提供上下文或你想查的正确拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a recognized English word; it may be a typo or random letters.","zh":"这不是一个常见/标准的英文单词；可能是拼写错误或随机字母。"},"examples":[{"en":"I can’t find “bheug” in an English dictionary—did you mean a different word?","zh":"我在英文词典里找不到“bheug”——你是不是想写另一个词？"},{"en":"If you tell me the sentence you saw it in, I can guess the intended word.","zh":"如果你把它出现的句子发给我，我可以帮你推测你想表达的词。"}]}],"extraExplanation":["“bheug”很可能是打字时按错键或漏/多打了字母。你可以：\n1）发我你想表达的中文意思；或\n2）把包含它的英文句子贴出来；或\n3）告诉我你想查的正确拼写（哪怕不确定也行）。\n我就能帮你找到最可能的目标单词，并给出发音、词性和例句。"]}
{"word":"bhikhari","summary":{"en":"Bhikhari means “beggar,” a South Asian term often used in Hindi/Urdu contexts.","zh":"Bhikhari 指“乞丐/乞讨者”，多见于印地语/乌尔都语等南亚语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a beggar; a person who asks for money or food from others (from Hindi/Urdu usage).","zh":"乞丐；乞讨者（源自印地语/乌尔都语用法）。"},"examples":[{"en":"In the story, the bhikhari sits outside the temple asking for alms.","zh":"在故事里，这位 bhikhari 坐在寺庙外讨施舍。"},{"en":"He donated food to a bhikhari on his way home.","zh":"他回家路上给一位 bhikhari 捐了食物。"}]}],"synonyms":["beggar","panhandler","mendicant"],"phonetic":"bɪˈkɑːri","extraExplanation":["“bhikhari”常见于南亚语境（尤其印地语/乌尔都语、旁遮普语等）里，字面义是“乞讨的人”。在英语对话或写作中使用时，通常是在引用当地称呼或表现地域文化背景。","语气上可能带有贬义或社会阶层色彩；更中性的英语表达常用“beggar”或“person experiencing homelessness”（更强调处境而非标签）。"]}
{"word":"bhikkhu","summary":{"en":"A bhikkhu is a fully ordained Buddhist monk, especially in the Theravada tradition.","zh":"bhikkhu 指受具足戒的佛教比丘（僧人），尤常用于上座部传统语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fully ordained Buddhist monk (especially in the Theravada tradition).","zh":"（尤指上座部传统中的）比丘；受具足戒的佛教僧人。"},"examples":[{"en":"The bhikkhu gave a short talk on mindfulness after the chanting.","zh":"诵经结束后，那位比丘做了一个关于正念的简短开示。"},{"en":"In this monastery, bhikkhus follow strict rules of daily life.","zh":"在这座寺院里，比丘遵守严格的日常戒律与作息。"}]}],"synonyms":["Buddhist monk","monk"],"phonetic":"/ˈbɪk.u/","extraExplanation":["“bhikkhu”一词来自巴利语（Pāli），在英语佛教语境中常用来特指上座部（Theravada）体系的出家男众；相对的女性出家众常见说法是“bhikkhunī（比丘尼）”。","在一些英文文章里，“monk（僧/和尚）”是更通用、更口语的说法；而使用“bhikkhu”往往带有更明确的传统与戒律（受具足戒、遵循《律藏》）背景。拼写有时也会见到复数“bhikkhus”。"]}
{"word":"Bhikku","summary":{"en":"“Bhikku/Bhikkhu” means a Buddhist monk, especially in the Theravāda tradition.","zh":"“Bhikku/Bhikkhu”指佛教比丘（僧人），尤指上座部佛教传统中的受戒男出家人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Buddhist monk, especially in the Theravāda tradition (Pali: bhikkhu).","zh":"（尤指上座部佛教传统中的）比丘，受戒的佛教男出家人（巴利语：bhikkhu）。"},"examples":[{"en":"The bhikkhu walked silently through the village to collect food.","zh":"那位比丘静静地穿过村庄去托钵化缘。"},{"en":"She listened to a bhikkhu explain the basics of meditation.","zh":"她听一位比丘讲解禅修的基础。"},{"en":"In some temples, bhikkhus lead morning chanting.","zh":"在一些寺院里，比丘会带领早课诵经。"}]}],"synonyms":["Buddhist monk","monk"],"phonetic":"/ˈbɪkuː/","extraExplanation":["“Bhikkhu”来自巴利语，常译为“比丘”，意指“乞食者/托钵者”，反映早期僧团以化缘维生的修行方式。","英语里也常见拼写“bhikkhu”（更常见）与“bhikku”（较少见）。若用于正式写作，通常建议用“bhikkhu”。","女性出家众常用对应词“bhikkhuni / bhikkhunī”（比丘尼），但不同国家与传统对受戒制度与称呼可能略有差异。"]}
{"word":"bhikku","summary":{"en":"A bhikkhu is a formally ordained Buddhist monk (especially in the Theravāda tradition).","zh":"bhikkhu 指正式受戒的佛教比丘（尤见于上座部传统）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Buddhist monk, especially in the Theravāda tradition; a man who has been formally ordained and lives under monastic rules.","zh":"（尤指上座部传统中的）比丘；正式受戒、遵守僧团戒律生活的佛教男出家众。"},"examples":[{"en":"The bhikkhu taught meditation at the temple each evening.","zh":"这位比丘每天傍晚在寺院教授禅修。"},{"en":"As a bhikkhu, he follows a strict code of conduct and lives simply.","zh":"作为比丘，他遵守严格的行为规范，生活朴素。"},{"en":"Visitors offered food to the bhikkhu during the morning alms round.","zh":"访客在清晨托钵时向比丘布施食物。"}]}],"synonyms":["Buddhist monk","monk","Theravāda monk"],"phonetic":"/ˈbɪkuː/","extraExplanation":["“bhikkhu”来自巴利语（Pāli），常见于英语佛教语境中，特指上座部（Theravāda）僧人；对应的女性出家众常写作“bhikkhunī”（比丘尼）。","英语里也常见拼写变体“bhikku”，但学术与出版物中更常用“bhikkhu”。","在很多文化语境中，僧人可能与“monk”都可互译，但“bhikkhu”更强调其在佛教戒律与僧团制度中的正式身份。"]}
{"word":"Bhikkuni","summary":{"en":"A bhikkuni is a fully ordained Buddhist nun.","zh":"bhikkuni 指已受具足戒的佛教比丘尼（女众出家人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fully ordained Buddhist nun (especially in the Theravāda tradition); the feminine form of “bhikkhu” (Buddhist monk).","zh":"（尤指上座部传统中的）比丘尼；已受具足戒的佛教女出家众，为“bhikkhu（比丘）”的阴性形式。"},"examples":[{"en":"She decided to become a bhikkuni and live according to the monastic rules.","zh":"她决定成为一名比丘尼，依照僧团戒律生活。"},{"en":"The temple invited bhikkunis to give a talk on meditation and compassion.","zh":"寺院邀请比丘尼来讲授禅修与慈悲。"},{"en":"In some countries, bhikkuni ordination has been restored after a long historical gap.","zh":"在一些国家，比丘尼的受戒制度在经历长期中断后得以恢复。"}]}],"synonyms":["Buddhist nun","bhikshuni","nun"],"phonetic":"/bɪˈkuːni/","extraExplanation":["“Bhikkuni”来自巴利语（Pāli），常见于上座部佛教语境；在梵语中对应形式常写作“bhikshuni / bhikṣuṇī”（汉译常见“比丘尼”）。","在佛教传统里，“比丘尼”通常指完成较高层级受戒（具足戒）的女众出家人；不同地区与传承对比丘尼传承与受戒制度的历史与现况不尽相同。","英文里该词也可拼作“bhikkhunī”（带长音符号 ī），但日常写作常省略变音符号。"]}
{"word":"Bhikshu","summary":{"en":"Bhikshu means a Buddhist monk who has taken monastic vows.","zh":"Bhikshu 指受戒出家的佛教比丘（僧人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Buddhist monk, especially one who has taken vows and lives a renunciant religious life (often supported by alms).","zh":"比丘；佛教僧人（通常指受戒、出家、以清净修行与托钵/受施为生活方式的僧侣）"},"examples":[{"en":"The bhikshu spent the morning meditating and the afternoon teaching novices.","zh":"这位比丘上午禅修，下午教导沙弥。"},{"en":"In many traditions, a bhikshu follows strict rules of conduct called the Vinaya.","zh":"在许多传统中，比丘需遵守称为“毗奈耶/律”的严格戒律。"},{"en":"Visitors spoke quietly and showed respect when they met the bhikshus at the temple.","zh":"游客在寺院见到比丘时轻声交谈，并表达尊重。"}]}],"synonyms":["Buddhist monk","monk","mendicant monk"],"phonetic":"/ˈbɪkʃuː/","extraExplanation":["“Bhikshu”源自梵语“bhikṣu”（巴利语常见形式为“bhikkhu”），本义与“乞食/受施”有关，反映了早期僧团以托钵行乞、依信众供养而生活的传统。","在英语语境中，它常用于学术、宗教或与亚洲佛教相关的正式场合；日常表达里也常直接说“Buddhist monk（佛教僧人/和尚）”。","不同传统对僧人称谓会因地区与语系而异：例如汉传常说“比丘/和尚/僧人”，藏传也常见“monk/lamas（喇嘛，语境不同）”。使用时注意尊称与具体传统差异会更得体。"]}
{"word":"bhikshu","summary":{"en":"Bhikshu means a Buddhist monk, especially in Theravada traditions, traditionally living as a mendicant supported by alms.","zh":"bhikshu 指“比丘”，即佛教出家男众（尤以上座部传统常用），传统上以托钵受施维生、持戒修行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Buddhist monk (especially in Theravada Buddhism); literally, a “beggar” or “mendicant” who lives on alms and follows monastic rules.","zh":"（佛教）比丘；特指上座部佛教中的出家男众。字面义为“乞食者/行乞者”，靠化缘（托钵）生活并遵守戒律。"},"examples":[{"en":"The temple has a resident bhikshu who teaches meditation every weekend.","zh":"寺院里有一位常住比丘，每个周末教授禅修。"},{"en":"In many Buddhist traditions, a bhikshu lives simply and receives food as alms.","zh":"在许多佛教传统中，比丘过着简朴生活，以接受布施食物为生。"}]},{"partOfSpeech":"n.","definition":{"en":"In a broader or historical sense, a religious mendicant in Indian traditions, especially in early Buddhist texts.","zh":"（较广义/历史用法）印度宗教传统中的托钵修行者；尤指早期佛典语境下的出家行者。"},"examples":[{"en":"Ancient texts describe the bhikshu as wandering from village to village during the dry season.","zh":"古代文献描写比丘在旱季里从村庄到村庄行脚。"}]}],"synonyms":["Buddhist monk","monk","mendicant (religious)","bhikkhu"],"phonetic":"/ˈbɪkʃuː/","extraExplanation":["“bhikshu”来自梵语 bhikṣu（也常见拼写 bhiksh(u)），与“乞求/化缘”的词根有关；在巴利语中对应词为 bhikkhu。","在现代英文语境里，它通常用于较正式或学术性的佛教讨论；日常英语更常直接说 “Buddhist monk”。","文化上最好避免把 bhikshu 直译成“乞丐”：它强调的是修行者依戒律托钵、与在家众互相成就的宗教制度。"]}
{"word":"bhikshuni","summary":{"en":"Bhikshuni means a fully ordained Buddhist nun.","zh":"Bhikshuni 指“受具足戒的佛教女出家众（比丘尼）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Buddhism) a fully ordained nun; a female monastic who has taken vows and lives according to the monastic rules.","zh":"（佛教）比丘尼；受具足戒的女出家众，依戒律与僧团规则修行生活的女众。"},"examples":[{"en":"My teacher is a bhikshuni who has practiced meditation for decades.","zh":"我的老师是一位比丘尼，已经禅修了几十年。"},{"en":"The temple invited a bhikshuni to give a talk on compassion and discipline.","zh":"寺院邀请一位比丘尼来开示慈悲与戒律。"},{"en":"In some countries, communities are working to support bhikshunis and their education.","zh":"在一些国家，社群正在努力支持比丘尼及其教育。"}]}],"synonyms":["Buddhist nun","nun (in Buddhism)","bhikkhuni","bhikṣuṇī"],"phonetic":"/bɪkˈʃuːni/","extraExplanation":["“bhikshuni”常见拼写也有“bhikṣuṇī / bhikkhunī”（不同语系与转写法）。英语里多用来指佛教传统中“受具足戒”的女众（与“novice/沙弥尼”区分）。","词源来自梵语/巴利语，含义与“乞食者、托钵修行者”相关，体现早期僧团以托钵与简朴生活为特征。","在不同地区与传统（如上座部、汉传、藏传）里，比丘尼制度的发展历史与现状并不完全相同；阅读或写作时可根据具体语境说明所属传统。"]}
{"word":"Bhil","summary":{"en":"Bhil refers to a major Indigenous people in India, and also to the related languages they speak.","zh":"Bhil 指印度的重要原住民族群“比尔族”，也可指他们使用的相关语言（比尔语诸语言）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Bhil, a large Indigenous (Adivasi) people living mainly in western and central India (especially Rajasthan, Gujarat, Madhya Pradesh, and Maharashtra)","zh":"比尔族人：主要分布在印度西部与中部（尤以拉贾斯坦邦、古吉拉特邦、中央邦、马哈拉施特拉邦等）的一个大型原住民（阿迪瓦西）族群成员"},"examples":[{"en":"She is Bhil and grew up in a village near the Aravalli hills.","zh":"她是比尔族人，在阿拉瓦利山附近的村庄长大。"},{"en":"The museum has an exhibit on Bhil art and storytelling.","zh":"博物馆有一个关于比尔族艺术与讲故事传统的展览。"}]},{"partOfSpeech":"n.","definition":{"en":"the Bhil language(s), a group of closely related languages spoken by Bhil communities in India","zh":"比尔语（诸语言）：比尔族群使用的一组彼此相近的语言"},"examples":[{"en":"He can speak Bhil at home and Hindi at school.","zh":"他在家说比尔语，在学校说印地语。"},{"en":"The book includes folktales translated from Bhil.","zh":"这本书收录了从比尔语翻译过来的民间故事。"}]}],"synonyms":["Bhili (language name in some contexts)"],"phonetic":"/bɪl/","extraExplanation":["“Bhil”通常作为族名/族群成员称呼使用，首字母常大写。不同地区也可能看到“Bhili”等相关拼写或用来指语言。","在印度语境中，Bhil常与“Adivasi（原住民/部落群体）”相关；谈论时尊重其自称与具体社区名称，会更准确、更礼貌。"]}
{"word":"bhil","summary":{"en":"Bhil refers to an Indigenous people of western/central India, and it can also mean ‘relating to’ their culture or languages.","zh":"Bhil 指印度西部/中部的原住民族群“比尔人”，也可作形容词表示与其文化或语言有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an Indigenous (Adivasi) group mainly living in western and central India (especially Rajasthan, Gujarat, Madhya Pradesh, and Maharashtra).","zh":"（Bhil）比尔人：主要居住在印度西部与中部（尤其拉贾斯坦邦、古吉拉特邦、中央邦、马哈拉施特拉邦等）的一个原住民（阿迪瓦西）族群成员。"},"examples":[{"en":"The Bhil are one of the largest Indigenous communities in India.","zh":"比尔人是印度规模较大的原住民社群之一。"},{"en":"She is Bhil and grew up in a village near the Aravalli Hills.","zh":"她是比尔族，成长于阿拉瓦利山附近的村庄。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Bhil people, their culture, or their languages (often called Bhili languages).","zh":"比尔人的；与比尔族文化或语言相关的（其语言常称为 Bhili 语群）。"},"examples":[{"en":"They recorded Bhil songs and stories for a local museum.","zh":"他们为当地博物馆录制了比尔族的歌曲和故事。"},{"en":"He is studying Bhil languages in a South Asian linguistics course.","zh":"他在南亚语言学课程中研究比尔语群。"}]}],"synonyms":["Bhil people","Bhili (languages)","Adivasi (broader term, context-dependent)"],"phonetic":"/biːl/","extraExplanation":["“Bhil”多用作族群名称，语境中建议首字母大写（Bhil），以示尊重与专名用法。","比尔族分布广、内部差异也较大；谈到“Bhil language”时，常指若干相关方言/语言的统称（常见称呼是“Bhili”），并不一定是一种单一语言。"]}
{"word":"Bhili","summary":{"en":"Bhili refers to the Bhil people of India or to the group of languages they speak.","zh":"Bhili 指印度的比尔族，或指比尔族所使用的一组语言（比尔语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Bhil people (an Indigenous/Adivasi community in western and central India) or to their languages.","zh":"与比尔族（印度西部与中部的原住民/阿迪瓦西社群）或其语言有关的。"},"examples":[{"en":"Bhili traditions vary from region to region in India.","zh":"比尔族（Bhili）的传统在印度不同地区各有差异。"},{"en":"The museum has a small exhibit of Bhili textiles and art.","zh":"那家博物馆有一个小型的比尔族（Bhili）纺织品与艺术展。"}]},{"partOfSpeech":"n.","definition":{"en":"a group of closely related languages spoken by many Bhil people, especially in Rajasthan, Gujarat, Madhya Pradesh, and Maharashtra.","zh":"比尔语：一组彼此相近的语言，由许多比尔族人使用，主要分布在拉贾斯坦、古吉拉特、中央邦和马哈拉施特拉等地。"},"examples":[{"en":"She can speak Bhili at home and Hindi at school.","zh":"她在家讲比尔语（Bhili），在学校讲印地语。"},{"en":"The research project is documenting Bhili vocabulary and songs.","zh":"该研究项目正在记录比尔语（Bhili）的词汇与民歌。"}]}],"synonyms":["Bhil","Bhil language"],"phonetic":"ˈbiːli","extraExplanation":["“Bhili”通常是英文里对“比尔族相关/比尔语”的统称；在语言学或人口统计中，也可能细分为不同的比尔语变体（不同地区的方言/语言名称可能不同）。","拼写与用法提示：英语里常写作 Bhili（首字母大写），因为它是专有名词/专有形容词。"]}
{"word":"bhili","summary":{"en":"Bhili is the name for the Bhil people’s language(s) and also an adjective meaning “related to the Bhil or their language.”","zh":"Bhili 指比尔族使用的比利语（也可泛指一组相关语言），也可作形容词表示“与比尔族/比利语有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of closely related Indo-Aryan languages spoken mainly by the Bhil people in western and central India (such as Rajasthan, Gujarat, Madhya Pradesh, and Maharashtra).","zh":"比利语（Bhili）：一组彼此接近的印欧语系—印度-雅利安语支语言，主要由印度西部与中部的比尔（Bhil）族群使用（如拉贾斯坦、古吉拉特、中央邦、马哈拉施特拉等地）。"},"examples":[{"en":"Some schools in western India offer support for children who speak Bhili at home.","zh":"印度西部的一些学校会为在家说比利语的孩子提供学习支持。"},{"en":"Researchers recorded traditional songs in Bhili to help preserve local culture.","zh":"研究人员用比利语录制传统歌曲，以帮助保存地方文化。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Bhil people or their language(s).","zh":"与比尔族（Bhil）或其语言（比利语）有关的。"},"examples":[{"en":"The museum has a small Bhili folk-art collection.","zh":"那家博物馆有一小部分比尔族民间艺术收藏。"},{"en":"She is studying Bhili vocabulary for a fieldwork project.","zh":"她正在为一项田野调查项目学习比利语词汇。"}]}],"synonyms":["Bhil language","Bhil (context-dependent)"],"phonetic":"/ˈbiːli/","extraExplanation":["“Bhili”常用来统称多个相近的方言/语言变体，因此不同地区的“Bhili”在发音、词汇上可能有差异。","语言学上它通常被归入印度-雅利安语支；书写时常借用当地通行的文字体系（例如天城文等），具体取决于地区与社群习惯。"]}
{"word":"Bhim","summary":{"en":"Bhim is a South Asian male name, culturally linked to Bhima from the Mahabharata and sometimes to Dr. B. R. Ambedkar (Bhimrao).","zh":"Bhim是南亚常见的男性名字，文化上常与《摩诃婆罗多》中的毗摩（Bhima）相关，也有时指向安贝德卡（Bhimrao）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A male given name used in South Asia (especially India), often associated with strength and bravery.","zh":"南亚（尤其是印度）常见的男性名字，常带有“强壮、勇敢”的联想。"},"examples":[{"en":"My classmate Bhim is from Nepal.","zh":"我的同学Bhim来自尼泊尔。"},{"en":"Bhim helped organize the football team.","zh":"Bhim帮忙组织了足球队。"}]},{"partOfSpeech":"n.","definition":{"en":"A name linked to important cultural and historical figures, especially Bhima (a hero in the Indian epic the Mahabharata) and Bhimrao Ramji Ambedkar (often called “Babasaheb,” a key leader in India’s anti-caste movement).","zh":"与重要文化与历史人物相关的名字，尤其指《摩诃婆罗多》中的英雄“毗摩（Bhima）”，以及“比姆劳·拉姆吉·安贝德卡（Bhimrao Ramji Ambedkar）”（常被称为“Babasaheb”，印度反种姓压迫运动的重要领袖）。"},"examples":[{"en":"The story of Bhim(a) in the Mahabharata is famous for his great strength.","zh":"《摩诃婆罗多》中Bhim(a)（毗摩）的故事以力大无穷而闻名。"},{"en":"“Jai Bhim” is a slogan many people use to honor Dr. Ambedkar’s work.","zh":"“Jai Bhim”是许多人用来致敬安贝德卡博士贡献的口号。"}]}],"synonyms":["Bhima (related name)","Bhimrao (related name)"],"phonetic":"/bɪm/","extraExplanation":["“Bhim”在英语语境里通常作为专有名词出现（人名/称呼），不太像普通词那样有固定“词义”。在印度语境中，它常让人联想到“力量、正义、抗争”等文化意涵。","拼写提醒：Bhim 与 Bhima 有时会混用，但严格来说 Bhima 更常指史诗人物“毗摩”；Bhim 也常作为名字的简写或昵称。"]}
{"word":"Bhima","summary":{"en":"Bhima most commonly refers to a strong Pandava brother in the Mahabharata; it can also mean the Bhima River in India.","zh":"Bhima 通常指《摩诃婆罗多》中以神力著称的般度五兄弟之一；也可指印度的毗摩河。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Hindu epic literature) One of the five Pandava brothers in the Mahabharata, famous for his great strength and straightforward, loyal nature.","zh":"（印度史诗/印度教文学中）《摩诃婆罗多》里的般度五兄弟之一，以力大无穷、性格直率忠诚而著称。"},"examples":[{"en":"Bhima is known for his immense physical strength in the Mahabharata.","zh":"在《摩诃婆罗多》中，毗摩以巨大的力量闻名。"},{"en":"In many retellings, Bhima protects his brothers and challenges powerful enemies.","zh":"在许多改写版本中，毗摩常常保护兄弟们，并挑战强大的敌人。"}]},{"partOfSpeech":"n.","definition":{"en":"A river in western and southern India (also spelled Bhīma), a tributary of the Krishna River.","zh":"（印度）毗摩河（亦拼作 Bhīma），克里希纳河的支流，流经印度西部与南部。"},"examples":[{"en":"The Bhima River flows through parts of Maharashtra and Karnataka.","zh":"毗摩河流经马哈拉施特拉邦和卡纳塔克邦的部分地区。"},{"en":"Several towns and farms depend on water from the Bhima.","zh":"一些城镇与农田依赖毗摩河的水源。"}]}],"synonyms":["Bhim","Bhīma"],"phonetic":"/ˈbiːmə/","extraExplanation":["“Bhima/毗摩”是梵语名（常见转写：Bhīma），原义有“可怕的、威猛的”之意，用来凸显人物的力量与气势。","在《摩诃婆罗多》叙事里，毗摩常与“大力、忠诚、直来直去”的性格形象联系在一起；在南亚文化中，他也常出现在民间戏剧、影视与宗教艺术表现中。"]}
{"word":"bhima","summary":{"en":"Bhima is usually a proper name: either a strong hero in the Mahabharata or the name of an Indian river.","zh":"Bhima 通常是专有名词：可指《摩诃婆罗多》中的大力英雄毗摩，也可指印度的毗摩河。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bhima: a major hero in the Indian epic the Mahabharata, known for great strength; one of the five Pandava brothers.","zh":"毗摩：印度史诗《摩诃婆罗多》中的重要英雄人物，以力大无穷著称；般度五兄弟之一。"},"examples":[{"en":"In the Mahabharata, Bhima is famous for his strength and fierce loyalty to his family.","zh":"在《摩诃婆罗多》中，毗摩以力大无穷和对家人的忠诚闻名。"},{"en":"Bhima often appears in stories as the Pandava who wins battles through physical power.","zh":"在许多故事里，毗摩常被描写为凭借力量取胜的般度兄弟。"}]},{"partOfSpeech":"n.","definition":{"en":"Bhima (also spelled Bhīma): a river in western and southern India, a tributary of the Krishna River.","zh":"毗摩河（亦作 Bhīma）：印度西部与南部的一条河流，为克里希纳河的支流。"},"examples":[{"en":"The Bhima River flows through parts of Maharashtra and Karnataka.","zh":"毗摩河流经马哈拉施特拉邦和卡纳塔克邦的部分地区。"},{"en":"Some towns developed along the Bhima because rivers support farming and trade.","zh":"一些城镇沿毗摩河发展起来，因为河流有利于农业与贸易。"}]}],"phonetic":"/ˈbiːmə/","extraExplanation":["“Bhima/毗摩”是梵语来源的人名，在英语里通常作为专有名词使用，首字母大写。","在印度文化语境中，毗摩常被视为“力量、勇武”的象征；在神话与史诗改编的影视、漫画或儿童故事中也很常见。","拼写可能会见到 Bheem、Bhīma 等变体：Bheem 多见于现代转写与口语传播；Bhīma 用长音符号 ī 标示原语长元音。"]}
{"word":"bhindi","summary":{"en":"“Bhindi” means okra (a green edible pod), commonly used in Indian English.","zh":"“Bhindi”指秋葵（可食用的绿色荚果），常用于印度英语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"okra; the edible green pod used as a vegetable (common in Indian English).","zh":"秋葵；一种可食用的绿色荚果蔬菜（常见于印度英语中）。"},"examples":[{"en":"I bought bhindi to make a simple stir-fry.","zh":"我买了 bhindi（秋葵）来做个简单的清炒。"},{"en":"Bhindi masala is a popular North Indian dish made with okra and spices.","zh":"Bhindi masala（香料秋葵）是北印度很受欢迎的一道菜，用秋葵和香料做成。"},{"en":"If you don’t like the slimy texture, try roasting bhindi until it’s crisp.","zh":"如果你不喜欢它有点黏滑的口感，可以把 bhindi 烤到酥脆。"}]}],"synonyms":["okra","lady's finger"],"phonetic":"/ˈbɪndi/","extraExplanation":["“bhindi”源自印地语（Hindi）“भिंडी”，在印度、巴基斯坦等地的英语里很常用；在美式英语中更常说“okra”。","在菜单或食谱里常见搭配：bhindi masala（香料秋葵）、bhindi fry（炸/煎秋葵）、stuffed bhindi（酿秋葵）。"]}
{"word":"bhishti","summary":{"en":"A historical South Asian term for a water carrier, especially in India.","zh":"南亚（尤指旧时印度）对“送水工/运水仆役”的称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asia, historical) a water carrier, especially a servant in India who delivered water using a goatskin bag.","zh":"（南亚历史用语）送水工；（尤指旧时印度）用羊皮水袋送水的仆役。"},"examples":[{"en":"In the hot season, a bhishti brought drinking water to the workers.","zh":"在炎热的季节里，一个 bhishti 给工人们送来饮用水。"},{"en":"The camp hired a bhishti to fill water jars each morning.","zh":"营地雇了一个 bhishti 每天早上把水罐装满。"}]}],"synonyms":["water carrier","water bearer"],"phonetic":"/ˈbɪʃti/","extraExplanation":["“bhishti”多见于英殖民时期的印度/巴基斯坦等地语境，带有明显的历史与文化背景色彩；现代英语里较少日常使用，更多出现在历史描写、旅行记、小说或殖民档案中。","词源通常追溯到波斯语/乌尔都语相关词，和“天堂/天国”之意有关（因送水被视为善行之一），但在英语里它主要指“送水的人/职业”。","相关文化词：mashk（羊皮水袋）、mashki（携水袋的人；不同地区拼写与用法会变化）。"]}
{"word":"bhisti","summary":{"en":"A historical South Asian (especially Indian) term for a person whose job was to carry and deliver water.","zh":"一个历史性的南亚（尤指印度）称呼，指以挑水、送水为职业的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asia, historical) A water carrier, especially one in India who delivered water to homes or workplaces, often using a goatskin or leather bag.","zh":"（南亚，历史用法）送水工；尤指印度旧时为住家或工作场所送水的人，常用羊皮/皮革水袋运水。"},"examples":[{"en":"In the old story, a bhisti comes at dawn to fill the household’s jars.","zh":"在那则旧故事里，一个 bhisti 黎明时来把家里的水罐装满。"},{"en":"British-era records mention the bhisti as an essential worker in hot-weather cities.","zh":"英属时期的记录提到 bhisti 是炎热城市里不可或缺的工种。"}]}],"synonyms":["water carrier","water deliverer","(historical) waterman"],"phonetic":"/ˈbɪʃti/","extraExplanation":["这个词多见于英印（Anglo-Indian）语境与殖民时期的英文记述里，属于带有时代背景的称呼；在现代英语中较少使用。","词源一般认为经由印地语/乌尔都语进入英语，和波斯语中表示“天堂/乐园”的词有关；有时也写作 bhishti。","当代写作中若只是表达“送水的人”，更中性常用的说法是 water carrier 或 someone who delivers water；使用 bhisti 时建议注明其历史语境，以避免不必要的刻板印象。"]}
{"word":"bhistie","summary":{"en":"“bhistie” is a historical South Asian English word meaning a traditional water carrier in India.","zh":"“bhistie”是南亚英语中的历史词，指印度传统的送水/挑水人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional water carrier in India (especially one who carried water in a goatskin bag and sold or delivered it)","zh":"（印度传统）挑水/送水的人；（尤指）用羊皮水袋运水并售卖或送水的人"},"examples":[{"en":"In old colonial-era stories, a bhistie often appears carrying a large water bag.","zh":"在一些殖民时期的旧故事里，bhistie 常常背着一个大水袋出现。"},{"en":"The travelers hired a bhistie to bring drinking water to the camp.","zh":"旅行者雇了一位 bhistie 给营地送饮用水。"}]}],"synonyms":["water carrier","water vendor"],"phonetic":"/ˈbɪsti/","extraExplanation":["“bhistie / bhishti”是南亚英语（Indian English）里的历史用词，主要出现在19世纪到20世纪初的记载、旅行文学、殖民时期背景小说等语境。现代日常英语里很少用，更常见的说法是“water carrier / water vendor”。","词源通常被认为来自波斯语“beheshti”（意为“天堂的、乐园的”），在南亚语境中转指“送水的人”。拼写有多种变体：bhisti, bhishti, bhistie。"]}
{"word":"bhisties","summary":{"en":"“bhisties” is the plural of “bhisti,” a historical term for a water carrier in colonial India.","zh":"“bhisties”是“bhisti”的复数，指英属印度时期的挑水工/送水人这一历史用语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asia, historical) A water carrier or water seller, especially in colonial India, who supplied households or travelers with water (often carried in a goatskin bag).","zh":"（南亚，历史用语）挑水工、送水人，尤指英属印度时期为住户或旅人运送、售卖用水的人（常用羊皮水袋携带）。"},"examples":[{"en":"In many accounts of colonial India, a bhisti brings water to the house each morning.","zh":"在许多关于英属印度的记载中，bhisti 会在每天早晨把水送到家里。"},{"en":"The travelers hired bhisties to supply drinking water on the road.","zh":"旅人雇用 bhisties 在路上供应饮用水。"}]}],"synonyms":["water carrier","water seller"],"phonetic":"/ˈbɪsti/","extraExplanation":["“bhisti”一词来自南亚语言（常见说法是源自印地语/乌尔都语中与“天堂（bihisht）”有关的词根），在英语里多见于19—20世纪关于印度的旅行记、小说与殖民时期文献。","你输入的“bhisties”通常被当作复数形式（= bhisti 的复数）。现代日常英语中很少使用，更常见的是用更通用的表达如 “water carrier / water seller”。"]}
{"word":"BHL","summary":{"en":"BHL is an abbreviation; most often it means the Biodiversity Heritage Library (a free online biodiversity literature library).","zh":"BHL 是缩写；最常见指生物多样性遗产图书馆（一个免费开放的生物多样性文献在线图书馆）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation most commonly meaning “Biodiversity Heritage Library,” a free online digital library of biodiversity literature (books, journals, field reports, etc.).","zh":"常见缩写，最常指“Biodiversity Heritage Library（生物多样性遗产图书馆）”，一个免费开放的在线数字图书馆，收录生物多样性相关文献（书籍、期刊、考察报告等）。"},"examples":[{"en":"You can search old natural history books on the BHL website.","zh":"你可以在 BHL 网站上搜索早期的自然史书籍。"},{"en":"The researcher downloaded a 19th‑century bird guide from BHL.","zh":"研究人员从 BHL 下载了一本 19 世纪的鸟类指南。"}]},{"partOfSpeech":"other","definition":{"en":"(less common) an abbreviation that can stand for different organizations or terms depending on context (for example, a library name, a company, or a project).","zh":"（较少见）根据语境不同，BHL 也可能代表其他机构或术语（例如某个图书馆名称、公司或项目）。"},"examples":[{"en":"In this email, BHL refers to a local organization, not the online library.","zh":"在这封邮件里，BHL 指的是一个本地机构，而不是那个在线图书馆。"},{"en":"Could you clarify what BHL stands for in your report?","zh":"你能说明一下在报告里 BHL 具体指什么吗？"}]}],"synonyms":["abbrev."],"phonetic":"/biː eɪtʃ ɛl/","extraExplanation":["在学术与自然史领域里，BHL（Biodiversity Heritage Library）出现频率很高，常见于引用、链接或数据库检索信息中。","如果你是在特定文件/行业里看到 BHL（例如医疗、物流、公司内部系统），它可能有完全不同的含义；你可以告诉我你看到它的句子或领域，我可以帮你准确解释。"]}
{"word":"Bhojpuri","summary":{"en":"Bhojpuri is a language (and an adjective for people/culture) connected to Bhojpuri-speaking communities, mainly in northern/eastern India and Nepal.","zh":"Bhojpuri 指博杰普尔语，也可作形容词表示与博杰普尔语使用者或其文化相关，主要分布在印度北/东部及尼泊尔等地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a language spoken mainly in northern and eastern India (especially parts of Bihar and Uttar Pradesh) and in Nepal; it is also spoken by diaspora communities around the world","zh":"博杰普尔语（主要在印度北部和东部、尼泊尔等地使用，也被海外移民社群广泛使用）"},"examples":[{"en":"My grandparents speak Bhojpuri at home, but I learned Hindi at school.","zh":"我祖父母在家说博杰普尔语，但我在学校学的是印地语。"},{"en":"The interview was conducted in Bhojpuri and later translated into English.","zh":"采访用博杰普尔语进行，之后翻译成英语。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Bhojpuri-speaking people, their language, or their culture","zh":"与博杰普尔语使用者、博杰普尔语或其文化相关的"},"examples":[{"en":"She grew up in a Bhojpuri community overseas.","zh":"她在海外的博杰普尔社群中长大。"},{"en":"The festival featured Bhojpuri songs and dance.","zh":"节日上有博杰普尔歌曲和舞蹈表演。"}]}],"synonyms":["Bhojpuri language","Bhojpuri-speaking"],"phonetic":"/ˌboʊdʒˈpʊri/","extraExplanation":["博杰普尔语（Bhojpuri）属于印欧语系的印度-雅利安语支，和印地语有亲缘关系，但在发音、词汇与语法上有明显差异。很多使用者也会双语使用印地语或其他地区语言。","书写上常见用天城文（Devanagari），历史上也使用过Kaithi等文字。","文化层面上，Bhojpuri songs、电影（Bhojpuri cinema）在印度部分地区与海外移民社群中很有影响力。"]}
{"word":"Bhojpuri-speaking","summary":{"en":"Describes someone who speaks Bhojpuri, or something meant for Bhojpuri speakers.","zh":"指会说博杰普尔语的人，或面向/与博杰普尔语使用者相关的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to speak Bhojpuri, or relating to people/communities who speak Bhojpuri (an Indo-Aryan language mainly spoken in northern India and parts of Nepal).","zh":"会说博杰普尔语的；与说博杰普尔语的人群/社群有关的（博杰普尔语主要在印度北部及尼泊尔部分地区使用）。"},"examples":[{"en":"Her grandparents are Bhojpuri-speaking, so she grew up hearing Bhojpuri at home.","zh":"她的祖父母会说博杰普尔语，所以她从小在家里就常听到博杰普尔语。"},{"en":"The clinic hired a Bhojpuri-speaking interpreter to help patients understand their treatment.","zh":"诊所聘请了一位会说博杰普尔语的口译员，帮助病人理解治疗方案。"},{"en":"We prepared Bhojpuri-speaking outreach materials for the local community.","zh":"我们为当地社群准备了面向博杰普尔语使用者的宣传资料。"}]}],"synonyms":["Bhojpuri-language","Bhojpuri-speaking community","Bhojpuri-speaking people"],"phonetic":"/ˌboʊdʒˈpʊri ˈspiːkɪŋ/","extraExplanation":["“Bhojpuri-speaking”是一个复合形容词：语言名（Bhojpuri）+ speaking。通常要加连字符，放在名词前作定语（a Bhojpuri-speaking community / interpreter）；也可放在系动词后（They are Bhojpuri-speaking）。","在南亚语境中，“Bhojpuri-speaking”常用于描述语言使用者或服务对象（如医疗、学校、政府服务），强调沟通需求与语言可及性。"]}
{"word":"bhokra","summary":{"en":"“bhokra” is not a standard English word; it is likely a transliteration or a misspelling (possibly of “Bukhara”).","zh":"“bhokra”不是标准英语词，更可能是外语转写或拼写错误（也可能想写“Bukhara/布哈拉”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most likely a transliteration (romanization) of a word/name from another language, or a misspelling of a similar-looking word.","zh":"不是标准英语单词；更可能是其他语言的音译/拼写转写，或是与某个近似英文词的拼写错误。"},"examples":[{"en":"I couldn’t find “bhokra” in an English dictionary—do you mean a name or a word from another language?","zh":"我在英文词典里找不到“bhokra”——你是指人名/地名，还是其他语言里的词？"},{"en":"If you tell me the sentence where you saw “bhokra,” I can help identify the intended word.","zh":"如果你把“bhokra”出现的句子发我，我可以帮你判断原本想表达的词。"}]},{"partOfSpeech":"other","definition":{"en":"Possible intended word: “Bukhara” (a historic city in Uzbekistan), if you meant a place name with a similar spelling.","zh":"可能想写的是“Bukhara”（布哈拉，乌兹别克斯坦的一座历史名城），如果你指的是拼写相近的地名。"},"examples":[{"en":"Bukhara is famous for its old Silk Road architecture.","zh":"布哈拉以丝绸之路时期的古建筑闻名。"},{"en":"They visited Samarkand and Bukhara on their trip to Uzbekistan.","zh":"他们在乌兹别克斯坦旅行时去了撒马尔罕和布哈拉。"}]}],"phonetic":"/ˈboʊkrə/","extraExplanation":["“bhokra”常见于南亚语言（如印地语/旁遮普语等）的拉丁字母转写，但具体含义会因语言与语境而变。","如果这是你在聊天、歌曲、电影字幕或社媒里看到的词，请把原句和你想表达的意思发来；我可以帮你判断它属于哪种语言、对应的原词是什么，以及在英语里通常怎么翻。"]}
{"word":"Bhola","summary":{"en":"Bhola is mainly a South Asian male name; in Hindi/Urdu contexts it can also describe someone as innocent or naïve.","zh":"Bhola 主要是南亚常见的男性名字；在印地语/乌尔都语语境中也可形容人天真、淳朴或有点轻信。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (common in India, Bangladesh, Nepal, and nearby regions).","zh":"男性名字（常见于印度、孟加拉国、尼泊尔等南亚地区）。"},"examples":[{"en":"Bhola is my colleague from Kolkata.","zh":"Bhola 是我来自加尔各答的同事。"},{"en":"They named their son Bhola after his grandfather.","zh":"他们给儿子取名 Bhola，以纪念他的祖父。"}]},{"partOfSpeech":"adj.","definition":{"en":"(from Hindi/Urdu usage) innocent, simple, or naïve; someone who is easily trusting.","zh":"（源自印地语/乌尔都语用法）天真、淳朴、容易轻信的人；有点“傻乎乎但善良”的感觉。"},"examples":[{"en":"Don’t tease him—he’s bhola and takes jokes seriously.","zh":"别逗他——他很 bhola，会把玩笑当真。"},{"en":"She gave him a bhola smile, like a child.","zh":"她露出一种 bhola 的笑容，像孩子一样天真。"}]}],"synonyms":["(as adj., Hindi/Urdu sense) innocent","naïve","simple-hearted","gullible"],"phonetic":"/ˈboʊlə/","extraExplanation":["“Bhola”（也常写作 Bhole）在印地语里常带有“纯真、朴实”的褒义色彩，但在某些语境里也可能暗示“有点幼稚/不太精明”。具体含义取决于说话人的语气。","在印度文化中，“Bhole”还是湿婆神（Shiva）的一个称呼/称号（如“Bhole Nath”），表达“慈悲、容易被打动”的形象；因此人名 Bhola 有时也带有宗教或祝福意味。"]}
{"word":"Bhoodan","summary":{"en":"Bhoodan is a 1950s Indian land-gift movement encouraging landowners to donate land to the landless.","zh":"Bhoodan指20世纪50年代印度的“赠地/土地赠与运动”，鼓励地主把土地捐给无地者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a social movement in India (started in the 1950s) that encouraged wealthy landowners to donate (“gift”) land to landless people to reduce poverty and inequality","zh":"印度的“土地赠与运动”（始于20世纪50年代），号召富有地主把土地作为“赠与”捐给无地者，以减少贫困与不平等"},"examples":[{"en":"In history class, we learned how the Bhoodan movement aimed to redistribute land peacefully.","zh":"在历史课上，我们学习了“土地赠与运动”（Bhoodan）如何以和平方式推动土地再分配。"},{"en":"Some villages received land through Bhoodan, but the results varied from region to region.","zh":"一些村庄通过Bhoodan获得了土地，但不同地区的成效不一。"}]}],"synonyms":["Bhoodan Movement","Land Gift Movement","gift of land"],"phonetic":"/ˈbuːˌdɑn/","extraExplanation":["“Bhoodan”来自印地语：bhū（地/土地）+ dān（施舍、捐赠、赠与），字面意思是“赠地”。","它通常与社会活动家Vinoba Bhave（维诺巴·巴韦）联系在一起，被视为甘地思想（非暴力、社会改革）在独立后印度的一种实践。","在英文语境中，Bhoodan多作为专有名词使用，常写作Bhoodan Movement（Bhoodan运动）或Land Gift Movement（赠地运动）。"]}
{"word":"bhoosa","summary":{"en":"Bhoosa means chaff or dry straw left after processing grain, often used as animal feed (a South Asian English loanword).","zh":"bhoosa 指谷物处理后剩下的糠或干草屑，常用作牲畜饲料（带南亚英语色彩的借词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"chaff or dry straw (the husks and stalks left after grain is threshed), often used as animal fodder in South Asia.","zh":"（南亚常用词）谷物脱粒后剩下的糠、碎秆或干草屑，常用作牲畜饲料。"},"examples":[{"en":"The farmer stored bhoosa to feed the cattle during winter.","zh":"农民把 bhoosa 储起来，冬天用来喂牛。"},{"en":"The floor was covered with bhoosa after the threshing.","zh":"脱粒后，地上铺满了 bhoosa（糠和碎秆）。"}]}],"synonyms":["chaff","straw","husks","fodder"],"phonetic":"/ˈbuːsə/","extraExplanation":["“bhoosa / bhusa”多见于印度、巴基斯坦等地的英语语境（带有南亚地区色彩的借词），在当地日常交流或农业相关话题中使用较多。英语里更通用的对应词是 chaff（糠）或 straw（稻草/麦秆）。"]}
{"word":"bhoot","summary":{"en":"“Bhoot” means a ghost or spirit, mainly used in South Asian cultural contexts.","zh":"“bhoot” 指鬼魂/幽灵，主要用于南亚文化语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a ghost or spirit, especially in South Asian (Indian, Pakistani, Bangladeshi, Nepali) folklore and everyday speech","zh":"鬼魂；幽灵（尤指南亚文化与民间传说中的鬼）"},"examples":[{"en":"In the village story, a bhoot haunted the old banyan tree at night.","zh":"在那个村庄故事里，一只 bhoot 夜里在老榕树旁闹鬼。"},{"en":"He joked, “Don’t be scared—it’s not a bhoot, it’s just the wind.”","zh":"他开玩笑说：“别怕——那不是 bhoot，只是风而已。”"}]}],"synonyms":["ghost","spirit","apparition","phantom"],"phonetic":"/buːt/","extraExplanation":["“bhoot”（也常拼作 bhut/bhūt）来自印地语/乌尔都语等南亚语言，常指“鬼、游魂”。在英语里它多出现在谈论南亚文化、民俗或相关影视作品时。","在一些语境里，bhoot 不一定等同于西方“ghost”的形象，可能更接近“游魂、灵体、作祟的亡灵”等概念；具体含义会随地区与故事传统而变化。"]}
{"word":"bhoots","summary":{"en":"“Bhoots” is the plural of “bhoot,” meaning ghosts or spirits in South Asian folklore.","zh":"“bhoots”是“bhoot”的复数，指南亚民间传说中的鬼魂或灵体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English) a ghost or spirit; an evil or restless supernatural being in South Asian folklore (plural: bhoots).","zh":"（南亚英语）鬼魂、幽灵；（南亚民间传说中）作祟的灵体或恶灵（复数：bhoots）。"},"examples":[{"en":"Some villagers say a bhoot lives near the old well.","zh":"有些村民说老井附近住着一个bhoot（鬼）。"},{"en":"That abandoned house is famous for bhoots in local stories.","zh":"在当地故事里，那栋废弃的房子以“闹鬼”（有bhoots）出名。"},{"en":"He joked that the strange noise was just a bhoot, not the wind.","zh":"他开玩笑说那怪声只是个bhoot（鬼），不是风声。"}]}],"synonyms":["ghost","spirit","specter","phantom","apparition"],"phonetic":"/buːt/","extraExplanation":["“bhoot”来自印地语/乌尔都语等南亚语言的“bhūt/भूत”，常被译为ghost/spirit，但在不同地区的传说里形象不一：有的像徘徊人间的亡灵，有的更接近会害人的恶灵。","在英语语境中看到bhoot/bhoots，多与印度、巴基斯坦、孟加拉等地的民俗、恐怖故事或影视作品有关；写作时通常保留外来词以强调文化背景。"]}
{"word":"Bhopal","summary":{"en":"Bhopal is a city in central India (the capital of Madhya Pradesh) and is also widely associated with the 1984 industrial gas leak known as the Bhopal disaster.","zh":"Bhopal（博帕尔）是印度中部城市、中央邦首府；同时也常与1984年的“博帕尔灾难”（工业毒气泄漏事故）相关联。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A major city in central India and the capital of the state of Madhya Pradesh.","zh":"印度中部的一座重要城市，中央邦（Madhya Pradesh）的首府。"},"examples":[{"en":"Bhopal is the capital of Madhya Pradesh in central India.","zh":"博帕尔是印度中部中央邦的首府。"},{"en":"She studied engineering at a university in Bhopal.","zh":"她在博帕尔的一所大学学习工程。"}]},{"partOfSpeech":"n.","definition":{"en":"In modern history, a reference to the Bhopal disaster (1984), a catastrophic industrial gas leak often cited in discussions of safety and environmental responsibility.","zh":"在近现代语境中，可指“博帕尔灾难”（1984年）：一次严重的工业毒气泄漏事故，常用于讨论安全与环境责任。"},"examples":[{"en":"The Bhopal disaster is often mentioned in lessons about industrial safety.","zh":"博帕尔灾难常在工业安全课程中被提及。"},{"en":"The documentary examined the long-term health impact of Bhopal.","zh":"这部纪录片探讨了博帕尔事件的长期健康影响。"}]}],"synonyms":["Bhopal disaster (context-specific)","Madhya Pradesh capital (descriptive)"],"phonetic":"/boʊˈpɑːl/","extraExplanation":["英语里 “Bhopal” 多作为专有名词使用，通常不加冠词（不说 *the Bhopal*，除非特指“博帕尔事件/灾难”等语境）。","1984年的博帕尔毒气泄漏事故发生在一家农药工厂附近，造成大量人员伤亡；因此在英语新闻、公共政策与企业伦理讨论中，“Bhopal” 有时会成为“严重工业事故”的象征性提法。"]}
{"word":"Bhot","summary":{"en":"“Bhot” is not standard English; it’s a common online spelling of Hindi/Urdu “bahut,” meaning “very” or “a lot.”","zh":"“Bhot” 不是标准英语；常用于网络上作为印地语/乌尔都语 “bahut” 的拼写，意思是“很/非常”或“很多”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard; South Asian texting/romanization) “bhot” is often used online as a spelling of Hindi/Urdu “bahut,” meaning “very” or “a lot.” It is not a standard English word.","zh":"（非标准；南亚网络/罗马拼写）“bhot” 常见于聊天或网络中，是印地语/乌尔都语 “bahut” 的一种拼写，意思是“很/非常”或“很多”。它不是标准英语单词。"},"examples":[{"en":"This is bhot good!","zh":"这个真的很好！（很棒！）"},{"en":"I miss you bhot.","zh":"我很想你。"},{"en":"Thanks bhot, bro.","zh":"太感谢了，兄弟。"}]}],"synonyms":["very","a lot","so much","really","much","many"],"phonetic":"/bəˈhʊt/","extraExplanation":["“bhot” 多见于南亚英语圈（如印度、巴基斯坦、孟加拉等）在拉丁字母里转写本地语言时的拼法；也可能写成 “bahut / bohot / bhut”。","在正式英文写作中建议改为 “very / a lot / so much / really”等更标准的表达：例如把 “bhot good” 改成 “really good / very good”。"]}
{"word":"Bhoti","summary":{"en":"Bhoti usually refers to Tibetan-related Himalayan languages, and less commonly to Tibetan-related culture.","zh":"Bhoti 通常指与藏语相关的喜马拉雅地区语言群，也较少用来泛指藏语文化圈相关事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of languages closely related to Tibetan, spoken in parts of the Himalayas (e.g., India and Nepal).","zh":"一类与藏语（藏文语系）密切相关的语言群，主要分布在喜马拉雅地区（如印度、尼泊尔部分地区）。"},"examples":[{"en":"Linguists sometimes describe Ladakhi and related varieties as part of the Bhoti group.","zh":"语言学家有时会把拉达克语及其相关变体描述为“Bhoti”语言群的一部分。"},{"en":"The museum exhibit introduced Bhoti-speaking communities of the Himalayas.","zh":"博物馆展览介绍了喜马拉雅地区的 Bhoti 语使用社群。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) relating to Tibetan culture or the Tibetan cultural-linguistic sphere; Tibetan.","zh":"（较少见）与藏族文化或藏语文化圈相关的；藏族的、藏语的。"},"examples":[{"en":"The festival featured Bhoti music and dance traditions.","zh":"这个节庆展示了 Bhoti（藏族/藏语文化圈的）音乐与舞蹈传统。"}]}],"synonyms":["Tibetan (in many contexts)","Tibeto-Himalayan (broader context)"],"phonetic":"ˈboʊti","extraExplanation":["“Bhoti”在英语里多见于学术或行政语境（语言分类、民族文化介绍等），日常对话中更常用“Tibetan（藏语/藏族的）”。","用于指人群时应格外谨慎：不同地区可能有更具体、也更被当地接受的称呼（例如某些地方更常见“Bhotiya”等），建议根据当事人自称或当地官方用法来选择词汇。"]}
{"word":"Bhotia","summary":{"en":"Bhotia refers to Himalayan peoples (and their culture) and also to the languages spoken by these communities, often linked historically with Tibetan culture.","zh":"Bhotia 指喜马拉雅地区的博蒂亚族群（及其文化），也可指这些社群所使用的语言，历史上常与藏族文化有关联。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a group of Himalayan peoples living mainly in northern India (especially Uttarakhand and parts of Sikkim) and nearby regions, historically connected with Tibetan culture and trade","zh":"博蒂亚人（主要分布在印度北部喜马拉雅地区，如北阿坎德邦及锡金部分地区等；历史上与藏族文化与贸易往来密切的族群）"},"examples":[{"en":"Some Bhotia communities traditionally traded salt and wool across Himalayan passes.","zh":"一些博蒂亚社群传统上会穿越喜马拉雅山口进行盐和羊毛贸易。"},{"en":"The museum exhibit includes clothing worn by Bhotia people in high-altitude villages.","zh":"博物馆展览中包括高海拔村落博蒂亚人穿的服饰。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Bhotia people or their culture","zh":"博蒂亚人的；与博蒂亚文化有关的"},"examples":[{"en":"The festival features Bhotia songs and dances.","zh":"节日活动展示了博蒂亚歌曲和舞蹈。"},{"en":"Researchers recorded Bhotia oral histories from elders in the region.","zh":"研究人员记录了当地长者讲述的博蒂亚口述历史。"}]},{"partOfSpeech":"n.","definition":{"en":"any of several related languages (or dialects) spoken by Bhotia communities; often classified as Tibeto-Burman languages","zh":"博蒂亚语（博蒂亚社群使用的若干相关语言或方言之一，常被归入汉藏语系的藏缅语族）"},"examples":[{"en":"She can speak Bhotia as well as Hindi.","zh":"她既会说博蒂亚语，也会说印地语。"},{"en":"The school is creating materials to help children read and write Bhotia.","zh":"学校正在制作教材，帮助孩子们读写博蒂亚语。"}]}],"synonyms":["Bhotiya","Bhot","Tibeto-Burman (language family term)"],"phonetic":"ˈboʊtiə","extraExplanation":["“Bhotia”在学术与新闻中有时也拼作“Bhotiya”。不同地区的“Bhotia/ Bhotiya”可能指向不同社群与语言变体，因此在正式写作中常会进一步标明具体地区（如Uttarakhand Bhotia等）。","该词与“Tibetan/藏族”在文化与语言上有关联，但不完全等同；许多情况下它是一个较宽泛的分类名称。使用时若涉及族群身份，最好尊重当地自称与具体称呼。"]}
{"word":"bhotia","summary":{"en":"Bhotia refers to Himalayan peoples (often in India/Nepal) with ties to Tibetan culture, and it can also describe things related to them.","zh":"Bhotia 指与藏文化相关的喜马拉雅地区族群（常见于印度/尼泊尔），也可作形容词表示“与其人群、文化或语言相关”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a Himalayan ethnic group (especially in India and Nepal) with cultural and historical ties to Tibet; also written Bhotiya","zh":"博蒂亚人（主要分布于印度、尼泊尔喜马拉雅地区的族群之一，与西藏在文化与历史上有密切联系；也写作 Bhotiya）"},"examples":[{"en":"Some Bhotia communities have long histories of trade across Himalayan passes.","zh":"一些博蒂亚社群长期以来有跨越喜马拉雅山口进行贸易的历史。"},{"en":"The museum exhibit includes Bhotia textiles and traditional clothing.","zh":"博物馆展览包括博蒂亚纺织品与传统服饰。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Bhotia people, their culture, or their languages","zh":"与博蒂亚人、其文化或其语言有关的"},"examples":[{"en":"The book introduces Bhotia cultural practices in the region.","zh":"这本书介绍了该地区的博蒂亚文化习俗。"},{"en":"Researchers recorded Bhotia vocabulary for a local language project.","zh":"研究人员为当地语言项目记录了博蒂亚语词汇。"}]}],"synonyms":["Bhotiya"],"phonetic":"/ˈboʊtiə/","extraExplanation":["“Bhotia/Bhotiya”常用作族称与形容词，具体所指可能因地区而不同：在印度北部（如锡金、北阿坎德、喜马偕尔等）可能指若干与藏文化相关的群体；在语言学语境中也可能泛指“藏语支（Tibetan-related）”的语言或方言。阅读或写作时，最好结合具体地区与语境来理解。","拼写上常见 Bhotia 与 Bhotiya 两种；在正式写作中可优先采用当事群体或权威来源使用的写法，并避免把它当作单一、同质的民族标签。"]}
{"word":"Bhotiya","summary":{"en":"Bhotiya refers to certain Himalayan communities (and related cultures/languages), especially in northern India near Tibet.","zh":"Bhotiya 指喜马拉雅地区（尤指印度北部靠近西藏）的若干社群及其相关文化/语言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person belonging to a group of Himalayan communities (especially in northern India, near Tibet) traditionally connected with Tibetan culture and trade.","zh":"（博蒂亚人）指居住在喜马拉雅地区（尤其是印度北部、靠近西藏）的一些族群成员，传统上与藏文化与贸易往来密切。"},"examples":[{"en":"Some Bhotiya communities historically traded salt and wool across the high mountain passes.","zh":"一些博蒂亚社群过去会穿越高山隘口进行盐和羊毛等贸易。"},{"en":"The museum exhibit includes Bhotiya textiles and everyday tools from the Himalayas.","zh":"博物馆展览包含博蒂亚人的纺织品和喜马拉雅地区的日常工具。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Bhotiya people, their culture, or their languages.","zh":"（形容词）与博蒂亚人、其文化或语言有关的。"},"examples":[{"en":"She is researching Bhotiya folk songs and oral traditions.","zh":"她正在研究博蒂亚民歌与口述传统。"},{"en":"The school offers lessons in a local Bhotiya language.","zh":"这所学校开设本地一种博蒂亚语言的课程。"}]}],"synonyms":["Bhotia","Tibetan (context-dependent)"],"phonetic":"/boʊˈtiːjə/","extraExplanation":["“Bhotiya / Bhotia”在英文中常作为人类学或地区研究用语，指若干分布在印度喜马拉雅地带的社群，并非单一、完全同质的族群；具体到个人时，最好询问其自我认同与更精确的社群名称。","拼写上常见变体有“Bhotiya”和“Bhotia”。在某些语境下它也可能被用作更宽泛的“与西藏/藏文化相关”的标签，但这种用法可能不够精确，写作时建议结合地区与具体社群。"]}
{"word":"bhotiya","summary":{"en":"Bhotiya refers to certain Himalayan peoples in northern India and, as an adjective, anything related to them (culture, language, etc.).","zh":"Bhotiya 指印度北部喜马拉雅地区的一些族群（博提亚人）；作形容词时指与其文化、语言等相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a group of Himalayan peoples in northern India (especially Uttarakhand and nearby areas), historically connected with trade and culture across the Tibet border","zh":"博提亚人：印度北部喜马拉雅地区（尤指北阿坎德邦等地）的一些族群成员，历史上与跨越西藏边境的贸易与文化联系密切"},"examples":[{"en":"Some Bhotiya families traditionally traded salt and wool across the high mountain passes.","zh":"一些博提亚家庭传统上会穿越高山隘口进行盐和羊毛的贸易。"},{"en":"The museum has an exhibit on Bhotiya weaving and winter clothing.","zh":"博物馆有一个关于博提亚织造工艺和冬季服饰的展览。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Bhotiya people, their cultures, or their languages","zh":"博提亚的：与博提亚人、其文化或其语言相关的"},"examples":[{"en":"Researchers recorded several Bhotiya dialects spoken in different valleys.","zh":"研究人员记录了不同山谷里使用的几种博提亚方言。"},{"en":"She studies Bhotiya folk songs and oral history.","zh":"她研究博提亚民歌与口述历史。"}]}],"synonyms":["Bhotia","Bhoti (context-dependent)"],"phonetic":"/boʊˈtiːjə/","extraExplanation":["“Bhotiya”也常写作“Bhotia”。词源与“Bhot/Boht”（历史上对西藏一带的称呼）有关，因此在一些资料里会强调其与藏文化的长期交流。","这个词在英语里多用于人类学、历史与地区文化语境；日常英语中并不常见。若写学术或新闻文本，通常需要给出具体地区（如Uttarakhand）以避免泛化。"]}
{"word":"Bhowani","summary":{"en":"Bhowani is best known as a fictional Indian town from *Bhowani Junction*.","zh":"Bhowani 最常见的指代是小说《博瓦尼枢纽》中出现的（虚构）印度城镇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a (fictional) town in India, best known as the setting of the novel and film title *Bhowani Junction*","zh":"（虚构的）印度城镇名，最著名的用法是作为小说与电影《博瓦尼枢纽》（*Bhowani Junction*）的故事背景与标题中的地名"},"examples":[{"en":"The story of *Bhowani Junction* is set around the railway town of Bhowani.","zh":"《博瓦尼枢纽》的故事发生在铁路小镇博瓦尼周边。"},{"en":"In the novel, Bhowani becomes a place where different cultures and identities collide.","zh":"在小说中，博瓦尼成了不同文化与身份碰撞的地点。"}]}],"synonyms":["(proper noun; no true synonyms)"],"phonetic":"/boʊˈwɑːni/","extraExplanation":["“Bhowani”并不是一个在现实印度广泛对应的常见城市名；它主要因约翰·马斯特斯（John Masters）的小说《Bhowani Junction》（1954）而为英语读者熟知，后来也被改编为电影（1956）。","书名里的“Junction”指“铁路枢纽/交汇站”，在英属印度与印度独立前后，铁路枢纽常被用来象征人口流动、权力更替与身份认同的交汇与冲突，尤其涉及英印混血社群（Anglo-Indian）等群体的处境。","作为地名使用时通常不翻译含义，中文多按音译为“博瓦尼”（也可能见到不同译法），写作时可配合说明它是小说中的地点。"]}
{"word":"bhowani","summary":{"en":"Bhowani is a fictional Indian town best known from the title and setting of *Bhowani Junction*.","zh":"Bhowani（博瓦尼）是一个虚构的印度城镇，最知名于《博瓦尼枢纽站》（*Bhowani Junction*）的标题与故事背景。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fictional town in India, best known as the setting of the novel and film title *Bhowani Junction*","zh":"（虚构地名）印度的一个虚构城镇，最常见于小说与电影标题《博瓦尼枢纽站》（*Bhowani Junction*）的背景设定中"},"examples":[{"en":"The story of *Bhowani Junction* takes place in the town of Bhowani during India’s transition to independence.","zh":"《博瓦尼枢纽站》的故事发生在印度走向独立时期的博瓦尼镇。"},{"en":"In the novel, Bhowani represents a crossroads of cultures, languages, and political change.","zh":"在小说中，博瓦尼象征着文化、语言与政治变迁交汇的“十字路口”。"}]}],"phonetic":"/boʊˈwɑːni/","extraExplanation":["“Bhowani”在英语里通常不是日常词汇，而是专有名词，主要因1954年英国作家John Masters的小说*Bhowani Junction*（1956年被改编成电影）而为人所知。","在该作品中，“Junction（枢纽站/交汇点）”强调铁路与社会结构的交叉地带；Bhowani本身是虚构地名，用来承载殖民晚期与独立初期的多族群、身份认同与政治冲突等主题。"]}
{"word":"bhoy","summary":{"en":"Bhoy is an informal Irish/Scottish spelling of “boy,” and it can also mean a Celtic F.C. supporter (often “the Bhoys”).","zh":"Bhoy 是“boy（男孩）”的爱尔兰/苏格兰式非正式拼写；也可指凯尔特人足球俱乐部的球迷（常说 the Bhoys）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Irish/Scottish, informal) A boy; a young male (spelling reflects an Irish/Scottish style).","zh":"（爱尔兰/苏格兰，非正式）男孩；年轻男性（这种拼写带有爱尔兰/苏格兰风格）。"},"examples":[{"en":"When he was a wee bhoy, he helped his father in the shop.","zh":"他还是个小男孩（bhoy）的时候，就在店里帮爸爸做事。"},{"en":"The old story begins with a poor bhoy leaving home to find work.","zh":"那个老故事从一个贫穷的男孩（bhoy）离家找工作开始。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in Scotland) A supporter of Celtic F.C.; often used as “the Bhoys.”","zh":"（尤指苏格兰）凯尔特人足球俱乐部（Celtic F.C.）的支持者；常用复数形式“the Bhoys”。"},"examples":[{"en":"The Bhoys were singing loudly after the match.","zh":"比赛结束后，“Bhoys”（凯尔特人球迷）大声唱着歌。"},{"en":"He’s a lifelong Bhoy and never misses a home game.","zh":"他是终身的“Bhoy”（凯尔特人死忠球迷），主场比赛从不缺席。"}]}],"synonyms":["boy","lad","Celtic supporter"],"phonetic":"/bɔɪ/","extraExplanation":["“bhoy”常被认为是一种带“爱尔兰味”的拼写，用来模仿口音或营造民俗/文学氛围；日常英语里更常写作“boy”。","在足球语境中，“The Bhoys”是凯尔特人队（Celtic F.C.）球迷的常见称呼，和俱乐部历史中的爱尔兰移民社群文化有关。"]}
{"word":"BHP","summary":{"en":"BHP usually refers to BHP Group, a major Australian mining and resources company, and is often used as an abbreviation in business contexts.","zh":"BHP 通常指澳大利亚大型矿业与资源公司 BHP 集团，也常作为商业语境中的缩写使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large Australian mining and resources company (BHP Group), formerly known as Broken Hill Proprietary; often mentioned in business, commodities, and stock-market news.","zh":"澳大利亚大型矿业与资源公司 BHP 集团（BHP Group），曾用名“Broken Hill Proprietary”（必和必拓的历史名称）；常见于商业、商品与股市新闻。"},"examples":[{"en":"BHP is one of the world’s biggest producers of iron ore.","zh":"BHP 是全球最大的铁矿石生产商之一。"},{"en":"The price of copper can affect BHP’s earnings.","zh":"铜价会影响 BHP 的盈利。"},{"en":"She bought BHP shares on the Australian Securities Exchange.","zh":"她在澳大利亚证券交易所买了 BHP 的股票。"}]},{"partOfSpeech":"other","definition":{"en":"a written abbreviation for the company name BHP, used in reports, headlines, and finance documents.","zh":"BHP 的书面缩写，用于报告、新闻标题与财经文件中。"},"examples":[{"en":"The report compares Rio Tinto and BHP.","zh":"这份报告比较了力拓（Rio Tinto）和 BHP。"},{"en":"BHP announced a new project in Western Australia.","zh":"BHP 宣布了一个位于西澳大利亚的新项目。"}]}],"synonyms":["BHP Group","Broken Hill Proprietary (historical name)"],"phonetic":"/biː eɪtʃ piː/","extraExplanation":["BHP 最早与澳大利亚新南威尔士州的“Broken Hill（布罗肯希尔）”矿区有关，因此历史全称里出现了 Broken Hill Proprietary。后来公司业务扩展到铁矿石、铜、煤、镍等多种资源领域，媒体与投资者通常直接用三个字母“BHP”指代。"]}
{"word":"bhp","summary":{"en":"“BHP” most commonly refers to the mining company BHP Group, or to “brake horsepower” (bhp), a measure of engine power.","zh":"“BHP”最常见的含义是矿业公司 BHP（必和必拓集团），也可以指“bhp（制动马力）”，即发动机功率单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"BHP (BHP Group): an Australian global mining and resources company, known for producing iron ore, copper, coal, and other commodities.","zh":"BHP（必和必拓集团）：一家澳大利亚的全球矿业与资源公司，以铁矿石、铜、煤等大宗商品生产而闻名。"},"examples":[{"en":"BHP is one of the world’s largest mining companies.","zh":"BHP 是世界上最大的矿业公司之一。"},{"en":"The price of iron ore can affect BHP’s profits.","zh":"铁矿石价格会影响 BHP 的利润。"}]},{"partOfSpeech":"n.","definition":{"en":"bhp / BHP (brake horsepower): a unit used to describe an engine’s power output (especially in cars and machines).","zh":"bhp / BHP（制动马力）：用于描述发动机输出功率的单位（常见于汽车和机械）。"},"examples":[{"en":"This car has 300 bhp.","zh":"这辆车有 300 匹（制动）马力。"},{"en":"The new engine produces more bhp than the old one.","zh":"新发动机的制动马力比旧的更大。"}]}],"synonyms":["brake horsepower (for bhp)","horsepower (general meaning)"],"phonetic":"/biː eɪtʃ piː/","extraExplanation":["“BHP”在新闻里常指公司名（BHP Group）；在汽车、摩托车和机械参数中更常见的是“bhp”，指发动机功率单位。判断含义时可以看语境：财经/矿业多半是公司；车辆性能参数多半是马力单位。"]}
{"word":"bhrag","summary":{"en":"“Brag” means to talk proudly (often too proudly) about yourself or something you have.","zh":"“brag” 指（常带负面意味地）自夸、炫耀，或指吹嘘的话。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to talk proudly about what you have done or what you own (often in a way that annoys others)","zh":"（常带令人反感的感觉）吹嘘；夸口；自夸"},"examples":[{"en":"He always brags about his expensive car.","zh":"他总是吹嘘自己那辆昂贵的车。"},{"en":"She didn’t want to brag, but she got the highest score in the class.","zh":"她不想自夸，但她拿了全班最高分。"},{"en":"Don’t brag about your salary at work.","zh":"在工作场合别拿薪水来炫耀。"}]},{"partOfSpeech":"n.","definition":{"en":"a proud statement about your achievements or possessions","zh":"吹嘘的话；夸口"},"examples":[{"en":"His brag about being “the best” made people uncomfortable.","zh":"他夸口说自己“最厉害”，让大家不太舒服。"},{"en":"That wasn’t a fact—it was just a brag.","zh":"那不是事实，只是吹嘘而已。"}]}],"synonyms":["boast","show off","gloat (often meaner)","talk big"],"phonetic":"/bræɡ/","extraExplanation":["“bhrag” 不是常见英语单词；你可能想查的是 “brag”。","语气提示：brag 往往带负面意味（听起来骄傲、炫耀）。如果想更中性或礼貌，可以用：be proud of（为……感到自豪）、share（分享）、mention（提到）、highlight（强调亮点）。","常见搭配：brag about + 名词/动名词（brag about winning）；brag to + 人（brag to his friends）。","相关词：bragging（吹嘘的）；braggart（爱吹嘘的人）。"]}
{"word":"bhreg","summary":{"en":"“bhreg” isn’t a recognized English word; it’s likely a typo or an acronym.","zh":"“bhreg”不是公认的英文单词；更可能是拼写错误或缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it may be a typo, a username, or an abbreviation/acronym used in a specific context.","zh":"不是标准英语单词；可能是拼写错误、用户名，或某个特定语境里的缩写/首字母词。"},"examples":[{"en":"I can’t find “bhreg” in a dictionary—did you mean a different word?","zh":"我在词典里找不到“bhreg”——你是不是想输入另一个词？"},{"en":"If “bhreg” is an acronym, please tell me what field it’s from (school, gaming, work, etc.).","zh":"如果“bhreg”是缩写，请告诉我它来自哪个领域（学校、游戏、工作等）。"}]}],"phonetic":"/biː eɪtʃ ɑr iː dʒiː/","extraExplanation":["“bhreg”看起来不像常见英文单词。我可以帮你排查：\n1）你原本想查的词是什么？（比如 re- / be- 开头？）\n2）它出现在哪里？（聊天、作业、技术文档、游戏、公司内部系统）\n3）如果是缩写，能否给出全称或一句上下文？\n\n如果你只是想知道它的读法：英文里遇到这种字符串通常会按字母逐个读（类似读缩写）。"]}
{"word":"bhreu","summary":{"en":"“bhreu” isn’t a recognized English word; it likely needs context or is a misspelling.","zh":"“bhreu”不是常见英语单词；很可能需要语境或是拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“bhreu” is not a standard English word. It may be a typo, a username, or an abbreviation, so I can’t give a reliable dictionary definition.","zh":"“bhreu”不是标准英语单词，可能是拼写错误、用户名或缩写，因此无法给出可靠的词典释义。"},"examples":[{"en":"I couldn’t find “bhreu” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里找不到“bhreu”——你能把看到它的句子发我吗？"},{"en":"If you meant “breathe,” it’s spelled b-r-e-a-t-h-e.","zh":"如果你想写的是“breathe（呼吸）”，拼写是 b-r-e-a-t-h-e。"}]}],"extraExplanation":["我可能需要更多线索来判断你的意思：\n1）你在哪里看到“bhreu”（聊天、作业、游戏、歌曲等）？\n2）它前后有哪些单词（给我一整句最好）？\n3）你想查的是英文单词，还是某种缩写/代码？\n\n常见的相近拼写可能是：breathe（呼吸）、brew（酿造/冲泡）、bruh（俚语：兄弟/哥们）。"]}
{"word":"bhringraj","summary":{"en":"Bhringraj is an Ayurvedic medicinal herb (often Eclipta prostrata) commonly used in hair/scalp products and herbal remedies.","zh":"Bhringraj 是阿育吠陀常用的一种药草（多指旱莲草 Eclipta prostrata），常见于护发护头皮产品和草本配方中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medicinal herb used in Ayurveda (traditional Indian medicine), often identified as Eclipta prostrata, traditionally used in hair and scalp care and in herbal tonics.","zh":"一种用于阿育吠陀（印度传统医学）的药草，常被认为是“旱莲草”（Eclipta prostrata），传统上常用于护发护头皮及草本滋补配方。"},"examples":[{"en":"Some Ayurvedic hair oils include bhringraj to support scalp health.","zh":"一些阿育吠陀护发油会加入 bhringraj，用来帮助头皮健康。"},{"en":"The label says “bhringraj extract,” which is another name for eclipta.","zh":"标签写着“bhringraj extract（bhringraj 提取物）”，它也是 eclipta 的别称。"}]}],"synonyms":["false daisy","eclipta","Eclipta prostrata","maka (regional name)"],"phonetic":"/ˈbrɪŋ.rɑːdʒ/","extraExplanation":["“Bhringraj”一词来自印度语境，常见于阿育吠陀产品（如发油、草本粉、胶囊）。不同品牌或地区可能把它对应到同属或近似植物，但最常见的对应是 Eclipta prostrata（中文常译“旱莲草”）。购买时可查看拉丁学名以避免混淆。","在英语里它多作为外来词使用，通常不做复数变化（也有人写作 bhringrajs，但不常见）。大小写一般用小写：bhringraj。"]}
{"word":"BHT","summary":{"en":"BHT most commonly means butylated hydroxytoluene, a synthetic antioxidant used to keep products from going rancid; in some contexts it can also be a workplace abbreviation (meaning varies).","zh":"BHT最常见指“丁基羟基甲苯”，一种用于延缓油脂氧化变质的合成抗氧化剂；在某些语境中也可能是工作场合的缩写（含义因行业而异）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"butylated hydroxytoluene: a synthetic antioxidant added to some foods, cosmetics, and other products to help prevent oils and fats from going rancid.","zh":"BHT（丁基羟基甲苯）：一种合成抗氧化剂，添加在某些食品、化妆品等产品中，用来减缓油脂氧化、避免“哈味/酸败”。"},"examples":[{"en":"This snack contains BHT to keep the flavor fresh longer.","zh":"这种零食含有BHT，用来让风味更持久、延缓变质。"},{"en":"Some people try to avoid preservatives like BHT and BHA.","zh":"有些人会尽量避免BHT、BHA这类防腐/抗氧化添加剂。"},{"en":"Check the ingredient list: BHT may appear in cereals, chips, or chewing gum.","zh":"看看配料表：BHT可能出现在麦片、薯片或口香糖里。"}]},{"partOfSpeech":"n.","definition":{"en":"an abbreviation used in some workplaces for certain job titles or departments (for example, a Behavioral Health Technician). Meaning depends on the field and context.","zh":"在部分行业里用于某些职位/部门的缩写（例如“Behavioral Health Technician”行为健康技术员）。具体含义取决于领域与语境。"},"examples":[{"en":"The BHT will help monitor patients during the shift.","zh":"值班期间，BHT会协助观察并记录患者状况。"},{"en":"In this clinic, BHT is a job title, not a chemical ingredient.","zh":"在这家诊所里，BHT是职位名称，不是化学添加剂。"}]}],"synonyms":["butylated hydroxytoluene","E321"],"phonetic":"/ˌbiː eɪtʃ ˈtiː/","extraExplanation":["在食品配料表里，BHT常被视为“抗氧化剂/防腐剂”一类的添加物；在不同国家/地区的法规与标示方式可能不同。","BHT在食品添加剂编码中常见对应为E321（欧盟体系）；如果你是在配料表或产品标签里看到BHT，通常就是指这种抗氧化剂。","因为BHT也是缩写，口语或聊天里若没有“配料/化学/食品”语境，最好询问对方：这里的BHT具体指什么？"]}
{"word":"BHT-containing","summary":{"en":"BHT-containing describes a product that has the additive BHT in it.","zh":"BHT-containing 指“含有添加剂 BHT 的（产品）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a product) containing BHT (butylated hydroxytoluene), a synthetic antioxidant added to help prevent oils and fats from going rancid.","zh":"（指产品）含有 BHT（丁基羟基甲苯）的；BHT 是一种人工抗氧化剂，用来减缓油脂氧化、变质（酸败）。"},"examples":[{"en":"I’m looking for a BHT-containing lotion because it stays stable longer.","zh":"我在找含 BHT 的乳液，因为它的稳定性通常更久。"},{"en":"The label warns that this snack is BHT-containing and may not suit everyone.","zh":"标签提示这款零食含 BHT，可能不适合所有人。"},{"en":"They switched to a non‑BHT formula after some customers asked for BHT-free options.","zh":"一些顾客提出想要无 BHT 选项后，他们改用了不含 BHT 的配方。"}]}],"synonyms":["containing BHT","with BHT","BHT-added","BHT-included"],"phonetic":"/ˌbiː eɪtʃ ˈtiː kənˈteɪnɪŋ/","extraExplanation":["BHT 是 butylated hydroxytoluene 的缩写，常见于食品（如含油零食、口香糖基料等）、化妆品、以及某些包装材料中，主要作用是“抗氧化、防油脂变味”。","表达上常见对比：BHT-containing（含 BHT 的） vs. BHT-free（不含 BHT 的）。在成分表里也可能直接写 “BHT”。","这是一个由缩写 + containing 组成的复合形容词，通常需要连字符（hyphen）来修饰名词：a BHT-containing product / BHT-containing ingredients。"]}
{"word":"Bhubaneshwar","summary":{"en":"Bhubaneshwar (more commonly spelled Bhubaneswar) is the capital of Odisha, India, famous for its temples.","zh":"Bhubaneshwar（更常见拼写为 Bhubaneswar）是印度奥里萨邦首府，以寺庙闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in eastern India (the capital of Odisha), known for its many ancient Hindu temples and as part of the “Golden Triangle” tourist route with Puri and Konark.","zh":"印度东部的一座城市（奥里萨邦首府），以众多古代印度教寺庙闻名，也是与普里（Puri）和科纳克（Konark）并列的“黄金三角”旅游线路之一。"},"examples":[{"en":"Bhubaneshwar is the capital city of Odisha in India.","zh":"布巴内斯瓦尔是印度奥里萨邦的首府。"},{"en":"Many travelers visit Bhubaneshwar for its temples and history.","zh":"许多游客到布巴内斯瓦尔是为了参观寺庙和了解历史。"}]}],"synonyms":["Bhubaneswar"],"phonetic":"/ˌbuːbəˈneɪʃwɔːr/","extraExplanation":["“Bhubaneshwar”常见于较旧或变体的拼写；更常用的官方拼写是“Bhubaneswar”。","名称来源与梵语有关，常被解释为与“世界（bhuvana）”和“主/神（ishvara）”相关，因此也有人把它理解为“世界之主”的意思。","城市因寺庙密集而常被称为“Temple City（寺庙之城）”；附近的林加拉吉神庙（Lingaraja Temple）是最著名的地标之一。"]}
{"word":"Bhubaneswar","summary":{"en":"Bhubaneswar is the capital of Odisha, India, famous for ancient temples.","zh":"布巴内斯瓦尔是印度奥里萨邦首府，以古代寺庙闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A major city in eastern India, the capital of the state of Odisha, known for its many ancient Hindu temples and planned urban layout.","zh":"印度东部的一座重要城市，奥里萨邦（Odisha）首府，以众多古代印度教寺庙与规划建设的城市格局闻名。"},"examples":[{"en":"Bhubaneswar is the capital city of Odisha in eastern India.","zh":"布巴内斯瓦尔是印度东部奥里萨邦的首府。"},{"en":"Many travelers visit Bhubaneswar to see its historic temples.","zh":"许多游客到布巴内斯瓦尔参观其历史悠久的寺庙。"}]}],"synonyms":["Bhubaneshwar"],"phonetic":"/ˌbuːbəˈneɪʃwɑr/","extraExplanation":["词源上常解释为“Bhubaneswar = Bhuvaneshwar”，来自梵语/奥里亚语传统：bhuvana（世界/宇宙）+ īśvara（主宰/神），可理解为“世界之主”。","这座城市常与附近的“金三角”旅游线路一起出现：Bhubaneswar（寺庙城市）—Puri（海滨与贾格纳特神庙）—Konark（太阳神庙）。"]}
{"word":"bhubaneswar","summary":{"en":"Bhubaneswar is the capital city of Odisha, India, famous for its historic temples.","zh":"Bhubaneswar（布巴内斯瓦尔）是印度奥迪沙邦首府，以历史寺庙闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the capital city of the Indian state of Odisha (formerly Orissa), known for many historic Hindu temples and as part of the “Golden Triangle” tourist route with Puri and Konark","zh":"印度奥迪沙邦（旧称奥里萨邦）的首府城市，以众多历史悠久的印度教寺庙闻名，也是与普里（Puri）和科纳克（Konark）并称的旅游“金三角”之一"},"examples":[{"en":"Bhubaneswar is the capital of Odisha in eastern India.","zh":"布巴内斯瓦尔是印度东部奥迪沙邦的首府。"},{"en":"Many travelers visit Bhubaneswar to see its ancient temples.","zh":"许多游客到布巴内斯瓦尔参观古老的寺庙。"},{"en":"She flew to Bhubaneswar for a conference and then went on to Puri.","zh":"她飞到布巴内斯瓦尔参加会议，然后继续前往普里。"}]}],"synonyms":["BBSR"],"phonetic":"/ˌbuːbəˈneɪʃwər/","extraExplanation":["“Bhubaneswar”常见的英文读法以重音落在“-NAY-”附近；中文也常译作“布巴内斯瓦尔”。","这座城市常被称为“Temple City（寺庙之城）”，因为周边保存了大量中世纪时期的石造寺庙建筑。","在印度境内旅行与航空订票时，你可能会看到缩写/机场代码与城市名并用；当地机场为 Biju Patnaik International Airport（比朱·帕特奈克国际机场）。"]}
{"word":"Bhudan","summary":{"en":"Bhoodan is an Indian movement (and the land gifts from it) promoting voluntary donation of land to the landless.","zh":"Bhoodan 指印度的“赠地运动”（以及由此产生的赠地），提倡自愿把土地捐赠给无地者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(India) a land-reform movement that encouraged landowners to donate (“gift”) land to landless people; also, a piece of land given as such a gift.","zh":"（印度）“赠地运动”：鼓励地主把土地“捐赠/赠送”给无地者的土地改革运动；也可指这样捐出的土地。"},"examples":[{"en":"The Bhoodan movement asked wealthy landowners to donate land to poor farmers.","zh":"“赠地运动”呼吁富有的地主把土地捐赠给贫困农民。"},{"en":"He received a small plot through a Bhoodan land gift.","zh":"他通过“赠地”获得了一小块地。"}]}],"synonyms":["Bhoodan Movement","land-gift movement","land reform"],"phonetic":"ˈbuːdɑːn","extraExplanation":["“Bhoodan”更常见的拼写是 **Bhoodan**（你写的 Bhudan 可能是简写/误拼）。词源来自印地语/梵语元素：**bhu**（土地）+ **dan**（赠予）。","该运动与印度独立后时期相关，常与社会活动家 **Vinoba Bhave（维诺巴·巴韦）**联系在一起，强调以非暴力、道德劝导的方式推动土地再分配。","在英文文本中它通常作为专有名词出现，首字母常大写：**the Bhoodan Movement**。"]}
{"word":"Bhudevi","summary":{"en":"Bhudevi is the Hindu Earth goddess—Mother Earth personified.","zh":"Bhudevi 指印度教中的“大地女神”，即人格化的“母亲大地”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Hinduism) The Earth goddess; Mother Earth personified in Hindu tradition, often regarded as a form of Lakshmi and a consort of Vishnu (especially in Vaishnavism).","zh":"（印度教）大地女神；象征“母亲大地”的神祇，常被视为吉祥天女（Lakshmi）的化身之一，在毗湿奴崇拜中常被看作毗湿奴的配偶之一。"},"examples":[{"en":"In the story of Varaha, Vishnu rescues Bhudevi from the depths of the ocean.","zh":"在野猪化身（Varaha）的故事中，毗湿奴将大地女神 Bhudevi 从海底深处救起。"},{"en":"Many temples honor Bhudevi alongside Vishnu and Lakshmi.","zh":"许多寺庙会将 Bhudevi 与毗湿奴和 Lakshmi 一同供奉。"}]}],"synonyms":["Bhu Devi","Bhumi Devi","Bhūmi","Prithvi","Mother Earth"],"phonetic":"/buːˈdeɪvi/","extraExplanation":["词源：来自梵语 *Bhū-devī*，*bhū* 表示“大地/土地”，*devī* 表示“女神”。英文中也常见拼写 **Bhu Devi / Bhumi Devi**。","文化背景：在某些传统中，Bhudevi 常与 **Sridevi**（通常指 Lakshmi）并列，象征繁荣与大地的滋养。她在神话里也与毗湿奴的化身 **Varaha（野猪神）** 的“拯救大地”叙事紧密相关。"]}
{"word":"Bhumibol","summary":{"en":"Bhumibol most commonly refers to Thailand’s late King Bhumibol Adulyadej (Rama IX).","zh":"Bhumibol 最常指泰国已故国王普密蓬·阿杜德（拉玛九世）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bhumibol (often referring to King Bhumibol Adulyadej) was the late king of Thailand (reigned 1946–2016), widely respected and also known as Rama IX.","zh":"Bhumibol（通常指泰国已故国王普密蓬·阿杜德）是泰国国王（在位1946–2016），备受尊敬，也被称为拉玛九世。"},"examples":[{"en":"Many Thais refer to King Bhumibol as Rama IX.","zh":"许多泰国人把普密蓬国王称为拉玛九世。"},{"en":"King Bhumibol reigned for decades and played an important symbolic role in Thai society.","zh":"普密蓬国王在位数十年，在泰国社会中具有重要的象征意义。"}]}],"synonyms":["Rama IX","King Bhumibol","Bhumibol Adulyadej"],"phonetic":"/ˈbuːmiˌbɔːl/","extraExplanation":["在英语里，Bhumibol 是人名（专有名词），常单独用来指泰国国王“Bhumibol Adulyadej”。在新闻与历史语境中，也常写作 King Bhumibol 或 Rama IX。","跨文化提醒：在泰国，对王室的称呼与讨论非常严肃且有法律与礼仪规范；在英语写作中通常使用更正式的称呼（如 King Bhumibol, His Majesty King Bhumibol Adulyadej）。"]}
{"word":"bhumidar","summary":{"en":"Bhumidar means a legal land-rights holder (especially of farmland) in parts of India.","zh":"Bhumidar指印度部分地区对农地拥有法律权利的“土地权利持有者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in India) a person who holds legal rights to agricultural land; a tenure-holder, often with the right to cultivate or lease the land.","zh":"（印度语境）拥有农地法律权利的人；一种土地权利持有者（常可自行耕种或出租土地）。"},"examples":[{"en":"In Delhi, many villages have bhumidars whose land was later acquired for development.","zh":"在德里，许多村庄有bhumidar（土地权利人），他们的土地后来被征收用于开发。"},{"en":"The dispute was about whether he was a bhumidar or only a tenant.","zh":"争议在于他到底是bhumidar（土地权利人）还是仅仅是佃户。"}]}],"synonyms":["land-rights holder","tenure-holder","landholder"],"phonetic":"/ˌbuːmɪˈdɑːr/","extraExplanation":["“bhumidar”来自印地语/梵语词根：bhumi（土地）+ dhar（持有者），字面意思是“持地者”。","在北印度的一些土地改革与法律体系中（如德里、北方邦等），bhumidar是一种特定的土地权利/身份类别，通常不同于一般“landlord（地主）”。其具体权利（能否买卖、继承、转让、出租等）会因地区法律与时期而变化。","在英文报道或法律文件中，这个词常保留原词（不翻译），因为它指的是当地特有的土地权属概念。"]}
{"word":"Bhumihar","summary":{"en":"Bhumihar is the name of a Hindu landowning community (caste group), especially in Bihar and eastern Uttar Pradesh, India.","zh":"Bhumihar指印度比哈尔邦及北方邦东部较常见的一个印度教地主社群（种姓群体）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Hindu landowning community (caste group) found mainly in the Indian states of Bihar and eastern Uttar Pradesh; historically associated with farming, landholding, and local leadership","zh":"一个印度教的地主社群（种姓群体），主要分布在印度比哈尔邦及北方邦东部；历史上与耕作、土地拥有与地方社会领导角色有关"},"examples":[{"en":"Many Bhumihars in Bihar have traditionally worked as farmers and landowners.","zh":"在比哈尔邦，许多Bhumihar传统上从事农业并拥有土地。"},{"en":"The village council included members from several groups, including Bhumihar families.","zh":"村务委员会由多个群体的成员组成，其中也包括Bhumihar家族。"},{"en":"In some historical accounts, Bhumihars are described as a landholding community with strong local influence.","zh":"在一些历史记载中，Bhumihar被描述为拥有土地、在地方上影响力较强的社群。"}]}],"synonyms":["Bhumihar Brahmin","Bhuinhar"],"phonetic":"/ˌbuːmɪˈhɑːr/","extraExplanation":["“Bhumihar”常被理解为一个地区性很强的社群名称，使用时通常指社会群体身份，而不是职业本身。不同地区与不同时期对其地位与起源的说法可能不完全一致。","在正式写作中，建议用中性、描述性的表达（如“a landowning community in Bihar”），并避免把任何社群与固定的性格、能力或价值判断直接绑定，以免造成刻板印象。"]}
{"word":"Bhumij","summary":{"en":"Bhumij refers to an Indigenous people of eastern India and also the language many of them speak.","zh":"Bhumij 指印度东部的布米吉族，也可指他们使用的布米吉语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an Indigenous community in eastern India, especially in Jharkhand, West Bengal, and Odisha.","zh":"布米吉人：印度东部的一个原住民族群成员，主要分布在贾坎德邦、西孟加拉邦和奥里萨邦。"},"examples":[{"en":"Many Bhumij families live in eastern India, especially in Jharkhand.","zh":"许多布米吉家庭居住在印度东部，尤其是贾坎德邦。"},{"en":"The museum has an exhibit on Bhumij history and culture.","zh":"这家博物馆有一个关于布米吉历史与文化的展览。"}]},{"partOfSpeech":"n.","definition":{"en":"the Munda language spoken by many Bhumij people (also called Bhumij or Bhumij language).","zh":"布米吉语：布米吉人中许多人使用的一种蒙达语支语言（也称 Bhumij / Bhumij language）。"},"examples":[{"en":"She is learning Bhumij to speak with her grandparents.","zh":"她正在学习布米吉语，以便和祖父母交流。"},{"en":"The story was recorded in Bhumij and then translated into English.","zh":"这个故事先用布米吉语记录下来，随后被译成英文。"}]}],"synonyms":["Bhumij people","Bhumij language"],"phonetic":"/ˈbuːmɪdʒ/","extraExplanation":["“Bhumij”通常是专有名词（族名/语言名），在英文里首字母常大写：Bhumij。","在印度的官方与学术语境中，Bhumij常被归入“Scheduled Tribes（表列部落）”相关讨论，但各邦的行政分类与具体政策可能不同。"]}
{"word":"bhumij","summary":{"en":"Bhumij refers to an Indigenous community in eastern India, their language, or something related to their culture.","zh":"Bhumij 指印度东部的布米吉原住民族群、布米吉语，或与其文化相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Bhumij, an Indigenous (Adivasi) community mainly found in eastern India (especially Odisha, Jharkhand, and West Bengal).","zh":"布米吉人：主要分布在印度东部（尤指奥里萨邦、贾坎德邦和西孟加拉邦）的一个原住民（阿迪瓦西）族群成员。"},"examples":[{"en":"The Bhumij are one of the Indigenous communities of eastern India.","zh":"布米吉人是印度东部的原住民族群之一。"},{"en":"Many Bhumij families live in rural areas and maintain strong community traditions.","zh":"许多布米吉家庭生活在乡村，并保持着紧密的社群传统。"}]},{"partOfSpeech":"n.","definition":{"en":"the Bhumij language, a Munda language spoken by some Bhumij people.","zh":"布米吉语：由部分布米吉人使用的一种蒙达语支语言。"},"examples":[{"en":"Some elders still speak Bhumij at home.","zh":"一些长者在家里仍然说布米吉语。"},{"en":"The school encourages children to value Bhumij alongside regional languages.","zh":"学校鼓励孩子们重视布米吉语，也重视当地的区域语言。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Bhumij people or their language and culture.","zh":"布米吉人的；与布米吉语或布米吉文化有关的。"},"examples":[{"en":"They organized a Bhumij cultural festival in the town.","zh":"他们在城里举办了布米吉文化节。"},{"en":"The museum has a small Bhumij art collection.","zh":"博物馆里有一小部分布米吉艺术收藏。"}]}],"synonyms":["(no close synonyms; proper name)"],"phonetic":"/ˈbuːmɪdʒ/","extraExplanation":["“Bhumij”一词常被解释为与“土地/大地”有关（与印度多种语言里表示“土地”的词根 *bhumi* 相近），因此在一些资料中可见“土地之子/土著”的含义联想。","英文中作为专有名词使用时通常首字母大写：**Bhumij**。用于语言名称时也常写作 **Bhumij (language)**。","在写作或报道中提到该群体时，使用尊重性的表述很重要，例如“Indigenous community/people（原住民社群/族群）”，并尽量依据当事人自称与当地学术/官方分类。"]}
{"word":"bhunder","summary":{"en":"“Bhunder” is not standard English; it is usually a misspelling of “blunder” (a careless mistake).","zh":"“bhunder”不是标准英语；通常是把“blunder”（粗心的错误/失误）拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or misspelled form of “blunder,” meaning a careless or embarrassing mistake.","zh":"“blunder”的非标准拼写或拼写错误，意思是“粗心的/尴尬的错误”。"},"examples":[{"en":"I think you meant “blunder,” not “bhunder.”","zh":"我觉得你想写的是“blunder”，不是“bhunder”。"},{"en":"It was a blunder to send the email to the wrong person.","zh":"把邮件发错人是个失误。"}]}],"synonyms":["mistake","error","slip","gaffe","misstep"],"phonetic":"/ˈblʌndɚ/","extraExplanation":["“bhunder”不是常见的标准英语单词。如果你是在聊天或社交媒体上看到它，多数情况下是把“blunder”拼错了。","少数情况下，“Bhunder/Bhundar”等可能是人名、姓氏或地名（尤其在南亚语境中）；如果你能提供一句原文，我可以根据上下文更准确判断。"]}
{"word":"bhungi","summary":{"en":"Bhungi is a rare South Asian English word for a small bamboo pipe/horn used as a folk instrument.","zh":"Bhungi 是一个较少见的南亚英语词，指一种小型竹制吹管/号角等民间乐器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English, rare) A small bamboo pipe or horn (a traditional folk instrument), sometimes used by snake charmers; similar to a pungi/been.","zh":"（南亚英语用词，较少见）一种小型竹制吹管或号角（传统民间乐器），有时与舞蛇人使用的笛/蛇笛（pungi/been）相近。"},"examples":[{"en":"The snake charmer lifted a bhungi and began to play a slow tune.","zh":"舞蛇人举起一支 bhungi，开始吹奏缓慢的旋律。"},{"en":"In some villages, children learn simple melodies on a bamboo bhungi during festivals.","zh":"在一些村庄里，孩子们会在节庆时学吹竹制的 bhungi，演奏简单的曲调。"}]}],"synonyms":["pungi","been","bamboo pipe","bamboo horn"],"phonetic":"/ˈbʊŋɡi/","extraExplanation":["“bhungi”在主流英语词典中不算常见，更可能出现在描述南亚传统文化/乐器的语境里。不同地区和拼写可能指向相近乐器。","它容易与“pungi/been（蛇笛）”混淆；如果你想表达“蛇笛”，更常用的英语词是 pungi 或 been。","如果你原本想写的是“bhangi（印度社会语境中的词）”或人名/地名，请告诉我具体语境（句子或来源），我可以帮你确认更准确的含义。"]}
{"word":"bhungini","summary":{"en":"“Bhungini” is South African informal slang used to address someone like a friend or close companion; it isn’t standard English.","zh":"“bhungini”多为南非口语中的非正式称呼，类似称“朋友/亲近的人”，并非标准英语词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South African informal, loanword/slang; not standard English) A friendly way to address someone like “my friend / bro / sis,” depending on local language and context.","zh":"（南非非正式借词/俚语；非标准英语）一种亲昵的称呼，类似“朋友/兄弟/姐妹”，具体指向会随当地语言与语境而变。"},"examples":[{"en":"Hey, bhungini, can you help me for a second?","zh":"嗨，bhungini，你能帮我一下吗？"},{"en":"I ran into my bhungini at the taxi rank.","zh":"我在出租车站碰到了我的bhungini（好朋友/兄弟/姐妹）。"}]}],"synonyms":["friend","mate","bro","sis"],"phonetic":"/buŋˈɡiːni/","extraExplanation":["“bhungini”不是常见的英语词条，更像是源自南非本地语言（如isiXhosa/isiZulu等）进入口语英语的称呼语/俚语，拼写也可能因地区与个人而异。","如果你能提供一句原句或说明来自哪种语言/地区（例如Xhosa、Zulu、Shona等），我可以给出更准确的含义、用法和更贴近的发音。"]}
{"word":"bhut","summary":{"en":"Bhut means a ghost/spirit in South Asian contexts, and it also appears in the chili name bhut jolokia (“ghost pepper”).","zh":"Bhut 在南亚语境中指“鬼魂/幽灵”，也用于辣椒名 bhut jolokia（“鬼椒/魔鬼椒”，英文常称 ghost pepper）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English; from Hindi/Urdu) a ghost or spirit, often one believed to haunt places or people.","zh":"（南亚英语；源自印地语/乌尔都语）鬼魂、幽灵；常指会作祟或缠人的灵体。"},"examples":[{"en":"In the story, the old house is said to be haunted by a bhut.","zh":"在故事里，那栋老房子据说被一个 bhut（鬼魂）闹得不安宁。"},{"en":"Some villagers believe a bhut wanders near the river at night.","zh":"有些村民相信夜里河边会有 bhut（幽灵）徘徊。"}]},{"partOfSpeech":"n.","definition":{"en":"used in the name of a very hot chili pepper: bhut jolokia (also called the “ghost pepper”).","zh":"用于一种非常辣的辣椒名称：bhut jolokia（也叫“鬼椒/魔鬼椒/断魂椒”，英文常称 ghost pepper）。"},"examples":[{"en":"Bhut jolokia is famous for its intense heat.","zh":"Bhut jolokia 以极强的辣度而闻名。"},{"en":"Add only a tiny piece of bhut jolokia to the sauce.","zh":"在酱汁里只要加一小小片 bhut jolokia 就够了。"}]}],"synonyms":["ghost","spirit","apparition"],"phonetic":"/buːt/","extraExplanation":["“bhut/bhoot（भूत/بھوت）”在南亚文化里很常见，常出现在民间故事、恐怖传说和宗教语境中。英语里多见于南亚英语或文化介绍性文本；在普通美式英语中更常用的词是 ghost 或 spirit。","“bhut jolokia”来自印度东北部（如阿萨姆、那加兰等地区）的辣椒品种名称；其中 bhut 常被解释为“鬼/幽灵”，所以英语里常叫 ghost pepper。"]}
{"word":"bhut jolokia","summary":{"en":"Bhut jolokia is an extremely hot chili pepper, also known as the ghost pepper.","zh":"Bhut jolokia 指一种极辣的辣椒，也叫鬼椒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very hot chili pepper from Northeast India, famous for extreme spiciness; also called the ghost pepper.","zh":"一种来自印度东北部的超辣辣椒，以极高辣度闻名；也叫“鬼椒”。"},"examples":[{"en":"Bhut jolokia is so spicy that a tiny piece can make a whole dish very hot.","zh":"鬼椒非常辣，一小块就能让整道菜变得很辣。"},{"en":"The sauce contains bhut jolokia, so taste it carefully.","zh":"这款酱里含有鬼椒，所以要小心试味。"}]}],"synonyms":["ghost pepper"],"phonetic":"/ˌbuːt dʒoʊˈloʊkiə/","extraExplanation":["“Bhut jolokia”常被译作“鬼椒”。它原产于印度阿萨姆邦（Assam）及周边地区，在当地饮食和民间用法中很有名。","它曾因辣度极高而受到媒体关注（常用史高维尔指标 Scoville 来衡量辣度）。日常语境里，人们更多用它来形容“超级辣”的食物或辣酱。"]}
{"word":"Bhutan","summary":{"en":"Bhutan: a Himalayan country between India and China, known for Buddhist culture and environmental protection.","zh":"不丹：位于印度与中国之间的喜马拉雅国家，以佛教文化和环境保护著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A country in South Asia, located in the eastern Himalayas, between India and China, known for its mountains, Buddhist culture, and emphasis on protecting nature and traditional life.","zh":"不丹：南亚国家，位于东喜马拉雅山脉，介于印度与中国之间，以高山地形、佛教文化，以及重视自然保护与传统生活而闻名。"},"examples":[{"en":"Bhutan is famous for its Himalayan landscapes and monasteries.","zh":"不丹以喜马拉雅山景和寺院闻名。"},{"en":"I read about Bhutan’s policy of measuring Gross National Happiness.","zh":"我读到不丹用“国民幸福总值”来衡量社会发展。"},{"en":"She traveled to Bhutan to learn more about Tibetan Buddhism and local traditions.","zh":"她去不丹旅行，想更了解藏传佛教和当地传统。"}]}],"synonyms":["the Kingdom of Bhutan"],"phonetic":"/buˈtɑn/","extraExplanation":["“Bhutan”的常见搭配：the Kingdom of Bhutan（不丹王国）；Bhutanese（不丹的；不丹人/不丹语，作形容词或名词）。","文化背景提示：不丹常与“Gross National Happiness（GNH，国民幸福总值）”联系在一起，用来表达对生活质量、文化与生态的重视。"]}
{"word":"Bhutanese","summary":{"en":"“Bhutanese” means “from Bhutan,” and it can describe things related to Bhutan or refer to a person from Bhutan.","zh":"“Bhutanese”表示“来自不丹的”，既可作形容词描述与不丹有关的事物，也可作名词指“不丹人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Bhutan or its people, language, or culture","zh":"不丹的；不丹人的；与不丹的人民、语言或文化有关的"},"examples":[{"en":"Bhutanese culture is known for valuing happiness and community.","zh":"不丹文化以重视幸福感和社区凝聚力而闻名。"},{"en":"She studies Bhutanese history in her Asian studies class.","zh":"她在亚洲研究课上学习不丹历史。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Bhutan; a Bhutan national","zh":"不丹人；不丹国民"},"examples":[{"en":"Many Bhutanese speak Dzongkha, the national language.","zh":"许多不丹人会说不丹的国语——宗喀语（Dzongkha）。"},{"en":"He met a Bhutanese while traveling in Nepal.","zh":"他在尼泊尔旅行时认识了一位不丹人。"}]}],"synonyms":["from Bhutan","Bhutan (adj. use)"],"phonetic":"/ˌbuːtəˈniːz/","extraExplanation":["“Bhutanese”通常既可作形容词（Bhutanese food 不丹菜），也可作名词指“一个不丹人”。","发音上重音一般在最后一个音节：bhoo-tuh-NEEZ。","相关表达：“the Bhutanese”可指“不丹人民”（整体），类似于“the Chinese / the Japanese”。"]}
{"word":"bhutanese","summary":{"en":"Bhutanese means a person from Bhutan or something related to Bhutan.","zh":"Bhutanese 指“不丹人”，也可作形容词表示“与不丹有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Bhutan; a citizen or native of Bhutan","zh":"不丹人；不丹公民（或不丹本地人）"},"examples":[{"en":"My neighbor is Bhutanese and taught me a few phrases in Dzongkha.","zh":"我的邻居是不丹人，还教了我几句宗喀语（Dzongkha）。"},{"en":"The festival welcomed Bhutanese from different regions of the country.","zh":"这个节日欢迎来自不丹各地区的不丹人。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Bhutan or its people, culture, or languages","zh":"不丹的；与不丹人、文化或语言有关的"},"examples":[{"en":"We watched a documentary about Bhutanese culture and traditional clothing.","zh":"我们看了一部关于不丹文化和传统服饰的纪录片。"},{"en":"Bhutanese cuisine often includes spicy dishes and red rice.","zh":"不丹菜常常有辣味菜肴和红米饭。"}]}],"synonyms":["from Bhutan","Bhutan (adj. use)"],"phonetic":"/ˌbuːtəˈniːz/","extraExplanation":["“Bhutanese”通常读作 /ˌbuːtəˈniːz/，重音在最后一个音节 -NESE；它和“Chinese, Japanese”一样，常用 -ese 结尾来表示“某国的（人/事物）”。","不丹（Bhutan）位于喜马拉雅山脉地区，官方语言是宗喀语（Dzongkha）。在英语里，用“a Bhutanese person”也很常见；复数既可以说“Bhutanese”（不变），也能在口语中见到“Bhutanese people”。"]}
{"word":"Bhutani","summary":{"en":"Bhutani can mean “Bhutanese” (relating to Bhutan or a person from Bhutan), and it is also a surname.","zh":"Bhutani 可指“不丹的/不丹人”（同 Bhutanese，较少见），也常用作姓氏。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(less common) Relating to Bhutan or its people; Bhutanese.","zh":"（较少见）与不丹或不丹人民有关的；不丹的；不丹人的（同 Bhutanese）。"},"examples":[{"en":"Bhutani culture is strongly shaped by Buddhism and the Himalayan environment.","zh":"不丹文化深受佛教与喜马拉雅环境的影响。"},{"en":"She studies Bhutani textiles and traditional clothing.","zh":"她研究不丹的纺织品与传统服饰。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Bhutan; a Bhutanese person.","zh":"不丹人；不丹居民（同 Bhutanese）。"},"examples":[{"en":"Many Bhutani value community harmony and respect for tradition.","zh":"许多不丹人重视社区和谐并尊重传统。"},{"en":"He is a Bhutani living abroad for graduate school.","zh":"他是不丹人，在国外读研究生。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname, common especially among people from India (often Punjabi), and also used by some families with connections to Bhutan.","zh":"（姓氏）常见于印度（尤其旁遮普地区）人群中；也可能被与不丹有联系的家庭使用。"},"examples":[{"en":"Dr. Bhutani will speak at the conference tomorrow.","zh":"Bhutani 博士将于明天在会议上发言。"},{"en":"Bhutani is his family name.","zh":"Bhutani 是他的姓。"}]}],"synonyms":["Bhutanese"],"phonetic":"/buːˈtɑːni/","extraExplanation":["“Bhutani”在英语里有时用作“不丹的/不丹人”，但更常见、更标准的说法是“Bhutanese”。如果你写正式文章（新闻、学术、旅游介绍），通常优先用 Bhutanese。","作为姓氏的“Bhutani”在南亚语境里更常见，看到人名时不一定与不丹有关，需要结合个人背景判断。"]}
{"word":"bhutani","summary":{"en":"“Bhutani” can mean “related to Bhutan / a person from Bhutan,” but in standard English “Bhutanese” is more common; it is also a South Asian surname.","zh":"“Bhutani”可指“与不丹有关/不丹人”，但标准英语里更常用“Bhutanese”；同时它也常见作南亚姓氏。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(also Bhutanese) relating to Bhutan or its people, language, or culture.","zh":"（也可说 Bhutanese）与不丹或不丹人民、语言、文化有关的。"},"examples":[{"en":"Bhutani culture includes traditions like archery festivals.","zh":"不丹文化包括射箭节之类的传统活动。"},{"en":"She studies Bhutani history and the development of the kingdom.","zh":"她研究不丹历史和这个王国的发展。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Bhutan; a Bhutanese person.","zh":"不丹人；不丹籍的人。"},"examples":[{"en":"Many Bhutani people speak Dzongkha as the national language.","zh":"许多不丹人把宗喀语作为国家语言。"},{"en":"He met a Bhutani student at the university.","zh":"他在大学里认识了一位不丹学生。"}]},{"partOfSpeech":"n.","definition":{"en":"a surname (family name), especially common among people from India/South Asia.","zh":"姓氏（家族姓），在印度/南亚地区较常见。"},"examples":[{"en":"Mr. Bhutani will join the meeting at 3 p.m.","zh":"Bhutani 先生将于下午三点参加会议。"},{"en":"Bhutani is her last name, not her nationality.","zh":"Bhutani 是她的姓，不是她的国籍。"}]}],"synonyms":["Bhutanese"],"phonetic":"/buːˈtɑːni/","extraExplanation":["英文里更常见的国籍/形容词是 **Bhutanese**（不丹的；不丹人）。**Bhutani** 有时会被用作“与不丹有关”，但在正式写作中建议用 **Bhutanese**，以免与姓氏 **Bhutani** 混淆。"]}
{"word":"Bhutatathata","summary":{"en":"Bhūtatathatā is a Buddhist term meaning the “suchness” or true nature of reality—things as they are beyond concepts and judgments.","zh":"Bhūtatathatā 是佛教术语，意为“真如 / 如其所是的真实本性”，超越概念与评判。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Mahāyāna Buddhism, the “suchness” or “true nature” of reality—things exactly as they are, beyond personal opinions, labels, and dualistic thinking (like self/other, good/bad).","zh":"（大乘佛教）“真如 / 如如 / 实相”：指万法如其所是的真实本性，超越个人见解、语言概念与二元分别（如我/他、好/坏）。"},"examples":[{"en":"Meditation practice is sometimes described as a way to realize bhūtatathatā—seeing things as they truly are.","zh":"禅修有时被说成是体悟“bhūtatathatā（真如）”的方法——如实地看见事物。"},{"en":"In Buddhist texts, bhūtatathatā points to ultimate reality rather than everyday appearances.","zh":"在佛教典籍中，bhūtatathatā 指向究竟实相，而不只是日常所见的表相。"}]}],"synonyms":["suchness","thusness","tathatā","ultimate reality","true nature (of reality)"],"phonetic":"/ˌbuːtəˈtɑːtəˌtɑː/","extraExplanation":["这个词常见写法为梵语转写 **bhūtatathatā**（也可见作 bhuta-tathata 等）。可拆理解为：**bhūta**（“真实的、已然的、如实的”）+ **tathatā**（“如是、如如、真如 / suchness”）。整体强调“真实之如是”。","它多出现在大乘佛教语境，意思接近中文佛教常用的“**真如**”“**实相**”。在学习时，可把它理解为：不是在讨论某个“东西”的外表，而是在指一切现象背后不依概念分别的“如实状态”。","英文里常用对应词：**suchness**、**thusness**、**ultimate reality**。在翻译或写作中，若面向一般读者，常用 suchness；若面向佛学语境，可直接用 tathatā / bhūtatathatā 并加注释。"]}
{"word":"bhutatathata","summary":{"en":"bhūta-tathatā: a Buddhist term meaning reality “as it truly is,” the ultimate suchness beyond concepts.","zh":"bhūta-tathatā：佛教术语，指事物“如其本然”的真实实相（真如/如如），超越概念分别。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Buddhism, the true nature of reality “as it really is”; ultimate suchness/thusness beyond conceptual labels and judgments.","zh":"佛教用语：指“如其本然”的真实实相；超越概念分别与评判的“真如/如如（suchness）”。"},"examples":[{"en":"Meditation is sometimes described as learning to see things in their bhūta-tathatā, without adding stories.","zh":"禅修有时被描述为学习在“bhūta-tathatā（如其本然的真如）”中看见事物，而不再添加各种故事与想象。"},{"en":"The teacher said compassion grows when we recognize the bhūta-tathatā of all beings.","zh":"老师说，当我们体认一切众生的“bhūta-tathatā（真实如如）”时，慈悲会增长。"}]}],"synonyms":["suchness","thusness","true nature","reality-as-it-is"],"phonetic":"/ˌbuːtə təˈtɑːtə/","extraExplanation":["“bhūta-tathatā”来自梵语：bhūta 有“真实的、已经成为的、如实”的意思；tathatā 常译作“真如/如如”，相当于英语 suchness（事物的“如是性”）。合起来强调“如实的真如”。","它常出现在大乘佛教哲学语境中，用来指向一种不可被语言完全框定的“实相”。学习时可把它理解为：不是“某个神秘的东西”，而是事物不经我们概念加工时的样子。","英文写法可能见到不同转写：bhuta-tathata、bhūta-tathatā（带长音符号的学术拼写）。"]}
{"word":"Bhutia","summary":{"en":"Bhutia refers to a Himalayan ethnic group (especially in Sikkim, India) and also describes things related to their culture or language.","zh":"Bhutia指喜马拉雅地区的一个族群（尤以印度锡金邦为主），也可作形容词表示与其文化或语言相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person belonging to the Bhutia people, an ethnic group found mainly in Sikkim (India) and nearby Himalayan regions","zh":"不丹族/不丹裔人（Bhutia），主要分布在印度锡金邦及周边喜马拉雅地区的一个族群成员"},"examples":[{"en":"Many Bhutia families in Sikkim practice Tibetan Buddhism.","zh":"锡金邦的许多Bhutia家庭信奉藏传佛教。"},{"en":"The festival included Bhutia music, dress, and food.","zh":"节庆活动包含Bhutia的音乐、服饰和饮食。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Bhutia people, their culture, or their language","zh":"与Bhutia族群、其文化或语言有关的"},"examples":[{"en":"She is researching Bhutia traditions in the eastern Himalayas.","zh":"她正在研究东喜马拉雅地区的Bhutia传统。"},{"en":"Bhutia cuisine often uses local grains and dairy products.","zh":"Bhutia饮食常使用当地谷物和乳制品。"}]}],"phonetic":"/ˈbuːtiə/","extraExplanation":["“Bhutia”通常首字母大写，因为它是族名/专有名词。不同资料里也可能写作“Bhotia”。","Bhutia族群在历史与文化上与藏文化关系密切；在印度语境中，常与锡金的其他族群（如Lepcha）并列提及。","在一些语境里，“Bhutia”也可指他们所使用的语言/方言（常被归入藏语支相关语言），具体名称与分类会因地区与研究而不同。"]}
{"word":"bhutia","summary":{"en":"Bhutia refers to a Tibetan-origin ethnic group in Sikkim and the Himalayan region, and it can also describe things related to their culture or language.","zh":"Bhutia 指锡金及喜马拉雅地区一个藏族起源的族群，也可作形容词表示与其文化或语言相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an ethnic group of Tibetan origin living mainly in Sikkim (India) and nearby Himalayan regions","zh":"不丹裔族群之一（藏族起源），主要居住在印度锡金及周边喜马拉雅地区的民族成员"},"examples":[{"en":"Many Bhutia families in Sikkim celebrate festivals that reflect Tibetan Buddhist traditions.","zh":"锡金的许多 Bhutia 家庭庆祝的节日带有藏传佛教传统色彩。"},{"en":"She interviewed Bhutia elders about local history and migration stories.","zh":"她采访了 Bhutia 的长者，了解当地历史与迁徙故事。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Bhutia people, their culture, or their language","zh":"与 Bhutia 民族、其文化或语言有关的；不丹裔（族群）的"},"examples":[{"en":"The museum has a small Bhutia textile collection.","zh":"那家博物馆有一小部分 Bhutia 纺织品收藏。"},{"en":"He is studying Bhutia music and dance as part of Himalayan culture.","zh":"他正在学习 Bhutia 的音乐与舞蹈，作为喜马拉雅文化的一部分。"}]}],"synonyms":["Sikkimese (in some contexts)","Tibetan-origin (descriptive)"],"phonetic":"/ˈbuːtiə/","extraExplanation":["“Bhutia”常见于关于锡金（Sikkim）与喜马拉雅地区的历史、民族与文化研究语境。写作时建议首字母大写（Bhutia），以表示族名/族群身份，语气更尊重、更规范。","在一些资料中，“Bhutia”也可能用来指与该族群相关的语言或方言，但具体名称与分类会因学术体系与地区用法而不同；如需更精确，可写成“the Bhutia language/variety spoken in Sikkim”等，并在首次出现时加注来源。"]}
{"word":"bhuts","summary":{"en":"“bhuts” is usually the plural of “bhut/bhoot,” meaning a ghost or spirit in South Asian folklore; it can also appear in names like “bhut pepper.”","zh":"“bhuts”通常是“bhut/bhoot”的复数，指南亚民俗中的鬼魂/幽灵；也可能出现在如“bhut pepper（魔鬼椒）”这类名称中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English) a ghost or spirit; an evil supernatural being in Indian folklore. Also spelled “bhoot.”","zh":"（南亚英语）鬼魂；（印度民俗中的）幽灵、恶灵。也常拼作 bhoot。"},"examples":[{"en":"Some villagers believe a bhoot lives near the old well.","zh":"有些村民相信老井附近住着一个“鬼”。"},{"en":"That horror movie is full of bhoots and curses.","zh":"那部恐怖片充满了鬼魂和诅咒。"}]},{"partOfSpeech":"adj.","definition":{"en":"In names (especially foods), “bhut” can refer to things from or associated with “Bhut Jolokia” (a very hot chili pepper), as in “bhut pepper.”","zh":"用于名称（尤其是食物）时，bhut 可指与“Bhut Jolokia（魔鬼椒/断魂椒）”相关的东西，如 bhut pepper（魔鬼椒）。"},"examples":[{"en":"This sauce uses bhut pepper, so it’s extremely spicy.","zh":"这款酱用了魔鬼椒，所以辣得很。"}]}],"synonyms":["ghost","spirit","apparition","specter"],"phonetic":"/buːt/","extraExplanation":["“bhut/bhoot”是从印地语等南亚语言进入英语的借词。在南亚语境里，它不只是“ghost”的直译，有时还带有“会作祟、可能伤害人”的民间想象。","你输入的“bhuts”更像是复数形式（bhuts/bhoots）。如果你想查的是别的词（例如 Bhutan 相关的 “Bhutanese”），也可以告诉我你看到它的句子。"]}
{"word":"Bhutto","summary":{"en":"Bhutto is a well-known Pakistani family name, strongly associated with national politics and leaders like Zulfikar Ali Bhutto and Benazir Bhutto.","zh":"Bhutto（布托）是巴基斯坦著名姓氏，常与国家政治及佐勒菲卡尔·阿里·布托、贝娜齐尔·布托等领导人联系在一起。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Pakistani family name best known for a major political dynasty, especially Zulfikar Ali Bhutto (former Prime Minister and President) and Benazir Bhutto (former Prime Minister).","zh":"巴基斯坦著名的家族姓氏，最知名的是一个重要的政治世家，代表人物包括佐勒菲卡尔·阿里·布托（前总理、前总统）和贝娜齐尔·布托（前总理）。"},"examples":[{"en":"Benazir Bhutto was one of the most well-known political leaders in Pakistan’s modern history.","zh":"贝娜齐尔·布托是巴基斯坦现代史上最知名的政治领袖之一。"},{"en":"The Bhutto family has had a long influence on Pakistani politics.","zh":"布托家族长期以来对巴基斯坦政治有重要影响。"}]}],"phonetic":"/ˈbuːtoʊ/","extraExplanation":["“Bhutto”是专有名词（姓氏），在英语新闻与历史写作中常直接用来指代“布托本人”或“布托家族/布托政治势力”（如：the Bhuttos）。","常见搭配：Bhutto family（布托家族）、Bhutto dynasty（布托政治王朝/政治世家）、Pakistan’s Bhutto legacy（布托在巴基斯坦的政治遗产）。","发音提示：英语里多读作“BOO-toe”，重音在第一个音节。"]}

