{"word":"BIA","summary":{"en":"BIA is an abbreviation most commonly meaning the U.S. Bureau of Indian Affairs; it can also mean “brought in alive” (slang) or the British Indian Army (historical).","zh":"BIA是一个缩写，最常见指美国“印第安事务局”；也可指俚语“活捉带回”，或历史上的“英属印度军”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(U.S.) Bureau of Indian Affairs: a federal agency that works with federally recognized Native American tribes and Alaska Native communities on government-to-government relations, land/trust issues, and services.","zh":"（美国）印第安事务局：美国联邦机构，与联邦承认的美洲原住民部落及阿拉斯加原住民社区合作，处理政府间关系、土地/信托事务及相关服务。"},"examples":[{"en":"The BIA manages certain trust lands and programs for tribes.","zh":"印第安事务局（BIA）管理一些信托土地，并为部落提供相关项目。"},{"en":"She applied for a job at the BIA in Arizona.","zh":"她在亚利桑那州申请了印第安事务局（BIA）的工作。"}]},{"partOfSpeech":"other","definition":{"en":"(Law enforcement/slang) brought in alive: used in police or bounty-hunter contexts to mean capturing someone without killing them.","zh":"（执法/俚语）活捉带回：用于警方或赏金猎人语境，指在不杀死对方的情况下将其抓获并带回。"},"examples":[{"en":"The order was to bring the suspect in BIA.","zh":"命令是把嫌疑人活捉带回（BIA）。"},{"en":"In the movie, the bounty hunter insists on BIA, not dead.","zh":"电影里，赏金猎人坚持要活捉带回（BIA），不要尸体。"}]},{"partOfSpeech":"other","definition":{"en":"(History) British Indian Army: the army of British India (mainly before 1947).","zh":"（历史）英属印度军：英属印度时期的军队（主要指1947年以前）。"},"examples":[{"en":"His grandfather served in the British Indian Army (BIA).","zh":"他的祖父曾在英属印度军（BIA）服役。"},{"en":"The museum has photos of BIA regiments from the early 1900s.","zh":"博物馆里有20世纪初英属印度军（BIA）团的照片。"}]}],"synonyms":["Bureau of Indian Affairs (full form)","capture alive (for the slang sense)"],"phonetic":"/bi aɪ eɪ/","extraExplanation":["“BIA”是缩写，含义高度依赖语境；写作中通常第一次出现要拼出全称（例如：Bureau of Indian Affairs），之后才用BIA。","口语里多按字母读作“B-I-A”（见音标），而不是读成一个单词。","“brought in alive”带有影视/黑色幽默色彩，正式场合建议避免使用或改用更中性的表达（例如：capture alive）。"]}
{"word":"Bia","summary":{"en":"“Bia” is most often a person’s name/nickname, but it can also mean Business Impact Analysis (BIA) or, in Irish, “food.”","zh":"“Bia”最常见是人名/昵称，也可能是缩写 BIA（业务影响分析），或在爱尔兰语中表示“食物”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name or nickname (often short for names like Bianca), used for a person.","zh":"人名或昵称（常作 Bianca 等名字的简称）。"},"examples":[{"en":"Bia is short for Bianca in our class.","zh":"在我们班里，Bia 是 Bianca 的简称。"},{"en":"I met Bia at the community center.","zh":"我在社区中心认识了 Bia。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Business Impact Analysis: a process used by organizations to identify which business functions are critical and what happens if they are disrupted.","zh":"（缩写）BIA：业务影响分析；组织用来判断哪些业务最关键，以及中断后会造成什么影响的分析流程。"},"examples":[{"en":"The IT team is doing a BIA to plan for emergencies.","zh":"IT 团队正在做 BIA，用于制定应急计划。"},{"en":"Our BIA showed customer support must be restored within two hours.","zh":"我们的 BIA 显示：客服必须在两小时内恢复。"}]},{"partOfSpeech":"other","definition":{"en":"a word found in some languages; for example, in Irish, bia means “food.”","zh":"在一些语言中出现的词；例如在爱尔兰语中，bia 的意思是“食物”。"},"examples":[{"en":"In Irish, “bia” means “food.”","zh":"在爱尔兰语里，“bia”意思是“食物”。"},{"en":"The sign used the Irish word bia on a restaurant menu.","zh":"餐厅菜单上用了爱尔兰语的 bia。"}]}],"synonyms":["Bianca (as a source name)","Business Impact Analysis (spelled out)"],"phonetic":"/ˈbiːə/","extraExplanation":["“Bia”在英文里不算常见词汇，更常见的是：①人名/昵称；②行业缩写（尤其在商业连续性、信息安全领域指 Business Impact Analysis）。如果你是在某个具体句子或场景里看到它，告诉我上下文，我可以帮你判断最准确的意思。"]}
{"word":"biabo","summary":{"en":"“Biabo” is not a recognized English word; it’s likely a typo or non-English slang/romanization.","zh":"“biabo”不是常见英语词；更可能是拼写错误或非英语的网络用语/音译。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling, a username, or a slang/romanization from another language. If you tell me the sentence or where you saw it, I can identify the intended word.","zh":"不是标准英语单词。更可能是拼写错误、用户名，或来自其他语言的网络用语/音译。你把它出现的句子或出处发我，我可以帮你判断想表达的词。"},"examples":[{"en":"I couldn’t find “biabo” in an English dictionary—could you share the full sentence?","zh":"我在英语词典里找不到“biabo”——你可以把完整句子发我吗？"},{"en":"Did you mean “bimbo,” “bravo,” or “Alibaba”?","zh":"你想写的是“bimbo”“bravo”还是“Alibaba”吗？"}]}],"phonetic":"/ˈbiːɑːboʊ/","extraExplanation":["“biabo”很像拼写输入时的误按（比如想打 bravo / bimbo / bialbo 之类），也可能是某种圈子里的昵称/ID。给我两点信息会更快定位：1）它出现在哪个平台/语境（聊天、游戏、短视频、歌词等）；2）前后各一句话。"]}
{"word":"biacanthous","summary":{"en":"Biacanthous means “having two spines or thorns,” usually in scientific descriptions.","zh":"Biacanthous 指“有两根刺/棘的”，多用于科学形态描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany/Zoology) Having two spines, thorns, or spine-like projections.","zh":"（植物/动物）有两根刺、两根棘，或有两个刺状突起的。"},"examples":[{"en":"The specimen was described as biacanthous, with two sharp spines near the base.","zh":"该标本被描述为 biacanthous，在基部附近有两根尖刺。"},{"en":"In the field notes, she recorded a biacanthous seed pod that snagged on clothing.","zh":"在野外记录中，她写下了一种 biacanthous 的种荚，会勾住衣物。"}]}],"synonyms":["two-spined","two-thorned","bispinous"],"phonetic":"/ˌbaɪəˈkænθəs/","extraExplanation":["这是一个非常少见、偏学术的形容词，常见于生物分类或形态描述中。","词源可拆解为 bi-（二、两个）+ acanth-（刺、棘；源自希腊语 akantha）+ -ous（……的），字面意思就是“有两根刺的”。","写作中更常用的替代表达有：two-spined / two-thorned（两刺的）。"]}
{"word":"biacetyl","summary":{"en":"Biacetyl is a buttery-smelling compound (diacetyl) used for flavoring and also produced during fermentation.","zh":"Biacetyl（双乙酰/diacetyl）是一种带黄油气味的化合物，可用于调味，也会在发酵中自然产生。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (also called diacetyl) that has a buttery smell and taste, used in some foods and produced naturally during fermentation.","zh":"一种化学物质（也叫 diacetyl / 双乙酰），带有黄油般的气味和味道；可用于某些食品调味，也会在发酵过程中自然产生。"},"examples":[{"en":"Some microwave popcorn flavors once used biacetyl to create a buttery taste.","zh":"一些微波爆米花口味曾使用 biacetyl 来制造黄油风味。"},{"en":"During fermentation, small amounts of biacetyl can appear and affect the drink’s aroma.","zh":"在发酵过程中，少量的 biacetyl 可能产生并影响饮品的香气。"}]}],"synonyms":["diacetyl","2,3-butanedione"],"phonetic":"/baɪˈæsɪtəl/","extraExplanation":["在食品与饮料领域，biacetyl 常被描述为“黄油味/奶油味”的来源之一；啤酒、葡萄酒等发酵品里也可能自然生成，过多时会被认为带有不理想的“黄油爆米花味”。","职业健康语境中，吸入大量含 biacetyl 的蒸气（例如某些工业香精环境）曾与严重肺部疾病风险相关，因此在工作场所与配方管理上会受到关注与限制。"]}
{"word":"biacetylene","summary":{"en":"Biacetylene is a chemical compound (C₄H₂) with two triple bonds, mainly discussed in chemistry and astrochemistry.","zh":"Biacetylene（双乙炔）是含两个三键的化合物（C₄H₂），主要出现在化学与天体化学语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a colorless, flammable chemical compound (C₄H₂) made of two connected acetylene groups; used mainly in chemistry research and sometimes discussed in astrochemistry.","zh":"（双乙炔）一种无色、易燃的化合物（C₄H₂），由两个乙炔基连接而成；主要用于化学研究，也常见于天体化学相关讨论。"},"examples":[{"en":"Biacetylene is an unsaturated hydrocarbon with two triple bonds.","zh":"双乙炔是一种不饱和烃，含有两个三键。"},{"en":"Scientists have detected biacetylene in the atmosphere of Titan.","zh":"科学家在土星卫星泰坦的大气中探测到了双乙炔。"}]}],"synonyms":["C4H2","diacetylene (common alternative name)"],"phonetic":"/ˌbaɪ.əˈsɛt.əˌliːn/","extraExplanation":["“bi-”表示“二、双”，“acetylene”是“乙炔”。因此 biacetylene 字面意思是“二聚的乙炔”。","结构常写作 HC≡C–C≡CH，含两个碳碳三键，因此反应性较高、易燃，通常在专业实验条件下处理。","在天体化学中，双乙炔常作为复杂有机分子形成链条中的一环出现（例如在低温、稀薄大气或星际介质的化学模型里）。"]}
{"word":"biacetyls","summary":{"en":"“Biacetyls” are buttery-smelling/tasting compounds (especially diacetyl) found or used in foods and fermentation.","zh":"“Biacetyls” 指带黄油气味与风味的化合物（尤指二乙酰），常见于食品与发酵产物中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of biacetyl: chemical compounds (especially diacetyl, 2,3-butanedione) known for a buttery smell and taste, used or found in foods and fermentation (e.g., beer, wine, dairy).","zh":"biacetyl 的复数：指一类化学物质（尤指二乙酰，2,3-丁二酮），带有明显的黄油般气味与风味，常见于食品添加或发酵产物（如啤酒、葡萄酒、乳制品）。"},"examples":[{"en":"Some lagers contain low levels of biacetyls that can create a buttery note.","zh":"有些拉格啤酒含有少量 biacetyls，会带来一点黄油风味。"},{"en":"The lab tested the flavoring for biacetyls before approval.","zh":"实验室在批准前检测了香精中是否含有 biacetyls。"},{"en":"During fermentation, yeast can produce biacetyls if the process is not well controlled.","zh":"如果发酵控制不好，酵母在发酵过程中可能会产生 biacetyls。"}]}],"synonyms":["diacetyl","2,3-butanedione","buttery flavor compounds"],"phonetic":"/ˌbaɪəˈsiːtəlz/","extraExplanation":["在食品与饮料语境中，biacetyl（常与 diacetyl 同指）是“黄油味/奶油味”的关键来源；在精酿啤酒品评里，过高的二乙酰通常被视为缺陷（会让人联想到融化黄油或奶油糖）。","职业健康方面，长期吸入含二乙酰的香精蒸汽（例如某些工厂环境）可能与呼吸道损伤风险相关，因此在工业场景中常强调通风与防护。"]}
{"word":"biacid","summary":{"en":"“Biacid” means “diprotic/dibasic”: an acid that can donate two protons.","zh":"“biacid”指“二质子/二元酸”：能释放两个H⁺的酸。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Having two acidic hydrogen ions to donate; diprotic (dibasic).","zh":"（化学）二元酸的；能提供两个可电离氢离子的；二质子的（=二元的、二碱性的）。"},"examples":[{"en":"Sulfuric acid is a biacid because it can donate two protons (H+).","zh":"硫酸是二元酸，因为它可以释放两个质子（H+）。"},{"en":"In water, a biacid may dissociate in two steps.","zh":"在水中，二元酸可能分两步电离。"}]}],"synonyms":["diprotic","dibasic","two-proton"],"phonetic":"/baɪˈæsɪd/","extraExplanation":["“biacid”多见于较旧或较少见的化学写法，更常用的是“diprotic acid（二质子酸）”或“dibasic acid（二元酸/二碱酸）”。","二元酸的典型例子有硫酸（H₂SO₄）和碳酸（H₂CO₃）。它们通常可以分两次失去H⁺，所以在酸碱滴定中可能出现两个当量点（视强弱与条件而定）。"]}
{"word":"biacromial","summary":{"en":"Biacromial means “across both shoulders,” especially the distance between the two acromion points.","zh":"biacromial 指“横跨双肩的”，尤指两侧肩峰之间的距离（双肩峰宽度）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the distance or measurement across both shoulders (from one acromion—the bony tip of the shoulder blade—to the other).","zh":"与“两肩之间的距离/测量”有关的；指从一侧肩峰（肩胛骨外侧的骨性突起）到另一侧肩峰的宽度。"},"examples":[{"en":"The doctor measured the patient’s biacromial width during the physical exam.","zh":"医生在体格检查时测量了患者的双肩峰宽度。"},{"en":"Biacromial breadth is often recorded in anthropometric studies.","zh":"在人体测量学研究中，双肩峰宽度常被记录。"}]}],"synonyms":["shoulder width","biacromial breadth","biacromial width"],"phonetic":"/ˌbaɪ.əˈkroʊ.mi.əl/","extraExplanation":["词源拆解：bi- 表示“两个/双”，acromial 来自 acromion（肩峰）。因此 biacromial 指“与两侧肩峰之间相关的”。","使用场景多见于医学、人体测量学（anthropometry）、人体工学与服装/护具尺寸设计等较正式语境；日常英语更常说 shoulder width（肩宽）。"]}
{"word":"biacuminate","summary":{"en":"Biacuminate describes a botanical shape with two long, tapering points.","zh":"biacuminate 指植物形态上末端具有两个细长渐尖的尖端（双渐尖）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having two long, narrow points that taper gradually to sharp tips (often used to describe the tip of a leaf or petal).","zh":"（植物学）具“双渐尖”的；末端分成两个细长尖端，并逐渐变尖（常用来形容叶片或花瓣的顶端形状）。"},"examples":[{"en":"The botanist noted that the leaf tip was biacuminate, ending in two slender points.","zh":"植物学家注意到叶尖呈双渐尖状，末端分成两条细尖。"},{"en":"Some varieties of this shrub have biacuminate petals that look slightly forked at the end.","zh":"这种灌木的某些品种花瓣末端呈双渐尖状，看起来像轻微分叉。"}]}],"synonyms":["two-pointed","double-acuminate","forked at the tip"],"phonetic":"/ˌbaɪ.əˈkjuː.mə.nət/","extraExplanation":["这是一个偏专业的形态学词汇，主要出现在植物分类、植物志、标本描述中，用来精确描述“叶尖/花瓣尖端的形状”。","词素上由 bi-（“两个”）+ acuminate（“渐尖的”）构成；与之相关的常见描述还有：acuminate（单渐尖）、bifid（浅裂成两瓣）、bilobed（两裂片/两叶状裂）。"]}
{"word":"biacuru","summary":{"en":"“biacuru” isn’t a recognized English word; it’s probably a name, a non-English term, or a misspelling.","zh":"“biacuru”不是公认的英语词；更可能是名字、外来词或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a proper name (person/place), a term from another language, or a misspelling.","zh":"不是标准英语词；更可能是专有名词（人名/地名）、其他语言的词，或拼写错误。"},"examples":[{"en":"I couldn’t find “biacuru” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里找不到“biacuru”，你能把它出现的句子发我吗？"},{"en":"If “biacuru” is a name, its meaning depends on the language and local usage.","zh":"如果“biacuru”是名字，它的含义取决于具体语言和当地用法。"}]}],"phonetic":"/biːəˈkʊruː/","extraExplanation":["“biacuru”在常见英语语料与词典中几乎没有稳定记录，因此我无法给出可靠的英语释义与词性。","它可能是：①专有名词（人名/地名/品牌名）；②来自葡萄牙语、西班牙语或某种原住民语言的词；③某个英语词的误拼。","你可以告诉我：它出现的上下文（整句/段落）、来源（书/歌曲/游戏/社交媒体/地图等）、以及你想表达的语境（描述人、地点、食物、动植物等）。我就能更准确判断并给出对应解释与近义表达。"]}
{"word":"Biadice","summary":{"en":"“Biadice” is not a standard English word; it is most likely a misspelling of the name “Beatrice.”","zh":"“Biadice”不是常见英文词；它很可能是人名 “Beatrice” 的拼写错误。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A likely misspelling of “Beatrice,” a female given name.","zh":"很可能是 “Beatrice” 的拼写错误；“Beatrice” 是一个女性名字。"},"examples":[{"en":"I think you meant Beatrice, not Biadice.","zh":"我觉得你想写的是 Beatrice，不是 Biadice。"},{"en":"Beatrice will join the meeting at 3 p.m.","zh":"Beatrice 会在下午三点参加会议。"}]},{"partOfSpeech":"n.","definition":{"en":"Beatrice (literary use): the idealized woman who guides Dante in The Divine Comedy (especially in Paradise).","zh":"（文学用法）Beatrice：但丁《神曲》中被理想化的女性形象，在作品后段（尤其《天堂篇》）引导但丁。"},"examples":[{"en":"In Dante’s poem, Beatrice represents guidance and divine love.","zh":"在但丁的诗作中，Beatrice 象征引导与神圣之爱。"}]}],"synonyms":["Beatrice"],"phonetic":"/ˈbiːətrɪs/","extraExplanation":["“Beatrice”在英语中常读作三音节（BEE-uh-triss）。如果你是想查一个英文单词而不是人名，请告诉我你看到它的句子或上下文，我也可以帮你确认是否为拼写或转写错误。","Beatrice 作为名字源自拉丁语词根，常被解释为“带来幸福/祝福的人”（在不同语言与传统里解释略有差异）。"]}
{"word":"Biafra","summary":{"en":"Biafra refers to a region in southeastern Nigeria and the former secessionist state involved in the Nigerian Civil War (1967–1970).","zh":"Biafra 指尼日利亚东南部地区，也指1967—1970年存在的分离主义国家“比夫拉”，与尼日利亚内战密切相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a region in southeastern Nigeria; also the name of the short-lived secessionist state (1967–1970) whose attempt to break away from Nigeria led to the Nigerian Civil War.","zh":"尼日利亚东南部的一个地区；也指1967—1970年短暂存在的分离主义国家“比夫拉”，其独立尝试引发了尼日利亚内战（尼日利亚内战/比夫拉战争）。"},"examples":[{"en":"Biafra declared independence from Nigeria in 1967.","zh":"比夫拉在1967年宣布从尼日利亚独立。"},{"en":"Many people learned about the humanitarian crisis through reports from Biafra.","zh":"许多人通过关于比夫拉的报道了解到那场人道主义危机。"},{"en":"The conflict is often discussed as the Nigerian Civil War, also called the Biafran War.","zh":"这场冲突常被称为“尼日利亚内战”，也叫“比夫拉战争”。"}]}],"synonyms":["the former Eastern Region of Nigeria (historical context)"],"phonetic":"/biˈæfrə/","extraExplanation":["“Biafra”常在历史、国际关系与人道主义语境中出现，尤其与1960年代末期的饥荒与救援行动相关。","英文里也常见派生词：Biafran（adj./n.）意为“比夫拉的；比夫拉人”。"]}
{"word":"Biafra-related","summary":{"en":"“Biafra-related” means connected to Biafra or to the Biafran War and its humanitarian history.","zh":"“Biafra-related”表示与比夫拉或比夫拉战争及其人道主义历史相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with Biafra (the former secessionist region in southeastern Nigeria) or with the Biafran War and its humanitarian crisis.","zh":"与比夫拉（尼日利亚东南部曾经的分离地区）有关的；与比夫拉战争及其人道主义危机有关的。"},"examples":[{"en":"The museum opened an exhibit of Biafra-related photographs from the late 1960s.","zh":"博物馆开设了一个展览，展示20世纪60年代末与比夫拉有关的照片。"},{"en":"Her thesis analyzes Biafra-related news reports and how they shaped international public opinion.","zh":"她的论文分析与比夫拉有关的新闻报道，以及这些报道如何影响国际舆论。"},{"en":"The charity’s archives include Biafra-related documents about famine relief.","zh":"该慈善机构的档案包含与比夫拉有关的饥荒救援文件。"}]}],"synonyms":["Biafran (in some contexts)","connected to Biafra","linked to the Biafran War"],"phonetic":"/biˈæfrə rɪˌleɪtɪd/","extraExplanation":["“Biafra-related”常用于历史、政治、媒体研究与人道主义语境，尤其指1967—1970年的尼日利亚内战（常称“比夫拉战争”）及当时广为报道的饥荒与救援行动。","在写作中，它通常用于修饰名词：Biafra-related conflict/reports/images/aid 等。若强调“来自比夫拉的人/事物”，更常用“Biafran”（如 Biafran leaders）。"]}
{"word":"Biafran","summary":{"en":"Biafran means “related to Biafra” or “a person from Biafra,” often used in historical discussions of the Nigerian Civil War (1967–1970).","zh":"Biafran 指“与比夫拉有关的”或“比夫拉人”，常见于关于1967–1970年尼日利亚内战的历史语境中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Biafra (a former secessionist region/state in southeastern Nigeria) or to its people, culture, or history.","zh":"（形容词）与比夫拉（尼日利亚东南部曾经的分离地区/政权）或其人民、文化、历史有关的。"},"examples":[{"en":"The documentary includes Biafran voices from the civil war period.","zh":"这部纪录片收录了内战时期比夫拉人的声音。"},{"en":"Some museums preserve Biafran relief posters from the late 1960s.","zh":"一些博物馆保存着20世纪60年代末的比夫拉救援海报。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Biafra, or someone who identifies with Biafra (especially in historical or political contexts).","zh":"（名词）比夫拉人；（尤其在历史或政治语境中）认同比夫拉的人。"},"examples":[{"en":"He interviewed a Biafran who survived the blockade as a child.","zh":"他采访了一位童年时在封锁中幸存的比夫拉人。"},{"en":"The novel follows a Biafran family during the conflict.","zh":"这部小说讲述了冲突时期一个比夫拉家庭的经历。"}]}],"synonyms":["Biafra-related","Igbo (context-dependent)"],"phonetic":"/biˈæfrən/","extraExplanation":["“Biafran”常与“Biafran War / Nigerian Civil War（尼日利亚内战，1967–1970）”相关。比夫拉曾宣布从尼日利亚独立，战争与封锁引发严重饥荒，因此在英语媒体与历史叙述中，“Biafran”有时会让人联想到人道主义危机与救援行动。","使用时注意语境与敏感性：它既可能是中性地指历史/地域身份，也可能触及族群与政治立场（例如与伊博族相关的讨论）。在当代新闻或学术写作中，常会补充说明具体指“战争时期的比夫拉”还是“当代的分离主义诉求”。"]}
{"word":"Biagi","summary":{"en":"Biagi is most often an Italian surname; less commonly it can be used as a given name.","zh":"Biagi 通常是意大利姓氏；较少情况下也可用作名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), most commonly Italian in origin","zh":"一个姓氏（家族姓），最常见于意大利语背景"},"examples":[{"en":"Ms. Biagi will lead the meeting today.","zh":"Biagi 女士今天将主持会议。"},{"en":"I met Dr. Biagi at the conference.","zh":"我在会议上见到了 Biagi 博士。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name in some families (less common)","zh":"（较少见）也可用作名字"},"examples":[{"en":"Biagi is his middle name, taken from his grandfather.","zh":"Biagi 是他的中间名，来自他祖父的名字。"}]}],"phonetic":"/biˈɑːdʒi/","extraExplanation":["“Biagi”常见为意大利姓氏。意大利语里字母 g 在 i/e 前常读作 /dʒ/（类似英文的 j 音），所以很多人会把 Biagi 读成“bee-AH-jee”。不同家庭/地区的读法可能略有差异，正式场合可以礼貌地询问对方偏好的读音。","作为专有名词（人名/姓氏）时，英语写作通常首字母大写：Biagi。"]}
{"word":"Biagio","summary":{"en":"Biagio is an Italian male first name, equivalent to Blaise.","zh":"Biagio 是意大利男性名字，相当于 Blaise（布莱兹）的意大利形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an Italian masculine given name (the Italian form of “Blaise”)","zh":"一个意大利男性名字（相当于英语名 “Blaise/布莱兹” 的意大利形式）"},"examples":[{"en":"Biagio is a common first name in parts of Italy.","zh":"Biagio 在意大利一些地区是比较常见的名字。"},{"en":"My colleague Biagio speaks both Italian and English.","zh":"我的同事 Biagio 会说意大利语和英语。"}]}],"phonetic":"/biˈɑːdʒioʊ/","extraExplanation":["“Biagio”源自拉丁语名“Blasius”（英语常见对应名为 Blaise）。在意大利语中常读作三音节，末尾的 -gio 发 /dʒoʊ/ 类似英文 “Joe” 里 j 的音。","文化上与圣人“圣布莱斯/圣卜拉削（Saint Blaise）”有关：在天主教传统中他是喉咙病患的守护圣人，因此在一些地区这个名字带有宗教与传统色彩。"]}
{"word":"biais","summary":{"en":"Bias means an unfair preference (prejudice) or a systematic leaning/error; as a verb, it means to influence unfairly.","zh":"bias 指偏见/偏向，也可指研究中的系统性偏差；作动词表示使（人或结果）不公平地偏向某一方。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tendency to prefer one person, group, idea, or outcome over another, often in an unfair way; prejudice.","zh":"偏见；偏向（常带不公平意味）。"},"examples":[{"en":"The hiring decision showed bias against older workers.","zh":"这次招聘决定显示出对年长求职者的偏见。"},{"en":"Try to read different sources to reduce your political bias.","zh":"尽量阅读不同来源，以减少你的政治偏向。"}]},{"partOfSpeech":"n.","definition":{"en":"(Statistics/Research) A systematic error that makes results lean in one direction rather than being accurate.","zh":"（统计/研究）系统性偏差，使结果倾向某一方向而不准确。"},"examples":[{"en":"Online surveys can have selection bias because not everyone uses the internet equally.","zh":"线上调查可能有选择偏差，因为不是每个人都同样使用互联网。"},{"en":"The experiment was redesigned to avoid bias in the measurements.","zh":"实验被重新设计，以避免测量上的系统性偏差。"}]},{"partOfSpeech":"vt.","definition":{"en":"To influence someone or something so that they unfairly lean toward a particular choice or viewpoint.","zh":"使偏向；影响（使其不公平地倾向某一方）。"},"examples":[{"en":"The headlines biased readers against the defendant.","zh":"这些标题让读者对被告产生不利的倾向。"},{"en":"Don’t let one bad experience bias your judgment.","zh":"不要让一次糟糕的经历影响你的判断。"}]}],"synonyms":["prejudice","partiality","favoritism","inclination","slant","skew"],"phonetic":"/ˈbaɪəs/","extraExplanation":["“biais”是法语，常对应英语“bias”。如果你是在英语语境里看到“biais”，多半是拼写/语言混用，英语标准拼写是“bias”。","在日常英语里，bias常与“unconscious bias（无意识偏见）”“media bias（媒体偏向）”连用；在学术/数据领域，bias更偏向“系统性偏差”，区别于随机误差（random error）。","常见搭配：bias against（对……有偏见）；bias toward(s)（偏向……）；be biased（有偏见的）。形容词是“biased”。"]}
{"word":"biajaiba","summary":{"en":"“biajaiba” is not recognized as a standard English word; it’s likely a typo or a name.","zh":"“biajaiba”不是标准英语单词，更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username, a brand/name, or a word from another language written in Latin letters.","zh":"不是标准英语单词。可能是拼写错误、用户名、品牌/人名，或是其他语言的拉丁字母拼写。"},"examples":[{"en":"I couldn’t find “biajaiba” in an English dictionary—did you mean a different spelling?","zh":"我在英语词典里找不到“biajaiba”——你是不是想写另一个拼法？"},{"en":"If you tell me the sentence where you saw it, I can guess the intended word.","zh":"如果你把它出现的句子发给我，我可以帮你推测原本想表达的词。"}]}],"phonetic":"/ˌbiːɑːˈdʒaɪbə/","extraExplanation":["我猜“biajaiba”可能是：\n1）英文单词的拼写误差（比如你听到的发音写出来了）；\n2）某种拼音/外来语的转写；\n3）人名、网名或品牌名。\n\n你可以把以下信息发我，我就能更准确解释：\n- 你在哪里看到/听到的？\n- 原句或上下文（前后各一两句）\n- 你想表达的中文意思（如果有）\n- 是否是人名/地名/游戏或社交平台用户名"]}
{"word":"Biak","summary":{"en":"Biak is usually a proper noun: an island/region in Papua, Indonesia, and also the name of a local language (Biak).","zh":"Biak通常是专有名词：指印尼巴布亚的比亚克岛/地区，也可指当地的比亚克语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Biak: an island and a town/area in Papua (Indonesia), best known for Biak Island in Cenderawasih Bay.","zh":"比亚克：印度尼西亚巴布亚省的一个岛屿及其同名城镇/地区，通常指仙德拉瓦西湾的比亚克岛。"},"examples":[{"en":"Biak Island is part of Indonesia’s Papua region.","zh":"比亚克岛属于印度尼西亚的巴布亚地区。"},{"en":"She flew through Biak on her way to eastern Indonesia.","zh":"她前往印尼东部途中在比亚克转机。"}]},{"partOfSpeech":"n.","definition":{"en":"Biak (or Biak language): an Austronesian language spoken by the Biak people in Papua, Indonesia.","zh":"比亚克语：一种南岛语系语言，由印尼巴布亚的比亚克族人使用。"},"examples":[{"en":"Some local families speak Biak at home and Indonesian at school.","zh":"一些当地家庭在家讲比亚克语，在学校讲印尼语。"},{"en":"He is learning Biak to communicate with his grandparents.","zh":"他在学比亚克语，好和祖父母交流。"}]}],"synonyms":["Biak Island","Biak Numfor","the Biak language"],"phonetic":"/ˈbiːæk/","extraExplanation":["“Biak”在英语里多为专有名词（地名/族名/语言名），通常不作普通词使用。","比亚克岛在二战太平洋战场中具有历史意义：1944年盟军在此作战并建立机场，因此在历史书与纪录片中常会看到“Battle of Biak（比亚克战役）”等说法。","拼写提示：首字母常大写（Biak）。如果指语言，有时会写作“the Biak language”。"]}
{"word":"bialate","summary":{"en":"“Bialate” is not a standard English word; it’s likely a misspelling (often of “belated” or “bilateral”).","zh":"“bialate”不是标准英语单词；很可能是拼写错误（常见是把“belated”或“bilateral”写错）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a mistaken form of another word (common possibilities: “belated,” “bilateral,” or “bile duct/bile”).","zh":"不是标准英语单词。很可能是拼写错误或把其他词写错了（常见可能是：belated“迟到的/来晚的”，bilateral“两边的/双边的”，或与 bile“胆汁”相关的词）。"},"examples":[{"en":"I can’t find “bialate” in a dictionary—did you mean “belated”?","zh":"我在词典里找不到“bialate”——你是不是想写“belated（迟到的/来晚的）”？"}]}],"phonetic":"/ˈbaɪəleɪt/","extraExplanation":["“bialate”在常用英语词典中通常查不到。如果你能提供一句完整的英文原句（或说明它出现在医学/化学/法律等哪个领域），我可以更准确地判断你要找的词。\n\n你可能想写的词：\n1) belated /bɪˈleɪtɪd/：来晚的；迟来的（belated apology 迟来的道歉）\n2) bilateral /ˌbaɪˈlætərəl/：双边的；两侧的（bilateral agreement 双边协议）\n3) bialy /ˈbaɪəli/：一种犹太面包（如果你指食物）"]}
{"word":"biali","summary":{"en":"A bialy is a small Polish-style bread, similar to a bagel but usually not boiled, often topped with onion.","zh":"bialy（比亚利面包）是一种波兰风味小圆面包，类似百吉饼但通常不水煮，常撒洋葱等配料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, round Polish-style bread (similar to a bagel but usually not boiled) with a depression in the center, often topped with onion and poppy seeds","zh":"一种波兰风味的小圆面包（像百吉饼但通常不经过水煮），中间有凹陷，常撒洋葱和罂粟籽"},"examples":[{"en":"I grabbed a bialy with onions for breakfast.","zh":"我早餐买了一个撒洋葱的比亚利面包。"},{"en":"A bialy is chewier than regular rolls but softer than a bagel.","zh":"比亚利面包比普通餐包更有嚼劲，但比百吉饼更软一些。"}]}],"synonyms":["roll","bagel (similar)"],"phonetic":"/ˈbiːəli/","extraExplanation":["“bialy”来自意第绪语，原指波兰城市Białystok（比亚韦斯托克）的面包。它在美国（尤其纽约的犹太熟食店/面包店文化中）也很常见。","常见搭配：toasted bialy（烤过的比亚利）、onion bialy（洋葱比亚利）、with cream cheese（配奶油奶酪）。","注意拼写：你写的“biali”更常见是人名/姓氏拼法；指面包通常写作“bialy”。"]}
{"word":"Bialik","summary":{"en":"Bialik usually refers to Hayim Nahman Bialik, a foundational modern Hebrew poet; it can also be a surname and a name used for places or institutions.","zh":"Bialik 通常指现代希伯来文学的重要诗人哈伊姆·纳赫曼·比亚利克；也可作为姓氏，并用于地名或机构名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Hayim Nahman Bialik (1873–1934), a major Hebrew poet and essayist, often called Israel’s “national poet.”","zh":"哈伊姆·纳赫曼·比亚利克（1873–1934），重要的希伯来语诗人、散文家，常被称为以色列的“民族诗人”。"},"examples":[{"en":"Bialik’s poems are widely studied in modern Hebrew literature classes.","zh":"比亚利克的诗歌在现代希伯来文学课程中被广泛学习。"},{"en":"The library has an English translation of Bialik’s selected poems.","zh":"图书馆里有一本比亚利克诗选的英文译本。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname used by people or places named after Bialik (for example, institutions, streets, or neighborhoods).","zh":"姓氏；也可指以“比亚利克”命名的人或地点（如机构、街道或社区名称）。"},"examples":[{"en":"They live near Bialik Street.","zh":"他们住在比亚利克街附近。"},{"en":"The event was held at the Bialik Center.","zh":"活动在比亚利克中心举行。"}]}],"synonyms":["Hayim Nahman Bialik"],"phonetic":"/biˈɑːlɪk/","extraExplanation":["比亚利克在现代希伯来语复兴与犹太文化现代化中影响很大。他的作品常结合传统宗教文本的语感与现代民族意识，因此在以色列与犹太社群中具有象征意义。","英语语境里你可能会看到他的名字出现在“Bialik Prize（比亚利克奖）”“Bialik Street（比亚利克街）”等专有名词中。"]}
{"word":"bialis","summary":{"en":"A bialy is a chewy Jewish-style roll like a bagel, usually with a dimpled center topped with onions or poppy seeds.","zh":"Bialy 是一种类似贝果但通常不水煮的犹太风味小面包，中间有凹陷，常配洋葱或罂粟籽。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, chewy roll from Jewish (especially Polish-Jewish) baking, similar to a bagel but usually not boiled and with a depression in the center often filled with onions or poppy seeds","zh":"一种犹太（尤其是波兰犹太）传统小面包，口感有嚼劲，外形类似贝果但通常不先水煮；中间常有凹陷并放洋葱或罂粟籽等馅料"},"examples":[{"en":"I ordered a bialy with onions for breakfast.","zh":"我早餐点了一个洋葱口味的 bialy。"},{"en":"A bialy is flatter than a bagel and has a dimple in the middle.","zh":"Bialy 比贝果更扁，中间有个小凹坑。"}]}],"synonyms":["onion roll (similar)"],"phonetic":"/ˈbiɑli/","extraExplanation":["“bialy”来自波兰语“biał y”（意为“白色的”），与波兰城市 Białystok（比亚韦斯托克）有关；在美国（尤其纽约）常见于犹太烘焙店。","你输入的“bialis”很可能是复数形式（更常写作“bialys”）；单数是“bialy”。"]}
{"word":"biallyl","summary":{"en":"“Biallyl” is a rare chemistry term meaning “containing two allyl groups,” similar to “diallyl.”","zh":"“biallyl”是较少见的化学用语，意思是“含有两个烯丙基”，与更常见的“diallyl（双烯丙基）”含义接近。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Having two allyl groups (–CH2–CH=CH2) in a molecule; often used similarly to the more common term “diallyl.”","zh":"（化学）指分子中含有两个烯丙基（–CH2–CH=CH2）的；常与更常见的术语“diallyl（双烯丙基）”近似使用。"},"examples":[{"en":"Biallyl compounds can be used to make polymers after they react to form cross-links.","zh":"含双烯丙基的化合物在发生反应形成交联后，可用于制备聚合物。"},{"en":"The paper compared a biallyl monomer with other unsaturated monomers.","zh":"该论文将一种双烯丙基单体与其他不饱和单体进行了比较。"}]},{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A compound that contains two allyl groups.","zh":"（化学）含有两个烯丙基的化合物。"},"examples":[{"en":"The synthesis produced a biallyl as an intermediate.","zh":"该合成反应生成了一种含双烯丙基的中间体。"}]}],"synonyms":["diallyl","bis(allyl)"],"phonetic":"/baɪˈæl.aɪl/","extraExplanation":["“biallyl”在一般英语中很少见，化学文献里更常用的是“diallyl”（例如：diallyl ether, diallyl phthalate）。如果你是在查单词或做作业，可能是拼写误差；你可以告诉我原句或你想表达的领域（化学/材料/有机合成），我可以帮你确认最合适的词。","“allyl”的读音类似于“AL-eye-l”，而“bi-”表示“两个”。因此“biallyl”字面意思就是“有两个烯丙基”。"]}
{"word":"bialveolar","summary":{"en":"Bialveolar means involving both the upper and lower alveolar ridges, often describing protrusion in both jaws in orthodontics.","zh":"Bialveolar 指与上下牙槽都相关，正畸中常用于描述上下颌牙槽部位同时前突。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy/Orthodontics) Relating to both the upper and lower alveolar ridges (the bone that holds the teeth), especially describing forward positioning or protrusion in both jaws.","zh":"（解剖/正畸）与上下牙槽（承托牙齿的牙槽骨）都有关的；常用于描述上下颌牙槽部位都向前突出（如“双牙槽前突”）。"},"examples":[{"en":"The orthodontist noted bialveolar protrusion and discussed treatment options.","zh":"正畸医生指出存在双牙槽前突，并讨论了治疗方案。"},{"en":"Bialveolar changes can affect lip posture and facial profile.","zh":"双牙槽部位的变化会影响嘴唇姿态和面部侧貌。"}]}],"synonyms":["bimaxillary (in some orthodontic contexts)","related to both alveolar ridges"],"phonetic":"/ˌbaɪælˈviələr/","extraExplanation":["这个词在日常英语中很少见，更多出现在正畸/口腔医学语境里，常与“protrusion（前突）”“bimaxillary（上下颌的）”等词一起出现。常见相关表达：bialveolar protrusion（双牙槽前突）。","词形拆解：bi-（两者/双）+ alveolar（牙槽的）。alveolar ridge 指牙齿所在的牙槽骨脊。"]}
{"word":"bialy","summary":{"en":"A bialy is a small Polish-Jewish roll, similar to a bagel but usually without a hole, often topped with onion or poppy seeds.","zh":"bialy 是一种波兰犹太风味的小圆面包，类似贝果但通常没有中间的洞，常见配料是洋葱或罂粟籽。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, chewy Polish-Jewish roll (similar to a bagel but usually without a hole), traditionally baked with a depression in the center filled with onion and/or poppy seeds","zh":"一种波兰犹太风味的小圆面包（类似贝果但通常没有中间的洞），传统做法是在中心压出凹陷并放入洋葱和/或罂粟籽后烘烤"},"examples":[{"en":"I ordered a bialy with onions for breakfast instead of a bagel.","zh":"我早餐点了一个洋葱口味的比亚利面包，没有点贝果。"},{"en":"Warm the bialy and spread cream cheese on top.","zh":"把比亚利面包加热后，在上面抹奶油奶酪。"},{"en":"This bakery makes fresh bialys every morning.","zh":"这家面包店每天早上都会做新鲜的比亚利面包。"}]}],"synonyms":["bagel (similar, not identical)","roll"],"phonetic":"/ˈbiːəli/","extraExplanation":["“bialy”来自波兰语城市名“Białystok（比亚韦斯托克）”，常被认为是这种面包的发源地。","在纽约等地的犹太熟食店（deli）文化中，bialy 很常见；它通常不需要像贝果那样水煮（boil），口感更像烤制的面包，中心常有洋葱香。","拼写上有时也会见到“bialy/bialys”（复数）这种用法。"]}
{"word":"bialys","summary":{"en":"Bialys are small chewy rolls, usually topped with onion; it’s the plural of bialy.","zh":"Bialys 指 bialy 的复数：一种小而有嚼劲、常在表面铺洋葱的圆面包卷。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of bialy: a small, chewy bread roll (similar to a bagel but usually without a hole), traditionally topped with onion and sometimes poppy seeds.","zh":"bialy 的复数：一种小而有嚼劲的圆面包卷（类似百吉饼，但通常没有中间的洞），传统上会在表面放洋葱（有时还会加罂粟籽）。"},"examples":[{"en":"I picked up two bialys for breakfast—one onion and one plain.","zh":"我买了两个 bialys 当早餐——一个洋葱口味，一个原味。"},{"en":"The café serves warm bialys with cream cheese.","zh":"那家咖啡馆会供应热的 bialys，配奶油奶酪。"}]}],"synonyms":["onion roll","bagel (similar, not the same)"],"phonetic":"/ˈbiːəliz/","extraExplanation":["“Bialy”源自东欧犹太饮食文化，名字与波兰城市 Białystok（比亚韦斯托克）有关。在美国（尤其纽约）常见；与 bagel 不同，bialy 通常不水煮，中心是凹陷而不是穿孔，并常铺洋葱馅。"]}
{"word":"Bialystok","summary":{"en":"Bialystok is a city in northeastern Poland and the capital of the Podlaskie region.","zh":"Bialystok（比亚韦斯托克）是波兰东北部城市，也是波德拉谢地区的首府。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in northeastern Poland; the capital of the Podlaskie Voivodeship (province).","zh":"波兰东北部城市，比亚韦斯托克；波德拉谢省（省级行政区）的首府。"},"examples":[{"en":"Bialystok is one of the largest cities in northeastern Poland.","zh":"比亚韦斯托克是波兰东北部最大的城市之一。"},{"en":"She took a train from Warsaw to Bialystok for a weekend trip.","zh":"她从华沙坐火车去比亚韦斯托克度周末。"}]}],"synonyms":["Białystok"],"phonetic":"/bjɑːˈlɪstɑːk/","extraExplanation":["“Bialystok”常见于英文不带波兰语变音符号的写法；波兰语原拼写是“Białystok”（其中“ł”读音接近英语的 /w/ 或较弱的 /l/ 变体），所以英文发音和原语发音可能有差异。","这座城市历史上有多元族群与语言背景；世界语（Esperanto）的创始人柴门霍夫（L. L. Zamenhof）出生于此，因此在语言文化史上常被提及。"]}
{"word":"bialystoker","summary":{"en":"A Bialystoker is a person from the Polish city of Białystok.","zh":"Bialystoker 指来自波兰城市比亚韦斯托克（Białystok）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Białystok (a city in northeastern Poland); a native or resident of Białystok","zh":"来自波兰东北部城市比亚韦斯托克（Białystok）的人；比亚韦斯托克的居民或本地人"},"examples":[{"en":"Her grandparents were Bialystokers who later emigrated to the United States.","zh":"她的祖父母来自比亚韦斯托克，后来移民到了美国。"},{"en":"The museum exhibit includes stories from Bialystokers before World War II.","zh":"博物馆展览收录了二战前比亚韦斯托克居民的故事。"}]}],"synonyms":["Białystok native","Białystok resident"],"phonetic":"/biˈɑːlɪstɔːkər/","extraExplanation":["“Bialystoker”在英语里常见于历史与移民语境，尤其指19—20世纪初从比亚韦斯托克来到美国（很多是犹太移民）的人群与其社群组织。","纽约曼哈顿下东城有著名的“The Bialystoker Synagogue（比亚韦斯托克会堂）”，名称就来自当地移民建立的会众/社团。","拼写来自波兰地名 Białystok（含波兰语字母 ł）。英语里常写作 Bialystok；对应的“来自该地的人”用 -er 构成：Bialystoker。"]}
{"word":"Biamonte","summary":{"en":"Biamonte is a surname, likely Italian in origin.","zh":"Biamonte 是一个姓氏，多见为意大利来源。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), most likely of Italian origin.","zh":"一个姓氏（家族姓），多见为意大利来源。"},"examples":[{"en":"Dr. Biamonte will see you now.","zh":"Biamonte 医生现在会见你。"},{"en":"The author, Maria Biamonte, writes about Italian-American communities.","zh":"作者 Maria Biamonte 写作主题涉及意大利裔美国人社群。"}]}],"synonyms":["(none)"],"phonetic":"/biəˈmoʊnti/","extraExplanation":["“Biamonte”通常被用作姓氏（专有名词），在英语里需要首字母大写。","从拼写与构词看，它很像意大利姓氏；在英语语境中一般不翻译，只做音译或直接保留原拼写。","发音上，英语使用者常按音节读作“bee-uh-MOHN-tee”（重音多落在第二或第三音节附近）；具体到个人可能会有家族习惯读法。"]}
{"word":"Bianca","summary":{"en":"Bianca is a female first name, originally Italian, and it is also used as a character name in literature (notably Shakespeare).","zh":"Bianca 是一个源自意大利语的女性名字；在文学中也常作人物名（尤其见于莎士比亚戏剧）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (a first name), common in English-speaking countries and originally from Italian.","zh":"（女子）名字；女性名（源自意大利语，也常见于英语国家）。"},"examples":[{"en":"Bianca is starting a new job on Monday.","zh":"Bianca 周一开始一份新工作。"},{"en":"I met a girl named Bianca at the library.","zh":"我在图书馆认识了一个叫 Bianca 的女孩。"}]},{"partOfSpeech":"n.","definition":{"en":"a character name in literature, especially Bianca in Shakespeare’s plays (for example, in *The Taming of the Shrew*).","zh":"文学作品中的人物名，尤其指莎士比亚戏剧中的 Bianca（如《驯悍记》）。"},"examples":[{"en":"In *The Taming of the Shrew*, Bianca is known for being desired by several suitors.","zh":"在《驯悍记》中，Bianca 因为有好几位追求者而备受关注。"},{"en":"Our class read a scene where Bianca speaks with her sister.","zh":"我们班读了一段 Bianca 和她姐姐对话的场景。"}]}],"synonyms":["Blanca (related name)"],"phonetic":"/biˈæŋkə/","extraExplanation":["“Bianca”源自意大利语，和“bianco（白色的）”同源，传统含义常被理解为“白/纯净/明亮”。在西班牙语中相近的名字是“Blanca”。","在英语语境里，它主要作为专有名词使用（人名/角色名），通常不翻译；中文常见音译为“比安卡/比昂卡”。"]}
{"word":"bianca","summary":{"en":"Bianca is mainly a female first name; it’s also used for well-known characters in Shakespeare.","zh":"Bianca 主要是女性名字；也常指莎士比亚作品中著名的同名角色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (first name), used in English and many other languages","zh":"女性名字（名），英语及许多语言中常用"},"examples":[{"en":"Bianca is my sister’s name.","zh":"Bianca 是我妹妹的名字。"},{"en":"Our new classmate, Bianca, is from Italy.","zh":"我们新来的同学 Bianca 来自意大利。"}]},{"partOfSpeech":"n.","definition":{"en":"a character name in literature and drama, especially Bianca in Shakespeare’s plays","zh":"文学与戏剧中的角色名，尤指莎士比亚戏剧中的 Bianca"},"examples":[{"en":"Bianca appears in Shakespeare’s The Taming of the Shrew.","zh":"Bianca 出现在莎士比亚的《驯悍记》中。"},{"en":"In Othello, Bianca is a minor character connected to Cassio.","zh":"在《奥赛罗》中，Bianca 是与卡西奥有关的次要角色。"}]}],"synonyms":["(as a name) none; related names: Blanche, Blanca"],"phonetic":"/biˈæŋkə/","extraExplanation":["“Bianca”源自意大利语，意思与“白色、洁白（white）”有关，因此在文化联想上常带有“纯净、明亮”的感觉。","在英语语境里它多作为专有名词（人名）使用；写作时首字母通常大写：Bianca。","文学中最常被提到的是《驯悍记》里的 Bianca（凯瑟琳的妹妹），以及《奥赛罗》里的 Bianca。了解这些引用有助于读懂英文文章中的文化暗示。"]}
{"word":"Biancha","summary":{"en":"Biancha is a Chinese loanword meaning “border tea,” traditionally made in southwest China and traded to border regions, often as compressed brick tea.","zh":"Biancha 是汉语借词，指“边茶/边销茶”：传统上产于中国西南并销往边疆地区的茶，常见为紧压砖茶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Chinese) a type of Chinese “border tea,” traditionally produced in southwestern China and traded to border regions; often compressed (brick tea) and used especially in Tibetan areas.","zh":"（源自中文）“边茶”：中国传统的“边销茶/边境贸易茶”，多产于中国西南地区，历史上销往边疆地区；常见为紧压茶（如砖茶），在藏区等地尤为常用。"},"examples":[{"en":"Historically, biancha was traded along routes linking Sichuan and Tibet.","zh":"历史上，边茶常沿着连接四川与西藏的路线进行贸易。"},{"en":"In some regions, people boil biancha with milk and salt to make a daily drink.","zh":"在一些地区，人们会把边茶与牛奶和盐一起煮，作为日常饮品。"}]}],"synonyms":["border tea","brick tea (often related, but not identical)"],"phonetic":"/biˈɑːn.tʃɑː/","extraExplanation":["“边茶（biancha）”在英文资料里多作为汉语借词出现，常见于茶史、民族地区饮食文化、以及“茶马古道（Tea Horse Road）”相关叙述中。不同产区与工艺会带来不同风味与形态（如砖、饼等紧压形态）。如果你是在英文写作中使用，常见写法是 *biancha (border tea)*，第一次出现时加一个英文解释更清楚。"]}
{"word":"Bianchi","summary":{"en":"Bianchi is an Italian surname and also a famous Italian bicycle brand.","zh":"Bianchi 既是意大利姓氏，也是一家著名的意大利自行车品牌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an Italian surname (family name).","zh":"比安基：一个意大利姓氏（家族名）。"},"examples":[{"en":"Ms. Bianchi is our new Italian teacher.","zh":"比安基老师是我们新来的意大利语老师。"},{"en":"I read an article by Dr. Bianchi.","zh":"我读了一篇比安基博士写的文章。"}]},{"partOfSpeech":"n.","definition":{"en":"a well-known Italian bicycle brand (Bianchi), famous in road cycling.","zh":"（品牌）比安基：意大利著名自行车品牌，以公路自行车和骑行文化闻名。"},"examples":[{"en":"He rides a Bianchi road bike to work.","zh":"他骑一辆比安基公路车去上班。"},{"en":"Bianchi is popular with cycling fans.","zh":"比安基在骑行爱好者中很受欢迎。"}]}],"synonyms":["(surname)","(brand name: bicycle)"],"phonetic":"/biˈɑːnki/","extraExplanation":["“Bianchi”是意大利语姓氏，常见含义来自白色（bianco）的词根，因此有“白色的/白的”这一历史来源。","读音上，-chi- 通常发 /ki/（类似“kee”），所以常读作 /biˈɑːnki/。","在骑行文化里，“Bianchi”常让人联想到其标志性的车架颜色“celeste（浅蓝绿）”。"]}
{"word":"bianchi","summary":{"en":"Bianchi is usually a proper noun: a famous Italian bicycle brand; it can also be an Italian surname.","zh":"Bianchi通常是专有名词：著名的意大利自行车品牌；也可以是意大利姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) An Italian brand/company best known for making bicycles (especially road bikes), famous for its signature pale green color often called “Celeste.”","zh":"（专有名词）意大利的自行车品牌/公司，以生产公路车等闻名；其标志性的浅绿色常被称为“Celeste（天青绿）”。"},"examples":[{"en":"He rides a Bianchi road bike to work every day.","zh":"他每天骑一辆Bianchi公路车去上班。"},{"en":"Bianchi is famous in cycling culture, especially for its Celeste color.","zh":"Bianchi在骑行文化中很有名，尤其以“天青绿”著称。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper noun) An Italian surname.","zh":"（专有名词）意大利姓氏。"},"examples":[{"en":"Ms. Bianchi will lead the meeting this afternoon.","zh":"Bianchi女士将主持今天下午的会议。"}]}],"synonyms":["(as a bike brand) Italian bicycle brand","(as a surname) Italian family name"],"phonetic":"/biˈɑːnki/","extraExplanation":["“Bianchi”是意大利语姓氏与品牌名，常见读法接近“bee-AHN-kee”。在英语语境中，人们多把它当作自行车品牌来使用（例如在骑行、比赛、器材评测里）。","Bianchi与职业自行车运动渊源很深，因此在一些英文骑行文章里会被当作“经典意大利车”的代表之一。"]}
{"word":"Bianchini","summary":{"en":"Bianchini is usually an Italian family name, and it can also refer to a lunar crater named Bianchini.","zh":"Bianchini 通常是意大利姓氏，也可指月球上的“比安基尼陨石坑”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an Italian surname (family name).","zh":"意大利姓氏（家族姓）。"},"examples":[{"en":"Her last name is Bianchini, so she likely has Italian roots.","zh":"她的姓是 Bianchini，所以她可能有意大利血统。"},{"en":"Professor Bianchini will speak at the conference tomorrow.","zh":"Bianchini 教授明天将在会议上发言。"}]},{"partOfSpeech":"n.","definition":{"en":"a name used in astronomy for a lunar crater: Bianchini (a crater on the Moon).","zh":"天文学中的名称：比安基尼陨石坑（位于月球的陨石坑）。"},"examples":[{"en":"The map labels a small feature near the terminator as Bianchini crater.","zh":"这张地图把晨昏线附近的一个小地貌标注为比安基尼陨石坑。"}]}],"synonyms":["Bianchi","Bianco"],"phonetic":"/biɑnˈkiːni/","extraExplanation":["“Bianchini”多见于意大利语姓氏体系，常被理解为与“bianco”（白色）相关的姓氏变体之一；在英语语境中通常不翻译，只保留原拼写。","作为月球陨石坑名称时，属于国际天文学联合会（IAU）命名体系的一部分；在科普或观测资料中常以专有名词出现。"]}
{"word":"bianchite","summary":{"en":"Bianchiite (often misspelled as “bianchite”) is a rare mineral: ammonium sulfate.","zh":"Bianchiite（常被误写为“bianchite”）是一种罕见矿物：硫酸铵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (ammonium sulfate) that can form in places like guano deposits or volcanic fumaroles","zh":"一种罕见矿物（硫酸铵），可在鸟粪堆积物或火山喷气孔等环境中形成"},"examples":[{"en":"Bianchiite is an uncommon mineral, so most people see it only in reference books or museums.","zh":"Bianchiite 属于不常见的矿物，多数人只能在参考书或博物馆里见到。"},{"en":"The sample was labeled “bianchiite,” an ammonium sulfate mineral.","zh":"这份标本被标注为“bianchiite”，一种硫酸铵矿物。"}]}],"synonyms":["ammonium sulfate (chemical name)"],"phonetic":"/biˈɑːnki.aɪt/","extraExplanation":["你输入的 **bianchite** 很可能是 **bianchiite** 的拼写变体或误拼。在矿物学里更常见的标准拼写是 **bianchiite**。","该词来自人名（Bianchi）+ 矿物命名常见后缀 **-ite**（表示“某种矿物”）。"]}
{"word":"Bianco","summary":{"en":"Bianco is an Italian borrowing meaning “white,” common in food/drink names (and also a surname).","zh":"Bianco 源自意大利语，意思是“白色的”，常见于餐饮名称中（也可作姓氏）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(from Italian) “white”; used in English mainly in food and drink names to describe something that is white or made in a white style.","zh":"（源自意大利语）“白色的”；在英语里多用于菜名、饮品名中，表示“白色的/白葡萄（酒）风格的”。"},"examples":[{"en":"I ordered a bianco pizza with mozzarella and mushrooms.","zh":"我点了一份 bianco 白披萨，上面有马苏里拉和蘑菇。"},{"en":"The menu lists a bianco sauce made with cream and cheese.","zh":"菜单上写着一种 bianco 白酱，用奶油和奶酪做的。"}]},{"partOfSpeech":"n.","definition":{"en":"A “bianco” style vermouth (sweet white vermouth), or a cocktail/drink made with it.","zh":"白味美思（甜型白味美思），或用它调制的饮品。"},"examples":[{"en":"She likes vermouth bianco over ice with a slice of lemon.","zh":"她喜欢喝加冰的白味美思，再配一片柠檬。"},{"en":"The bartender suggested a light bianco vermouth spritz.","zh":"调酒师推荐了一款清爽的白味美思气泡酒调饮。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname (family name), originally Italian.","zh":"姓氏（家族姓），多源自意大利语。"},"examples":[{"en":"Dr. Bianco will see you now.","zh":"Bianco 医生现在可以见你了。"}]}],"synonyms":["white","blanco","bianca (feminine form in Italian, seen in dish names)"],"phonetic":"/ˈbjɑːŋkoʊ/","extraExplanation":["“Bianco”在意大利语里就是“白色的”。英语里常见于餐饮语境（菜单、酒单），例如：pizza bianca/bianco（“白披萨”，通常不加番茄酱）、vermouth bianco（白味美思）。","在英语菜单上看到“bianco”，通常是一种“风格说明”，强调颜色或用料（更偏奶油/奶酪/白葡萄等），而不是独立的英语常用词。"]}
{"word":"bianco","summary":{"en":"Bianco is an Italian word meaning “white,” often used in English for white wine or menu items like “pizza bianco.”","zh":"Bianco 是意大利语“白色”的意思，在英语里常用于酒单/菜单，如白葡萄酒或“pizza bianco（白披萨）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Italian) “white”; used in English mainly on menus or product labels to describe something white, especially wine.","zh":"（意大利语）“白色的”；在英语里多见于菜单或商品标签，用来表示“白的”，尤其指白葡萄酒。"},"examples":[{"en":"I’ll have a bianco wine, please.","zh":"请给我来一杯白葡萄酒（bianco）。"},{"en":"The menu lists “pizza bianco,” a white pizza without tomato sauce.","zh":"菜单上写着“pizza bianco”，指不放番茄酱的白披萨。"}]},{"partOfSpeech":"n.","definition":{"en":"A white wine (short for Italian “vino bianco”).","zh":"白葡萄酒（意大利语“vino bianco”的简称）。"},"examples":[{"en":"They opened a chilled bianco with dinner.","zh":"他们晚餐时开了一瓶冰镇白葡萄酒。"},{"en":"If you prefer something lighter, try a bianco.","zh":"如果你喜欢更清爽的口感，可以试试白葡萄酒（bianco）。"}]},{"partOfSpeech":"other","definition":{"en":"A surname or name (e.g., a family name or brand name) meaning “white” in Italian.","zh":"姓氏或名称（如家族姓或品牌名），在意大利语里有“白色”的含义。"},"examples":[{"en":"Bianco is a common Italian last name.","zh":"Bianco 是常见的意大利姓氏。"}]}],"synonyms":["white","blanc","blanco"],"phonetic":"/biˈɑŋkoʊ/","extraExplanation":["“bianco”常见于意大利菜语境：如“pizza bianca/bianco”（白披萨，通常不加番茄酱）、“risotto bianco”（白烩饭）。在酒单上常与“rosso”（红葡萄酒）相对。","拼写小提示：意大利语中“bianco”以 -o 结尾常见于阳性形式；你也可能看到“bianca”（阴性形式），例如“pizza bianca”。"]}
{"word":"biangular","summary":{"en":"Biangular means “having two angles.”","zh":"biangular 意为“有两个角的（双角的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two angles; formed by two angles or having two corners.","zh":"有两个角的；由两个角形成的；有两个拐角的。"},"examples":[{"en":"In geometry, a biangular figure has exactly two angles.","zh":"在几何中，biangular（双角的）图形恰好有两个角。"},{"en":"The metal bracket was described as biangular because it bent sharply in two places.","zh":"这个金属支架被描述为 biangular，因为它在两个位置都有明显的折角。"}]}],"synonyms":["two-angled","having two angles","two-cornered"],"phonetic":"/baɪˈæŋɡjələr/","extraExplanation":["bi- 表示“二、双”（如 bilingual 双语的），angular 来自 angle（角）。因此 biangular 字面意思就是“双角的”。在现代日常英语里很少用，更常见的说法是 two-angled 或 having two angles；在数学、工程或晶体/形状描述的语境里可能偶尔出现。"]}
{"word":"biangulate","summary":{"en":"“Biangulate” means “two-angled,” usually in scientific descriptions; as a rare verb, it means “to make two-angled.”","zh":"biangulate 指“有两个角/呈两角形的”，多用于科学形态描述；作罕见动词时表示“使……呈两角形”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having two angles or two sharp corners; shaped so that it forms two distinct angles (often used in biology or botany).","zh":"（多用于生物/植物学）有两个角（或两个明显棱角）的；呈两角形的。"},"examples":[{"en":"The seed has a biangulate outline when viewed from the side.","zh":"从侧面看，这颗种子的外形呈两角状。"},{"en":"Some leaves appear biangulate near the base, with two sharp lobes.","zh":"有些叶片在基部看起来呈两角形，有两个尖尖的裂片。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something biangulate; to form two angles in it (rare).","zh":"使……呈两角形；使……形成两个角（较少见）。"},"examples":[{"en":"Pressure during growth can biangulate the shell’s edge.","zh":"生长过程中的压力会使贝壳边缘变成两角状。"}]}],"synonyms":["two-angled","diangular","angular"],"phonetic":"/baɪˈæŋɡjəˌleɪt/","extraExplanation":["这个词很少出现在日常英语里，更多见于生物学/植物学的形态描述。","词源上可拆成 bi-（“二、双”）+ angulate（“有角的、成角的”，来自拉丁语 angulus “角”）。看到 bi- 基本就能联想到 “two-”。"]}
{"word":"biangulated","summary":{"en":"Biangulated (rare) means located or determined using two angles, mainly in surveying/navigation.","zh":"Biangulated（罕见）指用两个角度来确定或定位，主要用于测量/导航语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Measured or located by using two angles (especially in surveying or navigation).","zh":"（罕见）用两个角度来测量或定位的（尤指测量学或导航中）。"},"examples":[{"en":"The ship’s position was biangulated from two lighthouse bearings.","zh":"船的位置是根据两个灯塔的方位角来双角定位的。"},{"en":"The map points were biangulated using two fixed reference stations.","zh":"地图上的点是用两个固定参考站进行双角测定的。"}]}],"synonyms":["two-angle fixed","located by two bearings","determined by two angles"],"phonetic":"/baɪˈæŋɡjəˌleɪtɪd/","extraExplanation":["“biangulated”并不是常见词，更常见的对应术语是 **triangulated（用三角测量/三角定位的）**。如果你在论文、报告或工程文本里看到它，通常是在强调“用**两个**角度/两条方位线”来确定位置。","构词上：**bi-** 表示“二、双”，**angulate** 与“角（angle）”相关，整体可理解为“用两个角来确定/推算”。在英语技术语境中，类似概念也常写作 **two-angle fix** 或 **resection**（视具体方法而定）。"]}
{"word":"biangulous","summary":{"en":"“Biangulous” is a nonstandard word meaning “having two angles,” usually better expressed as “biangular.”","zh":"“biangulous” 属于非标准用词，大意是“有两个角的”，更规范的说法通常是 “biangular”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard) Having two angles; “two-angled.” Often used as a playful or mistaken form of biangular.","zh":"（非标准用法）有两个角的；“双角的”。常见于玩笑式造词或把 biangular 写错/说错。"},"examples":[{"en":"The word “biangulous” isn’t common in English; “biangular” is the usual adjective for something with two angles.","zh":"“biangulous” 在英语里并不常见；描述“有两个角”的常用形容词是 “biangular”。"},{"en":"If you mean a shape with three corners, you probably want “triangular,” not “biangulous.”","zh":"如果你想表达“三个角的形状”，更可能需要用 “triangular”，而不是 “biangulous”。"}]}],"synonyms":["biangular","two-angled"],"phonetic":"/baɪˈæŋɡjələs/","extraExplanation":["“biangulous” 很可能是把 **biangular**（双角的、两角的）类比 **triangular**（三角的）而“造出来”的词。英语中更规范、更容易被理解的表达通常是 **biangular**。","前缀 **bi-** 表示“二、双”，词根 **angle** 表示“角”。但英语里常见的搭配是 **biangular / biangularity**，而不是 biangulous。"]}
{"word":"bianisidine","summary":{"en":"Bianisidine is a hazardous chemical used mainly to make dyes and pigments.","zh":"Bianisidine（联二茴香胺）是一种用于制造染料与颜料的危险化学物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (3,3′-dimethoxybenzidine) used mainly as an intermediate in making dyes and pigments; it is considered hazardous and potentially cancer-causing.","zh":"联二茴香胺（3,3′-二甲氧基联苯胺），一种主要用于制造染料与颜料的化学中间体；被认为具有危害性并可能致癌。"},"examples":[{"en":"The lab manual lists bianisidine as a regulated hazardous substance.","zh":"实验室手册将联二茴香胺列为受监管的危险物质。"},{"en":"Bianisidine was historically used in the production of certain azo dyes.","zh":"联二茴香胺曾被用于生产某些偶氮染料。"},{"en":"Workers must avoid inhaling bianisidine dust and wear proper protective equipment.","zh":"工作人员必须避免吸入联二茴香胺粉尘并佩戴合适的防护装备。"}]}],"synonyms":["o-dianisidine","3,3′-dimethoxybenzidine"],"phonetic":"/baɪˌænɪsɪˈdiːn/","extraExplanation":["词形来源：bi- 表示“二、双”，anisidine 来自 anisole（茴香醚）相关的命名体系；在化学命名中常与 o-dianisidine（邻-二茴香胺）互相关联。","安全与使用语境：该词多出现在化学品安全数据表（SDS）、职业健康法规、染料/颜料工业与环境检测文献中；日常英语中很少使用。"]}
{"word":"Bianka","summary":{"en":"Bianka is a female given name, commonly used as a variant spelling of Bianca.","zh":"Bianka 是一个女性名字，常被看作 Bianca 的变体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A female given name (a variant spelling of Bianca).","zh":"女性名字（Bianca 的变体拼写）。"},"examples":[{"en":"Bianka joined our class this semester.","zh":"Bianka 这学期加入了我们班。"},{"en":"Bianka, could you please email me the file?","zh":"Bianka，你可以把文件发邮件给我吗？"}]}],"synonyms":["Bianca"],"phonetic":"/biˈæn.kə/","extraExplanation":["Bianka 通常被视为 Bianca 的拼写变体。Bianca 源自意大利语，和“白色、纯净”（意大利语 bianco=白色）有关，因此这个名字常带有“纯洁、明亮”的联想。","在英语文学中更常见的拼写是 Bianca，例如莎士比亚《驯悍记》(The Taming of the Shrew) 里有名为 Bianca 的角色；Bianka 作为拼写则更具个人/地区风格。"]}
{"word":"biannual","summary":{"en":"Biannual usually means “twice a year,” not “every two years.”","zh":"biannual 通常表示“一年两次/每半年一次”，不是“每两年一次”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening twice a year.","zh":"一年发生两次的；每半年一次的。"},"examples":[{"en":"The company holds a biannual meeting in June and December.","zh":"公司在六月和十二月各召开一次半年会议。"},{"en":"I get a biannual dental checkup to catch problems early.","zh":"我每半年做一次牙科检查，以便及早发现问题。"}]},{"partOfSpeech":"n.","definition":{"en":"A publication or event that occurs twice a year.","zh":"一年出版/举行两次的刊物或活动。"},"examples":[{"en":"This journal is a biannual focused on modern poetry.","zh":"这本期刊是一年出两期，主题聚焦现代诗歌。"}]}],"synonyms":["semiannual","twice-yearly"],"phonetic":"/baɪˈænjuəl/","extraExplanation":["“biannual”常被误用来表示“每两年一次”。严格来说：biannual = 一年两次；biennial = 两年一次。为了避免歧义，日常沟通里也常用 “twice a year / every six months（每半年）” 来更清楚地表达。","词源提示：bi- 表示“二/两”，annual 来自“年”。所以字面意思就是“每年两次”。"]}
{"word":"biannually","summary":{"en":"Biannually usually means “twice a year,” but it is sometimes (less correctly) used to mean “every two years.”","zh":"Biannually 通常表示“一年两次”，但有时（不够严谨）也被用来表示“每两年一次”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"twice a year; occurring every six months","zh":"一年两次；每六个月发生一次"},"examples":[{"en":"We review employee performance biannually, in June and December.","zh":"我们一年两次评估员工绩效，分别在六月和十二月。"},{"en":"The magazine is published biannually.","zh":"这本杂志一年出版两次。"}]},{"partOfSpeech":"adv.","definition":{"en":"(less common) every two years; biennially","zh":"（较少见）每两年一次；相当于 biennially"},"examples":[{"en":"Some people use “biannually” when they mean “every two years,” but “biennially” is clearer.","zh":"有些人用“biannually”来表示“每两年一次”，但用“biennially”更清楚。"}]}],"synonyms":["semiannually","twice a year","every six months"],"phonetic":"/baɪˈænjuəli/","extraExplanation":["在实际英语中，biannually 常被用来表示“一年两次”，但因为前缀 bi- 有时会让人误解成“每两年一次”，正式写作里常建议用更明确的表达：twice a year（每年两次）或 every six months（每六个月一次）。若要表达“每两年一次”，更推荐用 biennially 或 every two years。"]}
{"word":"biannulate","summary":{"en":"Biannulate describes something that has two ring-like bands or two annuli, especially in biological descriptions.","zh":"biannulate 指“有两个环状带/双环的”，常用于生物形态学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two rings (annuli) or marked with two ring-like bands.","zh":"（形容词）有两个环（环带）的；带有两道环状条纹的。"},"examples":[{"en":"The specimen shows a biannulate pattern near the base of the stem.","zh":"这个标本在茎的基部附近呈现出双环状的纹路。"},{"en":"Some insect larvae have biannulate segments that look like two narrow bands.","zh":"有些昆虫幼虫的体节呈双环状，看起来像两条狭窄的带。"}]}],"synonyms":["two-ringed","double-ringed","two-banded"],"phonetic":"/baɪˈæn.jə.leɪt/","extraExplanation":["这个词多见于生物学/分类学（尤其是动物学、植物学的形态描述）。annulus/annuli 意为“环、环带”，bi- 表示“双、两个”。在论文或标本描述中，它常用来精确说明“环带的数量与形态”。","容易与 biannual（每年两次的）/biennial（两年一次的、两年生的）混淆，但 biannulate 指“形态上有两个环”，不是时间频率。"]}
{"word":"biapiculate","summary":{"en":"Biapiculate describes something that ends in two small pointed tips, especially in scientific descriptions.","zh":"biapiculate 指“末端有两个小尖突（双尖）”，多用于科学形态描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany/Zoology) having two small pointed tips (apiculi) at the end; ending in two short points.","zh":"（植物/动物学）具“双尖”的；末端有两个小尖突（小尖头）的。"},"examples":[{"en":"The seed is biapiculate, with two tiny points at one end.","zh":"这种种子是双尖的，一端有两个小小的尖突。"},{"en":"Under the microscope, the shell edge looks biapiculate rather than smooth.","zh":"在显微镜下，这个壳的边缘看起来是双尖的，而不是光滑的。"}]}],"synonyms":["two-pointed","bicuspidate","two-tipped"],"phonetic":"/ˌbaɪəˈpɪkjəˌleɪt/","extraExplanation":["“bi-”表示“两”， “apiculate”来自拉丁语词根，意为“有小尖头的”。因此 biapiculate 常见于分类学/形态学描述，用来精确说明结构末端有两个短尖。","这个词在日常英语中几乎不用，多出现在学术文章、物种描述（如植物种子、叶片或微小结构）里。"]}
{"word":"biarchal","summary":{"en":"Biarchal means “having two arches” (a rare adjective, mostly used in architecture).","zh":"biarchal 指“有两个拱、双拱形的”（很少见，主要用于建筑/结构描述）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Having two arches; shaped with or supported by two arches.","zh":"（罕见）有两个拱；呈双拱形的；由两个拱支撑的。"},"examples":[{"en":"The biarchal doorway gave the entrance a balanced, symmetrical look.","zh":"这道双拱形门让入口看起来更均衡、更对称。"},{"en":"In the sketch, the roof is biarchal, with two curved supports meeting in the middle.","zh":"在草图里，屋顶是双拱形的，两条弧形支撑在中间汇合。"}]}],"synonyms":["double-arched","two-arched","arched (context-dependent)"],"phonetic":"/baɪˈɑrtʃəl/","extraExplanation":["“biarchal”在现代英语里非常少见，多出现在建筑/结构描述中，意思接近“double-arched”（双拱的）。","拼写上容易让人联想到“biracial”（双种族的）或“biparietal”等词，但“biarchal”与种族或生物分类无关。写作时如果担心读者不熟悉，通常用更常见的“double-arched / two-arched”更清楚。"]}
{"word":"biarchy","summary":{"en":"Biarchy means a system where two rulers share power.","zh":"biarchy 指由两方共同掌权的“二人共治/双头统治”制度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a system of government or leadership in which two people (or two groups) rule together; dual rule","zh":"二人共治；双头统治（由两个人或两个团体共同执政的制度）"},"examples":[{"en":"After the crisis, the country briefly operated as a biarchy, with power shared by two rival leaders.","zh":"危机之后，这个国家一度实行二人共治，由两位对立的领导人共享权力。"},{"en":"The company moved toward a biarchy, appointing two co-CEOs to lead different divisions.","zh":"这家公司转向“双CEO”式的二人共治，让两位联合首席执行官分别领导不同事业部。"}]}],"synonyms":["diarchy","dyarchy","dual rule","co-rule"],"phonetic":"/ˈbaɪɑrki/","extraExplanation":["“biarchy”较少见，更常见的同义词是“diarchy / dyarchy（两头统治）”。在历史与政治学写作中，常用来描述两位君主、两大派系或两套权力中心并存、共同执政的结构。","词源上可理解为 bi-（二）+ -archy（统治/政体），与“monarchy（君主制）”“oligarchy（寡头制）”同一词根。写作时若面向大众读者，通常用“diarchy/dyarchy”更自然。"]}
{"word":"biarcuate","summary":{"en":"Bifurcate means to split into two branches or to be divided into two parts.","zh":"Bifurcate 表示“分成两支/分成两部分；分叉”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to split into two branches or parts","zh":"分成两支；分叉成两部分"},"examples":[{"en":"The road bifurcates after the bridge: left to the village, right to the city.","zh":"过桥后道路分叉：左边通往村庄，右边通往城市。"},{"en":"The discussion bifurcated into two topics: cost and safety.","zh":"讨论分成了两个话题：成本和安全。"}]},{"partOfSpeech":"adj.","definition":{"en":"having two branches; divided into two parts","zh":"有两支的；分成两部分的"},"examples":[{"en":"A bifurcate path leads hikers in different directions.","zh":"一条分叉的小路把徒步者引向不同方向。"}]}],"synonyms":["split","divide","branch","fork"],"phonetic":"/ˈbaɪfərˌkeɪt/","extraExplanation":["你输入的“biarcuate”很可能是拼写错误；常见的正确拼写是 **bifurcate**。","**词源**：来自拉丁语前缀 *bi-*（“两、双”）+ *furca*（“叉子、分叉”）。所以它常用于描述道路、河流、树枝、血管等“分成两支”的情况。","在写作中，*bifurcate* 比 *split* 更正式一些，常见于学术或技术语境（如医学解剖、计算机科学中的“分支”）。"]}
{"word":"biarcuated","summary":{"en":"“Bifurcated” means split into two branches or parts.","zh":"“bifurcated”表示“分成两支/两部分的；分叉的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely meant: “bifurcated”) split into two parts or branches; divided into two directions.","zh":"（可能想写：bifurcated）分成两部分的；分叉的；分成两条方向的。"},"examples":[{"en":"The road becomes bifurcated after the bridge, with one lane going north and the other going east.","zh":"过桥后道路分叉，一条车道向北，另一条向东。"},{"en":"The river is bifurcated into two smaller streams.","zh":"这条河分成两条较小的支流。"},{"en":"She has a bifurcated opinion: she understands both sides but can’t choose one.","zh":"她的看法有点“两分”：能理解双方，但难以选边站。"}]},{"partOfSpeech":"v.","definition":{"en":"past form/past participle of “bifurcate”: to split into two branches or parts.","zh":"bifurcate 的过去式/过去分词：分成两支；分叉。"},"examples":[{"en":"At the edge of town, the trail bifurcated and we took the left branch.","zh":"在小镇边缘，小路分叉了，我们走了左边那条。"},{"en":"The nerve bifurcated into two pathways.","zh":"这条神经分成了两条通路。"}]}],"synonyms":["forked","branched","split","divided","two-pronged"],"phonetic":"/ˈbaɪfɚˌkeɪtɪd/","extraExplanation":["“bifurcated / bifurcate”常见于地图、道路、河流、树枝、生物学（神经/血管）等语境；也可用于抽象意义，表示“观点/结构分成两路”。","词源：bi-（二）+ 拉丁语 furca（叉子/岔口），所以核心画面就是“分叉”。","你输入的“biarcuated”不是常见拼写；最接近且常用的词是“bifurcated”。如果你想表达别的词（如“barricaded”“bicarbonated”等），告诉我句子我可以帮你确认。"]}
{"word":"Biarni","summary":{"en":"Biarni is a male Icelandic given name (often spelled Bjarni).","zh":"Biarni 是一个冰岛男性名字（常见拼写为 Bjarni）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A masculine given name, mainly used in Iceland (often spelled “Bjarni”).","zh":"男性名字，主要见于冰岛（常见拼写为“Bjarni”）。"},"examples":[{"en":"Biarni is an Icelandic name you may also see written as Bjarni.","zh":"Biarni 是一个冰岛名字，你也可能看到它写作 Bjarni。"},{"en":"Biarni said he would meet us after work.","zh":"Biarni 说他下班后会来见我们。"}]}],"synonyms":["Bjarni","Bjarne"],"phonetic":"/biˈɑrni/","extraExplanation":["“Biarni/Bjarni”源自古诺尔斯语（Old Norse），与“bear（熊）”有关，名字含义常被理解为“像熊一样强壮/勇敢”。","冰岛人名体系里常见“父名/母名（-son / -dóttir）”而不一定是固定姓氏，所以你可能会看到如“Bjarni Jónsson（约恩之子比亚尔尼）”这类形式。","英语语境中更常见拼写是“Bjarni”；“Biarni”有时是转写或拼写变体。若你是在书里或名单上看到“Biarni”，也可能指同一个名字的不同拼法。"]}
{"word":"Biarritz","summary":{"en":"Biarritz is a seaside resort town in southwestern France, famous for beaches and surfing.","zh":"比亚里茨是法国西南部的海滨度假城市，以海滩与冲浪闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a seaside resort town in southwestern France, on the Bay of Biscay (French Basque coast), known for beaches and surfing","zh":"法国西南部比斯开湾沿岸的海滨度假城市（法属巴斯克地区），以海滩与冲浪闻名"},"examples":[{"en":"We spent a weekend in Biarritz and walked along the beach at sunset.","zh":"我们在比亚里茨度过了一个周末，傍晚沿着海滩散步。"},{"en":"Biarritz is a popular stop on a road trip through the French Basque Country.","zh":"比亚里茨是穿越法国巴斯克地区自驾游的热门停靠点。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the town of Biarritz (often used to describe style, travel, or location)","zh":"与比亚里茨有关的（常用来描述风格、旅行或地点）"},"examples":[{"en":"They chose a Biarritz hotel with an ocean view.","zh":"他们选择了一家能看到海景的比亚里茨酒店。"},{"en":"The café has a relaxed, Biarritz vibe.","zh":"这家咖啡馆有一种轻松的“比亚里茨”氛围。"}]}],"synonyms":["a French seaside resort town","a town on the French Basque coast"],"phonetic":"biˈɑrɪts","extraExplanation":["比亚里茨在19世纪因拿破仑三世与欧仁妮皇后在此度假而声名大噪，逐渐发展成欧洲上流社会的度假胜地。","它位于法属巴斯克海岸，也是欧洲冲浪文化的重要据点之一；2019年七国集团（G7）峰会也曾在此举行。"]}
{"word":"biarticular","summary":{"en":"Biarticular describes a muscle that crosses and acts on two joints.","zh":"biarticular 指“跨越并作用于两个关节的（肌肉）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a muscle) crossing and acting on two different joints.","zh":"（指肌肉）跨越并作用于两个不同关节的。"},"examples":[{"en":"The hamstrings are biarticular muscles because they act at both the hip and the knee.","zh":"腘绳肌是双关节肌，因为它同时作用于髋关节和膝关节。"},{"en":"A biarticular muscle can influence movement in more than one joint at the same time.","zh":"双关节肌可以同时影响不止一个关节的运动。"}]}],"synonyms":["two-joint","two-jointed"],"phonetic":"/ˌbaɪ.ɑrˈtɪk.jə.lɚ/","extraExplanation":["词源结构：bi- 表示“两个”，articular 来自拉丁语 articulus（关节）。因此 biarticular 直译为“两个关节的/跨两个关节的”。","学习提示：在解剖学和运动科学里，biarticular 常用来解释力量传递与动作协同（例如跳跃、跑步时髋与膝的联动），也常与 monoarticular（单关节的）对比使用。"]}
{"word":"biarticulate","summary":{"en":"Biarticulate means ‘having two articulations,’ especially a speech sound made with two places of articulation at once.","zh":"biarticulate 指“具有两个调音/关节连接点的”，尤指同时在两个发音部位产生的语音。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two articulations (two points or places where a movement or connection happens), especially in phonetics: a sound made with two places of articulation at the same time.","zh":"具有两个“发音点/连接点/关节点”的；尤指语音学中：同时在两个部位发音的（双重调音的）。"},"examples":[{"en":"The sound /w/ is often described as biarticulate because it involves both the lips and the velum (soft palate).","zh":"音素 /w/ 常被称为 biarticulate（双重调音），因为它同时涉及嘴唇和软腭（velum）。"},{"en":"Some West African languages include biarticulate stops like /kp/ and /gb/.","zh":"一些西非语言中有双重调音的塞音，比如 /kp/ 和 /gb/。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Anatomy) Connected to or involving two joints or two joint surfaces; having two articulating parts.","zh":"（解剖）与两个关节或两个关节面相连的；涉及两处关节连接的。"},"examples":[{"en":"In anatomy notes, a structure may be called biarticulate if it crosses and acts on two joints.","zh":"在解剖学笔记中，如果某个结构跨越并作用于两个关节，可能会被称为 biarticulate。"}]}],"synonyms":["double-articulated","two-point articulated"],"phonetic":"ˌbaɪɑrˈtɪkjələt","extraExplanation":["在语音学里，biarticulate 常用来解释“同时在两个部位发音”的现象：比如 /w/（唇+软腭）或 /kp/（唇+软腭的塞音）。它和更常见的说法 double-articulated 意思很接近。","这个词偏学术，日常英语中不常见，多见于语言学、语音学或解剖学教材与论文。"]}
{"word":"biarticulated","summary":{"en":"Biarticulated means ‘made with two articulations at the same time’ (especially in phonetics), or more generally ‘having two joints/points of articulation.’","zh":"biarticulated 指“同时用两个部位发音的”（尤指语音学），也可泛指“有两个关节/铰接点的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Linguistics/phonetics) Made with two simultaneous places of articulation (two constrictions in the vocal tract).","zh":"（语言学/语音学）用两个发音部位同时发出（在声道中同时形成两处阻碍）的。"},"examples":[{"en":"The English /w/ is often described as a biarticulated sound because the lips and the tongue body both shape it.","zh":"英语中的 /w/ 常被描述为“双重发音”的声音，因为嘴唇和舌身都会参与塑造它。"},{"en":"Some consonants in certain languages are biarticulated, involving both the lips and the velum area.","zh":"某些语言里有些辅音是“双重发音”的，会同时涉及嘴唇和软腭附近的部位。"}]},{"partOfSpeech":"adj.","definition":{"en":"(More general/anatomy/engineering) Having two joints or two points of articulation; jointed in two places.","zh":"（更一般/解剖/工程）有两个关节或两个铰接点的；在两处相连/可活动连接的。"},"examples":[{"en":"The design uses a biarticulated arm to give the lamp a wider range of motion.","zh":"这个设计使用双关节的灯臂，让台灯有更大的活动范围。"},{"en":"A biarticulated linkage can bend at two separate joints.","zh":"双关节连杆可以在两个不同的关节处弯曲。"}]}],"synonyms":["double-articulated","two-jointed","multi-jointed"],"phonetic":"/ˌbaɪɑrˈtɪkjəˌleɪtɪd/","extraExplanation":["在语音学里，biarticulated 常用来描述“同时”使用两个发音部位的辅音；这和 coarticulation（协同发音，前后音互相影响）不同，后者不一定是“同时两处阻碍”。","常见相关术语：labial-velar（唇-软腭双重发音，如某些语言里的 /k͡p, ɡ͡b/），以及 approximant（近音，如英语 /w/ 常被分析为唇化+软腭/舌后部参与）。"]}
{"word":"Bias","summary":{"en":"Bias means an unfair prejudice or a tendency that makes judgment or results lean in one direction; in statistics it can mean systematic error.","zh":"Bias 指使判断或结果偏向某一方向的“偏见/倾向”；在统计中也指“系统性偏差”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(n.) An unfair preference or prejudice for or against someone or something, especially in a way that affects judgment.","zh":"（名词）偏见；成见；对某人或某事不公平的偏向，影响判断。"},"examples":[{"en":"The hiring committee must avoid bias and treat every applicant fairly.","zh":"招聘委员会必须避免偏见，公平对待每位申请者。"},{"en":"Media bias can shape how people understand the news.","zh":"媒体偏向会影响人们理解新闻的方式。"},{"en":"Her decision showed a clear bias against younger workers.","zh":"她的决定明显对年轻员工有偏见。"}]},{"partOfSpeech":"n.","definition":{"en":"(n.) A tendency or leaning toward a particular idea, style, or choice (not necessarily unfair).","zh":"（名词）倾向；偏好（不一定是不公平的）。"},"examples":[{"en":"I have a bias toward quiet places when I study.","zh":"我学习时更偏好安静的地方。"},{"en":"The team has a bias for simple, practical solutions.","zh":"团队倾向于简单、实用的解决方案。"}]},{"partOfSpeech":"n.","definition":{"en":"(n.) In statistics and measurement, a systematic error that makes results consistently too high or too low.","zh":"（名词）（统计/测量）系统性偏差；使结果持续偏高或偏低的误差。"},"examples":[{"en":"This survey has bias because it only sampled online users.","zh":"这项调查只抽样网民，因此存在偏差。"},{"en":"The instrument showed a bias toward higher readings.","zh":"这个仪器的读数系统性偏高。"}]},{"partOfSpeech":"vt.","definition":{"en":"(vt.) To unfairly influence someone or something; to cause a result to lean in a particular direction.","zh":"（及物动词）使产生偏见；使（结果）偏向某一方向；不公正地影响。"},"examples":[{"en":"Leading questions can bias the witness’s answer.","zh":"诱导性问题会影响证人的回答，使其带有偏向。"},{"en":"Don’t let one bad experience bias your opinion of the whole group.","zh":"不要让一次糟糕的经历影响你对整个群体的看法。"}]}],"synonyms":["prejudice","partiality","favoritism","inclination","leaning","slant"],"phonetic":"/ˈbaɪəs/","extraExplanation":["“bias”常见搭配：implicit bias（隐性偏见）、confirmation bias（确认偏误：更容易相信支持自己观点的信息）、gender/racial bias（性别/种族偏见）。","词源上来自法语/拉丁语系，原义有“斜向、倾斜”的意思，所以“bias”既可指不公平的“偏见”，也可指中性的“倾向”。","在服装/裁缝里，cut on the bias 指“沿布料斜纹裁剪”，这样布料更有弹性；bias tape 是“包边条”。"]}
{"word":"bias","summary":{"en":"Bias is an unfair tendency or preference that affects judgment; it can also mean systematic error in research, and as a verb it means to influence unfairly.","zh":"Bias 指影响判断的偏见/偏向；在研究中也可指系统性偏差；作动词表示使人产生不公平的偏向。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tendency to prefer or judge something in a way that is not completely fair or objective, often for or against a person or group.","zh":"偏见；偏向：对某人或某一群体抱有不完全公平或不客观的倾向，常常表现为支持或反对。"},"examples":[{"en":"The hiring process showed a bias against older workers.","zh":"招聘过程中表现出对年长员工的偏见。"},{"en":"We all have unconscious bias, so it’s important to check our assumptions.","zh":"我们都有无意识偏见，所以重要的是检视自己的假设。"},{"en":"The report tried to reduce political bias by using neutral language.","zh":"这份报告试图用中性措辞来减少政治偏向。"}]},{"partOfSpeech":"n.","definition":{"en":"A preference or leaning toward one side, idea, or choice; a slant in thinking.","zh":"倾向；偏好：在想法或选择上更偏向某一方。"},"examples":[{"en":"I have a bias toward practical solutions.","zh":"我更偏向务实的解决方案。"},{"en":"The newspaper is known for its bias toward local issues.","zh":"这家报纸以偏向本地议题而闻名。"}]},{"partOfSpeech":"vt.","definition":{"en":"To influence someone unfairly, so their judgment is not neutral.","zh":"使产生偏见；使带有偏向：以不公平的方式影响某人，使其判断不再中立。"},"examples":[{"en":"Try not to let one bad experience bias your opinion of the whole group.","zh":"尽量别让一次糟糕经历影响你对整个群体的看法。"},{"en":"The way the question was asked may have biased the results.","zh":"提问方式可能让结果产生偏差。"}]},{"partOfSpeech":"n.","definition":{"en":"In statistics, a systematic error that makes results consistently too high or too low (not just random noise).","zh":"（统计/研究中）系统性偏差：使结果持续偏高或偏低的误差（不是随机波动）。"},"examples":[{"en":"Selection bias can happen when the sample doesn’t represent the population.","zh":"当样本不能代表总体时，就可能出现选择偏差。"},{"en":"The study corrected for measurement bias by using better instruments.","zh":"研究通过使用更好的仪器来校正测量偏差。"}]}],"synonyms":["prejudice","partiality","slant","leaning","inclination"],"phonetic":"/ˈbaɪəs/","extraExplanation":["“bias”在现代英语里经常和“unconscious/implicit bias（无意识/隐性偏见）”“confirmation bias（确认偏误）”“selection bias（选择偏差）”等搭配出现：前两者多用于心理与社会议题，后者常见于研究方法与数据分析。","日常表达中想更委婉，可以说“a slight bias toward…”（略微偏向……）或“may not be fully objective”（可能不完全客观）。","文学与评论写作中，“bias”常与“prejudice（偏见）”区分：prejudice更强调对某群体的先入为主与负面判断；bias更广，可指任何方向的倾向（包括正向偏好），也可指研究中的系统误差。"]}
{"word":"bias against","summary":{"en":"unfair prejudice directed at someone or something","zh":"针对某人或某事的不公平偏见"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"an unfair prejudice or preference that makes you judge someone or something negatively","zh":"对某人或某事抱有不公平的偏见（通常导致负面判断）"},"examples":[{"en":"We must fight bias against people with disabilities in hiring.","zh":"我们必须反对招聘中对残障人士的偏见。"},{"en":"She felt there was bias against her accent at work.","zh":"她觉得工作中存在对她口音的偏见。"},{"en":"The study found no evidence of bias against the new treatment.","zh":"研究没有发现对这种新疗法存在偏见的证据。"}]}],"synonyms":["prejudice against","discrimination against","be biased against","have a prejudice against","be prejudiced against"],"phonetic":"/ˈbaɪəs əˈɡɛnst/","extraExplanation":["常见搭配：show bias against（表现出对……的偏见）、have a bias against（对……有偏见）、bias against + 人群/事物（如 women, immigrants, certain accents）。","注意区分：bias against（对……不利的偏见） vs. bias toward/in favor of（偏向/有利于……）。","在写作中更正式的说法有：prejudice against；在职场/法律语境中也常用：discrimination against。"],"etymology":"“bias”来自法语/普罗旺斯语，原指“斜着、偏向一边”，后来引申为“倾向、偏见”；“against”来自古英语，表示“反对、对抗”。合起来常指“对……有偏见”。","mnemonic":["把“bias”记成“偏”（偏见的“偏”）；“against”是“反对”。合起来就是“偏向反对某人/某事”→对……有偏见。","联想：bias（偏）+ against（对着/反着）= 心里“偏着反对”某一类人。"]}
{"word":"bias against ...","summary":{"en":"unfair preference or prejudice toward something, usually causing disadvantage","zh":"对……不公平的偏向或偏见，通常会造成不利待遇"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"prejudice or an unfair tendency to dislike, distrust, or treat someone/something worse","zh":"对……的偏见；对……不公平的倾向（歧视、排斥等）"},"examples":[{"en":"There is still bias against women in some workplaces.","zh":"在一些工作场所里，对女性的偏见仍然存在。"},{"en":"He faced bias against his accent during job interviews.","zh":"他在求职面试中因为口音而遭遇偏见。"},{"en":"The school has policies to prevent bias against students with disabilities.","zh":"学校有政策来防止对残障学生的歧视。"}]},{"partOfSpeech":"phrase","definition":{"en":"a systematic preference in evaluation, testing, data, or algorithms that makes results disadvantage one group/option","zh":"（评估/测试/数据/算法中的）系统性偏向，导致对某一群体或选项不利"},"examples":[{"en":"Researchers checked the model for bias against older patients.","zh":"研究人员检查该模型是否对年长患者存在系统性偏向。"},{"en":"The test may show bias against non-native speakers.","zh":"这项测试可能对非母语者不利。"}]}],"synonyms":["prejudice against","discrimination against","be biased against","have a bias against","be prejudiced against"],"phonetic":"ˈbaɪəs əˈɡɛnst","extraExplanation":["常见搭配：bias against + 人/群体/事物（bias against immigrants / bias against a proposal）。","近义区分：prejudice 常指先入为主的成见；discrimination 更强调“行动上的不公平对待”；bias 更强调“倾向/偏向”（可能是无意识的）。"],"etymology":"“bias”最早有“斜线、斜切”的意思（来自法语/意大利语用法，指“斜向”），后来引申为“倾向、偏向”，再发展出“偏见”的含义；与“against”搭配时常表示“对……不利的偏向/偏见”。","mnemonic":["把 bias 想成“掰歪（bai-s）”＝把观点“掰歪了”，就容易对别人不公。","against 表示“对着、反对”，合起来就是“偏向（不利于）某一方”。"]}
{"word":"bias-reducing","summary":{"en":"Bias-reducing means designed to make decisions or results fairer and less influenced by bias or systematic error.","zh":"bias-reducing 表示“用于减少偏见或系统性偏差，使结果更公平、更可靠”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to reduce bias (unfair influence or systematic error) in decisions, measurements, or data.","zh":"旨在减少偏见（不公平影响或系统性误差）的；用于让决策、测量或数据更公正/更准确的。"},"examples":[{"en":"The company introduced bias-reducing hiring practices, such as structured interviews.","zh":"公司引入了减少偏见的招聘做法，例如结构化面试。"},{"en":"Researchers used a bias-reducing method to avoid overestimating the treatment’s effect.","zh":"研究人员使用了减少偏差的方法，以避免高估治疗效果。"}]}],"synonyms":["fairness-enhancing","bias-mitigating","unbiased (more general)"],"phonetic":"/ˈbaɪəs rɪˈdusɪŋ/","extraExplanation":["“bias-reducing”是由“bias（偏见/偏差）+ reducing（减少的）”构成的复合形容词，常见于学术写作、数据科学、医疗研究、人力资源等场景。","它既可以指“减少社会偏见”（如性别、种族、年龄带来的不公平），也可以指“减少统计/测量偏差”（如抽样偏差、观察者偏差）。具体含义通常由上下文决定。","相关常见搭配：bias-reducing techniques/methods/strategies（减少偏差的技术/方法/策略）、bias-reducing interventions（减少偏见的干预措施）。"]}
{"word":"bias-related","summary":{"en":"“Bias-related” means connected to bias, either unfair prejudice in people or systematic error in data.","zh":"“bias-related”意为“与偏见/偏差有关的”，可指人的不公平偏见，也可指数据中的系统性误差。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected to bias (an unfair preference or prejudice), especially in how people think, judge, or make decisions.","zh":"与偏见/倾向有关的；指在人们的思考、判断或决策中存在不公平的倾向。"},"examples":[{"en":"The company offered bias-related training to help managers make fairer hiring decisions.","zh":"公司提供与偏见相关的培训，帮助经理做出更公平的招聘决定。"},{"en":"Researchers examined bias-related language in news headlines.","zh":"研究人员分析了新闻标题中与偏见相关的措辞。"}]},{"partOfSpeech":"adj.","definition":{"en":"Concerning statistical or measurement bias (a systematic error that affects results).","zh":"与统计/测量偏差有关的（会系统性影响结果的误差）。"},"examples":[{"en":"They corrected bias-related errors in the survey by adjusting the sample.","zh":"他们通过调整样本来纠正调查中与偏差相关的错误。"},{"en":"Bias-related distortion can make the results look stronger than they really are.","zh":"与偏差相关的扭曲可能让结果看起来比实际更强。"}]}],"synonyms":["bias-associated","bias-linked","prejudice-related","bias-relevant"],"phonetic":"/ˈbaɪəs rɪˈleɪtɪd/","extraExplanation":["“bias-related”是形容词，由“bias（偏见/偏差）+ related（相关的）”组成，常见于较正式的写作（新闻、学术、职场培训）。口语里也可说“about bias”或“connected to bias”。","语境很重要：在社会议题里多指“偏见/歧视”（如 racial bias 种族偏见、gender bias 性别偏见）；在科研数据里多指“偏差/系统误差”。可用名词搭配：bias-related issues/concerns/training/incidents/language/errors。"]}
{"word":"biased","summary":{"en":"Biased means not fair or objective—showing a preference or prejudice; it can also mean having systematic skew in data or results.","zh":"biased 指不公平、不客观的偏袒或偏见；也可指数据或结果存在系统性偏差。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Showing an unfair preference for or against someone or something; not neutral or objective.","zh":"有偏见的；偏袒的；不公正的；不客观的。"},"examples":[{"en":"The report was criticized for being biased against younger workers.","zh":"这份报告被批评对年轻员工有偏见。"},{"en":"Try to choose sources that are balanced, not biased.","zh":"尽量选择立场均衡、不过度偏颇的资料来源。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Statistics/technology) Systematically favoring certain results because of the way data is collected, measured, or trained (e.g., a biased sample or biased algorithm).","zh":"（统计/科技）因数据收集、测量或训练方式而系统性地偏向某些结果（如有偏差的样本/有偏差的算法）。"},"examples":[{"en":"If the survey only reaches city residents, the results may be biased.","zh":"如果调查只覆盖城市居民，结果可能会有偏差。"},{"en":"The company tested the model again to reduce biased outcomes.","zh":"公司再次测试模型以减少带偏差的结果。"}]}],"synonyms":["prejudiced","partial","one-sided","slanted","unfair"],"phonetic":"/ˈbaɪəst/","extraExplanation":["“biased”来自名词“bias”（偏见/偏向）。日常表达中常与介词搭配：be biased toward（偏向、偏袒）/ be biased against（对……有偏见）。","在社会文化语境里，谈“bias/biased”时常指对性别、种族、年龄、口音、阶层等的刻板印象导致的不公平判断。使用时可更具体：biased language（带偏见的措辞）、implicit bias（隐性偏见）。","常见对比：biased（带偏见的） vs. objective（客观的） vs. fair（公平的） vs. balanced（均衡的）。"]}
{"word":"biasedly","summary":{"en":"“Biasedly” means doing or saying something unfairly, showing a preference for one side.","zh":"“biasedly”表示做事或说话带有偏见、不公正，偏向某一方。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a biased way; unfairly, showing a preference for one side, person, or idea.","zh":"以有偏见的方式；不公正地，表现出对某一方/某个人/某种观点的偏袒。"},"examples":[{"en":"The article was written biasedly, praising one candidate and ignoring the other.","zh":"这篇文章写得很有偏向，只夸一位候选人，却忽视了另一位。"},{"en":"If you judge people biasedly, you may miss the full truth.","zh":"如果你带偏见地评判别人，你可能会错过完整的真相。"},{"en":"The referee acted biasedly, and the crowd complained.","zh":"裁判执法不公，引起观众抱怨。"}]}],"synonyms":["unfairly","prejudicially","partially","with bias"],"phonetic":"/ˈbaɪəsɪdli/","extraExplanation":["“biasedly”来自形容词“biased”（有偏见的）+副词后缀“-ly”。更常见、更自然的表达通常是“in a biased way”或“with bias”。","注意区分：bias（偏见/偏向）既可指不公平的偏袒，也可指无意识的倾向；prejudice（成见）通常更强调对某群体的预先负面判断。"]}
{"word":"biases","summary":{"en":"“Biases” means unfair prejudices or systematic errors that influence judgment or results.","zh":"“Biases”指偏见（不公平的成见）或系统性偏差（导致结果失真）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of “bias”) Unfair preferences or judgments that make someone treat people or ideas differently, often without enough evidence.","zh":"（bias 的复数）偏见；成见：因不充分的依据而产生的不公平倾向或判断，导致对人或观点区别对待。"},"examples":[{"en":"We all have biases, so it’s important to check our assumptions.","zh":"我们每个人都有偏见，所以检查自己的想法和假设很重要。"},{"en":"Hiring biases can keep qualified people from getting jobs.","zh":"招聘中的偏见可能会让有能力的人得不到工作。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural of “bias”) Systematic errors in data, testing, or research that make results unfair or inaccurate.","zh":"（bias 的复数）系统性偏差：数据、测试或研究中的系统性错误，使结果不公平或不准确。"},"examples":[{"en":"The survey had biases because it only included city residents.","zh":"这份调查有偏差，因为它只包含城市居民。"},{"en":"Researchers try to reduce biases in their experiments.","zh":"研究人员会尽量减少实验中的偏差。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular of “bias”) To unfairly influence someone’s opinion or decision.","zh":"（动词 bias 的第三人称单数）使产生偏见；不公正地影响某人的看法或决定。"},"examples":[{"en":"One bad review biases people against the restaurant.","zh":"一条差评会让人们对那家餐厅产生负面偏见。"},{"en":"The way the question is asked can bias the answer.","zh":"提问方式可能会影响回答，造成偏向。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, sewing) To cut or place fabric diagonally across the grain, which can make it stretch and drape more smoothly.","zh":"（缝纫）斜裁：沿布料纹理的对角线方向裁剪或摆放，使布料更有弹性、垂感更好。"},"examples":[{"en":"She biases the fabric to make the skirt hang nicely.","zh":"她用斜裁让裙子的垂坠更好看。"}]}],"synonyms":["prejudices","preconceptions","partialities","inclinations","systematic errors","skews"],"phonetic":"/ˈbaɪəs/","extraExplanation":["“bias”常见搭配：implicit bias（隐性偏见）、confirmation bias（确认偏误：更容易相信支持自己观点的信息）、gender/racial bias（性别/种族偏见）。在正式写作里，谈研究或数据时常用“biases”表示“偏差/偏倚”。"]}
{"word":"biasing","summary":{"en":"Biasing usually means influencing something in an unfair or one-sided way; in electronics, it means applying a steady voltage/current (bias).","zh":"Biasing 通常指让事物产生偏见或朝某一方向倾斜；在电子学中则指给器件施加稳定的偏置电压/电流。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"the act of influencing someone or something in an unfair or unbalanced way (present participle of “bias”)","zh":"（作为“bias”的现在分词）以不公平或不平衡的方式影响（某人/某事）；使产生偏见"},"examples":[{"en":"The headline is biasing readers against the defendant.","zh":"这个标题在引导读者对被告产生偏见。"},{"en":"Social media can be biasing our view of what is “normal.”","zh":"社交媒体可能在扭曲我们对“正常”的看法。"}]},{"partOfSpeech":"n.","definition":{"en":"in electronics, the act of applying a steady voltage or current to set a device’s operating point (“DC bias”)","zh":"【电子学】加偏置（对器件施加稳定的电压或电流，以设定工作点/直流偏置）"},"examples":[{"en":"We are biasing the transistor so it stays in the linear region.","zh":"我们给晶体管加偏置，使它保持在线性区工作。"},{"en":"Incorrect biasing can cause distortion in the amplifier.","zh":"偏置不当会导致放大器失真。"}]},{"partOfSpeech":"adj.","definition":{"en":"tending to create bias; shaping results in one direction rather than neutrally","zh":"带有偏向性的；会导致结果朝某一方向倾斜的"},"examples":[{"en":"Using only one neighborhood as your sample is biasing.","zh":"只用一个社区作为样本会造成偏向性。"},{"en":"Leading questions are biasing and may affect the answers.","zh":"诱导性问题带有偏向性，可能影响回答。"}]}],"synonyms":["influencing","skewing","slanting","prejudicing","warping","(electronics) applying bias"],"phonetic":"/ˈbaɪəsɪŋ/","extraExplanation":["在日常语境里，biasing 常指“正在让人产生偏见/把结果带偏”。搭配常见：biasing people against/for…（让人反对/支持……）、biasing the results（让结果偏向）。","在统计与机器学习里，biasing data/model 常指“引入系统性偏差”，比如样本不具代表性、标签带偏见等，会让结论看似有规律但其实不公平或不准确。","在电子学里，biasing 是非常中性的技术词，指“加偏置（电压/电流）”，与“偏见”无关；常见词组：biasing a transistor/diode、DC bias、bias point。"]}
{"word":"biasly","summary":{"en":"“Biasly” means “in a biased way,” but it is uncommon; “biasedly” is the standard form.","zh":"“biasly”意为“带有偏见地”，但很少见；标准写法通常是“biasedly”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a biased way; showing unfair preference for one side or opinion (nonstandard spelling; usually written as “biasedly”).","zh":"带有偏见地；不公平地偏向某一方或某种观点（非标准拼写，通常写作“biasedly”）。"},"examples":[{"en":"The article was written biasly, praising one company while ignoring its problems.","zh":"这篇文章写得很偏颇，只夸一家公司的好，却忽视了它的问题。"},{"en":"If you judge people biasly, you may miss the full truth.","zh":"如果你带着偏见去评判别人，你可能会错过完整的真相。"}]}],"synonyms":["biasedly","unfairly","partially","prejudicially"],"phonetic":"/ˈbaɪəsli/","extraExplanation":["“biasly”在现代英语里非常少见，很多情况下会被视为拼写错误或非标准用法；更常见、也更正式的写法是“biasedly”。","与之相关的词：bias（n. 偏见/偏向），biased（adj. 有偏见的），unbiased（adj. 公正的），impartial（adj. 不偏不倚的）。"]}
{"word":"biasness","summary":{"en":"“Biasness” is a nonstandard noun meaning “bias; the state of being biased.” Prefer “bias” (most common) or “biasedness.”","zh":"“biasness”是非规范名词，表示“偏见/偏向；有偏见的状态”。更建议用最常见的“bias”，或较少用的“biasedness”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard) the state of being biased; unfair preference or prejudice. In standard English, people usually say “bias” or “biasedness.”","zh":"（非规范用法）有偏见/不公正偏好的状态；偏向或成见。标准英语里更常用“bias”或“biasedness”。"},"examples":[{"en":"The report showed biasness toward one political party. (More natural: “bias” / “a bias.”)","zh":"报告显示对某一政党有偏向。（更自然：用“bias”或“a bias”）"},{"en":"We should reduce biasness in hiring decisions. (More natural: “reduce bias” / “reduce bias in hiring.”)","zh":"我们应该减少招聘决策中的偏见。（更自然：用“bias”）"}]}],"synonyms":["bias","prejudice","partiality","unfairness","favoritism","one-sidedness"],"phonetic":"/ˈbaɪəs.nəs/","extraExplanation":["“biasness”在英语母语者中不常见，很多情况下会被视为拼写或用词不地道。想表达“偏见/偏向”，最常用的是名词“bias”（a bias / bias in something）。如果你强调“处于有偏见的状态”，可以用“biasedness”，但在日常写作里也不如“bias”常用。","常见搭配：implicit bias（隐性偏见），confirmation bias（确认偏误），media bias（媒体偏向），gender/racial bias（性别/种族偏见）。"]}
{"word":"biasnesses","summary":{"en":"“Bias” means an unfair preference (a prejudice) or the act of unfairly influencing judgment.","zh":"“bias”指（对人或事的）偏见/偏向，也可作动词表示使判断受到不公平影响。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an unfair preference for or against someone or something, especially in a way that affects judgment","zh":"（尤指影响判断的）偏见；偏向；成见"},"examples":[{"en":"The study showed a bias against older workers.","zh":"这项研究显示对年长员工存在偏见。"},{"en":"We try to reduce bias in hiring decisions.","zh":"我们努力减少招聘决定中的偏见。"},{"en":"News reports should be free from political bias.","zh":"新闻报道应当不带政治偏向。"}]},{"partOfSpeech":"vt.","definition":{"en":"to influence someone’s judgment in an unfair way; to make something lean in one direction","zh":"使产生偏见；使偏向；使倾向于某一方"},"examples":[{"en":"The way the question was asked may have biased the results.","zh":"提问方式可能使结果产生偏差。"},{"en":"Try not to let one bad experience bias your opinion.","zh":"尽量不要让一次糟糕的经历影响你的看法。"}]}],"synonyms":["prejudice","partiality","favoritism","leaning","inclination"],"phonetic":"/ˈbaɪəs/","extraExplanation":["“biasnesses”不是常见标准拼写。你可能想写的是：\n1) “biases” = “bias”的复数（最常用）；\n2) “biasness”偶尔有人用来表示“有偏见的状态”，但在现代英语里不常见，通常用“bias”本身或“bias in …”来表达。","“bias”的复数拼写是“biases”（-s结尾加 -es），发音也会变化：/ˈbaɪəsɪz/（仅作提示，条目发音以“bias”为主）。","常见搭配：implicit bias（隐性偏见）、confirmation bias（确认偏误/证实偏差）、bias against/toward（对……的偏见/偏向）。"]}
{"word":"biassed","summary":{"en":"“Biassed” means biased: unfairly favoring or opposing someone/something; it is also the past form of “bias.”","zh":"“biassed”意为“biased（有偏见的）”，也可作动词 bias 的过去式/过去分词，表示“不公平地影响”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"showing an unfair preference for or against someone or something; not neutral or objective","zh":"有偏见的；带有不公平倾向的；不客观的"},"examples":[{"en":"The report was biassed toward the company’s point of view.","zh":"这份报告偏向公司的观点。"},{"en":"Try to use more neutral language so your review doesn’t sound biassed.","zh":"尽量用更中性的措辞，这样你的评论听起来就不会带偏见。"},{"en":"A biassed judge can’t give a fair decision.","zh":"有偏见的法官无法作出公正的裁决。"}]},{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of “bias”) to influence someone’s opinion unfairly or make them favor one side","zh":"（bias 的过去式/过去分词）使产生偏见；不公平地影响（某人的看法）"},"examples":[{"en":"The headlines biassed many readers before they learned the full story.","zh":"这些标题在读者了解全貌之前就让很多人先入为主了。"},{"en":"She felt the interviewer was already biassed by rumors online.","zh":"她觉得面试官已经被网上的传言影响而带有偏见了。"}]}],"synonyms":["biased","prejudiced","one-sided","partial"],"phonetic":"/ˈbaɪəst/","extraExplanation":["“biassed”是英式拼写，尤其在英式编辑规则中常见；美式英语更常写作“biased”。两者意思相同。","这个词常出现在讨论媒体、研究、招聘、司法等需要“客观/公正”的场景里。","常见搭配：biassed against（对……有偏见）、biassed toward/towards（偏向……）。"]}
{"word":"biassedly","summary":{"en":"“Biassedly” means “in a biased, unfair, or one-sided way” (BrE spelling of “biasedly”).","zh":"“biassedly”意为“带偏见地/不公正地/偏向一方地”（英式拼写，对应美式“biasedly”）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a biased or unfair way; showing a preference for one side, person, or idea rather than judging objectively.","zh":"以有偏见或不公平的方式；对某一方/某人/某种观点表现出偏袒，而不是客观判断。"},"examples":[{"en":"The report was written biassedly and ignored key facts that didn’t support the conclusion.","zh":"这份报告写得很有偏见，忽略了那些不支持结论的关键事实。"},{"en":"The referee judged the match biassedly, favoring the home team.","zh":"裁判判罚很偏袒，偏向主队。"},{"en":"If you select only positive reviews, you’re presenting the product biassedly.","zh":"如果你只挑选好评，就是在以偏颇的方式呈现这个产品。"}]}],"synonyms":["unfairly","one-sidedly","prejudicially","partially"],"phonetic":"/ˈbaɪəstli/","extraExplanation":["“biassedly”是英式拼写，对应美式更常见的“biasedly”。两者意思完全一样，只是拼写习惯不同。","实际使用中，“biasedly/biassedly”并不算高频副词；更自然的表达常是用短语：“in a biased way / with bias / unfairly”。"]}
{"word":"biasses","summary":{"en":"“Biasses” is usually a misspelling of “biases,” meaning either unfair influences (noun plural) or “influences unfairly” (verb).","zh":"“biasses”通常是“biases”的拼写错误，可指“偏见/偏好”（名词复数）或“使产生偏向”（动词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of bias: unfair preferences or influences that make someone judge or act in a one-sided way; also, personal preferences.","zh":"bias 的复数：偏见/成见（使判断或行为不公正、片面）；也可指个人偏好。"},"examples":[{"en":"We all have biases, so it’s important to check our assumptions.","zh":"我们每个人都有偏见，所以重要的是要检视自己的假设。"},{"en":"Hiring decisions should be based on skills, not biases about age or gender.","zh":"招聘决定应该基于能力，而不是对年龄或性别的偏见。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb) third-person singular of bias: to influence someone or something in an unfair or one-sided way.","zh":"（动词）bias 的第三人称单数：使……产生偏向；不公平地影响某人或某事。"},"examples":[{"en":"The headline biases readers before they see the full story.","zh":"这个标题在读者看到完整报道前就先入为主地影响他们。"},{"en":"Knowing the ending can bias your opinion of the movie.","zh":"提前知道结局会影响你对这部电影的评价。"}]}],"synonyms":["prejudices","leanings","partialities","slants","skews","predispositions"],"phonetic":"ˈbaɪəsɪz","extraExplanation":["“biasses”常见于拼写错误；现代标准拼写通常是“biases”。动词第三人称单数也写作“biases”。在较旧的拼写或特定风格中偶尔会看到“biasses”。"]}
{"word":"biassing","summary":{"en":"Biassing (also spelled biasing) means influencing something unfairly or, in technical use, setting an electronic bias level.","zh":"Biassing（也写作 biasing）指不公平地影响结果；技术用法指对电子器件进行“偏置/加偏压”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"the act of unfairly influencing someone or something, especially so the result is not neutral","zh":"（尤指不公平地）影响某人或某事，使结果不再中立"},"examples":[{"en":"The question was worded in a way that was biassing the survey results.","zh":"这个问题的措辞会影响调查结果，使结果产生偏差。"},{"en":"Try not to let your personal experience be biassing your judgment.","zh":"尽量不要让个人经历影响你的判断。"}]},{"partOfSpeech":"v.","definition":{"en":"(technical) the act of setting a baseline level (a “bias”) for an electronic device or system so it operates correctly","zh":"（技术）给电子器件/系统设定一个“偏置/偏压”基准，使其正常工作"},"examples":[{"en":"The technician adjusted the resistor to change the biassing of the transistor.","zh":"技术员调节电阻来改变晶体管的偏置（偏压）。"},{"en":"Incorrect biassing can cause distortion in an amplifier.","zh":"偏置不当会导致放大器失真。"}]}],"synonyms":["skewing","influencing","prejudicing","distorting"],"phonetic":"/ˈbaɪəsɪŋ/","extraExplanation":["“biassing”主要见于英式拼写，是动词 bias 的现在分词/动名词；美式拼写更常写作 “biasing”。两者意思相同。","在日常语境中，它多指“造成偏见/偏向”；在电子工程里常译为“偏置/加偏压”，是中性技术术语。"]}
{"word":"biasteric","summary":{"en":"“biasteric” is not a standard English word; it’s likely a misspelling. Share the sentence and I’ll help identify the intended word.","zh":"“biasteric”不是标准英语单词，可能是拼写错误。把原句发我，我可以帮你判断你真正想查的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a very rare technical term.","zh":"不是标准英语单词；很可能是拼写错误，或极少见的专业术语。"},"examples":[{"en":"I couldn’t find “biasteric” in major English dictionaries—could you share the sentence you saw it in?","zh":"在主流英语词典里找不到“biasteric”，你能把它出现的句子发我吗？"},{"en":"Do you mean “biased” (showing unfair preference) or another word like “bizarre” (very strange)?","zh":"你想表达的是“biased（有偏见的）”，还是“bizarre（怪异的）”之类的词？"}]}],"extraExplanation":["我查不到“biasteric”作为常见英语词汇的可靠来源，比较像拼写误差或OCR识别错误。","如果你告诉我它出现的上下文（整句话/段落、主题领域、是否是人名或品牌名），我可以更准确地推断你想找的词。","按字形接近的常见词里，可能会被写错/看错的有：biased（有偏见的）、bizarre（怪异的）、bactericidal（杀菌的，较专业）、bistatic（双基地雷达的，专业）。请你确认想表达的意思或原文拼写。"]}
{"word":"biasways","summary":{"en":"Byway(s) means a side road, or figuratively a minor/less-traveled area of a topic.","zh":"Byway(s) 指“支路/小路”，也可比喻为某个主题的“旁支、冷门部分”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, less-used road or path that is not the main route; a side road","zh":"小路；支路；偏僻道路（非主要干道）"},"examples":[{"en":"We took a quiet byway through the countryside to avoid traffic.","zh":"我们走了一条乡间的安静小路来避开车流。"},{"en":"The village is reached by narrow byways that don’t appear on every map.","zh":"到那个村子要走一些狭窄的支路，并不是每张地图上都有。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) a less important or unusual area of a subject; a side topic","zh":"（比喻）冷门领域；旁支话题；次要方面"},"examples":[{"en":"The book explores the byways of local history—small stories most people forget.","zh":"这本书探讨了本地历史的冷门角落——许多人早已遗忘的小故事。"},{"en":"Let’s not get lost in the byways; focus on the main point.","zh":"我们别在枝节上绕太久，先抓住重点。"}]}],"synonyms":["side road","back road","lane","offshoot","sidetrack"],"phonetic":"/ˈbaɪweɪ/","extraExplanation":["“biasways”很可能是拼写误差，常见正确拼法是 **byways**（byway 的复数）。by- 在这里有“旁边、次要”的意思，所以 byway 就是“旁路/支路”。","在文学或散文里，byways 常用作比喻，表示“知识或话题的旁支、冷门之处”，常见搭配如 *the byways of history/language*（历史/语言的边角处）。"]}
{"word":"biaswise","summary":{"en":"“Biaswise” means “in terms of bias” or “regarding bias,” and is usually informal.","zh":"“biaswise”意思是“就偏见/偏差而言”，多为非正式用法。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(informal) With respect to bias; in terms of bias (how biased something is or whether bias exists).","zh":"（非正式）就偏见/偏差而言；从“是否有偏见/偏差、偏见程度”这个角度来看。"},"examples":[{"en":"Biaswise, the headline is misleading because it only shows one side of the story.","zh":"就偏见而言，这个标题有误导性，因为它只呈现了事件的一面。"},{"en":"We reviewed the model biaswise before deploying it in hiring decisions.","zh":"我们在把模型用于招聘决策前，从偏差角度对它进行了审查。"},{"en":"Biaswise, her comment came across as unfair, even if she didn’t mean it.","zh":"从偏见角度看，她的话听起来不太公平，即使她本意并非如此。"}]}],"synonyms":["in terms of bias","regarding bias","with respect to bias","from a bias perspective"],"phonetic":"/ˈbaɪəsˌwaɪz/","extraExplanation":["“biaswise”多见于口语或写作中的临时造词，结构是“bias + -wise”。后缀“-wise”常用来表示“就……而言/从……方面看”，类似于“policywise（就政策而言）”“costwise（就成本而言）”。在正式写作中，更常用“in terms of bias / regarding bias / with respect to bias”。"]}
{"word":"biathlon","summary":{"en":"Biathlon is a winter sport that combines cross-country skiing and rifle shooting.","zh":"Biathlon 指“冬季两项”，结合越野滑雪与步枪射击。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A winter sport that combines cross-country skiing and rifle shooting, with athletes skiing between shooting rounds.","zh":"冬季综合运动项目：将越野滑雪与步枪射击结合，运动员在滑行途中进行多轮射击。"},"examples":[{"en":"She started training for the biathlon after learning cross-country skiing.","zh":"学会越野滑雪后，她开始为冬季两项训练。"},{"en":"In the biathlon, missing a target usually costs time or adds extra distance.","zh":"在冬季两项中，没击中靶子通常会被罚时或加滑额外距离。"}]}],"synonyms":["winter biathlon","ski-and-shoot competition"],"phonetic":"/baɪˈæθlən/","extraExplanation":["“bi-”表示“二、双”，“-athlon”来自希腊语，和“decathlon（十项全能）”里的“-athlon”同源，表示“比赛/竞技”。因此 biathlon 字面意思是“两项比赛”。","冬季两项在欧洲（尤其是北欧国家）很受欢迎，也是冬季奥运会项目。比赛常见两种射击姿势：卧射（prone）和立射（standing）。"]}
{"word":"biathlons","summary":{"en":"Biathlons are competitions in the sport of biathlon, which combines cross-country skiing and rifle shooting.","zh":"Biathlons 指冬季两项的多场比赛；冬季两项是一项结合越野滑雪与步枪射击的运动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a winter sport in which athletes alternate between cross-country skiing and rifle shooting","zh":"冬季两项：结合越野滑雪与步枪射击的冬季运动"},"examples":[{"en":"She started training for the biathlon because she loves both skiing and target shooting.","zh":"她开始为冬季两项训练，因为她既喜欢滑雪也喜欢射击。"},{"en":"Biathlons test both endurance and calm focus under pressure.","zh":"冬季两项既考验耐力，也考验压力下的冷静专注。"}]},{"partOfSpeech":"n.","definition":{"en":"a biathlon event or competition (often used in the plural: biathlons)","zh":"一场冬季两项比赛（常用复数 biathlons 指多场比赛）"},"examples":[{"en":"Several biathlons are held each winter in this region.","zh":"这个地区每年冬天会举办好几场冬季两项比赛。"},{"en":"He watched the biathlons on TV during the Winter Olympics.","zh":"冬奥会期间，他在电视上看了冬季两项比赛。"}]}],"synonyms":["biathlon races","winter biathlon events"],"phonetic":"/baɪˈæθlɑn/","extraExplanation":["“biathlon”来自“bi-”（两个）+“athlon”（比赛/竞技），字面意思是“两项竞技”。它是冬季奥运会项目之一，射击环节通常要求选手在高强度滑行后迅速稳定呼吸与心率，这也是它的看点之一。"]}
{"word":"biatomic","summary":{"en":"Biatomic describes something (especially a molecule) made of two atoms.","zh":"biatomic 指（尤指分子）由两个原子组成的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry/physics) Made of, relating to, or existing as molecules that contain two atoms (often two of the same element).","zh":"（化学/物理）由两个原子组成的；与含两个原子的分子有关的（常指同种元素组成的）。"},"examples":[{"en":"Oxygen in the air is usually biatomic (O₂).","zh":"空气中的氧通常是双原子分子（O₂）。"},{"en":"Many common gases are biatomic at room temperature.","zh":"许多常见气体在室温下是双原子分子形式。"}]}],"synonyms":["diatomic","two-atom"],"phonetic":"/ˌbaɪəˈtɑmɪk/","extraExplanation":["“biatomic”在日常英语里不如“diatomic”常见；科学语境中更常说“diatomic molecules（双原子分子）”。","典型的双原子分子包括 H₂（氢气）、N₂（氮气）、O₂（氧气）、F₂、Cl₂、Br₂、I₂；但也有“异核双原子分子”如 CO（一氧化碳）、NO（一氧化氮）。"]}
{"word":"biatrial","summary":{"en":"Biatrial means involving both atria of the heart.","zh":"biatrial 指“涉及心脏左右两个心房的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or involving both atria (the two upper chambers of the heart).","zh":"与双心房有关的；涉及左右两个心房的。"},"examples":[{"en":"The echocardiogram showed biatrial enlargement.","zh":"超声心动图显示双心房增大。"},{"en":"The doctor noted biatrial dilation on the report.","zh":"医生在报告中注明了双心房扩张。"}]}],"synonyms":["both-atrial","involving both atria","bilateral atrial"],"phonetic":"/baɪˈeɪtriəl/","extraExplanation":["“bi-”表示“两个/双”， “atrial”来自“atrium（心房）”。所以 biatrial 直译就是“两个心房的”。常见于医学影像或心电相关描述，如 biatrial enlargement（双心房增大）。"]}
{"word":"biaural","summary":{"en":"Binaural means “using two ears,” especially audio made to sound 3D through headphones.","zh":"binaural 指“与双耳听觉有关”，常指通过耳机呈现更逼真的3D空间音效的音频。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to hearing with two ears; in audio, recorded or processed with two microphones (or channels) to create a realistic 3D “in-the-head” listening effect through headphones.","zh":"（与）双耳听觉有关的；（音频）指用两个麦克风（或双声道）录制/处理，使戴耳机时产生更逼真的三维空间听感。"},"examples":[{"en":"Binaural recording can make you feel as if someone is whispering right behind you.","zh":"双耳录音会让你感觉好像有人在你身后低声说话。"},{"en":"This app uses binaural audio, so headphones work best.","zh":"这个应用使用双耳音频，所以最好戴耳机。"}]}],"synonyms":["two-eared","stereophonic (related, not identical)"],"phonetic":"/baɪˈnɔrəl/","extraExplanation":["你输入的“biaural”在英语中更常见、标准的拼写是 **binaural**（bi- = two“两”，aural = 与耳朵/听觉有关）。","**binaural vs. stereo**：stereo（立体声）主要是左右声道分离；binaural（双耳）更强调模拟人类头部与耳廓对声音的方向与距离线索（常用HRTF等概念），因此用耳机听更有“临场感”。","常见搭配：**binaural beats**（双耳节拍/双耳拍频，指左右耳听到略不同频率产生的拍频感受）、**binaural microphone**（双耳麦克风）。"]}
{"word":"biauricular","summary":{"en":"Biauricular means “involving both ears.”","zh":"biauricular 指“涉及两只耳朵/双耳的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to or using both ears; heard through two ears (often in medicine or audio).","zh":"与两只耳朵有关的；通过双耳进行的（常用于医学或音频语境）。"},"examples":[{"en":"The doctor tested his biauricular hearing to check whether both ears worked equally well.","zh":"医生检查了他的双耳听力，以确认两只耳朵功能是否一样好。"},{"en":"Biauricular listening can make it easier to tell where a sound is coming from.","zh":"双耳聆听能让人更容易判断声音来自哪个方向。"},{"en":"Some hearing aids are designed for biauricular fitting, one device for each ear.","zh":"有些助听器采用双耳验配设计，每只耳朵各戴一个设备。"}]}],"synonyms":["binaural","two-eared","stereophonic"],"phonetic":"/ˌbaɪɔˈrɪkjələr/","extraExplanation":["构词上：bi- 表示“两个/双”，auricular 来自拉丁语 auris（耳朵），合起来就是“与两耳有关的”。","在音频领域更常见的近义词是 binaural（双耳的）；在日常英语里，人们通常直接说 “both ears / with both ears”。"]}
{"word":"biauriculate","summary":{"en":"Biauriculate means having two ear-like lobes or projections, especially in biological or botanical descriptions.","zh":"Biauriculate 指具有两个耳状裂片或突起（多用于生物/植物形态描述）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having two ear-like parts or lobes (often used in biology/botany); two-auricled","zh":"（多用于生物/植物学）具有两个耳状部分或裂片的；双耳状的"},"examples":[{"en":"Some leaves have a biauriculate base with two small lobes that look like ears.","zh":"有些叶片的基部是双耳状的，有两个看起来像耳朵的小裂片。"},{"en":"The botanist described the petal as biauriculate at its base.","zh":"植物学家描述这种花瓣在基部呈双耳状。"}]}],"synonyms":["two-auricled","two-lobed (ear-shaped)","bilobed"],"phonetic":"ˌbaɪɔːˈrɪkjələt","extraExplanation":["词源上由 bi-（“两个/双”）+ auriculate（“耳状的”）组成。auricle/auricular 常和“耳朵”或“耳状结构”相关，因此 biauriculate 多见于形态学描述（尤其是植物的叶基、花瓣等）。","这是较罕见的学术用词，日常英语中一般会用 two ear-shaped lobes（两个耳状裂片）这类表达来替代。"]}
{"word":"biaxal","summary":{"en":"Biaxial means involving two axes or two directions.","zh":"biaxial 指“涉及两条轴或两个方向的（双轴的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having or relating to two axes (two main directions), especially in science and engineering","zh":"（尤指科学与工程中）有两个轴的；与两条轴（两个主要方向）有关的"},"examples":[{"en":"A biaxial stretch makes the plastic film stronger in two directions.","zh":"双轴拉伸会让塑料薄膜在两个方向上更结实。"},{"en":"The crystal shows biaxial optical properties.","zh":"这种晶体表现出双轴的光学性质。"}]}],"synonyms":["two-axis","two-directional","dual-axis"],"phonetic":"/baɪˈæk.si.əl/","extraExplanation":["你输入的“biaxal”更常见的正确拼写是“biaxial”。“bi-”表示“两个”，“axis”表示“轴/轴线”。在材料科学中常说“biaxial stress/strain（双轴应力/应变）”，意思是同时沿两个方向受力或变形。"]}
{"word":"biaxial","summary":{"en":"Biaxial means “having two axes,” often used in science and engineering for forces, materials, or crystals involving two directions.","zh":"Biaxial 指“有两个轴/两个方向的”，常用于科学与工程领域，描述涉及两个方向的受力、材料或晶体等。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having two axes (two main directions or lines of rotation/symmetry)","zh":"双轴的；有两个轴（两个主要方向或旋转/对称轴）的"},"examples":[{"en":"A biaxial crystal has two optical axes.","zh":"双轴晶体有两条光轴。"},{"en":"The material was tested under biaxial stress to see how it behaves when pulled in two directions.","zh":"研究人员在双轴应力条件下测试这种材料，以观察它在两个方向被拉伸时的表现。"},{"en":"Biaxial stretching can make plastic film stronger and clearer.","zh":"双轴拉伸可以让塑料薄膜更坚韧、更透明。"}]}],"synonyms":["two-axis","two-axial","two-directional"],"phonetic":"/baɪˈæk.si.əl/","extraExplanation":["“biaxial”常见于工程与材料科学语境：例如“biaxial stress/strain（双轴应力/应变）”指在两个互相垂直方向同时受力；“biaxial stretching（双轴拉伸）”多用于塑料薄膜生产。","词形结构：bi- 表示“二、双”，axis 表示“轴”，-al 构成形容词，合起来就是“有两个轴的/双轴的”。"]}
{"word":"biaxiality","summary":{"en":"Biaxiality means a two-axis condition, especially two-directional properties, stress/strain, or (in optics) having two optical axes.","zh":"Biaxiality 指“双轴性”：具有两个轴/两个方向的状态，常用于描述材料的双向性质、双向应力/应变，或光学中具有两条光轴。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the condition of having two axes or directions that are important or different (often in engineering, physics, or geometry)","zh":"双轴性；具有两个重要或不同方向（常见于工程、物理或几何语境）"},"examples":[{"en":"The film’s mechanical strength changes with its biaxiality (properties differ along two directions).","zh":"薄膜的机械强度会随着其双轴性而变化（沿两个方向的性质不同）。"},{"en":"Engineers tested biaxiality by stretching the material in both the x and y directions.","zh":"工程师通过在 x 与 y 两个方向同时拉伸材料来测试其双轴性。"}]},{"partOfSpeech":"n.","definition":{"en":"(materials/mechanics) stress or strain acting in two perpendicular directions at the same time","zh":"（材料/力学）双向（常为互相垂直的）应力或应变状态"},"examples":[{"en":"Under biaxiality, cracks may grow differently than under simple one-direction tension.","zh":"在双轴受力条件下，裂纹的扩展方式可能不同于单向拉伸。"},{"en":"The model predicts failure more accurately when biaxiality is included.","zh":"当模型把双轴受力考虑进去时，对失效的预测更准确。"}]},{"partOfSpeech":"n.","definition":{"en":"(optics/mineralogy) the property of being a biaxial crystal, with two optical axes","zh":"（光学/矿物学）双轴晶体的性质；具有两条光轴"},"examples":[{"en":"Some minerals show biaxiality, producing characteristic interference patterns under polarized light.","zh":"一些矿物具有双轴性，在偏振光下会产生典型的干涉图样。"},{"en":"The lab identified the sample’s biaxiality by measuring its two optical axes.","zh":"实验室通过测量两条光轴来确定样品的双轴性。"}]}],"synonyms":["two-axis condition","biaxial stress","biaxial strain","two-directional behavior"],"phonetic":"/ˌbaɪˌæk.siˈæl.ə.ti/","extraExplanation":["“biaxiality”多见于学术/技术写作，日常英语里更常说“biaxial (stress/strain/stretching)”或“two-directional”。","词形提示：bi- = two（两个），axial = axis（轴的），-ity = 状态/性质。理解词根能帮助你猜测类似词：unaxial（单轴的）、triaxial（三轴的）。"]}
{"word":"biaxially","summary":{"en":"“Biaxially” means “in two directions/along two axes.”","zh":"“biaxially”表示“沿两个方向/两条轴（双轴）地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that involves two axes or two directions (usually at right angles).","zh":"以涉及两条轴或两个方向（通常互相垂直）的方式。"},"examples":[{"en":"The film is stretched biaxially to improve its strength.","zh":"这种薄膜经过双向拉伸以提高强度。"},{"en":"Engineers tested the material biaxially, applying force in two directions at the same time.","zh":"工程师对材料进行了双轴测试，同时在两个方向施加力。"}]}],"synonyms":["along two axes","in two directions","bidirectionally"],"phonetic":"/baɪˈækʃəli/","extraExplanation":["“biaxially”常见于材料科学与工程语境，尤其是“biaxially oriented（双向取向）/ biaxially stretched（双向拉伸）”的薄膜、塑料与复合材料。双向处理通常会改变材料在不同方向上的性能（如强度、透明度、阻隔性），与“uniaxially（单轴/单向）”形成对比。"]}
{"word":"biaxillary","summary":{"en":"Biaxillary means “involving both armpits,” mainly used in medical contexts.","zh":"biaxillary 指“涉及双侧腋窝（两边腋下）”，主要用于医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both axillae (both armpits).","zh":"与双侧腋窝（两边腋下）有关的。"},"examples":[{"en":"The doctor noted biaxillary swelling after the infection.","zh":"医生记录到感染后出现双侧腋窝肿胀。"},{"en":"Biaxillary lymph nodes were examined during the physical checkup.","zh":"体检时检查了双侧腋窝淋巴结。"}]}],"synonyms":["bilateral axillary","both axillary"],"phonetic":"/baɪˈæksəˌlɛri/","extraExplanation":["“biaxillary”多见于医学语境：bi- 表示“双、两侧”，axillary 指“腋窝的”。因此它常用于描述体征（如肿胀、皮疹）、检查部位（如淋巴结）或症状分布（双侧腋下）。"]}
{"word":"Biaxin","summary":{"en":"Biaxin is a brand-name antibiotic (clarithromycin) used for bacterial infections.","zh":"Biaxin 是克拉霉素的商品名，一种用于细菌感染的抗生素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand name for clarithromycin, an antibiotic medicine used to treat certain bacterial infections","zh":"百希欣（Biaxin）：克拉霉素的商品名，一种抗生素，用于治疗某些细菌感染"},"examples":[{"en":"The doctor prescribed Biaxin for her sinus infection.","zh":"医生给她开了百希欣（Biaxin）来治疗鼻窦感染。"},{"en":"If you’re allergic to macrolide antibiotics, tell your doctor before taking Biaxin.","zh":"如果你对大环内酯类抗生素过敏，服用百希欣（Biaxin）前要先告诉医生。"}]}],"synonyms":["clarithromycin","antibiotic"],"phonetic":"/ˈbaɪ.æks.ɪn/","extraExplanation":["“Biaxin”是处方药的商品名（brand name），其通用名（generic name）是“clarithromycin（克拉霉素）”。在日常英语里，人们常用商品名指代药物本身，尤其在美国的医疗语境中。","它属于“大环内酯类（macrolide）抗生素”，只对细菌感染有效，对感冒、流感等病毒感染无效。用药需遵医嘱，并按疗程完成。","在真实场景中，病人沟通时常会听到“Biaxin”与“clarithromycin”交替使用；药盒/处方单上也可能主要显示通用名。"]}
{"word":"Biayenda","summary":{"en":"“Biayenda” is not a recognized English word; it’s likely a name or a misspelling.","zh":"“Biayenda”不是标准英文词；很可能是名字或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a proper name (a person/place/brand) or a misspelling of another word.","zh":"不是标准英语单词。可能是专有名词（人名/地名/品牌名），或是其他词的拼写错误。"},"examples":[{"en":"I couldn’t find “Biayenda” in an English dictionary—where did you see it?","zh":"我在英文词典里找不到“Biayenda”——你是在哪里看到的？"},{"en":"If “Biayenda” is a name, its meaning depends on the language/culture it comes from.","zh":"如果“Biayenda”是名字，它的含义取决于它来自哪种语言/文化。"}]}],"phonetic":"/biː.aɪˈjɛn.də/","extraExplanation":["“Biayenda”看起来不像常见英文词汇。为了更准确地帮你：\n1）请给我一句完整原文（前后各几句话更好）；\n2）它是人名/地名/公司名，还是你想查的英文单词？\n3）你是否想输入的是类似拼写的词（例如：biannual, agenda, beyond, vendor 等）？\n有了上下文我就能判断最可能的目标词并给出释义、用法和例句。"]}

