{"word":"Bib","summary":{"en":"A bib is usually a baby’s cloth/plastic protector for eating; it can also mean the chest-covering front part of an apron or overalls.","zh":"bib 通常指婴儿吃饭用的围嘴；也可指围裙或背带裤等衣物的胸前护片。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small piece of cloth or plastic worn around a baby’s (or small child’s) neck to protect clothes while eating.","zh":"（婴儿/幼儿）围嘴；用来防止吃东西时弄脏衣服的小布片或塑料片。"},"examples":[{"en":"Put on a bib before you give the baby soup.","zh":"给宝宝喂汤之前先戴上围嘴。"},{"en":"This bib is waterproof and easy to wipe clean.","zh":"这个围嘴防水，而且很容易擦干净。"}]},{"partOfSpeech":"n.","definition":{"en":"The front upper part of an apron, overalls, or similar clothing that covers the chest.","zh":"（围裙/背带裤等的）上胸前片；护胸部分。"},"examples":[{"en":"Her apron has a large bib that covers her shirt.","zh":"她的围裙有一块很大的护胸前片，能盖住上衣。"},{"en":"He wore overalls with a bib front for work.","zh":"他工作时穿了带护胸前片的背带裤。"}]}],"synonyms":["baby bib","apron front","chest panel"],"phonetic":"/bɪb/","extraExplanation":["在英语里，比赛中选手胸前或背上别着的号码布也常叫 race bib / bib number（例如马拉松“号码布”）。日常对话里说“Don’t forget your bib”在运动场景通常指号码布，而在家里则更可能指宝宝围嘴。","相关固定搭配：bib and tucker 是较老的表达，意思是“盛装/最好的衣服”（偏文学或旧式用法）。"]}
{"word":"bib","summary":{"en":"A bib is usually a cloth/plastic cover worn around the neck to keep clothes clean; it can also mean the chest-cover part of some clothing.","zh":"bib 通常指系在脖子上防弄脏衣服的围嘴/围兜；也可指某些衣物的前胸护片部分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small cloth or piece of plastic worn around the neck to protect clothes from food, drink, or drool (often for babies)","zh":"（常指婴儿用的）围嘴；围兜（系在脖子上，用来防止食物、饮料或口水弄脏衣服）"},"examples":[{"en":"Put a bib on the baby before dinner.","zh":"晚饭前给宝宝戴上围嘴。"},{"en":"This bib is waterproof, so it’s easy to clean.","zh":"这个围兜是防水的，所以很容易清洗。"}]},{"partOfSpeech":"n.","definition":{"en":"the front part of an apron, overalls, or some protective clothing that covers the chest","zh":"（围裙、背带裤或防护服的）前胸护片；胸前部分"},"examples":[{"en":"His overalls have a big bib with a pocket.","zh":"他的背带裤前胸有一块大的护片，上面还有口袋。"},{"en":"The apron’s bib protects your shirt while you cook.","zh":"围裙的胸前部分能在做饭时保护你的衬衫。"}]},{"partOfSpeech":"vi.","definition":{"en":"to drink alcohol excessively; to binge-drink (informal, mainly British)","zh":"（非正式，主要英式）狂饮；酗酒"},"examples":[{"en":"They went out to bib all night after exams.","zh":"考试后他们出去通宵狂饮。"}]}],"synonyms":["(n.) drool bib","(n.) apron front","(informal vi.) binge-drink"],"phonetic":"/bɪb/","extraExplanation":["“bib”最常见就是“婴儿围嘴/围兜”。日常口语里你也会听到 “baby bib”。","词源上与表示“喝”的拟声/口语用法有关，因此在英式非正式语境里会有“狂饮”的动词含义，但在美式英语中相对少见。"]}
{"word":"bib-fronted","summary":{"en":"“Bib-fronted” describes clothing with a bib-like panel on the front.","zh":"“bib-fronted”指衣服前胸有围兜式前片的款式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a bib front (a cloth panel like a baby’s bib) on a piece of clothing, especially on a dress, apron, overalls, or a shirt.","zh":"（衣服）带“围兜式前片”的；前胸有像围兜一样的布片（常见于连衣裙、围裙、背带裤或衬衫）。"},"examples":[{"en":"She wore a bib-fronted apron while cooking dinner.","zh":"她做晚饭时穿着一件带围兜式前片的围裙。"},{"en":"The child’s bib-fronted overalls were practical and easy to wash.","zh":"孩子的围兜式背带裤很实用，也好洗。"},{"en":"A bib-fronted dress can look both classic and a little old-fashioned.","zh":"围兜式前片的连衣裙既显得经典，也会带一点复古感。"}]}],"synonyms":["bib-front","pinafore-style (context-dependent)","overall-style (context-dependent)"],"phonetic":"/bɪb ˈfrʌn.tɪd/","extraExplanation":["“bib”原意是婴儿用的围兜（也可指围在胸前防脏的布片）。在服装语境里，bib front 指衣服前胸的一块覆盖式布片，常见于工作服（防油污、耐用）或儿童服装（方便活动与清洗）。","在英美的服装描述中，bib-front / bib-fronted 常用作商品或款式说明（例如 aprons、overalls、dresses）。也可见于较正式的服饰描述，如 “bib-front tuxedo shirt”（前胸有装饰或加厚前片的礼服衬衫）。"]}
{"word":"bib-less","summary":{"en":"“Bib-less” describes someone or something that does not have or is not wearing a bib.","zh":"“bib-less”表示没有围嘴/围兜，或（衣物）没有前胸护片。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without a bib (a cloth or part of a garment that covers the chest).","zh":"没有围嘴/围兜的；（衣物）没有前胸护片的。"},"examples":[{"en":"The baby was bib-less, so his shirt got messy during lunch.","zh":"宝宝没戴围嘴，所以午饭时衣服弄得很脏。"},{"en":"I prefer bib-less aprons because they feel less bulky.","zh":"我更喜欢无胸口护片的围裙，因为穿起来不那么笨重。"}]}],"synonyms":["without a bib","bib-free","uncovered (chest)"],"phonetic":"/ˈbɪb.ləs/","extraExplanation":["“bib”常见两种意思：一是宝宝吃饭用的“围嘴/围兜”；二是某些衣物上覆盖前胸的“护片/胸布”（例如 bib overalls 吊带工装裤的前胸那一块）。因此 bib-less 可用于日常育儿场景，也可用于服装描述。","拼写上多见连字符：bib-less；在更口语或随意的文本中也可能写作 bibless。"]}
{"word":"bib-like","summary":{"en":"Similar to a bib; shaped or positioned like one, often covering the chest for protection or decoration.","zh":"像圍兜的；外形或位置類似圍兜，常用來遮住胸前以防弄髒或作裝飾。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a bib in shape, placement, or function (covering the chest to protect clothing).","zh":"像圍兜的；具有圍兜外形、位置或功能的（通常遮住胸前以防弄髒衣物）。"},"examples":[{"en":"The toddler wore a bib-like apron to keep his shirt clean during lunch.","zh":"那個幼兒穿著一件圍兜式圍裙，午餐時好讓襯衫不會弄髒。"},{"en":"Her dress had a bib-like front panel with embroidered flowers.","zh":"她的洋裝前面有一塊圍兜般的前片，上面繡著花。"}]}],"synonyms":["bibbed","apron-like","pinafore-like","chest-covering"],"phonetic":"/ˈbɪb.laɪk/","extraExplanation":["“bib-like”是由名詞“bib（圍兜/口水巾）”加上“-like（像……的）”組成的形容詞，多用於描述服裝設計（例如連身裙、圍裙、工作服）或保護性布片（例如醫療或美術課用的防污罩）。常見搭配：bib-like apron/front panel/collar/yoke。"]}
{"word":"bibacious","summary":{"en":"“Bibacious” means fond of drinking alcohol, often in a humorous or literary tone.","zh":"“bibacious”意为“爱喝酒的/嗜饮酒的”，常带幽默或文学化语气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Fond of drinking alcohol; enjoying alcoholic drinks (often used humorously or in formal writing).","zh":"爱喝酒的；嗜饮酒的（常带幽默或较正式语气）。"},"examples":[{"en":"At the reunion, his bibacious uncle kept offering everyone another round.","zh":"在同学聚会上，他那位爱喝酒的叔叔一直给大家劝酒、再来一轮。"},{"en":"The novel paints a bibacious sailor who is warmhearted but often drunk.","zh":"小说刻画了一位爱喝酒的水手：心地善良，但经常醉醺醺。"}]}],"synonyms":["bibulous","boozy","hard-drinking","tipsy","fond of a drink"],"phonetic":"/baɪˈbeɪʃəs/","extraExplanation":["“bibacious”较少见，更常见的同义表达有“bibulous /ˈbɪbjələs/（爱喝酒的）”“boozy（酒气很重的/爱喝酒的）”“fond of a drink（喜欢喝一杯）”。正式或文学语境里用“bibacious”会显得俏皮、略带书面感。","词源上与拉丁语 bibere（喝）有关，同根词还有 imbibe（吸收/饮用）、beverage（饮料）。"]}
{"word":"bibaciousness","summary":{"en":"Bibaciousness means a tendency to drink alcohol often, usually said in a humorous or mildly disapproving way.","zh":"Bibaciousness 指“嗜酒/爱喝酒的倾向”，常带幽默或轻微不赞同的语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or habit of drinking alcoholic drinks often; being fond of drinking (often humorous or slightly critical).","zh":"嗜酒、爱喝酒的习性或倾向（常带幽默或轻微批评语气）。"},"examples":[{"en":"His friends joked about his bibaciousness at weekend parties.","zh":"朋友们在周末聚会时拿他的“爱喝两杯”开玩笑。"},{"en":"The novel portrays the character’s bibaciousness as both charming and self-destructive.","zh":"小说把这个人物的嗜酒写得既讨喜又带有自我毁灭性。"}]}],"synonyms":["drinking habit","heavy drinking","fondness for alcohol","bibulousness"],"phonetic":"/baɪˈbeɪʃəsnəs/","extraExplanation":["“bibaciousness”比较少见，语感略偏书面或戏谑；日常更常用的是“heavy drinking / drinking habit / fondness for alcohol”。","词源上与拉丁语“bibere”（喝）有关；同源词包括“imbibe”（吸收、饮用）和“bibulous”（嗜酒的，较常见）。"]}
{"word":"bibacity","summary":{"en":"Bibacity means a strong fondness for drinking alcohol.","zh":"bibacity 指“嗜酒/爱喝酒”，多见于较书面或带幽默感的表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong liking for drinking alcoholic beverages; habitual enjoyment of alcohol","zh":"嗜酒；爱喝酒（对酒精饮料的强烈喜好）"},"examples":[{"en":"His reputation for bibacity made him a regular at the neighborhood pub.","zh":"他嗜酒的名声让他成了街区酒吧的常客。"},{"en":"The novel treats the captain’s bibacity with humor rather than judgment.","zh":"这部小说用幽默而非评判的方式描写船长的嗜酒。"}]}],"synonyms":["fondness for drink","love of drinking","heavy drinking","alcoholism (stronger/medical)","bibulousness"],"phonetic":"/baɪˈbæsɪti/","extraExplanation":["“bibacity”是比较少见、带一点书面/诙谐色彩的词，常用于轻松或讽刺的语境来形容“爱喝酒、嗜杯中物”。日常口语里更常说“love of drinking / heavy drinking / fondness for alcohol”。","词源来自拉丁语“bibere”（喝）相关的构词，和“imbibe（吸收；饮酒）”“bibulous（嗜酒的）”同源。"]}
{"word":"bibasic","summary":{"en":"“Bibasic” describes a chemical substance with two basic (proton-accepting) sites.","zh":"“bibasic”用于化学，指具有两个碱性（可受质子）位点的物质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Having two basic (proton-accepting) sites or groups; capable of accepting two protons.","zh":"（化学）二碱性的；具有两个可受质子（呈碱性）的位点或基团；可接受两个质子。"},"examples":[{"en":"A bibasic compound can bind two hydrogen ions (H+).","zh":"二碱性化合物可以结合两个氢离子（H+）。"},{"en":"Some amino compounds are described as bibasic because they have two nitrogen atoms that can act as bases.","zh":"有些含氨基的化合物被称为二碱性，因为它们含有两个可以表现为碱性的氮原子。"}]}],"synonyms":["dibasic","di-basic"],"phonetic":"/baɪˈbeɪsɪk/","extraExplanation":["这个词多用于化学语境，和“dibasic（双碱性）”意义接近。前缀 bi- 表示“二、双”。","不要和“basic（基础的）”的日常意思混淆；在这里 basic 指“碱性/可接受质子”。"]}
{"word":"bibasilar","summary":{"en":"A medical adjective meaning “at the bases of both lungs.”","zh":"医学形容词，表示“在双侧肺底（两肺下部）的/涉及双肺底的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Located at, affecting, or involving the bases (bottom parts) of both lungs.","zh":"位于、影响或涉及两侧肺底（肺的下部）的；双肺底的。"},"examples":[{"en":"The chest X-ray showed bibasilar atelectasis.","zh":"胸部X光显示双肺底肺不张。"},{"en":"On exam, the doctor heard bibasilar crackles.","zh":"体格检查时，医生听到双肺底湿啰音。"}]}],"synonyms":["bilateral basilar","both lung bases"],"phonetic":"/ˌbaɪˈbeɪsələr/","extraExplanation":["这是一个医学/影像学常用形容词：bi- 表示“两个/双侧”，basilar 来自 base（底部），这里指肺的“底部”（靠近膈肌的下肺野）。","临床上常见搭配有：bibasilar crackles（双肺底湿啰音）、bibasilar atelectasis（双肺底肺不张）、bibasilar opacities（双肺底影/浸润影）。这些描述本身通常不指明病因，需要结合症状、化验和影像进一步判断。"]}
{"word":"bibation","summary":{"en":"Bibation is a formal/rare word meaning drinking (especially alcohol) or an alcoholic drink.","zh":"Bibation 是较正式且少见的词，指饮酒（尤指酒精饮品）或一杯酒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of drinking, especially alcoholic drinks; drinking alcohol","zh":"饮用（尤指饮酒、喝酒）的行为"},"examples":[{"en":"After the ceremony, there was much bibation and laughter at the reception.","zh":"仪式结束后，招待会上大家频频饮酒，笑声不断。"},{"en":"He promised to cut down on bibation for his health.","zh":"为了健康，他答应减少饮酒。"}]},{"partOfSpeech":"n.","definition":{"en":"(often plural) an alcoholic drink or beverage","zh":"（常用复数）酒精饮料；一杯酒"},"examples":[{"en":"Guests were offered light bibations before dinner.","zh":"晚餐前，宾客们被提供了些清淡的酒水。"},{"en":"The menu lists bibations such as wine, beer, and cocktails.","zh":"菜单上列出了葡萄酒、啤酒、鸡尾酒等酒水。"}]}],"synonyms":["drinking","imbibing","tippling","beverage","drink"],"phonetic":"/baɪˈbeɪʃən/","extraExplanation":["“bibation”比较书面且少见，日常英语里更常用“drinking”“a drink”“beverage(s)”或更具体的“alcohol”“cocktail”等。","词源来自拉丁语“bibere”（喝）。有时在较正式、幽默或古典风格的语境中用来指“饮酒”。"]}
{"word":"bibb","summary":{"en":"“Bibb” can mean an old spelling of “bib,” the named variety “Bibb lettuce,” or the surname Bibb.","zh":"“Bibb”可以指“bib（围嘴）”的少见旧拼写、比布生菜（Bibb lettuce），也可作姓氏Bibb。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bib (a small cloth worn to protect clothes from food), an uncommon/old-fashioned spelling of “bib.”","zh":"围嘴；围兜（用来防止食物弄脏衣服），是“bib”的少见/较旧拼写。"},"examples":[{"en":"The baby’s bibb was soaked after lunch.","zh":"宝宝午饭后围兜都湿透了。"},{"en":"In some older texts, you may see “bibb” used where we now write “bib.”","zh":"在一些较旧的文本里，你可能会看到用“bibb”表示我们现在写的“bib”。"}]},{"partOfSpeech":"n.","definition":{"en":"(often capitalized) Bibb lettuce: a type of soft, sweet butterhead lettuce with small, loose heads.","zh":"（常大写）比布生菜：一种奶油生菜（球生菜的一类），叶子柔软、味道清甜，菜球较小且较松散。"},"examples":[{"en":"This salad uses Bibb lettuce because it’s tender and mild.","zh":"这道沙拉用比布生菜，因为它口感嫩、味道温和。"},{"en":"She wrapped the filling in a Bibb lettuce leaf instead of using bread.","zh":"她用一片比布生菜叶包住馅料，代替面包。"}]},{"partOfSpeech":"other","definition":{"en":"Bibb (a family name).","zh":"Bibb（姓氏）。"},"examples":[{"en":"Her last name is Bibb.","zh":"她的姓是Bibb。"}]}],"synonyms":["bib","butterhead lettuce","butter lettuce"],"phonetic":"/bɪb/","extraExplanation":["“Bibb lettuce”得名于美国肯塔基州的John Bibb（18–19世纪），据说他培育并推广了这种奶油生菜。英语里食品名称常用人名来命名（如Sandwich三明治、Graham cracker格雷厄姆饼干）。"]}
{"word":"bibbed","summary":{"en":"“Bibbed” usually means wearing or having a bib (like a race number bib or bib overalls). It can also be the past form of “bib” meaning to put a bib on someone.","zh":"“Bibbed”通常指“戴着/带有围嘴或号码布（如背带裤胸兜、比赛号码布）”。也可作动词“bib”的过去式，表示“给某人系上围嘴”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Wearing a bib, or having a bib attached (such as a baby’s cloth bib, a runner’s race bib, or bib overalls).","zh":"戴着围嘴的；带有“围嘴/胸兜”的（如婴儿围嘴、跑步比赛号码布、背带裤的胸兜）。"},"examples":[{"en":"The volunteers helped the bibbed runners line up by number.","zh":"志愿者帮助佩戴号码布的跑者按号码排队。"},{"en":"He showed up in bibbed overalls, ready to paint the fence.","zh":"他穿着带胸兜的背带裤来，准备刷栅栏。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “bib” (to put a bib on someone, or to cover something with a bib).","zh":"“bib”的过去式/过去分词：给某人系上围嘴；用围嘴（或类似布片）遮挡。"},"examples":[{"en":"She quickly bibbed the baby before feeding him.","zh":"她在喂宝宝前迅速给他系上了围嘴。"}]}],"synonyms":["wearing a bib","bib-fronted","in bib overalls"],"phonetic":"/bɪbd/","extraExplanation":["“bibbed”作形容词时很常见，尤其在两类语境：①比赛中“bibbed runners”指胸前别着/佩戴号码布的选手；②服装里“bibbed overalls / bib-front shirt”指衣服前面有一块“胸兜/围嘴式”布片的款式。","“bib”作动词在日常口语里不算最常用；更多时候人们会说“put a bib on the baby”。"]}
{"word":"bibber","summary":{"en":"Bibber means a heavy drinker, often used in a literary or old-fashioned style.","zh":"bibber 指嗜酒者/酗酒的人，常带文学化或较旧式的语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who drinks alcohol often, especially in large amounts; a heavy drinker","zh":"嗜酒者；酗酒的人（尤指喝得很多的人）"},"examples":[{"en":"The town’s old stories mention a few famous bibbers who spent every night at the tavern.","zh":"镇上的老故事里提到过几位有名的嗜酒者，他们每晚都泡在酒馆里。"},{"en":"He joked that he used to be a bibber in college, but he rarely drinks now.","zh":"他开玩笑说自己大学时曾是个“酒鬼”，但现在很少喝酒了。"},{"en":"The novel describes him as a cheerful bibber with a quick laugh and a loud voice.","zh":"小说把他描写成一个爱笑、嗓门很大的快乐嗜酒者。"}]}],"synonyms":["heavy drinker","drunkard","boozer","tippler"],"phonetic":"ˈbɪbɚ","extraExplanation":["“bibber”带有较强的书面语/旧式色彩，现代英语更常说“heavy drinker”“drunk”或更口语的“boozer”。","词源上与动词“bib”（小口喝、啜饮）有关；在文学或带戏谑口吻的描写中更常见。"]}
{"word":"bibberies","summary":{"en":"“Bibberies” means repeated or habitual heavy drinking, often in an old-fashioned or humorous style.","zh":"“bibberies”指反复的或习惯性的酗酒/喝酒行为，语气常较古旧或带幽默。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"drinking habits or repeated acts of heavy drinking; bouts of drinking (often humorous or old-fashioned in tone).","zh":"饮酒习惯或反复的酗酒行为；一场场的喝酒（常带幽默或较古旧的语气）。"},"examples":[{"en":"He promised to give up his late-night bibberies and focus on work.","zh":"他答应戒掉深夜的酗酒行为，把精力放在工作上。"},{"en":"The novel describes the character’s bibberies as both tragic and ridiculous.","zh":"小说把这个人物的酗酒写得既悲惨又可笑。"},{"en":"After the festival, the town was quiet again, as if the bibberies had never happened.","zh":"节日过后，小镇又恢复了安静，仿佛那些狂饮从未发生过。"}]}],"synonyms":["heavy drinking","binge drinking","drunkenness","carousing","boozing"],"phonetic":"/ˈbɪbəriz/","extraExplanation":["“bibberies”是复数形式，来自较少见的名词“bibbery”，而“bibbery”又和“bibber（酒鬼/嗜酒者）”同源。现代英语里更常见的说法是“drinking,” “heavy drinking,” “binge drinking,” 或 “drunken behavior”。","语体提示：这个词带一点讽刺、戏谑或文学/旧时文体的味道，用在正式写作里可能显得刻意或过时。"]}
{"word":"bibbers","summary":{"en":"“Bibbers” is the plural of “bibber,” meaning people who drink a lot of alcohol.","zh":"“Bibbers”是“bibber”的复数，意思是嗜酒者、喝很多酒的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who drinks a lot of alcohol; a heavy drinker","zh":"嗜酒者；酒鬼（喝很多酒的人）"},"examples":[{"en":"The bar was full of late-night bibbers.","zh":"酒吧里挤满了深夜喝酒的人。"},{"en":"He was known as a bibber, so his friends worried about his health.","zh":"大家都知道他嗜酒，所以朋友们很担心他的健康。"}]}],"synonyms":["heavy drinker","drunkard","alcoholic"],"phonetic":"/ˈbɪbɚ/","extraExplanation":["“bibber”来自较古老的动词“bib”（小口地喝、啜饮），因此它带有一点旧式或文学/讽刺的语气；日常口语更常说“heavy drinker”或“alcoholic”（更严肃、带医学含义）。"]}
{"word":"bibbery","summary":{"en":"“Bibbery” is an old-fashioned adjective meaning “boozy” or “given to frequent drinking.”","zh":"“bibbery”是一个较古老的形容词，意思是“嗜酒的/爱喝酒的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic) Fond of drinking alcohol; boozy; given to frequent drinking.","zh":"（古用）爱喝酒的；嗜酒的；常常喝酒的。"},"examples":[{"en":"He had a bibbery reputation in the village tavern.","zh":"他在村里的酒馆里以“嗜酒”出名。"},{"en":"The novel paints a bibbery uncle who is warm-hearted but unreliable.","zh":"小说刻画了一个嗜酒的叔叔：心地善良，但不太可靠。"}]}],"synonyms":["boozy","heavy-drinking","hard-drinking","tipsy (sometimes)","alcohol-loving"],"phonetic":"/ˈbɪbəri/","extraExplanation":["“bibbery”现在很少用，带一点旧式/文学化的味道。现代英语更常说“boozy”“heavy-drinking”“fond of drink”。","它和“bibber”（n. 爱喝酒的人）同源，来自动词“bib”（小口喝、啜饮），常见于带有幽默或轻微贬义的语境。"]}
{"word":"Bibbie","summary":{"en":"Bibbie is usually a personal name or nickname; it can also be a variant spelling of Bibby/Bibi.","zh":"Bibbie 通常是人名或昵称；也可能是 Bibby/Bibi 的一种拼写变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a personal name or nickname (often a cute form of names like Elizabeth, Beatrice, or simply “Bibi/Bibby”).","zh":"人名或昵称（常见为可爱的小名，可能来自 Elizabeth、Beatrice 等名字，或就是 Bibi/Bibby 的变体）。"},"examples":[{"en":"Bibbie is my grandmother’s nickname in our family.","zh":"Bibbie 是我家里给奶奶起的小名。"},{"en":"Her friends call her Bibbie, but her legal name is Elizabeth.","zh":"朋友们叫她 Bibbie，但她的法定名字是 Elizabeth。"}]},{"partOfSpeech":"other","definition":{"en":"a less common spelling of “Bibby/Bibi,” used in names, usernames, or as a brand/surname in some contexts.","zh":"“Bibby/Bibi”的不太常见拼写，可能用于名字、网名，或在某些语境中作为品牌名/姓氏出现。"},"examples":[{"en":"Online, he uses Bibbie as his screen name.","zh":"在网上，他用 Bibbie 作为用户名。"},{"en":"I wasn’t sure if it was spelled Bibbie or Bibby.","zh":"我不确定它是拼 Bibbie 还是 Bibby。"}]}],"synonyms":["Bibi","Bibby"],"phonetic":"/ˈbɪbi/","extraExplanation":["“Bibbie”更多见于人名/昵称的拼法，并不是一个常见的通用词汇。日常交流中如果对方是名字，通常首字母大写：Bibbie。","容易与“Bibi”（也可作昵称/名字）混淆；另外“bib”是“围嘴/口水巾”，但“bibbie”一般不表示这个物品。"]}
{"word":"Bibbiena","summary":{"en":"Bibbiena is mainly a proper noun: a town in Tuscany, Italy, and a name/title meaning “from Bibbiena,” especially Cardinal Bibbiena.","zh":"Bibbiena主要是专有名词：意大利托斯卡纳的城镇“比别纳”，也可作人名/称号，意为“来自比别纳”，尤指“比别纳红衣主教”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A town in Tuscany, Italy (in the province of Arezzo).","zh":"比别纳（Bibbiena）：意大利托斯卡纳大区阿雷佐省的一个城镇。"},"examples":[{"en":"We stopped in Bibbiena on our way through the Casentino Valley.","zh":"我们穿过卡森蒂诺山谷时在比别纳停了一下。"},{"en":"Bibbiena is a quiet Tuscan town with medieval architecture.","zh":"比别纳是一座安静的托斯卡纳小镇，保留着中世纪建筑。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname/title meaning “from Bibbiena,” especially referring to the Renaissance Italian cardinal and writer Bernardo Dovizi da Bibbiena (often called “Cardinal Bibbiena”).","zh":"比别纳（作姓名/称号）：意为“来自比别纳”，尤指文艺复兴时期意大利红衣主教兼作家贝尔纳多·多维齐·达·比别纳（常称“比别纳红衣主教”）。"},"examples":[{"en":"Cardinal Bibbiena was a patron of the arts during the Renaissance.","zh":"比别纳红衣主教在文艺复兴时期资助艺术。"},{"en":"The name “da Bibbiena” shows he was associated with the town of Bibbiena.","zh":"“da Bibbiena”这个名字表明他与比别纳这座城镇有关联。"}]}],"synonyms":["the town of Bibbiena","Cardinal Bibbiena (Bernardo Dovizi da Bibbiena)"],"phonetic":"/ˌbiːbiˈɛːnə/","extraExplanation":["“Bibbiena”在英语里通常作为专有名词出现（地名或人名/称号），因此一般不加复数，也不用于普通名词意义。","在意大利姓名中，“da + 地名”（如 da Bibbiena）常表示“来自某地/与某地有关”，类似英语的 “of/from + place”。"]}
{"word":"bibbing","summary":{"en":"“Bibbing” usually means putting on/wearing a bib or making a mess while eating; more rarely, it can mean drinking alcohol (old-fashioned).","zh":"“bibbing”通常指围上/戴着围嘴，或吃东西时把食物饮料弄到衣服上；更少见时可指喝酒（较旧用法）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"the act of putting a bib on someone (especially a baby) or wearing a bib","zh":"给（尤其是婴儿）围上围嘴；或戴着围嘴"},"examples":[{"en":"She’s bibbing the baby before dinner.","zh":"她在晚饭前给宝宝围上围嘴。"},{"en":"Kids were bibbing at the long table to keep their shirts clean.","zh":"孩子们在长桌旁戴着围嘴，以免把衣服弄脏。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal) getting food or drink on your clothes while eating; being messy at the table","zh":"（非正式）吃东西时把食物或饮料弄到衣服上；吃相很“狼狈”"},"examples":[{"en":"He was bibbing tomato sauce all over his white T-shirt.","zh":"他把番茄酱弄得白T恤到处都是。"},{"en":"Try not to bib while you eat noodles.","zh":"你吃面条时尽量别弄得到处都是。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare/old-fashioned) drinking alcohol, often in a hearty or casual way","zh":"（少见/旧式）痛快地喝酒；随意地喝酒"},"examples":[{"en":"They sat by the fire, bibbing and talking late into the night.","zh":"他们坐在火炉旁，一边喝酒一边聊天到深夜。"}]}],"synonyms":["drooling (context-dependent)","spilling","messing up","slopping (informal)"],"phonetic":"/ˈbɪbɪŋ/","extraExplanation":["“bibbing”通常是动词“bib”的现在分词/动名词形式。现代英语里更常用的是名词“bib（围嘴/围兜）”，而把酒“bib”属于较旧或较文学化的用法。","如果你指的是某个特定方言或专有名词里的“Bibbing”（例如人名/地名/品牌），可以给我一句上下文，我可以按实际语境解释。"]}
{"word":"bibble","summary":{"en":"“Bibble” is a rare verb meaning to sip or drink (often alcohol), and it can also (rarely) mean a drinker.","zh":"“bibble”较少见，作动词指小口喝/饮酒（常指酒类）；作名词（更罕见）可指爱喝酒的人。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to drink (especially alcohol), often in a casual or repeated way; to tipple","zh":"（尤指）小口地喝；（常指）饮酒、啜饮（带有反复或随意的感觉）"},"examples":[{"en":"They sat on the porch and bibbled wine while talking about the day.","zh":"他们坐在门廊上，一边啜饮葡萄酒一边聊着一天的事。"},{"en":"He bibbled at his beer and didn’t say much.","zh":"他小口啜着啤酒，话不多。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a person who drinks a lot; a drinker","zh":"（罕见）爱喝酒的人；酒徒"},"examples":[{"en":"In old writing, a “bibble” could mean a habitual drinker.","zh":"在较旧的文字里，“bibble”有时指嗜酒者。"}]}],"synonyms":["sip","drink","tipple","swig","imbibe"],"phonetic":"/ˈbɪbəl/","extraExplanation":["“bibble”在现代英语里很少见，多见于幽默或文学化的表达。更常用的说法是：sip（小口喝）、drink（喝）、tipple（小酌/常喝酒，略带文雅或轻微贬义）。","它和“bib”（围嘴/餐巾）在发音和形式上相近，给人一种拟声或轻松的语感，但实际使用时仍以“喝（酒）”的意思为主。"]}
{"word":"bibbled","summary":{"en":"Bibbled means “drank repeatedly,” often implying sipping or tippling (a rare, somewhat old-fashioned word).","zh":"bibbled 指“反复地喝（常暗示小酌/贪杯）”，属于较少见、略带古旧色彩的用词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of bibble) to drink often, especially alcohol; to tipple or sip repeatedly.","zh":"（bible 的过去式/过去分词）反复地喝；尤指小酌、嗜饮（多指酒）。"},"examples":[{"en":"After work, he bibbled at the bar until late.","zh":"下班后，他在酒吧里小酌到很晚。"},{"en":"The guests bibbled wine and talked quietly.","zh":"客人们一边啜饮葡萄酒，一边小声聊天。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common) to drink or nibble at something in small amounts in a fussy, repetitive way.","zh":"（较少见）少量、挑剔而反复地喝（或吃一点点）。"},"examples":[{"en":"The child bibbled at his juice instead of finishing it.","zh":"孩子只是小口小口地喝果汁，并没有喝完。"}]}],"synonyms":["sipped","drank","tippled","imbibed","quaffed"],"phonetic":"/ˈbɪb(ə)ld/","extraExplanation":["“bibbled”来自动词“bibble”，在现代英语里非常少见，带有一点文学/古旧色彩；更常见的说法是“sipped”“drank”“tippled”。","语感上，“bibble”常暗示“不断地喝、带点贪杯或习惯性小酌”的画面，因此在叙述人物习惯、营造年代感时更有味道。"]}
{"word":"bibbler","summary":{"en":"A bibbler is someone who frequently drinks, especially alcohol, often in a light or old-fashioned sense.","zh":"bibbler 指经常喝（尤其是酒）的人，语气多偏轻松或带点旧式/文学色彩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who drinks (especially alcohol) often; a tippler","zh":"常喝酒的人；爱小酌的人（较常指酒精饮料）"},"examples":[{"en":"He’s more of a bibbler than a heavy drinker—he sips wine all evening.","zh":"他更像是个爱小酌的人，而不是酗酒者——他整晚都在小口啜饮葡萄酒。"},{"en":"In the novel, the old bibbler spends his afternoons at the tavern telling stories.","zh":"在小说里，那位老酒客下午总待在酒馆里讲故事。"}]}],"synonyms":["tippler","drinker","sipper","boozer"],"phonetic":"/ˈbɪb.lɚ/","extraExplanation":["“bibbler”来自动词“to bib”，意思是“小口地喝、啜饮”。这个名词在现代英语里比较少见，带一点旧式或略带玩笑/文学的语气。","语气强弱：bibbler 通常比 “drunk/boozer” 更温和，强调“爱喝、常喝”，不一定表示“酗酒”。"]}
{"word":"bibbling","summary":{"en":"“Bibbling” is a rare word meaning drinking repeatedly in small sips, often alcohol.","zh":"“bibbling”是个较罕见的词，指反复小口啜饮（常指饮酒）。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(rare) drinking often or in small repeated sips, especially alcohol; tippling.","zh":"（罕见）频繁地小口啜饮；（尤指）小酌、贪杯。"},"examples":[{"en":"He spent the evening bibbling wine and chatting with friends.","zh":"他一整晚都在小口喝着葡萄酒，和朋友聊天。"},{"en":"The old sailor was bibbling rum at the corner table.","zh":"那位老水手在角落的桌边小酌朗姆酒。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “bibble”: to drink (especially alcohol) repeatedly or habitually.","zh":"“bibble”的现在分词：反复地喝（尤指酒）；习惯性饮酒。"},"examples":[{"en":"She was bibbling from her water bottle during the long hike.","zh":"长途徒步时，她不停地小口喝着水壶里的水。"}]}],"synonyms":["tippling","sipping","nipping","drinking"],"phonetic":"/ˈbɪbəlɪŋ/","extraExplanation":["“bibbling”在现代英语中非常少见，多见于较老的文字或刻意使用的文风。更常见、容易混淆的是“babbling”（喋喋不休/胡言乱语）。如果你想表达“说个不停”，通常用“babbling”。"]}
{"word":"bibbons","summary":{"en":"“bibbons” is usually a misspelling; most likely “ribbons” or sometimes “bobbins.”","zh":"“bibbons”通常是拼写错误；多半应为“ribbons（丝带）”，有时也可能是“bobbins（线轴）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or mistaken spelling; in most contexts people mean “ribbons” (decorative strips of cloth) or sometimes “bobbins” (spools for thread).","zh":"非标准或常见的拼写错误；多数语境下人们想写的是“ribbons（丝带/缎带）”，有时也可能是“bobbins（线轴）”。"},"examples":[{"en":"I think you meant “ribbons,” not “bibbons.”","zh":"我觉得你想写的是“ribbons”，不是“bibbons”。"},{"en":"She tied bright ribbons around the gift box.","zh":"她用鲜艳的丝带系在礼盒上。"},{"en":"The sewing machine needs a new bobbin.","zh":"那台缝纫机需要一个新的线轴。"}]}],"synonyms":["ribbons","bobbins"],"phonetic":"/ˈbɪbənz/","extraExplanation":["“bibbons”本身不是常见的标准英文单词，因此在词典里通常查不到。最常见的情况是把 r 和 b 写混（ribbons），或把 o 省略/看错（bobbins）。\n小建议：如果你能提供一句原句或上下文（比如跟礼物包装、发饰有关，还是跟缝纫有关），我可以帮你确定到底应是哪一个词。"]}
{"word":"bibbs","summary":{"en":"“bibbs” most commonly means “bibs,” the plural of bib (a protective cover worn while eating), and it can also be the surname “Bibbs.”","zh":"“bibbs”最常见表示“bibs”（bib 的复数，指吃饭时保护衣服的围嘴/围兜）；也可能是姓氏“Bibbs”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) More than one bib: a cloth or plastic cover worn to protect clothing, especially by babies or while eating.","zh":"（复数）bib（围嘴/围兜）的复数：吃饭或照顾婴儿时用来保护衣服的布/塑料围兜。"},"examples":[{"en":"Please pack two bibbs for the baby in case one gets dirty.","zh":"请给宝宝多带两个围嘴，以防一个弄脏。"},{"en":"The daycare keeps extra bibbs in the kitchen.","zh":"托儿所的厨房里备着额外的围兜。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname) spelled “Bibbs.”","zh":"姓氏：Bibbs。"},"examples":[{"en":"Coach Bibbs spoke to the team after practice.","zh":"Bibbs 教练在训练后和队员们谈话。"}]}],"synonyms":["bibs","drool bibs","apron (similar idea)"],"phonetic":"bɪbz","extraExplanation":["“bibbs”在日常英语里更常见的写法是“bibs”（bib 的复数）。如果你在阅读/写作中看到“bibbs”，可能是拼写变体、昵称式拼写，或指姓氏 Bibbs。","“bib”也可指某些服装或围裙式的“前襟/胸前护片”（例如 bib overalls 工装背带裤的前胸布片）。"]}
{"word":"Bibby","summary":{"en":"“Bibby” is most commonly a surname, and sometimes a first name or an organization/company name.","zh":"“Bibby”最常见是姓氏，也可作名字或机构/公司名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), used for people named Bibby","zh":"Bibby：姓氏（家族姓），用于姓 Bibby 的人"},"examples":[{"en":"Dr. Bibby will see you now.","zh":"Bibby 医生现在要见你。"},{"en":"She changed her last name to Bibby after marriage.","zh":"结婚后她把姓改成了 Bibby。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name (first name), though less common","zh":"Bibby：名字（名），但不太常见"},"examples":[{"en":"Bibby is a unique name in my class.","zh":"Bibby 在我们班是个很特别的名字。"}]},{"partOfSpeech":"n.","definition":{"en":"a name used by some businesses or organizations (e.g., a company name)","zh":"Bibby：也可作公司或机构名称（如某些企业品牌名）"},"examples":[{"en":"He works for a company called Bibby.","zh":"他在一家叫 Bibby 的公司工作。"}]}],"synonyms":["(as a name) no true synonyms"],"phonetic":"/ˈbɪbi/","extraExplanation":["“Bibby”在英语里最常见的用法是专有名词（人名/姓氏/机构名）。在阅读或听力中，如果前面有 Mr./Ms./Dr. 或后面跟着公司、学校、团队等名词，通常就是名字或名称。"]}
{"word":"bibby","summary":{"en":"“Bibby” is mainly used as a surname (and sometimes a given name). A rare adjective sense means “bib-like.”","zh":"“Bibby”主要用作姓氏（有时也作名字）。“bibby”作为形容词义很少见，可表示“像围嘴的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname) and sometimes a given name","zh":"姓氏（有时也作名字）"},"examples":[{"en":"Ms. Bibby will lead the meeting today.","zh":"Bibby 女士今天将主持会议。"},{"en":"His last name is Bibby.","zh":"他的姓是 Bibby。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) like a bib; related to a bib","zh":"（罕见）像围嘴的；与围嘴有关的"},"examples":[{"en":"The baby wore a bibby cloth to keep clean.","zh":"宝宝戴着一块像围嘴的布以保持干净。"}]}],"synonyms":["bib-like (rare, for the adjective sense)"],"phonetic":"/ˈbɪbi/","extraExplanation":["“Bibby”最常见是英语里的姓氏（专有名词）。作为普通词义的“bibby”（意为“像围嘴的”）非常少见，更常见的词是“bib”（围嘴）。","姓氏“Bibby”的来源通常被认为和中世纪英语中的昵称/小名有关（例如在名字后加 -y 表示“小/亲昵”），但具体家族来源可能因地区而不同。"]}
{"word":"Bibbye","summary":{"en":"“Bibbye” is an old or dialect spelling of “bye-bye,” meaning “goodbye.”","zh":"“Bibbye”多为“bye-bye（拜拜）”的旧式或方言拼写，意思是“再见”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(dialect, old-fashioned) Goodbye; bye-bye (used when parting).","zh":"（方言/较旧用法）再见；拜拜（告别时说的话）。"},"examples":[{"en":"Bibbye! See you tomorrow.","zh":"Bibbye！明天见。"},{"en":"She waved at the door and called, “Bibbye!”","zh":"她在门口挥手喊道：“Bibbye！”"}]}],"synonyms":["bye","bye-bye","goodbye","farewell"],"phonetic":"/ˈbaɪbaɪ/","extraExplanation":["“Bibbye”常被看作“bye-bye”的一种旧拼法或方言拼法，多见于口语化的书写、地方用法或拟声式拼写。现代英语更常写作“bye-bye / bye”。如果你是在书名、歌词或家族姓氏里看到它，也可能是专有名词（如姓氏/地名），那时含义会不同。"]}
{"word":"bibcock","summary":{"en":"A bibcock is an outdoor faucet with a threaded spout for connecting a hose.","zh":"bibcock 指带螺纹可接水管的室外水龙头。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a faucet (tap), especially an outdoor one, with a threaded spout for attaching a hose; also called a hose bib or hose bibb","zh":"（尤指室外的）水龙头/龙头出水嘴，通常带螺纹可接水管；也叫 hose bib（室外水龙头）"},"examples":[{"en":"Turn off the bibcock before you disconnect the garden hose.","zh":"在拆下花园水管之前，先把室外水龙头关掉。"},{"en":"The plumber replaced the old bibcock because it was leaking.","zh":"水管工更换了旧的室外水龙头，因为它在漏水。"}]}],"synonyms":["hose bib","hose bibb","spigot","outdoor faucet","tap (BrE)"],"phonetic":"/ˈbɪbˌkɑk/","extraExplanation":["在美式英语里更常见的说法是 hose bib / hose bibb、spigot（偏口语）、outdoor faucet（更直白）。在英式语境或较正式/技术性文本中也会看到 bibcock。","词源上 bib 在这里指“突出像鸟嘴/喷嘴”的部分，cock 在旧式英语中常指“阀门/旋塞”（比如 stopcock）。"]}
{"word":"bibcocks","summary":{"en":"“Bibcocks” is the plural of “bibcock,” meaning wall-mounted faucets—often outdoor taps for hoses.","zh":"“Bibcocks”是“bibcock”的复数，指常装在墙上的水龙头，常见为室外接水管用的龙头。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of faucet (tap), usually mounted on a wall, with a downward-pointing spout; often used outdoors to connect a garden hose (also called a hose bib).","zh":"一种水龙头（常固定在墙上），出水口向下；常用于室外连接花园水管（也叫 hose bib）。"},"examples":[{"en":"The plumber replaced the old bibcocks behind the building.","zh":"水管工更换了楼后面旧的室外水龙头。"},{"en":"Turn off the bibcock before you detach the hose.","zh":"拆下水管前先把水龙头关掉。"}]}],"synonyms":["hose bib","outdoor faucet","outside tap","spigot"],"phonetic":"/ˈbɪbˌkɑk/","extraExplanation":["“bibcock”在英式与美式英语的管道语境中都能见到，但日常口语里更常说“outdoor faucet/tap”或“hose bib”。","词形：bibcock（单数）→ bibcocks（复数）。在说明书、房屋检修清单、管道配件目录里更常用这个词。"]}
{"word":"Bibeau","summary":{"en":"Bibeau is a French (often French-Canadian) last name.","zh":"Bibeau 是一个法语（常见于法裔加拿大人）的姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A French (often French-Canadian) surname (family name).","zh":"一个法语（常见于法裔加拿大人）的姓氏（家族姓）。"},"examples":[{"en":"Marie Bibeau lives in Ottawa.","zh":"玛丽·比博住在渥太华。"},{"en":"The email was signed, “J. Bibeau.”","zh":"邮件署名为“J. 比博”。"}]}],"phonetic":"/bɪˈboʊ/","extraExplanation":["“Bibeau”通常被视为法语姓氏，在加拿大（尤其是魁北克及法裔社群）较常见。作为姓氏时一般不翻译含义，只做音译或直接保留拼写。","发音在不同家庭/地区可能略有差异；英语语境中常按近似读音来念。"]}
{"word":"bibelot","summary":{"en":"A bibelot is a small decorative object or knickknack.","zh":"bibelot 指小摆设、装饰性小物件（类似小摆件/小玩意儿）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small decorative object (a knickknack), valued mainly for its appearance rather than practical use","zh":"（多指）小摆设；小装饰品（重观赏性，实用性不强）"},"examples":[{"en":"She collects bibelots from flea markets and keeps them on a shelf.","zh":"她从跳蚤市场收集各种小摆设，放在架子上。"},{"en":"The desk was crowded with photos and little bibelots.","zh":"书桌上堆满了照片和各种小装饰品。"}]}],"synonyms":["knickknack","trinket","ornament","curio"],"phonetic":"/ˈbɪbəˌloʊ/","extraExplanation":["这个词常带一点“精致但可有可无”的语气，接近 knickknack / trinket。多见于较书面或带文学色彩的描写，用来营造“陈设丰富、略显繁复”的氛围。","来自法语 bibelot（小玩意儿、小摆设）。在英语里通常指小而精巧的装饰物，而不是贵重珠宝。"]}
{"word":"bibelots","summary":{"en":"Bibelots are small decorative objects, often collected as ornaments.","zh":"bibelots 指用于摆设或收藏的小装饰品/小摆件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small decorative objects or ornaments, often collected and displayed (e.g., little figurines, trinkets, or knickknacks).","zh":"（常用于收藏或摆设的）小装饰品；小摆件；小玩意儿（如小雕像、装饰小物等）。"},"examples":[{"en":"Her shelves were lined with bibelots from her travels—tiny dolls, coins, and carved animals.","zh":"她的架子上摆满了旅行带回来的小摆件——迷你娃娃、硬币和雕刻的小动物。"},{"en":"The antique shop sold porcelain bibelots and other delicate decorations.","zh":"那家古董店卖瓷制小摆件和其他精致的装饰品。"}]}],"synonyms":["knickknacks","trinkets","ornaments","baubles","curios"],"phonetic":"/ˈbɪbəˌloʊz/","extraExplanation":["“bibelots”是法语外来词（单数 bibelot），在英语里多用于较书面或文艺的语境，指“精致的小摆设/小收藏品”。日常口语里更常说 knickknacks、trinkets 或 ornaments。","语体提示：有时会带一点“可爱但没什么实用价值的小物件”的意味，具体褒贬取决于上下文。"]}
{"word":"bibenzyl","summary":{"en":"Bibenzyl is a compound with two benzene rings connected by a –CH2–CH2– chain (1,2-diphenylethane).","zh":"Bibenzyl 指两个苯环通过 –CH2–CH2– 两碳链连接的化合物（1,2‑二苯乙烷/联苯乙烷）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound made of two benzene (phenyl) rings connected by a two‑carbon chain (–CH2–CH2–); also called 1,2‑diphenylethane","zh":"联苯乙烷；一种由两个苯环（苯基）通过两碳链（–CH2–CH2–）连接而成的化合物，也称 1,2‑二苯乙烷"},"examples":[{"en":"In organic chemistry, bibenzyl is often used as a simple example of two phenyl rings linked by an ethane bridge.","zh":"在有机化学中，bibenzyl 常被用作“两个苯环被乙烷桥连接”的简单例子。"},{"en":"Some plants produce bibenzyl-related molecules that scientists study for potential biological activity.","zh":"一些植物会产生与 bibenzyl 相关的分子，科学家会研究它们可能具有的生物活性。"}]}],"synonyms":["1,2-diphenylethane","diphenylethane"],"phonetic":"/baɪˈbɛn.zəl/","extraExplanation":["“bi-”表示“两个”，“benzyl”与苄基/苯环相关；因此 bibenzyl 这个名字直观地强调“两个与苯相关的结构单元连接在一起”。","在天然产物化学中，“bibenzyl 类化合物”常用于描述一类结构相近的分子（例如在某些兰科植物中可见），学习时可把它当作一个“骨架/母体结构”来理解。"]}
{"word":"biberon","summary":{"en":"A (French-influenced) word meaning “baby bottle.”","zh":"一个偏法语用法的词，意思是“奶瓶”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a baby bottle; a bottle with a nipple/teat used to feed milk or formula to a baby","zh":"奶瓶；（带奶嘴的）婴儿喂奶瓶"},"examples":[{"en":"She warmed the milk and poured it into the biberon.","zh":"她把牛奶加热后倒进奶瓶里。"},{"en":"Do you have a clean biberon for the baby?","zh":"你有给宝宝用的干净奶瓶吗？"}]}],"synonyms":["baby bottle","feeding bottle","bottle"],"phonetic":"/ˈbiːbərɑn/","extraExplanation":["“biberon”主要见于法语语境或受法语影响的英语写作中；在日常英语里更常说 baby bottle / feeding bottle。","词源来自法语 biberon（奶瓶），与拉丁语 bibere（喝）有关。"]}
{"word":"bibhitaki","summary":{"en":"Bibhitaki is an Ayurvedic medicinal fruit (Terminalia bellirica), commonly used dried, especially in the formula Triphala.","zh":"Bibhitaki 指阿育吠陀常用的一种药用果实（Terminalia bellirica），多晒干入方，尤其常见于“三果”Triphala。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medicinal fruit (Terminalia bellirica), used especially in Ayurveda; often dried and used in herbal formulas such as Triphala.","zh":"诃子榄（Terminalia bellirica 的果实），一种常用于阿育吠陀（Ayurveda）的药用果实；常晒干后入方，如“三果（Triphala）”。"},"examples":[{"en":"In Ayurveda, bibhitaki is often used as part of Triphala.","zh":"在阿育吠陀中，bibhitaki 常作为 Trifhala（三果）的一部分使用。"},{"en":"She bought dried bibhitaki fruit from an herbal shop.","zh":"她在草药店买了晒干的 bibhitaki 果实。"}]}],"synonyms":["Terminalia bellirica","beleric myrobalan","baheda","bibhitaka"],"phonetic":"/ˌbɪb.hɪˈtɑː.ki/","extraExplanation":["“Bibhitaki”源自梵语，在英文里多见于草药、瑜伽与印度传统医学（阿育吠陀）语境，日常英语中不算常见。","它通常与另外两种果实（haritaki、amalaki）一起构成著名配方“Triphala（三果）”。","英文资料里也常写作 bibhītaka / bibhitaka，或用常见名 beleric myrobalan（也译作“诃子榄/诃子类药果”，不同地区译名会有差异）。"]}
{"word":"Bibi","summary":{"en":"Bibi can be a personal nickname/name, a South Asian respectful term for a woman (sometimes “grandmother”), or the nickname of Israeli politician Benjamin Netanyahu.","zh":"Bibi 可作人名/昵称，也可作南亚对女性的尊称（有时指“祖母/奶奶”），还常用作以色列政治人物本雅明·内塔尼亚胡的昵称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name or nickname (often for a woman), sometimes used as a friendly way to address someone named Bibiana, Bibianna, or similar names","zh":"（常用于女性的）名字或昵称；也可作为对名为 Bibiana 等人的亲昵称呼"},"examples":[{"en":"Everyone calls her Bibi, but her full name is Bibiana.","zh":"大家都叫她 Bibi，但她的全名是 Bibiana。"},{"en":"Bibi is coming to the party after work.","zh":"Bibi 下班后会来参加聚会。"}]},{"partOfSpeech":"n.","definition":{"en":"(South Asia) a respectful term for a woman; in some families, it can also mean “grandmother”","zh":"（南亚用法）对女性的尊称；在一些家庭语境中也可指“祖母/奶奶”"},"examples":[{"en":"The children greeted the elderly woman as Bibi.","zh":"孩子们把那位年长的女士称作 Bibi 以示尊敬。"},{"en":"I’m visiting my Bibi this weekend.","zh":"这个周末我要去看望我的 Bibi（奶奶/祖母）。"}]},{"partOfSpeech":"n.","definition":{"en":"a well-known nickname for Benjamin Netanyahu, an Israeli politician","zh":"以色列政治人物本雅明·内塔尼亚胡（Benjamin Netanyahu）的常见昵称"},"examples":[{"en":"In the news, people often refer to Benjamin Netanyahu as Bibi.","zh":"在新闻里，人们常把本雅明·内塔尼亚胡称为 Bibi。"}]}],"synonyms":["nickname","pet name","grandmother (context-dependent)","lady (context-dependent)"],"phonetic":"/ˈbiːbi/","extraExplanation":["“Bibi”在不同文化里含义差异很大：既可能只是个人昵称，也可能是南亚部分语言/社群里对女性的尊称或对长辈女性的称呼。遇到该词时，最好结合说话者的文化背景与上下文判断。","在英语新闻语境中，“Bibi”常特指内塔尼亚胡；写作时如果读者不一定熟悉，第一次出现可写全名：Benjamin “Bibi” Netanyahu。"]}
{"word":"bibi","summary":{"en":"“Bibi” can be a friendly nickname for a girl/woman, a South Asian respectful title meaning “lady/madam,” or a political nickname for Benjamin Netanyahu.","zh":"“Bibi”可指女性/女孩的昵称，也可作南亚地区对女性的敬称（女士/夫人），还可在政治新闻中指内塔尼亚胡的绰号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a nickname for a woman or girl, often formed from repeating “bi,” and sometimes used as a familiar name (like “Bebe/Bea”).","zh":"女性或女孩的昵称，常由重复音节构成（bibi），用作亲昵称呼或小名。"},"examples":[{"en":"Her little sister is called Bibi at home.","zh":"她的小妹妹在家里被叫作 Bibi。"},{"en":"Bibi, can you come here for a second?","zh":"Bibi，你能过来一下吗？"}]},{"partOfSpeech":"n.","definition":{"en":"a respectful title for a woman in parts of South Asia (from languages such as Urdu/Hindi), meaning “lady” or “madam.”","zh":"在南亚部分地区对女性的敬称（源自乌尔都语/印地语等），意为“女士、夫人”。"},"examples":[{"en":"People addressed her as Bibi in the village.","zh":"在村里，人们称呼她为 Bibi（女士）。"},{"en":"Bibi Sahiba is a respectful way to refer to an honorable woman.","zh":"Bibi Sahiba 是一种更尊敬的说法，用来称呼受人敬重的女性。"}]},{"partOfSpeech":"n.","definition":{"en":"a well-known political nickname for Benjamin Netanyahu, Israel’s former prime minister (used especially in news and public discussion).","zh":"以色列前总理本雅明·内塔尼亚胡（Benjamin Netanyahu）的常见绰号，常见于新闻与公共讨论。"},"examples":[{"en":"The headline referred to Netanyahu as “Bibi.”","zh":"标题用 “Bibi” 来指代内塔尼亚胡。"},{"en":"In some media, “Bibi” is used as a shorthand name.","zh":"在一些媒体中，“Bibi” 被当作简写称呼。"}]}],"synonyms":["nickname","pet name","madam","lady"],"phonetic":"/ˈbiːbi/","extraExplanation":["“Bibi”在英语里并不是一个单一、固定的词义，更多是跨文化用法：既可能是家人朋友之间的昵称，也可能是从南亚语言进入英语语境的敬称（常见于历史/移民社区/文学描写），还可能在政治新闻中作为特定人物的绰号出现。","遇到“Bibi”时，最好结合上下文判断：是在对某个女孩的亲昵称呼、对女性的尊称，还是在新闻里指某位政治人物。"]}
{"word":"Bibiena","summary":{"en":"Bibiena refers to the renowned Italian Baroque family (Galli da Bibiena) celebrated for theatrical architecture and illusionistic stage set design.","zh":"Bibiena 指意大利巴洛克时期著名的“加利·达·比比埃纳”家族，以剧院建筑与透视幻觉式舞台布景闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A famous Italian family of Baroque-era architects and theatrical set designers (especially Ferdinando and Francesco Galli da Bibiena), known for grand, illusionistic stage scenery and theatre design.","zh":"（专有名词）意大利巴洛克时期著名的建筑与舞台布景设计世家（尤以费尔迪南多与弗朗切斯科·加利·达·比比埃纳为代表），以宏大、富于透视幻觉效果的舞台布景与剧院设计著称。"},"examples":[{"en":"The opera used a Bibiena-inspired set with dramatic perspective and towering arches.","zh":"这部歌剧采用了受比比埃纳风格启发的布景，透视效果强烈，拱门高耸。"},{"en":"In art history class, we studied how the Bibiena family shaped European theatre design.","zh":"在艺术史课上，我们学习了比比埃纳家族如何影响欧洲的剧院设计。"}]}],"synonyms":["Galli da Bibiena (family)"],"phonetic":"/ˌbɪbiˈeɪnə/","extraExplanation":["“Bibiena”常见于艺术史/戏剧史语境，很多时候指“Galli da Bibiena（加利·达·比比埃纳）家族”。他们的代表性特点之一是“斜向透视（scena per angolo）”，让舞台空间看起来更深、更宏伟。","如果你在书目或展览标签里看到“Bibiena”，它可能指某位家族成员（如Ferdinando Galli Bibiena），也可能泛指这一家族的舞台设计风格。"]}
{"word":"Bibio","summary":{"en":"Bibio can refer to a genus of “march flies” in biology, or to the British musician who uses Bibio as a stage name.","zh":"Bibio 既可指生物学中的“毛蚋科某属（春蝇/三月蝇一类）”，也可指使用 Bibio 为艺名的英国音乐人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flies (family Bibionidae), sometimes called “march flies” or “lovebugs,” common in spring and early summer.","zh":"一种双翅目昆虫的属名（毛蚋科 Bibionidae），常被俗称为“春蝇/三月蝇”等，常见于春末夏初。"},"examples":[{"en":"In April, Bibio flies often appear in large numbers around gardens and fields.","zh":"在四月，Bibio 属的蝇类常常在花园和田野附近大量出现。"},{"en":"The study compared different Bibio species found in local forests.","zh":"这项研究比较了当地森林中发现的不同 Bibio 属物种。"}]},{"partOfSpeech":"other","definition":{"en":"the stage name of Stephen Wilkinson, a British musician known for electronic, folk, and ambient-influenced music.","zh":"英国音乐人 Stephen Wilkinson 的艺名，以电子、民谣与氛围音乐风格闻名。"},"examples":[{"en":"I’ve been listening to Bibio while studying because the tracks feel calm and textured.","zh":"我学习时会听 Bibio，因为他的作品很平静、层次也很丰富。"},{"en":"Bibio blends acoustic guitar with electronic sounds in many songs.","zh":"Bibio 在很多歌曲里把原声吉他和电子音色融合在一起。"}]}],"synonyms":["march fly (common name)","lovebug (some related species/common usage)"],"phonetic":"/ˈbɪbi.oʊ/","extraExplanation":["“Bibio”在生物学里是拉丁化的属名写法，通常首字母大写并用斜体（Bibio）；单个物种会写成“Bibio + 种加词”（如 Bibio marci）。","日常英语里你更常看到的是其俗名（如 march fly），而不是属名 Bibio。","作为艺名的 Bibio 通常直接大写，不用斜体；在音乐语境中提到“Bibio”一般指这位音乐人而非昆虫。"]}
{"word":"bibio","summary":{"en":"Bibio can mean a genus of flies (in biology) or the stage name of an English musician.","zh":"Bibio 可指一种蝇类昆虫的属名（生物学），也可指一位英国音乐人的艺名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(biology) A genus of insects (flies) in the family Bibionidae; sometimes used to refer to these “march flies” in general.","zh":"（生物）双翅目昆虫的一个属（Bibio，常见于“毛蚊科/大蚊科”相关分类中）；有时也泛指这类“春蚊/三月蚊（march flies）”。"},"examples":[{"en":"Scientists recorded several Bibio species emerging in early spring.","zh":"科学家记录到几种 Bibio 属的昆虫在早春羽化出现。"},{"en":"These Bibio flies are often seen swarming near woodland paths.","zh":"这种 Bibio 属的蝇类常在林间小路附近成群飞舞。"}]},{"partOfSpeech":"n.","definition":{"en":"A stage name of an English electronic/folk music producer (Bibio, Stephen Wilkinson).","zh":"英国电子/民谣风格音乐制作人的艺名：Bibio（Stephen Wilkinson）。"},"examples":[{"en":"I’ve been listening to Bibio while studying because the sound is calm and textured.","zh":"我学习时会听 Bibio，因为他的音乐安静、层次感强。"},{"en":"Bibio blends electronic beats with acoustic guitar.","zh":"Bibio 把电子节拍和原声吉他融合在一起。"}]}],"synonyms":["march fly","Bibionidae (family name)","stage name"],"phonetic":"/ˈbɪbioʊ/","extraExplanation":["“Bibio”既可能是生物学拉丁名（属名），也可能是音乐人的艺名。用于昆虫属名时通常首字母大写并斜体（Bibio）；谈论音乐人时也大写但不需要斜体。","发音在英语里通常读作“BIH-bee-oh”（美式近似 /ˈbɪbioʊ/）。如果你是在某个特定场景（比如歌词、专辑名、昆虫鉴定）看到它，我也可以帮你判断更准确的含义。"]}
{"word":"bibionid","summary":{"en":"A bibionid is a fly in the family Bibionidae (march flies).","zh":"bibionid 指毛蚋科（Bibionidae，常称“三月蝇/春蝇”）的一种蝇类昆虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a kind of fly belonging to the insect family Bibionidae (often called march flies), usually small to medium-sized, with a stout body and short antennae","zh":"双翅目昆虫中毛蚋科（Bibionidae）的一种苍蝇类昆虫（常称“三月蝇/春蝇”）；通常体形较粗壮、触角较短"},"examples":[{"en":"Researchers collected several bibionids near the stream in early spring.","zh":"研究人员在早春的小溪旁采集到了几只毛蚋科的昆虫（bibionids）。"},{"en":"Bibionids are often seen swarming above grassy areas on warm days.","zh":"在温暖的日子里，毛蚋科昆虫（bibionids）常常会在草地上方成群飞舞。"}]}],"synonyms":["march fly (in some contexts)","Bibionidae fly"],"phonetic":"/bɪˈbaɪ.ə.nɪd/","extraExplanation":["“bibionid”来自昆虫学命名：属名 Bibio（毛蚋属）加上表示“……科/……类成员”的后缀 -id / -nid，意思就是“毛蚋科的成员”。在科普语境里，这一类昆虫有时也被称为“march flies（春季常见的蝇类）”，但不同地区对俗名的使用可能不完全一致。"]}
{"word":"Bibionidae","summary":{"en":"Bibionidae is a scientific name for a family of flies, often called march flies or lovebugs.","zh":"Bibionidae 是一类苍蝇的昆虫学“科”名，常被称为春蝇/三月蝇（march flies）或（部分种类）爱虫（lovebugs）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of flies (in the order Diptera), often called march flies or lovebugs; many species have short bodies, long legs, and may appear in large swarms, especially in spring.","zh":"（昆虫分类）双翅目中的一科，常被称为“春蝇/三月蝇（march flies）”或“爱虫（lovebugs，部分种类）”；许多种类体形较短、足较长，常在春季成群出现。"},"examples":[{"en":"Bibionidae are often seen swarming in the spring near fields and forests.","zh":"春季时，人们常在田野和森林附近看到 Bibionidae（畸蝇科）成群飞舞。"},{"en":"The lovebug is a well-known member of the Bibionidae family in some regions.","zh":"在一些地区，“爱虫（lovebug）”是 Bibionidae（畸蝇科）中很有名的一种。"}]}],"synonyms":["march flies","lovebugs"],"phonetic":"/ˌbɪbiəˈnaɪdi/","extraExplanation":["“Bibionidae”是拉丁化的科学名称，常用于生物学与昆虫学文献中；日常英语里更常用的说法是“march flies”或在特定地区用“lovebugs”。","分类学上它属于双翅目（Diptera）。如果你在阅读论文或标本标签，这类以“-idae”结尾的词通常表示“科（family）”。"]}
{"word":"bibionidae","summary":{"en":"Bibionidae: a family of flies, often called march flies/lovebugs.","zh":"Bibionidae：双翅目的一科昆虫，常称三月蝇/春蝇或（部分种类）爱虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of flies (order Diptera), commonly called march flies or lovebugs; many species have stout bodies, short antennae, and larvae that live in soil or decaying plant matter.","zh":"一种双翅目昆虫的科名，常称“三月蝇/春蝇（march flies）”或“爱虫（lovebugs，部分种类）”；多为体形粗壮、触角较短，幼虫多生活在土壤或腐殖质中。"},"examples":[{"en":"Bibionidae are often seen in large numbers in early spring.","zh":"Bibionidae（毕比蝇科）常在早春大量出现。"},{"en":"The larvae of many Bibionidae feed on decaying leaves in the soil.","zh":"许多毕比蝇科昆虫的幼虫以土壤中的腐叶为食。"}]}],"synonyms":["march flies","lovebugs"],"phonetic":"ˌbɪbiəˈnaɪdi","extraExplanation":["“Bibionidae”是昆虫分类学中的“科”名（family）。词尾“-idae”是动物学命名中常见的“科”后缀；它来自属名“Bibio”（毕比蝇属）。在非专业语境中，人们更常说“march flies（三月蝇/春蝇）”或在特定地区提到“lovebugs（爱虫，特指其中某些种类）”。"]}
{"word":"bibiri","summary":{"en":"“bibiri” is an informal loanword (from Japanese) meaning a scaredy-cat or someone who scares easily.","zh":"“bibiri”是源自日语的非正式外来词，指胆小鬼或很容易被吓到的人/状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(loanword, from Japanese slang) a person who scares easily; a scaredy-cat.","zh":"（外来词，源自日语俚语）很容易被吓到的人；胆小鬼。"},"examples":[{"en":"Don’t be a bibiri—it's just a harmless joke.","zh":"别当个 bibiri 了——这只是个无伤大雅的玩笑。"},{"en":"He acts tough online, but in real life he’s a total bibiri.","zh":"他在网上装得很硬气，但现实里完全是个 bibiri。"}]},{"partOfSpeech":"adj.","definition":{"en":"(loanword, informal) easily frightened; timid.","zh":"（外来词，非正式）容易受惊的；胆小的。"},"examples":[{"en":"I was bibiri about walking home alone at night.","zh":"我晚上一个人走回家有点 bibiri。"},{"en":"She’s not bibiri—she just likes to be careful.","zh":"她不是胆小，只是更谨慎。"}]}],"synonyms":["scaredy-cat","coward","timid person","easily scared"],"phonetic":"/bɪˈbɪri/","extraExplanation":["“bibiri/ビビり”来自日语口语：动词“ビビる（bibiru）”意为“被吓到、发怵”，名词化“ビビり”常指“胆小的人”。在英文语境中多出现在动漫/日本文化圈或网络聊天里，属于非正式用法。","语气上常带一点调侃或轻微贬义；对不熟的人使用可能显得不礼貌。更中性的英文可说：timid, nervous, easily scared。"]}
{"word":"bibiru","summary":{"en":"“Bibiru” is usually the romanized Japanese slang verb meaning “to get scared / freak out,” not a standard English word.","zh":"“bibiru”通常是日语俚语“ビビる”的罗马字，意思是“被吓到/害怕”，并非标准英语词。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Nonstandard English) A romanized Japanese slang verb meaning “to get scared,” “to freak out,” or “to chicken out.”","zh":"（非标准英语用法）日语俚语动词的罗马字写法，意思是“害怕”“被吓到”“怂了/打退堂鼓”。"},"examples":[{"en":"Don’t bibiru—it’s just a small bug.","zh":"别 bibiru 了——只是只小虫子。"},{"en":"He acted tough, but he totally bibiru’d when the dog barked.","zh":"他装得很硬气，但狗一叫他就彻底 bibiru 了。"}]}],"synonyms":["get scared","freak out","chicken out","panic"],"phonetic":"/biˈbiɾu/","extraExplanation":["“ビビる（bibiru）”在日语口语里很常见，语气偏随意/俚语，常见于动漫、游戏、网络聊天等语境；在英语里一般不算正式词汇，多是粉丝圈或跨语言交流时直接借用。","如果你是在英文文章里看到“bibiru”，它通常是在模仿日语表达；正式英文更常用：get scared, freak out, chicken out, panic。"]}
{"word":"bibitory","summary":{"en":"Bibitory means “related to drinking (especially alcohol),” often used in a humorous or formal tone.","zh":"Bibitory 指“与饮酒（尤指酒精）有关的”，常用于幽默或较正式的语气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to drinking alcohol; used humorously or in formal writing","zh":"与饮酒（尤指酒精）有关的；常带幽默或较正式的语气"},"examples":[{"en":"The hotel has a strict bibitory policy: no alcohol in the rooms.","zh":"这家酒店有严格的饮酒规定：房间内禁止饮酒。"},{"en":"After the exam, they went out for some bibitory celebration.","zh":"考试后，他们出去喝点酒庆祝一下。"}]}],"synonyms":["drinking","alcohol-related","boozy"],"phonetic":"/ˈbɪbəˌtɔri/","extraExplanation":["“bibitory”源自拉丁语 *bibere*（喝），和 “imbibe”（饮用）是同源词。它在日常口语里不算常见，更多见于幽默、讽刺或较文雅的表达中，用来把“喝酒”说得更“高级”。","注意不要和 “obituary”（讣告）混淆；拼写和发音都不同。"]}
{"word":"Bibl","summary":{"en":"“bibl.” is an abbreviation most commonly meaning “bibliographic” (about references/bibliography); less commonly it can mean “biblical.”","zh":"“bibl.” 常作缩写，最常见表示“书目（学）的/参考文献相关”；较少情况下可表示“《圣经》的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) bibliographic; related to a bibliography or book references (used in dictionaries, catalogs, and academic citations).","zh":"（缩写）书目（学）的；与参考文献/书目条目相关（常见于词典、图书目录与学术引文中）。"},"examples":[{"en":"See the bibl. note at the end of the article for full references.","zh":"请参见文章末尾的 bibl. 注释以获取完整参考文献。"},{"en":"The catalog lists bibl. details such as author, title, and year.","zh":"目录会列出作者、书名、年份等 bibl. 书目信息。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev.) biblical; related to the Bible (less common; mostly in specialized notes).","zh":"（缩写）《圣经》的；与《圣经》相关（较少见，多用于专业注记）。"},"examples":[{"en":"The term has a bibl. origin, appearing in early English Bible translations.","zh":"这个词源自《圣经》（bibl.），在早期英文《圣经》译本中就出现过。"}]}],"synonyms":["bibliographic","bibliography","references","biblical"],"phonetic":"/ˈbɪbəl/","extraExplanation":["在英文工具书或词典里，\"bibl.\" 常见于条目末尾的“参考书目/延伸阅读”部分，用来提示后面跟着的是书目或引文信息。","在学术写作中更常见的完整形式是 \"bibliography\"（参考文献）或 \"bibliographic\"（书目学的）；\"bibl.\" 多用于节省版面。","如果你想找的是 \"Bible\"（《圣经》）或 \"bib\"（围嘴/运动号码布），告诉我上下文，我可以按正确词条解释。"]}
{"word":"bibl","summary":{"en":"bibl- is a word part meaning “book,” and bibl. can be an abbreviation for “bibliography” or “biblical,” depending on context.","zh":"bibl- 是表示“书”的词根/前缀；bibl. 也可能是“参考文献（bibliography）”或“圣经相关（biblical）”的缩写，取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a prefix/word part meaning “book,” often used in words about books, writing, or printing","zh":"表示“书”的词根/前缀，常用于与书籍、写作或印刷相关的词汇中"},"examples":[{"en":"The word “bibliography” starts with bibl-, meaning it relates to books.","zh":"“bibliography（参考文献/书目）”以 bibl- 开头，表示它与书籍有关。"},{"en":"A “bibliophile” is someone who loves books.","zh":"“bibliophile（爱书者）”指喜欢书的人。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation used in academic writing to mean “bibliography” (a list of books/sources) or “biblical” (related to the Bible), depending on context","zh":"学术写作中的缩写：可表示“bibliography（参考文献/书目）”或“biblical（圣经的/与圣经相关的）”，具体看上下文"},"examples":[{"en":"See bibl. at the end of the article for the full list of sources.","zh":"文章末尾的 bibl. 部分可查看完整的参考来源列表。"},{"en":"The dictionary marks it as a bibl. phrase, meaning it comes from the Bible.","zh":"词典标注它为 bibl. 短语，表示它出自《圣经》。"}]}],"synonyms":["bibli-","book- (meaning-based)"],"phonetic":"/ˈbɪbəl/","extraExplanation":["bibl- 来自希腊语 biblion（“书/卷轴”）。你会在很多与“书”有关的词里看到它：bibliography（书目/参考文献）、bibliophile（爱书者）、bibliotec(h)（图书馆相关，较少见）。","如果你是在论文或词典里看到 “bibl.” 这种带点的形式，它通常是缩写；而 “bibl-” 不带点时更像是构词成分（词根/前缀）。"]}
{"word":"Bible","summary":{"en":"The Bible is Christianity’s sacred book; more broadly, it can mean an authoritative guide in a field (“the bible of …”).","zh":"Bible 通常指基督教《圣经》；也可引申为某领域权威指南（the bible of …）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the sacred book of Christianity, consisting of the Old Testament and the New Testament","zh":"《圣经》：基督教的经典，由《旧约》和《新约》组成"},"examples":[{"en":"She reads the Bible every morning.","zh":"她每天早上读《圣经》。"},{"en":"Many English phrases come from the Bible.","zh":"许多英语短语源自《圣经》。"}]},{"partOfSpeech":"n.","definition":{"en":"a book or guide that is considered the most important or trusted source of information on a topic (often used as: “the bible of …”)","zh":"某领域最权威/最重要的指南或“宝典”（常用结构：the bible of …）"},"examples":[{"en":"For many home cooks, that cookbook is the bible of Italian food.","zh":"对很多家庭厨师来说，那本食谱是意大利菜的“宝典”。"},{"en":"This manual is the bible of our company’s safety rules.","zh":"这本手册是我们公司安全规则的“权威指南”。"}]}],"synonyms":["Scripture","Holy Bible","guide","handbook","reference book"],"phonetic":"/ˈbaɪbəl/","extraExplanation":["在英语里写作 “the Bible” 通常特指基督教《圣经》，首字母大写；如果写作 “a bible” 或 “the bible of something”，多为比喻用法，表示“权威指南/必备书”。","《圣经》对英语文学与文化影响很深，很多常见表达出自其中，例如 “the writing on the wall”（不祥的预兆）、“the Good Samaritan”（乐于助人的人）。使用这些表达时，一般被视为文化典故，不一定带有宗教立场。"]}
{"word":"bible","summary":{"en":"Bible usually means the Christian holy book; it can also mean an authoritative guide in any field.","zh":"Bible 通常指基督教《圣经》；也可引申为某领域的权威指南或“宝典”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the holy book (or collection of books) of Christianity, including the Old Testament and the New Testament","zh":"《圣经》：基督教的圣书（或由多卷书组成的经典），包括《旧约》和《新约》"},"examples":[{"en":"Many families keep a Bible at home.","zh":"许多家庭会在家里放一本《圣经》。"},{"en":"She reads the Bible every morning.","zh":"她每天早上读《圣经》。"}]},{"partOfSpeech":"n.","definition":{"en":"a book that is the most trusted or most important guide about a subject","zh":"（某领域的）权威指南；“宝典”；最被信赖、最重要的参考书"},"examples":[{"en":"This cookbook is my kitchen bible.","zh":"这本食谱是我厨房里的“宝典”。"},{"en":"For many beginners, that book is the bible of basic grammar.","zh":"对许多初学者来说，那本书就是基础语法的“权威指南”。"}]}],"synonyms":["Scripture","Holy Bible","guide","handbook","manual"],"phonetic":"/ˈbaɪbəl/","extraExplanation":["英语里通常写作 the Bible（首字母大写）来指基督教的《圣经》；如果写作 a bible（小写），多用于比喻义，表示“某方面的权威参考书/宝典”。","在文学与文化中，《圣经》常被引用为典故来源（如“the Good Samaritan”“prodigal son”等），理解这些常见典故有助于阅读英文新闻、小说和演讲。"]}
{"word":"Bible belt","summary":{"en":"a U.S. region strongly shaped by Protestant Christian influence","zh":"新教（尤其福音派）影响突出的美国地区"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A region in the southern and parts of the midwestern United States where evangelical Protestant Christianity is especially influential in culture and politics, and where socially conservative values are common.","zh":"美国南部及部分中西部地区的统称，当地福音派新教影响力很强，文化与政治上较常见社会保守价值观。"},"examples":[{"en":"She grew up in the Bible Belt, so church was a big part of community life.","zh":"她在“圣经带”长大，所以教会在社区生活中占很重要的地位。"},{"en":"The candidate adjusted his message for voters in the Bible Belt.","zh":"这位候选人为了争取“圣经带”的选民而调整了自己的表述。"}]}],"synonyms":["the South","evangelical South"],"phonetic":"/ˈbaɪbəl bɛlt/","extraExplanation":["通常指阿拉巴马、密西西比、乔治亚、田纳西、肯塔基、南北卡罗来纳等州，以及周边部分地区；边界并不固定。","这是带有社会文化含义的地理称呼：强调宗教在公共生活中的影响。使用时注意语气与场合，有时会被当作刻板印象或带调侃意味。"],"etymology":"“belt”在英语里可指“地带/带状区域”（如 Rust Belt “铁锈带”）。Bible Belt 这一说法多认为在20世纪早期开始流行，用来概括美国一大片以新教文化占主导的地区。","mnemonic":["把它想成“地图上一条由圣经文化连成的‘带子’”：Bible（圣经）+ Belt（地带/腰带）。","联想其他“XX Belt”地理说法：Rust Belt（铁锈带）、Sun Belt（阳光带），同样是“某种特征很集中的地区”。"]}
{"word":"Bible-as-literature","summary":{"en":"“Bible-as-literature” means studying the Bible mainly for its literary features (story, poetry, style, symbolism) in an academic/critical way.","zh":"“Bible-as-literature”指以学术/批评方式把《圣经》当作文学来研究，重点看故事、诗歌、文体与象征等文学特点。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"an academic or critical approach that studies the Bible for its literary qualities—such as narrative, poetry, themes, symbolism, and style—rather than primarily as religious doctrine.","zh":"一种学术/批评视角：把《圣经》当作文学作品来研究，关注叙事、诗歌、主题、象征与文体等文学特征，而不是主要把它当作宗教教义来解读。"},"examples":[{"en":"In my Bible-as-literature class, we analyzed the Book of Job as a dramatic poem.","zh":"在我的“圣经作为文学”的课程里，我们把《约伯记》当作一首戏剧性诗歌来分析。"},{"en":"A Bible-as-literature reading focuses on characters, plot, and imagery.","zh":"“圣经作为文学”的读法会把重点放在人物、情节和意象上。"},{"en":"She writes about Genesis using a Bible-as-literature approach, comparing it to other ancient creation stories.","zh":"她用“圣经作为文学”的方法讨论《创世记》，并把它与其他古代创世神话作比较。"}]}],"synonyms":["literary study of the Bible","literary approach to the Bible","biblical literary criticism","Bible in literature (related)"],"phonetic":"/ˈbaɪbəl æz ˈlɪtərətʃər/","extraExplanation":["在英语语境里，Bible-as-literature 常见于大学课程名、书名或研究方法描述，强调“文学分析的中立框架”，并不等同于否定信仰；它只是把文本当作文学来阅读。","常讨论的文学体裁包括：叙事（如《创世记》部分段落）、诗歌与智慧文学（如《诗篇》《箴言》《约伯记》）、寓言与比喻（如福音书中的比喻）。","连字符（Bible-as-literature）多用于作定语或标题，以突出这是一个固定概念；作普通短语时也常写作 “Bible as literature”。"]}
{"word":"Bible-based","summary":{"en":"Bible-based describes something grounded in or guided by the Bible.","zh":"Bible-based 指“以《圣经》为基础/依据、受其指导”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of ideas, teaching, values, or materials) based on the Bible; using the Bible as the main source or authority.","zh":"（指思想、教导、价值观或材料）以《圣经》为依据的；以《圣经》作为主要来源或权威的。"},"examples":[{"en":"They run a Bible-based counseling program for families.","zh":"他们为家庭开设一个以《圣经》为基础的辅导项目。"},{"en":"The school says its curriculum is Bible-based.","zh":"这所学校表示其课程体系以《圣经》为基础。"},{"en":"She prefers Bible-based teaching when studying faith.","zh":"她在学习信仰时更喜欢以《圣经》为基础的教导。"}]}],"synonyms":["biblical","scripture-based","faith-based"],"phonetic":"/ˈbaɪbəl beɪst/","extraExplanation":["“Bible-based”通常用连字符，因为它是放在名词前面的复合形容词（如 Bible-based curriculum）。如果放在系动词后面作表语，有时也可写作 Bible based（如 The approach is Bible based），但连字符写法更常见、更清晰。","语境上它常见于宗教教育、教会事工、灵修材料、咨询/辅导（counseling）等领域，强调观点或方法与《圣经》的教导一致。不同群体对“based”理解可能不同：有的指“引用经文作为依据”，有的指“以圣经原则指导实践”。"]}
{"word":"bible-based","summary":{"en":"“Bible-based” means guided by or derived from the Bible’s teachings.","zh":"“Bible-based”指以《圣经》的教导为依据或指导。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Based on the Bible; guided by the teachings, stories, or principles found in Christian Scripture.","zh":"以《圣经》为依据的；以基督教《圣经》的教导、故事或原则为指导的。"},"examples":[{"en":"They run a Bible-based counseling program for families.","zh":"他们为家庭开设了一个以《圣经》为基础的咨询项目。"},{"en":"The school describes its curriculum as Bible-based.","zh":"这所学校将其课程体系描述为以《圣经》为依据的。"},{"en":"She prefers Bible-based lessons when teaching children about values.","zh":"她在给孩子讲价值观时更偏好以《圣经》为基础的课程。"}]}],"synonyms":["biblical","scripture-based","Christian-based","faith-based"],"phonetic":"ˈbaɪbəl beɪst","extraExplanation":["“Bible-based”常用作形容词，出现在宗教教育（Bible-based school/curriculum）、教会机构（Bible-based ministry/organization）或辅导服务（Bible-based counseling）等语境中，强调其理念来源于《圣经》。","拼写上常用连字符（Bible-based）来连接两个部分；在名词前作定语时更常见（a Bible-based program）。在非正式写作中也可能看到不加连字符的形式（Bible based），但规范写法通常加连字符。","语气与立场：该词在英语中往往带有明确的宗教身份或价值取向；在多元场合使用时，可根据语境选择更中性的表达，如 “faith-based (以信仰为基础的)” 或直接说明 “Christian (基督教的)”。"]}
{"word":"Bible-basher","summary":{"en":"A usually derogatory term for someone who aggressively preaches or quotes the Bible.","zh":"对咄咄逼人地传教或动辄引经据典者的贬义称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, usually derogatory) A person who talks about the Bible or Christianity in an intense, forceful, or preachy way, especially someone who tries to persuade others aggressively.","zh":"（非正式，通常带贬义）指过度热衷、咄咄逼人地谈论《圣经》或基督教的人，尤指强行劝人信教、爱说教的人。"},"examples":[{"en":"Some students complained about a Bible-basher handing out pamphlets outside the school gate.","zh":"一些学生抱怨有个“狂热传教者”在校门外发传单。"},{"en":"He didn’t mean to offend her, but calling her a Bible-basher came across as rude.","zh":"他并非想冒犯她，但称她为“Bible-basher”听起来很无礼。"}]}],"synonyms":["religious fanatic","zealot","holy roller","preacher (derog.)"],"phonetic":"/ˈbaɪbəl ˌbæʃɚ/","extraExplanation":["这个词语气很强，常用来表达反感或嘲讽，容易冒犯他人；在正式场合或与宗教相关的敏感语境中应避免使用。","多见于英式英语、澳大利亚英语等口语中；在美式英语里也能理解，但更常见的近义说法包括“religious fanatic / zealot（宗教狂热者）”“overly preachy person（太爱说教的人）”。"]}
{"word":"Bible-centered","summary":{"en":"Bible-centered means giving the Bible the central place in teaching, beliefs, and life decisions.","zh":"Bible-centered 指以《圣经》为核心，把它放在教导、信念与生活抉择的中心位置。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Focused on the Bible as the main source of teaching, values, and guidance (especially in a church, school, or personal faith).","zh":"以《圣经》为核心；把《圣经》作为主要教导、价值观与生活指引来源（常用于教会、学校或个人信仰）。"},"examples":[{"en":"They are looking for a Bible-centered church that teaches Scripture clearly.","zh":"他们在寻找一间以《圣经》为核心、清楚讲解经文的教会。"},{"en":"Our Bible-centered approach encourages students to read the text and apply it to daily life.","zh":"我们以《圣经》为核心的方式鼓励学生阅读经文，并把它应用到日常生活中。"},{"en":"She wants her family to be Bible-centered in how they make decisions.","zh":"她希望家人在做决定时能以《圣经》为中心。"}]}],"synonyms":["Bible-based","scripture-centered","biblical (context-dependent)"],"phonetic":"/ˈbaɪbəl ˌsɛn.tɚd/","extraExplanation":["“Bible-centered”常见于基督教语境（如教会简介、学校办学理念、事工宣言）。它通常强调“以经文本身为权威/基准”，有时也隐含与“以传统、个人感受或社会潮流为主导”相对。","写法上常用连字符：Bible-centered；作表语时也可见不加连字符的写法：The church is Bible centered（较少见，正式写作更推荐加连字符）。","相关近义表达（语气略有差别）：“biblical”更偏“符合圣经原则”；“Bible-based”强调“建立在圣经之上”；“scripture-centered”更正式，强调“经文/圣经文本”。"]}
{"word":"Bible-like","summary":{"en":"Bible-like means ‘similar to the Bible in style, tone, or themes.’","zh":"Bible-like 指“在风格、语气或主题上类似《圣经》的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Similar to the Bible in style, language, themes, or tone (often solemn, moral, formal, or archaic).","zh":"（风格、语言、主题或语气）类似《圣经》的；常指庄严、说教、正式或带古雅腔调的。"},"examples":[{"en":"The speech had a Bible-like rhythm, with short lines and repeated phrases.","zh":"那段演讲有一种“圣经式”的节奏：句子短，并反复使用相同的表达。"},{"en":"He wrote a Bible-like story about temptation and forgiveness.","zh":"他写了一个带“圣经式”主题的故事，讲诱惑与宽恕。"},{"en":"The movie uses Bible-like imagery—light, deserts, and a test of faith.","zh":"这部电影使用了“圣经式”意象——光、荒漠，以及对信仰的考验。"}]}],"synonyms":["biblical","scriptural","Bible-style","solemn","archaic-sounding"],"phonetic":"/ˈbaɪbəl laɪk/","extraExplanation":["“Bible-like”通常用于形容语言风格（如庄重、古风、带道德训诫）或叙事主题（如善恶、救赎、试炼）。是否含褒贬取决于语境：可能表示“庄严有力量”，也可能暗示“过于说教”。","写法上常见带连字符的“Bible-like”。如果指语言风格，有时也会写作“biblical”或“Bible-style”；“Biblical”更常见且更自然。注意“bible”小写时也可泛指“权威指南”（如 a fashion bible），但“Bible-like”通常仍让人联想到《圣经》。"]}
{"word":"Bible-loving","summary":{"en":"Bible-loving describes someone or a group that really loves and values the Bible.","zh":"Bible-loving 用来形容一个人或群体很热爱、重视《圣经》。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a strong love for the Bible; very interested in reading, studying, or living by the Bible.","zh":"热爱《圣经》的；很喜欢阅读、研究或遵循《圣经》教导的。"},"examples":[{"en":"She grew up in a Bible-loving family and went to church every Sunday.","zh":"她在一个热爱《圣经》的家庭里长大，每个星期天都去教会。"},{"en":"The town is known for its Bible-loving community and many small churches.","zh":"这个小镇以热爱《圣经》的社区和许多小教会而闻名。"},{"en":"He gave a Bible-loving answer, quoting a verse to support his point.","zh":"他给出了一个带有《圣经》色彩的回答，用经文来支持自己的观点。"}]}],"synonyms":["Bible-focused","devout","religious","Scripture-loving","pious"],"phonetic":"/ˈbaɪbəl ˌlʌvɪŋ/","extraExplanation":["“Bible-loving”常用连字符（hyphen），因为它是复合形容词，放在名词前更清楚：a Bible-loving family。放在名词后也可以不加连字符：The family is Bible loving（但加连字符也常见）。","语气上通常是中性到正面，表示重视信仰与经文；但在不同语境中也可能被用来强调某种宗教立场。写作时可根据场合选择更中性的表达，如 “devout Christian” 或 “Bible-focused”。"]}
{"word":"bible-related","summary":{"en":"Connected with the Bible or based on it.","zh":"与《圣经》有关的；以《圣经》为基础的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with the Bible (the Christian holy book), or with things that come from it or are based on it.","zh":"与《圣经》（基督教经典）有关的；源自《圣经》或以《圣经》为基础的。"},"examples":[{"en":"The museum has a section of Bible-related art, including paintings of Noah’s Ark.","zh":"这家博物馆有一个“圣经相关”的艺术展区，包括描绘“诺亚方舟”的画作。"},{"en":"She is writing a Bible-related essay about the parables of Jesus.","zh":"她正在写一篇与《圣经》有关的文章，主题是耶稣的比喻。"},{"en":"Some common English idioms are Bible-related, like “the writing on the wall.”","zh":"英语里有些常见习语与《圣经》有关，比如“the writing on the wall（大难临头的预兆）”。"}]}],"synonyms":["biblical","scriptural","Bible-based","religious"],"phonetic":"/ˈbaɪbəl rɪˌleɪtɪd/","extraExplanation":["“bible-related”常用连字符，表示“与《圣经》有关的”这一类属性形容词（类似“health-related”“work-related”）。在正式写作中也可写作“Bible-related”（把Bible首字母大写）。","注意区分：bible-related（与《圣经》有关） vs. biblical（更常见，意为“圣经的/圣经中出现的”，也可引申为“规模巨大/史诗般的”，如“biblical floods（灾难性洪水）”。"]}
{"word":"Bible-style","summary":{"en":"“Bible-style” describes language that imitates the Bible’s old-fashioned, solemn English.","zh":"“Bible-style”指模仿《圣经》那种古雅、庄严英语风格的表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Written or spoken in a style that sounds like the Bible (especially the King James Bible): formal, old-fashioned, and often using words like “thee,” “thou,” “hath,” and “ye.”","zh":"（语言/写作）带有《圣经》（尤其是《钦定版圣经》）风格的：正式、古雅，常用 “thee / thou / hath / ye”等词。"},"examples":[{"en":"The novelist uses Bible-style language to make the story feel ancient and solemn.","zh":"这位小说家用圣经式语言，让故事显得古老而庄严。"},{"en":"He joked in Bible-style English: “Verily, I say unto thee, it is time for dinner.”","zh":"他开玩笑用圣经式英语说：“我实在告诉你，晚饭时间到了。”"},{"en":"The speech had a Bible-style rhythm, with short, powerful lines.","zh":"那篇演讲有一种圣经式的节奏：句子短而有力。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a manner that imitates the Bible’s tone or wording.","zh":"以模仿《圣经》语气或措辞的方式。"},"examples":[{"en":"She wrote the message Bible-style, as if it were a prophecy.","zh":"她把信息写得很圣经风，仿佛是一则预言。"},{"en":"The narrator speaks Bible-style to create a sense of authority.","zh":"叙述者用圣经风的表达来营造权威感。"}]}],"synonyms":["biblical","scriptural","King James–style","archaic (in tone)","solemn"],"phonetic":"/ˈbaɪbəl staɪl/","extraExplanation":["“Bible-style”常指英文《钦定版圣经》（King James Version, 1611）的文体影响：句式庄重、重复排比明显，且保留早期现代英语用法（如 thou/thee/thy、hath、unto、verily）。","它既可用于严肃场景（营造庄严、仪式感），也常用于幽默或讽刺（用“古雅神圣”的语气说日常小事，形成反差）。"]}
{"word":"bibles","summary":{"en":"“Bibles” usually means more than one Bible (often different copies or translations). It can also mean highly authoritative books in a field.","zh":"“Bibles”通常指多本《圣经》（常见于不同版本/译本/装帧）。也可比喻某领域非常权威的书。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of Bible: the holy scriptures of Christianity (and, in some traditions, including the Hebrew Bible/Old Testament).","zh":"Bible 的复数：指基督教的《圣经》（在不同传统中可能包含《希伯来圣经/旧约》等部分）。"},"examples":[{"en":"The library keeps several Bibles for study and reference.","zh":"图书馆保存了几本《圣经》，供学习和查阅。"},{"en":"Different Bibles may use different translations of the same passage.","zh":"不同版本的《圣经》可能对同一段经文有不同的译法。"}]},{"partOfSpeech":"n.","definition":{"en":"Informal: highly respected or authoritative books in a particular field.","zh":"非正式：指某个领域里被高度尊崇、很权威的“宝典/圣经式”的书。"},"examples":[{"en":"For many chefs, that cookbook is one of the bibles of classic French cuisine.","zh":"对许多厨师来说，那本食谱是经典法餐领域的权威宝典之一。"},{"en":"These style guides are the bibles for new editors.","zh":"这些写作指南对新编辑来说就是“圣经式”的权威手册。"}]}],"synonyms":["scriptures","holy books","authoritative guides","standard references"],"phonetic":"/ˈbaɪbəlz/","extraExplanation":["大小写很重要：作为宗教经典时常写作“the Bible”；复数常见为“Bibles”。在指不同译本或不同装帧的版本时也常用复数（e.g., study Bibles, children’s Bibles）。","比喻用法常见结构是“the bible of + 领域”，意思是“该领域最权威的书/指南”。这种用法在日常英语里很普遍，但在正式或宗教语境中要注意尊重与语气。"]}
{"word":"bibless","summary":{"en":"“bibless” is not common. Most likely you meant “Bibles” (plural of Bible).","zh":"“bibless”并不常见；更可能你想写的是“Bibles”（Bible的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended) plural of “Bible”: the Christian holy book (the Old and New Testaments).","zh":"（很可能是你想写的）“Bible”的复数：圣经（基督教经典，包括旧约和新约）。"},"examples":[{"en":"There are several Bibles on the shelf, including a study Bible.","zh":"架子上有好几本圣经，包括一本研读版圣经。"},{"en":"Different Bibles may use different English translations.","zh":"不同版本的圣经可能使用不同的英文译本。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) “bibless”: without a bib (a cloth worn to protect clothing while eating).","zh":"（少见）“bibless”：没戴围嘴/围兜的（围嘴是吃饭时用来保护衣服的布）。"},"examples":[{"en":"The toddler went bibless and quickly got sauce on his shirt.","zh":"小孩没戴围嘴，很快就把酱汁弄到衬衫上了。"}]}],"synonyms":["Scriptures","Holy Bible","bib-less (without a bib)"],"phonetic":"/ˈbaɪbəlz/","extraExplanation":["“Bible”通常大写，因为它常被当作专有名词（特指基督教《圣经》）。当你想表达“很多本圣经”时，用复数“Bibles”。","如果你原本想输入的是“bless”（祝福）或别的词，也可能是拼写错误；你可以告诉我句子，我能帮你确认最合适的词。"]}
{"word":"BiblHeb","summary":{"en":"“BiblHeb” is a written abbreviation for “Biblical Hebrew,” used as a label in dictionaries and academic resources.","zh":"“BiblHeb”是“Biblical Hebrew（圣经希伯来语）”的书面缩写，多用作词典与学术资料中的标签。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation meaning “Biblical Hebrew,” used in dictionaries, academic writing, or language-learning resources to label words, forms, or examples that come from the Hebrew of the Bible (Tanakh/Old Testament).","zh":"“Biblical Hebrew（圣经希伯来语）”的缩写，常见于词典、学术写作或语言学习资料中，用来标注来自《希伯来圣经》（《塔纳赫》/《旧约》）的希伯来语词形、用法或例句。"},"examples":[{"en":"In this lexicon, “BiblHeb” marks forms found in the Hebrew Bible.","zh":"在这本词典里，“BiblHeb”用来标注出现在《希伯来圣经》中的词形。"},{"en":"The note says the term is BiblHeb, not Modern Hebrew.","zh":"注释说明这个词属于圣经希伯来语（BiblHeb），不是现代希伯来语。"}]}],"synonyms":["Biblical Hebrew","BH"],"phonetic":"/ˌbɪbəl ˈhiːbruː/","extraExplanation":["“BiblHeb”主要出现在词典条目、语料库标签、语法书的缩写表里，属于“写出来给读者看的标签”，口语中通常直接说“Biblical Hebrew”。","需要注意文化与学术语境：很多英语资料会写“Hebrew Bible”来称呼犹太传统中的经文；在基督教语境下也常见“Old Testament”。两者有重叠但不完全等同，缩写标签一般只是在说明语言来源。"]}
{"word":"Biblic","summary":{"en":"“Biblic” is a rare adjective meaning “related to the Bible,” similar to “biblical.”","zh":"“Biblic”是较少见的形容词，意思是“与《圣经》有关的”，类似“biblical”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Bible; biblical (rare/less common form, often seen in academic writing).","zh":"与《圣经》有关的；圣经的（较少见的形式，常见于学术语境）。"},"examples":[{"en":"The professor specializes in Biblic languages such as Hebrew and Greek.","zh":"这位教授专攻圣经语言，例如希伯来语和希腊语。"},{"en":"They discussed Biblic themes like exile, covenant, and redemption.","zh":"他们讨论了流放、圣约与救赎等圣经主题。"}]}],"synonyms":["biblical","scriptural"],"phonetic":"/ˈbɪblɪk/","extraExplanation":["“Biblic”在现代英语里比较少见，更常用的形式是“biblical”。在宗教研究与古典/神学相关的学术写作中，偶尔会看到“Biblic”用来修饰“studies / literature / languages”等。","如果你是在文章里看到“Biblic”，大多数情况下可以理解为“biblical”的同义替换；但日常写作或考试中通常建议用“biblical”，更自然也更常见。"]}
{"word":"biblic","summary":{"en":"“Biblic” is a rare adjective meaning “biblical; related to the Bible.”","zh":"“biblic”是一个少见的形容词，意思是“biblical；与《圣经》有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Bible (very uncommon form); in modern English, the usual word is “biblical.”","zh":"与《圣经》有关的（非常少见的形式）；现代英语中更常用的是 “biblical”。"},"examples":[{"en":"The article uses biblic sources to explain the story.","zh":"这篇文章用与《圣经》相关的来源来解释这个故事。"},{"en":"Many people prefer the spelling “biblical” in formal writing.","zh":"在正式写作中，很多人更喜欢用拼写“biblical”。"}]}],"synonyms":["biblical","scriptural"],"phonetic":"ˈbɪblɪk","extraExplanation":["“biblic”在当代英语里很少见，常被视为“biblical”的非常规/过时写法或拼写变体。正式写作、学术文章、新闻等场合通常用“biblical”。","常见搭配：biblical story（圣经故事）、biblical times（圣经时代）、biblical scholar（圣经学者）。"]}
{"word":"Biblical","summary":{"en":"Biblical means connected to the Bible or resembling it in language or scale (often implying something very dramatic or extreme).","zh":"Biblical 指与《圣经》有关，或具有《圣经》式语言与故事特点；也可比喻“规模巨大、极为震撼/极端”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to the Bible (the sacred scriptures of Judaism and Christianity) or to the language, stories, and style found in it.","zh":"与《圣经》（犹太教与基督教的经典）有关的；或指具有《圣经》故事、语言与风格特点的。"},"examples":[{"en":"The museum has a collection of Biblical manuscripts.","zh":"这家博物馆收藏了一批《圣经》手稿。"},{"en":"Many Western paintings include Biblical scenes like the Garden of Eden.","zh":"许多西方绘画包含《圣经》场景，比如伊甸园。"},{"en":"His speech used Biblical language, such as “let there be light.”","zh":"他的演讲用了《圣经》式的语言，比如“要有光”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Very large, dramatic, or extreme—like something from the Bible; often used for strong emphasis.","zh":"（比喻）巨大、震撼或极端得像《圣经》里发生的一样；常用于强调。"},"examples":[{"en":"They faced Biblical floods after days of heavy rain.","zh":"连日暴雨后，他们遭遇了“圣经级”的洪水。"},{"en":"The cleanup was a Biblical task—there was mess everywhere.","zh":"清理工作堪称“圣经级”的艰巨——到处都是一团糟。"}]}],"synonyms":["scriptural","bible-based","biblical (in style)","epic (informal, for the exaggerated sense)"],"phonetic":"/ˈbɪblɪkəl/","extraExplanation":["“Biblical”在英语里通常大写（Biblical）来强调与《圣经》文本或传统直接相关；小写（biblical）有时也会出现，语气更偏一般形容或比喻用法。","在新闻或口语中说“Biblical floods/heat/plague”是一种夸张修辞，用来表达“规模异常大/后果严重”，但也可能带有宗教文化色彩；正式写作中可改用“severe/record-breaking/extreme”更中性。"]}
{"word":"biblical","summary":{"en":"Biblical means “related to the Bible,” and it can also describe something that feels grand, old-fashioned, or extremely large like stories in the Bible.","zh":"biblical 表示“与《圣经》有关的”，也可引申为“带有圣经式庄重/古雅风格的”，或夸张地指“规模巨大、像圣经故事般”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Bible (the sacred scriptures of Christianity and Judaism).","zh":"与《圣经》有关的；出自《圣经》的。"},"examples":[{"en":"She studies biblical history in college.","zh":"她在大学学习圣经历史。"},{"en":"The museum has a collection of biblical manuscripts.","zh":"这家博物馆收藏了一批圣经手稿。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of language, events, or style) Resembling the Bible—formal, archaic, or grand in tone.","zh":"（语言、事件或风格）带有圣经式的；语气庄重、古雅或宏大的。"},"examples":[{"en":"The speech used biblical-sounding phrases like “Let there be…”","zh":"这篇演讲用了听起来很“圣经式”的表达，比如“要有……”"},{"en":"After the storm, the flooding looked biblical.","zh":"暴风雨后，洪水看起来像“圣经里的灾难”一样。"}]}],"synonyms":["scriptural","bible-related","biblically inspired"],"phonetic":"/ˈbɪb.lɪ.kəl/","extraExplanation":["“biblical”常见两种用法：一是字面意义“与《圣经》相关”；二是引申为“像《圣经》那样宏大/古雅/灾难性的”。例如新闻里说“biblical flooding”，通常不是指宗教，而是强调规模非常大。","文学与文化里，《圣经》（尤其是《钦定版圣经》King James Bible）的英语表达影响很深，因此“biblical language/style”常暗示用词更庄严、句式更古典。","常见搭配：biblical studies（圣经研究）、biblical scholars（圣经学者）、biblical times（圣经时代）、biblical quotation（圣经引文）、biblical proportions（规模巨大；夸张说法）。"]}
{"word":"biblical-legal","summary":{"en":"“Biblical-legal” describes laws or legal ideas based on the Bible, or discussions that connect biblical texts with law.","zh":"“biblical-legal”指以《圣经》律法与法律观念为基础（或受其影响）的，或把圣经文本与法律联系起来的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Based on, derived from, or strongly shaped by laws and legal ideas found in the Bible (especially the Hebrew Bible/Old Testament), often used when discussing religion, ethics, and legal history.","zh":"以《圣经》（尤其《希伯来圣经/旧约》）中的律法与法律观念为依据或深受其影响的；常用于讨论宗教、伦理与法律史。"},"examples":[{"en":"The article compares biblical-legal rules about theft with modern criminal law.","zh":"这篇文章把关于盗窃的圣经律法规则与现代刑法作比较。"},{"en":"Some scholars study how biblical-legal principles shaped later Western legal traditions.","zh":"一些学者研究圣经律法原则如何影响后来的西方法律传统。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to both the Bible and legal practice at the same time (for example, a discussion that uses biblical texts in a legal argument).","zh":"同时与《圣经》和法律实践有关的（例如在法律论证中引用圣经文本的讨论）。"},"examples":[{"en":"The court case raised biblical-legal arguments about marriage and family.","zh":"该案件提出了关于婚姻与家庭的“圣经—法律”论证。"},{"en":"He wrote a biblical-legal commentary that reads scripture alongside statutes.","zh":"他写了一部“圣经—法律”评注，把经文与成文法并读。"}]}],"synonyms":["biblical law–based","scriptural-legal","Bible-based legal","biblical jurisprudential"],"phonetic":"/ˈbɪblɪkəl ˈliɡəl/","extraExplanation":["“biblical-legal”是比较学术化的复合形容词，常见于法律史、神学、宗教研究写作中；日常英语更常用“biblical law（圣经律法）”“biblical legal tradition（圣经法律传统）”。","语境上它常指《出埃及记》《利未记》《申命记》等书卷中的律例（如“摩西律法”），也可能泛指以圣经道德观支撑的法律论述。"]}
{"word":"biblical-literary","summary":{"en":"Connected to both the Bible and literature, especially in style or interpretation.","zh":"与《圣经》和文学都相关，常指风格或解读方式的结合。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Bible (especially its language, stories, or themes) and to literature; used to describe a style or analysis that connects biblical elements with literary writing.","zh":"与《圣经》（尤其是其语言、故事或主题）以及文学有关的；用于描述把圣经元素与文学写作联系起来的风格或研究角度。"},"examples":[{"en":"The novel uses a biblical-literary style, with solemn rhythms and moral conflict.","zh":"这部小说采用了“圣经式—文学式”的风格，节奏庄重，并呈现道德冲突。"},{"en":"In class we did a biblical-literary reading of the poem, focusing on its imagery of exile and redemption.","zh":"课堂上我们用“圣经—文学”的方式解读这首诗，重点讨论其中关于流亡与救赎的意象。"}]}],"synonyms":["biblical and literary","Bible-and-literature","biblically inflected","scriptural-literary"],"phonetic":"/ˈbɪb.lɪ.kəl ˈlɪt̬.əˌrɛr.i/","extraExplanation":["“biblical-literary”不是特别固定的词条，更常见于学术写作或评论语境中，用来表达“圣经传统 + 文学表达/文学研究”的结合。","写作时是否加连字符取决于位置：放在名词前作定语时常用连字符（biblical-literary themes）；放在系动词后作表语时也可不加（The approach is biblical and literary / biblical-literary）。","在英语里更常见的替代表达包括：biblical and literary, biblically inflected literary style, Bible-and-literature studies。"]}
{"word":"biblical-psychological","summary":{"en":"Biblical-psychological describes something that connects the Bible with psychology, often in counseling or academic discussion.","zh":"biblical-psychological 指把《圣经》与心理学联系或结合起来的观点/方法，常见于辅导或学术讨论。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both the Bible (biblical ideas, texts, or faith traditions) and psychology (the study of mind and behavior), especially when the two are discussed together in counseling, education, or research.","zh":"同时与《圣经》（经文、信仰传统或神学观念）和心理学（心智与行为的研究）相关的，尤指把两者结合来讨论、辅导、教学或研究的。"},"examples":[{"en":"The program offers a biblical-psychological approach to marriage counseling.","zh":"这个项目提供一种“圣经—心理学”的婚姻辅导方法。"},{"en":"Her paper compares biblical-psychological views of guilt and forgiveness.","zh":"她的论文比较了“圣经—心理学”对内疚与宽恕的看法。"},{"en":"Some churches use biblical-psychological resources to support mental health.","zh":"一些教会使用“圣经—心理学”的资源来支持心理健康。"}]}],"synonyms":["biblically informed psychological","faith-based psychological","biblical and psychological","integrative (faith and psychology)"],"phonetic":"/ˈbɪb.lɪ.kəl ˌsaɪ.kəˈlɑː.dʒɪ.kəl/","extraExplanation":["“biblical-psychological”不是非常固定的常用词条，更像是临时组合的复合形容词，用来说明“从圣经与心理学两个角度/把两者结合”的立场。写作中也常见类似结构，如“biblical-theological（圣经—神学的）”“clinical-psychological（临床—心理学的）”。","在辅导语境里，这类表达往往指“整合式”或“兼顾信仰与心理学”的方法，但不同机构对“整合”的程度与方式差异很大：有人更强调经文与牧养，有人更强调循证心理治疗，再尝试与信仰语言对话。阅读或使用时可留意作者/机构的具体定义。"]}
{"word":"biblical-sounding","summary":{"en":"“Biblical-sounding” describes words or writing that sounds like the Bible—formal, solemn, and old-fashioned.","zh":"“biblical-sounding”指语言或文风听起来像《圣经》——正式、庄重、略古典。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a style that resembles the language, tone, or imagery of the Bible (often formal, solemn, old-fashioned, or poetic).","zh":"听起来像《圣经》语言风格的（常带有庄重、古典、诗意或带有宗教意味的语气）。"},"examples":[{"en":"The narrator uses biblical-sounding phrases like “And it came to pass.”","zh":"叙述者用了听起来很“圣经范儿”的句子，比如“And it came to pass（事情就这样成了）”。"},{"en":"His speech was biblical-sounding, full of warnings and blessings.","zh":"他的讲话带着圣经式的语气，充满警告与祝福。"},{"en":"The poem feels biblical-sounding because of its grand, solemn rhythm.","zh":"这首诗因为宏大、庄严的节奏而显得很“圣经式”。"}]}],"synonyms":["scriptural-sounding","solemn","archaic-sounding","prophetic","religious-sounding"],"phonetic":"/ˈbɪb.lɪ.kəl ˈsaʊn.dɪŋ/","extraExplanation":["“biblical-sounding”常用来描述语言风格，不一定表示内容真的来自《圣经》，也不一定表达说话者真的有宗教立场；很多时候只是说它“像《钦定版圣经》（King James Bible）那种古雅、庄重的英文”。","书写上通常不需要大写（biblical-sounding）；但如果你特指《圣经》作为书名或特定译本，Bible / Biblical 可能会大写。","常见的“圣经式”特征包括：古老表达（thou/thee/ye 等）、排比与重复、强烈的善恶对比、预言/训诫式语气，以及宏大意象（光、洪水、旷野、审判等）。"]}
{"word":"biblical-studies-related","summary":{"en":"“Biblical-studies-related” means connected to the academic field of Biblical studies.","zh":"“biblical-studies-related”意为“与圣经研究这一学术领域有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with or relevant to Biblical studies (the academic study of the Bible, its languages, history, and interpretation)","zh":"与“圣经研究”（对《圣经》及其语言、历史背景与诠释的学术研究）有关的；圣经研究相关的"},"examples":[{"en":"The library has a section for biblical-studies-related books on Hebrew and Greek.","zh":"图书馆有一个专区，收藏与圣经研究相关的希伯来语和希腊语书籍。"},{"en":"She attended a biblical-studies-related seminar on the Dead Sea Scrolls.","zh":"她参加了一场与圣经研究相关、主题为死海古卷的研讨会。"},{"en":"I’m looking for biblical-studies-related articles, not devotional materials.","zh":"我在找与圣经研究相关的文章，而不是灵修材料。"}]}],"synonyms":["related to biblical studies","biblical studies–related","Bible-scholarship-related","biblical scholarship related"],"phonetic":"/ˈbɪblɪkəl ˈstʌdiz rɪˌleɪtɪd/","extraExplanation":["“Biblical studies”通常指学术领域（常见于大学、神学院或研究机构），强调文本批判、历史背景、原文语言（希伯来语、亚兰语、希腊语）与解释传统；不一定等同于个人信仰层面的“读经/灵修”。","写作中也常见更自然的表达：“related to biblical studies / biblical studies–related (hyphenated as a compound adjective before a noun)”。例如：a biblical studies–related course。","相关常见术语（可帮助检索资料）：exegesis（释经）、hermeneutics（诠释学）、textual criticism（文本批判）、Septuagint/LXX（七十士译本）、Second Temple Judaism（第二圣殿时期犹太教）。"]}
{"word":"Biblicality","summary":{"en":"Biblicality means the quality of being biblical—closely aligned with the Bible in content or style.","zh":"Biblicality 指“圣经性”，即在内容或风格上与《圣经》高度一致的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being biblical; conformity to the Bible in language, teaching, style, or content","zh":"圣经性；（语言、教导、风格或内容）符合《圣经》、具有圣经特征的性质"},"examples":[{"en":"The pastor emphasized the biblicality of the sermon by grounding every point in Scripture.","zh":"牧师强调讲道的圣经性，把每个要点都建立在经文之上。"},{"en":"Scholars debated the biblicality of the term because it does not appear in the Bible itself.","zh":"学者们讨论这个术语的圣经性，因为它本身并不出现在《圣经》中。"},{"en":"Some readers look for biblicality in translations, preferring wording that sounds close to traditional Bible English.","zh":"一些读者在译本中追求“圣经性”，更偏好听起来接近传统圣经英语的措辞。"}]}],"synonyms":["biblical nature","faithfulness to Scripture","scriptural basis","scriptural fidelity"],"phonetic":"/ˌbɪb.lɪˈkæl.ə.ti/","extraExplanation":["“biblicality”在日常英语中不算常见，更常见的表达是“biblical basis”（圣经依据）、“biblical authenticity”（圣经真实性）或“faithfulness to Scripture”（忠于经文）。","它多用于神学、讲道评估、或宗教研究语境，讨论某种观点/做法/措辞与《圣经》文本和教义传统是否一致。"]}
{"word":"biblicality","summary":{"en":"Biblicality means how biblical something is—its faithfulness to the Bible, or a biblical tone/style.","zh":"Biblicality 指某事物“有多圣经”——与《圣经》的一致程度，或带有圣经式的语气/风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being biblical; the degree to which something matches, reflects, or is based on the Bible","zh":"“圣经性”；某事物与《圣经》一致、呼应或以《圣经》为依据的程度"},"examples":[{"en":"Scholars debated the biblicality of the story’s details.","zh":"学者们讨论了这个故事细节的“圣经性”。"},{"en":"The committee questioned the biblicality of that teaching.","zh":"委员会质疑那种教导是否符合《圣经》。"}]},{"partOfSpeech":"n.","definition":{"en":"a biblical tone or style, especially in language, themes, or imagery","zh":"（尤指语言、主题或意象上的）“圣经式”语气或风格"},"examples":[{"en":"The novel’s biblicality comes from its references to exile and redemption.","zh":"这部小说的“圣经式”气质来自它对流放与救赎的引用。"},{"en":"The speech had a strong biblicality, full of solemn, rhythmic phrasing.","zh":"这篇演讲带有强烈的圣经式风格，措辞庄重且富有节奏感。"}]}],"synonyms":["biblical basis","faithfulness to the Bible","scripturality","scriptural authenticity","biblical tone"],"phonetic":"/ˌbɪb.lɪˈkæl.ə.ti/","extraExplanation":["“biblicality”较少见，常见于神学讨论或文学评论里，用来评价某种观点/做法是否“符合圣经”（有时也带有立场色彩）。在日常英语中，人们更常说“Is it biblical?”或用“biblical basis / biblical accuracy / faithfulness to the Bible”等表达。"]}
{"word":"Biblically","summary":{"en":"“Biblically” means “in a way related to the Bible” or “according to what the Bible says.”","zh":"“Biblically”表示“与《圣经》相关地”或“按《圣经》所说/依据《圣经》地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to the Bible (its stories, teachings, language, or worldview).","zh":"以《圣经》为依据地；与《圣经》（故事、教义、用语或世界观）相关地。"},"examples":[{"en":"The phrase is used biblically to mean forgiveness and mercy.","zh":"这个短语在《圣经》语境里通常指宽恕与怜悯。"},{"en":"Biblically, the word “covenant” is an important kind of promise between God and people.","zh":"从《圣经》的角度看，“covenant（盟约）”是一种上帝与人之间非常重要的承诺。"}]},{"partOfSpeech":"adv.","definition":{"en":"According to the Bible; based on what the Bible says (often used when discussing religious beliefs or moral views).","zh":"按《圣经》的说法；依据《圣经》所说（常用于讨论信仰或道德观点）。"},"examples":[{"en":"Biblically, many people believe marriage is a sacred commitment.","zh":"按《圣经》观点，许多人认为婚姻是一种神圣的承诺。"},{"en":"Is that idea biblically supported, or is it just tradition?","zh":"这个观点有《圣经》依据吗，还是只是传统说法？"}]}],"synonyms":["scripturally","according to the Bible","from a biblical perspective"],"phonetic":"/ˈbɪblɪkli/","extraExplanation":["“biblically”常用于两种语气：\n1）中性学术：表示“在《圣经》文本/语境中如何使用或理解某个词或概念”（如 biblically speaking）。\n2）立场表达：表示“以《圣经》为权威依据”。在跨文化交流中，这种用法可能涉及个人信仰，讨论时可用更缓和的表达（如 from a biblical perspective）。","常见搭配：biblically accurate（符合《圣经》记载的）、biblically based（以《圣经》为基础的）、biblically speaking（从《圣经》角度来说）。"]}
{"word":"biblically","summary":{"en":"“Biblically” means “in a Bible-related way” or “according to the Bible.”","zh":"“biblically”表示“与《圣经》相关地”或“按《圣经》来（依据经文）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to the Bible, its language, stories, teachings, or worldview.","zh":"以《圣经》为依据；与《圣经》的语言、故事、教导或世界观有关地。"},"examples":[{"en":"The phrase is used biblically to describe sacrifice and forgiveness.","zh":"这个短语在《圣经》语境中用来描述牺牲与宽恕。"},{"en":"Biblically, the number forty often suggests a period of testing.","zh":"在《圣经》中，“四十”常常暗示一段考验期。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that is consistent with, or based on, the Bible (often used in religious discussion to mean “according to Scripture”).","zh":"按《圣经》的标准；符合《圣经》的（宗教讨论中常指“按经文”）。"},"examples":[{"en":"They argued that the practice is not biblically supported.","zh":"他们认为这种做法缺乏《圣经》依据。"},{"en":"He tried to answer the question biblically rather than politically.","zh":"他试图用《圣经》的角度来回答问题，而不是从政治角度。"}]}],"synonyms":["scripturally","according to Scripture","in biblical terms","from a biblical perspective"],"phonetic":"/ˈbɪblɪkli/","extraExplanation":["“biblically”常见于学术写作、讲道、神学讨论或文学评论，表示“在《圣经》文本/传统的语境里”或“按经文的理解”。不同宗派或译本对某段经文的解释可能不同，所以它有时也暗含“从某种特定解经立场出发”。","文学中常说某个意象是“biblically charged”（带有强烈圣经意味），例如“the fall（堕落）”“the flood（洪水）”“the prodigal son（浪子回头）”等典故会让读者联想到《创世记》或《路加福音》。"]}
{"word":"Biblicism","summary":{"en":"Biblicism means a strong reliance on the Bible as authority—either in beliefs/ideas, in very literal Bible interpretation, or (less commonly) in using Bible-style expressions.","zh":"Biblicism 指强烈以《圣经》为权威的倾向：可指以圣经为依据的信念/主张、偏字面化的圣经解读方式，或（较少见）圣经式措辞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A belief, attitude, or movement that bases ideas (especially moral, social, or political views) strongly on the Bible.","zh":"一种强烈以《圣经》为依据的信念、态度或思潮（尤指道德、社会或政治观点）。"},"examples":[{"en":"Some voters see his platform as a form of biblicism, grounded in Scripture.","zh":"一些选民认为他的政纲是一种“圣经本位”的立场，建立在经文之上。"},{"en":"Critics argue that biblicism can oversimplify complex public issues.","zh":"批评者认为，“圣经本位”可能会把复杂的公共议题过度简化。"}]},{"partOfSpeech":"n.","definition":{"en":"An approach to reading the Bible that treats the text as the final authority and often emphasizes a very literal interpretation.","zh":"一种解读《圣经》的方式：把经文视为最终权威，并常常强调非常字面（直译式）的理解。"},"examples":[{"en":"In that church tradition, biblicism shaped how sermons were written and preached.","zh":"在那个教会传统中，“圣经本位”的倾向影响了讲道的写作与宣讲方式。"},{"en":"Her biblicism led her to prefer direct quotations over modern paraphrases.","zh":"她的“圣经本位”使她更偏好直接引用经文，而不是现代意译。"}]},{"partOfSpeech":"n.","definition":{"en":"A biblical word or expression used in speech or writing; a Bible-based phrase.","zh":"（较少见）源自《圣经》的用语或表达；带有《圣经》色彩的措辞。"},"examples":[{"en":"The novel is full of biblicisms like “the promised land.”","zh":"这部小说充满了“应许之地”等圣经式表达。"},{"en":"His speech used biblicisms to sound solemn and traditional.","zh":"他的演讲用了不少圣经式措辞，让语气显得庄重而传统。"}]}],"synonyms":["scripturalism","literalism (in Bible interpretation)","Bible-centered approach"],"phonetic":"/ˈbɪb.ləˌsɪz.əm/","extraExplanation":["“Biblicism”常出现在宗教研究、神学讨论和社会政治评论中，语气可能中性也可能带批评意味；是否褒贬通常取决于说话者立场。","与“biblical”（圣经的）不同，“biblicism”更强调一种立场/方法：把《圣经》作为核心依据或最高权威。","在语言学/文学研究里，复数形式“biblicisms”更常用来指“圣经语汇/圣经典故式表达”。"]}
{"word":"biblicism","summary":{"en":"A biblicism is an expression taken from, or modeled on, the language of the Bible.","zh":"biblicism 指源自《圣经》或模仿其语言风格的表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A word, phrase, or style of expression that comes from the Bible or imitates Biblical language (often sounding old-fashioned or formal).","zh":"源自《圣经》或模仿《圣经》语言风格的词语、短语或表达方式（常带有古雅、庄重的语气）。"},"examples":[{"en":"Phrases like “the powers that be” are common biblicisms in English.","zh":"像“the powers that be（当权者）”这样的短语在英语中就是常见的圣经式表达。"},{"en":"The novel uses biblicisms to give the narration a solemn, prophetic tone.","zh":"这部小说使用圣经式措辞，让叙述带有庄严、预言般的语气。"}]}],"synonyms":["biblical expression","biblical idiom","scriptural phrase","biblical phrasing"],"phonetic":"/ˈbɪb.lɪˌsɪz.əm/","extraExplanation":["“biblicism”常出现在语言学、文学评论或翻译讨论中，用来说明某些英语表达带有《钦定版圣经》（King James Version, 1611）那种古典、庄重的腔调。","常见的英语biblicisms例子包括：“the salt of the earth（世上的盐/社会中最朴实可靠的人）”“a thorn in the flesh（眼中钉/肉中的刺）”“the writing on the wall（不祥的预兆）”“the promised land（应许之地）”。这些短语在现代英语里多已变成固定习语。","在中文语境里，可把biblicism理解为“带有圣经色彩的措辞”。在阅读英美文学（如梅尔维尔《白鲸》、斯坦贝克作品等）时，经常会用biblicisms来营造道德审判、救赎、预言或仪式感的氛围。"]}
{"word":"Biblicist","summary":{"en":"A Biblicist is someone (or an approach) that is strongly Bible-centered, often implying a literal or text-only basis for belief.","zh":"Biblicist指以《圣经》为核心依据的人或立场，常暗示偏向字面或“只按经文”的信仰依据。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who bases their beliefs mainly on the Bible, often treating it as the highest authority (sometimes with a strong emphasis on literal interpretation)","zh":"（常指）以《圣经》为主要信仰依据的人；往往把《圣经》视为最高权威（有时强调字面解读）"},"examples":[{"en":"Some critics call him a Biblicist because he argues that every doctrine must be proved from the Bible.","zh":"一些批评者称他为“Biblicist”，因为他主张每一条教义都必须从《圣经》中找到依据。"},{"en":"As a Biblicist, she prefers sermons that focus on the text itself rather than personal opinions.","zh":"作为一名Biblicist，她更喜欢专注于经文本身、而不是个人观点的讲道。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to a Biblicist approach; strongly Bible-centered (often implying literalism)","zh":"（态度/方法）以《圣经》为中心的；（常含）偏向字面主义解读的"},"examples":[{"en":"He takes a Biblicist view of the story, insisting it should be read as history.","zh":"他以Biblicist的方式看待这个故事，坚持应当把它当作历史来阅读。"},{"en":"The debate became tense when a Biblicist interpretation clashed with a more symbolic reading.","zh":"当Biblicist式的解释与更象征性的解读发生冲突时，辩论变得紧张起来。"}]}],"synonyms":["biblical literalist","literalist","scripturalist","Bible-centered"],"phonetic":"/ˈbɪblɪsɪst/","extraExplanation":["在英语语境里，Biblicist常由他人贴标签使用，语气可能中性也可能带批评意味（暗示“过于字面、忽视传统/历史背景/学术研究”）。","它不同于Christian（基督徒，范围更广）或Evangelical（福音派，强调传福音与个人悔改等）；Biblicist更强调“以圣经文本为最终依据”的方法立场。"]}
{"word":"biblicist","summary":{"en":"A biblicist is someone who treats the Bible as the highest authority—often interpreting it very literally; less commonly, it can mean a Bible scholar.","zh":"biblicist 指把《圣经》视为最高权威、常偏字面解释的人；较少见时也可指圣经研究学者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who strongly believes the Bible is the highest (or only) authority in religion and should be followed very literally; someone who practices or supports “biblicism.”","zh":"（宗教）圣经至上主义者；强调《圣经》是最高（甚至唯一）权威、并倾向按字面理解与遵行的人"},"examples":[{"en":"Some critics call him a biblicist because he insists every doctrine must be stated explicitly in the Bible.","zh":"一些批评者称他为“圣经至上主义者”，因为他坚持每一条教义都必须在《圣经》中明确写出。"},{"en":"She is a biblicist in her approach to ethics, quoting scripture as the final standard.","zh":"她在伦理问题上采取“圣经至上”的立场，把经文当作最终标准来引用。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a scholar who studies the Bible closely, especially through detailed interpretation and textual analysis.","zh":"（较少见）圣经研究者；专门从事《圣经》细读、诠释与文本分析的学者"},"examples":[{"en":"As a biblicist, he compared different translations to clarify a difficult passage.","zh":"作为一名圣经研究者，他对比不同译本来澄清一段难解的经文。"}]}],"synonyms":["biblicism supporter","scripturalist","Bible literalist"],"phonetic":"/ˈbɪblɪsɪst/","extraExplanation":["“biblicist”在当代英语里常带有立场色彩：有时是自称（强调回到经文本身），有时是批评（暗示过度字面化、忽视传统/神学推理/历史语境）。具体褒贬通常取决于说话者所属的宗派与语境。","相关概念：biblicism（圣经至上主义）；区别于“fundamentalist（基要主义者）”——两者常重叠但不完全等同。"]}
{"word":"Biblicistic","summary":{"en":"“Biblicistic” means strictly (often literally) based on the Bible; sometimes a critical label for over-literal Bible-based reasoning.","zh":"“Biblicistic”指严格甚至字面化地以《圣经》为依据；有时是对过度“圣经至上”推理的批评性说法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a strict, often literal approach to the Bible; strongly based on biblical wording, ideas, or authority (sometimes used critically).","zh":"（常指）以《圣经》为绝对依据、严格甚至字面化解读《圣经》的；带有强烈“圣经至上”色彩的（有时含批评意味）。"},"examples":[{"en":"His arguments are biblicistic, quoting verses as final proof.","zh":"他的论证很“圣经至上”，把经文引用当作最终证据。"},{"en":"The group takes a biblicistic view of morality.","zh":"这个团体对道德采取一种严格按《圣经》解释的观点。"},{"en":"Some scholars criticize a biblicistic reading that ignores historical context.","zh":"一些学者批评那种忽视历史语境的“字面化圣经解读”。"}]}],"synonyms":["Bible-based","literalist","fundamentalist (sometimes)","scriptural"],"phonetic":"/ˌbɪb.lɪˈsɪs.tɪk/","extraExplanation":["“Biblicistic”常见于宗教研究、神学讨论或评论文章里，语气可能中性也可能带贬义：中性时指“以圣经为核心依据”，带批评时多指“过度字面化、把经文当作唯一权威而忽略传统、理性或历史语境”。","词形来源于 Bible（圣经）+ -istic（……式的/……倾向的）。与“biblical（圣经的）”相比，“biblicistic”更强调态度或方法（尤其是严格、字面、排他性的倾向）。"]}
{"word":"biblicistic","summary":{"en":"Biblicistic means “Bible-style” in language, or “strongly text/literal-focused” in biblical interpretation.","zh":"biblicistic 指“圣经体/圣经风格”的语言，或指一种强调经文字句、偏字面解读的圣经诠释取向。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"In the style of the Bible; using vocabulary, imagery, or sentence patterns that sound like biblical English.","zh":"具有《圣经》风格的；用词、意象或句式带有《圣经》英语色彩的。"},"examples":[{"en":"The novelist uses biblicistic language to give the story a solemn tone.","zh":"这位小说家用带有圣经风格的语言，让故事更庄严。"},{"en":"His speech sounded biblicistic, full of phrases like “let there be” and “thou shalt.”","zh":"他的演讲听起来很“圣经体”，充满了“let there be（要有……）”“thou shalt（你当……）”之类的表达。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to biblical interpretation that relies heavily on the exact wording of the Bible (often suggesting a very literal or text-focused approach).","zh":"与“以《圣经》字句为核心”的解读有关的（常暗示较强调字面、文本中心的方式）。"},"examples":[{"en":"Some critics call the argument biblicistic because it treats one verse as the final answer.","zh":"一些评论者认为这种论证过于“经文字句化”，因为它把某一节经文当作最终答案。"},{"en":"The article warns against a biblicistic reading that ignores historical context.","zh":"文章提醒要避免一种忽视历史背景的“只盯字句”的圣经式解读。"}]}],"synonyms":["biblical","scriptural","Bible-style","KJV-style","literalist (context-dependent)"],"phonetic":"/ˌbɪb.lɪˈsɪs.tɪk/","extraExplanation":["“biblicistic”在宗教研究/神学语境里有时带一点评价色彩：可能是在批评某种“只引用经文原句、忽略传统解释或历史语境”的做法。","在文学/写作语境里，它更多是中性描述“像《钦定版圣经》(King James Version) 那样的古雅措辞与节奏”。常见的“圣经腔”词包括 thou, thee, shalt, yea 等。"]}
{"word":"biblico","summary":{"en":"Biblical means “related to the Bible,” and it can also mean “extremely large or dramatic” (often: biblical proportions).","zh":"biblical 表示“与《圣经》有关的”，也可引申为“极其巨大或极具戏剧性的”（常见：biblical proportions）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Bible or to the stories, language, and ideas found in the Bible.","zh":"与《圣经》有关的；出自《圣经》故事、语言或观念的。"},"examples":[{"en":"The museum has a collection of biblical manuscripts.","zh":"这家博物馆收藏了一批圣经手稿。"},{"en":"The novel uses biblical imagery, like floods and deserts.","zh":"这部小说使用了圣经式意象，比如洪水和沙漠。"}]},{"partOfSpeech":"adj.","definition":{"en":"Very great, extreme, or dramatic in size or effect (often in the phrase “biblical proportions”).","zh":"（规模或影响）极其巨大、夸张的；常见于短语“biblical proportions（圣经般的规模）”。"},"examples":[{"en":"After days of rain, the flooding reached biblical proportions.","zh":"连日大雨后，洪水泛滥到近乎“圣经般”的规模。"},{"en":"They faced a biblical level of pressure to finish on time.","zh":"他们面临着按时完成任务的巨大压力。"}]}],"synonyms":["scriptural","bible-based","religious","epic","enormous"],"phonetic":"/ˈbɪblɪkəl/","extraExplanation":["你输入的“biblico”更像是西班牙语/意大利语形式；英语里对应的常用词是 **biblical**。","“biblical proportions”来自《圣经》中宏大、戏剧性的叙事（如“大洪水”），所以现代英语里常用来夸张地形容“规模特别大/影响特别强”。"]}
{"word":"biblico-literary","summary":{"en":"An adjective meaning “both biblical and literary,” often used in academic writing to describe themes or style influenced by the Bible.","zh":"形容词，意为“兼具圣经与文学特征的”，多用于学术语境，指受《圣经》影响的主题或文体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Bible and to literature (especially style, themes, or language influenced by the Bible).","zh":"与《圣经》及文学相关的（尤指受《圣经》影响的文体、主题或语言）。"},"examples":[{"en":"The novel uses a biblico-literary style, with short parables and solemn wording.","zh":"这部小说采用了“圣经—文学式”的风格，带有短小的寓言和庄重的措辞。"},{"en":"Her essay explores biblico-literary images like exile, covenant, and redemption.","zh":"她的文章探讨了“圣经—文学式”的意象，如流放、盟约与救赎。"}]}],"synonyms":["biblical-literary","biblical and literary","Judeo-Christian literary","biblical in tone"],"phonetic":"/ˌbɪb.lɪˌkoʊˈlɪt.əˌrɛr.i/","extraExplanation":["该词较少见，更多出现在学术写作中，用来强调“圣经传统”和“文学传统”的交叉影响。日常英语里更常见的表达是：biblical and literary / biblical-literary（更常用）/ biblically inflected literature。","拼写上常见连字符（hyphen），表示两个领域共同修饰后面的名词：a biblico-literary analysis（兼具圣经与文学视角的分析）。"]}
{"word":"Biblicolegal","summary":{"en":"“Biblicolegal” means combining or relating to both biblical (scriptural) and legal ideas.","zh":"“Biblicolegal”指把圣经（经文/教义）与法律观念或论证结合在一起，或同时与二者相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both the Bible (biblical teachings) and the law; combining religious scriptural authority with legal rules or reasoning.","zh":"（形容词）与《圣经》（圣经教义）和法律都有关的；把宗教经文权威与法律规则/推理结合起来的。"},"examples":[{"en":"Some early court arguments used biblicolegal language, mixing scripture with legal principles.","zh":"一些早期的法庭论证使用了 biblicolegal 的措辞，把经文与法律原则混在一起。"},{"en":"The essay analyzes biblicolegal ideas in colonial governance.","zh":"这篇文章分析了殖民地治理中的 biblicolegal 观念。"}]}],"synonyms":["scriptural-legal","biblical and legal","religio-legal","theological-legal"],"phonetic":"/ˌbɪb.lɪ.koʊˈliː.ɡəl/","extraExplanation":["这是一个较少见、偏学术的词，多出现在历史、宗教研究、法律史或政治思想史的语境中，用来描述“圣经权威与法律制度/论证交织”的现象。","构词：biblico-（来自 Bible/Biblical，表示“圣经的”）+ legal（法律的）。在现代日常英语里更常用的表达是 “biblical and legal” 或 “scriptural and legal”。"]}
{"word":"biblicolegal","summary":{"en":"Biblicolegal means “connected to both the Bible and law,” often in academic discussion of religion and legal systems.","zh":"biblicolegal 指“同时与《圣经》和法律相关”，常用于宗教与法律制度关系的学术讨论。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to both the Bible (biblical tradition) and law (legal rules), especially when discussing how religious texts influence legal ideas or systems","zh":"与《圣经》（宗教传统）和法律（法律规则）两者都有关的；尤指讨论宗教文本如何影响法律观念或制度时使用"},"examples":[{"en":"The book offers a biblicolegal study of ancient rules about marriage and inheritance.","zh":"这本书从“圣经—法律”的角度研究了古代关于婚姻与继承的规则。"},{"en":"In class, we compared biblicolegal arguments with modern constitutional reasoning.","zh":"在课堂上，我们把“圣经—法律”式论证与现代宪法推理进行了比较。"}]}],"synonyms":["biblical-legal","religio-legal","scriptural-legal"],"phonetic":"/ˌbɪblɪkoʊˈliːɡəl/","extraExplanation":["这是一个较少见的学术用词，多用于神学、法律史或宗教与法律关系研究。词形由 biblico-（意为“圣经的”）+ legal（“法律的”）组成，常见于如 biblicolegal analysis / perspective（圣经—法律分析/视角）等搭配。"]}
{"word":"Biblicoliterary","summary":{"en":"An adjective for approaches that analyze the Bible as literature or blend biblical and literary study.","zh":"形容把《圣经》当作文学来分析，或结合圣经研究与文学研究的方法/视角。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Bible considered as literature (its style, themes, stories, and influence), or to writing and study that combines biblical and literary analysis.","zh":"（把《圣经》当作文学来研究时）与《圣经》的文学性（文体、主题、叙事及影响）有关的；或指把圣经研究与文学分析结合起来的。"},"examples":[{"en":"The course takes a biblicoliterary approach to the Psalms, focusing on imagery and voice.","zh":"这门课用 biblicoliterary 的方法研究《诗篇》，重点看意象和叙述声音。"},{"en":"Her thesis explores biblicoliterary echoes in American novels, especially the language of prophecy and exile.","zh":"她的论文探讨美国小说中的 biblicoliterary 呼应，尤其是“预言”和“流亡”这类语言。"}]}],"synonyms":["biblico-literary","biblical-literary","Bible-as-literature","biblical literary (criticism)"],"phonetic":"/ˌbɪblɪkoʊˈlɪtərɛri/","extraExplanation":["这个词在现代英语里比较少见，更常见的写法是带连字符的 **biblico-literary**，意思是“biblical（圣经的）+ literary（文学的）”。在学术语境（文学研究、神学与文学跨学科研究）中更可能出现。","如果你是在标题、课程名称或论文中使用，建议用 **biblico-literary**（更标准、更易读）；在一般写作中也可用更常见的表达，如 **biblical literary criticism**（圣经文学批评）或 **the Bible as literature**（把《圣经》当作文学）。"]}
{"word":"biblicoliterary","summary":{"en":"Biblico-literary describes connections between the Bible and literature, especially biblical language, themes, or references in literary works.","zh":"Biblico-literary 指《圣经》与文学之间的关联，尤指文学作品中的圣经语言、主题或典故。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Bible and to literature (especially language, style, themes, or influences that come from the Bible).","zh":"与《圣经》及文学相关的（尤指源自《圣经》的语言、文体、主题或影响）。"},"examples":[{"en":"The professor gave a lecture on biblico-literary images in early American poetry.","zh":"教授讲了一场关于早期美国诗歌中“圣经—文学”意象的讲座。"},{"en":"Her thesis explores biblico-literary allusions in modern novels.","zh":"她的论文研究现代小说中的“圣经—文学”典故。"}]}],"synonyms":["biblical","scriptural","religious-literary","biblical-literary"],"phonetic":"/bɪˌblɪk.oʊˈlɪt.əˌrɛr.i/","extraExplanation":["这个词更常见的写法是 **biblico-literary**（带连字符）。其中 **biblico-** 是一个构词成分，意思是“与《圣经》有关的”，常用于学术语境（如 biblico-historical）。","在宗教学、文学研究里，它常用来讨论：圣经叙事如何影响文学传统、写作修辞（如比喻与象征）、以及作品中的圣经典故（allusion）。"]}
{"word":"Biblicopsychological","summary":{"en":"An adjective meaning “biblically based psychological,” used for Bible-grounded views or counseling about the mind and behavior.","zh":"形容词，指“以《圣经》为基础的心理学/心理理解”，常用于基督教辅导或神学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the understanding of human thoughts, emotions, and behavior based on the Bible (often used in Christian counseling or theology).","zh":"与“以《圣经》为基础来理解人的思想、情绪与行为”有关的（常用于基督教辅导或神学语境）。"},"examples":[{"en":"The pastor offered biblicopsychological counseling grounded in Scripture.","zh":"牧师提供了以《圣经》为基础的“圣经—心理学”辅导。"},{"en":"Her paper examined biblicopsychological views of anxiety and hope.","zh":"她的论文探讨了对焦虑与盼望的“圣经—心理学”观点。"},{"en":"They discussed biblicopsychological approaches alongside clinical psychology.","zh":"他们把“圣经—心理学”的方法与临床心理学一起讨论。"}]}],"synonyms":["biblical-psychological","biblically informed","Bible-based (in psychology/counseling)","Christian (counseling)"],"phonetic":"/ˌbɪblɪkoʊˌsaɪkəˈlɑːdʒɪkəl/","extraExplanation":["这是一个比较少见、偏学术/宗教领域的复合词：biblio-（圣经/书籍）+ psychological（心理学的）。在一些基督教辅导或神学写作中，用来强调“以经文与信仰框架来解释人的心理与行为”。","写作中更常见、更地道的表达通常是：biblical psychology（圣经心理学）、biblically informed psychology（受圣经启发/指导的心理学）、Christian counseling（基督教辅导）。在正式论文里，选用更常见的术语会更易被读者理解。"]}
{"word":"biblicopsychological","summary":{"en":"Biblicopsychological means “Bible-based or Bible-informed psychology,” often used in Christian counseling contexts.","zh":"biblicopsychological 指“以《圣经》为基础或受其启发的心理学/心理辅导取向”，多见于基督教辅导语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to psychology that is based on, informed by, or interpreted through the Bible (especially in counseling, pastoral care, or religious education).","zh":"与“圣经取向/以圣经为基础”的心理学相关的（常用于辅导、牧灵关怀或宗教教育语境）。"},"examples":[{"en":"The counselor took a biblicopsychological approach, discussing anxiety alongside passages of Scripture.","zh":"这位辅导员采用了“圣经心理学”的取向，把焦虑问题与相关经文一起讨论。"},{"en":"Her research compares biblicopsychological counseling with secular therapy methods.","zh":"她的研究比较了圣经取向的心理辅导与世俗心理治疗方法。"}]}],"synonyms":["biblical-psychological","biblically informed","Christian counseling (related)","biblical counseling (related)"],"phonetic":"/bɪˌblɪkoʊˌsaɪkəˈlɑdʒɪkəl/","extraExplanation":["这是一个比较少见的复合词，通常可拆成：biblico-（与《圣经》有关）+ psychological（心理学的）。在英语里更常见的写法是 biblical psychology / biblically informed psychology / Christian counseling（基督教辅导）。","使用时要注意语境：它往往表示“以圣经为解释框架或价值基础的心理学/辅导”，不等同于“圣经里出现的心理学”。","在学术或专业写作中，如果读者不熟悉该词，建议第一次出现时用更直白的表达并加说明，例如：“a biblically informed psychological approach (biblicopsychological)” 。"]}
{"word":"biblike","summary":{"en":"Biblike means “Bible-like” in style (rare), and very occasionally “bib-shaped.”","zh":"Biblike 多指“圣经式的（文风/语气）”（少见），极少也可指“像围兜的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Resembling the Bible, or written in a style that sounds like the Bible; biblical in tone.","zh":"（少见）像《圣经》的；带有《圣经》文体/语气的；“圣经式”的。"},"examples":[{"en":"The novel uses biblike language, with short, solemn sentences.","zh":"这部小说使用了圣经式的语言，句子短而庄重。"},{"en":"His speech had a biblike rhythm that made it sound like a sermon.","zh":"他的演讲有一种圣经般的节奏，让人听起来像布道。"}]},{"partOfSpeech":"adj.","definition":{"en":"(very rare, informal) Shaped like a bib or functioning like a bib (something that covers the front of the chest).","zh":"（非常少见，非正式）像围兜那样的；起到围兜作用的（覆盖胸前的一块）。"},"examples":[{"en":"The baby’s biblike collar helped keep food off her shirt.","zh":"宝宝那种围兜式的领子能防止食物弄脏衣服。"}]}],"synonyms":["biblical","scriptural","Bible-like","sermon-like"],"phonetic":"/ˈbɪbˌlaɪk/","extraExplanation":["“biblike”通常是由“bib（围兜/圣经缩写的口语写法）+ -like（像……的）”构成的临时造词，实际使用频率不高。","如果你想表达“与《圣经》有关/符合《圣经》内容或传统”的常用词，一般用更标准的“biblical”。“biblike”更偏向“听起来像《圣经》那样的文风/语气”。"]}
{"word":"biblio","summary":{"en":"“biblio-” is a word part meaning “book,” and “biblio” is sometimes an informal short form of “bibliography.”","zh":"“biblio-”是表示“书”的构词成分；“biblio”有时也非正式地指“bibliography（书目/参考文献）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(combining form/prefix) Related to books, writing, or libraries.\nExamples:\n• en: a bibliography (a list of books/articles used)  zh: bibliography（参考文献/书目）\n• en: a bibliophile loves books  zh: bibliophile（爱书的人）","zh":"（构词前缀/词根）表示“书、文字、图书馆”等相关含义。\n例：\n• en: bibliography（参考文献/书目）  zh: bibliography（参考文献/书目）\n• en: bibliophile（爱书的人）  zh: bibliophile（爱书的人）"},"examples":[{"en":"In my paper, I added a bibliography at the end.","zh":"我在论文末尾加了参考文献。"},{"en":"She’s a bibliophile who collects old novels.","zh":"她是个爱书的人，收藏旧小说。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, short for) bibliography; sometimes used as a clipped form in notes, cataloging, or casual writing.\nExamples:\n• en: Check the biblio for more sources.  zh: 看一下书目/参考文献获取更多来源。","zh":"（非正式用法，缩写/简称）bibliography（书目；参考文献）。有时出现在笔记、编目或口头/随手写的表达中。\n例：\n• en: Check the biblio for more sources.  zh: 看一下书目/参考文献获取更多来源。"},"examples":[{"en":"If you want more reading, the biblio has plenty of recommendations.","zh":"如果你想进一步阅读，参考文献里有很多推荐。"}]}],"synonyms":["bibliography (informal sense)","references (context-dependent)","works cited (context-dependent)"],"phonetic":"ˈbɪblioʊ","extraExplanation":["“biblio-”来自希腊语 biblion（书、卷轴）。在英语里它常作为词根出现，而不是独立单词。常见组合词还有 library science 相关的 bibliographic（书目学的）、bibliography（书目/参考文献）、bibliotheca（藏书室/图书馆，较少见）。","如果你在学术写作中，正式场合更常用 bibliography / references / works cited；“biblio”更像是口语或笔记里的简写。"]}
{"word":"biblioclasm","summary":{"en":"Biblioclasm means the deliberate destruction of books, often to control ideas.","zh":"Biblioclasm 指蓄意毁书/焚书，常与控制思想或审查相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The deliberate destruction of books, especially for ideological, political, or religious reasons.","zh":"（尤指出于意识形态、政治或宗教原因的）蓄意毁书、焚书。"},"examples":[{"en":"The regime used biblioclasm to silence opposing ideas.","zh":"该政权通过焚书毁书来压制不同观点。"},{"en":"Historians study biblioclasm to understand how knowledge was controlled.","zh":"历史学家研究焚书毁书现象，以理解知识如何被控制。"}]},{"partOfSpeech":"n.","definition":{"en":"Any act of damaging, defacing, or eliminating books or written records.","zh":"对书籍或文字记录的破坏、涂改或清除行为（广义）。"},"examples":[{"en":"After the flood, a tragic kind of biblioclasm occurred as thousands of archives were ruined.","zh":"洪水过后，大量档案被毁，发生了一种令人痛心的“广义毁书”。"},{"en":"The librarian worked to prevent accidental biblioclasm by improving storage conditions.","zh":"图书管理员通过改善保存环境来防止意外损毁书籍。"}]}],"synonyms":["book burning","destruction of books","censorship (related)","cultural erasure (related)"],"phonetic":"/ˈbɪbliəˌklæzəm/","extraExplanation":["词源：来自希腊语 biblio-（书）+ -clasm（打碎、破坏），与 iconoclasm（破坏圣像/偶像破坏）结构相似。","使用语境：多用于讨论审查制度、文化清洗、战争与极端主义等话题；语气偏正式、书面语。","相关词：biblioclast（毁书者），book burning（焚书，较常见、直白的说法），censorship（审查），cultural erasure（文化抹除）。"]}
{"word":"biblioclast","summary":{"en":"A biblioclast is someone who destroys books, or figuratively attacks books and reading culture.","zh":"biblioclast 指“毁书者/焚书者”，也可引申为贬抑书籍与阅读文化的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who destroys or damages books, especially deliberately or out of hostility toward ideas or culture.","zh":"毁书者；焚书者（尤指出于敌意或反文化、反思想而故意破坏书籍的人）"},"examples":[{"en":"The protesters called the dictator a biblioclast after his police burned banned novels.","zh":"抗议者在他的警察焚烧禁书后称那位独裁者为“毁书者”。"},{"en":"Libraries protect collections so they won’t be lost to time—or to biblioclasts.","zh":"图书馆保护馆藏，以免它们因岁月流失——或被毁书者破坏。"}]},{"partOfSpeech":"n.","definition":{"en":"More broadly, someone who attacks or undermines books, reading, or literary culture (sometimes used figuratively).","zh":"（引申义）反书者；贬抑阅读或文学文化的人（有时为比喻用法）"},"examples":[{"en":"He wasn’t literally tearing pages out, but his constant mockery of reading made him seem like a biblioclast.","zh":"他并没有真的撕书页，但他总是嘲笑阅读，让人觉得他像个反书者。"},{"en":"Some critics warned that replacing every library with a screen-only system could create a new kind of biblioclast.","zh":"一些评论者警告说，把所有图书馆都替换成只看屏幕的系统，可能会造就一种新型“反书者”。"}]}],"synonyms":["book burner","book destroyer","vandal","censor (context-dependent)","iconoclast (related, not exact)"],"phonetic":"/ˈbɪbliəˌklæst/","extraExplanation":["词源：biblio- 表示“书、书籍”（如 bibliography 参考书目），-clast 来自希腊语 *klastēs*，意为“打碎者、破坏者”。因此 biblioclast 字面就是“破坏书的人”。","用法提示：它比 book burner（焚书者）更正式、更书面，常用于讨论审查制度、文化破坏或思想压制等语境。","相关词：bibliophile（爱书的人）、iconoclast（打破偶像/挑战传统的人；也可比喻“反传统者”）。"]}
{"word":"bibliofilm","summary":{"en":"Bibliofilm most commonly refers to microfilm used for preserving or reproducing library materials; more rarely, it can mean a film about books or reading culture.","zh":"bibliofilm 最常指用于保存或复制馆藏资料的缩微胶片；较少见时也可指“书籍/阅读主题的电影”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"microfilm (or another film format) used to store or reproduce books, documents, or other library materials","zh":"用于保存或复制书籍、文件等馆藏资料的缩微胶片（或其他胶片载体）"},"examples":[{"en":"The library kept old newspapers on bibliofilm to save space.","zh":"图书馆把旧报纸用缩微胶片保存，以节省空间。"},{"en":"Researchers requested the bibliofilm copy because the original book was too fragile to handle.","zh":"研究人员申请查看缩微胶片版本，因为原书太脆弱，不适合翻阅。"}]},{"partOfSpeech":"n.","definition":{"en":"a film (movie) whose theme is books, libraries, reading culture, or literary life (rare/nonstandard usage)","zh":"以书籍、图书馆、阅读文化或文学生活为主题的电影（较少见/非标准用法）"},"examples":[{"en":"It’s a quiet bibliofilm about a small-town librarian and her readers.","zh":"这是一部安静的“书影”，讲的是小镇图书管理员和读者的故事。"},{"en":"The festival screened a bibliofilm inspired by a classic novel.","zh":"电影节放映了一部受经典小说启发的“书籍主题电影”。"}]}],"synonyms":["microfilm","microfiche","archival film","film about books","literary film"],"phonetic":"/ˈbɪbli.oʊˌfɪlm/","extraExplanation":["“biblio-”来自希腊语，表示“书/书籍”；“film”指胶片或电影。这个词在日常英语里不常见，更可能出现在图书馆学、档案保存（如缩微胶片 microfilm）或创意写作/影展宣传的语境中。","如果你想表达“书籍主题电影”，更自然的说法通常是：a film about books/libraries、a literary film、a bookish film；如果指保存载体，常用：microfilm、microfiche。"]}
{"word":"bibliog","summary":{"en":"“bibliog.” is a shortened form of “bibliography,” meaning a list of sources.","zh":"“bibliog.”是“bibliography”的缩写，指参考文献/书目列表。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “bibliography” (a list of books, articles, or other sources used in research or writing).","zh":"“bibliography”的缩写（参考文献/书目：列出写作或研究中使用的书籍、文章或其他资料来源）。"},"examples":[{"en":"See bibliog. at the end of the chapter for further reading.","zh":"更多延伸阅读请看本章末尾的 bibliog.（参考文献/书目）。"},{"en":"The paper must include a bibliog. of at least five sources.","zh":"这篇论文必须包含至少五条来源的 bibliog.（参考文献表）。"}]}],"synonyms":["bibliography","references","works cited","source list"],"phonetic":"ˌbɪbliˈɑːɡrəfi","extraExplanation":["“bibliog.”常见于学术写作、图书馆目录、书评或旧式排版中，用来节省空间。正式写作里更常直接写全称“bibliography”，或在论文格式中用“References / Works Cited”。"]}
{"word":"bibliogenesis","summary":{"en":"Bibliogenesis means the origin or production of books.","zh":"bibliogenesis 指“书籍的起源或生成/产生”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The origin, creation, or production of books (especially how books come into being as physical objects and cultural products).","zh":"书籍的起源、创造或生成（尤指书作为实体与文化产物是如何产生的）。"},"examples":[{"en":"The museum’s exhibit explored bibliogenesis, from papyrus scrolls to modern paperbacks.","zh":"博物馆的展览探讨了书籍生成的历史，从纸草卷轴到现代平装书。"},{"en":"In her essay, she described printing as a turning point in European bibliogenesis.","zh":"在她的文章中，她把印刷术描述为欧洲书籍生成史上的转折点。"}]}],"synonyms":["book production","history of the book","bookmaking"],"phonetic":"/ˌbɪbli.oʊˈdʒɛnəsɪs/","extraExplanation":["词源：biblio-（书）+ -genesis（生成、起源）。这是一个较学术的词，常见于书籍史、出版史、图书馆学、文献学等语境。","不要与 biology（生物学）或 biogenesis（生源说）混淆；bibliogenesis 专指“书”的生成与传播过程。"]}
{"word":"bibliognost","summary":{"en":"A rare word meaning an expert who knows and can identify books, especially rare ones.","zh":"一个较罕见的词，指精通并能鉴别书籍（尤其是稀有书籍）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who is very knowledgeable about books, especially rare books—someone skilled at recognizing, describing, or evaluating them.","zh":"精通书籍的人，尤指熟悉或擅长辨识、描述、鉴定（尤其是稀有书籍）的人。"},"examples":[{"en":"The library hired a bibliognost to help identify which volumes were rare and valuable.","zh":"图书馆雇了一位书籍鉴识专家来帮助判断哪些藏书稀有且有价值。"},{"en":"As a bibliognost, she could tell the edition and approximate date just by examining the paper and binding.","zh":"作为书籍鉴识专家，她只要看看纸张和装帧就能判断版本并推测大致年代。"}]}],"synonyms":["book expert","rare-book expert","bibliophile (related)","bibliographer (related)"],"phonetic":"/ˈbɪbliəˌnɑst/","extraExplanation":["这是一个非常少见、偏学术/古典的词，常见于讨论“藏书、版本学、古籍鉴定”的语境。","词源上可拆为 biblio-（书）+ -gnost（知道、识别），与 gnostic / know（知道）同源，强调“识别与鉴定书籍的知识”。在现代英语里更常用的相关词是 bibliophile（爱书的人）或 bibliographer（从事书目与书籍描述的人）。"]}
{"word":"bibliognostic","summary":{"en":"Bibliognostic is a rare adjective meaning “knowledgeable about books,” especially able to identify or judge editions and book details.","zh":"bibliognostic 是个很罕见的形容词，指“懂书、识书”，尤指能辨别版本与书籍细节并作出评鉴。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Having or showing knowledge about books—especially identifying, describing, or judging books (e.g., editions, authorship, printing, value).","zh":"（罕见）具有“识书/懂书”的能力或表现出对书籍的知识，尤指能辨认、描述或评鉴书籍（如版本、作者真伪、印刷与价值）。"},"examples":[{"en":"She’s bibliognostic enough to tell a first edition from a later reprint.","zh":"她很懂书，能分辨初版和后来的重印本。"},{"en":"The dealer’s bibliognostic eye noticed the misdated title page immediately.","zh":"那位书商的识书眼力立刻发现了书名页的日期有误。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to bibliognosy (the study/knowledge of books).","zh":"与“书志学/识书学”（bibliognosy：关于书籍的研究与知识）有关的。"},"examples":[{"en":"The lecture covered bibliognostic methods used in rare-book cataloging.","zh":"这场讲座介绍了古籍编目中使用的识书方法。"}]}],"synonyms":["well-read","knowledgeable about books","bibliographic","bookish","erudite"],"phonetic":"ˌbɪbliəˈnɑstɪk","extraExplanation":["这个词非常少见，多见于较老或较学术的语境。常见替代表达包括：well-read（博览群书的）、knowledgeable about books（对书很懂）、bibliographic（书目学的/文献目录的）、bookish（书卷气的）。","词源可拆为 biblio-（书）+ gnostic（有“知识/认识”的），整体强调“懂书、识别书籍信息”的能力，而不只是“爱读书”。"]}
{"word":"bibliogony","summary":{"en":"Bibliogony means the origin or production of books—how books are brought into being.","zh":"Bibliogony 指“书籍的起源/诞生/生成过程”，强调书如何被创造出来。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the origin, birth, or production of books (how books come into existence).","zh":"书籍的起源、诞生或产生过程（书是如何出现/被制作出来的）。"},"examples":[{"en":"The museum exhibit traced the bibliogony of the modern novel, from manuscript drafts to printed editions.","zh":"博物馆展览追溯了现代小说的“书之诞生史”，从手稿草稿到印刷版。"},{"en":"Her thesis focuses on the bibliogony of textbooks and how editorial decisions shape what students learn.","zh":"她的论文关注教材的“生成过程”，以及编辑决策如何影响学生学到的内容。"}]}],"synonyms":["bookmaking","publishing history","history of printing","the origins of books"],"phonetic":"/ˌbɪbliˈɑdʒəni/","extraExplanation":["这个词非常罕见，多出现在学术或幽默/修辞性的写法里，用来强调“书的诞生/生成”。日常英语里更常说：the history of book production（书籍生产史）、bookmaking（制书/造书）、publishing history（出版史）、the origins of books（书的起源）。","词源上可拆为 biblio-（书）+ -gony（诞生/生成，类似 cosmogony“宇宙起源”、theogony“神谱/神的起源”）。因此 bibliogony 常带一点“宏大叙事”的语感。"]}
{"word":"bibliograph","summary":{"en":"A bibliograph is someone who compiles or studies bibliographies; rarely, it can mean to make a bibliography.","zh":"bibliograph 指编写或研究书目的人；很少情况下也可作动词，表示编制书目。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who writes, compiles, or studies bibliographies (lists of books and other publications), often as a specialist in books and references","zh":"书目学者；编写或研究书目（出版物清单）的人"},"examples":[{"en":"The bibliograph spent years compiling a complete list of early American newspapers.","zh":"这位书目学者花了多年时间汇编一份完整的早期美国报纸目录。"},{"en":"As a bibliograph, her job was to verify titles, authors, and publication dates.","zh":"作为书目学者，她的工作是核对书名、作者和出版日期。"}]},{"partOfSpeech":"v.","definition":{"en":"to create or record a bibliography; to list books or publications systematically (rare)","zh":"编制书目；系统列出书籍或出版物（较少见）"},"examples":[{"en":"The researcher bibliographed every source used in the project.","zh":"研究者把项目中用到的每一份资料都编入书目。"}]}],"synonyms":["bibliographer","bibliologist","cataloger"],"phonetic":"/ˈbɪbliəˌɡræf/","extraExplanation":["“bibliograph”在现代英语里比较少见，更常用的是“bibliographer（书目学家）”和“bibliography（参考书目/书目）”。词根来自希腊语：biblio-（书）+ -graph（写/记录）。"]}
{"word":"bibliographer","summary":{"en":"A bibliographer is someone who researches and records detailed information about books and their editions.","zh":"bibliographer 指研究并记录书籍及其版本等详细信息的书目学家/编目专家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who studies, describes, catalogs, or writes about books—especially their history, editions, printing, and physical details.","zh":"书目学家；图书目录学者：研究、描述、编目或撰写与书籍相关内容的人，尤其关注书籍的历史、版本、印刷与装帧等细节。"},"examples":[{"en":"The bibliographer identified the first edition by its publisher’s mark and page layout.","zh":"这位书目学家通过出版社标记和版式辨认出这是第一版。"},{"en":"As a bibliographer, she compiled a detailed list of every translation of the novel.","zh":"作为书目学家，她编制了这部小说所有译本的详细目录。"}]}],"synonyms":["bibliologist","cataloger","book historian"],"phonetic":"/ˌbɪbliˈɑɡrəfər/","extraExplanation":["“bibliographer”常见于学术与图书馆语境，既可能指研究“书作为物件”的学者（版本、纸张、排印、装帧等），也可能指负责编制“书目/参考书目（bibliography）”的专业人员。","词根提示：biblio-（书）+ -grapher（写/记录的人）。相关词：bibliography（参考书目/书目学）、bibliographic（书目的；书目学的）、librarian（图书馆员，范围更广，不一定做书目学研究）。"]}
{"word":"bibliographers","summary":{"en":"“Bibliographers” are people who compile or study bibliographies—organized lists and records of publications.","zh":"“bibliographers” 指编制或研究书目的人员，即整理出版物清单与文献记录的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who compiles, describes, or studies bibliographies (organized lists of books, articles, or other sources), often for research or library work","zh":"书目学家；编目者（编制、描述或研究书目，即对书籍、文章等资料的系统清单的人，常见于研究或图书馆工作）"},"examples":[{"en":"The bibliographer created a detailed list of every edition of the novel.","zh":"这位书目学家整理出了这部小说每一个版本的详细清单。"},{"en":"A museum hired bibliographers to verify rare book records.","zh":"博物馆聘请了编目人员来核对珍本书的记录。"},{"en":"In academic libraries, bibliographers often help researchers find reliable sources.","zh":"在高校图书馆里，书目学家常常帮助研究者找到可靠的资料来源。"}]}],"synonyms":["bibliographic specialist","cataloger","documentalist","librarian (in some contexts)"],"phonetic":"/ˌbɪbliˈɑɡrəfər/","extraExplanation":["“bibliographers” 是 “bibliographer” 的复数形式。","词根小提示：biblio- 表示“书”（如 bibliography 书目、bibliophile 爱书者），-grapher 表示“记录/写作者”。因此 bibliographer 字面上有“记录书目的人”的意思。","在英语语境中，bibliographer 不只是“列书单”，还可能包含对版本差异、出版信息、作者归属与文献真伪的考证，常见于人文学科、档案与特藏（special collections）领域。"]}
{"word":"Bibliographic","summary":{"en":"Bibliographic means related to a bibliography or to the identifying details of a source.","zh":"Bibliographic 指与参考文献（书目）或文献来源的识别信息相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to a bibliography (a list of books, articles, or other sources), or to the details used to describe and identify a source (such as author, title, date, publisher).","zh":"与“参考文献/书目”有关的；或指用于描述与识别文献来源的信息（如作者、书名、年份、出版社等）。"},"examples":[{"en":"The paper includes a bibliographic list of all the sources we used.","zh":"这篇论文包含一份我们使用过的所有来源的参考文献列表。"},{"en":"Please check the bibliographic information: author, year, and publisher.","zh":"请核对书目信息：作者、年份和出版社。"},{"en":"The librarian helped me find the bibliographic record for the book.","zh":"图书管理员帮我找到了这本书的书目记录。"}]}],"synonyms":["bibliographical","citation-related","reference"],"phonetic":"/ˌbɪbliəˈɡræfɪk/","extraExplanation":["“bibliographic”常出现在学术写作与图书馆系统中，比如：bibliographic information（书目信息）、bibliographic record（书目记录）、bibliographic citation（文献引用/引文条目）。","词根小提示：biblio- 表示“书/书籍”，-graphic 表示“记录/描述”。因此它强调“对文献的记录与描述信息”，而不只是“和书有关”。"]}
{"word":"bibliographic","summary":{"en":"“Bibliographic” means related to bibliographies or the publication details used for identifying/citing sources.","zh":"“bibliographic”指与书目/参考文献有关，或指用于识别与引用来源的出版信息。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to a bibliography (a list of books, articles, or other sources), or to the description and identification details of publications.","zh":"与参考文献目录（书目）有关的；或与出版物的描述与识别信息（如作者、书名、出版地、出版社、年份等）有关的。"},"examples":[{"en":"The paper needs more bibliographic details for each source.","zh":"这篇论文需要为每个来源补充更多书目信息。"},{"en":"Please check that the bibliographic entries follow APA style.","zh":"请检查书目条目是否符合 APA 格式。"}]},{"partOfSpeech":"n.","definition":{"en":"A set of publication details used to identify and cite a source (often used in the phrase “bibliographic information/data”).","zh":"用于识别并引用某个来源的一组出版信息（常见于短语“bibliographic information/data”，即“书目信息/书目数据”）。"},"examples":[{"en":"The librarian helped me find the bibliographic information for the journal article.","zh":"图书管理员帮我找到了那篇期刊文章的书目信息。"},{"en":"The database exports bibliographic data to citation managers like Zotero.","zh":"该数据库可以将书目数据导出到 Zotero 等文献管理工具。"}]}],"synonyms":["reference","citation (in context)","source (in context)","cataloging (related field)"],"phonetic":"/ˌbɪbliəˈɡræfɪk/","extraExplanation":["“bibliographic”来自“bibliography”（书目/参考文献表）。在学术写作中，它常与“citation（引文/引用）”“reference（参考文献）”一起出现：citation 指文中引用标注；reference/bibliography 指文末的来源列表；bibliographic information/data 指构成引用所需的各项细节。"]}
{"word":"bibliographical","summary":{"en":"“Bibliographical” means related to bibliographies (lists of sources) or to the scholarly description and study of books and editions.","zh":"“Bibliographical”指与书目（参考文献列表）有关，或与对书籍及其版本进行学术性描述与研究有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to a bibliography (a list of books/articles) or to the describing and listing of books and publications.","zh":"与书目（参考文献列表）有关的；与对书籍/出版物进行描述、编目和列出有关的。"},"examples":[{"en":"The article ends with a bibliographical section of sources.","zh":"这篇文章以一个书目（参考文献）部分作为结尾。"},{"en":"She checked the bibliographical details—author, title, and publication date.","zh":"她核对了书目的细节——作者、书名和出版日期。"},{"en":"Our librarian gave us bibliographical guidance for the research project.","zh":"图书馆员为我们的研究项目提供了书目方面的指导。"}]},{"partOfSpeech":"adj.","definition":{"en":"Concerned with the study of books as material objects (for example, editions, printing history, and physical features).","zh":"与“书籍学/版本学”有关的；关注书籍作为实体物品的研究（如版本、印刷史和装帧特征）。"},"examples":[{"en":"The scholar made a bibliographical study of early editions of the novel.","zh":"这位学者对这部小说的早期版本做了书籍学研究。"},{"en":"Bibliographical evidence suggests this copy was printed later than the others.","zh":"书籍学证据表明，这一册的印刷时间比其他版本更晚。"}]}],"synonyms":["bibliographic","reference-related","source-listing"],"phonetic":"ˌbɪbliəˈɡræfɪkəl","extraExplanation":["容易混淆：bibliographical（书目的/版本学的）≠ biographical（传记的）。前者来自 bibliography（书目），后者来自 biography（传记）。"]}
{"word":"bibliographically","summary":{"en":"“Bibliographically” means “in a way related to a bibliography or bibliographic information.”","zh":"“bibliographically”表示“以书目/参考文献相关的方式；与书目信息有关地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to a bibliography (a list of books/articles and their publication details), especially when describing, organizing, or citing sources.","zh":"以书目（参考文献列表及其出版信息）的方式；与书目编制、整理或引用来源有关地。"},"examples":[{"en":"The sources are arranged bibliographically by author’s last name.","zh":"这些来源按书目规则以作者姓氏排序。"},{"en":"This database allows you to search bibliographically, using fields like title, author, and year.","zh":"这个数据库允许你用书目字段（如标题、作者、年份）来检索。"},{"en":"She documented the archive bibliographically, noting each item’s publisher and date.","zh":"她以书目方式记录档案，注明每项材料的出版社和日期。"}]}],"synonyms":["in bibliographic form","with bibliographic details","as a bibliography","by bibliographic standards"],"phonetic":"/ˌbɪbliəˈɡræfɪkli/","extraExplanation":["“bibliographically”常见于学术写作、图书馆学、出版与研究方法语境，强调“按参考文献规范/书目数据字段”来描述或处理资料。常与by author/title/date、in bibliographic form、bibliographic information等搭配。"]}
{"word":"bibliographies","summary":{"en":"“Bibliographies” is the plural of “bibliography”: lists of sources used for research or writing; it can also mean the study of listing and describing publications.","zh":"“Bibliographies”是“bibliography”的复数：指研究/写作中使用的资料目录；也可指整理与描述出版物的书目学。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a list of books, articles, websites, and other sources used for a piece of writing or research","zh":"（论文、报告等的）参考文献目录；书目"},"examples":[{"en":"At the end of the essay, include a bibliography of all the sources you used.","zh":"在文章末尾附上你使用过的所有资料的参考文献目录。"},{"en":"Her bibliography includes interviews, journal articles, and government reports.","zh":"她的参考文献目录包含访谈、期刊文章和政府报告。"}]},{"partOfSpeech":"n.","definition":{"en":"the study or practice of describing, organizing, and listing books and other publications","zh":"书目学；文献编目与整理的学问/实践"},"examples":[{"en":"He took a class in bibliography to learn how scholars record and classify books.","zh":"他上了一门书目学课程，学习学者如何记录和分类书籍。"}]}],"synonyms":["references","works cited","source list","reading list"],"phonetic":"/ˌbɪbliˈɑɡrəfi/","extraExplanation":["“bibliographies”是“bibliography”的复数形式。学术写作中，bibliography通常指“你参考过的所有资料”（不一定都在文中逐条引用）；而“references/Works Cited”更常指“文中实际引用到的资料”。不同格式（APA/MLA/Chicago）对作者、年份、标题、标点与缩进有不同要求。","词源：来自希腊语 biblio-（书）+ -graphy（写、记录），字面意思是“关于书的记录”。"]}
{"word":"bibliographize","summary":{"en":"“Bibliographize” means to compile and format a bibliography of sources.","zh":"“bibliographize”指编制并整理参考书目（来源清单）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make a bibliography for a book, article, or research project; to list and format the sources used","zh":"为书籍、文章或研究编制参考书目；把使用过的资料来源列出并按格式整理"},"examples":[{"en":"Before submitting the thesis, she bibliographized every source she cited.","zh":"在提交论文前，她把所有引用过的来源都编成了参考书目。"},{"en":"The librarian bibliographized the collection to help students find reliable materials.","zh":"图书管理员为这批馆藏编制书目，帮助学生找到可靠资料。"}]}],"synonyms":["compile a bibliography","create a bibliography","document sources","catalog (in a library context)"],"phonetic":"/ˌbɪbliˈɑːɡrəˌfaɪz/","extraExplanation":["“bibliographize”是比较少见、偏正式的动词，常见表达通常是“compile a bibliography（编制参考书目）”或“create a bibliography”。","词形来自“bibliography（书目/参考书目）+ -ize（使……化/使成为）”，意思就是“使之成为书目、按书目方式整理”。在学术写作语境中更容易出现。"]}
{"word":"bibliography","summary":{"en":"A bibliography is a list of sources used or consulted for research, usually placed at the end of a paper.","zh":"bibliography 指参考文献/书目：列出研究或写作中使用或参考的资料，通常放在文章末尾。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A list of books, articles, and other sources used for a piece of writing or research (often placed at the end).","zh":"参考文献目录；书目（列出写作或研究中使用/引用的书籍、文章等，常放在文末）。"},"examples":[{"en":"The bibliography at the end of the paper includes twelve journal articles.","zh":"论文末尾的参考文献列出了12篇期刊文章。"},{"en":"Please format your bibliography in APA style.","zh":"请用APA格式排版你的参考文献。"}]},{"partOfSpeech":"n.","definition":{"en":"A book or article that contains a list of writings on a particular subject (a guide to what has been published).","zh":"（专题）书目/文献指南（汇总某一主题已出版作品的书或文章）。"},"examples":[{"en":"This bibliography of modern Chinese history is helpful for new researchers.","zh":"这本关于中国近代史的书目对新研究者很有帮助。"}]}],"synonyms":["references","works cited","source list","reading list"],"phonetic":"/ˌbɪbliˈɑɡrəfi/","extraExplanation":["在学术写作里，bibliography 常被广义地用作“参考文献”。但有些写作规范会区分：references（只列出文中实际引用的来源），bibliography（可能还包含为背景阅读但未在文中直接引用的来源）。具体以课程或期刊要求为准。","词源：来自希腊语 biblio-（书）+ -graphy（书写/记录），字面意思是“关于书的记录”。","常见相关词：bibliographic（书目的；文献的），bibliographic information（文献信息），annotated bibliography（带注释的书目：每条来源后附简短摘要或评价）。"]}
{"word":"bibliokelpt","summary":{"en":"A biblioklept is a person who steals books, often used humorously for someone who never returns borrowed books.","zh":"biblioklept 指偷书的人，也常幽默地指借书不还的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who steals books (sometimes jokingly used for someone who “borrows” books and never returns them).","zh":"偷书的人；（也常带玩笑语气）借书不还的人。"},"examples":[{"en":"He joked that he was a biblioklept because his friends’ books never made it back to their shelves.","zh":"他开玩笑说自己是个“偷书贼”，因为朋友的书借出去就再也回不到书架上了。"},{"en":"Libraries take steps to prevent biblioklepts from walking out with rare books.","zh":"图书馆会采取措施，防止偷书者把珍本带走。"}]}],"synonyms":["book thief","pilferer","thief"],"phonetic":"/ˈbɪbli.oʊˌklɛpt/","extraExplanation":["你输入的 **bibliokelpt** 更常见的拼写是 **biblioklept**（也有人写作 *biblioklep(t)*，但较少）。词根来自希腊语：*biblio-*（书）+ *-klept*（偷，见 *kleptomania* “盗窃癖”）。","这个词通常带一点幽默或夸张的语气，用来形容“老是借书不还”的人；在谈论真正的偷窃（尤其是珍本、藏书）时也会严肃使用。"]}
{"word":"biblioklept","summary":{"en":"A biblioklept is a person who steals books.","zh":"biblioklept 指“偷书的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who steals books (often from libraries, bookstores, or friends).","zh":"偷书的人（常从图书馆、书店或朋友那里偷书）。"},"examples":[{"en":"The library discovered a biblioklept after several rare books went missing.","zh":"几本珍贵藏书失踪后，图书馆发现了一个偷书贼。"},{"en":"He joked that he was a “biblioklept,” but his friends wanted their books back.","zh":"他开玩笑说自己是“偷书者”，但朋友们还是希望他把书还回来。"}]}],"synonyms":["book thief","book stealer","thief"],"phonetic":"/ˈbɪbliəˌklɛpt/","extraExplanation":["词源：来自希腊语词根 biblio-（书）+ -klept（偷；同源于 kleptomania「盗窃癖」）。因此 biblioklept 字面意思就是「偷书的人」。","语体与使用：这个词比较少见，常见于幽默、讽刺或较正式的文字中；日常更常说 book thief（偷书贼）或 someone who steals books（偷书的人）。"]}
{"word":"bibliokleptomania","summary":{"en":"Bibliokleptomania means a compulsive urge to steal books, often said in a joking way.","zh":"Bibliokleptomania 指强迫性想偷书的冲动，常以玩笑方式使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a compulsive urge to steal books (often used humorously or informally).","zh":"一种强迫性想偷书的冲动（常带幽默或非正式语气）。"},"examples":[{"en":"He joked that he had bibliokleptomania because he kept “forgetting” to return library books.","zh":"他开玩笑说自己有“偷书癖”，因为他总是“忘记”把图书馆的书还回去。"},{"en":"The shop put up a sign about book theft, warning customers with “bibliokleptomania” to pay first.","zh":"那家书店贴了个关于偷书的告示，提醒“有偷书冲动的人”先付款。"}]}],"synonyms":["kleptomania","book theft","compulsive stealing (of books)"],"phonetic":"/ˌbɪbli.oʊˌklɛptoʊˈmeɪniə/","extraExplanation":["这个词由三部分组成：biblio-（书）+ klepto-（偷）+ -mania（躁狂/癖好、强迫性冲动）。在英语里它并不是医学上常见的正式诊断词，更常见于玩笑、评论或写作中，用来夸张地形容“特别爱顺手拿走书”的人。","更正式的说法通常会用 kleptomania（盗窃癖）或表达为 an urge to steal books（想偷书的冲动）。"]}
{"word":"bibliokleptomaniac","summary":{"en":"A (usually humorous) term for someone who steals books compulsively.","zh":"（多为幽默说法）指强迫性偷书的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who compulsively steals books (often used humorously or informally).","zh":"（常为幽默/非正式用法）指强迫性地偷书的人。"},"examples":[{"en":"The rare first editions kept disappearing, and the librarian joked we had a bibliokleptomaniac on campus.","zh":"那些稀有的初版本总在消失，图书管理员开玩笑说校园里有个“偷书成癖的人”。"},{"en":"He wasn’t just a casual shoplifter—he was a bibliokleptomaniac who targeted bookstores and libraries.","zh":"他不只是随便顺手牵羊，而是个专盯书店和图书馆的“偷书癖患者”。"}]}],"synonyms":["book thief","biblioklept","kleptomaniac"],"phonetic":"/ˌbɪbli.oʊˌklɛp.təˈmeɪni.æk/","extraExplanation":["这是一个相对少见的混成词：biblio-（书）+ klepto-（偷窃）+ maniac（狂、成瘾者）。在日常英语里更常见的说法是 book thief（偷书贼）或 biblioklept（偷书者）。","kleptomania（偷窃癖）在医学语境中指一种冲动控制障碍；但 bibliokleptomaniac 往往带有夸张、调侃的语气，是否“医学诊断”需看具体语境。"]}
{"word":"bibliolater","summary":{"en":"A bibliolater is someone who idolizes books, sometimes to an extreme.","zh":"bibliolater 指“把书奉若神明”的人，常含过度崇拜之意。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who worships books or treats books with extreme (sometimes unhealthy) reverence","zh":"书籍崇拜者；把书当作偶像般敬奉的人（常含过度、甚至不健康的敬畏之意）"},"examples":[{"en":"Some critics call him a bibliolater because he believes every old book must be right.","zh":"一些评论家说他是个书籍崇拜者，因为他认为每一本古书都一定正确。"},{"en":"She’s a bibliolater in the nicest sense—she cares for books the way others care for art.","zh":"从好的角度说，她很“崇拜书”——她像别人珍视艺术品一样爱护书。"}]}],"synonyms":["book-worshiper","idolizer of books"],"phonetic":"/ˈbɪbliəˌleɪtər/","extraExplanation":["词源：biblio-（书）+ -later（崇拜者，来自希腊语 latreia“崇拜/侍奉”）。对应的名词是 bibliolatry（书籍崇拜）。","语感与用法：bibliolater 比“book lover/avid reader（爱读书的人）”更强，常带批评意味，强调把“书本权威”看得高于理性、经验或现实。","相关词：bibliophile（藏书/爱书的人，通常褒义）；bookish（书呆子气的、书卷气的）；pedantic（迂腐的、卖弄学问的）。"]}
{"word":"bibliolatrist","summary":{"en":"A person who worships or reveres the Bible in an extreme, unquestioning way.","zh":"把《圣经》以极端、毫不质疑的方式敬奉甚至当作崇拜对象的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who treats the Bible as an object of worship, or who gives it extreme, unquestioning reverence (sometimes more than its message or spiritual meaning).","zh":"把《圣经》当作崇拜对象的人；对《圣经》抱持极端、毫不质疑的敬奉（有时甚至超过对其核心教义或精神内涵的理解）。"},"examples":[{"en":"Some critics argue that a bibliolatrist focuses on the exact wording of the text rather than its broader moral teaching.","zh":"一些批评者认为，bibliolatrist 更关注经文的字句，而不是其更广泛的道德教导。"},{"en":"In debates about interpretation, he was accused of being a bibliolatrist for refusing to consider historical context.","zh":"在关于诠释的争论中，他因拒绝考虑历史背景而被指责为 bibliolatrist。"}]}],"synonyms":["biblical literalist (sometimes)","text-worshipper","idolizer of the Bible"],"phonetic":"/ˌbɪbli.oʊˈleɪtrɪst/","extraExplanation":["这是一个带有批评意味的词：通常用于指出“把经典当成偶像（idol）来崇拜”，强调对文本本身的绝对化与僵化，而不一定是否定宗教信仰本身。","词源可拆解理解：biblio-（书，尤指《圣经》）+ -latry（崇拜/敬拜，如 idolatry“偶像崇拜”）。因此 bibliolatry 是“圣经崇拜”，bibliolatrist 是“圣经崇拜者”。","在英文宗教讨论里，它常出现在“文本主义（textualism）”“字面主义（literalism）”“基要主义（fundamentalism）”等话题附近，但并不等同于这些词；它更强调‘崇拜文本本身’这一点。"]}
{"word":"bibliolatrous","summary":{"en":"Bibliolatrous means admiring or “worshiping” books excessively, as if books are sacred.","zh":"bibliolatrous 指对书籍过度崇拜，仿佛把书当作神圣之物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Showing excessive admiration for books or written texts; worshiping books as if they were sacred.","zh":"对书籍或文字作品表现出过度崇拜；把书当作近乎神圣来膜拜。"},"examples":[{"en":"His bibliolatrous attitude made him treat old books like holy objects that shouldn’t be touched.","zh":"他对书的崇拜近乎狂热，把旧书当作神圣之物，仿佛不该被触碰。"},{"en":"She’s a passionate reader, but not bibliolatrous—she’s happy to annotate and dog-ear pages.","zh":"她很爱读书，但并不“拜书”——她乐于做批注，甚至会折页做记号。"}]}],"synonyms":["book-worshiping","overly reverent toward books","text-worshiping"],"phonetic":"/ˌbɪblɪoʊˈleɪtrəs/","extraExplanation":["词源：由 biblio-（“书”）+ -latrous（来自希腊语 latreia，“崇拜/祭奉”）构成，字面意思就是“拜书的”。","语体与语感：这是比较少见、带讽刺或批评意味的词，常用来形容把“书本权威”看得过高、过分迷信经典或文本的人。","相关词：bibliolatry（n. 拜书；对书的过度崇拜）。与 bookish（书卷气的）不同，bibliolatrous 强调“近乎宗教式的崇拜”。"]}
{"word":"bibliolatry","summary":{"en":"Bibliolatry means the worship of the Bible—treating it like an idol rather than a sacred text to interpret.","zh":"bibliolatry 指“圣经崇拜”：把《圣经》当作偶像般崇拜，而非作为需要理解与诠释的神圣经典。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the worship of the Bible; treating the Bible as an object of worship rather than as scripture to be interpreted","zh":"“圣经崇拜”；把《圣经》当作崇拜对象，而不是作为需要理解与诠释的经典"},"examples":[{"en":"Some critics argue that this approach risks bibliolatry, because it treats every verse as equally clear in all contexts.","zh":"一些批评者认为这种做法有“圣经崇拜”的风险，因为它把每一节经文都当作在所有语境中同样清楚。"},{"en":"He emphasized faith in God, not bibliolatry.","zh":"他强调的是对上帝的信仰，而不是“圣经崇拜”。"}]}],"synonyms":["Bible worship","textual idolatry"],"phonetic":"/ˌbɪbliˈɑlətri/","extraExplanation":["该词多用于神学讨论或批评语境，常见于基督教内部辩论：例如有人认为把某种特定译本、字句或解释方式绝对化，会把“文本”放到高于“上帝/信仰核心”的位置，因此被称为 bibliolatry。","词源：biblio-（书，尤其指《圣经》）+ -latry（崇拜，源自希腊语 latreia“敬拜/服侍”）。相关词：idolatry（偶像崇拜）。"]}
{"word":"bibliologic","summary":{"en":"Bibliologic means “related to the scholarly study of books,” especially the Bible as a book (bibliology).","zh":"bibliologic 指“与书籍学研究相关的”，尤指从书籍学角度研究《圣经》这本书。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to bibliology—the study of books, especially the Bible as a book (its text, formation, transmission, and authority).","zh":"与“书籍学（bibliology）”有关的；尤指与《圣经》作为一本书的研究有关（如经文形成、流传与权威等）。"},"examples":[{"en":"The professor gave a bibliologic overview of how the biblical text was copied and preserved.","zh":"教授从书籍学角度概述了《圣经》经文如何被抄写并保存下来。"},{"en":"Her paper takes a bibliologic approach rather than a purely theological one.","zh":"她的论文采用书籍学的视角，而不是纯粹的神学视角。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Relating to scholarly study of books in general; book-based or book-focused.","zh":"（较少见）与一般的书籍学术研究有关的；以书为中心的。"},"examples":[{"en":"The lecture was bibliologic in tone, focusing on editions, manuscripts, and print history.","zh":"这场讲座整体偏书籍研究风格，重点讨论版本、手稿与印刷史。"},{"en":"They discussed the novel in a bibliologic way, comparing different printings.","zh":"他们用偏“书籍研究”的方式讨论这部小说，对比不同印次。"}]}],"synonyms":["bibliological","bibliographical (related but different)","text-critical","bookish (informal)"],"phonetic":"/ˌbɪbliəˈlɑːdʒɪk/","extraExplanation":["“bibliologic”在现代英语中非常少见，写作里更常用的是“bibliological”（更常见、也更正式）或直接用名词“bibliology”。","词根提示：biblio-（书）+ -log-（学科/研究）+ -ic（……的）。因此它本质上表示“与书籍研究相关”。","在宗教学语境中，它常与“theological（神学的）”区分：bibliologic更强调文本、版本、抄本、形成史等“作为文本/书”的层面。"]}
{"word":"bibliological","summary":{"en":"“Bibliological” means “related to bibliology,” especially the academic/theological study of the Bible as a text.","zh":"“Bibliological”意为“与bibliology（书籍学/圣经论）有关的”，尤指把《圣经》作为文本来进行学术或神学层面的研究。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to bibliology (the study of books, especially the Bible as a text—its origin, authority, composition, transmission, and interpretation).","zh":"与“书籍学/圣经论（bibliology）”有关的；尤指对《圣经》作为文本的研究（其来源、权威、组成、流传与诠释）。"},"examples":[{"en":"The seminary offered a bibliological course on the formation of the biblical canon.","zh":"这所神学院开设了一门关于圣经正典形成的 bibliological 课程。"},{"en":"Her bibliological research focused on how ancient manuscripts were copied and preserved.","zh":"她的 bibliological 研究聚焦于古代手稿如何被抄写与保存。"}]}],"synonyms":["bibliologic","bibliological (theological context)","scriptural (broader)","biblical-studies-related"],"phonetic":"/ˌbɪb.li.əˈlɑː.dʒɪ.kəl/","extraExplanation":["“bibliological”来自 biblio-（书、书卷）+ -logical（……学的/……论的）。在英语里它比较少见，常见替代表达包括 biblical studies（圣经研究）、theology of Scripture（圣经神学）、textual criticism（文本批判/校勘学）等，具体用哪一个取决于研究重点。","在神学语境中，bibliology 通常指“关于圣经本身的教义/系统性讨论”，例如：启示、默示、无误、正典、翻译与诠释等议题。"]}
{"word":"bibliologies","summary":{"en":"“Bibliologies” is the plural of “bibliology”: the study of books, especially the Bible as a book and its authority.","zh":"“Bibliologies”是“bibliology”的复数：指书籍学；更常用于神学语境，指对《圣经》作为一本书及其权威等问题的研究。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study of books and bibliographic classification; in practice, it most often refers to the study of the Bible as a book (its structure, origin, and authority).","zh":"书籍学；书目学；（实际用法中常指）《圣经》学——把《圣经》作为“一本书”来研究其结构、来源与权威。"},"examples":[{"en":"In his theology course, they compared different bibliologies and how they shape interpretation.","zh":"在神学课上，他们比较了不同的“圣经论/圣经学”（bibliologies），以及这些观点如何影响解经。"},{"en":"The library science seminar touched on bibliology as the history and organization of books.","zh":"图书馆学研讨课谈到了书籍学（bibliology），包括书籍的历史与组织方式。"}]}],"synonyms":["biblical doctrine of Scripture","theology of Scripture","study of the Bible","book studies"],"phonetic":"/ˌbɪbliˈɑlədʒiz/","extraExplanation":["“Bibliology”由 biblio-（书）+ -logy（学科/研究）构成。学术语境里常见于神学，指“圣经论/圣经学”（如启示、默示、正典、权威等问题）；而在图书与出版相关语境中，也可泛指对书籍本身的研究。","本词较为学术，日常英语里更常说：the study of the Bible / biblical studies（偏广）/ bibliography（书目、参考文献）。"]}
{"word":"bibliologist","summary":{"en":"A bibliologist is a scholar who studies books—especially their history and physical features—or, less commonly, a scholar who studies the Bible.","zh":"bibliologist 指研究书籍（尤其是书的历史与物理特征）的学者；较少情况下也指研究《圣经》的学者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who studies books as physical and historical objects (their printing, editions, bindings, and publication history).","zh":"书籍学者；研究书籍本身（如印刷、版本、装帧、出版史等）的人。"},"examples":[{"en":"The bibliologist compared two editions to see which one was printed first.","zh":"这位书籍学者比较了两个版本，想确认哪一个印刷得更早。"},{"en":"In the library’s rare-book room, a bibliologist examined the paper and binding for clues.","zh":"在图书馆的珍本书室里，一位书籍学者检查纸张和装订来寻找线索。"}]},{"partOfSpeech":"n.","definition":{"en":"In some contexts, a scholar who studies the Bible (its text, history, and interpretation).","zh":"（某些语境）圣经研究者；研究《圣经》文本、历史与诠释的人。"},"examples":[{"en":"The seminar invited a bibliologist to speak about early manuscript traditions.","zh":"研讨会邀请了一位圣经研究者来谈早期手稿传统。"},{"en":"She reads biblical Greek like a bibliologist, with close attention to wording.","zh":"她像一位圣经研究者一样阅读《圣经》希腊文，非常关注用词细节。"}]}],"synonyms":["book scholar","bibliographer","book historian","biblical scholar"],"phonetic":"/ˌbɪbliˈɑːlədʒɪst/","extraExplanation":["词根提示：biblio- 表示“书”（来自希腊语 biblia），-logist 表示“研究者/专家”。因此 bibliologist 字面意思就是“研究书的人”。","用法提醒：这个词在日常英语里比较少见。谈“研究书籍版本与出版史”的领域，更常见的是 bibliographer（书目学家）或 book historian（书籍史研究者）；谈“圣经研究”，更常见的是 biblical scholar 或 theologian（视语境而定）。"]}
{"word":"bibliology","summary":{"en":"Bibliology is the academic study of the Bible, especially in theology.","zh":"Bibliology 指对《圣经》的学术研究，尤常见于神学领域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The academic study of the Bible—its origins, authorship, text, transmission, canon, and interpretation (especially in theology).","zh":"（尤用于神学中）对《圣经》的学术研究：包括其起源、作者、文本、流传、正典形成与解释等。"},"examples":[{"en":"In seminary, she took a course in bibliology to understand how the Bible was formed and preserved.","zh":"在神学院里，她选修了“圣经学（bibliology）”，以了解《圣经》如何形成并被保存下来。"},{"en":"His research in bibliology focuses on early manuscript traditions and translation history.","zh":"他的圣经学研究重点是早期手稿传统与译本历史。"}]}],"synonyms":["biblical studies","scriptural studies"],"phonetic":"/ˌbɪbliˈɑlədʒi/","extraExplanation":["“bibliology”由 biblio-（书；源自希腊语 biblos）+ -logy（学科、研究）构成，字面意思是“关于书的研究”，但在实际使用中通常特指“关于《圣经》的研究”。","在宗教学/神学语境中，bibliology 常涉及“启示观、默示论（inspiration）、无误/无谬（inerrancy/infallibility）”等议题；在更偏历史语言学的语境中，也可能更关注文本批判（textual criticism）与手稿学。"]}
{"word":"bibliomancy","summary":{"en":"Bibliomancy is fortune-telling by randomly opening a book and interpreting the passage you land on.","zh":"bibliomancy 指“书占/书卜”：随机翻开一本书并解读所见段落来占卜或寻求指引。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Divination (fortune-telling) by randomly selecting and interpreting passages from a book, especially the Bible or other sacred texts.","zh":"书占（书卜）：通过随机翻阅并解读书中的段落来占卜、预测吉凶；尤指用《圣经》或其他宗教经典进行的占卜。"},"examples":[{"en":"In the old story, she tried bibliomancy by opening the Bible and reading the first line she saw.","zh":"在那个古老的故事里，她用书占：随手翻开《圣经》，读到的第一句话就当作启示。"},{"en":"Some people treat bibliomancy as a spiritual practice, while others see it as superstition.","zh":"有人把书占当作一种灵修方式，也有人认为那只是迷信。"}]}],"synonyms":["divination","fortune-telling","sortilege"],"phonetic":"/ˈbɪbli.oʊˌmænsi/","extraExplanation":["词源：biblio-（书）+ -mancy（占卜、预言）。-mancy 常见于多种“占卜法”词汇，如 chiromancy（看手相）、necromancy（通灵/招魂术）。","文化背景：书占在不同传统中出现过，例如有人会随手翻开《圣经》或诗集寻找“指引”。现代也有人对着《哈利·波特》或诗歌做类似的随机抽取解读，更像是一种仪式感或自我反思工具。","相关表达：open a book at random（随手翻书），fortune-telling（算命/占卜），divination（占卜/预言）；更中性的说法可用 “seek guidance from a text”（从文本中寻求指引）。"]}
{"word":"bibliomane","summary":{"en":"A bibliomane is an obsessive book collector.","zh":"bibliomane 指对收集书籍过度痴迷的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is obsessively devoted to collecting books, sometimes more focused on owning them than reading them","zh":"嗜书成癖的人；痴迷于“收集/占有”书籍的人（有时重在拥有而非阅读）"},"examples":[{"en":"He’s a bibliomane who hunts rare first editions at auctions.","zh":"他是个嗜书成癖的人，经常在拍卖会上追寻稀有的初版书。"},{"en":"As a young bibliomane, she filled every corner of her apartment with books.","zh":"她年轻时嗜书成癖，把公寓的每个角落都堆满了书。"},{"en":"People joked that the bibliomane loved the smell of old paper more than the stories inside.","zh":"人们开玩笑说，这个嗜书成癖的人更爱旧纸张的味道，而不是里面的故事。"}]}],"synonyms":["bibliomaniac","book collector","bibliophile (similar but usually more positive)"],"phonetic":"ˈbɪbli.oʊ.meɪn","extraExplanation":["“bibliomane”常带一点调侃或负面意味，强调“痴迷/上瘾”的收藏冲动；相对地，“bibliophile（爱书人）”更中性，常指热爱读书与书本的人。","词源上可理解为 biblio-（书）+ -mania（狂热/癖好）。该词在英语里较少见，更常用的是“bibliomaniac”。"]}
{"word":"bibliomania","summary":{"en":"Bibliomania means an obsessive passion for collecting books.","zh":"bibliomania 指对藏书的痴迷式热爱（藏书癖）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an intense love of collecting books, often to an obsessive or unhealthy degree","zh":"藏书癖；对收集书籍的强烈热爱（有时近乎痴迷或不健康）"},"examples":[{"en":"His bibliomania filled every room with stacks of old books.","zh":"他的藏书癖让每个房间都堆满了旧书。"},{"en":"She joked that her bibliomania was why she never had space for new furniture.","zh":"她开玩笑说，自己的藏书癖就是为什么家里永远没地方放新家具。"}]}],"synonyms":["book-collecting obsession","book hoarding (informal)","bibliophily (related, usually positive)"],"phonetic":"/ˌbɪblioʊˈmeɪniə/","extraExplanation":["词源：biblio-（书）+ -mania（狂热/痴迷）。常与“bibliophile（爱书的人）”对比：bibliophile 通常是健康的“爱书”，而 bibliomania 更强调“痴迷到影响生活”。","用法提示：在日常对话里多带一点幽默或夸张的语气；在正式语境（如心理或行为讨论）中可表示“强迫性囤书/收集”。"]}
{"word":"bibliomaniac","summary":{"en":"A bibliomaniac is someone who loves and collects books, sometimes obsessively.","zh":"bibliomaniac 指爱书、藏书的人，常带“痴迷到有点过头”的语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who loves and collects books, sometimes in an obsessive way","zh":"藏书爱好者；嗜书者（有时带有“痴迷、近乎上瘾”的意味）"},"examples":[{"en":"He’s a bibliomaniac who can’t leave a bookstore without buying something.","zh":"他是个嗜书者，只要进了书店就很难空手出来。"},{"en":"As a bibliomaniac, she keeps rare editions in a special cabinet.","zh":"作为一名藏书爱好者，她把珍稀版本放在专门的柜子里保存。"}]}],"synonyms":["book collector","bibliophile (more neutral)"],"phonetic":"/ˌbɪbli.oʊˈmeɪni.æk/","extraExplanation":["词源提示：biblio- 来自希腊语，表示“书”；-maniac 表示“狂热者/痴迷者”。因此 bibliomaniac 字面意思是“对书痴迷的人”。在英语里它常带一点夸张或半开玩笑的语气，但也可能暗示不太健康的“过度沉迷”。","用法辨析：bibliophile 通常更中性，表示“爱书的人”；bibliomaniac 更强调“收集欲强、停不下来”。"]}
{"word":"bibliomaniacal","summary":{"en":"Bibliomaniacal describes someone with an extreme (sometimes obsessive) passion for collecting or owning books.","zh":"bibliomaniacal 用来形容对藏书/买书有极端、近乎痴迷的热爱。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having an extreme, sometimes obsessive love for collecting or owning books.","zh":"对书籍的收藏或占有有极端（有时近乎痴迷的）热爱。"},"examples":[{"en":"Her bibliomaniacal buying habits filled every corner of the apartment with books.","zh":"她近乎“书痴”的买书习惯把公寓的每个角落都塞满了书。"},{"en":"He wasn’t just a reader—he had a bibliomaniacal urge to own first editions.","zh":"他不只是爱读书——他还有一种近乎痴迷的冲动，想拥有初版书。"}]}],"synonyms":["book-mad","obsessive about books","bibliomanic","book-collecting"],"phonetic":"/ˌbɪbli.oʊməˈnaɪəkəl/","extraExplanation":["这个词较少见，多用于书面或幽默语境，带一点夸张色彩；常暗示“收藏欲/占有欲”比“阅读本身”更强。","词根来自 bibliomania（爱书成癖、藏书癖）：biblio- 表示“书”，-mania 表示“狂热/痴迷”；-acal 表示“……的”。"]}
{"word":"bibliomanian","summary":{"en":"Bibliomanian means a book-obsessed collector (or relating to such obsession).","zh":"bibliomanian 指“藏书成癖的人”，或形容对收藏书籍的痴迷。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who has an extreme passion for collecting or owning books (often more about possessing them than reading them); a bibliomaniac.","zh":"对收藏、占有书籍有极度痴迷的人（常常更在意“拥有”而非“阅读”）；藏书癖者。"},"examples":[{"en":"He’s a bibliomanian who buys rare editions even when he has no shelf space left.","zh":"他是个藏书癖者，即使书架都放不下了也要买珍稀版本。"},{"en":"The apartment looked like a bibliomanian’s dream—books stacked from floor to ceiling.","zh":"那间公寓像藏书癖者的梦想——书从地板一直堆到天花板。"}]},{"partOfSpeech":"adj.","definition":{"en":"showing an obsessive love of collecting books; like a bibliomaniac.","zh":"表现出对藏书的痴迷；藏书癖式的。"},"examples":[{"en":"Her bibliomanian habits started in college when she discovered used-book stores.","zh":"她的“藏书癖式”习惯始于大学时期，那时她发现了二手书店。"},{"en":"He made a bibliomanian promise to never lend out his first editions.","zh":"他做了个“藏书癖式”的承诺：绝不外借他的初版本。"}]}],"synonyms":["bibliomaniac","book collector (often humorous)","bibliomaniacal","book-obsessed"],"phonetic":"/ˌbɪblioʊˈmeɪniən/","extraExplanation":["“bibliomanian”在现代英语中不算常见，更常用的是 **bibliomaniac**（名词）或 **bibliomaniacal**（形容词）。","词源可拆成 **biblio-**（书）+ **-mania**（狂热、躁热），整体指对书籍的“过度热爱/占有欲”。","它通常带一点幽默或轻微负面意味：强调“收集到失控”，不等同于单纯爱读书（更中性常用 **book lover** / **avid reader**）。"]}
{"word":"bibliomanianism","summary":{"en":"Bibliomania means an obsessive passion for collecting books, sometimes in an unhealthy way.","zh":"Bibliomania 指对收藏书籍的痴迷（藏书癖），有时会带有不健康的“占有欲”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an intense, sometimes unhealthy obsession with collecting or owning books (often valuing possession over reading).","zh":"对收集或占有书籍的强烈（有时不健康的）痴迷，常常重“拥有”胜过“阅读”。"},"examples":[{"en":"His bibliomania led him to buy rare editions he never had time to read.","zh":"他的“藏书癖”让他买下许多珍稀版本，但根本没时间读。"},{"en":"The documentary explored how bibliomania can turn a hobby into an obsession.","zh":"这部纪录片探讨了“藏书”如何从爱好变成痴迷。"}]}],"synonyms":["book collecting (neutral)","obsession with books","compulsive book collecting"],"phonetic":"/ˌbɪbli.oʊˈmeɪniə/","extraExplanation":["你写的“bibliomanianism”并不是常见标准词形。英语里更常用的是 bibliomania（藏书癖）和 bibliomaniac（藏书癖患者/书籍收集成瘾者）。","词源：biblio-（书）来自希腊语 biblion；-mania（狂热、躁狂）也来自希腊语，常用于描述对某事物的极端迷恋。"]}
{"word":"bibliomanic","summary":{"en":"“Bibliomanic” means obsessively fond of collecting books.","zh":"“bibliomanic” 指对藏书或买书痴迷到近乎失控。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(describing a person) obsessively fond of collecting or owning books; “book-mad.” Example: He’s bibliomanic—he buys more books than he can read. / She joked, “My bibliomanic habits need a bigger bookshelf.”","zh":"（形容人）对收集或拥有书籍到了近乎痴迷的程度；“爱书成癖/藏书成癖”。例：他很 bibliomanic——买的书多到根本读不完。/ 她开玩笑说：“我这种 bibliomanic 的习惯需要更大的书架。”"},"examples":[{"en":"He’s bibliomanic—he buys more books than he can read.","zh":"他爱书成癖——买的书多到根本读不完。"},{"en":"She joked that her bibliomanic habits require a bigger bookshelf.","zh":"她开玩笑说她藏书成癖的习惯需要更大的书架。"}]}],"synonyms":["book-mad","book-obsessed","bibliophilic (similar, often milder)"],"phonetic":"/ˌbɪblioʊˈmænɪk/","extraExplanation":["词源提示：biblio- 表示“书”（来自希腊语 biblion），-manic 表示“狂热/痴迷”。因此 bibliomanic 直观意思就是“对书的狂热”。","语气与用法：常带一点幽默或夸张的自嘲色彩，但也可用于较严肃的语境，形容“强迫式、失控式”的买书或藏书冲动。","相关词对比：bibliophile（爱书的人）语气更中性/褒义；bibliomanic 更强调“过度、近乎上瘾”。"]}
{"word":"bibliomanism","summary":{"en":"Bibliomanism means an obsessive, sometimes unhealthy, urge to collect books (often rare ones).","zh":"bibliomanism 指对藏书的极端痴迷，常带有不健康、强迫性的含义（多指收集珍本）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An extreme or obsessive passion for collecting books, especially rare or valuable ones, sometimes to an unhealthy degree.","zh":"对藏书（尤其是珍本、稀有书籍）的极端或近乎病态的痴迷与收集欲。"},"examples":[{"en":"His bibliomanism led him to buy first editions he couldn’t afford.","zh":"他的藏书癖让他去买自己负担不起的初版本。"},{"en":"The museum’s curator warned that bibliomanism can make people value books as trophies rather than as sources of ideas.","zh":"博物馆的馆长提醒说，藏书癖可能会让人把书当作战利品，而不是思想的来源。"}]}],"synonyms":["book-collecting obsession","compulsive book collecting"],"phonetic":"/ˌbɪbli.oʊˈmeɪni.əˌmɪzəm/","extraExplanation":["这个词常与更中性的 bibliophilia（爱书、喜爱阅读或藏书）对比：bibliomanism 带有“失控、强迫性”的意味，语气更负面。","历史上常被用来形容19世纪欧洲的“珍本热”和拍卖场上的疯狂竞价；有些文章会提到英国藏书家托马斯·菲利普斯（Sir Thomas Phillipps）的极端收藏行为作为典型案例。","词源构成：biblio-（书）+ mania（狂热、躁狂）+ -ism（倾向/主义），所以字面意思接近“对书的狂热倾向”。"]}
{"word":"bibliomanist","summary":{"en":"A bibliomanist is someone who obsessively collects books.","zh":"bibliomanist 指“对收集书籍痴迷的藏书癖者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who obsessively collects books, often valuing owning them more than reading or using them","zh":"藏书癖者；对收集书籍上瘾的人（常常重“拥有”胜过“阅读/使用”）"},"examples":[{"en":"He’s a bibliomanist who buys rare editions even when he has no shelf space left.","zh":"他是个藏书癖者，即使书架都满了也还在买稀有版本。"},{"en":"Some bibliomanists chase first editions for the history and status, not for the story.","zh":"有些藏书癖者追逐初版是为了历史与身份象征，而不是为了故事本身。"},{"en":"She joked that her wallet suffers because she’s a bibliomanist.","zh":"她开玩笑说自己的钱包遭罪，是因为她有藏书癖。"}]}],"synonyms":["book collector","bibliophile (often milder)","book hoarder (informal, often negative)"],"phonetic":"/ˌbɪblioʊˈmeɪnɪst/","extraExplanation":["“bibliomanist”来自 biblio-（书）+ mania（狂热、癖好）+ -ist（从事者/…的人）。更常见的相关词是“bibliomania”（藏书癖）和“bibliophile”（爱书人）。前者偏“痴迷甚至失控”，后者更中性、偏“喜爱阅读与书本文化”。","英语里这一类词常带轻微调侃意味，用来形容“买书如山倒、读书如抽丝”的人；但在正式语境中也可指真正的强迫性收藏行为。","关于“bibliomania”一词的流行，常被追溯到19世纪英国作家 Thomas Frognall Dibdin 的作品（如《Bibliomania; or Book-Madness》），描写了当时对稀有版本与初版的狂热。"]}
{"word":"biblion","summary":{"en":"Biblion is a rare English borrowing from Greek meaning “book,” mostly used in scholarly or literary contexts and in the root biblio-.","zh":"Biblion 是从希腊语借入的少见词，意思是“书”，多用于学术/文学语境，也常见于词根 biblio- 中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) a book; originally the Greek word for “book,” often seen in academic or literary contexts.","zh":"（少见用法）书；源自希腊语“书”的词，常见于学术或文学语境。"},"examples":[{"en":"In some Greek texts, “biblion” simply means “book.”","zh":"在一些希腊文文本中，“biblion”就是“书”的意思。"},{"en":"The scholar used the term biblion when discussing ancient manuscripts.","zh":"那位学者在讨论古代手稿时使用了 biblion 这个词。"}]}],"synonyms":["book","volume","tome"],"phonetic":"/ˈbɪbliən/","extraExplanation":["biblion 来自古希腊语 βίβλιον（bíblion，意为“书/卷册”）。在现代英语里它本身不算常用词，但常作为词根出现在 biblio- 开头的词中，如 bibliophile（爱书者）、bibliography（书目/参考文献）、Bible（圣经，词源同源）。","在阅读文学或学术写作时，看到 biblion 往往是在强调“书”作为文化载体（文本、卷轴、典籍）的意味，而不仅仅是日常的 book。"]}
{"word":"bibliopegic","summary":{"en":"Bibliopegic means “related to bookbinding.”","zh":"bibliopegic 指“与书籍装订/装帧有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the binding of books; connected with bookbinding.","zh":"与装订书籍有关的；装帧的。"},"examples":[{"en":"The museum displayed bibliopegic tools such as presses and sewing frames.","zh":"博物馆展出了与装帧有关的工具，比如压书机和缝书架。"},{"en":"She wrote a short guide to bibliopegic techniques used in hand-bound journals.","zh":"她写了一本关于手工笔记本常用装帧技法的简明指南。"}]}],"synonyms":["bookbinding","binding","bibliopolic (related but different: book trade)"],"phonetic":"ˌbɪbliəˈpɛdʒɪk","extraExplanation":["这是一个非常少见、偏学术/专业的词，多出现在古籍修复、图书馆学、装帧史等语境里。日常英语里更常用 bookbinding（名词）或 bookbinding / binding（形容词用法）。","词源上由 biblio-（书、书籍）+ -pegic（与“固定/装订”相关的词根）构成，因此语义直观：与“把书固定成册（装订）”有关。"]}
{"word":"bibliopegically","summary":{"en":"“Bibliopegically” means “in a way related to bookbinding.”","zh":"“bibliopegically”意为“以与装订／装帧有关的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to bookbinding (the craft of assembling and covering books).","zh":"以与装帧／装订（制作书籍、装配书页并加封面）有关的方式。"},"examples":[{"en":"The old manuscript was repaired bibliopegically, with a new spine and reinforced stitching.","zh":"这份古老手稿以装订工艺的方式进行了修复：换了新书脊，并加固了缝线。"},{"en":"The conservator examined the volume bibliopegically, noting the style of the binding and the materials used.","zh":"修复师从装帧角度检查了这册书，记录了装订风格和所用材料。"}]}],"synonyms":["in terms of bookbinding","from a bookbinding perspective","with respect to bookbinding"],"phonetic":"/ˌbɪbliəˈpɛdʒɪkli/","extraExplanation":["这是一个非常少见、偏学术的副词，多用于图书馆学、文献修复、古籍鉴定等语境。","词根拆解：biblio-（书）+ -peg-（与“固定/装订”相关）+ -ically（以……方式）。日常英语更常说：in terms of bookbinding / from a bookbinding perspective。"]}
{"word":"bibliopegist","summary":{"en":"A bibliopegist is a (rare, formal) word for a bookbinder—someone who binds or repairs books.","zh":"bibliopegist 是“书籍装订师/装订工”的较少见、偏正式说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who binds books; a bookbinder (rare, formal).","zh":"装订书的人；书籍装订工（较少见、偏正式）"},"examples":[{"en":"The museum hired a bibliopegist to restore several 18th‑century volumes.","zh":"博物馆雇了一位书籍装订师来修复几本18世纪的书。"},{"en":"As a bibliopegist, she specializes in repairing damaged spines and covers.","zh":"作为一名装订师，她专门修复破损的书脊和封面。"}]}],"synonyms":["bookbinder","binder","conservator (context: book conservation)"],"phonetic":"/ˌbɪblioʊˈpiːdʒɪst/","extraExplanation":["这个词非常少见，日常英语里更常用 bookbinder（装订工/装订师）。","词源可拆为 biblio-（与“书”有关）+ -pegist（与“装订/固定”有关），整体就是“把书装订起来的人”。","在古籍修复、图书馆保护（conservation）或手工装帧（fine binding）的语境中更可能见到。"]}
{"word":"bibliopegistic","summary":{"en":"A rare adjective meaning “related to bookbinding,” often seen in the phrase “anthropodermic bibliopegistic” (bound in human skin).","zh":"一个罕见形容词，意为“与书籍装订有关”；常见于“anthropodermic bibliopegistic（人皮装帧的）”这一说法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the binding of books, especially (in the rare phrase \"anthropodermic bibliopegistic\") the binding of a book in human skin.","zh":"与装订书籍有关的；尤其在罕见表达“anthropodermic bibliopegistic（人皮装帧的）”中，指用人皮装订书籍的。"},"examples":[{"en":"The museum labeled the volume as \"anthropodermic bibliopegistic,\" meaning it was reportedly bound in human skin.","zh":"博物馆把那本书标注为“anthropodermic bibliopegistic”，意思是据称它用人皮装订。"},{"en":"In most contexts, \"bibliopegistic\" simply means \"connected to bookbinding.\"","zh":"在大多数语境中，“bibliopegistic”只是指“与书籍装订有关”。"}]}],"synonyms":["bookbinding-related","bibliopegic"],"phonetic":"ˌbɪbli.oʊpəˈdʒɪstɪk","extraExplanation":["这是一个非常罕见、偏学术的词，来自 biblio-（书）+ -peg-（装订/固定）相关词根，常见于“anthropodermic bibliopegistic”这一固定搭配。单独使用时，通常泛指“与书籍装订有关”。","由于该词常涉及“人皮装帧”这一历史争议话题，现代写作中建议谨慎使用，并在学术/博物馆语境下给出清晰说明（例如“allegedly/ reportedly 据称”），避免猎奇化。"]}
{"word":"bibliopegistical","summary":{"en":"Bibliopegistical means “related to bookbinding.” It’s a rare, formal word.","zh":"bibliopegistical 意为“与书籍装订有关的”，属于罕见且较正式的词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the binding of books (especially the craft or practice of bookbinding).","zh":"与装订书籍有关的；（尤指）与书籍装帧/装订工艺有关的。"},"examples":[{"en":"She wrote a bibliopegistical study of 18th-century leather bindings.","zh":"她写了一篇关于18世纪皮革装订的书籍装订研究。"},{"en":"The museum’s bibliopegistical workshop teaches how to sew and bind pages by hand.","zh":"博物馆的装订工坊教授如何手工缝线并装订书页。"}]}],"synonyms":["bookbinding","bookbindery (related)","binding (related)"],"phonetic":"ˌbɪblioʊpɪˈdʒɪstɪkəl","extraExplanation":["这个词非常罕见，主要出现在书籍史、图书馆学、古籍修复与装帧研究等语境中；日常英语里更常用 bookbinding 或 bookbinder。","词源可拆为 biblio-（书）+ -pegistic（与“固定/装订”相关，源自希腊语词根，指把书页“连接固定”起来）。"]}
{"word":"bibliopegy","summary":{"en":"Bibliopegy means the craft or practice of binding books (bookbinding).","zh":"bibliopegy 指“书籍装订术/装订（书）”，即 bookbinding。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the art or practice of binding books; bookbinding","zh":"装订术；书籍装订（把书页装成书的工艺/实践）"},"examples":[{"en":"She studied bibliopegy to learn how to repair old books.","zh":"她学习装订术，以便修复旧书。"},{"en":"The library hired a specialist in bibliopegy to rebind damaged volumes.","zh":"图书馆雇了一位装订专家来重新装订受损的册本。"}]}],"synonyms":["bookbinding","binding","bookbinding craft"],"phonetic":"/ˌbɪbliˈɑpədʒi/","extraExplanation":["这是一个比较少见、偏学术的词，常见场景多在图书馆学、书籍修复、古籍保护与手工艺领域。日常英语里更常说 bookbinding。","词源上，biblio- 表示“书”（如 bibliography 参考文献、bibliophile 爱书之人），-pegy 来自希腊语，和“固定、装订”有关。了解词根能帮助你猜出词义。","相关词：binder（装订工/装订机）、bind（装订；捆绑）、rebinding（重新装订）、book conservation（书籍保护/修复）。"]}
{"word":"bibliophage","summary":{"en":"A bibliophage is an avid reader who “devours” books.","zh":"bibliophage 指嗜书如命、读书像“吞书”一样快且投入的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who loves reading so much that they “devour” books; an enthusiastic, sometimes obsessive reader.","zh":"嗜书者；特别爱读书、仿佛“把书吃掉”的人（指非常热衷、甚至有点痴迷的读者）。"},"examples":[{"en":"She’s a real bibliophage—she finishes a novel every two days.","zh":"她真是个嗜书者——两天就能读完一本小说。"},{"en":"As a kid, he was a quiet bibliophage who spent weekends at the library.","zh":"他小时候很安静，是个小小嗜书者，周末总泡在图书馆。"}]}],"synonyms":["bookworm","avid reader","voracious reader","bibliophile"],"phonetic":"/ˈbɪbliəˌfeɪdʒ/","extraExplanation":["这个词比较少见，常带一点幽默或夸张色彩，用来形容“读书读到停不下来”的人。","词源来自希腊语：biblio-（书）+ -phage（吃、吞食），字面意思是“吃书的人”。"]}
{"word":"bibliophagic","summary":{"en":"Bibliophagic means “related to eating books,” sometimes used figuratively for “devouring books by reading.”","zh":"bibliophagic 指“吃书、吞食书本的”，也偶尔可比喻“像吃一样疯狂读书”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Eating or consuming books; relating to the act of book-eating (literally or, less commonly, figuratively).","zh":"（较少见）吃书、吞食书本的；与“食书（吞食书页）”这种行为有关的（可指字面，也较少用于比喻）。"},"examples":[{"en":"The artist staged a bibliophagic performance by chewing pages made of edible paper.","zh":"那位艺术家做了一场“食书”的表演，咀嚼用可食用纸做成的书页。"},{"en":"In some survival stories, people describe a nearly bibliophagic urge to use anything—paper included—for calories.","zh":"在一些求生故事里，人们会描述一种近乎“食书”的冲动：为了热量，连纸都可能被当作食物。"},{"en":"(Figurative) She was bibliophagic in college, devouring novels every weekend.","zh":"（比喻）她大学时特别“啃书”，每个周末都要读完好几本小说。"}]}],"synonyms":["book-eating","bibliophagous","voracious (reader)","book-devouring"],"phonetic":"/ˌbɪbliəˈfædʒɪk/","extraExplanation":["“bibliophagic” 来自 Greek/拉丁化词根：biblio-（书）+ -phagic（吃、吞食，来自 -phagy）。它很少用于日常英语；更常见的名词是 “bibliophagy”（食书、吞食书本）。在比喻义上，它偶尔可用来形容“像吃东西一样疯狂读书”，但更自然的表达通常是 “voracious reader / book devourer”。"]}
{"word":"bibliophagist","summary":{"en":"A rare word meaning an extremely avid reader—someone who “devours” books.","zh":"一个较少见的词，指极其爱读书、读书如“吞书”般的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who “devours” books; an extremely avid reader (often a playful or humorous word).","zh":"“吞书的人”；指极其爱读书、读书如饥似渴的人（常带幽默/俏皮语气）。"},"examples":[{"en":"She’s a real bibliophagist—she finishes two novels every weekend.","zh":"她真是个“吞书的人”——每个周末都能读完两本小说。"},{"en":"During the holidays, I turn into a bibliophagist and read late into the night.","zh":"假期里我会变成一个“吞书的人”，常常读到深夜。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, literal) Someone who eats books or paper.","zh":"（罕见，字面义）吃书或吃纸的人。"},"examples":[{"en":"In the legend, the cursed man became a bibliophagist and chewed pages to survive.","zh":"传说里，那名受诅咒的人变成了“吃书者”，靠嚼书页维生。"}]}],"synonyms":["bookworm","voracious reader","avid reader","book lover"],"phonetic":"/ˌbɪbliəˈfeɪdʒɪst/","extraExplanation":["这个词非常少见，更多是“书面/玩笑式”的夸张说法，用来形容读书速度快、阅读量大的人。","词源可拆为 biblio-（书）+ -phagist（吃的人），来自希腊语 phagein（吃）。常见近义表达更自然：bookworm（书虫）、voracious reader（如饥似渴的读者）、avid reader（热爱阅读的人）。"]}
{"word":"bibliophagous","summary":{"en":"Bibliophagous means “devouring books”—someone who reads an unusually large amount, often with a playful tone.","zh":"bibliophagous 指“像吞书一样读书”的人，形容阅读量非常大，常带夸张或幽默语气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a person) extremely fond of reading or “devouring” books; book-eating in a figurative sense.","zh":"（指人）极其爱读书、像“吞书”一样大量阅读的；比喻意义上的“吃书”。"},"examples":[{"en":"She’s bibliophagous—she finishes a novel every two days.","zh":"她特别“嗜书如命”——两天就能看完一本小说。"},{"en":"During the summer, I became bibliophagous and lived in the library.","zh":"那个夏天我变得疯狂爱看书，几乎住在图书馆里。"}]},{"partOfSpeech":"adj.","definition":{"en":"Literally, book-eating; describing something that consumes books (rare, often humorous or playful).","zh":"字面义：吃书的；形容会“吃掉”书的东西（很少用，多为幽默/玩笑）。"},"examples":[{"en":"The author joked about a bibliophagous monster that ate all the textbooks.","zh":"作者开玩笑写了个吃掉所有教材的“吃书怪”。"}]}],"synonyms":["bookish","well-read","literary","avid (reader)","book-loving"],"phonetic":"/ˌbɪbliˈɑːfəɡəs/","extraExplanation":["词源小提示：biblio- 表示“书”，-phagous 来自希腊语 phagein（吃）。因此它常带有夸张、幽默的语气，用来形容“读书读到停不下来”。","使用场景：这个词比较少见，写作或夸张表达时更常用。日常口语里通常说 book-loving / an avid reader / a bookworm（书虫）。","相关词：bibliophile（爱书的人，偏“喜欢/收藏书”）；bookworm（爱看书的人，较口语）；phagocyte（吞噬细胞，同源词根 -phage/-phagous）。"]}
{"word":"bibliophil","summary":{"en":"A bibliophile is someone who loves books, especially reading and collecting them.","zh":"bibliophile 指“爱书的人”，尤其爱读书和藏书的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who loves books, especially collecting and reading them","zh":"爱书的人；（尤指）爱读书、爱藏书的人"},"examples":[{"en":"She’s a bibliophile who visits used bookstores every weekend.","zh":"她是个爱书的人，每个周末都会去逛二手书店。"},{"en":"As a lifelong bibliophile, he built a small library at home.","zh":"作为一名终身的爱书者，他在家里建了一个小型图书馆。"}]}],"synonyms":["book lover","bookworm","collector","reader"],"phonetic":"/ˈbɪbliəˌfaɪl/","extraExplanation":["你输入的“bibliophil”更常见的标准拼写是 **bibliophile**（词尾 -phile）。","词源上来自希腊语：**biblio-**（书）+ **-phile**（爱好者、爱…的人）。因此它带有一种“对书的热爱/痴迷”的意味，语气通常是正面的。"]}
{"word":"bibliophile","summary":{"en":"A bibliophile is someone who loves books, often enjoying reading and/or collecting them.","zh":"bibliophile 指爱书的人，常指喜欢阅读和/或收藏书籍的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who loves books, especially collecting and reading them.","zh":"爱书的人；藏书家（尤其喜欢收藏和阅读书籍的人）。"},"examples":[{"en":"My aunt is a bibliophile; her apartment is full of novels and poetry.","zh":"我阿姨是个爱书的人；她的公寓里到处都是小说和诗集。"},{"en":"He’s a bibliophile who spends weekends browsing used bookstores.","zh":"他是个爱书的人，周末常去逛二手书店。"}]}],"synonyms":["book lover","avid reader","bookworm"],"phonetic":"/ˈbɪbliəˌfaɪl/","extraExplanation":["词源：来自希腊语 biblio-（书）+ -phile（爱好者）。在英语里，-phile 常见于表示“爱好/迷恋某事的人”，如 audiophile（音响/音频发烧友）、Francophile（亲法者）。","用法提示：bibliophile 通常是褒义，强调“热爱阅读与书本文化”。若强调“过度囤书、买书成瘾”，有时会用更偏调侃的词 tsundoku（买书不读的囤书行为，外来词）或 book hoarder（囤书者）。","文化语境：英美文化里常把 bibliophile 与独立书店、图书馆、读书会联系在一起；也可指对“版本、装帧、初版书”等有收藏兴趣的人（偏收藏意义）。","相关表达：book lover（更口语、常用）、avid reader（强调读得多）、bookworm（书虫，常指沉迷读书的人，略带戏谑但多为友好）。"]}
{"word":"bibliophiles","summary":{"en":"Bibliophiles are people who love books, especially reading and collecting them.","zh":"Bibliophiles 指爱书的人，尤其热爱阅读与收藏书籍。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who loves books, especially collecting, reading, or caring for them","zh":"爱书的人；嗜书者（尤其喜欢收藏、阅读或珍爱书籍的人）"},"examples":[{"en":"The shop is a paradise for bibliophiles who enjoy rare first editions.","zh":"这家店对喜欢稀有初版书的爱书者来说简直是天堂。"},{"en":"She’s a bibliophile, so she always gives books as gifts.","zh":"她是个嗜书者，所以她总爱送书当礼物。"}]}],"synonyms":["book lover","book collector","bookworm (more casual)"],"phonetic":"/ˈbɪbliəˌfaɪl/","extraExplanation":["“bibliophile”来自希腊语：biblio-（书）+ -phile（爱好者）。复数是 bibliophiles。","语气通常是褒义，强调“爱书、懂书”。如果想表达“沉迷到影响生活”，英语更常用 bookworm（书虫）但语感更口语。"]}
{"word":"bibliophilia","summary":{"en":"Bibliophilia means a strong love of books, especially reading and collecting them.","zh":"Bibliophilia 指对书籍的强烈热爱，尤指阅读与收藏书籍。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong love of books, especially collecting and reading them","zh":"对书籍的强烈热爱，尤指阅读与收藏书籍"},"examples":[{"en":"Her bibliophilia filled every room with shelves of novels and poetry.","zh":"她对书的热爱让每个房间都摆满了小说和诗集的书架。"},{"en":"Bibliophilia doesn’t mean you own many books; it can simply mean you love reading.","zh":"“爱书癖/嗜书”不一定代表你拥有很多书；也可以只是非常爱阅读。"},{"en":"His bibliophilia led him to spend weekends at used bookstores.","zh":"他对书的热爱让他周末常去逛二手书店。"}]}],"synonyms":["love of books","book love","bookishness"],"phonetic":"/ˌbɪbli.oʊˈfɪli.ə/","extraExplanation":["词源：biblio-（书）+ -philia（热爱）。在日常语境中常指“爱书、爱读书”，有时也带“爱收藏书”的意味。","近义词提示：bibliophilia 偏“爱书/嗜书”（中性或偏褒义）；bibliomania 则更像“对买书/藏书的强迫或痴迷”，语气更强。","文化小知识：英语里有时会用 a bibliophile（爱书的人）来指代有此兴趣的人，比 bibliophilia 更常用来称呼“某个人”。"]}
{"word":"bibliophilic","summary":{"en":"Bibliophilic describes someone who loves books—especially reading and/or collecting them.","zh":"bibliophilic 用来形容“爱书的”，强调喜欢阅读或收藏书。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Loving books and enjoying reading, collecting, or being surrounded by books.","zh":"爱书的；喜欢阅读、收藏书或与书为伴的。"},"examples":[{"en":"She’s bibliophilic and can spend hours browsing in a bookstore.","zh":"她很爱书，可以在书店里逛上好几个小时。"},{"en":"His bibliophilic habits include keeping a notebook of favorite quotes.","zh":"他爱书的习惯之一是把喜欢的名言摘抄在笔记本里。"}]}],"synonyms":["book-loving","bookish","literary"],"phonetic":"/ˌbɪbliəˈfɪlɪk/","extraExplanation":["词源上来自希腊语：biblio-（书）+ -philic（喜爱……的）。它常用来形容“爱书的人/气质”，语气偏正式，也带一点文艺感。","相关词：bibliophile（n. 爱书的人）；bibliomania（n. 藏书癖/对藏书的病态痴迷，语气更强）；bookish（adj. 书生气的/喜欢读书但也可能暗示不太擅长社交）。"]}
{"word":"bibliophilism","summary":{"en":"Bibliophilism means a strong love of books, often involving collecting and valuing them.","zh":"bibliophilism 指对书籍的强烈热爱，常包含收藏与珍视书籍。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The love of books, especially collecting, reading, and valuing them as objects or sources of knowledge.","zh":"爱书癖；嗜书（对书籍的热爱，尤指收藏、阅读，并重视书籍的价值）"},"examples":[{"en":"Her bibliophilism shows in the way she carefully repairs old paperbacks.","zh":"她对书的热爱体现在她会细心修补旧平装书。"},{"en":"What started as a hobby became bibliophilism: he began hunting for rare first editions.","zh":"原本只是爱好，后来变成了嗜书：他开始寻找稀有的初版本。"},{"en":"The library felt like home to him because of his quiet bibliophilism.","zh":"因为他那种安静的爱书之情，图书馆对他来说像家一样。"}]}],"synonyms":["bibliophilia","love of books","book collecting"],"phonetic":"/ˌbɪbliəˈfaɪlɪzəm/","extraExplanation":["“bibliophilism”来自希腊语词根：biblio-（书）+ -phil-（爱）+ -ism（倾向/主义）。日常英语里更常用“bibliophilia”（爱书）或“bibliophile”（爱书的人）；“bibliophilism”较少见，通常用来强调一种长期、明显的嗜好或倾向。","语感区别：bibliophilism通常偏中性或带一点“癖好”的意味；如果强调不健康的强迫性囤书，有时会用更口语的“book hoarding”或开玩笑说“book addiction”。"]}
{"word":"bibliophilist","summary":{"en":"A bibliophilist is a lover of books, often someone who collects or deeply appreciates them.","zh":"bibliophilist 指爱书的人，常指喜欢收藏或深度鉴赏书籍的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who loves books, especially collecting or appreciating them","zh":"爱书的人；（尤指）喜爱并收藏、鉴赏书籍的人"},"examples":[{"en":"She’s a bibliophilist who collects first editions.","zh":"她是个爱书藏书的人，专门收藏初版书。"},{"en":"As a bibliophilist, he enjoys the smell and feel of old books.","zh":"作为一个爱书的人，他很享受旧书的气味和触感。"}]}],"synonyms":["bibliophile","book lover","book collector"],"phonetic":"/ˌbɪbliˈɑfəlɪst/","extraExplanation":["“bibliophilist”较少见，更常用的词是“bibliophile”（爱书者）。两者意思基本相同。","词源可拆解为 biblio-（书）+ -phil-（喜爱）+ -ist（……的人），整体就是“爱书之人”。","注意区分：bibliophile 通常是正向、温和的“爱书/藏书”；bibliomania 则偏“对藏书的狂热/痴迷”，有时带负面含义。"]}
{"word":"bibliophilistic","summary":{"en":"Bibliophilistic describes a strong love of books, especially in a book-collecting or bookish style.","zh":"bibliophilistic 指“爱书的、书迷式的”，常带有强调书卷气或爱收藏阅读的意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a love of books, especially collecting or enjoying books in an enthusiastic way.","zh":"与爱书（尤其是热衷于收藏或阅读书籍）有关的；书迷式的。"},"examples":[{"en":"Her bibliophilistic habits include visiting used bookstores every weekend.","zh":"她的书迷习惯包括每个周末去逛二手书店。"},{"en":"The room had a warm, bibliophilistic feel—shelves, notes in the margins, and stacks of novels.","zh":"这个房间有一种温暖的书迷氛围——书架、页边批注，还有一摞摞小说。"}]}],"synonyms":["bibliophilic","bookish","literary"],"phonetic":"/ˌbɪbliəfəˈlɪstɪk/","extraExplanation":["“bibliophilistic”并不是最常见的标准用词；更常见的是“bibliophilic”（爱书的）或名词“bibliophile”（爱书者、藏书家）。它通常用于较幽默或较文学化的语境，用来强调“书迷气质/书迷风”。","词源上可拆成 biblio-（书）+ -phil-（爱）+ -istic（……风格的/与……有关的）。"]}
{"word":"bibliophily","summary":{"en":"Bibliophily means a love of books, often including collecting and caring for them.","zh":"Bibliophily 指对书的热爱，常包含收藏与珍爱书籍的习惯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a love of books, especially collecting, reading, or caring for them as objects (often rare or beautiful editions)","zh":"爱书癖；藏书与爱书之情（尤其指对书籍的收藏、阅读，或对精装/珍本等“作为物件的书”的喜爱）"},"examples":[{"en":"Her bibliophily began in childhood, when she spent every weekend at the public library.","zh":"她的爱书之情始于童年，那时她每个周末都泡在公共图书馆。"},{"en":"His bibliophily shows in the way he protects his old books from sunlight and moisture.","zh":"他对书的喜爱体现在他会避免阳光和潮气损坏旧书。"},{"en":"The auction attracted collectors whose bibliophily focused on first editions.","zh":"这场拍卖吸引了许多爱书的收藏家，他们尤其钟情于初版书。"}]}],"synonyms":["love of books","book collecting","bibliomania (stronger, sometimes excessive)"],"phonetic":"/ˌbɪbliˈɑfəli/","extraExplanation":["词源：biblio-（书）+ -phily（喜爱）。常见相关词：bibliophile（爱书的人/藏书家）。","语气与用法：bibliophily 比较正式、书面，强调“对书的热爱/收藏倾向”；日常英语里更常说 a love of books 或 book collecting。","文化提示：在英语语境中，bibliophily 常与 rare books（珍本）、first editions（初版）、signed copies（签名本）、fine bindings（精装装帧）等搭配。"]}
{"word":"bibliophobe","summary":{"en":"A bibliophobe is someone who dislikes or fears books.","zh":"bibliophobe 指不喜欢书或害怕书的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who dislikes or is afraid of books","zh":"不喜欢书或害怕书的人（厌书者／恐书者）"},"examples":[{"en":"He’s a self-described bibliophobe, so he rarely enters a bookstore.","zh":"他自称是个厌书者，所以很少走进书店。"},{"en":"As a joke, she called her brother a bibliophobe because he never reads for fun.","zh":"开玩笑地，她说哥哥是“厌书者”，因为他从不为了娱乐而阅读。"}]}],"synonyms":["book-hater","nonreader"],"phonetic":"/ˈbɪbliəˌfoʊb/","extraExplanation":["词源：biblio- 表示“书”（源自希腊语），-phobe 表示“害怕／厌恶”。因此 bibliophobe 字面意思是“怕书的人”。","使用提示：现实中更常见的说法是 “someone who doesn’t like reading / hates reading”。bibliophobe 带一点幽默、夸张或文学化的语气。","相关词：bibliophile（爱书者）、-phobia（恐惧症的后缀，如 arachnophobia 蜘蛛恐惧）。"]}
{"word":"bibliophobia","summary":{"en":"Bibliophobia means a strong fear or anxiety about books or reading.","zh":"bibliophobia 指对书籍或阅读的强烈恐惧或焦虑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extreme fear or strong anxiety about books or reading","zh":"对书籍或阅读的强烈恐惧或焦虑（书本恐惧症/阅读恐惧症）"},"examples":[{"en":"She avoided libraries because of bibliophobia.","zh":"因为有书本恐惧症，她会刻意避开图书馆。"},{"en":"His bibliophobia made reading assignments feel overwhelming.","zh":"他的阅读恐惧让阅读作业变得难以承受。"},{"en":"With support, her bibliophobia gradually became more manageable.","zh":"在支持下，她的书本恐惧症逐渐变得更可控。"}]}],"synonyms":["fear of reading","anxiety about reading"],"phonetic":"/ˌbɪbliəˈfoʊbiə/","extraExplanation":["词源提示：biblio- 来自希腊语，表示“书”；-phobia 表示“恐惧”。合起来字面意思就是“对书的恐惧”。","使用语境：这个词在日常口语中不算常见，更常见于心理/教育相关讨论或文学化表达。有时也用来夸张地形容“非常讨厌读书”。","温和提醒：如果指真实的强烈焦虑或恐惧，英语里也可能说 fear of reading / anxiety about reading；在学校情境中，还可能与阅读困难、负面学习经历或压力相关（不等同于懒惰）。"]}
{"word":"bibliopolar","summary":{"en":"Bibliopolar means a bookseller, especially one dealing in old or rare books.","zh":"bibliopolar 指书商，尤指经营旧书或珍本书的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bookseller; someone who buys and sells books (especially old or rare books).","zh":"书商；书店老板；（尤指旧书/珍本书的）买卖者。"},"examples":[{"en":"The bibliopolar showed me a first edition in a locked glass case.","zh":"那位书商给我看了一本锁在玻璃柜里的初版书。"},{"en":"She spent Saturday morning browsing the bibliopolar’s shop for secondhand poetry books.","zh":"她周六上午在那家旧书商的店里逛，找二手诗集。"}]}],"synonyms":["bookseller","book dealer","antiquarian bookseller","used-book dealer"],"phonetic":"/ˌbɪbliəˈpoʊlər/","extraExplanation":["这个词比较少见、偏书面或幽默用法。词根来自希腊语：biblio-（书）+ -pol-（买卖、交易；同源可联想“metropolis”里的 -polis 是“城”，但这里的 -pol-指“交易”更接近“policy/politics”那条词源支线）。日常英语里更常用 bookseller 或 used-book dealer。"]}
{"word":"bibliopole","summary":{"en":"A bibliopole is a bookseller, especially one dealing in rare or antique books.","zh":"bibliopole 指书商，尤指经营珍本或古旧书的书商。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who buys and sells books, especially rare or antique books; a bookseller.","zh":"书商；（尤指）古旧书商、珍本书商。"},"examples":[{"en":"The bibliopole specialized in first editions and signed copies.","zh":"这位书商专营初版书和签名本。"},{"en":"She visited a small bibliopole near the university to look for used textbooks.","zh":"她去大学附近一家小书店（书商）找二手教材。"},{"en":"Collectors often build long-term relationships with a trusted bibliopole.","zh":"收藏家常常会与可信赖的古旧书商建立长期关系。"}]}],"synonyms":["bookseller","book dealer","antiquarian bookseller"],"phonetic":"/ˈbɪbliəˌpoʊl/","extraExplanation":["词源上由 biblio-（“书”）+ -pole（来自希腊语 pōlēs，意为“卖者”）构成，字面意思就是“卖书的人”。在英语里它偏正式、带一点书卷气，常见于谈论古籍、收藏、古书市场等语境。"]}
{"word":"bibliopolery","summary":{"en":"Bibliopolery means the trade or business of selling books (bookselling).","zh":"bibliopolery 指“售书业/书籍买卖行业”（较书面、较少见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the business or trade of selling books; bookselling (especially used in a slightly old-fashioned or literary way).","zh":"（较文学或较老派用法）书籍买卖行业；书商生意；售书业。"},"examples":[{"en":"He spent his life in bibliopolery, hunting rare volumes and selling them to collectors.","zh":"他一生从事书籍买卖，寻找稀有藏书并卖给收藏家。"},{"en":"In the essay, the author praises the quiet romance of bibliopolery in small-town shops.","zh":"在那篇随笔里，作者称赞小镇书店里售书业的安静浪漫。"}]}],"synonyms":["bookselling","the book trade","bookseller’s trade","book dealing"],"phonetic":"/ˌbɪbliˈɑpələri/","extraExplanation":["词源上可拆成 biblio-（书）+ -polery（与“卖、交易”相关，来自希腊语 polein“出售”）。因此它强调的是“卖书这一行”，而不是“图书馆/藏书”。","这是个相对罕见、偏书面/文艺的词。日常英语更常说 bookselling / the book trade / being a bookseller。"]}
{"word":"bibliopolic","summary":{"en":"“Bibliopolic” means related to bookselling or the book trade.","zh":"“bibliopolic”指“与书籍买卖/书业有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the buying and selling of books; connected with bookselling.","zh":"与书籍买卖有关的；与书商/书店经营有关的。"},"examples":[{"en":"She wrote a bibliopolic guide to finding rare books in New York.","zh":"她写了一本与书籍买卖相关的指南，介绍如何在纽约寻找珍本。"},{"en":"The museum hosted a bibliopolic fair with dealers from many countries.","zh":"博物馆举办了一场书籍交易展，来自许多国家的书商参加。"}]}],"synonyms":["book-selling","bookseller’s","of the book trade"],"phonetic":"/ˌbɪbliəˈpɑlɪk/","extraExplanation":["“bibliopolic”比较少见，常用于较正式或学术语境。它来自希腊语词根：biblio-（书）+ -polic / -polein（卖）。日常英语里更常用的说法是 “book-selling” 或 “bookseller’s”。"]}
{"word":"bibliopolical","summary":{"en":"“Bibliopolical” means related to booksellers or the book trade, but it’s a very rare word (bibliopolic is more common).","zh":"“Bibliopolical”意为“与书商或图书买卖行业有关的”，但非常少见（更常见的是 bibliopolic）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a bookseller or the business of selling books; book-trade related.","zh":"与书商或售书行业有关的；与图书买卖相关的。"},"examples":[{"en":"He wrote a short article on the bibliopolical history of secondhand bookstores in New York.","zh":"他写了一篇短文，介绍纽约旧书店的书业（售书行业）历史。"},{"en":"The library hosted a talk on bibliopolical networks—how rare books moved between dealers and collectors.","zh":"图书馆举办了一场讲座，主题是书业网络——珍本如何在书商与收藏家之间流转。"}]}],"synonyms":["bibliopolic","bookselling","book-trade","bookseller-related"],"phonetic":"/ˌbɪbliəˈpɑlɪkəl/","extraExplanation":["“bibliopolical”非常少见，更多时候你会看到 **bibliopolic**（同义）或名词 **bibliopole**（书商，尤指古书/珍本书商）。写作时若想更自然，可以用：**bookselling**, **book trade**, **bookseller-related**。","词源可拆为：**biblio-**（书）+ **-pole / -pol-**（来自希腊语“卖”，也见于 *bibliopole*）+ **-ical**（形容词后缀，表示“与……有关的”）。"]}
{"word":"bibliopolically","summary":{"en":"“Bibliopolically” means “from the perspective of the book trade (especially rare books).”","zh":"“bibliopolically”意为“从书籍交易（尤指珍本/古旧书买卖）的角度来看”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way related to the buying, selling, or trade of books (especially rare or antiquarian books).","zh":"以与书籍买卖或书籍交易（尤指珍本、古旧书交易）相关的方式。"},"examples":[{"en":"The manuscript is interesting academically, but bibliopolically it is even more valuable because of its provenance.","zh":"这份手稿在学术上很有趣，但从珍本书交易的角度看，由于其来源记录，它更有价值。"},{"en":"The collection was modest in size, yet bibliopolically significant for its first editions.","zh":"这套藏书规模不大，但因包含多种初版，从书籍交易角度而言意义重大。"}]}],"synonyms":["in terms of the book trade","commercially (in books)","from a bookseller’s point of view","antiquarianly (in context)"],"phonetic":"/ˌbɪbliəˈpɑlɪkli/","extraExplanation":["“bibliopolically”来自形容词 bibliopolic（与书籍买卖有关的），再加副词后缀 -ly。词根 biblio- 表“书”，与希腊语 biblíon（书）有关；-pol- 与“出售/交易”有关（可联想 monopoly 里的 -poly- 也与“卖/经营”相关）。","这是一个相当罕见、带书卷气的词，多见于古旧书行业、拍卖目录、馆藏描述或书目学/收藏圈的文章中；日常英语更常用 in terms of the book trade / commercially / from a bookseller’s point of view 等表达。"]}
{"word":"bibliopolism","summary":{"en":"Bibliopolism means the business or practice of buying and selling books, especially rare or collectible ones.","zh":"Bibliopolism 指书籍买卖，尤指古籍、珍本或收藏书的交易。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the buying and selling of books, especially rare or collectible books; the book trade","zh":"书籍买卖（尤指古籍、珍本或收藏书的交易）；书籍贸易"},"examples":[{"en":"He got interested in bibliopolism after visiting a rare-book fair.","zh":"他参观了一次古旧书展后，对古籍交易产生了兴趣。"},{"en":"Bibliopolism often involves careful research on a book’s edition, condition, and history.","zh":"古籍交易往往需要仔细研究书的版本、品相和来历。"}]}],"synonyms":["rare-book trade","book trade","antiquarian book trade","bookselling"],"phonetic":"/ˌbɪbliˈɑpəˌlɪzəm/","extraExplanation":["这个词比较少见，常用于谈论“古旧书/珍本书市场”。词根来自希腊语：biblio-（书）+ -polism（买卖、交易），与 bibliophile（爱书的人）和 bibliopole（书商，尤指古书商）同源。","在英语里更常见的日常表达是 “rare-book trade”（珍本书交易）或 “the book trade”（书业/书籍贸易）。"]}
{"word":"bibliopolist","summary":{"en":"A bibliopolist is a bookseller, especially one who deals in rare or collectible books.","zh":"bibliopolist 指书商，尤指经营稀有或收藏书籍的旧书商。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who buys and sells books, especially rare or collectible ones; a bookseller","zh":"书商；（尤指）经营稀有或收藏书籍的旧书商"},"examples":[{"en":"The bibliopolist specialized in first editions and antique maps.","zh":"这位书商专营初版本书籍和古地图。"},{"en":"Collectors visited the bibliopolist’s shop to ask about rare poetry volumes.","zh":"收藏家们去这家旧书店询问稀有的诗集。"}]}],"synonyms":["bookseller","antiquarian bookseller","rare-book dealer","book dealer"],"phonetic":"/ˌbɪbliˈɑːlɪst/","extraExplanation":["词源：来自希腊语 biblio-（书）+ -polist（卖方/商人）。因此它常带有“经营（珍本、古旧书）”的语感，比普通的 bookseller 更偏向“稀有书交易”的圈子。","用法提示：在当代日常英语里比较少见，更常见的说法是 rare-book dealer（稀有书商）或 antiquarian bookseller（古旧书商）。在文学或书籍文化相关的文章中出现频率更高。"]}
{"word":"bibliopolistic","summary":{"en":"“Bibliopolistic” means connected with the business of selling books, especially rare or secondhand books.","zh":"“bibliopolistic”指与卖书有关的，尤指珍本或二手书的买卖行业。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the selling of books (especially the trade of rare or secondhand books).","zh":"与卖书有关的；（尤指）珍本/二手书买卖行业的。"},"examples":[{"en":"She wrote a bibliopolistic column about rare bookstores in New York.","zh":"她写了一栏与珍本书店有关的书业专栏，介绍纽约的稀有书店。"},{"en":"His bibliopolistic interests led him to collect early editions and learn how the book market works.","zh":"他对书业买卖的兴趣让他开始收藏早期版本，并了解图书市场如何运作。"}]}],"synonyms":["bookselling","book-trade","antiquarian (book)","secondhand-book (related)"],"phonetic":"/ˌbɪblioʊpəˈlɪstɪk/","extraExplanation":["这是一个较罕见、偏学术或书业圈使用的词，来自 biblio-（书）+ -polistic（与买卖有关），可追溯到希腊语中“出售/交易”的词根。常见相关词还有 bibliopole（书商，尤指旧书/珍本书商）。"]}
{"word":"bibliopoly","summary":{"en":"Bibliopoly most commonly means the trade in books—especially rare or collectible books; less commonly, it can mean a monopoly in the book/publishing market.","zh":"Bibliopoly 通常指书籍交易（尤指古旧书、珍本或收藏书交易）；较少见时也可指图书/出版市场的垄断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the buying and selling of books, especially rare or collectible books (the rare-book trade)","zh":"书籍买卖（尤指古旧书、珍本或收藏类书籍的交易）"},"examples":[{"en":"She works in bibliopoly, specializing in first editions of American novels.","zh":"她从事古旧书交易，专门经营美国小说的初版本。"},{"en":"Online auctions have changed bibliopoly by making rare books easier to find.","zh":"网络拍卖改变了古旧书交易，让稀有书更容易被找到。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a monopoly or near-monopoly in the book market or publishing world","zh":"（不常见）图书市场或出版行业的垄断（或近似垄断）"},"examples":[{"en":"Some critics warned that the merger could create bibliopoly and reduce reader choice.","zh":"一些评论者警告说，这次合并可能造成出版垄断，减少读者选择。"}]}],"synonyms":["rare-book trade","antiquarian book trade","bookselling","book monopoly (rare sense)"],"phonetic":"/ˌbɪbliˈɑːpəli/","extraExplanation":["词源提示：由拉丁语词根 biblio-（“书”）+ -poly（与“卖/交易”或“多/垄断”等概念相关的构词）组合而来。现代英语里更常用来指“古旧书/珍本书交易”；表示“垄断”时语气较批评，写作中更常见的是 book monopoly / publishing monopoly。","使用场景：在西方语境中，bibliopoly 常出现在古旧书店、拍卖行、馆藏（special collections）和书籍收藏圈的介绍文字中。与之相关的常见搭配包括 rare books（珍本书）、first edition（初版）、antiquarian books（古旧书）。"]}
{"word":"bibliosoph","summary":{"en":"A bibliosoph is a thoughtful lover of books—someone who reads with reflection and seeks wisdom through books.","zh":"bibliosoph 指“带着思考去读书的爱书人”，强调通过书籍追求理解与智慧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who loves books and studies them thoughtfully; a book-lover with a philosophical or reflective approach to reading","zh":"热爱并深入思考书籍的人；带有哲思气质的爱书人"},"examples":[{"en":"As a true bibliosoph, she doesn’t just collect books—she reads them slowly and reflects on their ideas.","zh":"作为真正的 bibliosoph（爱书的哲思者），她不只是收藏书——她会慢慢读，并反思其中的观点。"},{"en":"In our club, the bibliosoph always asks what a story means for real life.","zh":"在我们读书会里，那位 bibliosoph 总会问：故事对真实生活意味着什么。"}]}],"synonyms":["book lover","bibliophile","bookish person","reader","literary enthusiast"],"phonetic":"/ˈbɪbliəˌsɑf/","extraExplanation":["这个词比较少见，常见近义表达是 book lover（爱书人）或 bibliophile（藏书/爱书的人）。bibliosoph 更强调“思考与智慧”，不只是喜欢拥有书。","词源上可拆成 biblio-（书）+ -soph（智慧/智者，来自希腊语 sophia“智慧”），所以带有“以书为途径追求智慧”的味道。"]}
{"word":"bibliotaph","summary":{"en":"A bibliotaph is someone who hoards books—often keeping them hidden or unused, especially rare ones.","zh":"bibliotaph 指“囤书/藏书癖者”，强调把书藏起来不用不读（常带贬义），尤其是珍贵书籍。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who hoards or buries away books, especially by keeping them unused or hidden (often rare or valuable books)","zh":"囤书者；藏书癖者（尤指把书“埋起来”不读不用、甚至藏起来的那种人，常指珍贵书籍）"},"examples":[{"en":"He’s a bibliotaph who locks his first editions in a cabinet and never lets anyone read them.","zh":"他是个囤书者，把初版书锁在柜子里，从不让任何人阅读。"},{"en":"The librarian criticized the bibliotaph for treating books like trophies instead of tools for learning.","zh":"图书管理员批评那位囤书者把书当战利品，而不是学习的工具。"}]}],"synonyms":["book hoarder","book collector (sometimes)","bibliomaniac"],"phonetic":"/ˈbɪbliəˌtæf/","extraExplanation":["词源小提示：biblio- 表示“书”，-taph 来自希腊语 taphos，意为“坟墓”。字面上有“把书埋起来的人”的感觉，因此常带一点批评意味：不是正常收藏，而是把书藏得别人用不了、自己也不读。","用法与语气：bibliotaph 比常见词 book collector / bibliophile 更负面；bibliophile（爱书者）通常是褒义或中性，bibliotaph 则强调“占有但不分享/不使用”。"]}
{"word":"bibliotaphe","summary":{"en":"A bibliotaph is a (sometimes obsessive) book collector or hoarder.","zh":"bibliotaph 指（有时近乎执念的）藏书者/囤书者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who collects or hoards books, sometimes obsessively.","zh":"藏书者；（有时带贬义）痴迷囤书的人。"},"examples":[{"en":"He’s a true bibliotaph—his apartment is stacked with books from floor to ceiling.","zh":"他真是个藏书痴——公寓里从地板到天花板全是书。"},{"en":"Some bibliotaphs buy rare editions mainly to own them, not to read them.","zh":"有些藏书者买珍稀版本主要是为了占有，并不一定为了阅读。"}]}],"synonyms":["book collector","bibliophile (close but usually more positive)","book hoarder"],"phonetic":"/ˈbɪbliəˌtæf/","extraExplanation":["“bibliotaph”较少见；你输入的“bibliotaphe”多半是拼写变体或误拼。常见拼写是 bibliotaph（也可见 bibliotaphe 作为罕见变体）。","词源可拆为 biblio-（书）+ -taph（墓/埋葬），形象地表达“把书埋起来据为己有”、甚至不愿分享或阅读的意味；语气有时带一点调侃或批评。","相关对比：bibliophile（爱书的人，偏褒义，强调喜爱阅读与书本文化）；book hoarder（囤书者，更口语、更强调“堆积”）。"]}
{"word":"bibliotaphic","summary":{"en":"Bibliographic means “related to bibliographies, citations, or reference lists.”","zh":"bibliographic 指“与参考文献/书目、引用信息有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to a list of books, articles, or other sources (a bibliography), especially in citations or references.","zh":"与参考文献目录（bibliography）有关的；尤指引用、参考文献中的信息。"},"examples":[{"en":"The paper needs bibliographic information for every source you used.","zh":"这篇论文需要你使用的每一条资料的完整参考文献信息。"},{"en":"Please follow APA style for bibliographic citations.","zh":"请按照 APA 格式写参考文献引用。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing the study or practice of compiling and organizing books and sources, especially in libraries or research.","zh":"描述编制与整理书籍和资料来源的工作或研究（常见于图书馆与学术研究领域）。"},"examples":[{"en":"She took a course on bibliographic methods for historical research.","zh":"她上了一门关于历史研究书目方法的课程。"},{"en":"The librarian offered bibliographic support for my thesis.","zh":"图书馆员为我的论文提供了书目支持。"}]}],"synonyms":["reference","citation-related","source-list (related)"],"phonetic":"/ˌbɪbliəˈɡræfɪk/","extraExplanation":["你输入的“bibliotaphic”很可能是拼写错误，常见正确拼写是“bibliographic”。\n\n词根提示：biblio-（书）+ -graph（写/记录）+ -ic（形容词后缀），整体意思是“与书目记录有关的”。","常见搭配：bibliographic information（书目信息）、bibliographic citation（参考文献引用）、bibliographic database（书目数据库）、bibliographic record（书目记录）。"]}
{"word":"bibliothec","summary":{"en":"“Bibliothec” is a rare word meaning “library,” mostly found in older or scholarly contexts (often in titles).","zh":"“bibliothec”是个很少用的词，意思是“图书馆/藏书处”，多见于较早或学术语境（常出现在书名中）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) A library; a place or collection of books, especially in older or scholarly writing. Often seen in titles or names (e.g., *Bibliotheca* ...).","zh":"（罕见）图书馆；藏书处或书籍的收藏，常见于较早或学术性的写法中，也常出现在书名/系列名里（如 *Bibliotheca*……）。"},"examples":[{"en":"The manuscript mentions a royal bibliothec filled with maps and chronicles.","zh":"手稿提到一座王室图书馆（bibliothec），里面满是地图和编年史。"},{"en":"I found the term in an old catalog title rather than in modern conversation.","zh":"我是在一本旧目录的标题里看到这个词，而不是在现代口语中。"}]}],"synonyms":["library","bibliotheca","collection","archive"],"phonetic":"/ˌbɪbliəˈθɛk/","extraExplanation":["“bibliothec”在现代英语里非常少见，更多时候你会看到更常用的“library”，或更拉丁化/书名化的形式“bibliotheca”（常用于书系名，意为“文库/藏书系列”）。","词根来自希腊语：biblio-（书）+ -theke（储藏处/柜子），所以本义是“存放书的地方”。"]}
{"word":"bibliotheca","summary":{"en":"Bibliotheca is a Latin/Greek-style word meaning “library” or “collection of books,” and it’s also commonly used in titles of compiled works.","zh":"Bibliotheca 是带古典色彩的词，意为“图书馆/藏书”，也常用于汇编类作品或丛书的书名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often in Latin/Greek contexts) a library; a collection of books.","zh":"（多用于拉丁语/希腊语语境）图书馆；藏书（书籍的集合）。"},"examples":[{"en":"The manuscript refers to the monastery’s bibliotheca, where rare texts were kept.","zh":"手稿提到修道院的 bibliotheca（藏书处），那里保存着稀有文献。"},{"en":"In older scholarship, “bibliotheca” may simply mean “library.”","zh":"在较早的学术著作中，“bibliotheca” 可能只是“图书馆”的意思。"}]},{"partOfSpeech":"n.","definition":{"en":"a work or series titled “Bibliotheca,” usually meaning a curated collection (e.g., myths, history, or texts).","zh":"书名或丛书名中的“Bibliotheca”，通常表示“汇编/总集”（如神话、历史或文献选编）。"},"examples":[{"en":"Apollodorus’s Bibliotheca is a famous handbook-style collection of Greek myths.","zh":"阿波罗多洛斯的《Bibliotheca》是一部著名的“手册式”希腊神话汇编。"},{"en":"The publisher launched a Bibliotheca series to gather classic works in one set.","zh":"出版社推出名为 Bibliotheca 的丛书，把经典作品汇集成一套。"}]}],"synonyms":["library","collection","archives","anthology"],"phonetic":"/ˌbɪbli.oʊˈθiːkə/","extraExplanation":["“Bibliotheca”源自希腊语词根：biblio-（书）+ -thēkē（存放处/柜子），字面意思接近“放书的地方”。因此它在古典学、神学、历史学等领域常被直接用作“图书馆/藏书处”。","你可能会在书名中见到它，例如古代作品《Bibliotheca》（常译作《书库》《藏书集》），意思更接近“汇编”“总集”，而不一定指实体图书馆。","英语里更常用的现代词是 library；bibliotheca 带有明显的古典、学术或书名风格。"]}
{"word":"bibliothecae","summary":{"en":"A Latin form related to *bibliotheca* (“library”), used in academic contexts meaning “libraries” or “of the library.”","zh":"与拉丁语 *bibliotheca*（“图书馆”）相关的形式，多用于学术语境，可表示“诸图书馆”或“图书馆的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A Latin form of *bibliotheca* (“library”); often seen in scholarly titles to mean “libraries” or “of the library.”","zh":"拉丁语 *bibliotheca*（“图书馆”）的变格形式；常见于学术书名或文献标题中，可表示“图书馆们/诸图书馆”或“图书馆的”。"},"examples":[{"en":"The catalog lists several old works with *Bibliothecae* in the title.","zh":"目录里列出了几部书名中含有 *Bibliothecae* 的旧著。"},{"en":"In Latin headings, *bibliothecae* can point to “of the library,” depending on the sentence.","zh":"在拉丁语标题或句子里，*bibliothecae* 可能表示“图书馆的”，具体要看语境。"}]}],"synonyms":["library","collection","bibliotheca"],"phonetic":"/ˌbɪbliəˈθiːkiː/","extraExplanation":["在拉丁语里，*bibliothecae* 既可能是主格复数（=“图书馆们/诸图书馆”），也可能是单数属格或与格（=“图书馆的/给图书馆”）。因此在书名、题词或章节标题中看到它时，通常要结合上下文判断更准确的含义。","很多学术书名用 *Bibliotheca* / *Bibliothecae* 来表示“文献汇编、丛书、藏书系列”，有点像英文里的 “Library of … / Collection of …”。"]}
{"word":"bibliothecaire","summary":{"en":"“Bibliothécaire/bibliothecaire” is a French word meaning “librarian.”","zh":"“bibliothécaire / bibliothecaire”是法语词，意思是“图书馆员”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a librarian; a person who works in or manages a library (French word).","zh":"图书馆员；在图书馆工作或管理图书馆的人（法语词）。"},"examples":[{"en":"I asked the bibliothécaire where I could find books on French history.","zh":"我问那位图书馆员在哪里能找到关于法国历史的书。"},{"en":"The bibliothécaire helped me renew my library card.","zh":"那位图书馆员帮我续办了借书证。"}]}],"synonyms":["librarian","library worker","library staff"],"phonetic":"/ˌbɪbli.oʊˈtɛk.ɛr/","extraExplanation":["“bibliothécaire”是法语里的“图书馆员”。在英语中更常用的是 librarian；你有时会在法语语境（比如法国、魁北克的机构介绍、法语简历）里看到这个词。","拼写里常见重音符号：bibliothécaire。英文写作中若不方便输入重音，也有人写成 bibliothecaire，但仍被视为法语词。","不要和较少见的英文词 bibliothecary 混淆；现代英语里几乎都用 librarian。"]}
{"word":"bibliothecal","summary":{"en":"Bibliothecal means “related to a library,” and it is formal and uncommon in modern everyday English.","zh":"bibliothecal 意为“与图书馆相关”，语体较正式，在现代日常英语中不常用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a library, libraries, or library work (a rare, formal word).","zh":"与图书馆、图书馆事务或图书馆工作有关的（较少见、较正式的词）。"},"examples":[{"en":"The report focuses on bibliothecal services for rural communities.","zh":"这份报告重点讨论农村社区的图书馆服务。"},{"en":"She studies bibliothecal history, including how collections were organized in the 1800s.","zh":"她研究图书馆史，包括19世纪图书馆如何整理馆藏。"}]}],"synonyms":["library-related","librarial","bibliothecary (less common)"],"phonetic":"/ˌbɪbliəˈθiːkəl/","extraExplanation":["该词较少用于日常英语，更常见的表达是 library（如 library services / library science）。","词源上可拆为 biblio-（书）+ -thecal（来自希腊语 thēkē，意为“容器、存放处”），整体含义可理解为“与藏书之所相关”。"]}
{"word":"bibliothecarial","summary":{"en":"An adjective meaning “related to libraries or librarianship.”","zh":"形容词：表示“与图书馆或图书馆工作/图书馆学相关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a librarian, libraries, or the work and practices of librarianship (library science).","zh":"与图书馆员、图书馆或图书馆工作/图书馆学相关的。"},"examples":[{"en":"She has bibliothecarial experience in cataloging and archives.","zh":"她在编目和档案方面有图书馆相关的工作经验。"},{"en":"The conference focused on bibliothecarial ethics, including privacy for readers.","zh":"会议聚焦于图书馆职业伦理，包括保护读者隐私。"}]}],"synonyms":["library-related","librarian","librarial","bibliothecal"],"phonetic":"/ˌbɪbli.oʊθəˈkɛriəl/","extraExplanation":["“bibliothecarial”比较正式且不常用；日常英语里更常见的是“library”作定语（如 library staff / library services）或“librarian”相关表达。","词源上与“bibliotheca（图书馆）”有关：biblio-（书）+ theca（存放处、盒子），因此带有“与藏书、馆藏管理相关”的书面色彩。"]}
{"word":"bibliothecarian","summary":{"en":"Bibliothecarian is a less common word meaning “librarian,” and it can also mean “related to libraries.”","zh":"Bibliothecarian 是较少见的词，意思相当于“图书馆员”，也可表示“与图书馆有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a librarian; a person who works in a library and helps people find and use books and information","zh":"图书馆员；在图书馆工作、帮助人们查找与使用书籍和信息的人"},"examples":[{"en":"Ask the bibliothecarian if the library has this book.","zh":"可以问问图书馆员这本书馆里有没有。"},{"en":"The bibliothecarian showed me how to search the online catalog.","zh":"图书馆员教我如何搜索在线目录。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to libraries or the work of managing library collections","zh":"与图书馆有关的；与图书馆藏管理工作相关的"},"examples":[{"en":"She is interested in bibliothecarian studies and archives.","zh":"她对图书馆学和档案很感兴趣。"}]}],"synonyms":["librarian","bibliothecary","library worker","archivist"],"phonetic":"/ˌbɪbliəˈθɛkəriən/","extraExplanation":["“bibliothecarian”在现代英语里比较少见，更常用的词是“librarian”（图书馆员）。有时它也被当作“bibliothecary / bibliothecarist”等相关形式的变体来使用。","词源上与希腊语“bibliothēkē”（图书馆；藏书处）有关：biblio-（书）+ -theca（存放处）。因此它带有“与藏书/图书馆相关”的含义，常见于较正式或学术语境。"]}
{"word":"bibliothecary","summary":{"en":"A bibliothecary is an old-fashioned word for a librarian or a person who cares for books, especially rare ones.","zh":"bibliothecary 是“图书管理员/藏书管理者”的较旧式说法，也可指照料（尤其是珍贵）书籍的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a librarian; someone who manages or works in a library (old-fashioned or literary)","zh":"图书管理员；在图书馆工作或负责管理图书馆的人（较旧式或文学用法）"},"examples":[{"en":"The bibliothecary helped me find a book on American history.","zh":"那位图书管理员帮我找到了一本关于美国历史的书。"},{"en":"In the old novel, the quiet bibliothecary guarded the rare manuscripts.","zh":"在那本老小说里，沉默的图书管理员守护着珍贵的手稿。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who collects or cares for books, especially rare or valuable ones (formal, less common)","zh":"藏书者；负责收藏或照料书籍的人，尤其是珍本或贵重书籍（正式用法，较少见）"},"examples":[{"en":"He was known as a bibliothecary with an impressive collection of first editions.","zh":"他以藏书丰富而闻名，收藏了许多初版书。"},{"en":"The bibliothecary donated her private archive to the university.","zh":"这位藏书者把自己的私人档案捐给了大学。"}]}],"synonyms":["librarian","library keeper","custodian of books","book curator","archivist"],"phonetic":"/ˌbɪbliəˈθɛkəri/","extraExplanation":["“bibliothecary”带有复古、书卷气的色彩，现代英语更常用“librarian”。","词源来自希腊语“bibliothēkē”（图书馆/藏书处），与“biblio-”（书）同源，常见于“bibliography（书目/参考书目）”“bibliophile（爱书人）”。"]}
{"word":"bibliothecas","summary":{"en":"“Bibliothecas” is the plural of “bibliotheca,” meaning libraries or book collections, usually in scholarly/Latin-style usage.","zh":"“bibliothecas”是“bibliotheca”的复数，指多个图书馆或藏书（多用于学术或带拉丁语风格的语境/标题）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “bibliotheca”: a library, or a collection of books (often used in Latin or in the titles of scholarly book series).","zh":"“bibliotheca”的复数：图书馆；（常见于拉丁语或学术丛书/书目标题中的）藏书、书籍汇编。"},"examples":[{"en":"Many old catalogues list several bibliothecas owned by monasteries.","zh":"许多旧目录会列出修道院拥有的多个“bibliothecas”（藏书馆/藏书目录）。"},{"en":"The publisher launched a new Bibliotheca series; later volumes are grouped as separate bibliothecas by subject.","zh":"出版社推出了一套新的“Bibliotheca”丛书；后来的卷册按主题被归为不同的“bibliothecas”。"}]}],"synonyms":["libraries","collections (of books)","book collections","catalogues (context-dependent)"],"phonetic":"/ˌbɪbliəˈθiːkəz/","extraExplanation":["“bibliotheca”源自拉丁语（也与希腊语词根相关），在现代英语里多见于学术语境、古典研究、图书目录或丛书名称中，而日常英语更常用“library”。","拼写提示：在一些语言（如西班牙语）里，“biblioteca”是“图书馆”的常用词；但英语中“bibliotheca/bibliothecas”更偏正式或标题用法。"]}
{"word":"bibliotheke","summary":{"en":"Bibliotheke means “library,” mainly used in Greek/classical contexts.","zh":"Bibliotheke 指“图书馆/藏书处”，主要用于希腊语或古典语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A library; a collection of books (often used in classical/Greek contexts as a transliteration of Greek βιβλιοθήκη).","zh":"图书馆；藏书处/藏书集合（多见于古典研究中，源自希腊语 βιβλιοθήκη 的音译写法）。"},"examples":[{"en":"In ancient Greek, a bibliotheke could refer to a place where scrolls were stored.","zh":"在古希腊语里，bibliotheke 可指存放卷轴的地方。"},{"en":"The museum’s catalog mentions a small bibliotheke attached to the temple complex.","zh":"博物馆的目录提到神庙建筑群旁有一座小型 bibliotheke（藏书处）。"}]}],"synonyms":["library","book collection","bibliotheca"],"phonetic":"/ˌbɪbliəˈθiːki/","extraExplanation":["Bibliotheke（βιβλιοθήκη）由希腊语 βιβλίον（biblion，书/卷轴）+ θήκη（thēkē，容器/存放处）组成，字面意思是“放书的地方”。","在现代英语里，更常见的对应词是 library；在学术写作（尤其古典学、考古学、希腊史）中，有时会保留 bibliotheke 这种音译写法来强调历史语境。","相关常见词：bibliography（参考书目）、bibliophile（爱书的人）。"]}
{"word":"bibliotheque","summary":{"en":"Bibliotheque is a French word meaning “library,” and in English it can also be used as a stylish name for a nightclub or venue.","zh":"Bibliotheque源自法语，意为“图书馆”；在英语中也常被用作夜店或场馆的时髦店名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in French) a library; a place where books and other materials are kept for reading or borrowing.","zh":"（法语）图书馆；收藏并提供书籍等资料阅读或借阅的地方。"},"examples":[{"en":"I studied at the bibliothèque near the university.","zh":"我在大学附近的那家图书馆学习。"},{"en":"In Paris, many bibliothèques have quiet reading rooms.","zh":"在巴黎，许多图书馆都有安静的阅览室。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in English branding) a nightclub or music venue, often with a French-styled name.","zh":"（尤其在英语商业命名中）夜总会/音乐俱乐部（常用法式名称营造氛围）。"},"examples":[{"en":"They met at a place called Bibliotheque, a late-night club downtown.","zh":"他们在市中心一家叫“Bibliotheque”的深夜俱乐部碰面。"},{"en":"The hotel’s Bibliotheque hosts live DJs on weekends.","zh":"酒店里的“Bibliotheque”周末会有DJ现场表演。"}]}],"synonyms":["library","book collection","nightclub","club","venue"],"phonetic":"/ˌbɪbliəˈtɛk/","extraExplanation":["“bibliothèque”是法语单词，带重音符号：bibliothèque。英语里有时会去掉重音写成bibliotheque，多见于店名/俱乐部名，用来营造“法式、文艺、精致”的感觉。","如果你想表达“图书馆”这一普通含义，英语最常用的词还是library；在英语写作中用bibliotheque通常会让人感觉你在引用法语或在谈法国语境。"]}
{"word":"bibliotherapeutic","summary":{"en":"An adjective meaning “related to bibliotherapy,” i.e., using reading and books for emotional or psychological support.","zh":"形容词，意为“与阅读疗法有关的”，指用阅读与书籍来提供情绪或心理支持。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to bibliotherapy: using books, stories, or reading as a tool to support emotional healing, mental health, or personal growth.","zh":"与“阅读疗法/书籍疗法”（bibliotherapy）有关的：通过书籍、故事或阅读来帮助情绪疗愈、心理健康或个人成长。"},"examples":[{"en":"Her counselor recommended bibliotherapeutic reading to help her cope with grief.","zh":"她的咨询师建议她进行“阅读疗法”式的阅读，帮助她应对悲伤。"},{"en":"The library created a bibliotherapeutic book list for teens dealing with anxiety.","zh":"图书馆为正在应对焦虑的青少年制作了一份阅读疗法书单。"},{"en":"He prefers bibliotherapeutic novels that offer hope without sounding preachy.","zh":"他更喜欢那些能带来希望、但又不说教的“疗愈系”小说。"}]}],"synonyms":["bibliotherapy-related","therapeutic (reading)","healing","restorative"],"phonetic":"/ˌbɪblioʊθəˈrɑːpɪk/","extraExplanation":["“bibliotherapeutic”来自“biblio-（书）+ therapeutic（治疗的）”。它常见于心理咨询、教育与图书馆学等语境，强调“有目的地选书与阅读”，并结合讨论、写作或反思来帮助个体。","日常英语里更常说“bibliotherapy (阅读疗法)”或“therapeutic reading（疗愈性阅读）”。“bibliotherapeutic”更偏正式、学术。"]}
{"word":"bibliotherapies","summary":{"en":"Bibliotherapies are treatments that use guided reading to support emotional well-being and mental health.","zh":"Bibliotherapies 指通过引导性阅读来支持情绪福祉与心理健康的多种治疗方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Therapies that use guided reading—such as books, stories, or poems—to support mental health, personal growth, or coping with life difficulties.","zh":"（多种）阅读疗法：通过在专业人士或自我引导下阅读书籍、故事或诗歌，来支持心理健康、促进自我成长或帮助应对生活困境的疗法。"},"examples":[{"en":"The clinic offers bibliotherapies for anxiety, including guided memoir reading.","zh":"这家诊所为焦虑提供阅读疗法，包括在引导下阅读回忆录。"},{"en":"Some schools use bibliotherapies to help students process grief through age-appropriate novels.","zh":"一些学校使用阅读疗法，让学生通过适龄小说来处理悲伤。"}]}],"synonyms":["reading therapy","guided reading therapy","self-help reading (context-dependent)"],"phonetic":"/ˌbɪblioʊˈθɛrəpi/","extraExplanation":["“bibliotherapy”由 biblio-（书、书籍）+ therapy（疗法）构成，常见于图书馆学、心理咨询与教育领域。","阅读疗法可以是“自助型”（自己按书单阅读与练习）或“引导型”（由咨询师、教师或图书馆员带领讨论与反思）；在英文语境里也常与 self-help reading、guided reading program 等搭配出现。","在文学与公共文化中，阅读疗法常与“阅读带来疗愈/共情”联系在一起，但它通常被视为辅助方式；若涉及严重心理症状，仍建议寻求专业医疗与心理支持。"]}
{"word":"bibliotherapist","summary":{"en":"A bibliotherapist helps people through books and guided reading (bibliotherapy).","zh":"bibliotherapist 指通过书籍与引导式阅读来帮助他人进行心理支持与疗愈的人（阅读疗法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person (often a counselor, librarian, or therapist) who uses books and guided reading to support someone’s mental health, personal growth, or emotional healing.","zh":"（常指辅导员、图书馆员或治疗师）通过书籍与引导式阅读来帮助他人进行心理支持、个人成长或情绪疗愈的人。"},"examples":[{"en":"The bibliotherapist suggested a memoir to help her feel less alone in her grief.","zh":"这位阅读疗愈师推荐了一本回忆录，帮助她在悲伤中不那么孤单。"},{"en":"In the hospital program, a bibliotherapist met with patients to discuss stories about resilience.","zh":"在医院项目中，阅读疗愈师与病人一起讨论关于坚韧的故事。"},{"en":"He worked as a bibliotherapist, pairing novels with coping strategies for stress.","zh":"他从事阅读疗愈工作，把小说与应对压力的策略结合起来。"}]}],"synonyms":["bibliotherapy practitioner","reading therapist","therapeutic reading facilitator"],"phonetic":"/ˌbɪbli.oʊˈθɛrəpɪst/","extraExplanation":["“bibliotherapist”来自“biblio-（书）+ therapist（治疗师）”。相关方法叫“bibliotherapy（阅读疗法/书籍疗法）”，在英语语境中既可指专业心理健康干预中的辅助阅读，也可更宽泛地指由图书馆、学校或社区开展的“以书助人”的支持活动。","在正式医疗或心理治疗场景中，是否需要执照取决于具体国家/地区与工作职责；有些“bibliotherapist”是持证治疗师，有些更接近“读者顾问/阅读指导员”角色。"]}
{"word":"bibliotherapy","summary":{"en":"Bibliotherapy is the use of guided reading to support emotional healing and mental well-being.","zh":"Bibliotherapy 指通过引导性阅读来促进情绪疗愈与心理健康。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A therapy approach that uses reading (books, stories, poems) to support mental health, self-understanding, or emotional healing—often guided by a therapist or counselor.","zh":"阅读疗法：通过阅读书籍、故事或诗歌来支持心理健康、促进自我理解或情绪疗愈的一种治疗方法，常由治疗师或咨询师引导。"},"examples":[{"en":"Her counselor suggested bibliotherapy to help her cope with grief.","zh":"她的咨询师建议用阅读疗法来帮助她应对悲伤。"},{"en":"In bibliotherapy, the right story can help people name feelings they couldn’t express before.","zh":"在阅读疗法中，合适的故事能帮助人们说出以前难以表达的感受。"}]}],"synonyms":["reading therapy","poetry therapy (related)"],"phonetic":"/ˌbɪbli.oʊˈθɛrəpi/","extraExplanation":["词源：biblio- 表示“书”（来自希腊语），-therapy 表示“治疗”。直译就是“用书来治疗”。","常见做法包括：治疗师推荐特定文本、带着问题阅读、记录感受（读书日志）、在会谈中讨论角色与情节如何映照自己的经历。","与“读书让人放松”不同，阅读疗法更强调目标（如处理焦虑、创伤、哀伤）、过程（引导与反思）和个体匹配（选对书很关键）。","相关词：poetry therapy（诗歌疗法，常作为阅读疗法的一支或相近方法）、self-help reading（自助阅读，通常更偏自我指导）。"]}
{"word":"bibliotherapy-related","summary":{"en":"“Bibliotherapy-related” means connected with therapeutic reading used to support mental or emotional well-being.","zh":"“Bibliotherapy-related”指与“阅读疗法/书疗”（用阅读支持心理或情绪健康）有关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with bibliotherapy (using reading—often guided by a therapist, counselor, teacher, or librarian—to support mental health, emotional growth, or coping).","zh":"与“阅读疗法/书疗”（通过阅读，常在治疗师、咨询师、教师或图书馆员引导下，帮助心理健康、情绪成长或应对压力）有关的。"},"examples":[{"en":"The clinic offers bibliotherapy-related activities such as guided reading and reflection journals.","zh":"这家诊所提供与阅读疗法相关的活动，例如引导式阅读和反思日记。"},{"en":"She is doing bibliotherapy-related research on how novels can help teens manage anxiety.","zh":"她正在做与阅读疗法相关的研究，探讨小说如何帮助青少年管理焦虑。"}]}],"synonyms":["therapeutic-reading-related","reading-therapy-related","bibliotherapy-based","bibliotherapy-focused"],"phonetic":"/ˌbɪblioʊˈθɛrəpi rɪˈleɪtɪd/","extraExplanation":["“Bibliotherapy”由“biblio-（书）+ therapy（治疗）”构成，常见于心理健康、教育与图书馆服务领域。它既可以指临床场景中的辅助治疗，也可以指更广义的“发展性阅读”（帮助理解情绪、建立同理心、提升自我认知）。","写作中用“bibliotherapy-related”可以避免重复解释“bibliotherapy”，但在不熟悉该术语的受众面前，第一次出现时最好加一句简短说明（例如：“bibliotherapy, or therapeutic reading”）。"]}
{"word":"bibliothetic","summary":{"en":"A rare formal adjective meaning “related to library-style collecting and organizing of books.”","zh":"一个少见的正式形容词，意为“与图书馆式的藏书与整理工作相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the collecting, organizing, or management of books—especially in a library context (a rare, formal word).","zh":"与书籍的收藏、整理或管理有关的；尤指与图书馆工作相关（较少见、较正式的词）。"},"examples":[{"en":"She wrote a bibliothetic essay about how small libraries can preserve local history.","zh":"她写了一篇与图书馆工作相关的文章，讨论小型图书馆如何保存地方历史。"},{"en":"The museum hired a bibliothetic specialist to catalog its rare books.","zh":"博物馆聘请了一位图书馆编目专家来整理其珍本。"}]}],"synonyms":["library","bibliographic","librarian","archival"],"phonetic":"/ˌbɪbliəˈθɛtɪk/","extraExplanation":["这个词非常少见，实际使用中更常用的词是 library（图书馆的）, bibliographic（书目/文献目录的）, librarian（图书管理员的/图书馆员）或 librarianship（图书馆学/图书馆工作）。","词源上与 biblio-（书）有关，并带有表示“放置/整理/保管”相关含义的成分；因此它常被理解为“与藏书与整理相关”的正式形容词。"]}
{"word":"bibliothque","summary":{"en":"“Bibliothèque” (often typed as “bibliotheque”) is French for “library,” and can also mean a private bookroom/collection in literary English.","zh":"“Bibliothèque”（常写作不带重音的“bibliotheque”）是法语“图书馆”，在较文学的英语里也可指私人藏书室/藏书。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(French) a library; a place (or institution) where you can read, study, or borrow books and other materials.","zh":"（法语）图书馆；一个可以阅读、学习或借阅书籍及其他资料的地方（或机构）。"},"examples":[{"en":"I’m going to the bibliothèque to return these books.","zh":"我要去图书馆还这些书。"},{"en":"The university bibliothèque has many quiet study rooms.","zh":"这所大学的图书馆有很多安静的自习室。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common, in English contexts) a private book collection or a room where books are kept; a library room.","zh":"（较少见，用于英语语境）私人藏书；藏书室/书房；放书的房间。"},"examples":[{"en":"The old mansion included a small bibliothèque lined with leather-bound volumes.","zh":"那座老宅里有一间小书房，墙上排满了皮装书。"}]}],"synonyms":["library","bookroom","reading room","collection"],"phonetic":"/ˌbɪbliəˈtɛk/","extraExplanation":["你输入的“bibliothque”很可能是法语“bibliothèque”的少了重音符号的拼写；法语里“ê”常在英文键盘上被省略成“e”，因此也常见写作“bibliotheque”。","在英语中更常用的是“library”。“bibliothèque”多出现在法语语境、书名/机构名，或为了营造“法式/文学感”的写作风格中。"]}
{"word":"bibliotic","summary":{"en":"“Bibliotic” is a rare adjective meaning ‘related to books or libraries; bookish.’","zh":"“bibliotic”是个罕见的形容词，意为“与书籍或图书馆有关的；书卷气的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Relating to books, writing, or libraries; bookish.","zh":"（罕见用语）与书籍、写作或图书馆有关的；书卷气的。"},"examples":[{"en":"She loved the quiet, bibliotic atmosphere of the old library.","zh":"她很喜欢那座老图书馆安静而充满书香的氛围。"},{"en":"His bibliotic interests included collecting first editions and reading literary history.","zh":"他与书有关的兴趣包括收藏初版书和阅读文学史。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Very rare) Intended for use in books or as part of a book’s content (for example, notes or references).","zh":"（非常罕见）用于书中内容的；作为书籍组成部分的（如注释或参考信息）。"},"examples":[{"en":"The editor added bibliotic notes to explain the historical references.","zh":"编辑加上书内注释来解释历史典故。"}]}],"synonyms":["bookish","literary","bibliographic","bibliophilic"],"phonetic":"/ˌbɪbliˈɑtɪk/","extraExplanation":["“bibliotic”在现代英语中非常少见，更多时候人们会用更常见的词来表达类似意思，例如：bookish（书卷气的）、literary（文学的）、bibliographic（书目/文献目录的）、bibliophilic（爱书的）。","它的构词可理解为来自“biblio-”（书）这一词根，但在日常写作与学术写作中并不常用；如果你是在文章里看到它，很可能是作者的少见用词、旧式用法，或与其他词（如 bibliographic / bibliophilic）混淆。"]}
{"word":"bibliotics","summary":{"en":"Bibliotics is a rare noun meaning the study/practice of books, especially their making and description.","zh":"Bibliotics 是个很少见的名词，指关于书籍（尤其是制作与描述整理）的学问或实践。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The study or practice of making, describing, or organizing books (including the practical side of bibliography).","zh":"关于书籍的制作、描述或整理的学问/实践（可理解为偏“实务”的书目学）。"},"examples":[{"en":"Her research moves from bibliography into bibliotics, focusing on how early books were physically produced.","zh":"她的研究从书目学延伸到 bibliotics，重点关注早期书籍在物理层面是如何制作出来的。"},{"en":"The workshop introduced basic bibliotics: paper, binding, and how to record edition details.","zh":"这次工作坊介绍了基础的 bibliotics：纸张、装订，以及如何记录版本细节。"}]}],"synonyms":["bibliography","book history","bookmaking","bookbinding"],"phonetic":"/ˌbɪbliˈɑtɪks/","extraExplanation":["“bibliotics”是非常少见的词，在现代英语中多被“bibliography（书目学/参考文献）”“book history（书籍史）”“bookbinding（装帧/装订）”或“bookmaking（制书/出版制作）”等更常见的表达取代。写作时若想更自然，通常用这些替代词更合适。","词根方面：biblio- 表示“书”，-tics 常见于表示“某种学科/技艺”的名词（如 economics）。因此它整体带有“关于书的学问/技艺”的感觉。"]}
{"word":"bibliotist","summary":{"en":"A rare, old-fashioned word for a librarian or a serious book lover/collector.","zh":"一个少见、较旧的词，可指图书馆员，也可指认真钻研或收藏书籍的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A librarian or a person who works with organizing and caring for a library and its books (an old-fashioned or rare word).","zh":"图书馆员；从事管理、整理与维护图书馆及馆藏的人（较旧或少见的用法）。"},"examples":[{"en":"The bibliotist cataloged the new books and placed them on the shelves.","zh":"这位图书馆员给新书编目，并把它们上架。"},{"en":"In older texts, a bibliotist might be described as the keeper of a private library.","zh":"在较早的文字里，bibliotist 可能指私人藏书室的管理者。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who loves, collects, or studies books, especially as a serious interest (rare).","zh":"嗜书者；藏书家；研究书籍的人（较少见）。"},"examples":[{"en":"He was a devoted bibliotist, always hunting for first editions.","zh":"他是个痴迷的藏书家，总在寻找初版本。"}]}],"synonyms":["librarian","bibliophile","book collector"],"phonetic":"/ˈbɪbliəˌtɪst/","extraExplanation":["这个词非常少见，现代英语里更常用 librarian（图书馆员）或 bibliophile（爱书者/藏书爱好者）。","词根来自拉丁语/希腊语的“biblio-（书）”，后缀“-ist”表示“从事某事的人”。因此它字面意思就是“与书打交道的人”。","在阅读较旧的文章或文学/学术材料时可能遇到 bibliotist；日常写作中用 librarian 或 bibliophile 会更自然。"]}
{"word":"Biblism","summary":{"en":"Biblism can mean (1) a strict, often literal reliance on the Bible as ultimate authority, or (2) a Bible-influenced word or expression in language.","zh":"Biblism 可指（1）严格、常偏字面地依赖《圣经》作为最高权威的立场；也可指（2）语言中源自或受《圣经》影响的词语/表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Religion) A strong belief in the Bible as the highest authority, often emphasizing a literal reading of its words.","zh":"（宗教）把《圣经》视为最高权威的信念/立场，常常强调按字面意思解读经文。"},"examples":[{"en":"Some critics say his Biblism leaves little room for historical context or metaphor.","zh":"一些批评者认为，他的“唯《圣经》主义”几乎不给历史背景或隐喻解读留下空间。"},{"en":"In that church tradition, Biblism is linked to strict moral rules based on scripture.","zh":"在那个教会传统中，“唯《圣经》主义”常与依据经文制定的严格道德规范联系在一起。"}]},{"partOfSpeech":"n.","definition":{"en":"(Language) A word, phrase, or style of expression taken from the Bible or strongly influenced by biblical language.","zh":"（语言）源自《圣经》或明显受《圣经》语言影响的词语、短语或表达方式。"},"examples":[{"en":"“The powers that be” is a well-known Biblism in modern English.","zh":"“the powers that be”（当权者）是现代英语里很常见的一个“圣经语”。"},{"en":"Writers sometimes use Biblisms to give their sentences a solemn, old-fashioned tone.","zh":"作家有时会用“圣经语”让句子带有庄重、古典的语气。"}]}],"synonyms":["biblicism","biblical literalism","scripturalism","biblical phrase","biblical idiom"],"phonetic":"/ˈbaɪblɪzəm/","extraExplanation":["“Biblism”在宗教讨论里有时带一点批评意味：暗示过于强调字面、忽视历史语境与不同诠释传统；但在支持者语境中也可能是中性或自我认同用语。","在语言学/文体学里，“Biblism”更偏中性，指英语中来自《圣经》（尤其是《钦定版圣经》KJV）的固定表达与句法风格；常见于演讲、文学作品中，用来营造庄严、道德劝诫或古雅的效果。"]}
{"word":"biblism","summary":{"en":"A biblism is a Bible-derived or Bible-like expression, often used to give writing a solemn, archaic tone.","zh":"biblism 指源自《圣经》或模仿《圣经》文体的表达，常用来让语言显得庄重、古雅。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A word, phrase, style, or expression that comes from the Bible or strongly resembles the language of the Bible (especially the King James Bible).","zh":"源自《圣经》或明显模仿《圣经》（尤指《钦定版圣经》）语言风格的词语、短语或表达方式（“圣经式用语”）。"},"examples":[{"en":"The novelist uses biblisms like “thou” and “ye” to create an old-fashioned voice.","zh":"这位小说家使用诸如“thou”“ye”之类的圣经式用语，来营造古老的叙述口吻。"},{"en":"In her speech, the biblisms made the message sound solemn and moral.","zh":"在她的演讲中，这些圣经式用语让信息听起来庄重且带有道德意味。"}]}],"synonyms":["biblical expression","biblicism","biblical idiom","biblical turn of phrase"],"phonetic":"/ˈbɪb.lɪˌzɪm/","extraExplanation":["“biblism”常用于文学评论、语言学或修辞分析中，指语言带有《圣经》语感：如古体代词（thou, thee, ye）、固定句式（“verily…”, “let there be…”）、以及《圣经》常见意象与措辞。","在英语文化里，许多日常表达其实源自《圣经》（例如“the powers that be”“the writing on the wall”）。这些更常被称为“biblical allusions / biblical idioms”；而“biblism”更强调“语言形式/风格像《圣经》”。"]}
{"word":"Biblist","summary":{"en":"A rare term meaning a Bible scholar—someone who studies the Bible in depth.","zh":"一个较少见的词，指《圣经》学者／深入研究《圣经》的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who studies the Bible closely, especially as a scholar of biblical texts and languages; a Bible scholar (rare in modern everyday English).","zh":"（较少见）专门研究《圣经》的人；《圣经》学者（尤指研究经文与语言的学者）。"},"examples":[{"en":"The conference invited a Biblist to speak about the original Hebrew of the Psalms.","zh":"会议邀请了一位《圣经》学者来讲解《诗篇》的希伯来语原文。"},{"en":"As a Biblist, she compares different ancient manuscripts of the New Testament.","zh":"作为《圣经》研究者，她会对比《新约》的不同古抄本。"}]}],"synonyms":["biblical scholar","Bible scholar","scripture scholar"],"phonetic":"/ˈbɪblɪst/","extraExplanation":["“Biblist”在现代英语里比较少见，更常见的说法是“biblical scholar”（《圣经》学者）或“Bible scholar”。注意不要和“biblicist”混淆：biblicist通常指强调按字面或严格依据《圣经》来解释与实践的人，带有宗教立场或方法论色彩，而“Biblist”更偏学术研究者。"]}
{"word":"biblist","summary":{"en":"A biblist is a list of bibliography/citation entries, especially in academic writing or citation software.","zh":"biblist 指参考文献/书目条目列表，常用于学术写作或引文管理软件语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(computing, libraries) A list of bibliographic records or references; a bibliography list (often in citation software or formats like BibTeX).","zh":"（计算机/图书馆）书目条目列表；参考文献列表（常见于引文软件或 BibTeX 等格式）。"},"examples":[{"en":"Add the new article to the biblist before you submit the paper.","zh":"提交论文前，把那篇新文章加到参考文献列表里。"},{"en":"The program can export a biblist in BibTeX format.","zh":"这个程序可以把参考文献列表导出为 BibTeX 格式。"}]}],"synonyms":["bibliography","reference list","citation list","works cited"],"phonetic":"ˈbɪbˌlɪst","extraExplanation":["“bib”常见于图书馆与学术写作中，是“bibliography（书目/参考文献）”或“bibliographic（书目的）”的缩写；因此“biblist”通常就是“bibliography list”的简写，用于表示一串引用条目。","在 LaTeX 写作生态里，你可能会看到类似“bib list / biblist”的用法，指 BibTeX/引文管理工具生成或维护的参考文献条目集合。正式写作中更常用的说法是“bibliography”或“reference list”。"]}
{"word":"biblists","summary":{"en":"“Biblists” means Bible scholars—people who study the Bible academically.","zh":"“biblists”指圣经学者/圣经研究者（以学术方式研究《圣经》的人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who study the Bible academically; Bible scholars (plural of “biblist”).","zh":"（biblist 的复数）圣经研究者；从事圣经学术研究的人。"},"examples":[{"en":"Many biblists compare different translations to understand the meaning of a passage.","zh":"许多圣经研究者会对比不同译本，以理解某段经文的含义。"},{"en":"The conference brought together historians, linguists, and biblists.","zh":"这次会议汇集了历史学家、语言学家和圣经研究者。"}]}],"synonyms":["Bible scholars","biblical scholars","scriptural scholars"],"phonetic":"/ˈbaɪblɪsts/","extraExplanation":["“Biblist”在英语学术语境中较常见，指以历史、语言、文本批判等方法研究《圣经》的人；不一定表示宗教立场或信仰身份。日常口语里更常用“Bible scholar / Biblical scholar（圣经学者）”。"]}
{"word":"biblos","summary":{"en":"Biblos usually refers to Byblos, an ancient city in Lebanon; it’s also a less common spelling of the same name.","zh":"Biblos通常指黎巴嫩的古城比布鲁斯（Byblos）；也可视为同名的较少见拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Byblos: an ancient coastal city in modern-day Lebanon, famous in Phoenician and Greek history and for early writing and trade (especially papyrus).","zh":"比布鲁斯（Byblos）：位于今黎巴嫩的古代海滨城市，以腓尼基与希腊历史闻名，并因早期文字发展与贸易（尤其纸草贸易）而著称。"},"examples":[{"en":"Byblos is one of the oldest continuously inhabited cities in the world.","zh":"比布鲁斯被认为是世界上最古老、持续有人居住的城市之一。"},{"en":"Archaeologists study inscriptions found at Byblos to learn about early alphabets.","zh":"考古学家研究在比布鲁斯发现的铭文，以了解早期字母文字。"}]},{"partOfSpeech":"n.","definition":{"en":"A less common spelling/transliteration of “Byblos,” sometimes seen in historical or regional contexts.","zh":"“Byblos（比布鲁斯）”较少见的一种拼写/音译形式，偶尔出现在历史或地区语境中。"},"examples":[{"en":"Some older texts write the city’s name as “Biblos.”","zh":"一些较旧的文献会把这座城市写作“Biblos”。"}]}],"synonyms":["Byblos"],"phonetic":"/ˈbaɪblɑːs/","extraExplanation":["“Byblos”这个名字与英语“Bible（圣经）”有历史关联：古希腊语中“byblos”指纸草（papyrus）或书卷。由于该城曾是纸草贸易的重要港口，“书—书卷—书籍”的含义逐渐发展，最后影响了“Bible”一词的词源。"]}
{"word":"biblus","summary":{"en":"“Biblus” is usually a misspelling of **Byblos**, an ancient port city in Lebanon, famous in history and linked to the origin of the word “Bible.”","zh":"“biblus”多半是 **Byblos（比布鲁斯）** 的误拼：黎巴嫩的一座古代港口城，以历史地位著名，并常被用来说明“Bible（圣经）”一词的词源关联。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a common misspelling of **Byblos**, an ancient Phoenician port city (modern Jbeil) on the coast of Lebanon","zh":"常见的拼写误写，通常指 **Byblos（比布鲁斯/朱拜勒）**：黎巴嫩海岸的一座古代腓尼基港口城市（今称 Jbeil）"},"examples":[{"en":"We visited Byblos to see the ancient ruins by the sea.","zh":"我们去了比布鲁斯，看海边的古代遗址。"},{"en":"Byblos is often mentioned in discussions of early Mediterranean trade.","zh":"在讨论早期地中海贸易时，经常会提到比布鲁斯。"}]}],"synonyms":["Byblos","Jbeil"],"phonetic":"/ˈbaɪbləs/","extraExplanation":["“Byblos（比布鲁斯）”因古代输出纸草（papyrus）而闻名。希腊语中与纸草/书卷相关的词（如 byblos / biblion）后来影响了英语 **Bible**（《圣经》）一词的来源，因此它常被拿来和“书、书卷、圣经”的词源联系在一起。","你输入的 **biblus** 在英语中不算常见标准拼写；如果你想查的是拉丁语 **bibulous**（意为“爱喝的/吸水的”），也可以告诉我，我可以另外给出该词的词条。"]}
{"word":"biborate","summary":{"en":"Biborate is an older chemistry term for certain borate salts, often referring to borax (sodium biborate).","zh":"Biborate 是较旧的化学用语，指某些硼酸盐，常用于指硼砂（sodium biborate）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A borate salt containing two boron atoms per formula unit; an older/less common term often used for certain borates such as sodium biborate (borax).","zh":"（化学）含有“二个硼原子”为基本组成单位的硼酸盐；较旧/较少见的术语，常被用来指某些硼酸盐，如“硼砂”（sodium biborate）。"},"examples":[{"en":"In older chemistry texts, borax may be described as sodium biborate.","zh":"在较早的化学教材里，硼砂有时会被写作“sodium biborate”（硼酸钠的一种旧称）。"},{"en":"The label listed the compound as a biborate of sodium.","zh":"标签把该化合物写成“sodium biborate”（一种钠的硼酸盐）。"}]}],"synonyms":["borate","borax","sodium borate"],"phonetic":"ˈbaɪˌbɔːreɪt","extraExplanation":["“biborate”在现代化学命名中并不常用，读到它时通常需要结合上下文或化学式确认具体是哪一种硼酸盐。很多情况下它指向日常更常见的“borax（硼砂）”。","如果你是在产品成分表里看到“biborate”，建议同时查看是否有更标准的名称（如“sodium borate / sodium tetraborate”）或CAS号，以免与其他borate类化合物混淆。"]}
{"word":"bibracteate","summary":{"en":"Bibracteate means “having two bracts,” a term used mainly in botanical descriptions.","zh":"bibracteate 指“具两枚苞片的”，主要用于植物学形态描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) having two bracts (small leaf-like structures) at the base of a flower, flower stalk, or inflorescence.","zh":"（植物学）具两枚苞片的；在花、花梗或花序基部有两片苞（叶状结构）的。"},"examples":[{"en":"The species is described as bibracteate, with two small bracts beneath each flower.","zh":"这种植物被描述为具两枚苞片的，每朵花下方都有两片小苞。"},{"en":"Look for bibracteate nodes: you’ll often see a pair of bracts at the base of the pedicel.","zh":"观察具两苞的节位：你常能在花梗基部看到一对苞片。"}]}],"synonyms":["two-bracted","two-bracted (botanical)"],"phonetic":"/baɪˈbræk.ti.eɪt/","extraExplanation":["“bibracteate”由前缀 bi-（二、双）+ bract（苞；苞片）+ -eate（表示“具有……的”）构成，常用于植物形态学描述与检索（如野外鉴定或分类文献）。","苞片（bract）是长在花或花序附近、看起来像叶片的结构；在很多植物（如一品红等）中，显眼的“花瓣状”部分其实可能是苞片。"]}
{"word":"bibracteolate","summary":{"en":"A botanical adjective meaning “having two bracteoles.”","zh":"一个植物学形容词，意思是“具有两枚小苞片的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having two bracteoles (small, leaf-like bracts) at the base of a flower or flower stalk.","zh":"（植物学）具两枚小苞片的；在花或花梗基部有两枚小苞片的。"},"examples":[{"en":"The botanist described the species as bibracteolate, noting two small bracteoles beneath each flower.","zh":"植物学家把该物种描述为“具两枚小苞片的”，并指出每朵花下方都有两枚小苞片。"},{"en":"In this genus, bibracteolate flowers are common and help with identification.","zh":"在这个属中，“具两枚小苞片的”花很常见，有助于鉴定。"}]}],"synonyms":["two-bracteolate","with two bracteoles"],"phonetic":"/ˌbaɪˌbræk.tiˈoʊ.leɪt/","extraExplanation":["“bibracteolate”多用于植物形态学描述，常见于分类学（taxonomy）或植物志（flora）文字中。","词形可拆解为 bi-（二、双）+ bracteole（小苞片）。bracteole 通常比 bract（苞片）更小，常位于花梗或小花基部。","实际观察时，苞片/小苞片有时会退化或很小，需借助放大镜或解剖镜确认。"]}
{"word":"bibs","summary":{"en":"“Bibs” is the plural of “bib”: a baby’s feeding bib or a front protective/ID bib (like a runner’s number bib).","zh":"“bibs”是“bib”的复数：指宝宝吃饭用的围嘴，也可指前胸的防护布或带号码/标识的号码布。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a piece of cloth or plastic worn over a baby’s or small child’s chest to keep clothes clean while eating","zh":"（婴儿/幼儿的）围嘴，围兜（吃饭时防止弄脏衣服）"},"examples":[{"en":"She put a bib on the baby before feeding him.","zh":"她在喂宝宝之前给他戴上了围嘴。"},{"en":"This bib is waterproof, so it’s easy to wipe clean.","zh":"这个围嘴是防水的，所以很容易擦干净。"}]},{"partOfSpeech":"n.","definition":{"en":"a protective covering worn on the front of the body (for example by athletes or workers), often with an identifying number or logo","zh":"（运动员/工作人员穿在胸前的）护胸布；（常带号码/标识的）号码布"},"examples":[{"en":"The runners pinned their bibs to their shirts.","zh":"跑者把号码布别在了衣服上。"},{"en":"Wear a bib when painting to protect your clothes.","zh":"粉刷时戴上护胸布来保护衣服。"}]},{"partOfSpeech":"vt.","definition":{"en":"to put a bib on someone (especially a baby)","zh":"给（尤指婴儿）戴上围嘴"},"examples":[{"en":"Bib the toddler before you give her soup.","zh":"给幼儿喝汤前先给她戴上围嘴。"}]}],"synonyms":["apron (similar, but usually larger)","smock (protective clothing)","race number (for running context)"],"phonetic":"/bɪbz/","extraExplanation":["“bibs”通常是名词复数（two bibs）。在赛跑里也常说“race bib”（参赛号码布）。","词源上与“bib”（像宝宝吃东西时发出的声音/口水）有关，后来用来指防弄脏的围布。"]}
{"word":"bibulosities","summary":{"en":"Bibulosities means (usually) habits of heavy drinking; more rarely, absorbency.","zh":"bibulosities 通常指嗜酒的习惯；更少见时指吸收液体的能力（吸液性）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(usually plural) A tendency or habit of drinking a lot of alcohol; fondness for alcoholic drinks.","zh":"（常用复数）嗜酒；爱喝酒的倾向或习惯。"},"examples":[{"en":"His memoir mentions his youthful bibulosities and the trouble they caused.","zh":"他的回忆录提到自己年轻时嗜酒的毛病，以及因此惹出的麻烦。"},{"en":"The article discusses the bibulosities of several famous writers.","zh":"这篇文章讨论了几位著名作家的嗜酒习惯。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) The ability of a material to soak up liquid; absorbency.","zh":"（罕见）吸液性；吸收性。"},"examples":[{"en":"Paper towels are valued for their bibulosity in the kitchen.","zh":"厨房里人们看重纸巾的吸水性。"}]}],"synonyms":["heavy drinking","tippling","boozing","intemperance","absorbency"],"phonetic":"bɪˈbjuːləsəti","extraExplanation":["“bibulosities”是名词“bibulosity”的复数形式，比较少见，更常见的形容词是“bibulous”。“bibulous”既可指“嗜酒的”，也可指“能吸收液体的”。","词源来自拉丁语“bibere”（喝）。因此在文学语境里，它常带一点幽默或讽刺的书面语气，用来委婉地说某人“爱喝酒/喝得多”。"]}
{"word":"bibulosity","summary":{"en":"Bibulosity most often means a tendency to drink alcohol (rare), and very rarely it can mean absorbency.","zh":"Bibulosity 通常指“嗜酒的倾向”（较少见），极少情况下也可指“吸水性”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The habit or tendency of drinking alcohol; fondness for alcoholic drinks (rare).","zh":"嗜酒；爱喝酒的倾向（较少见用法）。"},"examples":[{"en":"His bibulosity worried his family, so he decided to cut back on drinking.","zh":"他的嗜酒让家人担心，所以他决定减少饮酒。"},{"en":"The novel hints at the poet’s bibulosity through late-night bar scenes.","zh":"小说通过深夜酒吧的场景暗示了这位诗人的嗜酒。"}]},{"partOfSpeech":"n.","definition":{"en":"The quality of absorbing liquid easily; absorbency (very rare).","zh":"易吸收液体的性质；吸水性（非常少见用法）。"},"examples":[{"en":"The paper’s bibulosity made it useful for blotting ink.","zh":"这种纸吸水性强，适合用来吸干墨水。"}]}],"synonyms":["drunkenness","intemperance","tippling","absorbency"],"phonetic":"/ˌbaɪbjəˈlɑsəti/","extraExplanation":["这个词来自拉丁语 bibulus，意思与“喝/吸收”有关，所以它更接近 bibulous（嗜酒的；吸水的），而不是 bibli-（与书有关，如 bibliography 书目、bibliophile 爱书的人）。很多学习者会把 bibulosity 误以为和“书”有关。"]}
{"word":"bibulous","summary":{"en":"Bibulous usually means “fond of drinking alcohol,” and less commonly means “absorbent.”","zh":"Bibulous通常指“嗜酒的”，较少用来指“吸水性强的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Fond of drinking alcohol; drinking a lot (often regularly).","zh":"嗜酒的；爱喝酒的（常指经常喝、喝得多）。"},"examples":[{"en":"He was known as a bibulous writer who spent many nights in bars.","zh":"他以嗜酒的作家而闻名，许多夜晚都泡在酒吧里。"},{"en":"The bibulous guests kept asking for another round of drinks.","zh":"那些爱喝酒的客人不断要再来一轮酒。"}]},{"partOfSpeech":"adj.","definition":{"en":"Able to absorb liquid easily; absorbent (less common in everyday English).","zh":"易吸收液体的；吸水（吸液）性强的（较不常用）。"},"examples":[{"en":"The bibulous paper soaked up the spilled water quickly.","zh":"这种吸水性强的纸很快把洒出的水吸干了。"},{"en":"Use a bibulous cloth to dry the surface.","zh":"用一块吸水性强的布把表面擦干。"}]}],"synonyms":["boozy","heavy-drinking","tippling","absorbent"],"phonetic":"/ˈbɪbjələs/","extraExplanation":["“bibulous”来自拉丁语 bibere（喝）。在现代英语里，它最常用来形容“嗜酒的”，语气往往带一点幽默、文学感或委婉（比直接说 drunkard/ alcoholic 更文雅，但有时也带轻微讽刺）。","第二个意思“吸水的”与“喝”这个词根的比喻有关：材料像在“喝”水一样吸收液体。","常见搭配：bibulous person / bibulous habits（嗜酒的人/习惯）；bibulous paper/cloth（吸水纸/布）。文学与写作中偶尔会见到，用来营造较正式或复古的语感。"]}
{"word":"bibulously","summary":{"en":"Bibulously means “in a heavy-drinking way; drunkenly,” and more rarely “in an absorbent, soaking-up way.”","zh":"bibulously 表示“酒鬼般地、醉醺醺地”，较少见时也可指“像海绵一样吸收液体地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that involves drinking a lot of alcohol; drunkenly or like a heavy drinker.","zh":"以大量饮酒的方式；酒鬼般地；醉醺醺地。"},"examples":[{"en":"He laughed bibulously and ordered another round.","zh":"他醉醺醺地笑着，又点了一轮酒。"},{"en":"The story portrays the poet bibulously wandering from bar to bar.","zh":"故事描写那位诗人酒气熏天地从一家酒吧晃到另一家。"}]},{"partOfSpeech":"adv.","definition":{"en":"In an absorbent way; as if soaking up liquid (rare).","zh":"以吸收、吸水的方式；仿佛在把液体吸进去（较少见）。"},"examples":[{"en":"The dry towel lay bibulously on the spill.","zh":"干毛巾铺在洒出的液体上，像海绵一样迅速吸收。"}]}],"synonyms":["drunkenly","intoxicatedly","boozily","absorbently (rare sense)"],"phonetic":"/ˈbɪbjələsli/","extraExplanation":["“bibulously”来自形容词“bibulous”，源于拉丁语 bibere（“喝”）。在现代英语里，它多用于较有文学色彩或幽默的语境，来描写“很能喝/喝得很多”的状态。","第二个“吸收液体”的意思是从“bibulous = 易吸水的”引申而来，但日常英语更常用 “absorbently / soaking up” 等表达。"]}
{"word":"bibulousness","summary":{"en":"Bibulousness means a tendency to drink a lot of alcohol, or less commonly, the ability to absorb liquids easily.","zh":"Bibulousness 指嗜酒/爱喝酒的倾向；较少见时也指材料的吸水性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The habit or tendency of drinking a lot of alcohol; fondness for alcoholic drinks.","zh":"（饮酒的）嗜好；酗酒倾向；爱喝酒。"},"examples":[{"en":"His bibulousness became more noticeable after he lost his job.","zh":"他失业后，嗜酒的倾向变得更明显。"},{"en":"The novel portrays a lovable but flawed hero whose bibulousness causes trouble.","zh":"这部小说刻画了一位讨人喜欢却有缺点的主人公，他的嗜酒给他惹了麻烦。"}]},{"partOfSpeech":"n.","definition":{"en":"The quality of being able to absorb liquids easily (a less common meaning, related to “bibulous”).","zh":"（较少见）易吸收液体的性质；吸水性（与 bibulous 相关）。"},"examples":[{"en":"The bibulousness of the cloth makes it useful for cleaning spills.","zh":"这种布的吸水性使它适合用来擦拭洒出的液体。"},{"en":"Choose paper towels for their bibulousness when drying dishes.","zh":"擦干餐具时，可以选吸水性强的纸巾。"}]}],"synonyms":["heavy drinking","intemperance","drunkenness","boozing","absorbency"],"phonetic":"/ˈbɪbjələsnəs/","extraExplanation":["“bibulousness”来自形容词“bibulous”（爱喝酒的；能吸收液体的），再加名词后缀“-ness”。“bibulous”源自拉丁语 bibere（喝）。","在现代英语里，它更常用于较正式或带点幽默/文学色彩的写法，尤其指“嗜酒、爱喝酒”的习惯；日常口语更常说“heavy drinking”或“a drinking problem”。"]}
{"word":"Bibulus","summary":{"en":"Bibulus is best known as Caesar’s co-consul in 59 BCE and a prominent political opponent in late Republican Rome.","zh":"Bibulus最广为人知的身份是公元前59年与恺撒同任执政官，并在罗马共和国晚期作为恺撒的重要政治对手之一。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Marcus Calpurnius Bibulus: a Roman politician (1st century BCE) who served as consul in 59 BCE alongside Julius Caesar and is remembered mainly for opposing Caesar’s reforms.","zh":"比布鲁斯（马库斯·卡尔普尔尼乌斯·比布鲁斯）：公元前1世纪的罗马政治人物，公元前59年与恺撒同任执政官，因反对恺撒改革而为人所知。"},"examples":[{"en":"In 59 BCE, Caesar and Bibulus were co-consuls, but their partnership quickly became hostile.","zh":"公元前59年，恺撒与比布鲁斯同任执政官，但两人的合作很快变得敌对。"},{"en":"Some ancient writers mention Bibulus to show how intense Roman politics had become.","zh":"一些古代作者提到比布鲁斯，是为了说明罗马政治斗争有多激烈。"}]}],"phonetic":"ˈbɪbjʊləs","extraExplanation":["“Bibulus”是拉丁姓名，常见于罗马史语境。比布鲁斯与恺撒同为执政官时，常以宗教与程序（如宣布不祥日、反对会议召开等）来阻止政策推进，但影响有限，因此后世有时戏称那一年是“恺撒与恺撒执政之年”，暗示比布鲁斯被边缘化。","在英文历史写作中，Bibulus常作为“政治对手/制度性阻挠”的典型例子出现，常见于凯撒生平、晚期共和史、以及普鲁塔克与苏埃托尼乌斯等古代传记材料的讨论中。"]}
{"word":"bibulus","summary":{"en":"Bibulus is rare in English: it can mean “absorbent” or “fond of drinking,” and capitalized Bibulus is a Roman name (linked to Marcus Calpurnius Bibulus).","zh":"Bibulus在英语中很少见：可表示“吸水的”或“爱喝酒的”，而首字母大写Bibulus则是古罗马人名/家族名（与马库斯·卡尔普尔尼乌斯·比布鲁斯有关）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare; often seen via the related word “bibulous”) able to soak up liquids; absorbent.","zh":"（罕见；常通过相关词“bibulous”出现）能吸收液体的；吸水的。"},"examples":[{"en":"Use bibulous paper to blot the ink.","zh":"用吸水纸把墨水吸干。"},{"en":"The bibulus cloth quickly absorbed the spill.","zh":"那块吸水布很快把洒出的液体吸收了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) fond of drinking alcohol; given to drinking.","zh":"（罕见）爱喝酒的；嗜酒的。"},"examples":[{"en":"He had a bibulus reputation at college parties.","zh":"他在大学派对上以爱喝酒出名。"},{"en":"The novel describes a bibulus uncle who is always looking for a drink.","zh":"小说描写了一位总在找酒喝的嗜酒叔叔。"}]},{"partOfSpeech":"n.","definition":{"en":"(capitalized) Bibulus: a Roman family name, best known from Marcus Calpurnius Bibulus, a politician in the late Roman Republic.","zh":"（首字母大写）比布鲁斯：古罗马的家族名/人名，以罗马共和国末期政治人物马库斯·卡尔普尔尼乌斯·比布鲁斯最为知名。"},"examples":[{"en":"In Roman history, Bibulus is often mentioned alongside Julius Caesar.","zh":"在罗马史中，比布鲁斯常与尤利乌斯·恺撒并提。"},{"en":"Bibulus served as consul in 59 BCE.","zh":"比布鲁斯在公元前59年担任执政官。"}]}],"synonyms":["absorbent","spongy","thirsty (for alcohol)","hard-drinking"],"phonetic":"/ˈbɪbjələs/","extraExplanation":["“bibulus”源自拉丁语，和饮酒（bib-，如拉丁语 bibere“喝”）有关：在英语里更常见的形式是 **bibulous**，既可指“吸水的”，也可指“爱喝酒的”。","如果你是在现代英文文章里看到小写 **bibulus**，很多时候作者其实是想用更常见的 **bibulous**；而首字母大写 **Bibulus** 则通常是历史人物/家族名。"]}

