{"word":"Bicakci","summary":{"en":"Bicakci is a Turkish surname, historically connected to the trade of making or selling knives.","zh":"Bicakci 是一个土耳其姓氏，历史上与制刀或售刀的行业有关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Turkish surname (family name), often originally linked to the occupation of making or selling knives.","zh":"一个土耳其姓氏（家族姓），常源自与“制作或出售刀具”相关的职业。"},"examples":[{"en":"Mr. Bicakci will join the meeting tomorrow.","zh":"比贾克奇先生明天将参加会议。"},{"en":"The author, Bicakci, writes about life in Istanbul.","zh":"作者比贾克奇写到了伊斯坦布尔的生活。"}]},{"partOfSpeech":"n.","definition":{"en":"(from Turkish) a knife-maker or cutler; someone whose trade involves knives.","zh":"（源自土耳其语）制刀匠；刀具匠人（从事刀具相关行业的人）。"},"examples":[{"en":"In the old market, a bicakci repaired knives by hand.","zh":"在老市场里，一位制刀匠用手工修理刀具。"},{"en":"His grandfather was a bicakci, so the family name remained.","zh":"他祖父是制刀匠，因此这个姓氏一直沿用下来。"}]}],"synonyms":["cutler","bladesmith"],"phonetic":"/biˈdʒɑk.tʃi/","extraExplanation":["“Bicakci”通常对应土耳其语拼写“Bıçakçı”（带变音符号的ı、ç）。在英语环境中，这些字母常被简化成 i / c，所以你会看到 Bicakci 这种写法。","词根上，土耳其语“bıçak”意为“刀”，后缀“-çı/-ci”常表示“从事某职业的人”（类似英语的 -er，如 baker）。因此这个姓氏带有“做刀/卖刀的人”的职业来源。"]}
{"word":"bicalcarate","summary":{"en":"Bicalcarate means “having two spurs,” mainly used in scientific descriptions of plants or animals.","zh":"bicalcarate 指“具双距的（有两个距状突起）”，主要用于动植物的科学形态描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany/Zoology) Having two spurs or spur-like projections (often describing a flower, leaf, or other structure).","zh":"（植物学/动物学）具双距的；有两个距状突起的（常用来形容花、叶或其他结构）。"},"examples":[{"en":"The orchid was described as bicalcarate, with two small spurs at the base of the flower.","zh":"这种兰花被描述为具双距的，花基部有两个小距。"},{"en":"In the field guide, the species is identified by its bicalcarate petals.","zh":"在野外图鉴中，这个物种通过其“具双距”的花瓣来辨认。"}]}],"synonyms":["two-spurred","bispurred","biscalcarate"],"phonetic":"/ˌbaɪkælˈkɛrət/","extraExplanation":["词源提示：bi- 表示“二、双”，calcar 来自拉丁语，原意是“马刺/距”。因此 bicalcarate 字面意思就是“有两个距的”。","使用场景：这是偏学术、描述形态的术语，多见于植物分类、形态学描述（如花冠基部的“距”）。日常英语中很少使用。"]}
{"word":"bicalvous","summary":{"en":"“Bivouac” means a temporary camp or the act of camping outdoors with minimal shelter.","zh":"“bivouac”指简易临时营地，或指在野外以最少遮蔽进行临时露营/露宿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a temporary camp, especially one used by soldiers or hikers with little or no shelter","zh":"（尤指士兵或徒步者的）临时露营地；简易营地（通常几乎没有遮蔽）"},"examples":[{"en":"The hikers made a bivouac near the river for the night.","zh":"徒步者在河边搭了个简易营地过夜。"},{"en":"The soldiers set up a bivouac on the hillside.","zh":"士兵们在山坡上建立了临时营地。"}]},{"partOfSpeech":"vi.","definition":{"en":"to camp outdoors for a short time, usually with minimal shelter","zh":"（在野外）临时露营；露宿（通常装备简陋）"},"examples":[{"en":"We bivouacked under the stars because the cabin was full.","zh":"小屋住满了，我们只好在星空下露营。"},{"en":"They bivouacked on the trail and continued at dawn.","zh":"他们在路上临时露营，天一亮就继续前进。"}]}],"synonyms":["camp","encampment","temporary camp","camp out"],"phonetic":"/ˈbɪv.uˌæk/","extraExplanation":["你输入的“bicalvous”很可能是拼写错误。最接近、也最常见的英文单词是 **bivouac**，常用于军事语境或户外徒步/登山语境，强调“临时、简易、露宿”的感觉。","词源来自法语 *bivouac*。在英语里既可作名词（一个临时营地），也可作动词（临时露营/露宿）。在户外圈子里也常见短写 **bivy**（bivouac 的口语缩写）。"]}
{"word":"bicameral","summary":{"en":"Bicameral means having two separate chambers, most commonly describing a legislature with two houses.","zh":"bicameral 指“由两个议院/两院组成的”，最常用来描述“两院制”立法机构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two separate chambers or houses (especially in a legislature).","zh":"（尤指立法机构）由两个议院/两院组成的。"},"examples":[{"en":"The U.S. Congress is a bicameral legislature with the House and the Senate.","zh":"美国国会是两院制立法机构，由众议院和参议院组成。"},{"en":"Some countries changed from a unicameral to a bicameral system to improve checks and balances.","zh":"一些国家从一院制改为两院制，以加强制衡。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to a two-part structure with two distinct sections (not only in politics).","zh":"与“两部分结构”有关的；由两个明显部分构成的（不只用于政治）。"},"examples":[{"en":"The agreement uses a bicameral structure: one part sets principles, and the other lists detailed rules.","zh":"该协议采用两部分结构：一部分规定原则，另一部分列出详细规则。"},{"en":"The committee proposed a bicameral model for decision-making, with separate review and approval groups.","zh":"委员会提出一种“两组”决策模式：分别设立审查组和批准组。"}]}],"synonyms":["two-house","two-chamber","two-part"],"phonetic":"/ˌbaɪˈkæm(ə)rəl/","extraExplanation":["词源：bi- 表示“二、双”，camera 源自拉丁语，意为“房间/室”；bicameral 字面意思就是“有两个房间的”，因此常用来指“两院制”。","常见对比：unicameral（一院制） vs. bicameral（两院制）。在英语新闻与政治学写作中，bicameral 多用来讨论立法程序、权力制衡与代表性。"]}
{"word":"bicameralism","summary":{"en":"Bicameralism is a political system where a legislature has two chambers (two houses).","zh":"Bicameralism 指立法机关由两个议院组成的“两院制”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A system of government in which the legislature has two separate chambers (houses), such as a Senate and a House of Representatives.","zh":"两院制；（立法机关）由两个独立议院组成的制度，例如参议院与众议院。"},"examples":[{"en":"The U.S. Congress is an example of bicameralism, with the Senate and the House of Representatives.","zh":"美国国会是两院制的例子，由参议院和众议院组成。"},{"en":"Supporters argue that bicameralism can slow down bad laws by requiring approval from two chambers.","zh":"支持者认为，两院制通过要求两院都同意，可以减缓草率或不良法案的通过。"},{"en":"Critics say bicameralism may make government less efficient because it can delay legislation.","zh":"批评者说，两院制可能降低政府效率，因为它会拖延立法进程。"}]}],"synonyms":["two-house legislature","two-chamber system","bicameral legislature"],"phonetic":"/ˌbaɪˈkæmərəlˌɪzəm/","extraExplanation":["词源：bi- 表示“两个”，camera（此处与“chamber/议院”相关的来源）指“议院/会议室”，合起来就是“两个议院的制度”。","语境提示：bicameralism 常出现在政治学、宪政讨论中，经常与 unicameralism（单院制）对比。","文化/制度差异：一些国家采用两院制，往往是为了让不同地区、阶层或政治力量在立法中得到双重代表与制衡；但是否必要取决于国家规模、联邦结构与历史传统。"]}
{"word":"bicameralist","summary":{"en":"A bicameralist is someone who supports a two-chamber legislature; it can also describe ideas or arguments favoring that system.","zh":"bicameralist 指支持“两院制”立法机构的人；也可形容支持两院制的观点或论证。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who supports or advocates a bicameral legislature (a lawmaking system with two chambers, such as a senate and a house of representatives)","zh":"支持或主张“两院制”（由两个议院组成的立法体系，如参议院与众议院）的人"},"examples":[{"en":"As a bicameralist, she believes two chambers help prevent rushed laws.","zh":"作为两院制的支持者，她认为两个议院能防止法律仓促通过。"},{"en":"Many bicameralists argue that a second chamber provides extra oversight.","zh":"许多两院制拥护者认为第二议院能提供额外的监督。"}]},{"partOfSpeech":"adj.","definition":{"en":"supporting or favoring a bicameral system of government or legislation","zh":"支持两院制政府或立法体系的；主张两院制的"},"examples":[{"en":"The party took a bicameralist position during the constitutional debate.","zh":"该党在制宪辩论中采取了支持两院制的立场。"},{"en":"His bicameralist arguments focused on balancing regional and popular interests.","zh":"他支持两院制的论点集中在平衡地区利益与民意。"}]}],"synonyms":["supporter of bicameralism","two-chamber advocate","bicameralism supporter"],"phonetic":"/ˌbaɪˈkæm(ə)rəlɪst/","extraExplanation":["“Bicameral”来自拉丁语 bi-（二）+ camera（房间/议事厅），指“两个议院”。因此 bicameralist 常用于讨论宪法设计与议会结构，例如美国国会（参议院+众议院）、英国议会（上议院+下议院）等。"]}
{"word":"bicamerist","summary":{"en":"A person who supports a two‑chamber (bicameral) legislature.","zh":"支持两院制（两个议院）立法机关的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who supports or advocates a bicameral legislature (a law‑making body with two chambers, such as a Senate and a House of Representatives).","zh":"支持或主张“两院制”立法机构（由两个议院组成的立法机关，例如参议院与众议院）的人。"},"examples":[{"en":"Many bicamerists argue that two chambers create better checks and balances.","zh":"许多两院制支持者认为，两个议院能形成更好的制衡。"},{"en":"As a bicamerist, she opposed the proposal to replace the Senate with a single national assembly.","zh":"作为两院制支持者，她反对用单一的全国议会取代参议院。"}]}],"synonyms":["advocate of bicameralism","supporter of a bicameral legislature","pro-bicameral"],"phonetic":"/ˌbaɪˈkæmərɪst/","extraExplanation":["“Bicamerist”来自 bi-（两）+ camera（源自拉丁语，指“房间/议事厅”）+ -ist（……主义者/支持者）。这里的 camera 不是“相机”，而是指“议院/议事厅”。","常见搭配与相关词：bicameral（adj. 两院制的）；bicameralism（n. 两院制）；unicameral（adj. 一院制的）；unicameralism（n. 一院制）。在政治讨论中，这个词较正式，日常更常说 “supporter of a bicameral legislature/system”。"]}
{"word":"bicanalicular","summary":{"en":"A medical adjective meaning “involving both canals,” especially both tear canaliculi in the eye.","zh":"医学形容词，意为“涉及两条管道的”，尤指眼部上下两条泪小管都参与。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Involving or passing through two canals (especially both tear-drainage canaliculi in the eyelids).","zh":"（医学）涉及或通过两条管道的；尤指经过眼睑内侧的两条泪小管（上下泪小管）的。"},"examples":[{"en":"The surgeon placed a bicanalicular stent to keep both tear ducts open during healing.","zh":"外科医生放置了双泪小管支架，以便在愈合期间保持上下泪道通畅。"},{"en":"Bicanalicular intubation is often used when both canaliculi are affected.","zh":"当上下泪小管都受累时，常会采用双泪小管插管术。"}]}],"synonyms":["two-canal","dual-canalicular (medical)","bilateral canalicular (context-dependent)"],"phonetic":"/ˌbaɪˌkænəˈlɪkjələr/","extraExplanation":["“Bicanalicular”常见于眼科（泪道）语境：canaliculus（泪小管）是把眼泪从泪点引流到泪囊的细小管道；“bicanalicular stent/intubation（双泪小管支架/插管）”表示支架或导管同时穿过上、下泪小管，用于泪道狭窄、外伤修复或术后保持通畅。","构词上：bi- = “两个/双”，canalicular = “管道的/小管的”。因此字面意思就是“涉及两条小管/两条管道的”。"]}
{"word":"bicapitate","summary":{"en":"Bicapitate means “two-headed,” usually in scientific descriptions or sometimes as a metaphor for having two leaders.","zh":"bicapitate 意为“双头的/有两个头的”，多用于科学描述，也可比喻“由两方共同领导、方向不一”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two heads; two-headed (used in biology and anatomy, or figuratively).","zh":"双头的；有两个头的（多用于生物学、解剖学，也可作比喻）。"},"examples":[{"en":"A bicapitate embryo is extremely rare in humans.","zh":"在人类中，双头胚胎极其罕见。"},{"en":"The researcher described a bicapitate specimen in the laboratory report.","zh":"研究人员在实验室报告中描述了一个双头标本。"},{"en":"In a figurative sense, the committee became bicapitate—two leaders giving different directions.","zh":"从比喻意义上说，这个委员会变成了“双头”——两位领导给出不同方向。"}]}],"synonyms":["two-headed","bicephalic"],"phonetic":"/baɪˈkæpɪteɪt/","extraExplanation":["词源：bi- 表示“二、双”，-capitate 来自拉丁语 caput（“头”）。因此 bicapitate 字面意思就是“有两个头的”。","用法提示：这是偏学术/技术性的词，日常英语更常用 two-headed。","相关词：bicephalic（“双头的”，在医学/生物学中也常见）；capitate（“有头状部位的；头状的”，亦常见于解剖/植物学）。"]}
{"word":"bicapsular","summary":{"en":"Bicapsular means “having two capsules” and is used mainly in scientific contexts.","zh":"bicapsular 表示“具有两个囊（囊状结构）”，主要用于科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two capsules, or consisting of two capsule-like parts (used mainly in biology, botany, and anatomy).","zh":"具有两个囊（荚、囊状结构）的；由两个囊状部分组成的（多用于生物学、植物学与解剖学语境）。"},"examples":[{"en":"In some plants, the fruit is described as bicapsular because it forms two seed capsules.","zh":"在一些植物中，果实被描述为 bicapsular，因为它会形成两个种子囊。"},{"en":"The report noted a bicapsular structure surrounding the gland.","zh":"报告指出腺体周围有一种双囊状结构。"}]}],"synonyms":["two-capsuled","two-capsule","double-capsuled"],"phonetic":"/ˌbaɪˈkæpsjələr/","extraExplanation":["词源上由前缀 bi-（“两个、双”）+ capsular（“囊的、像囊的”）构成，因此多出现在较正式的科学写作中，用来强调“有两层/两部分囊状结构”这一形态特征。","在不同学科里，“capsule/囊”可能指不同结构：如植物的“蒴果/种子囊”，或解剖学里包裹器官的“囊/囊膜”。理解时要结合上下文判断具体指哪一种“囊”。"]}
{"word":"bicarb","summary":{"en":"“Bicarb” is a common informal word for bicarbonate—usually baking soda; in medical contexts it can mean blood bicarbonate levels.","zh":"“bicarb”是“bicarbonate”的常见口语简称，通常指小苏打；在医疗语境中也可指血液碳酸氢盐水平。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Short for “bicarbonate,” usually meaning baking soda (sodium bicarbonate), a mild alkaline powder used in cooking, cleaning, and sometimes for relieving indigestion.","zh":"“bicarbonate（碳酸氢盐）”的简称，通常指小苏打/烘焙苏打（碳酸氢钠），一种温和的碱性粉末，用于烘焙、清洁，有时也用于缓解消化不良。"},"examples":[{"en":"Add a pinch of bicarb to help the cake rise.","zh":"加一小撮小苏打，帮助蛋糕膨起来。"},{"en":"She cleaned the sink with bicarb and vinegar.","zh":"她用小苏打和醋清洗水槽。"},{"en":"Some people mix bicarb with water for heartburn, but you should be careful with the amount.","zh":"有些人会把小苏打加水来缓解胃灼热，但用量要小心。"}]},{"partOfSpeech":"n.","definition":{"en":"In medicine and lab results, “bicarb” can also mean the bicarbonate level in the blood (HCO₃⁻).","zh":"在医疗/化验语境中，“bicarb”也可指血液中的碳酸氢盐水平（HCO₃⁻）。"},"examples":[{"en":"The doctor checked his bicarb level to assess acid–base balance.","zh":"医生查看他的碳酸氢盐水平，以评估酸碱平衡。"},{"en":"Her bicarb was low, suggesting metabolic acidosis.","zh":"她的碳酸氢盐偏低，提示可能有代谢性酸中毒。"}]}],"synonyms":["bicarbonate","baking soda","sodium bicarbonate"],"phonetic":"/ˈbaɪˌkɑːrb/","extraExplanation":["“bicarb”更常见于英式/澳式口语与包装标识（如“bicarb soda”），美式更常说“baking soda”。","与“baking powder（泡打粉）”不同：小苏打通常需要酸性材料（如柠檬汁、酸奶、醋）来产生气体；泡打粉通常已含酸性成分，使用更“自带反应”。"]}
{"word":"bicarbide","summary":{"en":"“Bicarbide” is a rare term for a type of carbide with two carbon atoms; people more often say “carbide/dicarbide,” or they may mean “bicarbonate.”","zh":"“bicarbide”很少用，指含两个碳原子的某类碳化物；更常见的说法是“carbide/dicarbide”，也常被误写成“bicarbonate（碳酸氢盐）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/technical) A carbide compound containing two carbon atoms per formula unit (i.e., a “dicarbide” type carbide).","zh":"（罕见/技术用语）一种每个化学式单位含有两个碳原子的碳化物（相当于“二碳化物”一类的碳化物）。"},"examples":[{"en":"In older texts, “bicarbide” may refer to a dicarbide structure with two carbon atoms.","zh":"在较早的文献中，“bicarbide”有时指含两个碳原子的二碳化物结构。"},{"en":"This term is uncommon today; most sources prefer “carbide” or “dicarbide.”","zh":"这个词现在不常用；多数资料更常用“carbide（碳化物）”或“dicarbide（二碳化物）”。"}]}],"synonyms":["dicarbide","carbide"],"phonetic":"/baɪˈkɑrbaɪd/","extraExplanation":["“bicarbide”在现代英语里非常少见，很多时候是拼写或用词混淆。最常见的两种混淆是：\n1）想写的是 **bicarbonate**（碳酸氢盐；如 *sodium bicarbonate* 小苏打/食用碱）\n2）想写的是 **carbide**（碳化物；如 *calcium carbide* 电石）\n如果你告诉我你的句子或你想表达的化学物质名称，我可以帮你判断应当用哪个词。"]}
{"word":"bicarbonate","summary":{"en":"Bicarbonate is a chemical (often sodium bicarbonate, baking soda) used for baking, cleaning, and sometimes medicine; it also appears in biology as HCO₃⁻.","zh":"bicarbonate 指“碳酸氢盐”，常指碳酸氢钠（小苏打/烘焙苏打），用于烘焙、清洁及部分医疗用途；在生理中也指 HCO₃⁻。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical substance containing the bicarbonate ion (HCO₃⁻); most commonly refers to sodium bicarbonate (baking soda), used in cooking, cleaning, and medicine","zh":"含有碳酸氢根离子（HCO₃⁻）的化学物质；最常见指碳酸氢钠（小苏打/烘焙苏打），用于烹饪、清洁和医用"},"examples":[{"en":"Add a small amount of bicarbonate to the batter to help the cake rise.","zh":"在面糊里加一点碳酸氢盐（小苏打），能帮助蛋糕膨松。"},{"en":"Some people take sodium bicarbonate for heartburn, but you should follow the directions.","zh":"有些人会用碳酸氢钠来缓解胃灼热，但要按说明使用。"},{"en":"The label says the toothpaste contains bicarbonate for gentle cleaning.","zh":"标签上写这款牙膏含有碳酸氢盐，用于温和清洁。"}]}],"synonyms":["sodium bicarbonate","baking soda","bicarb"],"phonetic":"/ˌbaɪˈkɑːr.bə.neɪt/","extraExplanation":["在英式英语里，人们常说“bicarbonate of soda”（苏打粉/小苏打）；在美式英语中更常直接说“baking soda”来指碳酸氢钠。","医学/生理语境中，blood bicarbonate（血液碳酸氢盐）与酸碱平衡有关；化验单上常写作 “HCO3−” 或 “bicarb”。"]}
{"word":"bicarbonates","summary":{"en":"Bicarbonates are salts containing the bicarbonate (HCO₃⁻) ion, widely used in baking and medicine.","zh":"Bicarbonates 指含碳酸氢根离子（HCO₃⁻）的盐类，广泛用于烘焙与医疗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"salts that contain the bicarbonate (hydrogen carbonate) ion, often used in medicine and baking","zh":"含有“碳酸氢根离子（HCO₃⁻）”的盐类，常用于药用与烘焙"},"examples":[{"en":"Sodium bicarbonate is commonly used as baking soda.","zh":"碳酸氢钠常被用作小苏打（烘焙苏打）。"},{"en":"Some antacids contain bicarbonates to reduce stomach acid.","zh":"一些抗酸药含有碳酸氢盐，用来中和胃酸。"},{"en":"Bicarbonates help keep the body’s blood pH stable.","zh":"碳酸氢盐有助于维持血液酸碱度的稳定。"}]}],"synonyms":["hydrogen carbonates","bicarbonate salts"],"phonetic":"/baɪˈkɑːrbəˌneɪts/","extraExplanation":["“bicarbonate”在化学上也常称为“hydrogen carbonate（碳酸氢盐）”。日常生活里最常见的是sodium bicarbonate（碳酸氢钠），也就是baking soda（小苏打），用于烘焙膨松、除味、清洁等。","人体生理中，“bicarbonate buffer system（碳酸氢盐缓冲系统）”是维持体液酸碱平衡的重要机制；在医学检验里有时会看到HCO₃⁻或“bicarbonate level（碳酸氢盐水平）”。"]}
{"word":"bicarbs","summary":{"en":"“Bicarbs” is an informal word meaning bicarbonates, usually baking soda (sodium bicarbonate).","zh":"“bicarbs”是非正式说法，指碳酸氢盐，通常就是小苏打（碳酸氢钠）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Bicarbonates; especially sodium bicarbonate (baking soda). Often used in everyday speech, particularly in Australia/New Zealand, and sometimes in medical contexts (blood “bicarb” level).","zh":"（非正式）碳酸氢盐；尤指碳酸氢钠（小苏打/烘焙苏打）。常见于口语，澳大利亚/新西兰更常用；在医学语境中也可指血液“碳酸氢盐（bicarb）”水平。"},"examples":[{"en":"Add a teaspoon of bicarbs to the mixture to help it rise.","zh":"在混合物里加一茶匙小苏打（bicarbs），帮助它膨松。"},{"en":"The doctor checked his bicarb levels to see if there was an acid–base problem.","zh":"医生检查了他的碳酸氢盐（bicarb）水平，看看是否有酸碱失衡问题。"},{"en":"Some people use bicarbs with water for cleaning, but you should avoid mixing it with certain chemicals.","zh":"有人会用小苏打（bicarbs）加水清洁，但要避免和某些化学品混用。"}]}],"synonyms":["bicarb","bicarbonate(s)","baking soda","sodium bicarbonate"],"phonetic":"/ˈbaɪkɑrbz/","extraExplanation":["“bicarbs”是“bicarbonates”的口语缩略；在澳新英语里很常见，也常写作“bicarb”。在烹饪/清洁语境通常指“sodium bicarbonate（碳酸氢钠）”；在医学化验中“bicarb”多指血液中的碳酸氢盐（HCO₃⁻）指标。","可数用法在口语里也会出现：例如“a bicarb (of soda)”= 一份/一盒小苏打（更偏澳新说法）。"]}
{"word":"bicarbureted","summary":{"en":"Bicarbureted means “equipped with two carburetors.”","zh":"bicarbureted 指“装有两个化油器的（双化油器）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an engine or vehicle) having two carburetors, usually to deliver more fuel–air mixture and increase power.","zh":"（发动机或车辆）装有两个化油器的；通常用于提供更多的油气混合物以提升动力。"},"examples":[{"en":"The classic V‑twin motorcycle came bicarbureted from the factory.","zh":"这款经典V型双缸摩托车出厂时就配备了双化油器。"},{"en":"A bicarbureted setup can improve throttle response, but it may need careful tuning.","zh":"双化油器配置能改善油门响应，但通常需要精细调校。"}]}],"synonyms":["dual-carbureted","twin-carbureted","two-carburetor","twin-carb"],"phonetic":"/ˌbaɪˌkɑrˈbjʊreɪtɪd/","extraExplanation":["“bicarbureted”较少见，更常见的写法是“bi‑carbureted”或直接说“twin‑carb / dual‑carb”。","化油器（carburetor）主要出现在较老的汽油发动机上；现代车辆多用电喷（fuel injection），所以这个词常见于老车、摩托车、改装与维修语境。"]}
{"word":"bicarburetted","summary":{"en":"Bicarburetted is an old chemistry adjective meaning “doubly carbureted,” especially in the phrase “bicarburetted hydrogen” (ethylene).","zh":"bicarburetted 是化学旧词，意为“更高程度加碳/双加碳的”，常见于旧称 bicarburetted hydrogen（乙烯）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic, chemistry) Describing a substance (especially a gas) considered “doubly carbureted,” i.e., thought to contain a higher proportion of carbon than a “carburetted” form; often used in the old term “bicarburetted hydrogen” (ethylene).","zh":"（古旧用法，化学）形容（尤指气体）“双重加碳/含碳更多的”，即被认为比“carburetted（加碳的）”形式含有更高比例的碳；常见于旧称“bicarburetted hydrogen”（乙烯）。"},"examples":[{"en":"In older chemistry texts, ethylene was often called bicarburetted hydrogen.","zh":"在较早的化学文献中，乙烯常被称为 bicarburetted hydrogen（双加碳氢气）。"},{"en":"The author compares carburetted and bicarburetted gases using the terminology of his time.","zh":"作者用其时代的术语比较 carburetted 与 bicarburetted 两类气体。"}]}],"synonyms":["doubly carbureted (archaic)","(in the phrase) ethylene"],"phonetic":"/ˌbaɪkɑrˈbjʊreɪtɪd/","extraExplanation":["这是18—19世纪较常见的化学旧术语体系（如“carburetted hydrogen”“bicarburetted hydrogen”）。当时对分子结构与化学式的理解尚未完全统一，因此会用“carburetted（加碳的）/bicarburetted（更高程度加碳的）”来区分不同烃类气体。现代化学一般直接使用具体名称与化学式，例如 ethylene（乙烯，C₂H₄）。"]}
{"word":"bicarinate","summary":{"en":"Bicarinate means “having two keels/ridges,” a scientific term used to describe shapes in biology.","zh":"bicarinate 指“具双龙骨（双脊）”，多用于生物学中的形态描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two keels (two raised, ridge-like structures), especially in describing the shape of a leaf, petal, seed, shell, or other body part in biology.","zh":"（尤用于生物学描述）具“双龙骨/双脊”的；有两条隆起的脊状结构的（常指叶、花瓣、种子、贝壳或其他部位的形状）。"},"examples":[{"en":"The botanist noted that the seed pod was bicarinate, with two distinct ridges along its length.","zh":"植物学家注意到这个种荚呈双龙骨状，纵向有两条明显的棱脊。"},{"en":"Some insects have bicarinate wing covers that look slightly raised down the middle on both sides.","zh":"有些昆虫的鞘翅呈双龙骨状，中间两侧各有一点隆起的脊。"}]}],"synonyms":["two-keeled","two-ridged","double-keeled"],"phonetic":"/baɪˈkærəneɪt/","extraExplanation":["词源拆解：bi- 表示“二、双”，carina 表示“龙骨/船的脊骨”（也可指动物或植物结构上的“脊/棱”）。因此 bicarinate 字面意思就是“有两条龙骨（两条脊）”。这是比较偏科学写作（植物学、动物学、昆虫学、贝类学）里的形态描述词。"]}
{"word":"bicarpellary","summary":{"en":"A botanical adjective meaning “having two carpels” (two female reproductive units) in the ovary/gynoecium.","zh":"植物学形容词，表示“二心皮的”，即子房/雌蕊由两个心皮构成。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having two carpels (female reproductive units) in an ovary; consisting of two carpels.","zh":"（植物学）二心皮的；由两个心皮组成的（指子房/雌蕊的结构）。"},"examples":[{"en":"In this species, the ovary is bicarpellary, with two fused carpels.","zh":"在这个物种中，子房为二心皮，由两个融合的心皮组成。"},{"en":"A bicarpellary gynoecium often develops into a fruit with two chambers.","zh":"二心皮的雌蕊群常发育成果实内有两个室（腔）。"}]}],"synonyms":["two-carpelled","bicarpellate"],"phonetic":"/ˌbaɪkɑrˈpɛləri/","extraExplanation":["词源拆解：bi- 表示“二”；carpel 指“心皮”（雌蕊的基本单位，包裹胚珠并形成子房/果实）。因此 bicarpellary 直译就是“有两个心皮的”。","在植物形态学描述中，除了 bicarpellary（两心皮），还常见 tricarpellary（三心皮）、multicarpellary（多心皮）。心皮之间可能“离生”（不融合）或“合生/融合”（fused），描述时常会一起说明。"]}
{"word":"bicarpellate","summary":{"en":"Bicarpellate means “having two carpels,” a botanical term used to describe a flower’s ovary/gynoecium structure.","zh":"Bicarpellate 指“二心皮的”，是植物学中描述花的子房/雌蕊结构由两个心皮组成的术语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having two carpels (the female, seed-bearing units) in a flower’s ovary; made of two carpels.","zh":"（植物学）二心皮的；由两个心皮组成的（指花的子房/雌蕊结构）。"},"examples":[{"en":"Many flowers in this family have a bicarpellate ovary.","zh":"这个科的许多花都有二心皮的子房。"},{"en":"The species is described as having a bicarpellate gynoecium.","zh":"该物种被描述为具有二心皮的雌蕊群。"},{"en":"Under the microscope, the fruit develops from a bicarpellate structure.","zh":"在显微镜下可以看到，这种果实由二心皮结构发育而来。"}]}],"synonyms":["two-carpelled","dicarpellate"],"phonetic":"/ˌbaɪ.kɑrˈpɛl.eɪt/","extraExplanation":["“carpel（心皮）”是花的雌性生殖结构单位之一，通常构成子房，并与胚珠（将来形成种子）有关。“bicarpellate”强调“数量为两个”，常见于植物分类、形态学描述中。","词形来源：bi- = “二”；carpellate 来自 carpel（心皮）。相关对比：unicarpellate（单心皮）、tricarpellate（三心皮）、multicarpellate（多心皮）。"]}
{"word":"bicaudal","summary":{"en":"Bicaudal means “having two tails” (a technical biology/anatomy word).","zh":"bicaudal 指“有两条尾巴/双尾的”，多用于生物学或解剖学等技术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two tails or two tail-like parts (used especially in biology and anatomy).","zh":"（尤用于生物学与解剖学）有两条尾巴的；有两个尾状部分的。"},"examples":[{"en":"Some lizards can appear bicaudal after the tail splits during healing.","zh":"有些蜥蜴在断尾愈合后尾巴分叉，看起来像是“双尾的（bicaudal）”。"},{"en":"The researcher noted a bicaudal fin shape in the specimen.","zh":"研究人员记录到该标本的鳍呈“双尾状（bicaudal）”。"}]}],"synonyms":["two-tailed","bifurcated (tail)"],"phonetic":"/baɪˈkɔdəl/","extraExplanation":["“bicaudal”由前缀 bi-（二、双）+ caudal（尾部的；与尾有关的）构成，常见于学术写作（动物学、解剖学、古生物学等），日常口语中较少用。","相关词：caudal（尾部的）、bifurcated tail（分叉尾）、two-tailed（双尾的）。"]}
{"word":"bicaudate","summary":{"en":"“Bicaudate” means “two-tailed” or “having two tail-like parts,” usually in scientific descriptions.","zh":"bicaudate 指“双尾的”或“有两个尾状部分的”，多用于科学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two tails or tail-like projections; two-tailed.","zh":"有两条尾巴的；有两个尾状突起的（双尾的）。"},"examples":[{"en":"In some diagrams, the comet is shown as bicaudate, with two distinct tails.","zh":"在一些示意图里，这颗彗星被画成双尾的，有两条明显不同的尾巴。"},{"en":"The report described a bicaudate structure at the end of the specimen.","zh":"报告描述该标本末端有一个双尾状的结构。"}]}],"synonyms":["two-tailed","double-tailed"],"phonetic":"/ˌbaɪˈkɔːdeɪt/","extraExplanation":["词源：bi- 表示“双、二”，caudate 来自拉丁语 cauda（“尾巴”）。因此 bicaudate 字面意思就是“有两条尾巴的”。","这是一个偏学术/科技写作的词，常见于生物学、解剖学、植物学或形态学描述中；日常英语更常用 two-tailed 或 having two tails。"]}
{"word":"bicched","summary":{"en":"“Bicched” is not a standard spelling; it likely refers to “bitch/bitched,” which can mean an offensive insult, a female dog, or (as a verb) to complain.","zh":"“bicched”不是标准拼写；很可能指“bitch/bitched”，可作侮辱性骂人话、指母狗，或作动词表示“抱怨/发牢骚”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, offensive) A rude word for a woman; an insult.","zh":"（俚语，冒犯）对女性的粗鲁侮辱性称呼。"},"examples":[{"en":"He called her a bitch, which was disrespectful and hurtful.","zh":"他骂她“bitch”，这很不尊重也很伤人。"},{"en":"Please don’t use that word—it’s offensive.","zh":"请不要用这个词——它很冒犯。"}]},{"partOfSpeech":"n.","definition":{"en":"A female dog.","zh":"母狗。"},"examples":[{"en":"Our neighbor’s bitch had puppies last week.","zh":"我们邻居家的母狗上周生了小狗。"}]},{"partOfSpeech":"vi.","definition":{"en":"(slang) To complain angrily; to grumble.","zh":"（俚语）抱怨、发牢骚（常带怒气）。"},"examples":[{"en":"He kept bitching about the traffic all morning.","zh":"他一整个上午都在抱怨交通。"},{"en":"Instead of bitching, let’s find a solution.","zh":"别光抱怨了，我们找个解决办法吧。"}]}],"synonyms":["complain","grumble","whine"],"phonetic":"/bɪtʃ/","extraExplanation":["你输入的“bicched”很可能是“bitched”的拼写错误（bitch 的过去式/过去分词），例如：“He bitched about his job.”（他抱怨他的工作）。","“bitch”作为骂人话在很多场合属于强烈不礼貌用语；如果只是想表达“抱怨”，更安全的替代词是 complain / grumble。"]}
{"word":"Bice","summary":{"en":"Bice is an old term for a blue or green pigment used in painting.","zh":"Bice 是一个较旧的词，指绘画中使用的蓝色或绿色颜料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a blue or green pigment used in painting, especially in older artworks (often made from copper compounds).","zh":"（绘画用的）蓝色或绿色颜料；尤指旧时画作中常见、常由含铜化合物制成的颜料。"},"examples":[{"en":"The conservator found traces of green bice in the background of the painting.","zh":"修复师在画作背景里发现了绿色 bice 的残留。"},{"en":"In some Renaissance works, bice was used to create cool shadows and distant hills.","zh":"在一些文艺复兴时期的作品中，bice 用来表现冷调的阴影和远处的山丘。"}]}],"synonyms":["pigment","blue pigment","green pigment"],"phonetic":"/baɪs/","extraExplanation":["“bice”是艺术史与旧颜料名称中会出现的词，现代日常英语里很少用。它常指一种蓝或绿的颜料，历史上常与含铜的颜料来源相关。阅读博物馆说明、修复报告或艺术史书籍时更容易遇到。"]}
{"word":"bice","summary":{"en":"Bice is a historical blue or green artist’s pigment (and the color it makes).","zh":"Bice 指一种历史上常用于绘画的蓝色或绿色颜料，也可指这种颜色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a blue or green pigment (especially a historical copper-based pigment) used in painting; also the color made from it","zh":"（尤指历史上用于绘画的）蓝色或绿色颜料（常为含铜颜料）；也指这种颜料呈现的颜色"},"examples":[{"en":"The sky was painted with bice to create a bright, cool blue.","zh":"画家用 bice 来画天空，呈现明亮清冷的蓝色。"},{"en":"Conservators found traces of green bice in the background of the old panel painting.","zh":"修复人员在这幅古老的木板画背景处发现了绿色 bice 的痕迹。"}]},{"partOfSpeech":"adj.","definition":{"en":"having the blue/green color of bice","zh":"呈 bice 的蓝绿色的"},"examples":[{"en":"The artist chose a bice tone for the distant hills.","zh":"画家为远处的山选用了偏 bice 的色调。"}]}],"synonyms":["pigment","blue pigment","green pigment","verdigris (related, not identical)"],"phonetic":"/baɪs/","extraExplanation":["“bice”在英语里是较少见、偏艺术史/绘画材料领域的词，多出现在古画材料分析、颜料史或博物馆修复语境中。","传统上它常与含铜的蓝/绿颜料相关（例如某些蓝铜矿、孔雀石类颜料），不同地区与时期的配方和色相可能有差异，因此在文献里有时会见到“blue bice”“green bice”等说法。","日常英语里更常见的是具体颜色词（blue/green/turquoise/teal）或更明确的颜料名（ultramarine, cobalt blue, verdigris 等）。"]}
{"word":"bicellular","summary":{"en":"Bicellular describes something made of two cells or involving a two-cell stage.","zh":"bicellular 用来描述“由两个细胞构成的”或“处于两细胞阶段的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"made of or involving two cells","zh":"由两个细胞构成的；涉及两个细胞的"},"examples":[{"en":"A bicellular organism has two cells instead of just one.","zh":"双细胞生物由两个细胞组成，而不是只有一个细胞。"},{"en":"In this experiment, we observed a bicellular stage during early development.","zh":"在这个实验中，我们观察到早期发育的双细胞阶段。"}]}],"synonyms":["two-celled","two-cell"],"phonetic":"/baɪˈsɛljələr/","extraExplanation":["词源拆解：bi- 表示“二、双”，cellular 表示“细胞的”。合起来就是“两个细胞的”。","使用场景：这个词多见于生物学与发育生物学语境（如受精卵分裂后的“两细胞期”）。日常英语里更常用 two-celled 或 two-cell stage 来表达类似意思。"]}
{"word":"bicentenaries","summary":{"en":"“Bicentenaries” means multiple 200th anniversaries or 200-year commemorations.","zh":"“bicentenaries”指多个“两百周年纪念（两百年庆典）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the 200th anniversary (plural form)","zh":"两百周年纪念（日/年）（复数）"},"examples":[{"en":"Several museums held exhibitions for the city’s bicentenaries.","zh":"好几家博物馆为这座城市的两百周年纪念举办了展览。"},{"en":"The two bicentenaries were celebrated with concerts and public lectures.","zh":"这两个两百周年纪念以音乐会和公开讲座的形式庆祝。"}]}],"synonyms":["bicentennials","200th anniversaries","200-year anniversaries"],"phonetic":"/ˌbaɪsɛnˈtɛnəri/","extraExplanation":["“bicentenaries”是“bicentenary”的复数。美式英语里更常见的对应词是“bicentennial”（也表示两百周年纪念），例如“the bicentennial of the Declaration of Independence (1976)（《独立宣言》发表两百周年，1976年）”。在英式英语中，“bicentenary”也很常用。"]}
{"word":"bicentenarnaries","summary":{"en":"“Bicentenaries” means 200th anniversaries (events marking 200 years).","zh":"“bicentenaries”指“两百周年纪念”（纪念某事满200年）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of) bicentenary: a 200th anniversary or a celebration marking 200 years since an event.","zh":"（bicentenary 的复数）两百周年纪念；指某事件发生满200年的纪念日或庆祝活动。"},"examples":[{"en":"The city held concerts and exhibitions for its bicentenaries.","zh":"这座城市为它的两百周年纪念举办了音乐会和展览。"},{"en":"Many bicentenaries of famous writers are celebrated with special readings.","zh":"许多著名作家的两百周年纪念会用特别朗读会来庆祝。"}]}],"synonyms":["200th anniversaries","bicentennials","two-hundredth anniversaries"],"phonetic":"/ˌbaɪsenˈtɛnəri/","extraExplanation":["你输入的 **bicentenarnaries** 很可能是拼写错误，常见正确拼法是 **bicentenaries**（bicentenary 的复数）。","英式英语更常用 **bicentenary / bicentenaries**；美式英语更常用 **bicentennial / bicentennials**，意思基本相同，都指“200周年纪念”。"]}
{"word":"bicentenary","summary":{"en":"Bicentenary means the 200th anniversary of something, or the celebration of it (often UK usage; US: bicentennial).","zh":"Bicentenary 指某事的二百周年纪念，或相关庆祝活动（英式更常见；美式多用 bicentennial）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the 200th anniversary of an event; a celebration marking 200 years","zh":"（某事件的）二百周年纪念；二百周年庆典"},"examples":[{"en":"The university held a concert to celebrate its bicentenary.","zh":"这所大学举办音乐会庆祝其二百周年纪念。"},{"en":"A special exhibition was organized for the bicentenary of the composer’s birth.","zh":"为纪念这位作曲家诞生二百周年，举办了特别展览。"}]}],"synonyms":["bicentennial","200th anniversary"],"phonetic":"/ˌbaɪ.sɛnˈtɛn.ə.ri/","extraExplanation":["“bicentenary”在英式英语中更常见；美式英语里常用“bicentennial”。两者意思相同，都是“200周年纪念”。","构词法：bi-（两、二）+ centen-（百年）+ -ary（构成名词/形容词）。因此它字面意思就是“两个百年”。","文化提示：美国常说“the Bicentennial”来特指1976年美国独立200周年的全国性庆祝活动。"]}
{"word":"bicentennial","summary":{"en":"“Bicentennial” means a 200th anniversary, or an event/celebration marking 200 years.","zh":"“bicentennial”表示“两百周年纪念的”，也可作名词指“两百周年纪念日/纪念活动”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a 200th anniversary (the 200-year celebration or remembrance of an event).","zh":"与两百周年纪念有关的；两百周年的（指某事件发生200年后的纪念或庆祝）。"},"examples":[{"en":"The city held a bicentennial celebration to mark its founding 200 years ago.","zh":"这座城市举行了两百周年庆典，纪念其在200年前建立。"},{"en":"We visited a bicentennial exhibition about the nation’s early history.","zh":"我们参观了一个两百周年纪念展览，主题是这个国家的早期历史。"}]},{"partOfSpeech":"n.","definition":{"en":"A 200th anniversary celebration or event.","zh":"两百周年纪念（活动/庆典）；两百周年纪念日（语境中也可指纪念活动本身）。"},"examples":[{"en":"The bicentennial brought parades, concerts, and historical reenactments.","zh":"两百周年纪念活动带来了游行、音乐会和历史重演。"},{"en":"Many schools created special projects for the bicentennial.","zh":"许多学校为两百周年纪念制作了特别项目。"}]}],"synonyms":["200th anniversary","two-hundredth anniversary","commemoration","anniversary celebration"],"phonetic":"/ˌbaɪsɛnˈtɛn.i.əl/","extraExplanation":["“bicentennial”= bi-（二）+ centennial（百周年），因此指“200周年”。","在美国语境里常见搭配是“the Bicentennial”，多指美国独立战争相关纪念，尤其是美国建国200周年（1976年）。当你看到大写的 Bicentennial，往往是在指这一特定历史纪念。","常见相关词：centennial（100周年）、sesquicentennial（150周年，较正式）、tricentennial（300周年）。"]}
{"word":"bicentennial-themed","summary":{"en":"Bicentennial-themed describes something made to fit a 200th-anniversary celebration.","zh":"bicentennial-themed 指“以两百周年纪念为主题的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed or decorated to match a bicentennial celebration (the 200th anniversary of an event, such as a nation’s founding).","zh":"以“两百周年纪念”（某事件发生200周年，如建国200周年）为主题而设计或装饰的。"},"examples":[{"en":"The museum hosted a bicentennial-themed exhibition about the city’s founding.","zh":"博物馆举办了一个以城市建城两百周年为主题的展览。"},{"en":"They wore bicentennial-themed shirts with the dates printed on the front.","zh":"他们穿着两百周年纪念主题的T恤，正面印着纪念日期。"}]}],"synonyms":["bicentennial","anniversary-themed","commemorative","celebratory"],"phonetic":"/ˌbaɪsənˈtɛniəl ˈθimd/","extraExplanation":["“bicentennial”本身是“200周年纪念”的意思；“bicentennial-themed”是常见的英语复合形容词结构（名词/形容词 + themed），表示“以……为主题的”，通常用连字符连接，放在名词前作定语：a bicentennial-themed parade / a bicentennial-themed display。","在美国语境中，“the Bicentennial”常特指1976年美国独立200周年纪念，因此你可能会看到“bicentennial-themed”用来描述带有红白蓝配色、星条旗元素、1776–1976字样等风格的装饰、活动或商品。"]}
{"word":"bicentennially","summary":{"en":"“Bicentennially” means “every 200 years” or “in connection with a 200th anniversary.”","zh":"“bicentennially”表示“每两百年一次地”，也可表示“与二百周年纪念相关地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"every 200 years; in a way that happens once every 200 years","zh":"每两百年一次地；以两百年为周期地"},"examples":[{"en":"A rare comet is said to appear bicentennially.","zh":"据说有一种罕见的彗星每两百年出现一次。"},{"en":"The city reviews its long-term development plan bicentennially.","zh":"这座城市每两百年审视一次长期发展规划。"}]},{"partOfSpeech":"adv.","definition":{"en":"in a way connected to a 200th anniversary (a bicentennial celebration)","zh":"与二百周年纪念有关地（用于二百周年庆典等语境）"},"examples":[{"en":"The museum was bicentennially renovated for the university’s 200th anniversary.","zh":"为迎接大学二百周年纪念，博物馆进行了与二百周年相关的翻新。"},{"en":"They issued bicentennially themed stamps.","zh":"他们发行了二百周年主题的邮票。"}]}],"synonyms":["every 200 years","once every 200 years","for the bicentennial","bicentennial-themed"],"phonetic":"/ˌbaɪsɛnˈtɛniəli/","extraExplanation":["“bicentennially”来自“bicentennial（两百周年；每两百年一次的）”，其中 bi- 表示“二”，centennial 与 “century（世纪）”同源，和“百年”有关。","这个词在日常对话里不常用，更常见的表达是 “every 200 years” 或 “for the bicentennial / bicentennial-themed”。在历史纪念（如美国独立200周年）或机构成立200周年等正式场合更常见。"]}
{"word":"bicentennials","summary":{"en":"“Bicentennials” means 200th anniversaries or celebrations of them.","zh":"“bicentennials” 指多个“二百周年纪念（活动）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the 200th anniversaries of important events (for example, a country’s independence or a school’s founding)","zh":"（重要事件的）二百周年纪念；两百周年庆典（复数）"},"examples":[{"en":"Many towns held bicentennials to celebrate their founding dates.","zh":"许多城镇举行两百周年纪念活动来庆祝建镇纪念日。"},{"en":"The museum prepared special exhibits for several local bicentennials.","zh":"博物馆为几项当地的二百周年纪念活动准备了特别展览。"}]}],"synonyms":["200th anniversaries","200-year anniversaries","bicentennial celebrations"],"phonetic":"/ˌbaɪsɛnˈtɛniəlz/","extraExplanation":["在美国语境里，最常见的“bicentennial”指 1976 年美国独立二百周年（the U.S. Bicentennial）。当你说“the Bicentennial”，常常特指这一全国性庆典；而“bicentennials”（复数）通常是泛指多个不同事件的二百周年纪念。","词形提示：单数是 bicentennial；也可以作形容词，如 “a bicentennial celebration（两百周年庆典）”。"]}
{"word":"bicentral","summary":{"en":"Bicentral means “having two centers,” used in general descriptions (two main hubs) and in technical fields like graph theory.","zh":"Bicentral 指“有两个中心”，既可泛指两个主要枢纽，也常见于图论等技术领域。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two centers; organized around two main hubs or focal points.","zh":"双中心的；以两个主要中心/枢纽为核心组织的。"},"examples":[{"en":"The city has a bicentral layout, with downtown and the university district as the two main hubs.","zh":"这座城市呈双中心布局，市中心和大学区是两个主要枢纽。"},{"en":"Their company became bicentral after the merger, keeping headquarters in both New York and Chicago.","zh":"合并后他们的公司形成双中心结构，纽约和芝加哥都保留为总部。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Technical, especially mathematics/graph theory) Describing a structure that has two central points (for example, a graph whose “center” consists of two vertices).","zh":"（技术用语，尤指数学/图论）指具有两个中心点的结构（例如图的“中心”由两个顶点构成）。"},"examples":[{"en":"In graph theory, a path with an even number of vertices is bicentral because it has two middle vertices.","zh":"在图论中，顶点数为偶数的路径是双中心的，因为它有两个中间顶点。"},{"en":"The paper classifies certain trees as unicentral or bicentral based on the size of their centers.","zh":"论文根据中心的大小把某些树分类为单中心或双中心。"}]}],"synonyms":["two-centered","dual-centered","two-hub","dual-hub"],"phonetic":"/baɪˈsɛntrəl/","extraExplanation":["“bi-”表示“两个”，来自拉丁语；“central”表示“中心的”。合起来“bicentral”字面意思就是“有两个中心”。","在日常英语里更常见的说法是“with two centers”“two-centered”或直接说“two main hubs”。“bicentral”更偏书面或学术语境（如城市规划、组织结构、图论）。"]}
{"word":"bicentric","summary":{"en":"Bicentric means “having two centers,” often used to describe systems or structures with two main hubs.","zh":"bicentric 指“有两个中心”，常用于描述具有两个主要枢纽/核心的系统或结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two centers (for example, two main hubs of activity, influence, or control).","zh":"双中心的；有两个中心（例如有两个主要的活动、影响或控制枢纽）。"},"examples":[{"en":"The company adopted a bicentric structure, with major offices in New York and London.","zh":"这家公司采用了双中心结构，在纽约和伦敦都设有主要办公室。"},{"en":"Some researchers describe the world economy as bicentric rather than dominated by a single country.","zh":"一些研究者认为世界经济是双中心的，而不是由单一国家主导。"}]},{"partOfSpeech":"adj.","definition":{"en":"In anatomy/biology: having two central points or two centers of curvature.","zh":"（解剖/生物）有两个中心点的；双中心曲率的。"},"examples":[{"en":"The paper mentions bicentric growth patterns in the developing tissue.","zh":"论文提到发育组织中的双中心生长模式。"},{"en":"In optics, a lens may be described as bicentric if it has two centers of curvature.","zh":"在光学中，如果一个镜片有两个曲率中心，可能会被描述为双中心的。"}]}],"synonyms":["two-centered","dual-center","two-hub","bicephalous"],"phonetic":"/baɪˈsɛntrɪk/","extraExplanation":["“bicentric”由前缀 bi-（表示“两个”）+ centric（与“中心”有关）构成，常见于学术写作（如经济学、地理学、组织管理等）来描述“由两个核心共同主导/支撑”的格局。日常口语里更常用 two-centered 或 having two hubs。"]}
{"word":"bicentrically","summary":{"en":"Bicentrically means “with two main centers or hubs.”","zh":"bicentrically 意为“以双中心（两个主要中心/枢纽）的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a bicentric way; with two main centers or focal points (for example, two downtowns, hubs, or leadership centers).","zh":"以“双中心”的方式；具有两个主要中心或焦点（例如两个市中心、枢纽或权力中心）。"},"examples":[{"en":"The metropolitan area developed bicentrically, with one center around the historic downtown and another near the airport.","zh":"这个大都市区以双中心方式发展：一个中心在历史老城区，另一个在机场附近。"},{"en":"The company operates bicentrically, splitting key decisions between its New York and San Francisco offices.","zh":"这家公司以双中心方式运作，把关键决策分散在纽约和旧金山两个办公室。"}]}],"synonyms":["with two centers","dually centered","two-centered"],"phonetic":"/ˌbaɪˈsɛntrɪkli/","extraExplanation":["“bicentrically”来自“bi-（两个）+ centric（中心的）+ -ally（副词后缀）”。常见于城市规划（双核心城市/双中心都市圈）、经济地理（两个增长极）、组织管理（双总部/双核心治理）等语境。","相关概念：单中心（monocentric）通常指一个主中心；多中心（polycentric）指多个中心。写作中用“bicentrically”往往是在强调结构或发展模式的“两个主轴/两大核心”。"]}
{"word":"bicentricity","summary":{"en":"Bicentricity means having two main centers of importance, activity, or power.","zh":"Bicentricity 指“具有两个主要中心”的特征或状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of having two centers of activity, power, or importance (for example, in a city, region, or organization)","zh":"双中心性；具有两个活动、权力或重要性中心的状态或特征（如城市、地区或组织）"},"examples":[{"en":"The city’s bicentricity is visible in its historic downtown and its newer business district.","zh":"这座城市的双中心性体现在历史老城中心和新兴商务区两个核心上。"},{"en":"Bicentricity can reduce pressure on a single downtown by spreading jobs and services across two hubs.","zh":"双中心性可以通过把工作和服务分布到两个枢纽，减轻单一市中心的压力。"},{"en":"In the company, bicentricity emerged when both the New York and California offices began making key decisions.","zh":"在这家公司里，当纽约和加州办公室都开始做关键决策时，出现了“双中心性”。"}]}],"synonyms":["dual-centeredness","two-centered structure","bicephaly (in politics/organizations)"],"phonetic":"/ˌbaɪsɛnˈtrɪsəti/","extraExplanation":["这个词常见于城市地理与区域规划（如“bicentric city/urban structure”），也可用于政治与组织结构讨论（两个权力中心并存）。","常与“monocentricity（单中心性）”“polycentricity（多中心性）”对比使用：双中心性强调“两个”核心，而多中心性强调“多个”核心。","词源构成：bi-（二）+ center（中心）+ -icity（……的性质），因此语义相对直观，但在日常口语中不如“two centers / dual centers”常用。"]}
{"word":"bicep","summary":{"en":"Bicep means the large muscle at the front of the upper arm; in formal usage, people often say “biceps.”","zh":"bicep 指上臂前侧的肱二头肌；正式用法里更常说 biceps。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the large muscle on the front of your upper arm, between the shoulder and the elbow (often called the “biceps”)","zh":"肱二头肌：位于上臂前侧、肩与肘之间的一块大肌肉（常口语称“二头肌”）"},"examples":[{"en":"He flexed his biceps for the photo.","zh":"他为了拍照把二头肌绷起来。"},{"en":"Doing curls can help build your biceps.","zh":"做弯举可以帮助锻炼二头肌。"},{"en":"My biceps feel sore after yesterday’s workout.","zh":"我昨天锻炼后二头肌很酸。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the biceps muscle (used before a noun in medical or fitness contexts)","zh":"与肱二头肌有关的（多用于医学或健身语境，作定语）"},"examples":[{"en":"The doctor checked for bicep tendon pain.","zh":"医生检查是否有肱二头肌肌腱疼痛。"},{"en":"Try a bicep stretch after lifting weights.","zh":"举铁后试试做一个肱二头肌拉伸。"}]}],"synonyms":["biceps","upper-arm muscle"],"phonetic":"/ˈbaɪˌsɛp/","extraExplanation":["在正式解剖学里更常用复数形式 biceps（因为这块肌肉有两头：长头和短头）。日常口语里很多人说单数 bicep 或复数 biceps 都能理解，但写作或医学语境更偏好 biceps。","常见搭配：biceps curl（肱二头肌弯举）、biceps tendon（肱二头肌肌腱）、flex your biceps（绷/秀二头肌）、biceps brachii（肱二头肌的拉丁学名）。"]}
{"word":"bicephalic","summary":{"en":"Bicephalic means “two-headed,” literally or figuratively describing something with two main leaders/parts.","zh":"bicephalic 意为“双头的”，既可指字面上的两个头，也可引申为有两个主要领导/部分的结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two heads (literal) or having two main parts/leaders (figurative).","zh":"（字面）有两个头的；（引申）有两个主要部分/双重领导的。"},"examples":[{"en":"In mythology, a bicephalic creature often symbolizes dual power.","zh":"在神话中，双头生物常常象征双重力量。"},{"en":"The organization became bicephalic after the merger, with two co-CEOs.","zh":"合并后，这个组织变成了“双首制”，有两位联合首席执行官。"}]}],"synonyms":["two-headed","bicephalous","dual-headed"],"phonetic":"/ˌbaɪsəˈfælɪk/","extraExplanation":["词源：bi- 表示“二/双”，-cephalic 来自希腊语 kephalē（头）。因此 bicephalic 直译就是“双头的”。","使用场景：在生物学/医学中可描述“双头畸形”等现象；在政治、管理或组织结构里常用来形容“权力中心有两个”的格局（有时带有“容易分裂或决策不一致”的暗示）。","相关词：bicephalous（同义，较少见）；cephalic（头部的）；bicameral（两院制，注意不是“两个头”，但同样有 bi- 的“两个”概念）。"]}
{"word":"bicephalism","summary":{"en":"Bicephalism means the condition of having two heads.","zh":"bicephalism 指“有两个头”的状态，即双头畸形/双头现象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the condition of having two heads (especially in an animal or embryo); two-headedness.","zh":"双头畸形；双头现象（尤指动物或胚胎出现两个头）。"},"examples":[{"en":"Bicephalism is sometimes seen in snakes and turtles, though it is very rare.","zh":"双头畸形有时会出现在蛇和龟身上，但非常罕见。"},{"en":"The vet explained that the animal’s bicephalism likely happened during early development.","zh":"兽医解释说，这只动物的双头畸形很可能发生在早期发育阶段。"}]}],"synonyms":["two-headedness","dicephalism"],"phonetic":"/baɪˈsɛfəˌlɪzəm/","extraExplanation":["词源：来自拉丁/希腊词根 bi-（二、双）+ cephal-（头，见于 cephalic “头的”）。常用于生物学、胚胎学或医学语境。","与文学/文化中“多头怪物”的想象不同，bicephalism 通常指真实的先天发育异常，而不是象征性或神话性的“两个头”。"]}
{"word":"bicephalous","summary":{"en":"Bicephalous means “two-headed,” either literally or metaphorically (having two leaders/centers of power).","zh":"bicephalous 意为“双头的”，既可指字面上的两个头，也可引申为“两个领导/权力中心并存”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two heads (literally, in anatomy or mythology).","zh":"（字面义）有两个头的；双头的（用于解剖学或神话等语境）。"},"examples":[{"en":"The museum displayed a drawing of a bicephalous snake from an old natural history book.","zh":"博物馆展出了一幅旧博物志里关于双头蛇的图画。"},{"en":"In myths, a bicephalous creature often symbolizes divided power or dual nature.","zh":"在神话中，双头生物常象征分裂的权力或双重本性。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having two leaders, two centers of authority, or a “two-headed” structure (often used in politics or organizations).","zh":"（引申义）有两个领导者/权力中心的；“双头”结构的（常用于政治或组织架构）。"},"examples":[{"en":"The company’s bicephalous leadership made decision-making slow and confusing.","zh":"公司的“双头”领导让决策变得缓慢而混乱。"},{"en":"Historians described the empire as bicephalous, split between two capitals.","zh":"历史学家形容该帝国是“双中心”的，由两座都城分治。"}]}],"synonyms":["two-headed","dual-headed","bicentral","dual leadership"],"phonetic":"/baɪˈsɛfələs/","extraExplanation":["词源：来自拉丁语 bi-（“两个”）+ cephal-（“头”，源自希腊语 kephalē）+ -ous（形容词后缀）。因此字面意思就是“两个头的”。","用法提示：该词较书面、偏学术或评论性，日常口语中更常说 two-headed 或 having two leaders。"]}
{"word":"bicephaly","summary":{"en":"Bicephaly means the rare condition of having two heads.","zh":"bicephaly 指“有两个头”的罕见畸形/状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the condition of having two heads (usually describing a fetus, newborn, or animal)","zh":"双头畸形；有两个头的情况（多用于描述胎儿、新生儿或动物）"},"examples":[{"en":"The report described a rare case of bicephaly in a newborn calf.","zh":"报告描述了一例罕见的新生小牛双头畸形。"},{"en":"Scientists documented bicephaly in a snake and studied how it moved and ate.","zh":"科学家记录了一条双头蛇，并研究它如何移动和进食。"}]}],"synonyms":["two-headedness","dicephaly"],"phonetic":"/baɪˈsɛfəli/","extraExplanation":["该词常见于医学与动物学语境，属于较正式、较少见的术语。构词上 bi- 表示“双”，-cephaly 来自希腊语 kephalē（头）。","在新闻或科普中也可能见到与之相近的说法 two-headed（双头的），但 bicephaly 更偏向描述“这种畸形/状态”本身。"]}
{"word":"biceps","summary":{"en":"The biceps is the front upper-arm muscle used for bending the elbow and showing arm strength.","zh":"biceps 指上臂前侧的肱二头肌，主要用于屈肘，也常被视为臂力象征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large muscle on the front of the upper arm that helps bend the elbow and turn the forearm; often associated with arm strength","zh":"肱二头肌（上臂前侧的大块肌肉，帮助屈肘并旋转前臂；常与臂力相关）"},"examples":[{"en":"He flexed his biceps to show how strong he was.","zh":"他弯曲肱二头肌来展示自己有多强壮。"},{"en":"Biceps workouts often include curls with dumbbells.","zh":"锻炼肱二头肌通常会包括哑铃弯举。"},{"en":"She strained her biceps while lifting a heavy box.","zh":"她在搬重箱子时拉伤了肱二头肌。"}]}],"synonyms":["upper-arm muscle","biceps muscle"],"phonetic":"/ˈbaɪ.seps/","extraExplanation":["“biceps”来自拉丁语，字面意思是“两个头”（bi- = 二；-ceps 与“头”相关），因为这块肌肉有两条肌腹/起点，常说“二头”。","日常口语里常用复数形式“biceps”（像“abs”一样），即使指一侧的一块肌肉也常这么说。更正式也可说“the biceps muscle”。","相关词：triceps（三头肌，上臂后侧，负责伸肘）；biceps curl（肱二头肌弯举/弯举动作）。"]}
{"word":"biceps-related","summary":{"en":"“Biceps-related” means related to the biceps muscle in the upper arm.","zh":"“biceps-related”表示与上臂的肱二头肌有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with or involving the biceps (the muscle on the front of the upper arm).","zh":"与肱二头肌（上臂前侧的肌肉）有关的；涉及肱二头肌的。"},"examples":[{"en":"The doctor ordered an exam for biceps-related pain after the lifting injury.","zh":"在举重受伤后，医生安排检查与肱二头肌相关的疼痛。"},{"en":"These exercises help prevent biceps-related strains.","zh":"这些训练有助于预防肱二头肌相关的拉伤。"},{"en":"He avoided biceps-related movements while his arm healed.","zh":"手臂恢复期间，他避免做与肱二头肌相关的动作。"}]}],"synonyms":["biceps-associated","biceps-specific","upper-arm (biceps)"],"phonetic":"/ˈbaɪˌsɛps rɪˈleɪtɪd/","extraExplanation":["“biceps-related”是由名词“biceps（肱二头肌）”+“related（相关的）”组成的复合形容词，常用连字符表示它一起修饰后面的名词（如：biceps-related injury/pain）。在更正式或学术写作中，也常见“biceps-related”与“biceps related”两种写法，但加连字符更清晰。","日常表达里，人们也常直接说“a biceps injury / biceps pain”，比“biceps-related …”更口语、更简洁。"]}
{"word":"bicepses","summary":{"en":"“Bicepses” means more than one biceps (upper-arm muscles).","zh":"“bicepses”表示多个肱二头肌（上臂前侧肌肉）的复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural form of “biceps,” referring to the two-headed muscles on the front of the upper arms (often talked about in fitness).","zh":"“biceps（肱二头肌）”的复数形式，指上臂前侧的两头肌肉（健身语境中常被提到）。"},"examples":[{"en":"His bicepses looked bigger after months of training.","zh":"经过几个月训练，他的肱二头肌看起来更大了。"},{"en":"She flexed her bicepses to show her strength.","zh":"她弯曲手臂、绷紧肱二头肌来展示力量。"}]}],"synonyms":["biceps (plural form is often the same)","upper-arm muscles"],"phonetic":"/ˈbaɪsɛpsɪz/","extraExplanation":["“biceps”的复数在英语里常见两种：更常用的是 biceps（单复数同形），也可以说 bicepses（更强调“多个/两侧的肱二头肌”时有人会用）。两种都能被理解，但在日常与健身语境中 biceps 更普遍。"]}
{"word":"bices","summary":{"en":"“Bices” is the plural of “bice,” meaning a blue or green pigment (or that color) used in painting, especially in older artworks.","zh":"“bices”是“bice”的复数，指绘画中使用的青蓝/青绿色颜料，或这种颜色，多见于较旧的艺术作品语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a blue or green mineral pigment (and the color made from it), used especially in painting (often in older art).","zh":"（绘画用的）青蓝/青绿色矿物颜料；也指这种颜色（多见于旧时绘画语境）。"},"examples":[{"en":"The painter used bice to create a soft blue-green background.","zh":"画家用 bice 来调出柔和的青蓝绿色背景。"},{"en":"In some old manuscripts, areas of bice have faded over time.","zh":"在一些古老手稿里，bice 颜料的部分随着时间褪色了。"}]}],"synonyms":["blue pigment","green pigment","mineral pigment"],"phonetic":"/baɪs/","extraExplanation":["“bices”通常是名词“bice”的复数形式，表示多处/多种这种颜料或颜色。","词源上与法语/意大利语中表示“灰蓝色/青蓝色”的词有关；在艺术史或颜料说明里更常见，日常英语里不太常用。","不要与“bikes”（自行车的复数）混淆：bice /baɪs/，bike /baɪk/，拼写和含义都不同。"]}
{"word":"bicetyl","summary":{"en":"“Bicetyl” is a rare chemistry term meaning “with two cetyl (C16) groups,” and it’s not common in modern everyday English.","zh":"“Bicetyl”是一个较罕见的化学用语，指“含有两个鲸蜡基（C16）基团”，在现代日常英语中并不常见。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Rare, chemistry) Having or containing two cetyl groups (cetyl = a 16‑carbon alkyl group commonly found in fatty alcohols and waxes).","zh":"（罕见，化学）含有或带有两个“鲸蜡基/十六烷基”（cetyl，常见于脂肪醇与蜡类中的16碳烷基）基团的。"},"examples":[{"en":"In some older chemical naming, a “bicetyl” compound was described as having two cetyl chains.","zh":"在一些较旧的化学命名中，“bicetyl”化合物被描述为带有两条鲸蜡基链。"},{"en":"This term is uncommon today; modern labels usually specify the exact structure instead of saying “bicetyl.”","zh":"这个词在今天不常用；现代标注通常会直接写明具体结构，而不是用“bicetyl”。"}]}],"synonyms":["dicetyl","bis(cetyl)"],"phonetic":"/baɪˈsiːtəl/","extraExplanation":["“bicetyl”不是现代英语里的常见词，更多可能出现在旧的化学资料、配方笔记，或作为产品/原料的非标准写法。","如果你是在成分表、药品名或某篇文章里看到它，建议你把原句或上下文发我；它也有可能是拼写误差（例如与“cetyl / dicetyl”等相关词混淆）。"]}
{"word":"Bichat","summary":{"en":"Bichat is mainly a proper name in medicine: Xavier Bichat, a key figure in early tissue-based anatomy, and it appears in eponyms like “Bichat’s fat pad.”","zh":"Bichat 主要作为医学中的专有名词：指法国解剖学家比夏，以及出现在“比夏脂肪垫”等以人名命名的医学术语中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) Xavier Bichat (1771–1802), a French anatomist and physiologist, often called a founder of modern histology (the study of tissues).","zh":"（专有名词）比夏（Xavier Bichat，1771–1802），法国解剖学家与生理学家，常被称为现代组织学（研究人体组织）的奠基人物之一。"},"examples":[{"en":"In many medical history courses, Bichat is remembered for describing the body in terms of different tissues.","zh":"在许多医学史课程中，人们记得比夏提出用“不同组织”来理解人体。"},{"en":"The professor mentioned Bichat when introducing early ideas about how organs are built from tissues.","zh":"教授在介绍“器官由组织构成”的早期观点时提到了比夏。"}]},{"partOfSpeech":"n.","definition":{"en":"(Medical eponym) Used in names of anatomical/medical terms connected to his work, such as “Bichat’s fat pad” (the buccal fat pad in the cheek).","zh":"（医学人名用语）用于与其相关的解剖/医学术语名称中，如 “Bichat’s fat pad”（比夏脂肪垫，即面颊部的颊脂肪垫）。"},"examples":[{"en":"The surgeon explained the role of Bichat’s fat pad in facial anatomy.","zh":"外科医生解释了比夏脂肪垫在面部解剖中的作用。"},{"en":"Some textbooks label the buccal fat pad as Bichat’s fat pad.","zh":"一些教材把颊脂肪垫标注为比夏脂肪垫。"}]}],"synonyms":["Xavier Bichat"],"phonetic":"/biːˈʃɑː/","extraExplanation":["“Bichat”在英文中通常不是普通词汇，而是医学/生物学语境里的“人名”。常见搭配是带所有格的结构：Bichat’s + 名词（如 Bichat’s fat pad）。","拼写提示：Bichat 末尾的 t 在英语里通常不单独发出很重的 /t/ 爆破，整体读音更接近“bee-SHAH”。"]}
{"word":"Biche-la-mar","summary":{"en":"Biche-la-mar is a historical name for Bislama (Vanuatu’s English-based creole), originally linked to the Pacific sea-cucumber trade.","zh":"Biche-la-mar 是比斯拉马语（瓦努阿图英语系克里奥尔语）的历史旧称，最初与太平洋的海参贸易有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) An older name for Bislama, an English-based pidgin/creole language spoken in Vanuatu.","zh":"（历史用法）比斯拉马语（Bislama）的旧称；一种以英语为基础、在瓦努阿图使用的皮钦语/克里奥尔语。"},"examples":[{"en":"In 19th‑century accounts, Bislama was often called Biche-la-mar.","zh":"在19世纪的记载中，比斯拉马语常被称为 Biche-la-mar。"},{"en":"Some older books describe plantation workers communicating in “Biche-la-mar.”","zh":"一些较旧的书籍会写到种植园工人用“Biche-la-mar”交流。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) A trade term connected to the sea-cucumber trade; used loosely to refer to “sea cucumber” or the trade itself.","zh":"（少见）与海参贸易有关的旧贸易用语；有时被宽泛地用来指“海参”或相关贸易。"},"examples":[{"en":"The word shows up in writings about the early Pacific “sea cucumber” trade.","zh":"这个词会出现在早期太平洋“海参”贸易的相关文字中。"}]}],"synonyms":["Bislama","Beach-la-mar","Bichelamar"],"phonetic":"/ˌbiːtʃ lə ˈmɑr/","extraExplanation":["“Biche-la-mar / Beach‑la‑mar”常被认为来自法语 bêche‑de‑mer（意为“海参”，字面可理解为“海里的铲子/挖掘物”）。19世纪太平洋地区因海参贸易与劳工流动，这个词被用来指一种通用的“码头/种植园通用语”，后来在瓦努阿图发展为今天的 Bislama。","拼写差异很多（如 Beach-la-mar, Bichelamar 等），多出现在早期英语旅行记、殖民文献或语言学史料中。现代正式用法通常写 Bislama。"]}
{"word":"Bichelamar","summary":{"en":"Bichelamar is an older name for a South Pacific pidgin, especially the one that became modern Bislama in Vanuatu.","zh":"Bichelamar 是南太平洋皮钦语的旧称，尤指后来发展为瓦努阿图现代比斯拉马语（Bislama）的那一种。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A name once used for a Melanesian English‑based pidgin in the South Pacific, especially the variety that later developed into modern Bislama (Vanuatu).","zh":"（历史用法）南太平洋美拉尼西亚地区一种以英语为基础的皮钦语的旧称，尤指后来发展为瓦努阿图现代比斯拉马语（Bislama）的那一支。"},"examples":[{"en":"In some older travel books, Bichelamar is mentioned as the trade language in Vanuatu.","zh":"在一些较早的旅行书里，Bichelamar 被提到是瓦努阿图的贸易通用语。"},{"en":"Today people usually say Bislama, not Bichelamar.","zh":"如今人们通常说 Bislama，而不是 Bichelamar。"}]}],"synonyms":["Bislama","Beach-la-mar","Melanesian Pidgin"],"phonetic":"/ˌbiːtʃ lə ˈmɑːr/","extraExplanation":["“Bichelamar”也常见拼写为“Beach-la-mar / Beach‑la‑mar”。这个名称与法语“bêche‑de‑mer”（海参）有关：19世纪从事海参贸易与海上劳工流动的背景下，形成了跨族群交流用的皮钦语，因此语言名称带有当时贸易词汇的影子。","在现代语言学与日常使用中，更常用的名称是“Bislama”（瓦努阿图官方语言之一）；相关但不同的近亲还有巴布亚新几内亚的 Tok Pisin、所罗门群岛的 Pijin。"]}
{"word":"bichir","summary":{"en":"Bichir is mainly used as a surname (a family name), not a common English vocabulary word.","zh":"Bichir主要用作姓氏（人名），并非常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A surname (family name), especially known from Mexican actor Demián Bichir and his family (the Bichir brothers).","zh":"姓氏（家族名）；常因墨西哥演员德米安·比契尔（Demián Bichir）及其家族而为人所知。"},"examples":[{"en":"Demián Bichir starred in several international films.","zh":"德米安·比契尔出演过多部国际电影。"},{"en":"I recognized the name Bichir from the movie credits.","zh":"我在电影字幕里认出了“Bichir”这个名字。"}]}],"synonyms":["(as a surname) family name","last name"],"phonetic":"/biˈtʃɪr/","extraExplanation":["“Bichir”通常作为专有名词（人名/姓氏）使用，并不是常见英语词汇。","如果你是想查英文单词，可能是拼错了：常见相近词有 bicker（争吵、拌嘴）、butcher（屠夫；屠宰）。你可以告诉我你想表达的意思或给我一个句子，我可以帮你确认正确拼写。"]}
{"word":"bichir-like","summary":{"en":"“Bichir-like” means “resembling a bichir fish,” especially long, primitive-looking, and somewhat armored in appearance.","zh":"“bichir-like”表示“像多鳍鱼（bichir）一样的”，常指细长、外形偏原始、略像披甲的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a bichir (a long, primitive-looking freshwater fish), especially in shape or appearance.","zh":"像多鳍鱼（bichir，一种细长、外形很“原始”的淡水鱼）的；尤指外形或轮廓相似。"},"examples":[{"en":"The creature in the concept art has a bichir-like body—long and armored-looking.","zh":"这张概念图里的生物有一种“多鳍鱼般”的身体——细长，而且看起来像有甲壳。"},{"en":"In the aquarium, a bichir-like fish often moves slowly along the bottom.","zh":"在水族箱里，外形像多鳍鱼的鱼常常慢慢贴着底部游动。"}]}],"synonyms":["bichir-shaped","bichir-esque","eel-like (approx.)"],"phonetic":"/ˈbɪʃɚ laɪk/","extraExplanation":["“bichir”常指产于非洲的多鳍鱼（如 Senegal bichir）。在英文里把名词加上 -like 变成形容词，表示“像……一样”，写作“bichir-like”通常用于科普、观赏鱼、水族、影视/游戏设定等语境。","发音提示：bichir 常读作 /ˈbɪʃɚ/（听起来像“bish-er”）。"]}
{"word":"bichirs","summary":{"en":"Bichirs are African freshwater fish (Polypterus); “bichirs” is the plural form.","zh":"bichirs 是 bichir 的复数，指非洲的淡水多鳍鱼（Polypterus）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of bichir: a type of long, primitive-looking freshwater fish from Africa (genus Polypterus), often kept in aquariums.","zh":"bichir 的复数：一种产自非洲的淡水鱼（多鳍鱼属 Polypterus），外形细长、很“原始”，也常被当作观赏鱼饲养。"},"examples":[{"en":"Bichirs can breathe air, so they sometimes swim up to the surface.","zh":"多鳍鱼可以呼吸空气，所以它们有时会游到水面。"},{"en":"The store keeps bichirs in covered tanks because they can jump.","zh":"那家店把多鳍鱼养在有盖的鱼缸里，因为它们会跳缸。"},{"en":"Some bichirs grow large, so a small aquarium may not be enough.","zh":"有些多鳍鱼会长得很大，所以小鱼缸可能不够用。"}]}],"synonyms":["Polypterus (scientific name)","African bichir"],"phonetic":"/ˈbɪʃɚz/","extraExplanation":["“bichirs”在日常英语里不算高频词，更多出现在水族圈、自然纪录片或动物学语境中。","多鳍鱼常被介绍为“活化石”一类的鱼：身体像鳗但有明显的背鳍小鳍片，且能用鳔辅助呼吸空气，因此需要注意水面空间与防跳缸。"]}
{"word":"bichloride","summary":{"en":"“Bichloride” is an older term for a compound with two chlorines, often referring specifically to mercuric chloride (HgCl₂).","zh":"“bichloride”是较旧的说法，指含两个氯的化合物；也常特指氯化汞(II)（HgCl₂，升汞）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound containing two chlorine atoms (or two chloride ions) per molecule or formula unit","zh":"（化学）二氯化物：分子或化学式中含有两个氯原子（或两个氯离子）的化合物"},"examples":[{"en":"In older chemistry texts, “bichloride” often means a compound with two chlorines.","zh":"在较旧的化学教材里，“bichloride”常指含有两个氯的化合物。"},{"en":"Bichlorides are usually named more precisely today (for example, “mercury(II) chloride”).","zh":"如今二氯化物通常会更精确地命名（例如“氯化汞(II)”）。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in older usage) mercuric chloride, HgCl₂, a highly poisonous compound once used as a disinfectant; also called “bichloride of mercury”","zh":"（尤指旧用法）氯化汞(II)（HgCl₂）：一种剧毒化合物，过去曾用作消毒剂；也称“bichloride of mercury（升汞）”"},"examples":[{"en":"The label warned that the bichloride of mercury solution was toxic.","zh":"标签警告说氯化汞(II)溶液有毒。"},{"en":"Some historical documents mention bichloride tablets used for disinfecting water.","zh":"一些历史资料提到曾用升汞片来给水消毒。"}]}],"synonyms":["mercury(II) chloride","mercuric chloride","HgCl2","dichloride"],"phonetic":"/baɪˈklɔːraɪd/","extraExplanation":["“bi-”在旧式化学命名中常表示“两个/二价”，因此“bichloride”常对应现代更规范的命名方式：用氧化态来写，如 mercury(II) chloride（氯化汞(II)）。","“bichloride of mercury（升汞）”在19—20世纪早期常见于医疗与公共卫生语境，但因剧毒与安全风险，如今一般不再作为常规消毒剂使用。"]}
{"word":"bichlorides","summary":{"en":"“Bichlorides” is the plural of “bichloride,” an older term for compounds with two chlorines—often specifically mercuric chloride (HgCl₂).","zh":"“Bichlorides”是“bichloride”的复数，旧称指含两个氯的化合物，常特指氯化汞（HgCl₂）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of bichloride: a chemical compound containing two chlorine atoms (or two chloride ions) per molecule; in older usage, especially mercuric chloride (HgCl₂).","zh":"bichloride 的复数：指每个分子含两个氯原子（或两个氯离子）的化合物；在较旧的用法中尤其指“氯化汞（HgCl₂）”。"},"examples":[{"en":"Older medical texts sometimes mention bichlorides as disinfectants, especially mercuric chloride.","zh":"一些较旧的医学文献会提到 bichlorides 作为消毒剂，尤其指氯化汞。"},{"en":"The label warned that bichlorides are highly toxic and must be handled with care.","zh":"标签警告 bichlorides 毒性很强，必须小心处理。"}]}],"synonyms":["mercuric chloride(s)","mercury(II) chloride","HgCl2"],"phonetic":"/baɪˈklɔːraɪdz/","extraExplanation":["“bichloride”属于旧式命名（b- 表示“二/双”，类似于旧称“bicarbonate”）。现代化学命名更常用“mercuric chloride（氯化汞）/ mercury(II) chloride”或直接写出化学式 HgCl₂。","历史上“bichloride of mercury（氯化汞）”曾用于消毒和防腐，但毒性极高；在现代语境中通常出现在历史资料、旧配方或文献引用里。"]}
{"word":"bichon","summary":{"en":"A bichon is a small fluffy companion dog, especially the Bichon Frisé.","zh":"bichon 指一种小型蓬松的伴侣犬，尤其是比熊弗里泽（比熊犬）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small dog breed with a fluffy white coat, usually kept as a companion pet (often referring to the Bichon Frisé).","zh":"比熊犬（一种小型伴侣犬品种，常指“比熊弗里泽”，毛发蓬松、通常为白色）。"},"examples":[{"en":"My aunt has a bichon that loves sitting on her lap.","zh":"我阿姨养了一只比熊犬，很喜欢坐在她腿上。"},{"en":"The bichon needs regular grooming to keep its coat clean and fluffy.","zh":"比熊犬需要定期美容护理，才能让毛发保持干净蓬松。"}]}],"synonyms":["Bichon Frisé","toy dog (general category)","companion dog (general category)"],"phonetic":"/ˈbiːʃɑːn/","extraExplanation":["“Bichon”来自法语，常见完整名称是 **Bichon Frisé**（意为“卷毛比熊”）。在日常英语里，人们有时会把它简化说成 *a bichon*。","作为宠物文化的一部分，比熊犬在欧美常被认为是“伴侣犬”（companion dog）：体型小、亲人、适合室内生活，但毛发护理需求较高。"]}
{"word":"bichord","summary":{"en":"A bichord is a two-note chord (two pitches sounded together).","zh":"bichord 指“二音和弦”，即两个音同时发声形成的和声。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chord made of two different pitches played together; a two-note chord (also called a dyad).","zh":"由两个不同音高同时发声构成的和弦；二音和弦（也可称为 dyad）。"},"examples":[{"en":"The piece opens with a stark bichord in the left hand.","zh":"这首曲子一开始左手就用一个冷峻的二音和弦。"},{"en":"Composers may use bichords to create a bare, open sound.","zh":"作曲家可能用二音和弦来营造朴素、空旷的音响。"}]}],"synonyms":["dyad","two-note chord","interval"],"phonetic":"/ˈbaɪkɔrd/","extraExplanation":["“bichord”由前缀 bi-（“二、双”）+ chord（“和弦”）构成，在音乐理论或分析写作中偶尔出现。更常见的说法是 “two-note chord” 或 “dyad”。它既可以指任何两个音的同时发声，也常用于强调这种和声比三和弦更“简约/空”——例如只用纯五度（C–G）会听起来更开放。"]}
{"word":"bichos","summary":{"en":"“Bichos” is Spanish for “bugs/critters” (plural of “bicho”), often referring to small insects or little creatures in a casual way.","zh":"“bichos”是西语“bicho”的复数，常指“虫子/小爬虫”，也可口语泛指“小生物、小家伙”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish, plural of bicho) bugs; small insects or creepy-crawlies.","zh":"（西语，bicho 的复数）虫子；小昆虫；（口语）爬来爬去的小东西。"},"examples":[{"en":"There are bichos in the kitchen—let’s clean up the food crumbs.","zh":"厨房里有 bichos——我们把食物碎屑清理掉吧。"},{"en":"In the countryside, you see lots of bichos at night around the lights.","zh":"在乡下，晚上灯附近会看到很多 bichos。"}]},{"partOfSpeech":"n.","definition":{"en":"(Spanish, informal) little creatures/critters; sometimes any small animal in a general, casual way.","zh":"（西语，非正式）小动物、小生物；泛指“那些小家伙”。"},"examples":[{"en":"The kids were looking under rocks for bichos.","zh":"孩子们在石头下面找小生物。"},{"en":"I’m not afraid of animals, but those tiny bichos freak me out.","zh":"我不怕动物，但那些小小的家伙让我起鸡皮疙瘩。"}]}],"synonyms":["bugs","insects","critters","creepy-crawlies"],"phonetic":"/ˈbitʃoʊs/","extraExplanation":["“bichos”是西语复数形式；单数是“bicho”。在不同地区语感不完全一样：很多地方主要指“虫子/小爬虫”，也可泛指“小生物”。","注意文化差异：在少数地区的俚语里，“bicho”可能有粗俗的性暗示用法（不适合正式场合）。如果不确定语境，最好用更中性的词，如“insectos（昆虫）”或“animales pequeños（小动物）”。"]}
{"word":"bichromate","summary":{"en":"Bichromate is a chemical compound containing the dichromate ion, commonly used as a strong oxidizing agent.","zh":"bichromate 指含重铬酸根的化合物，常作为强氧化剂使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound containing the dichromate ion (Cr2O7^2−), often used as a strong oxidizing agent (for example, potassium dichromate).","zh":"含有重铬酸根离子（Cr2O7^2−）的化合物，常用作强氧化剂（如重铬酸钾）。"},"examples":[{"en":"Potassium bichromate is often used in chemistry labs as an oxidizing agent.","zh":"重铬酸钾常在化学实验室中用作氧化剂。"},{"en":"Bichromate solutions can be hazardous, so wear gloves and eye protection.","zh":"重铬酸盐溶液可能有危险，因此要戴手套并做好护目镜防护。"}]}],"synonyms":["dichromate","potassium dichromate (common example)","chromium(VI) dichromate (context)"],"phonetic":"/baɪˈkroʊmeɪt/","extraExplanation":["“bichromate”和“dichromate”在现代化学里通常指同一类物质（都与Cr2O7^2−有关），“bi-”是较早的命名习惯；如今更常见、也更规范的说法是“dichromate”。","重铬酸盐多为强氧化剂，且不少铬（VI）化合物具有毒性与致癌风险；在学习或接触相关内容时，应特别留意安全与环境法规。"]}
{"word":"bichromated","summary":{"en":"“Bichromated” means treated with a dichromate (bichromate) chemical, often in photo/printing or industrial processes.","zh":"“bichromated”指“经重铬酸盐处理的”，常见于摄影/印刷及某些工业工艺。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"treated with a bichromate/dichromate chemical (often potassium dichromate), especially for hardening, coloring, or making something light-sensitive in industrial or photographic processes","zh":"用重铬酸盐（常见为重铬酸钾）处理过的；常用于硬化、着色或使材料对光敏感（多见于工业或摄影/印刷工艺）"},"examples":[{"en":"The bichromated gelatin becomes harder where it is exposed to light.","zh":"重铬酸盐处理过的明胶在受光照的地方会变得更硬。"},{"en":"Wear gloves when handling bichromated solutions.","zh":"处理含重铬酸盐的溶液时要戴手套。"}]},{"partOfSpeech":"v.","definition":{"en":"past form of “bichromate”: to treat (a material) with a bichromate/dichromate chemical","zh":"动词 bichromate 的过去式/过去分词：用重铬酸盐处理（某种材料）"},"examples":[{"en":"The paper was bichromated and then dried before printing.","zh":"纸张先用重铬酸盐处理，然后晾干再进行印刷。"}]}],"synonyms":["dichromate-treated","chromated (related)","chemically treated"],"phonetic":"/baɪˈkroʊmeɪtɪd/","extraExplanation":["“bichromated”多见于老式摄影与工艺美术/印刷语境，如“bichromated gelatin（重铬酸盐明胶）”，与碳转印（carbon print）、铂钯印相（platinum/palladium printing）等工艺相关。","现代化学里更常用“dichromate（重铬酸盐）”来命名；历史上“bichromate”是旧称。","重铬酸盐具有毒性且可能致敏，实际工作中通常需要良好通风与防护（手套、护目等）。"]}
{"word":"bichromatic","summary":{"en":"Bichromatic means having two colors, or (in science) involving two wavelengths of light.","zh":"bichromatic 指“双色的”，也可在科学语境中指“涉及两种波长的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Using or involving two colors; having two distinct colors.","zh":"双色的；由两种颜色组成的。"},"examples":[{"en":"The flag has a simple bichromatic design in blue and white.","zh":"这面旗帜是简单的蓝白双色设计。"},{"en":"She chose a bichromatic outfit to keep her look clean and modern.","zh":"她选择了双色穿搭，让整体看起来干净又现代。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Science) Involving two wavelengths (two bands of light), often used in imaging or optics.","zh":"（科学）双波长的；涉及两种波长（两段光谱）的，常用于成像或光学。"},"examples":[{"en":"The microscope uses bichromatic illumination to improve contrast.","zh":"这台显微镜使用双波长照明来提高对比度。"},{"en":"Bichromatic filters can separate an image into two wavelength ranges.","zh":"双波长滤光片可以把图像分成两个波段范围。"}]}],"synonyms":["two-color","two-toned","bicolor","dual-color"],"phonetic":"/ˌbaɪkroʊˈmætɪk/","extraExplanation":["词源提示：bi- 表示“二、双”，chromatic 来自 chroma（颜色）。因此 bichromatic 字面意思就是“两个颜色/两种波长的”。","使用场景：日常语境里常见于设计、服装、图案（two-color）；在科研语境里更常指“两种波长/两段光谱”。注意它比常见的 two-color 更正式一些。"]}
{"word":"bichromatize","summary":{"en":"Bichromatize means to make something two-colored, or (in chemistry) to treat it with a dichromate/bichromate compound.","zh":"bichromatize 指使某物呈双色效果，或（化学）用重铬酸盐对材料/溶液进行处理。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something bichromatic (having two colors) or to give it a two-color effect.","zh":"使某物呈现双色的；把某物处理成两种颜色的效果。"},"examples":[{"en":"The designer bichromatized the poster by printing the image in black and red.","zh":"设计师用黑色和红色印刷，使海报呈现双色效果。"},{"en":"Some early printing methods bichromatized images to increase contrast.","zh":"一些早期印刷方法会把图像处理成双色，以增强对比度。"}]},{"partOfSpeech":"vt.","definition":{"en":"to treat a material with a bichromate (dichromate) compound, especially in chemical processing.","zh":"（化学）用重铬酸盐处理某材料；使其发生与重铬酸盐相关的反应或变化。"},"examples":[{"en":"In older workshop notes, leather was sometimes bichromatized to change its surface properties.","zh":"在一些较旧的工坊记录中，皮革有时会用重铬酸盐处理，以改变其表面性质。"},{"en":"The lab manual warns that if you bichromatize the solution, you must handle waste carefully.","zh":"实验手册警告：若用重铬酸盐处理该溶液，必须谨慎处置废液。"}]}],"synonyms":["make bichromatic","make two-toned","dichromatize","treat with dichromate","treat with bichromate"],"phonetic":"/baɪˈkroʊməˌtaɪz/","extraExplanation":["“bichromatize”属于非常少见的词，更多场合会看到更常用的表达，比如：\n- “make it bichromatic / two-toned”（把它做成双色）\n- “treat with dichromate / bichromate”（用重铬酸盐处理）\n在现代英语里，这个词多出现在旧的技术文献、化学/工艺笔记或特定行业写作中。","“bichromate / dichromate（重铬酸盐）”在历史上用于某些染色、鞣制、摄影与工业氧化工艺，但许多相关化学品具有毒性和环境风险；现实场景中若涉及操作，应遵循安全规范与法规。"]}
{"word":"bichrome","summary":{"en":"Bichrome means “two-colored,” and it can also refer to an artwork or print made using two colors.","zh":"bichrome 表示“双色的”，也可指用两种颜色制作的作品或印刷品。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having two colors; made using two colors","zh":"双色的；由两种颜色构成/印制的"},"examples":[{"en":"The flag has a simple bichrome design: blue and white.","zh":"这面旗帜是简单的双色设计：蓝色和白色。"},{"en":"She chose a bichrome palette to keep the poster clean and readable.","zh":"她选择了双色配色，让海报更简洁易读。"}]},{"partOfSpeech":"n.","definition":{"en":"a picture or print made in two colors (especially in photography or printmaking)","zh":"双色作品；双色印刷品/照片（尤指摄影或版画中的两色作品）"},"examples":[{"en":"The exhibition includes several bichromes from early photographic processes.","zh":"展览中包括几幅来自早期摄影工艺的双色作品。"},{"en":"He collected a bichrome print in black and sepia tones.","zh":"他收藏了一张黑色与棕褐色调的双色版画。"}]}],"synonyms":["two-tone","two-colored","bicolor","dual-tone"],"phonetic":"/ˈbaɪˌkroʊm/","extraExplanation":["词源：bi- 表示“二、两种”，-chrome 来自希腊语 chroma（颜色）。所以 bichrome 字面意思就是“二色”。","使用场景：在设计里常指“双色配色/双色印刷”；在摄影史里也可指两色调的影像或特定工艺产生的双色效果。"]}
{"word":"bichromic","summary":{"en":"Bichromic means “two-colored” or “using two colors,” especially in design, printing, or technical contexts.","zh":"Bichromic 指“双色的/使用两种颜色的”，常用于设计、印刷或技术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having or using two colors; made of two different colors (often in design, printing, optics, or materials)","zh":"双色的；由两种颜色组成或使用两种颜色的（常见于设计、印刷、光学或材料领域）"},"examples":[{"en":"The poster uses a bichromic palette—black and yellow—for strong contrast.","zh":"这张海报使用黑黄双色配色，以形成强烈对比。"},{"en":"Some safety signs are intentionally bichromic so they are easy to read from far away.","zh":"一些安全标志刻意采用双色设计，便于远距离辨认。"},{"en":"The artist created a bichromic print using only blue and white ink.","zh":"这位艺术家只用蓝色和白色墨水做了一幅双色版画。"}]}],"synonyms":["two-tone","two-colored","bicolor","dual-colored"],"phonetic":"/baɪˈkroʊmɪk/","extraExplanation":["词源上，bi- 表示“两”，chrom/chrome 来自希腊语 khroma，表示“颜色”。因此 bichromic 直观含义就是“二色的”。","在专业语境里，它常和 optics（光学）、printing（印刷）、palette（配色）等词搭配；日常英语中更常见的近义表达是 two-tone / two-colored。"]}
{"word":"bichy","summary":{"en":"“Bitchy” describes someone or something that sounds mean, sharp, and unpleasantly critical.","zh":"“bitchy”用来形容说话或态度尖酸刻薄、语气冲、带攻击性的样子。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Usually of a person or comment) mean, rude, or unkind in a sharp, criticizing way; unpleasantly snappy.","zh":"（多指人或言论）刻薄的、尖酸的、爱怼人的；语气冲、让人不舒服的。"},"examples":[{"en":"She made a bitchy remark about his clothes.","zh":"她对他的穿着说了一句很刻薄的话。"},{"en":"I’m sorry—I was being bitchy because I was stressed.","zh":"对不起——我刚才态度很冲，是因为压力太大了。"},{"en":"The reviews sounded bitchy instead of helpful.","zh":"那些评价听起来更像是在怼人，而不是在帮忙。"}]}],"synonyms":["mean","rude","snippy","catty","spiteful"],"phonetic":"/ˈbɪtʃi/","extraExplanation":["“bichy”通常是拼写错误，正确拼法是 **bitchy**。","这个词带有较强的贬义和攻击性，有时也带性别色彩；在正式场合或不熟的人面前最好避免使用。更中性的替代说法有：**mean**, **rude**, **snippy**, **catty**（更偏“尖刻/爱挖苦”）。"]}
{"word":"biciliate","summary":{"en":"Biciliate means “having two cilia,” mainly used in biology.","zh":"Biciliate 指“具有两根纤毛的”，主要用于生物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) having two cilia (tiny hair-like structures) or two ciliated parts.","zh":"（生物）具有两根纤毛（微小的毛状结构）的；或有两个具纤毛的部分的。"},"examples":[{"en":"Some microscopic organisms are described as biciliate because they have two cilia used for movement.","zh":"一些微小生物被描述为 biciliate，因为它们有两根用来运动的纤毛。"},{"en":"The larva is biciliate in its early stage, then develops more cilia later.","zh":"该幼体在早期阶段是 biciliate（两纤毛的），之后会长出更多纤毛。"}]}],"synonyms":["two-ciliated","having two cilia"],"phonetic":"/baɪˈsɪli.eɪt/","extraExplanation":["前缀 bi- 表示“二、双”；ciliate 与 cilia（纤毛）相关。这个词主要出现在动物学、微生物学等学术语境，日常英语里很少用。","cilium（单数）/ cilia（复数）指细胞表面的微小毛状结构，可用于运动或把液体/颗粒向某个方向推动。"]}
{"word":"biciliated","summary":{"en":"Biciliated means “having two cilia,” used mainly in biology.","zh":"biciliated 指“具有两根纤毛的”，主要用于生物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) Having two cilia (tiny hair-like structures) on a cell or organism.","zh":"（生物）具“双纤毛的”；带有两根纤毛（细胞或微生物表面的细小毛状结构）。"},"examples":[{"en":"Under the microscope, the protist appeared biciliated, with two cilia beating like oars.","zh":"在显微镜下，这种原生生物呈双纤毛状，两根纤毛像桨一样摆动。"},{"en":"The researcher described the larva as biciliated at this stage of development.","zh":"研究人员描述这种幼体在这一发育阶段为双纤毛的。"}]}],"synonyms":["biciliate","two-ciliated","ciliated (general)"],"phonetic":"/ˌbaɪˈsɪliˌeɪtɪd/","extraExplanation":["“biciliated”属于较少见的生物学形态学用词：bi- 表示“两”，ciliated 表示“有纤毛的”。常见于显微结构描述、分类学或发育阶段记录中。","如果你是在论文/报告里看到它，有时也会写作 “biciliate / biciliated”（不同作者或期刊的用字习惯略有差异），意思基本相同。"]}
{"word":"bicipital","summary":{"en":"Bicipital means “related to the biceps muscle (upper arm).”","zh":"bicipital 指“与肱二头肌（上臂肌肉）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the biceps (the large muscle at the front of the upper arm).","zh":"与肱二头肌有关的；肱二头肌的。"},"examples":[{"en":"The doctor checked for tenderness in the bicipital groove.","zh":"医生检查了肱二头肌沟是否有压痛。"},{"en":"He felt pain near the bicipital tendon after lifting a heavy box.","zh":"他在抬起重箱子后感到肱二头肌肌腱附近疼痛。"}]}],"synonyms":["biceps-related","brachial (context-dependent)"],"phonetic":"ˌbaɪˈsɪpɪtəl","extraExplanation":["“bicipital”是医学/解剖学里较正式的形容词，来自拉丁语词根：bi-（二）+ caput（头），表示“二头的”。日常英语更常说“biceps”或“biceps-related”。常见搭配有：bicipital tendon（肱二头肌肌腱）、bicipital groove（肱二头肌沟）。"]}
{"word":"bicipitous","summary":{"en":"Bicipitous means “two-headed,” especially in anatomy, and can also mean “related to the biceps.”","zh":"bicipitous 意为“双头的”（多用于解剖学），也可指“与肱二头肌有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two heads (especially in anatomy or biology).","zh":"（尤指解剖学/生物学中）有两个“头”的；双头的。"},"examples":[{"en":"The biceps muscle is bicipitous, with a long head and a short head.","zh":"肱二头肌是双头肌，有长头和短头。"},{"en":"Some textbooks describe a bicipitous tendon in this region.","zh":"一些教材会把这个部位的肌腱描述为双头的。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the biceps (the muscle with two heads in the upper arm).","zh":"与肱二头肌有关的；肱二头肌的。"},"examples":[{"en":"He felt pain in the bicipitous area after lifting weights.","zh":"他举重后在肱二头肌相关区域感到疼痛。"},{"en":"The doctor checked the bicipitous reflex.","zh":"医生检查了肱二头肌反射。"}]}],"synonyms":["two-headed","bicipital","bicapsular (rare, context-dependent)"],"phonetic":"/baɪˈsɪpɪtəs/","extraExplanation":["“bicipitous”比较少见，更多时候你会看到“biceps”（肱二头肌）或“two-headed”（双头的）。","词源上来自拉丁语：bi-（二）+ caput（头），所以字面意思就是“有两个头”。在解剖学里，“head”常指肌肉起点的不同部分，而不是真的“头”。"]}
{"word":"bicircular","summary":{"en":"Bicircular means having or relating to two circles, often used in technical or geometric contexts.","zh":"Bicircular 指“由两个圆构成的/与两个圆有关的”，多用于技术或几何语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having two circles; shaped like or involving two circular parts","zh":"双圆的；由两个圆构成的；涉及两个圆形部分的"},"examples":[{"en":"The logo uses a bicircular design with two overlapping rings.","zh":"这个标志采用双圆设计，由两个重叠的圆环组成。"},{"en":"Engineers tested a bicircular arch to spread the weight more evenly.","zh":"工程师测试了一种双圆拱，以更均匀地分散重量。"}]},{"partOfSpeech":"adj.","definition":{"en":"(mathematics/geometry) related to a curve or construction defined by two circles","zh":"（数学/几何）与由两个圆定义的曲线或构造有关的"},"examples":[{"en":"In the diagram, the bicircular curve is generated from two fixed circles.","zh":"在图中，这条双圆曲线由两个固定圆生成。"},{"en":"We used a bicircular construction to locate the intersection points.","zh":"我们用双圆构造法来确定交点。"}]}],"synonyms":["two-circle","double-ring","two-circled"],"phonetic":"/ˌbaɪˈsɝːkjələr/","extraExplanation":["“bicircular”由前缀 bi-（表示“二、双”）+ circular（圆形的）组成，常见于几何、建筑与工程语境中。日常英语里更常说“two circles / double-ring / two circular parts”，而“bicircular”偏书面或专业用语。"]}
{"word":"bicirrose","summary":{"en":"Cirrhosis is long-term liver scarring that seriously reduces liver function.","zh":"Cirrhosis（肝硬化）是肝脏长期瘢痕化，导致肝功能严重下降。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely misspelling of) **cirrhosis**: a serious, long-term disease in which the liver becomes badly scarred and cannot work well.","zh":"（可能是拼写错误，原词为）**cirrhosis（肝硬化）**：一种严重的慢性疾病，肝脏出现大量瘢痕（纤维化），导致肝功能逐渐下降。"},"examples":[{"en":"He was diagnosed with cirrhosis after years of heavy drinking.","zh":"多年酗酒后，他被诊断为肝硬化。"},{"en":"Cirrhosis can make people feel tired and weak.","zh":"肝硬化会让人感到疲劳、无力。"},{"en":"Doctors monitor cirrhosis with blood tests and imaging scans.","zh":"医生会通过血液检查和影像扫描来监测肝硬化。"}]}],"synonyms":["liver scarring","hepatic cirrhosis"],"phonetic":"/səˈroʊsɪs/","extraExplanation":["你输入的 **bicirrose** 在英语里不常见，最接近的常用医学词是 **cirrhosis（肝硬化）**。如果你想表达的是“胆汁性肝硬化”，英语常说 **biliary cirrhosis** 或更具体的 **primary biliary cholangitis (PBC)**（旧称 *primary biliary cirrhosis*）。如果你告诉我你看到这个词的句子/语境，我可以帮你确认准确拼写和含义。"]}
{"word":"Bick","summary":{"en":"“bick” is a rare word meaning “to bicker” or “a petty argument.” In most cases, use the common form “bicker.”","zh":"“bick”较罕见，意思接近“bicker（拌嘴、争吵）”或“口角”。多数情况下更建议用常见拼写“bicker”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(rare) To argue or quarrel in a small, petty way; to bicker.","zh":"（罕见）为小事争吵、拌嘴；相当于 bicker。"},"examples":[{"en":"The siblings kept bicking over who should wash the dishes.","zh":"兄弟姐妹为谁该洗碗一直拌嘴。"},{"en":"They bicked for a few minutes, then calmed down.","zh":"他们拌嘴了几分钟，后来就冷静了。"}]},{"partOfSpeech":"n.","definition":{"en":"A short, petty argument; a bicker.","zh":"（罕见）小争执、口角；相当于 bicker。"},"examples":[{"en":"It was just a small bick, not a serious fight.","zh":"那只是小口角，不是严重争吵。"}]}],"synonyms":["bicker","quarrel","argue","squabble"],"phonetic":"/bɪk/","extraExplanation":["“bick”在现代英语里非常不常见，很多时候是把更常用的“bicker（拌嘴、争吵）”简写或拼写成了“bick”。正式写作建议用“bicker /ˈbɪkɚ/”。","如果你想表达的是常见品牌“BIC”（圆珠笔、打火机等），标准写法是大写“BIC”，发音通常同“bic /bɪk/”。你可以告诉我你的上下文句子，我可以帮你判断到底是哪一个。"]}
{"word":"bick","summary":{"en":"“Bick” is a rare dialect word meaning “beak” or “to peck.” In modern English, people usually mean “bicker.”","zh":"“bick”是很少见的方言词，可指“鸟喙”或“啄”。现代英语里更多人其实想表达的是“bicker（拌嘴/争吵）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Dialect, rare) A beak, especially a large or prominent one.","zh":"（方言/罕用）鸟喙；尤指很大或很突出的嘴。"},"examples":[{"en":"The old story describes the crow’s bick as sharp and black.","zh":"老故事里形容乌鸦的喙又尖又黑。"}]},{"partOfSpeech":"v.","definition":{"en":"(Dialect, rare) To peck with the beak; to nip or pick at something repeatedly.","zh":"（方言/罕用）用喙啄；反复轻咬或啄弄。"},"examples":[{"en":"The hens bicked at the grain on the ground.","zh":"母鸡在地上啄食谷粒。"}]}],"synonyms":["beak","peck","nip"],"phonetic":"/bɪk/","extraExplanation":["“bick”在现代标准英语中非常少见，多数学习与考试场景几乎不会用到。你更常见到的是 **bicker**（争吵、拌嘴）。如果你是在课文/字幕里看到“bick”，也可能是人名、地名或拼写误差。","如果你想查的是 **bicker**：它通常指“为小事争吵、拌嘴”，语气比“argue”更偏日常、琐碎。你可以回复我句子上下文，我也能帮你确认具体含义。"]}
{"word":"Bickart","summary":{"en":"Bickart is mainly used as a surname (last name) in English.","zh":"Bickart 主要作为英语中的姓氏（人名）使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A family name (surname). It is not a common everyday English vocabulary word; it’s usually used as a person’s last name or as part of a company/brand name.","zh":"一个姓氏（家族姓）。它不是常见的英语词汇，通常用作人的姓，或出现在公司/品牌名称中。"},"examples":[{"en":"Professor Bickart will lead today’s seminar.","zh":"Bickart 教授将主持今天的研讨课。"},{"en":"I emailed Ms. Bickart to ask about the schedule.","zh":"我给 Bickart 女士发邮件询问日程安排。"}]}],"phonetic":"/ˈbɪkɑrt/","extraExplanation":["“Bickart”通常被当作专有名词（姓氏）使用，所以一般不翻译含义，也不用于构成常规的句子成分（不像普通名词、动词那样有词义可解释）。如果你是在某本书、论文引用或公司名称里看到它，通常只需要按原样拼写，并根据语境判断是人名还是机构名。"]}
{"word":"bicker","summary":{"en":"“Bicker” means to argue in a small, petty way, often repeatedly about unimportant things; it can be a verb or a noun.","zh":"“bicker”指为小事反复争吵、拌嘴；既可作动词也可作名词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to argue in a small, often repeated way, usually about unimportant things","zh":"（为小事）争吵；拌嘴（常反复发生）"},"examples":[{"en":"The siblings bicker about who gets the front seat.","zh":"兄弟姐妹为谁坐前排而拌嘴。"},{"en":"They were bickering over something trivial, like which movie to watch.","zh":"他们为了很小的事拌嘴，比如看哪部电影。"}]},{"partOfSpeech":"n.","definition":{"en":"a small, petty argument; frequent complaining back and forth","zh":"小争吵；口角（来回抱怨式的争执）"},"examples":[{"en":"Their constant bickering made the meeting hard to finish.","zh":"他们不断的口角让会议很难结束。"},{"en":"There’s been a lot of bickering in the team lately.","zh":"这个团队最近口角很多。"}]}],"synonyms":["quarrel","squabble","argue","fight","wrangle"],"phonetic":"/ˈbɪkɚ/","extraExplanation":["“bicker”通常带有“为小事吵、吵个没完”的语感，比“argue”更轻一些，但也更让人烦，常用于家人、情侣、同事之间的日常拌嘴。","常见搭配：bicker about/over sth（为某事拌嘴）；constant/endless bickering（没完没了的争吵）。","文学/写作中常用来描写关系中的“磨合与摩擦”，比如“他们一路上不断拌嘴，但其实彼此在乎”。"]}
{"word":"bickered","summary":{"en":"Bickered means “argued in a petty or impatient way,” usually about something small.","zh":"bickered 表示“为小事不耐烦地拌嘴/争吵”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Past tense of bicker) to argue in a noisy, petty, or impatient way, often about small things.","zh":"（bicker 的过去式）为小事吵嘴、拌嘴；带点不耐烦地争吵。"},"examples":[{"en":"They bickered about who should do the dishes.","zh":"他们为了谁该洗碗而拌嘴。"},{"en":"The siblings bickered all the way to school.","zh":"兄弟姐妹一路上到学校都在吵嘴。"},{"en":"We bickered for a minute, then apologized and moved on.","zh":"我们拌了几句嘴，随后道歉就翻篇了。"}]}],"synonyms":["argued","quarreled","squabbled","fought","wrangled"],"phonetic":"/ˈbɪkɚd/","extraExplanation":["“bicker”通常指“为小事、短暂地争吵/斗嘴”，语气比“argue”更偏“琐碎、孩子气或不太严重”。在写作里常用来描写亲近的人（伴侣、家人、同事）之间的小摩擦。"]}
{"word":"bickerer","summary":{"en":"A bickerer is someone who frequently argues about small, unimportant things.","zh":"bickerer 指经常为小事拌嘴争吵的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who often argues about small, unimportant things; someone who bickers","zh":"（常为小事）争吵的人；爱拌嘴的人"},"examples":[{"en":"He’s a constant bickerer who turns simple decisions into arguments.","zh":"他老爱拌嘴，常把简单的决定变成争吵。"},{"en":"In group projects, a bickerer can slow everyone down.","zh":"在小组项目中，爱争吵的人会拖慢大家的进度。"},{"en":"She isn’t a bickerer—she disagrees calmly and respectfully.","zh":"她不是那种爱争吵的人——她会冷静、尊重地表达不同意见。"}]}],"synonyms":["quarreler","arguer","squabbler"],"phonetic":"/ˈbɪkərər/","extraExplanation":["“bickerer”来自动词“bicker”（拌嘴、为小事争吵）+ 表示“……的人”的后缀“-er”。语气通常偏负面，暗示争论琐碎、反复。"]}
{"word":"bickerers","summary":{"en":"“Bickerers” means people who often argue over small, unimportant things.","zh":"“bickerers”指经常为小事争吵、拌嘴的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who argue about small, unimportant things (plural of “bickerer”).","zh":"为小事争吵的人；爱拌嘴的人（“bickerer”的复数）。"},"examples":[{"en":"The meeting was delayed because the bickerers kept interrupting each other.","zh":"会议被耽搁了，因为那些爱拌嘴的人不停互相打断。"},{"en":"In every group project, there seem to be a few bickerers who focus on minor details.","zh":"每次小组作业里，似乎总有几个人爱为小细节争来争去。"}]}],"synonyms":["quarrelers","squabblers","arguers","nitpickers"],"phonetic":"/ˈbɪkərərz/","extraExplanation":["“bickerers”来自动词“bicker”（拌嘴、为小事争吵）。在“bicker”后加“-er”表示“做某事的人”（bickerer），再加“-s”变成复数（bickerers）。","语气通常带一点负面或不耐烦，强调“争吵的内容很琐碎”，比“arguers”（争论者）更偏向“吵吵闹闹、没完没了”。"]}
{"word":"bickering","summary":{"en":"“Bickering” means petty, ongoing arguing—often about small things.","zh":"“bickering”指围绕小事的、持续不断的拌嘴或争吵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"petty, repeated arguing, often about small or unimportant things","zh":"（多指小事的）争吵，口角；拌嘴"},"examples":[{"en":"Their bickering over who should wash the dishes lasted all evening.","zh":"他们为了谁去洗碗拌嘴，持续了一整晚。"},{"en":"The meeting was unproductive because of constant bickering.","zh":"会议因为不断的争吵而毫无成果。"}]},{"partOfSpeech":"v.","definition":{"en":"arguing in an ongoing, petty way","zh":"（就小事）不停争吵，拌嘴"},"examples":[{"en":"The two siblings were bickering in the back seat.","zh":"两个兄弟姐妹在后座不停拌嘴。"},{"en":"Stop bickering and focus on the problem.","zh":"别再争了，把注意力放在问题上。"}]}],"synonyms":["petty arguing","squabbling","quarreling","wrangling"],"phonetic":"/ˈbɪkərɪŋ/","extraExplanation":["“bicker”通常指“为小事反复争吵”，语气比“argue”更偏向“琐碎、幼稚、没完没了”的口角。名词 bickering 常用来概括一种“持续的吵吵闹闹”。","常见搭配：constant/endless bickering（没完没了的争吵）；bickering over/about sth（为某事争吵）。"]}
{"word":"bickeringly","summary":{"en":"“Bickeringly” means “in a petty, quarrelsome way.”","zh":"“bickeringly”表示“以为小事拌嘴、争吵的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that involves petty, repeated arguing (often about small or unimportant things).","zh":"以（为小事）反复争吵、拌嘴的方式。"},"examples":[{"en":"They spoke bickeringly over who should wash the dishes.","zh":"他们为谁该洗碗而拌嘴不休。"},{"en":"The siblings answered each other bickeringly during the car ride.","zh":"兄弟姐妹在车上一路你一句我一句地吵嘴。"}]}],"synonyms":["quarrelsomely","contentiously","pettily","snappily"],"phonetic":"/ˈbɪkərɪŋli/","extraExplanation":["“bickeringly”是由动词/名词“bicker”（拌嘴、争吵）加副词后缀“-ly”构成的副词，但在日常英语里并不常用。更常见的表达是：in a bickering way / while bickering，或直接用形容词描述语气：They were bickering.","“bicker”通常指“琐碎、孩子气、反复的争吵”，语气比“argue”更偏向“不太严重但很烦人”的口角。"]}
{"word":"bickern","summary":{"en":"Bicker means to argue about small things, or the small argument itself.","zh":"bicker 指为小事拌嘴，也可指这种小口角。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to argue in an irritated way about small or unimportant things (often repeatedly)","zh":"（常指反复地）为小事争吵、拌嘴"},"examples":[{"en":"The kids were bickering over whose turn it was to use the tablet.","zh":"孩子们为谁该轮到用平板而拌嘴。"},{"en":"They bickered about money, but they still cared about each other.","zh":"他们为钱的事争吵，但彼此仍然在乎对方。"}]},{"partOfSpeech":"n.","definition":{"en":"a short, petty argument; a quarrel over something minor","zh":"（为小事的）口角；拌嘴"},"examples":[{"en":"Their bickering stopped when the meeting began.","zh":"会议开始后，他们的口角就停了。"},{"en":"It was just a bicker, not a serious fight.","zh":"那只是拌嘴，不是严重的争吵。"}]}],"synonyms":["quarrel","squabble","bicker (with)","nitpick (about)"],"phonetic":"/ˈbɪkər/","extraExplanation":["你输入的 **bickern** 很可能是拼写误差；常见单词是 **bicker**。英语里 **bicker** 通常指“为小事吵来吵去”，比 **argue** 更强调“琐碎、烦人、反复”的感觉。"]}
{"word":"bickers","summary":{"en":"“Bickers” means petty, often repeated arguing; it can also mean small quarrels (plural noun).","zh":"“bickers”表示为小事反复拌嘴；也可作复数名词，指小争吵。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to argue in a small, petty, or irritated way (often about unimportant things)","zh":"（常指为小事）拌嘴；口角；吵吵嚷嚷"},"examples":[{"en":"The siblings bickers over who gets the front seat.","zh":"兄弟姐妹为谁坐副驾驶而拌嘴。"},{"en":"They bickers about money, but they still care about each other.","zh":"他们会为钱吵嘴，但彼此仍然在乎。"},{"en":"Stop bickers and focus on the plan.","zh":"别再拌嘴了，专注于计划。"}]},{"partOfSpeech":"n.","definition":{"en":"small arguments or quarrels (plural noun use)","zh":"小争吵；口角（复数名词用法）"},"examples":[{"en":"Their daily bickers made the office tense.","zh":"他们每天的小争吵让办公室气氛紧张。"},{"en":"I’m tired of all these bickers.","zh":"我厌倦了这些口角。"}]}],"synonyms":["squabble","quarrel","bicker","wrangle","argue"],"phonetic":"/ˈbɪkər/","extraExplanation":["“bicker”通常语气比“argue/争论”更轻一点，但带有“烦人、反复、为小事吵”的感觉；常见搭配：bicker about/over (something)。","形式上，“bickers”既可能是动词第三人称单数（He/She bickers），也可能是名词复数（many bickers）。"]}
{"word":"bickiron","summary":{"en":"“Bicker” means to argue over small things; “bickering” is the repeated petty arguing.","zh":"“bicker”表示为小事拌嘴、争吵；“bickering”指反复发生的口角。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Usually of people) to argue in an angry, petty, or teasing way, often about small things.","zh":"（通常指人）为小事争吵、拌嘴（常带有恼怒、琐碎或互相挖苦的感觉）。"},"examples":[{"en":"The kids were bickering over who gets the front seat.","zh":"孩子们为谁坐前排座位在拌嘴。"},{"en":"They bicker a lot, but they still care about each other.","zh":"他们经常斗嘴，但还是在乎彼此。"}]},{"partOfSpeech":"n.","definition":{"en":"A petty argument; a small, often repeated quarrel.","zh":"口角；小争吵（通常是琐碎、反复发生的争执）。"},"examples":[{"en":"Their bickering made it hard to finish the meeting.","zh":"他们的争吵让会议很难进行下去。"}]}],"synonyms":["squabble","quarrel","argue"],"phonetic":"/ˈbɪkɚ/","extraExplanation":["“bickiron”不是常见的英语单词，可能是拼写错误。你可能想写的是 bicker（动词/名词：拌嘴、口角）或 bickering（名词/形容词用法：不断的争吵，如 “bickering couple” 经常拌嘴的夫妻）。","语气提示：bicker 通常指“为小事吵、斗嘴”，比 argue 更强调琐碎和反复；如果是更严重、更激烈的冲突，常用 fight、quarrel。"]}
{"word":"Bickleton","summary":{"en":"Bickleton is a town name in Washington State, USA.","zh":"Bickleton是美国华盛顿州的一个小镇名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small town in Klickitat County, Washington, USA (a place name).","zh":"（美国地名）比克尔顿：美国华盛顿州克利基塔特县的一个小镇。"},"examples":[{"en":"We drove through Bickleton on our way to Goldendale.","zh":"我们去戈尔登代尔的路上开车经过了比克尔顿。"},{"en":"Bickleton is known for its quiet rural scenery.","zh":"比克尔顿以安静的乡村景色闻名。"}]}],"phonetic":"/ˈbɪkəlˌtən/","extraExplanation":["“Bickleton”是专有名词（地名），通常不翻译，只做音译或直接写作Bickleton。","读音常见为重音在第一个音节：BICK-le-ton。","它位于华盛顿州南中部的乡村地区，常被用来指代当地社区、学校活动或周边农牧业生活。"]}
{"word":"Bickmore","summary":{"en":"Bickmore is usually a proper noun: a surname, and sometimes a U.S. leather-care brand name.","zh":"Bickmore 通常是专有名词：一个姓氏；有时也指美国的皮革护理品牌名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname (family name).","zh":"一个姓氏（家族姓）。"},"examples":[{"en":"Carrie Bickmore is a well-known TV presenter in Australia.","zh":"Carrie Bickmore 是澳大利亚知名的电视主持人。"},{"en":"Dr. Bickmore will see you now.","zh":"Bickmore 医生现在要见你。"}]},{"partOfSpeech":"other","definition":{"en":"a brand name, especially for leather-care products in the U.S. (used like a proper noun).","zh":"一个品牌名，在美国常指皮革护理产品（作为专有名词使用）。"},"examples":[{"en":"I used Bickmore to condition my leather boots.","zh":"我用 Bickmore 来保养我的皮靴。"},{"en":"Do you sell Bickmore leather conditioner here?","zh":"你们这儿卖 Bickmore 皮革护理剂吗？"}]}],"synonyms":["(surname) family name","(brand) leather conditioner"],"phonetic":"/ˈbɪkˌmɔr/","extraExplanation":["“Bickmore”通常不是普通英语词汇，而是专有名词（姓氏或品牌名）。在英文里，专有名词一般首字母大写；用作称呼时可接在头衔后（如 Mr./Ms./Dr. Bickmore）。"]}
{"word":"Bicknell","summary":{"en":"Bicknell is most commonly a surname, and it can also be a U.S. place name.","zh":"Bicknell 最常见是英文姓氏，也可作美国地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), used as a last name for people","zh":"比克内尔（姓氏），用作人的英文姓"},"examples":[{"en":"Dr. Bicknell will see you at 3 p.m.","zh":"比克内尔医生会在下午三点见你。"},{"en":"My teacher’s last name is Bicknell.","zh":"我老师的姓是比克内尔。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name in the U.S. (for example, Bicknell, Indiana), used as a town or locality name","zh":"比克内尔（美国地名，如印第安纳州的 Bicknell），用作城镇或地区名称"},"examples":[{"en":"She grew up in Bicknell, Indiana.","zh":"她在印第安纳州的比克内尔长大。"},{"en":"We passed through Bicknell on our road trip.","zh":"我们公路旅行时路过了比克内尔。"}]}],"phonetic":"/ˈbɪknəl/","extraExplanation":["Bicknell 通常是源自英国的姓氏（English surname）。在英语里，这类专有名词一般首字母大写；作为称呼时常加上头衔，如 Mr./Ms./Dr. Bicknell。","发音要点：重音在第一个音节 BICK-nell；末尾 -nell 的 /əl/ 比较轻、短。"]}
{"word":"biclavate","summary":{"en":"Biclavate means “club-shaped at both ends,” used mainly in scientific descriptions.","zh":"biclavate 指“两端呈棒状（膨大）”，主要用于科学形态描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(In biology, especially botany/mycology) club-shaped at both ends; thickened toward both ends and narrower in the middle.","zh":"（生物学用语，尤指植物学/真菌学）两端呈棒状（膨大），中间较细；“双棒状”的。"},"examples":[{"en":"Under the microscope, the spore looked biclavate—swollen at both ends and slimmer in the middle.","zh":"在显微镜下，这个孢子看起来是双棒状的——两端膨大，中间较细。"},{"en":"The paper describes a biclavate structure on the surface of the seed.","zh":"论文描述了种子表面存在一种双棒状结构。"}]}],"synonyms":["club-shaped at both ends","doubly clavate","clavate (related)"],"phonetic":"/baɪˈkleɪveɪt/","extraExplanation":["这是一个比较少见的专业形态学词汇，常见于植物学、真菌学或无脊椎动物形态描述中，用来精确说明“形状”。\n词源上可拆为 bi-（两、双）+ clavate（棒状、棍状）。写作时常与显微结构（如孢子、细胞、毛状体等）的描述搭配出现。"]}
{"word":"biclinia","summary":{"en":"*Biclinia* means “two dining couches” in ancient Roman dining; it is the plural of *biclinium*.","zh":"*Biclinia* 指古罗马宴饮中的“两张餐榻”布局，是 *biclinium* 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In ancient Roman dining, two dining couches arranged for a meal; the plural of *biclinium* (a two-couch dining setup, less common than a *triclinium*).","zh":"（古罗马用餐文化中）两张餐榻的摆设；*biclinium* 的复数形式（指“两榻式”用餐布局，比 *triclinium*“三榻式”更少见）。"},"examples":[{"en":"The villa’s dining area may have used biclinia for smaller, more intimate dinners.","zh":"这座别墅的用餐区可能使用过 biclinia，用于规模较小、更私密的晚宴。"},{"en":"Archaeologists identified traces of a biclinium arrangement rather than a triclinium.","zh":"考古学家辨认出的是两榻式（biclinium）的布局痕迹，而不是三榻式（triclinium）。"}]}],"synonyms":["biclinium","two-couch dining arrangement","Roman dining couches"],"phonetic":"/baɪˈklɪniə/","extraExplanation":["词源提示：*bi-* 表示“二”，*-clinium* 来自拉丁语/希腊语词根，和“躺卧”相关；古罗马正式宴饮常在餐榻上半躺进食。","使用提醒：英语里更常见的相关词是 *triclinium*（三榻式宴饮室/布局）。*Biclinia* 属于较学术、考古或古典研究语境用词。"]}
{"word":"biclinium","summary":{"en":"A Roman two-couch dining setup (or the room/couches) where diners reclined while eating.","zh":"古罗马的“两榻”用餐布置（或其房间/餐榻），用餐者斜躺进食。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In ancient Rome, a dining arrangement with two couches (usually set around a low table) where people reclined while eating; also used to mean the couches themselves.","zh":"（古罗马）两张餐榻（通常围着矮桌摆放）组成的用餐布局，人们斜躺用餐；也可指这些餐榻本身。"},"examples":[{"en":"The museum reconstructed a biclinium so visitors could see how Romans reclined at dinner.","zh":"博物馆复原了一个biclinium，让游客看到罗马人如何斜躺用餐。"},{"en":"Unlike a triclinium, a biclinium has only two couches for diners.","zh":"与triclinium（三榻餐室）不同，biclinium只有两张供用餐者斜躺的餐榻。"}]},{"partOfSpeech":"n.","definition":{"en":"A small dining room designed for a two-couch dining setup, especially in Roman houses or archaeological descriptions.","zh":"（尤用于考古/古罗马住宅描述）为两榻用餐设置而设计的小餐室。"},"examples":[{"en":"Archaeologists identified the space as a biclinium based on the room’s layout and finds.","zh":"考古学家根据房间布局和出土物判断该空间是一个biclinium。"}]}],"synonyms":["Roman dining couch","two-couch dining arrangement","reclining dining couch"],"phonetic":"/baɪˈklɪniəm/","extraExplanation":["“biclinium”源自拉丁语：bi-（两、双）+ clinium（躺椅/斜躺用餐的榻，来自希腊语kline“床、榻”）。古罗马上层用餐常采取“斜躺”姿势，常见布局是三张餐榻（triclinium）；两张餐榻的形式（biclinium）可用于更小的房间或较私密的宴饮。","在英语里它多见于考古、古典学、博物馆说明文字中，日常口语不常用。相关词：triclinium（三榻餐室）、couch（沙发/榻）、recline（斜躺）。"]}
{"word":"Bicol","summary":{"en":"Bicol refers to a region in the Philippines, its people, or the languages spoken there.","zh":"Bicol 指菲律宾的比科尔地区，也可指比科尔人或当地语言（比科尔语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a region in the southeastern part of Luzon in the Philippines, known for volcanoes (especially Mayon) and spicy coconut-based food","zh":"菲律宾吕宋岛东南部的比科尔地区，以火山（尤其是马荣火山）和偏辣、常用椰奶的料理闻名"},"examples":[{"en":"She traveled around Bicol to see Mayon Volcano.","zh":"她在比科尔旅行，去看马荣火山。"},{"en":"Bicol is famous for dishes cooked in coconut milk and chili.","zh":"比科尔以椰奶加辣椒烹调的菜肴而出名。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from the Bicol Region; a Bicolano","zh":"比科尔人；来自比科尔地区的人（也称 Bicolano）"},"examples":[{"en":"He is Bicol and speaks the local language at home.","zh":"他是比科尔人，在家里说当地语言。"}]},{"partOfSpeech":"n.","definition":{"en":"the Bicol (Bikol) languages spoken in the Bicol Region","zh":"比科尔语（Bikol 语）：比科尔地区所使用的一组语言"},"examples":[{"en":"She can understand Bicol but answers in Filipino.","zh":"她听得懂比科尔语，但用菲律宾语回答。"}]}],"synonyms":["Bikol","Bicol Region","Bicolano"],"phonetic":"/ˈbiːkɔl/","extraExplanation":["拼写上你可能会看到 Bicol 和 Bikol：在英文里两者都常见，Bicol 更常用于地名与地区称呼；Bikol 也常用于语言名称或更贴近当地拼写。","作为专有名词，Bicol 通常要大写。指“比科尔人”时，也常用 Bicolano（更明确）。"]}
{"word":"Bicolano","summary":{"en":"Bicolano refers to a person from the Philippines’ Bicol Region, something related to that region, or the Bicolano/Bikol languages.","zh":"Bicolano 指菲律宾比科尔地区的人、与该地区有关的事物，或比科拉诺语/比科尔诸语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from the Bicol (Bikol) Region in the Philippines, or someone belonging to the Bicolano/Bikolano ethnic group","zh":"比科拉诺人；来自菲律宾比科尔（Bikol）地区的人；比科拉诺族人"},"examples":[{"en":"Many Bicolanos are known for their love of spicy food, especially dishes with chili and coconut milk.","zh":"许多比科拉诺人以爱吃辣闻名，尤其喜欢用辣椒和椰奶做的菜。"},{"en":"She is a Bicolano living in Manila for work.","zh":"她是比科拉诺人，因为工作住在马尼拉。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Bicol Region, its people, or its culture","zh":"比科尔（比科拉诺）地区的；与比科拉诺人或其文化有关的"},"examples":[{"en":"We tried Bicolano cuisine, including laing and Bicol Express.","zh":"我们尝了比科拉诺菜，包括 laing 和 Bicol Express。"},{"en":"He grew up with Bicolano traditions at home.","zh":"他在家里伴着比科拉诺传统长大。"}]},{"partOfSpeech":"n.","definition":{"en":"the language (or one of the languages) spoken in the Bicol Region; often used to refer to Bikol languages in general","zh":"比科拉诺语（比科尔地区使用的一种或多种语言；常泛指比科尔语族/比科尔诸语）"},"examples":[{"en":"Her grandparents speak Bicolano at home, but she answers in English.","zh":"她的祖父母在家讲比科拉诺语，但她用英语回答。"},{"en":"I’m learning basic greetings in Bicolano.","zh":"我在学一些比科拉诺语的基本问候语。"}]}],"synonyms":["Bikolano","Bicol (regional adjective, informal)"],"phonetic":"/ˌbiːkəˈlɑːnoʊ/","extraExplanation":["“Bicolano”也常拼作“Bikolano”。“Bicol/Bikol”指菲律宾吕宋岛东南部的比科尔大区（Bicol Region）。","语言方面：比科尔地区并非只有一种语言；很多时候英语里用“Bicolano/Bikolano”笼统指比科尔诸语（Bikol languages），更严谨时会具体说“Central Bikol”等。"]}
{"word":"Bicolanos","summary":{"en":"Bicolanos are people from the Bicol/Bikol Region of the Philippines.","zh":"Bicolanos 指来自菲律宾比科尔（Bicol/Bikol）地区的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people from the Bicol (also spelled Bikol) Region in the Philippines; the ethnic group and/or residents of that region","zh":"菲律宾比科尔（也拼作Bikol）地区的人；指该地区的族群与/或居民"},"examples":[{"en":"Many Bicolanos speak Bikol languages at home and Filipino in school.","zh":"许多比科尔人（Bicolanos）在家说比科尔语族的语言，在学校说菲律宾语。"},{"en":"The festival highlights Bicolano food, music, and local crafts.","zh":"这个节庆展示比科尔人的饮食、音乐和当地手工艺。"}]}],"synonyms":["Bikolanos","Bicol people","Bikol people"],"phonetic":"/ˌbiːkəˈlɑːnoʊz/","extraExplanation":["“Bicolanos”是复数形式；单数是“Bicolano”。也常见拼写“Bikolano(s)”，因为当地语言常用“K”表示该音。","Bicol地区以马荣火山（Mayon Volcano）和辛辣的椰奶料理闻名，例如bicol express、laing等；在文化语境中提到这些时，常会用到“Bicolano”。"]}
{"word":"bicollateral","summary":{"en":"A botanical adjective describing a structure—especially a vascular bundle—with phloem on both sides of the xylem.","zh":"一个植物学形容词，指结构（尤指维管束）中木质部两侧都有韧皮部。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany/biology) Having two collateral parts; especially describing a vascular bundle with phloem on both the outer and inner sides of the xylem.","zh":"（植物学/生物学）具有双侧并列结构的；尤指“并列型维管束”的一种：木质部两侧（外侧与内侧）都有韧皮部。"},"examples":[{"en":"Many cucurbit stems (like pumpkin) have bicollateral vascular bundles.","zh":"许多葫芦科植物的茎（如南瓜）具有双韧型（bicollateral）的维管束。"},{"en":"Under the microscope, the bundle looked bicollateral because phloem appeared on both sides of the xylem.","zh":"在显微镜下，这个维管束呈双韧型，因为木质部两侧都能看到韧皮部。"}]}],"synonyms":["double-collateral","amphicribral (related but not identical)"],"phonetic":"/ˌbaɪkəˈlætərəl/","extraExplanation":["这是一个偏专业的植物解剖学术语。常见的对比是 collateral（并列型：韧皮部在木质部外侧一边）与 bicollateral（双韧型：韧皮部在木质部两侧）。在一些科（如葫芦科、茄科的部分植物）中较常见。"]}
{"word":"bicollaterality","summary":{"en":"Bicollaterality means having two collateral (side) branches or pathways, often used in medical/anatomical contexts.","zh":"bicollaterality 指“具有两条侧支（旁支）分支或两条替代通路”的性质，常见于医学/解剖学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the condition or feature of having two collateral branches or pathways (especially in anatomy/medicine, such as blood vessels or ligaments).","zh":"（尤用于解剖学/医学）具有两条侧支（旁支）分支或两条替代通路的性质或状态（如血管侧支循环、韧带结构）。"},"examples":[{"en":"In some patients, imaging shows bicollaterality of the arterial supply around the knee.","zh":"在一些患者中，影像检查显示膝周动脉供血存在“双侧支性”（有两条侧支通路）。"},{"en":"The report notes bicollaterality, which may help maintain blood flow when the main vessel is narrowed.","zh":"报告提到存在双侧支性，这在主血管变窄时可能有助于维持血流。"}]}],"synonyms":["double collateral circulation","two collateral branches","dual collateral pathways"],"phonetic":"/ˌbaɪˌkɑləˈtɛrəlɪti/","extraExplanation":["这个词非常少见，更多时候会用更常见的表达来说明同一概念，例如：two collateral branches（两条侧支分支）、double collateral circulation（双侧支循环）、bicollateral ligament（双侧副韧带，具体结构需结合语境）。","构词上：bi- 表示“二、双”，collateral 表示“侧支的/旁支的”，-ity 把形容词变成名词，表示“性质/状态”。"]}
{"word":"bicolligate","summary":{"en":"Bicolligate means to closely connect or unite things (often two ideas) in a formal or older style.","zh":"Bicolligate 指把事物（常是两种观点/概念）紧密连接或结合起来，语体较正式且偏旧。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to link or bind together closely; to unite (often used in technical or literary writing).","zh":"把……紧密连接或捆绑在一起；使结合（多见于技术或文学语境，较少见）。"},"examples":[{"en":"In the old manuscript, the author says memory and imagination are bicolligated in art.","zh":"在那份古老手稿中，作者说记忆与想象在艺术中是紧密相连的。"},{"en":"The theory bicolligates two ideas that seem separate at first.","zh":"这个理论把乍看之下彼此分离的两个观点连接在一起。"}]}],"synonyms":["connect","link","unite","bind","join"],"phonetic":"ˌbaɪˈkɑlɪˌɡeɪt","extraExplanation":["这个词很少在现代日常英语中出现，更多见于较旧的书面语或学术表达。","词形上可拆为 bi-（“双、两”）+ colligate（“连接、结合”），因此带有“把两者连接起来/使两者相互关联”的意味。学习时可用更常见的 connect, link, unite 来替代。"]}
{"word":"bicolon","summary":{"en":"A bicolon is a rhetorical structure made of two parallel parts, used for balance and emphasis.","zh":"bicolon（二分句）是一种由两个平行部分构成的修辞结构，用来制造对称与强调效果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rhetoric) A sentence or expression made of two parallel or balanced parts (two clauses or phrases), often with similar structure and rhythm.","zh":"（修辞）由两个结构平行、对称或节奏相近的部分（两个从句或短语）组成的表达方式，常用于增强强调和韵律感。"},"examples":[{"en":"The slogan is a bicolon: “Reduce waste, save money.”","zh":"这句口号是一个二分句：“减少浪费，节省开支。”"},{"en":"Many speeches use bicolons to sound clear and memorable.","zh":"许多演讲会用二分句，让表达更清晰、更好记。"},{"en":"In a bicolon, the two parts often mirror each other in grammar.","zh":"在二分句中，两部分常在语法结构上彼此呼应。"}]}],"synonyms":["doublet (in rhetoric)","parallelism (general)","isocolon (broader term)"],"phonetic":"ˈbaɪˌkɑlən","extraExplanation":["“bicolon”来自 bi-（二）+ colon（“分句/句段”，也可指修辞中的“句段单位”）。它强调“两个并列的段落/分句”。","二分句常用于演讲、广告、格言中，因为两段结构相似会产生节奏感与强调效果；中文里有时可类比为“对偶/两分对称结构”，但不一定要求字数完全相等。","相关术语：tricolon（三分句，三个并列部分，常更有气势）；isocolon（等句/等结构句，强调各部分长度相近；bicolon可以被视为isocolon的一种常见形式）。"]}
{"word":"bicolor","summary":{"en":"Bicolor means “having two colors,” and it can also (less commonly) be a noun for something with two distinct colors.","zh":"bicolor 意为“双色的、两种颜色的”；较少见时也可作名词，指具有两种明显颜色的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two colors; showing two different colors (often clearly separated or contrasting).","zh":"双色的；具有两种颜色的（常指颜色分明或对比明显）。"},"examples":[{"en":"The bicolor flag has red on top and white on the bottom.","zh":"这面双色旗帜上红下白。"},{"en":"She wore a bicolor scarf with black and gray stripes.","zh":"她戴着一条黑灰相间的双色围巾。"},{"en":"Some bicolor flowers have petals that are half purple and half white.","zh":"有些双色花的花瓣一半紫一半白。"}]},{"partOfSpeech":"n.","definition":{"en":"An animal, plant, or object that has two distinct colors (used as a noun, less common).","zh":"双色个体；双色物（作名词用，较少见，指具有两种明显颜色的动植物或物体）。"},"examples":[{"en":"Gardeners sometimes call this variety a bicolor because its petals show two tones.","zh":"园丁有时把这个品种叫作“双色”，因为它的花瓣呈现两种色调。"}]}],"synonyms":["two-tone","two-colored","bicolored","bi-colored","dual-colored"],"phonetic":"/ˈbaɪˌkʌlɚ/","extraExplanation":["词源上，bi- 表示“二、双”，color 表示“颜色”，合起来就是“两种颜色”。拼写上也常见 bicolour（英式）。","在艺术、园艺、时尚领域很常见：bicolor rose（双色玫瑰）、bicolor shoes（双色鞋）。在政治语境中也常见于国旗描述，如“双色旗/二色旗”（bicolor/bicolour flag）。"]}
{"word":"bicoloration","summary":{"en":"Bicoloration means a two-colored appearance, or (less commonly) the process of coloring something in two colors.","zh":"bicoloration 指“呈现两种颜色的外观（双色现象）”，较少也可指“用两种颜色着色的过程”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of having two colors; a two-colored appearance.","zh":"双色状态；呈现两种颜色的外观。"},"examples":[{"en":"The butterfly’s wings show clear bicoloration: orange on the top and black near the edges.","zh":"这只蝴蝶的翅膀呈现明显的双色：上部是橙色，边缘附近是黑色。"},{"en":"Bicoloration in the leaves can be a sign of genetic variation or stress.","zh":"叶片的双色现象可能是遗传差异或胁迫的信号。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of coloring something in two colors (less common).","zh":"用两种颜色为某物着色的行为或过程（较少见）。"},"examples":[{"en":"The designer experimented with bicoloration to make the logo easier to recognize.","zh":"设计师尝试使用双色着色，让标志更易辨认。"},{"en":"In printing, bicoloration can reduce cost compared with full-color work.","zh":"在印刷中，双色印刷（双色着色）相比全彩可能更省成本。"}]}],"synonyms":["two-coloring","two-toning","bicoloring","bicolouration","bicolor (related)","bicolored (related)"],"phonetic":"/ˌbaɪ.kʌl.əˈreɪ.ʃən/","extraExplanation":["“bicoloration”由前缀 bi-（“二、双”）+ coloration（“着色；色彩”）构成，意思直观。日常英语里更常见的表达是 two-colored / bicolored，或在具体领域说 two-tone（如设计、汽车喷涂）与 bi-colored/bicoloured（偏书面/技术用语）。","常见使用场景：生物学/植物学（叶片、花瓣、昆虫翅膀的双色）、材料与设计（双色图案、双色印刷）。如果是在描述“有两种颜色”，用 bicoloration 强调“现象/特征”；用 bicolor/bicolored 更像在直接形容物体。"]}
{"word":"bicolored","summary":{"en":"“Bicolored” describes something that has two different colors.","zh":"“bicolored”表示“具有两种不同颜色的；双色的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two different colors; made up of two colors.","zh":"双色的；由两种颜色组成的。"},"examples":[{"en":"The bicolored flag is red and white.","zh":"这面双色旗是红白相间的。"},{"en":"She wore a bicolored scarf with blue and gray stripes.","zh":"她戴着一条蓝灰相间的双色围巾。"},{"en":"Some bicolored flowers have petals in two shades.","zh":"有些双色花的花瓣呈现两种色调。"}]}],"synonyms":["two-toned","two-colored","dual-colored"],"phonetic":"/ˈbaɪˌkʌlɚd/","extraExplanation":["前缀“bi-”表示“两个/双”，如：bicycle（自行车，两轮）、bilingual（双语的）。","“bicolored”常用于描述旗帜、衣物、动物花纹或植物花色；在美式英语里也常写作“bicolored”，英式英语里有时可见“bicoloured”。"]}
{"word":"bicoloredness","summary":{"en":"Bicoloredness means the state of having two different colors.","zh":"bicoloredness 指“具有两种不同颜色的状态/性质”（双色性）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of having two different colors (being bicolored)","zh":"（事物）具有两种不同颜色的性质；双色性"},"examples":[{"en":"The bird’s bicoloredness makes it easy to identify in the wild.","zh":"这只鸟的双色性让它在野外很容易被辨认出来。"},{"en":"The designer used bicoloredness to create a strong contrast between the collar and the shirt.","zh":"设计师利用双色性，让领子和衬衫形成强烈对比。"}]}],"synonyms":["two-tonedness","two-tone appearance","bicolor (bicolour)","bicolored (bicoloured)"],"phonetic":"/ˌbaɪˈkʌlərdnəs/","extraExplanation":["“bicoloredness”较少见，更常用的是“bicolor/bicolour”（名词或形容词）或“bicolored/bicoloured”（形容词）。它由前缀“bi-（二、双）+ colored（有颜色的）+ -ness（表示性质/状态的名词后缀）”构成，意思直观，但在日常英语里通常会换用更自然的表达，如“two-tone appearance（双色外观）”或直接说“it is bicolored（它是双色的）”。"]}
{"word":"bicolorous","summary":{"en":"Bicolorous means “having two colors.”","zh":"bicolorous 意为“双色的；由两种颜色组成的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two colors; colored in two distinct tones or areas.","zh":"双色的；由两种颜色组成的；呈现两种明显色块或色调的。"},"examples":[{"en":"The butterfly has bicolorous wings—orange on the top and black along the edges.","zh":"这只蝴蝶的翅膀是双色的——上部是橙色，边缘是黑色。"},{"en":"She chose a bicolorous scarf to match both her coat and her boots.","zh":"她选了一条双色围巾，这样既能搭配外套也能搭配靴子。"},{"en":"Many national flags are bicolorous in design.","zh":"许多国旗在设计上是双色的。"}]}],"synonyms":["two-colored","bicolored","bicoloured","bi-colored"],"phonetic":"/baɪˈkʌlərəs/","extraExplanation":["“bicolorous”由前缀“bi-”（表示“两、双”）+“color”（颜色）构成，意思直观就是“有两种颜色的”。","日常英语里更常见的说法是“bicolored”（美式）或“bicoloured”（英式）；“bicolorous”较少用，多见于较正式或描写性语境（如自然观察、文学描写）。"]}
{"word":"bicolors","summary":{"en":"Bicolor(s) means “two-colored,” or a thing that has two distinct colors.","zh":"bicolor(s) 表示“双色的”，也可指“具有两种明显颜色的事物”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having two different colors; made up of two colors","zh":"双色的；由两种颜色组成的"},"examples":[{"en":"The team wore bicolor jerseys in blue and white.","zh":"球队穿着蓝白双色的球衣。"},{"en":"She chose a bicolor scarf to match both coats.","zh":"她选了一条双色围巾，好搭配两件外套。"}]},{"partOfSpeech":"n.","definition":{"en":"a thing (often a flag, flower, or animal) that has two distinct colors","zh":"双色物（常指双色旗帜、花朵或动物等）"},"examples":[{"en":"The garden has several bicolors, including pink-and-white roses.","zh":"花园里有几种双色花，包括粉白相间的玫瑰。"},{"en":"Many national flags are bicolors.","zh":"许多国旗是双色旗。"}]}],"synonyms":["two-colored","two-tone","dual-colored"],"phonetic":"/ˈbaɪˌkʌlər/","extraExplanation":["“bicolor”来自拉丁语词根：bi-（二）+ color（颜色）。复数是 bicolors。","在生物/园艺语境中，bicolor 常用来描述“同一朵花或同一片花瓣上呈现两种颜色”的品种（例如某些玫瑰、三色堇等）。","在旗帜与纹章学语境里，bicolor 指只由两种颜色组成的旗帜（也常见拼写为 bi-colour/bi-color，英式拼写偏向 colour）。"]}
{"word":"bicolour","summary":{"en":"Bicolour means “having two colors,” and can also refer to a two-color flag or design. (US spelling: bicolor.)","zh":"bicolour 意为“双色的”，也可指“双色旗/双色设计”。（美式拼写：bicolor。）"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two different colors; made of two colors.","zh":"双色的；由两种颜色组成的。"},"examples":[{"en":"She wore a bicolour scarf in black and white.","zh":"她戴了一条黑白双色的围巾。"},{"en":"The flag is bicolour, with blue on top and yellow on the bottom.","zh":"这面旗是双色的，上蓝下黄。"}]},{"partOfSpeech":"n.","definition":{"en":"Something (especially a flag or design) that has two colors.","zh":"（尤指旗帜或图案的）双色物；由两种颜色构成的设计。"},"examples":[{"en":"Many countries use a simple bicolour for their national flag.","zh":"许多国家的国旗采用简单的双色设计。"}]}],"synonyms":["two-tone","two-colored","bicolor"],"phonetic":"/ˈbaɪˌkʌlər/","extraExplanation":["“bicolour”更常见于英式拼写；美式拼写通常是“bicolor”。两者意思相同。","在旗帜学（vexillology）里，只有两种颜色的旗常被称为“bicolour”（双色旗），如上下或左右两色的布局。"]}
{"word":"bicoloured","summary":{"en":"“Bicoloured” means “having two colors.”","zh":"“bicoloured”意思是“双色的、具有两种颜色的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two different colors; showing two colors together.","zh":"双色的；具有两种不同颜色的；呈现两种颜色的。"},"examples":[{"en":"The bird has a bicoloured beak—black at the tip and yellow near the base.","zh":"这只鸟的喙是双色的——尖端是黑色，靠近根部是黄色。"},{"en":"She wore a bicoloured scarf with blue and white stripes.","zh":"她戴了一条蓝白相间的双色围巾。"}]}],"synonyms":["two-toned","two-colored","bichromatic"],"phonetic":"/ˈbaɪˌkʌlɚd/","extraExplanation":["英式拼写常见为 bicoloured；美式拼写更常写作 bicolored。","这个词常用于描述动物外形（如 bicoloured plumage 羽毛双色）、服饰、旗帜、设计与图案等。"]}
{"word":"bicolourous","summary":{"en":"“Bicolorous” means having two colors.","zh":"“bicolorous”意思是“双色的、有两种颜色的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having two colors; made up of two different colors (often in clear sections or patterns)","zh":"双色的；由两种不同颜色组成的（常指颜色分区或图案很明显）"},"examples":[{"en":"The team wore bicolorous jerseys with red and white stripes.","zh":"球队穿着红白相间的双色球衣。"},{"en":"A bicolorous flag can symbolize two regions or two important ideas.","zh":"双色旗帜可以象征两个地区或两种重要理念。"},{"en":"Some flowers are naturally bicolorous, with petals that fade from one color to another.","zh":"有些花天生就是双色的，花瓣会从一种颜色渐变到另一种颜色。"}]}],"synonyms":["two-colored","two-tone","bicolored"],"phonetic":"/baɪˈkʌlərəs/","extraExplanation":["“bicolourous”更常见的拼写是 **bicolorous**（美式）或 **bicolourous / bicoloured**（英式更常用的是 bicoloured）。在日常英语里也常直接说 **two-colored** 或 **two-tone**（尤其指汽车、衣服等配色）。"]}
{"word":"bicolours","summary":{"en":"“Bicolours” means “two-colored” (UK spelling) and can also refer to two-colored flags or team colors.","zh":"“bicolours”意为“双色的”（英式拼写），也可指双色旗帜或球队的两种主色所代表的物品。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(plural of bicolour) Having two colors; made up of two distinct colors.","zh":"（bicolour 的复数）双色的；由两种明显不同的颜色组成的。"},"examples":[{"en":"The team wore bicolours socks in blue and white.","zh":"球队穿着蓝白双色的袜子。"},{"en":"She chose bicolours ribbons to match the gift wrap.","zh":"她选了双色丝带来搭配礼物包装。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) Two-colored items, especially flags, badges, or uniforms that show two main colors.","zh":"（复数）双色物品，尤指以两种主色呈现的旗帜、徽章或制服。"},"examples":[{"en":"The supporters waved the club’s bicolours from the stands.","zh":"球迷们在看台上挥舞着俱乐部的双色旗帜。"},{"en":"The parade was full of bicolours and banners.","zh":"游行队伍里到处都是双色旗与横幅。"}]}],"synonyms":["bicolors","two-colored","two-tone","dual-colored"],"phonetic":"/ˈbaɪˌkʌlərz/","extraExplanation":["“bicolours”是英式拼写，对应美式更常见的“bicolors”。在体育语境中，club colours（球队颜色）很常用，“the club’s bicolours”可指印有两种主色的围巾、旗帜、球衣等。","在纹章学（heraldry）或旗帜描述中，bicolour/bicolor也用于说明旗面主要由两种颜色构成（如上下两条色带）。"]}
{"word":"Bicols","summary":{"en":"“Bicols” usually refers to people from the Bicol/Bikol Region of the Philippines, or to the Bicol languages spoken there.","zh":"“Bicols”通常指菲律宾比科尔（Bikol）地区的人，或指该地区的比科尔诸语言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people from the Bicol (Bikol) Region of the Philippines; Bicolanos (Bikolanos).","zh":"菲律宾比科尔（Bikol）地区的人；比科尔人。"},"examples":[{"en":"Many Bicols work in Manila but return home for festivals.","zh":"许多比科尔人到马尼拉工作，但会在节庆时回乡。"},{"en":"She is a Bicol, so she grew up eating spicy Bicol Express.","zh":"她是比科尔人，所以从小就吃辣味的 Bicol Express。"}]},{"partOfSpeech":"n.","definition":{"en":"the languages spoken in the Bicol Region (often called the Bicol languages), such as Central Bikol.","zh":"比科尔地区使用的语言（常称“比科尔诸语言”），例如中部比科尔语。"},"examples":[{"en":"His grandparents speak Bicols at home.","zh":"他的祖父母在家里说比科尔语。"},{"en":"Central Bikol is one of the most widely spoken Bicols.","zh":"中部比科尔语是使用最广的比科尔语言之一。"}]}],"synonyms":["Bicolanos","Bikolanos","people from Bicol","Bikol language(s)"],"phonetic":"/biˈkɔl/","extraExplanation":["“Bicol”也常拼作“Bikol”。在英语里更常见的说法是“Bicolano/Bikolano”（指人）以及“Bikol language(s)”（指语言）。如果你指的是具体哪一种比科尔语言（如 Central Bikol、Albay Bikol 等），可以告诉我，我能给更精确的词条。"]}
{"word":"bicompact","summary":{"en":"A technical (topology) adjective meaning “compact,” often used as an alternative term in some older sources.","zh":"一个主要用于（拓扑学）文献的术语，意思基本等同于“紧致的（compact）”，常见于较旧资料中的替代说法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(mathematics, topology) Compact; having the compactness property (often used in some textbooks as another word for “compact”).","zh":"（数学·拓扑）紧致的；具有“紧致性”（在一些教材中常把 bicompact 当作 compact 的另一种说法）。"},"examples":[{"en":"In some older topology texts, a “bicompact” space just means a compact space.","zh":"在一些较旧的拓扑学教材中，“bicompact space”通常就是指“compact space（紧致空间）”。"},{"en":"Every closed subset of a bicompact space is bicompact.","zh":"紧致空间（bicompact space）的任意闭子集仍然是紧致的。"}]}],"synonyms":["compact (topology)"],"phonetic":"/ˌbaɪˈkɑm.pækt/","extraExplanation":["这个词在日常英语里几乎不用，主要出现在数学文献中。你更常见到的标准用法是 compact（紧致的）。","在部分俄语/东欧传统的拓扑学资料里，bicompact 被用作 compact 的同义词；读英文现代教材时通常直接写 compact。"]}
{"word":"biconcave","summary":{"en":"Biconcave describes something that is concave on both sides (two inward-curving surfaces).","zh":"biconcave 指“两面都内凹”的形状。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two inward-curving (concave) surfaces; concave on both sides.","zh":"双凹的；两面内凹的（两侧都向内弯曲）。"},"examples":[{"en":"Red blood cells have a biconcave shape that helps them carry oxygen efficiently.","zh":"红细胞呈双凹形，这有助于它们高效携带氧气。"},{"en":"The lens was designed to be biconcave to spread the light rays outward.","zh":"这种镜片被设计成双凹形，以使光线向外发散。"}]}],"synonyms":["double-concave","concave on both sides"],"phonetic":"/ˌbaɪ.kənˈkeɪv/","extraExplanation":["词形拆解：bi- 表示“二、双”，concave 表示“凹的”。所以 biconcave 字面意思就是“两个凹面”。","常见语境在生物学与医学（如红细胞的 biconcave disc/双凹圆盘形）以及光学（如 biconcave lens/双凹透镜）。"]}
{"word":"biconcavities","summary":{"en":"Biconcavities means biconcave shapes—forms that are concave on both sides.","zh":"biconcavities 指“双凹形”的复数：两面都向内凹的形状或结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural) biconcave shapes; surfaces or forms that are concave on both sides (like a lens or a red blood cell).","zh":"（复数）双凹形；两面都向内凹的形状或结构（如某些透镜或红细胞）。"},"examples":[{"en":"Red blood cells are known for their biconcavities, which help them carry oxygen efficiently.","zh":"红细胞以其双凹形而著称，这有助于它们高效运输氧气。"},{"en":"The microscope image showed clear biconcavities along the cell’s center.","zh":"显微镜图像显示细胞中央有明显的双凹结构。"}]}],"synonyms":["biconcave shapes","double concavities","biconcave forms"],"phonetic":"/ˌbaɪkənˈkævɪtiz/","extraExplanation":["“biconcavity / biconcave”常见于生物学与医学语境，最典型的例子是红细胞（RBC）的“双凹圆盘”形状：中间薄、边缘厚，增加表面积、利于气体交换，也让细胞更容易弯曲通过毛细血管。","词形拆解有助记忆：bi-（两、双）+ concave（凹的）+ -ity（名词后缀，表示性质/状态）。单数形式是 biconcavity，复数是 biconcavities。"]}
{"word":"biconcavity","summary":{"en":"Biconcavity means the state of being curved inward on both sides, especially used to describe the shape of red blood cells.","zh":"Biconcavity 指“两面内凹”的状态或形态，尤其常用来描述红细胞的双凹形结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being biconcave (curved inward on both sides); a biconcave shape","zh":"双凹性；双凹形态（两侧都向内凹的形状或性质）"},"examples":[{"en":"Red blood cells are known for their biconcavity, which helps them carry oxygen efficiently.","zh":"红细胞以其双凹性著称，这有助于它们高效携带氧气。"},{"en":"The diagram shows the biconcavity of the cell, with a thinner center than the edges.","zh":"图示显示该细胞的双凹形态：中央较薄，边缘较厚。"}]}],"synonyms":["biconcave form","biconcave shape","double concavity"],"phonetic":"/ˌbaɪkɑnˈkævɪti/","extraExplanation":["该词常见于生物学/医学语境，尤其描述红细胞（RBC）的典型“圆盘状双凹”结构。双凹形态能增加表面积并提高变形能力，使红细胞更容易通过细小毛细血管。"]}
{"word":"biconditional","summary":{"en":"A logic term meaning “if and only if,” where two statements imply each other and share the same truth value.","zh":"逻辑术语，表示“当且仅当”；两个命题互相推出、同真同假。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"In logic, describing a relationship where two statements are true or false together; it means “if and only if.”","zh":"（逻辑）表示两个命题同真同假；意思是“当且仅当（if and only if）”。"},"examples":[{"en":"The statement “A is true if and only if B is true” is a biconditional.","zh":"“A 当且仅当 B 为真”这句话就是一个双条件命题（biconditional）。"},{"en":"In math, we often use a biconditional to define a concept precisely.","zh":"在数学里，我们常用双条件关系来精确定义一个概念。"}]},{"partOfSpeech":"n.","definition":{"en":"A biconditional statement (often written as “P ↔ Q”) that asserts both directions: P implies Q and Q implies P.","zh":"双条件命题（常写作“P ↔ Q”），表示两个方向都成立：P 推出 Q，且 Q 推出 P。"},"examples":[{"en":"Write the biconditional for these two sentences: “If it rains, the ground is wet” and “If the ground is wet, it rained.”","zh":"把这两句话写成双条件命题：“如果下雨，地面是湿的”和“如果地面是湿的，就下过雨。”"},{"en":"The teacher asked us to test whether the biconditional is always true.","zh":"老师让我们检验这个双条件命题是否恒为真。"}]}],"synonyms":["if and only if","logical equivalence","equivalence","↔"],"phonetic":"/ˌbaɪkənˈdɪʃənəl/","extraExplanation":["在形式逻辑中，biconditional 通常记作 ↔，读作 “if and only if”。它等价于把两个条件句合在一起： (P → Q) 且 (Q → P)。","真值特点：只有当 P 和 Q 同真或同假时，P ↔ Q 才为真；一真一假时为假。","在写作与证明中，它常用于“定义”和“等价条件”：比如 “一个整数是偶数，当且仅当它能被 2 整除。”"]}
{"word":"bicondylar","summary":{"en":"Medical adjective meaning “involving two condyles,” often describing certain knee-area fractures or procedures.","zh":"医学形容词，意为“涉及两个髁（关节面）”，常用于描述膝部相关骨折或手术。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having or involving two condyles (rounded joint surfaces at the end of a bone). Often used in medical contexts, especially orthopedics.","zh":"（解剖/医学）具有或涉及两个髁（骨端圆形关节面）的；常用于骨科等医学语境。"},"examples":[{"en":"The X-ray showed a bicondylar fracture of the tibial plateau.","zh":"X 光显示胫骨平台的双髁骨折。"},{"en":"The surgeon planned a bicondylar knee replacement because both sides of the joint were damaged.","zh":"由于关节两侧都受损，外科医生计划进行双髁膝关节置换。"}]}],"synonyms":["two-condyle (informal paraphrase)","involving both condyles"],"phonetic":"ˌbaɪkənˈdaɪlər","extraExplanation":["“condyle”指骨头末端与其他骨相接触的圆形关节面（如股骨髁、胫骨髁）。因此“bicondylar”常见于描述膝关节附近的损伤或手术方式，例如“bicondylar tibial plateau fracture（胫骨平台双髁骨折）”。","词形拆解：bi-（两个）+ condyl(e)（髁）+ -ar（形容词后缀）。"]}
{"word":"bicone","summary":{"en":"A bicone is two identical cones joined tip to tip.","zh":"bicone 指两个相同的圆锥在顶点处相接形成的双圆锥体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a 3D shape made of two identical cones joined at their tips (apex to apex).","zh":"（几何）双圆锥体：两个相同的圆锥在顶点处相接形成的三维形状。"},"examples":[{"en":"In geometry, a bicone is formed by joining two cones tip to tip.","zh":"在几何中，双圆锥体是把两个圆锥的顶点对顶点连接起来形成的。"},{"en":"A bicone can model the basic shape used to introduce conic sections.","zh":"双圆锥体可以用来展示圆锥曲线的基本模型。"}]}],"synonyms":["double cone","two-napped cone","biconical shape"],"phonetic":"/ˈbaɪkoʊn/","extraExplanation":["“bicone”常见于数学与物理语境：把一个双圆锥用平面去切，会得到圆锥曲线（圆、椭圆、抛物线、双曲线）。","词素上，“bi-”表示“二/双”，“-cone”表示“圆锥”，因此字面意思就是“两个圆锥”。在一些教材里也会写作“double cone”或“biconical shape”。"]}
{"word":"bicone-shaped","summary":{"en":"Bicone-shaped means shaped like two cones joined base-to-base (a double cone).","zh":"bicone-shaped 指“像两个圆锥底部相接”的双圆锥形（双锥形）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape of two cones joined at their wide (base) ends, like an hourglass or a double cone.","zh":"呈双圆锥形的；像两个圆锥在底部相接的形状（类似沙漏/双锥）。"},"examples":[{"en":"The scientist used a bicone-shaped model to explain how the light beam spreads.","zh":"科学家用一个双圆锥形模型来解释光束如何扩散。"},{"en":"Some high-performance speakers have bicone-shaped parts to help control sound direction.","zh":"一些高性能音箱会有双圆锥形部件，用来帮助控制声音的传播方向。"}]}],"synonyms":["biconical","double-cone-shaped","hourglass-shaped"],"phonetic":"/ˈbaɪkoʊn ʃeɪpt/","extraExplanation":["“bicone-shaped”多见于科技写作（物理、工程、数学几何、天文学等），属于描述性形容词。更正式的写法也可见“biconical”（双圆锥的）或名词“bicone”（双圆锥体）。","词素拆解：bi- 表示“两个/双”，cone 表示“圆锥”，-shaped 表示“……形状的”。在学术或说明文里，这类结构（X-shaped）很常用来快速描绘外形。"]}
{"word":"biconic","summary":{"en":"Biconic describes something shaped by or having two cone-like (conical) surfaces, especially in optics.","zh":"biconic 指由两个圆锥（或圆锥曲面）构成/相关的形状，常用于光学领域。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Geometry/optics) Having the shape of two cones joined together, or involving two conical surfaces (often used for lenses or optical designs).","zh":"（几何/光学）呈“双圆锥”形的；由两个圆锥连接而成的，或具有两个圆锥曲面的（常用于镜片或光学设计）。"},"examples":[{"en":"A biconic lens uses two conical surfaces to control how light spreads.","zh":"双圆锥镜片使用两个圆锥曲面来控制光线的扩散。"},{"en":"The engineer modeled the reflector with a biconic surface for better beam shaping.","zh":"工程师用双圆锥曲面来建模反射器，以获得更好的光束整形效果。"}]}],"synonyms":["two-cone (shape)","double-cone","conical (in two directions)"],"phonetic":"/baɪˈkɑnɪk/","extraExplanation":["“biconic”常见于光学与验光领域，例如定制的隐形眼镜或角膜塑形（OK镜）设计中，用两条互相垂直方向的“圆锥曲率”来更贴合像散（散光）眼的角膜形状。","词形上：bi- 表示“二、双”，conic 表示“圆锥的”。可类比 biconvex（双凸）、biconcave（双凹），但 biconic 强调“圆锥/圆锥曲面”，不一定是球面那种“凸/凹”。"]}
{"word":"biconical","summary":{"en":"Biconical describes something shaped like two cones joined base-to-base.","zh":"Biconical 指“由两个圆锥底对底连接而成的双圆锥形”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape of two cones joined at their wide ends (like an hourglass, but with straight sides).","zh":"双圆锥形的；由两个圆锥在底部相接组成的形状（类似沙漏，但侧面是直的）。"},"examples":[{"en":"The seed has a biconical shape that helps it roll in the wind.","zh":"这种种子呈双圆锥形，有助于它在风中滚动。"},{"en":"Engineers tested a biconical nose design in the wind tunnel.","zh":"工程师在风洞中测试了一种双圆锥形的机头设计。"}]}],"synonyms":["double-cone","two-cone","bicone-shaped"],"phonetic":"/baɪˈkɑnɪkəl/","extraExplanation":["“biconical”由前缀 bi-（“双、两”）+ conical（“圆锥形的”）构成，常见于科学和工程语境，如几何学、物理、航空航天或生物形态描述。","相关词：conical（圆锥形的）、cone（圆锥体）、bicone（双圆锥体，名词，较偏专业）。"]}
{"word":"biconically","summary":{"en":"“Biconically” means “in a double-cone (biconic) shape,” mainly used in technical contexts.","zh":"“biconically”意为“呈双圆锥（双圆锥形）地”，主要用于技术语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a biconic shape—like two cones joined base-to-base (a “double cone”).","zh":"呈双圆锥形地——像两个圆锥底对底连接的形状（“双圆锥”）。"},"examples":[{"en":"The satellite’s antenna was shaped biconically to improve signal coverage.","zh":"这颗卫星的天线被做成双圆锥形，以改善信号覆盖。"},{"en":"The object widened biconically from the center, then narrowed toward both ends.","zh":"这个物体从中心向两端呈双圆锥状变宽后又逐渐变窄。"}]}],"synonyms":["in a biconic form","in a double-cone shape","double-conically"],"phonetic":"/baɪˈkɑnɪkli/","extraExplanation":["“biconically”是很偏技术/学术的副词，来自形容词“biconic”（bi- 表示“两个”，conic 表示“圆锥的”）。日常英语里不常用，通常出现在工程、物理、数学或设计说明中。","相关名词：bicone（双圆锥体）；相关形容词：biconic（双圆锥形的）。在一般写作中也常用更直白的说法：“in a double-cone shape / in a biconic form”。"]}
{"word":"biconjugate","summary":{"en":"Biconjugate is a technical math term meaning “paired conjugate,” especially for two vector sequences in BiCG-type algorithms.","zh":"biconjugate 是数学中的技术词，指“两组向量之间的配对共轭（双共轭）关系”，常见于 BiCG 等算法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(In mathematics/linear algebra) related in a paired way so that two sets of vectors are conjugate to each other with respect to a matrix (often written as being “A‑conjugate” in a bi-directional sense).","zh":"（数学/线性代数）指成对相关的一种“共轭”关系：两组向量彼此相对某个矩阵满足共轭性质（常见为双向的“A-共轭/双共轭”意义）。"},"examples":[{"en":"The algorithm builds two biconjugate sequences of search directions for the non‑symmetric system.","zh":"该算法为非对称线性方程组构造两组双共轭的搜索方向序列。"},{"en":"In BiCG methods, left and right vectors are chosen to be biconjugate with respect to A.","zh":"在 BiCG 方法中，会选择左右向量使其相对矩阵 A 成双共轭关系。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make (two sequences of vectors) biconjugate; to impose a biconjugacy relationship (used mainly in technical writing).","zh":"使（两组向量序列）成为双共轭；对其施加双共轭关系（主要用于技术/学术语境）。"},"examples":[{"en":"We biconjugate the direction vectors to stabilize convergence.","zh":"我们使方向向量双共轭，以稳定收敛过程。"},{"en":"The procedure biconjugates the bases produced by the iteration.","zh":"该过程使迭代产生的基底彼此双共轭。"}]}],"synonyms":["biorthogonal","(A-)conjugate (related concept)"],"phonetic":"ˌbaɪˈkɑn.dʒə.ɡeɪt","extraExplanation":["“biconjugate”在日常英语里几乎不用，主要出现在数值线性代数与迭代法中，尤其与 BiCG（Biconjugate Gradient，双共轭梯度法）相关。","它与更常见的“conjugate（共轭）”有关：共轭常指同一组向量在某个内积/矩阵下两两满足特定正交性质；而“bi-”强调是两组（左/右）向量之间的配对共轭关系，常用于非对称矩阵情形。"]}
{"word":"biconnected","summary":{"en":"Biconnected means a graph (or network) stays connected even if any one node is removed—there is no single node whose failure disconnects it.","zh":"biconnected（双连通的）指图或网络删除任意一个节点后仍连通，不存在会导致断开的“割点/单点故障”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Graph theory) having no single point of failure: the structure stays connected even if you remove any one vertex (node).","zh":"（图论）“双连通的”：删除任意一个顶点（节点）后，整体仍保持连通，没有“割点/关节点”（单点故障）。"},"examples":[{"en":"A biconnected graph remains connected after removing any single vertex.","zh":"双连通图在删除任意一个顶点后仍然保持连通。"},{"en":"We decompose the network into biconnected components to find weak points.","zh":"我们把网络分解为双连通分量，以找出薄弱点。"},{"en":"This router is a cut vertex, so the network is not biconnected.","zh":"这个路由器是割点，因此该网络不是双连通的。"}]},{"partOfSpeech":"adj.","definition":{"en":"(General/engineering use) connected in a way that provides redundancy, so the system can tolerate one connection or node failing.","zh":"（泛用/工程语境）以冗余方式连接，使系统能容忍一个连接或节点失效。"},"examples":[{"en":"For reliability, the team designed a biconnected layout for critical devices.","zh":"为提高可靠性，团队为关键设备设计了双连通的连接布局。"},{"en":"The service isn’t truly biconnected if one server outage breaks communication.","zh":"如果一台服务器宕机就导致通信中断，那这个服务就不算真正双连通。"}]}],"synonyms":["2-vertex-connected","vertex-biconnected","redundant (in engineering context)"],"phonetic":"/ˌbaɪkəˈnɛktɪd/","extraExplanation":["“biconnected”常见于计算机科学/算法题。它与“connected（连通）”不同：连通只要求整体有路可达；双连通更强，要求不存在割点。","相关名词：biconnected component（双连通分量/块）、articulation point 或 cut vertex（割点/关节点）。在无向图里最常讨论；有向图里对应概念通常叫 strongly connected（强连通）等。"]}
{"word":"biconsonantal","summary":{"en":"Biconsonantal means “having two consonants,” especially describing a two-consonant root in linguistics.","zh":"biconsonantal 指“由两个辅音构成”，尤其用于语言学中描述“双辅音词根”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Linguistics) Having two consonants as the main elements (for example, a word root made of two consonants).","zh":"（语言学）由两个辅音构成主要成分的；（如）由两个辅音组成词根的。"},"examples":[{"en":"Some Semitic roots are described as biconsonantal in older linguistic analyses.","zh":"在较早的语言学分析中，一些闪米特语系的词根被描述为“双辅音词根”。"},{"en":"The researcher compared biconsonantal and triconsonantal root patterns.","zh":"研究者比较了双辅音与三辅音的词根模式。"}]}],"synonyms":["two-consonant","diconsonantal"],"phonetic":"/ˌbaɪˌkɑn.səˈnæn.təl/","extraExplanation":["这个词多见于讨论“词根系统”的语言学语境，尤其与闪米特语系（如阿拉伯语、希伯来语）相关。传统上人们更熟悉“三辅音词根”（triconsonantal root），但有些学者提出某些词根可能历史上源自更短的“两辅音词根”，后来通过添加辅音或弱音位演变成三辅音结构。具体是否应分析为双辅音，取决于理论框架与证据（语音演变、形态对应、同源词比较等）。"]}
{"word":"biconvex","summary":{"en":"Biconvex describes something (especially a lens) that is convex on both sides.","zh":"biconvex 指（尤其是透镜）两面都向外凸起的“双凸”形状。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a shape or lens) having two outward-curving (convex) surfaces.","zh":"（形状或透镜）双凸的；两面都向外鼓起的。"},"examples":[{"en":"A biconvex lens can focus light to form a sharp image.","zh":"双凸透镜可以聚焦光线，形成清晰的图像。"},{"en":"The diagram shows a biconvex shape, curved outward on both sides.","zh":"图示的是双凸形状，两侧都向外弯曲。"}]}],"synonyms":["double-convex","convex on both sides"],"phonetic":"/ˌbaɪˈkɑnˌvɛks/","extraExplanation":["词源小提示：bi- 表示“两个/双”，convex 表示“凸的”。因此 biconvex 直译就是“双凸”。","常见语境：多用于物理学、光学、眼科（如人工晶状体）、以及几何/工程图纸中。与之相对的词是 biconcave（双凹）。"]}
{"word":"biconvexities","summary":{"en":"“Biconvexities” means the plural qualities of being curved outward on both sides, often used for lens shapes in optics.","zh":"“biconvexities”指“双凸性”的复数：两面向外凸的性质，常用于光学中描述透镜形状。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The qualities or conditions of being biconvex (curved outward on both sides), especially describing shapes like certain lenses.","zh":"双凸性；双面外凸的性质或状态（两面都向外鼓起），常用于描述某些透镜等形状。"},"examples":[{"en":"Optics students compared the biconvexities of different lenses to see which focused light more sharply.","zh":"光学课的学生比较了不同透镜的双凸性，看看哪一种聚焦更清晰。"},{"en":"The instrument’s image quality depends partly on small differences in surface biconvexities.","zh":"仪器的成像质量部分取决于表面双凸性的细微差别。"}]}],"synonyms":["double convexities","biconvex forms","biconvex shapes"],"phonetic":"ˌbaɪkənˈvɛksətiz","extraExplanation":["“biconvex”由 bi-（“双、两”）+ convex（“凸的”）组成；“biconvexity”是名词形式，复数为 “biconvexities”。","在光学里，双凸透镜（biconvex lens）常用于汇聚光线；双凸性的变化会影响焦距、成像清晰度与畸变。","在数学/几何语境中，也可用来泛指某个物体或曲面“两个方向都外凸”的整体形态特征。"]}
{"word":"biconvexity","summary":{"en":"Biconvexity means being convex on both sides; in math it also describes problems that are convex in each of two variable blocks when the other is fixed.","zh":"biconvexity 指“双凸性”：物体两面都外凸；在数学中也指把变量分成两组时，固定一组对另一组为凸的性质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being convex on both sides (for example, a lens that bulges outward on two faces).","zh":"（物体）双凸性；两面都向外鼓起的性质（例如双凸透镜两面都外凸）。"},"examples":[{"en":"A biconvex lens has biconvexity, which helps it focus light to a point.","zh":"双凸透镜具有双凸性，这有助于把光聚焦到一点。"},{"en":"The designer increased the biconvexity of the glass to change how it bends light.","zh":"设计师加大了玻璃的双凸性，以改变它对光的折射方式。"}]},{"partOfSpeech":"n.","definition":{"en":"in mathematics/optimization: a property of a problem or function that is convex in each of two variable groups when the other group is held fixed.","zh":"（数学/优化）双凸性：当把变量分成两组时，固定其中一组，关于另一组是凸的性质。"},"examples":[{"en":"The objective shows biconvexity: it is convex in A when B is fixed, and convex in B when A is fixed.","zh":"这个目标函数具有双凸性：固定B时对A是凸的，固定A时对B也是凸的。"},{"en":"Because of biconvexity, the researchers used alternating minimization.","zh":"由于具有双凸性，研究人员采用了交替最小化的方法。"}]}],"synonyms":["double convexity","biconvex property","(optics) biconvex shape"],"phonetic":"/ˌbaɪ.kɑnˈvɛk.sə.ti/","extraExplanation":["“bi-”表示“二/双”，“convex”表示“凸的”。在光学里常见于“biconvex lens（双凸透镜）”。在优化里，“双凸”不等于“联合凸（jointly convex）”：整体问题可能仍然是非凸的，但分组后各自保持凸性，因此常用交替优化（交替固定一组变量、优化另一组）。"]}
{"word":"Bicorn","summary":{"en":"Bicorn means “two-horned,” and it can also mean a historic two-cornered military hat (bicorne).","zh":"bicorn 表示“有两只角的（双角的）”，也可指历史上的“双角帽（bicorne）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having two horns; two-horned.","zh":"有两只角的；双角的。"},"examples":[{"en":"A bicorn animal might use both horns to defend itself.","zh":"双角动物可能会用两只角来保护自己。"},{"en":"In mythology, artists sometimes描绘 bicorn creatures as symbols of power.","zh":"在神话中，艺术家有时会把双角生物描绘成力量的象征。"}]},{"partOfSpeech":"n.","definition":{"en":"a bicorne (two-cornered) hat, especially one worn by European military officers in the 18th–19th centuries.","zh":"双角帽（bicorne）；一种18—19世纪欧洲军官常戴的两角帽。"},"examples":[{"en":"Napoleon is often shown wearing a black bicorn.","zh":"拿破仑常被描绘为戴着黑色双角帽。"},{"en":"The museum displayed a bicorn in its military history section.","zh":"博物馆在军事史展区展出了一顶双角帽。"}]}],"synonyms":["two-horned","bicorne (hat)","two-cornered (hat)"],"phonetic":"/ˈbaɪkɔrn/","extraExplanation":["“bicorn”来自拉丁语词根：bi-（二）+ corn（角）。作为名词时，常与拼写更常见的“bicorne”互通，指那种把帽檐折起形成两个“角”的军帽。","英语里“bicorn/bicorne”在日常生活中不算常见，更多出现在历史、军装、戏剧/电影或艺术描写中。"]}
{"word":"bicorn","summary":{"en":"Bicorn most often means a two-pointed (two-horned) hat; it can also mean “having two horns.”","zh":"bicorn最常指“双角帽/两尖帽”，也可作形容词表示“双角的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A two-horned hat, especially a black hat with two points (often associated with European military and formal dress in the 18th–19th centuries).","zh":"双角帽（有两个尖角的帽子；常见于18—19世纪欧洲军装或礼服，通常为黑色）。"},"examples":[{"en":"In many portraits, Napoleon is shown wearing a bicorn.","zh":"在许多肖像画中，拿破仑常被画成戴着一顶双角帽。"},{"en":"The actor’s bicorn helped the costume look historically accurate.","zh":"演员戴的双角帽让服装看起来更符合历史。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having two horns or two horn-like points.","zh":"双角的；有两只角（或两个角状突起）的。"},"examples":[{"en":"Some animals are described as bicorn in old scientific writing.","zh":"在一些旧的科学著作里，有些动物会被描述为“双角的”。"}]}],"synonyms":["two-cornered hat","two-pointed hat","two-horned"],"phonetic":"/ˈbaɪkɔrn/","extraExplanation":["“bicorn”来自拉丁语前缀 bi-（两个）+ cornu（角），字面意思是“两个角”。在英语里最常见的用法是指“拿破仑帽”（bicorn hat），但严格来说，bicorn并不只属于拿破仑；18—19世纪欧洲军官、外交场合与礼服中都可见这种帽型。","易混词：tricorn（tricorn hat，三角帽/三角船长帽）是“三个角”的帽子，更常与18世纪海军或殖民时期形象相关。"]}
{"word":"bicornate","summary":{"en":"“Bicornate” means “having two horns.”","zh":"“bicornate”指“有两只角的；双角的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two horns or two horn-like projections; two-horned.","zh":"有两只角的；有两个角状突起的（双角的）。"},"examples":[{"en":"In medieval art, some creatures are shown as bicornate beasts.","zh":"在中世纪艺术中，有些生物被描绘成双角的野兽。"},{"en":"The insect’s head looked bicornate under the microscope.","zh":"在显微镜下，这只昆虫的头部看起来像是双角的。"}]}],"synonyms":["two-horned","bicorn"],"phonetic":"/baɪˈkɔr.neɪt/","extraExplanation":["词源上可拆为 bi-（两、双）+ corn-（角），来自拉丁语 cornu（角）。常见于生物学、动物学、植物学或文学描写中，用来形容“像有两只角”的外形。","在日常英语里不常用；更常见、更口语的说法是 two-horned（双角的）。"]}
{"word":"bicorne","summary":{"en":"A bicorne is a two-cornered hat, famously associated with European military and formal dress (e.g., Napoleon).","zh":"bicorne 指“双角帽”，一种有两个尖角的帽子，常与欧洲军装与正式礼服联系在一起（如拿破仑形象）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hat with two pointed corners (two “horns”), often worn as part of military or formal dress, especially in Europe in the 18th–19th centuries.","zh":"一种有两个尖角（像“两只角”）的帽子，常见于18—19世纪欧洲的军装或正式礼服中。"},"examples":[{"en":"Napoleon is often shown wearing a black bicorne.","zh":"拿破仑常被描绘成戴着一顶黑色的双角帽。"},{"en":"The museum displayed a soldier’s uniform with a bicorne hat.","zh":"博物馆展出了一套士兵制服，其中包括一顶双角帽。"}]}],"synonyms":["two-cornered hat","cocked hat (often used loosely)"],"phonetic":"/baɪˈkɔrn/","extraExplanation":["“bicorne”来自法语，字面意思是“有两只角的”（bi- = 两个，corne = 角）。中文里常译为“双角帽”。","双角帽在西方历史形象中很有辨识度：拿破仑常把双角帽横戴（角朝左右），而有些军官则会纵戴（角朝前后）。","相关词：tricorne（三角帽，三尖角）也是同一时期常见的帽型。"]}
{"word":"bicorned","summary":{"en":"Bicorned describes a two-pointed hat (a bicorne), often associated with historical military or ceremonial dress.","zh":"bicorned 指“有两个尖角的（双角）帽子”，常见于历史上的军装或礼仪服饰描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a hat) having two points or ‘horns,’ usually with the brim folded up on two sides; a bicorne hat.","zh":"（帽子）有两个尖角（像“双角”）的；通常指两侧帽檐向上折起的“双角帽/两角帽”。"},"examples":[{"en":"In many paintings, Napoleon is shown wearing a bicorned hat.","zh":"在许多画作中，拿破仑常被画成戴着一顶双角帽。"},{"en":"The actor’s bicorned hat helped the audience recognize the historical period immediately.","zh":"演员的双角帽让观众立刻辨认出那个历史时期。"}]}],"synonyms":["two-horned","two-pointed","bicorne (related noun)"],"phonetic":"/baɪˈkɔrnd/","extraExplanation":["“bicorned”常用于描述18—19世纪欧洲军政人物常戴的“双角帽”（bicorne）。这种帽子在英语文化语境里常与拿破仑、军官制服、历史戏剧或礼仪场合联系在一起。","词源上，bi- 表示“二”，corn/ cornu 与“角”有关（如 unicorn=独角兽）。因此 bicorned 字面意思是“有两只角的”。在现代英语里，这个词多用于历史/服饰描写，不太用于日常帽子。"]}
{"word":"bicornes","summary":{"en":"Bicornes are two-cornered hats (plural of bicorne), often associated with historical military or formal uniforms.","zh":"bicornes 指“双角帽”（bicorne 的复数），常见于历史上的军装或正式制服。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hat with two pointed corners (a “two-cornered” hat), often worn as part of a formal or military uniform; plural of “bicorne.”","zh":"（有两个尖角的）双角帽；常作为正式或军装制服的一部分；“bicorne”的复数。"},"examples":[{"en":"In the museum, you can see several bicornes worn by officers in the 1800s.","zh":"在博物馆里，你可以看到几顶19世纪军官戴过的双角帽。"},{"en":"The actor wore a bicorne to play a Napoleonic soldier.","zh":"那位演员戴着双角帽来扮演拿破仑时期的士兵。"}]},{"partOfSpeech":"adj.","definition":{"en":"two-cornered; shaped like a bicorne hat (usually describing the hat or its style).","zh":"双角的；呈双角帽形状的（多用于描述帽子或其样式）。"},"examples":[{"en":"They chose a bicorne style hat for the historical costume.","zh":"他们为历史服装选择了双角帽款式。"}]}],"synonyms":["two-cornered hat","cocked hat"],"phonetic":"/baɪˈkɔːrn/","extraExplanation":["“bicorne（双角帽）”在欧洲18—19世纪很常见，尤其常与拿破仑形象联系在一起。它通常被横向或纵向佩戴，不同佩戴方式会影响两侧“角”的朝向与视觉效果。"]}
{"word":"bicornous","summary":{"en":"Bicornous means “having two horns or two horn-like points.”","zh":"bicornous 指“有两只角的；有两个角状突起的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two horns (or horn-like points).","zh":"有两只角的；有两个角状突起的。"},"examples":[{"en":"A bicornous animal may have two prominent horns on its head.","zh":"有两只角的动物头上可能有两根明显的角。"},{"en":"The statue’s helmet is bicornous, with two sharp points curving upward.","zh":"这座雕像的头盔是双角形的，两端尖角向上弯起。"}]}],"synonyms":["two-horned","bicorn","horned"],"phonetic":"/baɪˈkɔrnəs/","extraExplanation":["“bicornous”比较少见，常见的近义词/相关词是“bicorn（双角形的）”“two-horned（有两角的）”。","词源上可拆成 bi-（二）+ corn(u)（角，来自拉丁语 cornu）。在历史与文学语境里，常用来形容“有两角”的头饰或帽子，比如欧洲18世纪的双角帽（bicorn hat）。"]}
{"word":"bicornual","summary":{"en":"Bicornual means “having two horns,” most commonly used in medicine to describe a bicornual (two-horned) uterus.","zh":"bicornual 意为“有两个角的”，医学中最常用来形容“双角子宫”（子宫呈两角形）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy/medicine) Having two horns or two horn-like parts, especially describing a uterus that has two upper cavities (“horns”).","zh":"（解剖/医学）有两个“角”或角状结构的；尤指“双角子宫”（子宫上部呈两个腔/角）。"},"examples":[{"en":"A bicornual uterus can sometimes be found during an ultrasound exam.","zh":"双角子宫有时会在超声检查中被发现。"},{"en":"The doctor explained that a bicornual shape may affect pregnancy in some cases.","zh":"医生解释说，子宫呈双角形在某些情况下可能会影响妊娠。"}]}],"synonyms":["two-horned","bicornuate","horned"],"phonetic":"/baɪˈkɔrnjuəl/","extraExplanation":["“bicornual”由 bi-（两、双）+ corn(u)-（角；源自拉丁语 cornu）+ -al（形容词后缀）构成。临床上更常见的说法是“bicornuate uterus”（双角子宫）；“bicornual”属于较少见但可理解的变体拼法/用法。","“双角子宫”通常与胚胎发育过程中苗勒管（Müllerian ducts）融合不完全有关。是否需要处理取决于症状与生育史，应由专业医生评估。"]}
{"word":"bicornuate","summary":{"en":"Bicornuate means “having two horn-like parts,” especially a bicornuate uterus (a uterus with two upper horns).","zh":"bicornuate 指“有两个角状部分的”，尤指“双角子宫”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Having two horn-like parts; most commonly describing a uterus that is heart-shaped with two upper “horns.”","zh":"（医学）有两个角状部分的；最常用于描述“双角子宫”（子宫上部呈心形、分成两个“角”）。"},"examples":[{"en":"She was diagnosed with a bicornuate uterus during an ultrasound.","zh":"她在超声检查中被诊断为双角子宫。"},{"en":"A bicornuate structure can sometimes affect pregnancy outcomes.","zh":"双角结构有时会影响妊娠结局。"}]}],"synonyms":["two-horned","bicornual (medical variant)"],"phonetic":"/baɪˈkɔr.nju.ət/","extraExplanation":["词源上可拆成 bi-（两个）+ cornu（角）+ -ate（形容词后缀），字面意思就是“有两个角的”。","在日常英语中这个词几乎只出现在医学语境（妇产科、影像报告、病例讨论）里；非医学场合很少用。","如果你在报告里看到 bicornuate uterus，它通常指一种先天性子宫形态差异，并不等同于“子宫畸形一定无法怀孕”，是否需要处理取决于症状与病史，应由医生评估。"]}
{"word":"bicornuous","summary":{"en":"Bicornuous means “having two horns” or “two horn-like points.”","zh":"bicornuous 指“有两只角的”或“有两个角状突起的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two horns or horn-like projections; two-horned.","zh":"有两只角的；具两角状突起的。"},"examples":[{"en":"The male beetle has a bicornuous head used for fighting.","zh":"这只雄性甲虫的头部呈双角状，用来争斗。"},{"en":"In the illustration, the creature is drawn with a bicornuous crown.","zh":"在插图中，这个生物被画成戴着双角状的王冠。"}]}],"synonyms":["two-horned","bicornate","bicornuate","horned"],"phonetic":"/baɪˈkɔr.nju.əs/","extraExplanation":["“bicornuous”较少见，更多时候会看到近义形式如 **bicornuate / bicornate**。","词源上可拆为 **bi-（两）+ cornu（角）**，常用于动物学、解剖学或文学描写中，强调“像角一样的两处突起”。"]}
{"word":"bicornute","summary":{"en":"Bicornute means “two-horned” or “having two horn-like points,” mainly in scientific contexts.","zh":"bicornute 表示“有两只角的/二角状的”，多用于科学或解剖等语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having two horns or two horn-like projections; two-horned (rare; often used in biology or anatomy).","zh":"有两只角的；有两个角状突起的（较少见；常用于生物学或解剖学语境）。"},"examples":[{"en":"In some insects, the male has a bicornute head structure used in fighting.","zh":"在一些昆虫中，雄虫有一种“双角状”的头部结构，用来搏斗。"},{"en":"The diagram shows a bicornute shape, with two curved points at the top.","zh":"这张图显示了一个“双角状”的形状，顶部有两个弯曲的尖端。"}]}],"synonyms":["two-horned","bicorn","bicornuate"],"phonetic":"/baɪˈkɔrˌnuːt/","extraExplanation":["词源上可拆为 bi-（“二、双”）+ corn-（来自拉丁语 cornu，“角”）+ -ute（形容词后缀）。整体字面意思就是“有两只角的”。","在医学里更常见的相关词是 bicornuate（如 bicornuate uterus “双角子宫”），指子宫形态呈两侧分叉、类似两角。你输入的 bicornute 属于较罕见的变体/拼写，用法上通常仍表达“二角状”。"]}
{"word":"bicorporal","summary":{"en":"Bicorporal means “having two bodies” and is a rare adjective, often seen in fantasy or theoretical contexts.","zh":"bicorporal 意为“有两个身体的”，是较少见的形容词，多用于奇幻或理论语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two bodies; existing in two bodily forms (often used in fantasy, theology, or speculative writing).","zh":"具有两个身体的；以两种身体形态存在的（常见于奇幻、神学或推想类写作）。"},"examples":[{"en":"In the novel, the wizard is described as bicorporal, able to appear in two places at once.","zh":"在小说里，这位巫师被描写成“bicorporal”的，能同时在两个地方出现。"},{"en":"The artist painted a bicorporal figure to suggest a split identity.","zh":"这位艺术家画了一个“bicorporal”的形象来暗示身份分裂。"}]}],"synonyms":["bicorporeal","two-bodied","double-bodied"],"phonetic":"/ˌbaɪˈkɔːr.pə.rəl/","extraExplanation":["这个词非常少见，更常见的拼写是 **bicorporeal**（意义相同）。词根来自 **bi-**（二、双）+ **corpus**（拉丁语“身体”）。","在日常英语里通常不会用到；如果想表达“有两个身体/两副躯体”，更自然的说法可能是 **having two bodies**、**two-bodied**，或在奇幻语境中用 **bilocated**（更偏“同时出现在两处”）。"]}
{"word":"bicorporate","summary":{"en":"“Bicorporate” means involving or shared by two corporations; it’s a rare word in modern everyday English.","zh":"“bicorporate”指“涉及两个公司（法人）的、由两家公司共同组成/共享的”，在现代日常英语中较少见。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"involving two corporations; shared by or formed from two corporate entities","zh":"涉及两个公司（法人）的；由两个公司共同组成或共同拥有的"},"examples":[{"en":"The joint venture created a bicorporate management team.","zh":"这家合资企业组建了一个由两家公司共同管理的团队。"},{"en":"They signed a bicorporate agreement to share patents and revenue.","zh":"他们签署了一份两家公司之间共享专利与收益的协议。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) having two bodies or two corporate bodies (used in older or specialized writing)","zh":"（罕见）具有两个“身体”或两个团体/法人实体的（多见于较旧或专门语境）"},"examples":[{"en":"Some older texts use “bicorporate” to describe an office held by two corporate bodies.","zh":"一些较旧的文本用“bicorporate”来描述由两个法人团体共同承担的职务。"}]}],"synonyms":["intercompany","joint","shared","two-company","co-owned"],"phonetic":"/ˌbaɪˈkɔːrpərət/","extraExplanation":["“bicorporate”并不常见，写作中更常用的表达是：two-company / intercompany / between two corporations / jointly owned。","注意别与“B Corp”（共益企业认证，benefit corporation）混淆；“bicorporate”里的“bi-”是“两个”。","也有人误把它当作“有两个身体”的意思；如果要表达“二体的/双身的”，更常见的是“bicorporeal”。"]}
{"word":"bicorporeal","summary":{"en":"Bicorporeal means “having two bodies” or “existing in two bodily forms,” often used in literary, religious, or fantasy contexts.","zh":"bicorporeal 指“有两个身体/以两种躯体形态存在”，多见于文学、宗教或奇幻语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having or relating to two bodies; existing in two bodily forms.","zh":"（形容词）有两个身体的；与两个身体有关的；以两种躯体形态存在的。"},"examples":[{"en":"In the fantasy novel, the bicorporeal spirit could appear in two places at the same time.","zh":"在那本奇幻小说里，那个双体的灵体可以同时出现在两个地方。"},{"en":"The artist painted a bicorporeal figure to show a split identity.","zh":"这位艺术家画了一个双体的人物来表现分裂的身份。"}]}],"synonyms":["two-bodied","double-bodied","duplicated","dual-form"],"phonetic":"/ˌbaɪkɔrˈpɔriəl/","extraExplanation":["词源上由前缀 bi-（“两、双”）+ corp(us)（拉丁语“身体”）+ -eal（形容词后缀）组成，因此字面意思就是“有两个身体的”。","这是一个较少见、偏文学/宗教/哲学或奇幻题材中的词，常用来描述“灵体分身”“双重形态”“同时以两种实体存在”等概念；日常英语里更常用 two-bodied 或 double-bodied（语境允许时）。"]}
{"word":"bicostate","summary":{"en":"Bicostate is a rare technical term meaning “involving two costate (adjoint) variables,” mainly in optimal control and mathematical optimization.","zh":"Bicostate 是较少见的技术用语，主要指“涉及两个协态/伴随变量（costate）”，常见于最优控制与数理优化。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(technical) In optimal control or related fields, describing a method, equation, or system that uses two *costate* (adjoint) variables/vectors.","zh":"（技术用语）在最优控制等领域中，指使用两个“协态/伴随变量（costate）”的模型、方程或系统。"},"examples":[{"en":"The paper derives a bicostate formulation to handle two coupled constraints.","zh":"论文推导了一种双协态（bicostate）表述来处理两个耦合约束。"},{"en":"In a bicostate approach, each constraint may introduce its own costate variable.","zh":"在双协态方法中，每个约束都可能引入各自的协态变量。"}]},{"partOfSpeech":"n.","definition":{"en":"(technical) A pair of costate (adjoint) variables/vectors used together in a model.","zh":"（技术用语）在模型中配套使用的一对协态/伴随变量（costate）。"},"examples":[{"en":"We solve the state equation together with the bicostate.","zh":"我们将状态方程与这对协态变量一起求解。"}]}],"synonyms":["two-costate","dual-costate","paired costates"],"phonetic":"/ˌbaɪˈkoʊsteɪt/","extraExplanation":["“bicostate”并不是日常英语词汇，更多出现在控制理论、变分法、数理优化等专业写作中。它通常由前缀 bi-（两个）+ costate（协态/伴随变量）构成。","costate 常见于最优控制（如庞特里亚金极大值原理 Pontryagin’s Maximum Principle）：state 是系统状态，costate 是与之配对的“伴随/拉格朗日乘子式”变量，用来表达约束与最优性条件。bicostate 往往意味着同时引入两组伴随变量（例如对应两类约束、两套耦合动态，或扩展后的系统）。","如果你的本意是表达“具有两种稳定状态/双稳态”，英语里更常用的是 bistable / bistate，而不是 bicostate。"]}
{"word":"bicrenate","summary":{"en":"Bicrenate describes a leaf or petal edge with double-rounded teeth (each tooth slightly notched).","zh":"bicrenate 用来形容叶片或花瓣边缘呈“双重圆齿状”（每个圆齿又略带小缺刻）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having a margin with small rounded teeth, each tooth itself slightly notched (double-scalloped).","zh":"（植物学）叶缘呈细小圆齿状，并且每个圆齿的边缘又略带小缺刻（双重圆齿/双波状齿）。"},"examples":[{"en":"The species can be identified by its bicrenate leaf margins.","zh":"这种植物可以通过它的叶缘双重圆齿特征来辨认。"},{"en":"Under the hand lens, the petals look bicrenate rather than smoothly rounded.","zh":"用放大镜看，花瓣边缘呈双重圆齿状，而不是完全平滑的圆弧。"}]}],"synonyms":["double-crenate","twice-crenate"],"phonetic":"/baɪˈkriːneɪt/","extraExplanation":["词源上，bi- 表示“二、双”，crenate 指“圆齿状（波状小齿）”。bicrenate 常用于植物形态描述，强调“每个圆齿上还有细小缺刻”，比单纯的 crenate（圆齿状）更细致。"]}
{"word":"bicrescentic","summary":{"en":"Bicrescentic means “double-crescent-shaped,” having two crescent forms.","zh":"bicrescentic 意为“双新月形的”，具有两个新月形结构/外观。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having two crescent shapes; shaped like a pair of crescents.","zh":"具有两个新月形的；呈“双新月形”的。"},"examples":[{"en":"Under the microscope, the structure looked bicrescentic, like two thin crescents facing each other.","zh":"在显微镜下，这个结构呈双新月形，像两道薄薄的新月彼此相对。"},{"en":"The report describes a bicrescentic pattern in the tissue sample.","zh":"报告描述该组织样本中出现了双新月形的形态/图样。"}]}],"synonyms":["double-crescent-shaped","two-crescent","crescent-shaped (in a double form)"],"phonetic":"ˌbaɪkrɛsənˈtɪk","extraExplanation":["“bicrescentic”是较少见的技术词：bi- 表示“二、双”，crescent 表示“新月形”，-ic 构成形容词，合起来就是“由两个新月形构成/呈双新月形”。","多见于医学、病理学或生物学写作中，用来描述显微形态或结构外观。日常英语中几乎不用，更常见的说法是 double‑crescent‑shaped（双新月形的）或 two crescent‑shaped …（两个新月形的……）。"]}
{"word":"bicrofarad","summary":{"en":"Microfarad (µF) is a capacitance unit equal to 10⁻⁶ farad.","zh":"Microfarad（µF，微法）是电容单位，等于 10⁻⁶ 法拉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a unit of electrical capacitance equal to one millionth (10⁻⁶) of a farad; written as µF","zh":"电容单位“微法”，等于 10⁻⁶（百万分之一）法拉，常写作 µF（或 uF）"},"examples":[{"en":"This capacitor is rated at 10 µF.","zh":"这个电容的额定容量是 10 微法（10 µF）。"},{"en":"A 0.1 µF capacitor is often used to reduce electrical noise.","zh":"0.1 微法的电容常用于降低电噪声。"}]}],"synonyms":["microfarad","µF","uF"],"phonetic":"/ˌmaɪkroʊˈfærəd/","extraExplanation":["“bicrofarad”不是常见或标准的英文单位写法；你可能想写的是 **microfarad**（微法）。在键盘上没有“µ”时，工程里也常写 **uF** 来代替 **µF**。"]}
{"word":"bicron","summary":{"en":"“Bicron” is an informal media/online term for a supposed mix involving Omicron (often with Delta), not an official variant name.","zh":"“Bicron”是媒体/网络上的非正式说法，用来指代与奥密克戎（常与德尔塔）相关的“混合”，并非官方变异株名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an informal, non-scientific nickname used online or in some media to suggest a combined or mixed COVID-19 infection/variant involving (especially) Omicron and another variant (often Delta); not an official variant name","zh":"（非正式、非科学用语）网络或部分媒体用来指代“混合/合并的”新冠感染或变异株的说法，通常暗指奥密克戎与另一种变异株（常见为德尔塔）的组合；并非官方变异株名称"},"examples":[{"en":"Some posts used the word “bicron” to talk about possible Delta–Omicron co-infections.","zh":"一些帖子用“bicron”来讨论可能出现的“德尔塔—奥密克戎”共同感染。"},{"en":"Health agencies generally avoid terms like “bicron” and use formal lineage names instead.","zh":"卫生机构通常不会使用“bicron”这类称呼，而是使用正式的谱系命名。"}]}],"synonyms":["(informal) deltacron","co-infection","recombinant variant"],"phonetic":"/ˈbaɪkrɑːn/","extraExplanation":["“bicron”常被理解为“bi-（双/两种）+ Omicron（奥密克戎）”的拼合词，但它不是WHO或科研机构的正式命名。","在公共卫生语境中，更严谨的表达通常是“co-infection（共同感染）”“recombination（重组）”或具体的谱系编号（如某些以X开头的重组谱系）。","遇到此类媒体造词时，建议查看其是否指（1）同一人同时感染两种变异株，（2）病毒发生重组后形成的新谱系，二者含义不同。"]}
{"word":"bicrons","summary":{"en":"“Bicrons” is a rare, nonstandard term meaning “two microns” (2 μm).","zh":"“bicrons”较罕见且不够规范，通常表示“2 微米（2 μm）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an uncommon way to say “two microns” (two micrometers), used in some technical contexts to describe a thickness or particle size of about 2 μm","zh":"一种不常见的说法，表示“两个微米”（2 μm），有时在技术语境中用来描述厚度或颗粒大小约为 2 微米"},"examples":[{"en":"The filter is rated at about two microns (sometimes written as “bicrons” in older notes).","zh":"这个过滤器的等级大约是 2 微米（在一些较旧的笔记里有时会写成“bicrons”）。"},{"en":"Particles around 2 μm can be hard to see without a microscope.","zh":"大约 2 微米的颗粒不借助显微镜很难看见。"}]}],"synonyms":["two microns","2 microns","2 μm"],"phonetic":"/ˈbaɪkrɑnz/","extraExplanation":["“micron”是“micrometer（微米）”的旧称/简写，符号是 μm，1 μm = 0.001 毫米。现代写法更常用“micrometer”或直接写“2 μm / two microns”。","“bicrons”不是标准计量单位名称，更像是“bi-（二）+ micron（微米）”的临时合成写法；在正式论文、技术规格书中建议避免。"]}
{"word":"bicrural","summary":{"en":"“Bicrural” means “having two legs” or “related to both legs,” mainly in technical/anatomy contexts.","zh":"“Bicrural”指“有两条腿的”或“与双腿有关的”，多用于专业/解剖医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two legs; relating to both legs (often used in anatomy or medicine).","zh":"有两条腿的；与双腿有关的（常见于解剖学或医学语境）。"},"examples":[{"en":"Humans are naturally bicrural, meaning we have two legs.","zh":"人类天生是“两足的”（bicrural），也就是有两条腿。"},{"en":"The therapist focused on bicrural strength and balance exercises.","zh":"治疗师重点安排了增强双腿力量与平衡的训练。"}]}],"synonyms":["two-legged","bipedal","bilateral (of the legs)"],"phonetic":"/baɪˈkrʊrəl/","extraExplanation":["词源上可拆为 bi-（“二、双”）+ crural（与腿有关，来自拉丁语 crus “腿”）。在日常英语里更常见的说法是 two-legged 或 bipedal；bicrural 更偏专业、书面或医学用语。"]}
{"word":"BICS","summary":{"en":"BICS means everyday conversational language skills used in social situations, often easier and faster to develop than academic language.","zh":"BICS指日常社交场景中的会话语言能力，通常比学术语言更容易、更快发展。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Basic Interpersonal Communicative Skills: everyday social language ability used for casual conversation and simple interactions, often supported by context (gestures, shared situations, familiar topics).","zh":"基本人际沟通技能：用于日常社交与简单互动的语言能力，通常有情境支持（手势、共同场景、熟悉话题等）。"},"examples":[{"en":"Many multilingual students develop BICS quickly because they can practice it in daily life.","zh":"很多多语学生会较快发展BICS，因为他们能在日常生活中频繁练习。"},{"en":"A learner may sound fluent in BICS but still struggle with academic writing.","zh":"学习者可能在BICS上听起来很流利，但在学术写作上仍然吃力。"}]},{"partOfSpeech":"n.","definition":{"en":"(In education/linguistics) A term used to contrast everyday conversational fluency with academic language proficiency (often contrasted with CALP).","zh":"（教育/语言学）用于区分“日常会话流利度”和“学术语言能力”的术语（常与CALP对比）。"},"examples":[{"en":"Teachers should assess both BICS and CALP when supporting English learners.","zh":"教师在支持英语学习者时，应同时关注BICS和CALP。"},{"en":"The BICS/CALP distinction is common in discussions of second-language learning.","zh":"BICS/CALP的区分常见于第二语言学习的讨论中。"}]}],"synonyms":["conversational fluency","social language","everyday communication skills","interpersonal communication"],"phonetic":"/bɪks/","extraExplanation":["BICS一词常与加拿大教育学者Jim Cummins相关，用来提醒人们：学生“会聊天”不等于“能用学术语言学习”。","BICS通常在有情境支持的交流中更容易表现出来；而CALP（学术语言能力）往往需要更长时间发展，尤其在阅读理解、写作、抽象概念表达等方面。","课堂上常见误区：因为学生口语社交很流利，就低估其学术语言支持需求。"]}
{"word":"bicuculline","summary":{"en":"Bicuculline is a neuroscience research chemical that blocks GABA_A receptors and reduces inhibition in the nervous system.","zh":"Bicuculline 是一种神经科学研究用化学物质，可阻断 GABA\u001d\u0000b5 受体，从而减弱神经系统的抑制作用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound used in neuroscience that blocks (antagonizes) GABA\u001d\u0000b5 receptors, which normally reduce nerve activity; it is often used in experiments to increase neuronal firing or to study inhibition in the brain.","zh":"一种用于神经科学研究的化学物质，可阻断（拮抗）GABA\u001d\u0000b5 受体；GABA\u001d\u0000b5 受体通常会抑制神经活动，因此它常用于实验中增强神经元放电或研究大脑中的抑制作用。"},"examples":[{"en":"In the lab, bicuculline is sometimes applied to brain slices to test how inhibitory signaling affects neural circuits.","zh":"在实验室里，有时会把 bicuculline 加到脑片上，用来测试抑制性信号如何影响神经回路。"},{"en":"Blocking GABA_A receptors with bicuculline can make neurons fire more easily.","zh":"用 bicuculline 阻断 GABA\u001d\u0000b5 受体会让神经元更容易放电。"}]}],"synonyms":["GABA_A receptor antagonist","GABA_A blocker"],"phonetic":"/ˌbaɪkjuːˈkjuːliːn/","extraExplanation":["bicuculline 是一种常见的研究工具药物，主要用于基础研究而非临床治疗；它通过抑制 GABA\u001d\u0000b5 受体介导的“抑制性”神经传递，使神经系统整体更兴奋。","这个词多见于神经科学、药理学论文与实验方法部分；日常英语中几乎不会用到。"]}
{"word":"bicultural","summary":{"en":"Bicultural describes something or someone connected with two cultures.","zh":"Bicultural 指与两种文化相关或具有双文化背景/视角。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or including two cultures; having experience or identity connected to two cultures.","zh":"与两种文化有关的；包含两种文化的；具有双文化背景或身份认同的。"},"examples":[{"en":"She grew up in a bicultural family, speaking Spanish at home and English at school.","zh":"她在一个双文化家庭中长大，在家说西班牙语，在学校说英语。"},{"en":"The program supports bicultural students who are adjusting to life in a new country.","zh":"这个项目帮助双文化学生适应在新国家的生活。"},{"en":"His bicultural perspective helps him understand both sides in the conversation.","zh":"他的双文化视角帮助他理解对话中的双方。"}]}],"synonyms":["cross-cultural","multicultural (broader)","binational (sometimes)"],"phonetic":"/ˌbaɪˈkʌltʃɚəl/","extraExplanation":["“bicultural”由前缀 bi-（“两个”）+ cultural（“文化的”）构成，常用于描述个人身份（bicultural identity）、家庭/婚姻（bicultural marriage）、教育与社区服务（bicultural education / bicultural counseling）。","语气通常是中性或积极的，强调“能在两种文化之间理解、转换与融合”。在一些语境里也可能暗含挑战，如价值观冲突或“夹在中间”的感受。","相关词：multicultural（多元文化的，涉及两种以上文化）；cross-cultural（跨文化的，强调比较/交流）；biracial（双种族的，侧重种族而非文化）。"]}
{"word":"biculturalism","summary":{"en":"Biculturalism means living with or identifying with two cultures.","zh":"Biculturalism 指同时生活在或认同两种文化的状态/现象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The situation of living within or identifying with two cultures, often involving blending, balancing, or switching between cultural norms, values, and languages.","zh":"双文化（主义）：指一个人生活在两种文化中或同时认同两种文化，常需要在不同文化的规范、价值观与语言之间融合、平衡或切换。"},"examples":[{"en":"Her biculturalism helps her feel at home in both the U.S. and Taiwan.","zh":"她的双文化认同让她在美国和台湾都能感到自在。"},{"en":"Biculturalism can be an advantage at work because you understand different communication styles.","zh":"双文化背景在工作中可能是优势，因为你更理解不同的沟通方式。"},{"en":"He sometimes feels tension in his biculturalism when family expectations clash.","zh":"当家庭期待发生冲突时，他有时会在双文化身份中感到拉扯。"}]}],"synonyms":["double cultural identity","cultural hybridity","cultural duality"],"phonetic":"/ˌbaɪˈkʌltʃərəlɪzəm/","extraExplanation":["“biculturalism”常见于移民、跨国/跨族裔家庭、留学或跨文化教育等语境。它不一定等同于“multiculturalism（多元文化主义）”：multiculturalism强调社会中多种文化并存，而biculturalism更聚焦个体或群体与“两种”文化的联系与认同。","词形来源：bi-（两个）+ cultural（文化的）+ -ism（…主义/状态），通常指一种“状态/现象”，不一定是政治立场。常见搭配：bicultural identity（双文化身份）、bicultural experience（双文化经历）、bicultural competence（双文化能力）。"]}
{"word":"bicursal","summary":{"en":"Bicursal means “having two branches or paths,” mainly used in mathematical or technical contexts.","zh":"bicursal 意为“有两个分支/两条路径的”，主要见于数学或技术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having two branches or two paths; divided into two courses (often used in mathematics or technical writing).","zh":"（多用于数学或技术语境）有两个分支的；分成两条路径/两条走向的。"},"examples":[{"en":"The solution curve is bicursal, splitting into two branches near the critical point.","zh":"解曲线是双分支的，在临界点附近分成两条支路。"},{"en":"In the diagram, the flow becomes bicursal at the junction.","zh":"在图中，流动在交汇处变成双路径的。"}]}],"synonyms":["two-branched","bifurcated","two-pronged","branching"],"phonetic":"/baɪˈkɝːsəl/","extraExplanation":["“bicursal”由 bi-（二）+ curs-（跑、行进；同源于 course/cur-）构成，字面意思接近“沿两条路线走”。在现代英语中它非常少见，通常只在数学（如曲线/方程分支）或较正式的技术描述中出现。更常见的替代表达有 “two-branched / bifurcated / having two branches”。"]}
{"word":"bicurved","summary":{"en":"“Bicurved” describes something that is curved in two ways—on two sides or in two directions.","zh":"「bicurved」用來形容物體呈雙曲狀：在兩側或兩個方向上都有彎曲。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two curves; curved on two sides or in two directions.","zh":"雙曲的；具有兩道曲線的；在兩側或兩個方向上彎曲的。"},"examples":[{"en":"The bicurved lens helps focus light more efficiently.","zh":"這種雙曲鏡片能更有效地聚焦光線。"},{"en":"The architect designed a bicurved roof to improve airflow and strength.","zh":"建築師設計了雙曲屋頂，以改善氣流並提升結構強度。"},{"en":"Some leaves have a bicurved shape, bending gently in two directions.","zh":"有些葉子呈雙曲形狀，會在兩個方向上輕微彎曲。"}]}],"synonyms":["double-curved","curved on both sides","biconvex (more specific)","biconcave (more specific)"],"phonetic":"/baɪˈkɝvd/","extraExplanation":["「bicurved」常見於較正式或技術性的描述（如光學、工程、建築、幾何）。日常英文更常用「double-curved」或「curved on both sides」。","在光學裡，若要更精確，常用「biconvex（雙凸）」或「biconcave（雙凹）」來說明兩面各自是凸/凹；「bicurved」則較偏向籠統描述「有兩個曲率/兩側都彎」。"]}
{"word":"bicuspid","summary":{"en":"“Bicuspid” means “having two cusps,” most often referring to a premolar tooth or a two-flap heart valve.","zh":"“bicuspid”意为“有两个尖（牙尖/瓣尖）”，最常指前磨牙（双尖牙）或两瓣的心脏瓣膜。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two points (cusps); most commonly used for a tooth with two main biting points (especially a premolar), or for a heart valve with two flaps.","zh":"有两个尖端（尖头）的；最常指有两个主要咬合尖的牙（尤其是前磨牙），或指有两瓣的心脏瓣膜。"},"examples":[{"en":"The dentist said I have a cavity in my upper bicuspid.","zh":"牙医说我上颌的一颗前磨牙（双尖牙）有蛀牙。"},{"en":"A bicuspid aortic valve can sometimes cause heart problems later in life.","zh":"二叶式主动脉瓣有时会在日后引发心脏问题。"}]},{"partOfSpeech":"n.","definition":{"en":"A tooth with two cusps; commonly, a premolar.","zh":"双尖牙；通常指前磨牙。"},"examples":[{"en":"She got a filling on a bicuspid.","zh":"她的一颗双尖牙补了牙。"},{"en":"Premolars are also called bicuspids in some contexts.","zh":"在某些语境中，前磨牙也被称为双尖牙。"}]}],"synonyms":["two-cusped","premolar (in dental context)"],"phonetic":"/baɪˈkʌs.pɪd/","extraExplanation":["词源小提示：bi- 表示“二”，cuspid 来自表示“尖端/尖头”的词根（与 cusp 同源），所以字面意思就是“两个尖”。在医学与牙科里，这个词很常见：牙科多指“前磨牙”，心脏科则常见于 “bicuspid aortic valve（二叶式主动脉瓣）”。"]}
{"word":"bicuspidal","summary":{"en":"Bicuspidal means “having two cusps,” often used in medical or dental contexts.","zh":"bicuspidal 表示“有两个尖突的（双尖的）”，常用于牙科或医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two cusps (two pointed parts); especially describing certain teeth or heart valves.","zh":"有两个尖（两个尖突/尖端）的；尤指（某些）牙齿或心脏瓣膜的“双尖”的。"},"examples":[{"en":"A bicuspidal tooth helps you chew by crushing food between two points.","zh":"双尖牙通过两个尖端夹压食物，帮助你咀嚼。"},{"en":"The doctor said the patient has a bicuspidal aortic valve.","zh":"医生说患者的主动脉瓣是双尖瓣。"}]}],"synonyms":["bicuspid","two-cusped"],"phonetic":"/baɪˈkʌspɪdəl/","extraExplanation":["“bicuspidal”来自 bi-（两、双）+ cusp（尖端/尖突）。在日常英语里，人们更常用 bicuspid（双尖牙/双尖的）或说 a bicuspid aortic valve（主动脉双尖瓣），而 bicuspidal 更偏医学/解剖学书面用语。"]}
{"word":"bicuspidate","summary":{"en":"“Bicuspidate” means having two sharp points or cusps, used mostly in scientific descriptions.","zh":"“bicuspidate”指“具两尖/两突起的（双尖的）”，多用于科学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two points, tips, or cusps (sharp projections), especially in biology or botany.","zh":"（尤用于生物学/植物学）具两尖/两端/两突起的；双尖的。"},"examples":[{"en":"The leaf tip is bicuspidate, ending in two small points.","zh":"这片叶子的顶端是双尖的，末端有两个小尖。"},{"en":"Under the microscope, the structure appears bicuspidate rather than rounded.","zh":"在显微镜下，这个结构看起来是双尖的，而不是圆形的。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to something that resembles a two-cusped tooth (a bicuspid/premolar).","zh":"与双尖牙（前磨牙）相似的；呈双尖牙形态的。"},"examples":[{"en":"The fossil shows a bicuspidate crown shape similar to a premolar.","zh":"这块化石显示出类似前磨牙的双尖牙冠形态。"}]}],"synonyms":["two-pointed","two-tipped","two-cusped"],"phonetic":"/baɪˈkʌspɪˌdeɪt/","extraExplanation":["“bicuspidate”来自拉丁语：bi-（二）+ cuspis（尖点、矛尖）+ -ate（形容词后缀），字面意思就是“有两个尖/突起”。","这个词比较书面和专业，常见于植物形态描述、动物解剖学或化石/牙齿形态学写作；日常英语里通常会用“two-pointed / having two tips”来表达。"]}
{"word":"bicuspids","summary":{"en":"Bicuspids are premolar teeth between the canines and molars, used for chewing.","zh":"Bicuspids 指双尖牙（前磨牙），位于犬齿与磨牙之间，用于咀嚼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Back teeth (premolars) between the canines and molars; they usually have two cusps (raised points) for chewing.","zh":"双尖牙（前磨牙）：位于犬齿与磨牙之间的后牙，通常有两个牙尖，用于咀嚼。"},"examples":[{"en":"The dentist said my bicuspids are healthy, but I should floss more around them.","zh":"牙医说我的双尖牙很健康，但我需要在它们周围更认真地用牙线。"},{"en":"She had braces to straighten her bicuspids and molars.","zh":"她戴牙套来矫正双尖牙和磨牙。"}]}],"synonyms":["premolars"],"phonetic":"/baɪˈkʌspɪdz/","extraExplanation":["“Bicuspids”通常指复数（两侧各有多颗），在日常英语里也常直接说“premolars（前磨牙）”。严格来说，并不是所有前磨牙都一定只有两个牙尖，但“bicuspid（双尖牙）”在口语和牙科语境中仍常被用来泛指前磨牙。"]}
{"word":"bicyanide","summary":{"en":"Bicyanide is a chemistry term for something that contains two cyanide (–C≡N) groups or two cyanide units.","zh":"bicyanide 是化学术语，指含两个氰基（–C≡N）或两个氰根单位的物质/离子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical species containing two cyanide groups (–C≡N), or a salt/ion in which two cyanide units are present.","zh":"（化学）含有两个氰基（–C≡N）的化学物种；也可指含两个氰根单位的离子或其盐。"},"examples":[{"en":"In coordination chemistry, a bicyanide ligand can bind to a metal ion through its nitrogen atoms.","zh":"在配位化学中，双氰配体可以通过氮原子与金属离子配位结合。"},{"en":"The report mentions bicyanide compounds as potential intermediates in the reaction.","zh":"报告提到双氰化合物可能是该反应中的中间体。"}]}],"synonyms":["dicyanide","cyanide (general term)"],"phonetic":"/baɪˈsaɪənaɪd/","extraExplanation":["“bicyanide”不是日常英语常用词，更常见的相关说法包括“dicyanide（双氰化物/双氰根）”或直接用具体名称（如某种金属的氰配合物）。","注意：含“cyanide（氰化物）”的物质往往具有毒性风险，但是否危险取决于具体化合物与化学形态；阅读资料时应结合上下文与安全说明。"]}
{"word":"bicycle","summary":{"en":"A bicycle is a two-wheeled vehicle you ride by pedaling; it can also mean to ride/travel by bike.","zh":"bicycle 指“自行车”，也可作动词表示“骑自行车/用自行车出行”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A vehicle with two wheels that you ride by pedaling, usually with handlebars for steering.","zh":"自行车；一种有两个轮子、通过踩踏板骑行、通常用车把转向的交通工具。"},"examples":[{"en":"I go to school by bicycle when the weather is nice.","zh":"天气好的时候，我骑自行车去上学。"},{"en":"She bought a new bicycle with a basket on the front.","zh":"她买了一辆新的自行车，前面有个篮子。"},{"en":"Please lock your bicycle outside the library.","zh":"请把自行车锁在图书馆外面。"}]},{"partOfSpeech":"v.","definition":{"en":"To travel by bicycle; to ride a bicycle.","zh":"骑自行车；用自行车出行。"},"examples":[{"en":"We bicycled along the river for an hour.","zh":"我们沿着河边骑了一个小时的自行车。"},{"en":"He bicycles to work to save money and stay healthy.","zh":"他骑自行车上班，既省钱又健康。"}]}],"synonyms":["bike","cycle"],"phonetic":"/ˈbaɪsɪkəl/","extraExplanation":["“bicycle”来自 bi-（两个）+ cycle（轮子/循环），字面意思是“两轮车”。","日常英语里更口语的说法常用 “bike”。“ride a bike”也非常常见；动词 “bicycle”较正式。","常见搭配：bicycle lane（自行车道）、bicycle rack（自行车停放架）、mountain bike（山地车）、road bike（公路车）。"]}
{"word":"bicycle-related","summary":{"en":"Bicycle-related means connected with bicycles or cycling.","zh":"bicycle-related 表示“与自行车或骑行有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with bicycles; involving bicycles or cycling.","zh":"与自行车有关的；涉及骑行或自行车的。"},"examples":[{"en":"The city added more bicycle-related lanes to reduce traffic.","zh":"这座城市增设了更多与自行车有关的车道来缓解交通。"},{"en":"He suffered a bicycle-related injury during the race.","zh":"他在比赛中遭遇了与骑自行车有关的伤害。"},{"en":"We’re discussing bicycle-related safety rules in class today.","zh":"我们今天在课堂上讨论与自行车有关的安全规则。"}]}],"synonyms":["cycling-related","bike-related","bicycle-associated","bicycle-connected"],"phonetic":"/ˈbaɪsɪkəl rɪˈleɪtɪd/","extraExplanation":["“bicycle-related”是一个常见的复合形容词，通常用连字符连接，表示“与……相关的”。在名词前作定语时更常见：bicycle-related accidents / bicycle-related policies。","写作时也可根据风格写成“bicycle related”（较少见）或“bicycle-related”（更清晰、常用）。"]}
{"word":"bicycled","summary":{"en":"“Bicycled” means “rode a bicycle” (past tense/participle).","zh":"“bicycled”表示“骑自行车”（过去式/过去分词）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “bicycle”: to ride a bicycle.","zh":"“bicycle”的过去式和过去分词：骑自行车。"},"examples":[{"en":"I bicycled to work yesterday because the weather was nice.","zh":"昨天天气很好，所以我骑自行车去上班。"},{"en":"She has bicycled across the city many times.","zh":"她已经多次骑自行车穿过这座城市。"},{"en":"We bicycled along the river after dinner.","zh":"晚饭后我们沿着河边骑自行车。"}]}],"synonyms":["biked","rode a bike"],"phonetic":"/ˈbaɪsɪkəld/","extraExplanation":["“bicycle”既可以作名词（自行车），也可以作动词（骑自行车）。在美式英语里，日常口语更常说“rode my bike / biked”，而“bicycled”更正式一些，常见于书面表达或较正式的叙述。"]}
{"word":"bicycler","summary":{"en":"Bicycler means a person who rides a bicycle; ‘cyclist’ is more common.","zh":"bicycler 指“骑自行车的人”；更常见的说法是 cyclist。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who rides a bicycle; a cyclist.","zh":"骑自行车的人；自行车骑行者。"},"examples":[{"en":"More bicyclers are using bike lanes during rush hour.","zh":"在高峰时段，更多骑自行车的人使用自行车道。"},{"en":"The park is popular with walkers and bicyclers.","zh":"这个公园很受步行者和骑自行车的人欢迎。"}]}],"synonyms":["cyclist","bike rider"],"phonetic":"/ˈbaɪsɪkələr/","extraExplanation":["“bicycler”可以理解为“骑自行车的人”，但在现代英语里更常用的说法是“cyclist”。“bicycler”听起来更直白、口语化一些，有时也用于需要强调“骑的是自行车（bicycle）”的语境。","词形上，“bicycler”来自“bicycle + -er（表示做某事的人）”。类似构词：runner（跑步者）、driver（司机）。","相关表达：bike rider（骑车者，较口语）、cycle commuter（骑车通勤者）、mountain biker（山地车骑行者）。"]}
{"word":"bicyclers","summary":{"en":"“Bicyclers” means people who ride bicycles (cyclists).","zh":"“bicyclers”指骑自行车的人（骑行者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who rides a bicycle; a cyclist (plural form of “bicycler”)","zh":"骑自行车的人；自行车骑行者（“bicycler”的复数）"},"examples":[{"en":"The park is busy with runners and bicyclers on weekends.","zh":"周末公园里有很多跑步的人和骑自行车的人。"},{"en":"Please slow down when passing other bicyclers on the trail.","zh":"在小路上超过其他骑行者时请减速。"}]}],"synonyms":["cyclists","bicyclists","riders"],"phonetic":"/ˈbaɪˌsaɪkəlɚ/","extraExplanation":["“bicycler”在美式英语中能用，但更常见、更自然的说法是“cyclist”或“bicyclist”。在正式写作、新闻报道和交通提示中，通常更偏好用“cyclist / cyclists”。"]}
{"word":"bicycles","summary":{"en":"“Bicycles” means more than one bicycle (two-wheeled pedal vehicles).","zh":"“bicycles”表示不止一辆自行车（两轮脚踏交通工具）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A bicycle; a vehicle with two wheels that you ride by pushing pedals with your feet.","zh":"自行车；一种有两个轮子、用脚踩踏板骑行的交通工具。"},"examples":[{"en":"Many students ride bicycles to school.","zh":"很多学生骑自行车上学。"},{"en":"She locked her bicycle outside the library.","zh":"她把自行车锁在图书馆外面。"},{"en":"Riding bicycles is a healthy way to travel short distances.","zh":"骑自行车是短途出行的健康方式。"}]},{"partOfSpeech":"other","definition":{"en":"The plural form of “bicycle.”","zh":"“bicycle”的复数形式。"},"examples":[{"en":"There are several bicycles in the garage.","zh":"车库里有几辆自行车。"},{"en":"The shop sells bicycles and helmets.","zh":"这家店卖自行车和头盔。"}]}],"synonyms":["bikes"],"phonetic":"/ˈbaɪsɪkəlz/","extraExplanation":["“bicycle”常见口语说法有：bike（更口语、更常用）。在美式英语里也会说ride a bike / ride a bicycle。","注意：虽然“bicycles”本身是复数名词，但也常出现在复合名词里作修饰语，比如 bicycle lane（自行车道）、bicycle shop（自行车店）。这类用法通常仍用单数bicycle作定语。"]}
{"word":"bicyclette","summary":{"en":"“Bicyclette” is the French word for “bicycle.”","zh":"“bicyclette”是法语里“自行车”的意思。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(French) a bicycle; a two-wheeled vehicle you ride by pedaling.","zh":"（法语）自行车；一种靠踩踏板前进的两轮交通工具。"},"examples":[{"en":"In French class, we learned that “bicyclette” means “bicycle.”","zh":"在法语课上，我们学到“bicyclette”意思是“自行车”。"},{"en":"She rode her bicyclette through the village streets.","zh":"她骑着她的自行车穿过村庄的街道。"}]}],"synonyms":["bicycle","bike","vélo"],"phonetic":"/ˌbaɪsɪˈklɛt/","extraExplanation":["“bicyclette”是法语的日常用词，相当于英语“bicycle”。在法语里更口语、更常见的说法还有“vélo”。","这个词在英语中并不常用；英语里一般直接说“bicycle”或口语“bike”。"]}
{"word":"bicyclic","summary":{"en":"Bicyclic means “having two connected rings,” most often describing a chemical structure.","zh":"bicyclic 指“具有两个相连环结构的”，多用于化学领域描述分子结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two connected rings (cycles) in its structure, especially in chemistry.","zh":"（尤指化学中）具有两个相连环（环状结构）的；双环的。"},"examples":[{"en":"Camphor is a bicyclic compound with a strong smell.","zh":"樟脑是一种具有强烈气味的双环化合物。"},{"en":"The drug’s bicyclic structure helps it fit the receptor better.","zh":"该药物的双环结构有助于它更好地与受体结合。"}]}],"synonyms":["two-ring","two-cyclic"],"phonetic":"/baɪˈsaɪklɪk/","extraExplanation":["词源拆解：bi- 表示“两个”，cycle/cyclic 表示“环、循环”。因此 bicyclic 直观含义就是“有两个环的”。","常见于有机化学与药物化学，用来描述分子骨架；与 monocyclic（单环）、polycyclic（多环）相对。"]}
{"word":"bicyclical","summary":{"en":"Bicyclical most commonly means “bicyclic” (having two connected rings) in chemistry; it is rarely used to mean “related to bicycles.”","zh":"bicyclical 最常见于化学语境，意为“具有两个相连环结构的（双环的）”；表示“与自行车有关”时很少用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Having two connected rings in its molecular structure; bicyclic.","zh":"（化学）具有两个相互连接的环状结构的；双环的。"},"examples":[{"en":"Camphor is a bicyclical compound with a distinctive smell.","zh":"樟脑是一种双环化合物，带有明显的气味。"},{"en":"The drug’s bicyclical framework makes it more rigid and stable.","zh":"这种药物的双环骨架使它更刚性、更稳定。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to bicycles or bicycling (uncommon; usually people say “bicycle” as an adjective, or “cycling”).","zh":"与自行车或骑行有关的（不常用；更常见说法是用“bicycle”作形容词，或用“cycling”）。"},"examples":[{"en":"The city invested in bicycle lanes to support cycling commuters.","zh":"这座城市投资修建自行车道，以支持骑行通勤者。"},{"en":"She prefers a cycling vacation over a bus tour.","zh":"比起大巴旅行，她更喜欢骑行度假。"}]}],"synonyms":["bicyclic","two-ringed","cycling (for bicycle-related meaning)"],"phonetic":"/ˌbaɪˈsaɪklɪkəl/","extraExplanation":["在英语里更常见的形式是 **bicyclic**（双环的），尤其用于化学与药学语境；而日常谈“自行车相关”时，通常直接用 **bicycle + 名词**（bicycle lane 自行车道）或用 **cycling**（cycling culture 骑行文化）。","不要把 **bicyclical** 误当作表示“每两年一次”的词；“每两年一次”通常是 **biennial**（两年一次）或 **biannual**（一年两次，易混淆）。"]}
{"word":"bicycling","summary":{"en":"Bicycling means riding a bicycle, either as an activity/sport or as the -ing form of the verb “bicycle.”","zh":"bicycling 指骑自行车，可表示一项活动/运动，也可作动词 bicycle 的 -ing 形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity or sport of riding a bicycle","zh":"骑自行车（这项活动或运动）"},"examples":[{"en":"Bicycling is a great way to exercise without putting too much stress on your joints.","zh":"骑自行车是很好的运动方式，而且对关节的压力不大。"},{"en":"More people started bicycling to work after the city built bike lanes.","zh":"城市修建自行车道后，更多人开始骑车通勤。"}]},{"partOfSpeech":"v.","definition":{"en":"riding a bicycle (often used as the present participle of “bicycle”)","zh":"骑自行车（常作动词 bicycle 的现在分词）"},"examples":[{"en":"She was bicycling down the hill when it started to rain.","zh":"她正骑车下坡时，开始下雨了。"},{"en":"We spent the afternoon bicycling along the river.","zh":"我们花了一下午沿着河边骑车。"}]}],"synonyms":["cycling","bike riding","riding a bike"],"phonetic":"/ˈbaɪsɪklɪŋ/","extraExplanation":["在美式英语里，“bicycling”常用来指“骑行”这项活动（名词用法），语气比“cycling”更明确是“骑自行车”（而不是泛指骑行运动）。","“bicycling”在书面语和公共健康/城市交通语境中很常见，比如：promote bicycling（推广骑行）、bicycling safety（骑行安全）、bicycling infrastructure（骑行基础设施）。"]}
{"word":"bicyclism","summary":{"en":"Bicyclism means the activity or sport of riding a bicycle (cycling).","zh":"bicyclism 指“骑自行车的活动或运动”，相当于 cycling。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The activity or sport of riding a bicycle; cycling.","zh":"骑自行车的活动或运动；自行车运动。"},"examples":[{"en":"Bicyclism is a popular way to commute in many cities.","zh":"在许多城市，骑自行车是一种很受欢迎的通勤方式。"},{"en":"He took up bicyclism to improve his fitness.","zh":"他开始骑自行车来提高体能。"}]}],"synonyms":["cycling","bike riding","biking"],"phonetic":"/ˈbaɪsɪklɪzəm/","extraExplanation":["“bicyclism”相对比较少见，更常用的说法是 **cycling**（英式/美式都常见）或 **bike riding**（更口语）。","词形来源：bicycle（自行车）+ -ism（表示“活动/体系/主义”的后缀）。在一些较正式的语境里也可看到，如体育、交通或学术文章中。"]}
{"word":"bicyclist","summary":{"en":"A bicyclist is someone who rides a bicycle, especially on roads or in traffic.","zh":"bicyclist 指骑自行车的人，尤其强调在道路交通中骑行的骑行者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who rides a bicycle, especially as a regular activity or in traffic","zh":"骑自行车的人；（尤指）经常骑车或在道路交通中骑行的骑行者"},"examples":[{"en":"The bicyclist signaled before turning left.","zh":"那位骑行者在左转前打了转向手势。"},{"en":"Drivers should give a bicyclist plenty of space.","zh":"司机应当给骑自行车的人留出充足空间。"}]}],"synonyms":["cyclist","bike rider"],"phonetic":"/ˈbaɪsɪklɪst/","extraExplanation":["“bicyclist”常见于交通安全、新闻报道和法律语境中，强调道路上的“交通参与者”身份；日常口语里也常说“cyclist”。在英式英语中，“cyclist”更常用；在美式英语里两者都常见，但“bicyclist”更明确指“骑自行车的人”（而不含骑摩托或一般“骑行者”的可能）。","词形：bicycle（自行车）+ -ist（表示从事某活动的人，如 pianist 钢琴家、artist 艺术家）。"]}
{"word":"bicyclists","summary":{"en":"“Bicyclists” means people who ride bicycles; it is the plural of “bicyclist.”","zh":"“bicyclists”指骑自行车的人，是“bicyclist”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who ride bicycles, especially as a regular activity or for sport","zh":"骑自行车的人；（尤指）经常骑车的人或骑行运动者"},"examples":[{"en":"Bicyclists should wear helmets for safety.","zh":"骑自行车的人为了安全应该戴头盔。"},{"en":"The city built new bike lanes to protect bicyclists.","zh":"这座城市修建了新的自行车道来保护骑行者。"}]}],"synonyms":["cyclists","bike riders"],"phonetic":"/ˈbaɪsɪklɪsts/","extraExplanation":["“bicyclist”是由“bicycle（自行车）+ -ist（表示从事某活动的人）”构成，类似的词还有“artist（艺术家）”“tourist（游客）”。","在日常英语里，“cyclist”更常见也更简洁；“bicyclist”更强调“骑的是自行车”，有时用于交通法规、新闻或需要避免歧义（比如与摩托车、自行车共享“cycle”一词的语境）。"]}
{"word":"bicyclo","summary":{"en":"“Bicyclo-” is a chemistry combining form meaning “bicyclic,” used in names of molecules with two connected rings.","zh":"“bicyclo-”是化学中的构词成分，意思是“双环的”，用于命名含两个相连环结构的分子。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a combining form used in chemistry (especially organic chemistry) meaning “bicyclic,” describing a molecule that has two linked rings","zh":"（化学，尤指有机化学）构词成分，表示“双环的/含两个相连环结构的”，用来描述具有两个连在一起环状结构的分子"},"examples":[{"en":"Bicyclo[2.2.1]heptane is a common bicyclic framework in organic chemistry.","zh":"bicyclo[2.2.1]heptane（双环[2.2.1]庚烷）是有机化学中常见的双环骨架。"},{"en":"The name starts with “bicyclo-” to show the compound has two connected rings.","zh":"名称以“bicyclo-”开头，表示该化合物有两个相连的环。"}]}],"synonyms":["bicyclic"],"phonetic":"ˌbaɪˈsaɪkloʊ","extraExplanation":["在 IUPAC 命名里，bicyclo[x.y.z] 用来说明双环系统中“桥”的长度：x、y、z 表示两“桥头原子”（bridgehead atoms）之间三条路径上分别有多少个原子（不包括桥头原子本身），并且通常按从大到小排列。这个写法主要出现在专业化学语境中，日常英语里很少单独使用 “bicyclo”。"]}
{"word":"bicycloheptane","summary":{"en":"Bicycloheptane is a seven‑carbon bicyclic alkane, most often meaning bicyclo[2.2.1]heptane (norbornane).","zh":"bicycloheptane 指七碳的双环烷烃，最常特指二环[2.2.1]庚烷（降冰片烷）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bicyclic saturated hydrocarbon with seven carbon atoms; most commonly it refers to bicyclo[2.2.1]heptane (also called norbornane) in organic chemistry.","zh":"一种含有七个碳原子的双环饱和烃；在有机化学中最常指“二环[2.2.1]庚烷”（也叫降冰片烷）。"},"examples":[{"en":"Norbornane is another name for bicyclo[2.2.1]heptane.","zh":"Norbornane（降冰片烷）是 bicyclo[2.2.1]heptane（二环[2.2.1]庚烷）的另一个名称。"},{"en":"Researchers use bicycloheptane frameworks as rigid shapes when designing new molecules.","zh":"研究人员在设计新分子时，会用 bicycloheptane（双环庚烷）骨架作为“刚性结构”。"}]}],"synonyms":["bicyclo[2.2.1]heptane","norbornane"],"phonetic":"/ˌbaɪˌsaɪkloʊˈhɛpˌteɪn/","extraExplanation":["“bicycloheptane”主要是化学命名用语：bicyclo- 表示“双环”，heptane 表示“七个碳的饱和烃（烷烃）”。具体结构常写成 bicyclo[x.y.z]heptane，其中 x、y、z 表示三条桥链上的碳数；最常见的就是 bicyclo[2.2.1]heptane（norbornane）。","在很多课本或论文里，人们更常直接用 “norbornane / norbornyl” 来描述相关骨架与取代基。"]}
{"word":"bicycular","summary":{"en":"Bicycular is a rare adjective meaning “having two circles or cycles.”","zh":"bicycular 是个很少见的形容词，意思是“有两个圆（或两个循环）的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two circles or two circular parts; consisting of two cycles (rare).","zh":"（罕用）由两个圆（或两个圆形部分）组成的；具有两个循环的。"},"examples":[{"en":"The logo is bicycular, made of two overlapping rings.","zh":"这个标志是双圆形的，由两个重叠的圆环组成。"},{"en":"Some early geometry texts describe a bicycular curve using two arcs.","zh":"一些早期的几何学文本用两段圆弧来描述一种“双圆形”的曲线。"}]}],"synonyms":["bicircular","two-ringed","bicyclic (in chemistry)"],"phonetic":"/baɪˈsaɪkjələr/","extraExplanation":["“bicycular”在现代英语中非常少见，读者更常见的是：\n- “bicircular”（双圆的、由两个圆构成的）\n- “bicyclic”（化学中：双环的、含两个环结构的）\n- “bicycle / bicycling”（自行车/骑自行车相关）\n如果你想表达“与自行车有关”，通常不用“bicycular”，而用“bicycle”作定语（如“bicycle lane”自行车道）或用“cycling”相关词。"]}
{"word":"bicylindrical","summary":{"en":"Bicylindrical describes something that has or consists of two cylinders.","zh":"bicylindrical 用来描述“有两个圆柱/由两个圆柱组成”的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two cylinders; made of or shaped like two cylindrical parts.","zh":"双圆柱的；由两个圆柱部分构成的；呈两个圆柱形状的。"},"examples":[{"en":"The engineer designed a bicylindrical chamber to improve airflow.","zh":"工程师设计了一个双圆柱形腔体来改善气流。"},{"en":"This bicylindrical container has two connected tubes for storing different liquids.","zh":"这个双圆柱容器有两根相连的圆筒，用来储存不同的液体。"}]}],"synonyms":["two-cylinder","dual-cylinder","double-cylinder"],"phonetic":"/ˌbaɪsəˈlɪndrɪkəl/","extraExplanation":["“bicylindrical”由前缀“bi-”（表示“两个/双”）+ “cylindrical”（圆柱形的）组成，多见于工程、物理、几何等较专业的语境。日常英语里更常说“two-cylinder / dual-cylinder”或“two cylindrical parts”。"]}

