{"word":"BIE","summary":{"en":"BIE is usually an abbreviation; most commonly it means the U.S. Bureau of Indian Education, but it can have other meanings depending on context.","zh":"BIE通常是缩写；最常见指美国印第安教育局（Bureau of Indian Education），但也可能因语境不同而有其他含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbr.) Bureau of Indian Education: a U.S. federal agency that oversees education for Native American students through schools it operates or supports.","zh":"（缩写）美国印第安教育局：美国联邦机构，负责管理/支持面向美洲原住民学生的教育与相关学校。"},"examples":[{"en":"She works for the BIE and helps improve literacy programs in tribal schools.","zh":"她在BIE工作，帮助改善部落学校的读写项目。"},{"en":"The school receives funding through the BIE.","zh":"这所学校通过BIE获得经费支持。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Used in different fields to stand for other phrases (meaning depends on context).","zh":"（缩写）在不同领域也可能代表其他短语（具体含义取决于语境）。"},"examples":[{"en":"In this report, BIE refers to a Business Impact Estimate.","zh":"在这份报告中，BIE指“业务影响评估”。"},{"en":"Our district piloted a BIE program (bilingual immersion education).","zh":"我们学区试点了BIE项目（双语沉浸式教育）。"}]}],"phonetic":"/biː aɪ iː/","extraExplanation":["“BIE”最常见、最固定的一种用法是指美国的 Bureau of Indian Education（美国印第安教育局）。但在职场、教育、工程等语境里也可能是其他短语的缩写。若你告诉我你在哪里看到（例如政府网站、公司报告、学校文件），我可以帮你确定最准确的含义。"]}
{"word":"Biebel","summary":{"en":"“Biebel” is usually a misspelling of “Bible”: the Christian sacred book, or (figuratively) an authoritative guide.","zh":"“Biebel”通常是“Bible”的拼写错误：可指《圣经》，也可比喻某领域的权威指南。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled “Bible”) the sacred book of Christianity, made up of the Old Testament and the New Testament.","zh":"（通常拼作“Bible”）《圣经》：基督教的经典，由《旧约》和《新约》组成。"},"examples":[{"en":"Many families keep a Bible at home.","zh":"很多家庭会在家里放一本《圣经》。"},{"en":"She read a passage from the Bible in class.","zh":"她在课堂上读了一段《圣经》经文。"}]},{"partOfSpeech":"n.","definition":{"en":"a book or guide that is considered the most important and trusted source of information on a subject.","zh":"（比喻）某领域的“权威指南/百科全书”：被认为最重要、最可靠的参考书。"},"examples":[{"en":"For many cooks, that book is the bible of Italian cooking.","zh":"对很多厨师来说，那本书就是意大利料理的“圣经”（权威指南）。"},{"en":"This manual became the bible for new employees.","zh":"这本手册成了新员工的“圣经”（必备指南）。"}]}],"synonyms":["Scripture","the Good Book","guidebook","handbook"],"phonetic":"/ˈbaɪbəl/","extraExplanation":["“Biebel”在英语里不常见，通常是把“Bible”拼错了。标准拼写是 Bible。","“Bible”来自希腊语 biblía（意为“书”），因此也常被引申为“某领域最权威的书”。","写作时注意：指《圣经》通常要大写 Bible；比喻用法有时也大写，但更常见小写 bible（尤其在非正式语境）。"]}
{"word":"Bieber","summary":{"en":"“Bieber” most commonly refers to the Canadian pop singer Justin Bieber; it can also be a surname.","zh":"“Bieber”最常见是指加拿大流行歌手贾斯汀·比伯；也可以是一个姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Justin Bieber (born 1994), a Canadian pop singer known for global hit songs and strong influence on teen pop culture.","zh":"贾斯汀·比伯（Justin Bieber，1994年生），加拿大流行歌手，以多首全球热门歌曲和对青少年流行文化的影响而闻名。"},"examples":[{"en":"Bieber became famous after his early videos went viral online.","zh":"比伯在早期的视频在网上走红后成名。"},{"en":"Many fans grew up listening to Bieber’s music.","zh":"很多粉丝是在听比伯的音乐中长大的。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname) found in English-speaking contexts; it can refer to various people, not only the singer.","zh":"一个姓氏，在英语语境中可见；可指不同的人，不仅指那位歌手。"},"examples":[{"en":"Her last name is Bieber, but she isn’t related to the singer.","zh":"她的姓是Bieber，但她和那位歌手没有亲属关系。"},{"en":"Bieber is a surname of German origin in some families.","zh":"在一些家族中，Bieber是一个源自德语的姓氏。"}]}],"synonyms":["Justin Bieber","(surname) Bieber"],"phonetic":"/ˈbiːbɚ/","extraExplanation":["“Bieber”在日常英语里常直接指Justin Bieber本人；在媒体标题中也会用姓氏单独代指名人（类似“Taylor”“Adele”）。","他的粉丝常被称为“Beliebers”（由“believe + Bieber”组合而来），属于流行文化中的粉丝群体称呼。"]}
{"word":"bieberite","summary":{"en":"Bieberite is a mineral: hydrated cobalt sulfate, often pink or reddish.","zh":"Bieberite（比伯石）是一种矿物：水合硫酸钴，常呈粉红或红色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a pink to reddish mineral that is a hydrated cobalt sulfate (CoSO₄·7H₂O).","zh":"一种粉红到红色的矿物，为含结晶水的硫酸钴（CoSO₄·7H₂O）。"},"examples":[{"en":"Bieberite can form as an evaporite mineral in dry conditions.","zh":"比伯石可能在干燥环境中以蒸发岩矿物的形式形成。"},{"en":"The specimen’s pink crystals were identified as bieberite, a cobalt sulfate hydrate.","zh":"这块标本的粉红色晶体被鉴定为比伯石，一种水合硫酸钴。"}]}],"synonyms":["cobalt(II) sulfate heptahydrate","hydrated cobalt sulfate"],"phonetic":"/ˈbiːbɚˌaɪt/","extraExplanation":["“Bieberite”是矿物学名称，常见于地质/矿物鉴定语境中；日常英语里几乎不用。","它属于硫酸盐矿物，含有结晶水；在干旱、蒸发作用强的环境中更可能出现。","词源上通常认为与地名或人名有关（矿物常以发现地或相关人物命名），但在一般学习中记住它是“水合硫酸钴矿物”即可。"]}
{"word":"Biedermann","summary":{"en":"Biedermann can mean a conventional “respectable citizen” (often with an ironic tone), and it is also a German surname.","zh":"Biedermann既可指（常带讽刺的）循规蹈矩的“体面市民”，也可作为德国姓氏使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(German, often used in English writing) a “respectable, ordinary citizen,” especially someone who is conventional, self-satisfied, and unwilling to question society (similar to “philistine”).","zh":"（德语词，英语写作中偶见）“体面/规矩的普通市民”，尤指因循守旧、自满、不愿反思社会的人（近似“市侩/庸俗的俗人”）。"},"examples":[{"en":"He presents himself as a Biedermann—polite, respectable, and blind to what’s really happening.","zh":"他把自己塑造成一个Biedermann——礼貌体面，却对真正发生的事视而不见。"},{"en":"The novel criticizes the Biedermann mindset: comfort first, responsibility later.","zh":"这部小说批判了Biedermann式心态：先求安逸，责任靠后。"}]},{"partOfSpeech":"n.","definition":{"en":"a German surname (family name).","zh":"德国姓氏（人名）。"},"examples":[{"en":"The article quotes Professor Biedermann from the University of Zurich.","zh":"文章引用了苏黎世大学Biedermann教授的观点。"}]}],"synonyms":["philistine","conformist","bourgeois","square","respectable citizen"],"phonetic":"/ˈbiːdərmɑːn/","extraExplanation":["在德语文化里，“Biedermann”不仅是姓氏，也带有讽刺意味：表面正派、循规蹈矩，却可能缺乏警觉与道德勇气。","这一含义常让人联想到瑞士作家马克斯·弗里施（Max Frisch）的戏剧《Biedermann und die Brandstifter》（常译《毕德曼与纵火犯/纵火者》）：主角自认善良体面，却纵容危险进入家中，影射“平庸之恶”与社会的自欺。","它在语感上也接近“bourgeois（小市民的）/philistine（市侩的）/conformist（从众的）”，但“Biedermann”更强调“自以为正派”的讽刺效果。"]}
{"word":"Biedermeier","summary":{"en":"Biedermeier refers to a Central European style and period (1815–1848) known for simple, practical, middle-class design and a focus on domestic life.","zh":"Biedermeier指中欧（约1815–1848）的风格与文化时期，特点是朴素实用的中产审美，以及对家庭日常生活的关注。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"a style in Central Europe (especially German-speaking areas) in the early 1800s (about 1815–1848), known for simple, practical, middle-class taste in furniture, interior design, and art","zh":"（比德迈尔风格）19世纪上半叶（约1815–1848）中欧（尤其德语地区）流行的一种风格，以朴素、实用、偏中产阶级审美的家具、室内设计与艺术著称"},"examples":[{"en":"The museum displayed Biedermeier furniture with clean lines and light wood.","zh":"博物馆展出了比德迈尔风格家具，线条简洁、木色明亮。"},{"en":"Their apartment was decorated in a Biedermeier style—cozy, restrained, and practical.","zh":"他们的公寓采用比德迈尔风格装饰——温馨、克制而实用。"}]},{"partOfSpeech":"n.","definition":{"en":"the Biedermeier period or cultural movement in Central Europe (about 1815–1848), associated with domestic life and the growing middle class","zh":"（比德迈尔时期／文化潮流）指约1815–1848年中欧的一段文化时期，常与家庭生活和中产阶级兴起相关"},"examples":[{"en":"Writers of the Biedermeier often focused on everyday life rather than heroic politics.","zh":"比德迈尔时期的作家常聚焦日常生活，而非宏大的政治英雄叙事。"},{"en":"The exhibition explores Biedermeier in painting, literature, and design.","zh":"这场展览探讨了比德迈尔在绘画、文学与设计中的表现。"}]}],"synonyms":["Biedermeier style","early 19th-century bourgeois style","domestic classicism"],"phonetic":"ˈbiːdɚˌmaɪɚ","extraExplanation":["“Biedermeier”原本带有讽刺意味：它来自19世纪德国讽刺诗中一个虚构的“老实巴交的中产先生”（常译作“比德迈尔先生”），后来才变成中性甚至偏正面的艺术史术语，用来指那种低调、家庭化、讲究秩序与舒适的审美。","学习提示：在英语里它既可作名词（the Biedermeier = 该时期/潮流），也可作形容词（Biedermeier furniture / Biedermeier style）。首字母通常大写，因为它源自专名并指特定历史文化现象。"]}
{"word":"biedermeier","summary":{"en":"Biedermeier refers to an early 19th-century Central European style (and period) known for simple, comfortable, middle-class elegance.","zh":"Biedermeier 指19世纪初中欧的比德迈风格与比德迈时期，特点是简洁、舒适、偏中产阶级的朴素优雅。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a style of furniture, interior design, and decorative art from early 19th-century Central Europe, known for simple, practical elegance and clean lines","zh":"（比德迈风格）19世纪初中欧流行的家具、室内与装饰艺术风格，以简洁、实用、朴素优雅和线条干净著称"},"examples":[{"en":"Their living room is furnished in Biedermeier style, with light wood and simple shapes.","zh":"他们的客厅采用比德迈风格布置，用浅色木材和简洁的造型。"},{"en":"The museum has a collection of Biedermeier chairs and cabinets.","zh":"这家博物馆收藏了一批比德迈时期的椅子和橱柜。"}]},{"partOfSpeech":"n.","definition":{"en":"the Biedermeier period (about 1815–1848) in German-speaking Europe, often linked with middle-class domestic life and a preference for privacy and order","zh":"（比德迈时期）约1815—1848年德语地区的社会文化阶段，常与中产阶级家庭生活、重视私密与秩序的审美取向相关"},"examples":[{"en":"Many paintings from the Biedermeier era focus on everyday family scenes.","zh":"比德迈时期的许多绘画都聚焦日常家庭场景。"},{"en":"The novel is set in the Biedermeier period, where public politics felt distant from home life.","zh":"这部小说以比德迈时期为背景，在那个时代公共政治似乎与家庭生活相距甚远。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or characteristic of the Biedermeier style or period","zh":"比德迈风格的；比德迈时期的；具有比德迈特点的"},"examples":[{"en":"The apartment has a Biedermeier feel—calm, tidy, and comfortable.","zh":"这套公寓很有比德迈的感觉——宁静、整洁、舒适。"},{"en":"She prefers Biedermeier design to more ornate styles.","zh":"相比更繁复的风格，她更喜欢比德迈式设计。"}]}],"synonyms":["bourgeois (in cultural context)","early 19th-century Central European style","simple classicism (approx.)"],"phonetic":"/ˈbiːdərˌmaɪər/","extraExplanation":["“Biedermeier”一词最初带有讽刺意味，源自19世纪德国杂志中的虚构人物/笔名，用来调侃“循规蹈矩、保守的市民气”。后来这个词逐渐被用作中性术语，指代1815年维也纳会议后到1848年革命前的审美与生活方式。","学习提示：在英文中它常用于艺术史、设计史语境，可说“Biedermeier furniture / Biedermeier interior / the Biedermeier era”。首字母通常大写（尤其作专名或时期名称时）。"]}
{"word":"bieennia","summary":{"en":"Biennia means “two-year periods,” the plural of biennium, used mostly in formal contexts.","zh":"biennia 指“两个年头的时期/两年周期”，是 biennium 的复数，主要用于较正式的语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of biennium) periods of two years; two-year terms or cycles.","zh":"（biennium 的复数）两个年头的时期；两年一届/两年周期。"},"examples":[{"en":"The committee is appointed for successive biennia.","zh":"该委员会按连续的两年任期进行任命。"},{"en":"Funding plans are reviewed every two years, not every biennia.","zh":"资金计划每两年审查一次，而不是每个“两年周期”都审一次（此处强调用词差异）。"}]}],"synonyms":["two-year periods","two-year terms","two-year cycles"],"phonetic":"/baɪˈɛn.i.ə/","extraExplanation":["你输入的“bieennia”很可能是拼写错误，常见目标词是 **biennia**（biennium 的复数）或形容词 **biennial**（每两年的；两年一次的）。","**biennium** 常用于正式/学术/政府语境，指“连续两年构成的期间”（例如预算、任期、统计周期）；日常英语里更常直接说 **two-year period/term**。","易混词：**biannual** 通常指“一年两次”，而 **biennial** 指“每两年一次/持续两年的”。","发音提示：重音在第二音节：bi-**EN**-ni-a。"]}
{"word":"Biegel","summary":{"en":"Biegel is most commonly a surname; in some contexts it may be a nonstandard spelling of “bagel.”","zh":"Biegel 最常见是姓氏；在少数语境中也可能是 “bagel（贝果）” 的非标准拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A family name (surname).","zh":"姓氏（家族姓/人名中的姓）。"},"examples":[{"en":"Ms. Biegel will speak at the meeting today.","zh":"Biegel 女士今天会在会议上发言。"},{"en":"I found a book by someone named Biegel.","zh":"我找到了一本作者姓 Biegel 的书。"}]},{"partOfSpeech":"n.","definition":{"en":"A spelling variant or misspelling of “bagel” in some contexts (not standard).","zh":"在某些语境中可能是 “bagel（贝果）” 的变体拼写或拼写错误（不标准）。"},"examples":[{"en":"The menu says “biegel,” but they probably mean “bagel.”","zh":"菜单上写的是 “biegel”，但他们很可能想写的是 “bagel（贝果）”。"}]}],"phonetic":"/ˈbiːɡəl/","extraExplanation":["“Biegel”更常见于英文里的姓氏用法，而不是普通词汇。若你是在文章、名单、署名或邮件落款里看到它，通常应当按专有名词（姓）来理解并大写。","如果你是在餐饮菜单或食品语境里看到“Biegel”，有可能是把“bagel（贝果）”写错或用了不常见拼法；正式英语里更常写作“bagel”。","发音会因个人/家族而略有差异；若是人名，最可靠的方法是询问本人偏好的读法。"]}
{"word":"biehlenite","summary":{"en":"Biehlenite is a rare hydrated phosphate mineral name used in geology/mineralogy.","zh":"Biehlenite 是地质学/矿物学中使用的名称，指一种罕见的含水磷酸盐矿物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (a hydrated phosphate) found in small amounts in some pegmatites and phosphate-rich deposits.","zh":"一种罕见矿物（含水磷酸盐类矿物），通常仅在某些伟晶岩或富磷矿床中少量产出。"},"examples":[{"en":"Biehlenite is mainly of interest to mineral collectors because it is very rare.","zh":"由于非常罕见，biehlenite 主要引起矿物收藏者的兴趣。"},{"en":"The report lists biehlenite among several uncommon phosphate minerals from the site.","zh":"报告把 biehlenite 列在该地点发现的几种罕见磷酸盐矿物之中。"}]}],"synonyms":["(no common synonyms; a mineral name)"],"phonetic":"/ˈbiːlɪnaɪt/","extraExplanation":["“Biehlenite”属于矿物学命名，多以发现地、相关地点或人物命名；它通常出现在矿物学/地质学语境中，而不是日常英语。","该词在普通词典中不常见；阅读地质论文或矿物名录时，如果遇到它，一般可把它理解为一种“罕见的含水磷酸盐矿物”。"]}
{"word":"Biel","summary":{"en":"“Biel” most commonly refers to the Swiss city (also called Bienne in French) and can also be a surname.","zh":"“Biel” 最常见指瑞士城市（法语名为 Bienne），也可作姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A city in northwestern Switzerland; in German it is called Biel and in French it is called Bienne.","zh":"瑞士西北部的一座城市；德语称为 Biel，法语称为 Bienne（双语城市）。"},"examples":[{"en":"Biel/Bienne is known for watchmaking and nearby Lake Biel.","zh":"Biel/Bienne 因制表业以及附近的比尔湖而闻名。"},{"en":"She took the train from Bern to Biel for a day trip.","zh":"她从伯尔尼坐火车去 Biel 一日游。"}]},{"partOfSpeech":"other","definition":{"en":"A family name (surname).","zh":"一个姓氏（人名）。"},"examples":[{"en":"Mr. Biel will join the meeting at 3 p.m.","zh":"Biel 先生将于下午三点参加会议。"}]}],"synonyms":["Bienne (French name of the city)"],"phonetic":"/biːl/","extraExplanation":["Biel 是德语名；法语中同一座城市常写作 Bienne，因此你可能会看到 “Biel/Bienne” 这种并列写法，反映了当地德语与法语并行的语言环境。","作为专有名词（地名/人名），Biel 通常首字母大写；在句子里不加冠词时也很常见（例如 “in Biel”）。"]}
{"word":"Biela","summary":{"en":"Biela is a proper name, best known from “Biela’s Comet,” and it can also be a surname.","zh":"Biela是专有名词，最常见于“比拉彗星”，也可作姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a proper name most commonly seen in astronomy in “Biela’s Comet,” a periodic comet discovered in the 1800s.","zh":"专有名词，最常见于天文学中的“比拉彗星（Biela’s Comet）”，指19世纪发现的一颗周期彗星。"},"examples":[{"en":"Biela’s Comet was once expected to return regularly, but it later broke apart.","zh":"比拉彗星曾被认为会规律回归，但后来它解体了。"},{"en":"Some meteor showers are linked to debris from comets like Biela’s Comet.","zh":"一些流星雨与比拉彗星这类彗星留下的碎屑有关。"}]},{"partOfSpeech":"other","definition":{"en":"a surname (family name), especially in Central and Eastern Europe.","zh":"姓氏（家族名），在中欧和东欧较常见。"},"examples":[{"en":"Her last name is Biela, and her family is from Poland.","zh":"她的姓是Biela，她的家人来自波兰。"},{"en":"I saw the name Biela on the conference schedule.","zh":"我在会议日程表上看到了Biela这个名字。"}]}],"phonetic":"/ˈbiːlə/","extraExplanation":["“Biela’s Comet（比拉彗星）”由奥地利天文学家Wilhelm von Biela在1826年确认其为周期彗星。它在1846年被观测到分裂成两颗，之后逐渐变暗并未再成功观测到彗核；人们认为它的残骸与后来的某些流星雨活动有关。"]}
{"word":"bielbrief","summary":{"en":"“Brief” means short in time/length, or a short summary/instructions; it can also mean to give a short summary.","zh":"“brief”表示“简短的、短暂的”；也可指“简要说明/简报”，还可作动词表示“作简要说明”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"lasting a short time; not long.","zh":"短暂的；不长的。"},"examples":[{"en":"The meeting was brief, so we finished early.","zh":"会议很简短，所以我们很早就结束了。"},{"en":"He gave a brief smile and walked away.","zh":"他短暂地笑了一下就走开了。"}]},{"partOfSpeech":"n.","definition":{"en":"a short summary or set of instructions, especially for work or writing.","zh":"（尤指工作或写作的）简要说明；任务简报。"},"examples":[{"en":"The designer read the project brief carefully.","zh":"设计师仔细阅读了项目简报。"},{"en":"Please send me a brief by email.","zh":"请把简要说明发到我邮箱。"}]},{"partOfSpeech":"vt.","definition":{"en":"to give someone a short summary or instructions.","zh":"向……作简要说明；给……做简报。"},"examples":[{"en":"I’ll brief you on the plan before the call.","zh":"电话会议前我会向你简要说明计划。"},{"en":"The manager briefed the team about the new rules.","zh":"经理向团队简要说明了新规定。"}]}],"synonyms":["short","quick","concise","summary","outline"],"phonetic":"/briːf/","extraExplanation":["“bielbrief”不是常见的英语单词，可能是拼写错误。最接近且常用的词是“brief”。如果你本来想查的是“Bible brief（圣经简述）”或其他专有名词，请告诉我上下文（例如一句话或使用场景），我可以按你的意思解释。"]}
{"word":"bielby","summary":{"en":"Bielby is mainly used as a surname, and it is also the name of a village in Yorkshire, England.","zh":"Bielby 主要用作姓氏，也可指英国英格兰约克郡的一座村庄。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surname (family name).","zh":"姓氏（家族名）。"},"examples":[{"en":"Professor Bielby published a study on workplace inequality.","zh":"比尔比教授发表了一项关于职场不平等的研究。"},{"en":"I met someone named Bielby at the conference.","zh":"我在会议上遇到一个姓比尔比（Bielby）的人。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name: a small village in the East Riding of Yorkshire, England.","zh":"地名：英国英格兰约克郡东区的一个小村庄（Bielby）。"},"examples":[{"en":"They drove through Bielby on the way to York.","zh":"他们去约克的路上开车经过了比尔比（Bielby）。"},{"en":"Bielby is a quiet village in rural Yorkshire.","zh":"比尔比（Bielby）是约克郡乡间一个安静的村庄。"}]}],"phonetic":"/ˈbiːlbi/","extraExplanation":["“Bielby”通常被当作专有名词使用（人名/地名），所以在句子里常常需要大写：Bielby。","作为地名时，它属于英格兰的传统乡村地名体系；很多英国村名以“-by”结尾，这个后缀常见于受北欧语言影响的地区地名（如一些维京时期定居影响较深的地方）。"]}
{"word":"bield","summary":{"en":"“Bield” is a Scots word meaning “shelter/cover,” and it can also mean “to shelter.”","zh":"“bield”是苏格兰英语词，表示“遮蔽/庇护处”，也可作动词表示“遮蔽、庇护”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"shelter or protection (especially from wind, cold, or danger); a place that gives cover.","zh":"庇护；遮蔽处（尤指挡风、御寒或避险的地方）。"},"examples":[{"en":"We stood in the bield of the stone wall to get out of the wind.","zh":"我们站在石墙背风处避风。"},{"en":"The trees gave the hikers a little bield from the rain.","zh":"树林给徒步者提供了一点避雨的遮蔽。"}]},{"partOfSpeech":"v.","definition":{"en":"to shelter; to provide cover or protection (often used in Scots or literary writing).","zh":"庇护；遮蔽；提供保护（常见于苏格兰英语或文学用法）。"},"examples":[{"en":"The cliff bielded the cottage from the worst storms.","zh":"悬崖为小屋挡住了最猛烈的风暴。"},{"en":"They bielded the fire with a ring of stones.","zh":"他们用一圈石头把火堆围起来遮挡风势。"}]}],"synonyms":["shelter","cover","refuge","protection","shield"],"phonetic":"/bild/","extraExplanation":["“bield”主要见于苏格兰英语（Scots）与带有地方色彩的文学描写中，尤其用来形容“背风处/避风港”这种很具体的自然场景。","在现代日常英语里，更常用的对应词是 shelter, cover, protection（名词）以及 shelter, shield（动词）。"]}
{"word":"bielded","summary":{"en":"“Bielded” is a Scots/literary word meaning “sheltered” or “protected,” often from wind or weather.","zh":"“bielded”是苏格兰英语/文学用语，意为“有遮蔽的、受保护的”，常指避风雨。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Scots / literary) Past tense of “bield”: to shelter or protect (someone or something) from wind, weather, or danger.","zh":"（苏格兰英语/文学用语）“bield”的过去式：为……提供遮蔽；保护（某人或某物）免受风雨或危险。"},"examples":[{"en":"The stone wall bielded the garden from the cold wind.","zh":"石墙为花园挡住了寒风。"},{"en":"They bielded the lambs in a small shed during the storm.","zh":"暴风雨时，他们把小羊安置在小棚里避风雨。"}]},{"partOfSpeech":"adj.","definition":{"en":"Sheltered; protected; lying in a place that is shielded from wind or exposure.","zh":"有遮蔽的；受保护的；处在避风、较不暴露的位置。"},"examples":[{"en":"We found a bielded spot behind the trees to rest.","zh":"我们在树后找到一处背风的地方休息。"},{"en":"A bielded corner of the yard stayed warmer in winter.","zh":"院子里一个避风的角落冬天更暖和。"}]}],"synonyms":["sheltered","protected","shielded","covered"],"phonetic":"/ˈbiːldɪd/","extraExplanation":["“bield”是苏格兰英语中常见的词，意思是“遮蔽、庇护（处）”。在现代标准英语里更常用的是“shelter / sheltered”或“shield / shielded”。","如果你是在作业或正式写作中看到/想用这个词，通常带有方言或文学色彩；日常美式英语里很少用。","有时学习者会把“bielded”与“shielded”混淆：两者意思接近，但“shielded”是标准英语里更常见的表达。"]}
{"word":"bielding","summary":{"en":"Bielding is a rare Scottish word meaning “shelter”; in many cases it’s simply a misspelling of “building.”","zh":"bielding 是较少见的苏格兰用语，意为“避风处/遮蔽”；很多时候它只是把 building 拼错了。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scotland, dialect) A sheltering place; protection from wind or bad weather.","zh":"（苏格兰方言）避风处；遮蔽之所；庇护。"},"examples":[{"en":"We stopped in the bielding behind the wall to get out of the wind.","zh":"我们躲到墙后的避风处，避开大风。"},{"en":"The trees provided bielding for the sheep during the storm.","zh":"暴风雨时，树林为羊群提供了遮蔽。"}]},{"partOfSpeech":"n.","definition":{"en":"(Often a misspelling) The act of making or putting something together; construction.","zh":"（常见拼写错误）建造；施工；组装。"},"examples":[{"en":"If you mean building, the new school is still in the bielding stage.","zh":"如果你想说 building（建造），新学校还在施工阶段。"},{"en":"They are bielding a model airplane from a kit.","zh":"他们在用套件组装一架飞机模型。"}]}],"synonyms":["shelter","cover","protection","refuge"],"phonetic":"/ˈbiːldɪŋ/","extraExplanation":["“bielding”在现代英语里很少见，多见于苏格兰英语/方言，来自“bield”（意为“遮蔽、庇护”）。在日常美式英语中，人们更常写和说“building”（建筑物/建造）。如果你是在课本、新闻或工作场景里看到的，很可能本来想表达的是“building”。"]}
{"word":"bields","summary":{"en":"“Bields” is a Scots/dialect word meaning “shelters” or “protects from wind/weather.”","zh":"“bields”是苏格兰/方言用法，意思是“避风处/庇护处”，或动词“遮蔽、庇护（免受风雨）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scotland, Northern England; uncommon) shelters; places that protect someone or something from wind, weather, or danger.","zh":"（苏格兰、英格兰北部；较少见）庇护处；避风处；能遮挡风雨或危险的地方。"},"examples":[{"en":"We sat in the bields of the trees to get out of the wind.","zh":"我们坐在树木形成的避风处里，躲开风。"},{"en":"The sheep found bields behind the stone wall.","zh":"羊群在石墙后面找到了避风处。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Scotland; uncommon) protects or shelters (someone or something) from wind, weather, or danger.","zh":"（苏格兰；较少见）庇护；遮蔽；使（某人/某物）免受风雨或危险。"},"examples":[{"en":"A thick hedge bields the garden from the sea wind.","zh":"一排浓密的树篱为花园挡住海风。"},{"en":"The cliff bields the village in winter storms.","zh":"冬季风暴来临时，悬崖为村庄提供遮蔽。"}]}],"synonyms":["shelters","refuges","cover","protection"],"phonetic":"/bildz/","extraExplanation":["“bield / bields”多见于苏格兰英语（Scots）和方言中；在现代标准英语里，更常用的词是“shelter”“cover”“refuge”。","如果你本来想写的是“builds”（build 的第三人称单数/复数名词形式），那就是另一个词：builds = 建造；（人/公司）建造的东西。"]}
{"word":"bieldy","summary":{"en":"Bieldy means “well-sheltered (especially from wind),” mainly in Scottish usage; less commonly it can mean “sturdy/robust.”","zh":"bieldy 主要（苏格兰用法）指“很遮蔽、很避风的”；较少见时也可指“结实、健壮的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Scotland, Northern England) well-sheltered; protected from wind or harsh weather.","zh":"（苏格兰/英格兰北部用法）遮蔽良好、避风的；受保护的。"},"examples":[{"en":"It’s a bieldy corner of the garden, so the herbs grow well there.","zh":"花园有个很避风的角落，所以香草在那儿长得很好。"},{"en":"They built the cottage in a bieldy spot below the hill.","zh":"他们把小屋建在山坡下一个很遮蔽的地方。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) sturdy; strong-looking; robust.","zh":"（较少见）结实的；健壮的；看起来很强壮的。"},"examples":[{"en":"He was a bieldy lad, used to working outdoors.","zh":"他是个结实的小伙子，习惯在户外干活。"}]}],"synonyms":["sheltered","protected","out of the wind","sturdy","robust","burly"],"phonetic":"/ˈbildi/","extraExplanation":["“bieldy”主要见于苏格兰英语/苏格兰方言（Scots），来自名词“bield”（意为“庇护、避风处”）。在描写乡村环境或天气时很常用：bieldy place / bieldy spot 表示“避风的地方”。","在标准现代英语里更常用的表达是：sheltered, well-protected, out of the wind。若用于“人很结实”，更常见的替代词是：sturdy, burly, robust。"]}
{"word":"bielectrolysis","summary":{"en":"Bielectrolysis is a rare technical term meaning electrolysis done in two stages or with two linked cells.","zh":"Bielectrolysis 是较罕见的技术词，通常指分两步或用两个相连电解单元进行的电解。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare/technical) Electrolysis carried out in two stages or using two linked electrolytic cells/electrode systems.","zh":"（罕见/技术用语）分两步进行，或使用两个相互连接的电解池/电极系统来进行的电解过程。"},"examples":[{"en":"The process uses bielectrolysis to separate the products in two cells.","zh":"该工艺使用 bielectrolysis（双电解）在两个电解池中分离产物。"},{"en":"In the lab notes, bielectrolysis was mentioned as a two-step electrolysis method.","zh":"在实验记录中，bielectrolysis 被提到是一种“两步电解”的方法。"}]}],"synonyms":["two-stage electrolysis","dual-cell electrolysis"],"phonetic":"/ˌbaɪɪˌlɛkˈtrɑləsɪs/","extraExplanation":["“bielectrolysis”并不是常见标准词，很多情况下更常见的是 **bioelectrolysis**（生物电解，常见于微生物电解/MEC 等领域）。如果你是在论文、专利或笔记里看到该词，建议结合上下文确认作者是否想表达“bi-”（双重/两段/两个单元）还是“bio-”（生物）。","构词提示：前缀 **bi-** 表示“二、双、两次”；**electrolysis** 指“电解”。因此该词通常可理解为“二段电解/双电解（两个电解单元的电解）”。"]}
{"word":"Bielefeld","summary":{"en":"Bielefeld is a city in western Germany; online, it’s also famous for a joke meme claiming it doesn’t exist.","zh":"Bielefeld（比勒费尔德）是德国西部的一座城市；在网络文化中，它也因“比勒费尔德不存在”的玩笑梗而出名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in North Rhine–Westphalia (NRW), western Germany, known for its industry, universities, and the nearby Teutoburg Forest area.","zh":"德国西部北莱茵-威斯特法伦州（NRW）的一座城市，以工业与高校闻名，附近有条顿堡森林地区。"},"examples":[{"en":"Bielefeld is located between Dortmund and Hanover.","zh":"比勒费尔德位于多特蒙德和汉诺威之间。"},{"en":"She studied at a university in Bielefeld before moving to Berlin.","zh":"她在比勒费尔德的一所大学读书，之后搬去了柏林。"}]},{"partOfSpeech":"n.","definition":{"en":"in internet culture, a humorous reference used in the “Bielefeld Conspiracy,” joking that the city does not exist.","zh":"在网络文化中，“比勒费尔德阴谋论”里的一个玩笑梗：戏称这座城市“根本不存在”。"},"examples":[{"en":"It’s a meme: people joke, “Have you ever met anyone from Bielefeld?”","zh":"这是个网络梗：人们会开玩笑说：“你见过来自比勒费尔德的人吗？”"},{"en":"He posted a “Bielefeld doesn’t exist” joke, but he was clearly kidding.","zh":"他发了“比勒费尔德不存在”的段子，但显然是在开玩笑。"}]}],"synonyms":["(place name)","(proper noun)"],"phonetic":"/ˈbiːlɚˌfɛlt/","extraExplanation":["“比勒费尔德阴谋论”（Bielefeldverschwörung）起源于1994年德国网络论坛上的恶搞贴文，用三个“你能确定吗？”式的问题制造荒诞感（你去过吗？你认识那里的人吗？你认识去过的人吗？），后来成为德语圈常见的幽默梗。","在正式语境（新闻、学术、旅行）中，Bielefeld就是正常的地名；只有在社交媒体、玩笑或吐槽中才会用到“doesn’t exist”这种梗式说法。"]}
{"word":"bielenite","summary":{"en":"Bielenite is a very rare mineral term, often considered a variant spelling of biehlenite.","zh":"bielenite 是非常罕见的矿物名称，常被认为是 biehlenite 的异拼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A reported mineral name; often treated as a variant or misspelling of **biehlenite**, a rare uranium-bearing mineral mentioned in mineralogy sources.","zh":"（罕见）一种被记录过的矿物名称；常被视为 **biehlenite** 的变体拼写或误拼，指在矿物学资料中出现的稀有含铀矿物。"},"examples":[{"en":"Bielenite is rarely listed in modern references, and many entries redirect to biehlenite.","zh":"“bielenite”在现代资料中很少单独列出，许多条目会改指向“biehlenite”。"},{"en":"The sample was tentatively labeled bielenite, but the lab requested confirmation of the spelling and identity.","zh":"该样品被暂时标注为“bielenite”，但实验室要求核对拼写与矿物鉴定结果。"}]}],"synonyms":["biehlenite (variant spelling)"],"phonetic":"/ˈbiːlənaɪt/","extraExplanation":["这个词在通用英语词典里几乎找不到，更像是矿物学中的专名或旧名/异拼。你输入的 **bielenite** 很可能对应 **biehlenite**（只差一个 h），建议你把它出现的句子或来源（书名/网页）发来，我可以帮你确认具体指的是哪种矿物、标准拼写以及更可靠的释义。"]}
{"word":"Bielersee","summary":{"en":"Bielersee is the German name for Lake Biel, a lake in western Switzerland near Biel/Bienne.","zh":"Bielersee 是比尔湖的德语名称，位于瑞士西部，靠近比尔/比恩（Biel/Bienne）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Lake Biel; a lake in western Switzerland, near the town of Biel/Bienne.","zh":"比尔湖；瑞士西部的一座湖泊，靠近比尔/比恩（Biel/Bienne）城市。"},"examples":[{"en":"We took a boat ride on Bielersee in the summer.","zh":"夏天我们在比尔湖上坐船游览。"},{"en":"Bielersee lies between vineyards and small lakeside villages.","zh":"比尔湖坐落在葡萄园与湖畔小村之间。"}]},{"partOfSpeech":"n.","definition":{"en":"The German name for the lake also called Lake Biel (English) or Lac de Bienne (French).","zh":"该湖的德语名称；英语常称 Lake Biel，法语称 Lac de Bienne。"},"examples":[{"en":"In English guides, Bielersee is usually labeled as “Lake Biel.”","zh":"在英文旅游指南里，Bielersee 通常标为“Lake Biel（比尔湖）”。"}]}],"synonyms":["Lake Biel","Lac de Bienne"],"phonetic":"/ˈbiːlərˌzeɪ/","extraExplanation":["“Bielersee”是德语复合词：Biel（比尔/比恩这座城市的德语名）+ See（湖）。在瑞士同一地点常有德语/法语等不同名称，属于多语环境的常见现象。","该湖位于瑞士“汝拉三湖区”（Three-Lakes Region）的一部分，周边常见葡萄园与湖区骑行/徒步路线；在旅行语境里也常与附近的制表业城市比尔（Biel/Bienne）一起被提及。"]}
{"word":"Bielid","summary":{"en":"Bielid: a meteor (or the meteor shower) linked to Biela’s Comet; also called the Andromedids.","zh":"Bielid：与比拉彗星有关的流星（或该流星雨），也叫仙女座流星雨（Andromedids）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a meteor from the Bielids (the Andromedids), a meteor shower associated with Biela’s Comet","zh":"“比拉流星”（又称“仙女座流星雨 Andromedids”）中的流星；该流星雨与比拉彗星有关"},"examples":[{"en":"The Bielids are famous for a spectacular meteor storm recorded in the 1800s.","zh":"比拉流星雨因19世纪曾出现壮观的“流星暴”而闻名。"},{"en":"Astronomers call the Andromedids the Bielids because of their connection to Biela’s Comet.","zh":"天文学家把仙女座流星雨称为比拉流星雨，因为它与比拉彗星有关。"}]}],"synonyms":["Andromedid","Andromedids","meteor (in this context)"],"phonetic":"/ˈbiːlɪd/","extraExplanation":["“Bielid/Bielids”多见于天文学语境，是由彗星（比拉彗星，Biela’s Comet）碎片进入地球大气层形成的流星。历史上1872年与1885年曾出现非常显著的流星活动，因此在科普或天文史资料里较常看到该名称。","在现代资料中更常用的名称是“Andromedids（仙女座流星雨）”；“Bielids”属于别名/旧称，用来强调其来源彗星。"]}
{"word":"bielid","summary":{"en":"“Belied” means “showed something was untrue” or “gave a false impression (often an appearance hiding reality).”","zh":"“Belied”表示“证明……不真实”或“（外表/表现）造成与事实不一致的印象，掩盖真实情况”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Belied: past tense/past participle of “belie,” meaning to show that something is not true, or to fail to give a true idea of something.","zh":"Belied：动词“belie”的过去式/过去分词，意思是“证明……不真实；使……显得不符事实；（外表）掩盖/与真实情况不一致”。"},"examples":[{"en":"Her calm voice belied her nervousness.","zh":"她平静的声音掩盖了她的紧张。"},{"en":"The company’s public statements were belied by the leaked emails.","zh":"泄露的邮件证明该公司的公开说法并不属实。"}]}],"synonyms":["contradicted","disproved","masked","concealed"],"phonetic":"/bɪˈlaɪd/","extraExplanation":["“bielid”本身不是常见英语单词；你可能想查的是“belied”（拼写很接近，读音也容易让人听错）。如果你想查别的词（比如人名/地名/品牌），告诉我它的语境句子，我可以更准确判断。"]}
{"word":"Bielka","summary":{"en":"“Bielka” is usually a proper noun—most commonly a Polish surname, and sometimes a place name.","zh":"“Bielka”通常是专有名词——最常见是波兰姓氏，有时也用作地名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Polish surname (family name).","zh":"一个波兰姓氏（家族姓）。"},"examples":[{"en":"Dr. Bielka published a study on community health.","zh":"比耶尔卡博士发表了一项关于社区健康的研究。"},{"en":"I met Ms. Bielka at the conference in Warsaw.","zh":"我在华沙的会议上见到了比耶尔卡女士。"}]},{"partOfSpeech":"other","definition":{"en":"a place name in some Slavic-language contexts (used as a proper noun).","zh":"在一些斯拉夫语语境中出现的地名（作为专有名词使用）。"},"examples":[{"en":"The hikers planned a route near Bielka on the map.","zh":"徒步者在地图上规划了一条经过比耶尔卡附近的路线。"}]}],"synonyms":["(surname) family name","(general) proper noun"],"phonetic":"/biˈɛlkə/","extraExplanation":["“Bielka”在英语里通常被当作专有名词使用（人名/地名），不常作为普通英语词汇。拼写与发音往往会随个人或地区习惯而变化。","如果你看到的是波兰语“białka”（带 ą/ł 等变音符号的形式），它在波兰语里可指“蛋白质/蛋白”，但那属于波兰语词，不是标准英语词条。"]}
{"word":"Bielo-russian","summary":{"en":"Bielo-russian is an older/variant spelling meaning “Belarusian,” used for people or things from Belarus and its language.","zh":"Bielo-russian 是“Belarusian（白俄罗斯的/白俄罗斯人/白俄罗斯语）”的旧式或变体拼写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(older or variant spelling) relating to Belarus, its people, or its language; Belarusian.","zh":"（旧式或变体拼写）与白俄罗斯、白俄罗斯人或白俄罗斯语有关的；白俄罗斯的。"},"examples":[{"en":"In older books, you may see “Bielo-russian” used where modern English prefers “Belarusian.”","zh":"在较旧的书里，你可能会看到用“Bielo-russian”，而现代英语更常用“Belarusian”。"},{"en":"The museum has a small collection of Bielo-russian folk art.","zh":"这家博物馆收藏了一小部分白俄罗斯民间艺术作品。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Belarus (older or variant form of “Belarusian”).","zh":"白俄罗斯人（“Belarusian”的旧式或变体说法）。"},"examples":[{"en":"She is a Bielo-russian living in Chicago.","zh":"她是一位居住在芝加哥的白俄罗斯人。"}]}],"synonyms":["Belarusian","Byelorussian"],"phonetic":"/ˌbiːloʊˈrʌʃən/","extraExplanation":["“Bielo- / Byelo-”来自斯拉夫语中“白（white）”的含义，历史上英语里常用 Byelorussia/Byelorussian（与苏联时期的转写习惯有关）。如今更中性、也更符合官方名称的用法是 Belarus / Belarusian。","在正式写作（新闻、学术、签证材料等）中，建议优先使用 “Belarusian”。“Bielo-russian” 多见于旧文献或特定转写体系。"]}
{"word":"Bielorouss","summary":{"en":"“Beloruss” is an older, less common term connected to Belarus; modern English usually uses “Belarus” and “Belarusian.”","zh":"“Beloruss” 是与白俄罗斯相关的较旧、不太常用的说法；现代英语通常使用 “Belarus” 与 “Belarusian”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an older or less common term referring to Belarus (the country) or to a Belarusian person; today, “Belarus” and “Belarusian” are generally preferred","zh":"一个较旧或较不常用的说法，可指“白俄罗斯（国家）”或“白俄罗斯人”；如今通常更推荐使用“Belarus（白俄罗斯）”与“Belarusian（白俄罗斯的/白俄罗斯人）”"},"examples":[{"en":"Some older books use “Beloruss” for a person from Belarus, but “Belarusian” is the standard word today.","zh":"一些较旧的书会用“Beloruss”指来自白俄罗斯的人，但如今标准用法是“Belarusian”。"},{"en":"Modern English news reports usually say “Belarus,” not “Belorussia” or “Beloruss.”","zh":"现代英文新闻通常说“Belarus（白俄罗斯）”，而不是“Belorussia”或“Beloruss”。"}]}],"synonyms":["Belarus","Belarusian","Belorussian (older)"],"phonetic":"/ˌbɛləˈruːs/","extraExplanation":["你输入的 “Bielorouss” 很可能是拼写变体或拼写错误。英语里更常见、更规范的写法是：国家用 “Belarus”，国籍/形容词用 “Belarusian”。","“Beloruss/Belorussian/Belorussia” 这些形式在一些旧资料里能看到，和俄语/苏联时期的译名传统有关；在当代英语语境中，通常被视为过时或不够准确。"]}
{"word":"bielorouss","summary":{"en":"“bielorouss” is likely a misspelling of “Belarusian,” meaning “from Belarus” or “a person from Belarus.”","zh":"“bielorouss”很可能是“Belarusian”的拼写错误，意思是“白俄罗斯的”或“白俄罗斯人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Belarusian; relating to Belarus or its people, language, or culture (a misspelling of “Belarusian,” sometimes seen via French “biélorusse” or older “Byelorussian”).","zh":"白俄罗斯的；与白俄罗斯（国家）、其人民、语言或文化有关的（“bielorouss”常见于拼写错误，也可能受法语“biélorusse”或旧式拼写“Byelorussian/Belorussian”影响）。"},"examples":[{"en":"She studies Belarusian history and culture.","zh":"她研究白俄罗斯的历史与文化。"},{"en":"Belarusian is one of the official languages of Belarus (along with Russian).","zh":"白俄罗斯语是白俄罗斯的官方语言之一（另一个是俄语）。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Belarus; a Belarusian citizen or member of the Belarusian ethnic group.","zh":"白俄罗斯人；来自白俄罗斯的人，或白俄罗斯公民/族群成员。"},"examples":[{"en":"Many Belarusians speak both Belarusian and Russian.","zh":"许多白俄罗斯人同时会说白俄罗斯语和俄语。"}]}],"synonyms":["Belarusian","Byelorussian (older)"],"phonetic":"/ˌbɛləˈruːʃən/","extraExplanation":["英语里更常用的国家名是“Belarus”，对应形容词/名词是“Belarusian”。“Belorussian/Byelorussian”属于较旧或较少见的写法，尤其在苏联时期的资料里会出现。","如果你想表达“白俄罗斯语”，常见说法是“the Belarusian language”或直接“Belarusian”；表达“白俄罗斯人”用“a Belarusian / Belarusians”。"]}
{"word":"Bielsko-Biala","summary":{"en":"Bielsko-Biała is a city in southern Poland, near the Beskid Mountains.","zh":"Bielsko-比亚瓦是波兰南部的一座城市，靠近贝斯基德山脉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in southern Poland (proper name), near the Czech and Slovak borders, known for its history as an industrial and cultural center at the foot of the Beskid Mountains.","zh":"波兰南部的一座城市（专有名词），靠近捷克与斯洛伐克边境，以其工业与文化历史著称，位于贝斯基德山脉山麓。"},"examples":[{"en":"Bielsko-Biała is a good base for hiking in the Beskid Mountains.","zh":"比尔斯科-比亚瓦是前往贝斯基德山脉徒步的好据点。"},{"en":"She studied at a university in Bielsko-Biała.","zh":"她在比尔斯科-比亚瓦的一所大学读书。"}]}],"synonyms":["Bielsko-Biała","Bielsko-Biala (without diacritics)"],"phonetic":"/biˈɛl.skoʊ ˈbjɑː.lə/","extraExplanation":["拼写提示：波兰语正式写法是“Bielsko-Biała”（中间有连字符，Biała 里有“ł/Ł”这个字母）。在不方便输入变音符号时，英文里常写成 Bielsko-Biala。","名称背景：这座城市历史上由相邻的两座城镇 Bielsko 与 Biała 发展而来，后来合并成今天的行政城市，因此名称保留了双城结构。","文化与地区：它位于西里西亚（Silesia）一带，也常被视为通往波兰南部山地与滑雪、徒步区域的门户城市。"]}
{"word":"bien","summary":{"en":"“Bien” is Spanish for “well/fine/good,” commonly used to say you’re okay or to agree.","zh":"“bien”是西班牙语，常表示“很好/还行/可以”，用于回答近况或表示同意。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"a Spanish word meaning “well; fine; good,” used to say you are okay or to agree/accept something","zh":"西班牙语单词，意思是“好；很好；没事；可以”，常用来表示自己状态不错，或表示同意/接受"},"examples":[{"en":"—How are you? —Bien, gracias.","zh":"——你好吗？——我很好，谢谢。"},{"en":"Okay, bien. Let’s start the meeting.","zh":"好吧，可以。我们开始开会吧。"}]},{"partOfSpeech":"n.","definition":{"en":"as a noun in Spanish contexts, meaning “good” or “benefit” (often used in set phrases)","zh":"在西语语境中可作名词，表示“善/好处/利益”（常见于固定搭配）"},"examples":[{"en":"They talked about the common good (el bien común).","zh":"他们谈到了共同利益（el bien común）。"}]}],"synonyms":["well","fine","okay","good"],"phonetic":"/bjɛn/","extraExplanation":["“bien”是西班牙语里非常高频的词，最常见的用法是回答“¿Cómo estás?”（你怎么样/你好吗）时说“Bien.”（我很好/还行）。","注意区分：西语里“bien”更像英语的“well”（副词：做得好/感觉好），而“bueno/a”更像英语的“good”（形容词：东西/人很好）。例如：\"Estoy bien\"（我状态很好） vs. \"Es bueno\"（它很好）。"]}
{"word":"bienfait","summary":{"en":"A French word meaning a benefit or kind act; in everyday English, “benefit” or “good deed” is more common.","zh":"法语词，意为“恩惠/善举/好处”；日常英语更常用 benefit 或 good deed。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(French; sometimes used in English writing) a benefit, good deed, or act of kindness; a boon.","zh":"（法语词；英语中偶见）恩惠；善举；好处；恩典。"},"examples":[{"en":"They thanked her for every bienfait she had done for the community.","zh":"他们感谢她为社区所做的每一件善举。"},{"en":"Education was described as a bienfait for the whole nation.","zh":"教育被形容为整个国家的恩惠。"}]}],"synonyms":["benefit","boon","kindness","good deed","favor","charity"],"phonetic":"/biːnˈfeɪ/","extraExplanation":["“Bienfait”是法语名词，常见于法语或带有法语风格的英文写作中；在日常英语里更常用 benefit / boon / kindness / good deed。","词源上可拆为 bien（好）+ fait（做的事/行为），字面意思接近“做的好事”。在文学或正式语境中使用会显得更典雅、带一点法式色彩。"]}
{"word":"bienly","summary":{"en":"“Bienly” is a Scottish/old-fashioned adverb meaning comfortably, pleasantly, or prosperously (and sometimes kindly).","zh":"“bienly”是苏格兰/较旧用法的副词，表示舒适惬意地、过得殷实地（有时也指和气地）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Scottish, dialect; old-fashioned) In a comfortable, pleasant, or well-off way; kindly and in good spirits.","zh":"（苏格兰方言；较旧用法）舒适地、惬意地；也可指过得殷实、气色好地；和气地。"},"examples":[{"en":"After the harvest, the family lived bienly through the winter.","zh":"收获之后，这家人整个冬天都过得很安稳、宽裕。"},{"en":"She spoke bienly to the children, calming them down.","zh":"她和气地对孩子们说话，让他们安静下来。"}]}],"synonyms":["comfortably","pleasantly","prosperously","kindly"],"phonetic":"/ˈbiːnli/","extraExplanation":["“bienly”来自苏格兰词“bien”（意为舒适、殷实、精神好）。在现代标准英语中很少见，多出现在苏格兰语境、文学描写或历史文本里。","不要和“biennially”（每两年一次地）混淆：拼写相近，但意义完全不同。"]}
{"word":"biennale","summary":{"en":"A biennale is a major art or cultural exhibition held every two years.","zh":"biennale 指每两年举办一次的大型艺术或文化展览（双年展）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large art or cultural exhibition that is held every two years (often international in scope).","zh":"（通常指国际性的）双年展；每两年举办一次的大型艺术或文化展览。"},"examples":[{"en":"She traveled to Italy to see the Venice Biennale.","zh":"她去意大利参观威尼斯双年展。"},{"en":"The city’s biennale brings together artists from around the world every two years.","zh":"这座城市的双年展每两年都会汇聚来自世界各地的艺术家。"}]}],"synonyms":["biennial exhibition","two-yearly exhibition"],"phonetic":"/biˈæn.əl/","extraExplanation":["“Biennale”来自意大利语，字面意思是“每两年一次”。最有名的是“Venice Biennale（威尼斯双年展）”，创办于1895年，是当代艺术界非常重要的国际展览之一。","在英语里也能看到形容词“biennial”（/baɪˈɛn.i.əl/，此处不另标音），表示“每两年一次的”；但“biennale”更常用作名词，特指这种大型展览活动。","注意区分：biennial = 每两年一次；biannual = 每年两次（容易混淆）。"]}
{"word":"biennales","summary":{"en":"“Biennales” are major events—often international art exhibitions—held every two years.","zh":"“Biennales”指两年一度的大型活动（常见为国际艺术双年展），是“biennale”的复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Large events (especially art or design exhibitions) that happen every two years; plural of “biennale.”","zh":"（尤指艺术、设计类的）两年一度的大型活动/展览；为“biennale”的复数。"},"examples":[{"en":"Many artists hope to show their work at major biennales around the world.","zh":"许多艺术家都希望能在世界各地的重要双年展上展出作品。"},{"en":"The museum sent a team to visit several biennales and meet new curators.","zh":"博物馆派出团队参观了多个双年展，并与新的策展人会面。"},{"en":"She studied how biennales influence local culture and tourism.","zh":"她研究了双年展如何影响当地文化与旅游业。"}]}],"synonyms":["two-yearly exhibitions","biennial art shows","art biennials"],"phonetic":"/biˈænəl/","extraExplanation":["“biennale”源自意大利语，字面意思是“两年一次”。在当代语境中，它最常指国际性的艺术展览或艺术节，如“Venice Biennale（威尼斯双年展）”。","在艺术圈里，“biennale/biennial”容易混淆：biennial 常作形容词，表示“两年一次的”（a biennial festival）；biennale 更常作名词，指“（特定品牌/机制的）双年展”这一类大型展览。"]}
{"word":"Bienne","summary":{"en":"Bienne is the French name of the Swiss city also called Biel (Biel/Bienne).","zh":"Bienne 是瑞士城市 Biel 的法语名称，常写作 Biel/Bienne。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in northwestern Switzerland; the French name for the bilingual city also known in German as Biel (often written Biel/Bienne).","zh":"瑞士西北部的一座城市；其法语名称为 Bienne，对应的德语名称是 Biel（常写作 Biel/Bienne），是一座双语城市。"},"examples":[{"en":"She moved to Bienne (Biel) for a job in the watch industry.","zh":"她为了在制表业工作搬到了比恩（Biel/Bienne）。"},{"en":"The train from Bern to Bienne is quick and convenient.","zh":"从伯尔尼到比恩的火车又快又方便。"}]}],"synonyms":["Biel","Biel/Bienne"],"phonetic":"/biˈɛn/","extraExplanation":["Bienne 位于瑞士伯尔尼州附近，是瑞士著名的双语（法语与德语）地区之一；因此地图、车站牌与官方文件常出现 “Biel/Bienne” 的并列写法。","在英语语境里，人们通常会用 “Biel/Bienne” 来强调它的双语身份；单写 “Bienne” 多见于法语语境或与法语相关的文本。"]}
{"word":"bienne","summary":{"en":"Bienne is the French name for the Swiss city also called Biel.","zh":"Bienne 是瑞士城市 Biel（比尔）的法语名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in northwestern Switzerland (also known as Biel), in the canton of Bern","zh":"瑞士西北部的一座城市（也叫 Biel/比尔），位于伯尔尼州"},"examples":[{"en":"Bienne is known as a bilingual city where people speak both French and German.","zh":"Bienne 以双语城市闻名，人们同时使用法语和德语。"},{"en":"She took a train from Bern to Bienne for a weekend trip.","zh":"她从伯尔尼坐火车去 Bienne 进行周末旅行。"}]}],"synonyms":["Biel","Biel/Bienne"],"phonetic":"/biˈɛn/","extraExplanation":["Bienne 与 Biel 指同一座城市：法语名称是 Bienne，德语名称是 Biel。写作或查地图时，常会看到 “Biel/Bienne”。","该地区与瑞士制表业关系密切，附近有不少与钟表相关的企业与博物馆。"]}
{"word":"bienness","summary":{"en":"“bienness” is not a standard word; the likely intended word is “business,” meaning commerce/company, a matter to handle, or a line of work.","zh":"“bienness”不是标准英文词，通常想写的是“business”，意思是商业/公司、生意，也可指要处理的事情或行业。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The work of buying, selling, or providing goods or services; a company or the activity of commerce.","zh":"商业；生意；买卖活动；企业（公司）"},"examples":[{"en":"She runs a small business selling handmade soap.","zh":"她经营一家小生意，卖手工肥皂。"},{"en":"Business has been slow this month.","zh":"这个月生意不太好。"}]},{"partOfSpeech":"n.","definition":{"en":"A particular task, matter, or situation that someone must deal with.","zh":"事务；事情；要处理的问题"},"examples":[{"en":"Let’s get down to business.","zh":"我们开始谈正事吧。"},{"en":"It’s none of your business.","zh":"这不关你的事。"}]},{"partOfSpeech":"n.","definition":{"en":"A person’s job or line of work, especially as a general field.","zh":"职业；行业（尤指泛指的工作领域）"},"examples":[{"en":"He’s in the restaurant business.","zh":"他在餐饮行业工作。"}]}],"synonyms":["commerce","company","trade","enterprise","affair","matter"],"phonetic":"/ˈbɪznəs/","extraExplanation":["“bienness”不是标准英文拼写，最常见的正确拼写是 business（商业/生意）。常见错误原因是把发音里比较弱的中间音听成“n”，但实际拼写是 -siness。","business 的发音里第二个音节经常弱读，听起来像“biz-nəs”。所以虽然写作 business，但口语里更接近 /ˈbɪznəs/。"]}
{"word":"biennia","summary":{"en":"“Biennia” means “two-year periods” (plural of “biennium”), used mostly in formal or academic contexts.","zh":"“Biennia”意为“若干个两年期”（为 biennium 的复数），多用于正式或学术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of “biennium”) two-year periods; spans of two years.","zh":"（“biennium”的复数）两个年度的时期；为期两年的时间段。"},"examples":[{"en":"The report compares rainfall across several biennia.","zh":"这份报告比较了若干个两年期的降雨量。"},{"en":"Funding is planned in biennia rather than single years.","zh":"经费规划按两个年度为单位，而不是按单年。"}]}],"synonyms":["two-year periods","two-year spans","biennial periods"],"phonetic":"/baɪˈɛn.i.ə/","extraExplanation":["“Biennia”来自拉丁语：bi-（二）+ annus（年）。现代英语里更常见的说法是“two-year periods”或直接用单数“biennium”（一个两年期），而“biennia”多见于学术写作、统计报表或正式文体中。","注意区分：biennium/biennia指“时间长度（两年期）”；biennial多指“每两年一次的”或“二年生的（植物）”。"]}
{"word":"biennial","summary":{"en":"Biennial means “every two years” or “lasting two years,” and it can also be a two-year life-cycle plant.","zh":"biennial 表示“每两年一次”或“持续两年”，也可指“二年生植物”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening every two years.","zh":"每两年发生一次；两年一次。"},"examples":[{"en":"The company holds a biennial conference for all employees.","zh":"公司每两年举办一次全员大会。"},{"en":"This award is given on a biennial basis.","zh":"这个奖项每两年颁发一次。"}]},{"partOfSpeech":"adj.","definition":{"en":"Lasting for two years.","zh":"持续两年的。"},"examples":[{"en":"She accepted a biennial contract at the research institute.","zh":"她接受了研究所的一份为期两年的合同。"}]},{"partOfSpeech":"n.","definition":{"en":"A plant that completes its life cycle in two years (first year growth, second year flowering and seeding).","zh":"二年生植物（第一年生长，第二年开花结籽并结束生命周期）。"},"examples":[{"en":"Carrots and parsley are often treated as biennials.","zh":"胡萝卜和欧芹常被视为二年生植物。"},{"en":"Many biennials flower in their second year.","zh":"许多二年生植物在第二年开花。"}]}],"synonyms":["every two years","two-year","biennial plant"],"phonetic":"/baɪˈɛniəl/","extraExplanation":["“biennial”很容易和“biannual”混淆：biennial=每两年一次；biannual=一年两次。写正式邮件或公告时，如果怕歧义，也可以说“every two years”。","在艺术与文化领域里，“biennial”常指大型双年展（如威尼斯双年展 Venice Biennale），通常每两年举办一次。"]}
{"word":"biennially","summary":{"en":"Biennially means “once every two years.”","zh":"biennially 表示“每两年一次（隔年一次）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"once every two years (happens every second year).","zh":"每两年一次；隔年一次（每隔一年发生一次）。"},"examples":[{"en":"The conference is held biennially in different cities.","zh":"这场会议每两年在不同城市举办一次。"},{"en":"The report is published biennially to reduce costs.","zh":"为了降低成本，这份报告每两年发布一次。"}]}],"synonyms":["every two years","every other year"],"phonetic":"/baɪˈɛn.i.ə.li/","extraExplanation":["“biennially”来自拉丁语词根 bi-（二）+ annus（年），意思是“每两年一次”。","注意区分：biennial（每两年一次）≠ biannual / semiannual（每年两次）。在英语里 biannual 有时会被误用为“每两年一次”，但正式写作中最好用 biennial / biennially 表达“每两年一次”。","常见搭配：held/published/updated biennially（每两年举办/出版/更新一次）。"]}
{"word":"biennials","summary":{"en":"“Biennials” most commonly refers to plants that live for two years, or to events held every two years.","zh":"“biennials”最常指二年生植物；也可指两年举办一次的活动（如双年展）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Plants that take two years to complete their life cycle (first year: leaves/roots; second year: flowers/seeds), then usually die.","zh":"（复数名词）二年生植物：通常需要两年完成生命周期（第一年长叶和根；第二年开花结籽），之后多会枯死。"},"examples":[{"en":"Many garden biennials, like foxglove, flower in their second year.","zh":"许多花园里的二年生植物，比如毛地黄，会在第二年开花。"},{"en":"She planted biennials in spring so they would bloom next year.","zh":"她在春天种下二年生植物，好让它们明年开花。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural noun) Events or publications that happen once every two years.","zh":"（复数名词）两年一次举办（或发行）的活动、展览、刊物等。"},"examples":[{"en":"The city hosts several art biennials that attract international visitors.","zh":"这座城市举办好几个两年一度的艺术双年展，吸引了国际游客。"},{"en":"They are planning which biennials to attend this year.","zh":"他们正在计划今年要参加哪些双年展。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective, base form: biennial) Happening every two years; lasting for two years.","zh":"（形容词，原形 biennial）每两年一次的；持续两年的。"},"examples":[{"en":"The committee holds a biennial meeting to review long-term goals.","zh":"委员会每两年召开一次会议来回顾长期目标。"},{"en":"They published a biennial report on public health trends.","zh":"他们发布了一份两年一次的公共健康趋势报告。"}]}],"synonyms":["two-year plants","biennial plants","biennial events","biennial exhibitions"],"phonetic":"/baɪˈɛniəlz/","extraExplanation":["容易混淆：biennial = “每两年一次/二年生”；biannual = “一年两次”（也有人用来表示“每两年一次”，但在正式写作中建议避免这种歧义，改用 biennial 或 twice a year）。","词源提示：来自拉丁语 bi-（二）+ annus（年），所以核心含义就是“两个年”。"]}
{"word":"biennium","summary":{"en":"A biennium is a two-year period, often used in formal contexts like budgets or planning cycles.","zh":"biennium 指“两年期”，常用于预算、规划等较正式的语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A period of two years.","zh":"两年期；两年（的时间）"},"examples":[{"en":"The budget will cover the next biennium.","zh":"这份预算将覆盖接下来两年的周期。"},{"en":"During the last biennium, the company opened three new stores.","zh":"在过去的两年里，这家公司新开了三家门店。"}]},{"partOfSpeech":"n.","definition":{"en":"An event or system that happens every two years.","zh":"两年一次的活动；每两年举行/发生一次的制度"},"examples":[{"en":"The committee meets on a biennium schedule.","zh":"该委员会按两年一次的安排开会。"},{"en":"They host a biennium exhibition to showcase new artists.","zh":"他们每两年举办一次展览来展示新艺术家。"}]}],"synonyms":["two-year period","two years","biennial period"],"phonetic":"/baɪˈɛn.i.əm/","extraExplanation":["“biennium”来自拉丁语：bi-（二）+ annus（年）。它常见于政府、学术或组织管理语境，强调“两个年度作为一个单位”。","易混词：biennial（adj. / n.）更常用，表示“每两年的；两年一次的；两年生植物”。而 biennium 主要是名词，指“两年期”这一段时间。"]}
{"word":"bienniums","summary":{"en":"“Bienniums” is the plural of “biennium,” meaning two-year periods or terms.","zh":"“bienniums”是“biennium”的复数，表示多个“两年期/两年任期”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a period of two years; a two-year term","zh":"两年期；两年的任期/周期"},"examples":[{"en":"The grant is awarded for a biennium, with a review at the end of the two years.","zh":"该资助为期两年，并在两年结束时进行评审。"},{"en":"The committee sets its budget for each biennium.","zh":"委员会为每个两年期制定预算。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) multiple two-year periods or terms","zh":"（复数）多个两年期；多个两年任期/周期"},"examples":[{"en":"Over several bienniums, the city expanded public transit step by step.","zh":"在连续几个两年期里，这座城市逐步扩展了公共交通。"},{"en":"Sales rose in two consecutive bienniums.","zh":"销售额在连续两个两年期中上升。"}]}],"synonyms":["two-year periods","two-year terms","biennia"],"phonetic":"/baɪˈɛn.i.əmz/","extraExplanation":["“biennium”来自拉丁语：bi-（二）+ annus（年），字面意思就是“两年”。","易混词：\n- “biennium”是名词，指“两年期”。\n- “biennial”多作形容词，表示“每两年一次的/持续两年的”。例如：a biennial conference（每两年一次的会议）。","复数既可写作“bienniums”，也可写作更偏学术/拉丁的“biennia”。在现代英语里“bienniums”更常见、更口语化。"]}
{"word":"biens","summary":{"en":"“biens” is a French-derived word meaning goods or property, mainly used in formal or legal writing.","zh":"“biens”是源自法语的词，主要在正式或法律语境中表示“财物/财产/资产”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from French; plural noun) goods, property, or assets—often used in legal or formal contexts to mean a person’s possessions.","zh":"（源自法语；复数名词）财物、财产、资产；常见于法律或较正式语境，指某人拥有的财物。"},"examples":[{"en":"The contract listed all the biens transferred to the buyer.","zh":"合同列出了转让给买方的全部财物（资产）。"},{"en":"In the document, “biens” refers to both money and physical property.","zh":"在该文件中，“biens”既指金钱也指有形财产。"}]}],"synonyms":["goods","property","assets","belongings","possessions"],"phonetic":"/biˈɛnz/","extraExplanation":["“biens”是法语bien（意为“财物/财产”）的复数形式，英语里偶尔直接借用，尤其在涉及法国法律、国际合同、历史文献或比较法的材料中。","如果你在英语文章里看到它，通常不需要按英语复数规则再加-s（它本身已经是复数）；单数一般写bien（较少见）。"]}
{"word":"bienseance","summary":{"en":"Bienséance means decorum or proper behavior, and can also refer to standards of what is considered appropriate, especially in art or public expression.","zh":"Bienséance 指得体、合礼的举止，也可指（尤其在艺术或公共表达中）“什么算合宜”的规范与标准。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"proper, socially acceptable behavior; decorum (especially in polite or formal society)","zh":"（尤指礼仪社会或正式场合中的）得体举止；礼法；端庄合宜"},"examples":[{"en":"In that conservative club, even a small joke could be seen as a lack of bienséance.","zh":"在那个保守的俱乐部里，哪怕一个小玩笑也可能被视为不够得体。"},{"en":"She spoke with great bienséance, choosing words that wouldn’t embarrass anyone.","zh":"她说话非常得体，用词谨慎，不让任何人难堪。"}]},{"partOfSpeech":"n.","definition":{"en":"rules or standards of propriety in art, literature, or public speech (what is considered “appropriate” to show or say)","zh":"（艺术、文学或公共言说中的）合宜规范；得体原则（指“该不该呈现/该不该说”的标准）"},"examples":[{"en":"Classical drama often followed strict bienséance about what could be shown on stage.","zh":"古典戏剧常常遵循严格的得体原则，限制舞台上可以呈现的内容。"},{"en":"The critic argued that the film deliberately breaks bienséance to challenge the audience.","zh":"评论家认为这部电影刻意打破合宜规范，以此挑战观众。"}]}],"synonyms":["decorum","propriety","decency","good manners","etiquette"],"phonetic":"/ˌbiːɛnˈsɑːns/","extraExplanation":["“bienséance”来自法语，字面有“合乎礼仪/合乎分寸”的意思。英语里多用于较正式或评论性的语境，日常口语更常用 decency、propriety、decorum。","在法国古典戏剧批评传统中，bienséance常与“不得在舞台上直接展示过度暴力或不雅之事”等观念相关，强调观众可接受的体面与分寸。"]}
{"word":"bientt","summary":{"en":"“bientt” isn’t an English word; it’s likely a misspelling of French “bientôt,” meaning “soon.”","zh":"“bientt”不是英语单词；更可能是法语“bientôt”的拼写误差，意思是“很快；不久”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of the French word “bientôt” (often typed without accents as “bientot”), meaning “soon.”","zh":"不是标准英语单词。很可能是法语“bientôt”（常见无重音写作“bientot”）的拼写误差，意思是“很快；不久”。"},"examples":[{"en":"I’ll email you bientôt. (French-style: “I’ll email you soon.”)","zh":"我很快会给你发邮件。（法语式表达：= 我会很快发邮件。）"},{"en":"À bientôt! (Common French farewell: “See you soon!”)","zh":"À bientôt！（常见法语道别：= 很快再见！）"}]}],"synonyms":["soon","in a little while","before long"],"phonetic":"/ˌbiːɑːnˈtoʊ/","extraExplanation":["“bientôt”是法语里非常常用的时间副词，直译可理解为“很快、不久”。在英语里一般不会直接用它，除非是在法语语境、文学引用，或刻意营造法式氛围。","如果你本来想查的是英语单词，请告诉我你想表达的意思（例如“soon / event / benefit / begin”等），或给我一句包含“bientt”的原句，我可以帮你定位正确拼写与用法。"]}
{"word":"bienveillant","summary":{"en":"“Bienveillant” in French is most closely “benevolent” in English: kind, caring, and wanting to help others.","zh":"法语“bienveillant”最贴近的英语是“benevolent”：仁慈、关怀他人、乐于助人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person, attitude, or action) kind, caring, and wanting to help others.","zh":"（人、态度或行为）仁慈的、乐于助人的。"},"examples":[{"en":"She gave a benevolent smile to the new student.","zh":"她对新同学露出一个慈祥的微笑。"},{"en":"Many people remember him as a benevolent teacher who encouraged everyone.","zh":"很多人记得他是一位仁厚的老师，鼓励每一个人。"}]},{"partOfSpeech":"n.","definition":{"en":"(noun) a person or organization that gives help, especially money or support.","zh":"（名词）施惠者；慈善家；捐助者（尤指提供金钱或支持的人或机构）。"},"examples":[{"en":"The hospital thanked its benevolents for their donations.","zh":"医院感谢这些捐助者的捐款。"}]}],"synonyms":["kind","caring","compassionate","generous","charitable","kindhearted"],"phonetic":"/bəˈnɛvələnt/","extraExplanation":["“bienveillant”是法语，最常见的英语对应词是“benevolent”（更正式）或“kind / caring / supportive”（更日常）。","“benevolent”常用于较正式或书面语：如“a benevolent leader / a benevolent organization”。日常对人更常说“kind”“nice”“thoughtful”。"]}
{"word":"bienvenu","summary":{"en":"“Bienvenu” is a French-derived word meaning “welcome,” sometimes used in English for a French flavor.","zh":"“bienvenu”源自法语，意思是“欢迎/受欢迎的”，英语中偶尔借用以营造法式语感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(from French) welcome; gladly received. Used occasionally in English as a stylistic/foreign-sounding word.","zh":"（源自法语）“欢迎的；受欢迎的”。在英语中偶尔作为带法语风格/异域感的用词出现。"},"examples":[{"en":"Our host greeted us with a warm “bienvenu.”","zh":"主人用热情的“bienvenu（欢迎）”来迎接我们。"},{"en":"The café aims to feel bienvenu to newcomers.","zh":"这家咖啡馆希望让新来的客人感到受欢迎。"}]},{"partOfSpeech":"n.","definition":{"en":"a welcome (a greeting or reception).","zh":"欢迎；欢迎的致意（问候或接待）。"},"examples":[{"en":"They offered us a cheerful bienvenu at the door.","zh":"他们在门口给了我们愉快的欢迎致意。"}]}],"synonyms":["welcome","welcoming","warm reception"],"phonetic":"/ˌbjɛn.vəˈnuː/","extraExplanation":["“bienvenu/bienvenue”在法语里非常常见：对男性或泛指常用bienvenu，对女性常用bienvenue（-e结尾）。英语里偶尔借用，多用于营造法式氛围；日常英语更常说welcome。","发音提示：法语原音更接近“bjɛ̃-vuh-ny”（带鼻化元音），但英语借用时常按英语读法读。"]}
{"word":"bienvenue","summary":{"en":"“Bienvenue” is French for “welcome.”","zh":"“Bienvenue”是法语的“欢迎”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"welcome; a friendly greeting used to receive someone","zh":"欢迎；用来迎接或接待他人的友好问候"},"examples":[{"en":"Bienvenue! Please come in.","zh":"欢迎！请进。"},{"en":"The sign at the airport said “Bienvenue à Paris.”","zh":"机场的牌子写着“欢迎来到巴黎”。"}]},{"partOfSpeech":"n.","definition":{"en":"a welcome (the act or feeling of receiving someone kindly)","zh":"欢迎（热情接待他人的行为或感觉）"},"examples":[{"en":"They gave us a warm bienvenue when we arrived.","zh":"我们到达时，他们热情地欢迎了我们。"},{"en":"A smile can be a simple bienvenue.","zh":"一个微笑也可以是一种简单的欢迎。"}]}],"synonyms":["welcome"],"phonetic":"/ˌbjɛnˈvɛnjuː/","extraExplanation":["“Bienvenue”是法语里最常见的“欢迎”。在法语环境中，你常会看到“Bienvenue à + 地点”（欢迎来到……）或“Bienvenue chez + 人/机构”（欢迎来到……的店/家/机构，例如：Bienvenue chez nous = 欢迎来到我们家/我们这里）。","在英语中它多出现在法语语境（旅行、餐厅招牌、品牌文案）里；日常英语更常直接说“Welcome!”。"]}
{"word":"Bienville","summary":{"en":"Bienville is a French surname best known as the name of a colonial founder of New Orleans, and it also appears in several Louisiana place names.","zh":"Bienville 是一个法语姓氏，最著名的是指参与建立新奥尔良的法国殖民人物；它也用于路易斯安那州的一些地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Jean-Baptiste Le Moyne de Bienville (1680–1767): a French colonial leader best known for helping found New Orleans and serving as governor of French Louisiana.","zh":"让-巴蒂斯特·勒穆瓦纳·德·比恩维尔（1680–1767）：法国殖民时期的重要人物，以参与建立新奥尔良并担任法属路易斯安那总督而著称。"},"examples":[{"en":"Bienville is often credited as a key founder of New Orleans.","zh":"比恩维尔常被认为是新奥尔良的重要奠基者之一。"},{"en":"The Bienville legacy is closely tied to early French Louisiana.","zh":"比恩维尔的历史影响与早期法属路易斯安那密切相关。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name in the United States, especially in Louisiana (e.g., Bienville Parish, Bienville National Forest).","zh":"美国的地名，尤其常见于路易斯安那州（如比恩维尔教区、比恩维尔国家森林）。"},"examples":[{"en":"She drove through Bienville Parish on her way across Louisiana.","zh":"她穿过比恩维尔教区，横穿路易斯安那州。"},{"en":"They went hiking in the Bienville National Forest.","zh":"他们去比恩维尔国家森林徒步。"}]}],"phonetic":"/biˈɛn.vɪl/","extraExplanation":["“Bienville”是法语姓氏，常被英语直接借用作人名/地名。读音在英语里通常会更“英语化”，不像法语那样把词尾读得更轻。","在美国历史语境中，“Bienville”多与法国殖民、密西西比河流域开发、以及新奥尔良早期城市规划联系在一起。"]}
{"word":"bier","summary":{"en":"“Bier” is the German word for “beer,” often used in English in German contexts (e.g., menus, travel).","zh":"“Bier”是德语的“啤酒”，英语里多在德国语境中出现（如菜单、旅行场景）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Beer; an alcoholic drink made by fermenting grains (especially barley) with hops and water.","zh":"啤酒；用谷物（尤指大麦）加啤酒花和水发酵制成的酒精饮料。"},"examples":[{"en":"He ordered a bier at the pub.","zh":"他在酒吧点了一杯“bier”（啤酒）。"},{"en":"In Germany, “Bier” simply means “beer.”","zh":"在德国，“Bier”就只是“beer（啤酒）”的意思。"}]}],"synonyms":["beer","lager","ale"],"phonetic":"/bɪr/","extraExplanation":["“bier”在英语里也有另一个完全不同的意思：指“棺材架/灵柩台”（用于抬棺或停放棺材的架子），发音不同：/bɪr/。而你输入的“Bier”（德语“啤酒”）通常按英语读作 /bɪr/ 或近似“beer”的读法，但在学习英语时要特别注意不要和“bier（灵柩台）”混淆。"]}
{"word":"bierbalk","summary":{"en":"“bierbalk” is not standard English; it’s likely a Dutch/German term meaning a beer-related bar/rail/beam used for serving or placing drinks.","zh":"“bierbalk”不是标准英语；很可能是荷兰语/德语用词，指与啤酒供应或放置有关的吧台横杆/栏杆/横梁。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard/rare; likely from Dutch or German) A bar/rail/beam associated with serving or placing beer (for example, a simple beer counter or beam/rail at an outdoor bar).","zh":"（非标准/很少见；可能源自荷兰语或德语）与啤酒摆放或供应有关的“横梁/吧台横杆/栏杆”（例如简易啤酒吧台上的横杆或放杯的栏杆）。"},"examples":[{"en":"At the festival tent, people lined up at the bierbalk to get their drinks.","zh":"在节日帐篷里，人们在 bierbalk 前排队买饮料。"},{"en":"He set the beer glasses on the bierbalk while he paid.","zh":"他付钱时把啤酒杯先放在 bierbalk 上。"}]}],"synonyms":["beer rail","bar rail","(possible intended word) bierbank"],"phonetic":"/ˈbɪr.bɑlk/","extraExplanation":["“bierbalk”不是常见英语词条，更像是荷兰语/德语的复合词：bier=“啤酒”，balk=“梁、横杆”。在英语语境里通常只会在谈到荷兰/德国的场景、当地物件名称、或店家自创用语时看到。","你可能想写的是 **bierbank**（德语/荷兰语：啤酒长凳/啤酒桌凳）或 **bierbal**（荷兰小吃“啤酒球”）。如果你能提供出现它的句子或图片，我可以更准确判断。"]}
{"word":"Bierce","summary":{"en":"Bierce usually refers to Ambrose Bierce, an American writer known for Civil War fiction and biting satire (especially The Devil’s Dictionary).","zh":"Bierce 通常指美国作家安布罗斯·比尔斯，以内战题材小说和尖锐讽刺（尤以《魔鬼辞典》）著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ambrose Bierce (1842–c.1914), an American writer and journalist best known for sharp satire and for stories about the American Civil War.","zh":"安布罗斯·比尔斯（Ambrose Bierce，1842–约1914），美国作家与记者，以尖锐讽刺写作和描写美国内战的短篇小说闻名。"},"examples":[{"en":"Ambrose Bierce wrote many short stories set during the Civil War.","zh":"安布罗斯·比尔斯写了许多以美国内战为背景的短篇小说。"},{"en":"In class, we read a definition from Bierce’s The Devil’s Dictionary to see how satire works.","zh":"课堂上我们读了比尔斯《魔鬼辞典》里的一个词条，来理解讽刺是怎样起作用的。"}]}],"synonyms":["Ambrose Bierce"],"phonetic":"/bɪrs/","extraExplanation":["“Bierce”常指作家 Ambrose Bierce。其作品《An Occurrence at Owl Creek Bridge》（《奥尔溪桥事件》）常被选入英语文学选读；《The Devil’s Dictionary》（《魔鬼辞典》）以“反常规”的方式给词下定义，语言犀利、黑色幽默浓。","读法提示：Bierce 通常读作 /bɪrs/，听起来接近“beers”（啤酒的复数）但更短、更硬。"]}
{"word":"biergarten","summary":{"en":"A German-style outdoor beer garden.","zh":"德式的户外啤酒花园。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A beer garden: an outdoor place (often with long shared tables) where people drink beer and sometimes eat simple food, especially common in Germany.","zh":"啤酒花园：一种户外饮酒场所（常见长桌共坐），人们喝啤酒、有时也吃简餐；在德国尤其常见。"},"examples":[{"en":"Let’s meet at the biergarten after work for a drink.","zh":"下班后我们去啤酒花园喝一杯吧。"},{"en":"The biergarten was crowded on a warm summer evening.","zh":"在温暖的夏夜，啤酒花园里人很多。"},{"en":"Many biergartens serve pretzels and sausages along with beer.","zh":"很多啤酒花园会搭配供应椒盐卷饼和香肠。"}]}],"synonyms":["beer garden","outdoor beer garden","beer hall (related, usually indoor)"],"phonetic":"/ˈbɪrˌɡɑr.tən/","extraExplanation":["“Biergarten”是德语外来词：Bier=啤酒，Garten=花园。英语里也常直接用这个词，尤其在谈到德式氛围（户外长桌、轻松社交、家庭友好）时。","在德国传统上有些啤酒花园允许自带食物，但饮品通常需要现场购买；不同城市/店家规则可能不同。"]}
{"word":"bierkeller","summary":{"en":"Bierkeller means a German-style beer cellar or beer hall, often associated with lively drinking and long-table seating.","zh":"Bierkeller指“啤酒地窖”或“德式地下啤酒馆”，常让人联想到热闹的饮酒氛围与长桌座位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a beer cellar or underground beer hall (a German-style place where beer is stored and/or served, often with long tables and a lively atmosphere)","zh":"啤酒地窖；（德式）地下啤酒馆（常见于长桌、热闹氛围的饮酒场所）"},"examples":[{"en":"Let’s meet at the Bierkeller after work for a drink.","zh":"下班后我们去那家Bierkeller见面喝一杯吧。"},{"en":"The festival’s main events were held in a big Bierkeller with music and long wooden tables.","zh":"节庆的主要活动在一间大型Bierkeller举行，里面有音乐和长木桌。"}]}],"synonyms":["beer hall","beer cellar","German beer hall"],"phonetic":"ˈbɪrˌkɛlər","extraExplanation":["“Bierkeller”来自德语：Bier（啤酒）+ Keller（地窖/地下室）。在德语文化里，它既可能指用于储存啤酒的地窖，也常指带有巴伐利亚风格的啤酒馆。英语里多用于营造“德式啤酒馆/啤酒节”的氛围。","相关表达：beer hall（啤酒馆）、beer cellar（啤酒地窖）、Biergarten（露天啤酒花园，和Bierkeller相对，强调户外）。"]}
{"word":"Bierman","summary":{"en":"Bierman is most commonly a surname (a last name).","zh":"Bierman 最常见的用法是姓氏（英文中的“姓/家族名”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), often of German origin; used to refer to a person whose last name is Bierman.","zh":"（姓氏）Bierman，常见于德裔背景；用来指姓 Bierman 的人。"},"examples":[{"en":"Dr. Bierman will lead today’s workshop.","zh":"Bierman 博士将主持今天的工作坊。"},{"en":"I emailed Ms. Bierman to confirm the appointment.","zh":"我发邮件给 Bierman 女士确认预约。"}]}],"phonetic":"/ˈbɪrmən/","extraExplanation":["“Bierman”多被用作姓氏，常被认为与德语姓氏“Biermann”有关：Bier=啤酒，-mann=男人/人，历史上可能指与酿酒、卖酒相关的人。","英语里读作两拍，重音在第一拍：BIER-man。作为专有名词，通常首字母大写。","如果你是在科学或学术语境中见到它，也可能是指某位名为 Bierman/Biermann 的学者或其提出的概念；需要结合上下文判断。"]}
{"word":"Biernat","summary":{"en":"Biernat is mainly a Polish surname (and occasionally a given name in historical contexts).","zh":"Biernat 主要是一个波兰姓氏（历史语境中偶尔也作人名）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Polish surname (family name); also sometimes used as a given name in Polish history.","zh":"一个波兰姓氏（家族姓）；在波兰历史语境中也偶尔作为人名出现。"},"examples":[{"en":"Dr. Biernat published a paper on public health.","zh":"比尔纳特博士发表了一篇关于公共健康的论文。"},{"en":"In the roster, Biernat appears under the letter B.","zh":"在名单里，Biernat 排在字母 B 下面。"}]}],"synonyms":["(no direct synonym; it is a name)"],"phonetic":"/ˈbɪr.næt/","extraExplanation":["“Biernat”常见于波兰语语境。它与波兰语人名/昵称传统有关，历史上也可作为“Bernard（伯纳德）”一类名字的波兰化形式出现。英语里多按拼写读作两音节（类似“BEER-nat/BEER-not”），具体读音可能因家庭或地区而不同。"]}
{"word":"biers","summary":{"en":"“Biers” is the plural of “bier,” meaning a stand or platform that holds a coffin or a body at a funeral.","zh":"“biers”是“bier”的复数，指（葬礼等场合）用于放置棺材或遗体的棺台/停尸架。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a stand (often a frame or platform) used to support a coffin or a dead body, especially at a funeral; plural of “bier”","zh":"（尤指葬礼上用于支撑棺材或遗体的）停尸架/棺台；“bier”的复数"},"examples":[{"en":"The coffin rested on a bier at the front of the church.","zh":"棺材放在教堂前方的棺台上。"},{"en":"In old stories, the biers were carried through the village in silence.","zh":"在旧故事里，棺台被人们默默地穿过村庄抬着走。"}]}],"synonyms":["coffin stand","funeral platform","catafalque (more formal/specific)"],"phonetic":"/bɪr/","extraExplanation":["“bier”是一个比较正式、偏文学或历史语境的词，日常英语里更常说 coffin stand（棺材架）或 simply “the stand/platform.”","常见搭配：funeral bier（葬礼棺台）、to rest/lie on a bier（停放在棺台上）。","在一些文学作品或史诗式叙述中会用 bier 来营造庄重、哀悼的氛围；不要和 beer（啤酒）混淆，拼写只差一个字母但意义完全不同。"]}
{"word":"bierstube","summary":{"en":"Bierstube means a German-style beer hall or beer tavern.","zh":"Bierstube 指德式（常为巴伐利亚风格）的啤酒馆或啤酒酒馆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A beer hall or beer tavern, especially one in a German or Bavarian style.","zh":"（尤指德式/巴伐利亚风格的）啤酒馆、啤酒酒馆。"},"examples":[{"en":"We had dinner at a cozy Bierstube with pretzels and local beer.","zh":"我们在一家温馨的德式啤酒馆吃了晚餐，配着椒盐卷饼和本地啤酒。"},{"en":"The hotel’s Bierstube is busiest during Oktoberfest season.","zh":"这家酒店的啤酒馆在啤酒节（Oktoberfest）期间最热闹。"}]}],"synonyms":["beer hall","beer tavern","German-style pub"],"phonetic":"/ˈbɪrˌstuːbə/","extraExplanation":["“Bierstube”来自德语：Bier（啤酒）+ Stube（房间、小厅），字面意思是“喝啤酒的小厅/房间”。在英语语境里多用来指带有德式氛围的啤酒馆，常见元素有木质装潢、长桌、德式餐点（如香肠、酸菜、椒盐卷饼）等。","与“beer garden（啤酒花园）”不同，Bierstube通常更偏室内、像小酒馆；与“pub”相比，Bierstube强调德式风格而不一定是英式酒吧文化。"]}
{"word":"bierstuben","summary":{"en":"Bierstuben are German-style beer halls (plural of Bierstube).","zh":"Bierstuben 指德式啤酒馆（Bierstube 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) German-style beer halls or beer rooms—places where people gather to drink beer, eat hearty food, and socialize.","zh":"（复数）德式啤酒馆/啤酒屋——人们聚在一起喝啤酒、吃家常厚实食物并社交的场所。"},"examples":[{"en":"After the tour, we stopped at a local Bierstuben for sausages and beer.","zh":"参观结束后，我们去当地的一家德式啤酒馆吃香肠、喝啤酒。"},{"en":"Munich has many Bierstuben where families and friends meet in the evening.","zh":"慕尼黑有很多德式啤酒屋，家人和朋友晚上常在那里聚会。"}]}],"synonyms":["beer hall","beerhouse","pub"],"phonetic":"/ˈbɪrˌʃtuːbən/","extraExplanation":["“Bierstuben”来自德语：Bier（啤酒）+ Stube（房间/小厅），单数是“Bierstube”。在英语里它多用于描述德国或中欧风格的啤酒馆氛围。","在文化语境中，它通常让人联想到木质长桌、热食（如香肠、酸菜、椒盐卷饼）以及轻松热闹的社交场景。","近义表达（更常见的英语说法）包括：beer hall, beerhouse, pub（但pub更偏英式/泛指酒吧）。"]}
{"word":"bierstubes","summary":{"en":"“Bierstubes” means German-style beer pubs/beer halls (plural).","zh":"“bierstubes”指“德式啤酒馆/啤酒吧”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of bierstube: a German-style beer pub or beer hall, often serving German beer and food in a casual, social setting","zh":"bierstube 的复数：德式啤酒馆/啤酒吧（常提供德国啤酒与德式餐点，氛围偏热闹社交）"},"examples":[{"en":"Many bierstubes in the U.S. serve pretzels, sausages, and draft lager.","zh":"美国很多德式啤酒馆会提供椒盐卷饼、香肠和生啤（拉格）。"},{"en":"We visited a few bierstubes near the festival grounds after the concert.","zh":"音乐会结束后，我们在节庆场地附近去了几家德式啤酒馆。"}]}],"synonyms":["beer halls","beer pubs","German beer halls","bierstuben","beer gardens"],"phonetic":"/ˈbɪrˌstuːbz/","extraExplanation":["“Bierstube”来自德语：Bier（啤酒）+ Stube（房间/小厅），常用来指较温馨、室内的啤酒馆；在英语里有时也泛指“德式风格的酒馆/啤酒屋”。","在英文语境中也常见近义词：beer hall（啤酒大厅，规模更大更热闹）、beer garden（啤酒花园，偏户外）。"]}
{"word":"biestings","summary":{"en":"Beestings means the first milk after an animal gives birth (colostrum).","zh":"Beestings 指动物产后最初的乳汁（初乳）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) the first milk produced by a cow (or other mammal) after giving birth; colostrum.","zh":"（复数）母牛（或其他哺乳动物）产仔后最初分泌的乳汁；初乳。"},"examples":[{"en":"Farmers often save beestings because it is rich in antibodies for newborn calves.","zh":"农场主常会把 beestings 留下来，因为它富含抗体，对新生小牛很重要。"},{"en":"In some places, beestings is used to make a simple baked pudding.","zh":"在一些地方，人们会用 beestings 做一种简单的烤布丁。"}]}],"synonyms":["colostrum","first milk"],"phonetic":"/ˈbiːstɪŋz/","extraExplanation":["“beestings”在现代英语里比较少见，更常见的标准词是“colostrum（初乳）”。在英国及一些方言/旧用法中会看到“beestings / beastings”的拼写。","严格说它可以作不可数名词（beestings is…），但也常以复数形式出现来指“这种初乳”。写作和学术语境中建议用“colostrum”。"]}
{"word":"biethnic","summary":{"en":"Biethnic means involving or belonging to two ethnic groups.","zh":"biethnic 指“与两个族裔有关的/具有双族裔背景的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or involving two ethnic groups, especially in a person or family background.","zh":"与两个族裔群体有关的；（尤指个人或家庭背景）具有两个族裔成分的。"},"examples":[{"en":"She identifies as biethnic because her mother is Korean and her father is Mexican.","zh":"她认同自己是双族裔，因为母亲是韩国人，父亲是墨西哥人。"},{"en":"The study focused on the experiences of biethnic students in multicultural schools.","zh":"这项研究聚焦于多元文化学校中双族裔学生的经历。"}]}],"synonyms":["multiethnic","bicultural","of mixed ethnic heritage"],"phonetic":"/baɪˈɛθnɪk/","extraExplanation":["“bi-”表示“二、双”（如 bilingual 双语、bicultural 双文化），“ethnic”指“族裔的”。因此 biethnic 字面意思就是“两个族裔的”。","在日常英语中，biethnic 没有 biracial（双种族的）常见。biethnic 更强调“族裔/文化归属”，不一定强调“种族分类”。在人群身份表达时，建议尊重当事人自我认同的用词。"]}
{"word":"biethnically","summary":{"en":"Biethnically means “in a way that involves two ethnic groups or identities.”","zh":"biethnically 意为“以涉及两个族裔群体或身份的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that involves two ethnic groups; with two ethnic identities or perspectives.","zh":"以涉及两个族裔群体的方式；以双族裔身份或视角来看。"},"examples":[{"en":"The program serves biethnically diverse neighborhoods.","zh":"这个项目服务于双族裔多元的社区。"},{"en":"She identifies biethnically and wants both sides of her heritage recognized.","zh":"她认同自己是双族裔，希望自己的两种文化传承都被认可。"}]}],"synonyms":["of two ethnic backgrounds","with dual ethnic identity","biculturally (close in meaning, not identical)"],"phonetic":"/baɪˌɛθnɪkli/","extraExplanation":["“bi-”表示“两个/双”，与“ethnic（族裔的）”结合形成“biethnic（双族裔的）”，再加“-ally”变成副词“biethnically”。","该词在学术写作、社会学研究或人口统计语境中更常见；日常口语里更常用“from two ethnic backgrounds / of mixed ethnicity（来自两种族裔背景/混合族裔）”。","注意它强调“两个（two）”，如果涉及多于两个族裔背景，常用“multiethnically（多族裔地）”。"]}
{"word":"bietle","summary":{"en":"“Bietle” is likely a misspelling of “beetle” (an insect) or “Beatle” (a member of The Beatles).","zh":"“bietle”很可能是“beetle”（甲虫）或“Beatle”（披头士成员）的拼写错误。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small insect with a hard shell-like back (elytra); many beetles can fly and some can damage plants or stored food","zh":"甲虫；一种背部有坚硬外壳（鞘翅）的昆虫；很多甲虫会飞，有些会危害植物或储存的食物"},"examples":[{"en":"A shiny black beetle crawled across the sidewalk.","zh":"一只亮黑色的甲虫爬过人行道。"},{"en":"Some beetles can harm crops in the summer.","zh":"有些甲虫在夏天会危害农作物。"}]},{"partOfSpeech":"n.","definition":{"en":"(usually plural) one of the four musicians in the British rock band The Beatles","zh":"（通常用复数）英国摇滚乐队“披头士”（The Beatles）的成员之一"},"examples":[{"en":"My dad grew up listening to the Beatles.","zh":"我爸爸是听披头士的歌长大的。"},{"en":"Two of the Beatles were Lennon and McCartney.","zh":"披头士的两位成员是列侬和麦卡特尼。"}]}],"synonyms":["insect (general)","bug (informal, general)","scarab (type of beetle)"],"phonetic":"/ˈbiːtəl/","extraExplanation":["你输入的“bietle”更常见是拼写错误：可能想写 **beetle**（甲虫）或 **Beatle**（披头士成员）。两者发音相同，但含义完全不同：前者是昆虫，后者是专有名词（乐队成员）。","补充：**The Beatles** 是20世纪最有影响力的流行/摇滚乐队之一，常被用于文化与音乐史的语境中。"]}

