{"word":"BiH","summary":{"en":"BiH = Bosnia and Herzegovina (abbreviation).","zh":"BiH = 波斯尼亚和黑塞哥维那（波黑）的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation for Bosnia and Herzegovina, a country in Southeastern Europe.","zh":"波斯尼亚和黑塞哥维那（简称“波黑”）的缩写，位于东南欧的一个国家。"},"examples":[{"en":"He was born in BiH and moved to the U.S. when he was ten.","zh":"他出生在波黑（BiH），十岁时搬到了美国。"},{"en":"The team from BiH qualified for the tournament.","zh":"来自波黑（BiH）的球队晋级了这项赛事。"},{"en":"This report compares wages in BiH with neighboring countries.","zh":"这份报告比较了波黑（BiH）与周边国家的工资水平。"}]}],"synonyms":["Bosnia and Herzegovina","Bosnia"],"phonetic":"/ˌbiː aɪ ˈeɪtʃ/","extraExplanation":["“BiH”常见于新闻、学术文章、政府文件、体育赛事等语境，是“Bosnia and Herzegovina”的缩写；在日常英文对话里也有人直接说“Bosnia”或“Bosnia and Herzegovina”。","写法通常是大写字母“BiH”，读作字母音“B-I-H”。","中文里更常用“波黑”（取“波斯尼亚/黑塞哥维那”的简称）；英文里“Bosnia”有时被用作简略称呼，但正式名称是“Bosnia and Herzegovina”。"]}
{"word":"Bihai","summary":{"en":"“Bihai” is commonly used as Chinese internet slang meaning “awesome/very impressive,” and it can also refer to “碧海,” meaning an “azure sea,” often in names or poetic imagery.","zh":"“Bihai”常见用法是中文网络俚语，表示“很厉害/很牛”；也可能对应“碧海”，指“湛蓝的大海”，常见于人名或诗意表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Internet slang, from Chinese pinyin) very impressive; extremely capable; “awesome” (often with a playful or slightly edgy tone).","zh":"（网络俚语，源自中文拼音）很厉害；非常牛；“太强了/太酷了”（常带调侃或略带“冲”的语气）。"},"examples":[{"en":"That programmer is really bihai—she fixed the bug in five minutes.","zh":"那个程序员真的很 bihai——五分钟就把 bug 修好了。"},{"en":"Your presentation was bihai; everyone understood the problem right away.","zh":"你的展示太 bihai 了；大家一下就懂问题在哪。"}]},{"partOfSpeech":"n.","definition":{"en":"A Chinese given name or poetic term tied to the characters “碧海,” meaning “blue/emerald sea; azure ocean.”","zh":"中文人名或诗意用语，常对应“碧海”，意为“碧蓝的大海；苍翠/湛蓝的海洋”。"},"examples":[{"en":"In some translations, the phrase “bihai” refers to an azure sea in classical-style imagery.","zh":"在一些翻译里，“bihai”会用来指代古典意象中的“碧海”。"},{"en":"Bihai is also used as a personal name in Chinese contexts.","zh":"在中文语境中，Bihai 也会被用作人名。"}]}],"synonyms":["awesome","impressive","amazing","excellent","formidable"],"phonetic":"/biːˈhaɪ/","extraExplanation":["“bihai（逼害/屄害）”在口语和网络上常被当作“厉害”的谐音/变体来用，语气更夸张，有时带一点粗口来源的影子；正式写作或商务场合建议改用“impressive / amazing / excellent”。","如果你看到的是“碧海”，它常出现在诗词或固定搭配里，比如“碧海青天”（形容辽阔清澈的天空与海）。"]}
{"word":"bihai","summary":{"en":"“bihai” is Chinese internet slang meaning “awesome/very impressive,” and can also be an emphatic exclamation depending on context.","zh":"“bihai”是中文网络用语，表示“很厉害/很牛”，也可作加强语气的感叹词，具体看语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chinese internet slang, from pinyin “bīhài”) very impressive; awesome; formidable (sometimes with a slightly tough or boastful tone).","zh":"（中文网络用语，源自拼音“bīhài”）很厉害；很牛；很强（有时带点耍酷/自夸语气）。"},"examples":[{"en":"That gamer is bihai—he wins almost every match.","zh":"那个玩家太 bihai 了——几乎把把都赢。"},{"en":"Her coding skills are really bihai.","zh":"她的编程水平真的很 bihai。"}]},{"partOfSpeech":"int.","definition":{"en":"(Slang) used as an emphatic reaction meaning “damn, that’s intense/serious,” depending on context.","zh":"（俚语）用作加强语气的感叹，类似“哇靠/太狠了/太夸张了”（看语境）。"},"examples":[{"en":"Bihai… that exam was brutal.","zh":"bihai……那考试也太难了。"},{"en":"Bihai, it’s freezing outside.","zh":"bihai，外面冻死了。"}]}],"synonyms":["awesome","impressive","amazing","formidable","really skilled"],"phonetic":"/ˈbiːhaɪ/","extraExplanation":["“bihai/bi hai”常见于中文语境（尤其是网络、游戏、弹幕），在英文聊天中多作为中文夹杂使用，而不是标准英语单词。","它带一点粗口/强烈语气的味道：对熟人、轻松场合更常用；在正式场合或不熟的人面前不太合适。","更中性、礼貌的英文表达可用：impressive, amazing, outstanding, really skilled, formidable。"]}
{"word":"bihalve","summary":{"en":"“Behalf” is mainly used in “on behalf of” to mean “representing someone” or “for someone’s benefit.”","zh":"“behalf”主要用于“on behalf of”，表示“代表某人”或“为了某人的利益”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Most often used in the phrase “on behalf of”) the interest or benefit of someone; the side or support of someone.","zh":"（最常用于短语“on behalf of”）为了某人的利益；代表某人一方；支持某人。"},"examples":[{"en":"I’m writing on behalf of my colleague who is out sick.","zh":"我代表我那位生病请假的同事写这封信。"},{"en":"On behalf of everyone here, thank you for coming.","zh":"我代表在场的所有人，感谢你的到来。"},{"en":"They spoke on behalf of the local community.","zh":"他们代表当地社区发言。"}]},{"partOfSpeech":"phrase","definition":{"en":"used in the phrase “on behalf of” to mean “as a representative of” or “for the benefit of.”","zh":"用于短语“on behalf of”，表示“代表……”或“为了……的利益”。"},"examples":[{"en":"She accepted the award on behalf of the whole team.","zh":"她代表整个团队领奖。"},{"en":"He donated money on behalf of his parents.","zh":"他以父母的名义（或代表父母）捐了款。"}]}],"synonyms":["in the name of","for","as a representative of","in support of"],"phonetic":"/bəˈhæf/","extraExplanation":["“bihalve”不是标准英文拼写，最常见的对应是 **behalf**（常见搭配：on behalf of）。","如果你本来想写的是 **behalve**（更常见于英式/欧洲语境，意思是“除了……之外/except”），拼写和用法与 **behalf** 不同：\n- **behalve** = except (e.g., Everyone came behalve John. / 除了约翰，大家都来了。)\n- **on behalf of** = representing/for the benefit of (e.g., on behalf of John / 代表约翰)"]}
{"word":"Biham","summary":{"en":"“Biham” is generally a proper name (most often a surname), not a common English word.","zh":"“Biham”一般是专有名词（多为姓氏），不是常见英语单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (usually a surname; occasionally a place name). It is not a common standard English vocabulary word, and meaning depends on the specific person or location.","zh":"专有名词（通常是姓氏；偶尔是地名）。它不是常见的英语词汇，具体含义取决于指代的人或地点。"},"examples":[{"en":"Dr. Biham will present the research results tomorrow.","zh":"比哈姆博士将于明天展示研究结果。"},{"en":"I met someone named Biham at the conference.","zh":"我在会议上遇到一位姓比哈姆的人。"},{"en":"Please confirm whether “Biham” is the correct spelling of the name.","zh":"请确认“Biham”这个名字的拼写是否正确。"}]}],"phonetic":"/ˈbiːhæm/","extraExplanation":["“Biham”在英语里通常作为姓名出现（尤其是姓）。如果你是在阅读中看到它，也有可能是拼写变体或误拼，比如更常见的“Bingham”。如果你告诉我它出现的句子或上下文，我可以帮你判断它指的是人名、地名，还是某个品牌/机构名。"]}
{"word":"biham","summary":{"en":"“biham” is not a standard English word; it’s likely a name or a misspelling (possibly “Bingham”).","zh":"“biham”不是标准英语单词；更可能是人名/地名或拼写错误（可能是“Bingham”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a proper name (a surname/place name) or a misspelling of a similar word (for example, “Bingham”).","zh":"不是标准英语单词。更可能是专有名词（人名/地名）或某个相近词的拼写错误（例如“Bingham”）。"},"examples":[{"en":"I couldn’t find a dictionary entry for “biham”; it may be a name.","zh":"我在词典里找不到“biham”；它可能是一个名字。"},{"en":"Did you mean “Bingham” (a surname and place name)?","zh":"你是不是想写“Bingham”（常见的姓氏/地名）？"}]}],"phonetic":"/ˈbaɪhæm/","extraExplanation":["“biham”在常见英语词典中没有固定词条。如果这是你在文章、聊天或游戏里看到的拼写，建议你：\n1) 提供上下文句子（我可以据此判断是不是人名/地名/缩写）；\n2) 检查是否漏了字母（例如 Bingham, biham→by him 等）；\n3) 如果是专有名词，告诉我你看到它的来源（国家/作品/网站），我可以更准确解释。"]}
{"word":"bihamate","summary":{"en":"Behemoth means something extremely large or powerful; it can also refer to a huge creature mentioned in the Bible.","zh":"behemoth 表示“庞然大物、巨头”，也可指《圣经》中提到的巨兽“贝希摩斯”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very large, powerful, or important person, organization, or thing; something enormous.","zh":"庞然大物；极其巨大或强大的事物/人物/组织。"},"examples":[{"en":"The company became a tech behemoth in just ten years.","zh":"这家公司在短短十年内就成了科技巨头。"},{"en":"A behemoth truck blocked the narrow street.","zh":"一辆巨型卡车堵住了狭窄的街道。"}]},{"partOfSpeech":"n.","definition":{"en":"In the Bible (Book of Job), a huge, mysterious creature used as a symbol of great strength.","zh":"（《圣经·约伯记》中）巨兽“贝希摩斯”，象征强大力量的神秘生物。"},"examples":[{"en":"The poem compares the monster to Behemoth from the Book of Job.","zh":"这首诗把怪物比作《约伯记》中的“贝希摩斯”。"}]}],"synonyms":["giant","monster","colossus","juggernaut","titan"],"phonetic":"/bəˈhiːməθ/","extraExplanation":["你输入的“bihamate”不是常见英语单词，最接近且很常用的词是“behemoth”。如果你原本想查的是别的词（例如“bicarbonate / bicarbonate”等），可以再发一次正确拼写或给我一个句子，我可以更准确判断。","“behemoth”常用于新闻和商业语境，表示“巨头/巨无霸”；也常用于文学或奇幻作品里形容巨大怪兽。"]}
{"word":"Bihar","summary":{"en":"Bihar is a state in eastern India with a rich historical and cultural background.","zh":"Bihar（比哈尔邦）是印度东部的一个邦，具有深厚的历史与文化背景。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A state in eastern India, known for its long history and important cultural and religious sites.","zh":"（印度）比哈尔邦：位于印度东部的一个邦，以悠久历史以及重要的文化与宗教遗址而闻名。"},"examples":[{"en":"My friend is from Bihar, and he speaks Hindi and Bhojpuri.","zh":"我的朋友来自比哈尔邦，他会说印地语和博杰普里语。"},{"en":"Bihar has several important Buddhist sites, including Bodh Gaya.","zh":"比哈尔邦有多个重要的佛教圣地，包括菩提伽耶（Bodh Gaya）。"}]}],"synonyms":["the state of Bihar"],"phonetic":"/bɪˈhɑr/","extraExplanation":["“Bihar”是专有名词，写作首字母大写。常见搭配包括：the state of Bihar（比哈尔邦）、in Bihar（在比哈尔邦）、Bihar’s capital Patna（比哈尔邦首府巴特那/Patna）。","比哈尔在历史上与古代的摩揭陀（Magadha）地区密切相关；菩提伽耶（Bodh Gaya）被认为是佛陀悟道之地，因此在佛教文化中常被提及。","语言方面，比哈尔地区除印地语外，也常见博杰普里语（Bhojpuri）、迈蒂利语（Maithili）、马加希语（Magahi）等。"]}
{"word":"Bihar-born","summary":{"en":"“Bihar-born” means born in the Indian state of Bihar.","zh":"“Bihar-born”指“出生于印度比哈尔邦”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Born in Bihar (a state in eastern India); used to describe a person whose birthplace is Bihar.","zh":"出生于比哈尔邦（印度东部的一个邦）；用于描述一个人的出生地在比哈尔邦。"},"examples":[{"en":"The Bihar-born writer often draws on village life in his stories.","zh":"这位出生于比哈尔邦的作家经常在作品中描写乡村生活。"},{"en":"She is a Bihar-born engineer now working in Bengaluru.","zh":"她是一位出生于比哈尔邦、现于班加罗尔工作的工程师。"},{"en":"A Bihar-born student won the scholarship.","zh":"一名出生于比哈尔邦的学生获得了奖学金。"}]}],"synonyms":["Bihar native","born in Bihar","from Bihar"],"phonetic":"/ˌbɪˈhɑr bɔrn/","extraExplanation":["“Bihar-born”是由“Bihar（比哈尔邦）+ born（出生的）”组成的复合形容词，常用连字符连接，用来修饰名词（如Bihar-born politician/artist/student）。","写作中也可见不加连字符的形式“Bihar born”，但在名词前作定语时用连字符更常见、更清晰。","文化背景：比哈尔邦位于印度东部，常被视为历史文化悠久的地区（如古代那烂陀大学所在地），在新闻与人物介绍中常用“Bihar-born”点出出生地。"]}
{"word":"Bihar-related","summary":{"en":"Meaning “connected with Bihar (India)”—used to describe topics, people, culture, or events linked to the state of Bihar.","zh":"表示“与印度比哈尔邦有关的”，用于描述与比哈尔相关的议题、人物、文化或事件。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with Bihar (a state in eastern India), its people, culture, language, history, or affairs.","zh":"与比哈尔邦（印度东部的一个邦）及其人民、文化、语言、历史或事务有关的。"},"examples":[{"en":"The museum opened a Bihar-related exhibition featuring folk art and textiles.","zh":"博物馆举办了一个与比哈尔相关的展览，展示民间艺术与纺织品。"},{"en":"She is doing Bihar-related research on migration and rural development.","zh":"她正在做与比哈尔相关的研究，主题是迁移与乡村发展。"},{"en":"We need Bihar-related contacts to arrange interviews in Patna.","zh":"我们需要与比哈尔相关的人脉来安排在巴特那的采访。"}]}],"synonyms":["related to Bihar","Bihar-specific","Bihar-focused","Bihar-connected"],"phonetic":"/bɪˈhɑr rɪˌleɪtɪd/","extraExplanation":["“Bihar-related”是一个由专有名词“Bihar（比哈尔邦）”+“related（相关的）”构成的复合形容词，常用于新闻、学术写作和商务语境，用来更中性、概括地表示“与比哈尔有关”。","如果要更具体，可以用：Bihari（比哈尔的；比哈尔人/比哈尔语的），例如“Bihari cuisine（比哈尔菜）”“Bihari speakers（说比哈尔语的人）”。注意：在某些语境里“Bihari”也指来自比哈尔的人，使用时保持尊重、避免刻板印象。","写法上通常加连字符：Bihar-related。放在名词前作定语最常见（Bihar-related issues/news/studies）。也可改写为“related to Bihar”。"]}
{"word":"Bihari","summary":{"en":"Bihari means a person from Bihar, India, or something related to Bihar and its people.","zh":"Bihari 指来自印度比哈尔邦的人，也可指与比哈尔邦及其人民相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Bihar, a state in eastern India","zh":"比哈尔人；来自印度东部比哈尔邦的人"},"examples":[{"en":"My roommate is a Bihari from Patna.","zh":"我的室友是比哈尔人，来自巴特那（Patna）。"},{"en":"Many Bihari workers move to other Indian states for jobs.","zh":"许多比哈尔邦的劳动者会到印度其他邦打工。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Bihar or its people","zh":"比哈尔邦的；比哈尔人的"},"examples":[{"en":"Bihari cuisine often includes litti chokha.","zh":"比哈尔菜常见的食物有“litti chokha”。"},{"en":"She is researching Bihari history and politics.","zh":"她在研究比哈尔的历史与政治。"}]}],"synonyms":["from Bihar","resident of Bihar","Bihar-born"],"phonetic":"/bɪˈhɑːri/","extraExplanation":["“Bihari”既可以指“比哈尔邦的人”，也可作形容词指“比哈尔的/比哈尔人的”。在印度语境里，它常常是地区身份标签。","语言上要注意：有时人们会说“Bihari languages（比哈尔诸语言）”，通常指比哈尔地区常见的语言，如博杰普里语（Bhojpuri）、迈蒂利语（Maithili）、马加希语（Magahi）等；它不一定等同于“Hindi（印地语）”。","跨文化表达建议：在正式写作中可说“people from Bihar（来自比哈尔邦的人）”；若不确定对方认同的身份标签，用对方自称更稳妥。"]}
{"word":"bihari","summary":{"en":"Bihari means “from Bihar (India),” and can also refer to a person from Bihar or to languages spoken in Bihar.","zh":"Bihari 指“来自印度比哈尔邦的”，也可指比哈尔人，或指比哈尔地区使用的语言（群）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Bihar (a state in eastern India), its people, or its culture","zh":"与印度东部比哈尔邦（Bihar）及其人民、文化有关的；比哈尔的"},"examples":[{"en":"Bihari food often includes litti chokha, a popular local dish.","zh":"比哈尔菜常见有 litti chokha（烤面团配蔬菜泥），是一道很受欢迎的当地料理。"},{"en":"She studies Bihari history and politics in modern India.","zh":"她研究现代印度的比哈尔历史与政治。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Bihar","zh":"比哈尔人（来自比哈尔邦的人）"},"examples":[{"en":"He is a Bihari who moved to Delhi for work.","zh":"他是比哈尔人，为了工作搬到德里。"},{"en":"Many Biharis speak more than one language at home.","zh":"许多比哈尔人家里会说不止一种语言。"}]},{"partOfSpeech":"n.","definition":{"en":"a group of closely related languages spoken mainly in Bihar (sometimes used broadly; often referring to languages such as Bhojpuri, Maithili, and Magahi)","zh":"比哈尔语（比哈尔地区的一组近缘语言；有时作广义用法，常指博杰普尔语、迈蒂利语、摩揭陀语等）"},"examples":[{"en":"Maithili is sometimes described as a Bihari language.","zh":"迈蒂利语有时被描述为一种比哈尔语。"},{"en":"He can understand some Bihari but speaks Hindi at school.","zh":"他能听懂一些比哈尔语，但在学校说印地语。"}]}],"synonyms":["from Bihar","Bihar-related"],"phonetic":"/bɪˈhɑːri/","extraExplanation":["“Bihari”在英语里既可作形容词也可作名词，常用于国籍/地域身份（来自Bihar）以及语言文化语境。","语言层面上，“Bihari languages”是一个分类说法；在不同语境中，人们也可能直接说具体语言名（如 Bhojpuri、Maithili、Magahi），以避免含义过宽。"]}
{"word":"biharmonic","summary":{"en":"Biharmonic usually describes equations or functions that satisfy the biharmonic equation (Laplacian applied twice).","zh":"Biharmonic 通常指满足“双调和方程”（拉普拉斯算子作用两次）的方程或函数。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Mathematics/Physics) Related to a biharmonic equation or function—one that satisfies the biharmonic equation (typically, the Laplacian applied twice equals zero).","zh":"（数学/物理）与双调和方程或双调和函数有关的；指满足双调和方程（通常为拉普拉斯算子作用两次为零）的函数或问题。"},"examples":[{"en":"The deflection of a thin elastic plate is often modeled by a biharmonic equation.","zh":"薄弹性板的挠度常常用双调和方程来建模。"},{"en":"In this chapter, we study biharmonic functions and their boundary conditions.","zh":"本章我们研究双调和函数及其边界条件。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Signal processing) Having two harmonic components or relating to two harmonics (less common in general English).","zh":"（信号处理）具有两个谐波分量的；与两个谐波有关的（在一般英语中较少见）。"},"examples":[{"en":"The measured vibration looked biharmonic, with two clear frequency peaks.","zh":"测得的振动看起来是双谐波的，有两个明显的频率峰。"}]}],"synonyms":["bilaplacian (technical)","biharmonic equation (related term)","biharmonic function (related term)"],"phonetic":"/ˌbaɪhɑrˈmɑnɪk/","extraExplanation":["“biharmonic”由 bi-（“二、双”）+ harmonic（“调和的/谐波的”）构成。在数学里最常见的含义与微分方程有关：双调和方程常写作 Δ²u = 0（Δ 是拉普拉斯算子），在弹性力学中尤其常见，例如薄板弯曲理论（Kirchhoff–Love plate theory）。","容易和“harmonic（调和）”混淆：调和函数满足 Δu = 0；双调和函数更“高一阶”，满足 Δ²u = 0。两者都常出现在势场、弹性、流体等连续介质问题中。"]}
{"word":"bihourly","summary":{"en":"Bihourly usually means “every two hours,” but it can sometimes be interpreted as “twice an hour,” so clearer wording is often better.","zh":"Bihourly通常指“每两小时一次”，但有时也会被理解为“每小时两次”，因此正式场合最好用更明确的表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of something that happens regularly) occurring every two hours.","zh":"（指按规律发生的事）每两小时一次的。"},"examples":[{"en":"The nurse checks the patient’s temperature on a bihourly schedule.","zh":"护士按每两小时一次的安排为病人测量体温。"},{"en":"You will receive bihourly updates during the storm.","zh":"暴风雨期间你会每两小时收到一次更新。"}]},{"partOfSpeech":"adv.","definition":{"en":"occurring every two hours; at two-hour intervals.","zh":"每两小时一次；以两小时为间隔。"},"examples":[{"en":"The app sends notifications bihourly.","zh":"这个应用每两小时推送一次通知。"},{"en":"Please record the readings bihourly throughout the day.","zh":"请在一天中每两小时记录一次读数。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common, and sometimes confusing) occurring twice an hour (every 30 minutes).","zh":"（较少见且容易引起误解）每小时两次（即每30分钟一次）。"},"examples":[{"en":"Some people use “bihourly” to mean twice an hour, but it can be unclear.","zh":"有些人把“bihourly”用来表示每小时两次，但这种用法可能不清楚。"}]}],"synonyms":["every two hours","at two-hour intervals","two-hourly"],"phonetic":"/baɪˈhaʊrli/","extraExplanation":["“bi-”在英语里既可能表示“两个/每两…”，也可能被理解为“每…两次”，所以 bimonthly、biweekly、bihourly 等词常有歧义。正式写作里更推荐直接写清楚：every two hours（每两小时）或 twice an hour / every 30 minutes（每小时两次/每30分钟）。","拼写上更常见的是连字符形式 bi-hourly；不带连字符的 bihourly 也可见，但较少。"]}
{"word":"bihydrazine","summary":{"en":"A rare chemistry word meaning a compound containing two hydrazine units.","zh":"一个罕见的化学词，指含有两个“肼”结构单元的化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical term for a compound made of two hydrazine (N2H4) units; used mainly in technical/chemical contexts rather than everyday English","zh":"化学术语：由两个肼（N2H4）结构单元组成的化合物；主要用于专业化学语境，日常英语中很少使用"},"examples":[{"en":"Bihydrazine is discussed mostly in specialized chemistry references, not in general textbooks.","zh":"“bihydrazine”主要出现在专业化学资料中，而不是普通教材里。"},{"en":"Because hydrazine-related compounds can be hazardous, labs handle bihydrazine with strict safety rules.","zh":"由于与肼相关的化合物可能具有危险性，实验室会在严格的安全规范下处理bihydrazine。"}]}],"synonyms":["dihydrazine (sometimes used in technical writing)"],"phonetic":"/baɪˈhaɪdrəziːn/","extraExplanation":["该词非常罕见，很多情况下人们更常用更标准的名称（例如更具体的系统命名或写出具体盐/衍生物名称）。如果你能提供出现它的句子、化学式或上下文（比如是燃料、试剂还是某种盐），我可以帮你确认它在那篇材料中指的到底是哪一种具体物质。","发音上常按构词理解：bi-（两个）+ hydrazine（肼），因此读音通常也遵循“bi- + hydrazine”的组合规律。"]}
{"word":"Bihzad","summary":{"en":"Bihzad is a Persian male name (also spelled Behzad) and can also refer to the famous Persian miniature painter Kamal ud-Din Bihzad.","zh":"Bihzad 是波斯语男性名字（也拼作 Behzad），也可指著名的波斯细密画大师卡迈勒丁·比赫扎德。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Persian (Iranian) male given name, also spelled Behzad, meaning “well-born” or “of good lineage.”","zh":"波斯语（伊朗）男性名字，也可拼作 Behzad，常被解释为“出身良好 / 血统高贵”。"},"examples":[{"en":"Bihzad is a common boys’ name in Iran and some neighboring regions.","zh":"Bihzad 是伊朗以及部分周边地区较常见的男孩名字。"},{"en":"My classmate Bihzad speaks Persian at home.","zh":"我的同学 Bihzad 在家里说波斯语。"}]},{"partOfSpeech":"n.","definition":{"en":"Kamal ud-Din Bihzad (c. 1450–1535), a highly influential Persian miniature painter from the Timurid/Safavid period.","zh":"卡迈勒丁·比赫扎德（约 1450–1535），帖木儿—萨法维时期极具影响力的波斯细密画（miniature）画家。"},"examples":[{"en":"The museum has a section on Persian miniature painting and mentions Bihzad as a master.","zh":"博物馆有一部分介绍波斯细密画，并提到比赫扎德是大师。"},{"en":"Art historians often study Bihzad’s work for its lively figures and detailed scenes.","zh":"艺术史学者常研究比赫扎德的作品，因为人物生动、场景细节丰富。"}]}],"synonyms":["Behzad"],"phonetic":"/ˈbiːhzɑːd/","extraExplanation":["“Bihzad / Behzad”在英语里通常被当作专有名词使用：要么是人名，要么特指那位著名画家。拼写差异多来自不同的拉丁字母转写方式（Persian → English）。","作为艺术史人物，比赫扎德常被认为把波斯细密画推向成熟：构图更复杂、人物更有情感与动作，建筑与日常场景细节也更丰富。你在英文资料中可能会看到“Bihzad school / style”（比赫扎德画派/风格）之类的说法。"]}

