{"word":"biiliac","summary":{"en":"Iliac means “related to the hip bone (ilium) or the pelvis,” and it can also name major pelvic blood vessels (iliac artery/vein).","zh":"Iliac 指“与髂骨（髋骨的一部分）或骨盆有关”，也可指骨盆内的重要血管（髂动脉/髂静脉）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the ilium (the large, upper part of the hip bone) or the hip/lower side of the abdomen.","zh":"与髂骨（髋骨上方较大的部分）或髋部/下腹侧部有关的。"},"examples":[{"en":"The doctor examined the patient’s iliac crest for tenderness.","zh":"医生检查了病人的髂嵴是否有压痛。"},{"en":"She felt a sharp pain in the right iliac region of her abdomen.","zh":"她感到右侧髂区（下腹侧部）有一阵刺痛。"}]},{"partOfSpeech":"n.","definition":{"en":"An iliac artery or vein (a large blood vessel in the pelvis).","zh":"髂动脉或髂静脉（骨盆内的重要大血管）。"},"examples":[{"en":"The scan showed narrowing in the iliac artery.","zh":"扫描显示髂动脉变窄。"},{"en":"Surgeons carefully avoided damage to the iliac vein.","zh":"外科医生小心避免损伤髂静脉。"}]}],"synonyms":["pelvic (broader)","hip (informal/broader)"],"phonetic":"ˈɪliæk","extraExplanation":["你输入的“biiliac”在英语里不常见，最接近且常用的拼写通常是 **iliac**（医学解剖用语，和髋骨/骨盆相关）。如果你原本想查的是 **biliary**（胆汁的/胆道的）或 **bilious**（胆汁质的/恶心的），告诉我你想要哪一个，我也可以按同样格式解释。"]}
{"word":"biimidazole","summary":{"en":"Biimidazole is a chemistry term for a compound with two linked imidazole rings, often used as a ligand in research.","zh":"Biimidazole 是化学术语，指由两个连接的咪唑环组成的化合物，常在研究中作为配体使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound made of two imidazole rings linked together (often written as bi-imidazole); used in chemistry and materials science, for example as a ligand that can bind to metals.","zh":"一种由两个咪唑环连接而成的化学化合物（也常写作 bi-imidazole）；常用于化学与材料科学中，例如作为可与金属结合的配体。"},"examples":[{"en":"Researchers used biimidazole as a ligand to build a metal complex.","zh":"研究人员使用 biimidazole 作为配体来构建金属配合物。"},{"en":"Biimidazole-based compounds can appear in studies of catalysts and sensors.","zh":"以 biimidazole 为基础的化合物常见于催化剂与传感器研究中。"},{"en":"The paper compares imidazole with biimidazole to show how adding a second ring changes binding strength.","zh":"论文比较了 imidazole 与 biimidazole，说明增加第二个环如何改变结合强度。"}]}],"synonyms":["bi-imidazole","diimidazole"],"phonetic":"/baɪˌɪˈmɪdəˌzoʊl/","extraExplanation":["“bi-”表示“两个/双”，而“imidazole（咪唑）”是一类含氮杂环，因此 biimidazole 通常可理解为“由两个咪唑单元组成的分子”。","在科研写作中也常见拼写 bi-imidazole 或 diimidazole；不同文献可能指向具体连接方式不同的异构体，阅读论文时可留意结构式或 IUPAC 名称。"]}
{"word":"Biisk","summary":{"en":"“Biisk” is not a standard English word; it is most likely “bisque,” meaning a creamy soup or unglazed porcelain.","zh":"“Biisk”不是标准英语词；多半是“bisque”，指奶油浓汤或未上釉的瓷器/陶坯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Likely a misspelling of “bisque”: a smooth, creamy soup (often made from seafood, such as lobster), or a type of unglazed porcelain/ceramic used for sculptures and pottery.","zh":"很可能是“bisque”的拼写错误：指一种细腻浓汤（常见为海鲜浓汤，如龙虾浓汤）；也指一种未上釉的瓷器/陶坯（常用于雕塑与陶艺）。"},"examples":[{"en":"I ordered the lobster bisque as a starter.","zh":"我点了龙虾浓汤当开胃菜。"},{"en":"This figurine is made of bisque porcelain.","zh":"这个小雕像是用素瓷（未上釉瓷）做的。"}]}],"synonyms":["cream soup","puréed soup"],"phonetic":"/bɪsk/","extraExplanation":["“biisk”不是常见英语单词；最常见的目标词是“bisque”。如果你想表达的是另一种含义（例如名字、品牌、游戏/小说里的专有名词），告诉我使用场景或给我一句例句，我可以按你的语境解释。"]}

