{"word":"bija","summary":{"en":"Bija (Sanskrit loanword) means “seed,” and in yoga/meditation it can mean a “seed syllable/mantra.”","zh":"bija（梵语借词）可指“种子”，在瑜伽/冥想中也指“种子音/种子咒”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Sanskrit) a seed; the source or starting point of something.","zh":"（源自梵语）种子；事物的起源、开端。"},"examples":[{"en":"In Sanskrit, “bīja” literally means “seed.”","zh":"在梵语中，“bīja”字面意思是“种子”。"},{"en":"Some writers use bīja to mean the original source of an idea.","zh":"一些作者用 bīja 表示一个想法的最初源头。"}]},{"partOfSpeech":"n.","definition":{"en":"(in yoga/Hindu/Buddhist contexts) a “seed syllable” or short mantra believed to contain spiritual power, often used in chanting or meditation (e.g., a bīja mantra).","zh":"（瑜伽/印度教/佛教语境）“种子音/种子字”，一种简短的咒音，被认为蕴含能量，常用于诵念或冥想（如 bīja mantra）。"},"examples":[{"en":"The teacher introduced a bīja mantra to use during meditation.","zh":"老师介绍了一个可在冥想中使用的种子咒音。"},{"en":"In some traditions, each deity is linked to a particular bīja syllable.","zh":"在某些传统中，每位神祇都对应特定的种子音节。"}]}],"synonyms":["seed","source","seed syllable","mantra"],"phonetic":"/ˈbiːdʒə/","extraExplanation":["“bīja”（常写作 bīja，带长音 ī）是梵语借词，在英文里多见于瑜伽、冥想、印度宗教研究等领域；日常英语中不算常用词。","你可能会在“bīja mantra（种子咒）”“bīja syllable（种子音节）”等搭配中遇到它；这种用法强调“一个短音节被视为浓缩/承载某种力量或意义”。","如果你本来想查的是法语借词“bijou（珠宝，小巧精致的东西）”，拼写不同，意思也完全不同。"]}
{"word":"Bijan","summary":{"en":"Bijan is usually a Persian male first name; it can also refer to the luxury brand/designer name “Bijan.”","zh":"Bijan 通常是一个波斯男性名字；也可指奢侈品牌/设计师名“Bijan”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name of Persian (Iranian) origin.","zh":"一个源自波斯语（伊朗）的男性名字。"},"examples":[{"en":"Bijan is a common Persian name in Iranian communities.","zh":"Bijan 是伊朗社群中比较常见的波斯名字。"},{"en":"My classmate Bijan speaks both English and Farsi.","zh":"我的同学 Bijan 会说英语和波斯语。"}]},{"partOfSpeech":"n.","definition":{"en":"the name of a luxury fashion brand associated with designer Bijan Pakzad (often simply called “Bijan”).","zh":"一个与设计师 Bijan Pakzad 相关的奢侈时尚品牌名称（常直接称为“Bijan”）。"},"examples":[{"en":"He bought a fragrance from Bijan.","zh":"他买了一款 Bijan 的香水。"},{"en":"The boutique is known for the Bijan name in luxury fashion.","zh":"这家精品店以奢侈时尚领域的 Bijan 品牌而闻名。"}]}],"synonyms":["Bizhan (variant spelling)"],"phonetic":"/biˈʒɑn/","extraExplanation":["“Bijan”常见于波斯文化中，也常被拼作“Bizhan”。在波斯史诗与文学传统里，“Bijan”还是人物名（例如《列王纪》（Shahnameh）相关故事中的英雄角色），因此这个名字常带有古典、英雄气质的文化联想。"]}
{"word":"Bijapur","summary":{"en":"Bijapur is a city in Karnataka, India (officially Vijayapura), and it can also refer to the historic capital of the Bijapur Sultanate.","zh":"Bijapur（比贾布尔）是印度卡纳塔克邦的一座城市（官方名Vijayapura/维贾亚普拉），也可指历史上的比贾布尔苏丹国首都。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in the state of Karnataka, India (officially called Vijayapura), known for Deccan history and Indo-Islamic architecture.","zh":"印度卡纳塔克邦的一座城市（官方名称为Vijayapura/维贾亚普拉，旧称Bijapur/比贾布尔），以德干地区历史与伊斯兰—印度建筑遗产闻名。"},"examples":[{"en":"Bijapur is famous for the Gol Gumbaz mausoleum.","zh":"比贾布尔以“圆顶陵”（Gol Gumbaz）这座陵墓建筑闻名。"},{"en":"She traveled from Bengaluru to Bijapur (Vijayapura) by train.","zh":"她从班加罗尔坐火车去比贾布尔（维贾亚普拉）。"}]},{"partOfSpeech":"n.","definition":{"en":"Historically, the capital of the Bijapur Sultanate, a major Deccan kingdom in early modern India.","zh":"历史上指比贾布尔苏丹国的首都；该政权是近世印度德干地区的重要王国之一。"},"examples":[{"en":"Bijapur was a center of art and architecture under the Adil Shahi rulers.","zh":"在阿迪勒沙希（Adil Shahi）王朝统治下，比贾布尔是艺术与建筑中心。"},{"en":"Many textbooks mention Bijapur when discussing the Deccan sultanates.","zh":"许多教材在讲“德干苏丹国”时都会提到比贾布尔。"}]}],"synonyms":["Vijayapura","Vijapur"],"phonetic":"/ˈbiːdʒəpʊr/","extraExplanation":["“Bijapur”是英语中常见的旧称；当地与官方更常用“Vijayapura（维贾亚普拉）”。在旅游与历史语境里，两种名称经常并用，以避免读者混淆。","比贾布尔最具代表性的地标之一是Gol Gumbaz（穆罕默德·阿迪勒沙的陵墓），以巨大的穹顶和回音效果著名。提到城市时，这类文化地标常被用作“识别点”。"]}
{"word":"bijasal","summary":{"en":"“bijasal” is not a recognized English word; it likely needs context or correct spelling.","zh":"“bijasal”不是可识别的英语单词；可能需要语境或正确拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name, or a word from another language. Please share the sentence/context or the correct spelling you meant.","zh":"不是标准英语词汇。可能是拼写错误、人名/地名，或来自其他语言的词。请提供例句/语境或确认正确拼写。"},"examples":[{"en":"I can’t find “bijasal” in an English dictionary—could you provide a sentence with it?","zh":"我在英语词典里找不到“bijasal”，你能给我一个包含它的句子吗？"},{"en":"Did you mean “basal” (basic/foundation) or “basil” (a herb)?","zh":"你想说的是“basal”（基础的）还是“basil”（罗勒，一种香草）？"}]}],"phonetic":"/ˈbiːdʒəsæl/","extraExplanation":["“bijasal”看起来不像常见英语单词，更像是：\n1）拼写错误（例如 basal / basil / bizarre 等）；\n2）专有名词（人名、品牌名、地名）；\n3）其他语言的词（例如印尼语、马来语或南亚语言的转写）。\n如果你把它出现的整句话发来，我可以更准确判断意思与最可能的正确拼写。"]}
{"word":"bijection","summary":{"en":"A bijection is a perfect one-to-one correspondence between two sets (a function that is both injective and surjective).","zh":"bijection 指双射：两个集合之间“既一一对应又覆盖全部”的对应关系（函数同时是单射和满射）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A one-to-one and onto matching between two sets, where every item in the first set pairs with exactly one unique item in the second set, and every item in the second set is paired with exactly one item in the first set.","zh":"（数学）双射：两个集合之间的一一且到上的对应关系；第一个集合中每个元素对应第二个集合中唯一元素，且第二个集合的每个元素也都被对应到。"},"examples":[{"en":"If a function is a bijection, it has an inverse function.","zh":"如果一个函数是双射，它就有反函数。"},{"en":"Mapping each seat number to exactly one passenger and each passenger to exactly one seat is a bijection.","zh":"把每个座位号对应到唯一乘客，同时每个乘客也对应到唯一座位号，这就是双射。"},{"en":"The teacher asked us to prove the mapping is a bijection between the two sets.","zh":"老师让我们证明这个映射在两个集合之间是双射。"}]},{"partOfSpeech":"n.","definition":{"en":"The property or condition of being bijective (both one-to-one and onto).","zh":"（性质）双射性：一个映射同时具备单射（one-to-one）和满射（onto）的性质。"},"examples":[{"en":"We checked bijection by proving injectivity and surjectivity separately.","zh":"我们通过分别证明单射性和满射性来检验双射性。"},{"en":"Bijection is important in counting because it shows two sets have the same size.","zh":"双射在计数中很重要，因为它能证明两个集合“大小相同”（元素个数相同）。"}]}],"synonyms":["one-to-one correspondence","bijective mapping"],"phonetic":"/baɪˈdʒɛkʃən/","extraExplanation":["“Bijection”常见于集合论、离散数学与组合数学。学习时可以把它记成：\n- injective（单射）= 不重复（不同输入不会得到同一输出）\n- surjective（满射）= 不遗漏（目标集合每个元素都能被命中）\n两者同时成立就是 bijection（双射）。\n在组合计数里，常用“构造双射”来把一个难数的问题转化为另一个更容易数的问题。"]}
{"word":"bijections","summary":{"en":"“Bijections” means one-to-one-and-onto mappings (plural of “bijection”).","zh":"“bijections”是“bijection”的复数，指两个集合之间既一一对应又覆盖全部目标元素的映射（双射）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a one-to-one and onto mapping between two sets; a function that pairs every element in one set with exactly one unique element in the other set, and covers all elements in the target set","zh":"（数）双射：两个集合之间的一一对应且“满射”的映射；每个元素对应唯一元素，并且目标集合中的每个元素都被对应到"},"examples":[{"en":"A bijection between set A and set B shows that they have the same number of elements (the same cardinality).","zh":"如果集合A与集合B之间存在双射，就说明它们元素个数相同（基数相同）。"},{"en":"The function f(x)=x+1 is a bijection from the integers to the integers.","zh":"函数f(x)=x+1在整数集到整数集之间是一个双射。"},{"en":"In coding theory, designers often look for bijections so that each input has a unique output and every output is reachable.","zh":"在编码理论中，设计者常寻找双射，使每个输入都有唯一输出，并且每个输出都能被生成。"}]}],"synonyms":["one-to-one correspondences","one-to-one and onto functions","perfect matchings (in some contexts)"],"phonetic":"/baɪˈdʒɛkʃənz/","extraExplanation":["“bijections”是“bijection”的复数形式。数学里常和“injection（单射）/surjection（满射）”一起出现：双射 = 单射 + 满射。","在更口语的数学表达里，bijection也常说成“one-to-one correspondence（一一对应）”。"]}
{"word":"bijective","summary":{"en":"Bijective describes a function that is both one-to-one and onto, so it pairs inputs and outputs perfectly and has an inverse.","zh":"Bijective（双射）指函数既单射又满射，能把输入与输出完美一一对应，因此存在逆函数。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"In mathematics, describing a function (or mapping) that is both one-to-one and onto: each input matches exactly one unique output, and every possible output is matched by some input.","zh":"（数学）指一个函数（映射）既是单射又是满射：每个输入对应唯一的输出，且所有可能的输出都能由某个输入得到。"},"examples":[{"en":"The function f(x) = x + 3 is bijective from the real numbers to the real numbers.","zh":"函数 f(x)=x+3 从实数到实数是双射的。"},{"en":"Because the mapping is bijective, it has an inverse function.","zh":"因为这个映射是双射的，所以它有逆函数。"},{"en":"A bijective correspondence can pair each student with exactly one locker, and every locker is used.","zh":"双射对应可以把每个学生恰好配到一个柜子，并且每个柜子都被使用。"}]}],"synonyms":["one-to-one and onto","bijective mapping","bijective correspondence"],"phonetic":"/baɪˈdʒɛktɪv/","extraExplanation":["词源：bijective 来自 bi-（“两个/双”）+ -jective（与“投射/映射”相关），在集合论与代数里很常见。","直观理解：单射强调“不重复”（不同输入不会得到同一输出）；满射强调“不遗漏”（每个输出都能被覆盖）。双射就是两者同时成立，因此可以“完美配对”，从而一定存在逆映射。"]}
{"word":"bijectively","summary":{"en":"“Bijectively” means “in a one-to-one and onto way,” describing a perfect matching between two sets.","zh":"“bijectively”表示“以双射方式”，即两个集合之间“既一一对应又不遗漏”的完美匹配。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that forms a bijection: a one-to-one and onto correspondence between two sets (each input matches exactly one output, and every output is used).","zh":"以“双射”的方式；指两个集合之间建立“一一对应且覆盖全部”的关系（每个输入对应且只对应一个输出，并且每个输出都被对应到）。"},"examples":[{"en":"The function maps set A to set B bijectively, so it has an inverse function.","zh":"这个函数把集合A与集合B进行双射映射，因此它有反函数。"},{"en":"If we label the seats bijectively with the tickets, every ticket matches exactly one seat and every seat is taken.","zh":"如果把座位与票号进行双射标记，那么每张票恰好对应一个座位，而且每个座位都有人。"}]}],"synonyms":["in a one-to-one way","one-to-one and onto"],"phonetic":"/baɪˈdʒɛk.tɪv.li/","extraExplanation":["“bijectively”主要用于数学、计算机科学和逻辑语境，日常英语中很少用。对应的名词是“bijection”（双射），形容词是“bijective”（双射的）。","理解关键词：one-to-one（单射：不重复）+ onto（满射：不遗漏）= bijective（双射）。"]}
{"word":"bijectivity","summary":{"en":"Bijectivity is the property of being a bijection: both one-to-one and onto.","zh":"Bijectivity 指双射性：既一一对应（单射）又覆盖所有输出（满射）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The property of a function (mapping) being both one-to-one and onto, so every input matches exactly one unique output and every possible output is reached.","zh":"（数学）双射性：一个函数（映射）既是单射又是满射，因此每个输入对应唯一的输出，且所有可能的输出都能被覆盖。"},"examples":[{"en":"We proved the bijectivity of the function, so it has an inverse.","zh":"我们证明了该函数具有双射性，因此它有反函数。"},{"en":"Bijectivity guarantees a perfect pairing between the two sets.","zh":"双射性保证两个集合之间存在一一对应的完美配对。"},{"en":"To show bijectivity, show it is injective and surjective.","zh":"要证明双射性，需要证明它既是单射又是满射。"}]}],"synonyms":["bijection property","one-to-one correspondence (in context)"],"phonetic":"/baɪ.dʒɛkˈtɪv.ə.ti/","extraExplanation":["“bijectivity”来自“bijection（双射）”，而“bijection”由 bi-（两者）+ -jection（投射/映射的概念）构成。在数学写作里更常见的说法是“a function is bijective（函数是双射的）”，而名词“bijectivity”多用于讨论“某个性质/条件”。","学习提示：injective=一对一（不同输入不会得到同一个输出）；surjective=映到（每个输出都至少有一个输入对应）。两者同时成立才是 bijective/具备 bijectivity。"]}
{"word":"bijon","summary":{"en":"“bijon” isn’t a standard English word; you probably mean “bichon” (a dog) or “bijou” (a small jewel).","zh":"“bijon”不是标准英语单词；你可能想写“bichon”（比熊犬）或“bijou”（小珠宝/精致小物）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most often a misspelling of “bichon” (a small white dog breed) or “bijou” (a small, elegant jewel).","zh":"不是标准英语单词。最常见是把“bichon”（一种小型白色犬种）或“bijou”（小而精致的珠宝）拼错。"},"examples":[{"en":"I couldn’t find “bijon” in the dictionary—did you mean “bichon” (the dog)?","zh":"我在词典里找不到“bijon”——你是想说“bichon”（那种狗）吗？"},{"en":"If you mean a small jewel, the word is “bijou,” not “bijon.”","zh":"如果你想表达“小珠宝”，应该用“bijou”，不是“bijon”。"}]}],"synonyms":["bichon","bijou"],"phonetic":"ˈbiːʃɑːn","extraExplanation":["“bichon”常见于“Bichon Frisé”（比熊犬）；在英语里经常被误拼成bijon/bishon等。","“bijou”来自法语，英语中多用于形容“小巧精致的东西”（如bijou apartment 小而精致的公寓）。"]}
{"word":"bijou","summary":{"en":"Bijou means a small, elegant jewel, or something small and stylish.","zh":"Bijou 指“小巧精致的珠宝”，也可形容“小而雅致、精致迷你”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, elegant piece of jewelry; a little jewel.","zh":"小巧精致的珠宝；小宝石。"},"examples":[{"en":"She wore a tiny bijou on a silver chain.","zh":"她戴着一条银链，上面挂着一颗小巧的宝石。"},{"en":"The antique shop displayed bijous in a velvet case.","zh":"古董店把精致的小珠宝陈列在天鹅绒盒里。"}]},{"partOfSpeech":"adj.","definition":{"en":"Small and stylish; attractively compact (often used for homes, rooms, shops, etc.).","zh":"小巧而雅致的；精致迷你的（常形容公寓、房间、店铺等）。"},"examples":[{"en":"They rented a bijou apartment near the park.","zh":"他们在公园附近租了一间小巧雅致的公寓。"},{"en":"It’s a bijou café with only six tables.","zh":"那是一家精致迷你的咖啡馆，只有六张桌子。"}]}],"synonyms":["jewel","trinket","ornament","dainty","compact","chic"],"phonetic":"/ˈbiʒuː/","extraExplanation":["“bijou”是从法语借入英语的词，法语里意为“珠宝”。英语中常用来表达“小但很精致、很有品味”的感觉，语气偏正面、带一点“可爱/讲究”的味道。","发音里常见的难点是中间的 /ʒ/（类似法语/英语中“measure”里的 s 音）。"]}
{"word":"bijous","summary":{"en":"“Bijou” means a small, elegant piece of jewelry (plural: “bijoux”), and it can also describe something small and stylish.","zh":"“bijou”指小巧精致的珠宝首饰（复数常写作“bijoux”），也可形容某物小而雅致。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, stylish piece of jewelry; a jewel or trinket (often used for something decorative and delicate)","zh":"小巧精致的珠宝首饰；小饰物（常指精美、装饰性强且偏小的物件）"},"examples":[{"en":"She wore a tiny bijou necklace that caught the light.","zh":"她戴着一条小巧精致的项链，在光下闪闪发亮。"},{"en":"The shop sells handmade bijous for everyday wear.","zh":"那家店卖适合日常佩戴的手工小首饰。"}]},{"partOfSpeech":"adj.","definition":{"en":"small, elegant, and attractive (often describing an object, room, or place)","zh":"小巧雅致的；精致迷人的（常形容物品、房间或地方）"},"examples":[{"en":"They rented a bijou apartment in the city center.","zh":"他们在市中心租了一间小巧雅致的公寓。"},{"en":"It’s a bijou café—tiny but beautifully designed.","zh":"那是一家精致小咖啡馆——不大，但设计很美。"}]}],"synonyms":["trinket","jewel","ornament","dainty","elegant"],"phonetic":"/biˈʒu/","extraExplanation":["你输入的“bijous”常见于把复数写成英语规则形式的拼写，但更标准的形式通常是法语借词的复数“bijoux”。单数是“bijou”。","这个词来自法语，常带一点“精巧、讲究、有品味”的语感；在英式英语里形容公寓/餐厅“bijou”尤其常见。"]}
{"word":"bijouterie","summary":{"en":"Bijouterie means a jewelry shop or small decorative jewelry, often costume jewelry.","zh":"bijouterie 指珠宝店，或指小巧装饰性首饰（常为仿饰品）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A shop or the business of selling jewelry, especially small or costume jewelry.","zh":"珠宝店；（尤指）首饰、仿饰品的零售业。"},"examples":[{"en":"She bought a pair of inexpensive earrings at a small bijouterie near the station.","zh":"她在车站附近一家小珠宝店买了一对不贵的耳环。"},{"en":"The street is full of cafés, bakeries, and bijouteries.","zh":"这条街上到处都是咖啡馆、面包店和珠宝店。"}]},{"partOfSpeech":"n.","definition":{"en":"Small, decorative jewelry or trinkets (often implying costume jewelry rather than fine jewelry).","zh":"小巧的装饰性首饰；小饰品（常暗示仿首饰而非贵重珠宝）。"},"examples":[{"en":"Her drawer was filled with bijouterie—rings, brooches, and colorful bracelets.","zh":"她的抽屉里塞满了小饰品——戒指、胸针和五颜六色的手链。"},{"en":"For the play, the actors wore shiny bijouterie to look wealthy on stage.","zh":"为了这出戏，演员们戴了闪亮的仿饰品，让舞台上看起来很富有。"}]}],"synonyms":["jewelry store","jeweler","costume jewelry","trinkets"],"phonetic":"/ˌbiʒuːtərˈi/","extraExplanation":["这个词来自法语，常带一点“法式、精致”的氛围。在英语里它比 jewelry 更偏“店铺/行业”或“（偏仿的）小首饰”。","用法提示：在日常英语中更常见的是 jewelry store（珠宝店）或 costume jewelry（仿首饰）。bijouterie 更偏书面、时尚或描写场景的用词。"]}
{"word":"bijoux","summary":{"en":"Bijoux means jewelry or small decorative ornaments, often with a stylish or elegant feel.","zh":"Bijoux 指珠宝首饰或精致小饰品，常带时髦、优雅的语感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"jewelry; small, decorative pieces such as rings, necklaces, or earrings (often used in a fashion or elegant context).","zh":"（总称）珠宝首饰；小巧精致的饰品（常带时尚或优雅语感）。"},"examples":[{"en":"She shops for bijoux at local markets when she travels.","zh":"她旅行时喜欢在当地集市买些精致的小首饰。"},{"en":"The boutique sells handmade bijoux made of silver and glass.","zh":"那家精品店卖手工制作的银和玻璃首饰。"}]}],"synonyms":["jewelry","jewellery","ornaments","trinkets","accessories"],"phonetic":"/biˈʒuː/","extraExplanation":["“bijoux”来自法语，是“bijou（小宝贝；珠宝饰品）”的复数形式。英语里常把“bijoux”当作可数复数或泛指“首饰”的集合名词来用，语气通常比“jewelry”更时髦、精致。","发音里的“zh”音类似英文单词“measure”中间的 /ʒ/ 音。"]}
{"word":"bijten","summary":{"en":"“bijten” is a Dutch verb meaning “to bite,” and it can also mean “to sting” in a figurative sense.","zh":"“bijten”是荷兰语动词，意思是“咬”，也可引申为“刺痛/很刺激（如风、辣味或言语）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Dutch) to bite; to use your teeth to cut, hold, or wound.","zh":"（荷兰语）咬；用牙齿咬住、咬断或咬伤。"},"examples":[{"en":"The dog might bite if you scare it.","zh":"如果你吓到那只狗，它可能会咬人。"},{"en":"Be careful—this pepper bites (it’s very spicy).","zh":"小心——这辣椒很“咬”（很辣、很刺激）。"}]},{"partOfSpeech":"v.","definition":{"en":"(Dutch, figurative) to sting or have a sharp, unpleasant effect (e.g., cold, criticism, strong taste).","zh":"（荷兰语，引申）刺痛；带来尖锐、不舒服的影响（如寒冷、批评、强烈味道）。"},"examples":[{"en":"The cold wind bites your cheeks.","zh":"冷风刺得你脸颊生疼。"},{"en":"His comment really bit.","zh":"他那句话真的很伤人。"}]}],"synonyms":["bite","sting","nip"],"phonetic":"/ˈbaɪtən/","extraExplanation":["“bijten”是荷兰语动词，相当于英语“to bite”。在荷兰语里常见变位如：ik bijt（我咬）、jij bijt（你咬）、hij/zij bijt（他/她咬）、wij bijten（我们咬）；过去式 beet，过去分词 gebeten（如：Ik ben gebeten. 我被咬了）。","除了字面“咬”，荷兰语里也常用来形容辣味、寒风或语言带来的“刺痛感”，和英语里“a biting wind / biting remark”的用法很接近。"]}
{"word":"bijugate","summary":{"en":"Bijugate means “having two pairs,” especially in botanical descriptions of leaflets arranged in two pairs.","zh":"Bijugate 指“成两对的”，尤其用于植物学中描述小叶等结构呈两对排列。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having two pairs; arranged in two paired sets (often used in botany to describe leaves or leaflets).","zh":"成两对的；成对成组排列的（常用于植物学，描述叶或小叶为两对）。"},"examples":[{"en":"The plant has bijugate leaves, with two pairs of leaflets on each leaf.","zh":"这种植物的叶为两对小叶的类型（bijugate leaves），每片叶上有两对小叶。"},{"en":"In the field guide, the species is described as having bijugate leaflets near the tip of the stem.","zh":"在野外图鉴中，这个物种被描述为茎端附近的小叶呈两对排列（bijugate）。"}]}],"synonyms":["two-paired","paired in two sets","quadripartite"],"phonetic":"/baɪˈdʒuːɡeɪt/","extraExplanation":["这个词比较少见，最常出现在植物学/动物学等形态描述里。词根来自拉丁语：bi-（二、双）+ jugum（轭、成对连接），因此带有“成对连接、两对并列”的意思。","与它相关的常见对比词包括：unijugate（单对）、multijugate（多对）。在描述羽状复叶时，bijugate通常强调“小叶是两对”。"]}
{"word":"bijugous","summary":{"en":"Bijugous means “arranged in two paired sets,” a rare technical adjective often seen in older biology/botany writing.","zh":"Bijugous 指“以两组成对结构排列”，是较罕见的专业形容词，常见于较旧的生物/植物学描述中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, technical) Having two pairs or two “yokes”; arranged in two joined pairs (especially used in biology/botany to describe paired structures).","zh":"（罕见/专业）成“双对”或“两轭”的；以两组成对的方式排列（尤用于生物学/植物学中描述成对结构）。"},"examples":[{"en":"The plant has bijugous leaflets, with two pairs on each side of the stalk.","zh":"这种植物的小叶呈bijugous排列，即在叶轴两侧各有两对小叶。"},{"en":"Some older texts describe the wings as bijugous, meaning they form two paired sets.","zh":"一些较早的文献把翅描述为bijugous，意思是它们形成两组成对的结构。"}]}],"synonyms":["bijugate","paired","in two pairs","double-paired"],"phonetic":"/baɪˈdʒuːɡəs/","extraExplanation":["这个词非常少见，多见于较旧或专业的学术写作中。它来自拉丁语词根：bi-（两、双）+ jugum（轭、套在一起的连接），所以核心概念是“成对并且成双”。在现代更常见的替代词是 bijugate（生物/植物学中更常用）、paired（成对的）、in two pairs（分成两对）。"]}
{"word":"bijugular","summary":{"en":"Bijugular means “involving both jugular veins” (two neck veins).","zh":"bijugular 指“与两侧（两条）颈静脉有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy) Having two jugular veins, or relating to both jugular veins (the large veins in the neck that carry blood from the head back to the heart).","zh":"（解剖）具有两条颈静脉的；与两侧颈静脉有关的（颈部将头部血液回流至心脏的大静脉）。"},"examples":[{"en":"The surgeon identified the bijugular region before making the incision.","zh":"外科医生在切开前先确认了双侧颈静脉所在的区域。"},{"en":"In this diagram, the label points to the bijugular veins on both sides of the neck.","zh":"在这张图中，标注指向颈部两侧的颈静脉。"}]}],"synonyms":["double-jugular","paired jugular","involving both jugular veins"],"phonetic":"/baɪˈdʒʌɡjələr/","extraExplanation":["“bi-”是常见前缀，表示“两个/双”，例如 bilingual（双语的）、bicycle（自行车，两个轮子）。因此 bijugular 直观上就是“与两条颈静脉相关”。","该词多见于医学/解剖学写作或标注中，日常英语里更常用 both jugular veins（两侧颈静脉）来表达。"]}
{"word":"bijwoner","summary":{"en":"Bijwoner/bywoner refers to a tenant farmer or poor co-resident on someone else’s land, especially in Dutch or South African historical contexts.","zh":"bijwoner/bywoner 多指佃农或寄居在他人土地上的贫农，常见于荷兰语或南非历史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Dutch/South African English) a tenant farmer or poor farmer who lives on and works someone else’s land; sometimes, a lodger or co-resident.","zh":"（荷兰语/南非英语）佃农、贫苦农民：住在并耕作他人土地上的人；有时也指寄住者/同住者。"},"examples":[{"en":"In some historical South African texts, a bywoner is a poor tenant farmer living on a large landowner’s farm.","zh":"在一些南非历史文献中，bywoner 指住在大地主农场里、生活拮据的佃农。"},{"en":"The family worked as bywoners, paying rent with labor and a share of the crops.","zh":"这家人以佃农身份劳作，用劳力和部分收成来抵租金。"}]}],"synonyms":["tenant farmer","sharecropper","lodger","co-resident"],"phonetic":"/ˈbaɪˌvoʊnər/","extraExplanation":["“bijwoner / bywoner”不是常见现代英语词，更常见于荷兰语语境或南非历史语境（有时拼作 bywoner）。","词源上可理解为荷兰语 bij-（“在旁、一起”）+ woner（“居住者”），字面有“同住的人/一起居住的人”的感觉；在南非语境里语义常转为“寄居在他人土地上的佃农、贫农”。"]}

