{"word":"BIM","summary":{"en":"BIM most commonly means Building Information Modeling in architecture and construction—a digital 3D model plus shared project data used to design, coordinate, and manage buildings.","zh":"BIM最常见指建筑与工程领域的“建筑信息模型”：三维数字模型加共享项目数据，用于设计、协同与管理建筑项目。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(construction/architecture) Building Information Modeling: a process and set of digital tools for creating and managing a detailed 3D model of a building, including information about materials, costs, and scheduling.","zh":"（建筑/工程）建筑信息模型：一种流程与数字化工具，用于创建并管理包含材料、造价、进度等信息的三维建筑模型。"},"examples":[{"en":"Our firm uses BIM to coordinate the architect’s and engineer’s designs before construction starts.","zh":"我们公司使用BIM在开工前协调建筑师和工程师的设计。"},{"en":"BIM helps reduce clashes between plumbing and electrical systems in the 3D model.","zh":"BIM有助于在三维模型中减少给排水与电气系统的碰撞问题。"},{"en":"The client asked for BIM deliverables, including a model for facility management.","zh":"客户要求交付BIM成果，包括用于设施运维管理的模型。"}]},{"partOfSpeech":"n.","definition":{"en":"(general) The letters “BIM,” used as an abbreviation in different fields (the meaning depends on context).","zh":"（泛指）“BIM”这组字母，作为不同领域中的缩写使用（具体含义取决于语境）。"},"examples":[{"en":"In this document, BIM stands for Building Information Modeling.","zh":"在这份文件中，BIM代表“建筑信息模型”。"},{"en":"Always define BIM the first time you use it in a report.","zh":"在报告中第一次使用BIM时最好先写出全称并解释。"}]}],"synonyms":["Building Information Modeling","building information model"],"phonetic":"/bi aɪ ɛm/","extraExplanation":["在建筑行业里，BIM通常不仅指“一个三维模型”，更强调“信息+协同流程”：不同专业（建筑、结构、机电等）在同一套数据环境中协作，常见用途包括碰撞检测、工程量统计（算量）、4D进度模拟、5D造价管理以及后期运维（FM）。","发音上英语里常把BIM读作字母：/bi aɪ ɛm/（也有人直接说成一个音节“bim”，但在专业场合读字母更常见、更清晰）。"]}
{"word":"Bim","summary":{"en":"“Bim/BIM” most commonly refers to Building Information Modeling in construction; it can also be a comic sound effect or a personal name.","zh":"“Bim/BIM”最常见指建筑行业的建筑信息模型；也可作漫画拟声词或人名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Building Information Modeling: a digital method for creating and managing a detailed 3D model of a building (including data about materials, costs, scheduling, etc.), used in architecture, engineering, and construction.","zh":"建筑信息模型（BIM）：一种用数字方式建立并管理建筑的详细三维模型的方法（包含材料、造价、工期等数据），常用于建筑、工程与施工领域。"},"examples":[{"en":"Our firm uses BIM to coordinate the architect’s and engineer’s plans.","zh":"我们公司用BIM来协调建筑师和工程师的图纸。"},{"en":"The contractor found a clash in the BIM model before construction started.","zh":"承包商在开工前就在BIM模型里发现了管线冲突。"}]},{"partOfSpeech":"int.","definition":{"en":"(comic/onomatopoeia) a sound effect like a light hit, pop, or bang.","zh":"（漫画/拟声词）表示轻微的撞击声、爆裂声或“砰”的一声。"},"examples":[{"en":"Bim! The ball hit the window.","zh":"Bim！球打到了窗户。"},{"en":"In the comic, you see “BIM!” when the door slams.","zh":"在漫画里，门猛地关上时会出现“BIM!”。"}]},{"partOfSpeech":"other","definition":{"en":"A given name or nickname (less common in English; often used as a personal name in different cultures).","zh":"人名或昵称（在英语里不算常见，但在不同文化中可能作为名字使用）。"},"examples":[{"en":"Bim said he would join us after work.","zh":"Bim说他下班后会来。"}]}],"synonyms":["building information modeling","BIM model","bam (sound effect)","bonk (sound effect)"],"phonetic":"/bɪm/","extraExplanation":["在英语里写作“BIM”时，多数场景指建筑行业的“Building Information Modeling（建筑信息模型）”。在工程沟通中也常把它当作一个领域/流程来讲：比如“BIM workflow（BIM流程）”“BIM coordinator（BIM协调员）”。","作为拟声词“bim!”更偏口语与漫画风格，类似“bam/bonk”，具体力度通常比“BAM!”更轻。"]}
{"word":"bim","summary":{"en":"“BIM/bim” most commonly means Building Information Modeling; it can also mean a motorbike (UK slang) or an imitated ringing sound.","zh":"“BIM/bim”最常见指建筑信息模型；也可指（英式俚语）摩托车，或表示铃声等的拟声词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Building Information Modeling: a digital way to design, build, and manage buildings using a shared 3D model and data.","zh":"建筑信息模型（BIM）：用共享的三维模型与数据来进行建筑的设计、施工与运维管理的数字化方法。"},"examples":[{"en":"Our company uses BIM to coordinate architecture, structure, and MEP systems.","zh":"我们公司用BIM来协调建筑、结构和机电系统。"},{"en":"With BIM, many design clashes can be found before construction starts.","zh":"用BIM可以在开工前发现很多设计冲突。"}]},{"partOfSpeech":"n.","definition":{"en":"(UK, informal) A motorcycle; a motorbike.","zh":"（英式口语）摩托车；机车。"},"examples":[{"en":"He arrived on his bim and parked outside the café.","zh":"他骑着摩托车到了，把车停在咖啡馆外。"}]},{"partOfSpeech":"int.","definition":{"en":"An imitated sound (like a bell or chime), often written in comic or playful text.","zh":"拟声词（像铃声/钟声的“叮当”），常见于漫画或俏皮文字。"},"examples":[{"en":"Bim! The bell rang and class began.","zh":"叮！铃声响了，开始上课。"}]}],"synonyms":["Building Information Modeling","motorbike","motorcycle"],"phonetic":"/bɪm/","extraExplanation":["在日常英语里，“BIM”最常见是建筑行业的缩写，通常大写；如果小写“bim”，更可能是口语/拟声用法，但在不同地区并不常见。","行业语境中，人们也会说“BIM model / BIM workflow / BIM coordinator（BIM协调员）”。"]}
{"word":"BIM-based","summary":{"en":"BIM-based means using Building Information Modeling as the foundation for a process or system.","zh":"BIM-based 指以BIM（建筑信息模型）为基础开展某项流程或系统。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"using or built on BIM (Building Information Modeling), especially for planning, designing, constructing, or managing buildings and infrastructure with a shared digital model","zh":"基于BIM（建筑信息模型）的；使用BIM数字模型来进行建筑/基础设施的规划、设计、施工或运维管理"},"examples":[{"en":"The team created a BIM-based workflow to coordinate architecture, structure, and MEP systems.","zh":"团队建立了基于BIM的工作流程来协调建筑、结构和机电系统。"},{"en":"BIM-based cost estimation reduced errors compared with manual spreadsheets.","zh":"与手工表格相比，基于BIM的造价估算减少了错误。"},{"en":"The city is piloting BIM-based asset management for public facilities.","zh":"该城市正在试点基于BIM的公共设施资产管理。"}]}],"synonyms":["BIM-driven","BIM-enabled","model-based (in AEC context)"],"phonetic":"/ˌbiː aɪ ˈɛm beɪst/","extraExplanation":["BIM是“Building Information Modeling/Model”的缩写，常译为“建筑信息模型”。它强调用一个包含几何、材料、工程量、进度、成本等信息的数字模型，让不同专业共享与协同。","“BIM-based”常见于工程建筑行业（AEC：Architecture, Engineering, Construction）。写作中通常作定语：BIM-based design / BIM-based workflow / BIM-based platform。也可写作“BIM based”（不带连字符）但在正式技术写作里带连字符更清晰。"]}
{"word":"BIMA","summary":{"en":"BIMA most commonly refers to (1) the name Bima/Bhima from the Mahabharata, (2) an Indonesian place name (Bima on Sumbawa), or (3) an acronym whose meaning depends on context.","zh":"BIMA 常见指（1）《摩诃婆罗多》人物名 Bima/Bhima（毗摩），（2）印尼地名比马（松巴哇岛一带），或（3）需结合语境判断的缩写名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper noun) A male given name; often a spelling variant of Bhima, a strong warrior hero in the Indian epic the Mahabharata.","zh":"（专有名词）男性名字；常见为 Bhima（毗摩）的另一种拼写，指印度史诗《摩诃婆罗多》中的大力士战士英雄。"},"examples":[{"en":"In the Mahabharata, Bhima (sometimes written Bima) is known for his great strength.","zh":"在《摩诃婆罗多》中，Bhima（有时写作 Bima）以力大无穷闻名。"},{"en":"The character Bima is often portrayed as brave and direct.","zh":"Bima 这个人物常被刻画为勇敢、直率。"}]},{"partOfSpeech":"other","definition":{"en":"(Proper noun) A place name in Indonesia, especially Bima City and Bima Regency on Sumbawa Island (West Nusa Tenggara).","zh":"（专有名词）印度尼西亚地名，常指松巴哇岛（西努沙登加拉省）的比马市与比马县。"},"examples":[{"en":"She traveled to Bima on Sumbawa Island for a family visit.","zh":"她去松巴哇岛的比马探亲。"},{"en":"Bima is known for local culture and coastal scenery.","zh":"比马以当地文化与海岸风光闻名。"}]},{"partOfSpeech":"other","definition":{"en":"(Acronym) The name of various organizations or programs (meaning depends on context), e.g., a medical association or a government/education platform.","zh":"（缩写）用于多种机构或项目的名称（具体含义取决于语境），例如某些医疗协会或政府/教育平台。"},"examples":[{"en":"BIMA released a new guideline for its members this year.","zh":"BIMA 今年发布了面向会员的新指南。"},{"en":"Check the website to see what BIMA stands for in your country or field.","zh":"查看官网以确认在你所在国家或领域里 BIMA 的具体全称。"}]}],"synonyms":["Bhima"],"phonetic":"/ˈbiːmə/","extraExplanation":["“Bima / Bhima（毗摩）”在南亚与东南亚文化中影响很大：在印尼的爪哇、巴厘等地，传统皮影戏（wayang）里也常出现这一角色，因此你可能会在艺术、地名、人名中频繁看到 Bima。","如果你指的是“缩写 BIMA”，需要结合领域判断（医学、教育、政府项目等都可能使用）。你可以告诉我你看到它的句子或所在领域，我可以帮你锁定最准确的释义。"]}
{"word":"bima","summary":{"en":"“Bima” most commonly refers to an Indonesian place name or a male given name; it can also be the acronym BIMA (a UK digital/creative industry organization).","zh":"“Bima”最常见是印尼的地名或男性人名；也可能是缩写 BIMA（英国数字/创意产业相关组织）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often written “Bima”) a city and regency area on Sumbawa Island, West Nusa Tenggara, Indonesia.","zh":"（常写作 Bima）印度尼西亚西努沙登加拉省松巴哇岛上的一座城市及其所属的行政区域。"},"examples":[{"en":"She flew to Sumbawa and spent two days in Bima.","zh":"她飞到松巴哇岛，在比马待了两天。"},{"en":"Bima is known as a gateway to explore eastern Sumbawa.","zh":"比马常被视为探索松巴哇岛东部的门户。"}]},{"partOfSpeech":"n.","definition":{"en":"a male given name in Indonesia, related to the heroic figure Bhima from the Mahabharata (often spelled “Bima” in Indonesian).","zh":"印度尼西亚常见的男性名字，源自《摩诃婆罗多》中的英雄人物 Bhima（印尼语中常拼作 Bima）。"},"examples":[{"en":"My colleague Bima is from Jakarta.","zh":"我的同事比马来自雅加达。"},{"en":"In some stories, Bima represents strength and loyalty.","zh":"在一些故事里，Bima 象征力量与忠诚。"}]},{"partOfSpeech":"n.","definition":{"en":"(as an acronym) British Interactive Media Association, a UK organization for the digital and creative industries (now often referred to as “BIMA”).","zh":"（作首字母缩写）英国互动媒体协会（British Interactive Media Association），英国数字与创意产业相关组织（常称 BIMA）。"},"examples":[{"en":"He attended a BIMA event on digital design.","zh":"他参加了一个关于数字设计的 BIMA 活动。"},{"en":"BIMA offers training and networking for people in tech and media.","zh":"BIMA 为科技与媒体从业者提供培训与社交资源。"}]}],"phonetic":"/ˈbiːmə/","extraExplanation":["“bima”多半是专有名词或缩写，实际含义要看上下文：是地名、人名，还是组织名（BIMA）。如果你能给我一句原句或你看到它的场景（地图、文章、简历等），我可以帮你确认是哪一种。"]}
{"word":"bimaculate","summary":{"en":"Bimaculate means “two-spotted” or “having two marks,” mainly used in scientific descriptions.","zh":"bimaculate 意为“有两个斑点/印记的”，主要用于科学或生物学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two spots, marks, or blotches (often used in biology to describe patterns on animals or plants).","zh":"有两个斑点（或印记、斑痕）的（常用于生物学中描述动植物的花纹）。"},"examples":[{"en":"The beetle is bimaculate, with two dark spots on its wings.","zh":"这只甲虫是“双斑”的，翅膀上有两个深色斑点。"},{"en":"Researchers identified a bimaculate pattern on the fish’s tail.","zh":"研究人员在这条鱼的尾部发现了“双斑”花纹。"}]}],"synonyms":["two-spotted","two-marked"],"phonetic":"/baɪˈmækjələt/","extraExplanation":["这是一个比较少见、偏学术的词，常见于昆虫学、动物学或植物学的描述中。","词源可拆解理解：bi- 表示“二、双”，maculate 来自拉丁语 macula（斑点）。因此 bimaculate 字面意思就是“有两个斑点的”。","注意不要和常见词 immaculate（无瑕的、纯洁的）混淆；immaculate 里的 im- 是否定前缀，意思相反。"]}
{"word":"bimaculated","summary":{"en":"“Bimaculated” means “having two spots or marks,” often in scientific descriptions.","zh":"“bimaculated”意为“有两个斑点/斑纹的”，常用于科学或生物学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having two spots, marks, or stain-like patches (often used in biology to describe animals or plants)","zh":"有两个斑点/斑纹的；具双斑的（常用于生物学描述动植物）"},"examples":[{"en":"The butterfly’s wings are bimaculated, with one dark spot on each side.","zh":"这只蝴蝶的翅膀是“双斑”的，两侧各有一个深色斑点。"},{"en":"Some field guides describe the frog as bimaculated to help with identification.","zh":"一些野外图鉴用“具双斑”来描述这种青蛙，以便辨认。"}]}],"synonyms":["two-spotted","spotted","marked"],"phonetic":"/ˌbaɪˈmæk.jəˌleɪ.tɪd/","extraExplanation":["“bimaculated”由前缀 bi-（二、双）+ maculated（有斑点的）组成；maculated 来自拉丁语 macula，意思是“斑点、污点”。这是比较少见、偏书面/专业的词，日常英语更常说 “with two spots” 或 “two-spotted”。","在生物学命名或描述中常见类似结构：如 “bicolored（双色的）”“bifurcated（分成两叉的）”。看到 bi- 往往就能猜出“两个/双”的含义。"]}
{"word":"bimagnesic","summary":{"en":"Bimagnesic means “containing two magnesium ions/atoms,” a rare, technical term often replaced by “dimagnesium.”","zh":"bimagnesic 指“含有两个镁离子/原子（双镁/二镁的）”，是较少见的专业用语，常被 dimagnesium 替代。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(chemistry) Containing two magnesium atoms or magnesium ions; “di‑magnesium.”","zh":"（化学）含有两个镁原子或镁离子；相当于“二镁的 / 双镁的”。"},"examples":[{"en":"The label describes the compound as a bimagnesic salt, meaning it has two magnesium ions in each formula unit.","zh":"标签把该化合物描述为 bimagnesic（双镁）盐，意思是每个化学式单位里有两个镁离子。"},{"en":"In some older technical writing, bimagnesic is used where modern texts prefer dimagnesium.","zh":"在一些较旧的技术写作中会用 bimagnesic，而现代文本更常用 dimagnesium（二镁的）。"}]}],"synonyms":["dimagnesium","di-magnesium","magnesium-containing (broader)"],"phonetic":"/ˌbaɪmæɡˈniːzɪk/","extraExplanation":["这个词非常少见，主要出现在化学/药学的专业语境里，有时也属于较旧的命名习惯。现在更常见、也更标准的表达通常是 dimagnesium（“二镁的”）。","理解时可以把前缀 bi- 当作“两个”，magnes- 来自 magnesium（镁），整体就是“有两个镁”的意思。"]}
{"word":"bimah","summary":{"en":"A bimah is the raised platform in a synagogue used for reading the Torah and leading parts of the service.","zh":"bimah指犹太会堂里用于诵读《妥拉》、主持礼拜的高台/讲坛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A raised platform in a synagogue where the Torah is read and services may be led.","zh":"（犹太会堂中的）讲坛/高台，用于诵读《妥拉》并带领礼拜。"},"examples":[{"en":"During the service, the Torah scroll was carried to the bimah for the reading.","zh":"礼拜中，《妥拉》经卷被抬到bimah上诵读。"},{"en":"The rabbi stepped onto the bimah to address the congregation.","zh":"拉比走上bimah向会众讲话。"}]}],"synonyms":["platform","pulpit","bema"],"phonetic":"/ˈbiːmə/","extraExplanation":["“bimah”来自希伯来语“bimá”，意思接近“高处/平台”。在不同传统的会堂里，bimah的位置可能在会堂中央或前方；它的功能核心是诵读《妥拉》。","你也可能看到拼写“bema”（尤其在一些学术或历史语境中）；在东正教等基督宗教传统里，“bema”也可指圣坛前的讲台区域，但“bimah”通常特指犹太会堂的诵经台。"]}
{"word":"bimahs","summary":{"en":"“Bimahs” is the plural of “bimah,” a raised platform in a synagogue used for Torah reading and leading prayers.","zh":"“bimahs”是“bimah”的复数，指犹太会堂里用于宣读《妥拉》和带领祷告的高台/讲台。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a raised platform in a synagogue from which the Torah is read and prayers may be led (plural: bimahs; also spelled bimot in Hebrew-influenced use).","zh":"（犹太会堂中的）讲台/诵读台，用来宣读《妥拉》并带领祷告的高台（复数：bimahs；也常见希伯来式复数 bimot）。"},"examples":[{"en":"The rabbi walked up to the bimah to read from the Torah.","zh":"拉比走上诵读台，宣读《妥拉》。"},{"en":"In some synagogues, the bimah is in the center of the room.","zh":"在一些犹太会堂里，诵读台位于礼堂中央。"}]}],"synonyms":["Torah reading platform","synagogue platform","lectern (approx.)"],"phonetic":"/ˈbiːmə/","extraExplanation":["“bimah”源自希伯来语/犹太宗教传统语汇，常指会堂内的诵读台；不同会堂布局不同，有的在中央、有的靠近会堂前方。","英语里复数常写作“bimahs”，但在宗教语境中也会看到更接近希伯来语的复数“bimot”。"]}
{"word":"bimalar","summary":{"en":"“Bimalar” isn’t a standard English word; it’s likely a name or a misspelling.","zh":"“bimalar”不是常见英语词；更可能是名字或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. “Bimalar” is most likely a proper name (a surname or place name) or a misspelling/typing error.","zh":"不是标准英语词。“bimalar”更可能是专有名词（姓氏或地名），或是拼写/输入错误。"},"examples":[{"en":"I couldn’t find “bimalar” in an English dictionary—could it be a name or a typo?","zh":"我在英语词典里找不到“bimalar”——它会不会是名字或拼错了？"},{"en":"If you meant “bimolar” or “bimodal,” please share the sentence and I can help.","zh":"如果你想写的是“bimolar”或“bimodal”，请把句子发我，我可以帮你确认。"}]}],"phonetic":"/biːˈmɑːlər/","extraExplanation":["在英语学习里，遇到查不到的词，常见原因有：①拼写错误（少一个字母/多一个字母）；②专有名词（人名、地名、品牌名）；③来自其他语言的词（例如土耳其语、印地语等）未进入通用英语词典。","你可以把它出现的完整句子或截图发来，我可以根据上下文判断最可能的意思；也可以告诉我你想表达的中文意思，我帮你反推最合适的英文词。"]}
{"word":"Bimana","summary":{"en":"“Bimana” is usually a rare variant spelling of “vimana,” meaning a divine flying palace or aerial chariot in South Asian religious literature; it can also be a name depending on context.","zh":"“Bimana”通常是“vimana”的罕见变体拼写，指南亚宗教文学中的神圣飞行宫殿或天车；也可能是人名/地名，需看语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a (rare) spelling variant of “vimana”: in Hindu and Buddhist texts, a flying palace or aerial chariot used by gods or heroes.","zh":"（罕见拼写）“vimana”的变体：在印度教与佛教典籍中指神祇或英雄乘坐的“飞行宫殿/天车/空中战车”。"},"examples":[{"en":"In some translations, the hero travels in a bimana across the sky.","zh":"在一些译本中，英雄乘坐 bimana 穿越天空。"},{"en":"The story describes a bimana as shining and fast, like a divine vehicle.","zh":"故事把 bimana 描写得闪耀而迅捷，像神圣的交通工具。"}]},{"partOfSpeech":"other","definition":{"en":"a personal name or place name in some cultures; meaning depends on the language and local usage.","zh":"在一些文化中可作人名或地名；具体含义取决于语言与当地用法。"},"examples":[{"en":"Bimana is used as a name in some communities.","zh":"在一些社群里，Bimana 会被用作名字。"}]}],"synonyms":["vimana","aerial chariot","flying palace"],"phonetic":"/biːˈmɑːnə/","extraExplanation":["“Bimana”在英语里不算常见词，更常见的形式是梵语/巴利语来源的“vimāna（vimana）”。有些英文资料或译本会因为转写体系不同而出现 b/v 的差异。","如果你是在某个具体句子、书名、游戏设定或人名里看到 Bimana，把上下文发我，我可以帮你判断它在那里的准确含义。"]}
{"word":"bimana","summary":{"en":"Bimana (more commonly spelled vimana) refers to a mythical flying vehicle in Indian epics, or a heavenly palace in Buddhist/Hindu texts.","zh":"bimana（更常见写作 vimana）可指印度史诗中的神话飞行载具，也可指佛教/印度教文献中的天宫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian religion & literature) A mythical flying vehicle or chariot, especially in ancient Indian epics.","zh":"（南亚宗教/文学）神话中的飞行载具或战车，尤指古印度史诗里的“飞行战车/飞行器”。"},"examples":[{"en":"In some retellings of the Ramayana, a vimana carries heroes through the sky.","zh":"在一些《罗摩衍那》的改写版本中，vimana（bimana）载着英雄在天空中飞行。"},{"en":"The story describes a shining vimana landing like a divine aircraft.","zh":"故事描写一辆发光的 vimana 像神圣的飞行器一样降落。"}]},{"partOfSpeech":"n.","definition":{"en":"(Buddhism/Hinduism) A heavenly mansion or palace; a divine dwelling place.","zh":"（佛教/印度教）天界的宫殿、天宫；神祇或天人的居所。"},"examples":[{"en":"The text speaks of a celestial vimana adorned with jewels.","zh":"经文提到一座镶嵌宝石的天宫（vimana）。"},{"en":"He is reborn in a vimana after many good deeds, according to the tale.","zh":"故事说他因行善而转生到天宫（vimana）中。"}]}],"synonyms":["vimana","flying chariot","celestial palace","heavenly mansion"],"phonetic":"/viːˈmɑːnə/","extraExplanation":["“bimana”更常见的拼写是“vimana”（梵语 विमाना），英语里多用于讨论印度史诗、神话或宗教文献时的借词。","现代流行文化（小说、游戏、影视）有时会把 vimana 解释成“古代飞船/外星科技”，但在传统语境里它主要是神话或宗教意象。","如果你指的是印尼语/马来语里的“bimana”（较文言、较少用），它也可表示“如何/怎样”；告诉我你的语境我可以按你需要解释。"]}
{"word":"bimanal","summary":{"en":"Bimanal (rare) means “using both hands,” similar to bimanual.","zh":"bimanal（很少用）指“用双手的/涉及双手的”，相当于 bimanual。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Using or involving both hands; bimanual.","zh":"（罕见/少用）双手的；需要两只手一起进行的；相当于 bimanual。"},"examples":[{"en":"The therapist taught him a bimanal exercise to improve coordination in both hands.","zh":"治疗师教他做一个双手练习，以提升两只手的协调能力。"},{"en":"Some video games require bimanal control, like moving with one hand and aiming with the other.","zh":"有些电子游戏需要双手操作，比如一只手移动、另一只手瞄准。"}]}],"synonyms":["bimanual","two-handed","both-handed"],"phonetic":"/baɪˈmænjuəl/","extraExplanation":["“bimanal”在现代英语里非常少见，很多情况下是把更常用的“bimanual”（双手的）写错或写简化了。正式写作、医学/康复/人体工学语境中通常用“bimanual”。","构词提示：bi- 表示“两个/双”，-manual 来自拉丁语 manus（手）。"]}
{"word":"bimane","summary":{"en":"Bimane means “having two hands,” a rare, mainly historical zoological term.","zh":"bimane 指“有两只手的”，是较少见、偏历史语境的动物学用词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(zoology, rare) Having two hands; two-handed (especially describing primates, including humans).","zh":"（动物学，较少用）有两只手的；双手的（尤用于描述灵长类，包括人类）。"},"examples":[{"en":"Humans are bimane primates, with two hands adapted for grasping.","zh":"人类是双手型的灵长类动物，两只手适合抓握。"},{"en":"The text contrasts bimane animals with quadrumanous apes (an outdated idea).","zh":"这段文字把“双手型”动物与“四手型”猿类作对比（这是一种过时的观点）。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, historical) A bimane animal; a member of the group once called “Bimana” (humans).","zh":"（较少用，历史用法）双手型动物；曾被称为“Bimana”（指人类）这一类的成员。"},"examples":[{"en":"In older classifications, humans were separated as the Bimana.","zh":"在较早的分类体系中，人类曾被单独划为“Bimana”。"}]}],"synonyms":["bimanual","two-handed","bimanous"],"phonetic":"/ˈbaɪmeɪn/","extraExplanation":["“bimane”来自拉丁语 bi-（二）+ manus（手）。它在现代英语里非常少见，更常见的词是 bimanual（双手的）或 two-handed。","19世纪一些旧式动物分类把人类称为 Bimana（双手类），把猿类称为 Quadrumana（四手类）。这种划分现在已不被科学界采用，因此你多半只会在旧书或历史语境中见到 bimane。"]}
{"word":"bimanous","summary":{"en":"“Bimanous” means “two-handed; having or using two hands,” used mostly in scientific or medical contexts.","zh":"“bimanous”意为“两手的/用双手的”，多用于生物学或医学等较正式的语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two hands; using both hands.","zh":"有两只手的；用双手的。"},"examples":[{"en":"Humans are bimanous primates.","zh":"人类是有两只手的灵长类动物。"},{"en":"The surgeon performed a bimanous technique to steady the instrument.","zh":"外科医生采用双手操作的技巧来稳定器械。"}]}],"synonyms":["two-handed","bimanual","using both hands"],"phonetic":"ˈbaɪmənəs","extraExplanation":["词源：bi- 表示“二、双”，manus 是拉丁语“手”。这个词常见于生物学/解剖学（描述动物是否有两只手）或医学写作（如 bimanous technique“用双手操作的技术”），日常口语里更常用 two-handed / using both hands 来表达。"]}
{"word":"bimanual","summary":{"en":"Bimanual means using both hands together.","zh":"bimanual 指“需要同时使用双手的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Using or involving both hands at the same time.","zh":"双手的；需要同时使用两只手的。"},"examples":[{"en":"Playing the piano is a bimanual skill because both hands work independently.","zh":"弹钢琴是一种双手技能，因为两只手需要独立配合。"},{"en":"The surgeon practiced bimanual coordination during training.","zh":"外科医生在训练中练习双手协调。"},{"en":"Some video games require bimanual control of the controller.","zh":"有些电子游戏需要用双手来操控手柄。"}]}],"synonyms":["two-handed","two-handedly","bilateral (in context)"],"phonetic":"/baɪˈmænjuəl/","extraExplanation":["词源小提示：bi- 表示“二、双”，manual 来自拉丁语 manus（手）。因此 bimanual 字面意思就是“用两只手的”。","常见使用场景多在医学、心理学/神经科学、运动训练与音乐教育中，用来描述“双手协同/协调”（bimanual coordination）。"]}
{"word":"bimanually","summary":{"en":"Bimanually means doing something with both hands at the same time.","zh":"bimanually 指“用双手（同时）进行”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Using both hands at the same time; with two hands.","zh":"用双手的；双手同时进行的。"},"examples":[{"en":"The surgeon practiced tying knots bimanually to improve precision.","zh":"外科医生练习用双手打结，以提高手术的精确度。"},{"en":"In piano lessons, you learn to coordinate both hands bimanually.","zh":"在钢琴课上，你要学习双手配合演奏。"}]}],"synonyms":["with both hands","two-handedly"],"phonetic":"/baɪˈmænjuəli/","extraExplanation":["“bimanually”常见于医学、康复训练、音乐与运动科学等语境，强调“双手协同”。日常口语里更常说“with both hands”。","词源提示：bi- 表示“两/双”，manual 来自拉丁语 manus（手），合起来就是“用两只手地”。"]}
{"word":"bimarginate","summary":{"en":"Bimarginate describes something (especially a leaf or wing) that has two distinct margins or a double border.","zh":"bimarginate 指（尤指叶片或翅）具有两条明显边缘/双重边界的形态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology, botany/zoology) Having two margins or a double-edged border; appearing to have an outer edge and an inner edge.","zh":"（生物学，植物/动物学）具双边缘的；有双重边界（看起来有外缘与内缘）。"},"examples":[{"en":"Under the microscope, the insect’s wing looks bimarginate along the outer rim.","zh":"在显微镜下，这只昆虫的翅缘看起来是双边缘的。"},{"en":"The botanist described the leaf as bimarginate, with a thin inner border just inside the main edge.","zh":"植物学家把这片叶子描述为双边缘的：在主要叶缘内侧还有一条很细的内缘。"}]}],"synonyms":["double-margined","two-edged","double-bordered"],"phonetic":"/ˌbaɪˈmɑrdʒəˌneɪt/","extraExplanation":["这是一个偏专业的形态学描述词，常见于分类学（taxonomy）或物种鉴定的文字中，用来精确说明器官边缘的结构特征。","词形可拆解为 bi-（两、双）+ marginate（有边缘的）。相关常见词还有 margin（边缘）、marginal（边缘的）。"]}
{"word":"bimarine","summary":{"en":"“Bimarine” is not a common dictionary English word; it’s likely a misspelling or a proper name.","zh":"“bimarine”不是常见词典词汇；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a misspelling, a name (brand/place/person), or a specialized term used in a narrow context.","zh":"不是标准英语词汇；更可能是拼写错误、专有名词（品牌/地点/人名），或某个非常小众领域里的术语。"},"examples":[{"en":"I couldn’t find “bimarine” in major English dictionaries—could you share the sentence you saw it in?","zh":"我在主流英语词典里查不到“bimarine”——你能把它出现的句子发我看看吗？"},{"en":"If you meant “submarine,” the spelling is different.","zh":"如果你想表达“submarine（潜水艇）”，拼写是不一样的。"}]}],"phonetic":"/ˌbaɪməˈriːn/","extraExplanation":["“bimarine”在通用英语里几乎不使用，因此最有学习价值的做法是先确认语境。你可以告诉我它来自哪里（文章/商品名/游戏/论文）以及完整句子。","可能的误拼方向（仅供你对照）：\n1) submarine（潜水艇；海底的）\n2) marine（海洋的；海军陆战队的）\n3) biplane（双翼飞机）—如果你记得是“bi- + ___”结构\n如果你提供语境，我可以帮你判断最可能的目标词并给出准确释义与例句。"]}
{"word":"bimas","summary":{"en":"“BIMAS/bimas” is usually an acronym or a name; it is not a common standalone English word.","zh":"“BIMAS/bimas”通常是缩略词或名称；它不是常见的英语独立词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An acronym used in some contexts (especially in Indonesia) to refer to a government agricultural guidance/intensification program.","zh":"一个在某些语境中使用的首字母缩略词（尤其在印度尼西亚），指政府的农业指导/增产（强化）项目。"},"examples":[{"en":"The report mentioned BIMAS as one of the programs supporting rice farmers.","zh":"报告提到 BIMAS 是支持水稻农民的项目之一。"},{"en":"Under BIMAS, farmers received training and inputs to improve yields.","zh":"在 BIMAS 项目下，农民获得培训和生产资料以提高产量。"}]},{"partOfSpeech":"other","definition":{"en":"A less common use: a name/label (e.g., a group, product, or username). In English, “bimas” is not a standard everyday vocabulary word by itself.","zh":"较少见的用法：作为名称/标签（例如组织、产品或用户名）。在英语里，“bimas”本身不是常见的标准词汇。"},"examples":[{"en":"Bimas is the name of our school club.","zh":"Bimas 是我们学校社团的名字。"},{"en":"I saw “bimas” as a username online.","zh":"我在网上看到有人用“bimas”当用户名。"}]}],"synonyms":["(acronym varies by context)"],"phonetic":"/ˈbiːmɑːz/","extraExplanation":["“bimas”很可能是拼写误差：很多学习者想写的是 **biomass**（生物质/生物量）。如果你想查的是“biomass”，告诉我，我可以按词典格式给出它的发音、释义和例句。","作为缩略词时，BIMAS 的含义会因国家/机构不同而变化；如果你能提供句子或背景（在哪看到的、主题是什么），我可以更准确地解释。"]}
{"word":"bimastic","summary":{"en":"Bombastic means overly grand or exaggerated in speech or writing.","zh":"Bombastic 指说话或写作过分夸张、浮夸。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended word) Using language that is too grand, loud, or exaggerated for the situation; overly pompous.","zh":"（很可能你想查的词）措辞夸张、浮夸；华而不实，过分自大。"},"examples":[{"en":"His speech sounded bombastic, but it didn’t offer any clear plan.","zh":"他的演讲听起来很浮夸，但并没有提出清晰的计划。"},{"en":"The ad uses bombastic claims like “the best product in the world.”","zh":"这则广告用了“世界上最好的产品”之类的夸张说法。"},{"en":"Try to avoid bombastic words in academic writing; be precise instead.","zh":"学术写作要尽量避免浮夸的词，改用更准确的表达。"}]}],"synonyms":["pompous","grandiose","inflated","overblown","high-flown"],"phonetic":"/bɑmˈbæstɪk/","extraExplanation":["“bimastic”不是常见英语单词，最接近且常被拼错的通常是 bombastic（浮夸的）。如果你是在某篇文章/字幕里看到“bimastic”，也可能是拼写错误或专有名词。","bombastic 常用于批评说话或写作“声势很大但内容空”，语气偏负面。","词源上与 bomb（炸弹）有联想效果：给人“轰轰烈烈、很炸”的感觉，但在正式用法里主要指语言风格夸张。"]}
{"word":"bimastism","summary":{"en":"Bimastism means having two breasts (two mammary glands), a rare term mostly seen in biology or older medical contexts.","zh":"Bimastism 指具有两侧乳房／两枚乳腺的状态，是较少见的词，多见于生物学或较旧的医学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the condition of having two breasts (mammary glands); a term used mainly in biology or older medical writing","zh":"（主要用于生物学或较旧的医学文献）具有两侧乳房／两枚乳腺的状态"},"examples":[{"en":"In most mammals, bimastism is the typical pattern: one breast on each side of the chest.","zh":"在大多数哺乳动物中，bimastism 是典型模式：胸部左右各有一个乳房。"},{"en":"The paper contrasts bimastism with species that have multiple pairs of mammary glands.","zh":"这篇论文把 bimastism 与具有多对乳腺的物种作对比。"}]}],"synonyms":["paired mammary glands","two-breasted (descriptive)"],"phonetic":"/baɪˈmæs.tɪz.əm/","extraExplanation":["词源：bi-（二、双）+ mast（乳房，来自希腊语 mastos）+ -ism（状态/现象）。","这是非常少见的词。日常英语中通常不会用它；谈到“多乳头/多乳房”更常见的是 polymastia（多乳房）或 supernumerary nipples（多余乳头）。如果你是在阅读学术文本，bimastism 往往只是强调“正常的两侧一对乳腺”的构型。"]}
{"word":"bimastoid","summary":{"en":"Bimastoid means “having two mastoid processes,” one on each side of the skull.","zh":"bimastoid 指“具有两个乳突”，即颅骨左右两侧各一个乳突。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two mastoid processes (the bony projections behind the ear on the skull).","zh":"（解剖）具有两个乳突（位于耳后方的颅骨突起）的；双乳突的。"},"examples":[{"en":"In some anatomy texts, the skull is described as having a bimastoid region.","zh":"在一些解剖学教材中，颅骨的某个区域会被描述为“双乳突区域”。"},{"en":"The term bimastoid refers to the pair of mastoid processes, one on each side of the head.","zh":"bimastoid 这个词指头部两侧各一个的那一对乳突。"}]}],"synonyms":["two-mastoid","bilateral mastoid (processes)","having mastoid processes on both sides"],"phonetic":"/baɪˈmæs.tɔɪd/","extraExplanation":["词源提示：bi- 表示“二、双”，mastoid 来自希腊语，原意与“乳房/乳头状”外形有关（乳突因形状得名）。","使用场景：该词非常少见，多出现在医学/解剖学、颅骨测量（人类学或法医）等较专业语境中。日常英语更常说 “the mastoid processes (on both sides)”。"]}
{"word":"bimasty","summary":{"en":"“bimasty” is not standard English; it’s probably a misspelling or a proper name.","zh":"“bimasty”不是标准英语单词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name/username rather than vocabulary you would find in dictionaries.","zh":"不是标准英语单词，更可能是拼写错误，或是人名/网名，而非词典里的词汇。"},"examples":[{"en":"I couldn’t find “bimasty” in an English dictionary—could you check the spelling?","zh":"我在英语词典里找不到“bimasty”——你能确认一下拼写吗？"},{"en":"Did you mean “bigamist” or “biomass”?","zh":"你是不是想写“bigamist（重婚者）”或“biomass（生物质）”？"}]}],"synonyms":["bigamist","biomass","BIM-based"],"phonetic":"/ˈbɪmɑsti/","extraExplanation":["“bimasty”在常见英语语料与主流词典中基本没有记录；最常见的情况是输入错误。可能的目标词取决于你的语境：\n1) bigamist /ˈbɪɡəmɪst/：指“重婚者”。\n2) biomassy（较少见）或 biomass /ˈbaɪoʊmæs/：与“生物质”相关。\n3) BIM（建筑信息模型）相关词：如 BIM-based（以BIM为基础的）。\n如果你告诉我它出现的句子/领域（法律、建筑、游戏ID等），我可以帮你锁定最可能的词。"]}
{"word":"bimaxillary","summary":{"en":"Bimaxillary means involving both the upper and lower jaws.","zh":"bimaxillary 指“涉及上下颌两者的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or involving both the upper jaw (maxilla) and the lower jaw (mandible).","zh":"与上下颌（上颌骨与下颌骨）两者都有关的；涉及上下颌的。"},"examples":[{"en":"The dentist evaluated the patient’s bimaxillary alignment.","zh":"牙医评估了患者的上下颌对齐情况。"},{"en":"Bimaxillary surgery may be recommended for severe jaw imbalance.","zh":"严重的颌骨不平衡时，可能会建议进行上下颌联合手术。"}]}],"synonyms":["both-jaw","two-jaw","bi-jaw (informal)"],"phonetic":"/ˌbaɪ.mækˈsɪl.ər.i/","extraExplanation":["词源提示：bi- 表示“两个/两者”，maxillary 来自 maxilla（上颌骨）。因此 bimaxillary 字面意思就是“涉及两侧/两者的上颌”，实际使用中指“上下颌一起”。","常见相关术语：bimaxillary protrusion（上下颌前突）、bimaxillary surgery（上下颌手术，常指正颌手术的一种）。这些多用于牙科、正畸与颌面外科语境。"]}
{"word":"bimbashi","summary":{"en":"Bimbashi is a historical Ottoman/Egyptian military rank, roughly equal to a major.","zh":"Bimbashi 是奥斯曼/埃及旧军制中的军衔名，大致相当于少校。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a military rank used in the Ottoman Empire and in Egypt, roughly equivalent to a major (sometimes translated as “commander of a thousand”).","zh":"（奥斯曼帝国及埃及旧称的）军衔名，大致相当于“少校”（有时也被解释为“千人长/千夫长”的指挥官）。"},"examples":[{"en":"In the novel, the bimbashi commands a small unit stationed at the fort.","zh":"在小说里，这位 bimbashi 指挥驻守在要塞的一支小部队。"},{"en":"The officer was promoted to bimbashi after several campaigns.","zh":"这名军官在多次战役后晋升为 bimbashi。"}]}],"synonyms":["major (approx.)","Ottoman/Egyptian officer (general sense)"],"phonetic":"/ˌbɪmˈbɑʃi/","extraExplanation":["“bimbashi”常见于英语历史书写、旅行记和殖民时期的文献中，用来指奥斯曼与埃及军制里的一个军官等级。不同地区与时期的实际职权和对应军衔可能略有差异，因此英文里常用“major（少校）”作近似翻译。","词源上可追溯到土耳其语（与“bin=一千”“başı=头/长官”相关），因此也会看到解释为“指挥一千人者”的说法，但这更偏词源含义，不一定等同于实际编制人数。"]}
{"word":"bimbil","summary":{"en":"“Bimbil” isn’t a standard English word; it’s likely a misspelling or a name. Context is needed.","zh":"“bimbil”不是标准英语单词；多半是拼写错误或人名/网名，需要上下文确认。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually a misspelling or a name (e.g., a surname/username). In English writing, it may be intended to be “bimble” or “bimbo,” depending on context.","zh":"不是标准英语单词；通常是拼写错误或人名/网名（例如姓氏）。在英文语境中，它可能本来想写的是“bimble”或“bimbo”，需要看上下文判断。"},"examples":[{"en":"I couldn’t find “bimbil” in an English dictionary—did you mean “bimble” or “bimbo”?","zh":"我在英文词典里找不到“bimbil”——你想写的是“bimble”还是“bimbo”？"},{"en":"Bimbil is my online username, not an English word.","zh":"Bimbil 是我的网名，不是英语单词。"}]}],"phonetic":"ˈbɪmbɪl","extraExplanation":["“bimbil”在英语里不常见，也没有稳定的主流词义；最常见的情况是拼写误差。你可以告诉我它出现的句子或来源（聊天、歌词、小说、游戏名等），我就能更准确判断你想表达的词。","如果你想表达“闲逛/漫步”，更可能是 **bimble**（英式英语更常见）；如果你看到的是带侮辱色彩、指“头脑简单的漂亮女孩/花瓶”的词，那可能是 **bimbo**（使用时要注意语气与场合）。"]}
{"word":"Bimbisara","summary":{"en":"Bimbisara was an ancient Indian king of Magadha, well known for his support of early Buddhism.","zh":"频婆娑罗是古印度摩揭陀国王，以支持早期佛教而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a king of the ancient Indian kingdom of Magadha (reigned c. 543–491 BCE), remembered in Buddhist and Jain traditions for supporting early religious communities, including the Buddha’s sangha.","zh":"古印度摩揭陀国的国王（约公元前543–491年在位），在佛教与耆那教传统中以支持早期宗教团体（包括佛陀僧团）而著名。"},"examples":[{"en":"Bimbisara is often described in Buddhist texts as a generous patron of the Buddha.","zh":"在佛教经典中，频频提到频婆娑罗王是佛陀的慷慨护法。"},{"en":"Many history lessons mention Bimbisara when introducing the rise of Magadha.","zh":"许多历史课程在讲到摩揭陀的崛起时都会提到频婆娑罗王。"}]}],"synonyms":["King Bimbisara","Bimbisāra","频婆娑罗王"],"phonetic":"/bɪmˈbɪsərə/","extraExplanation":["“Bimbisara”常见中文译名为“频婆娑罗（王）”。他与佛陀的关系在佛教故事中很重要：据传他在王舍城（Rājagaha/Rajgir）附近供养竹林精舍（Veluvana），成为僧团早期的重要道场之一。","在不同传统与文献里，相关情节细节可能略有差异（例如与其子阿阇世王 Ajātasattu 的故事）。阅读时可留意是佛教、耆那教还是历史研究的叙述角度。"]}
{"word":"Bimble","summary":{"en":"“Bimble” means to walk or wander in a relaxed, aimless way; it can also mean such a walk (informal, especially British).","zh":"“bimble”指悠闲地随便走走、漫步；也可指这种散步（口语，尤偏英式）。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to walk in a relaxed, unhurried way, often without a clear destination; to amble","zh":"（悠闲地）慢走、漫步；常带有“没明确目的地随便走走”的感觉"},"examples":[{"en":"We bimbled along the beach after dinner.","zh":"晚饭后我们沿着海滩悠闲地走着。"},{"en":"She likes to bimble around the market on Saturday mornings.","zh":"她喜欢周六早上在市场里随意逛逛。"}]},{"partOfSpeech":"n.","definition":{"en":"a relaxed, unhurried walk","zh":"悠闲的散步；漫步"},"examples":[{"en":"Let’s go for a bimble around the park.","zh":"我们去公园里随便散散步吧。"}]}],"synonyms":["amble","stroll","wander","meander","potter (BrE)"],"phonetic":"/ˈbɪmbəl/","extraExplanation":["“bimble”多见于英式英语，语气偏口语、轻松随意；在美式英语里也能理解，但更常见的说法是“amble / stroll / wander”。","它常暗示“没有特别计划、边走边看”的感觉，和“hike（徒步）”那种更有目的或更费力的走法不一样。"]}
{"word":"bimbo","summary":{"en":"“Bimbo” is a slang, often offensive noun meaning an attractive but unintelligent person (usually a woman).","zh":"“bimbo”是俚语且常具冒犯性，指被认为外表吸引但不聪明的人（通常指女性）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, often offensive) A woman seen as attractive but unintelligent; an insulting word.","zh":"（俚语，常具冒犯性）指被认为外表性感但不聪明的女性；贬义侮辱用语。"},"examples":[{"en":"The movie relies on the “bimbo” stereotype, which many people find sexist.","zh":"这部电影依赖“花瓶女”的刻板印象，很多人认为这很性别歧视。"},{"en":"It’s better to avoid calling anyone a bimbo—it’s disrespectful.","zh":"最好不要叫任何人“bimbo”，这很不尊重人。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) A man seen as attractive but unintelligent; sometimes used as “himbo.”","zh":"（较少见）指被认为外表好看但不聪明的男性；也常用“himbo”。"},"examples":[{"en":"In some shows, the “himbo” character is a friendly bimbo-type guy.","zh":"在一些剧里，“himbo”角色就是那种友善的“花瓶男”类型。"}]}],"synonyms":["airhead","ditz","empty-headed person","himbo (male, informal)"],"phonetic":"/ˈbɪmboʊ/","extraExplanation":["这个词在英语里通常带有强烈贬义，常与“物化女性”“性别刻板印象”相关，因此在正式场合或对人称呼时应避免使用。","词源来自意大利语 bimbo，原意是“（男）小孩”，后来在英语里语义转变并带上性别化与侮辱性含义。","如果想更中性地表达“只看重外表”的刻板印象，可用 less insulting 的说法：airhead（傻白甜/没脑子，仍偏贬）、shallow（肤浅的）、ditzy（傻乎乎的，较口语）。"]}
{"word":"bimboes","summary":{"en":"“Bimboes” is a nonstandard spelling of the plural; the correct plural is “bimbos.” “Bimbo” is slang (often offensive) for someone, especially a woman, seen as attractive but unintelligent.","zh":"“bimboes”是非标准的复数拼写；正确写法是“bimbos”。“bimbo”是俚语（常带侮辱性），指被认为“好看但不聪明”的人，尤其指女性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Misspelling) The plural of “bimbo.” The standard plural spelling is “bimbos.”","zh":"（拼写错误）“bimbo”的复数。标准复数拼写是“bimbos”。"},"examples":[{"en":"“Bimboes” is not standard; write “bimbos” instead.","zh":"“bimboes”不是标准拼写；应写作“bimbos”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Slang, usually offensive) A person—especially a woman—seen as attractive but not intelligent; often used as an insult.","zh":"（俚语，通常带侮辱性）指被认为“好看但不聪明”的人，尤指女性；常用作辱骂。"},"examples":[{"en":"He insulted her by calling her a bimbo.","zh":"他叫她“bimbo”是在侮辱她。"},{"en":"The movie avoids turning its female characters into “bimbos.”","zh":"这部电影避免把女性角色塑造成“花瓶/傻白甜”式的刻板形象。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common, slang) An unintelligent or silly man; sometimes contrasted with “himbo” (an attractive but kind, not-so-smart man).","zh":"（较少见，俚语）指愚蠢的男人；有时会与“himbo”（帅气、善良但不太聪明的男性）对比使用。"},"examples":[{"en":"In older slang, bimbo could refer to a foolish man.","zh":"在较早的俚语里，bimbo也可能指愚蠢的男人。"}]}],"synonyms":["airhead","dummy","idiot","shallow person"],"phonetic":"ˈbɪmboʊ","extraExplanation":["“bimbo”在当代英语里多被认为是带性别偏见的贬义词，容易冒犯他人。日常表达中更中性、更礼貌的说法可以用：“airhead”（没头脑的人）、“shallow person”（肤浅的人），或直接描述行为而不是给人贴标签。","拼写提示：以 -o 结尾的外来词/口语名词在英语里通常直接加 -s 变复数：bimbo → bimbos（而不是 *bimboes）。"]}
{"word":"bimbos","summary":{"en":"“Bimbos” is the plural of “bimbo,” an offensive slang insult, usually aimed at women, meaning an attractive person seen as unintelligent.","zh":"“bimbos”是“bimbo”的复数，是一种带侮辱性的俚语，通常指女性，意为“被认为漂亮但不聪明的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very insulting slang term for an attractive woman who is believed to be unintelligent (plural of “bimbo”).","zh":"一个非常侮辱性的俚语，用来指“外表漂亮但被认为不聪明的女性”（“bimbo”的复数）。"},"examples":[{"en":"Some tabloids unfairly called the actresses “bimbos.”","zh":"一些小报不公平地把这些女演员称为“bimbos”。"},{"en":"That word is sexist and disrespectful—please don’t use it.","zh":"这个词带有性别歧视且不尊重人——请不要使用。"}]},{"partOfSpeech":"n.","definition":{"en":"sometimes used (less commonly) to insult a man as silly or unintelligent.","zh":"有时（较少见）也用来侮辱男性，表示“傻、没脑子”的人。"},"examples":[{"en":"He called his friend a bimbo as a joke, but it still sounded rude.","zh":"他开玩笑把朋友叫作 bimbo，但听起来还是很无礼。"}]}],"synonyms":["airhead","ditz","dummy","shallow person"],"phonetic":"/ˈbɪmboʊ/","extraExplanation":["语用提醒：bimbo 在英语里通常指女性，带有强烈的贬低、物化和性别刻板印象色彩；在正式场合或对人评价时应避免使用。更中性的替代说法可用：\"shallow\"（肤浅的）、\"airheaded\"（没头脑的，仍偏负面但较少性别指向）、\"not very knowledgeable\"（不太懂/不太了解）。","词源小知识：bimbo 早期在英语中曾指“粗鲁的男人/家伙”，后来含义逐渐转为指女性并与外貌、愚蠢刻板印象绑定，因此现在常被视为带侮辱性与性别歧视。"]}
{"word":"bimeby","summary":{"en":"Bimeby is an old-fashioned form of “by and by,” meaning “soon” or “eventually.”","zh":"bimeby 是“by and by”的古体形式，意思是“不久”或“最终/后来”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Archaic/poetic) Soon; before long.","zh":"（古体/诗歌用语）不久；很快。"},"examples":[{"en":"I’ll be there bimeby.","zh":"我不久就到。"},{"en":"Bimeby the rain stopped and the sun came out.","zh":"不久雨停了，太阳出来了。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Archaic) Eventually; after some time.","zh":"（古体）最终；过了一段时间之后。"},"examples":[{"en":"He didn’t agree at first, but bimeby he changed his mind.","zh":"他起初不同意，但最终改变了主意。"},{"en":"Bimeby, they became close friends.","zh":"后来他们成了亲密的朋友。"}]}],"synonyms":["soon","before long","presently","eventually","in time"],"phonetic":"/ˈbaɪmˌbaɪ/","extraExplanation":["“bimeby”是“by and by”的旧拼法/变体，带有口语方言或文学仿古的味道。现代英语里更常用“soon / before long / eventually”。","你可能会在经典文学中看到它（例如19世纪小说里用来模仿口音或营造旧时氛围）；在日常写作中使用会显得刻意复古。"]}
{"word":"bimedial","summary":{"en":"Bimedial means involving two media, often combining visual and audio or text and audio.","zh":"bimedial 指“涉及两种媒介”的，常见于视听结合或文字与音频结合的表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"using or involving two media or two modes of communication (often sound + visuals, or print + audio).","zh":"使用或涉及两种媒介/两种表达方式（常指声音+画面，或文字+音频）。"},"examples":[{"en":"The course uses a bimedial approach: short videos plus written notes.","zh":"这门课采用双媒介方式：短视频加书面笔记。"},{"en":"Bimedial advertising combines an online banner with a radio spot.","zh":"双媒介广告把线上横幅广告与电台广告结合起来。"}]}],"synonyms":["audiovisual","multimodal","two-media"],"phonetic":"/baɪˈmiːdiəl/","extraExplanation":["“bimedial”较少见，更多时候人们会用更常用的词如“audiovisual（视听的）”或“multimodal（多模态的）”。","构词上：bi- 表示“两个/双”，medial 与 media（媒介）同源，整体意思就是“涉及两种媒介”。在教育学、传播学或广告语境中更可能出现。"]}
{"word":"bimensal","summary":{"en":"Bimensal is a rare English word meaning either “twice a month” or “every two months,” so it often needs clarification.","zh":"bimensal 在英语中很少见，可指“每月两次”或“每两个月一次”，通常需要说明以避免歧义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare in English) happening or paid twice a month; semimonthly.","zh":"（英语中较少见）每月发生或支付两次；半月一次（semimonthly）。"},"examples":[{"en":"She receives a bimensal paycheck on the 1st and 15th.","zh":"她的工资是半月一次，在每月1号和15号发放。"},{"en":"The club holds bimensal meetings to plan events.","zh":"俱乐部每月开两次会来筹划活动。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) happening every two months; bimonthly.","zh":"（较不常见）每两个月一次；双月一次（bimonthly）。"},"examples":[{"en":"The journal is published on a bimensal schedule (every two months).","zh":"这本期刊按每两个月一期的频率出版。"},{"en":"They review the budget bimensally to match the reporting cycle.","zh":"他们每两个月审查一次预算，以配合报表周期。"}]}],"synonyms":["semimonthly","bimonthly","twice a month","every two months"],"phonetic":"/baɪˈmɛn.səl/","extraExplanation":["“bimensal”在英语里非常少见，更常见的是用“semimonthly”（每月两次）或“bimonthly”（可能指每月两次或每两个月一次）。因此在正式写作中若用“bimensal”，最好在括号里明确说明是“twice a month”还是“every two months”，以避免歧义。","这个词在葡萄牙语/西班牙语语境中更常见（如公司发薪、账单周期），但进入英语时常因与“bimonthly”的含义重叠而不流行。"]}
{"word":"bimester","summary":{"en":"A “bimester” is a two-month period, or something that happens/lasts every two months.","zh":"“bimester”指“两个月的时间（双月期）”，也可形容“每两个月一次/持续两个月的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a period of two months","zh":"两个月的时间；双月期"},"examples":[{"en":"The course is divided into six bimesters, with an exam at the end of each one.","zh":"这门课程分成六个双月期，每个双月期结束都有考试。"},{"en":"Our billing cycle is bimester-based, so you receive an invoice every two months.","zh":"我们的计费周期按双月期计算，所以你每两个月会收到一次账单。"}]},{"partOfSpeech":"adj.","definition":{"en":"happening, lasting, or measured in periods of two months","zh":"每两个月一次的；持续两个月的；以两个月为单位计算的"},"examples":[{"en":"They publish a bimester report on progress.","zh":"他们每两个月发布一次进度报告。"},{"en":"The school uses a bimester grading system.","zh":"这所学校采用双月期的评分制度。"}]}],"synonyms":["two-month period","bimonthly (context-dependent)"],"phonetic":"/baɪˈmɛstər/","extraExplanation":["“bimester”由前缀 bi-（二、双）+ “mester”（来自拉丁语 mensis，意为“月”）组成，字面意思就是“两个月”。","在美国日常英语里更常见的说法是 “two-month period” 或 “every two months / bimonthly”。“bimester”在一些地区（尤其是拉丁美洲的教育与行政语境）更常见。"]}
{"word":"bimesters","summary":{"en":"“Bimesters” means two-month periods, often used for school terms.","zh":"“bimesters”指为期两个月的时间段，常用于表示学校的两个月一期学段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"two-month periods; two-month school terms (plural of “bimester”)","zh":"两个月的时间段；（学校）两个月为一期的学期/学段（bimester 的复数）"},"examples":[{"en":"The school year is divided into four bimesters.","zh":"这个学年被分成四个两个月一期的学段。"},{"en":"Grades are reported at the end of each bimester.","zh":"成绩会在每个两个月一期结束时公布。"}]}],"synonyms":["two-month periods","two-month terms","bi-month terms"],"phonetic":"/baɪˈmɛstər/","extraExplanation":["“bimester”在一些教育体系里很常见，尤其在拉丁美洲（例如巴西的英语语境中），指以“两个月”为单位的学期分段。美国英语里更常见的说法通常是“two-month term/period”。","注意与“bimonthly”区分：bimonthly 可能表示“每两个月一次”或“一个月两次”，容易引起歧义；而 bimester 通常明确就是“连续两个月的一段时间”。"]}
{"word":"bimestrial","summary":{"en":"Bimestrial usually means “every two months” and is often used for publications (a bimestrial journal).","zh":"Bimestrial 通常指“每两个月一次”，常用于期刊等出版物（如双月刊）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening once every two months; lasting for a two-month period.","zh":"每两个月发生一次；为期两个月的。"},"examples":[{"en":"The journal is bimestrial, so new issues come out in January, March, May, and so on.","zh":"这本期刊是双月刊，所以新一期会在一月、三月、五月等月份出版。"},{"en":"We do a bimestrial review of our budget to stay on track.","zh":"我们每两个月做一次预算审查，以确保进度正常。"}]},{"partOfSpeech":"n.","definition":{"en":"A publication or event that occurs every two months.","zh":"双月刊；每两个月一次的活动/事物。"},"examples":[{"en":"She writes for a local bimestrial focused on community news.","zh":"她为一本关注社区新闻的本地双月刊撰稿。"}]}],"synonyms":["bimonthly","every two months","every other month"],"phonetic":"/baɪˈmiːstriəl/","extraExplanation":["“bimestrial”相对少见，更常见的是“bimonthly”。注意：英语里的“bimonthly”有时会被用来表示“每两个月一次”或“一个月两次”，容易引起歧义；如果要表达清楚，常直接说“every two months（每两个月）”或“twice a month（每月两次）”。","拼写也常见变体“bimestral”。在正式写作中，为避免读者不熟悉该词，很多人会改用更直白的表达（如 every two months）。"]}
{"word":"bimetal","summary":{"en":"Bimetal means “made of two metals,” especially a bonded part used to react to temperature changes in devices like thermostats.","zh":"bimetal 指“由两种金属组成/粘合”的材料或元件，常用于恒温器等装置中利用热胀冷缩差异进行温控。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made of two different metals, often bonded together so they expand differently when heated.","zh":"由两种不同金属组成（或粘合在一起）的，常见用途是利用受热膨胀差异。"},"examples":[{"en":"A bimetal strip bends when the temperature changes.","zh":"双金属片会随着温度变化而弯曲。"},{"en":"Many thermostats use a bimetal spring to turn the heater on or off.","zh":"很多恒温器使用双金属弹簧来控制加热器的开关。"}]},{"partOfSpeech":"n.","definition":{"en":"A bimetal strip or part made from two bonded metals, especially used in thermostats and circuit breakers.","zh":"双金属（片/元件）：由两种金属粘合而成的部件，尤用于恒温器和断路器等。"},"examples":[{"en":"The technician replaced the worn bimetal in the old thermostat.","zh":"技术员更换了旧恒温器里磨损的双金属元件。"},{"en":"If the bimetal overheats, it can trip the breaker.","zh":"如果双金属过热，可能会触发断路器跳闸。"}]}],"synonyms":["bimetallic"],"phonetic":"/ˌbaɪˈmɛtəl/","extraExplanation":["“bimetal”由前缀 bi-（“两、双”）+ metal（“金属”）组成。常见的“双金属片”利用两种金属热膨胀系数不同：加热时一侧伸长更多，于是整片会弯曲，从而推动开关动作（例如恒温器、温控器、热保护器）。","相关词：bimetallic（形容词，更常见于技术语境，如 bimetallic strip）；bimetal thermostat（双金属温控器）。"]}
{"word":"bimetalic","summary":{"en":"Bimetallic means “made of two different metals,” and it can also describe a monetary system based on two metals (usually gold and silver).","zh":"Bimetallic 指“由两种不同金属构成/结合”，也可指以两种金属（通常金与银）为基础的货币制度（双本位制）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made of or involving two different metals, often bonded together.","zh":"由两种不同金属制成或涉及两种金属（常指把两种金属结合在一起）。"},"examples":[{"en":"A bimetallic strip bends when it heats up.","zh":"双金属片受热时会弯曲。"},{"en":"Some coins are bimetallic, with a different metal in the center and the ring.","zh":"有些硬币是双金属的，中间和外环用不同金属。"}]},{"partOfSpeech":"adj.","definition":{"en":"(In economics/monetary history) Using two metals, usually gold and silver, as the basis of money.","zh":"（经济/货币史）实行双本位制：以两种金属（通常是金和银）作为货币基础。"},"examples":[{"en":"The country once had a bimetallic monetary system.","zh":"这个国家曾实行过双本位的货币制度。"},{"en":"Debates over bimetallic currency were common in the 19th century.","zh":"19世纪关于双金属货币的争论很常见。"}]}],"synonyms":["two-metal","bi-metal","dual-metal","bimetal"],"phonetic":"ˌbaɪməˈtælɪk","extraExplanation":["你输入的拼写“bimetalic”更常见的标准拼写是 **bimetallic**（双写 l）。","常见的理工科用法是 **bimetallic strip（双金属片）**：两种金属的热膨胀程度不同，所以温度变化时会弯曲，用于温控器、断路器等装置。","货币史里的 bimetallic 指“双本位制”，与 **gold standard（金本位）** 相对。"]}
{"word":"bimetalism","summary":{"en":"Bimetalism is a monetary system that uses two metals—usually gold and silver—as legal money at a fixed exchange rate.","zh":"双本位制是一种以两种金属（通常为金和银）作为法定货币并规定固定兑换比率的货币制度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a monetary system in which a government sets the value of money using two metals—usually gold and silver—both of which are legal tender at a fixed rate","zh":"双本位制；一种货币制度：政府以两种金属（通常是黄金和白银）为货币基础，并规定它们之间的固定兑换比率，二者都具有法定货币地位"},"examples":[{"en":"In the late 1800s, bimetalism became a major political issue in the United States.","zh":"在19世纪末，双本位制成为美国的重要政治议题。"},{"en":"Supporters of bimetalism argued that adding silver money would increase the money supply and help farmers and debtors.","zh":"双本位制的支持者认为，加入白银货币能增加货币供应，有利于农民和负债者。"},{"en":"Many countries eventually moved away from bimetalism and adopted the gold standard.","zh":"许多国家后来逐渐放弃双本位制，转而采用金本位制。"}]}],"synonyms":["dual-metal standard","gold-and-silver standard"],"phonetic":"/baɪˈmɛt̬əlˌɪzəm/","extraExplanation":["双本位制的核心难点是“固定比价”常常与市场价格不一致：当金银市场比价变化时，人们会倾向于把“更值钱”的金属收藏或出口，而用“较不值钱”的金属来支付（常被概括为“劣币驱逐良币”的现象）。","在美国历史语境中，双本位制常与“Free Silver（自由铸银）”运动相关；1896年总统竞选中，威廉·詹宁斯·布莱恩（William Jennings Bryan）的演讲《Cross of Gold》使相关争论广为人知。","词源提示：bi- 表示“两个”，metal 指“金属”，-ism 表示“主义/制度”，合起来就是“以两种金属为基础的制度”。"]}
{"word":"bimetallic","summary":{"en":"Bimetallic means “made of or involving two different metals,” commonly in temperature-sensitive parts like bimetal strips; it can also refer to a money system based on two metals (gold and silver).","zh":"bimetallic 指“由两种不同金属构成/涉及两种金属”，常见于双金属温控元件；也可指以两种金属（如金与银）为基础的货币双本位制度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made of two different metals (often bonded together) so they behave differently, especially when heated.","zh":"由两种不同金属构成（常常是黏合在一起），使其在受热等条件下表现不同。"},"examples":[{"en":"A bimetallic strip bends when the temperature changes.","zh":"双金属片在温度变化时会弯曲。"},{"en":"Many thermostats use a bimetallic spring to control the switch.","zh":"许多恒温器用双金属弹簧来控制开关。"}]},{"partOfSpeech":"adj.","definition":{"en":"Involving two metals, especially when both are used as money (a currency system based on two metals).","zh":"涉及两种金属（尤指在货币制度中同时以两种金属为本位的“双本位制”）。"},"examples":[{"en":"Some countries once followed a bimetallic standard using gold and silver.","zh":"一些国家曾实行金银双本位制。"},{"en":"The debate over bimetallic currency was important in 19th-century economics.","zh":"关于双金属货币的争论在19世纪经济学中很重要。"}]}],"synonyms":["two-metal","dual-metal"],"phonetic":"/ˌbaɪməˈtælɪk/","extraExplanation":["“bi-”表示“两/双”，如 bicycle（自行车）、bilingual（双语）；“metallic”表示“金属的”。所以 bimetallic 字面意思就是“由两种金属组成的”。","在工程里，bimetallic 常见于 bimetallic strip（双金属片）：两种金属热胀冷缩程度不同，受热后会弯曲，从而用于温控开关等装置。","在历史与经济语境中，bimetallic 常与 bimetallism（双本位制）相关，指把两种金属（常见为金与银）都作为法定货币基础。"]}
{"word":"bimetallism","summary":{"en":"Bimetallism is a money system that uses both gold and silver as legal currency at a fixed legal exchange rate.","zh":"bimetallism（复本位制）指同时以黄金和白银为法定货币，并用法律规定固定兑换比率的货币制度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A monetary system in which a country uses two metals—usually gold and silver—as legal money, with a fixed exchange rate between them set by law.","zh":"一种货币制度：国家同时把两种金属（通常是黄金和白银）作为法定货币，并由法律规定两者之间的固定兑换比率。"},"examples":[{"en":"In the late 1800s, bimetallism was a major issue in U.S. politics.","zh":"在19世纪末，复本位制（bimetallism）是美国政治中的一个重大议题。"},{"en":"Supporters of bimetallism argued that adding silver would increase the money supply.","zh":"复本位制的支持者认为，加入白银可以增加货币供应量。"},{"en":"The debate over bimetallism often centered on farmers’ debt and falling prices.","zh":"关于复本位制的争论常常围绕农民债务与物价下跌展开。"}]}],"synonyms":["double standard (monetary)","bimetallic standard"],"phonetic":"/baɪˈmɛt̬lˌɪzəm/","extraExplanation":["复本位制的关键难点在于：市场上金银价格会变化，但法律规定的兑换比率可能不变，导致“劣币驱逐良币”（格雷欣法则）的现象——人们倾向于把更“值钱”的金属囤起来或出口，只在日常流通中使用相对“便宜”的那一种。","美国历史语境里常见的相关词是“free silver（自由铸银）”和“gold standard（金本位制）”。1896年美国大选中，布莱恩（William Jennings Bryan）的演讲《Cross of Gold》让这一争论广为人知。"]}
{"word":"bimetallist","summary":{"en":"A bimetallist is someone who supports using both gold and silver as money (bimetallism).","zh":"bimetallist 指支持金银并用的“双本位制”的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who supports or advocates bimetallism (using both gold and silver as legal money, usually at a fixed ratio).","zh":"支持或主张“双本位制”的人（主张金和银同时作为法定货币，通常按固定比价兑换）。"},"examples":[{"en":"In the late 1800s, many farmers became bimetallists because they believed more silver money would raise prices.","zh":"在19世纪末，许多农民成为双本位制支持者，因为他们认为增加白银货币会推高物价。"},{"en":"The politician spoke like a bimetallist, arguing that silver should be used alongside gold.","zh":"那位政治家的观点像双本位制支持者一样，主张白银应与黄金并用。"}]}],"synonyms":["bimetalism supporter","advocate of bimetallism","Free Silver supporter (historical, U.S.)"],"phonetic":"/ˌbaɪˈmɛtəlɪst/","extraExplanation":["“bimetallist”常见于19世纪后期的英美经济与政治讨论，尤其与美国“Free Silver（自由铸银）”运动有关；当时不少人认为引入更多白银可扩大货币供给、缓解债务压力。","词形上由“bimetal-（双金属/两种金属）”+“-ist（……主义者/……者）”构成。文学与历史写作中偶见，用来指某一阵营的支持者。"]}
{"word":"bimetallistic","summary":{"en":"Bimetallistic means “connected with a money system based on both gold and silver (or two metals).”","zh":"bimetallistic 指“与以两种金属（常为金与银）为基础的货币制度有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to bimetallism: a monetary system that uses two metals (usually gold and silver) as a legal basis for currency, typically with a fixed exchange rate between them.","zh":"与“双金属本位制”有关的：指一种货币制度，以两种金属（通常为黄金与白银）作为法定货币基础，往往规定两者之间的固定兑换比率。"},"examples":[{"en":"In the late 1800s, bimetallistic policies were debated fiercely in U.S. politics.","zh":"在19世纪末，美国政坛曾激烈争论双金属本位制的政策。"},{"en":"The economist argued that a bimetallistic standard could stabilize prices better than a single-metal standard.","zh":"这位经济学家认为，与单一金属本位相比，双金属本位制可能更能稳定物价。"}]}],"synonyms":["bimetallic","relating to bimetallism"],"phonetic":"/ˌbaɪˌmɛtəˈlɪstɪk/","extraExplanation":["“bimetallistic”来自“bi-（两者）+ metallic（金属的）”。它常用于历史与经济语境，尤其与19世纪的“金银复本位/双金属本位”争论相关。","常见相关词：bimetallism（双金属本位制，名词）、bimetallic（双金属的/双金属本位的，形容词）。实际写作中更常见的是“bimetallic standard（双金属本位）”和“bimetallism”。","历史背景简述：当市场上金银的相对价格变化时，固定比价可能导致“劣币驱逐良币”（例如某种金属币被囤积或流出），这是双金属本位制争议的核心之一。"]}
{"word":"bimetallists","summary":{"en":"Bimetallists are people who support a money system based on both gold and silver (two metals).","zh":"Bimetallists 指支持以黄金和白银两种金属为基础的货币制度的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who support bimetallism—the use of two metals (usually gold and silver) as a basis for a country’s money system.","zh":"支持“双金属制”的人——主张以两种金属（通常是黄金和白银）作为国家货币制度基础的人。"},"examples":[{"en":"In the late 1800s, bimetallists argued that adding silver to the money supply would help farmers and workers.","zh":"在19世纪末，双金属制支持者认为把白银纳入货币供应可以帮助农民和工人。"},{"en":"The debate between bimetallists and supporters of the gold standard shaped U.S. politics for years.","zh":"双金属制支持者与金本位支持者之间的争论多年影响了美国政治。"}]}],"synonyms":["supporters of bimetallism","free-silver advocates","pro-silver advocates"],"phonetic":"/ˌbaɪˈmɛtəlɪsts/","extraExplanation":["“bimetallists”常见于历史与经济语境，尤其是19世纪的美国与英国货币争论。美国在19世纪末出现“自由铸银（free silver）”运动，许多支持者属于双金属制阵营，认为同时使用金、银可以增加货币供应、缓解债务压力。","词形提示：bimetallist（单数）→ bimetallists（复数）。相关概念：bimetallism（双金属制）、gold standard（金本位）、silver standard（银本位）。"]}
{"word":"bimetals","summary":{"en":"Bimetals are two bonded metals—often used in devices like thermostats because they bend with temperature changes.","zh":"bimetals 指结合在一起的两种金属，常用于恒温器等装置中，因温度变化而弯曲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Two different metals joined together (often in layers), especially so they expand differently when heated and can bend or trigger a switch.","zh":"两种不同的金属结合在一起（常为层状），尤其用于利用受热时膨胀率不同而产生弯曲或触发开关。"},"examples":[{"en":"Bimetals are used in thermostats to turn heating systems on and off.","zh":"双金属常用于恒温器中，用来控制供暖系统的开与关。"},{"en":"When the temperature rises, the bimetal bends because the two metals expand at different rates.","zh":"温度升高时，双金属会弯曲，因为两种金属的膨胀速度不同。"}]}],"synonyms":["bimetal strips","bimetallic strips"],"phonetic":"/ˌbaɪˈmɛtəlz/","extraExplanation":["“bimetal”更常见的说法是“bimetal strip（双金属片）”或“bimetallic strip”。它常见于老式温控器、断路器、烤箱温度控制等装置中：受热后弯曲，弯到一定程度就接通或断开电路。","拼写提示：bimetal（单数）/ bimetals（复数）；形容词常用 bimetallic（双金属的）。"]}
{"word":"bimethyl","summary":{"en":"“Bimethyl” is an older chemistry term for ethane, and more loosely can mean “having two methyl groups” (now usually said as “dimethyl”).","zh":"“bimethyl”多为化学旧称，指乙烷；也可泛指“含两个甲基的”，但现代更常用“dimethyl”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical/chemistry) Ethane (C₂H₆), understood as two methyl (CH₃) groups joined together.","zh":"（化学/旧称）乙烷（C₂H₆），可理解为两个甲基（CH₃）连接在一起。"},"examples":[{"en":"In older chemistry texts, ethane was sometimes called bimethyl.","zh":"在一些较早的化学教材中，乙烷有时被称为 bimethyl。"},{"en":"Bimethyl (ethane) is a simple hydrocarbon found in natural gas.","zh":"Bimethyl（乙烷）是一种简单的烃类，可存在于天然气中。"}]},{"partOfSpeech":"adj.","definition":{"en":"(chemistry, less common) Having or involving two methyl groups; similar in meaning to “dimethyl.”","zh":"（化学，较少用）含有或涉及两个甲基的；意思接近 dimethyl（“二甲基的”）。"},"examples":[{"en":"The molecule has a bimethyl substitution pattern (i.e., two methyl groups).","zh":"该分子呈现 bimethyl 的取代模式（即有两个甲基）。"},{"en":"Many modern papers prefer the term dimethyl rather than bimethyl.","zh":"许多现代论文更倾向使用 dimethyl，而不是 bimethyl。"}]}],"synonyms":["ethane","dimethyl"],"phonetic":"/baɪˈmɛθəl/","extraExplanation":["“bimethyl”在现代英语化学写作中不常见，多见于早期命名方式：把乙烷看作“两个甲基（methyl）连在一起”，因此称为“bi-（两个）+ methyl”。如今更标准的名称是 ethane（乙烷）。","如果你是在有机化学语境里想表达“含两个甲基取代”，通常用 dimethyl- 作为前缀（如 1,1-dimethyl… 或 1,2-dimethyl…），会更清晰、也更符合现代命名习惯。"]}
{"word":"bimethyls","summary":{"en":"“Bimethyl(s)” is a rare chemistry term meaning “having two methyl (–CH₃) groups,” often used loosely; many texts instead use “dimethyl.”","zh":"“bimethyl(s)”是较少见的化学用语，意为“含两个甲基（–CH₃）”，常被宽泛使用；很多场合更常用“dimethyl（二甲基）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(chemistry) A compound or structural unit containing two methyl groups (–CH₃) attached to a larger molecule; often used loosely to mean “having two methyl groups.”","zh":"（化学）指含有两个甲基（–CH₃）的化合物或结构单元；也常被宽泛地用来表示“带有两个甲基”。"},"examples":[{"en":"This fragrance molecule has a bimethyl substitution pattern, which changes its smell.","zh":"这种香料分子带有“双甲基”取代方式，会改变它的气味。"},{"en":"Adding a bimethyl group can increase a compound’s hydrophobicity.","zh":"引入两个甲基往往会提高化合物的疏水性。"}]},{"partOfSpeech":"adj.","definition":{"en":"(chemistry, describing form) Containing two methyl groups.","zh":"（化学，用于描述结构）含有两个甲基的。"},"examples":[{"en":"The bimethyl derivative was more stable at room temperature.","zh":"这种含双甲基的衍生物在室温下更稳定。"}]}],"synonyms":["dimethyl (more common)"],"phonetic":"/baɪˈmɛθəl/","extraExplanation":["“bimethyl(s)”在日常英语里非常少见，更常见的写法是 **dimethyl**（二甲基），尤其当两个甲基连在同一个中心或作为命名片段（如 dimethyl ether，二甲醚）时。","如果你是在读化学命名：**di-** 是IUPAC命名里最常用的“二-”前缀；**bi-** 在现代系统命名中更常用于表示“两次/两个单位/双重”，不如 di- 常用。你可以告诉我原句或化学式，我能帮你判断应该是 bimethyl 还是 dimethyl。"]}
{"word":"bimillenary","summary":{"en":"Bimillenary means connected to a 2,000th anniversary (or a 2,000-year period), and it can also mean the celebration itself.","zh":"bimillenary 指与“两千周年纪念”（或两千年时期）有关，也可指“两千周年庆典”本身。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Adjective) Relating to the 2,000th anniversary of an event, or to a period of 2,000 years.","zh":"（形容词）与某事件的两千周年纪念有关的；或与两千年这一时期有关的。"},"examples":[{"en":"The city held a bimillenary festival to mark its founding 2,000 years ago.","zh":"这座城市举办了两千周年纪念节庆，纪念其两千年前建城。"},{"en":"A special exhibit was created for the bimillenary celebrations.","zh":"为两千周年纪念活动特别策划了一个展览。"}]},{"partOfSpeech":"n.","definition":{"en":"(Noun) A 2,000th anniversary celebration or event.","zh":"（名词）两千周年纪念（活动）；两千周年庆典。"},"examples":[{"en":"The bimillenary drew visitors from all over the country.","zh":"两千周年庆典吸引了全国各地的游客。"}]}],"synonyms":["bimillennial","two-thousandth anniversary","bicentenary (different: 200th)"],"phonetic":"/baɪˈmɪlənɛri/","extraExplanation":["“bimillenary”来自拉丁语构词：bi-（两）+ millenarius（千年的）。在英式英语中较常见；美式英语里更常见的对应词是“bimillennial”。","它通常用于历史、宗教或城市建城纪念等场合，语气较正式、书面。"]}
{"word":"bimillenial","summary":{"en":"Bimillennial means “related to 2,000 years” or “a 2,000th anniversary.”","zh":"bimillennial 指“与两千年有关”或“二千周年纪念”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Lasting for or relating to 2,000 years; also, marking a 2,000th anniversary.","zh":"持续两千年的；与两千年有关的；也指“两千周年纪念”的。"},"examples":[{"en":"The city held a bimillennial celebration to mark 2,000 years of history.","zh":"这座城市举办了两千周年庆典，纪念两千年的历史。"},{"en":"Scholars discussed the bimillennial influence of the Roman Empire on Europe.","zh":"学者们讨论了罗马帝国对欧洲持续两千年的影响。"}]}],"synonyms":["two-thousand-year","two-millennia","two-millennial (rare)"],"phonetic":"/ˌbaɪmɪˈlɛniəl/","extraExplanation":["你写的 **bimillenial** 常见为拼写错误；标准拼写通常是 **bimillennial**（两个 n）。","词源上：**bi-** 表示“二、两倍”，**millennial** 与 “thousand（千）/ millennium（千年）”有关，所以合起来就是“二千年/两千周年”。","用法提示：谈“200周年”一般用 **bicentennial**；谈“1000周年”用 **millennial** 或 **millennium anniversary**；谈“2000周年”才用 **bimillennial**。"]}
{"word":"bimillenium","summary":{"en":"Bimillenium means a span of 2,000 years or a 2,000th anniversary; the more standard spelling is bimillennium.","zh":"bimillenium 指两千年的时期或两千周年；更规范的拼写通常是 bimillennium。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A period of 2,000 years; the 2,000th anniversary of an event (also written as “bimillennium”).","zh":"两千年（的时期）；（某事件的）两千周年（也可写作 bimillennium）。"},"examples":[{"en":"The city held special events to celebrate its bimillennium.","zh":"这座城市举办特别活动来庆祝建城两千周年。"},{"en":"Archaeologists study changes across a bimillennium to understand long-term history.","zh":"考古学家研究跨越两千年的变化，以理解长期历史。"}]}],"synonyms":["bimillennium","two millennia","two-thousand-year period"],"phonetic":"/ˌbaɪmɪˈlɛniəm/","extraExplanation":["“bimillenium” 常被视为拼写变体或拼写错误，更常见、较规范的拼写是 “bimillennium”（双写 n）。","构词：bi- 表示“二、两”，millennium 表示“一千年”。因此字面意思就是“两个千年”。"]}
{"word":"bimillennia","summary":{"en":"“Bimillennia” means two millennia (2,000 years). It’s uncommon in everyday English.","zh":"“bimillennia”指“两个千年（两千年）”，日常英语中不太常用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"two millennia; a period of 2,000 years (plural form).","zh":"两个千年；两千年的时期（复数形式）。"},"examples":[{"en":"The city’s history spans bimillennia, from ancient temples to modern skyscrapers.","zh":"这座城市的历史跨越两个千年，从古老的神庙到现代的摩天大楼。"},{"en":"Over bimillennia, the language changed slowly but kept its core sounds.","zh":"在两个千年的时间里，这种语言缓慢演变，但仍保留了核心语音。"}]}],"synonyms":["two millennia","a period of two millennia","two thousand years"],"phonetic":"/ˌbaɪmɪˈlɛniə/","extraExplanation":["“bimillennia”由前缀 bi-（两、双）+ millennia（millennium 的复数，意为“千年”）构成，但在现代英语中相对少见。更常见的表达是 two millennia（两个千年）或 a period of two millennia（长达两千年的时期）。","相关词：bimillennial（形容词，“两千年的/两千周年的”），bimillennium（名词，“两千年”）。"]}
{"word":"bimillennial","summary":{"en":"Bimillennial means related to 2,000 years—either a 2,000-year cycle or a 2,000th anniversary.","zh":"bimillennial 指与两千年有关：可以是“两千年一次/两千年周期”，也可以指“两千周年纪念”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening once every 2,000 years, or relating to a 2,000-year period.","zh":"每两千年发生一次的；与两千年周期有关的。"},"examples":[{"en":"Astronomers discussed a bimillennial cycle in historical climate records.","zh":"天文学家讨论了历史气候记录中的一个“两千年周期”。"},{"en":"Some traditions tell stories of a bimillennial return of a great comet.","zh":"有些传统故事讲述一颗大彗星每两千年回归一次。"}]},{"partOfSpeech":"adj.","definition":{"en":"Marking or celebrating a 2,000th anniversary.","zh":"两千周年的；庆祝两千周年纪念的。"},"examples":[{"en":"The city planned a bimillennial celebration of its founding.","zh":"这座城市筹划举办建城两千周年庆典。"},{"en":"A special exhibition was created for the bimillennial year.","zh":"为两千周年纪念之年策划了一场特别展览。"}]}],"synonyms":["two-thousand-year","two-millennia","2,000-year (adj.)","bicmillennial (rare variant)"],"phonetic":"/ˌbaɪmɪˈlɛniəl/","extraExplanation":["“bimillennial”由前缀 bi-（二、双、每两）+ millennial（千年的）构成。需要注意：英语里 bi- 有时表示“每两……一次”（如 biennial 每两年一次），也常表示“两个/双重”（如 bilingual 双语的）。因此在阅读时要结合语境判断是“每两千年一次”还是“二千周年/两千年的”。","相比更常见的词：用于“二千周年纪念”时，英语里也常见 “bicentennial（两百周年）/ millennial（千年纪念）”，而 “bimillennial”较少见，多用于正式或学术语境。"]}
{"word":"bimillennium","summary":{"en":"Bimillennium means a span of 2,000 years or the 2,000th anniversary of something.","zh":"bimillennium 指“两千年”的时间跨度，或“某事物的两千周年纪念”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a period of 2,000 years","zh":"两千年（一个持续两千年的时间段）"},"examples":[{"en":"The historian studied social changes across a bimillennium.","zh":"这位历史学家研究了跨越两千年的社会变迁。"},{"en":"Over a bimillennium, languages can change dramatically.","zh":"在两千年的时间里，语言可能会发生巨大的变化。"}]},{"partOfSpeech":"n.","definition":{"en":"the 2,000th anniversary of an event (a celebration marking 2,000 years)","zh":"两千周年纪念（纪念某事件发生满两千年）"},"examples":[{"en":"The city prepared exhibitions for the bimillennium of its founding.","zh":"这座城市为建城两千周年准备了展览。"},{"en":"A special ceremony was held to mark the bimillennium of the temple.","zh":"人们举行了特别仪式来纪念这座寺庙两千周年。"}]}],"synonyms":["two thousand years","2,000-year period","2,000th anniversary","two-millennia span"],"phonetic":"ˌbaɪmɪˈlɛniəm","extraExplanation":["“bi-”表示“二、两”，而“millennium”表示“一千年”，因此“bimillennium”字面意思就是“两千年”。在日常英语里更常见的说法通常是“two thousand years”或“the 2,000th anniversary”。","相关词：bimillennial（形容词，表示“（两千周年的）/（两千年的）”），例如：a bimillennial celebration（两千周年庆典）。"]}
{"word":"bimillenniums","summary":{"en":"“Bimillenniums” means multiple 2,000-year periods or (rarely) multiple 2,000-year anniversaries.","zh":"“bimillenniums”指多个“两千年时期”，或（较少见）多个“两千周年纪念”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “bimillennium”: periods of 2,000 years; also used for 2,000-year anniversaries (rare).","zh":"“bimillennium”的复数：两千年的时间段；也可指“两千周年纪念”（较少见）。"},"examples":[{"en":"Archaeologists compared climate records across several bimillenniums.","zh":"考古学家比较了跨越数个两千年时期的气候记录。"},{"en":"The museum planned events marking the bimillenniums of several ancient cities.","zh":"博物馆筹划了活动，以纪念几座古城的两千周年。"}]}],"synonyms":["two millennia","2,000-year periods","bimillennia"],"phonetic":"/ˌbaɪmɪˈlɛniəm/","extraExplanation":["构词：bi- 表示“二、两倍”，millennium 表示“一千年”，合起来 bimillennium = “两千年 / 两千周年”。","复数有两种：规则形式 bimillenniums；也常见拉丁式复数 bimillennia（更偏正式或学术语境）。","实际使用中更常见的说法是 “two millennia” 或 “2,000 years”；bimillennium/bimillenniums 比较少见。"]}
{"word":"bimillionaire","summary":{"en":"A bimillionaire is someone with at least two million in wealth, though the term is informal and not very common.","zh":"bimillionaire 指拥有至少两百万财富的人，但属于较口语、并不常见的说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who has (at least) two million dollars or pounds, especially in assets (wealth).","zh":"拥有（至少）两百万美元或英镑的人，尤指以资产形式拥有的财富。"},"examples":[{"en":"After selling her small company, she became a bimillionaire and started investing in local schools.","zh":"卖掉她的小公司后，她成了“bimillionaire（两百万富翁）”，并开始投资当地学校。"},{"en":"He’s not a billionaire—just a bimillionaire with a few successful properties.","zh":"他不是亿万富翁——只是一个靠几处成功房产积累起来的“两百万富翁”。"}]}],"synonyms":["multi-millionaire","two-millionaire","person worth two million"],"phonetic":"/ˌbaɪˌmɪl.jəˈnɛr/","extraExplanation":["“bimillionaire”不是非常常见或正式的词，更常见的说法是“multi-millionaire（千万/百万富翁，泛指拥有数百万资产的人）”或直接说“a two-millionaire / someone worth two million（身家两百万的人）”。","前缀“bi-”通常表示“二、双、两次”（如 bilingual 双语的；bicycle 自行车），所以“bi-millionaire”可以理解为“两个百万（= 两百万）级别的富翁”。实际使用中有时也会被用来强调“刚进入富人圈、但还远不到 billionaire 的程度”。"]}
{"word":"bimilllennia","summary":{"en":"“Bimillennia” means multiple periods of two thousand years (plural of “bimillennium”).","zh":"“bimillennia”指多个“两千年的时期”，是“bimillennium”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) periods of two thousand years; the plural of “bimillennium.”","zh":"（复数名词）两千年的时期；“bimillennium（两千年期）”的复数形式。"},"examples":[{"en":"Over the course of several bimillennia, the language changed dramatically.","zh":"在数个两千年期的时间里，这种语言发生了巨大的变化。"},{"en":"Archaeologists compare climate records across bimillennia to spot long-term patterns.","zh":"考古学家会对比跨越数个两千年期的气候记录，以发现长期规律。"}]}],"synonyms":["two millennia","two thousand years"],"phonetic":"/ˌbaɪməˈlɛniə/","extraExplanation":["你输入的 **bimilllennia** 里有多余的字母 **l**；常见拼写是 **bimillennia**。","这个词比较少见，多用于学术或历史写作；日常英语里更常说 **two thousand years** 或 **two millennia**。","相关词：**bimillennium**（单数，两千年期）；**bimillennial**（形容词，“两千年的/两千周年的”）。"]}
{"word":"Bimini","summary":{"en":"Bimini is a small island chain in the Bahamas, often mentioned as a tropical getaway and sometimes used in culture to evoke a mysterious island vibe.","zh":"Bimini 指巴哈马的比米尼群岛；在英语里常被当作热带度假地名，也有时在文化作品中用来营造神秘海岛的氛围。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small chain of islands in the Bahamas, located west of Miami, Florida (often called North Bimini and South Bimini).","zh":"比米尼群岛（巴哈马的一串小岛，位于美国佛罗里达州迈阿密以西，常分为“北比米尼”和“南比米尼”）。"},"examples":[{"en":"We took a day trip from Miami to Bimini by ferry.","zh":"我们从迈阿密坐渡轮去比米尼进行了一日游。"},{"en":"Bimini is known for clear water and good snorkeling.","zh":"比米尼以清澈海水和很棒的浮潜闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"a name used in stories and popular culture to suggest a remote, tropical, or mysterious island destination.","zh":"（在故事或流行文化中）用来暗示遥远、热带或带有神秘色彩的岛屿目的地的名称。"},"examples":[{"en":"The novel mentions Bimini as a place to escape and start over.","zh":"小说里提到比米尼，作为逃离现实、重新开始的地方。"}]}],"synonyms":["(as a place) the Bahamas","tropical island getaway"],"phonetic":"ˈbɪməni","extraExplanation":["“Bimini”常与海洋探险传说联系在一起：西班牙探险者的故事里，它有时被说成与“青春之泉”（Fountain of Youth）的传闻相关，但这更多是历史传说与想象，并非确凿事实。","文学与文化上，作家海明威（Ernest Hemingway）曾在比米尼附近活动和钓鱼，因此在一些英语语境里，Bimini也会带有“海钓、海风、度假与冒险”的联想。","旅行语境中你可能会看到“Bimini Road”（比米尼路）等说法，指当地近海的石块结构，引发过一些猜测与讨论；日常交流里通常仍把Bimini当作地名来使用。"]}
{"word":"bimini","summary":{"en":"Bimini usually refers to a small island group in the Bahamas; in boating it can also mean a “Bimini top,” a folding canvas sunshade on a boat.","zh":"Bimini通常指巴哈马的比米尼群岛；在船艇语境中也可指“Bimini top”，即船上的可折叠帆布遮阳棚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small group of islands in the Bahamas (often called “North Bimini” and “South Bimini”), known for fishing and tourism","zh":"巴哈马的比米尼群岛（常分为“北比米尼”和“南比米尼”），以钓鱼和旅游闻名"},"examples":[{"en":"We took a ferry from Florida to Bimini for a weekend trip.","zh":"我们从佛罗里达坐渡轮去比米尼度周末。"},{"en":"Bimini is famous for its clear water and sport fishing.","zh":"比米尼以清澈海水和运动钓鱼闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"(in boating) a folding canvas sunshade/roof over a boat cockpit, short for “Bimini top”","zh":"（航海/游艇）驾驶舱上方可折叠的帆布遮阳棚（“Bimini top”的简称）"},"examples":[{"en":"It got too hot, so we raised the bimini.","zh":"太热了，所以我们把遮阳棚撑起来了。"},{"en":"The bimini top gives shade without blocking the breeze.","zh":"这种遮阳棚既能遮阴，又不太挡风。"}]}],"synonyms":["Bimini Islands","Bimini top","canopy","sunshade"],"phonetic":"/bɪˈmiːni/","extraExplanation":["“Bimini”作为地名时，常与探险传说联系在一起：有人把它和“青春之泉（Fountain of Youth）”的传说相连，虽然这更多是民间想象而非史实。","文学与文化上，作家欧内斯特·海明威（Ernest Hemingway）曾在比米尼附近海域钓鱼、生活，因此在英语语境里提到Bimini，有时会让人联想到深海钓鱼与海岛生活方式。","“Bimini top”这个用法多见于美式英语的船艇语境；日常对话里单说bimini，通常就指那种可折叠的遮阳棚。"]}
{"word":"Biminis","summary":{"en":"“Biminis” is usually the plural of Bimini: either the Bahamas islands/district, or (in boating) shade tops on boats.","zh":"“Biminis”通常是 Bimini 的复数：要么指巴哈马的比米尼群岛/行政区，要么（航海语境）指船上的遮阳篷（bimini top）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of islands (and a district) in the Bahamas, west of Miami, Florida.","zh":"比米尼群岛（巴哈马的一组岛屿与行政区），位于佛罗里达迈阿密以西。"},"examples":[{"en":"They took a day trip by ferry from Miami to Bimini.","zh":"他们从迈阿密坐渡轮去比米尼一日游。"},{"en":"Bimini is known for clear water and good fishing.","zh":"比米尼以清澈海水和优质钓鱼闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"(boating) A canvas or fabric top that provides shade over a boat’s cockpit; a “bimini top.”","zh":"（航海）遮阳篷：安装在船只驾驶舱上方的帆布/织物顶棚（bimini top）。"},"examples":[{"en":"It got too hot, so we put up the bimini.","zh":"天气太热了，所以我们把遮阳篷支起来。"},{"en":"The boat has a bimini top for sun protection.","zh":"这艘船配有遮阳篷用来防晒。"}]}],"synonyms":["(bimini top) canopy","(bimini top) sunshade"],"phonetic":"ˈbɪmɪni","extraExplanation":["“Bimini”作地名时常见于旅行、航海与钓鱼语境；它距离美国很近，因此在美国文化里常被当作短途海岛目的地提到。","在英语里，小写的 bimini 常指船用遮阳篷（bimini top）。这一用法与地名有关：据说早期这种顶棚的设计/流行与前往比米尼一带的航海活动有关，因此以地名命名。","文学与文化提及：作家海明威（Ernest Hemingway）曾在巴哈马一带活动，“Bimini”也因此偶尔出现在与他相关的航海与钓鱼叙述中。"]}
{"word":"Bimmeler","summary":{"en":"“Bimmeler” is not a standard common English word; it is most likely a variant/misspelling of “bimbler,” meaning someone who wanders around in a relaxed way.","zh":"“Bimmeler”不是常见标准英文词；多半是“bimbler”的变体/误拼，意思是指悠闲闲逛的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/Informal) A person who bimbles; someone who walks or moves in a relaxed, wandering way without a clear目的.","zh":"（罕见／非正式）指“bimbler”：漫无目的、悠闲闲逛的人；做事不紧不慢、随意晃悠的人。"},"examples":[{"en":"He’s a bit of a bimmeler—he’ll wander around the market for hours.","zh":"他有点像个“闲逛的人”——会在市场里晃悠好几个小时。"},{"en":"Tourists often become bimmelers in a new city, exploring side streets at random.","zh":"游客在新城市里常常会变成“随性闲逛的人”，随机探索小巷。"}]},{"partOfSpeech":"other","definition":{"en":"A likely variant spelling or misspelling of “bimbler” (from “bimble”).","zh":"很可能是“bimbler”（源自“bimble”）的变体拼写或拼写错误。"},"examples":[{"en":"I couldn’t find “bimmeler” in the dictionary—did you mean “bimbler”?","zh":"我在词典里找不到“bimmeler”——你是不是想写“bimbler”？"}]}],"synonyms":["wanderer","stroller","loafer","roamer"],"phonetic":"/ˈbɪmblər/","extraExplanation":["“bimble”在英式英语里更常见，意思是“慢悠悠地闲逛/溜达”。“bimbler”指“闲逛的人”。“bimmeler”并不是标准常见拼写；也可能是人名/姓氏（尤其在德语语境中），这种情况下通常不按英文词义解释。","如果你是在某本书、游戏、聊天或特定地区口音里看到“Bimmeler”，告诉我原句/上下文，我可以更准确判断是词义、绰号还是专有名词。"]}
{"word":"bimmeler","summary":{"en":"“Bimmeler” is not a standard spelling; it likely refers to “bimbler,” meaning a person who wanders around in a relaxed, aimless way.","zh":"“bimmeler”不是常见英文拼写；多半指“bimbler”，意思是悠闲、漫无目的地闲逛的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who walks or moves in a relaxed, slightly aimless way; someone who likes to wander without a clear plan.","zh":"悠闲地、漫无目的地走动的人；喜欢随意闲逛的人。"},"examples":[{"en":"He’s a bit of a bimbler—he’ll wander around the neighborhood for hours.","zh":"他有点像个爱闲逛的人——会在社区里晃上好几个小时。"},{"en":"Tourists often become bimblers in a new city, stopping wherever something looks interesting.","zh":"游客在陌生城市里常常就成了“闲逛的人”，看到有趣的东西就停下来。"}]}],"synonyms":["wanderer","stroller","roamer","loafer"],"phonetic":"/ˈbɪmbəlɚ/","extraExplanation":["“bimmeler”不是常见标准英文拼写。你可能想写的是 **bimbler**（名词）或 **bimble**（动词，意为“闲逛、溜达”）。","这个词更偏英式英语、语气比较轻松口语化；在正式写作里通常用 “wander / stroll / meander” 更常见。"]}
{"word":"Bimmer","summary":{"en":"“Bimmer” is an informal American English nickname for a BMW car.","zh":"“Bimmer”是美式英语里对宝马（BMW）汽车的非正式昵称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a BMW car (an informal nickname; common in American English)","zh":"宝马（BMW）汽车（非正式昵称；美式英语中常见）"},"examples":[{"en":"He just bought a new Bimmer and won’t stop talking about it.","zh":"他刚买了一辆新宝马，聊个不停。"},{"en":"A black Bimmer pulled up in front of the restaurant.","zh":"一辆黑色宝马停在了餐厅门口。"}]}],"synonyms":["BMW","Beemer","Beamer"],"phonetic":"ˈbɪmɚ","extraExplanation":["“Bimmer”主要指BMW汽车；在车迷圈里也常用“Beemer/Beamer”，但较讲究的用法会区分：Bimmer=汽车，Beemer/Beamer=摩托车（BMW motorcycle）。不过日常口语里很多人不严格区分。","这是美国文化里常见的车类昵称，语气偏口语、亲切或带一点炫耀意味；正式写作一般直接写“BMW”。","相关表达：BMW（正式）、a BMW sedan/SUV（宝马轿车/SUV）、German luxury car（德国豪华车）。"]}
{"word":"bimodal","summary":{"en":"Bimodal means “having two distinct modes or peaks,” or “involving two methods/systems (often two transport modes).”","zh":"bimodal 指“有两种明显模式/两个峰值的（双峰）”，也可指“结合两种方法/系统的（常见于两种交通方式）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having or involving two distinct modes, forms, or peaks (often used in statistics to describe a distribution with two peaks)","zh":"具有或涉及两种不同的模式/形态/峰值的（统计中常指“双峰分布”）"},"examples":[{"en":"The test scores were bimodal, with one group scoring very high and another scoring very low.","zh":"这次考试成绩呈双峰分布：一组分数很高，另一组分数很低。"},{"en":"A bimodal distribution can suggest that the data come from two different populations.","zh":"双峰分布可能意味着数据来自两个不同的人群。"}]},{"partOfSpeech":"adj.","definition":{"en":"using or combining two different methods or systems, especially two forms of transportation","zh":"使用或结合两种不同方法或系统的，尤指两种交通方式的（如“陆空联运/铁海联运”）"},"examples":[{"en":"We planned a bimodal trip: train to the city, then a flight overseas.","zh":"我们计划了一次双模式出行：先坐火车进城，再乘飞机出国。"},{"en":"Some companies offer bimodal freight services, combining rail and trucking.","zh":"一些公司提供双模式货运服务，把铁路运输和卡车运输结合起来。"}]}],"synonyms":["two-peaked","dual-mode","two-mode","twofold"],"phonetic":"/baɪˈmoʊdəl/","extraExplanation":["“bimodal”由 bi-（二、双）+ modal（模式的）构成。最常见的语境是统计学：bimodal distribution（双峰分布）。看到“双峰”，可以联想到图上有两个“山峰”。","在日常非学术语境中，它也可指“结合两种方式/渠道”，比如交通（train + plane）或沟通方式（online + in-person）。"]}
{"word":"bimodality","summary":{"en":"Bimodality means a data distribution has two main peaks (two common values).","zh":"bimodality 指数据分布呈双峰：有两个主要峰值/两个常见取值。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The condition of having two main peaks or two common values in a distribution of data (a “two-peaked” pattern).","zh":"（数据分布的）双峰性；指一个分布中出现两个主要峰值或两个最常见的取值（“两个峰”）。"},"examples":[{"en":"The histogram shows bimodality, with one peak around age 20 and another around age 60.","zh":"这张直方图呈现双峰性：一个峰在20岁左右，另一个峰在60岁左右。"},{"en":"Bimodality often suggests the data may contain two different groups mixed together.","zh":"双峰性通常暗示数据里可能混合了两个不同群体。"}]}],"synonyms":["two-peaked distribution","bimodal distribution"],"phonetic":"/ˌbaɪmoʊˈdæləti/","extraExplanation":["在统计学里，出现双峰常见原因是“总体里有两个亚群”（例如男女、两个地区、两种产品版本）。因此看到双峰时，常会进一步做分组分析或检查数据是否被不同机制生成。","不要把“双峰性”简单理解为“有两个极端值”。它说的是频率/密度图上有两个明显的“峰”，而不是只有两个最大或最小的个别点。"]}
{"word":"bimodule","summary":{"en":"A bimodule is a module with two compatible actions: one from the left by a ring and one from the right by (possibly another) ring.","zh":"bimodule（双模）是同时带有左环作用与右环作用、且两种作用相容的模结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Algebra) A mathematical structure that is a module over two rings, with compatible left and right actions.","zh":"（代数学）一种同时在两个环上构成模的数学结构，具有相容的左作用与右作用。"},"examples":[{"en":"In abstract algebra, a bimodule can be viewed as a module that carries both a left and a right ring action.","zh":"在抽象代数中，bimodule 可以看作同时带有左环作用和右环作用的模。"},{"en":"Let R and S be rings; an (R,S)-bimodule has a left R-action and a right S-action that work well together.","zh":"设 R 与 S 是两个环；（R,S）-bimodule 具有左 R-作用与右 S-作用，并且两者彼此相容。"}]}],"synonyms":["(R,S)-bimodule","two-sided module","bimodule (algebra)"],"phonetic":"/ˌbaɪˈmɑːdʒuːl/","extraExplanation":["“bimodule”常写作“(R,S)-bimodule”，用来强调它左边是 R-模、右边是 S-模。相容性通常指 (r·m)·s = r·(m·s)（r∈R, s∈S, m∈M）。","在数学文本里它常用于研究环同态、张量积、Morita 等价等主题；如果两边的环相同（R= S），也可称为“R-bimodule”。"]}
{"word":"bimodulus","summary":{"en":"Bimodulus refers to having two different modulus values, most commonly different stiffness in tension vs. compression.","zh":"bimodulus 指具有两个不同的模量，最常见是材料在受拉与受压时刚度（弹性模量）不同。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a material property where the elastic modulus (stiffness) is different in tension and compression (i.e., the material is stiffer one way than the other).","zh":"（材料力学）双模量：指材料在受拉与受压时的弹性模量（刚度）不同，即“拉压刚度不一样”的性质。"},"examples":[{"en":"Some composites show bimodulus behavior: they are stiffer in tension than in compression.","zh":"一些复合材料表现出双模量行为：它们在受拉时比受压时更硬（更不易变形）。"},{"en":"Engineers may use a bimodulus model to predict bending more accurately.","zh":"工程师可能会用双模量模型来更准确地预测构件的弯曲变形。"}]},{"partOfSpeech":"n.","definition":{"en":"(more general) a system or model involving two distinct moduli (two different modulus values) used for analysis.","zh":"（更广义）含有两个不同“模量”取值的系统或模型，用于分析与计算。"},"examples":[{"en":"The paper proposes a bimodulus approach for materials with asymmetric stress–strain response.","zh":"论文提出了一种双模量方法，用于应力—应变响应不对称的材料。"}]}],"synonyms":["bi-modulus","bimodular behavior","two-modulus model"],"phonetic":"/ˌbaɪˈmɑːdjələs/","extraExplanation":["“modulus”常指弹性模量（如杨氏模量 Young’s modulus），表示材料抵抗弹性变形的能力。许多理想材料拉压模量相同，但某些材料（例如部分复合材料、混凝土、含微裂纹或孔隙的材料等）可能出现拉压刚度不同，于是用“bimodulus（双模量）”来描述和建模。","拼写上也常见连字符形式：bi-modulus；相关形容词常写作“bimodular / bi-modular”（双模量的）。"]}
{"word":"bimolecular","summary":{"en":"Bimolecular describes a process—especially a reaction step—that involves two molecules reacting together.","zh":"bimolecular 指（尤指反应步骤）由两个分子共同参与或相互反应。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Involving two molecules, especially describing a chemical reaction or step where two molecules collide or react together.","zh":"涉及两个分子；尤指化学反应或反应步骤中两个分子相互碰撞或共同参与反应。"},"examples":[{"en":"A bimolecular reaction rate depends on the concentrations of two reactants.","zh":"双分子反应的速率取决于两种反应物的浓度。"},{"en":"The key bimolecular step is when the two molecules meet and form a new bond.","zh":"关键的双分子步骤是两个分子相遇并形成新键的时候。"}]}],"synonyms":["two-molecule","second-order (often, in kinetics)"],"phonetic":"/ˌbaɪməˈlɛkjələr/","extraExplanation":["在化学动力学里，bimolecular 常对应“二级反应（second-order reaction）”的某一步：速率常写成 rate = k[A][B]（或 2A 的情况写成 k[A]^2）。它强调的是“分子数（molecularity）=2”，这是机理中的一步；而“反应级数（order）”是从实验速率方程得到的，二者相关但不完全等同。","词源上 bi- 表示“二、两个”，molecular 来自 molecule（分子）。在科学写作中常见搭配：bimolecular reaction / bimolecular collision / bimolecular rate constant。"]}
{"word":"bimolecularity","summary":{"en":"Bimolecularity means an elementary reaction step involves two reactant particles colliding to react.","zh":"bimolecularity 指一个基元反应步骤中有两个反应粒子参与并发生反应。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) The number of reactant particles (molecules, ions, or atoms) that take part in a single elementary reaction step—typically two.","zh":"（化学）在一个基元反应步骤中参与碰撞并发生反应的反应粒子（分子、离子或原子）的数目——通常为两个。"},"examples":[{"en":"The bimolecularity of this elementary step is 2 because one A molecule reacts with one B molecule.","zh":"这个基元步骤的分子性为2，因为一个A分子与一个B分子反应。"},{"en":"A substitution reaction can be unimolecular or bimolecular depending on its mechanism.","zh":"取代反应的机理不同，分子性可能是一分子或二分子。"}]}],"synonyms":["molecularity (when context is clear)","two-molecule molecularity"],"phonetic":"/ˌbaɪmoʊləˈkjʊlərəti/","extraExplanation":["“分子性（molecularity）”只用于描述“基元反应步骤”（elementary step），而不是整体反应方程。整体反应往往由多个基元步骤组成。","不要把 bimolecularity（分子性）和 reaction order（反应级数）混为一谈：级数来自速率方程的实验或推导形式；对于基元步骤，分子性常与速率方程中的级数一致，但对非基元（复杂）反应并不一定一致。","常见对应：unimolecularity（一分子性，单粒子参与）、bimolecularity（二分子性，两粒子参与）、termolecularity（三分子性，三粒子参与，较少见）。"]}
{"word":"bimolecularly","summary":{"en":"“Bimolecularly” means “in a two-molecule way,” especially describing reactions involving two reacting species.","zh":"“bimolecularly”意为“以双分子方式”，常指涉及两个反应粒子参与的反应过程。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that involves two molecules or two reacting species, especially in describing a chemical reaction mechanism or rate law.","zh":"以“双分子”的方式；涉及两个分子（或两种反应粒子）参与的方式，尤用于描述化学反应机理或速率方程。"},"examples":[{"en":"The reaction proceeds bimolecularly, so the rate depends on the concentrations of both reactants.","zh":"该反应以双分子方式进行，因此速率取决于两种反应物的浓度。"},{"en":"In solution, these radicals can combine bimolecularly to form a more stable product.","zh":"在溶液中，这些自由基可以以双分子方式结合，生成更稳定的产物。"}]}],"synonyms":["by a bimolecular mechanism","in a bimolecular manner","second-order (in kinetics context)"],"phonetic":"/ˌbaɪmoʊˈlɛkjələrli/","extraExplanation":["“bimolecularly”常见于化学动力学/物理化学语境，对应“bimolecular（双分子）”过程。典型特征是需要两个粒子相遇并发生反应，因此速率常与两者浓度的乘积相关（例如二级反应：rate = k[A][B]，或 2A 时 rate = k[A]^2）。"]}
{"word":"bimong","summary":{"en":"“Bimong” isn’t a standard English vocabulary word; it’s usually a name/username, so the meaning depends on context.","zh":"“bimong”不是标准英语词汇；多见于人名/用户名，含义需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most commonly seen as a personal name or nickname (a proper noun), and its meaning depends on the person or culture using it.","zh":"不是标准英语词汇。最常见是作为人名或昵称（专有名词）出现，含义取决于使用者的文化与个人背景。"},"examples":[{"en":"Bimong is my cousin’s nickname.","zh":"Bimong 是我表兄的昵称。"},{"en":"I saw the username “bimong” in the game chat.","zh":"我在游戏聊天里看到用户名“bimong”。"}]}],"phonetic":"/ˈbiːmɔŋ/","extraExplanation":["“bimong”在常见英英词典里通常查不到，因此很可能是：①人名/昵称；②用户名；③某个语言（如菲律宾语等）里的词；④拼写错误。","如果你想查的是英语单词，最接近、也最常被输错的可能是：bemoan（抱怨、哀叹）或 among（在……之中）。你可以告诉我它出现的句子/语境，我可以帮你确认。"]}
{"word":"bimonthlies","summary":{"en":"“Bimonthlies” are things—especially magazines—published or occurring every two months.","zh":"“bimonthlies”常指双月刊等每两个月出版或发生一次的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Publications (such as magazines or newsletters) that come out every two months.","zh":"（复数名词）每两个月出版一次的刊物（如杂志、通讯）。"},"examples":[{"en":"I subscribe to a few bimonthlies about science and travel.","zh":"我订阅了几本关于科学和旅行的双月刊。"},{"en":"The library keeps local bimonthlies near the front desk.","zh":"图书馆把本地的双月刊放在服务台附近。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural noun) Regular events, reports, or payments that happen every two months.","zh":"（复数名词）每两个月发生一次的定期事项（如活动、报告或付款）。"},"examples":[{"en":"The team submits bimonthlies to track progress on the project.","zh":"团队每两个月提交一次报告来跟踪项目进度。"},{"en":"Their bimonthlies include rent support and utility reimbursements.","zh":"他们的双月发放项目包括房租补助和水电报销。"}]}],"synonyms":["bi-monthly magazines","every-two-month publications","bimonthly issues","periodicals"],"phonetic":"/ˌbaɪˈmʌnθliz/","extraExplanation":["“bimonthly”在英语里有时会引起歧义：既可能表示“每两个月一次”，也可能被用来表示“每月两次”。在出版物语境中（如bimonthly magazine），通常理解为“每两个月一期”。如果需要更清晰，可以用 every two months（每两个月一次）或 twice a month（每月两次）来避免误会。"]}
{"word":"bimonthly","summary":{"en":"Bimonthly can mean either “every two months” or “twice a month,” so context matters.","zh":"bimonthly 既可表示“每两个月一次”，也可表示“每月两次”，需要看上下文。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening every two months.","zh":"每两个月发生一次（每隔两个月一次）。"},"examples":[{"en":"We have a bimonthly team meeting to review progress.","zh":"我们每两个月开一次团队会议来回顾进度。"},{"en":"The dentist sends bimonthly reminders for checkups.","zh":"牙医会每两个月发送一次检查提醒。"}]},{"partOfSpeech":"adj.","definition":{"en":"Happening twice a month.","zh":"一个月发生两次（每月两次）。"},"examples":[{"en":"She gets paid bimonthly, on the 1st and 15th.","zh":"她按每月两次领薪水，在1号和15号。"},{"en":"The newsletter is bimonthly, so we publish two issues each month.","zh":"这份简报是每月两次，因此我们每个月发布两期。"}]},{"partOfSpeech":"n.","definition":{"en":"A publication or event that occurs bimonthly (either every two months or twice a month, depending on context).","zh":"双月刊/双月活动（频率可能指每两个月一次或每月两次，取决于语境）。"},"examples":[{"en":"I write for a bimonthly that covers local art.","zh":"我为一本报道本地艺术的双月刊写稿。"}]}],"synonyms":["every two months","twice a month"],"phonetic":"/ˌbaɪˈmʌnθli/","extraExplanation":["bimonthly 在英语里有两个常见含义：①每两个月一次；②每月两次，所以在工作、薪资、出版等场景里容易产生歧义。为了更清楚，很多人会改用 every two months（每两个月一次）或 twice a month（每月两次）。","类似的歧义也出现在 biweekly（每两周一次/每周两次）上；而 semi- 通常更明确：semiweekly = 每周两次，semimonthly = 每月两次。"]}
{"word":"bimorph","summary":{"en":"Bimorph refers to something (often an organism or population) that has two distinct forms, or to an organism/type that is one of those two forms.","zh":"bimorph 指（常见于生物学）具有两种明显不同形态的事物，或指二型现象中两种形态之一的个体/类型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An organism (or a form within a species) that occurs in two distinct shapes or types (two “morphs”).","zh":"（生物学）二型个体；在同一物种中以两种明显不同形态/类型出现的个体（或其中一种形态）。"},"examples":[{"en":"In this insect species, the female is a bimorph: some females have wings and others do not.","zh":"在这种昆虫中，雌虫是二型的：有的雌虫有翅，有的没有。"},{"en":"Researchers compared the survival of each bimorph in different habitats.","zh":"研究人员比较了两种形态个体在不同栖息地的存活率。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having two distinct forms or types; bimorphic.","zh":"二型的；具有两种明显不同形态/类型的。"},"examples":[{"en":"The population shows a bimorph pattern of coloration.","zh":"该种群的体色呈现二型模式。"},{"en":"They described a bimorph distribution of body size in the group.","zh":"他们描述了该群体体型大小的二型分布。"}]}],"synonyms":["bimorphic","dimorphic (close in meaning)","two-form"],"phonetic":"ˈbaɪmɔrf","extraExplanation":["词源拆解：bi- 表示“二、双”，-morph 来自希腊语 morphē（形态、形状）。因此 bimorph 字面意思就是“二种形态”。","学术语境里更常见的相关词是 bimorphism / bimorphic（性状的二型现象/二型的），而 bimorph 常用来指“其中一种形态的个体/类型”。"]}
{"word":"bimorphemic","summary":{"en":"Bimorphemic describes a word formed from exactly two morphemes (meaningful parts).","zh":"bimorphemic 指由恰好两个语素（有意义的构词部分）组成的词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(In linguistics) made up of two morphemes (two meaningful parts), such as a root plus a prefix/suffix.","zh":"（语言学）由两个语素（两个有意义的构词成分）组成的，例如“词根 + 前/后缀”。"},"examples":[{"en":"The word “unhappy” is bimorphemic: un- + happy.","zh":"“unhappy（不开心的）”是双语素词：un- + happy。"},{"en":"Many English past-tense forms are bimorphemic, like “walked” (walk + -ed).","zh":"很多英语过去式形式是双语素的，比如“walked”（walk + -ed）。"}]}],"synonyms":["two-morpheme","composed of two morphemes"],"phonetic":"/ˌbaɪmɔrˈfiːmɪk/","extraExplanation":["“morpheme（语素）”是语言中最小的“有意义单位”。bimorphemic 强调“正好两个语素”。例如：replay = re-（再次）+ play（玩/播放）。","它常用于形态学（morphology）的分析与教学：把词拆成有意义的部分，能帮助理解词义、词性变化与拼写规律。","对比：monomorphemic（单语素，如 dog, green）；polymorphemic（多语素，如 un-help-ful-ness）。"]}
{"word":"bimorphic","summary":{"en":"Bimorphic means “having two distinct forms or shapes.”","zh":"bimorphic 意为“具有两种不同形态或形式的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two distinct forms or shapes (often used in biology, geology, or materials science).","zh":"具有两种不同形态或形式的（常用于生物学、地质学或材料科学）。"},"examples":[{"en":"Some insects are bimorphic, with males and females that look very different.","zh":"有些昆虫具有两型性，雄虫和雌虫外形差异很大。"},{"en":"The researcher described a bimorphic crystal structure under different temperatures.","zh":"研究人员描述了该晶体结构在不同温度下呈现两种形态。"}]}],"synonyms":["two-formed","dimorphic","two-phase"],"phonetic":"/baɪˈmɔr.fɪk/","extraExplanation":["词源上，bi- 表示“二、两个”，morph 来自希腊语，和“形态/形状”有关，因此 bimorphic 直观意思就是“有两种形态的”。","在学术写作中，bimorphic 和 dimorphic（两型的）含义接近；dimorphic 在生物学里更常见，而 bimorphic 也常见于材料、晶体或结构“有两种形态/相”的语境。"]}
{"word":"bimorphs","summary":{"en":"Bimorphs are two distinct forms of the same species or organism.","zh":"bimorphs 指同一物种/生物的两种不同形态（双型）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Two different forms (morphs) of the same species or organism, often seen as a kind of polymorphism (for example, two color forms or two castes).","zh":"（同一种物种/生物的）两种不同形态（形态型），常见于多态现象中（例如两种颜色型、两种阶级型）。"},"examples":[{"en":"In this insect species, bimorphs appear as a light form and a dark form.","zh":"在这种昆虫中，双型个体表现为浅色型和深色型。"},{"en":"The researchers compared the survival rates of the two bimorphs in different habitats.","zh":"研究人员比较了两种形态型在不同栖息地中的存活率。"}]}],"synonyms":["two forms","dimorphic forms","morphs (in biology)","dimorphs"],"phonetic":"/ˈbaɪmɔːrf/","extraExplanation":["“bimorph(s)”由前缀 bi-（两、双）+ morph（形态）构成，常用于生态学、进化生物学与行为学写作中。","在学术语境里，它常与 “polymorphism（多态）” 一起出现：bimorph 指“恰好两种”形态；polymorphism 更泛指“多种”形态。","日常英语中不常用，非专业场合更可能说 “two forms/types” 来表达。"]}
{"word":"bimotor","summary":{"en":"“Bimotor” describes something (especially an aircraft) that has two motors/engines.","zh":"“bimotor”指（尤指飞机等）具有两台马达/发动机的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having or powered by two motors or engines (often used for aircraft, boats, or machines).","zh":"双发动机的；由两台马达/发动机驱动的（常用于飞机、船只或机器）。"},"examples":[{"en":"The company operates a bimotor aircraft for regional flights.","zh":"这家公司使用一架双发动机飞机执行区域航班。"},{"en":"A bimotor boat can handle stronger currents more reliably.","zh":"双发动机船通常能更可靠地应对更强的水流。"}]}],"synonyms":["twin-engine","twin-motor","two-engine"],"phonetic":"/baɪˈmoʊtɚ/","extraExplanation":["“bi-”表示“二、双”，如 bilingual（双语的）、bicycle（自行车）。 “motor”指“发动机/马达”。因此 bimotor 字面意思就是“两个发动机/马达的”。","在航空语境里，bimotor 常用于较正式或技术性的表述，日常英语更常说 twin-engine（双发的）。"]}
{"word":"bimotored","summary":{"en":"“Bimotored” means “having two engines,” especially referring to an aircraft.","zh":"“bimotored”意为“有两台发动机的”，尤指飞机。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two engines (especially of an aircraft or vehicle).","zh":"（尤指飞机或车辆）有两台发动机的；双发动机的。"},"examples":[{"en":"A bimotored plane can keep flying even if one engine fails (depending on the situation).","zh":"双发动机飞机在一台发动机失效时（视情况而定）仍可能继续飞行。"},{"en":"They chartered a bimotored aircraft to reach the island quickly.","zh":"他们包了一架双发动机飞机，迅速抵达那座岛。"}]}],"synonyms":["twin-engine","two-engine","twin-motor"],"phonetic":"/ˌbaɪˈmoʊtərd/","extraExplanation":["“bi-”表示“两个/双”，常见于bilingual（双语的）、bicycle（自行车，两个轮子）等词。","在航空语境中，更常见、更口语的说法是“twin-engine”。“bimotored”偏技术或书面用法，也可能出现在翻译文本中。"]}
{"word":"bimotors","summary":{"en":"“Bimotors” refers to twin‑engine aircraft or describes something that has two engines.","zh":"“bimotors”指双发动机飞机（复数），或形容“有两个发动机/双引擎的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(aviation/technical) Having two engines; twin‑engine.","zh":"（航空/技术）双发动机的；双引擎的。"},"examples":[{"en":"They trained in a bimotors airplane before moving on to jets.","zh":"他们先在双发动机飞机上训练，然后再转到喷气式飞机。"},{"en":"A bimotors design can offer extra safety if one engine fails.","zh":"双发动机设计在一台发动机失效时可能更安全。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) Twin‑engine aircraft; planes with two engines.","zh":"（复数）双发动机飞机；双引擎机型。"},"examples":[{"en":"The museum displays several bimotors from the 1930s.","zh":"博物馆展出了几架20世纪30年代的双发动机飞机。"},{"en":"Smaller bimotors are common in regional air service.","zh":"较小型的双发动机飞机在支线航空服务中很常见。"}]}],"synonyms":["twin-engine","two-engined","twin-motor"],"phonetic":"/ˈbaɪˌmoʊtərz/","extraExplanation":["“bimotors”多见于航空或工程语境，口语里更常说“twin-engine (aircraft)”或“two-engined (aircraft)”。也常写作“bi-motor(s)”，其中前缀“bi-”表示“二/双”。"]}
{"word":"bimucronate","summary":{"en":"A botanical adjective meaning “ending in two tiny sharp points.”","zh":"植物学形容词，表示“末端有两个细小尖刺/尖突”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having two small, sharp points (mucros), often at the tip of a leaf, bract, or other plant part.","zh":"（植物学）具“双小尖刺”的；常指叶片、苞片等顶端有两个小而尖的突起（小尖刺，mucron）。"},"examples":[{"en":"The leaf apex is bimucronate, ending in two tiny sharp tips.","zh":"叶片顶端为双小尖刺状，末端有两个细小尖突。"},{"en":"Under a hand lens, the bracts appear bimucronate rather than smoothly rounded.","zh":"用放大镜观察，苞片看起来是双小尖刺状，而不是光滑的圆形。"}]}],"synonyms":["two-pointed","biapiculate","double-pointed"],"phonetic":"ˌbaɪˈmjuːkrəˌneɪt","extraExplanation":["这个词多见于植物形态描述（如植物志、分类检索表）。bi- 表示“两个”，mucronate 来自 mucro（拉丁语，意为“尖端/尖刺”），所以 bimucronate 强调“有两个小尖刺”，通常是非常细小、需要近看才能确认的特征。","常见相关词：mucronate（单小尖刺）、apiculate（短小尖端，通常不如 mucro 那么“针尖感”）、cuspidate（较长而明显的尖端）。"]}
{"word":"bimuscular","summary":{"en":"“Bimuscular” means involving two muscles (a rare, technical adjective).","zh":"bimuscular 指“涉及两块肌肉/由两块肌肉共同作用的”（较少见、偏专业的形容词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two muscles, or involving two muscles; describing a body part, movement, or structure controlled by two muscles.","zh":"（解剖/生理）具有两块肌肉的；涉及两块肌肉的；指由两块肌肉共同控制的身体部位、动作或结构。"},"examples":[{"en":"In some descriptions, the eyelid may be called bimuscular because more than one muscle helps it move.","zh":"在一些描述中，眼睑可能被称为 bimuscular，因为不止一块肌肉帮助它运动。"},{"en":"The therapist explained that the motion is bimuscular, relying mainly on two specific muscles.","zh":"治疗师解释说，这个动作是 bimuscular 的，主要依靠两块特定的肌肉。"}]}],"synonyms":["two-muscle","involving two muscles","bi-muscular"],"phonetic":"ˌbaɪˈmʌskjələr","extraExplanation":["这个词非常少见，多见于较旧或非常专业的解剖学/生理学文字。日常英语里更常用 two-muscle / involving two muscles，或直接说 “controlled by two muscles”。","构词：bi- 表示 “两个”，muscular 表示 “肌肉的”。因此字面意思就是 “两肌肉的/双肌的”。"]}

