{"word":"bin","summary":{"en":"“Bin” most commonly means a container for trash or storage, and it can also mean to throw something away.","zh":"bin 最常指“垃圾桶/收纳箱”，也可作动词表示“丢弃”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A container used to hold or throw away things (especially trash); also used for storage.","zh":"（尤指）垃圾桶；也可指用来收纳、存放东西的箱/桶。"},"examples":[{"en":"Please put the empty bottle in the bin.","zh":"请把空瓶子丢进垃圾桶。"},{"en":"She keeps toys in a plastic storage bin.","zh":"她把玩具放在一个塑料收纳箱里。"}]},{"partOfSpeech":"vt.","definition":{"en":"To throw something away or put it into a bin; to discard.","zh":"把……扔进垃圾桶；丢弃。"},"examples":[{"en":"He binned the old receipts.","zh":"他把旧收据都丢掉了。"},{"en":"If you don’t need it, just bin it.","zh":"如果你不需要，就把它扔了吧。"}]},{"partOfSpeech":"n.","definition":{"en":"A fixed compartment or section for storing items (for example in a warehouse, library, or on a computer).","zh":"（分格/分区）存放格；（仓库/图书馆/电脑中）用于归类存放的“格/区”。"},"examples":[{"en":"The parts are sorted into bins by size.","zh":"这些零件按大小分到不同的格子里。"},{"en":"The file is in the Recycle Bin.","zh":"这个文件在回收站里。"}]}],"synonyms":["trash can","garbage can","container","storage box","discard","throw away"],"phonetic":"/bɪn/","extraExplanation":["在英式英语里，bin 最常见就是“垃圾桶”（美式更常说 trash can / garbage can）。在美式英语中，bin 常用于“收纳箱/分类存放的格子”，例如 storage bin、parts bin。","文学或日常表达里常见搭配：bin liner（垃圾袋，英式）、wheelie bin（带轮垃圾桶，英式）、Recycling bin（回收桶）。"]}
{"word":"Bina","summary":{"en":"Bina is most commonly used as a given name, often associated with the meaning “understanding/wisdom” in Hebrew tradition.","zh":"Bina 最常见作人名使用；在希伯来语传统中常与“理解力/智慧”这一含义相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (often feminine); in Hebrew tradition it is linked to the idea of “understanding” or “wisdom.”","zh":"人名（多为女性名）；在希伯来语传统中常与“理解力 / 智慧”相关。"},"examples":[{"en":"Bina introduced herself to the class on the first day.","zh":"开学第一天，Bina 向全班做了自我介绍。"},{"en":"I’m meeting Bina for coffee after work.","zh":"下班后我要和 Bina 去喝咖啡。"}]}],"synonyms":["Binah","Beena"],"phonetic":"/ˈbiːnə/","extraExplanation":["“Bina”在不同文化里都可能作为名字出现。它在希伯来语里常被理解为与“理解、洞察”有关（也常见拼写变体 Binah）。","在南亚语境中（如印度），Bina / Beena 也较常见，有时与音乐或乐器意象相关（因地区与拼写不同而有差异）。","如果你指的不是人名，而是缩写、公司名、地名或其他专有词，请告诉我上下文（例如一句话），我可以给出更准确的释义。"]}
{"word":"Binah","summary":{"en":"Binah means “understanding,” especially as a key concept (and a sefirah) in Kabbalah.","zh":"Binah 指“理解／悟性”，尤常用于卡巴拉中的核心概念与“生命之树”的一个 sefira（神性流溢）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Jewish mysticism, especially Kabbalah) “understanding,” often described as deep, reflective insight; also the name of a sefirah (emanation) on the Tree of Life associated with discernment and structure.","zh":"（尤指卡巴拉等犹太神秘主义中）“理解／悟性”，常指深度、反思性的洞察；也指“生命之树”上的一个神性流溢（sefira）——“Binah（理解）”，与分辨力、结构与成形有关。"},"examples":[{"en":"In Kabbalah, Binah is often linked with the ability to analyze and give form to ideas.","zh":"在卡巴拉中，Binah 常与分析能力以及把想法“成形”的能力联系在一起。"},{"en":"Some writers describe wisdom (Chokhmah) as a flash of insight and Binah as understanding that develops it.","zh":"一些作者把“智慧（Chokhmah）”描述为灵光一现，而把 Binah 视为对那份灵感的展开与深化理解。"}]}],"synonyms":["understanding","insight","discernment","comprehension"],"phonetic":"/bəˈnɑː/","extraExplanation":["“Binah”源自希伯来语 בינה‎，字面义为“理解、悟性”。在卡巴拉体系里，它常与“Chokhmah（智慧）”成对出现：前者更像灵感/直觉的火花，后者更像整理、分辨、推演与沉淀后的理解。","在一些英文语境中，Binah 会被当作专有名词使用（如“the sefirah of Binah”），因此常见首字母大写；若只是一般意义的“understanding”，有时也会小写。","发音在英语里并不完全统一：你可能会听到更接近“buh-NAH”的读法，也有人受希伯来语或宗教学圈影响读得更清晰。"]}
{"word":"binal","summary":{"en":"“Binal” is a rare adjective meaning “having two parts” or “related to two.” In modern English, people usually say “binary” or “dual.”","zh":"“binal”是一个很少见的形容词，意思是“由两部分组成/与两个有关”。现代英语通常用“binary”或“dual”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Relating to two things; consisting of two parts; double.","zh":"（罕见）与两个事物有关的；由两部分组成的；双重的。"},"examples":[{"en":"In some older writings, “binal” can mean something made of two parts.","zh":"在一些较早的著作中，“binal”可用来表示“由两部分构成的”。"},{"en":"They described the argument as binal: it had two main points.","zh":"他们把这个论证描述为“binal”的：它有两个要点。"}]}],"synonyms":["binary","dual","twofold","double"],"phonetic":"/ˈbaɪnəl/","extraExplanation":["“binal”在现代英语里非常少见，多数学习者更常遇到的是“binary”（二元的、二进制的）或“dual”（双重的、双的）。如果你是在科技/计算机语境中看到“binal”，很可能是“binary”的拼写错误。","词源上可追溯到表示“两个”的概念（与 bi- / bin- 相关），但现代日常交流中几乎不用。"]}
{"word":"Binalonan","summary":{"en":"Binalonan is the name of a town/municipality in Pangasinan, Philippines.","zh":"Binalonan 是菲律宾邦阿西楠省的一个城镇/市镇名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a municipality (town) in Pangasinan province, on the island of Luzon in the Philippines","zh":"比纳洛南：菲律宾吕宋岛邦阿西楠省的一个市镇（城镇）"},"examples":[{"en":"My grandmother lives in Binalonan, Pangasinan.","zh":"我外婆住在邦阿西楠省的比纳洛南。"},{"en":"We passed through Binalonan on the way to Dagupan.","zh":"我们去达古潘的路上经过比纳洛南。"}]},{"partOfSpeech":"n.","definition":{"en":"the name of a railway station area/locality associated with Binalonan (historical and local usage)","zh":"比纳洛南：与该地相关的火车站区域/地名（历史与地方用法）"},"examples":[{"en":"The old documents mention a stop near Binalonan.","zh":"旧文件里提到在比纳洛南附近有一站。"}]}],"synonyms":["(none—proper noun)"],"phonetic":"/ˌbɪnəˈloʊnən/","extraExplanation":["“Binalonan”是专有名词，通常不翻译，中文多音译为“比纳洛南”。在英文写作中常与上位地名连用以避免混淆，例如“Binalonan, Pangasinan”。","在旅行/新闻语境里，常见搭配有：Binalonan town（比纳洛南镇）、Binalonan municipality（比纳洛南市镇）、Binalonan residents（比纳洛南居民）。"]}
{"word":"Binalonen","summary":{"en":"“Binalonen” is not a common English word; it most likely refers to the place name **Binalonan** in the Philippines.","zh":"“Binalonen”不是常见英语词；多半指菲律宾的地名 **Binalonan**（可能拼写有误）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A likely misspelling or variant spelling of **Binalonan**, a municipality (town) in Pangasinan province, the Philippines; used as a **proper name** (place name).","zh":"很可能是 **Binalonan** 的拼写误差或变体；**Binalonan** 是菲律宾邦阿西楠省的一个市镇（地名），作为**专有名词**使用。"},"examples":[{"en":"My grandparents live in Binalonan, Pangasinan.","zh":"我祖父母住在邦阿西楠省的 Binalonan。"},{"en":"We passed through Binalonan on the way to Dagupan.","zh":"我们去达古潘的路上经过了 Binalonan。"}]}],"synonyms":["Binalonan"],"phonetic":"/ˌbɪnəˈloʊnɑn/","extraExplanation":["你输入的是 **Binalonen**，但更常见、在地图与资料里更标准的拼写是 **Binalonan**（菲律宾地名）。如果你指的是人名、品牌名，或来自某种语言/方言的词，请告诉我一句上下文（例如：出现在什么句子或哪里看到的），我可以再帮你确认含义与更准确的读音。"]}
{"word":"binaphthalene","summary":{"en":"Binaphthalene is a chemistry term for a molecule made from two linked naphthalene units.","zh":"Binaphthalene（联萘）是化学术语，指由两个相连的萘单元组成的分子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound made of two naphthalene units joined together (often used as a building block in organic chemistry).","zh":"联萘；由两个萘环单元连接而成的化合物（常用作有机合成中的结构单元/原料）。"},"examples":[{"en":"Researchers used a binaphthalene derivative to build a chiral catalyst.","zh":"研究人员使用了联萘的衍生物来构建一种手性催化剂。"},{"en":"Binaphthalene structures are common in ligand design in organic synthesis.","zh":"在有机合成中，联萘结构常见于配体设计。"}]}],"synonyms":["binaphthyl","dinaphthyl"],"phonetic":"/ˌbaɪnəˈnæfθəliːn/","extraExplanation":["“binaphthalene”在科研语境里更常见的相关词是“binaphthyl（联萘基/联萘）”。著名的手性骨架例如“BINOL（联萘酚）”与“BINAP（含膦的联萘配体）”都源自联萘结构，常用于不对称催化与手性合成。","该词多见于化学论文、专利与材料/有机合成领域；日常英语中几乎不会使用。"]}
{"word":"binaphthyl","summary":{"en":"Binaphthyl refers to (or describes) a structure made of two linked naphthyl units, commonly used in organic and chiral chemistry.","zh":"Binaphthyl 指（或形容）由两个萘基相连构成的联萘结构，常用于有机化学与手性化学中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical group or compound made of two naphthyl units (two naphthalene-based rings) linked together; often used as a building block in organic chemistry","zh":"（化学）“联萘基/二萘基”：由两个萘基（来自萘的芳香环结构）连接在一起形成的基团或化合物，常用于有机合成中的结构单元"},"examples":[{"en":"The catalyst contains a binaphthyl backbone to control the reaction’s selectivity.","zh":"这种催化剂含有联萘骨架，用来控制反应的选择性。"},{"en":"Chemists modified the binaphthyl unit to improve the molecule’s stability.","zh":"化学家对联萘单元进行改造，以提高分子的稳定性。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing something that includes or is based on a binaphthyl structure","zh":"（作定语）指含有联萘结构或以联萘为基础的"},"examples":[{"en":"They prepared a binaphthyl ligand for a metal-catalyzed reaction.","zh":"他们制备了一种联萘配体用于金属催化反应。"},{"en":"The binaphthyl framework is common in chiral catalyst design.","zh":"联萘骨架在手性催化剂设计中很常见。"}]}],"synonyms":["binaphthalene","bi-naphthyl (variant)"],"phonetic":"/baɪˈnæfθəl/","extraExplanation":["“binaphthyl”常见于有机化学与不对称催化领域，尤其与BINOL（1,1′-bi-2-naphthol，联萘酚）和BINAP等手性配体相关。这类联萘结构由于空间构型受限，常能形成“轴手性”（atropisomerism），因此在需要控制产物立体选择性的反应中非常重要。"]}
{"word":"binapthyl","summary":{"en":"Binaphthyl is a chemistry term for a compound (or structural unit) made from two naphthyl groups linked together, often used as a building block in chiral ligands and catalysts.","zh":"Binaphthyl（联萘）是化学术语，指由两个萘基连接而成的化合物或结构单元，常用作手性配体与催化剂的构建模块。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound made of two naphthyl groups joined together (often referring to 1,1′-binaphthyl), used in organic chemistry and materials science","zh":"联萘；由两个萘基连接形成的化合物（常指 1,1′-联萘），常用于有机化学与材料科学"},"examples":[{"en":"Researchers used 1,1′-binaphthyl as a building block to make chiral catalysts.","zh":"研究人员使用 1,1′-联萘作为构建单元来制备手性催化剂。"},{"en":"This ligand contains a binaphthyl unit that helps control the reaction’s stereochemistry.","zh":"这种配体含有联萘结构单元，有助于控制反应的立体化学。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or containing a binaphthyl structure (used as a modifier in chemistry)","zh":"（作修饰语）与联萘有关的；含有联萘结构的"},"examples":[{"en":"They designed a binaphthyl-derived phosphine ligand.","zh":"他们设计了一种联萘衍生的膦配体。"},{"en":"A binaphthyl framework can increase rigidity in the molecule.","zh":"联萘骨架可以提高分子的刚性。"}]}],"synonyms":["1,1′-binaphthyl","binaphthyl unit","binaphthyl framework","linked naphthyl groups"],"phonetic":"/baɪˈnæfθəl/","extraExplanation":["“binaphthyl”常见拼写是“binaphthyl”，你输入的“binapthyl”可能是把字母顺序写反了。","前缀“bi-”表示“两个”，“naphthyl”来自“naphthalene（萘）”。因此它字面意思就是“两个萘基连在一起”。","在不对称合成领域，联萘骨架很常见，因为它容易形成“轴手性（axial chirality）”，常被用来做手性配体或手性催化剂的核心结构。"]}
{"word":"binaries","summary":{"en":"Binaries usually means plural ‘binaries’: either two-state things (especially 0/1 in computing) or binary star systems.","zh":"binaries 通常是 binary 的复数：指二元（尤其计算机里的 0/1 二进制）或天文学中的双星系统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of binary: things that come in pairs or have two possible states (often 0/1 or yes/no).","zh":"binary 的复数：指由两部分组成、成对出现，或只有两种可能状态的事物（常见如 0/1、是/否）。"},"examples":[{"en":"The program stores data as binaries (0s and 1s).","zh":"这个程序把数据以二进制（0 和 1）的形式存储。"},{"en":"Some debates get reduced to simple binaries like right/wrong.","zh":"有些争论会被简化成“对/错”这样的二元对立。"}]},{"partOfSpeech":"n.","definition":{"en":"In astronomy, binary star systems (two stars orbiting each other).","zh":"【天文学】双星系统：两颗恒星互相绕转的系统。"},"examples":[{"en":"Many binaries can be detected by their changing brightness.","zh":"许多双星可以通过亮度变化被发现。"},{"en":"The telescope discovered a new pair of binaries in the cluster.","zh":"望远镜在星团中发现了一对新的双星系统。"}]}],"synonyms":["pairs","duos","two-state systems","binary systems"],"phonetic":"/ˈbaɪnəriz/","extraExplanation":["“binary”来自拉丁语 bi-（“二、双”）+ -nary（表示“由……组成”）。因此在计算机里常说“binary code（二进制代码）”，在思辨讨论里也常说“binary thinking（二元思维）”，指把复杂问题硬分成两类（例如好/坏），有时带有批评意味。"]}
{"word":"binarily","summary":{"en":"Binarily means “in a two-part (either/or) way,” or, in math/computing, “using base-2 (0 and 1).”","zh":"binarily 指“以二元（非此即彼）的方式”，或在数学/计算机中指“以二进制（0和1）方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that involves two parts, choices, or states (a binary system).","zh":"以二元（两部分/两种选择/两种状态）的方式；以非此即彼的方式。"},"examples":[{"en":"Some surveys treat gender binarily, offering only “male” or “female.”","zh":"有些问卷以二元方式处理性别，只提供“男”或“女”。"},{"en":"The program labels each pixel binarily as black or white.","zh":"这个程序把每个像素以二元方式标记为黑或白。"}]},{"partOfSpeech":"adv.","definition":{"en":"In computing or mathematics, using base 2 (0 and 1).","zh":"（计算机/数学）以二进制（基数为2，用0和1）表示或运算。"},"examples":[{"en":"The number 5 can be written binarily as 101.","zh":"数字5用二进制写作101。"},{"en":"Data may be stored binarily inside the device.","zh":"数据可能在设备内部以二进制形式存储。"}]}],"synonyms":["in a binary way","in binary form","either-or"],"phonetic":"/ˈbaɪnərɪli/","extraExplanation":["“binarily”来自动词/名词“binary”（二元的；二进制）。在日常写作里更常见的说法是“in a binary way”或“in binary form”。在社会话题中，它常用来批评把复杂事物简化成“只有两种”的分类方式（例如把身份、观点或选择硬分成两类）。"]}
{"word":"binariness","summary":{"en":"Binariness means the quality of being divided into two clear categories or based on two values (like 0 and 1).","zh":"Binariness 指“二元性/二进制性”，即事物被划分为两个清晰类别，或建立在两个数值（如 0 和 1）之上。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or state of being binary—having two distinct parts, choices, or categories (often contrasted as opposites).","zh":"“二元性”；指事物呈现为两种明显区分的部分、选择或类别（常被理解为对立两端）。"},"examples":[{"en":"The binariness of the question (yes or no) made the discussion too simple.","zh":"这个问题的二元性（是或否）让讨论显得过于简单。"},{"en":"Some researchers criticize the binariness of labels like “male/female.”","zh":"一些研究者批评像“男/女”这类标签的二元划分。"},{"en":"The story challenges the binariness of good versus evil.","zh":"这个故事挑战了善与恶的二元对立。"}]},{"partOfSpeech":"n.","definition":{"en":"In computing or mathematics, the property of using or being based on two states or values (such as 0 and 1).","zh":"（计算机/数学）“二进制性”；指基于两种状态或数值（如 0 和 1）的特性。"},"examples":[{"en":"Binariness is fundamental to how digital circuits store information.","zh":"二进制性是数字电路存储信息的基础。"},{"en":"The binariness of 0s and 1s allows computers to represent complex data.","zh":"0 和 1 的二进制特性让计算机能够表示复杂数据。"}]}],"synonyms":["binarity","binary nature","twofoldness","dualism (context-dependent)"],"phonetic":"/ˈbaɪnəɹinəs/","extraExplanation":["“binariness”常见于学术或讨论性写作（如性别研究、哲学、社会学、语言学）中，用来指出把复杂问题硬分成“两类”的倾向。有时会带一点批判意味：认为现实不一定只有两种选项。","词形来源：binary（二元的）+ -ness（表示“性质/状态”的名词后缀）。","相关词：binary（二元的/二进制的）、binarity（同义但更偏学术）、binary thinking（二元思维）、either-or thinking（非此即彼的思维）。"]}
{"word":"binarium","summary":{"en":"Binarium is a rare term meaning a binary compound (made of two elements), and more broadly, something consisting of two parts.","zh":"Binarium 是一个较少见的词，主要指“二元化合物（由两种元素组成）”，也可更宽泛地指“由两部分组成的事物/一对”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, technical) A binary compound; a chemical compound made of only two different elements.","zh":"（罕见，技术用语）二元化合物；只由两种不同元素组成的化合物。"},"examples":[{"en":"Sodium chloride is a binarium made of sodium and chlorine.","zh":"氯化钠是一种二元化合物，由钠和氯组成。"},{"en":"In older chemistry texts, some salts were described as a binarium rather than a more complex compound.","zh":"在较早的化学教材中，有些盐类会被描述为“二元化合物（binarium）”，而不是更复杂的化合物。"}]},{"partOfSpeech":"n.","definition":{"en":"(very rare) A pair; something consisting of two parts (from Latin usage).","zh":"（非常罕见）一对；由两部分组成的事物（源自拉丁语用法）。"},"examples":[{"en":"The word binarium is sometimes glossed as “a pair” in Latin-based terminology.","zh":"在一些基于拉丁语的术语解释中，binarium 有时会被注释为“成对之物”。"}]}],"synonyms":["binary compound","two-element compound","pair (rare sense)"],"phonetic":"/baɪˈnɛriəm/","extraExplanation":["“Binarium”来自拉丁语词根 bi-（二、双）+ -arium（表示事物/容器/集合的后缀）。在现代英语里它非常少见，更常见的表达是 binary compound（二元化合物）。","如果你是在生物分类、品牌名或专有名词中看到 Binarium，它也可能是专名而不是通用词，需要结合上下文判断。"]}
{"word":"binarization","summary":{"en":"Binarization is converting data (especially images or signals) into two values or two categories.","zh":"Binarization（二值化）指把数据（尤其是图像或信号）转换成只有两种取值或两类的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of converting something into a binary form (using only two values, such as 0/1, black/white, yes/no).","zh":"二值化；把某物转换成“只有两种取值”的形式（如 0/1、黑/白、是/否）的过程。"},"examples":[{"en":"In image processing, binarization turns a grayscale photo into black and white.","zh":"在图像处理中，二值化会把灰度照片变成黑白图像。"},{"en":"The engineer used binarization to represent the sensor output as 0 or 1.","zh":"工程师用二值化把传感器输出表示为 0 或 1。"}]},{"partOfSpeech":"n.","definition":{"en":"(often in machine learning/data processing) converting continuous or multi-level data into two categories.","zh":"（常用于机器学习/数据处理）把连续值或多级数据转换为两类。"},"examples":[{"en":"They applied binarization to the labels so the model could do two-class classification.","zh":"他们对标签进行二值化，让模型能够做二分类。"},{"en":"Binarization can simplify the data, but it may remove useful detail.","zh":"二值化可以简化数据，但可能会丢失有用的细节。"}]}],"synonyms":["thresholding","binary conversion","two-class conversion"],"phonetic":"/ˌbaɪnərəˈzeɪʃən/","extraExplanation":["“binarization”来自“binary”（二元的、二进制的）+ “-ization”（使……化）。在计算机视觉里它常和“threshold（阈值）”一起出现：设定一个阈值，大于阈值的像素变白，小于阈值的变黑。","在文档扫描/文字识别（OCR）中，二值化常用于去掉背景噪声、突出文字笔画；但阈值选得不好会导致文字断裂或背景变脏。"]}
{"word":"binarized","summary":{"en":"“Binarized” means changed into a two-value (binary) form, especially in computing and image processing.","zh":"“binarized”指被转换成只有两个取值的二进制/二值形式，常见于计算机与图像处理。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Converted into a binary form (usually two values such as 0/1, black/white, yes/no).","zh":"被转换成二进制形式的（通常只保留两个取值，如0/1、黑/白、是/否）。"},"examples":[{"en":"The scanned page was binarized so the text became black and the background white.","zh":"扫描的页面被二值化后，文字变成黑色，背景变成白色。"},{"en":"After binarization, each pixel is either 0 or 1.","zh":"二值化之后，每个像素只能是0或1。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “binarize”: to change something so it has only two possible states or values.","zh":"“binarize”的过去式/过去分词：把某物改成只有两种状态或取值。"},"examples":[{"en":"We binarized the data to simplify the model.","zh":"我们把数据二值化来简化模型。"},{"en":"The algorithm binarized the image before running OCR.","zh":"算法在运行文字识别（OCR）前先把图像二值化了。"}]}],"synonyms":["binary","two-valued","thresholded","converted to 0/1"],"phonetic":"/ˈbaɪnəˌraɪzd/","extraExplanation":["“binarized/二值化”常见于图像处理、机器学习与数据分析：例如把灰度图按阈值变成黑白两色；或把连续数值（如评分、概率）变成0/1，方便分类与统计。","在社会文化讨论中，binary（非此词本身）有时也指“二元对立”的看法（如只按两类来理解性别/身份等）。在写作里如果涉及人群与身份，通常更建议用更包容、更准确的表达，避免过度简化。"]}
{"word":"binarizing","summary":{"en":"Binarizing means converting data or an image into two values (often 0/1 or black/white).","zh":"Binarizing 指把数据或图像转换为只有两个取值的形式（常见为0/1或黑/白）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Converting something into a binary (two-value) form, usually 0 and 1.","zh":"把某物转成二元（只有两个取值）的形式，通常是 0 和 1。"},"examples":[{"en":"The engineer is binarizing the sensor data so the system can store it efficiently.","zh":"工程师正在把传感器数据二值化，这样系统就能更高效地存储。"},{"en":"Binarizing the labels turns the problem into a simple yes/no classification task.","zh":"把标签二值化会把问题变成一个简单的是/否分类任务。"}]},{"partOfSpeech":"v.","definition":{"en":"(Image processing) Turning a grayscale or color image into a black-and-white image by applying a threshold.","zh":"（图像处理）通过设定阈值，把灰度或彩色图像变成黑白（二值）图像。"},"examples":[{"en":"They are binarizing the scanned page to make the text easier to read.","zh":"他们正在对扫描页面进行二值化，让文字更清晰易读。"},{"en":"After binarizing the image, the program detects the edges more accurately.","zh":"图像二值化后，程序能更准确地检测边缘。"}]}],"synonyms":["binarization (noun)","thresholding","converting to binary","dichotomizing"],"phonetic":"/ˈbaɪnəˌraɪzɪŋ/","extraExplanation":["“binarizing”来自动词“binarize”（二值化），常见于计算机科学、机器学习和图像处理。最常见的做法是设定一个阈值（threshold）：高于阈值记为1，低于阈值记为0（或黑/白）。","在机器学习里，“binarizing”也可指把特征或标签从多值/连续值变成两类（例如：spam/not spam）。要注意二值化会简化问题，但也可能丢失细节信息。"]}
{"word":"binary","summary":{"en":"Binary means “two-part” or “based on 0 and 1,” and it can also mean the binary (base-2) number system.","zh":"binary 指“二元的/由两部分构成的”，也指“二进制的（基于0和1）”，名词可指二进制（以2为基数）的系统或数字。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having or involving two parts, choices, or states (often contrasted as opposites).","zh":"二元的；由两部分构成的；涉及两种选择或状态（常指对立的两端）。"},"examples":[{"en":"The story explores the binary of good and evil.","zh":"这个故事探讨了善与恶的二元对立。"},{"en":"Some people dislike binary choices like ‘yes or no.’","zh":"有些人不喜欢“是或否”这种二选一的选择。"}]},{"partOfSpeech":"adj.","definition":{"en":"Using a system of 0 and 1 to store or process information (the basis of most modern computing).","zh":"二进制的（用0和1表示并进行存储或运算，是现代计算的基础）。"},"examples":[{"en":"Computers represent data in binary.","zh":"计算机用二进制表示数据。"},{"en":"The number 5 is 101 in binary.","zh":"数字5用二进制表示是101。"}]},{"partOfSpeech":"n.","definition":{"en":"A binary number or binary system (base 2).","zh":"二进制（数）；二进制系统（以2为基数）。"},"examples":[{"en":"I’m learning binary for a basic programming class.","zh":"我在为基础编程课学习二进制。"},{"en":"In binary, 10 means two, not ten.","zh":"在二进制里，10表示2，而不是10。"}]}],"synonyms":["two-part","dual","twofold","base-2","digital"],"phonetic":"/ˈbaɪˌnɛri/","extraExplanation":["“binary”来自拉丁语 bini，意思是“两个一组”。因此它既可用于抽象概念（如二元对立：非黑即白的思维），也可用于科技语境（二进制：0和1）。","在社会文化语境里，binary 常用来指“二元分类”，如 gender binary（性别二元：只分为男性/女性）。这种表达可能涉及身份与多样性议题，使用时注意尊重不同人的自我认同。"]}
{"word":"binary code","summary":{"en":"Binary code is information represented with only two symbols (usually 0 and 1), the basic language computers use.","zh":"Binary code（二进制代码）是用两种符号（通常0和1）来表示信息的编码方式，是电脑最基础的“语言”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a system of representing information using only two symbols (usually 0 and 1), commonly used by computers","zh":"二进制代码：只用两种符号（通常是0和1）来表示信息的系统，电脑常用"},"examples":[{"en":"Computers store data as binary code.","zh":"电脑把数据以二进制代码的形式储存。"},{"en":"In binary code, the letter “A” can be represented as 01000001.","zh":"在二进制代码里，字母“A”可以表示为01000001。"}]},{"partOfSpeech":"n.","definition":{"en":"instructions or data written in a binary format, readable by machines rather than humans","zh":"（机器可读的）二进制形式的指令或数据；人类不易直接阅读"},"examples":[{"en":"The file is mostly binary code, so you can’t read it like normal text.","zh":"这个文件主要是二进制代码，所以你不能像普通文本那样阅读它。"},{"en":"The program compiles into binary code that the processor can run.","zh":"这个程序会编译成处理器可运行的二进制代码。"}]}],"synonyms":["machine code","binary","base-2 encoding"],"phonetic":"/ˈbaɪnəri koʊd/","extraExplanation":["“binary”来自拉丁语 roots，意思是“两、成对”；“code”指“符号系统/编码方式”。合起来强调“用两种符号来编码信息”。","学习小提示：别把“binary code（二进制代码）”和“binary number（二进制数）”混在一起。二进制数更偏“数字系统”（如1011=11），二进制代码更偏“编码信息”（如把字母、图片、声音编码成0和1）。","在日常文化里，“binary code”常被用来象征“计算机的语言”。科幻作品或黑客题材中常出现一串0和1来表示“机器世界/数字世界”。"]}
{"word":"binary-coded","summary":{"en":"Binary-coded means represented using 0s and 1s, especially in computing; it can also refer to BCD, where each decimal digit is encoded separately.","zh":"binary-coded 指用 0 和 1 的二进制形式来表示（常用于计算机领域）；也可指 BCD（二进制编码十进制），即每个十进制数字分别编码。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Represented, stored, or transmitted using binary digits (0 and 1).","zh":"用二进制数字（0 和 1）来表示、存储或传输的；二进制编码的。"},"examples":[{"en":"The device reads binary-coded data from the sensor.","zh":"该设备从传感器读取二进制编码的数据。"},{"en":"Binary-coded messages are easy for computers to process.","zh":"二进制编码的信息很容易被计算机处理。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Often in “binary-coded decimal”) Represented in binary form while keeping each decimal digit separate.","zh":"（常见于“二进制编码十进制”BCD）用二进制来表示，但每一位十进制数字分别编码。"},"examples":[{"en":"Some older systems used binary-coded decimal to store numbers.","zh":"一些较旧的系统使用二进制编码十进制来存储数字。"},{"en":"In a binary-coded decimal clock, each digit is shown as a small group of bits.","zh":"在二进制编码十进制时钟里，每一位数字会显示为一小组比特。"}]}],"synonyms":["digitally encoded","encoded in binary","binary-encoded","BCD (in context)"],"phonetic":"/ˈbaɪnəri koʊdɪd/","extraExplanation":["“binary-coded”常用于计算机与电子领域。最常见的搭配是“binary-coded decimal (BCD) / 二进制编码十进制”，它不是把整个数直接转成纯二进制，而是把每个十进制数字（0–9）分别用4位二进制表示，因此读起来更直观，但效率通常不如纯二进制。"]}
{"word":"binary-like","summary":{"en":"Binary-like means “similar to a binary (two-state) system,” especially 0/1 in computing, or more generally “either-or” with little nuance.","zh":"binary-like 指“类似二元（两种状态）系统的”，尤其用于计算机中的 0/1；也可泛指“非此即彼、缺少细微差别”的情况。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a binary system—based on two states or two choices (such as 0/1, on/off, yes/no).","zh":"类似二元系统的——基于两种状态或两种选择（如 0/1、开/关、是/否）。"},"examples":[{"en":"The switch has a binary-like behavior: it’s either on or off.","zh":"这个开关表现得很“二元化”：要么开，要么关。"},{"en":"Some debates become binary-like, leaving no room for nuance.","zh":"有些争论会变得像“非黑即白”一样，几乎没有细微差别的空间。"}]},{"partOfSpeech":"adj.","definition":{"en":"In computing or data, similar to binary code or to data stored/processed as bits (0s and 1s).","zh":"（计算机/数据）类似二进制代码的，或像以比特（0 和 1）形式存储/处理的数据。"},"examples":[{"en":"The device outputs a binary-like signal that the microcontroller can read easily.","zh":"设备输出一种类似二进制的信号，微控制器很容易读取。"},{"en":"This file format contains binary-like data rather than plain text.","zh":"这种文件格式包含类似二进制的数据，而不是纯文本。"}]}],"synonyms":["either-or","two-state","bit-based","black-and-white (thinking)","digital-like"],"phonetic":"/ˈbaɪnəri laɪk/","extraExplanation":["“binary-like”是由“binary（二进制/二元的）+ like（像……的）”构成的复合形容词，常用连字符来强调它作为一个整体来修饰名词（如 binary-like signal）。","在日常语境中，它也常被用来形容“非黑即白”的思维方式（只有两种选项、忽略中间地带），与“either-or thinking（二选一思维）/black-and-white thinking（黑白思维）”意思接近。"]}
{"word":"binasal","summary":{"en":"Binasal means “involving both sides of the nose,” and it’s mainly used in medical or phonetics contexts.","zh":"binasal 指“涉及鼻子的两侧（两个鼻孔/双侧鼻部）”，多用于医学或语音学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both sides of the nose (both nostrils or both nasal bones).","zh":"与鼻子的两侧有关的；涉及两个鼻孔或两块鼻骨的。"},"examples":[{"en":"The doctor noted binasal swelling after the injury.","zh":"医生记录到受伤后出现了双侧鼻部肿胀。"},{"en":"A binasal approach may be used in some nasal examinations.","zh":"在某些鼻腔检查中可能会采用双侧鼻部的进入方式。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Linguistics/phonetics) Produced with air flowing through both nostrils; involving both nasal passages.","zh":"（语言学/语音学）通过两个鼻孔出气发出的；涉及双侧鼻腔气流的。"},"examples":[{"en":"Some descriptions of nasal sounds mention binasal airflow.","zh":"一些对鼻音的描述会提到双鼻孔气流。"},{"en":"The researcher compared oral, nasal, and binasal resonance.","zh":"研究者比较了口腔共鸣、鼻腔共鸣以及双侧鼻腔共鸣。"}]}],"synonyms":["both-nostril","bilateral nasal","on both sides of the nose"],"phonetic":"/baɪˈneɪzəl/","extraExplanation":["“binasal”由前缀 bi-（“两、双”）+ nasal（“鼻的”）构成，多见于医学解剖、临床记录或语音学描述中。","日常英语里更常用的说法通常是 “both nostrils / on both sides of the nose”。"]}
{"word":"binate","summary":{"en":"Binate means “in pairs” or “having two linked parts,” mainly used in scientific (especially biological/botanical) descriptions.","zh":"Binate 指“成对的”或“由两部分相连组成的”，主要用于科学（尤其生物/植物学）描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially in biology/botany) occurring in a pair; having two parts that are joined or closely associated.","zh":"（尤用于生物/植物学）成对的；由两部分组成并相连或紧密相关的。"},"examples":[{"en":"Some leaves are binate, meaning they are divided into two leaflets.","zh":"有些叶子是二小叶的（binate），意思是它们分成两片小叶。"},{"en":"The insect’s antennae have binate segments near the tip.","zh":"这种昆虫的触角在末端附近有成对的节段。"}]}],"synonyms":["paired","double","twin","twofold"],"phonetic":"ˈbaɪneɪt","extraExplanation":["词源来自拉丁语 binatus（“成对的、两倍的”），与 bi-（“二、双”）同源。它多见于科学写作（尤其植物学形态描述），日常英语里更常用 paired / double / twin 来表达。","在植物学里常见搭配：binate leaf（二小叶叶）、binate compound leaf（二回羽状复叶的某种描述中也可能出现，具体取决于分类体系与作者用法）。"]}
{"word":"binately","summary":{"en":"“Binately” is a rare adverb meaning “in pairs” or “two by two.”","zh":"“Binately”是一个罕用副词，意思是“成对地”或“两两地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Rare) In pairs; two by two; in a double manner.","zh":"（罕用）成对地；两两地；以双重方式。"},"examples":[{"en":"The leaves are arranged binately along the stem.","zh":"叶子沿着茎两两成对排列。"},{"en":"In some descriptions, petals may be said to appear binately.","zh":"在一些描写中，花瓣可能会被说成是成对出现的。"}]}],"synonyms":["in pairs","two by two","pairwise","doubly"],"phonetic":"/ˈbaɪnətli/","extraExplanation":["“binately”是非常少见的副词，主要见于较老的书面语或科学/描述性文字（例如植物学中谈“成对排列”）。","它来自拉丁语词根 bi-（“二、双”）加上构词形式 -nate/-nately（与“出生、生成、排列方式”等概念相关），因此整体含义可理解为“以二为单位/以成对的方式”。","现代英语中更常用的表达通常是 in pairs、two by two、pairwise。"]}
{"word":"bination","summary":{"en":"“Bination” is a rare noun meaning “combining,” mostly seen as part of longer words like “combination.”","zh":"“Bination”是罕见名词，意为“结合/合并”，多见于“combination”等较长词中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare word meaning “the act or process of combining.” In modern English, it is usually seen only as the ending of longer words (like combination, recombination).","zh":"一个很少单独使用的词，意思是“结合、合并的行为或过程”。现代英语中多作为较长词（如 combination、recombination）的词尾出现。"},"examples":[{"en":"This form is uncommon; most people say “combination,” not “bination.”","zh":"这种形式不常见；大多数人会说“combination”，而不是“bination”。"},{"en":"In biology, you’ll often see it inside a longer word: “genetic recombination.”","zh":"在生物学中，你常会在更长的词里看到它：“genetic recombination（基因重组）”。"}]}],"synonyms":["combining","joining","union"],"phonetic":"/ˌbɪnˈeɪʃən/","extraExplanation":["“-bination”更像是一个“被绑定”的词根/词尾（bound form），通常不会单独成词。日常表达里建议用更常见的“combination（组合）”。","如果你原本想查的是“combination”，它最常见的意思是“组合；结合；（事情的）巧合；（密码锁的）号码组合”。"]}
{"word":"binational","summary":{"en":"“Binational” means involving two nations, especially in shared projects or organizations.","zh":"“binational”意为“涉及两个国家的”，常指两国共同参与的项目或机构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Involving or relating to two nations, often through cooperation, agreements, projects, or institutions.","zh":"涉及两个国家的；两国之间的（常指合作、协议、项目或机构）。"},"examples":[{"en":"The two governments formed a binational commission to manage the river.","zh":"两国政府成立了一个两国委员会来共同管理这条河流。"},{"en":"Binational companies often operate under laws from both countries.","zh":"两国合资/跨两国运营的公司常常需要同时遵守两国法律。"},{"en":"They organized a binational conference on public health.","zh":"他们举办了一场关于公共卫生的两国会议。"}]}],"synonyms":["bilateral","two-nation","joint"],"phonetic":"/baɪˈnæʃənəl/","extraExplanation":["“binational”由前缀“bi-（二、双）”+“national（国家的）”构成，常用于外交、边境事务、联合项目等语境。","近义词对比：\n- “bilateral”更常见，强调“两方/两国之间的（关系、谈判、协议）”。\n- “binational”更强调“由两国共同构成/共同参与的实体或活动”（如binational commission、binational park）。"]}
{"word":"binationalism","summary":{"en":"Binationalism is the idea that two nations share one state with equal recognition and rights.","zh":"“binationalism”指两个民族共享一个国家并获得平等承认与权利的政治理念。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A political idea or policy that supports one country, state, or political system being shared by two nations (two national groups), usually with equal rights and recognition.","zh":"（政治理念/政策）主张由两个民族共同共享一个国家、一个国家体制或一个政治共同体，通常强调平等权利与相互承认。"},"examples":[{"en":"Some scholars discuss binationalism as an alternative to a strict two-state solution.","zh":"一些学者把“双民族国家主义”作为严格“两国方案”的替代方案来讨论。"},{"en":"In a binationalist framework, both national identities are recognized in law and public institutions.","zh":"在“双民族国家主义”的框架下，两种民族身份会在法律和公共机构中得到承认。"}]}],"synonyms":["binational statehood","power-sharing nationalism","shared-state approach"],"phonetic":"/baɪˌnæʃənəˌlɪzəm/","extraExplanation":["“binationalism”常出现在关于以色列—巴勒斯坦/历史上的委任统治时期等语境中，指向“一个国家内两个民族共同治理与共享主权”的设想。它与“two-state solution（两国方案）”不同：前者强调同一国家架构下的双民族平等，后者强调建立两个独立国家。","相关表达：a binational state（双民族国家）、binational federation（双民族联邦）。在讨论中常伴随议题包括公民权、语言与教育政策、权力分享机制、移民/回归权等。"]}
{"word":"binationalisms","summary":{"en":"Binationalism means a political system or belief where two national groups share recognized rights and power within one state or territory.","zh":"双民族主义指在同一国家或领土内，两个民族/国家群体被制度性承认并共享权利与权力的政治理念或制度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The political idea or system in which two distinct national groups share power, rights, or recognition within the same state or territory.","zh":"双民族主义（政治理念或制度）：在同一国家或领土内，两个不同民族/国家群体共享权力、权利或相互承认。"},"examples":[{"en":"Some proposals for the region argue for binationalism, so both communities would have equal legal status.","zh":"有些对该地区的方案主张双民族主义，让两个社群在法律地位上平等。"},{"en":"Critics say binationalism is hard to maintain without strong protections for minorities.","zh":"批评者认为，如果没有对少数群体的强力保障，双民族主义很难维持。"}]},{"partOfSpeech":"n.","definition":{"en":"A movement or set of beliefs supporting binational political arrangements.","zh":"支持双民族政治安排的运动或信念体系。"},"examples":[{"en":"In the early 20th century, small groups promoted binationalism as an alternative to separation.","zh":"在20世纪早期，一些小团体提倡双民族主义，作为分离之外的另一种选择。"}]}],"synonyms":["dual nationalism","power-sharing","consociationalism"],"phonetic":"/ˌbaɪˈnæʃənəˌlɪzəm/","extraExplanation":["你输入的“binationalisms”是复数形式，单数是“binationalism”。\n\n“binationalism”常出现在讨论多族群/多社群如何共处的政治语境中，强调两个“民族（nation）”都应被制度性承认（例如语言、教育、政治代表性等）。它与“federalism（联邦制）”或“power-sharing（权力分享）”有时相关，但不完全等同：双民族主义更强调“两个民族主体”的并列与承认。"]}
{"word":"binaural","summary":{"en":"Binaural means “using or involving both ears,” especially for realistic 3D-like audio.","zh":"binaural 指“与双耳有关/利用双耳的”，常用于能产生逼真空间定位感的音频。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or using both ears, especially to create a realistic sense of direction and space in sound (often through headphones).","zh":"与双耳有关的；（尤指）利用双耳来产生逼真的方向感与空间感的声音效果（常通过耳机）。"},"examples":[{"en":"Binaural audio can make you feel like the sound is moving around your head.","zh":"双耳录音/双耳音频会让你感觉声音在你头部周围移动。"},{"en":"I listened to a binaural recording with headphones to hear the 3D effect.","zh":"我用耳机听了一段双耳录音，感受到了立体的效果。"},{"en":"Some meditation apps use binaural sound to create a calm atmosphere.","zh":"一些冥想应用会用双耳音效来营造放松的氛围。"}]}],"synonyms":["two-eared","stereo (related, not identical)"],"phonetic":"/baɪˈnɔrəl/","extraExplanation":["“binaural”来自 bi-（两个）+ aural（耳的、听觉的），字面意思是“两个耳朵的”。","常见搭配：binaural audio（双耳音频）、binaural recording（双耳录音）、binaural microphone（双耳麦克风/仿真头录音麦克风）。","与 stereo（立体声）不同：stereo 通常指左右声道；binaural 更强调模拟人类两耳接收声音的差异（如到达时间差、音量差），因此更有“人在现场”的空间定位感。"]}
{"word":"binaurally","summary":{"en":"“Binaurally” means “using both ears,” often referring to binaural listening or recording for a 3D-like sound effect.","zh":"“Binaurally”意为“通过双耳”，常用于指双耳聆听或双耳录音，产生类似3D的空间音效。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that involves both ears (especially used for listening or recording).","zh":"以双耳方式；通过两只耳朵（尤指聆听或录音方式）。"},"examples":[{"en":"Binaurally recorded audio can feel more three-dimensional when you use headphones.","zh":"用双耳录制的音频在戴耳机时会更有立体感。"},{"en":"The app plays relaxation sounds binaurally to create a sense of space.","zh":"这个应用以双耳方式播放放松音效，营造空间感。"}]}],"synonyms":["with both ears","in stereo (often broader)","aurally (broader)"],"phonetic":"/baɪˈnɔrəli/","extraExplanation":["“Binaurally”常见于音频领域，和“binaural recording（双耳录音）/ binaural beats（双耳节拍）”等搭配使用。它源自 bi-（两、双）+ aural（耳的、听觉的）。\n\n双耳录音通常用人头模型或把麦克风放在类似人耳位置，利用人耳之间的时间差与音量差（大脑用来定位声源的线索）来制造更真实的空间听感。通常戴耳机效果更明显。"]}
{"word":"binauricular","summary":{"en":"Binauricular means “related to or using both ears.”","zh":"binauricular 意为“与双耳有关的；使用双耳的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or using both ears (for example, hearing with two ears, or a device designed for two-ear listening).","zh":"与双耳有关的；使用两只耳朵的（例如用双耳听觉，或为双耳聆听设计的设备）。"},"examples":[{"en":"Humans usually locate sounds more accurately with binauricular hearing.","zh":"人类通常用双耳听觉能更准确地判断声音来自哪里。"},{"en":"The lab used binauricular recordings to create a realistic sense of space in the audio.","zh":"实验室使用双耳录音，让音频产生更真实的空间感。"}]}],"synonyms":["binaural","two-eared","stereo (in audio context)"],"phonetic":"/ˌbaɪˌnɔːrˈɪkjələr/","extraExplanation":["词源提示：binauricular = bi-（两、双）+ auricular（耳的，来自拉丁语 auris “耳朵”）。在听觉科学里常与“binaural（双耳的）”并用；binaural 更常见，而 binauricular 偏书面或技术语境。","使用场景：常见于医学、听力学、音频工程（例如双耳录音/空间音频）。可联想对比：monaural/monauricular（单耳的）。"]}
{"word":"binbashi","summary":{"en":"Binbashi is a Turkish/Ottoman military rank roughly equal to a major.","zh":"binbashi 是土耳其/奥斯曼语境中的军衔，大致相当于“少校”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a military rank in the Ottoman Empire and in modern Turkish usage, roughly equivalent to a major (an officer typically above captain and below lieutenant colonel).","zh":"（奥斯曼帝国及现代土耳其语中的）军衔“binbaşı”，大致相当于“少校”（通常高于上尉、低于中校）。"},"examples":[{"en":"In the novel, Binbashi Kemal commands a small garrison on the frontier.","zh":"在小说里，少校（Binbashi）凯末尔指挥边境的一支小型驻军。"},{"en":"He served as a binbashi in the late Ottoman army.","zh":"他在奥斯曼帝国晚期的军队中担任少校（binbashi）。"}]}],"synonyms":["major","Ottoman major"],"phonetic":"/ˈbɪnˌbɑːʃi/","extraExplanation":["“binbashi”常见于英文历史写作中，是土耳其语“binbaşı”的转写；土耳其语里“bin”有“一千”的意思，“başı”有“首领/头目”的意思，词源上带有“千人之长”的含义（类似古代军制的编制称呼）。","在英语文本中它多作为历史/文化借词出现，常写作 Binbashi（作头衔时可大写），有时也会看到更接近土耳其拼写的“binbaşı”（带土耳其字母 ı 和 ş）。"]}
{"word":"Binchois","summary":{"en":"Binchois was an early-Renaissance French composer, famous for Burgundian chansons.","zh":"班舒瓦是早期文艺复兴时期的法国作曲家，以勃艮第香颂闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Gilles Binchois (c. 1400–1460), a French composer of the early Renaissance and an important figure of the Burgundian School, especially known for his secular songs (chansons).","zh":"吉尔·班舒瓦（约1400–1460）：法国早期文艺复兴作曲家，勃艮第乐派的重要人物，尤以世俗歌曲（香颂）闻名。"},"examples":[{"en":"Binchois is best known for his graceful chansons that influenced later composers.","zh":"班舒瓦最著名的是他优雅的香颂，影响了后来的作曲家。"},{"en":"In music history class, we studied Dufay and Binchois as key composers of the Burgundian School.","zh":"在音乐史课上，我们学习了迪费与班舒瓦，他们是勃艮第乐派的关键作曲家。"}]}],"synonyms":["Gilles Binchois"],"phonetic":"/bɪnˈʃwɑː/","extraExplanation":["“Binchois”常被视为中世纪晚期/早期文艺复兴音乐从复杂走向更流畅、可唱旋律的一位代表人物之一。他的作品多为法语世俗歌曲（如三声部的香颂），以旋律优美、抒情著称。","在英文语境中，常见搭配有：the Burgundian School（勃艮第乐派）、chanson(s)（香颂/法语世俗歌曲）、early Renaissance（早期文艺复兴）。","与他经常并列提到的作曲家包括 Guillaume Dufay（纪尧姆·迪费）等。"]}
{"word":"BIND","summary":{"en":"Bind means to tie or hold things together, to unite people or ideas, or to obligate someone (often legally). It can also mean to get stuck, and as a noun it can mean a difficult situation or a book’s cover.","zh":"bind 可指“捆绑/包扎”、引申为“使团结/联系”，也可指（常为法律意义的）“约束/使负有义务”；还可表示“卡住”。作名词时可指“困境”或“书的装订/封面”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to tie, fasten, or wrap something so it stays together or in place","zh":"捆绑；系牢；包扎，使固定在一起"},"examples":[{"en":"She bound the boxes with strong tape.","zh":"她用结实的胶带把箱子捆好。"},{"en":"His ankle was bound in a bandage.","zh":"他的脚踝用绷带包扎着。"}]},{"partOfSpeech":"vt.","definition":{"en":"to create a strong connection or relationship; to unite","zh":"把……联系在一起；使团结；使紧密相连"},"examples":[{"en":"Shared experiences can bind a team together.","zh":"共同的经历能把团队凝聚在一起。"},{"en":"Trust binds friends to one another.","zh":"信任把朋友紧密联系在一起。"}]},{"partOfSpeech":"vt.","definition":{"en":"to place someone under a duty, promise, or rule; to obligate (often in a formal or legal sense)","zh":"（在道义或法律上）约束；使负有义务"},"examples":[{"en":"The contract binds both parties to the agreement.","zh":"合同约束双方遵守协议。"},{"en":"I’m bound by company policy.","zh":"我受公司政策约束。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become stuck or unable to move smoothly","zh":"卡住；不顺畅；（机械等）发涩"},"examples":[{"en":"The drawer binds when you try to close it.","zh":"你想关抽屉时它会卡住。"},{"en":"My shoulder sometimes binds in cold weather.","zh":"天气冷的时候我的肩膀有时会发紧不灵活。"}]},{"partOfSpeech":"n.","definition":{"en":"a difficult situation or problem (often in the phrase “in a bind”)","zh":"困境；为难的处境（常用于短语 in a bind）"},"examples":[{"en":"I’m in a bind—I lost my wallet and my ID.","zh":"我陷入困境了——钱包和身份证都丢了。"},{"en":"Thanks for helping me out of a bind.","zh":"谢谢你帮我摆脱困境。"}]},{"partOfSpeech":"n.","definition":{"en":"the cover or the act of putting pages of a book together; bookbinding","zh":"装订；书籍装帧"},"examples":[{"en":"The binding on this book is very strong.","zh":"这本书的装订很结实。"},{"en":"The old book needs a new binding.","zh":"这本旧书需要重新装订。"}]}],"synonyms":["tie","fasten","wrap","restrain","obligate","unite","link"],"phonetic":"/baɪnd/","extraExplanation":["“bind”来自古英语，核心感觉是“把东西拉到一起并固定住”。因此它既能表示具体的“捆绑/包扎”，也能引申为抽象的“约束/使团结”。","常见搭配：bind up（包扎；装订；把……收好）、bind together（凝聚在一起）、bind someone to something（使某人受……约束）、be bound to（一定会；必须；受约束）。注意：be bound to do sth 常表示“很可能/几乎肯定会”。"]}
{"word":"bind","summary":{"en":"“Bind” mainly means to tie/fasten, to bind a book, or to obligate/restrict; as a noun, it can mean a difficult situation (“in a bind”).","zh":"“bind”主要指“捆绑固定”“装订（书）”或“约束/使负有义务”；作名词可指“困境”（in a bind）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to tie or fasten something so it stays together or in place","zh":"捆绑；系住；固定在一起"},"examples":[{"en":"She bound the boxes with rope so they wouldn’t open.","zh":"她用绳子把箱子捆起来，防止打开。"},{"en":"Please bind these papers with a clip.","zh":"请用夹子把这些纸夹在一起。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make a book by putting pages together and adding a cover","zh":"装订（书或文件）"},"examples":[{"en":"The thesis must be printed and bound before Friday.","zh":"论文必须在周五前打印并装订好。"}]},{"partOfSpeech":"vt.","definition":{"en":"to force or oblige someone to do something; to put someone under a duty or rule","zh":"约束；使负有义务；使受规则限制"},"examples":[{"en":"The contract binds both sides to the agreement.","zh":"合同约束双方遵守协议。"},{"en":"I’m not bound to answer that question.","zh":"我不一定要回答那个问题。"}]},{"partOfSpeech":"v.","definition":{"en":"to cause something to stick or become tight and uncomfortable (often about clothes, shoes, or a wound)","zh":"（使）勒得难受；（伤口等）绷紧；（衣物鞋等）夹得疼"},"examples":[{"en":"These shoes bind at the toes.","zh":"这双鞋在脚趾处夹脚。"},{"en":"The bandage is binding too tightly.","zh":"绷带缠得太紧了。"}]},{"partOfSpeech":"n.","definition":{"en":"a problem or difficult situation that you feel stuck in (common in the phrase “in a bind”)","zh":"困境；进退两难（常用于 in a bind）"},"examples":[{"en":"I’m in a bind—I lost my wallet and my phone.","zh":"我陷入困境——钱包和手机都丢了。"}]}],"synonyms":["tie","fasten","attach","secure","obligate","restrict"],"phonetic":"/baɪnd/","extraExplanation":["动词 bind 的过去式和过去分词是 bound（不规则变化）。例如：bind → bound → bound。","常见搭配：bind together（把……绑/结合在一起）、bind up（包扎；把……好好绑起）、bind someone to something（使某人受……约束）。","文学/正式语境里，bind 常用来表达“情感或义务的纽带”：如 duty binds us（责任把我们联系/约束在一起）。"]}
{"word":"bindable","summary":{"en":"“Bindable” means “able to be bound,” either physically (tied/fastened) or, in computing, linked through binding (often data binding).","zh":"“Bindable”指“可被绑定的”，既可指物理上的捆绑/固定，也可指计算机中通过绑定（常见为数据绑定）进行连接。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be bound (tied, fastened, or wrapped) with a rope, band, cover, etc.","zh":"可被捆绑的；可被系住/固定/包裹的。"},"examples":[{"en":"The package is bindable with tape or string.","zh":"这个包裹可以用胶带或绳子绑好。"},{"en":"Choose a bindable cover if you need to secure loose papers.","zh":"如果你需要固定散页，请选择可装订/可固定的封面。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Computing) Able to be connected (“bound”) to something else, especially in data binding (linking data to a user interface or another value).","zh":"（计算机）可绑定的；可进行数据绑定的（把数据与界面或其他值连接起来）。"},"examples":[{"en":"Make sure the property is bindable so the UI updates automatically.","zh":"确保这个属性是可绑定的，这样界面会自动更新。"},{"en":"This component exposes bindable values for easier configuration.","zh":"这个组件提供可绑定的值，便于配置。"}]}],"synonyms":["tieable","fastenable","attachable","linkable"],"phonetic":"/ˈbaɪndəbəl/","extraExplanation":["在软件语境里，bindable 常见于“数据绑定”（data binding）：当数据变化时，界面会跟着更新（或反过来）。不同框架对“可绑定”的要求不同（例如是否需要特定注解/声明、是否支持双向绑定等），所以要结合具体技术文档理解。"]}
{"word":"bindan","summary":{"en":"“bindan” is not a standard English word; it’s probably “bind an …” written together or a name.","zh":"“bindan”不是标准英语词；多半是把“bind an …”连写，或是一个名字。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a run-together form of “bind an …” (verb + article), or a name/username.","zh":"不是标准英语单词；很可能是拼写错误，或把“bind an …”（动词+冠词）连写在一起，也可能是姓名/用户名。"},"examples":[{"en":"I think you meant “bind an agreement” (not “bindan”).","zh":"我猜你想写的是“bind an agreement”（而不是“bindan”）。"},{"en":"Could you show the full sentence where you saw “bindan”?","zh":"你能把看到“bindan”的完整句子发出来吗？"}]}],"synonyms":["bind an","bind"],"phonetic":"/ˈbɪndæn/","extraExplanation":["“bind”作动词时常见意思是“捆绑/绑住”“约束/使受限制”“装订（书）”。如果你想表达其中某个意思，把“bind”后面接正确的宾语即可：bind a package（捆包裹）、bind people together（把人凝聚在一起）、bind a book（装订书）。","如果“bindan”是人名/品牌名/游戏ID等专有名词，也可以告诉我它出现的语境或所属语言，我可以帮你确认更准确的读音和含义。"]}
{"word":"BIndEd","summary":{"en":"“Binded” is a nonstandard form of “bind.” In standard English, use “bound” as the past tense and past participle.","zh":"“binded”是“bind”的非标准形式；标准英语中过去式和过去分词应使用“bound”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Nonstandard past tense/past participle of “bind” (standard form: “bound”).","zh":"“bind”的非标准过去式/过去分词（标准形式是“bound”）。"},"examples":[{"en":"Nonstandard: My ankle was binded up. (Standard: My ankle was bound up.)","zh":"非标准：我的脚踝被包扎得很紧。（标准：My ankle was bound up.）"},{"en":"Nonstandard: He binded the papers together. (Standard: He bound the papers together.)","zh":"非标准：他把文件绑在一起。（标准：He bound the papers together.）"}]},{"partOfSpeech":"adj.","definition":{"en":"Tied, fastened, or wrapped tightly (often used as a mistaken form of “bound” in writing).","zh":"被绑住的、系紧的、包裹很紧的（写作中常被误用来代替“bound”）。"},"examples":[{"en":"Nonstandard: a binded bundle (Standard: a bound bundle)","zh":"非标准：a binded bundle（标准：a bound bundle / 一捆绑好的东西）"}]}],"synonyms":["bound","tied","fastened"],"phonetic":"/ˈbaɪndɪd/","extraExplanation":["“bind”的不规则变化是 bind–bound–bound，所以在正式写作、考试和职场英语里一般不用“binded”。","“binded”更常见于儿童语言、口语中的误用，或少数方言/非母语写作者的写法；如果你看到它，通常应改为“bound”。","常见搭配：bound up（包扎/缠紧；也可指“忙得不可开交”）、bound together（捆在一起）、be bound to（一定会……）。注意：be bound to 里的“bound”是形容词用法，不是“binded”。"]}
{"word":"binder","summary":{"en":"A binder is usually a ring folder for organizing papers; it can also mean something (or someone) that holds things together.","zh":"binder 通常指用来整理纸张的活页夹；也可指把东西黏合或捆在一起的人或物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A folder (often with rings) used to hold and organize loose papers.","zh":"（常为带活页环的）文件夹/活页夹，用来装订并整理散页文件。"},"examples":[{"en":"Keep your class notes in a binder so you don’t lose them.","zh":"把课堂笔记放在活页夹里，这样就不容易弄丢。"},{"en":"She opened her binder and pulled out the report.","zh":"她打开文件夹，抽出那份报告。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or thing that ties, fastens, or holds things together.","zh":"捆绑者；把东西系在一起的物品（如绑带、装订材料等）。"},"examples":[{"en":"This tape works as a binder for the cables.","zh":"这卷胶带可以把电缆捆在一起。"},{"en":"In cooking, eggs can act as a binder in meatballs.","zh":"在烹饪中，鸡蛋可以在肉丸里起到黏合作用。"}]}],"synonyms":["folder","ring binder","notebook (for a binder used like one)","fastener","binding agent"],"phonetic":"/ˈbaɪndɚ/","extraExplanation":["在办公/学习语境里，binder 最常指“活页夹（ring binder）”。英式英语里也常用 binder；美式英语中也会说 three-ring binder（常见的三孔活页夹）。","在材料/化学或食品语境里，binder 表示“黏合剂/结合剂”，指让颗粒或成分更容易粘在一起的物质。"]}
{"word":"binderies","summary":{"en":"Binderies are places (or the business) where printed pages are bound into books.","zh":"Binderies 指装订书籍的场所，或装订行业/业务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a workshop or small factory where books (or printed pages) are bound into finished volumes","zh":"装订厂；装订作坊（把印好的纸张装订成书）"},"examples":[{"en":"After printing, the pages are sent to binderies to be made into books.","zh":"印刷完成后，书页会送到装订厂装订成书。"},{"en":"The old city had several small binderies that repaired and rebound damaged books.","zh":"这座老城里有几家小装订作坊，专门修复并重新装订破损的书。"}]},{"partOfSpeech":"n.","definition":{"en":"the business or industry of binding books","zh":"装订业；装订业务"},"examples":[{"en":"She works in binderies and printing, mainly handling custom orders.","zh":"她从事装订和印刷相关工作，主要处理定制订单。"}]}],"synonyms":["bookbindery","binding shop","bookbinding"],"phonetic":"/ˈbaɪn.də.ri/","extraExplanation":["“bindery”是“bind（装订）+ -ery（表示场所/行业的后缀）”构成的名词。复数是“binderies”。在出版流程中，bindery通常指印刷之后的“后道工序（post-press）”，包括折页、配页、装订、裁切、压痕等。"]}
{"word":"binders","summary":{"en":"“Binders” usually means folders (often ring binders) for organizing papers; it can also mean something that binds or a clothing edge strip (less common).","zh":"“Binders”通常指用来整理纸张的活页夹/文件夹；也可指捆绑物或（较少见的）服装包边条。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cover (often with rings) used to hold and organize loose sheets of paper.","zh":"（常带活页环的）文件夹/活页夹，用来装订并整理散页纸张。"},"examples":[{"en":"I keep my class notes in a binder.","zh":"我把课堂笔记放在一个活页夹里。"},{"en":"Please put these handouts into the blue binder.","zh":"请把这些讲义放进蓝色文件夹里。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or thing that binds or ties things together; in clothing, a strip of fabric used to finish an edge (less common).","zh":"捆绑者/连接物；（服装）包边条（较少见）。"},"examples":[{"en":"This tape acts as a binder to hold the pages together.","zh":"这条胶带起到“粘合/固定”的作用，把纸张固定在一起。"},{"en":"The tailor used a binder along the edge of the fabric.","zh":"裁缝在布料边缘用了包边条。"}]}],"synonyms":["folders","ring binders","file binders","organizers"],"phonetic":"/ˈbaɪndɚ/","extraExplanation":["“Binder”来自动词 bind（捆绑、装订、约束）。在美式英语里，binder最常指“三孔活页夹（three-ring binder）”，是学校和办公室里非常常见的用品。","“Binders”是复数形式；单数是 binder。口语里也常直接说：a binder / three-ring binder。"]}
{"word":"bindery","summary":{"en":"A bindery is a place where books are bound or repaired, or the business of bookbinding.","zh":"bindery 指装订书籍的作坊/工厂，也可指装订业（书籍装订这一行）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place (shop or workshop) where books are bound or repaired","zh":"装订作坊；装订厂（给书装订或修补的地方）"},"examples":[{"en":"The old manuscripts were sent to a bindery for restoration and rebinding.","zh":"这些旧手稿被送到装订厂进行修复和重新装订。"},{"en":"She worked at a small bindery that specialized in handmade journals.","zh":"她在一家专做手工日记本的小型装订作坊工作。"}]},{"partOfSpeech":"n.","definition":{"en":"the business or trade of binding books","zh":"装订业；书籍装订这一行当"},"examples":[{"en":"He studied printing and then went into bindery.","zh":"他学习印刷，后来进入装订行业。"}]}],"synonyms":["bookbindery","bookbinding shop","binding workshop"],"phonetic":"/ˈbaɪndəri/","extraExplanation":["“bindery”来自“bind（装订、捆绑）+ -ery（表示场所或行业的后缀）”，常见于出版、印刷、图书馆修复等语境。","在北美，“bindery”既可指“装订车间/工厂”，也可泛指“装订业务”；更口语的说法有时会用“bookbinding shop”。"]}
{"word":"bindheimite","summary":{"en":"Bindheimite is a yellow-brown secondary mineral (lead antimonate) formed by oxidation of antimony/lead ores.","zh":"Bindheimite 是一种黄褐色的次生矿物（锑酸铅），多由含锑/含铅矿石氧化风化形成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a yellow to brown secondary mineral (a lead antimonate) that forms when antimony- and lead-bearing ores oxidize, often found as earthy or crusty coatings in old mine workings. Example: “Bindheimite can appear as a yellowish coating on weathered ore.” / “Bindheimite 可能以黄色涂层的形式出现在风化矿石表面。”","zh":"（矿物）黄褐色的次生矿物，主要为“锑酸铅”（含铅与锑的氧化物/含氢氧化物），常由含锑、含铅的矿石在氧化风化条件下形成，常见于旧矿区裂隙或矿石表面的土状、壳状覆盖物。例：Bindheimite 常呈黄色薄壳覆盖在风化矿石上。/ Bindheimite can appear as a yellowish coating on weathered ore."},"examples":[{"en":"Bindheimite is often identified in the oxidized zone of antimony deposits.","zh":"在锑矿床的氧化带中常可鉴定出 bindheimite。"},{"en":"The sample shows a brownish, earthy crust typical of bindheimite.","zh":"这份标本呈现出 bindheimite 典型的褐色土状壳层。"}]}],"synonyms":["lead antimonate"],"phonetic":"/ˈbɪndˌhaɪˌmaɪt/","extraExplanation":["发音与词源提示：bindheimite 常读作 “BIND-hy-mite”，词尾 -ite 是矿物名称中非常常见的后缀（表示“某某矿物”）。","学习用法：这是一个专业矿物学名词，日常英语中很少用；常见搭配包括 oxidized zone（氧化带）、secondary mineral（次生矿物）、crust/coating（壳层/涂层）。"]}
{"word":"bindi","summary":{"en":"A decorative (and sometimes culturally/religiously meaningful) forehead mark worn especially in South Asia.","zh":"南亚常见的额头装饰点/贴饰，有时带有文化或宗教意义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small decorative mark (often a dot or sticker) worn on the forehead, especially by Hindu women in South Asia; it can be a fashion accessory or a symbol with religious, cultural, or marital meaning depending on region and tradition.","zh":"（常为点状或贴纸的）额饰/额点，常见于南亚（尤其印度）文化中，常由印度教女性佩戴；既可作装饰，也可能具有宗教、文化或婚姻身份等含义（因地区与传统而异）。"},"examples":[{"en":"She wore a red bindi in the center of her forehead during the festival.","zh":"节日期间，她在额头中央贴了一颗红色的额点。"},{"en":"In some families, the bindi has religious meaning, not just a fashion look.","zh":"在一些家庭里，额点有宗教含义，不只是时尚装饰。"}]}],"synonyms":["forehead dot","forehead mark"],"phonetic":"ˈbɪndi","extraExplanation":["“bindi”来自梵语“bindu（点、滴）”。不同地区习俗差异很大：有的地方与宗教仪式有关，有的与婚姻状态或身份象征有关，也常作为日常装饰或节庆装扮。","跨文化使用时要注意语境：在宗教场合或传统仪式中，它可能具有庄重意义；若在不相关的派对、舞台造型中随意使用，有时会被认为是文化挪用。较稳妥的做法是了解其含义、尊重场合，并向相关文化背景的人请教。"]}
{"word":"binding","summary":{"en":"Binding most commonly means “legally/officially required (must be obeyed)” and also refers to the cover/material that holds a book together.","zh":"Binding 最常见指“具有法律/官方约束力、必须遵守的”，也可指“书的装订/封面材料”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) required by law, agreement, or rules; having official force and must be obeyed","zh":"（形容词）具有法律或契约效力的；必须遵守的；有约束力的"},"examples":[{"en":"The contract is binding once both sides sign it.","zh":"双方一旦签字，这份合同就具有约束力。"},{"en":"This decision is binding on all members of the organization.","zh":"这个决定对该组织所有成员都有约束力。"}]},{"partOfSpeech":"n.","definition":{"en":"(n.) a cover or material that holds pages together, especially on a book","zh":"（名词）（书的）装订；书皮；装订材料"},"examples":[{"en":"The book has a leather binding.","zh":"这本书是皮革装订的。"},{"en":"The binding is coming loose at the spine.","zh":"书脊处的装订开始松了。"}]},{"partOfSpeech":"n.","definition":{"en":"(n.) something that ties, fastens, or holds things together","zh":"（名词）捆绑物；系带；固定用的东西"},"examples":[{"en":"Use a strong binding to keep the package secure.","zh":"用结实的捆绑物把包裹固定好。"},{"en":"The binding on the snowboard needs to be tightened.","zh":"滑雪板的固定器需要拧紧。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adj.) tying or holding things tightly; restricting movement (often in the phrase “binding around/on”)","zh":"（形容词）勒紧的；束缚活动的（常见于“binding around/on”）"},"examples":[{"en":"These shoes feel binding around my toes.","zh":"这双鞋在脚趾处有点勒。"},{"en":"Avoid clothes that are binding at the waist.","zh":"避免穿腰部勒得太紧的衣服。"}]}],"synonyms":["obligatory","enforceable","mandatory","book cover","fastening","tie"],"phonetic":"/ˈbaɪndɪŋ/","extraExplanation":["“binding”来自动词 bind（捆、绑、约束）。在法律/商务英语里，binding 最常见的意思是“有法律效力的、必须履行的”，常见搭配有 binding contract（具有约束力的合同）、binding agreement（有约束力的协议）、legally binding（具有法律约束力的）。","在出版领域，binding 指“装订”，相关词有 hardcover binding（精装装订）、paperback binding（平装装订）、bookbinding（书籍装订这门工艺/行业）。"]}
{"word":"bindingly","summary":{"en":"Bindingly means ‘in a way that is obligatory or enforceable,’ especially in legal or official contexts.","zh":"Bindingly 表示“以具有约束力、必须遵守/可强制执行的方式”，多用于法律或正式语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that creates a firm obligation (especially legal or official); required, not optional","zh":"以具有约束力的方式（尤指法律或正式层面）；必须遵守的、非可选的"},"examples":[{"en":"The agreement is bindingly enforceable under state law.","zh":"该协议在州法律下具有可强制执行的约束力。"},{"en":"The court said the promise was bindingly made and could not be withdrawn.","zh":"法院表示该承诺具有约束力，不得撤回。"},{"en":"The rules apply bindingly to all members of the organization.","zh":"这些规则对该组织的所有成员都具有约束力。"}]},{"partOfSpeech":"adv.","definition":{"en":"in a way that strongly commits someone (morally or personally)","zh":"以强烈约束（道德上或个人承诺上）的方式；使人必须负责/履行"},"examples":[{"en":"She spoke bindingly, as if everyone had already agreed.","zh":"她说得很有“定论感”，仿佛大家都已同意。"},{"en":"He pledged bindingly to support the team through the crisis.","zh":"他作出强有力的承诺，要在危机中支持团队。"}]}],"synonyms":["obligatorily","compulsorily","authoritatively","irrevocably","with legal force"],"phonetic":"/ˈbaɪndɪŋli/","extraExplanation":["“bindingly”来自形容词“binding（有约束力的）”，常见于法律/合同语境，如“binding contract（具有法律约束力的合同）”“legally binding（具有法律效力的）”。在日常英语中更常说“legally binding”或“binding”，而“bindingly”相对偏正式、书面。"]}
{"word":"bindingness","summary":{"en":"Bindingness means the degree to which something is binding—especially legally enforceable—or how strongly it obligates someone.","zh":"Bindingness 指“约束力”的程度，尤其是法律上的可强制执行性，也可指某事对人的义务/约束强度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or degree of being legally enforceable (how much a rule, contract, or decision must be obeyed by law)","zh":"（法律上）具有约束力的性质或程度（某项规则、合同或决定在法律上必须遵守、可被强制执行的程度）"},"examples":[{"en":"The court discussed the bindingness of the agreement before enforcing it.","zh":"法院在强制执行之前讨论了该协议的法律约束力。"},{"en":"Different countries may disagree about the bindingness of an international resolution.","zh":"不同国家可能会对某项国际决议是否具有法律约束力产生分歧。"}]},{"partOfSpeech":"n.","definition":{"en":"the strength of an obligation or commitment (how strongly something ‘binds’ you to act a certain way)","zh":"义务或承诺的强度（某件事在道德、制度或关系上“约束”你按某种方式行动的力度）"},"examples":[{"en":"The policy’s bindingness depends on how clearly it is written and enforced.","zh":"该政策的约束力度取决于它写得是否清晰以及执行是否到位。"},{"en":"They questioned the bindingness of his promise after he broke it once before.","zh":"在他以前曾失信一次后，他们质疑他的承诺到底有多大约束力。"}]}],"synonyms":["enforceability","legal force","obligatory force","binding nature"],"phonetic":"/ˈbaɪndɪŋnəs/","extraExplanation":["“bindingness”并不是日常英语里非常常见的词，更常见的表达是：the binding nature of…, legal force, enforceability, how binding something is。","常见搭配：bindingness of a contract/decision/ruling（合同/决定/裁决的约束力）。在法律或学术写作中会更常见。"]}
{"word":"bindings","summary":{"en":"“Bindings” usually means book covers/fastenings, or figuratively restrictions, and can also mean sewing edge strips.","zh":"bindings 通常指书籍装订/固定物；也可引申为束缚与限制；在缝纫中还可指包边条。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Fastenings or coverings that hold something together; especially the cover of a book (its binding).","zh":"用来固定或包住某物的装订物/固定物；尤指书的装订（书皮、装订方式）。"},"examples":[{"en":"The old dictionary has leather bindings.","zh":"那本旧词典是皮革装帧。"},{"en":"These bindings keep the papers from falling apart.","zh":"这些装订物防止纸张散开。"}]},{"partOfSpeech":"n.","definition":{"en":"Restrictions or limits; things that “tie you down,” such as rules, promises, or social pressures.","zh":"束缚、限制；让人“被绑住”的规则、承诺或社会压力等。"},"examples":[{"en":"She wanted freedom from the bindings of tradition.","zh":"她想摆脱传统的束缚。"},{"en":"He felt the bindings of a strict contract.","zh":"他感到严格合同带来的约束。"}]},{"partOfSpeech":"n.","definition":{"en":"Strips of fabric or tape used to finish or strengthen edges, especially in sewing.","zh":"（缝纫用）包边条/滚边带，用来收边或加固边缘。"},"examples":[{"en":"Sew the bindings around the quilt’s edges.","zh":"把包边条缝在被子的边缘上。"},{"en":"The jacket’s bindings are coming loose.","zh":"这件夹克的包边开始松了。"}]}],"synonyms":["covers","fastenings","bookbinding","constraints","restrictions","ties","obligations","edging","trim"],"phonetic":"ˈbaɪndɪŋz","extraExplanation":["“bindings”常是“binding”的复数形式：在书籍语境里非常常见（hardcover binding 精装，paperback binding 平装）。在抽象意义上，它和 tie / constraint 的意象相近，强调“被捆住”的感觉。缝纫语境里也常用，指包边布条或包边带。"]}
{"word":"bindis","summary":{"en":"Bindis are forehead dots/ornaments; the plural of bindi.","zh":"Bindis 指额头上的点状装饰，是 bindi 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of bindi: small decorative dots or marks worn on the forehead (especially by women in South Asia), sometimes with religious, cultural, or fashion meaning.","zh":"bindi 的复数：贴在额头上的小圆点或装饰（在南亚地区尤常见，尤其是女性），可能具有宗教、文化或时尚含义。"},"examples":[{"en":"She bought a pack of colorful bindis to match her outfits.","zh":"她买了一包彩色的 bindis，用来搭配不同的衣服。"},{"en":"At the festival, many people wore bindis as part of traditional dress.","zh":"在节日里，很多人把 bindis 作为传统服饰的一部分来佩戴。"}]}],"synonyms":["forehead dot","forehead ornament","bindi (singular)"],"phonetic":"/ˈbɪndiz/","extraExplanation":["“Bindi”源自梵语，常与“眉心/额头中央”的点饰相关。在一些传统语境中，它可能与宗教信仰、婚姻状态或仪式有关；在更日常或现代语境中，也可能仅作为装饰或时尚配件。","使用这个词时，最好尊重其文化背景：在某些场合，随意佩戴或把它当作“异国风装扮”可能会让部分人感到不被尊重；如果是在文化活动、受邀请的庆典或了解其意义的前提下使用，会更得体。"]}
{"word":"bindle","summary":{"en":"A bindle is a small bundle of belongings wrapped in cloth, often carried on a stick over the shoulder (a classic old-American image).","zh":"bindle 指用布包成的小包袱，常用棍子扛在肩上（带有旧时美国流浪者/旅行者的典型意象）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small bundle of belongings (often clothes or food) tied up in a cloth and carried on a stick over the shoulder, traditionally associated with travelers or homeless people (especially in old American imagery).","zh":"（用布包起来并系在棍子上扛在肩上的）小包袱；（旧时美国意象中常与流浪者/无家可归者相关的）行囊。"},"examples":[{"en":"In old photos, you sometimes see a worker carrying a bindle over his shoulder.","zh":"在一些老照片里，你有时会看到工人把包袱（bindle）扛在肩上。"},{"en":"He packed his clothes into a bindle and left town looking for work.","zh":"他把衣服包成一个包袱（bindle），离开小镇去找工作。"}]}],"synonyms":["bundle","pack","roll (of belongings)","hobo bundle"],"phonetic":"/ˈbɪn.dəl/","extraExplanation":["这个词在现代日常口语里不算常用，更多出现在历史语境、文学作品或复古的美国形象中，常让人联想到“大萧条时期”的流浪汉（hobo）形象。","相关词：bindle stick 指“挑包袱的棍子”；也有人用 bindle（俚语）指毒品的小包（尤其是海洛因），但这种用法更具场景限制，阅读时要看上下文。"]}
{"word":"bindles","summary":{"en":"Bindles is the plural of bindle: a small cloth-wrapped bundle of belongings, and in US slang, a small wrapped packet (often drugs).","zh":"bindles 是 bindle 的复数：指用布包起的行囊/小包袱；在美式俚语中也可指小包裹，尤指小包毒品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small bundle of belongings wrapped in cloth (often tied to a stick) for carrying, especially associated with a traveler or hobo","zh":"（用布包起、常绑在棍子上的）小包袱；行囊（常与流浪汉/漂泊者形象相关）"},"examples":[{"en":"In old movies, the hobo carries a bindle on a stick over his shoulder.","zh":"在老电影里，流浪汉常把包袱绑在棍子上扛在肩上。"},{"en":"She packed a quick bindle of clothes before leaving town.","zh":"她离开小镇前匆匆收拾了一个装着衣服的小包袱。"}]},{"partOfSpeech":"n.","definition":{"en":"(US slang) a small, wrapped packet, especially a small packet of drugs","zh":"（美式俚语）小包裹；（尤指）小包毒品"},"examples":[{"en":"The report mentioned several bindles of narcotics.","zh":"报告提到发现了几包毒品。"},{"en":"Police recovered bindles containing a white powder.","zh":"警方找回了几包装着白色粉末的小包。"}]}],"synonyms":["bundle","pack","roll","parcel","packet"],"phonetic":"/ˈbɪndəl/","extraExplanation":["“bindle”常让人联想到20世纪美国的“hobo”（随季节或工作机会漂泊的流浪工人）形象：把东西用布一包、打结后绑在木棍上，便于长途步行携带。这种画面在漫画、海报和老电影里很常见。","复数形式是“bindles”。虽然现代日常口语里不算高频，但在描述复古场景、文学叙事或新闻（尤其涉毒报道）中仍会出现。"]}
{"word":"bindlet","summary":{"en":"Bindlet means a small tied bundle, especially of sticks or straw.","zh":"bindlet 指一小捆扎起来的东西，尤指柴枝或稻草。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small bundle of sticks, straw, or similar material tied together","zh":"（用绳等）捆起来的一小捆柴、稻草或类似材料"},"examples":[{"en":"He carried a bindlet of dry sticks back to the campfire.","zh":"他抱着一小捆干树枝回到营火旁。"},{"en":"The farmer stacked bindlets of straw in the barn.","zh":"农夫把一小捆一小捆的稻草堆在谷仓里。"}]}],"synonyms":["bundle","sheaf","fagot (bundle of sticks; archaic)"],"phonetic":"/ˈbaɪnd.lət/","extraExplanation":["“Bindlet”在现代英语中较少见，带有古旧或方言色彩；在较老的英国文学/乡村题材文字里更可能出现。","词形上可理解为 bind（捆绑）+ -let（表示“小”的后缀），字面意思就是“小捆”。注意它通常指可搬动、用绳扎起的那种小束。"]}
{"word":"Bindman","summary":{"en":"Bindman is a rare word meaning someone who binds things (especially books) or, in older/dialect use, a worker who ties grain into sheaves; it is also a surname.","zh":"Bindman 是个少见词，指负责装订/捆扎的人（尤指装订书籍的人），或在旧式/方言用法中指把谷物捆成禾捆的农工；也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/old-fashioned) A person whose job is to bind things together, especially a bookbinder.","zh":"（少见/旧式）把东西装订或捆扎在一起的人，尤指装订书籍的人（装订工/装帧工）。"},"examples":[{"en":"In the old shop, a bindman stitched pages into leather covers by hand.","zh":"在那家老店里，一位装订工用手工把书页缝进皮革封面里。"},{"en":"She apprenticed with a bindman to learn traditional bookbinding.","zh":"她跟一位装订师傅当学徒，学习传统装订技术。"}]},{"partOfSpeech":"n.","definition":{"en":"(Dialect/old use) A farm worker who binds cut grain into sheaves during harvest.","zh":"（方言/旧用法）收割时把割下的谷物捆成禾捆的农工。"},"examples":[{"en":"During harvest, the bindman followed behind the reapers and tied the sheaves.","zh":"收割季里，捆扎工跟在收割者后面，把谷物捆成一捆捆的。"}]},{"partOfSpeech":"other","definition":{"en":"A family name (surname).","zh":"姓氏：Bindman（人名）。"},"examples":[{"en":"Ms. Bindman will contact you about the appointment.","zh":"Bindman 女士会就预约事宜联系你。"}]}],"synonyms":["bookbinder","binder"],"phonetic":"/ˈbaɪndmən/","extraExplanation":["“bindman”在现代英语里非常少见，更常见的是“bookbinder（装订工）”。","不要与“bondman（债奴/被束缚的人）”混淆；两者拼写和发音相近，但含义不同。"]}
{"word":"bindoree","summary":{"en":"“bindoree” is not a common English word; it is likely a proper name or a misspelling of a similar word.","zh":"“bindoree”不是常见英语词汇；更可能是专有名词或相近词的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English vocabulary word; it is most likely a proper name (for example, a place name, family name, farm/estate name, or brand).","zh":"不是常见的标准英语词汇；更可能是专有名词（例如地名、姓氏、农场/庄园名或品牌名）。"},"examples":[{"en":"I couldn’t find a dictionary meaning for “bindoree,” so it may be a name used in a specific region.","zh":"我在词典里找不到“bindoree”的常规定义，所以它可能是某个地区或场景下使用的名称。"},{"en":"Do you mean “bindery” (a place where books are bound) or “Bindaree” (a place name)?","zh":"你是不是想写“bindery”（装订车间/装订厂）或“Bindaree”（一个地名）？"}]}],"phonetic":"/bɪnˈdɔːri/","extraExplanation":["“bindoree”在通用英语语料中非常少见，常见情况是：拼写误差（例如把 bindery 写成 bindoree）、或来自某个地名/人名/机构名的专有名词用法。","如果你能提供一句原文（它出现的句子/上下文）或告诉我它来自哪个国家、书名/网站/地址，我可以更准确判断它的词性、读音与含义。"]}
{"word":"binds","summary":{"en":"“Binds” usually means “ties/fastens” or “legally/morally obligates” (as the third-person singular of bind), and it can also mean “difficult situations” (plural noun).","zh":"“Binds”通常是动词（bind 的第三人称单数），表示“捆绑/系紧”或“约束/使承担义务”；也可作名词复数，表示“困境、左右为难的处境”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"third-person singular of “bind”: to tie or fasten something, often with rope, tape, or a band","zh":"“bind”的第三人称单数：把某物捆住、系紧（常用绳子、胶带或带子）"},"examples":[{"en":"She binds the package with string so it won’t open.","zh":"她用细绳把包裹捆好，这样就不会散开。"},{"en":"The nurse binds the wound to keep it clean.","zh":"护士把伤口包扎起来，以保持清洁。"}]},{"partOfSpeech":"v.","definition":{"en":"third-person singular of “bind”: to limit or force someone to follow a rule, promise, or agreement","zh":"“bind”的第三人称单数：使（人）受到规则、承诺或协议的约束"},"examples":[{"en":"The contract binds both sides to the same deadline.","zh":"合同约束双方都必须遵守同一个截止日期。"},{"en":"A promise binds him to help his team.","zh":"一个承诺让他必须去帮助团队。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of “bind”: situations where choices are difficult because every option has a problem","zh":"“bind”的复数：左右为难的处境（每个选择都有问题）"},"examples":[{"en":"We’re in a bind: we need to leave now, but the train is delayed.","zh":"我们进退两难：得马上走，但火车晚点了。"},{"en":"Money problems put them in binds again and again.","zh":"经济问题让他们一次又一次陷入困境。"}]}],"synonyms":["ties","fastens","secures","restrains","obligates"],"phonetic":"/baɪndz/","extraExplanation":["“bind”的常见变化：bind（原形）→ binds（第三人称单数/名词复数）→ bound（过去式/过去分词）→ binding（现在分词/形容词，表示“有约束力的”）。","固定搭配：in a bind 表示“陷入困境、左右为难”，很口语、很常用。"]}
{"word":"bindweb","summary":{"en":"“Bindweb” is usually a name or an uncommon phrase; it most often relates to “bind” + “web(webbing)” (to secure with straps/netting) or to a specific brand/service.","zh":"“Bindweb”多为名称或不常见组合；常见理解是“bind（捆绑）+ web/webbing（织带/网）”，即用织带/网固定，或指某个具体品牌/服务。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Not a standard dictionary word) Used as a two-word phrase “bind web,” meaning to tie/fasten something with webbing (a strong woven strap) or to secure something using a net-like material.","zh":"（非标准词）常见写法是两个词“bind web”，可指用织带（结实的编织带）捆绑/固定，或用网状材料把物品固定住。"},"examples":[{"en":"Use the bind web to secure the cargo so it doesn’t move during transport.","zh":"用这条（捆绑）织带把货物固定好，运输时才不会移动。"},{"en":"The technician bound the cables with a webbing strap to keep them tidy.","zh":"技术员用织带把电缆捆起来，让它们更整齐。"}]},{"partOfSpeech":"other","definition":{"en":"A name/handle/brand written as one word (Bindweb); meaning depends on the specific website, app, or company using it.","zh":"作为一个连写的名称/账号/品牌（Bindweb）；具体含义取决于对应的网站、应用或公司。"},"examples":[{"en":"I found the tutorial on Bindweb’s site, but the pricing page wasn’t clear.","zh":"我在 Bindweb 的网站上找到了教程，但价格页面不太清楚。"},{"en":"Search “Bindweb” with the company name to make sure you’re looking at the right service.","zh":"把“Bindweb”和公司名一起搜索，确保你找的是同一个服务。"}]}],"synonyms":["webbing strap","tie down","secure","fasten"],"phonetic":"/baɪnd wɛb/","extraExplanation":["“bindweb”不是常见英语词汇，很多时候是人名/网名/项目名的拼写。如果你是在技术语境里看到它，可能原本想表达的是：\n- web binding（网页/前端中的“绑定”，如数据绑定 data binding）\n- bind to the web（把某个服务/域名/账号与网站关联）\n如果你能提供一句原文或链接所在领域（如前端开发、物流捆绑、书籍装订等），我可以给出更准确的释义与更自然的表达。"]}
{"word":"bindweed","summary":{"en":"Bindweed is a fast-spreading, twining vine plant—often a troublesome weed in gardens.","zh":"Bindweed 指一种蔓生缠绕、扩散很快的植物，常被当作花园里难治理的杂草。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a climbing plant with twining stems and trumpet-shaped flowers that can spread quickly and choke other plants; often considered a weed","zh":"旋花属蔓生植物，茎会缠绕攀爬，常开喇叭状花；蔓延很快，常被视为杂草，会“缠住、压制”其他植物"},"examples":[{"en":"Bindweed wrapped itself around the fence and the tomato plants.","zh":"旋花缠绕在篱笆和番茄植株上。"},{"en":"The gardener spent the afternoon pulling out bindweed from the flower beds.","zh":"园丁花了一下午把花坛里的旋花拔掉。"},{"en":"If you leave bindweed alone, it can take over the whole garden.","zh":"如果放任旋花不管，它可能会占满整个花园。"}]}],"synonyms":["morning glory (related)","convolvulus"],"phonetic":"/ˈbaɪndˌwid/","extraExplanation":["“bindweed”由 bind（捆、缠）+ weed（杂草）组成，名字形象地描述了它会缠绕其他植物、让它们难以生长。","在园艺语境中，bindweed 常指 field bindweed（田旋花，Convolvulus arvensis）或 hedge bindweed（篱旋花，Calystegia sepium）。它们都有顽强的根系，拔除时往往需要反复处理。"]}
{"word":"bindweed-related","summary":{"en":"Bindweed-related means connected with bindweed, or (figuratively) something that spreads or tangles like bindweed.","zh":"bindweed-related 指与旋花有关的；也可比喻像旋花一样蔓延或纠缠的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with bindweed (a fast-growing, twining vine that can choke other plants), especially in gardening, farming, or plant science.","zh":"与旋花（蔓生、缠绕性强、常会缠住并影响其他植物的藤本杂草）有关的；尤用于园艺、农业或植物学语境。"},"examples":[{"en":"The farmer focused on bindweed-related problems in the cornfield.","zh":"农民把注意力放在玉米地里与旋花相关的问题上。"},{"en":"We used a new method to reduce bindweed-related crop losses.","zh":"我们用了新方法来减少旋花导致的作物损失。"},{"en":"The report explains bindweed-related risks to native plants.","zh":"这份报告解释了旋花对本土植物带来的相关风险。"}]},{"partOfSpeech":"adj.","definition":{"en":"Resembling bindweed or its behavior (spreading, winding, tangling), sometimes used figuratively.","zh":"像旋花一样的；（常比喻）蔓延、缠绕、纠结不清的。"},"examples":[{"en":"The story has a bindweed-related plot that keeps twisting around past secrets.","zh":"这个故事的情节像旋花一样纠缠，不断绕回过去的秘密。"},{"en":"They faced bindweed-related bureaucracy that tangled every simple request.","zh":"他们遇到像旋花一样纠结的官僚程序，把简单的请求都弄得很复杂。"}]}],"synonyms":["bindweed-associated","bindweed-linked","bindweed-connected","Convolvulus-related","weed-related"],"phonetic":"/ˈbaɪndˌwiːd rɪˈleɪtɪd/","extraExplanation":["“bindweed”常指田旋花/篱旋花等杂草类藤本植物，特点是缠绕生长、根系顽强，容易在园艺与农田里造成麻烦。因此“bindweed-related”在学术或实用写作中多见于杂草管理（weed control）、生态影响（ecological impact）等话题。"]}
{"word":"bindweeds","summary":{"en":"Bindweeds are fast-spreading twining plants often treated as troublesome weeds.","zh":"Bindweeds 指生长迅速、会缠绕蔓延的旋花类植物，常被当作难除的杂草。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bindweeds (plural): climbing or creeping plants with twining stems, often with trumpet-shaped flowers; many types spread quickly and are considered weeds in gardens and farms.","zh":"旋花（复数）：一种蔓生或匍匐生长、茎会缠绕攀援的植物，常开喇叭状花；许多种类繁殖快，在花园和农田里常被视为杂草。"},"examples":[{"en":"Bindweeds wrapped around the fence and climbed into the vegetable bed.","zh":"旋花缠绕着篱笆，爬进了菜畦里。"},{"en":"The farmer spent hours pulling bindweeds from the field.","zh":"农夫花了好几个小时从田里拔除旋花。"},{"en":"Bindweeds can look pretty, but they easily choke other plants.","zh":"旋花看起来很漂亮，但很容易“勒住”并压制其他植物。"}]}],"synonyms":["bindweed","wild morning glory","creeping vine","invasive weed"],"phonetic":"/ˈbaɪndˌwiːd/","extraExplanation":["“bindweed”由 bind（捆绑、缠绕）+ weed（杂草）组成，形象地描述它会缠住其他植物的生长方式。","常见的“bindweed”多指旋花科植物，外形容易与牵牛花（morning glory）混淆；园艺语境里通常强调它的“侵入性/难清除”。"]}
{"word":"bindwith","summary":{"en":"“Bind with” means to fasten something using another thing, or to connect things/people closely; in computing, it often means to link or attach (bind) components so they work together.","zh":"“Bind with”可表示“用某物把……捆/绑住”，也可表示“使紧密联系”；在计算机语境中常指“绑定/链接/关联”，让组件协同工作。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to tie or fasten something using another thing (such as rope, tape, or a bandage)","zh":"用另一种东西（如绳子、胶带、绷带等）把某物捆住或绑牢"},"examples":[{"en":"Bind the boxes with tape so they won’t open during shipping.","zh":"用胶带把箱子封好，这样运输过程中就不会打开。"},{"en":"The nurse bound the wound with a clean bandage.","zh":"护士用干净的绷带包扎了伤口。"}]},{"partOfSpeech":"phrase","definition":{"en":"to connect or associate someone or something closely (often in an abstract or emotional way)","zh":"使某人或某事紧密联系在一起（常指抽象或情感上的联系）"},"examples":[{"en":"Shared experiences can bind people with strong friendships.","zh":"共同经历能让人们建立起牢固的友谊。"},{"en":"Culture and language bind a community with a sense of identity.","zh":"文化和语言让一个群体与身份认同紧密相连。"}]},{"partOfSpeech":"phrase","definition":{"en":"(computing) to link a program or function to a library/module or to attach a value/handler to something so it works together","zh":"（计算机）将程序/函数与库或模块链接；或把某个值/处理函数绑定到对象上，使其协同工作"},"examples":[{"en":"You need to bind the app with the correct library before it will run.","zh":"你需要把应用与正确的库链接起来，它才能运行。"},{"en":"In many frameworks, you bind a button with a click event handler.","zh":"在很多框架里，你会把按钮与点击事件处理函数进行绑定。"}]}],"synonyms":["tie with","fasten with","secure with","link with","connect with","associate with"],"phonetic":"/baɪnd wɪð/","extraExplanation":["“bindwith”更常见的写法是分开写作“bind with”。在日常英语里常用于“bind A with B”（用B把A捆/绑起来），或“be bound with”（与……紧密相关）。","在编程语境中，“bind”非常常见，意思接近“绑定/关联/链接”，具体含义会因语言或框架而不同（例如绑定事件、绑定变量、链接库）。"]}
{"word":"bindwood","summary":{"en":"Bindwood is an uncommon word meaning flexible wood used for tying, and it can also be a folk name for the wayfaring tree (Viburnum lantana).","zh":"Bindwood 是较少见的词，指可用来捆绑的柔韧木枝/木料，也可作某些灌木的俗名，尤指旅人树（Viburnum lantana）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flexible type of wood (or a twig/rod of such wood) traditionally used for tying, binding, or making hoops and simple woven items","zh":"（可弯曲的）捆绑木材；指过去常用来绑扎、扎篱笆、做箍或简易编织物的枝条/木料"},"examples":[{"en":"They cut thin bindwood rods to tie the fence together.","zh":"他们砍了些细的捆绑木枝，用来把篱笆固定在一起。"},{"en":"In older rural crafts, bindwood was valued because it bends without snapping.","zh":"在较早的乡村手工艺里，捆绑木很受重视，因为它能弯而不断。"}]},{"partOfSpeech":"n.","definition":{"en":"a regional/old-fashioned name for certain shrubs or small trees with pliable branches, especially the wayfaring tree (Viburnum lantana) in British English","zh":"（地区性/旧称）某些枝条柔韧的灌木或小乔木的俗名，尤指英式英语中“旅人树/荚蒾”（wayfaring tree，Viburnum lantana）"},"examples":[{"en":"The hedgerow was full of bindwood and hawthorn.","zh":"树篱里长满了旅人树（bindwood）和山楂。"},{"en":"Some field guides list Viburnum lantana under the folk name bindwood.","zh":"一些野外植物图鉴会把 Viburnum lantana 记作民间名 bindwood。"}]}],"synonyms":["withy","osier (for flexible willow rods)","wayfaring tree"],"phonetic":"/ˈbaɪndˌwʊd/","extraExplanation":["“bindwood”由 bind（捆、绑）+ wood（木材）构成，属于较少见、带有民俗或地域色彩的词。含义常与“枝条柔韧、可用来绑扎”这一传统用途相关。","容易与更常见的“bindweed”（旋花/牵牛花一类的蔓生植物）混淆；两者拼写和发音相近，但指代不同。"]}
{"word":"bine","summary":{"en":"A bine is a climbing plant stem that grows by twisting around a support, especially the stems of hops.","zh":"bine 指会通过缠绕支撑物向上生长的蔓茎，尤指啤酒花的蔓茎。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long, flexible stem that climbs by winding (twisting) itself around a support (such as a pole or another plant)","zh":"（某些植物的）蔓茎；会靠缠绕支撑物向上生长的长而柔韧的茎"},"examples":[{"en":"Hops grow on bines that twist up tall strings.","zh":"啤酒花长在会沿着高绳子向上缠绕的蔓茎上。"},{"en":"The gardener trained the bine to climb the trellis.","zh":"园丁把蔓茎引导着爬上棚架。"}]},{"partOfSpeech":"n.","definition":{"en":"the climbing stems of the hop plant (used in brewing)","zh":"（尤指）啤酒花的蔓茎（与酿造啤酒相关的植物）"},"examples":[{"en":"By midsummer, the hop bines can reach several meters high.","zh":"到仲夏时，啤酒花的蔓茎能长到好几米高。"}]}],"synonyms":["climbing stem","vine (general term)"],"phonetic":"/baɪn/","extraExplanation":["“bine”常与“vine（藤）”对比：vine 多用卷须（tendrils）或吸盘攀爬；bine 则主要靠茎本身缠绕支撑物向上生长。","在英语里提到啤酒花（hops）时，经常用“hop bines”而不是“hop vines”，因为啤酒花的生长方式符合 bine 的特征。"]}
{"word":"binervate","summary":{"en":"A botanical adjective meaning “having two main veins/nerves,” usually describing a leaf.","zh":"植物学形容词，指“有两条主要叶脉/脉络”，多用来描述叶片。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having two main veins (or “nerves”), especially in a leaf.","zh":"（植物学）具二脉的；（尤指叶片）有两条主要叶脉/叶脉隆起。"},"examples":[{"en":"The plant’s leaves are binervate, with two strong veins running from the base.","zh":"这种植物的叶子是二脉的，从叶基部伸出两条明显的主脉。"},{"en":"In some species, binervate leaf venation helps with identification.","zh":"在一些物种中，二脉的叶脉特征有助于鉴别。"}]}],"synonyms":["two-nerved","two-veined","biveined"],"phonetic":"/baɪˈnɝveɪt/","extraExplanation":["“binervate”主要是植物学里的描述性术语，用来写形态特征（比如叶片叶脉）。词源上由前缀 bi-（“二、双”）+ nervate（“具脉的/具叶脉的”，与拉丁语 nervus “神经/脉络”有关）组成。","在日常英语里很少见；写作或阅读植物分类、野外图鉴、学术描述时更常遇到。也常见同义表达：two-nerved, two-veined。"]}
{"word":"bines","summary":{"en":"“Bines” is the plural of “bine,” meaning twining climbing stems (e.g., hops, beans).","zh":"“bines”是“bine”的复数，指会缠绕支架攀爬的植物茎（如啤酒花、豆类）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long, flexible climbing stem that wraps around a support (used of some plants such as hops and beans). Plural: bines.","zh":"（某些植物如啤酒花、豆类的）缠绕茎；会绕着支架旋转攀爬的长而柔韧的茎。复数：bines。"},"examples":[{"en":"Hop bines climb up strings in the field.","zh":"啤酒花的缠绕茎会沿着田里的绳子向上攀爬。"},{"en":"The bean plant sent out new bines after a week of warm weather.","zh":"天气转暖一周后，豆苗长出了新的缠绕茎。"}]}],"synonyms":["vines","twining stems","climbing stems"],"phonetic":"/baɪn/","extraExplanation":["“bine”和更常见的“vine（藤蔓）”很像，但在植物学上常用来强调“通过茎本身绕着支撑物缠上去”的攀爬方式（例如啤酒花、四季豆）；而不少“vine”则可能用卷须、吸盘或其他结构附着。日常英语里很多人会直接用“vine”泛指。","在啤酒酿造语境中，“hop bines（啤酒花缠绕茎）”是常见说法，因为啤酒花是重要的啤酒原料。"]}
{"word":"Binet","summary":{"en":"Binet usually refers to Alfred Binet, the French psychologist whose early intelligence test influenced modern IQ testing.","zh":"Binet 通常指法国心理学家阿尔弗雷德·比奈，他的早期智力测验对现代 IQ 测验影响很大。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(proper noun) Alfred Binet (1857–1911), a French psychologist best known for creating one of the first practical intelligence tests (the Binet–Simon scale), which helped shape modern IQ testing.","zh":"（专有名词）阿尔弗雷德·比奈（1857–1911），法国心理学家，以与西蒙共同开发早期实用的智力测验（比奈—西蒙量表）而闻名，对后来的 IQ 测验发展影响很大。"},"examples":[{"en":"Alfred Binet helped design an early test to identify children who needed extra support in school.","zh":"阿尔弗雷德·比奈帮助设计了一种早期测验，用来识别在学校需要额外支持的孩子。"},{"en":"The Binet–Simon test was an important step in the history of educational psychology.","zh":"比奈—西蒙测验是教育心理学史上的重要一步。"}]},{"partOfSpeech":"n.","definition":{"en":"(proper noun) A surname; in academic writing, it often refers to Binet’s work or the intelligence scale named after him.","zh":"（专有名词）姓氏；在学术写作中常指比奈的研究，或指以他命名的智力量表。"},"examples":[{"en":"The paper cites Binet (1905) as a foundational source.","zh":"论文将 Binet（1905）作为基础性来源引用。"},{"en":"Researchers discussed how Binet’s ideas influenced later testing methods.","zh":"研究者讨论了比奈的思想如何影响后来的测验方法。"}]}],"synonyms":["Alfred Binet","Binet–Simon (scale/test)"],"phonetic":"/biˈneɪ/","extraExplanation":["“Binet”常与“IQ（智商）”联系在一起，但比奈最初的目标并不是给孩子贴“聪明/不聪明”的标签，而是帮助学校更早发现需要学习支持的学生。后来 IQ 测验在不同国家和时代被用于多种目的（有时也被误用），因此在讨论这类话题时，常会强调：测验结果受教育机会、语言、文化背景等影响，不能代表一个人的全部能力。"]}
{"word":"Binetta","summary":{"en":"Binetta is most commonly used as a woman’s name; it can also be a surname.","zh":"Binetta 最常见是女性名字；也可能用作姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a feminine given name (proper noun), used especially in Italian-speaking contexts; often treated as a diminutive or variant of names like Benedetta (“blessed”).","zh":"女性名字（专有名词），在意大利语语境中较常见；常被视为 Benedetta（“受祝福的”）等名字的昵称或变体。"},"examples":[{"en":"Binetta is my classmate from Italy.","zh":"Binetta 是我来自意大利的同学。"},{"en":"We invited Binetta to speak at the event.","zh":"我们邀请 Binetta 在活动上发言。"}]},{"partOfSpeech":"other","definition":{"en":"a surname (family name) in some communities.","zh":"在一些地区也可用作姓氏。"},"examples":[{"en":"Dr. Binetta published a new study this year.","zh":"Binetta 医生今年发表了一项新研究。"}]}],"synonyms":["Benedetta","Benita","Annetta"],"phonetic":"/bɪˈnɛtə/","extraExplanation":["“Binetta”更多见于人名而不是普通词汇，因此在词典里通常归为专有名词。拼写和读音会因家庭语言与地区不同而略有变化。","如果你是在某本书、电影或品牌里看到 “Binetta”，也可能是作者/公司为角色或产品取的名字；这类用法一般不带固定“词义”，主要承载人物或文化背景。"]}
{"word":"Binette","summary":{"en":"Binette most commonly means a small gardening hoe; in Canadian French contexts it can also mean “face.”","zh":"Binette 最常见指园艺用的小锄头；在加拿大法语语境中也可指“脸/面孔”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small hoe used for weeding and loosening soil (a borrowing from French, mostly used in gardening contexts)","zh":"（园艺用语，源自法语）一种小锄头，用来除草、松土"},"examples":[{"en":"She used a binette to weed between the rows of lettuce.","zh":"她用一把小锄头在生菜行间除草。"},{"en":"A binette is handy for loosening soil around young plants.","zh":"小锄头很适合给幼苗周围的土壤松土。"}]},{"partOfSpeech":"n.","definition":{"en":"(Canadian French / informal, sometimes seen in English contexts) a face; a mug","zh":"（加拿大法语/口语，偶尔出现在英语语境）脸；面孔（带点调侃）"},"examples":[{"en":"He showed up with a big smile on his binette.","zh":"他带着一脸灿烂的笑容出现了。"},{"en":"In Québec, you might hear binette used to mean “face.”","zh":"在魁北克，你可能会听到 binette 用来表示“脸”。"}]}],"synonyms":["hoe","hand hoe","weeder","mug (face, informal)","face (informal)"],"phonetic":"/bɪˈnɛt/","extraExplanation":["“Binette”原本是法语词：在园艺里指一种用于除草、松土的小锄头；在加拿大法语（尤其魁北克口语）里也常指“脸/面孔”，语气有时略带戏谑（类似英语的 mug）。","在纯英语环境中，这个词相对少见；如果你在英语文章里看到，多半与园艺工具或法语/加拿大文化语境有关。"]}
{"word":"bineweed","summary":{"en":"Bineweed is a twining, climbing weed—often referring to bindweed—that can wrap around other plants and spread fast.","zh":"Bineweed 指会缠绕攀爬、蔓延很快的杂草，常用来指旋花类的 bindweed，会缠住其他植物影响生长。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a climbing or twining weed (a nuisance plant), especially one like bindweed that wraps around other plants and can choke them.","zh":"攀援或缠绕生长的杂草（常被视为有害杂草），尤指像旋花/田旋花（bindweed）那样会缠住其他植物、影响其生长的植物。"},"examples":[{"en":"Bineweed climbed the fence and spread quickly through the garden.","zh":"这种缠绕杂草顺着篱笆往上爬，很快就在花园里蔓延开来。"},{"en":"We pulled up the bineweed before it could wrap around the young tomatoes.","zh":"我们在它缠住小番茄苗之前把这缠绕杂草拔掉了。"}]}],"synonyms":["bindweed","convolvulus","wild morning glory","creeper"],"phonetic":"/ˈbaɪnˌwiːd/","extraExplanation":["“bineweed”在日常英语里不如“bindweed”常见；在一些地区或园艺语境中，“bineweed”可能被用来泛指会缠绕的杂草，或被当作“bindweed”的变体拼写/误拼。若你是在植物图鉴或园艺文章中看到，建议结合图片或拉丁学名确认具体是哪一种植物。"]}
{"word":"Binford","summary":{"en":"Binford is mainly a surname; it can also refer to the fictional tool brand from the TV show Home Improvement.","zh":"Binford主要用作英文姓氏；也可指美剧《家装》中虚构的工具品牌名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"宾福德（姓氏）。"},"examples":[{"en":"Ms. Binford will lead the meeting today.","zh":"宾福德女士今天将主持会议。"},{"en":"I met someone named Binford at the conference.","zh":"我在会议上遇到一位叫宾福德的人。"}]},{"partOfSpeech":"n.","definition":{"en":"a fictional tool company name in American TV (especially the sitcom Home Improvement), used as a brand in jokes about power tools.","zh":"（美剧中）虚构的工具公司名，尤其见于情景喜剧《家装》（Home Improvement），常作为“电动工具很猛”的梗或品牌名出现。"},"examples":[{"en":"He joked that he needed a Binford 9000 for the job.","zh":"他开玩笑说这活儿得用“Binford 9000”才行。"},{"en":"Binford Tools is mentioned several times in the show.","zh":"剧里多次提到“Binford Tools”。"}]}],"phonetic":"/ˈbɪn.fɚd/","extraExplanation":["“Binford”在现实中最常见是英文姓氏；在流行文化里，很多美国观众会把它联想到《Home Improvement》里虚构的“Binford Tools（宾福德工具）”。剧中常用夸张型号（如“9000”）制造喜剧效果，暗示“更大更强更快”的工具崇拜。"]}
{"word":"binful","summary":{"en":"“Binful” means the amount that fills a bin—one bin’s worth.","zh":"“binful”指“一桶/一箱的量”，也就是“装满一个bin的数量”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"As much as a bin can hold; a quantity that fills one bin.","zh":"一整桶/一整箱/一整个垃圾桶的量；满满一桶（箱）的量。"},"examples":[{"en":"The gardener collected a binful of fallen leaves.","zh":"园丁收集了一整桶落叶。"},{"en":"We threw away a binful of old papers during the cleanup.","zh":"大扫除时我们丢掉了一整箱旧文件。"}]}],"synonyms":["a bin’s worth","a bin full (of something)","a load (informal, context-dependent)"],"phonetic":"/ˈbɪnˌfʊl/","extraExplanation":["“binful”由“bin（桶/箱/垃圾桶）+ -ful（充满……的量）”构成，意思类似于“a cupful（一杯的量）”“a handful（一把的量）”。","它通常用于日常情境（园艺、清理、垃圾分类等），听起来比较口语化。正式写作中也可以改用“a bin full of … / a bin’s worth of …”。"]}
{"word":"Bing","summary":{"en":"Bing most commonly refers to Microsoft’s search engine; it can also be a person’s name or an onomatopoeic “bing!” sound like a notification or bell.","zh":"Bing最常指微软的搜索引擎“必应”；也可作人名，或作拟声词表示提示音/铃声的“叮”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a search engine (a website/app used to find information on the internet), made by Microsoft","zh":"（专有名词）必应：微软推出的搜索引擎（用于在互联网上查找信息的网站/应用）"},"examples":[{"en":"I searched the news on Bing.","zh":"我在必应上搜了新闻。"},{"en":"Bing is Microsoft’s search engine.","zh":"必应是微软的搜索引擎。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name (first name), used for people; in Chinese contexts it is often a romanization of names like Bing (e.g., 冰/兵/炳, depending on the character)","zh":"（人名）名：Bing（常见于人名；在中文语境中常是“冰/兵/炳”等字的拼音，具体看用哪个汉字）"},"examples":[{"en":"My classmate’s name is Bing.","zh":"我同学叫Bing。"},{"en":"In the email, Bing introduced himself as a new team member.","zh":"在邮件里，Bing自我介绍说他是新成员。"}]},{"partOfSpeech":"int.","definition":{"en":"the sound of a small bell or notification (like a “ding”)","zh":"（拟声词）叮的一声（像小铃铛或提示音）"},"examples":[{"en":"Bing! The microwave is done.","zh":"叮！微波炉好了。"},{"en":"My phone went ‘bing’ when I got a message.","zh":"我收到消息时手机“叮”了一声。"}]}],"synonyms":["(sound) ding","(sound) chime","(tech) search engine"],"phonetic":"/bɪŋ/","extraExplanation":["“Bing”作为微软搜索引擎的名字通常不翻译，中文常用官方译名“必应”。","拟声用法里，“bing”在口语/写作中常和“ding”很接近；“ding”更常见，“bing”有时给人更“清脆、亮一点”的感觉，具体取决于作者想表达的声音效果。"]}
{"word":"bing","summary":{"en":"“Bing” is commonly Microsoft’s search engine, and “bing” can also mean a short “ding” sound or the action of making that sound.","zh":"“Bing”常指微软的搜索引擎；“bing”也可表示清脆短促的“叮”一声，或发出这种声音/提示。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often capitalized) Microsoft’s web search engine and related AI/chat services.","zh":"（常大写）微软的网络搜索引擎及其相关的 AI/聊天服务。"},"examples":[{"en":"I searched it on Bing and found a helpful tutorial.","zh":"我用 Bing 搜了一下，找到了一个很有用的教程。"},{"en":"Bing has an image search feature that’s easy to use.","zh":"Bing 的图片搜索功能很好用。"}]},{"partOfSpeech":"n.","definition":{"en":"A short, clear ringing sound (like a bell or a notification).","zh":"清脆、短促的“叮”一声（像铃声或提示音）。"},"examples":[{"en":"I heard a bing from my phone—someone messaged me.","zh":"我手机“叮”了一声——有人给我发消息了。"},{"en":"The microwave ended with a loud bing.","zh":"微波炉结束时发出一声响亮的“叮”。"}]},{"partOfSpeech":"v.","definition":{"en":"To make a short, clear ringing sound; to signal with a “bing.”","zh":"发出清脆短促的叮当声；用“叮”的提示音提醒。"},"examples":[{"en":"My phone bings every time I get an email.","zh":"我每收到一封邮件，手机就会“叮”一声。"},{"en":"The app bింగed to remind me about the meeting.","zh":"这个应用“叮”了一声，提醒我开会。"}]}],"synonyms":["ding","ping","beep","chime"],"phonetic":"/bɪŋ/","extraExplanation":["“Bing”作为微软搜索引擎的名称常写作大写 **Bing**；在口语里也常见“Let me Bing it”（我用Bing搜一下），类似于“Google it”。","小写 **bing** 多用作拟声词，模仿通知提示音或铃声。英语里还有类似的拟声词：**ding**, **ping**, **beep**，语气和声音质感略有不同。"]}
{"word":"binge","summary":{"en":"“Binge” means doing or consuming too much in a short time (v.), or the short period of overdoing it (n.).","zh":"“binge”指在短时间内过量做/吃/喝/看（动词），或指这种短暂的放纵期（名词）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to do something (like watching, eating, or drinking) in a large amount in a short time, often with little self-control","zh":"（在短时间内）大量做某事（如狂看、暴食、酗酒），常带有难以自控的含义"},"examples":[{"en":"I binged a whole season of the show in one weekend.","zh":"我一个周末把这部剧的一整季都追完了。"},{"en":"He binged on snacks while studying for the exam.","zh":"他备考时不停地吃零食。"},{"en":"After a stressful week, she binged on social media for hours.","zh":"压力很大的一周后，她刷了好几个小时社交媒体。"}]},{"partOfSpeech":"n.","definition":{"en":"a short period when someone consumes or does too much of something (especially food, alcohol, or media)","zh":"（短时间内的）放纵期；暴食/酗酒/狂刷（尤其指食物、酒精或媒体）"},"examples":[{"en":"The holidays turned into a sugar binge for me.","zh":"假期对我来说简直成了“糖分放纵期”。"},{"en":"He went on a drinking binge after the breakup.","zh":"分手后他有一阵子酗酒。"},{"en":"My weekend binge left me tired on Monday.","zh":"我周末那一通狂刷/放纵，搞得周一很疲惫。"}]}],"synonyms":["overindulge","splurge","gorge","binge-watch","go on a spree"],"phonetic":"/bɪndʒ/","extraExplanation":["“binge”常见搭配：binge-watch（刷剧/追剧）、binge-eat（暴食）、binge-drink（酗酒）、go on a binge（放纵一阵子）、a binge of + 名词（如 a binge of shopping）。","语气与场景：它通常带有“过度、可能不健康”的评价色彩。若只是强调“连续看/做很多”但不想太负面，可用 marathon（如 a movie marathon）或 watch/read for hours。"]}
{"word":"binge-ate","summary":{"en":"“Binge-ate” means ate a lot of food quickly (past tense of binge-eat), often with a sense of loss of control.","zh":"“binge-ate”指在短时间内吃很多（binge-eat 的过去式），常含“失控暴食”的意味。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense of “binge-eat”) to eat a very large amount of food in a short time, often feeling out of control.","zh":"（“binge-eat”的过去式）在短时间内吃下大量食物，常带有失控感。"},"examples":[{"en":"After the exam, I binge-ate cookies and chips all night.","zh":"考试结束后，我一整晚暴食饼干和薯片。"},{"en":"She felt stressed and binge-ate, then regretted it later.","zh":"她压力很大就暴食，后来又后悔了。"}]}],"synonyms":["overate","ate too much","binged (on food)"],"phonetic":"/ˈbɪndʒ eɪt/","extraExplanation":["“binge-ate”来自动词“binge-eat（暴食）”。日常更常见的说法也可以用“binged on + 食物”（例如：I binged on pizza. 我狂吃披萨）或更中性的“overate（吃太多）”。","在健康/心理语境中，“binge-eat”常与“binge eating（暴食行为）”相关，但日常口语里也可泛指“控制不住地吃很多”。"]}
{"word":"binge-drank","summary":{"en":"“Binge-drank” means “drank a lot of alcohol in a short time” (past tense of binge-drink).","zh":"“binge-drank”指“在短时间内大量饮酒”（binge-drink 的过去式）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense of “binge-drink”) to drink a large amount of alcohol in a short time, often in an uncontrolled or risky way.","zh":"（“binge-drink”的过去式）在短时间内大量饮酒，常带有失控或有风险的意味。"},"examples":[{"en":"He binge-drank all weekend and felt terrible on Monday.","zh":"他整个周末都在暴饮，周一感觉糟透了。"},{"en":"They binge-drank at the party, then argued on the way home.","zh":"他们在派对上暴饮，回家的路上还吵了起来。"},{"en":"I binge-drank in college a few times, but I don’t do that anymore.","zh":"我大学时有过几次暴饮，但现在不那样了。"}]}],"synonyms":["drank heavily","went on a binge","binge drank"],"phonetic":"/ˈbɪndʒ dræŋk/","extraExplanation":["“binge-drank”是口语/写作中把“binge-drink”的过去式写出来的形式（更常见写法：binge-drank 或 binge drank）。现在时通常写作“binge-drink / binge drink”。","这个词常用于健康、社会新闻或教育语境，语气偏负面，强调“短时间大量饮酒”的危险性；如果只是一般“喝酒”，用“drank”或“had a few drinks”更中性。"]}
{"word":"binge-drink","summary":{"en":"Binge-drink means to drink a lot of alcohol in a short time, often leading to intoxication.","zh":"binge-drink 指在短时间内大量饮酒，常常会喝到很醉。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to drink a large amount of alcohol in a short period of time, often to the point of getting very drunk","zh":"在短时间内大量饮酒（常常喝到很醉）"},"examples":[{"en":"Some college students binge-drink on weekends.","zh":"有些大学生在周末会暴饮。"},{"en":"He promised he would stop binge-drinking after the accident.","zh":"事故之后他承诺不再暴饮。"},{"en":"Binge-drinking can put you at risk of alcohol poisoning.","zh":"暴饮可能让你面临酒精中毒的风险。"}]},{"partOfSpeech":"vt.","definition":{"en":"to consume (alcohol) in a binge pattern—large amounts in a short time","zh":"以“暴饮”的方式喝（酒）；短时间内大量饮用"},"examples":[{"en":"They binge-drank beer and shots at the party.","zh":"他们在派对上暴饮啤酒和烈酒。"},{"en":"He binge-drank hard liquor to forget his stress.","zh":"他为了忘掉压力而暴饮烈酒。"}]}],"synonyms":["drink heavily","drink to excess","go on a bender","binge","party hard"],"phonetic":"/ˈbɪndʒ ˌdrɪŋk/","extraExplanation":["“binge-”原意有“放纵地做某事、一次做很多”的感觉（如 binge-watch 一口气追剧）。因此 binge-drink 强调“短时间内大量喝酒”，而不一定表示长期每天喝。","在公共健康语境中，binge drinking 常用来描述一种危险饮酒模式；不同国家/机构对“算不算暴饮”的具体杯数标准可能不同。","口语里也常说 go on a bender（连续几天狂饮/酗酒式放纵），语气更强、更随意。"]}
{"word":"binge-eat","summary":{"en":"“Binge-eat” means eating a very large amount of food in a short time, often feeling out of control.","zh":"binge-eat 指在短时间内吃下大量食物，常伴随失控感。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to eat a very large amount of food in a short time, often with a feeling of losing control","zh":"在短时间内吃下大量食物，常带有“失去控制”的感觉"},"examples":[{"en":"After a stressful day, he sometimes binge-eats late at night.","zh":"压力大的一天之后，他有时会在深夜暴食。"},{"en":"She’s trying to stop binge-eating and build healthier habits.","zh":"她正在努力停止暴食，建立更健康的习惯。"}]},{"partOfSpeech":"v.","definition":{"en":"to repeatedly eat too much in episodes (a pattern of behavior)","zh":"反复出现“吃得过多”的发作式行为（一种行为模式）"},"examples":[{"en":"Some people binge-eat on weekends and diet during the week.","zh":"有些人周末会暴食，工作日又节食。"},{"en":"If you binge-eat regularly, it may help to talk to a professional.","zh":"如果你经常暴食，和专业人士聊聊可能会有帮助。"}]}],"synonyms":["overeat","eat too much","eat excessively"],"phonetic":"/ˈbɪndʒ ˌit/","extraExplanation":["“binge-”表示“放纵、无节制的一阵（行为）”，常见搭配有 binge-watch（刷剧）、binge-drink（酗酒）。因此 binge-eat 强调的是“短时间内大量进食+难以控制”，语气通常比 simply “eat a lot” 更严肃。","在健康语境中，binge-eating 也可指“暴食症（Binge Eating Disorder, BED）”相关行为；日常使用时可以改用更中性的说法，如 “overeating” 或 “eating too much,” 以避免贴标签。"]}
{"word":"binge-eating","summary":{"en":"Binge-eating means eating an unusually large amount of food in a short time, often feeling out of control.","zh":"binge-eating 指在短时间内吃下异常大量的食物，常伴随失控感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of eating a very large amount of food in a short time, often with a feeling of loss of control","zh":"（短时间内）暴食；一次性吃下大量食物，常伴随“失控感”"},"examples":[{"en":"During stressful weeks, she sometimes struggles with binge-eating at night.","zh":"压力大的几周里，她有时会在夜里忍不住暴食。"},{"en":"Binge-eating can leave people feeling physically uncomfortable and emotionally upset.","zh":"暴食可能让人身体不适，也会带来情绪上的困扰。"},{"en":"He is getting help for binge-eating by talking to a therapist and building healthier routines.","zh":"他正在通过心理咨询和建立更健康的习惯来寻求暴食问题的帮助。"}]}],"synonyms":["overeating","bingeing","compulsive eating"],"phonetic":"/ˈbɪndʒ ˌiːtɪŋ/","extraExplanation":["“binge-”表示“放纵式地做某事、一口气大量做某事”，常见搭配有 binge-watch（刷剧）、binge-drink（酗酒）。","“binge-eating”既可用来泛指“暴食行为”，也可出现在医疗/心理健康语境中（如 binge-eating disorder，暴食症）。日常交流中提到这一话题时，通常用更中性、尊重的表达会更合适。"]}
{"word":"binge-eating-related","summary":{"en":"An adjective meaning “related to binge eating or its effects.”","zh":"形容词：表示“与暴食或其影响相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected to binge eating (eating a large amount of food in a short time, often with a sense of loss of control) or to problems caused by it","zh":"与暴食（在短时间内吃大量食物，常伴随失控感）或由此引发的问题有关的"},"examples":[{"en":"She is getting treatment for binge-eating-related health issues.","zh":"她正在接受与暴食相关的健康问题的治疗。"},{"en":"The clinic offers support for binge-eating-related stress and shame.","zh":"这家诊所为与暴食相关的压力和羞耻感提供支持。"},{"en":"Researchers studied binge-eating-related changes in sleep patterns.","zh":"研究人员调查了与暴食相关的睡眠模式变化。"}]}],"synonyms":["binge-related","related to binge eating","BED-related"],"phonetic":"/ˈbɪndʒ ˌiːtɪŋ rɪˈleɪtɪd/","extraExplanation":["“binge-eating-related”是由三个部分组成的复合形容词：binge（一次性过量）+ eating（进食）+ related（相关的）。常见于医学、心理健康、营养学语境，用来修饰“symptoms/behaviors/health issues/weight changes/anxiety”等名词。","注意它通常是描述“相关性”，不等于诊断名词。正式诊断常见说法是“binge-eating disorder (BED)（暴食障碍）”。在日常沟通中可根据语境选择更温和的表达，如“eating-related stress（与进食相关的压力）”。"]}
{"word":"binge-watch","summary":{"en":"To watch a lot of a show or videos continuously, often for hours.","zh":"指长时间连续观看大量剧集或视频内容，常带“停不下来”的感觉。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to watch many episodes of a TV show (or a lot of video content) in a row, usually for a long time","zh":"（通常长时间）一口气连着看很多集电视剧或大量视频内容；刷剧"},"examples":[{"en":"We binge-watched the whole season in one weekend.","zh":"我们一个周末把整季都刷完了。"},{"en":"I stayed up late binge-watching videos, and I’m exhausted today.","zh":"我熬夜刷视频，所以今天特别累。"},{"en":"She tries not to binge-watch on weeknights because she needs to get up early.","zh":"她尽量不在工作日晚上刷剧，因为要早起。"}]}],"synonyms":["marathon (a show)","watch back-to-back","consume (content)","stream for hours"],"phonetic":"ˈbɪndʒ ˌwɑtʃ","extraExplanation":["“binge-”原本常用来形容“无节制地大量做某事”（如 binge drinking 酗酒、binge eating 暴饮暴食）。binge-watch 把这个概念延伸到看剧/看视频，带有“停不下来、一集接一集”的语感。","在流媒体平台（Netflix 等）普及后，这个词变得非常常见；也常写作 binge watch。","相关表达：binge-watching（名词/动名词，表示“刷剧这种行为”），binge-worthy（形容词，表示“特别值得一口气刷完的”）。"]}
{"word":"binge-watched","summary":{"en":"“Binge-watched” means watched many episodes or a lot of video content in a short time.","zh":"“binge-watched”指在短时间内（常连续数小时）一口气看很多集/大量视频内容。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to watch many episodes of a TV show (or a lot of video content) in one sitting or over a short time, often for hours","zh":"（常指连续好几个小时）一口气/在短时间内看完很多集电视剧或大量视频内容"},"examples":[{"en":"I binge-watched the whole season last weekend.","zh":"我上周末一口气把整季都追完了。"},{"en":"She binge-watched crime dramas all night and barely slept.","zh":"她整晚狂追犯罪剧，几乎没睡。"},{"en":"We binge-watched a new series during the holiday break.","zh":"假期里我们把一部新剧连着看完了。"}]}],"synonyms":["marathon-watched","watched back-to-back","devoured (a series)"],"phonetic":"/ˈbɪndʒ wɑtʃt/","extraExplanation":["“binge-”原意是“无节制地做某事”（常见于 binge eating 暴饮暴食、binge drinking 狂饮）。binge-watch/binge-watched 是较新的口语/媒体用语，随着流媒体（Netflix 等）一次放出整季的观看方式而普及。","拼写上既常见 binge-watch / binge-watched（用连字符），也常见 bingewatch / bingewatched（不加连字符）。在日常写作中两种都能理解，但正式写作更常见带连字符的形式。"]}
{"word":"binge-watcher","summary":{"en":"A binge-watcher is someone who watches many episodes in a row (often in a short time).","zh":"binge-watcher 指短时间内连续看很多集（追剧停不下来）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who watches many episodes of a TV series (or a lot of online video) in one sitting or over a short time","zh":"（短时间内）一口气看很多集剧集/大量视频的人；追剧狂"},"examples":[{"en":"I became a binge-watcher during the holidays and finished the whole season in two days.","zh":"假期里我变成了追剧狂，两天就把整季看完了。"},{"en":"As a binge-watcher, he always says, “Just one more episode.”","zh":"作为一个追剧狂，他总说：“再看一集就好。”},{"}]}],"synonyms":["marathon viewer","binge viewer","series marathoner"],"phonetic":"/ˈbɪndʒ ˌwɑtʃɚ/","extraExplanation":["“Binge-”原意是“（无节制地）狂欢/暴饮暴食”，比如 binge drinking（酗酒）。把它用在看剧上，binge-watching 指“停不下来、连续看很多集”。\n\n拼写上常见两种：binge-watcher（名词：人）与 binge-watching（动名词：行为）。例如：I’m binge-watching a show. / I’m a binge-watcher.\n\n语气通常偏口语、略带自嘲或轻微批评，但在日常交流中很常见，并不一定很负面。"]}
{"word":"binge-worthy","summary":{"en":"“Binge-worthy” describes content so good you want to consume many episodes or a lot of it at once.","zh":"“binge-worthy”形容内容特别吸引人，让人想一次性连续追很多集/看很多内容。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"So enjoyable or exciting that you want to watch (or sometimes read/listen to) a lot of it in one sitting.","zh":"非常好看/好听/好读，让人想一次性连续看（有时也指连续读/听）很多集或很多内容。"},"examples":[{"en":"That new drama is binge-worthy—I finished the whole season in two days.","zh":"那部新剧太“适合追”了——我两天就把整季看完了。"},{"en":"I’m looking for a binge-worthy podcast for my long flights.","zh":"我在找一档适合在长途飞行时一次听很多集的播客。"}]}],"synonyms":["addictive","compelling","can’t-miss","highly watchable"],"phonetic":"/ˈbɪndʒ ˌwɝði/","extraExplanation":["“binge-worthy”来自“binge”（一次性过量地做某事，如暴饮暴食/狂看）+ “worthy”（值得的）。常见于流媒体文化（Netflix等）语境，强调“让人停不下来”。\n搭配常见：binge-worthy show/series/drama/documentary/podcast。\n语气：口语、偏轻松；正式写作中可用“highly engaging/compelling”替代。"]}
{"word":"bingeable","summary":{"en":"“Bingeable” describes content that’s so engaging you can easily watch or listen to many parts in a row.","zh":"“Bingeable”形容内容非常吸引人，让人很容易一集接一集地看/听下去。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a TV show, video series, podcast, or content) very easy and enjoyable to consume in many episodes or parts in a row.","zh":"（指电视剧、视频系列、播客或内容）让人很容易一集接一集地看/听下去，停不下来；适合“刷/追”的。"},"examples":[{"en":"That new crime series is so bingeable—I watched the whole season in one weekend.","zh":"那部新的犯罪剧太适合刷了——我一个周末就把整季看完了。"},{"en":"I need something bingeable for the flight.","zh":"我需要找点适合在飞行途中连着看的东西。"}]}],"synonyms":["addictive","compulsive","easy to binge-watch","engrossing"],"phonetic":"/ˈbɪndʒəbəl/","extraExplanation":["“bingeable”来自动词/名词“binge”（暴饮暴食；放纵式地大量做某事，如 binge-watch 追剧）+ 形容词后缀“-able”（表示“能够……的/适合……的”）。","语气通常偏口语、媒体评论常用，多用于夸内容“停不下来”；但也可能带一点自嘲或轻微负面含义，暗示花太多时间。常见搭配：bingeable show/series/content/episodes。"]}
{"word":"binged","summary":{"en":"“Binged” means you did a “binge”: you consumed too much food/drink or watched/consumed a lot of content in a short time.","zh":"“binged”表示“暴食/酗饮”或“短时间内大量追剧/刷内容”（binge）的过去式/过去分词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “binge”: to eat or drink too much in a short time (often in an uncontrolled way).","zh":"“binge”的过去式/过去分词：在短时间内暴饮暴食或酗饮（常含“失控”之意）。"},"examples":[{"en":"He binged on chips and soda after the exam.","zh":"考试后他狂吃薯片、猛喝汽水。"},{"en":"She said she had binged the night before and felt sick.","zh":"她说前一晚暴饮暴食，结果不舒服。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “binge”: to watch or consume a lot of a show, videos, or other content in a short time (binge-watch).","zh":"“binge”的过去式/过去分词：在短时间内刷完/追完大量节目、视频或其他内容（如“binge-watch”）。"},"examples":[{"en":"We binged the whole series in one weekend.","zh":"我们一个周末就把整部剧刷完了。"},{"en":"I binged on YouTube tutorials all night.","zh":"我整晚都在狂刷 YouTube 教程。"}]}],"synonyms":["overate","gorged","indulged","binge-watched","marathoned"],"phonetic":"/bɪndʒd/","extraExplanation":["“binge-watching（刷剧/追剧）”是近二十年非常常见的用法，和流媒体平台（如 Netflix）的兴起有关；口语里也常说 “I binged it.” 表示“我一口气看完了”。","“binge”常带有“过量、停不下来”的语气，所以在正式写作里可能会用更中性的表达，如 “watched several episodes” 或 “ate a large amount”。"]}
{"word":"bingee","summary":{"en":"“Bingee” is an informal, nonstandard noun meaning someone who binges (e.g., binge-watches or binge-eats).","zh":"“Bingee”是非正式、非标准的名词，用来指“会暴食/刷剧等、短时间大量做某事的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, nonstandard) A person who binge-watches, binge-eats, or otherwise does something in large amounts over a short time.","zh":"（非正式、非标准用法）指“暴食/暴饮/刷剧”等的人：在短时间内大量做某事的人。"},"examples":[{"en":"My roommate is a real bingee—he finished the whole series in two days.","zh":"我室友真是个“刷剧狂”——两天就把整部剧看完了。"},{"en":"As a weekend bingee, she tries to balance fun with enough sleep.","zh":"作为周末“放纵型的人”，她会尽量在玩乐和睡眠之间取得平衡。"}]}],"synonyms":["binge-watcher","binge eater","heavy watcher","power viewer"],"phonetic":"/bɪnˈdʒiː/","extraExplanation":["“bingee”并不是常见的标准英语拼写。更常用的表达是：\n- “binge-watcher”（刷剧的人）\n- “binge eater”（暴食者）\n- 形容词 “bingey/bingy”（很容易让人一口气看/吃/做很多的）\n日常写作或正式场合建议用这些更普遍的说法。","相关核心词是 “binge” /bɪndʒ/（n./v.）：表示“（短时间内）放纵地大量吃喝/观看/消费/做某事”。如果你想查的是这个标准词，也可以告诉我，我可以把“binge”的常见用法完整列出来。"]}
{"word":"bingeing","summary":{"en":"Bingeing means doing or consuming too much of something in a short time, such as bingeing a TV show or bingeing on food.","zh":"Bingeing 指在短时间内过量地做或摄取某事物，比如一口气刷剧或暴食。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to do or consume a lot of something in a short time (often more than is healthy or intended)","zh":"在短时间内大量做某事或大量消费/摄取某物（常常超过健康或原本打算的程度）"},"examples":[{"en":"I stayed up late bingeing a new TV series.","zh":"我熬夜一口气追完了一部新剧。"},{"en":"He’s been bingeing on snacks because he’s stressed.","zh":"他因为压力大，一直在暴食零食。"}]}],"synonyms":["overindulging","splurging","gorging","marathoning"],"phonetic":"/ˈbɪn.dʒɪŋ/","extraExplanation":["“bingeing”是“binge”的现在分词/动名词形式。英式英语常写作“bingeing”，美式英语更常见拼法是“bingeing”或“binging”（两者都能见到，“binging”更简洁常用）。","常见搭配：binge-watch（刷剧/追剧）、binge-eat（暴食）、binge-drink（狂饮）。这些词往往带有“失控、过量”的语感；但在日常口语里说刷剧（binge-watch）也可能只是夸张表达，不一定很负面。"]}
{"word":"Bingen","summary":{"en":"Bingen is a town on the Rhine in Germany and is also used in names like “Hildegard of Bingen.”","zh":"Bingen 指德国莱茵河畔的宾根城，也常见于人名如“宾根的希尔德加德”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A town in western Germany on the Rhine River (often called “Bingen am Rhein”).","zh":"德国西部莱茵河畔的一座城市（常称“Bingen am Rhein”，意为“莱茵河畔宾根”）。"},"examples":[{"en":"We stopped in Bingen to take a boat trip on the Rhine.","zh":"我们在宾根停留，乘船游览莱茵河。"},{"en":"Bingen am Rhein is known for its river views and nearby vineyards.","zh":"莱茵河畔宾根以河景和附近的葡萄园闻名。"}]},{"partOfSpeech":"other","definition":{"en":"Used in names to show a person’s connection to the town, especially in “Hildegard of Bingen,” a famous medieval writer, composer, and abbess.","zh":"用于人名中表示与该地的关联，尤其指“宾根的希尔德加德”（Hildegard of Bingen），一位著名的中世纪作家、作曲家和女修院院长。"},"examples":[{"en":"In our history class, we read a text by Hildegard of Bingen.","zh":"在历史课上，我们读了一篇宾根的希尔德加德的作品。"},{"en":"The museum has an exhibit about Hildegard of Bingen’s music.","zh":"博物馆有一个关于宾根的希尔德加德音乐的展览。"}]}],"synonyms":["Bingen am Rhein"],"phonetic":"/ˈbɪŋən/","extraExplanation":["“Bingen”是专有名词，日常英语里常出现在地名“Bingen am Rhein”（莱茵河畔宾根）或人物称号“Hildegard of Bingen”（表示“来自宾根/与宾根相关的希尔德加德”）中。","在英文写作里，“of + 地名”这种结构常用于历史人物名号（类似“Joan of Arc / 阿尔克的贞德”），不一定表示现代意义上的姓氏。"]}
{"word":"Binger","summary":{"en":"A binger is someone who does something in an excessive, often uncontrolled way for a short time (e.g., drinking, eating, or binge-watching).","zh":"Binger 指在短时间内过度、常常有些失控地做某事的人（如酗酒、暴食或一口气刷剧）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who binges (does something—often drinking, eating, or watching TV—in an excessive, uncontrolled way for a short period).","zh":"（短时间内）暴饮暴食/酗酒/沉迷刷剧等“放纵式”进行某事的人。"},"examples":[{"en":"He’s a weekend binger who drinks too much on Fridays and Saturdays.","zh":"他是那种周末“放纵型”的人，周五周六会喝很多酒。"},{"en":"I used to be a late-night snack binger during exam week.","zh":"考试周我以前常常在深夜暴吃零食。"},{"en":"As a binger, she can finish an entire season in one day.","zh":"作为一个“刷剧狂”，她一天就能追完一整季。"}]}],"synonyms":["binge-watcher","heavy drinker","glutton (for eating)","overindulger"],"phonetic":"/ˈbɪŋər/","extraExplanation":["“Binger”来自动词“binge”（放纵式地做某事，常见搭配：binge-drink 酗酒；binge-eat 暴食；binge-watch 一口气刷剧）。","语气与场合：口语里很常见，既可中性（只表示“连看/连吃很多”），也可能带一点负面含义（暗示失控或不健康），具体看语境。","常见说法：a binge-watcher（刷剧的人）比 a binger 更具体；在谈健康问题时也会看到 binge eater（暴食者）等更正式/明确的表达。"]}
{"word":"binges","summary":{"en":"“Binges” means repeated or multiple occasions of doing something to excess, or the third-person singular verb form of “binge.”","zh":"“binges”既可以指多次/多场的“放纵”（名词复数），也可以是“binge”的第三人称单数动词，表示在短时间内过度做某事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an occasion when someone does too much of something in a short time (especially eating, drinking, shopping, or watching TV)","zh":"（尤指吃喝、购物、看电视等）在短时间内过度进行某事的一次行为；放纵的一次"},"examples":[{"en":"After the exam, she went on a chocolate binge.","zh":"考完试后，她来了一次疯狂吃巧克力的“放纵”。"},{"en":"He had a weekend binge and felt awful on Monday.","zh":"他周末放纵了一把，周一感觉很糟。"}]},{"partOfSpeech":"v.","definition":{"en":"(third-person singular of “binge”) to do something to excess in a short time","zh":"（“binge”的第三人称单数）在短时间内过度做某事；暴饮暴食/狂看/沉迷式消费等"},"examples":[{"en":"He binges on snacks late at night.","zh":"他深夜会暴吃零食。"},{"en":"She binges TV shows when she’s stressed.","zh":"她压力大时会一口气狂追剧。"}]}],"synonyms":["splurge","spree","overindulgence","gorge","overeat"],"phonetic":"/bɪndʒ/","extraExplanation":["“binge”在现代英语里很常见的搭配有：binge eating（暴食/情绪性暴食）、binge drinking（酗酒式暴饮）、binge-watching（刷剧/一口气看很多集）。这些词多用于描述“短时间内、失去节制”的行为。"]}
{"word":"bingey","summary":{"en":"Bingey means “binge-worthy”: so engaging that you keep consuming it for hours, often in one go.","zh":"Bingey 意为“很适合一口气刷完/看完”，指内容太吸引人、让人停不下来。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Very enjoyable and easy to keep watching/reading/listening to for a long time, often in one sitting; binge-worthy.","zh":"让人停不下来、很容易一口气看/读/听很久的；“适合刷”的、令人想追更的。"},"examples":[{"en":"That new crime series is so bingey—I finished the whole season in two nights.","zh":"那部新的犯罪剧太“刷”了——我两晚就把一整季看完了。"},{"en":"The novel is short and bingey, perfect for a weekend.","zh":"这本小说不长又很上头，很适合周末一口气读完。"},{"en":"I try to avoid bingey shows during exam week.","zh":"考试周我尽量避开那种太容易让人沉迷的剧。"}]}],"synonyms":["binge-worthy","addictive","compelling","gripping","page-turning"],"phonetic":"/ˈbɪn.dʒi/","extraExplanation":["“bingey”是口语/网络用语，来自“binge”（放纵地一次做很多，如 binge-watch 一口气追剧）。常见于流媒体语境（Netflix、YouTube 等），带有“很容易让人连续看下去”的感觉。","语气通常偏轻松，有时也暗示“有点耗时间/容易上瘾”。更正式的说法是“binge-worthy”。"]}
{"word":"bingeys","summary":{"en":"“Bingeys” is informal internet English, usually referring to “bingey” (binge-worthy) content—things so addictive you want to consume them in one go.","zh":"“bingeys”是较口语/网感的写法，通常指“bingey（很上头、适合一口气追完的）”内容。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Binge-worthy; so entertaining or addictive that you want to watch/read/consume a lot of it in a short time.","zh":"（非正式）很“上头”、适合一口气追完的；让人想在短时间内连续看/读/玩很多的。"},"examples":[{"en":"That series is so bingey—I finished the whole season in two days.","zh":"那部剧太上头了——我两天就把整季追完了。"},{"en":"I’m looking for something light and bingey for the weekend.","zh":"我想找个周末轻松又适合一口气追完的内容。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, plural) People sometimes write “bingeys” to mean bingey shows/videos/books—binge-worthy stuff. This is not a standard dictionary form, but it appears online.","zh":"（非正式，复数）有人会用“bingeys”指那些“上头的剧/视频/书”等——适合连刷的内容。这个形式不算标准词典用法，但在网络上能见到。"},"examples":[{"en":"Any bingeys to recommend for a long flight?","zh":"长途飞行有没有什么上头的内容推荐？"},{"en":"I saved a few bingeys for when I’m sick at home.","zh":"我存了几个上头的内容，留着生病在家时刷。"}]}],"synonyms":["binge-worthy","addictive","compelling","hard to put down","can’t-stop-watching"],"phonetic":"ˈbɪŋ.i","extraExplanation":["“bingey”来自名词/动词 binge（暴饮暴食；一口气做很多）+ 形容词后缀 -y，表示“具有……特点的”。在流媒体文化里最常见的搭配是 binge-watch（刷剧）→ bingey（适合刷剧的）。","你输入的“bingeys”很可能是把 bingey 当作名词来用的网络写法；更常见、更标准的表达是 “binge-worthy shows/series” 或直接说 “bingey shows”。"]}
{"word":"Bingham","summary":{"en":"Bingham is most commonly a surname, and it can also be the name of several towns/places.","zh":"Bingham 最常见作姓氏，也可作多个城镇/地点的地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname) of English origin.","zh":"（姓氏）宾厄姆：源自英国的姓。"},"examples":[{"en":"She introduced herself as Dr. Bingham.","zh":"她自我介绍说她叫宾厄姆博士。"},{"en":"The Bingham family has lived in this area for generations.","zh":"宾厄姆家族在这一带已居住了好几代。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name; a town or community called Bingham (found in several English-speaking regions).","zh":"（地名）宾厄姆：英语国家中一些城镇/社区的名称。"},"examples":[{"en":"We stopped for lunch in Bingham on our road trip.","zh":"我们自驾途中在宾厄姆停下来吃午饭。"},{"en":"He grew up near Bingham in Nottinghamshire, England.","zh":"他在英格兰诺丁汉郡的宾厄姆附近长大。"}]}],"phonetic":"/ˈbɪŋəm/","extraExplanation":["“Bingham”常见于英国地名与姓氏。许多英文地名以 -ham 结尾（如 Nottingham、Birmingham 的相关构词），其中 -ham 在古英语里常与“村庄、家园/聚落”有关，因此这类地名往往带有历史聚居地的意味。","作为专有名词（人名/地名），Bingham 通常首字母大写；如果你指的是某个具体地点（例如英国诺丁汉郡的 Bingham 或美国某州的 Bingham），最好在句子里补充国家/州/郡名来避免歧义。"]}
{"word":"Binghamton","summary":{"en":"Binghamton is a city in New York State (USA), known especially for Binghamton University.","zh":"Binghamton 是美国纽约州的一座城市，尤其因宾汉姆顿大学而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in the Southern Tier of New York State, in the United States (in Broome County), known for its rivers, nearby hills, and Binghamton University.","zh":"美国纽约州南部地区（布鲁姆县）的一个城市，因河流、周边丘陵地形以及宾汉姆顿大学而较为知名。"},"examples":[{"en":"She moved to Binghamton for graduate school.","zh":"她为了读研究生搬到了宾汉姆顿。"},{"en":"Binghamton is about a couple of hours from New York City by car.","zh":"从宾汉姆顿开车到纽约市大约要两三个小时。"},{"en":"We stopped in Binghamton on our way to visit family upstate.","zh":"我们去纽约州北部看亲戚的路上在宾汉姆顿停了一下。"}]}],"phonetic":"/ˈbɪŋəmˌtən/","extraExplanation":["“Binghamton”是地名专有名词，常见搭配有：Binghamton University（宾汉姆顿大学，纽约州立大学系统的一所公立大学）、Downtown Binghamton（宾汉姆顿市中心）。","该市位于萨斯奎哈纳河（Susquehanna River）与切南戈河（Chenango River）交汇附近，因此在介绍地理时常会提到“river confluence（河流交汇处）”。","在本地语境中，你可能会听到昵称“Bing”（口语缩写），但正式写作中仍用全称 Binghamton。"]}
{"word":"binghi","summary":{"en":"“Binghi” most commonly refers to Nyabinghi—Rastafari ceremonial drumming/chanting or the gathering where it happens.","zh":"“Binghi”最常见的意思是指 Nyabinghi（尼亚宾吉）——拉斯塔法里仪式性的鼓乐/吟唱，或进行这些活动的聚会。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rastafari / reggae culture) A shortened form of “Nyabinghi,” referring to a Rastafari spiritual gathering or the sacred drumming-and-chant style used in such ceremonies.","zh":"（拉斯塔法里/雷鬼文化）“Nyabinghi（尼亚宾吉）”的简称，指拉斯塔法里宗教性的聚会，或在这种仪式中使用的神圣鼓乐与吟唱风格。"},"examples":[{"en":"You can hear binghi rhythms in a lot of roots reggae.","zh":"很多根源雷鬼（roots reggae）里都能听到宾吉（binghi）的节奏。"},{"en":"They held a binghi night with drumming, chanting, and prayer.","zh":"他们举办了一个宾吉之夜，有击鼓、吟唱和祷告。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A family name or place/name spelling seen in some regions; not a common everyday English word.","zh":"（少见）在一些地区可能作为姓氏或地名/人名的拼写出现；不是常见的日常英语词。"},"examples":[{"en":"I saw “Binghi” used as a surname in a local record.","zh":"我在一份当地记录里看到“Binghi”作为姓氏出现。"}]}],"synonyms":["Nyabinghi","Rastafari drumming"],"phonetic":"/ˈbɪŋɡi/","extraExplanation":["“Nyabinghi/宾吉”在拉斯塔法里文化中很重要：常指仪式性的“鼓乐（drumming）+吟唱（chanting）+祈祷（prayer）”聚会，也指这种鼓点风格本身。","Nyabinghi 这个词与东非/中非关于“Nyabinghi 女王/精神象征”的反殖民传说有关；后来在牙买加的拉斯塔法里传统中被吸收并发展，影响了 roots reggae 的节奏与氛围。"]}
{"word":"bingies","summary":{"en":"“Binge” means doing something (like eating, drinking, or watching shows) too much in a short time.","zh":"“binge”指在短时间内对某事（如吃、喝、刷剧）过量、失控地进行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A short period when you do too much of something (especially eating, drinking, or watching something) in an uncontrolled way.","zh":"（尤指吃、喝或看某事）在短时间内过量、失控地进行的一段时间。"},"examples":[{"en":"After the exam, he went on a pizza binge.","zh":"考试后，他来了一次披萨“暴吃”。"},{"en":"I had a weekend binge of watching TV shows.","zh":"我周末连续刷剧，刷到停不下来。"}]},{"partOfSpeech":"v.","definition":{"en":"To do too much of something in a short time, often in an uncontrolled way.","zh":"（在短时间内）过量、失控地做某事（常指吃、喝、刷剧等）。"},"examples":[{"en":"She sometimes binges on sweets when she’s stressed.","zh":"她压力大时有时会暴吃甜食。"},{"en":"We binged the whole season in one night.","zh":"我们一晚上把整季都刷完了。"}]}],"synonyms":["splurge","overindulge","gorge","binge-watch"],"phonetic":"/bɪndʒ/","extraExplanation":["“bingies”不是常见或标准拼写。你可能想写：\n- “binges”：binge 的第三人称单数/复数名词（e.g., food binges）\n- “binge”：原形\n常见搭配：binge eating（暴食）、binge drinking（狂饮）、binge-watch（刷剧/追剧，常写作 binge-watch 或 binge watch）。"]}
{"word":"binging","summary":{"en":"“Binging” means doing something too much in a short time, especially eating, drinking, or watching shows.","zh":"“Binging”指在短时间内过量地做某事，尤指暴食、狂饮或连续刷剧。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to do something (like eating, drinking, or watching shows) too much in a short time; to overindulge","zh":"（在短时间内）无节制地做某事（如暴饮暴食、狂饮、刷剧等）；过度沉迷"},"examples":[{"en":"I stayed up late binging a new TV series all weekend.","zh":"我整个周末都熬夜刷一部新电视剧。"},{"en":"He’s been binging on snacks because he’s stressed.","zh":"他因为压力大一直在无节制地吃零食。"},{"en":"The article warns about binging and then feeling guilty afterward.","zh":"那篇文章警告说暴食/沉迷之后可能会感到内疚。"}]},{"partOfSpeech":"n.","definition":{"en":"a period of uncontrolled overdoing of something (often eating, drinking, or media consumption)","zh":"一段时间的放纵行为（常指暴饮暴食、酗酒或连续刷剧等）"},"examples":[{"en":"After finals, she went on a binging spree of movies.","zh":"期末考完后，她连续看了很多电影放纵了一把。"},{"en":"Binging can affect your sleep and mood.","zh":"放纵式刷剧/暴食等会影响睡眠和情绪。"}]}],"synonyms":["overindulging","gorging","marathon-watching","compulsive watching","bingeing"],"phonetic":"/ˈbɪndʒɪŋ/","extraExplanation":["“binging”是“binge”的现在分词/动名词形式。美式英语里也常见拼写“bingeing”，意思相同。","日常口语中最常见的搭配是“binge-watch（连刷/追剧）”“binge-eat（暴食）”“binge-drink（狂饮/酗酒）”。其中“binge-drink”在健康语境里更偏严肃。"]}
{"word":"binging-and-purging","summary":{"en":"“Bingeing and purging” usually refers to eating a lot and then trying to get rid of it; it can also mean a broader cycle of overdoing something and then over-correcting.","zh":"“binging and purging”通常指暴食后进行清除/补偿行为；也可引申为“先过度、后极端纠正”的循环。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a pattern of eating a large amount of food in a short time (bingeing) and then trying to “undo” it by vomiting, using laxatives, fasting, or exercising excessively (purging)","zh":"一种饮食行为模式：在短时间内大量进食（暴食），随后通过催吐、滥用泻药、禁食或过度运动等方式“补偿/清除”（清除行为）"},"examples":[{"en":"She opened up about her past experience with bingeing and purging and how she sought treatment.","zh":"她谈到自己过去暴食与清除行为的经历，以及她如何寻求治疗。"},{"en":"Bingeing and purging can seriously harm your body and mental health.","zh":"暴食与清除行为会严重损害身体和心理健康。"},{"en":"If you’re struggling with bingeing and purging, consider talking to a doctor or counselor.","zh":"如果你正被暴食与清除行为困扰，建议与医生或咨询师谈谈。"}]},{"partOfSpeech":"phrase","definition":{"en":"(figurative) a cycle of overindulging in something and then taking extreme steps to compensate or “clean up” afterward","zh":"（比喻）先过度放纵/沉迷，随后又采取极端方式来补偿或“收拾残局”的循环"},"examples":[{"en":"His work style was like bingeing and purging: a week of nonstop effort followed by a crash.","zh":"他的工作方式像“暴食与清除”：一周拼命工作，之后彻底崩溃。"},{"en":"The company’s bingeing and purging on spending created unstable budgets.","zh":"公司在开支上的“先猛花后紧缩”导致预算不稳定。"}]}],"synonyms":["binge-purge cycle","compensatory behaviors","(figurative) boom-and-bust pattern"],"phonetic":"/ˈbɪndʒɪŋ ænd ˈpɝdʒɪŋ/","extraExplanation":["这个短语在健康语境中常与饮食障碍相关（例如贪食症 bulimia nervosa），属于比较敏感的话题。日常交流中如果指真实健康问题，建议用更中性、尊重的表达，并避免开玩笑式的比喻。","“binge”常指短时间内的过量行为（不仅是吃，也可指 binge-watch 追剧刷剧）；“purge”原意是“清除/肃清”，在这里指用补偿方式“清掉”摄入或减轻负罪感。"]}
{"word":"bingle","summary":{"en":"Bingle means a minor accident or bump, especially a small car collision, and it can also mean to bump into something.","zh":"bingle 指小事故/轻微碰撞（尤指小型车祸），也可作动词表示“轻轻撞到/发生轻微碰撞”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, chiefly Australian/New Zealand English) A small accident or collision, especially a minor car crash.","zh":"（非正式，主要用于澳大利亚/新西兰英语）小事故；轻微碰撞，尤指小型车祸。"},"examples":[{"en":"There was a minor bingle on the highway, so traffic slowed down.","zh":"高速上发生了一起小碰撞，所以车流慢了下来。"},{"en":"My car got a scratched bumper after a bingle in the parking lot.","zh":"停车场里蹭了一下，我的车保险杠被刮花了。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal) To bump into something or have a minor collision; to knock or jolt.","zh":"（非正式）撞到；发生轻微碰撞；（使）受到一阵撞击/颠簸。"},"examples":[{"en":"He bingled the car while reversing, but there was no serious damage.","zh":"他倒车时轻轻撞了一下车，但没有严重损坏。"},{"en":"The bikes bingled together at the corner.","zh":"两辆自行车在拐角处轻轻撞到了一起。"}]}],"synonyms":["minor accident","fender-bender","bump","scrape","collision"],"phonetic":"/ˈbɪŋɡəl/","extraExplanation":["“bingle”在日常美式英语里不常见，更常出现在澳大利亚/新西兰的口语、新闻标题或交通报道中，语气通常比“accident/crash”轻，强调“小、轻微、没大事”。"]}
{"word":"bingo","summary":{"en":"“Bingo” is a number-marking game, and it’s also an excited shout meaning “I got it!”","zh":"“bingo”既指宾果游戏，也可作感叹词，表示“找到了/成功了！”"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A game where players listen for called numbers (or match patterns) and mark them on cards; the first to complete the required pattern wins.","zh":"宾果游戏：玩家听主持人报出数字（或匹配图案）并在卡片上做标记，最先完成规定图案的人获胜。"},"examples":[{"en":"We played bingo at the community center on Friday night.","zh":"我们周五晚上在社区中心玩了宾果游戏。"},{"en":"She won a small prize after getting bingo.","zh":"她喊出“bingo”后赢了一个小奖品。"}]},{"partOfSpeech":"int.","definition":{"en":"An exclamation said when you succeed, find something, or get the exact right answer: “Got it!”","zh":"（感叹词）表示成功、找到东西或答对了：“找到了！/就是它！”"},"examples":[{"en":"Bingo! That’s the file I was looking for.","zh":"Bingo！这就是我在找的文件。"},{"en":"I tried the last key—bingo, it worked!","zh":"我试了最后一把钥匙——bingo，打开了！"}]}],"synonyms":["(int.) got it","(int.) yes!","(int.) that’s it","(int.) nailed it","(n.) lotto (similar, not the same game)"],"phonetic":"/ˈbɪŋɡoʊ/","extraExplanation":["“Bingo!” 作为感叹词在英语里很常见，语气通常带一点兴奋和得意，类似中文的“中了！”“搞定！”“就是这个！”。在正式写作中不常用，更常见于口语、影视台词或轻松的文字。","宾果游戏在英语国家常见于社区活动、慈善筹款（charity bingo）或老人活动中心；因此它也带有一种“社区娱乐/轻松社交”的文化氛围。"]}
{"word":"bingos","summary":{"en":"“Bingos” usually means the plural of “bingo”: multiple bingo games/rounds or bingo cards.","zh":"“bingos”通常是“bingo”的复数：指多场/多局宾果游戏，或多张宾果卡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of “bingo”) games of bingo, or the occasions/rounds when people play bingo.","zh":"（“bingo”的复数）宾果游戏；宾果游戏的场次/局数。"},"examples":[{"en":"The community center hosts bingos every Friday night.","zh":"社区中心每周五晚上都会举办宾果游戏活动。"},{"en":"We played a few bingos before dinner.","zh":"晚饭前我们玩了几局宾果。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) bingo cards or boards used in the game.","zh":"（复数）宾果卡/宾果盘（游戏用的卡片或板）。"},"examples":[{"en":"Please pick up your bingos at the front desk.","zh":"请到前台领取你的宾果卡。"},{"en":"She bought extra bingos for her friends.","zh":"她给朋友们多买了几张宾果卡。"}]}],"synonyms":["bingo games","bingo rounds","bingo cards"],"phonetic":"/ˈbɪŋɡoʊz/","extraExplanation":["“Bingo”最常见是名词（游戏名），也常作为感叹词“Bingo!”表示“对了！/中了！/就是这个！”，用于找到答案或成功完成某事时。注意：你输入的“bingos”一般只是名词复数；如果你想表达感叹“Bingo!”通常不加 -s。","宾果游戏在英语文化中常见于社区活动、慈善筹款、老年活动中心等场景，所以你可能会看到诸如“charity bingo night（慈善宾果之夜）”之类的表达。"]}
{"word":"bingy","summary":{"en":"“Bingy” is an informal adjective meaning “easy to binge,” especially to binge-watch.","zh":"“bingy”是非正式形容词，指“很适合/让人忍不住一口气刷完的”，尤其用于追剧。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Like a binge; making you want to do something in large amounts for a long time (especially watch many episodes in one sitting).","zh":"（非正式）像“狂刷/暴饮暴食式”的；让人忍不住一次做很多、持续很久（尤其指一口气追很多集）。"},"examples":[{"en":"This show is so bingy—I watched five episodes last night.","zh":"这部剧太“上头”了——我昨晚一口气看了五集。"},{"en":"I’m looking for a bingy podcast for my long flight.","zh":"我想找一档适合一口气听很多集的播客，飞机上听。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) Related to the verb “to bing” (to make a short ringing sound, like a bell).","zh":"（很少见）与动词“bing”（发出叮的一声，如铃声）有关的。"},"examples":[{"en":"The app has a little bingy notification sound.","zh":"这个应用的提示音有点“叮”的感觉。"}]}],"synonyms":["binge-worthy","addictive","compulsive"],"phonetic":"/ˈbɪndʒi/","extraExplanation":["“bingy”不是非常标准或常见的拼写；更常见的是写成“binge-y”（也有人写作“bingey”），意思是“让人忍不住想一口气刷完的”。","在日常语境里它常和“binge-watch（追剧/刷剧）”“binge-read（刷书/一口气读完）”一起出现。","如果你本来想写的是别的词（例如“binge”“bingo”“binging”），告诉我句子上下文，我可以帮你确认正确拼写和意思。"]}
{"word":"binh","summary":{"en":"“Binh” is most commonly a Vietnamese name (often “Bình”), associated with the idea of peace or calm.","zh":"“Binh”最常见是越南人名（常写作“Bình”），含义多与“和平、平静”相关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Vietnamese given name (often written “Bình” with a tone mark) meaning “peace” or “calm.”","zh":"越南人的名字（常写作带声调的“Bình”），意思是“和平 / 平静”。"},"examples":[{"en":"Binh is my classmate from Vietnam.","zh":"Binh 是我来自越南的同学。"},{"en":"In Vietnamese, “Bình” can suggest peace and calm.","zh":"在越南语里，“Bình”常有“和平、平静”的含义。"}]},{"partOfSpeech":"other","definition":{"en":"a name used in some Vietnamese place names (for example, in names that include “Bình”).","zh":"用于一些越南地名中的词素（例如地名里包含“Bình”的情况）。"},"examples":[{"en":"She traveled through several provinces with “Binh/Bình” in their names.","zh":"她走访了几个名字里带 “Binh/Bình” 的省份。"}]}],"synonyms":["Bình (with Vietnamese diacritics)"],"phonetic":"/bɪn/","extraExplanation":["“Binh”更像是按英文拼写习惯写出来的越南语名字；标准越南语常写作“Bình”（带声调与元音标记）。去掉变音符号后，英文读者更容易输入与识别，但会丢失原本的发音与语义细节。","在英语语境里，它通常被当作专有名词（人名/地名）使用，一般不翻译；需要解释含义时，常说它与“peace（和平）/ calm（平静）”相关。"]}
{"word":"Binhdinh","summary":{"en":"Bình Định (often written “Binh Dinh/Binhdinh”) is a province in south-central Vietnam; it can also refer to a traditional Vietnamese martial arts tradition from that region.","zh":"Bình Định（常写作 Binh Dinh/Binhdinh）是越南中南部的一个省份；也可指源自该地区的越南传统武术传统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bình Định: a coastal province in south-central Vietnam, with its capital city Quy Nhơn.","zh":"平定省（Bình Định）：越南中南部沿海的一个省份，省会为归仁（Quy Nhơn）。"},"examples":[{"en":"Quy Nhơn is the capital of Bình Định Province in Vietnam.","zh":"归仁是越南平定省的省会。"},{"en":"She traveled from Đà Nẵng to Bình Định by train.","zh":"她从岘港坐火车到平定省。"}]},{"partOfSpeech":"n.","definition":{"en":"Bình Định (martial arts): a well-known Vietnamese traditional martial arts tradition associated with the Bình Định region.","zh":"平定武术（Bình Định）：与越南平定地区相关的著名越南传统武术流派/传统。"},"examples":[{"en":"He studies Bình Định martial arts as a traditional Vietnamese style.","zh":"他学习平定武术，作为一种越南传统流派。"},{"en":"Many people connect Bình Định with Vietnamese martial arts and the Tây Sơn era.","zh":"很多人会把平定与越南武术以及西山时代联系起来。"}]}],"synonyms":["Binh Dinh","Bình Định Province"],"phonetic":"/bɪn ˈdɪn/","extraExplanation":["“Bình Định”是越南语拼写，带有声调符号；在英文环境里常被简写成“Binh Dinh”或连写成“Binhdinh”。如果你是在地图、航班、地址里看到它，通常指越南的平定省。","“Đ”是越南语字母（不同于英语的D）；英文转写时常被写成普通的“D”。"]}
{"word":"Bini","summary":{"en":"Bini usually refers to the Edo people of Benin City (Nigeria) and their language (often called Edo).","zh":"Bini 通常指尼日利亚贝宁城一带的埃多人及其语言（常称 Edo）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Edo ethnic group from Benin City and surrounding areas in southern Nigeria (often also called Edo people)","zh":"（尼日利亚南部）贝宁城及周边地区的埃多人（常也称 Edo people）"},"examples":[{"en":"Many Bini traditions are closely connected to the history of the Benin Kingdom.","zh":"许多 Bini 传统与贝宁王国的历史紧密相关。"},{"en":"She is Bini and grew up in Edo State, Nigeria.","zh":"她是 Bini 人，在尼日利亚的埃多州长大。"}]},{"partOfSpeech":"n.","definition":{"en":"the Edo language spoken by the Bini people (often called Edo)","zh":"Bini 人所说的语言，即埃多语（也常称 Edo）"},"examples":[{"en":"He can speak Bini at home and English at school.","zh":"他在家说 Bini 语，在学校说英语。"},{"en":"This song includes a few lines in Bini.","zh":"这首歌里有几句 Bini 语。"}]}],"synonyms":["Edo (people)","Edo (language)"],"phonetic":"/ˈbiːni/","extraExplanation":["“Bini”常与“Benin”混淆：这里的 Bini 指尼日利亚贝宁城（Benin City）及其传统王国“贝宁王国（Kingdom of Benin）”相关的人群与语言；而现代国家“贝宁（Benin）”是西非另一个国家（旧称达荷美 Dahomey），并不相同。","在学术与新闻语境中，你也会看到“Edo people / Edo language”更常用；“Bini”属于较传统或特定语境下的称呼。"]}
{"word":"bini","summary":{"en":"“Bini” most commonly refers to the Edo (Benin) people of southern Nigeria (and sometimes their language). It can also relate to a Filipina term for “lady/young woman” (often binibini) or the Filipino girl group BINI.","zh":"“Bini”最常见指尼日利亚南部的贝宁（Edo/Benin）族群（有时也指其语言）。它也可关联菲律宾语中“女士/少女”的称呼（常见为 binibini），或指菲律宾女团 BINI。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Edo (Benin) ethnic group in southern Nigeria; also the language spoken by this group (often called Edo).","zh":"尼日利亚南部贝宁（Edo/Benin）族群的成员；也可指其语言（常称为Edo语）。"},"examples":[{"en":"The Bini people have a long history of bronze casting and royal art.","zh":"贝宁族（Bini）有悠久的青铜铸造与王室艺术传统。"},{"en":"She is studying Bini (Edo) to better understand local culture.","zh":"她在学习Bini（Edo语），以更好地了解当地文化。"}]},{"partOfSpeech":"n.","definition":{"en":"a Filipina term meaning “lady/young woman,” often seen in the longer form binibini; also used as a name or title in cultural contexts.","zh":"菲律宾语中表示“女士/年轻女子”的说法，常见于较长形式 binibini；也可在文化语境中作称呼或名称。"},"examples":[{"en":"In some traditional texts, binibini is used to address a young lady politely.","zh":"在一些传统文本中，binibini 用来礼貌地称呼年轻女士。"},{"en":"The poem describes a binibini walking through a quiet town.","zh":"诗中描写一位少女（binibini）走过安静的小镇。"}]},{"partOfSpeech":"n.","definition":{"en":"BINI: the name of a Filipino pop girl group (used as a proper noun).","zh":"BINI：菲律宾流行女子团体的名称（专有名词）。"},"examples":[{"en":"BINI released a new single this year.","zh":"BINI 今年发布了新单曲。"},{"en":"My sister is a big fan of BINI.","zh":"我妹妹是 BINI 的忠实粉丝。"}]}],"synonyms":["Edo (people/language)","Benin people (context-dependent)","binibini (Philippine usage)"],"phonetic":"/ˈbiːni/","extraExplanation":["“Bini”在英语里常见于人类学、历史或艺术语境，尤其与尼日利亚贝宁王国（Benin Kingdom）的文化遗产有关（如贝宁青铜器）。在语言名称上，有时会写作“Bini”，但更常见与更中性的称呼是“Edo”。","菲律宾语里的“binibini”带有较为文雅/传统的礼貌色彩；现代口语里更常见的说法可能是“babae”（女人/女性）或“dalaga”（未婚年轻女子），具体取决于语境。"]}
{"word":"binibini","summary":{"en":"Binibini is a Filipino (Tagalog) word meaning “young lady” or “Miss,” used politely and sometimes in formal/pageant contexts.","zh":"Binibini 是菲律宾语（他加禄语）中“年轻女士/小姐”的意思，常用于礼貌称呼，也可见于正式或选美相关语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Tagalog/Filipino) A young woman; “Miss,” often used as a polite form of address.","zh":"（他加禄语/菲律宾语）年轻女性；“小姐”，常作礼貌称呼。"},"examples":[{"en":"Excuse me, binibini, you dropped your wallet.","zh":"不好意思，小姐，你的钱包掉了。"},{"en":"In old Filipino stories, a binibini is often a well-bred young lady.","zh":"在一些古老的菲律宾故事里，binibini 常指受过良好教养的年轻小姐。"}]},{"partOfSpeech":"n.","definition":{"en":"A respectful title for an unmarried woman, similar to “Miss,” sometimes associated with pageant or formal contexts.","zh":"对未婚女性的尊称，类似“Miss”，有时也与选美或正式场合相关。"},"examples":[{"en":"She joined Binibining Pilipinas, a major national pageant.","zh":"她参加了“Binibining Pilipinas”（菲律宾全国性重要选美比赛）。"},{"en":"The host announced, “Binibini Maria Santos,” and she walked onstage.","zh":"主持人宣布“玛丽亚·桑托斯小姐”，她随即走上舞台。"}]}],"synonyms":["Miss","young lady","maiden"],"phonetic":"/ˌbiːniˈbiːni/","extraExplanation":["“Binibini”是菲律宾语（他加禄语）词汇，常见于传统或较正式的语境。现代日常口语里，人们也常用“Miss”或“Ms.”来称呼女性，尤其在英语影响较强的场合。","“Binibining Pilipinas”直译可理解为“菲律宾小姐”，是菲律宾知名选美赛事名称之一；因此这个词在国际语境中也常因选美新闻而被看见。"]}
{"word":"biniodide","summary":{"en":"Biniodide is an older term for a diiodide compound, often specifically mercuric iodide (HgI₂).","zh":"Biniodide 是较旧的说法，指含两个碘原子的二碘化物，常特指二碘化汞（HgI₂）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound containing two iodine atoms (a “diiodide”); in older usage, often referring specifically to mercuric iodide (HgI₂).","zh":"含有两个碘原子的化合物（即“二碘化物/二碘化物盐”）；在较旧的用法中，常特指“二碘化汞”（HgI₂）。"},"examples":[{"en":"In older medical texts, “biniodide of mercury” refers to mercuric iodide (HgI₂).","zh":"在较旧的医学文献中，“biniodide of mercury”指的是二碘化汞（HgI₂）。"},{"en":"The term biniodide is largely replaced by diiodide in modern chemistry writing.","zh":"在现代化学写作中，biniodide 这个词大多已被 diiodide（“二碘化物”）取代。"}]}],"synonyms":["diiodide","mercuric iodide (HgI₂)"],"phonetic":"/baɪˈnaɪəˌdaɪd/","extraExplanation":["“bi-”在旧式化学命名中常表示“两个/二价”，所以 biniodide 大致相当于今天更常见的 diiodide（di- 也表示“二”）。","历史上常见的固定搭配是“biniodide of mercury”（二碘化汞，HgI₂），曾用于消毒/杀菌相关记载，但现代语境更倾向用系统命名与安全规范表述。"]}
{"word":"biniou","summary":{"en":"Biniou is the Breton bagpipe, a traditional instrument from Brittany in France.","zh":"Biniou指布列塔尼风笛，是法国布列塔尼地区的传统乐器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional bagpipe from Brittany (a region in northwest France), used in Breton folk music","zh":"（法国西北部布列塔尼地区的）传统风笛，用于布列塔尼民间音乐"},"examples":[{"en":"At the festival, a musician played the biniou while dancers formed a circle.","zh":"在节庆上，一位乐手吹奏biniou风笛，舞者围成一个圆圈起舞。"},{"en":"The biniou’s bright, piercing sound can be heard outdoors during parades.","zh":"在游行时，biniou风笛明亮而尖锐的声音在户外也能听得很清楚。"}]}],"synonyms":["Breton bagpipe","bagpipe"],"phonetic":"/ˈbɪn.juː/","extraExplanation":["“Biniou”来自布列塔尼语（Breton），常见搭配是“biniou kozh”（意为“老式风笛”），音色更高更尖；现代也可指与苏格兰风笛相近的“biniou bras”（大风笛）。","在布列塔尼传统庆典与舞会（如 fest-noz，意为“夜间节庆”）中，biniou常与 bombarde（布列塔尼双簧管类吹奏乐器）合奏，形成非常有穿透力的民间乐队音响。"]}
{"word":"binit","summary":{"en":"“Bin it” means to throw something away (or abandon it), mainly in British English.","zh":"“Bin it”主要是英式英语，意思是把东西扔掉（也可指放弃/作废某个想法或计划）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(British informal) To throw something away; to put it in the trash.","zh":"（英式非正式）把某物扔掉；丢进垃圾桶。"},"examples":[{"en":"This milk smells bad—let’s bin it.","zh":"这牛奶闻起来变味了——把它扔了吧。"},{"en":"If the plan doesn’t work, we’ll bin it and try a new one.","zh":"如果这个计划不行，我们就把它作废，换一个新的。"},{"en":"He binned the old papers after scanning them.","zh":"他把旧文件扫描后就把它们扔掉了。"}]}],"synonyms":["throw it away","toss it","trash it","get rid of it","scrap it"],"phonetic":"/bɪn ɪt/","extraExplanation":["“Bin it”主要是英式口语；美式英语更常说“throw it away / toss it / trash it”。","这里的“bin”作动词使用，来自名词“bin”（箱子、桶），在英国日常语境里常指“垃圾桶”。","在更抽象的语境中也可以指“放弃/作废”一个想法或计划（类似“scrap it”）。"]}
{"word":"Binitarian","summary":{"en":"Binitarian refers to a theological view that God has two persons (often Father and Son), and it can also mean a person who holds that view.","zh":"Binitarian 指一种神学观点：上帝有两个位格（常指圣父与圣子）；也可指持此观点的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Theology) Believing that God has two distinct persons—typically the Father and the Son—rather than three (as in Trinitarian belief).","zh":"（神学）主张上帝只有两个不同“位格”（通常指圣父与圣子），而不是三个位格（如三位一体信仰）。"},"examples":[{"en":"Some early Christian groups were described as binitarian rather than trinitarian.","zh":"一些早期基督教群体被认为更接近“二位一体论”（binitarian），而不是“三位一体论”（trinitarian）。"},{"en":"The author argues for a binitarian reading of certain biblical passages.","zh":"作者主张用“二位一体论”的角度来解读某些《圣经》段落。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who holds a binitarian view of God.","zh":"持“二位一体论”观点的人；二位一体论者。"},"examples":[{"en":"He identifies as a binitarian and does not use the word “Trinity.”","zh":"他自认是二位一体论者，并不使用“三位一体”这个词。"},{"en":"In the debate, binitarians and trinitarians disagreed about the Holy Spirit’s status.","zh":"在辩论中，二位一体论者与三位一体论者对圣灵的地位看法不同。"}]}],"synonyms":["nontrinitarian","dyadic (in theology)","two-person Godhead (descriptive phrase)"],"phonetic":"/ˌbaɪnaɪˈtɛriən/","extraExplanation":["“binitarian”来自前缀 bi-（二）+ “-trinitarian”相关的构词方式，用来描述关于上帝位格数目的教义立场。","它多见于宗教史、神学讨论或教派立场说明中，属于较学术/宗教语境的词。日常英语里不常用，通常需要上下文（如与 Trinitarian 对比）才能理解。","注意：不同传统对“二位一体论/二神论/非三位一体论”的界定并不完全一致；写作时最好说明你指的是“父与子两位格”还是其他更宽泛的非三位一体观点。"]}
{"word":"binitarian","summary":{"en":"Binitarian describes a belief system in which God is understood as two persons (often the Father and the Son), and it can also mean a person who holds that belief.","zh":"Binitarian 指“二位一体论的”，即认为上帝为两位格（常指父与子）；也可指持该信仰的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Theology) Believing that God exists as two persons or aspects, usually the Father and the Son (rather than the Trinity of Father, Son, and Holy Spirit).","zh":"（神学）二位一体论的；认为上帝以两位格或两个面向存在，通常指“父与子”（不同于“三位一体”的父、子、圣灵）。"},"examples":[{"en":"Some historians describe certain early Christian groups as binitarian rather than fully Trinitarian.","zh":"一些历史学者认为，某些早期基督教群体更接近二位一体论，而非完整的三位一体论。"},{"en":"The article compares binitarian and Trinitarian views of the Godhead.","zh":"这篇文章比较了二位一体论与三位一体论对神性的理解。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who holds a binitarian belief.","zh":"二位一体论者；持二位一体信仰的人。"},"examples":[{"en":"He identifies as a binitarian in his interpretation of Christian doctrine.","zh":"在他对基督教教义的解读中，他自认是二位一体论者。"}]}],"synonyms":["dyadic (in theology contexts)","non-Trinitarian (broader)","two-person Godhead (descriptive phrase)"],"phonetic":"/ˌbaɪnɪˈtɛriən/","extraExplanation":["“binitarian”来自前缀 bi-（二）+ -nit-（与“unit/one”同源的概念）+ -arian（表示信仰/立场的人或形容词）。日常英语里很少用，多见于神学、教会史、宗教研究写作。","它常用来与 “Trinitarian（三位一体论的）” 和 “Unitarian（上帝单一位格论的/一位论的）” 对照讨论。不同传统对术语的使用有差异，有时也会牵涉“是否承认圣灵为位格”的争论，因此具体含义常需要看上下文。"]}
{"word":"Binitarianism","summary":{"en":"Binitarianism is the belief that God exists as two persons, usually the Father and the Son.","zh":"Binitarianism 指认为上帝以两个位格存在（通常为圣父与圣子）的神学观点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Christian theological belief that God exists as two persons (typically the Father and the Son), rather than three persons as in Trinitarianism.","zh":"一种基督教神学观点，认为上帝以两个位格存在（通常指“圣父”和“圣子”），而非三位一体论所说的三个位格。"},"examples":[{"en":"In the debate, she explained binitarianism as belief in the Father and the Son, but not the Trinity.","zh":"在那场辩论中，她把“二位一体论”解释为相信圣父与圣子，但不接受三位一体。"},{"en":"Some groups are described by scholars as binitarian because they emphasize two divine persons.","zh":"一些团体被学者描述为“二位一体论”倾向，因为他们强调两个神圣位格。"}]}],"synonyms":["dyadic theology","two-person Godhead (informal)"],"phonetic":"/ˌbaɪnɪˈtɛriənɪzəm/","extraExplanation":["“Binitarianism”主要出现在学术讨论中，用来描述某些基督教传统或群体对“神的位格”数目与关系的理解。它常被拿来与：\n- Trinitarianism（三位一体论：父、子、圣灵）\n- Unitarianism（一位论/一神位格论：强调上帝只有一个位格）\n作对比。\n\n需要注意：不同宗派对这些标签的接受程度不同；有的群体不会自称“binitarian”。"]}
{"word":"binitarianism","summary":{"en":"Binitarianism is the belief that God has two distinct persons, usually the Father and the Son.","zh":"二位一体论指认为上帝有两个不同位格，通常是圣父与圣子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Christian theological belief that God is understood as having two distinct persons (usually the Father and the Son), rather than three (as in the Trinity).","zh":"一种基督教神学观点，认为上帝由两个不同的“位格”（通常指圣父与圣子）构成，而不是三个位格（如“三位一体”）。"},"examples":[{"en":"Some scholars describe certain early Christian groups as holding forms of binitarianism rather than full Trinitarianism.","zh":"一些学者将某些早期基督教团体描述为持有某种“二位一体论”，而非完整的“三位一体论”。"},{"en":"In this debate, binitarianism is contrasted with Unitarianism and Trinitarianism.","zh":"在这场讨论中，“二位一体论”常被拿来与“一位论”和“三位一体论”作对比。"}]}],"synonyms":["binitarian theology","two-person Godhead (informal paraphrase)"],"phonetic":"/ˌbaɪnəˈtɛriəˌnɪzəm/","extraExplanation":["“Binitarianism（二位一体论）”多用于学术或宗教学讨论中，并不是大多数主流教会对自身信仰的常用自称。","它常出现在对早期基督教教义发展史的研究里，用来描述一些强调“父与子”的神性关系、但对“圣灵”的位格地位不作三位一体式界定的观点或传统。","相关对照术语：Trinitarianism（三位一体论，主流尼西亚传统）；Unitarianism（一位论，强调上帝是一位，否认三个位格的神性结构）。"]}
{"word":"binits","summary":{"en":"“Bin it” means “throw it away,” especially in British English.","zh":"“Bin it”表示“把它扔掉”，主要是英式英语用法。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(British informal) To throw something away; to put it in the trash.","zh":"（英式非正式）把某物扔掉；丢进垃圾桶。"},"examples":[{"en":"This receipt is old—just bin it.","zh":"这张收据都旧了——直接扔了吧。"},{"en":"If the milk smells sour, bin it and buy a new one.","zh":"如果牛奶闻起来酸了，就把它扔掉再买新的。"},{"en":"He binned the broken headphones after they stopped working.","zh":"耳机坏了不响后，他就把它扔掉了。"}]}],"synonyms":["throw it away","toss it","trash it","discard it"],"phonetic":"/bɪn ɪt/","extraExplanation":["“bin it”主要见于英式英语（UK）。在美式英语里更常说“throw it away / toss it / trash it”。","你输入的“binits”可能是把“bin it’s…”连写、打字误拼，或把短语“bin it”误当成一个单词。"]}
{"word":"Bink","summary":{"en":"“Bink” is an informal word meaning a light tap/hit or the short, sharp sound it makes.","zh":"“bink”是非正式用词，表示轻敲/轻打，或指这种动作发出的短促清脆声。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(informal) To hit or tap something, especially making a short, sharp sound (often used playfully).","zh":"（非正式）轻敲、轻打某物，常带有“叮/咚”一声的感觉（多为俏皮用法）。"},"examples":[{"en":"He binked the table with his knuckle to get everyone’s attention.","zh":"他用指关节轻敲桌面，想让大家注意。"},{"en":"The ball binked off the post and rolled away.","zh":"球“叮”地撞到门柱上，然后滚开了。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) A short, sharp “ping” sound, like something lightly striking metal or glass.","zh":"（非正式）短促清脆的“叮”声，像轻轻碰到金属或玻璃的声音。"},"examples":[{"en":"I heard a bink as the spoon hit the mug.","zh":"我听到勺子碰到杯子时发出一声清脆的“叮”。"},{"en":"There was a tiny bink, and the coin bounced on the floor.","zh":"传来一声小小的“叮”，硬币在地上弹了一下。"}]}],"synonyms":["tap","knock","ping","clink","plink"],"phonetic":"/bɪŋk/","extraExplanation":["“bink”在现代英语里不算常用词，更常见于口语/拟声或个人化表达（比如聊天、小说对白、游戏解说）。它的感觉接近拟声词（onomatopoeia），强调“轻、短、脆”的碰撞声。","容易和更常见的“binky”（安抚奶嘴/婴儿奶嘴，主要是美式口语）混淆；“bink”本身通常不表示这个意思。"]}
{"word":"bink","summary":{"en":"“Bink” is slang for winning big unexpectedly (especially in poker), and it can also mean a big surprise win.","zh":"“bink”多为俚语，指（尤指扑克中）意外爆冷赢很大；也可指一次爆冷的大胜。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(slang) To win something big unexpectedly, especially in poker or gambling.","zh":"（俚语）意外赢到一大笔（尤指扑克或赌博中爆冷大赢）。"},"examples":[{"en":"He binked a huge tournament and paid off his student loans.","zh":"他爆冷拿下一个大型锦标赛的冠军奖金，把学生贷款还清了。"},{"en":"I didn’t play great, but I binked the jackpot on a lucky hand.","zh":"我其实打得一般，但靠一手好运中了头奖。"}]},{"partOfSpeech":"n.","definition":{"en":"A big, often unexpected win (especially in poker).","zh":"（尤指扑克）一场意外的大胜利／一笔爆冷奖金。"},"examples":[{"en":"That final table was a bink—no one thought she’d win.","zh":"那场决赛桌简直是爆冷大胜——没人想到她会赢。"},{"en":"After months of losses, he finally got a bink.","zh":"连输几个月后，他终于爆了一次大冷、赢了一把大的。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare, informal) A light hit, tap, or small bump; to tap lightly.","zh":"（罕见，非正式）轻轻一碰／轻轻敲一下；轻拍。"},"examples":[{"en":"I binked my knee on the corner of the table.","zh":"我膝盖轻轻撞到了桌角。"},{"en":"The ball binked off the post and rolled away.","zh":"球轻轻碰了一下门柱就滚开了。"}]}],"synonyms":["hit the jackpot","win big","score (a win)","strike it lucky"],"phonetic":"/bɪŋk/","extraExplanation":["“bink”在日常英语里不算常用词，最常见的语境是扑克/博彩圈：表示“突然中了大奖/爆冷夺冠”。在普通对话中更常用的说法是 win big, hit the jackpot, score a big win。"]}
{"word":"Binky","summary":{"en":"Binky is a common American informal word for a baby’s pacifier, and sometimes for a child’s comfort object or a nickname.","zh":"Binky 是美式英语里很常见的口语词，主要指婴儿的安抚奶嘴，也可指孩子的安抚物或用作昵称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a pacifier (a rubber or silicone nipple that babies suck for comfort)","zh":"（婴儿用的）安抚奶嘴；奶嘴"},"examples":[{"en":"The baby stopped crying as soon as she got her binky.","zh":"宝宝一拿到安抚奶嘴就不哭了。"},{"en":"Did you pack an extra binky in the diaper bag?","zh":"你在尿布包里多带了一个安抚奶嘴吗？"}]},{"partOfSpeech":"n.","definition":{"en":"a comfort object (especially a child’s favorite blanket or stuffed toy used for reassurance)","zh":"（尤指儿童的）安抚物；安全感物品（如小毯子、玩偶）"},"examples":[{"en":"He won’t sleep without his binky blanket.","zh":"没有他的“安抚小毯子”，他就睡不着。"},{"en":"Her stuffed bunny is her binky when she feels nervous.","zh":"她紧张时会抱着那只毛绒兔子当“安抚物”。"}]},{"partOfSpeech":"n.","definition":{"en":"a nickname or pet name (for a person or animal)","zh":"（人或宠物的）昵称；爱称"},"examples":[{"en":"Everyone calls my dog Binky.","zh":"大家都叫我的狗“Binky”。"},{"en":"Binky, could you come here for a second?","zh":"Binky，你能过来一下吗？"}]}],"synonyms":["pacifier","dummy","soother","comfort object","blankie"],"phonetic":"/ˈbɪŋki/","extraExplanation":["“binky”在美式英语里最常见的意思是“安抚奶嘴”，语气偏口语、偏儿童化；在育儿场景中非常常用。","有些家庭也会把孩子的“安抚物”（如毯子、玩偶）统称为binky，表示“带来安全感的东西”。具体指什么要看语境。"]}
{"word":"binman","summary":{"en":"A British English word for a worker who collects and empties trash bins.","zh":"英式英语中指“收垃圾/倒垃圾的工作人员”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person whose job is to collect and empty trash bins (garbage cans)","zh":"收垃圾的人；垃圾清运工（英式常用）"},"examples":[{"en":"The binman comes every Tuesday morning to collect the rubbish.","zh":"收垃圾的人每周二早上来收垃圾。"},{"en":"Please put the bins out tonight so the binman can empty them.","zh":"今晚请把垃圾桶拿到外面，这样清运工就能倒垃圾。"}]}],"synonyms":["garbage collector","sanitation worker","waste collector","refuse collector"],"phonetic":"/ˈbɪn.mən/","extraExplanation":["“binman”主要是英式英语（UK）口语用法；在美式英语里更常说“garbage collector”或“sanitation worker”。","bin =（户外）垃圾桶；rubbish（英）≈ trash/garbage（美）。因此在英国语境里你会更常听到“the binmen”（复数）来指一组清运人员。","有些地方也会用更中性的说法“refuse collector / waste collector”，正式场合常用“sanitation worker”。"]}
{"word":"binmen","summary":{"en":"“Binmen” is a mainly British word meaning the workers who collect household trash (the plural of “binman”).","zh":"“binmen”主要是英式用法，指收集住户垃圾的环卫工人（“binman”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(chiefly British) plural of “binman”: workers who collect household trash (rubbish) from bins.","zh":"（主要英式）“binman”的复数：收集住户垃圾桶（垃圾箱）里垃圾的环卫工人。"},"examples":[{"en":"The binmen come every Tuesday morning.","zh":"收垃圾的环卫工人每周二早上来。"},{"en":"The binmen missed our street because of the roadworks.","zh":"因为道路施工，收垃圾的环卫工人错过了我们这条街。"}]},{"partOfSpeech":"phrase","definition":{"en":"Two-word form “bin men”: men who deal with bins; often used informally to mean garbage collectors.","zh":"两词写法“bin men”：与垃圾桶相关的人；口语中常指收垃圾的人。"},"examples":[{"en":"Could you move the bins? The bin men are here.","zh":"你能把垃圾桶挪一下吗？收垃圾的人到了。"}]}],"synonyms":["garbage collectors","trash collectors","sanitation workers","refuse collectors"],"phonetic":"/ˈbɪnˌmɛn/","extraExplanation":["“binman / binmen”在英国更常见；美式英语更常说“garbage collectors / trash collectors / sanitation workers”。","“bin”在英式英语里常指户外带轮子的垃圾桶（wheelie bin）；在美式英语里“bin”更常指“箱/盒/容器”，垃圾桶更常说“trash can”。"]}
{"word":"binna","summary":{"en":"“binna” is a Scots dialect form meaning “isn’t/aren’t” (sometimes “wasn’t/weren’t” by context).","zh":"“binna”是苏格兰英语方言，意思相当于“isn’t/aren’t”（有时按语境也可理解为“wasn’t/weren’t”）。"},"definitions":[{"partOfSpeech":"aux.","definition":{"en":"(Scots dialect) A spoken contraction meaning “is not / are not” (sometimes also “was not / were not,” depending on context).","zh":"（苏格兰英语方言）口语缩写，意思是“不是/不（is not / are not）”，在语境中有时也可表示“不是/不曾（was not / were not）”。"},"examples":[{"en":"He binna ready yet.","zh":"他还没准备好。"},{"en":"Ye binna coming the day?","zh":"你今天不来吗？"},{"en":"It binna fair to blame her.","zh":"怪她是不公平的。"}]},{"partOfSpeech":"n.","definition":{"en":"A given name or place name (less common in everyday English).","zh":"人名或地名（在日常英语中较少见）。"},"examples":[{"en":"Binna is used as a personal name in some communities.","zh":"“Binna”在一些社群中被用作人名。"}]}],"synonyms":["isn't","aren't","wasn't","weren't"],"phonetic":"/ˈbɪnə/","extraExplanation":["“binna”主要见于苏格兰英语（Scots）口语中，相当于标准英语里的“isn’t/aren’t”。它常出现在带有苏格兰地域色彩的对话、民谣与文学中（例如描写苏格兰口音的作品）。","读这种方言词时，理解要点是：把它当作“be + not”的缩写来还原成标准英语，再判断主语是单数还是复数（isn’t/aren’t），以及时态语境（有时也可理解为 wasn’t/weren’t）。"]}
{"word":"binnacle","summary":{"en":"A binnacle is the stand or box on a ship that holds the compass and sometimes other navigation tools; it can also refer to where navigational records are kept.","zh":"binnacle 指船上放置并保护指南针（及其他导航仪器）的罗经座/罗经柜；也可引申为存放航海记录（如航海日志）的地方。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A housing or stand on a ship that holds and protects the compass (and often other navigation instruments).","zh":"（船上的）罗经座；罗经柜（用来固定并保护指南针，常也放其他导航仪器）。"},"examples":[{"en":"The captain checked the compass in the binnacle before changing course.","zh":"船长在改变航向前检查了罗经座里的指南针。"},{"en":"A dim light inside the binnacle helps sailors read the compass at night.","zh":"罗经座内的微光能帮助水手在夜间读指南针。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension) The place where a ship’s navigational records are kept, such as the ship’s logbook.","zh":"（引申）船上存放航海记录的地方（如航海日志）。"},"examples":[{"en":"After the storm, the officer returned the log to the binnacle.","zh":"风暴过后，值班军官把航海日志放回罗经柜处。"}]}],"synonyms":["compass stand","compass housing","compass box"],"phonetic":"/ˈbɪnəkəl/","extraExplanation":["“binnacle”主要是航海用语，常出现在海事小说、航海史或船舶操作说明中。现代船只虽然可能用电子导航设备，但“binnacle”仍指罗经的安装/保护位置。","词源上与“bin”（箱、柜）有关，形象地表示“装罗经的柜子/座”。"]}
{"word":"binnacles","summary":{"en":"Binnacles are the protective stands or housings that hold a ship’s compass.","zh":"binnacles 指船上用来固定并保护罗盘的罗盘柜/罗盘座（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a housing or stand (usually on a ship) that holds and protects a compass, often with a light for reading it at night","zh":"（通常在船上）放置并保护罗盘的罗盘柜/罗盘座（常带照明，便于夜间读数）"},"examples":[{"en":"The captain checked the compass in the binnacle before changing course.","zh":"船长在改变航向前查看了罗盘柜里的罗盘。"},{"en":"A small lamp inside the binnacle made the compass easy to read at night.","zh":"罗盘柜内的小灯让夜里读罗盘更方便。"}]}],"synonyms":["compass binnacle","compass stand","compass housing","compass case"],"phonetic":"/ˈbɪnəkəl/","extraExplanation":["“binnacles”是复数形式，单数是“binnacle”。在航海语境中，它不是“罗盘”本身，而是装着罗盘的“柜/座/罩”，用于固定、保护并减少风雨与碰撞的影响。","该词常见于航海文学或海事记录，例如描写船桥、甲板设备、航向与指挥操作的场景。"]}
{"word":"binned","summary":{"en":"“Binned” usually means “thrown away” (especially UK English) or “sorted into bins/categories” (data/organization).","zh":"“binned”通常表示“被扔掉/丢弃”（尤用于英式英语），也可表示“被分箱/归类”（数据或整理语境）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “bin”: to put something into a bin (trash can) or container.","zh":"“bin”的过去式和过去分词：把某物放进垃圾桶/箱子或容器里。"},"examples":[{"en":"I binned the empty bottles after the party.","zh":"聚会后我把空瓶子扔进了垃圾桶。"},{"en":"She binned the old receipts to keep the desk tidy.","zh":"她把旧收据丢掉，让桌面更整洁。"}]},{"partOfSpeech":"v.","definition":{"en":"(especially in UK English) past tense and past participle of “bin”: to throw something away; to discard.","zh":"（尤用于英式英语）“bin”的过去式和过去分词：扔掉；丢弃。"},"examples":[{"en":"We binned the broken chair instead of trying to fix it.","zh":"我们把坏椅子丢了，而不是尝试修理。"},{"en":"He binned the idea because it was too risky.","zh":"他否决/放弃了这个想法，因为风险太大。"}]},{"partOfSpeech":"v.","definition":{"en":"(data/organization) past tense and past participle of “bin”: to group or sort items into categories (“bins”).","zh":"（数据/整理）“bin”的过去式和过去分词：把事物分组、归类到不同“箱/区间（bin）”中。"},"examples":[{"en":"The data was binned by age group.","zh":"数据按年龄段进行了分组。"},{"en":"We binned the products into three price ranges.","zh":"我们把产品按价格分成三个区间。"}]},{"partOfSpeech":"adj.","definition":{"en":"informal: thrown away or rejected; discarded.","zh":"非正式：被扔掉的；被拒绝/被淘汰的。"},"examples":[{"en":"The binned documents were shredded later.","zh":"那些被丢弃的文件后来被粉碎了。"}]}],"synonyms":["threw away","discarded","tossed","trashed","dumped","sorted","categorized","grouped"],"phonetic":"/bɪnd/","extraExplanation":["“bin”在英式英语里很常用，既可以指“垃圾桶”，也可以作动词表示“扔掉”。在美式英语中更常见的说法是 throw away / toss / trash。","在数据分析里，“bin”常见于直方图（histogram）或分箱（binning）：把连续数值按区间归类，便于统计和可视化。"]}
{"word":"Binni","summary":{"en":"“Binni” is most commonly used as a person’s name or nickname in English contexts.","zh":"“Binni”在英语语境中最常见的用法是人名或昵称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name or nickname (a proper noun), used for a person; meaning depends on the individual’s cultural/linguistic background.","zh":"人名或昵称（专有名词）；具体含义取决于使用者的文化与语言背景。"},"examples":[{"en":"Binni is my classmate in the afternoon English program.","zh":"Binni 是我下午英语课程的同学。"},{"en":"Please ask Binni if they can join the meeting at 3 p.m.","zh":"请问一下 Binni 能不能参加下午三点的会议。"}]},{"partOfSpeech":"other","definition":{"en":"(less common) a spelling variant of the nickname “Binny,” sometimes used informally in writing.","zh":"（较少见）“Binny”的一种拼写变体，有时在非正式书写中使用。"},"examples":[{"en":"Her username is Binni_97, but her friends call her Binny.","zh":"她的用户名是 Binni_97，但朋友都叫她 Binny。"}]}],"synonyms":["Binny","Benny"],"phonetic":"ˈbɪni","extraExplanation":["“Binni”在英语里通常被当作名字来看待，而不是常见词汇，所以词典式的“固定含义”不多。它可能出现在不同文化的姓名中，也可能是“Benny / Binny”等名字的个性化拼写。","如果你是在某个具体句子、品牌名、游戏角色或地区方言里看到 Binni，可以把上下文发我，我能更准确判断它的意思与用法。"]}
{"word":"Binnie","summary":{"en":"“Binnie” is usually a personal name (nickname or given name) or a surname.","zh":"“Binnie”通常是人名（昵称/名字）或姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name or nickname (often used as a friendly, informal name for someone).","zh":"人名或昵称（常用作亲切、非正式的称呼）。"},"examples":[{"en":"Binnie is my cousin’s nickname at home.","zh":"Binnie 是我表妹在家里的昵称。"},{"en":"Everyone in the club calls her Binnie because it’s easy to remember.","zh":"俱乐部里大家都叫她 Binnie，因为这个名字好记。"}]},{"partOfSpeech":"other","definition":{"en":"a family name (surname).","zh":"姓氏。"},"examples":[{"en":"Dr. Binnie will see you now.","zh":"Binnie 医生现在会见你。"},{"en":"I read an article by James Binnie.","zh":"我读了一篇 James Binnie 写的文章。"}]}],"synonyms":["nickname (related idea)","given name (related idea)","surname (related idea)"],"phonetic":"/ˈbɪni/","extraExplanation":["“Binnie”在英语里更常见为专有名词（人名/姓氏），不是常用词汇。发音通常重音在第一个音节。","作为姓氏时，常见于苏格兰背景的家族；有资料认为它可能与苏格兰的地名有关（例如 West Lothian 一带的地名）。","作为昵称时，并不固定对应某一个正式名字，可能来自名字的缩短、儿童语言、或家人朋友之间的专属称呼。"]}
{"word":"binning","summary":{"en":"Binning means putting items into bins for organization, or grouping data into ranges; in informal British English it can also mean throwing something away.","zh":"Binning 指把物品分箱整理，或在数据中按区间分组；在非正式英式英语中也可指把东西丢弃。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of putting things into bins/containers for storage or organization","zh":"把东西放进箱子/桶等容器里进行收纳或分类的行为（分箱、装箱）"},"examples":[{"en":"After unpacking, she spent the afternoon binning the tools by size.","zh":"拆完箱后，她花了一下午按尺寸把工具分箱整理。"},{"en":"Clear labels make binning supplies much faster.","zh":"清晰的标签会让物资分箱整理快很多。"}]},{"partOfSpeech":"n.","definition":{"en":"(statistics/data) the act of grouping values into ranges (“bins”) to simplify analysis or make charts like histograms","zh":"（统计/数据）把数值按区间分组（分箱）以便分析或绘制直方图等图表的做法"},"examples":[{"en":"We used binning to turn ages into five-year groups for the report.","zh":"我们用分箱把年龄按5岁一个区间分组，用于报告。"},{"en":"Too much binning can hide important details in the data.","zh":"分箱过多可能会掩盖数据中的重要细节。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal, especially British English) the act of throwing something away; discarding","zh":"（非正式，尤指英式英语）把某物扔掉、丢弃"},"examples":[{"en":"They’re binning the old posters to make room for new ones.","zh":"他们把旧海报丢掉，好腾地方放新的。"}]}],"synonyms":["sorting","categorizing","grouping","bucketing","discarding"],"phonetic":"/ˈbɪnɪŋ/","extraExplanation":["“bin”在英式英语里常指“垃圾桶”，所以“to bin (something)”常见意思是“把……扔进垃圾桶、丢掉”。在美式英语里更常说“throw away / toss out”。","数据分析里的“binning”常用于直方图（histogram）、特征工程（machine learning），核心是“把连续数值变成区间类别”，但区间设得太粗会损失信息。"]}
{"word":"Binnings","summary":{"en":"“Binnings” usually means multiple instances or methods of sorting into bins; in data analysis, it often refers to different ways of grouping values into ranges (bins). It can also be a surname.","zh":"“Binnings”通常指多次/多种“分装归类”的方式或结果；在数据分析中多指把数值按区间分组（分箱）的不同做法或分组结果；也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) acts or results of putting things into bins; sorting or storing items by placing them into separate containers or categories.","zh":"（复数）把东西放进箱/桶里（bin）的行为或结果；按类别分装、归类存放。"},"examples":[{"en":"The warehouse improved efficiency by changing its binnings for small parts.","zh":"仓库通过改变小零件的分装/归类方式，提高了效率。"},{"en":"Different binnings can reduce damage when shipping fragile items.","zh":"不同的分装方式可以在运输易碎品时减少损坏。"}]},{"partOfSpeech":"n.","definition":{"en":"(data/statistics) different ways of grouping continuous values into “bins” (ranges), or the resulting grouped counts.","zh":"（数据/统计）把连续数值按区间“分箱”（分组）的不同方式，或分箱后的分组计数结果。"},"examples":[{"en":"Try several binnings to see how the histogram shape changes.","zh":"试几种不同的分箱方式，看看直方图的形状如何变化。"},{"en":"Coarser binnings hide small trends, while finer binnings show more detail but add noise.","zh":"更粗的分箱会隐藏细小趋势；更细的分箱能显示更多细节，但可能引入噪声。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname) “Binnings.”","zh":"姓氏：Binnings。"},"examples":[{"en":"Ms. Binnings will lead the meeting today.","zh":"Binnings 女士今天将主持会议。"}]}],"synonyms":["sorting","grouping","categorizing","bucketing"],"phonetic":"/ˈbɪnɪŋz/","extraExplanation":["“binning”在数据分析里也常说成“bucketing（分桶）”。选择分箱宽度会影响你看到的结论：箱太宽会把差异抹平，箱太窄会让图表看起来很“抖”。常见场景包括直方图（histogram）、按年龄段/价格区间分组等。"]}
{"word":"binnite","summary":{"en":"“Binnite” is likely a misspelling of “bin night,” meaning the night before trash collection when you put the bins out.","zh":"“binnite”很可能是“bin night”的误拼，指收垃圾前一晚把垃圾桶推出去的那晚。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(informal, mainly UK/Australia) The evening/night before garbage (trash) is collected, when people put their bins out.","zh":"（非正式，多见于英国/澳大利亚）垃圾收集前的那天晚上，人们把垃圾桶推到路边等待收走。"},"examples":[{"en":"It’s bin night, so don’t forget to put the recycling out.","zh":"今晚是收垃圾的晚上，别忘了把可回收物的桶推出去。"},{"en":"The street is crowded with bins on bin night.","zh":"收垃圾的晚上，整条街边都摆满了垃圾桶。"}]}],"synonyms":["trash night","garbage night","pick-up night"],"phonetic":"/bɪn naɪt/","extraExplanation":["“binnite”很可能是把“bin night”连写/误拼的形式；在英式英语和澳洲英语里，人们常用“bin night”指固定的收垃圾前一晚。美式英语更常说“trash night / garbage night / pick-up day”。"]}
{"word":"binnogue","summary":{"en":"Binnogue is an Irish-English word meaning a small pointed peak or hill.","zh":"binnogue 是一个带爱尔兰地域色彩的词，意思是“小山峰/尖顶的小山”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Irish English / from Irish) a small peak or pointed hill; a little pinnacle.","zh":"（爱尔兰英语/源自爱尔兰语）小山峰；尖顶的小山；小尖峰。"},"examples":[{"en":"From the valley, we could see a binnogue rising above the trees.","zh":"从山谷里，我们能看到树林上方突起的一座小山峰。"},{"en":"The hikers aimed for the binnogue before sunset.","zh":"徒步者计划在日落前到达那座小尖峰。"}]}],"synonyms":["small peak","hillock","pinnacle","knoll"],"phonetic":"/bɪˈnoʊɡ/","extraExplanation":["“binnogue”多见于爱尔兰相关语境，常被认为来自爱尔兰语 *binnóg*（含有“小尖峰/小突起”的意思），有时也会出现在地名或描写地形的文字中。因为属于地域性较强的词，在现代通用英语里不算常见。"]}
{"word":"Binny","summary":{"en":"Binny is usually a name (often a nickname) and is sometimes a Scottish place name; it’s not a common everyday vocabulary word.","zh":"Binny 通常是人名（多为昵称），有时也是苏格兰地名；它不是常见的日常英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a personal name used as a given name or (more commonly) a nickname, often for names like Ben/Benjamin or similar-sounding names; also used as a surname in some families","zh":"人名（名字或更常见的昵称），常见于 Ben/Benjamin 等相近名字的昵称形式；也可作为一些家族的姓氏"},"examples":[{"en":"Binny is short for Benjamin in our family.","zh":"在我们家，Binny 是 Benjamin 的昵称。"},{"en":"I met Binny at the library after class.","zh":"下课后我在图书馆见到了 Binny。"}]},{"partOfSpeech":"other","definition":{"en":"a place name in Scotland (rare in everyday English), seen in names like Binny Craig","zh":"苏格兰的地名（在日常英语中较少见），可见于如 Binny Craig 等名称中"},"examples":[{"en":"They went hiking near Binny Craig in West Lothian.","zh":"他们去西洛锡安的 Binny Craig 附近徒步了。"}]}],"synonyms":["Binnie (variant spelling)"],"phonetic":"/ˈbɪni/","extraExplanation":["“Binny”通常不是普通词汇而是专有名词（人名/昵称/姓氏/地名），书写时多用大写：Binny。","如果你想查的是相似拼写“Binnie”，它更常见于英语姓氏，也可能是昵称的另一种拼法。"]}
{"word":"binny","summary":{"en":"Binny is most commonly a personal name or nickname; in some regional informal English it can also mean a small bin/container.","zh":"Binny 最常见是人名或昵称；在某些地区的口语里也可指小箱子/容器（类似 bin）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name or nickname (often for people named Benjamin), used as a proper name","zh":"人名/昵称（常见于 Benjamin 的昵称之一），作为专有名词使用"},"examples":[{"en":"Binny is short for Benjamin in some families.","zh":"在一些家庭里，Binny 是 Benjamin 的昵称。"},{"en":"I met Binny at a study group after class.","zh":"我在课后的学习小组里认识了 Binny。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, regional) a small bin; a container for storing or throwing away things","zh":"（非正式/地域用法）小箱子；（储物或丢弃用的）容器、垃圾桶"},"examples":[{"en":"Put the old papers in the binny.","zh":"把旧纸张放进那个小箱子/桶里。"},{"en":"The kitchen binny is full again.","zh":"厨房的垃圾桶又满了。"}]}],"synonyms":["Benny (name/nickname)","Ben (name/nickname)","bin (container)"],"phonetic":"/ˈbɪni/","extraExplanation":["“binny”更多时候会被当作人名/昵称使用；表示“桶/箱子”的意思通常带有口语和地域色彩，而且更常见的拼写是“bin”或“binnie”。如果你能提供一句上下文（它出现在什么句子里/来自哪里），我可以更准确判断含义。"]}
{"word":"bino","summary":{"en":"“Bino” is an informal short form of “binoculars.”","zh":"“bino”是“binoculars（双筒望远镜）”的非正式缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Binoculars; a pair of field glasses used to see distant things more clearly.","zh":"（非正式）望远镜；双筒望远镜，用来更清楚地看远处的东西。"},"examples":[{"en":"Bring your bino if you want to watch birds on the trail.","zh":"如果你想在步道上观鸟，就把你的望远镜带上。"},{"en":"He lifted his bino and scanned the horizon.","zh":"他举起望远镜，扫视地平线。"}]}],"synonyms":["binoculars","binocs","field glasses"],"phonetic":"/ˈbɪnoʊ/","extraExplanation":["“bino”是“binoculars”的口语缩写，常见于户外活动（观鸟、狩猎、看球赛、徒步等）的对话或论坛里。正式写作中通常用“binoculars”。"]}
{"word":"binocle","summary":{"en":"A binocle is an old-fashioned small pair of eyeglasses (two lenses), often held up or clipped to the nose.","zh":"binocle 指一种旧式的小型双镜片眼镜，常为手持式或夹在鼻梁上。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(old-fashioned) A small pair of eyeglasses (two lenses), especially one that is held up to the eyes or clipped to the nose (similar to a pince-nez).","zh":"（旧式）小型双镜片眼镜，尤指手持式或夹在鼻梁上的眼镜（类似夹鼻眼镜 pince-nez）。"},"examples":[{"en":"In old novels, a gentleman may lift his binocle to examine someone more closely.","zh":"在旧小说里，绅士可能会举起他的 binocle 更仔细地打量别人。"},{"en":"She adjusted her binocle and continued reading the letter.","zh":"她调整了一下 binocle，继续读那封信。"}]}],"synonyms":["pince-nez","eyeglasses","spectacles","monocle (related)"],"phonetic":"ˈbɪnəkəl","extraExplanation":["“Binocle”源自法语（bi- “两” + -ocle 与“眼”相关），在19世纪到20世纪初的英法语境中较常见，带有一种“上流社会/复古”的气息。现代英语里更常用的词是 monocle（单片眼镜）或 pince-nez（夹鼻眼镜）。","文学或历史场景中使用 binocle，通常是为了营造年代感（如维多利亚时代、爱德华时代）或刻画人物的阶层与气质。"]}
{"word":"binocles","summary":{"en":"“Binocles” is an uncommon word meaning binoculars (a device for seeing far-away objects clearly).","zh":"“binocles”是较少见的词，意思是“双筒望远镜/望远镜”，用于更清楚地看远处的东西。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Binoculars; a pair of small telescopes you hold to your eyes to see distant things more clearly.","zh":"（复数）望远镜；一副手持双筒望远镜，用来把远处的东西看得更清楚。"},"examples":[{"en":"She raised her binocles to watch the birds on the lake.","zh":"她举起望远镜，观察湖上的鸟。"},{"en":"Do you have binocles for the concert? I’m too far from the stage.","zh":"你有望远镜吗？我离舞台太远了。"}]}],"synonyms":["binoculars","field glasses","opera glasses"],"phonetic":"/bɪˈnɑkəlz/","extraExplanation":["“binocles”在现代英语中比较少见，更常用的说法是“binoculars”。在较旧的英式用法里，它也可能指一种小型的双筒望远镜或戏院望远镜（用于看歌剧、戏剧等）。"]}
{"word":"binocs","summary":{"en":"“Binocs” is an informal short form of “binoculars.”","zh":"“binocs”是“binoculars（双筒望远镜）”的非正式缩略说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Binoculars; a pair of field glasses used to see things far away more clearly.","zh":"（非正式）望远镜；双筒望远镜，用来把远处的东西看得更清楚。"},"examples":[{"en":"Bring your binocs—we might spot whales from the cliff.","zh":"带上你的双筒望远镜——我们可能会从悬崖上看到鲸鱼。"},{"en":"He lifted his binocs and scanned the tree line.","zh":"他举起双筒望远镜，扫视树林边缘。"},{"en":"Do you have binocs for the game? I can’t read the scoreboard.","zh":"你有双筒望远镜看比赛用吗？我看不清记分牌。"}]}],"synonyms":["binoculars","field glasses","binos"],"phonetic":"/ˈbɪnɑks/","extraExplanation":["“binocs”是“binoculars”的口语缩略说法，常见于户外活动（观鸟、观鲸、徒步）、旅行或军警语境中。","英语里它通常以复数形式出现（binocs/binoculars），即使指一副望远镜也常用复数，这是因为它由两支镜筒组成。"]}
{"word":"binocular","summary":{"en":"Binocular can mean (1) binoculars: a two-tube telescope you look through with both eyes, or (2) related to using both eyes.","zh":"binocular 可指（1）双筒望远镜（常用 binoculars），也可指（2）与双眼、用双眼有关的。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A pair of optical instruments with two small telescopes joined together, used for seeing distant things more clearly (often used as “binoculars”).","zh":"双筒望远镜；望远镜（通常用复数“binoculars”）"},"examples":[{"en":"She lifted her binoculars to watch the birds on the lake.","zh":"她举起双筒望远镜，观察湖上的鸟。"},{"en":"Bring binoculars if you want a better view of the stage.","zh":"如果你想更清楚地看舞台，就带上望远镜。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to or using both eyes (binocular vision).","zh":"（与）双眼有关的；用双眼的（如 binocular vision）"},"examples":[{"en":"Humans have binocular vision, which helps us judge distance.","zh":"人类有双眼视觉，这有助于判断距离。"},{"en":"The doctor tested his binocular coordination.","zh":"医生测试了他的双眼协调能力。"}]}],"synonyms":["binoculars","field glasses","two-eyed"],"phonetic":"/bəˈnɑːkjələr/","extraExplanation":["“Binocular”来自拉丁语前缀 bi-（两、双）+ oculus（眼睛），字面意思是“用两只眼睛的”。","日常口语里更常说 binoculars（复数），即使只指一副望远镜；说 a pair of binoculars 很自然。"]}
{"word":"binocular-testing","summary":{"en":"Binocular-testing means checking how well both eyes work together, especially in an eye exam.","zh":"binocular-testing 指检查双眼协同工作的能力（双眼视检查），常见于视力/眼科检查。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of checking how well both eyes work together (binocular vision), often used in eye exams to assess depth perception, eye alignment, and coordination","zh":"检查双眼是否能良好协同工作（双眼视）的过程；常用于视力/眼科检查，以评估立体视觉、眼位与双眼协调"},"examples":[{"en":"The optometrist included binocular testing to see if her eyes were properly aligned.","zh":"验光师加入了双眼视检查，以确认她的眼位是否正常。"},{"en":"Binocular testing can help explain why a student has trouble reading for long periods.","zh":"双眼视检查有助于解释为什么学生难以长时间阅读。"},{"en":"After the injury, he needed binocular testing to check his depth perception.","zh":"受伤后，他需要做双眼视检查来评估立体感。"}]}],"synonyms":["binocular vision testing","binocular vision assessment","binocular function testing","stereopsis testing (specific to depth perception)"],"phonetic":"/bɪˈnɑkjələr ˈtɛstɪŋ/","extraExplanation":["在眼科/视光学里，binocular testing 常包含：遮盖试验（cover test）、融合与集合能力测试（vergence tests）、立体视测试（stereo tests）等，用来判断是否存在斜视、隐斜视或双眼协调问题。","日常英语中更常见的说法是 “binocular vision testing” 或直接说 “tests for binocular vision”。带连字符的 “binocular-testing” 多见于技术文档、表格标题或复合形容词结构（如 binocular-testing protocol）。"]}
{"word":"binocular-vision","summary":{"en":"Binocular vision is using both eyes together to see one image clearly and perceive depth.","zh":"Binocular vision 指双眼协同成像与形成立体深度感的能力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the ability to use both eyes together to create one clear image with a sense of depth (3D perception).","zh":"双眼视觉：两只眼睛协同工作，把画面合成为一个清晰影像，并产生深度感（立体感）。"},"examples":[{"en":"Good binocular vision helps you judge distances when driving or playing sports.","zh":"良好的双眼视觉能帮助你在开车或运动时判断距离。"},{"en":"The doctor tested her binocular vision to see if both eyes were working as a team.","zh":"医生检查了她的双眼视觉，看看两只眼睛能否协同工作。"}]},{"partOfSpeech":"n.","definition":{"en":"(optometry/medicine) the coordinated eye movements and focus that allow the eyes to align on the same object (including skills like tracking and convergence).","zh":"（验光/医学）双眼协调功能：让双眼对准同一目标所需的眼球运动与调焦能力（如追踪、会聚等）。"},"examples":[{"en":"Problems with binocular vision can cause eye strain and headaches during reading.","zh":"双眼协调功能出现问题可能会导致阅读时眼睛疲劳和头痛。"},{"en":"Vision therapy may improve binocular-vision skills in some patients.","zh":"对一些患者来说，视觉训练可能改善双眼视觉相关能力。"}]}],"synonyms":["two-eyed vision","binocularity","stereovision (related)"],"phonetic":"/bɪˈnɑːkjələr ˈvɪʒən/","extraExplanation":["“binocular”由 bi-（两）+ ocular（眼的）构成，因此 binocular vision 指“用两只眼睛共同看的能力”。在日常与医学语境中也常写作不加连字符的 binocular vision；加连字符多见于复合修饰或术语化写法。","它与“立体视觉/深度知觉（stereoscopic depth perception）”密切相关：双眼看到的画面略有差异，大脑把差异整合成距离与立体感。"]}
{"word":"binocularing","summary":{"en":"“Binocularing” is an informal, nonstandard way to say “using binoculars to watch/search.”","zh":"“binocularing”是一个非正式、非标准的说法，意思是“用双筒望远镜观察/搜寻”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Informal/nonstandard) using binoculars to look at something; watching or searching through binoculars.","zh":"（非正式/非标准用法）用双筒望远镜观看；通过望远镜观察或搜寻。"},"examples":[{"en":"We spent the afternoon binocularing for birds along the river.","zh":"我们整个下午都在河边用望远镜观鸟。"},{"en":"She was binocularing the distant hillside to spot deer.","zh":"她用望远镜观察远处的山坡，想找到鹿。"}]}],"synonyms":["use binoculars","look through binoculars","glass"],"phonetic":"/bəˈnɑːkjələrɪŋ/","extraExplanation":["“binocularing”不是常见的标准英语动词。更自然的说法通常是：\n- use binoculars（用望远镜）\n- look through binoculars（通过望远镜看）\n在观鸟/观鲸等圈子里，也有人把“binoculars”动词化来口语使用，但在正式写作中不推荐。","相关常用词：\n- binoculars（n. 双筒望远镜）\n- binocular（adj. 双眼的；双筒的，如 binocular vision 双眼视觉）\n- to glass（v. 口语/户外语境：用望远镜或单筒望远镜仔细观察）"]}
{"word":"binocularity","summary":{"en":"Binocularity is the ability to coordinate both eyes to create a single image, supporting depth perception.","zh":"Binocularity 指双眼协调成像的能力，常与深度/立体知觉有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The ability to use both eyes together to form one single image (binocular vision), often helping with depth perception.","zh":"双眼协同视觉能力：两只眼睛一起工作，形成单一影像的能力（双眼视觉），通常有助于立体感与深度知觉。"},"examples":[{"en":"Good binocularity helps you judge how far away a ball is when you catch it.","zh":"良好的双眼协同能力能帮助你判断球有多远，从而更容易接住。"},{"en":"The doctor tested her binocularity to see whether both eyes were working as a team.","zh":"医生检查了她的双眼协同能力，以确认两只眼睛是否能协调工作。"}]}],"synonyms":["binocular vision","binocular function","two-eyed vision"],"phonetic":"/ˌbaɪnɑːkjuˈlærəti/","extraExplanation":["“binocularity”多用于验光/眼科、视光学和视觉科学语境，日常英语里更常说“binocular vision（双眼视觉）”。","相关概念包括：binocular disparity（双眼视差，两眼看到的图像略有差异）与 stereopsis（立体视，由视差带来的深度感）。若双眼配合不佳，可能出现 double vision（复视）或 depth-perception problems（深度知觉困难）。"]}
{"word":"binocularly","summary":{"en":"Binocularly means “using both eyes together,” and sometimes “using binoculars.”","zh":"binocularly 表示“以双眼一起观看/感知（双眼视觉）”，有时也指“用双筒望远镜观看”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that uses both eyes together (binocular vision), allowing better depth perception.","zh":"以双眼一起（双眼视觉）的方式；因此更容易产生立体感与距离感。"},"examples":[{"en":"Humans see depth mainly binocularly, using input from both eyes.","zh":"人类主要以双眼方式感知深度，利用两只眼睛的影像输入。"},{"en":"Some animals hunt binocularly to judge distance more accurately.","zh":"有些动物以双眼方式捕猎，以更准确地判断距离。"}]},{"partOfSpeech":"adv.","definition":{"en":"Using binoculars (a two-lens instrument for viewing distant objects).","zh":"使用双筒望远镜（用来观察远处物体的仪器）地。"},"examples":[{"en":"We watched the birds binocularly from the trail.","zh":"我们在步道上用双筒望远镜观察鸟类。"},{"en":"The mountain looked closer when viewed binocularly.","zh":"用双筒望远镜看时，那座山看起来更近了。"}]}],"synonyms":["with both eyes","using binocular vision","stereoscopically","through binoculars"],"phonetic":"/bɪˈnɑːkjələrli/","extraExplanation":["“binocularly”来自“binocular”（双眼的/双筒的）：bi- 表示“两个”，-ocular 与“眼睛”有关（同源词：ocular）。在科学或医学语境里更常指“用双眼视觉”；在日常描述中也可用来表示“用双筒望远镜观看”。"]}
{"word":"binoculars","summary":{"en":"Binoculars are a pair of handheld lenses for seeing faraway things more clearly.","zh":"Binoculars 指用于更清楚观看远处物体的手持双筒望远镜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An optical instrument with two connected telescopes that you hold up to your eyes to see distant things more clearly.","zh":"双筒望远镜；一种由两根连在一起的小望远镜组成、用双眼观看以更清楚看到远处物体的光学仪器。"},"examples":[{"en":"She used binoculars to watch birds across the lake.","zh":"她用双筒望远镜观察湖对岸的鸟。"},{"en":"Bring binoculars if you want a better view of the players.","zh":"如果你想看得更清楚，带上双筒望远镜。"},{"en":"With binoculars, the mountain trail looked much closer than it really was.","zh":"用双筒望远镜看，山路看起来比实际近得多。"}]}],"synonyms":["field glasses","opera glasses (smaller, formal)"],"phonetic":"/bəˈnɑːkjələrz/","extraExplanation":["“Binoculars”通常只用复数形式（plural-only），说“a pair of binoculars（一副双筒望远镜）”很常见。","词源提示：bi- 表示“两”，-ocular 与 “eye（眼睛）”相关，所以字面意思是“用于两只眼睛的”。","常见使用场景包括观鸟（birdwatching）、体育比赛（sports games）、徒步/旅行（hiking/travel）、观星（stargazing）。"]}
{"word":"binoculate","summary":{"en":"Binoculate means to view with both eyes or to make an optical device binocular for two-eyed viewing.","zh":"binoculate 指用双眼观看，或把光学设备改为双目式以便双眼观看。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to look at something with both eyes; to view in a two-eyed (binocular) way","zh":"用双眼观看；以双目（立体）方式观察"},"examples":[{"en":"Humans binoculate naturally, which helps us judge distance.","zh":"人类天生用双眼观看，这有助于判断距离。"},{"en":"Some animals can’t binoculate well because their eyes face the sides of the head.","zh":"有些动物因为眼睛长在头部两侧，所以不太能很好地用双眼同时观察。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something binocular (designed for two-eyed viewing), especially in optics","zh":"使某物成为双目式（适合双眼观看的），尤指光学设计"},"examples":[{"en":"The researcher binoculated the microscope to reduce eye strain.","zh":"研究人员把显微镜改成双目式，以减少眼睛疲劳。"},{"en":"They binoculated the viewing system for more comfortable observation.","zh":"他们将观察系统改为双目式，让观看更舒适。"}]}],"synonyms":["use both eyes","see with both eyes","view binocularly","make binocular"],"phonetic":"/baɪˈnɑːkjəleɪt/","extraExplanation":["“binoculate”比较少见，更常见的表达是：\n- 用双眼看：use both eyes / see with both eyes\n- 双目视觉：binocular vision\n- 双目显微镜：a binocular microscope\n在科技/医学/动物行为语境中更可能遇到。"]}
{"word":"binodal","summary":{"en":"Binodal (adj.) describes the phase-boundary (coexistence) curve in a phase diagram where a mixture begins to separate into two stable phases.","zh":"binodal（形容词）指相图中的共存曲线/两相边界：混合物在此边界开始分离成两种稳定相。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(technical, chemistry/physics) Relating to the *binodal* (coexistence) curve in a phase diagram, which marks the boundary where a mixture separates into two stable phases.","zh":"（技术用语，化学/物理）与相图中的*共存曲线/双相边界线*（binodal curve）有关；该曲线表示混合物开始分离成两种稳定相的边界。"},"examples":[{"en":"The binodal line separates the one-phase region from the two-phase region in the diagram.","zh":"图中的 binodal 线把单相区与两相区分开。"},{"en":"At this temperature, the solution crosses the binodal boundary and phase separation begins.","zh":"在这个温度下，溶液跨过 binodal 边界，开始发生相分离。"}]}],"synonyms":["coexistence (as in coexistence curve)","two-phase boundary (context-dependent)"],"phonetic":"/baɪˈnoʊdəl/","extraExplanation":["binodal 常见于材料科学、聚合物溶液与热力学相图中，尤其与 “binodal curve（共存曲线）” 搭配使用。","学习时可与 spinodal（自旋分解边界）对比：binodal 描述“能稳定共存的两相边界”；spinodal 描述“任何微小扰动都会自发分解”的不稳定区域边界。两者之间通常是亚稳区（metastable region）。","词源上可理解为 bi-（两）+ nodal（与节点/结点有关），但在实际学术语境里，它主要指相图中的那条“二相共存边界线”。"]}
{"word":"binode","summary":{"en":"A binode is a node in a graph with exactly two connections (degree 2).","zh":"binode 指图中恰好有两条连接（度为2）的节点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Graph theory, networks) A node (vertex) that has exactly two connections (degree 2), often treated as an intermediate point on a path.","zh":"（图论/网络）只有两条连接（度为2）的节点（顶点），常被视为路径上的中间点。"},"examples":[{"en":"In the simplified map, we removed each binode and merged the two road segments into one.","zh":"在简化后的地图中，我们移除了每个二度节点（binode），把两段道路合并成一段。"},{"en":"A binode usually does not change the overall connectivity, so many algorithms “suppress” it.","zh":"二度节点通常不会改变整体连通性，所以很多算法会把它“抑制/消去”。"}]}],"synonyms":["degree-two vertex","2-valent node","bivalent node","degree-2 node"],"phonetic":"/ˈbaɪnoʊd/","extraExplanation":["“binode”多用于较专业的语境（如图论、网络分析、GIS道路简化、计算生物学的树结构等）。在实际处理时，人们常把二度节点当作“转折点/中继点”，如果不需要保留几何形状或具体位置，就可能把它删掉并把两条边合并，以减少图的规模。","不要把它和“binary node（二叉节点）”混淆：binode强调“连接数为2”，而binary node强调“有两个子节点/分支”。"]}
{"word":"binodose","summary":{"en":"“Binodose” is not a standard English word; it’s most often informal internet slang meaning “a dose of Binod (meme) content.”","zh":"“binodose”不是标准英语词；多见于网络非正式用法，指“来一剂 Binod 梗内容”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Internet slang, mainly in India) Content that references or features “Binod,” a viral meme name; a “dose” (small amount) of Binod-related humor.","zh":"（网络俚语，主要见于印度）指含有或提到“Binod”（一个走红的梗名/人物名）的梗图、评论或幽默内容；相当于“来一小剂 Binod 梗”。"},"examples":[{"en":"This page keeps posting a new binodose every day.","zh":"这个页面每天都在发新的 binodose（Binod 梗内容）。"},{"en":"I’m not sure what a binodose is, but the comments keep spamming the name.","zh":"我不太确定 binodose 是什么，但评论区一直在刷那个名字。"}]},{"partOfSpeech":"other","definition":{"en":"(Rare/likely nonstandard) A misspelling or informal coinage; it may be intended as a different word (for example, “binodal,” “dose,” or a name + “dose”).","zh":"（罕见/可能不规范）可能是拼写错误或临时造词；也可能原本想写别的词（如“binodal”“dose”，或某个名字 + “dose”）。"},"examples":[{"en":"Did you mean “dose” or “binodal”? “Binodose” isn’t a common dictionary word.","zh":"你是不是想写“dose”或“binodal”？“binodose”不是常见词典词。"}]}],"synonyms":["Binod meme","a dose of Binod","meme content"],"phonetic":"/ˈbɪnoʊdoʊz/","extraExplanation":["“Binod”在2020年前后于印度社交媒体上成为流行梗：网友在评论区反复刷“Binod”，形成一种无意义却好笑的“刷屏式幽默”。因此有人会用“a dose of Binod（来一剂 Binod）”来指代这类梗内容，“binodose”可视为把这种说法合成的非正式写法。","如果你告诉我你看到“binodose”的句子或平台（YouTube/Instagram/聊天等），我可以更准确判断它是梗、用户名、还是拼写错误。"]}
{"word":"binodous","summary":{"en":"Binodous means “having two nodes/joints,” but it is rare and mostly technical.","zh":"Binodous 意为“有两个节/节点（或关节）”，但非常少见，多用于技术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having two nodes (two joints or knot-like points); a rare/technical word sometimes used in botany or anatomy","zh":"具有两个节（两个关节或结节状的点）；较少见/偏技术用词，有时用于植物学或解剖学语境"},"examples":[{"en":"The botanist described the stem as binodous, with two clear joints.","zh":"植物学家把茎描述为“binodous”，有两个明显的节。"},{"en":"In older texts, you may see binodous used to mean “two-jointed.”","zh":"在较老的文本里，你可能会看到 binodous 用来表示“两节的/两关节的”。"}]}],"synonyms":["two-jointed","binodal (close in meaning, more common in technical writing)"],"phonetic":"/baɪˈnoʊdəs/","extraExplanation":["这个词在现代英语中非常罕见，很多词典不收录；如果你是在论文/标注里看到的，常见的更标准表达可能是 binodal（双节/双节点的）或 two-jointed（两节的）。","词形上通常可拆为 bi-（“二、双”）+ nod-（来自拉丁语 nodus，意为“结、节”）+ -ous（形容词后缀）。"]}
{"word":"binomen","summary":{"en":"Binomen means a two-part name, most commonly a species’ scientific name (genus + specific epithet).","zh":"binomen 指“两部分构成的名称”，最常见的是物种的学名（二名法：属名 + 种加词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a two-part name, especially the scientific name of a species (genus + specific epithet), used in biology","zh":"二名法名称；（尤指）生物学中用来命名物种的“双名”（属名 + 种加词）"},"examples":[{"en":"The binomen for humans is Homo sapiens.","zh":"人类的二名法名称是 Homo sapiens（智人）。"},{"en":"In binomial nomenclature, the genus comes first in the binomen.","zh":"在双名法中，二名里的属名在前。"},{"en":"Scientists write the binomen in italics in formal papers.","zh":"在正式论文中，科学家通常用斜体书写二名法名称。"}]},{"partOfSpeech":"n.","definition":{"en":"any name made of two words or two names used together (less common)","zh":"由两个词组成的名称；双重名称（较少用）"},"examples":[{"en":"Some writers use a binomen to label a concept with two linked terms.","zh":"有些作者用由两个关联词构成的“双名”来标记一个概念。"}]}],"synonyms":["scientific name","binomial name","species name","binomial (noun)"],"phonetic":"/baɪˈnoʊmən/","extraExplanation":["“binomen”来自拉丁语：bi-（二）+ nomen（名字）。在林奈（Carl Linnaeus）建立的分类体系中，物种用两部分命名：属名（首字母大写）+ 种加词（小写），例如 Canis lupus（灰狼）。在学术写作中常用斜体，首次出现可在后面加上命名者与年代（更偏专业写法）。"]}
{"word":"binomenclature","summary":{"en":"Binomial nomenclature is the biology naming system that gives each species a two-part Latin-based name (genus + species).","zh":"Binomial nomenclature（双名法）是生物学命名体系，用两个拉丁化词（属名+种加词）给每个物种命名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) the scientific system of naming living things with two Latin-based words: the genus name and the species name (e.g., Homo sapiens).","zh":"（生物学）双名法：用两个拉丁化词给生物命名的科学方法：属名 + 种加词（如 Homo sapiens）。"},"examples":[{"en":"In binomial nomenclature, the genus name is capitalized, but the species name is not.","zh":"在双名法中，属名要大写，但种加词不大写。"},{"en":"Scientists use binomial nomenclature so that each species has a unique name worldwide.","zh":"科学家使用双名法，这样每个物种在全球都有唯一的名字。"},{"en":"The binomial nomenclature for the domestic cat is Felis catus.","zh":"家猫的双名法名称是 Felis catus。"}]}],"synonyms":["scientific name (system)","two-part naming system","Linnaean naming system"],"phonetic":"/baɪˈnoʊmiəl ˌnoʊmənˈkleɪtʃər/","extraExplanation":["你写的“binomenclature”不太常见，通常标准写法是 **binomial nomenclature**（双名法）。","双名法常与瑞典博物学家**林奈（Carl Linnaeus）**联系在一起，他在18世纪推广了这一命名体系。","书写习惯：属名+种加词通常用斜体（或手写时分别下划线）；属名首字母大写，种加词小写。"]}
{"word":"binomial","summary":{"en":"Binomial means “having two parts,” especially a two-term math expression or a two-part scientific species name.","zh":"binomial 表示“由两部分组成”，常指数学中的二项式/二项的，或生物学中由两部分构成的物种学名（二名法）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"In mathematics, relating to or involving two terms (especially in the expression a + b).","zh":"（数学）二项的；含两个项的（尤指形如 a+b 的式子）。"},"examples":[{"en":"In algebra, a + b is a binomial.","zh":"在代数里，a+b 是一个二项式。"},{"en":"We used the binomial theorem to expand (x + 1)^5.","zh":"我们用二项式定理展开 (x+1)^5。"}]},{"partOfSpeech":"n.","definition":{"en":"A mathematical expression with two terms joined by + or − (for example, 3x − 2).","zh":"（数学）二项式；由加号或减号连接的两个项组成的代数式（如 3x−2）。"},"examples":[{"en":"The polynomial x^2 + x + 1 is not a binomial; it has three terms.","zh":"多项式 x^2+x+1 不是二项式；它有三项。"},{"en":"Factor the binomial 6x − 9 into 3(2x − 3).","zh":"把二项式 6x−9 因式分解为 3(2x−3)。"}]},{"partOfSpeech":"adj.","definition":{"en":"In biology, a scientific species name made of two parts: the genus name plus the specific epithet (for example, Homo sapiens).","zh":"（生物）二名法名称；由两部分组成的物种学名：属名 + 种加词（如 Homo sapiens）。"},"examples":[{"en":"Humans have the binomial name Homo sapiens.","zh":"人类的二名法学名是 Homo sapiens。"},{"en":"In binomial nomenclature, the genus is capitalized but the species is not.","zh":"在二名法中，属名首字母大写，而种加词不大写。"}]}],"synonyms":["two-term","two-part","two-name (in biology)"],"phonetic":"/baɪˈnoʊmiəl/","extraExplanation":["“binomial”来自拉丁语词根：bi-（二）+ nomen（名字/名称）。在生物学里常说“binomial nomenclature（二名法）”，由林奈（Carl Linnaeus）推广，用来让物种命名在全球更统一。书写时通常用斜体（或手写时下划线），如 *Homo sapiens*。"]}
{"word":"binomialism","summary":{"en":"Binomialism is a conventional two-word pair (often with “and/or”) used in a preferred fixed order, like “salt and pepper.”","zh":"Binomialism 指用 and/or 等连接的两个词的固定并列搭配，通常顺序约定俗成，如 “salt and pepper”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in linguistics) the use of a fixed pair of words joined by a conjunction (usually “and” or “or”), often in a conventional, preferred order, to express one idea or emphasize completeness.","zh":"（语言学）指用连词（常为 and / or）把两个词固定搭配成一组、且顺序通常约定俗成的表达方式，用来表达一个整体概念或强调“完整/全面”。"},"examples":[{"en":"“Salt and pepper” is a common binomialism in English.","zh":"“salt and pepper（盐和胡椒）”是英语里常见的二项并列固定搭配。"},{"en":"Many binomialisms have a set order, like “black and white,” not “white and black.”","zh":"很多二项并列搭配顺序固定，比如说“black and white”，通常不说“white and black”。"},{"en":"Writers use binomialism to make a sentence sound rhythmic and balanced, such as “life and death.”","zh":"作者常用二项并列搭配来让句子更有节奏与对称感，比如“life and death（生与死）”。"}]}],"synonyms":["binomial","binomial expression","irreversible binomial (for fixed-order pairs)"],"phonetic":"/baɪˈnoʊmiəˌlɪzəm/","extraExplanation":["在英语学习中，binomialism 很接近你可能见过的“固定搭配/并列短语”。常见类型包括：\n1）不可逆二项式（irreversible binomial）：顺序几乎固定，如 “bread and butter”“fish and chips”“law and order”。\n2）相对可变但有偏好顺序：如 “mother and father” 通常比 “father and mother” 更常见（不同语境可能变化）。","顺序固定的原因常见有：发音更顺口（重音与节奏）、元音/辅音搭配更流畅、短词在前长词在后、语义上“从小到大/从轻到重/从一般到具体”、以及文化习惯（约定俗成）。","相关术语：\n- binomial / binomial expression：更常见的叫法。\n- irreversible binomial：强调“顺序固定”。\n- doublet：有时也用来指这类并列双词结构（视不同语言学传统而定）。"]}
{"word":"binomially","summary":{"en":"Binomially means “in a binomial way,” used mainly for binomial expansion in algebra or binomial modeling in statistics.","zh":"binomially 指“以二项式/二项模型的方式”，主要用于代数中的二项展开或统计中的二项建模。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to a binomial (an expression with two terms), especially in mathematics (e.g., the binomial theorem).","zh":"以与二项式（含两个项的代数式）相关的方式；尤指数学中的用法（如二项式定理）。"},"examples":[{"en":"The expression can be expanded binomially using the binomial theorem.","zh":"这个代数式可以用二项式定理进行二项式展开。"},{"en":"Students learned to write the expansion binomially rather than multiplying everything out by hand.","zh":"学生学习用二项式方法写出展开式，而不是把所有项都手算相乘。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that follows a binomial model, especially in statistics (e.g., binomial probability or the binomial distribution).","zh":"以符合二项模型的方式；尤指统计学中的用法（如二项概率或二项分布）。"},"examples":[{"en":"The number of heads in repeated coin flips is often modeled binomially.","zh":"多次抛硬币出现正面的次数常用二项模型来刻画。"},{"en":"If each trial has the same success probability, you can analyze the results binomially.","zh":"如果每次试验成功概率相同，就可以用二项方法来分析结果。"}]}],"synonyms":["in a binomial way","using a binomial model"],"phonetic":"/baɪˈnoʊmiəli/","extraExplanation":["“binomially”来自“binomial”（bi- 表示“二”，-nomial 与“名称/项”有关），在学术写作里多见于数学与统计语境，日常口语中很少使用。","常见搭配：expand binomially（二项展开）、model binomially / analyze binomially（用二项模型建模/分析）。","相关概念提示：二项式定理常写为 (a+b)^n 的展开；二项分布常用于“重复、独立、只有成功/失败两种结果”的试验。"]}
{"word":"binomials","summary":{"en":"“Binomials” can mean two-term algebra expressions, two-part scientific species names, or fixed word pairs like “salt and pepper.”","zh":"“Binomials”可指：数学中的二项式、生物学中的双名法学名，或语言学中像“salt and pepper”这样的固定成对词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Mathematics) An algebraic expression with two terms, usually joined by + or − (the plural of “binomial”).","zh":"（数学）二项式：由两个项组成、通常用加号或减号连接的代数式（“binomial”的复数）。"},"examples":[{"en":"In algebra, (x + 1) and (2a − b) are binomials.","zh":"在代数中，(x + 1) 和 (2a − b) 都是二项式。"},{"en":"We used the binomial theorem to expand (x + y)^5.","zh":"我们用二项式定理来展开 (x + y)^5。"}]},{"partOfSpeech":"n.","definition":{"en":"(Biology) Two-part scientific names for species (genus + species), also called binomial names (the plural of “binomial”).","zh":"（生物）物种的“双名法”学名（属名 + 种加词），也叫二名法名称（“binomial”的复数）。"},"examples":[{"en":"Homo sapiens is a binomial for modern humans.","zh":"Homo sapiens 是现代人类的一个双名法学名。"},{"en":"Students must write binomials in italics, with the genus capitalized.","zh":"学生需要用斜体书写双名法学名，并且属名首字母大写。"}]},{"partOfSpeech":"n.","definition":{"en":"(Linguistics) Fixed word pairs commonly joined by “and” or “or,” often in a set order (e.g., “black and white,” “knife and fork”).","zh":"（语言学）固定搭配的“成对词”（常用 and / or 连接，顺序通常固定，如 black and white，knife and fork）。"},"examples":[{"en":"“Knife and fork” is a common English binomial.","zh":"“Knife and fork” 是英语里常见的成对固定搭配。"},{"en":"Many binomials have a preferred order: we usually say “salt and pepper,” not “pepper and salt.”","zh":"很多成对词有固定顺序：通常说 “salt and pepper”，而不是 “pepper and salt”。"}]}],"synonyms":["two-term expressions","binomial expressions","binomial names","two-part scientific names","paired words","fixed pairs"],"phonetic":"/baɪˈnoʊmiəlz/","extraExplanation":["在语言学里，binomial（成对词）之所以常有固定顺序，可能和发音节奏、音素搭配、长短先后（短词在前更顺口）、以及文化习惯有关。","在生物学里，双名法（binomial nomenclature）常与林奈（Linnaeus）相关；这种命名方式帮助不同语言背景的人用统一名称指同一物种。"]}
{"word":"binominal","summary":{"en":"Binominal means “two-named” or “made of two parts,” especially a two-word scientific species name.","zh":"binominal 指“双名的/两部分组成的”，尤指由两个词构成的物种学名。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two names or two parts, especially in a two-word scientific name (genus + species) or a two-part name/title.","zh":"双名的；由两部分组成的，尤指生物学中由两个词构成的科学命名（属名+种加词）或由两部分组成的名称/头衔。"},"examples":[{"en":"The binominal name for humans is Homo sapiens.","zh":"人类的双名法学名是 Homo sapiens。"},{"en":"In biology class, we learned to write binominal names in italics.","zh":"在生物课上，我们学到双名法的学名要用斜体书写。"}]},{"partOfSpeech":"n.","definition":{"en":"A two-part name or expression, especially a scientific name made of two words.","zh":"双名；双词名称（尤指由两个词组成的科学名称）。"},"examples":[{"en":"Each species is identified by a binominal.","zh":"每个物种都用一个双名来识别。"},{"en":"The textbook lists the common name alongside the binominal.","zh":"教材把俗名和双名并列列出。"}]}],"synonyms":["binomial","two-part","two-word","dual-named"],"phonetic":"/ˌbaɪˈnɑːmɪnəl/","extraExplanation":["“binominal”常见于生物分类学与语言学语境，强调“由两个部分构成的名称”。在生物学里更常用的说法是“binomial (name)”或“binomial nomenclature（双名法）”；“binominal”与“binomial”含义接近，但“binomial”更普遍。","书写习惯：双名法学名通常为拉丁化形式，属名首字母大写、种加词小写，整体用斜体（如 *Homo sapiens*）；若手写则常用下划线表示斜体。"]}
{"word":"binominated","summary":{"en":"“Binominated” means having a two-part name (especially in scientific naming), and more rarely, being nominated in two ways/for two roles.","zh":"“Binominated”指“有两个部分的名称（尤指科学命名中的二名法）”，较少见的用法是“以两种方式/为两个角色被提名”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two names or terms; described by a two-part name (often used in scientific naming).","zh":"有两个名称的；用两个部分的名称来描述的（常见于科学命名）。"},"examples":[{"en":"Humans are binominated as Homo sapiens in scientific classification.","zh":"在人类的科学分类中，人类用二名法命名为 Homo sapiens（智人）。"},{"en":"Many species are binominated with a genus name and a species name.","zh":"许多物种用“属名 + 种加词”的二名法来命名。"}]},{"partOfSpeech":"adj.","definition":{"en":"Named or nominated in two separate ways or for two positions (rare in modern everyday English).","zh":"以两种方式被命名/被提名的；被提名为两个职位的（现代日常英语中较少见）。"},"examples":[{"en":"The candidate was binominated for both chair and treasurer, though the rules discouraged it.","zh":"这位候选人同时被提名为主席和财务主管，尽管规则不鼓励这样做。"}]}],"synonyms":["binomial","binominal","two-named","two-term"],"phonetic":"/ˌbaɪˈnɑː.mə.neɪ.tɪd/","extraExplanation":["“binominated”较少见，更常见的相关词是“binomial / binominal”（二项式的/二名法的）。在生物学里，二名法（binomial nomenclature）由林奈（Linnaeus）推广，用“属名 + 种加词”来给物种命名，如 Homo sapiens。日常写作中，如果你想表达“二名法命名”，通常用 binomial/binominal 更自然。"]}
{"word":"binominous","summary":{"en":"“Binominous” is a very rare/nonstandard word that may be intended to mean “binomial/binominal,” relating to two-part scientific names.","zh":"“binominous”极罕见且不太规范，通常可能想表达“binomial/binominal（双名/二项）”，指与两部分的科学名称有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Nonstandard or very rare: relating to a two-part name (a binomial), especially the scientific naming system using genus + species.","zh":"非标准或极罕见用法：与“两部分名称”（双名）有关，尤指用“属名 + 种加词”的生物学科学命名法。"},"examples":[{"en":"The paper uses binominous labels for each plant species (genus and species).","zh":"这篇论文为每种植物使用“binominous”（双名）标注（属名与种加词）。"},{"en":"If you meant scientific naming, the more common word is binomial, as in “binomial nomenclature.”","zh":"如果你想表达科学命名，更常用的词是 binomial，例如“binomial nomenclature（双名法）”。"}]}],"synonyms":["binomial","binominal","(binomial) nomenclatural"],"phonetic":"/ˌbaɪnəˈmɪnəs/","extraExplanation":["“binominous”通常不被主流英语词典收录，实际写作中很可能会被认为是拼写错误或临时造词。想表达“双名/双项名称”时，更标准的选择是：\n- binomial（双项的；二项式的）\n- binominal / binominal name（双名的/双名）\n- binomial nomenclature（生物学“双名法”）\n如果你原本想写的是“bimonthly（每两个月一次/每月两次）”或“ominous（不祥的）”，也可能是拼写混淆。"]}
{"word":"binomy","summary":{"en":"A math expression with exactly two terms (a + b).","zh":"只包含两个项的数学表达式（a + b）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Math) An expression with exactly two terms, usually connected by + or − (for example, a + b).","zh":"（数学）二项式：只包含两个项的代数式，通常用 + 或 − 连接（例如 a + b）。"},"examples":[{"en":"The expression x + 3 is a binomy.","zh":"表达式 x + 3 是一个二项式。"},{"en":"We can factor the binomy x² − 9 into (x − 3)(x + 3).","zh":"我们可以把二项式 x² − 9 因式分解为 (x − 3)(x + 3)。"}]}],"synonyms":["binomial (more common)","binomial expression"],"phonetic":"/ˈbaɪnəmi/","extraExplanation":["“binomy”在一般英语中不算常见词，更常见的说法是“binomial”（二项式/二项的）。在数学课本里，你更可能看到“binomial expression”。","词源上：bi- 表示“二”，-nomy 与“项/名称”有关；整体意思就是“两个项的表达式”。","相关词：monomial（单项式）、trinomial（三项式）、polynomial（多项式）。"]}
{"word":"binormal","summary":{"en":"Binormal usually refers to the binormal vector in geometry, perpendicular to both the tangent and the normal of a space curve; in statistics it can also mean bivariate normal.","zh":"binormal 通常指几何中的“副法向（binormal）向量”，它同时垂直于空间曲线的切向与法向；在统计学中也可指“双变量正态（bivariate normal）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Math, geometry) Relating to the binormal vector: a direction perpendicular to both the tangent and the normal of a curve.","zh":"（数学/几何）与“副法向（binormal）向量”有关：在空间曲线上同时垂直于切向和法向的方向。"},"examples":[{"en":"In differential geometry, the binormal vector is perpendicular to the tangent and the normal.","zh":"在微分几何中，副法向向量同时垂直于切向和法向。"},{"en":"As the curve twists in space, its binormal direction changes along the path.","zh":"当曲线在空间中扭转时，它的副法向方向会沿路径发生变化。"}]},{"partOfSpeech":"n.","definition":{"en":"(Math, geometry) The binormal vector of a space curve at a point.","zh":"（数学/几何）空间曲线在某一点的副法向向量。"},"examples":[{"en":"Compute the tangent, normal, and binormal to describe the curve’s local orientation.","zh":"计算切向、法向与副法向，用来描述曲线的局部朝向。"},{"en":"The binormal is often written as T × N.","zh":"副法向常写作 T × N（切向与法向的叉乘）。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Statistics, less common) Having a bivariate normal (two-variable normal) distribution.","zh":"（统计学，较少见）具有二元正态（双变量正态）分布的。"},"examples":[{"en":"They assumed a binormal model for the two correlated measurements.","zh":"他们对两个相关测量值采用了二元正态（binormal）模型。"},{"en":"A binormal distribution can be described by two means, two variances, and a correlation.","zh":"二元正态分布可由两个均值、两个方差以及相关系数来描述。"}]}],"synonyms":["binormal vector","bivariate normal (statistics)","bivariate Gaussian (statistics)"],"phonetic":"/baɪˈnɔrməl/","extraExplanation":["“binormal”最常见于空间曲线的Frenet–Serret框架：T（切向）、N（法向）、B（副法向/双法向）。其中 B = T × N（方向取决于约定的右手系）。","在统计学里，binormal 常被当作 bivariate normal（双变量正态）的同义用法；在日常英文中更常写作 “bivariate normal”。"]}
{"word":"binos","summary":{"en":"“Binos” is an informal word meaning binoculars.","zh":"“binos”是“binoculars（双筒望远镜）”的口语缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Binoculars (informal): a pair of optical instruments used to see distant objects more clearly.","zh":"（非正式）双筒望远镜：一对用来更清楚地观看远处物体的光学仪器。"},"examples":[{"en":"Bring your binos if you want to spot birds on the trail.","zh":"如果你想在步道上观鸟，就带上你的双筒望远镜。"},{"en":"I lent my binos to my friend at the baseball game.","zh":"在棒球比赛时，我把双筒望远镜借给了朋友。"},{"en":"With binos, you can see the details on the far hillside.","zh":"用双筒望远镜，你能看清远处山坡上的细节。"}]}],"synonyms":["binoculars","field glasses"],"phonetic":"/ˈbɪnoʊz/","extraExplanation":["“binos”是英语口语中的缩写形式，来自“binoculars”。常见于观鸟、徒步、打猎、体育观赛等场景。","在较正式的写作或说明书里通常用“binoculars”；日常聊天或户外圈子更常说“binos”。"]}
{"word":"binotic","summary":{"en":"Binotic means “involving both ears,” mainly used in technical contexts.","zh":"binotic 指“涉及双耳的”，主要用于技术/学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, technical) Relating to both ears; involving hearing with two ears.","zh":"（罕用/技术用语）与双耳有关的；涉及用两只耳朵听觉的。"},"examples":[{"en":"The experiment compared monotic and binotic listening conditions.","zh":"该实验比较了单耳与双耳的聆听条件。"},{"en":"Binotic stimulation can help researchers study how the brain combines sounds from both ears.","zh":"双耳刺激能帮助研究者了解大脑如何整合来自两只耳朵的声音。"}]}],"synonyms":["binaural","two-eared"],"phonetic":"/baɪˈnɑːtɪk/","extraExplanation":["“binotic”在日常英语里很少见，更多出现在听觉科学/心理声学（psychoacoustics）等领域，用来与“monotic（单耳）”对比。","学习时要注意它常被更常见的“binaural（双耳的）”替代：两者都可指“双耳”，但“binaural”更常用于音频设备与录音语境（如 binaural recording）。"]}
{"word":"binotonous","summary":{"en":"“Binotonous” is not standard English; you probably mean “monotonous” = dull and repetitive.","zh":"“binotonous” 不是规范英语词；你很可能想写 “monotonous”，意思是“单调乏味、重复”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is most likely a misspelling of “monotonous” (meaning boring because it never changes).","zh":"不是常见或规范的英语单词；很可能是把 “monotonous”（单调乏味、缺乏变化）拼错了。"},"examples":[{"en":"I couldn’t find “binotonous” in a dictionary—did you mean “monotonous”?","zh":"我在词典里找不到 “binotonous”——你是不是想写 “monotonous”？"},{"en":"The lecture became monotonous after the first hour.","zh":"讲座过了第一个小时后变得很单调。"}]},{"partOfSpeech":"adj.","definition":{"en":"(If you meant “monotonous”) boring or repetitive because the tone, activity, or pattern does not change much.","zh":"（如果你想写 “monotonous”）单调的；重复乏味的，因为语调、活动或模式几乎没有变化。"},"examples":[{"en":"He spoke in a monotonous voice.","zh":"他说话的语调很单调。"},{"en":"Doing the same task every day can feel monotonous.","zh":"每天做同样的事情会让人觉得很乏味。"},{"en":"The scenery was beautiful, but the drive became monotonous.","zh":"风景很美，但开久了会觉得路程很单调。"}]}],"synonyms":["monotonous","repetitive","dull","unvarying","tedious"],"phonetic":"/ˈmɑːnəˌtoʊnəs/","extraExplanation":["“binotonous” 可能是把前缀 bi-（“两个”）和 “monotonous” 混在一起写出来的非标准拼法。英语里更常见的相关词有：\n- monotonous：单调、乏味（最可能的目标词）\n- bitonal / two-tone：双调的（多用于音乐、设计/配色）\n如果你告诉我它出现的句子或领域（音乐/写作/日常表达），我可以帮你确认最合适的词。"]}
{"word":"binous","summary":{"en":"“Binous” (rare) means “having two parts; double.”","zh":"“binous”（少见）意思是“有两个部分的；双重的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two parts; made up of two; double (rare/old-fashioned).","zh":"有两个部分的；由两个组成的；双重的（较少见/较古旧）"},"examples":[{"en":"Some older scientific writing uses “binous” to mean “two-part.”","zh":"一些较早的科学写作会用“binous”表示“由两部分组成的”。"},{"en":"The author described the creature as binous, with two distinct heads.","zh":"作者把这种生物描写成“双体的”，有两个明显的头。"}]}],"synonyms":["two-part","double","twofold","dual"],"phonetic":"/ˈbaɪnəs/","extraExplanation":["“binous”很少在现代英语里使用，常见于较旧或较学术的语境。更常用的表达是：two-part、double、twofold，或根据具体情况说“having two …”。","词源上与前缀 bi-（表示“二、双”）有关；如果你本来想查更常见的词，可能是 binoculars（双筒望远镜）或 binary（二进制/二元的）。"]}
{"word":"binovular","summary":{"en":"Binovular means “from two eggs,” typically describing fraternal (dizygotic) twins.","zh":"binovular 指“由两个卵子形成的”，通常用来描述异卵（非同卵）双胞胎。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Produced from two separate eggs (ova); describing dizygotic (fraternal) twins or a pregnancy where two eggs were fertilized.","zh":"由两个不同的卵子形成的；用于描述双卵（异卵、非同卵/兄弟型）双胞胎或一次妊娠中两个卵子分别受精的情况。"},"examples":[{"en":"The ultrasound suggested a binovular twin pregnancy.","zh":"超声检查提示可能是双卵双胞胎妊娠。"},{"en":"Binovular twins are usually no more genetically similar than ordinary siblings.","zh":"双卵双胞胎在基因相似度上通常与普通兄弟姐妹差不多。"}]}],"synonyms":["dizygotic","fraternal (twins)","two-egg (twins)"],"phonetic":"/baɪˈnɑːv.jə.lɚ/","extraExplanation":["“Binovular”多见于医学或较旧的学术写作中；现代更常用的说法是“dizygotic (fraternal) twins”（异卵/非同卵双胞胎）。","词源上可拆为 bi-（两个）+ ovular（卵的）。与之相对的是“monovular”（单卵，常对应 monozygotic/identical twins）。"]}
{"word":"binoxalate","summary":{"en":"Binoxalate is a chemistry term for an acid oxalate (hydrogen oxalate), found in salts like potassium binoxalate.","zh":"binoxalate 是化学术语，指草酸的酸式盐（氢草酸盐/酸草酸盐），常见于如草酸氢钾等盐类中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound that is an acid salt of oxalic acid (a “hydrogen oxalate”); it contains the binoxalate (hydrogen oxalate) ion and is found in salts such as potassium binoxalate","zh":"一种草酸的酸式盐（“氢草酸盐/酸草酸盐”）；含有“氢草酸根（binoxalate）”的化合物，例如“草酸氢钾（potassium binoxalate）”等盐类"},"examples":[{"en":"Potassium binoxalate is an acid salt related to oxalic acid.","zh":"草酸氢钾（potassium binoxalate）是一种与草酸有关的酸式盐。"},{"en":"In a lab, binoxalate salts must be handled carefully and labeled clearly.","zh":"在实验室里，氢草酸盐（binoxalate）类盐必须小心处理并清楚标注。"}]}],"synonyms":["acid oxalate","hydrogen oxalate","(in some contexts) hydrogen oxalate salt"],"phonetic":"/baɪˈnɑːksəleɪt/","extraExplanation":["“bi-”在一些较旧或较传统的化学命名里，常用来表示“酸式盐/含一个可电离氢的盐”（相当于 today’s “hydrogen-” 命名）。所以 binoxalate 常对应 hydrogen oxalate（氢草酸盐/酸草酸盐）。","草酸盐/氢草酸盐在化学与工业语境中出现较多；日常英语里不常用，更常见的是更具体的名称（如 potassium hydrogen oxalate）或统称 oxalate。"]}
{"word":"binoxide","summary":{"en":"Binoxide is an archaic term meaning a dioxide (an oxide with two oxygen atoms).","zh":"binoxide 是过时的术语，通常指二氧化物（含两个氧原子的氧化物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an old-fashioned chemical term for an oxide containing two oxygen atoms per molecule (what we now usually call a “dioxide”); e.g., “carbon binoxide” = carbon dioxide","zh":"一种旧式化学术语，指每个分子含两个氧原子的氧化物（现代通常称为“二氧化物”）；例如“carbon binoxide”即二氧化碳"},"examples":[{"en":"In older chemistry books, you may see the term “binoxide” where modern texts use “dioxide.”","zh":"在较旧的化学书中，你可能会看到“binoxide”，而现代教材会用“dioxide（二氧化物）”。"},{"en":"“Carbon binoxide” is an outdated name for carbon dioxide.","zh":"“carbon binoxide”是二氧化碳的过时名称。"}]}],"synonyms":["dioxide (modern term)"],"phonetic":"/baɪˈnɑk.saɪd/","extraExplanation":["“bi-”在早期化学命名中常用来表示“两个（氧）”，但这种体系与现代以化学价态/化学式为核心的命名并不完全一致，所以今天几乎只在历史文献、旧教材或译本中见到“binoxide”。","阅读旧文献时可把“binoxide”大致对应理解为“dioxide（二氧化物）”，但具体仍建议结合化学式确认（不同年代与作者用法可能略有差异）。"]}
{"word":"bins","summary":{"en":"“Bins” usually means multiple containers for trash, recycling, storage, or sorting; it can also be the verb form meaning “puts into a bin / throws away.”","zh":"“bins”通常指多个用于垃圾、回收、收纳或分类的容器；也可作动词形式，表示“放进桶/箱里、扔掉”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “bin”: containers (often boxes or large receptacles) used for storing, sorting, or throwing away things","zh":"“bin”的复数：用于存放、分类或丢弃物品的容器（常见为箱子或较大的收纳/垃圾容器）"},"examples":[{"en":"Put the recyclables in the blue bins.","zh":"把可回收物放进蓝色回收桶里。"},{"en":"The warehouse has bins for screws, bolts, and nails.","zh":"仓库里有用来放螺丝、螺栓和钉子的分类箱。"}]},{"partOfSpeech":"v.","definition":{"en":"third-person singular of “bin”: to put something into a bin; to throw something away; to sort items into labeled containers","zh":"“bin”的第三人称单数：把某物放进箱/桶里；丢弃；把物品按标签分类放入容器"},"examples":[{"en":"She bins the paper and keeps the plastic separate.","zh":"她把纸类投进桶里，并把塑料分开处理。"},{"en":"He bins old receipts every month.","zh":"他每个月都会把旧收据扔掉。"}]}],"synonyms":["containers","boxes","storage bins","trash cans","recycling bins"],"phonetic":"/bɪn/"}
{"word":"bint","summary":{"en":"“Bint” is British slang for a girl or woman, usually insulting.","zh":"“bint”是英式俚语，指女孩/女人，但通常带侮辱性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a slang word (mainly British) for a girl or woman, often used in a rude or insulting way","zh":"（主要为英式）俚语：指“女孩/女人”，常带粗鲁或侮辱意味"},"examples":[{"en":"He called her a bint, which was disrespectful and unnecessary.","zh":"他叫她“bint”，这既不尊重人也完全没必要。"},{"en":"Don’t use that word—it's insulting.","zh":"别用那个词——很侮辱人。"}]}],"synonyms":["woman (neutral)","girl (neutral)","lass (British, informal)","bird (British, informal; can sound sexist)"],"phonetic":"/bɪnt/","extraExplanation":["“bint”在英式口语里带强烈贬义，语气接近“蠢女人/讨厌的女人”。在日常交流中不建议使用，尤其对陌生人或正式场合会显得冒犯。","词源可追溯到阿拉伯语中表示“女儿”的词（如 bint），但进入英语后语气发生变化，通常不再是中性称呼。"]}
{"word":"bintangor","summary":{"en":"Bintangor is a Southeast Asian hardwood tree (often *Calophyllum*) and the wood made from it, commonly sold as a timber trade name.","zh":"Bintangor 指东南亚的一类硬木树（常见为 *Calophyllum* 属相关树种）及其木材，常作为木材贸易名称使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Southeast Asian hardwood tree (often in the genus *Calophyllum*) and the timber from it, used for furniture, flooring, and general construction.","zh":"一种东南亚的硬木树（常见于 *Calophyllum* 属等）及其木材，常用于家具、地板和一般建筑用材。"},"examples":[{"en":"The cabinet is made from bintangor, a durable tropical hardwood.","zh":"这个橱柜是用 bintangor（宾当戈木，一种耐用的热带硬木）做的。"},{"en":"Some suppliers list bintangor as a general trade name for several related species.","zh":"一些供应商把 bintangor 作为几种近缘树种的统称（贸易名）来标注。"}]}],"synonyms":["Calophyllum (trade name)","tropical hardwood"],"phonetic":"/bɪnˈtæŋɡɔr/","extraExplanation":["“bintangor”多见于木材贸易与材料说明书中，属于地区性/行业性名称，而不一定对应单一、固定的学名树种；不同产地可能指不同但相近的树种。","该词源于马来语/印尼语语境（在马来群岛一带较常见）。购买或选材时，若需要精确性能（密度、耐腐、稳定性等），最好同时确认学名与产地。"]}
{"word":"bints","summary":{"en":"“Bints” is the plural of “bint,” a British slang noun meaning a woman or girl in an insulting way.","zh":"“bints”是“bint”的复数，属于英式俚语，用来侮辱性地称呼女性或女孩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, chiefly British; offensive) A woman or girl, used in a rude or insulting way.","zh":"（俚语，主要英式；带侮辱性）对女性或女孩的粗鲁/贬损称呼。"},"examples":[{"en":"He called his ex a “bint,” which was disrespectful.","zh":"他把前任叫作“bint”，这很不尊重人。"},{"en":"Don’t use that word—it’s an insulting term for a woman.","zh":"别用那个词——那是侮辱女性的说法。"}]}],"synonyms":["woman (neutral)","girl (neutral)","person (neutral)","chick (informal; can sound sexist)"],"phonetic":"/bɪnt/","extraExplanation":["“bint”在英国口语里常见，但语气很冲，很多人会觉得冒犯；更安全的说法是用中性词如“woman / girl / person”。","词源与阿拉伯语“bint”（意为“女儿”）有关，后来进入英国俚语并产生贬义，用法带有文化与历史背景，因此在跨文化交流中更应避免使用。"]}
{"word":"binturong","summary":{"en":"A binturong is a Southeast Asian tree-dwelling mammal with shaggy fur and a prehensile tail; it’s also called a bearcat.","zh":"binturong 指熊狸：一种东南亚树栖哺乳动物，毛蓬松、尾巴可抓握，也叫 bearcat。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a binturong; a large, tree-climbing mammal from Southeast Asia with shaggy black fur and a long prehensile tail (also called a “bearcat”)","zh":"熊狸；一种产于东南亚的大型树栖哺乳动物，黑色蓬松毛发，尾巴可抓握（也叫“bearcat/熊猫狸”）"},"examples":[{"en":"We saw a binturong sleeping in the treetops at the zoo.","zh":"我们在动物园里看到一只熊狸在树梢上睡觉。"},{"en":"The binturong uses its prehensile tail to climb and balance.","zh":"熊狸用它能抓握的尾巴来攀爬和保持平衡。"}]}],"synonyms":["bearcat"],"phonetic":"/ˈbɪn.tjəˌrɔŋ/","extraExplanation":["“Binturong”来自东南亚地区的语言（经由马来语/印尼语进入英语），在英语里常见于动物园、纪录片和野生动物保护语境。","它被昵称为“bearcat（熊猫狸/熊狸）”，但既不是熊也不是猫；属于灵猫科（civet family）相关类群。","一个有趣的文化点：熊狸常被描述为身上有类似“爆米花/奶油玉米”的气味，这在英文科普文章里很常见。"]}
{"word":"binuclear","summary":{"en":"Binuclear means “having two nuclei or two central atoms,” mainly used in chemistry and biology.","zh":"binuclear 指“具有两个核或两个中心原子”，主要用于化学与生物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Having two nuclei or two central atoms; often describing a molecule, complex, or cell with two nuclei.","zh":"（化学/生物）双核的；具有两个细胞核或两个中心原子的；常用于描述分子、配合物或细胞有两个“核/中心”。"},"examples":[{"en":"A binuclear metal complex contains two metal centers linked by a ligand.","zh":"双核金属配合物包含两个金属中心，并由配体连接。"},{"en":"Under the microscope, the researcher observed several binuclear cells.","zh":"在显微镜下，研究人员观察到一些双核细胞。"}]}],"synonyms":["dinuclear","two-nucleus","bimetallic (context-dependent)"],"phonetic":"/baɪˈnuːkliər/","extraExplanation":["“bi-”表示“二、双”（如 bilingual 双语的），而 “nuclear” 在科学语境里常指“核/核心”，不一定与“核武器”或“核电”相关。","在化学中常见搭配有 binuclear complex（双核配合物）、binuclear catalyst（双核催化剂）；在生物学中也可指 binuclear cells（双核细胞）。","不要与 “bipolar”（双极的）或 “diatomic”（双原子的）混淆：binuclear 强调“两个核/两个中心”，而 diatomic 强调“两个原子”。"]}
{"word":"binucleate","summary":{"en":"Binucleate means having two nuclei in a single cell.","zh":"binucleate 指“（细胞）双核的”，即一个细胞内有两个细胞核。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) Having two nuclei in one cell.","zh":"（生物）双核的；一个细胞内有两个细胞核的。"},"examples":[{"en":"Some fungal cells can be binucleate, containing two nuclei in a single cell.","zh":"一些真菌细胞可能是双核的，在一个细胞里含有两个细胞核。"},{"en":"Under the microscope, the researcher identified a binucleate cell in the sample.","zh":"在显微镜下，研究人员在样本中辨认出一个双核细胞。"}]}],"synonyms":["two-nucleated","binuclear"],"phonetic":"/baɪˈnuːkliˌeɪt/","extraExplanation":["词源上，bi- 表示“二、双”，nucleate 来自 nucleus（细胞核）。因此 binucleate 直观意思就是“有两个细胞核”。","binucleate 常用于生物学与医学语境（如细胞学、组织学）。它描述的是细胞核的数量，不等同于“多倍体”（染色体组数的变化）。"]}
{"word":"binucleated","summary":{"en":"“Binucleated” describes a cell that has two nuclei.","zh":"“binucleated”指一个细胞内有两个细胞核（双核）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology/medicine) Having two nuclei in a single cell.","zh":"（生物/医学）双核的；一个细胞内有两个细胞核的。"},"examples":[{"en":"The pathologist noted several binucleated cells under the microscope.","zh":"病理学家在显微镜下注意到几个双核细胞。"},{"en":"Binucleated hepatocytes (liver cells) can be a normal finding in adults.","zh":"在成人中，双核肝细胞有时属于正常现象。"},{"en":"Some infections and drug reactions may increase the number of binucleated cells.","zh":"某些感染和药物反应可能会使双核细胞的数量增加。"}]}],"synonyms":["two-nucleated","binuclear"],"phonetic":"/baɪˈnuːkliˌeɪtɪd/","extraExplanation":["“binucleated”由前缀 bi-（表示“两个”）+ nucleated（有细胞核的）构成，常见于细胞学、病理学和组织学描述。","在医学语境中，双核细胞可能是正常生理现象（如部分肝细胞），也可能提示细胞分裂/细胞周期异常或应激反应；是否异常取决于细胞类型、数量比例与临床背景。"]}
{"word":"binucleolate","summary":{"en":"Binucleolate means having two nucleoli in the cell nucleus.","zh":"binucleolate 指细胞核内有两个核仁（双核仁）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) Having two nucleoli (two small structures inside a cell nucleus that help make ribosomes).","zh":"（生物）双核仁的；（细胞核内）具有两个核仁的。"},"examples":[{"en":"Under the microscope, the cell appeared binucleolate, with two distinct nucleoli visible in the nucleus.","zh":"在显微镜下，这个细胞呈现双核仁状态，细胞核内可见两个清晰的核仁。"},{"en":"Some species show binucleolate nuclei during particular stages of development.","zh":"某些物种在特定发育阶段会出现双核仁细胞核。"}]}],"synonyms":["two-nucleolated","dinucleolate"],"phonetic":"/baɪˈnuːkliəˌleɪt/","extraExplanation":["词源上可拆解为 bi-（两个）+ nucleol-（核仁）+ -ate（形容词后缀），字面意思就是“有两个核仁的”。","核仁（nucleolus）的主要功能与核糖体的生成有关；因此在细胞生物学或组织学描述中，是否“单核仁/双核仁”有时可作为细胞类型或状态的观察特征之一。"]}
{"word":"binukau","summary":{"en":"“binukau” is not recognized as a standard English word; it likely needs context or may be a misspelling or a name.","zh":"“binukau”不是标准英语词；通常需要语境判断，可能是拼写错误或专名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username/proper name, or a word from another language.","zh":"不是标准英语单词。可能是拼写错误、用户名/专有名词，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “binukau” in standard English dictionaries—could you share a sentence where you saw it?","zh":"我在常见英语词典里查不到“binukau”——你能提供它出现的句子吗？"},{"en":"Did you mean “binocular” (related to binoculars)?","zh":"你是不是想写“binocular”（与双筒望远镜有关）？"}]}],"phonetic":"/bɪˈnuːkaʊ/","extraExplanation":["“binukau”更像是：①拼写误差（例如想写 *binocular* /bɪˈnɑːkjələr/ 之类）；②人名、网名或地名；③其他语言的词（比如南亚/东南亚语言中的拼写）。如果你告诉我它出现的语境（句子、话题、国家/地区），我可以更准确地判断含义与发音。"]}
{"word":"Binukid","summary":{"en":"Binukid is a language (and related adjective) connected to the Bukidnon people of Mindanao in the Philippines.","zh":"Binukid指菲律宾棉兰老岛布基农族使用的语言，也可作形容词表示“与该语言/族群文化有关”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Philippine language spoken by the Bukidnon people in the province of Bukidnon (Mindanao).","zh":"一种菲律宾语言，由棉兰老岛布基农省（Bukidnon）的布基农族（Bukidnon people）使用。"},"examples":[{"en":"She is studying Binukid to talk with her relatives in Bukidnon.","zh":"她在学习Binukid，好和布基农省的亲戚交流。"},{"en":"This folktale was recorded in Binukid and later translated into English.","zh":"这个民间故事先用Binukid记录，后来被翻译成英文。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Binukid language or the Bukidnon people/culture.","zh":"与Binukid语言或布基农族（及其文化）有关的。"},"examples":[{"en":"The museum has a Binukid word list for visitors.","zh":"博物馆为游客准备了一份Binukid词汇表。"},{"en":"They performed a Binukid song at the cultural festival.","zh":"他们在文化节上表演了一首Binukid歌曲。"}]}],"synonyms":["Bukidnon (language)","Bukidnon"],"phonetic":"/bɪˈnuːkɪd/","extraExplanation":["“Binukid”常被用来指“Bukidnon language（布基农语）”。在讨论菲律宾语言时，它通常和地点名“Bukidnon（布基农省）”以及族群“Bukidnon people（布基农族）”一起出现。","拼写与大小写：作为语言名称时通常首字母大写（Binukid）；作为形容词修饰名词时也常大写（Binukid speaker / Binukid literature）。"]}
{"word":"Binyon","summary":{"en":"Binyon usually refers to Laurence Binyon, a British poet best known for the remembrance poem “For the Fallen.”","zh":"Binyon 通常指英国诗人劳伦斯·宾扬，以悼念诗《献给阵亡者》（For the Fallen）最为著名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Laurence Binyon (1869–1943), a British poet, writer, and art historian, best known for the poem “For the Fallen,” often quoted in remembrance ceremonies for soldiers who died in war.","zh":"劳伦斯·宾扬（Laurence Binyon，1869–1943），英国诗人、作家与艺术史学者，最著名的作品是《献给阵亡者》（For the Fallen），其中名句常用于悼念战争中牺牲的士兵。"},"examples":[{"en":"Binyon is widely remembered for writing “For the Fallen.”","zh":"宾扬因创作《献给阵亡者》而广为人知。"},{"en":"The line “We will remember them” is often associated with Binyon’s poem.","zh":"“我们将铭记他们”这句常被认为与宾扬的诗有关。"},{"en":"In a literature class, we read Binyon alongside other World War I poets.","zh":"在文学课上，我们把宾扬与其他一战诗人一起阅读。"}]}],"synonyms":["Laurence Binyon"],"phonetic":"/ˈbɪn.jən/","extraExplanation":["宾扬的《For the Fallen》写于第一次世界大战初期（1914），其中最常被引用的一段是：“They shall grow not old, as we that are left grow old...” 以及后来常在纪念仪式中使用的回应式句子“Lest we forget / We will remember them”。在英国、英联邦国家的阵亡将士纪念日（Remembrance Day）或澳新军团日（ANZAC Day）等场合，经常会朗诵或引用这些诗句。"]}
{"word":"Binzuru","summary":{"en":"Binzuru is a respected arhat in Japanese Buddhism, commonly associated with healing rituals involving a temple statue.","zh":"Binzuru（宾头卢）是日本佛教中受尊崇的阿罗汉，常与寺院中“触摸祈愿疗愈”的雕像习俗相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Japanese Buddhism, a revered arhat (enlightened disciple of the Buddha), often represented by a statue that people touch or rub while praying for healing or good health.","zh":"（日本佛教）宾头卢（Binzuru，常指“宾头卢尊者”），一位受尊崇的阿罗汉；寺院中常见其像，人们会触摸或摩擦雕像并祈求治病与健康。"},"examples":[{"en":"At the temple entrance, visitors lined up to rub the Binzuru statue and pray for recovery.","zh":"在寺院入口处，游客排队摩擦宾头卢像，祈求康复。"},{"en":"She touched Binzuru’s knee because her own knee had been hurting.","zh":"她摸了宾头卢像的膝盖，因为她自己的膝盖一直在疼。"},{"en":"The guide explained that Binzuru is an arhat honored in Japanese Buddhist tradition.","zh":"导游解释说，宾头卢是日本佛教传统中受尊敬的阿罗汉。"}]}],"synonyms":["Binzuru Sonja","Pindola Bharadvaja","arhat"],"phonetic":"/bɪnˈzuːruː/","extraExplanation":["“Binzuru”常见全称为“Binzuru Sonja（宾头卢尊者）”。其形象与印度佛教人物 Pindola Bharadvaja（宾头卢颇罗堕阇）相关，在东亚佛教中被视为具有护佑与疗愈象征。","在日本寺院里，宾头卢像常被放在显眼处（如本堂外或参道旁）。民间习俗认为：摸（或擦）雕像某个部位，再摸自己的同部位，有“祈求病痛减轻、身体康健”的寓意；因此雕像表面常因触摸而变得光亮。"]}
{"word":"binzuru","summary":{"en":"Binzuru is a Japanese Buddhist healing figure, often seen as a statue that people touch or rub for good health.","zh":"Binzuru 指日本佛教中与祈求健康相关的宾头卢（常见为可抚摸的雕像）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a figure in Japanese Buddhism (often a wooden statue) representing Binzuru—also known as Pindola Bharadvaja—one of the Buddha’s disciples, traditionally associated with healing; people may rub the statue for good health.","zh":"日本佛教中的人物（常见为木雕像），指“宾头卢（Binzuru）”，又称“宾头卢颇罗堕阇 / Pindola Bharadvaja”，为佛陀弟子之一，民间常与祈求健康、治病相关；人们会抚摸雕像以求平安康健。"},"examples":[{"en":"At the temple entrance, visitors lined up to touch the Binzuru statue for good health.","zh":"在寺院入口，游客排队抚摸宾头卢（Binzuru）像，祈求健康。"},{"en":"Some people rubbed the statue’s knees, hoping their own knee pain would improve.","zh":"有人抚摸雕像的膝盖，希望自己的膝盖疼痛能缓解。"},{"en":"The guide explained that Binzuru is a healing figure in Japanese Buddhist tradition.","zh":"导游解释说，在日本佛教传统中，宾头卢（Binzuru）与治病祈福有关。"}]}],"synonyms":["Pindola Bharadvaja","Binzuru-sonja","healing statue"],"phonetic":"/bɪnˈzuːruː/","extraExplanation":["“Binzuru（宾头卢）”在日本寺院里常以“撫で仏（nade-botoke，意为‘可抚摸的佛像/圣像’）”的形式出现：人们会摸雕像的某个部位，再摸自己的相应部位，表达祈愿与祝福。这更多是一种民俗性的信仰实践，寺院礼仪与地区习惯可能不同。","在英文资料中也可能看到他的梵语/巴利语名字写作“Pindola Bharadvaja”，或日语尊称“Binzuru-sonja（宾头卢尊者）”。"]}
{"word":"Binzuru-sonja","summary":{"en":"Binzuru-sonja is a Japanese Buddhist revered figure (linked to the arhat Pindola) whose temple statue is often touched or rubbed in prayers for healing.","zh":"賓頭盧尊者是日本佛教中受敬仰的人物（常與羅漢 Pindola 相連），寺院裡常見其雕像供人觸摸或搓揉以祈求治病與健康。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Japanese Buddhism) Binzuru-sonja: a revered Buddhist figure—often identified with the arhat (enlightened disciple) Pindola Bharadvaja—commonly represented by a statue in Japanese temples that people touch or rub while praying for healing.","zh":"（日本佛教）賓頭盧尊者（Binzuru-sonja）：常被視為羅漢（證悟的佛弟子）之一，與梵語名 Pindola Bharadvaja 相連；在日本寺院常以雕像呈現，人們會觸摸或搓揉雕像並祈求治病、保佑健康。"},"examples":[{"en":"At the temple entrance, visitors lined up to rub the Binzuru-sonja statue and pray for recovery.","zh":"在寺院入口，參拜者排隊搓揉賓頭盧尊者像，祈求早日康復。"},{"en":"She touched the statue’s knees, hoping her own pain would ease.","zh":"她摸了雕像的膝蓋，希望自己的疼痛能減輕。"}]}],"synonyms":["Binzuru","Pindola Bharadvaja","Pindola","賓頭盧尊者","羅漢（rakan）"],"phonetic":"/bɪnˈzuːruː ˈsoʊndʒə/","extraExplanation":["「sonja / 尊者」是日語裡對受敬仰人物的尊稱，帶有「聖者、值得尊敬的人」的語感。","賓頭盧尊者在日本民間信仰中常被視為與「治病、健康」特別有緣，因此寺院裡常見到被長期觸摸而變得光亮的木像或石像。","不同寺院對其事蹟與來歷的說法可能略有差異，但多半會把他歸入「羅漢信仰」的脈絡（敬奉佛陀弟子、護法與修行典範）。"]}

