{"word":"BIU","summary":{"en":"BIU is an initialism most commonly used for Bar-Ilan University, but it can also mean other things depending on context.","zh":"BIU 是一个缩写，常见含义是巴伊兰大学（Bar-Ilan University），但也可能因语境不同而指代其他机构或术语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Initialism) Bar-Ilan University, a public research university in Israel.","zh":"（缩写）巴伊兰大学（Bar-Ilan University），以色列的一所公立研究型大学。"},"examples":[{"en":"She is applying to BIU for a master’s degree in education.","zh":"她正在申请去 BIU（巴伊兰大学）读教育学硕士。"},{"en":"The conference will be hosted at BIU this summer.","zh":"这次会议将于今年夏天在 BIU 举办。"}]},{"partOfSpeech":"n.","definition":{"en":"(Initialism) BIU can also stand for different organizations or terms depending on context (for example, “Bureau of Immigration” in some countries or internal names like “Business/Basic Information Unit”).","zh":"（缩写）BIU 也可能因语境不同而代表其他机构或术语（例如某些国家的“移民局”，或机构内部用语如“业务/基础信息单位”等）。"},"examples":[{"en":"In this document, BIU refers to the Bureau of Immigration.","zh":"在这份文件中，BIU 指移民局。"},{"en":"Please check what BIU means in your company’s handbook.","zh":"请在你们公司的手册里确认 BIU 的具体含义。"}]}],"phonetic":"/ˌbiː aɪ ˈjuː/","extraExplanation":["缩写（initialism）通常按字母逐个读，比如 BIU 读作 “B-I-U”。","因为 BIU 不像 NASA 那样有一个全球通用的唯一含义，所以最可靠的方法是看它出现的领域：大学/论文里常指 Bar-Ilan University；政府/签证材料里可能指移民相关机构；公司内部文件里可能是某个部门名称。你如果告诉我它出现的句子或领域（学校/签证/公司等），我可以帮你锁定最准确的释义。"]}
{"word":"biune","summary":{"en":"Biune means “two-in-one”: two aspects joined as one unified whole.","zh":"Biune 指“二而一”：两个方面合为一个整体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having two parts or aspects that form one unified whole; “two-in-one.”","zh":"（两个部分或方面）合而为一的；“二而一”的。"},"examples":[{"en":"Some writers describe a person as biune: both rational and emotional, yet one self.","zh":"一些作家把人描述为“biune”：既理性又感性，但仍是同一个自我。"},{"en":"In older theological writing, Christ is sometimes called biune—fully human and fully divine.","zh":"在较早的神学著作中，基督有时被称为 biune——完全为人，也完全为神。"}]}],"synonyms":["twofold","dual","double","united","having a dual nature"],"phonetic":"ˈbaɪjuːn","extraExplanation":["“bi-”表示“二/双”，“-une”与“one（一个）/unity（统一）”相关。这个词非常少见，更多时候人们会用更常见的表达，如 dual nature（双重本性）、twofold（双重的）、both … and …（既……又……）。","在宗教语境里，biune 常用于讨论“二性合一”（例如基督的人性与神性），类似于更常见的 triune（“三位一体”的）。"]}
{"word":"biunial","summary":{"en":"Biennial usually means “every two years,” and it can also mean a plant that lives for two years.","zh":"Biennial 通常指“每两年一次的”，也可指“二年生植物”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"happening every two years","zh":"每两年发生一次的；两年一次的"},"examples":[{"en":"The town holds a biennial festival to celebrate its history.","zh":"这个小镇每两年举办一次节日来庆祝它的历史。"},{"en":"She attends a biennial conference for teachers.","zh":"她参加一个两年一次的教师会议。"}]},{"partOfSpeech":"n.","definition":{"en":"a plant that completes its life cycle in two years (usually leaves the first year and flowers/seeds the second year)","zh":"二年生植物（通常第一年长叶，第二年开花结籽）"},"examples":[{"en":"Carrots are biennials, but we often harvest them in the first year.","zh":"胡萝卜是二年生植物，但我们常在第一年就收获。"},{"en":"This garden has many biennials that bloom in their second year.","zh":"这个花园里有很多二年生植物，会在第二年开花。"}]}],"synonyms":["every two years","two-year"],"phonetic":"/baɪˈɛniəl/","extraExplanation":["你输入的“biunial”很可能是拼写错误，常见目标词是 **biennial** /baɪˈɛniəl/（每两年一次）或 **biannual**（一年两次）。两者很容易混淆：**biennial = every two years**，**biannual = twice a year**。"]}
{"word":"biunique","summary":{"en":"Biunique means “bijective”: a perfect one-to-one matching between two sets (common in math).","zh":"biunique 指“双射的”：两个集合之间完全的一一对应关系（常见于数学语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially in mathematics) in a one-to-one and onto relationship; describing a correspondence where each element of one set matches exactly one element of another set, and every element is matched.","zh":"（尤用于数学）双射的；一一对应且“满射”的：两个集合之间每个元素都恰好对应另一个集合中的一个元素，并且没有元素被遗漏。"},"examples":[{"en":"There is a biunique correspondence between the set of integers and the set of even integers.","zh":"整数集合与偶整数集合之间存在双射对应关系。"},{"en":"If the function is biunique, it has an inverse function.","zh":"如果这个函数是双射的，它就有反函数。"}]}],"synonyms":["bijective","one-to-one","one-to-one correspondence","invertible (in math contexts)"],"phonetic":"/baɪˈjuːniːk/","extraExplanation":["“biunique”在日常英语中很少见，更常见的标准术语是“bijective”（双射的）或“one-to-one correspondence”（一一对应关系）。在一些教材或受法语影响的写作中会看到“biunique correspondence / biunique mapping”。","理解要点：one-to-one（单射）强调“不同输入不会得到同一输出”；onto（满射）强调“目标集合中的每个元素都能被击中”。“biunique”= two-way complete matching（两者都满足）。"]}
{"word":"biuniquely","summary":{"en":"“Biuniquely” means “in a one-to-one (bijective) way,” mostly used in math or formal contexts.","zh":"“biuniquely”表示“以一一对应（双射）的方式”，主要用于数学或较正式语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a one-to-one way; so that each item in one set matches exactly one item in another set (a bijection).","zh":"以一一对应的方式；使两个集合中的元素彼此“恰好一对一配对”（双射）。"},"examples":[{"en":"The function maps integers to even integers biuniquely.","zh":"这个函数把整数与偶整数进行一一对应的映射。"},{"en":"If two lists can be paired biuniquely, they have the same number of elements.","zh":"如果两个列表能一一配对，那么它们的元素数量相同。"},{"en":"The decoder must match codes to letters biuniquely to avoid ambiguity.","zh":"解码器必须让代码与字母一一对应，才能避免歧义。"}]}],"synonyms":["bijectively","one-to-one","in one-to-one correspondence"],"phonetic":"/baɪjuˈniːkli/","extraExplanation":["“biuniquely”多见于数学/逻辑/计算机科学语境，和更常用的“bijectively”意思几乎相同：都强调“每个对应都有且只有一个”，既不重复也不遗漏。","词源上可理解为 bi-（双、两）+ unique（唯一的）。在一般日常英语里很少用，更自然的说法常是 “one-to-one” 或 “in a one-to-one correspondence”。"]}
{"word":"biuniqueness","summary":{"en":"Biuniqueness means a one-to-one and onto correspondence (a bijection).","zh":"Biuniqueness 指一一对应且满射的关系（双射/双射性）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the property of being biunique (a one-to-one and onto relationship); in mathematics, the condition that a function or correspondence is a bijection","zh":"“双唯一性/双单射性”的性质；在数学中指一种对应或函数既一一对应又满射（即为双射）的条件"},"examples":[{"en":"The proof depends on the biuniqueness of the mapping between the two sets.","zh":"这个证明依赖于这两个集合之间映射的双唯一性（双射性）。"},{"en":"Biuniqueness ensures that every output value comes from exactly one input value.","zh":"双唯一性保证每个输出值都恰好来自一个输入值。"},{"en":"If the relation lacks biuniqueness, you cannot define a true inverse function.","zh":"如果这种关系不具备双唯一性，就无法定义真正的反函数。"}]}],"synonyms":["bijectivity","bijection","one-to-one correspondence"],"phonetic":"/ˌbaɪjuːˈniːknəs/","extraExplanation":["“biuniqueness”比较少见，更常见的标准术语是“bijectivity / bijection（双射/双射性）”或“one-to-one correspondence（一一对应）”。","词源上，“bi-”表示“双/两”，与“unique（唯一）”结合，强调“双方都唯一”：输入到输出唯一、输出也对应唯一的输入。","常见于数学（集合论、函数、代数）或较旧/较翻译色彩的学术表达中。"]}
{"word":"biunity","summary":{"en":"Biunity means a “two-in-one” unity: two parts or aspects forming one whole.","zh":"Biunity 指“二而一”的统一：两个部分或面向构成一个整体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being two things while forming one united whole; “two-in-one” unity","zh":"二而一；两者合一的状态（两个部分构成一个整体）"},"examples":[{"en":"Some philosophers describe mind and body as a biunity rather than as separate substances.","zh":"一些哲学家把心灵与身体描述为“二而一”的统一体，而不是彼此分离的实体。"},{"en":"In this design, function and beauty are treated as a biunity: each supports the other.","zh":"在这个设计中，功能与美被视为二而一：彼此支撑。"}]},{"partOfSpeech":"n.","definition":{"en":"(often religious or philosophical) a paired unity, especially the unity of two persons or aspects within one reality","zh":"（常用于宗教或哲学语境）二元合一；两“位格”或两种面向在同一真实中的统一"},"examples":[{"en":"The author uses the word biunity to discuss the relationship between the human and the divine.","zh":"作者用“biunity”来讨论人性与神性之间的关系。"},{"en":"The poem imagines love as a biunity—two lives joined into one story.","zh":"这首诗把爱想象成二元合一——两段人生汇成一个故事。"}]}],"synonyms":["two-in-one","dual unity","unity of two","paired unity","union"],"phonetic":"/baɪˈjuːnɪti/","extraExplanation":["“biunity”由前缀 bi-（二）+ unity（统一）构成，属于比较少见、偏书面/学术的词。日常英语里更常见的表达是 “two-in-one,” “dual unity,” 或根据语境说 “a unity of two (things).”","它有时会出现在神学或哲学写作中，用来强调“既是二，又是一”的结构（例如两种性质、两种面向、两个人格的合一）。"]}
{"word":"biunivocal","summary":{"en":"Biunivocal means a strict one-to-one correspondence (a bijection) between two sets or things.","zh":"Biunivocal 指两者之间严格的一一对应关系（双射）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a relationship or mapping) one-to-one and onto: each element in one set matches exactly one element in the other set, and every element is matched.","zh":"（指关系/映射）双射的、一一对应且覆盖的：一个集合中的每个元素都恰好对应另一个集合中的一个元素，并且所有元素都被对应到。"},"examples":[{"en":"In this system, each user ID is biunivocal with exactly one account record.","zh":"在这个系统里，每个用户ID都与且仅与一个账户记录构成双射关系。"},{"en":"The teacher used a simple chart to show a biunivocal pairing between letters and numbers.","zh":"老师用一张简单的表来展示字母与数字之间的一一对应配对。"}]},{"partOfSpeech":"adj.","definition":{"en":"(more generally) having a strict one-to-one correspondence between two things.","zh":"（更广义）两者之间存在严格的一一对应关系。"},"examples":[{"en":"There isn’t a biunivocal link between test scores and intelligence.","zh":"考试分数与智力之间并不存在严格的一一对应关系。"},{"en":"The novel avoids any biunivocal connection between the hero and the author.","zh":"这部小说避免把主人公与作者建立起任何严格的一一对应关系。"}]}],"synonyms":["bijective","one-to-one","in one-to-one correspondence"],"phonetic":"/ˌbaɪ.juːˈnɪv.ə.kəl/","extraExplanation":["“biunivocal”常见于数学（尤其是集合论/函数/映射）与逻辑语境，相当于“bijective（双射）”。在一般英语写作中较少使用，更常见的表达是“one-to-one correspondence”。","词源上：bi-（两者）+ univocal（单义的/唯一对应的）。在哲学或语言学讨论中，univocal 有“同一意义使用”的含义，因此 biunivocal 有时也被用来强调“两边都唯一对应、没有歧义”。"]}
{"word":"biurate","summary":{"en":"Biurate is an older word for a uric-acid salt, often mentioned in connection with gout crystals.","zh":"Biurate 是“尿酸盐”的较旧说法，常用于描述痛风相关的尿酸盐结晶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a salt of uric acid (an older term, especially used for the crystals found in gout, e.g., sodium biurate).","zh":"尿酸盐（较旧的说法，常用于描述痛风中沉积的结晶，如“尿酸钠/biurate”）。"},"examples":[{"en":"Doctors once described the needle-shaped crystals in gout as sodium biurate.","zh":"过去医生常把痛风中的针状结晶称为“尿酸钠（sodium biurate）”。"},{"en":"Biurates can form when uric acid levels in the body are high.","zh":"当体内尿酸水平偏高时，可能形成尿酸盐结晶。"}]}],"synonyms":["urate","sodium urate","monosodium urate"],"phonetic":"/baɪˈjʊreɪt/","extraExplanation":["“biurate”在现代医学英语里不如“urate（尿酸盐）”常用，很多语境中你会直接看到“monosodium urate crystals（单钠尿酸盐结晶）”。因此阅读较老的医学资料时遇到“biurate”，通常可理解为“urate”的旧称或特指某些尿酸盐（尤其是钠盐）。"]}
{"word":"biurea","summary":{"en":"Biurea is a chemical compound, also called biuret, often mentioned in connection with the biuret test for proteins.","zh":"Biurea 是一种化学化合物，也叫 biuret（缩二脲），常与用于检测蛋白质的缩二脲试验相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (also called biuret) formed by linking two urea units; it is known for its role in the “biuret test” for proteins.","zh":"一种化学化合物（也称 biuret / 缩二脲），由两个“尿素”单元连接而成；因用于检测蛋白质的“缩二脲反应/缩二脲试验”而常被提到。"},"examples":[{"en":"In the lab, biurea (biuret) is used in the biuret test to check for proteins.","zh":"在实验室里，biurea（biuret，缩二脲）常用于缩二脲试验来检测是否含有蛋白质。"},{"en":"The sample turned purple, suggesting a positive reaction related to biurea chemistry.","zh":"样品变成紫色，提示出现了与 biurea 相关的阳性反应。"}]}],"synonyms":["biuret"],"phonetic":"/baɪˈjʊriə/","extraExplanation":["“Biurea”在日常英语里非常少见，更常见的名称是“biuret”。在许多教材中，“biuret test”指利用铜离子在碱性条件下与蛋白质的肽键产生紫色络合物的现象。","注意不要把“biurea/biuret（缩二脲）”和“urea（尿素）”混淆：它们是不同的化学物质，名称相似但结构与用途不同。"]}
{"word":"biuret","summary":{"en":"Biuret is a chemical compound best known for the biuret test, which detects proteins by a purple color change.","zh":"Biuret（缩二脲）是一种化合物，最常见于“缩二脲试验”，通过显紫色来检测蛋白质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound formed when urea is heated; it is used in the “biuret test,” a common lab test for proteins (it turns violet in the presence of proteins).","zh":"一种由尿素加热生成的化合物；常用于“缩二脲反应/缩二脲试验”（蛋白质检验），遇到蛋白质会显紫色。"},"examples":[{"en":"The lab used the biuret test to check whether the solution contained protein.","zh":"实验室用缩二脲试验来检测溶液中是否含有蛋白质。"},{"en":"Biuret reagent turns purple when it reacts with peptide bonds.","zh":"缩二脲试剂与肽键反应时会变成紫色。"}]}],"synonyms":["biuret test (related term)","biuret reagent (related term)"],"phonetic":"/baɪˈjʊrɛt/","extraExplanation":["“Biuret”在生物化学入门课程里很常见，主要因为“缩二脲试验（biuret test）”是检测蛋白质/多肽最经典的定性实验之一：它实际上检测的是“肽键（peptide bond）”。","词源上可理解为“bi-（二）+ uret（与尿素/氨基甲酸酯相关）”，指由两个“尿素单元”缩合形成的结构。"]}
{"word":"biuret-free","summary":{"en":"“Biuret-free” means free of the impurity biuret, often describing high-purity urea for lab/industrial use.","zh":"“Biuret-free”指不含（或几乎不含）缩二脲杂质，常用来描述高纯度尿素等化学品。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing no biuret (a chemical impurity), especially used for chemicals like urea that must be high-purity for lab or industrial use.","zh":"不含缩二脲（biuret，常见杂质）的；尤用于尿素等需要高纯度的实验或工业级化学品。"},"examples":[{"en":"Use biuret-free urea to avoid side reactions in protein experiments.","zh":"在蛋白质实验中使用不含缩二脲的尿素，以避免副反应。"},{"en":"The supplier guarantees the urea is biuret-free for pharmaceutical processing.","zh":"供应商保证该尿素不含缩二脲，适用于制药加工。"}]}],"synonyms":["biuretless","free of biuret","biuret absent"],"phonetic":"/baɪˈjʊrɛt friː/","extraExplanation":["“Biuret-free”常见于化学品标签与技术参数，尤其是尿素（urea）。尿素在加热或合成过程中可能生成少量缩二脲；在某些用途（如制药、精细化工、部分生物实验）中，这种杂质可能影响反应、纯度或结果，因此会强调“biuret-free”。","不要把它和“Biuret test（双缩脲反应/蛋白质检验）”混淆：双缩脲反应是用来检测蛋白质/肽键的实验，而“biuret-free”是说样品里不含（或几乎不含）缩二脲这种杂质。"]}

