{"word":"bivalence","summary":{"en":"Bivalence means “two-valued”: in chemistry, an ability to form two bonds; more generally, a mixed or dual meaning/feeling.","zh":"bivalence 表示“二价/二重”：在化学中指能形成两个键；更一般地指意义或情感的两面性（常带矛盾）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the capacity of an atom, ion, or chemical group to form two chemical bonds (valence = 2)","zh":"（化学）二价；二价键合能力（价数为2）"},"examples":[{"en":"Oxygen usually has a bivalence of two in many compounds.","zh":"在许多化合物中，氧通常是二价的。"},{"en":"The chemist explained bivalence using simple bonding diagrams.","zh":"化学家用简单的成键示意图解释了二价。"}]},{"partOfSpeech":"n.","definition":{"en":"the state of having two different (often conflicting) values, meanings, or feelings toward the same thing; duality","zh":"（心理/语言等）二重性；两种（常互相冲突的）价值、意义或情感并存的状态"},"examples":[{"en":"Her bivalence toward moving abroad was clear: excitement mixed with fear.","zh":"她对出国的二重心态很明显：既兴奋又害怕。"},{"en":"The poem’s bivalence lets the ending feel both hopeful and sad.","zh":"这首诗的二重性让结尾既像希望又像忧伤。"}]}],"synonyms":["divalency","duality","ambivalence"],"phonetic":"/baɪˈveɪləns/","extraExplanation":["“bivalence”来自前缀 bi-（二）+ valence（价；效力）。在科学语境里常与“divalent（二价的）”一起出现：divalent是形容词，bivalence是名词。","在语言学/逻辑学里，bivalence也常指“二值性”（命题非真即假），与“principle of bivalence（二值原理）”相关；这是较学术的用法。"]}
{"word":"bivalencies","summary":{"en":"“Bivalencies” is the plural of “bivalency,” most commonly meaning a valence of 2 in chemistry; less commonly it refers to having two meanings or values at once.","zh":"bivalencies 是 bivalency 的复数，最常指化学中的“二价（价态为2）”；较少见地也可指同时具有两种含义或价值的二重性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or property of having a valence of 2; the ability of an atom, ion, or group to form two chemical bonds","zh":"（化学）二价；具有2个化合价/价态的性质；原子、离子或基团能形成两条化学键的能力"},"examples":[{"en":"Magnesium commonly forms ions with bivalency (+2).","zh":"镁通常形成二价（+2）的离子。"},{"en":"In this reaction, iron shows bivalency by bonding with two chloride ions.","zh":"在这个反应中，铁通过与两个氯离子成键表现出二价性。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) having two different values, meanings, or forces at the same time; duality","zh":"（较少见）同时具有两种不同的价值、含义或作用力；二重性"},"examples":[{"en":"The poem’s bivalencies—hope and grief—make it feel emotionally complex.","zh":"这首诗的二重性——希望与悲伤——让它在情感上更复杂。"},{"en":"Her answer had bivalencies that left the audience unsure of her position.","zh":"她的回答带有二重含义，让听众不确定她的立场。"}]}],"synonyms":["divalencies","valence-2 (chemistry)","duality","ambiguity"],"phonetic":"/baɪˈveɪlənsi/","extraExplanation":["“bivalency”常见于化学语境，和“bivalent（二价的）”同源。日常英语里更常说“divalent（= bivalent）”“valence/valency = 2”或直接说“+2 oxidation state（+2氧化态）”。","引申义（两种价值/含义并存）在学术写作里偶尔出现，但日常表达更常用“ambiguity（歧义）”“dual meaning（双重含义）”“mixed feelings（复杂/矛盾的感受）”。"]}
{"word":"bivalency","summary":{"en":"Bivalency means having two values or sides; in logic, it means every statement is either true or false.","zh":"bivalency 指“具有两种价值/两面性”；在逻辑中指“命题非真即假”的二值性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the ability or tendency to have two different values, effects, or meanings (often depending on context); “double-ness.”","zh":"（常因情境不同而）具有两种不同价值、作用或含义的性质；“双重性”。"},"examples":[{"en":"In politics, the same policy can show bivalency: it helps one group but harms another.","zh":"在政治中，同一项政策可能表现出“双重性”：它帮助一群人，却伤害另一群人。"},{"en":"The poem’s bivalency makes readers feel both hope and sadness at the same time.","zh":"这首诗的双重性让读者同时感到希望与悲伤。"}]},{"partOfSpeech":"n.","definition":{"en":"(logic) a system or principle where every statement must be either true or false, with no third option.","zh":"（逻辑）二值性：认为每个命题只能是“真”或“假”，不存在第三种可能。"},"examples":[{"en":"Classical logic is based on bivalency: each claim is either true or false.","zh":"经典逻辑以二值性为基础：每个断言要么为真，要么为假。"},{"en":"Some discussions of paradoxes question whether bivalency always holds.","zh":"一些关于悖论的讨论会质疑二值性是否总是成立。"}]}],"synonyms":["duality","two-sidedness","ambiguity (context-dependent)","either-or principle (logic)"],"phonetic":"/baɪˈveɪlənsi/","extraExplanation":["词形提示：bivalent（adj. 双价的/双重的）+ -cy（名词后缀，表示“性质、状态”）。","使用提醒：在日常英文里，“bivalency”不算常用，更多见于哲学、逻辑、文学批评等语境；普通表达可用“two-sided nature / duality / ambiguity（含混/歧义）”视语境替换。"]}
{"word":"bivalent","summary":{"en":"Bivalent means “having two values or interpretations,” and in science it often means “divalent (valence two).”","zh":"bivalent 指“有两种取值/两种解释的”，在科学语境中常指“二价的（divalent）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two values, two effects, or two possible interpretations; open to two different readings.","zh":"（含义、评价或影响）有两种取值/两面性的；可作两种不同理解的。"},"examples":[{"en":"The movie received a bivalent response: some people loved it, others disliked it.","zh":"这部电影的反响很两极：有人很喜欢，也有人不喜欢。"},{"en":"His comment was bivalent and could be taken as either a joke or an insult.","zh":"他的话有两面性，既可能被当作玩笑，也可能被理解为侮辱。"}]},{"partOfSpeech":"adj.","definition":{"en":"In chemistry, having a valence of two; able to form two chemical bonds (divalent).","zh":"【化学】二价的；有两个价/能形成两条化学键的（= divalent）。"},"examples":[{"en":"Calcium is bivalent in many compounds.","zh":"钙在许多化合物中呈二价。"},{"en":"A bivalent ion carries a 2+ or 2− charge.","zh":"二价离子带有 2+ 或 2− 的电荷。"}]},{"partOfSpeech":"adj.","definition":{"en":"In immunology, able to bind to two antigens or having two binding sites (often said of antibodies).","zh":"【免疫学】双价的；能与两个抗原结合/具有两个结合位点的（常指抗体）。"},"examples":[{"en":"Many antibodies are functionally bivalent, with two antigen-binding sites.","zh":"许多抗体在功能上是双价的，具有两个抗原结合位点。"}]}],"synonyms":["divalent","twofold","double-edged","dual","ambiguous"],"phonetic":"/baɪˈveɪlənt/","extraExplanation":["词源：bi-（两、双）+ valent（有……价值/力量的；来自拉丁语 valere“强壮、有力量”）。所以 bivalent 的核心感觉是“有两个‘有效的’方向/数值”。","易混词：ambivalent 表示“对同一件事同时有矛盾的感受（爱恨交织）”，强调情感上的纠结；bivalent 更常用于“两个值/两种解释/两种化学价”。","常见搭配：bivalent reaction/response（两极反应）、bivalent meaning（双重含义）、bivalent ion/metal（化学二价离子/金属）。"]}
{"word":"bivalents","summary":{"en":"Bivalents are either paired homologous chromosomes in meiosis or things (especially ions) with valence 2.","zh":"bivalents 指减数分裂中的同源染色体“二价体”，或指化学中“二价（价态为2）的离子/元素”等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Genetics) pairs of homologous chromosomes that are joined together during meiosis I.","zh":"（遗传学）在减数分裂第一次分裂（meiosis I）中配对并结合在一起的一对同源染色体。"},"examples":[{"en":"During meiosis I, homologous chromosomes form bivalents before they separate.","zh":"在减数分裂Ⅰ中，同源染色体会先形成二价体，然后再分离。"},{"en":"Scientists observed several bivalents under the microscope to study crossing over.","zh":"科学家在显微镜下观察了多个二价体，以研究交叉互换。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) having a valence of two; able to form two chemical bonds (the plural form refers to such ions/elements).","zh":"（化学）二价的；化合价为2的；能形成两个化学键（复数形式可指这类离子/元素）。"},"examples":[{"en":"Calcium forms bivalent ions in many compounds.","zh":"钙在许多化合物中形成二价离子。"},{"en":"Bivalents like Mg2+ often react differently from monovalent ions like Na+.","zh":"像Mg2+这样的二价离子常常与像Na+这样的一价离子反应方式不同。"}]}],"synonyms":["divalents","paired homologous chromosomes","valence-2 ions"],"phonetic":"/baɪˈveɪlənts/","extraExplanation":["“bivalents”是“bivalent”的复数形式。遗传学里常译作“二价体”，强调“成对的同源染色体”；化学里常说“二价离子/二价金属”，更常用表达是“divalent (ion)”或直接写“2+（如Ca2+）”。"]}
{"word":"bivalve","summary":{"en":"A bivalve is a two-shelled animal like a clam or oyster; it can also describe things related to these two-part shells.","zh":"bivalve 指“有两片壳的双壳类动物”（如蛤蜊、牡蛎），也可作形容词表示“与双壳/双壳类相关”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an animal with a shell made of two hinged parts (two “valves”), such as a clam, mussel, oyster, or scallop","zh":"双壳类动物；有由两片可开合的壳（两“瓣/阀”）组成外壳的动物，如蛤蜊、贻贝、牡蛎、扇贝"},"examples":[{"en":"Oysters are bivalves that live in salt water.","zh":"牡蛎是生活在海水中的双壳类动物。"},{"en":"We found a bivalve shell on the beach with two matching halves.","zh":"我们在海滩上捡到一个双壳贝壳，两半正好配对。"}]},{"partOfSpeech":"adj.","definition":{"en":"having a shell with two hinged parts; relating to animals with two-part shells","zh":"双壳的；有两片可开合外壳的；与双壳类相关的"},"examples":[{"en":"Bivalve mollusks include clams and mussels.","zh":"双壳类软体动物包括蛤蜊和贻贝。"},{"en":"The museum has a display of bivalve fossils.","zh":"博物馆里有一个双壳类化石展柜。"}]}],"synonyms":["clam","mussel","oyster","scallop"],"phonetic":"/ˈbaɪvælv/","extraExplanation":["“bi-”表示“二/双”，来自拉丁语；“valve”原意是“门扇、阀门/瓣”，所以 bivalve 字面意思是“两扇门/两瓣”。","常见相关词：univalve（单壳的，如某些蜗牛壳）、mollusk/mollusc（软体动物；美式常用 mollusk）。"]}
{"word":"bivalved","summary":{"en":"Bivalved describes something with two hinged parts, especially a two-part shell like a clam’s.","zh":"bivalved 指“由两片可开合的瓣/壳组成的”，常用来形容蛤蜊等双壳结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two hinged parts (valves), especially describing shells like clams or other structures that open and close in two halves.","zh":"有两片可开合的“瓣/壳”（两阀）的，尤指像蛤蜊那样由两半壳组成、可合拢与张开的结构。"},"examples":[{"en":"A clam is a bivalved mollusk with two shells that close tightly.","zh":"蛤蜊是双壳类软体动物，有两片壳可以紧紧合拢。"},{"en":"The fossil shows a bivalved shell with clear hinge marks.","zh":"这块化石显示出一枚双壳贝的壳，铰合处的痕迹很清楚。"}]}],"synonyms":["two-valved","two-part","bivalve"],"phonetic":"/baɪˈvælvd/","extraExplanation":["“bivalved”常用于生物学、古生物学和地质学语境：bi- 表示“二”，valve 表示“瓣/阀/壳片”，合起来就是“有两瓣（两阀）结构的”。","不要和“bivalve（n. 双壳类动物/贝类）”混淆：bivalved 是形容词，用来描述某个壳或结构“是双壳的”。"]}
{"word":"bivalves","summary":{"en":"Bivalves are animals (mollusks) that have two hinged shells, like clams and oysters.","zh":"Bivalves 指有两片铰合贝壳的软体动物，如蛤蜊和牡蛎。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Mollusks with two hinged shells, such as clams, oysters, mussels, and scallops.","zh":"双壳类（软体动物）：有两片用铰链连接的贝壳的动物，例如蛤蜊、牡蛎、贻贝和扇贝。"},"examples":[{"en":"Oysters and clams are bivalves with two shells that close tightly.","zh":"牡蛎和蛤蜊是双壳类动物，它们有两片贝壳，可以紧紧合拢。"},{"en":"Many bivalves filter water for food, which helps keep the water cleaner.","zh":"许多双壳类通过过滤水来获取食物，这也有助于让水更干净。"}]}],"synonyms":["clams (general)","shellfish (broader)","mollusks (broader)"],"phonetic":"/ˈbaɪvælvz/","extraExplanation":["“bivalve”由 bi-（两个）+ valve（阀门/壳瓣）组成，字面意思是“两片壳瓣”。","在科学与环保语境中，双壳类常被提到是“滤食者”（filter feeders），能过滤水中的微小颗粒；牡蛎礁还常被用于海岸生态修复。"]}
{"word":"Bivalvia","summary":{"en":"Bivalvia is the scientific class of two-shelled mollusks such as clams, mussels, oysters, and scallops.","zh":"Bivalvia（双壳纲）是指具有两片壳的软体动物类群，如蛤蜊、贻贝、牡蛎和扇贝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a class of mollusks with a shell made of two hinged parts (valves), such as clams, mussels, oysters, and scallops","zh":"双壳纲：一类软体动物，外壳由两片可开合的壳瓣（像铰链一样连接）组成，例如蛤蜊、贻贝、牡蛎和扇贝"},"examples":[{"en":"Oysters and clams are members of Bivalvia.","zh":"牡蛎和蛤蜊属于双壳纲。"},{"en":"Many Bivalvia filter tiny particles from the water as they feed.","zh":"许多双壳纲动物通过滤食来从水中过滤微小颗粒。"},{"en":"The museum’s marine exhibit includes several Bivalvia fossils.","zh":"博物馆的海洋展区里有一些双壳纲化石。"}]}],"synonyms":["bivalves","bivalve mollusks","class Bivalvia"],"phonetic":"/baɪˈvælviə/","extraExplanation":["“Bivalvia”源自拉丁语：bi-（两、双）+ valva（门扇/壳瓣），字面意思是“有两片壳瓣的”。","在日常英语中，更常用具体动物名（clam, mussel, oyster, scallop）来表达；“Bivalvia”多见于生物学、生态学或古生物学语境。"]}
{"word":"bivalvia","summary":{"en":"Bivalvia is the scientific class name for two-shelled mollusks like clams, oysters, and mussels.","zh":"Bivalvia 是“双壳纲”的科学名称，指有两片壳的软体动物，如蛤蜊、牡蛎和贻贝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a class of mollusks with a shell made of two hinged parts (valves), such as clams, mussels, oysters, and scallops","zh":"双壳纲：一类软体动物，外壳由两片可开合的壳瓣（通过铰合处连接）组成，如蛤蜊、贻贝、牡蛎和扇贝"},"examples":[{"en":"Oysters and mussels belong to Bivalvia.","zh":"牡蛎和贻贝属于双壳纲。"},{"en":"The lab studied Bivalvia to understand how filter feeders clean water.","zh":"实验室研究双壳纲动物，以了解滤食性动物如何净化水体。"}]}],"synonyms":["bivalves","Pelecypoda"],"phonetic":"/baɪˈvælviə/","extraExplanation":["“Bivalvia”是生物分类学名称（通常大写），在写作中常与“class（纲）”一起出现：the class Bivalvia。","词源来自拉丁语：bi-（二）+ valva（壳瓣/门），字面意思是“有两扇壳的”。","双壳纲常见特征包括：两片壳、通常没有明显的头部、很多种类通过鳃滤食；其中一些（如牡蛎）在生态与经济上都很重要。"]}
{"word":"bivalvian","summary":{"en":"Bivalvian means “having two hinged shell parts” or “a bivalve animal,” like a clam or oyster.","zh":"bivalvian 指“有两片铰接贝壳的（双壳类的）”，也可指“双壳类动物”，如蛤蜊或牡蛎。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an animal, especially a mollusk) having a shell in two hinged parts; related to bivalves such as clams, oysters, and mussels.","zh":"（指动物，尤指软体动物）有两片用铰链连接的贝壳；与双壳类（如蛤蜊、牡蛎、贻贝）有关。"},"examples":[{"en":"Clams are bivalvian mollusks with two shells that close tightly.","zh":"蛤蜊是双壳类软体动物，有两片贝壳，可以紧紧合拢。"},{"en":"The museum displayed bivalvian fossils from an ancient seabed.","zh":"博物馆展出了来自古代海床的双壳类化石。"}]},{"partOfSpeech":"n.","definition":{"en":"A bivalve animal (a member of the class Bivalvia).","zh":"双壳类动物（双壳纲的成员）。"},"examples":[{"en":"This tide pool has several bivalvians living under the rocks.","zh":"这个潮池的岩石下生活着几种双壳类动物。"},{"en":"The biologist compared bivalvians and snails to explain different shell types.","zh":"生物学家比较了双壳类和蜗牛，以解释不同的贝壳类型。"}]}],"synonyms":["bivalve","two-shelled"],"phonetic":"/baɪˈvælviən/","extraExplanation":["“bivalvian”来自拉丁语词根 bi-（二）+ valva（门扇/壳片），字面意思是“有两扇门（两片壳）的”。","在日常英语里更常见的是名词/形容词“bivalve”。“bivalvian”更偏学术或科普写作，用来强调“属于双壳类/与双壳类相关”。"]}
{"word":"bivalvous","summary":{"en":"Bivalvous means “having two valves/shell halves,” like clams and other bivalves.","zh":"bivalvous 指“有两片壳瓣/阀瓣的（双壳的）”，如蛤蜊等双壳类。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Having two hinged parts (valves), like a clam shell; two-valved.","zh":"（少见）有两个铰接的壳瓣/阀瓣的；双壳的。"},"examples":[{"en":"A clam has a bivalvous shell that opens and closes.","zh":"蛤蜊有双壳的外壳，会开合。"},{"en":"The fossil showed a bivalvous structure, suggesting it lived like a mollusk.","zh":"这块化石呈现双壳结构，暗示它的生活方式类似软体动物。"}]}],"synonyms":["bivalved","two-valved","bivalve (common form)"],"phonetic":"/baɪˈvælvəs/","extraExplanation":["“bivalvous”是较少见的形式，更常用的是形容词/名词“bivalve”。两者都来自拉丁语前缀bi-（二、双）+ valva（门扇、阀、壳瓣），常用于生物学语境（如双壳类：蛤蜊、牡蛎、贻贝等）。","拼写提示：如果你想表达“属于双壳类动物/双壳的”，通常写作“bivalve”。“bivalvous”多见于较老的或更书面/技术性的写法。"]}
{"word":"bivalvular","summary":{"en":"Bivalvular means “having two valves/shell parts” or “involving two heart valves.”","zh":"bivalvular 意为“有两个瓣/阀（两片壳）”或“涉及两个心脏瓣膜的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology, anatomy) Having two valves or two shell parts that open and close, like the shells of clams; involving two heart valves.","zh":"（生物/解剖）具有两个“瓣/阀”的；由两片壳（两瓣）组成并可开合的（如蛤蜊）；或与心脏的两个瓣膜相关的。"},"examples":[{"en":"Clams and oysters are bivalvular animals with two shells joined by a hinge.","zh":"蛤蜊和牡蛎是双壳类动物，有两片壳通过铰链连接。"},{"en":"The doctor noted bivalvular disease affecting the mitral and aortic valves.","zh":"医生指出存在累及二尖瓣和主动脉瓣的双瓣膜疾病。"}]}],"synonyms":["bivalved","two-valved","bivalve"],"phonetic":"/baɪˈvælvjələr/","extraExplanation":["“bivalvular”由 bi-（两个）+ valvular（瓣膜的/阀门的）构成。日常英语里更常见的是生物学名词 bivalve（双壳类）或形容词 bivalved / bivalve；“bivalvular”在医学语境中也可指“累及两个心脏瓣膜”。"]}
{"word":"bivane","summary":{"en":"“Bivane” isn’t standard English; it likely refers to “bivouac,” meaning a temporary outdoor camp or to camp with minimal shelter.","zh":"“bivane”不是标准英语，很可能指 “bivouac”，意思是临时露营地，或以简易方式露营/露宿。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “bivouac” (a temporary camp, especially used by soldiers or hikers).","zh":"不是标准英语单词。它很可能是 “bivouac” 的拼写错误（指临时营地，尤指士兵或徒步者的露营点）。"},"examples":[{"en":"I couldn’t find “bivane” in an English dictionary—did you mean “bivouac”?","zh":"我在英语词典里找不到 “bivane”——你是不是想写 “bivouac”？"},{"en":"After a long hike, we made a small bivouac near the river.","zh":"长途徒步后，我们在河边搭了一个小小的临时营地。"}]},{"partOfSpeech":"n.","definition":{"en":"bivouac: a temporary camp without tents or with very simple shelter.","zh":"bivouac：临时营地（可能不搭帐篷，或只用很简易的遮蔽）。"},"examples":[{"en":"The soldiers slept in a bivouac overnight.","zh":"士兵们在临时营地里过夜。"},{"en":"We bivouacked under the stars because the weather was clear.","zh":"因为天气晴朗，我们在星空下露宿。"}]},{"partOfSpeech":"v.","definition":{"en":"bivouac: to stay or camp outdoors for the night, usually with minimal shelter.","zh":"bivouac：露营/露宿（通常遮蔽很少）。"},"examples":[{"en":"They bivouacked on the mountain before reaching the summit.","zh":"他们在到达山顶前在山上露宿了一晚。"}]}],"synonyms":["camp","encampment","temporary camp","overnight stop"],"phonetic":"/ˈbɪvuˌæk/","extraExplanation":["“bivouac”常用于军事或户外语境，语气比一般的“camp”更强调“临时、简易、可能无帐篷”的露宿方式。徒步/登山圈里也常说“bivy”(bivouac 的口语缩写)，指轻量化露营或“睡袋+防潮垫+简易外罩”的过夜方式。"]}
{"word":"bivariant","summary":{"en":"Bivariant means “having two variants,” and in math/CS it often means a relation that can vary in both directions (neither strictly covariant nor contravariant).","zh":"Bivariant 指“有两种变体/形式”；在数学与计算机科学中常指可在两个方向上变化的关系（既非严格协变也非严格逆变）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having two variants (two different forms or versions)","zh":"有两种变体的；有两种形式/版本的"},"examples":[{"en":"The museum displayed a bivariant design: one version for summer and one for winter.","zh":"博物馆展示了一种“双变体”设计：夏季一个版本，冬季一个版本。"},{"en":"Some species show bivariant coloration, changing between two common patterns.","zh":"有些物种呈现两种常见花纹的双变体色彩。"}]},{"partOfSpeech":"adj.","definition":{"en":"(math / computer science) able to vary in both directions in a relationship; not strictly ‘covariant’ or ‘contravariant’","zh":"（数学/计算机科学）在关系中可向两个方向变化的；既不严格协变也不严格逆变的（双变）"},"examples":[{"en":"In some type systems, a method parameter may be treated as bivariant for convenience.","zh":"在某些类型系统中，为了方便，方法参数可能被当作“双变”来处理。"},{"en":"The library’s generic interface is bivariant in practice, so it accepts a wider range of types.","zh":"该库的泛型接口在实践中是双变的，因此能接受更广泛的类型。"}]}],"synonyms":["two-form","dual-form","twofold","(CS) bidirectional (context-dependent)"],"phonetic":"/baɪˈvɛriənt/","extraExplanation":["“bivariant”常见于编程语言的“类型变型（variance）”话题：\n- 协变（covariant）：类型参数随子类型关系“同方向”变化。\n- 逆变（contravariant）：随子类型关系“反方向”变化。\n- 双变（bivariant）：两种方向都允许，往往更灵活，但可能牺牲一部分类型安全（不同语言/场景限制不同）。"]}
{"word":"bivariate","summary":{"en":"Bivariate means involving two variables, especially in statistics when analyzing their relationship.","zh":"Bivariate 指“涉及两个变量的”，常用于统计中分析两个变量之间的关系。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Involving or relating to two variables (two measurable quantities) at the same time, often to study how they are connected.","zh":"涉及两个变量（两个可测量量）的；常用于研究两个量之间的关系。"},"examples":[{"en":"A bivariate analysis can show whether height and weight are related.","zh":"双变量分析可以显示身高和体重是否相关。"},{"en":"The plot is bivariate because it compares two variables: time and temperature.","zh":"这张图是双变量的，因为它比较了两个变量：时间和温度。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Statistics) Describing data, a distribution, or a model that includes two variables jointly.","zh":"（统计）描述包含两个变量的联合数据、分布或模型的。"},"examples":[{"en":"They used a bivariate normal distribution to model the two test scores together.","zh":"他们用二维（双变量）正态分布来联合建模两个测试分数。"},{"en":"The bivariate regression examines how one variable changes with another.","zh":"双变量回归考察一个变量如何随另一个变量变化。"}]}],"synonyms":["two-variable","dual-variable","two-dimensional (in some contexts)"],"phonetic":"/baɪˈvɛriət/","extraExplanation":["“bi-”表示“二、双”（如 bicycle 自行车、bilingual 双语），而“variate”与“variable（变量）”同源，所以 bivariate 直观含义就是“涉及两个变量”。","学习时可与 multivariate（多变量）对比：bivariate 只看两个变量之间的关系；multivariate 通常同时考虑三个或以上变量。"]}
{"word":"bivascular","summary":{"en":"Bivascular means “having two blood vessels” or “having two vascular supplies/systems,” mainly used in medical or biological contexts.","zh":"Bivascular 指“具有两条血管”或“具有双重血管供血/两套血管系统”，多见于医学或生物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having two blood vessels, or involving two separate vascular (blood-vessel) systems or supplies","zh":"具有两条血管的；涉及两套血管（供血）系统或双重血管供应的"},"examples":[{"en":"The surgeon noted a bivascular supply to the tissue.","zh":"外科医生指出该组织具有双重血管供血。"},{"en":"In the report, the lesion was described as bivascular on imaging.","zh":"报告中称该病灶在影像学上呈现双重血管供血特征。"}]},{"partOfSpeech":"adj.","definition":{"en":"(biology/botany) having two vascular bundles or two main vascular strands","zh":"（生物/植物）具有两条维管束或两条主要维管结构的"},"examples":[{"en":"Some species show a bivascular arrangement in the leaf structure.","zh":"某些物种在叶片结构中呈现双维管的排列方式。"}]}],"synonyms":["double-supplied","dual vascular","two-vessel"],"phonetic":"/baɪˈvæskjələr/","extraExplanation":["该词较少见，多用于医学或生物学写作中。词根很好拆：bi- 表示“二、双”，vascular 表示“血管的/维管的”。在临床语境里，常用来强调“有两条血管”或“有两套供血来源”，例如讨论组织供血、移植皮瓣、影像学血供特点等。"]}
{"word":"bivaulted","summary":{"en":"“Bivaulted” means “double-vaulted”: built or shaped with two vaults/arches, especially in architecture.","zh":"bivaulted 表示“双拱顶的”：尤其在建筑语境中，指由两个拱顶/两道拱形结构构成。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having two vaults (two arched ceilings/roofs), or shaped with a pair of vault-like arches","zh":"有两个拱顶的；双拱形的（指天花板/屋顶等呈两道拱形）"},"examples":[{"en":"The church’s bivaulted ceiling created a strong sense of symmetry.","zh":"教堂的双拱顶天花板营造出强烈的对称感。"},{"en":"They restored a bivaulted corridor with stone ribs and old plaster.","zh":"他们修复了一条带石肋和旧灰泥的双拱形走廊。"}]}],"synonyms":["double-vaulted","twin-vaulted","two-vaulted"],"phonetic":"/baɪˈvɔl.tɪd/","extraExplanation":["这是一个很少见的词，多用于建筑或描写性文字。结构上是 bi-（“两、双”）+ vaulted（“有拱顶的”）。","vault 在建筑里常指“拱顶/穹顶式的顶棚”，而 vaulted 形容“做成拱顶的”。因此 bivaulted 通常强调“有两个拱/两道拱顶”，常见于描述教堂、回廊、地窖等空间。"]}
{"word":"bivector","summary":{"en":"A bivector is a mathematical object representing an oriented plane (an oriented area), often written as a wedge product of two vectors (a ∧ b).","zh":"双向量是一种表示“带定向的平面/面积”的数学对象，常写作两个向量的楔积（a ∧ b）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Mathematics/physics) A quantity that represents an oriented plane segment (a 2‑dimensional direction and magnitude), often written as the wedge (exterior) product of two vectors, such as a ∧ b.","zh":"（数学/物理）表示“有方向的平面量”（二维的方向与大小）的量，常写作两个向量的楔积/外积，如 a ∧ b。"},"examples":[{"en":"In geometric algebra, the wedge product a ∧ b is a bivector representing the plane spanned by a and b.","zh":"在几何代数中，楔积 a ∧ b 是一个双向量，表示由 a 和 b 张成的平面。"},{"en":"The direction of the bivector encodes the plane’s orientation (clockwise vs. counterclockwise).","zh":"双向量的方向编码了该平面的定向（顺时针还是逆时针）。"}]},{"partOfSpeech":"n.","definition":{"en":"More generally, a grade‑2 element in geometric algebra (or an antisymmetric rank‑2 object), closely related to 2‑forms and the idea of “area with orientation.”","zh":"更一般地说，（几何代数中的）二阶（grade‑2）元素，或与反对称的二阶对象相近；与 2‑形式密切相关，可理解为“带定向的面积”。"},"examples":[{"en":"In 3D, a bivector can be related to a normal vector, but it is not exactly the same thing.","zh":"在三维中，双向量可以与一个法向量建立对应关系，但它们并不完全相同。"},{"en":"Electromagnetism can be expressed using bivectors (or 2-forms) to describe fields compactly.","zh":"电磁学中可以用双向量（或 2‑形式）更简洁地描述场。"}]}],"synonyms":["2-vector","grade-2 element"],"phonetic":"/baɪˈvɛktər/","extraExplanation":["词形拆解：bi- 表示“二/双”，vector 表示“向量”，合起来就是“二向量/双向量”。","与常见的 cross product（叉积）区别：在三维里，叉积常把“有向面积”用一个垂直的向量来表示；而在几何代数里，这个“有向面积”更自然的对象就是 bivector（它直接表示所在的平面与定向）。","如果你学过线性代数：bivector 常与“外积/楔积”联系在一起；在微分形式里也与 2-form 的概念对应。"]}
{"word":"biveined","summary":{"en":"Biveined means “having two main veins,” mainly used in botanical or biological descriptions.","zh":"biveined 意为“具有两条主脉的”，主要用于植物学或生物学的描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having two main veins (especially used to describe leaves or wings in biology/botany)","zh":"具两条主脉的；双脉的（多用于植物学/生物学，描述叶片或翅等的脉络）"},"examples":[{"en":"The field guide describes the plant’s leaves as biveined and narrow.","zh":"野外图鉴把这种植物的叶子描述为双脉且狭长。"},{"en":"Look for a biveined pattern near the base of the leaf.","zh":"观察叶基部附近是否有双脉的纹理。"}]}],"synonyms":["two-veined","double-veined"],"phonetic":"/baɪˈveɪnd/","extraExplanation":["这是一个较少见、偏专业的形容词，常见于植物学描述里；“bi-”表示“二、双”，“veined”指“有叶脉/纹理”。日常英语里更常写成 two-veined，或用更具体的叶脉类型（如 parallel-veined 平行脉、net-veined 网状脉）来表达。"]}
{"word":"biventer","summary":{"en":"Biventer refers to a two-bellied muscle (or the two-bellied form), mainly used in anatomy.","zh":"biventer 指“二腹的/二腹肌”，主要用于解剖学中描述具有两个肌腹的肌肉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy) A muscle (or part of a muscle) that has two bellies—two thick, fleshy sections—usually connected by an intermediate tendon.","zh":"（解剖）二腹肌；指具有两个“肌腹”（两段较厚的肌肉部分）的肌肉（或肌肉的一部分），通常由中间腱连接。"},"examples":[{"en":"The digastric muscle is a classic example of a biventer muscle.","zh":"二腹肌（digastric muscle）是典型的二腹型肌肉例子。"},{"en":"The surgeon identified the biventer structure before cutting the intermediate tendon.","zh":"外科医生在切开中间腱之前先辨认出二腹型结构。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having two bellies; two-bellied (used mainly in anatomical descriptions).","zh":"二腹的；具有两个肌腹的（多用于解剖学描述）。"},"examples":[{"en":"Some textbooks describe this as a biventer muscle.","zh":"一些教材把这种肌肉描述为二腹肌。"},{"en":"The posterior belly and anterior belly make it a biventer form.","zh":"后腹和前腹使它呈二腹型。"}]}],"synonyms":["digastric","two-bellied"],"phonetic":"/baɪˈvɛntər/","extraExplanation":["词源来自拉丁语：bi-（二、双）+ venter（腹、肚子）。在解剖学里“belly（肌腹）”不是指胃或肚子，而是指肌肉中较厚、可收缩的部分。","常见相关术语：digastric（二腹的/二腹肌，临床更常见的说法）；intermediate tendon（中间腱）。"]}
{"word":"biventral","summary":{"en":"Biventral is a rare scientific adjective meaning “having two ventral (belly-side) surfaces/regions.”","zh":"Biventral 是较少见的科学用语，表示“具有两个腹侧（腹面）表面/区域的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology/Anatomy) Having two ventral (“belly-side”) surfaces, or relating to two ventral regions.","zh":"（生物/解剖）具有两个腹侧（“肚子一侧”）表面，或与两个腹侧区域有关。"},"examples":[{"en":"In some anatomical descriptions, a structure may be called biventral if it shows two distinct ventral surfaces.","zh":"在一些解剖学描述中，如果某个结构呈现两个明显的腹侧表面，可能会被称为 biventral。"},{"en":"The paper used biventral to describe how the organ’s underside was divided into two ventral areas.","zh":"论文用 biventral 来描述该器官的下侧如何被分成两个腹侧区域。"}]}],"synonyms":["double-ventral","two-ventral-sided"],"phonetic":"/baɪˈvɛntrəl/","extraExplanation":["biventral 是一个非常少见、偏学术的形容词，常见于生物学/解剖学语境。词根 bi- 表示“二、双”，ventral 表示“腹侧（belly-side）”。在实际阅读中，如果你看到它，通常是在描述形态结构的“腹侧”部分出现了“两处/两面”的特征。","学习相关概念时，可以对照：ventral（腹侧） vs. dorsal（背侧）。很多教材更常用 dorsiventral / dorsoventral（背腹方向的、背腹两侧不同的）。如果你想表达“两个心室相关的”，英语里更常见的是 biventricular。"]}
{"word":"biverb","summary":{"en":"“Biverb” is not a standard English word; it’s probably a typo (often for “verb” or “bivouac”).","zh":"“biverb”不是标准英语单词；多半是拼写错误（常见是“verb”或“bivouac”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a made-up form (for example, someone may have meant “bivouac” or “verb”).","zh":"不是标准英语单词，可能是拼写错误或临时造词（例如原本想写“bivouac（露营/野营）”或“verb（动词）”）。"},"examples":[{"en":"I can’t find “biverb” in a dictionary—did you mean “verb” or “bivouac”?","zh":"我在词典里找不到“biverb”——你是不是想写“verb”或“bivouac”？"},{"en":"Please check the spelling of “biverb” in your notes.","zh":"请检查你笔记里“biverb”的拼写。"}]}],"synonyms":["(no standard synonyms; check intended word)"],"phonetic":"/ˈbaɪvɝb/","extraExplanation":["“biverb”常见于拼写错误或笔误。最可能的目标词之一是 **bivouac**（/ˈbɪvuˌæk/），意思是“（尤指军队或徒步者）在野外临时宿营”。如果你告诉我它出现的句子或场景（课堂语法？军旅/露营语境？），我可以帮你准确锁定你想查的词。"]}
{"word":"biverbal","summary":{"en":"Biverbal describes a linguistic structure that uses two verbs in one construction.","zh":"biverbal 指语言学中的“双动词”结构：一个结构里用到两个动词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Linguistics) Having or involving two verbs, especially in a single clause or construction.","zh":"（语言学）含有或涉及两个动词的，尤指在同一个分句或结构中出现两个动词。"},"examples":[{"en":"In some languages, biverbal constructions are common in everyday speech.","zh":"在一些语言中，双动词结构在日常口语里很常见。"},{"en":"The author analyzes a biverbal pattern where one verb expresses motion and the other expresses purpose.","zh":"作者分析了一种双动词模式：一个动词表示移动，另一个动词表示目的。"}]}],"synonyms":["two-verb","double-verb","serial-verb (context-dependent)"],"phonetic":"/baɪˈvɝbəl/","extraExplanation":["“biverbal”不是日常英语里常见的词，更多见于语言学论文或语法描写中，用来概括“两个动词一起构成一个结构”的现象。","常见相关话题包括：连动结构（serial verb constructions）、双动词谓语（two-verb predicate）、以及某些语言里用两个动词表达一个完整事件（如“去 买”=go buy 的语义组合）。","如果你本来想查的是“bilingual / bilingualism / verb / verbal”等更常用词，也可能是拼写或用词上的误差；你可以告诉我你看到它的句子，我能帮你判断具体意思。"]}
{"word":"bivial","summary":{"en":"Bivial is a rare adjective meaning “having two paths/branches” or, historically, “related to the medieval bivium.”","zh":"Bivial 是个较罕见的形容词，表示“有两条路/两处分支的”，或（历史用法）“与中世纪的二科（bivium）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having two ways, branches, or paths; relating to a place where two roads meet (a fork in the road).","zh":"有两条道路/分支的；与“两路交会处”（岔路口）有关的。"},"examples":[{"en":"At the bivial point, we had to choose between the river path and the hill path.","zh":"在那个两路分岔处，我们必须在河边小路和山路之间做选择。"},{"en":"The map marks a bivial junction near the old bridge.","zh":"地图在老桥附近标出了一个两路交汇的路口。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare, historical) relating to the “bivium,” the two-part advanced course of study in medieval education (arithmetic and music).","zh":"（罕见，历史用法）与中世纪教育中的“二科”（bivium）有关，指算术与音乐这两门。"},"examples":[{"en":"Some texts mention bivial studies before moving on to more specialized learning.","zh":"一些文献提到在进入更专门的学习前，会先进行与“二科”相关的学习。"}]}],"synonyms":["two-way","branched","divided","forked","bifurcated"],"phonetic":"/ˈbaɪviəl/","extraExplanation":["“bivial”来自拉丁语词根 bi-（二）+ via（道路）。因此它的核心意象是“两条路”。在英语里它非常少见，更常见的表达是 “a fork in the road / a two-way junction”。","中世纪自由七艺常被分为 trivium（文法、修辞、逻辑）与 quadrivium（算术、几何、音乐、天文）。有时也会看到把其中两门并称为 “bivium” 的说法，因此出现 “bivial” 这种历史性形容词。","很多学习者会把 “bivial” 误写成 “trivial”（琐碎的、不重要的）。两者拼写相近，但意思完全不同。"]}
{"word":"Bivins","summary":{"en":"Bivins is most commonly a surname, and it can also be a place name in the U.S.","zh":"Bivins 最常见是姓氏，也可作美国的一些地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname)","zh":"姓氏（家族姓）"},"examples":[{"en":"Ms. Bivins will lead today’s meeting.","zh":"Bivins 女士将主持今天的会议。"},{"en":"My teacher’s last name is Bivins.","zh":"我老师的姓是 Bivins。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name (used for some locations, especially in the U.S.)","zh":"地名（用于一些地点名称，尤指美国）"},"examples":[{"en":"They drove through Bivins on the way to Texarkana.","zh":"他们去德克萨卡纳的路上开车经过了 Bivins。"},{"en":"Bivins is a small community, so services may be limited.","zh":"Bivins 是个小社区，所以服务可能比较有限。"}]}],"phonetic":"/ˈbɪvɪnz/","extraExplanation":["“Bivins”最常见是英语世界里的姓氏（last name）。在美国也可能作为地名出现（例如德州/阿肯色一带的社区名），具体含义通常来自人名或当地历史。","作为专有名词（人名/地名）时，一般首字母大写：Bivins。发音在不同家庭或地区可能略有差异，但常见读法如本条所示。"]}
{"word":"bivinyl","summary":{"en":"“Bivinyl” means having (or being) a compound with two vinyl groups, mainly used in chemistry/materials contexts.","zh":"“bivinyl”主要用于化学/材料语境，指含有两个乙烯基的（或这种化合物）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having or containing two vinyl groups (—CH=CH2), usually in chemistry or materials science","zh":"（化学/材料领域）含有两个乙烯基（—CH=CH2）的；双乙烯基的"},"examples":[{"en":"The molecule is described as bivinyl because it has two vinyl groups that can react.","zh":"这种分子被称为 bivinyl，因为它有两个可以发生反应的乙烯基。"},{"en":"Bivinyl monomers often polymerize to form cross-linked plastics.","zh":"双乙烯基单体常常会聚合，形成交联塑料。"}]},{"partOfSpeech":"n.","definition":{"en":"a compound that contains two vinyl groups","zh":"含有两个乙烯基的化合物；双乙烯基化合物"},"examples":[{"en":"Chemists selected a bivinyl to increase the number of bonding sites in the resin.","zh":"化学家选用一种双乙烯基化合物，以增加树脂中的成键位点。"}]}],"synonyms":["divinyl","di(vinyl)-","vinyl-substituted"],"phonetic":"/baɪˈvaɪnəl/","extraExplanation":["“bivinyl”在日常英语中很少见，更常见的相关词是“divinyl（双乙烯基的）”。在化学命名中，bi- 与 di- 都有“二/双”的含义，但实际使用频率与具体学科传统有关。","乙烯基（vinyl）常与聚合反应相关：当一个分子带有两个乙烯基时，往往更容易形成交联结构，因此在树脂、涂料与高分子材料语境中会出现。"]}
{"word":"bivinyls","summary":{"en":"“Bivinyls” means compounds containing two vinyl groups, mainly used in chemistry/materials contexts.","zh":"“Bivinyls”指含有两个乙烯基的化合物，主要用于化学/材料学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of bivinyl: chemical compounds or materials that contain two vinyl groups (–CH=CH2), often used as building blocks in polymer and materials chemistry.","zh":"bivinyl 的复数：含有两个乙烯基（–CH=CH2）的化合物或材料，常用于聚合物与材料化学中的合成与改性。"},"examples":[{"en":"Researchers tested several bivinyls to see which one polymerized most efficiently.","zh":"研究人员测试了几种 bivinyls，看看哪一种聚合效率最高。"},{"en":"Bivinyls can act as cross-linking units in certain polymer networks.","zh":"在某些聚合物网络中，bivinyls 可以作为交联单元。"}]}],"synonyms":["divinyls","dienes (sometimes, depending on structure)"],"phonetic":"/baɪˈvaɪnəlz/","extraExplanation":["这是一个偏专业的化学用词，日常英语里很少见。更常见的相关词是 divinyl（含两个乙烯基的），例如 divinylbenzene（“二乙烯基苯”，常用于树脂交联）。","在化学语境中，vinyl（乙烯基）指 –CH=CH2 这一官能团；“bi-”表示“两个”。不同文献可能更偏好用 di-（两个）而不是 bi-。"]}
{"word":"bivious","summary":{"en":"“Bivious” is not a standard English word; it’s likely a misspelling (often of “obvious” or sometimes “dubious”).","zh":"“bivious”不是标准英语单词；多半是拼写错误（常见是“obvious”，有时是“dubious”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is usually a misspelling or typing error.","zh":"不是标准英语单词；通常是拼写或输入错误。"},"examples":[{"en":"I think you meant “obvious,” not “bivious.”","zh":"我猜你想写的是“obvious”，而不是“bivious”。"},{"en":"This word doesn’t appear in most dictionaries; try checking the spelling.","zh":"这个词在大多数词典里查不到；建议检查拼写。"}]}],"phonetic":"/ˈbɪviəs/","extraExplanation":["“bivious”最常见的可能是把 **obvious**（明显的）拼错了（少了开头的 o），也有人可能本来想写 **dubious**（可疑的/不确定的）。","如果你告诉我句子原文（你想表达的意思），我可以帮你判断你想用的是 obvious 还是 dubious，并给出更贴切的用法与例句。"]}
{"word":"bivittate","summary":{"en":"Bivittate means “marked with two stripes or bands,” mainly used in biological descriptions.","zh":"bivittate 指“带有两条条纹/带状斑纹的”，主要用于生物学（尤其动物学）描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology, especially zoology) Having two longitudinal stripes or bands (often used to describe insects, reptiles, or other animals with two distinct markings).","zh":"（生物学，尤指动物学）具有两条纵向条纹或带状斑纹的（常用于描述昆虫、爬行动物等有两条明显纹路的动物）。"},"examples":[{"en":"The specimen was described as bivittate, with two pale stripes running down its back.","zh":"该标本被描述为bivittate，背部有两条浅色条纹向下延伸。"},{"en":"A bivittate beetle can be identified by the pair of dark bands on its wing covers.","zh":"bivittate甲虫可通过鞘翅上的一对深色带纹来辨认。"}]}],"synonyms":["two-striped","two-banded","bistriped","bifasciate (closely related, more ‘banded’ than ‘striped’)"],"phonetic":"/baɪˈvɪteɪt/","extraExplanation":["这是一个偏“学术/分类描述”用词，常见于动物学、昆虫学的物种描述（field guide、taxonomy papers）。","词源上由拉丁语前缀 bi-（二、双）+ vitta（带子、条带）构成；因此字面意思就是“有两条带纹的”。"]}
{"word":"bivium","summary":{"en":"Bivium means a fork where a path splits into two, or figuratively a moment of choosing between two options.","zh":"bivium指道路分成两条的岔路口，也可比喻必须在两个选项之间作抉择的时刻。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fork in a road; a place where one path divides into two","zh":"岔路口；道路分成两条路的地方"},"examples":[{"en":"At the bivium, we stopped to check the map before choosing a direction.","zh":"在岔路口，我们停下来查看地图再决定方向。"},{"en":"A small sign stood at the bivium, pointing toward the village and the river.","zh":"岔路口立着一块小路牌，分别指向村庄和河边。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) a situation where you must choose between two different paths, options, or ways of life","zh":"（比喻）人生或行动的两难抉择；必须在两条不同道路/选择中作决定的时刻"},"examples":[{"en":"Graduation felt like a bivium: take a job now or go to graduate school.","zh":"毕业像是一个两难路口：现在工作还是去读研。"},{"en":"The novel begins with the hero at a moral bivium, torn between duty and desire.","zh":"小说开头英雄站在道德的岔路口，在责任与欲望之间挣扎。"}]}],"synonyms":["fork (in the road)","junction","split","crossroads"],"phonetic":"/ˈbɪviəm/","extraExplanation":["“bivium”源自拉丁语：bi-（二）+ via（道路），字面意思是“由两条路组成的地方”。","它常与“trivium / quadrivium”一起被提到：中世纪教育中，trivium指“三艺”（语法、修辞、逻辑），quadrivium指“四艺”（算术、几何、音乐、天文）。虽然“bivium”不像这两个词那样常见，但同样体现了拉丁词根在英语学术词汇中的影响。"]}
{"word":"bivocal","summary":{"en":"Bivocal means “two-voiced”—either literally involving two voices, or (more commonly) expressing two viewpoints/tones at once.","zh":"bivocal 指“双声的”：可以是字面上的两种声音/两个声部，也更常指在表达中同时呈现两种立场或语气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two voices, or expressing two voices or viewpoints; capable of being heard as two voices at once.","zh":"（文学/语言中）具有“双声”的；表达两种声音或立场的；仿佛能同时听到两种声音的。"},"examples":[{"en":"The novel’s narrator feels bivocal, speaking both as a child and as an adult looking back.","zh":"这部小说的叙述者带有“双声”效果，既像孩子在说话，也像成年后回望的自己在说话。"},{"en":"Her poem is bivocal: it celebrates tradition while quietly questioning it.","zh":"她的诗呈现“双声”：一方面歌颂传统，另一方面又含蓄地质疑它。"}]},{"partOfSpeech":"adj.","definition":{"en":"Sung or performed by two voices; involving two vocal parts (less common).","zh":"（较少见）由两个人声演唱/表演的；包含两个声部的。"},"examples":[{"en":"They arranged the melody as a bivocal duet for the choir concert.","zh":"他们把旋律改编成双人声二重唱，用于合唱音乐会。"}]}],"synonyms":["two-voiced","dual-voiced","ambivalent (context-dependent)","double-voiced"],"phonetic":"/baɪˈvoʊkəl/","extraExplanation":["“bivocal”来自前缀 bi-（二、双）+ vocal（声音的）。在文学与批评中，它常用来描述一种“同时存在两种声音/立场”的表达效果，类似于说话者既在参与又在保持距离，或同一句话里既有表层意思也有隐含态度。"]}
{"word":"bivocalized","summary":{"en":"Bivocalized means “two-voiced”: produced with two distinct vocal sounds, or (in linguistic writing) described as having two vowel sounds.","zh":"bivocalized 意为“双声的/双声化的”：用两种不同的声音发出；或（语言学中）被描述为包含两个元音音的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Pronounced or sung with two distinct voices or vocal qualities; having a “two-voiced” sound.","zh":"以两种不同的嗓音/声部发声或演唱的；呈现“双声”的声音特征。"},"examples":[{"en":"In the chorus, the singer uses a bivocalized style, mixing a breathy tone with a clear, bright voice.","zh":"在副歌里，歌手用一种双声式唱法，把气声和清亮的声音混在一起。"},{"en":"The recording is deliberately bivocalized to make the character sound both human and mechanical.","zh":"这段录音刻意做成“双声化”，让角色听起来既有人味又像机器。"}]},{"partOfSpeech":"adj.","definition":{"en":"Marked or analyzed as having two vowel sounds (used in some linguistic or scholarly descriptions).","zh":"（语言学/学术用法）被标注或分析为包含两个元音音（双元音/双元音化等）的。"},"examples":[{"en":"Some scholars describe the sequence as bivocalized rather than a single long vowel.","zh":"有些学者把这个音序描述为“双元音化”，而不是一个单纯的长元音。"},{"en":"In the manuscript notes, several forms are labeled bivocalized for teaching pronunciation.","zh":"在手稿注释里，有几个形式被标成“双元音化”，用来教学发音。"}]}],"synonyms":["two-voiced","dual-voiced","two-part","diphthongized","double-voiced"],"phonetic":"/baɪˈvoʊkəˌlaɪzd/","extraExplanation":["“bivocalized”来自 bi-（“二、双”）+ vocal（“声音的、发声的”）+ -ized（“……化/被……处理过”）。它不是日常高频词，更常见于音乐评论（描述两种声部/两种音色）或语言学讨论（描述两个元音音值/双元音现象）。","更常见的表达包括：two-voiced, two-part, dual-voiced, with two vocal registers；语言学语境也可能用 diphthongized（双元音化）来替代。"]}
{"word":"bivoltine","summary":{"en":"Bivoltine describes species that have two generations per year.","zh":"bivoltine 指一年繁殖两代的物种（尤其常用于昆虫）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an insect or other organism) producing two generations in one year.","zh":"（指昆虫或其他生物）一年繁殖两代的；一年有两代生活史的。"},"examples":[{"en":"In warm climates, this moth can be bivoltine, producing two broods each year.","zh":"在温暖气候下，这种飞蛾可能是一年两代的，每年繁殖两次。"},{"en":"Farmers monitor bivoltine pests carefully because population numbers can rise quickly.","zh":"农民会密切监测一年两代的害虫，因为种群数量可能增长很快。"}]}],"synonyms":["two-brooded","two-generation"],"phonetic":"/baɪˈvoʊltaɪn/","extraExplanation":["bivoltine 常用于生态学、昆虫学与农业害虫管理。voltinism（年世代数）里常见的对比词有：univoltine（一年一代）、multivoltine（一年多代）。","词源上 bi- 表示“两”，-voltine 与“轮次/世代”有关。在农业语境中，说某害虫是 bivoltine，往往意味着一年会出现两次明显的高峰期（两次成虫或幼虫暴发）。"]}
{"word":"bivoltinism","summary":{"en":"Bivoltinism means producing two generations in a year.","zh":"bivoltinism 指生物一年内繁殖两代的特性（二化性）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The ability of an organism (especially an insect) to produce two generations in one year.","zh":"（生物，尤指昆虫）一年内繁殖两代的特性；二化性。"},"examples":[{"en":"In warm regions, some silkworm strains show bivoltinism, producing two broods each year.","zh":"在温暖地区，一些家蚕品系表现出二化性，每年产生两代。"},{"en":"Researchers compared bivoltinism and univoltinism to see how temperature affects breeding cycles.","zh":"研究人员比较了二化性与一化性，以了解温度如何影响繁殖周期。"}]}],"synonyms":["two-broodedness","two generations per year"],"phonetic":"/baɪˈvoʊltɪˌnɪzəm/","extraExplanation":["词源拆解：bi- 表示“二、两次”，volt- 来自拉丁语 *volta*（“转、轮回”之意的相关词根），-ism 表示“性质/主义”。合起来就是“一年出现两次（世代轮回）的特性”。","常见搭配/相关概念：univoltinism（一化性，一年一代）、multivoltinism（多化性，一年多代）、voltinism（化性：一年内世代次数）。这些词常用于昆虫学、农业害虫管理与养蚕等语境。","语境提示：它描述的是“每年几代”的生命周期策略，往往与气候（温度、日照）、食物资源、越冬方式等生态因素相关。"]}
{"word":"bivoluminous","summary":{"en":"“Bivoluminous” means “two-volume,” describing a work published in two parts/books.","zh":"“bivoluminous”意为“两卷本的”，指作品分为两册/两部分出版。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two volumes; consisting of two separate books or parts (a two-volume work).","zh":"有两卷的；由两册（或两部分）组成的（两卷本作品）。"},"examples":[{"en":"The biography was published as a bivoluminous set.","zh":"这部传记以两卷本（两册一套）的形式出版。"},{"en":"She bought a bivoluminous history of the city for her research.","zh":"她为研究买了一套两卷本的城市史。"}]}],"synonyms":["two-volume","in two volumes"],"phonetic":"/ˌbaɪvəˈluːmənəs/","extraExplanation":["这是一个比较少见、偏书面/学术的词，常见表达通常会用更直白的 two-volume 或 in two volumes。","词源上可理解为前缀 bi-（“二、两”）+ volume（“卷；册”）+ 形容词后缀 -ous（“……的”），整体就是“有两卷的”。在图书出版语境里最常用。"]}
{"word":"bivouac","summary":{"en":"A bivouac is a simple temporary camp, or the act of camping with little shelter.","zh":"bivouac 指简易的临时营地，或指在野外缺乏遮蔽的临时露营/露宿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a temporary camp (often without tents or with very simple shelter), especially used by soldiers, hikers, or climbers","zh":"（尤指士兵、徒步者或登山者的）临时露营地；简易营地（常无帐篷或仅有简易遮蔽）"},"examples":[{"en":"The hikers made a bivouac near the river for the night.","zh":"徒步者们在河边搭了个简易营地过夜。"},{"en":"The soldiers set up a bivouac before dawn.","zh":"士兵们在天亮前建立了临时营地。"}]},{"partOfSpeech":"v.","definition":{"en":"to camp outdoors temporarily, often with little or no shelter","zh":"（在野外）临时露营；简易露宿（常只有很少或没有遮蔽）"},"examples":[{"en":"We bivouacked on a narrow ledge when the storm hit.","zh":"暴风雨来袭时，我们在狭窄的岩架上临时露宿。"},{"en":"They decided to bivouac rather than hike in the dark.","zh":"他们决定临时露营，而不是摸黑继续走。"}]}],"synonyms":["camp","encamp","make camp","temporary camp"],"phonetic":"/ˈbɪv.uˌæk/","extraExplanation":["“bivouac”常出现在军事或登山语境里，强调“临时、简易”的露营方式；在登山中也常说“bivy / bivvy”（口语缩略），指“露宿包/简易露宿”。","词源来自法语 bivouac，常让人联想到军队在野外临时扎营的画面，因此在文学或报道中带有一点“艰苦、应急”的氛围。"]}
{"word":"bivouaced","summary":{"en":"“Bivouacked” means stayed overnight in the open or in a simple temporary camp.","zh":"“bivouacked” 指在露天或简易临时营地中过夜、露营（多用于军队或户外活动）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “bivouac”: to stay (usually temporarily) in the open air or in a very simple shelter, especially soldiers or hikers.","zh":"“bivouac”的过去式/过去分词：在露天或非常简陋的临时住所中过夜（常指士兵或徒步者临时宿营）。"},"examples":[{"en":"The hikers bivouacked near the river because it got too dark to keep walking.","zh":"天太黑无法继续走了，徒步者就在河边露宿了一夜。"},{"en":"The troops bivouacked on the hillside before moving out at dawn.","zh":"部队在山坡上临时宿营，天一亮就出发。"}]}],"synonyms":["camped","slept rough","encamped"],"phonetic":"/ˈbɪvʊˌækt/","extraExplanation":["你输入的 “bivouaced” 常见于拼写错误；更标准的拼写是 **bivouacked**（英式/美式都常用）。动词以 -ac 结尾时，常在加 -ed 前把 k 补上：bivouac → bivouacked。","“bivouac” 源自法语，常用于军事或户外语境，强调“非正式、临时、条件简陋”的宿营。"]}
{"word":"bivouacked","summary":{"en":"“Bivouacked” means camped outdoors temporarily (often with little shelter), or temporarily stationed a group outdoors.","zh":"“bivouacked”指在户外临时露宿/扎营（常几乎无庇护），也可指让一群人（尤指部队）在野外临时驻扎。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(past tense/past participle of “bivouac”) to stay or camp outdoors for a short time, often with little or no shelter (commonly used for soldiers, hikers, or climbers).","zh":"（bivouac 的过去式/过去分词）在户外短暂停宿或扎营，通常几乎没有遮蔽（常用于士兵、徒步者或登山者）。"},"examples":[{"en":"The hikers bivouacked near the lake when the trail became too dangerous to continue.","zh":"小队徒步者在湖边临时露营，因为小径太危险，无法继续前进。"},{"en":"They bivouacked under the stars, using their backpacks as pillows.","zh":"他们在星空下露宿，用背包当枕头。"}]},{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle) to place or keep a group (especially troops) in a temporary outdoor camp.","zh":"（过去式/过去分词）使一群人（尤指部队）在野外临时扎营或驻扎。"},"examples":[{"en":"The commander bivouacked the unit on higher ground for the night.","zh":"指挥官让部队在较高处宿营过夜。"}]}],"synonyms":["camped","encamped","slept out","made camp","quartered (troops)"],"phonetic":"/ˈbɪv.uˌæk(t)/","extraExplanation":["“bivouac”源自法语，原本多用于军事语境，指部队在野外临时宿营（通常不搭帐篷或设施简陋）。现代英语中也常用于登山/徒步场景：比如“to bivouac”表示在山壁、雪地或路途中临时过夜。写作里它常带有“艰苦、临时、就地”的氛围。"]}
{"word":"bivouacking","summary":{"en":"“Bivouacking” means camping or staying overnight outdoors in a temporary, minimal shelter.","zh":"“bivouacking”指在户外临时、简易地露营/露宿过夜。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"camping outdoors for a short time, usually with minimal shelter (the present participle of “bivouac”).","zh":"（bivouac 的现在分词）在户外临时露营、就地宿营，通常只有很简易的遮蔽。"},"examples":[{"en":"The hikers are bivouacking near the ridge tonight because the weather changed suddenly.","zh":"天气突然变化，徒步者们今晚在山脊附近临时露营。"},{"en":"We ended up bivouacking under a tarp to stay dry.","zh":"我们最后只能在防水布下面搭个简易营地避雨。"}]},{"partOfSpeech":"vi.","definition":{"en":"staying overnight in a temporary camp, especially in military or mountaineering contexts.","zh":"（尤指军事或登山语境）在临时营地过夜、露宿。"},"examples":[{"en":"The soldiers spent the night bivouacking outside the town.","zh":"士兵们在城外露宿了一夜。"},{"en":"After the long climb, bivouacking was safer than descending in the dark.","zh":"长时间攀登后，天黑下撤更危险，露宿反而更安全。"}]}],"synonyms":["camping","roughing it","sleeping out","making camp"],"phonetic":"/ˈbɪv.uˌæk.ɪŋ/","extraExplanation":["“bivouac / bivouacking”常见于军事写作和户外登山语境，强调“临时、简易、就地”的露营方式，通常不像“camping”那样设备齐全。","词源来自法语 bivouac，历史上与军队野外宿营有关；现代也常用于描述登山者在山上临时过夜（有时甚至没有帐篷）。"]}
{"word":"bivouacks","summary":{"en":"Bivouacks are temporary outdoor camps; to bivouack means to camp out temporarily, often overnight.","zh":"bivouacks 指临时野外营地；to bivouack 指临时在野外露营（常过夜）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"temporary camps (often without tents or in simple shelters), especially for soldiers or people outdoors","zh":"（常指军队或户外活动者的）临时营地；露营地（往往没有帐篷或只有简易遮蔽）"},"examples":[{"en":"The hikers set up bivouacks near the river for the night.","zh":"徒步者们在河边搭起临时营地过夜。"},{"en":"The troops slept in bivouacks before the early-morning march.","zh":"部队在清晨行军前睡在临时营地里。"}]},{"partOfSpeech":"v.","definition":{"en":"to stay or camp outdoors in a temporary shelter, often for one night","zh":"（在野外）临时露营；宿营（通常过一夜）"},"examples":[{"en":"We bivouacked on a ridge to avoid the flooded valley.","zh":"我们在山脊上临时露营，以避开被淹的山谷。"},{"en":"They bivouacked under a tarp when the weather turned cold.","zh":"天气转冷时，他们在防水布下临时扎营。"}]}],"synonyms":["camps","encampments","makeshift camps","campsites","pitch camp"],"phonetic":"/ˈbɪv.uˌæk/","extraExplanation":["“bivouack”常见于军事和登山/徒步语境，强调“临时、简易、就地过夜”，比一般的“camp”更有“权宜之计/野外过夜”的感觉。","词形上：单数 bivouack，复数 bivouacks；动词现在分词 bivouacking。拼写里虽然有“oua”，但常读作接近“BIV-oo-ak”。"]}
{"word":"bivouacs","summary":{"en":"“Bivouacs” are temporary camps (especially for soldiers or hikers); it can also mean staying overnight in such a camp.","zh":"“bivouacs”指（军人或徒步者的）临时营地；也可作动词，表示在这种临时营地露营过夜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"temporary camps (often simple shelters or tents), especially used by soldiers or hikers","zh":"（尤指军人或徒步者的）临时营地；露营地（常为简易帐篷或就地搭建的遮蔽处）"},"examples":[{"en":"The troops set up bivouacs along the river before dawn.","zh":"部队在黎明前沿河搭起了临时营地。"},{"en":"After a long hike, we made bivouacs under the trees to rest for the night.","zh":"长途徒步后，我们在树下搭了临时营地过夜休息。"}]},{"partOfSpeech":"v.","definition":{"en":"to stay outdoors for the night in a temporary camp","zh":"（在野外）露营；在临时营地过夜"},"examples":[{"en":"They bivouacked on the mountain ridge when the weather turned bad.","zh":"天气变差时，他们就在山脊上露营过夜。"},{"en":"If the trail is longer than expected, we may have to bivouac before reaching the cabin.","zh":"如果路线比预期更长，我们可能得在到达小屋前先露营过夜。"}]}],"synonyms":["camps","encampments","campsites","temporary shelters","bed down (informal)"],"phonetic":"ˈbɪvˌwæk","extraExplanation":["“bivouac”常与军事或户外探险语境搭配，强调“临时、简易、就地”的扎营方式，不一定有完善营地设施。","词源来自法语 bivouac，历史上多用于描述军队在野外短期驻扎。文学与新闻中也常用来营造紧张、艰苦或临时应对的氛围（如战地、救援、登山等场景）。"]}
{"word":"bivvy","summary":{"en":"“Bivvy” means a very light outdoor sleeping shelter (or the act of sleeping in one), common in hiking and climbing contexts.","zh":"“bivvy”指轻便的户外露宿装备（或用它露宿这件事），常见于徒步与登山语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a light shelter (a bivouac sack or small tent) used for sleeping outdoors, especially by hikers and climbers","zh":"（尤指徒步者、登山者用的）轻便露宿 shelter；常指“睡袋外罩/简易露宿袋”或小型帐篷"},"examples":[{"en":"We carried a bivvy in case the weather turned bad.","zh":"我们带了一个 bivvy，以防天气变坏。"},{"en":"He slept in a bivvy on the ridge overnight.","zh":"他在山脊上用 bivvy 露宿了一晚。"}]},{"partOfSpeech":"v.","definition":{"en":"to sleep outdoors in a bivvy or in a very simple shelter","zh":"用简易露宿装备在户外过夜；露宿"},"examples":[{"en":"If the trail takes longer, we can bivvy near the lake.","zh":"如果路程比预期久，我们可以在湖边露宿。"}]}],"synonyms":["bivouac","bivy","bivy sack"],"phonetic":"/ˈbɪvi/","extraExplanation":["“bivvy”是英式英语里很常见的拼写（美式也能理解但较少见），来自“bivouac”（露营、露宿）。在户外圈里，bivvy常特指“bivy sack/bivouac sack”（防风雨的睡袋外罩），比帐篷更轻便，但舒适度和空间更有限。","搭配很常见：a bivvy bag（露宿袋）、to bivvy up（找地方将就露宿）、emergency bivvy（应急露宿装备）。"]}
{"word":"bivy","summary":{"en":"Bivy means a simple outdoor sleeping shelter or the act of sleeping outside with minimal gear.","zh":"Bivy指野外简易露宿用的遮蔽/装备，也可指以极简装备在户外过夜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, simple shelter (often a lightweight tent or waterproof bag) used for sleeping outdoors, especially by hikers or climbers","zh":"（尤指徒步者或登山者用的）简易露宿帐篷/睡袋式防水露宿袋；野外简易宿营点"},"examples":[{"en":"We carried a bivy to stay light on the climb.","zh":"我们带了一个bivy（简易露宿装备），这样攀登时能更轻便。"},{"en":"He spent the night in a bivy near the ridge.","zh":"他在山脊附近用bivy过了一夜。"}]},{"partOfSpeech":"v.","definition":{"en":"to sleep outdoors in a bivy; to camp in a very simple way","zh":"用bivy露宿；进行非常简易的野营/宿营"},"examples":[{"en":"If the weather holds, we’ll bivy on the summit.","zh":"如果天气稳定，我们就会在山顶bivy（露宿）。"},{"en":"They bivied under a rock overhang to avoid the wind.","zh":"他们在岩石凸出处下面bivy，以躲避大风。"}]}],"synonyms":["bivouac","camp (informal)","sleep out"],"phonetic":"/ˈbɪvi/","extraExplanation":["“bivy”是“bivouac”的口语缩写，在北美户外圈很常见。它通常指“超轻量、临时、没有太多舒适设施”的过夜方式，强调机动性而不是舒适度。","在登山语境里，bivy常带一点“临时被迫过夜”的意味（例如天黑或天气突变），但也可以是计划中的轻量露宿。"]}

