{"word":"biw","summary":{"en":"“BIW” most commonly means “body-in-white” in automotive manufacturing: the welded car body before painting and assembly.","zh":"“BIW”最常见的意思是汽车制造中的“白车身”：焊接完成但尚未喷漆和装配的车身结构。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(acronym, automotive) “Body-in-white”: the stage of a car body after the metal parts are welded together, but before painting, interior parts, and final assembly.","zh":"（缩写，汽车制造）“白车身”：指车身金属结构焊接完成后的阶段，但尚未喷漆、装配内饰和进行最终总装。"},"examples":[{"en":"Engineers checked the BIW for weld quality before moving to the paint shop.","zh":"工程师在进入涂装车间前检查白车身的焊接质量。"},{"en":"Reducing BIW weight can improve fuel efficiency.","zh":"降低白车身重量有助于提升燃油效率。"}]},{"partOfSpeech":"other","definition":{"en":"(acronym, general) Used in some industries/companies as an internal abbreviation; meaning depends on the context.","zh":"（缩写，通用）在某些行业或公司内部用作缩写；具体含义取决于语境。"},"examples":[{"en":"In this document, BIW is defined in the glossary on page 2.","zh":"在这份文件中，BIW 的含义在第2页的术语表里有说明。"}]}],"synonyms":["body-in-white","car body shell"],"phonetic":"/bi aɪ ˈdʌbəl.ju/","extraExplanation":["“Body-in-white（白车身）”是汽车工程里非常常见的术语，强调的是车身结构件（如侧围、车顶、地板等）的焊接/粘接与结构完整性。这个阶段通常会做尺寸测量、焊点检测、刚度与碰撞相关的评估，然后才进入涂装（paint）与总装（final assembly）。","如果你想表达网络用语“顺便说一下”，更常见的是 BTW（by the way），不是 BIW。"]}
{"word":"biwa","summary":{"en":"Biwa usually means a traditional Japanese lute; it can also refer to Lake Biwa in Japan.","zh":"biwa 通常指日本传统弹拨乐器“琵琶”；也可指日本的“琵琶湖”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Japanese short-necked lute (plucked string instrument), often used in classical and folk music","zh":"琵琶（日本传统短颈弹拨乐器，常用于古典与民间音乐）"},"examples":[{"en":"The musician played the biwa with a large plectrum, producing sharp, percussive sounds.","zh":"乐手用一把大的拨片弹奏琵琶，发出清脆而带打击感的声音。"},{"en":"In the performance, the biwa accompanied a storyteller.","zh":"在表演中，琵琶为说书人伴奏。"},{"en":"She is learning biwa to explore traditional Japanese music.","zh":"她正在学习琵琶，以了解日本传统音乐。"}]},{"partOfSpeech":"n.","definition":{"en":"Lake Biwa, the largest freshwater lake in Japan, located in Shiga Prefecture","zh":"琵琶湖（日本最大的淡水湖，位于滋贺县）"},"examples":[{"en":"They took a train trip to Lake Biwa for the weekend.","zh":"他们周末坐火车去琵琶湖旅行。"},{"en":"Lake Biwa is an important water source for the Kansai region.","zh":"琵琶湖是关西地区重要的水源。"}]}],"synonyms":["Japanese lute","Lake Biwa"],"phonetic":"/ˈbiːwə/","extraExplanation":["“biwa（琵琶）”在英语里多指日本乐器，外形与中国“琵琶”相近但结构与音色不同：日本琵琶常用较大的拨片，声音更短促、有颗粒感。","日本传统叙事表演中常出现“平家琵琶（Heike biwa）”，用于伴奏吟诵《平家物语》等故事，因此它在日本文化里也常与“说唱叙事/史诗讲述”联系在一起。","“Lake Biwa（琵琶湖）”的英文写法常带“Lake”，若只写“Biwa”在语境不清时更容易被理解为乐器。"]}
{"word":"Biwabik","summary":{"en":"Biwabik is a place name—most commonly a city in northeastern Minnesota (and also a nearby lake).","zh":"Biwabik 是一个地名：最常指美国明尼苏达州东北部的一座城市（也可指附近的 Biwabik Lake）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small city in northeastern Minnesota, USA, located on the Mesabi Iron Range.","zh":"美国明尼苏达州东北部的一座小城市，位于梅萨比铁矿带（Mesabi Iron Range）。"},"examples":[{"en":"Biwabik is known for its mining history on Minnesota’s Iron Range.","zh":"Biwabik 以明尼苏达州铁矿带的采矿历史而闻名。"},{"en":"We drove from Duluth to Biwabik for a weekend trip.","zh":"我们从德卢斯开车去 Biwabik 过周末。"}]},{"partOfSpeech":"n.","definition":{"en":"Biwabik Lake, a lake near the city of Biwabik in Minnesota.","zh":"Biwabik Lake：位于明尼苏达州 Biwabik 附近的一座湖。"},"examples":[{"en":"They went fishing on Biwabik Lake in the summer.","zh":"他们夏天去 Biwabik Lake 钓鱼。"}]}],"synonyms":["Biwabik, Minnesota","Biwabik Lake"],"phonetic":"/ˈbɪwəˌbɪk/","extraExplanation":["“Biwabik”常被认为源自奥吉布瓦语（Ojibwe/Chippewa）地名用法；很多明尼苏达地名都来自当地原住民语言。拼写固定，但在口语里有时会出现轻微读音差异。","Biwabik 所在区域属于“铁矿带”文化圈：历史上以铁矿开采、工人社区与移民文化（如芬兰、意大利、斯洛文尼亚等后裔）闻名。了解这一背景有助于读懂当地新闻、旅行介绍或历史写作中的相关表达。"]}
{"word":"biweeklies","summary":{"en":"“Biweeklies” is the plural of “biweekly,” usually meaning publications or regular events/payments that happen every two weeks.","zh":"“biweeklies”是“biweekly”的复数，通常指每两周出版的刊物，或每两周一次的固定活动/发薪等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Publications (such as magazines or newspapers) that come out every two weeks.","zh":"（复数名词）双周刊：每两周出版一次的刊物（如杂志、报纸）。"},"examples":[{"en":"I subscribed to several biweeklies about science and health.","zh":"我订阅了几份关于科学和健康的双周刊。"},{"en":"Local biweeklies often cover community news in more detail than big newspapers.","zh":"本地双周刊通常比大型报纸更详细地报道社区新闻。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural noun, informal) Regular payments or events that happen every two weeks (often paychecks or meetings).","zh":"（复数名词，非正式）每两周一次的发薪/活动（常指工资或会议等）。"},"examples":[{"en":"My biweeklies hit my account on Fridays.","zh":"我每两周一次的工资会在周五到账。"},{"en":"We schedule biweeklies to keep the project on track.","zh":"我们安排每两周一次的例会，确保项目按计划推进。"}]}],"synonyms":["fortnightlies","every-two-week publications","biweekly magazines"],"phonetic":"/baɪˈwiːkli/","extraExplanation":["“biweekly”在英语里有歧义：既可能表示“每两周一次”，也可能表示“每周两次”。在出版物、工资（paycheck）等语境中，通常更常见的是“每两周一次”。如果要避免误会，可以说“every two weeks”（每两周）或“twice a week”（每周两次）。"]}
{"word":"biweekly","summary":{"en":"Biweekly can mean either every two weeks or twice a week; context decides.","zh":"Biweekly 既可指“每两周一次”，也可指“每周两次”，需看上下文。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening every two weeks (once every two weeks).","zh":"每两周一次（隔周一次）。"},"examples":[{"en":"We have a biweekly meeting on Fridays.","zh":"我们每两周在周五开一次会。"},{"en":"She gets paid biweekly.","zh":"她每两周领一次工资。"}]},{"partOfSpeech":"adj.","definition":{"en":"Happening twice a week.","zh":"每周两次。"},"examples":[{"en":"The class is biweekly, on Tuesdays and Thursdays.","zh":"这门课每周两次，在周二和周四上。"},{"en":"They publish biweekly during the busy season.","zh":"在旺季他们每周出版两次。"}]},{"partOfSpeech":"n.","definition":{"en":"A publication that comes out every two weeks (or sometimes twice a week, depending on the context).","zh":"双周刊（通常指每两周出版一次；也可能指每周两次，视语境而定）。"},"examples":[{"en":"I read a local biweekly for community news.","zh":"我读一份本地双周刊了解社区新闻。"}]}],"synonyms":["every two weeks","twice a week","fortnightly (every two weeks)"],"phonetic":"/baɪˈwiːkli/","extraExplanation":["“biweekly”最容易让人困惑，因为它既可能是“每两周一次”，也可能是“每周两次”。在日常与职场里（如发薪、会议）更常见的是“每两周一次”。如果需要避免歧义，可以说：every two weeks（每两周一次）或 twice a week（每周两次）。","词源上，bi- 表示“二/双”，但在时间频率里经常产生两种解读；类似的还有 “bimonthly”（每两个月一次/每月两次）。"]}
{"word":"biwinter","summary":{"en":"Biwinter is a rare adjective meaning either “lasting through two winters / having experienced two winters” or “happening every other winter.”","zh":"biwinter 是一个罕见形容词，可指“持续/经历两个冬天的”，也可指“每隔一个冬天发生一次的（隔年冬）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) lasting through two winters; having experienced two winters.","zh":"（罕见）持续两个冬天的；经历过两个冬天的。"},"examples":[{"en":"The young vine is biwinter and strong enough to survive the cold.","zh":"这株幼藤已过两个冬天，结实到足以熬过严寒。"},{"en":"They kept the biwinter seedlings in a sheltered garden bed.","zh":"他们把过了两个冬天的幼苗留在避风的苗床里。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) happening every two winters; occurring in alternate winters.","zh":"（罕见）每隔一个冬天发生一次的；每两年一冬发生的。"},"examples":[{"en":"Some local festivals were described as biwinter events in old records.","zh":"一些地方节庆在旧记录中被描述为“每隔一冬举办一次”的活动。"},{"en":"The tradition returned in biwinter cycles, not annually.","zh":"这个传统以隔年冬的周期回归，而不是每年都有。"}]}],"synonyms":["two-winter","alternate-winter","biennial (context-dependent)","every other winter (phrase)"],"phonetic":"ˌbaɪˈwɪntər","extraExplanation":["“bi-”在英语里有时表示“两个/两次”（two/twice），有时表示“每两……”（every two），因此“biwinter”容易产生歧义。这也是它很少用于现代日常英语的原因之一。","现代写作中更常用、更清楚的表达包括：lasting two winters（持续两个冬天）、having survived two winters（经历过两个冬天）、every other winter / in alternate winters（每隔一个冬天）。"]}

