{"word":"BIX","summary":{"en":"“BIX/Bix” is usually a name or an acronym; the exact meaning depends on context.","zh":"“BIX/Bix”通常是名字或首字母缩写；具体含义需要看上下文。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name or nickname (often spelled “Bix”)","zh":"男性名字或昵称（常写作“Bix”）"},"examples":[{"en":"His friends call him Bix at school.","zh":"在学校里朋友们叫他 Bix。"},{"en":"Bix is an uncommon name in English-speaking countries.","zh":"Bix 在英语国家里是不太常见的名字。"}]},{"partOfSpeech":"n.","definition":{"en":"an acronym used in different fields; its meaning depends on the context (for example, it can refer to a specific company, system, or organization)","zh":"在不同领域使用的首字母缩写；具体含义取决于语境（例如某个公司、系统或组织的名称）"},"examples":[{"en":"In this document, BIX refers to a data-sharing platform.","zh":"在这份文件中，BIX 指的是一个数据共享平台。"},{"en":"Could you tell me what BIX stands for in your report?","zh":"你能告诉我在你的报告里 BIX 代表什么吗？"}]}],"phonetic":"/bɪks/","extraExplanation":["“Bix”在英语文化中常让人联想到美国爵士乐手 Bix Beiderbecke（比克斯·拜德贝克，1903–1931），他是早期爵士史上很有影响力的短号（cornet）演奏家与作曲者之一。因此在音乐或传记语境里看到“Bix”，往往指他本人。","如果你是在某个特定场景（公司名、软件、课程、缩写表、产品型号等）里看到“BIX”，给我一整句话或相关行业，我可以帮你确定最准确的含义。"]}
{"word":"Bix","summary":{"en":"“Bix” is uncommon in everyday English. It’s most often a personal name (notably jazz musician Bix Beiderbecke) or a context-specific acronym.","zh":"“Bix”在日常英语中不常见，通常是人名（最著名的是爵士音乐家 Bix Beiderbecke）或在特定语境中的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A given name or nickname (uncommon). In English, “Bix” is best known as the name of the American jazz cornetist and composer Bix Beiderbecke (1903–1931).","zh":"一个不常见的英文名字/昵称。“Bix”最广为人知的用法是美国爵士短号手、作曲家 Bix Beiderbecke（1903–1931）的名字。"},"examples":[{"en":"I’ve been listening to Bix Beiderbecke’s recordings lately.","zh":"我最近在听 Bix Beiderbecke 的录音。"},{"en":"His friends call him Bix, but his full name is different.","zh":"朋友们叫他 Bix，但他的全名不一样。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation or acronym used in specific fields or brand names; the exact meaning depends on context (e.g., a product name, organization name, or ticker symbol).","zh":"在特定领域或品牌中使用的缩写/首字母缩略词；具体含义取决于语境（例如产品名、机构名或股票代码）。"},"examples":[{"en":"In this report, BIX refers to a company index—check the glossary for the exact definition.","zh":"在这份报告里，BIX 指的是一个公司指数——具体定义请查看术语表。"},{"en":"I saw “BIX” on the label, but it wasn’t explained anywhere.","zh":"我在标签上看到“BIX”，但哪里都没有解释。"}]}],"synonyms":["(as a name) nickname","(as an acronym) abbreviation"],"phonetic":"/bɪks/","extraExplanation":["“Bix”之所以在英语文化里最有辨识度，主要来自爵士乐史：Bix Beiderbecke 被视为早期爵士的重要人物之一，常与 1920 年代的美国爵士发展联系在一起。","如果你是在某篇文章、软件、金融页面或产品包装上看到 “BIX”，它很可能是特定领域的缩写；最可靠的方法是看同一页面/文件里的首次展开说明（例如“BIX = ……”）或术语表。"]}
{"word":"Bixa","summary":{"en":"Bixa is a tropical plant genus best known for Bixa orellana, whose seeds make annatto, a red-orange natural coloring.","zh":"Bixa 指红木属植物，最有名的是胭脂树（Bixa orellana），其种子可制成胭脂树红（annatto）等橙红色天然着色剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical plant (genus Bixa), especially Bixa orellana, whose seeds produce a red-orange dye and coloring used in food and cosmetics; the plant is also called annatto.","zh":"红木属（Bixa）的热带植物，尤指胭脂树（Bixa orellana）；其种子可制成橙红色的染料/着色剂，用于食品与化妆品中，也常被称为“胭脂树/红木（annatto）”。"},"examples":[{"en":"Annatto comes from the seeds of Bixa orellana.","zh":"胭脂树红（annatto）来自胭脂树（Bixa orellana）的种子。"},{"en":"In some recipes, Bixa-based coloring gives cheese a deeper orange color.","zh":"在一些食谱中，以Bixa（胭脂树）为来源的着色剂会让奶酪呈现更深的橙色。"}]}],"synonyms":["annatto","achiote","Bixa orellana"],"phonetic":"/ˈbɪk.sə/","extraExplanation":["“Bixa”是一个植物学属名（拉丁学名），英语里常见于配料表、植物百科或学术语境；日常对话中更常用“annatto（胭脂树红/胭脂树籽）”或在拉美语境中用“achiote（阿奇奥特）”。","胭脂树籽的主要用途是天然着色（如奶酪、黄油、米饭、腌料），味道通常较温和，带一点胡椒与泥土香；有的人会对胭脂树红过敏，配料表里常见标注为“annatto”。"]}
{"word":"bixa","summary":{"en":"“Bixa” is mainly Brazilian Portuguese slang. It can be a strong insult for a gay man, though it may also be used as “girl” among close friends in some contexts—use with great caution.","zh":"“bixa”主要是巴西葡语俚语：常见为对男同性恋的强烈侮辱性贬称；在部分语境也可能是熟人间的“姐妹/女孩”称呼。整体应非常谨慎使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Brazilian Portuguese slang, often offensive) a derogatory term for a gay man; similar in force to “f*g” in English.","zh":"（巴西葡语俚语，常带侮辱性）对男同性恋者的贬称；语气强烈，近似英语里的侮辱性词“f*g”。"},"examples":[{"en":"That word is offensive—please don’t use it to describe someone.","zh":"那个词很冒犯——请不要用它来形容别人。"},{"en":"In respectful English, say “gay man” or “LGBTQ+ person,” not slurs.","zh":"在尊重的英语表达里，应说“gay man（男同性恋者）”或“LGBTQ+ person”，不要用侮辱性词语。"}]},{"partOfSpeech":"n.","definition":{"en":"(Brazilian Portuguese, colloquial) “girl,” often used among women friends; this usage can still feel rude depending on tone and context.","zh":"（巴西葡语，口语）“女孩/姐妹”的称呼，常见于女性朋友之间；但语气和场合不当时仍可能显得粗鲁或冒犯。"},"examples":[{"en":"Among close friends, it can mean “girl,” but avoid it with strangers.","zh":"在很熟的朋友之间它可能相当于“girl”，但对陌生人最好避免使用。"},{"en":"If you’re not sure, use “amiga” (female friend) instead.","zh":"如果不确定，改用“amiga（女朋友/女性朋友）”更安全。"}]}],"synonyms":["(neutral English) gay man","(neutral English) LGBTQ+ person","(Portuguese) amiga (context-dependent)"],"phonetic":"/ˈbiʃə/","extraExplanation":["“bixa”（也常写作“bicha”）在巴西语境里有明显的社会与文化负载：既可能是带强烈侮辱性的恐同辱骂，也可能在特定群体内部被“重新挪用”成自称或朋友间的戏谑称呼。学习者通常不建议主动使用，以免造成冒犯。","如果你是在英文语境里看到它，往往是保留原语言的外来词（code-switching），不是标准英语词汇。遇到不确定的俚语，最稳妥做法是改用中性表达（如“gay man”“friend”）并留意对方偏好。"]}
{"word":"Bixa-like","summary":{"en":"“Bixa-like” means resembling *Bixa* (annatto) in appearance or reddish-orange color.","zh":"“Bixa-like”指外观或红橙色色泽类似胭脂树属（annatto/胭脂红）的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling the plant *Bixa* (especially *Bixa orellana*) or its seeds/dye (annatto), often implying a reddish-orange color or a similar botanical look.","zh":"像胭脂树属（*Bixa*，尤指胭脂树 *Bixa orellana*）或其种子/染料（胭脂红、annatto）的；常暗示红橙色的色泽或相似的植物外观。"},"examples":[{"en":"The researcher described the specimen’s fruit as Bixa-like, with a spiny capsule.","zh":"研究人员把该标本的果实描述为“类似胭脂树的”，呈带刺的蒴果。"},{"en":"They used a Bixa-like pigment to achieve a warm orange tint in the fabric.","zh":"他们用一种“类似胭脂红”的色素，让布料呈现温暖的橙色调。"}]}],"synonyms":["annatto-like","Bixa-type","Bixa-shaped","Bixa-colored"],"phonetic":"ˈbɪksə laɪk","extraExplanation":["“Bixa”最常指胭脂树属，尤其是胭脂树（*Bixa orellana*）。它的种子外层含有红橙色天然色素（annatto），常用于食品着色（例如部分奶酪、黄油、零食）与传统染色/化妆用途。","“Bixa-like”不是高频日常词，更常见于植物学描述、颜色/染料语境或学术写作中，用来表达“外形或色泽与胭脂树（或胭脂红色素）相近”。"]}
{"word":"Bixa-related","summary":{"en":"“Bixa-related” means related to the Bixa plant (especially Bixa orellana) or things made from it, like annatto.","zh":"“Bixa-related”指与红木属植物（尤其胭脂树）或其制品（如胭脂红）相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with the plant genus Bixa (especially Bixa orellana), or with products made from it (such as annatto color or seeds).","zh":"与红木属（Bixa，尤其是胭脂树 Bixa orellana）有关的；或与其制品（如胭脂红天然色素、种子等）有关的。"},"examples":[{"en":"Researchers tested several Bixa-related pigments used in natural food coloring.","zh":"研究人员测试了几种用于天然食用色素的胭脂树相关色素。"},{"en":"The report discusses Bixa-related compounds found in annatto seeds.","zh":"报告讨论了在胭脂树种子中发现的红木属相关化合物。"}]}],"synonyms":["Bixa-associated","Bixa-derived","annatto-related"],"phonetic":"/ˈbɪksə rɪˌleɪtɪd/","extraExplanation":["“Bixa”最常指红木属植物，其中最有名的是胭脂树（Bixa orellana）。它的种子常被用来制作天然橙红色的食用色素“annatto（胭脂红）”，在一些地区料理与传统文化中也很常见。","写作中“Bixa-related”多见于科研、食品配料、植物学或药用植物语境；日常英语里更常说“annatto-related（与胭脂红有关的）”或直接说“from annatto/Bixa orellana（来自胭脂树/胭脂红）”。"]}
{"word":"Bixaceae","summary":{"en":"Bixaceae is a plant family, especially known for the annatto (achiote) tree.","zh":"Bixaceae 指红木科（一类植物科），尤以胭脂树（安纳托树）闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of tropical flowering plants, best known for the achiote (annatto) tree, whose seeds are used to make a natural red-orange color and flavoring.","zh":"（植物）红木科：热带开花植物的一科，最有名的是胭脂树（又称安纳托树、红木树），其种子常用作天然橙红色的着色剂和调味料。"},"examples":[{"en":"Annatto comes from a plant in the family Bixaceae.","zh":"安纳托（胭脂红）来自红木科（Bixaceae）的一种植物。"},{"en":"In some tropical regions, Bixaceae species are valued for their dye-producing seeds.","zh":"在一些热带地区，红木科植物因可产出用于染色的种子而受到重视。"}]}],"synonyms":["annatto family"],"phonetic":"/bɪkˈseɪsiˌi/","extraExplanation":["“Bixaceae”是植物分类学里的科名，常见于植物百科、学术文章或植物园标牌中，日常英语里更常用“annatto family（安纳托/胭脂树科）”来解释。","与食物相关时，你可能更常看到“annatto（胭脂树籽/胭脂红）”，它常用于给奶酪、黄油、米饭等上色；在配料表里也可能出现。"]}
{"word":"bixaceae","summary":{"en":"Bixaceae is the botanical family (annatto family) that includes the annatto/achiote tree.","zh":"Bixaceae 指植物分类中的红木科（安纳托科），包括胭脂树等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of tropical flowering plants known as the annatto family, including the achiote/annatto tree (Bixa orellana).","zh":"红木科；一类热带开花植物的科名，以胭脂树（Bixa orellana，亦称阿奇奥特/安纳托树）等为代表。"},"examples":[{"en":"Bixa orellana, the source of annatto dye, belongs to the family Bixaceae.","zh":"胭脂树（Bixa orellana）是安纳托色素的来源，隶属于红木科（Bixaceae）。"},{"en":"In older classifications, some plants were placed in Bixaceae, but modern systems may group them differently.","zh":"在较早的分类体系中，一些植物被归入红木科（Bixaceae），但现代体系可能会有不同归类。"}]}],"synonyms":["annatto family"],"phonetic":"/bɪkˈseɪsiˌiː/","extraExplanation":["这是一个植物学“科名”（拉丁学名），常见于学术文章、植物志或博物馆标签中，日常英语里不常用。","与饮食相关时，大家更常说的是 annatto（安纳托/胭脂树籽色素）或 achiote（阿奇奥特），而不是科名 Bixaceae。"]}
{"word":"bixaceous","summary":{"en":"“Bixaceous” means “relating to or resembling the genus Bixa,” especially the annatto plant.","zh":"“bixaceous”意为“与红木属（Bixa）有关或相似的”，常指与胭脂树相关的植物学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to the plant genus Bixa (especially the annatto tree) or resembling it.","zh":"与红木属（Bixa，尤指胭脂树/红木树）有关的；或类似红木属植物的。"},"examples":[{"en":"Annatto comes from a bixaceous plant native to tropical America.","zh":"胭脂红（annatto）来自一种原产于热带美洲的红木属（bixaceous）植物。"},{"en":"The study compared bixaceous species with other tropical shrubs.","zh":"这项研究将红木属相关（bixaceous）的物种与其他热带灌木进行了比较。"}]}],"synonyms":["Bixa-related","annatto-related","Bixa-like"],"phonetic":"/bɪkˈseɪʃəs/","extraExplanation":["“bixaceous”是相对少见的学术/植物学用词，词根来自植物属名 Bixa（红木属），最常见的代表是胭脂树（Bixa orellana）。它的种子外层含有天然红橙色素，常用于食物上色（例如某些奶酪、黄油、拉美与加勒比料理）。","在现代英文里，你更常见到的是 “annatto (胭脂红/胭脂树色素)” 或具体的科名/属名用法；“bixaceous”多出现在较正式的分类或描述性文字中。"]}
{"word":"Bixby","summary":{"en":"Bixby most commonly refers to Samsung’s virtual assistant; it can also be a place name or a surname.","zh":"Bixby 最常指三星的虚拟语音助理；也可作地名或姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Samsung’s virtual assistant (a voice- and text-controlled AI helper) built into many Galaxy phones and other Samsung devices.","zh":"三星（Samsung）的虚拟语音助理（可用语音或文字控制的 AI 助手），内置于许多 Galaxy 手机和其他三星设备中。"},"examples":[{"en":"I asked Bixby to set an alarm for 7 a.m.","zh":"我让 Bixby 把闹钟设在早上七点。"},{"en":"Bixby can open apps and change settings on my phone.","zh":"Bixby 可以在我的手机上打开应用并更改设置。"}]},{"partOfSpeech":"n.","definition":{"en":"A proper name, especially a place name (e.g., Bixby, Oklahoma) or a family name.","zh":"专有名词，常见为地名（如美国俄克拉荷马州的 Bixby）或姓氏。"},"examples":[{"en":"She grew up in Bixby, Oklahoma.","zh":"她在俄克拉荷马州的 Bixby 长大。"},{"en":"Mr. Bixby will join the meeting later.","zh":"Bixby 先生稍后会加入会议。"}]}],"synonyms":["virtual assistant","voice assistant","AI assistant"],"phonetic":"/ˈbɪksbi/","extraExplanation":["Bixby 作为三星语音助理的名称，最常出现在手机功能里，比如“Bixby Voice / Bixby Routines”。有些机型曾有专门的 “Bixby 键”（实体按键），后来逐渐改为可自定义或取消。","作为专有名词时，发音一般保持不变；在英文句子里通常首字母大写（Bixby），不加冠词，除非指“the town of Bixby（Bixby 这个镇）”等特定表达。"]}
{"word":"bixbyite","summary":{"en":"Bixbyite is a manganese–iron oxide mineral found in some manganese ore deposits.","zh":"Bixbyite是一种锰-铁氧化物矿物，常见于部分锰矿矿床中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mineral (manganese iron oxide) found in some manganese ore deposits; it is an ore mineral and is related to the mineral group of manganese oxides.","zh":"一种矿物（锰-铁氧化物），常见于某些锰矿矿床中；可作为矿石矿物，属于与锰氧化物相关的一类矿物。"},"examples":[{"en":"The geologist identified black, metallic grains of bixbyite in the hand sample.","zh":"地质学家在手标本中辨认出呈黑色金属光泽的bixbyite颗粒。"},{"en":"Bixbyite can occur with other manganese oxide minerals in volcanic rocks and ore veins.","zh":"bixbyite可与其他锰氧化物矿物一起出现在火山岩或矿脉中。"}]}],"synonyms":["manganese iron oxide mineral"],"phonetic":"/ˈbɪks.bi.aɪt/","extraExplanation":["“bixbyite”是以人名（Bixby）命名的矿物名称，这类命名在矿物学中很常见，用来纪念发现者、研究者或与产地相关的人物。","矿物学语境里，它常被作为“锰氧化物矿物（manganese oxide mineral）”的一种来介绍；在阅读英文资料时，可留意同类词如“hausmannite（锰尖晶石）”“pyrolusite（二氧化锰）”等。"]}
{"word":"bixin","summary":{"en":"Bixin is a natural reddish-orange pigment from annatto seeds, used as a food coloring and dye.","zh":"Bixin 是来自胭脂树种子的天然橙红色色素，用作食用色素和染料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a reddish-orange natural pigment (a carotenoid) found in annatto seeds, used as a food coloring and dye","zh":"一种天然的橙红色色素（类胡萝卜素），来自胭脂树（annatto）的种子，用作食用色素和染料"},"examples":[{"en":"Bixin is often used to give cheese a deeper orange color.","zh":"Bixin 常用来让奶酪呈现更深的橙色。"},{"en":"The label lists bixin as a natural coloring agent.","zh":"标签上把 bixin 标为天然着色剂。"}]}],"synonyms":["annatto","annatto extract","natural food coloring"],"phonetic":"/ˈbɪksɪn/","extraExplanation":["bixin 主要存在于胭脂树（Bixa orellana）的种子外层，是“胭脂红/胭脂橙”色的重要来源之一。","在食品添加剂编号中，它常与“annatto（胭脂树色素）”相关联；在配料表里你也可能看到“annatto extract（胭脂树提取物）”。","日常语境里，人们更常说 annatto，而不是 bixin；bixin 更偏化学/配方标注用语。"]}
{"word":"Bixler","summary":{"en":"Bixler is most commonly a surname (family name).","zh":"Bixler 最常见的用法是作为姓氏（家族姓）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name), used to identify a person or family; it is not a common English vocabulary word with a standard dictionary meaning","zh":"一个姓氏（家族姓），用于指代某个人或家族；它不是常见英文词汇，通常没有固定的词典释义"},"examples":[{"en":"Ms. Bixler will speak at the meeting today.","zh":"比克斯勒女士今天将在会上发言。"},{"en":"I found an email from Jordan Bixler in my inbox.","zh":"我在收件箱里看到一封来自乔丹·比克斯勒的邮件。"}]}],"phonetic":"/ˈbɪkslər/","extraExplanation":["“Bixler”多见于英语国家的人名（姓）。在美国等地，一些姓氏来源于早期欧洲移民，常见于德语/宾夕法尼亚德语背景的家族（具体家族来源会因个人谱系而异）。","作为姓氏使用时，通常首字母大写：Bixler。发音上常读作“BIKS-ler”，重音在第一音节。"]}

