{"word":"biz","summary":{"en":"“Biz” is an informal short form of “business,” meaning business activity, a specific industry, or (in “showbiz”) the entertainment industry.","zh":"“biz”是“business”的非正式缩写，可指生意/商业活动、某个行业，也可在“showbiz”中指演艺圈/娱乐业。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Business; commercial activity or work.","zh":"（非正式）生意；商业活动；工作（商务/经营相关）。"},"examples":[{"en":"I’m in the restaurant biz now.","zh":"我现在做餐饮生意。"},{"en":"It’s a tough biz, but it can be rewarding.","zh":"这行很难，但也可能很有回报。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) A particular industry or line of work (often used with “the”).","zh":"（非正式）某个行业；某一行（常与 the 连用）。"},"examples":[{"en":"People in the film biz work long hours.","zh":"电影行业的人经常工作很久。"},{"en":"He’s been in the biz for ten years.","zh":"他在这行干了十年。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) Show business; the entertainment industry (often in “showbiz”).","zh":"（非正式）演艺圈；娱乐业（常写作 showbiz）。"},"examples":[{"en":"She’s trying to break into showbiz.","zh":"她正努力进入演艺圈。"},{"en":"Life in the biz isn’t always glamorous.","zh":"圈内生活并不总是光鲜亮丽。"}]}],"synonyms":["business","commerce","trade","industry","showbiz"],"phonetic":"/bɪz/","extraExplanation":["“biz”是“business”的口语缩写，常见于轻松对话、媒体标题或行业内自嘲式表达；正式写作（报告、论文、求职材料）通常用“business”。","常见搭配：“none of your biz.”=“不关你的事/少管闲事”（更礼貌可说“None of your business.”）；“in the biz”=“在这一行/业内”。","拼写提醒：“showbiz”常连写，也可写作“show biz”。"]}
{"word":"bizant","summary":{"en":"A bezant is a Byzantine gold coin, often mentioned in medieval history and literature.","zh":"bezant 指拜占庭金币，常见于中世纪历史与文学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a gold coin used in the Byzantine Empire; in medieval Europe, the word was also used for various coins modeled on it","zh":"拜占庭帝国使用的金币；在中世纪欧洲也可指仿制它的多种金币"},"examples":[{"en":"The merchant paid with a bag of bezants.","zh":"商人用一袋拜占庭金币付款。"},{"en":"In the novel, the knight is promised a hundred bezants as reward.","zh":"在小说里，那位骑士被许诺奖励一百枚拜占庭金币。"}]}],"synonyms":["gold coin","Byzantine coin"],"phonetic":"/ˈbɛzənt/","extraExplanation":["你输入的“bizant”在英语里更常见的拼写是 **bezant**（也写作 *byzant* 在某些旧文本中，但较少见）。它来自法语/拉丁语，最终与“Byzantium（拜占庭）”相关。","在英文历史小说或中世纪题材作品中，*bezant* 常用来营造时代感，类似于中文里说“金币/第纳尔”等带有历史气息的货币名称。"]}
{"word":"bizardite","summary":{"en":"“Bizardite” is not a standard English word; you probably mean “bizarre,” meaning very strange or unusual.","zh":"“bizardite”不是标准英语词；你很可能想写“bizarre”，意思是“非常奇怪/离奇的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended: “bizarre”) very strange, unusual, or hard to believe.","zh":"（很可能想写的是：bizarre）非常奇怪的；不同寻常的；令人难以置信的。"},"examples":[{"en":"We heard a bizarre noise coming from the basement.","zh":"我们听到地下室传来一种很诡异的声音。"},{"en":"It was a bizarre coincidence that we wore the same outfit.","zh":"我们穿了同样的衣服，这巧合得有点离谱。"},{"en":"The movie has a bizarre ending that surprised everyone.","zh":"这部电影的结局很离奇，让所有人都很惊讶。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) a “bizarre” can refer to a strange or unusual thing or situation.","zh":"（较少见）bizarre 也可作名词，指“怪事/怪现象”。"},"examples":[{"en":"The whole incident was a bizarre, but we moved on.","zh":"整件事挺怪的，但我们还是继续往前走了。"}]}],"synonyms":["strange","weird","odd","unusual","outlandish"],"phonetic":"/bɪˈzɑr/","extraExplanation":["“bizardite”不是常见的英语单词，更多情况下是把“bizarre”（奇怪的）拼错了。正确拼写是 b-i-z-a-r-r-e。","bizarre 源自法语，常用来形容“怪到出人意料”的事物；语气通常比 strange 更强，也比 weird 更偏“离奇/荒诞”。","近义词语感区别：strange（陌生/奇怪，较中性），weird（怪怪的，口语常用），bizarre（离奇、反常、让人难以理解）。"]}
{"word":"bizarre","summary":{"en":"Bizarre means extremely strange or unexpectedly unusual, sometimes in a shocking or surreal way.","zh":"Bizarre 指“非常怪、离奇、出人意料地不寻常”，常带有怪诞或震惊感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Very strange, unusual, or hard to understand (often in a surprising or shocking way).","zh":"非常奇怪的；异乎寻常的；令人难以理解的（常带有惊讶或震惊的感觉）。"},"examples":[{"en":"That’s a bizarre story—are you sure it’s true?","zh":"那故事也太离奇了吧——你确定是真的吗？"},{"en":"We saw a bizarre sculpture made of old shoes and broken mirrors.","zh":"我们看到一座由旧鞋子和碎镜子做成的怪诞雕塑。"}]},{"partOfSpeech":"adj.","definition":{"en":"Odd or eccentric in appearance, style, or behavior.","zh":"（外表、风格或行为）古怪的；怪异的；反常的。"},"examples":[{"en":"He showed up in a bizarre outfit that didn’t match at all.","zh":"他穿了一身非常怪的衣服来，完全不搭。"}]}],"synonyms":["weird","strange","odd","outlandish","eccentric"],"phonetic":"/bɪˈzɑr/","extraExplanation":["“bizarre”常用来表达“怪得出人意料”，语气通常比“strange”更强，也更带有“怪诞、离奇”的感觉；但它不一定是贬义，有时只是强调“不同寻常”。","词源来自法语“bizarre”（奇特的）。在英语文学或媒体里常用来渲染超现实、怪诞的氛围，例如形容“bizarre coincidence（离奇的巧合）”“bizarre twist（离奇转折）”。"]}
{"word":"bizarre clothing","summary":{"en":"Very strange or unusually noticeable clothes.","zh":"非常怪异或特别显眼的衣服。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Very unusual, strange, or eye-catching clothes that may seem odd to most people.","zh":"非常不寻常、怪异或引人注目的衣服（在多数人眼里可能显得很奇怪）。"},"examples":[{"en":"He showed up in bizarre clothing—neon pants and a cape.","zh":"他穿着怪异的衣服出现了——荧光裤子配一件披风。"},{"en":"Some people think it’s bizarre clothing, but she calls it art.","zh":"有些人觉得那是怪异的穿搭，但她称之为艺术。"},{"en":"The party encouraged guests to wear bizarre clothing.","zh":"派对鼓励来宾穿怪异服装。"}]}],"synonyms":["weird clothes","strange clothing","unusual outfit","eccentric attire","outlandish clothes","odd outfit"],"phonetic":"/bəˈzɑːr ˈkloʊðɪŋ/","extraExplanation":["语气提示：说别人“bizarre clothing”可能带有批评或不礼貌的感觉；更中性可以说 “unusual outfit/clothes”，更正面可说 “bold/creative outfit”。","在时尚语境中，“bizarre”有时也表示“前卫到让人吃惊”，并不一定完全负面。"],"etymology":"“bizarre”来自法语，原意与“古怪、离奇”相关；“clothing”来自表示“穿衣/衣物”的古英语词源。合在一起就是“怪异的衣着/服装”。","mnemonic":["把“bizarre”联想成“比（较）扎眼”= 很抢眼、很奇怪；“clothing”就是“衣服”。合起来=“扎眼的衣服”。"]}
{"word":"bizarre-looking","summary":{"en":"“Bizarre-looking” describes someone or something that has a very strange, unexpected appearance.","zh":"“bizarre-looking”用来形容人或事物外表非常怪异、出乎意料。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Strange or unusual in appearance; looking very different from what you expect.","zh":"外表怪异的；看起来很不寻常、出乎意料的。"},"examples":[{"en":"A bizarre-looking creature appeared in the movie, with three eyes and no mouth.","zh":"电影里出现了一种外表怪异的生物，有三只眼睛却没有嘴。"},{"en":"She wore a bizarre-looking hat that made everyone stare.","zh":"她戴了一顶看起来很怪的帽子，大家都忍不住盯着看。"},{"en":"We found a bizarre-looking rock on the beach and took photos of it.","zh":"我们在海滩上发现一块外形怪异的石头，就给它拍了照片。"}]}],"synonyms":["strange-looking","odd-looking","weird-looking","unusual-looking","peculiar-looking"],"phonetic":"/bɪˈzɑr ˈlʊkɪŋ/","extraExplanation":["这是一个由形容词 + 现在分词构成的复合形容词（compound adjective），常用连字符连接：bizarre-looking = “看起来很怪异的”。类似结构还有：serious-looking（看起来很严肃的）、friendly-looking（看起来很友善的）。","语气上，bizarre 通常表示“怪到让人吃惊/不适应”，比 strange 更强；用于描述外貌时，可能带一点评价色彩，注意语境是否礼貌。"]}
{"word":"bizarrely","summary":{"en":"Bizarrely means “in a very strange or unexpected way,” often used to show surprise.","zh":"bizarrely 表示“非常奇怪/出人意料地”，常用来表达说话者的惊讶。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a very strange, unusual, or unexpected way.","zh":"以非常奇怪、反常或出人意料的方式。"},"examples":[{"en":"Bizarrely, no one noticed the fire alarm was ringing.","zh":"很离奇的是，居然没人注意到火警在响。"},{"en":"The two cases are bizarrely similar.","zh":"这两个案子相似得有点离谱。"}]}],"synonyms":["strangely","oddly","weirdly","curiously","unexpectedly"],"phonetic":"/bɪˈzɑɹli/","extraExplanation":["“Bizarrely”通常用来强调说话者的惊讶或不解，常放在句首作句子副词（类似“strangely”）。语气往往比“strangely”更强，带有“怪到不合常理/有点荒诞”的感觉。","与“oddly”相比，“bizarrely”更偏向“离奇、怪诞、不可思议”；与“weirdly”相比，“bizarrely”更正式一些，也更常见于新闻报道、评论或叙述中。"]}
{"word":"bizarreness","summary":{"en":"“Bizarreness” means the quality of being very strange or unusual.","zh":"“bizarreness”表示“非常奇怪、不寻常的特质/程度”，可译为“怪异、离奇、怪诞感”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being very strange, unusual, or hard to explain; weirdness.","zh":"怪异；离奇；古怪的程度（指非常奇怪、不寻常、难以解释的特质）。"},"examples":[{"en":"The bizarreness of the dream stayed with me all day.","zh":"那个梦的离奇感让我一整天都忘不掉。"},{"en":"People were shocked by the bizarreness of the story, but it was true.","zh":"人们被这个故事的怪异程度震惊了，但它却是真的。"},{"en":"The film’s bizarreness is part of its charm.","zh":"这部电影的怪诞感正是它的魅力之一。"}]}],"synonyms":["weirdness","strangeness","oddity","eccentricity"],"phonetic":"/bɪˈzɛr.nəs/","extraExplanation":["“bizarreness”来自形容词“bizarre”（怪异的）+ 名词后缀“-ness”（……的性质/状态）。常用来描述体验、事件、艺术风格或行为给人的“离奇感/怪诞感”。","语气上，“bizarreness”多偏中性到略负面；在艺术、电影、文学评论里也常带欣赏意味（如“怪诞但迷人”）。","相关词：weirdness（更口语）、strangeness（更中性/正式）、eccentricity（更强调“古怪但有个性”）。"]}
{"word":"bizarrerie","summary":{"en":"Bizarrerie means an odd or quirky thing, or the quality of strangeness, often used in arts/literary contexts.","zh":"bizarrerie 指“怪异之物/奇事”，也可指“怪异感/古怪风格”，多见于文学或艺术评论语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strange or unusual thing; an oddity, especially one that feels quirky or unexpected","zh":"怪异之物；奇事（尤指古怪、出人意料的东西）"},"examples":[{"en":"The museum’s gift shop sold all kinds of bizarreries, from two-headed toy animals to glow-in-the-dark postcards.","zh":"博物馆的礼品店卖着各种各样的怪东西，从双头玩具动物到夜光明信片都有。"},{"en":"He collects small bizarreries he finds at flea markets.","zh":"他收集在跳蚤市场找到的小怪玩意儿。"}]},{"partOfSpeech":"n.","definition":{"en":"strangeness or oddness as a quality or style","zh":"怪异；古怪的风格或特质"},"examples":[{"en":"The film’s charm comes from its gentle bizarrerie rather than loud shock value.","zh":"这部电影的魅力来自它温和的怪诞感，而不是刻意的强烈冲击。"},{"en":"Her paintings mix realism with a quiet bizarrerie that makes you look twice.","zh":"她的画把写实与一种安静的怪诞感融合在一起，让人忍不住多看几眼。"}]}],"synonyms":["oddity","curiosity","quirk","peculiarity","strangeness","weirdness"],"phonetic":"bɪˈzɑrəri","extraExplanation":["“bizarrerie”是从法语借来的词，英文里比较书面、偏文学或评论写作（如影评、艺术评论）中常见；日常口语更常说“oddity / weird thing / strangeness”。","复数常写作“bizarreries”。","语感上它往往带一点“怪得有趣、怪得精致”的味道，不一定是负面的“怪”。"]}
{"word":"bizarres","summary":{"en":"“Bizarre” means very strange or unusual; “bizarres” is usually a nonstandard form unless used as a rare plural noun.","zh":"“bizarre”意为“非常奇怪/怪异”；“bizarres”通常不规范，除非极少见地把它当名词复数用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Very strange or unusual, especially in a surprising or hard-to-explain way.","zh":"非常奇怪的；怪异的（常指让人吃惊或难以解释）。"},"examples":[{"en":"The movie has a bizarre ending that left everyone confused.","zh":"这部电影的结局很怪异，把大家都看懵了。"},{"en":"He told a bizarre story about getting lost in his own neighborhood.","zh":"他讲了一个离奇的故事，说自己在自家社区里迷路了。"}]},{"partOfSpeech":"n.","definition":{"en":"A bizarre thing, event, or situation (less common; often used with “the bizarre”).","zh":"怪事；离奇之事（不太常见；常与“the bizarre”连用）。"},"examples":[{"en":"The show celebrates the bizarre and the unexpected.","zh":"这个节目主打离奇与意外。"}]}],"synonyms":["strange","weird","odd","unusual","peculiar","surreal"],"phonetic":"/bɪˈzɑr/","extraExplanation":["“bizarres”通常不是标准用法。最常见的形式是形容词“bizarre”。它不像名词那样加 -s 表示复数。只有在把“bizarre”当作名词使用时，理论上才可能出现复数“bizarres”，但现实中很少见。","常见搭配：bizarre behavior（怪异行为）、bizarre incident（离奇事件）、bizarre dream（怪梦）、a bizarre twist（离奇转折）。"]}
{"word":"bizarro","summary":{"en":"Bizarro means “weird/strange,” and it can also mean an upside-down, opposite-version of something (from Superman’s Bizarro).","zh":"bizarro 常指“怪异/离谱”，也可指某物“反转的、相反版本”（源自《超人》的 Bizarro）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Strange, weird, or very different from what is normal or expected (informal).","zh":"奇怪的；怪异的；与常规很不一样的（非正式）"},"examples":[{"en":"The weather has been bizarro all week—snow one day and shorts weather the next.","zh":"这周天气一直很怪——一天还下雪，下一天就热到能穿短裤。"},{"en":"That’s a bizarro idea, but it might actually work.","zh":"这个想法挺怪的，但说不定真能行。"}]},{"partOfSpeech":"adj.","definition":{"en":"In pop culture, referring to an “opposite” or distorted alternate version of something (often from Superman’s Bizarro).","zh":"（流行文化）指某物“相反/扭曲”的替代版本（常与《超人》中的“比扎罗”相关）"},"examples":[{"en":"It felt like a bizarro version of our city—familiar but upside down.","zh":"感觉像我们城市的“反转版”——熟悉却又颠倒。"},{"en":"In that episode, the hero meets his bizarro twin.","zh":"那一集中，英雄遇到了自己的“反转版”双胞胎。"}]},{"partOfSpeech":"n.","definition":{"en":"A bizarre person or thing; sometimes an “opposite-world” version (informal).","zh":"怪人；怪事/怪东西；有时指“反转世界”的版本（非正式）"},"examples":[{"en":"Some bizarro showed up at the party wearing a cape and goggles.","zh":"聚会上来了个怪人，披着斗篷还戴着护目镜。"},{"en":"This new rule is a total bizarro.","zh":"这条新规定简直离谱。"}]}],"synonyms":["bizarre","weird","strange","odd","outlandish","surreal","twisted"],"phonetic":"/bɪˈzɑroʊ/","extraExplanation":["“Bizarro”最早因美国DC漫画《超人》中的角色“Bizarro（比扎罗）”而流行：他常被设定为超人的畸变/镜像对立面，并生活在“Bizarro World（比扎罗世界）”，那里很多规则都和正常世界相反。","因此在日常英语里，bizarro 除了表示“怪异”，还常引申为“某种反过来、颠倒、很不对劲的版本”。写作时偏口语、偏幽默；正式场合更常用 bizarre、strange、odd。"]}
{"word":"bizcacha","summary":{"en":"Bizcacha usually refers to the vizcacha, a South American rodent related to the chinchilla.","zh":"bizcacha 通常指 vizcacha（维斯卡恰鼠），一种与龙猫近亲的南美啮齿动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled **vizcacha**.) A South American rodent related to chinchillas, known for its long ears and tail, and often living in rocky areas or grasslands. Example: “We saw a vizcacha sitting on a boulder.” / “我们看到一只维斯卡恰鼠（南美啮齿动物）坐在一块巨石上。”","zh":"（通常拼作 **vizcacha**。）一种生活在南美洲的啮齿动物，和龙猫近亲，耳朵和尾巴较长，常见于岩石地带或草原。例： “We saw a vizcacha sitting on a boulder.” / “我们看到一只维斯卡恰鼠坐在一块巨石上。”"},"examples":[{"en":"We spotted a vizcacha near the rocks at sunset.","zh":"日落时我们在岩石附近发现了一只维斯卡恰鼠。"},{"en":"Vizcachas are native to parts of the Andes and surrounding regions.","zh":"维斯卡恰鼠原产于安第斯山脉及其周边地区。"}]}],"synonyms":["vizcacha","viscacha"],"phonetic":"/vɪzˈkɑːtʃə/","extraExplanation":["你输入的 **bizcacha** 多半是 **vizcacha / viscacha** 的拼写变体或误拼。这个词来自南美（克丘亚语等原住民语言）的借词，因此在英语里常见不同拼法。","发音里常见的 **-ch-** 发 /tʃ/（像“chair”里的 ch），所以结尾听起来接近“卡恰”。"]}
{"word":"bize","summary":{"en":"“bize” is not standard English; it’s usually a misspelling or an informal variant meant to be “biz” or another word like “bizarre.”","zh":"“bize”不是标准英语词；通常是拼写错误或非正式写法，多半指“biz”或把“bizarre”等词写错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or mistaken spelling in English; it is not a commonly accepted dictionary word. In informal writing, people sometimes use it when they mean “biz” (business) or when they misspell another word (often “bizarre”).","zh":"英语中不常见、也不被普遍认可的拼写形式；多半是非标准写法或拼写错误。有时写作者想表达“biz（生意/商业）”，或把别的词（常见如“bizarre（古怪的）”）拼错了。"},"examples":[{"en":"I think you meant “biz” (business), not “bize.”","zh":"我觉得你想写的是“biz（生意/商业）”，不是“bize”。"},{"en":"If you wanted to say something is strange, the correct spelling is “bizarre.”","zh":"如果你想说“很奇怪”，正确拼写是“bizarre”。"}]}],"synonyms":["biz","business","bizarre (if that was intended)"],"phonetic":"/baɪz/","extraExplanation":["“bize”本身在英语里没有稳定、通用的标准含义，所以在作业、简历、邮件等正式场合建议避免使用。","如果你能告诉我你看到“bize”的句子或上下文（例如整句话/段落），我可以帮你判断它到底想表达哪个词，并给出更准确的释义与例句。"]}
{"word":"bizel","summary":{"en":"“Bizel” is most likely a misspelling of **bezel**: a rim/frame around a watch, screen, or gemstone setting.","zh":"“bizel”很可能是 **bezel** 的误拼：指手表、屏幕或宝石镶嵌处的边框/托圈。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly spelled **bezel**) the rim or frame around a watch face, a screen, or a gem that holds it in place.","zh":"（常见拼写为 **bezel**）指手表表盘、屏幕周围的边框；也指镶嵌宝石用的金属托圈/边框。"},"examples":[{"en":"This watch has a rotating bezel for timing dives.","zh":"这块表有可旋转的表圈，用来计时潜水。"},{"en":"Phones with a thin bezel look more modern.","zh":"边框更窄的手机看起来更现代。"},{"en":"The jeweler repaired the bezel that holds the stone.","zh":"珠宝匠修好了固定宝石的托圈。"}]}],"synonyms":["rim","frame","border"],"phonetic":"/ˈbɛzəl/","extraExplanation":["“bizel”在英语里不常见，最可能是把 **bezel** 拼错了（发音也接近）。在科技语境里，bezel 常指屏幕的“边框”；在钟表语境里，常指“表圈/表圈外圈”；在珠宝语境里，则是“包镶托圈”。"]}
{"word":"Bizen","summary":{"en":"Bizen refers either to a historic Japanese province or to Bizen ware, a well-known unglazed Japanese pottery style.","zh":"Bizen 可指日本的古代备前国，也常指备前烧——一种著名的不施釉日本陶器风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A historic province in Japan (in what is now Okayama Prefecture), known especially for traditional crafts.","zh":"日本的一个古代国名（大致位于今天的冈山县一带），以传统工艺闻名。"},"examples":[{"en":"Bizen was an old province in western Japan.","zh":"备前（Bizen）是日本西部的一个古代国名。"},{"en":"The region historically called Bizen is part of modern Okayama Prefecture.","zh":"历史上称为备前（Bizen）的地区属于今天的冈山县。"}]},{"partOfSpeech":"n.","definition":{"en":"Bizen ware (Bizen-yaki): a famous style of Japanese pottery, often unglazed and fired to create natural earthy colors and textures.","zh":"备前烧（Bizen-yaki）：日本著名陶器风格，常不施釉，通过烧成呈现自然的土色与质感。"},"examples":[{"en":"This tea cup is Bizen ware, so it has a warm, earthy surface.","zh":"这个茶杯是备前烧，所以表面有温暖的土色质感。"},{"en":"Many collectors value Bizen pottery for its natural patterns from the kiln.","zh":"很多收藏者看重备前陶器在窑中形成的自然纹理。"}]}],"synonyms":["Bizen-yaki","Bizen ware"],"phonetic":"/ˈbiːzɛn/","extraExplanation":["“Bizen（备前）”常见于日本文化与工艺语境：除了指古代的备前国，人们更常用它来指“备前烧（Bizen-yaki）”，属于日本“六古窑”传统之一，以不施釉、高温长时间烧成著称，表面会出现自然落灰、火色与窑变纹理。","在英文中，Bizen 多作为专有名词使用；谈陶器时也会直接说 “Bizen” 或更明确的 “Bizen ware / Bizen-yaki”。"]}
{"word":"bizen","summary":{"en":"Bizen usually refers to a historical Japanese province (now part of Okayama) or to its famous unglazed pottery, Bizen ware.","zh":"Bizen通常指日本历史上的备前国（今冈山县一带）或当地著名的无釉陶器“备前烧”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former province of Japan in what is now the eastern part of Okayama Prefecture, known historically for pottery and sword-making","zh":"日本旧国名“备前国”（Bizen），大致位于今天冈山县东部，历史上以陶器与刀剑制造闻名"},"examples":[{"en":"Bizen was one of the old provinces of Japan before the modern prefecture system.","zh":"备前是日本在建立现代都道府县制度之前的旧国之一。"},{"en":"He studied medieval documents from Bizen and neighboring provinces.","zh":"他研究了来自备前及其邻国的中世纪文献。"}]},{"partOfSpeech":"n.","definition":{"en":"a traditional style of unglazed Japanese stoneware pottery from Bizen (often called Bizen ware)","zh":"备前烧（Bizen ware）：源自备前地区的日本传统无釉陶器风格"},"examples":[{"en":"The tea ceremony uses many kinds of vessels, including Bizen ware.","zh":"茶道会使用多种器物，其中包括备前烧。"},{"en":"Bizen pottery is valued for its natural ash marks and warm, earthy colors.","zh":"备前烧因自然落灰的痕迹与温润的土色而受重视。"},{"en":"She bought a small Bizen vase as a souvenir.","zh":"她买了一个小备前烧花瓶作纪念。"}]}],"synonyms":["Bizen Province","Bizen ware","Bizen pottery"],"phonetic":"/ˈbiːzɛn/","extraExplanation":["“Bizen”常见于日本文化语境：例如“Bizen ware/备前烧”是日本六大古窑之一，以高温烧成、通常不施釉、依靠窑变与落灰形成纹理而著名；在英文里也可能出现在历史研究中，指旧国名“Bizen Province/备前国”。"]}
{"word":"Bizen-yaki","summary":{"en":"Bizen-yaki is traditional unglazed, wood-fired Japanese pottery from Bizen (Okayama), valued for natural ash-and-flame surface effects.","zh":"备前烧是源自日本备前（冈山）的传统无釉柴烧陶器，以落灰与火痕等自然窑变效果闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional Japanese style of unglazed, wood-fired stoneware pottery from Bizen (in present-day Okayama Prefecture), known for earthy colors and natural surface effects from ash and flame.","zh":"备前烧（Bizen-yaki）：源自日本备前地区（今冈山县）的传统无釉柴烧陶器（多为石器），以土色系与柴烧产生的自然落灰、火痕等表面效果著称。"},"examples":[{"en":"She bought a Bizen-yaki tea cup with a warm, earthy finish.","zh":"她买了一个备前烧茶杯，表面呈现温暖的土色质感。"},{"en":"Bizen-yaki pieces often show natural marks from ash and flame in the kiln.","zh":"备前烧作品常能看到窑内落灰与火焰留下的自然痕迹。"}]}],"synonyms":["Bizen ware"],"phonetic":"ˈbiːzɛn ˌjɑːki","extraExplanation":["“yaki（焼き）”在日语里常指“烧制的陶器/烧物”，所以“Bizen-yaki”也常译作“备前烧”，其中“Bizen”是地名。","备前烧以无釉、柴烧为典型特点：不施釉但会在长时间烧成中形成自然“落灰釉”般的效果；表面可能出现红褐、灰黑等变化，以及稻草绑扎产生的“火襷（hidasuki）”纹样等。","在英语语境中也常写作“Bizen ware”（备前烧陶器），用于博物馆说明、工艺品介绍或茶道相关语境。"]}
{"word":"Bizerta","summary":{"en":"Bizerta is a northern Tunisian port city; it’s also a historical spelling variant of “Bizerte.”","zh":"Bizerta 指突尼斯北部的港口城市；也可作 “Bizerte” 的历史拼写变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A port city in northern Tunisia on the Mediterranean Sea, near a canal linking the sea to Lake Bizerte.","zh":"比塞大（Bizerta）：突尼斯北部的地中海港口城市，靠近连接海与比塞大湖的运河。"},"examples":[{"en":"Bizerta is one of Tunisia’s northern coastal cities.","zh":"比塞大是突尼斯北部的沿海城市之一。"},{"en":"The ship anchored near Bizerta before continuing east along the Mediterranean.","zh":"船只在比塞大附近抛锚，随后沿地中海向东航行。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical/variant spelling) Another spelling for Bizerte, a name often seen in older English texts influenced by French usage.","zh":"（历史/拼写变体）Bizerte 的另一种拼写形式，常见于受法语用法影响的较旧英文资料中。"},"examples":[{"en":"Some older maps label the city as Bizerta rather than Bizerte.","zh":"一些旧地图把这座城市标注为 Bizerta，而不是 Bizerte。"}]}],"synonyms":["Bizerte"],"phonetic":"/bɪˈzɝːtə/","extraExplanation":["“Bizerta”更常见于历史语境：在法语里该城常写作 **Bizerte**（英文现代用法也多跟随此拼写）。如果你在一篇文章、地图或历史材料里看到“Bizerta”，通常指的就是同一个地方。","这座城市在地中海航运与殖民时期历史中常被提及；学习时可以把它当作专有名词地名使用，首字母大写。"]}
{"word":"Bizerte","summary":{"en":"Bizerte: a Mediterranean port city in northern Tunisia.","zh":"Bizerte：突尼斯北部的地中海港口城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A port city in northern Tunisia on the Mediterranean Sea, known for its harbor and naval history.","zh":"比塞大（Bizerte）：突尼斯北部地中海沿岸的港口城市，以海港与海军历史而闻名。"},"examples":[{"en":"Bizerte is one of Tunisia’s key Mediterranean ports.","zh":"比塞大是突尼斯重要的地中海港口之一。"},{"en":"We traveled from Tunis to Bizerte for a day by the sea.","zh":"我们从突尼斯市去比塞大，在海边玩了一天。"},{"en":"The city of Bizerte has long been linked to naval strategy and trade routes.","zh":"比塞大长期与海军战略和贸易航线密切相关。"}]}],"synonyms":["Benzert (variant/older spelling)"],"phonetic":"/bɪˈzɝːt/","extraExplanation":["“Bizerte”是地名（专有名词），常见于历史与地缘政治语境。20世纪中期这里曾有法国海军基地，并与1961年的“比塞大危机（Bizerte Crisis）”相关。","书写上首字母要大写：Bizerte。法语影响下也可见旧译或异名，但英语中通常直接用Bizerte。"]}
{"word":"bizes","summary":{"en":"“Biz” is an informal short form of “business,” meaning commerce, a company, or an industry.","zh":"“biz”是“business”的非正式缩写，表示生意、公司或某个行业/圈子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"business (used in informal speech and writing); a company or the world of commerce","zh":"（非正式）生意；商业；公司；商界"},"examples":[{"en":"She works in the music biz.","zh":"她在音乐行业工作。"},{"en":"It’s a tough biz, but he loves it.","zh":"这一行不容易，但他很喜欢。"},{"en":"We’re starting a small online biz.","zh":"我们要开一个小型的线上生意。"}]}],"synonyms":["business","trade","industry","company"],"phonetic":"/bɪz/","extraExplanation":["“bizes”不是常见或标准的拼写。你可能想写的是：1）“biz”的复数“biz(es)”（有时写作“biz’s”或“bizzes”，但都偏口语/随意）；2）更常见的是直接写标准词“business”（复数“businesses”）。","“biz”是“business”的缩略口语，常用于行业说法：the movie biz（电影圈）、show biz（演艺圈/娱乐圈）。在正式写作中建议用“business”。"]}
{"word":"Bizet","summary":{"en":"Bizet is the French composer Georges Bizet, best known for the opera Carmen.","zh":"Bizet 指法国作曲家乔治·比才，以歌剧《卡门》最为著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Georges Bizet (1838–1875), a French composer best known for the opera Carmen.","zh":"乔治·比才（1838–1875），法国作曲家，最著名的作品是歌剧《卡门》。"},"examples":[{"en":"Bizet’s opera Carmen is famous for its dramatic story and memorable melodies.","zh":"比才的歌剧《卡门》以戏剧性的故事和难忘的旋律而闻名。"},{"en":"In music class, we listened to a piece by Bizet.","zh":"在音乐课上，我们听了一段比才的作品。"}]}],"synonyms":["Georges Bizet"],"phonetic":"/biˈzeɪ/","extraExplanation":["“Bizet”是法语姓氏，英语里常读作 /biˈzeɪ/，重音在第二个音节。中文常译为“比才”。","比才在25岁时写了《阿莱城姑娘》（L’Arlésienne）的配乐，其中的《第一组曲》《第二组曲》经常在音乐会中演出；但他最具影响力的仍是歌剧《卡门》。","《卡门》中有许多“名曲”常被单独演奏或改编，例如《哈巴涅拉》（Habanera）与《斗牛士之歌》（Toreador Song）。"]}
{"word":"bizet","summary":{"en":"Bizet is the surname of Georges Bizet, the French composer famous for the opera Carmen.","zh":"Bizet 指法国作曲家乔治·比才的姓氏，他以歌剧《卡门》闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Georges Bizet (1838–1875), a French composer best known for the opera Carmen.","zh":"乔治·比才（1838–1875），法国作曲家，以歌剧《卡门》最为著名。"},"examples":[{"en":"Bizet’s opera Carmen includes the famous “Habanera.”","zh":"比才的歌剧《卡门》中有著名的《哈巴涅拉》（Habanera）。"},{"en":"We studied Bizet in a unit on Romantic-era French music.","zh":"我们在学习法国浪漫主义时期音乐时研究了比才。"}]}],"synonyms":["Georges Bizet"],"phonetic":"/biˈzeɪ/","extraExplanation":["“Bizet”是法语姓氏，英语里常按法语读法来念，重音在第二个音节。","比才英年早逝，但《卡门》后来成为世界上上演最频繁的歌剧之一；其中一些旋律在电影、广告和体育场合也很常见，因此你可能“听过但不知道名字”。"]}
{"word":"Bizkaian","summary":{"en":"Bizkaian means “from or relating to Bizkaia (Biscay)” or “a person from Bizkaia,” in the Basque Country of northern Spain.","zh":"Bizkaian 指“比斯开亚（Bizkaia/Biscay）的、与其有关的”，也可指“比斯开亚人”，位于西班牙北部巴斯克地区。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Bizkaia (Biscay), a province in the Basque Country in northern Spain.","zh":"（与）比斯开亚省（比斯开省，Bizkaia/Biscay）有关的；比斯开亚的（西班牙北部巴斯克地区的一省）。"},"examples":[{"en":"Bizkaian culture includes strong traditions in music and local festivals.","zh":"比斯开亚文化包含浓厚的音乐传统和本地节庆。"},{"en":"She studies Bizkaian history as part of Basque studies.","zh":"她在巴斯克研究中学习比斯开亚历史。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Bizkaia (Biscay).","zh":"比斯开亚人；来自比斯开亚省的人。"},"examples":[{"en":"Many Bizkaians speak both Basque and Spanish.","zh":"许多比斯开亚人同时会说巴斯克语和西班牙语。"}]}],"synonyms":["Biscayan","of Bizkaia","from Bizkaia"],"phonetic":"/bɪsˈkaɪən/","extraExplanation":["“Bizkaian”来自地名“Bizkaia”（巴斯克语拼写），英文中也常见对应形式“Biscayan”（来自西语/英语传统拼写“Biscay”）。","在语言学语境里，有时会用“Bizkaian Basque”指巴斯克语的一种方言/变体，常与城市毕尔巴鄂（Bilbao）所在地区相关。"]}
{"word":"biznaga","summary":{"en":"“Biznaga” usually refers to a barrel cactus; in Málaga, Spain it can also mean a traditional jasmine bouquet.","zh":"“Biznaga”通常指桶状仙人掌；在西班牙马拉加也可指一种传统茉莉花束。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large round cactus (especially a barrel cactus, genus *Ferocactus*), common in Mexico and the U.S. Southwest","zh":"（尤指桶状仙人掌，*Ferocactus* 属）一种大型圆球形仙人掌，常见于墨西哥及美国西南部"},"examples":[{"en":"We spotted a biznaga cactus growing on the rocky slope.","zh":"我们在岩石斜坡上看见一株 biznaga（桶状）仙人掌。"},{"en":"In the desert garden, the biznaga is planted where it gets full sun.","zh":"在沙漠花园里，biznaga 通常种在能晒到充足阳光的地方。"}]},{"partOfSpeech":"n.","definition":{"en":"(Spain, especially Málaga) a traditional bouquet made by pinning fresh jasmine flowers onto a dried stem, often sold in summer","zh":"（西班牙，尤指马拉加）一种传统“茉莉花束”，把新鲜茉莉花固定在干燥花茎上，夏季常见售卖"},"examples":[{"en":"In Málaga, street vendors sell biznagas that smell sweet at night.","zh":"在马拉加，街头小贩会卖 biznaga，夜晚闻起来特别香。"},{"en":"She brought home a biznaga as a souvenir from Andalusia.","zh":"她从安达卢西亚带回一束 biznaga 当纪念品。"}]}],"synonyms":["barrel cactus","Ferocactus","jasmine bouquet"],"phonetic":"/bɪzˈnɑːɡə/","extraExplanation":["“Biznaga”是西班牙语借词，在英语里多用于指“桶状仙人掌”。在墨西哥语境中，某些 biznaga 仙人掌曾被用来制作甜品原料（如 acitrón），但由于保护与生态原因，如今相关采集在很多地区受到限制或反对。","在西班牙马拉加（Málaga），“biznaga”更常指一种地方手工花束：把茉莉花一朵朵别在干燥的花茎骨架上，晚上香味更浓，常被当作夏季民俗符号。"]}
{"word":"biznagas","summary":{"en":"Biznagas is the Spanish plural of biznaga, referring either to Mexican barrel cacti or to jasmine bouquets traditionally sold in Málaga, Spain.","zh":"Biznagas 是西班牙语 biznaga 的复数，可指墨西哥的桶状仙人掌，也可指西班牙马拉加传统售卖的茉莉花束。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of biznaga) A type of barrel-shaped cactus native to Mexico (genus Ferocactus or Echinocactus), sometimes discussed in connection with traditional sweets made from its candied pith.","zh":"（biznaga 的复数）一种原产墨西哥的桶状仙人掌（多指 Ferocactus 或 Echinocactus 属），也常在“用其茎髓糖渍做传统甜点”的语境中被提到。"},"examples":[{"en":"Some barrel cacti are called biznagas in Mexico.","zh":"在墨西哥，一些桶状仙人掌被称为 biznagas。"},{"en":"People talk about protecting biznagas because they grow very slowly.","zh":"人们谈到要保护 biznagas，因为它们生长得非常缓慢。"}]},{"partOfSpeech":"n.","definition":{"en":"(Plural of biznaga) In Málaga, Spain, small hand-held bouquets made from jasmine flowers (a local summertime tradition).","zh":"（biznaga 的复数）在西班牙马拉加，用茉莉花做成、可手持的小花束（当地夏季传统）。"},"examples":[{"en":"Street vendors sell biznagas on summer nights in Málaga.","zh":"在马拉加的夏夜，街头小贩会卖 biznagas。"},{"en":"The scent of biznagas filled the plaza.","zh":"广场里弥漫着 biznagas 的香气。"}]}],"synonyms":["barrel cacti","jasmine bouquets"],"phonetic":"/biˈznɑɡəz/","extraExplanation":["“Biznaga / biznagas”多见于西班牙语语境，英语里通常作为外来词出现；读到时可根据上下文判断是“墨西哥桶状仙人掌”还是“马拉加的茉莉花束”。","在墨西哥语境中，它还常与传统糖果“acitrón”（糖渍仙人掌茎髓）相关；由于部分物种生长极慢，近年也常出现在保育与法规讨论中。"]}
{"word":"bizonal","summary":{"en":"Bizonal means “having to do with two zones or regions,” mainly used in technical or academic contexts.","zh":"bizonal 意为“与两个带/区有关的；涉及两个区域的”，多用于技术或学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or involving two zones or regions (often used in science, geography, or classification).","zh":"与两个带（区域）有关的；涉及两个区域的（常用于科学、地理或分类语境）。"},"examples":[{"en":"Scientists compared bizonal climate patterns in coastal and inland areas.","zh":"科学家比较了沿海与内陆地区的双带气候模式。"},{"en":"The plant is common in a bizonal habitat, growing in both lowland and montane zones.","zh":"这种植物在双带生境中很常见，既生长在低地带，也生长在山地带。"}]}],"synonyms":["two-zone","dual-zone","two-region"],"phonetic":"/baɪˈzoʊnəl/","extraExplanation":["“bi-”表示“二、双”（如 bicycle 双轮车），“-zonal”来自 zone（带、区）。因此 bizonal 字面意思就是“两个带/区的”。","该词较偏学术或技术写作，在生态学（如生物分布带）、地理学（气候带）、以及某些分类描述中更常见；日常英语里通常会说 “two-zone” 或 “in two zones”。"]}
{"word":"bizone","summary":{"en":"Bizone most commonly refers to the combined U.S. and U.K. occupation zones in postwar Germany; less commonly, it can mean something divided into two zones.","zh":"Bizone 最常指二战后德国的美英联合占领区；较少情况下也可泛指“双分区/两区域”的设置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the combined American and British occupation zones in post–World War II Germany (formed in 1947), later joined by France to become the Trizone and then West Germany","zh":"（二战后）德国被占领时期由美国与英国占领区合并而成的“美英占领区联合体”（1947年成立），后来法国加入形成“三占领区”，并进一步发展为西德"},"examples":[{"en":"In 1947, the U.S. and U.K. merged their occupation areas to create the Bizone.","zh":"1947年，美英合并各自的占领区，建立了“Bizone（美英联合占领区）”。"},{"en":"The Bizone helped coordinate economic policy in western Germany after the war.","zh":"Bizone 有助于在战后协调德国西部地区的经济政策。"}]},{"partOfSpeech":"n.","definition":{"en":"a place, system, or plan divided into two zones or areas (less common; often written as “bi-zone”)","zh":"被划分为两个区域/分区的地方、系统或规划（较少见；常写作“bi-zone”）"},"examples":[{"en":"The building uses a bi-zone heating system for upstairs and downstairs.","zh":"这栋楼使用双分区（bi-zone）供暖系统，分别控制楼上和楼下。"}]}],"synonyms":["Anglo-American zone","bi-zone (variant spelling)","two-zone area"],"phonetic":"/ˈbiːzoʊn/","extraExplanation":["“Bizone”是由前缀“bi-（两、双）”和“zone（区域）”构成的历史政治术语。它最常出现在二战后德国分区占领的背景中：1947年美英合并占领区，便于统一经济管理（例如货币、贸易与工业政策）。1948年法国加入后常称“Trizone（三占领区）”，随后与联邦德国（西德）的建立联系紧密。"]}
{"word":"bizones","summary":{"en":"Bison: a large wild buffalo-like animal, especially in North America.","zh":"Bison：野牛，一种大型、像水牛的野生动物，尤指北美的野牛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large wild animal like a buffalo, with a big head and shoulders, found in North America (American bison) and Europe (European bison).","zh":"一种体型巨大的野生牛科动物，外形类似水牛，头和肩很大；分布于北美（美洲野牛）和欧洲（欧洲野牛）。"},"examples":[{"en":"We saw a bison grazing near the road in Yellowstone National Park.","zh":"我们在黄石国家公园看到一头野牛在路边吃草。"},{"en":"Bison once lived in huge herds across the Great Plains.","zh":"野牛曾经成群结队地生活在大平原上。"}]}],"synonyms":["buffalo (informal in North America)","American bison"],"phonetic":"/ˈbaɪsən/","extraExplanation":["“bizones”不是常见的英文拼写；你很可能想写的是“bisons”或“bison”。","复数：bison 常常既可作单数也可作复数（one bison / many bison）；也可以用 bisons（many bisons），但在自然科普/一般描述里 many bison 更常见。","注意不要和“buffalo（水牛/野牛的俗称）”混淆：在北美口语里，人们有时把 bison 叫作 buffalo，但严格来说它们是不同动物。"]}
{"word":"Bizonia","summary":{"en":"Bizonia was the joint U.S.–British occupation zone in Germany after WWII, formed in 1947.","zh":"Bizonia指二战后德国的美英联合占领区，成立于1947年。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) The combined American and British occupation zones in western Germany after World War II (formed in 1947), which later helped lead to the creation of West Germany.","zh":"（历史）二战后德国西部由美国占领区与英国占领区在1947年合并形成的“美英联合占领区”（Bizonia），后来推动了西德的建立。"},"examples":[{"en":"In 1947, the U.S. and Britain merged their zones to form Bizonia to manage the economy more effectively.","zh":"1947年，美国和英国合并各自的占领区，成立了Bizonia，以更有效地管理经济。"},{"en":"Bizonia became an important step toward the political organization of West Germany.","zh":"Bizonia成为西德政治组织形成过程中的重要一步。"},{"en":"The term Bizonia is mostly used in history books about postwar Germany.","zh":"“Bizonia”这个词多见于关于战后德国的历史书中。"}]}],"synonyms":["Anglo-American zone","U.S.–British occupation zone"],"phonetic":"/baɪˈzoʊniə/","extraExplanation":["“Bizonia”由“bi-”（表示“两个”）+“zone”（占领区）构成，直译可理解为“二占领区”。后来法国占领区加入，形成“Trizonia”（三占领区）。","该词常出现在战后欧洲史、冷战初期史的语境中，讨论经济重建（如货币改革）与政治结构重组。"]}
{"word":"bizonia","summary":{"en":"Bizonia was the joint American–British occupation zone in western Germany after WWII (created in 1947).","zh":"Bizonia 指二战后1947年成立的德国西部“美英双占区”（美国占领区与英国占领区的合并）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the combined American and British occupation zones in western Germany after World War II (formed in 1947), a step toward the later creation of West Germany","zh":"（二战后）德国西部由美国占领区与英国占领区在1947年合并形成的“美英双占区”，是后来西德建立的过渡阶段之一"},"examples":[{"en":"In 1947, the U.S. and Britain merged their zones to form Bizonia.","zh":"1947年，美国和英国将各自的占领区合并，形成了“美英双占区”（Bizonia）。"},{"en":"Bizonia helped coordinate economic policy in western Germany after the war.","zh":"Bizonia 有助于战后在德国西部协调经济政策。"}]}],"synonyms":["Anglo-American zone","American–British occupation zone"],"phonetic":"/baɪˈzoʊniə/","extraExplanation":["“Bizonia”由前缀 bi-（表示“两个”）+ “zone”（占领区）构成，常用于历史与国际关系语境。","1948年法国占领区加入后，出现了“Trizonia”（三占区）的说法；这些安排与后来联邦德国（西德）的形成密切相关。"]}
{"word":"Biztha","summary":{"en":"“Biztha” is not a standard English word; it is likely a name/username/brand or an invented term.","zh":"“Biztha” 不是标准英语词，更可能是名字/用户名/品牌名或自造词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“Biztha” is not a standard English word in major dictionaries. It is most likely a proper name, username, brand name, or an invented/spelled-variably term.","zh":"“Biztha” 不是主流英语词典中的标准单词，更可能是人名、网名/用户名、品牌名，或是自造词/拼写变体。"},"examples":[{"en":"My username on the forum is Biztha.","zh":"我在论坛上的用户名是 Biztha。"},{"en":"Biztha is the name of a small project our team is working on.","zh":"Biztha 是我们团队正在做的一个小项目的名字。"}]}],"synonyms":["(none in standard English)"],"phonetic":"/ˈbɪzθə/","extraExplanation":["这个词看起来像是“自造词”或“转写拼写”（例如从其他语言音译到英文）。如果你能提供一句包含 Biztha 的原句、它出现的场景（游戏/社交平台/公司名/歌曲等），我可以更准确判断含义与用法。","也可能是常见词的拼写误差：比如你想查的是不是 **Bertha**（人名）、**bizarre**（奇怪的）、或 **biz**（business 的口语缩写）相关的词？"]}
{"word":"bizygomatic","summary":{"en":"Bizygomatic means “related to both cheekbones,” often referring to the width across the cheekbones.","zh":"bizygomatic 指“与两侧颧骨有关的”，常用来表示两颧之间的宽度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both cheekbones (zygomatic bones), especially the width or distance across them.","zh":"与两侧颧骨（颧骨/颧骨弓）有关的，尤指两颧之间的宽度或距离。"},"examples":[{"en":"The doctor noted swelling in the bizygomatic area after the injury.","zh":"受伤后，医生注意到两侧颧骨区域（颧部）有肿胀。"},{"en":"Bizygomatic width is often measured in facial anthropology and orthodontics.","zh":"在人类学的面部研究和正畸学中，常会测量两颧宽（颧弓间宽度）。"}]}],"synonyms":["zygomatic (context-dependent)","across-the-cheekbones (informal paraphrase)"],"phonetic":"/ˌbaɪzaɪˈɡoʊmætɪk/","extraExplanation":["“bi-”表示“两个/两侧”， “zygomatic”与“颧骨”有关；因此 bizygomatic 通常出现在医学、解剖学、法医、正畸与面部测量（anthropometry）的语境中。","常见相关表达：bizygomatic width（两颧宽/颧弓间宽度），bizygomatic distance（两颧距离）。日常英语中较少使用，更多见于专业写作与检查报告。"]}
{"word":"bizz","summary":{"en":"“bizz” is an informal, nonstandard spelling of “biz,” meaning business or business matters.","zh":"“bizz”是“biz”的非正式、非标准拼写，表示“生意/商业”或“工作上的事”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A playful or nonstandard spelling of “biz,” meaning business; often used in casual writing or branding.","zh":"（非正式）“biz”（business 的口语/缩写）的俏皮或非标准拼写，意思是“生意、商业”；常见于随意写法或品牌命名。"},"examples":[{"en":"I’ve got some bizz to take care of this afternoon.","zh":"我今天下午得处理点生意上的事。"},{"en":"She works in the music bizz.","zh":"她在音乐行业工作。"},{"en":"This café’s name uses “bizz” to sound fun and modern.","zh":"这家咖啡馆用“bizz”做名字是为了显得有趣、现代。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) Business activity or matters in general; work-related stuff.","zh":"（非正式）泛指商业活动或与工作/生意有关的事情。"},"examples":[{"en":"Let’s talk bizz after the meeting.","zh":"我们会后再聊正事（生意/工作相关的事）。"},{"en":"It’s not personal—it’s just bizz.","zh":"这不是针对个人——只是工作/生意而已。"}]}],"synonyms":["biz","business"],"phonetic":"bɪz","extraExplanation":["“bizz”不是标准拼写，更常见的是“biz”。在正式写作（邮件、报告、论文）中建议用“business”。","常见搭配：the music biz（音乐行业）、showbiz（演艺圈/娱乐业）、none of your business（不关你的事）。"]}
{"word":"bizzarro","summary":{"en":"Bizarro means very weird (slang) or an opposite/strange version of something (from DC Comics).","zh":"Bizarro 可指（俚语）很怪、很反常，也可指某事物的“反转/对立版”（源自 DC 漫画）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(slang) Very strange, weird, or “off” in an unusual way.","zh":"（俚语）非常奇怪、怪异的；不太对劲、很反常。"},"examples":[{"en":"That was a bizarro situation—everyone acted like nothing happened.","zh":"那真是个很怪异的情况——每个人都像什么都没发生一样。"},{"en":"The movie starts normally, then it turns totally bizarro.","zh":"这部电影一开始很正常，然后就变得特别诡异。"}]},{"partOfSpeech":"n.","definition":{"en":"An opposite or distorted version of something; often used as “Bizarro” from DC Comics (Superman’s imperfect opposite).","zh":"某事物的相反版或扭曲版；常指 DC 漫画中的“比扎罗（Bizarro）”，即超人的不完美对立面。"},"examples":[{"en":"It felt like a Bizarro version of our usual routine.","zh":"这感觉像我们日常生活的一个“反转版”。"},{"en":"In the comics, Bizarro is Superman’s opposite in many ways.","zh":"在漫画里，比扎罗在很多方面都是超人的对立面。"}]}],"synonyms":["weird","strange","odd","surreal","twisted"],"phonetic":"/bɪˈzɑːroʊ/","extraExplanation":["“Bizarro”原本是美国流行文化里的专有名词（DC 漫画角色），后来在口语里被借用来表示“反常、像镜像世界一样怪”。","你输入的“bizzarro”更常见是拼写错误；标准拼写通常是 **bizarro**（俚语/文化用法）或 **bizarre**（更正式的“怪异的”）。"]}

