{"word":"BJ","summary":{"en":"“BJ” most commonly means Beijing in informal contexts, but it can also be vulgar sexual slang in English.","zh":"“BJ”最常见是“北京”的非正式缩写，但在英语里也可能是粗俗的性俚语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Abbreviation for Beijing (北京), especially in informal writing (e.g., travel, chatting).","zh":"“北京（Beijing）”的缩写，常见于非正式书写（如旅行、聊天）。"},"examples":[{"en":"I’ll be in BJ next week for a conference.","zh":"我下周会去BJ（北京）开会。"},{"en":"Flights to BJ are cheaper in the winter.","zh":"冬天去BJ（北京）的机票更便宜。"}]},{"partOfSpeech":"other","definition":{"en":"(Slang, vulgar) Abbreviation for “blowjob,” an oral sex act.","zh":"（俚语，粗俗）“blowjob（口交）”的缩写。"},"examples":[{"en":"That term is vulgar—don’t use “BJ” in formal or polite conversation.","zh":"这个说法很粗俗——不要在正式或礼貌的场合用“BJ”。"},{"en":"Some messages use “BJ” as sexual slang, which can be inappropriate at work.","zh":"有些信息里“BJ”会被当作性暗示俚语，在工作场合可能不合适。"}]}],"synonyms":["Beijing (for meaning 1)","blowjob (for meaning 2, vulgar)"],"phonetic":"/ˌbiːˈdʒeɪ/","extraExplanation":["“BJ”在不同语境含义差异很大：在中文或旅行语境里多指“北京”；但在英语网络语境中也可能指粗俗的性俚语。为避免尴尬或冒犯，在不确定语境时最好写全称（Beijing）或避免使用该缩写。","发音通常读字母名（B + J），即 /ˌbiːˈdʒeɪ/。"]}
{"word":"Bjarne","summary":{"en":"Bjarne is a Scandinavian male first name.","zh":"Bjarne 是一个北欧常见的男性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name used mainly in Scandinavia (especially Denmark and Norway).","zh":"（男子名字）主要用于北欧（尤其丹麦、挪威）的男性名。"},"examples":[{"en":"Bjarne is a common name in Denmark and Norway.","zh":"Bjarne 是丹麦和挪威较常见的名字。"},{"en":"My classmate Bjarne moved to the U.S. last year.","zh":"我的同学 Bjarne 去年搬到美国了。"}]}],"synonyms":["Björn","Bjarni"],"phonetic":"/ˈbjɑrnə/","extraExplanation":["Bjarne 通常源自古北欧语，与“bear（熊）”或“warrior（战士）”等意象有关（不同来源解释略有差异）。","英语环境里常见的读法接近“BYAR-nuh / BYAR-neh”；遇到本人时，最礼貌的做法是直接问对方偏好的发音。","在科技文化语境中，很多人会联想到 Bjarne Stroustrup（比雅尼·斯特劳斯特鲁普），他是 C++ 编程语言的设计者。"]}
{"word":"Bjarni","summary":{"en":"Bjarni is a Nordic (especially Icelandic) male first name.","zh":"Bjarni 是一个北欧（尤其是冰岛）常见的男性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name used mainly in Iceland and other Nordic contexts.","zh":"（主要在冰岛及北欧语境中使用的）男性名字。"},"examples":[{"en":"Bjarni is a common Icelandic first name.","zh":"Bjarni 是一个常见的冰岛男性名字。"},{"en":"Bjarni introduced himself and explained how to pronounce his name.","zh":"Bjarni 做了自我介绍，并解释了他的名字怎么读。"}]}],"synonyms":["Björn","Bjørn","Bjarke"],"phonetic":"/ˈbyɑrni/","extraExplanation":["“Bjarni”源自古诺尔斯语（Old Norse）名字体系，通常被认为与“bjǫrn / björn（熊）”同源，因此常被解读为“像熊一样强壮/勇敢”的含义。","在英语环境中，这个名字常见的近似读法类似“BYAR-nee”，但不同的人（尤其是冰岛本地人）发音可能更接近原始冰岛语的音值。","你可能在历史与新闻中见到一些同名人物，例如早期航海传说中的 Bjarni Herjólfsson，或当代冰岛政治人物 Bjarni Benediktsson。"]}
{"word":"Bjart","summary":{"en":"Bjart is mainly a Scandinavian name connected with the meaning “bright/shining,” and it can also appear as a Scandinavian word meaning “bright; clear.”","zh":"Bjart 主要是一个与“明亮/闪耀”相关的北欧人名，也可能作为北欧语言词汇出现，意为“明亮的；清澈的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper name) A Scandinavian given name (especially Icelandic and Faroese), related to the idea of being “bright” or “shining.”","zh":"（人名）一个斯堪的纳维亚地区的名字（尤其见于冰岛语、法罗语），含义与“明亮、闪耀”相关。"},"examples":[{"en":"Bjart moved to Seattle for graduate school.","zh":"Bjart 为了读研究生搬到了西雅图。"},{"en":"The author named the main character Bjart to suggest hope and brightness.","zh":"作者把主角取名为 Bjart，用来暗示希望与光明。"}]},{"partOfSpeech":"adj.","definition":{"en":"(From Norwegian/Icelandic use) “bright; clear” (not a common English word, but you may see it in names, titles, or translated literature).","zh":"（源自挪威语/冰岛语用法）“明亮的；清澈的”（不是常见英文词，但可能出现在人名、书名或文学译作中）。"},"examples":[{"en":"In the original text, bjart describes a bright summer night.","zh":"在原文里，bjart 用来形容明亮的夏夜。"},{"en":"The poem repeats the word bjart to create a feeling of light.","zh":"这首诗反复使用 bjart 来营造光亮感。"}]}],"synonyms":["bright","shining","clear"],"phonetic":"/bjɑrt/","extraExplanation":["“Bjart-”这一词根与北欧语言里表示“明亮、光亮”的词有关（可类比英语 bright 的意义）。因此它常被用作人名，带有积极、希望、光明的联想。","发音提示：开头的“Bj-”在英语里不常见，英语使用者有时会读得更接近“byart”。在真实使用中，发音也可能因冰岛语/挪威语地区差异而变化。"]}
{"word":"BJJ","summary":{"en":"BJJ usually means Brazilian Jiu-Jitsu, a grappling-based martial art focused on ground control and submissions.","zh":"BJJ通常指巴西柔术，一种以缠斗与地面控制、降服技为核心的武术与竞技运动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Brazilian Jiu-Jitsu: a martial art and combat sport focused on grappling (clinch work, takedowns, and especially ground fighting) and winning by submission holds such as chokes and joint locks.","zh":"巴西柔术：一种以近身缠斗、摔投与（尤其是）地面技为核心的武术与竞技项目，常通过绞技、关节技等“降服技”让对手认输获胜。"},"examples":[{"en":"He trains BJJ three times a week to improve his grappling.","zh":"他每周练三次BJJ来提升缠斗能力。"},{"en":"In the tournament, she won the BJJ match with a rear-naked choke.","zh":"在比赛中，她用“裸绞”降服对手赢下了BJJ对局。"},{"en":"BJJ is popular in MMA because it teaches strong ground control and submissions.","zh":"BJJ在综合格斗里很受欢迎，因为它强调强力的地面控制和降服技术。"}]},{"partOfSpeech":"n.","definition":{"en":"The community, class, or training session related to Brazilian Jiu-Jitsu.","zh":"（口语）指巴西柔术的圈子、课程或训练活动。"},"examples":[{"en":"I’m heading to BJJ after work.","zh":"我下班后要去练BJJ。"},{"en":"The BJJ community at this gym is very welcoming to beginners.","zh":"这家馆的BJJ圈子对新手很友好。"}]}],"synonyms":["Brazilian Jiu-Jitsu","Brazilian jujitsu","jiu-jitsu (context-dependent)","BJJ training","grappling"],"phonetic":"/ˌbiː dʒeɪ ˈdʒeɪ/","extraExplanation":["“BJJ”通常按字母读作“B-J-J”（美式发音大致为 /bi dʒeɪ dʒeɪ/）。全称是 Brazilian Jiu-Jitsu。","巴西柔术在20世纪由柔道/日式柔术的技术体系发展而来，并在巴西进一步强调地面控制、过渡与降服；在现代格斗文化（尤其MMA）中影响很大。","常见相关词：gi（穿道服/柔术服训练）、no-gi（不穿道服的训练）、guard（护身位/防守位）、sweep（扫/翻转）、submission（降服技）、tap（拍地认输）。"]}
{"word":"Bjneborg","summary":{"en":"“Bjneborg” isn’t recognized as an English word; it’s likely a misspelling/variant of the proper name “Bjørneborg.”","zh":"“Bjneborg”不是标准英语词汇；很可能是专有名词“Bjørneborg”的误拼或变体。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It looks like a misspelling or a variant spelling of a proper name (often seen as “Bjørneborg”).","zh":"不是标准英语单词。看起来像是拼写错误或某个专有名词的变体（常见写法之一是“Bjørneborg”）。"},"examples":[{"en":"I couldn’t find “Bjneborg” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里找不到“Bjneborg”——你能把你看到它的句子发我吗？"},{"en":"If you meant “Bjørneborg,” it is a historical name associated with the Finnish city Pori.","zh":"如果你想写的是“Bjørneborg”，它是与芬兰城市波里（Pori）相关的一个历史名称。"}]}],"synonyms":["Bjørneborg","Pori"],"phonetic":"/ˈbjɝnəˌbɔrɡ/","extraExplanation":["“Bjørneborg”是瑞典语/丹麦语/挪威语语境中出现的地名形式，常被用来指芬兰城市Pori（波里）的历史名称之一。你写的“Bjneborg”可能是把“ø”省略或打错了字母。","如果你告诉我它出现的上下文（例如一段文字、地图、歌曲/小说、或人名/地名列表），我可以更准确判断它到底指什么、以及英文里通常怎么写。"]}
{"word":"Bjoerling","summary":{"en":"Bjoerling (usually spelled Björling) is a Swedish surname, best known from the tenor Jussi Björling.","zh":"Bjoerling（常写作 Björling）是一个瑞典姓氏，最知名的代表是男高音尤西·比约林。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Swedish surname; most famously associated with Jussi Björling (1911–1960), a world-renowned Swedish operatic tenor.","zh":"一个瑞典姓氏；最广为人知的是与尤西·比约林（Jussi Björling，1911–1960）相关，他是享誉世界的瑞典歌剧男高音。"},"examples":[{"en":"I’ve been listening to Björling’s recording of “Nessun dorma.”","zh":"我一直在听比约林演唱《今夜无人入睡》的录音。"},{"en":"The teacher played a Björling aria to demonstrate clear tenor diction.","zh":"老师播放了比约林演唱的一段咏叹调，用来示范男高音清晰的咬字。"}]}],"synonyms":["Björling","Jussi Björling"],"phonetic":"/ˈbjɔr.lɪŋ/","extraExplanation":["“Bjoerling”常见于不方便输入变音符号“ö”的场景（如旧式系统、部分邮箱或文件名），因此用“oe”代替“ö”。标准拼写通常是“Björling”。","在英语语境里，这个名字多出现在古典音乐/歌剧讨论中；若你指的是歌手，常写作“Jussi Björling”。"]}
{"word":"Bjoern","summary":{"en":"Bjoern is a Scandinavian personal name, commonly associated with the meaning “bear.”","zh":"Bjoern 是北欧人名，通常与“熊”的含义相关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A Scandinavian given name (usually male). It comes from Old Norse and is commonly understood to mean “bear.”","zh":"一个斯堪的纳维亚（北欧）常见的名字（通常为男性名），源自古诺尔斯语，常被理解为“熊”。"},"examples":[{"en":"Bjoern is a common name in Sweden, Norway, and Denmark.","zh":"Bjoern 在瑞典、挪威和丹麦很常见。"},{"en":"Bjoern introduced himself and explained how to spell his name in English.","zh":"Bjoern 介绍了自己，并解释了他的名字用英文怎么拼。"}]}],"synonyms":["Björn","Bjorn"],"phonetic":"/ˈbjɔrn/","extraExplanation":["“Bjoern”常见于在不方便输入“ö”时的替代拼写；原本更常见的写法是“Björn”。在英语语境里，也常直接写作“Bjorn”。","因为英语里没有“ö”对应的精确元音，英语使用者通常会把它读得接近“BYORN/bee-orn”一类的音。正式场合可以礼貌地询问本人偏好的读法与拼写。"]}
{"word":"Bjork","summary":{"en":"Björk is best known as an Icelandic experimental pop artist; in Scandinavian languages, björk can also mean “birch tree.”","zh":"Björk 通常指冰岛实验流行音乐艺人“比约克”；在斯堪的纳维亚语言中，björk 也可表示“桦树”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An Icelandic singer, songwriter, and artist known for experimental pop music; her full name is Björk Guðmundsdóttir.","zh":"冰岛歌手、词曲创作人和艺术家，以实验性流行音乐闻名；全名为 Björk Guðmundsdóttir（比约克·古德蒙兹多蒂尔）。"},"examples":[{"en":"Björk became internationally famous after releasing the album Debut.","zh":"比约克在发行专辑《Debut》后走向国际知名。"},{"en":"Many listeners describe Björk’s music as creative and unpredictable.","zh":"许多听众形容比约克的音乐富有创意、难以预测。"},{"en":"I’m going to listen to Björk while I study.","zh":"我学习的时候打算听比约克的歌。"}]},{"partOfSpeech":"n.","definition":{"en":"In some Scandinavian languages, björk/bjork means “birch (tree).” In English, this meaning is usually written as birch, not Bjork.","zh":"在一些斯堪的纳维亚语言中，björk/bjork 的意思是“桦树”。但英语中通常写作 birch，而不是 Bjork。"},"examples":[{"en":"In Swedish, björk means birch.","zh":"在瑞典语里，björk 的意思是“桦树”。"},{"en":"Birch trees (björk) are common in northern Europe.","zh":"桦树（björk）在北欧很常见。"}]}],"synonyms":["(for the artist) Björk Guðmundsdóttir","(tree meaning) birch"],"phonetic":"/bjɔrk/","extraExplanation":["“Björk”里的“ö”是冰岛语/北欧语言常见的变音符号。英文里常写成 Bjork（省略变音符号），发音通常接近“BYORK”。","比约克不仅是歌手，也参与电影与艺术项目；她在国际流行文化中常被视为“前卫/实验音乐”的代表人物。"]}
{"word":"Bjorn","summary":{"en":"Bjorn is a Scandinavian male name (often Björn) that comes from a word meaning “bear.”","zh":"Bjorn 是一个源自北欧的男性名字（常写作 Björn），词源与“熊”有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name of Scandinavian origin (often written “Björn” in Swedish), used in many countries; it comes from a word meaning “bear.”","zh":"一个源自斯堪的纳维亚地区的男性名字（瑞典语中常写作“Björn”），在许多国家使用；其词源与“熊”有关。"},"examples":[{"en":"Bjorn is a common name in Sweden and Norway.","zh":"Bjorn 在瑞典和挪威是很常见的名字。"},{"en":"We met Bjorn at a conference in Copenhagen.","zh":"我们在哥本哈根的一场会议上认识了 Bjorn。"},{"en":"His full name is Bjorn Eriksson.","zh":"他的全名是 Bjorn Eriksson。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common in English) “björn” in Swedish (and related languages) means “bear.”","zh":"（英语中较少直接这样用）瑞典语（及相关语言）里的“björn”意为“熊”。"},"examples":[{"en":"In Swedish, the word for “bear” is björn.","zh":"在瑞典语里，“熊”的词是 björn。"}]}],"synonyms":["Björn"],"phonetic":"/bjɔɹn/","extraExplanation":["“Björn”中的“ö”是一个元音字母：英语里常把它简化写成“Bjorn”。在英语口语中，有的人会把它读得更接近“bee-ORN”，也有人更接近“byorn”，地区与个人习惯差异较大。","文化提示：著名人物包括网球名将 Björn Borg（比约恩·博格）。在北欧文化里，“熊”象征力量与勇气，因此这个名字也常带有这种联想。"]}
{"word":"bjorne","summary":{"en":"“Bjorne” is usually a variant spelling of the Scandinavian name “Bjørn/Bjorn,” meaning “bear.”","zh":"“Bjorne”通常是斯堪的纳维亚名字“Bjørn/Bjorn”的变体拼写，含义为“熊”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Scandinavian male given name (a variant spelling of “Bjørn/Bjorn”), traditionally meaning “bear.”","zh":"斯堪的纳维亚男性名字（“Bjørn/Bjorn”的变体拼写），传统含义为“熊”。"},"examples":[{"en":"His name is Bjorne, and his family is from Norway.","zh":"他叫Bjorne，他的家人来自挪威。"},{"en":"Bjorne is a variant of Bjorn, a name that means “bear.”","zh":"Bjorne是Bjorn的变体拼写，这个名字的意思是“熊”。"}]},{"partOfSpeech":"other","definition":{"en":"(rare in English) a spelling you may see when Scandinavian letters are simplified; it can refer to words related to “bear” (from Norwegian/Swedish “bjørn/björn”).","zh":"（英语中较少见）常见于将北欧字母简化后的拼写；也可能指与“熊”有关的词（来自挪威语/瑞典语“bjørn/björn”）。"},"examples":[{"en":"In some texts, “Bjoerne” is used instead of “Bjørne” because “ø” isn’t available.","zh":"在一些文本中，因为打不出“ø”，会用“Bjoerne”来代替“Bjørne”。"}]}],"synonyms":["Bjorn","Bjørn","Bjoern"],"phonetic":"/bjɔrn/","extraExplanation":["“Bjorne”本身在英语里不算常见单词，更常见的是人名“Bjorn/Bjørn”。其中挪威语/丹麦语的“ø”（以及瑞典语的“ö”）有时会被写成“o”或“oe”（如Bjoern），所以会出现Bjorne这类拼写变体。","发音上，英语里常把“Bjorn”读成近似“byorn”（/bjɔrn/）。如果你指的是具体某个人名（例如某部作品/某位人物），我也可以按语境补充更准确的读法和用法。"]}
{"word":"Bjornson","summary":{"en":"Bjornson is a Norwegian surname, most famously referring to the writer Bjørnstjerne Bjørnson or, more broadly, his works and influence.","zh":"Bjornson 是挪威姓氏，最常指作家比约恩松（Bjørnstjerne Bjørnson），也可泛指他的作品与影响。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Norwegian surname, best known from Bjørnstjerne Bjørnson (1832–1910), a major poet, playwright, and public figure.","zh":"挪威姓氏，最著名的代表是比约恩斯特耶尔内·比约恩松（Bjørnstjerne Bjørnson，1832–1910），重要的诗人、剧作家与社会活动家。"},"examples":[{"en":"Our literature class read a short play by Bjornson.","zh":"我们的文学课读了比约恩松的一部短剧。"},{"en":"Bjornson is often mentioned alongside Ibsen in discussions of Norwegian drama.","zh":"在谈论挪威戏剧时，比约恩松常常与易卜生一起被提及。"}]},{"partOfSpeech":"n.","definition":{"en":"By extension, the works or legacy of Bjørnstjerne Bjørnson (e.g., his writing, ideas, or influence).","zh":"引申指比约恩松的作品或影响（例如他的写作、思想或文化影响）。"},"examples":[{"en":"The themes of nationhood in Bjornson remain influential in Scandinavian culture.","zh":"比约恩松作品中关于民族认同的主题在斯堪的纳维亚文化中仍有影响。"},{"en":"She wrote her thesis on Bjornson and the rise of modern Norwegian identity.","zh":"她的论文研究比约恩松与现代挪威民族认同的兴起。"}]}],"synonyms":["Bjørnson","Bjørnstjerne Bjørnson"],"phonetic":"/ˈbjɔrn.sən/","extraExplanation":["“Bjørnson”常见的英语写法会去掉挪威字母“ø”，写成“Bjornson”。“ø”大致接近介于/e/与/ö/之间的音。","比约恩松于1903年获得诺贝尔文学奖，是挪威文学的重要代表之一；他也写过挪威国歌《Ja, vi elsker dette landet》的歌词。","学习资料中若看到“Bjørnson”或“Bjornson”，通常都在指同一个人（比约恩松）或与其相关的文学传统。"]}

