{"word":"BM","summary":{"en":"“BM” is a common abbreviation meaning “bowel movement,” “benchmark,” or “British Museum,” depending on context.","zh":"“BM”是常见缩写，常指“排便（bowel movement）”“基准（benchmark）”或“大英博物馆（British Museum）”，具体看语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, medical) bowel movement; the act of passing feces.","zh":"（非正式/医疗语境）排便；大便。"},"examples":[{"en":"The nurse asked if the patient had a BM today.","zh":"护士问病人今天有没有排便。"},{"en":"I haven’t had a BM since yesterday.","zh":"我从昨天起就没有排便。"}]},{"partOfSpeech":"n.","definition":{"en":"benchmark; a standard or point of reference used to compare performance or progress.","zh":"基准；基准点（用于比较表现或进度的标准）。"},"examples":[{"en":"We use last year’s sales as a BM for this quarter.","zh":"我们把去年的销售额作为本季度的基准。"},{"en":"Test scores provide a BM to track improvement.","zh":"考试成绩提供了一个跟踪进步的基准。"}]},{"partOfSpeech":"n.","definition":{"en":"British Museum (UK); a major museum in London, often abbreviated as BM in writing.","zh":"（英国）大英博物馆（常写作 BM）。"},"examples":[{"en":"We spent the afternoon at the BM looking at the Egyptian galleries.","zh":"我们下午在大英博物馆参观了埃及馆。"},{"en":"The BM’s collection is famous worldwide.","zh":"大英博物馆的馆藏闻名世界。"}]}],"synonyms":["bowel movement","stool (informal)","benchmark","reference point","British Museum"],"phonetic":"/ˌbiːˈɛm/","extraExplanation":["“BM”是缩写，含义高度依赖语境：在医院/护理记录里最常见的是“bowel movement（排便）”。日常聊天里也可能出现，但略显私密。","在商业/数据分析场景中，“BM=benchmark（基准）”并不如“benchmark”全写常见；写正式文件时建议写全。","有时“BM”还可能指别的事物（如人名首字母、职位或项目代号等）。如果你告诉我你看到它的句子/场景，我可以帮你精确判断。"]}
{"word":"bm","summary":{"en":"“bm” is usually read as “B-M” and most commonly means “bowel movement,” but it can also mean “benchmark” or (slang) “baby mama,” depending on context.","zh":"“bm”通常读作字母“B-M”，最常见指“排便”，也可能指“基准/标杆（benchmark）”或（俚语）“孩子的母亲（baby mama）”，需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(spoken as letters) an abbreviation for “bowel movement” (poop); used in medical notes or casual talk, sometimes considered a bit blunt.","zh":"（读作字母）“排便/大便”的缩写；常见于医疗记录或日常口语中，有时显得比较直白。"},"examples":[{"en":"The nurse asked when his last BM was.","zh":"护士问他上一次排便是什么时候。"},{"en":"I can’t travel comfortably if I haven’t had a BM.","zh":"如果我还没排便，我就不太舒服出门/旅行。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “benchmark,” meaning a standard used for comparison (common in business/tech).","zh":"“基准/标杆（benchmark）”的缩写，指用来比较的标准（常见于商业/科技语境）。"},"examples":[{"en":"We use last year’s sales as the BM for this quarter.","zh":"我们用去年的销售额作为本季度的基准。"},{"en":"This test score is our BM for future improvements.","zh":"这个测试分数是我们以后改进的比较基准。"}]},{"partOfSpeech":"other","definition":{"en":"(slang) an abbreviation for “baby mama,” meaning the mother of someone’s child, usually not a spouse or current partner; can sound informal or disrespectful depending on tone.","zh":"（俚语）“孩子的母亲（baby mama）”的缩写，通常指并非配偶或现任伴侣的孩子母亲；语气可能显得随意甚至不尊重。"},"examples":[{"en":"He said he needs to talk to his BM about the school fees.","zh":"他说他得和孩子的妈妈谈学费的事。"},{"en":"Try not to call her “BM” in formal situations.","zh":"在正式场合尽量别称她为“BM”。"}]}],"synonyms":["bowel movement (BM)","benchmark","baby mama"],"phonetic":"/bi ɛm/","extraExplanation":["“BM”在不同圈子里意思差异很大：医疗场景里最常见的是“bowel movement”；职场/技术文档里可能指“benchmark”。看到“bm”时最好结合上下文判断。","涉及身体排泄（bowel movement）的“BM”在英文里算相对委婉但仍偏直白；更客气可以说“use the bathroom / go to the restroom”。","“BM=baby mama”带有强烈口语和社会语境色彩，可能被认为不够尊重；更中性可说“the mother of his child/children”。"]}
{"word":"BMA","summary":{"en":"“BMA” is an acronym most commonly meaning the British Medical Association; it can also mean bone marrow aspirate (medicine) or Bank Negara Malaysia (Malaysia’s central bank), depending on context.","zh":"“BMA”是一个缩写，最常见指英国医学会；也可能指医学中的骨髓抽吸物，或马来西亚国家银行，需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(acronym) British Medical Association: the main professional association and trade union for doctors in the United Kingdom.","zh":"（缩写）英国医学会：英国医生的主要专业协会与工会组织。"},"examples":[{"en":"The BMA issued new guidance on patient safety.","zh":"英国医学会（BMA）发布了关于患者安全的新指导意见。"},{"en":"Many UK doctors are members of the BMA.","zh":"许多英国医生都是英国医学会（BMA）的成员。"}]},{"partOfSpeech":"other","definition":{"en":"(acronym, medicine) bone marrow aspirate: a sample of bone marrow fluid taken for medical testing.","zh":"（缩写，医学）骨髓抽吸物：为医学检查而抽取的骨髓液样本。"},"examples":[{"en":"The lab analyzed the BMA to check for infection.","zh":"实验室分析了骨髓抽吸物（BMA）以检查是否感染。"},{"en":"BMA results helped the doctor confirm the diagnosis.","zh":"骨髓抽吸物（BMA）的结果帮助医生确认了诊断。"}]},{"partOfSpeech":"other","definition":{"en":"(acronym, Malaysia) Bank Negara Malaysia: Malaysia’s central bank.","zh":"（缩写，马来西亚）马来西亚国家银行：马来西亚的中央银行。"},"examples":[{"en":"The BMA announced an interest-rate decision.","zh":"马来西亚国家银行（BMA）公布了利率决定。"},{"en":"Reports from the BMA influenced the currency market.","zh":"马来西亚国家银行（BMA）的报告影响了外汇市场。"}]}],"synonyms":["acronym"],"phonetic":"/ˌbiː.ɛmˈeɪ/","extraExplanation":["“BMA”在英文里最常见的指代通常是 British Medical Association（英国医学会），尤其在英国新闻、医疗政策或医生罢工等话题中经常出现。","在医学文献里，“BMA”也常被用作 bone marrow aspirate（骨髓抽吸物）的缩写；但在不同医院/论文中缩写习惯可能不同，阅读时要看上下文。","缩写通常不止一个含义；如果你告诉我你看到它的句子或领域（医学/金融/学校/公司等），我可以帮你精准判断是哪一种。"]}
{"word":"BMarE","summary":{"en":"“BMarE” is not a common English word; it’s probably an acronym that needs context to interpret.","zh":"“BMarE”不是常见英语单词；很可能是缩略词，需要语境才能确定含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most likely an acronym/initialism. Without context, its meaning cannot be identified reliably.","zh":"不是标准英语单词；更可能是一个首字母缩略词/首字母读音词。缺少语境时无法可靠判断具体含义。"},"examples":[{"en":"I saw “BMarE” in the notes, but the document didn’t explain what it stands for.","zh":"我在笔记里看到“BMarE”，但文件没有说明它代表什么。"},{"en":"Could you tell me what “BMarE” means in your class/work context?","zh":"你能告诉我“BMarE”在你的课堂/工作语境里是什么意思吗？"}]}],"synonyms":["initialism","acronym"],"phonetic":"/biː ɛm ɑr iː/","extraExplanation":["英语里很多大写字母组合属于“缩略词/首字母词”（acronym/initialism），通常必须依赖领域与上下文（比如医学、游戏、公司内部系统）才能确定含义。","如果你把它出现的句子、所在领域（例如：课程、论文、聊天、软件界面）发我，我可以帮你锁定最可能的展开形式与对应中文解释。"]}
{"word":"BME","summary":{"en":"BME is an abbreviation most commonly meaning “biomedical engineering,” and in UK contexts it can also mean “Black and Minority Ethnic.”","zh":"BME是一个缩写，最常见指“生物医学工程”；在英国语境中也可指“黑人与少数族裔”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) biomedical engineering; the field that applies engineering principles to medicine and biology (e.g., designing medical devices).","zh":"（缩写）生物医学工程；将工程学原理应用于医学与生物学的领域（如设计医疗器械）。"},"examples":[{"en":"She studied BME and now designs artificial joints.","zh":"她学的是BME（生物医学工程），现在设计人工关节。"},{"en":"Many universities offer a BME major for students interested in health technology.","zh":"许多大学为对健康科技感兴趣的学生开设BME专业。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., mainly UK) Black and Minority Ethnic; a term used in British contexts to refer to Black people and other minority ethnic groups.","zh":"（缩写，主要在英国）黑人与少数族裔；英国语境中指黑人及其他少数族裔群体的用语。"},"examples":[{"en":"The report compares outcomes for BME students and non-BME students.","zh":"这份报告比较了BME学生与非BME学生的结果。"},{"en":"The school created support programs for BME communities.","zh":"学校为BME社区设立了支持项目。"}]}],"synonyms":["biomedical engineering","Black and Minority Ethnic"],"phonetic":"/ˌbiː ɛm ˈiː/","extraExplanation":["“BME”是缩写，具体含义高度依赖语境：在理工科/大学专业里最常见的是“Biomedical Engineering（生物医学工程）”；在英国的教育、医疗、政策与新闻语境里常见的是“Black and Minority Ethnic”。","英国近年来也常用“ethnic minorities（少数族裔）”“racialised minorities（被种族化的少数群体）”等更具体的说法来替代或补充“BME”，因为“BME”有时被认为过于笼统。"]}
{"word":"BMEd","summary":{"en":"BMEd is an abbreviation most often meaning “Bachelor of Music Education,” but in some contexts it can mean “Bachelor of Medical Education.”","zh":"BMEd是一个缩写，最常见指“音乐教育学士”，但在某些语境下也可能指“医学教育学士”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Bachelor of Music Education: an undergraduate degree for training music teachers (often for primary/secondary schools).","zh":"（缩写）音乐教育学士：培养音乐教师（常见于中小学教育方向）的本科学位。"},"examples":[{"en":"She earned a BMEd and now teaches choir at a public high school.","zh":"她取得了BMEd学位，现在在一所公立高中教合唱。"},{"en":"The BMEd program includes conducting, music theory, and classroom methods.","zh":"BMEd项目通常包括指挥、乐理和课堂教学法。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., less common) Bachelor of Medical Education: a degree/program focused on training people to teach or design medical education (usage depends on country and institution).","zh":"（缩写，较少见）医学教育学士：侧重培养医学教育的教学与课程设计人才（各国与学校用法不一）。"},"examples":[{"en":"In that university’s catalog, BMEd refers to Bachelor of Medical Education.","zh":"在那所大学的课程目录里，BMEd指的是“医学教育学士”。"},{"en":"He worked in curriculum development after completing his BMEd.","zh":"他完成BMEd后从事课程开发工作。"}]}],"synonyms":["B.M.Ed.","BMusEd (Bachelor of Music Education)","B.Ed. (Bachelor of Education)","M.Ed. (Master of Education)"],"phonetic":"/ˌbiː ˌɛm ˈɛd/","extraExplanation":["BMEd不是全球统一的标准缩写：不同国家/学校可能用它表示不同学位。看到“BMEd”时，最好结合上下文（学校官网、专业名称、所在国家）确认具体含义。","书写上常见变体有BMEd、B.M.Ed.；有些学校也会用更明确的缩写，如BMusEd（Music Education）或与B.Ed./M.Ed.并列使用。"]}
{"word":"BMet","summary":{"en":"BMet is an abbreviation, most often meaning “Bachelor of Meteorology,” but the exact meaning depends on the institution or context.","zh":"BMet是一个缩写，最常见指“气象学学士（Bachelor of Meteorology）”，但具体含义取决于机构或语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) a written abbreviation that can refer to a specific program or degree, most commonly “Bachelor of Meteorology” in some universities.","zh":"（缩写）书面缩写，常见可指某些大学的“气象学学士（Bachelor of Meteorology）”等具体项目或学位名称。"},"examples":[{"en":"She is applying for the BMet program because she wants to study weather forecasting.","zh":"她正在申请BMet项目，因为她想学习天气预报。"},{"en":"His CV lists a BMet from an Australian university.","zh":"他的简历上写着他在澳大利亚一所大学获得了BMet学位。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) in some contexts, a short form used for “meteorology/meteorological” in course codes, internal documents, or organizational labels (meaning depends on the institution).","zh":"（缩写）在一些语境中，用作“气象学/气象的（meteorology/meteorological）”的简写，常见于课程代码、内部文件或机构标注（具体含义取决于单位/学校）。"},"examples":[{"en":"Check the BMet module list for next semester’s classes.","zh":"查看下学期的BMet课程模块列表。"},{"en":"The lab is shared by students from BMet and environmental science.","zh":"这个实验室由BMet和环境科学的学生共同使用。"}]}],"synonyms":["Bachelor of Meteorology (full form)"],"phonetic":"/ˌbiːˈmɛt/","extraExplanation":["“BMet”不是一个在日常英语里普遍通用的单词，更常见于特定学校/机构的缩写体系。不同地方可能会把它用作不同专业名称（如气象、冶金等）的简称。若你能提供一句原文或出现的场景（学校、文件类型、国家），我可以帮你更准确判定它具体指什么。"]}
{"word":"BMetE","summary":{"en":"BMetE usually refers to the undergraduate degree “Bachelor of Metallurgical Engineering.”","zh":"BMetE通常指“冶金工程学士”这一本科专业学位。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation that is most commonly used to mean “Bachelor of Metallurgical Engineering,” an undergraduate degree in metallurgy/materials engineering (usage may vary by school or country).","zh":"一个缩写，最常见的含义是“冶金工程学士”（Bachelor of Metallurgical Engineering），指冶金/材料相关的本科学位（不同学校或地区可能有不同用法）。"},"examples":[{"en":"He earned a BMetE and now works at a steel plant.","zh":"他拿到了冶金工程学士学位，现在在一家钢厂工作。"},{"en":"The university lists BMetE under its engineering undergraduate programs.","zh":"这所大学在工科本科项目里列出了BMetE（冶金工程学士）。"}]}],"phonetic":"/ˌbiːˌɛmˌiːˌtiːˈiː/","extraExplanation":["“BMetE”属于学位缩写：B = Bachelor（学士），Met = Metallurgical（冶金的），E = Engineering（工程）。不同院校也可能写作 B.Met.Eng.、BMetEng 或 BEng (Metallurgical).","如果你是在简历、成绩单或招生简章里看到它，最稳妥的做法是查看该文件的“缩写说明/项目名称”，因为同一缩写在不同机构偶尔会指向不同专业。"]}
{"word":"BMEWS","summary":{"en":"“BMEWS” is not a standard English word; it is likely a misspelling of “bemuse,” meaning to confuse (often mildly) or, less commonly, to amuse.","zh":"“BMEWS”不是标准英文单词；很可能是“bemuse”的误拼，意思多为“使困惑/茫然”，较少见时也可指“逗乐、使愉快地打发时间”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to confuse someone, often in a slightly amused or puzzled way","zh":"使（某人）困惑；（常带一点好笑或疑惑的感觉）让人摸不着头脑"},"examples":[{"en":"The sudden change in plans bemused everyone in the room.","zh":"计划突然改变，让屋里每个人都很困惑。"},{"en":"She looked bemused by his question, as if she didn’t understand why he asked it.","zh":"她被他的问题弄得一脸疑惑，仿佛不明白他为什么要这么问。"}]},{"partOfSpeech":"vt.","definition":{"en":"to keep someone’s attention pleasantly occupied; to entertain (slightly old-fashioned)","zh":"使（某人）愉快地打发时间；逗乐（略偏旧式用法）"},"examples":[{"en":"He tried to bemuse the children with silly stories during the long trip.","zh":"长途旅行中，他用一些傻傻的故事来逗孩子们开心、打发时间。"}]}],"synonyms":["confuse","puzzle","baffle","bewilder","perplex"],"phonetic":"/bɪˈmjuːz/","extraExplanation":["“BMEWS”并不是常见的英文单词拼写；很可能是把“bemuse”误写成了看起来像“B + mews”的形式。","词义上，“bemuse”最常用来表示“让人困惑/茫然”，常见搭配有：a bemused look（困惑的表情）、bemused by（对……感到困惑）。"]}
{"word":"BMG","summary":{"en":"BMG most commonly means a record company (Bertelsmann Music Group) or, in firearms contexts, “Browning Machine Gun” (as in .50 BMG).","zh":"BMG最常见指唱片公司（Bertelsmann Music Group），或在枪械语境中指Browning Machine Gun（如.50 BMG）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Bertelsmann Music Group, a major international record company (especially well known in the 1990s–2000s).","zh":"（缩写）博德曼音乐集团（Bertelsmann Music Group），一家大型国际唱片公司（在1990—2000年代尤为知名）。"},"examples":[{"en":"This album was released under BMG in the early 2000s.","zh":"这张专辑在2000年代初由BMG发行。"},{"en":"She signed a publishing deal with BMG.","zh":"她与BMG签了出版合约。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Browning Machine Gun; often seen in “.50 BMG,” a powerful rifle/machine-gun cartridge associated with the Browning .50-caliber design.","zh":"（缩写）勃朗宁机枪（Browning Machine Gun）；常见于“.50 BMG”，指与勃朗宁.50口径设计相关的一种大威力机枪/步枪弹药。"},"examples":[{"en":"The report mentioned .50 BMG ammunition.","zh":"报告中提到了.50 BMG弹药。"},{"en":"In some contexts, BMG refers to the Browning Machine Gun design.","zh":"在一些语境中，BMG指勃朗宁机枪的设计。"}]}],"synonyms":["initialism","abbreviation","Bertelsmann Music Group","Browning Machine Gun",".50 BMG"],"phonetic":"/biː ɛm dʒiː/","extraExplanation":["“BMG”是首字母缩写，具体含义高度依赖语境：音乐新闻里多指唱片公司Bertelsmann Music Group；军警、枪械或弹药语境里常与“.50 BMG”连用。","容易与“BGM”（background music，背景音乐）混淆；“背景音乐”的常见缩写是BGM，不是BMG。"]}
{"word":"BMgtE","summary":{"en":"BMgtE is a school-specific abbreviation for a bachelor’s degree in management; the exact expansion depends on the institution.","zh":"BMgtE 是某些学校用于“管理”类本科学位的缩写，具体全称取决于该校。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation (usually written as B.Mgt.E. or BMgtE) used by some schools to name a bachelor’s degree in management; the exact full title varies by institution (for example, “Bachelor of Management and Economics” or “Bachelor of Management Engineering”).","zh":"一个缩写（常写作 B.Mgt.E. 或 BMgtE），用于某些学校的学士学位名称，表示“管理”相关的本科学位；具体全称因学校而异（例如“管理与经济学学士”或“管理工程学士”）。"},"examples":[{"en":"Her CV lists a BMgtE from 2022, but the university spells out the full degree name on the transcript.","zh":"她的简历写着 2022 年获得 BMgtE，但学校在成绩单上会把学位全称写出来。"},{"en":"If you write “BMgtE,” add the full program name the first time so international readers understand it.","zh":"如果你写“BMgtE”，第一次出现时最好补上项目全称，方便国际读者理解。"}]}],"synonyms":["B.Mgt.E.","B.Mgt."],"phonetic":"/ˌbiː ˌɛm dʒiː ˈtiː ˈiː/","extraExplanation":["这是一个“机构/学校自定义缩写”，不像 MBA、BA 那样全球通用。看到 BMgtE 时，最可靠的做法是：查看该学校官网、成绩单或项目简介中的英文全称。","读法通常是把字母一个个念出来（B-M-g-t-E），在正式写作中也常加上句点：B.Mgt.E.。"]}
{"word":"BMHCA","summary":{"en":"“BMHCA” is an unclear, non-standard acronym in general English; its meaning depends on context.","zh":"“BMHCA”在通用英语中不是固定标准缩写；含义需要结合上下文判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An acronym that is not widely standardized in general English; its meaning depends on the specific field (healthcare, education, business, etc.) and the organization using it.","zh":"一个在通用英语中并不统一标准化的缩写；具体含义取决于所属领域（医疗、教育、商业等）以及使用它的机构。"},"examples":[{"en":"I saw “BMHCA” in the report, but the document didn’t define it—can you tell me what it stands for?","zh":"我在报告里看到“BMHCA”，但文件没有解释——你能告诉我它代表什么吗？"},{"en":"In different workplaces, “BMHCA” may refer to different programs or agencies, so context matters.","zh":"在不同单位里，“BMHCA”可能指不同的项目或机构，所以要看上下文。"}]}],"synonyms":["abbreviation","acronym","initialism"],"phonetic":"/ˌbiːˌɛmˌeɪtʃˌsiːˈeɪ/","extraExplanation":["“BMHCA”不是像“USA”“CEO”那样在英语里普遍固定的缩写。我需要一点上下文才能准确释义：你是在哪里看到的（邮件、课程、医院文件、政府网站、公司系统）？完整句子或相关段落也可以。","常见做法：查看该文件的“Abbreviations/Glossary（缩写/术语表）”；或在首次出现处寻找括号解释（例如：BMHCA (….)）。如果你把那一句贴出来，我可以帮你判断最可能的展开形式与中文对应。"]}
{"word":"BMI","summary":{"en":"BMI = body mass index, a height-and-weight number used to estimate weight status.","zh":"BMI 指身体质量指数，是用身高和体重计算的数值，用来粗略评估体重状况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Body mass index: a number used to estimate whether a person’s weight is healthy for their height.","zh":"身体质量指数：用身高和体重计算出的数值，用来粗略判断体重是否在相对健康的范围内。"},"examples":[{"en":"My BMI is 23, so my doctor says my weight is in a healthy range.","zh":"我的 BMI 是 23，所以医生说我的体重在健康范围内。"},{"en":"BMI is often used in health checkups, but it doesn’t tell the whole story.","zh":"BMI 常用于体检，但它并不能说明全部情况。"}]}],"synonyms":["body mass index"],"phonetic":"/ˌbiː ɛm ˈaɪ/","extraExplanation":["BMI 的计算方式：BMI = 体重(公斤) ÷ 身高(米)²。比如 70kg、1.75m：70 ÷ (1.75²) ≈ 22.9。","常见成人参考范围（不同机构/国家可能略有差异）：<18.5 偏瘦；18.5–24.9 正常；25–29.9 超重；≥30 肥胖。","局限性：BMI 不区分脂肪与肌肉，也不能反映脂肪分布；对运动员、老年人、青少年或部分族群可能不够准确，通常会结合腰围、体脂率等指标一起看。","书写与读法：多写作 BMI（全大写）；口语中常读作字母 “B-M-I”。"]}
{"word":"BMJ","summary":{"en":"BMJ is a well-known international medical journal (The BMJ), formerly called the British Medical Journal.","zh":"BMJ 指国际知名医学期刊《The BMJ》，过去常称《British Medical Journal》。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a major international medical journal published by the British Medical Association; its full name was formerly British Medical Journal, and it is now branded as The BMJ","zh":"国际知名医学期刊，由英国医学会出版；全称过去常写作 British Medical Journal，现在多以 The BMJ 为品牌名称"},"examples":[{"en":"The study was published in BMJ in 2021.","zh":"这项研究于 2021 年发表在《BMJ》上。"},{"en":"I found the clinical guidelines on The BMJ website.","zh":"我在《The BMJ》官网上找到了临床指南。"},{"en":"Please cite the BMJ article in APA format.","zh":"请用 APA 格式引用这篇《BMJ》的文章。"}]}],"synonyms":["The BMJ","British Medical Journal"],"phonetic":"/ˌbiː em ˈdʒeɪ/","extraExplanation":["学术写作中常直接写 “BMJ” 或 “The BMJ”。在参考文献里，它通常作为期刊名出现（例如：BMJ 或 The BMJ），具体写法取决于期刊/引用格式要求。","BMJ 以循证医学、临床研究、评论与社论闻名；在医学新闻与公共卫生议题上也有较大影响。"]}
{"word":"BMO","summary":{"en":"BMO most commonly means Bank of Montreal; it can also refer to the robot character BMO in Adventure Time.","zh":"BMO 最常见指蒙特利尔银行；也可能指《探险活宝》里的机器人角色 BMO。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(initialism) Bank of Montreal, a major Canadian bank (often branded as “BMO”).","zh":"（缩写）蒙特利尔银行，加拿大大型银行之一（常用品牌名“BMO”）。"},"examples":[{"en":"BMO is one of Canada’s oldest banks.","zh":"BMO 是加拿大历史最悠久的银行之一。"},{"en":"She opened a checking account at BMO.","zh":"她在 BMO 开了一个支票账户。"}]},{"partOfSpeech":"n.","definition":{"en":"(initialism, pop culture) BMO, a small robot character in the animated TV series Adventure Time.","zh":"（缩写，流行文化）《探险活宝》（Adventure Time）中的小机器人角色 BMO。"},"examples":[{"en":"My favorite character in Adventure Time is BMO.","zh":"我在《探险活宝》里最喜欢的角色是 BMO。"},{"en":"BMO is often shown playing games and making videos.","zh":"BMO 经常被画成在玩游戏和拍视频。"}]}],"synonyms":["Bank of Montreal"],"phonetic":"/ˌbiː ɛm ˈoʊ/","extraExplanation":["“BMO”是字母缩写，口语中通常逐个读作“B‑M‑O”（而不是读成一个单词）。","在金融语境里，“BMO”几乎总是指 Bank of Montreal；在社交媒体/二次元语境里，也常指《探险活宝》的角色。看到缩写时，最好结合上下文判断含义。"]}
{"word":"BMOC","summary":{"en":"BMOC means “big man on campus”: a socially important or influential person, often said with humor or criticism.","zh":"BMOC 指“校园里的大人物/风云人物”，常带调侃或讽刺语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an important, popular, or influential person in a school or social group; someone who acts like a “big shot” (often used humorously or critically).","zh":"（非正式）在学校或某个圈子里很有名、很有影响力的人；自以为“很了不起的大人物”（常带调侃或批评意味）。"},"examples":[{"en":"He acted like the BMOC after winning the game.","zh":"他赢了比赛后就表现得像校园里的“大人物”一样。"},{"en":"She’s not trying to be the BMOC—she just works hard and people respect her.","zh":"她并不是想当什么“风云人物”，只是努力做事，所以大家尊重她。"}]}],"synonyms":["big shot","hotshot","VIP","kingpin","top dog"],"phonetic":"/ˌbiːɛmˌoʊˈsiː/","extraExplanation":["BMOC 是缩写，全称是 “big man on campus”。最早是美国校园俚语，指在校园里特别受关注、很有地位的人（比如明星运动员、学生会领袖等）。","现在也可以更广泛地用在任何小圈子里，意思类似“圈子里的大佬/红人”。语气常带讽刺：强调对方有点自大或爱出风头。"]}
{"word":"BMP","summary":{"en":"BMP most commonly refers to the .bmp bitmap image format; in medicine it can also mean Basic Metabolic Panel, a routine blood test.","zh":"BMP最常见指.bmp位图图像格式；在医学中也可指基础生化检查（Basic Metabolic Panel），一种常规血液检测。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bitmap image file format (usually the “.bmp” file) that stores pictures as pixels; often called a Windows Bitmap","zh":"一种位图图像文件格式（通常为“.bmp”文件），以像素方式保存图片；常被称为Windows位图"},"examples":[{"en":"Can you send the logo as a BMP file?","zh":"你能把标志以BMP文件发给我吗？"},{"en":"BMP images are often larger than JPG because they use less compression.","zh":"BMP图片通常比JPG更大，因为压缩更少。"}]},{"partOfSpeech":"n.","definition":{"en":"(medicine) Basic Metabolic Panel: a common blood test that checks things like blood sugar, electrolytes, and kidney function","zh":"（医学）基础代谢/基础生化检查（Basic Metabolic Panel）：一种常见血液检查，用于查看血糖、电解质以及肾功能等指标"},"examples":[{"en":"The doctor ordered a BMP to check his kidney function.","zh":"医生开了BMP检查来评估他的肾功能。"},{"en":"My BMP results were normal, including sodium and potassium.","zh":"我的BMP结果正常，包括钠和钾。"}]}],"synonyms":["bitmap","Windows bitmap",".bmp file","Basic Metabolic Panel"],"phonetic":"ˌbiː em ˈpiː","extraExplanation":["在电脑语境里，BMP通常指微软Windows早期常用的位图格式之一，优点是结构简单、兼容性强；缺点是文件往往较大，因此在网络分享中更常见的是JPG、PNG等。","在医疗语境里，BMP是医院检验单上常见缩写；不同地区或医院的项目组合可能略有差异，解读应以医生说明为准。"]}
{"word":"BMR","summary":{"en":"BMR means basal metabolic rate: the calories your body burns at rest; it’s often used to estimate daily calorie needs.","zh":"BMR指基础代谢率：身体在静息状态下消耗的热量；也常用于估算每日热量需求。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Basal metabolic rate: the number of calories your body burns at rest to keep basic functions going (like breathing and keeping warm).","zh":"基础代谢率：指人体在安静休息状态下，为维持基本生命活动（如呼吸、体温等）所消耗的热量。"},"examples":[{"en":"My BMR is about 1,500 calories per day, so I burn that much even without exercise.","zh":"我的BMR大约是每天1500千卡，所以即使不运动也会消耗这么多。"},{"en":"A higher BMR often means you burn more energy at rest.","zh":"BMR更高通常表示你在静息时消耗的能量更多。"}]},{"partOfSpeech":"n.","definition":{"en":"(In fitness/health tracking) a measurement used to estimate daily calorie needs, often combined with activity level to calculate total daily energy expenditure (TDEE).","zh":"（健身/健康记录中）用于估算每日热量需求的指标，常与活动水平结合计算每日总能量消耗（TDEE）。"},"examples":[{"en":"The app uses my BMR and activity level to suggest a calorie target for weight loss.","zh":"这个App用我的BMR和活动水平来建议减脂的热量目标。"},{"en":"If you know your BMR, you can plan a diet more accurately.","zh":"如果你知道自己的BMR，就能更准确地制定饮食计划。"}]}],"synonyms":["basal metabolic rate","resting metabolism","resting metabolic rate (RMR)"],"phonetic":"/ˌbiː ɛm ˈɑːr/","extraExplanation":["BMR常被写作“B.M.R.”或直接写“BMR”，口语中一般读作每个字母：B-M-R。","BMR会受年龄、性别、身高体重、肌肉量、睡眠与激素等影响。肌肉量增加通常会让BMR上升。","日常更常用的是TDEE（每日总消耗），大致可理解为：TDEE ≈ BMR × 活动系数；减脂通常需要让摄入热量低于TDEE。"]}
{"word":"BMS","summary":{"en":"BMS most commonly means “battery management system,” but it can also refer to other things (like an academic degree) depending on context.","zh":"BMS 最常见指“电池管理系统”，但也可能在不同语境中表示其他含义（如某些学位项目）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(battery management system) A system (hardware + software) that monitors and controls a rechargeable battery pack, helping it charge safely and work efficiently.","zh":"（电池管理系统）用于监测与控制可充电电池组的软硬件系统，帮助电池安全充电并高效工作。"},"examples":[{"en":"The electric bike’s BMS protects the battery from overcharging.","zh":"电动自行车的 BMS 会防止电池过充。"},{"en":"If the BMS detects overheating, it can reduce power or shut the pack down.","zh":"如果 BMS 检测到过热，它可能会降低功率或关闭电池组。"}]},{"partOfSpeech":"other","definition":{"en":"A common abbreviation for different fields and programs (e.g., “Bachelor of Medical Science”), depending on context.","zh":"在不同领域里常见的缩写（例如“医学学士 Bachelor of Medical Science”），具体含义取决于语境。"},"examples":[{"en":"She completed a BMS before applying to medical school.","zh":"她在申请医学院之前完成了一个 BMS（医学相关本科项目）。"},{"en":"In this email, BMS refers to a university degree, not batteries.","zh":"在这封邮件里，BMS 指的是大学学位，不是电池系统。"}]}],"synonyms":["battery management system","battery monitoring system (sometimes used)"],"phonetic":"/ˌbiː ɛm ˈɛs/","extraExplanation":["在科技/新能源语境中，BMS 最常指“电池管理系统”，在电动车、储能、电动工具、手机/笔记本电池包里都很常见。","判断 BMS 的意思主要看上下文：如果出现 battery、charging、cells、voltage、EV 等词，几乎可以确定是“电池管理系统”；如果出现 degree、major、university，则更可能是学位名称。"]}
{"word":"BMT","summary":{"en":"BMT is an abbreviation most commonly meaning Basic Military Training or Bone Marrow Transplant, depending on context.","zh":"BMT是缩写，最常见指“基础军事训练”或“骨髓移植”，需根据语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Basic Military Training; the initial training period for new members of the armed forces (especially in the U.S. Air Force).","zh":"（常指美国空军的）基础军事训练；新兵入伍后的初期训练阶段。"},"examples":[{"en":"He left for BMT last week and won’t have his phone for a while.","zh":"他上周去参加BMT了，暂时不能用手机。"},{"en":"After BMT, she moved on to technical school.","zh":"BMT结束后，她接着去上技术学校/专业训练。"}]},{"partOfSpeech":"other","definition":{"en":"Bone Marrow Transplant; a medical procedure that replaces unhealthy bone marrow with healthy cells.","zh":"骨髓移植；用健康细胞替换病变骨髓的医疗手术。"},"examples":[{"en":"The doctor said a BMT might be necessary to treat the disease.","zh":"医生说可能需要做BMT来治疗这种疾病。"},{"en":"Recovery after a BMT can take months.","zh":"BMT后的康复可能需要几个月。"}]}],"synonyms":["basic training","boot camp","bone marrow transplant"],"phonetic":"/ˌbiː ɛm ˈtiː/","extraExplanation":["“BMT”是缩写，不同领域含义不同。军队语境里常等同于“basic training（新兵训练）”，尤其在美国空军中常用；医疗语境里常指“bone marrow transplant（骨髓移植）”。","读写时通常按字母逐个念（B-M-T）；聊天或工作邮件里建议第一次出现时写全称，避免误解。"]}
{"word":"BMus","summary":{"en":"BMus is an abbreviation for Bachelor of Music, an undergraduate degree in music.","zh":"BMus 是 Bachelor of Music（音乐学士）的缩写，指音乐类本科大学学位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bachelor of Music: an undergraduate university degree in music (performance, composition, music education, etc.).","zh":"音乐学士：大学本科的音乐学位（如演奏、作曲、音乐教育等方向）。"},"examples":[{"en":"She earned a BMus in piano performance.","zh":"她获得了钢琴演奏方向的音乐学士（BMus）学位。"},{"en":"I’m applying to conservatories that offer a BMus program.","zh":"我正在申请提供音乐学士（BMus）课程的音乐学院。"}]}],"synonyms":["Bachelor of Music","B.Mus.","BM"],"phonetic":"/ˌbiː ˈmjuːz/","extraExplanation":["BMus 常见于英国、加拿大及一些英联邦国家的学校和音乐学院，也可见于其他国家。写法有 BMus、B.Mus.、BM（不同学校缩写略有差异）。","在简历或学术背景里，通常会写成 “BMus (Hons)” 表示荣誉学位（Honours），或在括号里注明专业方向，如 performance / composition / music education。"]}
{"word":"BMusEd","summary":{"en":"BMusEd is an abbreviation for Bachelor of Music Education, a degree for training music teachers.","zh":"BMusEd 是 Bachelor of Music Education（音乐教育学士）的缩写，用于培养音乐教师的学位。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Bachelor of Music Education (a university degree focused on music teaching, often preparing someone to teach music in schools).","zh":"音乐教育学士（大学学位，侧重音乐教学，通常培养在学校教授音乐的能力）。"},"examples":[{"en":"She earned a BMusEd and now teaches choir at a public high school.","zh":"她获得了BMusEd学位，现在在一所公立高中教合唱。"},{"en":"The job posting says a BMusEd or equivalent teaching qualification is preferred.","zh":"招聘信息说优先考虑BMusEd或同等的教师资格。"}]}],"synonyms":["Bachelor of Music Education","B.Mus.Ed.","BME (Music)"],"phonetic":"/biː mjuːz ɛd/","extraExplanation":["BMusEd 是学位缩写，常见于简历、学术文件和学校官网；在不同国家/学校也可能写作 BMEd (Music)、B.M.E.、BME 或 BMus (Ed)。","是否能“当老师”通常还取决于当地教师资格/执照（teaching certification/licensure），仅有学位不一定自动具备任教资格。"]}
{"word":"BMV","summary":{"en":"BMV most commonly means a U.S. state’s Bureau of Motor Vehicles; it can also mean book-to-market value in finance.","zh":"BMV 最常指美国某些州的“机动车辆管理局”；在金融领域也可指“账面市值比”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(in some U.S. states) the Bureau of Motor Vehicles; the government office that handles driver’s licenses, vehicle registration, and license plates.","zh":"（美国部分州）机动车辆管理局；负责驾照、车辆登记和车牌等事务的政府部门。"},"examples":[{"en":"I need to go to the BMV to renew my driver’s license.","zh":"我得去 BMV 更新驾照。"},{"en":"You can register your car at the BMV or online.","zh":"你可以在 BMV 或网上给车做登记。"}]},{"partOfSpeech":"other","definition":{"en":"(finance) book-to-market value (ratio); a measure comparing a company’s book value to its market value.","zh":"（金融）账面市值比（Book-to-Market Value）；用来比较公司的账面价值与市场价值的指标。"},"examples":[{"en":"Some investors look at the BMV ratio to find undervalued stocks.","zh":"一些投资者会看 BMV 比率来寻找被低估的股票。"},{"en":"The firm’s BMV increased as its share price fell.","zh":"随着股价下跌，这家公司的 BMV 上升了。"}]}],"synonyms":["DMV (for the motor-vehicle office)"],"phonetic":"/ˌbiː ɛm ˈviː/","extraExplanation":["在美国，更常见的说法是 DMV（Department of Motor Vehicles），但有些州用 BMV（Bureau of Motor Vehicles）。具体用哪个缩写取决于州政府的命名方式。","作为缩写，BMV 在不同领域可能代表不同意思；如果你告诉我句子或语境，我可以帮你确认最准确的含义。"]}
{"word":"BMW","summary":{"en":"BMW is a German luxury vehicle brand; it also abbreviates the company’s German name, Bayerische Motoren Werke.","zh":"BMW 指德国豪华汽车品牌“宝马”，也可指其德文原名 Bayerische Motoren Werke 的缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a German car and motorcycle manufacturer known for luxury vehicles; the brand name for Bayerische Motoren Werke.","zh":"一家德国汽车与摩托车制造商，以豪华车型闻名；其品牌名来自 Bayerische Motoren Werke（巴伐利亚发动机制造厂）。"},"examples":[{"en":"He drives a BMW to work every day.","zh":"他每天开一辆宝马去上班。"},{"en":"BMW is famous for sporty sedans and SUVs.","zh":"宝马以运动型轿车和 SUV（运动型多用途车）出名。"}]},{"partOfSpeech":"n.","definition":{"en":"the abbreviation for Bayerische Motoren Werke (the company’s original German name).","zh":"Bayerische Motoren Werke 的缩写（该公司的德文原名）。"},"examples":[{"en":"BMW stands for Bayerische Motoren Werke.","zh":"BMW 是 Bayerische Motoren Werke 的缩写。"}]}],"synonyms":["Bayerische Motoren Werke","Beemer","Bimmer"],"phonetic":"/ˌbiː ɛm ˈdʌbəl.juː/","extraExplanation":["在日常口语里，BMW 常被直接当作品牌名使用；英语里通常说“a BMW”（一辆宝马）。","口语昵称：Beemer/Beamer 常泛指宝马汽车或摩托；Bimmer 在北美更常专指宝马汽车（这两个词都很口语化，正式写作仍用 BMW）。"]}
{"word":"BMWs","summary":{"en":"BMWs = more than one BMW car.","zh":"BMWs 表示多辆宝马（BMW）汽车。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of BMW: cars made by the German company BMW (a luxury/performance car brand).","zh":"BMW 的复数：指德国品牌宝马（BMW）生产的汽车（常见为豪华/性能车）。"},"examples":[{"en":"There were three BMWs parked outside the hotel.","zh":"酒店外面停着三辆宝马。"},{"en":"In the 1990s, BMWs became especially popular with young professionals in some cities.","zh":"在一些城市里，20世纪90年代宝马在年轻职业人士中尤其受欢迎。"}]}],"synonyms":["Beemers (informal)","Bimmers (informal)"],"phonetic":"ˌbiː.ɛnˈdʌb.əl.juːz","extraExplanation":["BMW 是缩写，来自德语 Bayerische Motoren Werke，常译为“巴伐利亚发动机制造厂/公司”。","写作复数时通常直接加 -s：BMWs。口语里也常用昵称 Beemer/Beamer（复数 Beemers）。注意：很多车迷更偏好用“Bimmer”指汽车，用“Beemer”指摩托车，但日常交流中两者常被混用。"]}

