{"word":"BO","summary":{"en":"“BO” most commonly means body odor; it can also mean box office in entertainment contexts.","zh":"“BO”最常指体味；在影视/演出语境中也可指售票处或票房。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"body odor; an unpleasant smell from a person’s body (especially from sweating)","zh":"体味；（尤指出汗后）人体散发的难闻气味"},"examples":[{"en":"After the workout, I worried I had BO, so I took a quick shower.","zh":"锻炼后我担心自己有体味，所以赶紧冲了个澡。"},{"en":"This deodorant helps prevent BO during the day.","zh":"这款止汗香体产品能帮助减少一天中的体味。"}]},{"partOfSpeech":"n.","definition":{"en":"box office; the place or system where tickets are sold, or the money a movie/play earns from ticket sales","zh":"售票处；票房（电影/戏剧的票房收入）"},"examples":[{"en":"You can buy tickets at the BO or online.","zh":"你可以在售票处或网上买票。"},{"en":"The film did well at the BO this weekend.","zh":"这部电影这周末票房表现不错。"}]},{"partOfSpeech":"other","definition":{"en":"(spoken as “B-O”) an abbreviation used in names/titles, labels, or informal notes (meaning depends on context)","zh":"（读作“B-O”）缩写，用于头衔/标签/便条等；具体含义取决于语境"},"examples":[{"en":"The memo said “Ask the BO for approval,” but I needed more context to know what BO meant.","zh":"便条上写着“让BO批准”，但我需要更多上下文才能确定BO指什么。"}]}],"synonyms":["body odor","odor","smell","box office"],"phonetic":"ˌbiːˈoʊ","extraExplanation":["“BO”表示“体味”时很常见、也比较口语化，带一点尴尬或不礼貌的感觉。更委婉的说法有：“body odor”本身（更正式）、或用“odor/smell”加上“after working out”等情境说明。","表示“票房/售票处”的“BO”多见于媒体、影评或工作场合的简写；口语里更常直接说“box office”。"]}
{"word":"bo","summary":{"en":"“BO / B.O.” most commonly means body odor; it can also mean box office, and “Bo” is used as a name.","zh":"“BO / B.O.”最常见意思是“体味”；也可指“票房”；“Bo”也可作为人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, abbreviation) body odor; an unpleasant smell from someone’s body, especially from sweating.","zh":"（非正式，缩写）体味；（多指出汗后）人体散发的难闻气味。"},"examples":[{"en":"After the workout, I had really bad B.O., so I took a shower right away.","zh":"锻炼后我体味很重，所以马上去洗澡了。"},{"en":"He put on deodorant to prevent B.O. during the hot day.","zh":"他涂了止汗除臭剂，防止在炎热天气里有体味。"}]},{"partOfSpeech":"n.","definition":{"en":"(business/entertainment, abbreviation) box office; ticket sales for a movie or show.","zh":"（商业/娱乐，缩写）票房；电影或演出的售票收入。"},"examples":[{"en":"The movie did well at the B.O. in its first weekend.","zh":"这部电影首周末票房表现很好。"},{"en":"They’re tracking B.O. numbers to see if the film is a hit.","zh":"他们在追踪票房数据，看这部片子是否会大卖。"}]},{"partOfSpeech":"other","definition":{"en":"a given name or nickname (often male), e.g., Bo; also used in many languages as a transliterated name.","zh":"人名或昵称（常见男性名）Bo；也常作为多种语言名字的音译写法。"},"examples":[{"en":"Bo is short for names like Beau or Boaz in some families.","zh":"在一些家庭里，Bo 可能是 Beau 或 Boaz 等名字的简称。"},{"en":"I met a guy named Bo at the conference.","zh":"我在会议上认识了一个叫 Bo 的人。"}]}],"synonyms":["body odor","odor (smell)","box office"],"phonetic":"/ˌbiˈoʊ/","extraExplanation":["“B.O.”通常写作带点的缩写（B.O.），口语里也有人直接写/说成“BO”。表示“体味”时略带尴尬或不礼貌语气，更委婉的说法有“body odor”或“need deodorant”。","“B.O.”表示“票房”时，多见于新闻、影评和行业讨论（box office 的缩写）。"]}
{"word":"Bo-Bo","summary":{"en":"Bo-Bo is most commonly a cute nickname; in some contexts, bobo can also mean a “bourgeois bohemian.”","zh":"Bo-Bo 最常见是可爱的昵称；在某些语境中，bobo 也可指“中产文艺青年/布尔乔亚波希米亚人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a nickname for someone named Bo (or names like Robert/Beau), or a playful personal name used for a child or pet","zh":"（人名）Bo 的昵称；也可作对孩子或宠物的可爱称呼"},"examples":[{"en":"Bo-Bo, come here and say hello.","zh":"Bo-Bo，过来打个招呼。"},{"en":"Everyone calls him Bo-Bo at home.","zh":"在家里大家都叫他 Bo-Bo。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang, mainly in French-influenced contexts) a “bourgeois bohemian”: someone who has a comfortable middle-class life but likes bohemian/arts-y style and values","zh":"（俚语，多见于受法语影响的语境）“布尔乔亚波希米亚人”：生活富足的中产阶级，却喜欢文艺/波希米亚风格与价值观的人"},"examples":[{"en":"The neighborhood has become full of bobos—nice apartments, artisan coffee, and art galleries.","zh":"这个街区变得很“bobo”：公寓很漂亮、手工咖啡店和画廊到处都是。"},{"en":"He’s a classic bobo: corporate job by day, indie music at night.","zh":"他很典型的 bobo：白天企业上班，晚上听独立音乐。"}]}],"synonyms":["nickname","pet name","bobo (bourgeois bohemian)"],"phonetic":"/ˈboʊboʊ/","extraExplanation":["“Bo-Bo”在英语里常见于昵称（尤其是对小孩、家人或宠物的亲昵称呼）。如果你想表达“小伤口/小失误”，英语里更常写作“boo-boo”（如：I have a boo-boo. 我受了点小伤）。","“bobo（不一定写连字符）”作为“bourgeois bohemian”来自法语文化语境，常用于描述某些城市阶层与生活方式（例如追求有机食品、精品咖啡、艺术与设计，同时经济条件较好）。"]}
{"word":"Bo-gum","summary":{"en":"Bo-gum is a Korean name element, most commonly referring to the celebrity Park Bo-gum.","zh":"Bo-gum 是韩语人名成分，最常用于指代艺人朴宝剑（Park Bo-gum）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A Korean given name used in the stage name Park Bo-gum (박보검), a South Korean actor and singer.","zh":"韩语名字的一部分，常见于艺名“朴宝剑（Park Bo-gum / 박보검）”，他是韩国演员与歌手。"},"examples":[{"en":"Bo-gum is best known for starring in Korean dramas and films.","zh":"Bo-gum 因出演韩剧和电影而广为人知。"},{"en":"Many fans first learned the name Bo-gum through the actor Park Bo-gum.","zh":"很多粉丝最初是通过演员朴宝剑（Park Bo-gum）认识 Bo-gum 这个名字的。"}]}],"synonyms":["Park Bo-gum","Bogum","박보검"],"phonetic":"/ˈboʊ ˌɡʌm/","extraExplanation":["“Bo-gum”通常是罗马字拼写（把韩文写成拉丁字母）。英文媒体里常见连字符写法“Bo-gum”，也有人写作“Bogum”。作为人名成分，首字母常大写。","在正式场合更常写全名“Park Bo-gum”。如果你是在影视、粉丝文化或新闻语境看到“Bo-gum”，多半指这位艺人，而不是普通英语词汇。"]}
{"word":"Bo-peep","summary":{"en":"Bo-Peep is best known as the shepherdess from the nursery rhyme “Little Bo-Peep,” and it can also mean the old-fashioned word for the game “peekaboo.”","zh":"Bo-Peep 最常指童谣《小波·皮普》里的小牧羊女；也可作较旧用法，表示“躲猫猫/peekaboo”游戏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a character in the English nursery rhyme “Little Bo-Peep,” usually shown as a young shepherdess who loses her sheep","zh":"英国童谣《小波·皮普（Little Bo-Peep）》中的人物，通常被描绘成弄丢羊群的小牧羊女"},"examples":[{"en":"My niece loves the nursery rhyme about Little Bo-Peep and her lost sheep.","zh":"我侄女很喜欢《小波·皮普》这首讲小牧羊女丢了羊的童谣。"},{"en":"The costume shop sells a “Bo-Peep” outfit with a shepherd’s crook.","zh":"服装店卖“波·皮普”的装扮，配有牧羊杖。"}]},{"partOfSpeech":"n.","definition":{"en":"(old-fashioned) the children’s game of “peekaboo,” where someone hides and suddenly shows their face to make a child laugh","zh":"（较旧用法）“躲猫猫/躲躲藏藏”的游戏：先把脸藏起来，再突然出现逗小孩笑（类似 peekaboo）"},"examples":[{"en":"Grandpa played bo-peep with the baby behind a newspaper.","zh":"爷爷躲在报纸后面跟宝宝玩躲猫猫。"},{"en":"In some older books, you may see “bo-peep” used for “peekaboo.”","zh":"在一些较老的书里，你可能会看到用 bo-peep 表示 peekaboo。"}]}],"synonyms":["Little Bo-Peep","Bo Peep","peekaboo"],"phonetic":"ˈboʊ ˌpip","extraExplanation":["“Little Bo-Peep” 是英国传统童谣之一，常见于儿童读物与童谣集。故事里她把羊弄丢了，歌词里有一句很有名的劝告：\"Leave them alone, and they'll come home\"（先别管它们，它们会自己回家）。","拼写常见为 Bo-Peep、Bo Peep 或 Bopeep；作为人名/角色名时通常大写。现代流行文化中也常借用该形象（例如动画《玩具总动员》里的 Bo Peep 角色）。"]}

