{"word":"boa","summary":{"en":"Boa can mean a large constrictor snake, or a decorative feather/fur scarf worn around the neck or shoulders.","zh":"Boa 可以指大型缠绕捕食的蟒蛇，也可以指用于装饰的羽毛围巾/毛皮披肩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large constrictor snake (such as a boa constrictor) that kills prey by squeezing it","zh":"（蟒蛇类）大蟒；用身体缠绕挤压猎物致死的蛇（如：森蚺/红尾蚺等）"},"examples":[{"en":"We saw a boa at the zoo, coiled around a branch.","zh":"我们在动物园看到一条大蟒，盘在树枝上。"},{"en":"Boas are not venomous, but they are powerful constrictors.","zh":"蟒蛇没有毒，但它们的缠绕力量很强。"}]},{"partOfSpeech":"n.","definition":{"en":"a long fluffy scarf made of feathers or fur, worn for decoration","zh":"羽毛围巾；毛皮披肩（用于装饰的长条围饰）"},"examples":[{"en":"She wore a pink feather boa to the costume party.","zh":"她在化装舞会上戴了一条粉色羽毛围巾。"},{"en":"The singer tossed her boa over her shoulder on stage.","zh":"那位歌手在舞台上把羽毛围巾甩到肩上。"}]}],"synonyms":["boa constrictor","constrictor","feather boa","scarf","stole"],"phonetic":"/ˈboʊə/","extraExplanation":["“boa”作“蟒蛇”时，常出现在词组“boa constrictor”（红尾蚺/缠绕蟒）中；在日常表达里，单说“a boa”也常被理解为“大型蟒蛇”。","“boa”作“羽毛围巾”多带有复古、舞台表演或派对装扮的氛围（如歌舞表演、变装秀、主题派对等），语气偏时尚/戏剧化。"]}
{"word":"Boabdil","summary":{"en":"Boabdil was the last Nasrid ruler of Granada, best known for surrendering the city in 1492.","zh":"波阿卜迪勒是格拉纳达纳斯里王朝最后一位统治者，最著名的事件是1492年交出格拉纳达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the last Muslim (Nasrid) ruler of the Emirate of Granada in Spain (reigned in the late 1400s), remembered for surrendering Granada to the Catholic Monarchs Ferdinand and Isabella in 1492; also called Muhammad XII, or “El Rey Chico” (“the Little King”).","zh":"（人物名）波阿卜迪勒：西班牙格拉纳达埃米尔国（纳斯里王朝）最后一位穆斯林统治者（15世纪末在位），因1492年向天主教双王费尔南多与伊莎贝拉投降、交出格拉纳达而为人所知；亦称穆罕默德十二世（Muhammad XII）或“小国王”（El Rey Chico）。"},"examples":[{"en":"Boabdil surrendered Granada in 1492, marking the end of Muslim rule there.","zh":"波阿卜迪勒于1492年交出格拉纳达，标志着当地穆斯林统治的结束。"},{"en":"In some histories, Boabdil is portrayed as a tragic figure caught between rival factions and powerful enemies.","zh":"在一些历史叙述中，波阿卜迪勒被刻画成夹在内部分裂与强敌之间的悲剧人物。"},{"en":"The name Boabdil often appears in discussions of the Alhambra and the Reconquista.","zh":"“波阿卜迪勒”这个名字常出现在关于阿尔罕布拉宫与“收复失地运动”（Reconquista）的讨论中。"}]}],"synonyms":["Muhammad XII","El Rey Chico"],"phonetic":"/boʊˈɑːbdɪl/","extraExplanation":["“Boabdil”是西班牙语/欧洲史书中对穆罕默德十二世的常见称呼，来自对阿拉伯名字的转写；在英语里多用作历史人物专名。","与他相关的著名传说是“摩尔人的叹息”（El suspiro del Moro / the Moor’s sigh）：据说他离开格拉纳达时回望城池落泪，他的母亲对他说了类似“像女人一样哭泣你无法像男人一样守住的东西”的话。这段话常被引用，但细节带有文学化与后世加工色彩。","在文学与文化中，他常被当作王朝终结、失落与流亡的象征人物；在阅读英文材料时，常与“Granada（格拉纳达）”“Nasrid（纳斯里）”“Alhambra（阿尔罕布拉宫）”“Reconquista（收复失地运动）”等词一起出现。"]}
{"word":"BOAC","summary":{"en":"BOAC was the former U.K. long-haul national airline, later merged into British Airways.","zh":"BOAC是英国曾经的远程国营航空公司，后来并入英国航空。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"British Overseas Airways Corporation: the former U.K. state airline that operated long-distance international flights (1939–1974), later merged into British Airways.","zh":"英国海外航空公司：英国曾经的国营航空公司，主要经营国际远程航线（1939–1974），后并入英国航空（British Airways）。"},"examples":[{"en":"My grandfather flew to India on BOAC in the 1960s.","zh":"我祖父在20世纪60年代乘坐英国海外航空公司（BOAC）飞往印度。"},{"en":"The novel mentions a BOAC flight to show the story is set in the postwar era.","zh":"小说提到一趟BOAC航班，用来表明故事发生在战后年代。"}]}],"synonyms":["British Overseas Airways Corporation","(historical) U.K. national airline","predecessor of British Airways"],"phonetic":"/ˈboʊæk/","extraExplanation":["BOAC常出现在二战后到20世纪70年代的英国语境里：老照片、旅行回忆、电影/小说中用它来制造“复古的国际旅行”氛围。","1974年，BOAC与BEA（British European Airways，英国欧洲航空）合并，形成British Airways（英国航空）。"]}
{"word":"Boadicea","summary":{"en":"Boadicea is another name for Boudicca, a Celtic queen who led an uprising against the Romans in ancient Britain.","zh":"Boadicea 是 Boudicca 的另一种写法，指古不列颠一位领导反抗罗马统治起义的凯尔特女王。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Boadicea (also spelled Boudicca) was a Celtic queen of the Iceni tribe who led a major uprising against Roman rule in Britain around AD 60–61.","zh":"Boadicea（也拼作 Boudicca）是古不列颠凯尔特部落“伊西尼人”（Iceni）的女王，约在公元60—61年领导了反抗罗马统治的著名起义。"},"examples":[{"en":"Boadicea is remembered as a symbol of resistance in British history.","zh":"Boadicea 在英国历史上常被视为反抗与抵抗精神的象征。"},{"en":"We read about Boadicea’s rebellion against the Romans in class.","zh":"我们在课上读到了 Boadicea 反抗罗马人的起义。"}]}],"synonyms":["Boudicca"],"phonetic":"/ˌboʊ.əˈdɪs.i.ə/","extraExplanation":["“Boadicea”是较早期英语里常见的写法；现代历史与学术写作更常用“Boudicca”。两者指同一人物。","在英语文化里，她常被当作勇气、民族抵抗与女性领导力的象征；在文学与公共艺术中也经常出现（例如伦敦有著名的 Boudicca 战车雕像）。"]}
{"word":"Boaedon","summary":{"en":"Boaedon is a scientific genus name for African “house snakes.”","zh":"Boaedon 是非洲“家蛇/屋蛇”的一个科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of mostly African, nonvenomous (or mildly venomous) snakes commonly called “house snakes,” in the family Lamprophiidae","zh":"（生物）博阿埃东属：主要分布于非洲的一属蛇类，常被称为“家蛇/屋蛇”，隶属灯蛇科（Lamprophiidae），一般对人类无毒或毒性很弱"},"examples":[{"en":"Boaedon capensis is often called the Cape house snake.","zh":"Boaedon capensis 常被称为“开普家蛇”。"},{"en":"The researcher recorded a Boaedon species near a rural home, where house snakes often hunt rodents.","zh":"研究人员在乡村住宅附近记录到一种 Boaedon 蛇类；家蛇常在民居周边捕食啮齿动物。"}]}],"synonyms":["house snake","African house snake"],"phonetic":"/boʊˈiːdɑn/","extraExplanation":["“Boaedon”是拉丁化的科学属名，通常首字母大写、斜体书写（如 *Boaedon*）。在日常英语里不常用，更多出现在动物学、野外观察、科普或宠物爬虫相关文本中。","常见的英文俗名是“house snake（家蛇/屋蛇）”。如果你是在文章里看到“Boaedon”，多半是在讨论某个具体物种（如 *Boaedon capensis*）或分类学变更（属名调整）的问题。"]}
{"word":"boaedon","summary":{"en":"Boredom is the feeling of being uninterested or having nothing engaging to do.","zh":"Boredom 指感到不感兴趣或没事可做而产生的无聊、厌倦感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feeling of being tired and uninterested because something is not exciting or has nothing to do","zh":"无聊；厌倦感（因为缺乏兴趣、刺激或事情可做）"},"examples":[{"en":"During the long speech, a sense of boredom spread through the room.","zh":"在那场冗长的演讲中，房间里弥漫着一股无聊感。"},{"en":"He reads on the train to fight boredom.","zh":"他在火车上读书来对抗无聊。"},{"en":"Boredom can make small problems feel bigger than they are.","zh":"无聊会让小问题显得比实际更严重。"}]}],"synonyms":["tedium","monotony","ennui","dullness"],"phonetic":"/ˈbɔrədəm/","extraExplanation":["你输入的“boaedon”看起来像拼写错误；最可能想查的是 **boredom**（无聊）。如果你其实想查别的词（比如人名/品牌/专有名词），告诉我上下文我可以再确认。","词源小贴士：**boredom** 来自形容词 **bored**（感到无聊的）+ 名词后缀 **-om**（表示一种状态，如 *freedom*）。"]}
{"word":"boagane","summary":{"en":"“Boagane” isn’t a standard English word; it is most likely a misspelling of “bargain” (a good deal / to negotiate for a better deal).","zh":"“boagane”不是标准英语单词；很可能是“bargain”的误拼（便宜划算的交易/讨价还价）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely) a good deal; something bought for a lower price than usual.","zh":"（可能想写的是）便宜货；划算的交易（以低于通常价格买到的东西/交易）。"},"examples":[{"en":"I got this jacket for $20—what a bargain!","zh":"我这件夹克只花了20美元——太划算了！"},{"en":"This phone is a real bargain for the price.","zh":"以这个价格来说，这部手机真的很划算。"}]},{"partOfSpeech":"v.","definition":{"en":"(Likely) to negotiate the price or terms; to try to get a better deal.","zh":"（可能想写的是）讨价还价；协商价格或条件，争取更好的交易。"},"examples":[{"en":"You can bargain with the seller at the street market.","zh":"在街市你可以跟卖家讨价还价。"},{"en":"They bargained for a discount before signing the contract.","zh":"他们在签合同前协商争取折扣。"}]}],"synonyms":["deal","steal (informal)","discount","negotiate","haggle"],"phonetic":"/ˈbɑrɡən/","extraExplanation":["“boagane”不是常见的英语单词拼写。我最可能的猜测是你想输入的是 **bargain**（便宜/划算；讨价还价）。\n如果你能提供一句包含“boagane”的原句、或告诉我它来自哪里（聊天、歌词、游戏ID、地名/人名等），我也可以更准确地判断。"]}
{"word":"Boak","summary":{"en":"“Boak” is a Scottish informal word meaning “to vomit/retch,” and it can also mean “vomit.”","zh":"“boak”是苏格兰英语里的非正式用法，意思是“呕吐/干呕”，也可作名词指“呕吐物/一次呕吐”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Scotland, informal) To vomit; to retch.","zh":"（苏格兰英语，非正式）呕吐；干呕。"},"examples":[{"en":"He felt sick and had to boak after the ride.","zh":"他坐完那趟车觉得恶心，不得不吐了。"},{"en":"That smell makes me want to boak.","zh":"那股味道让我想吐。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scotland, informal) Vomit; an act of vomiting.","zh":"（苏格兰英语，非正式）呕吐物；一次呕吐。"},"examples":[{"en":"There was boak on the sidewalk.","zh":"人行道上有一滩呕吐物。"}]}],"synonyms":["vomit","throw up","puke","retch"],"phonetic":"/boʊk/","extraExplanation":["“boak”主要见于苏格兰口语（Scots/Scottish English）。在更通用的美式英语里，人们通常说“vomit”“throw up”（更口语）或“retch”（强调干呕、作呕的动作）。","发音里常见的拼写变体有“boke”。在文学或对白里用“boak”往往能立刻营造明显的苏格兰地域色彩。"]}
{"word":"Boalsburg","summary":{"en":"Boalsburg is a small village in central Pennsylvania, near State College.","zh":"Boalsburg 是美国宾夕法尼亚州中部、靠近 State College 的一个小村镇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small village (census-designated place) in Centre County, Pennsylvania, near State College.","zh":"美国宾夕法尼亚州中部中心县的一个小村镇（人口普查指定地区），靠近州立学院（State College）。"},"examples":[{"en":"Boalsburg is a quiet community just a few miles from Penn State University.","zh":"Boalsburg 是一个安静的社区，离宾夕法尼亚州立大学只有几英里。"},{"en":"We stayed in Boalsburg and drove into State College for the game.","zh":"我们住在 Boalsburg，然后开车去 State College 看比赛。"}]}],"synonyms":["a village near State College, Pennsylvania","Centre County, Pennsylvania"],"phonetic":"/ˈboʊlzˌbɝɡ/","extraExplanation":["Boalsburg 常被称为“纪念日（Memorial Day）的发源地之一”：当地传说在南北战争后，居民曾在墓地举行献花纪念活动，这一传统与后来全国性的 Memorial Day 纪念方式相呼应。","拼写提示：Boalsburg 中的 -burg 常见于地名，表示“城镇/堡/镇”（类似 Pittsburgh、Harrisburg）。"]}
{"word":"Boanbura","summary":{"en":"“Boanbura” is not a recognized English vocabulary word; it’s most likely a proper name or a misspelling/transliteration.","zh":"“Boanbura”不是常见英语词汇；更可能是专有名词，或拼写/音译形式。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not a standard English word) Likely a proper name (a person, place, brand, or username), or a misspelling/transliteration of a word from another language.","zh":"（不是标准英语单词）更可能是专有名词（人名、地名、品牌名或用户名），或来自其他语言的音译/拼写变体。"},"examples":[{"en":"I couldn’t find “Boanbura” in an English dictionary—do you mean a person’s name or a place?","zh":"我在英文词典里找不到“Boanbura”——你指的是人名还是地名？"},{"en":"Could you share a sentence with “Boanbura” so I can explain it accurately?","zh":"你能提供一句包含“Boanbura”的例句吗？这样我才能更准确解释。"}]}],"phonetic":"/boʊ.ænˈbʊrə/","extraExplanation":["这个词在常见英语词典与语料库里不太能检索到，因此更像是：\n1）拼写误差（比如少打/多打字母）；\n2）来自其他语言的音译；\n3）专有名词（人名、地名、品牌/游戏/作品名称）。\n如果你告诉我它出现的语境（哪本书/哪条消息/哪个国家或语言背景），或给出原句/截图，我可以帮你确认读音、含义和更贴切的翻译。"]}
{"word":"boanbura","summary":{"en":"“boanbura” is not a standard English word; it’s likely a misspelling or a proper name. Share context to identify it.","zh":"“boanbura”不是标准英语词；更可能是拼写错误或专有名词。提供上下文可帮你确认含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a recognized English word. It may be a misspelling, a name, or a word from another language.","zh":"不是常见或可查证的英语单词，可能是拼写错误、人名/地名，或来自其他语言。"},"examples":[{"en":"I couldn’t find “boanbura” in an English dictionary—could you share a sentence where you saw it?","zh":"我在英语词典里查不到“boanbura”——你能提供你看到它的句子吗？"},{"en":"If you meant “bonobo,” it refers to a type of ape closely related to chimpanzees.","zh":"如果你想写的是“bonobo（倭黑猩猩）”，它是一种与黑猩猩近亲的类人猿。"}]}],"phonetic":"/boʊænˈbʊrə/","extraExplanation":["我查不到“boanbura”作为标准英语词条。它看起来像是：\n1）拼写误差（比如多打/少打了字母）；\n2）专有名词（人名、网名、品牌、地名、游戏/动漫设定）；\n3）外来语或音译。\n\n你可以把以下信息发我，我就能更准确判断：\n- 你在哪里看到的（书、歌词、游戏、社交媒体等）？\n- 原句/上下文（至少一整句）\n- 你想表达的意思或对应的中文\n\n一些可能的接近词（仅供排查）：boa（蟒蛇/围巾）、boar（野猪）、bonobo（倭黑猩猩）、bona fide（真诚的/可信的，短语）。"]}
{"word":"boanergean","summary":{"en":"Boanergean means thunderously loud and forceful, or related to the biblical “sons of thunder.”","zh":"boanergean 指“如雷般洪亮、有气势”，或与《圣经》中“雷霆之子（Boanerges）”的典故有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of speech or a speaker) Loud, forceful, and thunderous in tone; like a “son of thunder.”","zh":"（指言辞或说话者）声音洪亮、气势强烈、如雷贯耳的；有“雷子/雷霆之子”般的气势。"},"examples":[{"en":"The mayor’s boanergean voice filled the hall without a microphone.","zh":"市长那种boanergean（如雷般）的嗓音不用麦克风也能传遍大厅。"},{"en":"Her boanergean preaching energized the crowd.","zh":"她那种boanergean（充满雷霆气势）的布道点燃了人群的情绪。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the biblical name “Boanerges,” a nickname for James and John meaning “sons of thunder.”","zh":"与《圣经》中“Boanerges（波阿尼革）”有关的；该称呼是耶稣给雅各和约翰的绰号，意为“雷霆之子”。"},"examples":[{"en":"The essay uses boanergean imagery to describe the disciples’ intensity.","zh":"这篇文章用boanergean（“雷霆之子”式的）意象来描写门徒的强烈性格。"}]}],"synonyms":["thunderous","booming","forceful","stentorian","oratorical"],"phonetic":"/boʊˈænərdʒiən/","extraExplanation":["“Boanerges”出自《新约·马可福音》3:17，耶稣称使徒雅各和约翰为“Boanerges”，常译为“雷子/雷霆之子”。因此 boanergean 多用来形容言语或风格“雷霆万钧、声势逼人”。","这个词非常罕见，常见于文学、修辞评论或带圣经典故的写作；日常英语里更常用 thunderous, booming, forceful 等词来表达类似意思。"]}
{"word":"Boanerges","summary":{"en":"Boanerges is the biblical nickname for James and John, meaning “sons of thunder,” and it can also describe a forceful, thunderous speaker.","zh":"Boanerges是《圣经》中耶稣给雅各和约翰的绰号，意为“雷霆之子”；也可引申形容言辞气势如雷、风格强势的演讲者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biblical) A nickname Jesus gave to the brothers James and John, meaning “sons of thunder.”","zh":"（《圣经》）耶稣给兄弟雅各和约翰起的绰号，意思是“雷子/雷霆之子”（直译为“雷之子”）。"},"examples":[{"en":"In the Gospel of Mark, Jesus calls James and John “Boanerges,” meaning “sons of thunder.”","zh":"在《马可福音》中，耶稣称雅各和约翰为“Boanerges”，意思是“雷霆之子”。"},{"en":"The preacher compared the apostles’ boldness to the Boanerges.","zh":"那位传道人把使徒的大胆作风比作“Boanerges”（雷霆之子）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) A person (often a speaker or preacher) known for a forceful, thunderous style.","zh":"（引申）指说话或演讲风格强势、气势如雷的人（常指传道人或演说者）。"},"examples":[{"en":"He was a Boanerges in the courtroom—loud, direct, and hard to ignore.","zh":"在法庭上他像个“Boanerges”——声音洪亮、直截了当，让人无法忽视。"},{"en":"Some reformers were remembered as Boanerges for their fiery speeches.","zh":"有些改革者因其火热激昂的演说而被人称作“Boanerges”。"}]}],"synonyms":["sons of thunder","thunderous speaker","fiery orator"],"phonetic":"/boʊˈænərˌdʒiːz/","extraExplanation":["“Boanerges”来自《新约·马可福音》3:17。这个词在英语中多作为专有名词出现，也可被文学或评论性文字借用来形容“雷霆般的言辞/气势”。","它本身是外来词（源于闪语背景的音译），因此拼写和读音对学习者来说不太“规则”；使用时通常首字母大写。"]}
{"word":"boanerges","summary":{"en":"Boanerges means “sons of thunder,” a biblical nickname for James and John, and can also describe a thunderous, forceful speaker.","zh":"Boanerges意为“雷之子”，是圣经中雅各和约翰的绰号，也可指言辞如雷、强势激烈的演讲者/写作者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a biblical nickname meaning “sons of thunder,” used by Jesus for the apostles James and John (Mark 3:17); by extension, a person known for loud, forceful, or fiery speaking","zh":"圣经中的绰号，意为“雷子/雷之子”，耶稣用来称呼使徒雅各和约翰（《马可福音》3:17）；引申为说话声音大、气势强、言辞激烈的人"},"examples":[{"en":"In Mark 3:17, Jesus calls James and John “Boanerges,” meaning “sons of thunder.”","zh":"在《马可福音》3:17中，耶稣称雅各和约翰为“Boanerges”，意为“雷之子”。"},{"en":"The columnist wrote like a Boanerges, thundering against corruption.","zh":"那位专栏作家写作像个“Boanerges”，猛烈抨击腐败。"}]}],"synonyms":["sons of thunder","thunderer","firebrand","rabble-rouser"],"phonetic":"boʊˈænɚdʒiz","extraExplanation":["“Boanerges”源自亚兰语（经希腊文转写进入英语），常被解释为“sons of thunder（雷之子）”。它在英语中多用于文学/修辞语境，带有宗教典故色彩：用来形容言辞如雷、充满激情或脾气火爆的表达风格。实际写作里通常用作比喻，而不是日常口语常用词。"]}
{"word":"boanergism","summary":{"en":"Boanergism means thunderous, forceful rhetoric or zeal—often loud and emotionally intense.","zh":"Boanergism 指雷霆般强势、情绪浓烈（有时偏激）的言辞或热情。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thunderous, forceful, sometimes aggressive style of speaking or zeal; loud, fiery rhetoric.","zh":"雷霆般、强势（有时带攻击性）的说话方式或热情；言辞激烈、咄咄逼人的修辞风格。"},"examples":[{"en":"The candidate’s speech was pure boanergism—loud, emotional, and aimed at stirring the crowd.","zh":"这位候选人的演讲简直是 boanergism——声音洪亮、情绪激昂，目的就是煽动人群。"},{"en":"The professor warned that boanergism can replace evidence with volume.","zh":"教授警告说，boanergism 可能会用“音量”取代“证据”。"},{"en":"His writing avoids boanergism and relies on calm, clear reasoning.","zh":"他的写作避免 boanergism，而是依靠冷静清晰的论证。"}]}],"synonyms":["thunderous rhetoric","vehemence","bombast","bluster","fiery rhetoric"],"phonetic":"/boʊˈænɚˌdʒɪzəm/","extraExplanation":["这个词非常罕见，常见于较“书面/典故”语境。它来自《圣经·马可福音》3:17 中耶稣给雅各和约翰起的绰号“Boanerges”，常译为“雷子/雷鸣之子（sons of thunder）”，用来形容性格或言辞如雷霆般强烈。","在现代英语里更常用的表达是：thunderous rhetoric（雷霆般的修辞）、bombastic speech（夸张浮夸的演说）、fiery rhetoric（火爆的言辞）、overheated rhetoric（过热/过激的言辞）。"]}
{"word":"boanthropy","summary":{"en":"Boanthropy is a rare delusion in which someone believes they are a cow or ox.","zh":"Boanthropy 指一种罕见的妄想：认为自己是一头牛/公牛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mental condition (a type of delusion) in which a person believes they are a cow or an ox, and may act accordingly (for example, grazing or making cattle-like sounds).","zh":"一种罕见的精神症状（妄想的一种）：患者相信自己是一头牛/公牛，并可能做出相应行为（如低头“吃草”、发出牛叫等）。"},"examples":[{"en":"In a medical case report, the patient showed boanthropy and tried to graze in a field.","zh":"在一篇医学病例报告中，患者出现了牛化妄想，并试图在田里低头“吃草”。"},{"en":"The novel uses boanthropy as a symbol of losing one’s human identity.","zh":"这部小说用“牛化妄想”作为失去人类身份的象征。"}]}],"synonyms":["zoanthropy","delusion","clinical lycanthropy (related term)"],"phonetic":"/boʊˈænθrəpi/","extraExplanation":["词源：来自希腊语 bous（牛）+ anthrōpos（人），字面可理解为“牛—人”。它常被视为 zoanthropy（兽化妄想：认为自己是某种动物）的一种具体类型，类似常见的 lycanthropy（狼化妄想：认为自己是狼）。","用法提示：这是医学/心理学语境中的罕见词，日常英语中几乎不用；写作或讨论时通常需要简短解释，避免读者误解。"]}
{"word":"Boar","summary":{"en":"A boar is a wild pig, especially an adult male, often with tusks.","zh":"boar 指野猪，尤指成年公猪，常有獠牙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wild pig (especially an adult male), often with tusks; also used for the male of domestic pigs","zh":"野猪（尤指成年公猪），通常有獠牙；也可指家猪的公猪"},"examples":[{"en":"A wild boar ran across the road at night.","zh":"一只野猪在夜里跑过马路。"},{"en":"Wild boars use their tusks to dig and to defend themselves.","zh":"野猪会用獠牙挖掘，也用来防卫。"},{"en":"The farmer keeps one boar for breeding.","zh":"农夫养了一头公猪用来配种。"}]}],"synonyms":["wild pig","hog (often for a male pig, especially in American English)"],"phonetic":"/bɔr/","extraExplanation":["“boar”常与“bore（无聊/钻孔）”混淆，发音不同、意思也不同。","在欧洲与东亚文化中，野猪常出现在狩猎故事、神话与纹章里，象征勇猛与力量；英语里也有“boar hunt（猎野猪）”等固定搭配。"]}
{"word":"boar","summary":{"en":"A boar is a wild pig (often an adult male) or a male pig kept for breeding.","zh":"boar 指野猪（常指成年的公野猪），也可指用于繁殖的种公猪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wild pig, especially an adult male; it may have large tusks and can be dangerous","zh":"野猪（尤指成年的公公猪）；可能有大獠牙，具有攻击性"},"examples":[{"en":"We saw a wild boar crossing the road at dusk.","zh":"黄昏时我们看到一头野猪穿过马路。"},{"en":"The boar’s tusks can cause serious injuries.","zh":"野猪的獠牙可能造成严重伤害。"}]},{"partOfSpeech":"n.","definition":{"en":"an adult male pig kept for breeding","zh":"（用于繁殖的）种公猪"},"examples":[{"en":"The farmer bought a boar to improve the herd’s genetics.","zh":"农夫买了一头种公猪来改良猪群的遗传。"},{"en":"Keep the boar in a secure pen.","zh":"把种公猪关在牢固的猪圈里。"}]}],"synonyms":["wild pig","hog (male)","tusker"],"phonetic":"/bɔr/","extraExplanation":["“boar”在文化和文学中常与“狩猎、力量、危险”联系在一起。中世纪欧洲贵族狩猎野猪很常见，因此野猪也常出现在纹章（coat of arms）和传说故事里。","易混淆：boar（野猪/公猪）与 bear（熊）拼写相近但发音和意思不同；也不要与 board（木板/董事会）混淆。"]}
{"word":"boarcite","summary":{"en":"Boracite is a rare mineral (magnesium borate chloride) typically found in salt-deposit rocks.","zh":"Boracite（常被误拼为 boarcite）是一种较少见的矿物（镁硼酸氯化物），多见于盐类蒸发岩沉积中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mineral made of magnesium borate chloride, often found in evaporite (salt-deposit) rocks; it can form clear or white crystals.","zh":"一种矿物（镁硼酸氯化物），常见于蒸发岩（盐类沉积）中，可形成透明或白色晶体。"},"examples":[{"en":"Boracite is sometimes found in salt mines and other evaporite deposits.","zh":"硼镁石有时会在盐矿和其他蒸发岩沉积中被发现。"},{"en":"The museum displayed boracite crystals next to other borate minerals.","zh":"博物馆把硼镁石晶体与其他硼酸盐矿物一起展出。"}]}],"synonyms":["magnesium borate chloride (technical description)"],"phonetic":"/ˈbɔrəˌsaɪt/","extraExplanation":["你输入的“boarcite”更常见的拼写是“boracite”（硼镁石）。英语里这个词属于矿物学用语，日常对话中很少见。","词源上与“borax（硼砂）”同源，borate（硼酸盐）相关的矿物名称常用“bor-”开头。"]}
{"word":"board","summary":{"en":"Board most often means a flat piece of material (especially wood), a decision-making group (a board), a writing/display surface, or as a verb, to get on a vehicle or provide meals/lodging.","zh":"board常见意思包括：板子/木板；（机构的）委员会/董事会；黑板/白板/公告板；作动词指登上交通工具，或提供食宿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flat piece of wood (or another material) used for building, covering, or making things","zh":"（木头或其他材料的）板子；木板；用来建造、覆盖或制作物品的平板"},"examples":[{"en":"He nailed two boards together to fix the shelf.","zh":"他把两块木板钉在一起修架子。"},{"en":"The floor is made of wooden boards.","zh":"地板是由木板铺成的。"}]},{"partOfSpeech":"n.","definition":{"en":"a group of people who manage or make decisions for an organization","zh":"（机构的）委员会；董事会；理事会"},"examples":[{"en":"The board approved the new budget.","zh":"董事会批准了新预算。"},{"en":"She serves on the school board.","zh":"她在学校委员会任职。"}]},{"partOfSpeech":"n.","definition":{"en":"a flat surface used for writing, drawing, or displaying information (for example, a whiteboard or notice board)","zh":"（用于书写、绘画或展示信息的）板；如白板、公告板"},"examples":[{"en":"The teacher wrote the homework on the board.","zh":"老师把作业写在黑板（板子）上。"},{"en":"There’s a notice on the bulletin board.","zh":"公告栏上有一则通知。"}]},{"partOfSpeech":"v.","definition":{"en":"to get on a bus, train, airplane, or ship","zh":"登上（公交、火车、飞机或船）"},"examples":[{"en":"We boarded the plane at 6:30 a.m.","zh":"我们早上6:30登机。"},{"en":"Please board from the rear door.","zh":"请从后门上车。"}]},{"partOfSpeech":"v.","definition":{"en":"to provide meals (and sometimes a place to live), usually for payment","zh":"供膳；（常指付费）提供伙食（有时也包括住宿）"},"examples":[{"en":"The price includes room and board.","zh":"价格包含食宿。"},{"en":"They board international students during the school year.","zh":"他们在学年期间为国际学生提供食宿。"}]}],"synonyms":["plank","panel","committee","council","get on","embark"],"phonetic":"/bɔrd/","extraExplanation":["“board”有好几个常见意思，学习时可用情境来区分：在建筑/木工语境里多指“木板”；在公司或学校管理语境里指“委员会/董事会”；在课堂或办公室里常指“（黑板/白板/公告）板”；在交通语境里作动词是“登上（交通工具）”。","固定搭配：room and board 表示“食宿（膳食+住宿）”。在美式英语中非常常见，常用于学校住宿、租房或项目费用说明。"]}
{"word":"board game","summary":{"en":"A board game is a game played on a board, usually with pieces, cards, or dice.","zh":"board game 指在棋盘/板面上进行的游戏，常配合棋子、卡牌或骰子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A game played on a board (often with pieces, cards, or dice), where players follow rules to compete or cooperate.","zh":"桌游／棋盘游戏：在棋盘上进行的游戏（常配合棋子、卡牌或骰子），玩家按规则对抗或合作。"},"examples":[{"en":"We played a board game after dinner.","zh":"我们晚饭后玩了一款桌游。"},{"en":"Chess is a classic board game.","zh":"国际象棋是一种经典棋盘游戏。"},{"en":"She loves board games like Catan and Ticket to Ride.","zh":"她喜欢《卡坦岛》《车票之旅》这类桌游。"}]}],"synonyms":["tabletop game","parlor game"],"phonetic":"/ˈbɔrd ˌɡeɪm/","extraExplanation":["“board game”一般指在“棋盘/板面”上进行的桌面游戏；中文里常说“桌游”，范围有时更广（也包含纯卡牌游戏、派对游戏等）。英语里“board game”通常强调“有棋盘/板面”。","常见搭配：play a board game（玩桌游）；board game night（桌游之夜/桌游聚会）；strategy board game（策略桌游）；family board game（适合家庭的桌游）。"]}
{"word":"board of directors","summary":{"en":"“Board of directors” means the group that governs and oversees a company or organization and makes major decisions.","zh":"“Board of directors”指负责治理与监督公司或组织、并作出重大决策的董事会。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A group of people elected or appointed to oversee and make major decisions for a company or organization.","zh":"（公司或组织的）董事会：由选举或任命产生的一群人，负责监督并作出重大决策。"},"examples":[{"en":"The board of directors approved the new budget.","zh":"董事会批准了新的预算。"},{"en":"She was invited to join the board of directors of a nonprofit organization.","zh":"她受邀加入一家非营利组织的董事会。"}]},{"partOfSpeech":"phrase","definition":{"en":"The governing body that hires, evaluates, and can replace the CEO or top manager, and represents shareholders’ or members’ interests.","zh":"治理机构：负责任命、评估并可更换CEO或最高管理者，代表股东或成员的利益。"},"examples":[{"en":"The CEO reports to the board of directors every quarter.","zh":"CEO每个季度向董事会汇报。"},{"en":"After the scandal, the board of directors voted to remove the chairperson.","zh":"丑闻发生后，董事会投票罢免了主席。"}]}],"synonyms":["board","the board","governing board","board of trustees (esp. nonprofits/schools)"],"phonetic":"/bɔrd əv dəˈrɛktɚz/","extraExplanation":["在英美公司治理语境中，board of directors 通常区别于 management（管理层）：董事会负责“方向与监督”，管理层负责“日常运营”。","常见相关词：director（董事）、board member（董事会成员）、chair/chairperson（董事会主席/主席）、independent director（独立董事）、board meeting（董事会会议）。","在不同国家/地区，公司可能有不同治理结构：例如有些地方区分“董事会（board）”与“监事会（supervisory board）”。英语里最常见的说法仍是 board of directors。"]}
{"word":"board-built","summary":{"en":"Board-built describes something constructed from wooden boards, often simple or rustic.","zh":"board-built 指用木板搭建或制成的东西，常带有简易、质朴的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"made or constructed using boards (flat pieces of wood), often implying a simple or rough structure","zh":"用木板（平板木材）制成或搭建的；常暗示结构简单或较粗朴"},"examples":[{"en":"They lived in a small board-built cabin near the river.","zh":"他们住在河边一间用木板搭的小小木屋里。"},{"en":"The garden shed was board-built and easy to repair.","zh":"那间花园小棚是木板搭的，很容易修理。"}]}],"synonyms":["wooden","made of boards","plank-built","timber-built"],"phonetic":"/ˈbɔrdˌbɪlt/","extraExplanation":["“board-built”是由名词“board（木板）+ built（建成的）”组成的复合形容词，常用连字符连接，尤其在较正式或描写性的写作中。","这种说法带一点文学/乡村描写的感觉，常见于描述简陋的房屋、棚屋、围栏等；在现代口语里也常用“wooden”或“made of boards”来表达类似意思。","在航海语境中偶尔也可用来形容以木板外壳拼接成的船体（与整体挖空的独木舟等相对），但日常最常见仍是一般建筑/结构的“木板搭建”。"]}
{"word":"board-up-able","summary":{"en":"“Board-up-able” means “able to be boarded up with wooden boards,” usually to secure or close a building temporarily.","zh":"“board-up-able”指“可以用木板封住的”，常用于门窗加固或临时封闭建筑的语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be boarded up (covered or sealed with wooden boards), usually to protect a building’s windows/doors or to close a place temporarily.","zh":"可被用木板封住的（通常指为保护建筑物的门窗，或暂时关闭场所而用木板钉封）。"},"examples":[{"en":"After the storm, the broken windows were board-up-able until repairs could be made.","zh":"暴风雨过后，破掉的窗户在正式维修前可以先用木板钉封。"},{"en":"The storefront is board-up-able, so the owner can secure it overnight.","zh":"这家店面可以用木板封起来，所以店主能在夜里把它加固。"}]}],"synonyms":["boardable","securable","able to be boarded up","able to be boarded over"],"phonetic":"/ˈbɔrd ˌʌp əbəl/","extraExplanation":["“board-up-able”是口语/行业里可能会临时造出来的词：由短语动词“board up（用木板封住）”加上形容词后缀“-able（可……的）”构成。更常见、更自然的说法是“can be boarded up”或“boardable”（在安防/房屋维护语境里）。","拼写上通常会用连字符把“board up”和“-able”连起来（board-up-able），以避免读者误解结构；在正式写作中，建议改写为更常见的表达。"]}
{"word":"boardable","summary":{"en":"“Boardable” means able to be boarded (get on a vehicle) or able to be covered/closed with boards (boarded up).","zh":"“boardable”指“可以登上去的（上车/登机）”，也可指“可以用木板封住的（封门窗）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to be boarded (entered) such as a bus, train, or airplane; safe or suitable to get on.","zh":"（公交/火车/飞机等）可以登上去的；适合上车/登机的。"},"examples":[{"en":"The train is now boardable at Platform 3.","zh":"这趟火车现在可以在3号站台上车了。"},{"en":"Your flight becomes boardable 30 minutes before departure.","zh":"你的航班通常在起飞前30分钟开始可以登机。"}]},{"partOfSpeech":"adj.","definition":{"en":"able to be covered or closed with boards (often to protect something), especially a door or window.","zh":"可以用木板封住/遮挡的（常指为了保护门窗等）。"},"examples":[{"en":"The broken window isn’t boardable without the right tools.","zh":"没有合适的工具，这扇破窗户没法用木板封起来。"},{"en":"After the storm, the shopfront was quickly made boardable.","zh":"暴风雨后，店面很快就被处理到可以用木板封起来的状态。"}]}],"synonyms":["ready for boarding","available for boarding","accessible","enterable","able to be boarded","board-up-able"],"phonetic":"/ˈbɔrdəbəl/","extraExplanation":["“boardable”在日常口语里不算特别常见，更常见的说法是“ready for boarding / available for boarding（可以登机/上车了）”。不过在机场、交通、安保或维修等较正式/专业的语境中会看到。"]}
{"word":"boardbill","summary":{"en":"A boardbill is a public poster or printed notice posted on a board, especially in older usage.","zh":"boardbill 指贴在告示板上的公共海报或印刷告示（多见于旧式用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a printed notice or poster placed on a board in a public place (often for announcements, events, or advertisements); an old-fashioned word similar to “placard” or “bill.”","zh":"张贴在公共告示板上的印刷通知或海报（常用于公告、活动或广告）；较旧用法，类似于“招贴/告示”。"},"examples":[{"en":"The theater put up a boardbill to advertise the new play.","zh":"剧院贴出一张告示海报来宣传新剧。"},{"en":"A boardbill on the town board announced a meeting on Friday.","zh":"镇上的告示板上有一张告示，宣布周五开会。"}]}],"synonyms":["poster","notice","placard","handbill","sign"],"phonetic":"ˈbɔrdˌbɪl","extraExplanation":["“boardbill”属于较少见、偏旧式的词，现代英语里更常用的说法是“poster / notice / sign / placard”，或者根据场景用“flyer（传单）”。","在历史语境中，它常与戏院、集市、选举等公共信息发布有关：把“bill（公告）”贴在“board（板子/告示板）”上，方便路人看到。"]}
{"word":"boarded","summary":{"en":"“Boarded” most often means “got on a plane/train/bus/ship,” and it can also mean “covered with boards” (boarded-up).","zh":"“Boarded”最常见意思是“登上飞机/火车/公交/船”；也可指“用木板封住的”（boarded-up）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “board”: to get on a vehicle (plane, train, bus, ship).","zh":"“board”的过去式/过去分词：登上交通工具（飞机、火车、公交、船等）。"},"examples":[{"en":"We boarded the plane at 8:30.","zh":"我们8点半登上了飞机。"},{"en":"Passengers boarded quickly because the weather was getting worse.","zh":"因为天气变差，乘客们很快就登机了。"},{"en":"She boarded the train and found her seat.","zh":"她上了火车，找到了自己的座位。"}]},{"partOfSpeech":"adj.","definition":{"en":"covered or shut with wooden boards, often for protection or because something is closed.","zh":"用木板覆盖或封住的（常用于保护或表示关闭）。"},"examples":[{"en":"The windows were boarded after the storm.","zh":"暴风雨过后，窗户被木板封住了。"},{"en":"A boarded-up shop stood at the corner.","zh":"街角有一家被木板封起来的店。"}]},{"partOfSpeech":"v.","definition":{"en":"having meals (and sometimes lodging) provided; living somewhere as a boarder (less common).","zh":"包伙食（有时也含住宿）的；作为寄宿者居住（较不常用）。"},"examples":[{"en":"He boarded with a local family while studying abroad.","zh":"他在国外学习期间寄宿在当地人家里。"},{"en":"She was boarded and cared for by relatives.","zh":"她由亲戚供食宿并照料。"}]}],"synonyms":["got on","entered","embarked","enplaned","boarded up","sealed up"],"phonetic":"/ˈbɔrdɪd/","extraExplanation":["“board”有多重常见含义：①登上（交通工具）；②用木板封住；③供食宿/寄宿。看到“boarded”时，可先根据上下文判断是“登机/上车”，还是“用木板封窗/封店”，或“寄宿/包伙食”。"]}
{"word":"boarder","summary":{"en":"A boarder is usually a person who pays to live (and often eat meals) in someone else’s home or at a boarding school.","zh":"boarder 通常指付费在他人家中或寄宿学校食宿的“寄宿者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who pays to live and receive meals in someone else’s home, a boarding house, or a school (a resident who “boards”)","zh":"寄宿者；付费在他人家中、寄宿公寓或学校食宿的人"},"examples":[{"en":"She is a boarder in a small house near the university.","zh":"她是在大学附近一间小房子里寄宿的住客。"},{"en":"The school provides dorms, but some students prefer to be boarders with local families.","zh":"学校提供宿舍，但有些学生更喜欢在当地家庭寄宿。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) someone or something that gets on a vehicle (like a bus, train, or plane)","zh":"（较少用）登车/登机的人（或物）"},"examples":[{"en":"Early boarders got the best seats on the bus.","zh":"早早上车的人坐到了最好的座位。"}]}],"synonyms":["lodger","resident","paying guest"],"phonetic":"/ˈbɔrdɚ/","extraExplanation":["“boarder”常被英语学习者和“border”（边界；边境）混淆：\n- boarder = 寄宿者（来自 board = 食宿/膳食）\n- border = 边界/边境（如 the border between two countries）\n拼写只差一个 a / o，但意思差很多。","与“boarder”相关的常见词：\n- boarding school 寄宿学校\n- room and board 住宿和伙食\n- take in boarders 招收寄宿者（让人付费住在家里）"]}
{"word":"boarders","summary":{"en":"Boarders are people who live somewhere and pay for meals and lodging (often at a boarding school), or people who board a vehicle (passengers).","zh":"boarders 指付费在某处食宿的寄宿者（常见于寄宿学校），也可指登上交通工具的乘客。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who live in a place (such as a school or a house) and pay for meals and lodging there; lodgers, especially students living at a boarding school.","zh":"寄宿者；食宿生（尤其指住在寄宿学校的学生）；付费在某处食宿的人。"},"examples":[{"en":"The school has both day students and boarders.","zh":"这所学校既有走读生，也有寄宿生。"},{"en":"Several boarders rent rooms in the old house and eat dinner together.","zh":"几位寄宿者在那栋老房子里租房间，还一起吃晚饭。"},{"en":"Her parents decided she would become a boarder next semester.","zh":"她父母决定让她下学期开始寄宿。"}]},{"partOfSpeech":"n.","definition":{"en":"People who get on and ride a vehicle (such as a plane, train, or bus).","zh":"（交通工具的）乘客；登机者/上车者。"},"examples":[{"en":"All boarders must show an ID before getting on the plane.","zh":"所有登机者在上飞机前都必须出示证件。"},{"en":"The bus driver waited until the last boarders got on.","zh":"公交司机等到最后一位乘客上车后才开走。"}]}],"synonyms":["lodgers","residents","passengers","riders"],"phonetic":"ˈbɔrdɚz","extraExplanation":["“boarders”和“borders”很容易混淆：\n- boarders = 寄宿者/乘客（来自 board = 供食宿/登车）\n- borders = 边界/边境（来自 border = 边界）\n写作时要根据语境选择。"]}
{"word":"boardgame","summary":{"en":"A board game is a tabletop game played on a board, often using pieces, cards, or dice.","zh":"board game 指在桌面上、以棋盘为主要载体进行的游戏，常配合棋子、卡牌或骰子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A game played on a board (often with pieces, cards, dice, or a spinner), usually on a table.","zh":"桌游；棋盘游戏：在棋盘上进行的游戏（常配合棋子、卡牌、骰子或转盘），通常在桌面上玩。"},"examples":[{"en":"We played a board game after dinner.","zh":"晚饭后我们玩了一会儿桌游。"},{"en":"This board game is easy to learn but hard to master.","zh":"这款桌游很容易上手，但很难精通。"},{"en":"She brought a new board game to the party.","zh":"她带了一款新的桌游来聚会。"}]}],"synonyms":["tabletop game","parlor game"],"phonetic":"/ˈbɔrd ˌɡeɪm/","extraExplanation":["拼写与用法：更常见的写法是分开写作“board game”。也有人写作“boardgame”，但在正式写作中建议用“board game”。复数是“board games”。","文化语境：英语里“board game”通常指桌面上玩的实体游戏（如 Monopoly《大富翁》、Chess 国际象棋、Scrabble 拼字游戏）。与“video game（电子游戏）”相对。"]}
{"word":"boarding","summary":{"en":"Boarding most commonly means getting on a plane/train, and it can also mean paid meals and lodging, or describe a school where students live on campus.","zh":"boarding最常指登机/上车，也可指付费的食宿（供膳宿），或形容学生寄宿在校的寄宿制学校。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity of getting on a vehicle (like a plane, train, or bus)","zh":"登上交通工具（如飞机、火车、公交车）的行为"},"examples":[{"en":"Boarding begins at 6:30 p.m. at Gate 12.","zh":"登机于晚上6:30在12号登机口开始。"},{"en":"Please have your boarding pass ready.","zh":"请准备好你的登机牌。"}]},{"partOfSpeech":"n.","definition":{"en":"meals and a place to stay (usually paid for), often as part of renting a room","zh":"（通常付费的）食宿；供膳宿（常与租房间一起提供）"},"examples":[{"en":"The rent includes room and boarding.","zh":"房租包含房间和食宿。"},{"en":"She pays for boarding at a family’s home near the university.","zh":"她付费在大学附近的一户人家寄宿。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to students who live at school rather than at home","zh":"（学校）寄宿制的；住校的"},"examples":[{"en":"He attends a boarding school.","zh":"他就读于一所寄宿学校。"},{"en":"Boarding students live in dormitories during the term.","zh":"寄宿生在学期内住在宿舍里。"}]},{"partOfSpeech":"v.","definition":{"en":"getting on a vehicle; entering to travel (present participle of “board”)","zh":"正在登上（交通工具）；登乘（board 的现在分词）"},"examples":[{"en":"We are boarding now—let’s line up.","zh":"我们现在开始登机了——排队吧。"},{"en":"They were boarding the train when it started to rain.","zh":"他们正要上火车时开始下雨了。"}]}],"synonyms":["embarkation","getting on","lodging","room and board","boarding school"],"phonetic":"/ˈbɔrdɪŋ/","extraExplanation":["“boarding pass”是“登机牌”；美式英语里更常说“boarding pass”，而“pass”在这里是“通行凭证”的意思。","“room and board”是常见搭配，指“住宿和伙食（食宿）”。在招聘或租房信息里也常看到。","“boarding school”在英美文化中常见，指学生在学期内住校的学校；不等同于普通的“住校（dorm）”，它通常是学校制度的一部分。"]}
{"word":"boarding card","summary":{"en":"A boarding card is the document (paper or digital) you use to board a flight.","zh":"boarding card 指用于登机的凭证（纸质或电子）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A printed or digital pass that lets you board an airplane (or sometimes a train/ship), showing your name, flight details, and seat information.","zh":"（通常指飞机的）登机牌/登机证：纸质或电子凭证，用于登机，上面有姓名、航班信息和座位等。"},"examples":[{"en":"Please have your passport and boarding card ready at the gate.","zh":"请在登机口准备好护照和登机牌。"},{"en":"I downloaded my boarding card to my phone after checking in online.","zh":"我在网上值机后把电子登机牌下载到了手机里。"},{"en":"My boarding card says Seat 12A, but the screen shows 12C.","zh":"我的登机牌写的是12A，但屏幕显示是12C。"}]}],"synonyms":["boarding pass","boarding slip"],"phonetic":"/ˈbɔrdɪŋ kɑrd/","extraExplanation":["在美式英语里更常说 boarding pass；boarding card 也能理解，但在航空场景下 pass 更常见。","常见相关词：check in（值机）、gate（登机口）、seat number（座位号）、boarding time（登机时间）、carry-on（随身行李）。","电子登机牌常见表达：mobile boarding pass / digital boarding pass（手机/电子登机牌）。"]}
{"word":"boarding school","summary":{"en":"A school where students live on campus during the term.","zh":"学生在学期内住校并学习的学校。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A school where students live during the school term (in dormitories) as well as study there.","zh":"寄宿学校；学生在学期内住校（宿舍）并在校学习的学校。"},"examples":[{"en":"She was sent to a boarding school when she was thirteen.","zh":"她十三岁时被送去读寄宿学校。"},{"en":"Life at a boarding school can feel strict, but it also builds independence.","zh":"寄宿学校的生活可能很严格，但也能培养独立性。"}]}],"synonyms":["residential school","private boarding school"],"phonetic":"/ˈbɔɹdɪŋ skuːl/","extraExplanation":["“Boarding”在这里来自“room and board”（食宿），表示学校提供住宿和餐食。","在英美文化中，boarding school 常让人联想到较正式的校规、制服、宿舍生活与丰富的课外活动；有些也与精英教育相关（但并非所有寄宿学校都如此）。","文学与影视中常见的寄宿学校题材包括：同伴关系、想家（homesickness）、严格校规、成长与自我认同等。相关词：day school（走读学校，不住校）、dormitory/dorm（宿舍）、house system（分院/宿舍“学院”制度，英式学校常见）。"]}
{"word":"boardinghouse","summary":{"en":"A boardinghouse is a place where you rent a room and usually get meals as part of the price.","zh":"boardinghouse指付费租房并通常包含餐食的寄宿公寓/食宿屋。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a house where people pay to live and usually receive meals, with rooms rented for a short or long time","zh":"（通常提供餐食的）寄宿公寓；食宿屋（人们付费租房并常常包餐）"},"examples":[{"en":"She found a cheap room in a boardinghouse near the train station.","zh":"她在火车站附近找到了一间便宜的寄宿公寓房间。"},{"en":"In the past, many workers lived in boardinghouses when they first moved to a new city.","zh":"过去，许多工人刚搬到新城市时会住在寄宿公寓里。"}]}],"synonyms":["boarding house","rooming house","lodging house","guesthouse"],"phonetic":"/ˈbɔrdɪŋˌhaʊs/","extraExplanation":["“boardinghouse”由“board（膳食、供食宿）+ house（房子）”组成。这里的board不是“木板”，而是指“供膳、供食宿”，所以boardinghouse常带有“包吃（有时也包住）”的意味。","在英美文化中，boardinghouse在19世纪到20世纪中期较常见：给单身工人、学生、外来者提供相对便宜的住处与家常饭。如今更常见的近义说法是“rooming house”（多强调只租房间，未必供餐）或“shared house/house share”（合租）。","文学作品里，boardinghouse常用来营造“陌生人同住、关系微妙、流动性强”的社会氛围（例如一些维多利亚时期或早期现代小说中常出现）。"]}
{"word":"boardinghouses","summary":{"en":"A boardinghouse is a place where you rent a room and usually get meals, often for longer stays.","zh":"boardinghouse 指一种可租房间并通常提供餐食的住所，常用于较长期的居住。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A house (or small hotel) where people pay to live and usually receive meals, often for weeks or months at a time.","zh":"寄宿公寓；包食宿的出租屋（人们付费长期居住，通常包含餐食）。"},"examples":[{"en":"She rented a room in a boardinghouse near the train station.","zh":"她在火车站附近的一家寄宿公寓租了一个房间。"},{"en":"The boardinghouse served breakfast and dinner every day.","zh":"这家寄宿公寓每天提供早餐和晚餐。"},{"en":"Many workers lived in boardinghouses before they could afford their own apartments.","zh":"许多工人在买得起自己的公寓之前，会住在寄宿公寓里。"}]}],"synonyms":["rooming house","lodging house","guesthouse"],"phonetic":"/ˈbɔrdɪŋˌhaʊs/","extraExplanation":["“Boardinghouse”来自“room and board”（住宿加伙食）。其中 board 在这里指“供餐/伙食”，不是“木板”。","在19世纪到20世纪初的美国与英国，boardinghouse 很常见，常与移民、工厂工人、单身女性教师等群体相关；文学作品中也常用它来表现“临时落脚、社会阶层与人际关系”的氛围。","和“hotel”相比，boardinghouse 更强调长期居住与家庭式/半家庭式管理；和“dormitory”相比，它通常不是学校宿舍，而是面向社会租客。"]}
{"word":"boardings","summary":{"en":"“Boardings” most often means paid lodging and meals (room and board), or the process of passengers getting on a vehicle (boarding).","zh":"“Boardings”最常指付费寄宿的食宿（room and board），也可指乘客登机/上船/上车等“登乘过程”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(usually plural) Meals and lodging provided for someone who pays to live in another person’s home or in a rented room; room and board.","zh":"（常用复数）寄宿的食宿；付费住在别人家/出租房间所包含的“住宿+伙食”。"},"examples":[{"en":"Her parents pay for her boardings while she studies in the city.","zh":"她父母在她去城里读书时为她的食宿（寄宿费用）买单。"},{"en":"The rent includes boardings, so you don’t need to cook every day.","zh":"房租包含食宿，所以你不需要每天做饭。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of getting on a ship, plane, train, or bus; the process of allowing passengers to enter.","zh":"登乘；登机/上船/上车的过程。"},"examples":[{"en":"Boardings begin at 6:30 p.m., so please arrive early.","zh":"登机从晚上6:30开始，请提前到达。"},{"en":"There were long lines during boardings because of the security check.","zh":"由于安检，登机时排起了长队。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of entering a vehicle, building, or area (sometimes used in official or news contexts).","zh":"（常用于官方/新闻语境）登上（车辆）；进入（建筑或区域）。"},"examples":[{"en":"Police reported several boardings of the bus by inspectors today.","zh":"警方通报今天检查人员多次登上公交车进行检查。"},{"en":"Unauthorized boardings of the ship are not allowed.","zh":"不允许未经授权登船。"}]}],"synonyms":["room and board","lodging and meals","boarding","embarkation","getting on"],"phonetic":"/ˈbɔrdɪŋz/","extraExplanation":["“boardings”是“boarding”的复数。日常更常见的表达是：\n- 住校/寄宿：boarding school（寄宿学校），a boarding student（寄宿生）\n- 航班/交通：boarding pass（登机牌），boarding time（登机时间），boarding gate（登机口）\n在机票语境里，通常说“boarding”而不说“boardings”，例如：Boarding starts at 7:00."]}
{"word":"boardless","summary":{"en":"“Boardless” means “without board,” especially not including meals (sometimes room and meals) in an arrangement; it can also mean without boards (planks).","zh":"“Boardless”意为“不含伙食（有时也指不含食宿中的伙食）”；也可指“没有木板/板材的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not providing or including meals (and sometimes lodging) as part of a payment or arrangement; without “board.”","zh":"（费用或安排中）不含伙食（有时也指不含食宿）；不包“board”。"},"examples":[{"en":"The rent is cheaper because it’s boardless.","zh":"房租比较便宜，因为是不包伙食的。"},{"en":"She found a boardless room near campus and cooked for herself.","zh":"她在学校附近找到了一个不包伙食的房间，自己做饭。"},{"en":"The job offered housing, but it was boardless, so workers bought their own meals.","zh":"这份工作提供住宿，但不包伙食，所以工人要自己买饭。"}]},{"partOfSpeech":"adj.","definition":{"en":"Without a board or boards (a flat piece/pieces of wood or similar material).","zh":"没有木板（或类似的板材）；无板的。"},"examples":[{"en":"The boardless fence let animals slip through.","zh":"没有木板的栅栏让动物钻了过去。"},{"en":"They designed a boardless display to reduce weight.","zh":"他们设计了一个无板的展示装置来减轻重量。"}]}],"synonyms":["without board","unboarded","meal-free","unplanked"],"phonetic":"/ˈbɔrdləs/","extraExplanation":["“boardless”由 board（常见含义是“木板”；在住宿语境里还可以指“伙食/食宿中的伙食”）+ -less（“没有……”）构成。","在英式/美式英语中，board 在租房或学校住宿里常出现在 room and board（房间+伙食/食宿）这个固定搭配里，所以 boardless 常用于说明费用不含饭。"]}
{"word":"boardlike","summary":{"en":"“Boardlike” describes something that is flat, stiff, and hard like a board.","zh":"“boardlike”用来形容某物像木板一样又平又硬、很挺。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Flat, stiff, and hard in a way that resembles a board.","zh":"像木板一样的：平的、硬的、挺的（常指缺乏柔软或弹性）。"},"examples":[{"en":"The steak was overcooked and boardlike, so it was difficult to chew.","zh":"牛排煎过头了，硬得像木板一样，很难嚼。"},{"en":"After sitting in the sun, the old leather became dry and boardlike.","zh":"在太阳下晒久了，旧皮革变得干燥，硬得像木板。"}]}],"synonyms":["stiff","rigid","hard","inflexible","wooden"],"phonetic":"/ˈbɔrdˌlaɪk/","extraExplanation":["“boardlike”多用于口语或描写性写作，常带一点负面含义（强调“硬、干、缺乏弹性/柔软”）。也可以写作“board-like”，两种拼写都能见到。"]}
{"word":"boardly","summary":{"en":"“Boardly” is not a standard word; it’s usually a misspelling of “broadly.”","zh":"“boardly”不是规范英语词；通常是把“broadly（总体上/广泛地）”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard word in modern English; most often a misspelling of “broadly” (meaning “in a general or wide way”).","zh":"现代英语中不规范的写法；最常见的是把“broadly”（意为“广泛地；总体上”）拼错成“boardly”。"},"examples":[{"en":"I think you meant “broadly,” as in: “Broadly speaking, the plan is good.”","zh":"我想你想写的是“broadly”，例如：“Broadly speaking, the plan is good.”（总体来说，这个计划不错。）"},{"en":"The word “boardly” is usually corrected to “broadly” in editing.","zh":"在编辑校对中，“boardly”通常会被改成“broadly”。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Very rare) “boardly” can be interpreted as “in a board-like way,” but this use is uncommon and may sound incorrect to most readers.","zh":"（非常少见）可勉强理解为“像木板一样地／呈板状地”，但这种用法极不常见，多数读者会觉得不自然或不正确。"},"examples":[{"en":"The author described the character’s stiff posture as “boardly,” but most writers would say “stiff” or “rigid.”","zh":"作者把角色僵硬的姿势写成“boardly”，但多数写作者会用“stiff”或“rigid”。"}]}],"synonyms":["broadly","generally","widely","overall"],"phonetic":"ˈbɔrdli","extraExplanation":["“boardly”不是常见词汇，所以在正式写作、考试或商务沟通中建议避免使用。","如果你的意思是“总体上/大体而言”，正确拼写通常是“broadly”；如果你的意思与“board（董事会/木板/上车）”有关，可以改用更明确的表达，如“as a board member（作为董事会成员）”“on the board（在董事会中）”“board-like（板状的）”。"]}
{"word":"Boardman","summary":{"en":"Boardman is most commonly a surname or a U.S. place name; rarely, it can mean a man who works with boards or a board member in older usage.","zh":"Boardman 最常見是姓氏或美國地名；少見的舊用法可指與木板工作相關的人或董事會／委員會成員。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname) in English-speaking countries","zh":"（英語國家常見的）姓氏：博德曼 / 博尔德曼"},"examples":[{"en":"Ms. Boardman will lead the meeting today.","zh":"Boardman 女士今天將主持會議。"},{"en":"I emailed Dr. Boardman to ask a question about the homework.","zh":"我發郵件給 Boardman 博士，詢問作業的問題。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name (a town/city name), especially in the United States","zh":"地名（城鎮名），尤指美國的某些地區"},"examples":[{"en":"We stopped for gas in Boardman, Oregon.","zh":"我們在俄勒岡州的 Boardman 停下來加油。"},{"en":"She grew up near Boardman before moving to Portland.","zh":"她在 Boardman 附近長大，後來搬到波特蘭。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare/old-fashioned) a man who works with boards (wood), or a member/manager of a board (committee)","zh":"（少見／較舊用法）做木板相關工作的人（如木工）；或董事會／委員會成員、管理者"},"examples":[{"en":"In older texts, a “boardman” might refer to someone working with timber.","zh":"在較老的文本中，boardman 有時指從事木材工作的工人。"}]}],"phonetic":"ˈbɔrdmən","extraExplanation":["“Boardman”常見於人名與地名。在英語裡 board 可指「木板」或「董事會」，man 表示「人」，因此這個姓氏可能源自職業稱呼（與木材加工、木工，或與「委員會／董事會」相關的工作）。實際用法中，多把它當作專有名詞（人名／地名）理解即可。"]}
{"word":"boardman","summary":{"en":"Boardman most commonly means a member of a board (a director), and it can also be a surname or a place name.","zh":"Boardman 最常指“董事会成员/董事”，也可作姓氏或地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a board (especially a company’s board of directors); a director","zh":"（尤指公司）董事会成员；董事"},"examples":[{"en":"Two boardmen resigned after the scandal.","zh":"丑闻发生后，有两位董事辞职了。"},{"en":"As a boardman, he must avoid conflicts of interest.","zh":"作为董事，他必须避免利益冲突。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname), common in English-speaking countries","zh":"姓氏（英语国家常见姓）"},"examples":[{"en":"Ms. Boardman will speak at the meeting today.","zh":"Boardman 女士今天将在会上发言。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name (a town or area), such as Boardman, Ohio, in the United States","zh":"地名（如美国俄亥俄州的 Boardman）"},"examples":[{"en":"They moved to Boardman, Ohio, for work.","zh":"他们为了工作搬到了美国俄亥俄州的 Boardman。"}]}],"synonyms":["board member","director"],"phonetic":"/ˈbɔrdmən/","extraExplanation":["“Boardman”作“董事会成员”时，更多见于较正式或特定语境；日常英语里更常说 board member 或 director。","作为姓氏时，Boardman 常被理解为与“board（木板/委员会）+ man（人）”有关的旧式构词，具体含义多随家族来源而变化。"]}
{"word":"boardmanship","summary":{"en":"Boardmanship is the skill of working effectively on a board, especially in governance and oversight.","zh":"Boardmanship 指在董事会中有效履职的能力，尤其体现在治理与监督方面。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Skill and judgment in serving on, leading, or working effectively with a board (especially a company or nonprofit board), including governance, oversight, and decision-making.","zh":"董事会能力；担任或领导董事会时的技巧与判断力（尤指公司或非营利机构），包括治理、监督与决策能力。"},"examples":[{"en":"Her boardmanship helped the nonprofit improve oversight and avoid conflicts of interest.","zh":"她的董事会能力帮助该非营利机构加强监督并避免利益冲突。"},{"en":"The report praised his boardmanship during the crisis, especially his calm leadership and clear voting process.","zh":"报告称赞他在危机中的董事会表现，尤其是冷静的领导方式和清晰的表决流程。"}]}],"synonyms":["directorship skills","governance skills","board leadership","stewardship"],"phonetic":"/ˈbɔrdmənʃɪp/","extraExplanation":["“boardmanship”较偏正式，常见于公司治理（corporate governance）或非营利机构管理语境，强调在董事会层面的能力，而不只是日常管理（management）。","相关搭配：good/strong boardmanship（良好的董事会能力）、a display of boardmanship（展现董事会能力）。","与“chairmanship”不同：chairmanship更侧重“担任主席/主持会议”的能力；boardmanship涵盖作为董事或与董事会协作的整体治理能力。"]}
{"word":"boardmen","summary":{"en":"“Boardmen” usually means male members of a board (a governing committee). It can also, less commonly, refer to men connected with board (meals/lodging) in older contexts.","zh":"“boardmen”通常指董事会/委员会的男性成员；在较少见、较旧的语境中，也可指与“供膳/食宿（board）”有关的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “boardman”: a man who is a member of a board (a committee that manages or advises an organization).","zh":"“boardman”的复数：董事会/委员会成员（男性），指在组织中负责管理或提供建议的董事、理事等。"},"examples":[{"en":"Several boardmen opposed the proposal because of the budget risk.","zh":"几位董事会成员因预算风险反对该提案。"},{"en":"The boardmen voted to appoint a new CEO.","zh":"董事们投票任命了一位新首席执行官。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) men who provide or receive “board” (meals and sometimes lodging), for example in older contexts involving boarding houses.","zh":"（较少见）与“board（供膳/食宿）”有关的人：提供或接受食宿的人（常见于较旧语境，如寄宿公寓/食宿安排）。"},"examples":[{"en":"In the old boarding house, the boardmen ate dinner together at six.","zh":"在那家旧式寄宿公寓里，住客们六点一起吃晚饭。"}]}],"synonyms":["board members","directors","trustees","committee members"],"phonetic":"/ˈbɔrdmən/","extraExplanation":["“boardmen”里的 -men 是不规则复数（man → men）。在现代英语中，更常用性别中立的说法，如 board members、directors、trustees。若你是在读公司治理/新闻报道，通常应理解为“董事会成员”。"]}
{"word":"boardroom","summary":{"en":"A boardroom is the room where a company’s directors/executives meet, and it can also mean the company’s top decision-making leadership.","zh":"boardroom指公司董事会/高层开会的会议室，也可引申为公司的高层决策圈。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A meeting room where a company’s board of directors and top executives meet to discuss and make important decisions.","zh":"（公司）董事会会议室；高层开会讨论重大决策的房间。"},"examples":[{"en":"The CEO presented the new strategy in the boardroom.","zh":"CEO在董事会会议室里展示了新战略。"},{"en":"Tensions rose in the boardroom during the merger talks.","zh":"在并购谈判期间，董事会会议室里的气氛变得紧张起来。"}]},{"partOfSpeech":"n.","definition":{"en":"The group of powerful decision-makers in a company (used more abstractly, especially in business news).","zh":"（引申）公司的决策层；董事会与高层管理者（常见于新闻或评论中）。"},"examples":[{"en":"The decision was made in the boardroom, not on the factory floor.","zh":"这个决定是在决策层做出的，而不是在工厂一线。"},{"en":"Employees want more transparency from the boardroom.","zh":"员工希望决策层能更透明。"}]}],"synonyms":["conference room","meeting room","executive suite","corporate leadership"],"phonetic":"/ˈbɔrdˌrum/","extraExplanation":["“boardroom”由“board（董事会）+ room（房间）”构成。这里的board不是“木板”，而是“董事会/理事会”的意思。","在商业语境里，boardroom常带有“权力中心、精英决策、与一线员工有距离”的语感，因此新闻评论中常用来对比“boardroom vs. shop floor（车间/一线）”。"]}
{"word":"boards","summary":{"en":"“Boards” most often means pieces of wood; it can also mean decision-making groups (boards), meals/ lodging (“room and board”), or the verb form of “board” (to get on a vehicle or to cover with boards).","zh":"“boards”最常见意思是“木板”；也可指“委员会/董事会”、食宿（room and board），或作动词形式表示“登乘”以及“用木板封住/覆盖”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “board”: a flat piece of wood (or similar material) used for building, covering, or making things.","zh":"“board”的复数：木板（或类似材料的板材），用于建筑、覆盖或制作物品。"},"examples":[{"en":"They repaired the fence with new boards.","zh":"他们用新木板修好了栅栏。"},{"en":"The floorboards creaked when I walked across the room.","zh":"我走过房间时，地板木板吱呀作响。"}]},{"partOfSpeech":"n.","definition":{"en":"a group of people who manage or make decisions for an organization (e.g., a school, company, or charity).","zh":"（机构的）委员会；董事会（如学校、公司或慈善组织的管理/决策团体）。"},"examples":[{"en":"The school board voted to change the policy.","zh":"学区委员会投票决定修改政策。"},{"en":"She presented the plan to the board of directors.","zh":"她把计划提交给董事会。"}]},{"partOfSpeech":"n.","definition":{"en":"the meals and/or place to live that are provided for someone (often in “room and board”).","zh":"（供给的）膳食和/或住宿（常见于“room and board”=食宿）。"},"examples":[{"en":"The job includes room and board.","zh":"这份工作包含食宿。"},{"en":"They paid for board while staying with a local family.","zh":"他们住在当地人家里时支付了伙食费（或食宿费）。"}]},{"partOfSpeech":"v.","definition":{"en":"third-person singular present of “board”: to get on a bus, train, plane, or ship.","zh":"“board”的第三人称单数：登上（公交、火车、飞机或船）。"},"examples":[{"en":"She boards the train at 8 a.m. every day.","zh":"她每天早上8点上火车。"},{"en":"Passengers board through the front door.","zh":"乘客从前门上车/登机。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cover something with boards.","zh":"用木板覆盖；用板材封住。"},"examples":[{"en":"They boarded the windows before the storm.","zh":"暴风雨来临前，他们用木板封住了窗户。"},{"en":"The workers boarded up the empty house.","zh":"工人把空房子用木板封了起来。"}]}],"synonyms":["planks","panels","committee","council","directorate","get on","embark"],"phonetic":"/bɔrd/","extraExplanation":["“board”这个词很常见，容易混淆的有三个核心义：①木板（具体物体）；②委员会/董事会（抽象团体，常见搭配：board meeting, board member）；③食宿（固定搭配 room and board）。","“board up”表示“用木板封住（门窗等）”，常用于暴风雨前防护、或封闭空置建筑。"]}
{"word":"boardsmanship","summary":{"en":"Boardsmanship is the skill and judgment needed to serve well on a board, especially in governance and oversight.","zh":"Boardsmanship 指在董事会/理事会中有效履职所需的能力与判断力，尤其涉及治理与监督。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the knowledge and skills needed to serve effectively on a board (especially a company or nonprofit board), such as governance, oversight, and strategic decision-making","zh":"（尤指公司或非营利组织）董事会/理事会成员胜任工作的能力与素养，如治理、监督与战略决策等"},"examples":[{"en":"The workshop focuses on boardsmanship: understanding fiduciary duties, reading financial reports, and asking good questions.","zh":"这场工作坊聚焦董事会履职能力：理解受托责任、读懂财务报表，并提出高质量的问题。"},{"en":"Good boardsmanship means supporting the CEO while still holding leadership accountable.","zh":"良好的董事会素养意味着在支持CEO的同时，也要对管理层进行问责监督。"},{"en":"She was recruited for her boardsmanship and experience in nonprofit governance.","zh":"她因出色的董事会履职能力和非营利治理经验而被邀请加入。"}]}],"synonyms":["board governance","director effectiveness","governance skills","board leadership"],"phonetic":"/ˈbɔrdz.mən.ʃɪp/","extraExplanation":["这个词在现实中不算常见，多见于公司治理（corporate governance）或董事会培训语境，用来概括“当董事/理事需要具备的综合能力”。","词形结构：board + -smanship（类似 craftsmanship“手艺”、sportsmanship“体育精神”），强调一种“实践性的本领/素养”。"]}
{"word":"boardwalk","summary":{"en":"A boardwalk is a walkway—often wooden—along a beach or waterfront, used for strolling; it can also mean to build or cover something with boards.","zh":"boardwalk 指海滨/水边常见的（多为木质的）步道；也可作动词，指用木板铺设或修建木板步道。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A wooden (or sometimes concrete) walkway built along a beach, waterfront, or over wet ground, often for strolling and tourism.","zh":"（海滨/湖滨等的）木板路；滨海步道（也可能是混凝土铺设，用于散步、观光或跨越湿地）。"},"examples":[{"en":"We spent the evening walking along the boardwalk and watching the sunset.","zh":"我们傍晚沿着木板路散步，看日落。"},{"en":"The boardwalk was lined with snack stands and small shops.","zh":"木板路两旁有小吃摊和小店。"},{"en":"Please stay on the boardwalk to protect the sand dunes.","zh":"请走在步道上，以保护沙丘。"}]},{"partOfSpeech":"v.","definition":{"en":"To cover an area with boards or build a walkway with boards.","zh":"用木板铺设；修建木板步道。"},"examples":[{"en":"The park boardwalked the marsh so visitors could see the birds safely.","zh":"公园在沼泽上修建了木板步道，让游客能安全观鸟。"},{"en":"They plan to boardwalk the shoreline to reduce erosion.","zh":"他们计划在岸边铺设步道以减少侵蚀。"}]}],"synonyms":["walkway","promenade","plank walk","seaside walk"],"phonetic":"/ˈbɔrdˌwɔk/","extraExplanation":["在美国文化语境里，boardwalk 常让人联想到海边的游乐与度假氛围（例如新泽西州的 Atlantic City、加州的 Santa Cruz 等地常有著名的 boardwalk）。这类地方常见游乐设施、街头小吃和纪念品商店。","与 beach promenade（海滨长廊，通常更“城市化”、可能是石材/混凝土）相比，boardwalk 更强调“木板铺成的步道”以及临海、跨越沙地/湿地的功能。"]}
{"word":"boardwalks","summary":{"en":"“Boardwalks” means wooden walkways for pedestrians, often along beaches or over wetlands.","zh":"“boardwalks”指供行人行走的木板步道/木栈道，常见于海边或湿地上方。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wooden walkway (often by the sea or over wetlands) built for people to walk on; plural of “boardwalk.”","zh":"木板步道；（常见于海边或湿地上方的）木栈道；为“boardwalk”的复数。"},"examples":[{"en":"We strolled along the boardwalks and watched the sunset.","zh":"我们沿着木栈道散步，看日落。"},{"en":"Many parks build boardwalks to protect fragile plants in wetlands.","zh":"许多公园修建木板步道来保护湿地里脆弱的植物。"},{"en":"The boardwalks were crowded with families on the weekend.","zh":"周末木栈道上挤满了家庭游客。"}]}],"synonyms":["wooden walkway","plank path","promenade","footbridge"],"phonetic":"/ˈbɔrdwɔk/","extraExplanation":["“Boardwalk”在美国文化里常让人联想到海滨度假小镇（如新泽西、加州等）的长木栈道，上面可能有小吃摊、游乐设施和纪念品店；也常用于自然保护区的“木栈道”，让游客不踩踏湿地或沙丘。"]}
{"word":"boardy","summary":{"en":"Boardy means plank-like (flat and stiff) or, informally, food that is dry and tough.","zh":"Boardy 指“像木板一样（扁平硬挺）”，也可非正式形容食物（尤指肉）“干硬难嚼”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"like a board; made of or covered with boards; flat and stiff like a plank","zh":"像木板一样的；由木板制成的；（外观或触感）扁平而硬挺的，像木板/木条的"},"examples":[{"en":"The old shed has a boardy wall patched with different planks.","zh":"那间旧棚屋的墙很“木板感”，用不同的木板补过。"},{"en":"His shoulders looked boardy under the stiff jacket.","zh":"他穿着那件硬挺的夹克，肩膀看起来很“板”。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal, of food—especially meat) dry, tough, or tasteless, as if you were chewing wood","zh":"（非正式，指食物，尤指肉）干硬、难嚼或寡淡的，像在嚼木头一样"},"examples":[{"en":"The steak was boardy and needed a lot of sauce.","zh":"那块牛排很干硬，得配很多酱才行。"},{"en":"Overcooked chicken can turn boardy very quickly.","zh":"鸡肉煮老了很快就会变得干柴、难嚼。"}]}],"synonyms":["plank-like","wooden","stiff","dry","tough"],"phonetic":"/ˈbɔrdi/","extraExplanation":["“boardy”在现代英语里不算常用，更多出现在描述口感或质地的非正式语境中。谈食物时，接近中文里说的“干柴、发硬、像木头”。"]}
{"word":"Boarer","summary":{"en":"“Boarer” is a rare/nonstandard spelling, usually meaning “borer” (something or someone that makes holes).","zh":"“Boarer”是少见的非标准拼写，通常指“borer”（钻孔工具/蛀虫等，会打洞的东西）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard/rare spelling) a person, tool, or insect that bores (makes a hole) into something; usually spelled “borer.”","zh":"（非标准/少见拼写）指“钻孔者/钻孔工具/蛀虫”，意思是把东西钻出洞；通常拼作“borer”。"},"examples":[{"en":"Carpenter ants are wood-boring insects (wood borers).","zh":"木匠蚁是会在木头里打洞的昆虫（蛀木虫）。"},{"en":"The plumber used a borer to widen the opening.","zh":"水管工用钻孔工具把开口扩大。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) someone who is boring (dull, not interesting); usually spelled “bore.”","zh":"（少见）指“无聊的人/令人厌烦的人”；更常用拼法是“bore”。"},"examples":[{"en":"He’s not a bore—he’s just quiet at first.","zh":"他不是无聊的人——只是刚开始比较安静。"}]}],"synonyms":["borer","drill","auger","wood-borer"],"phonetic":"/ˈbɔrɚ/","extraExplanation":["“boarer”在现代英语中很少见，通常是把“borer”（钻孔器/蛀虫）或“bearer”（携带者、持有者，如 flag-bearer 旗手、ticket-bearer 持票人）拼错了。","如果你想表达“携带者/持有者”，更可能是 bearer /ˈbɛrɚ/；如果你想表达“钻孔者/蛀虫”，是 borer /ˈbɔrɚ/。"]}
{"word":"boarfish","summary":{"en":"Boarfish is a small sea fish, especially the European species Capros aper.","zh":"Boarfish 指一种小型海鱼，尤指欧洲野猪鱼（Capros aper）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small marine fish (especially the European boarfish, Capros aper) with a tall, thin body and a snout that can look a bit like a boar’s.","zh":"一种小型海鱼（尤指欧洲“野猪鱼”Capros aper），身体高而侧扁，吻部外形有点像野猪的鼻口。"},"examples":[{"en":"The boarfish is often caught in the Northeast Atlantic.","zh":"野猪鱼常见于东北大西洋的捕捞中。"},{"en":"Because of its thin body, the boarfish looks almost leaf-shaped from the side.","zh":"因为身体很薄，野猪鱼从侧面看几乎像一片叶子。"}]}],"synonyms":["European boarfish","Capros aper"],"phonetic":"/ˈbɔrˌfɪʃ/","extraExplanation":["“boarfish”这个名字来自外形联想：它的吻部（snout）让人想到“boar（野猪）”的鼻口，并不表示它和野猪有任何生物学关系。","在一些渔业与生态语境中，boarfish 也可能泛指“野猪鱼科（Caproidae）”的鱼类；但日常最常指的是物种 Capros aper。"]}
{"word":"boarfishes","summary":{"en":"“Boarfishes” means more than one boarfish, a spiny-bodied marine fish.","zh":"“Boarfishes”是 boarfish 的复数，指多条带硬刺特征的海水鱼（猪鱼）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of boarfish: a marine fish (especially the European boarfish, *Capros aper*) with a deep, laterally flattened body and strong spines on its fins.","zh":"boarfish（猪鱼；尤指欧洲猪鱼 *Capros aper*）的复数：一种海水鱼，身体侧扁而高，鳍有明显的硬刺。"},"examples":[{"en":"Boarfishes are often found in deeper coastal waters, where they swim in small groups.","zh":"Boarfishes 常见于较深的沿海海域，经常成小群游动。"},{"en":"The fisherman reported catching several boarfishes in his net.","zh":"渔民说他在渔网里捕到了好几条 boarfishes。"}]}],"synonyms":["boarfish","Capros aper (European boarfish)"],"phonetic":"/ˈbɔrˌfɪʃɪz/","extraExplanation":["“boarfish”这个名字来自它外形上比较“粗壮、带刺”的感觉：一些种类的背鳍棘明显，头部轮廓也较硬朗，因此在英语里被联想到“boar（野猪）”。","日常英语里更常见的是单数 boarfish（或直接用具体物种名），复数 boarfishes 多见于科普文章、渔业报道或生物学语境。"]}
{"word":"boarhide","summary":{"en":"Boarhide means the hide/skin of a wild boar, often used as leather.","zh":"boarhide 指野猪的皮（兽皮），常用于制成皮革。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The hide (skin) of a wild boar, especially when kept or used as leather.","zh":"野猪的皮（兽皮）；尤指保存下来用作皮革的野猪皮。"},"examples":[{"en":"The craftsman made a tough sheath from boarhide.","zh":"工匠用野猪皮做了一个结实的刀鞘。"},{"en":"Old stories sometimes mention shields covered in boarhide.","zh":"一些古老故事里会提到用野猪皮包覆的盾牌。"}]}],"synonyms":["boar hide","boarskin","pigskin","hoghide"],"phonetic":"ˈbɔrˌhaɪd","extraExplanation":["“boarhide”是复合词：boar（野猪）+ hide（兽皮/皮革）。英语里常用这种结构来表示“某种动物的皮”。","在现代英语中更常见的写法和说法有 boar hide（分开写）或更通用的 pigskin（猪皮，常指皮革）。在狩猎、手工皮具或历史题材语境里更可能见到 boarhide。"]}
{"word":"boarhound","summary":{"en":"A boarhound is a hunting dog used for wild boar.","zh":"boarhound 指用于狩猎野猪的猎犬。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hunting dog trained to track, chase, or hold a wild boar","zh":"（用于狩猎的）野猪猎犬；受训用来追踪、追赶或牵制野猪的狗"},"examples":[{"en":"A boarhound can be very brave, but it needs careful training and handling.","zh":"野猪猎犬很勇敢，但需要细心的训练与管理。"},{"en":"In the story, the hunter released his boarhound to follow the boar’s tracks.","zh":"故事里，猎人放出他的野猪猎犬去追踪野猪的足迹。"}]}],"synonyms":["boar hound","boar dog","boarhunter (less common)"],"phonetic":"/ˈbɔrˌhaʊnd/","extraExplanation":["“boarhound”是复合词：boar（野猪）+ hound（猎犬）。在英语里，hound常指“嗅猎犬/猎犬”，用于追踪或追逐猎物。","在现代语境中，这个词比较少见；人们更常说“boar hound”或“boar dog”。在一些国家或地区，狩猎野猪有严格法律限制，因此这个词也常出现在历史、文学或狩猎传统的描述中。"]}
{"word":"boarhunter","summary":{"en":"A boarhunter is someone who hunts wild boar.","zh":"boarhunter 指“猎野猪的人（野猪猎人）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who hunts wild boar (often as a sport, for food, or to control populations).","zh":"猎野猪的人；野猪猎人（常为运动、食用或控制野猪数量）。"},"examples":[{"en":"In the mountains, the boarhunter tracks footprints and disturbed soil.","zh":"在山里，野猪猎人会追踪脚印和被翻动的泥土。"},{"en":"The boarhunter carried sturdy gear because wild boar can be dangerous.","zh":"野猪猎人带着结实的装备，因为野猪可能很危险。"}]}],"synonyms":["boar hunter","wild boar hunter","hog hunter"],"phonetic":"/ˈbɔrˌhʌn.tɚ/","extraExplanation":["“boarhunter”是由 boar（野猪）+ hunter（猎人）组成的复合词，更常见的写法是分开写作 “boar hunter”，也可以用连字符 “boar-hunter”。","在欧美语境中，野猪狩猎常与“野生动物管理（population control）”相关；在某些地区也被视为传统狩猎文化的一部分。写作时可根据语境注意是否涉及安全、法规与动物福利等话题。"]}
{"word":"boarish","summary":{"en":"“Boorish” means rude and badly behaved, showing poor manners and little respect for others.","zh":"“boorish”表示“粗鲁没礼貌、举止欠妥”，带有对他人缺乏尊重的含义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Rude,粗鲁的; having bad manners or behaving in an unpleasant, insensitive way.","zh":"粗鲁的；没礼貌的；指行为令人不快、缺乏体贴或教养。"},"examples":[{"en":"He was boorish at dinner, talking loudly and interrupting everyone.","zh":"他在晚餐时很粗鲁，大声说话还不停打断别人。"},{"en":"She left the party because of his boorish comments.","zh":"因为他那些粗鲁的评论，她离开了聚会。"}]}],"synonyms":["rude","impolite","uncouth","crass","ill-mannered","inconsiderate"],"phonetic":"/ˈbʊrɪʃ/","extraExplanation":["“boorish”来自名词“boor”（粗人、乡巴佬/缺乏教养的人），强调的是“没教养、没分寸”的行为，而不一定指一个人的社会阶层或出身。现代使用时更偏向批评举止粗鄙、缺乏尊重。用在描述他人时语气较重，正式场合可用更委婉的词如“impolite”“inconsiderate”。","注意拼写：boorish（粗鲁的）≠ boar（野猪）。两者发音不同、词源不同。"]}
{"word":"boarishly","summary":{"en":"“Boarishly/boorishly” means “rudely and without manners.” (Standard spelling: boorishly.)","zh":"“boarishly/boorishly”表示“粗鲁无礼地、不懂礼数地”。（更标准拼写是 boorishly。）"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a rude, ill-mannered, or insensitive way; behaving like a boor (a rough, uncultured person).","zh":"粗鲁无礼地；不懂礼数地；以“粗人/莽汉（boor）”般的方式行事。"},"examples":[{"en":"He spoke boarishly to the waiter, snapping his fingers for attention.","zh":"他对服务员说话很粗鲁，还弹手指催人注意。"},{"en":"She criticized him for boarishly interrupting everyone during the meeting.","zh":"她批评他在会议中粗鲁地打断所有人说话。"},{"en":"The guest laughed boarishly at a joke that made others uncomfortable.","zh":"那位客人对一个让别人不舒服的笑话粗鲁地大笑。"}]}],"synonyms":["rudely","boorishly","coarsely","impolitely","crassly","brusquely"],"phonetic":"ˈbɔrɪʃli","extraExplanation":["这个词更常见的形式是 boorishly（来自 boor + -ish + -ly），意思是“像粗人一样”。你输入的 boarishly 也会偶尔出现，但容易让人联想到 boar（公野猪），因此在正式写作中建议用 boorishly。","boor 最早与“农夫/乡下人”的含义有关（与荷兰语 boer 同源），后来在英语里带上贬义，表示“粗俗无礼的人”。"]}
{"word":"boarishness","summary":{"en":"Boarishness means rude, uncivil behavior—the quality of being boorish.","zh":"Boarishness 指粗鲁无礼的行为或粗野没教养的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Rude, coarse, or uncivil behavior; the quality of being boorish.","zh":"粗鲁、粗俗、没教养的行为；粗野无礼的特质。"},"examples":[{"en":"His boarishness at dinner—talking loudly and interrupting everyone—made people uncomfortable.","zh":"他在晚餐上的粗鲁举止——大声说话、不断打断别人——让大家很不舒服。"},{"en":"She apologized for her boarishness and tried to speak more politely.","zh":"她为自己的粗鲁道歉，并试着更有礼貌地说话。"}]}],"synonyms":["rudeness","boorishness","coarseness","uncouthness","bad manners"],"phonetic":"/ˈbʊrɪʃnəs/","extraExplanation":["“boarishness”来自形容词“boorish”（粗鲁的、没教养的），名词后缀“-ness”表示“……的状态/性质”。注意拼写是 boorishness（来自 boor），与 boar（野猪）不同；有人会误拼成“boarishness”。","语气偏负面，常用来批评一个人的社交礼仪或言行举止不尊重他人。更中性的说法可以用“rudeness（无礼）”或“lack of manners（没礼貌）”。"]}
{"word":"boars","summary":{"en":"“Boars” is the plural of “boar”: wild pigs (often males) or male pigs kept for breeding.","zh":"“boars”是“boar”的复数：指野猪（常指雄性）或用于繁殖的公猪/种公猪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wild pig (male); also used more generally for wild pigs","zh":"野猪（多指雄性）；也可泛指野猪"},"examples":[{"en":"A boar can be dangerous if it feels threatened.","zh":"野猪如果感到受威胁，可能会很危险。"},{"en":"Hunters saw fresh tracks from a large boar near the river.","zh":"猎人在河边看到一头大野猪的新鲜足迹。"}]},{"partOfSpeech":"n.","definition":{"en":"male pig raised on a farm, especially one kept for breeding","zh":"（农场饲养的）公猪，尤指用于繁殖的种猪"},"examples":[{"en":"The farmer bought a new boar for breeding.","zh":"农民买了一头新的种公猪来繁殖。"},{"en":"The boar was kept separate from the young piglets.","zh":"这头公猪被单独圈养，和小猪分开。"}]}],"synonyms":["wild pigs","male pigs","razorback (US, some wild boars)"],"phonetic":"/bɔɹ/","extraExplanation":["“boars”是“boar”的复数形式。日常英语里，如果你看到“wild boars”，通常指“野猪”；在农业语境里，“a boar”更常指“公猪/种公猪”。","文化提示：在欧美故事与神话中，野猪常象征力量、凶猛与勇气（如一些中世纪传说或狩猎题材作品），所以在文学或影视里出现时往往带有“危险、强悍”的气氛。"]}
{"word":"boarship","summary":{"en":"“Boarship” is not standard English; you probably mean “board (the) ship” or “warship.”","zh":"“boarship”不是标准英语；你可能想写“board (the) ship（登船）”或“warship（军舰）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or misreading of “board ship” (to get onto a ship) or “warship” (a naval fighting ship).","zh":"不是标准英语单词。很可能是对“board ship”（登船/上船）或“warship”（军舰）的拼写或读音误写/误读。"},"examples":[{"en":"Correct: Passengers will board the ship at 6 p.m.","zh":"正确：乘客将在晚上6点登船。"},{"en":"Correct: The navy deployed a warship to the area.","zh":"正确：海军向该地区部署了一艘军舰。"}]}],"synonyms":["board the ship","boarding","warship"],"phonetic":"/ˈbɔrʃɪp/","extraExplanation":["“board”作动词时表示“上（车/船/飞机）”，因此常见表达是“board the ship”。如果你想表达“登船手续/登船过程”，更自然的说法是“boarding”（例如：boarding time 登船时间）。","如果你的原意是“军舰”，标准拼写是“warship”。“boar”本身是“公野猪”的意思（a wild male pig），与船无关。"]}
{"word":"boarskin","summary":{"en":"Boarskin means the skin/hide of a wild boar, sometimes used as leather.","zh":"Boarskin 指野猪的皮（兽皮），有时也指可用作皮革的野猪皮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the skin or hide of a wild boar, often used (after tanning) as leather","zh":"野猪的皮；（鞣制后可用作皮革的）野猪皮"},"examples":[{"en":"The hunter brought back a boarskin to be cleaned and tanned.","zh":"猎人带回一张野猪皮，准备清洗并鞣制。"},{"en":"A belt made from boarskin can be tough and textured.","zh":"用野猪皮做的皮带可能很结实，纹理也更粗犷。"}]}],"synonyms":["boar skin","boarhide","boar hide","boar leather"],"phonetic":"/ˈbɔrˌskɪn/","extraExplanation":["“boarskin”是复合名词（boar + skin）。在日常英语中更常见的写法是分开写“boar skin”，尤其在描述材料或来源时。","在皮革语境里也可能用“boar hide / boarhide”来表达“野猪皮（革）”。“skin”更强调皮层，“hide”更强调可用于制革的大块兽皮。"]}
{"word":"boarspear","summary":{"en":"A boarspear is a hunting spear made for wild boar, often with a crossbar to stop the boar from pushing up the shaft.","zh":"boarspear 指猎野猪用的长矛，常带横挡以防野猪沿矛杆冲上来。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long spear designed for hunting a wild boar, often with a crossbar (or lugs) below the spearhead to stop the animal from charging up the shaft","zh":"（猎野猪用的）野猪矛；一种长矛，常在矛头下方带有横挡（叉耳/挡片），以防野猪沿矛杆冲上来伤人"},"examples":[{"en":"In the museum, you can see a boarspear used by European hunters centuries ago.","zh":"在博物馆里，你能看到几百年前欧洲猎人使用过的野猪矛。"},{"en":"The boarspear’s crossbar helped keep the boar at a safer distance.","zh":"野猪矛的横挡能把野猪挡在相对安全的距离之外。"}]}],"synonyms":["boar spear","hunting spear","spear"],"phonetic":"/ˈbɔrˌspɪr/","extraExplanation":["“boarspear”也常写作“boar spear”（分开写更常见）。这种武器在欧洲的传统野猪狩猎中较常见；矛头下的横挡（lugs/crossbar）是其典型特征，用来防止野猪被刺中后继续前冲，沿矛杆顶到猎人。现代语境中多见于历史、博物馆、小说或复古狩猎描述。"]}
{"word":"boarstaff","summary":{"en":"A boarstaff is an old-fashioned hunting pole/spear used to hunt wild boar.","zh":"boarstaff 指一种古旧的猎野猪长杆或猎猪矛，用于狩猎野猪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong pole or staff, often tipped with a spearhead (or fitted with a crossbar), used for hunting wild boar; by extension, a boar spear.","zh":"（常指带矛头或带横挡的）猎野猪长杆／猎猪矛；也可泛指“猎野猪用的长矛”。"},"examples":[{"en":"In medieval hunts, a boarstaff helped keep a wounded boar at a safer distance.","zh":"在中世纪的狩猎中，猎猪长杆能把受伤的野猪挡在更安全的距离之外。"},{"en":"The guide carried a boarstaff as protection in thick brush.","zh":"向导在灌木丛里带着猎猪矛防身。"}]}],"synonyms":["boar spear","hunting spear","spear","staff"],"phonetic":"ˈbɔrˌstæf","extraExplanation":["“boarstaff”属于古旧词（archaic/rare），现代更常见的说法是 boar spear（猎猪矛）或 simply spear（矛）。","传统的猎猪武器有时会在矛头后加横挡（crossbar），目的是防止野猪沿着矛杆冲上来伤人；因此它不仅是“刺”，也带有“顶住、阻挡”的功能。","在英式历史与文学语境里，它常用来营造中古/骑士/狩猎氛围，带有强烈的时代感。"]}
{"word":"boart","summary":{"en":"Boart is industrial diamond grit—imperfect diamonds used as an abrasive.","zh":"boart 指用于工业的金刚石砂（不适合作宝石的金刚石碎粒），常作磨料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"low-quality or imperfect diamonds (diamond grit) used for industrial purposes such as drilling, grinding, and polishing","zh":"（用于工业的）劣质/不完整金刚石；金刚石砂（常用于钻孔、研磨、抛光）"},"examples":[{"en":"The drill bit is coated with boart to cut through hard rock.","zh":"钻头表面涂有金刚石砂（boart），用来切割坚硬岩石。"},{"en":"Boart is commonly used as an abrasive in industrial tools.","zh":"boart 常被用作工业工具中的磨料。"}]}],"synonyms":["bort","industrial diamond","diamond grit","diamond dust"],"phonetic":"/bɔɹt/","extraExplanation":["“boart”也常拼作“bort”。在日常英语中很少出现，更多见于采矿、地质、机械加工等专业语境。","它指不适合做宝石的金刚石碎粒或粉末，但因硬度极高，仍非常有价值，常用于切削、打磨和抛光。"]}
{"word":"boarts","summary":{"en":"“Boarts” means industrial-grade diamonds (often imperfect) used as abrasives.","zh":"“boarts”指工业级（多有瑕疵）的钻石，常用作磨料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lower-quality or imperfect diamond used mainly for industrial purposes (especially as an abrasive for cutting, grinding, or drilling); often used in the plural form “boarts.”","zh":"（常用复数 boarts）劣质或有瑕疵的钻石，主要用于工业用途（尤指作研磨料，用于切割、打磨或钻孔）。"},"examples":[{"en":"The drill bit is coated with boarts to cut through hard rock.","zh":"这个钻头涂有 boarts（工业用钻石颗粒），用来切穿坚硬岩石。"},{"en":"Boarts aren’t usually sold as gemstones because they lack clarity.","zh":"boarts 通常不作为宝石出售，因为净度不高。"}]}],"synonyms":["bort","industrial diamonds","diamond grit"],"phonetic":"/boʊɑrt/","extraExplanation":["“boart/boarts”也常见拼写为“bort/borts”。在日常英语里比较少见，多出现在采矿、材料加工、珠宝鉴定或工业工具相关语境中。","和“gem-quality diamond（宝石级钻石）”相对：宝石级强调透明度、切工与观赏价值；boarts 更强调硬度与耐磨性，用来当磨料或涂层材料。"]}
{"word":"boarwood","summary":{"en":"“Boarwood” is a rare/nonstandard term meaning a woodland linked to wild boars, and it is also often used as a proper name (place/person/fictional location).","zh":"“Boarwood”是罕见/非标准词，可指与野猪相关的林地；也常作为专名（地名/人名/虚构地点）使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/Nonstandard) A wooded area associated with wild boars; essentially “boar wood” (a forest/woodland where boars live or are hunted).","zh":"（罕见/非标准用法）与野猪有关的林地；相当于“boar wood”，指野猪栖息或狩猎野猪的森林/树林。"},"examples":[{"en":"In the old tale, the hunter vanished into the boarwood before dawn.","zh":"在那则古老的故事里，猎人天亮前消失在野猪林里。"},{"en":"They tracked the animal to the edge of the boarwood.","zh":"他们一路追踪那只动物到野猪林的边缘。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A name that may refer to a place, family name, or fictional location; meaning depends on context.","zh":"（专有名词）可能是地名、姓氏或虚构地点名；具体含义取决于语境。"},"examples":[{"en":"Boarwood appears as a village name in the novel.","zh":"《小说》中出现了“Boarwood”这个村庄名。"},{"en":"She signed the email as Jordan Boarwood.","zh":"她在邮件落款写的是 Jordan Boarwood。"}]}],"synonyms":["woodland","forest","boar wood"],"phonetic":"/ˈbɔrˌwʊd/","extraExplanation":["“boarwood”不是现代英语里常见的标准词汇，更常见的写法是分开写成“boar wood”（野猪林地）或用更普通的词如“woodland/forest”。","如果你是在游戏、小说、地图或品牌里看到“Boarwood”，它很可能是专名（地名/角色名），通常带有“野猪 + 森林”的意象，用来营造粗犷、野性或中世纪氛围。","容易混淆的常见词：boardwalk（木栈道）、firewood（柴火）、underwood（灌木丛/林下灌木）。"]}
{"word":"Boas","summary":{"en":"“Boas” is the plural of “boa,” meaning either large constrictor snakes or feather/fur fashion scarves.","zh":"“Boas”是“boa”的复数，可指大型缠绕型蟒蛇，也可指羽毛/皮草做的长条披肩围巾。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “boa”: a large, non-venomous constrictor snake (such as a boa constrictor).","zh":"“boa”的复数：蟒蛇类的大型无毒缠绕型蛇（如森蚺/蟒蛇，常说 boa constrictor）。"},"examples":[{"en":"Boas kill their prey by squeezing, not by venom.","zh":"蟒蛇是靠缠绕挤压来捕食的，不是靠毒液。"},{"en":"At the zoo, we saw several boas in the reptile house.","zh":"在动物园里，我们在爬行动物馆看到了好几条蟒蛇。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of “boa”: a long scarf-like wrap made of feathers or fur, worn for fashion.","zh":"“boa”的复数：一种长条状围巾/披肩，常用羽毛或皮草做成，用于装饰穿搭。"},"examples":[{"en":"The dancers wore colorful feather boas on stage.","zh":"舞者在舞台上戴着彩色的羽毛围巾。"},{"en":"She bought two boas for the costume party.","zh":"她为化装舞会买了两条羽毛披肩。"}]}],"synonyms":["constrictor snakes","feather scarves","wraps"],"phonetic":"/ˈboʊ.əz/","extraExplanation":["“boa”作“羽毛围巾/披肩”时，在英语文化里常和歌舞表演、复古好莱坞造型、化装舞会等场景联系在一起。"]}
{"word":"boas","summary":{"en":"“Boas” is the plural of “boa,” meaning either large constrictor snakes or long feather/fur scarves.","zh":"“Boas”是“boa”的复数，可指大型蟒蛇，也可指长羽毛/皮草围巾。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “boa”: a large snake that kills by squeezing, or a long feather/fur scarf worn for fashion","zh":"“boa”的复数：一种大型蟒蛇（靠缠绕挤压猎物），或指用于装饰的长羽毛/皮草围巾"},"examples":[{"en":"Boas are not usually venomous, but they can be dangerous to small animals.","zh":"蟒蛇通常不具毒性，但对小动物可能很危险。"},{"en":"At the show, some dancers wore bright feather boas.","zh":"在演出中，有些舞者戴着鲜艳的羽毛围巾（boas）。"}]}],"synonyms":["constrictor snakes","feather scarves"],"phonetic":"/ˈboʊəz/","extraExplanation":["“boa”既可以指“蟒蛇”（如 boa constrictor），也可以指时尚配饰“羽毛围巾/皮草围巾”。在语境不明确时，可通过搭配词判断：snake/reptile/habitat 多半是“蛇”；feather/fur/wear/costume 多半是“围巾”。","读音提示：表示“围巾”的 boa 在派对、舞台服装语境里很常见，例如 feather boa（羽毛围巾）。"]}
{"word":"boast","summary":{"en":"“Boast” means to brag proudly (often too proudly), or, in formal writing, to have something impressive as a feature.","zh":"“boast”常指“吹嘘/自夸”，有时带负面语气；在较正式文体中也可表示“拥有（令人称道的特点）”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to talk with too much pride about your abilities, achievements, or possessions; to brag","zh":"吹嘘；自夸（过度自豪地谈论自己的能力、成就或拥有的东西）"},"examples":[{"en":"He always boasts about how much money he makes.","zh":"他总是吹嘘自己赚了多少钱。"},{"en":"She didn’t boast, even after winning the competition.","zh":"即使赢了比赛，她也没有自夸。"}]},{"partOfSpeech":"vt.","definition":{"en":"to say something with pride (often in a way that sounds arrogant)","zh":"夸口说；自豪地宣称（常带自大/招人反感的感觉）"},"examples":[{"en":"He boasted that he could finish the job in one day.","zh":"他夸口说自己一天就能把活干完。"}]},{"partOfSpeech":"n.","definition":{"en":"a proud statement about what you have done or what you have","zh":"自夸的话；吹嘘之词"},"examples":[{"en":"Her boast about being the best annoyed everyone.","zh":"她吹嘘自己最厉害，让大家都很反感。"}]},{"partOfSpeech":"vt.","definition":{"en":"to have something as a notable feature (often used in formal writing)","zh":"拥有（值得称道的特点；多用于较正式的表达）"},"examples":[{"en":"The city boasts a long history and beautiful architecture.","zh":"这座城市拥有悠久的历史和美丽的建筑。"},{"en":"The restaurant boasts over 100 dishes on its menu.","zh":"这家餐厅的菜单上有一百多道菜。"}]}],"synonyms":["brag","show off","gloat","vaunt"],"phonetic":"/boʊst/","extraExplanation":["“boast”通常带有负面语气，暗示说话者夸大其词或显得自大。更中性的表达可以用“be proud of（为……感到自豪）”“be pleased with（对……满意）”。","在宣传语或旅游/商业文案中，“boast”常用作较正式的“拥有、具备”，语气更积极，如“boasts a stunning view（坐拥绝美景色）”。"]}
{"word":"boasted","summary":{"en":"“Boasted” is the past form of “boast,” meaning either bragging proudly (often too proudly) or saying something has an impressive feature.","zh":"“Boasted”是“boast”的过去式/过去分词，可指（人）自夸吹嘘，也可指（事物）拥有引以为豪的特色。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “boast”: to speak with too much pride about your own achievements, possessions, or abilities.","zh":"“boast”的过去式/过去分词：自夸；吹嘘（过度自豪地谈论自己的成就、财物或能力）。"},"examples":[{"en":"He boasted about his new car all weekend.","zh":"他整个周末都在吹嘘自己的新车。"},{"en":"She boasted that she could finish the project in one day.","zh":"她夸口说自己一天就能完成这个项目。"},{"en":"They have never boasted of their success; they let the work speak for itself.","zh":"他们从不炫耀自己的成功，而是让成果自己说话。"}]},{"partOfSpeech":"v.","definition":{"en":"to have or show (a feature or quality) proudly; to possess something notable (often used for places or things).","zh":"（常指地点或事物）以……为特色；拥有（值得称道的特征），带有“引以为豪”的语气。"},"examples":[{"en":"The city boasted a beautiful riverwalk and lively markets.","zh":"这座城市以美丽的河滨步道和热闹的市集为特色。"},{"en":"The hotel boasted free breakfast and a rooftop pool.","zh":"这家酒店主打免费早餐和屋顶泳池。"}]}],"synonyms":["bragged","showed off","gloated","claimed proudly"],"phonetic":"/boʊst/","extraExplanation":["“boast”既可以指人“自夸/吹嘘”（语气通常偏负面，暗示不够谦虚），也可以指事物“拥有（令人称道的特点）”，后者在广告、旅游介绍里很常见，语气更中性甚至偏正面。","常见搭配：boast about + 名词/动名词（boast about winning）；boast that + 从句（boast that he won）；boast of + 名词（更正式）。"]}
{"word":"boaster","summary":{"en":"A boaster is someone who brags too much about themselves.","zh":"boaster 指“爱吹嘘、自夸的人”，通常带贬义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who talks with too much pride about their own achievements, abilities, or possessions.","zh":"自夸的人；爱吹嘘的人（过度炫耀自己的成就、能力或拥有的东西）。"},"examples":[{"en":"He’s a boaster who always turns the conversation back to his success.","zh":"他很爱吹嘘，总把话题转回自己的成功。"},{"en":"Nobody likes a boaster, especially when the claims aren’t true.","zh":"没人喜欢爱吹嘘的人，尤其是那些话不属实的时候。"},{"en":"In many stories, the boaster is humbled in the end.","zh":"在许多故事里，爱吹嘘的人最后往往会被打脸、受到教训。"}]}],"synonyms":["braggart","bragger","show-off","self-promoter"],"phonetic":"/ˈboʊstɚ/","extraExplanation":["“boaster”通常带负面含义，暗示说话者不只是自信，而是夸大其词、想赢得注意或高人一等。","常见搭配：a shameless boaster（厚脸皮的吹牛者）、a loud boaster（大声炫耀的人）。与“braggart”意思非常接近，语气也偏贬义。"]}
{"word":"boasters","summary":{"en":"“Boasters” means people who brag too much about themselves.","zh":"“boasters”指爱吹嘘、过分自夸的人（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who boast—those who speak with too much pride about their own abilities, achievements, or possessions.","zh":"吹牛者；自夸的人——指过分自豪地谈论自己的能力、成就或拥有的东西的人。"},"examples":[{"en":"The internet is full of boasters who exaggerate their success.","zh":"网上到处都是夸大自己成功的吹牛者。"},{"en":"He disliked boasters and preferred humble people.","zh":"他不喜欢自夸的人，更喜欢谦虚的人。"}]}],"synonyms":["braggers","show-offs","big talkers"],"phonetic":"/ˈboʊstərz/","extraExplanation":["“boasters”是“boaster”的复数形式，来自动词“boast”（吹嘘、自夸）。语气通常偏负面，暗示说话者在夸大或炫耀。","近义词区分：bragger（口语、直白“爱吹的人”）；show-off（更强调“爱炫耀、显摆”）；big talker（强调“只会说大话”）。","常见搭配：empty boasters（空口吹牛的人）、loud boasters（大声炫耀的人）、self-proclaimed boasters（自称很厉害的人）。"]}
{"word":"boastest","summary":{"en":"“Boastest” is an old-fashioned form meaning “you boast,” used with “thou.”","zh":"“boastest”是古英语/文体用法，表示“你在自夸”，常与“thou”搭配。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"an archaic second-person singular form of “boast,” meaning “you boast” (used with “thou”).","zh":"“boast”的古体第二人称单数形式，意思是“你在夸口/自夸”（常与“thou”连用）。"},"examples":[{"en":"Thou boastest of thy strength, but canst thou keep thy promise?","zh":"你夸口说自己很强，但你能信守诺言吗？"},{"en":"Why boastest thou, if thy deeds do not match thy words?","zh":"若你的行为配不上言辞，你又何必自夸？"}]}],"synonyms":["brag","show off","vaunt (formal)","gloat (when meaning proud about winning)"],"phonetic":"/boʊˈstɛst/","extraExplanation":["“boastest”里的 -est 是早期现代英语（莎士比亚时代、圣经语体等）常见的动词词尾，用来配合第二人称单数主语 “thou”。现代英语里一般不用这种变化，通常直接说 “you boast”。","同一套古体搭配里常见：thou boastest（你夸口），thou speakest（你说），thou goest（你去）。"]}
{"word":"boastful","summary":{"en":"“Boastful” describes someone who brags too much about themselves.","zh":"“boastful”用来形容一个人太爱吹嘘、过度自夸。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Talking with too much pride about your own achievements, abilities, or possessions; bragging.","zh":"自夸的；爱吹嘘的；自负地炫耀自己的成就、能力或拥有的东西。"},"examples":[{"en":"He sounded boastful when he kept talking about how much money he makes.","zh":"他一直说自己赚多少钱，听起来很爱炫耀。"},{"en":"Her boastful posts online made some classmates uncomfortable.","zh":"她在网上那些自夸的发帖让一些同学觉得不舒服。"},{"en":"Try to be confident without being boastful.","zh":"尽量自信，但不要变成爱吹嘘。"}]}],"synonyms":["bragging","conceited","self-important","vainglorious","cocky"],"phonetic":"/ˈboʊstfəl/","extraExplanation":["“Boastful”通常带有负面评价：不是单纯“自信”，而是让人感觉在刻意抬高自己、压过别人。常见搭配有 boastful tone/remark/person（夸夸其谈的语气/话/人）。在礼貌文化语境里，过于boastful可能被视为不谦逊。"]}
{"word":"boastfully","summary":{"en":"“Boastfully” means speaking or acting in a bragging, showy way about yourself.","zh":"“boastfully”表示以自夸、爱炫耀的方式说话或做事。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows too much pride and talks about your own achievements in an annoying or showy way.","zh":"以自夸的、爱炫耀的方式；带着过度自豪、让人反感地谈论自己的成就。"},"examples":[{"en":"He spoke boastfully about his promotion at every chance he got.","zh":"他逢人就自夸自己的升职。"},{"en":"She boastfully claimed she could finish the project in one day, but it took a week.","zh":"她自夸说一天就能做完这个项目，但结果花了一周。"}]}],"synonyms":["braggingly","arrogantly","self-importantly"],"phonetic":"/ˈboʊstfəli/","extraExplanation":["“boastfully”通常带负面评价，暗示说话者不够谦虚，甚至有点惹人厌。更中性或礼貌的表达可以用“proudly”（自豪地）或“confidently”（自信地），看语境决定褒贬。","词形关系：boast（v./n. 夸口/夸耀）→ boastful（adj. 爱夸口的）→ boastfully（adv. 自夸地）。"]}
{"word":"boastfulness","summary":{"en":"Boastfulness means the habit of bragging—talking too proudly about yourself.","zh":"Boastfulness 指“爱吹嘘/自夸”的习惯或特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The habit or quality of talking with too much pride about your own achievements, possessions, or abilities; bragging.","zh":"夸夸其谈；自夸；爱吹嘘（指过度自豪地谈论自己的成就、财物或能力的习惯/特质）。"},"examples":[{"en":"His boastfulness made it hard for others to work with him.","zh":"他爱吹嘘的性格让别人很难和他共事。"},{"en":"She tried to hide her boastfulness by joking, but it still sounded like bragging.","zh":"她试图用开玩笑来掩饰自己的自夸，但听起来还是像在炫耀。"},{"en":"In some cultures, modesty is valued, so boastfulness can be seen as rude.","zh":"在一些文化中，谦逊更受重视，所以自夸可能被视为无礼。"}]}],"synonyms":["bragging","self-praise","vainglory","swagger","self-advertising"],"phonetic":"/ˈboʊstf(ə)lnəs/","extraExplanation":["“boastfulness”来自动词“boast”（吹嘘、夸口）+ 名词后缀“-fulness”（表示“充满……的状态/特质”）。语气通常偏负面，常与“modesty（谦虚）”形成对比。","近义词里：bragging 更口语、直接；self-praise 强调“自我表扬”；arrogance（傲慢）范围更大，不一定通过“说出来”表现。"]}
{"word":"boasting","summary":{"en":"“Boasting” means showing off by talking too proudly about yourself or what you have done; it can also mean the act of doing this.","zh":"“Boasting”表示“夸耀/炫耀”，即过于骄傲地谈论自己或自己的成就；也可指这种夸耀行为本身。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"talking with too much pride about what you have or what you have done; showing off","zh":"夸耀的；自夸的；炫耀的（对自己的成就或拥有的东西说得过于骄傲）"},"examples":[{"en":"He kept boasting about his new car.","zh":"他一直在夸耀他的新车。"},{"en":"Her boasting made some people uncomfortable.","zh":"她的自夸让一些人感到不舒服。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of talking proudly, sometimes too proudly, about yourself or your achievements","zh":"夸耀；自吹自擂（的行为）"},"examples":[{"en":"There was a lot of boasting after the team won.","zh":"球队赢了之后，出现了很多夸耀。"},{"en":"A little confidence is fine, but constant boasting can hurt relationships.","zh":"有点自信没问题，但一直自夸会伤害人际关系。"}]}],"synonyms":["bragging","showing off","self-praise"],"phonetic":"/ˈboʊstɪŋ/","extraExplanation":["“boasting”来自动词“boast”（夸耀）。在日常使用中，它常带有负面评价：暗示说话者在“炫耀”或“自吹”。如果想表达更中性的“自信地介绍”，可以用“talk about (something) proudly / share (something) with pride”，语气更柔和。"]}
{"word":"boastingly","summary":{"en":"“Boastingly” means ‘in a bragging, show-off way.’","zh":"“boastingly”表示“以自夸、炫耀的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a proud, bragging way; in a manner that shows off achievements or possessions.","zh":"自夸地；吹嘘地；以炫耀的方式（谈论成就或拥有的东西）。"},"examples":[{"en":"He spoke boastingly about his new car.","zh":"他吹嘘地谈起他的新车。"},{"en":"The company boastingly claimed it was the best in the industry.","zh":"那家公司自夸地宣称自己是行业里最好的。"},{"en":"She posted boastingly about her promotion, which annoyed some coworkers.","zh":"她炫耀地发了自己升职的动态，这让一些同事不太舒服。"}]}],"synonyms":["braggingly","vaingloriously","showily"],"phonetic":"/ˈboʊstɪŋli/","extraExplanation":["“boastingly”来自动词 boast（吹嘘、夸耀）+ 副词后缀 -ly。它通常带有负面语气：说话者显得自大或刻意炫耀。更中性的表达可以用 proudly（自豪地）或 confidently（自信地），取决于语境和态度。"]}
{"word":"boastings","summary":{"en":"“Boastings” means bragging statements or the habit/act of boasting.","zh":"“boastings”指自夸/吹嘘的话，也可指自夸的行为或习惯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"proud or exaggerated statements about what you have done or what you can do; bragging talk (plural of “boasting”).","zh":"自夸的话；吹嘘之词（“boasting”的复数）。"},"examples":[{"en":"His boastings about his grades made his classmates uncomfortable.","zh":"他一直吹嘘自己的成绩，让同学们很不舒服。"},{"en":"Ignore the boastings online and look for real evidence.","zh":"别理会网上的吹嘘，去找真实的证据。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or habit of talking with too much pride about yourself or your achievements.","zh":"自夸的行为或习惯；爱吹嘘。"},"examples":[{"en":"Her constant boastings hurt teamwork.","zh":"她不断的自夸伤害了团队合作。"},{"en":"He apologized for his boastings during the meeting.","zh":"他为自己在会议上的吹嘘道了歉。"}]}],"synonyms":["bragging","brags","self-praise","vaunting"],"phonetic":"/ˈboʊstɪŋz/","extraExplanation":["“boastings”通常带有负面色彩，暗示说话者夸大其词或不够谦逊。正式写作里常见于批评语气，例如：empty boastings（空洞的吹嘘）。"]}
{"word":"boastive","summary":{"en":"Boastive is a rare adjective meaning “boastful” or “showing off.”","zh":"Boastive 是一个罕见形容词，意思是“爱自夸的/爱炫耀的”（相当于 boastful）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Tending to boast; boastful; showing off in a proud way.","zh":"（罕见）爱夸口的；自夸的；爱炫耀的。"},"examples":[{"en":"His boastive talk made it hard for others to enjoy the conversation.","zh":"他那种爱夸口的说法让别人很难享受这段谈话。"},{"en":"She tried to sound confident, but it came across as boastive.","zh":"她想表现得自信，但听起来却像在自夸。"}]}],"synonyms":["boastful","bragging","self-important","showy"],"phonetic":"/ˈboʊstɪv/","extraExplanation":["“boastive”在现代英语里非常少见，更常用的是“boastful”。在阅读较旧的文学作品、诗歌或仿古文体时，你可能会遇到它。","词形上，“boast”加上形容词后缀“-ive”（表示“倾向于……/具有……性质”），构成“boastive”，意思就是“倾向于夸口”。日常写作与考试中建议用“boastful”。"]}
{"word":"boastless","summary":{"en":"Boastless means “not boasting; modest,” and it is a rare, literary-sounding word.","zh":"boastless 表示“不会自夸、很谦虚”，偏少见，带一点文学/书面语色彩。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not boasting; modest and unpretentious (rare in modern English)","zh":"不自夸的；谦虚的、低调的（现代英语中较少见）"},"examples":[{"en":"Despite his success, he remained boastless and kind.","zh":"尽管很成功，他依然谦虚低调、待人友善。"},{"en":"Her boastless tone made the compliment feel sincere.","zh":"她不夸耀的语气让赞美听起来很真诚。"}]}],"synonyms":["modest","humble","unassuming","self-effacing"],"phonetic":"/ˈboʊstləs/","extraExplanation":["“boastless”由 boast（自夸）+ -less（无、缺少）构成，字面意思是“没有自夸”。在当代更常用 modest, humble, unassuming 等词来表达。","这个词更常见于较老的书面语、诗歌或强调品格的描述中，用来突出“功成不居、低调不张扬”的气质。"]}
{"word":"boasts","summary":{"en":"“Boasts” is the third-person singular of “boast” (brag, or formally “have/feature”), and it can also be the plural noun meaning “bragging statements.”","zh":"“boasts”是“boast”的第三人称单数（吹嘘；正式用法：拥有/以……为特色），也可作名词复数，表示“自夸的话”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(v.) to talk with too much pride about what you have, do, or are; to brag","zh":"（动词）自夸；吹嘘（过度自豪地谈论自己拥有/做过/是什么）"},"examples":[{"en":"He often boasts about his grades.","zh":"他经常吹嘘自己的成绩。"},{"en":"The company boasts that its app is the fastest on the market.","zh":"这家公司宣称他们的应用是市面上最快的。"},{"en":"She doesn’t boast, even though she’s very talented.","zh":"她很有才华，但并不自夸。"}]},{"partOfSpeech":"v.","definition":{"en":"(v.) to have or include something impressive (often used in formal writing)","zh":"（动词）拥有（令人印象深刻的事物）；以……为特色（较正式用法）"},"examples":[{"en":"The hotel boasts a rooftop pool and a city view.","zh":"这家酒店拥有屋顶泳池和城市景观。"},{"en":"The region boasts rich history and beautiful landscapes.","zh":"这个地区以悠久历史和优美风景著称。"}]},{"partOfSpeech":"n.","definition":{"en":"(n.) a proud statement about yourself or your achievements; bragging words","zh":"（名词）自夸的话；吹嘘（的言语）"},"examples":[{"en":"His boasts annoyed everyone.","zh":"他的自夸让大家都很烦。"},{"en":"Ignore their boasts and focus on your work.","zh":"别理他们的吹嘘，专心做你的事。"}]}],"synonyms":["brag","show off","gloat","claim","tout","have","feature"],"phonetic":"/boʊst/","extraExplanation":["“boast”常带一点负面评价（觉得在炫耀）。但“boast + 名词”（如boasts a pool / boasts rich history）多为中性、偏正式，意思更接近“拥有/以……为特色”。","常见搭配：boast about (something)（吹嘘……）；boast of (something)（较正式：夸口有……/以……自豪）；be not one to boast（不是爱自夸的人）。"]}
{"word":"boasts beautiful beaches","summary":{"en":"“Boasts beautiful beaches” means a place has beautiful beaches and highlights them proudly as a special feature.","zh":"“boasts beautiful beaches”表示某地拥有美丽的海滩，并把它作为值得自豪的特色来强调。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(In travel or promotional writing) to have beautiful beaches and proudly mention or emphasize this as a good feature.","zh":"（常用于旅游/宣传语）拥有美丽的海滩，并自豪地强调这是一个优点。"},"examples":[{"en":"The island boasts beautiful beaches and clear blue water.","zh":"这个岛屿以美丽的海滩和清澈的蓝色海水而闻名。"},{"en":"The town boasts beautiful beaches, but it can be crowded in summer.","zh":"这个小镇有美丽的海滩，但夏天可能很拥挤。"},{"en":"Our coast boasts beautiful beaches perfect for families.","zh":"我们的海岸有适合家庭游玩的美丽海滩。"}]}],"synonyms":["has beautiful beaches","is known for beautiful beaches","is famous for beautiful beaches","features beautiful beaches"],"phonetic":"/boʊsts ˈbjuːtɪfəl ˈbiːtʃɪz/","extraExplanation":["“boast”在这里通常不是“吹牛”那种负面语气，而是偏中性/正面的“以……为傲、引以为特色”，常见于旅游介绍、城市宣传、广告文案等。","也常见替换表达：“is known for beautiful beaches / is famous for beautiful beaches / has beautiful beaches”。其中“boasts”更有“值得骄傲的亮点”这层感觉。"]}
{"word":"boat","summary":{"en":"Boat means a small watercraft, or the act of traveling on water in one.","zh":"boat 指“小船/艇”，也可作动词表示“乘船航行”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small vessel used for traveling on water, especially on rivers, lakes, or near the coast","zh":"船；小艇（用于在河流、湖泊或近海水域航行的水上交通工具）"},"examples":[{"en":"We rented a small boat and rowed across the lake.","zh":"我们租了一艘小船，划过了湖面。"},{"en":"The fishermen pulled their boat onto the shore.","zh":"渔民把船拉上了岸。"}]},{"partOfSpeech":"v.","definition":{"en":"to travel by boat; to go on the water in a boat","zh":"乘船（出行）；坐船在水上航行"},"examples":[{"en":"In summer, people like to boat on the river.","zh":"夏天，人们喜欢在河上乘船游玩。"}]}],"synonyms":["vessel","craft","skiff","dinghy"],"phonetic":"/boʊt/","extraExplanation":["“Boat”通常指较小的船；较大的船更常用“ship”。不过在日常口语里，人们也可能把一些中型船只泛称为boat。","常见搭配：row a boat（划船）、sail a boat（驾驶帆船）、fishing boat（渔船）、boat ride（乘船游览）、miss the boat（错过机会/没赶上）。"]}
{"word":"boat-accessibly","summary":{"en":"“Boat-accessibly” means “in a way that is accessible by boat,” though “accessible by boat” is more common.","zh":"“boat-accessibly”表示“以可乘船到达的方式/通过船只通达”，但更常用的表达是“accessible by boat”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Not very common) In a way that can be reached or entered by boat; by means of boat access.","zh":"（不太常见）以可乘船到达/进入的方式；通过船只通达。"},"examples":[{"en":"The island can only be reached boat-accessibly during the summer months.","zh":"这座岛在夏季才只能以“可乘船到达”的方式抵达。"},{"en":"They designed the lodge boat-accessibly so guests could arrive from the lake.","zh":"他们把小屋设计成可从湖上乘船到达，方便客人抵达。"}]},{"partOfSpeech":"adv.","definition":{"en":"Used (especially in real estate, tourism, and maps) to describe access that is practical or intended to be by boat.","zh":"（多用于房产、旅游、地图语境）指某处的通行方式实际或主要是乘船。"},"examples":[{"en":"Several campsites are boat-accessibly located along the river.","zh":"河边有几个露营地的位置属于可乘船到达。"},{"en":"The quiet beach is boat-accessibly tucked behind the cliffs.","zh":"那片安静的海滩藏在悬崖后面，可乘船到达。"}]}],"synonyms":["accessible by boat","by boat","reachable by boat","boat-accessible (adj.)"],"phonetic":"/boʊt əkˈsɛsəbli/","extraExplanation":["“boat-accessibly”在英语里不算常见，更自然的写法通常是：\n1) 形容词：boat-accessible（可乘船到达的）\n2) 介词短语：accessible by boat（可通过船到达）\n在正式写作里，建议优先用“accessible by boat”。","连字符（-）常见于地图标注、旅游宣传、房产描述中，用来把“boat + accessible”组合成一个修饰词。也可以写成不加连字符的“boat accessible”，但连字符更清晰。"]}
{"word":"boat-head","summary":{"en":"A (usually informal) term for someone who’s really into boats or boating.","zh":"指（多为非正式用法）很喜欢船或划船/航海活动的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A person who is very interested in boats and boating; a boating enthusiast.","zh":"（非正式）热爱船只与航海/划船活动的人；船迷。"},"examples":[{"en":"On weekends he turns into a total boat-head and spends all day at the marina.","zh":"周末他就完全成了船迷，整天待在码头。"},{"en":"The boat-heads in our neighborhood trade tips about engines and safety gear.","zh":"我们社区的船迷会互相交流发动机和安全装备的经验。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, joking) A person who owns or uses a boat a lot, especially as a hobby.","zh":"（非正式、玩笑）经常拥有或使用船的人（多指把船当作爱好）。"},"examples":[{"en":"I’m not a boat-head, but I rent a small fishing boat a few times each summer.","zh":"我不算船迷，但每年夏天会租几次小渔船去钓鱼。"},{"en":"Her brother is a boat-head—he’s always inviting friends out on the lake.","zh":"她哥哥是个“船迷”——总爱邀朋友去湖上玩。"}]}],"synonyms":["boating enthusiast","boater","boat lover","sailor (context-dependent)"],"phonetic":"/ˈboʊtˌhɛd/","extraExplanation":["“boat-head/boathead”属于口语、非正式用法，并不是非常常见的标准词汇；更多时候人们会说“boating enthusiast（航海/划船爱好者）”“boater（玩船的人）”。","写法上可能见到连字符（boat-head）或合写（boathead）；含义通常不变，连字符写法更像临时组合或强调。"]}
{"word":"boat-headed","summary":{"en":"Boat-headed means either “boat-shaped-headed” (literal) or, in old informal use, “stupid.”","zh":"boat-headed 可指“头部像船形”（字面义），也可指（过时的非正式用法）“愚笨的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a head shaped like a boat (long, rounded, or boat-like in outline).","zh":"头部形状像船（轮廓细长、圆弧，类似船形）。"},"examples":[{"en":"The fossil was described as boat-headed, with a long, rounded skull.","zh":"这块化石被描述为“船头形”，头骨细长而圆弧。"},{"en":"In the illustration, the creature looks boat-headed compared with the others.","zh":"在插图里，这个生物的头看起来比其他的更像船形。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Old-fashioned, informal) Stupid; slow to understand.","zh":"（过时，非正式）愚笨的；反应迟钝的。"},"examples":[{"en":"He called himself boat-headed for missing such an obvious clue.","zh":"他因为漏掉一个明显的线索而自嘲“蠢到不行”。"},{"en":"That boat-headed mistake cost us an extra hour.","zh":"那个愚蠢的错误让我们多花了一小时。"}]}],"synonyms":["boat-shaped","long-headed","dull","slow-witted","stupid"],"phonetic":"/ˈboʊtˌhɛdɪd/","extraExplanation":["“boat-headed”字面意思容易理解，但在现代英语里非常少见；如果你想表达“笨”，更常用的说法是 “stupid / dumb / clueless”（语气强弱不同，要注意礼貌与场合）。在科学或描述性写作中，它更可能是字面含义，用来形容头骨或外形轮廓。"]}
{"word":"boat-shaped","summary":{"en":"“Boat-shaped” means shaped like a boat (long, curved, often with raised ends), and it’s also used in anatomy for boat-like hollows or arches.","zh":"“boat-shaped”表示“船形的”（细长弯曲、两端常翘起），也可用于解剖学描述呈船状的凹陷或拱形结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape of a boat—long and curved, often with raised ends (like a canoe).","zh":"船形的；像小船一样细长弯曲、两端常微微翘起（类似独木舟）。"},"examples":[{"en":"The lamp has a boat-shaped base made of wood.","zh":"这盏灯的底座是木制的船形底座。"},{"en":"They served sushi on a boat-shaped platter.","zh":"他们用船形的托盘来盛寿司。"},{"en":"Her boat-shaped shoes are also called “mules” in some styles.","zh":"她那双船形的鞋在某些款式里也被称为“穆勒鞋”。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Anatomy) Describing a hollow or arched structure that looks like a small boat.","zh":"（解剖）指某个凹陷或拱起的结构呈“船状/舟状”。"},"examples":[{"en":"Doctors noted a boat-shaped depression in the chest.","zh":"医生注意到胸部有一个船状凹陷。"},{"en":"The term “scaphoid” literally means boat-shaped.","zh":"“scaphoid（舟骨）”这个词字面意思就是“船形的”。"}]}],"synonyms":["boatlike","canoe-shaped","skiff-shaped","scaphoid (anatomy)"],"phonetic":"/ˈboʊt ˌʃeɪpt/","extraExplanation":["“boat-shaped”是一个复合形容词（compound adjective），通常放在名词前面：a boat-shaped bowl / a boat-shaped valley。也可以放在系动词后面：The bowl is boat-shaped。","在解剖学里常见同义表达是“scaphoid”（源自希腊语，意为“像小船”），例如：scaphoid bone（舟骨）。日常英语里更常用“boat-shaped”来直观描述外形。"]}
{"word":"boat-side","summary":{"en":"Boat-side means “the side of a boat,” and can also describe something located there or happening near the boat in contexts like fishing.","zh":"boat-side 指“船的一侧”，也可形容“位于船侧的”，在钓鱼等语境中还可表示“在船边”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the side of a boat (the left or right side), especially as a reference point for position or movement","zh":"船的一侧（左舷或右舷），常用来表示位置或移动方向"},"examples":[{"en":"Please keep your hands inside the boat-side railing.","zh":"请把手放在船侧护栏以内。"},{"en":"Water splashed up the boat-side as we sped across the lake.","zh":"我们在湖面上加速时，水花溅到船侧。"}]},{"partOfSpeech":"adj.","definition":{"en":"located on or happening along the side of a boat","zh":"位于船侧的；在船侧发生的"},"examples":[{"en":"The boat-side ladder was lowered for boarding.","zh":"船侧的梯子被放下以便登船。"},{"en":"They installed boat-side lights for night trips.","zh":"他们安装了船侧灯用于夜间航行。"}]},{"partOfSpeech":"adv.","definition":{"en":"near the side of the boat; used especially in fishing to describe the moment a fish comes close to the boat","zh":"在船边；（尤指钓鱼时）鱼靠近船边的时刻"},"examples":[{"en":"The fish made one last run when it reached boat-side.","zh":"鱼游到船边时又做了最后一次冲刺。"},{"en":"Be careful at boat-side—the hook can swing toward you.","zh":"在船边要小心——鱼钩可能会甩向你。"}]}],"synonyms":["side of the boat","port side","starboard side","boatside"],"phonetic":"/ˈboʊtˌsaɪd/","extraExplanation":["“boat-side”常见写法也会分开写作“boat side”，或合写“boatside”。在钓鱼语境里更常看到“boatside/at boatside”，强调鱼靠近船边、最容易脱钩或需要抄网（landing net）的阶段。","从航海/划船角度，“side of the boat”更中性常用；如果要更具体，英语里常用“port side（左舷）/starboard side（右舷）”。"]}
{"word":"boatable","summary":{"en":"Boatable means “suitable for boating” (most common), or less commonly “able to be carried in a boat.”","zh":"Boatable 通常指“可通船/适合行船的”，较少见也可指“能装船携带的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to float and be traveled on by a boat; suitable or safe for boating.","zh":"可通船的；适合（或安全）行船的。"},"examples":[{"en":"After the heavy rains, the river became boatable again.","zh":"大雨过后，这条河又变得可以行船了。"},{"en":"This lake is boatable in summer, but it freezes in winter.","zh":"这个湖夏天可以划船，但冬天会结冰。"}]},{"partOfSpeech":"adj.","definition":{"en":"Able to be carried in a boat; small or light enough to take on a boat.","zh":"可装船携带的；小到（或轻到）可以放进船里带走的。"},"examples":[{"en":"Pack only boatable gear for the island trip.","zh":"去小岛旅行只带能装船携带的装备。"}]}],"synonyms":["navigable","suitable for boating","canoeable","raftable"],"phonetic":"/ˈboʊtəbl/","extraExplanation":["“boatable”由“boat + -able”构成，-able 表示“能够……的/适合……的”。在实际使用中，更常见的是第一个意思（“可通航/可行船”），常用于描述河流、湖泊、航道的水深、宽度或水况是否适合航行。","如果你在旅行信息或地理介绍中看到它，通常等同于“navigable（可通航的）/ suitable for boating（适合划船的）”。第二个意思较少见，多出现在具体情境里（比如露营、漂流时讨论装备能否装上船）。"]}
{"word":"boatably","summary":{"en":"“Boatably” is a very uncommon adverb meaning “in a way that can be done by boat / accessible by boat.”","zh":"“boatably”是非常少见的副词，大意是“可以用船到达/适合乘船通行地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Very rare / informal) In a way that is suitable for traveling or moving by boat; by boat.","zh":"（非常少见/非正式）以适合乘船或用船移动的方式；乘船地/用船地。"},"examples":[{"en":"The islands are boatably close to the shore in calm weather.","zh":"天气平静时，那些岛离海岸近到可以（用船）方便到达。"},{"en":"Some parts of the city are still boatably accessible after the flood.","zh":"洪水过后，城市里有些地方仍然可以乘船到达。"}]}],"synonyms":["by boat","boat-accessibly","navigably (in water contexts)"],"phonetic":"/ˈboʊtəbli/","extraExplanation":["“boatably”并不是常见标准词，几乎不会在正规写作中出现；更像是把“boat（船）+ -able（可……的）+ -ly（……地）”临时拼出来的表达，用来强调“可以用船到达/适合用船通行”。","如果你是在文章里看到它，也可能是拼写错误或误读。常见的相近词有：\"notably\"（显著地）、\"notable\"（显著的）；以及更地道的表达：\"by boat\"（乘船）、\"boat-accessible\"（可乘船到达的）、\"navigable\"（可航行的）。"]}
{"word":"boatage","summary":{"en":"Boatage means transport by boat, or the fee for using boat transport (often in formal/older usage).","zh":"Boatage 指船运（用船运输），也可指船费/渡船费（多见于正式或较旧用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"transport by boat (the act or cost of carrying people or goods by boat).","zh":"船运；用船运输（指用船运送人或货物的行为或费用）。"},"examples":[{"en":"The contract includes boatage across the river.","zh":"合同包含过河的船运费用。"},{"en":"Boatage was once the quickest way to move goods between nearby ports.","zh":"过去，船运曾是附近港口之间运货最快的方法。"}]},{"partOfSpeech":"n.","definition":{"en":"a fee charged for using a boat or a boat service (such as a ferry).","zh":"船费；渡船费（指使用船只或船运服务所收取的费用）。"},"examples":[{"en":"Boatage is payable at the dock before boarding.","zh":"上船前需在码头支付船费。"},{"en":"They added boatage and handling charges to the invoice.","zh":"他们在发票中加上了船费和装卸费。"}]}],"synonyms":["boat transport","ferry fare","boat fare","shipping by boat","carriage by water"],"phonetic":"/ˈboʊtɪdʒ/","extraExplanation":["“boatage”较常见于较正式或较旧的英文（如港口、航运、法律/合同文本），现代日常英语更常说“boat fare”“ferry fare”或“shipping by boat”。","词尾“-age”常用来构成表示“费用/行为/结果”的名词（如“postage”邮资），因此“boatage”也常指与用船相关的费用或运输行为。"]}
{"word":"boatbill","summary":{"en":"A “boatbill” is the boat-billed heron, a tropical bird known for its wide, boat-shaped bill.","zh":"“boatbill”指船嘴鹭，一种以宽大“船形”喙著称的热带鸟类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical heron with a very broad, scoop-shaped bill; the boat-billed heron.","zh":"一种热带鹭，喙非常宽而呈“船形”；即船嘴鹭（boat-billed heron）。"},"examples":[{"en":"We spotted a boatbill resting quietly in the mangroves at dusk.","zh":"黄昏时，我们在红树林里看到一只船嘴鹭安静地栖息。"},{"en":"The boatbill’s wide bill helps it catch fish and other small animals.","zh":"船嘴鹭宽大的喙有助于它捕捉鱼和其他小动物。"}]}],"synonyms":["boat-billed heron","boatbilled heron"],"phonetic":"ˈboʊtˌbɪl","extraExplanation":["“boatbill”在英语里多作口语或简写，用来指“boat-billed heron（船嘴鹭）”。更正式的写法常见的是带连字符的“boat-billed heron”。","船嘴鹭主要分布在中美洲和南美洲，常见于红树林、沼泽和河岸等湿地环境，多在黄昏或夜间活动。"]}
{"word":"boatbills","summary":{"en":"“Boatbills” means more than one boatbill, a tropical bird known for its broad, boat-shaped bill.","zh":"“Boatbills”指多只 boatbill（常指舟嘴鹭），特点是宽大、像小船一样的喙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of boatbill: a tropical bird (especially the boat-billed heron) with a very wide, boat-shaped bill.","zh":"boatbill 的复数：一种热带鸟类（尤指舟嘴鹭），以非常宽大、像小船一样的喙为特征。"},"examples":[{"en":"We spotted several boatbills resting quietly in the mangroves at dusk.","zh":"黄昏时我们看到几只 boatbills 安静地栖息在红树林里。"},{"en":"The guide explained that boatbills hunt at night and rely on their broad bills.","zh":"向导解释说，boatbills 多在夜间捕食，并依靠它们宽大的喙。"}]}],"synonyms":["boat-billed herons","boatbills (plural form)","wading birds"],"phonetic":"/ˈboʊtˌbɪl/","extraExplanation":["“boatbill”在自然纪录片与观鸟语境中更常指“舟嘴鹭”（boat-billed heron）。它的“舟形喙”是最醒目的特征，用来在浅水与红树林环境中觅食。","拼写提示：boatbills 是复数形式；单数是 boatbill。"]}
{"word":"boatbuilder","summary":{"en":"A boatbuilder is a person who builds boats.","zh":"boatbuilder 指“造船的人/造船工”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person whose job is to build boats (for work or pleasure).","zh":"造船工；造舟者（以建造各类船只为职业的人）。"},"examples":[{"en":"Her grandfather was a boatbuilder on the Maine coast.","zh":"她的祖父在缅因州海岸当造船工。"},{"en":"The boatbuilder tested the hull carefully before delivery.","zh":"造船师在交付前仔细测试了船体。"}]}],"synonyms":["boat maker","shipwright","shipbuilder"],"phonetic":"/ˈboʊtˌbɪldɚ/","extraExplanation":["在英语里，boatbuilder 是由 boat（船）+ builder（建造者）组成的复合词，常用于小型或中型船只（如帆船、渔船、游艇）的建造与修复。更正式或更大规模造船行业里，也常见 shipbuilder（造船厂/造船工，通常指更大的船舶）。","相关表达：custom boatbuilder（定制船制造商）、traditional/wooden boatbuilder（传统/木船造船师）、boatbuilding（造船业/造船技艺）。"]}
{"word":"boatbuilding","summary":{"en":"Boatbuilding means the craft or industry of building boats.","zh":"boatbuilding 指“造船工艺/造船业”，即设计并建造船只。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the craft or industry of designing and constructing boats (from small wooden boats to large vessels).","zh":"造船（尤指小型船只）的工艺或行业；设计并建造船只的过程。"},"examples":[{"en":"He learned boatbuilding from his grandfather and now repairs wooden sailboats.","zh":"他跟祖父学习造船工艺，现在专门修理木质帆船。"},{"en":"Boatbuilding in this coastal town supports many local jobs.","zh":"这座海滨小镇的造船业养活了许多当地岗位。"},{"en":"She took a weekend boatbuilding class and made a small canoe.","zh":"她参加了周末的造船课程，做了一条小独木舟。"}]}],"synonyms":["boat construction","boat building","shipbuilding (broader/for larger ships)"],"phonetic":"/ˈboʊtˌbɪldɪŋ/","extraExplanation":["“boatbuilding”通常作为不可数名词，指“造船这门手艺/行业”；若强调“造船项目或作品”，可用可数表达，如“a boatbuilding project”。","在英语里它也常写作两词“boat building”，两种写法都常见：作行业/领域名称时常见连写（boatbuilding），作一般动作描述时常见分写（boat building）。"]}
{"word":"boatcraft","summary":{"en":"Boatcraft means the skills and know-how for operating a boat safely (and sometimes the practice of boating itself).","zh":"Boatcraft 指安全操控船只的技能与知识（有时也指强调技巧与安全的航行活动）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Skill and knowledge in handling and managing a boat safely (for example, steering, docking, navigating, and reading conditions).","zh":"船艇操作与管理的技能与知识（如操舵、靠泊、航行与判断水流/天气等）。"},"examples":[{"en":"Good boatcraft means knowing how to handle your boat in wind and waves.","zh":"良好的 boatcraft 指的是懂得如何在大风与浪况中操控船只。"},{"en":"The instructor focused on basic boatcraft, like docking and right-of-way rules.","zh":"教练重点讲解基础的 boatcraft，例如靠泊和航行优先权规则。"}]},{"partOfSpeech":"n.","definition":{"en":"The practice or activity of boating, especially when it emphasizes technique and safety.","zh":"划船/航行的实践活动（尤指强调技巧与安全时）。"},"examples":[{"en":"She got into boatcraft through a local sailing club.","zh":"她通过当地帆船俱乐部开始接触 boatcraft。"},{"en":"The camp teaches boatcraft to beginners on calm water first.","zh":"营队先在平静水域教初学者 boatcraft。"}]}],"synonyms":["seamanship","boating skills","boat handling","small-craft handling"],"phonetic":"/ˈboʊtkræft/","extraExplanation":["“boatcraft”在日常英语里不算特别常见，更常见的说法是“boating skills / seamanship（航海技能）/ small-craft handling（小艇操纵）”。不过在培训、手册或安全语境中，用“boatcraft”来强调“技术与安全素养”会更贴切。","注意拼写：这里的“craft”意为“技能/技艺”，不是“手工艺”。因此它整体更接近“驾驶/操舟本领”。"]}
{"word":"boated","summary":{"en":"“Boated” usually means traveled by boat or was transported by boat; in some informal regional English it can also mean very drunk.","zh":"“Boated”通常表示“乘船旅行/用船运送”；在某些地区的非正式口语中也可表示“喝得很醉”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “boat”: to travel in a boat or go somewhere by boat.","zh":"“boat”的过去式/过去分词：乘船旅行；用船去某地。"},"examples":[{"en":"We boated across the lake at sunset.","zh":"我们在日落时乘船穿过了湖面。"},{"en":"They boated along the river for an hour.","zh":"他们沿着河乘船游了一个小时。"}]},{"partOfSpeech":"adj.","definition":{"en":"transported by boat (often used in passive voice).","zh":"由船运送的（常用于被动语态）。"},"examples":[{"en":"The supplies were boated to the island.","zh":"补给品被用船运到了岛上。"},{"en":"The injured hiker was boated back to shore.","zh":"受伤的徒步者被用船送回了岸边。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal, regional) very drunk; intoxicated.","zh":"（非正式，地区用法）醉得很厉害；酩酊大醉。"},"examples":[{"en":"He was completely boated after the party. (informal)","zh":"聚会后他醉得一塌糊涂。（非正式）"}]}],"synonyms":["sailed","rowed","ferried","shipped (by boat)","drunk (informal sense)"],"phonetic":"/ˈboʊtɪd/","extraExplanation":["“boated”最常见是动词“boat”的过去式/过去分词，用来表示“乘船（去/穿过/沿着）”。在写作中也常见被动结构：be boated to/into/back 等，强调“用船运送”。","“boated=喝醉了”属于少数地区/口语用法，正式写作里更常用 “drunk / intoxicated / wasted”。如果不确定读者是否熟悉，建议避免使用这一义。"]}
{"word":"boatel","summary":{"en":"Boatel means a hotel-like place to stay on a boat.","zh":"Boatel 指在船上的酒店式住宿（“水上旅馆”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a floating hotel or hotel-like accommodation on a boat (often a large boat or houseboat where guests can stay overnight)","zh":"水上旅馆；船上旅店（指在船上提供类似酒店的住宿，常可过夜）"},"examples":[{"en":"We booked a boatel for two nights to explore the backwaters.","zh":"我们订了两晚的水上旅馆来游览回水水道。"},{"en":"The boatel has private cabins, meals, and a deck for sunset views.","zh":"这家船上旅馆有独立客舱、餐食服务，还有观景甲板可以看日落。"}]}],"synonyms":["floating hotel","houseboat (hotel)","boat hotel"],"phonetic":"/boʊˈtɛl/","extraExplanation":["“boatel”是“boat + hotel”的混成词（portmanteau），常用于旅游语境，尤其指可住宿的游船/大型船屋（例如某些地区的houseboat住宿）。在更正式的表达里，也可以说“floating hotel”或“houseboat (hotel)”。"]}
{"word":"boatels","summary":{"en":"“Boatels” are hotels on boats (floating hotels), offering overnight stays on the water.","zh":"“Boatels”指船上旅馆/水上旅馆，让人们在水上过夜住宿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hotel on or in a boat (often a large houseboat or ship) where guests can stay overnight","zh":"船上旅馆；水上旅馆（通常是大型船屋或船只，供客人过夜住宿）"},"examples":[{"en":"We stayed at a boatel on the river for two nights.","zh":"我们在河上的水上旅馆住了两晚。"},{"en":"Many tourists choose boatels to enjoy the view and the gentle motion of the water.","zh":"很多游客选择水上旅馆，欣赏风景，也感受水面的轻微摇晃。"}]}],"synonyms":["floating hotel","houseboat (often similar)","boat hotel"],"phonetic":"/ˈboʊtɛl/","extraExplanation":["“boatel”是“boat + hotel”的混成词（blending），多用于旅游语境。常见相关表达还有“houseboat”（船屋，通常可自住/租住）和“floating hotel”（漂浮式酒店，更正式的说法）。"]}
{"word":"Boaten","summary":{"en":"“Boaten” is a rare/archaic form meaning “carried or traveled by boat,” and sometimes “boat-shaped.”","zh":"“boaten”是少见/古语形式，常指“用船运送/乘船”，有时也指“船状的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic or dialect) past participle of “boat”; carried or traveled by boat.","zh":"（古语或方言）“boat”的过去分词；用船运送或乘船旅行。"},"examples":[{"en":"The supplies were boaten across the river before sunrise.","zh":"补给在日出前被船运过河。"},{"en":"In old accounts, people wrote that they were “boaten” to the island.","zh":"在旧时记载里，人们会写他们“乘船”去了那座岛。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare, poetic) having the shape of a boat; boat-shaped.","zh":"（罕见，偏诗意）船状的；像船形的。"},"examples":[{"en":"A boaten leaf held a bead of rain.","zh":"一片船状的叶子托着一滴雨珠。"}]}],"synonyms":["transported by boat","taken by boat","boated","boat-shaped"],"phonetic":"ˈboʊtən","extraExplanation":["“boaten”在现代英语里很少见，多见于较早的英国英语文本、方言记录或模仿古风的写作。现代更常用的表达是：transported by boat（用船运送）、taken by boat（乘船带去）、boated across（乘船渡过）。"]}
{"word":"boater","summary":{"en":"Boater most commonly means a flat-topped straw hat worn in summer; it can also mean a person who uses a boat for leisure.","zh":"Boater 最常指夏天戴的平顶硬草帽；也可指乘船或操纵小船进行休闲活动的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a stiff, flat-topped straw hat with a wide brim, often worn in summer (also called a skimmer)","zh":"平顶硬草帽（宽檐，常在夏季佩戴，也叫 skimmer）"},"examples":[{"en":"He wore a boater and a light suit to the garden party.","zh":"他戴着平顶硬草帽、穿着浅色西装去参加花园派对。"},{"en":"The barbershop quartet performed in matching boaters.","zh":"理发店四重唱成员戴着同款平顶硬草帽表演。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who travels in or operates a small boat, especially for leisure","zh":"乘船或操纵小船的人（尤指休闲活动中的划船/游船者）"},"examples":[{"en":"Boaters should wear life jackets and check the weather.","zh":"划船者/游船者应穿救生衣并查看天气。"},{"en":"The lake is busy with boaters on weekends.","zh":"周末湖面上满是游船的人。"}]}],"synonyms":["skimmer","straw hat","sailor (less exact)","recreational boater"],"phonetic":"/ˈboʊtɚ/","extraExplanation":["“boater（草帽）”在19世纪末到20世纪初的英美夏季休闲文化中很常见，常与划船、野餐、海滨度假等场景联系在一起，因此也带有一点复古、正式但轻松的气质。","在一些英国学校传统或合唱/舞台表演中，boater 也会作为制服或造型的一部分出现（例如某些合唱团、表演团体的经典装扮）。"]}
{"word":"boaters","summary":{"en":"“Boaters” can mean people who are on/operate boats, or (less commonly) the plural of “boater,” a flat straw summer hat.","zh":"“Boaters”既可指乘船/开船的人，也可（较少见）指“boater”这种平顶平檐夏季草帽的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who travel in or operate a boat; people who go boating.","zh":"乘船或驾驶船只的人；进行划船/游船活动的人。"},"examples":[{"en":"Boaters must wear life jackets on this lake.","zh":"在这个湖上乘船的人必须穿救生衣。"},{"en":"The river was crowded with boaters on the holiday weekend.","zh":"假期周末河上挤满了乘船游玩的人。"}]},{"partOfSpeech":"n.","definition":{"en":"Straw hats with a flat top and flat brim (the plural of “boater,” a traditional summer hat).","zh":"平顶平檐的草帽（“boater”草帽的复数，一种传统夏季帽子）。"},"examples":[{"en":"The choir wore boaters and matching ribbons.","zh":"合唱团戴着平顶草帽，还系着同款丝带。"},{"en":"In old photos, men sometimes wear boaters at summer events.","zh":"在老照片里，男人有时会在夏日活动中戴平顶草帽。"}]}],"synonyms":["people on boats","boating enthusiasts","sailors (sometimes)","rowers (sometimes)","straw hats (for the hat meaning)"],"phonetic":"/ˈboʊtɚz/","extraExplanation":["“boater（草帽）”常让人联想到19世纪末到20世纪初的英美夏季休闲穿搭，以及划船、野餐、学院活动等场景；有时也会出现在理发店四重唱（barbershop quartet）等复古表演造型中。"]}
{"word":"boatfalls","summary":{"en":"Boatfalls are the hoisting/lowering ropes and pulley tackle used to raise or lower a ship’s boat, especially a lifeboat.","zh":"Boatfalls 指用于吊起或放下船上小艇（尤其救生艇）的吊艇绳索与滑轮索具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"ropes and pulleys (tackle) used to lower or hoist a ship’s boat (lifeboat or small boat), usually from davits.","zh":"（船上的）吊艇索具；用于从吊艇架（davits）放下或吊起救生艇/小艇的绳索与滑轮装置。"},"examples":[{"en":"The crew checked the boatfalls before lowering the lifeboat.","zh":"船员在放下救生艇前检查了吊艇索具。"},{"en":"Saltwater and rust can damage the boatfalls if they aren’t maintained.","zh":"如果不保养，海水和锈蚀会损坏吊艇索具。"}]}],"synonyms":["falls (nautical)","boat tackle","hoisting tackle"],"phonetic":"/ˈboʊtˌfɔlz/","extraExplanation":["“boatfalls”多见于航海/海军语境，通常是“boat fall”的复数。这里的“fall(s)”不是“跌落”，而是指滑轮组上的“起吊/放下用绳索（索具的一部分）”。","在较旧的航海英语或事故报告中常出现，例如检查救生艇放下装置时会提到“boatfalls, davits, blocks, falls”等词。"]}
{"word":"boatful","summary":{"en":"Boatful means a full boatload—an amount that fills a boat.","zh":"Boatful 指“一船之量”，即装满一条船的数量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"as much as a boat can carry; a full boatload (of people or things)","zh":"一船之量；一整船（的人或物）"},"examples":[{"en":"A boatful of tourists arrived at the island in the morning.","zh":"早上有一船游客抵达了岛上。"},{"en":"They brought a boatful of supplies after the storm.","zh":"暴风雨过后，他们运来了一船补给。"}]}],"synonyms":["boatload","full boatload"],"phonetic":"/ˈboʊtˌfʊl/","extraExplanation":["“boatful”是由“boat + -ful（满……的/……之量）”构成，表示“装满一船的量”。日常更常见的表达是“a boatload of …”。在新闻或文学描写中，“boatful”有时用来强调“很多、满满一船”的画面感。"]}
{"word":"boathead","summary":{"en":"Boathead usually means a boating enthusiast; in technical contexts, it can mean a boat-shaped (rounded, tapered) fastener head.","zh":"Boathead 通常指“船迷/船艇爱好者”；在技术语境中也可指紧固件的“船形（圆滑略锥形）头部”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A person who is very interested in boats or boating; a boating enthusiast.","zh":"（非正式）很迷船或划船、航海的人；船艇爱好者。"},"examples":[{"en":"My uncle is a real boathead—he spends every weekend at the marina.","zh":"我叔叔真是个船迷——他每个周末都泡在码头。"},{"en":"The boatheads in our neighborhood all know the best spots for fishing.","zh":"我们社区里的船迷都知道最好的钓鱼点。"}]},{"partOfSpeech":"n.","definition":{"en":"(technical) A rounded, slightly tapered “boat-shaped” head on a bolt, screw, or rivet.","zh":"（技术）螺栓、螺钉或铆钉上一种圆滑、略呈锥形的“船形头/舟形头”。"},"examples":[{"en":"Use a boathead rivet here so the surface stays smooth.","zh":"这里用舟形头铆钉，这样表面更平整。"},{"en":"The drawing specifies a boathead fastener for this panel.","zh":"图纸注明这个面板要用船形头紧固件。"}]}],"synonyms":["boating enthusiast","boater","sailor (context-dependent)","boat-head (variant spelling)"],"phonetic":"/ˈboʊtˌhɛd/","extraExplanation":["“boathead”并不是非常常见的标准词汇。表示“船迷/航海爱好者”时，更常见的说法有：boating enthusiast, boater, sailor（看语境）。在技术语境中，它可能出现在紧固件/铆钉的规格描述里，也常写作 boat-head 或写成两个词 boat head。"]}
{"word":"boatheader","summary":{"en":"“Boatheader” is uncommon in standard English; it usually refers to a boat-related header/title (often in websites, documents, or labels).","zh":"“boatheader”不是常见标准英文词，通常指与船有关的标题/页眉（常见于网站、文档或标签）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Not a standard dictionary word) A rare or informal compound that usually means “a header/title related to a boat,” such as the top banner of a website, document section, or label for boat information.","zh":"（不是标准词典词）较少见/非正式复合词，通常指“与船有关的标题/页眉”，比如网站顶部横幅、文档章节标题或船只信息的标签。"},"examples":[{"en":"The designer changed the boatheader to show a photo of a sailboat.","zh":"设计师把 boatheader 改成显示一张帆船照片。"},{"en":"Add the boatheader before the safety instructions section.","zh":"在安全说明部分之前加上 boatheader（船只相关标题）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Occasionally, literal use) The “header” area at the front/top of a boat-related display or sign; sometimes used loosely to mean the heading label for a boat’s name, number, or route.","zh":"（偶尔按字面用）船只相关展示牌/信息牌的“标题区”；也可泛指显示船名、编号或航线的标题标签。"},"examples":[{"en":"The boatheader includes the vessel name and registration number.","zh":"boatheader 上包含船名和登记号码。"},{"en":"Please check the boatheader to confirm you’re on the right tour.","zh":"请看 boatheader（标题信息）确认你参加的是正确的游览。"}]}],"synonyms":["boat header","header","title","banner","heading"],"phonetic":"/ˈboʊt ˌhɛdɚ/","extraExplanation":["“boatheader”更常见的写法是分开写成“boat header”。合在一起多见于用户名、项目名、代码变量名（如boatHeader）或特定产品/模板里的自造词。","如果你是在某个行业场景（航运、造船、采矿、游戏等）看到的这个词，含义可能更专门；你可以把原句或截图发来，我可以按语境精确解释。"]}
{"word":"boathook","summary":{"en":"A long pole with a hook used on a boat to pull, push, or fend off objects near the boat.","zh":"船上使用的带钩长杆工具，用来拉、推或顶开靠近船的物体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A long pole with a hook (often with a point) used on a boat to grab, push, pull, or fend off objects such as lines, docks, or other boats.","zh":"撑篙钩／船钩：一种带钩（常带尖头）的长杆工具，用于在船上勾、推、拉或顶开物体，比如缆绳、码头或其他船只。"},"examples":[{"en":"Use the boathook to pull the bow closer to the dock.","zh":"用船钩把船头拉近码头。"},{"en":"He fended the boat off the piling with a boathook.","zh":"他用船钩把船顶离码头桩，防止擦碰。"},{"en":"The deckhand grabbed the mooring line with a boathook.","zh":"水手用船钩勾住系泊缆。"}]}],"synonyms":["boat hook","pike pole","gaff (context-dependent)"],"phonetic":"/ˈboʊtˌhʊk/","extraExplanation":["“boathook”多用于航海与码头作业语境，常见于帆船、游艇、渡船等。它的核心用途是“在不方便用手够到的距离内操作”，比如靠泊时把船拉近、避免船身擦碰、勾起漂浮物或缆绳。","也常写作“boat hook”（分开写），两者含义相同；某些款式会做成可伸缩（telescopic）或可更换头部（例如刷头、网兜）的多功能工具。"]}
{"word":"boathouse","summary":{"en":"A boathouse is a building near water where boats are stored.","zh":"boathouse 指靠水边用来存放船只的建筑（船屋/船库）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small building by a river, lake, or sea used to store boats (and often boating equipment)","zh":"船屋；船库（靠近河、湖或海边，用来停放船只，常也存放划船装备的小建筑）"},"examples":[{"en":"They keep their kayaks in the boathouse by the lake.","zh":"他们把皮划艇放在湖边的船屋里。"},{"en":"We met at the boathouse before renting a rowboat.","zh":"我们在租划艇前在船屋碰面。"}]}],"synonyms":["boat shed","boat house"],"phonetic":"/ˈboʊtˌhaʊs/","extraExplanation":["在英美文化里，boathouse 常见于湖区、公园水域或大学校园（尤其是赛艇/划船运动发达的学校）。有时它不仅是“存船的屋子”，也会是赛艇队的训练基地或集合点。","和 houseboat（船屋/居住在船上）容易混淆：boathouse 是“房子里放船”，houseboat 是“船像房子、能住人”。"]}
{"word":"boathouses","summary":{"en":"Boathouses are buildings near the water used to keep boats, often for rowing or storage.","zh":"boathouses 指水边用于停放船只的建筑（船库/船屋），常与赛艇或船只存放有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a building by a river, lake, or coast where boats are kept (often with a door opening onto the water); it may also be used for rowing or boat storage and maintenance","zh":"船库；船屋（建在河边、湖边或海边，用来停放船只的建筑，常有面向水面的门；也可用于划船活动或存放、维护船只）"},"examples":[{"en":"They rent a small boathouse by the lake to store their kayaks.","zh":"他们在湖边租了一间小船库来存放皮划艇。"},{"en":"The rowing team meets at the boathouse every morning.","zh":"赛艇队每天早上都在船库集合。"},{"en":"After the storm, the boathouses along the river were badly damaged.","zh":"暴风雨过后，河边的一排船库受损严重。"}]}],"synonyms":["boat shed","boat house","dockhouse","rowing shed"],"phonetic":"/ˈboʊtˌhaʊs/","extraExplanation":["“boathouse”在英美文化里常和赛艇（rowing）联系很紧密：很多学校或俱乐部的赛艇队会以boathouse为训练基地，里面有放赛艇的长架子、划船机（erg）和更衣区等。","复数“boathouses”只是表示有多间船库/船屋；说“the boathouse”通常指某个队或某处码头旁的那一间。"]}
{"word":"boatie","summary":{"en":"“Boatie” is an informal word for a person who goes boating (especially a recreational boat owner), and sometimes for a small/cute-sounding boat.","zh":"“boatie”是口语词，通常指玩船/开船的人（尤其休闲船主），有时也指小船或亲昵地称呼一艘船。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A person who owns, uses, or operates a boat; a recreational boater.","zh":"（非正式）玩船的人；拥有、使用或驾驶船只的人；休闲船主/船友。"},"examples":[{"en":"The boaties were out early to catch the calm water.","zh":"玩船的人一大早就出海，想赶上风平浪静的时候。"},{"en":"As a weekend boatie, she always checks the weather before leaving the marina.","zh":"作为周末玩船的人，她出码头前总会先看天气预报。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, less common) A small boat, or a boat spoken of in a cute/friendly way.","zh":"（非正式，较少见）小船；以亲昵/可爱的方式称呼的船。"},"examples":[{"en":"He repaired his little boatie and took it back on the lake.","zh":"他修好了他的小船，又把它开回湖上。"}]}],"synonyms":["boater","boat owner","boat operator","sailor (sometimes)"],"phonetic":"/ˈboʊti/","extraExplanation":["“boatie”常见于澳大利亚、新西兰、英国等英语语境，口语色彩强，通常指“玩船/开船的人”，尤其是休闲钓鱼、周末出海的船主。","词尾“-ie/-y”在英语里常用来构成亲切或口语化的称呼（如 dog → doggie, aunt → auntie），因此 boatie 也带有随意、友好的语气。","正式场合更常用 boater（玩船的人）或 boat owner/operator（船主/操作者）。"]}
{"word":"boating","summary":{"en":"“Boating” most commonly means the activity of using a boat for recreation or travel; it can also mean “traveling by boat” as a verb form.","zh":"“boating”最常指乘船/划船等活动；也可作动词形式，表示“正在乘船航行或用船运送”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The activity of traveling in or using a boat for fun, sport, or transportation.","zh":"乘船或使用船只的活动（用于娱乐、运动或交通）。"},"examples":[{"en":"We went boating on the lake last weekend.","zh":"上周末我们去湖上划船了。"},{"en":"Boating is popular here in summer.","zh":"这里夏天很流行乘船活动。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “boat”: traveling by boat or taking someone somewhere by boat.","zh":"“boat”的现在分词：乘船航行；用船把某人/某物运送到某处。"},"examples":[{"en":"They’re boating across the river to reach the island.","zh":"他们正乘船渡河去岛上。"},{"en":"The fisherman was boating supplies to the village.","zh":"那位渔夫正用船把补给运到村子里。"}]}],"synonyms":["boating trip","going out on a boat","rowing (specific)","sailing (specific)","kayaking (specific)"],"phonetic":"/ˈboʊtɪŋ/","extraExplanation":["在日常英语里，boating 通常指“休闲划船/游船”这一类活动，常见搭配有 go boating（去划船/坐船玩）、boating season（适合划船的季节）、boating accident（船只事故）。","英式英语中有时 boating 也可更广义地涵盖帆船（sailing）、划艇（canoeing/kayaking）等水上活动；美式英语里也会这样用，但更常直接说具体项目（如 sailing, kayaking）。"]}
{"word":"boatings","summary":{"en":"“Boatings” usually means multiple boating trips, but most of the time English uses “boating” for the activity in general.","zh":"“boatings”多指多次/不同场合的乘船出游；不过英语里更常用“boating”来泛指乘船活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity of traveling or spending time on a boat for pleasure or sport","zh":"（泛称）划船/乘船活动；水上游乐（指以娱乐或运动为目的的乘船）"},"examples":[{"en":"We go boating on the lake every summer.","zh":"我们每年夏天都会去湖上乘船玩。"},{"en":"Boating is popular here because the weather is mild.","zh":"这里气候温和，所以乘船活动很受欢迎。"}]},{"partOfSpeech":"n.","definition":{"en":"plural form of “boating,” meaning separate boating trips or occasions","zh":"“boating”的复数：指多次/不同场合的乘船活动或出航"},"examples":[{"en":"Their weekend boatings became a family tradition.","zh":"他们周末的多次乘船出游成了家庭传统。"}]}],"synonyms":["boating","boat trips","cruising","sailing (if using a sailboat)"],"phonetic":"/ˈboʊtɪŋz/","extraExplanation":["“boatings”在日常英语里不如“boating”常见；多数情况下用不可数的“boating”表示“乘船活动”这一整体概念。只有在强调“多次、分开的乘船行程/出航”时，才更可能看到复数“boatings”。"]}
{"word":"boation","summary":{"en":"“Boation” is not standard English; it almost always means “boating.”","zh":"“boation”不是标准英语，通常是把“boating”拼错了。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A nonstandard or mistaken spelling of “boating” (the activity of traveling or spending time in a boat).","zh":"“boating”的非标准拼写或常见拼写错误（指乘船出行或在船上活动/娱乐）。"},"examples":[{"en":"I think you mean “boating,” not “boation.”","zh":"我想你要写的是“boating”，不是“boation”。"},{"en":"We went boating on the lake last weekend.","zh":"上周末我们去湖上划船/乘船玩了。"}]}],"synonyms":["boating","sailing (sometimes, if using a sailboat)"],"phonetic":"/ˈboʊtɪŋ/","extraExplanation":["“boation”在现代英语里几乎不用，词典中通常不收录；大多数情况下是把“boating”误写成了“boation”。","正确表达：boating（活动名词，常指休闲乘船、划船等）；如果你想表达“乘船旅行”，也可用 go by boat / travel by boat。"]}
{"word":"boatkeeper","summary":{"en":"A boatkeeper is someone who takes care of boats, especially at a dock or rental place.","zh":"boatkeeper 指在码头或租船点等地方负责看护、照料船只的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person whose job is to look after boats (for example, keeping them safe, clean, and ready to use), often at a dock, marina, or boat-rental place","zh":"看船人；管船的人（负责看护、清洁并让船只随时可用，常见于码头、游艇码头或租船点）"},"examples":[{"en":"The boatkeeper checked the ropes and covered the boats before the storm arrived.","zh":"暴风雨到来前，看船人检查了绳索并给船盖上防水布。"},{"en":"If you want to rent a rowboat, ask the boatkeeper at the pier.","zh":"如果你想租一条划艇，可以去码头问看船人。"}]}],"synonyms":["boatman","dock attendant","boat caretaker","marina staff"],"phonetic":"ˈboʊtˌkiːpər","extraExplanation":["“boatkeeper”在现代英语里不算常见，更常见的说法是“boatman”（船夫/船工）、“dock attendant”（码头工作人员）、“boat caretaker”（船只看护人）或在游艇码头用“marina staff”。具体用哪个词，取决于此人是否负责划船载客（boatman）还是主要负责看管维护（caretaker/attendant）。"]}
{"word":"boatlacking","summary":{"en":"Boatlacking means “without a boat; lacking a boat,” but it’s rare and nonstandard.","zh":"boatlacking 指“没有船的；缺少船的”，但很少见且不够标准。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard/rare) Without a boat; lacking a boat.","zh":"（不标准/少见）没有船的；缺少船的。"},"examples":[{"en":"After the storm, the island was boatlacking, so supplies couldn’t arrive.","zh":"暴风雨过后，这座岛没有船，所以物资无法运来。"},{"en":"We were boatlacking and had to wait for the ferry.","zh":"我们没有船，只好等渡轮。"}]}],"synonyms":["without a boat","boatless","lacking a boat"],"phonetic":"/ˈboʊtˌlækɪŋ/","extraExplanation":["“boatlacking”并不是常见英语词汇，更像是临时造词（boatlacking = lacking a boat）。在正式或自然的表达中，更常用：\n- without a boat（没有船）\n- boatless（无船的；较少见但比 boatlacking 更像词）\n- lacking a boat（缺少船的）\n写作时如果想更地道，通常建议用 “without a boat”。"]}
{"word":"boatless","summary":{"en":"“Boatless” means “without a boat.”","zh":"“boatless”意思是“没有船的；无船的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having no boat; without a boat (often describing a person, place, or situation where a boat would normally be expected).","zh":"没有船的；无船的（常用来形容本应有船或需要船的人的处境、地点或情况）。"},"examples":[{"en":"We reached the river, boatless and unsure how to cross.","zh":"我们到了河边，却没有船，不知道该怎么过河。"},{"en":"After the storm, the island was left boatless for weeks.","zh":"暴风雨过后，这座岛屿好几个星期都没有船可用。"},{"en":"The fisherman felt boatless for the first time in thirty years.","zh":"这位渔夫三十年来第一次感到“没有船”的无助。"}]}],"synonyms":["without a boat","no-boat","boatlacking"],"phonetic":"/ˈboʊtləs/","extraExplanation":["“boatless”不是高频词，更常见的说法是“without a boat / no boat”。在文学或叙事语境中，它用一个词就能强调“缺少本应具备之物”的失落或困境。","后缀“-less”表示“无、缺少”（如: homeless 无家可归的；jobless 失业的；childless 无子女的）。把名词+less组合成形容词，常带有一种处境/状态的意味。"]}
{"word":"boatlike","summary":{"en":"“Boatlike” means shaped like a boat or resembling a boat in form.","zh":"“boatlike”表示“船形的；像船一样的外形”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shaped like a boat; resembling a boat in form (often describing leaves, shells, or objects with a curved, hollow shape).","zh":"船形的；像小船一样的（常用于形容叶子、贝壳或物体呈弯曲、凹陷的形状）。"},"examples":[{"en":"The leaf is boatlike, with the edges curving upward.","zh":"这片叶子呈船形，边缘向上卷起。"},{"en":"She carried a small boatlike dish for holding sauce.","zh":"她拿着一个小小的船形碟子用来放酱汁。"}]}],"synonyms":["boat-shaped","canoe-shaped","skiff-like"],"phonetic":"/ˈboʊtˌlaɪk/","extraExplanation":["“boatlike”是由“boat + -like（像……一样）”构成的形容词，常见于描写自然形态（如植物叶片的“舟形/船形”）或器物外形。类似的表达还有“shell-like（贝壳状的）”“spoon-like（勺状的）”。"]}
{"word":"boatlip","summary":{"en":"“boatlip” is not standard English; it’s likely a typo or a name.","zh":"“boatlip”不是标准英语词汇；很可能是拼写错误或名称用法。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a made-up term (e.g., a username, brand name, or a mistaken spelling in a text).","zh":"不是标准英语词汇。更可能是拼写错误或自造词（例如用户名、品牌名，或文本中的误拼）。"},"examples":[{"en":"I can’t find “boatlip” in a dictionary—did you mean “bottle lip” or something else?","zh":"我在词典里找不到“boatlip”——你是不是想写“bottle lip”或其他词？"},{"en":"If “boatlip” is a brand or username, it may not have a dictionary definition.","zh":"如果“boatlip”是品牌名或用户名，它可能没有词典释义。"}]}],"synonyms":["(none—nonstandard)"],"phonetic":"ˈboʊtˌlɪp","extraExplanation":["“boatlip”比较像两个常见单词 boat（船）+ lip（嘴唇/边缘）拼在一起，但英语里没有固定词义。你可以告诉我它出现的句子或语境，我可以帮你判断它到底指什么。","如果你想表达“瓶口/瓶唇”，常见说法是 bottle lip 或 the lip of the bottle；如果你想表达“船的边缘/船舷的边”，更自然的是 the edge/lip of the boat 或 gunwale（更专业）。"]}
{"word":"boatload","summary":{"en":"“Boatload” means a very large amount (informal), or literally the amount a boat carries.","zh":"“boatload”可指（非正式）“大量”，也可字面指“一船的载货量/一船货”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very large amount or number of something (often used informally).","zh":"（非正式）大量；很多（常用来强调数量很大）。"},"examples":[{"en":"We got a boatload of emails after the announcement.","zh":"公告发布后，我们收到了大量邮件。"},{"en":"She has a boatload of experience in customer service.","zh":"她在客户服务方面有很多经验。"}]},{"partOfSpeech":"n.","definition":{"en":"The amount that a boat can carry in one load; a boat’s cargo (more literal, less common).","zh":"（较字面、较少见）一船的载货量；一船货。"},"examples":[{"en":"The fishermen brought in a boatload of tuna.","zh":"渔民带回了一船金枪鱼。"},{"en":"A boatload of supplies arrived on the island.","zh":"一船补给到达了岛上。"}]}],"synonyms":["a ton (of)","loads (of)","a bunch (of)","a lot (of)","a great deal (of)"],"phonetic":"/ˈboʊtˌloʊd/","extraExplanation":["“boatload”是由“boat（船）+ load（装载量）”组合而来，所以字面意思是“一船的量”。在日常口语里，它常被夸张化，用来表示“特别多”，类似于“a ton of / loads of”。语气通常偏随意。"]}
{"word":"boatloader","summary":{"en":"A boatloader is someone (or less commonly a machine) that loads cargo or people onto a boat.","zh":"boatloader 指把货物或乘客装上船的人（或较少见：装船设备）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person whose job is to load goods, cargo, or passengers onto a boat or ship.","zh":"把货物、货运或乘客装上船/轮船的人；装船工。"},"examples":[{"en":"The boatloader checked the crates before lifting them onto the deck.","zh":"装船工在把箱子吊上甲板前先检查了一遍。"},{"en":"During the harvest season, boatloaders work long hours at the river port.","zh":"收获季节时，河港的装船工常常加班很久。"}]},{"partOfSpeech":"n.","definition":{"en":"A machine or device used to load items onto a boat (less common).","zh":"用于把物品装上船的机器或装置（较少见）。"},"examples":[{"en":"They installed a new boatloader to move heavy equipment safely onto the barge.","zh":"他们安装了一台新的装船设备，把重型器材安全地装上驳船。"}]}],"synonyms":["loader","dockworker","stevedore","ship loader"],"phonetic":"/ˈboʊtˌloʊdər/","extraExplanation":["“boatloader”在日常英语中不算常见，更常见的词是“loader”（装载工/装载机）或“stevedore”（码头装卸工，偏海运语境）。如果你想表达“很多、成船那么多”的意思，通常用“a boatload (of) …”（一船的……；大量的……），不是“boatloader”。"]}
{"word":"boatloading","summary":{"en":"Boatloading means loading cargo or people onto a boat; it can also describe things connected to that process.","zh":"boatloading 指“装船”的过程；也可作形容词表示“与装船有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of putting cargo, people, or supplies onto a boat","zh":"把货物、人员或物资装上船的行为或过程"},"examples":[{"en":"Boatloading began at sunrise, and the crew worked carefully to balance the weight.","zh":"天一亮就开始装船，船员小心操作以保持重量平衡。"},{"en":"Because of the storm, boatloading was delayed until the water became calmer.","zh":"由于暴风雨，装船被推迟到水面更平静的时候。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to loading things onto a boat (used before a noun)","zh":"与装船有关的（作定语，用在名词前）"},"examples":[{"en":"They followed strict boatloading safety rules.","zh":"他们遵守严格的装船安全规定。"},{"en":"The boatloading schedule changed because the tide was low.","zh":"由于潮位低，装船时间表发生了变化。"}]}],"synonyms":["loading","loading onto a boat","embarkation (people)","shipment (cargo)"],"phonetic":"/ˈboʊtˌloʊdɪŋ/","extraExplanation":["“boatloading”在日常英语里不算常见，更常见的说法是“loading the boat / loading onto a boat”（装船）或在港口语境中用“loading”（装载）。","不要和“boatload”混淆：boatload 是名词，表示“一船的量”，也可口语化表示“很多”（a boatload of problems 一大堆问题）。而 boatloading 强调“装船这个过程”。"]}
{"word":"boatloads","summary":{"en":"Boatloads means a very large amount, usually in the informal phrase “boatloads of …”; it can also literally mean a boat’s full load.","zh":"boatloads 指大量（常见于口语“boatloads of …”），也可字面指“一船的载量”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very large amount of something (often used informally as “boatloads of …”).","zh":"（常用于口语“boatloads of …”）大量，很多（带夸张语气）。"},"examples":[{"en":"They brought boatloads of supplies after the storm.","zh":"暴风雨过后，他们带来了大量的物资。"},{"en":"She gets boatloads of emails every day.","zh":"她每天都会收到成堆的电子邮件。"},{"en":"There were boatloads of people waiting outside.","zh":"外面有一大群人在等。"}]},{"partOfSpeech":"n.","definition":{"en":"the amount a boat can carry in one trip; a full load on a boat.","zh":"一船的载量；一船（一次航行）所能装载的数量。"},"examples":[{"en":"One boatload of fish was enough for the whole village.","zh":"一船鱼就够全村人吃了。"},{"en":"They shipped two boatloads of sand to the island.","zh":"他们向岛上运了两船沙子。"}]},{"partOfSpeech":"phrase","definition":{"en":"“boatloads of (something)” = a huge number or quantity of something.","zh":"“boatloads of（某物）”＝（某物）非常多、数量巨大。"},"examples":[{"en":"The new app gained boatloads of users in a month.","zh":"这款新应用一个月就获得了大量用户。"},{"en":"We have boatloads of work to finish before Friday.","zh":"周五前我们有一大堆工作要完成。"}]}],"synonyms":["tons (of)","loads (of)","a lot (of)","heaps (of)","plenty (of)","a large amount/number (of)"],"phonetic":"/ˈboʊtˌloʊdz/","extraExplanation":["“boatloads”是“boatload”的复数。日常英语里更常见的搭配是“boatloads of + 名词”，语气偏口语、带一点夸张（类似中文“成堆的/一大把/一大票”）。","这个说法来自“船能装很多货”的直观印象，所以也可以用于人、信息、钱等抽象事物。正式写作里可改用“a large amount/number of”。"]}
{"word":"boatly","summary":{"en":"“Boatly” is a rare/nonstandard word meaning “boat-like.” In normal modern English, “boatlike” or “boaty” is more common.","zh":"“boatly”是一个很少见/不太规范的词，大意为“像船的”。现代英语中更常用“boatlike”或“boaty”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare, nonstandard) Having the qualities of a boat; boat-like.","zh":"（罕见/非标准用法）像船的；具有船的特征的；船一样的。"},"examples":[{"en":"The designer wanted a boatly shape for the tiny seaside cabin.","zh":"设计师想让那间海边小屋呈现出一种“像船一样”的造型。"},{"en":"In some older or informal writing, you might see boatly used where boatlike is clearer.","zh":"在一些较旧或较随意的文字里，你可能会看到用 boatly 来表达，但用 boatlike 会更清楚。"}]}],"synonyms":["boatlike","boaty","nautical-looking"],"phonetic":"/ˈboʊtli/","extraExplanation":["“boatly”在现代英语里非常少见，很多情况下会被认为是拼写不常见或不规范的用法。更自然、更常用的表达通常是：boatlike（像船的）、boaty（有船的感觉/适合划船的）。","如果你是在特定文本、品牌名、用户名或方言里看到“boatly”，它可能是刻意造词（仿“friendly / lively”等后缀 -ly 的感觉），并不一定是词典里的常规词。"]}
{"word":"boatman","summary":{"en":"A boatman is someone who operates a small boat, often to ferry people across water.","zh":"boatman 指操纵小船的人，常指摆渡运送乘客过水域的船夫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person whose job is to operate a small boat, especially a boat used to carry people or goods across a river or along a canal.","zh":"摆渡人；船夫（以驾驶小船为业，尤指在河流或运河上运送人或货物的人）。"},"examples":[{"en":"The boatman rowed us across the river before sunset.","zh":"日落前，船夫划船把我们送过了河。"},{"en":"We hired a boatman to take us along the canal.","zh":"我们雇了一位船夫带我们沿着运河游览。"},{"en":"The boatman knew the water and the weather better than anyone.","zh":"这位船夫比任何人都更懂水情和天气。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who works on a boat, especially one used for transporting people; a boat operator.","zh":"船上工作人员；（尤指运送乘客的）船只操作者。"},"examples":[{"en":"A boatman helped passengers step safely onto the pier.","zh":"一名船员帮助乘客安全地踏上码头。"},{"en":"The boatman checked the ropes before leaving.","zh":"出发前，船员检查了绳索。"}]}],"synonyms":["ferryman","boat operator","rower","boatman (crew)","waterman"],"phonetic":"/ˈboʊtmən/","extraExplanation":["“boatman”由“boat（船）+ man（人）”构成，是较传统的称呼。在现代英语里，若想更中性或更具体，常用“boat operator（船只操作员）”“ferryman（摆渡人）”“boat captain（船长）”“crew member（船员）”等，具体取决于船的类型与职责。","在文学与文化中，“boatman/ ferryman（摆渡人）”有时带有象征意义，例如引导人跨越河流、进入新阶段；西方神话中也常出现“渡者/船夫”的意象（如冥河摆渡）。"]}
{"word":"boatmanship","summary":{"en":"Boatmanship means the skill of handling a boat well and safely.","zh":"Boatmanship 指熟练且安全地操控船只（多为小船）的技能。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Skill in handling and operating a boat safely and effectively; seamanship on small boats.","zh":"操舟术；驾船技能（指安全、有效地操控小船的本领）。"},"examples":[{"en":"The guide’s boatmanship kept us steady in the strong current.","zh":"向导高超的驾船技能让我们在湍急水流中依然很稳。"},{"en":"Good boatmanship includes knowing how to read wind, waves, and traffic on the water.","zh":"良好的操舟术包括懂得判断风、浪以及水上交通状况。"}]}],"synonyms":["seamanship","boating skill","boat handling"],"phonetic":"/ˈboʊt.mən.ʃɪp/","extraExplanation":["“boatmanship”由 boat + -manship 构成，-manship 表示“技艺/能力”（如 craftsmanship 手艺）。该词常见于水上运动、救援训练、划船/皮划艇课程或航海安全语境中。","与“seamanship（航海术/船艺）”相比，“boatmanship”更偏向小型船只（如划艇、独木舟、小型机动艇）的操控技巧。"]}
{"word":"boatmaster","summary":{"en":"A boatmaster is the person in charge of a boat, especially a small working or transport boat.","zh":"boatmaster 指负责掌管一条船的人，尤指小型运输或作业船。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is in charge of a boat (especially a small boat or a boat used for transport or work)","zh":"船长；掌船的人（尤指小船或用于运输/作业的船）"},"examples":[{"en":"Ask the boatmaster when the next boat leaves for the island.","zh":"问问船长下一班船什么时候开往岛上。"},{"en":"The boatmaster checked the weather before taking passengers across the river.","zh":"船长在载客过河前先查看了天气。"}]},{"partOfSpeech":"n.","definition":{"en":"the leader or supervisor of a small crew operating a boat (for example, on a fishing boat or workboat)","zh":"（小型船只的）领班；带队操作船只的人（如渔船或作业船）"},"examples":[{"en":"She worked as a boatmaster on a small fishing vessel.","zh":"她在一艘小渔船上担任领班/船长。"},{"en":"The boatmaster assigned jobs and made sure safety rules were followed.","zh":"船长分配工作，并确保大家遵守安全规定。"}]}],"synonyms":["captain","boatman","coxswain","skipper"],"phonetic":"ˈboʊtˌmæstər","extraExplanation":["“boatmaster”较偏正式或行业用语，在日常英语里更常见的是“captain”（船长，范围更广）、“boatman”（摆渡/撑船的人）或“coxswain”（赛艇/小艇的舵手）。在较大的船上，类似职责的传统称呼可能是“boatswain/bo’sun”（水手长），但它不等同于“boatmaster”。"]}
{"word":"boatmen","summary":{"en":"Boatmen are people who operate boats as a job, especially small boats that carry passengers or goods.","zh":"Boatmen 指以駕船為業的人，尤指駕駛小船載客或運貨的船夫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people whose job is to operate a boat, especially a small boat that carries passengers or goods (plural of “boatman”)","zh":"以駕船為職業的人；船夫（“boatman”的複數），尤指駕駛小船載客或運貨的人"},"examples":[{"en":"The boatmen took the tourists across the river.","zh":"船夫把遊客載過了河。"},{"en":"In the past, boatmen were essential for travel and trade along the canal.","zh":"過去，運河上的船夫對旅行與貿易非常重要。"}]}],"synonyms":["boat operators","boaters","boatmen (boatman)","ferrymen (if they run a ferry)"],"phonetic":"/ˈboʊt.mən/","extraExplanation":["“boatman”是複合詞（boat + man），傳統上指以划船、撐篙或駕駛小船為生的人。現代也常用更中性的說法，如“boat operator”“boat worker”“boat pilot”（依工作內容而定）。","在文學與文化中，船夫常象徵「引渡、旅程、人生轉折」等意涵；例如一些故事會用“boatman”來呈現跨越河流或邊界的時刻。"]}
{"word":"boatnik","summary":{"en":"A (often humorous) word for someone who is very into boating.","zh":"常带幽默语气：非常热衷于玩船/划船的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who enjoys boating a lot, especially as a hobby (often said humorously).","zh":"爱好划船/玩船的人；船迷（常带幽默语气）。"},"examples":[{"en":"Every weekend he turns into a real boatnik and heads to the lake at sunrise.","zh":"每到周末他就成了十足的“船迷”，天一亮就往湖边跑。"},{"en":"The marina was full of boatniks comparing engines and fishing stories.","zh":"码头上都是船迷，大家在比发动机、聊钓鱼经历。"}]}],"synonyms":["boater","boating enthusiast","sailor (if sailing)"],"phonetic":"/ˈboʊtˌnɪk/","extraExplanation":["“boatnik”常被看作模仿“beatnik”的造词：用后缀“-nik”来表示“某类人/某种爱好者”，语气往往轻松或带点调侃。","“-nik”在英语里常见于口语或媒体造词（如“refusenik”），源头与俄语/意第绪语借词的影响有关，因此这种词常带有“标签化”的味道。"]}
{"word":"boatowner","summary":{"en":"A boat owner is a person (or sometimes a company) that owns a boat.","zh":"boat owner 指拥有船只的人（有时也指拥有船只的公司/机构）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who owns a boat.","zh":"船主；拥有船只的人。"},"examples":[{"en":"The boat owner pays for insurance, docking fees, and repairs.","zh":"船主要支付保险费、停泊费和维修费。"},{"en":"The marina contacted the boat owner about the storm warning.","zh":"码头就暴风预警联系了船主。"}]},{"partOfSpeech":"n.","definition":{"en":"A company or organization that owns a boat or boats, especially for business (tourism, transport, fishing, etc.).","zh":"（尤指从事旅游、运输、渔业等的）船舶所有公司/机构。"},"examples":[{"en":"The boat owner operates sightseeing trips along the river.","zh":"这家船舶所有方经营河上观光游船。"},{"en":"Boat owners must follow local safety regulations.","zh":"船舶所有方必须遵守当地的安全规定。"}]}],"synonyms":["owner of a boat","vessel owner","shipowner"],"phonetic":"/ˈboʊt ˌoʊnɚ/","extraExplanation":["“boatowner”更常见的写法是分开写作“boat owner”。在一些名词复合词中也可能写成“boat-owner”（用连字符），尤其在作定语时更常见，如“boat-owner responsibilities”（船主的责任）。"]}
{"word":"boats","summary":{"en":"“Boats” most commonly means more than one boat (small watercraft). It can also be the verb form meaning travels/carries by boat.","zh":"“Boats”最常见意思是“多条船/几艘船”。也可作动词，表示“乘船航行/用船运送”（第三人称单数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small watercraft used for traveling on water, often smaller than a ship; plural of “boat.”","zh":"船；小船（常指比“ship/轮船”更小的水上交通工具；“boat”的复数）。"},"examples":[{"en":"We rented boats to explore the lake.","zh":"我们租了几条船去探索那个湖。"},{"en":"Fishing boats left the harbor before sunrise.","zh":"渔船在日出前就离开了港口。"}]},{"partOfSpeech":"v.","definition":{"en":"To travel or carry someone/something by boat; third-person singular present of “boat.”","zh":"乘船航行；用船运送（“boat”的第三人称单数现在时形式）。"},"examples":[{"en":"He boats across the river every morning.","zh":"他每天早上都乘船过河。"},{"en":"The company boats supplies to the island.","zh":"这家公司用船把物资运到岛上。"}]}],"synonyms":["watercraft","vessels","craft"],"phonetic":"/boʊts/","extraExplanation":["“boat”和“ship”常见区别：boat通常较小，很多情况下可以被更大的船（ship）运载；ship通常更大、可远洋航行。日常口语里，人们也常把一些较大的船笼统叫boat（例如sailboat、boat trip）。","常见搭配：row a boat（划船），take a boat（乘船），boat ride（乘船游览），boat trip（乘船旅行），boat owner（船主）。"]}
{"word":"boatsetter","summary":{"en":"Boatsetter is mainly a brand name for an online boat-rental marketplace (rent a boat or list your own).","zh":"Boatsetter 主要是一个品牌名，指线上船艇租赁平台（可租船或发布自家船只出租）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A U.S.-based online platform (brand name) where people can rent boats or offer their own boats for rent, often with an optional captain.","zh":"（品牌名）美国的线上船艇租赁平台：用户可以租船，也可以把自己的船发布出租，常可选择是否配船长。"},"examples":[{"en":"We booked a pontoon for the afternoon on Boatsetter.","zh":"我们在 Boatsetter 上订了一艘浮筒船，租了一个下午。"},{"en":"She listed her sailboat on Boatsetter to earn extra income.","zh":"她把自己的帆船挂在 Boatsetter 上出租，赚点外快。"},{"en":"Boatsetter offers captained trips if you don’t want to drive the boat yourself.","zh":"如果你不想自己开船，Boatsetter 也提供配船长的行程。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, not common in everyday English) A person who sets up, prepares, or launches a boat.","zh":"（罕见用法，不常见）指准备、安置或下水一艘船的人。"},"examples":[{"en":"In old marina records, a “boatsetter” sometimes meant someone who helped launch boats.","zh":"在一些旧的码头记录里，“boatsetter”有时指帮忙把船下水的人。"}]}],"synonyms":["boat rental platform","peer-to-peer boat rental marketplace","boat-sharing platform"],"phonetic":"/ˈboʊtˌsɛtər/","extraExplanation":["在实际使用中，“Boatsetter”几乎总是指该平台/公司名，通常需要大写首字母。作为普通名词“boat setter”并不常见；日常更常说 boat rental platform（船艇租赁平台）或 boat owner（船主）。","Boatsetter 常被称为“peer-to-peer boat rental”（点对点/共享式租船），类似“把自己的船像民宿一样出租”的模式。"]}
{"word":"boatshop","summary":{"en":"A boat shop is a business that sells boats and boating gear, often with repair services.","zh":"boat shop 指售卖船只与航海用品的店铺，常也提供维修保养服务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A shop or business that sells boats and boating supplies, and may also provide repair or maintenance services.","zh":"船店；售船与航海用品的商店（也可能提供维修与保养服务）。"},"examples":[{"en":"We stopped at a boat shop to buy life jackets and rope.","zh":"我们在一家船店停下来买救生衣和绳子。"},{"en":"The boat shop repaired the engine before the weekend trip.","zh":"这家船店在周末出行前把发动机修好了。"}]}],"synonyms":["boat store","marine store","marine dealership","boatyard (sometimes, if repairs/storage)"],"phonetic":"/ˈboʊt ˌʃɑp/","extraExplanation":["更常见的写法是分开写作 “boat shop”。合写 “boatshop” 有时出现在店名、品牌名、网站域名或招牌上，因此在正式写作中建议用 “boat shop”。","在英语里，类似 “bookshop / bookstore” 这种合成名词很常见；“boat shop” 也可能随着使用习惯被写成一个词，但目前分开写更普遍。"]}
{"word":"boatside","summary":{"en":"“Boatside” means the side of a boat, or something that happens right next to the boat.","zh":"“Boatside”指船的一侧/船边，也可指发生在船边附近的情况（常见于钓鱼等语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the side of a boat (the area next to the boat in the water)","zh":"船的一侧；靠近船边的水域/区域"},"examples":[{"en":"Keep your hands inside the boat until we are clear of the boatside.","zh":"在我们离开船边障碍之前，把手一直放在船内。"},{"en":"A large fish followed the lure all the way to the boatside.","zh":"一条大鱼一路跟着假饵追到了船边。"}]},{"partOfSpeech":"adj.","definition":{"en":"happening at or near the side of a boat","zh":"发生在船边的；靠近船侧的"},"examples":[{"en":"He practiced a boatside maneuver to dock smoothly.","zh":"他练习了一个靠船边的操作，以便平稳靠岸。"},{"en":"We missed a boatside strike right next to the kayak.","zh":"我们在皮划艇旁边错过了一次船边咬口。"}]}],"synonyms":["side of the boat","alongside","boat-side","at the rail"],"phonetic":"/ˈboʊtˌsaɪd/","extraExplanation":["在钓鱼语境里，boatside 很常见：比如 boatside strike（鱼在船边突然咬钩/攻击）、boatside figure-eight（玩路亚时在船边画“8字”诱鱼）。这种用法强调“鱼已经追到船边”的关键时刻。"]}
{"word":"boatsman","summary":{"en":"Boatsman usually means a person who operates a small boat (like a boatman). In some older or nautical contexts, it may refer loosely to a sailor like a boatswain.","zh":"Boatsman 通常指操作小船的人（相当于 boatman，船夫/摆渡人）。在较老或航海语境中，也可能宽泛指类似 boatswain（水手长）的水手。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who operates a small boat, especially someone who rows or ferries people across water","zh":"船夫；（尤指）小船的划船者/摆渡人"},"examples":[{"en":"A boatsman took us across the river at dawn.","zh":"天刚亮时，一位船夫把我们渡过了河。"},{"en":"The boatsman tied the boat to the dock and helped us get off safely.","zh":"船夫把船系在码头上，并帮我们安全下船。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a sailor responsible for handling boats or ship equipment; sometimes used loosely for “boatswain”","zh":"（较少用）负责小艇或船上器材的水手；有时被宽泛地用来指“boatswain（水手长）”"},"examples":[{"en":"In older writing, the boatsman called the crew to their stations.","zh":"在较老的作品里，boatsman 会召集船员各就各位。"},{"en":"He worked as a boatsman on a naval vessel.","zh":"他在一艘军舰上当 boatsman。"}]}],"synonyms":["boatman","ferryman","rower","waterman","boatswain (related, nautical)"],"phonetic":"/ˈboʊtsmən/","extraExplanation":["“boatsman”在现代英语里不太常见，更常见的说法是“boatman”（船夫、摆渡人）。如果你想表达“水手长”，标准词通常是“boatswain”（读音类似/ˈboʊsən/），在海军或航海语境更准确。"]}
{"word":"boatsmanship","summary":{"en":"Boatsmanship means the practical skill of handling a boat safely and effectively.","zh":"Boatsmanship 指安全、有效地操控船只的实用技能。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"skill in handling and managing a boat (for example, steering, rowing, docking, and safety on the water).","zh":"操舟技术；驾船本领（如掌舵、划船、靠岸与水上安全等）。"},"examples":[{"en":"Good boatsmanship matters most when the wind picks up and the water gets rough.","zh":"起风、浪大时，良好的操舟技术最关键。"},{"en":"The instructor taught basic boatsmanship, including how to dock slowly and safely.","zh":"教练教授了基础操舟技巧，包括如何缓慢而安全地靠岸。"}]}],"synonyms":["boat handling","seamanship","boatcraft"],"phonetic":"/ˈboʊtsmənʃɪp/","extraExplanation":["“boatsmanship”在现代英语中相对少见，更常见的说法是“boat handling”（驾船/操船）或“seamanship”（更偏航海技能与海上规范，范围通常更大）。","词形上可理解为“boat + -smanship”，类似于“craftsmanship”（工艺/匠艺），强调一种熟练的技能与经验。"]}
{"word":"boatsmen","summary":{"en":"Boatsmen are men who operate boats; the plural of boatsman.","zh":"boatsmen 指操船的人（船夫/船员），是 boatsman 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"men who operate boats, especially small boats; boatmen (plural). They may row, steer, or ferry people and goods.","zh":"船夫；船员（复数）。指操作船只（尤其是小船）的人，可能负责划船、掌舵或摆渡人和货物。"},"examples":[{"en":"At dawn, the boatsmen guided tourists across the river.","zh":"黎明时分，船夫们引导游客渡过河。"},{"en":"The harbor was busy with fishermen and boatsmen loading supplies.","zh":"港口里渔民和船员都很忙，正在装运补给。"},{"en":"In old stories, boatsmen often knew every bend of the waterway.","zh":"在古老的故事里，船夫往往熟悉水路的每一道弯。"}]}],"synonyms":["boatmen","ferrymen","rowers","sailors"],"phonetic":"/ˈboʊtsmən/","extraExplanation":["“boatsmen”是“boatsman”的复数形式；现代英语里更常见的中性说法是“boatmen”（不强调性别）。在语境中也可能泛指码头、渡口、运河上负责操船与摆渡的工作人员。"]}
{"word":"boatsteerer","summary":{"en":"A boatsteerer is a whaling-era harpooner who helped steer a whaleboat and usually threw the harpoon first.","zh":"boatsteerer 指捕鲸时代的小艇鱼叉手，协助掌舵，通常负责首先投掷鱼叉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in traditional whaling) a crew member in a small whaleboat who helps steer it and usually throws the harpoon first; a harpooner.","zh":"（传统捕鲸中）小捕鲸艇上的船员，负责协助掌舵，通常也是第一个投掷鱼叉的人；鱼叉手。"},"examples":[{"en":"The boatsteerer stood ready at the bow, gripping the harpoon.","zh":"鱼叉手站在船头，握紧鱼叉随时准备出手。"},{"en":"In the old whaling crew, the boatsteerer and the mate worked as a team.","zh":"在旧时的捕鲸队里，鱼叉手和大副配合行动。"},{"en":"The novel describes how a boatsteerer’s job was both skilled and dangerous.","zh":"小说描写了鱼叉手的工作既需要技术也极其危险。"}]}],"synonyms":["harpooner","whaleman"],"phonetic":"/ˈboʊtˌstɪrɚ/","extraExplanation":["这个词多见于19世纪的英语捕鲸语境，现代日常英语里很少用。更常见的近义词是 harpooner（鱼叉手）。","在赫尔曼·梅尔维尔（Herman Melville）的《白鲸》（Moby-Dick）等捕鲸文学中，boat-steerer 常指站在船头负责“先叉”（first iron）的那个人：追鲸时由大副在船尾掌舵、发号施令，而 boatsteerer 在前方负责投叉并协助操控。","写法上也常见 boat-steerer（带连字符）或 boat steerer（分开写），含义相同。"]}
{"word":"boatswain","summary":{"en":"A boatswain (also called a bosun) is the ship’s deck supervisor who manages the deck crew and equipment like ropes and anchors.","zh":"boatswain（也叫bosun）指船上的甲板主管，负责管理甲板船员及缆绳、锚等设备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An officer on a ship (traditionally on a sailing ship) who is in charge of the deck crew, the ship’s equipment (like ropes and anchors), and day-to-day work on deck.","zh":"（船上的）水手长／甲板长：负责甲板船员、船上设备（如缆绳、锚等）以及日常甲板工作的船员长官。"},"examples":[{"en":"The boatswain ordered the crew to tighten the lines before the storm hit.","zh":"暴风雨来临前，水手长命令船员把绳索拉紧。"},{"en":"In many sea stories, the boatswain is a tough, experienced sailor who keeps the ship running smoothly.","zh":"在许多航海故事里，水手长通常是经验老到、性格强硬、能让船正常运转的老水手。"}]}],"synonyms":["bosun","deck boss","deck foreman"],"phonetic":"ˈboʊsən","extraExplanation":["“boatswain”常缩写为“bosun”，读音也常按“bosun”来读。这个职位在帆船时代尤其重要，负责绳索、帆具、锚链等甲板器材的管理与维护，并监督甲板作业。","词源上，“boatswain”来自较早的英语形式，意思大致是“船的侍从/管事（swain）”，体现了其“负责照看船务”的角色。","在文学与戏剧中很常见：例如莎士比亚《暴风雨》(The Tempest) 开场就有“Boatswain”这个角色，负责在风暴中指挥甲板上的操作。"]}
{"word":"boatswains","summary":{"en":"Boatswains are the deck officers/senior crew who supervise deck work and equipment on a ship.","zh":"Boatswains 指船上的水手长/甲板资深船员，负责指挥甲板作业并管理甲板设备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of boatswain: sailors (often senior crew members) responsible for the ship’s deck crew, equipment, and daily work on deck","zh":"boatswain 的复数：水手长（通常为资深船员），负责甲板船员、甲板设备以及日常甲板作业"},"examples":[{"en":"The boatswains inspected the ropes and anchors before the ship left port.","zh":"船离港前，几位水手长检查了缆绳和锚。"},{"en":"On large ships, the boatswains coordinate the deck crew’s tasks each day.","zh":"在大型船只上，水手长每天协调甲板船员的工作。"}]}],"synonyms":["bosuns","deck supervisors","boatswain’s mates"],"phonetic":"/ˈboʊsən/","extraExplanation":["“boatswain” 常写作 boatswain，但口语里常读作 “bosun”，所以你可能会看到非正式拼写 bosun / bos’n。","在英美海军与商船体系中，boatswain（或 boatswain’s mate）常被视为“甲板部门”的关键岗位，负责绳索、缆绳、锚具、甲板维护与指挥甲板工。"]}
{"word":"boattail","summary":{"en":"Boattail means a tail-like part shaped like a boat’s rear—especially a tailcoat’s split back, a streamlined tapered rear in design, or (in politics) a popular candidate’s vote-boosting effect.","zh":"Boattail 指像船尾一样的“尾部”形状：常见于燕尾礼服的后摆、设计中流线型收尾，也可指政治上的“带动效应”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long, split back part of a formal coat (a “tailcoat”), shaped like the tail of a boat","zh":"（男式礼服上衣的）燕尾；后摆呈“船尾/燕尾”形的部分"},"examples":[{"en":"He wore a black coat with boattails to the orchestra concert.","zh":"他去听交响乐时穿了一件带燕尾的黑色礼服上衣。"},{"en":"In old photos, you can often see men in boattail coats at formal events.","zh":"在老照片里，你常常能看到男士在正式场合穿燕尾礼服。"}]},{"partOfSpeech":"n.","definition":{"en":"the tapered, streamlined rear end of a vehicle, aircraft, or object, designed to reduce air resistance","zh":"（汽车、飞机或物体的）船尾形/流线型收尾部分（用于减小风阻）"},"examples":[{"en":"The designer gave the car a boattail for better aerodynamics.","zh":"设计师把车尾做成船尾形，以提升空气动力性能。"},{"en":"A boattail shape helps smooth airflow behind the body.","zh":"船尾形的收尾有助于让物体后方的气流更顺畅。"}]},{"partOfSpeech":"n.","definition":{"en":"(politics) the ability of a popular candidate to help other candidates from the same party win votes","zh":"（政治）“带动效应”：人气候选人带动同党其他候选人得票的现象"},"examples":[{"en":"The governor’s popularity created a boattail effect in the local elections.","zh":"州长的人气在地方选举中产生了“带动效应”。"},{"en":"They hoped the presidential candidate would have strong boattails down the ballot.","zh":"他们希望总统候选人能在其他选票项目上产生强劲的带动作用。"}]},{"partOfSpeech":"adj.","definition":{"en":"having a rear part that is long, split, or tapered like a boattail (often in clothing or design)","zh":"燕尾式的；船尾形收束的（常用于服装或设计）"},"examples":[{"en":"He rented a boattail coat for the wedding.","zh":"他为婚礼租了一件燕尾礼服上衣。"},{"en":"The concept art shows a boattail rear section.","zh":"概念图展示了船尾形的后部结构。"}]}],"synonyms":["tailcoat (clothing)","coat tails (clothing)","tapered rear (design)","coattail effect (politics)"],"phonetic":"/ˈboʊtˌteɪl/","extraExplanation":["“boattail”来自“boat（船）+ tail（尾巴）”，形象地指像船尾一样逐渐收束或分叉的形状。","服装里的“boattail coat”通常指燕尾服/尾礼服（tailcoat），与日常的“overcoat（大衣）”不同，语境多为正式场合或历史照片。","政治用法常与“coattail effect（连带效应）”并用：更常见写法是“coattails”，但“boattails”也可见，强调“像衣摆一样把别人一起带上”。"]}
{"word":"boatward","summary":{"en":"“Boatward” means “toward a boat” (adv.) or “toward the boat side” (adj.), and it’s relatively uncommon/old-fashioned.","zh":"“boatward”表示“朝船的方向”（副词）或“朝向船边的”（形容词），用法较少见、略带古风。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Toward a boat; in the direction of a boat (often used in a physical, literal sense).","zh":"朝船的方向；向船那边（多用于具体方位）。"},"examples":[{"en":"They walked boatward along the shore before sunset.","zh":"日落前，他们沿着岸边朝船的方向走去。"},{"en":"The guide waved and pointed boatward, signaling everyone to return.","zh":"导游挥手并指向船那边，示意大家返回。"}]},{"partOfSpeech":"adj.","definition":{"en":"Situated or moving toward the boat side (used before a noun).","zh":"朝向船的一侧的；向船边移动的（作定语）。"},"examples":[{"en":"He took the boatward path to avoid the mud.","zh":"他走了通往船边的小路以避开泥地。"},{"en":"Keep your gear on the boatward side of the dock.","zh":"把你的装备放在码头靠船的一侧。"}]}],"synonyms":["toward the boat","to the boat","boatwards (rare)"],"phonetic":"/ˈboʊt.wɚd/","extraExplanation":["“boatward”比较少见，带有一点书面语/古风色彩。日常英语更常说“toward the boat”或“to the boat”。","后缀“-ward”表示“朝……方向”（如：homeward 回家方向、seaward 朝海、northward 向北）。因此 boat + ward 直观地就是“朝船那边”。"]}
{"word":"boatwards","summary":{"en":"Boatwards means “toward the boat.”","zh":"boatwards 意为“朝船的方向”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Toward the boat or ship; in the direction of a boat (often used for movement back to a boat from shore or another place).","zh":"朝着船的方向；向船那边（常用于表示从岸上或别处回到船的方向）。"},"examples":[{"en":"As the tide rose, they walked boatwards across the wet sand.","zh":"潮水上涨时，他们踏着湿沙朝船那边走去。"},{"en":"He turned boatwards, waving to the people on the deck.","zh":"他转身朝船那边走去，并向甲板上的人挥手。"}]}],"synonyms":["toward the boat","towards the boat","boatward (rare)"],"phonetic":"ˈboʊt.wərdz","extraExplanation":["“boatwards”较少见，语气偏文学或古风。结构是“boat + -wards”。“-wards”表示“朝……方向”（如：towards, homewards, northwards）。现代英语更常说“toward the boat / towards the boat”。"]}
{"word":"boatwise","summary":{"en":"Boatwise means ‘by boat’ or ‘using a boat.’","zh":"boatwise 表示“乘船地/用船地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(adverb) By boat; using a boat as the way to travel or transport something.","zh":"（副词）乘船地；用船作为旅行或运输方式地。"},"examples":[{"en":"Because the road was closed, we traveled boatwise across the lake.","zh":"因为道路封闭，我们改为乘船穿过湖面。"},{"en":"The supplies were sent boatwise to the island village.","zh":"补给品用船运到岛上的村庄。"}]}],"synonyms":["by boat","via boat","aboard a boat"],"phonetic":"/ˈboʊtwaɪz/","extraExplanation":["“boatwise”比较少见，属于由名词 boat + 后缀 -wise 构成的副词，意思是“以……方式/在……方面”。-wise 常见于 clockwise（顺时针地）、lengthwise（纵向地）、likewise（同样地）。在现代英语中，更常用的表达是 by boat 或 via boat。"]}
{"word":"boatwoman","summary":{"en":"A boatwoman is a woman who operates a boat, often ferrying or rowing people as a job.","zh":"boatwoman 指从事驾船或摆渡工作的女性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman who operates a boat, especially as a job (for example, rowing or ferrying people across a river)","zh":"女船夫；女摆渡人（指驾驶或划船为业的女性，例如在河上载人渡河）"},"examples":[{"en":"The boatwoman rowed us across the river before sunrise.","zh":"天亮前，那位女摆渡人把我们划船送过了河。"},{"en":"In the village, the boatwoman is known for guiding travelers safely through the narrow channels.","zh":"在村里，这位女船夫以安全带旅客穿过狭窄水道而闻名。"}]}],"synonyms":["female boat operator","female ferryman","boat operator","ferry operator"],"phonetic":"/ˈboʊtˌwʊmən/","extraExplanation":["“boatwoman”由“boat + woman”构成，语气中性，字面意思是“从事划船/摆渡/驾船工作的女性”。在现代英语里，更常见、更包容的说法是“boat operator”“boater”“ferryperson/ ferry operator”，但在强调性别或文学/历史语境中仍可能看到“boatwoman”。","在一些历史或地域语境（例如河网地区、渡口文化）中，“boatwoman”常带有民俗与劳动者形象的色彩，中文常译作“女船娘/女摆渡人”。"]}
{"word":"Boatwright","summary":{"en":"A boatwright is a craftsman who builds or repairs boats, especially traditional wooden boats.","zh":"Boatwright 指造船或修船的工匠，尤常指传统木船工匠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person whose job is to build or repair boats, especially wooden boats (a traditional boat builder).","zh":"造船匠；修船匠（尤指传统的木船工匠）"},"examples":[{"en":"The boatwright repaired the cracked hull before the fishing season began.","zh":"开渔季开始前，修船匠把船体的裂缝修好了。"},{"en":"In that coastal town, a skilled boatwright could build a small sailboat by hand.","zh":"在那座海滨小镇里，手艺精湛的造船匠能手工造出一艘小型帆船。"},{"en":"She apprenticed with a boatwright to learn traditional woodworking techniques.","zh":"她跟着一位造船匠当学徒，学习传统木工技艺。"}]}],"synonyms":["boat builder","shipwright","boat repairer","craftsman"],"phonetic":"/ˈboʊtˌraɪt/","extraExplanation":["“boatwright”由 boat（船）+ wright（工匠、制作者）组成；wright 也出现在 playwright（剧作家）、wheelwright（造车轮的匠人）等词中，带有“手艺人/匠人”的传统色彩。","在现代英语中，boatwright 偏书面或带复古/行业气息；日常更常见的说法是 boat builder（造船工）或 shipwright（造船/造舰工匠，范围更大）。"]}
{"word":"boatwright","summary":{"en":"A boatwright is a craftsperson who builds and repairs boats.","zh":"boatwright 指建造和修理船只的工匠（造船匠/修船匠）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person whose job is to build and repair boats, especially wooden boats; a boat builder (similar to a shipwright, but usually for smaller vessels).","zh":"造船匠；修船匠（尤指建造、修理木船的人；类似 shipwright，但通常指较小船只）。"},"examples":[{"en":"The harbor hired a boatwright to repair the old fishing boat’s hull.","zh":"港口雇了一位造船匠来修理那艘老渔船的船体外壳。"},{"en":"She learned traditional joinery skills from a local boatwright.","zh":"她从当地的造船匠那里学到了传统的榫卯/木工拼接技艺。"}]}],"synonyms":["boat builder","shipwright","boatbuilder","craftsman"],"phonetic":"/ˈboʊtˌraɪt/","extraExplanation":["“boatwright”由“boat（船）+ wright（工匠）”组成。“-wright”是英语里表示“制作/建造某物的人”的后缀，常见于 shipwright（造船匠，偏大船）、wheelwright（制轮匠）、playwright（剧作家，原义与“制作戏剧”相关）。这个词带有较强的传统手工业色彩，在描述木船工坊、历史题材或传统工艺时更常见。"]}
{"word":"boaty","summary":{"en":"Boaty means “related to boats/boating” or “boat-shaped.” It’s informal.","zh":"boaty表示“与船/划船有关、有航海风格的”，也可表示“像船一样的形状”。偏口语、非正式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to boats or boating; having a nautical feel or style.","zh":"与船只或划船活动有关的；有航海/水上气息或风格的。"},"examples":[{"en":"It’s a quiet, boaty town with a small harbor and seafood shops.","zh":"那是一座安静的海港小镇，很有“船味儿”，有小码头和海鲜店。"},{"en":"She wore a boaty jacket that looked perfect by the lake.","zh":"她穿了一件很“船风”的外套，在湖边看起来特别合适。"}]},{"partOfSpeech":"adj.","definition":{"en":"Boat-shaped; resembling a boat in form.","zh":"船形的；形状像小船的。"},"examples":[{"en":"The old bathtub had a boaty shape, wide in the middle and narrow at the ends.","zh":"那只旧浴缸外形像小船，中间宽、两头窄。"},{"en":"He drew a simple, boaty curve for the canoe’s outline.","zh":"他画了一条简洁的“船形”弧线来勾勒独木舟的轮廓。"}]}],"synonyms":["nautical","maritime","boatlike","seafaring"],"phonetic":"/ˈboʊti/","extraExplanation":["“boaty”是比较口语、偏非正式的形容词，使用频率不如“nautical / maritime / boatlike”高。日常写作或正式场合更常用这些更标准的词。","在英式语境里，“boaty”有时也可带一点生活化的氛围描述（例如“很适合划船/有划船文化的感觉”），更多强调一种场景气质而不只是“与船有关”。"]}
{"word":"boatyard","summary":{"en":"A boatyard is a place by the water where boats are built, repaired, and stored.","zh":"boatyard 指靠近水边、用于造船、修船与停放船只的船坞/船厂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place near the water where boats are built, repaired, stored, or kept in dry dock","zh":"船坞；船厂；修船厂（靠近水边，用于造船、修船、保养或停放船只的地方）"},"examples":[{"en":"We left the sailboat at the boatyard for repairs after the storm.","zh":"暴风雨过后，我们把帆船留在船坞里维修。"},{"en":"The boatyard workers painted the hull and checked the engine.","zh":"船厂的工人给船体上漆，并检查了发动机。"},{"en":"There’s a small boatyard at the end of the harbor.","zh":"港口尽头有一家小船厂。"}]}],"synonyms":["boat yard","dockyard","yard","shipyard (larger ships)"],"phonetic":"/ˈboʊtˌjɑrd/","extraExplanation":["“boatyard”是美式英语中很常见的词，尤其在沿海或有湖泊、河流的地区。它通常指提供保养、上架（把船吊到陆地上）、维修、存放等服务的场所，不一定是大型“造船厂”。","相关词辨析：\n- shipyard：更偏“大型船舶”的建造与修理（如货轮、军舰），规模通常更大。\n- marina：以“停泊/租泊位”为主的游艇码头，常配套餐饮、商店等，维修能力可能有限。","在文学或叙事语境中，boatyard常营造一种海港生活、手工劳动与“出海/归航”的氛围，例如：the smell of tar and salt at the boatyard（船坞里柏油与海盐的味道）。"]}
{"word":"boatyards","summary":{"en":"“Boatyards” means places where boats are built, repaired, or maintained.","zh":"“Boatyards”指建造、修理或保养船只的船厂/修船厂（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"places where boats are built, repaired, stored, or maintained (plural of “boatyard”)","zh":"船厂；修船厂；船坞（“boatyard”的复数）：建造、修理、停放或保养船只的地方"},"examples":[{"en":"Many boatyards along the coast repair fishing boats in winter.","zh":"沿海的许多船厂会在冬天修理渔船。"},{"en":"The marina works with local boatyards for engine repairs.","zh":"这个游艇码头与当地船厂合作进行发动机维修。"},{"en":"Old boatyards often smell like wood, paint, and salt air.","zh":"老船厂常常有木头、油漆和海风盐味混在一起的气味。"}]}],"synonyms":["boat repair yards","yards","marine repair facilities","shipyards (broader term)"],"phonetic":"/ˈboʊtˌjɑrdz/","extraExplanation":["“boatyard”通常指规模较小、以小型船只（如渔船、帆船、游艇）为主的建造或维修场地；而“shipyard”更常指大型船舶（如货轮、军舰）的造船厂。","在英美沿海文化中，boatyards常与本地手工木船、帆船维护（如上漆、补漏、换龙骨、保养发动机）等传统工艺联系在一起。"]}
{"word":"Boaz","summary":{"en":"Boaz is best known as a biblical man in the Book of Ruth; it is also used as a male first name.","zh":"Boaz 最常指《路得记》中的《圣经》人物；也可用作男性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A man in the Hebrew Bible (Old Testament), a wealthy landowner in Bethlehem who marries Ruth and becomes an ancestor of King David.","zh":"《希伯来圣经》（《旧约》）中的人物：伯利恒的富有地主，娶了路得（Ruth），并成为大卫王的祖先之一。"},"examples":[{"en":"In the Book of Ruth, Boaz shows kindness and protection to Ruth.","zh":"在《路得记》中，波阿斯善待并保护路得。"},{"en":"Boaz becomes part of the family line leading to King David.","zh":"波阿斯成为通向大卫王家族谱系的一部分。"}]},{"partOfSpeech":"n.","definition":{"en":"A male given name, often used because of the biblical character.","zh":"男性名字，常因《圣经》人物而被使用。"},"examples":[{"en":"They named their son Boaz after the figure from the Bible.","zh":"他们给儿子取名波阿斯，以纪念《圣经》中的人物。"},{"en":"Boaz is an uncommon but recognizable name in English.","zh":"Boaz 在英语里不算常见，但不少人能认得这个名字。"}]}],"phonetic":"/ˈboʊ.æz/","extraExplanation":["“Boaz”最常见的文化背景来自《路得记》。他被视为“kinsman-redeemer（至亲赎回者/家族救赎者）”的典型：在古代以色列社会中，近亲可以通过赎回土地、照顾寡妇等方式帮助亲族延续家族与产业。","在一些文学与宗教语境里，Boaz常象征正直、仁慈、承担责任的男性形象。"]}

