{"word":"BOC","summary":{"en":"BOC is an abbreviation most often meaning Bank of China; in Canadian contexts it can mean Bank of Canada, and in other settings it may stand for different organizations depending on context.","zh":"BOC 是一个缩写，最常见指“中国银行”；在加拿大语境中也可指“加拿大银行”；其他场合可能代表不同机构，需结合语境判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(most common) Abbreviation for Bank of China, a major state-owned commercial bank in China.","zh":"（最常见）“中国银行”的缩写，中国一家重要的国有商业银行。"},"examples":[{"en":"BOC offers foreign exchange services in many countries.","zh":"BOC 在许多国家提供外汇服务。"},{"en":"I need to transfer money through BOC.","zh":"我需要通过 BOC 转账。"}]},{"partOfSpeech":"n.","definition":{"en":"Abbreviation for Bank of Canada, Canada’s central bank (used mainly in Canadian contexts).","zh":"“加拿大银行”的缩写（主要在加拿大语境中使用），加拿大的中央银行。"},"examples":[{"en":"The BOC announced its new interest rate decision today.","zh":"BOC 今天公布了新的利率决定。"},{"en":"Inflation reports are closely watched by the BOC.","zh":"BOC 会密切关注通胀报告。"}]},{"partOfSpeech":"n.","definition":{"en":"A general initialism meaning “Board of …” or “Bureau of …” in some organizations (the exact meaning depends on the context).","zh":"在某些机构名称中可表示“……委员会（Board of …）”或“……局（Bureau of …）”等（具体含义取决于语境）。"},"examples":[{"en":"Please check what BOC stands for in this document.","zh":"请查一下这份文件里 BOC 具体代表什么。"},{"en":"In acronyms, BOC can have different meanings across industries.","zh":"在首字母缩略词中，BOC 在不同行业可能有不同含义。"}]}],"phonetic":"/bi oʊ si/","extraExplanation":["“BOC”是一个高度依赖语境的缩写。商务、金融语境里最常见的是 Bank of China；在加拿大新闻与经济讨论中，常见的是 Bank of Canada。看到“BOC”时，最好结合国家/地区、文件抬头、Logo、行业领域来判断。"]}
{"word":"boc","summary":{"en":"“BOC/Boc” is an abbreviation. Common meanings include the Bank of Canada, or (in chemistry) the Boc protecting group; the correct meaning depends on context.","zh":"“BOC/Boc”是缩写。常见含义包括加拿大银行，或（在化学中）Boc 保护基；具体含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) The Bank of Canada (Canada’s central bank).","zh":"（缩写）加拿大银行（加拿大的中央银行）。"},"examples":[{"en":"The BOC raised interest rates to fight inflation.","zh":"加拿大银行（BOC）提高利率以对抗通货膨胀。"},{"en":"Many Canadians watch BOC announcements closely.","zh":"许多加拿大人会密切关注加拿大银行（BOC）的公告。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) A general abbreviation said as the letters “B-O-C,” used for many organizations or terms; meaning depends on context.","zh":"（缩写）通常按字母读作“B-O-C”，可代表许多机构或术语；具体含义取决于语境。"},"examples":[{"en":"What does BOC stand for in this report?","zh":"在这份报告里，BOC 代表什么？"},{"en":"Please define BOC the first time you use it.","zh":"请在首次使用 BOC 时先写出其全称。"}]},{"partOfSpeech":"other","definition":{"en":"(chem.) “Boc,” short for tert-butyloxycarbonyl: a protective group used in organic chemistry (often written as Boc-).","zh":"（化学）“Boc”，tert-butyloxycarbonyl（叔丁氧羰基）的简称：有机化学中常用的保护基（常写作 Boc-）。"},"examples":[{"en":"We protected the amine with a Boc group.","zh":"我们用 Boc 保护基保护了这个胺基。"},{"en":"Boc deprotection is often done under acidic conditions.","zh":"Boc 脱保护通常在酸性条件下进行。"}]}],"phonetic":"/ˌbiː oʊ ˈsiː/","extraExplanation":["“BOC”在英文里非常常见但不够“唯一”，很多缩写都可能是 BOC。写作时通常第一次出现要写全称（例如 Bank of Canada），后面才用 BOC。","化学里的“Boc”常见于有机合成与肽合成文献中，通常写作“Boc-protected / Boc protection / Boc deprotection”。另外它的读音在实验室里常被读作类似“bock”（与按字母读 B-O-C 不同）。"]}
{"word":"Boca","summary":{"en":"“Boca” is Spanish for “mouth,” and in English it most often appears in proper names like Boca Raton or Boca Juniors.","zh":"“Boca”是西班牙语“嘴/口”，在英语里多用于专名，如博卡拉顿或博卡青年。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Spanish word meaning “mouth,” sometimes used in English in place names or Spanish-influenced contexts.","zh":"西班牙语“嘴、口”；在英语里多见于地名或西语文化语境中。"},"examples":[{"en":"In Spanish, “boca” means “mouth.”","zh":"在西班牙语里，“boca”的意思是“嘴”。"},{"en":"The town’s name includes “Boca,” a common Spanish word in place names.","zh":"这个城镇名字里包含“Boca”，这是地名中常见的西语词。"}]},{"partOfSpeech":"n.","definition":{"en":"a proper name used for several well-known places and institutions, such as Boca Raton (a city in Florida) or Boca Juniors (an Argentine soccer club).","zh":"专有名词：可指一些知名地点或机构，例如佛罗里达的博卡拉顿（Boca Raton）或阿根廷足球俱乐部博卡青年（Boca Juniors）。"},"examples":[{"en":"She moved to Boca Raton for a new job.","zh":"她为了新工作搬到了博卡拉顿。"},{"en":"Boca Juniors is one of Argentina’s most famous soccer teams.","zh":"博卡青年是阿根廷最有名的足球队之一。"}]}],"synonyms":["mouth (Spanish meaning)"],"phonetic":"/ˈboʊkə/","extraExplanation":["“Boca”来自西班牙语，字面义是“嘴/口”。在地名里常与地形有关：例如 Boca Raton 直译接近“老鼠口”（历史上也被解释为“入口/海湾口”的用法），属于早期航海与地理命名传统。","在阿根廷的布宜诺斯艾利斯有一个著名街区叫“La Boca”（意为“河口/港口入口”一带），和移民文化、探戈等联系紧密；因此你在英语中看到 Boca，有时是在谈拉美文化或相关专有名词。"]}
{"word":"boca","summary":{"en":"Boca is a Spanish word meaning “mouth,” used in English mostly in names (places, teams, cultural references).","zh":"Boca 源自西班牙语，意为“嘴/口”，在英语中多见于地名、球队名等专有名词或文化指称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Spanish) “mouth”; used in English mainly in place names, nicknames, and cultural references.","zh":"（源自西班牙语）“嘴、口”；在英语里多用于地名、绰号或文化指称。"},"examples":[{"en":"Boca Raton is a city in Florida.","zh":"Boca Raton（博卡拉顿）是美国佛罗里达州的一座城市。"},{"en":"The song mentions La Boca, a neighborhood in Buenos Aires.","zh":"这首歌提到了 La Boca（拉博卡），它是布宜诺斯艾利斯的一个街区。"},{"en":"In Spanish class, we learned that boca means “mouth.”","zh":"在西班牙语课上，我们学到 boca 的意思是“嘴”。"}]},{"partOfSpeech":"n.","definition":{"en":"A common short form for names like Boca Juniors (an Argentine football club) in sports talk and media.","zh":"在体育语境和媒体中，常用作 Boca Juniors（阿根廷足球俱乐部“博卡青年”）等名称的简称。"},"examples":[{"en":"Boca played at home tonight.","zh":"博卡（博卡青年）今晚主场比赛。"},{"en":"He’s a lifelong Boca fan.","zh":"他是博卡的铁杆球迷。"}]}],"synonyms":["mouth"],"phonetic":"/ˈboʊkə/","extraExplanation":["“Boca”是西班牙语常用词，基本义为“嘴/口”。英语里单独使用不算常见，更多出现在专有名词中（如地名 Boca Raton、社区 La Boca、球队 Boca Juniors）。","在地理命名里，西班牙语的 boca 也常引申为“河口/入口”（类似英语 mouth），所以一些地名里的 Boca 可能带有“口、入口”的含义。"]}
{"word":"bocaccio","summary":{"en":"Boccaccio is an Italian Renaissance author, famous for The Decameron.","zh":"薄伽丘是意大利文艺复兴时期作家，以《十日谈》闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Giovanni Boccaccio (1313–1375), an important Italian writer and poet of the early Renaissance, best known for The Decameron.","zh":"乔万尼·薄伽丘（1313–1375），意大利早期文艺复兴时期的重要作家与诗人，最著名的作品是《十日谈》。"},"examples":[{"en":"Boccaccio is often studied alongside Dante and Petrarch in Italian literature.","zh":"在意大利文学中，薄伽丘常与但丁和彼特拉克一同被研究。"},{"en":"In The Decameron, Boccaccio uses a frame story to connect many short tales.","zh":"在《十日谈》中，薄伽丘用“框架故事”把许多短篇故事串联起来。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension) Boccaccio’s work, especially The Decameron, or his storytelling style.","zh":"（引申）指薄伽丘的作品（尤指《十日谈》）或他的叙事风格。"},"examples":[{"en":"The novel’s structure clearly borrows from Boccaccio.","zh":"这部小说的结构明显借鉴了薄伽丘的写法。"}]}],"synonyms":["Giovanni Boccaccio","author of The Decameron"],"phonetic":"/boʊˈkɑːtʃioʊ/","extraExplanation":["“Boccaccio”常见拼写是“Boccaccio”，有时学习者会写成“bocaccio”。英文里通常把它当作专有名词使用，首字母要大写：Boccaccio。","《十日谈》（The Decameron）以“逃离瘟疫的一群人轮流讲故事”为框架，影响了后来的短篇小说传统与“故事集”写法（frame narrative）。"]}
{"word":"bocaccios","summary":{"en":"“Bocaccios” usually refers to “Boccaccio’s” (belonging to Giovanni Boccaccio or his works), or less commonly the plural of the surname Boccaccio.","zh":"“bocaccios”通常指“Boccaccio’s”（薄伽丘的：与薄伽丘或其作品有关），较少情况下也可作姓氏 Boccaccio 的复数。"},"definitions":[{"partOfSpeech":"det.","definition":{"en":"belonging to or associated with Giovanni Boccaccio (the Italian writer), or with something he wrote (especially *The Decameron*).","zh":"指“薄伽丘的”：属于或与意大利作家乔万尼·薄伽丘有关的，或与他的作品（尤其《十日谈》）有关的。"},"examples":[{"en":"We discussed Boccaccio’s *Decameron* in our literature class.","zh":"我们在文学课上讨论了薄伽丘的《十日谈》。"},{"en":"The article analyzes Boccaccio’s influence on later European storytelling.","zh":"这篇文章分析了薄伽丘对后世欧洲叙事传统的影响。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) people with the surname “Boccaccio.”","zh":"（复数）姓“薄伽丘”（Boccaccio）的人。"},"examples":[{"en":"The museum’s donor list includes two Boccaccios.","zh":"博物馆的捐赠者名单里有两位姓薄伽丘的人。"}]}],"synonyms":["Boccaccio’s (standard spelling)"],"phonetic":"boʊˈkɑːtʃioʊz","extraExplanation":["“Boccaccio”通常指14世纪佛罗伦萨作家乔万尼·薄伽丘（Giovanni Boccaccio）。他的《十日谈》（*The Decameron*）以框架叙事串联百则故事，常被视为欧洲短篇小说传统的重要源头之一。","英文里你看到的“bocaccios”多半是把“Boccaccio’s”（薄伽丘的）写成了不带撇号的形式；在正式写作中，表示所属关系一般写作“Boccaccio’s”。"]}
{"word":"bocage","summary":{"en":"Bocage means countryside divided into small fields by thick hedges and trees, especially in Normandy, France.","zh":"bocage 指被浓密树篱与树木分隔成小块田地的田园地貌，尤见于法国诺曼底。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a landscape of small fields separated by thick hedges, trees, and sunken lanes; especially common in parts of northwestern France (such as Normandy).","zh":"（尤指法国西北部如诺曼底的）“树篱田园”地貌：由许多小块田地组成，田与田之间用浓密树篱、树木和下沉小路分隔。"},"examples":[{"en":"The soldiers struggled to move tanks through the bocage.","zh":"士兵们很难让坦克穿过那片树篱田园地带。"},{"en":"From the hilltop, you could see the patchwork of fields and hedges typical of the bocage.","zh":"从山顶望去，你能看到那种典型树篱田园地貌：田块与树篱交织成拼布般的景象。"}]}],"synonyms":["hedgerow country","hedged farmland","wooded farmland"],"phonetic":"/boʊˈkɑːʒ/","extraExplanation":["“bocage”是从法语借来的词，在英语里多用来指诺曼底一带的树篱田园地形。它在二战语境中很常见：1944年诺曼底登陆后，密集的树篱与狭窄道路让推进与视野变得困难，因此你可能会在历史书或战争题材作品中看到这个词。"]}
{"word":"bocal","summary":{"en":"Bocal means a (usually glass) jar or beaker, often used for storing or preserving food; it’s a French loanword and not very common in everyday English.","zh":"bocal 指（通常为玻璃的）罐/杯状容器，常用于储存或保存食物；它是法语借词，在日常英语里不太常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a glass jar or beaker, especially one used to hold or preserve food (a word borrowed from French; uncommon in everyday English).","zh":"玻璃罐；玻璃杯（多指盛放或保存食物的容器；源自法语，在日常英语中不常用）。"},"examples":[{"en":"She poured the jam into a sterilized bocal and sealed it tightly.","zh":"她把果酱倒进消毒过的玻璃罐里，并把盖子拧紧密封。"},{"en":"The lab sample was kept in a small bocal on the shelf.","zh":"实验样本被放在架子上的一个小玻璃容器里。"}]}],"synonyms":["jar","glass jar","beaker","container"],"phonetic":"/boʊˈkɑl/","extraExplanation":["“bocal”主要是法语借词（法语里常指带口的玻璃容器），在英语里较少见；日常英语更常用的说法是“jar”“glass jar”“beaker”（实验室）。","如果你是在食谱、法式料理、或双语（英法）环境中看到它，通常就是指“装果酱/腌渍物的玻璃罐”这一类容器。"]}
{"word":"bocardo","summary":{"en":"Bocardo is a rare historical word meaning either the old Oxford city prison or, in medieval logic, a named syllogism pattern.","zh":"Bocardo 是一个罕见的历史词：可指牛津旧时的市监狱，也可指中世纪逻辑学中一种三段论式样的名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A prison, especially the old city jail in Oxford, England (often called “the Bocardo”).","zh":"（历史用法）监狱；特指英国牛津城旧时的市监狱（常被称为 the Bocardo）。"},"examples":[{"en":"In old Oxford records, the city prison was often referred to as the Bocardo.","zh":"在旧时的牛津档案中，市监狱常被称为 the Bocardo。"},{"en":"The writer described a prisoner being taken to the Bocardo after the trial.","zh":"作者描写一名囚犯在审判后被押往 Bocardo。"}]},{"partOfSpeech":"n.","definition":{"en":"(logic, historical) The name of a traditional syllogism pattern used in medieval logic textbooks (the “Bocardo” mood).","zh":"（逻辑学，历史用法）中世纪逻辑教材中一种三段论式样的名称（称为 “Bocardo” 式）。"},"examples":[{"en":"In the lesson on syllogisms, the teacher mentioned Bocardo as one of the medieval mnemonic names.","zh":"在讲三段论的课上，老师提到 Bocardo 是中世纪用来助记的一种名称。"},{"en":"Bocardo is rarely used outside historical discussions of logic.","zh":"Bocardo 很少在历史逻辑讨论之外使用。"}]}],"synonyms":["(prison sense) jail","(prison sense) prison","(logic sense) syllogism mood","(logic sense) syllogistic form"],"phonetic":"/boʊˈkɑrdoʊ/","extraExplanation":["“Bocardo”在英语里很少见，主要出现在两类语境：①牛津历史（旧城门兼牢狱的称呼）；②中世纪逻辑学（三段论格/式的助记名称之一，和 Barbara、Celarent 等类似）。","发音与拼写都带有明显的拉丁化/学术传统色彩，所以在现代日常英语中几乎不会用来指普通“监狱”。"]}
{"word":"bocasin","summary":{"en":"“Bocasin” is a rare spelling of “moccasin,” usually meaning a soft leather shoe.","zh":"“bocasin”是“moccasin”的少见拼写，通常指柔软的皮革鞋（莫卡辛鞋）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare or nonstandard spelling of “moccasin,” a soft shoe made of leather (often associated with Native American footwear).","zh":"“moccasin（莫卡辛鞋）”的少见或非标准拼写，指一种柔软的皮革鞋（常与北美原住民传统鞋履相关）。"},"examples":[{"en":"In some old texts, you may see “bocasin,” but today the standard spelling is “moccasin.”","zh":"在一些旧文本里你可能会看到“bocasin”，但如今标准拼写是“moccasin”。"},{"en":"He bought a pair of moccasins for the winter cabin trip.","zh":"他买了一双莫卡辛鞋，准备去冬季小木屋旅行时穿。"}]}],"synonyms":["moccasin","slipper","loafer"],"phonetic":"ˈmɑkəsɪn","extraExplanation":["“moccasin”一词源自北美原住民语言（常见说法是源于阿尔冈昆语族相关词），经由法语等语言进入英语，因此和北美原住民文化语境联系较深。现代英语里几乎都用标准拼写“moccasin”。","补充：在美式英语中，“moccasin”也可以指一种毒蛇（如 cottonmouth，又叫 water moccasin）。如果你看到与蛇相关的语境，通常就是这个意思。"]}
{"word":"bocasine","summary":{"en":"Bocasine is an old word for a soft cotton fabric used historically for clothing or linings.","zh":"Bocasine 是一种古旧用词，指过去用于衣物或内衬的柔软棉布。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a soft cotton (sometimes cotton-and-linen) fabric, often used in the past for clothing or linings; an old-fashioned word now mostly found in historical writing","zh":"一种柔软的棉布（有时为棉麻混纺），过去常用于做衣物或内衬；属于较古旧的词，多见于历史或文学语境"},"examples":[{"en":"The museum displayed a 17th-century shirt made of bocasine.","zh":"博物馆展出了一件17世纪的衬衫，是用bocasine（古棉布）制成的。"},{"en":"In the novel, the servant’s coat is described as plain bocasine, not silk.","zh":"小说里写到仆人的外套是朴素的bocasine，而不是丝绸。"}]}],"synonyms":["cotton cloth","cotton fabric","calico (similar context)"],"phonetic":"/ˈboʊkəˌsin/","extraExplanation":["这个词也常见拼写为 bocasin / bocassine。它在现代日常英语里很少使用，更可能出现在古籍、服装史、纺织史或文学描写中。","词源一般认为与中古法语/意大利语中表示“棉布”的词有关；在英语文本里常被用来强调“朴素、日常的布料”，与 silk（丝绸）、velvet（天鹅绒）等形成对比。"]}
{"word":"bocca","summary":{"en":"Bocca is an Italian word meaning “mouth,” and it also appears in music in “bocca chiusa,” meaning closed-mouth humming.","zh":"bocca 是意大利语“嘴／口”，在音乐中也常见于 bocca chiusa，表示闭口哼唱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Italian loanword) “mouth”; used in Italian names, restaurants, and some musical directions.","zh":"（意大利语借词）“嘴；口”；常见于意大利语名称（如店名、地名）以及部分音乐术语中。"},"examples":[{"en":"The restaurant name “La Bocca” literally means “the mouth.”","zh":"餐厅名“La Bocca”直译就是“嘴／口”。"},{"en":"In the program notes, you may see Italian words like bocca in titles or headings.","zh":"在节目单说明里，你可能会在标题或小标题中看到像 bocca 这样的意大利词。"}]},{"partOfSpeech":"phrase","definition":{"en":"In music: short for the Italian phrase “bocca chiusa,” meaning singing with a closed mouth (humming).","zh":"（音乐）常指意大利语短语“bocca chiusa”的省略：闭口哼唱（用闭着嘴的方式发声）。"},"examples":[{"en":"The choir sings bocca chiusa to create a soft, humming effect.","zh":"合唱团用 bocca chiusa（闭口哼唱）来制造柔和的嗡鸣效果。"},{"en":"The score marks “bocca chiusa” in the middle section.","zh":"乐谱在中段标注了“bocca chiusa（闭口哼唱）”。"}]}],"synonyms":["mouth","oral cavity","(music) humming"],"phonetic":"/ˈboʊkə/","extraExplanation":["“bocca”是意大利语，标准意大利语读音更接近/ˈbɔk.ka/（双写c会读得更“重、更停顿”）。英语语境里常被英语化读成/ˈboʊkə/。","你也可能见到相关表达：in bocca al lupo（字面“进狼嘴里”，实际相当于祝你好运；常回Crepi!或Crepi il lupo!表示“狼死了！”）。","在英语里它不是常用日常词汇，更常作为店名、作品名、角色名或音乐术语出现。"]}
{"word":"Boccaccian","summary":{"en":"Boccaccian means “related to Boccaccio” or “in a Boccaccio-like, lively and sometimes bawdy style.”","zh":"Boccaccian 指“与薄伽丘及其作品相关”，也可引申为“具有薄伽丘式生动、写实且有时较露骨的叙事风格”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Italian writer Giovanni Boccaccio (1313–1375) or his works, especially *The Decameron*.","zh":"与意大利作家薄伽丘（Giovanni Boccaccio，1313–1375）或其作品（尤指《十日谈》）有关的。"},"examples":[{"en":"The course included several Boccaccian tales from *The Decameron*.","zh":"课程选读了《十日谈》中的几则薄伽丘式故事。"},{"en":"Her thesis focuses on Boccaccian influence on later European storytelling.","zh":"她的论文聚焦薄伽丘对后世欧洲叙事传统的影响。"}]},{"partOfSpeech":"adj.","definition":{"en":"(By extension) Like Boccaccio’s storytelling style—lively, realistic, and sometimes humorous or sexually frank.","zh":"（引申）具有薄伽丘叙事风格的——生动、写实，常带幽默感，有时也较为大胆露骨（涉及性或世俗欲望）。"},"examples":[{"en":"The novel’s Boccaccian humor mixes everyday life with sharp social satire.","zh":"这部小说带有薄伽丘式幽默，把日常生活与尖锐的社会讽刺融合在一起。"},{"en":"Some readers find the play a bit too Boccaccian for a family audience.","zh":"有些读者觉得这出戏对家庭观众来说有点过于“薄伽丘式”（尺度偏大胆）。"}]}],"synonyms":["Boccaccio-related","Decameronian","bawdy (context-dependent)","earthy (context-dependent)"],"phonetic":"/bəˈkɑːkiən/","extraExplanation":["“Boccaccian”多用于文学评论语境，强调《十日谈》的叙事特点：框架故事（故事套故事）、节奏明快、人物世俗鲜活、对人性与社会的观察带有机智与讽刺。","在英语里它有时也带一点评价色彩：夸它“生动机智”，或委婉指出“内容较露骨/辛辣”。使用时注意语境与受众。"]}
{"word":"Boccaccio","summary":{"en":"Boccaccio is an Italian Renaissance author, most famous for *The Decameron*.","zh":"薄伽丘是意大利文艺复兴时期作家，以《十日谈》最著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Giovanni Boccaccio (1313–1375), an Italian writer and poet of the early Renaissance, best known for *The Decameron*, a famous collection of short stories.","zh":"乔万尼·薄伽丘（1313–1375），意大利早期文艺复兴时期的作家与诗人，以短篇故事集《十日谈》最为著名。"},"examples":[{"en":"Boccaccio’s *The Decameron* influenced later European storytelling.","zh":"薄伽丘的《十日谈》影响了后来的欧洲叙事文学。"},{"en":"In literature class, we read a few tales by Boccaccio to learn about the Renaissance.","zh":"在文学课上，我们读了薄伽丘的几则故事来了解文艺复兴。"}]}],"synonyms":["Giovanni Boccaccio"],"phonetic":"/boʊˈkɑːtʃioʊ/","extraExplanation":["“Boccaccio”在英语里通常指“薄伽丘本人”，也常用来代指他的代表作《The Decameron（十日谈）》。在14世纪黑死病背景下，《十日谈》以“十个人避疫讲故事”的框架，呈现爱情、机智、人性与社会百态，对后世短篇小说与框架叙事影响很大。","读音提示：英语中常按意大利语来源读成重音在第二个音节（boh-KAH-choh）。"]}
{"word":"boccaccio","summary":{"en":"Boccaccio is an important Italian Renaissance writer, best known for *The Decameron*; the name can also refer to his storytelling style.","zh":"薄伽丘是意大利早期文艺复兴的重要作家，以《十日谈》闻名；也可引申指他的叙事风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Giovanni Boccaccio (1313–1375), a major Italian writer and poet of the early Renaissance, best known for the story collection *The Decameron*.","zh":"乔万尼·薄伽丘（1313–1375），意大利早期文艺复兴时期的重要作家与诗人，以故事集《十日谈》最为著名。"},"examples":[{"en":"In literature class, we read Boccaccio to understand early Renaissance storytelling.","zh":"在文学课上，我们读薄伽丘，以了解早期文艺复兴时期的叙事方式。"},{"en":"Many later writers were influenced by Boccaccio’s *Decameron*.","zh":"许多后来的作家都受到薄伽丘《十日谈》的影响。"}]},{"partOfSpeech":"n.","definition":{"en":"By extension, Boccaccio’s work or style (especially the humorous, realistic, and sometimes bawdy storytelling associated with *The Decameron*).","zh":"引申义：指薄伽丘的作品或风格（尤其是与《十日谈》相关的幽默、写实、偶尔略带辛辣或露骨的叙事风格）。"},"examples":[{"en":"The novel has a Boccaccio-like mix of tragedy and comedy.","zh":"这部小说带有一种薄伽丘式的悲喜交织。"}]}],"phonetic":"/boʊˈkɑːtʃioʊ/","extraExplanation":["“Boccaccio”在英语里通常指人名“Giovanni Boccaccio”，首字母要大写；谈到他的代表作时常见写法是 *The Decameron*（《十日谈》）。","《十日谈》的框架是：一群年轻人为了躲避黑死病而离开城市，在乡间轮流讲故事。这种“框架叙事”对后世短篇故事传统影响很大（例如乔叟等作家的创作常被拿来对照）。"]}
{"word":"boccale","summary":{"en":"Boccale means a (usually Italian) jug/pitcher, sometimes a large beer mug.","zh":"boccale 指（多见于意大利场景的）壶/酒壶/水壶，有时也指大啤酒杯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Italian loanword) a jug or pitcher, often used for wine or water, especially in Italy; sometimes a large mug/steins used for beer.","zh":"（意大利语借词）大口壶／水壶／酒壶，常见于意大利餐饮场景；有时也指大啤酒杯（类似啤酒扎）。"},"examples":[{"en":"The waiter brought a boccale of house wine to the table.","zh":"服务员端来一壶（boccale）店里自酿的葡萄酒。"},{"en":"In some Italian bars, you can order beer by the boccale.","zh":"在一些意大利酒吧，你可以按“boccale”（一大杯）来点啤酒。"}]}],"synonyms":["jug","pitcher","carafe","mug","stein"],"phonetic":"/boʊˈkɑːleɪ/","extraExplanation":["“boccale”来自意大利语，原意与“口/嘴”（bocca）有关，指“有口的容器”，因此常用于指带壶口、便于倒酒/倒水的壶。","在英文里它属于较少见的外来词，更常出现在意大利餐馆菜单、旅行写作或与意大利饮食文化相关的语境中。"]}
{"word":"boccarella","summary":{"en":"Boccarella is usually an Italian surname used as a name in English.","zh":"Boccarella 通常是意大利姓氏，在英语中作为名字使用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper noun, usually an Italian surname (family name). It is not a common English vocabulary word, and in English it is typically used only as a name (e.g., a person, business, or place).","zh":"专有名词，通常是意大利语姓氏（家族姓）。它不是常见的英语词汇，在英语中多作为名字使用（如人名、商号或地名）。"},"examples":[{"en":"Dr. Boccarella will see you at 3 p.m.","zh":"Boccarella 医生会在下午三点见你。"},{"en":"I found the article by Boccarella in the library database.","zh":"我在图书馆数据库里找到了 Boccarella 写的那篇文章。"}]}],"phonetic":"/ˌboʊkəˈrɛlə/","extraExplanation":["“Boccarella”很可能源自意大利语：bocca 表示“嘴/口”，-ella 常见于意大利语中作指小或昵称后缀，因此在意大利语语感中可能带有“（小）嘴/口”的词源联想。不过在英语环境里通常不按词义理解，而是直接当作姓氏拼写与发音。","如果你是在菜单、餐馆招牌或品牌上看到它，也可能只是店名/品牌名；这种情况下同样按专名使用。"]}
{"word":"boccaro","summary":{"en":"Boccaro means unglazed reddish-brown stoneware, often used for fine tea vessels like Yixing-style teapots.","zh":"boccaro 指一种不施釉的红褐色细陶/紫砂类陶器，常用于精致茶器（如宜兴风格茶壶）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of unglazed reddish-brown stoneware (often associated with Chinese Yixing teapots and other fine clay vessels), valued for its porous clay and warm color","zh":"一种不施釉的红褐色细陶/紫砂类陶器（常与中国宜兴紫砂壶等器物相关），因其细腻多孔的泥料与温润色泽而受珍藏"},"examples":[{"en":"The collector displayed a boccaro teapot beside blue-and-white porcelain.","zh":"收藏家把一把 boccaro（紫砂类）茶壶摆在青花瓷旁边展示。"},{"en":"Boccaro ware is often appreciated for how the clay slowly absorbs the aroma of tea.","zh":"人们常称赞 boccaro（紫砂类）器物，因为泥料会慢慢吸收茶香。"}]}],"synonyms":["Yixing ware","red stoneware","unglazed stoneware","teapot clay"],"phonetic":"/boʊˈkɑːroʊ/","extraExplanation":["“boccaro”在英文里多见于古董、陶瓷与工艺品语境，常被用来指代欧洲早期对“宜兴紫砂/红褐色细陶”的称呼之一。不同资料中拼写与所指范围可能略有差异（有时与“Yixing ware/紫砂”相关，有时更宽泛指红褐色无釉细陶）。如果你是在某本书、拍卖目录或标签上看到它，结合产地与器形描述来判断最准确。"]}
{"word":"bocce","summary":{"en":"Bocce is an Italian ball-rolling game where you try to get your ball closest to a small target ball.","zh":"Bocce（博切球）是一种源自意大利的滚球游戏，目标是让自己的球尽量靠近目标小球。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a game in which players roll large balls on a long, narrow court, trying to get as close as possible to a smaller target ball (often called the “pallino”)","zh":"一种滚球游戏：玩家在长而窄的场地上滚动较大的球，目标是尽量靠近较小的目标球（常称“pallino/目标球”）"},"examples":[{"en":"We played bocce at the park after dinner.","zh":"晚饭后我们在公园玩了博切球。"},{"en":"In bocce, you score points by placing your ball closer to the pallino than your opponent’s ball.","zh":"在博切球里，你的球比对手更接近目标球就能得分。"},{"en":"The community center has a new bocce court.","zh":"社区中心新建了一个博切球场地。"}]}],"synonyms":["bocce ball","lawn bowling (similar)","boules (related)","pétanque (related)"],"phonetic":"/ˈbɑtʃi/","extraExplanation":["“Bocce”来自意大利语，在美国常见于意大利裔社区的社交活动中，也常在公园或社区中心看到“bocce court（博切球场）”。","相关词：pallino（目标小球），bocce ball（博切球），bocce court（场地）。有时也会听到“bocce ball”指这项运动本身。"]}
{"word":"bocces","summary":{"en":"“Bocce” is an outdoor ball-rolling game (and can also mean the balls used in it). “Bocces” is an uncommon plural—people usually say “bocce” or “bocce balls.”","zh":"“bocce”指一种户外滚球游戏，也可指波切球本身。“bocces”这种复数写法不太常见，通常说“bocce”或“bocce balls”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a game in which players roll large balls to get as close as possible to a smaller target ball (the pallino); often played outdoors on a long, narrow court","zh":"一种滚球游戏：玩家把大球滚向小目标球（pallino/目标球），看谁的球更接近；常在户外狭长球道上进行"},"examples":[{"en":"We played bocce in the park after dinner.","zh":"晚饭后我们在公园玩了波切球。"},{"en":"Our neighborhood has a bocce court near the community center.","zh":"我们社区中心旁边有一个波切球场。"}]},{"partOfSpeech":"n.","definition":{"en":"the balls used in the game of bocce (often called “bocce balls”)","zh":"波切球（用于该游戏的球，常说 bocce balls）"},"examples":[{"en":"Bring the bocce balls and the pallino.","zh":"把波切球和目标球带上。"},{"en":"These bocce balls are heavier than I expected.","zh":"这些波切球比我想的更重。"}]}],"synonyms":["bocce ball","lawn bowling (similar)"],"phonetic":"/ˈbɑtʃi/","extraExplanation":["“bocce”来自意大利语（与“嘴/口”相关的词根有关），在英语里常指这项运动本身或用来玩的球。","你输入的“bocces”在英语里不太常见：很多人会把复数写成“bocce balls”来避免混淆；也有人口语里说“a game of bocce”。","常见相关词：pallino（小目标球，也叫 jack）、bocce court（球场）、lawn bowling（草地滚球，类似但不是同一种）。"]}
{"word":"Boccherini","summary":{"en":"Boccherini is the name of an Italian Classical-era composer and cellist, famous for chamber music (especially string quintets).","zh":"Boccherini 指意大利古典时期作曲家兼大提琴家博凯里尼，以室内乐（尤其弦乐五重奏）著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) An Italian composer and cellist (Luigi Boccherini, 1743–1805), known for elegant Classical-era chamber music, especially string quintets and works featuring the cello.","zh":"（专有名词）意大利作曲家兼大提琴家路易吉·博凯里尼（Luigi Boccherini，1743–1805），以典雅的古典时期室内乐闻名，尤其是弦乐五重奏以及突出大提琴的作品。"},"examples":[{"en":"Boccherini wrote many string quintets that give the cello a leading role.","zh":"博凯里尼写了许多弦乐五重奏，让大提琴成为主角。"},{"en":"In our music history class, we compared Boccherini with Haydn and Mozart.","zh":"在音乐史课上，我们把博凯里尼和海顿、莫扎特作比较。"},{"en":"If you like graceful, light Classical music, try listening to Boccherini’s chamber works.","zh":"如果你喜欢优雅、轻盈的古典音乐，可以试着听听博凯里尼的室内乐作品。"}]}],"synonyms":["Luigi Boccherini"],"phonetic":"/ˌbɑːkəˈriːni/","extraExplanation":["“Boccherini”在英语里通常指“路易吉·博凯里尼”本人，也常用来指他的作品或风格（例如：a Boccherini quintet / a Boccherini recording）。","他长期在西班牙宫廷环境中工作，因此作品里常被认为带有一点“西班牙风味”的节奏与舞曲气息。","常见学习线索：他的《G大调小步舞曲》（Minuet）非常有名，常出现在古典音乐入门歌单里。"]}
{"word":"bocci","summary":{"en":"Bocci usually refers to bocce, an Italian bowling-style ball game played by rolling balls close to a small target ball.","zh":"Bocci 通常指 bocce（地滚球），一种意大利的“滚球靠近小目标球”的游戏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an Italian ball game (similar to lawn bowling) played by rolling large balls as close as possible to a small target ball","zh":"一种意大利滚球游戏（类似草地保龄/地滚球），把大球滚向小目标球，尽量靠近目标球"},"examples":[{"en":"We played bocci at the park after dinner.","zh":"晚饭后我们在公园玩了地滚球（bocci）。"},{"en":"The community center has a bocci court.","zh":"社区中心有一个地滚球场地。"}]}],"synonyms":["bocce","lawn bowling","bowls"],"phonetic":"/ˈboʊtʃi/","extraExplanation":["“bocci”在英语里常见为对意大利语外来词“bocce”的拼写变体或误拼；在美国更常见写法是“bocce”，读音也通常按“BOH-chee”。","玩法要点：先掷出小目标球（常叫 pallino / jack），再轮流滚大球去贴近它；越靠近目标球得分越高。常见于意大利裔社区的社交活动与公园娱乐。"]}
{"word":"boccia","summary":{"en":"Boccia is an accessible target ball sport where you try to place your balls closest to a small target ball (the jack), well known in the Paralympics.","zh":"Boccia（地掷球）是一种无障碍的目标球运动，目标是让自己的球尽量靠近小目标球（jack），在残奥会中非常知名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a target sport in which players throw or roll soft leather balls as close as possible to a smaller target ball (the jack); it is especially popular as a Paralympic sport and is designed to be accessible for people with physical disabilities.","zh":"一种投掷/滚掷的目标球类运动：选手把软皮球尽量掷到或滚到靠近较小的目标球（jack/目标球）；在残奥会中很常见，强调让肢体障碍人士也能参与。"},"examples":[{"en":"She started playing boccia at a community center and later competed nationally.","zh":"她在社区中心开始打地掷球，后来还参加了全国比赛。"},{"en":"In boccia, strategy matters—sometimes you block an opponent’s ball instead of aiming directly at the jack.","zh":"在地掷球里，策略很重要——有时你会选择挡住对手的球，而不是直接瞄准目标球。"}]}],"synonyms":["target ball sport","Paralympic boccia (sport)"],"phonetic":"/ˈbɑtʃə/","extraExplanation":["Boccia 的词源来自拉丁语 *bottia*（球/投球相关），现代形式在意大利语中流传，读法接近“BOT-cha”。","它和 *bocce*（意大利传统地滚球）名字相似，但并不完全相同：残奥会项目的 boccia 使用皮质软球，规则与分级更强调无障碍与公平竞赛。","常见相关词：*jack*（目标球/小白球），*end*（一局/一轮），*ramp*（辅助斜坡，用于推送球）。"]}
{"word":"boccias","summary":{"en":"“Boccias” usually refers to the sport boccia (often used as “boccia” even in plural) or, less commonly, multiple boccia games/sets of balls.","zh":"“boccias”通常指 boccia 这项运动（复数多也写作 boccia），较少情况下指多场比赛或多套用球。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Boccia: a precision ball sport (similar to bocce) in which players roll, throw, or kick leather balls to get as close as possible to a small target ball (the jack). “Boccias” is an uncommon plural form meaning games or sets of boccia balls.","zh":"Boccia（硬地滚球/地掷球的一种）：一种精准投球运动（与意大利地掷球 bocce 类似），选手通过滚、掷或脚踢皮球，使球尽量靠近小目标球（jack/目标球）。“boccias”是不太常见的复数形式，可指多场 boccia 比赛或多组 boccia 用球。"},"examples":[{"en":"She started playing boccia in a community sports program.","zh":"她在社区体育项目中开始玩 boccia。"},{"en":"In boccia, the goal is to place your ball closer to the jack than your opponent’s ball.","zh":"在 boccia 里，目标是让自己的球比对手的球更靠近目标球（jack）。"},{"en":"They watched the Boccia events during the Paralympics.","zh":"他们观看了残奥会的 Boccia 比赛项目。"}]}],"synonyms":["boccia","bocce","ball sport","precision sport"],"phonetic":"/ˈbɑtʃə/","extraExplanation":["Boccia 常见于残奥会（Paralympics），特别适合肢体障碍运动员参与；规则强调策略与精准控制。","词源来自意大利语，与 bocce（意大利地掷球）同源；英语里更常见的写法是单数 boccia，复数通常也直接用 boccia，而不是 boccias。"]}
{"word":"boccie","summary":{"en":"Bocce is an Italian-style ball game where you roll balls to get closest to a small target ball; it can also mean the set of balls used.","zh":"Bocce 是一种意大利掷球游戏，玩法是把球滚到尽量靠近小目标球；也可指这项运动所用的一套球具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a ball game (originally from Italy) in which players roll large balls on a flat court to try to land them closest to a small target ball","zh":"一种源自意大利的掷球游戏：玩家在平坦场地上滚动大球，尽量让球停在最靠近小目标球的位置"},"examples":[{"en":"We played bocce in the park after lunch.","zh":"午饭后我们在公园玩了掷球（bocce）。"},{"en":"The goal is to get your ball closer to the pallino than your opponent’s.","zh":"目标是让你的球比对手更靠近小目标球（pallino）。"}]},{"partOfSpeech":"n.","definition":{"en":"the set of balls used to play this game","zh":"（一套）掷球游戏用的球具"},"examples":[{"en":"He brought his bocce set to the picnic.","zh":"他带了一套掷球用的球具去野餐。"}]}],"synonyms":["bocce ball","lawn bowling (similar)"],"phonetic":"/ˈbɑtʃi/","extraExplanation":["你写的 “boccie” 常见于口语或非正式拼写；标准拼写通常是 “bocce”（也有人写 “boccie ball” 指这项运动/球）。","“bocce” 在英语里常指这项运动；小目标球常叫 “pallino”（也有人说 “jack”）。在美国，很多公园或社区中心会有 “bocce court（掷球场）”。"]}
{"word":"boccies","summary":{"en":"Bocce (sometimes informally written as “boccies”) is an Italian ball game where you try to get your ball closest to a small target ball.","zh":"Bocce（口语里有人写作 boccies）是一种意大利球类游戏，目标是把球掷/滚到最接近小目标球的位置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an Italian bowling-like game in which players throw balls as close as possible to a smaller target ball (the pallino); also used to mean the balls used in the game","zh":"一种源自意大利、类似滚木球的运动：玩家把球掷/滚向一个更小的目标球（pallino），看谁更接近；也可指比赛用的球"},"examples":[{"en":"We played bocce at the park after dinner.","zh":"晚饭后我们在公园玩了地掷球（bocce）。"},{"en":"He bought a new set of bocce balls.","zh":"他买了一套新的地掷球球具。"}]}],"synonyms":["bocce ball","lawn bowling (similar)","boules (related game)"],"phonetic":"/ˈbɑtʃi/","extraExplanation":["你写的 “boccies” 常见于口语里当作 “bocce（地掷球）” 的非正式复数/昵称式说法；更标准的拼法通常是 “bocce”。在英语里你也会看到 “bocci”，但日常最常用的是 “bocce”。","“bocce” 在美国常与社区公园、海边或意大利裔社区文化联系在一起；很多地方有 “bocce court（地掷球场）”。"]}
{"word":"Boccioni","summary":{"en":"Boccioni usually refers to Umberto Boccioni, a major Italian Futurist painter and sculptor.","zh":"Boccioni通常指翁贝托·博乔尼——意大利未来主义的重要画家与雕塑家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Umberto Boccioni (1882–1916), an Italian painter and sculptor who was a leading figure of the Futurist movement, known for dynamic, modern images of speed, cities, and machines.","zh":"翁贝托·博乔尼（1882–1916），意大利画家与雕塑家，未来主义（Futurism）运动的重要代表人物，以表现速度、城市与机器的动态感而著名。"},"examples":[{"en":"Boccioni’s sculpture “Unique Forms of Continuity in Space” captures the feeling of motion in a walking figure.","zh":"博乔尼的雕塑《空间中连续性的独特形式》用行走的人形表现出强烈的运动感。"},{"en":"In art history class, we studied Boccioni as a key Futurist artist of early 20th-century Italy.","zh":"在艺术史课上，我们学习了博乔尼，他是20世纪初意大利未来主义的关键艺术家。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname; someone with the family name Boccioni.","zh":"姓氏；姓“博乔尼”的人。"},"examples":[{"en":"The museum guide mentioned a letter written by Boccioni during his Futurist years.","zh":"博物馆讲解员提到一封博乔尼在未来主义时期写的信。"}]}],"synonyms":["Umberto Boccioni"],"phonetic":"/boʊˈtʃoʊni/","extraExplanation":["“未来主义”兴起于20世纪初的意大利，强调速度、科技、工业与城市生活的力量感；博乔尼既写理论也做实践，是这一风格的重要推动者。","博乔尼的代表作之一《空间中连续性的独特形式》（1913）常被视为现代雕塑经典，甚至出现在意大利20欧分硬币的背面。"]}
{"word":"boccis","summary":{"en":"“Boccis” is usually a misspelling of “bocce,” an Italian ball game where you roll balls to get closest to a small target ball.","zh":"“boccis”通常是“bocce”的误写；bocce 是一种意大利地滚球游戏，把球滚向小目标球，比谁更接近。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely a misspelling of “bocce”) an Italian bowling game played by rolling balls as close as possible to a smaller target ball (the pallino).","zh":"（多半是“bocce”的拼写误写）一种意大利式滚球/地滚球游戏：把球滚向一个较小的目标球（pallino），看谁更接近。"},"examples":[{"en":"We played bocce in the park after dinner.","zh":"晚饭后我们在公园玩了地滚球（bocce）。"},{"en":"The goal is to roll your ball closest to the pallino.","zh":"目标是把你的球滚到离目标球（pallino）最近。"},{"en":"Many Italian-American communities have bocce courts.","zh":"很多意大利裔美国社区都有地滚球球场。"}]}],"synonyms":["lawn bowling","boules","pétanque"],"phonetic":"/ˈbɑtʃi/","extraExplanation":["“Bocce”来自意大利语，读音常接近“BAH-chee”。在美国它常被当作休闲运动，在公园、酒庄或社区球场玩。","你输入的“boccis”不是常见标准拼写；如果你想表达复数，英语里更常写作“bocce”（形式不变）或在口语里说“bocce balls”（地滚球球）。"]}
{"word":"Bocconia","summary":{"en":"Bocconia is a botanical name for a genus of tall, plume-flowered plants in the poppy family, and it can also mean a plant from that genus (often B. frutescens).","zh":"Bocconia 指罂粟科的博孔尼亚属植物，也可指该属的某一种植物（常见为 B. frutescens）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical American flowering plants in the poppy family (Papaveraceae), known for tall stems and large, plume-like flower clusters; some species are grown as ornamentals.","zh":"博孔尼亚属：罂粟科的一属热带美洲开花植物，常见特征是植株高大、花序呈羽毛状；部分物种可作观赏栽培。"},"examples":[{"en":"Bocconia is often called “plume poppy” in gardening books.","zh":"在园艺书里，Bocconia 常被称为“羽毛罂粟”（plume poppy）。"},{"en":"The garden planted Bocconia for its dramatic height and airy flower plumes.","zh":"这个花园种植博孔尼亚属植物，是为了它夸张的高度和轻盈的羽毛状花序。"}]},{"partOfSpeech":"n.","definition":{"en":"a plant belonging to this genus, especially Bocconia frutescens, a tall shrub with large leaves sometimes used in landscaping (and in some regions considered invasive).","zh":"博孔尼亚属植物（尤指灌木状的 Bocconia frutescens）：叶片大、株形高，常用于景观种植（在部分地区也可能成为入侵植物）。"},"examples":[{"en":"This hillside is covered with Bocconia frutescens after it escaped cultivation.","zh":"这种山坡在它从栽培地逸出后，被 Bocconia frutescens 大量覆盖。"},{"en":"Some parks avoid planting Bocconia because it can spread quickly.","zh":"一些公园会避免种博孔尼亚属植物，因为它可能扩散很快。"}]}],"synonyms":["plume poppy","tree celandine (for some species)"],"phonetic":"/bəˈkoʊniə/","extraExplanation":["“Bocconia”是拉丁化的植物学名称，常被认为用来纪念意大利博物学家 Paolo Boccone（17世纪）。","在园艺语境中，你也可能看到它被称为“plume poppy / tree celandine（树白屈菜）”。不同地区对俗名的使用不完全一致，正式写作中用学名更清楚。"]}
{"word":"bocconia","summary":{"en":"Bocconia is a genus of tropical American plants in the poppy family, sometimes called tree poppies.","zh":"Bocconia 指罂粟科的一类热带美洲植物属，常被称为“树罂粟”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical American flowering plants in the poppy family (Papaveraceae), often called tree poppies; some species are grown as ornamentals and can become invasive in warm climates.","zh":"博科尼亚属（罂粟科）的热带美洲开花植物属，常被称为“树罂粟”；其中一些物种可作观赏植物，在温暖地区可能具有入侵性。"},"examples":[{"en":"Bocconia frutescens is sometimes planted for its large, tropical-looking leaves.","zh":"有时人们会种植木本博科尼亚（Bocconia frutescens），因为它的叶子很大、很有热带风格。"},{"en":"In some islands, Bocconia can spread quickly and outcompete native plants.","zh":"在一些岛屿上，博科尼亚可能扩散很快，并与本地植物竞争。"}]}],"synonyms":["tree poppy (common name for some species)"],"phonetic":"/boʊˈkoʊniə/","extraExplanation":["“Bocconia”是拉丁化的植物学属名，通常首字母大写；日常英语里更多人会直接说具体物种名（如Bocconia frutescens）或用俗名“tree poppy（树罂粟）”。","如果你在生态或园艺语境中看到这个词，常与“invasive（入侵的）/ ornamental（观赏的）/ tropical（热带的）”等词一起出现。"]}
{"word":"boce","summary":{"en":"Bocce is a bowling-like game where you roll balls to get closest to a small target ball.","zh":"Bocce（地滚球）是一种类似保龄球的游戏：把球滚向小目标球，看谁更接近。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a game (and sport) like lawn bowling, played by rolling large balls as close as possible to a smaller target ball (the pallino).","zh":"一种类似草地保龄球的游戏/运动：把大球滚向小目标球（pallino/目标球），看谁滚得更靠近。"},"examples":[{"en":"We played bocce at the park after dinner.","zh":"晚饭后我们在公园玩了地滚球（bocce）。"},{"en":"Her team practiced bocce every weekend.","zh":"她的队伍每个周末都练习地滚球。"},{"en":"Try to roll your ball closer to the pallino.","zh":"试着把你的球滚得更靠近目标球（pallino）。"}]}],"synonyms":["lawn bowling","bowls"],"phonetic":"/ˈbɑtʃi/","extraExplanation":["“boce”常见是把 **bocce** 拼错了。标准拼法是 **bocce**（源自意大利语），在美国也很常见，尤其在公园、社区俱乐部或意大利裔社区。","常见搭配：**bocce ball**（地滚球/球）、**bocce court**（地滚球场地）。也有人说 **bocce ball** 来指整个游戏。"]}
{"word":"bocedization","summary":{"en":"“Bocedization” is not recognized as a standard English word; it may be a misspelling (possibly related to “voicing/voicedization” in phonetics).","zh":"“bocedization”不是标准英语词；很可能是拼写错误（可能与语音学里的“voicing/voicedization 浊化”相关）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word (likely a misspelling or a very rare, specialized term). It does not appear in major English dictionaries.","zh":"不是标准英语单词（很可能是拼写错误或极少见的专业用词），在主流英语词典中通常查不到。"},"examples":[{"en":"I couldn’t find “bocedization” in a dictionary—could you check the spelling?","zh":"我在词典里找不到“bocedization”——你能确认一下拼写吗？"},{"en":"If you meant “voicing/voiced,” the idea is that a sound is made with vibrating vocal cords.","zh":"如果你想说的是“voicing/voiced（浊化/浊音）”，意思是发音时声带会振动。"}]}],"phonetic":"/ˌboʊsɪdaɪˈzeɪʃən/","extraExplanation":["你输入的“bocedization”很像把某个词拼错了。最常见的相近方向有两类：","1）语音学相关：你可能想写的是 voicing / voiced（浊化/浊音），或更少见的 voicedization（使……浊化）。例如：把 /s/ 变成 /z/ 可以被描述为“voicing”。","2）以 -ization 结尾的构词：英语里 -ization 常表示“……化/……的过程”。如果你能提供上下文句子或来源（书名、论文、截图），我可以更准确判断你想表达的词。"]}
{"word":"Boche","summary":{"en":"An extremely offensive historical slur for a German person, mainly associated with World War I.","zh":"对德国人的极具冒犯性的历史蔑称，主要与第一次世界大战相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very offensive slang word for a German person (especially used by British and French speakers during World War I and sometimes World War II)","zh":"（极具冒犯性的）对德国人的蔑称（多见于一战时期，二战也偶见）"},"examples":[{"en":"The novel shows how propaganda used words like “Boche” to dehumanize the enemy.","zh":"这部小说展示了宣传如何用“Boche”之类的词把敌人“非人化”。"},{"en":"Please don’t use that word—it’s a historical slur.","zh":"请不要用那个词——那是带历史背景的侮辱性称呼。"}]}],"synonyms":["German (neutral)","Kraut (offensive slur)"],"phonetic":"/boʊʃ/","extraExplanation":["“Boche”带有强烈侮辱性，属于历史上的族群/国籍蔑称。在现代英语中使用会被视为歧视或仇恨言论；一般只在讲历史、文学分析、引用原文或讨论战争宣传语言时出现。","该词常与一战西线语境相关（英法对德的称呼），常见于战争回忆录、旧报刊、反战文学等；如果你想中性表达，应使用“German person / a German”（德国人）。"]}
{"word":"boche","summary":{"en":"“Boche” is a historical, offensive slur for a German person (and sometimes an insulting adjective). It’s mainly seen in WWI/WWII contexts and should be avoided in modern speech.","zh":"“boche”是历史上对德国人的侮辱性蔑称（也可作侮辱性形容词）。多见于一战/二战语境，现代交流中应避免使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(offensive, historical) A derogatory word for a German person, especially used by the British and French during World War I and World War II.","zh":"（冒犯性、历史用语）对德国人的蔑称，尤指一战、二战时期英法等国使用。"},"examples":[{"en":"The novel shows how propaganda led soldiers to call Germans “boches.”","zh":"这部小说展示了宣传如何让士兵把德国人叫作“boche”（蔑称）。"},{"en":"In class, we discuss why terms like “boche” are harmful and should be avoided today.","zh":"课堂上我们讨论像“boche”这样的词为什么有伤害性，以及为什么今天应避免使用。"}]},{"partOfSpeech":"adj.","definition":{"en":"(offensive, historical) Relating to Germans, used as an insult.","zh":"（冒犯性、历史用语）指“德国人的/与德国人有关的”，作为侮辱性用法。"},"examples":[{"en":"The leaflet used hateful, anti-German language, including “boche” stereotypes.","zh":"那张传单使用了仇恨的反德语言，包括对“boche”（蔑称）的刻板印象。"}]}],"synonyms":["(neutral) German","(derogatory, historical) Hun"],"phonetic":"/boʊʃ/","extraExplanation":["这个词来自法语 *boche*（口语蔑称），可能与早期法语俚语 *alboche*（把 *Allemand*“德国人”和 *caboche*“脑袋/家伙”（粗俗口语）混合）有关。主要出现在一战、二战的宣传与战争叙事中，现代英语里通常只在历史讨论、文学作品或引用中出现。使用时要非常谨慎。"]}
{"word":"bocher","summary":{"en":"“Bocher” is usually a misspelling of “botcher” (someone who does work badly) or related to “botch” (to mess up).","zh":"“bocher”多半是“botcher”（做事做砸的人）的误拼，或与“botch”（把……搞砸）相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly spelled “botcher”) a person who does a job badly or carelessly, often making mistakes.","zh":"（常拼作“botcher”）把事情做砸的人；拙劣的干活者，常因粗心而出错。"},"examples":[{"en":"He’s a botcher—every repair he tries ends up worse than before.","zh":"他就是个把活儿做砸的人——他修什么都会越修越糟。"},{"en":"The report was rushed, and the botcher left obvious errors on every page.","zh":"这份报告赶出来的，做砸的人几乎每页都留下了明显错误。"}]},{"partOfSpeech":"v.","definition":{"en":"(Commonly spelled “botch”) to do something badly or clumsily; to mess something up.","zh":"（常拼作“botch”）把……搞砸；笨拙地做（某事）。"},"examples":[{"en":"I botched the presentation by forgetting the key numbers.","zh":"我把演示搞砸了，因为忘了关键数据。"},{"en":"Don’t rush, or you’ll botch the final step.","zh":"别急，不然最后一步会搞砸。"}]}],"synonyms":["bungler","clutz","screw-up","mess up","bungle"],"phonetic":"/ˈbɑtʃər/","extraExplanation":["“bocher”在英语里不算常见标准拼写。很多情况下，人们想写的是：\n1) botch / botcher（把事做砸／把事做砸的人）；\n2) Boucher（常见法语姓氏，在英语中也出现；与“butcher（屠夫）”在词源上有关）。\n如果你告诉我你看到它的句子或语境（比如是在小说、名字、还是工作邮件里），我可以帮你确定最可能的意思。"]}
{"word":"boches","summary":{"en":"“Boches” is the plural of “boche,” an offensive historical slur for Germans, mainly seen in World War I contexts.","zh":"“Boches”是“boche”的复数，是对德国人的历史性侮辱用语，主要见于一战相关语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Offensive, historical) a derogatory word for a German person, used mainly during World War I and sometimes World War II.","zh":"（具冒犯性、历史用语）对德国人的贬称，主要用于第一次世界大战时期，有时也见于二战时期。"},"examples":[{"en":"The term “boches” appears in some World War I propaganda posters.","zh":"在一些一战时期的宣传海报中会出现“boches”这个词。"},{"en":"In modern writing, historians may quote the word to show the prejudice of the time.","zh":"在现代写作中，历史学家可能会引用这个词来呈现当时的偏见氛围。"}]}],"synonyms":["German (neutral)","Kraut (offensive)","Hun (historical, often derogatory)"],"phonetic":"/boʊʃ/","extraExplanation":["这是一个带有强烈侮辱性的群体称呼。学习时建议把它当作“历史材料里会遇到的词”，而不要在日常交流中使用；若需要表达“德国人”，用中性词 German / Germans 更合适。","词源与使用背景：boche 来自法语口语，常被认为与 caboche（“脑袋/瓜”）有关，在一战法语与英语语境中流行，用于敌对宣传与辱骂。今天主要出现在历史研究、引用或反思偏见的语境。"]}
{"word":"Bochism","summary":{"en":"A rare, often offensive term referring to stereotyped “Boche” (anti-German) attitudes, especially militarism.","zh":"一个罕见且常具冒犯性的词，指对德国人的战时贬称“Boche”所带来的刻板化态度，尤指军国主义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, often offensive) The qualities, attitudes, or behavior stereotypically attributed to “Boches” (a derogatory wartime term for Germans), especially German militarism or nationalism as portrayed by enemies.","zh":"（罕见，且常被视为冒犯）“Boches”（一战时期对德国人的贬称）所被刻板化的特质、态度或行为，尤指被敌对方描绘的德国军国主义或民族主义。"},"examples":[{"en":"Some wartime newspapers used the word “Bochism” to accuse the enemy of militarism and cruelty.","zh":"一些战时报纸用“Bochism”来指责敌方的军国主义与残暴。"},{"en":"In modern writing, the term is usually avoided because it carries an ethnic slur.","zh":"在现代写作中，这个词通常会被避免使用，因为它带有对族群的侮辱色彩。"}]}],"synonyms":["(historical) anti-German wartime rhetoric","German militarism","wartime propaganda language"],"phonetic":"ˈboʊʃɪzəm","extraExplanation":["“Bochism”来自“Boche”（/boʊʃ/），这是法语口语在第一次世界大战前后对德国人的蔑称之一，带有强烈敌意与宣传色彩。因此“Bochism”多见于旧报刊、战争宣传或历史语境中。","使用建议：在学术或中性表达中，通常改用更准确、非贬义的词，如“German militarism（德国军国主义）”“German nationalism（德国民族主义）”“wartime propaganda rhetoric（战时宣传话语）”。"]}
{"word":"bochism","summary":{"en":"A rare, dated noun meaning “German-ness” or pro-German attitudes, usually in a negative WWI-era sense; often offensive.","zh":"一个罕见且过时的名词，指被贬义化的“德国气/亲德倾向”，多见于一战语境，常具冒犯性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dated, often offensive) German-ness or pro-German attitudes, especially as viewed negatively during World War I; conduct thought to be typical of “the Germans” (as framed by wartime propaganda).","zh":"（过时，且常带冒犯性）“德国人的作风/德国气”；尤指一战时期从敌对或宣传角度贬义地描述的亲德倾向或被认为“像德国人那样”的行为。"},"examples":[{"en":"Some wartime newspapers accused anyone calling for peace talks of “bochism.”","zh":"一些战时报纸指责任何呼吁和谈的人是“bochism（亲德/德国派）”。"},{"en":"The writer used the word to stir fear, not to describe real German culture fairly.","zh":"作者用这个词来煽动恐惧，而不是公平地描述真实的德国文化。"}]}],"synonyms":["pro-German sentiment","Germanism (context-dependent)","German nationalism","German militarism (context-dependent)"],"phonetic":"ˈboʊʃɪzəm","extraExplanation":["“bochism”来自侮辱性称呼“Boche”（一战时期英语中对德国人的贬称）+ “-ism”（表示思想、倾向或主义的后缀）。","该词带有强烈时代与战争宣传色彩，容易造成刻板印象与冒犯；现代英语中几乎不使用，写作或交流时一般建议避免，用更中性的表达（如 “pro-German sentiment / German nationalism / German militarism” 等）会更合适。"]}
{"word":"Bochum","summary":{"en":"Bochum is a city in western Germany in the Ruhr region.","zh":"Bochum（波鸿）是德国西部鲁尔地区的一座城市。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A city in western Germany, in the Ruhr industrial region (state of North Rhine–Westphalia).","zh":"德国西部的一座城市，位于鲁尔工业区（北莱茵-威斯特法伦州）。"},"examples":[{"en":"Bochum is part of the Ruhr area, known for its industrial history.","zh":"波鸿位于鲁尔地区，以工业历史闻名。"},{"en":"She studied at Ruhr University Bochum.","zh":"她在波鸿鲁尔大学学习。"},{"en":"We took a train from Dortmund to Bochum in about 15 minutes.","zh":"我们从多特蒙德坐火车到波鸿大约15分钟。"}]}],"synonyms":["Ruhr University Bochum (related)","Ruhr area / Ruhrgebiet (related)","North Rhine–Westphalia (related region)"],"phonetic":"/ˈboʊkʊm/","extraExplanation":["“Bochum”是德语地名，英语里通常按德语读音来读；其中的“ch”在德语里接近清擦音（类似轻轻的“h/kh”），但很多英语母语者会简化成/k/音。","波鸿属于德国“鲁尔区（Ruhrgebiet）”，这一地区过去以煤矿、钢铁等重工业著称，如今也有很多大学与科技、服务业。","文化上常见的相关词：VfL Bochum（当地足球俱乐部）、Ruhr University Bochum（波鸿鲁尔大学，常写作RUB）。"]}
{"word":"bochur","summary":{"en":"Bochur means a yeshiva student, and more broadly a young unmarried man in Jewish cultural contexts.","zh":"Bochur 指经学院（yeshiva）的学生，也可泛指犹太文化语境中的年轻未婚男子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Orthodox Jewish communities) a yeshiva student; a young man studying traditional Jewish texts.","zh":"（在正统犹太社群中）犹太经学院（yeshiva）的学生；学习传统犹太经典的年轻男子。"},"examples":[{"en":"The rabbi spoke with the bochur after evening prayers.","zh":"拉比在晚祷后和那位经学院学生谈了谈。"},{"en":"As a bochur, he spent long hours studying the Talmud.","zh":"作为一名经学院学生，他花了很长时间研读《塔木德》。"}]},{"partOfSpeech":"n.","definition":{"en":"(also more generally) a young unmarried man; a bachelor (often with a Jewish cultural tone).","zh":"（也可更泛指）年轻未婚男子；单身汉（常带有犹太文化语感）。"},"examples":[{"en":"He was still a bochur when he moved to the city for work.","zh":"他到城里工作时还是个未婚小伙子。"},{"en":"At the celebration, the bochurim danced in a circle.","zh":"在庆祝活动上，年轻小伙子们围成一圈跳舞。"}]}],"synonyms":["yeshiva student","young man","bachelor"],"phonetic":"/ˈbɔxər/","extraExplanation":["“bochur”（也常见拼写：bocher, bokher；复数常写作 *bochurim*）来自希伯来语/意第绪语的用法。在英语里多出现在与犹太宗教生活、经学院文化相关的语境中，因此带有明显的文化背景色彩。","发音中的“ch”常接近喉音（像德语 *Bach* 里的 *ch*），英语书写用“ch”是为了尽量呈现这一音。"]}
{"word":"bocian","summary":{"en":"Bocian is a Polish word meaning “stork,” and it can also be a Polish surname.","zh":"Bocian 是波兰语，意为“鹳（常指白鹳）”，也可作波兰姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Polish) “stork,” especially the white stork.","zh":"（波兰语）“鹳/鹳鸟”，常指白鹳。"},"examples":[{"en":"In Polish, bocian means “stork.”","zh":"在波兰语里，bocian 的意思是“鹳（鹳鸟）”。"},{"en":"We saw a bocian nesting on a chimney in a village in Poland.","zh":"我们在波兰的一个村庄里看到一只白鹳（bocian）在烟囱上筑巢。"}]},{"partOfSpeech":"n.","definition":{"en":"A Polish surname (family name).","zh":"波兰姓氏（家族名）。"},"examples":[{"en":"Bocian is also used as a last name in Poland.","zh":"Bocian 在波兰也用作姓氏。"}]}],"synonyms":["stork","white stork"],"phonetic":"ˈbɔtʃɑn","extraExplanation":["在波兰文化里，“bocian（白鹳）”很有代表性：常被视为春天到来、好运与家庭的象征，很多乡村会看到白鹳在屋顶或烟囱上筑巢。","英语里一般直接说 stork；bocian 多出现在与波兰相关的语境（旅行、文化介绍、地名/姓氏）中。"]}
{"word":"Bock","summary":{"en":"“Bock” most commonly means a strong German lager beer; it can also mean a male goat (mainly in German usage).","zh":"“Bock”最常指一种德国烈性拉格啤酒；在（尤指）德语语境中也可指公山羊。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong German lager (often dark and malty), traditionally brewed for spring; also used for similar strong lagers made elsewhere","zh":"（啤酒）博克（德国）烈性拉格啤酒（常偏深色、麦芽味重），传统上常为春季酿造；也可泛指其他地区仿制的同类烈性拉格"},"examples":[{"en":"He ordered a bock because he wanted something malty and strong.","zh":"他点了一杯博克啤酒，因为他想喝麦芽味重、度数高一点的。"},{"en":"This brewery releases its bock every March.","zh":"这家酒厂每年三月都会推出他们的博克啤酒。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in German) a male goat; a billy goat","zh":"（尤指德语语境）公山羊；雄山羊"},"examples":[{"en":"In the old story, a bock guarded the mountain path.","zh":"在那个古老的故事里，一只公山羊守着山路。"},{"en":"The farmer kept a bock separate from the young goats.","zh":"农夫把公山羊和小羊分开饲养。"}]}],"synonyms":["strong lager","German lager","doppelbock (type)","billy goat"],"phonetic":"/bɑk/","extraExplanation":["“Bock（博克啤酒）”这个名称来自德语，原本与北德城市 Einbeck（因贝克）的啤酒有关；后来在巴伐利亚地区被念作类似“Ein Bock”（一只公山羊/一杯博克），于是出现了“山羊”与“bock 啤酒”之间的文化联想，许多酒标会画山羊。","常见相关词：doppelbock（双倍博克，通常更烈、更甜更厚重）、maibock 或 helles bock（五月博克/浅色博克，颜色更浅、更偏啤酒花香）。"]}
{"word":"bock","summary":{"en":"Bock most commonly means a strong German-style dark beer; it can also mean a male goat.","zh":"Bock最常见指德国风格的高酒精度深色啤酒；也可指公山羊。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong, dark beer (often a lager) that is traditionally brewed in Germany and commonly enjoyed in spring; some types are even stronger (e.g., doppelbock).","zh":"博克啤酒；一种起源于德国、酒精度较高、颜色较深的啤酒（常为拉格），常在春季饮用；其中有更烈的品类（如“双博克”）。"},"examples":[{"en":"He ordered a bock because he wanted something richer than a regular lager.","zh":"他点了一杯博克啤酒，因为他想喝比普通拉格更浓郁的口感。"},{"en":"Many breweries release a bock in the spring season.","zh":"很多啤酒厂会在春季推出博克啤酒。"}]},{"partOfSpeech":"n.","definition":{"en":"a male goat.","zh":"公山羊。"},"examples":[{"en":"The farmer kept a bock separate from the young goats.","zh":"农夫把公山羊和小山羊分开养。"}]}],"synonyms":["(beer) strong lager","(goat) billy goat"],"phonetic":"/bɑk/","extraExplanation":["“Bock”作为啤酒名通常与德国传统有关：常见解释是源于德国城市Einbeck（音近），后来在巴伐利亚方言中演变为“Bock”，而德语里“Bock”也有“公山羊”的意思，所以很多博克啤酒的酒标会画山羊。","常见相关词：Maibock（五月博克，颜色较浅更偏春季）、Doppelbock（双博克，更高酒精度、更浓郁）、Eisbock（冰博克，通过冷冻浓缩更烈）。"]}
{"word":"bockerel","summary":{"en":"A bockerel is a young male chicken (a young rooster).","zh":"bockerel 指“小公鸡/未成年的公鸡”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a young male chicken; a young rooster","zh":"小公鸡；未成年的公鸡"},"examples":[{"en":"We heard a bockerel crowing behind the barn.","zh":"我们听见谷仓后面有只小公鸡在打鸣。"},{"en":"The farmer kept a bockerel with the hens until it grew bigger.","zh":"农夫把一只小公鸡和母鸡养在一起，直到它长大。"}]}],"synonyms":["cockerel","young rooster","young cock"],"phonetic":"/ˈbɑkərəl/","extraExplanation":["“bockerel”在英式英语里更常见，带有乡村、农场语境色彩；在美式英语中人们更常说“young rooster”或“cockerel”。","词源上与“cock”（公鸡）同源；“-erel”是一个表示“小/年轻”的后缀，因此整体含义偏向“幼小的公鸡”。"]}
{"word":"bockeret","summary":{"en":"Bachelorette means an unmarried woman, and it often refers to a bride-to-be in “bachelorette party.”","zh":"Bachelorette 指未婚女性，也常在 bachelorette party 中指准新娘（告别单身派对）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a young unmarried woman; also commonly used for a woman who is going to get married soon (especially in the phrase “bachelorette party”).","zh":"未婚年轻女性；也常指即将结婚的新娘（尤其用在“bachelorette party 单身派对/告别单身派对”中）。"},"examples":[{"en":"She was a bachelorette living in New York.","zh":"她是个住在纽约的未婚女子。"},{"en":"They planned a bachelorette party for the bride-to-be.","zh":"她们为准新娘策划了一个告别单身派对。"}]}],"synonyms":["single woman","unmarried woman"],"phonetic":"/ˌbætʃələˈrɛt/","extraExplanation":["你输入的“bockeret”很可能是拼写错误；常见正确拼写是 **bachelorette**。","词源上它来自 **bachelor（单身汉）** 的对应形式。现代口语里，“bachelorette”最常见的场景是婚礼相关：**bachelorette party**（女性的告别单身派对），对应男性常说 **bachelor party**。","文化提示：不同地区对派对活动的接受度和形式差异很大；在正式场合谈论时，用更中性的说法如 “pre-wedding celebration（婚前庆祝）” 也可以。"]}
{"word":"bockey","summary":{"en":"“bockey” is not standard English; it’s likely a misspelling or a name. Provide context to identify the intended word.","zh":"“bockey”不是标准英语词，更可能是拼写错误或名字；给出上下文可帮助确定你真正想表达的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a name (e.g., a username/surname). If you meant a common word, likely possibilities include “bocce” (a ball game), “hockey,” “bock” (a type of beer), or “bok choy” (a vegetable).","zh":"不是标准英语单词。更可能是拼写错误或人名/网名（例如姓氏或用户名）。如果你想表达常见词，可能是：bocce（地滚球/草地滚球游戏）、hockey（冰球）、bock（博克啤酒/一种啤酒），或 bok choy（小白菜/青江菜）。"},"examples":[{"en":"I couldn’t find “bockey” in a dictionary—did you mean “hockey”?","zh":"我在词典里找不到“bockey”——你是不是想写“hockey（冰球）”？ "},{"en":"Can you share a sentence with “bockey” so I can tell what word you meant?","zh":"你能给一个包含“bockey”的句子吗？这样我就能判断你想表达的词。"}]}],"phonetic":"/ˈbɑki/","extraExplanation":["“bockey”本身没有固定、通用的拼写与含义，所以最好的办法是看上下文来判断你想写的词。常见混淆来源：\n- 看起来像 hockey（冰球），只差一个字母；\n- 可能想写 bocce（意大利起源的滚球运动），发音与拼写都容易被误记；\n- 也可能是 bok choy（蔬菜名），常被误写成各种类似拼法。\n把你看到它的地方（句子/截图/领域）发我，我可以帮你精准对应。"]}
{"word":"bocking","summary":{"en":"“Bocking” is most commonly a place name in Essex, England; less commonly, it can mean “refusing/resisting” as the -ing form of the rare verb “bock.”","zh":"“Bocking”最常见是英国埃塞克斯郡的地名；较少见时可作为罕见动词“bock”的 -ing 形式，表示“拒绝/抵触”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name: a town/area in Essex, England (now closely connected with Braintree).","zh":"地名：英国英格兰埃塞克斯郡的一个城镇/地区（现与布伦特里紧密相连）。"},"examples":[{"en":"She grew up near Bocking in Essex.","zh":"她在埃塞克斯郡的博金（Bocking）附近长大。"},{"en":"The guidebook lists Bocking as part of the Braintree area.","zh":"旅游指南把博金（Bocking）列为布伦特里地区的一部分。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “bock”: refusing to do something; resisting or backing away (rare).","zh":"“bock”的现在分词：拒绝去做某事；抵触、退缩（较少见）。"},"examples":[{"en":"He kept bocking at the idea of apologizing.","zh":"他一直抗拒去道歉这个想法。"},{"en":"Don’t start bocking now—we’re almost done.","zh":"别现在退缩——我们快完成了。"}]}],"synonyms":["(place name)","resisting","refusing","backing away"],"phonetic":"/ˈbɑkɪŋ/","extraExplanation":["“Bocking”最常见是地名（专有名词）。如果你本来想查的是“blocking”（阻挡/封锁/妨碍），拼写会更常用，也更容易在日常英语中遇到。","在园艺语境里，你有时会看到“Bocking 14/4”等说法，指以该地命名的一些康复力（comfrey，聚合草）栽培品种名称。"]}
{"word":"bocklogged","summary":{"en":"Backlogged means delayed because too much work has piled up.","zh":"Backlogged 指因事情堆积过多而造成的延误与积压。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of work, orders, messages, etc.) delayed because there is too much to deal with; having a backlog.","zh":"（工作、订单、消息等）因积压太多而延误的；被积压的。"},"examples":[{"en":"Customer support is backlogged, so responses may take longer than usual.","zh":"客服工作积压了，所以回复可能比平时更慢。"},{"en":"The lab is backlogged with tests after the holiday.","zh":"假期过后，实验室的检测任务积压了。"},{"en":"We’re backlogged on invoices and need extra help this week.","zh":"我们的发票处理积压了，这周需要额外人手。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “backlog”: to delay and store work or orders to be done later.","zh":"“backlog”的过去式/过去分词：把工作或订单延后处理，使之积压。"},"examples":[{"en":"Requests were backlogged during the system outage.","zh":"系统故障期间，请求被延后处理并积压了。"},{"en":"Several shipments got backlogged at the port.","zh":"有几批货在港口被积压了。"}]}],"synonyms":["delayed","overdue","behind","piled up","bottlenecked"],"phonetic":"/ˈbækˌlɔɡd/","extraExplanation":["你输入的“bocklogged”通常是拼写错误，正确拼写多为 **backlogged**。","常见搭配：be backlogged with + 名词（任务/订单/邮件等）；a backlogged schedule（被拖延的日程）。在职场、客服、物流、医疗检测等语境里很常用。","相关名词 **backlog** 表示“积压量/待办清单”，如：clear the backlog（清积压）、build up a backlog（形成积压）。"]}
{"word":"bocks","summary":{"en":"“Bocks” is the plural of “bock,” meaning either male goats or a strong German-style lager (bock beer).","zh":"“bocks”是“bock”的复数，可指“公山羊们”，也可指“博克啤酒（的一些杯/种类）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male goat; a buck (especially in German or farming contexts)","zh":"公山羊；雄羊（常见于德语或畜牧语境）"},"examples":[{"en":"The farmer keeps a bock separate from the young goats.","zh":"农场主把公山羊和小山羊分开饲养。"},{"en":"That bock has long horns and a thick beard.","zh":"那只公山羊角很长，胡子也很浓。"}]},{"partOfSpeech":"n.","definition":{"en":"a strong, dark lager beer (often called bock beer), traditionally brewed in Germany","zh":"博克啤酒；一种传统德式浓烈深色拉格啤酒"},"examples":[{"en":"He ordered a bock with dinner because he likes richer beers.","zh":"他晚餐点了一杯博克啤酒，因为他喜欢更醇厚的啤酒。"},{"en":"Many breweries release bock in late winter or spring.","zh":"很多酒厂会在冬末或春季推出博克啤酒。"}]}],"synonyms":["bucks","male goats","bock beer","dark lager"],"phonetic":"/bɑk/","extraExplanation":["“Bock”作“博克啤酒”时来自德语，传统上酒体更厚、麦芽味更明显，酒精度也常比普通拉格更高。你看到的“bocks”多半是复数：two bocks（两杯/两种博克啤酒）或 two bocks（两只公山羊）。"]}
{"word":"Bockstein","summary":{"en":"“Bockstein” usually means the Bockstein homomorphism/operator in algebraic topology: a connecting map induced by a short exact sequence of coefficients, often used in mod‑p (co)homology.","zh":"“Bockstein”通常指代数拓扑中的 Bockstein 同态/算子：由系数短正合列诱导出的连接映射，常用于模 p 的（上）同调研究。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(mathematics) A construction in algebraic topology/homological algebra—most commonly the **Bockstein homomorphism (or Bockstein operator)**—a connecting map that relates cohomology (or homology) groups that come from a short exact sequence of coefficient groups (often involving mod‑p coefficients).","zh":"（数学）代数拓扑/同调代数中的一种构造——最常见的是**Bockstein 同态（或 Bockstein 算子）**：由系数群的短正合列（常见为模 p 系数相关）诱导出的“连接映射”，用来联系不同系数下的（上）同调群。"},"examples":[{"en":"The Bockstein homomorphism comes from the short exact sequence 0 → Z → Z → Z/pZ → 0.","zh":"Bockstein 同态来自短正合列 0 → Z → Z → Z/pZ → 0。"},{"en":"In computations mod p, the Bockstein often detects information that ordinary mod‑p cohomology misses.","zh":"在模 p 的计算中，Bockstein 往往能检测到普通模 p 上同调看不到的信息。"},{"en":"Some texts refer to this map simply as “the Bockstein.”","zh":"有些教材会直接把这个映射简称为“the Bockstein（Bockstein 算子）”。"}]}],"synonyms":["Bockstein homomorphism","Bockstein operator","Bockstein map"],"phonetic":"/ˈbɑkstaɪn/","extraExplanation":["“Bockstein”来自数学家 **Meyer Bockstein** 的姓氏，因此在英文里通常作为专有名词使用；在论文与教材中更常见的完整说法是 **Bockstein homomorphism / Bockstein operator**。","学习时可以把它理解为：当你有一条“系数的短正合列”时，同调/上同调会产生一条“长正合列”，其中出现的那个关键“连接箭头”就是 Bockstein（在特定常见情形下）。"]}
{"word":"Bocock","summary":{"en":"“Bocock” is most commonly used as an English surname (a proper name).","zh":"“Bocock”最常见的用法是英语姓氏（专有名词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname); a proper noun rather than a common English vocabulary word","zh":"姓氏（家族名）；属于专有名词，不是常见英语词汇"},"examples":[{"en":"Ms. Bocock will join the meeting at 3 p.m.","zh":"Bocock 女士将于下午三点参加会议。"},{"en":"I saw the name “Bocock” on the authors list.","zh":"我在作者名单上看到了“Bocock”这个名字。"}]}],"phonetic":"/ˈboʊkɑk/","extraExplanation":["“Bocock”在英语里通常被当作姓氏使用，而不是像普通名词/动词那样有固定词义。发音会因家庭或地区而略有差异。","如果你是在某篇文章、地址、公司名或历史人物中看到它，告诉我完整句子或上下文，我可以帮你判断具体指的是人名、地名还是机构名，以及更合适的读法。"]}
{"word":"bocoy","summary":{"en":"“Bocoy” is regional slang (not standard English) meaning a boy/young kid, and it can also be used as a nickname.","zh":"“Bocoy”是带地域色彩的俚语（非标准英语），常指男孩/小孩，也可作昵称使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Slang, Southeast Asia; not standard English) A boy or young kid; sometimes used as a casual nickname meaning “little guy/youngster.”","zh":"（东南亚俚语；非标准英语）男孩、小孩；有时作随意的昵称，类似“小家伙/小朋友”。"},"examples":[{"en":"Hey, bocoy, come over here for a second.","zh":"喂，小家伙，过来一下。"},{"en":"That bocoy is always running around the neighborhood.","zh":"那个小男孩总是在社区里跑来跑去。"}]},{"partOfSpeech":"n.","definition":{"en":"(Nickname/handle) A personal nickname or online name, often for someone younger.","zh":"（昵称/网名）用作个人昵称或网络ID，常指较年轻的人。"},"examples":[{"en":"His friends call him Bocoy at school.","zh":"在学校朋友们叫他“Bocoy”。"},{"en":"I saw a user named Bocoy in the game lobby.","zh":"我在游戏大厅看到一个叫 Bocoy 的用户。"}]}],"synonyms":["boy","kid","youngster","little guy"],"phonetic":"/boʊˈkɔɪ/","extraExplanation":["“Bocoy”并不是通用的英语单词，更常见于菲律宾、印尼等地的口语或网络语境；在英文对话中出现时，通常带有地域色彩或是人名/昵称。","如果你是在特定句子里看到它（例如聊天记录、歌词、游戏ID），把原句发来，我可以帮你更准确判断它在当时语境中的意思。"]}
{"word":"bocstaff","summary":{"en":"“BOC staff” means the employees of an organization called “BOC” (often Bank of China).","zh":"“BOC staff”指“BOC”这一机构的员工（常指中国银行）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"employees or workers of an organization abbreviated as “BOC” (most commonly Bank of China in business/news contexts).","zh":"“BOC”这一缩写所指机构的员工/工作人员（在商业或新闻语境中最常见指中国银行 Bank of China）。"},"examples":[{"en":"BOC staff helped customers set up online banking at the branch.","zh":"中国银行的员工在网点帮助客户开通网上银行。"},{"en":"The notice is for BOC staff only; visitors should contact the front desk.","zh":"该通知仅面向BOC员工；访客请联系前台。"}]}],"synonyms":["BOC employees","BOC workers","Bank of China staff (if BOC = Bank of China)"],"phonetic":"/biː oʊ si stæf/","extraExplanation":["“BOC”是缩写，不同国家/行业可能指不同机构（例如 Bank of China 中国银行；也可能在某些组织里指 Board of…/Bureau of… 等）。因此“BOC staff”在正式写作中最好首次出现时写全称：例如 “Bank of China (BOC) staff”。","你输入的“bocstaff”像是把两个词连在一起的写法。更常见、更标准的写法是分开写：BOC staff；如果是公司内部系统用户名/标签，也可能会连写，但在一般英文里不常用。"]}

