{"word":"BOD","summary":{"en":"BOD is an abbreviation for biochemical oxygen demand, a key water-quality measure for organic pollution.","zh":"BOD 是 biochemical oxygen demand（生化需氧量）的缩写，是衡量水体有机污染的重要水质指标。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbr.) biochemical oxygen demand: a measure of how much oxygen microorganisms need to break down organic material in water; used to judge water pollution.","zh":"（缩写）生化需氧量：衡量水中微生物分解有机物所需要的氧气量；用于判断水体污染程度。"},"examples":[{"en":"The river’s BOD is high, which suggests serious organic pollution.","zh":"这条河的 BOD 很高，说明有机污染比较严重。"},{"en":"The lab tests BOD to check whether the wastewater treatment is working.","zh":"实验室检测 BOD 来判断污水处理是否有效。"}]}],"synonyms":["biochemical oxygen demand","biological oxygen demand"],"phonetic":"/ˌbiː oʊ ˈdiː/","extraExplanation":["BOD 常见于环境科学/污水处理领域，常写作 B.O.D.，口语里多按字母读。数值越高，表示水中可被微生物分解的有机物越多，溶解氧更容易被消耗，从而影响鱼类等水生生物。","相关指标还有 COD（化学需氧量）与 DO（溶解氧）。BOD 更偏向反映“可生物降解”的有机污染。"]}
{"word":"bod","summary":{"en":"“Bod” is an informal word meaning a person’s body (figure) or, more casually, a person.","zh":"“bod”是非正式用法，指“身体/身材”，也可随口指“某个人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A person’s body; sometimes used to mean someone’s physical shape or figure.","zh":"（非正式）人的身体；有时指身材、体型。"},"examples":[{"en":"After sitting all day, my bod feels stiff.","zh":"坐了一整天后，我的身体感觉很僵。"},{"en":"He’s been working out to get a healthier bod.","zh":"他一直在锻炼，想要更健康的身材。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) A person (someone), viewed casually or as “a body.”","zh":"（非正式）某个人（随口说法，把人当作“一个人/一具身体”来指）。"},"examples":[{"en":"There were a few bods waiting outside the shop.","zh":"店外有几个人在等着。"},{"en":"Ask one of the bods over there for directions.","zh":"去问那边的某个人怎么走。"}]}],"synonyms":["body","figure","physique","person","someone"],"phonetic":"/bɑd/","extraExplanation":["“bod”是“body”的口语缩写，在英式口语里更常见；美式英语也能听到，但通常更直接说“body”或“figure”。","在媒体与流行文化里，“hot bod / great bod”常用来夸某人身材好，但可能带有物化（把人当外表来评价）的语气；使用时注意场合与礼貌。"]}
{"word":"bodach","summary":{"en":"Bodach is a Scottish Gaelic/Scots word meaning an old man (often a rustic) and, in folklore, a bogeyman-like figure.","zh":"Bodach是苏格兰盖尔语／苏格兰英语词，指老男人（常带乡下人意味）；在民俗中也可指类似“鬼怪／床下怪”的吓人形象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scottish Gaelic / Scots) an old man; often a simple countryman or peasant.","zh":"（苏格兰盖尔语／苏格兰英语）老男人；常指朴素的乡下人、农夫。"},"examples":[{"en":"In some Highland stories, a bodach lives alone in a small cottage.","zh":"在一些高地故事里，一个bodach独自住在一间小屋里。"},{"en":"The village bodach was respected for his hard work and plain wisdom.","zh":"村里的bodach因勤劳和朴实的智慧而受人尊敬。"}]},{"partOfSpeech":"n.","definition":{"en":"(folklore) a frightening male figure, like a bogeyman, used to scare children into behaving.","zh":"（民俗）吓人的男性形象，类似“床下怪／鬼怪（bogeyman）”，常用来吓唬孩子听话。"},"examples":[{"en":"“Go to bed, or the bodach will come,” the old tale warns.","zh":"老故事警告说：“快睡觉，不然bodach会来。”"},{"en":"Some families used the bodach as a bedtime scare story.","zh":"有些家庭把bodach当作睡前吓唬孩子的故事。"}]}],"synonyms":["old man","old fellow","peasant (context-dependent)","bogeyman (folklore sense)"],"phonetic":"/ˈboʊdɑk/","extraExplanation":["“Bodach”来自苏格兰盖尔语，字面常与“老男人／老汉”相关。在苏格兰民间叙事中，它有时会变成带有恐吓色彩的角色（类似英语的 bogeyman）。","在相关传说里你可能会见到更完整的说法，如“The Bodach”（某个特定的“老汉／怪人”形象），语气通常偏民俗、故事或方言。"]}
{"word":"bodacious","summary":{"en":"Bodacious is an informal word meaning “awesome/impressive,” and sometimes “very big or extreme,” often with a playful, bold tone.","zh":"Bodacious 是非正式用语，常指“超棒/很酷/很吸睛”，也可指“特别大或特别夸张”，语气通常带点俏皮和张扬。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Excellent, impressive, or very attractive; boldly confident in a fun, showy way.","zh":"（非正式）非常棒的、令人印象深刻的；（也可指）很有魅力/很吸引人的，带点大胆张扬的自信。"},"examples":[{"en":"That was a bodacious performance—everyone stood up and cheered.","zh":"那场表演太精彩了——大家都站起来欢呼。"},{"en":"She wore a bodacious outfit for the party and owned the room.","zh":"她穿了一身很吸睛的派对穿搭，气场全开。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal, often humorous) Very big or extreme; “huge” in a playful way.","zh":"（非正式，常带幽默）特别大、特别夸张的；用俏皮的方式说“巨大”。"},"examples":[{"en":"They served bodacious slices of pizza—one was enough for me.","zh":"他们的披萨切片大得夸张——我一片就饱了。"},{"en":"We took a bodacious road trip across three states.","zh":"我们来了一次超豪迈的公路旅行，横跨了三个州。"}]}],"synonyms":["awesome","impressive","bold","show-stopping","huge","massive"],"phonetic":"/boʊˈdeɪʃəs/","extraExplanation":["“bodacious”在美式口语里很有80–90年代流行文化的味道，常见于冲浪/滑板、青春电影等语境，语气比较夸张、带点玩笑或“酷”的感觉。","词源上常被认为与“bold”（大胆的）有关；在现代口语中多表示“很棒/很酷”，有时也被用来形容身材或外表很性感，但在正式场合可能显得不够得体。"]}
{"word":"bodaciously","summary":{"en":"“Bodaciously” means “boldly/confidently” or (informally) “in a striking, attractive way.”","zh":"“bodaciously”表示“大胆自信地”，也可（非正式）表示“惊艳吸睛地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a bold, impressive, or daring way; with confident energy.","zh":"以大胆、令人印象深刻或勇敢的方式；充满自信与气势地。"},"examples":[{"en":"She bodaciously challenged the unfair rule in front of everyone.","zh":"她当众大胆地挑战了那条不公平的规定。"},{"en":"The guitarist bodaciously stepped forward for a solo.","zh":"吉他手自信十足地走上前来独奏。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Informal) In a very attractive or “wow” way; strikingly.","zh":"（非正式）非常迷人或“惊艳”地；格外吸引人地。"},"examples":[{"en":"The sunset looked bodaciously beautiful over the ocean.","zh":"海面上的落日美得惊艳。"},{"en":"He dressed bodaciously for the party, and everyone noticed.","zh":"他为派对打扮得很吸睛，大家都注意到了。"}]}],"synonyms":["boldly","confidently","daringly","strikingly","audaciously"],"phonetic":"/boʊˈdeɪʃəsli/","extraExplanation":["“bodaciously”来自形容词“bodacious”，在美国口语里常带一点夸张、幽默的语气。它在20世纪后期尤其流行，和冲浪/滑板等青年文化的“酷”“很猛”表达有关。","注意语域：它偏口语、非正式；写正式文章时更常用“boldly / confidently / strikingly”等。"]}
{"word":"bodan","summary":{"en":"“Bodan” is usually a proper name, not a common English vocabulary word.","zh":"“Bodan”通常是专有名词（人名/地名），不是常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (usually a surname or place name). It is not a common everyday English word, so its meaning depends on the person/place it refers to.","zh":"专有名词（通常是姓氏或地名）。它不是常见英语词汇，因此含义取决于指代的具体人物或地点。"},"examples":[{"en":"Dr. Bodan will give a talk at the university tomorrow.","zh":"Bodan 博士明天会在大学做报告。"},{"en":"I found the name “Bodan” on a map, but I’m not sure what it refers to.","zh":"我在地图上看到了“Bodan”这个名字，但不确定它指的是什么。"}]}],"phonetic":"/ˈboʊdæn/","extraExplanation":["“bodan”在英语里通常不作为普通词汇使用，更常见的是人名/姓氏或地名的拼写。如果你是在文章、游戏、歌词或社交媒体里看到的，给我一句原句/上下文，我可以帮你判断具体含义。","你也可能想查的是拼写相近的词，比如：Boden（姓氏/地名）、bodega（小杂货店，常见于美式英语）、bowed down（屈服/弯腰）等。"]}
{"word":"Bodanzky","summary":{"en":"Bodanzky is mainly a surname; in cultural contexts it often refers to Brazilian filmmaker Jorge Bodanzky.","zh":"Bodanzky 主要是一个姓氏；在文化语境中常指巴西电影人 Jorge Bodanzky。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname); a proper noun used to refer to people with this last name","zh":"（姓氏）Bodanzky：一个家族姓（专有名词），用来指姓为 Bodanzky 的人"},"examples":[{"en":"Jorge Bodanzky is a film director.","zh":"Jorge Bodanzky 是一位电影导演。"},{"en":"I met Professor Bodanzky at the conference.","zh":"我在会议上见到了 Bodanzky 教授。"}]},{"partOfSpeech":"other","definition":{"en":"(often in film/cultural contexts) referring to Jorge Bodanzky (born 1942), a Brazilian filmmaker known for documentaries and socially engaged cinema","zh":"（常见于电影/文化语境）指 Jorge Bodanzky（生于1942年），巴西电影人，以纪录片与关注社会议题的影像作品而知名"},"examples":[{"en":"The class discussed Bodanzky’s documentaries about the Amazon region.","zh":"课堂讨论了 Bodanzky 关于亚马逊地区的纪录片。"},{"en":"Her research focuses on Bodanzky and Brazilian documentary film.","zh":"她的研究聚焦于 Bodanzky 与巴西纪录片电影。"}]}],"phonetic":"boʊˈdænzki","extraExplanation":["“Bodanzky”在英语里通常不是普通词汇，而是人名（姓氏）。在学术写作中，第一次出现时常写全名（如 Jorge Bodanzky），之后可只用姓氏 Bodanzky。","该姓氏常被认为具有德语/中东欧背景（在拉丁美洲也可见于移民家庭），具体家族来源需根据个人或家谱资料确认。"]}
{"word":"bodark","summary":{"en":"Bodark is a regional U.S. word for the Osage orange tree or its hard, bumpy fruit (“hedge apple”).","zh":"Bodark 是美国地区性用语，指奥塞奇橙树或它那种坚硬、表面凹凸的果实（常叫“篱笆苹果”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, hard, yellow-green fruit from the Osage orange tree, often called a “hedge apple,” sometimes used for decoration (not typically eaten).","zh":"一种由奥塞奇橙（Osage orange）树结出的黄绿色坚硬果实，常被称为“篱笆苹果”，多用于装饰（一般不食用）。"},"examples":[{"en":"In autumn, people in the Midwest sometimes put bodarks on the porch as fall decoration.","zh":"秋天时，美国中西部有些人会把 bodark 放在门廊上当作秋季装饰。"},{"en":"The bodark looks like a wrinkled green ball and has a sticky sap inside.","zh":"bodark 看起来像个皱皱的绿色球，里面有黏黏的汁液。"}]},{"partOfSpeech":"n.","definition":{"en":"the Osage orange tree (Maclura pomifera), a tough tree whose wood is valued for fence posts and bows.","zh":"奥塞奇橙树（Maclura pomifera），一种很耐用的树，其木材常用于栅栏柱，也因适合做弓而有名。"},"examples":[{"en":"The old fence posts were made from bodark because the wood resists rot.","zh":"旧栅栏柱用的是 bodark 木材，因为它不容易腐烂。"},{"en":"He planted a row of bodark trees to form a living fence.","zh":"他种了一排 bodark 树，做成一道活篱笆。"}]}],"synonyms":["Osage orange","hedge apple","horse apple","bois d’arc"],"phonetic":"/ˈboʊdɑrk/","extraExplanation":["“bodark”多见于美国南部与中西部方言，是法语“bois d’arc”（意为“弓木/做弓的木头”）的英语化读音与拼写。该树与奥塞奇（Osage）原住民用其木材制弓的历史有关。","这种果实在民间有“能驱虫/驱蜘蛛”的说法，但证据并不充分；它更常作为装饰或因气味而被放在屋内角落。"]}
{"word":"Bodb","summary":{"en":"“Bodb” is not a standard English word; it’s probably a typo, a name, or an acronym.","zh":"“Bodb”不是标准英语单词；更可能是拼写错误、人名或缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a typo, a name, or an acronym. Please share the sentence or the intended spelling.","zh":"不是标准英语单词；更可能是拼写错误、人名或缩写。请提供原句或你想查的正确拼写。"},"examples":[{"en":"I typed “bodb,” but my spellcheck suggested I might mean “bode” or “body.”","zh":"我打了“bodb”，但拼写检查提示我可能想写“bode”或“body”。"},{"en":"Could you show me the sentence where you saw “Bodb”?","zh":"你能把出现“Bodb”的那句话发我看看吗？"}]}],"phonetic":"/bɑdb/","extraExplanation":["“Bodb”在常见英语词典中一般查不到。它可能是：1）把“body（身体/主体）”打错了；2）把“bode（预示）”打错了；3）某个专有名词（人名/地名/用户名）；4）某个领域缩写（例如公司内部简称）。","如果你想查的是“bode”，它常用于较正式表达：bode well/ill（预示好/坏）。如果你想查的是“body”，那是非常常用的名词。把原句贴出来我可以帮你准确判断。"]}
{"word":"bodd","summary":{"en":"“Bodd” isn’t a standard word; it’s usually a misspelling of “bod” (informal: body/person) or “BOD” (an abbreviation).","zh":"“bodd”不是标准词；通常是把“bod”（口语：身体/人）或“BOD”（缩写）拼错。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling of “bod” (informal for “body” or “person”) or “BOD” (an abbreviation).","zh":"不是标准英语单词；多见于把“bod”（口语，指“身体”或“一个人”）或“BOD”（缩写）拼错。"},"examples":[{"en":"I think you meant “bod” (informal for “body”).","zh":"我猜你想写的是“bod”（口语，指“身体”）。"},{"en":"If you meant the abbreviation, write it as “BOD.”","zh":"如果你想表达缩写，请写成大写“BOD”。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) A person’s body, especially their physical shape.","zh":"（口语）身体；（尤指）身材。"},"examples":[{"en":"He works out to stay in shape and improve his bod.","zh":"他健身来保持身材、改善体型。"},{"en":"That jacket looks great on your bod.","zh":"那件夹克穿在你身上很好看。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, British) A person; a guy (often plural: “bods”).","zh":"（口语，英式）一个人；家伙（常用复数“bods”）。"},"examples":[{"en":"There were a few bods waiting outside the shop.","zh":"店外有几个人在等。"},{"en":"He seems like a decent bod.","zh":"他看起来是个不错的人。"}]},{"partOfSpeech":"other","definition":{"en":"Abbreviation: “BOD” can mean “board of directors” or “biochemical oxygen demand,” depending on context.","zh":"缩写：“BOD”可指“董事会（board of directors）”或“生化需氧量（biochemical oxygen demand）”，具体看语境。"},"examples":[{"en":"The BOD will vote on the new budget next week.","zh":"董事会下周将对新预算进行表决。"},{"en":"High BOD levels can indicate water pollution.","zh":"较高的BOD值可能表明水体污染。"}]}],"synonyms":["body","figure","physique","person","guy"],"phonetic":"/bɑd/","extraExplanation":["“bodd”在日常英语与主流词典中通常不作为词条出现，更常见的是键入错误。最可能的目标词是“bod”（口语）或大写缩写“BOD”。","拼写提示：如果想表达“身材/身体”，用“bod”；如果是缩写含义（董事会/生化需氧量），通常写作全大写“BOD”，并依靠上下文区分。","语域提示：“bod”偏口语，尤其“身材”用法在轻松场合更自然；正式写作更常用“body”“figure”“physique”。"]}
{"word":"boddagh","summary":{"en":"Boddagh is a Manx word meaning either a mischievous goblin in folklore or (informally) a rude/clumsy man.","zh":"Boddagh 是马恩岛语词，可指民俗里的捣蛋小妖精，也可（口语）指粗鲁/笨拙的男人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Manx English / Manx) a goblin or mischievous fairy-like creature in Manx folklore.","zh":"（马恩岛英语/马恩岛语）马恩岛民间传说中的小妖精、捣蛋鬼（类似小精灵/地精）。"},"examples":[{"en":"In old stories, a boddagh might play tricks on fishermen at night.","zh":"在古老故事里，boddagh 可能会在夜里捉弄渔民。"},{"en":"She joked that the missing keys were the work of a boddagh.","zh":"她开玩笑说钥匙不见了是 boddagh 干的。"}]},{"partOfSpeech":"n.","definition":{"en":"(Manx) a rude, clumsy, or foolish man; a boor.","zh":"（马恩岛语）粗鲁、笨拙或愚蠢的男人；莽汉、粗人。"},"examples":[{"en":"Don’t be a boddagh—say sorry and help clean up.","zh":"别当个 boddagh——道歉并帮忙收拾。"},{"en":"He was acting like a boddagh after a few drinks.","zh":"他喝了几杯后就表现得像个 boddagh。"}]}],"synonyms":["goblin","gremlin","hobgoblin","boor","lout"],"phonetic":"/ˈbɑdɑ/","extraExplanation":["“Boddagh”来自马恩岛（Isle of Man）的马恩岛语（Manx，凯尔特语族）。在一些语境里，它既可指民俗中的“捣蛋精灵”，也可引申为对人的贬义称呼（粗鲁、笨拙的人）。具体含义常取决于上下文和讲述者的语气。","马恩岛民俗中常见许多“会恶作剧的灵体/小妖精”形象，用来解释生活中的小意外（东西丢了、夜里怪声等），类似英语里用“gremlin”来半开玩笑地解释小故障。"]}
{"word":"boddhisattva","summary":{"en":"A bodhisattva is a Buddhist figure who seeks enlightenment and helps others with compassion; it can also mean a very kind, selfless person.","zh":"bodhisattva 指佛教中的“菩萨”，即求觉悟并以慈悲度众者；也可引申指非常善良无私的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Buddhism) a being who seeks enlightenment and compassionately helps others, often postponing final liberation (nirvana) to assist all beings.","zh":"（佛教）菩萨：发愿求觉悟，并以慈悲帮助众生的人（或境界）；常指为了度化众生而推迟进入涅槃者。"},"examples":[{"en":"In many Mahayana traditions, Avalokiteshvara is honored as a bodhisattva of great compassion.","zh":"在许多大乘传统中，观世音菩萨被尊为大慈大悲的菩萨。"},{"en":"She tries to be a bodhisattva in daily life by volunteering and listening to people in need.","zh":"她在日常生活中尽量以“菩萨行”来要求自己：做志愿服务、倾听需要帮助的人。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension) a very compassionate person who puts others first.","zh":"（引申）极富慈悲、总把他人放在第一位的人。"},"examples":[{"en":"My aunt is a bodhisattva—she’s always taking care of neighbors and strangers alike.","zh":"我阿姨简直像菩萨一样——总是在照顾邻居，甚至陌生人。"}]}],"synonyms":["saint (approx.)","compassionate person","spiritual helper"],"phonetic":"/ˌboʊdiˈsʌtvə/","extraExplanation":["词源来自梵语 bodhisattva：bodhi（觉悟）+ sattva（有情/众生）。英语里常见于佛教语境，尤其与“大乘（Mahayana）”相关。","在中文里“菩萨”既可指修行阶位，也常作敬称或比喻（如“活菩萨”）。英语的比喻用法也存在，但更偏书面或带文化色彩的表达，使用时注意语境是否合适。"]}
{"word":"boddle","summary":{"en":"“Boddle” is not standard; it’s usually a misspelling of “bottle.”","zh":"“boddle”不是标准用法；通常是“bottle”的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or very rare spelling; in modern English, it is usually a misspelling of “bottle.”","zh":"一种不规范或非常少见的拼写；在现代英语里通常是对“bottle（瓶子）”的误拼。"},"examples":[{"en":"I couldn’t find “boddle” in a standard dictionary—did you mean “bottle”?","zh":"我在常见词典里找不到“boddle”——你是不是想写“bottle”？"},{"en":"Please check the spelling: “bottle” is the common word.","zh":"请检查拼写：“bottle”才是常用词。"}]}],"synonyms":["bottle"],"phonetic":"/ˈbɑt̬əl/","extraExplanation":["“boddle”不是现代标准英语里的常用词条，所以在阅读或写作中出现时，多半是拼写错误或个别方言/自创拼写。","如果你想表达“瓶子/把……装瓶/鼓起勇气（bottle it）”，标准拼写是“bottle”。如果你能提供原句或上下文，我可以帮你判断它到底想表达哪个词。"]}
{"word":"Bode","summary":{"en":"Bode means “to be a sign of what will happen,” often in the phrases “bode well/ill.” It can also be a surname seen in astronomy.","zh":"bode 表示“预示、成为……的征兆”，常见搭配为 bode well/ill；也可作姓氏（天文学语境常见）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to be a sign of something (usually something good or bad) that will happen in the future; to suggest or predict","zh":"（通常指好或坏的事）预示、预兆；暗示将要发生"},"examples":[{"en":"Dark clouds bode rain later today.","zh":"乌云密布，预示今天晚些时候会下雨。"},{"en":"Her calm response bodes well for the team.","zh":"她冷静的反应对团队来说是个好兆头。"},{"en":"The sudden drop in sales does not bode well for the company.","zh":"销量突然下滑对公司来说并不是好兆头。"}]},{"partOfSpeech":"vt.","definition":{"en":"to foretell or portend (often used with “well” or “ill”)","zh":"预言；成为……的前兆（常与“well/ill”连用，语气较正式或带书面感）"},"examples":[{"en":"These early mistakes bode ill for the project.","zh":"这些早期错误为项目埋下不祥之兆。"},{"en":"A strong start can bode well, but it doesn’t guarantee success.","zh":"良好的开端是个好兆头，但并不保证成功。"}]},{"partOfSpeech":"other","definition":{"en":"a surname, especially known from astronomy (e.g., Johann Elert Bode; “Bode’s law”)","zh":"博德（姓氏；天文学中常见，如约翰·埃勒特·博德与“博德定律”）"},"examples":[{"en":"Bode’s law is a historical rule of thumb about planet distances.","zh":"“博德定律”是一条关于行星距离的历史经验规律。"}]}],"synonyms":["foretell","portend","foreshadow","signal","indicate"],"phonetic":"/boʊd/","extraExplanation":["“bode”作为动词在现代英语里偏书面、正式，日常口语更常用“suggest,” “indicate,” “be a sign of”。","常见固定搭配：bode well（好兆头）、bode ill（不祥之兆）。","注意区分：作为动词时读音与“bowed /boʊd/（鞠躬；弯曲的过去式）”相同，但意思完全不同；作为姓氏Bode在学术语境（尤其天文学）里更常见。"]}
{"word":"bode","summary":{"en":"“Bode” means “to indicate or be an omen of what will happen,” often used in “bode well/ill.”","zh":"“bode”意为“预示/是……的征兆”，常用于“bode well/ill（预示好/坏）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to be a sign of something that will happen in the future; to indicate (often something good or bad)","zh":"预示（未来将发生的事）；预兆（常指好或坏的结果）"},"examples":[{"en":"Dark clouds bode rain later this afternoon.","zh":"乌云预示着今天下午晚些时候会下雨。"},{"en":"Her calm confidence bodes well for the interview.","zh":"她沉着的自信预示这次面试会很顺利。"},{"en":"A long delay doesn’t bode well for the project.","zh":"长时间的拖延对这个项目来说不是好兆头。"}]},{"partOfSpeech":"v.","definition":{"en":"to foretell or predict (something), especially in a serious or formal style","zh":"预言；预告（尤用于较正式、严肃的表达）"},"examples":[{"en":"Some experts warn that rising costs may bode trouble for small businesses.","zh":"一些专家警告，成本上涨可能会给小企业带来麻烦。"},{"en":"The early results bode a close election.","zh":"早期结果预示这将是一场势均力敌的选举。"}]}],"synonyms":["portend","foreshadow","predict","signal","indicate"],"phonetic":"/boʊd/","extraExplanation":["“bode”常见搭配是“bode well / bode ill”，意思是“是好/坏的预兆”。它多用于书面语或新闻、评论中，语气比“suggest”更强，带有“预兆、征兆”的感觉。","词源上与古英语中表示“宣布、预告”的词有关，因此带一点“预告未来走向”的色彩。"]}
{"word":"boded","summary":{"en":"“Boded” is the past form of “bode,” meaning “was a sign that something (often something bad) would happen.”","zh":"“boded”是“bode”的过去式/过去分词，表示“预示某事（常为坏事）将发生”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “bode” (to be a sign of something that will happen, usually something bad).","zh":"“bode”的过去式/过去分词：预示（通常是不好的事）将发生。"},"examples":[{"en":"The sudden silence boded trouble for the hikers.","zh":"突如其来的寂静预示着徒步者可能会遇到麻烦。"},{"en":"Those early warnings boded poorly for the project’s success.","zh":"那些早期的警告预示着这个项目难以成功。"}]},{"partOfSpeech":"phrase","definition":{"en":"used in the fixed, somewhat old-fashioned phrase “boded ill” meaning “suggested something bad was going to happen.”","zh":"常见于较古雅的固定搭配“boded ill”：表示“预示不祥/预示坏事将至”。"},"examples":[{"en":"The look on his face boded ill.","zh":"他脸上的表情预示不祥。"}]}],"synonyms":["foreshadowed","portended","presaged","signaled"],"phonetic":"/ˈboʊdɪd/","extraExplanation":["“bode”在现代英语里不算高频，更常见于新闻写作、评论、文学叙述中，语气往往较正式或带一点“预兆/征兆”的色彩。","常见搭配：bode well（预示好结果）、bode ill（预示坏结果）、bode badly/poorly（不祥）。在口语中也可以用更常见的说法替换，如 “be a bad sign” 或 “suggest trouble.”"]}
{"word":"bodeful","summary":{"en":"Bodeful means “ominous; suggesting something bad will happen,” and it is mostly used in literary or old-fashioned contexts.","zh":"bodeful 意为“预示不祥的、凶兆的”，多见于文学或较古旧的语境中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic/literary) Suggesting that something bad will happen; ominous.","zh":"（古体/文学用语）预示不祥的；不吉利的；凶兆的。"},"examples":[{"en":"The dark, bodeful clouds gathered over the village.","zh":"乌黑的不祥云团聚集在村庄上空。"},{"en":"His bodeful silence made everyone uneasy.","zh":"他那不祥的沉默让所有人都感到不安。"},{"en":"In the novel, a bodeful dream warns the hero of danger ahead.","zh":"在小说中，一个不祥的梦警告主人公前方有危险。"}]}],"synonyms":["ominous","foreboding","inauspicious","threatening"],"phonetic":"ˈboʊd.fəl","extraExplanation":["“bodeful”由动词“bode”（预示、预兆）+ 后缀“-ful”（充满……的）构成，意思接近“full of bode”。它在现代英语中较少见，更常在诗歌、旧文学或刻意使用的文风中出现。","现代更常用的替代词有“ominous”“inauspicious”“foreboding”。如果你在日常写作/口语中想表达“不祥的”，用这些词会更自然。"]}
{"word":"bodefully","summary":{"en":"“Bodefully” means “in an ominous/foretelling way.” It’s rare; “ominously” is more common.","zh":"“bodefully”意为“以不祥的预示方式”。该词很少见，更常用“ominously”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that suggests something will happen in the future, especially something important or bad; ominously","zh":"以预示（将来会发生某事）的方式；（尤指）不祥地、凶兆地"},"examples":[{"en":"The dark clouds gathered bodefully over the city.","zh":"乌云在城市上空聚集，显得不祥。"},{"en":"His silence bodefully hinted that something was wrong.","zh":"他的沉默不祥地暗示出了问题。"}]}],"synonyms":["ominously","forebodingly","portentously","inauspiciously"],"phonetic":"/ˈboʊdfəli/","extraExplanation":["“bodefully”非常少见，日常英语里更常用的是 **ominously**（不祥地）或 **forebodingly**（预感不祥地）。","构词上它来自 **bode**（预示、预兆；预示某事将发生）+ **-ful**（充满……的）+ **-ly**（副词后缀），字面意思就是“带着预兆地”。在文学或较旧的文体中偶尔会出现，用来营造阴沉、预兆感的气氛。"]}
{"word":"bodefulness","summary":{"en":"Bodefulness means an ominous, foreboding feeling that something (often bad) is likely to happen.","zh":"Bodefulness 指一种不祥的预感或凶兆感，暗示（常常是坏事）可能发生。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of seeming to predict something (usually bad) will happen; ominousness","zh":"（多指不祥的）预兆感；凶兆的意味；不祥之感"},"examples":[{"en":"There was a bodefulness in the dark sky that made everyone hurry home.","zh":"黑沉沉的天空带着一种不祥的预兆感，让大家都赶紧回家。"},{"en":"In the story, the sudden silence has a quiet bodefulness.","zh":"在故事里，突如其来的寂静带着一种安静却不祥的意味。"},{"en":"The old poem speaks of the sea’s bodefulness before the storm.","zh":"那首旧诗写到了暴风雨来临前大海的不祥之感。"}]}],"synonyms":["ominousness","foreboding","portentousness"],"phonetic":"/ˈboʊdfəlnəs/","extraExplanation":["“bodefulness”比较少见，偏文学/古风用法。更常见的表达是“ominousness”（不祥、凶兆感）或形容词“ominous / foreboding”（不祥的、预感不妙的）。","词根来自动词“bode”（预示、是……的兆头），在现代英语中多见于短语“bode well/ill（预示好/坏）”。"]}
{"word":"Bodega","summary":{"en":"A bodega is usually a small neighborhood convenience store in the U.S. (especially NYC), and it can also mean a wine cellar or storeroom in Spanish/formal use.","zh":"bodega通常指美国（尤其纽约）的街区小型便利店；在西班牙语/较正式用法中也可指酒窖或仓库。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in the U.S., especially New York City) a small neighborhood convenience store, often selling snacks, drinks, basic groceries, and everyday items.","zh":"（在美国，尤指纽约）街区里的小型便利店/杂货店，常卖零食、饮料、基础食品和日用品。"},"examples":[{"en":"I stopped at the bodega to buy water and a sandwich.","zh":"我去街角的bodega买了水和三明治。"},{"en":"There’s a bodega on almost every block in this neighborhood.","zh":"这个社区几乎每个街区都有一家bodega。"}]},{"partOfSpeech":"n.","definition":{"en":"(in Spanish or in more formal use) a wine cellar or a warehouse/storehouse for goods.","zh":"（源自西班牙语或更正式用法）酒窖；货仓/仓库。"},"examples":[{"en":"The winery keeps older bottles in a cool bodega underground.","zh":"酒庄把年份更老的酒存放在地下凉爽的酒窖里。"},{"en":"Goods were stored in a bodega near the port.","zh":"货物存放在港口附近的仓库里。"}]}],"synonyms":["corner store","convenience store","mini-mart","deli (NYC context)"],"phonetic":"/boʊˈdeɪɡə/","extraExplanation":["“bodega”来自西班牙语，原意与“酒窖/储藏处”有关。在美国城市语境（尤其纽约）里，它常指街角小店，带有明显的本地文化色彩。","在纽约口语中常听到“the bodega”，有时也特指那种营业时间长、卖熟食（deli counter）和日常用品的社区小店。"]}
{"word":"bodega","summary":{"en":"A bodega is a small neighborhood convenience store in the U.S. (especially NYC).","zh":"bodega在美国（尤其纽约）通常指社区里的小型便利店/杂货店。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In the U.S., especially New York City) a small neighborhood convenience store, often open late, selling snacks, drinks, basic groceries, and everyday items.","zh":"（在美国，尤其是纽约市）街区里的小型便利店/杂货店，常常营业到很晚，卖零食、饮料、基本食品和日用品。"},"examples":[{"en":"I’m going to the bodega to grab a bottle of water.","zh":"我要去附近的bodega买瓶水。"},{"en":"The bodega on the corner is open 24/7.","zh":"街角那家bodega全天候营业。"},{"en":"She stopped at a bodega for a quick sandwich.","zh":"她在一家bodega买了个三明治垫垫肚子。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common, more general) a storeroom or warehouse for goods, such as wine.","zh":"（较少见，更泛指）仓库/储藏室（如酒类的储藏处）。"},"examples":[{"en":"The restaurant keeps extra wine in a bodega behind the kitchen.","zh":"餐厅把多余的酒放在厨房后的储藏间里。"}]}],"synonyms":["corner store","convenience store","deli (regional)","mini-mart"],"phonetic":"/boʊˈdeɪɡə/","extraExplanation":["“bodega”来自西班牙语，原意与“酒窖/储藏室”有关。在美国城市语境里（特别是纽约），它带有很强的地域与社区色彩：很多bodega由移民家庭经营，售卖日常所需，也常成为邻里社交的一部分。","在纽约英语里，人们常说“the bodega”来指家附近那一家；也常见固定搭配如“bodega cat”（店里养的猫，用来防老鼠，也成了流行文化符号）。"]}
{"word":"bodegas","summary":{"en":"“Bodegas” usually means neighborhood convenience stores (especially in NYC); it can also mean wine cellars/wineries or warehouses in Spanish contexts.","zh":"“bodegas”通常指（尤其在纽约）社区小便利店；在西语语境中也可指酒窖/酒庄或仓库。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"small neighborhood convenience stores, especially in New York City and other U.S. cities (plural of “bodega”)","zh":"（尤指纽约等美国城市的）社区小便利店/杂货店（“bodega”的复数）"},"examples":[{"en":"I stopped by the bodega for milk and a sandwich.","zh":"我去附近的bodega买了牛奶和三明治。"},{"en":"Many bodegas stay open late and sell snacks, drinks, and basic groceries.","zh":"很多bodega营业到很晚，卖零食、饮料和一些基本杂货。"}]},{"partOfSpeech":"n.","definition":{"en":"wine cellars, wineries, or storage warehouses in Spanish-speaking contexts (plural of Spanish “bodega”)","zh":"（西语语境中）酒窖/酒庄，或仓库、货栈（西语“bodega”的复数）"},"examples":[{"en":"The tour includes visits to several bodegas in the region.","zh":"行程包括参观该地区的几家酒庄/酒窖。"},{"en":"The goods were kept in bodegas near the port.","zh":"货物被存放在港口附近的仓库里。"}]}],"synonyms":["corner stores","convenience stores","mini-marts","delis (informal, sometimes)"],"phonetic":"/boʊˈdiːɡəz/","extraExplanation":["“bodega”原本是西班牙语，意思可指“酒窖/仓库”。在美国城市英语里，尤其是纽约，“bodega”常专指街角小便利店（多由移民家庭经营），卖饮料、零食、日用品，有时还有熟食柜台。","在纽约文化中，人们会说“the bodega”来指自己家附近那一家，带有很强的社区归属感。复数就是“bodegas”。"]}
{"word":"bodegon","summary":{"en":"Bodegon (Spanish bodegón) usually means a Spanish-style still life painting, often featuring food and everyday kitchen objects.","zh":"bodegon（西语bodegón）通常指西班牙风格的静物画，多描绘食物与厨房日常器物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Art) A Spanish-style still life painting—often showing food, kitchen objects, or everyday items, sometimes with a simple genre scene.","zh":"（艺术）西班牙风格的静物画——常描绘食物、厨房器具或日常物品，有时也包含朴素的生活场景。"},"examples":[{"en":"The museum displayed a 17th-century bodegón filled with fruit, bread, and clay pots.","zh":"博物馆展出了一幅17世纪的bodegón，画中有水果、面包和陶罐。"},{"en":"Her painting class studied how light and shadow work in a Spanish bodegón.","zh":"她的绘画课学习了西班牙bodegón中明暗光影的处理方式。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A simple tavern or eating place in Spanish-speaking contexts; the word can also refer to a pantry or storeroom in Spanish.","zh":"（较少见）在西语语境中指朴素的小酒馆或小餐馆；在西班牙语里也可指储藏室、食品储藏间。"},"examples":[{"en":"They stopped at a small bodegón for a quick meal while traveling.","zh":"旅行途中他们在一家小bodegón里简单吃了顿饭。"}]}],"synonyms":["still life","Spanish still life","nature morte"],"phonetic":"ˌboʊdəˈɡoʊn","extraExplanation":["“bodegón”来自西班牙语，重音在最后一音节（-gón），原词常带重音符号：bodegón；英语里有时写作不带重音的 bodegon。","在艺术史中，bodegón常与17世纪西班牙绘画相关，尤其是对日常食物与器物的细致描写与强烈明暗对比（chiaroscuro）。一些画家（如Sánchez Cotán）以此题材著名。","与普通“still life”相比，bodegón更偏“厨房/餐食/器物”的朴素生活气息，有时会加入人物或小场景，因此也带一点“风俗画”的味道。"]}
{"word":"bodegones","summary":{"en":"**Bodegones** are Spanish-style still-life paintings (plural of *bodegón*), often featuring food and kitchen objects.","zh":"**Bodegones** 指西班牙风格的静物画（*bodegón* 的复数），常描绘食物与厨房器具等日常物品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Art) Spanish-style still-life paintings—often showing food, kitchen objects, and everyday items; plural of *bodegón*.","zh":"（艺术）西班牙风格的静物画，常描绘食物、厨房器具与日常物品；*bodegón* 的复数。"},"examples":[{"en":"The museum’s Baroque gallery includes several **bodegones** with fruit and ceramic bowls.","zh":"博物馆的巴洛克展厅里有几幅 **bodegones**，画着水果和陶碗。"},{"en":"Her thesis compares Dutch still lifes with Spanish **bodegones**.","zh":"她的论文比较了荷兰静物画与西班牙 **bodegones**。"}]}],"synonyms":["Spanish still lifes","still-life paintings","kitchen still lifes","bodegón"],"phonetic":"/ˌboʊdəˈɡoʊneɪz/","extraExplanation":["“bodegón”源自西班牙语，和 *bodega*（酒窖/储藏室/小店）同源；在艺术史里常特指西班牙黄金时代（16–17世纪）的“厨房/食物静物”传统。","典型画家常被提到：Juan Sánchez Cotán、Zurbarán、以及早期的 Velázquez；这类作品往往风格朴素、光影强烈，强调日常物品的质感与“静”的氛围。","英语里有时直接用西语复数 **bodegones**（而不是说 “Spanish still lifes”），多见于艺术评论、展览说明和学术写作。"]}
{"word":"bodement","summary":{"en":"Bodement is a literary word meaning an omen or warning sign of what may happen, often something bad.","zh":"Bodement 是较文学化的词，指预兆/凶兆，常表示不好的事情将发生。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an omen or warning sign about what may happen in the future; a foreboding","zh":"（多为文学/古用）预兆；凶兆；预示（某事将发生的迹象）"},"examples":[{"en":"Dark clouds and sudden silence felt like a bad bodement.","zh":"乌云密布、突然安静下来，让人觉得是不祥的预兆。"},{"en":"In the story, the cracked mirror is a bodement of trouble to come.","zh":"在故事里，裂开的镜子预示着麻烦将要发生。"}]},{"partOfSpeech":"n.","definition":{"en":"a prediction or indication of a future event (often negative in tone)","zh":"（常带负面语气）预言；征兆；（对未来事件的）暗示"},"examples":[{"en":"Her nervous laugh was a bodement that she didn’t trust the plan.","zh":"她紧张的笑声暗示她并不信任这个计划。"},{"en":"The falling sales were a bodement for the company’s future.","zh":"销量下滑是这家公司未来的一个不妙征兆。"}]}],"synonyms":["omen","portent","forewarning","sign","foreboding"],"phonetic":"/ˈboʊdmənt/","extraExplanation":["“bodement”较少见，语感偏古旧、文学化；日常英语里更常用“omen”“sign”“warning sign”“foreboding”。","它和动词“bode”（预示）同源：例如“Those clouds bode rain.”（那些云预示要下雨）。"]}
{"word":"bodements","summary":{"en":"Bodement(s) is a literary word meaning an omen or sign of what will happen, often something bad.","zh":"Bodement(s) 是较文学、古风的词，意思是预兆/凶兆，常指不好的先兆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural: bodements) a sign or omen that something will happen in the future, especially something bad; a forewarning.","zh":"（复数：bodements）预兆；凶兆；（尤指不好的）先兆、警示。"},"examples":[{"en":"Dark clouds were a bodement of the storm to come.","zh":"乌云是暴风雨将至的预兆。"},{"en":"In the novel, the broken mirror serves as a bodement of tragedy.","zh":"在小说里，碎镜子成了悲剧的凶兆。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common, literary) the act of predicting or foretelling what will happen.","zh":"（较少见，文学用法）预言；预示（某事将发生）的行为。"},"examples":[{"en":"He spoke in bodement, warning them not to travel at night.","zh":"他以预言般的口吻说话，警告他们不要夜里出行。"}]}],"synonyms":["omen","portent","forewarning","sign","foreboding"],"phonetic":"/ˈboʊdmənt/","extraExplanation":["“bodement”带有较强的文学/古风色彩，现代英语中更常用的词是“omen”“sign”“warning”“foreboding”。","它与动词“bode”（预示）同源，所以常见搭配有“bode well/ill”（预示好/坏结果）。","如果你看到的是“bodements”，那只是名词复数形式，意思不变：多个“预兆/凶兆”。"]}
{"word":"boden","summary":{"en":"“Boden” is most commonly a British clothing brand name or a surname in English.","zh":"“Boden”在英语中最常见是英国服装品牌名或一个姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A British clothing brand/retailer known for colorful casual and workwear, officially called “Boden” (often “Johnnie Boden”).","zh":"（专有名词）英国服装品牌/零售商“Boden”，以色彩丰富的休闲与通勤服装闻名。"},"examples":[{"en":"She ordered a dress from Boden for the wedding.","zh":"她从Boden买了一条裙子参加婚礼。"},{"en":"Boden is popular for its bright prints and good basics.","zh":"Boden以亮眼印花和基础款口碑不错而受欢迎。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A surname (family name).","zh":"（专有名词）姓氏（人名）。"},"examples":[{"en":"Dr. Boden will see you now.","zh":"Boden医生现在可以见你了。"},{"en":"The article was written by Maria Boden.","zh":"这篇文章由Maria Boden撰写。"}]}],"phonetic":"/ˈboʊdən/","extraExplanation":["在英语里，**Boden**最常见是品牌名或姓氏；如果你是在德语语境里看到**Boden**，它通常表示“地面、地板、土壤/地”，相当于英语的 *ground/floor/soil*。因此它也常出现在德语地名、专业词（如与土壤相关的术语）里。"]}
{"word":"bodenbenderite","summary":{"en":"Bodenbenderite is a rare silicate mineral name used mainly in geology/mineralogy.","zh":"Bodenbenderite 是一种稀有的硅酸盐矿物名称，主要用于地质学/矿物学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral species (a silicate mineral) found in certain metamorphic or igneous rocks; mainly used as a technical term in geology and mineralogy","zh":"一种稀有矿物（硅酸盐类矿物），可见于某些变质岩或火成岩中；主要作为地质学与矿物学的专业术语使用"},"examples":[{"en":"Bodenbenderite is rarely encountered outside specialized mineral collections.","zh":"Bodenbenderite 在矿物标本收藏领域之外很少见。"},{"en":"The paper reports bodenbenderite occurring alongside other uncommon silicate minerals.","zh":"该论文报告了 bodenbenderite 与其他罕见硅酸盐矿物伴生的情况。"},{"en":"Students learned to identify bodenbenderite by comparing its properties with similar minerals.","zh":"学生通过将其性质与相似矿物对比来学习识别 bodenbenderite。"}]}],"synonyms":["(no common synonyms; technical mineral name)"],"phonetic":"/ˌboʊdənˈbɛndəˌraɪt/","extraExplanation":["以 -ite 结尾的词在英语里常见于矿物名称（表示“某某矿/某某石”），因此 bodenbenderite 一看就很像矿物学命名。","这类矿物名通常源自人名或地名（用于纪念相关研究者或发现地点）；如果你是在文献或标本标签上看到它，通常不需要翻译成常用中文词，而是用音译或直接保留英文名。"]}
{"word":"Bodenheim","summary":{"en":"Bodenheim is mainly a German place name (a town near Mainz) and can also be a surname.","zh":"Bodenheim 主要是德国地名（美因茨附近的城镇），也可以作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A town (municipality) in Rhineland-Palatinate, Germany, near Mainz; also used as a place name in addresses.","zh":"德国莱茵兰-普法尔茨州的一个城镇（市镇），靠近美因茨；也常作为地址中的地名使用。"},"examples":[{"en":"She lives in Bodenheim, just south of Mainz.","zh":"她住在博登海姆，就在美因茨南边。"},{"en":"Our train to Bodenheim leaves at 9:10.","zh":"我们去博登海姆的火车 9:10 发车。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname).","zh":"姓氏（人名中的姓）。"},"examples":[{"en":"Dr. Bodenheim will see you at 3 p.m.","zh":"博登海姆医生下午三点见你。"}]}],"phonetic":"/ˈboʊdənˌhaɪm/","extraExplanation":["Bodenheim 是德语地名，常见于德国西南部。该地靠近莱茵河流域与美因茨（Mainz），所在区域（莱茵黑森 Rheinhessen 一带）以葡萄酒与乡村景观较有名。","英语里把它当作专有名词使用：通常不翻译，只在需要时音译（如“博登海姆”）。写地址或旅行信息时首字母大写。"]}
{"word":"Bodensee","summary":{"en":"Bodensee is the German name for Lake Constance, a large lake shared by Germany, Austria, and Switzerland.","zh":"Bodensee是康斯坦茨湖（博登湖）的德语名称，位于德国、奥地利和瑞士交界。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bodensee: the German name for Lake Constance, a large lake in Central Europe on the borders of Germany, Austria, and Switzerland.","zh":"Bodensee：康斯坦茨湖（博登湖）的德语名称，是中欧一座大型湖泊，位于德国、奥地利与瑞士交界处。"},"examples":[{"en":"We took a train to Konstanz and spent the afternoon walking along the Bodensee.","zh":"我们坐火车到康斯坦茨，下午沿着博登湖散步。"},{"en":"The Bodensee is famous for its views of the Alps on clear days.","zh":"天气晴朗时，博登湖以能看到阿尔卑斯山的景色而闻名。"}]}],"synonyms":["Lake Constance","Konstanz Lake"],"phonetic":"/ˈboʊdənˌseɪ/","extraExplanation":["“Bodensee”在英语里通常写作“Lake Constance（康斯坦茨湖）”。在德语语境（旅游信息、地图、当地新闻）中常用“Bodensee”。","它是欧洲重要的淡水湖之一，湖区有许多小城镇与葡萄园；“Bodensee-Radweg（博登湖自行车环湖道）”也很有名。"]}
{"word":"boder","summary":{"en":"Border means a boundary or edge, and it can also mean to be next to or surround something.","zh":"Border 指“边界/边缘”，也可作动词表示“接壤/围绕”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the line that separates two areas, especially two countries; the edge of something","zh":"（尤指国家之间的）边界；边缘"},"examples":[{"en":"They live near the border between the U.S. and Mexico.","zh":"他们住在美国和墨西哥的边境附近。"},{"en":"Draw a border around the picture.","zh":"在图片周围画一圈边框。"}]},{"partOfSpeech":"v.","definition":{"en":"to form an edge around something; to be next to another place or area","zh":"给……加边框；与……接壤；毗邻"},"examples":[{"en":"A fence borders the garden.","zh":"一道栅栏围着花园。"},{"en":"Canada borders the United States.","zh":"加拿大与美国接壤。"}]}],"synonyms":["boundary","edge","frontier","limit"],"phonetic":"/ˈbɔrdər/","extraExplanation":["“boder”通常是拼写错误，更常见的正确拼写是 border（边界/边框）。","border 既可以指国家之间的“边境”（常见搭配：cross the border 越境、border control 边检），也可以指图片、页面周围的“边框/边缘”。"]}
{"word":"bodes","summary":{"en":"“Bodes” means “shows signs of what will happen,” often used in “bode well/ill.”","zh":"“bodes”表示“预示/是……的征兆”，常用于“bode well/ill（预示好/坏结果）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to be a sign that something (usually good or bad) will happen in the future","zh":"预示；是……的征兆（通常指好事或坏事将发生）"},"examples":[{"en":"Dark clouds bode rain later today.","zh":"乌云预示着今天晚些时候可能会下雨。"},{"en":"Her early success bodes well for her future career.","zh":"她的早期成功预示着她未来的职业发展会很顺利。"},{"en":"The continued delays do not bode well for the project.","zh":"持续的拖延对这个项目来说不是好兆头。"}]}],"synonyms":["foreshadows","signals","portends","predicts","suggests"],"phonetic":"/boʊdz/","extraExplanation":["“bodes”是动词“bode”的第三人称单数现在时（he/she/it bodes）。更常见的固定搭配是：bode well（预示好结果）/ bode ill（预示坏结果）/ not bode well（不是好兆头）。","这个词语气偏正式，常见于新闻报道、评论、文学写作中。日常口语里也可用“is a sign of…”“suggests…”来替换。"]}
{"word":"bodewash","summary":{"en":"“Bodewash” is not standard; it most likely means “body wash,” a liquid soap for washing your body.","zh":"“bodewash”不是标准英语，通常指“body wash”（沐浴露/沐浴液）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely a misspelling) “body wash”: a liquid soap used to clean your body in the shower or bath.","zh":"（可能是拼写错误）“body wash”：沐浴露/沐浴液，用于在淋浴或洗澡时清洁身体的液体清洁用品。"},"examples":[{"en":"I ran out of body wash, so I used bar soap instead.","zh":"我的沐浴露用完了，所以改用香皂。"},{"en":"This body wash smells like lavender and feels gentle on my skin.","zh":"这款沐浴露有薰衣草的香味，而且用起来很温和。"}]}],"synonyms":["shower gel","body cleanser","body soap (general)"],"phonetic":"/ˈbɑːdi wɑːʃ/","extraExplanation":["“bodewash”在常见英语中不是标准拼写；日常生活里通常写作 **body wash**（两词）。如果你是在产品标签、网店或口语里看到的“bodewash”，很可能是拼写错误或个别商家的非标准写法。"]}
{"word":"bodeword","summary":{"en":"A “bodeword” is an old-fashioned word meaning an omen or warning sign of something to come (often something bad).","zh":"“bodeword”是较古旧的词，指预兆或警告性迹象，常暗示不好的事将发生。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a warning sign or message that suggests something (often bad) is going to happen; an omen","zh":"预兆；凶兆；（预示将发生之事的）警告或讯息"},"examples":[{"en":"The sudden silence in the room felt like a bodeword of trouble.","zh":"房间里突然的沉默像是不祥的预兆。"},{"en":"In old stories, a black crow was often taken as a bodeword of death.","zh":"在古老故事里，黑乌鸦常被视为死亡的凶兆。"}]}],"synonyms":["omen","portent","warning","sign"],"phonetic":"/ˈboʊdˌwɝːd/","extraExplanation":["“bodeword”比较古旧，现代英语里更常用“omen”“sign”“warning”“portent”。它由“bode（预示）+ word（话/讯息）”组成，强调“通过某个迹象或信息预告将发生的事”，常带不祥意味。","拼写上容易与“codeword（暗号）”混淆：codeword是密码/暗号；bodeword是预兆/凶兆。","相关表达：a bad omen（不祥之兆）、a sign of things to come（未来的征兆）、spell trouble（预示麻烦）。"]}
{"word":"Bodfish","summary":{"en":"Bodfish is usually a proper name: a surname or the name of a community in California.","zh":"Bodfish 通常是专有名词：英文姓氏，或美国加州的一个地名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname) found in English-speaking countries","zh":"（姓氏）Bodfish，用作英文姓"},"examples":[{"en":"Ms. Bodfish will lead the meeting today.","zh":"Bodfish 女士今天将主持会议。"},{"en":"I found an article written by Jordan Bodfish.","zh":"我找到一篇由 Jordan Bodfish 写的文章。"}]},{"partOfSpeech":"other","definition":{"en":"a place name, especially Bodfish, California (an unincorporated community in Kern County)","zh":"（地名）Bodfish，常指美国加州克恩县的一个社区（非建制地区）"},"examples":[{"en":"They drove through Bodfish on the way to Lake Isabella.","zh":"他们去伊莎贝拉湖的路上开车经过了 Bodfish。"},{"en":"Bodfish is a small community in the Kern River Valley.","zh":"Bodfish 是克恩河谷里的一个小社区。"}]}],"phonetic":"/ˈbɑdˌfɪʃ/","extraExplanation":["“Bodfish”不是常见的英语普通名词，更常见于专有名词（人名/地名）。如果你本来想查的是“codfish”（鳕鱼）或其他拼写相近的词，也可以告诉我，我可以一起对比解释。"]}
{"word":"bodge","summary":{"en":"Bodge means to do a quick, imperfect fix or make something clumsily; it can also mean the messy, temporary result.","zh":"bodge 指草率地凑合修理/处理；也可指这种不够专业的临时修补结果。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to fix, build, or do something in a quick, clumsy way—often not very well, but “good enough” for now","zh":"（草率地）凑合修理/拼装/处理；做得不太好但暂时能用"},"examples":[{"en":"He bodged the broken chair with tape and glue.","zh":"他用胶带和胶水凑合把坏椅子修好了。"},{"en":"I can bodge it for tonight, but we should repair it properly tomorrow.","zh":"我今晚可以先凑合弄好，但明天得好好修。"}]},{"partOfSpeech":"n.","definition":{"en":"a quick, messy, imperfect repair or solution; a “patch job”","zh":"草率的修补/临时解决办法；“凑合的活儿”"},"examples":[{"en":"This wiring is a bodge—please get an electrician to redo it.","zh":"这电线接法就是凑合出来的——请找电工重做。"},{"en":"The software update was a bodge, not a real fix.","zh":"这次软件更新只是权宜之计，不是真修复。"}]}],"synonyms":["patch up","hack together","jury-rig","improvise","makeshift"],"phonetic":"/bɑdʒ/","extraExplanation":["“bodge”在英式英语里非常常见，常用来吐槽DIY或维修做得粗糙、不够专业：a bodge / a bodge job（凑合出来的活）。在美式英语里不算高频，更常见的近义说法是 “hack (together) / patch (up) / jury-rig”。","语气通常带轻微负面评价：能用但不漂亮、不牢靠。也可以自嘲：\"I bodged it.\"（我就随便凑合了一下）。"]}
{"word":"bodger","summary":{"en":"A bodger is (especially in British English) someone who does rough, makeshift repairs; historically, it also meant a woodturner who made chair parts.","zh":"bodger 多指（英式）做事粗糙、凑合修理的人；历史上也指在英格兰林地里制作椅子部件的木工车床匠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(British, informal) A person who makes quick, temporary, or poorly done repairs or builds something in a rough way.","zh":"（英式非正式）做事粗糙、凑合修理或拼凑制作的人；“糊弄修理”的人。"},"examples":[{"en":"Someone has bodged the wiring, so the light keeps flickering.","zh":"有人把电线凑合着修过，所以灯一直在闪。"},{"en":"He’s not a trained mechanic—just a bodger who fixes things with tape.","zh":"他不是受过训练的技工，只是个爱用胶带凑合修东西的人。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical) A woodturner in the Chiltern Hills (England) who made chair legs and parts, often working in the woods.","zh":"（历史用法）英格兰奇尔特恩丘陵一带的木工车床匠，常在林中制作椅腿等椅子部件。"},"examples":[{"en":"In the 1800s, a bodger might turn chair legs in a woodland workshop.","zh":"在19世纪，bodger 可能会在林地作坊里车制椅腿。"},{"en":"The museum has tools used by bodgers who supplied parts to chair makers.","zh":"博物馆里有 bodger（椅腿车工）给椅子制造商供货时用过的工具。"}]}],"synonyms":["botcher","hack","DIYer (informal)","repairman (neutral)","tinkerer"],"phonetic":"/ˈbɑdʒɚ/","extraExplanation":["“bodger”在现代英式英语里多带贬义，强调“临时凑合、质量不高”的做法；对应的动词是“to bodge”（凑合修/草率拼凑）。","历史义与现代义有关联：早期“bodger”指在林中做椅腿的木工匠人；后来词义逐渐演变为“手艺不精、靠凑合解决问题的人”。"]}
{"word":"bodgery","summary":{"en":"Bodgery means sloppy, makeshift work or a quick fix done poorly.","zh":"bodgery 指粗糙的临时拼凑或做得不专业的应急修补。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"rough, makeshift work or a quick fix done in a careless way (often not done properly); a botched job","zh":"粗糙的应急修补/临时拼凑（常带有不专业、做得不好的含义）；拙劣的活"},"examples":[{"en":"The shelf is still standing, but the screws and tape make it pure bodgery.","zh":"架子还没倒，但螺丝加胶带的做法完全是“临时拼凑”。"},{"en":"We don’t need bodgery—we need a proper repair that will last.","zh":"我们不需要这种凑合的修补；我们需要能长期使用的正规维修。"},{"en":"The report was rushed and full of bodgery, so the manager asked for a rewrite.","zh":"这份报告赶工完成、漏洞百出，所以经理要求重写。"}]}],"synonyms":["botch","hack job","quick-and-dirty fix","makeshift repair","shoddy work"],"phonetic":"/ˈbɑːdʒəri/","extraExplanation":["“bodgery”来自动词“bodge”（凑合做、应付了事、拙劣地修补）。它在英式英语、澳式英语里更常见；在美式英语中更常用“botch / a hack job / a quick-and-dirty fix”来表达类似意思。","语气通常是贬义：强调“为了快/省事而做得不标准”，暗示之后可能出问题。偶尔也可半开玩笑地自嘲（比如DIY临时救急）。"]}
{"word":"bodgie","summary":{"en":"“Bodgie” is Australian/NZ slang for a rebellious, flashy young troublemaker (often linked to 1950s youth culture). It can also describe that style or attitude.","zh":"“bodgie”是澳大利亚/新西兰俚语，指叛逆张扬、爱惹事的年轻小混混（常与20世纪50年代青年文化相关），也可作形容词形容这种风格或态度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Australia, New Zealand, slang) A young man (often in the 1950s–60s) known for rebellious behavior, flashy style, and petty troublemaking; a hooligan or juvenile delinquent.","zh":"（澳大利亚、新西兰，俚语）指（多见于20世纪50–60年代）爱叛逆、爱出风头、常惹小麻烦的年轻男子；小混混／不良少年。"},"examples":[{"en":"In old Australian movies, the bodgie is often shown hanging around milk bars and picking fights.","zh":"在一些老澳洲电影里，“bodgie”常被拍成在奶吧附近游荡、爱打架的混混。"},{"en":"His grandpa said he used to dress like a bodgie when he was a teenager.","zh":"他爷爷说他十几岁时曾经打扮得像个“bodgie”。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Australia, New Zealand, slang) Relating to or typical of a bodgie; flashy, rebellious, or “tough” in style.","zh":"（澳大利亚、新西兰，俚语）与“bodgie”有关的；带有小混混风格的；张扬叛逆、装酷的。"},"examples":[{"en":"He had a bodgie haircut and a leather jacket.","zh":"他留着很“bodgie”的发型，还穿着皮夹克。"},{"en":"That bodgie attitude won’t help you at work.","zh":"那种“bodgie”的态度在工作中帮不了你。"}]}],"synonyms":["hooligan","delinquent","troublemaker","lout","punk (informal)"],"phonetic":"/ˈbɑdʒi/","extraExplanation":["“bodgie”常与“widgie”一起出现：bodgie多指当年的“坏小子”，widgie多指相应的“坏女孩/时髦叛逆女孩”。","这个词带有明显的澳新地域与年代色彩（尤其指20世纪50–60年代的青年亚文化），在现代口语里更像是复古或讲历史时用。"]}
{"word":"bodhi","summary":{"en":"Bodhi means Buddhist enlightenment (awakening), and it can also refer to the sacred Bodhi tree linked to the Buddha’s awakening.","zh":"Bodhi 指佛教的“觉悟/菩提”，也可指与佛陀证悟传统相关的“菩提树”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Buddhism) spiritual awakening or enlightenment—seeing reality clearly and becoming free from ignorance.","zh":"（佛教）觉悟、证悟、菩提——看清真实而从无明中解脱的境界。"},"examples":[{"en":"In Buddhism, bodhi is the awakening that ends ignorance and suffering.","zh":"在佛教中，bodhi 指终结无明与痛苦的觉醒。"},{"en":"Meditation is often practiced as a path toward bodhi.","zh":"禅修常被视为通向菩提的一条道路。"}]},{"partOfSpeech":"n.","definition":{"en":"The “Bodhi tree,” the sacred fig tree under which the Buddha is traditionally said to have attained enlightenment.","zh":"菩提树——传说佛陀在其下证悟的神圣榕属无花果树。"},"examples":[{"en":"Pilgrims visit the Bodhi tree in Bodh Gaya, a major Buddhist holy site.","zh":"朝圣者会前往菩提伽耶的菩提树，那是重要的佛教圣地。"},{"en":"A leaf from the Bodhi tree is a common symbol in Buddhist art.","zh":"菩提树叶是佛教艺术中常见的象征。"}]}],"synonyms":["enlightenment","awakening","spiritual awakening"],"phonetic":"ˈboʊdi","extraExplanation":["“bodhi”来自梵语/巴利语，基本义为“觉醒、觉悟”。英语里常直接借用，用来指佛教所说的“菩提（觉悟）”。","在佛教文化语境中，“Bodhi tree（菩提树）”通常指“圣菩提树（Ficus religiosa）”，与佛陀在菩提伽耶证悟的传统叙事相关，因此在宗教、艺术与朝圣中都具有象征意义。"]}
{"word":"bodhi tree","summary":{"en":"a sacred fig tree associated with the Buddha’s enlightenment; a symbol of awakening","zh":"与佛陀悟道相关的神圣无花果树；觉悟的象征"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the sacred fig tree (Ficus religiosa) under which the Buddha is traditionally said to have attained enlightenment; also, any tree regarded as a descendant or symbol of that tree","zh":"菩提树（学名：Ficus religiosa，圣无花果）；传说中佛陀在其下悟道的神圣之树，也可指被视为其后代或象征的菩提树"},"examples":[{"en":"Pilgrims visit the Bodhi tree to meditate and offer prayers.","zh":"朝圣者会来到菩提树下禅修并祈祷。"},{"en":"A cutting from the Bodhi tree was planted near the temple as a symbol of awakening.","zh":"寺庙附近栽种了菩提树的扦插苗，象征觉悟与觉醒。"},{"en":"In many Buddhist artworks, the Bodhi tree appears above the seated Buddha.","zh":"在许多佛教艺术作品中，打坐的佛陀上方常出现菩提树的形象。"}]}],"synonyms":["sacred fig","Ficus religiosa","bo tree"],"phonetic":"/ˈboʊdi triː/","extraExplanation":["“菩提”（bodhi）在佛教语境中常指“觉悟/觉醒（enlightenment）”，因此“菩提树”不仅是一种树，也常被用作“修行与觉悟”的象征。","严格来说，传统所指的菩提树多为“圣无花果”（sacred fig），但在不同地区的汉语文化里，“菩提树”有时也会被借指其他与佛教相关、用于象征的树种。"],"etymology":"“Bodhi”来自梵语 bodhi，意为“觉悟、觉醒”，与“佛陀在树下证悟”的传统故事相关；“Bodhi tree”逐渐成为该树及其象征意义的固定说法。","mnemonic":["把 bodhi 记成“博（bo）地（di）→开阔的心地”，联想到“觉悟、觉醒”。","联想中文“菩提=觉悟”，所以“菩提树”就是“觉悟之树”。"]}
{"word":"Bodhidharma","summary":{"en":"Bodhidharma is the legendary monk credited with helping establish Chan (Zen) Buddhism in China and is a major figure in East Asian Buddhist tradition and folklore.","zh":"菩提达摩是传说中奠定中国禅宗（Zen）传统的重要僧人，也是在东亚佛教文化与民间故事中影响很大的代表人物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Buddhist monk traditionally credited as a key founder of Chan (Zen) Buddhism, who traveled from India (or Central Asia) to China around the 5th–6th century CE.","zh":"菩提达摩（达摩祖师）：传统上被认为是禅宗（日本称“Zen”）的重要奠基者之一，约在公元5—6世纪从印度（或中亚）来到中国弘法的僧人。"},"examples":[{"en":"Bodhidharma is often called the First Patriarch of Chan Buddhism in China.","zh":"菩提达摩常被称为中国禅宗的初祖。"},{"en":"According to tradition, Bodhidharma taught that enlightenment comes through direct experience, not just texts.","zh":"传说中，菩提达摩强调开悟来自直接体验，而不只是研读经典。"}]},{"partOfSpeech":"n.","definition":{"en":"In East Asian culture, a name used in stories, art, and popular legends—especially those linking him to Shaolin and intense meditation practice.","zh":"在东亚文化中常见的传奇人物名号：常出现在故事、绘画与民间传说里，尤其与少林寺及苦修式禅坐的传说相关。"},"examples":[{"en":"You can see paintings of Bodhidharma in many Zen temples.","zh":"在许多禅寺里都能看到菩提达摩的画像。"},{"en":"Some people associate Bodhidharma with Shaolin, though many details are legendary.","zh":"一些人把菩提达摩与少林联系在一起，不过许多细节带有传说色彩。"}]}],"synonyms":["Dharma Master Bodhidharma","Daruma","First Patriarch of Chan"],"phonetic":"/ˌboʊdhiˈdɑːrmə/","extraExplanation":["“Bodhidharma”来自梵语/巴利语体系的译写：Bodhi（觉悟）+ Dharma（法/真理）。中文常称“菩提达摩”，也简称“达摩”。","日本常见的“达摩不倒翁（Daruma doll）”与达摩形象有关：象征坚持、复原力与“立志必成”。传统上许愿时先画一只眼，达成后再补另一只眼。","关于“面壁九年”“一苇渡江”等故事，以及他与少林武术的关系，多为后世传说或文化想象；学习时可把它们理解为表达“专注、毅力、直指人心”的象征叙事。"]}
{"word":"bodhisat","summary":{"en":"“bodhisat” usually refers to (or is a misspelling of) “bodhisattva,” a compassionate figure in Buddhism who seeks enlightenment and helps others.","zh":"“bodhisat”通常指（或是把）“bodhisattva”写错了，意思是佛教中的菩萨：求觉悟并以慈悲帮助众生的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common misspelling) A bodhisattva: in Buddhism, a person who seeks enlightenment and compassionately helps others awaken, often delaying final liberation to assist all beings.","zh":"（常见拼写错误）菩萨：佛教中指发愿求觉悟、以慈悲帮助众生觉醒的人；常被理解为为救度众生而延后成佛（究竟解脱）的人。"},"examples":[{"en":"I think you mean “bodhisattva,” not “bodhisat.”","zh":"你想写的应该是“bodhisattva”，不是“bodhisat”。"},{"en":"In many stories, a bodhisattva chooses compassion over personal peace.","zh":"在许多故事里，菩萨会选择慈悲而不是只追求个人安宁。"}]}],"synonyms":["bodhisattva","saint (figurative)","compassionate helper (figurative)"],"phonetic":"/ˌboʊdiˈsɑːtvə/","extraExplanation":["“bodhisat”通常不是标准英文拼写；标准形式是 **bodhisattva**（也常简写为 **bodhisat** 但较少见，且更容易被当作拼写错误）。","词源来自梵语 *bodhisattva*，大意是“觉（bodhi）+ 有情/众生（sattva）”，常译作“觉有情”，强调以觉悟之心利益众生。","不同佛教传统中对“菩萨”的理解与侧重点会有差异；在日常英语语境中，**bodhisattva**也可比喻“非常无私、乐于助人的人”，但使用时带有宗教文化色彩，适合谨慎。"]}
{"word":"Bodhisatta","summary":{"en":"Bodhisatta is the Pali word for “bodhisattva,” meaning a being (often the Buddha in past lives) who is training toward Buddhahood.","zh":"Bodhisatta 是“bodhisattva（菩萨）”的巴利语形式，指修行走向成佛之道的觉者，常用于上座部语境，亦常特指佛陀成道前的阶段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Buddhism) A being who is on the path to Buddhahood (full awakening), dedicated to attaining enlightenment for the benefit of others; the Pali form of “bodhisattva,” often used in Theravāda Buddhism.","zh":"（佛教）正走在成佛（圆满觉悟）道路上的觉者，发愿修行以成就觉悟并利益众生；为“bodhisattva（菩萨）”的巴利语形式，常见于上座部佛教语境。"},"examples":[{"en":"In Theravāda texts, the Buddha is called a bodhisatta in his previous lives.","zh":"在上座部佛教经典中，佛陀在前世常被称为 bodhisatta（菩萨/未来佛）。"},{"en":"Some stories describe the bodhisatta practicing generosity and patience over many lifetimes.","zh":"有些故事描写 bodhisatta 在许多世中修习布施与忍辱。"}]},{"partOfSpeech":"n.","definition":{"en":"A title for Siddhattha Gotama (the historical Buddha) before he attained enlightenment under the Bodhi tree.","zh":"特指悉达多·乔达摩（历史上的释迦牟尼佛）在菩提树下证悟成佛之前的称呼。"},"examples":[{"en":"Before awakening, the bodhisatta trained with different teachers and practiced deep meditation.","zh":"在觉悟之前，这位 bodhisatta 曾随不同导师学习，并修习深层禅定。"},{"en":"The biography begins with the bodhisatta leaving the palace to seek liberation.","zh":"这部传记从 bodhisatta 离开王宫、寻求解脱写起。"}]}],"synonyms":["bodhisattva","Buddha-to-be","future Buddha"],"phonetic":"ˌboʊdiˈsɑːtə","extraExplanation":["“Bodhisatta”是巴利语拼写；梵语与英语更常见的形式是“bodhisattva”。在许多中文语境里两者都可译作“菩萨”，但在上座部传统中，“bodhisatta”常更强调“未来佛/求觉者”（尚未成佛的阶段），而不是大乘传统中广为人知的菩萨形象。","词源上可理解为“bodhi（觉悟）+ satta（有情/众生）”，即“以觉悟为目标的有情”。在阅读英译佛典时，看到 bodhisatta 往往提示文本背景更偏向巴利三藏或上座部注释文献。"]}
{"word":"Bodhisattva","summary":{"en":"A bodhisattva is (in Mahayana Buddhism) an enlightened being who delays final liberation to help others; the word can also refer to a bodhisattva image in art or, figuratively, a very selfless helper.","zh":"bodhisattva 指（大乘佛教）菩萨：为度众生而延后入涅槃的觉者；也可指菩萨造像，或比喻非常无私助人的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Mahayana Buddhism) a person who seeks full enlightenment but chooses to delay final liberation (nirvana) in order to help all living beings.","zh":"（大乘佛教）菩萨：发愿成佛、追求圆满觉悟，但为了救度众生而延后进入涅槃的人。"},"examples":[{"en":"In Mahayana Buddhism, Avalokiteshvara is a famous bodhisattva known for compassion.","zh":"在大乘佛教中，观世音（Avalokiteshvara）是一位以慈悲著称的著名菩萨。"},{"en":"She spoke of the bodhisattva ideal—putting others’ suffering first.","zh":"她谈到“菩萨精神”——把他人的痛苦放在首位。"}]},{"partOfSpeech":"n.","definition":{"en":"A statue, painting, or other representation of a bodhisattva in Buddhist art.","zh":"（佛教艺术中）菩萨像／菩萨形象（指雕塑、绘画等对菩萨的表现）。"},"examples":[{"en":"The museum displayed a bronze bodhisattva from the Tang dynasty.","zh":"博物馆展出了一尊唐代的青铜菩萨像。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) Someone who is selfless and devoted to helping others.","zh":"（比喻）无私助人的人；“像菩萨一样”的人。"},"examples":[{"en":"People called him a bodhisattva for volunteering every weekend at the shelter.","zh":"人们称他为“菩萨”，因为他每个周末都去收容所做志愿者。"}]}],"synonyms":["enlightened being","Buddhist saint","compassionate helper"],"phonetic":"ˌboʊdiˈsʌtvə","extraExplanation":["词源来自梵语 *bodhisattva*，常被解释为“觉有情/觉悟的众生”（*bodhi*=觉悟；*sattva*=有情/众生/勇士）。英语里多用于介绍大乘佛教思想与人物。","在英文语境中，常见搭配有 **the bodhisattva ideal**（菩萨道/菩萨精神）、**a bodhisattva of compassion**（慈悲的菩萨，如观音），以及艺术史里说 **a bodhisattva figure/statue**（菩萨造像）。","注意与 **Buddha**（佛/已圆满觉悟者）区分：在通俗表述里，bodhisattva 更强调“以度众生为愿”的修行者形象。"]}
{"word":"bodhisattva","summary":{"en":"A bodhisattva is a compassionate figure in Buddhism who seeks enlightenment while dedicating themselves to helping all beings.","zh":"菩萨是佛教中的慈悲修行者，追求觉悟并致力于帮助一切众生。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Buddhism (especially Mahayana Buddhism), a person who seeks enlightenment but chooses to help all living beings first, guided by compassion.","zh":"（佛教，尤指大乘佛教）菩萨：发愿求觉悟，但以慈悲心先帮助一切众生、度众生为先的人。"},"examples":[{"en":"In Mahayana Buddhism, a bodhisattva delays final nirvana to help others awaken.","zh":"在大乘佛教中，菩萨会推迟最终涅槃，以帮助他人觉醒。"},{"en":"Many people honor Avalokiteshvara as a bodhisattva of compassion.","zh":"许多人敬奉观世音（观音）为慈悲的菩萨。"}]},{"partOfSpeech":"n.","definition":{"en":"A title or honorific used for certain enlightened figures or revered beings in Buddhist traditions and art.","zh":"（称号）用于某些被视为觉悟者或受尊崇的佛教人物、艺术形象的称谓。"},"examples":[{"en":"The temple mural shows several bodhisattvas surrounding the Buddha.","zh":"寺庙壁画中描绘了多位菩萨环绕佛陀。"},{"en":"In Buddhist art, a bodhisattva is often depicted wearing ornaments to symbolize engagement with the world.","zh":"在佛教艺术中，菩萨常被画成佩戴璎珞等饰物，以象征入世度众。"}]}],"synonyms":["enlightened being","saint (context-dependent)","compassionate helper (figurative)"],"phonetic":"/ˌboʊdɪˈsɑːtvə/","extraExplanation":["“Bodhisattva”来自梵语 bodhisattva，常被解释为“觉有情/求觉者”。在大乘佛教语境中，核心精神是发菩提心（为自他成就觉悟而发愿）与实践六波罗蜜（如布施、持戒、忍辱等）。","常见相关名称：Avalokiteshvara（观世音/观音）、Manjushri（文殊）、Samantabhadra（普贤）、Ksitigarbha（地藏）。不同文化传统中也会有不同译名与形象。","在英语语境里，这个词有时也被借用来形容“极其利他、富同情心的人”，但正式写作中仍以佛教含义为主，使用时注意尊重宗教语境。"]}
{"word":"bodhisattwa","summary":{"en":"A bodhisattwa (more commonly spelled bodhisattva) is a Buddhist figure devoted to enlightenment and compassionate help for all beings; it can also mean a depiction of such a figure in art.","zh":"bodhisattwa（更常见拼写bodhisattva）指佛教中的“菩萨”：追求觉悟并以慈悲度众的修行者；也可指佛教艺术中的菩萨形象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Buddhism (especially Mahāyāna), a person who seeks enlightenment (Buddhahood) and compassionately vows to help all beings awaken, often delaying final liberation to serve others.","zh":"（佛教，尤指大乘）菩萨：发愿求得觉悟（成佛）并以慈悲帮助众生觉醒的人，常被理解为为了度众而延后个人最终解脱。"},"examples":[{"en":"In Mahāyāna Buddhism, Avalokiteśvara is honored as a great bodhisattwa of compassion.","zh":"在大乘佛教中，观音被尊为慈悲的大菩萨（bodhisattwa）。"},{"en":"She studies the bodhisattwa ideal: wisdom together with kindness toward others.","zh":"她学习“菩萨道”的理想：智慧与对他人的慈悲并行。"}]},{"partOfSpeech":"n.","definition":{"en":"A statue, painting, or other depiction of a bodhisattwa in Buddhist art.","zh":"（佛教艺术中）菩萨像：对菩萨的雕像、绘画或其他形象呈现。"},"examples":[{"en":"The museum displayed a bronze bodhisattwa from the Tang dynasty.","zh":"博物馆展出了一尊唐代铜菩萨像。"}]}],"synonyms":["bodhisattva","bodhisatva","Bodhisatta (Theravāda usage)"],"phonetic":"/ˌboʊdɪˈsɑːtvə/","extraExplanation":["“Bodhisattwa”更常见的英文拼写是“bodhisattva”。两者都源自梵语 bodhisattva（bodhi=觉悟；sattva=有情/众生），中文通常译作“菩萨”。","在不同佛教传统中，“菩萨”有不同侧重：上座部佛教多把bodhisatta（巴利语）用于释迦牟尼佛未成佛前的修行阶段；大乘佛教则强调普遍可行的“菩萨道”（发菩提心、行六度等）。","文化语境提示：在英语语境里，称某人为“a bodhisattva”有时是赞美其非常慈悲、无私，但属于带宗教色彩的比喻，用在日常评价他人时要注意场合与尊重。"]}
{"word":"bodhisatva","summary":{"en":"A bodhisattva is a Buddhist figure or practitioner devoted to enlightenment and compassionately helping all beings.","zh":"bodhisattva（菩萨）指追求觉悟并以慈悲愿力帮助众生的佛教修行者或圣者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Buddhism) A person who seeks enlightenment (Buddhahood) and, in Mahāyāna traditions, vows to help all beings; often also used for an enlightened being who compassionately helps others.","zh":"（佛教）菩萨：追求觉悟（成佛）并立愿利益众生的人；在大乘传统中常指以慈悲救度众生的觉者。"},"examples":[{"en":"In Mahayana Buddhism, a bodhisattva postpones final nirvana to help others.","zh":"在大乘佛教中，菩萨会推迟入最终涅槃，以帮助他人。"},{"en":"Avalokiteśvara is a famous bodhisattva known for compassion.","zh":"观世音（Avalokiteśvara）是以慈悲著称的著名菩萨。"}]}],"synonyms":["bodhisattva","Bodhisattva","enlightened being (contextual)","saint (approx., not exact)"],"phonetic":"/ˌboʊdiˈsɑːtvə/","extraExplanation":["“bodhisatva”更常见的拼写是“bodhisattva”。它来自梵语，词根大意是“觉悟（bodhi）+ 有情/存在（sattva）”，可理解为“觉悟之众生/觉者”。","在不同佛教传统中，“菩萨”侧重点略有不同：上座部多指释迦牟尼成佛前的修行者；大乘则强调菩萨道、六度（布施、持戒、忍辱、精进、禅定、般若）与利益众生的誓愿。"]}
{"word":"Bodi","summary":{"en":"“Bodi” is usually a name (often like “Bodie”); sometimes it’s a misspelling of “body.”","zh":"“Bodi”通常是人名（常与“Bodie”同音）；有时是把“body”误拼了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A given name or surname (a less common spelling; often pronounced like “Bodie”).","zh":"人名或姓氏（较少见的拼写，常与“Bodie”同音）。"},"examples":[{"en":"Bodi is a common nickname in his family.","zh":"Bodi 是他家里常用的昵称。"},{"en":"Ms. Bodi will join the meeting at 3 p.m.","zh":"Bodi 女士将于下午三点参加会议。"}]},{"partOfSpeech":"other","definition":{"en":"In everyday English, people often mean “body” when they write “Bodi” by mistake.","zh":"在日常英语里，有时“Bodi”是把“body”（身体）误拼出来的写法。"},"examples":[{"en":"Did you mean “body,” like “Listen to your body”?","zh":"你是不是想写“body”，比如“倾听你的身体”？﻿"},{"en":"The word “body” can mean your physical body or the main part of a text.","zh":"“body”既可以指身体，也可以指文章的正文部分。"}]}],"synonyms":["Bodie (as a spelling variant)"],"phonetic":"/ˈboʊdi/","extraExplanation":["“Bodi”在英语里不是常见的标准词汇，更常见的是人名拼写（也有人写作Bodie）。如果你本来想查“body”或佛教相关的“Bodhi（菩提）”，告诉我你想要哪一个，我可以给出更准确的词条与例句。"]}
{"word":"bodice","summary":{"en":"A bodice is the fitted upper part of a woman’s dress, or a separate close-fitting garment for the upper body (often in historical fashion).","zh":"bodice 指女装连衣裙腰以上的贴身上身部分，也可指（多见于旧式服装的）单独的紧身上衣/束身式上身衣物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The fitted upper part of a woman’s dress (above the waist), covering the chest and back.","zh":"（女装的）紧身上身／上衣部分；（连衣裙）腰以上的部分，包覆胸部与背部。"},"examples":[{"en":"The dress had a lace bodice and a flowing skirt.","zh":"那件连衣裙有蕾丝上身和飘逸的裙摆。"},{"en":"The tailor adjusted the bodice so it fit more comfortably.","zh":"裁缝把上身部分改了一下，让它穿起来更舒适。"}]},{"partOfSpeech":"n.","definition":{"en":"A separate women’s garment that covers the upper body, similar to a corset or a close-fitting top (more common in historical contexts).","zh":"（旧时较常见的）女式上身衣物；类似束身衣或贴身上衣。"},"examples":[{"en":"In the museum, you can see a 19th-century bodice made of silk.","zh":"在博物馆里你可以看到一件19世纪的丝质上身衣物。"},{"en":"She wore a bodice under the jacket as part of the traditional outfit.","zh":"她在外套里面穿了一件紧身上衣，作为传统服饰的一部分。"}]}],"synonyms":["dress top","upper part (of a dress)","corset (related)","blouse (related)"],"phonetic":"/ˈbɑdɪs/","extraExplanation":["“bodice”常见于服装描述与文学作品（尤其是历史题材、古典小说）中，用来描写连衣裙的结构（如“lace bodice”“buttoned bodice”）。现代日常口语里，如果不是谈裁缝、婚纱礼服或复古服装，更常用“top / blouse / corset”来表达类似概念。"]}
{"word":"bodiced","summary":{"en":"“Bodiced” describes clothing that has a fitted upper part (a bodice), especially dresses.","zh":"“Bodiced”指衣服（尤指连衣裙）带有贴身的上身部分（bodice，紧身上身）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a bodice (the fitted upper part of a dress or women’s garment); describing a dress or top with a distinct, fitted upper section.","zh":"有紧身上身（bodice，连衣裙或女装上衣的贴身上半部分）的；形容带有明显、贴身上身剪裁的衣服。"},"examples":[{"en":"She wore a long, bodiced gown with a full skirt.","zh":"她穿着一件上身贴身、裙摆宽大的长礼服。"},{"en":"The designer showed a bodiced dress inspired by vintage styles.","zh":"设计师展示了一款受复古风格启发、带紧身上身的连衣裙。"},{"en":"A simple bodiced top can look formal with the right accessories.","zh":"一件简洁的贴身上衣搭配合适的配饰也能显得很正式。"}]}],"synonyms":["fitted","corseted","waisted"],"phonetic":"/ˈbɑdɪst/","extraExplanation":["“bodiced”多见于服装描写，尤其是文学、时尚评论或婚礼/舞会礼服语境。bodice 指衣服从肩部到腰部的贴身上身部分，常与“full skirt（蓬裙）”“corset-style（束身式）”“strapless（无肩带）”等搭配。","常见搭配：low-bodiced（低胸上身的）、high-bodiced（高腰/上身较高的）、tight-bodiced（紧身上身的）。"]}
{"word":"bodicemaker","summary":{"en":"A bodicemaker is a dressmaker who makes or alters the bodice (the fitted upper part) of women’s dresses.","zh":"bodicemaker 指制作或修改女装上身（bodice）的女装裁缝（偏旧式用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person (usually a woman in older usage) who makes or alters women’s bodices (the fitted upper part of a dress), or makes women’s clothing as a dressmaker.","zh":"（旧用法中多指女性）制作或修改女装上身（bodice，连衣裙的紧身上衣部分）的人；女裁缝／女装裁缝。"},"examples":[{"en":"In the novel, she earns money as a bodicemaker in a small London shop.","zh":"在小说里，她在伦敦一家小店当女装裁缝赚钱。"},{"en":"The bodicemaker adjusted the bodice so the dress fit better.","zh":"女裁缝把上身部分改了一下，让裙子更合身。"}]}],"synonyms":["dressmaker","seamstress","tailor (for women’s clothing)","needleworker"],"phonetic":"/ˈbɑːdɪsˌmeɪkɚ/","extraExplanation":["这是一个偏历史/文学的词，常见于19世纪到20世纪早期的英国语境。现代英语里更常用 dressmaker（女装裁缝）或 seamstress（女缝纫工）。","bodice 指连衣裙或女装的“上身紧身部分”，因此 bodicemaker 强调做这种上身结构的人；在旧社会中也常与学徒制、成衣店（dress shop）等背景联系在一起。"]}
{"word":"bodicemaking","summary":{"en":"Bodicemaking means making or constructing the bodice (the fitted upper part of a dress), usually as part of sewing or costume-making.","zh":"Bodicemaking 指制作/构造 bodice（连衣裙等女装贴身的上半部分），常见于缝纫与戏服制作语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the craft or activity of making a bodice (the fitted upper part of a dress or women’s garment), especially by sewing and tailoring","zh":"（尤指通过缝纫与裁剪）制作女装上身/紧身胸衣上部（bodice）的工艺或活动"},"examples":[{"en":"She learned bodicemaking in a costume workshop to help create period dresses.","zh":"她在戏服工作室学习 bodicemaking（上身制作），以便制作年代服装。"},{"en":"Bodicemaking requires careful measurements so the garment fits smoothly at the bust and waist.","zh":"Bodicemaking 需要精确量体，才能让衣服在胸围和腰部贴合顺滑。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) the process or stage in dressmaking where the bodice is constructed before attaching the skirt","zh":"（较少见）在制衣流程中，先制作上身（bodice）再连接裙身的那一步/阶段"},"examples":[{"en":"After cutting the fabric, they moved on to bodicemaking before working on the skirt panels.","zh":"裁布之后，他们先进行 bodicemaking，再处理裙片。"}]}],"synonyms":["bodice construction","bodice sewing","dressmaking","patternmaking (related)"],"phonetic":"/ˈbɑdɪsˌmeɪkɪŋ/","extraExplanation":["“bodice”常见于西式女装与历史服装语境（如维多利亚时期、宫廷服饰、戏剧与影视服装）。现代日常服装里更常说“top/upper bodice”或直接说“the top part of the dress”。","“bodicemaking”不是特别高频的通用词，更常在裁缝、服装史、戏服制作（costume making）或手作社群中出现。"]}
{"word":"bodices","summary":{"en":"Bodices are the fitted upper parts of dresses, or fitted women’s tops, especially in formal, historical, or costume contexts.","zh":"bodices 指连衣裙/礼服贴身的上身部分（bodice 的复数），也可指类似紧身上衣的女装，多见于正式、历史或戏服语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of bodice) the fitted upper part of a woman’s dress or gown, covering the torso from the shoulders to the waist.","zh":"（bodice 的复数）女装连衣裙/礼服的贴身上身部分，从肩部到腰部，包裹躯干。"},"examples":[{"en":"The museum displayed Victorian dresses with stiff, structured bodices.","zh":"博物馆展出了维多利亚时期的连衣裙，上身（bodices）挺括而有结构感。"},{"en":"These bodices are embroidered by hand to match the skirts.","zh":"这些上身部分（bodices）是手工刺绣的，用来与裙摆相配。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) women’s fitted tops or vest-like garments, sometimes worn as part of a costume or traditional outfit.","zh":"（较少见）女式紧身上衣/类似马甲的上装，有时作为服装或传统装束的一部分穿着。"},"examples":[{"en":"The dancers wore black bodices over white blouses.","zh":"舞者在白衬衫外穿着黑色紧身上衣（bodices）。"},{"en":"Costume designers often make several bodices for the same character.","zh":"服装设计师常常会为同一角色制作好几件上衣（bodices）。"}]}],"synonyms":["dress tops","corsage (fashion)","upper part (of a dress)"],"phonetic":"/ˈbɑdɪs/","extraExplanation":["“bodice”常见于服装史与文学描写，尤其是欧洲18—19世纪的女装：上身部分通常用鱼骨、系带或扣子来塑形。现代英语里它多出现在婚纱、晚礼服、戏服或复古服装的语境。"]}
{"word":"Bodie","summary":{"en":"Bodie usually refers to a well-known historic ghost town in California; it can also be a surname or given name.","zh":"Bodie通常指加州著名的历史鬼城；也可作为英文姓氏或名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A famous historic ghost town in eastern California, once a booming gold-mining town in the late 1800s.","zh":"（专有名词）美国加州东部著名的历史“鬼城”，19世纪末曾因淘金而繁荣。"},"examples":[{"en":"We visited Bodie to see the preserved buildings and old mining equipment.","zh":"我们去Bodie参观保存完好的老建筑和采矿设备。"},{"en":"Bodie is often described as a classic American ghost town.","zh":"Bodie常被称为典型的美国“鬼城”。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname) or given name used in English-speaking contexts.","zh":"（专有名词）英文里可作姓氏或名字使用。"},"examples":[{"en":"Ms. Bodie will lead the meeting today.","zh":"Bodie女士今天将主持会议。"},{"en":"His last name is Bodie.","zh":"他的姓是Bodie。"}]}],"synonyms":["(as a place) Bodie Ghost Town","Bodie State Historic Park"],"phonetic":"ˈboʊdi","extraExplanation":["Bodie最出名的含义通常指“Bodie State Historic Park（博迪州立历史公园）”。它因金矿热潮而兴起，后来衰落，被加州以“arrested decay（停留在衰败状态）”的方式保存：不刻意翻新，但尽量防止继续损毁，因此看起来更“原汁原味”。","在口语或旅行文章中，提到Bodie时常隐含“西部拓荒/淘金时代”“荒凉”“被遗弃的小镇”等文化意象。"]}
{"word":"bodied","summary":{"en":"“Bodied” is an adjective mostly used in compounds (able-bodied, full-bodied) meaning “having a certain body/build,” “physically fit,” or “rich in flavor.”","zh":"“bodied”多作复合形容词的一部分（如 able-bodied、full-bodied），表示“具有某种体格/体型”“身体健全”或“（口感）醇厚浓郁”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a particular type of body or physical build; often used after an adverb (e.g., well-, strong-).","zh":"（常与副词连用）具有某种体型或体格的；有某种“身材/体态”的。"},"examples":[{"en":"He is well-bodied and athletic.","zh":"他体格健壮，很有运动员的感觉。"},{"en":"The statue shows a strong-bodied figure.","zh":"这尊雕像呈现出一个体格强健的人物形象。"}]},{"partOfSpeech":"adj.","definition":{"en":"Physically fit and healthy; able to work (commonly in the phrase “able-bodied”).","zh":"身体健康、能劳动的（常见于短语“able-bodied”）。"},"examples":[{"en":"The program is for able-bodied adults and people with disabilities.","zh":"该项目面向健全成年人以及残障人士。"},{"en":"Only able-bodied passengers were asked to help.","zh":"只请身体健全的乘客协助。"}]},{"partOfSpeech":"adj.","definition":{"en":"Rich and full in taste and texture (usually in “full-bodied,” especially for wine or coffee).","zh":"（口感）浓郁醇厚的（多用于“full-bodied”，常形容葡萄酒或咖啡）。"},"examples":[{"en":"I prefer a full-bodied red wine.","zh":"我更喜欢口感醇厚的红葡萄酒。"},{"en":"This coffee is dark and full-bodied.","zh":"这款咖啡深烘、风味醇厚。"}]}],"synonyms":["built","well-built","physically fit","healthy","robust","full-flavored"],"phonetic":"/ˈbɑdid/","extraExplanation":["“bodied”很少单独使用，最常见是在复合形容词里：able-bodied（身体健全的）、full-bodied（醇厚的/浓郁的）、thick-bodied（浓稠的，常用于液体或饮品）。","写作中，“-bodied”也可用于更文学化的描述，例如 describing a “soft-bodied creature”（软体生物，如蛞蝓、章鱼等），但日常英语更常用具体名词（soft-bodied animals）。"]}
{"word":"bodier","summary":{"en":"“Bodier” means “more full-bodied”—richer, thicker, and having a heavier mouthfeel.","zh":"“Bodier”表示“更饱满/更醇厚（酒体更足）”，口感更浓、更厚实。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"comparative of “bodied” (having body); having more body—i.e., a thicker, fuller, richer texture or taste (often used for wine, coffee, beer, soup, sauces, etc.).","zh":"“bodied”的比较级；（口感/质地）更有“厚度/酒体/饱满度”的，更浓厚、更醇厚（常用于葡萄酒、咖啡、啤酒、汤、酱汁等）。"},"examples":[{"en":"This roast is bodier than the light one, with a heavier mouthfeel.","zh":"这款烘焙比浅烘更醇厚，口感更厚实。"},{"en":"I prefer a bodier red wine in winter.","zh":"冬天我更喜欢酒体更饱满的红酒。"},{"en":"Simmer it longer to get a bodier sauce.","zh":"多炖一会儿，让酱汁更浓稠、更有“厚度”。"}]}],"synonyms":["more full-bodied","fuller-bodied","richer","thicker"],"phonetic":"/ˈbɑːdiər/","extraExplanation":["“bodier”在日常书面语里不算特别常见，更常见的表达是“more full-bodied / fuller-bodied / richer”。在品酒/咖啡品鉴里，“body（酒体/厚度）”指喝起来的重量感、黏稠感与饱满度，不等同于“strong（酒精度高/味道重）”。"]}
{"word":"bodieron","summary":{"en":"“Border on” means “almost be (often in a negative way)” or “be next to/touch a place.”","zh":"“border on”表示“几乎（常带负面评价）”或“与某地接壤/紧邻”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to be very close to a particular (often negative) quality or situation; to almost be that thing","zh":"几乎具有某种（常带负面）特质；几乎到了某种程度"},"examples":[{"en":"His comments border on rude.","zh":"他的话几乎算是无礼。"},{"en":"The weather is cold, bordering on freezing.","zh":"天气很冷，几乎到结冰的程度。"},{"en":"Her confidence borders on arrogance.","zh":"她的自信几乎到了傲慢的程度。"}]},{"partOfSpeech":"phrase","definition":{"en":"to touch or share a border with a place; to be next to it","zh":"与某地接壤；紧邻某地"},"examples":[{"en":"Canada borders on the United States.","zh":"加拿大与美国接壤。"},{"en":"The park borders on the river.","zh":"公园紧挨着那条河。"}]}],"synonyms":["verge on","be close to","be adjacent to","adjoin"],"phonetic":"/ˈbɔrdɚ ɑn/","extraExplanation":["你输入的“bodieron”不是常见英文单词，最可能是把短语 **border on**（“几乎；接壤”）拼错了。","**border on + 名词/动名词** 很常用来委婉表达批评：比如 *border on cruel*（几乎残忍）、*border on illegal*（几乎违法）。语气比直接说 *is cruel/illegal* 更缓和。"]}
{"word":"bodies","summary":{"en":"“Bodies” usually means more than one body (physical form). It can also mean dead bodies, organized groups (public bodies, student body), or the main part of something.","zh":"“Bodies”通常是“身体”的复数；也可指“遗体/尸体”、组织团体（公共机构、学生团体等）或某物的主体部分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “body”: the physical form of a person or animal; the whole physical structure.","zh":"“body”的复数：人或动物的身体；整体的躯体结构。"},"examples":[{"en":"After the long hike, their bodies were tired and sore.","zh":"走完长途徒步后，他们的身体又累又酸。"},{"en":"Exercise helps keep our bodies healthy.","zh":"运动有助于让我们的身体保持健康。"}]},{"partOfSpeech":"n.","definition":{"en":"Dead bodies; the remains of people or animals who have died (often used in serious news or official contexts).","zh":"尸体；遗体（常用于新闻或正式语境）。"},"examples":[{"en":"Rescuers searched the area for bodies after the earthquake.","zh":"地震后，救援人员在该地区搜寻遗体。"},{"en":"The police found two bodies near the river.","zh":"警方在河边发现了两具尸体。"}]},{"partOfSpeech":"n.","definition":{"en":"Groups of people acting together as an organization (e.g., a governing, professional, or decision-making group).","zh":"团体；机构；组织（如政府机构、专业团体或决策团体）。"},"examples":[{"en":"Several public bodies regulate food safety.","zh":"多个公共机构负责监管食品安全。"},{"en":"Student bodies often vote on campus rules.","zh":"学生团体常常就校园规定进行投票。"}]},{"partOfSpeech":"n.","definition":{"en":"The main part of something (not the top, edge, or outside), especially in writing or objects.","zh":"主体部分（尤指文章的正文或物体的主要部分）。"},"examples":[{"en":"Put the key in the body of the email, not the subject line.","zh":"把关键信息写在邮件正文里，不要只写在主题里。"},{"en":"The guitar’s body is made of wood.","zh":"这把吉他的琴身是木制的。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of “body” (rare): to give something a physical form; to make an idea real and visible.","zh":"“body”的第三人称单数（较少用）：使某物具象化；让想法变得具体可见。"},"examples":[{"en":"The film bodies the writer’s fears into a vivid story.","zh":"这部电影把作者的恐惧具象化成一个生动的故事。"}]}],"synonyms":["forms","physiques","remains","organizations","groups"],"phonetic":"/ˈbɑdiz/","extraExplanation":["“body”作“尸体”时比“corpse”更常见、更中性；“corpse”更强调“尸体”本身，语气更冷、更医学/法医化。","“public bodies”常见于英式/正式语境，指“公共机构/政府机关”；“student body”是固定搭配，指“全体学生”。"]}
{"word":"bodies in motion","summary":{"en":"moving people or objects; often used to describe active movement or a busy flow","zh":"运动中的人或物体；也可形容人群忙碌流动的场景"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"People or physical objects that are moving; moving bodies (often used in science or descriptive writing).","zh":"运动中的人或物体；运动的物体（常用于科学或描写性表达）。"},"examples":[{"en":"In physics class, we studied the forces acting on bodies in motion.","zh":"在物理课上，我们学习了作用在运动物体上的力。"},{"en":"The camera tracked the bodies in motion across the stage.","zh":"摄影机跟拍了舞台上移动的人影。"}]},{"partOfSpeech":"phrase","definition":{"en":"A figurative way to describe a busy, shifting situation where many people are actively moving, working, or changing positions.","zh":"（比喻）形容人群忙碌流动、局势不断变化，很多人都在行动或调动。"},"examples":[{"en":"At rush hour, the station becomes a sea of bodies in motion.","zh":"在高峰期，车站变成一片流动的人海。"},{"en":"During the festival, the streets were full of bodies in motion from morning to night.","zh":"节日期间，街道从早到晚都挤满了流动的人群。"}]}],"synonyms":["moving bodies","moving objects","people on the move","a moving crowd","a sea of people","hustle and bustle","constant movement"],"phonetic":"/ˈbɑdiz ɪn ˈmoʊʃən/","extraExplanation":["在物理里常见相关表述：a body in motion（运动的物体）。与牛顿第一定律相关的经典句式是：除非有外力作用，运动的物体会保持匀速直线运动。日常写作中用 bodies in motion，会更偏“画面感”：很多身体/人影在移动。"],"etymology":"源自英语中“body（物体/身体）+ in motion（处于运动中）”的组合表达；在物理语境里常与牛顿运动定律、力与运动的讨论一起出现，后来也被借用到描写人群流动与忙碌场景。","mnemonic":["把它拆开记：bodies（很多“身体/物体”）+ in motion（在运动）= “很多东西在动”。","联想中文“人潮涌动/车水马龙”，就是 bodies in motion 的画面感。"]}
{"word":"bodig","summary":{"en":"“Bodig” is not a standard English word; it’s likely a misspelling or a proper name.","zh":"“bodig”不是标准英语单词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a name (e.g., a username, surname, or brand).","zh":"不是标准英语单词。更可能是拼写错误，或是姓名/网名/品牌名等专有名词。"},"examples":[{"en":"I couldn’t find “bodig” in an English dictionary—did you mean another word?","zh":"我在英文词典里找不到“bodig”——你是不是想写另一个词？"},{"en":"Please check the spelling of “bodig” before using it in your essay.","zh":"在作文中使用“bodig”之前，请先检查拼写。"}]}],"phonetic":"/ˈboʊdɪɡ/","extraExplanation":["“bodig”常见于拼写输入错误。你可能想查：\n1) bodega（小杂货店/酒窖）\n2) boding（预兆；不祥的预感）\n3) bodily（身体的；肉体地）\n4) bodice（女上衣的紧身胸衣部分）\n\n如果你告诉我语境（例如一句话或你想表达的中文意思），我可以帮你准确定位正确单词并给出用法。"]}
{"word":"bodikin","summary":{"en":"A bodkin is usually a small sharp tool for piercing or threading; in older use it can mean a hairpin or small dagger, and historically it can also mean a pointed arrowhead.","zh":"bodkin通常指用于打孔或穿引的尖头小工具；在较古老的用法中也可指簪子或小匕首；历史语境下还可指一种尖细的箭头。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, sharp, pointed tool used for making holes (for example in leather) or for threading ribbon/cord through a hole","zh":"锥子；穿孔针（用于在皮革等材料上打孔，或把带子/绳子穿过孔）"},"examples":[{"en":"She used a bodkin to punch neat holes in the leather strap.","zh":"她用锥子在皮带上打出整齐的孔。"},{"en":"Use a bodkin to pull the elastic through the waistband.","zh":"用穿孔针把松紧带穿过裤腰。"}]},{"partOfSpeech":"n.","definition":{"en":"(old-fashioned) a long pin for fastening hair or clothing; sometimes a small dagger-like blade","zh":"（旧式）簪子；长别针（有时也指像小匕首一样的尖刃）"},"examples":[{"en":"In the old portrait, her hair is held in place with a silver bodkin.","zh":"在那幅旧画像里，她用一根银簪固定头发。"},{"en":"The museum displayed an antique bodkin used as a decorative hairpin.","zh":"博物馆展出了一枚古老的簪子，用作装饰性发针。"}]},{"partOfSpeech":"n.","definition":{"en":"a type of narrow, pointed arrowhead (especially in historical contexts)","zh":"（史）一种细长尖锐的箭头（bodkin箭头）"},"examples":[{"en":"Some medieval armies used bodkin arrowheads to pierce armor.","zh":"一些中世纪军队使用bodkin箭头来穿透盔甲。"}]}],"synonyms":["awl","piercer","hairpin (old use)","stiletto (old use)"],"phonetic":"/ˈbɑːdkɪn/","extraExplanation":["你输入的“bodikin”更常见的拼写是 **bodkin**。","“bodkin”在英语文学中很有名：莎士比亚《哈姆雷特》里有句 **“When he himself might his quietus make / With a bare bodkin”**，常被理解为“用一把（或一根）光秃秃的尖刃/匕首结束生命”。这里的“bodkin”带有“尖锐小刀/匕首”的古义。"]}
{"word":"bodiless","summary":{"en":"Bodiless means “without a physical body,” often used for voices, spirits, or unseen presences in stories.","zh":"Bodiless 意为“没有实体的、无形的”，常用于形容故事中的声音、灵体或看不见的存在。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no physical body; not made of matter; spiritual or ghost-like.","zh":"没有实体的；无形的；（像灵魂、幽灵一样）非肉身的。"},"examples":[{"en":"In the story, a bodiless voice whispers in the dark hallway.","zh":"在故事里，一个无形的声音在黑暗的走廊里低语。"},{"en":"Some people describe the soul as a bodiless part of a person.","zh":"有些人把灵魂描述为人身上无形的部分。"},{"en":"The poem imagines a bodiless spirit drifting above the sea.","zh":"这首诗想象一个无形的幽灵飘浮在海面上。"}]}],"synonyms":["incorporeal","immaterial","disembodied","unseen","spiritual"],"phonetic":"/ˈbɑːdiləs/","extraExplanation":["“bodiless”常用于文学、宗教或恐怖题材中，搭配如“bodiless voice / presence / spirit”（无形的声音/存在/灵体），强调“看不见、摸不着，但似乎存在”。","词形结构：body（身体）+ -less（没有……的）。类似构词还有“homeless”（无家可归的）、“endless”（无尽的）。"]}
{"word":"bodilessly","summary":{"en":"“Bodilessly” means ‘in a bodiless, unseen way,’ often used in literary or spooky contexts.","zh":"“bodilessly”表示“以无形、没有身体的方式”，常用于文学或带神秘/惊悚氛围的语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is without a body; as a spirit, voice, or presence not seen in physical form.","zh":"以无身体的方式；像灵魂、声音或一种看不见的存在那样。"},"examples":[{"en":"In the story, she seemed to speak bodilessly from the dark hallway.","zh":"在故事里，她仿佛从黑暗的走廊里以无形之身说话。"},{"en":"A bodilessly whispered warning made the scene feel eerie.","zh":"一个无形的低声警告让场景显得诡异。"}]}],"synonyms":["disembodiedly","spiritually","incorporeally"],"phonetic":"/ˈbɑdiˌlɛsli/","extraExplanation":["“bodilessly”多见于文学、恐怖/奇幻叙事或诗歌中，用来营造“看不见却能感到”的氛围。日常口语里更常用的表达是“like a ghost / as a disembodied voice（像幽灵/像无来源的声音）”。","词形构成：bodiless（无身体的）+ -ly（副词后缀）。相关词：bodiless（adj. 无形的）、disembodied（adj. 脱离身体的；常用于“disembodied voice”）。"]}
{"word":"bodilessness","summary":{"en":"Bodilessness means the state of having no physical body, or the sense/idea of being detached from the body.","zh":"Bodilessness 指“没有实体身体的状态”，也可指“与身体/物质现实脱离的无体感或观念”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or quality of having no physical body; being without a material form.","zh":"无形无体的状态；没有物质身体的性质。"},"examples":[{"en":"In the story, the ghost’s bodilessness lets it pass through walls.","zh":"在故事里，幽灵的无体性让它能穿墙而过。"},{"en":"Some religions describe the soul’s bodilessness after death.","zh":"一些宗教会描述灵魂在死后的无体状态。"}]},{"partOfSpeech":"n.","definition":{"en":"The feeling or idea of being detached from the body or physical reality (often used in philosophy, spirituality, or literary writing).","zh":"与身体或物质现实脱离的感觉或观念（常用于哲学、灵性或文学语境）。"},"examples":[{"en":"Meditation sometimes gave her a sense of bodilessness, as if she were floating.","zh":"冥想有时让她产生一种无体感，仿佛自己在漂浮。"},{"en":"The novel uses bodilessness to show how lonely the narrator feels.","zh":"这部小说用“无体感”来表现叙述者的孤独。"}]}],"synonyms":["incorporeality","disembodiment","immateriality","bodiless state"],"phonetic":"/ˈbɑːdiləsnəs/","extraExplanation":["词源与构词：bodilessness 来自形容词 bodiless（无身的、无形的）+ 名词后缀 -ness（表示“……的状态/性质”）。","语域提示：该词较少用于日常口语，更常见于文学描写（如鬼魂、灵体）、宗教/灵性讨论（灵魂）、或哲学语境（心灵与身体的关系）。日常表达里更常用 without a body / disembodied（无实体的）。"]}
{"word":"bodiliness","summary":{"en":"Bodiliness means the state or quality of being physical—having a body—often contrasted with the spiritual or mental.","zh":"Bodiliness 指“身体性/肉体性”，强调有形的身体存在，常与精神或心理层面对比。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of having a physical body; physical nature rather than spiritual or mental nature","zh":"身体性；肉体性（强调有形的身体特质，与精神或心理层面相对）"},"examples":[{"en":"The novel explores the tension between spirituality and bodiliness.","zh":"这部小说探讨了灵性与身体性之间的张力。"},{"en":"After the illness, she became more aware of her own bodiliness.","zh":"生病之后，她更强烈地意识到自身的身体性。"}]}],"synonyms":["physicality","corporeality","materiality"],"phonetic":"/ˈbɑːdilinəs/","extraExplanation":["“bodiliness”来自形容词“bodily”（身体的）+ 名词后缀“-ness”（……的状态/性质），因此常用于较正式或学术的语境，尤其在人文、宗教研究、哲学、文学批评中讨论“身体/肉身”与“心灵/灵魂”的关系。","日常英语里更常说“physicality”（身体感/身体特质）或直接说“the body / being physical”。“bodiliness”带一点强调“肉身性/具身性”的味道。"]}
{"word":"bodilize","summary":{"en":"Bodilize means (rarely) to give something a physical form—to make an abstract idea concrete.","zh":"Bodilize（罕用）指使某物具象化、赋予其有形的实体，把抽象概念变得具体。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(rare) To give something a physical body or form; to make an idea become real and concrete (similar to “embody”).","zh":"（罕用）使……具象化、使……成为有形的实体；让抽象概念变得具体可感（类似 embody“体现/使具体化”）。"},"examples":[{"en":"The artist tried to bodilize her feelings in clay.","zh":"这位艺术家试图用黏土把自己的感受具象化。"},{"en":"Myth stories often bodilize nature as gods and spirits.","zh":"神话故事常把自然力量具象化为诸神与精灵。"}]}],"synonyms":["embody","materialize","incarnate","personify"],"phonetic":"/ˈbɑdəˌlaɪz/","extraExplanation":["“bodilize”在现代英语中非常少见，写作与阅读中更常用的是“embody”（体现/使具体化）或“personify”（拟人化）。如果你是在作业或正式写作中使用，通常建议改用更常见的词。","词形上可理解为 body（身体）+ -ize（使……化/使成为……），所以字面意思就是“使成为有身体的东西”。"]}
{"word":"bodily","summary":{"en":"“Bodily” means “related to the body” (adj.) or “in a physical way” (adv.), often used in formal or medical/legal contexts.","zh":"“bodily”表示“与身体有关的”（形容词）或“在身体上/以身体方式”（副词），常见于正式、医学或法律语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to the body (physical rather than mental or emotional).","zh":"与身体有关的；肉体的（偏身体层面，而非心理或情感层面）。"},"examples":[{"en":"The medicine may cause bodily harm if taken incorrectly.","zh":"如果服用不当，这种药可能会造成身体伤害。"},{"en":"After the accident, he had no serious bodily injuries.","zh":"事故之后，他没有严重的身体伤害。"},{"en":"Meditation can relax the mind and ease bodily tension.","zh":"冥想可以放松心灵，缓解身体紧张。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a physical way; in the body (often used in formal or legal contexts).","zh":"以身体方式；在身体上（常用于较正式或法律语境）。"},"examples":[{"en":"The disease affects the patient bodily as well as mentally.","zh":"这种疾病在身体上和精神上都会影响患者。"},{"en":"He was shaken bodily by the cold wind.","zh":"冷风让他身体直打颤。"}]}],"synonyms":["physical","corporeal","somatic","in person","physically"],"phonetic":"/ˈbɑdəli/","extraExplanation":["“bodily”在法律英语里很常见，尤其是“bodily harm / bodily injury（人身伤害）”，强调对身体造成的损害，和“mental harm（精神伤害）”相对。","常见搭配：bodily functions（身体机能/生理功能）、bodily fluids（体液）、bodily pain（躯体疼痛）、bodily autonomy（身体自主权）。"]}
{"word":"bodily exercise","summary":{"en":"physical activity for fitness and health","zh":"用于健康与体能的身体活动（锻炼）"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Physical activity done to improve or maintain health, fitness, strength, or flexibility.","zh":"为改善或保持健康、体能、力量或柔韧性而进行的身体活动（体育锻炼）。"},"examples":[{"en":"Doctors often recommend regular bodily exercise to reduce stress and improve sleep.","zh":"医生常建议规律进行身体锻炼，以减轻压力并改善睡眠。"},{"en":"Even ten minutes of bodily exercise a day can make a difference.","zh":"即使每天十分钟的身体锻炼也能带来变化。"},{"en":"He balanced study with bodily exercise, like walking and stretching.","zh":"他在学习之余也安排身体锻炼，比如散步和拉伸。"}]}],"synonyms":["physical exercise","exercise","workout","physical activity","training","conditioning"],"phonetic":"/ˈbɑdɪli ˈɛksərˌsaɪz/","extraExplanation":["“bodily exercise”偏正式、书面一些；日常更常说“exercise”或“physical exercise”。","在一些宗教或古典语境中，“bodily exercise”有时用于对比“spiritual exercise/mental discipline”（灵性操练/心智修养），强调“只针对身体层面”的锻炼。"],"etymology":"“bodily”来自古英语，意为“身体的”；“exercise”来自拉丁语exercitium，原意与“训练、操练”相关。合起来“bodily exercise”字面是“身体上的练习”，常用来指“体育锻炼”。","mnemonic":["把“bodily”理解成“body + -ly（……地/……的）”，就是“身体的”；“bodily exercise”=“身体的练习”=“体育锻炼”。","联想“exercise（锻炼）”和中文“练（liàn）”：每天练一点，就是身体更强。"]}
{"word":"bodiment","summary":{"en":"“Bodiment” is usually a misspelling; the standard word is “embodiment,” meaning a clear example or person/thing that represents an idea or quality.","zh":"“bodiment”通常是拼写错误；标准用法是“embodiment”，指某种观念或品质的体现/化身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly a misspelling) The correct word is usually “embodiment”: a person, thing, or example that clearly shows an idea, quality, or feeling.","zh":"（常见拼写错误）通常应为“embodiment”：指一个人/事物/例子，能清楚地体现某种观念、品质或情感。"},"examples":[{"en":"She is the embodiment of kindness.","zh":"她是善良的化身。"},{"en":"The festival is an embodiment of local culture.","zh":"这个节日体现了当地文化。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic) “bodiment” can appear as an old shortened form related to “embodiment,” but it is not standard in modern English.","zh":"（罕见/古旧用法）“bodiment”有时会作为与“embodiment”相关的旧式缩略写法出现，但在现代英语中不规范、不常用。"},"examples":[{"en":"In modern writing, use “embodiment” instead of “bodiment.”","zh":"在现代写作中，用“embodiment”，不要用“bodiment”。"}]}],"synonyms":["embodiment","incarnation","representation","personification","expression"],"phonetic":"/ɪmˈbɑdimənt/","extraExplanation":["“embodiment”来自“embody”（使具体化、体现）+ 名词后缀“-ment”。常用于抽象概念：kindness（善良）、hope（希望）、freedom（自由）等。","易混词：\n- “embody” (vt.) 体现/使具体化：The story embodies traditional values.\n- “embodiment” (n.) 化身/体现：an embodiment of courage。\n“bodiment”在现代英语里很少见，使用它可能会被当作拼写错误。"]}
{"word":"Bodine","summary":{"en":"Bodine is most commonly a surname (and sometimes a given name); it can also be used as a U.S. place name in some contexts.","zh":"Bodine 最常见是姓氏（有时也可作名字）；在某些语境中也可能是美国地名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname); also used as a given name in some English-speaking contexts.","zh":"姓氏（家族姓）；在一些英语语境中也可用作名字。"},"examples":[{"en":"My neighbor’s last name is Bodine.","zh":"我邻居的姓是 Bodine。"},{"en":"The email was addressed to Dr. Bodine.","zh":"这封邮件是写给 Bodine 博士的。"}]},{"partOfSpeech":"other","definition":{"en":"a place name in the U.S. (used for small communities/areas), depending on context.","zh":"（视语境而定）美国的地名之一，可指小型社区/地区。"},"examples":[{"en":"They drove through Bodine on their way to the next town.","zh":"他们去下一个城镇的路上开车经过了 Bodine。"}]}],"phonetic":"/boʊˈdiːn/","extraExplanation":["Bodine 通常作为专有名词出现（人名或地名），因此在写作中一般首字母大写。","如果你是在书里、电影里或某个地区看到 Bodine，它很可能指特定人物/家族或当地地名；提供更多上下文（句子或地点）我可以帮你判断具体指什么。"]}
{"word":"boding","summary":{"en":"“Boding” means a feeling or sign that something bad is likely to happen, or describes something that seems ominous.","zh":"“boding”指对坏事将发生的（不祥）预感，也可形容某事物看起来不祥、像在预示不幸。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feeling that something bad is going to happen; a sense of impending trouble","zh":"（不祥的）预感；觉得坏事将要发生的感觉"},"examples":[{"en":"I had a boding that the trip would not go smoothly.","zh":"我有种不祥的预感，这趟旅程不会太顺利。"},{"en":"Her sudden silence filled me with boding.","zh":"她突然的沉默让我心里升起不祥的预感。"}]},{"partOfSpeech":"adj.","definition":{"en":"suggesting that something bad may happen; ominous","zh":"预示不幸的；不祥的（= ominous）"},"examples":[{"en":"Dark clouds gave a boding look to the sky.","zh":"乌云让天空显得很不祥。"},{"en":"He spoke in a boding tone, as if he knew bad news was coming.","zh":"他说话的语气很不祥，仿佛知道坏消息要来了。"}]}],"synonyms":["foreboding","premonition","omen","presentiment","ominous"],"phonetic":"/ˈboʊdɪŋ/","extraExplanation":["“boding”常见于较文学或正式的语境，日常口语里更常说：I have a bad feeling. 或 It feels ominous.","词源上与“forebode（预示，预感）”有关；“foreboding”比“boding”更常见，意思几乎相同，都是“（对坏事的）预感/不祥的预兆”。","文学作品中常用来营造悬疑或灾难将至的气氛，例如：a sense of boding / a boding atmosphere。"]}
{"word":"bodingly","summary":{"en":"“Bodingly” means “in an ominous, warning way,” often hinting that something bad may happen.","zh":"“bodingly”表示“以不祥、带警示意味的方式”，常暗示可能会发生坏事。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that suggests something bad is going to happen; ominously.","zh":"以预示不祥的方式；不祥地；凶兆地。"},"examples":[{"en":"Dark clouds gathered bodingly over the town.","zh":"乌云以不祥的姿态聚集在小镇上空。"},{"en":"He spoke bodingly about what might happen if they ignored the warning.","zh":"他不祥地谈到：如果他们无视警告，可能会发生什么。"}]}],"synonyms":["ominously","threateningly","darkly"],"phonetic":"/ˈboʊdɪŋli/","extraExplanation":["“bodingly”来自动词“bode”（预示、预兆）。在现代英语里，“bodingly”比较少见，更常用的表达是“ominously”（不祥地）或短语“in an ominous way”。","相关词：foreboding（n./adj. 预感不祥；不祥的预感）。例如：“a sense of foreboding”（一种不祥的预感）。"]}
{"word":"bodings","summary":{"en":"“Bodings” usually means feelings or signs that something (often bad) will happen.","zh":"“bodings”通常指对将发生之事（多为不祥之事）的预感或征兆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually plural) A feeling, sign, or warning that something (often something bad) is going to happen; a foreboding.","zh":"（通常用复数）对将要发生之事（多指不祥之事）的预感、征兆或警示；不祥预感。"},"examples":[{"en":"She had dark bodings about the trip, but went anyway.","zh":"她对这次旅行有不祥的预感，但还是去了。"},{"en":"The sudden silence in the room filled him with bodings.","zh":"房间里突然安静下来，让他心生不祥预感。"},{"en":"Despite these bodings, the team stayed calm and prepared.","zh":"尽管有这些不祥预感，团队仍保持冷静并做好准备。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A prediction or message about what will happen in the future (can be good or bad).","zh":"（较少见）对未来将发生之事的预言或预告（可好可坏）。"},"examples":[{"en":"In old stories, travelers listened for bodings from birds and dreams.","zh":"在古老故事里，旅行者会从鸟鸣和梦境中寻找预兆。"}]}],"synonyms":["forebodings","premonitions","omens","portents","warnings"],"phonetic":"/ˈboʊdɪŋz/","extraExplanation":["“bodings”来自动词“bode”（预示、预兆），现代英语里更常见的是“foreboding(s)”或“a bad feeling”。“bodings”带一点文学/古风色彩，常用于营造阴郁、悬疑的氛围。"]}
{"word":"bodken","summary":{"en":"“Bodken” is usually a misspelling/old spelling of “bodkin”: a small sharp tool, an old-fashioned hairpin, or (archaically) a dagger.","zh":"“bodken”通常是“bodkin”的旧拼写或误拼：可指穿孔用的尖锥/穿引针、旧式发簪，或（古义）小匕首。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, sharp-pointed tool (like an awl) used for making holes in leather, fabric, or wood, or for threading things through","zh":"（bodkin 的常见义）一种小而尖的工具（类似锥子/穿孔针），用于在皮革、布料或木头上打孔，或用于穿引细物"},"examples":[{"en":"She used a bodkin to punch holes in the leather strap.","zh":"她用穿孔锥在皮带上打孔。"},{"en":"A bodkin can help you thread elastic through a waistband.","zh":"穿引针（bodkin）可以帮助你把松紧带穿过裤腰。"}]},{"partOfSpeech":"n.","definition":{"en":"a long hairpin or hair needle used to hold hair in place (more common in older or literary use)","zh":"（较旧/文学用法）一种长发簪/发针，用来固定发髻或头发"},"examples":[{"en":"In the old painting, her hair is held up with a silver bodkin.","zh":"在那幅古画里，她用一支银发簪固定头发。"}]},{"partOfSpeech":"n.","definition":{"en":"(archaic) a small dagger or stiletto","zh":"（古义）一种小匕首/细长短剑（stiletto）"},"examples":[{"en":"The story mentions a hidden bodkin in his sleeve.","zh":"故事里提到他袖子里藏着一把小匕首。"}]}],"synonyms":["awl","pick","hairpin","stiletto","dagger"],"phonetic":"/ˈbɑd.kɪn/","extraExplanation":["“bodken”更常见是“bodkin”的旧拼写或误拼。最著名的文学提及来自莎士比亚《哈姆雷特》独白：\"...with a bare bodkin\"，这里的 bodkin 常被理解为“匕首/短剑”，但在更广泛的历史语境里也可指“尖锥/穿孔针”。"]}
{"word":"Bodkin","summary":{"en":"Bodkin is an old-fashioned word for a small dagger, or a pointed tool/pin used for piercing or fastening hair.","zh":"Bodkin 是一个带古风色彩的词，可指小匕首，也可指用于穿孔的锥针/穿线工具，或旧称的发簪（长发针）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, pointed dagger or stiletto (an old-fashioned word)","zh":"（旧用语）小匕首；细长尖刀（类似短剑/刺剑）"},"examples":[{"en":"In the old story, the thief carried a bodkin in his boot.","zh":"在那个古老的故事里，小偷在靴子里藏着一把小匕首。"},{"en":"Shakespeare wrote about a “bare bodkin.”","zh":"莎士比亚写过“bare bodkin（光秃秃的匕首）”。"}]},{"partOfSpeech":"n.","definition":{"en":"a pointed tool like a large needle, used for piercing holes (especially in leather) or for threading ribbons and cords","zh":"锥针；穿孔针（如用于皮革打孔，或把带子/绳子穿过孔洞的工具）"},"examples":[{"en":"She used a bodkin to pierce a small hole in the leather strap.","zh":"她用锥针在皮带上戳了一个小孔。"},{"en":"A bodkin can help thread a ribbon through a narrow casing.","zh":"锥针能帮助把丝带穿过很窄的布套通道。"}]},{"partOfSpeech":"n.","definition":{"en":"a long pin used to fasten hair (an older word for a hairpin)","zh":"（旧称）发簪；长发针"},"examples":[{"en":"Her hair was held up with a silver bodkin.","zh":"她用一根银色发簪把头发盘了起来。"}]}],"synonyms":["dagger","stiletto","awl","piercer","hairpin"],"phonetic":"/ˈbɑd.kɪn/","extraExplanation":["“bodkin”属于带有古风色彩的词，现代更常用 dagger（匕首）、awl（锥子/打孔器）、hairpin（发夹/发卡）等来表达具体含义。","文学典故：在《哈姆雷特》“To be, or not to be”独白中，Shakespeare写到“a bare bodkin”，常被理解为“用匕首自尽”的意象，因此这个词在文学语境里常带一点戏剧性或古典气息。"]}
{"word":"bodkin","summary":{"en":"A bodkin is usually a small pointed tool for sewing/threading; in older or literary use, it can also mean a small dagger.","zh":"bodkin 通常指缝纫用的尖头小工具（穿带针/锥子）；在较古老或文学语境中也可指小匕首。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, pointed tool (often metal) used for making holes, sewing, or threading a ribbon/elastic through fabric","zh":"锥子；穿带针（常为金属，用于戳孔、缝纫，或把丝带/松紧带穿过布料）"},"examples":[{"en":"She used a bodkin to thread the elastic through the waistband.","zh":"她用穿带针把松紧带穿过裤腰。"},{"en":"In a simple sewing kit, a bodkin can be as useful as a needle.","zh":"在简单的针线包里，穿带针和缝针一样实用。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) a small dagger or stiletto-like weapon","zh":"（历史用法）匕首；短剑（类似细长的刺刀）"},"examples":[{"en":"The guard searched him for a bodkin before letting him enter.","zh":"守卫在放他进去前搜身，检查有没有匕首。"},{"en":"In older texts, “bodkin” can refer to a concealed dagger.","zh":"在较古老的文本中，“bodkin”有时指藏匿的匕首。"}]}],"synonyms":["awl","stiletto","dagger","threader"],"phonetic":"/ˈbɑd.kɪn/","extraExplanation":["在文学里最有名的例子来自莎士比亚《哈姆雷特》里“bare bodkin”（直译“赤裸的匕首”），用来象征用刀结束生命的念头，因此在阅读古典作品时看到 bodkin，常需要结合语境判断是“工具”还是“匕首”。","词源上，bodkin 与中古英语里表示“小尖刺/小刀”的词有关；后来在日常生活中更常见的是“缝纫穿带工具”的意思。"]}
{"word":"bodkins","summary":{"en":"Bodkins are small pointed tools (or, in older usage, small daggers).","zh":"Bodkins 指尖头小工具（较旧用法也可指小匕首）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small pointed tool (often metal), used for piercing holes, threading ribbon through fabric, or other fine work (such as sewing or bookbinding)","zh":"（bodkin）一种细长尖头小工具（常为金属），用于戳孔、穿带、做精细手工（如缝纫、装订等）"},"examples":[{"en":"She used a bodkin to pull the ribbon through the waistband.","zh":"她用穿带针把丝带穿过裤腰。"},{"en":"A bodkin can help you make neat holes in leather for lacing.","zh":"穿孔针能帮助你在皮革上打出整齐的孔，方便穿绳。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) a small dagger or stiletto-like weapon","zh":"（历史用法）一种小匕首；细刺剑式的短刃武器"},"examples":[{"en":"In older texts, a bodkin may refer to a small dagger.","zh":"在较早的文本中，bodkin 可能指一把小匕首。"},{"en":"The character was described as carrying a bodkin under his cloak.","zh":"书中描写这个角色把一把小匕首藏在斗篷下。"}]}],"synonyms":["awl","skewer","stiletto (older weapon sense)","dagger (older weapon sense)"],"phonetic":"/ˈbɑdkɪn/","extraExplanation":["“Bodkins”是复数形式，单数是“bodkin”。现代更常见的是“bodkin”指手工用的尖头小工具。","文学提示：莎士比亚《哈姆雷特》著名独白中有“bare bodkin”（意为“匕首/短刃”）的用法，因此在文学语境里常带有“匕首”含义。","相关古语/固定表达：\"by my bodkin\" 是一种古老的轻度誓言或口头禅（类似“我发誓/天哪”），现在多见于戏剧或仿古文风。"]}
{"word":"bodkinwise","summary":{"en":"An archaic adverb meaning “point-first, like a bodkin; as if stabbing straight ahead.”","zh":"一个古语副词，表示“像bodkin那样尖端朝前、仿佛直刺般向前”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in the manner of a bodkin (a small dagger or pointed tool); point-first, as if stabbing or thrusting straight ahead (archaic).","zh":"像“bodkin（小匕首/尖锥）”那样；尖端朝前、仿佛直刺或直冲的方式（古语）。"},"examples":[{"en":"The spear went bodkinwise through the hanging cloth.","zh":"长矛尖端朝前，像匕首直刺般穿过垂挂的布料。"},{"en":"In old tales, the knight rode bodkinwise into the press of enemies.","zh":"在古老的故事里，骑士像尖刺般直冲敌阵。"}]}],"synonyms":["point-first","straightforwardly (in a thrusting way)","dagger-like (figurative)"],"phonetic":"/ˈbɑd.kɪnˌwaɪz/","extraExplanation":["“-wise”在这里表示“以……方式/方向”，类似于 lengthwise（纵向地）、clockwise（顺时针地）。bodkinwise 是较古老、文学色彩浓的用法，现代英语中非常少见，读到时多半出现在古文体、戏剧或仿古写作里。","bodkin 原指一种尖状工具（如穿孔用的锥子），也可指小匕首。莎士比亚《哈姆雷特》中有著名的“with a bare bodkin”（用一把裸露的匕首/短刀）一语，因此 bodkin 也常带有“匕首、利刃”的联想。"]}
{"word":"bodle","summary":{"en":"“Bodle” is an old Scottish word for a tiny coin, and it can also mean a very small amount of money.","zh":"“bodle”是旧时苏格兰用语，原指小面值硬币，也可指“很少的钱”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small Scottish copper coin used in the past; by extension, a very small amount of money","zh":"（旧时）苏格兰的一种小面值铜币；引申为“一点点钱、很少的钱”"},"examples":[{"en":"I wouldn’t give a bodle for that old gadget.","zh":"那台旧小玩意儿不值几个钱。"},{"en":"He didn’t have a bodle left after the trip.","zh":"旅行之后他几乎一分钱都不剩了。"}]}],"synonyms":["a pittance","next to nothing","small change","a penny (approx.)"],"phonetic":"/ˈboʊd(ə)l/","extraExplanation":["“bodle”是苏格兰英语里的历史用词，常见于较旧的文学作品或带有苏格兰色彩的表达中。它原指一种很小的铜币（大约相当于“两便士苏格兰币”的价值），因此后来常被用作夸张说法，表示“几乎不值钱/一点点钱”。","在现代日常英语中很少使用；如果你想表达“很少的钱”，更常见的说法有：“a penny / a dime / next to nothing / hardly anything”。"]}
{"word":"Bodleian","summary":{"en":"Bodleian refers to Oxford’s famous Bodleian Library (or to things connected with it).","zh":"Bodleian 指牛津大学著名的博德利图书馆，或与其相关的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Bodleian Library (the main research library of the University of Oxford) or to Sir Thomas Bodley, its founder","zh":"与牛津大学博德利图书馆（Bodleian Library，牛津大学主要研究型图书馆）或其创建者托马斯·博德利爵士有关的"},"examples":[{"en":"She spent the afternoon in the Bodleian reading room.","zh":"她在博德利图书馆的阅览室里待了一下午。"},{"en":"The Bodleian collections include rare manuscripts and early printed books.","zh":"博德利馆藏包括珍稀手稿和早期印刷书籍。"}]},{"partOfSpeech":"n.","definition":{"en":"the Bodleian Library itself (often used with “the”: the Bodleian)","zh":"博德利图书馆本馆（常与 the 连用：the Bodleian）"},"examples":[{"en":"We toured the Bodleian during our visit to Oxford.","zh":"我们去牛津参观时游览了博德利图书馆。"},{"en":"Researchers applied for access to the Bodleian.","zh":"研究人员申请进入博德利图书馆查阅资料。"}]}],"synonyms":["the Bodleian Library","Oxford University Library system"],"phonetic":"/bɑːdˈliːən/","extraExplanation":["“Bodleian”来自创建者 Sir Thomas Bodley（托马斯·博德利爵士）的姓氏。日常使用中，人们常说“the Bodleian”来指代整个图书馆系统或主馆。","它是英国重要的“法定送存图书馆”（legal deposit library）之一：在英国出版的书通常需要按规定送存到包括博德利在内的指定图书馆，因此馆藏极其丰富。","发音提示：重音通常在第二音节（boh-DLEE-ən）。"]}
{"word":"bodleian","summary":{"en":"Bodleian refers to Oxford’s famous main research library (the Bodleian Library) or something connected to it.","zh":"Bodleian 指牛津大学著名的博德利图书馆，或与该馆相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Bodleian Library, the main research library of the University of Oxford in England","zh":"博德利图书馆（英国牛津大学的主要研究图书馆）"},"examples":[{"en":"I spent the afternoon reading in the Bodleian.","zh":"我下午在博德利图书馆阅读。"},{"en":"The manuscript is held at the Bodleian Library in Oxford.","zh":"这份手稿收藏在牛津的博德利图书馆。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to the Bodleian Library","zh":"与博德利图书馆有关的"},"examples":[{"en":"She used Bodleian archives for her thesis.","zh":"她为论文查阅了博德利图书馆的档案。"},{"en":"Bodleian collections include many rare books.","zh":"博德利图书馆的馆藏包括许多珍本。"}]}],"synonyms":["the Bodleian Library","Oxford University Library (context)"],"phonetic":"/bɑdˈliːən/","extraExplanation":["“Bodleian”源自创办/复兴该馆的托马斯·博德利爵士（Sir Thomas Bodley）。日常英语里常把它简称为“the Bodleian”。","它是英国著名的“法定送存”（legal deposit）图书馆之一：按规定，英国出版物需送存到指定图书馆，因此馆藏极其庞大。","在英国文化与文学语境中，the Bodleian常被用来象征“严肃学术研究”“古老的书香氛围”，并常出现在以牛津为背景的作品与游记中。"]}
{"word":"Bodley","summary":{"en":"“Bodley” usually refers to Sir Thomas Bodley, whose name is strongly associated with Oxford’s Bodleian Library; it can also be a surname or an informal reference to the library in context.","zh":"“Bodley”通常指托马斯·博德利爵士，并常与牛津大学的博德利图书馆联系在一起；也可作姓氏，或在语境中非正式地指该图书馆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Sir Thomas Bodley (1545–1613), an English diplomat and scholar best known for refounding and endowing the Bodleian Library at the University of Oxford.","zh":"托马斯·博德利爵士（1545–1613），英国外交家与学者，因重建并资助牛津大学博德利图书馆而最为著名。"},"examples":[{"en":"Sir Thomas Bodley used his fortune to rebuild Oxford’s library, which became the Bodleian.","zh":"托马斯·博德利爵士用自己的财富重建了牛津的图书馆，后来发展为博德利图书馆。"},{"en":"In a lecture on library history, the professor mentioned Bodley’s impact on collecting books for public study.","zh":"在一堂关于图书馆史的课上，教授提到博德利对公共学术藏书的重要影响。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname; sometimes used informally as a short way to refer to the Bodleian Library (context-dependent).","zh":"姓氏；在特定语境中也可能被非正式地用来指代“博德利图书馆”（需看上下文）。"},"examples":[{"en":"She booked a seat at the Bodley to consult rare manuscripts.","zh":"她在“博德利”预约了座位，去查阅珍稀手稿。"},{"en":"Bodley is a well-known name in Oxford because of the Bodleian Library.","zh":"在牛津，“Bodley”是个很有名的名字，因为有博德利图书馆。"}]}],"synonyms":["Sir Thomas Bodley","the Bodleian (context)","the Bodley (informal, context)"],"phonetic":"/ˈbɑːdli/","extraExplanation":["“Bodley”常与牛津大学的 Bodleian Library（博德利图书馆）紧密相关。该馆是英国最重要的学术图书馆之一，也是“法定送存图书馆”（legal deposit library）体系的一部分，出版物可依法送存入馆。","相关词：Bodleian（形容词，意为“博德利图书馆的/与之相关的”）；the Bodleian / the Bodley（口语中指博德利图书馆）。","另有 The Bodley Head（博德利之首），英国知名出版社名称；与图书与出版领域的文化背景有关。"]}
{"word":"Bodmin","summary":{"en":"Bodmin is a town in Cornwall, southwest England, near Bodmin Moor.","zh":"Bodmin 是英国英格兰西南部康沃尔郡的一座城镇，靠近博德明荒原。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A town in Cornwall, in southwest England, known historically as a county town and as a gateway to Bodmin Moor.","zh":"英国英格兰西南部康沃尔郡的一座城镇，历史上曾是郡的重要行政中心，也常被视为通往博德明荒原（Bodmin Moor）的门户。"},"examples":[{"en":"We stopped in Bodmin for lunch before driving onto the coast.","zh":"我们在博德明吃了午饭，然后开车去海边。"},{"en":"Bodmin is close to Bodmin Moor, a popular area for hiking.","zh":"博德明靠近博德明荒原，是很受欢迎的徒步地区。"}]}],"phonetic":"/ˈbɑd.mɪn/","extraExplanation":["Bodmin 位于康沃尔郡内陆，地名常被认为与康沃尔语/凯尔特语背景有关；在当地历史叙事中，它与圣佩特罗克（St Petroc）的宗教传统、以及曾经的行政与司法功能联系紧密。","学习用法提示：作为专有名词，Bodmin 通常不加冠词（不说 *the Bodmin*）。常见搭配有 Bodmin Moor（博德明荒原）、Bodmin Jail（博德明监狱，旅游景点之一）。"]}
{"word":"Bodnar","summary":{"en":"Bodnar is mainly a family name, historically linked to the cooper (barrel-maker) occupation in some Slavic languages.","zh":"Bodnar 主要是一个姓氏，词源上与部分斯拉夫语言中的“桶匠/制桶工”职业有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name), most common in Eastern and Central Europe (especially Ukrainian/Polish/Slovak backgrounds) and among their descendants","zh":"一个姓氏（家族姓），常见于东欧与中欧背景（尤其乌克兰/波兰/斯洛伐克）及其移民后代中"},"examples":[{"en":"My teacher’s last name is Bodnar.","zh":"我老师的姓是 Bodnar。"},{"en":"You’ll see the name Bodnar in some Ukrainian-American communities.","zh":"在一些乌克兰裔美国人社区里能见到 Bodnar 这个姓。"}]},{"partOfSpeech":"n.","definition":{"en":"(by origin) a name historically connected to the occupation of making or repairing barrels (a cooper)","zh":"（词源）历史上与“制桶/修桶的工匠”（桶匠，cooper）这一职业有关的姓氏"},"examples":[{"en":"The surname Bodnar originally referred to a cooper in some Slavic languages.","zh":"在一些斯拉夫语言中，Bodnar 这个姓最初指“桶匠”。"},{"en":"Many occupational surnames—like Bodnar—started as job labels.","zh":"很多职业姓氏——比如 Bodnar——一开始都来自工作称呼。"}]}],"phonetic":"/ˈbɑdnɑr/","extraExplanation":["Bodnar 通常作为姓氏使用，不是英语里的常用词汇；在正式场合可写作 “Mr./Ms. Bodnar”。","这个姓在不同国家/移民社群中可能出现拼写或发音差异；在英语环境里常被读作 /ˈbɑdnɑr/（重音在第一音节）。"]}
{"word":"Bodo","summary":{"en":"Bodo most commonly refers to an Indigenous ethnic group in Northeast India and their language; it can also be an adjective meaning “related to the Bodo people/language.”","zh":"Bodo 通常指印度东北部的博多族及其语言；也可作形容词，表示“与博多族/博多语相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an Indigenous ethnic group mainly living in Assam and nearby areas in Northeast India","zh":"博多族（主要居住在印度东北部阿萨姆邦及周边地区的原住民族群成员）"},"examples":[{"en":"Many Bodo people live in Assam in Northeast India.","zh":"许多博多族人居住在印度东北部的阿萨姆邦。"},{"en":"She is Bodo, and her family celebrates Bodo cultural festivals.","zh":"她是博多族人，她的家人会庆祝博多族的文化节日。"}]},{"partOfSpeech":"n.","definition":{"en":"the Sino-Tibetan language spoken by the Bodo people (also called Boro)","zh":"博多语（博多族使用的汉藏语系语言，也常称 Boro）"},"examples":[{"en":"He can speak Bodo and Assamese.","zh":"他会说博多语和阿萨姆语。"},{"en":"This book has short stories in Bodo.","zh":"这本书收录了博多语的短篇故事。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Bodo people or their language and culture","zh":"与博多族（或其语言、文化）有关的"},"examples":[{"en":"They performed a Bodo dance at the school event.","zh":"他们在学校活动上表演了博多族舞蹈。"},{"en":"She is studying Bodo history and literature.","zh":"她在研究博多族的历史与文学。"}]}],"synonyms":["Boro (for the language/name variant)"],"phonetic":"/ˈboʊdoʊ/","extraExplanation":["“Bodo”在英语里通常是专有名词，指族群、语言或相关文化；写作时常首字母大写（Bodo）。","博多语在印度具有一定官方地位（如在阿萨姆邦的部分地区使用），常见书写系统包括天城文（Devanagari）等。不同资料里也会见到“Boro”这一名称。"]}
{"word":"bodo","summary":{"en":"Bodo refers to an ethnic group in northeastern India and the language they speak.","zh":"Bodo 指印度东北部的博多族（波罗族）以及他们使用的博多语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Bodo (also spelled Boro) ethnic group, mainly living in Assam and nearby areas in northeastern India","zh":"博多族／波罗族（也作 Boro），主要居住在印度东北部阿萨姆邦及周边地区的民族成员"},"examples":[{"en":"Many Bodo communities live in Assam in northeastern India.","zh":"许多博多族社区生活在印度东北部的阿萨姆邦。"},{"en":"She is Bodo, and her family celebrates local festivals in their village.","zh":"她是博多族人，她的家人在村里庆祝当地的节日。"}]},{"partOfSpeech":"n.","definition":{"en":"the Bodo language, a Tibeto-Burman language spoken in northeastern India","zh":"博多语（Bodo language），一种藏缅语系语言，主要在印度东北部使用"},"examples":[{"en":"He can speak Bodo and Assamese.","zh":"他会说博多语和阿萨姆语。"},{"en":"The book includes short stories translated from Bodo.","zh":"这本书收录了从博多语翻译的短篇故事。"}]}],"synonyms":["Boro"],"phonetic":"/ˈboʊdoʊ/","extraExplanation":["“Bodo”常见作专有名词使用，指民族或语言；在书面表达中也常见拼写“Boro”。","博多族在印度东北部具有重要的地区文化影响；学习相关词汇时，常会一起看到“Assam（阿萨姆邦）”“Assamese（阿萨姆语）”等地名与语言名。"]}
{"word":"Bodo-related","summary":{"en":"“Bodo-related” means connected with the Bodo people, their language, or their culture.","zh":"“Bodo-related”指与博多民族、博多语或其文化相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with the Bodo people, their language, or their culture (mainly in Northeast India, especially Assam).","zh":"与博多（Bodo）民族、博多语或其文化有关的（主要分布在印度东北部，尤以阿萨姆邦为主）。"},"examples":[{"en":"The museum has a new exhibit on Bodo-related textiles and traditional dress.","zh":"博物馆新增了一个关于博多相关纺织品与传统服饰的展览。"},{"en":"She is doing research on Bodo-related festivals in Assam.","zh":"她正在研究阿萨姆邦的博多相关节日。"},{"en":"The book includes a short chapter on Bodo-related vocabulary and pronunciation.","zh":"这本书包含一章简短内容，介绍博多相关词汇与发音。"}]}],"synonyms":["Bodo","Bodo-linked","Bodo-associated","connected to the Bodo people"],"phonetic":"/ˈboʊdoʊ rɪˌleɪtɪd/","extraExplanation":["“Bodo”通常指印度东北部的博多族（Bodo people）以及他们的语言“博多语”（Bodo language）。在新闻或学术写作中，“Bodo-related”常用于指与博多族政治、社会议题、文学艺术、语言保护等有关的事物。","写作时也可用更具体的表达来替换，例如：Bodo culture（博多文化）、Bodo language education（博多语教育）、Bodo community issues（博多社群议题），会比“Bodo-related”更清晰。"]}
{"word":"bodock","summary":{"en":"“Bodock” usually means the Osage-orange tree or its hard wood; it can also mean the tree’s bumpy green fruit.","zh":"“bodock”通常指奥塞奇橙树或其坚硬木材；也可指这种树结的疙瘩状绿色果实。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tree (Osage orange) and its very hard, heavy wood, often used for fence posts or traditional bows (common in the southern U.S.; also spelled “bodark”).","zh":"（美国南部常用）奥塞奇橙（又称“奥色橙”、美洲橙）这种树及其坚硬致密的木材，常用来做栅栏柱或传统弓（也常拼作 bodark）。"},"examples":[{"en":"In Texas, people still use bodock wood for fence posts because it lasts a long time.","zh":"在德州，人们至今还用 bodock 木材做栅栏柱，因为它特别耐用。"},{"en":"He made a bow from bodock, a wood known for strength and spring.","zh":"他用 bodock 做了一把弓，这种木材以坚韧、有弹性而出名。"}]},{"partOfSpeech":"n.","definition":{"en":"the green, bumpy fruit of the Osage-orange tree (sometimes called a “hedge apple”).","zh":"奥塞奇橙树结的绿色、表皮疙瘩状的果实（有时俗称“hedge apple/树篱苹果”）。"},"examples":[{"en":"The yard was littered with bodocks that had fallen from the tree.","zh":"院子里到处都是从树上掉下来的 bodock 果实。"}]}],"synonyms":["bodark","bois d’arc","Osage orange","hedge apple"],"phonetic":"ˈboʊdɑrk","extraExplanation":["“bodock/bodark”多见于美国口语与地方用法，来源常被认为与法语词组 *bois d’arc* 有关，意思是“弓木”（*wood of the bow*），因为这种木材传统上适合制作弓。","拼写不统一：bodock、bodark、bodarc 都可能出现；正式写法更常见的是 **Osage orange**（树名）或 **bois d’arc**（地域用名）。"]}
{"word":"Bodoni","summary":{"en":"Bodoni is a modern serif typeface famous for dramatic thick–thin contrast and an elegant, fashion-forward look.","zh":"Bodoni 是一种现代衬线字体，以强烈的粗细对比和优雅、偏时尚的视觉风格著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A modern serif typeface (font family) known for strong contrast between thick and thin strokes and very thin, straight serifs; often used in fashion, invitations, and elegant headlines.","zh":"一种现代衬线字体（字体家族），特点是粗细笔画对比强烈、衬线细且笔直；常用于时尚品牌、请柬与优雅的标题排版。"},"examples":[{"en":"The magazine uses Bodoni for its cover titles to look stylish and high-end.","zh":"这本杂志用 Bodoni 做封面标题，看起来更时髦、更高级。"},{"en":"For long paragraphs, Bodoni can be harder to read because of its high contrast.","zh":"用于长段落时，Bodoni 因为粗细对比太强，可能会更难阅读。"},{"en":"The wedding invitation was set in Bodoni with lots of white space.","zh":"婚礼请柬用 Bodoni 排版，并留了很多留白。"}]}],"synonyms":["Didone","Didot","modern serif"],"phonetic":"/bəˈdoʊni/","extraExplanation":["Bodoni 以意大利印刷家兼字体设计师 Giambattista Bodoni（詹巴蒂斯塔·博多尼，1740–1813）命名，属于“Didone（迪多体）/现代衬线体”风格（与 Didot 同一类）。","这种字体在大字号标题里非常有“时尚/奢华”气质，但在小字号或低分辨率屏幕上，细线容易“糊”或断裂，因此正文阅读性可能不如一些旧式衬线体（如 Garamond）。"]}
{"word":"bodoni","summary":{"en":"Bodoni is a high-contrast modern serif typeface (and the name of the Italian typographer it’s named after).","zh":"Bodoni 指一种粗细对比强烈的现代衬线字体，也指其同名的意大利字体/印刷家博多尼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a modern serif typeface with strong contrast between thick and thin strokes, often used in fashion, book titles, and elegant design","zh":"（一种）现代衬线字体：粗细笔画对比强烈，常用于时尚、书名与强调优雅感的设计"},"examples":[{"en":"The magazine uses Bodoni for headlines to create a luxury feel.","zh":"这本杂志用 Bodoni 做标题，营造奢华感。"},{"en":"Try Bodoni for a short title, but choose a simpler font for long paragraphs.","zh":"短标题可以试试 Bodoni，但长段落更适合用更易读的字体。"}]},{"partOfSpeech":"n.","definition":{"en":"Giambattista Bodoni (1740–1813), an Italian printer and typographer whose work inspired the Bodoni typeface","zh":"博多尼（Giambattista Bodoni，1740–1813）：意大利印刷家与字体设计者，Bodoni 字体以他命名"},"examples":[{"en":"Bodoni’s printing work influenced later ‘modern’ serif fonts.","zh":"博多尼的印刷作品影响了后来的“现代”衬线字体。"}]}],"synonyms":["Didot","modern serif","Didone (style)"],"phonetic":"/bəˈdoʊni/","extraExplanation":["Bodoni 通常被归类为“现代衬线体（modern serif）”或“Didone”风格（与 Didot 等字体同类）：笔画粗细反差大、竖画更强调、衬线更细更直，因此在大字号时非常有戏剧性，但小字号或低分辨率屏幕上可能显得偏“刺”、可读性下降。","在设计语境里，人们说“use Bodoni”多半指“使用 Bodoni 这类风格的字体”或某个数码版本（不同字体厂商的 Bodoni 细节可能略有差异）。"]}
{"word":"bodonid","summary":{"en":"“Bodonid” is a linguistic term meaning “related to the Bodo people/language,” or the group of languages closely related to Bodo.","zh":"“Bodonid”是语言学用语，表示“与博多族/博多语相关”，也可指与博多语近缘的一组语言（博多语支）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Bodo people or to the Bodo (Boro) language and closely related languages","zh":"与博多族（Bodo）有关的；与博多语（Boro）及其近缘语言有关的"},"examples":[{"en":"Bodonid languages are spoken mainly in Northeast India.","zh":"博多语支（Bodonid）的语言主要分布在印度东北部。"},{"en":"She is studying Bodonid grammar for her fieldwork.","zh":"她在为田野调查学习博多语支的语法。"}]},{"partOfSpeech":"n.","definition":{"en":"a member of a group (branch) of closely related Tibeto-Burman languages, especially those connected to Bodo","zh":"（语言学）博多语支；指与博多语相关的一组近缘汉藏语系（藏缅语族）语言"},"examples":[{"en":"Some scholars classify Kokborok as a Bodonid language.","zh":"一些学者将科克博罗克语（Kokborok）归为博多语支语言。"},{"en":"The paper compares several Bodonid varieties across the region.","zh":"这篇论文比较了该地区几种博多语支的语言变体。"}]}],"synonyms":["Bodo-related","Bodo–Garo (in some classifications)"],"phonetic":"/ˈboʊdoʊnɪd/","extraExplanation":["“Bodonid”多见于语言学文献中，用来指博多语（Boro/Bodo）及其近缘语言所构成的一个分支；在不同学者的分类体系里，归属与范围可能略有差异。","相关地区文化背景：博多族主要分布在印度阿萨姆邦等东北地区；因此在阅读涉及印度东北民族与语言的资料时更容易遇到该词。"]}
{"word":"bodrag","summary":{"en":"“Bodrag” is not a common English word; it’s likely a typo or a proper name/rare term.","zh":"“bodrag”不是常见英语单词；更可能是拼写错误或专有名词/罕见用语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is likely a misspelling, a name, or a niche term.","zh":"不是常见英语词典中的标准单词；更可能是拼写错误、人名/地名，或非常小众的术语。"},"examples":[{"en":"I couldn’t find “bodrag” in the dictionary—could it be a typo?","zh":"我在词典里找不到“bodrag”——会不会是拼错了？"},{"en":"Can you share the full sentence where you saw “bodrag”?","zh":"你能把看到“bodrag”的完整句子发出来吗？"}]}],"phonetic":"ˈboʊdræɡ","extraExplanation":["“bodrag”最常见的情况是拼写误差。你可以检查是否想写：\n- body drag（字面：拖拽身体；也可能出现在救援/训练语境）\n- bow drag（弓形拖拽/船首阻力；较技术化）\n- bedrag（荷兰语，意为“欺骗/背叛”）\n\n如果你把它出现的句子、领域（游戏/医学/工程/人名地名等）或截图发来，我可以更准确判断并给出对应释义与用法。"]}
{"word":"bodrage","summary":{"en":"“Bodrage” is not a standard English word; it is most likely a misspelling of “barrage,” meaning a sudden, heavy, continuous series of things (or to attack with many at once).","zh":"“bodrage”不是标准英语单词；很可能是把“barrage”拼错了，意思是“密集的一连串”，也可作动词表示“（用大量事物）猛攻/轰击”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended word) a large number of things (often questions, criticisms, or attacks) happening quickly one after another; a concentrated “storm” of something.","zh":"（很可能你想查的词）一连串密集发生的事情（常指问题、批评或攻击）；“连珠炮式”的一阵。"},"examples":[{"en":"After the announcement, the company faced a barrage of questions from reporters.","zh":"公告发布后，公司面对记者连珠炮式的提问。"},{"en":"He received a barrage of criticism online.","zh":"他在网上遭到一波密集的批评。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Likely intended word) to attack or hit someone/something with many things at once (questions, bullets, emails, etc.).","zh":"（很可能你想查的词）用大量事物同时“猛攻/轰击”（如提问、子弹、邮件等）。"},"examples":[{"en":"Fans barraged the singer with requests for photos.","zh":"粉丝们用合影请求“围攻”那位歌手。"},{"en":"The customer service team was barraged with complaints during the outage.","zh":"系统中断期间，客服团队被投诉“轰炸”。"}]}],"synonyms":["onslaught","storm","flood","stream","volley"],"phonetic":"/bəˈrɑʒ/","extraExplanation":["“bodrage”并不是常见的英语单词拼写；它很可能是把 **barrage** 拼错了。","**barrage** 来自法语，原义与“拦截/炮火掩护”有关，所以现代用法常带有“密集、连续不断”的感觉。","如果你其实想查的是别的词（例如 **borage** 一种植物，或其他专有名词/人名），可以告诉我句子语境，我能更准确判断。"]}
{"word":"Bodrogi","summary":{"en":"Bodrogi is most commonly a Hungarian surname used as a proper name.","zh":"Bodrogi 最常见用法是匈牙利姓氏，作为专有名词使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Hungarian surname (family name).","zh":"一个匈牙利姓氏（家族姓）。"},"examples":[{"en":"Dr. Bodrogi will speak at the conference tomorrow.","zh":"博德罗吉博士将于明天在会议上发言。"},{"en":"I met someone named Bodrogi at the university.","zh":"我在大学里遇到过一个姓博德罗吉的人。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) used as an attributive name to refer to something connected to a person or family called Bodrogi.","zh":"（较少见）作定语使用，指与名为“Bodrogi”的人或家族相关的事物。"},"examples":[{"en":"The Bodrogi papers are kept in the local archive.","zh":"博德罗吉家族的文献保存在当地档案馆。"},{"en":"She cited the Bodrogi study in her report.","zh":"她在报告中引用了博德罗吉的研究。"}]}],"phonetic":"/boʊˈdroʊɡi/","extraExplanation":["“Bodrogi”多见于匈牙利语环境，常见读音大致为“BOH-droh-ghee”。它可能与匈牙利的地名/水名“Bodrog（博德罗格河）”相关，带有“来自某地（或与某地有关）”的姓氏来源色彩。","在英文文本里，它通常作为专有名词使用：首字母大写，不加冠词（不说 *a Bodrogi*，除非强调“一个姓Bodrogi的人”）。"]}
{"word":"bods","summary":{"en":"“Bods” is an informal plural meaning either people’s bodies (especially appearance) or people (mainly British).","zh":"“bods”是非正式复数，可指人的身体（尤指外形），也可指“人/家伙们”（主要见于英式英语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Plural of “bod”: a person’s body, especially when talking casually about how it looks (often in British English).","zh":"（非正式）“bod”的复数：指人的身体，尤指随口谈论外形（常见于英式英语）。"},"examples":[{"en":"He’s been working out to get a better bod.","zh":"他一直在健身，想把身材练得更好。"},{"en":"The magazine talked about “beach bods” for summer.","zh":"那本杂志在谈“夏日海滩身材”。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, British) Plural of “bod”: a person; people (often used in a light, friendly way).","zh":"（非正式，英式）“bod”的复数：人；家伙们（常带轻松、友好的语气）。"},"examples":[{"en":"There were a few bods waiting outside the store.","zh":"店外有几个人在等着。"},{"en":"Some bods at work suggested we go for coffee.","zh":"公司里有几个人提议去喝咖啡。"}]}],"synonyms":["bodies","people","guys","folks"],"phonetic":"/bɑdz/","extraExplanation":["“bod(s)”在口语里更常见于英式英语；美式英语里也能见到，但更常用的是“body/bodies”或“people/guys”。","“bod”常出现在大众媒体与流行文化里，尤其是谈外形的表达，如“beach bod（海滩身材）”“dad bod（爸爸身材，指不太健壮但也不胖的普通中年男性身材）”。使用时注意语境，避免在正式场合或对他人外貌进行冒犯性评论。"]}
{"word":"bodstick","summary":{"en":"“bodstick” is not a common standard English word; it’s likely a typo or a proper name. Context is needed to identify the intended word.","zh":"“bodstick”不是常见的标准英语词；很可能是拼写错误或专有名词，需要语境才能判断你想表达的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is likely a misspelling or a name/brand. Common nearby possibilities include “Bostik” (a glue/adhesive brand) or “bodkin” (a small pointed tool/large blunt needle).","zh":"不是常见英语词典中的标准词；很可能是拼写错误，或是人名/品牌名。比较接近的可能是“Bostik”（胶水/粘合剂品牌）或“bodkin”（尖锥/粗针等工具）。"},"examples":[{"en":"I can’t find “bodstick” in a standard dictionary—did you mean “Bostik” (glue) or “bodkin” (a tool)?","zh":"我在常见词典里找不到“bodstick”——你是不是想写“Bostik”（胶水）或“bodkin”（工具）？"},{"en":"If you share the sentence where you saw “bodstick,” I can help identify the correct word.","zh":"如果你把看到“bodstick”的原句发我，我可以帮你确认正确的词。"}]}],"extraExplanation":["“bodstick”本身不太像固定英语词：它可能是拼写误差（打字漏字/换位），也可能是专有名词（品牌、用户名、姓氏）。","如果你想查的是“Bostik”，它是常见的粘合剂品牌名；如果是“bodkin”，更偏文学/手工语境，指尖锥或粗针一类的工具（例如穿带、编织、做皮具时用）。","把你看到它的上下文（整句、领域：五金/手工/游戏/品牌等）发来，我可以按语境给出最准确的词条和用法。"]}
{"word":"Bodwell","summary":{"en":"Bodwell is usually a proper noun: most commonly a surname, and sometimes part of place or school names.","zh":"Bodwell 通常是专有名词：最常见为姓氏，也可用于地名或学校等机构名称的一部分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), used for people named Bodwell","zh":"博德韦尔（姓氏），用于姓 Bodwell 的人"},"examples":[{"en":"Ms. Bodwell is our new English teacher.","zh":"Bodwell 女士是我们新来的英语老师。"},{"en":"I found an article written by Bodwell in the school newsletter.","zh":"我在校报里看到一篇由 Bodwell 撰写的文章。"}]},{"partOfSpeech":"n.","definition":{"en":"a proper name used in some place and institution names (for example, a park, street, or school)","zh":"博德韦尔（专有名词），也用于一些地名或机构名（如公园、街道或学校）"},"examples":[{"en":"The event will be held at Bodwell Park this Saturday.","zh":"活动将于本周六在 Bodwell Park 举行。"},{"en":"She graduated from Bodwell High School.","zh":"她毕业于 Bodwell High School。"}]}],"phonetic":"/ˈbɑd.wɛl/","extraExplanation":["“Bodwell”通常不是普通词汇，而是专有名词（人名/地名）。在英文里，专有名词一般首字母大写；用于学校或机构名称时，常保留原拼写不翻译，或音译为“博德韦尔”。","读音上常见拆分为 Bod + well（像两个音节连读），但它并不等于短语“bod(y) + well”，意义来自家族姓氏或命名来源。"]}
{"word":"bodword","summary":{"en":"“Bad word” usually means a swear word; it can also mean a negative comment about someone or something.","zh":"“Bad word”通常指脏话；也可指对某人或某事的负面评价（说坏话）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"an offensive or rude word; a swear word","zh":"冒犯或粗鲁的词；脏话／咒骂词"},"examples":[{"en":"Please don’t use bad words in class.","zh":"请不要在课堂上说脏话。"},{"en":"He apologized for saying a bad word.","zh":"他为自己说了不当的粗话而道歉。"}]},{"partOfSpeech":"phrase","definition":{"en":"a negative or unfavorable comment about someone or something (often in the phrase “a bad word about”)","zh":"对某人／某事的负面评价（常见于短语“say a bad word about…”）"},"examples":[{"en":"She never says a bad word about her coworkers.","zh":"她从不说同事的坏话。"},{"en":"I won’t hear a bad word about my family.","zh":"我不允许任何人说我家人的坏话。"}]}],"synonyms":["swear word","curse word","profanity","insult"],"phonetic":"/ˈbæd wɝd/","extraExplanation":["“bodword”不是常见英语单词，看起来像拼写错误。你可能想输入的是“bad word”（脏话／坏话）。如果你其实想查的是别的词（例如“broadword / broadsword”等），告诉我正确拼写或给我一句例句，我可以再帮你确认。"]}
{"word":"Body","summary":{"en":"Body most commonly means a person’s physical form, and it can also mean the main part of something, an organized group, a corpse, or thickness in liquids.","zh":"Body 最常指人的身体；也可指某物的主体部分、组织团体、尸体，或（液体的）醇厚/浓稠度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the physical structure of a person or animal, including skin, bones, and organs","zh":"（人或动物的）身体；躯体（包括皮肤、骨骼和器官）"},"examples":[{"en":"Regular exercise is good for your body and your mind.","zh":"规律运动对身体和心理都有好处。"},{"en":"She listened to her body and took a rest when she felt tired.","zh":"她倾听身体的信号，觉得累就休息。"}]},{"partOfSpeech":"n.","definition":{"en":"the main part of something (not including the top, edge, or surface)","zh":"（某物的）主体部分（不包括顶部、边缘或表面）"},"examples":[{"en":"The body of the email explains the problem clearly.","zh":"邮件正文把问题解释得很清楚。"},{"en":"The body of the article gives several examples.","zh":"文章主体给了好几个例子。"}]},{"partOfSpeech":"n.","definition":{"en":"a group of people who work together, especially in an official or organized way","zh":"（尤指官方或有组织的）团体；机构；集体"},"examples":[{"en":"The decision was made by an international body.","zh":"这个决定由一个国际机构作出。"},{"en":"The student body supported the new policy.","zh":"全体学生支持这项新政策。"}]},{"partOfSpeech":"n.","definition":{"en":"a dead person’s body; a corpse","zh":"尸体；遗体"},"examples":[{"en":"The police found a body near the river.","zh":"警方在河边发现了一具尸体。"}]},{"partOfSpeech":"n.","definition":{"en":"the quality of being thick, strong, or full (especially in liquids like wine or coffee)","zh":"（尤指液体的）浓稠度；醇厚感"},"examples":[{"en":"This coffee has a rich body and a smooth finish.","zh":"这款咖啡口感醇厚，回味顺滑。"}]}],"synonyms":["physique","torso","corpse","group","organization","main part","substance"],"phonetic":"/ˈbɑdi/","extraExplanation":["“body”来源于古英语，核心意思是“躯体/形体”，后来引申为“主体部分”（如文章正文）以及“团体/机构”（一群人像一个整体）。","常见搭配：body language（肢体语言）、in the body of（在……正文/主体中）、a body of evidence（大量证据）、body of water（一片水域，如湖/海）。","文学与常见表达里，body 常与 mind（心智）对比（body and mind），用于强调身心健康与平衡。"]}
{"word":"body","summary":{"en":"“Body” most commonly means a person’s physical body, and it can also mean the main part of something (like an email), a group/organization, a corpse, or the richness of a liquid.","zh":"“body”最常见意思是“身体”；也可指“主体/正文”、某个“团体/机构”、 “尸体/遗体”，以及液体的“醇厚感/浓稠度”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The physical structure of a person or animal; the whole form (including skin, bones, and organs).","zh":"（人或动物的）身体；躯体（包括皮肤、骨骼与器官等整体）。"},"examples":[{"en":"After the long hike, my body was tired but happy.","zh":"长途徒步后，我的身体很累，但心情很好。"},{"en":"Regular sleep helps your body recover.","zh":"规律睡眠能帮助身体恢复。"}]},{"partOfSpeech":"n.","definition":{"en":"The main part of something (not including smaller parts like the top, edge, or cover).","zh":"（事物的）主体；主要部分（不包括顶部、边缘或外壳等较小部分）。"},"examples":[{"en":"The body of the email explains the details; the subject line is just the title.","zh":"邮件正文解释细节；主题行只是标题。"},{"en":"Most of the snow fell on the body of the mountain.","zh":"大部分积雪落在山体的主体部分。"}]},{"partOfSpeech":"n.","definition":{"en":"A group of people acting together as one unit, especially in government or an organization.","zh":"（作为整体行动的）团体；机构（尤指政府或组织中的群体）。"},"examples":[{"en":"The decision must be approved by the governing body.","zh":"该决定必须由管理机构批准。"},{"en":"Student bodies often organize campus events.","zh":"学生团体常常组织校园活动。"}]},{"partOfSpeech":"n.","definition":{"en":"The main part of a written work, speech, or text (not the title, introduction, or conclusion).","zh":"（文章、演讲等的）正文；主体内容（不含标题、引言或结尾）。"},"examples":[{"en":"In the body of the essay, give reasons and examples.","zh":"在文章正文里给出理由和例子。"},{"en":"The body of her speech focused on public health.","zh":"她演讲的主体内容聚焦于公共卫生。"}]},{"partOfSpeech":"n.","definition":{"en":"A dead person’s remains; a corpse. (Often used carefully because it can sound blunt.)","zh":"尸体；遗体。（语气可能偏直接，使用时需注意场合。）"},"examples":[{"en":"The police found a body near the river.","zh":"警方在河边发现了一具尸体。"},{"en":"The family asked for the body to be returned for burial.","zh":"家属请求将遗体归还以便安葬。"}]},{"partOfSpeech":"n.","definition":{"en":"The thickness or richness of a liquid (such as wine, coffee, or paint); a full, strong quality.","zh":"（液体的）浓度/厚度/醇厚感（如葡萄酒、咖啡或颜料）；饱满的质感。"},"examples":[{"en":"This red wine has a lot of body.","zh":"这款红酒很醇厚。"},{"en":"Add a little cream to give the soup more body.","zh":"加一点奶油让汤更浓稠。"}]},{"partOfSpeech":"vt.","definition":{"en":"To give a shape or form to something; to create or express something clearly. (Less common.)","zh":"使成形；赋予形体或具体表达。（较不常用）"},"examples":[{"en":"The artist tried to body her ideas in clay.","zh":"这位艺术家试图用黏土把她的想法具象化。"}]}],"synonyms":["physique","torso","main part","core","organization","group","corpse","remains"],"phonetic":"/ˈbɑdi/","extraExplanation":["“body”在日常英语里最常见的是“身体”。在写作与邮件语境中，“the body (of an email/essay)”指“正文”，是非常高频的固定搭配。","谈到遗体时，英语里也常用更委婉的说法，如“remains”“the deceased”“the body of the deceased”。在正式或敏感场合用这些会更得体。","文学中“body”常与“mind（心智）/soul（灵魂）”并列，用来讨论“身与心/灵”的关系，例如常见主题是“the body and the soul（肉体与灵魂）”。"]}
{"word":"body and mind","summary":{"en":"physical and mental well-being as a whole","zh":"身心整体的健康与状态"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a person’s physical health and mental/emotional state considered together; the whole self","zh":"身心（把身体健康与心理/情绪状态作为整体来看）"},"examples":[{"en":"Yoga can help you relax in both body and mind.","zh":"瑜伽能让你在身与心两方面都放松下来。"},{"en":"After the trip, I felt refreshed in body and mind.","zh":"旅行后，我感觉身心焕然一新。"},{"en":"Good sleep is important for body and mind.","zh":"良好睡眠对身心都很重要。"}]}],"synonyms":["well-being","health","mental and physical health","holistic health","mind-body"],"phonetic":"/ˈbɑdi ænd ˈmaɪnd/","extraExplanation":["常见搭配：healthy in body and mind（身心健康）、refresh/relax in body and mind（身心放松/恢复）、care for body and mind（照顾身心）。","语气与场景：多用于健康、运动、疗愈、身心平衡（well-being）等语境；类似中文“身心”“身心灵”（后者更偏灵性/疗愈语境）。"],"etymology":"由英语中并列结构“body + and + mind”构成，长期用于表达“身与心”作为整体；常见于宗教、哲学与健康语境中，强调人的完整状态。","mnemonic":["把它直接对应成中文四字“身心”，看到 body 想“身”，看到 mind 想“心”。","联想：body 是“外在身体”，mind 是“内在想法/情绪”，and 表示“都要顾到”。"]}
{"word":"body art","summary":{"en":"artistic decoration on the body, especially tattoos and piercings","zh":"以身体为载体的艺术装饰，尤指纹身和穿孔"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Artwork done on the human body, especially tattoos, piercings, and decorative painting.","zh":"在人体上完成的艺术形式，尤指纹身、穿孔（打孔）和装饰性彩绘。"},"examples":[{"en":"Tattooing is one of the most common forms of body art.","zh":"纹身是最常见的人体艺术形式之一。"},{"en":"Some festivals feature body art, like intricate face painting.","zh":"一些节庆会展示人体艺术，比如精细的脸部彩绘。"},{"en":"In many cultures, body art can show identity or social status.","zh":"在许多文化中，人体艺术可以表达身份或社会地位。"}]}],"synonyms":["tattooing","tattoos","body decoration","body modification","skin art"],"phonetic":"/ˈbɑːdi ɑːrt/","extraExplanation":["在英语里，body art 往往是一个“总称”，既可指永久性的（如 tattoo 纹身、piercing 穿孔），也可指临时性的（如 face painting 脸部彩绘、henna 海娜纹绘）。","在不同文化与场合中，body art 的意义差异很大：可能是审美选择、宗教/仪式传统、族群身份表达，也可能与反主流文化有关。正式写作中可用 body modification（身体改造）指更广泛、更偏“改变身体”的做法。"],"etymology":"由 body（身体）+ art（艺术）组成的复合名词；现代英语中常用来统称“以身体为载体的艺术表达”，20世纪后随纹身与身体装饰文化传播而更常见。","mnemonic":["拆开记：body（身体）+ art（艺术）=“把艺术放在身体上”。","联想中文“人体艺术/身体彩绘/纹身穿孔”，都可归到 body art 这个大类里。"]}
{"word":"body builder","summary":{"en":"a person who trains to build muscle; a bodybuilder","zh":"通过力量训练增肌的人；健美运动员"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who builds muscle through weight training and related exercise; someone who practices bodybuilding.","zh":"通过力量训练等方式增肌的人；健美运动员。"},"examples":[{"en":"My cousin is a body builder, so he goes to the gym almost every day.","zh":"我表哥是个健美运动员，所以他几乎每天都去健身房。"},{"en":"Many body builders follow strict diets to reduce body fat and gain muscle.","zh":"很多健美人士会严格控制饮食，以减脂增肌。"},{"en":"She’s training like a body builder, focusing on strength and form.","zh":"她像健美训练那样练习，专注力量和动作规范。"}]},{"partOfSpeech":"n.","definition":{"en":"A tool, activity, or habit that helps develop a strong, healthy body (less common).","zh":"有助于锻炼强健身体的工具、活动或习惯（不太常见）。"},"examples":[{"en":"Swimming can be a great body builder because it works many muscle groups.","zh":"游泳是很好的“塑身方式”，因为它能锻炼到多组肌肉。"},{"en":"For older adults, walking is a gentle body builder.","zh":"对老年人来说，散步是一种温和的强身方式。"}]}],"synonyms":["bodybuilder","muscleman","weightlifter","fitness enthusiast","gym-goer"],"phonetic":"/ˈbɑːdi ˌbɪldɚ/","extraExplanation":["更地道、常见的单词形式是 bodybuilder（一个词）。body builder（两个词）也能理解，但在正式写作里更常用 bodybuilder。","bodybuilding 指“健美运动/健美训练”，强调运动本身；bodybuilder 指“健美运动员”，强调人。","在日常英语中，如果只是说“健身的人”，更常用 gym-goer（健身房常客）或 fitness enthusiast（健身爱好者），因为 bodybuilder 往往让人联想到更专业、肌肉更发达的人。"],"etymology":"由 body（身体）+ builder（建造者/塑造者）构成，字面义是“塑造身体的人/事物”。常见写法多为合成词 bodybuilding（健美运动）；bodybuilder（健美运动员）也很常用。","mnemonic":["把它拆开记：body（身体）+ builder（建造者）= “建造/塑造身体的人”。","联想“修房子的人叫 builder”，那“修（练）身体的人”就是 body builder。"]}
{"word":"body building","summary":{"en":"exercise and training aimed at developing and shaping muscles","zh":"以增肌与塑形为目标的训练与运动"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the sport or activity of doing exercises (especially weight training) to develop and shape the muscles","zh":"健美；健身（尤指力量训练，通过锻炼让肌肉更发达、更有线条）"},"examples":[{"en":"He got into body building to gain muscle and improve his posture.","zh":"他开始练健美，是为了增肌并改善体态。"},{"en":"Body building requires consistent training, enough protein, and good sleep.","zh":"健美需要规律训练、足够蛋白质和良好睡眠。"}]},{"partOfSpeech":"n.","definition":{"en":"the process of building up physical strength and muscle mass","zh":"增肌塑形的过程；体能与肌肉的强化"},"examples":[{"en":"After a year of body building, she felt stronger and more confident.","zh":"练了一年增肌塑形后，她感觉更强壮也更自信了。"}]}],"synonyms":["bodybuilding","weight training","strength training","resistance training","muscle building"],"phonetic":"/ˈbɑdiˌbɪldɪŋ/","extraExplanation":["bodybuilding 往往更强调“肌肉线条与外形”甚至比赛；weight training/strength training 更偏“力量训练”，未必以外形为主。","口语里常说 I do bodybuilding. / I’m into bodybuilding.；作为训练计划时也可说 a bodybuilding routine（健美训练计划）。"],"etymology":"由 body（身体）+ building（建造/打造）组成的复合词；原意是“打造身体”，后来固定用于指“健美/健身（以塑造肌肉为目标）”。常见拼写为 bodybuilding（一个词）；写作 body building 也能理解，但在正式用法中更常合写。","mnemonic":["把它当作“把身体当房子来建”：body（身体）+ building（建造）→“打造身体”。"]}
{"word":"body clock","summary":{"en":"the internal system that regulates daily sleep–wake and energy rhythms","zh":"调控睡眠清醒与精力等日常节律的内在系统"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person’s natural internal timing system that controls daily cycles such as sleep, wakefulness, and energy levels","zh":"人体的“内在计时系统”，调控睡眠、清醒、精力等日常节律"},"examples":[{"en":"My body clock wakes me up at around 6 a.m. even on weekends.","zh":"我的生物钟即使在周末也会在早上6点左右把我叫醒。"},{"en":"Jet lag happens when your body clock is out of sync with the new time zone.","zh":"时差反应发生在你的生物钟和新时区不同步的时候。"},{"en":"Try to keep a regular bedtime to help reset your body clock.","zh":"尽量保持规律的睡觉时间，帮助重置生物钟。"}]}],"synonyms":["biological clock","circadian rhythm","internal clock"],"phonetic":"/ˈbɑdi klɑk/","extraExplanation":["body clock 常用于日常表达；更科学/正式的说法是 circadian clock 或 circadian rhythm。","常见搭配：reset your body clock（调整/重置生物钟）、disrupt your body clock（打乱生物钟）、out of sync（不同步）、keep a regular schedule（保持规律作息）。"],"etymology":"直译为“身体的时钟”。现代英语中用 clock 比喻“计时机制”，body clock 指人体内部对时间的调节系统；与更正式的术语 circadian rhythm（昼夜节律）关系密切。","mnemonic":["把它想成“身体里有一只钟（clock）”，每天到点就提醒你困、醒、饿——对应中文“生物钟”。","clock=钟表；body=身体 → “身体的钟表”=生物钟。"]}
{"word":"body count","summary":{"en":"a total number of deaths; also slang for number of sexual partners","zh":"死亡总人数；也可指（俚语）性伴侣人数"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"The number of people who have died, especially in a war, attack, disaster, or violent event.","zh":"（尤指战争、袭击、灾难或暴力事件中的）死亡人数。"},"examples":[{"en":"The report confirmed a rising body count after the earthquake.","zh":"报告证实地震后的死亡人数在上升。"},{"en":"News outlets were careful when discussing the body count from the bombing.","zh":"新闻媒体在讨论爆炸事件的死亡人数时很谨慎。"}]},{"partOfSpeech":"phrase","definition":{"en":"(Slang) The number of people someone has had sex with.","zh":"（俚语）某人发生过性关系的对象数量（性伴侣人数）。"},"examples":[{"en":"Some people think asking about someone’s body count is intrusive.","zh":"有些人认为询问别人的“性伴侣人数”很冒犯、越界。"},{"en":"They argued online about whether body count matters in a relationship.","zh":"他们在网上争论恋爱中“性伴侣人数”是否重要。"}]}],"synonyms":["death toll","casualties","fatalities","number of partners","sexual partners"],"phonetic":"ˈbɑdi kaʊnt","extraExplanation":["语域提醒：表示“死亡人数”时较常见于新闻、军事或灾难报道，语气偏冷硬、数据化；在涉及悲剧时用词需注意同理心。","俚语用法（性伴侣人数）带有强烈的评判色彩，可能让人不舒服；在正式场合或不熟的人之间不建议使用或询问。","在亲密关系沟通里，更中性的说法有：sexual history（性经历）、past relationships（过往关系）等。"],"etymology":"由 body（尸体/身体）+ count（计数）构成。表示“死亡人数”的用法在20世纪军事语境中（尤其越战时期的英文报道）变得常见；后来在口语与网络语境中引申出“性伴侣人数”的俚语用法。","mnemonic":["把它拆开记：body（身体/尸体）+ count（数一数）＝“数有多少具身体/尸体”→ 死亡人数。","网络俚语联想：body 不再是“尸体”，而是“身体”，count 就是“数量”→ 性伴侣数量。"]}
{"word":"body fluid","summary":{"en":"a liquid produced by or present in the body","zh":"人体产生或存在于人体内的液体"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Any liquid produced by the body or found inside it, such as blood, saliva, urine, sweat, or breast milk.","zh":"人体产生或存在于人体内的任何液体，如血液、唾液、尿液、汗液或母乳等。"},"examples":[{"en":"Doctors sometimes test body fluids to look for infection.","zh":"医生有时会检测体液来寻找感染迹象。"},{"en":"Blood is a body fluid that carries oxygen through the body.","zh":"血液是一种体液，负责把氧气输送到全身。"},{"en":"Wear gloves when you might come into contact with body fluids.","zh":"在可能接触体液时要戴手套。"}]}],"synonyms":["bodily fluid","physiological fluid"],"phonetic":"/ˈbɑdi ˈfluɪd/","extraExplanation":["“body fluid”是较中性的说法；在医学、公共卫生、法医学语境中更常用复数“body fluids”，强调多种体液（如血液、唾液等）。","在安全/急救提示中常见“exposure to body fluids（暴露于体液）”，指可能接触含有病原体的体液，需要采取防护措施。"],"etymology":"由“body（身体）+ fluid（液体）”组成的名词短语。fluid 源自拉丁语 *fluere*（“流动”），因此带有“可流动的液体”的含义。","mnemonic":["把它拆开记：body=身体；fluid=流体/液体（联想“fluid=flow=流动”）→“身体里流动/分泌的液体”。","fluid 和中文“流”音义联想：fluid≈flow（流）→ 体液就是“体内的流体”。"]}
{"word":"body fluids","summary":{"en":"liquids produced by the body","zh":"人体产生的各种液体（体液）"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Liquids produced by the human (or animal) body, such as blood, saliva, urine, sweat, and semen.","zh":"人体（或动物）分泌或产生的液体，例如血液、唾液、尿液、汗液和精液等。"},"examples":[{"en":"Medical staff wear gloves to avoid contact with body fluids.","zh":"医护人员戴手套以避免接触体液。"},{"en":"The test can detect drugs in different body fluids, including blood and urine.","zh":"这种检测可以在不同体液中（包括血液和尿液）检测出药物。"},{"en":"Some viruses can spread through certain body fluids.","zh":"一些病毒可以通过某些体液传播。"}]}],"synonyms":["bodily fluids","physiological fluids","biological fluids"],"phonetic":"/ˈbɑdi ˈfluːɪdz/","extraExplanation":["在公共卫生与职业安全语境中，body fluids 常与“感染控制（infection control）/生物危害（biohazard）/体液暴露（exposure to body fluids）”连用，强调需要防护与消毒。","不同机构对“体液”的范围划分可能略有差异；常见高风险体液包括血液、精液、阴道分泌物、母乳等，日常语境中也可能泛指汗液、唾液等。"],"etymology":"由“body（身体）+ fluids（液体）”构成的现代英语医学/健康用语；“fluid”源自拉丁语 fluidus，意为“流动的”。","mnemonic":["把 fluids 理解成“流动的东西（fluid=流动）”，body fluids 就是“身体里流出来/分泌出来的液体”。","联想中文“体液”：体=body，液=fluids，几乎一一对应。"]}
{"word":"body fossil","summary":{"en":"a fossil made of an organism’s preserved body parts","zh":"由生物遗体部分保存形成的化石"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fossil that preserves part of an organism’s actual body (such as bones, shells, teeth, or wood), rather than only its trace or imprint","zh":"保存了生物身体部分真实遗骸的化石（如骨骼、贝壳、牙齿或木质组织），而不是只留下痕迹或印痕的化石"},"examples":[{"en":"Trilobite shells are common body fossils in Paleozoic rocks.","zh":"三叶虫的壳是在古生代岩石中常见的实体化石。"},{"en":"The museum displayed a dinosaur tooth as a body fossil.","zh":"博物馆展出了一颗恐龙牙齿作为实体化石。"},{"en":"Unlike a footprint, which is a trace fossil, a bone is a body fossil.","zh":"脚印属于痕迹化石，而骨骼属于实体化石。"}]}],"synonyms":["body fossil","body remains fossil","organic remains fossil"],"phonetic":"/ˈbɑdi ˈfɑsəl/","extraExplanation":["常见对比：body fossil（实体化石） vs. trace fossil（痕迹化石，如脚印、洞穴、粪化石coprolite等）。","“body fossil”并不一定是“整具尸体”，很多时候只是硬组织（骨、壳、牙）。极少数情况下，琥珀中昆虫或冰冻木乃伊等也可算保存身体的化石材料。"],"etymology":"由 body（身体）+ fossil（化石）组成的现代科学复合词，用来和 trace fossil（痕迹化石）区分；含义直观：强调“身体本体的遗存”。","mnemonic":["把它拆开记：body=身体，fossil=化石 → “身体的化石”=保存了身体部分。","联想中文：实体化石=“实体（body）留下来”。"]}
{"word":"body image","summary":{"en":"How someone perceives and feels about their physical appearance.","zh":"一个人对自身外貌的认知与感受。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person’s thoughts, feelings, and beliefs about how their body looks (including size, shape, and appearance).","zh":"对自己身体外貌（包括身材、体型、外观）的看法、感受与信念。"},"examples":[{"en":"Social media can affect teenagers’ body image.","zh":"社交媒体可能会影响青少年的身体形象认知。"},{"en":"She’s working on improving her body image and self-confidence.","zh":"她正在努力改善自己的身体形象认知和自信心。"},{"en":"A healthy body image means respecting your body, not chasing an impossible standard.","zh":"健康的身体形象意味着尊重自己的身体，而不是追逐不可能的标准。"}]}],"synonyms":["self-image","appearance-related self-esteem","body perception"],"phonetic":"/ˈbɑdi ˈɪmɪdʒ/","extraExplanation":["常见搭配：positive/healthy body image（积极/健康的身体形象），negative body image（消极的身体形象），body image issues（身体形象困扰），body image concerns（对身材外貌的担忧）。","注意区分：body image 侧重“自我感受与认知”，不等同于“体重/身材本身”。","语境较敏感：讨论饮食、减肥、外貌焦虑时，语气可更温和，如：I’m trying to feel better about my body（我在努力对自己的身体感觉更好）。"],"etymology":"由 body（身体）+ image（形象/印象）组成；20世纪中后期在心理学与大众文化中广泛用于讨论自我认知与外貌标准。","mnemonic":["把 image 理解成“脑海里的照片/印象”：body image = 你脑子里对自己身体的“照片”。","联想中文“形象”：body（身体）+ image（形象）→ “身体形象/身体形象认知”。"]}
{"word":"body image-related pressure","summary":{"en":"pressure about appearance and body shape/size.","zh":"与外貌和身材（体型体重等）相关的压力。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"pressure (from yourself or others) connected to how your body looks, including its shape, size, weight, or appearance.","zh":"与外貌和身材（体型、尺寸、体重、外观等）相关的压力，可能来自他人也可能来自自己。"},"examples":[{"en":"Many teenagers feel body image-related pressure because of social media.","zh":"很多青少年因为社交媒体而感到与身材形象相关的压力。"},{"en":"She experienced body image-related pressure at work and stopped going to team lunches.","zh":"她在工作中承受与身材形象相关的压力，后来不再参加团队午餐。"},{"en":"Therapy helped him handle body image-related pressure in a healthier way.","zh":"心理咨询帮助他用更健康的方式应对与身材形象相关的压力。"}]}],"synonyms":["appearance-related pressure","pressure about body image","body shame","appearance anxiety","body-related anxiety"],"phonetic":"/ˈbɑdi ˈɪmɪdʒ rɪˈleɪtɪd ˈprɛʃər/","extraExplanation":["body image 指一个人对自己身体外观的“感受与看法”，不一定等同于真实外貌；pressure 可以来自同伴评价、家庭期待、媒体审美、健身/节食文化，也可能是自我比较带来的内化压力。","在写作中也常见更自然的表达：pressure about body image / pressure to look a certain way / appearance-related pressure。","这是敏感话题，讨论时常用更尊重、更中性的说法，比如 focusing on health rather than size（关注健康而不是尺寸）。"],"etymology":"这是一个现代英语复合表达：body image（“身体意象/身材形象”，20世纪中期在心理学与媒体语境中普及）+ related（“相关的”）+ pressure（“压力”）。常见于心理健康、教育与媒体讨论中。","mnemonic":["把它拆开记：body（身体）+ image（形象/印象）+ related（相关的）+ pressure（压力）=“因为身材形象而来的压力”。","联想中文常说的“身材焦虑/容貌焦虑”，就是这类 pressure 的典型表现。"]}
{"word":"body language","summary":{"en":"nonverbal communication shown through physical behavior","zh":"通过身体行为表达的非语言沟通"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the messages you communicate through posture, facial expressions, gestures, eye contact, and other nonverbal behavior","zh":"通过姿势、面部表情、手势、眼神等非语言行为传达的信息；肢体语言"},"examples":[{"en":"Her body language showed she was nervous: she avoided eye contact and kept fidgeting.","zh":"她的肢体语言表明她很紧张：她躲开眼神接触，还不停地坐立不安。"},{"en":"Good body language in an interview includes sitting up straight and smiling naturally.","zh":"面试中好的肢体语言包括坐姿端正、自然微笑。"},{"en":"In some cultures, personal space and body language are interpreted differently.","zh":"在一些文化中，人际距离和肢体语言的含义会有不同解读。"}]}],"synonyms":["nonverbal communication","nonverbal cues","physical cues","gestures","facial expressions"],"phonetic":"/ˈbɑdi ˌlæŋɡwɪdʒ/","extraExplanation":["肢体语言常被看作“非语言沟通”的一部分，除动作外还包括语气、语速、停顿等（这些有时被称为 paralanguage）。","跨文化差异很常见：比如眼神接触在一些文化中表示自信与诚实，在另一些文化中可能被视为冒犯。理解时要结合场合、关系和文化背景。"],"etymology":"由“body（身体）+ language（语言）”构成的复合名词，用来指“像语言一样可被解读的非语言信号”。20世纪随着心理学、传播学的发展而广泛流行。","mnemonic":["把它当成“身体在说话”：body（身体）+ language（语言）= 身体表达的语言。","联想“看得见的语言”：不用开口也能传达态度和情绪。"]}
{"word":"body locution","summary":{"en":"Nonverbal expression through the body, treated as a kind of speech.","zh":"把身体动作当作一种“说话”的非语言表达。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Rare) Communication or expression conveyed through bodily movement (such as gestures, posture, or facial expression), treated like a kind of “speech.”","zh":"（较少见）通过身体动作（如手势、姿势、面部表情）传达信息或表达情感，把这种非语言表达当作一种“说话/表达方式”。"},"examples":[{"en":"In the crowded room, his body locution—crossed arms and a tight jaw—said he wanted to be left alone.","zh":"在拥挤的房间里，他的“身体表达”——抱臂和紧咬的下颌——在传达：他想一个人待着。"},{"en":"The actor practiced body locution to make the character’s fear clear without any lines.","zh":"演员练习用身体表达，让角色的恐惧在没有台词的情况下也能被看出来。"}]}],"synonyms":["body language","gesture","nonverbal communication","physical expression","signaling"],"phonetic":"/ˈbɑdi loʊˈkjuʃən/","extraExplanation":["“locution”在语言学里常见于“locutionary act（言内行为）”，强调“说了什么内容/句子本身”。因此“body locution”并不是非常固定或常用的标准术语，更常见的说法是 body language 或 nonverbal communication。","如果你是在写论文或正式文本，建议用更普遍的表达（如 body language）；若你刻意追求修辞效果或强调“身体=一种话语”，才可能用到 body locution。"],"etymology":"由 body（身体）+ locution（言语表达）构成。locution 来自拉丁语 loqui（“说”），原指“措辞/说法”。把它和 body 搭配，属于较少见的造词方式，用来强调“身体也在说话”。","mnemonic":["把 locution 记成“说法/措辞”（联想中文“locu-≈‘说’”），body locution 就是“身体的说法”→“身体在说话”。"]}
{"word":"body mass","summary":{"en":"a person’s physical mass, often used as a general measure of body weight","zh":"人体的身体质量，常用作体重的总体衡量"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"The amount of matter in a person’s body; in everyday health contexts, it often refers to body weight as a general measure (not the same as body fat).","zh":"身体的质量；在日常健康语境中常泛指“体重”的总体概念（但不等同于体脂）。"},"examples":[{"en":"Regular exercise can help maintain a healthy body mass.","zh":"规律运动有助于保持健康的体重（身体质量）。"},{"en":"His body mass increased after he stopped training.","zh":"他停止训练后体重（身体质量）增加了。"},{"en":"Doctors may consider body mass along with blood pressure and lifestyle.","zh":"医生可能会把体重（身体质量）与血压和生活方式一起综合考虑。"}]},{"partOfSpeech":"phrase","definition":{"en":"In scientific contexts, the physical mass of the body measured in units such as kilograms, independent of gravity (different from “weight” in physics).","zh":"在科学语境中指以千克等单位测量的“质量”，不受重力影响（物理学上不同于“重量”）。"},"examples":[{"en":"On the Moon, your weight changes, but your body mass stays the same.","zh":"在月球上，你的重量会变，但你的身体质量不变。"},{"en":"The scale estimates body mass using sensors and calculations.","zh":"该体重秤通过传感器和计算来估算身体质量。"}]}],"synonyms":["body weight","weight","mass","weightiness"],"phonetic":"/ˈbɑdi mæs/","extraExplanation":["在健康讨论中，你常会看到 body mass index（BMI，身体质量指数），它用“体重/身高²”来粗略评估体重水平，但并不能直接反映肌肉量与体脂比例。"],"etymology":"由 body（身体）+ mass（质量/总量）组合而成；mass 来自拉丁语“massa”，有“团块、总量”之意，后来在科学中固定为“质量”。","mnemonic":["把它拆开记：body（身体）+ mass（质量/块）= 身体的“总量/分量”。","联想 BMI：B(身体) + M(质量) 出现在“身体质量指数”里，看到 BMI 就想到 body mass。"]}
{"word":"Body Mass Index","summary":{"en":"a height–weight ratio used to estimate weight status","zh":"用于估算体重与身高是否匹配的指标"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A number used to estimate whether a person’s weight is healthy for their height, usually calculated as weight (kg) divided by height (m) squared.","zh":"用于估算一个人的体重是否与身高相匹配的数值，通常计算方式为体重（千克）÷身高（米）的平方。"},"examples":[{"en":"My doctor calculated my body mass index to screen for health risks.","zh":"我的医生计算了我的体质指数，用来初步筛查健康风险。"},{"en":"Body mass index is a quick tool, but it doesn’t measure body fat directly.","zh":"体质指数是一个快速工具，但它并不直接测量体脂。"},{"en":"Two people can have the same body mass index but very different fitness levels.","zh":"两个人的体质指数可能一样，但体能水平差别很大。"}]}],"synonyms":["BMI","Quetelet index","weight-for-height index"],"phonetic":"/ˈbɑdi mæs ˈɪnˌdɛks/","extraExplanation":["常见写法缩写为BMI（读作字母：B-M-I）。","BMI常用于人群层面的健康筛查与统计，但对运动员（肌肉量高）、孕妇、老年人等人群可能不够准确；它反映的是“体重相对身高”，不等同于“体脂率”。"],"etymology":"“Body mass index”是对一种身高-体重比值指标的英文名称；该指标源自19世纪比利时统计学家阿道夫·凯特莱（Adolphe Quetelet）提出的“凯特莱指数（Quetelet index）”，后来在公共卫生领域普及并常简称为BMI。","mnemonic":["记公式：BMI = 体重(kg) ÷ 身高(m)²（“除以身高的平方”是关键）。","把它理解成“身高体重配比指数”：看体重是否与身高“配套”。"]}
{"word":"body mass index","summary":{"en":"a height–weight measure used to screen for weight status","zh":"用于筛查体重状况的身高-体重指标"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A number used to estimate whether a person’s weight is relatively healthy for their height, calculated from height and weight.","zh":"一种用身高和体重计算出的数值，用来粗略估计体重相对于身高是否在较健康的范围内。"},"examples":[{"en":"My doctor calculated my body mass index during the checkup.","zh":"体检时医生帮我计算了我的身体质量指数。"},{"en":"Body mass index is a quick screening tool, not a full measure of health.","zh":"身体质量指数是一个快速筛查工具，并不是完整的健康衡量标准。"},{"en":"Two people can have the same body mass index but very different body types.","zh":"两个人的身体质量指数可能相同，但体型差异很大。"}]}],"synonyms":["BMI","Quetelet index"],"phonetic":"/ˌbɑdi ˈmæs ˈɪnˌdɛks/","extraExplanation":["常见计算方法：BMI = 体重(kg) ÷ 身高(m)²。比如70kg、1.75m：70 ÷ (1.75²) ≈ 22.9。","BMI适合做“人群层面/初步筛查”，但对肌肉量高的人（如运动员）、老年人、孕期、不同种族体脂分布差异等情况可能不够准确。医生常结合腰围、体脂率、血压、血脂等一起判断。"],"etymology":"“Body mass index”由 body（身体）+ mass（质量）+ index（指数）组成；该指标最早源自19世纪用于统计的人体测量学方法，后来在公共卫生领域被广泛采用。","mnemonic":["把它理解成“身高体重的指数”：身高越高分母越大，BMI越容易变小；体重越大BMI越大。","index≈“指数/指标”（中文里也常说“指数”），帮助记住这是一个用来衡量的数字。"]}
{"word":"body odor","summary":{"en":"an unpleasant smell from a person’s body","zh":"人身上散发的难闻气味"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Unpleasant smell from a person’s body, usually caused by sweat and bacteria (often from the underarms).","zh":"体味；（通常指）汗味、腋臭等让人不舒服的身体气味。"},"examples":[{"en":"Deodorant can help reduce body odor, especially in hot weather.","zh":"止汗除臭剂能帮助减轻体味，尤其在炎热天气里。"},{"en":"After the workout, he noticed some body odor and took a shower.","zh":"运动后，他闻到自己有点体味，就去洗了个澡。"}]}],"synonyms":["BO","body smell","bad smell","stink","malodor"],"phonetic":"/ˈbɑdi ˈoʊdɚ/","extraExplanation":["这是一个中性偏委婉但仍可能让人尴尬的表达。日常更常用说法包括 “BO”（口语缩写）和更委婉的 “body smell”。在正式或医疗语境也可能说 “bromhidrosis（狐臭/汗臭症）”。","美式拼写是 odor；英式拼写常见为 odour。"],"etymology":"由 body（身体）+ odor（气味）组成的复合名词；odor 来自拉丁语 odorem，意为“气味”。","mnemonic":["把它拆开记：body（身体）+ odor（气味）= 身体散发的气味。","联想缩写 BO：B=body，O=odor，两个字母就记住“体味”。"]}
{"word":"body of","summary":{"en":"the main part of something; or a whole collection/large amount of something","zh":"某事物的主体部分；或指一整套/大量的整体"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"the main or central part of something (not the beginning or the end)","zh":"某事物的主体部分（不是开头或结尾）"},"examples":[{"en":"Put your questions in the body of the email, not in the subject line.","zh":"把你的问题写在邮件正文里，不要写在主题里。"},{"en":"The body of the report explains the results in detail.","zh":"报告正文详细解释了结果。"},{"en":"The introduction is short, but the body of the article is quite long.","zh":"引言很短，但文章主体很长。"}]},{"partOfSpeech":"phrase","definition":{"en":"a large amount or a collection of something considered as a whole","zh":"大量的；一整套/一组（被视为整体的事物）"},"examples":[{"en":"There isn’t enough body of evidence to support that claim.","zh":"没有足够的证据体系来支持那个说法。"},{"en":"She has built a strong body of work over the past ten years.","zh":"过去十年里，她积累了一批很扎实的作品。"},{"en":"A large body of water separates the island from the mainland.","zh":"一大片水域把这个岛与大陆隔开了。"}]}],"synonyms":["main part of","core of","bulk of","the text of","corpus of","collection of"],"phonetic":"/ˈbɑdi əv/","extraExplanation":["常见搭配：the body of an email/message（邮件/消息正文）、the body of a report/article（报告/文章主体）、a body of evidence（证据体系/一批证据）、a body of work（作品集/作品体系）、a body of water（大片水域）。","用法提示：通常需要加定冠词 the 或不定冠词 a，取决于是否在指特定的“主体部分”（the body of the email）或“一整套/一批”（a body of evidence）。"],"etymology":"由名词 body（“身体、主体”）+ 介词 of 构成的固定搭配；从“某物的主体/整体”这一概念引申出“正文”“整体数量/集合”等用法。","mnemonic":["把 body 记成“主体/本体”：body of = “……的主体部分/主体内容”。","联想“正文=主体”：邮件正文就是邮件的“身体”。"]}
{"word":"body of sth.","summary":{"en":"the main part or central content; sometimes an organized group","zh":"主体部分/主要内容；有时指团体或机构"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"the main part of something (not the beginning or the ending); the central content","zh":"某事物的主体部分；主要内容（不包括开头或结尾）"},"examples":[{"en":"In the body of the essay, explain your reasons and give examples.","zh":"在文章的正文部分，说明你的理由并给出例子。"},{"en":"Most of the body of the report focuses on safety improvements.","zh":"报告的大部分正文都在讨论安全改进。"},{"en":"The strongest evidence appears in the body of the article, not the headline.","zh":"最有力的证据出现在文章正文，而不是标题里。"}]},{"partOfSpeech":"phrase","definition":{"en":"a group of people considered as a unit (often in formal contexts)","zh":"（常用于正式语境）一个整体的人群；团体"},"examples":[{"en":"A body of experts reviewed the data.","zh":"一个专家团审核了数据。"},{"en":"The decision was made by a governing body.","zh":"该决定由管理机构作出。"}]}],"synonyms":["main part","core","bulk","substance","main text","central section","a group of","an organization"],"phonetic":"/ˈbɑdi əv ˈsʌmθɪŋ/","extraExplanation":["写作里常见结构是：introduction（引言）+ body（正文）+ conclusion（结论）。这里的“body”基本等于“main text/正文”。","在正式语境中，“a body of …”常指“由某类人组成的整体”，如 a body of students（学生群体）、a governing body（管理机构）。"],"etymology":"“body”源自古英语“bodig”（身体），后来引申为“主体、主要部分”，再进一步引申为“整体的人群/团体”。","mnemonic":["body=身体→身体的“主体部分”=某事物的“主体/正文”。","把“body of sth.”理解成“某物的躯干”，头尾不算，主要内容在中间。"]}
{"word":"body of water","summary":{"en":"an area of water such as a lake, river, sea, or ocean","zh":"湖泊、河流、海洋等一片水域"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A noticeable area of water on Earth’s surface, such as a lake, river, sea, or ocean.","zh":"（地表上）一片明显的水域，如湖泊、河流、海洋等。"},"examples":[{"en":"There are several bodies of water near the city, including a lake and two rivers.","zh":"城市附近有几片水域，包括一个湖和两条河。"},{"en":"The map shows every major body of water in the region.","zh":"这张地图标出了该地区所有主要水域。"}]},{"partOfSpeech":"phrase","definition":{"en":"(In geography or law) A defined water area considered as one unit for description, management, or rules.","zh":"（地理或法律语境）作为一个整体被界定、用于描述/管理/适用规则的水域。"},"examples":[{"en":"Fishing is restricted in this body of water during breeding season.","zh":"在繁殖季，这片水域禁止捕鱼。"},{"en":"The report assesses pollution levels in each body of water.","zh":"报告评估了每个水域的污染水平。"}]}],"synonyms":["lake","river","sea","ocean","waterway","pond","bay","gulf","reservoir"],"phonetic":"/ˈbɑdi əv ˈwɔtɚ/","extraExplanation":["常用结构是“a body of water”（一片水域）或“bodies of water”（多片水域）。","它是比较正式/书面的一种说法；日常口语更常直接说 lake/river/sea 等具体词。"],"etymology":"字面组合：body（“整体、主体”）+ of + water（“水”）。body 在英语里常引申为“一个整体/一团/一片”，所以 body of water 就是“成片的水”。","mnemonic":["把 water 想成“水”，body 想成“身体/整体”：一片水域就像“水的身体”。","联想地理课：地图上把湖、河、海当作一个个“整体单位（body）”来标注。"]}
{"word":"body shaking","summary":{"en":"strong whole-body trembling or purposeful movement","zh":"全身发抖或有意识地摇动身体"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"strong involuntary movement of the whole body, often from cold, fear, illness, or intense emotion","zh":"全身不由自主地剧烈发抖；常因寒冷、恐惧、生病或强烈情绪引起"},"examples":[{"en":"After waiting outside in the snow, he had body shaking from the cold.","zh":"在雪地里等了很久后，他冷得全身发抖。"},{"en":"She was crying with body shaking after the scary experience.","zh":"经历了可怕的事后，她哭得全身发抖。"},{"en":"If you have fever and body shaking, call a doctor.","zh":"如果你发烧并且全身发抖，建议联系医生。"}]},{"partOfSpeech":"phrase","definition":{"en":"moving your body back and forth or side to side on purpose (for example, in dancing or exercise)","zh":"有意识地摇动身体（例如跳舞或运动时）"},"examples":[{"en":"The music started, and soon everyone was body shaking on the dance floor.","zh":"音乐一响，很快大家都在舞池里摇动身体。"},{"en":"Try body shaking for 30 seconds to warm up before running.","zh":"跑步前可以先摇动身体30秒来热身。"}]}],"synonyms":["trembling","shivering","quivering","convulsing","shaking all over","full-body tremor"],"phonetic":"/ˈbɑdi ˈʃeɪkɪŋ/","extraExplanation":["如果想表达“因为冷/病而打寒战”，英语里更常说 shivering 或 having the shakes。","在医疗语境里，“突然全身发抖”可能对应 chills（寒战）或 tremor（震颤）；严重或伴随高烧、意识改变时应及时就医。","写作中可以用 full-body shaking / his whole body was shaking 来更自然地表达。"],"etymology":"直译组合：body（身体）+ shaking（摇晃/发抖）。常见于口语与描述性写作中；更自然的说法通常是“shaking all over / full-body shaking”。","mnemonic":["把它当成“身体（body）在摇（shaking）”：画面感很强——整个人像果冻一样抖。","联想中文“全身发抖/浑身直哆嗦”，对应英文常见替换：shaking all over。"]}
{"word":"body shape","summary":{"en":"A person’s bodily form or silhouette.","zh":"人的体型；身形轮廓。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"The outline or form of a person’s body (for example, slim, curvy, muscular), often used when talking about appearance, clothing fit, or health.","zh":"（人的）体型；身材轮廓（如苗条、曲线型、健壮等），常用于谈论外貌、穿衣效果或健康。"},"examples":[{"en":"Different clothes flatter different body shapes.","zh":"不同的衣服适合不同的体型。"},{"en":"Exercise can change your body shape over time.","zh":"运动可以随着时间改变你的体型。"},{"en":"This brand offers jeans for many body shapes.","zh":"这个品牌提供适合多种体型的牛仔裤。"}]},{"partOfSpeech":"phrase","definition":{"en":"In art, design, or fitness contexts, the overall silhouette or proportions of the body (how wide shoulders, waist, and hips appear in relation to each other).","zh":"（艺术/设计/健身语境）身体的整体剪影或比例（如肩、腰、臀的相对宽窄关系）。"},"examples":[{"en":"The artist exaggerated the body shape to create a dramatic silhouette.","zh":"艺术家夸张了身体轮廓来营造戏剧性的剪影效果。"},{"en":"A good posture can make your body shape look more balanced.","zh":"好的体态会让你的身形看起来更匀称。"}]}],"synonyms":["figure","body type","physique","build","shape","silhouette"],"phonetic":"/ˈbɑdi ʃeɪp/","extraExplanation":["使用时要注意语气：body shape 常涉及外貌与身材评价。更礼貌的说法包括 “body type”（体型类型）、“figure”（身材，较口语/时尚）、或在医疗/健康语境用更中性的表达（如 “health” “fitness level”）。","常见搭配：body shape + changes（变化）；flatter a body shape（显身材/修饰身形）；for all body shapes（适合各种体型）。"],"etymology":"由普通词组 body（身体）+ shape（形状）组成；在现代英语中常用于服装尺码、时尚与健身语境，强调“轮廓/比例”而不只是体重。","mnemonic":["把它直译成“身体的形状”：body=身体，shape=形状，合起来就是“体型/身材轮廓”。","联想中文“身材”=“身（body）+材/形（shape）”，记成“身体的外形”。"]}
{"word":"body snatcher","summary":{"en":"Someone who steals corpses, or (in fiction) takes over another person’s body or identity.","zh":"盗尸者；或（虚构作品中）夺取他人身体/身份者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who steals dead bodies from graves, especially to sell them for medical study or dissection.","zh":"盗墓偷尸者；（尤指）为卖给医学院解剖或研究而偷走尸体的人。"},"examples":[{"en":"In the 1800s, medical schools sometimes paid body snatchers for cadavers.","zh":"19世纪时，医学院有时会花钱向盗尸者购买遗体。"},{"en":"The novel’s plot begins with rumors of a body snatcher in the cemetery.","zh":"小说以墓地里出现盗尸者的传言开场。"}]},{"partOfSpeech":"n.","definition":{"en":"A fictional creature or person that takes over someone’s body or identity (common in science fiction and horror).","zh":"（科幻/恐怖作品中）夺取他人身体或身份的生物/人；“夺舍者”。"},"examples":[{"en":"The movie is about alien body snatchers who replace people with perfect copies.","zh":"这部电影讲的是外星“夺体者”用完美复制品替换人类。"},{"en":"He joked that his sleepy coworker looked like a body snatcher had taken over.","zh":"他开玩笑说那位困得不行的同事像被“夺体者”附身了一样。"}]}],"synonyms":["grave robber","corpse thief","ghoul","body thief","impostor","identity thief"],"phonetic":"/ˈbɑdi ˌsnætʃɚ/","extraExplanation":["历史背景：18—19世纪英美医学教育需要尸体解剖，但合法来源不足，催生了“盗尸贩卖”的黑市；这也推动了后来更严格的遗体捐献与相关法律。","文化用法：科幻语境里常让人联想到《Invasion of the Body Snatchers》（《天外魔花》）系列，主题多与“身份被替换、群体同化”的恐惧有关。"],"etymology":"字面由 body（身体、尸体）+ snatcher（抢夺者）构成。18—19世纪英国曾出现“盗尸卖给医学院”的现象，因此该词常与当时的解剖医学史相关；20世纪后在科幻语境中延伸为“夺取身体/身份者”。","mnemonic":["拆开记：body=尸体/身体，snatch=抢；“抢身体/抢尸体的人”→ 盗尸者/夺体者。","联想：snack（零食）和 snatch（抢）很像，别把“抢”当“吃零食”；是“抢走身体”的意思。"]}
{"word":"body type","summary":{"en":"a general category of body shape and build","zh":"身材/体型的总体分类"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A category used to describe a person’s general body shape and build (for example, how slim, muscular, or curvy someone is).","zh":"（人的）体型类型；身材类型（用来概括身材的整体形状与骨架/肌肉感，如偏瘦、健壮、曲线型等）。"},"examples":[{"en":"Different exercises work better for different body types.","zh":"不同的锻炼方式对不同的体型类型更有效。"},{"en":"The brand offers size guides for many body types.","zh":"这个品牌为多种体型提供尺码指南。"},{"en":"Try not to judge people based on body type.","zh":"尽量不要只凭体型去评判别人。"}]}],"synonyms":["physique","figure","build","body shape","frame"],"phonetic":"/ˈbɑdi taɪp/","extraExplanation":["在健康与健身领域，有时会提到“somatotypes（体型分类）”如 ectomorph/mesomorph/endomorph（偏瘦型/肌肉型/易胖型），但现代研究认为这种分类并不能精确决定一个人适合的训练或饮食。日常交流中，body type 更常是中性描述身材外观。","谈论他人身材时建议用更尊重、更中性的表达（如 “different body types”），避免带有贬义或让对方不适的评价。"],"etymology":"由 body（身体）+ type（类型）构成的现代英语搭配，用于健康、健身、服装尺码与审美讨论中；含义从“身体的类别”自然引申为“身材/体型的分类”。","mnemonic":["把它直译成“身体 + 类型”＝“体型类型/身材类型”。","联想购物场景：选衣服会看“body type（体型）”来挑版型。"]}
{"word":"body-aware","summary":{"en":"Body-aware means mindful of your body’s sensations, posture, and movement, or designed with the body’s comfort and movement in mind.","zh":"Body-aware 指对身体感觉、姿势与动作有觉察；也可指在设计上更考虑身体舒适与活动性。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"conscious of your body—its posture, sensations, movement, or physical needs (often in a mindful, healthy way).","zh":"对自己的身体有觉察——注意姿势、感觉、动作或身体需求（通常带有正念、健康的意味）。"},"examples":[{"en":"Yoga can help you become more body-aware and notice tension in your shoulders.","zh":"瑜伽能帮助你更有身体觉察，注意到肩膀的紧张。"},{"en":"Try to be body-aware during long meetings: stretch, breathe, and adjust your posture.","zh":"长时间开会时尽量保持身体觉察：伸展、呼吸，并调整坐姿。"}]},{"partOfSpeech":"adj.","definition":{"en":"made or designed to respect how bodies feel and move; comfortable and movement-friendly.","zh":"（产品/设计）考虑身体感受与动作方式的；更舒适、便于活动的。"},"examples":[{"en":"The brand makes body-aware clothing that moves well and doesn’t pinch.","zh":"这个品牌做的衣服很“身体友好”，活动自如，不勒不夹。"},{"en":"We chose body-aware seating to reduce back pain for office workers.","zh":"我们选择了更符合身体需求的座椅，以减少上班族腰背痛。"}]}],"synonyms":["mindful of the body","somatic","in tune with your body","body-conscious","movement-friendly"],"phonetic":"/ˈbɑdi əˌwɛr/","extraExplanation":["“body-aware”常见于健康、正念（mindfulness）、躯体练习（somatics）、舞蹈训练与复健等语境，强调“觉察身体信号”，而不是外貌评判。","英文里它常用连字符（hyphen）作复合形容词：body-aware exercises / a body-aware approach。也可见不连字符写法 body aware（较少见）。"]}
{"word":"body-awareness","summary":{"en":"Body awareness is noticing and understanding your body’s sensations and movements, often used in health, mindfulness, and training contexts.","zh":"Body awareness 指对身体感受与动作的觉察与理解，常用于健康、正念与训练等语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The ability to notice and understand what your body is doing and feeling (for example posture, movement, tension, breathing, pain, or hunger).","zh":"对身体正在做什么、正在感觉什么的觉察能力（如姿势、动作、紧张、呼吸、疼痛或饥饿等）。"},"examples":[{"en":"Yoga can improve body awareness and help you notice where you hold tension.","zh":"瑜伽能提升身体觉察，帮助你发现自己哪里容易紧绷。"},{"en":"Good dancers develop strong body awareness to control small movements.","zh":"优秀的舞者会培养很强的身体觉察，从而控制细微动作。"},{"en":"If you have low body awareness, you might miss early signs of stress like shallow breathing.","zh":"如果身体觉察较弱，你可能会忽略压力的早期信号，比如呼吸变浅。"}]},{"partOfSpeech":"n.","definition":{"en":"In sports and physical education, knowing where your body parts are in space and how they move, so you can coordinate actions well.","zh":"在运动与体能训练中，知道身体各部位在空间中的位置与运动方式，从而更好地协调动作。"},"examples":[{"en":"Balance drills build body awareness and reduce the risk of ankle injuries.","zh":"平衡训练能增强身体觉察，降低脚踝受伤风险。"},{"en":"He improved his body awareness and stopped bumping into other players.","zh":"他的身体觉察提高了，不再总是撞到其他球员。"}]}],"synonyms":["somatic awareness","physical awareness","proprioceptive awareness"],"phonetic":"/ˈbɑdi əˈwɛrnəs/","extraExplanation":["“body awareness”常见于健康、心理与训练语境，和正念（mindfulness）、身心疗法（somatic therapy）、瑜伽/普拉提、舞蹈训练等高度相关，强调“把注意力带回身体”。","相关概念：proprioception（本体感觉，偏“身体在空间中的位置感”）与 interoception（内感受，偏“饥饿、心跳、呼吸等体内信号”）。日常说“body awareness”通常更宽泛，二者都可能涵盖。","写法上更常见不加连字符的 body awareness；加连字符 body-awareness 多用于作定语（如 body-awareness exercises/ training），表示“身体觉察的”。"]}
{"word":"body-building","summary":{"en":"muscle-focused training to build a strong, muscular physique","zh":"以增肌塑形为目标的训练或运动"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity or sport of training the body (especially muscles) with exercise, usually including weight training, to become stronger and more muscular","zh":"健美；健身增肌训练（尤指通过力量训练/举重让肌肉更发达）"},"examples":[{"en":"He started body-building to gain muscle and improve his posture.","zh":"他开始做健美训练来增肌并改善体态。"},{"en":"Body-building requires consistent training, enough protein, and good sleep.","zh":"健美训练需要长期坚持训练、足够的蛋白质和良好的睡眠。"},{"en":"She follows a body-building program at the gym three times a week.","zh":"她每周在健身房按健美训练计划练三次。"}]}],"synonyms":["bodybuilding","strength training","weight training","resistance training","muscle building"],"phonetic":"/ˈbɑdi ˌbɪldɪŋ/","extraExplanation":["拼写提示：英式英语更常写作 bodybuilding（不加连字符）；带连字符的 body-building 也可见，尤其在较早或强调复合词时。","相关表达：bodybuilder（健美运动员）；bodybuilding contest/competition（健美比赛）；strength training / weight training（力量训练/重量训练，范围更广，不一定以“健美”外形为目标）。"],"etymology":"由 body（身体）+ building（建造、塑造）构成，字面意思是“把身体塑造起来”。20世纪起常用来指以增肌塑形为目标的训练与比赛运动。","mnemonic":["把它拆开记：body（身体）+ building（建造）＝“建造身体”→“塑造肌肉的训练”。","联想中文“增肌塑形”：building ≈ “塑形/打造”，body ≈ “身体”。"]}
{"word":"body-friendly","summary":{"en":"“Body-friendly” means either (1) comfortable/safe for the body or (2) supportive and non-judgmental about different body types, depending on context.","zh":"“body-friendly”可指（1）对身体更舒适/安全/健康，或（2）对不同体型更包容、不身材羞辱；含义取决于语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed or suitable for the human body; comfortable, safe, or healthy to use or wear (often said of clothes, products, furniture, or exercise plans).","zh":"对人体友好；符合人体需求的；使用/穿戴时舒适、安全或更健康（常用于衣物、产品、家具或运动方案）。"},"examples":[{"en":"These shoes are body-friendly—you can walk all day without foot pain.","zh":"这双鞋很“对身体友好”，走一整天脚也不疼。"},{"en":"Try a body-friendly workout that protects your knees and back.","zh":"试试对身体更友好的训练，保护膝盖和腰背。"}]},{"partOfSpeech":"adj.","definition":{"en":"Kind and supportive toward people of all body types; not shaming or judging appearance (often used in discussions about media, fashion, or workplace culture).","zh":"对各种体型更包容、更友善；不羞辱或评判外貌（常用于媒体、时尚或职场文化语境）。"},"examples":[{"en":"The brand wants a more body-friendly message in its ads.","zh":"这个品牌希望广告传递更包容、更尊重身材的讯息。"},{"en":"We’re building a body-friendly environment where no one is mocked for their size.","zh":"我们在营造一个更尊重身材的环境，不嘲笑任何人的体型。"}]}],"synonyms":["body-safe","ergonomic","comfortable","gentle on the body","body-positive","inclusive"],"phonetic":"/ˈbɑdi ˈfrɛndli/","extraExplanation":["“body-friendly”是一个较口语、较灵活的复合形容词，常用连字符表示“对身体友好”。在产品/设计语境里接近“ergonomic（符合人体工学的）”“body-safe（对身体无害的）”；在社会文化语境里接近“body-positive（身体自信/不身材羞辱的）”。具体含义通常要看上下文。","写作中如果想更正式、避免歧义：描述舒适与健康可用“comfortable / ergonomic / gentle on the body”；强调包容与反羞辱可用“body-positive / inclusive”。"]}
{"word":"body-hugging","summary":{"en":"Body-hugging describes clothing that fits very tightly to your body.","zh":"Body-hugging 指衣服非常贴身、紧身。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of clothes) very tight and closely fitted to the shape of your body.","zh":"（形容衣服）紧身的，贴合身体曲线的。"},"examples":[{"en":"She wore a body-hugging dress to the party.","zh":"她穿了一条紧身连衣裙去参加派对。"},{"en":"Body-hugging jeans can look stylish, but they may feel uncomfortable after a long day.","zh":"紧身牛仔裤可能很时髦，但穿一整天可能会不舒服。"},{"en":"The brand is known for body-hugging athletic wear.","zh":"这个品牌以紧身运动服闻名。"}]}],"synonyms":["tight-fitting","form-fitting","figure-hugging","close-fitting"],"phonetic":"/ˈbɑdi ˌhʌɡɪŋ/","extraExplanation":["“body-hugging”是复合形容词，字面意思是“像拥抱身体一样贴着”。常用于时尚语境，也常见近义说法：tight-fitting / form-fitting / figure-hugging。","语气通常中性或偏正面（强调显身材、利落），但也可能带一点“太紧”的含义；在正式场合可以用更中性的“close-fitting”。"]}
{"word":"body-in-white","summary":{"en":"“Body-in-white” is a rare, literary-style phrase for a corpse or ghostlike figure dressed or wrapped in white, or sometimes simply someone wearing all white.","zh":"“body-in-white”较少见，偏文学化，常指穿着/裹着白色的尸体或幽灵般的身影；有时也可指全身穿白的人。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Literary/figurative) A corpse or a ghostlike figure imagined as dressed or wrapped in white (for example, in a burial shroud, a sheet, or white clothing).","zh":"（文学/比喻）指被想象为穿着或裹着白色的尸体或幽灵般的身影（如裹尸布、白床单或白衣）。"},"examples":[{"en":"In the old story, a body-in-white wanders through the hallway at midnight.","zh":"在那个老故事里，一个“白衣之躯”在午夜的走廊里徘徊。"},{"en":"The detective found a body-in-white on the gurney, already covered with a sheet.","zh":"侦探看到担架上一具“裹着白布的尸体”，已经被床单盖住了。"}]},{"partOfSpeech":"phrase","definition":{"en":"(Rare; descriptive) A person dressed entirely in white, especially when the all-white clothing creates a striking or eerie impression.","zh":"（较少见；描述性）指全身穿白的人，尤指全白穿着带来醒目或阴森的感觉。"},"examples":[{"en":"A body-in-white stood at the edge of the crowd, easy to spot.","zh":"人群边缘站着一个“全身白衣的人”，很容易被注意到。"},{"en":"On stage, the dancer appeared as a body-in-white under the spotlight.","zh":"舞台上，舞者在聚光灯下呈现出“白衣之身”的形象。"}]}],"synonyms":["figure in white","ghost in white","body covered in a white sheet","body in a shroud"],"phonetic":"/ˌbɑdi ɪn ˈwaɪt/","extraExplanation":["这个表达不是现代英语里的常用固定搭配，更常见的说法是 a body covered in a white sheet（被白布盖着的尸体）、a body in a white shroud（裹尸布中的遗体）或 a figure in white（白衣身影）。","在侦探/犯罪语境中使用时要注意语气与场合；与死亡有关的描述在真实对话中可能显得过于直白，写作里则更常用来营造氛围或悬疑感。"]}
{"word":"body-language","summary":{"en":"Nonverbal communication shown through posture, gestures, facial expressions, and other physical cues.","zh":"通过姿势、手势、表情等身体线索进行的非语言沟通。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The way people communicate feelings, attitudes, or intentions through movements and posture (for example, facial expressions, eye contact, gestures, and how they stand or sit), rather than through words.","zh":"指人们用动作和姿态来传达情绪、态度或意图的方式（如面部表情、眼神、手势、站姿坐姿等），而不是用语言表达。"},"examples":[{"en":"Her body language showed she was nervous: she kept looking down and twisting her hands.","zh":"她的肢体语言显示她很紧张：一直低头、扭着手。"},{"en":"Try to keep open body language during the interview—sit up straight and make eye contact.","zh":"面试时尽量保持开放的肢体语言——坐直并进行眼神交流。"}]}],"synonyms":["nonverbal communication","nonverbal cues","physical cues","gestures"],"phonetic":"/ˈbɑdi ˌlæŋɡwɪdʒ/","extraExplanation":["“body language”常写作两词；写成“body-language”多见于作定语的复合形式或排版需要（如body-language cues/analysis），意思不变。","肢体语言的解读会受文化影响：例如在一些文化里直视表示自信与诚恳，在另一些文化里直视可能被视为不礼貌或有挑战性。学习时可结合具体语境与文化背景判断。","相关常见搭配：read someone’s body language（读懂某人的肢体语言）、open/closed body language（开放/封闭的肢体语言）、nonverbal communication（非语言沟通）。"]}
{"word":"body-language-related","summary":{"en":"Body-language-related means connected with communication through gestures, posture, and facial expressions.","zh":"body-language-related 指与肢体语言（手势、姿势、表情等非语言沟通）相关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with body language (the way people communicate through posture, gestures, facial expressions, eye contact, etc.)","zh":"与“肢体语言”有关的；和姿势、手势、表情、眼神等非语言沟通相关的"},"examples":[{"en":"The trainer covered several body-language-related cues, like avoiding crossed arms during interviews.","zh":"培训师讲了几种与肢体语言有关的提示，比如面试时尽量避免双臂交叉。"},{"en":"Misunderstandings can come from body-language-related differences across cultures.","zh":"跨文化的肢体语言差异可能会造成误解。"}]}],"synonyms":["related to body language","nonverbal","nonverbal-communication-related","gesture-related"],"phonetic":"/ˈbɑdi ˌlæŋɡwɪdʒ rɪˈleɪtɪd/","extraExplanation":["“body-language-related”是由名词短语“body language”加上“related”组成的复合形容词，放在名词前作定语时常用连字符：a body-language-related issue。","放在名词后作表语时通常不加连字符更自然：The issue is body language related / related to body language（更常见的是“related to body language”）。","学术或正式写作里，如果想更清晰、也更常见的表达，可以用：“related to body language”或“nonverbal-communication-related”。"]}
{"word":"body-measurement","summary":{"en":"Body measurement(s): the measured sizes of a person’s body, used for clothing, tailoring, fitness, or health.","zh":"Body measurement(s)：人体各部位的尺寸数据，用于服装尺码、裁缝、健身或健康记录。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A measurement of a person’s body size (such as chest, waist, hips, inseam, or height), often used for clothing, tailoring, fitness tracking, or health records.","zh":"人体尺寸测量（如胸围、腰围、臀围、内侧裤长或身高等），常用于服装尺码、裁缝、健身追踪或健康记录。"},"examples":[{"en":"Please provide your body measurements so we can recommend the right size.","zh":"请提供你的身体尺寸，这样我们才能推荐合适的尺码。"},{"en":"The tailor took my body measurements before making the suit.","zh":"裁缝在做西装前先量了我的身体尺寸。"},{"en":"She recorded her body measurements every month to track changes from training.","zh":"她每个月记录一次身体尺寸，用来追踪训练带来的变化。"}]}],"synonyms":["measurements","body size","anthropometric measurements","sizing measurements"],"phonetic":"/ˈbɑdi ˈmɛʒɚmənt/","extraExplanation":["在英语里更常见的写法是 **body measurement(s)**（不加连字符）。带连字符的 **body-measurement** 多用于作定语，修饰名词：例如 **a body-measurement chart / a body-measurement app**（人体尺寸表/量体应用）。","常见搭配：**take body measurements**（量尺寸）、**body measurements chart**（尺寸表）、**measurements: bust/chest, waist, hips, inseam**（胸围/胸部、腰围、臀围、内侧裤长）。注意英美在服装尺码与单位（inch/centimeter）上可能不同。"]}
{"word":"body-painting","summary":{"en":"art of painting designs directly on the skin","zh":"在皮肤上直接绘制图案的艺术或活动"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the art or practice of painting designs or colors on the human body (often for festivals, performances, fashion, or rituals)","zh":"人体彩绘；在人体上绘制图案或上色（常用于节庆、表演、时尚或仪式）"},"examples":[{"en":"They offered free body-painting at the summer festival.","zh":"夏日节上他们提供免费的人体彩绘。"},{"en":"Body-painting can be used in theater to create special effects.","zh":"在人剧场中，人体彩绘可用于制造特殊效果。"}]}],"synonyms":["body art","skin painting","painted body"],"phonetic":"/ˈbɑdi ˌpeɪntɪŋ/","extraExplanation":["在不同文化中，人体彩绘可能是艺术表演，也可能与传统仪式、身份标记或庆典有关。语境中通常中性，但谈到“公共场合、裸露、同意与尊重”时需要注意文化差异与礼仪。","常与 face painting（脸部彩绘）区分：face painting 多指儿童活动或只画脸；body-painting 范围更大，可能覆盖更大面积。"],"etymology":"由 body（身体）+ painting（绘画）组成的复合词；现代英语中多用于指将颜料直接画在皮肤上的艺术与活动。","mnemonic":["拆开记：body（身体）+ painting（画画）= 在身体上画画。","联想“节日涂鸦/彩绘”：把身体当画布（canvas）来记忆。"]}
{"word":"body-related","summary":{"en":"Body-related means connected with the body, especially health, body parts, or bodily functions.","zh":"body-related 指“与身体有关的”，尤指健康、身体部位或生理功能。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with the human (or animal) body—especially physical parts, health, appearance, or bodily functions.","zh":"与人体（或动物身体）有关的；尤指身体部位、健康、外表或生理功能方面的。"},"examples":[{"en":"The doctor asked a few body-related questions about pain and sleep.","zh":"医生问了一些与身体有关的问题，比如疼痛和睡眠。"},{"en":"The book includes body-related vocabulary like “stomach,” “muscle,” and “skin.”","zh":"这本书包含一些与身体有关的词汇，如“胃”“肌肉”和“皮肤”。"},{"en":"In some cultures, body-related topics can feel private, so people speak more indirectly.","zh":"在一些文化中，与身体有关的话题可能比较隐私，所以人们会说得更含蓄。"}]}],"synonyms":["bodily","physical","anatomical","health-related"],"phonetic":"/ˈbɑdi rɪˈleɪtɪd/","extraExplanation":["“body-related”是一个由名词 body + 形容词 related 组成的复合形容词，常用连字符连接，放在名词前作定语：body-related issues/questions/vocabulary。放在名词后也可以（较少见）：These issues are body-related。","语气通常较中性、偏正式，常用于医学、健康教育、心理咨询、体育训练、语言学习等语境。若要更口语，可以用 about the body / physical / bodily。","注意区别：bodily 更常指“身体的、生理的”（bodily pain / bodily functions）；physical 既可指“身体的”也可指“物质的、非精神的”；body-related 更强调“和身体这个主题有关”。"]}
{"word":"body-shape","summary":{"en":"a person’s overall body outline and proportions","zh":"人的整体体型轮廓与比例"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the overall outline and proportions of a person’s body (how the body looks in terms of curves, width, and balance)","zh":"体型；身材轮廓（指一个人的整体线条与比例）"},"examples":[{"en":"Different body shapes can look great in the same outfit.","zh":"不同体型的人穿同一套衣服也都可以很好看。"},{"en":"She chose a dress that suits her body shape.","zh":"她选了一条适合自己体型的裙子。"}]},{"partOfSpeech":"n.","definition":{"en":"the outline or form of an object (used less commonly than for people)","zh":"（较少用）物体的外形；形状"},"examples":[{"en":"The bottle’s body shape makes it easy to hold.","zh":"这个瓶子的外形让它很容易握住。"}]}],"synonyms":["figure","build","physique","body type","silhouette","shape"],"phonetic":"/ˈbɑdi ʃeɪp/","extraExplanation":["写法提示：常见写法有 body shape（更常见、较正式/通用）和 body-shape（作定语时更像形容词用法，如 body-shape guide）。","语境建议：讨论身材时尽量用中性、尊重的表达，避免把“某种体型=好/坏”绝对化。可以说 “different body shapes” 或 “a range of body shapes”。","相关搭配：body-shape guide（体型指南）、body-shape analysis（体型分析）、hourglass/pear/apple/rectangle（沙漏/梨形/苹果形/直筒形——常见分类，但不代表医学标准）。"],"etymology":"由 body（身体）+ shape（形状）构成的复合词；在现代英语中常用于时尚、健身与健康话题，强调“整体轮廓与比例”。","mnemonic":["把它拆开记：body=身体，shape=形状 → 合起来就是“身体的形状”。","联想中文“身材=身体+才（形态）”，对应英语也是“body+shape”。"]}
{"word":"body-snatcher","summary":{"en":"A body-snatcher is either a grave robber who steals corpses or, in sci‑fi/horror, something that takes over a person’s body or identity.","zh":"body-snatcher 可指盗尸者（盗墓取尸），也可指科幻/恐怖作品中夺取他人身体或身份的存在。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who steals dead bodies from graves, especially to sell them for medical study (historically common in the 18th–19th centuries).","zh":"盗尸者；盗墓取尸者（尤指18—19世纪为卖给医学院解剖研究而盗取尸体的人）"},"examples":[{"en":"In the 1800s, some medical schools secretly bought bodies from body-snatchers.","zh":"在19世纪，一些医学院会暗中向盗尸者购买尸体。"},{"en":"The villagers guarded the cemetery at night, afraid of body-snatchers.","zh":"村民们夜里守着墓地，害怕盗尸者出没。"}]},{"partOfSpeech":"n.","definition":{"en":"(In science fiction or horror) A being that takes over someone’s body or identity, as if “stealing” the person from inside.","zh":"（科幻/恐怖语境）夺取他人身体或身份的存在；“夺舍者”"},"examples":[{"en":"The film is about body-snatchers who copy humans and replace them.","zh":"这部电影讲的是“夺舍者”复制人类并取而代之。"},{"en":"He joked that stress turned him into a body-snatcher—he didn’t feel like himself anymore.","zh":"他开玩笑说压力把他变成了“夺舍者”——他觉得自己都不像自己了。"}]}],"synonyms":["grave robber","corpse thief","resurrectionist","body thief","possessor"],"phonetic":"/ˈbɑdi snætʃɚ/","extraExplanation":["“body-snatcher”字面是“抢走身体的人”。历史上更常指“盗尸者”，与当时医学发展有关：解剖教学需要遗体，但合法来源不足，导致盗墓取尸的黑市兴起。","在流行文化中，这个词常让人联想到科幻经典《Invasion of the Body Snatchers》（《天外魔花》），因此第二个义项（夺取身体/身份的怪物或外星人）也很常见。"]}
{"word":"body-snatching","summary":{"en":"Body-snatching means stealing a dead body (often from a grave), historically linked to selling bodies for medical dissection.","zh":"Body-snatching 指偷尸（常从坟墓盗取尸体），历史上常与卖给医学院用于解剖有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of secretly stealing a dead body from a grave or morgue, especially to sell it for medical study or dissection.","zh":"偷尸（从坟墓或停尸间秘密盗取尸体的行为），尤指为卖给医学院解剖或研究。"},"examples":[{"en":"In the 1800s, body-snatching supplied medical schools with cadavers.","zh":"在19世纪，偷尸为医学院提供了解剖用的尸体。"},{"en":"The cemetery hired guards after several cases of body-snatching.","zh":"墓地在发生多起偷尸事件后雇了守卫。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to or involving the theft of corpses.","zh":"与偷尸有关的；涉及盗取尸体的。"},"examples":[{"en":"The novel tells a body-snatching story set in Edinburgh.","zh":"这部小说讲述了一个发生在爱丁堡的偷尸故事。"}]}],"synonyms":["grave robbing","corpse theft","body stealing","grave robbery"],"phonetic":"/ˈbɑˌdi ˌsnætʃɪŋ/","extraExplanation":["“body-snatching”在英美文化里常让人联想到18—19世纪的“resurrection men（掘尸者/盗尸者）”。当时医学教育需要尸体解剖，但合法来源不足，于是出现了偷尸并卖给医学院的黑市。","文学与大众文化中常见相关作品与主题，例如罗伯特·路易斯·史蒂文森的短篇《The Body Snatcher（偷尸者）》等，因此这个词在恐怖/哥特题材中也较常见。","相关近义表达：body snatcher（偷尸者）、grave robber（盗墓者，范围更广）、resurrection man（掘尸者，历史语境较强）。"]}
{"word":"bodybending","summary":{"en":"Bodybending means bending the body for stretching, flexibility, or movement practice; it’s an uncommon term and often replaced by more specific words like “stretching” or “contortion.”","zh":"Bodybending 指为拉伸、柔韧或动作训练而进行的身体弯曲练习；这个词不算常见，常用更具体的说法如 stretching（拉伸）或 contortion（柔术/软功）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or practice of bending your body (for example in stretching, yoga, dance, gymnastics, or physical training) to improve flexibility, control, or posture","zh":"“弯曲身体”的动作或练习（如拉伸、瑜伽、舞蹈、体操或体能训练中），用来提升柔韧性、控制力或姿势"},"examples":[{"en":"The warm-up includes light bodybending to loosen the back and hips.","zh":"热身包含一些轻度的身体弯曲练习，用来放松背部和髋部。"},{"en":"Bodybending helps dancers move smoothly and avoid injury.","zh":"身体弯曲训练能帮助舞者动作更流畅，也能减少受伤。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, creative use) a style of movement or performance that focuses on extreme bends and contortion-like shapes","zh":"（非正式、偏创意的用法）一种强调大幅度弯折、类似“软功/柔术”造型的动作或表演风格"},"examples":[{"en":"Her routine mixes hip-hop with bodybending and floor work.","zh":"她的编舞把嘻哈、身体弯折动作和地板动作结合在一起。"}]}],"synonyms":["stretching","flexibility training","contortion","bending exercises"],"phonetic":"/ˈbɑːdi ˌbɛndɪŋ/","extraExplanation":["“bodybending”不是非常标准、常见的词；更常见的写法是分开写：body bending，或用更具体的词，如 stretching（拉伸）、flexibility training（柔韧训练）、contortion（柔术/软功表演）。","如果你是在《降世神通：最后的气宗》（Avatar）那类语境里看到，它可能是粉丝或创作者的延伸说法（把“bending（御术/操控元素）”套到“身体”上），但这不是固定成语。正式表达建议根据语境换成更明确的词。"]}
{"word":"bodybuild","summary":{"en":"Bodybuild means to develop muscle and shape your body through strength training, especially weightlifting.","zh":"bodybuild 指通过力量训练（尤指举重）来增肌并塑造体型。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to develop your muscles and body shape through strength training (especially weightlifting)","zh":"通过力量训练（尤指举重）来锻炼肌肉、塑造体型"},"examples":[{"en":"He started to bodybuild after college to get stronger.","zh":"他大学毕业后开始健身增肌，让自己更强壮。"},{"en":"Many people bodybuild for health, confidence, or competition.","zh":"很多人健身增肌是为了健康、自信或参加比赛。"}]},{"partOfSpeech":"vt.","definition":{"en":"to build up a person’s body (muscles) through a planned training and diet program","zh":"通过系统训练与饮食计划来让某人的身体（肌肉）变得更强壮"},"examples":[{"en":"The coach helps athletes bodybuild safely with a structured plan.","zh":"教练用系统计划帮助运动员安全地增肌塑形。"}]}],"synonyms":["build muscle","work out","lift weights","train","strength-train"],"phonetic":"/ˈbɑdiˌbɪld/","extraExplanation":["“bodybuild”常见也写作“body-build”（带连字符）或更常用的名词形式“bodybuilding（健美/健身增肌）”。做这项运动的人叫“bodybuilder（健美运动员/健身增肌者）”。在日常口语里，人们也常用“work out”“lift weights”“build muscle”来表达相近意思。"]}
{"word":"bodybuilder","summary":{"en":"A bodybuilder is someone who trains to develop large, defined muscles, often for fitness or competitions.","zh":"bodybuilder 指通过训练增肌塑形的人，常与健身或健美比赛相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who trains to build large, well-defined muscles, often for fitness or competitions","zh":"健美运动员；健身增肌者（通过训练练出更大、更清晰的肌肉，常用于健身或比赛）"},"examples":[{"en":"My cousin is a bodybuilder who trains six days a week.","zh":"我表哥是个健美运动员，每周训练六天。"},{"en":"The bodybuilder followed a strict diet to prepare for the competition.","zh":"这位健美运动员为了比赛遵循严格的饮食计划。"}]}],"synonyms":["bodybuilder","weight trainer","muscle builder"],"phonetic":"/ˈbɑːdiˌbɪldɚ/","extraExplanation":["在英语里，bodybuilder 通常指“以增肌塑形为核心目标”的训练者，语感比 gym-goer（去健身房的人）更“专业/更投入”。如果强调参加比赛，可说 competitive bodybuilder（竞赛型健美选手）。","常见搭配：natural bodybuilder（自然健美，通常暗示不使用违禁药物）、bodybuilding competition（健美比赛）、pose/posing（摆造型展示肌肉线条）。"]}
{"word":"bodybuilders","summary":{"en":"Bodybuilders are people who train to build a very muscular body, often with weightlifting, diet, and sometimes competition.","zh":"Bodybuilders 指通过力量训练与饮食来塑造明显肌肉的人，常与健美比赛或增肌训练相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who builds very muscular strength and appearance through weight training, diet, and practice (often for sport or competition)","zh":"健美运动员；健身增肌者（通过力量训练、饮食与规律练习来塑造肌肉，常用于比赛）"},"examples":[{"en":"Many bodybuilders follow strict meal plans to support muscle growth.","zh":"许多健美运动员会遵循严格的饮食计划来帮助肌肉生长。"},{"en":"The gym has a separate area where bodybuilders practice posing for competitions.","zh":"健身房有一块专门区域，供健美选手练习比赛摆姿。"},{"en":"Some bodybuilders train for health, while others focus on competing.","zh":"有些增肌者为了健康训练，也有人专注于参赛。"}]}],"synonyms":["muscle builders","weightlifters (sometimes, but not the same)","fitness enthusiasts (broader)"],"phonetic":"/ˈbɑdiˌbɪldɚz/","extraExplanation":["“Bodybuilders”是“bodybuilder”的复数。日常语境里，它既可以指参加健美比赛的人，也可以泛指以“增肌塑形”为主要目标的力量训练者。","健美比赛（bodybuilding competitions）除了比肌肉大小，也重视对称性、线条、舞台表现与“摆姿”（posing）。"]}
{"word":"bodybuilding","summary":{"en":"Bodybuilding is the activity or sport of building muscle through training, diet, and sometimes competition posing.","zh":"Bodybuilding 指通过训练与饮食来增肌塑形的活动或运动，也可包含比赛摆姿势展示肌肉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the sport or activity of developing muscles through weight training, diet, and posing for competition or fitness","zh":"健美；通过力量训练、饮食控制与摆姿势来增强肌肉的运动或活动（可用于比赛或健身）"},"examples":[{"en":"He started bodybuilding to build strength and improve his posture.","zh":"他开始练健美是为了增强力量并改善体态。"},{"en":"Bodybuilding competitions often include mandatory poses to show muscle definition.","zh":"健美比赛通常有规定动作，用来展示肌肉线条。"},{"en":"Her bodybuilding routine includes weight training, high-protein meals, and enough sleep.","zh":"她的健美训练包括力量训练、高蛋白饮食和充足睡眠。"}]}],"synonyms":["physique training","muscle building","weight training (related)"],"phonetic":"/ˈbɑdiˌbɪldɪŋ/","extraExplanation":["“Bodybuilding”在英语里通常指“健美”这项活动/运动；如果强调“健身增肌”但不以比赛为目标，也可以用更广的说法：weight training（力量训练）、strength training（力量训练/增力训练）。","文化语境：在欧美语境中，bodybuilding既可以是健康的训练爱好，也常与“比赛备赛”（cutting减脂、bulking增肌增重）联系在一起；日常聊天里说“I do bodybuilding”往往表示认真练力量、追求肌肉增长与体型塑造。"]}
{"word":"bodybuilding exercise","summary":{"en":"a muscle-building strength-training movement","zh":"用于增肌塑形的力量训练动作"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a type of strength training movement done to build muscle size and shape (for example, bench press, squat, biceps curl)","zh":"以增大和塑造肌肉为目的的力量训练动作（如卧推、深蹲、二头弯举）"},"examples":[{"en":"The bench press is a classic bodybuilding exercise for the chest.","zh":"卧推是锻炼胸肌的经典健美动作。"},{"en":"Choose a bodybuilding exercise you can control with good form.","zh":"选择你能用标准动作稳定控制的健美训练动作。"},{"en":"He added one bodybuilding exercise for shoulders at the end of the workout.","zh":"他在训练末尾加了一个肩部的健美动作。"}]}],"synonyms":["strength exercise","resistance exercise","weightlifting exercise","hypertrophy exercise"],"phonetic":"/ˈbɑːdiˌbɪldɪŋ ˈɛksərsaɪz/","etymology":"“bodybuilding”意为“健美、增肌”，由 body（身体）+ building（建造、塑造）组合而成；与 exercise（锻炼、训练动作）搭配后，指用于增肌塑形的训练动作。","mnemonic":["把它拆开记：body（身体）+ building（建造/塑造）→ “塑造身体”的训练；再加 exercise（动作/锻炼）→ “健美训练动作”。","联想中文：健美=“建”身体的“美”，bodybuilding 正好是“建造身体”。"]}
{"word":"bodybuilding-obsessed","summary":{"en":"“Bodybuilding-obsessed” means very (sometimes excessively) focused on bodybuilding.","zh":"“bodybuilding-obsessed”表示对健身/健美非常着迷（有时带“过度沉迷”的含义）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Extremely interested in bodybuilding; spending a lot of time thinking about it, talking about it, or training for it (sometimes suggesting it’s excessive).","zh":"痴迷健身/健美的；对健美训练非常着迷（有时暗示有点过头）。"},"examples":[{"en":"He’s bodybuilding-obsessed and never misses a day at the gym.","zh":"他痴迷健美，从不缺席一天健身房训练。"},{"en":"Her bodybuilding-obsessed lifestyle makes it hard to join friends for late-night food.","zh":"她痴迷健美的生活方式让她很难和朋友一起吃宵夜。"}]}],"synonyms":["bodybuilding-mad","gym-obsessed","fitness-obsessed","bodybuilding-focused"],"phonetic":"/ˈbɑdiˌbɪldɪŋ əbˈsɛst/","extraExplanation":["这是由“bodybuilding（健身/健美）+ obsessed（着迷的、痴迷的）”组成的复合形容词，常用连字符连接，用来修饰名词（如：a bodybuilding-obsessed friend）。","语气上通常比“really into bodybuilding（很喜欢健美）”更强，可能带一点负面含义，表示兴趣影响了生活平衡。想更中性可说：bodybuilding-focused（以健美为重）或 dedicated to bodybuilding（致力于健美）。"]}
{"word":"bodycheck","summary":{"en":"A bodycheck is a legal (or sometimes illegal) body hit used especially in hockey; to bodycheck means to make that hit.","zh":"bodycheck 指（尤指冰球中的）身体冲撞；作动词表示进行这种身体冲撞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In hockey and some other contact sports) a forceful hit using your body (not your stick) to stop or separate an opponent from the puck/ball.","zh":"（冰球等身体对抗运动中）用身体（不是用球杆）强力撞击对手，以阻止或把对手与冰球/球分开。"},"examples":[{"en":"The defender knocked the forward off the puck with a clean bodycheck.","zh":"防守队员用一次干净利落的身体冲撞把前锋从冰球旁顶开。"},{"en":"The referee called a penalty because the bodycheck was from behind.","zh":"裁判判了犯规，因为那次身体冲撞是从背后撞的。"}]},{"partOfSpeech":"v.","definition":{"en":"To hit an opponent with your body, following the rules of the sport.","zh":"（按规则）用身体冲撞对手。"},"examples":[{"en":"You can bodycheck only when the opponent has the puck.","zh":"通常只有在对手控球（持球）时你才可以进行身体冲撞。"},{"en":"He tried to bodycheck the player into the boards.","zh":"他试图把那名球员用身体冲撞顶到围板上。"}]}],"synonyms":["body check","check (hockey)","hit (sports)","shoulder check"],"phonetic":"/ˈbɑdi ˌtʃɛk/","extraExplanation":["“Bodycheck”更常写作两词：body check；在体育新闻、比赛解说或北美冰球语境中非常常见。不同联赛/年龄组对是否允许body checking（身体对抗）规定不同：例如青少年联赛往往限制，以降低受伤风险。","在冰球里，合法的body check一般强调“对方持球/控球”“正面或侧面接触”“不击打头部、不过度用肘/手臂”等；常见的违规相关词有 checking from behind（背后冲撞）、boarding（顶撞到围板导致危险）、charging（助跑过远冲撞）。"]}
{"word":"bodycolor","summary":{"en":"“bodycolor” usually means the main/base color of a body (or, in computing, a setting for the body’s main/background color).","zh":"“bodycolor”通常指主体/底色；在计算机语境中也可指页面或组件主体的主色/背景色设置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The color of a main body (of a person, animal, object, or character), especially the overall/base color before markings or details.","zh":"（人、动物、物体或角色的）主体颜色；尤指在花纹或细节之前的整体/底色。"},"examples":[{"en":"The bird’s bodycolor is pale gray, with darker wings.","zh":"这只鸟的主体颜色是浅灰色，翅膀更深。"},{"en":"Choose a bodycolor first, then add stripes or spots.","zh":"先选一个主体底色，再加条纹或斑点。"}]},{"partOfSpeech":"n.","definition":{"en":"(Computing/UI) A setting or attribute name meaning the background or main color of the page/app body or a component.","zh":"（计算机/界面）一个设置或属性名，指页面/应用主体（body）或组件的背景色/主色。"},"examples":[{"en":"Change the bodycolor to improve readability in dark mode.","zh":"把主体背景色（bodycolor）改一下，让深色模式更易读。"},{"en":"This theme lets you customize text color and bodycolor separately.","zh":"这个主题允许你分别自定义文字颜色和主体背景色（bodycolor）。"}]}],"synonyms":["body color","base color","main color","background color"],"phonetic":"/ˈbɑdi ˌkʌlər/","extraExplanation":["“bodycolor”不是最常见的日常英语单词，更常见的写法是分开写：body color。它多见于设计、游戏/3D建模、皮肤/主题设置、或某些代码/配置项命名中（命名风格可能是bodyColor、body_colour等）。","在网页CSS里，通常会说“the body background color / the body text color”，而不是把它写成一个固定单词；但在某些框架、模板或配置文件里，作者可能把它作为字段名使用。"]}
{"word":"bodyguard","summary":{"en":"A bodyguard is a person paid or assigned to protect someone from harm.","zh":"bodyguard 指受雇或受派保护他人安全的“保镖/护卫”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person whose job is to protect someone (especially an important or famous person) from danger.","zh":"保镖；贴身护卫（负责保护某人，尤其是重要人物或名人免受危险）。"},"examples":[{"en":"The actress arrived with a bodyguard at her side.","zh":"那位女演员到场时，身边跟着一名保镖。"},{"en":"He hired a bodyguard after receiving threats.","zh":"他收到威胁后雇了保镖。"}]},{"partOfSpeech":"v.","definition":{"en":"To protect someone closely, like a bodyguard does (less common).","zh":"担任保镖保护；贴身护卫（不常用作动词）。"},"examples":[{"en":"Security staff bodyguarded the speaker through the crowd.","zh":"安保人员护送并贴身保护演讲者穿过人群。"}]}],"synonyms":["protector","guard","security guard","personal security","escort"],"phonetic":"/ˈbɑdiˌɡɑrd/","extraExplanation":["“bodyguard”由 body（身体）+ guard（守卫）构成，字面意思是“守护身体的人”。现代常见于名人、政要或高风险行业的安全保护语境。","在英语里也常说 personal security（人身安保）或 security detail（安保小组/警卫队）来更正式地表达“保镖/护卫团队”。"]}
{"word":"bodyguards","summary":{"en":"“Bodyguards” means people employed to protect someone important from harm.","zh":"“bodyguards”指受雇保护重要人物、避免其受到伤害的保镖/护卫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People whose job is to protect an important person from danger (plural of “bodyguard”).","zh":"保镖；贴身护卫（“bodyguard”的复数），指负责保护重要人物免受危险的人。"},"examples":[{"en":"The singer arrived with two bodyguards.","zh":"这位歌手在两名保镖的陪同下到达。"},{"en":"Bodyguards kept fans away from the entrance.","zh":"保镖把粉丝挡在入口外。"},{"en":"He hired bodyguards after receiving threats.","zh":"他在收到威胁后雇了保镖。"}]}],"synonyms":["security guards","protectors","guards","security detail"],"phonetic":"/ˈbɑdiˌɡɑrdz/","extraExplanation":["“bodyguard”是复合词：body（身体）+ guard（守卫）。在新闻语境中常与名人、政要、企业高管等搭配出现。","英语里也常用更正式的说法“security detail”（安保队伍/警卫组），强调团队而不只是个人。"]}
{"word":"bodyhood","summary":{"en":"Bodyhood is a rare noun meaning the state of having a body or physical existence, sometimes used in religious writing to mean taking on a body.","zh":"bodyhood 是一个较少见的名词，指“有身体的状态/肉身存在”，在宗教写作中有时也指“取肉身、披戴身体”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or condition of having a body; physical (bodily) existence","zh":"有身体的状态；肉身存在（身体性）"},"examples":[{"en":"Some philosophers discuss how consciousness relates to our bodyhood.","zh":"一些哲学家讨论意识如何与我们的身体性相关。"},{"en":"After the accident, she became newly aware of her own bodyhood and limits.","zh":"事故之后，她对自己的身体性和局限有了新的认识。"}]},{"partOfSpeech":"n.","definition":{"en":"a physical body considered as something that can be inhabited or taken on (often in religious or mystical writing)","zh":"可被“承载”或“披戴”的肉身（常见于宗教或神秘主义写作）"},"examples":[{"en":"The text describes a spirit entering bodyhood to live among humans.","zh":"文本描述一个灵进入肉身，与人类一同生活。"},{"en":"In the story, the deity chooses bodyhood for a time.","zh":"在故事里，神祇暂时选择披戴肉身。"}]}],"synonyms":["embodiment","bodiliness","physical existence","corporeality","incarnation (religious)"],"phonetic":"/ˈbɑːdiˌhʊd/","extraExplanation":["“bodyhood”在现代英语中非常少见，更常见的说法是“embodiment（具身/体现）”“bodiliness（身体性）”“physical existence（肉身存在）”。写作时如果想自然一些，通常优先用这些替代词。","构词：body + -hood（表示“状态/身份/性质”，如 childhood, adulthood）。因此它的核心意思是“作为一个有身体的人/处于有身体的状态”。","在宗教语境里，它有时会用来谈“道成肉身/取肉身”的概念，但在正式神学表达中更常用“incarnation”。"]}
{"word":"bodying","summary":{"en":"“Bodying” usually means embodying something (giving it a clear physical or visible form). In sports, it can mean using your body to challenge an opponent (a body check).","zh":"“Bodying”常指把抽象事物具体化、体现出来；在体育（尤其冰球）中可指用身体进行对抗或身体冲撞。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “body”) giving a physical form to something; embodying or making an idea real and visible.","zh":"（“body”的现在分词）使某事物具有具体形态；把想法“具象化”、体现出来。"},"examples":[{"en":"The designer is bodying her ideas in a prototype.","zh":"这位设计师正在用原型把她的想法具象化。"},{"en":"Good writing bodies emotion in clear images.","zh":"好的写作会用清晰的意象把情感体现出来。"}]},{"partOfSpeech":"v.","definition":{"en":"(sports, especially hockey) using your body to stop, block, or challenge an opponent; making a body check.","zh":"（体育，尤指冰球）用身体阻挡或对抗对手；进行身体冲撞/身体对抗（body check）。"},"examples":[{"en":"He was bodying the attacker along the boards.","zh":"他在边板处用身体对抗那名进攻球员。"},{"en":"The coach warned the players to avoid illegal bodying.","zh":"教练提醒队员避免违规的身体对抗。"}]}],"synonyms":["embodying","incarnating","giving form to","physicalizing","checking (sports)"],"phonetic":"/ˈbɑdiɪŋ/","extraExplanation":["“bodying”在日常英语中不如“embodying”常见；当你想表达“体现、具象化（想法/精神/价值）”时，用“embodying”通常更自然、更书面。","在文学或较正式的语境里，“to body”有“赋形、使成形”的味道，常用于抽象概念（如情感、理想、精神）变得可见、可感。"]}
{"word":"bodykins","summary":{"en":"An archaic mild exclamation meaning “by my body!” used for surprise or emphasis.","zh":"一种古语中的温和感叹/誓语，用于表示惊讶或强调，类似“天哪/哎呀”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(Archaic) A mild oath or exclamation meaning “by my body!” used to show surprise, annoyance, or emphasis.","zh":"（古语）一种较温和的誓语/感叹，用来表示惊讶、不满或强调，意思相当于“凭我的身体/天哪！”"},"examples":[{"en":"Bodykins! I didn’t expect to see you here.","zh":"Bodykins！我没想到会在这里见到你。"},{"en":"Bodykins, you scared me—don’t sneak up like that.","zh":"Bodykins，你吓到我了——别那样悄悄靠近。"}]}],"synonyms":["zounds","’sblood","by my troth","faith"],"phonetic":"ˈbɑdikɪnz","extraExplanation":["这是早期现代英语（约16–17世纪）里常见的“轻度誓语”（minced oath）。当时很多人会避免直接说带宗教意味的誓词（如涉及上帝或基督身体），于是用较委婉的替代说法；“bodykins”可理解为在“by my body”（凭我的身体）基础上加了带亲昵/缩小意味的后缀 -kins，使语气更轻、更口语化。","常见于莎士比亚及同时代戏剧文本中，如今在现代口语里几乎不用；主要出现在文学作品、历史题材对白或仿古风格中。"]}
{"word":"bodyless","summary":{"en":"Bodyless means having no physical body, or (figuratively) existing without a physical form.","zh":"bodyless 指“无身体的”，也可引申为“非实体的、没有物理形态的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without a physical body; having no body.","zh":"无身体的；没有肉身的。"},"examples":[{"en":"In the story, the witch became bodyless after the spell.","zh":"在故事里，女巫施咒后变成了无身体的存在。"},{"en":"He described the voice as bodyless, floating in the dark room.","zh":"他形容那声音没有“实体”，在黑暗的房间里漂浮着。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Not in a physical form; existing only as a spirit, idea, or digital presence.","zh":"（引申）非实体的；仅以精神、概念或数字形式存在的。"},"examples":[{"en":"Online, you can feel bodyless—present, but not physically there.","zh":"在网上，你可能会觉得自己像是“无实体”的——在场，却不在现实中。"},{"en":"The rumor spread like a bodyless shadow through the town.","zh":"谣言像无实体的影子一样在镇上传开。"}]}],"synonyms":["bodiless","incorporeal","disembodied","immaterial","nonphysical"],"phonetic":"/ˈbɑdiləs/","extraExplanation":["“bodyless”不是日常高频词，更常见的替代说法有“without a body”“bodiless”。在文学、奇幻/恐怖题材里常用来描写幽灵、灵魂或“只有声音/意识”的存在。","拼写上，“bodiless”比“bodyless”更常见；但两者都能表达“无身体”的意思。"]}
{"word":"bodymaker","summary":{"en":"Bodymaker usually means a machine that forms the body of a metal can; less commonly it can mean a maker of vehicle bodies or shells.","zh":"bodymaker 通常指制罐行业的“制罐身机”；较少见时可指制作车身或外壳的制造者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A machine used in manufacturing (especially the canning industry) that forms and reshapes metal into a can body (the main cylinder of a can).","zh":"（制造业用语，尤指制罐行业）“制罐身机”：把金属材料冲压/拉伸并成形为罐身（罐的主体圆筒）的机器。"},"examples":[{"en":"The factory installed a new bodymaker to increase can production.","zh":"工厂安装了一台新的制罐身机，以提高罐的产量。"},{"en":"If the bodymaker is misaligned, the cans may come out with thin spots.","zh":"如果制罐身机校准不当，罐身可能会出现局部过薄的问题。"}]},{"partOfSpeech":"n.","definition":{"en":"Less commonly, a person or company that makes or shapes bodies (usually referring to vehicle bodies or specialized equipment); often written as “body maker.”","zh":"较少见：制造或塑形“外壳/车身”的人或公司（常指汽车车身等）；也常写作 body maker。"},"examples":[{"en":"The custom shop is a well-known body maker for vintage cars.","zh":"这家定制店以为老爷车制作车身而闻名。"},{"en":"She worked for a small body maker that built fiberglass shells.","zh":"她在一家小型外壳制造商工作，生产玻璃纤维外壳。"}]}],"synonyms":["can bodymaker","can-forming machine","body maker","coachbuilder (related)"],"phonetic":"/ˈbɑːdiˌmeɪkɚ/","extraExplanation":["“Bodymaker”在日常英语里不常用，最常见的专业含义来自制罐行业：它是生产两片罐（two-piece can）流程中的关键设备之一，用来把金属杯形件进一步拉伸、壁铁薄化并成形为罐身。","如果你看到在健身、广告或品牌语境中出现的Bodymaker/BodyMakers，往往是商标或口号用法，意思更接近“塑形者/打造身材的人（或项目）”，但这通常不是标准词典义。"]}
{"word":"bodymaking","summary":{"en":"“Bodymaking” is an uncommon noun meaning “making or shaping a body,” used mainly in specific contexts like fitness talk, character design, or (rarely) clothing construction.","zh":"“bodymaking”是一个不常见名词，意为“制造或塑造身体”，多见于健身表达、角色设计或（较少见的）服装上身制作语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of making or shaping a body (used in a few specialized contexts, but uncommon in everyday English)","zh":"塑造身体／制造身体的过程（在少数专业语境中使用，但日常英语里不常见）"},"examples":[{"en":"Strength training and good nutrition are part of bodymaking for many athletes.","zh":"力量训练和良好营养是许多运动员进行“身体塑造”的一部分。"},{"en":"In character design, bodymaking refers to choosing a character’s height, build, and proportions.","zh":"在角色设计中，“bodymaking”指选择角色的身高、体型和比例。"}]},{"partOfSpeech":"n.","definition":{"en":"(fashion or costume, rare) the making of a bodice or the fitted “body” part of a garment","zh":"（服装或戏服制作中，较少见）制作上身／紧身上衣的“身片”部分"},"examples":[{"en":"The tailor focused on bodymaking before adding the sleeves.","zh":"裁缝先做上身部分，再接袖子。"}]}],"synonyms":["bodybuilding","body shaping","body sculpting","physique building","character creation"],"phonetic":"/ˈbɑdiˌmeɪkɪŋ/","extraExplanation":["“bodymaking”不是常见词。多数情况下，人们会说：\n- **bodybuilding**（健美、增肌训练）\n- **body shaping / body sculpting**（塑形）\n- **building muscle / getting in shape**（更口语：增肌／变好身材）\n如果你想表达“健身塑形”，用这些词更自然。"]}
{"word":"bodyplate","summary":{"en":"A protective plate or panel covering part of a body (human/animal/machine).","zh":"覆盖身体部分、起保护作用的板或面板（用于人/动物/机器）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a protective plate or panel that covers part of the body (of a person, animal, or machine), often for armor, shielding, or support","zh":"（人、动物或机器上的）护身板；护板；覆盖身体部分的保护性板材（常用于盔甲、防护或支撑）"},"examples":[{"en":"The rescue vest has a rigid bodyplate to protect the chest.","zh":"这件救援背心有一块坚硬的护身板来保护胸部。"},{"en":"Some turtles have hard bodyplates that help them survive attacks.","zh":"有些乌龟有坚硬的护身板，能帮助它们在遭受攻击时存活。"},{"en":"A metal bodyplate shields the equipment from heat and impact.","zh":"金属护板能保护设备免受高温和撞击。"}]}],"synonyms":["body plate","armor plate","chest plate","protective plate","body panel"],"phonetic":"/ˈbɑdiˌpleɪt/","extraExplanation":["“bodyplate”不是非常常见的标准词，更常见的写法是两词形式“body plate”，具体含义会随领域变化：\n- 装备/防护：指防弹插板、护胸板等（更常见说法：plate, armor plate, chest plate）。\n- 生物/动物：可指外骨骼或甲片（更常见说法：body plate(s), bony plates, scutes）。\n- 工程/机械：可泛指机身护板或外壳板（更常见说法：body panel, cover plate）。"]}
{"word":"bodyshirt","summary":{"en":"Bodyshirt usually means a fitted one-piece top that stays tucked in (similar to a bodysuit).","zh":"Bodyshirt 通常指紧身连体上衣，能保持塞进裤腰不易跑出，类似 bodysuit。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a close-fitting one-piece top (often with snaps at the crotch) worn like a shirt but designed to stay tucked in; similar to a bodysuit.","zh":"一种紧身连体上衣（常在裆部有按扣），外观像衬衫/上衣，但设计目的是不容易跑出裤腰；类似连体衣（bodysuit）。"},"examples":[{"en":"She wore a black bodyshirt under a blazer for a smooth, tucked-in look.","zh":"她在西装外套里面穿了一件黑色 bodyshirt，看起来平整利落、不容易松出来。"},{"en":"This bodyshirt has snap closures, so it’s easy to use the restroom.","zh":"这件 bodyshirt 有按扣，去洗手间会方便一些。"}]}],"synonyms":["bodysuit","body suit","one-piece top","leotard"],"phonetic":"/ˈbɑdiˌʃɝt/","extraExplanation":["“bodyshirt”在英语里不算特别常见，更常见的说法是“bodysuit”或写成两词“body shirt”。在一些欧洲语境里（尤其受德语“Bodyshirt”影响的时尚用语）可能更常见。购买或搜索时用“bodysuit”通常更容易找到对应商品。"]}
{"word":"bodysuit","summary":{"en":"A tight one-piece garment covering the torso (sometimes more), used in fashion, underwear, dance, or sports.","zh":"贴身的一件式连体衣，覆盖躯干（有时更多），常用于日常穿搭、内衣、舞蹈或运动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A one-piece, close-fitting garment that covers the torso and sometimes the arms and legs, usually fastened at the crotch; worn as clothing, underwear, dancewear, or sportswear.","zh":"连体紧身衣：一件式贴身服装，覆盖躯干（有时也覆盖手臂和腿部），通常在裆部有扣合；可作为日常服装、内衣、舞蹈服或运动服穿着。"},"examples":[{"en":"She wore a black bodysuit under a blazer for a clean, tucked-in look.","zh":"她在西装外套里面穿了一件黑色连体紧身衣，看起来利落又不会跑出来。"},{"en":"Dancers often practice in a bodysuit because it allows easy movement.","zh":"舞者经常穿连体紧身衣练习，因为活动更方便。"},{"en":"This bodysuit has snap buttons at the bottom.","zh":"这件连体紧身衣底部有按扣。"}]}],"synonyms":["one-piece","leotard","unitard"],"phonetic":"/ˈbɑdiˌsut/","extraExplanation":["在时尚语境里，bodysuit 常指“上衣连体”的款式（像紧身上衣+裆部扣子），搭配牛仔裤或裙子时不容易起皱或走位。","与 leotard（芭蕾/体操连体服）有重叠但不完全相同：leotard 更偏舞蹈与体操训练；bodysuit 在日常穿搭与内衣领域更常见。"]}
{"word":"bodysuits","summary":{"en":"Bodysuits are one-piece garments that fit closely and cover the torso, worn for fashion, dance/sports, underwear, or shaping.","zh":"Bodysuits 指贴身的一件式连体衣，覆盖躯干，可用于日常穿搭、舞蹈/运动、内衣或塑形。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A one-piece garment that covers the torso (and sometimes the arms and legs), usually fastened at the crotch; worn as underwear, a fashion top, dancewear, sportswear, or shapewear.","zh":"连体衣：一种一件式衣物，覆盖躯干（有时也覆盖手臂和腿部），通常在裆部有扣合；可作为内衣、时尚上衣、舞蹈服、运动服或塑身衣穿着。"},"examples":[{"en":"She wore a black bodysuit under her blazer for a clean, tucked-in look.","zh":"她在西装外套里面穿了一件黑色连体衣，看起来利落又不会跑出来。"},{"en":"Dancers often practice in bodysuits so teachers can see their posture clearly.","zh":"舞者常穿连体衣练习，这样老师能更清楚地看到体态。"},{"en":"This brand sells bodysuits with snap buttons for convenience.","zh":"这个品牌卖带按扣的连体衣，穿脱更方便。"}]}],"synonyms":["one-piece","body suit","leotard (in dance contexts)","unitard (covers legs)"],"phonetic":"/ˈbɑːdiˌsuːts/","extraExplanation":["在美式英语里，bodysuit 常用于“时尚穿搭”的连体上衣或“舞蹈/体操训练”的连体服；在某些语境下也可能指“塑身连体衣（shapewear bodysuit）”。","与 leotard（舞蹈/体操连体服）相比，bodysuit 在日常穿搭中更常见，也更强调“上衣像塞进裤子里一样平整”。词义会因场景（内衣、运动、舞台）而略有不同。"]}
{"word":"bodysurf","summary":{"en":"Bodysurf means to ride waves using only your body (no surfboard), or the activity itself.","zh":"bodysurf 指不使用冲浪板、只靠身体乘浪滑行（趴浪），也可指这项活动本身。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to ride a breaking wave toward the shore using only your body (without a surfboard)","zh":"（不使用冲浪板）只用身体借助海浪向岸边滑行；趴浪/人体冲浪"},"examples":[{"en":"We bodysurfed for an hour and got completely exhausted.","zh":"我们趴浪了一个小时，累坏了。"},{"en":"She learned to bodysurf before she ever tried surfing with a board.","zh":"她在尝试用冲浪板冲浪之前，先学会了趴浪。"}]},{"partOfSpeech":"n.","definition":{"en":"the activity or sport of riding waves using your body instead of a surfboard","zh":"趴浪/人体冲浪（这项活动或运动）"},"examples":[{"en":"Bodysurf is popular on beaches with strong shore breaks.","zh":"在岸边浪很猛的海滩，趴浪很受欢迎。"},{"en":"He prefers bodysurf because it feels more direct and natural.","zh":"他更喜欢趴浪，因为感觉更直接、更自然。"}]}],"synonyms":["body surf","bodysurfing"],"phonetic":"/ˈbɑːdiˌsɝːf/","extraExplanation":["“bodysurf”在口语里常写作一个词（bodysurf），也有人写作两个词（body surf）。名词更常见的形式是“bodysurfing”。","文化语境上，它和“surfing（冲浪）”同属海滩运动，但强调不用板、直接借浪；在一些地方会配合使用“swim fins（脚蹼）”来更容易追上浪、保持速度。","安全提示：趴浪很容易在浅水区被浪推倒或被回卷流影响，英语里常会看到相关提醒如“watch for rip currents（注意离岸流）”。"]}
{"word":"bodysurfed","summary":{"en":"“Bodysurfed” means you rode ocean waves using only your body (no surfboard).","zh":"“bodysurfed”表示不用冲浪板、只用身体乘浪前进（人体冲浪）。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Past tense of bodysurf) to ride an ocean wave using your body (without a surfboard), usually while swimming toward shore.","zh":"（bodysurf 的过去式）不用冲浪板、只用身体乘着海浪前进（通常朝岸边游）。"},"examples":[{"en":"We bodysurfed for an hour before the sun went down.","zh":"太阳下山前，我们趴板（人体冲浪）了一个小时。"},{"en":"She bodysurfed the small waves near the beach.","zh":"她在海滩附近乘着小浪人体冲浪。"},{"en":"I got a little scraped up when I bodysurfed too close to the sand.","zh":"我人体冲浪时离沙滩太近，擦破了一点皮。"}]}],"synonyms":["rode waves","surfaced (in context: rode surf)","swam in the surf"],"phonetic":"ˈbɑdiˌsɝft","extraExplanation":["“bodysurf”在美式英语里很常见，尤其在加州、夏威夷等海岸文化中；它通常比“surf（站板冲浪）”更容易入门，但仍需要注意离岸流、浪区和水深安全。","也常看到“bodyboarding”（用趴板/趴板冲浪板）与“bodysurfing”（完全不用板）对比：前者借助板更稳定，后者更强调身体控浪。"]}
{"word":"bodysurfer","summary":{"en":"A bodysurfer is someone who rides waves using only their body; it can also mean the act of doing this.","zh":"bodysurfer 指徒手乘浪的人；也可作动词表示“徒手乘浪”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who rides a wave using only their body (without a surfboard).","zh":"趴板冲浪者；徒手（不借助冲浪板）乘浪的人。"},"examples":[{"en":"The bodysurfer waited for a bigger set of waves before paddling out.","zh":"这位趴板冲浪者等到更大一组浪来时才划出去。"},{"en":"Many bodysurfers wear swim fins to help them move faster in the water.","zh":"很多徒手乘浪的人会穿脚蹼来帮助在水里更快移动。"}]},{"partOfSpeech":"v.","definition":{"en":"to ride a wave using only your body, without a surfboard.","zh":"徒手乘浪；不借助冲浪板进行冲浪。"},"examples":[{"en":"We bodysurfed for an hour and then took a break on the beach.","zh":"我们徒手乘浪玩了一个小时，然后在沙滩上休息。"},{"en":"She learned to bodysurf before she ever tried surfing with a board.","zh":"她在尝试用冲浪板冲浪之前，就先学会了徒手乘浪。"}]}],"synonyms":["bodysurfing (sport/activity)","wave rider"],"phonetic":"/ˈbɑːdiˌsɝːfɚ/","extraExplanation":["“Bodysurfing”在英语里更常见，表示这项运动；“bodysurfer”通常指“玩这项运动的人”。很多海滩文化中，bodysurfing被认为是最贴近海浪、最“原始”的冲浪方式之一。","安全提示（语境常会提到）：bodysurfing需要注意离岸流（rip current）、浪区（break zone）和水深，初学者常在有救生员的海滩练习。"]}
{"word":"bodysurfing","summary":{"en":"Bodysurfing is riding a wave toward shore using only your body, without a surfboard.","zh":"Bodysurfing 指不使用冲浪板，只用身体随浪向岸边滑行的人体冲浪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the sport of riding a breaking wave toward shore using only your body (no surfboard)","zh":"趴在浪上、只用身体（不借助冲浪板）随浪向岸边滑行的运动；人体冲浪"},"examples":[{"en":"I tried bodysurfing for the first time and swallowed a lot of seawater.","zh":"我第一次尝试人体冲浪，喝了不少海水。"},{"en":"Bodysurfing is easier when the waves are small and gentle.","zh":"浪小而温和时，人体冲浪会更容易。"},{"en":"At that beach, many locals go bodysurfing at sunset.","zh":"在那片海滩，很多当地人会在日落时去人体冲浪。"}]}],"synonyms":["wave riding (body only)","surf swimming (less common)"],"phonetic":"/ˈbɑːdiˌsɝːfɪŋ/","extraExplanation":["“bodysurfing”常见于海滩文化语境，强调不使用冲浪板，仅靠身体姿势与海浪配合。有时会使用“hand plane/handboard（手板）”帮助滑行，但严格来说那介于人体冲浪与器材冲浪之间。","相关词：surfing（板冲浪）、bodyboarding/boogie boarding（趴板冲浪，使用较短软板）、catch a wave（抓到一个浪）、wipe out（摔进水里/被浪掀翻）。"]}
{"word":"bodysurfs","summary":{"en":"“Bodysurfs” means someone rides waves using only their body; it’s also the he/she/it form of the verb “bodysurf.”","zh":"“bodysurfs”表示用身体（不用冲浪板）乘浪前进；也可指动词“bodysurf”的第三人称单数形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to ride a breaking ocean wave using only your body (no surfboard), usually by swimming and letting the wave carry you toward shore","zh":"（不用冲浪板）只用身体乘着海浪前进，通常是游到浪里让浪把你带向岸边"},"examples":[{"en":"He bodysurfs whenever the waves are small but clean.","zh":"只要浪不大、浪形又好，他就会去趴板（人体冲浪）。"},{"en":"Don’t bodysurf too close to the rocks.","zh":"不要在离礁石太近的地方趴板（人体冲浪）。"}]},{"partOfSpeech":"other","definition":{"en":"third-person singular present of “bodysurf” (he/she/it bodysurfs)","zh":"“bodysurf”的第三人称单数现在时（he/she/it bodysurfs）"},"examples":[{"en":"She bodysurfs every weekend in the summer.","zh":"夏天她每个周末都会去趴板（人体冲浪）。"}]}],"synonyms":["ride waves","swim in the surf"],"phonetic":"/ˈbɑdiˌsɝf/","extraExplanation":["“Bodysurf”常见于海滩文化语境，尤以美国加州、夏威夷、澳大利亚等地更常听到。因为不用板，入门门槛低，但也更依赖对浪、离岸流与海底地形的判断。"]}
{"word":"bodywear","summary":{"en":"“Bodywear” is a marketing-style word meaning clothing worn on the body, sometimes especially sports/active clothing.","zh":"“bodywear”多为营销用语，泛指穿在身上的衣物；有时特指运动/健身服装。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Clothing worn on the body; garments (often used in marketing to mean everyday or close-to-the-body clothing).","zh":"穿在身上的衣物；服装（常见于商品/营销用语，指日常或贴身衣物等）。"},"examples":[{"en":"The store sells bodywear like T-shirts, leggings, and hoodies.","zh":"这家店卖各类 bodywear，比如T恤、打底裤和连帽衫。"},{"en":"This bodywear is designed for comfort and movement.","zh":"这款 bodywear 主打舒适、便于活动。"}]},{"partOfSpeech":"n.","definition":{"en":"(Sometimes) clothing for sports or fitness, similar to activewear.","zh":"（有时）运动/健身服装，近似 activewear（运动休闲服）。"},"examples":[{"en":"She bought new bodywear for yoga class.","zh":"她为瑜伽课买了新的运动服。"},{"en":"Breathable bodywear helps you stay cool during training.","zh":"透气的运动服能让你训练时更凉爽。"}]}],"synonyms":["clothing","apparel","garments","activewear","sportswear"],"phonetic":"/ˈbɑdiˌwɛr/","extraExplanation":["“bodywear”不是最常见的日常英语词，更常见的说法包括：clothing（衣服/服装）、apparel（服饰，偏正式或商业）、activewear（运动服）、sportswear（运动装）、underwear（内衣）、shapewear（塑身衣）。具体指什么通常要看品牌或商品分类。"]}
{"word":"bodyweight","summary":{"en":"Bodyweight means your body’s weight, and it also describes exercises that use your own body as resistance.","zh":"Bodyweight 指“体重”，也可指“自重训练的”（用自身体重作为阻力）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The weight of your body (often used when talking about fitness, health, or sports).","zh":"体重（常用于健身、健康或运动语境）。"},"examples":[{"en":"My bodyweight is 70 kilograms.","zh":"我的体重是70公斤。"},{"en":"Bodyweight can change with diet, sleep, and stress.","zh":"体重会随着饮食、睡眠和压力而变化。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used to describe exercises that use your own body as resistance instead of machines or free weights.","zh":"（修饰名词）指“自重训练”的：用自身重量做阻力，而不是用器械或杠铃哑铃。"},"examples":[{"en":"Push-ups and squats are classic bodyweight exercises.","zh":"俯卧撑和深蹲是经典的自重训练动作。"},{"en":"I follow a bodyweight routine when I can’t get to the gym.","zh":"去不了健身房时，我就做自重训练计划。"}]}],"synonyms":["weight","body weight","self-weight (fitness)","calisthenics (related)"],"phonetic":"/ˈbɑdiˌweɪt/","extraExplanation":["在英文里 *body weight* 也常写成两个词（body weight），意思相同；在健身圈里更常见合写 *bodyweight*，尤其出现在复合词里：*bodyweight training / bodyweight workout / bodyweight exercises*。","常见搭配：*bodyweight percentage*（体重百分比，如“举起自身体重的1.5倍”）、*maintain/lose/gain bodyweight*（维持/减轻/增加体重）。"]}
{"word":"bodywise","summary":{"en":"Bodywise means “in terms of the body/physical health.”","zh":"bodywise 表示“就身体/身体健康而言”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(especially in compounds) relating to the body or physical health; in terms of the body.","zh":"（常用于复合词中）与身体或健康有关的；就身体状况而言的。"},"examples":[{"en":"I’m feeling better bodywise, but I’m still stressed mentally.","zh":"就身体而言我好多了，但心理上还是有压力。"},{"en":"The doctor said I’m fine bodywise, so the problem may be anxiety.","zh":"医生说我身体方面没问题，所以问题可能是焦虑。"},{"en":"Try to check in with yourself bodywise—are you tired, hungry, or tense?","zh":"试着从身体层面关注自己——你是累了、饿了，还是紧绷？"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to the body; bodily (used as an adjective, often after a noun).","zh":"与身体有关的；身体的（作形容词用，常放在名词后）。"},"examples":[{"en":"I’m okay bodywise and ready to start training again.","zh":"我身体状态还行，可以开始恢复训练了。"},{"en":"Bodywise changes are common during adolescence.","zh":"青春期出现身体变化很常见。"}]}],"synonyms":["physically","health-wise","bodily"],"phonetic":"/ˈbɑdiˌwaɪz/","extraExplanation":["“bodywise”由“body + -wise”构成。这里的“-wise”表示“在……方面／就……而言”（如：moneywise 就金钱而言，timewise 就时间而言）。它在口语和非正式写作中很常见。","有时你会看到“Bodywise”作为品牌名（如健康、营养相关产品）。作为品牌使用时通常大写，但其词义仍与“身体健康”相关。"]}
{"word":"bodywood","summary":{"en":"“Bodywood” means the wood used for the main body of an instrument (especially a guitar) or other object.","zh":"“Bodywood”指用于制作主体的木材，尤其是吉他等乐器的琴身木材。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"wood used to make the main body of an object, especially the body of a guitar or other string instrument (the part that holds the pickups, bridge, etc.).","zh":"用于制作物体主体的木材；尤指用于制作吉他等弦乐器“琴身”的木材（安装拾音器、琴桥等的主要部分）。"},"examples":[{"en":"This guitar has an alder bodywood, so it sounds bright and balanced.","zh":"这把吉他的琴身木材是赤杨（alder），所以音色明亮且均衡。"},{"en":"Different bodywood choices can change the weight and feel of the instrument.","zh":"不同的琴身木材会影响乐器的重量和手感。"}]}],"synonyms":["body wood","tonewood"],"phonetic":"/ˈbɑːdiˌwʊd/","extraExplanation":["“bodywood”并不是非常标准、常见的词；在乐器论坛、商品描述里更常见写法是“body wood”（分开写）。意思通常等同于“the wood used for the body”。","在电吉他语境中，人们常把木材分为 body wood（琴身木材）与 neck wood（琴颈木材）；常见的 body wood 有 alder（赤杨）、ash（白蜡木）、mahogany（桃花心木）、basswood（椴木）。"]}
{"word":"bodywork","summary":{"en":"Bodywork means either vehicle body repair (very common) or hands-on physical therapy like massage (common in wellness contexts).","zh":"bodywork 既可指（最常见的）车辆车身修理，也可指按摩等手法类身体疗法（多见于健康/身心语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Repairs or work done on the outer body of a vehicle (especially a car), such as fixing dents, replacing panels, and repainting.","zh":"（尤指汽车的）车身修理/钣金喷漆等外观修复工作，如修凹痕、换车身板件、喷漆。"},"examples":[{"en":"The accident wasn’t serious, but the car needs bodywork on the front bumper.","zh":"事故不算严重，但车头保险杠需要做车身修理。"},{"en":"This shop specializes in bodywork and paint.","zh":"这家店专做钣金和喷漆。"},{"en":"The estimate includes parts, labor, and bodywork.","zh":"报价包含配件、人工以及车身修复费用。"}]},{"partOfSpeech":"n.","definition":{"en":"Physical therapy or hands-on treatment focusing on the body, such as massage, stretching, and movement-based techniques to reduce pain or stress.","zh":"（非正式）身体疗法/手法治疗，如按摩、拉伸、以动作训练为主的放松与减痛方式。"},"examples":[{"en":"After long hours at a desk, some gentle bodywork can help with shoulder tension.","zh":"久坐之后，做些温和的身体疗法有助于缓解肩颈紧张。"},{"en":"She’s studying bodywork techniques like massage and myofascial release.","zh":"她在学习按摩、筋膜放松等身体手法。"}]}],"synonyms":["auto body repair","panel beating","body repair","massage therapy","manual therapy"],"phonetic":"ˈbɑdiˌwɝk","extraExplanation":["在汽车语境里，bodywork 通常是不可数名词，常与 paint / repair / shop 搭配（如 bodywork and paint）。在健康与身心领域，它更偏口语/行业用法，常指各种“手法类”的身体放松与治疗。"]}
{"word":"bodyworkers","summary":{"en":"Bodyworkers are people who do hands-on work either on human bodies (massage/bodywork) or on vehicle bodies (auto body repair), depending on context.","zh":"Bodyworkers 指从事手法身体疗法的人（如按摩/身体调理），也可指汽车车身维修人员；具体含义取决于语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who provide hands-on therapeutic work on the body (for example, massage, bodywork, or somatic therapy) to reduce pain, improve movement, or help relaxation.","zh":"从事“身体疗法/身体工作”的人（如按摩、身体调理、身心疗法等），通过手法帮助放松、减轻疼痛或改善活动能力。"},"examples":[{"en":"The clinic has a team of bodyworkers and physical therapists.","zh":"这家诊所有一支由身体疗法师和物理治疗师组成的团队。"},{"en":"Many bodyworkers focus on stress relief and posture improvement.","zh":"许多身体疗法师会专注于缓解压力和改善体态。"}]},{"partOfSpeech":"n.","definition":{"en":"People who repair or shape the outer body of a vehicle, especially after damage (auto body repair).","zh":"从事汽车车身修复/钣金喷漆相关工作的人，尤其负责车辆外壳在损坏后的修复与整形。"},"examples":[{"en":"After the accident, the bodyworkers repaired the dents and repainted the door.","zh":"事故后，车身修理工把凹痕修好并重新喷了车门的漆。"},{"en":"The shop is hiring experienced bodyworkers for collision repair.","zh":"这家修理厂正在招聘有经验的车身维修工做事故车修复。"}]}],"synonyms":["massage therapists","bodywork practitioners","somatic therapists","auto body technicians","panel beaters"],"phonetic":"/ˈbɑdiˌwɝkɚz/","extraExplanation":["“bodyworker(s)”是“bodyworker”的复数。日常语境中更常指按摩/身体疗法相关从业者；在汽车行业语境里则常指“auto body worker（车身维修工）”。如果你在招聘广告、诊所介绍或维修厂场景看到它，可以通过上下文判断是哪一种。"]}
{"word":"bodyworks","summary":{"en":"“bodyworks” can refer to the Bath & Body Works brand, a vehicle’s bodywork, or (less commonly) body-focused exercise activities.","zh":"“bodyworks”可指 Bath & Body Works 品牌、车辆车身（钣金外壳），或（较少见）以身体训练为主的活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often capitalized) A U.S. retail brand that sells soaps, lotions, candles, and other personal-care products.","zh":"（常大写）美国的个人护理用品零售品牌，主要售卖香皂、身体乳、香薰蜡烛等。"},"examples":[{"en":"I bought hand soap at Bath & Body Works.","zh":"我在 Bath & Body Works 买了洗手液。"},{"en":"BodyWorks is having a big sale this weekend.","zh":"BodyWorks 这周末有大促销。"}]},{"partOfSpeech":"n.","definition":{"en":"The bodywork of a vehicle; the exterior panels/structure of a car or similar vehicle.","zh":"（车辆的）车身（外壳、钣金等外部结构）。"},"examples":[{"en":"The accident damaged the car’s bodyworks, so it needs repairs.","zh":"事故把车身外壳撞坏了，所以需要修理。"},{"en":"He works in a shop that specializes in bodyworks and paint.","zh":"他在一家专做钣金和喷漆的店工作。"}]},{"partOfSpeech":"n.","definition":{"en":"Activities or exercises that focus on improving the body, such as fitness training, stretching, or dance practice.","zh":"以强身健体为目的的身体训练活动，如健身训练、拉伸或舞蹈练习。"},"examples":[{"en":"Her daily bodyworks include yoga and light strength training.","zh":"她每天的身体训练包括瑜伽和轻量力量练习。"},{"en":"The class mixes breathing, balance, and other bodyworks.","zh":"这节课把呼吸、平衡等身体训练结合在一起。"}]}],"synonyms":["Bath & Body Works","bodywork","auto body","fitness training","workout"],"phonetic":"/ˈbɑdiˌwɝks/","extraExplanation":["在日常英语里，这个词最常见的用法其实是品牌名 **Bath & Body Works**；只写 **BodyWorks/bodyworks** 时，是否大写往往取决于是不是在指该品牌。","表示“车身”时，更常见的单数形式是 **bodywork**（英式英语也常用）；美式里也会说 **auto body**（汽车钣金/车身部分）。"]}

