{"word":"boe","summary":{"en":"“BOE/boe” is usually an abbreviation meaning either the Bank of England or “barrels of oil equivalent,” depending on context.","zh":"“BOE/boe”通常是缩写，常见含义为“英格兰银行”或“桶油当量”，具体取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(often written “BOE”) the Bank of England, the United Kingdom’s central bank.","zh":"（常写作“BOE”）英格兰银行（英国的中央银行）。"},"examples":[{"en":"The BOE raised interest rates to control inflation.","zh":"英格兰银行（BOE）加息以控制通货膨胀。"},{"en":"Markets reacted quickly to the BOE’s policy announcement.","zh":"市场对英格兰银行（BOE）的政策声明反应迅速。"}]},{"partOfSpeech":"n.","definition":{"en":"(energy/business) “barrel(s) of oil equivalent,” a unit that converts different energy sources into the energy of one barrel of crude oil.","zh":"（能源/商业）“桶油当量（barrel(s) of oil equivalent）”，把不同能源换算成相当于一桶原油的能量单位。"},"examples":[{"en":"The field is estimated to contain 200 million boe.","zh":"该油气田预计含有2亿桶油当量（boe）。"},{"en":"Production increased to 50,000 boe per day.","zh":"产量提升到每天5万桶油当量（boe）。"}]}],"synonyms":["Bank of England (for the central bank meaning)","barrels of oil equivalent (spelled out)"],"phonetic":"/ˌbiː oʊ ˈiː/","extraExplanation":["“boe/BOE”多为缩写，使用时常需要看上下文：在金融新闻里常指 Bank of England；在能源、油气行业报告里常指 barrel(s) of oil equivalent。通常写成大写“BOE”更清楚。"]}
{"word":"Boebera","summary":{"en":"“Boebera” isn’t a recognized standard English word; it’s likely a proper name or a misspelling.","zh":"“Boebera”不是标准英语词汇；更可能是专有名词或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a proper name (a person, place, brand) or a misspelling of another word.","zh":"不是标准英语词汇；更可能是专有名词（人名、地名、品牌名等）或其他单词的拼写错误。"},"examples":[{"en":"I couldn’t find “Boebera” in an English dictionary—could it be a name or a typo?","zh":"我在英语词典里找不到“Boebera”——它会不会是名字或拼写错误？"},{"en":"Please tell me where you saw “Boebera” (a book, a label, a message) so I can identify it.","zh":"请告诉我你在哪里看到“Boebera”（书里、标签上、消息中），这样我才能判断它是什么。"}]}],"phonetic":"/boʊˈbɛrə/","extraExplanation":["“Boebera”在常见英语词典与语料中并不常见，通常不作为英语单词使用。","它可能是拼写接近的词：例如 Boebera ↔︎ “Boer”/“Boers”（布尔人，南非历史相关）、“boar”（野猪，发音不同）、或某些人名/品牌名的变体。","如果你把它出现的完整句子或截图发来，我可以根据上下文判断它到底指什么，并给出准确释义与用法。"]}
{"word":"boebera","summary":{"en":"“boebera” isn’t a standard English word; it’s likely a name, handle, or misspelling.","zh":"“boebera”不是标准英语单词；更可能是名字、网名或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username/brand name, or a proper name from another language.","zh":"不是标准英语单词。可能是拼写错误、用户名/品牌名，或来自其他语言的专有名词。"},"examples":[{"en":"I couldn’t find “boebera” in an English dictionary—could you share the sentence you saw it in?","zh":"我在英语词典里找不到“boebera”——你能把它出现的句子发我看看吗？"},{"en":"“Boebera” might be a personal name or an online handle rather than a vocabulary word.","zh":"“Boebera”可能是人名或网名，而不是常见词汇。"}]}],"phonetic":"/boʊˈbɛrə/","extraExplanation":["从拼写看，它读起来可能像 /boʊˈbɛrə/（按英语拼读的近似读法），但如果它其实来自其他语言或是人名/品牌名，真实读音与含义可能完全不同。","你可以告诉我：1）它出现的上下文句子；2）你想查的是英文含义还是人名/地名；3）是否可能想输入的是别的词（例如 barbera / barber / Boebert 等）。我就能更准确地帮你确认。"]}
{"word":"Boece","summary":{"en":"*Boece* is a medieval spelling of “Boethius,” often referring to Boethius himself or to *The Consolation of Philosophy* (especially Chaucer’s translation).","zh":"*Boece* 是“Boethius（波爱修斯）”的中世纪拼写，常指波爱修斯本人或《哲学的慰藉》（尤其指乔叟的译本）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical/literary) A Middle English form of the name “Boethius,” often used to refer to the Roman philosopher Anicius Manlius Severinus Boethius (c. 480–524) or to his famous book *The Consolation of Philosophy*.","zh":"（历史/文学）“Boethius（波爱修斯）”的中古英语写法，常用来指这位罗马哲学家（约480–524），或指他的名著《哲学的慰藉》。"},"examples":[{"en":"In Chaucer studies, *Boece* usually means Chaucer’s translation of Boethius’s *Consolation of Philosophy*.","zh":"在乔叟研究中，*Boece* 通常指乔叟对波爱修斯《哲学的慰藉》的翻译。"},{"en":"The ideas in *Boece*—fortune, suffering, and wisdom—shaped much later medieval writing.","zh":"*Boece* 中关于命运、苦难与智慧的思想影响了后来的许多中世纪作品。"}]}],"synonyms":["Boethius","The Consolation of Philosophy","Chaucer’s Boece"],"phonetic":"/ˈboʊəs/","extraExplanation":["*Boece* 最常见于中世纪与中古英语语境，尤其和杰弗里·乔叟（Geoffrey Chaucer）有关：他写过一部英文译作，常被称为 *Chaucer’s Boece*。","波爱修斯的《哲学的慰藉》写于他被囚禁时期，内容以“对话体”讨论命运之轮（Fortune’s wheel）、真正的幸福与理性安慰，因此在欧洲文学与思想史上很重要。","如果你是在手稿、古英语/中古英语课程或乔叟文本里看到 *Boece*，它通常不是现代英语常用词，而是专名/书名的历史拼写。"]}
{"word":"Boedromion","summary":{"en":"Boedromion is an ancient Athenian month, roughly late September to late October.","zh":"Boedromion（博厄德罗米翁月）是古雅典历中的一个月份，大致相当于公历9月下旬到10月下旬。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in the ancient Attic/Athenian calendar) the month roughly corresponding to late September to late October, when several important festivals were held.","zh":"（古雅典/阿提卡历）约相当于公历9月下旬至10月下旬的月份，此时会举行多种重要节庆。"},"examples":[{"en":"The Eleusinian Mysteries were celebrated in Boedromion.","zh":"厄琉西斯秘仪在博厄德罗米翁月期间举行。"},{"en":"The decree is dated to Boedromion, so it likely falls in early autumn.","zh":"该法令注明日期为博厄德罗米翁月，因此很可能属于初秋时节。"}]}],"synonyms":["(Attic month name; no close modern synonym)"],"phonetic":"/boʊˈdroʊmiən/","extraExplanation":["“Boedromion”是一个学术写作里常见的专名，多用于讨论古雅典的历法、铭文纪年与宗教节日。由于阿提卡历是阴阳合历（按月相定月，并通过闰月校正季节），它与现代公历月份并非每年一一对应，只能说“大致相当于”9月下旬到10月下旬。","这一月常与大型宗教活动联系在一起，例如厄琉西斯秘仪（Eleusinian Mysteries）；名称也与古希腊对阿波罗的称呼“Boedromios”（意为“援助于战斗/救援者”）有关。"]}
{"word":"boedromion","summary":{"en":"Boedromion is the third month in the ancient Athenian calendar, roughly corresponding to September–October.","zh":"Boedromion 指古雅典历法的第三个月，约相当于公历9—10月。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In the ancient Athenian (Attic) calendar, the third month of the year (roughly September–October), associated with major religious festivals.","zh":"古雅典（阿提卡）历法中的第三个月（大致相当于公历9—10月），与重要宗教节庆相关。"},"examples":[{"en":"The Eleusinian Mysteries were celebrated during Boedromion in ancient Athens.","zh":"在古雅典，厄琉息斯秘仪通常在博埃德罗米翁月（Boedromion）期间举行。"},{"en":"The inscription dates the event to the month of Boedromion.","zh":"铭文把这件事的日期标注为博埃德罗米翁月。"}]}],"synonyms":["Attic month name","Ancient Greek calendar month"],"phonetic":"/boʊˌɛdˈroʊmiən/","extraExplanation":["Boedromion（也常拼作 Boedromion/Boedromion）是阿提卡阴阳合历中的月份名；不同城邦、不同年代的“月份”并不严格对应固定的公历日期，所以常用“约等于9—10月”来说明。","该月名称常与雅典的重要节庆一起出现，例如厄琉息斯秘仪（Eleusinian Mysteries）与波塞德翁节/波埃德罗米亚（Boedromia，常被认为与阿波罗“救援/出征”之意相关），因此在古典学、铭文学与历史写作中较常见。"]}
{"word":"Boedromius","summary":{"en":"Boedromius is an Ancient Greek (Athenian/Attic) calendar month name, roughly September–October, and can also mean “of that month.”","zh":"Boedromius 是古希腊（雅典/阿提卡）历的月份名，约相当于公历九月至十月，也可指“属于该月的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Greek calendar) The sixth month of the Attic (Athenian) calendar, roughly corresponding to September–October; also used as an adjective meaning “of that month.”","zh":"（古希腊历法）阿提卡（雅典）历的第六个月，大致相当于公历九月至十月；也可作形容词，意为“属于该月的”。"},"examples":[{"en":"The Mysteries at Eleusis were traditionally celebrated in Boedromius.","zh":"厄琉西斯秘仪传统上在博厄德罗米乌斯月举行。"},{"en":"Some inscriptions date the decree to the middle of Boedromius.","zh":"一些铭文把该法令的日期记为博厄德罗米乌斯月的中旬。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to Boedromius (Boedromion), especially to events, festivals, or dates occurring in that month.","zh":"博厄德罗米乌斯月（博厄德罗米昂月）的；尤指该月发生的事件、节庆或日期。"},"examples":[{"en":"The procession followed a Boedromian schedule, beginning after the new moon.","zh":"这场游行遵循博厄德罗米乌斯月的日程，从新月之后开始。"}]}],"synonyms":["Boedromion","Attic month of Boedromion"],"phonetic":"/ˌbiːəˈdroʊmiəs/","extraExplanation":["“Boedromius”对应更常见的写法“Boedromion”（博厄德罗米昂），是雅典城邦使用的阿提卡历月份名。英语学术写作里多见于古典学、铭文学、希腊宗教节日研究等语境。","该月常与雅典的重要宗教活动相关（如厄琉西斯秘仪在此月举行），因此在历史书或论文里常用来标注节庆与史事的时间。"]}
{"word":"boef","summary":{"en":"Boef means “thief/crook,” mainly used in Dutch contexts rather than everyday English.","zh":"Boef意为“小偷/坏蛋/罪犯”，主要用于荷兰语语境，英语日常中不常用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a thief or criminal (from Dutch; sometimes used in English writing about Dutch/Belgian contexts)","zh":"小偷；罪犯（源自荷兰语；英语中多见于涉及荷兰/比利时语境的写作）"},"examples":[{"en":"In the novel, the police chase a boef through the canals of Amsterdam.","zh":"在小说里，警察在阿姆斯特丹的运河间追捕一个罪犯。"},{"en":"He called the pickpocket a boef and demanded his wallet back.","zh":"他骂那个扒手是个小偷，并要求把钱包还回来。"}]}],"synonyms":["crook","thief","criminal","robber"],"phonetic":"/buf/","extraExplanation":["“boef”是荷兰语常用词，意思接近英语的“crook / thief”。在英语里它不算常见词，通常出现在翻译作品、新闻引用、或描写荷兰语环境的文本中。","在荷兰语里它带有口语、带点贬义的语气；正式场合更常用法律/新闻用词来指“嫌犯、罪犯”。"]}
{"word":"Boehike","summary":{"en":"Boehike (bohike) is a historical Caribbean term for a Taíno priest/shaman or spiritual healer.","zh":"Boehike（bohike）是一个历史性的加勒比词，指泰诺人的祭司/萨满或灵性治疗者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Caribbean, historical) A Taíno priest or shaman; a spiritual healer who led rituals and used sacred knowledge and medicine.","zh":"（加勒比地区，历史用语）泰诺人（Taíno）的祭司或萨满；负责主持仪式、进行治病与占卜等的灵性治疗者。"},"examples":[{"en":"In some early Spanish accounts, the bohike was described as a healer and religious leader in Taíno society.","zh":"在一些早期西班牙人的记载中，bohike 被描述为泰诺社会中的治疗者与宗教领袖。"},{"en":"The novel mentions a bohike performing a ceremony to protect the village.","zh":"小说中提到一位 bohike 举行仪式来守护村庄。"}]},{"partOfSpeech":"n.","definition":{"en":"A less common spelling variant of bohíque/bohique (same meaning).","zh":"bohíque/bohique 的一种较少见的拼写变体（含义相同）。"},"examples":[{"en":"You may also see it spelled bohique or bohíque in historical texts.","zh":"在历史文献中，你也可能看到它写作 bohique 或 bohíque。"}]}],"synonyms":["shaman","priest","healer","medicine man"],"phonetic":"/boʊˈhiːk/","extraExplanation":["“Boehike/bohike”不是现代日常英语词汇，更多出现在关于加勒比原住民泰诺文化的历史、人类学与文学作品中。","这个词常与殖民时期的西班牙语记载有关；不同作者会用不同拼写（如 bohique/bohíque/bohike），读到时可以根据上下文理解为“祭司/萨满/巫医”一类角色。"]}
{"word":"Boehme","summary":{"en":"Boehme is a German surname, commonly referring to the mystic writer Jakob (Jacob) Böhme.","zh":"Boehme 是一个德国姓氏，常用来指神秘主义作家雅各布·伯墨。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a German surname; often used in English to refer specifically to Jakob (Jacob) Böhme (1575–1624), a German Christian mystic and philosophical writer.","zh":"德国姓氏；在英语语境中常特指德国基督教神秘主义者与哲学思想作家雅各布·伯墨（Jakob/Jacob Böhme，1575–1624）。"},"examples":[{"en":"In our seminar, we read selections from Boehme’s spiritual writings.","zh":"在我们的研讨课上，我们阅读了伯墨灵性著作的选段。"},{"en":"The author compares Boehme’s ideas with later German philosophy.","zh":"作者把伯墨的思想与后来的德国哲学作比较。"}]}],"synonyms":["Böhme","Jakob Boehme","Jacob Boehme"],"phonetic":"/ˈbeɪmə/","extraExplanation":["“Boehme”是德语姓氏“Böhme”的常见英语拼写（用oe代替ö）。在学术写作中，提到“Boehme”往往指雅各布·伯墨，他的著作对欧洲神秘主义传统以及后来的德国思想（如浪漫主义与部分哲学讨论）有影响。"]}
{"word":"Boehmenism","summary":{"en":"Bohemianism is an unconventional, arts-centered lifestyle or spirit that values freedom and creativity over social norms.","zh":"Bohemianism 指一种以艺术与自由为核心、较反传统和不拘常规的“波希米亚式”生活方式或气质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lifestyle or attitude linked to artists and intellectuals that values creativity and freedom, often rejecting conventional social rules (for example, stable jobs, formal manners, or mainstream tastes)","zh":"（与艺术家、知识分子相关的）波希米亚式生活方式/态度；重视创意与自由，常常反传统、反主流（如不按常规工作、穿着随性等）"},"examples":[{"en":"In college, she was drawn to bohemianism and spent her weekends at small art shows.","zh":"大学时，她很向往波希米亚式生活，周末常去小型艺术展。"},{"en":"The film celebrates bohemianism—late-night conversations, cheap apartments, and big dreams.","zh":"这部电影赞美波希米亚气质：深夜长谈、廉价公寓和宏大梦想。"},{"en":"His bohemianism shows in his clothes and his refusal to follow office culture.","zh":"他的波希米亚风格体现在穿着上，也体现在他拒绝迎合办公室文化。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) the ideas, habits, or artistic style associated with bohemian communities","zh":"（较少用）波希米亚群体的观念、习惯或艺术风格；波希米亚风尚"},"examples":[{"en":"Writers of the period mixed realism with a touch of bohemianism.","zh":"那个时期的作家把现实主义与一点波希米亚风尚融合在一起。"},{"en":"The café became a symbol of local bohemianism.","zh":"那家咖啡馆成了当地波希米亚文化的象征。"}]}],"synonyms":["artistic nonconformity","free-spiritedness","counterculture","avant-gardism"],"phonetic":"/boʊˈhiːmiəˌnɪzəm/","extraExplanation":["“Bohemianism”在英语里更常见；你写的“Boehmenism”可能受德语“Böhmen”（波希米亚地区，即今天捷克的一部分）拼写影响，属于少见变体或拼写错误。","历史上，“bohemian”一词在法国和英国曾被用来指“像吉普赛人一样漂泊的人”，后来在19世纪的巴黎逐渐转为指不拘一格、经济拮据但追求艺术与自由的文艺圈生活方式，因此带有文化与阶层想象。","文学与流行文化中常见主题：如普契尼歌剧《La Bohème》（《波希米亚人》）以及音乐剧/电影《Rent》，都描绘了城市里年轻艺术家清贫却追梦的生活。"]}
{"word":"boehmenism","summary":{"en":"Boehmenism is the set of mystical religious ideas linked to Jakob Böhme and his followers.","zh":"Boehmenism 指与雅各布·伯默及其追随者相关的神秘宗教思想体系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The religious–philosophical ideas and mystical theology associated with the German Christian mystic Jakob Böhme (1575–1624) and his followers.","zh":"指与德国基督教神秘主义者雅各布·伯默（Jakob Böhme，1575–1624）及其追随者相关的一套宗教—哲学思想与神秘神学体系。"},"examples":[{"en":"The professor briefly introduced Boehmenism when discussing early modern Christian mysticism.","zh":"教授在讲早期近代基督教神秘主义时，简要介绍了伯默主义（Boehmenism）。"},{"en":"Some writers were influenced by Boehmenism’s symbolic language about light, darkness, and inner transformation.","zh":"一些作家受到伯默主义中关于光明、黑暗与内在转化的象征性语言影响。"}]}],"synonyms":["Behmenism","Böhme’s mysticism","Böhmean theology"],"phonetic":"/ˈbɝːmənɪzəm/","extraExplanation":["“Boehmenism”来自姓氏“Böhme”（英文旧拼常写作 Boehme/Behmen）+ “-ism”（表示“主义/学说”）。","伯默的著作常被归入“神秘主义/灵修神学”传统，强调人内在的属灵经验、象征与对善恶、光暗等主题的形上解释；在英语学术语境里多见于神学史、思想史或文学研究。"]}
{"word":"Boehmenist","summary":{"en":"A Boehmenist is someone connected with or influenced by the mystical teachings of Jakob Böhme.","zh":"Boehmenist 指与雅各布·波墨的基督教神秘主义思想有关的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A follower or admirer of Jakob Böhme (1575–1624), whose mystical Christian philosophy influenced later religious and philosophical thought.","zh":"波墨（雅各布·波墨，Jakob Böhme）思想的追随者或拥护者；指受其基督教神秘主义哲学影响的人。"},"examples":[{"en":"Some seventeenth-century writers were described as Boehmenists because they drew heavily on Böhme’s mystical ideas.","zh":"一些17世纪的作家被称为“波墨主义者”，因为他们大量借鉴了波墨的神秘主义思想。"},{"en":"The scholar traced Boehmenist themes in later Protestant spirituality.","zh":"这位学者追溯了后世新教灵修传统中的波墨主义主题。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to Jakob Böhme or his teachings; Boehmian.","zh":"与波墨或其教义有关的；波墨式的（同 Boehmian）。"},"examples":[{"en":"The poem uses a Boehmenist vision of light and darkness to describe the human soul.","zh":"这首诗用波墨式的“光与暗”的观念来描写人的灵魂。"}]}],"synonyms":["Boehmian","follower of Jakob Böhme"],"phonetic":"/ˈbøɪməˌnɪst/","extraExplanation":["“Boehmenist”较少见，多用于宗教史、思想史或文学研究语境。它来源于德国神秘主义者 Jakob Böhme（英语常写作 Boehme）。","波墨的思想常讨论“对立统一”（如光/暗、善/恶）与神性如何在世界中显现，因此在神秘主义写作与部分新教灵修传统研究中会看到相关术语。","相关词：Boehmian（更常见的形容词/名词形式）；theosophy（神智学/神秘神学，注意不同于近代的 Theosophical Society 运动）。"]}
{"word":"boehmenist","summary":{"en":"A Boehmenist is a follower of the mystic Jakob Böhme or someone influenced by his spiritual ideas.","zh":"Boehmenist 指伯默（Jakob Böhme）的追随者，或受其神秘主义思想影响的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a follower of Jakob Böhme (1575–1624), a German Christian mystic and writer; someone whose beliefs are influenced by Böhme’s mystical ideas","zh":"雅各布·伯默（Jakob Böhme，1575–1624）的追随者；受伯默神秘主义思想影响的人"},"examples":[{"en":"In the 17th century, some Boehmenists read Böhme’s writings as a guide to spiritual renewal.","zh":"在17世纪，一些伯默派把伯默的著作当作灵性复兴的指引来阅读。"},{"en":"The historian described him as a Boehmenist because he often quoted Böhme when discussing the nature of God.","zh":"这位历史学家称他为伯默派，因为他在讨论上帝的本质时经常引用伯默。"}]}],"synonyms":["Böhme follower","Boehmist","Boehmean (adj.)"],"phonetic":"/ˈbɜːmənɪst/","extraExplanation":["“Boehmenist”来自德语姓氏 Böhme（英语常写作 Boehme 或 Boehmen）。中文里常译作“伯默派/伯默主义者”。","伯默（Jakob Böhme）是早期近代欧洲的重要神秘主义思想家之一，作品常谈到“光与暗”“内在灵性”“上帝与自然的关系”等主题；因此“Boehmenist”多出现在宗教史、思想史或文学研究的语境中。","拼写上也可能见到 Boehmist（较少见）或 Boehmean（作形容词更常用，如 Boehmean mysticism “伯默式神秘主义”）。"]}
{"word":"Boehmenite","summary":{"en":"Boehmite is a mineral (AlO(OH)) found in bauxite and important in aluminum and materials production.","zh":"勃姆石是一种氧氢化铝矿物（AlO(OH)），常见于铝土矿，对铝工业与材料制备很重要。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mineral form of aluminum oxyhydroxide (AlO(OH)), commonly found in bauxite and used as a source material in producing aluminum and certain ceramics","zh":"一种矿物形态的氧氢化铝（AlO(OH)），常见于铝土矿中，可作为生产铝及某些陶瓷材料的原料"},"examples":[{"en":"Boehmite is often present in bauxite, the main ore used to produce aluminum.","zh":"勃姆石常见于铝土矿中，而铝土矿是生产铝的主要矿石。"},{"en":"The sample contained boehmite along with other aluminum-bearing minerals.","zh":"该样品含有勃姆石以及其他含铝矿物。"}]}],"synonyms":["boehmite","γ-AlOOH"],"phonetic":"/ˈbɝː.maɪt/","extraExplanation":["你输入的“Boehmenite”在英语里更常见的标准拼写是“boehmite”（也可见到“böhmite”这种带变音符号的写法）。它的名字来自德国矿物学家 Johann Böhm（约翰·伯姆）。","“boehmite”主要用于地质、矿物学、材料科学语境；日常英语中很少用到。阅读学术文章时，你也可能看到它被写作“γ-AlOOH”（表示一种晶型/结构）。"]}
{"word":"boehmenite","summary":{"en":"Boehmenite is a mineral (AlO(OH)) found in bauxite; it’s a common aluminum-bearing ore, also called boehmite.","zh":"Boehmenite（勃姆石）是一种铝氧氢化物矿物（AlO(OH)），常见于铝土矿中，是重要的含铝矿物；也称 boehmite。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mineral form of aluminum oxyhydroxide (AlO(OH)), commonly found in bauxite ore and used as a source of aluminum in industry; also spelled “boehmite.”","zh":"一种矿物：一水铝氧化物（AlO(OH)），常见于铝土矿中，是工业上提取铝的重要矿物来源；也常拼作“boehmite”。"},"examples":[{"en":"Bauxite often contains boehmenite along with other aluminum minerals.","zh":"铝土矿中常含有勃姆石（boehmenite），并与其他含铝矿物共存。"},{"en":"In refining, boehmenite can require higher temperatures to process than some other ores.","zh":"在精炼过程中，与某些其他矿石相比，勃姆石可能需要更高温度才能处理。"}]}],"synonyms":["boehmite","aluminum oxyhydroxide","AlO(OH)"],"phonetic":"/ˈbɝːmaɪˌnaɪt/","extraExplanation":["“boehmenite / boehmite（勃姆石）”这一名称来自奥地利矿物学家 Johann Böhm 的姓氏（常见音译为“伯姆/勃姆”）。在材料与冶金语境里，你更常看到拼写为 boehmite。","在地质与工业材料中，它常与 gibbsite（吉布斯石）和 diaspore（硬水铝石）一起被讨论，都是铝土矿里重要的含铝矿物。"]}
{"word":"Boehmer","summary":{"en":"Boehmer is a German-origin surname used as a family name in English.","zh":"Boehmer 是一个源自德语的姓氏，在英语中用作人名的姓。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a German-origin family name (surname) used in English; it refers to a person or family with that last name.","zh":"（源自德语的）姓氏“Boehmer/博默”，在英语中用作人名的姓。"},"examples":[{"en":"Dr. Boehmer will present her research tomorrow.","zh":"博默博士明天将展示她的研究。"},{"en":"I emailed Professor Boehmer about the assignment.","zh":"我给博默教授发邮件询问作业。"},{"en":"Boehmer is the author’s last name on the book cover.","zh":"书封面上作者的姓是Boehmer（博默）。"}]}],"phonetic":"/ˈbɝmɚ/","extraExplanation":["“Boehmer”常见于德语背景的姓氏；其中“oe”常被用来替代德语变音符号“ö”（例如可对应写作“Böhmer”）。在英语环境里读法会因家庭或地区而异，因此如果是在称呼具体的人，最稳妥的是询问对方偏好的发音。"]}
{"word":"Boehmeria","summary":{"en":"Boehmeria is a scientific genus name for certain nettle-family plants, including ramie.","zh":"Boehmeria 指荨麻科植物的一个学名属（苎麻属），包括可产纤维的苎麻等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants in the nettle family (Urticaceae), including species such as ramie that are used for fiber or found as wild plants.","zh":"荨麻科（Urticaceae）的一属开花植物（苎麻属）；其中一些种类（如苎麻）可用于纤维生产，也有不少为野生植物。"},"examples":[{"en":"Ramie, a strong natural fiber, comes from a species in the genus Boehmeria.","zh":"苎麻这种强韧的天然纤维来自苎麻属（Boehmeria）的一种植物。"},{"en":"The field guide lists Boehmeria as part of the nettle family.","zh":"这本野外指南把苎麻属（Boehmeria）列为荨麻科植物。"}]}],"synonyms":["ramie (for the best-known species)","nettle family genus (general description)"],"phonetic":"/boʊˈmɪəriə/","extraExplanation":["“Boehmeria”是拉丁化的学名（属名），常用于植物学与生态学写作中；日常英语里更常见的是具体物种名（如 *Boehmeria nivea*，即“ramie/苎麻”）。","属名通常首字母大写并用斜体书写（*Boehmeria*），而具体物种名由“属名 + 种加词”构成（如 *Boehmeria nivea*）。"]}
{"word":"boehmeria","summary":{"en":"Boehmeria is a plant genus in the nettle family that includes ramie (used for fiber).","zh":"Boehmeria 指荨麻科的苎麻属植物，包括可用于纤维的苎麻。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of plants in the nettle family (Urticaceae), including ramie and related species, some of which are used for fiber or traditional medicine","zh":"荨麻科的一个植物属（苎麻属），包括苎麻等近缘植物，其中一些可用于纤维生产或传统药用"},"examples":[{"en":"Ramie is produced from Boehmeria nivea, a plant in the genus Boehmeria.","zh":"苎麻纤维来自苎麻（Boehmeria nivea），它属于苎麻属（Boehmeria）。"},{"en":"The researcher identified the specimen as a Boehmeria species based on its leaves and stems.","zh":"研究人员根据叶片和茎的特征，将该标本鉴定为苎麻属（Boehmeria）的一种。"}]}],"synonyms":["ramie (for Boehmeria nivea)","nettle family plant (general)"],"phonetic":"/boʊˈmɪriə/","extraExplanation":["“Boehmeria”是拉丁化的学名，多用于植物学、农业与纤维材料相关的语境。日常英语里更常见的是具体物种名（如“ramie / 苎麻”）而不是属名。","该属名源自18世纪德国植物学家 Georg Rudolf Boehmer（乔治·鲁道夫·伯默）的姓氏，用来纪念他在植物学方面的贡献。"]}
{"word":"Boehmian","summary":{"en":"Boehmian means connected with Theobald Boehm or the Boehm-system keywork used on modern flutes.","zh":"Boehmian 指与伯姆本人或伯姆键制有关，常用于描述现代长笛等木管乐器的按键系统。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Theobald Boehm (a German flute maker) or to the Boehm system of keys used on flutes (and later adapted for other woodwind instruments).","zh":"与特奥巴尔德·伯姆（德国制笛师）有关，或指“伯姆键制”（用于长笛、并影响其他木管乐器的按键系统）。"},"examples":[{"en":"Most modern concert flutes are Boehmian instruments.","zh":"大多数现代音乐会长笛都采用伯姆式系统。"},{"en":"She switched from an older flute to a Boehmian model for easier fingering.","zh":"她从较旧的长笛换成伯姆式型号，因为指法更方便。"}]}],"synonyms":["Boehm-system","Boehm"],"phonetic":"/ˈbøːmiən/","extraExplanation":["“Boehmian”源自Theobald Boehm（1794–1881）。他改良了长笛的音孔位置与按键机构，使音准更稳定、音色更均匀，并让复杂指法更容易。如今英语里更常见的说法是“the Boehm system（伯姆键制）”，而“Boehmian”多出现在较专业的乐器/音乐语境中。"]}
{"word":"Boehmist","summary":{"en":"Boehmist means a follower of Jakob Böhme or something connected to his mystical religious ideas.","zh":"Boehmist 指伯默（Jakob Böhme）的追随者，或与其神秘主义宗教思想相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a follower of Jakob Böhme (1575–1624), a German Christian mystic and writer; someone influenced by his mystical theology","zh":"雅各布·伯默（Jakob Böhme，1575–1624）的追随者；受其神秘主义神学影响的人"},"examples":[{"en":"The book traces how several Boehmists shaped early modern religious thought.","zh":"这本书追溯了几位伯默主义者如何影响近代早期的宗教思想。"},{"en":"He was called a Boehmist because he often quoted Jakob Böhme in his sermons.","zh":"他常在布道中引用雅各布·伯默，因此被称为伯默主义者。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the ideas or writings of Jakob Böhme","zh":"与雅各布·伯默的思想或著作有关的；伯默主义的"},"examples":[{"en":"The essay discusses Boehmist imagery of light and darkness.","zh":"这篇文章讨论了伯默主义关于光与暗的意象。"},{"en":"Her interpretation is strongly Boehmist in tone.","zh":"她的解读在风格上带有很强的伯默主义色彩。"}]}],"synonyms":["follower of Jakob Böhme","Böhme devotee","mystic","theosophist (related, not exact)"],"phonetic":"/ˈboʊmɪst/","extraExplanation":["“Boehmist”来自 Jakob Böhme（德语姓常写作 Böhme），他是近代早期的重要基督教神秘主义思想家。伯默的作品常谈到“神的自我显现”、光与暗、善与恶等主题，对后来的神智学（theosophy）、浪漫主义思想以及部分新教神秘传统都有影响。","在学术语境中，“Boehmist”通常用于宗教史、哲学史或文学研究，表示某位思想家/作品明显受到伯默影响；日常英语里非常少见。"]}
{"word":"Boehmite","summary":{"en":"Boehmite is an aluminum oxyhydroxide mineral found in bauxite and important in alumina production.","zh":"Boehmite（勃姆石）是一种常见于铝土矿中的铝氧氢化物矿物，在生产氧化铝等工业过程中很重要。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mineral form of aluminum oxyhydroxide (AlO(OH)), commonly found in bauxite and used as a raw material for making alumina and other industrial products","zh":"一种铝氧氢化物矿物（AlO(OH)），常见于铝土矿中，可作为生产氧化铝等工业产品的原料"},"examples":[{"en":"Bauxite often contains boehmite along with gibbsite and diaspore.","zh":"铝土矿常常含有勃姆石（boehmite），以及三水铝石（gibbsite）和硬水铝石（diaspore）。"},{"en":"Refineries adjust processing conditions depending on whether the ore is rich in boehmite.","zh":"炼厂会根据矿石是否富含勃姆石来调整处理条件。"}]}],"synonyms":["aluminum oxyhydroxide","γ-AlO(OH)"],"phonetic":"/ˈbɝː.maɪt/","extraExplanation":["“Boehmite”得名于德国矿物学家J. Böhm。该词多用于地质、矿物学与材料科学语境。","在工业上，勃姆石常与铝土矿及拜耳法（Bayer process）相关；不同铝矿物组成会影响溶出温度与工艺条件。"]}
{"word":"boehmite","summary":{"en":"Boehmite is a mineral (AlO(OH)) found in bauxite and used in material science.","zh":"Boehmite（勃姆石）是一种铝氧羟化物矿物（AlO(OH)），常见于铝土矿并用于材料领域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mineral form of aluminum oxyhydroxide (AlO(OH)), commonly found in bauxite and used in materials and ceramics.","zh":"一种含铝的氧羟化物矿物（AlO(OH)），常见于铝土矿中，也用于材料与陶瓷等领域。"},"examples":[{"en":"Bauxite can contain boehmite, which affects how the ore is processed to extract aluminum.","zh":"铝土矿可能含有勃姆石（boehmite），这会影响提取铝时的加工方式。"},{"en":"Researchers used boehmite nanoparticles to improve the heat resistance of a coating.","zh":"研究人员使用勃姆石纳米颗粒来提高涂层的耐热性。"}]}],"synonyms":["aluminum oxyhydroxide","γ-AlO(OH)"],"phonetic":"ˈbɝːmaɪt","extraExplanation":["“Boehmite”来自德语矿物学家 Johannes Böhm（约翰内斯·伯姆/勃姆）的姓氏，是以人名命名的矿物名。","在工业语境中，你可能会看到它与 gibbsite（三水铝石）和 diaspore（硬水铝石）一起出现，它们都是铝土矿中的主要含铝矿物，会影响冶炼/提取工艺与所需温度。"]}
{"word":"boehmites","summary":{"en":"Boehmites are minerals (plural of boehmite) made of aluminum oxyhydroxide, commonly found in bauxite and used in alumina production.","zh":"Boehmites 是 boehmite 的复数，指由铝氧氢化物组成的矿物，常见于铝土矿中，并用于生产氧化铝等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mineral form of aluminum oxyhydroxide (AlO(OH)), often found in bauxite and used in making alumina and other industrial materials","zh":"一种铝氧氢化物矿物（AlO(OH)），常见于铝土矿中，常用于制取氧化铝等工业材料"},"examples":[{"en":"Boehmite is one of the minerals commonly found in bauxite.","zh":"勃姆石（boehmite）是铝土矿中常见的矿物之一。"},{"en":"Some refineries heat boehmite to help produce alumina.","zh":"一些炼厂会加热勃姆石以帮助生产氧化铝。"},{"en":"The report identified boehmites in the sediment sample.","zh":"报告在沉积物样品中鉴定出了勃姆石（复数：boehmites）。"}]}],"synonyms":["aluminum oxyhydroxide","γ-AlO(OH)"],"phonetic":"/ˈbɝːmaɪt/","extraExplanation":["“boehmite”以德国语言学家/矿物学家 Johann Böhm 的姓氏命名，因此拼写里有 “oe”。在科研和工业语境中也常写作 γ-AlO(OH)（伽马相铝氧氢化物）。"]}
{"word":"Boeing","summary":{"en":"Boeing: a famous U.S. aerospace company; also used to refer to its aircraft models.","zh":"Boeing（波音）：著名的美国航空航天公司；也可指其生产的飞机机型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A major American aerospace and defense company that designs and manufactures airplanes, spacecraft, and related systems (The Boeing Company).","zh":"波音公司：美国大型航空航天与国防企业，设计并制造飞机、航天器及相关系统。"},"examples":[{"en":"Boeing is one of the world’s best-known aircraft manufacturers.","zh":"波音是世界上最知名的飞机制造商之一。"},{"en":"My flight was operated with a Boeing 737.","zh":"我乘坐的航班使用的是波音737机型。"}]},{"partOfSpeech":"n.","definition":{"en":"An airplane model made by Boeing (often used before a model number, e.g., Boeing 747).","zh":"波音（飞机）：指由波音制造的某一款飞机机型（常用于型号前，如Boeing 747）。"},"examples":[{"en":"The Boeing 787 is designed for long-distance flights.","zh":"波音787是为长途飞行而设计的。"},{"en":"They replaced the older plane with a newer Boeing.","zh":"他们用一架更新的波音飞机替换了旧飞机。"}]}],"synonyms":["The Boeing Company","Boeing aircraft"],"phonetic":"/ˈboʊɪŋ/","extraExplanation":["“Boeing”来自创始人威廉·E·波音（William E. Boeing）的姓氏。日常英语中常直接说“a Boeing 737/747/787”，也会用“Boeing”泛指波音品牌的飞机。发音上注意首音节重读：BOH-ing。"]}
{"word":"Boeke","summary":{"en":"“Boeke” most commonly means “books” in Afrikaans, and it can also be a surname.","zh":"“Boeke”最常见是南非语里的“书（books）”，也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Afrikaans; plural of “boek”) books; written works you read.","zh":"（南非语；“boek”的复数）书；读物。"},"examples":[{"en":"Ek het baie boeke by die huis.","zh":"我家里有很多书。"},{"en":"Sy lees graag boeke oor geskiedenis.","zh":"她喜欢读历史方面的书。"}]},{"partOfSpeech":"other","definition":{"en":"A family name (surname), e.g., in Dutch- or Afrikaans-speaking contexts.","zh":"姓氏（常见于荷兰语或南非语语境）。"},"examples":[{"en":"Ms. Boeke will join the meeting at 3 p.m.","zh":"Boeke 女士将在下午三点参加会议。"}]}],"synonyms":["books"],"phonetic":"/ˈbuːkə/","extraExplanation":["“Boeke”最常见是南非语（Afrikaans）里“书（boek）”的复数形式，意思相当于英语的“books”。在荷兰语中也有类似拼写与用法。","如果你本来想查的是英语“book / books”，告诉我你的句子语境，我可以给你更贴近英语学习的讲解（如 book 作名词、动词：订票/预订）。"]}
{"word":"boel","summary":{"en":"“boel” is a rare noun meaning “a large amount; a bunch/heap.”","zh":"“boel”是一个罕见名词，意思是“很多；一大堆”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, dialect) A large amount; a bunch or heap of things.","zh":"（罕见；方言）大量；一堆东西。"},"examples":[{"en":"There was a whole boel of books piled on the table.","zh":"桌上堆了一大堆书。"},{"en":"I’ve got a boel of errands to do today.","zh":"我今天有一大堆事情要跑。"}]}],"synonyms":["a lot","a bunch","a heap","a pile","plenty"],"phonetic":"/boʊl/","extraExplanation":["“boel”在现代标准英语里非常少见，更常见于方言/历史用法；有时也会出现在受荷兰语影响的语境中（荷兰语“boel”可表示“一堆/许多/一群”）。","如果你是在拼写检查或人名/地名中看到“Boel”，它也可能是姓氏或专有名词；那种情况下通常不按普通词汇来解释。"]}
{"word":"Boelter","summary":{"en":"Boelter is mainly used as a surname and as a proper name for places or institutions named after someone called Boelter.","zh":"Boelter 主要用作姓氏，也可作专有名词出现在以 Boelter 命名的地点或机构名称中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname): Boelter","zh":"姓氏：Boelter（博尔特/博尔特尔等译法）"},"examples":[{"en":"Dr. Boelter will speak at the conference tomorrow.","zh":"Boelter 博士明天将在会议上发言。"},{"en":"I met someone with the last name Boelter in Chicago.","zh":"我在芝加哥遇到过一位姓 Boelter 的人。"}]},{"partOfSpeech":"other","definition":{"en":"a name used for places, buildings, or organizations that are named after a person or family called Boelter (a proper name)","zh":"用于地名、建筑或机构名称（通常源自姓 Boelter 的人/家族），属于专有名词用法"},"examples":[{"en":"She studied engineering in Boelter Hall.","zh":"她在 Boelter Hall 学习工程学。"},{"en":"The event is hosted by the Boelter Foundation.","zh":"该活动由 Boelter 基金会主办。"}]}],"phonetic":"/ˈboʊltər/","extraExplanation":["“Boelter”常见于英语国家的人名/地名。它多被认为源自德语姓氏：在德语拼写里“oe”常用来替代变音符号“ö”（如 Bö-）。因此不同家族或地区可能会有不同的英语读音。遇到真人名时，最可靠的是询问对方的发音。"]}
{"word":"Boelus","summary":{"en":"“Boelus” is not a common dictionary word; it’s likely a proper noun or a misspelling of a similar term (e.g., boletus/bolus).","zh":"“Boelus”不是常见词典词汇；更可能是专名或近似词的误拼（如boletus/bolus）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is most likely a proper name (a surname or place name) or a misspelling of a similar-looking word.","zh":"不是常见英语词典中的标准词；更可能是专有名词（姓氏/地名等），或是与某个近似拼写的词混写/拼错。"},"examples":[{"en":"I couldn’t find a dictionary definition for “Boelus”; could you share the sentence where you saw it?","zh":"我查不到“Boelus”的词典释义；你能把它出现的句子发我吗？"},{"en":"“Boelus” might be a person’s last name in this article.","zh":"在这篇文章里，“Boelus”可能是一个人的姓。"}]}],"synonyms":["(none—likely a proper noun or misspelling)"],"phonetic":"/ˈboʊləs/","extraExplanation":["“Boelus”这个拼写在英语里非常少见。我更常见到的相近词有：\n1) **Boletus**（牛肝菌属，真菌/蘑菇类名词）；\n2) **bolus**（医学/饮食：一口吞下的食团，或一次给药的剂量）；\n3) 也可能是某个品牌名、游戏/小说角色名、或人名的特殊拼写。\n如果你告诉我来源（书名、网页、截图或上下文句子），我可以更准确判断它到底指什么。"]}
{"word":"boeotarch","summary":{"en":"A boeotarch was an ancient Boeotian (especially Theban) official who led the Boeotian League in politics and war.","zh":"boeotarch 指古希腊波奥提亚（尤以底比斯为中心）同盟的执政官，兼具政治与军事领导职责。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a magistrate (one of several) who served as a military and political leader in the ancient Greek region of Boeotia, especially in the Theban-led Boeotian League","zh":"波奥提亚（古希腊地区，尤指底比斯主导的波奥提亚同盟）中的执政官之一，兼具军事与政治领导职能"},"examples":[{"en":"Epaminondas was elected boeotarch during Thebes’ rise to power.","zh":"伊巴密浓达在底比斯崛起时期被选为波奥提亚执政官（boeotarch）。"},{"en":"The historian describes the boeotarchs as both generals and top officials of the league.","zh":"历史学家把这些波奥提亚执政官描述为同盟的将军兼最高官员。"}]}],"synonyms":["Boeotian magistrate","Theban official","league general"],"phonetic":"/biˈoʊtɑrk/","extraExplanation":["“Boeotarch”是高度历史化的称谓，常见于古希腊史、军事史与政治制度研究中；在现代英语里几乎不会用来指当代官职。","词源上来自“Boeotia（波奥提亚）+ -arch（统治者/领袖）”，与“monarch（君主）”“archbishop（大主教）”中的 -arch 同源。"]}
{"word":"Boeotia","summary":{"en":"Boeotia is a region in central Greece, best known from ancient Greek history (especially Thebes).","zh":"Boeotia（波奥提亚）是希腊中部的一个地区，以古希腊历史闻名，尤其与底比斯相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a region of central Greece, famous in ancient history; its chief city in antiquity was Thebes.","zh":"希腊中部的一个地区（波奥提亚）；在古代历史中很有名，古时的主要城市是底比斯（Thebes）。"},"examples":[{"en":"In Greek mythology, Thebes in Boeotia is linked to the stories of Oedipus and Antigone.","zh":"在希腊神话中，波奥提亚的底比斯与俄狄浦斯和安提戈涅的故事有关。"},{"en":"The battle was fought near Boeotia, not far from Athens.","zh":"这场战役发生在波奥提亚附近，离雅典不远。"}]},{"partOfSpeech":"n.","definition":{"en":"the modern administrative area (regional unit) in Greece corresponding roughly to the ancient region of Boeotia.","zh":"希腊的现代行政区（地区单位），大致对应古代的波奥提亚地区。"},"examples":[{"en":"She traveled through Boeotia on her way to Delphi.","zh":"她在去德尔斐的路上穿过了波奥提亚。"}]}],"synonyms":["Boiotia"],"phonetic":"/biˈoʊʃə/","extraExplanation":["“Boeotia”也常拼作“Boiotia”。对应的形容词是“Boeotian / Boiotian（波奥提亚的）”。","在一些古典文献与后世英语中，“Boeotian”曾被用来带有偏见地形容人“迟钝、不开化”，源自古雅典人对邻近波奥提亚人的刻板印象；现代写作中使用时要注意语境与文化敏感性。"]}
{"word":"boeotia","summary":{"en":"Boeotia is a region in central Greece, historically associated with the city of Thebes.","zh":"Boeotia 指希腊中部的玻俄提亚地区，历史上与底比斯等城邦相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a region in central Greece, north of Athens; in ancient times it included important cities such as Thebes.","zh":"（希腊）玻俄提亚：位于希腊中部、雅典以北的地区；古代包含底比斯等重要城邦。"},"examples":[{"en":"In ancient history, Thebes was a major city of Boeotia.","zh":"在古代历史中，底比斯是玻俄提亚的重要城市。"},{"en":"The story is set in Boeotia, not in Athens.","zh":"故事发生在玻俄提亚，而不是雅典。"}]}],"synonyms":["Boeotian region (contextual)"],"phonetic":"/biˈoʊʃə/","extraExplanation":["在英语文学与文化里，Boeotia 有时会带出一种“被雅典人嘲讽为粗鄙、缺乏机智”的传统刻板印象（常见于古典作品或学术写作中提到“Boeotian”）。现代使用时更常是中性地指地名，写作中若用其引申义要注意语境与礼貌。"]}
{"word":"Boeotian","summary":{"en":"Boeotian means “from Boeotia” or “a person from Boeotia,” and it can also mean “dull or uncreative” (often as a negative stereotype).","zh":"Boeotian 指“波奥提亚的/波奥提亚人”，也可引申为“迟钝、缺乏想象力”（常带贬义刻板印象）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Boeotia (an ancient region of central Greece), or relating to Boeotia","zh":"波奥提亚人（古希腊中部波奥提亚地区的人）；或与波奥提亚有关的"},"examples":[{"en":"In the play, the Boeotian farmer speaks in a simple, rural style.","zh":"在这部戏里，那位波奥提亚农夫用朴素的乡村口吻说话。"},{"en":"The city of Thebes was a major Boeotian power in ancient Greece.","zh":"底比斯在古希腊是波奥提亚地区的重要强国。"}]},{"partOfSpeech":"adj.","definition":{"en":"(often negative) dull or lacking imagination; not interested in art or culture","zh":"（常带贬义）迟钝的、缺乏想象力的；对艺术或文化不感兴趣的"},"examples":[{"en":"Some writers unfairly described their critics as Boeotian and uncreative.","zh":"有些作家不太公正地把批评者说成波奥提亚式的——迟钝又缺乏创造力。"},{"en":"He worried his taste in music was too Boeotian for the group.","zh":"他担心自己对音乐的品味对那群人来说太“波奥提亚”了。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Boeotia; from that region","zh":"波奥提亚的；来自波奥提亚地区的"},"examples":[{"en":"They studied Boeotian pottery in the museum collection.","zh":"他们研究了博物馆藏品中的波奥提亚陶器。"}]}],"synonyms":["Boeotian (literal: from Boeotia)","dull","unimaginative","uncultured"],"phonetic":"/biːˈoʊʃən/","extraExplanation":["“Boeotian”在英语里除了字面“波奥提亚的/波奥提亚人”之外，还可能带有古典文学中的刻板印象：一些雅典作家把波奥提亚人描写得更“乡土、迟钝”。因此在现代使用时，若用作“迟钝、缺乏文化修养”的意思，语气往往偏贬义，需注意场合与礼貌。","词源来自希腊语对“Boeotia（Βοιωτία）”的称呼。该地区因底比斯（Thebes）等城邦而著名，在古希腊历史与文学中经常出现。"]}
{"word":"boeotian","summary":{"en":"Boeotian means dull, uncultured, or uninterested in art and ideas; it can also mean such a person (derogatory).","zh":"boeotian 指“迟钝、缺乏文化或对艺术思想不感兴趣”（多为贬义），也可指这类人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Showing a lack of culture, imagination, or intellectual interest; dull and unrefined (often used as an insult).","zh":"缺乏文化修养或想象力、对思想不感兴趣；迟钝粗俗（常作贬义/侮辱用语）。"},"examples":[{"en":"He dismissed the movie as entertainment for a boeotian audience.","zh":"他把那部电影贬为只适合迟钝粗俗观众的娱乐。"},{"en":"Her review avoids the boeotian tone that sometimes appears in online comments.","zh":"她的评论避免了网络留言里有时会出现的那种粗鄙迟钝的口吻。"}]},{"partOfSpeech":"n.","definition":{"en":"A person thought to be dull or insensitive to art and ideas (derogatory).","zh":"被认为迟钝、对艺术与思想不敏感的人（贬义）。"},"examples":[{"en":"In the essay, the author contrasts the poet with the boeotian who mocks poetry.","zh":"在那篇文章里，作者把诗人与嘲笑诗歌的“粗鄙之人”作对比。"}]}],"synonyms":["philistine","uncultured","unrefined","unimaginative","dull"],"phonetic":"/biˈoʊʃən/","extraExplanation":["词源来自古希腊的波奥提亚（Boeotia）地区。古典时期雅典作家常把该地区的人刻板地描写成“不开化、缺乏艺术感”，所以 boeotian 在英语里发展成贬义形容词/名词。","在现代英语中，这个词带明显的精英色彩与地域刻板印象；写作时要谨慎使用，很多情况下用 “uncultured / unimaginative / philistine” 更中性。"]}
{"word":"Boeotic","summary":{"en":"Boeotic means “from Boeotia (ancient Greece)” and, in older literary use, “dull or unsophisticated.”","zh":"Boeotic 指“与古希腊波奥提亚有关的”，在较老的文学用法中也可引申为“迟钝或不够文雅的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Boeotia (a region in ancient Greece) or its people/dialect.","zh":"（形容词）与波奥提亚（古希腊地区）或其居民/方言有关的。"},"examples":[{"en":"The play includes a few Boeotic expressions that modern readers may not recognize.","zh":"这部戏里有一些波奥提亚方言表达，现代读者可能不认识。"},{"en":"Scholars compare Attic Greek with Boeotic to trace how dialects changed over time.","zh":"学者把阿提卡希腊语与波奥提亚方言作比较，以追踪方言随时间的变化。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Literary, often humorous or critical) Dull, unrefined, or lacking sophistication.","zh":"（文学用法，常带调侃或贬义）迟钝的、粗俗的、不够文雅的。"},"examples":[{"en":"He dismissed the joke as a bit Boeotic, but others found it charming.","zh":"他认为这个笑话有点“粗鄙迟钝”，但别人觉得很有趣。"},{"en":"In older writing, “Boeotic” can be used as a stereotype for someone who seems slow or unsophisticated.","zh":"在较老的文章里，“Boeotic”有时会作为刻板印象，用来指看起来迟钝或不够精致的人。"}]}],"synonyms":["Boeotian","Boeotian dialect","dull","unsophisticated","unrefined"],"phonetic":"/biˈoʊtɪk/","extraExplanation":["“Boeotic”来自“Boeotia（波奥提亚）”。在古典希腊文学里，波奥提亚人有时被雅典等地的人刻画为不够机敏或缺乏风雅，因此这个词后来引申出“迟钝、粗俗”的比喻义。需要注意这属于历史语境中的刻板印象；在现代写作中若用第二义，常带讽刺色彩，使用时要考虑语气与场合。"]}
{"word":"boeotic","summary":{"en":"Boeotic means “from Boeotia (Greece),” and by extension (literary) “dull or unrefined.”","zh":"Boeotic 指“波奥提亚（希腊）地区的”，并可引申为（文学用法）“迟钝的、不够文雅的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Boeotia, a region in ancient (and modern) Greece.","zh":"（与）波奥提亚（古希腊及今希腊的一个地区）有关的；波奥提亚的。"},"examples":[{"en":"Boeotic pottery styles can be compared with Athenian designs from the same period.","zh":"波奥提亚的陶器风格可以与同一时期的雅典设计作比较。"},{"en":"The museum has a small collection of Boeotic inscriptions.","zh":"这家博物馆收藏了一小批波奥提亚的铭文。"}]},{"partOfSpeech":"adj.","definition":{"en":"(literary, often critical) dull, unrefined, or lacking in imagination; unpoetic.","zh":"（文学用语，常带贬义）迟钝的、粗俗的、缺乏想象力的；不够文雅/不够有诗意的。"},"examples":[{"en":"He dismissed the speech as Boeotic and uninspired.","zh":"他把那次演讲斥为迟钝乏味、毫无新意。"},{"en":"The novel contrasts the city’s bright wit with the Boeotic attitudes of the countryside.","zh":"这部小说把城市的机智灵动与乡村的迟钝保守形成对照。"}]}],"synonyms":["Boeotian","dull","unimaginative","philistine"],"phonetic":"/biˈoʊtɪk/","extraExplanation":["在古希腊人的刻板印象里，波奥提亚人（尤其是底比斯一带）常被描写成“反应慢、不够风雅”。因此 Boeotic 除了“地理上的”含义外，也发展出“迟钝、缺乏才气”的引申义。这个用法多见于较旧或文学性的语境，现代日常英语中不常用。"]}
{"word":"Boeotus","summary":{"en":"Boeotus usually means a person from Boeotia in ancient Greece, and it can also refer to a mythic ancestor figure named Boeotus.","zh":"Boeotus 通常指古希腊玻奥提亚地区的人；也可指名为 Boeotus 的神话人物（玻奥提亚人的传说祖先/同名始祖）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Greece) A person from Boeotia (a region north of Athens).","zh":"（古希腊）玻奥提亚（Boeotia，雅典以北地区）的人；玻奥提亚人。"},"examples":[{"en":"In some ancient texts, a Boeotus is simply someone from Boeotia.","zh":"在一些古代文献中，Boeotus 只是指“来自玻奥提亚的人”。"},{"en":"The traveler met a Boeotus who spoke proudly of Thebes, Boeotia’s best-known city.","zh":"那位旅行者遇到一位玻奥提亚人，对玻奥提亚最著名的城市底比斯感到自豪。"}]},{"partOfSpeech":"n.","definition":{"en":"(Mythology) A legendary figure (Boeotus) said to be an ancestor or eponym of the Boeotians.","zh":"（神话）传说人物 Boeotus，被说成是玻奥提亚人的祖先或“同名始祖”（以其名命名族群的人）。"},"examples":[{"en":"Some genealogies mention Boeotus as the name behind the Boeotians.","zh":"一些族谱传说中提到 Boeotus，认为玻奥提亚人之名源于他。"}]}],"synonyms":["Boeotian"],"phonetic":"/biˈoʊətəs/","extraExplanation":["这个词在英语里很少单独使用；更常见的是 **Boeotian**（玻奥提亚的／玻奥提亚人）。在古典传统中，**Boeotian** 有时带贬义，表示“迟钝的、缺乏文雅的”，类似把某地人刻板化的说法；现代写作中使用时要注意语境与文化敏感性。"]}
{"word":"Boer","summary":{"en":"Boer means a Dutch-speaking South African farmer or, more broadly, a member of the historically Dutch-descended farming communities of South Africa.","zh":"Boer 指（南非）布尔人：南非讲荷兰语/南非语的传统农牧民群体；也可泛指南非农场主（多见于历史语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Dutch-speaking farming population of South Africa (historically, Dutch settlers and their descendants; often associated with the old Boer republics).","zh":"（南非）布尔人：南非讲荷兰语/南非语（Afrikaans）的传统农牧民群体，历史上多指荷兰殖民者及其后裔，常与旧时布尔共和国相关。"},"examples":[{"en":"The museum has exhibits about Boer life in the 1800s.","zh":"这家博物馆有关于19世纪布尔人生活的展品。"},{"en":"The novel describes the tensions between British forces and Boer communities.","zh":"这部小说描写了英军与布尔人社区之间的紧张关系。"}]},{"partOfSpeech":"n.","definition":{"en":"a South African farmer (especially in older or historical usage).","zh":"（较旧或历史语境）南非的农民、农场主（尤指布尔人农场主）。"},"examples":[{"en":"A Boer sold wool and cattle at the local market.","zh":"一位布尔农场主在当地市场出售羊毛和牛。"},{"en":"They traveled across the veld to visit a Boer family’s farm.","zh":"他们穿过草原去拜访一户布尔人家的农场。"}]}],"synonyms":["Afrikaner","South African farmer"],"phonetic":"/bʊr/","extraExplanation":["“Boer”在荷兰语中本义是“农民”。在英文里通常大写（Boer），多用于特定民族/历史群体；小写（boer）则更像普通名词“农民”，但这种用法较少见且偏历史语境。","常见相关历史词汇：the Boer Wars（布尔战争，尤指1899–1902年的第二次布尔战争）、the Boer republics（布尔共和国，如德兰士瓦和奥兰治自由邦）。","现代语境中，“Afrikaner（阿非利卡人/南非荷兰裔白人）”更常用、更中性；“Boer”有时带历史或政治色彩，使用时注意语境与对象感受。"]}
{"word":"boer","summary":{"en":"“Boer” means a Dutch-speaking South African (often an Afrikaner farmer). It can be neutral in history, but may be offensive in some contexts today.","zh":"“Boer”指南非的荷兰语系族群（常指阿非利堪斯农民）。历史上可中性使用，但在当代某些语境中可能带冒犯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Dutch-speaking South African (especially an Afrikaner farmer); sometimes used historically in a neutral way, but it can also be offensive depending on context and tone","zh":"布尔人；指南非讲荷兰语（或南非荷兰语/阿非利堪斯语）的人，尤指阿非利堪斯农民；历史上可中性使用，但在某些语境与语气下也可能带侮辱性"},"examples":[{"en":"Many Boers moved inland during the Great Trek in the 1800s.","zh":"19世纪时，许多布尔人在“大迁徙”期间向内陆迁移。"},{"en":"The museum has an exhibit about Boer communities and early farming life.","zh":"博物馆有一个关于布尔人社群与早期农耕生活的展览。"}]}],"synonyms":["Afrikaner (often preferred in modern contexts)","Dutch South African (more descriptive)"],"phonetic":"/bʊr/","extraExplanation":["“Boer”源自荷兰语，原意是“农民”。在历史语境中常指南非的荷兰裔定居者及其后代（与“Afrikaner”相关）。在当代英语里，这个词有时会被当作贬称使用，尤其在政治或种族冲突语境中；写作或交流时更安全的选择通常是用“Afrikaner”或更具体的群体名称。","常见搭配：Boer War / the Boer Wars（布尔战争，主要指1899–1902年的第二次布尔战争）；Boer republics（布尔人共和国，如德兰士瓦与奥兰治自由邦）。"]}
{"word":"Boerdom","summary":{"en":"Boredom means the feeling of being uninterested or tired because something is not engaging.","zh":"Boredom 指因事情不够有趣或缺乏变化而产生的“无聊、厌倦”的感觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The feeling of being tired and uninterested because nothing is happening or something is not interesting.","zh":"无聊；厌倦（因为没事发生或事情不有趣而感到疲惫、提不起兴趣的感觉）。"},"examples":[{"en":"I felt bored during the long meeting, and then boredom turned into frustration.","zh":"我在冗长的会议中感到无聊，后来无聊变成了挫败感。"},{"en":"Many people scroll on their phones to avoid boredom on the bus.","zh":"很多人坐公交时刷手机来避免无聊。"}]}],"synonyms":["tedium","ennui","monotony","restlessness"],"phonetic":"/ˈbɔrdəm/","extraExplanation":["你输入的 “Boerdom” 常见是拼写错误，正确拼法是 “boredom”。它来自形容词 “bored（感到无聊的）”，名词形式表示“无聊这种状态/感觉”。","常见搭配：feel boredom（感到无聊），a sense of boredom（无聊感），boredom with + 名词（对……感到厌倦），boredom sets in（无聊开始出现）。"]}
{"word":"boerdom","summary":{"en":"Boredom is the feeling of being uninterested because nothing seems engaging.","zh":"Boredom 指因缺乏吸引力或意义而产生的“无聊、厌倦”的感觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the feeling of being tired and uninterested because nothing is exciting or meaningful","zh":"无聊；厌倦（因缺乏兴趣或刺激而感到疲倦、提不起劲）"},"examples":[{"en":"I felt bored with the lecture, and boredom made it hard to focus.","zh":"我对这堂讲座感到厌倦，无聊让我很难专心。"},{"en":"During the long flight, she read a book to fight boredom.","zh":"在漫长的航班上，她读书来对抗无聊。"},{"en":"Boredom can sometimes push people to try something new.","zh":"无聊有时会促使人们尝试新事物。"}]}],"synonyms":["tedium","monotony","dullness"],"phonetic":"/ˈbɔr.dəm/","extraExplanation":["你输入的“boerdom”常见是拼写错误；正确拼写是“boredom”。","“boredom”来自形容词“bored”（感到无聊的）+ 名词后缀“-dom”（表示一种状态/情况）。常见搭配：feel boredom（感到无聊）、a sense of boredom（无聊感）、fight/relieve boredom（对抗/缓解无聊）。"]}
{"word":"Boerhavia","summary":{"en":"Boerhavia is a plant genus name (often spelled Boerhaavia), referring to certain flowering plants, some of which are used in traditional medicine.","zh":"Boerhavia（常见拼法 Boerhaavia）是一个植物属名，指一类开花植物，其中一些在传统草药中会被使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants in the four o’clock family (Nyctaginaceae), including species such as Bo(er)haavia diffusa, often used in traditional medicine in some regions.","zh":"紫茉莉科（四点花科）的一属开花植物（Boerhavia／常见拼法为 Boerhaavia），包括如 Boerhaavia diffusa 等物种；在一些地区也用于传统草药。"},"examples":[{"en":"Boerhavia diffusa is studied for its potential medicinal properties.","zh":"人们研究 Boerhavia diffusa 可能具有的药用特性。"},{"en":"The report lists Boerhavia among weeds found in dry, disturbed soils.","zh":"报告将 Boerhavia 列为常见于干燥、受扰动土壤中的杂草之一。"}]}],"synonyms":["Boerhaavia","punarnava (esp. Boerhaavia diffusa, regional/common name)"],"phonetic":"/ˌbɔrˈhɑːviə/","extraExplanation":["常见拼写是 **Boerhaavia**（多了一个 a），不少资料里 **Boerhavia** 也会出现，通常指同一类植物属名。","属名来源于荷兰著名植物学家/医学家 **Hermann Boerhaave**（赫尔曼·博尔哈夫）的姓氏，是一种以人物命名的拉丁学名（常见于植物分类）。","在不同地区，Boerhaavia diffusa 可能有俗名或药用名（如印度传统医学中常见的称呼），但在英文正式写作里更推荐使用拉丁学名以避免混淆。"]}
{"word":"boerhavia","summary":{"en":"Boerhavia is a botanical genus name (a group of related plants), sometimes mentioned in herbal-medicine contexts.","zh":"Boerhavia 是一个植物学属名（相关植物的一类），也会在药用植物/草药语境中出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants in the four o’clock family (Nyctaginaceae), including species such as Boerhavia diffusa, sometimes used in traditional herbal medicine.","zh":"一种开花植物属，属于紫茉莉科（Nyctaginaceae，俗称“四点花科/紫茉莉科”），包括如扩散黄细心（Boerhavia diffusa）等物种；其中有些物种在传统草药中有应用。"},"examples":[{"en":"Boerhavia is studied in botany classes as a plant genus found in warm regions.","zh":"在植物学课程中，Boerhavia 常作为分布于温暖地区的植物属来学习。"},{"en":"Some research papers discuss Boerhavia diffusa in relation to traditional medicine.","zh":"一些研究论文会讨论 Boerhavia diffusa（扩散黄细心）与传统医药的关联。"}]}],"synonyms":["plant genus","Nyctaginaceae genus"],"phonetic":"/bɔrˈheɪviə/","extraExplanation":["Boerhavia 是拉丁化的属名，来自荷兰植物学家/医学家 Herman Boerhaave（博尔哈夫）的姓氏，用来纪念他；因此读音常按“Boerhaave”这一来源来类推。","在英文语境中它多出现在学术或科普文本（植物学、药用植物研究）里，一般不会用于日常口语。","有时你会看到近似拼写（如 Boerhaavia）；具体用哪一种取决于植物分类学的规范与文献传统。"]}
{"word":"Boerne","summary":{"en":"Boerne is a city in Texas (near San Antonio).","zh":"Boerne 是德克萨斯州（靠近圣安东尼奥）的一座城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in Kendall County, Texas, United States, located northwest of San Antonio.","zh":"美国德克萨斯州肯德尔县的一座城市，位于圣安东尼奥西北方向。"},"examples":[{"en":"We drove from San Antonio to Boerne for a day trip.","zh":"我们从圣安东尼奥开车去博尔尼（Boerne）一日游。"},{"en":"Boerne is known for its small-town feel and nearby hill-country scenery.","zh":"博尔尼以小镇氛围和附近的丘陵乡村景色而闻名。"}]}],"phonetic":"/ˈbɝni/","extraExplanation":["“Boerne”是专有名词，常用于地名。英语里专有名词通常首字母大写。","当地常见读音接近“BUR-nee”。这个名字与德国作家/政治人物 Ludwig Börne 有关（历史上以他命名的说法较常见），因此拼写中有德语来源的痕迹，但在英语中已使用英语化读法。"]}
{"word":"boers","summary":{"en":"Boers: Dutch-speaking settlers/farmers in South African history; often discussed in connection with the Boer Wars.","zh":"Boers：南非历史上讲荷兰语（后为南非荷兰语）的移民与农民群体；常与布尔战争等历史话题相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Dutch-speaking settlers and farmers in South Africa (especially in history), later largely associated with the Afrikaner population.","zh":"（尤指历史上的）南非讲荷兰语（后发展为南非荷兰语）的移民与农民群体，后来多与“阿非利卡人/南非白人中的一支”相关。"},"examples":[{"en":"The Boers moved inland during the Great Trek in the 1830s.","zh":"19世纪30年代，“大迁徙”期间，布尔人向南非内陆迁移。"},{"en":"The Boer Wars were fought between the British Empire and Boer republics.","zh":"布尔战争是在大英帝国与布尔人共和国之间爆发的。"}]}],"synonyms":["Afrikaners (related, not always identical)","Boer people"],"phonetic":"/bʊrz/","extraExplanation":["“Boer”源自荷兰语 boer，意为“农夫”。英语里常大写（Boer/Boers）指特定历史人群；小写 boer 在现代英语中较少用，且在某些语境可能带有评价色彩，使用时要注意语境与尊重。","当代语境中，人们更常用 “Afrikaner(s)” 指讲南非荷兰语的白人族群；“Boers”更偏历史或强调早期拓荒农民身份。"]}
{"word":"Boesch","summary":{"en":"Boesch is mainly used as a surname, and it can also refer to a Swiss luxury motorboat brand.","zh":"Boesch 主要用作姓氏，也可指瑞士的高端机动艇品牌。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname), originally from German-speaking areas","zh":"姓氏（家族姓），多见于德语地区背景的人名"},"examples":[{"en":"Ms. Boesch will lead the new research team.","zh":"Boesch 女士将带领新的研究团队。"},{"en":"I met a professor named Boesch at the conference.","zh":"我在会议上遇到一位姓 Boesch 的教授。"}]},{"partOfSpeech":"other","definition":{"en":"a brand name, especially referring to Boesch, a Swiss maker of high-end motorboats","zh":"品牌名；常指 Boesch（博施），瑞士的高端机动艇制造商"},"examples":[{"en":"They arrived at the lake in a Boesch motorboat.","zh":"他们乘坐一艘 Boesch 机动艇来到湖边。"},{"en":"Boesch boats are known for classic design and craftsmanship.","zh":"Boesch 游艇以经典设计和精湛工艺闻名。"}]}],"phonetic":"/bɛʃ/","extraExplanation":["“Boesch”常见于德语系姓名；在德语里拼写“oe”有时用来代替变音符号“ö”（例如 Bösch 的替代写法），所以不同家庭或地区的读音可能不完全一致。英语语境中多会采用英文化读法。"]}
{"word":"Boeschen","summary":{"en":"“Boeschen” is most likely a German-origin surname rather than an English word.","zh":"“Boeschen”更可能是一个德语来源的姓氏，而不是英语单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname), likely of German origin; not a common English vocabulary word.","zh":"一个姓氏（家族姓），多见于德语背景；不是常见的英语词汇。"},"examples":[{"en":"Dr. Boeschen will present the research results today.","zh":"Boeschen 博士今天将展示研究结果。"},{"en":"I found an article written by someone named Boeschen.","zh":"我找到了一篇由一位名叫 Boeschen 的人写的文章。"}]}],"phonetic":"/ˈboʊʃən/","extraExplanation":["“Boeschen”很可能来自德语拼写习惯：在德语里常用“oe”来代替带变音符号的“ö”。因此它在不同国家/家庭中可能有不同读法。英语语境里常按字母读成接近“boh-shen/boh-shuhn”的音。","如果你是在某个特定文本、地名、人名或品牌里看到它，可以告诉我上下文（句子/领域/国家），我可以更准确地解释其含义与读音。"]}
{"word":"Boethian","summary":{"en":"Boethian means “related to Boethius or his philosophy,” often referring to calm reflection on fate, suffering, and inner wisdom.","zh":"Boethian 指“与波爱修及其哲学相关”，常引申为面对命运与苦难时的冷静哲思与内在智慧。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Roman philosopher Boethius (c. 480–524) or to his writings, especially *The Consolation of Philosophy*.","zh":"与罗马哲学家波爱修（Boethius，约公元480–524年）或其著作有关的，尤指《哲学的慰藉》。"},"examples":[{"en":"The professor assigned a Boethian text on fate and free will.","zh":"教授布置了一篇关于命运与自由意志的波爱修式（波爱修相关）文本。"},{"en":"Her essay explores Boethian ideas about happiness and virtue.","zh":"她的文章探讨了波爱修关于幸福与德性的思想。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having themes or a tone characteristic of Boethius—especially calm, philosophical reflection in the face of misfortune.","zh":"具有波爱修式主题或语气的，尤指在不幸面前保持冷静、哲思式的反省。"},"examples":[{"en":"In a Boethian mood, he tried to accept the loss with patience.","zh":"在一种波爱修式的心境中，他试着以耐心接受失去。"},{"en":"The novel’s Boethian ending suggests that inner wisdom matters more than luck.","zh":"小说带有波爱修式的结尾，暗示内在智慧比运气更重要。"}]}],"synonyms":["Boethius-related","Boethius-inspired","philosophical","stoic-like"],"phonetic":"/boʊˈiːθiən/","extraExplanation":["“Boethian”来自哲学家 Boethius（中文常译“波爱修”）。他最著名的作品《哲学的慰藉》写于被囚禁期间，采用“对话体”方式，让“哲学”以拟人形象安慰作者，因此常与“逆境中的理性与慰藉”“命运之轮（Wheel of Fortune）”“自由意志与天命”等主题联系在一起。","在英语文学与思想史里，“Boethian”常用来描述中世纪及其后受到波爱修影响的写作与观点（例如把人生荣辱视为无常、强调德性与内在幸福）。"]}
{"word":"boethian","summary":{"en":"Boethian means “connected to Boethius or his philosophy,” often about finding inner happiness and calm despite changing fortune.","zh":"Boethian 指“与波爱修或其哲学相关”，常强调在命运多变中以德性与理性获得内在幸福与平静。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Roman philosopher Boethius (c. 480–524), especially his ideas and writings (notably *The Consolation of Philosophy*).","zh":"与罗马哲学家波爱修（Boethius，约480–524）及其思想、著作（尤其《哲学的慰藉》）相关的。"},"examples":[{"en":"The novel has a Boethian tone, mixing hardship with calm reflection about fate.","zh":"这部小说带有波爱修式的基调，把苦难与对命运的冷静反思结合在一起。"},{"en":"In class we read a Boethian dialogue about why bad things happen to good people.","zh":"课堂上我们读了一段波爱修式的对话，讨论“为什么好人会遭遇不幸”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Expressing a “Boethian” view that true happiness comes from inner virtue and reason rather than external luck or wealth.","zh":"体现“波爱修式”观点：真正的幸福来自内在的德性与理性，而非外在的运气或财富。"},"examples":[{"en":"Her Boethian outlook helped her stay steady when her plans failed.","zh":"她的波爱修式人生观让她在计划失败时依然保持坚定。"},{"en":"The poem ends with a Boethian reminder that fortune can change, but character can endure.","zh":"诗歌以波爱修式的提醒收尾：命运会改变，但品格可以持久。"}]}],"synonyms":["Boethius-related","Boethian philosophy–based","Stoic (approximate)"],"phonetic":"/boʊˈiːʃən/","extraExplanation":["“Boethian”来自 Boethius（波爱修）的名字。他是晚期罗马的重要思想家，最著名的作品《哲学的慰藉》写于他被囚期间，内容常以“哲学女士”（Lady Philosophy）与作者对话的形式，讨论命运（Fortune）、幸福、善恶与上帝/天意等主题。","在英语文学与文化研究里，说某部作品“Boethian”，常暗示：在逆境中用理性与德性寻求安定；把外在的好运与财富视为不可靠；强调内在精神的自由与自我修养。"]}
{"word":"Boethius","summary":{"en":"Boethius was a late Roman philosopher, best known for *The Consolation of Philosophy*.","zh":"波爱修斯是晚期罗马哲学家，以《哲学的慰藉》闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A late Roman philosopher and writer (c. 480–524 CE), best known for the book *The Consolation of Philosophy*, written while he was imprisoned.","zh":"波爱修斯（约公元480—524年），晚期罗马哲学家与作家，以狱中写成的《哲学的慰藉》最为著名。"},"examples":[{"en":"In medieval Europe, Boethius was widely read as a bridge between classical philosophy and Christian thought.","zh":"在中世纪欧洲，波爱修斯被广泛阅读，被视为连接古典哲学与基督教思想的桥梁。"},{"en":"Many students meet Boethius through *The Consolation of Philosophy*, a dialogue about suffering, fortune, and inner freedom.","zh":"许多学生通过《哲学的慰藉》认识波爱修斯，这是一部关于苦难、命运与内在自由的对话体作品。"}]},{"partOfSpeech":"n.","definition":{"en":"The author’s name used to refer to his works or ideas in general.","zh":"（转指）波爱修斯的著作或思想体系。"},"examples":[{"en":"The course includes a week on Boethius and the medieval idea of Fortune’s wheel.","zh":"这门课会用一周讨论波爱修斯以及中世纪“命运之轮”的观念。"}]}],"synonyms":["Anicius Manlius Severinus Boethius"],"phonetic":"/boʊˈiːθiəs/","extraExplanation":["“Boethius”通常读作三音节：bo-EE-thee-us。中文也常译为“波爱修斯”。","《哲学的慰藉》在中世纪影响极大，常被视为“在苦难中如何保持心灵自由”的经典文本；其中“Fortune（命运/时运）的轮子”意象很有代表性。","他也因翻译与介绍亚里士多德逻辑学而重要，被后世认为对中世纪教育中的“逻辑学”传统有推动作用。"]}
{"word":"Boethusian","summary":{"en":"Boethusian: relating to, or a member of, the Boethusians—an ancient Jewish priestly group/sect often linked with the Sadducees.","zh":"Boethusian：指与古代犹太“博埃图西亚派”（常被认为与撒都该派相近）有关的，或该派成员。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(historical) Relating to the Boethusians, a Jewish priestly group/sect in the late Second Temple period, often described as closely associated with (or similar to) the Sadducees.","zh":"（历史）与“博埃图西亚派/博伊图西亚派”（Boethusians）有关的；该派为第二圣殿晚期的犹太祭司集团/教派，常被认为与撒都该派关系密切或相近。"},"examples":[{"en":"Some rabbinic texts mention Boethusian views when discussing the calendar and festival dates.","zh":"一些拉比文献在讨论历法与节期日期时，会提到博埃图西亚派的观点。"},{"en":"The article compares Boethusian and Pharisaic interpretations of Jewish law.","zh":"这篇文章比较了博埃图西亚派与法利赛派对犹太律法的解释。"}]},{"partOfSpeech":"n.","definition":{"en":"A member of the Boethusians.","zh":"博埃图西亚派成员。"},"examples":[{"en":"A Boethusian might have been linked to the priestly aristocracy in Jerusalem.","zh":"一位博埃图西亚派成员可能与耶路撒冷的祭司贵族阶层有关。"}]}],"synonyms":["Sadducean (approx.)","Sadducee-linked (approx.)"],"phonetic":"/boʊˈiːθjuːʒən/","extraExplanation":["“Boethusian”来自专名 Boethus（常被认为与“博埃图斯家族/博埃图斯之屋”有关）。在一些传统记载中，博埃图西亚派被描写为与撒都该派立场相近，尤其在宗教权威与某些律法解释上常与法利赛派形成对比。","该词在现代英语中主要见于历史、宗教学与犹太学研究写作；日常英语几乎不用。常见搭配：Boethusian sect（博埃图西亚派）、House of Boethus（博埃图斯家族/博埃图斯之家）。","若你在阅读中遇到它，常见语境包括：拉比文献（如与节期/历法争论相关的段落）、第二圣殿时期的派别研究，以及对祭司阶层政治社会背景的讨论。"]}
{"word":"boethusian","summary":{"en":"Boethusian means “related to the Boethusians,” a Jewish sect/priestly group in the late Second Temple period, or a person who belonged to that group.","zh":"Boethusian 指“与博厄图西派（博厄图斯派）有关的”，或指该派成员；常见于第二圣殿时期末期犹太教派研究语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Boethusians (also called Boethusites), a Jewish sect or priestly group in the late Second Temple period, often described as similar to the Sadducees in their strict/literal approach to Jewish law.","zh":"与“博厄图西派／博厄图斯派”（Boethusians/Boethusites）有关的；该派是第二圣殿时期末期的一个犹太教派或祭司集团，常被描述为与撒都该人相近，倾向以更字面、严格的方式理解与执行律法。"},"examples":[{"en":"Some rabbinic sources mention Boethusian interpretations of certain festival laws.","zh":"一些拉比文献提到博厄图西派对某些节期律法的解释。"},{"en":"The article compares Sadducean and Boethusian views on ritual practice.","zh":"这篇文章比较了撒都该派与博厄图西派在宗教仪式实践上的观点。"}]},{"partOfSpeech":"n.","definition":{"en":"A member or follower of the Boethusians.","zh":"博厄图西派成员；博厄图斯派信徒。"},"examples":[{"en":"The text uses “Boethusian” to label a group of priests active in Jerusalem.","zh":"这段文字用“Boethusian（博厄图西派）”来指称一群活跃于耶路撒冷的祭司。"}]}],"synonyms":["Boethusite","Boethusian (as a noun)"],"phonetic":"/boʊˈiːθjuːʒən/","extraExplanation":["“Boethusian”来自专名 Boethus（博厄图斯）。在一些犹太拉比文献（如米示拿与塔木德的相关讨论）中，Boethusians/Boethusites 常被当作与撒都该派接近的群体来谈论，但其历史定位与具体主张在现代学界仍有争论。","在英语学术写作中，这个词多见于研究第二圣殿时期犹太教派、祭司家族与古代犹太法律争议（如节期日期的计算等）的语境。"]}
{"word":"Boetius","summary":{"en":"Boethius (also spelled Boetius) was a late Roman philosopher best known for The Consolation of Philosophy.","zh":"Boethius（亦拼作 Boetius）是古罗马晚期哲学家，以《哲学的慰藉》最为著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A Latin philosopher and writer (c. 480–524/525 CE), famous for The Consolation of Philosophy and for translating and commenting on Greek logic; an important bridge between classical and medieval thought.","zh":"（专有名词）拉丁哲学家、作家（约公元480—524/525年），以《哲学的慰藉》最著名，并以翻译、注释希腊逻辑学著称；被视为连接古典与中世纪思想的重要人物。"},"examples":[{"en":"Boethius wrote The Consolation of Philosophy while in prison.","zh":"波爱修在狱中写下了《哲学的慰藉》。"},{"en":"In many medieval schools, Boethius was a key author for learning logic.","zh":"在许多中世纪学校里，波爱修是学习逻辑学的重要作者。"}]}],"synonyms":["Anicius Manlius Severinus Boethius","Boetius (variant spelling)"],"phonetic":"/boʊˈiːθiəs/","extraExplanation":["“Boetius”常见为“Boethius”的另一种拼写；中文里多译作“波爱修”（也见“波伊修斯”等译名）。","《哲学的慰藉》把“命运之轮（the Wheel of Fortune）”“真正的幸福”等主题写得通俗而有文学性，因此常被当作哲学与文学交汇的经典来读。"]}
{"word":"Boettiger","summary":{"en":"Boettiger is a surname (family name).","zh":"Boettiger 是一个姓氏（家族姓）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), most commonly of German or Scandinavian origin; used to refer to a person or family with this name","zh":"一个姓氏（家族姓），多见于德语或斯堪的纳维亚语背景；用来指代具有该姓的人或家族"},"examples":[{"en":"Ms. Boettiger will lead the project this year.","zh":"Boettiger 女士将负责今年的项目。"},{"en":"I found a researcher named Boettiger in the article’s author list.","zh":"我在论文作者名单里看到了一个姓 Boettiger 的研究者。"}]}],"synonyms":["(no direct synonyms; it is a surname)"],"phonetic":"ˈbɛtɪɡər","extraExplanation":["“Boettiger”常被视为源自德语姓氏的拼写变体，常见关联为德语中的“Böttiger”。因为含有变音符号（ö）在英语语境中经常被简化为“oe”，所以会出现 Boettiger 这样的拼法。","作为姓氏，它在英语里通常按英语读音规则来读；不同家族或个人也可能有自己的习惯读法。"]}
