{"word":"bog","summary":{"en":"A bog is a wet, spongy wetland; as a verb, it means to sink or become stuck (literally or figuratively).","zh":"bog 指湿软的（泥）沼泽；作动词指陷入、受困或进展停滞（可字面或比喻）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A wet, soft area of ground (wetland) where the soil is like a sponge and can be hard to walk on; it often has moss and partly-decayed plants.","zh":"（泥）沼泽；湿软的地带（土壤像海绵一样松软潮湿，常有苔藓和未完全腐烂的植物）。"},"examples":[{"en":"Be careful—this path crosses a bog, and the ground is very soft.","zh":"小心——这条小路要穿过一片沼泽，地面很软。"},{"en":"Bogs store a lot of carbon because plants decay very slowly in them.","zh":"沼泽能储存大量碳，因为里面的植物分解得很慢。"}]},{"partOfSpeech":"v.","definition":{"en":"To sink into soft, wet ground, or to get stuck in mud or in a difficult situation.","zh":"（使）陷入泥沼；（使）受困、停滞（字面或比喻）。"},"examples":[{"en":"My boots bogged down in the mud.","zh":"我的靴子陷进了泥里。"},{"en":"The project got bogged down in paperwork.","zh":"这个项目被繁琐的文书工作拖住了，进展停滞。"}]}],"synonyms":["marsh","swamp","mire","quagmire","get stuck","become mired"],"phonetic":"/bɑːɡ/","extraExplanation":["英语里常见短语是 **get bogged down**（被拖住/陷入困境），常用来形容工作、讨论或流程因为细节、争执或手续太多而“卡住”。","在自然地理上，**bog** 通常是酸性较强、养分较少、以雨水为主要水源的湿地；常与 **marsh（沼泽地，草多）**、**swamp（沼泽林地，树多）** 对比，但日常英语里不必分得很细。","文学与文化里，沼泽常被用作“危险、神秘、难以脱身”的意象，因此动词用法的比喻意义很自然：像走进泥地一样，越挣扎越难前进。"]}
{"word":"bog-trotter","summary":{"en":"“Bog-trotter” is a noun; it is usually an offensive slur for an Irish person, and only rarely means someone walking through a bog.","zh":"“bog-trotter”是名词；通常是对爱尔兰人的侮辱性蔑称，极少数情况下才指“在沼泽地行走的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(offensive) A derogatory term for an Irish person, especially one stereotyped as rural or poor.","zh":"（冒犯）对爱尔兰人的贬义称呼，尤其带有“乡下、贫穷”等刻板印象。"},"examples":[{"en":"The comedian was criticized for using the word “bog-trotter” on stage.","zh":"那位喜剧演员因在舞台上使用“bog-trotter”一词而受到批评。"},{"en":"Avoid slurs like “bog-trotter”; they are insulting and can hurt people.","zh":"要避免使用像“bog-trotter”这样的蔑称；它们很侮辱人，也会伤害他人。"}]},{"partOfSpeech":"n.","definition":{"en":"(literal, rare) Someone who walks across a bog or wet, marshy ground.","zh":"（字面义，较少见）在沼泽地/泥炭地上行走的人。"},"examples":[{"en":"Wearing boots, the hikers became careful bog-trotters as the trail turned swampy.","zh":"穿上靴子后，徒步者在小路变得泥泞时小心地在沼泽地上行走。"}]}],"synonyms":["(literal) bog walker","(literal) marsh walker"],"phonetic":"/ˈbɑɡ ˌtrɑtər/","extraExplanation":["这个词来自 bog（泥炭沼泽地）+ trotter（快步走的人）。“字面义”并不常用；更常见的是带有贬损意味的用法，历史上与反爱尔兰的偏见和刻板印象有关，因此在现代英语中通常被视为侮辱性词语，不建议使用。","如果你想表达“来自爱尔兰的人”，更中性常用的说法是 Irish person / Irish people；在正式语境中也可说 an Irish citizen（爱尔兰公民）。"]}
{"word":"boga","summary":{"en":"“Boga” is not a common everyday English word; it’s most often a Spanish-related term meaning “in vogue” (en boga), a Mediterranean fish name, or a proper noun.","zh":"“boga”不是常见英语词；多见于与西班牙语相关的“流行（en boga）”、一种地中海鱼名，或作为专有名词使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(loanword, from Spanish) “Vogue” or “fashion,” often seen in the phrase “en boga” meaning “in fashion / popular.”","zh":"（西班牙语借词）“流行、时髦”，常见于短语“en boga”，意思是“正在流行/很受欢迎”。"},"examples":[{"en":"In some Spanish-speaking countries, that style is en boga this year.","zh":"在一些西语国家，那种风格今年很流行（en boga）。"},{"en":"The article describes which ideas are boga in contemporary culture.","zh":"这篇文章描述了当代文化中哪些观点正在流行（boga）。"}]},{"partOfSpeech":"n.","definition":{"en":"A small Mediterranean fish (the “boga,” species Boops boops), sometimes mentioned in seafood contexts.","zh":"一种地中海的小型鱼（常称“boga”，学名 Boops boops），有时出现在海鲜语境中。"},"examples":[{"en":"The menu listed grilled boga with lemon and herbs.","zh":"菜单上写着柠檬香草烤 boga 鱼。"}]},{"partOfSpeech":"other","definition":{"en":"A proper name (e.g., place names like the Boga River, or personal/brand names). Meaning depends on the specific context.","zh":"专有名词（如地名 Boga River，或人名/品牌名等），具体含义取决于语境。"},"examples":[{"en":"They rafted along the Boga River during the rainy season.","zh":"雨季时他们在 Boga 河上漂流。"}]}],"synonyms":["vogue","fashion","popular (in the phrase “en boga”)"],"phonetic":"/ˈboʊɡə/","extraExplanation":["在英语里，“boga”本身不是常见的日常词；你更可能在（1）讨论西班牙语/拉美文化的英文文章里看到它（尤其是短语 en boga），或（2）海鲜与生物学语境里作为鱼名，或（3）作为地名、人名出现。","如果你告诉我你看到“boga”的句子或出处（哪本书/哪段对话/哪个国家的用法），我可以帮你判断这里具体是哪一种意思。"]}
{"word":"bogach","summary":{"en":"“Bogach” is slang (from Russian) meaning a rich person.","zh":"“bogach”是源自俄语的俚语，意思是“有钱人/富人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Slang, from Russian) a rich person; a wealthy guy.","zh":"（俚语，源自俄语）有钱人；富人（常指“有钱的家伙”）。"},"examples":[{"en":"He acts like a bogach, but he’s actually in debt.","zh":"他装得像个有钱人，但其实负债累累。"},{"en":"That neighborhood is full of bogaches with big cars and security gates.","zh":"那个社区到处都是开豪车、装安保大门的有钱人。"}]}],"synonyms":["rich person","wealthy person","rich guy","millionaire","tycoon"],"phonetic":"/ˈboʊɡɑtʃ/","extraExplanation":["“Bogach”多见于带有俄语/东欧文化背景的英语网络用语或翻译腔里（比如讨论俄语梗、游戏、视频或移民社群话题）。日常英语里更常用：rich person, wealthy person, millionaire, tycoon（更正式）或 rich guy（更口语）。","词源：来自俄语 богач（bogach），意思就是“富人”。在使用时可能带一点调侃或阶层意味，具体语气要看上下文。"]}
{"word":"Bogalusa","summary":{"en":"Bogalusa is a city in southeastern Louisiana, USA.","zh":"Bogalusa 是美国路易斯安那州东南部的一座城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small city in Washington Parish, in southeastern Louisiana, USA.","zh":"（美国）路易斯安那州东南部华盛顿堂区的一座小城市（博加卢萨）。"},"examples":[{"en":"Bogalusa is about an hour northeast of New Orleans by car.","zh":"开车从新奥尔良到博加卢萨，往东北方向大约一小时左右。"},{"en":"She grew up in Bogalusa, Louisiana.","zh":"她在路易斯安那州的博加卢萨长大。"}]}],"phonetic":"/ˌboʊɡəˈluːsə/","extraExplanation":["“Bogalusa”是专有名词（地名），常见用法是在后面加州名/国家来说明位置：Bogalusa, Louisiana。","地名一般被视为不可数名词；谈到当地人或事物时，英语里更常用 “from Bogalusa” 或 “in Bogalusa” 来表达，而不是把它当作普通可数名词使用。"]}
{"word":"Bogan","summary":{"en":"“Bogan” is Australian/NZ slang for an uncultured or rough person, and also describes a rough or tacky style.","zh":"“Bogan”是澳大利亚/新西兰俚语，指被认为粗俗/不够讲究的人，也可形容土气、粗糙的风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Australia, New Zealand, slang) A person seen as unsophisticated or unrefined, often linked with working‑class tastes (sometimes used jokingly, sometimes as an insult).","zh":"（澳大利亚/新西兰俚语）指被认为不够“有品味”、不够文雅的人，常与工人阶层或某些穿着/兴趣联系在一起（可开玩笑用，也可带贬义）。"},"examples":[{"en":"He calls himself a bogan, but he’s actually pretty friendly.","zh":"他自称是个 bogan，不过人其实挺友好的。"},{"en":"She moved to Australia and had to learn slang like “bogan.”","zh":"她搬到澳大利亚后得学一些俚语，比如“bogan”。"},{"en":"That comment sounded a bit insulting—don’t label people as bogans.","zh":"那句话听起来有点侮辱人——别随便给人贴“bogan”的标签。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) Typical of a “bogan” style or taste; rough, tacky, or unpolished (often humorous).","zh":"（非正式）带有“bogan风格/品味”的；粗糙的、土气的、不够精致的（常带调侃）。"},"examples":[{"en":"He showed up in a bogan outfit—football shorts and flip-flops.","zh":"他穿着很 bogan 的搭配出现——球裤加人字拖。"},{"en":"It’s a bogan joke, but I still laughed.","zh":"这是个很 bogan 的玩笑，但我还是笑了。"}]}],"synonyms":["(slang) redneck (roughly similar, US)","chav (UK, roughly similar)","lout","yob"],"phonetic":"/ˈboʊɡən/","extraExplanation":["“bogan”主要流行于澳大利亚和新西兰英语，语气可能从自嘲式的亲切调侃到明显的贬低不等，使用时要看场合和关系。","它常被拿来和“posh（很上流/讲究）”“snob（势利/自命不凡的人）”形成对比，讨论阶层与品味时尤其常见。","在澳洲文化里也有把“bogan”当作身份标签自豪使用的情况，类似对刻板印象的反转与自我认同。"]}
{"word":"bogan","summary":{"en":"An Australian informal word for a person—or style—seen as rough or unsophisticated (sometimes joking or self‑mocking).","zh":"澳大利亚非正式用语，指被认为粗犷/不够讲究的人或风格；可贬可自嘲，取决于语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Australia, informal) A person (often a man) seen as unrefined or unsophisticated, with a “rough” style; similar to “redneck” or “chav” (UK), depending on context.","zh":"（澳大利亚，非正式）指被认为没品味、不够精致或有点“粗”的人（常指男性）；语感上接近“redneck（乡巴佬/土气的白人）”或英国的“chav（俗气的年轻人）”，但需看语境。"},"examples":[{"en":"He calls himself a bogan, but he’s actually pretty friendly.","zh":"他自称是个 bogan，但其实人挺友好的。"},{"en":"That TV show plays up the bogan stereotype for laughs.","zh":"那档电视节目把 bogan 的刻板印象夸张化来制造笑点。"},{"en":"She hates being judged as a bogan just because of her accent.","zh":"她讨厌别人只因为她的口音就把她当成 bogan。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to a “bogan” style; rough, unsophisticated, or stereotypically working‑class (often used jokingly).","zh":"带有“bogan 风格”的；粗犷/不够讲究/带有刻板印象的工薪阶层气质（常带调侃或自嘲语气）。"},"examples":[{"en":"He showed up in a really bogan outfit.","zh":"他穿了一身很 bogan 的搭配就来了。"},{"en":"It’s a bit bogan, but it’s comfortable.","zh":"是有点 bogan，但穿着舒服。"}]}],"synonyms":["(approx.) redneck","(approx., UK) chav","lout","yob"],"phonetic":"/ˈboʊɡən/","extraExplanation":["“bogan”是澳大利亚英语里非常有代表性的词，语气可能从侮辱到自嘲/自我认同都有。朋友之间可能开玩笑说“我很 bogan”，但对陌生人直接说可能显得冒犯。","常见刻板印象包括：爱穿便宜休闲装、爱喝啤酒、喜欢改装车/烧烤/体育等；但现实中很多人会把它当作一种幽默的文化标签，而不一定是贬义。","相关词对比：美国的“redneck”更常指乡村白人劳动阶层；英国“chav”更偏向某类街头青年形象；“bogan”更贴近澳洲语境。使用时注意场合与对象。"]}
{"word":"bogans","summary":{"en":"“Bogans” is the plural of “bogan,” an Australian informal word for someone (or a style) seen as unrefined or unsophisticated.","zh":"“bogans”是“bogan”的复数，是澳大利亚俚语，指被认为不够讲究/有点粗俗的人或风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Australia, informal) A person seen as unrefined or unsophisticated, often linked (fairly or unfairly) with working‑class style—e.g., loud behavior, heavy drinking, “trashy” fashion, or a love of certain cars/music.","zh":"（澳大利亚俚语）指被认为不够“讲究”、有点粗鲁或不够有品味的人；常（不一定公平地）与工人阶层刻板印象相关，如行为大声、爱喝酒、穿着“土”、喜欢某些车或音乐等。"},"examples":[{"en":"Some people unfairly call anyone with a loud car a bogan.","zh":"有些人不太公平地把开很吵的车的人都叫作 bogan。"},{"en":"The show jokes about bogans, but it can be a sensitive label.","zh":"那部节目拿 bogan 开玩笑，但这个标签可能让人不舒服。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing a style, taste, or behavior considered “bogan.”","zh":"形容某种风格、品味或行为被认为很“bogan”（土、粗、没那么讲究）。"},"examples":[{"en":"He wore a bogan outfit—thongs, a singlet, and board shorts.","zh":"他穿得很 bogan——人字拖、背心和沙滩短裤。"},{"en":"They teased him for his bogan sense of humor.","zh":"他们拿他那种 bogan 的幽默感开玩笑。"}]}],"synonyms":["(roughly) chav (UK)","(roughly) redneck (US)","lout","yob"],"phonetic":"/ˈboʊɡən/","extraExplanation":["“bogan”主要用于澳大利亚英语（新西兰也有人用）。语气多半带贬义或嘲讽，但有时也会被当作自嘲、调侃式的身份认同。","和英式英语的“chav”、美式英语里带刻板印象的“redneck/white trash”有一定相似性，但文化背景不同，使用时要注意场合与对象，避免冒犯。","常见搭配：bogan humor（很土/很粗的幽默）、bogan culture（所谓“bogan文化”）、cashed-up bogan（有钱了但品味仍被认为很“bogan”的人，缩写CUB）。"]}
{"word":"Bogard","summary":{"en":"“Bogard” is usually a surname. If you mean the slang verb, the common spelling is “bogart,” meaning to hog something or push others around.","zh":"“Bogard”通常是姓氏；若指俚语动词，常见拼写是“bogart”，表示“独占/霸占”或“强势控制他人”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(slang) To keep something for yourself and not share it with others; to hog.","zh":"（俚语）把某物占为己有而不分享；独占。"},"examples":[{"en":"Stop bogarting the fries—let everyone have some.","zh":"别独占薯条了——让大家也吃点。"},{"en":"He bogarted the conversation and didn’t let anyone else speak.","zh":"他把谈话“霸占”了，不让别人说话。"}]},{"partOfSpeech":"v.","definition":{"en":"(slang) To push people around or control them in a bossy way; to strong-arm.","zh":"（俚语）强势控制他人；用强硬手段逼迫。"},"examples":[{"en":"She tried to bogart her teammates into doing all the extra work.","zh":"她想强迫队友把额外工作都做了。"},{"en":"Don’t let him bogart you—say what you need.","zh":"别让他压着你——把你该说的话说出来。"}]},{"partOfSpeech":"n.","definition":{"en":"Humphrey Bogart (1899–1957), a famous American film actor; his last name is also used in the slang verb “to bogart.”","zh":"亨弗莱·鲍嘉（1899–1957），著名美国电影演员；他的姓也引申出俚语动词“to bogart”。"},"examples":[{"en":"Humphrey Bogart starred in the classic film Casablanca.","zh":"亨弗莱·鲍嘉主演了经典电影《卡萨布兰卡》。"}]},{"partOfSpeech":"n.","definition":{"en":"Bogard: a family name (surname). It’s sometimes seen as a spelling variant or confusion with “Bogart.”","zh":"Bogard：姓氏。有时会被当作“Bogart”的变体或与其混淆。"},"examples":[{"en":"Ms. Bogard will lead today’s meeting.","zh":"博加德女士将主持今天的会议。"}]}],"synonyms":["hog","monopolize","dominate","bully","strong-arm"],"phonetic":"/boʊˈɡɑrt/","extraExplanation":["“to bogart”这个俚语和演员 Humphrey Bogart 的银幕形象有关：他常演强势、叼烟的人物。后来在口语里引申为“别霸占（尤其是香烟/大麻烟卷）”。在更日常的语境中，它也可泛指“别独占食物、话题、资源”。","如果你指的是人名“Bogard”，通常只作为姓使用，不带“独占”的俚语含义；而表示“独占/霸占”的常见拼写是“bogart”。"]}
{"word":"bogard","summary":{"en":"“Bogard” is usually a surname, but many people use it as a misspelling of the informal verb “bogart,” meaning to hog or selfishly keep something.","zh":"“Bogard”通常是姓氏；但很多人会把它当作非正式动词“bogart”的误拼，意思是“霸占、独占”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to selfishly take or keep more than your share (especially something shared, like space, time, food, or a microphone); to hog","zh":"自私地占用或独占（尤指共享的空间、时间、食物或物品）；霸占"},"examples":[{"en":"Stop bogarting the snacks—everyone wants some.","zh":"别霸占零食了——大家都想吃。"},{"en":"He was bogarting the conversation and didn’t let anyone else speak.","zh":"他一直霸着谈话，不让别人说话。"},{"en":"Can you not bogart the window seat the whole flight?","zh":"你能别整趟航班都霸着靠窗座位吗？"}]},{"partOfSpeech":"n.","definition":{"en":"a surname (family name); also seen as a less common spelling that people use when they mean “Bogart”","zh":"姓氏；也常见作较少见的拼写，用来指代“Bogart”"},"examples":[{"en":"Her last name is Bogard.","zh":"她的姓是 Bogard。"},{"en":"I think you mean “bogart” (with a t), not “bogard.”","zh":"我觉得你想写的是“bogart”（t 结尾），不是“bogard”。"}]}],"synonyms":["hog","monopolize","grab","keep to oneself"],"phonetic":"/ˈboʊɡɑrt/","extraExplanation":["“to bogart（霸占）”是非正式用法，来源与美国演员 Humphrey Bogart（亨弗莱·鲍嘉）相关的文化联想：他常在银幕上叼着烟、形象很“占着不放”。后来在口语里引申为“别一个人占着（尤其是烟或某样共享的东西）”。","在日常交流中，更常见的拼写是 bogart（t 结尾）。如果你是在写姓氏，则 Bogard 作为姓也成立。"]}
{"word":"Bogarde","summary":{"en":"Bogarde usually refers to Dirk Bogarde, a well-known British actor and writer.","zh":"Bogarde 通常指英国著名演员兼作家德克·博加德（Dirk Bogarde）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A British actor and writer (Dirk Bogarde, 1921–1999), known for moving from early “matinee idol” roles to complex, darker films.","zh":"英国演员兼作家（德克·博加德 Dirk Bogarde，1921–1999），以从早期的“银幕偶像”形象转向更复杂、阴暗题材的电影而闻名。"},"examples":[{"en":"Dirk Bogarde became famous in British cinema in the 1950s.","zh":"德克·博加德在20世纪50年代的英国电影界成名。"},{"en":"She recommended a film starring Bogarde for its subtle acting.","zh":"她推荐了一部博加德主演的电影，称其表演细腻。"}]}],"phonetic":"/boʊˈɡɑrd/","extraExplanation":["“Bogarde”通常指人名，最常见的是演员 Dirk Bogarde；在英文里多作为专有名词出现，写作时要首字母大写。","他较有代表性的作品常被影迷提到，例如《The Servant》（《仆人》）和《Death in Venice》（《威尼斯之死》）。如果在影评或文学评论中看到“Bogarde”，通常是在讨论这些经典电影或他的表演风格。"]}
{"word":"Bogart","summary":{"en":"“Bogart” can mean to selfishly hog something, and it’s also the name of actor Humphrey Bogart.","zh":"“Bogart”既可作动词表示“霸占/独占”，也可作名词指演员亨弗莱·鲍嘉。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to selfishly take or keep something (especially something meant to be shared), or to use something too long without letting others have a turn","zh":"（尤指应当共享的东西）自私地独占、霸占；（轮流时）占着不用不让别人用"},"examples":[{"en":"Don’t bogart the chips—leave some for everyone.","zh":"别把薯片都霸占了——给大家留点。"},{"en":"He’s been bogarting the TV remote all night.","zh":"他整晚都在霸占电视遥控器。"},{"en":"Could you stop bogarting the conversation and let her speak?","zh":"你别一直把话题占着不放，让她也说两句好吗？"}]},{"partOfSpeech":"n.","definition":{"en":"Humphrey Bogart (1899–1957), a famous American film actor often associated with tough, cool characters in classic movies","zh":"亨弗莱·鲍嘉（1899–1957），美国著名电影演员，常以冷峻硬汉形象出演经典影片"},"examples":[{"en":"Humphrey Bogart starred in the classic film Casablanca.","zh":"亨弗莱·鲍嘉主演了经典电影《卡萨布兰卡》。"},{"en":"He tried to talk like Bogart in old movies.","zh":"他试着模仿老电影里鲍嘉的说话方式。"}]}],"synonyms":["hog","monopolize","keep to yourself"],"phonetic":"/ˈboʊɡɑrt/","extraExplanation":["动词 bogart 属于比较口语、带点玩笑意味的用法，常见于美式英语。它来自演员 Humphrey Bogart 在电影里常叼着香烟/雪茄的形象，后来在 20 世纪的俚语中引申为“别把东西（尤其是烟）一直占着不传给别人”。"]}
{"word":"bogart","summary":{"en":"“Bogart” is slang meaning to hog something and not share it (often a cigarette/joint, food, or space).","zh":"“bogart”是俚语，指“独占不分享”，常用于香烟/大麻烟、食物或空间等情境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(slang) To keep something for yourself and not share it, especially a cigarette, joint, food, or space; to hog.","zh":"（俚语）把东西据为己有不分享，尤指香烟/大麻烟、食物或空间；独占、霸占。"},"examples":[{"en":"Don’t bogart the chips—leave some for everyone.","zh":"别霸占薯片——给大家留点。"},{"en":"He was bogarting the armrest the whole flight.","zh":"他整趟飞行都在霸占扶手。"},{"en":"Stop bogarting the remote and let someone else choose a show.","zh":"别一直霸占遥控器，让别人也选个节目。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, less common) A person who hogs or monopolizes something; someone who won’t share.","zh":"（非正式，较少见）爱独占、不愿分享的人；霸占者。"},"examples":[{"en":"He’s such a bogart with the snacks.","zh":"他在零食方面特别爱独占。"}]}],"synonyms":["hog","monopolize","keep to yourself","grab","hold on to"],"phonetic":"/ˈboʊɡɑrt/","extraExplanation":["这个词的俚语用法常被认为与演员 Humphrey Bogart 的银幕形象有关：他常叼着烟、显得“把烟占着不放”的样子。20世纪60–70年代的美国口语里，尤其在“传着抽”的场景中，bogart 常指“别一直拿着不传”。","语体提醒：bogart 比较口语、带点玩笑或吐槽语气；在正式写作里更常用 hog / monopolize / keep to yourself。"]}
{"word":"Bogata","summary":{"en":"Bogotá is the capital city of Colombia; “Bogata” is usually a misspelling of “Bogotá.”","zh":"Bogotá 是哥伦比亚首都；“Bogata”通常是把“Bogotá”拼错了。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bogotá (often misspelled as “Bogata”) is the capital and largest city of Colombia, located in the Andes Mountains.","zh":"Bogotá（常被拼错为“Bogata”）是哥伦比亚的首都和最大城市，位于安第斯山脉地区。"},"examples":[{"en":"Bogotá is Colombia’s capital and a major cultural center.","zh":"Bogotá 是哥伦比亚的首都，也是重要的文化中心。"},{"en":"I’m flying to Bogotá for a conference next week.","zh":"我下周要飞去 Bogotá 参加会议。"},{"en":"The weather in Bogotá can change quickly because of its high elevation.","zh":"因为海拔高，Bogotá 的天气变化可能很快。"}]}],"synonyms":["Bogotá","Bogota"],"phonetic":"/ˌboʊɡəˈtɑ/","extraExplanation":["“Bogotá”在西班牙语里最后一个音节重读，并且有重音符号：Bogotá。英语里有时会省略重音符号写成“Bogota”，但更正式/尊重的写法是保留“á”。","如果你写的是“Bogata”，在英语语境中通常会被理解为把“Bogotá”拼错了；在正式写作（邮件、论文、旅行文件）建议改为“Bogotá”或“Bogota”。"]}
{"word":"bogatyr","summary":{"en":"A bogatyr is a legendary heroic warrior from Russian/East Slavic epic tales.","zh":"bogatyr 指俄罗斯/东斯拉夫史诗传说中的传奇英雄武士。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A heroic warrior or knight from medieval East Slavic (especially Russian) epic legends (byliny), known for great strength and bravery.","zh":"（尤指俄罗斯）中世纪东斯拉夫史诗传说（如“民间史诗 byliny”）中的英雄武士/骑士，以力量与勇敢著称。"},"examples":[{"en":"In Russian folktales, a bogatyr often protects the land from monsters and invaders.","zh":"在俄罗斯民间故事里，bogatyr 常常保护家园，抵御怪物和入侵者。"},{"en":"The painting shows three bogatyrs standing watch over the open steppe.","zh":"这幅画描绘了三位 bogatyr 守望着辽阔的草原。"}]}],"synonyms":["epic hero","legendary warrior","knight (rough equivalent)"],"phonetic":"ˈboʊɡətɪr","extraExplanation":["词源上它来自东斯拉夫语境（俄语 богатырь），在俄语文化里常与“byliny（史诗歌谣）”相连，类似西欧传统中的“骑士/英雄”，但更带有民间史诗色彩。","在艺术与文学中常见的代表是瓦斯涅佐夫（Viktor Vasnetsov）的名画《三勇士》（又译《三位勇士》/《三位 bogatyrs》），画面中的英雄常被视为这一形象的典型。","英语里这个词多用于讨论斯拉夫神话、民俗、艺术史或游戏/奇幻作品，属于文化特定词；日常英语不常用。"]}
{"word":"bogbean","summary":{"en":"Bogbean is a wetland plant (buckbean) found in bogs and marshes, known for its three-part leaves and fringed flowers.","zh":"bogbean 指一种湿地植物（buckbean/睡菜），常见于沼泽与湿地，特点是三小叶与带流苏状花瓣的花。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wetland plant with three-part leaves and white or pink fringed flowers, often found in bogs and marshes; buckbean (Menyanthes trifoliata)","zh":"一种生长在泥炭沼泽与湿地的植物，叶片常为三小叶，花多为白色或粉色并带流苏状边缘；又称“buckbean”（睡菜属植物，Menyanthes trifoliata）"},"examples":[{"en":"Bogbean grows in cold, waterlogged wetlands and is common in northern regions.","zh":"睡菜生长在寒冷、积水的湿地中，在北方地区比较常见。"},{"en":"The pond’s edge was dotted with bogbean flowers in late spring.","zh":"晚春时，池塘边点缀着睡菜的花。"}]}],"synonyms":["buckbean","Menyanthes trifoliata"],"phonetic":"/ˈbɔɡˌbiːn/","extraExplanation":["“bogbean”这个名字来自其生境：bog（泥炭沼泽）+ bean（豆类植物）。它并不是真正的豆科植物，“bean”更多是民间命名习惯。","在英语里它也常被叫作“buckbean”。在一些传统草药语境中会被提到，但日常英语中更常见于自然观察、植物学或湿地生态相关的文章。"]}
{"word":"bogbeans","summary":{"en":"Bogbeans are wetland plants that grow in bogs and marshes, known for three-part leaves and pale pink-white flowers.","zh":"Bogbeans 指生长在沼泽、泥炭地等湿地的植物，常见特征是三出复叶和粉白色花。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wetland plant with three-part leaves and pinkish-white flowers, often found in bogs and marshes (also called buckbean)","zh":"一种生长在沼泽、泥炭地等湿地的植物，叶片常为三出复叶，花多为粉白色（也叫“buckbean”）"},"examples":[{"en":"Bogbeans bloom in late spring along the edges of the marsh.","zh":"沼泽毛三叶常在晚春时在湿地边缘开花。"},{"en":"The pond’s shallow water was full of bogbeans and other wetland plants.","zh":"池塘的浅水区长满了沼泽毛三叶和其他湿地植物。"}]}],"synonyms":["buckbean","bog bean"],"phonetic":"/ˈbɑɡˌbinz/","extraExplanation":["“bogbean”常指植物学名 Menyanthes trifoliata。之所以叫“bean”，主要是因为它的叶形让人联想到豆科植物的复叶，但它并不属于豆科。","在自然写作或生态语境里，这个词常用来描绘北方湿地景观；也可能出现在保护湿地、生物多样性或观鸟相关的文章中。"]}
{"word":"bogberries","summary":{"en":"Bogberries are berries that grow in wet bogs, especially cranberries.","zh":"Bogberries 指生长在湿地沼泽中的浆果，尤常指蔓越莓。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Small berries that grow in boggy, wet ground, especially cranberries (and sometimes similar wild berries).","zh":"（复数）生长在沼泽、湿地里的小浆果，尤指蔓越莓（有时也泛指类似的野生浆果）。"},"examples":[{"en":"Cranberries are often called bogberries because they grow in bogs.","zh":"蔓越莓常被称为 bogberries，因为它们生长在沼泽地里。"},{"en":"We went picking bogberries near the marsh in early autumn.","zh":"初秋我们到沼泽附近采 bogberries。"}]}],"synonyms":["cranberries","wild berries"],"phonetic":"/ˈbɔːɡˌbɛriz/","extraExplanation":["“bogberry”并不是非常标准、普遍的日常词；在北美语境中它常被用来指蔓越莓（cranberry），因为蔓越莓商业种植常在类似“bog（泥炭沼泽/湿地）”的浅水湿地环境中进行。不同地区或不同资料里，bogberry 也可能被宽泛地用来指某些生长在沼泽地的野生浆果，因此遇到该词时最好结合上下文确认具体是哪一种莓。","词形上：bog（沼泽）+ berry（浆果）；复数为 bogberries。"]}
{"word":"bogberry","summary":{"en":"Bogberry is a (rare) name for a bog-growing berry, especially the cranberry.","zh":"Bogberry 是一种较少见的说法，指生长在沼泽湿地的浆果，尤指蔓越莓。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small tart berry that grows in boggy, wet ground, especially the cranberry (and sometimes similar bog-growing berries).","zh":"生长在沼泽等潮湿地带的小浆果，尤指蔓越莓（有时也泛指类似的沼泽浆果）。"},"examples":[{"en":"Cranberries are sometimes called bogberries because they grow in wet bogs.","zh":"蔓越莓有时被叫作“bogberry”，因为它们生长在潮湿的沼泽地里。"},{"en":"We saw wild bogberries along the marshy edge of the forest.","zh":"我们在森林潮湿的边缘看到了野生的沼泽浆果。"}]}],"synonyms":["cranberry","bog blueberry (related)","wild cranberry"],"phonetic":"/ˈbɑːɡˌbɛri/","extraExplanation":["“bogberry”在日常英语里不算常见，更常用的词是“cranberry（蔓越莓）”。在一些地区或旧文献里，“bogberry”可能被用作对蔓越莓（或其他生长在泥炭沼泽/湿地的浆果）的俗称。","北美有“cranberry bog（蔓越莓沼泽/种植园）”的说法；蔓越莓常在低洼湿地种植、采收时还会把田地注水，便于采摘与集中果实。"]}
{"word":"bogel","summary":{"en":"“Bogel” is a rare word, usually a variant of “bogle,” meaning a goblin/ghost; it’s sometimes confused with “boggle.”","zh":"“bogel”很少见，通常是“bogle”的变体，意为妖怪/鬼；也常与“boggle（困惑；退缩）”混淆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) A goblin or ghost; a frightening supernatural creature (chiefly Scottish/older English; more common spelling: “bogle”).","zh":"（罕见）妖怪、鬼魂；吓人的超自然生物（多见于苏格兰/古英语，更常见拼写为 bogle）。"},"examples":[{"en":"In old Scottish tales, a bogel might haunt a lonely road at night.","zh":"在一些古老的苏格兰故事里，bogel 可能会在夜里出没于偏僻的小路。"},{"en":"The children whispered about a bogel in the attic.","zh":"孩子们小声说阁楼里有个 bogel。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare, by extension) To startle or frighten someone; to spook (more common verb: “boggle” or “spook”).","zh":"（罕见，引申）使人受惊、吓到；惊吓（更常用动词：boggle 或 spook）。"},"examples":[{"en":"The sudden noise bogeled the hikers in the dark.","zh":"黑暗中突然的声响把徒步者吓了一跳。"}]}],"synonyms":["bogle","goblin","ghost","spirit","spook"],"phonetic":"ˈboʊɡəl","extraExplanation":["“bogel”在现代英语里非常少见，多数情况下是“bogle”（苏格兰方言：妖怪/鬼）的变体拼写，或是把常用词“boggle”（使困惑；犹豫退缩）拼错了。","如果你想表达“困惑/不敢相信”，通常用 boggle：My mind boggles at the cost.（这费用让我难以置信/难以理解。）"]}
{"word":"boget","summary":{"en":"A budget is a money plan, or the money available; to budget means to plan spending.","zh":"budget 表示“预算/经费”，也可作动词表示“做预算、规划开支”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plan for how much money you will earn, spend, and save during a period of time (for example, a month or a year)","zh":"预算；（一段时间内的）收支计划"},"examples":[{"en":"We made a monthly budget to control our spending.","zh":"我们做了一个月度预算来控制开销。"},{"en":"This trip is not in my budget right now.","zh":"这趟旅行目前不在我的预算之内。"}]},{"partOfSpeech":"n.","definition":{"en":"the amount of money available for a purpose","zh":"（用于某事的）经费；资金限额"},"examples":[{"en":"The project has a small budget, so we must be careful.","zh":"这个项目经费不多，所以我们必须谨慎。"},{"en":"They increased the education budget this year.","zh":"他们今年增加了教育经费。"}]},{"partOfSpeech":"v.","definition":{"en":"to plan how much money you will spend (and on what)","zh":"做预算；把（支出）列入预算"},"examples":[{"en":"I budget for rent, food, and transportation first.","zh":"我会先给房租、吃饭和交通做预算。"},{"en":"We budgeted $200 for gifts.","zh":"我们给礼物预算了200美元。"}]}],"synonyms":["spending plan","financial plan","funds","allowance"],"phonetic":"/ˈbʌdʒɪt/","extraExplanation":["“boget”常见于拼写错误，最可能是想写 **budget**。如果你其实想查的是别的词（例如 *bogey* 或 *bouquet*），告诉我上下文句子，我可以帮你确认。"]}
{"word":"Bogey","summary":{"en":"“Bogey” most commonly means a golf score one stroke over par; it can also mean an unidentified target (especially an aircraft) or an imagined fear, and more rarely a train wheel assembly (bogie).","zh":"“Bogey”最常见指高尔夫的“柏忌”（比标准杆多一杆）；也可指（雷达上的）不明目标，或令人担忧的“心魔/可怕事物”；较少见时还可指火车的转向架（bogie）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Golf) a score of one stroke over par on a hole.","zh":"（高尔夫）柏忌：某一洞的成绩比标准杆多一杆。"},"examples":[{"en":"I made a bogey on the 8th hole but still finished the round well.","zh":"我在第8洞打了柏忌，但这一轮整体还不错。"},{"en":"A bogey isn’t great, but it’s better than a double bogey.","zh":"柏忌不算理想，但比双柏忌好。"}]},{"partOfSpeech":"n.","definition":{"en":"An unknown or suspicious object, especially an unidentified aircraft on radar (military/aviation).","zh":"（军用/航空）不明目标：雷达上出现的未知或可疑物体，尤指不明飞行物。"},"examples":[{"en":"The controller reported a bogey approaching from the north.","zh":"管制员报告北方有一个不明目标接近。"},{"en":"They tracked the bogey until it left the airspace.","zh":"他们追踪这个不明目标，直到它离开空域。"}]},{"partOfSpeech":"n.","definition":{"en":"Something that causes fear or worry; an imagined threat (similar to “bogeyman”).","zh":"令人恐惧或担忧的东西；想象中的威胁（类似“bogeyman/怪物”）。"},"examples":[{"en":"For him, public speaking was a real bogey.","zh":"对他来说，当众演讲是个真正的“心魔”。"},{"en":"Don’t let small mistakes become a bogey in your mind.","zh":"别让小错误在你心里变成挥之不去的恐惧。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common, especially in American English) a swiveling wheel assembly under a train car; a “bogie.”","zh":"（较少见）转向架：火车车厢下可转向的轮组（常写作 bogie）。"},"examples":[{"en":"The mechanic inspected the bogey for wear and cracks.","zh":"维修工检查了转向架是否有磨损和裂纹。"}]}],"synonyms":["(golf) one-over-par","unidentified target","unknown contact","bogeyman (related)","phantom","specter"],"phonetic":"/ˈboʊɡi/","extraExplanation":["“bogey（高尔夫）”的词源常被认为与19世纪英国流行歌曲里的“Bogey Man（鬼怪/怪人）”有关：高尔夫球手把“理想但不容易达成的成绩”比作要追赶的“bogey man”。后来规则更标准化，“par（标准杆）”普及后，“bogey”固定为“高于标准杆一杆”。","拼写提示：bogey/bogie 在“火车转向架”的意思上两者都能见到，但英式更常用 bogie。高尔夫与雷达目标的意思通常写 bogey。"]}
{"word":"bogey","summary":{"en":"Bogey most commonly means a golf score one over par; it can also mean an unidentified aircraft/target on radar, or an imaginary frightening threat (from “bogeyman”).","zh":"bogey 最常见指高尔夫的“柏忌”（比标准杆多一杆）；也可指雷达上的不明目标（尤指不明飞机），或指想象中的吓人威胁（源自 bogeyman）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(golf) A score of one stroke over par on a hole or round.","zh":"（高尔夫）柏忌：某一洞或整轮成绩比标准杆多一杆。"},"examples":[{"en":"I made a bogey on the 12th hole but still finished the round well.","zh":"我在第12洞打出柏忌，但整轮收官还不错。"},{"en":"A bogey isn’t great, but it’s better than a double bogey.","zh":"柏忌不算理想，但比双柏忌要好。"}]},{"partOfSpeech":"n.","definition":{"en":"An unidentified object on radar, especially an unknown aircraft (often used in aviation/military).","zh":"（航空/军事）雷达上的不明目标，尤指不明飞机。"},"examples":[{"en":"The controller reported a bogey approaching from the north.","zh":"管制员报告北方有不明目标接近。"},{"en":"They scrambled jets to investigate the bogey.","zh":"他们紧急出动战机去识别那个不明目标。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) A frightening or imaginary threat; something that causes fear (short for “bogeyman”).","zh":"（非正式）吓人的（想象出来的）威胁；令人恐惧的东西（源自 bogeyman）。"},"examples":[{"en":"As a kid, the bogey under the bed felt real.","zh":"小时候，我觉得床底下的“怪物”真的存在。"},{"en":"For some people, public speaking is the bogey they can’t shake.","zh":"对一些人来说，公开演讲是他们摆脱不了的“心魔”。"}]}],"synonyms":["bogie","one-over-par","unknown target","unidentified aircraft","bogeyman"],"phonetic":"/ˈboʊɡi/","extraExplanation":["在英式英语里，你也会见到拼写 bogie：在“高尔夫（柏忌）”的意思上，bogey/bogie 都常见；但在“铁路转向架/轮架（bogie）”这个意思上，通常只用 bogie，不用 bogey。","“bogey（不明目标）”常用于无线电/军用简报语境；更口语的说法有 unknown aircraft / unidentified target。"]}
{"word":"bogeyed","summary":{"en":"“Bogeyed” most often means scoring one stroke over par on a golf hole.","zh":"“bogeyed”最常见指高尔夫某一洞比标准杆多一杆（打出柏忌）。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(golf) Scored a bogey on a hole (finished one stroke over par).","zh":"（高尔夫）在某一洞打出“柏忌”（比标准杆多一杆）。"},"examples":[{"en":"I bogeyed the 7th hole after my chip rolled off the green.","zh":"我在第7洞切球滚出了果岭，所以打了个柏忌。"},{"en":"She bogeyed the last hole but still won the match.","zh":"她最后一洞打了柏忌，但还是赢了比赛。"}]},{"partOfSpeech":"vt.","definition":{"en":"(less common) Caused something to be delayed, slowed down, or made harder to move forward.","zh":"（不常用）使某事被拖慢、受阻，或更难推进。"},"examples":[{"en":"A missing signature bogeyed the approval process for weeks.","zh":"缺少一个签名让审批流程拖了好几周。"},{"en":"Bad weather bogeyed our travel plans.","zh":"恶劣天气让我们的出行计划受阻。"}]}],"synonyms":["made a bogey","scored +1 (in golf)","held up (rare sense)","delayed (rare sense)"],"phonetic":"/ˈboʊɡid/","extraExplanation":["“bogey（柏忌）”是高尔夫计分术语，表示某洞成绩比标准杆（par）多1杆。它的来源常被认为与早期英国流行的“Bogey Man（妖怪/幽灵）”形象及“Bogey score（假想对手的成绩）”有关，后来逐渐固定为“+1”的含义。","在现代高尔夫语境里，最常见的用法是“to bogey a hole（某洞打柏忌）”。如果你看到“double-bogey/ triple-bogey”，分别表示比标准杆多2杆/3杆。"]}
{"word":"bogeying","summary":{"en":"“Bogeying” most commonly means scoring a bogey in golf (one over par).","zh":"“bogeying”最常见指高尔夫打出柏忌（比标准杆多 1 杆）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Golf) making a bogey on a hole; scoring one stroke over par.","zh":"（高尔夫）在某一洞打出“柏忌”；成绩比标准杆多 1 杆。"},"examples":[{"en":"I kept bogeying the par-4 holes today.","zh":"我今天在那些四杆洞一直打柏忌。"},{"en":"She was bogeying early, but her putting improved on the back nine.","zh":"她前半场一直在打柏忌，但后九洞推杆状态变好了。"}]},{"partOfSpeech":"v.","definition":{"en":"(Less common) treating something as a “bogey” (a feared or worrying thing) or focusing on it as a problem.","zh":"（较少见）把某事当作“可怕/令人担忧的东西（bogey）”；过度担心或纠结某个问题。"},"examples":[{"en":"They’re bogeying the risk of change instead of looking at the benefits.","zh":"他们只顾担心改变的风险，而不去看好处。"}]}],"synonyms":["making a bogey","shooting a bogey","going one over par"],"phonetic":"/ˈboʊɡiɪŋ/","extraExplanation":["“bogey”在高尔夫里是非常常见的计分词：par=标准杆；bogey=+1；double bogey=+2。你可能还会看到动词用法：to bogey a hole（某洞打出柏忌）。","拼写上常见两种：bogey 与 bogie。高尔夫计分里通常用 bogey；而 bogie 在英式英语里更常见于“火车转向架/小轮架”等含义。"]}
{"word":"bogeyland","summary":{"en":"Bogeyland means an imaginary scary place linked to the bogeyman, or (figuratively) a world of irrational fear.","zh":"bogeyland 指“妖怪/鬼怪的虚构世界”，也可比喻“非理性恐惧的状态/想象出来的可怕世界”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an imaginary place where the bogeyman (a scary made-up creature) lives; used to talk about children’s fears","zh":"（虚构的）“妖怪/鬼怪住的地方”；用来指代孩子想象中的恐怖之地"},"examples":[{"en":"When I was little, I thought the dark hallway led to bogeyland.","zh":"我小时候以为那条黑走廊通向“鬼怪世界”。"},{"en":"The bedtime story turned the closet into bogeyland.","zh":"那则睡前故事把衣柜变成了“妖怪出没的地方”。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) a state or world of irrational fear; a way to describe worries that are exaggerated or not real","zh":"（比喻）非理性的恐惧状态；指被夸大或不真实的担忧"},"examples":[{"en":"Stop living in bogeyland—one mistake won’t ruin your career.","zh":"别活在“恐惧想象里”——一次失误不会毁掉你的职业生涯。"},{"en":"Some rumors pull people into bogeyland instead of helping them face facts.","zh":"有些谣言会把人拉进“恐惧世界”，而不是帮助人面对事实。"}]}],"synonyms":["boogeyland","imaginary scary place","nightmare world","world of fear"],"phonetic":"/ˈboʊɡiˌlænd/","extraExplanation":["“bogeyland”不是特别常见的标准词，更像口语/写作中的创造性用法，由 bogey（也写作 boogey，常见于 bogeyman/boogeyman，意为用来吓孩子的“妖怪”）+ land（地方/国度）组成。","英美文化里，bogeyman/boogeyman 通常不是具体某一种怪物，而是“用来代表未知恐惧的存在”。所以 bogeyland 既可以指孩子想象的“怪物世界”，也常被借来比喻“自己吓自己”的心理状态。"]}
{"word":"bogeyman","summary":{"en":"A bogeyman is a made-up frightening figure used to scare children, or something/someone that people treat as a feared scapegoat.","zh":"bogeyman 指用来吓唬小孩的虚构恐怖人物，也可指被妖魔化、被当作替罪羊的对象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An imaginary scary figure (often used in stories) that adults say will punish or take children if they misbehave; a symbol of childhood fear.","zh":"（常见于故事中的）“怪叔叔/妖怪/恶魔”等吓唬小孩的虚构人物；也可指童年恐惧的象征。"},"examples":[{"en":"When I was little, I thought the bogeyman lived in the closet.","zh":"我小时候以为衣柜里住着“妖怪”。"},{"en":"Parents sometimes use the bogeyman to scare kids into behaving.","zh":"有些家长会用“妖怪”来吓唬孩子乖乖听话。"}]},{"partOfSpeech":"n.","definition":{"en":"A person, group, or idea that is unfairly blamed or feared, especially in politics or the media.","zh":"（尤指在政治或媒体语境中）被当作“替罪羊/假想敌”的人、群体或观念。"},"examples":[{"en":"Immigrants are sometimes made into a political bogeyman.","zh":"移民有时会被塑造成政治上的“假想敌”。"},{"en":"The article warns against turning new technology into a bogeyman.","zh":"这篇文章警告不要把新技术妖魔化。"}]}],"synonyms":["boogeyman","monster","scarecrow (figurative)","scapegoat (figurative)"],"phonetic":"/ˈboʊɡiˌmæn/","extraExplanation":["“bogeyman”在英美文化里常出现在儿童故事、恐怖片和万圣节相关叙事中，类似中文里用来吓小孩的“鬼/妖怪/怪叔叔”等概念。","拼写上也常见变体“boogeyman”。当它用来指政治或社会议题时，多带有“被夸大、被妖魔化”的批评意味。"]}
{"word":"bogeymen","summary":{"en":"“Bogeymen” are imaginary monsters used to scare children, or figuratively, things or groups people fear too much.","zh":"“Bogeymen”指用来吓唬小孩的虚构怪物；也可比喻人们过度恐惧的对象或问题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of “bogeyman”) an imaginary frightening creature or monster that adults mention to scare children into behaving.","zh":"（bogeyman 的复数）“妖怪/怪物”一类的虚构恐怖角色，大人常用来吓唬小孩让其听话。"},"examples":[{"en":"When I was little, I believed bogeymen lived under my bed.","zh":"我小时候相信床底下住着妖怪。"},{"en":"Some parents use bogeymen stories to stop kids from wandering off at night.","zh":"有些父母会用“妖怪故事”来阻止孩子晚上乱跑。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) a person, group, or problem that people fear a lot, sometimes more than is reasonable.","zh":"（比喻）被人们过度害怕或当作“头号威胁”的人、群体或问题。"},"examples":[{"en":"In that debate, immigrants were treated as the country’s bogeymen.","zh":"在那场辩论中，移民被当成国家的“替罪羊/头号威胁”。"},{"en":"For many investors, inflation became the new bogeyman.","zh":"对许多投资者来说，通货膨胀成了新的“心头大患”。"}]}],"synonyms":["boogeymen","monsters","imaginary creatures","scarecrows (figurative)","bête noire (figurative)"],"phonetic":"ˈboʊɡiˌmɛn","extraExplanation":["“bogeymen”是“bogeyman”的复数。美式英语里也常见拼写“boogeyman / boogeymen”，读音相近，含义基本相同。","这个词常出现在儿童故事与民间传说中，用来代表“未知的恐惧”。在现代语境里，它也常被用来批评把某个群体或议题妖魔化（demonize）的说法。"]}
{"word":"bogeys","summary":{"en":"“Bogeys” usually means either golf scores one over par, or unidentified (often suspicious) aircraft/targets in military contexts.","zh":"“Bogeys”通常指两类含义：高尔夫里“比标准杆多一杆（柏忌）”，或军事语境中“不明（常疑似敌方）目标/飞行物”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of “bogey”: in golf, a score of one stroke over par on a hole","zh":"“bogey”的复数：高尔夫中指某一洞的成绩比标准杆（par）多一杆（柏忌）"},"examples":[{"en":"She made two bogeys on the back nine but still won the match.","zh":"她在后九洞打了两个柏忌，但还是赢了比赛。"},{"en":"A bogey isn’t great, but it’s not a disaster either.","zh":"柏忌不算理想，但也不至于很糟。"}]},{"partOfSpeech":"n.","definition":{"en":"(military/aviation) unidentified aircraft or targets, especially suspected enemy ones","zh":"（军事/航空）不明飞行物或目标，尤指疑似敌方目标"},"examples":[{"en":"The radar operator reported two bogeys approaching from the east.","zh":"雷达操作员报告有两个不明目标从东方接近。"},{"en":"Pilots are trained to track bogeys before confirming what they are.","zh":"飞行员会先跟踪不明目标，再确认其具体身份。"}]}],"synonyms":["bogies","one-over-par (golf)","unidentified target","unidentified aircraft"],"phonetic":"/ˈboʊɡiz/","extraExplanation":["“bogey/bogeys”在不同语境含义差别很大：日常最常见的是高尔夫术语；在军事无线电通话里，“bogey”常指“身份未明、可能有威胁的空中目标”。","拼写小提醒：与“booger(s)（鼻屎）”不是同一个词；也不要和“bogeyman（用来吓小孩的怪物/坏人）”混淆。"]}
{"word":"bogfern","summary":{"en":"Bogfern is a fern that grows in wet boggy habitats.","zh":"Bogfern 指生长在潮湿泥炭沼泽等环境中的蕨类植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fern that grows in wet, acidic places such as bogs and marshes","zh":"生长在泥炭沼泽、湿地等潮湿酸性环境中的蕨类植物（常译作“沼泽蕨/泥炭沼泽蕨”）"},"examples":[{"en":"We found bogfern along the edge of the peat bog.","zh":"我们在泥炭沼泽的边缘发现了沼泽蕨。"},{"en":"Bogfern prefers damp ground and filtered sunlight.","zh":"沼泽蕨喜欢潮湿的土壤和散射光。"}]}],"synonyms":["bog fern","marsh fern"],"phonetic":"/ˈbɑɡˌfɝn/","extraExplanation":["“bogfern”常写作 bog fern（两词）或 bog-fern（连字符），属于常见的描述性植物名称：bog（泥炭沼泽/湿地）+ fern（蕨类）。在不同地区，它可能指不同的“长在沼泽里的蕨”，并不总是对应同一个固定物种；若需要精确识别，通常要结合拉丁学名或当地植物志。"]}
{"word":"boggard","summary":{"en":"Boggart (often misspelled “boggard”) means a goblin-like spirit in folklore, and in Harry Potter it’s a creature that becomes whatever you fear most.","zh":"Boggart（常被误写为“boggard”）在民间传说中指一种鬼怪/小妖精；在《哈利·波特》中指会变成你最害怕事物的生物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Folklore) a goblin-like spirit used to frighten children; a mischievous household spirit.","zh":"（民间传说）一种类似小妖精/鬼怪的精灵，常被用来吓唬小孩；也可指爱恶作剧的家宅精灵。"},"examples":[{"en":"As a child, he was told a boggart lived in the attic.","zh":"他小时候被告诉阁楼里住着一只“boggart”（鬼怪）。"},{"en":"The story warns children not to wander at night, or a boggart might catch them.","zh":"这个故事警告孩子晚上别乱跑，否则会被“boggart”抓走。"}]},{"partOfSpeech":"n.","definition":{"en":"(Modern popular culture, especially Harry Potter) a magical creature that changes shape into whatever you fear most.","zh":"（现代流行文化，尤指《哈利·波特》）一种会变成你最害怕事物形态的魔法生物。"},"examples":[{"en":"In Harry Potter, a boggart turns into your worst fear.","zh":"在《哈利·波特》中，boggart 会变成你最害怕的东西。"},{"en":"They practiced the spell to face a boggart together.","zh":"他们一起练习咒语来对付 boggart。"}]}],"synonyms":["goblin","spirit","bogeyman","poltergeist (similar idea)"],"phonetic":"/ˈbɑːɡərt/","extraExplanation":["你输入的“boggard”更常见的拼写是 **boggart**（两个 t）。如果你其实想查的是 **Bogart**（人名/动词“霸占、独占”）或其他词，也可以告诉我语境，我可以帮你确认。","“boggart”来自英国（尤其英格兰北部与苏格兰一带）的民间传说传统；J.K. 罗琳在《哈利·波特》中借用了这个词，并赋予了“会变成恐惧”的设定。"]}
{"word":"boggart","summary":{"en":"A boggart is a troublesome spirit in British folklore, or (in Harry Potter) a creature that becomes your worst fear.","zh":"boggart 指英国民间传说中的捣蛋妖怪；在《哈利·波特》中则指会变成你最恐惧之物的生物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(British folklore) a mischievous spirit or household goblin that frightens people or causes trouble, often by hiding things or making noises.","zh":"（英国民间传说）一种捣蛋的精灵/家宅妖怪，会吓人或制造麻烦，比如藏东西、发怪声等。"},"examples":[{"en":"In the old story, a boggart lived in the house and made footsteps at night.","zh":"在那个老故事里，一只 boggart 住在房子里，晚上会发出脚步声。"},{"en":"People said the missing keys were the work of a boggart.","zh":"人们说钥匙不见是 boggart 搞的鬼。"}]},{"partOfSpeech":"n.","definition":{"en":"(Popular culture, especially Harry Potter) a magical creature that changes shape into whatever you fear most.","zh":"（流行文化，尤指《哈利·波特》）一种会变成你最害怕事物的魔法生物。"},"examples":[{"en":"In Harry Potter, the boggart turns into a giant spider for Ron.","zh":"在《哈利·波特》中，boggart 会对罗恩变成一只巨大的蜘蛛。"},{"en":"The class learned a spell to face a boggart without panicking.","zh":"那堂课学习了一个咒语，让大家面对 boggart 时不至于慌乱。"}]}],"synonyms":["goblin","spirit","hobgoblin","poltergeist"],"phonetic":"/ˈbɑɡərt/","extraExplanation":["“boggart”源自英国北部（如约克郡、兰开夏一带）的方言与民间传说，常被描写为爱恶作剧、会吓人的小妖精；不同地区对它的外形与行为说法不一。","在现代语境里，很多英语使用者主要通过《哈利·波特》认识这个词，因此在日常交流中提到 boggart 往往会让人联想到“会变成你最害怕的东西”的设定。"]}
{"word":"bogged","summary":{"en":"Bogged means stuck (especially in mud) or, more commonly, slowed/trapped by too many details or tasks (bogged down).","zh":"bogged指（尤指在泥里）陷住；更常见的是指被琐事或问题拖住而难以推进（bogged down）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Stuck in soft, wet ground (mud), so you cannot move easily.","zh":"陷在松软潮湿的地面（泥地）里，难以移动。"},"examples":[{"en":"The truck got bogged in the mud after the storm.","zh":"暴风雨过后，那辆卡车陷在泥里动不了了。"},{"en":"We were bogged near the river and had to push the car out.","zh":"我们在河边附近陷住了，只好把车推出来。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Often in “bogged down”) Slowed or trapped by too many details, problems, or tasks; unable to make progress.","zh":"（常用于“bogged down”）被细节、问题或任务拖住，进展受阻。"},"examples":[{"en":"I’m bogged down with emails and paperwork today.","zh":"我今天被邮件和文书工作拖住了。"},{"en":"The project got bogged down in small arguments.","zh":"这个项目被一些小争执拖慢了进度。"},{"en":"Don’t get bogged down by minor mistakes—keep going.","zh":"别被小错误困住——继续往前。"}]}],"synonyms":["stuck","mired","trapped","hindered","weighed down","slowed"],"phonetic":"/bɑɡd/","extraExplanation":["“bog”原意是“沼泽地”。动词bog表示“陷入沼泽/泥地；使陷住”。日常更常见的搭配是“bogged down”，既可指字面上的陷住，也常用作比喻：被琐事、流程或麻烦拖累而难以前进。","用法提示：美式英语里常说“get bogged down in/with + 名词”（被……拖住）；也可说“be bogged down”（处于被拖住的状态）。"]}
{"word":"Boggers","summary":{"en":"“Boggers!” is a British informal exclamation meaning “damn/oh no.” It can also be a rare plural noun, but it’s often a misspelling of “bloggers.”","zh":"“Boggers!”是英式非正式感叹语，表示“糟了/该死/真倒霉”。作复数名词较少见，也常是把“bloggers（博主）”误拼成“boggers”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(British, informal) An exclamation used to show annoyance, disappointment, or mild surprise; similar to “damn!” or “oh no!”","zh":"（英式，非正式）表示恼火、失望或轻微惊讶的感叹语；类似“糟了！/该死！”"},"examples":[{"en":"Boggers! I left my phone at home.","zh":"糟了！我把手机落在家里了。"},{"en":"Boggers—our train is delayed again.","zh":"真倒霉——我们的火车又晚点了。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural form of “bogger” (rare). In practice, most learners who write “boggers” may be aiming for “bloggers” (people who write blogs).","zh":"“bogger”的复数（较少见）。实际中，很多学习者写“boggers”可能是想写“bloggers”（写博客的人）。"},"examples":[{"en":"Some people mistakenly write “boggers” when they mean “bloggers.”","zh":"有些人想表达“博主”时会误写成“boggers”。"},{"en":"The conference invited travel bloggers from many countries.","zh":"会议邀请了来自许多国家的旅行博主。"}]}],"synonyms":["damn","oh no","shoot","darn"],"phonetic":"/ˈbɑɡərz/","extraExplanation":["“Boggers!”主要是英式口语里的轻度粗口/感叹词，语气比更强烈的脏话温和，但仍偏随意，不适合正式写作或非常正式的场合。","它常见于英国日常对话、影视剧对白中，用来表达“真烦/真倒霉/怎么又这样”。","如果你本来想说“博主”，正确拼写是“bloggers”（发音也不同：bloggers 里有 /l/ 音）。"]}
{"word":"boggier","summary":{"en":"Boggier means “more boggy”: wetter, muddier, and softer ground.","zh":"boggier 意为“更泥泞/更像沼泽的”：地面更湿、更软、更难走。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative form of **boggy**: more wet, muddy, and soft (like a bog or marsh), often making the ground hard to walk or drive on.","zh":"**boggy** 的比较级：更潮湿、更泥泞、更松软（像沼泽地一样），常使地面难以行走或行车。"},"examples":[{"en":"After the heavy rain, the trail became even **boggier** than yesterday.","zh":"大雨过后，这条小路变得比昨天**更泥泞**了。"},{"en":"The field gets **boggier** near the river, so wear boots.","zh":"靠近河边的田地会**更湿软泥泞**，所以要穿靴子。"},{"en":"We chose a different route because the ground ahead looked **boggier**.","zh":"我们换了条路，因为前方的地面看起来**更湿更软**。"}]}],"synonyms":["muddier","wetter","marshier","soggier"],"phonetic":"ˈbɑɡiɚ","extraExplanation":["“boggier”是形容词“boggy（泥泞的、像沼泽的）”的比较级，常见结构：boggy → boggier → boggiest。拼写规则是以辅音字母 + y 结尾时，把 y 变成 i 再加 -er。"]}
{"word":"boggiest","summary":{"en":"“Boggiest” means “the most boggy”—the wettest, softest, most swamp-like; figuratively, the most muddled or hard to get through.","zh":"“boggiest”意为“最泥泞/最像沼泽的”；也可比喻“最混乱、最难理清或最难推进的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative of “boggy”: the most wet, soft, and swamp-like (easy to sink into).","zh":"“boggy”的最高级：最潮湿、最松软、像沼泽一样的（容易陷进去）。"},"examples":[{"en":"After the heavy rain, the boggiest part of the trail became unsafe to walk on.","zh":"大雨过后，小路上最泥泞、最像沼泽的那段变得不安全，没法走。"},{"en":"Wear boots if you’re going through the boggiest fields.","zh":"如果要穿过最湿软泥泞的田地，最好穿靴子。"}]},{"partOfSpeech":"adj.","definition":{"en":"Figurative: the most confused, slow, or difficult to deal with (like being “stuck in mud”).","zh":"比喻：最混乱、最拖沓或最难处理的（像“陷在泥里”一样）。"},"examples":[{"en":"The boggiest part of the discussion was the argument about definitions.","zh":"讨论里最纠缠不清的一部分是关于定义的争论。"},{"en":"This chapter is the boggiest, so read it slowly and take notes.","zh":"这一章最晦涩难啃，所以慢慢读并做笔记。"}]}],"synonyms":["muddiest","swampiest","wettest","soggiest","mirest"],"phonetic":"/ˈbɑɡiəst/","extraExplanation":["“boggiest”来自形容词“boggy”（多沼泽的、泥泞的），词根“bog”指“沼泽/泥塘”。拼写规则：boggy → boggier → boggiest（y 变 i + -er/-est）。","字面义常用于地理/徒步语境；比喻义在口语里也能见到，表示思路或过程“陷住了、推进困难”。"]}
{"word":"boggin","summary":{"en":"“Boggin” is informal slang meaning “disgusting/awful,” and in Australia/New Zealand it can also mean a beanie (knitted hat).","zh":"“boggin”是很口语的俚语，常表示“恶心/很糟”；在澳大利亚和新西兰也可指“毛线帽（beanie）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal, chiefly UK/Australia/New Zealand) Disgusting, unpleasant, or really bad.","zh":"（非正式，主要用于英式/澳新）恶心的；令人不快的；很糟的。"},"examples":[{"en":"Ugh, this milk smells boggin.","zh":"呃，这牛奶闻起来真恶心。"},{"en":"The toilet was boggin after the party.","zh":"派对后厕所脏得令人作呕。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, Australia/New Zealand) A beanie; a knitted winter hat.","zh":"（非正式，澳大利亚/新西兰）毛线帽；针织冷帽（beanie）。"},"examples":[{"en":"It’s freezing—grab your boggin before we go out.","zh":"冷死了——出门前把你的毛线帽戴上。"},{"en":"He pulled his boggin down over his ears.","zh":"他把毛线帽往下拉，盖住耳朵。"}]}],"synonyms":["disgusting","gross","nasty","awful","beanie","knitted hat"],"phonetic":"/ˈbɑɡɪn/","extraExplanation":["“boggin”很口语、很地域化：表示“恶心/很糟”时，在英式口语和澳新更常见；在美式英语里不常用，可能会让人听不懂。","表示“毛线帽”时也偏澳新口语；在美国通常说 beanie，在英国也常说 beanie 或 woolly hat。"]}
{"word":"bogginess","summary":{"en":"Bogginess means the wet, muddy, soft condition of ground—like a bog.","zh":"Bogginess 指地面像沼泽一样湿、软、泥泞的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or condition of being boggy (wet, muddy, and soft, like a bog); sogginess in the ground","zh":"（地面）像沼泽一样的湿软、泥泞状态；松软潮湿的程度"},"examples":[{"en":"After days of rain, the field’s bogginess made it hard to walk across.","zh":"连下了好几天雨，田地变得很泥泞，走过去很困难。"},{"en":"The trail’s bogginess increased near the river, so we stepped carefully.","zh":"靠近河边时小路更湿软，我们就小心落脚。"}]}],"synonyms":["muddiness","sogginess","marshiness","swampiness","wetness"],"phonetic":"/ˈbɑːɡinəs/","extraExplanation":["“bogginess”来自形容词“boggy”（像沼泽的、湿软的），常用于描写土地、草地、道路等“踩上去会陷下去”的感觉。","在写作中也可带一点比喻意味，形容想法或叙述“拖泥带水、缺乏清晰度”，但这种抽象用法不如字面意思常见。"]}
{"word":"bogging","summary":{"en":"“Bogging” means getting stuck in mud, or (often “bogging down”) getting slowed or stuck by difficulties or too much detail.","zh":"“bogging”指陷进泥里；也常指（尤其“bogging down”）因困难或细节过多而进展变慢、陷入停滞。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “bog”) getting stuck or sinking into soft, wet ground (like mud or a swamp).","zh":"（“bog”的现在分词）陷进或卡在潮湿松软的地面里（如泥地、沼泽）。"},"examples":[{"en":"The truck is bogging in the mud after the rain.","zh":"雨后卡车陷进泥里了。"},{"en":"We had to push because the wheels kept bogging.","zh":"我们不得不推车，因为轮子一直陷住。"}]},{"partOfSpeech":"v.","definition":{"en":"(often with “down”) becoming slower, less effective, or stuck because something is too complicated, has too many details, or faces obstacles.","zh":"（常与“down”连用）因太复杂、细节过多或遇到阻碍而变慢、效率下降，甚至停滞不前。"},"examples":[{"en":"The meeting is bogging down in small details.","zh":"会议被一些小细节拖慢了。"},{"en":"Don’t get bogged down—focus on the main idea first.","zh":"别被细节困住——先抓住重点。"}]}],"synonyms":["getting stuck","miring","sticking","slowing down","getting bogged down"],"phonetic":"/ˈbɑɡɪŋ/","extraExplanation":["“bog”本意是“沼泽/泥沼”，所以动词用法很形象：东西被泥吸住、越挣扎越难动。","口语和写作里更常见的是固定搭配“bog down / get bogged down”，多用于工作、讨论、项目进度等语境，表示“被拖住、陷入僵局”。"]}
{"word":"boggish","summary":{"en":"Boggish describes something bog-like—wet, marshy, and muddy; occasionally it can describe a heavy, gloomy feeling.","zh":"Boggish 形容像沼泽一样潮湿泥泞；偶尔也可引申为让人感到沉闷压抑。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Like a bog; wet, soft, and marshy.","zh":"（罕用）像沼泽的；潮湿松软、泥泞的。"},"examples":[{"en":"After days of rain, the field became boggish and hard to walk across.","zh":"连下了几天雨后，田地变得像沼泽一样泥泞，很难走过去。"},{"en":"They avoided the boggish ground near the river.","zh":"他们避开了河边那片湿软泥泞的地面。"}]},{"partOfSpeech":"adj.","definition":{"en":"(By extension) Dull, heavy, or depressing in mood—like being ‘stuck’ in a bog. (Less common)","zh":"（引申，较少见）沉闷的、压抑的；让人感觉像陷在泥沼里。"},"examples":[{"en":"The long meeting left everyone in a boggish mood.","zh":"那场冗长的会议让大家情绪都很沉闷。"}]}],"synonyms":["boggy","marshy","swampy","muddy","sodden"],"phonetic":"/ˈbɑɡɪʃ/","extraExplanation":["“boggish”由 bog（沼泽、泥塘）+ -ish（“有点……的、像……的”）构成，意思接近 boggy（泥泞的），但在现代英语里更少见，更偏文学或描写性用法。"]}
{"word":"boggishness","summary":{"en":"Boggishness means the state of being boggy and marshy; more rarely, it can describe a heavy, murky, stuck feeling.","zh":"boggishness 指“像沼泽一样泥泞湿软的状态”；较少见时也可比喻“沉滞、昏沉、陷住般的感觉”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being boggy—wet, soft, and marsh-like ground.","zh":"（土地的）沼泽化、泥泞松软的状态；像沼泽一样湿软。"},"examples":[{"en":"After days of rain, the field turned into pure boggishness under our boots.","zh":"连下几天雨后，田地在我们靴子下变得一片泥泞沼泽状。"},{"en":"The trail’s boggishness made hiking slow and exhausting.","zh":"小路的泥沼化让徒步变得缓慢又费力。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, rare) A feeling of heaviness, murkiness, or mental “stuckness,” as if moving through a bog.","zh":"（比喻，少见）沉重、昏沉或思维“陷住”的感觉；像陷在沼泽里一样难以前进。"},"examples":[{"en":"In the long winter, a kind of boggishness settled over his mood.","zh":"漫长的冬天里，一种昏沉沉的感觉笼罩着他的情绪。"},{"en":"The meeting dragged on in bureaucratic boggishness.","zh":"会议在官僚式的拖沓沉滞中一再延长。"}]}],"synonyms":["bogginess","marshiness","muddiness","sogginess","murkiness"],"phonetic":"/ˈbɑɡɪʃnəs/","extraExplanation":["这是一个较少见的名词，由 bog（沼泽）+ -ish（带有……特征的）+ -ness（……的状态/性质）构成。更常见的表达通常用 bogginess 或 boggy ground。"]}
{"word":"boggle","summary":{"en":"“Boggle” usually means to confuse or overwhelm someone, or to be surprised and hesitate; it’s also the name of a popular word game.","zh":"“boggle”常指使人困惑到反应不过来，或因惊讶而犹豫退缩；也指一种流行的找单词文字游戏。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to confuse or overwhelm someone so they cannot think clearly or understand something","zh":"使困惑；使不知所措（以至于无法清楚思考或理解）"},"examples":[{"en":"The huge amount of data boggled my mind.","zh":"海量的数据让我脑子都转不过来了。"},{"en":"She was boggled by the complicated instructions.","zh":"她被复杂的说明弄糊涂了。"}]},{"partOfSpeech":"vi.","definition":{"en":"to be confused or stuck, especially when trying to understand or deal with something","zh":"困惑；卡住（尤指在理解或处理事情时）"},"examples":[{"en":"I always boggle at these math problems.","zh":"我总会在这些数学题上卡住。"},{"en":"He boggled for a moment, then answered.","zh":"他愣了一下，然后回答了。"}]},{"partOfSpeech":"vi.","definition":{"en":"to hesitate or stop because something seems surprising, shocking, or hard to accept","zh":"犹豫；（因惊讶、震惊或难以接受而）退缩"},"examples":[{"en":"Investors boggled at the price tag.","zh":"投资者看到这个标价都犹豫了。"},{"en":"They didn’t boggle at the challenge—they got to work.","zh":"他们没有被挑战吓住，而是马上开干。"}]},{"partOfSpeech":"n.","definition":{"en":"Boggle (brand name): a word game where you find as many words as possible in a grid of letters within a time limit","zh":"Boggle（游戏名）：一种限时在字母方格里尽可能找出更多单词的文字游戏"},"examples":[{"en":"We played Boggle after dinner.","zh":"我们晚饭后玩了 Boggle。"},{"en":"I’m bad at Boggle, but it’s fun.","zh":"我不太擅长玩 Boggle，但很好玩。"}]}],"synonyms":["bewilder","confuse","stun","overwhelm","flabbergast","baffled"],"phonetic":"/ˈbɑɡəl/","extraExplanation":["“boggle”常见搭配是“boggle the mind”（令人难以置信/让人脑子转不过来），语气比“confuse”更强，带有“多到离谱、震撼到反应不过来”的感觉。","作为动词时，它在英式英语里更常见；美式英语里也会用，但更常见的同类表达还有“blow my mind”“stun”“overwhelm”。","词源上与“bog”（惊吓、幽灵般的东西）相关的旧词有关，因此历史上带有“吓得退缩/不敢相信”的意味。"]}
{"word":"bogglebo","summary":{"en":"“Boggle” means to be (or make someone) shocked/confused because something is hard to believe or understand, often in “boggle at” or “It boggles the mind.”","zh":"“boggle”表示因难以置信或难以理解而震惊、困惑；常见于“boggle at …”和“It boggles the mind.”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Usually used in the phrase “boggle at”) to be shocked or confused because something is hard to believe or understand.","zh":"（常用于短语“boggle at”）因某事难以置信或难以理解而感到震惊、困惑。"},"examples":[{"en":"I boggle at how quickly she learned English.","zh":"她学英语学得那么快，真让人难以置信。"},{"en":"We all boggled at the price of the tiny apartment.","zh":"那间小公寓的价格让我们都惊呆了。"}]},{"partOfSpeech":"vt.","definition":{"en":"To make someone feel shocked or confused; to overwhelm someone’s understanding.","zh":"使（某人）震惊或困惑；让人难以理解、难以接受。"},"examples":[{"en":"The scale of the project boggles the mind.","zh":"这个项目的规模令人难以想象。"},{"en":"The numbers in the report boggled me.","zh":"报告里的数字把我看懵了。"}]}],"synonyms":["astonish","amaze","bewilder","stun"],"phonetic":"/ˈbɑɡəl/","extraExplanation":["“bogglebo”不是常见英语单词，可能是拼写错误。你也许想查的是 **boggle**（动词）或 **Boggle**（桌游名）。","常见搭配：**boggle at + 名词/从句**（对……感到难以置信）；固定表达：**It boggles the mind.**（令人难以想象/匪夷所思）。","词源提示：boggle 与“犹豫、退缩、困惑”这一类含义有关，语气通常偏“惊讶到理解不了”。"]}
{"word":"boggled","summary":{"en":"“Boggled” describes being extremely surprised or confused, or something that overwhelms your ability to understand.","zh":"“boggled”表示（因惊讶或困惑而）发懵、难以理解；也可指某事让人“想不通、难以置信”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"to be so surprised or confused that you cannot think clearly; to overwhelm someone’s ability to understand","zh":"（因惊讶或困惑而）目瞪口呆；使（某人）难以理解、难以置信"},"examples":[{"en":"I was boggled by how quickly the prices went up.","zh":"物价上涨得那么快，让我很震惊、难以理解。"},{"en":"The amount of information in the report boggled my mind.","zh":"报告里的信息量大得让我脑子都转不过来。"},{"en":"She looked boggled when she heard the news.","zh":"她听到这个消息时看起来一脸懵。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “boggle”: to surprise or confuse someone greatly","zh":"“boggle”的过去式/过去分词：使（某人）大为惊讶或困惑"},"examples":[{"en":"The final question boggled the whole class.","zh":"最后一道题把全班都难住了。"},{"en":"His confidence boggled me—I would be nervous in his position.","zh":"他的自信让我很吃惊——换作我肯定会紧张。"}]}],"synonyms":["confused","bewildered","astonished","stunned","flabbergasted"],"phonetic":"/ˈbɑɡəld/","extraExplanation":["“boggled”常见于口语和写作里，尤其是固定搭配“boggle the mind”（令人难以置信/难以想象）。","语气上，“boggled”比“surprised”更强调“惊讶到理解跟不上”，接近“震惊到发懵”。","常见表达：I’m boggled. / I’m totally boggled. / It boggles my mind that…（我实在想不通……）。"]}
{"word":"boggler","summary":{"en":"A (rare) word meaning someone who hesitates or doubts in the face of something difficult or unbelievable.","zh":"一个（较少见的）词，指面对困难或难以置信的事而犹豫、退缩或质疑的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who boggles—someone who hesitates, is shocked, or doubts because something seems too difficult, strange, or unbelievable.","zh":"“犹豫/退缩的人；惊愕的人；质疑的人”：因事情太难、太怪或难以置信而踌躇、吃惊或不敢继续的人。"},"examples":[{"en":"A few bogglers questioned whether the plan could really work.","zh":"一些质疑者怀疑这个计划是否真的行得通。"},{"en":"Don’t be a boggler—ask questions and then try step by step.","zh":"别一味退缩——先提问，再一步一步尝试。"}]}],"synonyms":["doubter","skeptic","hesitator","balker"],"phonetic":"/ˈbɑɡlər/","extraExplanation":["“boggler”来自动词“boggle”（吃惊、退缩、犹豫）。它在现代英语里很少用，更常见的表达是“someone who balks/hesitates”或直接用动词“boggle”。","注意不要与“bogeyman / boggart（妖怪、吓人的东西）”混淆；那是另一组词源与含义。"]}
{"word":"bogglers","summary":{"en":"“Bogglers” means people who boggle: they are confused, shocked, or hesitate because something seems too difficult or unbelievable.","zh":"“bogglers”指“会boggle的人”：因困惑、震惊，或觉得太难/难以置信而犹豫退缩的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who boggle—people who are confused, shocked, or who hesitate because something seems too difficult or strange","zh":"感到困惑/震惊而退缩的人；因事情太难或太怪而犹豫不前的人"},"examples":[{"en":"Some bogglers still can’t believe how fast the city has changed.","zh":"有些人仍然难以相信这座城市变化得这么快。"},{"en":"The plan sounded simple, but it turned the team into bogglers once the details appeared.","zh":"这个计划听起来很简单，但一看到细节，团队就都变得犹豫不决、摸不着头脑。"}]}],"synonyms":["the bewildered","the astonished","hesitators","doubters"],"phonetic":"/ˈbɑɡlərz/","extraExplanation":["“bogglers”是名词复数形式，单数是“boggler”。它来自动词“boggle”（因惊讶、困惑或觉得太难而退缩/犹豫）。在现代英语中，“boggler”并不是非常常见，更常见的表达是“people who are shocked/confused”或直接用动词短语“boggle at…”。"]}
{"word":"boggles","summary":{"en":"“Boggles” means something is so surprising or complex that it’s hard to understand, or it can mean to hesitate or recoil.","zh":"“boggles”表示某事太惊人/复杂以至于难以理解，也可表示因震惊或不适而犹豫退缩。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present tense, 3rd person singular of “boggle”) to be unable to understand or imagine something because it seems too surprising, complicated, or unbelievable.","zh":"（boggle 的第三人称单数）因某事过于惊人、复杂或难以置信而“想不通/难以理解”。"},"examples":[{"en":"The price tag boggles my mind.","zh":"这个价格让我难以置信。"},{"en":"It boggles me that he finished the project in one day.","zh":"他一天就完成了这个项目，真让人想不通。"}]},{"partOfSpeech":"vi.","definition":{"en":"to hesitate or draw back because something seems strange, shocking, or unacceptable.","zh":"因觉得奇怪、震惊或难以接受而退缩、犹豫。"},"examples":[{"en":"Some people boggles at the idea of eating insects.","zh":"有些人一想到吃昆虫就会退缩。"},{"en":"She didn’t boggle at the challenge; she accepted it calmly.","zh":"她没有被挑战吓退，而是很平静地接受了。"}]}],"synonyms":["bewilders","astonishes","stuns","confounds","baffles","recoils","hesitates"],"phonetic":"/ˈbɑɡəl/","extraExplanation":["“boggle”常见搭配是 **boggle (someone’s) mind**，表示“让人震惊到难以理解”。日常英语里比第二个义项更常用。","拼写提示：**boggle** 里的 **-le** 结尾发轻音“əl”。“boggles”用于一般现在时第三人称单数（he/she/it boggles）。"]}
{"word":"boggling","summary":{"en":"Bogging (usually “mind-boggling”) means extremely surprising or hard to imagine; it can also be the -ing form of “boggle,” meaning to be or make someone confused.","zh":"boggling（常见于 mind-boggling）指“令人难以想象/震惊的”；也可作 boggle 的 -ing 形式，表示“感到或使人困惑”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Extremely surprising, difficult, or hard to imagine; causing someone to feel confused or amazed.","zh":"（形容词）令人难以置信的；令人震惊或困惑的；让人“脑子转不过来”的。"},"examples":[{"en":"The cost of living in the city is boggling.","zh":"这个城市的生活成本高得令人咋舌。"},{"en":"It’s boggling how quickly the technology has changed.","zh":"科技变化之快令人难以想象。"},{"en":"She gave me a boggling amount of information in one meeting.","zh":"她在一次会议里给了我一大堆信息，多得让人消化不了。"}]},{"partOfSpeech":"v.","definition":{"en":"(v.) Present participle of “boggle”: to be confused or overwhelmed; to make someone feel confused or overwhelmed.","zh":"（动词）“boggle”的现在分词：感到困惑/不知所措；使（某人）困惑或不知所措。"},"examples":[{"en":"The huge numbers are boggling my mind.","zh":"这些巨大的数字让我脑子转不过来。"},{"en":"I’m still boggling at what happened last night.","zh":"我到现在还对昨晚发生的事感到难以理解。"}]}],"synonyms":["mind-boggling","astonishing","stunning","overwhelming","incredible","confusing"],"phonetic":"/ˈbɑɡlɪŋ/","extraExplanation":["“mind-boggling”非常常见，意思是“令人瞠目结舌/难以想象”。单独用“boggling”也可以，但口语和写作里更常见的搭配是“mind-boggling”。","词源上，“boggle”与“惊恐地后退、犹豫、受惊”有关，所以它带有“被吓到或被复杂事物搞懵”的感觉。"]}
{"word":"bogglingly","summary":{"en":"“Bogglingly” means “in an incredibly surprising or hard-to-imagine way.”","zh":"“bogglingly”表示“令人难以置信地、惊人到难以想象地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an extremely surprising or hard-to-believe way; so much that it is difficult to understand or imagine.","zh":"（程度）令人难以置信地；惊人地；大到让人难以理解地。"},"examples":[{"en":"The project was bogglingly expensive for such a small town.","zh":"对这样一个小镇来说，这个项目贵得令人难以置信。"},{"en":"She solved the puzzle in a bogglingly short time.","zh":"她在短得惊人的时间里解出了这道谜题。"},{"en":"There are bogglingly many stars in the universe.","zh":"宇宙中的恒星多得让人难以想象。"}]}],"synonyms":["astonishingly","unbelievably","incredibly","mind-bogglingly","staggeringly"],"phonetic":"/ˈbɑɡlɪŋli/","extraExplanation":["“bogglingly”来自动词短语“boggle the mind”（使人脑子转不过来、使人震惊/困惑），常用于强调数量、价格、速度、规模等“超出理解范围”的程度。","语气上多用于口语或写作中的强调，带一点夸张色彩；在更正式的写作里也常用“astonishingly / unbelievably / mind-bogglingly”来替换。"]}
{"word":"bogglish","summary":{"en":"“Bogglish” is not standard; it’s likely a misspelling of “boggish” (swampy) or related to “boggle” (be confused/shocked).","zh":"“bogglish”不是标准用词；更可能是“boggish”（泥泞/像沼泽的）或与“boggle”（困惑/震惊）有关的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in most dictionaries; often a misspelling or invented form. People may intend “boggish” (swampy, like a bog) or “boggle” (to be confused/shocked).","zh":"在大多数词典中并不是标准英语词；常见于拼写错误或自造词。人们可能想写的是“boggish”（像沼泽一样的、泥泞的）或“boggle”（使困惑/震惊；感到困惑/震惊）。"},"examples":[{"en":"I couldn’t find “bogglish” in a dictionary—did you mean “boggish” (swampy) or “boggle” (be confused)?","zh":"我在词典里查不到“bogglish”——你是不是想写“boggish”（泥泞的）或“boggle”（感到困惑）？"},{"en":"The path was boggish after the rain.","zh":"下雨后这条小路变得像沼泽一样泥泞。"},{"en":"The huge bill made me boggle.","zh":"那笔巨额账单让我目瞪口呆（非常震惊/困惑）。"}]}],"synonyms":["boggish","swampy","miry","boggle","be stunned","be confused"],"phonetic":"ˈbɑɡlɪʃ","extraExplanation":["“bogglish”看起来像把“bog”（沼泽）和形容词后缀“-ish”（有点像……）混在一起的自造词，或者是把“boggish / boggle”拼错了。","如果你能贴出原句（含上下文），我可以帮你判断更可能想表达哪一个词，并给出更贴切的替换。"]}
{"word":"Boggs","summary":{"en":"“Boggs” is most commonly a surname (family name), and less commonly a place name.","zh":"“Boggs”最常见是姓氏（人名），较少见作地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"姓氏（家族姓）。"},"examples":[{"en":"My teacher’s last name is Boggs.","zh":"我老师的姓是 Boggs。"},{"en":"The article was written by Dr. Boggs.","zh":"这篇文章是 Boggs 博士写的。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used in some English-speaking regions (less common).","zh":"地名（在一些英语地区使用，较少见）。"},"examples":[{"en":"They drove past Boggs on the way to the lake.","zh":"他们去湖边的路上开车经过了 Boggs。"}]}],"phonetic":"/bɑɡz/","extraExplanation":["“Boggs”在英语里最常见是姓氏（专有名词）。在日常写作中通常首字母大写：Boggs。","作为姓氏时一般不加冠词（不说 *the Boggs* 指一个人），但可以用复数指“Boggs 一家”：the Boggses。","它也可能出现在文学/影视或新闻中作为人物姓名；理解时把它当作人名即可。"]}
{"word":"Boggstown","summary":{"en":"Boggstown is a community name in Indiana, USA.","zh":"Boggstown 是美国印第安纳州的一个社区地名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A place name: an unincorporated community in Shelby County, Indiana, USA.","zh":"地名：美国印第安纳州谢尔比县（Shelby County）的一个非建制社区（unincorporated community）。"},"examples":[{"en":"Boggstown is a small community in Shelby County, Indiana.","zh":"Boggstown 是印第安纳州谢尔比县的一个小社区。"},{"en":"We drove through Boggstown on the way to Indianapolis.","zh":"我们开车去印第安纳波利斯的路上经过了 Boggstown。"}]}],"phonetic":"/ˈbɑɡz.taʊn/","extraExplanation":["Boggstown 属于“非建制社区”（unincorporated community），通常表示它不是一个独立建制的城市/镇，没有自己的市政府机构，行政与公共服务多由县（county）层级提供。","作为地名，Boggstown 在英语里一般不翻译含义，常直接音译或保留原拼写；在正式写作中通常要加州名或县名帮助读者定位（例如：Boggstown, Indiana）。"]}
{"word":"boggy","summary":{"en":"Boggy means wet and muddy like a bog, or (figuratively) slow and hard to move forward.","zh":"boggy 指“像沼泽一样湿软泥泞的”，也可引申为“进展缓慢、受阻的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Wet, soft, and muddy; like land that has a lot of water in it (a bog).","zh":"湿软泥泞的；像沼泽地那样水很多的。"},"examples":[{"en":"The field was boggy after the heavy rain, so we stayed on the path.","zh":"大雨过后田地很泥泞，所以我们一直走在小路上。"},{"en":"Wear boots—this trail gets boggy near the river.","zh":"穿靴子吧——这条小路靠近河边的地方会很泥泞。"}]},{"partOfSpeech":"adj.","definition":{"en":"Slow, stuck, or difficult to move forward (often about progress or a process).","zh":"（常指进展或过程）缓慢、受阻、难以推进的。"},"examples":[{"en":"The project got boggy because there were too many approvals.","zh":"这个项目因为审批太多而变得推进困难。"},{"en":"The story feels a bit boggy in the middle, but the ending is great.","zh":"这个故事中段有点拖沓，但结尾很精彩。"}]}],"synonyms":["swampy","marshy","muddy","waterlogged","soggy","stuck","sluggish"],"phonetic":"/ˈbɑɡi/","extraExplanation":["“boggy”来自“bog（沼泽）+ -y（形容词后缀）”，字面意思是“像沼泽一样的”。在英式英语里也常说“boggy ground”。引申义上，它把“陷在泥里走不动”的感觉用来形容事情“卡住、拖慢”。","相关词：bog（n./v. 沼泽；使陷入困境），bog down（陷入泥沼/陷入困境、进展受阻），swampy（更偏“积水、湿地”的感觉），muddy（更直接指“有泥、脏”）。"]}
{"word":"Boghazkeui","summary":{"en":"Boghazkeui is an older spelling for Boğazköy, the place associated with Hattusa, capital of the ancient Hittite Empire in Turkey.","zh":"Boghazkeui 是 Boğazköy 的旧拼写，指与赫梯帝国古都哈图沙（Hattusa）相关的土耳其考古地点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) An older Western spelling of **Boğazköy** (near today’s Boğazkale) in north-central Turkey—famous as the location of **Hattusa**, the capital of the ancient Hittite Empire and a major archaeological site.","zh":"（专有名词）**Boğazköy** 的旧式西方拼写（位于土耳其中北部，今多称 Boğazkale 附近）；以古代赫梯帝国首都 **Hattusa（哈图沙）** 的遗址所在地而闻名，是重要考古地点。"},"examples":[{"en":"Archaeologists once referred to the Hittite capital as ‘Boghazkeui’ in early publications.","zh":"在早期出版物中，考古学家曾用“Boghazkeui”来指称赫梯首都遗址。"},{"en":"Many museum labels now use ‘Hattusa (Boğazköy/Boghazkeui)’ to show the historical spelling.","zh":"许多博物馆标签会写“Hattusa（Boğazköy/Boghazkeui）”，以标明历史拼写。"}]}],"synonyms":["Boğazköy","Boğazkale","Hattusa","Ḫattuša"],"phonetic":"/boʊˌɡɑːzˈkøɪ/","extraExplanation":["“Boghazkeui”常见于较早的英文/法文文献，是把土耳其语 **Boğazköy** 拉丁化后的旧拼法；其中 *boğaz* 有“峡谷、咽喉要道”之意，*köy* 是“村庄”。","现代资料更常用 **Boğazköy**、**Boğazkale**（现今地名）或直接用古名 **Hattusa/Ḫattuša（哈图沙）**。","该遗址以出土大量楔形文字泥板而著名，包含赫梯语与其他古近东语言文献，对研究青铜时代历史很关键。"]}
{"word":"Boghazkoy","summary":{"en":"Boghazkoy is an older spelling for Boğazköy, known for the Hittite capital site Hattusa in Turkey.","zh":"Boghazkoy 是 Boğazköy 的旧式拼写，因土耳其境内的赫梯古都哈图沙遗址而知名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an older English spelling of Boğazköy, a village area in north-central Turkey famous as the site of the ancient Hittite capital, Hattusa","zh":"Boghazkoy 是 Boğazköy 的旧式英文拼写，指土耳其中北部一个地区/村落，以赫梯帝国古都哈图沙（Hattusa）遗址所在地而闻名"},"examples":[{"en":"Archaeologists excavated cuneiform tablets at Boghazkoy (Hattusa).","zh":"考古学家在 Boghazkoy（哈图沙）发掘了楔形文字泥板。"},{"en":"Many older books use the spelling “Boghazkoy” for the Hittite capital site.","zh":"许多较早的书会用 “Boghazkoy” 这个拼写来指赫梯古都遗址。"}]}],"synonyms":["Boğazköy","Hattusa"],"phonetic":"/boʊˈɡɑːzˌkɔɪ/","extraExplanation":["“Boghazkoy”是早期西方文献对土耳其语地名 Boğazköy 的转写；现代更常见写法是“Boğazköy”或与附近城镇相关的“Boğazkale”。","该地最重要的文化意义在于哈图沙（Hattusa）遗址：这里出土大量赫梯时期泥板文书（含外交条约等），对研究古代近东语言与历史非常关键。"]}
{"word":"boghole","summary":{"en":"Boghole usually means a muddy hole in a bog; in some British/Australian slang it can be a vulgar insult.","zh":"boghole 通常指沼泽里的泥坑；在部分英式/澳式俚语中也可作粗俗辱骂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hole or water-filled depression in a bog or swamp; a muddy, soft spot in wet ground","zh":"沼泽/湿地里的坑洞；积水的泥坑、软烂的湿地凹陷处"},"examples":[{"en":"Be careful—there’s a boghole near the trail, and it’s easy to sink into it.","zh":"小心——小路旁边有个沼泽泥坑，很容易陷进去。"},{"en":"The tractor got stuck after a wheel slid into a boghole.","zh":"拖拉机的一个轮子滑进泥坑后卡住了。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang, vulgar, chiefly British/Australian) a strong insult for an unpleasant person; often used like “asshole”","zh":"（俚语，粗俗，主要英式/澳式）对令人讨厌的人的强烈侮辱性称呼，常类似于“混蛋/讨厌鬼”（语气很重）"},"examples":[{"en":"He cut in line again—what a boghole.","zh":"他又插队了——真是个讨厌鬼。（粗俗用法）"},{"en":"That word is rude; don’t use it in polite conversation.","zh":"这个词很粗鲁，不要在正式或礼貌的场合使用。"}]}],"synonyms":["mudhole","muddy hole","boggy patch","swampy hole"],"phonetic":"/ˈbɑɡˌhoʊl/","extraExplanation":["“bog”在英式英语里除了指“沼泽”，也常指“厕所”（很口语、略粗）。因此“boghole”在部分地区会被借来当作辱骂词，带有明显不礼貌的色彩。","如果你只是想表达“泥坑/湿地坑洞”，更中性的说法有：muddy hole, boggy patch, swampy pit。"]}
{"word":"Bogie","summary":{"en":"Bogie most commonly means a golf score of one over par; it can also mean a train’s wheel assembly (esp. in British English), or an imagined scary thing (like a bogeyman).","zh":"Bogie 最常指高尔夫的“柏忌”（比标准杆多一杆）；也可指火车的转向架/轮组（英式更常用），或指想象出来的可怕事物（类似“鬼怪/心魔”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Golf) a score of one stroke over par on a hole.","zh":"（高尔夫）柏忌：某一洞的成绩比标准杆多一杆。"},"examples":[{"en":"I made a bogie on the 7th hole after missing a short putt.","zh":"我在第7洞因为没推进一个短推，打了个柏忌。"},{"en":"A bogie isn’t terrible, but try to avoid making two in a row.","zh":"柏忌不算太糟，但尽量别连续两洞都打柏忌。"}]},{"partOfSpeech":"n.","definition":{"en":"(Railways) a set of wheels and a frame under a train car; a rail truck (often called a “bogie” in British English).","zh":"（铁路）转向架/转向架组件：位于车厢下面的一组车轮与支架结构（英式英语更常说 bogie，美式更常说 truck）。"},"examples":[{"en":"Engineers inspected the bogie for worn wheels and loose bolts.","zh":"工程师检查了转向架是否有轮子磨损或螺栓松动。"},{"en":"The train swayed because a bogie component needed repair.","zh":"火车晃动是因为转向架的一个部件需要维修。"}]},{"partOfSpeech":"n.","definition":{"en":"An imagined scary thing; a “bogeyman” or something you fear without clear proof (often used in the plural: “bogies”).","zh":"（非正式）想象出来的可怕事物；“鬼怪/心魔”，指缺乏明确证据却让人害怕的东西（常用复数 bogies）。"},"examples":[{"en":"Don’t let imaginary bogies stop you from trying new things.","zh":"别让想象中的“心魔”阻止你尝试新事物。"},{"en":"In her speech, she warned against chasing political bogies.","zh":"她在演讲中警告人们别去追逐政治上的“假想敌”。"}]}],"synonyms":["(golf) one-over-par","(railways) truck (AmE)","(fear) bogeyman","bugbear","phantom fear"],"phonetic":"/ˈboʊɡi/","extraExplanation":["“bogie/bugbear/bogeyman”在英语里常与“想象中的恐惧”有关，适合用来表达“无形的担忧/没有证据的害怕”。在体育语境（尤其高尔夫）里，bogie是非常常见的计分词。","英美用法小提示：铁路语境下，美式更常说 train truck，英式更常说 bogie；在高尔夫语境下两边都常用 bogie。"]}
{"word":"bogie","summary":{"en":"“Bogie” most commonly means a golf score of one under par; it can also mean a train wheel assembly (bogie), an unidentified aircraft, or (in British English) a scary “bogeyman”-type creature.","zh":"“bogie”最常见指高尔夫的小鸟球（低于标准杆一杆）；也可指铁路的转向架、不明飞机，或在英式英语中指用来吓小孩的“鬼怪/床下怪物”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Golf) a score of one stroke under par on a hole.","zh":"（高尔夫）小鸟球：在某一洞的成绩比标准杆少一杆。"},"examples":[{"en":"She made a bogie on the 8th hole.","zh":"她在第8洞打出了一记小鸟球。"},{"en":"Two bogies in a row helped him catch up.","zh":"连续两个小鸟球帮助他追了上来。"}]},{"partOfSpeech":"n.","definition":{"en":"A wheeled frame under a train or tram that holds the wheels and helps the vehicle turn smoothly; also called a bogie truck.","zh":"（铁路）转向架：列车/电车底部承载车轮的轮架组件，帮助车辆平稳转弯。"},"examples":[{"en":"The engineers inspected the bogie after the noise was reported.","zh":"有人报告异响后，工程师检查了转向架。"},{"en":"Modern trains use bogies designed for high-speed stability.","zh":"现代列车使用为高速稳定性设计的转向架。"}]},{"partOfSpeech":"n.","definition":{"en":"(Aviation, informal) an unidentified aircraft, often treated as possibly hostile.","zh":"（航空，非正式）不明飞行物/不明飞机，常被视为可能有威胁。"},"examples":[{"en":"The radar operator called out a bogie at ten o’clock.","zh":"雷达操作员报告：十点钟方向出现不明飞机。"},{"en":"They scrambled jets to identify the bogie.","zh":"他们紧急起飞战机去识别这架不明飞机。"}]},{"partOfSpeech":"n.","definition":{"en":"(British English, informal) a ghost-like creature used to scare children; a variant spelling of “bogey/boogeyman.”","zh":"（英式英语，非正式）吓小孩用的“鬼怪/妖怪”；“bogey/boogeyman”的一种拼写。"},"examples":[{"en":"As a child, he thought there was a bogie under the bed.","zh":"他小时候以为床底下有个鬼怪。"},{"en":"Don’t invent bogies—there’s nothing to be afraid of.","zh":"别自己吓自己——没什么可怕的。"}]}],"synonyms":["birdie (golf)","railway truck (rail)","unidentified aircraft (aviation)","boogeyman (BrE, informal)"],"phonetic":"ˈboʊɡi","extraExplanation":["“bogie”在不同领域意思差异很大：高尔夫里最常见是“小鸟球”；铁路语境里指“转向架”。看句子里是否出现hole/par（高尔夫）或train/wheels（铁路）来判断。","“bogie”与“bogey”常被混用或作为不同拼写：在高尔夫里，美式更常见“birdie”（小鸟球），而“bogey”通常指“高于标准杆一杆”。在英式儿童语境中，“bogie/bogey”可接近“boogeyman（床下的怪物）”。"]}
{"word":"bogieman","summary":{"en":"A boogeyman/bogeyman is a made-up scary figure used to frighten children; figuratively, it can mean a blamed, feared ‘enemy.’","zh":"boogeyman/bogeyman 指用来吓小孩的虚构恐怖形象；引申义指被妖魔化、被当作替罪羊的“假想敌”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(also spelled boogeyman/bogeyman) an imaginary scary creature that adults mention to frighten children into behaving.","zh":"（也拼作 boogeyman/bogeyman）“妖怪/怪物”一类的虚构恐怖形象，大人常用来吓唬小孩、让他们乖一点。"},"examples":[{"en":"Kids sometimes think the boogeyman is hiding under the bed.","zh":"小孩子有时会以为“妖怪”藏在床底下。"},{"en":"She joked that the boogeyman would get him if he didn’t brush his teeth.","zh":"她开玩笑说他要是不刷牙，“妖怪”就会来抓他。"},{"en":"Don’t scare your little brother with stories about the boogeyman.","zh":"别用“妖怪”的故事吓你弟弟。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or thing that is blamed for problems and treated as a feared enemy (often in politics or media).","zh":"（引申义）被当作“替罪羊/假想敌”的人或事物，常被夸大成令人害怕的威胁（多用于政治或媒体语境）。"},"examples":[{"en":"The new law made immigrants a political boogeyman.","zh":"这项新法律把移民塑造成政治上的“假想敌”。"},{"en":"In the debate, the internet became the boogeyman for every social problem.","zh":"在辩论中，互联网成了各种社会问题的“背锅对象”。"}]}],"synonyms":["boogeyman","bogeyman","monster","bogey","villain","scapegoat"],"phonetic":"ˈbʊɡiˌmæn","extraExplanation":["“bogieman”更常见的标准拼写是 **boogeyman** 或 **bogeyman**；不同地区和作者会用不同拼法，但意思通常相同。","这个词常用于儿童文化和民间故事，类似中文里用来吓小孩的“鬼/妖怪/大灰狼”。在现代英语里也很常用作比喻，指被过度妖魔化的对象。"]}
{"word":"bogier","summary":{"en":"“bogier” is usually a misspelling of “boggier,” meaning more muddy and swampy.","zh":"“bogier”通常是“boggier”的误拼，意思是“更泥泞、更像沼泽的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Common misspelling) Intended meaning: “boggier,” the comparative form of “boggy” — more wet, soft, and muddy like a bog (swamp).","zh":"（常见拼写误写）通常是想写“boggier”，是“boggy”的比较级——更像沼泽一样潮湿、松软、泥泞。"},"examples":[{"en":"After the rain, the ground became boggier and harder to walk on.","zh":"下雨后，地面变得更泥泞、更难走了。"},{"en":"The trail gets boggier near the river, so wear boots.","zh":"靠近河边的小路会更湿软泥泞，所以要穿靴子。"}]}],"synonyms":["muddier","swampier","wetter","marshier"],"phonetic":"/ˈbɔɡiər/","extraExplanation":["“bogier”在标准英语里不常见；比较常见的正确拼写是“boggier”（注意 g 要双写），来自形容词“boggy”。","“bog”指“沼泽/泥炭沼泽”，所以“boggy/boggier”常用来形容地面、道路、田地“湿软、陷脚”。"]}
{"word":"bogies","summary":{"en":"“Bogies” can mean imaginary monsters (boogeymen), golf scores of one over par, or train wheel assemblies, depending on context.","zh":"“bogies” 视语境可指想象中的鬼怪（类似 boogeyman）、高尔夫的“柏忌”（高于标准杆一杆），或火车的转向架/轮轴架。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of bogie/bogey) a scary imaginary creature; a “boogeyman.”","zh":"（bogie/bogey 的复数）指吓人的想象中的怪物；“床底下的怪物/鬼怪”（类似 boogeyman）。"},"examples":[{"en":"As a kid, he thought bogies lived under the bed.","zh":"小时候他以为床底下住着鬼怪。"},{"en":"The story turns the dark forest into a place full of bogies.","zh":"这个故事把黑暗的森林写成了满是鬼怪的地方。"}]},{"partOfSpeech":"n.","definition":{"en":"(Plural of bogey) in golf, a score of one stroke over par on a hole.","zh":"（bogey 的复数）【高尔夫】指某洞“高于标准杆一杆”的成绩（柏忌）。"},"examples":[{"en":"He made two bogies on the front nine.","zh":"他在前九洞打出了两个柏忌。"},{"en":"Try to avoid bogies by keeping the ball in the fairway.","zh":"尽量把球留在球道上来避免柏忌。"}]},{"partOfSpeech":"n.","definition":{"en":"(Plural of bogie) a swiveling wheel-and-axle unit under a train car or other rail vehicle.","zh":"（bogie 的复数）【铁路】指火车车厢下方可转向的轮轴架/转向架。"},"examples":[{"en":"Technicians inspected the bogies after the long journey.","zh":"长途行驶后，技术人员检查了各个转向架。"},{"en":"Modern trains use bogies to take curves smoothly.","zh":"现代列车用转向架来更平稳地过弯。"}]}],"synonyms":["boogeymen","bogeymen","goblins","par+1 (golf)","bogie trucks (rail)"],"phonetic":"/ˈboʊɡi/","extraExplanation":["“bogies” 对应的单数通常写作 bogey 或 bogie：高尔夫语境更常见 bogey；铁路工程语境更常见 bogie。","表示“鬼怪”的 bogie 在英式英语里较常见；美式英语更常用 boogeyman（也常写作 boogyman）。","在文学/民间故事中，bogies 常用来象征儿童对黑暗与未知的恐惧，类似中文故事里的“鬼怪/妖怪”。"]}
{"word":"Bogijiab","summary":{"en":"“Bogijiab” is not a recognized standard English word; it’s likely a name, typo, or invented term.","zh":"“Bogijiab”不是标准英语词，可能是人名/网名、拼写错误或自造词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling, a username/proper name, or a made-up term.","zh":"不是标准英语单词。很可能是拼写错误、用户名/专有名词，或自造词。"},"examples":[{"en":"I can’t find “Bogijiab” in major English dictionaries—could you share the sentence where you saw it?","zh":"我在主要英语词典里找不到“Bogijiab”——你能把它出现的句子发我吗？"},{"en":"If it’s a name or brand, the meaning may depend on the person/company using it.","zh":"如果它是人名或品牌名，含义通常取决于使用它的人/公司。"}]}],"phonetic":"/ˌboʊɡiˈdʒæb/","extraExplanation":["我猜它可能是由两部分拼在一起的：bogie/bogey（高尔夫“标准杆+1”，或英式里“可怕的东西/妖怪”一类的联想）+ jab（“戳/刺；（口头）讽刺；（拳击）刺拳”）。但“Bogijiab”本身并不是常见固定词。","如果你想查的是某个更常见的英文词，可能接近：bogey /ˈboʊɡi/ 或 boogie /ˈbʊɡi/（跳布吉舞/布吉音乐），以及 jab /dʒæb/。把原句或正确拼写发来，我可以给出准确释义与用法。"]}
{"word":"bogijiab","summary":{"en":"“bogijiab” isn’t recognized as a standard English word; it likely needs spelling/context to identify.","zh":"“bogijiab”不是常见英文词；需要确认拼写或上下文才能判断含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username, a brand name, or a word from another language written in Latin letters.","zh":"不是标准英语单词。可能是拼写错误、用户名/品牌名，或是其他语言用拉丁字母写出来的词。"},"examples":[{"en":"I couldn’t find “bogijiab” in an English dictionary—could you check the spelling?","zh":"我在英文词典里查不到“bogijiab”，你能确认一下拼写吗？"},{"en":"If “bogijiab” is a name or slang from a specific community, please tell me where you saw it.","zh":"如果“bogijiab”是某个圈子里的名字或俚语，请告诉我你在哪里看到的。"}]}],"extraExplanation":["我这边查不到“bogijiab”的常见英文词条，所以不建议硬给发音或含义（容易误导）。\n\n你可以把更多信息发我，我就能更准确：\n1）你是在哪里看到/听到的（句子、截图、网页链接）？\n2）想表达的可能意思是什么（比如中文想说“……”）？\n3）会不会是拼写接近的词：\n- boogie /ˈbʊɡi/（跳舞；布吉音乐）\n- bogey /ˈboʊɡi/（高尔夫“柏忌”；也可指“让人害怕的东西”）\n- bogie /ˈboʊɡi/（火车转向架；英式用法较多）\n\n把原句贴出来，我可以帮你判断最可能的词并解释用法。"]}
{"word":"bogland","summary":{"en":"Bogland means land made up of bogs—wet, spongy ground rich in peat.","zh":"bogland 指由沼泽（泥炭地）构成的土地：潮湿、松软、富含泥炭。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Land that is covered with bogs (wet, soft ground made of partly decayed plants), often difficult to farm or build on.","zh":"泥炭沼泽地；多沼泽的土地（地面潮湿松软，由部分腐烂的植物堆积而成），通常不利于耕种或建造。"},"examples":[{"en":"Much of the bogland is protected because it supports rare birds and plants.","zh":"许多沼泽地受到保护，因为那里栖息着稀有的鸟类并生长着珍稀植物。"},{"en":"They built a boardwalk so visitors could cross the bogland safely.","zh":"他们修了栈道，让游客可以安全穿越沼泽地。"},{"en":"In some regions, bogland has been drained to create farmland, which can harm local ecosystems.","zh":"在一些地区，沼泽地被排水改造成农田，但这可能会破坏当地生态系统。"}]}],"synonyms":["bog","wetland","marshland","peatland"],"phonetic":"/ˈbɑɡ.lænd/","extraExplanation":["“bogland”常让人联想到爱尔兰的地貌与文化意象。诺贝尔文学奖得主谢默斯·希尼（Seamus Heaney）有一首著名诗作《Bogland》，用“沼泽”作为隐喻，写记忆、历史与土地的层层沉积；因此在文学语境里，“bogland”有时不只是地理名词，也带有“深埋往事、保存痕迹”的象征意味。"]}
{"word":"boglander","summary":{"en":"“Boglander” literally means a person from a boggy area, but it can also be used as an offensive slur for Irish people in some contexts.","zh":"“boglander”字面指来自沼泽地的人，但在某些语境中也可能是针对爱尔兰人的冒犯性蔑称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who lives in or comes from a boggy (wet, marshy) area; someone associated with peat bogs or moorland","zh":"居住在沼泽地/泥炭沼泽地区的人；来自湿地、沼泽地的人"},"examples":[{"en":"The novel describes the boglanders cutting peat for fuel in the early morning.","zh":"小说描写了沼泽地居民清晨割泥炭作燃料。"},{"en":"In some rural areas, boglanders traditionally relied on the bog for work and heat.","zh":"在一些乡村地区，沼泽地居民传统上依靠沼泽提供工作和取暖燃料。"}]},{"partOfSpeech":"n.","definition":{"en":"(often offensive or derogatory) a slur for an Irish person, based on stereotypes about rural life and bogs","zh":"（常带冒犯/贬义）对爱尔兰人的蔑称，源于把爱尔兰乡村与沼泽刻板印象联系起来的说法"},"examples":[{"en":"That word is a slur in many contexts, so it’s better not to use it.","zh":"那个词在很多语境里是蔑称，所以最好不要用。"},{"en":"The teacher explained why terms like “boglander” can be hurtful and historically loaded.","zh":"老师解释了为什么像“boglander”这样的说法会伤人，并带有历史包袱。"}]}],"synonyms":["bog dweller","bogland resident","peat-cutter (contextual)"],"phonetic":"/ˈbɑɡˌlændɚ/","extraExplanation":["“boglander”由 bog（沼泽、泥炭地）+ -lander（某地的人）构成，字面意思很直白。","在爱尔兰/英国相关语境里，它有时被用作带偏见的称呼，因此在现实交流中应避免用于指人；如需描述地理环境，可改用“people from the boglands / residents of boggy areas（沼泽地居民）”。"]}
{"word":"bogle","summary":{"en":"A bogle is a goblin-like spirit in Scottish/Northern English folklore.","zh":"bogle 指苏格兰/英格兰北部民俗中的“妖怪/鬼怪”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scottish English, Northern English) a goblin or scary spirit; an imaginary creature used to frighten children.","zh":"（苏格兰/英格兰北部英语）妖怪；吓人的精灵（常用来吓唬小孩的想象生物）。"},"examples":[{"en":"As a child, he was told a bogle lived in the dark barn.","zh":"他小时候大人说谷仓里黑暗处住着一只“妖怪”。"},{"en":"Don’t go near the river at night, or the bogle will get you.","zh":"晚上别靠近河边，不然妖怪会抓走你。"}]}],"synonyms":["goblin","bogeyman","spirit","hobgoblin"],"phonetic":"/ˈboʊɡəl/","extraExplanation":["“bogle”主要出现在苏格兰与英格兰北部的民间故事里，含义接近“bogey/bogeyman（鬼怪/床底怪）”。在现代日常英语里不算常用，更像带地方色彩或文学/民俗语境中的词。"]}
{"word":"bogled","summary":{"en":"“Bogled” is usually a misspelling of “boggled,” meaning “very surprised or confused.”","zh":"“bogled”通常是“boggled”的误拼，意思是“非常惊讶或困惑”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Common misspelling) Past tense / past participle of “boggle”: to be very surprised or confused.","zh":"（常见拼写错误）“boggle”的过去式/过去分词：非常惊讶或困惑。"},"examples":[{"en":"I was boggled by how quickly she solved the puzzle.","zh":"她那么快就解开谜题，我都看愣了/惊呆了。"},{"en":"He looked boggled when he heard the news.","zh":"他听到这个消息时一脸错愕。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare, in Scots/older usage) Past tense of “bogle”: to fear or be haunted by an imagined danger; sometimes related to “bogle” meaning a goblin/ghost.","zh":"（较少见，苏格兰/旧式用法）“bogle”的过去式：害怕或被想象中的危险困扰；也与“bogle（妖怪/鬼魂）”有关。"},"examples":[{"en":"In old tales, travelers bogled at the thought of spirits on the moor.","zh":"在古老传说里，旅人一想到荒原上的鬼魂就心生畏惧。"}]}],"synonyms":["amazed","stunned","baffled","bewildered"],"phonetic":"/ˈbɑɡəld/","extraExplanation":["“bogled”在现代英语里最常见的情况是把“boggled”少写了一个 g。标准拼写通常是：boggle → boggled。","常用搭配：be boggled (by)…, boggle the mind（令人难以理解/震惊）, boggle at…（对……感到吃惊，较正式）。","“bogle”作为“妖怪/鬼魂”的名词或“感到害怕”的动词，多见于苏格兰英语或文学语境，日常写作中很少用。"]}
{"word":"bogledom","summary":{"en":"Bogledom means the realm of bogles (ghostly goblin-like spirits), and figuratively, a state of needless fear or imagined threats.","zh":"Bogledom 指（苏格兰民俗中的）鬼怪之域，也可比喻无端恐惧、疑神疑鬼的心理状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the world or realm of bogles (goblins/ghost-like spirits), especially in Scottish folklore; supernatural beings collectively","zh":"（尤指苏格兰民间传说中的）妖精/鬼怪的世界或领域；鬼怪总称"},"examples":[{"en":"In the old tale, a careless traveler wandered into bogledom after midnight.","zh":"在那个古老的故事里，一个粗心的旅人午夜后闯进了鬼怪的世界。"},{"en":"The poet fills the moor with bogledom—shadowy spirits and uneasy whispers.","zh":"诗人让荒原充满鬼魅气息——影影绰绰的精灵与不安的低语。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) a state of needless fear or anxious imagination, as if haunted by imaginary threats","zh":"（比喻）无端的恐惧或焦虑的想象；仿佛被臆想的威胁“缠住”"},"examples":[{"en":"Once she checked the facts, she stepped out of bogledom and calmed down.","zh":"核对事实后，她就从“疑神疑鬼”的状态里走出来，冷静了下来。"},{"en":"Online rumors can pull people into bogledom very quickly.","zh":"网络谣言很容易把人迅速拖进“疑神疑鬼”的情绪里。"}]}],"synonyms":["realm of spirits","the supernatural","haunted world","needless fear","paranoia (informal)"],"phonetic":"/ˈboʊɡəlˌdəm/","extraExplanation":["“bogledom”由 bogle（苏格兰方言：妖精、鬼魂、吓人的精灵）+ -dom（表示“领域/状态”，如 kingdom）构成，因此字面就是“妖精之域”。","这个词带有明显的文学/民俗色彩，常用于描写苏格兰荒原、夜路、古堡等氛围；现代英语里较少见，多作为风格化用词或比喻用法出现。"]}
{"word":"bogles","summary":{"en":"“Bogles” can mean goblins/ghost-like creatures (plural), or “bogles” as a verb form meaning “frightens/puzzles,” especially in Scottish English.","zh":"“Bogles”可指“鬼怪/妖精”（复数），也可作动词第三人称单数，表示“使害怕/使困惑”，多见于苏格兰英语语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Goblins or frightening spirits; in Scottish English, a “bogle” is a ghost-like creature used in folk stories to scare people.","zh":"（名词复数）妖精、鬼怪；在苏格兰英语里，bogle 指民间故事中用来吓人的幽灵/精怪。"},"examples":[{"en":"In old Scottish tales, people warned children about bogles in the dark woods.","zh":"在古老的苏格兰故事里，人们会警告孩子黑暗森林里有 bogles（鬼怪）。"},{"en":"The legend says bogles appear on stormy nights near the river.","zh":"传说暴风雨的夜晚，河边会出现 bogles。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular) To frighten, startle, or confuse; often used in Scottish English as “it bogles me” meaning “it puzzles me.”","zh":"（动词第三人称单数）使害怕、使吃惊、使困惑；在苏格兰英语中常见于 it bogles me，意思是“让我想不通/让我困惑”。"},"examples":[{"en":"It bogles me how quickly the weather can change here.","zh":"这里天气变化之快让我想不通。"},{"en":"The sudden noise bogles the dog and it runs away.","zh":"突然的声响把狗吓了一跳，它就跑开了。"}]}],"synonyms":["goblins","spirits","ghosts","frightens","startles","puzzles"],"phonetic":"/ˈboʊɡəlz/","extraExplanation":["“bogle”主要出现在苏格兰英语与英国文学/民间传说语境中；在现代日常美式英语里更常用 ghost, goblin, scare, puzzle 等词来表达相近意思。","文学与文化中常把 bogle 作为“用来吓唬小孩的鬼怪”意象，类似中文故事里的“妖怪/鬼影”，带有民俗色彩。"]}
{"word":"boglet","summary":{"en":"Boglet means a small goblin/ghost in Scottish or Irish dialect (and rarely, a small bog).","zh":"boglet 指（苏格兰/爱尔兰方言中）小妖怪/小鬼魂；极少也指小沼泽。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scottish/Irish English, dialect) A small goblin or ghost; a bogey-like creature used in folk stories to scare children.","zh":"（苏格兰/爱尔兰英语方言）小妖怪；小鬼魂；类似“bogeyman（怪物）”的民间形象，常用来吓唬小孩。"},"examples":[{"en":"As a child, she was told a boglet lived in the dark hallway.","zh":"她小时候被告知，黑暗的走廊里住着一个小妖怪。"},{"en":"He joked that the strange noise was just a boglet, not a thief.","zh":"他开玩笑说那奇怪的声音只是小鬼在捣乱，不是小偷。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A very small bog or marshy patch of ground.","zh":"（罕见）小沼泽；一小片湿地。"},"examples":[{"en":"After the rain, a boglet formed near the edge of the field.","zh":"雨后，田地边缘形成了一小片湿地。"}]}],"synonyms":["bogle","bogey","goblin","sprite","specter"],"phonetic":"/ˈbɑɡlət/","extraExplanation":["“boglet”多见于苏格兰/爱尔兰的方言或民间故事语境，是“bog（妖怪、鬼怪）+ -let（小……）”的缩小形式。这里的bog不是“厕所（英式俚语 bog）”的意思，而更接近bogey/bogle那类“吓小孩的怪物”。","在文学与民俗语境里，它常带有一种轻微、调侃或儿童故事的语气：不一定是严肃的“恶魔”，更像“会吓人/捣蛋的小怪”。"]}
{"word":"bogman","summary":{"en":"A bogeyman is an imaginary scary figure used to frighten children; it can also mean an exaggerated or demonized threat in public talk.","zh":"bogeyman 指用来吓小孩的虚构怪物；也可引申为在公众讨论中被夸大或妖魔化的“威胁对象”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly: bogeyman) an imaginary frightening figure, especially one used to scare children into behaving.","zh":"（常见写法：bogeyman）“床下怪/鬼怪”一类的虚构可怕人物，常用来吓唬小孩让他们乖乖听话。"},"examples":[{"en":"When I was little, I thought the bogeyman lived in my closet.","zh":"我小时候以为衣柜里住着“床下怪”。"},{"en":"Some parents use the bogeyman to scare kids into going to bed early.","zh":"有些家长用“床下怪”来吓孩子，让他们早点睡。"},{"en":"In politics, immigrants are sometimes treated like a bogeyman to create fear.","zh":"在政治语境里，移民有时会被当作“替罪羊式的恐惧对象”，用来制造恐慌。"}]}],"synonyms":["boogeyman","bogeyman","monster","imaginary threat","scapegoat"],"phonetic":"/ˈbuːɡimæn/","extraExplanation":["“bogman”更常被理解为“bogeyman/bogeyman”的误拼或非标准拼写；标准写法有 bogeyman / boogeyman，复数 bogeymen。","bogeyman 源自民间传说中的吓人形象，后来引申为“被夸大、被妖魔化的威胁/恐惧对象”，常见于新闻、评论与政治讨论中。","相关表达：make someone into a bogeyman（把……塑造成可怕的威胁）；the bogeyman under the bed（床下的怪物，典型儿童恐惧意象）。"]}
{"word":"bogmire","summary":{"en":"Bogmire is usually a surname (and occasionally a place name), not a common everyday English word.","zh":"Bogmire 通常是姓氏（偶尔是地名），不是常见的日常英语词汇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname); sometimes also used as a place name in the U.S.","zh":"姓氏；有时也作美国的地名（不常见）"},"examples":[{"en":"Ms. Bogmire will lead the meeting today.","zh":"Bogmire 女士今天将主持会议。"},{"en":"I found “Bogmire” listed as a local road name on the map.","zh":"我在地图上看到“Bogmire”被列为一条当地道路名称。"}]}],"phonetic":"ˈbɑɡˌmaɪr","extraExplanation":["“Bogmire”不是常见英语词汇，更常见于人名/姓氏或少数地名。它看起来由 bog（沼泽）+ mire（泥沼）构成，整体带有“沼泽泥地”的意象，因此可能源自地貌特征（比如居住地附近多沼泽）而形成的姓氏或地名。","在正式写作中，如果你看到 Bogmire 首字母大写，通常应按专有名词处理（人名、地名、机构名等），不需要翻译；如果需要解释，可以用“姓氏/地名”加注。"]}
{"word":"Bogo","summary":{"en":"BOGO means a “buy one, get one” deal (free or discounted).","zh":"BOGO 指“买一送一”（免费或打折）的促销。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sales promotion meaning “buy one, get one (free or discounted),” often written as BOGO","zh":"一种促销方式，意思是“买一送一（免费或打折）”，常写作 BOGO"},"examples":[{"en":"The store has a BOGO deal on socks this week.","zh":"这家店这周袜子有买一送一的活动。"},{"en":"I only bought it because it was BOGO.","zh":"我买它只是因为有买一送一。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing an offer or price plan that follows a “buy one, get one” rule","zh":"形容遵循“买一送一”规则的优惠或价格方案"},"examples":[{"en":"They’re running a BOGO promotion on coffee drinks.","zh":"他们在咖啡饮品上做买一送一促销。"},{"en":"Check the app for BOGO coupons.","zh":"去应用里看看有没有买一送一优惠券。"}]}],"synonyms":["buy-one-get-one","2-for-1","two-for-one","BOGOF"],"phonetic":"ˈboʊɡoʊ","extraExplanation":["BOGO 是美国零售和餐饮广告里非常常见的缩写，来自 “Buy One, Get One”。有时会写得更具体：BOGO free（买一送一免费）、BOGO 50% off（第二件半价）或 BOGOHO（buy one, get one half off）。","口语里也会直接读作一个词 “BOH-goh”。在广告或价签上常见于全大写（BOGO）。"]}
{"word":"bogo","summary":{"en":"BOGO means “buy one, get one (free)”—a common retail promotion.","zh":"BOGO 指“买一送一（多为免费）”，是常见的零售促销说法。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Retail/marketing) Abbreviation for “buy one, get one (free),” a type of sales promotion where purchasing one item lets you receive another item at no cost (or sometimes at a discount).","zh":"（零售/营销）“buy one, get one (free)” 的缩写，指“买一送一（通常是免费，或有时第二件折扣）”的促销方式。"},"examples":[{"en":"This weekend, the store has a BOGO deal on socks—buy one pair, get one free.","zh":"这周末商店袜子有 BOGO 活动——买一双送一双。"},{"en":"I used a BOGO coupon to get two shampoos for the price of one.","zh":"我用了一张 BOGO 优惠券，用一瓶的价格拿到了两瓶洗发水。"},{"en":"Is the BOGO offer valid online, or only in-store?","zh":"这个 BOGO 优惠线上也能用吗，还是只限门店？"}]}],"synonyms":["buy one, get one free","two-for-one","B1G1","BOGO deal"],"phonetic":"ˈboʊɡoʊ","extraExplanation":["BOGO 在美国广告里非常常见，常写作 BOGO 或 B1G1。很多时候商家会在细则里写清楚是否“第二件免费”还是“第二件半价”（例如 BOGO 50% off）。结账前最好看小字条款：是否同款/同价、是否限量、是否可叠加优惠等。"]}
{"word":"Bogoch","summary":{"en":"“Bogoch” is most commonly a surname; less commonly it may be a Slavic-based form meaning “a rich person.”","zh":"“Bogoch”最常见是姓氏；较少情况下可能源自斯拉夫语音译，表示“富人”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname); used as a proper name for a person or family.","zh":"姓氏（家族名）；作为人的专有名词使用。"},"examples":[{"en":"Dr. Bogoch published a study on infectious diseases.","zh":"Bogoch 医生发表了一项关于传染病的研究。"},{"en":"I met someone named Bogoch at the conference.","zh":"我在会议上遇到一位姓 Bogoch 的人。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common; from Slavic transliteration) a person who is rich or well-off.","zh":"（较少见；源自斯拉夫语音译）富有的人，有钱人。"},"examples":[{"en":"In some Slavic contexts, a word like “bogoch/bogach” can refer to a rich man.","zh":"在一些斯拉夫语语境里，类似 “bogoch/bogach” 的词可能指“富人”。"},{"en":"He wasn’t a bogoch, but he lived comfortably.","zh":"他算不上富人，但生活很宽裕。"}]}],"synonyms":["(surname) family name","(n.) wealthy person","rich person","well-off person"],"phonetic":"/ˈboʊɡɑk/","extraExplanation":["“Bogoch”更常见于英语语境中的姓氏。它也可能是某些斯拉夫语词（如乌克兰语/俄语中常见的音译形式之一）的拼写变体；不同移民记录、拉丁字母转写习惯会造成多种拼写（如 -ach/-och 等）。","如果你是在特定文章、新闻或社交媒体里看到 “Bogoch”，通常应按“人名/姓氏”理解；需要时可以提供上下文，我可以帮你判断更准确的含义与读音。"]}
{"word":"BOGOF","summary":{"en":"BOGOF means “Buy One, Get One Free,” a common retail promotion.","zh":"BOGOF 指“买一送一（免费）”，常见于零售促销。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a sales promotion meaning “Buy One, Get One Free,” where you receive a second item at no additional cost (usually the same item or an item of equal/lesser value).","zh":"一种促销方式，意思是“买一送一（免费）”，购买一件商品后可免费获得第二件（通常是同款或等值/更低价商品）。"},"examples":[{"en":"This week only: BOGOF on all shampoos—buy one bottle and get one free.","zh":"仅限本周：所有洗发水买一送一——买一瓶送一瓶。"},{"en":"The store is running a BOGOF deal, so I stocked up on snacks.","zh":"那家店在做买一送一，我就多买了一些零食。"}]}],"synonyms":["BOGO","buy one get one free","two-for-one (often similar)"],"phonetic":"/ˈboʊɡoʊf/","extraExplanation":["BOGOF 是英国和一些英联邦国家广告里很常见的缩写；在美国更常见的说法是 BOGO（Buy One, Get One）或 BOGO free。","有时会写成“BOGO 50% off”（第二件半价）等变体，所以看到促销牌时最好确认细则（是否同款、是否限数量、是否可与优惠券叠加等）。"]}
{"word":"Bogomil","summary":{"en":"Bogomil: a member of a medieval Balkan Christian sect (10th century onward).","zh":"Bogomil：中世纪巴尔干地区（约10世纪起）的博格米尔派信徒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Bogomils, a medieval Christian sect that began in the Balkans (especially Bulgaria) in the 10th century and later influenced other dualist movements in Europe.","zh":"博格米尔派信徒；指中世纪起源于巴尔干（尤以保加利亚）的一支基督教异端/教派（约10世纪），后来影响了欧洲其他二元论运动。"},"examples":[{"en":"The Bogomils were often persecuted by both church and state authorities.","zh":"博格米尔派信徒常常遭到教会与世俗政权的迫害。"},{"en":"Some historians compare Bogomil beliefs with later movements in Western Europe.","zh":"一些历史学者会把博格米尔派的信仰与后来西欧的运动进行比较。"}]}],"synonyms":["Bogomilist","member of the Bogomils"],"phonetic":"/ˈbɑɡoʊˌmɪl/","extraExplanation":["“Bogomil”也常用来指“博格米尔派”（the Bogomils / Bogomilism）整体或其思想体系。词源一般认为来自斯拉夫语人名/称号，意为“上帝所爱/神所钟爱”（常解释为 bog ‘神’ + mil ‘爱/亲爱’）。","在历史语境中，Bogomilism 常被描述为带有强烈的“二元论”色彩（善与恶、精神与物质对立），并强调简朴生活；它在中世纪宗教史研究中常与保罗派（Paulicians）、卡特里派（Cathars）等并列讨论。","阅读史料或文学/历史写作时，你可能会见到形容词形式 Bogomil 或名词 Bogomilist（博格米尔派信徒），以及 the Bogomils（该教派成员的复数总称）。"]}
{"word":"bogomil","summary":{"en":"Bogomil refers to a medieval Bulgarian religious group (or a member of it) and also describes things connected to that movement.","zh":"Bogomil 指中世纪起源于保加利亚的博高米尔派（或其成员），也可作形容词表示与该运动相关的。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Bogomils, a medieval Christian religious group that began in Bulgaria and was later considered heretical by orthodox churches","zh":"博高米尔派成员：中世纪起源于保加利亚的一支基督教宗教团体，后来被正统教会视为异端"},"examples":[{"en":"Some historians connect the spread of Bogomil ideas to later European religious movements.","zh":"一些历史学家认为，博高米尔派思想的传播与后来的欧洲宗教运动有关联。"},{"en":"The text describes a Bogomil community in the Balkans.","zh":"这篇文本描述了巴尔干地区的一个博高米尔派社群。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Bogomils or their beliefs","zh":"博高米尔派的；与博高米尔派或其信仰有关的"},"examples":[{"en":"Researchers study Bogomil manuscripts and church records.","zh":"研究者会研究博高米尔派手稿与教会档案。"},{"en":"The region contains traces of Bogomil influence.","zh":"该地区留有博高米尔派影响的痕迹。"}]}],"synonyms":["Bogomilism","Bogomilist"],"phonetic":"/ˈbɑːɡəˌmɪl/","extraExplanation":["“Bogomil”来自古保加利亚语的人名/称号（常被解释为“上帝所爱/神所爱”之意），这一运动大约兴起于10世纪的保加利亚，并在巴尔干地区传播。","在很多概述中，博高米尔派常被归为带有“二元论”倾向的基督教异端传统：倾向强调善恶/灵与物的对立，生活方式较为禁欲，反对某些教会权威与仪式。不同史料细节不完全一致，学习时可注意来源差异。","该词多用于历史、宗教史、巴尔干研究等语境，日常英语中不常见；大写“Bogomil”通常指群体或成员，小写“bogomil”（较少见）可能作形容词使用。"]}
{"word":"Bogomile","summary":{"en":"“Bogomile” refers to a Bogomil—someone belonging to the medieval Bogomil religious movement in the Balkans.","zh":"“Bogomile”指博戈米尔派成员，即中世纪巴尔干地区博戈米尔宗教运动的信徒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Bogomils, a medieval Christian religious movement (mainly in the Balkans) often described as dualist and considered heretical by the established church","zh":"博戈米尔派（Bogomils）的成员；博戈米尔派是中世纪主要流行于巴尔干地区的一支基督教宗教运动，常被描述为二元论思想，并被当时的正统教会视为异端"},"examples":[{"en":"Some historians link the Bogomils to later religious movements in the region.","zh":"一些历史学家把博戈米尔派与该地区后来的宗教运动联系起来。"},{"en":"In the novel, a wandering Bogomile preacher challenges the local clergy.","zh":"在小说里，一位四处游走的博戈米尔派传道者向当地神职人员发起挑战。"}]}],"synonyms":["Bogomil","Bogomils","Bogomilist"],"phonetic":"/ˈbɔɡəˌmɪl/","extraExplanation":["“Bogomile”更常见的拼写是“Bogomil”（单数）和“Bogomils”（复数）。如果你是在阅读历史/文学文本里看到“Bogomile”，它可能是旧拼写、地区拼写，或作者刻意使用的变体。","Bogomilism（博戈米尔主义）大约兴起于10世纪的保加利亚，后来影响到巴尔干多地。它常被概括为带有“善恶二元对立”的宗教观（具体观点在不同文献中描述不一），因此在当时与官方教会关系紧张。","词源通常解释为斯拉夫语背景的名字/称呼，常被理解为“受上帝喜爱的人/神所爱的”（大意），所以在英语里也常作为历史名词出现。"]}
{"word":"bogomile","summary":{"en":"Bogomile is a rare word for sweet gale (bog myrtle), a fragrant shrub that grows in bogs.","zh":"Bogomile 是较少见的词，指甜香桃叶蜡梅/沼泽香桃木（sweet gale / bog myrtle），一种生长在沼泽地、带香气的灌木。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a shrub that grows in wet, boggy places, especially the plant sweet gale (bog myrtle), once used to scent beer and as an insect repellent","zh":"生长在沼泽湿地的灌木，尤指“甜香桃叶蜡梅/沼泽香桃木”（sweet gale / bog myrtle），过去常用于给啤酒增香或驱虫"},"examples":[{"en":"Sweet gale (bogomile) grows well in cold, wet bogs.","zh":"甜香桃叶蜡梅（bogomile）在寒冷潮湿的泥炭沼泽里长得很好。"},{"en":"Historically, bogomile was sometimes added to beer for aroma before hops became common.","zh":"在啤酒花普及之前，人们曾经把 bogomile 加进啤酒里增添香气。"},{"en":"The leaves of bogomile have a strong scent that can help keep insects away.","zh":"bogomile 的叶子气味很浓，有助于驱赶昆虫。"}]}],"synonyms":["bog myrtle","sweet gale"],"phonetic":"/ˈbɔɡəˌmaɪl/","extraExplanation":["“bogomile”在现代英语中非常少见，多见于地方性用法或旧文献里；更常见的名称是“bog myrtle”或“sweet gale”。","词源上可理解为“bog（沼泽）+（myrtle/类似桃金娘的植物）”，指生长在湿地、带香气的灌木。"]}
{"word":"Bogomilian","summary":{"en":"Bogomilian means “related to the Bogomils” or “a follower of the Bogomils,” a medieval religious movement from Bulgaria.","zh":"Bogomilian 指“与鲍格米尔派有关的”或“鲍格米尔派信徒”；鲍格米尔派是起源于中世纪保加利亚的一种宗教运动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Bogomils, a medieval Christian religious movement that began in Bulgaria and spread through the Balkans.","zh":"与“鲍格米尔派（Bogomils）”有关的；指一种起源于中世纪保加利亚并传播到巴尔干地区的基督教宗教运动。"},"examples":[{"en":"Some historians discuss Bogomilian ideas when describing religious life in the medieval Balkans.","zh":"一些历史学家在描述中世纪巴尔干的宗教生活时会谈到鲍格米尔派（Bogomilian）的思想。"},{"en":"The novel uses a Bogomilian legend to create an atmosphere of mystery.","zh":"这部小说借用一个鲍格米尔派的传说来营造神秘氛围。"}]},{"partOfSpeech":"n.","definition":{"en":"A member or follower of the Bogomils.","zh":"鲍格米尔派成员；鲍格米尔派信徒。"},"examples":[{"en":"The record mentions a Bogomilian living near the border region.","zh":"史料提到一位居住在边境地区的鲍格米尔派信徒。"}]}],"synonyms":["Bogomil","Bogomilist","Bogomilism (related term)"],"phonetic":"/ˌboʊɡəˈmɪliən/","extraExplanation":["“Bogomilian”来自“Bogomil”（常被解释为“上帝所爱/上帝的朋友”一类的含义），指10世纪左右在保加利亚兴起的宗教团体及其思想。它在历史写作中常与“二元论（善与恶两种力量）”“反对部分教会制度与仪式”“强调清贫与简朴”等描述一起出现。不同学者对其具体教义与影响范围的说法会有差异。"]}
{"word":"bogomilian","summary":{"en":"Bogomilian means “connected with the medieval Bogomils” or “a member of that movement.”","zh":"Bogomilian 指“与中世纪波高米尔派有关的”，也可指“波高米尔派成员”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Bogomils, a medieval Christian movement that began in Bulgaria and spread through the Balkans.","zh":"与“波高米尔派（Bogomils）”有关的；指一种起源于中世纪保加利亚并传播到巴尔干地区的基督教运动。"},"examples":[{"en":"Some historians study Bogomilian ideas to understand religious conflicts in the medieval Balkans.","zh":"一些历史学家研究波高米尔派的思想，以理解中世纪巴尔干地区的宗教冲突。"},{"en":"The text contains Bogomilian themes of rejecting worldly power.","zh":"这篇文本包含波高米尔派拒绝世俗权力的主题。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who belonged to the Bogomil movement.","zh":"波高米尔派成员；属于波高米尔运动的人。"},"examples":[{"en":"Records mention a Bogomilian who traveled to preach in neighboring regions.","zh":"史料提到一位波高米尔派成员曾前往邻近地区传教。"},{"en":"In the novel, a Bogomilian character is portrayed as an outsider.","zh":"在小说中，一位波高米尔派角色被描写成局外人。"}]}],"synonyms":["Bogomil (adj./n.)","Bogomilist"],"phonetic":"/ˌboʊɡoʊˈmɪliən/","extraExplanation":["“Bogomilian”来自“Bogomil（波高米尔）”，据说是该运动早期领袖或象征人物的名字；词根常被解释为斯拉夫语系中“受上帝所爱/上帝的朋友”之意（不同学者说法略有差异）。","波高米尔派常被描述为带有二元论色彩（强调善与恶的对立），并批评教会财富与世俗权力；因此在当时常被主流教会视为“异端”，相关记载多出自反对者文献，阅读时需注意立场偏见。","在英语学术写作中常见搭配有：Bogomilian doctrine（教义）、Bogomilian heresy（被称为“异端”的学说）、Bogomilian influence（影响）。"]}
{"word":"Bogomilism","summary":{"en":"Bogomilism is a medieval Balkan Christian movement known for its dualistic beliefs and rejection of established church authority.","zh":"博格米勒教派是一种中世纪巴尔干地区的基督教运动，以二元论思想及反对官方教会权威著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medieval Christian movement (mainly in the Balkans) that taught a dualistic belief: the spiritual world is good and the material world is evil, and it rejected many practices and authorities of the established church.","zh":"一种中世纪的基督教运动（主要在巴尔干地区），主张二元论信仰：精神世界为善、物质世界为恶，并拒绝许多当时官方教会的权威与宗教实践。"},"examples":[{"en":"Bogomilism spread through parts of Bulgaria and the Balkans during the Middle Ages.","zh":"博格米勒教派在中世纪传播到保加利亚及巴尔干地区的部分地区。"},{"en":"Some historians compare Bogomilism with other dualist movements in medieval Europe.","zh":"一些历史学家将博格米勒教派与中世纪欧洲的其他二元论运动作比较。"}]}],"synonyms":["Bogomil movement","Bogomils (followers)"],"phonetic":"/ˈboʊɡəˌmɪlɪzəm/","extraExplanation":["“Bogomilism”源自斯拉夫语人名“Bogomil”（常被解释为“受上帝所爱/被上帝怜悯的人”）。该运动大约兴起于10世纪的保加利亚，强调简朴信仰与反对教会等级制度，因此常与当时的东正教/拜占庭宗教与政治权威发生冲突。","它在思想上常被拿来与西欧的“Catharism（卡特里派）”并列讨论，二者都带有二元论色彩，但并不等同；在不同地区与时期，其教义与组织形式也有差异。"]}
{"word":"Bogomilist","summary":{"en":"A Bogomilist is a member of the medieval Balkan religious movement called Bogomilism.","zh":"Bogomilist 指中世纪巴尔干地区宗教运动“博戈米勒派”的信徒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a follower of Bogomilism, a medieval Christian dualist movement that began in Bulgaria and spread through the Balkans","zh":"博戈米勒派（Bogomilism）的信徒；一种起源于中世纪保加利亚并传播到巴尔干地区的基督教二元论运动的追随者"},"examples":[{"en":"The historian described the Bogomilist communities that challenged the official church.","zh":"历史学家描述了那些挑战官方教会的博戈米勒派社群。"},{"en":"In the novel, a Bogomilist is portrayed as living simply and rejecting worldly power.","zh":"在小说中，一位博戈米勒派信徒被描写为生活简朴、拒绝世俗权力。"}]}],"synonyms":["Bogomil"],"phonetic":"/ˌboʊɡoʊˈmɪlɪst/","extraExplanation":["“Bogomilist”来自“Bogomil”（博戈米勒），常被认为与斯拉夫语中“bog”（神）+“mil”（受爱/受宠）有关，含义接近“神所爱之人”。","博戈米勒派大约在10世纪兴起（保加利亚第一帝国时期），强调善与恶两种原则的对立（常被概括为“二元论”），因此在当时的东正教与政治权力体系中往往被视为异端。","在欧洲宗教史叙述中，博戈米勒派有时会被拿来与后来的卡塔尔派（Cathars）等运动并置讨论（是否存在直接影响学界仍有不同看法）。"]}
{"word":"Bogomils","summary":{"en":"Bogomils were members of a medieval Christian religious movement that began in the Balkans.","zh":"Bogomils 指中世纪起源于巴尔干地区的博戈米勒派成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Members of the Bogomil movement, a medieval Christian religious group (often described as a sect) that began in the Balkans and spread through parts of Eastern and Central Europe.","zh":"博戈米勒派成员：中世纪起源于巴尔干地区并传播到东欧与中欧部分地区的基督教宗教团体（常被称为“宗派/异端”）。"},"examples":[{"en":"The Bogomils appeared in the Balkans around the 10th century and influenced later movements in Europe.","zh":"博戈米勒派大约在10世纪出现在巴尔干地区，并影响了欧洲后来的一些宗教运动。"},{"en":"Some historians discuss the Bogomils when explaining religious conflicts in medieval Bulgaria and Bosnia.","zh":"一些历史学家在解释中世纪保加利亚与波斯尼亚的宗教冲突时会提到博戈米勒派。"}]}],"synonyms":["Bogomil (singular)"],"phonetic":"/ˈbɑɡoʊˌmiːlz/","extraExplanation":["“Bogomils”是复数形式；单数为“Bogomil”。在英语中常写作大写，因为它指特定的历史宗教群体。","关于其信仰的细节在不同史料中表述不一，但常见说法是其带有强烈的二元对立思想（善与恶、精神与物质的对立），并因此受到当时主流教会的反对与迫害。","在阅读历史或文学作品时，你可能会在讨论中世纪巴尔干宗教与政治格局、以及所谓“异端运动”的语境中遇到该词。"]}
{"word":"bogong","summary":{"en":"“Bogong” is an Australian slang slur (offensive) used to insult someone, often targeting immigrants or ethnic minorities.","zh":"“bogong”是澳大利亚俚语中的侮辱性蔑称（具冒犯性），常用于贬低移民或少数族裔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Australia, slang, offensive) A derogatory term for a person, often implying they are an immigrant (especially from Southern Europe, the Middle East, or Asia), or seen as socially “uncultured.”","zh":"（澳大利亚俚语，具冒犯性）对某人的贬称，常暗指其为移民（尤其来自南欧、中东或亚洲等），或被视为“不够体面/不够有教养”。"},"examples":[{"en":"That word is offensive—please don’t call people a “bogong.”","zh":"那个词很冒犯——请不要用“bogong”来称呼别人。"},{"en":"He apologized for using a racist slur like “bogong.”","zh":"他为自己使用像“bogong”这样的种族歧视性蔑称而道歉。"}]}],"synonyms":["slur (general)","racial slur (general)"],"phonetic":"/ˈboʊɡɔŋ/","extraExplanation":["这是澳大利亚英语中的贬义词，带有明显的歧视色彩（常涉及种族/族裔与移民身份）。在现实交流中应避免使用；理解它主要是为了识别冒犯性语言、读懂影视/文学/新闻里的语境。","词源与使用范围并不完全一致：有时被解释为来自澳洲俚语或地名（如新南威尔士的 Bogong 地区、Bogong 飞蛾等）的联想，但在现代语境里最重要的是它作为“蔑称”的功能与伤害性。","在更中性的表达上，可用 immigrant（移民）、newcomer（新来者）、person from [country/region]（来自某地的人）等；谈及偏见时可说 offensive slur（冒犯性蔑称）、racist term（种族歧视用语）。"]}
{"word":"Bogor","summary":{"en":"Bogor is a city in West Java, Indonesia, near Jakarta, famous for frequent rain and its botanical gardens.","zh":"Bogor（茂物）是印度尼西亚西爪哇的一座城市，靠近雅加达，以多雨和植物园闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in West Java, Indonesia, south of Jakarta, known for its cool, rainy climate and the Bogor Botanical Gardens (Kebun Raya Bogor).","zh":"印度尼西亚西爪哇省的一座城市，位于雅加达以南，以凉爽多雨的气候与茂密的自然环境闻名，著名景点包括茂物植物园（Kebun Raya Bogor）。"},"examples":[{"en":"We took a day trip from Jakarta to Bogor to visit the botanical gardens.","zh":"我们从雅加达去茂物一日游，参观了植物园。"},{"en":"Bogor is often called the “Rain City” because it rains so frequently.","zh":"茂物常被称为“雨城”，因为那里经常下雨。"}]}],"synonyms":["Buitenzorg (historical name)"],"phonetic":"/ˈboʊɡɔr/","extraExplanation":["“Bogor”在荷兰殖民时期常被称为 **Buitenzorg**（意为“无忧无虑”之类的感觉），你在历史资料或老地图上可能会看到这个旧名。","茂物靠近火山与高地，因此相对凉爽、湿润；当地的 **Bogor Botanical Gardens（茂物植物园）** 是东南亚非常重要的植物研究与观光地点之一。"]}
{"word":"Bogosian","summary":{"en":"Bogosian is a surname, often referring to Eric Bogosian, an American playwright and actor.","zh":"Bogosian 是一个姓氏，常指美国剧作家兼演员埃里克·博戈西安（Eric Bogosian）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name), most commonly referring to Eric Bogosian, an American playwright, actor, and writer.","zh":"一个姓氏（家族姓），最常见的指代是埃里克·博戈西安（Eric Bogosian），美国剧作家、演员与作家。"},"examples":[{"en":"I’m reading a play by Bogosian for my drama class.","zh":"我在为戏剧课读一部博戈西安的剧作。"},{"en":"Eric Bogosian is known for intense monologues and sharp social commentary.","zh":"埃里克·博戈西安以强烈的独白和犀利的社会评论而闻名。"}]}],"synonyms":["(as a surname) Bogosyan","(as a surname) Boghosian"],"phonetic":"/boʊˈɡoʊʒən/","extraExplanation":["“Bogosian”通常作为专有名词出现，不像普通词汇那样有固定的词义与词性变化。常见写法为首字母大写。","埃里克·博戈西安（Eric Bogosian, 1953–）是亚美尼亚裔美国人，以独角戏/独白风格作品和对美国社会文化的观察而知名；在影视中也有演出。"]}
{"word":"Bogot","summary":{"en":"Bogotá: the capital of Colombia.","zh":"Bogotá：哥伦比亚首都。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Bogotá, the capital city of Colombia (often misspelled as “Bogot”).","zh":"波哥大（Bogotá），哥伦比亚的首都（常被误拼为“Bogot”）。"},"examples":[{"en":"I flew to Bogotá for a business conference.","zh":"我飞到波哥大参加一个商务会议。"},{"en":"Bogotá is known for its high altitude and cool weather.","zh":"波哥大以海拔高、天气凉爽而闻名。"}]}],"phonetic":"/boʊɡəˈtɑ/","extraExplanation":["“Bogotá”来自西班牙语，正确拼写通常带重音符号（á），表示重读在最后一个音节：bo-go-TÁ。英语里也常保留这个重音符号，但在不方便输入时有时会省略写成“Bogota”。","“Bogot”一般被视为不完整或误拼；如果你指的是这座城市，建议使用“Bogotá/Bogota”。"]}
{"word":"Bogota","summary":{"en":"Bogotá is the capital city of Colombia.","zh":"波哥大是哥伦比亚的首都城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The capital city of Colombia, located high in the Andes Mountains; a major political, cultural, and economic center of the country.","zh":"哥伦比亚的首都，位于安第斯山脉高原；是该国重要的政治、文化与经济中心。"},"examples":[{"en":"Bogotá is the capital of Colombia.","zh":"波哥大是哥伦比亚的首都。"},{"en":"Because Bogotá is at a high altitude, the weather can feel cool even near the equator.","zh":"由于波哥大海拔很高，即使靠近赤道，天气也可能偏凉。"},{"en":"She flew into Bogotá for a business conference.","zh":"她飞到波哥大参加商务会议。"}]}],"phonetic":"/ˌboʊɡəˈtɑ/","extraExplanation":["英语中常见两种写法：Bogotá（带重音符号 á）与 Bogota（不带重音）。在西班牙语里重音落在最后一个音节 -tá，因此常写作 Bogotá。","波哥大海拔约 2,600 米左右，旅行时有些人会出现轻微高原反应（如头痛、气喘），属于常见的旅行背景知识。"]}
{"word":"bogota","summary":{"en":"Bogotá: the capital and largest city of Colombia.","zh":"Bogotá：哥伦比亚的首都与最大城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The capital and largest city of Colombia, located high in the Andes Mountains.","zh":"波哥大（Bogotá）：哥伦比亚的首都和最大城市，位于安第斯山脉的高原地区。"},"examples":[{"en":"Bogotá is the capital of Colombia.","zh":"波哥大是哥伦比亚的首都。"},{"en":"It can feel cool in Bogotá because of its high altitude.","zh":"由于海拔很高，波哥大的天气可能会感觉偏凉。"}]}],"synonyms":["Santa Fe de Bogotá"],"phonetic":"ˌboʊɡəˈtɑː","extraExplanation":["“Bogotá”通常写作带重音符号的“á”（Bogotá），表示重音在最后一个音节（-tá）。英语里常见两种写法：Bogotá（更标准）和 Bogota（省略重音）。","波哥大海拔约 2,600 米（8,500 英尺）左右，因此气候比许多人想象的热带城市更凉爽。","名称源自当地原住民语言（穆伊斯卡语）的地名表达，后来在西班牙语中演变为今天的拼写与读音。"]}
{"word":"Bogotan","summary":{"en":"Bogotan means a person from Bogotá or something related to Bogotá, Colombia.","zh":"Bogotan 指“波哥大人”或“波哥大的、与波哥大有关的”（哥伦比亚首都波哥大）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Bogotá, the capital city of Colombia","zh":"波哥大人；来自哥伦比亚首都波哥大的人"},"examples":[{"en":"Many Bogotans commute long distances across the city every day.","zh":"许多波哥大人每天都要在城里通勤很长的距离。"},{"en":"She’s a Bogotan who moved to the U.S. for graduate school.","zh":"她是波哥大人，后来为了读研搬到了美国。"}]},{"partOfSpeech":"adj.","definition":{"en":"from or relating to Bogotá","zh":"波哥大的；与波哥大有关的"},"examples":[{"en":"Bogotan cuisine often includes hearty soups like ajiaco.","zh":"波哥大的饮食常常包括像 ajiaco 这样的浓汤。"},{"en":"The museum features Bogotan artists and photographers.","zh":"这家博物馆展出波哥大的艺术家和摄影师作品。"}]}],"synonyms":["people from Bogotá","Bogotá resident","Bogotá-born (adj.)"],"phonetic":"/ˌboʊɡəˈtɑn/","extraExplanation":["“Bogotan”是英文里表示“波哥大（Bogotá）的人/事物”的称呼（demonym）。更正式、也很常见的写法是“Bogotá resident / people from Bogotá”。在新闻或学术写作中也会见到“Bogotano/Bogotana”（西班牙语形式），英语里偶尔借用。"]}
{"word":"bogotana","summary":{"en":"Bogotana means a woman from Bogotá (Colombia), and can also describe something related to a female Bogotan identity.","zh":"bogotana 指“来自哥伦比亚首都波哥大的女性”，也可作形容词表示“与波哥大女性身份有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman or girl from Bogotá, the capital city of Colombia; a female Bogotan.","zh":"来自哥伦比亚首都波哥大（Bogotá）的女性；波哥大女性居民。"},"examples":[{"en":"She’s a bogotana who moved to Miami for work.","zh":"她是一位来自波哥大的女性，为了工作搬到了迈阿密。"},{"en":"The novel follows a young bogotana during the 1990s.","zh":"这部小说讲述了一位年轻的波哥大女孩在20世纪90年代的经历。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to a woman from Bogotá, or to the female form of Bogotá’s local identity.","zh":"与波哥大女性（或波哥大这一地方身份的阴性形式）有关的。"},"examples":[{"en":"They discussed bogotana culture, food, and slang.","zh":"他们聊到波哥大女性的文化、食物和俚语。"},{"en":"Her bogotana perspective shaped how she described the city.","zh":"她以波哥大女性的视角来描写这座城市。"}]}],"synonyms":["Bogotan (female)","woman from Bogotá","Bogotá native (female)"],"phonetic":"/ˌboʊɡoʊˈtɑːnə/","extraExplanation":["“bogotana”来自西班牙语，是对波哥大（Bogotá）人的称呼（demonym）的阴性形式；对应的阳性形式是“bogotano”。","在英语里更常见、也更中性的说法是“Bogotan”（不强调性别）；“bogotana”多见于西语语境、拉美文化讨论或强调女性身份时。","拼写通常保留原地名的重音符号：Bogotá；但在英语文本中有时会省略重音符号写成 Bogota。"]}
{"word":"bogs","summary":{"en":"“Bogs” usually means wet, spongy swampy areas; it can also be the verb form meaning “to get stuck” or “to slow down.”","zh":"“bogs”通常指泥沼/沼泽地；也可作动词形式，表示“陷住”或“拖慢进度”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"wet, soft ground (a type of swamp), often covered with moss; plural of “bog.”","zh":"（长满苔藓、地面松软的）泥沼地；沼泽；“bog”的复数。"},"examples":[{"en":"The hikers avoided the bogs because the ground could swallow a boot.","zh":"徒步者避开那些泥沼地，因为松软的地面可能把靴子陷进去。"},{"en":"Northern Scotland has many bogs and peatlands.","zh":"苏格兰北部有许多泥沼地和泥炭地。"}]},{"partOfSpeech":"v.","definition":{"en":"to make someone or something stuck or slowed down; third-person singular of “bog.”","zh":"（使）陷住；（使）进展受阻；“bog”的第三人称单数形式。"},"examples":[{"en":"Too much paperwork bogs the team down.","zh":"太多文书工作会让团队进度受阻。"},{"en":"Heavy rain bogs the car in the mud.","zh":"大雨会让车陷在泥里。"}]}],"synonyms":["swamps","marshes","peatlands","mires","quagmires","bog down"],"phonetic":"/bɑɡ/","extraExplanation":["“bog”常与“peat（泥炭）”一起出现：bog/peat bog（泥炭沼泽）。也常见短语“bog down”，表示“陷入困境/被拖慢”。在爱尔兰与英国等地，泥炭沼泽具有文化与历史意义（如传统取泥炭作燃料），因此在地理与文学描写中出现频率较高。"]}
{"word":"bogsucker","summary":{"en":"“Bogsucker” is an informal, offensive insult for someone stereotyped as a rural or uncultured person.","zh":"“bogsucker”是非正式且带冒犯性的辱称，用来刻板地骂人“乡下/没文化”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, derogatory) A rude insult for a person seen as uncultured or “backward,” especially someone imagined as living in a boggy, rural place.","zh":"（非正式，贬义）对被认为“没文化、落后”的人的粗鲁辱称，尤指被想象住在沼泽、偏远乡村地区的人。"},"examples":[{"en":"He called the locals “bogsuckers,” which was offensive and unnecessary.","zh":"他把当地人叫作“bogsuckers”，这既冒犯又毫无必要。"},{"en":"Please don’t use words like “bogsucker”—it’s basically a slur for rural people.","zh":"请别用“bogsucker”这种词——它基本上是对乡下人的贬称。"}]}],"synonyms":["bog-trotter","yokel","bumpkin","hick"],"phonetic":"/ˈbɑɡˌsʌkər/","extraExplanation":["这个词不是常见标准英语词汇，更像是口语里临时拼出来的侮辱词（bog“沼泽”+ sucker“吸……的人/讨厌鬼”）。在现实交流中容易被理解为对某个地区或阶层的歧视性称呼，不建议使用。若想表达“乡下人/土气”，更中性的说法可以用 rural person / someone from the countryside；若想表达“粗鲁的人”，可用 rude person / jerk（但也要注意语气）。"]}
{"word":"bogtrot","summary":{"en":"Bogtrot means a bumpy trot through boggy, muddy ground, or to move that way (rare/old-fashioned).","zh":"bogtrot 指在沼泽泥地里颠簸地小跑（或做这种移动），属于较少见/偏旧式表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rough, jolting trot or run through muddy, boggy ground (often used humorously or in older writing).","zh":"（常带幽默或旧式用法）在泥泞沼泽地上颠簸地小跑/奔跑；也指这种“泥地小跑”的经历。"},"examples":[{"en":"After the rain, our hike turned into a bogtrot across the flooded field.","zh":"下雨后，我们的徒步变成了穿过被淹田地的一场“泥地小跑”。"},{"en":"The dog dragged me into an unexpected bogtrot along the marsh edge.","zh":"狗把我拽到沼泽边，来了一段猝不及防的泥地狂奔。"}]},{"partOfSpeech":"v.","definition":{"en":"to move at a rough trot through wet, muddy ground.","zh":"（在湿泥地里）颠簸地小跑、趟泥奔行。"},"examples":[{"en":"We bogtrotted for a minute, then found a drier path.","zh":"我们趟泥小跑了一会儿，随后找到了更干的路。"}]}],"synonyms":["trudge","slog","plod","wade"],"phonetic":"/ˈbɑɡˌtrɑt/","extraExplanation":["这是一个比较少见、偏旧式的词，带有形象感：bog（沼泽、泥地）+ trot（小跑）。在现代英语中更常见的说法是 “trudge through the mud”（在泥里跋涉）或 “run across the marsh”（穿过沼泽奔跑）。","语气通常偏轻松/调侃，用来强调“又湿又难走、走起来一颠一颠”的感觉。"]}
{"word":"bogtrotter","summary":{"en":"“Bogtrotter” is a derogatory slur for an Irish person, especially from rural Ireland.","zh":"“bogtrotter”是对爱尔兰人（尤指乡村爱尔兰人）的贬损蔑称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often derogatory) an Irish person, especially from rural Ireland; an insult suggesting someone is poor, backward, or unsophisticated.","zh":"（常为贬义）对爱尔兰人的蔑称，尤指乡村地区的爱尔兰人；暗示对方贫穷、落后或缺乏见识。"},"examples":[{"en":"The novel shows how immigrants were mocked with slurs like “bogtrotter.”","zh":"这部小说展现了移民如何被用“bogtrotter”等蔑称嘲弄。"},{"en":"Please avoid the word “bogtrotter”—it’s a derogatory term for Irish people.","zh":"请避免使用“bogtrotter”——这是对爱尔兰人的贬损用语。"}]}],"synonyms":["slur (for Irish people)","ethnic slur","derogatory term"],"phonetic":"/ˈbɑːɡˌtrɑːtər/","extraExplanation":["这个词由 bog（沼泽）+ trotter（小跑者）构成，字面有“在沼泽里跑的人”的意象，用来嘲讽爱尔兰乡村生活环境与“粗鄙/落后”的刻板印象，因此带有明显歧视性。","在现代英语中，这类族群蔑称通常不建议使用；在写作或阅读中遇到时，多用于呈现历史偏见、角色歧视或社会冲突。更中性的表达可直接说 Irish person / someone from Ireland，或具体到 region（如 from rural Ireland）。"]}
{"word":"bogtrotting","summary":{"en":"Bogtrotting means trudging through boggy ground (literally), and can also be used figuratively for slow, difficult progress.","zh":"bogtrotting 指在泥沼湿地中艰难跋涉（字面），也可比喻进展缓慢、费力。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"walking or traveling through boggy, wet ground; moving in a way that suggests slogging through mud.","zh":"在沼泽、泥泞湿地中跋涉的；（比喻）艰难缓慢地前行的。"},"examples":[{"en":"After days of rain, the hike turned into bogtrotting across the moor.","zh":"连下了几天雨后，徒步就变成了在荒原上泥沼跋涉。"},{"en":"We spent the morning bogtrotting in soaked boots to reach the cabin.","zh":"我们早上穿着湿透的靴子在泥地里跋涉，才到达小屋。"},{"en":"The project felt like bogtrotting—every step forward was heavy.","zh":"这个项目就像在泥沼里跋涉——每前进一步都很艰难。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or activity of trudging through bogs or very wet ground.","zh":"在沼泽或非常湿的地面上艰难行走的行为；泥地跋涉。"},"examples":[{"en":"Bogtrotting is common in parts of Scotland and Ireland where trails cross peatland.","zh":"在苏格兰和爱尔兰一些穿越泥炭地的小径上，泥地跋涉很常见。"},{"en":"Bring gaiters if you expect a lot of bogtrotting.","zh":"如果预计要走很多泥沼路，带上绑腿套会更合适。"}]}],"synonyms":["trudging","slogging","wading","plodding","tramping"],"phonetic":"/ˈbɑɡˌtrɑtɪŋ/","extraExplanation":["“bog-trotter”在历史上曾被用作对爱尔兰人的贬称（带有刻板印象和侮辱性）。虽然“bogtrotting”本身通常只是字面意思“在沼泽跋涉”，但在某些语境里可能让人联想到该贬称；写作或交流时建议避免用来指代人群。","这个词较少见，更多时候人们会说“trudging through a bog / slogging through mud / boggy hiking”。"]}
{"word":"Bogue","summary":{"en":"Bogue can mean a small Mediterranean sea bream, or (in some dialects) a chestnut’s spiky burr.","zh":"Bogue 可指一种地中海海鲷类小鱼，也可在部分方言中指栗子等坚果的带刺外壳（刺苞）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small silvery fish (a type of sea bream) found in the Mediterranean and eastern Atlantic; often called the “bogue.”","zh":"（鱼）一种小型银色海鱼（属海鲷类），常见于地中海及东大西洋，英语常称“bogue（博格鱼）”。"},"examples":[{"en":"We saw bogue swimming near the rocks along the Mediterranean coast.","zh":"我们在地中海海岸的礁石附近看到博格鱼在游动。"},{"en":"The restaurant served grilled bogue with lemon and herbs.","zh":"那家餐馆供应柠檬香草烤博格鱼。"}]},{"partOfSpeech":"n.","definition":{"en":"(dialect) the spiky outer covering (burr) of a chestnut or similar nut.","zh":"（方言）栗子等坚果外面带刺的壳；刺苞。"},"examples":[{"en":"Be careful—the chestnut bogue is sharp.","zh":"小心点——栗子的刺苞很扎手。"},{"en":"He kicked aside the fallen bogues to pick up the nuts.","zh":"他把掉在地上的刺苞踢开，好捡起坚果。"}]}],"synonyms":["sea bream (type)","burr","spiky husk"],"phonetic":"/boʊɡ/","extraExplanation":["“bogue”这个词在日常英语里不算常见，更常出现在地中海饮食、渔业或自然观察的语境中。","注意不要和“bogus”（假的、冒牌的）混淆：两者拼写相近，但读音和意思都不同。"]}
{"word":"bogue","summary":{"en":"“Bogue” most commonly refers to a small sea fish; informally, it can also be a nonstandard spelling meaning “fake” (like “bogus”).","zh":"“bogue”最常指一种小型海鱼；在非正式用法中，也可能是“假的”的非标准拼写（类似“bogus”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(chiefly in fishing) a small sea fish found in the Mediterranean and eastern Atlantic (also called the bogue; scientific name *Boops boops*).","zh":"（多用于钓鱼语境）一种生活在地中海及东大西洋的小型海鱼，英语也称 bogue，学名 *Boops boops*。"},"examples":[{"en":"They caught a few bogue near the rocky shore.","zh":"他们在岩石海岸附近钓到了几条 bogue（海鱼）。"},{"en":"Bogue is often used as bait for bigger fish.","zh":"Bogue 常被用作钓更大鱼类的鱼饵。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal, nonstandard spelling) fake; not genuine (a variant spelling of “bogus”).","zh":"（非正式、非标准拼写）假的；不真实的（常被视为 “bogus” 的变体拼写）。"},"examples":[{"en":"That link looks bogue—don’t click it.","zh":"那个链接看起来是假的，别点。"},{"en":"He tried to pass off a bogue story as fact.","zh":"他想把一个编造的故事当作事实来糊弄人。"}]}],"synonyms":["bogus","fake","phony"],"phonetic":"/boʊɡ/","extraExplanation":["“bogue”（表示“假的”）在英语里多见于口语、网络或特定社群的拼写变体；正式写作中更常用标准拼写 “bogus”。","“bogue”也常被当作 “bogey”（高尔夫“柏忌”）的误拼；如果你是在球赛语境看到它，可能实际想写的是 “bogey”。"]}
{"word":"Boguechitto","summary":{"en":"Boguechitto (often written “Bogue Chitto”) is a U.S. place name, especially a community in Mississippi and the name of a river.","zh":"Boguechitto（常写作 Bogue Chitto）是美国的地名，主要指密西西比州的一个社区，也指同名河流。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a community (census-designated place) in southwestern Mississippi, U.S.; also used as a local place name in the surrounding area.","zh":"美国密西西比州西南部的一个社区（人口普查指定地区）；也常作为周边地区的地名使用。"},"examples":[{"en":"She grew up near Bogue Chitto, Mississippi.","zh":"她在密西西比州的博格奇托（Bogue Chitto）附近长大。"},{"en":"We drove through Bogue Chitto on the way to the state park.","zh":"我们去州立公园的路上开车经过了博格奇托。"}]},{"partOfSpeech":"n.","definition":{"en":"Bogue Chitto River, a river name found in Mississippi (and also in Louisiana), often mentioned in local geography and outdoor recreation contexts.","zh":"博格奇托河（Bogue Chitto River），密西西比州（路易斯安那州也有同名河流）的河流名称，常见于当地地理与户外活动语境。"},"examples":[{"en":"They went tubing on the Bogue Chitto River.","zh":"他们去博格奇托河漂流了。"},{"en":"The Bogue Chitto River can rise quickly after heavy rain.","zh":"暴雨后博格奇托河的水位可能会迅速上涨。"}]}],"phonetic":"/ˌboʊɡə ˈtʃɪtoʊ/","extraExplanation":["“Bogue Chitto”源自美洲原住民语言（常被认为与乔克托语 Choctaw 有关），大意常解释为“大片/大”的意思加上“河流/溪流”的概念，因此常被理解为“（一条）大溪/大河”。\n在美国南部，bogue/bayou 等拼写常见于地名，反映了当地法语与原住民语言在地名上的历史影响。"]}
{"word":"bogued","summary":{"en":"“Bogued” is usually a misspelling of “bogged” (past of “bog”): stuck or slowed down, often in “bogged down.”","zh":"“bogued”通常是“bogged”（bog 的过去式/过去分词）的误拼：表示陷住或被拖慢，常用于“bogged down”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Common misspelling) Past tense/past participle of “bog” meaning stuck in soft ground, or slowed/stopped by too much work or difficulty; often used in “bogged down.”","zh":"（常见拼写误用）“bog”的过去式/过去分词，表示陷入泥沼而动不了；也指因事情太多或困难而进展缓慢/停滞，常见于短语“bogged down（被拖住/陷入困境）”。"},"examples":[{"en":"Our car got bogged down in the mud after the storm.","zh":"暴风雨过后，我们的车陷在泥里动不了了。"},{"en":"The project got bogged down by paperwork and delays.","zh":"这个项目被文书工作和拖延拖住了。"},{"en":"I’m getting bogged down in details—can we focus on the main idea?","zh":"我被细节绕住了——我们能不能先抓住重点？"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle form: “bogged” (not “bogued”)—to cause someone/something to become stuck or to slow down.","zh":"过去式/过去分词形式：应写作“bogged”（而不是“bogued”）——使……陷住；使……进展变慢。"},"examples":[{"en":"Heavy traffic bogged the buses down during rush hour.","zh":"高峰期的拥堵让公交车走得很慢。"},{"en":"Don’t let small problems bog you down.","zh":"别让小问题把你拖垮/拖住。"}]}],"synonyms":["stuck","mired","held up","delayed","weighed down"],"phonetic":"/bɑɡd/","extraExplanation":["“bog”原义是“泥沼、沼泽”，所以 bogged (down) 这个比喻很形象：像脚陷进泥里一样，越想快越难动。","固定搭配最常见的是“be/get bogged down (in/with something)”：表示“被……拖住/困住（多因细节、事务、程序等）”。","拼写提示：正确形式是 bog + -ed → bogged（双写 g），因为词尾是“短元音 + 单辅音”。“bogued”一般被视为拼写错误。"]}
{"word":"boguing","summary":{"en":"“Boguing” is usually a misspelling of “voguing,” a dance style of sharp, fashion-model poses from ballroom culture.","zh":"“boguing”通常是“voguing”的误拼：一种源自舞会文化、以利落的时尚模特定格姿势为特色的舞蹈风格。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Often a misspelling of) voguing: doing a dance style with sharp, model-like poses and arm movements, inspired by fashion magazines and ballroom culture.","zh":"（常见拼写误用）voguing：一种以“模特摆拍式”定格姿势、利落手臂动作与走台感为特色的舞蹈风格，源自时尚杂志与（酷儿）舞会文化。"},"examples":[{"en":"They were voguing on the dance floor, hitting a new pose on every beat.","zh":"他们在舞池里跳voguing，几乎每一下鼓点都定格一个新姿势。"},{"en":"She learned voguing from videos and practiced the hand movements in front of a mirror.","zh":"她通过视频学voguing，并在镜子前练习手部动作。"},{"en":"The performance included voguing elements, like runway walks and dramatic poses.","zh":"这场表演融入了voguing元素，比如走秀步伐和戏剧化定格姿势。"}]}],"synonyms":["posing","ballroom dancing","runway-style dancing","striking poses"],"phonetic":"/ˈvoʊɡɪŋ/","extraExplanation":["“Voguing”读音来自时尚杂志《Vogue》。这种舞蹈与美国的“ballroom（舞会/舞厅）文化”密切相关，尤其与黑人与拉丁裔酷儿社群的舞会传统有关。","在流行文化中，Madonna 的歌曲《Vogue》（1990）让这种风格被更多主流观众认识，但它的根源与社群文化背景更早、更深。","如果你看到“boguing”，大多数情况下对方想写的是“voguing”。"]}
{"word":"bogum","summary":{"en":"“bogum” most often refers to the Korean name “Bo-gum,” and online it commonly points to the celebrity Park Bo-gum.","zh":"“bogum”多半指韩语名字“Bo-gum”，在网络语境里常用来指明星朴宝剑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Korean given name (usually written as “Bo-gum”); used as a person’s name.","zh":"一个韩语名字（常写作“Bo-gum / 朴宝剑式的写法”）；用作人名。"},"examples":[{"en":"Bo-gum is a Korean name often seen in K-pop and Korean dramas.","zh":"Bo-gum 是一个常在韩流音乐和韩剧相关内容里看到的韩语名字。"},{"en":"Do you know how to pronounce Bo-gum correctly?","zh":"你知道 Bo-gum 怎么念比较准确吗？"}]},{"partOfSpeech":"n.","definition":{"en":"(most commonly online) Park Bo-gum, a well-known South Korean actor and singer.","zh":"（网络语境中最常见）指韩国知名演员、歌手朴宝剑（Park Bo-gum）。"},"examples":[{"en":"I started the drama because Park Bo-gum was in it.","zh":"我因为朴宝剑参演才开始追那部剧。"},{"en":"Park Bo-gum is known for his warm, polite public image.","zh":"朴宝剑以温暖、礼貌的公众形象而出名。"}]}],"synonyms":["Bo-gum","Bo Gum","Park Bo-gum"],"phonetic":"/ˈboʊ ɡʊm/","extraExplanation":["“bogum”更常见的写法是“Bo-gum”（分音节用连字符），属于韩语姓名的拉丁字母拼写（romanization）。不同来源可能会出现不同拼法（如Bogum / Bo Gum / Bo-gum）。","作为人名时，严格来说没有固定的英文词典释义；含义取决于对应的韩文汉字（若有使用），同名的人可能含义不同。"]}
{"word":"bogus","summary":{"en":"“Bogus” means fake or not true, often implying deception or something you shouldn’t believe.","zh":"“bogus”指“假的/不真实的”，常含“骗人或不可信”的意味，也可指“胡说”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not real, not genuine, or fake; meant to trick people.","zh":"假的；不真实的；伪造的（常指用来欺骗他人）。"},"examples":[{"en":"The website looked professional, but the product reviews were bogus.","zh":"那个网站看起来很专业，但产品评价是假的。"},{"en":"He received a bogus phone call claiming he had won a prize.","zh":"他接到一个骗局电话，说他中了大奖。"}]},{"partOfSpeech":"n.","definition":{"en":"Nonsense; something not true or not worth believing.","zh":"胡说；鬼话；不可信的说法。"},"examples":[{"en":"That’s bogus—there’s no evidence to support it.","zh":"那是胡扯——没有证据支持。"},{"en":"I’m tired of hearing bogus excuses.","zh":"我听腻了那些不靠谱的借口。"}]}],"synonyms":["fake","false","phoney","fraudulent","sham","made-up","unfounded"],"phonetic":"/ˈboʊɡəs/","extraExplanation":["“bogus”在美式英语里很常见，语气偏口语，有时带一点不耐烦或指责（比如说某个说法是“bogus”=“瞎扯/不靠谱”）。正式写作中可用“false / fraudulent / fake / unfounded”等更中性或更精确的词。","词源上常被认为与19世纪美国的江湖骗术有关（比如伪造的“矿石样品/金矿骗局”），所以它天然带有“骗钱骗信任”的味道。"]}
{"word":"Boguslawsky","summary":{"en":"Boguslawsky is a Polish surname used as a proper name in English.","zh":"Boguslawsky 是一个波兰姓氏，在英语中作为专有名词使用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Polish surname (family name). It may refer to different people with Polish heritage; without more context, it is not one specific vocabulary word in English.","zh":"一个波兰姓氏（家族姓）。它可能指不同的波兰裔人物；如果没有更多语境，它在英语里不是一个特定的词汇义项。"},"examples":[{"en":"Boguslawsky is a surname that appears in Polish family records.","zh":"Boguslawsky 是一个在波兰家族记录中会出现的姓氏。"},{"en":"I’m reading an article by Boguslawsky, but I need the first name to know which author it is.","zh":"我在读一篇 Boguslawsky 写的文章，但我需要名字才能确认是哪位作者。"}]}],"synonyms":["Bogusławski (Polish spelling)"],"phonetic":"/ˌboʊɡuːˈslɑːvski/","extraExplanation":["“Boguslawsky”常见于英文环境中对波兰姓“Bogusławski”的拼写转写；原拼写里的“ł”在英语里通常写作“l”。","在波兰语里该姓与名字“Bogusław”（大意可理解为“上帝/神的荣耀”一类的传统构词）有关；英语中通常只把它当作专有名词来用。","如果你是在书名、论文、新闻或音乐/影视片尾里看到它，给出完整句子或人物全名，我可以帮你确认具体指代并提供更贴近语境的读音与用法。"]}
{"word":"bogusness","summary":{"en":"Bogusness means the quality of being fake or deceptive.","zh":"Bogusness 指“虚假、冒牌或带欺骗性”的性质/状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being fake, false, or not genuine; lack of authenticity","zh":"虚假；伪造；不真实（缺乏真实性）"},"examples":[{"en":"The report was full of bogusness, so we couldn’t trust its conclusions.","zh":"这份报告充满了虚假内容，所以我们不能相信它的结论。"},{"en":"She could sense the bogusness of his apology right away.","zh":"她立刻就感觉到他的道歉很不真诚。"}]},{"partOfSpeech":"n.","definition":{"en":"dishonesty or fraud; the state of trying to deceive people with something untrue","zh":"欺骗性；骗局倾向（用不真实的东西误导他人）"},"examples":[{"en":"The company was sued because of the bogusness of its advertising claims.","zh":"这家公司因广告宣传的欺骗性而被起诉。"},{"en":"We should question the bogusness behind offers that sound too good to be true.","zh":"对于那些好得不真实的优惠，我们应该怀疑其背后的骗局。"}]}],"synonyms":["falseness","phoniness","fraudulence","deceptiveness","inauthenticity"],"phonetic":"/ˈboʊɡəsnəs/","extraExplanation":["“bogusness”来自形容词“bogus”（假的、冒牌的）加名词后缀“-ness”，表示“……的性质/状态”。","“bogus”在美式英语里很常用，语气多为口语、带一点批评或不屑：That’s bogus.（那是胡扯/假的）。","“bogus”的词源不太确定，19世纪美国英语中就有“伪造、假货”的意思，常与“counterfeit（伪造品）”等词语境接近。"]}
{"word":"Bogusz","summary":{"en":"Bogusz is a Polish male given name (also used as a surname), often connected to Slavic bog- (“god”) roots.","zh":"Bogusz 是波兰男性名字（也可作姓），常与斯拉夫语 bog-（“神”）词根有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Polish masculine given name and sometimes a surname.","zh":"波兰男性名字（也可作姓氏）。"},"examples":[{"en":"Bogusz is a common male name in Poland, especially in older generations.","zh":"Bogusz 是波兰较常见的男性名字，在年长一代中更常见。"},{"en":"I met Bogusz at a conference in Warsaw.","zh":"我在华沙的一场会议上认识了 Bogusz。"}]},{"partOfSpeech":"n.","definition":{"en":"a personal name historically related to Slavic roots such as bog- (“god”), seen in names expressing ideas like “God’s glory” or “God’s gift” in the broader Slavic naming tradition.","zh":"一个与斯拉夫语词根 bog-（“神”）相关的名字；在更广泛的斯拉夫命名传统中，常与“神的荣耀 / 神的赐予”等含义有关。"},"examples":[{"en":"The name Bogusz shares the bog- root with other Slavic names.","zh":"Bogusz 与其他一些斯拉夫名字一样含有 bog- 这个词根。"}]}],"synonyms":["(no true synonyms; it is a proper name)"],"phonetic":"/ˈboʊɡʊʃ/","extraExplanation":["在波兰语里，结尾的“sz”通常发类似英语“sh”的音，所以 Bogusz 常被英语使用者读作“BO-goosh”（更接近波兰语的感觉）。","Bogusz 既可能是名字也可能是姓；在正式英文写作中通常保留原拼写，不需要加重音符号。"]}
{"word":"bogway","summary":{"en":"Bogway is typically a rare proper name (surname) rather than a standard English word.","zh":"Bogway 通常是较少见的专有名词（姓氏），并非常规英语词汇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare proper name (usually a surname). It is not a standard English vocabulary word and is not commonly found in major dictionaries.","zh":"一个较少见的专有名词（多为姓氏）。它不是常见的英语词汇，主流词典中通常不收录。"},"examples":[{"en":"Ms. Bogway will speak at the meeting tomorrow.","zh":"Bogway 女士明天将在会上发言。"},{"en":"I found a researcher named Bogway in the database.","zh":"我在数据库里找到了一个姓 Bogway 的研究者。"}]}],"phonetic":"/ˈbɑɡweɪ/","extraExplanation":["“bogway”看起来更像人名/姓氏，而不是可用于一般表达的英语单词。如果你是在小说、游戏、品牌或网名里看到它，它可能是作者/创作者自造的名字。","如果你本来想查的是发音相近的词，可以告诉我上下文句子。常见的相近词有：bog（沼泽）、Bogotá（波哥大）、byway（小路/旁道）、broadway（百老汇）。"]}
{"word":"bogwood","summary":{"en":"Bogwood is ancient wood preserved in a bog, valued for its dark color and hardness.","zh":"Bogwood 指在沼泽中长期保存下来的古老木材，因颜色深、质地硬而受重视。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Wood (often oak) that has been preserved for a very long time in a bog or swamp, becoming dark, hard, and sometimes partly mineralized; it is used for carving, furniture, and decoration.","zh":"（多为橡木等）长期埋在沼泽或泥炭地中而保存下来的木材，颜色变深、质地变硬，有时部分矿化；常用于雕刻、家具和装饰。"},"examples":[{"en":"The artisan carved a small bowl from bogwood because of its deep black color.","zh":"工匠用沼泽木雕了一个小碗，因为它的黑色很深。"},{"en":"Bogwood jewelry is popular in Ireland and is often sold as a traditional craft item.","zh":"在爱尔兰，沼泽木首饰很受欢迎，常作为传统手工艺品出售。"}]}],"synonyms":["bog oak","peat-stained wood","subfossil wood"],"phonetic":"/ˈbɑɡˌwʊd/","extraExplanation":["“bogwood”常指在泥炭沼泽里保存了几百到几千年的木材，缺氧环境减缓腐烂，使木头变得更致密、颜色更深（从棕到黑）。","在爱尔兰语境中，bogwood（尤其是“bog oak”沼泽橡木）常与凯尔特风格雕刻、纪念品工艺联系在一起。"]}
{"word":"bogwoods","summary":{"en":"Bogwoods are pieces of wood preserved in peat bogs; the term is often used for dark, durable bogwood used in crafts or aquariums.","zh":"Bogwoods 指在泥炭沼泽中被天然保存的木材（沼泽木），常用于工艺品或水族造景，特点是颜色深、质地坚硬耐久。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually plural) Wood that has been naturally preserved in a bog (wet, peaty ground), often becoming dark, hard, and long-lasting.","zh":"（通常用复数）“沼泽木”：在沼泽（泥炭湿地）中被天然保存下来的木材，常变得颜色更深、更坚硬、耐久。"},"examples":[{"en":"Archaeologists found tools made from bogwoods near the ancient settlement.","zh":"考古学家在古代聚落附近发现了用沼泽木制作的工具。"},{"en":"The artist carved the sculpture from bogwoods because the grain was dense and dramatic.","zh":"这位艺术家用沼泽木雕刻作品，因为它的纹理致密、效果很强烈。"}]},{"partOfSpeech":"n.","definition":{"en":"Pieces of bogwood used as a material or decoration (especially in aquariums or crafts).","zh":"（作材料或装饰用的）沼泽木木块（尤指水族箱造景或手工制作中使用的）。"},"examples":[{"en":"He soaked the bogwoods before putting them in the aquarium.","zh":"他把沼泽木先浸泡后再放进鱼缸。"},{"en":"The shop sells bogwoods for terrariums and aquascaping.","zh":"这家店卖用于生态缸和水草造景的沼泽木。"}]}],"synonyms":["bogwood","subfossil wood","peat-preserved wood","driftwood (aquarium use)"],"phonetic":"/ˈbɑɡˌwʊd/","extraExplanation":["“bogwood”常见于爱尔兰、英国等泥炭沼泽地区：木头在缺氧、酸性强的环境里不易腐烂，会被“保存”很久，颜色常变为深褐或近黑。","在水族圈里，bogwood 也常被叫作 driftwood（沉木/流木的一类）。有些沼泽木会释放单宁（tannins），让水变成淡茶色；这对某些鱼类环境是正常的，但会影响水色。"]}
{"word":"bogwort","summary":{"en":"Bogwort is a bog-growing plant, often referring to bogbean (buckbean).","zh":"bogwort 指生长在沼泽里的植物，常用来指睡菜（bogbean/buckbean）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant that grows in a bog (wet, spongy ground); often used as a common name for bogbean (buckbean).","zh":"生长在泥炭沼泽（湿软地）里的植物；也常作为“睡菜/沼泽睡菜”（bogbean/buckbean）的俗名。"},"examples":[{"en":"In early summer, the bogwort flowers appear along the edge of the peat bog.","zh":"初夏时，沼泽边缘会开出沼泽植物（bogwort）的花。"},{"en":"Some field guides list bogbean as “bogwort,” but names can vary by region.","zh":"一些野外图鉴把睡菜写作“bogwort”，但不同地区俗名可能不一样。"}]}],"synonyms":["bogbean","buckbean","marsh plant (general)"],"phonetic":"/ˈbɑɡˌwɝt/","extraExplanation":["“Bogwort”由 bog（沼泽）+ -wort（古英语/中古英语中表示“植物、草药”的词缀）组成。-wort 也出现在一些植物名里，如 St. John’s wort（贯叶连翘）。","在植物学或自然写作里，“bogwort”有时并非严格指某一种植物，而是泛指沼泽植物；但在某些语境中会特指睡菜（Menyanthes trifoliata）。读自然类文章时，可以结合上下文或拉丁学名来确认具体指哪种植物。"]}
{"word":"bogy","summary":{"en":"“Bogy” usually means an imaginary frightening creature (a bogeyman). It can also be a less common spelling of “bogey” in golf (one over par).","zh":"“bogy”通常指想象中的吓人鬼怪（类似bogeyman）；也可作高尔夫“bogey/柏忌（多一杆）”的较少见拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(chiefly British, old-fashioned) A ghost, goblin, or imaginary frightening creature; a “bogeyman.”","zh":"（多为英式、较旧用法）鬼怪；用来吓人的想象中的怪物；“床下怪/妖怪”（bogeyman）。"},"examples":[{"en":"As a child, he thought a bogy lived in the dark closet.","zh":"小时候，他以为黑暗的衣橱里住着一个“妖怪”。"},{"en":"The story turned the harmless noise into a bogy that scared everyone.","zh":"这个故事把无害的声响说成了“鬼怪”，把大家都吓到了。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) A spelling variant of “bogey” in golf: a score of one stroke over par on a hole.","zh":"（较少见）“bogey”的拼写变体（高尔夫）：某洞成绩比标准杆多一杆。"},"examples":[{"en":"I made a bogy on the last hole, so I finished one over par.","zh":"最后一洞我打了个“柏忌”（多一杆），所以总成绩高一杆。"},{"en":"She was aiming for par but had to settle for a bogy.","zh":"她原本想保标准杆，但只能接受打出柏忌。"}]}],"synonyms":["bogey","bogeyman","goblin","ghost"],"phonetic":"/ˈboʊɡi/","extraExplanation":["“bogy”在现代英语里不算常见拼写。表示“鬼怪/吓人的东西”时，更常见的是“bogey”或“bogeyman”。","注意区分三个近形词：bogey（鬼怪；也指高尔夫的柏忌）、bogie（英式拼写常指火车转向架/起落架轮组等机械结构）、bogy（较旧或变体拼写）。在写作里通常选更常用的“bogey”。"]}
{"word":"bogydom","summary":{"en":"Bogydom means the imagined realm of bogeymen, or a state filled with irrational fears.","zh":"bogydom 指“妖怪的想象领域”，也可指充满不理性恐惧的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The imagined world or realm of “bogeys” (bogeymen)—scary, made-up figures used to frighten children; by extension, a world of exaggerated or irrational fears.","zh":"“妖怪/鬼怪（bogeyman）”的想象世界或领域；也可引申为充满被夸大或不理性恐惧的“恐惧世界”。"},"examples":[{"en":"As a kid, I thought every dark closet belonged to bogydom.","zh":"小时候我觉得每个黑暗的衣柜都属于“妖怪世界”。"},{"en":"The rumor pushed the town into bogydom, where every stranger seemed dangerous.","zh":"谣言把小镇推入了“恐惧世界”，仿佛每个陌生人都很危险。"},{"en":"Growing up helped her leave bogydom behind and face real problems.","zh":"长大让她把“恐惧世界”抛在身后，去面对真实的问题。"}]}],"synonyms":["bogeyland","realm of fears","phantom fears","boogeyman world"],"phonetic":"/ˈboʊɡiˌdɑm/","extraExplanation":["这是一个比较少见、带文学色彩的词，常见拼写也可能是 **bogeydom / bogydom**；其中 **bogy/bogey** 指“吓唬小孩的妖怪（bogeyman）”，后缀 **-dom** 表示“领域/状态”（如 *kingdom* 王国，*freedom* 自由状态）。","引申义里，它常用来批评“把问题妖魔化、被恐惧牵着走”的心态或社会氛围。"]}
{"word":"bogyism","summary":{"en":"Bogyism means irrational fear or alarmism about imaginary threats—a belief in “bogeymen.”","zh":"Bogyism 指对虚构威胁（“妖怪/假想敌”）的非理性恐惧与无端恐慌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an irrational fear or belief in imaginary threats (like a “bogeyman”); needless alarmism based on things that aren’t real or are greatly exaggerated","zh":"对“妖怪/鬼怪/假想敌”等虚构威胁的非理性恐惧或迷信；对并不存在或被夸大的危险产生的无端惊恐、危言耸听"},"examples":[{"en":"Some politicians exploit bogyism to make people fear outsiders.","zh":"一些政客利用“假想敌恐惧”（bogyism）来煽动人们害怕外来者。"},{"en":"The rumors were pure bogyism—there was no real danger at all.","zh":"这些谣言纯属无端恐慌（bogyism）——根本没有真正的危险。"},{"en":"Don’t let bogyism control your decisions; check the facts first.","zh":"别让无端恐惧（bogyism）左右你的决定；先核实事实。"}]}],"synonyms":["alarmism","irrational fear","paranoia (informal/near)","bogeyman thinking","scaremongering (BrE)"],"phonetic":"/ˈboʊɡiˌɪzəm/","extraExplanation":["这个词很少见，来自 bogy/bogey（“妖怪、鬼怪、吓唬小孩的东西”，类似 bogeyman“床底下的怪物/用来吓人的假想敌”）+ -ism（“某种主义/倾向”）。","在新闻或评论语境里，它常带批评意味：指用“虚构威胁”制造恐慌、转移注意力（例如把某群体描绘成可怕的“bogey”）。拼写上也可能见到 bogeyism。"]}
{"word":"bogyisms","summary":{"en":"Bogyisms are irrational, bogeyman-like fears or superstitions—or, more broadly, unfounded ideas people cling to like a belief system.","zh":"bogyisms 指类似“妖怪/吓人传说”的非理性恐惧或迷信；也可泛指人们固执相信的无根据怪论。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Superstitious beliefs or fears about imaginary threats (like a “bogeyman”); irrational scare-stories people tell or believe.","zh":"对“妖怪/鬼怪/恶人”（类似“bogeyman”）之类虚构威胁的迷信观念或恐惧；不理性的吓人传说或想象。"},"examples":[{"en":"The kids’ bogyisms disappeared once they realized the “monster” was just a coat on a chair.","zh":"孩子们发现“怪物”只是椅子上的一件外套后，那些吓人的迷信想象就消失了。"},{"en":"The article argues that many modern bogyisms spread quickly online and make people panic.","zh":"文章认为，许多现代的“吓人迷信”在网上传播很快，容易引发恐慌。"}]},{"partOfSpeech":"n.","definition":{"en":"Odd or unfounded ideas treated like a fixed belief system; personal “pet” fears or doctrines.","zh":"被当作固定信条的古怪或缺乏依据的想法；个人固执的“恐惧/教条”。"},"examples":[{"en":"He dismissed the rumor as one of the office’s many bogyisms.","zh":"他把那条传闻当成办公室里众多无根据的“怪论”之一而不予理会。"},{"en":"Try not to let your bogyisms control your choices—ask for evidence first.","zh":"别让你的“怪念头/无根据的恐惧”支配选择——先问证据。"}]}],"synonyms":["superstitions","irrational fears","scare stories","phantoms (figurative)","bogeyman fears"],"phonetic":"/ˈboʊɡiˌɪzəmz/","extraExplanation":["“bogyisms”是较少见的词，来自bogy/bogey（“妖怪、鬼怪、吓人的东西；bogeyman=吓唬小孩的怪人”）+ -ism（表示“主义/倾向/信念体系”）。因此它常带有“凭空吓自己或吓别人”的语感。","拼写上bogy与bogey都能见到；在高尔夫里bogey指“高于标准杆一杆”的成绩，但“bogyism(s)”在一般语境多与“bogeyman式的恐惧/迷信”相关。"]}
{"word":"bogyland","summary":{"en":"Bogyland means an imaginary place of bogeys/boogeymen—the world of made-up fears, often said humorously.","zh":"Bogyland 指“妖怪/鬼怪居住的虚构之地”，引申为“被想象出来的恐惧世界”，常带调侃或夸张意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an imaginary, scary place where bogeys/boogeymen are believed to live; the world of made-up fears (often used humorously).","zh":"（非正式）“妖怪/鬼怪”的虚构地；指人们想象出来的恐怖之地或“恐惧的世界”（常带幽默或夸张语气）。"},"examples":[{"en":"As a kid, I thought the dark closet was the entrance to Bogyland.","zh":"小时候我以为黑漆漆的衣柜就是通往“妖怪国”的入口。"},{"en":"Don’t let rumors drag you into Bogyland—check the facts first.","zh":"别让谣言把你拖进“恐惧的世界”里——先核实事实。"},{"en":"The movie isn’t that scary; your imagination is doing the Bogyland part.","zh":"那部电影没那么吓人；真正把它变成“妖怪国”的是你的想象力。"}]}],"synonyms":["boogeyland","land of make-believe fears","imaginary scary place"],"phonetic":"/ˈboʊɡiˌlænd/","extraExplanation":["“Bogyland”并不是非常常见的标准词，更像是由 bogy/bogey（指吓人的“鬼怪/妖怪”，类似 boogeyman）+ land 组合出来的说法。它通常用来形容小孩的恐惧想象，或大人用来调侃“过度担心、把事情想得很可怕”。","拼写上也可能见到 “Bogeyland / Boogeyland”，含义相近。英式英语里 bogey 还可能表示“（高尔夫）标准杆+1”，但与这里的 “Bogyland” 无关。"]}
{"word":"bogyman","summary":{"en":"A bogeyman is an imaginary scary figure used to frighten children; by extension, it can mean a person or thing unfairly portrayed as a frightening enemy.","zh":"bogeyman 指用来吓唬孩子的想象中的可怕人物；引申为被夸大成“可怕敌人/替罪羊”的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in stories for children) an imaginary scary person or monster used to frighten someone into behaving well.","zh":"（尤用于儿童故事）“妖怪/怪叔叔”等想象中的可怕人物或怪物，用来吓唬人、让人乖乖听话。"},"examples":[{"en":"As a kid, she thought the bogeyman lived under her bed.","zh":"她小时候以为“妖怪”住在床底下。"},{"en":"Don’t use the bogeyman to scare children into eating their vegetables.","zh":"别用“妖怪来了”这种说法吓孩子吃蔬菜。"},{"en":"In the movie, the bogeyman appears whenever the lights go out.","zh":"电影里一关灯，“妖怪”就会出现。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or thing that is treated as a frightening enemy or scapegoat (often in politics, media, or everyday talk).","zh":"（引申）被描述成“可怕的敌人/替罪羊”的人或事物（常见于政治、媒体或日常说法）。"},"examples":[{"en":"In some headlines, immigrants are turned into a bogeyman for economic problems.","zh":"有些新闻标题把移民塑造成经济问题的“替罪羊”。"},{"en":"After one mistake, he became the office bogeyman that everyone blamed.","zh":"一次失误后，他成了办公室里大家都怪罪的“背锅对象”。"}]}],"synonyms":["boogeyman","monster","scarecrow","bête noire","scapegoat"],"phonetic":"/ˈboʊɡimæn/","extraExplanation":["“Bogyman”常被当作非标准拼写；更常见、较规范的拼法是 **bogeyman**（英式也常见 **bogyman** 这种变体）。","在英语文化里，bogeyman 通常不是特定的“一个角色”，而是泛指“拿来吓唬小孩的可怕存在”，类似中文语境里的“妖怪/鬼/坏人会来抓你”。"]}
{"word":"bogymen","summary":{"en":"“Bogeymen” means scary imaginary figures (plural of bogeyman), or figuratively, feared scapegoats.","zh":"“bogeymen”是“bogeyman”的复数，指吓唬人的虚构怪物；也可引申为被当作恐惧对象的“替罪羊”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “bogeyman”: an imaginary scary person or creature used to frighten children into behaving; more generally, something people fear or blame without clear evidence.","zh":"“bogeyman”的复数：指用来吓唬小孩、让他们乖乖听话的虚构怪人/怪物；也可泛指人们在缺乏证据时害怕或归咎的“假想敌/替罪羊”。"},"examples":[{"en":"Some parents warn kids that bogeymen will come if they don’t go to bed.","zh":"有些家长会吓孩子：不睡觉“怪物”就会来。"},{"en":"In politics, immigrants are sometimes treated as bogeymen for society’s problems.","zh":"在政治话语里，移民有时会被当作社会问题的“替罪羊/假想敌”。"}]}],"synonyms":["monsters","imaginary threats","scapegoats"],"phonetic":"/ˈboʊɡimɛn/","extraExplanation":["你写的“bogymen”更常见的标准拼写是 **bogeymen**（也有人拼作 **boogeymen**）。单数是 **bogeyman/boogeyman**。","这个词常用于民间故事或育儿语境，相当于中文里笼统的“怪物/妖怪/鬼”，但具体形象不固定；在现代英语里也常被引申为“被夸大或被塑造出来的恐惧对象”。"]}
{"word":"bogys","summary":{"en":"“Bogey” most commonly means a golf score of one over par; it can also mean something feared, a train wheel frame (bogie), or to track/follow someone.","zh":"“Bogey”最常见指高尔夫的“柏忌”（比标准杆多一杆）；也可指令人害怕的事物、火车的转向架（bogie），或作动词表示跟踪/追踪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(golf) a score of one stroke over par on a hole; also the name of that score on a scorecard.","zh":"（高尔夫）“柏忌”：某一洞比标准杆多一杆的成绩；也指记分卡上的该成绩。"},"examples":[{"en":"I made a bogey on the 7th hole.","zh":"我在第7洞打了一个柏忌。"},{"en":"She saved bogey after landing in the rough.","zh":"她球落进长草区后，最后还是保住了柏忌。"}]},{"partOfSpeech":"n.","definition":{"en":"something that causes fear or worry; a frightening imagined thing (often like “the bogeyman”).","zh":"令人害怕或担心的东西；想象中的吓人事物（常类似“鬼怪/妖怪/床下怪物”）。"},"examples":[{"en":"For many kids, the bogey is something hiding in the dark.","zh":"对很多孩子来说，“bogey”是藏在黑暗里的可怕东西。"},{"en":"Failure became his bogey, so he avoided trying new things.","zh":"失败成了他心里的“魔障”，所以他回避尝试新事物。"}]},{"partOfSpeech":"n.","definition":{"en":"a set of wheels and a frame under a train car (also spelled “bogie,” especially in British English).","zh":"（火车）转向架/轮架（也常拼作 bogie，尤见于英式英语）。"},"examples":[{"en":"Engineers inspected the bogey before the train left the station.","zh":"火车出站前，工程师检查了转向架。"}]},{"partOfSpeech":"vt.","definition":{"en":"to follow or track someone (often used in military/police contexts).","zh":"（常用于军警语境）跟踪；追踪。"},"examples":[{"en":"The patrol plane bogeyed the ship for hours.","zh":"巡逻机跟踪那艘船好几个小时。"}]}],"synonyms":["(golf) one-over-par","double bogey","bogeyman","fear","worry","specter","track","tail","shadow"],"phonetic":"/ˈboʊɡi/","extraExplanation":["你输入的 **bogys** 通常被视为拼写错误。正确复数常见两种：**bogeys**（更常见，尤其指高尔夫“柏忌”的复数：two bogeys）和 **bogies**（也常见，尤其在英式英语或指“转向架/轮架”时）。","在高尔夫里：**par（标准杆）** → 多1杆是 **bogey（柏忌）**，多2杆是 **double bogey（双柏忌）**。"]}

