{"word":"boh","summary":{"en":"“Boh” is either an Italian-style interjection meaning “I don’t know/whatever,” or (in restaurants) “BOH,” short for “back of house.”","zh":"“boh”既可作意大利语借用感叹词，表示“我不知道/随便吧”，也可作餐饮业缩写“BOH”，指“后厨/后场”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"an interjection meaning “I don’t know,” “who knows,” or “whatever” (common in Italian; sometimes used in English conversations for a casual, indifferent tone)","zh":"（感叹词）表示“我不知道 / 谁知道呢 / 随便吧”（常见于意大利语；有时也被英语对话借用，带随意或无所谓的语气）"},"examples":[{"en":"“Are they coming tonight?” “Boh, maybe.”","zh":"“他们今晚会来吗？”“Boh，可能吧。”"},{"en":"Boh—I’m not really sure what he meant.","zh":"Boh——我也不太确定他是什么意思。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in restaurants) abbreviation for “back of house,” the kitchen and staff-only work areas","zh":"（尤指餐饮业）“Back of House”的缩写，指后厨及员工工作区（非顾客区）"},"examples":[{"en":"Please take the dirty plates to BOH.","zh":"请把脏盘子拿到BOH（后场/后厨）。"},{"en":"She works BOH, not on the dining floor.","zh":"她在BOH工作，不在前厅接待顾客。"}]}],"synonyms":["(int.) dunno","(int.) who knows","(int.) whatever","(n.) back of house"],"phonetic":"/boʊ/","extraExplanation":["意大利语里的“boh”很口语，常用来表达不确定、无所谓、或者“不想继续讨论”的态度，语气会根据上下文变化：可以是轻松耸肩式的“谁知道呢”，也可能带一点不耐烦。","餐饮行业里常把区域分为 FOH（Front of House，前厅/对客区）和 BOH（Back of House，后厨/后场）。在英文职场沟通中看到大写 BOH 时，多半是这个意思。"]}
{"word":"Bohai","summary":{"en":"Bohai most commonly refers to the Bohai Sea in northeastern China; it can also refer to the historical Bohai (Balhae) kingdom.","zh":"Bohai最常指中国东北的渤海（Bohai Sea）；也可指历史上的渤海国（Balhae）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) The Bohai Sea: a large bay of the Yellow Sea on China’s northeastern coast, near Beijing and Tianjin.","zh":"（专有名词）渤海：黄海的一部分，位于中国东北沿海、靠近北京与天津的大海湾。"},"examples":[{"en":"Tianjin is a major port city on the Bohai Sea.","zh":"天津是渤海沿岸的重要港口城市。"},{"en":"Oil and gas development has been important in parts of the Bohai Sea.","zh":"在渤海的部分海域，油气开发一直很重要。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper noun, historical) Bohai (also called Balhae): a kingdom in Northeast Asia that existed roughly from the late 7th to early 10th century.","zh":"（专有名词，历史）渤海国（亦称“Balhae”）：东北亚历史上的一个国家，大致存在于7世纪末至10世纪初。"},"examples":[{"en":"Some textbooks mention Bohai (Balhae) when discussing early Northeast Asian history.","zh":"一些教材在讲述东北亚早期历史时会提到渤海国（Balhae）。"},{"en":"Archaeological sites help researchers learn about the Bohai kingdom’s culture and trade.","zh":"考古遗址帮助研究者了解渤海国的文化与贸易。"}]}],"synonyms":["the Bohai Sea","Balhae (historical)"],"phonetic":"/ˈboʊˌhaɪ/","extraExplanation":["“Bohai”在英文里通常是汉语拼音的音译，多见于地理语境（Bohai Sea）。日常英文中也常写作“the Bohai Sea”。","历史上的“渤海国”在英文资料里常用“Balhae”这一拼写；因此读到“Bohai”时，需要结合上下文判断是“渤海（海域）”还是“渤海国（政权）”。"]}
{"word":"Bohairic","summary":{"en":"Bohairic is a dialect of Coptic (from northern Egypt) and is especially known for its use in Coptic Orthodox liturgy.","zh":"Bohairic（博海里克）是科普特语的一种方言，源自埃及北部，尤以在科普特正教会礼仪中的使用而闻名。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Bohairic dialect of Coptic, traditionally associated with northern Egypt (the Nile Delta) and widely used in the Coptic Orthodox Church.","zh":"与科普特语（Coptic）的博海里克方言有关的；该方言传统上与埃及北部（尼罗河三角洲）相关，并在科普特正教会中广泛用于礼仪。"},"examples":[{"en":"Many Coptic Orthodox hymns are sung in Bohairic.","zh":"许多科普特正教会的圣诗是用博海里克方言演唱的。"},{"en":"She is studying Bohairic texts for her research on liturgy.","zh":"她正在研究博海里克文本，以进行关于礼仪的研究。"}]},{"partOfSpeech":"n.","definition":{"en":"the Bohairic dialect of the Coptic language.","zh":"（名词）科普特语的博海里克方言。"},"examples":[{"en":"He can read Bohairic but not the Sahidic dialect.","zh":"他会读博海里克方言，但不会读撒希迪克（Sahidic）方言。"},{"en":"The manuscript is written in Bohairic.","zh":"这份手稿是用博海里克方言写成的。"}]}],"synonyms":["Bohairic Coptic","the Bohairic dialect"],"phonetic":"/boʊˈhɛrɪk/","extraExplanation":["“Bohairic”来自阿拉伯语“boḥayra”（意为“湖、湖区”），指埃及北部尼罗河三角洲一带。","在历史上，科普特语有多种方言；学术研究中常见的对比是Bohairic与Sahidic（撒希迪克，常与埃及南部相关）。","现代语境里，Bohairic最常见于宗教与语言学领域：例如礼仪、圣诗、抄本研究等。"]}
{"word":"bohairic","summary":{"en":"Bohairic is a major dialect of Coptic, especially known for its use in Coptic Christian liturgy.","zh":"Bohairic（博海里克）是科普特语的重要方言之一，尤以在科普特基督教礼仪中的使用而闻名。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Bohairic dialect of Coptic, traditionally associated with the Nile Delta in northern Egypt","zh":"（与）博海里克方言相关的；博海里克语的（科普特语的一种方言，传统上与埃及北部尼罗河三角洲地区有关）"},"examples":[{"en":"Many Coptic church hymns are preserved in the Bohairic dialect.","zh":"许多科普特教会的圣歌以博海里克方言保存下来。"},{"en":"She is studying Bohairic grammar to read old liturgical texts.","zh":"她正在学习博海里克语的语法，以阅读古老的礼仪文本。"}]},{"partOfSpeech":"n.","definition":{"en":"the Bohairic dialect of Coptic","zh":"博海里克方言（科普特语的一种方言）"},"examples":[{"en":"Bohairic became the main liturgical form of Coptic in the Coptic Orthodox Church.","zh":"博海里克方言后来成为科普特正教会中主要的礼仪用科普特语形式。"},{"en":"He can read a little Bohairic, but he is more familiar with Sahidic.","zh":"他会读一点博海里克方言，但更熟悉撒希德方言。"}]}],"synonyms":["Bohairic Coptic"],"phonetic":"/boʊˈhɛrɪk/","extraExplanation":["“Bohairic”源自阿拉伯语中对埃及北部地区（下埃及、三角洲一带）的称呼，常与科普特语的其他方言（如Sahidic/撒希德方言，多见于上埃及）对比。","在历史与宗教语境里，你更常见到“Bohairic Coptic（博海里克科普特语）”，因为它在科普特正教会的礼仪与圣歌传统中影响尤其大。"]}
{"word":"Bohannon","summary":{"en":"Bohannon is most commonly an English-language surname (family name).","zh":"Bohannon 最常见的用法是英语中的姓氏（家姓）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), used to identify a person’s family lineage; sometimes also used as a given name","zh":"（常见作）姓氏，用来表示家族/家姓；有时也会被当作名字使用"},"examples":[{"en":"My history teacher’s last name is Bohannon.","zh":"我历史老师的姓是 Bohannon。"},{"en":"In the credits, she is listed as Maria Bohannon.","zh":"在演职员表里，她被写作 Maria Bohannon。"}]}],"phonetic":"/boʊˈhænən/","extraExplanation":["“Bohannon”主要作为英语世界中的姓氏出现（在美国较常见）。在正式场合可用 Mr./Ms./Dr. Bohannon 来称呼。","在流行文化中，你可能见过虚构人物名叫 Cullen Bohannon（美剧《Hell on Wheels》中的角色），这也让这个姓氏更为人熟悉。"]}
{"word":"Bohaty","summary":{"en":"“Bohaty” is most often a Ukrainian-based transliteration meaning “rich/wealthy,” and it can also appear as a surname.","zh":"“Bohaty”多见为源自乌克兰语的转写形式，意思是“富有的/有钱的”，也可能用作姓氏。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(from Ukrainian, sometimes seen as a surname or transliteration) rich; wealthy; having a lot of money or resources","zh":"（源自乌克兰语，常见于姓名或音译形式）富有的；有钱的；资源充足的"},"examples":[{"en":"In Ukrainian, “bohaty” means “rich” or “wealthy.”","zh":"在乌克兰语里，“bohaty”表示“富有的/有钱的”。"},{"en":"The article described the region as bohaty in natural resources.","zh":"文章把这个地区形容为自然资源很丰富（bohaty）。"}]},{"partOfSpeech":"n.","definition":{"en":"(as a family name) a surname that may come from a word meaning “rich/wealthy” in Slavic languages","zh":"（作姓氏）一个姓氏，可能源自斯拉夫语系中表示“富有/有钱”的词"},"examples":[{"en":"Ms. Bohaty will speak at the conference tomorrow.","zh":"Bohaty 女士将于明天在会议上发言。"}]}],"synonyms":["wealthy","rich","affluent","well-off"],"phonetic":"/boʊˈhɑːti/","extraExplanation":["“Bohaty”常出现在英文语境里是因为东欧姓名/词汇的拉丁字母转写差异：在乌克兰语转写中，字母“г”常对应英语里的“h”音（所以会看到 bohaty 这种写法），而在波兰语里相近的词常写作“bogaty”（同样有“富有的”之意）。","如果你是在特定文本中看到 “Bohaty”，它也可能只是某个人名/地名的拼写；若你提供一句原文，我可以帮你判断更准确的含义和词性。"]}
{"word":"bohawn","summary":{"en":"“Bohawn” is usually a surname (a proper name), not a standard English word with a general meaning.","zh":"“Bohawn”通常是姓氏等专有名词，不是有通用词义的常见英语单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (usually a surname). It is not a common English vocabulary word, so it typically has no dictionary meaning beyond being a family name.","zh":"专有名词（通常是姓氏）。它不是常见英语词汇，一般没有固定词典义，主要用作人名/姓氏。"},"examples":[{"en":"Ms. Bohawn will lead the meeting today.","zh":"Bohawn 女士今天将主持会议。"},{"en":"I saw the name “Bohawn” on the mailbox.","zh":"我在信箱上看到了“Bohawn”这个名字。"}]}],"synonyms":["(proper name)"],"phonetic":"/boʊˈhɑːn/","extraExplanation":["“Bohawn”在英语语料中更常见为姓氏或地名拼写的一种形式，而不是可解释的普通单词。","读音在不同家庭/地区可能不同；如果你指的是某个特定人物、品牌或地名，提供上下文（句子、国家/州、截图等）我可以更准确地判断含义与读法。","如果你原本想查的是拼写相近的词，常见的可能是：Bohannon（姓）、Bohan（姓）、Bohemia/Bohemian（波西米亚/波西米亚的）。"]}
{"word":"Bohea","summary":{"en":"Bohea is an older English word for Chinese black tea, originally from the Wuyi (Bohea) Mountains.","zh":"Bohea 是英语里的旧称，指源自中国武夷山一带的红茶，也可泛指红茶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of Chinese black tea, originally exported from the Wuyi (Bohea) Mountains in Fujian; in older English, it could also mean black tea in general.","zh":"（旧称）武夷（Bohea）产的中国红茶；在早期英语中也可泛指红茶。"},"examples":[{"en":"She served a pot of bohea tea with sugar and milk, as was common in eighteenth-century England.","zh":"她端上一壶博希亚红茶，加糖和牛奶——这是18世纪英格兰常见的喝法。"},{"en":"In old letters, you may see “bohea” used as a general word for black tea.","zh":"在旧书信里，你可能会看到“bohea”被用作“红茶”的泛称。"}]}],"synonyms":["Wuyi black tea","Chinese black tea","black tea (historical usage)"],"phonetic":"/boʊˈhiː/","extraExplanation":["“Bohea”一词来自中国福建武夷山（Wuyi Mountains）的旧式英文/外来拼写（也常写作 Bohea Hills）。18世纪英美茶叶贸易中，这个词很常见，后来随着更精确的茶类名称（如 oolong、Keemun 等）普及而逐渐变得少见或带“古旧”色彩。","在英美文学与历史材料中，“bohea”常用来营造18世纪殖民地与茶文化背景（例如谈到茶叶贸易、英式下午茶或早期北美殖民地生活时）。"]}
{"word":"bohea","summary":{"en":"Bohea is a historical English word for Chinese black tea, especially tea associated with the Wuyi area.","zh":"Bohea 是英语中的历史词，指中国红茶，尤其与福建武夷一带相关的茶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a kind of Chinese black tea, historically (especially in the 1700s–1800s) used in English to refer to tea from the Wuyi area of Fujian, China, or more generally to black tea from China","zh":"一种中国红茶；在英语里（尤其18—19世纪）常用来指福建武夷一带的茶，或更泛指来自中国的红茶"},"examples":[{"en":"The shop advertised bohea tea among its imported goods.","zh":"那家店在进口商品中宣传有“bohea（红茶）”。"},{"en":"In old letters, bohea often appears as a common household tea.","zh":"在旧信件里，bohea 常被写作家中常喝的茶。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) a lower-grade or everyday black tea, as opposed to finer teas","zh":"（历史用法）较普通或较低等级的红茶（相对更精细的茶而言）"},"examples":[{"en":"They served bohea at breakfast and saved the finer tea for guests.","zh":"他们早餐喝 bohea，把更好的茶留给客人。"}]}],"synonyms":["black tea","Chinese black tea","Wuyi tea"],"phonetic":"/boʊˈhiːə/","extraExplanation":["“Bohea”源自对“武夷”（Wuyi）的早期英语音译，常见于英美殖民时期的贸易与日常生活记录里。现代英语里这个词已经比较少用，更多会直接说“black tea（红茶）”或更具体的产地/品类（如 Wuyi black tea、Lapsang souchong 等）。","文化小知识：在18世纪的英语世界，茶叶常按贸易类别来称呼（如 bohea、souchong、congou），这些名称有时与今天按工艺/产区的分类并不完全一致。"]}
{"word":"boheas","summary":{"en":"“Boheas” is the plural of “bohea,” an old term for Chinese Wuyi black tea.","zh":"“boheas”是“bohea”的复数，指旧称的中国武夷红茶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a kind of Chinese black tea (historically from the Wuyi/Bohea region), common in older English; “boheas” is the plural form","zh":"一种中国红茶（历史上多指武夷/Bohea 地区的茶），常见于较早期英语；“boheas”为其复数形式"},"examples":[{"en":"In the 18th century, many English households drank bohea with sugar.","zh":"在18世纪，许多英国家庭会喝加糖的武夷红茶（bohea）。"},{"en":"The shop advertised fine boheas and other teas from China.","zh":"这家店宣传出售上等的 boheas（各类武夷茶）以及其他中国茶。"}]}],"synonyms":["black tea","Wuyi tea"],"phonetic":"/boʊˈhiː/","extraExplanation":["“Bohea”是英语里对“武夷（Wuyi）”茶的旧称，来自早期外销贸易中的音译/转写（武夷在旧文献中常写作 Bohea）。因此你输入的“boheas”多半是在读旧书或历史材料时出现的复数形式。","在现代英语中，这个词较少使用；更常见的说法是 “black tea（红茶）”、或具体到产地/品类如 “Wuyi tea（武夷茶）”。"]}
{"word":"Bohemia","summary":{"en":"Bohemia is a historic region in today’s Czech Republic; it can also mean an unconventional artistic community or lifestyle.","zh":"Bohemia 指当今捷克境内的历史地区“波希米亚”；也可指不拘一格的艺术家社群或“波希米亚式”生活方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historical region in Central Europe, now the western part of the Czech Republic (including Prague).","zh":"中欧的历史地区“波希米亚”，现为捷克共和国西部的一部分（包括布拉格）。"},"examples":[{"en":"Prague is the capital of the Czech Republic and the historic center of Bohemia.","zh":"布拉格是捷克共和国的首都，也是波希米亚的历史中心。"},{"en":"The castles of Bohemia attract visitors interested in European history.","zh":"波希米亚的城堡吸引了对欧洲历史感兴趣的游客。"}]},{"partOfSpeech":"n.","definition":{"en":"(often in expressions like “the world of Bohemia”) the life or community of artists and writers, especially one that is unconventional and not focused on money or social rules.","zh":"（常见于“the world of Bohemia”等表达）“波希米亚式”的艺术家/作家圈子或生活方式：不拘一格、反传统，较不强调金钱或社会规范。"},"examples":[{"en":"In college, she dreamed of living in Bohemia and writing poetry in a tiny apartment.","zh":"大学时，她梦想过上波希米亚式生活，在小公寓里写诗。"},{"en":"The novel shows the bright and difficult sides of Bohemia—freedom, but also poverty.","zh":"这部小说展现了波希米亚生活光鲜与艰难的两面：自由，但也可能贫困。"},{"en":"They left office jobs to join the world of Bohemia and make music full-time.","zh":"他们辞去办公室工作，加入波希米亚圈子，全职做音乐。"}]}],"synonyms":["Czech lands (regional)","artistic circle","bohemian life"],"phonetic":"/boʊˈhiːmiə/","extraExplanation":["“Bohemia”作为地名源自拉丁语对该地区的称呼。","英语里“Bohemia/bohemian（波希米亚式的）”与“艺术家不拘一格的生活方式”相关，这种用法在19世纪法国与英国的文学、新闻中很流行。它并不表示某种国籍，而更多是一种社会文化形象。","文学与文化中常提到：普契尼歌剧《La Bohème》（《波希米亚人》）与音乐剧《Rent》都描写了艺术家群体的“波希米亚式”生活。"]}
{"word":"bohemia","summary":{"en":"Bohemia is a Central European region; figuratively, it also means an artistic, unconventional community or lifestyle.","zh":"Bohemia既指中欧的历史地区（波希米亚），也可引申为艺术家式、不拘一格的社群或生活方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bohemia: a historic region in Central Europe (now mainly in the Czech Republic).","zh":"波希米亚：中欧的一个历史地区（现主要位于捷克共和国境内）。"},"examples":[{"en":"Prague is the largest city in Bohemia.","zh":"布拉格是波希米亚地区最大的城市。"},{"en":"Many castles in Bohemia date back to the Middle Ages.","zh":"波希米亚的许多城堡可以追溯到中世纪。"}]},{"partOfSpeech":"n.","definition":{"en":"Bohemia (figurative): a community or way of life associated with artists, writers, and other creative people, often seen as unconventional or nontraditional.","zh":"（引申义）波希米亚：指艺术家、作家等创意人群的社群或生活方式，常被认为不拘一格、反传统。"},"examples":[{"en":"In the 1920s, some young writers lived in Bohemia and focused on art instead of money.","zh":"在20世纪20年代，一些年轻作家过着“波希米亚式”的生活，把艺术看得比金钱更重要。"},{"en":"She was drawn to the Bohemia of cafés, poetry readings, and small theaters.","zh":"她被咖啡馆、诗歌朗诵会和小剧场构成的“波希米亚圈子”所吸引。"}]}],"synonyms":["(region) Czech lands (historical)","(figurative) artistic community","bohemian life","creative circle"],"phonetic":"/boʊˈhiːmiə/","extraExplanation":["“Bohemia”作为地区名源自拉丁语对这一带的称呼。英语里把艺术家式的“波希米亚生活”叫作 Bohemia，主要来自19世纪法国的文化语境：当时巴黎人把一些生活不稳定、四处漂泊的艺术家与“吉普赛人（Romani）”产生联想（虽然这种联想并不准确，也带有刻板印象）。","文学/文化中常见用法：歌剧《La Bohème》（《波希米亚人》）描写巴黎贫穷艺术青年的生活；英语里也常用 bohemian（形容词/名词）来表达“波希米亚风格、波希米亚人”。"]}
{"word":"Bohemia-Moravia","summary":{"en":"Bohemia-Moravia refers to the Czech historical lands of Bohemia and Moravia, especially in the WWII-era term “Protectorate of Bohemia and Moravia.”","zh":"Bohemia-Moravia 指波希米亚与摩拉维亚这两块捷克历史地区，尤其常见于二战时期的“波希米亚—摩拉维亚保护国”一语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A historical region in Central Europe (today mostly in the Czech Republic), referring to the Czech lands of Bohemia and Moravia; often used in the historical phrase “the Protectorate of Bohemia and Moravia” (1939–1945).","zh":"中欧的历史地区（今主要属于捷克共和国），指波希米亚与摩拉维亚两地；常见于历史用语“波希米亚—摩拉维亚保护国”（1939–1945）。"},"examples":[{"en":"My great-grandparents lived in Bohemia-Moravia before moving to the United States.","zh":"我的曾祖父母在移民美国前住在波希米亚—摩拉维亚地区。"},{"en":"The textbook discusses life under the Protectorate of Bohemia and Moravia during World War II.","zh":"这本教材讨论了二战期间在“波希米亚—摩拉维亚保护国”统治下的生活。"}]}],"synonyms":["Bohemia and Moravia","the Czech lands","Protectorate of Bohemia and Moravia"],"phonetic":"/boʊˈhiːmiə məˈreɪviə/","extraExplanation":["“Bohemia-Moravia”在英文中多见于历史语境，尤其指纳粹德国在1939年建立的“波希米亚—摩拉维亚保护国”（Protectorate of Bohemia and Moravia），大致覆盖今天捷克的波希米亚与摩拉维亚地区。","写法上常用连字符（Bohemia-Moravia），也可能写作“Bohemia and Moravia”。在正式历史文本里，通常会写全称“Protectorate of Bohemia and Moravia”。","“Bohemia”和“Moravia”也分别是地名：Bohemia（波希米亚）偏西部，Moravia（摩拉维亚）偏东部；它们与“Czechia / the Czech Republic（捷克/捷克共和国）”在现代地理概念上有重叠但并不完全等同。"]}
{"word":"Bohemian","summary":{"en":"Bohemian can mean “from Bohemia (Czech region)” or “free-spirited, artistic, unconventional,” and it can also refer to a person who lives that way.","zh":"Bohemian 既可指“波希米亚（捷克历史地区）的”，也可指“自由随性、偏艺术、非传统的（生活方式）”，还可指这样生活的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Bohemia (a historical region in today’s Czech Republic) or its people/culture","zh":"与波希米亚（今捷克境内的历史地区）或其人民、文化有关的"},"examples":[{"en":"She studies Bohemian history and culture.","zh":"她研究波希米亚的历史与文化。"},{"en":"Bohemian architecture is common in parts of Prague.","zh":"在布拉格的一些地区，常见波希米亚风格的建筑。"}]},{"partOfSpeech":"adj.","definition":{"en":"living in an informal, unconventional way, often linked to artists, writers, and a creative lifestyle","zh":"（生活方式）不拘一格、非传统的，常与艺术家、作家等自由创意生活相关的"},"examples":[{"en":"He has a bohemian lifestyle—small apartment, late nights, lots of painting.","zh":"他过着波希米亚式的生活——小公寓、熬夜、画很多画。"},{"en":"The café attracts bohemian crowds: musicians, poets, and designers.","zh":"这家咖啡馆吸引很多波希米亚人群：音乐人、诗人和设计师。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who lives in an unconventional, artistic, or free-spirited way","zh":"过着不拘一格、偏艺术/自由精神生活的人；“波希米亚人”"},"examples":[{"en":"In college, she was a bohemian who wrote poetry and played guitar in parks.","zh":"大学时她是个波希米亚人，在公园里写诗、弹吉他。"}]}],"synonyms":["unconventional","free-spirited","artistic","nonconformist"],"phonetic":"/boʊˈhiːmiən/","extraExplanation":["“bohemian（波希米亚）”有两条常见线索：一条是地理与民族含义（Bohemia，历史上属神圣罗马帝国/后与捷克相关）；另一条是文化含义，19世纪欧洲（尤其巴黎）把贫穷但追求艺术与自由的创作者群体称为“波希米亚人”，后来这个词就延伸为“随性、不守常规的艺术生活方式”。","在文学与艺术中，“bohemian life”常被浪漫化或批判性描写。相关经典作品包括普契尼歌剧《La Bohème》（《波希米亚人》），讲述年轻艺术家在城市中追梦与恋爱的生活。"]}
{"word":"bohemian","summary":{"en":"Bohemian means a free-spirited, unconventional person or style, often associated with artists and creative life.","zh":"Bohemian 指波西米亚式的人或风格：自由随性、不拘传统，常与艺术与创意生活相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who lives in an informal, unconventional way, often connected with art, music, or writing rather than a traditional career or lifestyle.","zh":"波西米亚式的人；指生活方式不拘一格、较不传统的人，常与艺术、音乐或写作圈有关。"},"examples":[{"en":"After college, he lived like a bohemian, playing music at night and painting during the day.","zh":"大学毕业后，他过着波西米亚式的生活：晚上演出音乐，白天画画。"},{"en":"The café became a meeting place for bohemians and young poets.","zh":"那家咖啡馆成了波西米亚人和年轻诗人的聚会地。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to an artistic, free-spirited, and unconventional lifestyle; often used for fashion or home style (e.g., “bohemian dress,” “boho decor”).","zh":"波西米亚风格的；指艺术气息浓、自由随性、非传统的生活方式或穿搭/家居风格（如“波西米亚连衣裙”“波西米亚家装”，也常说 boho）。"},"examples":[{"en":"She wore a bohemian skirt with bright colors and loose fabric.","zh":"她穿了一条波西米亚风的半身裙，颜色鲜艳、布料宽松。"},{"en":"Their apartment has a bohemian feel—plants, candles, and mismatched furniture.","zh":"他们的公寓很有波西米亚感觉：绿植、蜡烛，还有不成套的家具。"}]}],"synonyms":["free-spirited","unconventional","artsy","nonconformist","boho (informal)"],"phonetic":"/boʊˈhiːmiən/","extraExplanation":["“Bohemian”一词在英语里常用来形容“艺术家式、随性、不拘传统”的生活与审美。它在历史上与法国社会对“波希米亚（Bohemia）”的误解有关：19世纪巴黎把一些流动艺人、边缘群体与“来自波希米亚的人”联系起来，后来逐渐演变成“放浪不羁的艺术生活方式”的文化标签。","现代口语和时尚语境中常缩写为“boho”（如 boho style/boho chic），语气通常更偏“穿搭风格”，不一定真的指某人的生活状态。"]}
{"word":"bohemian-style","summary":{"en":"“Bohemian-style” describes a relaxed, artistic, unconventional look, especially in fashion and home decor.","zh":"bohemian-style 指带有随性、艺术感与不拘一格气质的“波西米亚风”，常用于穿搭与家居风格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to a free-spirited, artistic, and unconventional lifestyle; in fashion or design, using relaxed shapes, natural fabrics, earthy colors, and mixed patterns.","zh":"与自由不羁、艺术气质和不拘一格的生活方式有关；在穿搭或室内设计中，指宽松舒适的版型、天然材质、大地色系，以及混搭图案的风格。"},"examples":[{"en":"She decorated her apartment in a bohemian-style mix of vintage rugs, plants, and handmade art.","zh":"她把公寓布置成波西米亚风：复古地毯、绿植和手工艺术品混搭在一起。"},{"en":"Bohemian-style dresses are usually loose and flowy, often with floral prints.","zh":"波西米亚风的连衣裙通常宽松飘逸，常见碎花图案。"},{"en":"He prefers bohemian-style cafes with warm lighting and mismatched furniture.","zh":"他更喜欢波西米亚风的咖啡馆：灯光温暖，家具不成套却很有味道。"}]}],"synonyms":["boho","free-spirited","artsy","eclectic","unconventional"],"phonetic":"/boʊˈhiːmiən staɪl/","extraExplanation":["“bohemian（波西米亚）”在英语里常用来形容“艺术家气质、反主流、随性”的生活方式与审美，并不一定与捷克的波希米亚地区（Bohemia）有直接关系。现代语境里，bohemian-style 多用于时尚与室内设计，也常简写为 “boho style”。","搭配提示：bohemian-style + clothing/dress/skirt (穿搭)；bohemian-style + decor/interior/living room (家居)；也可说 “in a bohemian style” 表示“以波西米亚风格”。"]}
{"word":"Bohemian-tartar","summary":{"en":"An old-fashioned label for an eccentric, bohemian person who is also seen as tough or unruly.","zh":"一种旧式称呼：形容既艺术放纵又强悍难管的“怪才/不羁之人”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(old-fashioned, often humorous) A person seen as both “Bohemian” (artistic, unconventional) and “Tartar/Tatar” (tough, wild, or fierce); used as a colorful label for someone unruly, eccentric, and hard to manage.","zh":"（旧式用法，常带幽默色彩）指一个被认为既“波西米亚式”（艺术气、反传统）又像“鞑靼/塔塔尔人”（强悍、野性、难对付）的人；用来形容一个放纵不羁、古怪、不好惹的人。"},"examples":[{"en":"He dressed like a poet and argued like a fighter—everyone called him a Bohemian-tartar.","zh":"他穿得像诗人、吵起架来像斗士——大家都叫他“Bohemian-tartar”。"},{"en":"The editor didn’t want a Bohemian-tartar on staff: too talented, but too unpredictable.","zh":"主编不想让一个“Bohemian-tartar”进编辑部：太有才，但太不可预测。"}]}],"synonyms":["bohemian","maverick","free spirit","unruly person","a handful"],"phonetic":"/boʊˈhiːmiən ˈtɑrtər/","extraExplanation":["“Bohemian”在英语里常指不拘世俗、追求自由的艺术圈生活方式；“Tartar/Tatar”历史上指中亚民族，但在旧英语里也常被引申为“凶悍、难对付的人”。把两者并在一起，是一种带刻板印象的夸张说法，多见于19世纪到20世纪初的文字或戏谑语境。","现代英语里这个词组非常罕见；若要表达相近意思，更常用的说法有：bohemian, wild, unruly, maverick, a handful 等（语气更中性）。"]}
{"word":"bohemianest","summary":{"en":"“Bohemianest” means “most bohemian”—the most unconventional, artistic, and free-spirited in style or lifestyle.","zh":"“bohemianest”意为“最波希米亚的”——在风格或生活方式上最不拘一格、最具艺术与自由随性气质的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Superlative of “bohemian”) Most bohemian; having the strongest “bohemian” style—very unconventional, artistic, and free-spirited.","zh":"（“bohemian”的最高级）最波希米亚的；最具不拘一格、艺术气质、自由随性的风格的。"},"examples":[{"en":"Out of all her outfits, the long skirt with layered jewelry is the bohemianest.","zh":"在她所有的穿搭里，那条长裙配叠戴首饰的最波希米亚。"},{"en":"Their bohemianest years were spent traveling, making art, and living cheaply.","zh":"他们最波希米亚的那些年都在旅行、创作、过简朴生活中度过。"}]}],"synonyms":["most bohemian","free-spirited","unconventional","artistic","boho (informal)"],"phonetic":"/boʊˈhiːmiənɪst/","extraExplanation":["“bohemianest”在现代英语中很少见，更常见的表达是“most bohemian”。在正式写作或考试中，建议用“most bohemian”。","注意大小写：Bohemian（大写）常指“波希米亚（地区/民族/语言）”相关；bohemian（小写）更常指“生活方式/审美风格”上的不拘一格、艺术家气质。","“bohemian”在流行文化中也常被缩写为“boho”（如boho style/boho chic），口语里更常用。"]}
{"word":"Bohemianism","summary":{"en":"Bohemianism is an unconventional, art-centered lifestyle that values creativity and personal freedom over social rules and material success.","zh":"Bohemianism 指一种以艺术与自由为核心、强调不拘常规、相对淡泊物质与社会规训的生活方式与观念。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A way of life and set of attitudes associated with artists and writers, emphasizing creativity, personal freedom, and living unconventionally (often with little concern for money or social rules).","zh":"（常指艺术家、作家等的）波西米亚式生活方式与观念：强调创意、个人自由与不拘常规（常常不太在意金钱或社会规范）。"},"examples":[{"en":"In college she was drawn to bohemianism—late-night poetry readings, thrift-store clothes, and a life focused on art.","zh":"大学时她被波西米亚主义吸引：深夜诗歌朗读、二手店穿搭，以及以艺术为中心的生活。"},{"en":"The neighborhood’s cafés became a meeting place for bohemianism and new ideas.","zh":"那片街区的咖啡馆成了波西米亚式生活与新思想的聚集地。"}]}],"synonyms":["artistic lifestyle","nonconformity","counterculture","unconventional life"],"phonetic":"/boʊˈhiːmiəˌnɪzəm/","extraExplanation":["“Bohemianism”源于“Bohemian（波希米亚的）”。19世纪法国曾把一些生活漂泊、衣着随意的艺术家称作“bohémien”，带有“像吉普赛人/罗姆人一样流浪”的想象（这类说法在今天可能带有刻板印象，因此现代语境中更常指“非主流、艺术圈的自由生活方式”，而不指某个族群）。","文化语境：英语里常把19世纪巴黎的艺术圈与“bohemianism”联系在一起；在文学与流行文化中，它也常与“咖啡馆文化、诗歌/音乐/绘画、反传统、自由恋爱、简朴甚至清贫”等意象并列出现。","常见搭配：bohemian lifestyle（波西米亚式生活）、bohemian artist（波西米亚派艺术家/不拘常规的艺术家）、a spirit of bohemianism（波西米亚精神）。注意：bohemian（小写）多指生活风格；Bohemian（大写）也可能指“波希米亚地区的/捷克相关的”。"]}
{"word":"bohemianism","summary":{"en":"Bohemianism means an unconventional, artistic lifestyle—often relaxed about rules and money—and can also refer to the 19th‑century bohemian cultural movement.","zh":"Bohemianism 指不拘传统、偏艺术化的波希米亚式生活态度，也可指19世纪的波希米亚文化潮流。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lifestyle or attitude often linked to artists and writers, marked by nontraditional values, creativity, and a relaxed approach to money, work, and social rules","zh":"（常与艺术家、作家相关的）波希米亚式生活方式或态度；强调不拘传统、重视创造力、对金钱与社会规范较为随性"},"examples":[{"en":"In college, she was drawn to bohemianism—secondhand clothes, late-night poetry, and cheap coffee.","zh":"大学时，她被波希米亚主义吸引：穿二手衣、深夜写诗、喝便宜咖啡。"},{"en":"The neighborhood’s bohemianism made it a home for galleries, musicians, and small theaters.","zh":"这个街区的波希米亚气息让它成为画廊、音乐人和小剧场的聚集地。"}]},{"partOfSpeech":"n.","definition":{"en":"a cultural trend (especially in 19th-century Europe) associated with bohemian communities and their artistic, unconventional way of living","zh":"（尤指19世纪欧洲的）波希米亚文化潮流；与波希米亚社群及其艺术化、反传统的生活方式相关"},"examples":[{"en":"Writers of the time described bohemianism as both freedom and hardship.","zh":"当时的作家把波希米亚主义描写为既自由又艰辛。"},{"en":"Paris became a center of bohemianism for painters and poets.","zh":"巴黎曾是画家与诗人的波希米亚主义中心。"}]}],"synonyms":["nonconformity","artistic lifestyle","counterculture","free-spiritedness","unconventionality"],"phonetic":"/boʊˈhiːmiəˌnɪzəm/","extraExplanation":["“Bohemianism”里的“Bohemian（波希米亚的）”最初并不单指捷克的波希米亚地区，而是在法国等地被用来指代被认为“漂泊、离经叛道”的人群（历史上常与罗姆人/吉普赛人的刻板印象混在一起）。因此它后来更多表示一种“艺术家式的非主流生活方式”，不等同于某个民族或国籍。","19世纪法国作家亨利·缪尔热（Henri Murger）描写巴黎穷艺术家生活的作品，使“波希米亚式生活”在欧洲文化中广为人知；英语世界里也常把它和“都市文艺圈、先锋艺术、反传统生活”联系在一起。使用时可注意它既可能带有浪漫化色彩，也可能暗含经济拮据、生活不稳定。"]}
{"word":"bohemianize","summary":{"en":"Bohemianize means to make something (or someone) more Bohemian—artistic, unconventional, and free-spirited—or to live in that way.","zh":"bohemianize 指使（人/事物）变得更“波希米亚”——更具艺术感、非传统、自由不羁；也可指以这种方式生活。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make someone or something adopt a “Bohemian” style or way of life; to give a free-spirited, artistic, unconventional character","zh":"使（人或事物）变得“波希米亚式”；使具有自由不羁、艺术气质、非传统的特征"},"examples":[{"en":"After moving downtown, he started to bohemianize his wardrobe with thrift-store jackets and vintage scarves.","zh":"搬到市中心后，他开始用二手店外套和复古围巾把自己的穿着变得更波希米亚。"},{"en":"The café tried to bohemianize its image by adding poetry readings and local art on the walls.","zh":"那家咖啡馆通过举办诗歌朗读、在墙上挂本地艺术作品来让自己的形象更波希米亚。"}]},{"partOfSpeech":"vi.","definition":{"en":"to live or behave in a Bohemian way; to adopt a Bohemian lifestyle (often used humorously or critically)","zh":"以波希米亚方式生活或行事；过波希米亚式生活（常带调侃或批评意味）"},"examples":[{"en":"In his twenties, he bohemianized for a few years, traveling, painting, and taking odd jobs.","zh":"二十多岁时，他有几年过着波希米亚式生活：旅行、画画、打零工。"},{"en":"She says she wants to bohemianize, but she also likes having a steady routine.","zh":"她说想过波希米亚式生活，但她也喜欢稳定的作息。"}]}],"synonyms":["bohemianise","unconventionalize","make more bohemian","adopt a bohemian lifestyle"],"phonetic":"/boʊˈhiːmiənaɪz/","extraExplanation":["“bohemianize”比较少见，多用于写作或带一点戏谑的语气。更常见的表达是：live a bohemian life / adopt a bohemian style / make something more bohemian。","“Bohemian/bohemian”在现代英语里通常指“艺术家式、反传统、自由不羁”的生活方式；这个含义来自19世纪法国对艺术圈生活的想象性称呼，与中欧的“波希米亚（Bohemia）”地名有关，但日常用法多不指具体地区。"]}
{"word":"bohemians","summary":{"en":"“Bohemians” usually means unconventional, artsy people; it can also mean people from Bohemia. “Bohemian” can also be an adjective for a free-spirited style.","zh":"“bohemians”通常指生活方式不拘一格、偏文艺的那群人；也可指波希米亚地区的人。“bohemian”还可作形容词，表示自由随性、艺术气质的风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People (often artists or writers) who live in an unconventional way, not following typical social rules, especially in dress, work, or lifestyle.","zh":"（常指艺术家、作家等）生活方式不拘一格、不太遵循主流社会规范的人，尤指穿着、工作或生活态度较“随性/另类”的人。"},"examples":[{"en":"In the 1920s, many bohemians gathered in cafés to talk about art and politics.","zh":"在20世纪20年代，许多波希米亚式的人常聚在咖啡馆里谈论艺术和政治。"},{"en":"She moved downtown and made friends with bohemians who painted, played music, and lived cheaply.","zh":"她搬到市中心后，结识了一群画画、玩音乐、过简朴生活的“波希米亚人”。"}]},{"partOfSpeech":"n.","definition":{"en":"People from Bohemia, a historical region in today’s Czech Republic.","zh":"波希米亚地区的人（波希米亚是历史地名，大致位于今天的捷克）。"},"examples":[{"en":"The museum has folk costumes worn by Bohemians in the 1800s.","zh":"博物馆里有19世纪波希米亚人穿的民俗服饰。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a free-spirited, artistic, or unconventional style.","zh":"（风格）自由随性、艺术气质浓、带点不按常规的。"},"examples":[{"en":"The room had a bohemian feel, with colorful rugs and handmade lamps.","zh":"这个房间很有波希米亚风：彩色地毯、手工灯具到处都是。"},{"en":"He’s known for his bohemian fashion—loose shirts, scarves, and vintage jewelry.","zh":"他以波希米亚风穿搭出名——宽松衬衫、围巾和复古首饰。"}]}],"synonyms":["free spirits","artists","nonconformists","avant-garde"],"phonetic":"/boʊˈhiːmiən/","extraExplanation":["“bohemian/Bohemian”有两个常见来源：一是地理意义上的“波希米亚（Bohemia）”，二是文化意义上的“波希米亚式生活”。后者在19世纪的欧洲（尤其巴黎）常用来指艺术圈里不太受传统规矩束缚、重视创作与自由的人。","拼写与大小写小提示：小写 bohemian 多指“放荡不羁/文艺范”的生活方式或风格；大写 Bohemian 更容易指“波希米亚地区的（人/事物）”。"]}
{"word":"bohemias","summary":{"en":"“Bohemias” usually means multiple references to the region Bohemia; less commonly, it can mean different bohemian-style artistic communities.","zh":"“Bohemias”通常指对“波希米亚（Bohemia）”这一地区的复数提法；较少情况下，也可指不同城市里的“波希米亚式”文艺社群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of Bohemia: a historical region in central Europe (now mostly in the Czech Republic).","zh":"Bohemia 的复数：中欧的一个历史地区（如今主要位于捷克共和国境内）。"},"examples":[{"en":"Medieval maps often showed different Bohemias under changing borders.","zh":"中世纪地图常常在国界变动下标出不同的“波希米亚地区”（Bohemias）。"},{"en":"Some history books compare the Bohemias of different centuries.","zh":"一些历史书会比较不同时期的波希米亚（Bohemias）。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) different places or communities imagined as “Bohemias,” meaning areas associated with bohemian (artistic, unconventional) life.","zh":"（较少见）不同的“Bohemia 式”地方或社群：指与波希米亚式（艺术家、非传统）的生活方式相关的区域。"},"examples":[{"en":"Writers sometimes speak of the city’s many Bohemias—cafés, studios, and late-night clubs.","zh":"作家有时会说这座城市有许多“波希米亚圈子”（Bohemias）——咖啡馆、工作室和深夜俱乐部。"},{"en":"They moved between the Bohemias of Paris and New York.","zh":"他们在巴黎和纽约的“波希米亚社群”（Bohemias）之间辗转。"}]}],"synonyms":["Bohemia (plural use)","bohemian communities"],"phonetic":"/boʊˈhiːmiəz/","extraExplanation":["“Bohemia”原本是地名，常译“波希米亚”，历史上属于神圣罗马帝国的一部分，如今大致对应捷克西部。","英语里 bohemian（波希米亚式的）后来引申为“艺术家气质、生活不拘一格”的意思，因此复数 Bohemias 有时会被借用来指不同城市里的“文艺圈/艺术社区”。"]}
{"word":"bohemium","summary":{"en":"“Bohemium” is not a standard English word; it’s usually a misspelling of “Bohemian,” or a fictional element name in creative works.","zh":"“bohemium”不是标准英语词；通常是“bohemian”的拼写错误，或在文学/游戏中虚构的元素名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard spelling; most often a misspelling of “Bohemian” (relating to Bohemia, or to an artistic, unconventional lifestyle).","zh":"非标准拼写；最常见是把“Bohemian（波希米亚的；放浪艺术家式的）”拼错了。"},"examples":[{"en":"I couldn’t find “bohemium” in the dictionary—did you mean “Bohemian”?","zh":"我在词典里找不到“bohemium”——你是不是想写“Bohemian”？"},{"en":"She loves Bohemian fashion: flowy skirts and handmade jewelry.","zh":"她喜欢波希米亚风：飘逸的裙子和手工饰品。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare/fictional) A made-up name for a chemical element in stories or games; not an official chemical element name.","zh":"（罕见/虚构）故事或游戏里捏造的化学元素名称；并非官方元素名。"},"examples":[{"en":"In the novel, bohemium powers the airships.","zh":"在小说里，bohemium为飞艇提供动力。"}]}],"synonyms":["Bohemian (likely intended)","free-spirited (for the lifestyle sense)","artistic (for the lifestyle sense)"],"phonetic":"/boʊˈhiːmiəm/","extraExplanation":["“Bohemian”既可以指中欧历史地区“Bohemia（波希米亚）”的，也常指一种文化气质：更自由、不拘一格、偏艺术家式的生活方式与穿搭风格。若你想表达这种意思，正确拼写通常是 bohemian。","如果你原本想写化学元素：目前官方元素表里没有“bohemium”。有些人会把真实元素名（例如 bohrium，符号 Bh）或“Bohemian”混淆。"]}
{"word":"Bohemization","summary":{"en":"Bohemization means the process of becoming (or making something) more bohemian in style, or—less commonly—making something more Bohemian/Czech in culture or identity.","zh":"Bohemization 指“波希米亚化”的过程：常指风格/生活方式更艺术、更不拘一格；较少见时也指历史政治语境中的“波希米亚/捷克化”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of becoming “bohemian,” or of making someone/something more bohemian in style or lifestyle (artistic, unconventional, free-spirited).","zh":"（生活方式或风格）“波希米亚化”的过程；变得更具艺术家气质、更不拘一格、更自由随性。"},"examples":[{"en":"After moving to the arts district, his friends joked about his bohemization.","zh":"搬到艺术区后，朋友们开玩笑说他被“波希米亚化”了。"},{"en":"The café’s bohemization showed in its mismatched chairs, live poetry nights, and indie music.","zh":"这家咖啡馆的“波希米亚化”体现在：椅子风格不一、举办诗歌之夜、播放独立音乐。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical/political) the process of making a place, institution, or population more Bohemian/Czech in language, culture, or identity.","zh":"（历史/政治）使某地、机构或群体在语言、文化或身份认同上更“波希米亚/捷克化”的过程。"},"examples":[{"en":"Some historians discuss bohemization policies in schools and local administration.","zh":"一些历史学者会讨论在学校和地方行政中的“波希米亚/捷克化”政策。"},{"en":"In that period, bohemization was linked to debates over language rights and national identity.","zh":"在那个时期，“波希米亚/捷克化”与语言权利和民族认同的争论相关。"}]}],"synonyms":["bohemianization","bohemianism (related idea)","cultural assimilation (in historical sense)"],"phonetic":"ˌboʊhəˌmaɪˈzeɪʃən","extraExplanation":["“Bohemization”并不是日常高频词，更常见的表达是 bohemianization（更口语/更常见的拼法）或 become more bohemian。","bohemian（波希米亚式的）在英语里常指“艺术家式、反传统的生活方式”，不一定与捷克的波希米亚地区直接相关；但在历史/政治语境中，Bohemian/Bohemia 确实指中欧的波希米亚地区（今天主要在捷克境内）。","构词：Bohemian/Bohemia + -ize（使……化）+ -ation（名词化），表示“……化的过程”。"]}
{"word":"bohereen","summary":{"en":"“Bohereen” means a narrow Irish country lane.","zh":"“bohereen”指（爱尔兰）乡间的狭窄小路。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a narrow country lane (an Irish-English word, from Irish Gaelic).","zh":"（爱尔兰英语）乡间小路、窄巷（源自爱尔兰盖尔语的外来词）。"},"examples":[{"en":"We turned off the main road and followed a quiet bohereen between the fields.","zh":"我们从主路拐下去，沿着田野间一条安静的乡间小路走。"},{"en":"The cottage sits at the end of a bohereen, far from the town.","zh":"那间小屋在一条窄巷的尽头，离小镇很远。"}]}],"synonyms":["lane","country lane","byway","narrow road"],"phonetic":"/boʊˈriːn/","extraExplanation":["“bohereen”常被视为爱尔兰词bóithrín（意为“小路/小道”）的英语拼写形式之一，也可见到bohereen/bohereen/boithrin等不同写法。","这个词常出现在描写爱尔兰乡村风景的语境中；比起一般的“road”，它更强调“狭窄、安静、乡野”的感觉。"]}
{"word":"Bohi","summary":{"en":"Bohi is most commonly used as a name; it is also sometimes a misspelling/variant of “bodhi” (awakening in Buddhism).","zh":"Bohi 最常见是作为名字使用；有时也被用作 “bodhi（菩提，觉悟）” 的误拼或变体。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a personal name (given name or surname); also used as a place or brand name in some contexts","zh":"人名（名或姓）；在某些语境中也可作地名或品牌名"},"examples":[{"en":"Bohi is my classmate in math.","zh":"Bohi 是我数学课的同学。"},{"en":"I saw the name Bohi on the sign outside the café.","zh":"我在咖啡馆外面的招牌上看到了 Bohi 这个名字。"}]},{"partOfSpeech":"other","definition":{"en":"(often a spelling variant) intended meaning: “bodhi,” the Buddhist term for awakening/enlightenment","zh":"（常见为拼写变体）常指 “bodhi（菩提）”，佛教中“觉悟 / 开悟”的意思"},"examples":[{"en":"The tattoo was meant to say “bodhi,” but it was written as “Bohi.”","zh":"那个纹身本来想写“bodhi（菩提）”，但写成了“Bohi”。"},{"en":"In Buddhism, bodhi refers to awakening or enlightenment.","zh":"在佛教中，bodhi（菩提）指觉悟或开悟。"}]}],"synonyms":["(name) —","(related) bodhi"],"phonetic":"ˈboʊhi","extraExplanation":["“Bohi”在英语里并不是一个非常固定的词汇形式，最常见的是作为专有名词（人名/店名/地名）。如果你想查的是佛教相关的“菩提”，标准拼写通常是 **bodhi**（常见于短语 *Bodhi tree* 菩提树）。","发音会因个人或品牌选择而不同；若你是指特定人物/地点/作品里的 Bohi，我可以根据上下文给出更准确的释义与用法。"]}
{"word":"bohireen","summary":{"en":"“bohireen” isn’t a recognized English word; it’s likely a misspelling or a proper name.","zh":"“bohireen”不是标准英语词；很可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a name/term from another language.","zh":"不是标准英语单词；可能是拼写错误，或是来自其他语言的人名/术语。"},"examples":[{"en":"I can’t find “bohireen” in an English dictionary—could you check the spelling?","zh":"我在英文词典里找不到“bohireen”——你能确认一下拼写吗？"},{"en":"Did you mean “Bahrain” or “coherent”?","zh":"你是不是想写“Bahrain（巴林）”或“coherent（连贯的）”？"}]}],"extraExplanation":["“bohireen”在常见英语词典中没有收录。它可能是：1）拼写错误（如 Bahrain/巴林，coherent/连贯的，或某个专有名词）；2）人名、地名、网名；3）其他语言的音译。","你可以补充：它出现在哪一句话里（上下文）？或者你想表达的中文意思是什么？我就能更准确地帮你定位正确单词并解释用法。"]}
{"word":"Bohlen","summary":{"en":"“Bohlen” is most commonly a surname; it can also mean “wooden planks” in German-derived contexts.","zh":"“Bohlen”最常见的是姓氏；在源自德语的语境中也可指“木板/厚木板”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname) used in English and German contexts.","zh":"（姓氏）“Bohlen”，常见于英语与德语语境中的人名/家族名。"},"examples":[{"en":"Dieter Bohlen is a well-known German music producer and TV judge.","zh":"Dieter Bohlen 是德国知名的音乐制作人和电视评委。"},{"en":"Ms. Bohlen will speak at the conference tomorrow.","zh":"Bohlen 女士将于明天在会议上发言。"}]},{"partOfSpeech":"n.","definition":{"en":"(from German) wooden planks or thick boards, especially used for building or temporary walkways.","zh":"（源自德语）木板、厚木板（常用于施工或临时栈道等）。"},"examples":[{"en":"Workers laid down wooden planks to make a safe path.","zh":"工人们铺上木板，做出一条安全的通道。"},{"en":"The floor was covered with thick boards during construction.","zh":"施工期间，地面铺着厚木板。"}]}],"synonyms":["(planks sense) boards","(planks sense) planks"],"phonetic":"/ˈboʊlən/","extraExplanation":["“Bohlen”更常见的是姓氏；作为“木板”的意思主要来自德语：单数是“Bohle”，复数是“Bohlen”。在英语里通常不会把它当作常用词使用，更多出现在德语相关文本、工程/历史材料或特定语境中。"]}
{"word":"Bohlin","summary":{"en":"Bohlin is most commonly a surname (a family name) and may appear in company or organization names.","zh":"Bohlin 最常见是姓氏（人名），也可能出现在公司或机构名称中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), used for people; it is also used in some company and place names.","zh":"姓氏（人名）；也常见于公司名或地名等专有名词中。"},"examples":[{"en":"Dr. Bohlin published a paper on environmental policy.","zh":"博林博士发表了一篇关于环境政策的论文。"},{"en":"She met a designer named Bohlin at the conference.","zh":"她在会议上认识了一位叫博林的设计师。"}]}],"synonyms":["(no direct synonyms; it is a proper name)"],"phonetic":"/ˈboʊlɪn/","extraExplanation":["“Bohlin”多见于北欧（尤其瑞典）背景的姓氏，也常被英语世界直接沿用为人名拼写。作为专有名词时通常首字母大写。","在真实语境中你可能会看到它出现在机构或品牌名称里（如建筑事务所、工程公司等），这类用法一般仍按“名字/名称”理解。"]}
{"word":"Bohm","summary":{"en":"Bohm usually refers to physicist David Bohm or to ideas connected with him (Bohmian mechanics).","zh":"Bohm 通常指物理学家大卫·玻姆，或指与他相关的理论（如玻姆力学）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A surname; most commonly refers to David Bohm (1917–1992), an American physicist known for work in quantum theory and the “Bohmian” (pilot-wave) interpretation of quantum mechanics.","zh":"（专有名词）一个姓氏；最常指美国物理学家大卫·玻姆（David Bohm，1917–1992），以量子理论研究及“玻姆式”（导引波/领航波）量子力学解释而闻名。"},"examples":[{"en":"In class, we briefly discussed Bohm and his pilot-wave theory.","zh":"课上我们简单讨论了玻姆以及他的导引波理论。"},{"en":"Some philosophers of science mention Bohm when comparing different interpretations of quantum mechanics.","zh":"一些科学哲学家在比较量子力学的不同解释时会提到玻姆。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Adjective) Related to David Bohm or his ideas, especially “Bohmian mechanics.”","zh":"（形容词）与玻姆或其思想有关的，尤指“玻姆力学/玻姆式量子力学”。"},"examples":[{"en":"A Bohmian approach tries to describe particle motion with definite trajectories.","zh":"玻姆式方法尝试用确定的轨迹来描述粒子运动。"},{"en":"She wrote a short paper on Bohmian mechanics for her seminar.","zh":"她为研讨课写了一篇关于玻姆力学的短论文。"}]}],"synonyms":["David Bohm","Bohmian"],"phonetic":"/boʊm/","extraExplanation":["“Bohm”在英语里通常读作 /boʊm/，在中文语境中常译为“玻姆”。","玻姆与“隐变量”“导引波（pilot-wave）”“量子诠释（interpretations of quantum mechanics）”等话题经常一起出现；因此在学术写作里，你会看到 Bohmian mechanics、Bohm interpretation 等搭配。"]}
{"word":"Bohman","summary":{"en":"Bohman is most commonly used as a surname (a family name).","zh":"Bohman 最常见的用法是姓氏（家族名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname); a proper noun used to identify a person or family.","zh":"（姓氏）博曼；用于指代某个人或家族的专有名词。"},"examples":[{"en":"Ms. Bohman will lead the meeting this afternoon.","zh":"博曼女士将主持今天下午的会议。"},{"en":"I met Dr. Bohman at the hospital last year.","zh":"我去年在医院认识了博曼医生。"}]}],"phonetic":"/ˈboʊmən/","extraExplanation":["“Bohman”通常作为姓氏使用，在英语语境中属于专有名词，因此一般不翻译含义，只按读音音译为“博曼”。","它在北欧（如瑞典）和德语地区也较常见，可能与当地的姓氏构词有关（例如以职业、地名或家族来源形成的姓氏）。如果你指的是特定人物（如作者、学者或品牌名），可以告诉我上下文，我可以补充更准确的背景信息。"]}
{"word":"Bohme","summary":{"en":"Böhme is a German surname; it may also refer specifically to Jakob Böhme, a notable German mystic and philosopher.","zh":"Böhme是一个德国姓氏；也可特指著名的德国神秘主义者与思想家雅各布·伯默。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a German surname (family name), also written “Boehme” in English when “ö” is not used","zh":"德国姓氏（家族姓），在英语里也常写作“Boehme”（当不使用“ö”时）"},"examples":[{"en":"Her last name is Böhme, spelled B-O-E-H-M-E in the email system.","zh":"她的姓是Böhme，在邮件系统里拼作B-O-E-H-M-E。"},{"en":"Professor Böhme will lead today’s seminar.","zh":"Böhme教授将主持今天的研讨课。"}]},{"partOfSpeech":"n.","definition":{"en":"Jakob Böhme (1575–1624), a German Christian mystic and philosopher whose writings influenced later European thought","zh":"雅各布·伯默（1575–1624），德国基督教神秘主义者与思想家，其著作影响了后来的欧洲思想"},"examples":[{"en":"The lecture briefly introduced Jakob Böhme and his influence on German Romanticism.","zh":"讲座简要介绍了雅各布·伯默及其对德国浪漫主义的影响。"},{"en":"Some readers find Böhme’s writing poetic but difficult.","zh":"一些读者觉得伯默的文字富有诗意，但不太好懂。"}]}],"synonyms":["Boehme","Böhme"],"phonetic":"/ˈboʊmə/","extraExplanation":["“Böhme”里的“ö”在英语环境中常被写成“oe”（Boehme），这是把德语变音符号（umlaut）转写成拉丁字母组合的一种常见方式。","英文里读音通常近似 /ˈboʊmə/（像“BOH-muh”），但德语原音会更接近前圆唇元音“ö”，与英语的“oh”不完全相同。","雅各布·伯默常被归入“基督教神秘主义/神智学传统”（mysticism/theosophy）相关讨论；若在文学或哲学课中遇到他，通常是在谈德国思想史、象征主义语言或宗教经验书写。"]}
{"word":"Bohmerwald","summary":{"en":"Bohmerwald is the German name for the Bohemian Forest, a mountain and forest region on the Czech–German–Austrian border.","zh":"Bohmerwald 是“波希米亚森林”的德语名称，指捷克—德国—奥地利边境的山地与森林地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mountain range and forested region in Central Europe along the border of the Czech Republic, Germany (Bavaria), and Austria; also called the Bohemian Forest.","zh":"中欧的一片山地与森林地区，位于捷克、德国（巴伐利亚）与奥地利交界处；也称“波希米亚森林”。"},"examples":[{"en":"We drove through the Bohmerwald on our way from Bavaria into the Czech Republic.","zh":"我们从巴伐利亚开车去捷克途中穿过了波希米亚森林（Bohmerwald）。"},{"en":"The Bohmerwald is known for its dense woods, hiking trails, and quiet villages.","zh":"波希米亚森林（Bohmerwald）以茂密林地、徒步路线和宁静村庄闻名。"}]}],"synonyms":["Bohemian Forest","Böhmerwald"],"phonetic":"/ˈbøːmɚˌvɑlt/","extraExplanation":["“Bohmerwald”常见于德语语境，对应德语拼写为“Böhmerwald”（带变音符ö）；英文中更常用名称是“Bohemian Forest”。","它属于历史与文化意义很强的边境林区，在德语文学与地方叙事中时常出现；例如奥地利作家阿达尔贝特·施蒂夫特（Adalbert Stifter）的作品中就描写过这一带的自然景观。"]}
{"word":"Bohmian","summary":{"en":"Bohmian usually means “related to David Bohm’s interpretation of quantum mechanics,” especially Bohmian mechanics (pilot-wave theory).","zh":"Bohmian 通常指“与大卫·玻姆及其量子力学解释有关的”，尤指玻姆力学（导引波理论）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the physicist David Bohm, especially to his interpretation of quantum mechanics (Bohmian mechanics / the pilot-wave theory).","zh":"与物理学家大卫·玻姆（David Bohm）有关的；尤指玻姆对量子力学的解释（玻姆力学/导引波理论）。"},"examples":[{"en":"Some researchers study Bohmian mechanics as an alternative way to interpret quantum phenomena.","zh":"一些研究者研究玻姆力学，作为解释量子现象的另一种方式。"},{"en":"In a Bohmian picture, a particle has a definite position guided by a wave.","zh":"在玻姆式（Bohmian）的图景中，粒子有确定的位置，并由波来引导。"}]},{"partOfSpeech":"n.","definition":{"en":"A supporter or user of Bohmian mechanics (less common).","zh":"玻姆力学的支持者或使用者（较少见）。"},"examples":[{"en":"Bohmians argue that quantum randomness may reflect hidden variables rather than pure chance.","zh":"玻姆学派（Bohmians）认为，量子随机性可能反映了隐变量，而不只是纯粹的偶然。"}]}],"synonyms":["pilot-wave (theory)","de Broglie–Bohm (theory)","Bohm’s (interpretation)"],"phonetic":"/ˈboʊmiən/","extraExplanation":["“Bohmian”来自物理学家 David Bohm（1917–1992）的姓氏。日常英语里这个词多出现在物理、哲学与科学史的语境中。","玻姆力学常被称为“pilot-wave theory（导引波理论）”或“de Broglie–Bohm theory（德布罗意—玻姆理论）”，强调粒子轨迹由波函数“导引”。"]}
{"word":"bohmite","summary":{"en":"Boehmite is an aluminum oxyhydroxide mineral found in bauxite.","zh":"Boehmite 指一种存在于铝土矿中的氧氢化铝矿物（勃姆石）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mineral (aluminum oxyhydroxide, AlO(OH)) commonly found in bauxite and used as a source of aluminum or as an industrial material","zh":"勃姆石（化学式 AlO(OH)，氧氢化铝的一种矿物），常见于铝土矿中，可作为铝的原料或工业材料使用"},"examples":[{"en":"Boehmite is one of the minerals that make up bauxite ore.","zh":"勃姆石是构成铝土矿的矿物之一。"},{"en":"The sample contains boehmite along with other aluminum hydroxide minerals.","zh":"该样品含有勃姆石以及其他氢氧化铝类矿物。"}]}],"synonyms":["aluminum oxyhydroxide"],"phonetic":"/ˈboʊmaɪt/","extraExplanation":["“boehmite”通常写作 Boehmite（或 böhmite），名称来自德国矿物学家 Johann Böhm。它与 diaspore（硬水铝石）是同成分的不同晶型，在地质学与材料科学中常用于讨论铝土矿的组成与加工。"]}
{"word":"Bohnenberger","summary":{"en":"Bohnenberger is a German surname, especially associated with the scientist J. G. F. von Bohnenberger and an early “Bohnenberger electroscope.”","zh":"Bohnenberger 是一个德国姓氏，尤其与科学家 J. G. F. von Bohnenberger 以及早期的“Bohnenberger 验电器”相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A German surname, best known from Johann Gottlieb Friedrich von Bohnenberger (1765–1831), a German astronomer and physicist.","zh":"（专有名词）德国姓氏，最常见于 Johann Gottlieb Friedrich von Bohnenberger（1765–1831），一位德国天文学家兼物理学家。"},"examples":[{"en":"In a history of physics class, we read about Bohnenberger and early electrical instruments.","zh":"在物理史课上，我们读到了 Bohnenberger 以及早期的电学仪器。"},{"en":"The lab manual mentions Bohnenberger in connection with an electroscope design.","zh":"实验手册提到 Bohnenberger，并把他与一种验电器的设计联系起来。"}]},{"partOfSpeech":"n.","definition":{"en":"(In science contexts) Short for “Bohnenberger electroscope,” an early electroscope used to detect electric charge.","zh":"（科学语境）“Bohnenberger electroscope（Bohnenberger 验电器）”的简称，用于检测电荷的一种早期验电器。"},"examples":[{"en":"The museum displays a Bohnenberger electroscope next to other nineteenth-century devices.","zh":"博物馆把 Bohnenberger 验电器与其他 19 世纪的仪器一起展出。"},{"en":"Our professor compared the Bohnenberger with the gold-leaf electroscope.","zh":"教授把 Bohnenberger 验电器与金箔验电器作了对比。"}]}],"synonyms":["von Bohnenberger","Bohnenberger electroscope"],"phonetic":"/ˈboʊnənˌbɝɡɚ/","extraExplanation":["Bohnenberger 常见于科学史与仪器史：他与“Bohnenberger 验电器（electroscope）”联系最紧密。验电器是一种用来“检测是否带电、带电强弱或带电符号”的装置，在电学发展早期非常重要。","德语姓氏在英语里通常保留原拼写；在英文资料中也可能写作“von Bohnenberger”。如果你是在论文/教材里看到它，通常指人名或以他命名的仪器。"]}
{"word":"Bohner","summary":{"en":"“Bohner” is mainly used as a surname or a person’s name in English.","zh":"“Bohner”在英语中主要用作姓氏或人名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname (family name), most commonly of German-speaking origin.","zh":"姓氏（家族姓），多见于德语地区背景。"},"examples":[{"en":"Ms. Bohner will lead today’s meeting.","zh":"Bohner 女士将主持今天的会议。"},{"en":"I found an article written by Daniel Bohner.","zh":"我找到了一篇由 Daniel Bohner 撰写的文章。"}]},{"partOfSpeech":"other","definition":{"en":"a fictional or humorous name used for a person in some modern pop-culture contexts.","zh":"在一些现代流行文化语境中，用作虚构或带幽默感的人名。"},"examples":[{"en":"In the show, the neighbor is called Ralph Bohner.","zh":"在那部剧里，邻居叫 Ralph Bohner。"}]}],"phonetic":"/ˈboʊnər/","extraExplanation":["“Bohner”在英语里通常被当作专有名词（姓氏/人名）来使用，因此一般不翻译，只在中文里音译或直接保留拼写。","它常被误看成“boner”（少一个 h），而“boner”在口语里有较粗俗的含义（与性相关），正式场合要避免写错。"]}
{"word":"boho","summary":{"en":"Boho means a relaxed, artistic “bohemian” style, especially in fashion and decor; it can also mean a bohemian person (informal).","zh":"boho 指随性文艺的“波西米亚”风格（常见于穿搭与家居），也可指波西米亚式的人（非正式）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"In a relaxed, artistic, and unconventional style, often associated with free-spirited fashion and decor.","zh":"（风格）波西米亚式的；随性、文艺、带点不拘一格的（常用于穿搭与家居装饰）。"},"examples":[{"en":"She wore a boho dress with flowing fabric and floral patterns.","zh":"她穿了一条波西米亚风的连衣裙，布料飘逸，还有碎花图案。"},{"en":"Their apartment has a boho vibe—plants, handmade art, and warm colors.","zh":"他们的公寓很有波西米亚氛围——绿植、手工艺术品和温暖的色调。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who lives in an artistic, unconventional way; a bohemian (informal).","zh":"过着文艺、非传统生活方式的人；波西米亚人（非正式说法）。"},"examples":[{"en":"In college he was a bit of a boho, always going to poetry readings.","zh":"大学时他有点“波西米亚范儿”，总去参加诗歌朗诵会。"}]}],"synonyms":["bohemian","boho-chic","artsy","free-spirited"],"phonetic":"/ˈboʊhoʊ/","extraExplanation":["“boho”是“bohemian”的口语缩写。现代英语里常指一种审美与生活方式：随性、自然、手作感、民族风元素（如流苏、刺绣、宽松剪裁），也常和“hippie（嬉皮士风格）”“festival style（音乐节穿搭）”等联想在一起。","常见搭配：boho style（波西米亚风格）、boho chic（更精致时髦的波西米亚风）、boho vibe（波西米亚氛围）。写作或正式场合更常用“bohemian”。"]}
{"word":"boho-chic","summary":{"en":"Boho-chic describes a stylish look that blends bohemian, free-spirited elements with a polished, fashionable feel.","zh":"boho-chic 指把波西米亚的随性艺术感与更精致时髦的感觉融合在一起的风格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"A fashion and lifestyle style that mixes “bohemian” (free-spirited, artistic) elements with a polished, stylish look.","zh":"一种把“波西米亚”（随性、艺术感）元素与更精致时髦的穿搭融合在一起的风格与生活方式。"},"examples":[{"en":"She wore a boho-chic dress with a denim jacket and ankle boots.","zh":"她穿了一件波西米亚时髦风的连衣裙，搭配牛仔外套和短靴。"},{"en":"The café’s boho-chic décor uses warm colors, plants, and vintage furniture.","zh":"那家咖啡馆的波西米亚时髦风装潢用暖色调、绿植和复古家具。"}]}],"synonyms":["bohemian style","boho","hippie-chic","festival style"],"phonetic":"/ˈboʊhoʊ ˈʃiːk/","extraExplanation":["“boho”是“bohemian（波西米亚的）”的口语缩写；“chic”来自法语，常指“时髦、雅致”。合在一起的“boho-chic”强调：看起来随性不拘束，但整体依然讲究、有品味。","常见元素：流苏、蕾丝、刺绣、民族图案、宽松长裙、阔腿裤、层叠首饰、宽檐帽、麂皮靴等；颜色多偏大地色、奶油色、酒红或印花。","语域提示：多用于时尚、家居、社交媒体或杂志语境；日常口语里也常直接说“boho”来简化表达。"]}
{"word":"Bohol","summary":{"en":"Bohol is a Philippine island province famous for the Chocolate Hills and tarsiers.","zh":"Bohol 是菲律宾的一座岛屿与省份，以巧克力山和眼镜猴闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a province and island in the Central Visayas region of the Philippines, known for the Chocolate Hills, tarsiers, and coral reefs.","zh":"菲律宾中米沙鄢（Central Visayas）的一座岛屿与省份，以“巧克力山”、眼镜猴和珊瑚礁闻名。"},"examples":[{"en":"We spent three days in Bohol visiting the Chocolate Hills and Panglao Island.","zh":"我们在薄荷岛（Bohol）待了三天，去了巧克力山和邦劳岛（Panglao Island）。"},{"en":"Bohol is a popular destination for diving and beach trips.","zh":"薄荷岛是潜水和海边度假的热门目的地。"}]}],"phonetic":"/boʊˈhoʊl/","extraExplanation":["“Bohol”在英语里通常作为专有名词使用（地名），首字母要大写：Bohol。","常见相关地点/词汇：Panglao（邦劳岛，常与Bohol一起旅游）、Chocolate Hills（巧克力山）、tarsier（眼镜猴）。","在中文语境中常译作“薄荷岛/薄荷省”。若指省份与整座岛，英语里都可以说 “Bohol”。"]}
{"word":"Bohon","summary":{"en":"“Bohon” is usually a proper name (surname/place), not a common English word.","zh":"“Bohon”通常是专有名词（姓氏/地名），不是常见英语单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English vocabulary word; most often used as a proper noun (a family name or a place name).","zh":"不是常见的英语词汇；通常作为专有名词使用（姓氏或地名）。"},"examples":[{"en":"Ms. Bohon will lead today’s meeting.","zh":"Bohon 女士将主持今天的会议。"},{"en":"I saw the name “Bohon” on the guest list.","zh":"我在宾客名单上看到了“Bohon”这个名字。"}]}],"phonetic":"/ˈboʊhɑn/","extraExplanation":["“Bohon”在英语里一般不会当作普通名词/动词来查到，更常见的是姓氏或地名的拼写。若你想查的是某个常用单词，可能是拼写接近的词，比如 **Bourbon**（波本威士忌/波旁王朝）、**Bohun**（历史姓氏）、或其他。你可以告诉我它出现的句子或你想表达的意思，我可以帮你锁定正确词。"]}
{"word":"bohor","summary":{"en":"“Bohor/bohor” is uncommon in general English; it’s usually a proper name or part of the animal name “Bohor reedbuck.”","zh":"“Bohor/bohor”在日常英语中不常见；多为专有名词，或出现在动物名“Bohor reedbuck（波霍芦苇羚）”中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper noun) An uncommon name used as a surname or place name (not a common everyday English word).","zh":"（专有名词）一个不常见的名字，可作姓氏或地名使用（不是常见英语词汇）。"},"examples":[{"en":"Dr. Bohor published a paper on wildlife conservation.","zh":"Bohor 博士发表了一篇关于野生动物保护的论文。"},{"en":"The map labels a small village called Bohor.","zh":"地图上标注了一个叫 Bohor 的小村庄。"}]},{"partOfSpeech":"n.","definition":{"en":"(Noun, zoology) Short for “Bohor reedbuck,” a kind of African antelope.","zh":"（名词，动物学）“Bohor reedbuck（波霍芦苇羚）”的简称，一种非洲羚羊。"},"examples":[{"en":"The guide pointed out a bohor reedbuck near the tall grass.","zh":"向导指给我们看高草旁的一只波霍芦苇羚。"},{"en":"Some articles shorten the name to “bohor,” but “Bohor reedbuck” is clearer.","zh":"有些文章会把名字简称为“bohor”，但写成“Bohor reedbuck”更清楚。"}]}],"synonyms":["Bohor reedbuck (full form)"],"phonetic":"/ˈboʊhɔr/","extraExplanation":["“bohor”在英语里不算常用词，最常见的用法是出现在动物名称“Bohor reedbuck”中；单独写“Bohor/bohor”时，常需要上下文来判断是人名、地名还是动物简称。","如果你本来想查的是拼写相近的词（例如 boor / bore / borough），告诉我你看到它的句子，我可以帮你确认正确单词与意思。"]}
{"word":"bohora","summary":{"en":"“Bohora” is usually a spelling variant of “Bohra,” referring to a Bohra community member (often Dawoodi Bohra), and it can also be a surname.","zh":"“Bohora”通常是“Bohra”的拼写变体，指博赫拉社群成员（常见为达乌迪博赫拉），也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a variant spelling of “Bohra,” referring to a member of the Bohra communities (especially the Dawoodi Bohra), a Muslim community found mainly in India, Pakistan, and East Africa.","zh":"“Bohra”的一种拼写变体，指博赫拉社群（尤指达乌迪博赫拉）的成员；该穆斯林社群主要分布在印度、巴基斯坦及东非等地。"},"examples":[{"en":"Her neighbors are Bohora merchants who moved from Gujarat.","zh":"她的邻居是从古吉拉特搬来的博赫拉商人。"},{"en":"The wedding followed Bohora (Bohra) community customs.","zh":"这场婚礼遵循了博赫拉社群的习俗。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname) used in some South Asian communities; often linked to the Bohra/Bohora community name.","zh":"一种姓氏，见于部分南亚社群；常与“博赫拉/博霍拉”社群名称相关。"},"examples":[{"en":"Mr. Bohora will speak at the community meeting.","zh":"博霍拉先生将出席并在社区会议上发言。"}]}],"synonyms":["Bohra","Dawoodi Bohra","Bohras"],"phonetic":"/boʊˈhɔːrə/","extraExplanation":["“Bohra/博赫拉”常与伊斯玛仪派（Ismaili）中的达乌迪博赫拉（Dawoodi Bohra）相关，但“Bohra”也可指更广泛的博赫拉群体。不同地区与家族会出现拼写差异，如 Bohra、Bohora 等。","在英文语境里，它多作为族群/社群名称或姓氏出现，不算常见普通词汇。若你是在特定文章、名单或历史文本中看到“bohora”，很可能是专有名词的拼写之一。"]}
{"word":"bohorok","summary":{"en":"Bohorok is a place name in North Sumatra, Indonesia (a subdistrict), associated with the Bohorok River and nearby rainforest tourism.","zh":"Bohorok 是印度尼西亚北苏门答腊的地名（一个分区），常与峇荷洛河及周边雨林旅游相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a subdistrict (kecamatan) in Langkat Regency, North Sumatra, Indonesia, known for the Bohorok River and nearby rainforest areas.","zh":"（专有名词）印度尼西亚北苏门答腊省朗卡特县的一个分区（kecamatan），以峇荷洛河（Bohorok River）及周边雨林地区闻名。"},"examples":[{"en":"Bohorok is in North Sumatra, Indonesia.","zh":"Bohorok 位于印度尼西亚北苏门答腊省。"},{"en":"Many travelers pass through Bohorok to reach Bukit Lawang.","zh":"许多旅行者会经过 Bohorok 前往 Bukit Lawang。"}]}],"phonetic":"/ˈboʊhəˌrɑk/","extraExplanation":["Bohorok 常与雨林生态旅游联系在一起，因为它靠近京那巴鲁（不对，正确为）Gunung Leuser National Park（勒瑟山国家公园）一带；附近的 Bukit Lawang 以观察红毛猩猩（orangutan）而出名。","英文里它通常作为地名使用，首字母大写：Bohorok；有时也会出现在“Bohorok River（峇荷洛河）”等地理名称中。"]}
{"word":"Bohr","summary":{"en":"Bohr usually refers to the physicist Niels Bohr, and in science it can also mean the unit of length called the bohr (Bohr radius).","zh":"Bohr 通常指物理学家尼尔斯·玻尔；在科学语境中也可指长度单位 bohr（玻尔半径）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) Niels Bohr (1885–1962), a Danish physicist famous for major contributions to atomic structure and quantum theory. Examples: 1) en: Bohr proposed a model of the atom with electrons in fixed orbits. 2) en: Scientists still discuss Bohr’s ideas in the history of quantum mechanics.","zh":"（专有名词）尼尔斯·玻尔（Niels Bohr，1885–1962），丹麦物理学家，以原子结构与量子理论方面的重要贡献而闻名。例句：1）zh：玻尔提出了电子在固定轨道上运动的原子模型。2）zh：在量子力学史中，人们至今仍会讨论玻尔的思想。"},"examples":[{"en":"Bohr proposed a model of the atom with electrons in fixed orbits.","zh":"玻尔提出了电子在固定轨道上运动的原子模型。"},{"en":"Scientists still discuss Bohr’s ideas in the history of quantum mechanics.","zh":"在量子力学史中，人们至今仍会讨论玻尔的思想。"}]},{"partOfSpeech":"n.","definition":{"en":"(n.) bohr: a scientific unit of length used in atomic physics/chemistry, equal to the Bohr radius (about 0.529 angstrom). Examples: 1) en: The bond length is about 2 bohr. 2) en: In some textbooks, distances are given in bohr rather than angstroms.","zh":"（名词）bohr：原子物理/化学中使用的长度单位，等于“玻尔半径”（约 0.529 埃）。例句：1）zh：这个键长大约是 2 个 bohr。2）zh：有些教材用 bohr 而不是用埃来表示距离。"},"examples":[{"en":"The bond length is about 2 bohr.","zh":"这个键长大约是 2 个 bohr。"},{"en":"In some textbooks, distances are given in bohr rather than angstroms.","zh":"有些教材用 bohr 而不是用埃来表示距离。"}]}],"synonyms":["Niels Bohr","Bohr model","Bohr radius"],"phonetic":"/bɔr/","extraExplanation":["“Bohr”常见于科学史与物理化学语境：如 Bohr model（玻尔模型）、Bohr radius（玻尔半径）、Bohr atom（玻尔原子）。","发音在美式英语里常与“bore”同音（/bɔr/）。","文化/历史补充：玻尔在哥本哈根学派与“互补性原则（complementarity）”方面也很有影响；他参与推动量子理论早期的发展。"]}
{"word":"Bohra","summary":{"en":"Bohra: a member of a South Asian Muslim community, often referring to the Dawoodi Bohras.","zh":"Bohra：南亚穆斯林社群成员，常指达乌迪博赫拉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Bohra communities, especially a Gujarati-speaking Muslim trading community in India and Pakistan; often refers to the Dawoodi Bohras (a Shia Ismaili group).","zh":"“Bohra（博赫拉）”社群的成员；多指印度、巴基斯坦以古吉拉特语为主、传统从商的穆斯林社群；在许多语境中常特指“Dawoodi Bohras（达乌迪博赫拉）”（什叶派伊斯玛仪派的一支）。"},"examples":[{"en":"Many Bohras have a long tradition of business and trade.","zh":"许多博赫拉人有悠久的经商与贸易传统。"},{"en":"She belongs to the Dawoodi Bohra community in India.","zh":"她属于印度的达乌迪博赫拉社群。"},{"en":"The restaurant is run by a Bohra family from Gujarat.","zh":"这家餐馆由一个来自古吉拉特邦的博赫拉家庭经营。"}]}],"synonyms":["Dawoodi Bohra","Bohra community member"],"phonetic":"ˈboʊrə","extraExplanation":["“Bohra”在英语里通常是专有名词/族群名，用来指特定的南亚穆斯林社群；具体指哪一支（如Dawoodi Bohra、Alavi Bohra等）要看上下文。","在新闻或社科文章中常见搭配：Bohra community（博赫拉社群）、Dawoodi Bohra（达乌迪博赫拉）、Bohra merchant/trader（博赫拉商人）。"]}
{"word":"Bohras","summary":{"en":"Bohras are members of the Bohra community (often the Dawoodi Bohra group) in South Asia.","zh":"Bohras 指博赫拉社群成员（常指达乌迪·博赫拉派），主要分布在南亚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plural form of Bohra: members of a Muslim community in South Asia, especially the Dawoodi Bohra group, known historically for trade and business.","zh":"Bohra 的复数：南亚的一个穆斯林社群成员（尤以达乌迪·博赫拉派 Dawoodi Bohra 为代表），历史上常与经商、贸易传统相关。"},"examples":[{"en":"Many Bohras in Mumbai run small family businesses.","zh":"孟买的许多博赫拉人经营着小型家族生意。"},{"en":"The documentary features Bohras discussing their community traditions.","zh":"这部纪录片采访了博赫拉人，谈论他们的社群传统。"}]}],"synonyms":["Bohra people","the Bohra community","Dawoodi Bohras"],"phonetic":"/ˈboʊrəz/","extraExplanation":["“Bohra/Bohras”多指印度与巴基斯坦一带的一个穆斯林社群名称，并非泛指所有穆斯林。最常见的用法是指什叶派伊斯玛仪派（Isma'ili）中的“Dawoodi Bohra（达乌迪·博赫拉）”。","英文里有时会把它当作族群/社群名来用：单数 Bohra，复数 Bohras；也可作形容词用法（如 “Bohra community / Bohra tradition”）。在写作中建议首字母大写，以表示专有名词。","不同地区与语境中，“Bohra”可能也被更宽泛地用于指某些商人群体或社群分支；若在学术或新闻写作中，最好注明具体分支（例如 Dawoodi Bohra）以避免误解。"]}
{"word":"Bohrer","summary":{"en":"“Bohrer” is a German word meaning a drill/borer, and it can also be a German surname.","zh":"“Bohrer”是德语词，意思是“钻头/钻孔器”，也可以是德语姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(German) a drill or borer; a tool used to make holes in wood, metal, etc.","zh":"（德语）钻头；钻孔器；用来在木材、金属等材料上钻孔的工具。"},"examples":[{"en":"In German, “Bohrer” usually means a drill bit or a drilling tool.","zh":"在德语里，“Bohrer”通常指钻头或钻孔工具。"},{"en":"He bought a new Bohrer to make holes in the wall.","zh":"他买了一个新的钻头来在墙上打孔。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname), especially in German-speaking countries.","zh":"姓氏（家族名），在德语国家较常见。"},"examples":[{"en":"Bohrer is also used as a last name in Germany and Switzerland.","zh":"Bohrer 也用作德国和瑞士等地的姓氏。"}]}],"synonyms":["drill","drill bit","borer","auger"],"phonetic":"/ˈbɔrər/","extraExplanation":["“Bohrer”来自德语动词“bohren”（钻、打孔）。在日常德语中，它既可以指“钻头/钻孔器”，也常用在复合词里，比如“Zahnbohrer”（牙科钻头）。","如果你是在英语语境（如论文、目录、工具清单）里看到“Bohrer”，通常是在保留德语术语，或是作为人名出现；英文里更常用 drill / drill bit 来表达。"]}
{"word":"Bohs","summary":{"en":"“Bohs” usually means either (1) informal “bohemians” (unconventional, artsy people) or (2) the Irish football club Bohemian F.C.","zh":"“Bohs”通常有两种用法：(1) 口语指“波希米亚派的人/不拘一格的人”，或 (2) 指爱尔兰足球俱乐部 Bohemian F.C.（波希米亚人队）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Informal plural form of “boh,” meaning bohemians—people (often artists or writers) who live in an unconventional, non-traditional way.","zh":"“boh”的非正式复数，用来指“波希米亚人/波西米亚派的人”——常指艺术家、作家等以不拘一格、非传统方式生活的人。"},"examples":[{"en":"In the 1960s, the neighborhood attracted poets and other bohs.","zh":"在20世纪60年代，这个社区吸引了诗人和其他“波希米亚派的人”。"},{"en":"They dressed like bohs and spent evenings talking about art.","zh":"他们穿得很“波希米亚”，晚上常聊艺术。"}]},{"partOfSpeech":"n.","definition":{"en":"A nickname for Bohemian F.C., a professional football (soccer) club in Ireland.","zh":"爱尔兰职业足球俱乐部 Bohemian F.C.（波希米亚人队）的昵称。"},"examples":[{"en":"I’m going to watch the Bohs play tonight.","zh":"我今晚要去看 Bohs（波希米亚人队）比赛。"},{"en":"The Bohs won 2–1 at home.","zh":"Bohs 在主场以 2 比 1 获胜。"}]}],"synonyms":["bohemians","Bohemian F.C."],"phonetic":"/boʊz/","extraExplanation":["“Bohs”在不同语境里意思差别很大：在一般英文里更像是“bohemians”的口语缩写；但在爱尔兰（尤其都柏林）很常见的是指 Bohemian F.C. 球迷、媒体也常这样称呼球队。","“bohemian/Bohemian”原本与中欧历史地区“波希米亚（Bohemia）”有关，后来在英语文化里发展出“艺术气质、反传统生活方式”的含义。"]}
{"word":"Bohun","summary":{"en":"Bohun is mainly used as an English surname, and historically it refers to the medieval House of Bohun, a notable noble family in England.","zh":"Bohun主要用作英格兰姓氏；在历史语境中也指中世纪英格兰的重要贵族家族“博恩家族”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname) of English origin.","zh":"一个英格兰来源的姓氏（家族姓）。"},"examples":[{"en":"Her last name is Bohun, and her family traces roots to England.","zh":"她姓Bohun，据说家族根源可追溯到英格兰。"},{"en":"Mr. Bohun will join the meeting at 3 p.m.","zh":"Bohun先生会在下午三点参加会议。"}]},{"partOfSpeech":"n.","definition":{"en":"(history) the House of Bohun: a powerful Anglo-Norman noble family in medieval England, associated with titles such as Earl of Hereford.","zh":"（历史）博恩家族（House of Bohun）：中世纪英格兰重要的盎格鲁-诺曼贵族家族，与赫里福德伯爵等头衔有关。"},"examples":[{"en":"The House of Bohun played an important role in medieval English politics.","zh":"博恩家族在中世纪英格兰政治中扮演了重要角色。"},{"en":"In some history books, Bohun appears alongside other great noble families.","zh":"在一些历史书里，Bohun会与其他大贵族家族一起被提到。"}]}],"synonyms":["(surname)","(House of Bohun)"],"phonetic":"/ˈboʊhʌn/","extraExplanation":["“Bohun”多见于历史或姓氏语境，日常英语里不算常用词。作为专有名词，通常首字母大写（Bohun）。","发音上常被读作“BOH-hun”，重音在第一音节。","历史上“House of Bohun（博恩家族）”在12–14世纪的英格兰非常有影响力，常与封建贵族、头衔继承、王室政治等主题一起出现。"]}
{"word":"bohunk","summary":{"en":"“Bohunk” is a dated, offensive slur for Central/Eastern European (especially Slavic) immigrants.","zh":"“bohunk”是一个过时且冒犯性的种族贬称，用来侮辱中欧/东欧（尤指斯拉夫）移民。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(offensive, dated) A derogatory ethnic slur for immigrants (or descendants of immigrants) from Central or Eastern Europe, especially Slavic people.","zh":"（冒犯性、过时）对中欧或东欧移民（及其后代）的贬称/种族侮辱性称呼，尤指斯拉夫人。"},"examples":[{"en":"The novel shows how some workers used the word “bohunk” to insult Eastern European immigrants.","zh":"这部小说展示了有些工人如何用“bohunk”去侮辱东欧移民。"},{"en":"Please avoid that term—it’s an ethnic slur.","zh":"请避免使用这个词——它是带有种族侮辱性的贬称。"}]}],"synonyms":["ethnic slur (offensive)","derogatory term (offensive)"],"phonetic":"ˈboʊhʌŋk","extraExplanation":["这个词多被认为由“Bohemian（波希米亚的）”和“Hunk/Hungarian（匈牙利人）”等成分混杂而来，20世纪初在美国社会（如矿区、工厂）中用于贬低中东欧移民，带有明显歧视色彩。","现代英语中应避免使用；若在阅读历史文本或文学作品中遇到，通常只在“引用/讨论该词的冒犯性”时出现。"]}
{"word":"bohunks","summary":{"en":"“Bohunks” is an offensive ethnic slur once used in the U.S. for Central/Eastern European immigrants.","zh":"“bohunks”是一个冒犯性的种族蔑称，曾在美国用来贬低中东欧移民。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(offensive slur) A derogatory word for immigrants from Central or Eastern Europe (especially Slavic people), used in the U.S., mainly in the early 1900s.","zh":"（冒犯性蔑称）在美国使用的侮辱性词语，用来贬低来自中欧或东欧的移民（尤其是斯拉夫人），多见于20世纪初。"},"examples":[{"en":"That word is an ethnic slur—please don’t use it.","zh":"那个词是种族蔑称——请不要使用。"},{"en":"In some older novels, characters use this term to show prejudice against immigrants.","zh":"在一些较早的小说里，人物会用这个词来表现对移民的偏见。"}]}],"synonyms":["ethnic slur","derogatory term","pejorative"],"phonetic":"/ˈboʊ.hʌŋk/","extraExplanation":["“bohunk(s)”通常被认为由“Bohemian（波希米亚人/捷克一带）”与“hunk（当时对匈牙利人或中东欧移民的贬称）”等元素混合而来；历史上常见于工厂、矿区等移民劳工语境。","这是带有歧视色彩的旧式用语。学习时了解其历史意义即可；现实交流中应避免使用，可改用更中性的说法，如“Central/Eastern European immigrants（中东欧移民）”或具体国籍/族群名称。"]}
{"word":"Bohuslav","summary":{"en":"Bohuslav is a Czech/Slavic male first name, often seen in Czech names.","zh":"Bohuslav 是一个捷克/斯拉夫语系的男性名字，常见于捷克人的姓名中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name of Slavic (especially Czech) origin; in English it is most often seen in the names of Czech people (for example, composers and writers).","zh":"（男性名）斯拉夫语系（尤指捷克语）来源的男子名；英文里多见于捷克人的姓名中（如作曲家、作家等）。"},"examples":[{"en":"Bohuslav is a traditional Czech first name.","zh":"Bohuslav 是一个传统的捷克名字。"},{"en":"The composer Bohuslav Martinů wrote many orchestral works.","zh":"作曲家 Bohuslav Martinů 创作了许多管弦乐作品。"}]}],"phonetic":"/ˈboʊhʊˌslɑːv/","extraExplanation":["这是一个常见于捷克语/斯洛伐克语文化圈的人名，通常拆解为 **Bohu-**（与“上帝/神”有关，源自 *Bůh*） + **-slav**（“荣耀/名声”，常见于 Slavic 名字如 Miroslav、Václav 等）。整体含义常被解释为“神的荣耀/因神而荣耀”。","英语里它多作为专有名词使用，一般不翻译含义，而是按音译或保留原名。较知名的使用者包括捷克作曲家 **Bohuslav Martinů**。"]}

